{
  "author": "lunargrover",
  "the_new_excerpt": "The answer to all of those lofty expectations? Impossible. This is a mistake a\nlot of people are making. You have to look at total supply and multiply it by\nprice per coin to get the market cap. Let’s look at a few popular ones…\n\nBitcoin is rare like gold, difficult to mine like gold and is used as…",
  "original_created_utc": 1620266460,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "その期待に応えるためには？不可能です。これは多くの人が犯している間違いです。\nこれは多くの人が犯している間違いです。総供給量を見て、それに1コインあたりの価格を掛けて、時価総額を求めなければなりません。\nコイン1枚あたりの価格を掛け合わせて時価総額を求めます。いくつかの人気のあるものを見てみましょう...。\n\nビットコインは金のように希少で、金のように採掘するのが難しく、そして...",
      "title": "DOGEは1コイン100ドルの価値になるのか？ETHと同じくらいの規模になることはできますか？Stellar Lumensは1コイン1000ドルの価値があるでしょうか？Safemoonは私を金持ちにしてくれるだろうか？私たちは皆、総供給量と時価総額を比較して期待値を管理し、可能性についてより論理的に考える必要があります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所有这些崇高的期望的答案是什么？不可能。这是一个错误\n很多人都在犯这个错误。你必须看一下总的供应量，然后将其乘以\n每个币的价格来得到市值。让我们看一下几个流行的...\n\n比特币像黄金一样稀有，像黄金一样难以开采，被用作...",
      "title": "DOGE会值100美元一个币吗？它能变得像ETH一样大吗？Stellar Lumens能值1000美元一个币吗？Safemoon会让我发财吗？我们都需要看看总供应量与市值，以管理我们的期望，并对可能发生的事情更有逻辑性。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所有這些崇高的期望的答案是什麼？不可能。這是一個錯誤\n很多人都在犯這個錯誤。你必須看一下總的供應量，然後將其乘以\n每個幣的價格來得到市值。讓我們看一下幾個流行的...\n\n比特幣像黃金一樣稀有，像黃金一樣難以開採，被用作...",
      "title": "DOGE會值100美元一個幣嗎？它能變得像ETH一樣大嗎？Stellar Lumens能值1000美元一個幣嗎？Safemoon會讓我發財嗎？我們都需要看看總供應量與市值，以管理我們的期望，並對可能發生的事情更有邏輯性。"
    }
  ],
  "title": "Will DOGE be worth $100 a coin? Can it become as big as ETH? Could Stellar Lumens be worth $1000 a coin? Will Safemoon make me rich?? We all need to look at total supply vs market cap to manage our expectations and be more logical about what is possible.",
  "created_utc": 1620276405,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The answer to all of those lofty expectations? Impossible. This is a mistake a lot of people are making. You have to look at total supply and multiply it by price per coin to get the market cap. Let’s look at a few popular ones…</p>\n\n<p>Bitcoin is rare like gold, difficult to mine like gold and is used as a store of value like gold. As it becomes more scarce, it will continue to rise in price. It has a total supply of 21 million, of which 18 million are already circulating. After the 21 million are mined, there will be no more available. 18 million x $57k means it has a market cap of over a trillion dollars. That is huge. The total market cap for ALL crypto is 2.38 trillion. Bitcoin is king. Bigger than Visa and MasterCard combined. Bigger than nearly every world bank. It is the world’s 3rd largest currency. </p>\n\n<p>Ethereum has a total supply of 115 million. More coins than Bitcoin. At the moment, it allows for 18 million to be mined each year max. In July, they are making a change with the London Hardfork, EIP 1559, and every time a transaction is made with ETH, the ETH fees will be burned, making the supply more limited and much more valuable, similar to BTC. Many are saying that ETH will go up to $10k per coin this year because of these changes. When ETH 2.0 is released next year, the price will probably go much higher. With 115 million in circulation, ETH has a market cap of $400 billion. That’s worth more than all of Walmart. </p>\n\n<p>So, it is really important to check the coin supply and then multiply that by the price you wish it would go to to make you rich. See if the amount seems realistic or not. </p>\n\n<p>Let’s look at DOGE. Doge has a total supply of 127 billion coins and a max of 10,000 are mined each day [EDIT: DOGE mints 10,000\ncoins every <em>minute</em>, not every day!]. That’s an additional 5 billion coins each year. If you multiply 127 billion coins the $100 you wish it were per coin, it would have a market cap of $12.7 trillion dollars. There is $37 trillion dollars in the world. Is DOGE worth 1/3 of all the money in the world? The entire economy of the United States is $25.3 trillion. Is it realistic to say a meme coin is worth roughly half the US economy…the largest economy in the world?</p>\n\n<p>Let’s take a look at Stellar Lumens. The max supply is $50 billion. The supply increase is 500 million a year, which alone is 23 times the total amount of BTC each year. Anyway, if it were $1000 per coin, the total market cap would be $50 trillion, more than double the US economy. At the very most, maybe they could be $10 each? I say it could be worth $10 because it has actual utility. I think DOGE would top out at $1, and that would be pretty crazy. </p>\n\n<p>If DOGE were worth as much as ETH, which I’ve seen people on the doge subreddit think might happen, Doge would be worth a modest $388,720,000,000,000. $388 trillion. That’s at least 3 times all the money in the world economy, if Google serves me right.</p>\n\n<p>Then you have to be really careful of coins that are just a rug pull and get promoted on Tik-Tok, like Safemoon. I don’t even need to do the math on Safemoon to know it’s a scam. They will get people to throw all their money into it and then they cash out their supply and take everyone’s money. The total supply for Safemoon is 1 quadrillion coins!!! Stay away from that. Insanity. </p>\n\n<p>Look at supply of successful coins beyond BTC and ETH and see if you think they could be worth a lot more in the future. Here are some I think worth investing in:</p>\n\n<p>Polkadot (DOT): Total supply: 935.5 million, total supply 1 billion</p>\n\n<p>Chainlink (LINK): Total supply: 419 million, max 1 billion</p>\n\n<p>Cardano (ADA): Total supply: 45 billion. This coin has many great uses, but will not be worth as much as others simply because of the number of circulating coins. Maybe $10-$12 a coin max? But it is under $2 right now. </p>\n\n<p>ATOM: Total supply: 248 million. New coins are created each year as rewards for people that hold (stake) ATOM. If you can find a good coin that gives you APR, many are 5-6%…much better than a traditional savings account! </p>\n\n<p>Algorand (ALGO): 2.96 billion, also releases new coins as rewards to people that hold ALGO. </p>\n\n<p>Tezos (XTZ), circulating supply: 756 million. Total supply: 763 million. </p>\n\n<p>MANA: this coin is only used for a video game called Decentraland. Atari is making a casino opening in May in that virtual world. Supply available: 1.5 billion. Total supply: 2.6 billion. </p>\n\n<p>Polygon (MATIC): 10 billion, half in circulation. Because there is a max supply of 10 billion, if it grew to the size of ETH…which won’t happen…each coin would be worth $35 a coin (Take the market cap of ETH and divide it by the supply of MATIC to see what it would be if it were as huge as ETH). It’s under a dollar now. Maybe it could grow to 1/4 of ETH if we’re being optimistic? That would put it at $8.75 a coin. </p>\n\n<p>Enjin (ENJ) 1 billion coins max, 834 million circulating. </p>\n\n<p>The list goes on, I just picked a handful of random coins I hear mentioned a lot, but all you need to do to check out what a realistic expectation for a coin is is to take the current supply of tokens, multiply it by what you wish the coin was worth and compare the market cap to BTC or ETH’s market cap, over a trillion and $400 billion, respectively. I don’t expect any alt coin to be worth as much as those those two. And, it bears repeating, the entire cryptocurrency market is worth 2.38 trillion. If you calculate that your coin at $100 is going to be worth double, triple, or quadruple that, I’d say that’s an impossibility. Likewise, you can do the math the other way to see what your coin would be worth per coin if it were as big as ETH or BTC by simply dividing the market cap for ETH or BTC by the number of coins circulating for your prospective coin. Your coin won’t grow as big as those two, but it’s a good way to visualize it and manage your expectations. </p>\n\n<p>(Note that some of my supply numbers might be off a little, but they should be in the general ballpark)</p>\n</div><!-- SC_ON -->",
  "score": 14240,
  "permalink": "/r/CryptoCurrency/comments/n5wkwq/will_doge_be_worth_100_a_coin_can_it_become_as/",
  "subreddit": "CryptoCurrency",
  "id": "n5wkwq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380965856
}