{
  "author": "mabolle",
  "original_created_utc": 1644919487,
  "title": "When the heart beats faster, the contractions are closer together in time. But is each contraction itself also faster?",
  "created_utc": 1644938432,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;One of my students asked this the other week, and it triggered an intense debate in the classroom. Either answer feels fairly credible! I promised I&amp;#39;d try to look it up, but Google hasn&amp;#39;t been very helpful, and a family member who&amp;#39;s a medical doctor also wasn&amp;#39;t completely sure.&lt;/p&gt;\n\n&lt;p&gt;It seems to me that since each contraction is coordinated by an impulse traveling down the heart from the SA node, those impulses would need to travel at variable speeds through the cardiac tissue if the contractions were to vary in speed, which feels unlikely?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 158,
  "permalink": "/r/askscience/comments/ssznl6/when_the_heart_beats_faster_the_contractions_are/",
  "subreddit": "askscience",
  "id": "ssznl6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "One of my students asked this the other week, and it triggered an intense debate\nin the classroom. Either answer feels fairly credible! I promised I'd try to\nlook it up, but Google hasn't been very helpful, and a family member who's a\nmedical doctor also wasn't completely sure.\n\nIt seems to me that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先日、ある生徒がこの質問をしたところ、激しい議論が巻き起こりました。\n教室で。どちらの答えも、かなり信憑性があるように感じます ということで\nしかし、Googleはあまり役に立たず、また、家族の一人が\n医学博士も完全にはわからないという。\n\nどうやら...",
      "title": "心臓の鼓動が速くなると、収縮の間隔が近くなる。しかし、それぞれの収縮自体も速くなるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "前几周，我的一个学生问了这个问题，并引发了一场激烈的辩论\n在课堂上引发了激烈的辩论。无论是哪种答案，都感觉相当可信！但我不知道该怎么回答。我保证我会尝试\n查，但是谷歌并没有什么帮助，而且我的一个家庭成员是个医生，他也不完全确定。\n一个当医生的家人也不完全确定。\n\n在我看来，...",
      "title": "当心脏跳得更快时，收缩在时间上会更接近。但每次宫缩本身是否也更快？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "前幾周，我的一個學生問了這個問題，並引發了一場激烈的辯論\n在課堂上引發了激烈的辯論。無論是哪種答案，都感覺相當可信！但我不知道該怎麼回答。我保證我會嘗試\n查，但是谷歌並沒有什麼幫助，而且我的一個家庭成員是個醫生，他也不完全確定。\n一個當醫生的家人也不完全確定。\n\n在我看來，...",
      "title": "當心髒跳得更快時，收縮在時間上會更接近。但每次宮縮本身是否也更快？"
    }
  ]
}