{
  "approved_at_utc": null,
  "subreddit": "investing",
  "selftext": "I came across this thread on Reddit about Roblox and various practices they employ, whilst there was a lot of concerning things, I have some questions about the in game items and marketplace offered by Roblox.\n\nOne of the comments I saw was about Roblox's valuation on the stock market and that got me thinking about what I consider a securities market within Roblox itself.\n\nI would like to hear your thoughts on this and whether or not you'd think these items to be considered securities. I may have gotten certain things horribly wrong with regards to US law, assumptions made etc, so feel free to call me an idiot if so, but please point out your counterarguments! My post mainly focuses on Roblox, but realistically it could be applied to any game that allows in game items to be resold.\n\nhttps://np.reddit.com/r/videos/comments/rfgazz/roblox_pressured_us_to_delete_our_video_so_we_dug/\n\n*****\n\nI know they're only in game items, but I think they could be classified as securities because they can be bought and sold (indirectly) with real money (via robux).\n\nNow of course I am not a lawyer, and have no clue how any of this works (and how it probably also doesn't apply to many other companies that sell, resellable in-game items)\n\n##The Howey Test\n\n&gt; The Howey Test refers to the U.S. Supreme Court case for determining whether a transaction qualifies as an \"investment contract,\" and therefore would be considered a security and subject to disclosure and registration requirements under the Securities Act of 1933 and the Securities Exchange Act of 1934. Under the Howey Test, an investment contract exists if there is an \"investment of money in a common enterprise with a reasonable expectation of profits to be derived from the efforts of others.\"\n\n- https://www.investopedia.com/terms/h/howey-test.asp\n\n###Investment of money\n\n&gt; “The first component of the Howey test focuses on the investment of money. The determining factor is whether an investor chose to give up a specific consideration in return for a separable financial interest with the characteristics of a security\"\n\n- *Securities &amp; Exchange Commission v. SG Ltd.*, 265 F.3d 42 (1st Cir. 2001)\n\nWhen Roblox releases an item for sale, I believe that it could constitute an investment of money, as the purchaser gives up their Robux (specific consideration) in return for an in-game item (separable financial interest with the characteristics of a security). In this case, I would argue that a contract is formed by two interested parties: Robux and the purchaser of the asset with regards to ownership of the asset.\n\n**But wait, it's Robux, not money?**\n\n&gt; \"it is well established that cash is not the only form of contribution or investment that will create an investment contract. Instead, the \"investment\" may take the form of \"goods and services,\" Daniel, 439 U.S. at 560 n. 12, 99 S.Ct. at 797 n. 12, or some other \"exchange of value.\"\"\n\n- *Uselton v. Commercial Lovelace Motor Freight*, 940 F.2d 564 (10th Cir. 1991)\n\nBasically here I am arguing it doesn't have to be cash that is being used to form the contract, and yes, Robux does fulfill this requirement. (And bear in mind Robux can be bought and sold for USD and various other currencies).\n\n###Common enterprise\n\n&gt; A common enterprise is a venture \"in which the `fortunes of the investor are interwoven with and dependent upon the efforts and success of those seeking the investment. . . .'\" It is not necessary that the funds of investors are pooled; what must be shown is that the fortunes of the investors are linked with those of the promoters, thereby establishing the requisite element of vertical commonality. Thus, a common enterprise exists if a direct correlation has been established between success or failure of [the promoter's] efforts and success or failure of the investment.\n\n- *Securities &amp; Exchange Commission v. Eurobond Exchange, Ltd.*, 13 F.3d 1334 (9th Cir. 1994)\n\nI would argue that a common enterprise is established by the fact that the value of the asset purchased by the investor is dependent on Roblox's efforts in advertising a known asset on its marketplace, managing the marketing and scarcity of the asset, as well as it's initial offering price etc.\n\nFurthermore, after Roblox issue the assets, they still oversee the exchange of these assets. If the investor is successful and decides to sell at a higher cost (whether to Roblox or an unaffiliated party), there is a direct correlation between the investor's success and Roblox's success as Roblox take a 30% cut of the sale. If the value was lower, Roblox would still take a 30% cut but won't be as successful if the sale was higher (in some cases significantly higher than the original price).\n\n### Expectation of profit to be derived from the efforts of others\n\nAn investor may purchase an in-game asset from Roblox under the impression that it is a limited offering and may presume that the value of the known asset will increase such that Roblox limits the sale of these assets to a fixed amount. Moreover, the investor assumes risk directly coming from the promoter, for example in the event that Roblox issues more of the same assets; this would increase the supply of the asset and potentially reduce its perceived value.\n\n###Are Roblox in-game items securities then?\n\nI don't know, like I said, I'm not a lawyer. I know other games also have similar models but I've never heard them be critiqued as securities. Loot boxes have had some contention about being gambling, but I think it might be time to start looking at virtual assets as securities. Though a lot of games do not let you resell the items (e.g. Fortnite), or if they do then it's only for an in game currency that cannot be converted back to a fiat currency (e.g. EA FIFA).\n\nRoblox allow users to:\n\n- buy Robux for fiat currency (e.g. 100,000 Robux for 1250 USD)\n- invest in assets with that Robux,\n- sell assets for Robux (whilst Roblox takes a 30% cut) at a profit or loss (but Roblox's fortunes from the sale are directly correlated with the investors fortunes from the sale),\n- sell that Robux for fiat currency (100,000 Robux for 350 USD - a 72% exchange fee!)\n\nIn my totally not legal opinion, Roblox is effectively running an unregulated currency exchange when it comes to the selling of Robux (via Tipalti), an unregulated securities market when it comes to the buying and selling of in-game assets (which may be issued/sold by Roblox, but they benefit regardless due to a 30% commission - and they benefit more if they can create demand and scarcity for items they issue), and have created scenarios where there users are unwittingly becoming investors of securities aided by price history charts, information about limited availability, generating and marketing hype around assets etc.\n\nIn my opinion these assets are more similar to securities than they are to commodities.\n\nAnyway, I was looking to start a discussion regarding this, I could be very wrong and I accept that; especially as this model has been used for a long time I believe (especially amongst MMO games?). I would love to hear any counterarguments etc, or other related talking points",
  "author_fullname": "t2_rlsak",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "[Discussion] Are in-game virtual items that can be sold for \"real money\" considered securities under US Law? (e.g. Roblox) (not legal opinion)",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/investing",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_rfx1th",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.87,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 380,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 380,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1639450273,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1639449519,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.investing",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I came across this thread on Reddit about Roblox and various practices they employ, whilst there was a lot of concerning things, I have some questions about the in game items and marketplace offered by Roblox.&lt;/p&gt;\n\n&lt;p&gt;One of the comments I saw was about Roblox&amp;#39;s valuation on the stock market and that got me thinking about what I consider a securities market within Roblox itself.&lt;/p&gt;\n\n&lt;p&gt;I would like to hear your thoughts on this and whether or not you&amp;#39;d think these items to be considered securities. I may have gotten certain things horribly wrong with regards to US law, assumptions made etc, so feel free to call me an idiot if so, but please point out your counterarguments! My post mainly focuses on Roblox, but realistically it could be applied to any game that allows in game items to be resold.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://np.reddit.com/r/videos/comments/rfgazz/roblox_pressured_us_to_delete_our_video_so_we_dug/\"&gt;https://np.reddit.com/r/videos/comments/rfgazz/roblox_pressured_us_to_delete_our_video_so_we_dug/&lt;/a&gt;&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;I know they&amp;#39;re only in game items, but I think they could be classified as securities because they can be bought and sold (indirectly) with real money (via robux).&lt;/p&gt;\n\n&lt;p&gt;Now of course I am not a lawyer, and have no clue how any of this works (and how it probably also doesn&amp;#39;t apply to many other companies that sell, resellable in-game items)&lt;/p&gt;\n\n&lt;h2&gt;The Howey Test&lt;/h2&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The Howey Test refers to the U.S. Supreme Court case for determining whether a transaction qualifies as an &amp;quot;investment contract,&amp;quot; and therefore would be considered a security and subject to disclosure and registration requirements under the Securities Act of 1933 and the Securities Exchange Act of 1934. Under the Howey Test, an investment contract exists if there is an &amp;quot;investment of money in a common enterprise with a reasonable expectation of profits to be derived from the efforts of others.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"https://www.investopedia.com/terms/h/howey-test.asp\"&gt;https://www.investopedia.com/terms/h/howey-test.asp&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h3&gt;Investment of money&lt;/h3&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;“The first component of the Howey test focuses on the investment of money. The determining factor is whether an investor chose to give up a specific consideration in return for a separable financial interest with the characteristics of a security&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Securities &amp;amp; Exchange Commission v. SG Ltd.&lt;/em&gt;, 265 F.3d 42 (1st Cir. 2001)&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;When Roblox releases an item for sale, I believe that it could constitute an investment of money, as the purchaser gives up their Robux (specific consideration) in return for an in-game item (separable financial interest with the characteristics of a security). In this case, I would argue that a contract is formed by two interested parties: Robux and the purchaser of the asset with regards to ownership of the asset.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;But wait, it&amp;#39;s Robux, not money?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;it is well established that cash is not the only form of contribution or investment that will create an investment contract. Instead, the &amp;quot;investment&amp;quot; may take the form of &amp;quot;goods and services,&amp;quot; Daniel, 439 U.S. at 560 n. 12, 99 S.Ct. at 797 n. 12, or some other &amp;quot;exchange of value.&amp;quot;&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Uselton v. Commercial Lovelace Motor Freight&lt;/em&gt;, 940 F.2d 564 (10th Cir. 1991)&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Basically here I am arguing it doesn&amp;#39;t have to be cash that is being used to form the contract, and yes, Robux does fulfill this requirement. (And bear in mind Robux can be bought and sold for USD and various other currencies).&lt;/p&gt;\n\n&lt;h3&gt;Common enterprise&lt;/h3&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;A common enterprise is a venture &amp;quot;in which the `fortunes of the investor are interwoven with and dependent upon the efforts and success of those seeking the investment. . . .&amp;#39;&amp;quot; It is not necessary that the funds of investors are pooled; what must be shown is that the fortunes of the investors are linked with those of the promoters, thereby establishing the requisite element of vertical commonality. Thus, a common enterprise exists if a direct correlation has been established between success or failure of [the promoter&amp;#39;s] efforts and success or failure of the investment.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Securities &amp;amp; Exchange Commission v. Eurobond Exchange, Ltd.&lt;/em&gt;, 13 F.3d 1334 (9th Cir. 1994)&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I would argue that a common enterprise is established by the fact that the value of the asset purchased by the investor is dependent on Roblox&amp;#39;s efforts in advertising a known asset on its marketplace, managing the marketing and scarcity of the asset, as well as it&amp;#39;s initial offering price etc.&lt;/p&gt;\n\n&lt;p&gt;Furthermore, after Roblox issue the assets, they still oversee the exchange of these assets. If the investor is successful and decides to sell at a higher cost (whether to Roblox or an unaffiliated party), there is a direct correlation between the investor&amp;#39;s success and Roblox&amp;#39;s success as Roblox take a 30% cut of the sale. If the value was lower, Roblox would still take a 30% cut but won&amp;#39;t be as successful if the sale was higher (in some cases significantly higher than the original price).&lt;/p&gt;\n\n&lt;h3&gt;Expectation of profit to be derived from the efforts of others&lt;/h3&gt;\n\n&lt;p&gt;An investor may purchase an in-game asset from Roblox under the impression that it is a limited offering and may presume that the value of the known asset will increase such that Roblox limits the sale of these assets to a fixed amount. Moreover, the investor assumes risk directly coming from the promoter, for example in the event that Roblox issues more of the same assets; this would increase the supply of the asset and potentially reduce its perceived value.&lt;/p&gt;\n\n&lt;h3&gt;Are Roblox in-game items securities then?&lt;/h3&gt;\n\n&lt;p&gt;I don&amp;#39;t know, like I said, I&amp;#39;m not a lawyer. I know other games also have similar models but I&amp;#39;ve never heard them be critiqued as securities. Loot boxes have had some contention about being gambling, but I think it might be time to start looking at virtual assets as securities. Though a lot of games do not let you resell the items (e.g. Fortnite), or if they do then it&amp;#39;s only for an in game currency that cannot be converted back to a fiat currency (e.g. EA FIFA).&lt;/p&gt;\n\n&lt;p&gt;Roblox allow users to:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;buy Robux for fiat currency (e.g. 100,000 Robux for 1250 USD)&lt;/li&gt;\n&lt;li&gt;invest in assets with that Robux,&lt;/li&gt;\n&lt;li&gt;sell assets for Robux (whilst Roblox takes a 30% cut) at a profit or loss (but Roblox&amp;#39;s fortunes from the sale are directly correlated with the investors fortunes from the sale),&lt;/li&gt;\n&lt;li&gt;sell that Robux for fiat currency (100,000 Robux for 350 USD - a 72% exchange fee!)&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;In my totally not legal opinion, Roblox is effectively running an unregulated currency exchange when it comes to the selling of Robux (via Tipalti), an unregulated securities market when it comes to the buying and selling of in-game assets (which may be issued/sold by Roblox, but they benefit regardless due to a 30% commission - and they benefit more if they can create demand and scarcity for items they issue), and have created scenarios where there users are unwittingly becoming investors of securities aided by price history charts, information about limited availability, generating and marketing hype around assets etc.&lt;/p&gt;\n\n&lt;p&gt;In my opinion these assets are more similar to securities than they are to commodities.&lt;/p&gt;\n\n&lt;p&gt;Anyway, I was looking to start a discussion regarding this, I could be very wrong and I accept that; especially as this model has been used for a long time I believe (especially amongst MMO games?). I would love to hear any counterarguments etc, or other related talking points&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qhhq",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "rfx1th",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "HyperGamers",
  "discussion_type": null,
  "num_comments": 6,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/investing/comments/rfx1th/discussion_are_ingame_virtual_items_that_can_be/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/investing/comments/rfx1th/discussion_are_ingame_virtual_items_that_can_be/",
  "subreddit_subscribers": 1963488,
  "created_utc": 1639465310,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1639449519,
  "the_new_excerpt": "I came across this thread on Reddit about Roblox and various practices they\nemploy, whilst there was a lot of concerning things, I have some questions about\nthe in game items and marketplace offered by Roblox.\n\nOne of the comments I saw was about Roblox's valuation on the stock market and\nthat got…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "RedditでRobloxとその様々な慣行に関するスレッドに出会いました。\nについて、いくつか質問があります。\nRobloxが提供するゲーム内アイテムやマーケットプレイスについて。\n\n私が見たコメントの1つは、株式市場におけるRobloxの評価についてでした。\nそれが...",
      "title": "[議論】「リアルマネー」で売れるゲーム内仮想アイテムは、米国法では証券とみなされるのか？(例：Roblox）（法的見解ではありません。）"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在Reddit上看到了这个关于Roblox和他们的各种做法的主题。\n做法，虽然有很多相关的东西，但我有一些问题，关于\nRoblox所提供的游戏项目和市场。\n\n我看到的一个评论是关于Roblox在股票市场上的估值。\n这得到了...",
      "title": "[讨论]根据美国法律，可以用 \"真钱 \"出售的游戏内虚拟物品是否属于证券？(例如Roblox)(不是法律意见)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在Reddit上看到了這個關於Roblox和他們的各種做法的主題。\n做法，雖然有很多相關的東西，但我有一些問題，關於\nRoblox所提供的遊戲項目和市場。\n\n我看到的一個評論是關於Roblox在股票市場上的估值。\n這得到了...",
      "title": "[討論]根據美國法律，可以用 \"真錢 \"出售的遊戲內虛擬物品是否屬於證券？(例如Roblox)(不是法律意見)"
    }
  ],
  "source_updated_at": 1639734118428
}