{
  "author": "greedilymute",
  "original_created_utc": 1639675762,
  "title": "How do you guys find the 100x coins before they run?",
  "created_utc": 1639683214,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So how do you guys research small cap coins that are destined to have a bright future&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not talking about the memecoins or pumps, but actual legit projects like FTM, LRC, GALA, before they go mainstream&lt;/p&gt;\n\n&lt;p&gt;What are the best research methods, i&amp;#39;ve tried researching multiple small/micro caps, checking their roadmaps, researching the team, whitepapers if available, token distributions etc, but everytime i see the roadmap i just don&amp;#39;t believe in them&lt;/p&gt;\n\n&lt;p&gt;Granted not every great project will get the recognition they deserve, and 99% of small caps probably won&amp;#39;t make it unfortunately, but im thinking about the 1% that will.&lt;/p&gt;\n\n&lt;p&gt;Did anyone catch a top 100 coin before they ran? Like genuine projects like FTM for example, and how do you DYOR on projects?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 201,
  "permalink": "/r/CryptoCurrency/comments/rhvkzx/how_do_you_guys_find_the_100x_coins_before_they/",
  "subreddit": "CryptoCurrency",
  "id": "rhvkzx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So how do you guys research small cap coins that are destined to have a bright\nfuture\n\nI'm not talking about the memecoins or pumps, but actual legit projects like\nFTM, LRC, GALA, before they go mainstream\n\nWhat are the best research methods, i've tried researching multiple small/micro\ncaps,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "では、皆さんはどのようにして、明るい運命を持つ小型コインを研究しているのでしょうか。\n未来\n\nミームコインやパンプスの話ではなく、以下のような実際の合法的なプロジェクトの話です。\nFTM、LRC、GALAなどが主流になる前に。\n\n複数のスモール/マイクロを調査してみましたが、どのような調査方法が良いのでしょうか？\nキャップ、、、。",
      "title": "皆さんは、走る前の100倍コインをどのように見つけていますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "那么，你们是如何研究那些注定会有光明前景的小盘币的呢？\n的未来\n\n我说的不是memecoins或泵，而是实际的合法项目，如\nFTM, LRC, GALA, 在它们成为主流之前。\n\n什么是最好的研究方法，我已经尝试研究多个小型/微型\n帽，...",
      "title": "你们是如何在100倍硬币运行前找到它们的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "那麼，你們是如何研究那些註定會有光明前景的小盤幣的呢？\n的未來\n\n我說的不是memecoins或泵，而是實際的合法項目，如\nFTM, LRC, GALA, 在它們成爲主流之前。\n\n什麼是最好的研究方法，我已經嘗試研究多個小型/微型\n帽，...",
      "title": "你們是如何在100倍硬幣運行前找到它們的？"
    }
  ]
}