{
  "author": "Hard_Taco_Tuesday",
  "the_new_excerpt": "Been watching a lot of 90s and movies recently and can’t help but reflect on how\nmuch the 90s was full of native Americans and references to Native American\nculture. Movies like Dances with Wolves, Last of the Mohicans, Free Willy, and\ndozens of other big movies were focused on telling Native…",
  "original_created_utc": 1612379130,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "最近看了很多90年代的作品和电影，不禁反思了一下如何\n多90年代是充满了美国本土和参考美国本土的\n文化。如《与狼共舞》、《最后的莫西干》、《自由意志》等电影。\n其他几十部大电影都是专注于讲述原住民... ...",
      "title": "美国原住民题材、人物和演员在1990年代的电影和电视中如此受欢迎，有什么特殊原因吗？为什么到了20世纪就停止了呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近看了很多90年代的作品和電影，不禁反思了一下如何\n多90年代是充滿了美國本土和參考美國本土的\n文化。如《與狼共舞》、《最後的莫西幹》、《自由意志》等電影。\n其他幾十部大電影都是專注於講述原住民... ...",
      "title": "美國原住民題材、人物和演員在1990年代的電影和電視中如此受歡迎，有什麼特殊原因嗎？爲什麼到了20世紀就停止了呢？"
    }
  ],
  "title": "Was there any particular reason that Native American subjects and characters and actors were so popular in 1990s film and television? And why did it all seem to stop in the aughts?",
  "created_utc": 1612432974,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Been watching a lot of 90s and movies recently and can’t help but reflect on how much the 90s was full of native Americans and references to Native American culture.  Movies like Dances with Wolves, Last of the Mohicans, Free Willy, and dozens of other big movies were focused on telling Native American stories.  And then all the actors from those movies all started getting cast in everything else.  Just watched Die Hard with a Vengeance and one of the NYC cops is a Native American actor and I realized how “90s” that was.  Natural Born Killers is maybe the most 90s movie ever and of course there’s all kinds of Native American imagery and characters.</p>\n\n<p>And then TV seemed to also be doing the same thing.  Recently watched Star Trek: Voyager, which had Chakotay.  And I generally just remember all the random tv shows I watched during the 90s would have a Native American themed episode or character or cast member etc.  </p>\n\n<p>Was it just the trend at the time?  Where did that clear focus on Native American characters and casting start?  And why did it seem to end in the Bush era?  Was there a Clinton administration executive order or policy focused on encouraging positive portrayals of natives in popular media?  Or was it just that Hollywood saw that Native American stuff was making money and winning awards so everyone rushed to get on the bandwagon?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/lbvbux/was_there_any_particular_reason_that_native/",
  "subreddit": "AskHistorians",
  "id": "lbvbux",
  "is_self": true,
  "media": null,
  "is_video": false
}