{
  "author": "Flagbearer2546",
  "original_created_utc": 1638810063,
  "title": "What’s it like to be unattractive?",
  "created_utc": 1638825487,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First off, I know how insensitive and ignorant this question might come across as, so I apologize if this hurts anyone’s feelings. I was wondering what people experience in day to day life if you’re unattractive/ugly?&lt;/p&gt;\n\n&lt;p&gt;I never thought much about it until recently one of my friends pointed out how people treat him vs me. Now I can’t stop noticing how dismissive they are of him, and how hard he has to work to get people to like him. And my friend is one of the kindest people I’ve ever met. Frankly, it makes me sad how superficial people are as a whole. &lt;/p&gt;\n\n&lt;p&gt;Once again, sorry if this offends anyone. It’s probably a stupid question anyway&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 119,
  "permalink": "/r/TooAfraidToAsk/comments/rabyz4/whats_it_like_to_be_unattractive/",
  "subreddit": "TooAfraidToAsk",
  "id": "rabyz4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "First off, I know how insensitive and ignorant this question might come across\nas, so I apologize if this hurts anyone’s feelings. I was wondering what people\nexperience in day to day life if you’re unattractive/ugly?\n\nI never thought much about it until recently one of my friends pointed out…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず最初に、この質問がいかに無神経で無知なものであるかは承知しています。\nということで、もし誰かの心を傷つけたら申し訳ないです。私は、人々はどのようなことをするのだろうと思いました。\nモテない・ブサイクな人が日常生活で経験することとは？\n\n私は、最近友人の一人に指摘されるまで、それについてあまり考えたことがありませんでした...",
      "title": "魅力のない人ってどんな感じ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我知道这个问题可能有多么不敏感和无知。\n所以，如果这伤害了任何人的感情，我深表歉意。我在想，如果你不漂亮/丑陋，人们\n在日常生活中，如果你不漂亮/丑陋，会有什么体验？\n\n我从来没有多想过这个问题，直到最近我的一个朋友指出...",
      "title": "没有吸引力是什么感觉？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我知道這個問題可能有多麼不敏感和無知。\n所以，如果這傷害了任何人的感情，我深表歉意。我在想，如果你不漂亮/醜陋，人們\n在日常生活中，如果你不漂亮/醜陋，會有什麼體驗？\n\n我從來沒有多想過這個問題，直到最近我的一個朋友指出...",
      "title": "沒有吸引力是什麼感覺？"
    }
  ]
}