{
  "author": "Large_Accident_5929",
  "original_created_utc": 1634817822,
  "title": "Why does it seem like Reddit turns every commenter into the same person? Everyone feels the same here",
  "created_utc": 1634839690,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I swear everyone becomes homogeneous here. The same stupid “Reddit humor,” and an oddly strong emphasis on “not giving any fucks,” a tendency to argue with people in comments, calling their significant others “hubby” or SO, quoting Queen songs in comment chains, etc….those are random examples that probably don’t mean much on their own. But I really swear Reddit turns everyone into the same person. It’s actually really uncanny.</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/NoStupidQuestions/comments/qcq82t/why_does_it_seem_like_reddit_turns_every/",
  "subreddit": "NoStupidQuestions",
  "id": "qcq82t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I swear everyone becomes homogeneous here. The same stupid “Reddit humor,” and\nan oddly strong emphasis on “not giving any fucks,” a tendency to argue with\npeople in comments, calling their significant others “hubby” or SO, quoting\nQueen songs in comment chains, etc….those are random examples that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここではみんなが同質化してしまうんですよね。同じようなくだらない「Redditのユーモア」や\n妙に「どうでもいい」ことを強調したり、コメントで人に反論する傾向があったり\nコメントで人と議論する傾向があったり、自分の大切な人を「hubby」や「SO」と呼んだり、コメントチェーンでQueenの曲を引用したりと\nクイーンの曲を引用するなど.... これらはランダムな例ですが、...",
      "title": "なぜRedditでは、すべてのコメント者が同一人物になってしまうのでしょうか？ここでは誰もが同じように感じる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我发誓每个人在这里都变得同质化。同样愚蠢的 \"Reddit幽默\"，以及\n同样愚蠢的 \"Reddit幽默\"，以及奇怪地强调 \"不给任何废话\"，倾向于在评论中与人争论。\n倾向于在评论中与人争论，称他们的重要他人为 \"老公 \"或SO，在评论链中引用\n在评论链中引用女王的歌曲，等等....，这些都是随机的例子，...",
      "title": "为什么Reddit好像把每个评论者都变成了同一个人？这里每个人的感觉都一样"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我發誓每個人在這裏都變得同質化。同樣愚蠢的 \"Reddit幽默\"，以及\n同樣愚蠢的 \"Reddit幽默\"，以及奇怪地強調 \"不給任何廢話\"，傾向於在評論中與人爭論。\n傾向於在評論中與人爭論，稱他們的重要他人爲 \"老公 \"或SO，在評論鏈中引用\n在評論鏈中引用女王的歌曲，等等....，這些都是隨機的例子，...",
      "title": "爲什麼Reddit好像把每個評論者都變成了同一個人？這裏每個人的感覺都一樣"
    }
  ]
}