{
  "author": "Upperclasshobo",
  "original_created_utc": 1627601769,
  "title": "I've bought a few side projects...",
  "created_utc": 1627612965,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve posted on here a few times buying side-projects and small SaaS applications and then using my team to build them up (if I can). I want to test the waters with a different way.</p>\n\n<p>Here is what I have seen. Tell me if this is familiar...</p>\n\n<ul>\n<li>Developer has a get idea, builds something awesome. Launches, and then crickets. If the building of it is the easy part, the remaining of sales and marketing just are not interesting. The project just becomes something on the resume, the domain renewed out of homage to dreams past.</li>\n<li>A person is sitting there, has 200 people saying they like it, but no one answering surveys or questions except for 3 or 4. Gets depressing, the project is abandoned.</li>\n<li>A non-technical person has a great idea, loses 10k in contractor in the middle of nowhere. The project is a mess, hair begins to fall out. Feeling like meme stocks are a better retirement fund.</li>\n</ul>\n\n<p>Ok, so I have advised, bought, chatted about all of those cases. Accelerators are neat but expect you to go full time, etc. </p>\n\n<p>Here is what I generally do... I find a project in one of those three situations, I take it off their hands (buy), try to grow it with my own team. Focusing on making it mostly automated (nothing truly is), providing strong semi-passive income.</p>\n\n<p>What I am looking for feedback on is how I could flip the paradigm. Partner with people that have a side project with promise. Then, work together to grow it to something that is a nice semi-passive income stream. Lastly, both benefitting from the sweat and success. </p>\n\n<p>DM or comment, love to understand your thoughts.</p>\n</div><!-- SC_ON -->",
  "score": 6,
  "permalink": "/r/SideProject/comments/ou93d3/ive_bought_a_few_side_projects/",
  "subreddit": "SideProject",
  "id": "ou93d3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've posted on here a few times buying side-projects and small SaaS applications\nand then using my team to build them up (if I can). I want to test the waters\nwith a different way.\n\nHere is what I have seen. Tell me if this is familiar...\n\n * Developer has a get idea, builds something awesome.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はここで何度か、サイド・プロジェクトや小規模なSaaSアプリケーションを購入し、（可能であれば）自分のチームを使ってそれらを構築することを投稿しました。\nを購入し、（可能であれば）私のチームを使ってそれらを構築しています。私は別の方法を試してみたいのです。\nしたいと思っています。\n\n私が見てきたものは以下の通りです。知っていることがあれば教えてください...\n\n * 開発者がアイデアを出し、素晴らしいものを作る....",
      "title": "いくつかのサイドプロジェクトを購入しましたが...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经在这里发过几次帖子，购买副业和小型SaaS应用程序\n然后用我的团队来建立它们（如果我可以的话）。我想试一试\n用一种不同的方式。\n\n以下是我所看到的。告诉我这是否熟悉...\n\n * 开发者有一个想法，建立了一些了不起的东西....。",
      "title": "我已经买了一些副业..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經在這裏發過幾次帖子，購買副業和小型SaaS應用程序\n然後用我的團隊來建立它們（如果我可以的話）。我想試一試\n用一種不同的方式。\n\n以下是我所看到的。告訴我這是否熟悉...\n\n * 開發者有一個想法，建立了一些了不起的東西....。",
      "title": "我已經買了一些副業..."
    }
  ]
}