{
  "author": "dude-of-earth",
  "original_created_utc": 1630155870,
  "title": "Does sex really not feel good for women?",
  "created_utc": 1630178193,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, I’m a guy. I take antidepressants which, as you may know, prevents you from having orgasms. Nevertheless, I love sex and I love pleasing my partner. I don’t mind that I don’t reach orgasm because sex itself feels good.</p>\n\n<p>I notice that most women I talk to are of the opposite opinion. For them, sex is just a means to an end and if they don’t orgasm then the whole exercise was pointless.</p>\n\n<p>Is this what most women really think? Or do I just happen to only meet women who don’t enjoy the act itself? It’s kind of disheartening to hear that 95% of sex is something they don’t enjoy.</p>\n</div><!-- SC_ON -->",
  "score": 118,
  "permalink": "/r/TooAfraidToAsk/comments/pd9evx/does_sex_really_not_feel_good_for_women/",
  "subreddit": "TooAfraidToAsk",
  "id": "pd9evx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So, I’m a guy. I take antidepressants which, as you may know, prevents you from\nhaving orgasms. Nevertheless, I love sex and I love pleasing my partner. I don’t\nmind that I don’t reach orgasm because sex itself feels good.\n\nI notice that most women I talk to are of the opposite opinion. For them,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "というわけで、私は男です。抗うつ剤を服用していますが、ご存知のようにこれは\nオーガズムを感じることができません。しかし、私はセックスが大好きで、パートナーを喜ばせることが大好きです。私は\nオーガズムに達しなくても気にしません、なぜならセックス自体が気持ちいいからです。\n\nしかし、私が話をする多くの女性は、反対の意見を持っていることに気づきました。彼女たちにとっては...",
      "title": "女性にとって、セックスは本当に気持ちのいいものではないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我是个男人。我服用抗抑郁药，你可能知道，这使你无法\n有高潮。然而，我热爱性爱，我喜欢取悦我的伴侣。我并不介意\n我不介意我没有达到高潮，因为性爱本身感觉很好。\n\n我注意到，与我交谈的大多数女性都持相反的观点。对她们来说，...",
      "title": "性爱对女性来说真的没有感觉吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我是個男人。我服用抗抑鬱藥，你可能知道，這使你無法\n有高潮。然而，我熱愛性愛，我喜歡取悅我的伴侶。我並不介意\n我不介意我沒有達到高潮，因爲性愛本身感覺很好。\n\n我注意到，與我交談的大多數女性都持相反的觀點。對她們來說，...",
      "title": "性愛對女性來說真的沒有感覺嗎？"
    }
  ]
}