{
  "author": "bboombayah",
  "original_created_utc": 1654138232,
  "title": "Why is the statement \"Don’t have kids if you can’t afford them\" problematic?",
  "created_utc": 1654162166,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I thought it was a solid statement, like it would be risky to purposely have kids if you don’t have enough money to provide for them in the beginning. I thought you have to be really prepared for kids before having one. Just to clarify, I’m not counting accidental pregnancies. &lt;/p&gt;\n\n&lt;p&gt;I’m saying this as someone who used to be poor. I felt that my parents gave birth (planned; 3 children including me) too soon considering the fact their financial status wasn’t that great in the beginning. &lt;/p&gt;\n\n&lt;p&gt;Then I saw a lot of people being outraged by the statement. I don’t see any explanation as to why that statement could be controversial unfortunately. I’m genuinely curious about that.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/v2yw8l/why_is_the_statement_dont_have_kids_if_you_cant/",
  "subreddit": "NoStupidQuestions",
  "id": "v2yw8l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I thought it was a solid statement, like it would be risky to purposely have\nkids if you don’t have enough money to provide for them in the beginning. I\nthought you have to be really prepared for kids before having one. Just to\nclarify, I’m not counting accidental pregnancies.\n\nI’m saying this as…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "養育費が足りないのにわざわざ子供を作るのは危険だ、というような堅実な意見だと思いました。\n最初に養えるだけのお金がなければ、子供を作るのはリスクが高いというような。I\n子供を作る前に本当に覚悟を決めないといけないと思いました。ただ\nはっきり言って、偶然の妊娠はカウントしてませんよ。\n\nとして言っているのですが・・・。",
      "title": "余裕がないなら子供を作るな」という発言はなぜ問題視されるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为这是一个可靠的声明，就像如果你一开始就没有足够的钱供养孩子，那么故意生孩子是有风险的。\n如果你一开始就没有足够的钱来养活他们，那就有风险。I\n我认为，在生孩子之前，你必须为孩子做好真正的准备。只是为了\n澄清一下，我不是在计算意外怀孕。\n\n我这么说是为了...",
      "title": "为什么 \"买不起孩子就不要生 \"这句话有问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲這是一個可靠的聲明，就像如果你一開始就沒有足夠的錢供養孩子，那麼故意生孩子是有風險的。\n如果你一開始就沒有足夠的錢來養活他們，那就有風險。I\n我認爲，在生孩子之前，你必須爲孩子做好真正的準備。只是爲了\n澄清一下，我不是在計算意外懷孕。\n\n我這麼說是爲了...",
      "title": "爲什麼 \"買不起孩子就不要生 \"這句話有問題？"
    }
  ]
}