{
  "author": "pandamanthefirst",
  "original_created_utc": 1633958188,
  "title": "Can you be dyslexic in one language and not be in another?",
  "created_utc": 1633967204,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was never diagnosed with dyslexia but i think i might have it but its not the same for the languages i speak. I can speak 4 languages. English is not my native language but i never really had problems with it. But i have a hard time pronouncing longer words in my native language and that is the only thing i cant really do in my native language but in german i can&#39;t read for the love of god its unbelievable hard and even if i can read i dont understand what i read it all sounds gibberish in my head. I do not have a problem speaking listening or even writing it, just reading it. Is that normal or is it something else?</p>\n</div><!-- SC_ON -->",
  "score": 137,
  "permalink": "/r/askscience/comments/q5vmde/can_you_be_dyslexic_in_one_language_and_not_be_in/",
  "subreddit": "askscience",
  "id": "q5vmde",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was never diagnosed with dyslexia but i think i might have it but its not the\nsame for the languages i speak. I can speak 4 languages. English is not my\nnative language but i never really had problems with it. But i have a hard time\npronouncing longer words in my native language and that is the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はディスレクシアと診断されたことはありませんが、自分ではそうではないかと思っています。\n私は4つの言語を話すことができます。私は4つの言語を話すことができます。英語は私の母国語ではありませんが\n英語は母国語ではありませんが、問題を抱えたことはありません。でも、母国語の長い単語を発音するのは難しいんです。\n母国語の長い単語を発音するのが難しく、それが...。",
      "title": "ある言語でディスレクシアになっても、別の言語ではならないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从未被诊断出有阅读障碍，但我认为我可能有，但它与我所讲的语言不同。\n我所讲的语言也是如此。我可以说4种语言。英语不是我的\n我的母语，但我从来没有真正遇到过问题。但我有一个困难\n我的母语中较长的单词的发音，这就是我的问题所在...",
      "title": "你可以在一种语言中出现阅读障碍，而在另一种语言中不出现吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從未被診斷出有閱讀障礙，但我認爲我可能有，但它與我所講的語言不同。\n我所講的語言也是如此。我可以說4種語言。英語不是我的\n我的母語，但我從來沒有真正遇到過問題。但我有一個困難\n我的母語中較長的單詞的發音，這就是我的問題所在...",
      "title": "你可以在一種語言中出現閱讀障礙，而在另一種語言中不出現嗎？"
    }
  ]
}