{
  "author": "HugoWullAMA",
  "the_new_excerpt": "The Hilux became so synonymous with a particular era of warfare that The Toyota\nWar [https://en.m.wikipedia.org/wiki/Toyota_War] took its name from the\nvehicle’s usage. In recent years, Toyota has received negative press for the\ntruck’s use by ISIS, and the group is suspected of stealing large…",
  "original_created_utc": 1619000193,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ハイラックスは、ある特定の戦争の時代の代名詞となり、「トヨタ戦争」[]の名前は、このハイラックスに由来している。\n戦争[https://en.m.wikipedia.org/wiki/Toyota_War]の名前は、この車の使用方法に由来しています。\nトヨタ戦争』[]の名前の由来となった。近年、トヨタはこのハイラックスを使ってネガティブな報道を受けている。\n近年、トヨタはISISにトラックを使用されたことで否定的な報道を受けており、ISISは大型のトラックを盗んだ疑いがある。",
      "title": "なぜトヨタ・ハイラックスは、中東やアフリカの軍事組織やテロリストに選ばれるようになったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "希拉克斯成为了一个特定战争时代的代名词，以至于 \"丰田战争\"（The Toyota\n战争[https://en.m.wikipedia.org/wiki/Toyota_War]的名字就来自于该车的使用。\n的名字。近年来，丰田公司因ISIS使用这种卡车而受到负面报道。\n近年来，丰田因ISIS使用卡车而受到负面报道，该组织被怀疑偷窃了大量卡车。",
      "title": "为什么丰田Hilux成为中东和非洲的军事和恐怖组织的首选车辆？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "希拉剋斯成爲了一個特定戰爭時代的代名詞，以至於 \"豐田戰爭\"（The Toyota\n戰爭[https://en.m.wikipedia.org/wiki/Toyota_War]的名字就來自於該車的使用。\n的名字。近年來，豐田公司因ISIS使用這種卡車而受到負面報道。\n近年來，豐田因ISIS使用卡車而受到負面報道，該組織被懷疑偷竊了大量卡車。",
      "title": "爲什麼豐田Hilux成爲中東和非洲的軍事和恐怖組織的首選車輛？"
    }
  ],
  "title": "Why did the Toyota Hilux become the vehicle of choice for military and terrorist groups in the Middle East and Africa?",
  "created_utc": 1619030821,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The Hilux became so synonymous with a particular era of warfare that <a href=\"https://en.m.wikipedia.org/wiki/Toyota_War\">The Toyota War</a> took its name from the vehicle’s usage. In recent years, Toyota has received negative press for the truck’s use by ISIS, and the group is suspected of stealing large numbers of the vehicle. </p>\n\n<p>While I can see the advantage of using a modified truck in warfare as militaries in the 80’s and 90’s had, it isn’t clear to me why they favored the Hilux over other models.</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/AskHistorians/comments/mvckr1/why_did_the_toyota_hilux_become_the_vehicle_of/",
  "subreddit": "AskHistorians",
  "id": "mvckr1",
  "is_self": true,
  "media": null,
  "is_video": false
}