{
  "author": "ToesyToeNails",
  "original_created_utc": 1646476686,
  "title": "Why do people never talk about how hard it is being the person who initiates a break up?",
  "created_utc": 1646485755,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I came out of a 4 year relationship last year and the reason we broke up is I found the relationship was getting platonic. We had a toxic relationship but we both couldn&amp;#39;t imagine ourselves being with anybody else. I think a lot of the toxicity came from constantly being in each others space, like literally in each others company 24/7 where we just got sick of the sight of each other and started irritating each other. Eventually I realised I&amp;#39;m not making her happy. I started realising we barely have anything in common. That we exhausted all conversation topics and whenever we talked to each other it felt scripted.   She&amp;#39;d never break up with me though. Not enough confidence in herself. Too scared of being on her own and afraid I&amp;#39;m all she has. But I knew I could never be the boyfriend she wants, so I broke up with her so that she could find happiness in somebody else who can make her happy and she did. But it hurts. It took over half a year to get over it. It&amp;#39;s different when you&amp;#39;re breaking up with somebody because you love them and it isn&amp;#39;t a rare thing. A lot if relationships don&amp;#39;t end in an argument or a fight or bad terms. It ends from an agreement that it&amp;#39;s for the best and nobody talks about how much that hurts and I just wanna know why.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/t76u63/why_do_people_never_talk_about_how_hard_it_is/",
  "subreddit": "TooAfraidToAsk",
  "id": "t76u63",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I came out of a 4 year relationship last year and the reason we broke up is I\nfound the relationship was getting platonic. We had a toxic relationship but we\nboth couldn't imagine ourselves being with anybody else. I think a lot of the\ntoxicity came from constantly being in each others space, like…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は昨年、4年間付き合っていた人と別れました。\nプラトニックな関係になりつつあることがわかった。私たちは毒のある関係でしたが、私たちは\n他の人と一緒になることを想像できない。私は、その多くが\n毒性は、常にお互いのスペースにいることから来ています。",
      "title": "なぜ人は、別れを切り出す側の辛さについて語らないのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我去年从一段4年的关系中走出来，我们分手的原因是我\n发现这段关系变得柏拉图式了。我们有一段有毒的关系，但我们\n我们都无法想象自己会和其他人在一起。我认为很多的\n毒性来自于不断进入对方的空间，比如...",
      "title": "为什么人们从不谈论作为主动提出分手的人有多难呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我去年從一段4年的關係中走出來，我們分手的原因是我\n發現這段關係變得柏拉圖式了。我們有一段有毒的關係，但我們\n我們都無法想象自己會和其他人在一起。我認爲很多的\n毒性來自於不斷進入對方的空間，比如...",
      "title": "爲什麼人們從不談論作爲主動提出分手的人有多難呢？"
    }
  ]
}