{
  "author": "ThicColt",
  "original_created_utc": 1650710422,
  "title": "How come most people here on reddit view 18 as the bare minimum age of consent, but where I live it's 16, and I've literally never heard anyone talk about it being too low?",
  "created_utc": 1650718217,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I even asked my health education teacher couple days ago, and she said she feels the current age is fine.&lt;/p&gt;\n\n&lt;p&gt;But oh my, most people here view a 19yo dating a 17yo as very disturbing.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s seems really weird, since in finland it&amp;#39;s legal for a 16yo to have sex with anyone, unless their in a position of power over them (e.g. teacher, coach, or a prison guard) and as I said, I don&amp;#39;t see anyone here saying there&amp;#39;s anything wrong with it.&lt;/p&gt;\n\n&lt;p&gt;So where does the difference in attitude come from?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 166,
  "permalink": "/r/NoStupidQuestions/comments/ua2n9b/how_come_most_people_here_on_reddit_view_18_as/",
  "subreddit": "NoStupidQuestions",
  "id": "ua2n9b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I even asked my health education teacher couple days ago, and she said she feels\nthe current age is fine.\n\nBut oh my, most people here view a 19yo dating a 17yo as very disturbing.\n\nIt's seems really weird, since in finland it's legal for a 16yo to have sex with\nanyone, unless their in a position…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数日前に保健体育の先生にも聞いてみたのですが、「感じる」と言われました。\n今の年齢で問題ないと言っていました。\n\nしかし、なんと、ここでは19歳が17歳とデートすることを非常に不穏なものとして捉えている人がほとんどなのです。\n\nフィンランドでは、16歳が誰とでもセックスすることが合法なので、とても奇妙に思えます。\nフィンランドでは、16歳が誰かとセックスすることは合法です。",
      "title": "redditではほとんどの人が18歳を同意の最低年齢とみなしていますが、私の住んでいるところでは16歳で、それが低すぎるという話は文字通り聞いたことがありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几天前，我甚至问了我的健康教育老师，她说她觉得\n目前的年龄是好的。\n\n但是，这里的大多数人认为19岁的人和17岁的人约会是非常令人不安的。\n\n这看起来真的很奇怪，因为在芬兰，16岁的人与17岁的人发生性关系是合法的。\n因为在芬兰，16岁的孩子与任何人发生性关系都是合法的，除非他们处于某种地位......",
      "title": "为什么reddit上的大多数人认为18岁是最低的同意年龄，而我住的地方是16岁，而且我从来没有听到有人说这个年龄太低？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾天前，我甚至問了我的健康教育老師，她說她覺得\n目前的年齡是好的。\n\n但是，這裏的大多數人認爲19歲的人和17歲的人約會是非常令人不安的。\n\n這看起來真的很奇怪，因爲在芬蘭，16歲的人與17歲的人發生性關係是合法的。\n因爲在芬蘭，16歲的孩子與任何人發生性關係都是合法的，除非他們處於某種地位......",
      "title": "爲什麼reddit上的大多數人認爲18歲是最低的同意年齡，而我住的地方是16歲，而且我從來沒有聽到有人說這個年齡太低？"
    }
  ]
}