{
  "author": "rubiafresa",
  "original_created_utc": 1652113050,
  "title": "Do you wash the bottoms of your feet in the shower?",
  "created_utc": 1652122155,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;After a confrontation with a flatmate over dirty water stains on the bathroom floor, he confessed that he never washes the soles of his feet when he&amp;#39;s showering. I spoke to my other flatmate and he also says he doesn&amp;#39;t either...&lt;/p&gt;\n\n&lt;p&gt;This completely baffles me, I wash the soles of my feet without thinking about it. And so I began conducting research by asking friends at work, and im yet to encounter anyone that washes their feet in the shower!&lt;/p&gt;\n\n&lt;p&gt;So now I must know, do y&amp;#39;all wash your feet in the shower or just let the falling suds do the job? I cannot be the only one??&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/uluvqy/do_you_wash_the_bottoms_of_your_feet_in_the_shower/",
  "subreddit": "NoStupidQuestions",
  "id": "uluvqy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "After a confrontation with a flatmate over dirty water stains on the bathroom\nfloor, he confessed that he never washes the soles of his feet when he's\nshowering. I spoke to my other flatmate and he also says he doesn't either...\n\nThis completely baffles me, I wash the soles of my feet without…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "浴室の水垢の汚さで同居人と対立した後、「風呂場では足の裏を洗わない」と告白。\nると、「シャワーを浴びるときに足の裏を洗わない」と告白した。\nと告白した。もう一人の同居人にも聞いてみたところ、彼も洗わないとのこと...。\n\nこれは完全に私を困惑させる、私は足の裏を洗わずに...",
      "title": "シャワーで足の裏を洗いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在与室友就浴室地板上的脏水渍发生冲突之后\n他承认，他在洗澡时从不清洗脚底。\n洗澡的时候从来不洗脚底。我和我的另一个室友谈了谈，他也说他也没有......。\n\n这让我很不解，我洗脚底的时候都不洗。",
      "title": "你会在淋浴时清洗脚底吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在與室友就浴室地板上的髒水漬發生衝突之後\n他承認，他在洗澡時從不清洗腳底。\n洗澡的時候從來不洗腳底。我和我的另一個室友談了談，他也說他也沒有......。\n\n這讓我很不解，我洗腳底的時候都不洗。",
      "title": "你會在淋浴時清洗腳底嗎？"
    }
  ]
}