{
  "author": "butwhystherumgone",
  "original_created_utc": 1637872523,
  "title": "What's the worst thing the US government can do against bitcoin?",
  "created_utc": 1637901783,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Serious, theoretical discussion. I&#39;m not claiming to be an expert on bitcoin, but just want to hear some thoughts. Let&#39;s say bitcoin is a big threat to the dollar&#39;s status as a reserve currency, what is the worst case realistic scenario? Let&#39;s not discuss &quot;US government waltzes into your homes and takes your hardware wallet&quot; because that&#39;s not a realistic scenario. If we reach that point, we have much bigger problems.</p>\n\n<p>From what I can see, they&#39;ve already done the worst and it&#39;s set capital gains against purchases by bitcoins. No one in the US wants to pay capital gains every time you buy something, most people don&#39;t want to fight the federal government believe it or not. This is fine with me, because it still allows bitcoin to be an asset class.</p>\n\n<p>With how many billionaires, institutions, giant companies, jobs now revolve around bitcoin and crypto, could anything else harmful really be done? I doubt very much anyone in the US govt would want to rock the boat much at this point when their major donors and friends  are becoming invested.</p>\n</div><!-- SC_ON -->",
  "score": 218,
  "permalink": "/r/Bitcoin/comments/r25ttq/whats_the_worst_thing_the_us_government_can_do/",
  "subreddit": "Bitcoin",
  "id": "r25ttq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Serious, theoretical discussion. I'm not claiming to be an expert on bitcoin,\nbut just want to hear some thoughts. Let's say bitcoin is a big threat to the\ndollar's status as a reserve currency, what is the worst case realistic\nscenario? Let's not discuss \"US government waltzes into your homes and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "真面目で理論的な議論 私はビットコインの専門家であると主張しているわけではありません。\nただ、いくつかの考えを聞きたいだけです。ビットコインが基軸通貨としてのドルの地位を大きく脅かすものだとします。\nビットコインが基軸通貨としてのドルの地位を大きく脅かすとしたら、最悪の場合の現実的なシナリオは何でしょうか？\nシナリオは？米国政府が皆さんの家に忍び込み、...」という議論はやめておきましょう。",
      "title": "米国政府がビットコインに対して行う最悪のこととは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "严肃的、理论性的讨论。我并不声称自己是比特币的专家。\n但只是想听听一些想法。假设比特币对美元的储备货币地位是一个很大的威胁\n美元作为储备货币的地位，最坏的现实情况是什么？\n场景？我们不要讨论 \"美国政府大摇大摆地走进你们的家，并...",
      "title": "美国政府能对比特币做的最坏的事情是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嚴肅的、理論性的討論。我並不聲稱自己是比特幣的專家。\n但只是想聽聽一些想法。假設比特幣對美元的儲備貨幣地位是一個很大的威脅\n美元作爲儲備貨幣的地位，最壞的現實情況是什麼？\n場景？我們不要討論 \"美國政府大搖大擺地走進你們的家，並...",
      "title": "美國政府能對比特幣做的最壞的事情是什麼？"
    }
  ]
}