{
  "author": "kwtp",
  "original_created_utc": 1624581255,
  "title": "Were ancient civilizations aware that they were descendants of hunter-gatherers?",
  "created_utc": 1624626326,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Suppose you are a person living in one of the first agricultural societies, and you are the 10th generation from the people who originally settled.</p>\n\n<p>Would you be aware that your ancestors were hunter-gatherers, or you would only know life as it is now - with farming and some basic society structure?</p>\n\n<p>My layman intuition says that this was probably passed to other generations as some form of story telling or myths. I think that the study of archaeology is relatively recent.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/o7cqjo/were_ancient_civilizations_aware_that_they_were/",
  "subreddit": "AskHistorians",
  "id": "o7cqjo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Suppose you are a person living in one of the first agricultural societies, and\nyou are the 10th generation from the people who originally settled.\n\nWould you be aware that your ancestors were hunter-gatherers, or you would only\nknow life as it is now - with farming and some basic society…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "仮に、あなたが最初の農耕社会の一つに住んでいる人だとします。\n自分の祖先が狩猟採集民であることを知っていますか？\n\n自分の祖先が狩猟採集生活をしていたことを知っているだろうか。それとも、今の生活を知っているだけだろうか。\n狩猟採集生活をしていたことを知っているでしょうか、それとも、農業や基本的な社会がある今の生活しか知らないでしょうか？",
      "title": "古代文明は、自分たちが狩猟採集民の子孫であることを意識していたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "假设你是一个生活在最早的农业社会中的人，而且你是最初定居的人的第10代。\n你是最初定居的人的第十代。\n\n你会意识到你的祖先是狩猎采集者吗？\n还是只知道现在的生活--农业和一些基本的社会......",
      "title": "古代文明是否意识到他们是狩猎-采集者的后代？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "假設你是一個生活在最早的農業社會中的人，而且你是最初定居的人的第10代。\n你是最初定居的人的第十代。\n\n你會意識到你的祖先是狩獵採集者嗎？\n還是隻知道現在的生活--農業和一些基本的社會......",
      "title": "古代文明是否意識到他們是狩獵-採集者的後代？"
    }
  ]
}