{
  "author": "daaaaaaaaaaaaaavid",
  "the_new_excerpt": "This might not be accurate, but I’d assume that the average citizen had very\nlimited experience to performed music - maybe from a single instrument or from\nsmaller musical troupes. In this case, I can only imagine that the experience of\nhearing an orchestral symphony for the first time would be an…",
  "original_created_utc": 1616391855,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这可能并不准确，但我认为普通市民有非常多的\n对音乐表演的经验有限--可能是单一乐器的表演，也可能是音乐表演的经验。\n小型音乐团。在这种情况下，我只能想象，在这种情况下，我只能想象，在这种情况下，我只能想象。\n第一次听到管弦乐交响曲会是一个... ...",
      "title": "我想，对于17、18世纪的普通欧洲人来说，第一次听到管弦乐交响曲，绝对是一种心灵上的震撼，边缘的宗教体验。有什么原始记载吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這可能並不準確，但我認爲普通市民有非常多的\n對音樂表演的經驗有限--可能是單一樂器的表演，也可能是音樂表演的經驗。\n小型音樂團。在這種情況下，我只能想象，在這種情況下，我只能想象，在這種情況下，我只能想象。\n第一次聽到管絃樂交響曲會是一個... ...",
      "title": "我想，對於17、18世紀的普通歐洲人來說，第一次聽到管絃樂交響曲，絕對是一種心靈上的震撼，邊緣的宗教體驗。有什麼原始記載嗎？"
    }
  ],
  "title": "I'd imagine that for the average European during the 17th and 18th century, hearing an orchestral symphony for the first time would be an absolutely mind-blowing, borderline religious experience. Are there any primary accounts of this?",
  "created_utc": 1616402501,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This might not be accurate, but I’d assume that the average citizen had very limited experience to performed music - maybe from a single instrument or from smaller musical troupes. In this case, I can only imagine that the experience of hearing an orchestral symphony for the first time would be an absolutely overwhelming sensory experience to someone who had only heard simple folk songs until that point in their lives. Are there any accounts of what this was like? I just can&#39;t imagine the wonder of what that would feel like considering the lack of all media at the time.</p>\n</div><!-- SC_ON -->",
  "score": 130,
  "permalink": "/r/AskHistorians/comments/mag4kt/id_imagine_that_for_the_average_european_during/",
  "subreddit": "AskHistorians",
  "id": "mag4kt",
  "is_self": true,
  "media": null,
  "is_video": false
}