{
  "author": "Zori-an",
  "the_new_excerpt": "TLDR at the bottom.\n\nThe CEO of AMC has publicly promised yesterday to submit in writing with the SEC\nthat AMC does not plan to issue any of the 500m shares if authorized by\nshareholders in May.\n\nHappy to report that as of this morning AMC filed Statement…",
  "original_created_utc": 1618491419,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "下部にTLDRがあります。\n\nAMCのCEOは、昨日、SECに書面で提出することを公約しました。\n5月に株主総会で承認された場合、AMCは5億株の発行を予定していないことを、昨日SECに書面で提出することを公約しました。\n書面を提出することを昨日公約しました。\n\nその結果、今朝、AMCはステートメントを提出しましたのでご報告します。",
      "title": "AMCは、2021年に認可された場合、5億株の株式を発行しないという約束をSECに提出しましたが、これは実際には何を意味するのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TLDR在底部。\n\nAMC的CEO昨天已经公开承诺，将向美国证监会提交书面材料。\nAMC不打算在获得授权的情况下发行任何5亿股股份。\n股东在五月。\n\n很高兴地报告，截至今天早上AMC提交了声明...",
      "title": "AMC向美国证券交易委员会提交了其承诺，如果在2021年获得授权，将不会发行任何5亿股的股票--但这究竟意味着什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TLDR在底部。\n\nAMC的CEO昨天已經公開承諾，將向美國證監會提交書面材料。\nAMC不打算在獲得授權的情況下發行任何5億股股份。\n股東在五月。\n\n很高興地報告，截至今天早上AMC提交了聲明...",
      "title": "AMC向美國證券交易委員會提交了其承諾，如果在2021年獲得授權，將不會發行任何5億股的股票--但這究竟意味着什麼？"
    }
  ],
  "title": "AMC filed with the SEC its promise not to issue any of the 500m shares if authorized in 2021 - but what does this really mean?",
  "created_utc": 1618521222,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TLDR at the bottom. </p>\n\n<p>The CEO of AMC has publicly promised yesterday to submit in writing with the SEC that AMC does not plan to issue any of the 500m shares if authorized by shareholders in May. </p>\n\n<p>Happy to report that as of this morning AMC filed <a href=\"https://d18rn0p25nwr6d.cloudfront.net/CIK-0001411579/e5d2e721-c60b-4f74-9f90-7e970a8fc426.html\">Statement 14A</a> reiterating exactly what AA said in the interview: </p>\n\n<blockquote>\n<p><strong>Adam Aron</strong>: We are going to pledge right now today publicly and we will file this publicly so it will be binding on us, because you can’t announce intentions and then not carry through it, we hereby pledge at AMC that if the shareholders approve this authorization for 500 million new shares to be issued we will not use one of those 500 million shares in calendar year 2021. Not one. Not one.</p>\n\n<p>. . .</p>\n\n<p><strong>Adam Aron</strong>: If we need to raise some cash in the short term, remember we already have 43 million shares that are out there that were authorized in the year 2013 that we could use if we wish to raise some cash, if we decide that’s a good idea. We have made no decisions yet. We are thinking about it, but we haven’t made any decisions yet.</p>\n</blockquote>\n\n<p>This is a cause for cautious celebration - the CEO stands by his statement, and is serious about keeping the promise. </p>\n\n<p>But, the emphasis is on cautious. First rule of sound investing - read the fine print. That’s how they screw you. </p>\n\n<blockquote>\n<p>Should one or more of these risks, trends, uncertainties or facts [listed above] materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those indicated or anticipated by the forward-looking statements contained herein. <strong>Accordingly, you are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date they are made.</strong> Forward-looking statements should not be read as a guarantee of future performance or results and will not necessarily be accurate indications of the times at, or by, which such performance or results will be achieved.</p>\n</blockquote>\n\n<p>Let me unpack this for you. <strong>AMC is saying that if any of the bad things they listed in the statement happen  they will not hesitate one moment to issue more shares.</strong>. Theater openings delayed? More shares. AMC can’t pay its interest and debt on schedule? More shares. Motion pictures companies don’t want to screen their movies at theaters for months and go to their own digital platform after two weeks? You got it, more shares. </p>\n\n<p><strong>STAY DILIGENT AND DO WHATS BEST FOR YOUR WALLET</strong></p>\n\n<p>Seen many people switch to an automatic “yes” on their vote. I won’t be one of those people. </p>\n\n<p>I’m not an advisor or your advisor, financial or otherwise. I’m just a guy with thousands of AMC shares who likes to read the fine print and make weighted decisions based on facts. </p>\n\n<p>Full disclosure - I sold a third of my April 2019 shares in January to recoup basis and take profits. The rest is in for the ride as it’s all pure profit, so naturally I want it to go as high as possible.</p>\n\n<p>TLDR: good news the CEO stood by his promise. Bad news they can still issue more shares if the situation gets worse this year. My “no” vote stands.</p>\n</div><!-- SC_ON -->",
  "score": 1740,
  "permalink": "/r/wallstreetbets/comments/mre3bi/amc_filed_with_the_sec_its_promise_not_to_issue/",
  "subreddit": "wallstreetbets",
  "id": "mre3bi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171530303
}