{
  "author": "Chicky_Nuggy",
  "original_created_utc": 1634674063,
  "title": "Tell me one thing about yourself and I will tell you which coin to invest in.",
  "created_utc": 1634729616,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Based off this one sentence alone, I, Chicky Nuggy will have enough power in my knowledge to tell you which coin you should invest in that matches your personality and style. </p>\n\n<p>Digital currencies might be making all the headlines right now, but which should you invest your money in? C Nuggy has this answer for you. </p>\n\n<p>Regulators around the world are cracking down on cryptocurrencies and some crypto exchanges. But that hasn’t put off the big technology companies like Amazon.so why should it put you and your spare change off? </p>\n\n<p>Don&#39;t bother with your own research this is financial advice from a Nugget.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/qbjqzm/tell_me_one_thing_about_yourself_and_i_will_tell/",
  "subreddit": "CryptoCurrency",
  "id": "qbjqzm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Based off this one sentence alone, I, Chicky Nuggy will have enough power in my\nknowledge to tell you which coin you should invest in that matches your\npersonality and style.\n\nDigital currencies might be making all the headlines right now, but which should\nyou invest your money in? C Nuggy has this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この一文だけで、私、Chicky Nuggyは、自分の知識に十分な力を持ち、自分に合ったコインを教えてくれるでしょう。\nあなたの性格に合った投資すべきコインを教えてくれます。\nを教えてくれるでしょう。\n\n今、デジタル通貨が話題になっていますが、あなたはどのコインに投資すべきでしょうか？\nお金を投資するべきなのでしょうか？C Nuggyはこの...",
      "title": "あなたのことを一つ教えてくれたら、どのコインに投資すればいいか教えます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "仅凭这一句话，我，Chicky Nuggy将有足够的能力在我的\n我，Chicky Nuggy将有足够的能力告诉你，你应该投资于哪种与你的个性和风格相匹配的钱币。\n的个性和风格。\n\n数字货币可能是现在所有的头条新闻，但你应该\n你应该把你的钱投资在哪个地方？C Nuggy有这个...",
      "title": "告诉我关于你自己的一件事，我会告诉你应该投资哪种硬币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "僅憑這一句話，我，Chicky Nuggy將有足夠的能力在我的\n我，Chicky Nuggy將有足夠的能力告訴你，你應該投資於哪種與你的個性和風格相匹配的錢幣。\n的個性和風格。\n\n數字貨幣可能是現在所有的頭條新聞，但你應該\n你應該把你的錢投資在哪個地方？C Nuggy有這個...",
      "title": "告訴我關於你自己的一件事，我會告訴你應該投資哪種硬幣。"
    }
  ]
}