{
  "author": "nmesunimportnt",
  "original_created_utc": 1649621684,
  "title": "In Homer and Arabian Nights, there are repeated mentions of mixing wine with water before drinking. Why did people in these societies do that? Was the practice widespread? Why did it end?",
  "created_utc": 1649647881,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m currently reading &lt;em&gt;Arabian Nights&lt;/em&gt; and especially in some of the earlier stories (Lyons’ English translation), characters mix wine with water. Reminds me of similar things in Homer. Was that done to dilute the wine because it was strongly flavored (or maybe it tasted bad)? To reduce alcohol consumption? What? To try and disinfect iffy water?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/AskHistorians/comments/u0pyr8/in_homer_and_arabian_nights_there_are_repeated/",
  "subreddit": "AskHistorians",
  "id": "u0pyr8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m currently reading Arabian Nights and especially in some of the earlier\nstories (Lyons’ English translation), characters mix wine with water. Reminds me\nof similar things in Homer. Was that done to dilute the wine because it was\nstrongly flavored (or maybe it tasted bad)? To reduce alcohol…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、アラビアンナイトを読んでいるのですが、特に初期のものでは\nの話（Lyonsの英訳）では、登場人物がワインと水を混ぜたりします。思い出すのは\nホメロスに似たようなことが書かれています。ワインを薄めるためにやったのでしょうか。\n味が濃い（というか不味い）？アルコールを減らすために...",
      "title": "ホメロス』や『アラビアンナイト』には、ワインを水で割ってから飲むという記述が繰り返し出てくる。なぜ、このようなことが行われたのだろうか。その習慣は広まっていたのでしょうか？また、その習慣はなぜ終わったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我目前正在读《天方夜谭》，特别是在早期的一些故事中\n里昂的英译本），人物把酒和水混在一起。这让我想起\n荷马史诗中的类似内容。这样做是为了稀释葡萄酒，因为它是\n强烈的味道（或者也许味道不好）？为了减少酒精...",
      "title": "在《荷马史诗》和《天方夜谭》中，多次提到在饮用前将酒与水混合。为什么这些社会的人们会这样做？这种做法是否很普遍？它为什么会结束？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我目前正在讀《天方夜譚》，特別是在早期的一些故事中\n里昂的英譯本），人物把酒和水混在一起。這讓我想起\n荷馬史詩中的類似內容。這樣做是爲了稀釋葡萄酒，因爲它是\n強烈的味道（或者也許味道不好）？爲了減少酒精...",
      "title": "在《荷馬史詩》和《天方夜譚》中，多次提到在飲用前將酒與水混合。爲什麼這些社會的人們會這樣做？這種做法是否很普遍？它爲什麼會結束？"
    }
  ]
}