{
  "author": "IJustLovePeach",
  "original_created_utc": 1657216530,
  "title": "I’m 30 with no real success under my belt. Should I feel ashamed of my life?",
  "created_utc": 1657253654,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m 30. I live with parents. That right there would conjure up in some peoples minds an image of a certain type of individual. Especially where I’m from in the US. &lt;/p&gt;\n\n&lt;p&gt;Here You’re supposed to be out of the house at 18 or 19. My aunts, uncles, and cousins are all pretty successful - some of them own multiple large properties. I’m not sure what most of them think of me but one uncle in particular likes to bring it up during holiday gatherings a lot. I hear about him being out of the house at 18, getting married, and owning a large house at 20. I’m not able to. &lt;/p&gt;\n\n&lt;p&gt;I see a lot of characters in shows and movies that are these gross, unhygienic, leeches who refuse to do anything productive. They live with their parents and are just all around not good people. I see that and I think “God I hope that isn’t me”. And over the years I’ve done everything in my power to distance myself from being that kind of person. &lt;/p&gt;\n\n&lt;p&gt;My parents never had to convince me to work. I went out and found it myself. I bought my own car. I pay for it’s repairs, gas, and insurance. I pay for my own phone. My own health insurance. Everything. My older brother is severely mentally handicapped and nonverbal. He needs help watching over. So if my parents need to be somewhere I’m always willing to stay behind. If my dad needs help with a project, I’m always there. They allow me breathing room to have time for myself but I always ensure that my free time doesn’t take priority over their needs. &lt;/p&gt;\n\n&lt;p&gt;But recently something came up. My car had a lot of issues cluster together at once and it was going to be a massive payment and my parents offered to take up part of it since I was unable to. This killed me inside. The whole point was to save up so they wouldn’t have to do this. Of course I’ll be paying them back. But I hoped they’d never have to come to my rescue. &lt;/p&gt;\n\n&lt;p&gt;It’s left me thinking about life. Am I a bad person? I’m someone who just doesn’t need a lot in life. We all get along very well so there’s that. But I still feel like a burden and feel like a failure. They like me being there to help my brother. So I guess they figure that’s more or less my rent. It would be a huge burden on them if I left. But I feel like a burden if I stay. I think my extended family is a bit ashamed of me. And I don’t know if I should be feeling the same or not.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/vtonob/im_30_with_no_real_success_under_my_belt_should_i/",
  "subreddit": "TooAfraidToAsk",
  "id": "vtonob",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m 30. I live with parents. That right there would conjure up in some peoples\nminds an image of a certain type of individual. Especially where I’m from in the\nUS.\n\nHere You’re supposed to be out of the house at 18 or 19. My aunts, uncles, and\ncousins are all pretty successful - some of them own…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は30歳です。親と同居しています。というのは、ある人たちにとって\nある種の個人的なイメージを思い起こさせるでしょう。特に私の出身地であるアメリカでは\nアメリカです。\n\nこちらでは、18歳か19歳になったら家を出ることになっています。私の叔母、叔父、そして\n私の叔父、叔母、いとこたちは皆、かなり成功しています。",
      "title": "私は30歳で何の実績もない。自分の人生を恥じるべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我30岁了。我和父母住在一起。这一点会让一些人联想到\n某种类型的人的形象。特别是在我的家乡\n美国。\n\n在这里，你应该在18或19岁就离开家。我的姑姑、叔叔和\n表兄弟姐妹都很成功--他们中有些人拥有...",
      "title": "我30岁了，还没有真正的成功。我应该为自己的生活感到羞愧吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我30歲了。我和父母住在一起。這一點會讓一些人聯想到\n某種類型的人的形象。特別是在我的家鄉\n美國。\n\n在這裏，你應該在18或19歲就離開家。我的姑姑、叔叔和\n表兄弟姐妹都很成功--他們中有些人擁有...",
      "title": "我30歲了，還沒有真正的成功。我應該爲自己的生活感到羞愧嗎？"
    }
  ]
}