{
  "author": "uqhg",
  "original_created_utc": 1643489222,
  "title": "I'm a bank teller at a large North American Bank, and every day I'm reminded how much we need Bitcoin.",
  "created_utc": 1643535647,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As someone who works for a bank in a customer-facing retail setting I&amp;#39;m one of the first people they come to when they have banking issues they need help with, or complaints with our policies.&lt;/p&gt;\n\n&lt;p&gt;These issues/complaints include any and all of the following:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Credit/debit card fraud in which their card is being used without their permission.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Card fraud in which their card/personal details where stolen either through phishing or a similar scam.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Cards being locked due to &amp;quot;suspicious transactions&amp;quot;(which might not even be suspicious in many cases which just frustrates people)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Checks being put on hold for anywhere between 1-6 business days, or even up to 10 for big checks.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Accounts being partially frozen or even closed due to potential \nfraud activity.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Payment apps like Zelle either not letting people link their accounts, or blocking payments due to lack of similar payment activity or whatever they deem &amp;quot;suspicious activity&amp;quot;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Customer cannot easily transfer funds from their old bank to ours because the other bank has no local branches&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Customers wanting large withdrawals, but don&amp;#39;t we don&amp;#39;t have enough cash on hand to give it all to one customer&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;National coin shortage causing frustration for business customers&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Wire transfer fees/processing time&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Maintenance fees&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Overdraft fees&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Bank check/money order fees&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Non-customer fees&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Non-customer ATM fees&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&amp;quot;Non-transactional account&amp;quot; transfer fees&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Pending transactions taking days to post&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Real companies making charges on people&amp;#39;s cards when they haven&amp;#39;t even been there in months&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;People complaining the ATM doesn&amp;#39;t work after they just stuffed dozens of shitty dirty bills and water stained checks in it&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;A couple deposited all their money via bank check from their old bank and it was put on hold for over a week leaving them with no money.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Woman wanted to wire $100 to her family but was turned away because Intl wires cost $50 off the top and may or may not have fees on the receiving bank as well.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Guy couldn&amp;#39;t access his money from his old bank across the country which required him to physically be there to initiate a wire.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Guy lost a fairly large bank check in the parking lot a few plazas over and took weeks to get in contact with him to put a stop on it.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Checks/cards not showing up in the mail, wasting people&amp;#39;s time to have to come in and reorder and put stops on the lost items.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Old people who literally pay money to buy checks only to drive to the bank, stand in line, and write themselves a check for $100 cash  and ask for a balance - only to repeat this every other day.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The fact that these problems and inconveniences even exist is a problem in itself. Bitcoin fixes all of these because they are completely irrelevant on a Bitcoin system. In economics 101 they teach you that the definition of an efficient market is one where &lt;strong&gt;all information is transmitted perfectly, completely, instantly, and for no cost&lt;/strong&gt;. Bitcoin dramatically increases efficiency in banking and will inevitably become the standard medium of storing money/value.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Food for thought:&lt;/strong&gt; Customers will often ask for their pay checks to deposited as cash. If we can tell the check is legit or if we&amp;#39;re familiar with the person(kyc) we&amp;#39;ll deposit it as cash even though the check is from another institution, meaning in reality the receiving bank isn&amp;#39;t getting anything besides a piece of paper and a promise that the account on the check is good for the funds. Verifying those funds takes a business day or more, but meanwhile the funds get poofed into the persons account at the click of a button. Also as many of you know, since March 2020, deposit institutions are now required to keep 0% of their total deposit accounts in cash reserves. Zero percent! &lt;/p&gt;\n\n&lt;p&gt;So that&amp;#39;s why when I hear someone say that Bitcoin isn&amp;#39;t &amp;quot;backed&amp;quot; by anything, my question is what the hell is a dollar backed by besides dirty green rectangles with some old guy&amp;#39;s signature?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 317,
  "permalink": "/r/Bitcoin/comments/sfraxe/im_a_bank_teller_at_a_large_north_american_bank/",
  "subreddit": "Bitcoin",
  "id": "sfraxe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As someone who works for a bank in a customer-facing retail setting I'm one of\nthe first people they come to when they have banking issues they need help with,\nor complaints with our policies.\n\nThese issues/complaints include any and all of the following:\n\n * Credit/debit card fraud in which their…"
}