{
  "author": "mybed54",
  "the_new_excerpt": "Bitcoin maxis are one of the most toxic/arrogant groups I've encountered here,\neven when I was a beginner. They claim every coin that isn't BTC is a absolute\nshitcoin and that BTC has no problems what so ever. It's a massive circle jerk\nof people who've made Bitcoin into their entire personality…",
  "original_created_utc": 1619849546,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインマキシは、私がここで遭遇した中で最も有害で傲慢なグループの一つです。\n私が初心者だった時でさえも。彼らは、BTC以外のすべてのコインは絶対的なクソコインで、BTCには何の問題もないと主張しています。\nBTCには何の問題もないと言っています。それは大規模なサークルジャークです。\nビットコインを自分の全ての人格にしてしまった人たちの大規模なサークルジャークです...",
      "title": "ビットコインのマキシは、長期的にはビットコインの没落につながる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Bitcoin maxis是我在这里遇到的最毒辣/傲慢的群体之一。\n甚至当我还是个初学者的时候。他们声称所有不是BTC的币都是绝对的\n而BTC没有任何问题。这是一个巨大的圈子\n他们把比特币当成了自己的全部人格...",
      "title": "从长远来看，比特币最大值将导致比特币的衰落"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Bitcoin maxis是我在這裏遇到的最毒辣/傲慢的羣體之一。\n甚至當我還是個初學者的時候。他們聲稱所有不是BTC的幣都是絕對的\n而BTC沒有任何問題。這是一個巨大的圈子\n他們把比特幣當成了自己的全部人格...",
      "title": "從長遠來看，比特幣最大值將導致比特幣的衰落"
    }
  ],
  "title": "Bitcoin maxis will lead to the downfall of Bitcoin in the long run",
  "created_utc": 1619918753,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bitcoin maxis are one of the most toxic/arrogant groups I&#39;ve encountered here, even when I was a beginner. They claim every coin that isn&#39;t BTC is a absolute shitcoin and that BTC has no problems what so ever. It&#39;s a massive circle jerk of people who&#39;ve made Bitcoin into their entire personality (almost as if their using it to cover up insecurities). And they&#39;ve only gotten worse with BTC&#39;s declining dominance. We get it Bitcoin is neat, you don&#39;t need to have a Bitcoin pogo stick in your ass all the time. Most of the time they don&#39;t care at all about trying to solve the issues BTC has and when they try to they do it in a contradictory manner. These type of people would be the equivalent of me trying to tell people why we should only use the iPhone 1 and nothing else forever. It&#39;s so ridiculous how close minded they can be. This sort of complacency and toxicity will lead to Bitcoin being flipped I can assure you. Hell, ETH is creeping up because they actually have the capacity to evolve--you know how all technology does.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/n2ckm2/bitcoin_maxis_will_lead_to_the_downfall_of/",
  "subreddit": "CryptoCurrency",
  "id": "n2ckm2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380961467
}