{
  "author": "skysmoker",
  "the_new_excerpt": "He made a point to let everyone know this morning, when people were very uneasy\nalready, how he sold off his $2M in alts. Basically trying to encourage people\nto sell their stack too.\n\nBen's stuff is unbearable with his cringyness as it is and lately the FUD he is\nstirring up. Please don't listen to…",
  "original_created_utc": 1622354422,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼は、人々が非常に不安になっている今朝、アルトを200万ドル売却したことを皆に知らせました。\n200万ドルのアルトを売却したことを伝えました。基本的には、人々に\nしています。\n\nベンの話は、彼の不愉快さには耐えられないし、最近では彼が煽っているFUDにも耐えられない。\n煽っています。頼むから聞かないでくれ...。",
      "title": "BitBoy CryptoのBen Armstrongは、「準備」のために今朝早く、自分のアルトを200万ドル売ったことを発表するビデオを作った。彼は今、パニック・バイをしているのだろう。Sell Low Buy Highが彼のゲームの名前です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天早上，他特意让大家知道，当人们已经非常不安的时候\n的时候，他特意让大家知道他是如何卖掉他的200万美元的代理账户的。基本上试图鼓励人们\n也卖掉他们的堆栈。\n\n本的东西是令人无法忍受的，他的粗俗和最近他的FUD\n煽动起来的。请不要听信...",
      "title": "BitBoy Crypto的Ben Armstrong制作了一个视频，宣布他今天早上早些时候如何卖掉了200万美元的代理资产，以做好 \"准备\"。他现在可能是恐慌性购买。低卖高买是他游戏的名字。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天早上，他特意讓大家知道，當人們已經非常不安的時候\n的時候，他特意讓大家知道他是如何賣掉他的200萬美元的代理賬戶的。基本上試圖鼓勵人們\n也賣掉他們的堆棧。\n\n本的東西是令人無法忍受的，他的粗俗和最近他的FUD\n煽動起來的。請不要聽信...",
      "title": "BitBoy Crypto的Ben Armstrong製作了一個視頻，宣佈他今天早上早些時候如何賣掉了200萬美元的代理資產，以做好 \"準備\"。他現在可能是恐慌性購買。低賣高買是他遊戲的名字。"
    }
  ],
  "title": "BitBoy Crypto's Ben Armstrong made a video to announce how he sold $2M of his alts earlier this morning to get \"ready\". He probably panic buying right now. Sell low buy high is the name of his game.",
  "created_utc": 1622387028,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>He made a point to let everyone know this morning, when people were very uneasy already, how he sold off his $2M in alts. Basically trying to encourage people to sell their stack too.</p>\n\n<p>Ben&#39;s stuff is unbearable with his cringyness as it is and lately the FUD he is stirring up. Please don&#39;t listen to this guy who likes to sell low buy high.</p>\n\n<p>not going to link his video to give him views but if you are curious you can look up the video from this morning</p>\n</div><!-- SC_ON -->",
  "score": 296,
  "permalink": "/r/CryptoCurrency/comments/no4pxh/bitboy_cryptos_ben_armstrong_made_a_video_to/",
  "subreddit": "CryptoCurrency",
  "id": "no4pxh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804296496
}