{
  "author": "toxic12093ureta",
  "the_new_excerpt": "Please stop idolizing celebrities and millionaires that invest into crypto.\nCrypto is meant to be decentralized and not controlled by one single entity\n\nPeople like Jack Dorsey, Elon musk, and Michael saylor shouldn't be idolized and\ntheir investments or tweets shouldn't affect the market.\n\nYes its…",
  "original_created_utc": 1621109748,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号に投資する有名人や大富豪を偶像化するのはやめてください。\n暗号は非中央集権的なものであり、一つの団体にコントロールされるものではありません。\n\nジャック・ドーシー、イーロン・マスク、マイケル・セイラーのような人たちを偶像化すべきではありません。\n彼らの投資やつぶやきが市場に影響を与えるべきではない。\n\nそうですね...。",
      "title": "暗号に投資する有名人や大富豪を偶像化するのはやめてください。暗号は分散化されたものであり、1つの団体にコントロールされるものではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "请不要再把投资于加密货币的名人和百万富翁当作偶像。\n加密货币的目的是去中心化，而不是由一个单一实体控制。\n\n像Jack Dorsey、Elon musk和Michael saylor这样的人不应该被当作偶像，他们的投资或推特不应该影响市场。\n他们的投资或推特不应该影响市场。\n\n是的，它...",
      "title": "请不要再把投资于加密货币的名人和百万富翁当作偶像。加密货币的目的是去中心化，而不是由一个单一实体控制。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "請不要再把投資於加密貨幣的名人和百萬富翁當作偶像。\n加密貨幣的目的是去中心化，而不是由一個單一實體控制。\n\n像Jack Dorsey、Elon musk和Michael saylor這樣的人不應該被當作偶像，他們的投資或推特不應該影響市場。\n他們的投資或推特不應該影響市場。\n\n是的，它...",
      "title": "請不要再把投資於加密貨幣的名人和百萬富翁當作偶像。加密貨幣的目的是去中心化，而不是由一個單一實體控制。"
    }
  ],
  "title": "Please stop idolizing celebrities and millionaires that invest into crypto. Crypto is meant to be decentralized and not controlled by one single entity.",
  "created_utc": 1621121436,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Please stop idolizing celebrities and millionaires that invest into crypto. Crypto is meant to be decentralized and not controlled by one single entity</p>\n\n<p>People like Jack Dorsey, Elon musk, and Michael saylor shouldn&#39;t be idolized and their investments or tweets shouldn&#39;t affect the market. </p>\n\n<p>Yes its great, that they bring attention to crypto and it  helps it go mainstream but it&#39;s cons outweigh the pros.</p>\n\n<p>Do your own research before investing and don&#39;t let other peoples fear dictate your financial future.</p>\n\n<p>I honestly believe, the sooner we stop listening to these people the healthier the markets will be!</p>\n\n<p>Also, don&#39;t take loans out to purchase crypto, that is insanity and your better off taking that money and going to the roulette table.</p>\n</div><!-- SC_ON -->",
  "score": 4971,
  "permalink": "/r/CryptoCurrency/comments/nd7hih/please_stop_idolizing_celebrities_and/",
  "subreddit": "CryptoCurrency",
  "id": "nd7hih",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590798343
}