{
  "author": "zeroboundss",
  "original_created_utc": 1651423935,
  "title": "After weeks of research I think there is enough evidence out there to prove that a sophisticated attack is being executed on crypto which is orchestrated by the central bank of Netherlands &amp; CBE with the sole purpose of suppressing crypto prices. Here are my findings.",
  "created_utc": 1651433625,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h1&gt;Objective: Ending bitcoin&amp;#39;s four year cycles and their effect on the wider crypto markets&lt;/h1&gt;\n\n&lt;p&gt;Bitcoin&amp;#39;s halving cycles are the prime target because they are the main catalyst behind all crypto bull cycles. When bitcoin rallies, fresh capitals flow into crypto, and those seeking higher returns flow from bitcoin into altcoins with emerging narratives. When a bull cycle ends most of these profits then flow back into bitcoin and a fraction of these into fiat and stablecoins. As inflation materialises, it exposes more of the flaws and corrupt nature of central bank controlled fiat currencies. As result the incentive for capitals to jump back in crypto, or stay in crypto altogether by parking in stablecoins, is/will be stronger at the end of the current cycle than it was at the end of any of the earlier cycles where expansionary monetary policy was at an earlier stage. Vis-a-vis increasingly inflationary fiat currencies and never ending expansionary monetary policies, non inflationary cryptos such as bitcoin become a natural hedge against inflation as they allow savers to preserve more of their purchase power.&lt;/p&gt;\n\n&lt;p&gt;Less people using fiat currencies undermines the authority of central banks. CBs are the strings through which big private banks and corporations (puppeteers) pull the strings of politicians and policymakers (puppets). To maintain their power and relevance banks will not go down without a fight, and putting up a good fight is what they are doing, especially in the EU. Banks&amp;#39; mission is to strangulate a competitor that generates more value for society, crypto, and for this they have come up with a doctrine on where and how to hit crypto.&lt;/p&gt;\n\n&lt;h1&gt;The Ideologue&lt;/h1&gt;\n\n&lt;p&gt;The chief ideologue is &lt;a href=\"https://www.researchgate.net/profile/Alex-De-Vries\"&gt;Alex De Vries&lt;/a&gt;, an analyst of the central bank of Netherlands and founder of the anti crypto blog &lt;a href=\"https://digiconomist.net/\"&gt;Digiconomist&lt;/a&gt;. De Vries is also a researcher of the University Vrije of Amsterdam. By going through his research papers on Researchgate, I found out that he has been obsessed with the idea of ending bitcoin&amp;#39;s halving cycles to undermine its profitability for holders and role as inflation hedge. He has re-affirmed it over and over in all possible mediums, not just academic but also in political and financial salons as well as (pseudo) procrypto conferences such as Consensys.&lt;/p&gt;\n\n&lt;p&gt;In one of his latest statements, commenting on crypto&amp;#39;s climate footprint debate and the role bitcoin could have in climate change, De Vries has listed the 2 ways in which Europe could contain (capitals flows into) crypto without upsetting the US crypto players, investment funds and corporations that have added crypto to their balance sheets:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Taxation and transaction limits&lt;/li&gt;\n&lt;li&gt;Implementing trading restrictions against some cryptos (bitcoin)&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Pertaining the first weapon, we are already seeing laws &amp;amp; regulation to kyc unhosted wallets and eventually roll out additional limits that were unthinkable before. This &lt;a href=\"https://www.forbes.com/sites/billybambrough/2022/04/24/target-the-bitcoin-price-internal-documents-reveal-how-the-eu-could-try-to-ban-bitcoin-and-protect-ethereum/?sh=6efeb9e27201\"&gt;Forbes article&lt;/a&gt; is also revealing as it discusses pushes from lobbyists to orient policymakers towards measures that discourage activities that could act as a price catalyst for bitcoin by encouraging traders to orient towards ethereum instead. The excuse is, of course, climate change. In reality however the reason is that Ether was always designed to have a limited upside price wise.&lt;/p&gt;\n\n&lt;h1&gt;Why crypto bull cycles undermine the stability of the Euro (but not the USD)&lt;/h1&gt;\n\n&lt;p&gt;As explained in the above paragraphs, Europe is the epicenter of the efforts of anti-crypto strategies meant to discourage adoption and create entry barriers for capitals looking to enter crypto markets. The ultimate objective of the guidelines published by the DNB and CBE is to make crypto less profitable by breaking the halving cycles. If crypto stops being profitable for &lt;em&gt;hodlers,&lt;/em&gt; they could still be used as a store of value, as it happens in the US, but without doing too much damage to the euro. It is this principle on which Fabio Panetta&amp;#39;s most recent statement stands:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;a href=\"https://www.ecb.europa.eu/press/key/date/2022/html/ecb.sp220425%7E6436006db0.en.html\"&gt;We should make faster progress if we want to ensure that crypto-assets do not trigger a lawless frenzy of risk-taking.&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Fabio Panetta is a member of the executive council of the European Central Bank. What Mr Panetta means with &lt;em&gt;lawless frenzy of risk taking&lt;/em&gt; is nothing less than price rallies that would allow savers to obtain higher profits by investing in crypto than by investing their savings in traditional investment vehicles controlled by the institution in whose executive board Mr Panetta sits. Obviously, dinosaurs like Mr Panetta that have abused with impunity European savers and the European middle class for decades, are horrified by the prospects of crypto adoption. It is a simple matter of competition not only against crypto, but also against the US dollar. In fact with every bull cycle more capitals flow into crypto and with profit taking most of capitals that originated from euro are then parked into US dollars. The main reason for this is the absence of any euro stablecoins (there are some, but with negligible adoption).&lt;/p&gt;\n\n&lt;p&gt;This flight of capitals at every bull cycle is another reason why European banks (spearheaded by the ECB and DNB) are more wary of crypto than their US counterparts. The US Treasury is well aware of this mechanism and the positive effect it has on the US dollar.&lt;/p&gt;\n\n&lt;h1&gt;The difference between the US and EU crypto approach&lt;/h1&gt;\n\n&lt;p&gt;The influence on crypto markets from the EU and US are different because while in the US we see increasing institutional involvement, in the EU it is the retail market to have expanded most in the past couple of years. US institutional adoption has contributed to minimise crypto volatility mainly through the emergence of institutional investors, that act as long term hodlers. Another mechanism is the fact that having the US become the global crypto mining hub, US miners have more access to capital markets and don&amp;#39;t need to sell their coins on the spot. This displacement of spot markets from Asia into the US has/will stabilise prices further limiting also the upside since crashes are one of the strong catalysts for higher highs. I&amp;#39;ve found &lt;a href=\"https://www.ar.ca/blog/author/katie-talati\"&gt;Katie Talatie&amp;#39;s&lt;/a&gt; comments on the impact of US markets on crypto particularly enlightening in this sense.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/n4nq0hbb7ww81.png?width=1274&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=8c26e0b61a453b203e26fd283d95e79c717a45d9\"&gt;https://preview.redd.it/n4nq0hbb7ww81.png?width=1274&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=8c26e0b61a453b203e26fd283d95e79c717a45d9&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Talati explains best what she is closest to, the dynamics of US crypto markets. In Europe the situation is different, as shown also in the above chart, retail adoption/activity prevails in European markets. This is why in Europe the optics are different and non inflationary cryptocurrencies like Bitcoin are seen as a double threat to the euro, because try also facilitate capital flights into usd. This brings us back to the second weapon proposed by De Vries to limit the impact/competitiveness of crypto against the euro without upsetting US players, that is that of limiting/restricting the trading of bitcoin (the most hated crypto by EU banks). It won&amp;#39;t be long before we see some laws in this regard in EU.&lt;/p&gt;\n\n&lt;h1&gt;Conclusion&lt;/h1&gt;\n\n&lt;p&gt;Every crypto enthusiast, especially in the EU, should be aware of the sophisticated attack orchestrated and executed by the DNB and ECB against crypto. This attack is happening right under everyone&amp;#39;s nose and is aimed at keeping europeans backed in a corner with no choice but to keep their wealth in euros, from where it can be siphoned off/stolen through inflation. It is likely that other regulators around the globe will copy these strategies or become more receptive to them. While I believe that crypto markets will eventually shake them, I think this will be a long war as regulators and banks won&amp;#39;t give up easy. `&lt;strong&gt;Beware and distance yourself of politicians or political parties that are aligned to these policies.&lt;/strong&gt; This is a fight that has to be fought by today&amp;#39;s population of crypto enthusiasts. We need to keep exposing and educating.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/vjdeu6fc7ww81.png?width=2292&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=40b9032eb90e57fe19f1539d0dc3edb9e0dba23d\"&gt;https://preview.redd.it/vjdeu6fc7ww81.png?width=2292&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=40b9032eb90e57fe19f1539d0dc3edb9e0dba23d&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Another attack vector is privacy. As people opt out of the euro, surveillance laws like the proposed last month on unhosted wallets, should become more frequent and more invasive. As many surveys by the European Commission itself have shown however (chart below), privacy is where the efforts to strangulate crypto are more likely to become a political issue because europeans, even those who are not necessarily into crypto today, value privacy more than anything else when it comes to their finances.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TLDR&lt;/strong&gt;: The current anti crypto EU regulations are based on a doctrine by Alex De Vries, a DNB analyst and University researcher, who argues that breaking bitcoin&amp;#39;s halving price rally cycles is the most effective way for europeans to undermine crypto adoption. He specifically proposes taxing/limiting crypto transactions and implementing trade restrictions against certain cryptos.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 361,
  "permalink": "/r/CryptoCurrency/comments/ug41ga/after_weeks_of_research_i_think_there_is_enough/",
  "subreddit": "CryptoCurrency",
  "id": "ug41ga",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "OBJECTIVE: ENDING BITCOIN'S FOUR YEAR CYCLES AND THEIR EFFECT ON THE WIDER\nCRYPTO MARKETS\n\nBitcoin's halving cycles are the prime target because they are the main catalyst\nbehind all crypto bull cycles. When bitcoin rallies, fresh capitals flow into\ncrypto, and those seeking higher returns flow…"
}