{
  "author": "CryptoChief",
  "original_created_utc": 1635385701,
  "title": "CCIP-021 - Temporarily sort comments by newest first after a post is submitted.",
  "created_utc": 1635417466,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Summary:</strong> This proposal is for sorting comments by newest first after a post is submitted. The intended goal is to level the playing field between early bird low-effort comments and more meaningful high-effort comments by limiting visibility for the former.</p>\n\n<p><strong>Problem Statement:</strong> After a post is submitted, the first comments tend to be low-effort. Most of them are simple trite remarks or jokes about the parent post which tend not to offer much originality or value. Users who make these comments are probably only seeking attention or farming moons and often receive numerous upvotes just for being first. Users who make more meaningful comments first take time to even notice the post and additional time to write a comment.</p>\n\n<p><strong>Solution:</strong> After a submission has been posted, temporarily set the suggested comment sorting to newest first. After 30 minutes(more or less), the suggested sorting will be switched to top comments first. This change should give later comments an advantage over early comments. It might also encourage users to post more top-level comments and therefore increase the odds of triggering a discussion, since every comment will be treated the same for a set amount of time. The 30 minute time limit will be tweaked by the mod team for optimization.</p>\n\n<p><strong>Concerns:</strong> The first two items in the following list are concerns given by <a href=\"/u/CryptoMaximalist\">u/CryptoMaximalist</a> in the <a href=\"https://www.reddit.com/r/CryptoCurrencyMeta/comments/p0xprp/idea_for_the_first_few_hours_comment_sorting_is/hdqrwkp\">r/CryptoCurrencyMeta thread</a> which I have paraphrased. The last one is mine.</p>\n\n<ul>\n<li><p>Hiding comment scores for a longer period of time may be considered as an alternative method or additional measure for achieving this goal. However, this idea would have to be submitted as a separate proposal. Currently, scores are hidden for 5 minutes. Contest mode is a controlled option for hiding scores, but it also collapses lower-level comments and might hamper discussion.</p></li>\n<li><p>Many Reddit clients do not respect suggested sorting and allow the user to override them.</p></li>\n<li><p>My own minor concern would be the potential for incentivizing more spam in the top-level comments since farmers would be fighting for visibility. Rate-limits might be required.</p></li>\n</ul>\n\n<p><a href=\"https://www.reddit.com/poll/qhc2k1\">View Poll</a></p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/qhc2k1/ccip021_temporarily_sort_comments_by_newest_first/",
  "subreddit": "CryptoCurrency",
  "id": "qhc2k1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Summary: This proposal is for sorting comments by newest first after a post is\nsubmitted. The intended goal is to level the playing field between early bird\nlow-effort comments and more meaningful high-effort comments by limiting\nvisibility for the former.\n\nProblem Statement: After a post is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "概要：この提案は、投稿後にコメントを新しい順に並べるためのものです。\n投稿されます。意図した目的は、早い者勝ちの低労力コメントと意味のある高労力コメントとの間の競争条件を、制限することで公平にすることです。\nコメントの可視性を制限することで、早い者勝ちの低労力コメントと、意味のある高労力コメントの\n前者の可視性を制限することで、早い者勝ちの低努力コメントと意味のある高努力コメントとの間の競争を公平にすることです。\n\n問題提起 投稿された後に...",
      "title": "CCIP-021 - 投稿されたコメントを一時的に新しい順に並べ替える。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "摘要: 这个提议是为了在帖子提交后，将评论按最新的先排序。\n提交。其目的是为了在早起的评论和更有意义的高难度评论之间创造公平的竞争环境。\n低努力的评论和更有意义的高努力的评论之间的竞争，通过限制\n前者的可见度。\n\n问题陈述。在一个帖子被提交后...",
      "title": "CCIP-021 - 在帖子提交后，暂时按最新的评论排序。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "摘要: 這個提議是爲了在帖子提交後，將評論按最新的先排序。\n提交。其目的是爲了在早起的評論和更有意義的高難度評論之間創造公平的競爭環境。\n低努力的評論和更有意義的高努力的評論之間的競爭，通過限制\n前者的可見度。\n\n問題陳述。在一個帖子被提交後...",
      "title": "CCIP-021 - 在帖子提交後，暫時按最新的評論排序。"
    }
  ]
}