{
  "author": "sandygws",
  "original_created_utc": 1638591645,
  "title": "This is NOT the prelude to a Bear Market. This is typical Exchange and Whale fuckery at its finest",
  "created_utc": 1638610343,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Since the beginning of October, a LOT of new money has flowed into crypto. We see the green shoots of mass adoption everywhere: from shitcoins like SHIB and FLOKI advertising on public transport to Big Daddy (BTC) and Queen Slim (ETH) being accepted at more retailers as an alternative to fiat.&lt;/p&gt;\n\n&lt;p&gt;Now, given that most of us are mere plankton in an ocean of Sharks and Whales, it&amp;#39;s important to start recognising these sell-off patterns and understand the way a top feeder thinks and strategises.&lt;/p&gt;\n\n&lt;p&gt;You know that new money (fresh fish) is easy picking, so, what better way to scare that new money shitless (even shirtless) than by showing a PAPER LOSS... inducing fear, uncertainty and doubt and prompting retail paper hands to think &amp;#39;it&amp;#39;s better to take a 15% loss now than a potential 50% loss later&amp;#39;. Rinse, repeat.&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;ve seen it MULTIPLE times this year and the only thing to remember is this: there are hundreds of BILLIONS of dollars worth of large Whale holdings... Do you seriously think those big players would ever swallow so much fresh fish that they&amp;#39;d choke?&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s right, they wouldn&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;So stop giving them discounted coins and remember that there is only one thing which matters in crypto: you never make a loss &lt;strong&gt;until&lt;/strong&gt; you sell.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 192,
  "permalink": "/r/CryptoCurrency/comments/r8hdgi/this_is_not_the_prelude_to_a_bear_market_this_is/",
  "subreddit": "CryptoCurrency",
  "id": "r8hdgi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Since the beginning of October, a LOT of new money has flowed into crypto. We\nsee the green shoots of mass adoption everywhere: from shitcoins like SHIB and\nFLOKI advertising on public transport to Big Daddy (BTC) and Queen Slim (ETH)\nbeing accepted at more retailers as an alternative to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "10月の初めから、多くの新しい資金が暗号に流れ込んでいます。私たちは\nSHIBのようなクソコインから、SHIBEのようなクソコインまで、あらゆるところで大衆化の芽を見ることができます。\nFLOKIが公共交通機関で広告を出したり、ビッグダディ(BTC)やクイーンスリム(ETH)\nの代替として、より多くの小売店で受け入れられています。",
      "title": "これはベアマーケットの前兆ではありません。これは典型的な取引所とクジラの愚行の最たるものです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自10月初以来，大量的新资金流入了加密货币。我们\n我们到处都能看到大规模采用的绿芽：从SHIB和FLOKI这样的狗屎币到公共场所的广告。\n从SHIB和FLOKI这样的狗屎币在公共交通工具上做广告，到Big Daddy (BTC)和Queen Slim (ETH)\n被更多的零售商所接受，作为一种替代...",
      "title": "这不是熊市的前奏。这是最典型的交易所和鲸鱼的操蛋行为。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自10月初以來，大量的新資金流入了加密貨幣。我們\n我們到處都能看到大規模採用的綠芽：從SHIB和FLOKI這樣的狗屎幣到公共場所的廣告。\n從SHIB和FLOKI這樣的狗屎幣在公共交通工具上做廣告，到Big Daddy (BTC)和Queen Slim (ETH)\n被更多的零售商所接受，作爲一種替代...",
      "title": "這不是熊市的前奏。這是最典型的交易所和鯨魚的操蛋行爲。"
    }
  ]
}