{
  "author": "Kettlebellhead",
  "the_new_excerpt": "I work in construction and whenever I see a photo of a beautiful and really old\ncastle in Europe it gets me wondering about the people who designed and built\nthem.\n\nSo with that said, what do we know about the individuals who designed and built\ncastles from 1200 and onward?\n\nIt must have been a very…",
  "original_created_utc": 1621006517,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は建築関係の仕事をしていますが、ヨーロッパの美しくて古いお城の写真を見るたびに\nヨーロッパの美しい古城の写真を見るたびに、その城を設計・建設した人たちのことが気になります。\nと思います。\n\nでは、そのような城を設計・建設した人々について、どのようなことがわかっているのでしょうか。\nとはいえ、1200年以降の城を設計・建設した人々については、どのようなことがわかっているのでしょうか？\n\nそれはきっと、とても...",
      "title": "ヨーロッパの城郭建築家"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在建筑业工作，每当我看到欧洲美丽而古老的城堡的照片时，我就会想知道设计和建造这些城堡的人。\n每当我看到欧洲美丽而古老的城堡的照片时，我就会想知道设计和建造它们的人是谁。\n他们。\n\n那么，我们对1200年及以后设计和建造城堡的人了解多少呢？\n城堡？\n\n这一定是一个非常...",
      "title": "欧洲城堡建设者"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在建築業工作，每當我看到歐洲美麗而古老的城堡的照片時，我就會想知道設計和建造這些城堡的人。\n每當我看到歐洲美麗而古老的城堡的照片時，我就會想知道設計和建造它們的人是誰。\n他們。\n\n那麼，我們對1200年及以後設計和建造城堡的人瞭解多少呢？\n城堡？\n\n這一定是一個非常...",
      "title": "歐洲城堡建設者"
    }
  ],
  "title": "European Castle builders",
  "created_utc": 1621023771,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I work in construction and whenever I see a photo  of a beautiful and really old castle in Europe it gets me wondering about the people who designed and built them. </p>\n\n<p>So with that said, what do we know about the individuals who designed and built castles from 1200 and onward? </p>\n\n<p>It must have been a very specialized group of people and possibly a project that lasted a person&#39;s entire working life (assuming it took several years to build these castles). </p>\n\n<p>Did a particular King from say, modern Germany have to outsource a well-known castle builder from France to carry out the project?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/ncbgf6/european_castle_builders/",
  "subreddit": "AskHistorians",
  "id": "ncbgf6",
  "is_self": true,
  "media": null,
  "is_video": false
}