{
  "author": "slvbtc",
  "original_created_utc": 1653174345,
  "title": "As we currently enter a recession worse than 2008 this is a reminder that everything falls initially.",
  "created_utc": 1653204870,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In 2007 as stocks formed their final peak before crashing during the 2008 global financial crisis everything fell alongside stocks. Even gold tanked and for six long months kept declining alongside stocks.&lt;/p&gt;\n\n&lt;p&gt;But then a decoupling happened, after the inital panic where everything got caught up in a global sell off gold reversed and proceeded to rally very strongly for the next 4 years while stocks kept falling. After the initial 6 months of confused panic people woke up and started searching for a safe haven.&lt;/p&gt;\n\n&lt;p&gt;Today we are already in a recession but people just dont realise it yet. Stocks have been falling since November last year, some individual stocks down 60%+, the nasdaq down 30% and the S&amp;amp;P500 just today confirming a bear market by falling more than 20%. And just like 2008 gold has been selling off alongside stocks. This time however so too has bitcoin, which just like stocks has been falling since November last year.&lt;/p&gt;\n\n&lt;p&gt;History is repeating.&lt;/p&gt;\n\n&lt;p&gt;Over the coming months all economic indicators are going to confirm that the world is in a global recession that started in November last year, and everyone will wake up. They will realise whats going on and start looking for a safe haven. Thats when gold and bitcoin will reverse and enter a strong bull market rally over the next few years while stocks keep falling and indexes languish down 70%+ from their November 2021 highs.&lt;/p&gt;\n\n&lt;p&gt;Gold may double or triple in price seeing its market cap rise from $10T to $20T or even $30T. But bitcoin is starting from a much lower $500B market cap and as banks start failing and inflation runs hotter than expected btc will race to equal golds market cap if not exceed it.&lt;/p&gt;\n\n&lt;p&gt;At a bitcoin market cap of $30T one bitcoin will be worth $1.5 million dollars.&lt;/p&gt;\n\n&lt;p&gt;I expect to see gold and bitcoin both decouple from the declining stock market over the next couple of months as a recession is officially confirmed, both beginning a multi-year bull market rally that may last until 2025 taking gold to $5000 per ounce and bitcoin above $1 million.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 315,
  "permalink": "/r/Bitcoin/comments/uuy972/as_we_currently_enter_a_recession_worse_than_2008/",
  "subreddit": "Bitcoin",
  "id": "uuy972",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In 2007 as stocks formed their final peak before crashing during the 2008 global\nfinancial crisis everything fell alongside stocks. Even gold tanked and for six\nlong months kept declining alongside stocks.\n\nBut then a decoupling happened, after the inital panic where everything got\ncaught up in a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2007年、株価が最後のピークを迎えた後、2008年の世界同時不況で暴落した。\n2007年、株価が最後のピークを迎えた後、2008年の世界金融危機であらゆるものが株価と同時に下落しました。金でさえも暴落し、6ヶ月という長い間\n金でさえも暴落し、6ヶ月もの間、株価と共に下落し続けました。\n\nしかし、最初のパニックであらゆるものが株価に巻き込まれた後、デカップリングが起こりました。\nしかし、その後、デカップリングが起こった。",
      "title": "現在、2008年以上の不況に突入していますが、これは、何事も最初は失敗するものだということを思い知らされます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "2007年，当股票在2008年全球金融危机中崩溃前形成最后的高峰时\n在2007年，当股票在2008年全球金融危机期间崩溃前形成最后的高峰时，一切都与股票一起下跌。甚至连黄金也下跌了，而且在长达六个月的时间里\n漫长的几个月里，黄金与股票一起下跌。\n\n但后来发生了脱钩，在最初的恐慌之后，所有的东西都陷入了\n陷入了一种 \"无奈 \"的境地......",
      "title": "当我们目前进入比2008年更严重的经济衰退时，这提醒我们，一切都会在最初的时候发生。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2007年，當股票在2008年全球金融危機中崩潰前形成最後的高峯時\n在2007年，當股票在2008年全球金融危機期間崩潰前形成最後的高峯時，一切都與股票一起下跌。甚至連黃金也下跌了，而且在長達六個月的時間裏\n漫長的幾個月裏，黃金與股票一起下跌。\n\n但後來發生了脫鉤，在最初的恐慌之後，所有的東西都陷入了\n陷入了一種 \"無奈 \"的境地......",
      "title": "當我們目前進入比2008年更嚴重的經濟衰退時，這提醒我們，一切都會在最初的時候發生。"
    }
  ]
}