{
  "author": "MegaChenster",
  "original_created_utc": 1635475168,
  "title": "Alt coin season is upon us, so i guess its time to gamble.",
  "created_utc": 1635492611,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>With Etherum just breaking its previous all time high of $4384, I feel like alt season bull market cycle is just around the corner. I dont feel like buying more BTC and ETH at this point as I am in the process of laddering out. </p>\n\n<p>Like other people have done in the past, I am going to buy $100 for each of the top 10 alts coins that has been upvoted/commented on this post. So, I want you all to shill me some of your favorite alts coins, preferably ones that can be purchased on Coinbase Pro, I am okay with making a Binance account too though.</p>\n\n<p>Voting/Commenting ends within 24 hrs of making this post. </p>\n\n<p>I will provide progress reports.</p>\n</div><!-- SC_ON -->",
  "score": 226,
  "permalink": "/r/CryptoCurrency/comments/qi2t3y/alt_coin_season_is_upon_us_so_i_guess_its_time_to/",
  "subreddit": "CryptoCurrency",
  "id": "qi2t3y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "With Etherum just breaking its previous all time high of $4384, I feel like alt\nseason bull market cycle is just around the corner. I dont feel like buying more\nBTC and ETH at this point as I am in the process of laddering out.\n\nLike other people have done in the past, I am going to buy $100 for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イーサリアムが過去の最高値である4384ドルを更新したことで、私はアルト・シーズンの強気の相場サイクルを感じています。\nシーズンの強気の相場サイクルがすぐそこまで来ているように感じる。今のところ、BTCやETHを買い足す気にはなれません。\n梯子をしている最中なので、今の時点でBTCやETHを買い足す気にはなれません。\n\n過去に他の人がやったように、私も100ドルを買ってみようと思います。",
      "title": "アルトコインの季節がやってきたので、そろそろギャンブルをしたいと思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "随着以太坊刚刚打破了之前的历史高点4384美元，我觉得以太坊的牛市周期即将到来。\n季的牛市周期就在眼前。我不觉得自己会买更多的\nBTC和ETH，因为我正在进行阶梯式抛售。\n\n像其他人在过去所做的那样，我打算买100美元的...",
      "title": "备用硬币的季节到了，所以我想是时候赌一把了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着以太坊剛剛打破了之前的歷史高點4384美元，我覺得以太坊的牛市週期即將到來。\n季的牛市週期就在眼前。我不覺得自己會買更多的\nBTC和ETH，因爲我正在進行階梯式拋售。\n\n像其他人在過去所做的那樣，我打算買100美元的...",
      "title": "備用硬幣的季節到了，所以我想是時候賭一把了。"
    }
  ]
}