{
  "author": "this_is_sy",
  "original_created_utc": 1655396978,
  "title": "Was inland Italy actually depopulated in the way wealthy British tourists depicted it in the 18th and 19th centuries? If so, was this actually because of malaria?",
  "created_utc": 1655412609,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A few times reading UK-based historical texts about the 18th and 19th centuries (previously in reading about the Grand Tour and Romantic era continental tourism, recently in a throwaway line in an Eric Hobsbawm book), I&amp;#39;ve run across a mention that, away from the coasts, Italy was depopulated, almost deserted. The context definitely seems to be that there were once people living in these places, and there were ruins of former &amp;quot;civilization&amp;quot;, but that these areas had become deserted. It&amp;#39;s almost always mentioned that these areas were &amp;quot;malarial&amp;quot;, and implied that the depopulation happened because of endemic malaria. &lt;/p&gt;\n\n&lt;p&gt;Is this true? And if it&amp;#39;s true, is the above context (depopulated rather than naturally underpopulated, depopulated due to some kind of &amp;quot;unhealthful conditions&amp;quot; vs. other reasons) accurate? Are there other historical reasons that this part of Italy was relatively deserted in this era?&lt;/p&gt;\n\n&lt;p&gt;Note: I&amp;#39;ve traveled extensively in Italy and know that interior Italy is largely mountainous, and even today these areas are fairly underdeveloped and remote. So having a smaller population makes sense to me. That it would be noticeable by British visitors 200+ years ago and framed as this land being incompatible with life and health is the part that surprises me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 120,
  "permalink": "/r/AskHistorians/comments/vdpxtr/was_inland_italy_actually_depopulated_in_the_way/",
  "subreddit": "AskHistorians",
  "id": "vdpxtr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A few times reading UK-based historical texts about the 18th and 19th centuries\n(previously in reading about the Grand Tour and Romantic era continental\ntourism, recently in a throwaway line in an Eric Hobsbawm book), I've run across\na mention that, away from the coasts, Italy was depopulated,…"
}