{
  "author": "SolorMining",
  "the_new_excerpt": "For those, complaining about Doge Coin and \"shit coins\" harming the market, you\nshouldnt be. This is the entry into Cryptocurrency for millions of SpaceX\nfanboys and Twitterverse gossip queens. Eventually, the Billions (yes BILLIONS)\nmade from Doge Coin will be transferred into other coins, as the…",
  "original_created_utc": 1618582411,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ドージコインや「クソコイン」が市場に害を及ぼすことに文句を言っている人は\nるべきではありません。これは、何百万人ものSpaceXファンボーイやTwitterのゴシップクイーンが暗号通貨に参入するためのものです。\nファンボーイやツイッターのゴシップクイーンたちが暗号通貨に参入します。最終的には、Doge Coinで作られた数十億（そう、数十億）の\n最終的には、Doge Coinで作られた数十億ドルは、他のコインに移され、...",
      "title": "この新しいMeme Coinのお金はすぐに他のCryptosに再循環します。その波に乗ってください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于那些，抱怨多格币和 \"屎币 \"伤害市场的人来说，你的\n不应该是。这是数百万SpaceX的进入加密货币。\n粉丝粉丝和Twitterverse八卦女王。最终，亿万人（是的，亿万人）。\n由Doge Coin制成的硬币将被转移到其他硬币中，因为... ...",
      "title": "很快，这些新的Meme币的钱都会再循环到其他Cryptos中。乘势而上!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於那些，抱怨多格幣和 \"屎幣 \"傷害市場的人來說，你的\n不應該是。這是數百萬SpaceX的進入加密貨幣。\n粉絲粉絲和Twitterverse八卦女王。最終，億萬人（是的，億萬人）。\n由Doge Coin製成的硬幣將被轉移到其他硬幣中，因爲... ...",
      "title": "很快，這些新的Meme幣的錢都會再循環到其他Cryptos中。乘勢而上!"
    }
  ],
  "title": "Soon, all this new Meme Coin money will recirculate into other Cryptos. Ride the wave!",
  "created_utc": 1618666443,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For those, complaining about Doge Coin and &quot;shit coins&quot; harming the market, you shouldnt be.  This is the entry into Cryptocurrency for millions of SpaceX fanboys and Twitterverse gossip queens.  Eventually, the Billions (yes BILLIONS) made from Doge Coin will be transferred into other coins, as the people who made gainz will be looking for the next way to make more gainz.</p>\n\n<p>Now is the time!  Jump on this hype train and get everyone you know involved!  The Meme aspect of Doge Coin has normies willing to invest $5 for a laugh (money they can afford to lose, so no risk), and after that we will have the hooked! Go forth Crypto-Minions, and catch us some new fish! Now is the time!</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/ms40wg/soon_all_this_new_meme_coin_money_will/",
  "subreddit": "CryptoCurrency",
  "id": "ms40wg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171517803
}