{
  "author": "VitisV",
  "original_created_utc": 1626316036,
  "title": "MOON distributions have dropped! I'm tipping everyone who missed out, comment below and I'll share what I can.",
  "created_utc": 1626324293,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>MOON distributions have dropped and I&#39;m tipping anyone who missed out on getting some this round. Just leave a comment and I&#39;ll try to get to everyone tonight. I might feel generous and tip you even if you received a drop if you leave a nice comment. Hope everyone is doing alright.</p>\n\n<p>Edit: had a few snags, but we are rolling now!</p>\n</div><!-- SC_ON -->",
  "score": 281,
  "permalink": "/r/CryptoCurrency/comments/okjg01/moon_distributions_have_dropped_im_tipping/",
  "subreddit": "CryptoCurrency",
  "id": "okjg01",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "MOON distributions have dropped and I'm tipping anyone who missed out on getting\nsome this round. Just leave a comment and I'll try to get to everyone tonight. I\nmight feel generous and tip you even if you received a drop if you leave a nice\ncomment. Hope everyone is doing alright.\n\nEdit: had a few…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "MOONの分配金が下がったので、今回取り損ねた人にはチップをあげます。\nこのラウンドで入手できなかった人にはチップをあげます。コメントを残していただければ、今夜中に全員にお渡しできるようにします。I\nコメントを残していただければ、分配金を受け取っていなくても気前よくチップを渡すかもしれません。\nコメントをお願いします。みんなが元気に過ごしていることを願っています。\n\n編集：いくつかの...",
      "title": "MOONの分配金が下がった！？逃してしまった人にはチップをあげます！下のコメント欄に書いてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "月亮的分配已经下降，我正在给那些错过了这一轮的人提供提示。\n这一轮的人。请留下评论，我将努力在今晚给大家。I\n我可能会觉得自己很慷慨，即使你收到了一滴小费，如果你留下一个漂亮的\n评论。希望大家都过得很好。\n\n编辑：有一些...",
      "title": "月球的分布已经下降! 我在给每个错过的人发小费，请在下面评论，我会分享我所能做的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "月亮的分配已經下降，我正在給那些錯過了這一輪的人提供提示。\n這一輪的人。請留下評論，我將努力在今晚給大家。I\n我可能會覺得自己很慷慨，即使你收到了一滴小費，如果你留下一個漂亮的\n評論。希望大家都過得很好。\n\n編輯：有一些...",
      "title": "月球的分佈已經下降! 我在給每個錯過的人發小費，請在下面評論，我會分享我所能做的。"
    }
  ]
}