{
  "author": "GoDavyGo",
  "the_new_excerpt": "So I work in laboratory and a few years ago I changed a collection method so\nthat we only collected the amount we needed to composite and test to save time\nand be more efficient.\n\nWhen it was realized what I was doing I was verbally reprimanded for it and was\ntold I was cutting corners and not…",
  "original_created_utc": 1621658684,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は研究室で働いていますが、数年前に収集方法を変更しました。\n時間の節約と効率化のために、必要な量だけを回収するように変更しました。\n時間を節約し、より効率的になるようにしました。\n\n私がやっていたことに気づいたとき、私は口頭で叱責されました。\n手を抜いていると言われました。",
      "title": "私は数年前、ある変更を行ったことで職場で叱責されましたが、今度は新入社員が同じ変更を行い、それが称賛されています。私は何をすればいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在实验室工作，几年前我改变了一个收集方法，以便\n我们只收集我们需要合成和测试的数量，以节省时间\n和更有效率。\n\n当人们意识到我在做什么时，我被口头训斥了，并被告知我在偷工减料，而不是......\n被告知我是在偷工减料，而不是...",
      "title": "几年前，我在工作中因为做了一个改变而被训斥。现在，一个新员工也做了同样的改变，并因此受到了赞扬。我应该怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在實驗室工作，幾年前我改變了一個收集方法，以便\n我們只收集我們需要合成和測試的數量，以節省時間\n和更有效率。\n\n當人們意識到我在做什麼時，我被口頭訓斥了，並被告知我在偷工減料，而不是......\n被告知我是在偷工減料，而不是...",
      "title": "幾年前，我在工作中因爲做了一個改變而被訓斥。現在，一個新員工也做了同樣的改變，並因此受到了讚揚。我應該怎麼做？"
    }
  ],
  "title": "I got reprimanded at work a few years ago for making a change.. now a new employee made that same change and is being celebrated for it. What do I do?",
  "created_utc": 1621679334,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I work in laboratory and a few years ago I changed a collection method so that we only collected the amount we needed to composite and test to save time and be more efficient. </p>\n\n<p>When it was realized what I was doing I was verbally reprimanded for it and was told I was cutting corners and not following procedures. No big deal I just went back to collecting full samples and wasted what wasn’t needed. </p>\n\n<p>Well this last week a new guy whose been here 6 months implemented the same exact change to collections that I previously did and Even said he got the idea from my old marks that I made from when I initially did it. My boss said that he was impressed and that we should all look for ways to be more efficient. </p>\n\n<p>Now I like the guy and my boss and I don’t want to rattle cages but what the fuck!? </p>\n\n<p>What should I do?</p>\n</div><!-- SC_ON -->",
  "score": 144,
  "permalink": "/r/NoStupidQuestions/comments/niaxm6/i_got_reprimanded_at_work_a_few_years_ago_for/",
  "subreddit": "NoStupidQuestions",
  "id": "niaxm6",
  "is_self": true,
  "media": null,
  "is_video": false
}