{
  "author": "elgigantedelsur",
  "original_created_utc": 1635025042,
  "title": "Why are there so few indigenous peoples in Europe?",
  "created_utc": 1635056862,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know that there are a number of designated indigenous peoples in the Arctic, e.g. the Saami. </p>\n\n<p>What I don’t really get is why some other groups aren’t considered indigenous \n-  Gaelic islanders/highlanders, Irish, Albanians, Basques for example. Many of these have characteristics of indigenous people, like clan-based social structures, subjected to colonialism, suppression of language etc. </p>\n\n<p>Even more dominant groups like the  Finns or the Greeks have long ties to their land and their own distinct languages. </p>\n\n<p>Genuinely curious so would really like to stay clear of any kind of political argy-bargy and just get serious answers.</p>\n</div><!-- SC_ON -->",
  "score": 113,
  "permalink": "/r/AskHistorians/comments/qee4hd/why_are_there_so_few_indigenous_peoples_in_europe/",
  "subreddit": "AskHistorians",
  "id": "qee4hd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know that there are a number of designated indigenous peoples in the Arctic,\ne.g. the Saami.\n\nWhat I don’t really get is why some other groups aren’t considered indigenous -\nGaelic islanders/highlanders, Irish, Albanians, Basques for example. Many of\nthese have characteristics of indigenous…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "北極圏には、指定された先住民族が多数存在することを知っています。\n例えば、サーミの人々です。\n\nしかし、なぜ他のグループが先住民族とみなされないのか、私にはよくわかりません。\n例えば、ゲール語系の島民やハイランダー、アイルランド人、アルバニア人、バスク人などです。これらの多くは\nこれらの多くは先住民族の特徴を持っていますが...。",
      "title": "なぜヨーロッパには先住民族が少ないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道，在北极地区有一些指定的土著民族。\n例如，萨米族。\n\n我不太明白的是，为什么其他一些群体不被认为是土著？\n例如，盖尔岛民/高地人、爱尔兰人、阿尔巴尼亚人、巴斯克人。其中许多\n这些都有土著人的特征...",
      "title": "为什么欧洲的土著人这么少？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道，在北極地區有一些指定的土著民族。\n例如，薩米族。\n\n我不太明白的是，爲什麼其他一些羣體不被認爲是土著？\n例如，蓋爾島民/高地人、愛爾蘭人、阿爾巴尼亞人、巴斯克人。其中許多\n這些都有土著人的特徵...",
      "title": "爲什麼歐洲的土著人這麼少？"
    }
  ]
}