{
  "author": "xerxxxx",
  "the_new_excerpt": "You know that feeling when your favorite crypto \"influencer\" posts a 90 day\nchart and their coin is up 18,000%? You start doing mental math like, \"Damn if\nI'd invested $1000, I'd have six figures right now. This guy probably made a\nmillion plus!\"\n\nWell, forget that feeling, cause it's total…",
  "original_created_utc": 1622543903,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "お気に入りの暗号 \"インフルエンサー \"が90日間のチャートを掲載し、そのコインが18,000%上昇したときの気持ちを知っていますか？\nのチャートを掲載し、そのコインが18,000%も上昇したときの気持ちを知っていますか？もし1000ドルを投資していたら\n1000ドル投資していたら、今頃は6桁の利益を得ていただろうな。この人はおそらく\nこの人は100万以上稼いでいるだろうな！」と。\n\nしかし、その気持ちは忘れてください。なぜなら、それは完全に...",
      "title": "あなたのお気に入りの暗号インフルエンサーはあなたに嘘をついています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你知道当你最喜欢的加密货币 \"影响者 \"发布一个90天的\n图，而他们的硬币上涨了18,000%？你开始做心算，比如说，\"该死的，如果\n如果我投资1000美元，我现在就会有六位数。这家伙可能赚了一\n百万以上！\"\n\n好吧，忘掉这种感觉吧，因为这完全是...",
      "title": "你最喜欢的加密货币影响者在对你撒谎"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你知道當你最喜歡的加密貨幣 \"影響者 \"發佈一個90天的\n圖，而他們的硬幣上漲了18,000%？你開始做心算，比如說，\"該死的，如果\n如果我投資1000美元，我現在就會有六位數。這傢伙可能賺了一\n百萬以上！\"\n\n好吧，忘掉這種感覺吧，因爲這完全是...",
      "title": "你最喜歡的加密貨幣影響者在對你撒謊"
    }
  ],
  "title": "Your favorite crypto influencer is lying to you",
  "created_utc": 1622572648,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You know that feeling when your favorite crypto &quot;influencer&quot; posts a 90 day chart and their coin is up 18,000%? You start doing mental math like, &quot;Damn if I&#39;d invested $1000, I&#39;d have six figures right now. This guy probably made a million plus!&quot; </p>\n\n<p>Well, forget that feeling, cause it&#39;s total bullshit. Your influencer hero didn&#39;t buy in 90 days ago. They may not even be invested at all. It&#39;s all a ploy to get follows, a told-you-so con that most people are too lazy to fact check. Go back 90 days. Were they shilling it then? </p>\n\n<p>That 18,000% coin has most likely been completely pumped and those of you buying based on that 90 day chart are the dumpees. Stop FOMO-ing into shitcoins that have already had their moments. Stop listening to clowns on the internet that will get you rekt. Most of us will never ride that kind of pump and that&#39;s OK. Invest in things you believe in and set realistic expectations.</p>\n</div><!-- SC_ON -->",
  "score": 443,
  "permalink": "/r/CryptoCurrency/comments/npqz0g/your_favorite_crypto_influencer_is_lying_to_you/",
  "subreddit": "CryptoCurrency",
  "id": "npqz0g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804297931
}