{
  "author": "MajorKeyBro",
  "the_new_excerpt": "Seems pretty unfair that the market is only “open” from 9:30-4pm yet trading can\nstill take place practically all day long. It really sets you up for failure\nwhen a stock closed high but then opens at half its price. I know that “I can\ntrade after hours too” but seriously I cant possibly pay…",
  "original_created_utc": 1622733759,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "市場が開いているのは9:30-4:00だけなのに、取引は実質的に一日中できるというのはかなり不公平だと思います。\n一日中取引ができるのはとても不公平です。高値で引けた株が半値で始まったりすると、失敗の元になりますよね。\n高値で引けた株が半値で始まるなんて、失敗のもとですよね。時間外でも取引できる」というのはわかりますが\n時間外でも取引できる」ということは知っていますが、真面目な話、私には到底払えません・・・。",
      "title": "なぜプレマーケットが存在するのか、なぜオプションが含まれていないのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "似乎很不公平，市场只在9:30-4点 \"开放\"，但交易却可以\n但实际上全天都可以进行交易。这真的为你的失败埋下了伏笔\n当一只股票高价收盘时，却以一半的价格开盘。我知道，\"我也可以\n我知道 \"我也可以在下班后交易\"，但说真的，我不可能支付...",
      "title": "为什么存在预市场，为什么不包括期权？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "似乎很不公平，市場只在9:30-4點 \"開放\"，但交易卻可以\n但實際上全天都可以進行交易。這真的爲你的失敗埋下了伏筆\n當一隻股票高價收盤時，卻以一半的價格開盤。我知道，\"我也可以\n我知道 \"我也可以在下班後交易\"，但說真的，我不可能支付...",
      "title": "爲什麼存在預市場，爲什麼不包括期權？"
    }
  ],
  "title": "Why does pre market exist and why are options not included?",
  "created_utc": 1622750798,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Seems pretty unfair that the market is only “open” from 9:30-4pm yet trading can still take place practically all day long. It really sets you up for failure when a stock closed high but then opens at half its price. I know that “I can trade after hours too” but seriously I cant possibly pay attention to something from 4am-8pm every day. </p>\n\n<p>And why aren’t options tradable? I am supposed to just sit there and watch my options loss all its value in pre market but cant do anything about it? If the price can change after hours why cant I tend to my options? </p>\n\n<p>Doesn’t make sense to me.</p>\n</div><!-- SC_ON -->",
  "score": 924,
  "permalink": "/r/stocks/comments/nrg1xd/why_does_pre_market_exist_and_why_are_options_not/",
  "subreddit": "stocks",
  "id": "nrg1xd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404886629
}