{
  "author": "PCnerd1024",
  "original_created_utc": 1631191832,
  "title": "If each token had a slogan, what would it be?",
  "created_utc": 1631205085,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What if each token had a slogan? I think we will get some fun results some even worthy of a moon tip.</p>\n\n<p>I won&#39;t put a character limit on these slogans so let your imagination go wild.</p>\n\n<p>Would be great if we can get Shakespeare bot on some of these.</p>\n\n<p>I guess I will start first, Solana: Time is the best currency.</p>\n\n<p>How are you supposed to pass this character limit, people are just going to cheat it by spamming, it&#39;s not preventing Low quality posts it&#39;s preventing questions, when i ask on this sub im looking for something i don&#39;t know so how am I going to write 500 characters about it?</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/pkx69o/if_each_token_had_a_slogan_what_would_it_be/",
  "subreddit": "CryptoCurrency",
  "id": "pkx69o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "What if each token had a slogan? I think we will get some fun results some even\nworthy of a moon tip.\n\nI won't put a character limit on these slogans so let your imagination go wild.\n\nWould be great if we can get Shakespeare bot on some of these.\n\nI guess I will start first, Solana: Time is the best…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それぞれのトークンにスローガンがあったらどうでしょう？きっと楽しい結果が得られるでしょう。\n月のチップに値するものもあるでしょう。\n\nこのスローガンには文字数制限を設けませんので、皆さんの想像力を膨らませてください。\n\nシェイクスピア・ボットがこの中のいくつかに参加してくれれば最高ですね。\n\nまずは、「Solana: Time is the best...」から始めます。",
      "title": "各トークンにスローガンがあるとしたら、それは何でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果每个标志物都有一个口号呢？我想我们会得到一些有趣的结果，有些甚至\n配得上一个月亮的提示。\n\n我不会给这些口号设置字数限制，所以让你的想象力尽情发挥。\n\n如果我们能让莎士比亚的机器人参与其中，那就太好了。\n\n我想我将首先开始，Solana：时间是最好的......",
      "title": "如果每个代币都有一个口号，会是什么呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果每個標誌物都有一個口號呢？我想我們會得到一些有趣的結果，有些甚至\n配得上一個月亮的提示。\n\n我不會給這些口號設置字數限制，所以讓你的想象力盡情發揮。\n\n如果我們能讓莎士比亞的機器人蔘與其中，那就太好了。\n\n我想我將首先開始，Solana：時間是最好的......",
      "title": "如果每個代幣都有一個口號，會是什麼呢？"
    }
  ]
}