{
  "author": "ShiftyDM",
  "original_created_utc": 1634766064,
  "title": "This subreddit is about to get a lot more popular! Let's remember to be supportive and educational for newcomers.",
  "created_utc": 1634777602,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>With Bitcoin&#39;s new all-time-high today, the fourth quarter of the largest ever bull year in cryptocurrency history is underway. Bitcoin&#39;s price could double, triple, or even quadruple from here, and many small-cap alts will follow with even greater gains. This subreddit is about to get a lot more popular as searches for information on cryptocurrencies increase and our posts make it to the front page.</p>\n\n<p>Lets remember to be supportive and informative for newcomers. We all came here to learn once.</p>\n\n<p>Help them understand how scams work, the difference between coin price and marketcap, and the importance of two-factor authentication (with an app, not a phone number). Remind them that time spent in the market is more important than trying to time the market, but to always save a little liquidity for the perfect setup, and to never invest more than they can afford to lose.</p>\n\n<p>For all the newcomers already here, welcome aboard! We&#39;re going to the moon.</p>\n</div><!-- SC_ON -->",
  "score": 252,
  "permalink": "/r/CryptoCurrency/comments/qcbq6q/this_subreddit_is_about_to_get_a_lot_more_popular/",
  "subreddit": "CryptoCurrency",
  "id": "qcbq6q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "With Bitcoin's new all-time-high today, the fourth quarter of the largest ever\nbull year in cryptocurrency history is underway. Bitcoin's price could double,\ntriple, or even quadruple from here, and many small-cap alts will follow with\neven greater gains. This subreddit is about to get a lot more…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、ビットコインが史上最高値を更新したことで、第4四半期は、暗号通貨史上最大の\n暗号通貨史上最大の強気の年の第4四半期が進行中です。ビットコインの価格は、ここから2倍、3倍、4倍になる可能性があります。\nビットコインの価格はここから2倍、3倍、あるいは4倍になる可能性があり、多くの小型株アルトがさらに大きな利益を得て続くでしょう。\nさらに大きな利益を得ることになるでしょう。このサブレディットは、これからもっともっと...",
      "title": "このサブレディットは、これからもっと人気が出るでしょうね。新参者をサポートし、教育することを忘れないようにしましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "随着比特币今天创下历史新高，有史以来最大的第四季度\n加密货币历史上最大的牛市年的第四季度正在进行中。比特币的价格可能会翻倍。\n三倍，甚至四倍，而许多小盘股也将随之出现更大的收益。\n甚至更大的收益。这个分论坛即将变得更加...",
      "title": "这个子版块即将变得更受欢迎! 让我们记住对新人的支持和教育。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着比特幣今天創下歷史新高，有史以來最大的第四季度\n加密貨幣歷史上最大的牛市年的第四季度正在進行中。比特幣的價格可能會翻倍。\n三倍，甚至四倍，而許多小盤股也將隨之出現更大的收益。\n甚至更大的收益。這個分論壇即將變得更加...",
      "title": "這個子版塊即將變得更受歡迎! 讓我們記住對新人的支持和教育。"
    }
  ]
}