{
  "author": "invertedpassion",
  "the_new_excerpt": "Hello,\n\nMarkets are continuously rising and it seems we're in a bubble. I have some cash\nto invest, so I was wondering whether markets are overvalued and that I should\nwait, or should I invest right away.\n\nWhat I did to investigate this was to compare S&P 500 with M2 Money supply. My\nhypothesis is…",
  "original_created_utc": 1611219262,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你好啊\n\n市场持续上涨，似乎我们处于泡沫之中。我有一些现金\n投资，所以我想知道市场是否被高估了，我应该。\n等，还是应该马上投资。\n\n为了调查这个问题，我做的是比较标普500和M2货币供应量。我的\n假设",
      "title": "这就是我们不在泡沫中的证据。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好啊\n\n市場持續上漲，似乎我們處於泡沫之中。我有一些現金\n投資，所以我想知道市場是否被高估了，我應該。\n等，還是應該馬上投資。\n\n爲了調查這個問題，我做的是比較標普500和M2貨幣供應量。我的\n假設",
      "title": "這就是我們不在泡沫中的證據。"
    }
  ],
  "title": "Here's the evidence that we're not in a bubble",
  "created_utc": 1611241177,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello,</p>\n\n<p>Markets are continuously rising and it seems we&#39;re in a bubble. I have some cash to invest, so I was wondering whether markets are overvalued and that I should wait, or should I invest right away.</p>\n\n<p>What I did to investigate this was to compare S&amp;P 500 with M2 Money supply. My hypothesis is that the rise that we&#39;re seeing is because of the extra money supply. If that is the case, then the real question we should be asking is <strong>whether market&#39;s rise has overshot the money supply.</strong></p>\n\n<p>From the data, it doesn&#39;t look like so. Take a look at the historical chart of S&amp;500 / M2 money supply.</p>\n\n<p><a href=\"https://imgur.com/a/ctrbC4E\">https://imgur.com/a/ctrbC4E</a></p>\n\n<p>You can play with the <a href=\"https://docs.google.com/spreadsheets/d/18S9anxRQAD6-865Mrdj6Xyr5DiFifSbef2AlFselWQc/edit?usp=sharing\">dataset here</a>.</p>\n\n<p><strong>From the data and the chart, it&#39;s clear that the markets may rise even further</strong>. Reasons:</p>\n\n<ul>\n<li>The ratio reached its peak during the 2000 bubble, and the current levels of the ratio are much below that (although they&#39;re reaching the 2008 levels)</li>\n<li>Since early 2020, M2 Money supply has roughly increased by 24% while S&amp;P has increased by 15%</li>\n</ul>\n\n<p>It&#39;s also interesting to notice that CAGR of this ratio over last 40 years comes to be around 2% which is similar to the annual increase of US GDP.  Another way to look at this is that, the 8% annual returns of S&amp;P 500 over the last 40 years can be broken down into two parts:</p>\n\n<ul>\n<li>6% annual growth in money supply</li>\n<li>2% annual growth in GDP</li>\n</ul>\n\n<p>So, in some sense market&#39;s real growth has been simply the GDP growth.</p>\n\n<p>What do you think about this analysis?</p>\n\n<p>PS: Sorry, the data isn&#39;t very cleanly formatted as I did it very quickly.</p>\n</div><!-- SC_ON -->",
  "score": 948,
  "permalink": "/r/investing/comments/l1upan/heres_the_evidence_that_were_not_in_a_bubble/",
  "subreddit": "investing",
  "id": "l1upan",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311217236
}