{
  "author": "Virtual_Beast1123",
  "original_created_utc": 1634428064,
  "title": "My local bakery now accepts cryptocurrency, mass adoption is coming",
  "created_utc": 1634452245,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I went to my local bakery yesterday, and found out it accepts bitcoin, dogecoin and bitcoin cash.</p>\n\n<p>Keep in mind, this is a very small family owned business operating out of a small shop. This isn&#39;t some massive franchise bakery, so the fact that they now accept crypto is phenomenal. I&#39;ve known the owners for a while now, and have expressed my happiness towards this decision to allow crypto.</p>\n\n<p>The fact that a small family business can accept crypto make me hopeful for the future. Even though adoption is a slow process, it is great that small shops are taking the first step. This will hopefully force big businesses to  to also adopt cryptocurrency as payment.</p>\n\n<p>Just thought I&#39;d share the news, as I find it really hopeful.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/q9ndop/my_local_bakery_now_accepts_cryptocurrency_mass/",
  "subreddit": "CryptoCurrency",
  "id": "q9ndop",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I went to my local bakery yesterday, and found out it accepts bitcoin, dogecoin\nand bitcoin cash.\n\nKeep in mind, this is a very small family owned business operating out of a\nsmall shop. This isn't some massive franchise bakery, so the fact that they now\naccept crypto is phenomenal. I've known the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日、近所のパン屋さんに行ったら、ビットコイン、ドージェコイン、ビットコインキャッシュが使えることがわかりました。\nとビットコインキャッシュが使えます。\n\n心に留めておいてほしいのですが、ここはとても小さな家族経営のお店です。\n小さなお店です。大規模なフランチャイズのパン屋さんではないので、今では暗号を受け付けているという事実は驚異的です。\n驚異的だと思います。私はこの店を知っています...",
      "title": "近所のパン屋さんが暗号通貨を使えるようになりました、大量導入はこれからです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我昨天去了当地的面包店，发现它接受比特币、Dogecoin\n和比特币现金。\n\n请记住，这是一个非常小的家庭企业，在一个小商店里经营。\n小店。这不是什么大型的特许经营面包店，所以他们现在的事实是\n接受加密货币的事实是惊人的。我已经知道...",
      "title": "我当地的面包店现在接受加密货币，大规模采用即将到来"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我昨天去了當地的麪包店，發現它接受比特幣、Dogecoin\n和比特幣現金。\n\n請記住，這是一個非常小的家庭企業，在一個小商店裏經營。\n小店。這不是什麼大型的特許經營麪包店，所以他們現在的事實是\n接受加密貨幣的事實是驚人的。我已經知道...",
      "title": "我當地的麪包店現在接受加密貨幣，大規模採用即將到來"
    }
  ]
}