{
  "author": "TNGSystems",
  "the_new_excerpt": "So the recent price action is probably rekindling the PTSD of us 2017 gang, and\nI thought it would be fun to take a trip down memory lane and remind us all of\nthe pain and terror of the 2018-2020 bear market, as best as I can recall it.\n\n\nTHE ELATION\n\nFor me, I kept talking to my good friend M about…",
  "original_created_utc": 1614013726,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以最近的价格走势可能是重新点燃了我们2017年那帮人的PTSD，而。\n我想，这将是有趣的一趟记忆之旅，并提醒我们所有的。\n2018-2020年熊市的痛苦和恐怖，据我回忆。\n\n\n选举\n\n对我来说，我一直在和我的好朋友M谈论... ...",
      "title": "上一个熊市发生了什么，在我的记忆中是最好的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以最近的價格走勢可能是重新點燃了我們2017年那幫人的PTSD，而。\n我想，這將是有趣的一趟記憶之旅，並提醒我們所有的。\n2018-2020年熊市的痛苦和恐怖，據我回憶。\n\n\n選舉\n\n對我來說，我一直在和我的好朋友M談論... ...",
      "title": "上一個熊市發生了什麼，在我的記憶中是最好的。"
    }
  ],
  "title": "What happened in the last bear market, as best as I can remember it.",
  "created_utc": 1614022245,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So the recent price action is probably rekindling the PTSD of us 2017 gang, and I thought it would be fun to take a trip down memory lane and remind us all of the pain and terror of the 2018-2020 bear market, as best as I can recall it.  </p>\n\n<h1>The Elation</h1>\n\n<p>For me, I kept talking to my good friend M about Bitcoin. He told me about it in September and through October to November we watched it sail past $10,000, to $15,000 before we decided to dip our toes. He was dead set on Ripple and bought at about $0.20, and was supposed to come over and show me how to set it up, but on his way over, he was T-boned by a careless driver and we postponed it. In the days after, Ripple shot up and I felt like I missed the boat, and he tipped me off about another good project called &quot;Cardano&quot;  </p>\n\n<p><em>Oh, those merry times</em>  </p>\n\n<p>I bought some in mid December, and let me tell you that what happened was absolutely insane. For starters, Coinbase was so fucked from the insane level of sign ups, that they couldn&#39;t process new accounts. It took <strong>THREE WEEKS</strong> for my account to be verified, and I had to buy Bitcoin from Local Bitcoins, transfer to Binance and then swap to Cardano. What a joke, but hey I got my Cardano. Little did we realise, we were just 1 month from the top. We enjoyed stratospheric gains for one month.  </p>\n\n<p>It felt different than this February, where gains have been ridiculous. Back then, you could&#39;ve put your money on nearly anything and 8-10x&#39;d in a couple weeks flat. Someone on this reddit described it really well - your money doubled, then doubled again. You&#39;d think &quot;Surely this is it&quot;, then it doubled again. Finally, it doubled again. And then once more.  </p>\n\n<p>I bought 2 days before the Bitcoin top. I had no idea what happens next.  </p>\n\n<p>For the unaware, alts don&#39;t really go up when BTC goes up. Money flows out of alts, into BTC as it gains. When BTC dips, it takes the market with it. But BTC rising up doesn&#39;t really take the market up because there are so many who take money out of alts to ride BTC&#39;s wave. <strong>The best time to be in alts, is when BTC goes flat</strong>  </p>\n\n<p>And that&#39;s kinda what happened. And alts exploded.  </p>\n\n<p>My small Cardano buy doubled, and then doubled, and again and again. Every day I woke up to more green in the portfolio. My mate was making bank off Ripple - it went from 20c to over $3.00. I cursed myself for not just buying Ripple at 44c or whatever it was, and I bought some at $3.15 - basically the top of the market, Ripple&#39;s highest ever price.  </p>\n\n<p>I also bought some bags. FunFair went mad, why not, I&#39;ll have some. Saw crazy profit on that. ETHLend going mad? Go on then. TRON? Go on then!  </p>\n\n<p>There was no wrong decision in that frenzy.  </p>\n\n<p>Until there was.  </p>\n\n<h1>The Copium</h1>\n\n<p>The gains leveled out. Some days started to get red. Everyone was saying shit like &quot;Chinese New Year&quot;, &quot;Wall Street Bonuses&quot;, &quot;Korea FUD&quot;. Nobody can pin why the bubble popped, but in any assets history, such an incredible period of growth just cannot be sustained. I think it was South Korea basically taking some exchanges offline and it fucked with Coin Stat websites. People panicked and sold. That caused more panic, and more sales.  </p>\n\n<p>The daily gains turned red, very quickly.  </p>\n\n<p>&quot;It&#39;s just a dip&quot; &quot;Hold!&quot; &quot;We need a correction&quot; was the hopium of the day. Anyone ballsy enough sold, probably everyone who had been in this space since 2016. They&#39;d seen it all before.  </p>\n\n<p>Some coins slowly turned from green, to breakeven, to red.  </p>\n\n<p>And it just kept going down. I remember a brief rally in April. It was a suckers rally, in May my altcoins were mostly back in profit. It went down again. Same thing in August, BTC spiked up, we all thought &quot;Finally, this is it!&quot; and then it came back down again. Over and over.</p>\n\n<p>Small blips aside, the Bitcoin bear market lasted from Mid December 2018 to Mid March 2020. That&#39;s 15 months, and only then did it start rising properly. We had a false start in early 2019 after the babyish chain split of Bitcoin Cash into BCH and BSV, which plummeted the market into one of the lowest prolonged periods of red I have seen. At this point, many people were down some -80% to -95%, me included.  </p>\n\n<h1>The Effect</h1>\n\n<p>How did it feel? Well to be honest, weird. But it happened over such a long period of time, you just become numb to it. In fact, after periods where your portfolio barely moves 3% in a week, you actually come to enjoy the wild volatility, even when the arse is falling out of it.  </p>\n\n<p>It never stops though, in October 2018, we experienced one of the sharpest in memory, when a childish squabble between Roger Ver and Craig Wright forked the Bitcoin Cash chain into BCH and Bitcoin &quot;Satoshi&#39;s Vision&quot; (christ)  </p>\n\n<p>This resulted in an absolutely gut-wrenching drop which lasted until early 2019.  </p>\n\n<p>Some days, the losses and gains really did affect my day to day. I&#39;ve received a couple warnings from work about chart-watching and I&#39;ve been snappy or elated depending on how much I lost or gained in a day. Now I just truly don&#39;t care. I have a target and if I get there, good, if not, I&#39;ll wait.</p>\n\n<h1>Is that a light I see?</h1>\n\n<p>2019 started out quite nicely. Price remained stable in the $3,000&#39;s until April, where it all started climbing back up again. Alts came along for the ride too. On the summer solstice, BTC broke past $10,000. I smiled as I checked my portfolio, the same day I proposed to my gorgeous fiancee <em>(that covers my ass in case she reads this)</em>. Were things looking up?  </p>\n\n<p>Myeh, not quite. This period of &gt;$10,000 lasted until about September and we came back down. Again, a quiet Christmas and then the hope of a new year brought prices up again just nosing past $10,000.  </p>\n\n<p>Up to this point, I had been buying a bunch of stuff. I bought some Golem, it tripled in one of those spikes in 2018 and then I held a worthless token. My ETHLend, Funfair and Tron were basically worthless. The only times I was in profit was when Cardano, Eth or Ripple stirred from their sleep.  </p>\n\n<p>My first Bitcoin buy, to actually buy and keep, was in fuckin November 2019. I set up a monthly buy, but then stopped halfway through 2020 - with Coronavirus, I could&#39;ve been out of work at a moments notice so all crypto buying stopped.  </p>\n\n<p>In March 2020, we saw Crypto nosedive as Coronavirus struck. This one sucked. In hindsight, these prices were a <strong>fucking steal</strong> - I had the balls to put only one buy in, Cardano at $0.035 and $0.038 - last week, these appreciated 31x and 27x respectively.  </p>\n\n<p>And that was basically the bottom. All has risen from there.  </p>\n\n<p>I made some massive, massive mistakes. I held certain shitcoins way too long, and sold ETHLEND when I broke even on it, because I didn&#39;t do any research and didn&#39;t get why it was climbing so quickly, which ultimately cost me about $4,500 in wasted gains.</p>\n\n<p>I think the best thing I did was consolidate my entire portfolio. All the shit from Coinbase Earn, I just moved it all into Stellar. All the other crap, I just tied it into the good projects and Bitcoin.  </p>\n\n<p>So does this current dip feel like that bear market? No. It just feels like a correction on the way to something bigger. But I do think we will see, until June, some sideways and mostly negative price action broken up with a few days of gains at a time.  </p>\n\n<p>Some cardinal rules for Crypto:  </p>\n\n<ul>\n<li>This market is fucking irrational. It doesn&#39;t make sense that EOS enjoyed periods of insane growth after the network was basically so congested it was not functional, or after people found out that 98% of the transactions on the network was just blocks filling up with weather data from around the world...<br/></li>\n<li>Do not ever, <strong>ever</strong> leverage yourself to buy Crypto. I&#39;m talking loans, credit card debt, spending money reserved for rent or mortgage. This market can and will change in the blink of an eye and it&#39;s not worth the risk.<br/></li>\n<li><strong>Time in the market</strong> is truly better than <strong>timing the market</strong>. I tried trading a handful of times and it was a fantastic way of basically just setting fire to my money. I think my most successful trade I earned about 20 &quot;free&quot; ADA. The worst trade I did, I lost about £50 before I figured fuck it.<br/></li>\n<li>Do some fucking research! I mentioned earlier, I sold ETHLEND before it transformed into AAVE. I sold at $0.12. At it&#39;s peak, it was worth about $5.40. It annoys me nearly every fucking day.<br/></li>\n<li>We are early. Yeah, we really are. Someone on here mentioned that most people can&#39;t even tell you what Bitcoin is or does. Get in, stay in. Ride until you can take out your principal and the rest is free money.<br/></li>\n<li>Don&#39;t take it so seriously. This shit definitely affected my day-to-day. You need to learn to let it go and roll with the punches. I put in a marginal amount maybe once a month and it still felt horrible the first few times I saw deep red in the portfolio.<br/></li>\n</ul>\n\n<p>Have fun guys!</p>\n</div><!-- SC_ON -->",
  "score": 3674,
  "permalink": "/r/CryptoCurrency/comments/lptrna/what_happened_in_the_last_bear_market_as_best_as/",
  "subreddit": "CryptoCurrency",
  "id": "lptrna",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332879177
}