{
  "author": "JDinvestments",
  "the_new_excerpt": "Well, it seems like there’s a good bit of interest in the Roblox public listing,\nso I figured we should touch on some highlights. For those not aware, the MMORPG\nwill be issuing a direct public listing “on or about” March 10, according to a\nrecent filing.\n\nKey Points:\n\nClass A Shares:…",
  "original_created_utc": 1614038672,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嗯，看来大家对Roblox的上市很感兴趣。\n所以我想我们应该触摸一些亮点。对于那些不知道，MMORPG\n将于3月10日 \"当天或前后 \"发行直接公开上市，据。\n最近的备案。\n\n要点。\n\nA类股：...",
      "title": "回过头来看更多关于Roblox的迷你DD。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗯，看來大家對Roblox的上市很感興趣。\n所以我想我們應該觸摸一些亮點。對於那些不知道，MMORPG\n將於3月10日 \"當天或前後 \"發行直接公開上市，據。\n最近的備案。\n\n要點。\n\nA類股：...",
      "title": "回過頭來看更多關於Roblox的迷你DD。"
    }
  ],
  "title": "Back for more with a mini DD on Roblox",
  "created_utc": 1614095911,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Well, it seems like there’s a good bit of interest in the Roblox public listing, so I figured we should touch on some highlights. For those not aware, the MMORPG will be issuing a direct public listing “on or about” March 10, according to a recent filing.</p>\n\n<p><strong>Key Points:</strong></p>\n\n<p>Class A Shares: 196M</p>\n\n<p>Valuation: $29.5B</p>\n\n<p>Estimated cost/share: $45</p>\n\n<p>Ticker: RBLX</p>\n\n<p><a href=\"https://www.sec.gov/Archives/edgar/data/1315098/000119312520298230/d87104ds1.htm\">S-1 Filing</a></p>\n\n<p><strong>Business Model:</strong></p>\n\n<p>Roblox serves as an engine and platform, and allows individual creators to design and launch games. Players can sort through thousands of different games, and play with and against other users online, or in private groups. Users purchase in game currency, Robux, with real world money, and can in turn use that for in game purchases ranging from game-mode specific items to clothing and accessories for their lego-like avatar. Creators are paid by Roblox with Robux, which can then be converted back into real-world currency.</p>\n\n<p><strong>Users:</strong></p>\n\n<p>Ask any parent, teacher, or other individual who deals with teenage and younger children, and I can all but guarantee they can speak at length on Roblox. The game has seen massive appeal with children, growing to a high of 164M Daily Active Users (DAU). Per the company’s S-1, age breakdown is as follows: Under 9, 25%; 9-12, 29%; 13-16, 13%; 17-24, 16%, 25+, 14%. With over half of all users under 12, Roblox has understandably been subject to concerns ranging from chat moderation to customer retention.</p>\n\n<p>It’s worth noting here that 67% of DAUs come from outside of the US and Canada, but 68% of bookings (revenue) came from within the two countries.</p>\n\n<p><strong>Finances:</strong></p>\n\n<p>The topic around which success or failure hangs. I will start with the caveat that Roblox has stated it is prioritizing increasing payouts to content creators in an attempt to incentivize them to stay on platform. They are also making significant investments in infrastructure, “to ensure that our growing user and developer base can access and can use the Roblox Platform.”</p>\n\n<p>For the 9 months ended September 30 (data up to S-1 filing), Roblox saw $588.675M in revenue. Cost of revenue, including R&amp;D, marketing, administrative, and infrastructure totaled roughly $585M. Developer exchange fees, or simply the payouts to their independent content creators totaled $209M. All together, the company saw a net loss of $206.234M. The company currently has $193M in working capital, and $1.5B in total assets.</p>\n\n<p>As shown above, the company loses money, and projects it will continue to lose money in the near future. Aggressive payouts to content creators and updating infrastructure make up the bulk of its expenses. The company also invests heavily in next-gen R&amp;D, including fully immersive VR compatibility, through Oculus, Valve, and others.</p>\n\n<p><strong>Other stuff:</strong></p>\n\n<p>As has been pointed out, the company may face issues regarding content violation the IP of other companies. Thus far, this has not been an issue pressed, but certainly something worth monitoring. The younger user base also understandably leads to issues regarding content moderation, and creating a safe environment for children.</p>\n\n<p><strong>Subjective views:</strong></p>\n\n<p>I don’t like injecting my own views in a DD, but I just wanted to touch on some things I didn’t know where to categorize. I would love to see Roblox continue to capture markets beyond North America, and especially Asia and Europe. They have high user retention, and were the 3rd highest grossing game of 2020, falling only to Tencent’s PUBG and Honor of Kings. I would also love to see them add a learning based angle to capitalize on the social appeal of the platform.</p>\n\n<p>For me, the $30B valuation isn’t terribly off base, if, and only if, it can continue to grow and retain users. While they remain cash flow negative, I’m less concerned about this than when I originally looked at the company. Infrastructure, R&amp;D, and many of the administrative expenses could be reduced in theory if it became a serious issue. The goal Roblox should be focusing on, in my opinion, is 1) expanding its platform to Playstation and Nintendo, and 2) increasing its age 20+ users. If it succeeds in these two areas, it should have no issue meeting revenue demands.</p>\n\n<p>Ultimately, Roblox has a model to exert staying power over its users. The company will need to continue to rely on content creators to drive value, in much a similar way that YouTube does with its platform. While Roblox is approaching 20 years in the market, it is still very much in its infancy with its potential. With the overwhelming majority of users under 18, it is my hope that as its users grow up, so to does the platform itself, and begins to transition into a company with broad market appeal to young adults and the financial majority of gamers.</p>\n\n<p>Personally, I’m probably going to sit out its release. For those of you with kids, and those who have been waiting for this release, I don’t think this will be an investment you end up regretting. But for me, the valuation stretches to the high version of where I myself have them valued, and I will need to see either more growth in the older markets, or a transition into cash flow positive for this to fit into my portfolio. Should this see a dip at all, I will look to enter, but I just don’t see it happening. I wish all of you prospective investors the best of luck, and sincerely hope you all come back in a year to flaunt your wealth over the sideline spectators like me.</p>\n</div><!-- SC_ON -->",
  "score": 42,
  "permalink": "/r/stocks/comments/lq3z3l/back_for_more_with_a_mini_dd_on_roblox/",
  "subreddit": "stocks",
  "id": "lq3z3l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332886306
}