{
  "author": "MichaelJTaylorPhD",
  "the_new_excerpt": "My research focuses on Rome during third and second centuries BC; it was during\nthis period that Rome achieved hegemony over the Mediterranean during intensive\nand seemingly constant warfare.\n\nMy book is Soldiers and Silver: Mobilizing Resources in the Age of Roman\nConquest (University of Texas…",
  "original_created_utc": 1615397374,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我的研究重点是公元前三世纪和公元前二世纪的罗马，正是在这一时期\n在这一时期，罗马在密集的地中海地区取得了霸权。\n和看似不断的战争。\n\n我的书是《士兵与白银》。在罗马时代调动资源\n征服（德克萨斯大学...",
      "title": "我是迈克尔-泰勒博士，罗马共和国历史学家，《士兵与白银》的作者。《士兵与白银：罗马征服时代的资源调动》的作者；罗马战争和帝国主义专家--AMA！"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的研究重點是公元前三世紀和公元前二世紀的羅馬，正是在這一時期\n在這一時期，羅馬在密集的地中海地區取得了霸權。\n和看似不斷的戰爭。\n\n我的書是《士兵與白銀》。在羅馬時代調動資源\n征服（德克薩斯大學...",
      "title": "我是邁克爾-泰勒博士，羅馬共和國曆史學家，《士兵與白銀》的作者。《士兵與白銀：羅馬征服時代的資源調動》的作者；羅馬戰爭和帝國主義專家--AMA！"
    }
  ],
  "title": "I am Dr. Michael Taylor, historian of the Roman Republic and author of Soldiers and Silver: Mobilizing Resources in the Age of Roman Conquest; expert on Roman warfare and imperialism--AMA!",
  "created_utc": 1615404695,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My research focuses on Rome during third and second centuries BC; it was during this period that Rome achieved hegemony over the Mediterranean during intensive and seemingly constant warfare.</p>\n\n<p>My book is <em>Soldiers and Silver: Mobilizing Resources in the Age of Roman Conquest</em> (University of Texas Press, 2020). Here is the publisher’s blurb: </p>\n\n<p><em>By the middle of the second century BCE, after nearly one hundred years of warfare, Rome had exerted its control over the entire Mediterranean world, forcing the other great powers of the region—Carthage, Macedonia, Egypt, and the Seleucid empire—to submit militarily and financially. But how, despite its relative poverty and its frequent numerical disadvantage in decisive battles, did Rome prevail?</em></p>\n\n<p><em>Michael J. Taylor explains this surprising outcome by examining the role that manpower and finances played, providing a comparative study that quantifies the military mobilizations and tax revenues for all five powers. Though Rome was the poorest state, it enjoyed the largest military mobilization, drawing from a pool of citizens, colonists, and allies, while its wealthiest adversaries failed to translate revenues into large or successful armies. Taylor concludes that state-level extraction strategies were decisive in the warfare of the period, as states with high conscription and low taxation raised larger, more successful armies than those that primarily sought to maximize taxation. Comprehensive and detailed, Soldiers and Silver offers a new and sophisticated perspective on the political dynamics and economies of these ancient Mediterranean empires.</em></p>\n\n<p>My other research deals with various aspects of Roman military history, including visual representations of Roman victories, Roman military equipment, the social and political status of Republican-era centurions, and Roman infantry tactics.</p>\n\n<p>Please, ask me anything!</p>\n\n<p>N.B.: I am on dad duty until the after dinner---my answers will start rolling in around 7:00 PM EST--tune back then!</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/m2319a/i_am_dr_michael_taylor_historian_of_the_roman/",
  "subreddit": "AskHistorians",
  "id": "m2319a",
  "is_self": true,
  "media": null,
  "is_video": false
}