{
  "author": "mpinoc",
  "original_created_utc": 1638017506,
  "title": "My father was told today that he is unable to continue DCA’ing on Coinbase through Barclays Bank because it is “unsafe” to do so? Crypto-friendly banks?",
  "created_utc": 1638045049,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>He has been DCA’ing in to btc and eth with a small amount over this last year while educating himself on crypto and assessing his investments but today’s interaction at our local bank has been the catalyst for him to go all in. “If you’re so interested in protecting my money, also block my payments to gambling sites, takeaways etc”</p>\n\n<p>The teller said that due to new regulation crypto purchases is banned by Barclays… he knew this was not true as I also DCA with Coinbase and Barclays (despite them cancelling it three times this year alone without telling me) and after challenging her on this and other excuses she seemingly threw off the top of her head she basically could not give a definitive statement to which my father asked “is it simply that you are scared?”</p>\n\n<p>Part of the reason we got in to crypto is because everything is being disrupted from  Uber to Air BnB to Tesla and the banking sector has always been in need of a good disruption to hand the power back to the people so as we move towards shaking this sector up we still all have bills to pay which unfortunately can’t be paid in crypto so what options are there to bridge the gap between traditional banks and crypto wallets? Or are there any banking alternatives in the UK (and beyond for readers elsewhere)?</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/CryptoCurrency/comments/r3cyzc/my_father_was_told_today_that_he_is_unable_to/",
  "subreddit": "CryptoCurrency",
  "id": "r3cyzc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "He has been DCA’ing in to btc and eth with a small amount over this last year\nwhile educating himself on crypto and assessing his investments but today’s\ninteraction at our local bank has been the catalyst for him to go all in. “If\nyou’re so interested in protecting my money, also block my payments…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼はこの1年間、btcとethに少額のDCAを行ってきました。\nしていましたが、今日の地元の銀行でのやりとりがきっかけで\nしかし、今日の地元の銀行でのやりとりが、彼を全面的に受け入れるきっかけとなりました。\"もし\n私のお金を守ることに興味があるのなら、私の支払いもブロックしてください...",
      "title": "私の父は今日、バークレイズ銀行を通じてCoinbaseでDCAを続けることは「安全ではない」と言われたのですが？暗号に優しい銀行？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的一年里，他一直在用少量的资金投资BTC和Eth。\n在对自己进行加密货币教育和评估他的投资的同时，今天在我们当地银行的互动成为了催化剂。\n在我们当地银行的互动，成为了他全身心投入的催化剂。\"如果\n如果你对保护我的钱如此感兴趣，也请阻止我的付款......",
      "title": "我父亲今天被告知，他无法通过巴克莱银行继续在Coinbase上进行DCA，因为这样做是 \"不安全的\"？对加密货币友好的银行？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的一年裏，他一直在用少量的資金投資BTC和Eth。\n在對自己進行加密貨幣教育和評估他的投資的同時，今天在我們當地銀行的互動成爲了催化劑。\n在我們當地銀行的互動，成爲了他全身心投入的催化劑。\"如果\n如果你對保護我的錢如此感興趣，也請阻止我的付款......",
      "title": "我父親今天被告知，他無法通過巴克萊銀行繼續在Coinbase上進行DCA，因爲這樣做是 \"不安全的\"？對加密貨幣友好的銀行？"
    }
  ]
}