{
  "author": "inevitable_username",
  "original_created_utc": 1631947880,
  "title": "Opinion: How is SOL still the TOP 7 coin?",
  "created_utc": 1631968240,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the words of inspector Callahan, opinions are like assholes — everybody has one. So here&#39;s mine.</p>\n\n<p>For those who just came out of a coma — after an attack, the entire Solana blockchain was paused for about 17 hours. No tx possible. Billions of dollars locked in DeFi were not accessible.</p>\n\n<p>The mere fact that a blockchain can be kill-switched just like that defeats its purpose — it&#39;s not very different from your bank account where your funds can be frozen.</p>\n\n<p>Then, for a coin to stay that high up, it needs HUGE money going in continuously.</p>\n\n<p>At the moment, I can&#39;t honestly imagine how an investor with hundreds of thousands of dollars, choosing a blockchain to DeFi, lp, farm or whatever, after some basic research goes with Solana. </p>\n\n<p>Projects of this magnitude don&#39;t get to mess up like that and then go &quot;it won&#39;t happen again, we cool?&quot;</p>\n</div><!-- SC_ON -->",
  "score": 171,
  "permalink": "/r/CryptoCurrency/comments/pqhirx/opinion_how_is_sol_still_the_top_7_coin/",
  "subreddit": "CryptoCurrency",
  "id": "pqhirx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In the words of inspector Callahan, opinions are like assholes — everybody has\none. So here's mine.\n\nFor those who just came out of a coma — after an attack, the entire Solana\nblockchain was paused for about 17 hours. No tx possible. Billions of dollars\nlocked in DeFi were not accessible.\n\nThe mere…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "キャラハン警部の言葉を借りれば、意見とはケツの穴のようなもので、誰もが持っている。\nがあります。そこで、私の意見を紹介します。\n\n昏睡状態から覚めたばかりの人のために言うと、攻撃を受けた後、ソラナ全体の\nブロックチェーン全体が約17時間停止しました。Txはできませんでした。数十億ドルの\nDeFiにロックされた数十億ドルがアクセスできなかった。\n\n単なる...",
      "title": "意見 SOLはどうしてまだTOP7のコインなの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "用检查员卡拉汉的话说，意见就像屁眼--每个人都有\n一个。所以这是我的。\n\n对于那些刚刚从昏迷中醒来的人来说--在一次攻击之后，整个索拉纳\n区块链暂停了大约17个小时。没有可能的tx。几十亿的美元\n锁定在DeFi中，无法访问。\n\n仅仅是...",
      "title": "意见。SOL怎么还是TOP7的硬币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "用檢查員卡拉漢的話說，意見就像屁眼--每個人都有\n一個。所以這是我的。\n\n對於那些剛剛從昏迷中醒來的人來說--在一次攻擊之後，整個索拉納\n區塊鏈暫停了大約17個小時。沒有可能的tx。幾十億的美元\n鎖定在DeFi中，無法訪問。\n\n僅僅是...",
      "title": "意見。SOL怎麼還是TOP7的硬幣？"
    }
  ]
}