{
  "author": "Traditional_Fee_8828",
  "the_new_excerpt": "The quality of DD lately has become horrendous. I wouldn't be surprised if most\nof it came from hedge funds, trying to get people to buy in so they can drop the\nbag somewhere along the way. I have a theory, that banning the word \"Squeeze\"\nwould remove the shit quality DD, in hopes of seeing some…",
  "original_created_utc": 1623263564,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近のDDの質は恐ろしくなってきました。驚くことではないが、そのほとんどが\nそのほとんどがヘッジファンドからのもので、人々に買わせて途中でバッグを落とすことを狙っている。\n買ってもらって、途中でバッグを落としてもらおうとしている。私の考えでは、\"Squeeze \"という言葉を禁止すると\n私の考えでは、\"Squeeze \"という言葉を禁止することで、クソみたいな品質のDDを取り除くことができ、いくつかの...",
      "title": "DDの影響を見るために、1ヶ月間だけ「スクイーズ」という言葉を投稿から禁止することはできませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近DD的质量已经变得很糟糕了。我不会感到惊讶，如果大部分\n如果大部分来自对冲基金，试图让人们购买，这样他们就可以在某个地方掉包，我不会感到惊讶。\n袋子的某个地方。我有一个理论，即禁止 \"挤压 \"一词\n将消除狗屎质量DD，希望能看到一些...",
      "title": "我们能不能暂时禁止帖子中出现 \"挤压 \"这个词，就一个月，看看它对DD有什么影响。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近DD的質量已經變得很糟糕了。我不會感到驚訝，如果大部分\n如果大部分來自對沖基金，試圖讓人們購買，這樣他們就可以在某個地方掉包，我不會感到驚訝。\n袋子的某個地方。我有一個理論，即禁止 \"擠壓 \"一詞\n將消除狗屎質量DD，希望能看到一些...",
      "title": "我們能不能暫時禁止帖子中出現 \"擠壓 \"這個詞，就一個月，看看它對DD有什麼影響。"
    }
  ],
  "title": "Can we temp ban the word \"Squeeze\" from posts, just for a month to see how it affects DD",
  "created_utc": 1623273870,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The quality of DD lately has become horrendous. I wouldn&#39;t be surprised if most of it came from hedge funds, trying to get people to buy in so they can drop the bag somewhere along the way. I have a theory, that banning the word &quot;Squeeze&quot; would remove the shit quality DD, in hopes of seeing some good, retarded plays, based on shit that may, or may not happen in the future.</p>\n\n<p>Like for example, SPCE is a retarded YOLO play, but there&#39;s an idea about its future. Gun stocks would be another retarded play if you were betting that CPI numbers will lead to raiding of stores, as people become desperate for supplies. However, most of the shit on it is &quot;bUY sHorT SqUeezE IncOmINg!!1!&quot; when the reality is that they want the price pumped up because now they have their position opened so they can make a quick buck. The amount of scrapers running over this reddit is so crazy that I could probably say &quot;Buy PLTR shares, short squeeze incoming&quot;, and scrapers would be bought in within seconds, even if PLTR had 0% short interest.</p>\n\n<p>Thus, I petition a temp ban of the word &quot;Squeeze&quot; in discussion, except for exceptional cases, where short interest is at 80%+ (This number can be negotiated). My bet is that DD quality will skyrocket, and if I could buy calls on it, I would be YOLOing on OTM ones, as far out as they go, because right now, DD is at an all-time low, so much so that I just skip the post.</p>\n</div><!-- SC_ON -->",
  "score": 21656,
  "permalink": "/r/wallstreetbets/comments/nw2up1/can_we_temp_ban_the_word_squeeze_from_posts_just/",
  "subreddit": "wallstreetbets",
  "id": "nw2up1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404895341
}