{
  "author": "TheSilverWasp",
  "the_new_excerpt": "Do you delete them because its creepy to have nudes and sex tapes of an 18-year\nold when you are 52? Do you keep them as memories but never watch them? Or do\nyou keep them and watch them with your partner sometimes? (given that you're\nstill sexually active)\n\nAt what point does it become creepy to…",
  "original_created_utc": 1617970516,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "52歳になっても18歳のヌードやセックステープを持っているのは不気味だから削除する？\n自分が52歳のときに18歳の子のヌードやセックステープを持っているのは気持ち悪いから削除するのでしょうか？思い出として残しておくが、絶対に見ないのか？それとも\nそれとも保存しておいて、時々パートナーと一緒に見ますか？(あなたがまだ性的に活発であることを考えると\nまだ性的に活発であると仮定して）。)\n\nどの時点でキモくなるのか...。",
      "title": "二人とも18歳のときに出会って、年をとるまで一緒にいるとしたら、昔のヌードやセックステープはどうするんですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你删除它们，因为它的毛骨悚然有一个18岁的裸体和性录像带。\n当你52岁的时候？你是把它们当作回忆，却从不看呢？还是\n你把它们留着，有时和你的伴侣一起看？(鉴于你是\n(仍有性行为)\n\n什么时候会变得毛骨悚然... ...",
      "title": "如果在你们都18岁的时候认识了一个人，并且你们一直在一起，直到老，你怎么处理旧的裸体和性爱录像带？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你刪除它們，因爲它的毛骨悚然有一個18歲的裸體和性錄像帶。\n當你52歲的時候？你是把它們當作回憶，卻從不看呢？還是\n你把它們留着，有時和你的伴侶一起看？(鑑於你是\n(仍有性行爲)\n\n什麼時候會變得毛骨悚然... ...",
      "title": "如果在你們都18歲的時候認識了一個人，並且你們一直在一起，直到老，你怎麼處理舊的裸體和性愛錄像帶？"
    }
  ],
  "title": "If you meet someone when you're both 18 and you stay together until you are old, what do you do with old nudes and sex tapes?",
  "created_utc": 1617987909,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Do you delete them because its creepy to have nudes and sex tapes of an 18-year old when you are 52? Do you keep them as memories but never watch them? Or do you keep them and watch them with your partner sometimes? (given that you&#39;re still sexually active)</p>\n\n<p>At what point does it become creepy to keep them, when you are 25, 30, 35 or older? And how would it feel if your partner watched nudes of a younger version of yourself?</p>\n\n<p>Edit: this question is hypothetical, I&#39;m 19 and a girl</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/mnfwfk/if_you_meet_someone_when_youre_both_18_and_you/",
  "subreddit": "TooAfraidToAsk",
  "id": "mnfwfk",
  "is_self": true,
  "media": null,
  "is_video": false
}