{
  "author": "timeslider",
  "original_created_utc": 1626765729,
  "title": "It's 3:13 am where I am and I just heard the loudest bang on my back porch. I'm too scared to check. What should I do?",
  "created_utc": 1626791293,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I live alone. I went to bed at 2 and heard a loud bang that shook the whole house but I was so tired that I didn&#39;t worry about it. 2 am is way past my bedtime. I thought I&#39;ll just deal with whatever it is tomorrow morning but then it happened again around 3:12 waking me up and again a few moments later. That last one took my breath away it was so damn loud and scary. It scared the shit out of me and I&#39;m worried. The first time, I thought it was a big branch fell and hit the front porch but 3 times within an hour? It&#39;s too late/early to call a friend. What to do?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/onx73q/its_313_am_where_i_am_and_i_just_heard_the/",
  "subreddit": "NoStupidQuestions",
  "id": "onx73q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I live alone. I went to bed at 2 and heard a loud bang that shook the whole\nhouse but I was so tired that I didn't worry about it. 2 am is way past my\nbedtime. I thought I'll just deal with whatever it is tomorrow morning but then\nit happened again around 3:12 waking me up and again a few moments…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "一人暮らしです。2時に寝ると、家中が揺れるほどの大きな音が聞こえてきました。\n疲れていたので気になりませんでした。午前2時は私の就寝時間を過ぎています。\n就寝時間を過ぎています。明日の朝にでも対処しようと思っていましたが\n3時12分頃にまた起きて、またしばらくして...。",
      "title": "今、午前3時13分ですが、家の裏口で大きな音がしました。怖くて確認できません。どうすればいいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一个人住。我两点睡觉，听到一声巨响，震动了整个房子。\n但我太累了，所以我没有担心。凌晨2点已经过了我的\n睡觉时间。我想，不管它是什么，我明天早上再处理就好了，但后来\n3点12分左右，它又发生了，把我吵醒，又过了一会儿......",
      "title": "我所在的地方现在是凌晨3点13分，我刚刚在我的后门廊上听到了最响的一声。我太害怕了，不敢去检查。我应该怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一個人住。我兩點睡覺，聽到一聲巨響，震動了整個房子。\n但我太累了，所以我沒有擔心。凌晨2點已經過了我的\n睡覺時間。我想，不管它是什麼，我明天早上再處理就好了，但後來\n3點12分左右，它又發生了，把我吵醒，又過了一會兒......",
      "title": "我所在的地方現在是凌晨3點13分，我剛剛在我的後門廊上聽到了最響的一聲。我太害怕了，不敢去檢查。我應該怎麼做？"
    }
  ]
}