{
  "author": "bosshax",
  "the_new_excerpt": "Counterfeiting stock is the single most significant fraud in the financial\nindustry and at the source of the GME movement.\n\nA lot of the issues, naked shorts, ladder attacks and market manipulations are\nenabled by counterfeiting stocks.\n\nSome users are speculating that there are well in excess of…",
  "original_created_utc": 1612106255,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "伪造股票是金融领域最主要的一种欺诈行为。\n业，也是金交所运动的源头。\n\n很多问题，赤裸裸的空头，阶梯式的攻击和市场操纵是\n由造假股促成。\n\n有网友猜测，有远超...",
      "title": "对冲基金如何伪造股票"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "僞造股票是金融領域最主要的一種欺詐行爲。\n業，也是金交所運動的源頭。\n\n很多問題，赤裸裸的空頭，階梯式的攻擊和市場操縱是\n由造假股促成。\n\n有網友猜測，有遠超...",
      "title": "對沖基金如何僞造股票"
    }
  ],
  "title": "How Hedge Funds Counterfeit Stock",
  "created_utc": 1612114238,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Counterfeiting stock is the single most significant fraud in the financial industry and at the source of the GME movement. </p>\n\n<p>A lot of the issues, naked shorts, ladder attacks and market manipulations are enabled by counterfeiting stocks. </p>\n\n<p>Some users are speculating that there are well in excess of 200% of GME shares which are “circulating” as counterfeit and this is why the industry is reacting so vehemently to protect this great fraud by restricting buying (brokerages) and clearing houses (who are suppose to ensure settlement of real shares) are on the hook.</p>\n\n<p>This resource explains PERFECTLY what is going on. We must demand change, accountability and oversight. The markets must be free. </p>\n\n<p><a href=\"http://counterfeitingstock.com/CounterfeitingStock.html\">counterfeiting stock</a></p>\n\n<p>Please PIN this so the narrative shifts to uncovering the truth about the Hedge Funds illicit practices and the Department of Justice can start doing their jobs in enforcing financial crime.</p>\n\n<p>PLEASE SHARE... This needs more attention to cut through the misinformation. This is ALL regulators have to focus on as this is the source of the rot in society.</p>\n</div><!-- SC_ON -->",
  "score": 838,
  "permalink": "/r/stocks/comments/l9e8k4/how_hedge_funds_counterfeit_stock/",
  "subreddit": "stocks",
  "id": "l9e8k4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518539363
}