{
  "author": "Hsiang7",
  "original_created_utc": 1652325470,
  "title": "This crash has taught me a valuable lesson about taking profits",
  "created_utc": 1652373687,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I bought into crypto at the end of May 2021, around this time a year ago and DCAed every week until around the beginning of August before deciding to just hold and not DCA during the bullrun last year (best decision I made in hindsight). I have the majority of my portfolio in BTC and ETH with smaller positions in some alts, so around the end of October to the beginning of November my portfolio was up around 70%. At that time pretty much everything in my portfolio was up. Some assests were up 300%+, but I was part of the DCA and hold crowd, so I did just that.&lt;/p&gt;\n\n&lt;p&gt;I held all of my profits and didn&amp;#39;t take any profits at all. Everyone was saying &amp;quot;$100k BTC by the end of the year!&amp;quot; and I fell for it. I thought the bullrun would continue, and decided to just keep holding. Then the bear market hit.... Everything was down more and more, but I was still in profit due to having an average BTC buyin price of $34,000 and the performance of alts like SOL, KCS and LUNA (😭) that I bought in at a good price for and were still up a lot from my buyin price. Then this crash happened. My 70% in profit portfolio just seven months ago is now 20% in the red. All those unrealized profits have been wiped out. It&amp;#39;s all play money that I could afford to lose so it doesn&amp;#39;t matter too much and won&amp;#39;t affect my life at all, but it taught me a valuable lesson to take profits when you get them. Holding is fine and will probably still work out, but I could have had a lot more money to invest now if I had taken those profits.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR:&lt;/strong&gt; Don&amp;#39;t sit on profits too long. Take profits when you can, because they could disappear at any moment.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 304,
  "permalink": "/r/CryptoCurrency/comments/unrg3o/this_crash_has_taught_me_a_valuable_lesson_about/",
  "subreddit": "CryptoCurrency",
  "id": "unrg3o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I bought into crypto at the end of May 2021, around this time a year ago and\nDCAed every week until around the beginning of August before deciding to just\nhold and not DCA during the bullrun last year (best decision I made in\nhindsight). I have the majority of my portfolio in BTC and ETH with…"
}