{
  "author": "Jasonmv222",
  "the_new_excerpt": "Reading the “top 5 stock picks for next 5 years” post have me some inspiration\nto pursue a few stocks I’ve been on the fence about (DIS, HD). But it got me\nwondering. What were some of the answers to this question 5 years ago? Did they\nall turn out to be big hits? Any major duds? I’ve only been…",
  "original_created_utc": 1618726671,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今後5年間に選ぶべき銘柄トップ5」の記事を読んで、今まで迷っていたいくつかの銘柄（DIS、HD）を追いかける気になりました。\n迷っていたいくつかの銘柄（DIS、HD）を追いかけるきっかけになりました。しかし、それによって私は\n疑問に思いました。5年前、この質問に対する答えはどうだったのだろう？それらは\nすべてが大ヒットしたのか？大失敗したものは？私はまだ...",
      "title": "5年前の「今後5年間のベスト5銘柄」は何だったのか、そしてその中に不発だったものはあるのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "读了 \"未来5年五大选股 \"的帖子，我有了一些灵感。\n来追求一些我一直在犹豫的股票（DIS，HD）。但它让我\n想知道。5年前这个问题的答案有哪些？他们是否\n都会成为大热门？有什么大的败笔吗？我只是...",
      "title": "5年前的 \"未来5年的五大选股\"，有无哑火？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讀了 \"未來5年五大選股 \"的帖子，我有了一些靈感。\n來追求一些我一直在猶豫的股票（DIS，HD）。但它讓我\n想知道。5年前這個問題的答案有哪些？他們是否\n都會成爲大熱門？有什麼大的敗筆嗎？我只是...",
      "title": "5年前的 \"未來5年的五大選股\"，有無啞火？"
    }
  ],
  "title": "What were the “top 5 stock picks for next 5 years” 5 years ago, and were any of them duds?",
  "created_utc": 1618742955,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Reading the “top 5 stock picks for next 5 years” post have me some inspiration to pursue a few stocks I’ve been on the fence about (DIS, HD). But it got me wondering. What were some of the answers to this question 5 years ago? Did they all turn out to be big hits? Any major duds? I’ve only been investing heavily for about a year and a half. I guess I’m just looking for some validation in pivoting more toward some of the big names listed.</p>\n</div><!-- SC_ON -->",
  "score": 320,
  "permalink": "/r/stocks/comments/mt7gsz/what_were_the_top_5_stock_picks_for_next_5_years/",
  "subreddit": "stocks",
  "id": "mt7gsz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171526209
}