{
  "author": "Baskin",
  "original_created_utc": 1639801855,
  "title": "How does a wild animal population naturally recover from an STD outbreak?",
  "created_utc": 1639826942,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Wouldn’t a population be perpetually infected and/or die off as a result of STIs? In the case of animals that engage in casual sex or polygyny, I’d expect STIs would be even more easily spread. &lt;/p&gt;\n\n&lt;p&gt;This NCBI article &lt;a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3427566/\"&gt;Disease and the dynamics of extinction&lt;/a&gt; concludes that extinction events due to an infectious disease is relatively unusual… &lt;/p&gt;\n\n&lt;p&gt;Without any anthropogenic intervention, hepatitis could easily wipe out troops of bonobos. An outbreak of syphilis would wreck havoc in a pod of dolphins. There may be survivors that recover and possibly develop a resistance…. provided they don’t get reinfected, the disease doesn’t mutate, their reproductive organs aren’t compromised, etc. So, what’s the science behind a species surviving from an STD outbreak in the wild kingdom?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/askscience/comments/rizdpk/how_does_a_wild_animal_population_naturally/",
  "subreddit": "askscience",
  "id": "rizdpk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Wouldn’t a population be perpetually infected and/or die off as a result of\nSTIs? In the case of animals that engage in casual sex or polygyny, I’d expect\nSTIs would be even more easily spread.\n\nThis NCBI article Disease and the dynamics of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "その結果、ある集団は永久に感染し、あるいは死滅するのではないだろうか？\nSTIは？カジュアルセックスや一夫多妻制をとる動物の場合、やはり\nSTIはさらに広がりやすいと思います。\n\nこのNCBIの論文 Disease and the dynamics of...",
      "title": "野生動物の集団は、性病の発生からどのように自然回復するのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "人口不会因为性病而永远被感染和/或死亡吗？\n性传播感染？如果是从事随意性行为或一夫多妻制的动物，我预计\n性病会更容易传播。\n\n这篇NCBI文章疾病和动态的...",
      "title": "野生动物群体如何从性病爆发中自然恢复？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人口不會因爲性病而永遠被感染和/或死亡嗎？\n性傳播感染？如果是從事隨意性行爲或一夫多妻制的動物，我預計\n性病會更容易傳播。\n\n這篇NCBI文章疾病和動態的...",
      "title": "野生動物羣體如何從性病爆發中自然恢復？"
    }
  ]
}