{
  "author": "Jxntb733",
  "original_created_utc": 1648661296,
  "title": "The SEC is a joke and their enforcement is shambolic",
  "created_utc": 1648686682,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The SEC only targets low hanging fruit -  pat themselves on the back - make a public statement about it - then don’t even care about the legal follow-through.          &lt;/p&gt;\n\n&lt;p&gt;They never want to target cases or companies that are difficult, challenging, or embarrassing. They’re an agency that polices broken windows on the street level and rarely goes to the penthouse floors!         &lt;/p&gt;\n\n&lt;p&gt;They contact blockchain businesses that are holding token sales and force them to close and refund investors. They claim to “maintain fair, orderly, and efficient markets, and facilitate capital formation” but play nice to big corporations, while employees take very high paying private sector jobs after working there!            &lt;/p&gt;\n\n&lt;p&gt;They shells out billions and billions of fines each year but a large number of those fines go to big banks, some of the most evil companies on earth!!        &lt;/p&gt;\n\n&lt;p&gt;Their enforcement division is measured by only two metrics, the number of cases filed and the monetary penalties - more than half of SEC employees are made up of enforcement personnel and examination staff - they need serious reallocation of their resources! Enough is enough!! Gary you might have taught that MIT class but you have no business &lt;em&gt;‘regulating’&lt;/em&gt; the future of global finance!        &lt;/p&gt;\n\n&lt;p&gt;TLDR; &lt;strong&gt;The SEC is a useless government body that does NOTHING to actually protect investors&lt;/strong&gt;, only favors big business, and should stay the HELL away from cryptocurrencies.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 320,
  "permalink": "/r/CryptoCurrency/comments/tsbna3/the_sec_is_a_joke_and_their_enforcement_is/",
  "subreddit": "CryptoCurrency",
  "id": "tsbna3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The SEC only targets low hanging fruit - pat themselves on the back - make a\npublic statement about it - then don’t even care about the legal follow-through.\n\nThey never want to target cases or companies that are difficult, challenging, or\nembarrassing. They’re an agency that polices broken windows…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "SECは、低いところにぶら下がる果実だけをターゲットにして、自分たちを褒め称えるのです。\nそして、法的なフォロースルーを気にすることもない。\n\n彼らは、困難で挑戦的なケースや企業をターゲットにしたがらない。\n恥ずかしくなる。彼らは、割れ窓を取り締まる機関なのだ...。",
      "title": "SECは冗談のような存在で、その取締りはずさんなものです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "美国证券交易委员会只针对低垂的果实--拍拍自己的肩膀--做一个\n公开声明--然后甚至不关心法律上的后续行动。\n\n他们从来没有想过要针对那些困难的、具有挑战性的或令人尴尬的案件或公司。\n尴尬的案件或公司。他们是一个管理破窗的机构......",
      "title": "美国证券交易委员会是一个笑话，他们的执法是混乱的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "美國證券交易委員會只針對低垂的果實--拍拍自己的肩膀--做一個\n公開聲明--然後甚至不關心法律上的後續行動。\n\n他們從來沒有想過要針對那些困難的、具有挑戰性的或令人尷尬的案件或公司。\n尷尬的案件或公司。他們是一個管理破窗的機構......",
      "title": "美國證券交易委員會是一個笑話，他們的執法是混亂的。"
    }
  ]
}