{
  "author": "SaintShrink",
  "original_created_utc": 1624631264,
  "title": "What were the mechanics of sex work like in 1st Century Galilee? How would I find a sex worker, proposition them, and pay for it? Were there brothels, procurers, or was everybody freelance?",
  "created_utc": 1624679468,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This question actually spawned from a Key and Peele sketch where Mary Magdalene&#39;s pimp comes in, finds her with Jesus, and mistakes him for her new pimp. It occurred to me that while I know Mary Magdalene herself was unlikely to have been a sex worker, most sex workers probably didn&#39;t have pimps in the time, but then I realized that I have no idea if that&#39;s true.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/o7ospc/what_were_the_mechanics_of_sex_work_like_in_1st/",
  "subreddit": "AskHistorians",
  "id": "o7ospc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This question actually spawned from a Key and Peele sketch where Mary\nMagdalene's pimp comes in, finds her with Jesus, and mistakes him for her new\npimp. It occurred to me that while I know Mary Magdalene herself was unlikely to\nhave been a sex worker, most sex workers probably didn't have pimps in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この質問は、Key and Peeleのスケッチから生まれました。\nマグダレンのポン引きがやってきて、イエスと一緒にいる彼女を見つけ、彼を彼女の新しいポン引きと勘違いしてしまう。\nヒモと勘違いしてしまう。私はマグダラのマリア自身がセックスワーカーであった可能性が低いことを知っています。\n殆どのセックスワーカーはヒモを持っていなかったのではないかと...",
      "title": "1世紀のガリラヤでは、セックスワークの仕組みはどのようなものだったのでしょうか？どうやってセックスワーカーを見つけて、プロポーズして、お金を払うのか？売春宿があったのか、調達業者がいたのか、それともみんなフリーランスなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个问题实际上是由Key and Peele的一个小品衍生出来的。\n抹大拉的皮条客进来，发现她和耶稣在一起，并误以为他是她的新皮条客。\n皮条客。我突然想到，虽然我知道抹大拉的马利亚本人不太可能是性工作者，但大多数性工作者都是这样。\n大多数性工作者可能没有皮条客...。",
      "title": "在一世纪的加利利，性工作的机制是怎样的？我怎样才能找到一个性工作者，向他们求婚，并支付报酬？是否有妓院、介绍人，还是每个人都是自由职业者？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個問題實際上是由Key and Peele的一個小品衍生出來的。\n抹大拉的皮條客進來，發現她和耶穌在一起，並誤以爲他是她的新皮條客。\n皮條客。我突然想到，雖然我知道抹大拉的馬利亞本人不太可能是性工作者，但大多數性工作者都是這樣。\n大多數性工作者可能沒有皮條客...。",
      "title": "在一世紀的加利利，性工作的機制是怎樣的？我怎樣才能找到一個性工作者，向他們求婚，並支付報酬？是否有妓院、介紹人，還是每個人都是自由職業者？"
    }
  ]
}