{
  "author": "sirloona",
  "the_new_excerpt": "In the US fear of higher education leading to communism seems to have been a\nprominent idea in public conciousness since at least the 1930s. Were there\nsimilar fears of radicalization occurring in pre-modern/early modern high\neducation insitutions or even ancient insitutions of higher learning?…",
  "original_created_utc": 1623201373,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "米国では、少なくとも1930年代から、高等教育が共産主義につながるのではないかという恐れが\nアメリカでは、少なくとも1930年代から、高等教育が共産主義につながるという恐れが、一般の人々の意識の中にはっきりと存在していたようです。このような\n前近代・近世の高等教育機関、あるいは古代の高等教育機関でも、過激化への同様の恐れがあったのでしょうか。\n前近代・近世の高等教育機関、あるいは古代の高等教育機関においても、同様の過激化の恐れがあったのでしょうか。",
      "title": "アメリカでは、特に保守派の間では、大学はリベラルな教育機関であり、学生を「社会主義者」や「共産主義者」へと過激化させるものだと考えられています。近代以前の社会でも、高等教育を「先鋭化させる」と同様に捉えていたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在美国，对高等教育导致共产主义的恐惧似乎一直是公众意识中一个突出的想法。\n至少从20世纪30年代起就成为公众意识中的一个突出的想法。当时是否有\n在前现代/早期现代的高等院校甚至古代的高等院校中，是否也有类似的对激进化的恐惧？\n教育机构，甚至古代的高等学府是否也有类似的激进化恐惧？",
      "title": "在美国，特别是在保守派中，大学被看作是一个自由主义机构，它使学生变得激进，把他们变成 \"社会主义者 \"和 \"共产主义者\"。现代之前的社会是否对高等教育的 \"激进化 \"持有类似的看法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在美國，對高等教育導致共產主義的恐懼似乎一直是公衆意識中一個突出的想法。\n至少從20世紀30年代起就成爲公衆意識中的一個突出的想法。當時是否有\n在前現代/早期現代的高等院校甚至古代的高等院校中，是否也有類似的對激進化的恐懼？\n教育機構，甚至古代的高等學府是否也有類似的激進化恐懼？",
      "title": "在美國，特別是在保守派中，大學被看作是一個自由主義機構，它使學生變得激進，把他們變成 \"社會主義者 \"和 \"共產主義者\"。現代之前的社會是否對高等教育的 \"激進化 \"持有類似的看法？"
    }
  ],
  "title": "In the United States, especially among conservatives, College is seen as a liberal institution that radicalizes it's students turning them into \"socialists\" and \"Communists\". Did societies before the modern era hold a similar view of higher education as \"radicalizing\"?",
  "created_utc": 1623273862,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the US fear of higher education leading to communism seems to have been a prominent idea in public conciousness since at least the 1930s. Were there similar fears of radicalization occurring in pre-modern/early modern high education insitutions or even ancient insitutions of higher learning? Whatever &quot;radicalization&quot; meant to them</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/nvjqln/in_the_united_states_especially_among/",
  "subreddit": "AskHistorians",
  "id": "nvjqln",
  "is_self": true,
  "media": null,
  "is_video": false
}