{
  "author": "MeLongYouLongTime",
  "the_new_excerpt": "Would not be surprised in the least if any of the money managers shorting GME\nfile some kind of bogus lawsuit (stock manipulation, collusion, etc) over the\nweekend (even while knowing they would lose or at minimum gain nothing from it)\nin hopes that media will run with it and scare retail off again.…",
  "original_created_utc": 1611456383,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "如果有资金经理做空GME，一点也不奇怪。\n提起某种虚假诉讼（股票操纵、串通等），对。\n周末\n希望媒体能顺势而为，把零售业再次吓跑....。",
      "title": "诉讼将是恐吓手段"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果有資金經理做空GME，一點也不奇怪。\n提起某種虛假訴訟（股票操縱、串通等），對。\n週末\n希望媒體能順勢而爲，把零售業再次嚇跑....。",
      "title": "訴訟將是恐嚇手段"
    }
  ],
  "title": "Lawsuits Will be Filed as scare tactics",
  "created_utc": 1611508806,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Would not be surprised in the least if any of the money managers shorting GME file some kind of bogus lawsuit (stock manipulation, collusion, etc) over the weekend (even while knowing they would lose or at minimum gain nothing from it) in hopes that media will run with it and scare retail off again. Just be ready for them to throw everything they can at retail investors to scare them away. Citron was only the first part of their protection plan and that didn&#39;t work so they will move to plan b this week. They&#39;d much rather pay a $100million SEC fine than lose $billions.</p>\n\n<p>LONG GME and plan to open more positions Monday. Not investment advice</p>\n\n<p>Edit: Some are missing the point, I get that a suit from the Melvin and gang would have holes in it, but that&#39;s besides the point. For them its worth filing in attempt to scare younger traders away from the stock and kill the momentum so they don&#39;t run into the same problem they did last week. </p>\n\n<p>The lawsuit is NOT SO THEY CAN WIN IN COURT BUT SO THEY CAN WIN THIER SHORT.</p>\n</div><!-- SC_ON -->",
  "score": 1450,
  "permalink": "/r/wallstreetbets/comments/l3qsa6/lawsuits_will_be_filed_as_scare_tactics/",
  "subreddit": "wallstreetbets",
  "id": "l3qsa6",
  "is_self": true,
  "media": null,
  "is_video": false
}