{
  "author": "wentin-net",
  "original_created_utc": 1659554847,
  "title": "Went out of my comfort zone and it feels good",
  "created_utc": 1659595032,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Recently I was reminded of how important it is to challenge myself and go out of my comfort zone. I conquered my fear and received a positive result.&lt;/p&gt;\n\n&lt;p&gt;My co-founder and I are applying to y combinator with our startup, Typogram. The y combinator application asks for an unscripted founder intro video.&lt;/p&gt;\n\n&lt;p&gt;Usually, my co-founder and I would write a short script outlining what we would say, memorize it, and recite it for the video. Although we have gotten feedback that it was robotic - we stayed with our recording method. It was easier and felt comfortable. We were worried we would look silly, blank out on words, and not be coherent.&lt;/p&gt;\n\n&lt;p&gt;This time around, we decide to challenge ourselves and try creating the video unscripted. To my surprise, the video took a shorter time to record, and I think it was more natural than the previously scripted one. I haven’t uploaded the video yet, but as far as I can tell, we sounded better and more human this time.&lt;/p&gt;\n\n&lt;p&gt;So conclusion and lesson here: don’t be afraid to venture out of my comfort zone into unfamiliar territory. You may be closer to the finish line than you previously thought.&lt;/p&gt;\n\n&lt;p&gt;If you enjoyed this post, I also write a newsletter sharing my journey of building my startup. &lt;a href=\"https://build.typogram.co/\"&gt;Subscribe&lt;/a&gt; if you feel like.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/wffly0/went_out_of_my_comfort_zone_and_it_feels_good/",
  "subreddit": "SideProject",
  "id": "wffly0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Recently I was reminded of how important it is to challenge myself and go out of\nmy comfort zone. I conquered my fear and received a positive result.\n\nMy co-founder and I are applying to y combinator with our startup, Typogram. The\ny combinator application asks for an unscripted founder intro…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、私は、自分自身に挑戦し、外に出ることがいかに重要であるかを再認識しました。\n最近、私は自分自身に挑戦し、自分のコンフォートゾーンの外に出ることがいかに重要であるかを思い知らされました。私は恐怖に打ち勝ち、良い結果を得ることができました。\n\n共同創業者と私は、私たちのスタートアップ、Typogramでy combinatorに応募しています。その\ny combinatorのアプリケーションでは、台本なしの創業者イントロを求められます...",
      "title": "コンフォートゾーンを飛び出したら、いい感じ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，我被提醒，挑战自己和走出去是多么重要。\n我的舒适区。我战胜了自己的恐惧，收到了一个积极的结果。\n\n我和我的联合创始人正带着我们的创业公司Typogram申请y combinator。y combinator的申请要求\ny combinator的申请要求提供一个没有脚本的创始人介绍...",
      "title": "走出了我的舒适区，感觉很好"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，我被提醒，挑戰自己和走出去是多麼重要。\n我的舒適區。我戰勝了自己的恐懼，收到了一個積極的結果。\n\n我和我的聯合創始人正帶着我們的創業公司Typogram申請y combinator。y combinator的申請要求\ny combinator的申請要求提供一個沒有腳本的創始人介紹...",
      "title": "走出了我的舒適區，感覺很好"
    }
  ]
}