{
  "author": "stirling_s",
  "original_created_utc": 1624894754,
  "title": "Having a large supply of ATP inhibits oxidative phosphorylation, thus preventing more ATP from being synthesized. Is there any particular reason that the body wouldn't want to keep creating more ATP?",
  "created_utc": 1624905849,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Wouldn&#39;t it be better for the body to just stockpile ATP rather than store energy as triacylglycerol?</p>\n\n<p>Edit: my best guess is that ATP is less energy dense than fats, so if you kept making it you&#39;d inflate like a balloon. I&#39;m also thinking that maybe we don&#39;t have enough adenosine to be using it all up on excess ATP, so it makes more sense to just constantly recycle a small quantity than it does to stockpile it. Am I on to something here?</p>\n</div><!-- SC_ON -->",
  "score": 124,
  "permalink": "/r/askscience/comments/o9msp0/having_a_large_supply_of_atp_inhibits_oxidative/",
  "subreddit": "askscience",
  "id": "o9msp0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Wouldn't it be better for the body to just stockpile ATP rather than store\nenergy as triacylglycerol?\n\nEdit: my best guess is that ATP is less energy dense than fats, so if you kept\nmaking it you'd inflate like a balloon. I'm also thinking that maybe we don't\nhave enough adenosine to be using it all…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "エネルギーをトリアシルグリセロールとして蓄えるよりも、ATPを蓄えておいた方が体に良いのではないでしょうか？\nエネルギーをトリアシルグリセロールとして蓄えるよりも、ATPを蓄えた方がいいのでは？\n\n編集部：私の推測では、ATPは脂肪よりもエネルギー密度が低いので、作り続けると風船のように膨らんでしまうのではないでしょうか。\nATPを作り続けると風船のように膨らんでしまうのではないでしょうか。また、アデノシンが不足しているのではないか？\nアデノシンの量が足りないのではないかとも考えていますが...。",
      "title": "ATPが大量に供給されると、酸化的リン酸化が抑制され、より多くのATPが合成されなくなります。体がATPを作り続けたくない特別な理由があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对身体来说，仅仅储存ATP而不是将能量储存为三酰甘油不是更好吗？\n而不是以三酰甘油的形式储存能量？\n\n编辑：我的最佳猜测是，ATP的能量密度比脂肪低，所以如果你继续制造它，你会像气球一样膨胀。\n制造它，你会像气球一样膨胀。我还在想，也许我们没有\n有足够的腺苷来全部使用它......",
      "title": "拥有大量的ATP供应会抑制氧化磷酸化，从而阻止更多的ATP被合成。有什么特别的原因使身体不愿意继续创造更多的ATP吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對身體來說，僅僅儲存ATP而不是將能量儲存爲三酰甘油不是更好嗎？\n而不是以三酰甘油的形式儲存能量？\n\n編輯：我的最佳猜測是，ATP的能量密度比脂肪低，所以如果你繼續製造它，你會像氣球一樣膨脹。\n製造它，你會像氣球一樣膨脹。我還在想，也許我們沒有\n有足夠的腺苷來全部使用它......",
      "title": "擁有大量的ATP供應會抑制氧化磷酸化，從而阻止更多的ATP被合成。有什麼特別的原因使身體不願意繼續創造更多的ATP嗎？"
    }
  ]
}