{
  "author": "Redditisforposers",
  "the_new_excerpt": "You only need one of those, Lungs too. Don’t even get me started on people who\nhave kids. Just saying you have invested all that time and money into growing\nall those things and what return have you even seen? Time to make all that hard\nwork pay off.\n\nNow go cash in those investments, pump some…",
  "original_created_utc": 1621130013,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "肺も1つあればいい。子供がいる人には、何も言わないでください。\n子供を持っている人のことは考えないでください。ただ、それらを育てるために時間とお金を投資してきて\n時間とお金をかけて育てたのに、どんなリターンがあったんだ？その努力が報われる時が来た\n努力が報われる時が来たんだ。\n\n今すぐ投資を現金化して、いくつかの...",
      "title": "暗号を買うのにフィアットを持っていないという人の話は聞き飽きました。あなたには腎臓が2つありますよね？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你只需要其中一个，肺也是。甚至不要让我开始考虑那些有孩子的人。\n有孩子的人。我只是说你把所有的时间和金钱都投入到成长中去了\n所有这些东西，而你甚至看到了什么回报？是时候让所有这些努力\n工作得到回报。\n\n现在去兑现那些投资，抽一些...",
      "title": "我讨厌听到人们说他们没有法币来购买加密货币。你有两个肾，不是吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你只需要其中一個，肺也是。甚至不要讓我開始考慮那些有孩子的人。\n有孩子的人。我只是說你把所有的時間和金錢都投入到成長中去了\n所有這些東西，而你甚至看到了什麼回報？是時候讓所有這些努力\n工作得到回報。\n\n現在去兌現那些投資，抽一些...",
      "title": "我討厭聽到人們說他們沒有法幣來購買加密貨幣。你有兩個腎，不是嗎？"
    }
  ],
  "title": "I am sick of hearing people say they don’t have fiat to buy crypto. You got two kidneys don’t you?",
  "created_utc": 1621146841,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You only need one of those, Lungs too. Don’t even get me started on people who have kids. Just saying you have invested all that time and money into growing all those things and what return have you even seen? Time to make all that hard work pay off.</p>\n\n<p>Now go cash in those investments, pump some shitcoin, and make a scammer rich!</p>\n</div><!-- SC_ON -->",
  "score": 982,
  "permalink": "/r/CryptoCurrency/comments/nddw45/i_am_sick_of_hearing_people_say_they_dont_have/",
  "subreddit": "CryptoCurrency",
  "id": "nddw45",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590798345
}