{
  "author": "lymeguy",
  "original_created_utc": 1625161097,
  "title": "What 3 cryptos are you most bullish about for the long run? (Besides BTC and ETH if those are for you)",
  "created_utc": 1625190221,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What cryptos are you feeling for the long term to potentially produce the most gains, simply for stacking up and holding?</p>\n\n<p>Personally I&#39;m bullish on Amptoken- I feel like it still has a long ways to go to prove itself but I could see it being big if Flexa takes off over the next year or 2. </p>\n\n<p>The next two for me would be Algorand and Cardano from what I&#39;ve read on them and seeing how they&#39;ve been performing so far. </p>\n\n<p>What do you all think?</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "permalink": "/r/CryptoCurrency/comments/obqx01/what_3_cryptos_are_you_most_bullish_about_for_the/",
  "subreddit": "CryptoCurrency",
  "id": "obqx01",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "What cryptos are you feeling for the long term to potentially produce the most\ngains, simply for stacking up and holding?\n\nPersonally I'm bullish on Amptoken- I feel like it still has a long ways to go\nto prove itself but I could see it being big if Flexa takes off over the next\nyear or 2.\n\nThe next…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "長期的に見て、最も大きな利益を得られる可能性のある暗号は何だと感じていますか？\n積み上げて保持するだけで、長期的に最も利益を得られる可能性があると感じていますか？\n\n個人的には、Amptokenに強気です。\nしかし、今後1、2年でFlexaが軌道に乗れば、大きな存在になると思います。\nしかし、今後1～2年でFlexaが軌道に乗れば、大きな存在になると思います。\n\n次の...",
      "title": "長期的に最も強気な3つのクリプトを教えてください。(BTCとETHの他にも、もしそれらがあなたにとって必要であれば)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你觉得哪些加密货币从长期来看可能会产生最多\n收益，只是为了堆积和持有？\n\n我个人看好Amptoken--我觉得它仍有很长的路要走，以证明自己。\n我觉得它还有很长的路要走，以证明自己，但如果Flexa在未来一两年内起飞，我可以看到它的重要性。\n一年或两年。\n\n接下来...",
      "title": "你最看好哪3种加密货币的长期发展？(除了BTC和ETH，如果这些是为你准备的)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你覺得哪些加密貨幣從長期來看可能會產生最多\n收益，只是爲了堆積和持有？\n\n我個人看好Amptoken--我覺得它仍有很長的路要走，以證明自己。\n我覺得它還有很長的路要走，以證明自己，但如果Flexa在未來一兩年內起飛，我可以看到它的重要性。\n一年或兩年。\n\n接下來...",
      "title": "你最看好哪3種加密貨幣的長期發展？(除了BTC和ETH，如果這些是爲你準備的)"
    }
  ]
}