{
  "author": "crypto_lad",
  "the_new_excerpt": "Just reminding people (regardless of which crypto your planning to sell) to not\nput sell orders at round numbers $1, $10, $1000, etc, as this adds to the\nresistance for that crypto at those psychological price levels.\n\nInstead, put sell orders a few percent above or below those prices. This…",
  "original_created_utc": 1618481789,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "どの暗号を売ろうとしているかに関わらず、丸い数字の1ドル、10ドル、1000ドルなどの売り注文を出さないように注意してください。\n1ドル、10ドル、1000ドルなどの丸い数字で売り注文を出さないように。\n心理的な価格水準でのその暗号の抵抗が増えるからです。\n\n代わりに、これらの価格の数パーセント上か下に売り注文を出してください。これは...",
      "title": "ご注意ください。1000ドル、1500ドルなどの丸い値段で売り注文を出さないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "只是提醒大家（无论你打算卖哪种加密货币）不要\n把卖单放在1元、10元、1000元等整数上，因为这增加了\n该加密货币在这些心理价位的阻力。\n\n相反，将卖单放在这些价格上方或下方百分之几的位置。这...",
      "title": "友情提醒。不要在1000元、1500元等圆盘价位下卖单!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "只是提醒大家（無論你打算賣哪種加密貨幣）不要\n把賣單放在1元、10元、1000元等整數上，因爲這增加了\n該加密貨幣在這些心理價位的阻力。\n\n相反，將賣單放在這些價格上方或下方百分之幾的位置。這...",
      "title": "友情提醒。不要在1000元、1500元等圓盤價位下賣單!"
    }
  ],
  "title": "Friendly Reminder: Don't put sell orders at Round prices such as $1000, $1500, etc!",
  "created_utc": 1618501384,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just reminding people (regardless of which crypto your planning to sell) to not put sell orders at round numbers $1, $10, $1000, etc, as this adds to the resistance for that crypto at those psychological price levels. </p>\n\n<p>Instead, put sell orders a few percent above or below those prices. This will reduce resistance at psychological price levels, which will do the rest of the crypto community a huge favour by making it easier for each crypto to break through specific price levels!</p>\n\n<p>I know most people probably already do this, but I thought it would be no harm to give everyone a friendly reminder!</p>\n</div><!-- SC_ON -->",
  "score": 508,
  "permalink": "/r/CryptoCurrency/comments/mrbsm7/friendly_reminder_dont_put_sell_orders_at_round/",
  "subreddit": "CryptoCurrency",
  "id": "mrbsm7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171517791
}