{
  "author": "bulukelin",
  "original_created_utc": 1659467445,
  "title": "In retellings of how the Dutch handed over Manhattan to the British in exchange for Suriname, you hear it said that the Dutch got swindled. But would Manhattan really have been valuable to the Dutch if it stayed a lone Dutch colony surrounded by English colonies?",
  "created_utc": 1659500712,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As the story goes, the Dutch thought Suriname would be worth more; and we chuckle to ourselves, knowing how obviously wrong that turned out to be. The implied value of New York in this retelling turns out to be its location: it has natural harbors and was smack dab in the middle of all the European coastal colonies, so it&amp;#39;s great for trade, and in fact goes on to become the financial capital of the planet.&lt;/p&gt;\n\n&lt;p&gt;But how much of this value is also due to scale? That is, the fact that once it was incorporated into the British Empire, it benefits from access to friendly neighbors and collective infrastructure. Would New Amsterdam ever have had anything close to the same amount of value if it remained a small Dutch island surrounded by the English? Or would the Dutch Empire have found itself in a Portugal situation, sinking money into supporting unsustainable and unprofitable colonies that eventually succumb to bankruptcy, rebellion, or conquest?&lt;/p&gt;\n\n&lt;p&gt;Edit: just realized that this post is framed as kind of an alternate history question, which is really unanswerable, and also in the long run almost every European colony achieved independence one way or another. So to put it a different way: at the time of the transfer, did leaders of either the British or the Dutch openly acknowledge that in the long run, Manhattan could be valuable for the British, but not for the Dutch?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 116,
  "permalink": "/r/AskHistorians/comments/wek8ly/in_retellings_of_how_the_dutch_handed_over/",
  "subreddit": "AskHistorians",
  "id": "wek8ly",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As the story goes, the Dutch thought Suriname would be worth more; and we\nchuckle to ourselves, knowing how obviously wrong that turned out to be. The\nimplied value of New York in this retelling turns out to be its location: it has\nnatural harbors and was smack dab in the middle of all the European…"
}