{
  "author": "finc0n1",
  "the_new_excerpt": "*EDIT: added screenshot of one of my portfolios*\n\n\n\nScreenshot of one of my portfolios\n[https://preview.redd.it/izffn53j4vs61.png?width=1835&format=png&auto=webp&s=9eeac0d1018d50149561d986f02d6152bf77f25a]\n\n\n\nIn my trading career beyond having a strategy (actually multiple depending on\nmarket state…",
  "original_created_utc": 1618280740,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "*EDIT: add screenshot of one of my portfolio* (英語)\n\n\n\n私のポートフォリオの一つのスクリーンショット\n[https://preview.redd.it/izffn53j4vs61.png?width=1835&format=png&auto=webp&s=9eeac0d1018d50149561d986f02d6152bf77f25a]\n\n\n\n私のトレーディング・キャリアでは、戦略を持つこと以上に（実際には市場の状態に応じて複数の\n市場の状態に応じて複数の...",
      "title": "継続的に利益を上げることができた私のトレーディングプランのテンプレート"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "*编辑：添加了我的一个作品集的截图*。\n\n\n\n我的一个作品集的截图\n[https://preview.redd.it/izffn53j4vs61.png?width=1835&format=png&auto=webp&s=9eeac0d1018d50149561d986f02d6152bf77f25a]\n\n\n\n在我的交易生涯中，除了有一个策略（实际上是多个策略，取决于我的交易策略。\n市场状态...",
      "title": "我的交易计划模板让我持续获利"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "*編輯：添加了我的一個作品集的截圖*。\n\n\n\n我的一個作品集的截圖\n[https://preview.redd.it/izffn53j4vs61.png?width=1835&format=png&auto=webp&s=9eeac0d1018d50149561d986f02d6152bf77f25a]\n\n\n\n在我的交易生涯中，除了有一個策略（實際上是多個策略，取決於我的交易策略。\n市場狀態...",
      "title": "我的交易計劃模板讓我持續獲利"
    }
  ],
  "title": "My Trading Plan Template That Made Me Consistently Profitable",
  "created_utc": 1618310514,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>*EDIT: added screenshot of one of my portfolios*</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/izffn53j4vs61.png?width=1835&amp;format=png&amp;auto=webp&amp;s=9eeac0d1018d50149561d986f02d6152bf77f25a\">Screenshot of one of my portfolios</a></p>\n\n<p>&#x200B;</p>\n\n<p>In my trading career beyond having a strategy (actually multiple depending on market state and asset class) to base my trades on nothing has ever been as important as having a Trading plan. In this post I want to share with you my personal trading plan to help you create a set of rules that will help you stick to your plan and keep your emotions in check so that you can actually follow your trading strategy and become a consistently profitable trader.</p>\n\n<p>Something that was and still is key for me is the following realization:</p>\n\n<p>Never get attached to your opinion or view of why something should happen. The market is in fact always right and based on nothing but irrationality since its made by humans so the movements of the market do not have to make sense and at more times than not will not make sense.</p>\n\n<p>Trading is simply a mind game. Markets are a result of mass psychology which leads to exploitable edges. Mastering your own psychology is key to keep following the strategy that defines your edge.</p>\n\n<p>So now without further ado my trading plan template that has helped me so much over the years and I hope will help you as well:</p>\n\n<p><strong>**General Rules*\\</strong>*</p>\n\n<ol>\n<li>Never enter a trade without a plan (TP,SL)</li>\n<li>Once you are in a trade stick to the plan</li>\n<li>Its ok to be wrong its not about being right its about making money</li>\n<li>Be patient do not act on FOMO</li>\n<li>Do not chase the market</li>\n<li>Let your winners run and cut your losses short</li>\n</ol>\n\n<p><strong>**The 5 fundamental truths*\\</strong>*</p>\n\n<ol>\n<li>Anything can happen.</li>\n<li>You don&#39;t need to know what is going to happen next in order to make money.</li>\n<li>There is a random distribution between wins and losses for any given set of variables that define an edge.</li>\n<li>An edge is nothing more than an indication of a higher probability of one thing happening over another.</li>\n<li>Every moment in the market is unique.</li>\n</ol>\n\n<p><strong>**Rules of consistency**I AM A CONSISTENT WINNER BECAUSE:</strong></p>\n\n<ol>\n<li>I objectively identify my edges.</li>\n<li>I have predefined risk of every trade.</li>\n<li>I completely accept risk or I am willing to let go of the trade.</li>\n<li>I act on my edges without reservation or hesitation.</li>\n<li>I pay myself as the market makes money available to me.</li>\n<li>I continually monitor my susceptibility for making errors.</li>\n<li>I understand the absolute necessity of these principles of consistent success and, therefore, I never violate them.</li>\n</ol>\n\n<p><strong>**Risk and Money Management*\\</strong>*</p>\n\n<p>Do not increase the standard trade size before you doubled the account.</p>\n\n<ol>\n<li>The maximum amount you are allowed to lose in a day is $XXX.</li>\n</ol>\n\n<p> 2. The maximum amount you are allowed to lose on any single trade is $XXX.</p>\n\n<p> 3. The maximum number of losing trades in a row you are allowed to have in a day before you stop trading is two. </p>\n\n<ol>\n<li>The maximum number of losing trades you are allowed to have in a day before you stop trading is five. (You may have had a win or two between losses, but there is a time to stop trading.) The maximum number of losing trades in the same direction you are allowed to take in a day before you stop trading is three.</li>\n</ol>\n\n<p> 1. If you are up $XXX on a single trade, you will put a profit floor of $XXX underneath the current price to protect a portion of those profits. </p>\n\n<ol>\n<li>If you are up $XXX on a single trade, you will take the money and close out the trade.</li>\n</ol>\n\n<p> 3. If you are up $XXX for the day, you will take the rest of the day off, stay away from the trading screens, and do something you enjoy doing—other than trading</p>\n\n<ol>\n<li>If you are up $XXX for the month, you will put a profit floor of $XXX underneath the month&#39;s profits to protect a portion of those profits. If you are up $XXX for the month, you will take the rest of the month off, stay away from the trading screens, and do something you enjoy doing—other than trading! Take a vacation, sleep late and read books, or do something else fun.</li>\n</ol>\n\n<p>I created this trading plan years ago and am only sharing it with the community now (never spent much time on social media). It is a mix of my own ideas, ideas from fellow traders and books I have read over the years. One book in particular that I highly recommend and that has hugely influenced my trading plan and journey as a trader is: Trading In The Zone from Mark Douglas.</p>\n</div><!-- SC_ON -->",
  "score": 2169,
  "permalink": "/r/wallstreetbets/comments/mpt563/my_trading_plan_template_that_made_me/",
  "subreddit": "wallstreetbets",
  "id": "mpt563",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566622502
}