{
  "author": "Soapy791",
  "the_new_excerpt": "I am a relatively new investor and have noticed that it is a common refrain on\nboth this sub and from many other sources of financial advice that the\neasiest/safest way to invest is to dollar cost average into an S&P 500 ETF or\nindex fund. My question is why 6-7% year over year growth in the US…",
  "original_created_utc": 1611712166,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个相对较新的投资者，并注意到它是一个常见的反语在\n本子项目和许多其他来源的财务咨询意见，这些意见都可以在本子项目中找到。\n最简单/最安全的投资方式是美元成本平均到标准普尔500ETF或。\n指数基金。我的问题是，为什么美国每年6-7%的增长...",
      "title": "为什么美国股市长期持续增值，而很多海外市场却停滞不前？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個相對較新的投資者，並注意到它是一個常見的反語在\n本子項目和許多其他來源的財務諮詢意見，這些意見都可以在本子項目中找到。\n最簡單/最安全的投資方式是美元成本平均到標準普爾500ETF或。\n指數基金。我的問題是，爲什麼美國每年6-7%的增長...",
      "title": "爲什麼美國股市長期持續增值，而很多海外市場卻停滯不前？"
    }
  ],
  "title": "Why does the U.S. Stock Market consistently increase in value over the long term while many overseas markets remain stagnant?",
  "created_utc": 1611755238,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am a relatively new investor and have noticed that it is a common refrain on both this sub and from many other sources of financial advice that the easiest/safest way to invest is to dollar cost average into an S&amp;P 500 ETF or index fund. My question is why 6-7% year over year growth in the US Market viewed as a foregone conclusion? Sure there will be down years but the US market always recovers and seems to grow far faster than its peers.</p>\n\n<p>Since 1995 the S&amp;P 500 is up around 700% while the Nikkei 225 (Japan) is up around 50%, the DAX (Germany) is up 550%, the FTSE (United Kingdom) is up 88%, and the CAC 40 (France) is up 175. Since 2010 the FTSE MIB (Italy) has seen virtually no growth while the S@P/TIS (Canada) has grown 55%.</p>\n\n<p>Why is it that the United States stock market has significantly out performed seemingly every other highly developed, democratic, capitalistic, market except for maybe Germany. What makes the US unique?</p>\n</div><!-- SC_ON -->",
  "score": 75,
  "permalink": "/r/investing/comments/l5tfa7/why_does_the_us_stock_market_consistently/",
  "subreddit": "investing",
  "id": "l5tfa7",
  "is_self": true,
  "media": null,
  "is_video": false
}