{
  "author": "NutInYurThroatEatAss",
  "original_created_utc": 1642469198,
  "title": "Why are mandatory vaccine cards okay but voter registration cards are not?",
  "created_utc": 1642516386,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t care about either. I am vaxxed and boosted (actually gigavaxxed). I also would get a votet registration card if required. Given the whole Stanford prison experiment and other things that make black people worried about vaccines, why should they be expected to have a card when we also shouldn&amp;#39;t expect them to be able to easily get a government ID? I mean no offense I am genuinely curious.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/s6ktpa/why_are_mandatory_vaccine_cards_okay_but_voter/",
  "subreddit": "TooAfraidToAsk",
  "id": "s6ktpa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don't care about either. I am vaxxed and boosted (actually gigavaxxed). I also\nwould get a votet registration card if required. Given the whole Stanford prison\nexperiment and other things that make black people worried about vaccines, why\nshould they be expected to have a card when we also…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "どっちでもいいんです。私はvaxxedとboosted（実際はgigavaxxed）です。また\n必要であれば、有権者登録証を取得します。スタンフォードの刑務所のことを考えると\n実験など、黒人がワクチンを心配するのは、なぜか？\n私たちもそうなのに...カードが必要なんですか？",
      "title": "ワクチンカードの義務化はOKで、有権者登録証はダメなのはなぜ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对这两者都不关心。我已经接种了疫苗，并得到了提升（实际上是Gigavaxxed）。我还\n如果需要的话，我也会得到一张选民登记卡。鉴于整个斯坦福监狱\n和其他一些让黑人担心疫苗的事情，为什么要让他们拥有一张卡呢？\n为什么要指望他们有一张卡，而我们也...",
      "title": "为什么强制性疫苗卡可以，而选民登记卡就不行？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對這兩者都不關心。我已經接種了疫苗，並得到了提升（實際上是Gigavaxxed）。我還\n如果需要的話，我也會得到一張選民登記卡。鑑於整個斯坦福監獄\n和其他一些讓黑人擔心疫苗的事情，爲什麼要讓他們擁有一張卡呢？\n爲什麼要指望他們有一張卡，而我們也...",
      "title": "爲什麼強制性疫苗卡可以，而選民登記卡就不行？"
    }
  ]
}