{
  "author": "LisHere321",
  "original_created_utc": 1632602398,
  "title": "October will be a very bullish month...it always has been.",
  "created_utc": 1632631688,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We must see this FUD as a welcome chance to buy crypto for cheap with those dips.</p>\n\n<p>Because if October starts, the bullrun will start and boost crypto up a lot. DCA/ HODL or buy low now and sell high in October if it is what you need, just stay strong and don&#39;t let paper hands overcome you.</p>\n\n<p>We have many super bullish news in the future like:</p>\n\n<ul>\n<li><p>ETH2.0 (developers probably are far in development and will announce release if they see all those FUD gone for biggest impact in price.)</p></li>\n<li><p>Ukraine working with Stellar on crypto for legal tender</p></li>\n<li><p>Paraguay also consider ETH and others for legal tender</p></li>\n<li><p>more and more nations consider crypto</p></li>\n</ul>\n\n<p>tl;dr: Many bullish news, don&#39;t sell low, DCA, HODL, October good for us</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/pvf3f7/october_will_be_a_very_bullish_monthit_always_has/",
  "subreddit": "CryptoCurrency",
  "id": "pvf3f7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We must see this FUD as a welcome chance to buy crypto for cheap with those\ndips.\n\nBecause if October starts, the bullrun will start and boost crypto up a lot.\nDCA/ HODL or buy low now and sell high in October if it is what you need, just\nstay strong and don't let paper hands overcome you.\n\nWe have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このFUDは、ディップで暗号を安く買うための歓迎すべきチャンスだと考えなければなりません。\nディップで安く買うチャンスだと考えなければなりません。\n\nなぜなら、10月が始まればブルランが始まり、cryptoが大幅に上昇するからです。\nDCA/ HODL、または今安く買って10月に高く売る、それが必要であれば、ただ\n強く、ペーパーハンドに負けないようにしましょう。\n\n我々は...",
      "title": "10月は非常に強気な月になるでしょう...いつもそうです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们必须把这种疑虑看作是一个受欢迎的机会，可以利用这些机会廉价购买加密货币。\n跌价。\n\n因为如果10月开始，牛市将开始，并推动加密货币上涨很多。\nDCA/HODL或现在低价买入，在10月高价卖出，如果这是你需要的，只是\n保持强势，不要让纸上谈兵的人战胜你。\n\n我们有...",
      "title": "10月将是一个非常看涨的月份......它总是如此。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們必須把這種疑慮看作是一個受歡迎的機會，可以利用這些機會廉價購買加密貨幣。\n跌價。\n\n因爲如果10月開始，牛市將開始，並推動加密貨幣上漲很多。\nDCA/HODL或現在低價買入，在10月高價賣出，如果這是你需要的，只是\n保持強勢，不要讓紙上談兵的人戰勝你。\n\n我們有...",
      "title": "10月將是一個非常看漲的月份......它總是如此。"
    }
  ]
}