{
  "author": "Ecstatic-Syllabub-42",
  "the_new_excerpt": "This is not financial advice** AMC as we all know closed about the $8 mark on\nFriday the 26th (closed at $8.01). Because of this, over 18,000 call options\nwere able to be executed due to the fact they were in the money. This means that\n1,800,000 shares of AMC will be purchased as a result. On…",
  "original_created_utc": 1614544574,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这不是理财建议**AMC大家都知道收盘价大约在8美元左右。\n26日周五（收盘价8.01美元）。正因为如此，超过18,000份看涨期权。\n能够被执行，是因为他们在钱的事实。这意味着\n1,800,000股AMC的股票将因此被购买。在...",
      "title": "AMC"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這不是理財建議**AMC大家都知道收盤價大約在8美元左右。\n26日週五（收盤價8.01美元）。正因爲如此，超過18,000份看漲期權。\n能夠被執行，是因爲他們在錢的事實。這意味着\n1,800,000股AMC的股票將因此被購買。在...",
      "title": "AMC"
    }
  ],
  "title": "AMC",
  "created_utc": 1614613170,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is not financial advice**\nAMC as we all know closed about the $8 mark on Friday the 26th (closed at $8.01). Because of this, over 18,000 call options were able to be executed due to the fact they were in the money. This means that 1,800,000 shares of AMC will be purchased as a result. On Friday, we also saw a call option volume of over 300,000 contracts meaning that hedge funds/sellers of these contracts will need to buy 100 shares per contract in order to hedge the position. This is how a gamma squeeze is formed. Through the massive amount of buys for this particular share. </p>\n\n<p>On top of this AMC is one of the most heavily shorted stocks on the market with a short interest similar to GameStop’s. It is also one of the most active stocks in terms of daily volume. With that said, AMC had potential to form a short squeeze on top of the gamma squeeze that is going to occur this upcoming week. This has the potential to his not $10, $20, $30 per share but above $100 per share if we all hold our shares. There will be information put out to scare us into selling. There will be ladder attacks to bring the price down. But all we have to do is hold. </p>\n\n<p>Holding this stock will force hedge funds and those shorting the stock to buy at whatever price we are willing to sell for. If we all hold we win. There are now over 9 million members of this group and we all feel as though we have been wronged by actions on Wall Street and the constant manipulation of prices. But this time we will win. We hold we win it is really that simple. Let’s make history together.</p>\n</div><!-- SC_ON -->",
  "score": 1354,
  "permalink": "/r/wallstreetbets/comments/luprzx/amc/",
  "subreddit": "wallstreetbets",
  "id": "luprzx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937752788
}