{
  "author": "NormanGuy95",
  "original_created_utc": 1626284862,
  "title": "Is it bad that I think the majority of “service dogs” are fake?",
  "created_utc": 1626319240,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know the title sounds awful, but let me explain. First, I’d like to say that I completely understand and appreciate the need for actual trained service dogs. Some people genuinely need them, and I respect that 100%.</p>\n\n<p>But, the sheer amount of people I know personally who purchased and actively use a fake service dog vest is absurd. They’ll use this lie for all sorts of reasons you can probably imagine and frankly it just seems so despicable to me. </p>\n\n<p>Just yesterday, I passed by a “service dog” while grocery shopping. I use quotations because the damn thing just blatantly wasn’t acting at all like a service dog should. It was very energetic and actively tried to approach anyone who came near. Don’t get me wrong, the pup was cute, but it was obvious to me it wasn’t trained in the way it’s vest suggests.</p>\n\n<p>I feel like a lot of people abuse this system and it just seems a bit insulting for people who genuinely need a service dog for day-to-day things. </p>\n\n<p>Maybe it’s just my perspective, but am I crazy for suspecting that most service dogs I see are probably just wearing a fake vest?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/ok9luz/is_it_bad_that_i_think_the_majority_of_service/",
  "subreddit": "TooAfraidToAsk",
  "id": "ok9luz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know the title sounds awful, but let me explain. First, I’d like to say that I\ncompletely understand and appreciate the need for actual trained service dogs.\nSome people genuinely need them, and I respect that 100%.\n\nBut, the sheer amount of people I know personally who purchased and actively…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "酷いタイトルに聞こえるかもしれませんが、説明させてください。まず最初に言いたいのは、私は\n実際に訓練された介助犬の必要性を完全に理解し、感謝しています。\n本当に必要としている人もいますし、それを100％尊重します。\n\nしかし、私が個人的に知っている人の中には、介助犬を購入し、積極的に...",
      "title": "介助犬」の大半が偽物だと思うのは悪いことでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道这个标题听起来很糟糕，但让我解释一下。首先，我想说，我\n完全理解并欣赏对实际训练的服务犬的需求。\n有些人真的需要它们，我100%尊重这一点。\n\n但是，我所认识的人中，有大量购买并积极...",
      "title": "我认为大多数 \"服务犬 \"是假的，这很糟糕吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道這個標題聽起來很糟糕，但讓我解釋一下。首先，我想說，我\n完全理解並欣賞對實際訓練的服務犬的需求。\n有些人真的需要它們，我100%尊重這一點。\n\n但是，我所認識的人中，有大量購買並積極...",
      "title": "我認爲大多數 \"服務犬 \"是假的，這很糟糕嗎？"
    }
  ]
}