{
  "author": "Stay_Cozy_",
  "original_created_utc": 1643016579,
  "title": "Is it polite (common courtesy) to thank the host of a party/ social gather before leaving?",
  "created_utc": 1643031048,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So it’s been weighing on my mind for a bit… but my friends and I had been invited to a thanksgiving dinner/ party. It was a small get together of adults 10 years older than myself and their children. A very calm and warm holiday gather, I honestly thought I wouldn’t be able to celebrate the holidays this year. I enjoyed it! But friend not so much since she thought it would be a party.&lt;/p&gt;\n\n&lt;p&gt;Right after the dinner/ get together was over… I offered to help clean and put away the food. Instead they told me not to worry and gave me a plate of food. I thanked the host and my friend was rushing me to leave since she wanted to go to a different party. I told her to wait so I can go and thank the host’s wife for welcoming us. I went and thanked his wife, hugged both of them and left. &lt;/p&gt;\n\n&lt;p&gt;My friend told me I looked “hella fake”for doing that. Advised me not to do that anymore, she seemed so annoyed with me.&lt;/p&gt;\n\n&lt;p&gt;Ummm… what? I thought it was common courtesy to thank the host and their significant other. Unless I’m off about that, I’m half Asian and lived in Japan for majority of my life. But I don’t think American culture is that different!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/sbi9y8/is_it_polite_common_courtesy_to_thank_the_host_of/",
  "subreddit": "NoStupidQuestions",
  "id": "sbi9y8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So it’s been weighing on my mind for a bit… but my friends and I had been\ninvited to a thanksgiving dinner/ party. It was a small get together of adults\n10 years older than myself and their children. A very calm and warm holiday\ngather, I honestly thought I wouldn’t be able to celebrate the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それで、ちょっと気になっていたのですが、友人と一緒に\n感謝祭のディナー・パーティーに招待されました。それは大人たちの小さな集まりで\n10歳年上の先輩とその子供たち。とても穏やかで温かい休日\nが集まるので、正直なところ、祝えないと思っていました。",
      "title": "パーティーや懇親会の主催者にお礼を言ってから帰るのが礼儀（コモンキー）でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以它一直压在我的心头......但我和我的朋友们被邀请参加一个感恩节晚餐/聚会。\n被邀请参加一个感恩节晚餐/聚会。那是一个成年人的小聚会\n比我大10岁的人和他们的孩子。一个非常平静和温暖的节日\n聚会，说实话，我认为我无法庆祝这个节日。",
      "title": "在离开之前感谢宴会/社交聚会的主人是一种礼貌（通常的礼貌）吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以它一直壓在我的心頭......但我和我的朋友們被邀請參加一個感恩節晚餐/聚會。\n被邀請參加一個感恩節晚餐/聚會。那是一個成年人的小聚會\n比我大10歲的人和他們的孩子。一個非常平靜和溫暖的節日\n聚會，說實話，我認爲我無法慶祝這個節日。",
      "title": "在離開之前感謝宴會/社交聚會的主人是一種禮貌（通常的禮貌）嗎？"
    }
  ]
}