{
  "author": "Stay_Cozy_",
  "original_created_utc": 1643016579,
  "title": "Is it polite (common courtesy) to thank the host of a party/ social gather before leaving?",
  "created_utc": 1643031048,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So it’s been weighing on my mind for a bit… but my friends and I had been invited to a thanksgiving dinner/ party. It was a small get together of adults 10 years older than myself and their children. A very calm and warm holiday gather, I honestly thought I wouldn’t be able to celebrate the holidays this year. I enjoyed it! But friend not so much since she thought it would be a party.&lt;/p&gt;\n\n&lt;p&gt;Right after the dinner/ get together was over… I offered to help clean and put away the food. Instead they told me not to worry and gave me a plate of food. I thanked the host and my friend was rushing me to leave since she wanted to go to a different party. I told her to wait so I can go and thank the host’s wife for welcoming us. I went and thanked his wife, hugged both of them and left. &lt;/p&gt;\n\n&lt;p&gt;My friend told me I looked “hella fake”for doing that. Advised me not to do that anymore, she seemed so annoyed with me.&lt;/p&gt;\n\n&lt;p&gt;Ummm… what? I thought it was common courtesy to thank the host and their significant other. Unless I’m off about that, I’m half Asian and lived in Japan for majority of my life. But I don’t think American culture is that different!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/sbi9y8/is_it_polite_common_courtesy_to_thank_the_host_of/",
  "subreddit": "NoStupidQuestions",
  "id": "sbi9y8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So it’s been weighing on my mind for a bit… but my friends and I had been\ninvited to a thanksgiving dinner/ party. It was a small get together of adults\n10 years older than myself and their children. A very calm and warm holiday\ngather, I honestly thought I wouldn’t be able to celebrate the…"
}