{
  "author": "yonesupport",
  "original_created_utc": 1640880305,
  "title": "DCA 2022, tell me one coin to add in my portfolio",
  "created_utc": 1640892786,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, I&amp;#39;m preparing my 2022 Dca plan and I&amp;#39;d love some feedbacks from my cryptofam.&lt;/p&gt;\n\n&lt;p&gt;The portfolio will be made of 7 coins chosen by me + 1 coin chosen by you.&lt;/p&gt;\n\n&lt;p&gt;This is my plan for the moment but I&amp;#39;m open to suggestions and tips on one coin from you:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;BTC: will be the first and most obvious choice. We all know why Bitcoin is the blue chip of cryptos, our digital gold. Let&amp;#39;s go next.&lt;/li&gt;\n&lt;li&gt;ETH: yes, I&amp;#39;m an Ethereum lover, the eth2.0 transition with the POS, the incoming changes to delete the insane gas fees, the burn, web3.0, NFTs on OpenSea, even the news on Sushi, all these things make me bullish on ETH, flippening or not. ETH and BTC will compose the 50% of the portfolio, the remaining 50% will be share among the following 4 cryptos plus one proposed by you.&lt;/li&gt;\n&lt;li&gt;LUNA: I fell in love with the idea behind Luna and Terra. It&amp;#39;s probably a blue chip here to stay. The protocols Anchor, Mirror, Swap, Terra powered by UST are spectacular imho. For those who don&amp;#39;t know, UST is an algorithmic stablecoin pegged to the value of the US dollar. What does this mean? Simply that if you want to mint 1 dollar of UST you have to burn 1 dollar of Luna. &lt;/li&gt;\n&lt;li&gt;ALGO: won&amp;#39;t say much about ALGO, if you&amp;#39;re here then you probably already know it, it&amp;#39;s almost everywhere in the daily. Algorand is a blockchain still in it&amp;#39;s infancy, but with a wonderful and simple wallet, a great idea (god I love governance so much) and some nice new projects like Yieldly, a DeFi platform entirely developed on Algorand. Algo is decentalized, fast and secure and sustainable. Yep, the other great thing is the fact that Algorand is carbon negative, you can have more information on this topic on Algo&amp;#39;s website. &lt;/li&gt;\n&lt;li&gt;CRO: I&amp;#39;m not gonna lie, I was impressed by cdc marketing this year, the insane amount of partnerships (Formula1, Serie A, naming rights on the Lakers arena, Philadelphia 76ers and so on), but they did not stop here: Visa card with cashback and free spotify/netflix, the cdc defi wallet where you can earn up to 13% on staked CROs, even the billions of cro burned are something I liked. Now they created Cronos and are aiming to &amp;quot;scale the DeFi and decentralised application ecosystem, by providing developers with the ability to instantly port apps from Ethereum and EVM-compatible chains&amp;quot;. A few projects can already be seen, like Tectonic. They are takin the NFTs market too, with some nice partnerships. For these reason I&amp;#39;m going to keep dcaing CRO in 2022&lt;/li&gt;\n&lt;li&gt;ATOM: Last but not least. The internet of blockchains. Interoperability will be a fundamental topic imo in 2022 and beyond. I think there will be 10/15 big cryptos that will need to be interconnected, and that&amp;#39;s what Cosmos wants to do. Like they say thei aim is &amp;quot;to make it easy for developers to build blockchains and break the barriers between blockchains by allowing them to transact with each other. The end goal is to create an Internet of Blockchains, a network of blockchains able to communicate with each other in a decentralized way. With Cosmos, blockchains can maintain sovereignty, process transactions quickly and communicate with other blockchains in the ecosystem, making it optimal for a variety of use cases&amp;quot;. They probably need to fix Atom tokenomic, but apart from that, the project is sweet. In the last month a lot of airdrops have been given to atom holders, making my bag heavier and keeping me in. And speaking about the price the good thing is that at the moment Atom is blocked under a strong resistance, but after that it&amp;#39;s probably a stairway to heaven. &lt;/li&gt;\n&lt;li&gt;CRV and CVX: Curve is a decentralized exchange optimized for low slippage and low fee swaps between assets pegged to the same value. It&amp;#39;s an automated market maker that operates similarly to Balancer, relying on liquidity pools and rewarding those who fund the pools, except it only deals with stablecoins, that&amp;#39;s the most simple explanation I can give you (words from Gemini site). Basically Curve is becoming more and more important in DeFi thanks to its ability to provide stablecoin liquidity across the ecosystem while offering token holders a less risky way to earn yield. Why I like this so much? Because we&amp;#39;re dealing with stablecoins, this means that both in a bull and in a bear markets CRV will stay here and generate profits, because the demand for stablecoin liquidity doesn&amp;#39;t care of a market up or down. There is a lot to say about Curve, the Curve war and so on (CVX and Yearn I&amp;#39;m talking to you), but this would take way too much time and you can find news on internet if interested.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;For the moment that&amp;#39;s it, these will be the cryptos I&amp;#39;ll DCA in 2022. &lt;/p&gt;\n\n&lt;p&gt;If you have some tips I&amp;#39;ll be happy to read all of them. &lt;/p&gt;\n\n&lt;p&gt;Now, given that I already have a bag of LRC, MATIC, DOT, what coin should I add? &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going to do a little experiment and pick one among the most upvoted answers, there is one rule: no shitcoins and no coins I already wrote. &lt;/p&gt;\n\n&lt;p&gt;When proposing the coin please tell me why should I add it and if you will DCA it or not in 2022.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s it guys. Took a lot of time lol, hope you appreciate and this post can be useful to some of you. Remember to DYOR!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/rs56i1/dca_2022_tell_me_one_coin_to_add_in_my_portfolio/",
  "subreddit": "CryptoCurrency",
  "id": "rs56i1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So, I'm preparing my 2022 Dca plan and I'd love some feedbacks from my\ncryptofam.\n\nThe portfolio will be made of 7 coins chosen by me + 1 coin chosen by you.\n\nThis is my plan for the moment but I'm open to suggestions and tips on one coin\nfrom you:\n\n 1. BTC: will be the first and most obvious…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで、2022年のDca計画を準備しているのですが、その際のフィードバックを\nクリプトファム\n\nポートフォリオは、私が選んだ7つのコイン＋あなたが選んだ1つのコインで構成される予定です。\n\nこれは今のところ私の計画ですが、1つのコインに関する提案やヒントをお待ちしています。\nをお願いします。\n\n 1. BTC：最初の、そして最も明白なものになる...",
      "title": "DCA 2022、ポートフォリオに加えるべきコインを教えてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我正在准备我的2022年Dca计划，我希望从我的朋友那里得到一些反馈。\n的反馈。\n\n该投资组合将由我选择的7个币+你选择的1个币组成。\n\n这是我目前的计划，但我愿意接受关于一个硬币的建议和提示。\n的建议和提示。\n\n 1. BTC：将是第一个和最明显的...",
      "title": "DCA 2022，告诉我在我的投资组合中增加一个硬币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我正在準備我的2022年Dca計劃，我希望從我的朋友那裏得到一些反饋。\n的反饋。\n\n該投資組合將由我選擇的7個幣+你選擇的1個幣組成。\n\n這是我目前的計劃，但我願意接受關於一個硬幣的建議和提示。\n的建議和提示。\n\n 1. BTC：將是第一個和最明顯的...",
      "title": "DCA 2022，告訴我在我的投資組合中增加一個硬幣"
    }
  ]
}