{
  "author": "Need_to_escape_",
  "original_created_utc": 1625160907,
  "title": "I'm about to be homeless, what resources do I have?",
  "created_utc": 1625174501,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>TL;DR - About to be homeless with ~$500 in my bank account. I&#39;m don&#39;t smoke, drink, and am drug-free. I don&#39;t do anything in my free time and am solely focused on finishing school (hopefully by the end of this August) and getting my career off the ground. I&#39;ve had long-term stable employment for the last 10 years, no criminal history / clean background. Currently in Greater Orlando area but thinking about moving to GA (Metro-Atlanta) as I have more resources are there. I don&#39;t know what to do in this situation.</strong></p>\n\n<p>I&#39;m 30 years old and transitioning careers. Currently a senior finishing a degree in computer science (attending remote / virtually) and hope to be done by August of this year.</p>\n\n<p>I lost a part time job at the beginning of the year and found myself living with my aging parents who assured me I can finish school while I stay with them. Unfortunately, they elected to move to Florida on a whim. They told me I needed to help them move or to get out... having little to no notice and few resources available I caved, I needed a roof over my head so I can get this degree done.</p>\n\n<p>My parents didn&#39;t plan for this life change accordingly (they&#39;ve always struggled financially) and it has become apparent that they&#39;ve screwed up. I&#39;ve drained my checking and savings account and am nearly maxed on a credit card by living with them and having to support them. My mother is full on in hysterics about how she needs to get a job again (both of my parents are retired living on social security / retirement). The only way she interacts with me is screaming about how I need to stop being lazy or get the fuck out (despite 10 - 12 hour days working solely on school). There is an expectation that I start working and provide for both of them.</p>\n\n<p>This situation has greatly hurt my relationship with my parents. I don&#39;t want to be around them or associate with them. I know and appreciate they&#39;re getting older and probably having a tough time with that, but at this moment I cannot even support myself.</p>\n\n<p>I&#39;m suffering severe financial, physical, and emotional distress by being here. I currently reside in the greater Orlando area. I previously left Metro-Atlanta (Georgia) and I am considering moving back as I may have more resources and sleeping in my car worst case scenario.</p>\n\n<p>I don&#39;t know what to do or where to turn. I&#39;m willing to sleep on the street as long as I can move in the right direction.</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/NoStupidQuestions/comments/obqulh/im_about_to_be_homeless_what_resources_do_i_have/",
  "subreddit": "NoStupidQuestions",
  "id": "obqulh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "TL;DR - About to be homeless with ~$500 in my bank account. I'm don't smoke,\ndrink, and am drug-free. I don't do anything in my free time and am solely\nfocused on finishing school (hopefully by the end of this August) and getting my\ncareer off the ground. I've had long-term stable employment for the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TL;DR - 銀行口座に500ドルしかない状態でホームレスになろうとしています。私はタバコも酒も飲みません。\n飲まないし、ドラッグもやっていない。自由時間には何もせず、学校を卒業して（できれば今年の8月末までに）大学入学資格を得ることだけに集中しています。\n学校を卒業すること（できれば8月末までに）と、介護保険を受けることに専念しています。\nキャリアをスタートさせることに集中しています。私はこれまで長期的に安定した仕事をしてきました...",
      "title": "ホームレスになりそうなのですが、どのようなリソースがありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TL;DR - 即将无家可归，我的银行账户上有~500美元。我不抽烟。\n喝酒，也不吸毒。我在空闲时间不做任何事情，只专注于完成学业（希望在今年8月底前完成）和\n我只专注于完成学业（希望能在今年8月底前完成），并让我的事业起步。\n事业。我已经有长期稳定的工作了。",
      "title": "我马上就要无家可归了，我有什么资源？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TL;DR - 即將無家可歸，我的銀行賬戶上有~500美元。我不抽菸。\n喝酒，也不吸毒。我在空閒時間不做任何事情，只專注於完成學業（希望在今年8月底前完成）和\n我只專注於完成學業（希望能在今年8月底前完成），並讓我的事業起步。\n事業。我已經有長期穩定的工作了。",
      "title": "我馬上就要無家可歸了，我有什麼資源？"
    }
  ]
}