{
  "author": "anubhav100",
  "the_new_excerpt": "Hey everyone, I have created a quick interactive Roblox multiple valuation that\nevaluates which multiples make most sense for Roblox.\n\nThe interactive analysis allows you to flex various Bookings and Revenue\nmultiples to evaluate which ones make the most sense. You can also see where the\n$29.5Bn…",
  "original_created_utc": 1615308957,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，大家好，我已经创建了一个快速互动的Roblox倍数估值，这\n评估哪种倍数对Roblox最有意义。\n\n交互式分析允许您灵活运用各种预订和收入\n的倍数，以评估哪些倍数最合理。您还可以看到在哪里\n295亿...",
      "title": "Roblox 高增长的SaaS多方VS统一多方"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，大家好，我已經創建了一個快速互動的Roblox倍數估值，這\n評估哪種倍數對Roblox最有意義。\n\n交互式分析允許您靈活運用各種預訂和收入\n的倍數，以評估哪些倍數最合理。您還可以看到在哪裏\n295億...",
      "title": "Roblox 高增長的SaaS多方VS統一多方"
    }
  ],
  "title": "Roblox: High growth SaaS multiple vs. Unity multuple",
  "created_utc": 1615347000,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey everyone, I have created a quick interactive Roblox multiple valuation that evaluates which multiples make most sense for Roblox.</p>\n\n<p>The interactive analysis allows you to flex various Bookings and Revenue multiples to evaluate which ones make the most sense. You can also see where the $29.5Bn valuation from the last round lands relative to low-growth SaaS, high-growth SaaS and Unity multiple.</p>\n\n<p>Finally, you can also flex 2021 engagement and monetization metrics (DAU and ABPDAU) to evaluate different post-COVID scenarios for this year and see how that impacts valuation multiples.</p>\n\n<p>Link: <a href=\"https://tactyc.io/published/3533\">https://tactyc.io/published/3533</a></p>\n\n<p>Would love to get your feedback on how I can improve this!</p>\n</div><!-- SC_ON -->",
  "score": 48,
  "permalink": "/r/investing/comments/m1aq8m/roblox_high_growth_saas_multiple_vs_unity_multuple/",
  "subreddit": "investing",
  "id": "m1aq8m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542575833
}