{
  "author": "Roseora",
  "original_created_utc": 1629339108,
  "title": "What's the point of 'no nut november'?",
  "created_utc": 1629385091,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I hear people talk about it, I don&#39;t get it.</p>\n\n<p>Unless someone has a moral or religious objection, masturbation is harmless and only takes maybe a half hour at most out of someones week, and for men can apparently reduce risk of some cancers.</p>\n\n<p>In a relationship, could refusing for a month not upset ones partner? I&#39;m asexual myself but sex appears to be incredibly important to a lot of peoples having of a happy relationship. If i&#39;m missing something here, fill me in...?</p>\n\n<p>I just don&#39;t get it. It&#39;s not like giving up, for example, cake or pizza for a month where there&#39;s a tangible benefit (like health or financial) or anything, and if someone holds no moral or religious objections to sexual gratification, and enjoys it, I don&#39;t understand why someone would abstain for a month seemingly arbitrarily.</p>\n\n<p>And why november, other than the alliteration?</p>\n\n<p>No judgement, do whatever you want, I just would appreciate an explanation. XD</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/p75o4b/whats_the_point_of_no_nut_november/",
  "subreddit": "TooAfraidToAsk",
  "id": "p75o4b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I hear people talk about it, I don't get it.\n\nUnless someone has a moral or religious objection, masturbation is harmless and\nonly takes maybe a half hour at most out of someones week, and for men can\napparently reduce risk of some cancers.\n\nIn a relationship, could refusing for a month not upset…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、人の話を聞いてもピンとこない。\n\nモラルや宗教上の問題がない限り、自慰行為は無害であり\n一週間のうち、せいぜい30分程度しかかからないし、男性にとってはいくつかの癌のリスクを減らすことができる。\n男性の場合、いくつかの癌のリスクを減らすことができるようです。\n\n恋愛においては、1ヶ月間断っても怒られないのでは...？",
      "title": "ノー・ナッツ・ノベンバー」の意味は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我听到人们谈论它，我不明白。\n\n除非有人在道德上或宗教上有异议，否则手淫是无害的，而且最多只需花上半小时。\n手淫是无害的，而且最多只需要花费半小时的时间。\n显然可以减少一些癌症的风险。\n\n在一段关系中，拒绝一个月的手淫不会让人感到不安......",
      "title": "没有坚果的十一月 \"有什么意义呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我聽到人們談論它，我不明白。\n\n除非有人在道德上或宗教上有異議，否則手淫是無害的，而且最多隻需花上半小時。\n手淫是無害的，而且最多隻需要花費半小時的時間。\n顯然可以減少一些癌症的風險。\n\n在一段關係中，拒絕一個月的手淫不會讓人感到不安......",
      "title": "沒有堅果的十一月 \"有什麼意義呢？"
    }
  ]
}