{
  "author": "Fly_U_Fools",
  "original_created_utc": 1638214923,
  "title": "Does anyone else get creeped out when going out-of-bounds in video games?",
  "created_utc": 1638234760,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve always had this feeling whenever I break out of the map in a video game, where I get a bizarre nervousness and sense of impending doom, and I have no idea why.</p>\n\n<p>I’ve recently seen a lot of videos online about liminal spaces, and the uncanny valley etc., and I’d say it’s related to that. Very similar feeling, that something is ‘wrong’ and I’m not supposed to be seeing what I’m seeing. It’s just strange how it causes a genuine feeling of fear even though I’m obviously not in an danger at all. I get on edge, almost as if I’m expecting a jump-scare. </p>\n\n<p>Does anyone else get this?</p>\n</div><!-- SC_ON -->",
  "score": 210,
  "permalink": "/r/NoStupidQuestions/comments/r53ske/does_anyone_else_get_creeped_out_when_going/",
  "subreddit": "NoStupidQuestions",
  "id": "r53ske",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve always had this feeling whenever I break out of the map in a video game,\nwhere I get a bizarre nervousness and sense of impending doom, and I have no\nidea why.\n\nI’ve recently seen a lot of videos online about liminal spaces, and the uncanny\nvalley etc., and I’d say it’s related to that. Very…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "テレビゲームでマップを抜け出すときには、いつもこの感覚があります。\n異様な緊張感と切迫した感覚に襲われます。\nなぜだろう？\n\n最近、ネットで限界空間や不気味の谷などについてのビデオをよく目にしました。\n谷などのビデオを最近ネットでよく見ましたが、それに関連しているのではないかと思います。とても...",
      "title": "ビデオゲームでアウトオブバウンズになるとゾッとする人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每当我在视频游戏中冲出地图时，我总是有这种感觉。\n我有一种奇怪的紧张感和即将到来的厄运感，而且我没有\n我不知道为什么。\n\n我最近在网上看到很多关于边缘空间的视频，还有不可思议的\n谷等等，我说这与此有关。非常...",
      "title": "还有人在视频游戏中出界时感到惊悚吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每當我在視頻遊戲中衝出地圖時，我總是有這種感覺。\n我有一種奇怪的緊張感和即將到來的厄運感，而且我沒有\n我不知道爲什麼。\n\n我最近在網上看到很多關於邊緣空間的視頻，還有不可思議的\n谷等等，我說這與此有關。非常...",
      "title": "還有人在視頻遊戲中出界時感到驚悚嗎？"
    }
  ]
}