{
  "author": "Stidwack",
  "original_created_utc": 1627691097,
  "title": "Pro-tip: If you ever attain significant wealth, and actively plan to use crypto out in the wild, have 2 burner wallets.",
  "created_utc": 1627702374,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>DO NOT walk around with your 6 or 7 figures wallet on your phone. For the love of God buy a hardware wallet, or other form of cold storage.</p>\n\n<p>Reason for the 2 fake wallets:\nIf anyone out in the world knows or even thinks you may have Bitcoin or crypto on your person, they&#39;ll know what it&#39;s potentially worth. They hold you up, they know what they&#39;re doing, and demand passphrases. You give them one that is an obvious burner, with low amounts. They get wise and ask for your whole balance. Enter fake wallet number 2. You get off easy. Hell, make a 3rd one. But 2 should suffice.</p>\n\n<p>*edit: grammar</p>\n</div><!-- SC_ON -->",
  "score": 207,
  "permalink": "/r/CryptoCurrency/comments/oux94i/protip_if_you_ever_attain_significant_wealth_and/",
  "subreddit": "CryptoCurrency",
  "id": "oux94i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "DO NOT walk around with your 6 or 7 figures wallet on your phone. For the love\nof God buy a hardware wallet, or other form of cold storage.\n\nReason for the 2 fake wallets: If anyone out in the world knows or even thinks\nyou may have Bitcoin or crypto on your person, they'll know what…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "6桁、7桁の財布を携帯電話に入れて歩かないでください。お願いだから\nハードウェアウォレットを購入するか、その他の方法で保管してください。\n\n偽物の財布が2つある理由 世の中の誰かに知られたり、思われたりしたら\nビットコインや暗号を持ち歩いていると思われたら、何を...",
      "title": "プロからのアドバイス：もしあなたが大きな富を得て、積極的に暗号を使用するつもりなら、バーナーウォレットを2つ用意してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不要带着你的6或7位数的钱包在你的手机上走动。看在上帝的份上\n买一个硬件钱包，或其他形式的冷存储。\n\n两个假钱包的原因。如果世界上有人知道或甚至认为\n你的身上可能有比特币或加密货币，他们会知道...",
      "title": "建议：如果你有一天获得了大量财富，并积极计划在野外使用加密货币，请准备两个刻录机钱包。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不要帶着你的6或7位數的錢包在你的手機上走動。看在上帝的份上\n買一個硬件錢包，或其他形式的冷存儲。\n\n兩個假錢包的原因。如果世界上有人知道或甚至認爲\n你的身上可能有比特幣或加密貨幣，他們會知道...",
      "title": "建議：如果你有一天獲得了大量財富，並積極計劃在野外使用加密貨幣，請準備兩個刻錄機錢包。"
    }
  ]
}