{
  "author": "dinoman9877",
  "original_created_utc": 1654514684,
  "title": "Why are people collectively pretending COVID just isn't a thing anymore?",
  "created_utc": 1654530149,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It can&amp;#39;t just be me who&amp;#39;s noticing that people are just...pretending like COVID never happened out in public, right? No masks anywhere to be seen outside of medical facilities, people sneezing and coughing into their hands to spread their germs everywhere, cramming into places like a sardine can. It&amp;#39;s like we haven&amp;#39;t spent the last three years dealing with this thing.  &lt;/p&gt;\n\n&lt;p&gt;Why have people just decided to pretend that COVID is over? Have we just collectively given up on trying to protect each other because of how many people refused to do anything related to preventing COVID so they could go out and party instead or because &amp;quot;MASKS PREVENT YOU FROM BREATHING!!!!!!!&amp;quot; nonsense?  &lt;/p&gt;\n\n&lt;p&gt;Like...I&amp;#39;m legitimately at a loss, going out and seeing people act like this disease which has killed so many already isn&amp;#39;t still around killing so many more.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 129,
  "permalink": "/r/NoStupidQuestions/comments/v61959/why_are_people_collectively_pretending_covid_just/",
  "subreddit": "NoStupidQuestions",
  "id": "v61959",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It can't just be me who's noticing that people are just...pretending like COVID\nnever happened out in public, right? No masks anywhere to be seen outside of\nmedical facilities, people sneezing and coughing into their hands to spread\ntheir germs everywhere, cramming into places like a sardine can.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "COVIDがなかったことにされてるのに気づいたのは私だけではないはず。\n人前では何もなかったかのように 振る舞っていますよね？医療施設以外ではマスクは見かけませんし\n医療施設以外ではマスクも見られず、人々はくしゃみや咳を手にして菌を撒き散らし、\nイワシ缶のように詰め込んでいる......。",
      "title": "なんでみんなまとめてCOVIDをもうなかったことにしてるんだ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不可能只有我注意到，人们只是......假装COVID从未在公众面前发生过。\n在公共场合从未发生过，对吗？在医疗机构之外，没有任何地方可以看到面具\n人们对着自己的手打喷嚏和咳嗽，到处传播他们的病菌。\n他们的病菌无处不在，像沙丁鱼罐头一样挤在一起....",
      "title": "为什么人们集体地假装COVID只是不存在了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不可能只有我注意到，人們只是......假裝COVID從未在公衆面前發生過。\n在公共場合從未發生過，對嗎？在醫療機構之外，沒有任何地方可以看到面具\n人們對着自己的手打噴嚏和咳嗽，到處傳播他們的病菌。\n他們的病菌無處不在，像沙丁魚罐頭一樣擠在一起....",
      "title": "爲什麼人們集體地假裝COVID只是不存在了？"
    }
  ]
}