{
  "author": "Carl_Corey",
  "original_created_utc": 1642518858,
  "title": "If you don't have an enormous sum of money in crypto, you don't have to worry about most of the posts you see here.",
  "created_utc": 1642538126,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;All of the detailed minutia of crypto is fascinating. Using native wallets, staking, airdrops, cold storage, etc is all great. But if you are trading in the hundreds, or even in the thousands....you really don&amp;#39;t need to worry about all that.&lt;/p&gt;\n\n&lt;p&gt;Between gas fees, human error, scams, and hackers, you will likely be better off just trading on an exchange, and there is nothing wrong with that.&lt;/p&gt;\n\n&lt;p&gt;This community tends to hate on exchanges (not your keys, not your coins), but they do have legitimate use for the large majority of retail users who are just trying to throw a bit of extra cash into some investments. You don&amp;#39;t need to panic if you have $500 of BTC on an exchange because you &amp;quot;don&amp;#39;t own the keys&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;As long as you are using reputable companies like Coinbase and CDC (not you, Binance), you are not likely to have any issues.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 324,
  "permalink": "/r/CryptoCurrency/comments/s6zs0q/if_you_dont_have_an_enormous_sum_of_money_in/",
  "subreddit": "CryptoCurrency",
  "id": "s6zs0q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "All of the detailed minutia of crypto is fascinating. Using native wallets,\nstaking, airdrops, cold storage, etc is all great. But if you are trading in the\nhundreds, or even in the thousands....you really don't need to worry about all\nthat.\n\nBetween gas fees, human error, scams, and hackers, you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号の細かいミニュチュアはすべて魅力的です。ネイティブウォレットを使うこと。\nステーキング、エアドロップ、コールドストレージなど、どれも素晴らしいです。しかし、もしあなたが数百万ドル単位で取引しているのなら\n数百、数千の単位なら、そんなこと気にする必要はないでしょう。\nということです。\n\nガス代、人為的なミス、詐欺、ハッカーの間で...",
      "title": "暗号に莫大な金額を預けていないのであれば、ここで見る書き込みのほとんどを気にする必要はないでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所有关于加密货币的详细细节都很吸引人。使用本地钱包。\n赌注，空投，冷存储等都是很好的。但如果你的交易量在\n几百个，甚至几千个....，你真的不需要担心这些。\n这些。\n\n在汽油费、人为错误、诈骗和黑客之间，你...",
      "title": "如果你在加密货币中没有巨额资金，你不必担心你在这里看到的大多数帖子。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所有關於加密貨幣的詳細細節都很吸引人。使用本地錢包。\n賭注，空投，冷存儲等都是很好的。但如果你的交易量在\n幾百個，甚至幾千個....，你真的不需要擔心這些。\n這些。\n\n在汽油費、人爲錯誤、詐騙和黑客之間，你...",
      "title": "如果你在加密貨幣中沒有鉅額資金，你不必擔心你在這裏看到的大多數帖子。"
    }
  ]
}