{
  "author": "rombotron74",
  "original_created_utc": 1659635351,
  "title": "Why do all modern home appliances have to make a beeping sound for every button pressed and why don't manufacturers at least give you the option to disable it?",
  "created_utc": 1659645617,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I recently moved and got a bunch of new appliances, a microwave, a stove, a dish washer, etc.&lt;br/&gt;\nEach and every one of those items utters the most obnoxious sound upon pressing any button, first and foremost the microwave, which is so loud that my neighbors actually complained once after I only wanted to heat a meal (which means about 8 loud beeps)&lt;br/&gt;\nI get that it&amp;#39;s kind of a safety thing for some things and it maybe helps older people who don&amp;#39;t really know if they have pressed a button right, but why can&amp;#39;t I disable it? The only way (I looked it up) to disable beeps on my microwave is to open it up and rip out the squeaker thing...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 144,
  "permalink": "/r/NoStupidQuestions/comments/wg7jo7/why_do_all_modern_home_appliances_have_to_make_a/",
  "subreddit": "NoStupidQuestions",
  "id": "wg7jo7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I recently moved and got a bunch of new appliances, a microwave, a stove, a dish\nwasher, etc.\nEach and every one of those items utters the most obnoxious sound upon pressing\nany button, first and foremost the microwave, which is so loud that my neighbors\nactually complained once after I only wanted…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近引っ越しをして、電子レンジ、コンロ、食器など、新しい家電をたくさん手に入れました。\nを購入しました。\nそのどれもが、どのボタンを押しても、とても不快な音を発します。\nを押すと、とてもうるさい音がします。\n私が望んだだけなのに、近所から苦情が来たことがある。",
      "title": "なぜ最近の家電製品は、ボタンを押すたびにピーピーと音がするのか、なぜメーカーはせめてそれを無効にするオプションをつけないのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近搬家，买了一堆新的电器，一个微波炉，一个炉子，一个碗碟。\n洗碗机等等。\n每件物品在按下任何按钮时都会发出最令人厌恶的声音。\n任何按钮，首先是微波炉，它的声音太大，以至于我的邻居们\n事实上，我的邻居曾经抱怨过，我只想...",
      "title": "为什么所有的现代家用电器每按一个按钮都要发出哔哔声，为什么制造商至少不给你一个选项来禁用它？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近搬家，買了一堆新的電器，一個微波爐，一個爐子，一個碗碟。\n洗碗機等等。\n每件物品在按下任何按鈕時都會發出最令人厭惡的聲音。\n任何按鈕，首先是微波爐，它的聲音太大，以至於我的鄰居們\n事實上，我的鄰居曾經抱怨過，我只想...",
      "title": "爲什麼所有的現代家用電器每按一個按鈕都要發出嗶嗶聲，爲什麼製造商至少不給你一個選項來禁用它？"
    }
  ]
}