{
  "author": "hyperinflationUSA",
  "the_new_excerpt": "...nah not hyperinflation that can't happen here.\n\n\n\nIn drugs, its called the onset when you take a pill and wait for it to kick it.\nDuring the onset you feel 0 effects. The onset lasted from maybe March 2020 to\nJan 2021.\n\n\n\nNext is the come up, when you start to feel effects but its not full…",
  "original_created_utc": 1620347935,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "...いや、ハイパーインフレはここでは起こりえない。\n\n\n\n薬の場合、薬を飲んで効き目が出るのを待つことをオンセットと言います。\nオンセットの間は効果が0になる。オンセットは、たぶん2020年3月から2021年1月まで続く。\n2021年1月まで続きました。\n\n\n\n次に、効果を感じ始めますが、まだ完全ではない「カムアップ」と呼ばれる時期です。",
      "title": "多くの人がインフレを否定しています。もし2年前に、「もしある日、FRBがランダムに10兆ドルを刷ることにしたら、ハイパーインフレが起こるだろうね」と聞かれたら、誰もがそう思うでしょう。しかし、実際にそれが起こると、90％の人が「いや、それはない」と何か言い訳を考え出すのです...."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "...不，不是恶性通货膨胀，这里不可能发生。\n\n\n\n在药物方面，当你服用药片并等待它发作时，它被称为发病期。\n在发病期，你感觉不到任何影响。发作期可能从2020年3月持续到\n2021年1月。\n\n\n\n下一步是开始，当你开始感觉到效果，但它不是完全...",
      "title": "太多的人对通货膨胀持否定态度。如果你在两年前问他们：\"嘿，如果有一天美联储随机决定印制10万亿美元，这将导致恶性通货膨胀，对吗？\"每个人都会同意。但当它实际发生时，90%的人都会想出一些借口来解释为什么不....。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "...不，不是惡性通貨膨脹，這裏不可能發生。\n\n\n\n在藥物方面，當你服用藥片並等待它發作時，它被稱爲發病期。\n在發病期，你感覺不到任何影響。發作期可能從2020年3月持續到\n2021年1月。\n\n\n\n下一步是開始，當你開始感覺到效果，但它不是完全...",
      "title": "太多的人對通貨膨脹持否定態度。如果你在兩年前問他們：\"嘿，如果有一天美聯儲隨機決定印製10萬億美元，這將導致惡性通貨膨脹，對嗎？\"每個人都會同意。但當它實際發生時，90%的人都會想出一些藉口來解釋爲什麼不....。"
    }
  ],
  "title": "Soo many people are in denial about inflation. If you asked them 2 years ago \"hey if one day the fed randomly decided to print 10 trillion dollars, that would cause hyperinflation, right\" everyone would agree. But when it actually happens, 90% of people come up with some excuse as to why nah not....",
  "created_utc": 1620379836,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>...nah not hyperinflation that can&#39;t happen here. </p>\n\n<p>&#x200B;</p>\n\n<p>In drugs, its called the <strong>onset</strong> when you take a pill and wait for it to kick it. During the onset you feel 0 effects. The onset lasted from maybe March 2020 to Jan 2021.</p>\n\n<p>&#x200B;</p>\n\n<p>Next is the <strong>come up,</strong>  when you start to feel effects but its not full strength yet. The come up started once the vaccine rolled out and people started spending, inflation starts small. The come up started Jan 2021 once the vaccine started allowing poeple to leave their house.</p>\n\n<p>&#x200B;</p>\n\n<p>After the come up is the <strong>Peak</strong> - I except the peak start once we reach 80% to100% vaccination in the USA, we are currently at about 33% vaccinated. Current estimates say it will take until 2022 to get their.</p>\n\n<p>&#x200B;</p>\n\n<p>The <strong>come down,</strong> come as the fed raises rates. Hyperinflation is only temporary, as it only last a few years in every country in history. But your savings will be worthless by the time of the come down.</p>\n</div><!-- SC_ON -->",
  "score": 308,
  "permalink": "/r/Bitcoin/comments/n6m7ki/soo_many_people_are_in_denial_about_inflation_if/",
  "subreddit": "Bitcoin",
  "id": "n6m7ki",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985986288
}