{
  "author": "CretaceousClock",
  "original_created_utc": 1640087355,
  "title": "Why was Churchill so determined to continue the war?",
  "created_utc": 1640128565,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I understand he did not want England to lose or get invaded, so there were valid reasons to never surrender. I just don&amp;#39;t know what his personal reason was for not trying to sue for peace. There was several times during the second World War where Churchill could have offered peace with Germany and it probably would have been accepted. Why didn&amp;#39;t Churchill? &lt;/p&gt;\n\n&lt;p&gt;As a side note, was there much pressure to end the war and go for peace by the people of England? Hitler definitely did not want War with England and that seemed to be common knowledge, so why did they never try and end the war?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/rld13u/why_was_churchill_so_determined_to_continue_the/",
  "subreddit": "AskHistorians",
  "id": "rld13u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I understand he did not want England to lose or get invaded, so there were valid\nreasons to never surrender. I just don't know what his personal reason was for\nnot trying to sue for peace. There was several times during the second World War\nwhere Churchill could have offered peace with Germany and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イギリスが負けたり、侵略されたりするのを嫌ったのでしょうから、正当な理由があったのでしょう。\n決して降伏しない理由がある。ただ、彼の個人的な理由が何だったのかがわからないのです。\n和平を訴えようとしない。第二次世界大戦中、何度か\nチャーチルはドイツに和平を申し出ることができたのに...。",
      "title": "なぜチャーチルは戦争継続を決意したのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道他不希望英国战败或被入侵，所以有正当理由不投降。\n所以他有充分的理由绝不投降。我只是不知道他的个人理由是什么？\n不试图求和的个人原因。在第二次世界大战期间，有几次\n丘吉尔本可以向德国提出和平，而...",
      "title": "为什么丘吉尔如此坚决地要继续战争？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道他不希望英國戰敗或被入侵，所以有正當理由不投降。\n所以他有充分的理由絕不投降。我只是不知道他的個人理由是什麼？\n不試圖求和的個人原因。在第二次世界大戰期間，有幾次\n丘吉爾本可以向德國提出和平，而...",
      "title": "爲什麼丘吉爾如此堅決地要繼續戰爭？"
    }
  ]
}