{
  "author": "Nozomilk",
  "original_created_utc": 1638030496,
  "title": "What's Something That's NOT Money, Have You Gained From Investing in Crypto?",
  "created_utc": 1638038317,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We all like to talk about the Green Dildos, the Lambos, but not enough talk about the lessons that we get from Investing in Crypto. Funny how we all have different circumstances but I think we all learn the same lessons.</p>\n\n<p>&#x200B;</p>\n\n<p>Financial Literacy is something that I have gained from Investing in Crypto. And boy am I glad that I know it. I&#39;m only 21 and this a lesson that I will carry until I die (hopefully not soon lol). I grew up in a poor family, in a third world country and my parents are Financially Illiterate. Hopefully, I could break the poverty cycle with my new lessons on crypto.</p>\n\n<p>&#x200B;</p>\n\n<p>Financial Literacy from crypto taught me:</p>\n\n<p>How to do my research when investing in anything (very important), how to spot scams, how to be responsible with my money, ~~how to not pay taxes~~ jk, how to not let my emotions ruin my financial decisions, how to live below my means and save money, etc. And this Financial Literacy has given me a hope. A hope that maybe, I could break this cycle of poverty. I&#39;m still one broken condom away from financial ruin tho lmao.</p>\n\n<p>&#x200B;</p>\n\n<p>Even if I get all the money in the world, If I&#39;m not Financially Literate, It don&#39;t matter bro.</p>\n\n<p>&#x200B;</p>\n\n<p>Technically it&#39;s about money, but also not really money. What&#39;s something you got from crypto aside from the gains (if any lmao F)?</p>\n</div><!-- SC_ON -->",
  "score": 186,
  "permalink": "/r/CryptoCurrency/comments/r3h08b/whats_something_thats_not_money_have_you_gained/",
  "subreddit": "CryptoCurrency",
  "id": "r3h08b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We all like to talk about the Green Dildos, the Lambos, but not enough talk\nabout the lessons that we get from Investing in Crypto. Funny how we all have\ndifferent circumstances but I think we all learn the same lessons.\n\n\n\nFinancial Literacy is something that I have gained from Investing in Crypto.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "緑のディルドやランボの話は好きですが、暗号投資から得られる教訓についてはあまり語られません。\n暗号投資から得られる教訓についてはあまり語られません。おかしなことに、私たちは皆、異なる状況に\n同じことを学ぶのだと思います。\n\n\n\n金融リテラシーは、私が暗号への投資から得たものです....",
      "title": "お金ではないもの、暗号投資で得たものとは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都喜欢谈论绿色假阳具和兰博，但对投资加密货币所获得的经验却谈得不够。\n我们从投资加密货币中得到的教训。有趣的是，我们都有\n不同的情况，但我认为我们都学到了同样的课程。\n\n\n\n金融知识是我从投资加密货币中获得的东西....。",
      "title": "什么东西不是钱，你从投资加密货币中获得了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都喜歡談論綠色假陽具和蘭博，但對投資加密貨幣所獲得的經驗卻談得不夠。\n我們從投資加密貨幣中得到的教訓。有趣的是，我們都有\n不同的情況，但我認爲我們都學到了同樣的課程。\n\n\n\n金融知識是我從投資加密貨幣中獲得的東西....。",
      "title": "什麼東西不是錢，你從投資加密貨幣中獲得了嗎？"
    }
  ]
}