{
  "author": "ride_me_like_u_care",
  "the_new_excerpt": "Guys, today is a really good day for me and I just wanted to share it with you\nguys as cant tell anyone else IRL yet :)\n\nI checked my portfolio today (after 5 days of not checking!) and due sudden\nsurge of some of the projects I was invested in, I can see its significant\nenough that I am finally…",
  "original_created_utc": 1613736781,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "伙计们，今天对我来说是个非常好的日子，我只想和你们分享一下。\n你们，因为我还没有告诉其他人:)\n\n我今天检查了我的投资组合（在5天没有检查之后！），由于突然的\n我所投资的一些项目的激增，我可以看到它的重大。\n我终于...",
      "title": "今年我辞职了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "夥計們，今天對我來說是個非常好的日子，我只想和你們分享一下。\n你們，因爲我還沒有告訴其他人:)\n\n我今天檢查了我的投資組合（在5天沒有檢查之後！），由於突然的\n我所投資的一些項目的激增，我可以看到它的重大。\n我終於...",
      "title": "今年我辭職了"
    }
  ],
  "title": "Quitting my job this year",
  "created_utc": 1613777990,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Guys, today is a really good day for me and I just wanted to share it with you guys as cant tell anyone else IRL yet :)</p>\n\n<p>I checked my portfolio today (after 5 days of not checking!) and due sudden surge of some of the projects I was invested in, I can see its significant enough that I am finally close to quitting my job this year.</p>\n\n<p>Majority of my capital came from UNI airdrop which I used to buy some high risk high reward projects which were just starting up and had pretty low mcap.</p>\n\n<p>Can’t thank Uniswap enough though. Due holding UNI, I got some other airdrops too last year which also helped me build my portfolio significantly.</p>\n\n<p> \nI wouldnt say it’s all luck but I would say yes some of it could be based on luck as a lot of my low cap picks could very well have just gone to zero. But they did do multiple x and here I am.</p>\n\n<p>Yes, I did my thorough research into the projects I was investing in but as we all know that price doesnt always reflect the quality of project (<em>cough cough DOGE..</em>)</p>\n\n<p> \nI&#39;ve never really enjoyed my job and just stayed on to get by my daily expenses. I&#39;ve always wanted to travel the world and work with some NGO.</p>\n\n<p>Although, I can’t celebrate yet but am hopeful to hit my targets before the bull cycle gets over.</p>\n\n<p>I am going to go on a world tour after quitting my job and going to start working on blockchain projects in future. Already have started to learn solidity (my first coding language!).</p>\n\n<p> \nTo everyone who are new here: you can also make it. Just hold strong through the bear market and don’t chase pump &amp; dump projects.</p>\n\n<p>Also you don’t always need a massive capital to achieve your targets.</p>\n\n<p>Thank you!</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/CryptoCurrency/comments/lneg6w/quitting_my_job_this_year/",
  "subreddit": "CryptoCurrency",
  "id": "lneg6w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332875936
}