{
  "author": "Doctor_Woo",
  "original_created_utc": 1650891727,
  "title": "My Dad died this morning and I feel nothing. Am I broken?",
  "created_utc": 1650899329,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Like the title says, my dad passed away this morning.&lt;/p&gt;\n\n&lt;p&gt;It was a long time coming, he was diagnosed with cancer three years ago and to be honest, we were surprised he hung on as long as he did. &lt;/p&gt;\n\n&lt;p&gt;The last few days have been full of close calls, being called to the hospice by the doctors and such and I&amp;#39;ve cried non stop.&lt;/p&gt;\n\n&lt;p&gt;This morning, my cousin called and very calmly said &amp;quot;I&amp;#39;m sorry but your dad passed about ten minutes ago, were all going to to the hospice, I&amp;#39;ll see you there.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been and I&amp;#39;m back home and I haven&amp;#39;t shed a single tear. My brain is telling me that I should be a blubbery mess but I&amp;#39;m just sat here.&lt;/p&gt;\n\n&lt;p&gt;Chillin&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;Did something break when I got the news?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 141,
  "permalink": "/r/NoStupidQuestions/comments/ubkn71/my_dad_died_this_morning_and_i_feel_nothing_am_i/",
  "subreddit": "NoStupidQuestions",
  "id": "ubkn71",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Like the title says, my dad passed away this morning.\n\nIt was a long time coming, he was diagnosed with cancer three years ago and to\nbe honest, we were surprised he hung on as long as he did.\n\nThe last few days have been full of close calls, being called to the hospice by\nthe doctors and such and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルの通り、今朝、父が亡くなりました。\n\n3年前に癌と診断され、長らくお待たせしました。\n正直なところ、私たちは、父がこれほど長く持ちこたえたことに驚いています。\n\nこの数日は、ホスピスに呼ばれるなど、危機一髪でした。\n医者からホスピスに呼ばれたり...",
      "title": "今朝、父が亡くなりましたが、何も感じません。私は壊れているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就像标题所说，我父亲今天早上去世了。\n\n这是一个漫长的过程，他在三年前被诊断出患有癌症。\n说实话，我们很惊讶他能坚持这么久。\n\n在过去的几天里，充满了千钧一发的时刻，被医生叫到临终关怀医院，以及\n被医生叫到临终关怀医院，还有...",
      "title": "我爸爸今天早上去世了，我却没有任何感觉。我崩溃了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就像標題所說，我父親今天早上去世了。\n\n這是一個漫長的過程，他在三年前被診斷出患有癌症。\n說實話，我們很驚訝他能堅持這麼久。\n\n在過去的幾天裏，充滿了千鈞一髮的時刻，被醫生叫到臨終關懷醫院，以及\n被醫生叫到臨終關懷醫院，還有...",
      "title": "我爸爸今天早上去世了，我卻沒有任何感覺。我崩潰了嗎？"
    }
  ]
}