{
  "author": "northerntide",
  "original_created_utc": 1629824749,
  "title": "Shout out to Benjamin Cowen",
  "created_utc": 1629853586,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For those of you that dont know, he is a crypto youtuber. Ben focuses heavily on data, and past bitcoin moves. He breaks it down easily and doesnt get panicked or excited by the market (Still waiting to hear what price he would be getting out of bed for). In his latest video he celebrated 500,000 subscribers all without having Ad Sense. He actually went and showed his dashboard. Thats a straight up good guy greg move. It shows that he is in it more for the teaching then the money, which is nice to see compared to some influencers out there.<br/>\nJust wanted to say thanks for the work he puts in and show him some love!</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/parie6/shout_out_to_benjamin_cowen/",
  "subreddit": "CryptoCurrency",
  "id": "parie6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For those of you that dont know, he is a crypto youtuber. Ben focuses heavily on\ndata, and past bitcoin moves. He breaks it down easily and doesnt get panicked\nor excited by the market (Still waiting to hear what price he would be getting\nout of bed for). In his latest video he celebrated 500,000…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "知らない人のために説明すると、彼は暗号系ユーチューバーです。Benは、データや過去のビットコインの動きに\nデータと過去のビットコインの動きに重点を置いています。彼はそれを簡単に分解し、市場でパニックになったり興奮したりすることはありません。\n市場でパニックになったり、興奮したりすることはありません（彼がベッドから出るときの価格を聞くのをまだ待っています）。\n聞くのを待っています）。) 最新のビデオでは、彼は50万ドルを達成しました。",
      "title": "Shout out to Benjamin Cowen"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于那些不知道的人来说，他是一个加密货币的优酷网主。本在很大程度上专注于\n数据，以及过去的比特币走势。他很容易就把它分解开来，而且不会感到恐慌\n也不为市场所动（还在等着听他说他会以什么价格\n床上的价格）。) 在他最新的视频中，他庆祝了50万个比特币。",
      "title": "向本杰明-考文喊话"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於那些不知道的人來說，他是一個加密貨幣的優酷網主。本在很大程度上專注於\n數據，以及過去的比特幣走勢。他很容易就把它分解開來，而且不會感到恐慌\n也不爲市場所動（還在等着聽他說他會以什麼價格\n牀上的價格）。) 在他最新的視頻中，他慶祝了50萬個比特幣。",
      "title": "向本傑明-考文喊話"
    }
  ]
}