{
  "author": "wandererli",
  "original_created_utc": 1655272715,
  "title": "Opinion: collapse of USDT",
  "created_utc": 1655314236,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The collapse of USDT is one that I believe is impending and, honestly, looking forward to (so my analysis may be biased). Obligatory &amp;quot;I&amp;#39;ve been in the space for a while and seen a few things.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;First and foremost, people are exiting out of Tether. This isn&amp;#39;t a normal retail exit. When someone exchanges USDT for USDC, for example, on an exchange, that&amp;#39;s not a real exit of USDT. The chart below shows that since May 2022, there have been billions of USDT being exited into cash. In May, the market cap of Tether (i.e., the total supply) sat at $83B. Today, it sits at $70B. So there is $13B tether liquidated from the market.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/mfrr64jdup591.png?width=1916&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=bcd64df8e693ca65f126f3980b7f06911b5a2413\"&gt;https://preview.redd.it/mfrr64jdup591.png?width=1916&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=bcd64df8e693ca65f126f3980b7f06911b5a2413&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The problem with this $13B liquidation though, originates at the source of this &lt;a href=\"https://assets.ctfassets.net/vyse88cgwfbl/4EtXPBkmEPDNbIHNajz9vQ/bb4766acfe36f5af0c4e54a2694c8a31/tether-march-31-2021-reserves-breakdown.pdf\"&gt;report published by Tether&lt;/a&gt;, stating that only 2.94% of its reserves are in cash. The pie chart in that document is a bit misleading -- it says 3.87%, but it is 3.87% of the 75.85% category of &amp;quot;Cash &amp;amp; Cash Equivalents &amp;amp; Other Short Term Deposits &amp;amp; Commercial Paper.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;That report was published on March 31, 2021. At that time, the market cap of Tether was ~$62B (see chart below). 2.94% of that is $1.8B. We can also play out a second scenario: assume the cash reserves grew in tandem with the market cap. If that&amp;#39;s the case, then at $83B, $2.4B would be in cash reserve.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/vju5zl19wp591.png?width=1916&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=a8c87c7a90edb13490d92c16b74f56c3aa9dd5e1\"&gt;https://preview.redd.it/vju5zl19wp591.png?width=1916&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=a8c87c7a90edb13490d92c16b74f56c3aa9dd5e1&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Regardless of whether we take the $1.8B or $2.4B as true, those are both peanuts compared to the $13B liquidated from Tether in the past month. In fact, the liquidations would be 5.3x to 7.1x more than what Tether has in supposed cash reserves. To be able to account for this liquidation with actual cash, Tether would need to have 16% of its reserve in cash. I doubt it.&lt;/p&gt;\n\n&lt;p&gt;So in my opinion, I now assume that Tether is dry of its cash reserves. This is where things start to get sticky. We can categorize their holdings into three categories: liquid, short-term, and long-term:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Liquid is basically cash (2.94%). These are things Tether can reach for to cover the cash people are asking for when they exit from Tether immediately. As I just talked about, my assumption is they&amp;#39;re out of this.&lt;/li&gt;\n&lt;li&gt;Short-term is stuff they can potentially liquidate quickly (potentially at a penalty, so the value is not 1:1 necessarily) if they really need to, in order to cover the cash people are still asking for after they run out of liquid. We assume that 72.9% of Tether&amp;#39;s supply (78.85% - 2.94%) can be categorized as this although &amp;quot;short-term&amp;quot; in this case is really subjective. Out of this 72.9%, I assume that USDT has already dipped into ~13% (16% - 2.94%). So approximately 60% is left over.&lt;/li&gt;\n&lt;li&gt;Long-term is everything else: 24.15% (100% - 75.85%). These are things that just can&amp;#39;t really be liquidated easily except at extreme penalty. Also to note, out of the 24.15% we can safely assume the &amp;quot;other investments&amp;quot; category of 1.64% is probably useless and less than 1.64% now because 1) it includes investments in crypto, and 2) the crypto market has crashed. These could be illiquid investments into projects that don&amp;#39;t have tokens on the secondary market yet, or they could be other cryptoassets, which probably will come at a significant premium if liquidated quickly (we don&amp;#39;t know how much of these investments are liquid or illiquid, but either way we can say that it&amp;#39;s fairly useless in this market). If Tether needs to tap into the long-term category, it&amp;#39;s already pretty much game over.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;And the name of the game is bank run. Bank run on an unsustainable model destroyed Luna/Terra, and bank run can destroy Tether as well. For those that don&amp;#39;t know, a bank run happens when people all run to the bank to cash out at the same time. The bank doesn&amp;#39;t have enough cash to give to everyone, which causes more panic and more people demanding to cash out. Ultimately, trust in the currency is lost, and people start cashing out at lower market value, tumbling the value of the currency into oblivion.&lt;/p&gt;\n\n&lt;p&gt;The bank run for Tether would begin as what looks like normal withdrawals, which can be covered by its liquid assets. This would be a 1:1 exchange. Based on my back-of-the-napkin math explained above, I believe the liquid assets are exhausted. Now Tether is tapping into its short-term assets. Some of these may come at a slight cost to liquidate (market volatility, penalties, etc.). This would not be a 1:1 exchange, so Tether needs to liquidate a bit extra to cover everyone who&amp;#39;s asking for a dollar. I don&amp;#39;t believe the short-term assets are all exhausted yet, so Tether can continue to carry this charade for a bit longer. In the event that people start to liquidate more USDT, then Tether will exhaust its short-term assets and have to tap into its long-term assets. If the flag hasn&amp;#39;t been raised up to this point, it&amp;#39;s certainly full mast now. The long-term assets are hard to immediately liquidate without penalties or market impact. Anyway, you see the picture.&lt;/p&gt;\n\n&lt;p&gt;With the cash reserve at Tether exhausted, I believe it marks the beginning of a potential bank run. In the recent 2018 crash, you can see that the confidence in Tether barely faltered (barely noticeable the amount being . In fact, the printing of Tether continues at a much more rapid pace moving forward. The market was still dependent on Tether.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/c7ost7ekzp591.png?width=1892&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=581de5fcaca690244273ec0426a8b702efc41792\"&gt;https://preview.redd.it/c7ost7ekzp591.png?width=1892&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=581de5fcaca690244273ec0426a8b702efc41792&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;But in May 2022, the severe liquidation of Tether began. That&amp;#39;s the steep drop at the end of the blue line. With the crash of UST and the depegging of algorithmic stablecoins, I think the industry trust and sentiment towards stablecoins in general has faltered. And for good reason--taking a look at USDT, we can see that it has not recovered its peg to $1 since May 10 (see image below), which is right around the time that the major liquidations of USDT began.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/z16n8xhz1q591.png?width=1510&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=803bc5e6e4ae62405c313afe3992f08f92bd38b7\"&gt;https://preview.redd.it/z16n8xhz1q591.png?width=1510&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=803bc5e6e4ae62405c313afe3992f08f92bd38b7&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The bear market in crypto, combined with all this news around big players like Luna/Terra, Celsius, and (potentially) 3AC collapsing, combined with all of the macro signals that indicate a recession (inflation, fed interest rate hikes, global war, food shortages, etc) are pushing people to get out of risky assets. As a result, we see the price of crypto dropping. And the circulation of USDT along with it. So people aren&amp;#39;t just exiting cryptos into stablecoins; they&amp;#39;re exiting USDT as well.&lt;/p&gt;\n\n&lt;p&gt;They are exiting USDT and either going into fiat or liquidating into other assets like USDC. You can see the chart for USDC market cap below, which started printing the same day that USDT collapsed, and has been growing in circulation ever since.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/vpe7uhap2q591.png?width=1518&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=c490b647446d1593ebe4d2870a51d94ca958e1bc\"&gt;https://preview.redd.it/vpe7uhap2q591.png?width=1518&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=c490b647446d1593ebe4d2870a51d94ca958e1bc&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I think this is at least some indicator that people aren&amp;#39;t just exiting crypto altogether, but also the trust and, ultimately, dependence, on USDT is waning. Following this current trajectory, I think there are a couple of scenarios that could result:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;USDT remains pegged to $1.&lt;/li&gt;\n&lt;li&gt;USDT depegs from the dollar very quickly due to a bank run from lack of confidence in USDT. This would ultimately result in the collapse of USDT. This depeg would likely put significant stress on the market.&lt;/li&gt;\n&lt;li&gt;USDT doesn&amp;#39;t immediately depeg from the dollar, but dependence on USDT wanes, such that eventually once USDT does depeg, it doesn&amp;#39;t affect the market very significantly.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;And this is where my bias sets in. I don&amp;#39;t wish harm or financial difficulty on anyone, and I mean no ill will to the Tether team. But I do hope that Tether also gets wiped during this crash. I think part of Tether&amp;#39;s demise is already baked into the market, and evidence of this is demonstrated throughout this piece. On a more philosophical tone, Tether&amp;#39;s demise is one that, I believe, is necessary for web3 to continue to grow in a healthy and sustainable manner. This market has been brutal to the unsustainable models, and I hope that Tether is no exception. It is a symbol of a broken system, and a collective delusion of the market that indicate that the market itself isn&amp;#39;t ready to be taken seriously.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 308,
  "permalink": "/r/CryptoCurrency/comments/vcnkzs/opinion_collapse_of_usdt/",
  "subreddit": "CryptoCurrency",
  "id": "vcnkzs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The collapse of USDT is one that I believe is impending and, honestly, looking\nforward to (so my analysis may be biased). Obligatory \"I've been in the space\nfor a while and seen a few things.\"\n\nFirst and foremost, people are exiting out of Tether. This isn't a normal retail\nexit. When someone…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "USDTの崩壊は、私は差し迫っていると考えており、正直なところ、楽しみにしています。\nと思っています（だから、私の分析は偏っているかもしれません）。オブリガード「私はこの空間にいました。\nを見てきました。\"\n\nまず第一に、人々はTetherから退出しています。これは通常のリテール\n退出です。誰かが...",
      "title": "オピニオン：USDTの崩壊"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为USDT的崩溃迫在眉睫，而且，说实话，我很期待。\n所以我的分析可能有偏见）。义务性的 \"我已经在这个领域工作了一段时间，并看到了一些稀薄的东西。\n有一段时间了，看到了一些事情。\"\n\n首先，最重要的是，人们正在退出Tether。这不是一个正常的零售\n退出。当有人...",
      "title": "观点：USDT的崩溃"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲USDT的崩潰迫在眉睫，而且，說實話，我很期待。\n所以我的分析可能有偏見）。義務性的 \"我已經在這個領域工作了一段時間，並看到了一些稀薄的東西。\n有一段時間了，看到了一些事情。\"\n\n首先，最重要的是，人們正在退出Tether。這不是一個正常的零售\n退出。當有人...",
      "title": "觀點：USDT的崩潰"
    }
  ]
}