{
  "author": "aightbet",
  "original_created_utc": 1638337184,
  "title": "L2s cannot and will not solve one major issue: Laziness",
  "created_utc": 1638394026,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Unpopular opinion but L2s cannot and will not solve one issue--the general public&amp;#39;s laziness. &lt;/p&gt;\n\n&lt;p&gt;Whenever anyone posts anything about the ridiculous eth gas fees, there is always one resounding response: uSe LaYeR 2s!!! &lt;/p&gt;\n\n&lt;p&gt;While I personally have no issue with using L2s, the simple fact that people would need to use them is a huge turn off. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s the same sort of annoyance when you have to go to an ATM when you go to a cash only bar. &lt;/p&gt;\n\n&lt;p&gt;People can easily be turned off with the fact that the currency itself needs to be altered to use and don&amp;#39;t even get me started with trying to explain to people how to use L2s. All in all, never underestimate someone&amp;#39;s ability to not learn how to do something if it seems hard or has extra steps. &lt;/p&gt;\n\n&lt;p&gt;As long as L1 has insane fees, it will be a huge impediment to mass adoption of crypto.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 163,
  "permalink": "/r/CryptoCurrency/comments/r67jpb/l2s_cannot_and_will_not_solve_one_major_issue/",
  "subreddit": "CryptoCurrency",
  "id": "r67jpb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Unpopular opinion but L2s cannot and will not solve one issue--the general\npublic's laziness.\n\nWhenever anyone posts anything about the ridiculous eth gas fees, there is\nalways one resounding response: uSe LaYeR 2s!!!\n\nWhile I personally have no issue with using L2s, the simple fact that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "不評ですが、L2はある問題を解決できませんし、解決するつもりもありません--一般的な問題です。\n国民の怠慢。\n\nエスのガソリン代がバカバカしいという書き込みがあると、必ずと言っていいほど\nLaYeR 2sを使え!!!!\n\n個人的にはL2sを使うことに問題はないのですが、単純な事実として...",
      "title": "L2は、ある大きな問題を解決できないし、解決しない。怠惰"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不受欢迎的意见，但L2不能也不会解决一个问题--公众的懒惰。\n大众的懒惰。\n\n每当有人发表关于荒唐的天然气费用的帖子时，总是有一个响亮的回应：\"你是个好人。\n总是有一个响亮的回答：使用L2！！！。\n\n虽然我个人对使用L2没有异议，但一个简单的事实是，...",
      "title": "L2不能也不会解决一个主要问题。懒惰"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不受歡迎的意見，但L2不能也不會解決一個問題--公衆的懶惰。\n大衆的懶惰。\n\n每當有人發表關於荒唐的天然氣費用的帖子時，總是有一個響亮的回應：\"你是個好人。\n總是有一個響亮的回答：使用L2！！！。\n\n雖然我個人對使用L2沒有異議，但一個簡單的事實是，...",
      "title": "L2不能也不會解決一個主要問題。懶惰"
    }
  ]
}