{
  "author": "Sugarskull_IX",
  "original_created_utc": 1653711269,
  "title": "What can I buy my wife for $16?",
  "created_utc": 1653731232,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It’s our anniversary tomorrow. My wife got sick after our honeymoon and it’s been tough. I don’t want to give you all my sob story since there’s probably worse situations people find themselves in. I just want to provide some context I’m not a cheap bastard, it’s just been a struggle since she has been out of work all this time. With that said, please help me Reddit. I am going to stay up late and write her a letter. I just want something to go along with it. Idk.&lt;/p&gt;\n\n&lt;p&gt;Edit: dang you are all clutch! Appreciate the love. You are all genuinely dynamite.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 128,
  "permalink": "/r/TooAfraidToAsk/comments/uzfhze/what_can_i_buy_my_wife_for_16/",
  "subreddit": "TooAfraidToAsk",
  "id": "uzfhze",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It’s our anniversary tomorrow. My wife got sick after our honeymoon and it’s\nbeen tough. I don’t want to give you all my sob story since there’s probably\nworse situations people find themselves in. I just want to provide some context\nI’m not a cheap bastard, it’s just been a struggle since she has…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "明日は結婚記念日です。新婚旅行後に妻が病気になり、大変でした。\n大変でした。お涙頂戴の話はしたくないんだ。\nもっとひどい状況もあるだろうから。ただ、いくつかの背景を説明したい。\n私は安物ではないんだ ただ妻が病気になってから...",
      "title": "16ドルで妻に何を買えばいい？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "明天是我们的周年纪念日。我的妻子在我们的蜜月之后生病了，这很难受。\n一直很艰难。我不想给你们讲我的悲惨故事，因为可能有更糟糕的情况。\n人们发现自己处于更糟糕的情况。我只是想提供一些背景\n我不是一个小气的混蛋，只是自从她生病后一直在挣扎。",
      "title": "16美元我可以给我的妻子买什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "明天是我們的週年紀念日。我的妻子在我們的蜜月之後生病了，這很難受。\n一直很艱難。我不想給你們講我的悲慘故事，因爲可能有更糟糕的情況。\n人們發現自己處於更糟糕的情況。我只是想提供一些背景\n我不是一個小氣的混蛋，只是自從她生病後一直在掙扎。",
      "title": "16美元我可以給我的妻子買什麼？"
    }
  ]
}