{
  "author": "Invest07723",
  "original_created_utc": 1658076589,
  "title": "Coinbase rumors",
  "created_utc": 1658113128,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There are a lot of CB rumors right now involving liquidity and potential bankruptcy. First, I have seen no credible report that indicates CB is about to go bankrupt. CB going bankrupt would be a huge setback for crypto and I have to imagine that if CB was in such serious trouble that they were about to go bankrupt there would be a significant number of wealthy people or groups that would be highly interested in buying enough shares of CB to take control of the company or to buy them out and take the company private again. Second, writing stories about CB maybe going bankrupt is a good way to get your article clicked online so I imagine bloggers and others are writing about what gets clicked. In the past week or two I&amp;#39;ve heard:&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;CB Pro is shutting down because CB is in trouble. As far as I can tell CB Pro style trading will be available as Advanced Trade on Coinbase. The fee schedule to buy/sell looks about the same, but not sure what it will end up being by the end of the year. Of course Coinbase Pro, had it continued, could have altered trading fees at any time itself. My biggest concern here is what happens to existing orders and what glitches might I experience if I have any trades or cash or crypto on CB Pro at the time it changes over. This change doesn&amp;#39;t indicate any upcoming bankruptcy. It would be nice to have everything on one platform instead of having to sometimes move stuff between CB and CB Pro. If Advanced Trade sucks or starts charging crazy fees, then that will be a huge deal.&lt;/li&gt;\n&lt;li&gt;CB layoffs and rescinding job offers. This happens during poor economic times. People get laid off and job offers are rescinded. It isn&amp;#39;t a good sign for CB, but this is hardly unique to CB. &lt;/li&gt;\n&lt;li&gt;Hundreds of Millions of $s are leaving CB. People are pulling coins and cash off of exchanges for their own wallets. I think people are realizing it is better to pay gas and transfer fees and in some cases forego staking or lending awards in order to ensure the safety of your crypto. Obviously Celsius and Voyager and others are spurring this on. How much of an impact the removal of crypto from CB will have on CB remains to be seen. CB, allegedly, doesn&amp;#39;t make money lending out crypto so they aren&amp;#39;t losing out on interest from lending out coins. They also thus allegedly don&amp;#39;t have coins at risk that are being lent out. &lt;/li&gt;\n&lt;li&gt;CB allegedly temporarily shutting down the US affiliate marketing program. Not sure the reasons for this other than they maybe have decided it isn&amp;#39;t paying off. I&amp;#39;m not really familiar with this program.&lt;/li&gt;\n&lt;li&gt;CB Pro USDC trading pairs recently disappeared. Apparently they are merging USDC with USD.&lt;/li&gt;\n&lt;li&gt;Etc.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Despite the fact that I am unaware of any credible report showing Coinbase is about to go bankrupt, I have moved most of my coins off of ALL CEXs, including CB (Obviously I can&amp;#39;t move my staked ETH). If CB were to ever go bankrupt, nobody knows for sure if they would ever see their crypto again or how much of a warning there would be (would you have enough time to move your coins?). So, do I trust my coins on CB? No. Is it because I think CB is going bankrupt this month or next? No; it is because I don&amp;#39;t trust any CEX and I&amp;#39;d rather keep my own coins in my own wallets. &lt;/p&gt;\n\n&lt;p&gt;TL;DR---OP hasn&amp;#39;t seen any credible report that CB is about to go bankrupt. There are a bunch of bankruptcy rumors that might be based on multiple factors, such as current CB layoffs, CB Pro being phased out, etc.  Still, you might want to get your coins off of ALL CEXs to be safe and into your own wallets. OP has moved most of his coins off of all CEXs, including CB.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 337,
  "permalink": "/r/CryptoCurrency/comments/w1bpt6/coinbase_rumors/",
  "subreddit": "CryptoCurrency",
  "id": "w1bpt6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "There are a lot of CB rumors right now involving liquidity and potential\nbankruptcy. First, I have seen no credible report that indicates CB is about to\ngo bankrupt. CB going bankrupt would be a huge setback for crypto and I have to\nimagine that if CB was in such serious trouble that they were…"
}