{
  "author": "DaROCK12311",
  "the_new_excerpt": "So i’ve been following tesla for about a year now and I believe I have noticed a\npattern good enough for me to share with the community. Please note that this is\njust a drawing with crayons and I could be completely wrong. Refer to\nhttps://m.imgur.com/6JNaHaW for my crude technical analysis.…",
  "original_created_utc": 1612652649,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我一直在关注特斯拉大约一年了，我相信我已经注意到了一个。\n模式好，我可以与社会分享。请注意，这是\n只是用蜡笔画的，我可能完全错了。参考\nhttps://m.imgur.com/6JNaHaW，了解我的粗略技术分析....。",
      "title": "为什么我认为TSLA美元很快就会达到1000美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我一直在關注特斯拉大約一年了，我相信我已經注意到了一個。\n模式好，我可以與社會分享。請注意，這是\n只是用蠟筆畫的，我可能完全錯了。參考\nhttps://m.imgur.com/6JNaHaW，瞭解我的粗略技術分析....。",
      "title": "爲什麼我認爲TSLA美元很快就會達到1000美元。"
    }
  ],
  "title": "Why I think $TSLA will hit $1000 soon.",
  "created_utc": 1612694789,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So i’ve been following tesla for about a year now and I believe I have noticed a pattern good enough for me to share with the community. Please note that this is just a drawing with crayons and I could be completely wrong. \nRefer to <a href=\"https://m.imgur.com/6JNaHaW\">https://m.imgur.com/6JNaHaW</a> for my crude technical analysis. \nBasically any time the tesla stock trades sideways for 1-2 weeks, it proceeds to make a jump soon after. For the past year this has proven constant. It may have small dips and maybe a jump in there too, but it always follows this pattern. Following many investing firm price targets of anywhere from $900-$1000 it is not a question of if, but when it will hit that price. \nFor the past 2 weeks, the stock has been trading sideways and not really gaining much in value. I believe that next week we will see the next big jump in value to at least $900, but hopefully $1000. I’m not here to discuss if that evaluation is actually realistic or if tesla is worthy of being more valuable than many car maker stocks combined, i’m just looking at the pattern it has been following. </p>\n\n<p>Positions: I have liquidated my stock positions for tesla for right now but I have a 3/5 847.5c </p>\n\n<p>This is not financial advice and I am honestly just an amateur.\nFeel free to share your thoughts on this.</p>\n</div><!-- SC_ON -->",
  "score": 47,
  "permalink": "/r/stocks/comments/le996h/why_i_think_tsla_will_hit_1000_soon/",
  "subreddit": "stocks",
  "id": "le996h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123203603
}