{
  "author": "Cicada_lies_heavy",
  "original_created_utc": 1658494034,
  "title": "The Roman Senate existed for more than a century after the fall of Rome. What specifically did they do in these ~150 years?",
  "created_utc": 1658506832,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I realise the Senate had a mostly nominal role after the Republic fell, especially during the years of the Dominate. Even so, I have a hard time imagining &lt;em&gt;what&lt;/em&gt; specifically the Senate did during the reign of Odoacer and his heirs. The empire was in shambles, the infrastructure barely (if at all) sustainabile, the cultural output of the old Roman intelligentsia was negligible compared to the previous centuries - and yet the Senate lasted till the early 7th century.&lt;/p&gt;\n\n&lt;p&gt;How would a senatorial &amp;#39;meeting&amp;#39; take place under these circumstances? What were they discussing? What did old senatorial families &lt;em&gt;think&lt;/em&gt; they were doing while these discussions took place on the ruins of the empire?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 193,
  "permalink": "/r/AskHistorians/comments/w59rex/the_roman_senate_existed_for_more_than_a_century/",
  "subreddit": "AskHistorians",
  "id": "w59rex",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I realise the Senate had a mostly nominal role after the Republic fell,\nespecially during the years of the Dominate. Even so, I have a hard time\nimagining what specifically the Senate did during the reign of Odoacer and his\nheirs. The empire was in shambles, the infrastructure barely (if at…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "共和国崩壊後、元老院はほとんど名目的な役割を担っていたことは承知しています。\n特にドミネートの時代には それでも、私は\n元老院がオドアセルとその後継者の時代に具体的に何をしたのか想像するのは難しい。\n想像がつきません。帝国は荒廃し、インフラはほとんど整備されていなかった（というより...",
      "title": "ローマ元老院は、ローマ崩壊後、1世紀以上存在した。この150年の間に、彼らは具体的に何をしたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我意识到，在共和国灭亡后，参议院的作用主要是名义上的。\n特别是在统治者的年代。即便如此，我也很难\n我很难想象元老院在奥多亚克和他的继承人统治时期具体做了什么。\n继承人的统治期间具体做了什么。帝国一蹶不振，基础设施几乎没有（如果有）。",
      "title": "罗马元老院在罗马灭亡后存在了一个多世纪。在这约150年里，他们具体做了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我意識到，在共和國滅亡後，參議院的作用主要是名義上的。\n特別是在統治者的年代。即便如此，我也很難\n我很難想象元老院在奧多亞克和他的繼承人統治時期具體做了什麼。\n繼承人的統治期間具體做了什麼。帝國一蹶不振，基礎設施幾乎沒有（如果有）。",
      "title": "羅馬元老院在羅馬滅亡後存在了一個多世紀。在這約150年裏，他們具體做了什麼？"
    }
  ]
}