{
  "author": "CyberPunkMetalHead",
  "original_created_utc": 1647171345,
  "title": "Myself and 6 other redditors who all met on this sub are building an algorithmic crypto trading platform",
  "created_utc": 1647186220,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We&amp;#39;ve been working on this project for a good part of last year and we&amp;#39;re finally reaching a stage where we have something to show for it.&lt;/p&gt;\n\n&lt;p&gt;The idea was to build a tool that would allow people to automate their trading strategy using powerful customisation in an easy to understand package. Some of you have given some amazing feedback a while ago and we&amp;#39;re doing our best to implement it into the platform.&lt;/p&gt;\n\n&lt;p&gt;Right now the logic, database and all the other backend bits are pretty much done (still largely untested though).&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re now working on finishing the front end and it looks like we might be ready for closed beta by the end of April!&lt;/p&gt;\n\n&lt;p&gt;The interface might still change up until then but here are some sneak previews:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/k3lt9ffwz4n81.png?width=1181&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=7d8542ad371bd21c9dbaa990d3506bc25d1ddfe6\"&gt;Trades dashboard&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/8z0dcz5wz4n81.png?width=702&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=1c095a6f30ee1b8073e16e75e930d7c69a7fdfe9\"&gt;Detailed bot configs&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;The tool would allow you to create custom signals by combining a multitude of sources (indicators, volatility and even social media analysis in the future).&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re also planning to add copytrading in the future where you can just simply copy a profitable bot and run it yourself.&lt;/p&gt;\n\n&lt;p&gt;Join us at &lt;a href=\"/r/aesirofficial\"&gt;/r/aesirofficial&lt;/a&gt; for more updates and to join the closed beta&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 404,
  "permalink": "/r/CryptoCurrency/comments/td54ab/myself_and_6_other_redditors_who_all_met_on_this/",
  "subreddit": "CryptoCurrency",
  "id": "td54ab",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We've been working on this project for a good part of last year and we're\nfinally reaching a stage where we have something to show for it.\n\nThe idea was to build a tool that would allow people to automate their trading\nstrategy using powerful customisation in an easy to understand package. Some…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨年のかなりの期間、このプロジェクトに取り組んできました。\nようやく形になる段階まで来ました。\n\nそのアイデアは、トレーディングの自動化を可能にするツールを作ることでした。\nを理解しやすいパッケージで、強力にカスタマイズすることができます。いくつかの...",
      "title": "私自身と、このサブセクションで知り合った6人のRedditorが、アルゴリズムによる暗号取引プラットフォームを構築しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们在去年的大部分时间里一直在为这个项目工作，我们终于达到了一个阶段。\n我们终于达到了一个阶段，我们有东西可以展示。\n\n我们的想法是建立一个工具，使人们能够在一个易于理解的软件包中使用强大的自定义功能来自动执行他们的交易策略。\n在一个易于理解的软件包中使用强大的自定义功能。有些人...",
      "title": "我和其他6名红客都是在这个子网站上认识的，他们正在建立一个算法加密货币交易平台。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們在去年的大部分時間裏一直在爲這個項目工作，我們終於達到了一個階段。\n我們終於達到了一個階段，我們有東西可以展示。\n\n我們的想法是建立一個工具，使人們能夠在一個易於理解的軟件包中使用強大的自定義功能來自動執行他們的交易策略。\n在一個易於理解的軟件包中使用強大的自定義功能。有些人...",
      "title": "我和其他6名紅客都是在這個子網站上認識的，他們正在建立一個算法加密貨幣交易平臺。"
    }
  ]
}