{
  "author": "JamieOvechkin",
  "the_new_excerpt": "With the new Census, California is losing a congressional seat for the first\ntime ever.\n\nGiven that the existing congressional seats are all currently filled, how will\nCalifornia decide which sitting congress person is removed from congress?\n\nHow can a process that removes representation from a…",
  "original_created_utc": 1619544014,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "新しい国勢調査で、カリフォルニア州は初めて連邦議会の議席を失います。\n史上初のことです。\n\n既存の議会の議席がすべて埋まっていることを考えると、どのようにして\nカリフォルニア州は、どの現職議員を議会から排除するかをどのように決定しますか？\n\nある国の代表を排除するプロセスは、どのようにして...",
      "title": "カリフォルニア州はどのようにして議会の議席を削除するかを決めるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "随着新的人口普查，加州将首次失去一个国会席位。\n有史以来第一次。\n\n鉴于现有的国会席位目前都已被填补，加州将如何决定哪位现任议员被免职？\n加利福尼亚州将如何决定哪位现任国会议员被从国会除名？\n\n一个将代表权从一个国家中移除的过程如何能...",
      "title": "加州将如何决定哪个国会席位被撤消？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着新的人口普查，加州將首次失去一個國會席位。\n有史以來第一次。\n\n鑑於現有的國會席位目前都已被填補，加州將如何決定哪位現任議員被免職？\n加利福尼亞州將如何決定哪位現任國會議員被從國會除名？\n\n一個將代表權從一個國家中移除的過程如何能...",
      "title": "加州將如何決定哪個國會席位被撤消？"
    }
  ],
  "title": "How will California decide which congressional seat is removed?",
  "created_utc": 1619579003,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>With the new Census, California is losing a congressional seat for the first time ever.</p>\n\n<p>Given that the existing congressional seats are all currently filled, how will California decide which sitting congress person is removed from congress?</p>\n\n<p>How can a process that removes representation from a county or area and replaces it with someone they did not previously vote for be made fair?</p>\n\n<p>&#x200B;</p>\n\n<p>Edit:</p>\n\n<p>&#x200B;</p>\n\n<p>To everyone saying it happens after 2022, that&#39;s good to know, but what I&#39;m asking is <strong><em>what happens after 2022. what is the process?</em></strong></p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/Ask_Politics/comments/mztk98/how_will_california_decide_which_congressional/",
  "subreddit": "Ask_Politics",
  "id": "mztk98",
  "is_self": true,
  "media": null,
  "is_video": false
}