{
  "author": "Dry-Experience-4143",
  "original_created_utc": 1632020465,
  "title": "Over the next few weeks, US politicians will pretend to fight about the debt limit. Here’s what will happen and why it’s bullish for crypto.",
  "created_utc": 1632047514,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Unless Congress votes to increase the amount of money the U.S. Treasury is allowed to borrow above its current debt of $28.5 trillion, the United States will default on its financial obligations sometime in the next several weeks. This could cause a recession or possibly a catastrophic global financial meltdown. </p>\n\n<p>This fight happens every few years. And it’ll go the way it always goes. Members of both political parties will yell and fight and pretend to care.</p>\n\n<p>In the end, the debt limit will be raised. Money will be printed. The US will fall deeper into debt. Whether you agree or disagree with this policy, whether you’re a Dem or a Repub or neither, one thing is clear: the printing of trillions more US dollars is a good reason to buy and hold crypto. </p>\n\n<p>My guess is that there will be a lot of volatility in the markets (both stocks and crypto) over the next few weeks. Then the debt ceiling will be raised as it always is. And then the next leg of the bull run will be upon us.</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/CryptoCurrency/comments/pr020y/over_the_next_few_weeks_us_politicians_will/",
  "subreddit": "CryptoCurrency",
  "id": "pr020y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Unless Congress votes to increase the amount of money the U.S. Treasury is\nallowed to borrow above its current debt of $28.5 trillion, the United States\nwill default on its financial obligations sometime in the next several weeks.\nThis could cause a recession or possibly a catastrophic global…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "米国財務省が借りられる金額を増やすために、議会が投票しない限り\n米国財務省が借りられる金額を現在の28.5兆ドルよりも増やさない限り、米国は数週間後に債務不履行に陥ります。\n数週間のうちに米国は債務不履行に陥るでしょう。\nこれにより、景気後退、あるいは壊滅的な地球規模の危機が引き起こされる可能性があります...",
      "title": "今後数週間、米国の政治家たちは、債務上限について争うふりをするでしょう。何が起こるのか、なぜそれが暗号にとって強気なのかを説明します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "除非国会投票增加美国财政部允许借入的资金数额，使其超过目前的28.5万亿美元。\n除非国会投票增加美国财政部的借款额度，使其超过目前28.5万亿美元的债务，否则美国\n美国将在未来几周的某个时候拖欠其财政义务。\n这可能会导致经济衰退，也可能导致灾难性的全球经济危机。",
      "title": "在接下来的几周里，美国的政客们将假装为债务限额而战。以下是将会发生的事情，以及为什么它对加密货币是看涨的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "除非國會投票增加美國財政部允許借入的資金數額，使其超過目前的28.5萬億美元。\n除非國會投票增加美國財政部的借款額度，使其超過目前28.5萬億美元的債務，否則美國\n美國將在未來幾周的某個時候拖欠其財政義務。\n這可能會導致經濟衰退，也可能導致災難性的全球經濟危機。",
      "title": "在接下來的幾周裏，美國的政客們將假裝爲債務限額而戰。以下是將會發生的事情，以及爲什麼它對加密貨幣是看漲的。"
    }
  ]
}