{
  "author": "dschaez",
  "original_created_utc": 1632413089,
  "title": "HUGE Bitcoin upgrade coming in NOVEMBER",
  "created_utc": 1632421857,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bitcoin is about to get its first upgrade in almost 4 years this November and it seems like almost nobody is talking about it.</p>\n\n<p>Miners have already signaled their support for the Taproot upgrade which will allow for greatly enhanced smart contracts and better privacy and efficiency. Once the upgraded smart contracts are deployed DEFI and NFTs will finally be able to be issued on the BTC chain thus locking up even more BTC and reducing the amount of available coins.</p>\n\n<p>This is absolutely massive news that doesn&#39;t seem to be discussed enough. When Cardano announced smart contracts it was all over headlines for months and months and when Ethereum upgraded it was the biggest headline for weeks on end.</p>\n\n<p>The timing coincides with every analysts bullish prediction of a Q4 BTC rally that they based on their TA. Once the Taproot upgrade actually kicks in I think BTC is about to make huge headlines in the mainstream media and really start taking off in price.</p>\n</div><!-- SC_ON -->",
  "score": 181,
  "permalink": "/r/CryptoCurrency/comments/ptyg3m/huge_bitcoin_upgrade_coming_in_november/",
  "subreddit": "CryptoCurrency",
  "id": "ptyg3m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Bitcoin is about to get its first upgrade in almost 4 years this November and it\nseems like almost nobody is talking about it.\n\nMiners have already signaled their support for the Taproot upgrade which will\nallow for greatly enhanced smart contracts and better privacy and efficiency.\nOnce the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインは今年の11月に約4年ぶりのアップグレードが行われようとしていますが\n話題にする人はほとんどいないようです。\n\nマイナーはすでにTaprootアップグレードへの支持を表明しています。\nスマートコントラクトが大幅に強化され、プライバシーと効率が向上します。\nアップグレードが完了すると...",
      "title": "11月に行われるBitcoinの大規模なアップグレード"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今年11月，比特币即将迎来近4年来的首次升级，但似乎几乎没有人谈论它。\n似乎几乎没有人在谈论这个问题。\n\n矿工们已经表明了他们对Taproot升级的支持。\n矿工们已经表示支持Taproot的升级，这将大大增强智能合约和更好的隐私和效率。\n一旦...",
      "title": "大规模的比特币升级将在11月进行"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今年11月，比特幣即將迎來近4年來的首次升級，但似乎幾乎沒有人談論它。\n似乎幾乎沒有人在談論這個問題。\n\n礦工們已經表明了他們對Taproot升級的支持。\n礦工們已經表示支持Taproot的升級，這將大大增強智能合約和更好的隱私和效率。\n一旦...",
      "title": "大規模的比特幣升級將在11月進行"
    }
  ]
}