{
  "author": "nichtwarum",
  "original_created_utc": 1641854271,
  "title": "Are there any theories regarding why and when humans decided that their genitals shouldn't be publicly exposed? Were there any ancient civilisations that preferred to be completely naked?",
  "created_utc": 1641869574,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was having a discussion with some friends about how different cultures dress differently, yet they all seem to agree that genitals are inappropriate and should always be covered, which is something not observed in nature (animals). I was wondering if there is a rough guess as to when we started covering it down there, and if there were interactions between ancient civilisations that were completely naked.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/AskHistorians/comments/s0wrc8/are_there_any_theories_regarding_why_and_when/",
  "subreddit": "AskHistorians",
  "id": "s0wrc8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I was having a discussion with some friends about how different cultures dress\ndifferently, yet they all seem to agree that genitals are inappropriate and\nshould always be covered, which is something not observed in nature (animals). I\nwas wondering if there is a rough guess as to when we started…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は友人たちと、異なる文化の服装について議論していました。\nしかし、性器は不適切であるという点では一致しているようです。\n自然界（動物）にはない、常に覆われているべきものである。I\nというのは、いつからなのか、大まかな推測はできないかと...。",
      "title": "人間がなぜ、いつから性器を公開してはいけないと思ったのか、その理由はあるのでしょうか？全裸を好んだ古代文明はあったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和一些朋友讨论了不同文化的着装问题。\n的不同，但他们似乎都同意，生殖器是不合适的，应该总是被遮住。\n他们似乎都认为生殖器是不合适的，应该总是被遮住，这在自然界（动物）中是看不到的。I\n我想知道是否有一个粗略的猜测，即我们何时开始......",
      "title": "关于人类为何以及何时决定其生殖器不应公开暴露，是否有任何理论？是否有任何古代文明喜欢完全裸露？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和一些朋友討論了不同文化的着裝問題。\n的不同，但他們似乎都同意，生殖器是不合適的，應該總是被遮住。\n他們似乎都認爲生殖器是不合適的，應該總是被遮住，這在自然界（動物）中是看不到的。I\n我想知道是否有一個粗略的猜測，即我們何時開始......",
      "title": "關於人類爲何以及何時決定其生殖器不應公開暴露，是否有任何理論？是否有任何古代文明喜歡完全裸露？"
    }
  ]
}