{
  "author": "baturu",
  "the_new_excerpt": "TLDR: Goldman Sachs, Morgan Stanley and JP Morgan are Melvin's main Prime\nBrokers. All three firms privately own and sit on the board of the DTCC. If\nnaked shorting occurred in GME, there's good reason to believe the three named\nprime brokers and the DTCC may have shut down 1/28 for nefarious…",
  "original_created_utc": 1613858890,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "TLDR：高盛、摩根士丹利和摩根大通是梅尔文的主要主力。\n经纪人。这三家公司均为戴德梁行私人所有，并在董事会中任职。如果\nGME发生了赤裸裸的做空行为，有充分的理由相信这三个被点名的\nPrimebrokers和DTCC可能已经关闭1/28的邪恶... ...",
      "title": "高盛、Robinhood、Melvin、Gee Em Ee和戴德梁行之间关系的相互影响"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TLDR：高盛、摩根士丹利和摩根大通是梅爾文的主要主力。\n經紀人。這三家公司均爲戴德梁行私人所有，並在董事會中任職。如果\nGME發生了赤裸裸的做空行爲，有充分的理由相信這三個被點名的\nPrimebrokers和DTCC可能已經關閉1/28的邪惡... ...",
      "title": "高盛、Robinhood、Melvin、Gee Em Ee和戴德梁行之間關係的相互影響"
    }
  ],
  "title": "Interplay of Relationships between Goldman Sachs, Robinhood, Melvin, Gee Em Ee and DTCC",
  "created_utc": 1613927380,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>TLDR: Goldman Sachs, Morgan Stanley and JP Morgan are Melvin&#39;s main Prime Brokers. All three firms privately own and sit on the board of the DTCC. If naked shorting occurred in GME, there&#39;s good reason to believe the three named prime brokers and the DTCC may have shut down 1/28 for nefarious reasons beyond the sudden and potentially arbitrary &quot;collateral requirements&quot; stated</strong></p>\n\n<p>If you’ve read my <a href=\"https://www.reddit.com/r/wallstreetbets/comments/lma1ev/illegal_tactics_and_dtccprime_broker_complicity/\">last post</a>, I hypothesize that if naked shorting is present in GME, prime brokers and the DTCC (which is privately owned by the prime brokers) would need to be complicit in it, which adds another dimension to whether the retail shutdown 1/28 to stop the squeeze was done for nefarious reasons.</p>\n\n<p>On the question of whether DTCC was right to shut down trading on 1/28 based on collateral requirements, I&#39;m not an expert on this subject but I&#39;ve seen many compelling arguments against it, including how did they arrive at the 3 billion number for Robinhood and why were they able to get negotiated from 3 billion to 700 million (per following DTCC&#39;s special requirements) and why was cash customers restricted vs just margin? And why was selling allowed but not buying, why not shut off both? Another interest point is that the DTCC has often been implicated and accused of enabling naked short selling over the years and that the DTCC is privately owned by Prime Brokers/Banks.</p>\n\n<p>One question posed to me by a reporter was “who are the prime brokers involved”? So I decided to do some digging and found this disclosure form <a href=\"https://reports.adviserinfo.sec.gov/reports/ADV/173228/PDF/173228.pdf\">https://reports.adviserinfo.sec.gov/reports/ADV/173228/PDF/173228.pdf</a> which shows that Goldman Sachs, Morgan Stanley and JP Morgan are Melvin Capital’s three largest prime brokers (based on assets held under custodianship). As a reminder, if these prime brokers did allow naked shorting and the short squeeze had occurred, pushing prices to thousands per share, the hedge funds would likely not be able to pay that and prime brokers would be left holding the bag to cover (which would also suggest they would be disincentivized to margin call)</p>\n\n<p>All three firms own and sit on the board of DTCC <a href=\"https://www.dtcc.com/about/leadership/board\">https://www.dtcc.com/about/leadership/board</a>. (Note that National Financial Services (Fidelity) is also a prime broker they use but only 6 million in assets under custodianship as compared to a 1.16 billion each for Goldman Sach and Morgan Stanley, and 265 million for JP Morgan at the time of the disclosure snapshot (03/2020).) I found this to be an interesting data point and wanted to share with the board.</p>\n\n<p>Note, the same Goldman Sachs that has been repeatedly implicated in naked shorting cases (Source: <a href=\"https://www.sec.gov/news/pressrelease/2016-9.html\">https://www.sec.gov/news/pressrelease/2016-9.html</a>) and given nothing but slap on the wrists for enforcement. Also the same Goldman that accidentally leaked it’s own emails (while defending a naked shorting lawsuit) that implicated itself and other banks in participating in naked shorting, including quotes like “<strong>We are NOT borrowing negatives... I have made that clear from the beginning. Why would we want to borrow them? We want to fail them...&quot; and “[stock is] trading at negative rebate with non-paying customers” (naked short). In one email Goldman Sachs tells a client</strong> “We will let you fail.” (FTID, trade a stock without locating it) and an email from a Goldman, Sachs hedge fund client, who remarked that when wanting to “short an impossible name and fully expecting not to receive it” he would then be “shocked to learn that [Goldman’s representative] could get it for us.” (Source: <a href=\"https://web.archive.org/web/20201028054857/https://www.rollingstone.com/politics/politics-news/accidentally-released-and-incredibly-embarrassing-documents-show-how-goldman-et-al-engaged-in-naked-short-selling-244035/\">https://web.archive.org/web/20201028054857/https://www.rollingstone.com/politics/politics-news/accidentally-released-and-incredibly-embarrassing-documents-show-how-goldman-et-al-engaged-in-naked-short-selling-244035/</a>)</p>\n\n<p>Another interesting datapoint is that Goldman was chosen as the firm to take Robinhood public <a href=\"https://www.reuters.com/article/us-robinhood-ipo-exclusive/exclusive-trading-app-robinhood-hires-goldman-sachs-to-lead-ipo-sources-idUSKBN28I328\">https://www.reuters.com/article/us-robinhood-ipo-exclusive/exclusive-trading-app-robinhood-hires-goldman-sachs-to-lead-ipo-sources-idUSKBN28I328</a>, so alongside with the Robinhood Citadel relationship (As it relates to selling order flow and RH making making 40%+ of their total revenue from it) there’s also a relationship between Robinhood and Goldman Sachs, who they would do well to have on their good side ahead of the IPO.</p>\n\n<p>The thesis of whether there were more nefarious reasons to the 1/28 shut down (which short squeeze was set to occur, and when Interactive Brokers CEO projected price would’ve been in the thousands <a href=\"https://www.reddit.com/r/wallstreetbets/comments/lmagzp/today_interactive_brokers_ceo_admits_that_without/\">https://www.reddit.com/r/wallstreetbets/comments/lmagzp/today_interactive_brokers_ceo_admits_that_without/</a>) is tied to whether or not naked shorting occurred in GME, because if it did then the Prime Brokers involved and DTCC would likely have been complicit, they would likely be holding the bag if a short squeeze did occur as well as blow back for allowing naked shorting.</p>\n\n<p>As long documented by counterfeitingstock.com, “the short hedge funds, <strong>the prime brokers and the Depository Trust Clearing Corp. (DTCC)</strong>—make unconscionable profits while the fleecing of the small American investor continues unabated… The counterfeiting of shares is <strong>done by participating prime brokers or the DTC, which is owned by the prime brokers</strong>. A number of lawsuits that involve naked shorting have named about ten of the prime brokers as defendants, including <strong>Goldman Sachs, Bear Stearns, Citigroup, Merrill Lynch; UBS; Morgan Stanley and others. The DTCC has also been named in a number of lawsuits that allege stock counterfeiting</strong>… Abusive shorting are not random acts of a renegade hedge funds, but rather a coordinated business plan that is <strong>carried out by a collusive consortium of hedge funds and prime brokers, with help from their friends at the DTC</strong> and major clearinghouses. Potential target companies are identified, analyzed and prioritized. The attack is planned to its most minute detail. The plan consists of taking a large short position, then crushing the stock price, and, if possible, putting the company into bankruptcy. (Source: <a href=\"http://counterfeitingstock.com/CS2.0/CounterfeitingStock.html\">http://counterfeitingstock.com/CS2.0/CounterfeitingStock.html</a>)</p>\n\n<p>A former economist who worked in operations at the DTCC, Susanne Trimbath, even came out in this insightful <a href=\"https://www.thekomisarscoop.com/2020/03/how-phantom-shares-on-wall-street-threaten-u-s-companies-and-investors/\">article</a> and blew the whistle on naked shorting being allowed to happen within the DTCC, I highly recommend you read the full article. Just to highlight one part of it, Timbath says “The Securities and Exchange Act of 1933 specifically gave the clearing house the right to require that shares and securities be delivered for settlement. It allows them to punish those who don‘t deliver by refusing to have them in the system… <strong>The DTCC has for years ignored that”</strong> (Source: <a href=\"https://www.thekomisarscoop.com/2020/03/how-phantom-shares-on-wall-street-threaten-u-s-companies-and-investors/\">https://www.thekomisarscoop.com/2020/03/how-phantom-shares-on-wall-street-threaten-u-s-companies-and-investors/</a>). In laying out the case of whether naked shorting exists in GameStop, the nature of naked shorting means it&#39;s not easy to prove and there have been hundreds of lawsuits for naked shorting that are often settled out of court because of that, but if you’re an investor in the trade you’ve probably noticed that in the past three weeks GME has had a lot of strange things happen to the stock, including seeing a precipitous drop in price starting 2/1 and onwards while short interest supposedly dropped. These things all make sense if you consider naked shorting occurred. In the case of GameStop there are several very strong signs/indicators that naked shorting has occurred.</p>\n\n<p><strong>I will list some of the indicators that Naked Shorting occurred in GameStop below:</strong></p>\n\n<ol>\n<li><p>One indicator is GME&#39;s extremely high number of Fail to Delivers (<a href=\"http://www.wherearetheshares.com/\">www.wherearetheshares.com</a>), which are one of the top in the stock market over a sustained period of time. The website <a href=\"http://www.wherearetheshares.com/\">www.wherearetheshares.com</a> shows extraordinarily high FTIDs extending from 2020 to years back. Michael Burry tweeted that in May 2020 when he lent out his GME, it took weeks for his brokers to locate the shares <a href=\"https://web.archive.org/web/20210130030954/https://twitter.com/michaeljburry?lang=en\">https://web.archive.org/web/20210130030954/https://twitter.com/michaeljburry?lang=en</a>. FTIDs can happen for a number of reasons, but to have this high number of FTIDs over a sustained period of time is highly unusual, and a stock with a high number of FTIDs is one potential indicator that counterfeit shares are in circulation and naked shorting occured.  </p></li>\n<li><p>Short Interest in GME has been extremely high at numbers significantly over 100% of float. As of January 15th short interest was 226% (<a href=\"https://imgur.com/fN4fVQl\">https://imgur.com/fN4fVQl</a>) of the entire float. While it is theoretically possible for short interest to be over 100% with brokers repeatedly leading to each other, short interest this high at 226% of the total float is highly unusual and an indicator of naked shorting occured, which is a far more feasible scenario because naked shorting enables short interest to rise quickly as you do not need to determine the shares exist before you short.  </p></li>\n<li><p>Institutions alone have held a staggering 177% of float as of 1/31 according to Bloomberg Terminal <a href=\"https://i.redd.it/c44cmb67mtf61.png\">https://i.redd.it/c44cmb67mtf61.png</a> which is highly unusual and could be a strong sign that GME is rampant with counterfeit shares. Another interesting datapoint is Fidelity&#39;s calculation of retail ownership is only 0.1% float (<a href=\"https://imgur.com/a/FtSOiCW\">https://imgur.com/a/FtSOiCW</a>) which is highly unusual and unlikely to be true -- another potential indications that counterfeit shares are in play because number of shares to ownership potentially cannot be conclusively determined</p></li>\n</ol>\n\n<p>On Monday 2/1 there was a momentous price drop, and that drop continued through the week. Given the continued high short interest and retail interest to force shorts into a short squeeze, the price drop made little sense, especially because short interest remained high and even if shorts had covered there should&#39;ve been an upward price pressure. What makes the most sense to me is that the price drop was facilitated by flooding the offer side with counterfeit shares in a short down ladder, described below:</p>\n\n<p><em>&quot;Short A will sell a counterfeit share at $10. Short B will purchase that counterfeit share covering a previously open position. Short B will then offer a short (counterfeit) share at $9. Short A will hit that offer, or short B will come down and hit Short A&#39;s $9 bid. Short A buys the share for $9, covering his open $10 short and booking a $1 profit... By repeating this process the shorts can put the stock price in a downward spiral. If there happens to be significant long buying, then the shorts draw from their reserve of “strategic fails-to-deliver” and flood the market with an avalanche of counterfeit shares that overwhelm the buy side demand&quot; (Source:</em> <a href=\"http://counterfeitingstock.com/CounterfeitingStock.html\"><em>http://counterfeitingstock.com/CounterfeitingStock.html</em></a><em>)</em></p>\n\n<p>In an ordinary scenario with short interest dropping and shorts needing to buy back to cover the price is anticipated to go up. As of 2/1 with GME&#39;s reported short interest declining with price also dropping, there are signs pointing to shorts artificially covering or lowering their short interest via the generation of synthetic longs using options to cover, which is in regulation of Reg-SHO -- and again, this assertion is supported by the high numbers of FTIDs GME has consistently reported.</p>\n</div><!-- SC_ON -->",
  "score": 1086,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/L3atnlgwDRL_Yz1j63aT5AVHbCX0EbJX-Mg03umJ1DE.jpg?auto=webp&s=3139271e52007aeb7764a8086424f3cc0b2fa7e3",
          "width": 600,
          "height": 315
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/L3atnlgwDRL_Yz1j63aT5AVHbCX0EbJX-Mg03umJ1DE.jpg?width=108&crop=smart&auto=webp&s=f6d174d2ce2f178962391d2b81e2ba944c7ffdad",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/L3atnlgwDRL_Yz1j63aT5AVHbCX0EbJX-Mg03umJ1DE.jpg?width=216&crop=smart&auto=webp&s=53abc53e498068e10e89c9158972a493cf06834e",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/L3atnlgwDRL_Yz1j63aT5AVHbCX0EbJX-Mg03umJ1DE.jpg?width=320&crop=smart&auto=webp&s=c61d79060e920ad8154ed7221090f06f0aa1dd0e",
            "width": 320,
            "height": 168
          }
        ],
        "variants": {},
        "id": "QsOfS2fwOuGkLPEc_IDsy7w1UFzHIlhOKonjFOnyrFo"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/wallstreetbets/comments/lohyug/interplay_of_relationships_between_goldman_sachs/",
  "subreddit": "wallstreetbets",
  "id": "lohyug",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332892242
}