{
  "author": "DareDevlin",
  "the_new_excerpt": "Bolstered by the impact of fiscal and Covid-19 stimulus packages, the US Federal\nReserve is expected to forecast an improving economic outlook with the labour\nmarket and inflation to rebound faster than anticipated in December.\n\nHowever, traders will likely be disappointed if they are expecting…",
  "original_created_utc": 1615982617,
  "localize": [
    {
      "locale": "zh",
      "title": "美联储将重申鸽派立场，鲍威尔可能会敦促人们保持耐心。",
      "the_new_excerpt": "受财政和Covid-19刺激计划的影响，美国联邦。\n储备金预计经济前景将有所好转，劳工\n市场和通胀在12月的反弹速度将超过预期。\n\n然而，如果交易员们预期......，他们很可能会感到失望。"
    },
    {
      "locale": "zh-Hant",
      "title": "美聯儲將重申鴿派立場，鮑威爾可能會敦促人們保持耐心。",
      "the_new_excerpt": "受財政和Covid-19刺激計劃的影響，美國聯邦。\n儲備金預計經濟前景將有所好轉，勞工\n市場和通脹在12月的反彈速度將超過預期。\n\n然而，如果交易員們預期......，他們很可能會感到失望。"
    }
  ],
  "title": "Fed Set To Reaffirm Dovish Stance With Powell Likely To Urge Patience",
  "created_utc": 1615992720,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bolstered by the impact of fiscal and Covid-19 stimulus packages, the US Federal Reserve is expected to forecast an improving economic outlook with the labour market and inflation to rebound faster than anticipated in December.</p>\n\n<p>However, traders will likely be disappointed if they are expecting sunnier projections to translate to changes in monetary policy when the US central bank&#39;s Federal Open Market Committee (FOMC) ends its two-day meeting on Wednesday.</p>\n\n<p>Reaffirming its extremely dovish stance, the FOMC will hold its funds target range steady at 0%-0.25%, analysts forecast, while the QE monthly purchasing target should remain at “at least” USD 80bln in treasuries and USD 40bn in agency mortgage-backed securities.</p>\n\n<p>Fed Chairman Jerome Powell is set to stress a change in plans for interest rates and bond purchases is premature while he wrestles with questions on tapering given the choppiness in bond yields.</p>\n\n<p>While analysts expect the central bank keep rates at current levels through 2023, the recent wave of volatility in money markets has stoked speculation of a break from its holding pattern. The Fed may be forced into a technical adjustment, but virtually no one expects action at this week’s meeting.</p>\n\n<p>Full Link:<a href=\"https://www.livesquawk.com/report/special_fed-set-to-reaffirm-dovish-stance-with-powell-likely-to-urge-patience\">https://www.livesquawk.com/report/special_fed-set-to-reaffirm-dovish-stance-with-powell-likely-to-urge-patience</a></p>\n</div><!-- SC_ON -->",
  "score": 403,
  "permalink": "/r/investing/comments/m6yvdo/fed_set_to_reaffirm_dovish_stance_with_powell/",
  "subreddit": "investing",
  "id": "m6yvdo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147381370
}