{
  "author": "DetroitMotorShow",
  "original_created_utc": 1629549319,
  "title": "Ethereum under governance attack: A selfish group of miners have created EGL token that seeks to artificially control the gas limit, against network’s design. Over 20% of the hashpower has signed up for this already",
  "created_utc": 1629556240,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A token claiming to assist in ethereum governance has been created (EGL token - Ethereum Gas Limit) and around 20% of the hash power of ETH has already signed up for this and are collecting these tokens, which threatens to disrupt the governance process of Ethereum and manipulate gas limit in favour of miners. </p>\n\n<p>In regular process, the gas limit used on the network is voted on by miners in coordination w/ core devs. The miners can vote on the protocol’s gas limit. In regular course, the miners are incentivised to act in the best interests of the protocol and retain this governance. However, with proof of stake merge cutting miners out, they are now acting in selfish interest. </p>\n\n<p>However, EGL now seeks to bribe miners to tokenize &amp; sell this control to the market instead, ignoring due process. Such a proposal will never pass EIP process, but now due to greedy miners this attempt at power grab is being played out. </p>\n\n<p>Miners are taking this step because of the upcoming proof of stake merge, that threatens to cut miners out of the picture. Hence, they are attempting to divest their control on the network in this fashion, by selling their governance out in collaboration with some rogue VC funds, and trying to seek rent on the governance process. </p>\n\n<p>The Ethereum team must make it clear that they don’t endorse this EGL project. People buying this in the market are just helping rouge miners cash out  and providing liquidity to bad actors.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/p8qoi4/ethereum_under_governance_attack_a_selfish_group/",
  "subreddit": "CryptoCurrency",
  "id": "p8qoi4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A token claiming to assist in ethereum governance has been created (EGL token -\nEthereum Gas Limit) and around 20% of the hash power of ETH has already signed\nup for this and are collecting these tokens, which threatens to disrupt the\ngovernance process of Ethereum and manipulate gas limit in favour…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イーサリアムのガバナンスを支援することを謳ったトークンが誕生（EGLトークン-。\nEthereum Gas Limit）が作られ、ETHのハッシュパワーの約20％がすでにこのトークンにサインアップし、このトークンを集めています。\nETHのハッシュパワーの約20％がすでにこのトークンにサインアップしており、このトークンを集めています。\nこれは、イーサリアムのガバナンスプロセスを破壊し、ガスリミットを有利に操作する恐れがあります...",
      "title": "ガバナンス攻撃を受けるイーサリアム 利己的なマイナーグループが、ネットワークの設計に反してガスの上限を人為的にコントロールしようとするEGLトークンを作成しました。すでにハッシュパワーの20％以上がこれにサインアップしている"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一种声称协助以太坊治理的代币已经创建（EGL代币 -\n以太坊气体限制），大约20%的ETH哈希值已经签署了这一协议。\n签名，并正在收集这些代币，这有可能扰乱以太坊的治理过程，并操纵\n这有可能扰乱以太坊的治理过程，并操纵气体限制以利于......",
      "title": "以太坊受到治理攻击。一群自私的矿工创建了EGL代币，试图违反网络设计，人为地控制气体极限。超过20%的hashpower已经报名参加了这个活动"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一種聲稱協助以太坊治理的代幣已經創建（EGL代幣 -\n以太坊氣體限制），大約20%的ETH哈希值已經簽署了這一協議。\n簽名，並正在收集這些代幣，這有可能擾亂以太坊的治理過程，並操縱\n這有可能擾亂以太坊的治理過程，並操縱氣體限制以利於......",
      "title": "以太坊受到治理攻擊。一羣自私的礦工創建了EGL代幣，試圖違反網絡設計，人爲地控制氣體極限。超過20%的hashpower已經報名參加了這個活動"
    }
  ]
}