{
  "author": "Stranger_2000",
  "original_created_utc": 1652375440,
  "title": "Is bar soap a breeding ground for bacteria?",
  "created_utc": 1652390750,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m tired and I need answers about this.&lt;/p&gt;\n\n&lt;p&gt;So I’ve googled it and I haven’t gotten a trusted, satisfactory answer. Is bar soap just a breeding ground for bacteria?&lt;/p&gt;\n\n&lt;p&gt;My tattoo artist recommended I use a bar soap for my tattoo aftercare and I’ve been using it with no problem but every second person tells me how it’s terrible because it’s a breeding ground for bacteria. I usually suds up the soap and rinse it before use. I also don’t use the bar soap directly on my tattoo.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/askscience/comments/uo5y00/is_bar_soap_a_breeding_ground_for_bacteria/",
  "subreddit": "askscience",
  "id": "uo5y00",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m tired and I need answers about this.\n\nSo I’ve googled it and I haven’t gotten a trusted, satisfactory answer. Is bar\nsoap just a breeding ground for bacteria?\n\nMy tattoo artist recommended I use a bar soap for my tattoo aftercare and I’ve\nbeen using it with no problem but every second person…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "疲れているので、これについての回答が必要です。\n\nそれでググってみたけど、信頼できる納得のいく答えが得られないんだ。固形石鹸は\n石鹸はバクテリアの温床になるのでしょうか？\n\nタトゥーアーティストから、タトゥーのアフターケアに固形石鹸を使うように勧められ、今まで問題なく使ってきました。\nしかし、2人目からは...",
      "title": "固形石鹸は雑菌の温床になる？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很累，我需要这方面的答案。\n\n所以我在网上搜索了一下，我没有得到一个可信赖的、令人满意的答案。条形肥皂是\n肥皂是细菌的滋生地吗？\n\n我的纹身师建议我使用条形肥皂进行纹身后护理，我一直在使用，没有问题。\n我一直在使用它，没有任何问题，但每隔一段时间就会有人...",
      "title": "条形肥皂是细菌的滋生地吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很累，我需要這方面的答案。\n\n所以我在網上搜索了一下，我沒有得到一個可信賴的、令人滿意的答案。條形肥皂是\n肥皂是細菌的滋生地嗎？\n\n我的紋身師建議我使用條形肥皂進行紋身後護理，我一直在使用，沒有問題。\n我一直在使用它，沒有任何問題，但每隔一段時間就會有人...",
      "title": "條形肥皂是細菌的滋生地嗎？"
    }
  ]
}