{
  "author": "bdam92",
  "the_new_excerpt": "So I found out my grandparents purchased 8 shares of Disney stock for me in 1992\nand 16 shares in 1998 and then completely forgot about them. They were put in my\nparents name. We found the actual stock certificates after going through some\nold boxes. Apparently in 2016 the state I live in (Virginia)…",
  "original_created_utc": 1619457657,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "祖父母が私のために1992年に8株、1998年に16株のディズニー株を購入していたことがわかりました。\n1998年に16株を購入したのですが、それをすっかり忘れていました。祖父母は私のために1992年に8株、1998年に16株の\n両親の名義になっていました。古い箱を調べていたら、株券の現物を見つけました。\n見つかりました。どうやら2016年に私の住んでいる州（バージニア州）では...",
      "title": "祖父母がディズニーの株を残してくれたが、私には教えてくれなかった。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我发现我的祖父母在1992年为我购买了8股迪士尼股票\n和1998年的16股，然后就完全忘记了它们。它们被放在了我\n父母的名字。我们在翻阅了一些旧箱子后发现了实际的股票\n旧箱子。显然，在2016年，我居住的州（弗吉尼亚州）...",
      "title": "祖父母留给我迪斯尼股票，但从未告诉我"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我發現我的祖父母在1992年爲我購買了8股迪士尼股票\n和1998年的16股，然後就完全忘記了它們。它們被放在了我\n父母的名字。我們在翻閱了一些舊箱子後發現了實際的股票\n舊箱子。顯然，在2016年，我居住的州（弗吉尼亞州）...",
      "title": "祖父母留給我迪斯尼股票，但從未告訴我"
    }
  ],
  "title": "Grandparents left me Disney stock but never told me",
  "created_utc": 1619463021,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I found out my grandparents purchased 8 shares of Disney stock for me in 1992 and 16 shares in 1998 and then completely forgot about them.  They were put in my parents name.  We found the actual stock certificates after going through some old boxes.   Apparently in 2016 the state I live in (Virginia) sold the stock as there are some laws that say(I&#39;m terribly paraphrasing as I don&#39;t understand this at all) if nothing was done with the stock and it was deemed inactive, ownership of the stock is given to the state of the last known residence of the original owner.  We called the state office and they told us to fill out a bunch of paperwork and submit it to the state to see what can be done about recouping some of the funds from the sale.  </p>\n\n<p>Sorry if this is not the right place for this post or if it doesn&#39;t make sense lol I&#39;m just trying to find some answers.  Some friends of mine mentioned that with the Disney stock splits back in the 90s those 24 shares could have turned into a decent amount of cash.  I appreciate any insight you all could provide!</p>\n</div><!-- SC_ON -->",
  "score": 2918,
  "permalink": "/r/stocks/comments/mz2ue8/grandparents_left_me_disney_stock_but_never_told/",
  "subreddit": "stocks",
  "id": "mz2ue8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776216002
}