{
  "author": "UnexperiencedIT",
  "original_created_utc": 1633722946,
  "title": "Am I the only one who after being 2 years into crypto still feels like a newbie?",
  "created_utc": 1633772147,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Cryptocurrencies for me are something like a wide expanse, like the ocean. No matter how much I study, read, get informed, talk to people who have been in this longer than me, I still feel like a newcomer.  </p>\n\n<p>Literally every day I learn something new and just when I think I have an excellent knowledge base, someone comes with some information that I have zero knowledge about and I start learning again. And I don&#39;t mind it honestly, I love it but still..</p>\n\n<p>To be completely honest, when a friend or someone asks me about cryptocurrencies and I start explaining stuff to him, they look at me like a professional and at that point I amaze myself with how much I know because they are bombarding me with questions and I keep answering like a google, but the truth is that even today I am still learning.  </p>\n\n<p>It’s impossible that I’m the only one who feels this way right?  With all the projects coming out every day, this is a thing to learn and keep being informed for the rest of your life, right?</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/q45gkz/am_i_the_only_one_who_after_being_2_years_into/",
  "subreddit": "CryptoCurrency",
  "id": "q45gkz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Cryptocurrencies for me are something like a wide expanse, like the ocean. No\nmatter how much I study, read, get informed, talk to people who have been in\nthis longer than me, I still feel like a newcomer.\n\nLiterally every day I learn something new and just when I think I have an\nexcellent knowledge…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私にとっての暗号通貨は、海のような広い広がりのようなものです。どんなに\nどんなに勉強しても、本を読んでも、情報を得ても、自分より長くこの世界にいる人と話しても\nどんなに勉強しても、読んでも、情報を得ても、自分よりも経験の長い人と話しても、私はまだ新参者のように感じます。\n\n文字通り、毎日何か新しいことを学び、自分が優れた知識を持っていると思った時には\n優れた知識を持っていると思った時には",
      "title": "暗号を始めて2年経ってもまだ初心者のように感じるのは私だけでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "加密货币对我来说是一种像广阔无垠的东西，就像海洋一样。无论\n无论我如何学习、阅读、了解情况，与那些比我更久的人交谈，我仍然觉得自己是个新人。\n谈论，我仍然觉得自己是个新人。\n\n从字面上看，我每天都在学习新的东西，而就在我认为我有一个很好的知识时\n优秀的知识时...",
      "title": "难道只有我一个人在进入加密货币2年后仍然觉得自己是个新手？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "加密貨幣對我來說是一種像廣闊無垠的東西，就像海洋一樣。無論\n無論我如何學習、閱讀、瞭解情況，與那些比我更久的人交談，我仍然覺得自己是個新人。\n談論，我仍然覺得自己是個新人。\n\n從字面上看，我每天都在學習新的東西，而就在我認爲我有一個很好的知識時\n優秀的知識時...",
      "title": "難道只有我一個人在進入加密貨幣2年後仍然覺得自己是個新手？"
    }
  ]
}