{
  "author": "Routine_Elk_7421",
  "original_created_utc": 1629678614,
  "title": "Evidence That Bitcoin will hit $100,000 and ETH will hit $10,000 by the end of the year",
  "created_utc": 1629707435,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let me guess you clicked the post, because you wanted some of that sweet hopium confirmation bias right?</p>\n\n<p>This is just a friendly reminder that articles with headlines like this are not trying to provide you accurate information, they are trying to generate clicks because it gets them ad revenue.</p>\n\n<p>Just go to any major financial publication and one day you&#39;ll see articles saying they are going to crash and then two days later you see articles they are going to the moon. These big sites have fancy algorithms designed to entice you to view their articles because it gets them money.</p>\n\n<p>Here&#39;s your hopium: We&#39;ll probably see those numbers in a year.</p>\n</div><!-- SC_ON -->",
  "score": 178,
  "permalink": "/r/CryptoCurrency/comments/p9ok1g/evidence_that_bitcoin_will_hit_100000_and_eth/",
  "subreddit": "CryptoCurrency",
  "id": "p9ok1g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Let me guess you clicked the post, because you wanted some of that sweet hopium\nconfirmation bias right?\n\nThis is just a friendly reminder that articles with headlines like this are not\ntrying to provide you accurate information, they are trying to generate clicks\nbecause it gets them ad…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "推測するに、あなたがこの記事をクリックしたのは、その甘いホピウムが欲しかったからではないでしょうか？\n確証バイアスが欲しかったからではないでしょうか？\n\nこのような見出しの記事は、正確な情報を提供しようとしているわけではありません。\n正確な情報を提供しようとしているのではなく、広告を出すためにクリック数を稼ごうとしているのです。\n広告を出すためにクリックを生み出そうとしているのです。",
      "title": "年内にビットコインが10万ドル、ETHが1万ドルになるという根拠"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我猜猜看，你点击这个帖子，是因为你想要一些甜蜜的希望。\n确认偏见，对吗？\n\n这只是一个友好的提醒，像这样的标题的文章并不是\n试图为你提供准确的信息，他们只是试图产生点击率\n因为这能让他们获得广告...",
      "title": "比特币将在年底前达到10万美元，ETH将达到1万美元的证据"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我猜猜看，你點擊這個帖子，是因爲你想要一些甜蜜的希望。\n確認偏見，對嗎？\n\n這只是一個友好的提醒，像這樣的標題的文章並不是\n試圖爲你提供準確的信息，他們只是試圖產生點擊率\n因爲這能讓他們獲得廣告...",
      "title": "比特幣將在年底前達到10萬美元，ETH將達到1萬美元的證據"
    }
  ]
}