{
  "author": "Zalkifl_Savage",
  "original_created_utc": 1626361174,
  "title": "35% of Australians Believes Bitcoin Will Be Transacted More Than Fiat",
  "created_utc": 1626388675,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Comparison platform Finder conducted a crypocurrency survey with 1,012 Australians and the released result showed 35% believe that Bitcoin will eventually be transacted more widely than traditional money, fiat. About 17% of Aussies already owns cryptocurrency and a reasonable number acknowledges trading in mobile app. Major percentage of that survey shows much faith in bitcoin playing a significant role in the future of currency.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/Bitcoin/comments/okuk9p/35_of_australians_believes_bitcoin_will_be/",
  "subreddit": "Bitcoin",
  "id": "okuk9p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Comparison platform Finder conducted a crypocurrency survey with 1,012\nAustralians and the released result showed 35% believe that Bitcoin will\neventually be transacted more widely than traditional money, fiat. About 17% of\nAussies already owns cryptocurrency and a reasonable number acknowledges…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "比較プラットフォーム「Finder」は、1,012人のオーストラリア人を対象に暗号通貨に関する調査を実施しました。\nその結果、35％の人が「ビットコインは最終的にもっと広く取引されるようになる」と考えていることがわかりました。\nは、ビットコインはいずれ、伝統的な貨幣であるフィアットよりも広く取引されるようになると考えています。また、約17％の\nオーストラリア人の約17％がすでに暗号通貨を所有しており、それなりの数の人が暗号通貨を認めています。",
      "title": "オーストラリア人の35%が、ビットコインはフィアットよりも多く取引されると考えている"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比较平台Finder对1,012个加密货币进行了调查。\n调查，公布的结果显示，35%的人认为，比特币将在未来几年内成为澳大利亚的主流货币。\n最终会比传统货币法币更广泛地进行交易。大约17%的\n澳大利亚人已经拥有了加密货币，并且有合理数量的人承认...",
      "title": "35%的澳大利亚人认为比特币的交易量将超过法币的交易量"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比較平臺Finder對1,012個加密貨幣進行了調查。\n調查，公佈的結果顯示，35%的人認爲，比特幣將在未來幾年內成爲澳大利亞的主流貨幣。\n最終會比傳統貨幣法幣更廣泛地進行交易。大約17%的\n澳大利亞人已經擁有了加密貨幣，並且有合理數量的人承認...",
      "title": "35%的澳大利亞人認爲比特幣的交易量將超過法幣的交易量"
    }
  ]
}