{
  "author": "puzzle-game",
  "the_new_excerpt": "Am I dumb for not getting this? How does a company doing \"well\"/\"better\" or\n\"poorly\"/\"worse\" (whatever that means here ) have anything to do with the\nintrinsic value of the stock? Why would that make the value go up or down?\n\nLet me do it by way of analogy, by contrasting it to a system that I…",
  "original_created_utc": 1612152251,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我不明白这个道理是不是很笨？一家公司如何做 \"好\"/\"更好 \"或。\n\"差\"/\"更差\"(不管这里的意思是什么)跟\n股票的内在价值？为什么会使价值上升或下降呢？\n\n让我通过打比方的方式来做，通过对比它与我的一个系统...",
      "title": "长帖--抱歉：我不明白一家公司做得好或做得不好与股票价值涨跌之间的联系。能否请ELI5和中度弱智？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不明白這個道理是不是很笨？一家公司如何做 \"好\"/\"更好 \"或。\n\"差\"/\"更差\"(不管這裏的意思是什麼)跟\n股票的內在價值？爲什麼會使價值上升或下降呢？\n\n讓我通過打比方的方式來做，通過對比它與我的一個系統...",
      "title": "長帖--抱歉：我不明白一家公司做得好或做得不好與股票價值漲跌之間的聯繫。能否請ELI5和中度弱智？"
    }
  ],
  "title": "Long post - sorry: I don't understand the connection between a company doing well or poorly and the value of the stock going up or down. Can you please ELI5 and moderately retarded?",
  "created_utc": 1612173466,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Am I dumb for not getting this? How does a company doing &quot;well&quot;/&quot;better&quot; or &quot;poorly&quot;/&quot;worse&quot; (whatever that means here ) have anything to do with the intrinsic value of the stock? Why would that make the value go up or down?</p>\n\n<p>Let me do it by way of analogy, by contrasting it to a system that I <strong><em>would</em></strong> understand.</p>\n\n<p>So like, let&#39;s say two kids open a lemonade stand on my street.</p>\n\n<ul>\n<li>They barely have anything.</li>\n<li>I can see their crappy little cardboard sign isn&#39;t going to attract customers, the lemons they&#39;re using aren&#39;t the best quality, etc.</li>\n<li>But the kids are adorable and it&#39;s a heavily trafficked area. I think the lemonade stand has potential to do make a lot of money.</li>\n</ul>\n\n<p>Ok, so I tell them, &quot;hey, how about I give you some money to buy a better sign, better lemons, hire another person to work the stand, whatever. And that way you&#39;ll sell more lemonade and make more money. But in exchange, I want a piece of paper that says that I own a small part of this company&quot;</p>\n\n<p>Let&#39;s say I know, and let&#39;s say <em>they</em> know, that without my capital investment they&#39;re doomed to fail.</p>\n\n<p>So this is where I would modify the way I believe stocks actually work, because then I would demand either</p>\n\n<ol>\n<li>a commensurate % of each cup sold, like royalties, or</li>\n<li>a commensurate % of their weekly/monthly profits, or</li>\n<li>I dunno... some volume of free lemonade a month commensurate with what I put in?</li>\n</ol>\n\n<p>The point is, <strong>the intrinsic value of the stock</strong> in this case comes from the money it makes you <strong>independent of anyone else investing or buying your stock from you,</strong> and more importantly, <strong>as a direct result of the company doing well.</strong></p>\n\n<p>With a model like this, everything <em>would</em> fall into place for me and make perfect sense. Of course! Then if the company was doing &quot;well&quot; or &quot;better&quot; (ie. innovating new recipes, selling more lemonade, minimizing ingredient expenses), then it&#39;s making <strong><em>you, the shareholder</em></strong> more money. That&#39;s the value. So if the lemonade stand is doing well, someone else may very well think &quot;hmm, if I buy that guy&#39;s stock in the lemonade stand — sure, it&#39;ll cost me some money, but look how well the company is doing! I&#39;ll make it all back plus more!&quot;, and if I as the holder of the stock feel like the lemonade stand is going to stop doing so well any day now, I may very well want to sell my share off as fast as possible. Boom, we have a market for my stock.</p>\n\n<p>Ok.</p>\n\n<p>But as far as I understand, <strong><em>other than dividend stocks where you passively make money just by holding</em></strong>, that&#39;s not at all how stocks work, correct? The only way a stock will make you money is by selling it? That&#39;s the whole premise of BLSH, right?</p>\n\n<p>So this leads every conversation I have on this matter into this intense mind-bending conundrum for me. If you make NO money directly from the success of the company as the stockholder, what incentive does the next person, to whom the stock would be just as worthless, have to come and buy the stock from you or the the company? The whole thing seems like a ponzi scheme.</p>\n\n<p>Can you run with the lemonade stand analogy and explain?</p>\n</div><!-- SC_ON -->",
  "score": 51,
  "permalink": "/r/investing/comments/l9ub5g/long_post_sorry_i_dont_understand_the_connection/",
  "subreddit": "investing",
  "id": "l9ub5g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518534781
}