{
  "author": "N0theref0rl0ng",
  "original_created_utc": 1631753292,
  "title": "WW2: What was my grandfather doing in Norway?",
  "created_utc": 1631773599,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello! </p>\n\n<p>*Not a historian here*, I&#39;m sure my question isn&#39;t too complex, I&#39;m just seeking context and understanding. Sorry for the vagueness, I really don&#39;t know much about history or my grandfather.</p>\n\n<p>My grandpa served for the U.S. during WW2, something that was sorta known in my family but never really talked about. The story as I know it is literally just &quot;he was repairing phone lines in Norway. His brother was a POW, so they sent him somewhere safe to avoid another family tragedy.&quot; (brother survived, died early 2000s).</p>\n\n<p>However, the other day I learned Norway was occupied by Germany during WW2. So now I&#39;m confused- why would my grandpa be there? I know the Allies were briefly in Norway but it sounds like they withdrew early on.</p>\n\n<p>Would someone who knows more about history care to contextualize? Thanks.</p>\n</div><!-- SC_ON -->",
  "score": 120,
  "permalink": "/r/AskHistorians/comments/pp2wmx/ww2_what_was_my_grandfather_doing_in_norway/",
  "subreddit": "AskHistorians",
  "id": "pp2wmx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello!\n\n*Not a historian here*, I'm sure my question isn't too complex, I'm just seeking\ncontext and understanding. Sorry for the vagueness, I really don't know much\nabout history or my grandfather.\n\nMy grandpa served for the U.S. during WW2, something that was sorta known in my\nfamily but never…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。\n\n*私の質問はそれほど複雑ではないと思いますが、私はただ、文脈と理解を求めています。\n文脈と理解を求めています。漠然としていて申し訳ありませんが、私は歴史や祖父のことをあまり知りません。\n歴史や祖父のことをよく知りません。\n\n私の祖父は第二次世界大戦中にアメリカに従軍していましたが、私の家族の間では何となく知られていましたが\n祖父は第二次世界大戦中にアメリカに従軍しました。",
      "title": "WW2: 祖父はノルウェーで何をしていたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好！*不是历史学家\n\n*我不是历史学家*，我相信我的问题不会太复杂，我只是在寻求\n背景和理解。很抱歉，我对历史和我的祖父了解不多。\n关于历史或我的祖父。\n\n我的祖父在二战期间为美国服役，这在我的家族中是有点名气的。\n但从未...",
      "title": "二战：我的祖父在挪威做什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好！*不是歷史學家\n\n*我不是歷史學家*，我相信我的問題不會太複雜，我只是在尋求\n背景和理解。很抱歉，我對歷史和我的祖父瞭解不多。\n關於歷史或我的祖父。\n\n我的祖父在二戰期間爲美國服役，這在我的家族中是有點名氣的。\n但從未...",
      "title": "二戰：我的祖父在挪威做什麼？"
    }
  ]
}