{
  "author": "sadsupervillain",
  "the_new_excerpt": "This question is the real reason I made this account.\n\nI don't think I've been happy in years. Sure, there's some bright moments, but\nnothing that lasts. It's not that I'm constantly sad either, just unmoved and\ndisinterested... kind of void. For about a decade now I've been perpetually\ntired,…",
  "original_created_utc": 1616071874,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这个问题才是我做这个账号的真正原因。\n\n我觉得我已经很多年没有开心过了。当然，有一些光明的时刻，但...\n没有什么是长久的。我也不是一直在伤心，只是无心和\n无私... 一种空虚。大约十年来，我已经永远的\n累了",
      "title": "抗抑郁药有什么作用？真的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個問題纔是我做這個賬號的真正原因。\n\n我覺得我已經很多年沒有開心過了。當然，有一些光明的時刻，但...\n沒有什麼是長久的。我也不是一直在傷心，只是無心和\n無私... 一種空虛。大約十年來，我已經永遠的\n累了",
      "title": "抗抑鬱藥有什麼作用？真的嗎？"
    }
  ],
  "title": "What do anti-depressants do? Really?",
  "created_utc": 1616087920,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This question is the real reason I made this account.</p>\n\n<p>I don&#39;t think I&#39;ve been happy in years. Sure, there&#39;s some bright moments, but nothing that lasts. It&#39;s not that I&#39;m constantly sad either, just unmoved and disinterested... kind of void. For about a decade now I&#39;ve been perpetually tired, generally on the verge of tears, and hard to motivate for anything.</p>\n\n<p>I obsess over things (though nothing truly productive), like that time I watched, read, rewatched, reread in a different language, listened to the audiobooks, and rewatched Harry Potter; or that time I binged The Office on a loop for months; or New Girl, or Community, or Archer, or Brooklyn 99, or Arrested Development, or BoJack Horseman, or Sherlock, or Mindhunter... you get it. Or that time I impulse-bought a PS4 and played RDR2 for half a year, and then TLOU, and now I&#39;m replaying TLOU2 for the sixth (6th!) time and recording it to edit into a watchable series instead of working for school. Like, what the hell am I doing? Anything to keep myself busy and distracted non-stop.</p>\n\n<p>I&#39;ve seen multiple psychologists, all of which told me anti-depressants were a last resort and that I should try different solutions first. They warned me that it dulls all of your emotions, not just the bad ones (which makes sense I guess, but they make it seem like you never feel anything at all). </p>\n\n<p>So, I&#39;ve tried exercise, structuring my days, &quot;healthier&quot; diets, socialising, sticking to a tight sleep schedule, one even told me to stop cursing so much? Did it help? Did I fuck. And sooner or later, in true sadsupervillain fashion, I gave up on the therapy because it just didn&#39;t help and it&#39;s expensive.</p>\n\n<p>What do anti-depressants do? Is it really that bad? Does it help? Should I ask for them? Even insist? </p>\n\n<p>I&#39;m at the end of my rope here.</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/m7q48t/what_do_antidepressants_do_really/",
  "subreddit": "TooAfraidToAsk",
  "id": "m7q48t",
  "is_self": true,
  "media": null,
  "is_video": false
}