{
  "author": "panoramicsummer",
  "the_new_excerpt": "This is my reasoning below. Would like to hear some counterarguments before I\nbegin to go on a shopping spree; I’m sure many users here know way more about\nthis than me and can provide some great food for thought. Thanks in advance.\n\nBasically, a lot of growth stocks have been pummeled mainly due to…",
  "original_created_utc": 1620921869,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これが私の推論です。私が買い物を始める前に、何か反論があれば教えてください。\nここにいる多くのユーザーは、私よりもはるかにこの件に詳しく、素晴らしい考えを提供してくれると確信しています。\nここにいる多くのユーザーは、私よりもはるかにこの件に詳しく、素晴らしい考えを提供してくれると思います。宜しくお願いします。\n\n基本的に、多くの成長株は主に...のために叩かれています。",
      "title": "今、技術を買いあさってはいけない理由を探しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是我下面的推理。在我开始疯狂购物之前，希望听到一些反驳意见。\n在我开始疯狂购物之前，希望听到一些反驳意见；我相信这里的许多用户在这方面比我了解得多，可以提供一些很好的思路。\n我相信这里的许多用户在这方面比我了解得多，可以提供一些很好的思考。先谢谢了。\n\n基本上，很多成长型股票已经被打压，主要是由于...",
      "title": "寻找为什么我现在不应该*疯狂购买科技产品的理由"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是我下面的推理。在我開始瘋狂購物之前，希望聽到一些反駁意見。\n在我開始瘋狂購物之前，希望聽到一些反駁意見；我相信這裏的許多用戶在這方面比我瞭解得多，可以提供一些很好的思路。\n我相信這裏的許多用戶在這方面比我瞭解得多，可以提供一些很好的思考。先謝謝了。\n\n基本上，很多成長型股票已經被打壓，主要是由於...",
      "title": "尋找爲什麼我現在不應該*瘋狂購買科技產品的理由"
    }
  ],
  "title": "Looking for reasons why I *should not* go hog wild buying tech right now",
  "created_utc": 1620950138,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is my reasoning below. Would like to hear some counterarguments before I begin to go on a shopping spree; I’m sure many users here know way more about this than me and can provide some great food for thought. Thanks in advance. </p>\n\n<p>Basically, a lot of growth stocks have been pummeled mainly due to A) sector rotation into reopening plays and B) fears of inflation. The first has no tangible impact on a company’s fundamentals. The inflation hysteria does makes sense, as a lot of growth stocks tend to reinvest excess cash flow and that makes them more vulnerable to interest rate movements. </p>\n\n<p>But with many of these growth stocks currently being decimated by levels of 50% or more, you have to wonder how much of that is priced in, and should inflation normalize over the coming months, these stocks should see a pretty massive jump in positive sentiment. I’m pretty confident that inflation fears are a nothingburger, making this an excellent entry point for someone like me who has withheld a lot of gunpowder on the sidelines waiting for an opportunity to invest during a tech correction. If inflation does turn out to be a more long-term issue then, again, the stocks are already down 40-50 percent. Don’t see how much more they can reasonably fall. The reward seems to outweight the risk.</p>\n</div><!-- SC_ON -->",
  "score": 66,
  "permalink": "/r/stocks/comments/nbk41n/looking_for_reasons_why_i_should_not_go_hog_wild/",
  "subreddit": "stocks",
  "id": "nbk41n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590803290
}