{
  "author": "redditsgarbageman",
  "the_new_excerpt": "I got into the market around 2017 with like $300. Since then, it’s built up to\nabout $5k. It was actually closer to around $8k just a few weeks ago, but we all\nknow what happened there. I was I hoping to hold for another 10 years, at least,\nbut medical expenses have left me no choice but to use my…",
  "original_created_utc": 1622233960,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2017年頃に300ドルくらいで参入しました。それ以来、積み上げてきたのは\n約5,000ドルになりました。ほんの数週間前までは8,000ドル近くあったのですが、そこで何が起こったかは皆さんご存知の通りです。\nどうなったかはご存知の通りです。私は、少なくともあと10年は保有したいと思っていました。\nしかし、医療費がかさむため、やむを得ず...",
      "title": "私はすべての暗号を売っていますが、これは選択ではなく、少なくとも私に戦うチャンスを与えてくれています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在2017年左右以300美元左右的价格进入了市场。从那时起，它已经积累到了\n大约5千美元。实际上，就在几周前，它还接近8千美元左右，但我们都知道\n我们都知道那里发生了什么。我希望能再持有10年，至少。\n但医疗费用让我别无选择，只能用我的...",
      "title": "我正在出售我所有的加密货币，这不是我的选择，但至少它给了我一个战斗的机会。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在2017年左右以300美元左右的價格進入了市場。從那時起，它已經積累到了\n大約5千美元。實際上，就在幾周前，它還接近8千美元左右，但我們都知道\n我們都知道那裏發生了什麼。我希望能再持有10年，至少。\n但醫療費用讓我別無選擇，只能用我的...",
      "title": "我正在出售我所有的加密貨幣，這不是我的選擇，但至少它給了我一個戰鬥的機會。"
    }
  ],
  "title": "I’m selling all my crypto, not by choice, but at least it’s giving me a fighting chance.",
  "created_utc": 1622242539,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I got into the market around 2017 with like $300. Since then, it’s built up to about $5k. It was actually closer to around $8k just a few weeks ago, but we all know what happened there. I was I hoping to hold for another 10 years, at least, but medical expenses have left me no choice but to use my crypto. About a year ago, I became disabled by lower back problems and unable to work. I have pretty severe degenerative disc disease in my spine and problems with my SI joints. I already had a surgery in December  and have been in physical therapy three times a week for months, which unfortunately did not change much. Now my doctor is recommending I try PRP and stem cell therapy. It’s not guaranteed to work but it might be my only chance. Because the insurance company still sees this as “experimental” I have no choice but to pay out of pocket. Without the crypto, I wouldn’t have the option at all. My savings are completely gone at this point. It sucks to be in this position considering I’m only 38 and just trying to start a new business, have kids, etc, but at least crypto is giving me a chance to get better. I’m extremely thankful for that. I hope the rest of you keep holding for a long time. I would, but I don’t have a choice anymore. I’ll be back in the crypto game as soon as I get the chance. Good luck to the rest of you. Keep holding for me.</p>\n</div><!-- SC_ON -->",
  "score": 8774,
  "permalink": "/r/CryptoCurrency/comments/nn6x1x/im_selling_all_my_crypto_not_by_choice_but_at/",
  "subreddit": "CryptoCurrency",
  "id": "nn6x1x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804296476
}