{
  "author": "Art3sian",
  "original_created_utc": 1643171487,
  "title": "What up with Russia consistently being an asshole country?",
  "created_utc": 1643186965,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don’t get it. To my understanding Russia has more than enough land and resources to be a self-sufficient, world leader. They have a long history of culture, art, industry, inventiveness, hard work, and many other great things, including (I think), beautiful people. Russia is also surrounded by modern, advanced, peaceful nations, none of which have threatened it since Hitler.&lt;/p&gt;\n\n&lt;p&gt;So why has Russia repeatedly been a fucking pain in humanity’s ass throughout most of history? I’m genuinely asking. &lt;/p&gt;\n\n&lt;p&gt;If Russia chose peace and prosperity they could probably have a utopia and lead the world. &lt;/p&gt;\n\n&lt;p&gt;I’m sure it’s more complicated than I know, but what is Russia’s actual fucking problem? Can anyone explain it to me so I understand? Maybe even playing a bit of Devil’s Advocate too?&lt;/p&gt;\n\n&lt;p&gt;EDIT:&lt;/p&gt;\n\n&lt;p&gt;• &lt;em&gt;What about America tho?&lt;/em&gt; &lt;/p&gt;\n\n&lt;p&gt;• &lt;em&gt;The media is controlling you.&lt;/em&gt; &lt;/p&gt;\n\n&lt;p&gt;Does anyone older than 14 have an answer? I’m trying to understand Russia’s grievances over the past 80 years.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/scxc2a/what_up_with_russia_consistently_being_an_asshole/",
  "subreddit": "TooAfraidToAsk",
  "id": "scxc2a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don’t get it. To my understanding Russia has more than enough land and\nresources to be a self-sufficient, world leader. They have a long history of\nculture, art, industry, inventiveness, hard work, and many other great things,\nincluding (I think), beautiful people. Russia is also surrounded by…"
}