{
  "author": "Art3sian",
  "original_created_utc": 1643171487,
  "title": "What up with Russia consistently being an asshole country?",
  "created_utc": 1643186965,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don’t get it. To my understanding Russia has more than enough land and resources to be a self-sufficient, world leader. They have a long history of culture, art, industry, inventiveness, hard work, and many other great things, including (I think), beautiful people. Russia is also surrounded by modern, advanced, peaceful nations, none of which have threatened it since Hitler.&lt;/p&gt;\n\n&lt;p&gt;So why has Russia repeatedly been a fucking pain in humanity’s ass throughout most of history? I’m genuinely asking. &lt;/p&gt;\n\n&lt;p&gt;If Russia chose peace and prosperity they could probably have a utopia and lead the world. &lt;/p&gt;\n\n&lt;p&gt;I’m sure it’s more complicated than I know, but what is Russia’s actual fucking problem? Can anyone explain it to me so I understand? Maybe even playing a bit of Devil’s Advocate too?&lt;/p&gt;\n\n&lt;p&gt;EDIT:&lt;/p&gt;\n\n&lt;p&gt;• &lt;em&gt;What about America tho?&lt;/em&gt; &lt;/p&gt;\n\n&lt;p&gt;• &lt;em&gt;The media is controlling you.&lt;/em&gt; &lt;/p&gt;\n\n&lt;p&gt;Does anyone older than 14 have an answer? I’m trying to understand Russia’s grievances over the past 80 years.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/scxc2a/what_up_with_russia_consistently_being_an_asshole/",
  "subreddit": "TooAfraidToAsk",
  "id": "scxc2a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don’t get it. To my understanding Russia has more than enough land and\nresources to be a self-sufficient, world leader. They have a long history of\nculture, art, industry, inventiveness, hard work, and many other great things,\nincluding (I think), beautiful people. Russia is also surrounded by…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "意味がわからない。私の理解では、ロシアには十分すぎるほどの土地と\n自給自足で世界のリーダーになるための資源。彼らには長い歴史があります。\n文化、芸術、産業、発明、勤勉、その他多くの素晴らしいものがあります。\nその中には、美しい人々も含まれている（と私は思う）。また、ロシアは周囲を...",
      "title": "ロシアが一貫してアホな国なのはどうしたんだ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不明白。据我所知，俄罗斯拥有足够的土地和资源，可以成为一个自给自足的世界大国。\n资源，可以成为一个自给自足的世界领袖。他们有悠久的历史，包括\n文化、艺术、工业、发明、勤劳和其他许多伟大的东西。\n包括（我认为），美丽的人民。俄罗斯的周围也有...",
      "title": "俄罗斯一贯是个混蛋国家，这是怎么回事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不明白。據我所知，俄羅斯擁有足夠的土地和資源，可以成爲一個自給自足的世界大國。\n資源，可以成爲一個自給自足的世界領袖。他們有悠久的歷史，包括\n文化、藝術、工業、發明、勤勞和其他許多偉大的東西。\n包括（我認爲），美麗的人民。俄羅斯的周圍也有...",
      "title": "俄羅斯一貫是個混蛋國家，這是怎麼回事？"
    }
  ]
}