{
  "author": "DanMards",
  "original_created_utc": 1636573308,
  "title": "I recently figured out almost all my friends own crypto, yet we all kept it quiet.",
  "created_utc": 1636580462,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am studying at University in the UK but I am not British. I essentially moved here to study engineering in English as it has some sort of advantage over the rest.</p>\n\n<p>Anyways, I came close to more people from my country and we obviously share a lot of common things. My surprise is when I am randomly checking this subreddit on my phone and one of my friends goes &quot;oh, are you into crypto?&quot;. I immediately got nervous thinking &quot;ah damn, they&#39;re all going to think I am a nerd of this now&quot;; I said yes I own a full Ethereum and laughed - sike, I actually do - and he said &quot;no way! I&#39;ve been into crypto for a long while, my favourite alt is ... (I´m not going to disclose it as I don&#39;t want people to think I am shilling - it wasn&#39;t dog related either).</p>\n\n<p>We started talking about how awkward it feels to talk about crypto with others without a screen involved, and then... magic. Our conversation is overheard by the rest of the group, and turns out we all (5 of us) own crypto in some way.</p>\n\n<p>We promised since that any money own by someone (after going out clubbing, buying dinner collectively, etc.) it shall get paid back in crypto lol</p>\n\n<p>The funny thing is: we have been friends since at least 3 years ago, yet we all failed to know, realise or say that we have found out about crypto and it&#39;s a cool concept.</p>\n\n<p>I personally found it weird, how we all love crypto, the technology, the future it has but yet we deny ourselves to talk about it with even our closest friends. I guess we are all scared of giving advice that can turn out badly if the market bleeds.</p>\n</div><!-- SC_ON -->",
  "score": 213,
  "permalink": "/r/CryptoCurrency/comments/qr2dxl/i_recently_figured_out_almost_all_my_friends_own/",
  "subreddit": "CryptoCurrency",
  "id": "qr2dxl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am studying at University in the UK but I am not British. I essentially moved\nhere to study engineering in English as it has some sort of advantage over the\nrest.\n\nAnyways, I came close to more people from my country and we obviously share a\nlot of common things. My surprise is when I am randomly…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は英国の大学で学んでいますが、英国人ではありません。基本的には\n英語で工学を学ぶためにここに来ました。\n他の国よりも有利だからです。\n\nとにかく、私は自分の国から来た多くの人々と親しくなり、明らかに多くの共通点がありました。\n多くの共通点があります。驚いたのは、私がランダムに...",
      "title": "私は最近、友人のほとんどが暗号を持っていることに気づきましたが、みんな黙っていました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在英国的大学学习，但我不是英国人。我基本上是搬到了\n我搬到这里是为了用英语学习工程，因为它比其他国家有某种优势。\n其余的。\n\n总之，我接近了更多来自我的国家的人，我们显然有很多共同点。\n很多共同的东西。我的惊喜是当我随机...",
      "title": "我最近发现我的朋友几乎都拥有加密货币，然而我们都保持沉默。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在英國的大學學習，但我不是英國人。我基本上是搬到了\n我搬到這裏是爲了用英語學習工程，因爲它比其他國家有某種優勢。\n其餘的。\n\n總之，我接近了更多來自我的國家的人，我們顯然有很多共同點。\n很多共同的東西。我的驚喜是當我隨機...",
      "title": "我最近發現我的朋友幾乎都擁有加密貨幣，然而我們都保持沉默。"
    }
  ]
}