{
  "author": "ForNowAndEver",
  "the_new_excerpt": "I’ve been curious about this for a while. I live in a country in Europe and at\nmy school (and almost every school in my country) we had to bring our own food\nto school. You also had different options: You could buy a sandwich at school,\nyou could go outside and go to the store to buy some food or…",
  "original_created_utc": 1617537165,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我对这个问题好奇了很久。我住在欧洲的一个国家，在\n我的学校（和几乎所有的学校在我的国家），我们必须把我们自己的食物。\n上学。你也有不同的选择。你可以在学校买一个三明治。\n你可以到外面的商店去买些食物或...",
      "title": "美国学童为什么要在学校吃午饭？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對這個問題好奇了很久。我住在歐洲的一個國家，在\n我的學校（和幾乎所有的學校在我的國家），我們必須把我們自己的食物。\n上學。你也有不同的選擇。你可以在學校買一個三明治。\n你可以到外面的商店去買些食物或...",
      "title": "美國學童爲什麼要在學校喫午飯？"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "以前から気になっていました。私はヨーロッパのある国に住んでいますが、私の学校では\n私の学校では（私の国のほとんどの学校では）、自分の食べ物を学校に持ってこなければなりませんでした。\nしなければなりませんでした。また、さまざまなオプションがありました。学校でサンドウィッチを買うこともできる。\n学校でサンドウィッチを買うか、外に出てお店に行って食べ物を買うか、...。",
      "title": "アメリカの小学生はなぜ学校でランチを食べるのか？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "以前から気になっていました。私はヨーロッパのある国に住んでいますが、私の学校では\n私の学校では（私の国のほとんどの学校では）、自分の食べ物を学校に持ってこなければなりませんでした。\nしなければなりませんでした。また、さまざまなオプションがありました。学校でサンドウィッチを買うこともできる。\n学校でサンドウィッチを買うか、外に出てお店に行って食べ物を買うか、...。",
      "title": "アメリカの小学生はなぜ学校でランチを食べるのか？"
    }
  ],
  "title": "Why do American school children get lunch at school?",
  "created_utc": 1617548294,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been curious about this for a while. I live in a country in Europe and at my school (and almost every school in my country) we had to bring our own food to school. You also had different options: You could buy a sandwich at school, you could go outside and go to the store to buy some food or you could go back home to eat and come back when break is over.</p>\n\n<p>Is this just an American thing or do other countries do it too? Why so?</p>\n\n<p>Edit: Thank you all for your answers, I’m glad I now know how it works in different countries :D</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/NoStupidQuestions/comments/mjutam/why_do_american_school_children_get_lunch_at/",
  "subreddit": "NoStupidQuestions",
  "id": "mjutam",
  "is_self": true,
  "media": null,
  "is_video": false
}