{
  "author": "CaptainHunt",
  "the_new_excerpt": "So, I'm a merchant sailor somewhere off Bermuda in the age of sail. I see a mast\ncome up over the horizon bearing a black flag with a white skull and crossed\nbones, do I have reason to panic?\n\nWhere does the classic pirate flag actually come from? Is it an invention of\nHollywood? I know that major…",
  "original_created_utc": 1622097721,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "帆船時代のバミューダ沖で商船員をしています。地平線上にマストが見えてきました。\n地平線上に黒い旗と白い髑髏と交差した骨を掲げたマストが見えます。\nパニックになる理由があるだろうか？\n\n古典的な海賊旗の起源はどこにあるのだろうか？ハリウッドの発明なのか？\nハリウッドの発明？私が知っているのは、メジャーな...",
      "title": "ステレオタイプのドクロと十字架の旗は、実際にはどこで生まれたのでしょうか？海賊かハリウッドか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我是一名商船水手，在航海时代的百慕大附近。我看到一根桅杆\n在地平线上升起，挂着一面黑色的旗帜，上面有一个白色的骷髅头和交叉的\n骨头，我有理由惊慌吗？\n\n经典的海盗旗帜究竟是怎么来的？它是好莱坞的发明吗？\n好莱坞的发明吗？我知道，主要...",
      "title": "刻板的骷髅头和交叉骨旗帜究竟起源于哪里？海盗还是好莱坞？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我是一名商船水手，在航海時代的百慕大附近。我看到一根桅杆\n在地平線上升起，掛着一面黑色的旗幟，上面有一個白色的骷髏頭和交叉的\n骨頭，我有理由驚慌嗎？\n\n經典的海盜旗幟究竟是怎麼來的？它是好萊塢的發明嗎？\n好萊塢的發明嗎？我知道，主要...",
      "title": "刻板的骷髏頭和交叉骨旗幟究竟起源於哪裏？海盜還是好萊塢？"
    }
  ],
  "title": "Where does the stereotypical skull and crossbones flag actually originate? Pirates or Hollywood?",
  "created_utc": 1622114632,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, I&#39;m a merchant sailor somewhere off Bermuda in the age of sail.  I see a mast come up over the horizon bearing a black flag with a white skull and crossed bones, do I have reason to panic?</p>\n\n<p>Where does the classic pirate flag actually come from?  Is it an invention of Hollywood?  I know that major pirates like Blackbeard had personal flags with similar themes, but surely pirates wouldn&#39;t be organized enough to adopt a universal symbol that says &quot;Yarr, I be a pirate!&quot;  It seems like that would just make them a target for every naval ship or armed merchantman they passed on the high seas.  And what about privateers?</p>\n</div><!-- SC_ON -->",
  "score": 143,
  "permalink": "/r/AskHistorians/comments/nm1emh/where_does_the_stereotypical_skull_and_crossbones/",
  "subreddit": "AskHistorians",
  "id": "nm1emh",
  "is_self": true,
  "media": null,
  "is_video": false
}