{
  "author": "quick_Ag",
  "original_created_utc": 1648662404,
  "title": "How did Bold &amp; Italics become the universal text transforming options used in almost all word processors? Do these font variations pre-date computers, and were there other text variations used in the past?",
  "created_utc": 1648697882,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Even reddit&amp;#39;s post text editor has &lt;strong&gt;BOLD&lt;/strong&gt; and &lt;em&gt;italic.&lt;/em&gt; Most other systems seem to also have underline, with strikethrough becoming more and more common. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m just imagining all the other ways we could transform text, but these seem to be the only universal 2. Why is that? When did they (and maybe underline too) become standard?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/tsc1zl/how_did_bold_italics_become_the_universal_text/",
  "subreddit": "AskHistorians",
  "id": "tsc1zl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Even reddit's post text editor has BOLD and italic. Most other systems seem to\nalso have underline, with strikethrough becoming more and more common.\n\nI'm just imagining all the other ways we could transform text, but these seem to\nbe the only universal 2. Why is that? When did they (and maybe…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "redditの投稿テキストエディタにもBOLDとイタリックがあります。他のほとんどのシステムには\nまた、下線や打ち消し線も一般的になってきています。\n\n他にもテキストを変形させる方法をいろいろと想像してみましたが、どうやらこれらは\nが唯一の普遍的な2である。それはなぜでしょうか。いつから（もしかしたら...",
      "title": "なぜ、「ボールド」「イタリック」は、ほぼすべてのワープロソフトで使われている世界共通のテキスト変換オプションになったのでしょうか？これらのフォントのバリエーションはコンピュータ以前のものなのか、また、過去には他のテキストバリエーションが使われていたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "甚至reddit的帖子文本编辑器也有BOLD和斜体。大多数其他系统似乎都有\n也有下划线，删除线也变得越来越普遍。\n\n我只是在想象我们可以用所有其他方式来转换文本，但这些似乎是\n是唯一通用的两种。这是为什么呢？他们是什么时候（也许还有...",
      "title": "粗体和斜体是如何成为几乎所有文字处理程序中使用的通用文本转换选项的？这些字体变化是否早于计算机，过去是否还有其他的文字变化？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "甚至reddit的帖子文本編輯器也有BOLD和斜體。大多數其他系統似乎都有\n也有下劃線，刪除線也變得越來越普遍。\n\n我只是在想象我們可以用所有其他方式來轉換文本，但這些似乎是\n是唯一通用的兩種。這是爲什麼呢？他們是什麼時候（也許還有...",
      "title": "粗體和斜體是如何成爲幾乎所有文字處理程序中使用的通用文本轉換選項的？這些字體變化是否早於計算機，過去是否還有其他的文字變化？"
    }
  ]
}