{
  "author": "Asbbbb",
  "the_new_excerpt": "Hopefully everyone having a good day. I saw the quote in the title by the\nlegendary investor Warren Buffett and it got me thinking. I understand what he\nmeans by this quote but I'm tempted everyday by new \"HOT\" stocks with very high\nearning potential in the future. I'm more on the conservative side…",
  "original_created_utc": 1613626651,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "希望大家都能有个好心情。我看到标题中的一句话，由\n传奇投资人沃伦-巴菲特，这让我思考。我明白他\n这句话的手段，但我的诱惑，每天新的 \"HOT \"的股票，非常高的 \"HOT\"。\n挣钱的潜力在未来。我是比较保守的... ...",
      "title": "\"只有当投资者不明白自己在做什么时，才需要广泛分散投资。\" 沃伦-巴菲特的名言"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "希望大家都能有個好心情。我看到標題中的一句話，由\n傳奇投資人沃倫-巴菲特，這讓我思考。我明白他\n這句話的手段，但我的誘惑，每天新的 \"HOT \"的股票，非常高的 \"HOT\"。\n掙錢的潛力在未來。我是比較保守的... ...",
      "title": "\"只有當投資者不明白自己在做什麼時，才需要廣泛分散投資。\" 沃倫-巴菲特的名言"
    }
  ],
  "title": "\"Wide diversification is only required when investors do not understand what they are doing.\" Quote by Warren Buffett",
  "created_utc": 1613657193,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hopefully everyone having a good day. I saw the quote in the title by the legendary investor Warren Buffett and it got me thinking. I understand what he means by this quote but I&#39;m tempted everyday by new &quot;HOT&quot; stocks with very high earning potential in the future. I&#39;m more on the conservative side when it comes to investing and it gives me a sense of security when I have my portfolio diversified (90K total invested into 13 different stocks). One of my major concern is that you can believe in a stock after careful research and analysis but at the end of the day it&#39;s how the other investors and market as a whole values the stock, which you have no control over. </p>\n\n<p>I know there are many smart and successful investors in here so I would like to hear your opinion on the question. How diversified is too much diversification? Would you only stick to what you know best or expand to look for undervalued companies for potential gains? </p>\n\n<p>Anything helps, thank you in advance!</p>\n</div><!-- SC_ON -->",
  "score": 60,
  "permalink": "/r/stocks/comments/lmewlu/wide_diversification_is_only_required_when/",
  "subreddit": "stocks",
  "id": "lmewlu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332883614
}