{
  "author": "Accomplished-Disk-68",
  "original_created_utc": 1638031320,
  "title": "Have you ever bought a hefty position in an altcoin before it went parabolic?",
  "created_utc": 1638045049,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m just curious to see what some of you guys have “won” off of in the past. I’m not looking for anyone to shill their <em>current</em> altcoin favorites either. I’m specifically interested <strong>only</strong> to hear about any monumental gains you’ve made off of an altcoin that you dumped a ton of fiat into. I’d assume most of you would rather give percentages rather than the fiat amount so I’d encourage that. </p>\n\n<p>Things I’d also like to know in your comment: </p>\n\n<p>Did you hold conviction with the crypto’s utility or use-case(s) prior to your entry, or was it just a YOLO because you thought it would catch hype?</p>\n\n<p>Did a low market cap/circulating supply affect your decision to buy in?</p>\n\n<p>What was your entry and exit price (if you remember)?</p>\n\n<p>Did you sell near the top or hold through the pump and become a bag holder? </p>\n\n<p>I’m interested to hear your stories!</p>\n\n<p>Personally, I threw a decent amount into a low market cap alt (won’t reference it specifically to avoid a shill) a few months ago and was up over 650% after about 45 days. I sold off a good amount and continue to hold 2.5x my initial investment.</p>\n</div><!-- SC_ON -->",
  "score": 248,
  "permalink": "/r/CryptoCurrency/comments/r3haip/have_you_ever_bought_a_hefty_position_in_an/",
  "subreddit": "CryptoCurrency",
  "id": "r3haip",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m just curious to see what some of you guys have “won” off of in the past. I’m\nnot looking for anyone to shill their current altcoin favorites either. I’m\nspecifically interested only to hear about any monumental gains you’ve made off\nof an altcoin that you dumped a ton of fiat into. I’d assume…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、皆さんが過去に何を使って「勝った」のかを知りたいのです。私は\n現在のお気に入りのアルトコインを宣伝してくれる人を探しているわけでもありません。私は\n特に興味があるのは、あなたが捨てたアルトコインから得た記念碑的な利益の話です。\n不換紙幣を大量に投じたアルトコインで得られた莫大な利益を聞きたいのです。私が思うに...",
      "title": "アルトコインがパラボリックになる前に、多額のポジションを買ったことはありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是好奇地想看看你们中的一些人过去是靠什么 \"赢 \"的。我\n我也不是要找人兜售他们目前喜欢的altcoin。我\n我只想听听你们从一个抛售的altcoin中获得的任何巨大收益。\n倾注了大量的法币的altcoin而获得的巨大收益。我认为...",
      "title": "你是否曾在某一altcoin上市前买入高额头寸？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是好奇地想看看你們中的一些人過去是靠什麼 \"贏 \"的。我\n我也不是要找人兜售他們目前喜歡的altcoin。我\n我只想聽聽你們從一個拋售的altcoin中獲得的任何巨大收益。\n傾注了大量的法幣的altcoin而獲得的巨大收益。我認爲...",
      "title": "你是否曾在某一altcoin上市前買入高額頭寸？"
    }
  ]
}