{
  "author": "nicoleJo456",
  "original_created_utc": 1654184368,
  "title": "Biracial daughter gets called “fake black” by the black people at her school. Help me understand?",
  "created_utc": 1654201307,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;To be fair she’s 1/4 black 3/4 white, but she doesn’t look white, she has the curly hair and all, but is tan, she’s very beautiful (and I’m not just saying that as her mama). The kids at her middle school call her “ghetto” and “fake black”, like she’s pretending to be black. They don’t accept her. Someone help me understand a different perspective because it’s starting to make me think everyone in the whole world is racist. The news/media tells us only white people can be racist and I’m calling BS on that. Why is America so obsessed with the color of our skin?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/TooAfraidToAsk/comments/v3boue/biracial_daughter_gets_called_fake_black_by_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "v3boue",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "To be fair she’s 1/4 black 3/4 white, but she doesn’t look white, she has the\ncurly hair and all, but is tan, she’s very beautiful (and I’m not just saying\nthat as her mama). The kids at her middle school call her “ghetto” and “fake\nblack”, like she’s pretending to be black. They don’t accept her.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼女は1/4黒人、3/4白人ですが、白人には見えません。\nを持ち、日焼けしていて、とてもきれいです（私は彼女の母親としてだけ言っているのではありま\n彼女のママとして言っているのではありません）。彼女の中学校の子供たちは彼女のことを「ゲットー」とか「偽黒人」とか言っています。\nと呼ばれ、黒人のふりをしているように言われます。彼らは彼女を受け入れないのです...。",
      "title": "白人種の娘は、学校の黒人たちから「偽黒人」と呼ばれている。どうしたら理解できますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "公平地说，她有1/4的黑人和3/4的白人，但她看起来不是白人，她有卷曲的头发和所有的东西，但被晒得很黑。\n她有卷曲的头发和所有的东西，但被晒得很黑，她非常漂亮（我不仅仅是作为她的妈妈说的）。\n我不仅仅是作为她的妈妈这么说）。她所在中学的孩子们称她为 \"贫民窟 \"和 \"假黑人\"。\n黑人\"，好像她在假装是黑人。他们不接受她....",
      "title": "双性恋女儿被学校的黑人称为 \"假黑人\"。帮助我理解？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "公平地說，她有1/4的黑人和3/4的白人，但她看起來不是白人，她有捲曲的頭髮和所有的東西，但被曬得很黑。\n她有捲曲的頭髮和所有的東西，但被曬得很黑，她非常漂亮（我不僅僅是作爲她的媽媽說的）。\n我不僅僅是作爲她的媽媽這麼說）。她所在中學的孩子們稱她爲 \"貧民窟 \"和 \"假黑人\"。\n黑人\"，好像她在假裝是黑人。他們不接受她....",
      "title": "雙性戀女兒被學校的黑人稱爲 \"假黑人\"。幫助我理解？"
    }
  ]
}