{
  "author": "SkepticalCryptoDude",
  "original_created_utc": 1650313740,
  "title": "I’m realizing crypto might be the only way our generation can get ahead",
  "created_utc": 1650365089,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, the world is a mess… especially financially. Where I live, the average house is around 790k (no I don’t live in a big city like Toronto or Vancouver) and rent for a 1 bedroom is averaging about $1500 a month plus utilities. &lt;/p&gt;\n\n&lt;p&gt;Have you ever heard your parents or grandparents say what they bought their houses/cars for? Even though their wages were slightly less, it doesn’t make up for the increase in cost of living today, not to mention inflation.&lt;/p&gt;\n\n&lt;p&gt;Simply working more, or trying to find a high paying job isnt enough anymore. I’m starting to think crypto might be our generations once in a lifetime opportunity. My girlfriend and I are both working professionals and buying a house in this market is almost unattainable. &lt;/p&gt;\n\n&lt;p&gt;Which cryptos do you think will offer the best chance at making life changing money within say 5 years? Because life changing money is what it’s going to take with today’s cost of living + inflation vs current wages.&lt;/p&gt;\n\n&lt;p&gt;P.S, I’m betting on Ada, CKB, Link and Ergo. &lt;/p&gt;\n\n&lt;p&gt;Good luck to all of us.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 303,
  "permalink": "/r/CryptoCurrency/comments/u6mpao/im_realizing_crypto_might_be_the_only_way_our/",
  "subreddit": "CryptoCurrency",
  "id": "u6mpao",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Honestly, the world is a mess… especially financially. Where I live, the average\nhouse is around 790k (no I don’t live in a big city like Toronto or Vancouver)\nand rent for a 1 bedroom is averaging about $1500 a month plus utilities.\n\nHave you ever heard your parents or grandparents say what they…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正直、世の中は混乱している...特に経済的に。私が住んでいるところでは、平均\n家は約79万円（トロントやバンクーバーのような大都市には住んでいません）。\n1ベッドルームの家賃は月平均約1500ドル＋光熱費です。\n\nあなたは今まであなたの両親や祖父母は、彼らが言うことを聞いたことがある...",
      "title": "暗号は、私たちの世代が出世する唯一の方法かもしれないと実感しています"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "说实话，这个世界是一团糟......尤其是在金融方面。在我居住的地方，平均\n房子大约是79万（不，我不是住在多伦多或温哥华这样的大城市）。\n一间卧室的租金平均每月约为1500美元，外加水电费。\n\n你有没有听过你的父母或祖父母说他们...",
      "title": "我意识到加密货币可能是我们这一代人能够出人头地的唯一途径"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說實話，這個世界是一團糟......尤其是在金融方面。在我居住的地方，平均\n房子大約是79萬（不，我不是住在多倫多或溫哥華這樣的大城市）。\n一間臥室的租金平均每月約爲1500美元，外加水電費。\n\n你有沒有聽過你的父母或祖父母說他們...",
      "title": "我意識到加密貨幣可能是我們這一代人能夠出人頭地的唯一途徑"
    }
  ]
}