{
  "author": "ImpossibleAnger",
  "original_created_utc": 1658239809,
  "title": "In Little Women, men write their names in \"ball books\" or \"dance cards\" to claim dances with a particular woman. How common was this practice, and was there any sort of ettiquette about it?",
  "created_utc": 1658293364,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For example, would I save the first dance for my crush, or my father/brother? Could I put my name down for every dance with a woman, or was it considered polite to split my attentions evenly? As a woman, would it be possible for no one to write their name in my dance card at all?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/w2towl/in_little_women_men_write_their_names_in_ball/",
  "subreddit": "AskHistorians",
  "id": "w2towl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For example, would I save the first dance for my crush, or my father/brother?\nCould I put my name down for every dance with a woman, or was it considered\npolite to split my attentions evenly? As a woman, would it be possible for no\none to write their name in my dance card at all?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、ファーストダンスを恋人のためにとっておくか、父や兄のためにとっておくか。\n女性と踊るたびに名前を書いてもいいのだろうか？\nそれとも、均等に気を配るのが礼儀なのでしょうか？女性として、誰もいないことは可能でしょうか？\nダンスカードに名前を書かないということはあり得るのでしょうか？",
      "title": "リトル・ウーマン』の中で、男たちは特定の女性とのダンスを要求するために「ボール・ブック」や「ダンス・カード」に自分の名前を書き込む。この習慣はどの程度一般的だったのでしょうか。また、それに関するエチケットのようなものはあったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "例如，我会把第一支舞留给我的暗恋对象，还是我的父亲/兄弟？\n我是否可以在每次与女性跳舞时都写上自己的名字，或者说，把自己的名字写在上面被认为是\n礼貌地平均分配我的注意力？作为一个女人，是否有可能没有人\n舞蹈卡上写上自己的名字？",
      "title": "在《小妇人》中，男人在 \"舞会簿 \"或 \"舞蹈卡 \"上写下自己的名字，以要求与某个特定的女人跳舞。这种做法有多普遍，对此是否有什么礼仪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "例如，我會把第一支舞留給我的暗戀對象，還是我的父親/兄弟？\n我是否可以在每次與女性跳舞時都寫上自己的名字，或者說，把自己的名字寫在上面被認爲是\n禮貌地平均分配我的注意力？作爲一個女人，是否有可能沒有人\n舞蹈卡上寫上自己的名字？",
      "title": "在《小婦人》中，男人在 \"舞會簿 \"或 \"舞蹈卡 \"上寫下自己的名字，以要求與某個特定的女人跳舞。這種做法有多普遍，對此是否有什麼禮儀？"
    }
  ]
}