{
  "author": "kraken_enrager",
  "original_created_utc": 1655646377,
  "title": "Why are people in the US so obsessed with moving out at 18?",
  "created_utc": 1655722786,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Basically from my experience thru Reddit, I have seen that a lot of people want to move out at 18, before their education is even complete or they even have a decent job. &lt;/p&gt;\n\n&lt;p&gt;Here where I stay, most people never move out, but I’m not asking that. Why don’t y’all move our once y’all are independent, and can earn decently. &lt;/p&gt;\n\n&lt;p&gt;On the crust, it seems that it would solve a lot of the problems y’all have (read- living paycheque to paycheque, student loans ). &lt;/p&gt;\n\n&lt;p&gt;Since rent is a major cost, it can be almost fully eliminated, and in a fraction of a cost, you could even help your parents out in their house.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/vfvjoi/why_are_people_in_the_us_so_obsessed_with_moving/",
  "subreddit": "NoStupidQuestions",
  "id": "vfvjoi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Basically from my experience thru Reddit, I have seen that a lot of people want\nto move out at 18, before their education is even complete or they even have a\ndecent job.\n\nHere where I stay, most people never move out, but I’m not asking that. Why\ndon’t y’all move our once y’all are independent,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Redditでの経験では、多くの人が、このようなことを望んでいることがわかりました。\n18歳で、まだ教育も終わっていない、まともな仕事にも就いていない段階で、引っ越したいと思っている人が多いようです。\nても、まともな仕事がない。\n\n私が住んでいるところでは、ほとんどの人が引っ越しをしませんが、私はそれを聞いているわけではありません。なぜ\n自立してから引っ越せばいいじゃないですか。",
      "title": "なぜアメリカでは、18歳で引っ越すことにこだわるのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "基本上，从我在Reddit上的经验来看，我看到很多人都想在18岁时搬出去住。\n在18岁的时候，在他们的教育还没有完成，或者他们甚至有了一份工作之前，就想搬出去住。\n适当的工作。\n\n在我呆的地方，大多数人从来没有搬出去过，但我不是在问这个。为什么\n一旦你们独立了，为什么不搬出去呢？",
      "title": "为什么美国人对18岁就搬出去住如此痴迷？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "基本上，從我在Reddit上的經驗來看，我看到很多人都想在18歲時搬出去住。\n在18歲的時候，在他們的教育還沒有完成，或者他們甚至有了一份工作之前，就想搬出去住。\n適當的工作。\n\n在我呆的地方，大多數人從來沒有搬出去過，但我不是在問這個。爲什麼\n一旦你們獨立了，爲什麼不搬出去呢？",
      "title": "爲什麼美國人對18歲就搬出去住如此癡迷？"
    }
  ]
}