{
  "author": "golovko21",
  "the_new_excerpt": "Just thinking to myself today that while I've been \"standing there and doing\nnothing\", someone has been losing money by panic selling the last few days while\nsomeone else has been eating their lunch by buying the dip. I just can't wrap my\nhead around this mindset where you would try to time the…",
  "original_created_utc": 1621019742,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が「何もしないで立っている」間にも、誰かがこの数日の間にパニック売りをしてお金を失っているのではないかと、今日は考えています。\n私が「何もしないで立っている」間に、誰かがここ数日のパニック売りでお金を失っている。\n他の人はディップを買ってランチを食べている。私にはどうしても理解できません。\nこのような考え方を理解することができません...。",
      "title": "今週の株式市場でお金が動くのを見ながら、何もせずに立っているだけ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天我在想，当我 \"站在那里什么都不做 \"的时候，有人在过去几天里通过恐慌性抛售而亏损了。\n我一直 \"站在那里什么都不做\"，而有人却在过去几天里通过恐慌性抛售而亏损。\n而另一个人却通过买入跌停板吃了午饭。我只是无法理解\n我只是无法理解这种心态，即你会试图把握好时机。",
      "title": "只是站在这里，什么都不做，而看着本周股市上的资金变化。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天我在想，當我 \"站在那裏什麼都不做 \"的時候，有人在過去幾天裏通過恐慌性拋售而虧損了。\n我一直 \"站在那裏什麼都不做\"，而有人卻在過去幾天裏通過恐慌性拋售而虧損。\n而另一個人卻通過買入跌停板吃了午飯。我只是無法理解\n我只是無法理解這種心態，即你會試圖把握好時機。",
      "title": "只是站在這裏，什麼都不做，而看着本週股市上的資金變化。"
    }
  ],
  "title": "Just standing here and doing nothing while watching money change hands on the stock market this week",
  "created_utc": 1621027919,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just thinking to myself today that while I&#39;ve been &quot;standing there and doing nothing&quot;, someone has been losing money by panic selling the last few days while someone else has been eating their lunch by buying the dip. I just can&#39;t wrap my head around this mindset where you would try to time the market (up or down) but really just end up locking in your loses. Especially with how quickly the market shifts on a day to day basis.</p>\n\n<p>I&#39;ve seen my portfolio grow significantly over the last 5+ years and I haven&#39;t sold a single stock during that time. If I were to drill into a single day or week during the last 14 months, I would see at times single day &quot;losses&quot; that exceed my annual salary from my first salaried job from many years ago. When looking at the big picture, those loses don&#39;t even register on my portfolio&#39;s growth over a 5-10 year period. I view this as another validation to staying the course. While I also understand and recognize that we&#39;ve had the longest bull market run, there have been many opportunities along the way to panic and sell because it looked like it was all coming to a crashing end.</p>\n</div><!-- SC_ON -->",
  "score": 134,
  "permalink": "/r/Bogleheads/comments/ncgje9/just_standing_here_and_doing_nothing_while/",
  "subreddit": "Bogleheads",
  "id": "ncgje9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590802222
}