{
  "author": "Not_UsingMainAccount",
  "the_new_excerpt": "I don't feel the need to have sex with anyone, but I don't think I'm asexual\neither.\n\nFrom what I understand, asexual people don't feel sexual attraction, but I do. I\nfind some people hot and I can have sexual fantasies about them. But the thing\nis, I don't want to have sex with them in real life.…",
  "original_created_utc": 1623891119,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は誰かとセックスする必要性を感じていませんが、自分が無性愛者だとも思いません。\nと思っています。\n\n私の理解では、無性愛者は性的魅力を感じませんが、私は感じます。I\n何人かの人をセクシーだと感じ、その人について性的な空想をすることができます。しかし、問題は\nしかし、現実にはその人とセックスしたいとは思いません。....",
      "title": "性的魅力を感じても、セックスを望まないのは普通のことですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不觉得有必要与任何人发生性关系，但我不认为我是无性恋者\n也不是。\n\n据我所知，无性恋的人没有性吸引的感觉，但我有。I\n我发现有些人很性感，我可以对他们产生性幻想。但问题是\n是，我不想在现实生活中与他们发生性关系....。",
      "title": "感觉到性吸引但不想要性是正常的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不覺得有必要與任何人發生性關係，但我不認爲我是無性戀者\n也不是。\n\n據我所知，無性戀的人沒有性吸引的感覺，但我有。I\n我發現有些人很性感，我可以對他們產生性幻想。但問題是\n是，我不想在現實生活中與他們發生性關係....。",
      "title": "感覺到性吸引但不想要性是正常的嗎？"
    }
  ],
  "title": "Is it normal to feel sexual attraction but not want sex?",
  "created_utc": 1623930484,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t feel the need to have sex with anyone, but I don&#39;t think I&#39;m asexual either.</p>\n\n<p>From what I understand, asexual people don&#39;t feel sexual attraction, but I do. I find some people hot and I can have sexual fantasies about them. But the thing is, I don&#39;t want to have sex with them in real life. When I feel sexually attracted to someone, I do want to caress their body or kiss them, but I don&#39;t want things to go to penetration or orgasm.</p>\n\n<p>I also enjoy masturbating and watching porn.</p>\n\n<p>Is that a problem or can I just not worry about it?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/o1kar4/is_it_normal_to_feel_sexual_attraction_but_not/",
  "subreddit": "TooAfraidToAsk",
  "id": "o1kar4",
  "is_self": true,
  "media": null,
  "is_video": false
}