{
  "author": "YT-JustLivinLife",
  "the_new_excerpt": "Just wondering what people’s thoughts will be on an idea I’ve been researching.\n\n(I’ll keep it short but if you want any websites to numbers I claim let me know)\n\nCurrently as we all know there’s a huge rental paying problem about 17 million\nAmericans are behind as of 12/14/2020 and 5.7 million of…",
  "original_created_utc": 1609782975,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "只是想知道人们对我一直在研究的一个想法会有什么想法。\n\n(我会尽量简短，但如果你想要我声称的号码的任何网站，请告诉我)\n\n目前，我们都知道，大约有1700万的房租存在巨大的支付问题\n截至2020年12月14日，美国人落后于国内生产总值(…)的570万",
      "title": "驱逐会不会是经济的崩溃？(讨论)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "只是想知道人們對我一直在研究的一個想法會有什麼想法。\n\n(我會盡量簡短，但如果你想要我聲稱的號碼的任何網站，請告訴我)\n\n目前，我們都知道，大約有1700萬的房租存在巨大的支付問題\n截至2020年12月14日，美國人落後於國內生產總值(…)的570萬",
      "title": "驅逐會不會是經濟的崩潰？(討論)"
    }
  ],
  "title": "Will evictions be the downfall of the economy? (Discussion)",
  "created_utc": 1609804075,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just wondering what people’s thoughts will be on an idea I’ve been researching. </p>\n\n<p>(I’ll keep it short but if you want any websites to numbers I claim let me know)</p>\n\n<p>Currently as we all know there’s a huge rental paying problem about 17 million Americans are behind as of 12/14/2020 and 5.7 million of those  are likely to be evicted in the next 2 months. \n(This doesn’t consider commercial)</p>\n\n<p>With this new stimulus evictions were supposed to be prolonged but it’s only been prolonged until January 31, 2021. Luckily many states have an extension (About February 14) with the exception of Maryland,Nevada,New Jersey, New York, and Oregon which have farther down extensions June, end of pandemic, etc. </p>\n\n<p>I’ve talked with a couple of real estate lawyers and they say they are already getting a flood of evictions (commercial and residential) and are expecting a “huge tsunami of evictions” (not my word theirs. </p>\n\n<p>Since hedge funds are currently holding a huge amount of real estate bought in 08 for cheap ( top 50 real estate hedge funds held about 192.876 billions dollars of real estate in 2012) They’ve definitely been stocking up and there portfolios are probably 10 fold by now since (that’s what’s caused market value increase) but now with a huge amount of evictions (that they will be giving out) they will loose a huge amount of profit that the hedge was making. </p>\n\n<p>Ultimately this will lead to an initial drop in home values once evictions occur, and a second greater drop once they try to liquidate their real estate properties. </p>\n\n<p>This part I might be wrong but I see two ways they liquidate, the first is they sell to banks in packages at reduced prices knowing eventually the government will bail the banks out when the values drop on the properties and take profit from 08 or if they are actually evicting people out of stupidity, they themselves put the properties on the market to sell.</p>\n\n<p>Either way restaurants and people get evicted, home values drop and the stock market being pumped on inexperienced investors gets a quick scare dump. </p>\n\n<p>I might be completely wrong so I’d love to get peoples opinion and especially people in the real estate space. </p>\n\n<p>Tldr: Commercial/Home Evictions will reduce rental income in hedge funds causing them to Liquidate real estate dropping the housing market and stock market.</p>\n</div><!-- SC_ON -->",
  "score": 143,
  "permalink": "/r/investing/comments/kqdvhr/will_evictions_be_the_downfall_of_the_economy/",
  "subreddit": "investing",
  "id": "kqdvhr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100747522
}