{
  "author": "BestCelery263",
  "original_created_utc": 1634321799,
  "title": "If you're feeling FOMO right now, chill. Don't dump your $10k emergency fund into BTC chasing the pump.",
  "created_utc": 1634341136,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Instead what you should do is take out a home equity line of credit against your house so you can drop $100k into BTC chasing the pump.</p>\n\n<p>I would recommend a home equity line of credit instead of a home equity loan. They’re generally interest-only payments for the first 10 years, then pay back interest and principal in the following 20 years. Whereas a home equity loan will require principal payments alongside interest immediately. Rates are generally low, in the ballpark of 3% to 5%.</p>\n\n<p>If you lose your house, you still have your $10k emergency fund to drop on black in Roulette.</p>\n\n<p>This is financial advice.</p>\n</div><!-- SC_ON -->",
  "score": 187,
  "permalink": "/r/CryptoCurrency/comments/q8u6qz/if_youre_feeling_fomo_right_now_chill_dont_dump/",
  "subreddit": "CryptoCurrency",
  "id": "q8u6qz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Instead what you should do is take out a home equity line of credit against your\nhouse so you can drop $100k into BTC chasing the pump.\n\nI would recommend a home equity line of credit instead of a home equity loan.\nThey’re generally interest-only payments for the first 10 years, then pay…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それよりも、自分の家を担保にしたホーム・エクイティ・クレジット制度を利用して\nそうすれば、ポンプを追ってBTCに10万ドルを投じることができます。\n\n私はホーム・エクイティ・ローンではなく、ホーム・エクイティ・クレジットをお勧めします。\nホーム・エクイティ・ローンは、最初の10年間は金利のみの支払いで、その後は...",
      "title": "もしあなたが今、FOMOを感じているなら、冷静になってください。ポンプを追いかけるBTCに10kドルの緊急資金を投じないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "相反，你应该做的是用你的房子做抵押贷款，这样你就可以把10万美元投入到BTC中去追赶水泵。\n这样你就可以把10万美元投入到BTC中去追赶泵。\n\n我建议使用房屋净值信贷额度，而不是房屋净值贷款。\n它们通常在头10年只支付利息，然后支付...",
      "title": "如果你现在感觉到FOMO，那就冷静一下。不要把你的1万美元应急基金倾倒在追逐泵的BTC上。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "相反，你應該做的是用你的房子做抵押貸款，這樣你就可以把10萬美元投入到BTC中去追趕水泵。\n這樣你就可以把10萬美元投入到BTC中去追趕泵。\n\n我建議使用房屋淨值信貸額度，而不是房屋淨值貸款。\n它們通常在頭10年只支付利息，然後支付...",
      "title": "如果你現在感覺到FOMO，那就冷靜一下。不要把你的1萬美元應急基金傾倒在追逐泵的BTC上。"
    }
  ]
}