{
  "author": "NaiwennFr",
  "the_new_excerpt": "Today I get up, check the sub and see this post from user BirdSetFree .... which\nis a vulgar copy & paste of a post I wrote.\n\nYou will tell me, ok it happens, it's not a big deal.\n\nOn another sub, it's a dick move but with no consequence. But here, it has\nanother significance. Because he did this…",
  "original_created_utc": 1619792889,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、起きてサブをチェックすると、ユーザーのBirdSetFree .... からの投稿がありました。\n私が書いた記事を下品にコピー＆ペーストしたものです。\n\n私が書いた記事を下品にコピー＆ペーストしたものです。あなたは私に言うでしょう、OK、それは起こる、それは大したことではない。\n\n別のサブサイトでは、それは嫌な行動ですが、何の影響もありません。しかし、ここでは、それは別の意味を持ちます。\n別の意味があります。彼がこれをしたから...",
      "title": "月を採掘するために、成功した記事をコピーするのは、BANされるに値するアホです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天我起床后，查看了一下子，看到用户BirdSetFree .... 的这个帖子。\n是对我写的帖子的粗俗复制和粘贴。\n\n你会告诉我，好吧，它发生了，这不是什么大问题。\n\n在另一个子上，这是一个混蛋行为，但没有任何后果。但在这里，它有\n另一种意义。因为他这样做...",
      "title": "为了开采月亮而复制成功的帖子，使你成为一个应该被禁止的混蛋。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天我起牀後，查看了一下子，看到用戶BirdSetFree .... 的這個帖子。\n是對我寫的帖子的粗俗複製和粘貼。\n\n你會告訴我，好吧，它發生了，這不是什麼大問題。\n\n在另一個子上，這是一個混蛋行爲，但沒有任何後果。但在這裏，它有\n另一種意義。因爲他這樣做...",
      "title": "爲了開採月亮而複製成功的帖子，使你成爲一個應該被禁止的混蛋。"
    }
  ],
  "title": "Copying successful posts, in order to mine moons, makes you an asshole who deserves to be banned",
  "created_utc": 1619803373,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Today I get up, check the sub and see this post from user BirdSetFree .... which is a vulgar copy &amp; paste of a post I wrote.</p>\n\n<p>You will tell me, ok it happens, it&#39;s not a big deal.</p>\n\n<p>On another sub, it&#39;s a dick move but with no consequence. But here, it has another significance. Because he did this only to earn moons, coz he&#39;s greedy. Because it does just that, copy everyone&#39;s posts.</p>\n\n<p>And you know what&#39;s ... awkward? My post he copied was an &quot;off the chest&quot;, which asked for honesty, it came out of the heart, it came out of the guts. It turned me a bit over that someone copied without embarrassment a post that asked me to reveal myself, to take the time to write it correctly, to take the risk of rushing the community a little to get a message across that was important to me.</p>\n\n<p>Once this taste of disgust has passed, I have one question left: why is he not banned directly ? Plagiarism is ugly, and it is (to my surprise) hurtful for the original OP.</p>\n</div><!-- SC_ON -->",
  "score": 548,
  "permalink": "/r/CryptoCurrency/comments/n1v0o8/copying_successful_posts_in_order_to_mine_moons/",
  "subreddit": "CryptoCurrency",
  "id": "n1v0o8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380961459
}