{
  "author": "Chemonaut",
  "the_new_excerpt": "In spiral galaxies, there is commonly a ‘galactic bulge’ of light. As most of us\nknow, stars usually orbit around the plane, but is it possible for a large\nnumber of stars to orbit at (at least close to) a 90 degree angle relative to\nthis? If so, how would that formation process have occurred?\n\nOr…",
  "original_created_utc": 1617031552,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在螺旋星系中，通常会有一个 \"星系突起 \"的光点。正如我们大多数人\n知道，恒星通常围绕着平面运行，但它是可能的一个大的\n以相对于90度角运行的恒星数量（至少接近）。\n这吗？如果是的话，那形成的过程是如何发生的呢？\n\n或者说...",
      "title": "是否有恒星的轨道垂直于银河系平面？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在螺旋星系中，通常會有一個 \"星系突起 \"的光點。正如我們大多數人\n知道，恆星通常圍繞着平面運行，但它是可能的一個大的\n以相對於90度角運行的恆星數量（至少接近）。\n這嗎？如果是的話，那形成的過程是如何發生的呢？\n\n或者說...",
      "title": "是否有恆星的軌道垂直於銀河系平面？"
    }
  ],
  "title": "Are there stars that orbit perpendicular to the galactic plane?",
  "created_utc": 1617039320,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In spiral galaxies, there is commonly a ‘galactic bulge’ of light. As most of us know, stars usually orbit around the plane, but is it possible for a large number of stars to orbit at (at least close to) a 90 degree angle relative to this? If so, how would that formation process have occurred?</p>\n\n<p>Or am I overthinking it and the bulge is simply a result of the massive light output from the high density of stars?</p>\n\n<p>Edit: just to clarify, I know that there are irregular galaxies that are composed of stars in a ‘cloud’ of sorts, like the Magellanic Clouds. I am referring to conventional spiral galaxies for this post.</p>\n\n<p>Edit 2: by ‘large number’, I’m referring to a significant portion of the total number of stars. Maybe 0.1-1% of total stellar count or mass. Something along the lines of 0.1-10 million stars at least.</p>\n</div><!-- SC_ON -->",
  "score": 135,
  "permalink": "/r/askscience/comments/mfrzj9/are_there_stars_that_orbit_perpendicular_to_the/",
  "subreddit": "askscience",
  "id": "mfrzj9",
  "is_self": true,
  "media": null,
  "is_video": false
}