{
  "author": "Ynwe",
  "the_new_excerpt": "This may break the 20 year rule, but I am unsure where this question really\nfits.\n\nThe Shinkansen is now over 50 years old and boasts a very impressive track\nrecord. Japanese ministers always point towards its zero fatility rate, it is\nfamous all over the world and as someone that has travelled on…",
  "original_created_utc": 1620804641,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは20年ルールを破ることになるかもしれませんが、この質問が本当にどこに当てはまるのかわかりません。\nに合うかどうか。\n\n新幹線は50年以上の歴史を持ち、非常に素晴らしい実績を誇っています。\n記録を誇っています。日本の大臣はいつも、死亡率がゼロであることを指摘し、それは有名です。\n世界的にも有名ですし、実際に旅をしたことのある者としては...",
      "title": "なぜ日本は鉄道技術の輸出に成功しなかったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这可能打破了20年的规则，但我不确定这个问题真正适合在哪里\n适合。\n\n新干线现在已经有50多年的历史，并且拥有非常令人印象深刻的记录。\n记录。日本的部长们总是指出它的零事故率，它是\n它在全世界都很有名，而且作为一个曾经乘坐过新干线的人......",
      "title": "为什么日本未能成功出口其火车技术？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這可能打破了20年的規則，但我不確定這個問題真正適合在哪裏\n適合。\n\n新幹線現在已經有50多年的歷史，並且擁有非常令人印象深刻的記錄。\n記錄。日本的部長們總是指出它的零事故率，它是\n它在全世界都很有名，而且作爲一個曾經乘坐過新幹線的人......",
      "title": "爲什麼日本未能成功出口其火車技術？"
    }
  ],
  "title": "Why has Japan failed to successfully export its train technology?",
  "created_utc": 1620823458,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This may break the 20 year rule, but I am unsure where this question really fits. </p>\n\n<p>The Shinkansen is now over 50 years old and boasts a very impressive track record. Japanese ministers always point towards its zero fatility rate, it is famous all over the world and as someone that has travelled on it from Fukuoka to Osaka and then Tokyo, it was a very enoyable ride. Yet when it comes to modern day train exports you have 3 big players from the West: Bombardier, Siemens and Alstom. Canadian, German and French. China is also trying to enter the race as is visible in recent biddings in the Southeastern Asian area. </p>\n\n<p>However, outside of one track in Taiwan I don&#39;t remember the Japanese train technology being able to be exported anywhere. Why? Japan was able to engineer an amazing high speed train and network over half a century ago, one would think this would be a great foundation as an export hit. Yet this never happened and eventually the West caught up and Japan now seems to even lag behind. </p>\n\n<p>Why has Japan historically not been able to sell its train technology in the 20th century when, at least from my view, it had a huge advantage over the rest of the world?</p>\n</div><!-- SC_ON -->",
  "score": 144,
  "permalink": "/r/AskHistorians/comments/naj07f/why_has_japan_failed_to_successfully_export_its/",
  "subreddit": "AskHistorians",
  "id": "naj07f",
  "is_self": true,
  "media": null,
  "is_video": false
}