{
  "author": "brigister",
  "the_new_excerpt": "I am aware that this is a touchy subject, as well as probably a complex one, and\nthat there might be many different theories as it's not such a straightforward\nobjective fact, but that is precisely why I am asking this question here on\nr/AskHistorians [/r/AskHistorians].\n\nI've always wondered what…",
  "original_created_utc": 1621769859,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは微妙な問題であり、おそらく複雑な問題であることは承知しています。\nそれほど単純な客観的事実ではないので、いろいろな説があるかもしれません。\n客観的な事実ではないので、様々な説があることは承知していますが、それこそが、私がこの質問をこの\nr/AskHistorians [/r/AskHistorians].\n\n私がいつも疑問に思っているのは、何...",
      "title": "なぜ、イスラム教徒の多い国では、キリスト教徒の多い国のように、宗教から離れていく人が多かったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道这是一个敏感的问题，也可能是一个复杂的问题，而且可能有许多不同的理论，因为它不是那么直接的。\n可能有许多不同的理论，因为这不是一个直接的客观事实。\n客观事实，但这正是我在这里问这个问题的原因。\nr/AskHistorians [/r/AskHistorians]提出这个问题。\n\n我一直想知道什么...",
      "title": "为什么穆斯林占多数的国家的大多数人没有像在基督教占多数的国家那样逐渐脱离宗教？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道這是一個敏感的問題，也可能是一個複雜的問題，而且可能有許多不同的理論，因爲它不是那麼直接的。\n可能有許多不同的理論，因爲這不是一個直接的客觀事實。\n客觀事實，但這正是我在這裏問這個問題的原因。\nr/AskHistorians [/r/AskHistorians]提出這個問題。\n\n我一直想知道什麼...",
      "title": "爲什麼穆斯林佔多數的國家的大多數人沒有像在基督教佔多數的國家那樣逐漸脫離宗教？"
    }
  ],
  "title": "Why didn't most people in Muslim-majority countries grow detached from religion like they often did in Christian-majority countries?",
  "created_utc": 1621780003,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am aware that this is a touchy subject, as well as probably a complex one, and that there might be many different theories as it&#39;s not such a straightforward objective fact, but that is precisely why I am asking this question here on <a href=\"/r/AskHistorians\">r/AskHistorians</a>.</p>\n\n<p>I&#39;ve always wondered what concurrence of events and ideologies led to both many Western Christians slowing losing their faith, as well as to many Muslims staying (or possibly growing more) attached to theirs.</p>\n</div><!-- SC_ON -->",
  "score": 127,
  "permalink": "/r/AskHistorians/comments/nj60qb/why_didnt_most_people_in_muslimmajority_countries/",
  "subreddit": "AskHistorians",
  "id": "nj60qb",
  "is_self": true,
  "media": null,
  "is_video": false
}