{
  "author": "MaxMaxMax_05",
  "the_new_excerpt": "In terms of maritime distance: Khmer Empire\n\n * The shortest route from India to the Khmer Empire’s capital (Chennai -\n   Angkor) is 4,700 km\n * The shortest route from China to the Khmer Empire’s capital (Sanya - Angkor)\n   is 1,700 km.\n * Indian traders would have to travel 2.8 times further to…",
  "original_created_utc": 1621519640,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "海上の距離的には クメール帝国\n\n * インドからクメール帝国の首都（チェンナイ～）までの最短ルートは\n   アンコール）は4,700km\n * 中国からクメール帝国の首都（三亜-アンコール）への最短ルートは1,700km。\n   は1,700kmです。\n * 中国からクメール帝国の首都（三亜～アンコール）までの最短ルートは1,700km。",
      "title": "クメール帝国やチャンパ王国は、中国に近いにもかかわらず、なぜインド文化の影響を受けたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在海上距离方面。高棉帝国\n\n *从印度到高棉帝国的首都（钦奈--）的最短路线是\n   吴哥）是4,700公里\n * 从中国到高棉帝国的首都（三亚-吴哥）最短的航线是1700公里。\n   是1,700公里。\n * 印度商人要再走2.8倍才能到...",
      "title": "为什么高棉帝国和占婆王国离中国更近，却受到印度文化的影响？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在海上距離方面。高棉帝國\n\n *從印度到高棉帝國的首都（欽奈--）的最短路線是\n   吳哥）是4,700公里\n * 從中國到高棉帝國的首都（三亞-吳哥）最短的航線是1700公里。\n   是1,700公里。\n * 印度商人要再走2.8倍才能到...",
      "title": "爲什麼高棉帝國和佔婆王國離中國更近，卻受到印度文化的影響？"
    }
  ],
  "title": "Why was the Khmer Empire and the Kingdom of Champa influenced by Indian culture despite being much closer to China?",
  "created_utc": 1621552468,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>In terms of maritime distance: Khmer Empire</strong></p>\n\n<ul>\n<li>The shortest route from India to the Khmer Empire’s capital (Chennai - Angkor) is 4,700 km</li>\n<li>The shortest route from China to the Khmer Empire’s capital (Sanya - Angkor) is 1,700 km.</li>\n<li>Indian traders would have to travel 2.8 times further to get to the capital of the Khmer Empire than the Chinese could do.</li>\n</ul>\n\n<p>While the Khmers held the Andaman coast for a period of time in its history, the kingdom started out as a nation with great Indian influence.</p>\n\n<p><strong>In terms of maritime distance: Kingdom of Champa</strong></p>\n\n<ul>\n<li>The shortest route from India to the Kingdom of Champa’s capital (Chennai - Vijaya) is 4,700 km.</li>\n<li>The shortest route from China to the Kingdom of Champa’s capital (Sanya - Vijaya) is 500 km</li>\n<li>Indian traders would have to travel 9.4 times further to get to the capital of the Kingdom of Champa than the Chinese could do.</li>\n</ul>\n\n<p>Why is it that these kingdoms were influenced by Indian culture despite being much closer to China?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/nh1625/why_was_the_khmer_empire_and_the_kingdom_of/",
  "subreddit": "AskHistorians",
  "id": "nh1625",
  "is_self": true,
  "media": null,
  "is_video": false
}