{
  "author": "DecentralizedLaw",
  "original_created_utc": 1632056226,
  "title": "New Shocking US Crypto Regulation Far More Invasive [Due Diligence]",
  "created_utc": 1632065643,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>New US Crypto Regulation Far More Invasive Than We Thought</h1>\n\n<p><strong>US Congress intends to regulate crypto on a level far deeper  than currently understood―They will:</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Designate Bitcoin, Ether, and their hard-forks as commodities and regulate their transactions accordingly;</li>\n<li>Create legal uncertainty for all other crypto projects and ICOs by allowing them to be labeled as securities;</li>\n<li>Ban the use of (unauthorized) stablecoins;</li>\n<li>Introduce penalties for the use of mixers and privacy coins;</li>\n<li>Rebrand smart-contracts that take longer than 24 hours to deliver as futures contracts and regulate them accordingly;</li>\n<li>Re-define  legal tender and change the way money is created by the Federal  Reserve; and authorize the issuing of a digital USD of which all  transactions are recorded;</li>\n<li>Introduce foreign regulations into US law for all virtual asset service providers in the US (and with US clients). This would not be done to then never use it.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>In short: Congress wants to bring crypto-currencies under full oversight and control.</strong></p>\n\n<p>These  new regulations introduce massive regulatory burdens on existing  projects, ban and criminalize current normal activities, restrain  innovation and free enterprise, and even introduce a transparent central  bank digital digital currency that redefines money as we know it!</p>\n\n<p>According  to United States representative Don Beyer, congress should incorporate  “digital assets into existing financial regulatory structures.”(1) As you will see, they intend to do just that.</p>\n\n<p>And it will change the way things are done for crypto forever…</p>\n\n<p>&#x200B;</p>\n\n<h2>&lt;What This Post Is About_</h2>\n\n<p>This  post provides an overview of the crypto legislation currently  (September 2021) being put through US congress.</p>\n\n<p>It does not just look at  the proposed bills, but rather at the wide range of laws that are to be  amended.</p>\n\n<p>Once all the puzzle pieces are put together, the big  picture reveals shockingly strict regulations of crypto and a complete  overhaul of the idea of “money.” This could have serious effects not  only on the crypto sector, but also on the financial system as a whole.</p>\n\n<p>Behind  the excuses of preventing money laundering and ensuring investor  protection, the use of crypto is transformed in something it was not  supposed to be. Especially delicate is the fact that part of this legislation is drafted outside the US.</p>\n\n<p><strong><em>Disclaimer</em></strong>*:  This report provides a high-level overview of the US laws that are to  be introduced/amended by two new bills. Its depth is limited by the inadequate knowledge of the author of the large body of US law involved, and given that these bills are subject to amendments and have not even passed into law yet, none of this information can be considered legal or financial advice.*</p>\n\n<p>&#x200B;</p>\n\n<h2>&lt;What Is Going On?</h2>\n\n<p>On April 06, 2021, a “must pass” bill was introduced called the “Infrastructure Investment and Jobs Act”(2)  (“Infrastructure Bill”). It passed in the House of Representatives and,  after fierce debate, the Senate. Hidden in this bill, an amendment to  the Internal Revenue Code was added. It introduced new reporting  requirements and obligations for record keeping.</p>\n\n<p>While this bill  created a lot of public outcry, more recently, a real game-changing bill  was introduced in the House on July 28, 2021, namely the: “Digital  Asset Market Structure and Investor Protection Act” (3) (“Digital Asset Bill”).</p>\n\n<p>This  bill proposes amendments to the Federal Reserve Act, the Bank Secrecy  Act, Securities Exchanges Acts, and the Commodity Exchange Act. It  changes the definition of legal tender, and it introduces international  crypto regulation into US law.</p>\n\n<p>This article looks at each of these amendments…</p>\n\n<p>&#x200B;</p>\n\n<h2>&lt;Commodities or Securities?_</h2>\n\n<p>The  main take-away is that two different bodies of law will apply to crypto  projects: commodities and securities laws. So far, only Bitcoin, Ether,  and their hard-forks are confirmed to be commodities (see below). All  other cryptos are subject to future guidance by market regulators:</p>\n\n<p><em>“Not  later than 150 days after the date of the enactment of this section,  the SEC and CFTC shall jointly publish, for purposes of a 60-day public  comment period, a proposed rulemaking that classifies each of the major  digital assets.</em></p>\n\n<p><strong><em>Not later  than 270 days after the date of the enactment of this Act</em></strong>*, the SEC and  CFTC shall jointly publish a final rule that classifies* <strong><em>each of the top  25 major digital assets</em></strong> <em>by (i) highest market capitalization and (ii)  highest daily average trading volume as—</em></p>\n\n<p><em>(1) a digital asset; or(2) a digital asset security.”</em> (4)</p>\n\n<p>&#x200B;</p>\n\n<h2>Interpretation:</h2>\n\n<ul>\n<li>Cryptos will be subject to two different regulatory regimes: commodities and security regulations.</li>\n<li>Services  engaged with both digital assets (commodities) and digital asset  securities (securities) could be subjected to both regulatory regimes.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<h2>&lt;Commodities Regulation_</h2>\n\n<p>The  Commodity Exchange Act regulates the trading of commodity futures in  the United States. Passed in 1936, it has been amended several times  since then.(5)  It provides federal regulation of all commodities and futures trading  activities and requires all futures and commodity options to be traded  on organized exchanges.</p>\n\n<p>In 1974, the Commodity Futures Trading  Commission (CFTC) was created to oversee the market. With certain  exceptions, the CFTC has been granted exclusive jurisdiction over  commodity futures, options, and all other derivatives that fall within  the definition of a swap. Certain cryptos will be regulated as  commodities.</p>\n\n<p>&#x200B;</p>\n\n<h2>Definition of “Commodity” Amended to Include Digital Asset:</h2>\n\n<p>First and foremost, Section 1a of the Commodity Exchange Act on definitions will be amended to read as follows:</p>\n\n<p><em>“</em><strong><em>The term “commodity” means</em></strong>  <em>wheat, cotton, rice, corn, oats, barley, rye, flaxseed, grain sorghums,  mill feeds, butter, eggs, Solanum tuberosum (Irish potatoes), wool,  wool tops, fats and oils (including lard, tallow, cottonseed oil, peanut  oil, soybean oil, and all other fats and oils), cottonseed meal,  cottonseed, peanuts, soybeans, soybean meal, livestock, livestock  products,</em> <strong><em>digital asset (including Bitcoin, Ether, and their hardforks)</em></strong><em>,  and frozen concentrated orange juice, and all other goods and articles,  except onions (as provided by section 13–1 of this title) and motion  picture box office receipts (or any index, measure, value, or data  related to such receipts), and all services, rights, and interests  (except motion picture box office receipts, or any index, measure, value  or data related to such receipts) in which contracts for future  delivery are presently or in the future dealt in.”</em>(6)</p>\n\n<p>&#x200B;</p>\n\n<h2>Digital Asset Definition</h2>\n\n<p>Next, the end of Section 1a of the Commodity Exchange Act will be amended by adding a clarification of what a digital asset is (7)(definition to long to post here)</p>\n\n<p>&#x200B;</p>\n\n<h2>Smart Contracts with Delivery Time of More than 24 hours are Futures Contracts</h2>\n\n<p>A  sharpening of the definition of retail commodity transactions could  decrease the options for the use of smart contracts outside of regulated  exchanges.</p>\n\n<p>Currently, Section 2(c)(2)(D)(i) of the Commodity Exchange Act prohibits persons that are not <em>“eligible contract participants”</em> or <em>“eligible commercial entities”</em>  to engage in agreements, contract or transactions in commodities on  leverage, margin, or financed by the offeror, the counterparty, or a  person acting in concert with the offeror or counterparty on a similar  basis.(8)</p>\n\n<p>Next,  additional amendments mentioned in the SEC. 202 of the Digital Asset  Bill applies this on transactions done by smart contract of which the  delivery takes longer than 24 hours:</p>\n\n<p><em>“(ii)  Exceptions</em></p>\n\n<p><em>(III) a contract of sale that–</em></p>\n\n<p><em>(cc)  with respect to</em> <strong><em>digital assets</em></strong>*, results in* <strong><em>actual delivery</em></strong> <em>(including  transfer of control over private keys) n</em><strong><em>ot later than 24 hours after the  transaction is entered into</em></strong> <em>and such delivery is accomplished by  either-</em></p>\n\n<p><em>(AA) recording the transaction on the public distributed ledger for the digital asset; or</em></p>\n\n<p><em>(BB)  with respect to digital which are not recorded on a public distributed  ledger for the digital asset, reporting the transaction to a CFTC  registered digital asset trade repository; or”</em> (9)</p>\n\n<p>&#x200B;</p>\n\n<h2>Dodd-Frank Act and Market Transparency</h2>\n\n<p>After  the 2008 financial crisis, the Dodd-Frank Act introduced strict  regulations for swaps. Naturally, these will also apply to digital  assets as well.</p>\n\n<p>The definition of swaps, as provided by the  Commodity Exchange Act (section 1a(47)) is broad. For example, it could  refer to any “agreement, contract or transaction” that “provides for any  purchase, sale, payment, or delivery that is dependent on the  occurrence, nonoccurrence, or the extent of the occurrence of an event  or contingency associated with a potential financial, economic, or  commercial consequence.” (10)</p>\n\n<h2>Next, the Dodd-Frank bill authorizes the CFTC to:</h2>\n\n<ul>\n<li>Regulate  swap dealers by installing capital and margin requirements, require  dealers to meet robust business conduct standards, and meet  recordkeeping and reporting requirements.</li>\n<li>Increase  transparency and improve pricing in the derivatives marketplace by  requiring standardized derivatives to be traded on regulated exchanges  or swap execution facilities and bring better pricing to the market  place and lower costs for businesses and consumers.</li>\n<li>Lower risk to the American public by moving standardized derivatives to central clearinghouses.(11)</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<h2>Digital Asset Trade Repository</h2>\n\n<p>To  meet the above mentioned market transparency requirement, the Commodity  Exchange Act stipulates the need for a digital asset trade repository  to collect information on SWAPS in order to provide the public with the  correct market information:</p>\n\n<p><em>“The  term ‘digital asset trade repository’ means any person that collects and  maintains information or records with respect to transactions or  positions in, or the terms and conditions of, contracts of sale of  digital assets in interstate commerce entered into by third parties  (both on chain public distributed ledger transactions as well as off  chain transactions) for the purpose of providing a centralized  recordkeeping facility for any digital asset, but does not include a  private or public distributed ledger or the operator of either such  ledger unless such private or public distributed ledger or operator  seeks to aggregate/include ‘off chain’ transactions as well.”</em> (12)</p>\n\n<p>&#x200B;</p>\n\n<h2>Interpretation Commodities Regulations:</h2>\n\n<ul>\n<li>As  of writing, only BTC and Ether (and their hard-forks) will be confirmed  as commodities. All other cryptos could potentially be regulated as securities (what this means is explained next).</li>\n<li>The fact that novel technologies such as Bitcoin and Ether are to be  subjected to a large body of law that developed around the trading of  livestock and frozen concentrated orange juice could spell regulatory  uncertainty for various business models in the industry.</li>\n<li>No  “trading on margin” is allowed outside regulated entities, unless done  by high-level investors called “eligible contract parties.” This could  perhaps frustrate particular ideas about decentralized finance or OTC  markets.</li>\n<li>Smart contracts  that take longer than 24 hours to deliver could be considered futures  contracts under the jurisdiction of the CFTC. That smart contracts can  be labeled as futures contracts appears indeed to be the opinion of the  CFTC.(13)</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<h2>&lt;Securities Regulations_</h2>\n\n<p>In  the US, securities are regulated by the 1933 Securities Act.  Additionally, the 1934 Securities Exchange Act further regulates the  trade of securities, and established the SEC to oversee these markets.</p>\n\n<h2>Definition of “Security” Amended to Include Digital Asset Security:</h2>\n\n<p>First  and foremost, Section 3(a)(10) of the Securities Exchange Act will be  amended to include a “digital asset security” (and exclude “digital  assets”) in the definition of security:</p>\n\n<p><em>“(10)</em> <strong><em>The term “security” means</em></strong>  <em>any note, stock, treasury stock, security future, security-based swap,  bond, debenture, certificate of interest or participation in any  profit-sharing agreement or in any oil, gas, or other mineral royalty or  lease, any collateral-trust certificate, preorganization certificate or  subscription, transferable share, investment contract,</em> <strong><em>digital asset security</em></strong>*,  voting-trust certificate, certificate of deposit for a security, any  put, call, straddle, option, or privilege on any security, certificate  of deposit, or group or index of securities (including any interest  therein or based on the value thereof), or any put, call, straddle,  option, or privilege entered into on a national securities exchange  relating to foreign currency, or in general, any instrument commonly  known as a “security”; or any certificate of interest or participation  in, temporary or interim certificate for, receipt for, or warrant or  right to subscribe to or purchase, any of the foregoing;* <strong><em>but shall not include any fiat currency, commodity, digital asset</em></strong>*,  or any note, draft, bill of exchange, or banker’s acceptance which has a  maturity at the time of issuance of not exceeding nine months,  exclusive of days of grace, or any renewal thereof the maturity of which  is likewise limited.”* (14)</p>\n\n<h2>Digital Asset Security Definition</h2>\n\n<p>Next, the Digital Asset Bill (SEC. 101) defines what a digital asset security will be:</p>\n\n<p><em>“(A) IN GENERAL.—The term ‘digital asset security’ means a digital asset that:</em></p>\n\n<p><em>(i) Provides the holder of the digital asset with any of the following rights:</em></p>\n\n<p><em>(I) Equity or debt interest in the issuer.</em></p>\n\n<p><em>(II) Right to profits, interest, or dividend payments from the issuer.</em></p>\n\n<p><em>(III)  Voting rights in the major corporate actions (which shall not include  new block creations, hardforks, or protocol changes related to the  digital asset) of the issuer.</em></p>\n\n<p><em>(IV) Liquidation rights in the event of the issuer’s liquidation.</em></p>\n\n<p><em>(ii)  In the case of an issuer with a service, goods, or platform that is not  wholly operational at the time of issuing such digital asset, with  respect to</em> <strong><em>any fundraising or capital formation activity (including initial coin offerings</em></strong>*)  which is accomplished through the issuance of such a digital asset,  issues such digital asset to a holder in return for money (including  other digital assets) to fund the development of the proposed service,  goods, or platform of the issuer.”* (15)</p>\n\n<p>&#x200B;</p>\n\n<h2>What does it mean to be regulated as a security?</h2>\n\n<p>Investing in securities in the US is regulated to:</p>\n\n<p><em>“protect  interstate commerce, the national credit, the Federal taxing power, to  protect and make more effective the national banking system and Federal  Reserve System, and to insure the maintenance of fair and honest markets  in such transactions.”</em> (16)</p>\n\n<p>Regulations  focus on both the issuing of securities (primary market), and  subsequent trade of such securities (secondary market).</p>\n\n<p>The goal  of securities laws is firstly to require issuers to fully disclose all  material information that an investor would need in order to make up his  or her mind about the potential investment. A regulated company must  create a registration statement, which includes a prospectus, with  copious amounts of information about the security, the company, the  business, including audited financial statements.</p>\n\n<p>Next, the  subsequent selling and trading in these securities is regulated, by  restricting trade to market places over which the regulator has  oversight. The Security Exchange Act section §78l(a) states:</p>\n\n<p><em>“It  shall be unlawful for any member, broker, or dealer to effect any  transaction in any security (other than an exempted security) on a  national securities exchange unless a registration is effective as to  such security for such exchange in accordance with the provisions of  this chapter and the rules and regulations thereunder.”</em> (17)</p>\n\n<p>&#x200B;</p>\n\n<h2>Summary of Securities Regulations:</h2>\n\n<ul>\n<li>Crypto projects will need to be regulated and provide clear financial information for investors to make an informed decision.</li>\n<li>Trading of securities will generally take place on regulated exchanges.</li>\n<li>Any new fundraising or capital formation activity (including ICOs) are likely to be securities.</li>\n<li>When  a crypto is regulated as a security, the entire coin is subject to  strict regulations. In the case of commodities, only specific use cases  (futures) are regulated. It is a big difference.</li>\n<li>US  Congress is taking a leap of faith. It needs identifiable persons to  enforce a law upon. Who is going to be held accountable in a  decentralized network? Many issuing companies have handed control over  to network participants. Perhaps for this reason, Section 12(g) of the  Securities Exchange Act of 1934 will be amended to allow the issuer to  apply for “desecuritization.” (18)  The question remains: who will apply for desecuritization once a  network is decentralized? The investors? Weren’t they the ones supposed  to be protected in the first place?</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<h2>&lt;Changing the Nature of Money_</h2>\n\n<p>These  regulations are not just about crypto. It is clearly part of a wider  discussion on the future of money. As shown below, this bill not only  changes the definition of money in the US, but also changes how money is  created!</p>\n\n<p>As a first, in Section 5312(a)(3)(B) of title 31, US  Code (Money and Finance) digital assets are included as a monetary  instrument.(19)  However, Section 5103, of title 31, US Code will be amended to  specifically exclude digital assets and digital asset securities as  legal tender.(20)  And finally, it is determined that digital assets and digital asset  securities will not be covered by Federal Deposit Insurance (FDIC or  NCUA).(21)</p>\n\n<p>&#x200B;</p>\n\n<h2>Introducing the Digital USD (or Central Bank Digital Currency/CBDC)</h2>\n\n<p>After  slamming the door on digital assets to be used as lawful money, the  Federal Reserve Act is amended to provide the Federal Reserve Board with  far reaching new powers; section 11 will be amended to say:</p>\n\n<p><em>“(d) To supervise and regulate through the Secretary of the Treasury the issue and retirement of Federal Reserve notes (</em><strong><em>both physical and digital</em></strong><em>),  except for the cancellation and destruction, and accounting with  respect to such cancellation and destruction, of notes unfit for  circulation, and to prescribe rules and regulations (</em><strong><em>including appropriate technology</em></strong><em>) under which such notes may be delivered by the Secretary of the Treasury to the Federal Reserve agents applying therefor.”</em> (22)</p>\n\n<p>In addition, Federal Reserve notes will in the future also be issued digitally; an amendment to section 16 confirms this:</p>\n\n<p><em>“Federal  reserve notes, to be issued at the discretion of the Board of Governors  of the Federal Reserve System for the purpose of making advances to  Federal reserve banks through the Federal reserve agents as hereinafter  set forth and for no other purpose, are authorized. Notwithstanding any  other provision of law, the Board of Governors of the Federal Reserve  System is</em> <strong><em>authorized to issue digital versions of Federal reserve notes in addition</em></strong>  <em>to current physical Federal reserve notes. Further, the Board of  Governors of the Federal Reserve System, after consultation with the  Secretary of the Treasury, is</em> <strong><em>authorized to use distributed ledger technology for the creation, distribution and</em></strong> <strong><em>recordation of all transactions</em></strong>  <em>involving digital Federal reserve notes. The said notes shall be  obligations of the United States and shall be considered legal tender  and shall be receivable by all national and member banks and Federal  reserve banks and for all taxes, customs, and other public dues. They  shall be redeemed in lawful money on demand at the Treasury Department  of the United States, in the city of Washington, District of Columbia,  or at any Federal Reserve bank.”</em> (23)</p>\n\n<p>&#x200B;</p>\n\n<h2>Interpretations on the Future of Money:</h2>\n\n<ul>\n<li>The door is shut for the use of cryptos as legal tender.</li>\n<li>The  Federal Reserve Board is to be authorized to create and distribute a  ledger-based Federal reserve note that could be used for everyday  transactions in USD.</li>\n<li>Digital  federal reserve notes will make the “recordation” of all transactions  possible. Did they use this word because “monitoring all transactions”  would be too obvious? Recording all transactions without anyone looking  at them makes no sense.</li>\n<li>These  amendments significantly increase the power of the Federal Reserve.  Contrary to what is widely understood, the Fed does not “print money.”  It can only manage the money supply indirectly.(24)  The private sector “creates” most of what we use as money by issuing  credit. It is with the supply of credit by the private banks that the  monetary supply is inflated. Conversely, with the reduced demand for  credit, the money supply deflates. The Fed is not as powerful as it  wants the market to believe, and the Federal Reserve Act restricts a lot  of its actions. This amendment, however, could drastically expand the  authority of the Fed, by allowing them to create and distribute a  “digital USD” directly. It could change the entire structure of the  financial system and potentially have far reaching consequences.</li>\n<li>The  original idea behind the Federal Reserve was for private bank deposits  to be combined to provide an emergency line of credit in times of  economic stress.(25)  But if the Digital Dollar is based on a blockchain, how can it also be  based on reserves? And what mechanism will determine how funds (and how  much) are added to the economy? And where and how will they be  distributed? What about privacy and security? Will all this authority be  handed over to a board of seven unelected bureaucrats? This amendment  has the potential to change the way the Federal Reserve operates. This  deserves a wider discussion by economists and financial experts outside  the crypto-space as well.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<h2>&lt;International FATF Crypto Regulation Introduced in the US_</h2>\n\n<p>Those  paying attention to international anti-money laundering legislation  know that the following sections from the Digital Asset Bill originate  from guidance issued by the FATF (Financial Action Task Force). FATF is  an intra-governmental organization <a href=\"https://decentralizedlegalsystem.com/fatf-bitcoin-regulations-summary/\">creating financial legislation</a>.</p>\n\n<p>In March, the Paris based FATF issued draft guidance(26)  (“FATF Guidance”) on a number of topics. And even though this guidance  hasn’t been finalized, there are already a number of points directly  included in the Digital Asset Bill.</p>\n\n<p>&#x200B;</p>\n\n<h2>Banning the use of Stablecoins</h2>\n\n<p>Subchapter  I of chapter 51 of subtitle IV of title 31, United States Code,  department of treasury regulation, will be amended, to read as follows:</p>\n\n<p><em>“(a) IN GENERAL.—Beginning on the date of the enactment of this section,</em> <strong><em>no person may issue, use, or permit to be used a digital asset fiat-based stablecoin</em></strong> <em>that is not approved by the Secretary of the Treasury under subsection (b).”</em>(27)</p>\n\n<p>&#x200B;</p>\n\n<h2>Criminalizing the use of privacy coins and anonymizing services (mixers, coinjoins)</h2>\n\n<p>The  bank secrecy act is going to be amended to sanction the use of  anonymity-enhanced convertible virtual currencies and anonymizing  services.(28)  It is worth noting that willful violations of the bank secrecy act  could give rise to a fine of not more than $250,000, or imprisoned for  not more than five years, or both.(29)</p>\n\n<p>&#x200B;</p>\n\n<h2>Introduction of the term Virtual Asset Service Provide (VASP) into US Law</h2>\n\n<p>As  a next step, the term Virtual Asset will be introduced into Section  5312(a) of title 31, United States Code. A Virtual Asset can be a  digital asset, or <em>“a digital representation of value that can be  digitally traded, or transferred, and can be used for payment or  investment purposes;”</em>(30)</p>\n\n<p>So  far we have seen a number of definitions. To understand their  relationship, the following image was made based on the definition of  Virtual Asset according to Section 5312(a) of title 31, United States  Code:(31)</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/j832orezggo71.png?width=502&amp;format=png&amp;auto=webp&amp;s=d357f747bbfddd9db3c997e07953e556fc264ac5\">https://preview.redd.it/j832orezggo71.png?width=502&amp;format=png&amp;auto=webp&amp;s=d357f747bbfddd9db3c997e07953e556fc264ac5</a></p>\n\n<p>&#x200B;</p>\n\n<p>Virtual  Asset is a broad definition; it covers most activities involving  cryptos. We can see in the Digital Asset Bill that entities that are  facilitating transactions in Virtual Assets are to be called “virtual  asset service providers,” or VASPS. Sec 301 of the Digital Asset Bill  defines a VASP:</p>\n\n<p><em>“(A) means a person who—</em></p>\n\n<p><em>(i) exchanges between digital asset and fiat currencies</em></p>\n\n<p><em>(ii) exchanges between digital assets;</em></p>\n\n<p><em>(iii) transfers of digital assets;</em></p>\n\n<p><em>(iv) is responsible for the custody, safekeeping of a digital asset or an instrument that enables control over a digital asset;</em></p>\n\n<p><em>(v) issues or has the authority to redeem a digital asset; and</em></p>\n\n<p><em>(vi) provides financial services related to the offer or sale of a digital asset by a person who issues such digital asset; and</em></p>\n\n<p><em>(B) does not include any person who—</em></p>\n\n<p><em>(i) obtains a digital asset to purchase goods or services for themself;</em></p>\n\n<p><em>(ii) provides communication service or network access services used by a money transmitter; or</em></p>\n\n<p><em>(iii)  develops, creates, or disseminates software designed to be used to  issue a digital asset or facilitate financial activities associated with  a digital asset.”</em> (32)</p>\n\n<p>This  definition comes directly from the FATF Guidance, with the only  difference being that the US excludes the exchange between different  forms of one virtual assets. On the other hand, section (v) is a new  addition.</p>\n\n<p>&#x200B;</p>\n\n<h2>The Big Picture: Global Regulation</h2>\n\n<p>The logic  behind this seems to be to first introduce a high-level definition  (including coins regulated as commodities, securities, and everything in  between). Next, any future global restrictions on the wider  crypto-space can be applied at this level.</p>\n\n<p>From the latest FATF  Guidance, a number of possible additional restrictions can already be  deducted. Things to look out for are the restriction of the use of  “unhosted wallets,” the introduction of the “travel rule,” labeling  those who engage in peer-to-peer transactions as a risk, and a whole  host of other measures. (33)</p>\n\n<p>One  additional aspect of VASP regulation mentioned in the FATF Guidance is  also included in the Digital Asset Bill; VASPS engaged in services which  are available in the United States and to United States persons, have  to be regulated in the United States, even if the provider is located  outside the United States. (34)</p>\n\n<h2>Interpretation International Regulation in the US:</h2>\n\n<ul>\n<li>International AML legislation, created by Paris-based FATF, is being introduced in the US.</li>\n<li>The  FATF term “virtual asset service provider” (VASP) is introduced in the  US. The definition is so broad that it covers practically all crypto  projects.</li>\n<li>After first being  in the FATF Guidance, the banning of stablecoins and anonymity-enhanced  cryptos and the obligation for VASPs to be licensed in the country of  their clients are included in the Digital Asset Bill.</li>\n<li>It  is not hard to imagine that other restrictions for cryptos currently  discussed by FATF, such as the travel rule and restricting unhosted  wallets, will be introduced next. This is not a regulation you introduce  to then never use.</li>\n<li>All VASPs with operating in the US or with US clients need to be regulated in the US.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<h2>&lt;Amendments in the Infrastructure Bill_</h2>\n\n<p>Last  August saw public outcry over the US Infrastructure bill. It included a  section on IRS reporting for crypto. Some highlights:</p>\n\n<h2>Clarification of Definition of Broker</h2>\n\n<p>It  makes sense that the tax authorities use a wide definition to cover all  possible economic activities in crypto. Section 80603 of the  Infrastructure Bill amendments the Internal Revenue Code of 1986,  provides that brokers need to report the activity of their clients to  the IRS and adds the following to the definition of broker:</p>\n\n<p><em>“(D)  any person who (for consideration) is responsible for regularly  providing any service effectuating transfers of digital assets on behalf  of another person.”</em> (35)</p>\n\n<h2>Reporting of Digital Assets</h2>\n\n<p>In addition, a unique wide definition of digital assets is added:</p>\n\n<p><em>“any  digital representation of value which is recorded on a  cryptographically secured distributed ledger or any similar technology  as specified by the Secretary.”</em> (36)</p>\n\n<h2>Effective Date</h2>\n\n<p>Effective after December 31, 2023. So there is time.</p>\n\n<p>&#x200B;</p>\n\n<h2>Interpretation Infrastructure Bill</h2>\n\n<p>There  was a lot of commotion about this bill. This was mainly due to the wide  definitions used, which could cover all activities in the crypto space,  including mining. In response, according to an article on Bloomberg,  the U.S. treasury will shortly issue additional guidance, along the  lines of the following:</p>\n\n<p><em>“Other  firms key to the nearly $2 trillion crypto market — from developers and  miners to hardware and software providers — won’t have any new  requirements, so long as they don’t also act as brokers, according to a  Treasury official”</em> (37)</p>\n\n<p>At  a glance, it appears that this bill is not as invasive as originally  feared. It would also be impossible to enforce this legislation on  miners due to the nature of the technology.</p>\n\n<p>In this case perhaps  it would have been better if clear definitions were used of what is, and  isn’t included. Moreover, comments from “anonymous sources at the  treasury” do not provide real regulatory clarity. This industry too  easily accepts the opinions of officials as decree. But we are all,  including officials, subject to the law. Given that officials change  over time, opinions and guidance are not the way forward; clear laws are  needed.</p>\n\n<p>The commotion also distracted from the massive changes  proposed in the Digital Asset Bill discussed in this post, which so  far have been ignored by the industry...</p>\n\n<p>&#x200B;</p>\n\n<h1>&lt;Sources_</h1>\n\n<p>I added all 37 footnotes here, but the post become to long to post. For those who wish to check the footnotes, they can be found in the PDF version here:</p>\n\n<p><a href=\"https://decentralizedlegalsystem.com/wp-content/uploads/2021/09/Review-US-Digital-Asset-Regulation-September-2021.pdf\">https://decentralizedlegalsystem.com/wp-content/uploads/2021/09/Review-US-Digital-Asset-Regulation-September-2021.pdf</a></p>\n\n<p>&#x200B;</p>\n\n<h1>&lt;TL;DR_</h1>\n\n<p><strong>Next to the infrastructure bill, a new bill was introduced in US Congress: the “Digital Asset Market Structure and Investor Protection Act.” It is not law yet, could still be amended, and if it ever comes into effect it will likely not be this year/cycle. What it says:</strong></p>\n\n<p><strong>Bitcon, Ether, and their hard-forks, are to be regulated as commodities. Smart-contracts taking longer to deliver than 24 hours are considered futures contracts and regulated as such.</strong></p>\n\n<p><strong>Every other project and future ICO is potentially a security; guidance will be issued by CFTC/SEC. Issuers of securities are likely required to provide transparency and financial information to investors. Trade is generally restricted to regulated exchanges.</strong></p>\n\n<p><strong>In addition, international anti-money laundering legislation is introduced in the US; Stablecoins, privacycoins, and mixers are to be prohibited. The high-level term VASP is introduced for almost all crypto projects, possibly to facilitate more future regulations.</strong></p>\n\n<p><strong>Finally, the Federal Reserve gets shocking new powers to create and distribute a central bank digital currency (CBDC), of which all transactions are recorded.</strong></p>\n</div><!-- SC_ON -->",
  "score": 369,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/-a0LgLIBeszRMV_TUCYkc8ebCWTIxqLt0kHV7sPA_fs.jpg?auto=webp&s=7252e7758bacbd5286c774c4b0c4e2450b1abf21",
          "width": 267,
          "height": 400
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/-a0LgLIBeszRMV_TUCYkc8ebCWTIxqLt0kHV7sPA_fs.jpg?width=108&crop=smart&auto=webp&s=076b9eb2ccb0a684edd0de63fd8e785728743f25",
            "width": 108,
            "height": 161
          },
          {
            "url": "https://external-preview.redd.it/-a0LgLIBeszRMV_TUCYkc8ebCWTIxqLt0kHV7sPA_fs.jpg?width=216&crop=smart&auto=webp&s=b0e0318af3637a0cb5180281923032190c0d0b0e",
            "width": 216,
            "height": 323
          }
        ],
        "variants": {},
        "id": "iVBBPZu9UxEcKzfxFSEMAH0NJHalI3ZhsDF2CFdMKQA"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/pr7fow/new_shocking_us_crypto_regulation_far_more/",
  "subreddit": "Bitcoin",
  "id": "pr7fow",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "NEW US CRYPTO REGULATION FAR MORE INVASIVE THAN WE THOUGHT\n\nUS Congress intends to regulate crypto on a level far deeper than currently\nunderstood―They will:\n\n\n\n * Designate Bitcoin, Ether, and their hard-forks as commodities and regulate\n   their transactions accordingly;\n * Create legal…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "米国の新たな暗号規制は、我々が考えていたよりもはるかに侵略的である。\n\n米国議会は、現在理解されているよりもはるかに深いレベルで暗号を規制するつもりだ。\n彼らは次のように考えています。\n\n\n\n * ビットコイン、イーサ、およびそのハードフォークを商品として指定し、それに応じて取引を規制する。\n   ビットコイン、イーサ、およびそれらのハードフォークを商品として指定し、それらの取引を適宜規制する。\n * 法的...",
      "title": "衝撃的な米国の新しい暗号規制は、はるかに侵攻性が高い【デューデリジェンス"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "美国新的加密货币监管远比我们想象的更有侵略性\n\n美国国会打算在比目前更深的层次上监管加密货币。\n他们将。\n\n\n\n * 指定比特币、以太币和它们的硬拷贝为商品，并对它们的交易进行相应的监管。\n   并对其交易进行相应的监管。\n * 创造法律上的...",
      "title": "新的令人震惊的美国加密货币监管措施远具侵略性[尽职调查] 。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "美國新的加密貨幣監管遠比我們想象的更有侵略性\n\n美國國會打算在比目前更深的層次上監管加密貨幣。\n他們將。\n\n\n\n * 指定比特幣、以太幣和它們的硬拷貝爲商品，並對它們的交易進行相應的監管。\n   並對其交易進行相應的監管。\n * 創造法律上的...",
      "title": "新的令人震驚的美國加密貨幣監管措施遠具侵略性[盡職調查] 。"
    }
  ]
}