{
  "data/ph-top/2022/2/bubble-passwordless-auth-plugin-by-sawo.json": "Bubble.ioにパスワードレス認証をシームレスに統合し、コードなしでコンバージョンを54%増加させることができます。SAWOは、生体認証、ベータユーザー認証のサポート、マルチプラットフォームSDKを提供し、規模に応じて認証コストを75%削減することができます。",
  "data/ph-top/2022/2/first-100-users.json": "スタートアップの最初の100ユーザーを獲得する。実行可能なアイデア、明確なケーススタディ、シンプルなステップバイステップの説明。Hey Product Hunt 👋 オリーです。私は、創業者やメーカーが、無関係なインスパイアポルノから解放されて、ステップバイステップのマーケティングアイデアを見つけることができる場所を作りたかったのです。",
  "data/ph-top/2022/2/hera-calendar.json": "アカウントに関係なく、すべてのカレンダーを一か所で管理できます。Heraを離れることなく、イベントのスケジュール、空き時間の共有、一日の計画を立てることができます。タイムゾーンをサポートし、時間を保護する、リモートワーカーのために設計されています。サインアップして、Slackの活気あるコミュニティーに参加しましょう。",
  "data/ph-top/2022/2/gingko-writer.json": "まったく新しい書き方を試してみる。大枠の要約から詳細な散文まで、シームレスに書き進めることができます。カードと呼ばれる小さな「かたまり」で作業することで、より集中力を高めることができます。書きかけの文章を並べ替えることで、流動的に作業することができます。",
  "data/ph-top/2022/2/hugo-calendar.json": "あなたのカレンダー、メモ、タスク。簡単に整理できます。すべて一か所で。Hugoを使用すれば、会議のスケジュール、議題の準備、メモの共有など、チームや他のツールとのつながりを保つことができます。⠀ (Google または Microsoft 365 のアカウントで動作します。)",
  "data/ph-top/2022/2/ango-hub.json": "大規模な自動化とコラボレーションによるデータラベリングのためのオールインワンプラットフォーム。Ango Hubは、自動化とコラボレーションの最良の部分をプラグインベースのアーキテクチャに統合しています。AIによる支援とカスタムプラグインで、すべての非構造化データにアノテーションを付け、管理します。",
  "data/ph-top/2022/2/portant-workflow.json": "あなたの生活からコピー＆ペーストを削除します。〰Google フォームとシートを Docs と Slides に接続すると、チーム固有のニーズに合わせたカスタム ドキュメント ワークフローを作成できます。〰Portant は、仕事の退屈で重要な部分を解決し、楽しいことに集中できるようにします。",
  "data/ph-top/2022/2/tech-blogs.json": "オープンソースの技術系ブログ集。あなたのブログを追加して、記事の閲覧数を増やしましょう。",
  "data/ph-top/2022/2/a11yphant.json": "a11yphantは、開発者にウェブアクセシビリティの基本を教えます。短時間でインタラクティブなコーディングの課題やクイズをこなすことで、段階的に学ぶことができます。",
  "data/ph-top/2022/2/jet-admin.json": "社内ツールや顧客ポータルなどのカスタムビジネスアプリを、コードレスで驚くほど高速に構築できます。ドラッグアンドドロップの UI コンポーネントを使用して、あらゆるデータソースの上に複雑なマルチページアプリケーションを組み立てることができます。",
  "data/ph-top/2022/2/helloguru.json": "AirtableとTableauの出会い! 技術者でない人がデータを理解することを支援します。ユーザーはPostgresからGoogle Sheetsまで100以上のデータソースを組み合わせながら、コードを書くことなくチャートやテーブルを作成することができます。",
  "data/ph-top/2022/2/at-market.json": "at.marketには1000以上のドメイン名があり、あなたが欲しかったEメールを手に入れることができます。2つ目のメールアドレスは現在の受信ボックスを使用するため、すでに持っているメールアドレスと並行して、すべて無料で使用することができます。",
  "data/ph-top/2022/2/fitminder-3.json": "Fitminderは、健康、フィットネス、生産性を向上させ、座りっぱなしの仕事による悪影響を軽減します。長い一日の仕事の後、背中や首の痛みは忘れてしまいましょう Fitminderのエクササイズは、理学療法士との共同作業で生まれました。",
  "data/ph-top/2022/2/cosmo-by-exein.json": "Cosmoは、IoT開発者がデバイスの内部をより深く観察し、脆弱性を一目で理解し、簡単に修正できるようにするために開発されました。",
  "data/ph-top/2022/2/teacher-s-guide-for-english-for-tech.json": "現代の英語教師のための、現代的なツールです。✅技術業界の知識を広げる ✅より需要のある英語教師になる ✅有用なリソース、アクティビティ、ヒント、報酬を得る この教師用ガイドは、English For Techテキストとペアで使用することを想定しています。",
  "data/ph-top/2022/2/beseda-share.json": "1つのトピックで、会議をしない。ブラウザから直接ディスカッションを作成し、リンクを貼って誰でも招待できます。音声、ビデオ、テキストでコラボレーションを行い、終了したら結論でディスカッションを終了させます。チーム、ユーザー、顧客、請負業者とのディスカッションが可能です。",
  "data/ph-top/2022/2/coniun.json": "Coniunは、NFTの世界の参入障壁を下げることを目的としたプラットフォームです。新しいプロジェクトを発見し、NFTを管理できるようにするための分析を提供します。",
  "data/ph-top/2022/2/threadstart.json": "ThreadStartは、Twitterのスレッドを書き、スケジュールし、公開する最も簡単な方法です。リッチエディタを使えば、画像を追加したり、テキストをフォーマットしたりするのも簡単です。また、スレッドのプレビューはリアルタイムで更新されます。ThreadStart で時間を節約し、フォロワーを増やしましょう!",
  "data/ph-top/2022/2/climatiq-emission-tracking-api.json": "ClimatiqはREST APIで排出量計算の自動化を簡単に実現します。科学的に検証されたオープンデータを基にEdgeテクノロジーで構築された高速APIを使用して、貴社のソフトウェアに炭素測定値を組み込むことができます。",
  "data/ph-top/2022/2/resource-center-by-userflow.json": "Userflowの新しいリソースセンターは、ユーザーがアプリ内で直接ヘルプにアクセスできるようにします。リソースセンターはカスタマイズ可能なブロックのリストに拡張され、ユーザーは既存のナレッジベースを検索したり、必要に応じてUserflowフロー/ツアーを検索して開始したりすることが可能です。",
  "data/ph-top/2022/2/devtools-for-tailwind-css.json": "Tailwind CSSのDevToolsは、ブラウザ上でのデザイン、デバッグを復活させます。インテリセンスのオートコンプリート、JITのフルサポート、カスタムコンフィグ。ブラウザから直接操作できます。",
  "data/ph-top/2022/2/special-symbols-by-mumu-x.json": "絵文字や記号を、正確な名称を思い出すことなく選ぶことができます。Mumu Xは、GPT-3を利用した同義語を活用し、あなたの頭の中から思いついたものを元に絵文字や記号を探します。",
  "data/ph-top/2022/2/solana-pay.json": "次世代の加盟店決済のための分散型、安全、オープンソースの決済プロトコル「Solana Pay」をご紹介します。 羽ばたいていくお金。",
  "data/ph-top/2022/2/intergalactic-football.json": "Intergalactic Footballは、自分だけのサッカークラブを所有し、経営することができるゲームです。選手の売買やチームの戦術を設定し、リーグ戦に出場して実際の報酬を獲得することができます。",
  "data/ph-top/2022/2/split-lease.json": "ハイブリッドワークの出現で、ハイブリッドリビングのソリューションが登場。Split Leaseは、毎週特定の曜日や毎月の週を借りて、必要な夜だけ遊ぶことができます。これは、2つ目のアドレスを設定する最も簡単な方法です。",
  "data/ph-top/2022/2/nifty-displays.json": "アクリル製の美しいバックライト付きディスプレイで、NFTのアートワークをリアルに展示。充電式バッテリー、プリント上のNFT情報とQR、交換可能な画像、壁や机の上に飾るための取り付けオプションが備わっています。",
  "data/ph-top/2022/2/automated-finance-tracker-tradingview.json": "家計簿をつけるのは、もう問題ではありません。取引を追加すれば、自動的に残高が更新されます。取引（イン/アウト）を追加し、支払/収入方法を選択すると、計算式がすべてを行います。",
  "data/ph-top/2022/2/contactform-dev.json": "1分でフォームを整えよう。あらゆるタイプのフォームの開発プロセスを簡素化するお手伝いをします。",
  "data/ph-top/2022/2/fundraising-kit.json": "8つのガイド、20以上のテンプレート、30以上のツールなど、ラウンドの調達に必要なものがすべて揃った無料のNotionページです。100以上の創業者インタビューに基づく。300人以上の創業者によってレビューされた👀。",
  "data/ph-top/2022/2/gainy.json": "Gainy は、投資リサーチを民主化し、個人投資家を外出先でプロの金融アナリストに変身させます。🎯 自分の興味に基づいたユニークな投資アイデアを発見することができます。🏦 目標とリスクプロファイルに応じた投資ポートフォリオを管理することができます。",
  "data/ph-top/2022/2/antetype-2.json": "Antetypeは、UXデザイナーのための先進的なプロトタイピングです。レスポンシブなレイアウト、要素の同期、あらゆるインタラクションが可能です。これらの機能により、あなたが作ったプロトタイプは、まるで最終製品のように感じられることでしょう。複雑なプロジェクトでも、ステークホルダーを驚かせることができます。",
  "data/ph-top/2022/2/testsigma-2.json": "Testsigma は、ノーコードでオープンソースのテスト自動化プラットフォームです。ウェブアプリケーション、モバイルアプリケーション、API用のテストを数分で作成できます。セットアップ不要 🏃 平易な英語で5倍速くテストを作成 🔧 AIでメンテナンス不要 🧩 アドオンで楽にプラットフォームを拡張する。",
  "data/ph-top/2022/2/untapped-link.json": "開発者、デザイナー、メーカー、創設者、マーケティング担当者、暗号愛好家にとって興味深い500以上のツールやリソースを厳選し、上位1％を検索します。200時間以上節約できます。40以上の異なるカテゴリ。500以上のツールのデータベース。アクセス、フィルタリング、成長、その他多数。",
  "data/ph-top/2022/2/learnflow.json": "Learnflowは、Webflowのクローンを作るプロジェクトで、人気のNo-codeツールを統合する方法を学ぶための19のステップバイステップの演習で構成されています。Webflowは、そのすべてを接着するためのプラットフォームとして機能します。このプロジェクトは、スポンサーであるWeglot、Crisp、8020、Minimumのおかげで、無料で提供されています。",
  "data/ph-top/2022/2/vidds-2.json": "Viddsはオンラインで素早く簡単にビデオを作成できるツールです。テンプレートや独自のデザインを使って、シーンごとにビデオを作成できます。高速で、柔軟で、効率的です。",
  "data/ph-top/2022/2/alike-health.json": "Alike Healthは、独自のAI、クラウドソーシング、ビッグデータを活用してカルテの力を活用し、パーソナライズドヘルスを実現するデジタルヘルスケアカンパニーです。",
  "data/ph-top/2022/2/humanities-illustrations.json": "Webサイトやアプリに使える、人間味あふれる手描きイラストライブラリ。ウェブサイトやアプリに簡単に組み込める、一風変わったキャラクターの手描き透明PNGイラスト35点を無料配布。暗い背景でも明るい背景でも使えます。",
  "data/ph-top/2022/2/smart-cut.json": "スマートカットは、ビデオの無音部分を自動的に削除し、生の映像を数秒で完全なラフカットに変換することができます。オンラインで動作し、2クリックで完了します。",
  "data/ph-top/2022/2/forms-by-flowdash.json": "魅力的でブランド力のあるフォームをすばやく構築できます。作成したフォームを任意の場所で共有または埋め込み、新規レコードの作成や既存レコードの更新を安全かつ効率的に行えます。さらに、Flowdashのプラットフォームには、タスク管理、自動化、分析、API、Webhooksなどが組み込まれています。",
  "data/ph-top/2022/2/block-protocol.json": "A POWERFUL NEW PROTOCOL FOR DEVELOPERS 構造化データの世界に接続したインタラクティブなブロックを構築して使用する データドリブンなブロックを構築して使用するためのオープンスタンダード。あなたのアプリケーションを人間にも機械にも読みやすいものにします。",
  "data/ph-top/2022/2/subscriptions-on-streamloots.json": "Streamlootsのサブスクリプションを使用すると、ライブストリーマーは、高価な手数料なしで、彼らのコミュニティに一貫してそれらをサポートさせることができます。",
  "data/ph-top/2022/2/pixelme-3.json": "NFTの影響でピクセルアートがトレンドになっている昨今、PixelMeは画力がなくても数クリックで自分だけの8bitプロフィール写真が作れる無料ツールです。また、ランダムでアバターを生成することも可能で、楽しみながら利用できます。",
  "data/ph-top/2022/2/petsjoin.json": "新しいペットに出会って、最高の仲間になる。",
  "data/ph-top/2022/2/sales-consultants-directory-by-close.json": "営業プロセスの構築や最適化が必要ですか？チームを雇う必要がありますか？一貫して優れた取引を成立させるための技術スタックを選択する必要がありますか？100人以上の営業コンサルタントのディレクトリは、詳細なインタビューと豊富なプロフィールで、適切なアドバイザーを見つけるのに役立ちます。",
  "data/ph-top/2022/2/quan.json": "Quanは、エンゲージメント調査とウェルビーイング特典の間のギャップを解消します。ウェルビーイングの問題の根本原因を特定することで、最も効果的な解決策を示し、マネージャーとチームが必要とするサポートを提供します。",
  "data/ph-top/2022/2/seekwise.json": "技術、デザイン、製品など様々な分野の素晴らしいメンターをSeekwise.orgで発見 - 検証済みのメンター - 1対1のセッション - グループセッション - 簡単なスケジュール設定 - セッション後のメモ - レビュー - 無料および有料のセッション - 簡単なオンボーディング",
  "data/ph-top/2022/2/devfolio.json": "devfolio.ioを使えば、手作り感とデザイン性の高いテンプレートに基づいたプロ仕様のポートフォリオウェブサイトを数クリックで作成でき、次の仕事を獲得する可能性を高めることができます。",
  "data/ph-top/2022/2/cal-com-for-web3.json": "昨年のCal.comの壮大なローンチの後、私たちはDAOや他のコミュニティのスケジュール管理のニーズを支援するWeb3アプリケーションで戻ってきました。私たちの使命は、何百万人もの暗号の先駆者を含む「みんなのためのスケジューリング・インフラ」を構築することです。",
  "data/ph-top/2022/2/school-of-kubernetes.json": "School of Kubernetesは100%無料のKubernetesコース、トレーニング、そしてプロのKubernetes開発者になるためのハンズオン知識です。オンデマンドでコンテンツにアクセスでき、クラウドネイティブのキャリアにおいて次のレベルの成長を引き出すことができます。ビルドを開始する 🚀。",
  "data/ph-top/2022/2/aurora-backgrounds.json": "100枚以上の高解像度、オーロラ背景画像。何百もの自然界の感動的な画像から、私たちのお気に入りの素晴らしいオーロラを厳選して作成しました。",
  "data/ph-top/2022/2/bunzz.json": "🛠 GUIを使って数クリックで独自のトークン、NFT、DeFi Dapp、NFT Marketplacesなどを構築 ⚙️ Dapp開発者にとって最高のバックエンドソリューションであると同時に、独自の新しいモジュールをアップロードできる 💻 Bunzz SDKを使ってアプリにweb3機能を統合する。",
  "data/ph-top/2022/2/formfunction.json": "Formfunctionは、インディペンデントアーティストやクリエイターのために作られた、1/1 Solana NFTのマーケットプレイスです。私たちは、クリエイターが環境に悪影響を与えることなく、NFTで生計を立てるためのツール、プラットフォーム、そしてコミュニティを構築しています。",
  "data/ph-top/2022/2/sweatynft.json": "SweatyNFTは、一行のコードも書かずに、最大10Kのジェネレーティブアート作品を簡単に作成し、OpenSeaなどのマーケットプレイスでNFTとして販売することを可能にします。",
  "data/ph-top/2022/2/tagteam.json": "AIはフツーに難しい。私たちのAPIを使えば、4週間でAIソリューションを立ち上げることができます。TagTeamは、非構造化テキストデータのNLP APIを構築します。- 世界トップクラスのAIを搭載。- 簡単かつ迅速に統合できます。- カスタマイズ可能。- 低価格で透明性の高い価格設定。- 完全かつ継続的な管理。",
  "data/ph-top/2022/2/the-one-dao.json": "世界中の匿名の人々の集団が、世界で最も大きく、最も豪華な家を購入する。クラブでのパーティー、ボーリング大会 DAOメンバーが楽しめる21の部屋、年間を通して暗号のイベントを開催。",
  "data/ph-top/2022/2/warwordly.json": "WarWordlyはWordleのようなもので、友人と一緒に単語を推測して競います。英語とスペイン語で利用可能です。",
  "data/ph-top/2022/2/bizarre-travel-app.json": "定番の旅の提案に飽きたら Bizarre Travelは、探検したい、食べたい、眠りたい、そんなあなたのために、奇抜でユニークな場所を探してくれます! 私たちは、あなたの興味、旅行スタイル、予算などに基づいて場所をお勧めします。クッキーカットのようなものはありません。",
  "data/ph-top/2022/2/wunderbucket-2.json": "ローカルフォルダをWebサイトに コマンドラインや設定なしで、高速で安全なWebサイトを求めるデザイナーや開発者向けです。Dropboxにかわいい静的ホスティングサービスが誕生したようなものです。",
  "data/ph-top/2022/2/reaktr.json": "Reaktrは、美しいオーディオビジュアライゼーションビデオを簡単に作成する方法です。音楽と背景の画像や動画を選ぶだけで、Reaktrがそれらをミックスし、音声に反応するビジュアライゼーションが行われます。",
  "data/ph-top/2022/2/create-app.json": "webpack、Parcel、snowpackで新しいフロントエンドプロジェクトを超速でセットアップします。Reactやsvelteなどのメインライブラリ、テストツール、UIライブラリを選び、生成された設定をブラウザで即座に確認することができます。プロジェクトが入ったzipをダウンロードして、ハッキングを始めましょう!",
  "data/ph-top/2022/2/exnge.json": "非常に簡単なノーコードインターフェースを使って市場価値を予測する独自のニューラルネットワークを作成し、一貫して市場を打ち負かす最大の分散型AIを私たちと一緒に作りましょう。または、私たちが公表している予測を閲覧するだけでも構いません...",
  "data/ph-top/2022/2/podify-for-spotify.json": "Spotifyのポッドキャストを音楽と切り離して楽しみたい、ポッドキャスト流に整理したい？それならPodifyはあなたのためにあります。PodifyはあなたのPodcastをシンプルな方法で整理するツールを提供し、あなたが聴きたい次のエピソードを見つけるのを助けてくれます。",
  "data/ph-top/2022/2/t-drive.json": "電報を無制限のファイルストレージとして利用し、データの保護はそのままに、利便性を大幅に向上させることができます。無料、無制限、広告なし。",
  "data/ph-top/2022/2/extension-manager.json": "Chromeブラウザの拡張機能の有効化・無効化は、あまり簡単ではありません。私たちはいつもちょっとしたUXの課題に直面しています。この拡張機能は、クローム拡張機能管理ユーティリティへの素早いアクセスを提供します。",
  "data/ph-top/2022/2/adoptics.json": "AdOpticsは、広告主が多数のキャンペーンや広告グループにわたって広告を大規模にテストできるGoogle広告のための広告A/Bテストプラットフォームです。",
  "data/ph-top/2022/2/medusa.json": "Medusaは、オープンソースのヘッドレス・コマース・プラットフォームです。私たちのビルディングブロックを使って、好きなようにセットアップをカスタマイズしてください。決済、CMS、配送、分析など、プラグインプレイで簡単にセットアップが可能です。- コマーススタックのオーナーシップを持つ",
  "data/ph-top/2022/2/appmaster-io.json": "ネイティブWebアプリケーションやモバイルアプリケーションの構築、ビジネスプロセスの自動化、スケーラブルなバックエンドのセットアップのためのオールインワンのノーコードプラットフォームです。ドラッグ＆ドロップのインターフェースですぐに使えるアプリケーションを構築し、任意のクラウドに配備したり、オフラインで実行したり、ソースコードをエクスポートしたりできます。",
  "data/ph-top/2022/2/paz-for-startups.json": "インドのアーリーステージのスタートアップ企業で、従業員や事業に保険をかけたいと考えているなら、Paz for Startupsは最もシンプルな方法です。従業員やビジネスのニーズに合わせて、保険プランをカスタム設計し、初日から利用することができます。",
  "data/ph-top/2022/2/elon-sh-tposts-quiz.json": "あなたはそのsh*tpostの臭いを嗅ぐことができますか？15の質問で、あなたのsh*tpost検出能力をテストします。出演は、あのイーロン。",
  "data/ph-top/2022/2/meetrecord.json": "顧客獲得は難しく、顧客維持はさらに難しい。顧客との出会いは、見逃しがちなインサイトに満ちています。MeetRecordは、カスタマーサクセスチームがミーティングから深い洞察を得て、顧客維持を促進し、アップセルの機会を見出すことを支援します。",
  "data/ph-top/2022/2/tollguru-toll-intelligence.json": "通行料 燃料 トリップの最適化 TollGuruでトリップの意思決定をコスト・インテリジェントにしましょう。フリート、OEM、MaaSプロバイダーは、トリップ前のコストと時間のトレードオフ、トリップ中の通行料アラート、トリップ後の通行料請求に弊社のAPIを使用しています。",
  "data/ph-top/2022/2/mixr-2.json": "Mixrは、ビデオチャット、アーケードゲーム、会話のきっかけ、自動ブレイクアウトルームを備えたバーチャルゲームトーナメントを遠隔地のチームが開催することができるソーシャルプラットフォームです。社員は、全社的なリーダーボードに向けてトロフィーを獲得しながら、交流を深めることができます。",
  "data/ph-top/2022/2/email-warmup-by-salesblink.json": "メールの到達率を高め、スパムフィルターに引っかからないようにするための自動メールウォームアップツールです。実際のアカウントからメールを送受信し、完全に自動化され、常にボックスに着信します。",
  "data/ph-top/2022/2/dashworks.json": "Dashworksは仕事のスタートページです。チーム内の情報、コレクション、FAQ、会社のニュースなど、さまざまな情報を見ることができます。ブラウザの新しいタブに設定すれば、いつでもキープレスでアクセスできます。",
  "data/ph-top/2022/2/gostret-ch-boost-productivity.json": "Go Stretchは、反復性ストレス障害の症状を改善・予防するための素早い休憩を促す、無料のオンラインツールです。仕事をするように、自分自身をケアすることができます。15分ごとに30秒の小休憩、1時間ごとに10mの休憩をリマインドしてくれます。",
  "data/ph-top/2022/2/purelist-pro.json": "Purelistは、あなたの生活に役立つシンプルなリストアプリです。ToDo、メモ、リマインダーなど、すべてこのアプリだけで可能です。シンプルで最小限のインターフェースで、使い方を覚える必要はありません。",
  "data/ph-top/2022/2/abstractops.json": "スケーリングスタートアップの管理業務を効率化し、プロダクトと顧客に集中できるようにします。人事、財務、法務、コンプライアンスなど数十のシステムに散在するデータとワークフローを一元化します。経験豊富なオペレーターによる指導のもと、単一プラットフォームで会社を運営することができます。",
  "data/ph-top/2022/2/spurr.json": "Spurrを使えば、画面から離れて、タイムゾーンを越えて、チームで協力しながらチャレンジすることができます。1,000マイルを一緒に走ったり、10,000回の腕立て伏せをしたり、あなたの創造力を発揮して、チームのためにオリジナルのチャレンジを作りましょう。",
  "data/ph-top/2022/2/simplified-ai-writer.json": "SimplifiedのAIライターで、1つのアプリでマーケティングをスケールアップ。広告、キャプション、引用文などのコピーを瞬時に生成します。ブログ、書籍などの長文コンテンツを数分で作成できます。スピード感のあるコンテンツワークフローをチーム内で構築できます。マジック？いいえ、そうではありません。単純化されています。",
  "data/ph-top/2022/2/frase-2-0.json": "高品質なSEOコンテンツの調査、執筆、最適化を数時間ではなく、数分で行うことができます。ボタンをクリックするだけでコンバージョン率の高いコピーを生成するAI Writerを搭載し、アップデートされました。",
  "data/ph-top/2022/2/tooljet-2.json": "ToolJetは、社内ツールや業務アプリケーションを構築・展開するためのオープンソースのローコードフレームワークです。ToolJetは、Retool、Mendix、Microsoft Power Apps、Outsystemsに代わるオープンソースのフレームワークです。",
  "data/ph-top/2022/2/growth-manager-workspace.json": "Canva、Gather.Town、InVideoなど、ゼロから6ヶ月足らずの間に様々な企業と連携し、Toplyneの成長を支えた成長ワークスペースがここにあります。",
  "data/ph-top/2022/2/clay-8.json": "Clayで人と企業の生きたデータセットを発見し、充実させ、行動することができます。手作業を減らし、Upworkへの依存を減らし、エンジニアリングの時間を美しい製品に集中させることができます。今日から、無料で始めましょう。",
  "data/ph-top/2022/2/respona.json": "レスポナで質の高いバックリンクを構築し、ウェブサイトのオーガニックトラフィックを新たな高みへと導きましょう。関連するアウトリーチの機会を見つけ、適切な人の連絡先を取得し、パーソナライズされた電子メールシーケンスを数分で送信することができます。",
  "data/ph-top/2022/2/email-stash.json": "Email Stashは、すべてのメールマーケティング担当者のためのワンストップリソースハブで、📚 ニュースレター、電子書籍、ブログ、ポッドキャスト、ビデオ📃 メールマーケティングツールと代理店🤝 コミュニティとエキスパートによるネットワーク拡大が含まれています。",
  "data/ph-top/2022/2/praisio.json": "大企業から中小企業まで、クドカン（PET）の送信や構造化されたフィードバックを簡単かつ楽しく行えるプラットフォームです。すべてのPETは会社のタイムラインに表示され、継続的にポジティブな話題を提供し、人事やマネジメントのために社会性などの図表やデータを提供します。",
  "data/ph-top/2022/2/regex-library.json": "最も一般的に使用される正規表現を、様々なプログラミング言語でのコード例とともに紹介します。JavaScript、Python、Java、C#、PHP。",
  "data/ph-top/2022/2/path-chooser.json": "たった4つのパラメータで、2つの可能な経路を選択。",
  "data/ph-top/2022/2/kissflow-community-platform.json": "Kissflowコミュニティ・プラットフォームは、1.コミュニティ管理 - Spaces、Conversations、Events、Members Directory 2.コミュニティ管理 - Space、Conversations、Events、Members Directoryをサポートすることに重点を置いています。タスク管理 - バックオフィスによる管理 3. コミュニティ・エンゲージメントの向上 - サービスとしてのコミュニティ・スペシャリストの提供",
  "data/ph-top/2022/2/newsletter-glue-2-0.json": "ブログを書くところにニュースレターを書く。Newsletter Glueは、WordPressの中にあるニュースレター発行プラットフォームです。ブロガー、出版社、ビジネスオーナー、会員制サイト、ニュースルームなど、ニュースレターをより安定的かつ迅速に発行したい人向けです。",
  "data/ph-top/2022/2/stately-editor-beta.json": "Stately Editorは、どんなに複雑なアプリケーションロジックやワークフローでも、作成、編集、シミュレーションが可能なビジュアルツールです。",
  "data/ph-top/2022/2/spinach-io.json": "⏲スタンドアップの時間を半分に短縮 🎯よりシャープなアップデートを取得 🔎進捗状況とブロッカーを確認 🥬より健康でハッピーなミーティングを導く。",
  "data/ph-top/2022/2/five-cents.json": "Five Centsは、あなたの支出や収入を記録するのに役立ちます。新しいエントリを追加するには、プルダウンして、定期的に洞察を確認し、正しい意思決定を行います。",
  "data/ph-top/2022/2/birthday-app.json": "友達の誕生日を持って、FACEBOOKから永遠におさらば。誕生日アプリは、あなたの連絡先や友人の誕生日をすべて見つけ出し、カレンダーを作成します。あなたは指一本動かす必要はありません。",
  "data/ph-top/2022/2/placement-boards.json": "自動化されたジョブボードを自分で作ることができます。無料で。会社別、地域別、職種別、リモートなど、さまざまな設定が可能です。一度設定すれば、あなたのジョブボードには自動的に最も新鮮な求人情報が取り込まれます。ポートフォリオ、パートナーネットワーク、ドリームカンパニーなど、様々なプロモーションが可能です。",
  "data/ph-top/2022/2/effortlessly.json": "⚡️ キャッチーな広告インスピレーションコンテンツを入手（厳選された、深いフィルターにかかった広告例） 🚩 クリエイティブコンセプトで広告をフィルター（例：アンボックス、eBook） 📐 適切なメタパラメータ（例：サイズ、フォーマット、カラー） 💡&nbsp;Style featureで新鮮な視覚化アイデアを発見する。",
  "data/ph-top/2022/2/devtools-tech.json": "Devtools Techは、実際の面接問題の練習、コースの視聴、ブログの閲覧、コミュニティへの参加、様々なドメインやトピックでの進捗の確認など、エンジニアが学び、改善し、成長するためのプラットフォームです。",
  "data/ph-top/2022/2/creatorclub.json": "クラウドファンディング、eコマース、そしてその先を利用した革新的な物理的製品ビジネスを立ち上げ、成長させるためのスタートアップのための初のコミュニティベースおよびeラーニングプラットフォームです! 2月14日まで新規クリエイターを募集しています。",
  "data/ph-top/2022/2/maze-clips.json": "クリップは、ライブのモデレートされたリサーチセッションを実行することなく、ユーザビリティタスクのビデオやスクリーンレコーディングをキャプチャする最も簡単な方法です。Mazeのメトリクスにヒューマン・コンテクストを導入し、短時間で見やすい録画にすることができます。",
  "data/ph-top/2022/2/notion-freelancer-os.json": "Notionでフリーランスのビジネスを管理し、成長させるためのオールインワン・オペレーティング・システム。",
  "data/ph-top/2022/2/twik-2.json": "Twikは買い物客を理解し、その意図を予測する。自律的なパーソナライゼーションにより、買い物客が本当に欲しい商品を提示し、売上を伸ばします。Twikは、各ユーザーにユニークな体験を提供します。- 設定やメンテナンスは必要ありません。",
  "data/ph-top/2022/2/fantastical-scheduling.json": "空き時間を使ってFantasticalのリンクを作成・共有し、他の人があなたのスケジュールに合わせてミーティングを予約できるようにします。提案] を使用して、複数の日時を選択し、Fantastical リンクを共有し、他の人が皆に適した会議を投票できるようにします。",
  "data/ph-top/2022/2/community-masters.json": "コミュニティ・マスターズは、377ページに及ぶコミュニティ構築のための無料ガイドです。私たち自身の経験から、Discordサーバーを5万人のメンバーに拡大し、独自のコミュニティアプリを12万人のメンバーと2200のコミュニティに構築しました。",
  "data/ph-top/2022/2/rosita-longevity.json": "欧米諸国の平均寿命は85歳ですが、健康寿命はわずか65歳です:( 私たちは、高齢者の49％に影響を与え、将来の依存症を引き起こす静かな疫病である痛みと虚弱を引き起こす慢性疾患を予防することによって、60歳以上の愛する人の健康寿命の延長を支援します。",
  "data/ph-top/2022/2/q-by-substrata.json": "Qは、B2Bセールスのためのメールコミュニケーションの天才です。数百万件のデータから、見込み客の状況を「行間を読む」ことで把握し、次に取るべき行動を導き、商談成立の可能性を高めます。",
  "data/ph-top/2022/2/recall-7.json": "リコールは、映画やレシピ、最新の暗号など、あなたが興味を持ち、情報を得たいと思う話題について知識を蓄えることに焦点を当てたメモ帳ツールです。ぜひご覧ください👉 https://www.recall.wiki/",
  "data/ph-top/2022/2/looksmutable.json": "ダイヤモンドは永遠だ。ほとんどのNFTはそうではありません。そのため、一部のNFTは、事前の通知なく、また、あなたがいくら支払ったとしても、あなたの許可なく、いつでも外観を変更したり、広告を追加したり、存在を停止したりする可能性があるという秘密が隠されているのです。",
  "data/ph-top/2022/2/duffel-payments.json": "Duffel Paymentsを使って、簡単に航空券を販売しましょう。セキュリティと信頼性の高いStripeとの提携により、当社のAPIを通じて顧客に直接請求することができます。長い承認や初期費用を省き、数分でセットアップから販売まで行えます。",
  "data/ph-top/2022/2/lucky-orange-2.json": "Lucky Orangeのコンバージョン率最適化ツールキットで、ウェブサイト訪問者の顧客化を妨げているものを確認することができます。世界中の30万以上のウェブサイトから信頼されているツールで、訪問者の行動を調査します。",
  "data/ph-top/2022/2/okrs-templates.json": "目標設定に苦労していませんか？テーマや機能別に整理された数多くのOKRテンプレートから、インスピレーションを得てください。気に入ったものが見つかったら、Tabilityを使って数クリックでトラッキングを開始できます。",
  "data/ph-top/2022/2/rebel-girls.json": "Rebel Girlsは、世界各国や歴史上の女性たちの冒険や功績を描いたオーディオストーリーで満たされており、あらゆるリスナーを楽しませ、鼓舞し、自信を持たせるように設計されています。",
  "data/ph-top/2022/2/pay-later-by-interviewing-io.json": "Google、Facebookなど一流企業のエンジニアによる匿名模擬面接。アルゴリズムやシステム設計の問題を解決し、一流企業への転職を実現します。就職が決まるまでお金はかかりません。",
  "data/ph-top/2022/2/sets-3.json": "Setsは、コミュニティポータルを作成するSlackのアドオンです。その特徴は メンバーが同じような興味を持つ人を見つけるためのシンプルなプロフィール メンバーがリソースを共有するためのWiki コミュニティに最新情報を提供するためのイベントカレンダー",
  "data/ph-top/2022/2/strac.json": "Stracは、SSN、運転免許証、パスポート、銀行明細書、納税証明書、医療記録など、機密性の高い顧客データを電子メールから削除するビジネスを支援します。メールに保存されていないデータは盗まれないので、コンプライアンス監査に見事に合格することができます。",
  "data/ph-top/2022/2/nyckel.json": "機械学習チームを雇用することなく、また高価なMLインフラを使用することなく、製品にAIを組み込むことができます。5分でモデルを学習し、10分でアプリケーションに統合できます。Nyckelの直感的なUIとAPIが、重い仕事をすべてやってくれます。",
  "data/ph-top/2022/2/qvault-3.json": "そのため、さまざまなプログラミングコースに手を出し、ブートキャンプにも参加したことがあるかもしれません。しかし、残念ながら、あなたと次の開発者の間には、まだ何かが立ちはだかっています。私たちのコースとプロジェクトは、あなたの足かせとなっている知識のギャップを埋めてくれるでしょう。",
  "data/ph-top/2022/2/sourcegraph-for-vs-code.json": "Sourcegraph for VS Codeは、200万以上のオープンソースリポジトリのインデックスをIDEから直接検索することができる拡張機能です。VS Codeを離れることなく、サンプルコードを素早く見つけ、依存しているすべてのオープンソースライブラリをナビゲートすることができます。",
  "data/ph-top/2022/2/mesh-6.json": "https://morflax.com/mesh、わずか数秒で素晴らしい3Dイラストをデザインすることができます。200以上のアイコンと既成のテンプレートでビジュアルコンテンツを作成します。要素をドラッグ＆ドロップし、変換、カスタマイズして、ブラウザで直接画像をダウンロードできます。",
  "data/ph-top/2022/2/linshare.json": "LinShareは、Google Driveの代替となるオープンソースのソフトウェアです。GDPRに完全準拠した、プライベートで安全なファイル共有とクラウドストレージソリューションです。EUで製造され、ホストされています。",
  "data/ph-top/2022/2/gluu.json": "Gluuは、知識の取り込みを非常に簡単にします。記録をクリックするだけで、あとは私たちにお任せください。撮影したワークフローをお好みのフォーマットでステップバイステップで共有できます。ビデオでも、ドキュメントでも、スライドでも。Gluuをあなたの個人的なドキュメント作成チームとして考えてみてください。",
  "data/ph-top/2022/2/figma-and-figjam-plugin-by-icons8.json": "アイコンや写真、イラストなど、高品質で統一感のあるグラフィックの最大セットをワンクリックで無料入手できます。もう、キャンバスとグラフィックストックの間を行き来する必要はありません。あなたと、あなたの完璧なワークフローだけです。",
  "data/ph-top/2022/2/nft-guard.json": "究極の消費者保護企業「Fakespot」の開発者より。NFT Guard Chrome拡張機能は、OpenSea上の詐欺的なNFTコレクションや、あなたの財布とコインを盗もうとする詐欺的なNFTミントサイトからあなたを保護します。",
  "data/ph-top/2022/2/norm-model-b-desk.json": "これは、より良い健康的な仕事をするための曲面石造りのデスク「Norm Model B」です。ワイヤーを使わずにデバイスに電源を供給し、姿勢を記録し、決してぐらつくことはありません。今ならKickstarterで-30％オフの899ドルから購入できます。",
  "data/ph-top/2022/2/figmeme-1.json": "このプラグインを使えば、Figmaを使いながら、ミームを発見し、デザインし、議論することができます。さまざまなジャンルのミームを探したり、クリエイティブなキャプションでミームをカスタマイズしたり、Figmaファイルを快適に使用することができます。これはジョークですか？いいえ、Figmemeは100％無料で使用できます。",
  "data/ph-top/2022/2/emailkick.json": "Emailkickは、Amazon SESのために構築された開発者向けのメールAPIプラットフォームです。チームは、No-codeドラッグ＆ドロップエディタを使用してメールデザインを作成し、テンプレートを一箇所に保存することができます。APIを使用して、請求書やウェルカムメールなどのダイナミックなメールを送信することができます。",
  "data/ph-top/2022/2/x2y2-nft-marketplace.json": "人々による、人々のための、新しいNFTマーケットプレイスです。インスタントプッシュ通知、一括取引、コレクション＆トレードオファー、統合レアリティツール、包括的なコミュニティエアドロップ、NFTステーキング、2%の取引手数料など。OpenSeaとLooksRareに挑戦!",
  "data/ph-top/2022/2/hrblade.json": "AIとアセスメントによる動画面接ソフトとデジタル採用プラットフォーム。より良い社員をより早く採用する。採用活動にかかる時間とコストを削減。5 分で最初の自動採用キャンペーンを開始できます。",
  "data/ph-top/2022/2/dialogtrail.json": "eコマースのためのガイド付き販売プラットフォーム。Webサイトのパーソナライゼーションを実店舗並みにレベルアップし、訪問者のニーズに応じた商品アドバイスを提供します。DialogtrailのビジュアルUIと分析機能により、ガイド体験の最適化が簡単にできます。",
  "data/ph-top/2022/2/imagematting-com-beta.json": "国内No.1の背景除去サービスが開発したAIツールでシャープなエッジをキープ ・数百万枚の手動処理写真で学習させたAI ・シンプルな背景の写真に最適 ・被写体がはっきりしないスナップ写真や背景がテクスチャーのものは不得意",
  "data/ph-top/2022/2/figment-2.json": "Figmentは、Figmaのデザインに、動画、リンク、アニメーションなど、Webサイトの効果を加えるお手伝いをします。また、Web サイトのコードを簡単に公開またはエクスポートできるため、プロジェクトを迅速に進めることができます。",
  "data/ph-top/2022/2/ohmylead-2.json": "OhMyLeadはリード管理の時間を短縮します ⚙️ あらゆるリードソースを一箇所に統合（400の統合） ✅ 受信したリードをすべて検証 🔥 どのキャンペーンが最も品質を生み出すかを特定 💙 営業に適したリードだけをCRMに送信します。",
  "data/ph-top/2022/2/onboard-7.json": "Onboardは、顧客志向のチームが顧客獲得プロセスを自動化、管理、合理化できるよう支援します。",
  "data/ph-top/2022/2/pesto.json": "ペストは、デジタルネイティブで、本物の人間らしい職場です。アバターを設定する：ビデオミートに代わる、より疲労の少ない、よりカスタマイズ可能な部屋：深い仕事のためのローファイ・ルーム、幸せな時間のためのゲーム・ルームなど",
  "data/ph-top/2022/2/conduit-4.json": "Conduitは、ソフトウェアエンジニアのためのデータ統合ツールです。拡張性の高い、イベントファーストのストリーミングデータツールです。Go で書かれており、最小限の依存関係で出荷され、バイナリとしてデプロイされます。",
  "data/ph-top/2022/2/kraftful-analytics.json": "Kraftfulは、デバイスを制御するアプリのための製品分析プラットフォームです。📊 ユーザーがどのようにデバイスに接続し、使用しているかなど、主要な指標を追跡します。🚶🏻♀️ ユーザージャーニーとドロップオフを理解することができます。💡 IoTアプリを愉快にする方法を学びます。✅ 箱から出してすぐに使える。",
  "data/ph-top/2022/2/dost-for-slack.json": "Dost（トーストのような発音）とは、友達という意味です。Dost for Slackは、Slackで安全で包括的なメッセージを作成することを支援するAIアシスタントです。Dostは、メッセージ内のマイクロアグレッションと毒性を検出し、送信者を教育し、是正措置を取るように促します。",
  "data/ph-top/2022/2/boltic.json": "Bolticは、複数のソースからのデータを接続し、変換し、目的の宛先に送信することで、ユーザーが複雑なデータ問題を解決し、ワークフローを自動化し、大規模なレポートを構築・共有できるよう支援します。Bolticは1M行まで無料でご利用いただけます。",
  "data/ph-top/2022/2/dropspace.json": "Dropspaceは、コレクターが購入し、クリエイターがNFTコレクションを作成できるNFTコミュニティが組み込まれた、誰にでも開かれたNFT Mintingプラットフォームです。",
  "data/ph-top/2022/2/candu-3.json": "Canduのドラッグ＆ドロップインターフェースは、CSMやPMを運転席に座らせ、コードを書かずに美しいUIを構築することを可能にします。これにより、顧客を最もよく理解しているチームが、顧客が喜ぶユーザー体験をデザインできるようになります。",
  "data/ph-top/2022/2/wordlemail.json": "Wordlemail は、あなたのお気に入りの単語ゲームをメールでお届けします 🟩 毎日、受信トレイに毎日の Wordle をお届けします 🟩 リダイレクトなしでメール内で Wordle をプレイできます 🟩 あなたのスコアをメール内で取得し、共有することができます",
  "data/ph-top/2022/2/ditto-insurance.json": "Ditto Insuranceは、ミレニアル世代のために作られた新時代の保険プラットフォームで、保険をシンプルにし、市場で最高のプランを購入できるようにします。無料相談、ノー・スパム方針、誠実なアドバイスにより、実際にあなたのことを心配している専門家と話をすることができます。",
  "data/ph-top/2022/2/rewardoo.json": "Rewardooは、クリエイターの収益力を高めるために作られたプラットフォームで、クリエイターは自分のプロモーションキャンペーンのコンテンツとオーディエンスを一箇所で直接つなげることができます。リンクは1つ。3つの簡単なステップで、あなただけのキャンペーンサイトを構築することができます。無料です。",
  "data/ph-top/2022/2/youtube-notetaker.json": "YouTubeで何かを独学しようとしたことがある人なら、そのプロセスがいかに苛立たしいものかを知っているはずです。私たちのメモ帳はそれを変えます。メモを取り、アクションアイテムを作成し、終わったらNotionやTrelloと同期してください。",
  "data/ph-top/2022/2/150-developer-tools.json": "ここでは、あなたの生活をもっともっと楽にしてくれる素晴らしいツール/リソースをご紹介します！何時間もかけて研究する必要はありません。特典：- ⭐ 100時間以上の時間を節約 ⭐ 各ツールの詳細説明＋リンク ⭐ 生涯アクセス これらのツール/リソースを探索することをお楽しみください",
  "data/ph-top/2022/2/anja-stem-cell-collection-kit.json": "バースバッグに最適なキット🤰💫です。看護師や助産師が回収＆ピックアップチームがアンニャのラボに転送します。臍帯血幹細胞は、心臓病、肝臓病、癌、1型糖尿病などの治療に使用できる可能性があります。",
  "data/ph-top/2022/2/edgewall.json": "Edgewallは、取引に必要な主要なリサーチデータとともに、リアルタイムの取引アラートを提供します。当社のアルゴリズムは、取引時間の延長中に市場（NYSE、NASDAQ、AMEX）をスクリーニングするので、トレーダーは機会が発生する前、または発生した時にその機会を利用することができます。",
  "data/ph-top/2022/2/wordict.json": "ライブ映像の中にリアルタイムでインタラクティブなゲームを組み込むことで、魅力的でバイラルな放送を実現します。ゲームの主な目的は、5文字の単語を推測することです。スコアは自動的に計算され、ライブフィードにリアルタイムで表示されます。",
  "data/ph-top/2022/2/baby-bonds.json": "Baby Bondsは、親が子供のためにシンプルで安全なランディングページを作成し、友人や大切な人が1回限りまたは定期的な寄付を設定することができます。これらの寄付は、米国の貯蓄債券として処理され、子供たちに送金されます。",
  "data/ph-top/2022/2/circular-0d0ab6cb-e151-4eea-ba98-348a1da0cedb.json": "Circularは、Instagramのカルーセル投稿の無料テンプレート、アイコン、アセットを集めたものです。",
  "data/ph-top/2022/2/contentbees.json": "リードを顧客化するための適切な第三者コンテンツを探し出し、配信する。コンテンツは王様です。Contentbeesは、理想の顧客とつながるために必要なコンテンツを見つけ、整理し、作成するお手伝いをします。",
  "data/ph-top/2022/2/top-shopify-apps-for-new-stores.json": "Shopifyには、あなたのストアと連動するツールの素晴らしいマーケットプレイスがあります。しかし、あまりの選択肢の多さに迷ってしまいがちです。このディレクトリでは、あなたのストアを始めるのに役立つツールを紹介しています。",
  "data/ph-top/2022/2/simple-ink.json": "ノーコードはもっとシンプルであるべきだ。Simple.inkは、NotionのページをWebサイトに変えます。- 10秒で完了 - 豊富な無料プラン - ノーコード - 無料 - 最も重要なこと：頭痛ゼロのために最適化されています。",
  "data/ph-top/2022/2/heartmail.json": "バレンタインデーが近づいてきました。なぜカップルだけが楽しめなければならないのでしょうか？HeartMailでは、インターネット上の人々から心のこもったバレンタイン・レターを受け取ることができます。",
  "data/ph-top/2022/2/micro-crm-for-gmail.json": "受信トレイに直接プライベートなメモを書き込める、Gmailベースの軽量なCRMです。",
  "data/ph-top/2022/2/wenpay-me.json": "WenPayは、暗号通貨で支払うべき支払いリクエストを簡単に送信できるようにします。支払いリクエストを作成し、送信し、追跡することができます。100％無料で使用できます。",
  "data/ph-top/2022/2/lo-fi-generator.json": "このローファイなトラックジェネレータは、コード進行、メロディ、ベースライン、ビートとフィル、曲の構成、エフェクトチェーン、アンビエンスなどのパラメータをランダムに生成し、楽器、テンポ、キーも切り替えることが可能です。",
  "data/ph-top/2022/2/brainsight.json": "ブレインサイトは、実際の人間をテストすることなく、94％の精度でターゲット層のアテンションを予測します。検証を行い、コストのかかるミスを防ぎます。最適化し、競合を出し抜きます。",
  "data/ph-top/2022/2/voicl-2-0.json": "Webサイトに音声ウィジェットを追加するためのノーコードツールです。ユーザーは、顧客と直接会話したり、顧客から音声フィードバックを受けたりすることができ、コンバージョンやウェブサイトのエンゲージメントを高め、ビジネスを向上させるのに役立ちます。新機能：スマートエンベッド技術",
  "data/ph-top/2022/2/nftbucket.json": "Nftbucketは、Solanaエコシステムの人々が、自分のNFTを掲載できる自分だけのギャラリーを作ることができます。ページのルック＆フィールをカスタマイズすることが可能です。",
  "data/ph-top/2022/2/google-maps-scraper-by-outscraper.json": "Google Maps Scraperは、Google Mapsからすべての企業をCSV/Excelファイルにエクスポートすることができます。",
  "data/ph-top/2022/2/nimble-3f98404e-0b81-476e-9104-1a6fa6da9350.json": "Nimbleは、ビジュアルなオンラインコードエディタです。現在、Tailwind CSSをサポートしており、将来的にはBootstrap、Bulma、Material-UIなどの人気ライブラリもサポートする予定です。HTML要素を利用できるのが特徴で、コンポーネントをより速く構築するのに役立ちます。",
  "data/ph-top/2022/2/stickerx.json": "こんにちは、私はCloudStickerというアプリの開発者です。私はMenuBarXというプログラムに出会い、ステッカーとブラウザを組み合わせることにインスピレーションを受け、この新しいプログラムを開発しました。私は本当にStickerXを作成するプロセスを楽しんで、あなたがそれを使用するときにも楽しむことができます願っています❤️。",
  "data/ph-top/2022/2/react-and-next-js-snippets.json": "これは、多くのReactとNext.jsのスニペットをtypescriptサポートで提供するVisual Studio Code拡張で、何度も同じコードを書き直す必要がありません😉。",
  "data/ph-top/2022/2/musicswipe-for-spotify.json": "T inder + Spotify = MusicSwipe。30秒の曲のプレビューが流れるので、選択しやすい!",
  "data/ph-top/2022/2/web3-words.json": "web3/nft/cryptoの用語を検索できる用語集です。",
  "data/ph-top/2022/2/yearly-planner-by-pomoplanner.json": "タイムラインを作成することで、1年の長期的な目標を計画するのに良い方法です 1年を視覚的に整理して計画する 長期的なプロジェクトの感触をつかむことができます。",
  "data/ph-top/2022/2/ovy.json": "Ovy は、ワンクリックでより良いメールを書くことができる Gmail 用の Chrome 拡張機能です。Ovy は、ボタンをクリックするだけで、AI を搭載した完全かつ現実的で、文脈に応じた返信を生成します。",
  "data/ph-top/2022/2/dino-game.json": "Chromeのディノゲームを好きな時に遊べたらと思ったことはありませんか？残念なことに、デフォルトのゲームはChromeでしか使えません（当たり前か！）。でも、どのブラウザからでも遊べるとしたらどうでしょう？それがこのサイトです :)。",
  "data/ph-top/2022/2/makers-so.json": "Makers.soは、Figmaから離れることなく、自分だけのデザインを構築し公開するためのFigmaプラグインです。ポートフォリオ、ランディングページ、レジュメなどのシンプルなサイトに最適です。もう「FigmaからWebflowへ」「Figmaからコードへ」なんてことはありません。",
  "data/ph-top/2022/2/boardy.json": "Boardyを使えば、コードを一行も書かずに、誰でも美しい自動更新のダッシュボードを作成することができます。また、BoardyのAPIを利用することで、必要なコンテンツをモジュールにプッシュすることもできます。",
  "data/ph-top/2022/2/ai-image-transformer.json": "AI Image Transformerは、事前に学習させたAIモデルを使って画像を漫画化、様式化する簡単なツールを誰にでも提供することを目的としており、その結果はほぼリアルタイムで生成されることになっています。画像をアップロードし、結果をダウンロードするだけで、全く手間がかかりません。",
  "data/ph-top/2022/2/good-work-apps.json": "新しい生産性アプリを誰よりも早く発見 🔍 特定の関連基準に基づいてアプリを比較 💬 新しいアプリを提出し、新しい比較基準を導入 💬 新しいアプリを提出し、新しい比較基準を導入",
  "data/ph-top/2022/2/poap.json": "POAPは、人生経験を確実に記録していくための新しい方法です。イベントに参加するたびに、POAPコレクターは暗号記録で裏付けられたユニークなバッジ（NFT）を手に入れることができます。",
  "data/ph-top/2022/2/qrile.json": "独自のフローティングQRCodeページを作成します。qrile.comの後に、次のようなリンクを追加してください -> https://qrile.com/https://example.com",
  "data/ph-top/2022/2/javascript-knowledge-map.json": "このインタラクティブなJavaScriptナレッジマップは、開発者がモダンなJavaScriptのほとんどのトピックを一目で見ることができるように構築されています。",
  "data/ph-top/2022/2/adventr.json": "Adventrは、リーチ、ポータビリティ、データに重点を置いた、ノーコードでスケーラブルなインタラクティブ・ストリーミング・プラットフォームです。当社の技術により、クリエイターは、ウェブに期待されるパーソナライズ、検索性、接続性を備えたビデオを簡単に構築することができます。",
  "data/ph-top/2022/2/altum-analytics.json": "不良リードによる時間の無駄を省く Hubspot、Marketo、SalesforceでリードのICP適合性を即座に把握できます。効果的なワークフローを作成し、マーケティングキャンペーンのターゲットリストを作成し、インバウンドチャネルの品質をリアルタイムで測定します。",
  "data/ph-top/2022/2/enrich-my-list.json": "リスト上のメール送信者のTwitterプロフィール、フォロワー数、経歴、所在地を取得します。",
  "data/ph-top/2022/2/iconscout-for-canva.json": "Iconscout for Canvaプラグインは、プラグイン内から300万以上のアイコンにアクセスできるため、Canvaでのデザインをより良いものにします。あなたの作品を美しくするためのアイコンを探すためにCanvaを離れる必要はもうありません。",
  "data/ph-top/2022/2/ui-generator.json": "デザインタスクに必要なLorem Ipsum UIを生成します。あなたのウェブサイト、AppStoreのページ、プレゼンテーションやプロトタイプに、512種類の偽のUIテンプレートを使ってください。色で遊んだり、必要に応じてデバイスフレームを追加して、結果をPNGファイルとしてダウンロードできます。100%無料です。",
  "data/ph-top/2022/2/yepcode.json": "YepCode は、統合および自動化プロセスの開発、実行、監視を可能にする Saas プラットフォームです。YepCode は、JavaScript を直接使用して、最も複雑な問題を解決するために必要な、すぐに使える「ステロイド」をすべて提供します。",
  "data/ph-top/2022/2/codementor-events.json": "Codementor Eventsは、開発者が新しいツール、技術的なコンセプト、キャリアのヒントを学び、共有することができる開発者コミュニティとバーチャルイベントプラットフォームです。",
  "data/ph-top/2022/2/dawn-health.json": "Dawnは、スリープコーチとつながる＆睡眠療法で睡眠を改善するiOSアプリです。Dawnは睡眠スケジュールやその他の行動ツールを提供し、睡眠薬や補助剤を使わずに睡眠を改善することができます。",
  "data/ph-top/2022/2/kinety.json": "Kinetyは、成長企業がビジョンを実現するためのコラボレーション・ワークスペースです。意思決定の指針となる価値観や行動の設定から、OKRのマッピングや自己啓発のルート定義まで。一つのスペースで共有し、一丸となって仕事を始めましょう。",
  "data/ph-top/2022/2/cloudtech-3d-icons.json": "Cloudtechは、あらゆるクラウドテクノロジー製品に適したカスタム3Dアイコンのパックです。Figmaで簡単に編集でき、Cinema 4Dで完全にカスタマイズ可能な、これらの手製のアイコンを使って、魅力的でユニークなプロジェクトを作りましょう。3Dアイコンは最高です",
  "data/ph-top/2022/2/the-new-invision.json": "InVisionは、あらゆる種類のチームが集まり、組織化され、ミーティングを行い、ブレーンストーミングを行い、仕事を推進する場となったのです。Spacesを使えば、チームで最もよく使うツールを一カ所に集めることができます。ホワイトボードからワークボードへ移動し、重要なミーティングを開催することができます。",
  "data/ph-top/2022/2/salesmsg-2.json": "Salesmsgは、営業、マーケティング、サポートチームが簡単にメッセージングできるように設計された、オールインワンのビジネス用テキストおよび通話プラットフォームです。SMS、MMS、ビデオ、PDF、vCard、アニメーションGIFまで、コンピュータやモバイルアプリを使ってテキストで送受信できます。",
  "data/ph-top/2022/2/retentive.json": "ヘルプドキュメントを製品内で検索できるようにしましょう。ユーザーはより早く採用し、あなたはユーザーが実際に何に困っていたのか、豊富なインサイトを得ることができます。チケットも少なくなります！ https://retentive.io/product-hunt 8分でセットアップ完了。あなたのヘルプセンターと統合します。",
  "data/ph-top/2022/2/callbreaker.json": "会議では、あえて口を挟む必要はないけれど、もう自分の意見を言ってしまったので、今すぐにでも言い逃れをしたい、というタイプの会議がありますよね？",
  "data/ph-top/2022/2/klassifier.json": "クラウド上の自動機械学習アプリケーション データサイエンティストでない人のための機械学習! デモをご希望の方はお問い合わせください。Webサイト： https://www.klassifier.com LinkedIn： https://www.linkedin.com/showcase/klassifier/ Youtube： https://www.youtube.com/watch?v=6ZRLT8hQs2o",
  "data/ph-top/2022/2/shortwave-5.json": "Shortwaveは、あなたのGmailアカウントで体験できる、まったく新しいメールです。Eメールを一から設計し直し、混沌としたメールボックスに秩序をもたらし、実際に受信を楽しめるようにしました。",
  "data/ph-top/2022/2/netlify-graph.json": "Netlify Graphの紹介：GitHub, Spotify, StripeなどのサードパーティサービスのAPIを使ったWebアプリケーションをより速く開発する方法です。新しいサードパーティAPIをワンクリックで接続し、統一されたデータグラフでサービス間のデータを検索し、関数を自動生成します!",
  "data/ph-top/2022/2/pastel-for-adobe-xd.json": "デザインを共有し、フィードバックを収集し、承認を得るためのシンプルなリンクを作成します。Adobe XDファイルから直接作成できます。",
  "data/ph-top/2022/2/the-watcher-2.json": "ウォッチャーは、NFT用のETHウォレット、USD-ETH価格、ガス価格などを監視し、行動を起こすべき時に警告を発します。⠀ チルアウトな雰囲気や90年代の音楽プレーヤーを肌身離さず、FOMOをなくそう! ✨🔭👀",
  "data/ph-top/2022/2/ploomber.json": "Ploomberは、データ科学者が開発したコードをインタラクティブな環境（Jupyter、VScode、PyCharmなど）で迅速に展開し、時間のかかる手動での本番環境への移植を不要にするためのオープンソースのフレームワークです。",
  "data/ph-top/2022/2/noodl-2.json": "Noodlは、世界初のプロフェッショナル・デザイン・プログラミング・プラットフォームです。デザイナー、イノベーター、開発者がビジュアルプログラミングでパワフルなウェブアプリケーションを作成することを可能にします。Noodlは、クリエイティブな可能性を限りなく追求し、実現するために作られたプラットフォームです。",
  "data/ph-top/2022/2/twooter.json": "Twooterを使えば、自分だけのホームページがすぐに作れます。ソーシャルメディアのユーザー名を入力するだけで、あなたのためのサイトを生成してくれます。） また、ドラッグ＆ドロップ式のエディターが内蔵されているので、自分の好きなようにサイトをカスタマイズすることができます。",
  "data/ph-top/2022/2/visible-decks.json": "Decksは、Visibleを使用してピッチデッキをホストし、共有するための非常にシンプルな方法です。Decks は、Visible の資金調達 CRM および主要な投資家向けアップデート プラットフォームと完全に統合されています。",
  "data/ph-top/2022/2/kickscale.json": "キックスケールのプラットフォームでは、他の成功したチームや企業が使用しているプレイブックや実証済みのプロセスにアクセスすることができます。あらかじめ定義されたプレイブックを使用するか、独自のプレイブックを構築して、チームの学習曲線を加速させましょう。Kickscaleは、仕組みとノウハウを提供します。",
  "data/ph-top/2022/2/anania.json": "データに関する分析的な質問を平易な英語で行い、即座に答えを得ることができます。革新的な AI を搭載した Anania は、質問を理解し、データを分析し、回答を数値、テキスト、表、およびチャートで提供します。",
  "data/ph-top/2022/2/vizzu.json": "Vizzuでは、アニメーション・チャートを使って、複雑なデータセットの洞察を説明しやすいストーリーとして共有することができます。この依存関係のないライブラリを使用すると、あなたのサイトにアニメーションのレポートやダッシュボードを埋め込むことができます。",
  "data/ph-top/2022/2/1-000-user-interface-free-icon-set.json": "ユーザーインターフェースに欠かせないアイコンを、ベクターの線幅をカスタマイズできる小さな14pxのグリッドで表現しました。また、ワークフローを高速化する強力なアプリ機能とFigmaプラグインも無料で提供されます。ライセンスはCC 4.0です。",
  "data/ph-top/2022/2/glass-2-0.json": "Glassは、会員制の写真プラットフォームであり、コミュニティです。iOSとiPadに対応し、Webは近日公開予定です。",
  "data/ph-top/2022/2/seekwell-3.json": "SeekWellは、データウェアハウスとカスタマーサクセス、セールス、マーケティングで毎日使用する業務アプリの間で、すでに知っているSQLを使って顧客データを同期させる最も簡単な方法です。",
  "data/ph-top/2022/2/rutter-accounting-apis.json": "Rutterは、あらゆる会計システム、決済代行会社、eコマースプラットフォームでコマースデータを読み書きするためのユニバーサルAPIです。新しい会計APIでは、Quickbooks、Xero、Netsuite、Freshbooks、Sageと1つのAPIで簡単に統合することができます。",
  "data/ph-top/2022/2/linkedin-hashtag-trend.json": "LinkedInの正しいハッシュタグ戦略により、ターゲットオーディエンスはあなたのコンテンツをより簡単に見つけることができるようになります。また、同じ考えを持つ人々をあなたのプロフィールに引き寄せることで、LinkedIn上のネットワークも拡大します。",
  "data/ph-top/2022/2/mozaik-2.json": "WebflowのWebサイトをゼロからデザインするのはやめよう。Mozaik コンポーネントを使用して、次のサイトを数分で構築できます。ブラウザからコンポーネントをコピーして、Webflow プロジェクトに直接貼り付けることができるので、作業時間を大幅に短縮できます。",
  "data/ph-top/2022/2/codegiant-3-0.json": "Codegiantは、ソフトウェア開発のための強力なプラットフォームです。Issue Tracker、Git Repositories、CI/CD、Codepods、Serverless Functions、Uptime Monitoringなど、ソフトウェア開発者に便利な機能を備えています。",
  "data/ph-top/2022/2/figit-figma-plugin.json": "Figitは、1000以上の自動レイアウト要素と無数のワイヤーフレームパターンを持つFigma上の唯一無二のプラグインで、あなたのワークフローをスーパーチャージします! ゼロから作業を始めることなく、Figitだけで作業ができます! (下記をクリックするとPH割引が適用されます⬇) https://bit.ly/34Y4EtJ",
  "data/ph-top/2022/2/ui-colors-2.json": "UI Colorsは、TailwindのCSSカラーを作成、編集、プレビュー、エクスポート、保存するためのツールです。",
  "data/ph-top/2022/2/blixo.json": "Blixoは、購読管理、請求書発行、回収、和解などのソフトウェアを、企業向け価格ではなく、オールインワンで代替することができます。ARを自動化することで、より早く支払いを受けることができます。",
  "data/ph-top/2022/2/hue-tools.json": "hue.toolsは、オープンソースのツールボックスです。色を混ぜたり、検査したり、変換したり、修正したり、ブレンドしたり。すべて、とても簡単で、できれば直感的な方法で。",
  "data/ph-top/2022/2/bardeen.json": "Bardeenは、繰り返しの作業を1つのショートカットで置き換え、どこからでもWebアプリケーションをコントロールできる自動化アプリです。お気に入りのアプリとの統合や、フローを維持するのに役立つ何百ものビルド済みプレイブックをご覧ください！ https://www.bardeen.ai/",
  "data/ph-top/2022/2/june-2-0.json": "6月2.0日 - スタートアップのためのプロダクト主導型アナリティクス。6月は、チームの全員に関連するインサイトを生成します。創業者 🔨 製品 ✏️ エンジニアリング 💪 成功 ✨ マーケティング テンプレートで始め、データソースを接続すれば、すぐに利用できます。",
  "data/ph-top/2022/2/campfire-11.json": "Campfireは、遠隔地にいるチームが実際に楽しいバーチャルソーシャルを行えるようにします。毎週新しいアクティビティが更新されるマルチプレイヤーゲームの世界で、あなたのチームと一緒に遊んでみませんか？",
  "data/ph-top/2022/2/2-truths-a-lie.json": "3つのステートメント。そのうち1つは嘘です。1.2つの真実と1つの嘘は、木曜日にしか遊べない。2. 2つの真実と嘘は一人でやるよりチームでやった方が楽しい。3. 3.会員登録、インストール、広告がない。どれでしょう？答えを下記でシェアしてください。",
  "data/ph-top/2022/2/shell-how.json": "shell.howは、シェルコマンドがどのように動作するかを説明します。Figのオープンソースデータ(https://fig.io)を使用し、dをサポートしています。",
  "data/ph-top/2022/2/netflix-secret-codes.json": "Netflixには、文字通り、目に見えるもの以上のものがあるのです。👀 Netflixがリストアップしているカテゴリー数は、実際のカテゴリー数の比ではありません。🤯 Netflix Secret Codes は、Netflix Library 全体のロックを解除するのに役立ちます 😀。",
  "data/ph-top/2022/2/callin.json": "Callinは、ソーシャルポッドキャスティングのためのプラットフォームです。クリエイターにとって、コールインは、オーディオのストリーミング、録音、編集、公開、そして収益化のための単一の場所です。リスナーにとっては、オーディオやクリエイターを発見し、楽しみ、交流する場となります。",
  "data/ph-top/2022/2/0xsupply.json": "0xSupplyは、暗号の世界を動かすリソース、ツール、人々、そしてプロジェクトをまとめています。",
  "data/ph-top/2022/2/toools-design.json": "毎週更新される900以上のデザインリソースの無料アーカイブです。有用性の高いデザインリソースやツールを発見し、それらを検索する膨大な時間を節約することができます。",
  "data/ph-top/2022/2/notion-creator-bundle.json": "これらは、私がNotion製品で0から800ドル以上の収益を得るために使用したEXACTツールです - 経験なし - 巨額の広告費なし - 既存のネットワークなし あなたが販売しているテンプレートに関係なく、このバンドルはあなたをカバーしています。",
  "data/ph-top/2022/2/qrono.json": "Qronoは、レンタル会社を作るための最短の方法です。私たちは、予約とスケジュール管理のためのフルスタックを扱います：ノーコードの埋め込み、フロントエンドのコンポーネント、そして開発者に優しいAPI。",
  "data/ph-top/2022/2/social-champ-2-0.json": "Social Champは、あなたのソーシャルメディアネットワークを効率化するための完全なソーシャルメディアツールキットです。Facebook、Twitter、LinkedIn、Pinterest、Instagram、YouTube、Googleビジネスプロフィールにコンテンツをスケジュールします。豊富な機能を持つ無料プランで群衆から抜きん出る。",
  "data/ph-top/2022/2/nubo.json": "Nuboは、TypeScriptやJavaScriptのアプリケーションを、世界中の複数の地域に同時に簡単にデプロイできるようにします。Nubo はユーザーを最も近いデプロイメントに自動的にルーティングするので、ユーザーはあなたのアプリケーションにすぐにアクセスできるようになります。",
  "data/ph-top/2022/2/pingpong-0abe32f9-a4a8-49dc-926f-8af329c315ed.json": "PingPongは、集中的に仕事の議論や意思決定を行うための、構造化された非同期メッセンジャーです。2.0の新機能は？📐構造化された会話 🧘♀️集中を促す通知 🎞マルチメディアメッセージング 🔎検索機能の向上 ️メッセージ返信とプレビューなど。",
  "data/ph-top/2022/2/fireside-7.json": "Firesideは、世界最高のクリエイターが、ライブ、インタラクティブ、バーチャルなショーを通じて、観客をストーリーの中に引き込む場所です。",
  "data/ph-top/2022/2/pagify.json": "Pagifyは、サインアップ不要の最も簡単で身近なウェブサイト作成方法です。3クリックで完了します。あなたのサイトは、あなたがドキュメントを変更すると、自動的に更新されます。ポートフォリオ、学校のレポート、シラバスなど、どんなものでも作成できます！ https://gopagify.com http://www.gopagify.com https://gopagify.com https://www.gopagify.com/",
  "data/ph-top/2022/2/photure-3-0.json": "Photureは、Polygonのチェーン上にあるNFTのミント上に構築された写真・動画共有アプリです。Photureを使えば、ステッカー、絵文字、フィルターなどを簡単に写真に挿入したり、素晴らしいコラージュを作ったり、写真にテキストを追加したりすることができます。ミンツも無料です!",
  "data/ph-top/2022/2/flowlab.json": "ブラウザ上で動作するノーコードゲーム制作プラットフォーム。誰でもゲームデザイナーになれる - Flowlabなら今すぐ簡単にゲーム作りを始められます。作ったゲームはウェブで共有したり、モバイルやPCのネイティブアプリとしてエクスポートすることができます。",
  "data/ph-top/2022/2/shoutout-56aa50d3-750a-48fb-be3d-a5dd962d70ff.json": "Shoutoutは、無制限の顧客に国際的にSMSを送信するためのビジネスSMSプラットフォームです。Shoutoutの高度なセグメンテーションにより、ターゲットを絞ったキャンペーンを簡単に送信することができます。パーソナライゼーションにより、企業は顧客との友好的な関係を維持することができます。",
  "data/ph-top/2022/2/memeterest.json": "ミームを探すのに疲れていませんか？ミームテレストをご紹介します。高品質のインドミームテンプレートのPinterestです。Memeterestは、500以上のインドの最も好きな高品質のミームテンプレートのコレクションをあなたに無料で提供します。",
  "data/ph-top/2022/2/b2b-heaven.json": "B2Bインフルエンサーマーケティングは、最もROIの高い顧客獲得チャネルの1つです。しかし、B2B情報商材やSaaSブランドは、あまりに新しいため、どこから手をつけていいのかわからないのです そこで、2,500人以上のB2Bインフルエンサー、価格ガイド、その他の情報で、天国のようにします!",
  "data/ph-top/2022/2/seo-checklist-2.json": "チームでウェブサイトの最適化に取り組むとき、無意味なことで多くの時間を浪費していることにお気づきでしょうか？そうです、私たちも気づいていました。今からでも遅くはありません。チェックリストを使えば、Webサイトの最適化に必要なすべてのタスクにアクセスできます。",
  "data/ph-top/2022/2/nimbus-7f8cb670-3331-462b-b1d7-ab9d39b3d1b3.json": "Nimbusは、開発者の時間と労力を節約するクラウド開発環境です。開発者は環境のセットアップやメンテナンスをする必要がなく、ローカルのVSコードアプリからアクセスできる強力なクラウドマシンを介して、より高いパフォーマンスを得ることができます（今後、他のIDEも導入予定です！）。",
  "data/ph-top/2022/2/dwoth.json": "Dwothは、絵文字を使って正確な瞬間のライフ・アクティビティを記録することができます。今タップして、後で文脈を追加することができます。これであなたの日記ができあがり、個人的にも仕事上でも使うことができます。水を飲むことから、財務報告書を完成させることまで、あなたの生活をカバーします。",
  "data/ph-top/2022/2/inspirar.json": "Inspirarは、遠隔地にある企業の従業員のエンゲージメント、フィードバックの収集と対応、傾向の分析を支援し、従業員のウェルネスに焦点を当てた、より透明で実行可能な企業文化を構築することを支援します。",
  "data/ph-top/2022/2/jumpspeak.json": "Jumpspeakは、チャットボットによる没入型の会話で、実際に使うのと同じ方法で新しい言語を教えます。インテリジェントな音声フィードバックを得て、気になることを学習し、初日から自信を持って話すことができます。無料体験版: https://www.jumpspeak.com",
  "data/ph-top/2022/2/obscura-3-2.json": "プロ、愛好家、アマチュアのためのiPhoneカメラアプリ。機能満載のゴージャスなデザイン。",
  "data/ph-top/2022/2/ark7-2-0.json": "Ark7は、最もシンプルな不動産投資の方法です。ポートフォリオを多様化し、パッシブ収入を得ましょう。米国で最もホットな市場の厳選されたリストから物件を選びましょう。",
  "data/ph-top/2022/2/promoshot.json": "製品の美しい写真を瞬時に作成します。テンプレートから選択し、画像をアップロードして、新しいプロモーション写真をダウンロードしてください。",
  "data/ph-top/2022/2/official-2-0.json": "出会い系アプリで簡単に相手を見つけることができるようになったが、その愛を守り続けることはできるのか？しかし、その愛を持続させるのは難しいことです。オフィシャルでは、カップルが一緒に新しいことを体験したり、健康的な習慣を身につけたりすることで、人間関係をよりよいものにするお手伝いをしています。",
  "data/ph-top/2022/2/gaggle-mail-2.json": "Gaggle Mailは、Listservに代わる、モダンでシンプルなメールサービスです。- 数秒でグループ専用のメールアドレスを取得 - 世界中の数千の組織で信頼されています - 検索可能なメッセージアーカイブ - モデレーション - 独自のブランディングを使用 🎁 1000人までは完全無料",
  "data/ph-top/2022/2/notion2charts.json": "Notion2Chartsは、Notionのデータベースから埋め込み可能な美しいチャートを簡単に生成するオンラインツールです。Notion2Charts では、以下の操作を行うだけです。 ⚙️ Notion ワークスペースに接続 📊 データベースを選択してチャートを作成 🔗 Notion 内の任意の場所にチャートを埋め込む",
  "data/ph-top/2022/2/kamukamu.json": "私たちは、クリエイターや専門家が視聴者との会話を収益化するのを支援するモバイルメッセンジャーアプリを作りました。このメッセンジャーでは、クリエイターや専門家がテキストを送ったり、個別のアドバイスをしたり、ただ注意を払うだけで、オーディエンス（ファン/クライアント）からお金をもらうことができます。",
  "data/ph-top/2022/2/speediness.json": "Speedinessは、インターネット接続の速度とレイテンシーをすばやくチェックすることができます。テストは、実際の状況をよりよく反映させるために、並行して実行されます。このアプリケーションには、macOS 12以降が必要です。",
  "data/ph-top/2022/2/shaqay-2.json": "同じ志を持つ仲間とつながることで、適職を見つけたり、会社を立ち上げたり、新しい友人を作ったり、キャリアを探したりすることができます。",
  "data/ph-top/2022/2/gabby.json": "Gabbyは、犬同士の永続的なつながりを生み出すための、犬族のためのソーシャルメディアアプリです。このアプリでは、2回のスワイプで犬とのデートを設定でき、毛皮の友人の健康を追跡し、投稿やストーリーをアップロードするための独立したセクションを備えています。",
  "data/ph-top/2022/2/tailgrids.json": "Tailwind CSS UI Components, Blocks, Sections, UI Kit and Templatesのハンドメイドライブラリで、開発ワークフローをスピードアップします。300以上の無料およびプレミアムTailwindコンポーネント、コピーペースト可能なインターフェース、高品質でクリーンなデザインのFigmaソースファイルなど、盛りだくさん。",
  "data/ph-top/2022/2/turbo-delete.json": "Turbodeleteは、Windowsのデフォルトの削除機能に代わる、高速な削除機能です。TurboDelete は、コマンドラインだけでなく、コンテキストメニューにも統合されています!",
  "data/ph-top/2022/2/noway-task.json": "Noway Taskは、Notionで定期的なタスクを作成するためのサービスです。",
  "data/ph-top/2022/2/creatowise-for-youtube.json": "AIの力でYouTubeでバイラルしよう! バイラルビデオのアイデアを生成し、アップロード前にサムネイルとタイトルをプレビューし、GPT-3によってより良いビデオタイトルを作る 🤖 15歳のコンテンツクリエイターによって、クリエイターのために作られました！ 🤖 YouTubeでバイラルビデオのアイデアを生成し、アップロード前にサムネイルとタイトルをプレビューし、GPT-3の力によってより良いビデオタイトルを作る",
  "data/ph-top/2022/2/relaxfrens.json": "RelaxFrensは、騒がしい環境から逃れ、リラックスできるサウンドを使って自分だけの環境を作ることができます🌳🌊これによって、仕事の生産性を高め、試験の合格に向けて勉強し、ヨガや瞑想を行い、ただリラックスすることができます🤜🤛このサウンドを聞くことで、あなたはリラックスすることができるようになります。",
  "data/ph-top/2022/2/productool.json": "プロダクトピープルとして、私たちは毎日新しいSaaS製品を探しています。SaaS製品は私たちの生活をより快適にしてくれる大きな役割を担っています。キュレーションをいち早く手に入れるために、ぜひご登録ください",
  "data/ph-top/2022/2/wagsi.json": "WAGSIは、Polygon上に構築されたメタマスクユーザーのための定期支払いプラットフォームです。支払いページを作成して安定コインでの購読を受け入れたり、Wagsi JSコードをウェブサイトに貼り付けてコンテンツをロックしたり、Discordで有料オンラインコミュニティを作成したりすることができます。",
  "data/ph-top/2022/2/rss-api-v1-2.json": "RSS APIは、API経由でRSSフィードを簡単に扱えるようにします。今回のRSS APIのメジャーアップデートでは、バックエンドを完全に書き直し、パフォーマンスと信頼性を向上させ、詳細な統計情報を含む全く新しいダッシュボードを提供します。",
  "data/ph-top/2022/2/dixel.json": "何百万ものBAYCの模倣品を見て、うんざりしていませんか？今、あなたは次の版を描いて、クールなピクセルアートNFTコレクションの一員になることができます! 史上初のドロー・トゥ・アーンのピクセルNFTプラットフォームです。",
  "data/ph-top/2022/2/innos-note.json": "真にパワフルでフレキシブル。Innosは、メモ、チームWiki、トラッカー、データベース、ワークフローなど、あなたの必要なものになることができます。無限の可能性があります。",
  "data/ph-top/2022/2/revioly.json": "アマゾンなどの主要小売店の商品ページにいる間、Reviolyはインターネット上のあらゆる場所からその商品をスキャンし、最新の世界価格とレビュー分析を提供します。",
  "data/ph-top/2022/2/humbo.json": "ある場所への行き方、泊まる場所、何をするかなどを決めるのに役立つウェブサイトがたくさんあります。フンボは、そもそもどこに行くかを決める手助けをします。",
  "data/ph-top/2022/2/computer-museum.json": "オンライン・コンピュータ・シミュレーター。歴史的に有名なコンピュータプラットフォームの特性を、より直感的に表示します。タイムスリップして、コンピュータの発展の歴史を体感してください。",
  "data/ph-top/2022/2/grupa-io.json": "Grupaは、創業者がFAANG企業の製品エンジニアリングチームとつながり、株式や現金と引き換えに仕事をすることを可能にするマーケットプレイスです。",
  "data/ph-top/2022/2/rake-3.json": "Rakeは、メッセージングツールの数々を一つのワークスペースに集約して提供します。Rakeを使わなくても、クライアントをメッセージチャンネルに追加できるユニークな機能で、完全なチームコラボレーションを実現します。私たちは、オムニチャネルの顧客チャットを含んでいます。タスクとナレッジベースも。",
  "data/ph-top/2022/2/alfie.json": "Alfieは、プロバイダーとの仮想訪問と処方薬、認定男性ヘルスコーチによる高度な個別指導、そしてNFTなどのインセンティブを伴う隔週の競技に参加する男性たちのP2Pコミュニティを通じて、男性の体重15％減を支援しています。",
  "data/ph-top/2022/2/writerly.json": "AIを活用したオールインワンライティングソリューション。起業家や企業が、あらゆる分野の文章を、高品質で魅力的、かつ剽窃のないコピーライティングで作成することを支援するために設計されています。私たちは、あなたのアイデアを言葉にして、同時に木を植えます。",
  "data/ph-top/2022/2/easyscrape.json": "EasyScrapeを使えば、1クリックでどんなウェブページからでも記事をスクレイピングすることができます。あなたは、URLのリストまたは単一のURLやキーワードを含むテキストファイルをアップロードすることができ、記事は、クリックするだけで、これらのURLからスクレイピングされます。",
  "data/ph-top/2022/2/convoy-3.json": "Convoyは、オープンソースのWebhooksサービスです。Webhooksの断片的な実装をファーストクラスでサポートすることができます。私たちは、サイドプロジェクトからIPOまで、Webhooksのイベントを公開するためのインフラを構築しています。",
  "data/ph-top/2022/2/grouppage.json": "grouppage.appは、テレグラムやWhatsappのグループコミュニティで、ミートアップ、イベント、情報を1つのシンプルなリンクで組織する方法を提供します。🔗プロフィールが設定されたら、グループチャットの説明欄にリンクを設置し、メンバーが簡単に見つけられるようにしましょう。",
  "data/ph-top/2022/2/mythia-2.json": "儲かるNFTを早く見つけたい？レアリティスナイピングからホエールトレードトラッキングなど、Mythiaのツールを使ってマーケットで不当に優位に立ちましょう。Mythiaはまた、すべてのトップNFTディスコードからの情報を、毎日3分間でお届けしています。",
  "data/ph-top/2022/2/breakcold.json": "AIによってパーソナライズされたアイスブレーカーを備えたコールドメールアウトリーチソフトウェア ソフトウェア間の行き来を回避することができます。ブレイクコールドは、開封率と返信率を劇的に向上させるAIファーストラインを搭載したコールドメールソフトウェアです。",
  "data/ph-top/2022/2/snappify.json": "snappifyは、美しいコードスニペットを作成するのに役立ちます。コードを説明し、必要なスタイルにすることができるデザインツールです。すべてのスニペットを1つの場所に保存して、世界中の人と簡単に共有できます。",
  "data/ph-top/2022/2/ux-database-2.json": "プロダクトデザインを無料で学ぶことができます。未経験者でも独学で学べるように、評判の良い著者の750以上の学習リソースで、提案されたリソースを全て勉強し、夢の仕事に就けるように学習パスを作りました。",
  "data/ph-top/2022/2/goosly.json": "Gooslyは、ビルドイン・パブリック・プロジェクトのための、無料のシンプルなロードマップツールです。プロジェクトや製品の計画を、複製、使用、無料で共有できるロードマップの形で、スタイル、埋め込み、コミュニティと共有することができます。",
  "data/ph-top/2022/2/ppc-ad-lab.json": "Google広告のデータを任意の場所（郵便番号も可）からリアルタイムで取得できます。すべての広告主、広告、LSA、ショッピング広告などのデータを取得できます。ホワイトラベルのレポートとEメールアウトリーチキャンペーン",
  "data/ph-top/2022/2/labidesk-mobile-app.json": "LabiDeskモバイルアプリは、eコマース、スタートアップ、SMBに重点を置いた本格的なヘルプデスクソフトウェアです。",
  "data/ph-top/2022/2/stablegains.json": "Stablegainsは、あなたのお金を有意義な安定した金利で働かせるお手伝いをします。アプリをダウンロードし、無料で入金すれば、翌日には利息を獲得できます。安定コインへの交換は私たちが行い、DeFiの最高のオープンレンディングプロトコルで展開します。",
  "data/ph-top/2022/2/shuffle-layout.json": "ウェブサイトを楽しく作ろう 既成の部品からページ全体のテンプレートをワンクリックで生成します。合わない？クリックして別のものを作りましょう 出来上がりが気に入りましたか？ワンクリックで、ビジュアルエディタに転送します。",
  "data/ph-top/2022/2/metapass.json": "Metapassは、Polygonチェーン上のイベントチケットプラットフォームです。クリエイターは、私たちのプラットフォームでWeb3イベントを開催し、参加者の暗号ウォレットにNFTを無料でエアドロップすることができます。",
  "data/ph-top/2022/2/volu-by-volograms-2.json": "本物の人間を使ってARでコンテンツを作る。- ボログラムをキャプチャする。動画を撮影するのと同じくらい簡単🤳 - 再生する。どこでもボログラムで作成、サイズを変更、スーパーパワーを追加💃 - 注目を集める。ヴォログラムでシェア🌟 - Coming soon: エクスポート機能＆Androidアプリ👀を追加",
  "data/ph-top/2022/2/elementor-cloud-website.json": "Elementorで構築された10MのプロフェッショナルなWebサイトに参加しませんか？Elementor Cloud Websiteは、シームレスなホスティング、プリインストールされたWordPress、必要なすべてのストレージと帯域幅、さらに業界で高く評価されている自由なデザインを備えた、エンドツーエンドのウェブサイト構築ソリューションです。",
  "data/ph-top/2022/2/unlined.json": "Unlinedは、あなたの電話番号への着信をフィルタリングし、👤発信者が誰であるかをチェックし、📆カレンダーに基づいてあなたの可用性をチェックします。この方法では、あなたが許可した人からの電話を、あなたが利用できるときだけ受けることができます🎉 詳細情報@ https://unlined.app。",
  "data/ph-top/2022/2/twidaq.json": "世界最大のファンタジー株式市場をプレイしよう！ 📈。お気に入りのセレブ、テレビ番組、スポーツのヒーロー、友人など、IRLの影響力にリンクした株を取引しよう。",
  "data/ph-top/2022/2/griply.json": "Griplyは、最高の人生を送るためのオールインワン・ライフ・マネジメント・アプリケーションです。あなたが本当に望んでいること、あなたが幸せになることを発見してください。ライフプランを作成し、実行可能な目標を定義します。毎日ジャーナルを書くことで、自分自身と向き合い、計画をより鮮明にすることができます。",
  "data/ph-top/2022/2/leadbot-1.json": "今、誰が競合他社を見ているのかが、チャットボットに聞くように簡単にわかるとしたらどうでしょう？LeadBotはそれを実現します。インテント・データを垣間見ることができ、すべてチャットボットで行うことができます。ピッチの叩き売りはありません。",
  "data/ph-top/2022/2/tastebase.json": "不味いお菓子から味覚を守る。tastebaseの毎日のスナックマッチングアルゴリズムで、次のおいしい冒険を発見してください。近日発売の商品、厳選されたテイスティングリスト、スナックのリワードが付属しています。無料スナックの請求はこちら: https://form.typeform.com/to/PJuYTruh",
  "data/ph-top/2022/2/hawk-2.json": "モダンエラートラッカー 完全なオープンソース。多くの統合が可能です。ついに、私たちはやり遂げました Editor.jsのクリエーターによって作られた",
  "data/ph-top/2022/2/checks-by-google.json": "Checksは、モバイルアプリケーション開発者向けの新しいプライバシープラットフォームで、開発チームと開発中のアプリケーションのプライバシーコンプライアンスへの道を簡素化することで、より安全なデジタルエコシステムの構築を支援します。",
  "data/ph-top/2022/2/blueprint-f5fd9164-84cb-49d2-9240-f8f9aecc24de.json": "🧪 自分の性格タイプを知るためのテスト 📝 自分の考え方、感じ方、行動の詳細とその理由 👯 友人、家族、同僚、恋愛相手の性格タイプを比較 🏥 自分の現在のメンタルヘルスレベルを知ることができる 🗦 自分の性格を知るためのテスト",
  "data/ph-top/2022/2/seo-for-early-stage-saas-startups.json": "サーチエヴァのSaaS SEO愛好家チームは、初期段階のSaaSスタートアップがオーガニックトラフィックを素早く獲得し始めるための7つのSEOフレームワークの究極の調査を準備しました。これは、あらゆる開発段階にある企業のための、一連のSEO戦略の出発点です。",
  "data/ph-top/2022/2/newcon.json": "ニューコンは、プロフェッショナルな基調講演やカンファレンスコンテンツを提供するネットフリックスです。起業、ベンチャーキャピタル、グロース、Web3の分野における世界最高峰の100以上のソートリーダーやカンファレンスにオンデマンドでアクセスできます。 最高の人たちと学び、関わり、つながることができるのです。",
  "data/ph-top/2022/2/asotools.json": "ASOToolsは、モバイル開発者向けにアプリのダウンロード数を増加させるオールインワンプラットフォームです。私たちのデータベースがどれほど強力で正確なものであるか、ご期待ください。",
  "data/ph-top/2022/2/supernotes-2.json": "Supernotes 2は、アイデア、記録、タスク、リストを保存するための新しい家です。あなたの考えをノートカードとして書き留め、探索し、リンクさせ、リアルタイムで友人と共有しましょう。今すぐ無料でお試しください。",
  "data/ph-top/2022/2/typefully-profiles.json": "Typefullyのプロフィールを無料で取得し、あなたのツイートやスレッドに新しい命を吹き込みましょう。自動的に美しいブログに変換し、リンクもすべて追加します。",
  "data/ph-top/2022/2/make-1.json": "Makeは、タスクやワークフロー、アプリケーションやシステムなど、あらゆるものをコーディングなしで設計、構築、自動化できるビジュアルプラットフォームです。世界中の中小企業、スタートアップ企業、スケールアップ企業、チーム、企業がMakeを利用して、これまで以上に迅速にビジネスを拡張しています。",
  "data/ph-top/2022/2/later-aa762753-cafe-475e-9acb-d534de9e6adf.json": "Laterは、ワークスペースを簡単に消去・復元できるMacのメニューバーアプリです。仕事のスイッチを切る、画面共有の前にデスクトップを片付ける、アプリケーションを後で使うようにスケジュールする、などなど。",
  "data/ph-top/2022/2/saas-pricing-page.json": "300以上の価格設定ページのデザインを見て、インスピレーションを得たり、ビジネスの価格設定テーブルを改善するのにお役立てください。ベストプラクティスのリストを作成し、コンバージョン率の高い他のページと比較できます。最適化を実現しましょう",
  "data/ph-top/2022/2/web-analytics-ai.json": "Web-Analytics.aiは、今までにない分析結果を収集することができます。ユーザーがあなたのウェブサイトとどのように関わっているかを確認し、使いやすいUI/UXでウェブサイトを改善しコンバージョンを増やす方法について比類のない洞察を得ることができます。",
  "data/ph-top/2022/2/google-trends-superpowered.json": "Google Trendsは素晴らしいものですが、検索ボリュームの数字が不足していたり、新しいトレンドを発見するのに適した方法でないなど、多くの点で不足しています。Glimpseでは、過去3年間、トレンド技術に多大な投資を行い、本日、Google Trendsの上位にリリースしました。",
  "data/ph-top/2022/2/job-board-fire-3-0.json": "ジョブボードファイアは、ジョブボードを立ち上げ、成長させ、管理するために必要なすべてのツールを搭載した、完全なジョブボードプラットフォームです。私たちは、コミュニティ主導の企業と提携し、有機的な成長チャネルまたはマネタイズ戦略として求人サイトを立ち上げます。",
  "data/ph-top/2022/2/firstofficer-2.json": "あなたのスタートアップには、あなたが思っている以上に多くの迅速な資金調達の選択肢があります。FirstOfficerは、貸し手がスタートアップに様々な融資の選択肢を個人的に提示することを可能にするプライベート・マーケットプレイスを作りました。安全で、非公開で、スタートアップ企業には無料です。",
  "data/ph-top/2022/2/terra-connect-widget.json": "Terraのウィジェットを使えば、あなたのアプリとあらゆるウェアラブルを簡単に連携させることができます。アプリにウィジェットをインストールすることで、ユーザーがFreestyle Libre、Garmin、Oura、Fitbit、Apple、その他すべてのウェアラブルをアプリに接続できるシンプルなUIを手に入れることができます。",
  "data/ph-top/2022/2/raek.json": "RAEKは、お客様のウェブサイトを訪問した人々を識別し、ご希望のマーケティングチャネルを通じて即座にリターゲティングすることを可能にします。",
  "data/ph-top/2022/2/coda-3-0.json": "真新しいエディタ、オープンなPacksプラットフォーム、そして数百ものリクエストに応えるアップデートで、Coda 3.0はあなたのチームをひとつにする準備ができています。",
  "data/ph-top/2022/2/estory.json": "新しい物語を共有する方法をお探しですか？eStoryをご紹介します。ダイナミックなタイムラインを作成し、ストーリーの重要なイベントを無料で視覚化することができます。歴史的なエピソード、感動的な人物、科学、芸術、スポーツなど、好きなトピックを選んでください。",
  "data/ph-top/2022/2/blox-5.json": "bloxは、開発者が記録的な速さでTailwind CSS UIを構築することを可能にするVS Codeエクステンションです。1500以上のアクセシブル、クロスブラウザ、レスポンシブコンポーネントを利用でき、Angular、React、Vue、Alpine、Svelte、Laravelに対応しています。",
  "data/ph-top/2022/2/send-nda.json": "不必要な時間を費やすことなく、グローバルにカバーされたNDAを送信し、わずか10ドルで数分以内にビジネスの話を始めることができます。アカウントは必要ありません。",
  "data/ph-top/2022/2/horizon-wallpapers.json": "14枚のダイナミックな壁紙のパックがあり、時間と共に勝手に変化し、過ぎ行く時間の生態系を作り出すのに役立ちます。",
  "data/ph-top/2022/2/znaplink-emails.json": "月々10ドルで、あなたのコミュニティーに無制限にメールを送ることができます。高価で複雑なメールマーケティングツールとはおさらばです。",
  "data/ph-top/2022/2/marvin-d636aceb-349c-4de1-9d1a-de1fc1a7a87a.json": "Marvinは、ユーザー調査を行う上で、最も協力的で最適な方法です。Marvinは、インタビューの設定、通話の録音、メモの取り方、データの分析、録音をリッチで共有可能なインサイトに変えるなど、ユーザーリサーチのあらゆる側面を自動化します。",
  "data/ph-top/2022/2/bio-link-4.json": "Bio Linkは、クリエイターやメーカー向けに設計された強力なバイオリンクツールです。6ヶ月前のベータ版リリース以来、現在170kのクリエイターと4Mの月間訪問者にサービスを提供しています。",
  "data/ph-top/2022/2/specify-2.json": "Specify は、デザインおよび開発チームのためのデザイン データ プラットフォームです： 🎨&nbsp;Figma からデザイン トークンとアセットを収集 🤖 それらを単一の真実のソースに格納 ⚡ カスタム配信パイプラインでブランドを配信 無料で始める → https://specifyapp.com",
  "data/ph-top/2022/2/carrot-bb4ca4e4-4516-424d-bf11-510a600686b2.json": "CarrotはPlaintain Labsによって作られたモデルで、Banana.devでホストされています。インスピレーションは、GPT3などの汎用テキストモデルを見て、\"これをコンピュータビジョンにもできないか？\"と思ったことから来ています。",
  "data/ph-top/2022/2/paperless-io.json": "Wordで契約書を作り、PDFをやりとりし、手作業で署名や承認を追いかけるというやり方で、効率的なビジネスができるのでしょうか？Paperless.ioを使えば、ビジネス文書の作成、承認、送信、署名、自動化をすべて一箇所で行うことができます。GDPRに完全に準拠しています。",
  "data/ph-top/2022/2/simplified-animation-maker.json": "Simplifiedの1クリックアニメーションで、デザインをアニメーション化できます。ワンクリックでソーシャルメディアの投稿、広告、動画を作成できます。チームとリアルタイムで共有し、コラボレーションできます。作成したアニメーションは mp4 や GIF としてエクスポートして共有できます。ジャーン! ワンクリックで完了です。",
  "data/ph-top/2022/2/snipd.json": "AIが生成したトランスクリプトとチャプターでポッドキャストを聴くことができます。1クリックでお気に入りの場面をハイライトし、要約やトランスクリプトを含めて、ReadwiseやNotionなどにエクスポートできます。コミュニティからの短いハイライトを聴いて、新しい瞬間を発見する。",
  "data/ph-top/2022/2/venture-capital-tool-stack.json": "VC投資家向けのツールは何百とありますが、どれが自分のユースケースに合っているのかわかりにくいです。そこで、私たちはVCツールのレビュープラットフォームを考え出しました。",
  "data/ph-top/2022/2/creativity-framework-for-startupers.json": "理論と実践。表裏一体。アイデアを生み出し、それを実現するためのすべてを学ぶことができます。そして、あなたの知識を試し、実社会で何が有効かを学びましょう。",
  "data/ph-top/2022/2/api-diff.json": "https://api-diff.io API の 2 つのバージョン内の変更点を確認することができます。2つのファイルをドラッグ＆ドロップするか、URLを追加すると、瞬時に変更点を確認することができます。さらに、CLIやGithub Actionを利用することもできます。",
  "data/ph-top/2022/2/kubecost.json": "Kubecostは、Kubernetesを使用するチームに対して、クラウドにとらわれないリアルタイムのコスト可視化とインサイトを提供し、継続的なインフラコストの削減を支援します。https://www.kubecost.com/install で5分以内に無料でインストールできます。",
  "data/ph-top/2022/2/data-fetcher-2-0.json": "Data Fetcherは、コードなしでAirtableにデータをインポートする最も簡単な方法です。Google Analyticsのデータ、Webflowのコレクション、株価など、様々なデータをインポートすることができます。カスタムリクエストを使用して、任意のJSON/XML APIに接続します。そして、自動実行をスケジュールします。",
  "data/ph-top/2022/2/cursor-chat-anywhere.json": "カーソルチャットを使えば、ユーザーは共同ブラウジングを楽しむことができ、好きなウェブページで友人と気軽に会話し、一緒に孤独感を軽減することができます。これはNext.jsアプリにカーソルチャットを追加する最速の方法です。",
  "data/ph-top/2022/2/booqsi.json": "Booqsiは、本のコミュニティのために特別に作られたモダンなソーシャルプラットフォームで、本についてより有意義に他の人と関わることができるようになります。私たちの目標は、本好きの人たちに、Goodreadsに代わる、よりソーシャルでAmazonに依存しないサービスを提供することです。",
  "data/ph-top/2022/2/relume-library-figma-kit.json": "世界最大のWebflowコンポーネント・ライブラリであるRelume LibraryのFigma版が欲しいという多くの要望を受け、Minimal Squareと共同で、Figma → Webflowのワークフローを改善するための700以上のピクセル・パーフェクトなFigmaコンポーネントを作成しました。",
  "data/ph-top/2022/2/quine.json": "Quineは、開発者がコーダーとしてのスーパーパワーとソフトウェアクリエイターとしての個性を際立たせる、印象的なオープンソースポートフォリオを構築し、紹介することを支援します✨。",
  "data/ph-top/2022/2/hustle-got-real-2.json": "Hustle Got Realは、商品リスト、在庫監視、価格追跡など、eBay、Shopify、Amazonでドロップシッピングビジネスを成功させるために必要なすべてのツールを備えたドロップシッピングソフトウェアで、多くの機能の中にいくつかの機能が含まれています。",
  "data/ph-top/2022/2/md-vinyl.json": "MD Vinylを使えば、音楽を聴きながら、ホーム画面でレコード盤のような効果を楽しむことができます。現在、Apple Musicのみ対応。",
  "data/ph-top/2022/2/popspace.json": "自分らしい空間を、自分らしくつくる。チャット、コラボレーション、プレイのためのオープンソースのバーチャルキャンバスプラットフォームです。",
  "data/ph-top/2022/2/whosdown.json": "WhosDownは、「共通の趣味」を持つ人とリアルタイムにつながる、純粋な友達作りのためのモバイルアプリです。共通の趣味とは、スポーツ、ゲーム、ショッピング、コーヒーなど、どんなものでもOK。",
  "data/ph-top/2022/2/help-ukraine-win.json": "ウクライナの人々の反撃と自由を守るために、外国人がどのように支援できるかについての資料と情報を集めたものです。",
  "data/ph-top/2022/2/superframes.json": "コミュニティを宣伝し、コミュニティのメンバーが自分の所属する組織を簡単に表示し、ワンクリックであなたのブランドをアピールできます。",
  "data/ph-top/2022/2/the-silk-collective.json": "現在のファッション界の経済は、持続可能ではありません。シルク・コレクティブは、現在のハイファッション・ハウスと顧客の間の消費主義的な関係に反対し、コミュニティが運営するブランドになることを目指しています。",
  "data/ph-top/2022/2/heardle.json": "Wordleにインスパイアされた、できるだけ少ない試行回数でイントロから曲を当てるゲームです",
  "data/ph-top/2022/2/abnormal-mouse.json": "アクティベーターを持ち、愛用の通常のマウスを動かすだけです。これらの便利なジェスチャーは、すべて通常のマウスで利用できるようになりました。- 4方向の「ドラッグ」でスクロール。- 2本指のスワイプジェスチャー。- ズームと回転。- 4本指のスワイプジェスチャー。",
  "data/ph-top/2022/2/email-bounce-checker-from-blocksurvey.json": "BlockSurveyのメールバウンスチェッカーは無料ツールです。メールが有効かどうかを調べるのに役立ちます! メールを入力するだけで、データが記録される心配もなく、検証できます。オープンソースです。",
  "data/ph-top/2022/2/help-ukraine.json": "ウクライナ国外の人々が戦争を止めるためにどのような支援ができるのか、詳しく説明したウェブサイトを作成しました。シェアしていただけるとありがたいです。ありがとうございました。",
  "data/ph-top/2022/2/offtrack.json": "私たちの仕事はただひとつ。それは、ベンチャーキャピタル、スタートアップ、Web3におけるコンセプトを、漫画を通してシンプルにすることです。📽 コミック版 👀 2.5M+ インプレッション 👩 8人のクリエイター 💻 10k+ Likes across platforms 📈 1000+ Linkedin followers 📨 1000+ Subscribed readers on the platform",
  "data/ph-top/2022/2/crypto-donations-to-ukraine.json": "ロシアの侵略と戦うウクライナ軍を支援するために暗号資金を調達しています。また、その資金は敵対行為によって影響を受けた民間人に送られます。資金は、ボランティア、孤児院、病院、その他の慈善団体に向けられます。",
  "data/ph-top/2022/2/bytemine-2-0.json": "Bytemineは、トレーダーが洗練された取引アルゴリズムをブロックごとに構築できる、ドラッグ＆ドロップ技術を用いた直感的なグラフィカル・ユーザー・インターフェースを提供することで、一般のトレーダーがアルゴリズム取引を行えるようにします。",
  "data/ph-top/2022/2/upshouts-creators.json": "アップシャウトに投稿したリンクは、自動的に収益化されるようになりました。あなたのリンクを経由して発生したすべての売上を追跡し、各売上の%5をお支払いします。**現在、Amazonのリンクのみ収益化されています。",
  "data/ph-top/2022/2/serendipity-bot.json": "コミュニティで有意義なつながりを作るのは難しい。私たちは、コミュニティやメルマガ会員の興味に基づいたつながりを作るための無料のマッチングボットを作りました。",
  "data/ph-top/2022/2/firmbee.json": "会社の課題、財務、リモートチーム作業、人事プロセスなどを管理するオールインワンのプロジェクト管理プラットフォームです。",
  "data/ph-top/2022/2/help-ukraine-crowdsourced-list.json": "ウクライナの人々が今まで以上に必要としている情報、寄付のリンク、お金がなくてもできる支援方法などを、みんなでクラウドソーシングできる対話型のリストです。このリストには、あなた自身のリソースが投稿でき、それらは即座に追加されます。",
  "data/ph-top/2022/2/pylon-2.json": "パイロンでは、開発環境を自動的に構築することができますので、環境構築のための無駄な時間を大幅に削減することができます。✅GitリポジトリのURLを記入するだけで、コーディングを開始できます。✅自分の環境を他の人と共有できる。",
  "data/ph-top/2022/2/andi.json": "Andiは、スパムやアドテクノロジーの問題を解決する、無料の次世代サーチエンジンです。I",
  "data/ph-top/2022/2/creative-brew.json": "Creative Brewは、アーティスト、ライター、開発者、ゲームビルダーなど、クリエイターのための新鮮なコンテンツをお届けする週刊ニュースレターです。毎週月曜日は、クリエイターが次のレベルに到達するための力を与え、刺激することを目的としています。",
  "data/ph-top/2022/2/help-ukraine-together.json": "ロシアの侵略に直面するウクライナを支援する慈善団体やNPOを集めました。私たちと一緒に、ウクライナと一緒に立ち上がりましょう。私たちの兵士は、私たちの生活を守るために一晩で50ドルの報酬を得ているのです。今日、寄付をしましょう。",
  "data/ph-top/2022/2/teyuto-2.json": "Teyutoは、Web、モバイル、スマートTVなどあらゆるデバイスで利用可能な、自社ブランドによる独自のオンライン動画プラットフォームをわずか数分で構築するために必要なすべてを提供します。"
}