{
  "data/ph-top/2022/6/aviyel.json": "Aviyel Rewardsは、オープンソースコミュニティのための報酬と承認のプラットフォームです。貢献者は、プラットフォームを超えて、コードと非コードの両方でバッジを獲得し、それを魂のこもったNFTとして鋳造することができます。",
  "data/ph-top/2022/6/typedream-cms.json": "🗂 Notion のデータをウェブサイト上で美しく表示（Airtable、Google Sheets は近日公開） 🤖 NFT ミンティングサイトを作成、CMS で NFT コレクションを表示 Click here to get 10% off any plans: https://build.typedream.com/promo?promoCode=PHCMSYEARLY&utm_source=phcms or https://build.typedream.com/promo?promoCode=PHCMSMONTHLY&utm_source=phcms.",
  "data/ph-top/2022/6/the-crowdsec-console.json": "オープンソースのセキュリティツールであるCrowdSecに接続されたConsoleは、脅威、アラート、改善策の決定を視覚的に探索し、お客様のサービス上のあらゆるIPの疑わしい活動の概要を瞬時に把握できる実用的なデータを提供します。",
  "data/ph-top/2022/6/ui-store.json": "Figma、Adobe Xdをはじめとするデザインファイルを入手することができます。",
  "data/ph-top/2022/6/akaunting-3-0.json": "Akauntingを使えば、会計の専門知識がなくても、日々の帳簿を管理することができます。請求書の送付、支払いの受け取り、収入と支出の追跡を簡単に行うことができます。",
  "data/ph-top/2022/6/rolljak-2-0.json": "Rolljakは、ゲーミフィケーション学習と同期型コラボレーションが融合したプラットフォームです。一口サイズのアクティビティやタイムボックス型のアクティビティで、参加意欲、創造的思考、チームワーク、革新的な議論を数分で促進し、あらゆる機会や参加者の規模に最適なものとします。",
  "data/ph-top/2022/6/equals.json": "Equalsは、あらゆるデータウェアハウスへの接続、最新のバージョン管理、コラボレーションを内蔵した次世代型スプレッドシートです。創業者やスタートアップの経営者にとって、Equals はあらゆる分析を行うための最もシンプルで高速な方法です。",
  "data/ph-top/2022/6/seo-content-assistant-by-searchatlas.json": "コンテンツ最適化とAIを組み合わせ、最強のSEOコンテンツライティングアシスタントを構築しました。自動キーワードクラスタ、AIテキスト生成、オンページSEO、WordPressへの1クリックパブリッシュを1つのツールで実現し、コンテンツ制作を迅速化します。",
  "data/ph-top/2022/6/website-usability-testing-by-useberry.json": "ウェブサイトのユーザビリティに関する問題を特定する。🏆 ユーザーの視点を探り、適切な調整を行う。🔥 ユーザーの行動を分析し、エンゲージメントのパターンを特定する。✨ Web サイトのあらゆる要素における動的なクリックを完全に可視化することができます。",
  "data/ph-top/2022/6/100-custom-podcast-covers-for-free.json": "私たちのデザイナーチームは、あなたのポッドキャストのためのカスタムカバーを無料で作成する準備ができています。購読して、新しいプロフェッショナルなポッドキャストカバーを手に入れましょう。あなたのポッドキャストを素晴らしく見せる🎉 もし疑問があれば、メーカーに質問してください。",
  "data/ph-top/2022/6/slashy.json": "https://slashy.app は、Notion 用のカスタムコマンドを作成するためのオープンソースの拡張機能です。カメラやオーディオの録音、描画、再利用可能なコンポーネントの作成など、さまざまな機能をすべて無料で利用できます。",
  "data/ph-top/2022/6/metricks-io.json": "Metricksは、最先端のアフィリエイトプログラムとシームレスなトラッキング体験を通じて、世界中のSaaS、eコマース、スモールビジネスの規模拡大を支援するために開発されたアフィリエイトマーケティング・トラッキング・ソフトウェアです。",
  "data/ph-top/2022/6/scaleway-2.json": "Scalewayは、開発者や企業があらゆるインフラストラクチャにアプリケーションを構築、展開、拡張できるよう支援します。パリ、アムステルダム、ワルシャワに拠点を置くScalewayは、ヨーロッパで最も急速に成長しているスタートアップ企業を含む25,000以上の企業で利用されています。",
  "data/ph-top/2022/6/monthly-makers-club.json": "あなたは、長い間温めてきたアイデアや、出荷できないであろう長いアイデアのリストを持っていますか？もしあなたがどちらかの質問に「はい」と答えたなら、私たちに参加して、1ヶ月以内にプロジェクトを立ち上げてください。",
  "data/ph-top/2022/6/remote-api.json": "グローバルな給与計算、福利厚生、雇用者記録サービスを、自社のプラットフォームから直接全世界に提供することができます。従業員や給与データをどこからでも閲覧でき、ほぼすべての通貨で支払いを処理し、アプリを立ち上げたまま誰もがどこからでも働けるようにします。",
  "data/ph-top/2022/6/state-of-saas-onboarding-2022.json": "MarTech SaaSセクターにおけるユーザーオンボーディングのベストプラクティスや最新トレンドについて学び、インスピレーションを得ることができます。成功するSaaSビジネスがすでに行っていることを学び、それに応じてオンボーディングフローを最適化しましょう。",
  "data/ph-top/2022/6/day-one-school.json": "ゲイリー・ヴィー、アントラー、ヒューマン・ベンチャーズなどが支援する、創業者のための新しい学校「Day One（デイワン）」。バーチャル、コミュニティ主導、そして実際に起業家志望者をサポートし、導き、教える学校です。本日、私たちは最新のプログラムであるTracksを正式に開始します。",
  "data/ph-top/2022/6/editeddy-by-headliner.json": "EditEddyは、音声編集を簡単にします。話し言葉の音声をアップロードし、高速で信頼性の高いトランスクリプトを取得し、テキストを編集することによって、音声を編集します。ボタンのクリックでフィラー語を削除し、トランスクリプト内の任意のエラーを修正します。",
  "data/ph-top/2022/6/magniv.json": "今日のデータスタックは、昨日のソフトウェアエンジニアのために作られたものです。データサイエンティストは自分たちのツールにふさわしい。MagnivはオープンソースのPythonライブラリで、データサイエンティストがソフトウェアエンジニアのサポートに頼らず、独立してアプリケーションをデプロイできるようにします。",
  "data/ph-top/2022/6/yepic-ai.json": "俳優、カメラ、ポストプロダクションなしで、AIが生成した営業、トレーニング、マーケティング用のパーソナライズドビデオを40以上の言語で作成します。新しいインスタントアバター機能では、彼女の#RoyalAInessのような写真をアップロードしてアニメーション化することができます。",
  "data/ph-top/2022/6/hivoe.json": "Hivoeは、TwitterのフォロワーとDMで会話を始めるキッカケを解決します。なぜ？友達を作るため、オーディエンスがどんなコンテンツを楽しんでいるのかを知るため、製品へのフィードバックを求めるため、などなど、いろいろあります。",
  "data/ph-top/2022/6/untitled-ui-icons.json": "Untitled UI Iconsは、Figmaのための究極のフリーアイコンライブラリです。モダンなUIデザインのために特別に作られた、クリーンで一貫性のある、ニュートラルなアイコンライブラリです。Figmaのために、Figmaで作られました。",
  "data/ph-top/2022/6/api-maker.json": "クリエイターが専門知識を必要とせず、開発者向けのAPIを自分で作ることができ、APIをマネタイズすることができるツールです。完全にNoCode!",
  "data/ph-top/2022/6/mobileaction.json": "モバイルアプリを成長させたいとお考えですか？MobileActionのFree Foreverプランで、競合他社の分析、最新の広告トレンドの発見、キャンペーン管理の自動化が可能になりました。今すぐ登録し、モバイルアプリの成長を次のレベルに引き上げましょう。",
  "data/ph-top/2022/6/slabpixel.json": "購読するだけで、SlabPixelの最高のデザイナーとあなたのクリエイティブな作品を実行するための特典が得られます。月々1,750円からの無制限デザイン・無制限修正で、あなたのビジネスを際立たせましょう。私たちを試してみる準備はできましたか？slabpixel.comをご覧ください。",
  "data/ph-top/2022/6/dispatch-inbox.json": "Slackのメッセージに溺れていませんか？Dispatchは、最も重要なことに集中できるSlack用の&nbsp;Priority Inbox&nbsp;（優先受信ボックス）です。",
  "data/ph-top/2022/6/jelly-card.json": "Jelly Cardは、Instagramの投稿を利用して大きな節約をする画期的な方法を提供します。文字通り、あなたのソーシャルメディアの投稿を利用して、商品を購入することができます。Jelly Cardでお買い物→Instagramに投稿→最大100%のキャッシュバックを獲得！というシンプルな流れです。",
  "data/ph-top/2022/6/trust-center-by-drata.json": "Trust Centerは、あなたのビジネスが日々行っているセキュリティとコンプライアンス対策を公に紹介する新しい方法です。Drataによる継続的なリアルタイムのコントロール監視に加え、SOC 2、ISO 27001、GDPRなどの認証や証明書を共有できます。",
  "data/ph-top/2022/6/diablo-immortal.json": "Diablo Immortal™は、Diablo® II: Lord of Destruction®とDiablo III®の間を舞台にした、Blizzard Entertainmentの全く新しいモバイルゲームです。⠀ 悪魔の軍勢と激突し、壮大な戦利品を集め、想像を絶する力を手に入れましょう。🪓",
  "data/ph-top/2022/6/woice-2.json": "自分のペースで、同僚の話を聞き逃すことなく、音声で会話を始めましょう。Woiceは23ヶ国語に対応しており、世界中の同僚と音声メッセージや自動文字起こしで温かみのある会話をすることができます。",
  "data/ph-top/2022/6/notion-os-dashboard.json": "この非常に効果的で適応性の高い、生産性を最適化したライフマネジメントダッシュボードで、あなたの集中力を養ってください。このダッシュボードは、プロジェクト、タスク、時間、目標、顧客、財務、メモ、書籍、ブックマークを可能な限り効果的に管理するのに役立ちます。",
  "data/ph-top/2022/6/state-of-databases-2022.json": "Basedashが初めて実施した「2022年データベースの現状調査」では、スタートアップから企業まで数百社の開発者に、データベース技術に関する意見を求めました。トレンドやツールの発見、業界の方向性の確認にお役立てください。",
  "data/ph-top/2022/6/crayon-2.json": "どんなベクターイラストにも、生命、動き、アニメーションを加えることができます。シンプルなコントロールで、スピード、角度、歪み、塗りつぶしまで、アニメーションのすべてをカスタマイズできます。ランディングページ、メール、アプリなどに最適です。",
  "data/ph-top/2022/6/desky.json": "Deskyは100％無料のアプリで、チームはオフィス内のワークスペースを簡単に予約でき、管理者は可視性、生産性、安心感を得ることができます。",
  "data/ph-top/2022/6/design-maestro.json": "Design Maestroは、Keyboard Maestroアプリの無料エクステンションです。毎日の退屈な作業の時間を節約して、デザインキャリアのより重要な側面に集中しましょう。",
  "data/ph-top/2022/6/stenos.json": "Stenosは、あなたに代わってメモを取るアプリです。あなたが話し合ったことを書き留める、パーソナルアシスタントです。会議の内容を詳細に記憶することができます。59カ国語に対応し、あなたのプライバシーを第一に考えて設計されています。",
  "data/ph-top/2022/6/commit-club-2.json": "コミットクラブは、日々のチャレンジと習慣をインセンティブにします。ステイクドまたは無料。Web3またはEメールでのサインアップ。公開または非公開 Stakedは、失敗したチャレンジのステークを受け取ることができるというボーナスがあります。誰かが失敗したら、その人のステークスの一部を受け取ることができます。",
  "data/ph-top/2022/6/detail-3.json": "素晴らしい映像を作るのは、本当にクソ難しい。Detailはそれを簡単にします。シームレスなビデオ制作であなたの創造力を解き放ちましょう。録画、ストリーミング、編集を1つのシンプルでパワフルなアプリで行います。",
  "data/ph-top/2022/6/weekly-visitor-report-2-0-by-clearbit.json": "週次訪問者レポートでは、あなたのサイトを訪問している企業の週次インタラクティブダッシュボードを無料で入手できます。2.0では、どの企業が購入する準備ができているのかを知ることができます（こんにちは、インテント・データです！🚀）。新機能：訪問者のタグ付け、共有、フィルタリング、チャンネル分析、その他。",
  "data/ph-top/2022/6/isometric-3d-icons-animated-scenes.json": "3Dスタイルのアイコン、エレメント、アニメーションコンセプトのセットで、240の使用可能なアイコン、120のプレメイドシーン、25のアニメーションシーンが含まれています。アセットには、4K解像度、Figma、PNG、webM、MP4、および編集可能なソースデザイン（GLTF形式）が含まれます。",
  "data/ph-top/2022/6/wolfy-3.json": "無料ソーシャル推理ゲーム 🐺 ルールがわかりやすい、潜入した人狼に村が対抗する 💻 Web、iOS、Android 🏆 リーダーボード 🔮 20の役割 🔓 公開、非公開ゲーム 👨👧 2百万プレーヤー すべてのリモートチームにお勧めする道具です。",
  "data/ph-top/2022/6/tacotranslate.json": "タコトランスレートは、多言語Reactアプリケーションの開発の苦しみからあなたを解放します。😎 インポート/エクスポートは不要です! 👌 重複もハードコーディングもなし! 👍 あなたの文字列と翻訳を管理し、新しいローカライズを処理します。",
  "data/ph-top/2022/6/yin-finance.json": "YINファイナンスは、様々な戦略に加入することで、効果的な高利回りを実現するマルチストラテジーNFT資産運用プラットフォームです。新たに開始された固定金利商品 Smart Seller & Dip Chaserは、最大15%APRの固定利回りを提供します。",
  "data/ph-top/2022/6/sequin-2.json": "Sequinは、Stripe、Airtable、SalesforceなどのAPIからPostgresデータベースのテーブルやカラムにデータをリアルタイムに同期します。ポーリング、Webhooks、クエリパラメータ、HTTPエラーはもう必要ありません。この機能は、1時間以内に出荷されます。",
  "data/ph-top/2022/6/400-okr-examples-directory.json": "OKR Examples Directoryは、Google、Netflix、SpotifyなどのOKR事例を集めた無料のディレクトリです。",
  "data/ph-top/2022/6/figma-templates.json": "FIGMA TEMPLATESは、デザイナーのためのデザインアセットを無料で入手できるサイトです。新しいデザイン制作の出発点として、高品質なデザインファイルやファイル形式を入手してください。",
  "data/ph-top/2022/6/mvp-2.json": "コールドアウトリーチってどうやるの？共同創業者はどこで見つければいいですか？プロダクトをバイラルにするには？MVPは、マイケル・サイベル、ジュリアン・シャピロ、レニー・ラチツキーといった人々が作成した100以上のプレイブック、ブログ、リソースを集めた精選されたデータベースです。",
  "data/ph-top/2022/6/frens-money.json": "Frens.Money- Ethereum上に構築されたソーシャル経費プラットフォームで、ユーザーは以下のことができる。 1.友人間で経費を分割して追跡する 2. お金を要求し、支払いを行う",
  "data/ph-top/2022/6/the-permissionless-apprentice-by-vv.json": "インターネット上でチャンスを生み出す方法を知りたいですか？あなたと一緒に仕事をすることを簡単に決められるような作品を作りたいですか？含まれるもの -ゲストモジュールとケーススタディ -演習/実践 -新しい機会を発見するための精神的なフレームワーク",
  "data/ph-top/2022/6/beatopia.json": "Beatopiaはラッパーとシンガーのための初めてのビーツサブスクリプションです。プロデューサーのクレジットには以下のものがあります。Kehlani, Gunna, NBA Youngboy, Lil Pump, Katy Perry, Jonas Brothers, Wizkid, Skepta. すべてのビートは、ステムと無制限の権利付きです。",
  "data/ph-top/2022/6/notion-quote-widget.json": "わずか数クリックで埋め込み可能なカスタムNotionの引用を作成します。毎日新しく生成されたインスピレーションを与える引用を取得するか、独自のカスタム静的な引用を入力します。このウィジェットは完全に無料で使用することができます。それが役立つことを願っています",
  "data/ph-top/2022/6/10-login-screens.json": "🔍 10種類のログイン画面 - UI Kit あらゆるアプリで再利用できる10種類のユニークなログイン処理のパッケージです。",
  "data/ph-top/2022/6/flow-club-lounge.json": "Flow Club Loungeは、カフェインやドラッグを使わずに、集中力とモチベーションを瞬時に高めることを可能にします。その秘密は？ソーシャル・アカウンタビリティ。Fast Company、Protocol、Computer World、Slateで紹介されたコワーキング・ムーブメントに参加しませんか？",
  "data/ph-top/2022/6/illustrations-2.json": "どんなデザインにも合う、カラフルなイラストの大集合。パックには、Figma、Sketch、Adobe Illustratorに対応した完全なベクターシェイプが含まれています。すべてSVGとPNG形式で無料で利用可能です。",
  "data/ph-top/2022/6/notebook-os.json": "すべてのメモをデジタルワークスペースに一元化する、パワフルで美しいメモシステムです。",
  "data/ph-top/2022/6/universitydao.json": "UniversityDAOは、大学システムのトークン化を通じて、学生の負債をなくし、大学が自分たちの大学を所有できるようにすることを目指す分散型自律大学です。",
  "data/ph-top/2022/6/reform-free.json": "Reform Free は、フォームビルダーの Reform の100%無料版です。美しく、清潔感のある、ブランド力のあるフォームを作成するためにご利用ください。コードは必要ありません。",
  "data/ph-top/2022/6/magical.json": "Magical は、統合することなく、キーを押すだけで、タブ間のデータ移動による煩雑な作業を自動化することができます。メッセージ、シート、フォームの入力は、時間のかかるコピー＆ペーストなしで行えます。どのサイトでも使える 💪 数秒でセットアップ 💥 すべての人に自動化を。",
  "data/ph-top/2022/6/purpur.json": "Purpur Appは、深い＆透明な人間関係を築くためのメンタルヘルスアプリです。人々は専門家が選んだセックスや人間関係に関する質問に答え、自分の願望を打ち明け、コミュニケーションを学びます。",
  "data/ph-top/2022/6/call-of-fame.json": "Call of Fameへようこそ - Chilipiper、LeadIQなど、SaaS界の優秀なSDRによるリアルなコールドコールを聞くことができます。クロージングのテクニックを学び、自分のアプローチを再定義し、毎月160%のノルマを達成する方法を発見することができます。",
  "data/ph-top/2022/6/web-page-design.json": "Web Page Designの高品質なカスタマイズ可能なランディングページのコレクションが増え続けています。高品質で便利、レスポンシブなランディングページのコレクションは、あなたの時間を大幅に節約してくれます。誰でもワンクリックでダウンロードできます。個人利用は無料です。",
  "data/ph-top/2022/6/yep-3.json": "Ahrefsチームは、約6000万ドルの資金を投入し、広告収入の90％をコンテンツ制作者と共有する収益モデルを持つ、制作者に優しい検索エンジン「Yep」を構築しました。",
  "data/ph-top/2022/6/amofit-s-3.json": "微弱な電流で迷走神経を刺激する世界最小のバイオエレクトロニクス・ウェアラブルデバイスです。睡眠パターンの調整から、不安やストレスレベルの軽減など、さまざまな効果が期待できます。臨床的に承認されています。1日30分。72時間以内に最初の結果が出ます。",
  "data/ph-top/2022/6/0-1-000-twitter-followers-dashboard.json": "Notion Dashboardは、Twitterの旅で最も困難な部分である、0から1,000人のフォロワーを獲得することを支援するために設計されています。",
  "data/ph-top/2022/6/story-alley.json": "Story Alleyは、クリエイティブストーリーテラーが集まり、業界のニュースやトレンド、コンテンツを次のレベルへ引き上げるためのリソースについて、常に最新の情報を得ることができる場所です。ニュース、ヒントやコツ、楽しい事実が週に一度、直接配信されます。",
  "data/ph-top/2022/6/what-should-i-tweet.json": "\"What Should I Tweet \"は、Twitterのアイデアを教えてくれるシンプルなジェネレータです。- 読み込むと、何を投稿すべきかのヒントがランダムに表示されます。- Generate \"をクリックすると、さらに3つのアイデアが表示されます。- それぞれのプロンプトにテキストフィールドがあり、書く練習ができます。どうぞお楽しみください。",
  "data/ph-top/2022/6/loopple-landings.json": "Loopple Landingsは、Bootstrapの上に構築された美しいHTMLレスポンシブランディングページ＆ダッシュボードのテンプレート集で、あらゆるユースケースに対応するように作られています。テンプレートをダウンロードするか、Loopple Builderで複製・編集するだけです。",
  "data/ph-top/2022/6/smart-tips-by-usetiful.json": "UsetifulのSmart Tipsは、押し付けがましくない方法で、製品のユーザー普及率を向上させるシンプルな方法です。🎯 ホットスポットビーコンがユーザーの注意を引く ℹ️ ツールチップが必要な瞬間にガイダンスを提供 💖 ビジュアルエディターでコーディング不要",
  "data/ph-top/2022/6/orion-2.json": "Orionは、デバイスのバッテリーを人質に取ることなく、高速でスムーズな軽量ブラウジング体験を提供します。ChromeとFirefoxの拡張機能を（実験的に）サポートしています。Orionは、完全にゼロ・テレメトリーです。",
  "data/ph-top/2022/6/lingvanex-on-premise-translation-server.json": "オンプレミス翻訳サーバーは、テキスト、HTML、ドキュメント、オーディオの無制限機械翻訳のために構築されています。110ヶ国語の超高速翻訳と完全セキュアな翻訳を定額で提供します。",
  "data/ph-top/2022/6/unreal-speech.json": "初の超低価格で超リアルなAIナレーター。オーディオブック的なサウンドになるように訓練されているので、記事、ブログ、ニュースレター、書籍、PDFなどのナレーションに最適です。AWSと横並びで比較。",
  "data/ph-top/2022/6/setops.json": "開発者が待ち望んだクラウドエクスペリエンス。コンテナやデータベースなどを自分のAWSアカウントで数分以内に実行できます。運用やクラウドの知識は必要ありません。Herokuと同じくらい簡単です。✨",
  "data/ph-top/2022/6/tydo.json": "Shopifyのストアデータを、あなたが好きなツールやチャネルと組み合わせて、インサイトのシングルソースを作成します。株式会社バースデイト、Dose、Discoに愛用されています。",
  "data/ph-top/2022/6/reclaim-google-calendar.json": "タスク、定期的なイベント、1対1のミーティング、休憩などの最適な時間をGoogleカレンダーから自動的に見つけ出し、毎週7.6時間/人のチームメンバーを節約することができます。Reclaim.aiで永久無料です。",
  "data/ph-top/2022/6/cft-illustrations.json": "NFTパッケージの利点を最大限に活用する。75枚のイラストとアバターを置いています。お好みに合わせて調整・加工し、高評価を獲得してください。",
  "data/ph-top/2022/6/dorik-cms.json": "Dorik CMSをご紹介します。シンプルでリーズナブル、そしてフレキシブルなホワイトレーベルCMSプラットフォームです。ブログ、ジョブボード、ディレクトリなど、あなたやあなたのクライアントのために、コードを書くことなく、あらゆるタイプのウェブサイトを構築します。",
  "data/ph-top/2022/6/copyfoundry.json": "CopyFoundryは、マーケターやビルダーのためのブランドポジショニングとコピーライティングのライブラリです。CFを使って、あなたのステージでベスト企業がどのようにコピーを書いたかを見たり、競合のメッセージを追跡したり、時間のかかる調査をせずにランディングページの作成を簡単にすることができます。",
  "data/ph-top/2022/6/simple-estimate.json": "チームのコラボレーションを高め、ミスが起こりやすいスプレッドシートよりも正確なプロジェクト見積もりを実現します。あらかじめ定義された役割とレートカードにより、すばやく見積もりを作成し、社内の関係者や顧客と共有することができます。",
  "data/ph-top/2022/6/tech-job-referrals-by-exponent.json": "Google、Meta、Amazon、その他のトップクラスのハイテク企業の従業員からの求人紹介で、より多くの面接を受けることができます。",
  "data/ph-top/2022/6/opal-web3-jobs.json": "Web3の仕事を発見し、友人と一緒にビルドを開始します。",
  "data/ph-top/2022/6/quoram.json": "クオラムは、クリエイターがトークンを使って会員制コミュニティを構築するための、コード不要の無料Web3プラットフォームです。ファンはNFTを鋳造し、あなたのコミュニティやあなたが選んだ限定コンテンツや体験にアクセスすることができます。",
  "data/ph-top/2022/6/umbrel-2.json": "Umbrel は、Nextcloud, Matrix, Bitcoin/Lightning node, Pi-hole, HomeAssistant などのセルフホスティングアプリを誰でも利用できるようにする美しいパーソナルサーバーOSです。Raspberry Pi や、Linux/Debian が動作するあらゆるハードウェア（またはクラウド）にインストールすることができます。",
  "data/ph-top/2022/6/airpods-wtf.json": "AirPods.WTF」を作ったので、AirPodsを通話時の入力デバイスと出力デバイスの両方として使っているだけで、会議でひどい声を出していることに人々が気づきます。ベストプラクティスは、MacBookの内蔵マイクを使い、AirPodsを出力デバイスとしてのみ使用することです。",
  "data/ph-top/2022/6/aroma-api-2.json": "Aroma APIは、カレンダー、プロジェクト管理、CRM、ドキュメントコミュニケーションなど、あらゆるツールを統合して高速にスケールするための汎用的なAPIです。データを標準化することで、あらゆるアクションやインサイトを素早く取得することができます。",
  "data/ph-top/2022/6/skipp.json": "リモート技術者プラットフォームは、審査、テスト、面接、キュレーション、品質保証のための継続的なマネージドサービスを組み合わせ、迅速かつ効果的に製品を立ち上げることができる、これまでにない方法です。",
  "data/ph-top/2022/6/trading-across-brokerages-by-front.json": "もうアプリを切り替えなくていい！？フロントでは、すべての資産を一箇所で確認できるだけでなく、それらの資産で取引を行うことができます。Frontの新しいトレード機能により、Frontアプリ内でトレードの発注とモニタリングが可能になりました。",
  "data/ph-top/2022/6/feeting-app.json": "自由になり、好きな場所でミーティングができる。散歩に出かけ、新鮮な空気を吸い、太陽を浴びましょう。Feeting Gems™ テクノロジーが自動的にメモを取るので、Feetingの後、誰もが自分の行動、フォローアップ、トピックを直接把握することができます。",
  "data/ph-top/2022/6/email-signature-generator-by-reply.json": "パーソナルブランドを強化し、見込み客に強い印象を与えたいとお考えですか？無料のメールシグネチャジェネレータでプロフェッショナルなメールシグネチャを作成しましょう✨。",
  "data/ph-top/2022/6/growth-hacks-weekly.json": "グロースハック・ウィークリー」は、毎週日曜日の夕方に、インパクトのあるグロースマーケティングハックを1つ、無料でお届けする、急成長中のマーケティングニュースレターです。Forbesの「購読すべきトップマーケティングニュースレター」にも選ばれた、マーケティングマックスが執筆しています。",
  "data/ph-top/2022/6/bueno.json": "Buenoは、NFTクリエイターがNFTコレクションを生成し、スマートコントラクトを迅速に展開するためのノーコードツールのセットです。アセットをアップロードし、レアリティで遊び、ルールを設定し、セットをプレビューするだけで、マルチチェーンメタデータを含むコレクションを数秒で開発できます。",
  "data/ph-top/2022/6/lottiefiles-for-wordpress.json": "50,000以上の無料のLottieアニメーションにアクセスして、どんなWordPressサイトにも追加することができます。再生オプションのカスタマイズなど、さまざまな機能をコードレスで利用できます。",
  "data/ph-top/2022/6/cryptohunt.json": "ブロックチェーンとは？web3は意味があるのか？なぜビットコインはプラネットキラーなのか？Cryptohuntへようこそ！暗号を始めるための場所です。基礎知識を学べる無料の楽しいクイズをたくさん楽しみ、エキサイティングな暗号プロジェクトを発見しましょう。",
  "data/ph-top/2022/6/ai-paraphrasing-tool-by-contentbot-ai.json": "最大2000語の記事を、内蔵の言い換えツールで素早く簡単に言い換えることができます。私たちは、このツールを他のツールと比較しましたが、他のツールに勝るとも劣らないものでした。",
  "data/ph-top/2022/6/influencer-analytics-by-buzzguru.json": "YouTube、Instagram、TikTok、Twitchのインフルエンサープロフィールを確認できるChrome用プラグイン「BuzzGuru」。ソーシャルメディアプラットフォームをサーフィンしながら、インフルエンサーのパフォーマンスとコンテンツに関する分析を得ることができます。",
  "data/ph-top/2022/6/tresl-segments.json": "Segmentsは、Shopifyとマーケティングチャネルからのデータを組み合わせて、収益性の高いセグメントとインサイトを明らかにします。セグメントを一箇所で管理し、メール、SMS、広告キャンペーンに拡張することができます。ILIA Beauty、Meshki、Sol De JaneiroなどのShopifyアナリティクスツールに最適です。",
  "data/ph-top/2022/6/preline-ui.json": "Preline UIは、ユーティリティファーストなTailwind CSSフレームワークをベースにした、プレビルドUIコンポーネントのオープンソース・セットです。",
  "data/ph-top/2022/6/invezo-2.json": "Invezoは、包括的な暗号解析ツールおよびAPIです。市場やオンチェーンデータから開発者やソーシャルメディアの活動まで、暗号経済のあらゆる側面からリアルタイムのデータを統合します。",
  "data/ph-top/2022/6/nf-tim-by-creative-tim.json": "NF-Tim by Creative Tim は、Elrond をベースにした、開発者とデザイナーのための最初の NFT ユーティリティプロジェクトです！ 🚀 NF-Tim by Creative Tim は、Elrond をベースにした、開発者とデザイナーのための最初の NFT ユーティリティプロジェクトです。私たちのプロジェクトの特徴は、NFTが実際に即座に適用できるユーティリティを備えていることです。",
  "data/ph-top/2022/6/awsify-by-digger.json": "AWSifyはHerokuからAWSへの移行を容易にする。AWSifyはあなたのAWSアカウントを設定し、あなたのアプリを数分で移行することができます。高価なブラックボックスはAWSifyで置き去りにしてください。",
  "data/ph-top/2022/6/the-bitcoin-note.json": "安全なNFCチップのBitcoinに裏打ちされた、美しい印刷の現金紙幣です。各札は、安全な印刷技術を使用した通貨グレードの要素で印刷されています。",
  "data/ph-top/2022/6/scale8.json": "Google タグマネージャと Google アナリティクスに代わる、高速でシンプル、オープンソースでプライバシーに配慮したソフトウェアです。パブリッシャーにとって最も重要な機能とツールを提供することに重点を置いています。このプロジェクトは、お客様のクラウドプラットフォーム上で完全に無料で実行することができます。",
  "data/ph-top/2022/6/remotehq-2-0.json": "ダウンロード不要で、あらゆるWebアプリを即座に連携させることができます。チームや顧客と一緒に使うことができます。セールスデモ（見込み客に試乗してもらう、⬆️成約率）、サポート（伝えるより見せる、⬇️時間や解約の処理）、チームコラボレーション（⬆️生産性）などに利用できます。",
  "data/ph-top/2022/6/mixo.json": "Mixoは、短編動画を通じてフードコンテンツと交流する新しい方法です。私たちは、クリエイターのために、魅力的なフードコンテンツの作成、配信、マネタイズを簡単にできるようにします。また、視聴者にとっても、コンテンツを見つけ、消費し、整理することが簡単にできるようにします。",
  "data/ph-top/2022/6/the-inbox-zero-challenge.json": "Inboxゼロで、仕事もプライベートも健康でハッピーに。Inbox Zeroチャレンジは、Gmailを自動的に同期し、その日の受信箱の目標に達したかどうかをワードルグラフの視覚化で毎日更新します。受信トレイゼロを楽しく、そして責任あるものにしましょう",
  "data/ph-top/2022/6/the-adalo-app-academy.json": "Adalo App Academyは、ノーコードの世界では他に類を見ない100以上のリソースからなるライブラリです。私たちは、単にアプリを作る方法を超えて、ビジネスの構築を支援します。創業者や専門家から自分のペースで学び、あなたのアイデアに命を吹き込んでください。",
  "data/ph-top/2022/6/json-hero-chrome-extension.json": "新しいJSON Hero Chrome拡張機能を使うと、プレーンなJSONブロブに対してChromeから簡単にJSON Heroを利用することができます。また、Firestoreドキュメント、Githubファイル、Open Graphメタデータを抽出し、開くことができます。JSON Heroはオープンソースなので、自分自身のインスタンスを指定することもできます。",
  "data/ph-top/2022/6/linktree-marketplace.json": "Linktree Marketplaceには、Typeform, Reddit, Gleam, Cameo, Spring, Spotify, SoundCloud, GoFundMe, PayPal, Square, OpenSea, Shopify, TikTok, Twitch, Twitter, YouTubeなど30以上のパートナーやサービスからのリンクアプリとインテグレーションが掲載されています。",
  "data/ph-top/2022/6/curio-3.json": "Curioは、ノイズの中からシグナルを見つけ出すことを支援するNFTインテリジェンスツールです。パワフルな洞察力とワールドクラスのUXを併せ持つCurioは、非常に高速で使い勝手が良く、マーケットを簡単に理解することができます。",
  "data/ph-top/2022/6/sublus-1-0.json": "Sublusは、120以上のパーツで簡単にカスタマイズできるイラストレーション製品です。キャラクターやアバターを作ったり、既存のシーンに合わせたりすることができますよ。*psps完全無料です😽。",
  "data/ph-top/2022/6/emelia.json": "https://emelia.io と19€/月（3アカウント込み）で何ができるでしょうか？日、時間、分単位でコールドメールシーケンスを送信 ⏱ 制限と条件を設定 ⚒ 強力なレポートと A/B テスト 🤖 Zapier、n8n または Make https://app.emelia.io/signup?lng=en でワークフローを自動化する。",
  "data/ph-top/2022/6/absurd-design-chapter-4.json": "ランディングページやステータスページ、アプリ、ニュースレターやプレゼンテーションなど、さまざまなデジタルプロジェクトに人間味を添える手描きの不条理イラストシリーズ&nbsp;を提供するプロジェクト「absurd.design」です。",
  "data/ph-top/2022/6/slite-discussions.json": "Sliteは、リモートチームが最高の仕事をするための場所です。最新のアップデートでは、リモートコラボレーションに最も重要な2つの要素、文書化と意思決定が統合されました。ディスカッションを開始し、明確で文書化された意思決定で終了します。",
  "data/ph-top/2022/6/drunk-startups-by-thursday.json": "酔っぱらいスタートアップ＝クレイジーなアイデア＋ホワイトボード作成＋ピッチング＋資金調達 このような楽しいソーシャルを、遠隔地のチームのために開催することができます。木曜日から始まるこの全く新しいミキサーを無料でお試しください。クレジットカードは必要ありません。",
  "data/ph-top/2022/6/tabulio.json": "Tabulioは、世界中のデジタルクリエイター（開発者、ライター、デザイナーなど）が互いにつながり、クリエイティブな作品を発表し、グローバルな仕事の機会を楽しむことができるプロフェッショナル・ソーシャルネットワーキング・プラットフォームです。",
  "data/ph-top/2022/6/indigo-tech-recruiters-rod.json": "人材獲得KPIが遅れているが、フルタイムのリクルーターをもう一人雇いたいとは思わない？経験豊富な技術系リクルーターの手を借りれば、12時間以内、時給45ドルから、あなたのチームと一緒に働くことができます。",
  "data/ph-top/2022/6/seo-tactics-2022.json": "SEOをビジネスに活用するために使える戦術。",
  "data/ph-top/2022/6/venex.json": "ストック・オプションのリターンは、あまりに遠く、予測不可能です。VenExは、将来のキャッシュフローを実力に応じて分配することで、従業員に「真の」富を提供することを可能にします。当社のプラットフォームはそれをエンドツーエンドで自動化し、「雇う。雇用する。報酬を与える。10倍良くなる！\"",
  "data/ph-top/2022/6/milanote-for-ipad.json": "Milanoteは、あなたのアイデアやプロジェクトを美しいビジュアルボードに整理するお手伝いをします。新しいiPadアプリで、外出先でもアイデアをスケッチしたり、インスピレーションを集めたり、タスクを整理することができます。",
  "data/ph-top/2022/6/markettailor.json": "Markettailorは、B2Bマーケティング担当者がウェブサイトをパーソナライズし、リードジェネレーションを50～200%向上させることを支援します。すぐにクリックされ、ニーズに共鳴するコンテンツを表示することで、サイトを訪れた企業が離脱する前に注意を引くことができます。",
  "data/ph-top/2022/6/a-to-z-of-pricing-and-monetisation.json": "プロダクト、マーケティング、グロース担当者に聞いてみると、プライシングとマネタイゼーションは最もエキサイティングな問題提起であると言うでしょう。13以上の企業のケーススタディとともに、興味深いプライシングモデル、戦略、プライシング心理学ハックを学びます。",
  "data/ph-top/2022/6/linksome.json": "Linksomeを使えば、すべてのコンテンツを1つのパーソナライズされたページに集め、1つの便利なリンクを貼ることができます。個人的な#linkinbioのページにLinksomeを使うことも、チームと一緒に会社のプロフィールを作ることもできます。Linksomeは、すべての人のためのクリエイティブな#linkinbioソリューションです。",
  "data/ph-top/2022/6/hovrly.json": "こんにちは、私たちはHovrlyです。分散型チームのための、小さくてほとんど見えないパートナーです。時間の価値を知っている人たちによってデザインされました。必要なだけタイムゾーンを追加してください。タイムトラベルスライダーで会議のスケジュール管理",
  "data/ph-top/2022/6/pulse-automatic-status-for-slack.json": "Pulseは、あなたの好み、⚡️集中度、カレンダー、作業時間、使用アプリに基づいて、Slackのステータスをリアルタイムで自動的に更新します - 割り込みが減り、集中時間が増え、コラボレーションを受け入れるタイミングを合図できるなど、さまざまなことが可能になります。",
  "data/ph-top/2022/6/brevy-1.json": "Brevy でビデオを録画することにより、不要な会議やスレッドをスキップ 🔨 既存の PM ツールにプッシュ 🚧 コンソールログとネットワークイベントを自動でキャプチャ 💢ビデオに直接タイムスタンプ付きのコメントを残す 📍 ウェブサイトに注釈をピン配置する"
}