{
  "data/ph-top/2021/8/slickr.json": "Slickrは、hashnodeブログの美しいカバー画像を作成するための、最も強力で最も簡単なアプリです。Slickrでは、背景、グラデーション、パターン、画像、アイコン、ブックマーク、アップロードなど、様々な機能を柔軟に扱うことができます。",
  "data/ph-top/2021/8/boost-c0f1acd1-0a1d-4a8e-8544-e8044e837587.json": "自分のフィットネスレベルやモチベーションに合わせて、1回ごとにカウントされるインタラクティブなトレーニングを受けることができます。ブーストはあなたの動きを見て、モチベーションを高め、フォームを改善するためのヒントを与えてくれます。必要なのはスマートフォンだけです。",
  "data/ph-top/2021/8/24hourhomepage-2.json": "アート＆タイムの遊び心あふれる実験。⏰ 1日のうち、1秒ごとに1枚の画像を訪問して見ることができます。毎日繰り返されます。🔁 永遠に。この楽しい1OAKクリエイティブフォーマットで、ジョークを言ったり、ウェブコミックを宣伝したり、ビジネスを拡大したりしましょう。1日には86,400秒あります。あなたはどれですか？✌️",
  "data/ph-top/2021/8/best-digital-ads-of-2020.json": "The Best Digital Marketing of 2020」では、昨年のベストブランドキャンペーンを紹介しています。- ソーシャルネットワークをハックしたり、映画を撮影したり、大量のPRを生み出して企業を成長させるキャンペーンを行う方法について、100以上の驚くべき事例を紹介しています。",
  "data/ph-top/2021/8/okrshub.json": "OKRsHubは、個人的な目標や仕事上の目標を記録する最も簡単な方法です。Google、Facebook、LinkedInは、実績のあるObjectives and KeyResults(OKRs)を使って組織の目標を追跡しています。OKRsHubを使えば、自分のモチベーションを維持し、軌道に乗せることができるのです。",
  "data/ph-top/2021/8/botion.json": "Botionとの連携により、NotionユーザーはNotionのワークスペースから直接顧客に請求書を送ることができます。設定、顧客の追加、請求書の送信を数分で行うことができます。詳細は https://api.botion.so/guide のドキュメントをご覧ください。",
  "data/ph-top/2021/8/affirm-5.json": "毎日のアファメーションは、あなたの考え方をポジティブシンキングに変えるのに役立ちます。あなたの夢や野望を口に出して肯定することで、毎日のモチベーションを高めましょう。あなたの目標を選択して、毎日パーソナライズされたコンテンツを得ることができます。リマインダーを設定して、1日中配信されます。",
  "data/ph-top/2021/8/coaster-2.json": "Coasterでは、Unsplashの膨大なフリーストックフォトのライブラリから写真を簡単に検索することができます。ダウンロード、クリップボードへのコピーなど、デスクトップ上のシンプルなインターフェイスで様々なことができます。",
  "data/ph-top/2021/8/tryp-com.json": "何千もの航空券、ホテルの価格、目的地を検索して、あなたにぴったりの旅を見つけます。",
  "data/ph-top/2021/8/tactic.json": "Tacticは、コラボレーションと個人的なつながりを、ハイブリッドな組織の中心に据えます。❤️ 私たちは、チームをオフィスに集結させ、オフィススペースの使用状況に基づいて長期的な意思決定を行うためのデータを企業に提供します。😎",
  "data/ph-top/2021/8/frontwork-component-marketplace.json": "高品質なフロントエンドコンポーネントを売買する。React、Vue、HTMLなどの構築済みコンポーネントをダウンロードして、開発をスピードアップしましょう。自分で作ったコンポーネントを販売して収入を得ましょう。",
  "data/ph-top/2021/8/emoji-by-craftwork.json": "絵文字は、感情を表現したり、アイデアを提示したりする新しいクールな方法です。3Dの絵文字を手に入れて、あなたの仕事の要求をすべて満たし、これらのかわいこちゃんたちと楽しみましょう。この絵文字をアプリ、プレゼンテーション、ランディングに導入したり、TelegramやWhatsAppでステッカーとして使用したりすることができます。",
  "data/ph-top/2021/8/zen-2.json": "🧘🏽♀️ Zenは、あなたの姿勢をミラーリングし、あなたがうつむくと優しく警告します。🔐 デスクトップアプリでは、カメラを使って姿勢を監視しますが、映像の記録や保存は行いません。",
  "data/ph-top/2021/8/vin-decode-api.json": "車体番号をプログラムで解読し、年式、メーカー、モデル、トリム、仕様、色、オプションなどを特定することができます。無料のAPIキーを数秒で取得できます。",
  "data/ph-top/2021/8/picmaker-2-0.json": "Picmaker 2.0は、あらゆるものをデザインする最短の方法です。広告、プレゼンテーション、ミーム、ソーシャルポストなど、デザインのインスピレーションが必要なときは、私たちのところに来てください。でも、なぜ私たちは特別なのでしょうか？私たちのAIベースのMAD Buttonは、数分でユニークなデザインの組み合わせを提供します。ぜひ試してみてください。",
  "data/ph-top/2021/8/varos.json": "ROAS、CPA、CPM、CTRなどのFB広告のKPIをリアルタイムでベンチマークします。DTC企業や代理店は、同業他社との比較や、最適化すべき指標の発見、「このCPMの急上昇は、私の広告によるものなのか、それとも市場によるものなのか」などの疑問に答えるために、当社を利用しています。",
  "data/ph-top/2021/8/wicked-backgrounds.json": "Wicked Backgroundsは、デザインに使える素敵な波のグラデーションを生成する無料のウェブアプリです。あなたのクリエイティブなプロジェクトに役立ててください。👨🏻🎨",
  "data/ph-top/2021/8/intro-11.json": "Intro.soを使えば、午後2時の会議に午後1時59分にログインしても、TEDトークのような準備ができます。出席者の会社の詳細、CRMの関連メモ、Linkedinのアクティビティを確認できます。これらはすべて、ZoomやGoogle Meetの中で行われます。",
  "data/ph-top/2021/8/swiftui-apps.json": "ここでは、新しいアプリの情報を得たり、SwiftUIで自分のアプリを作るためのインスピレーションを得たりすることができます。これらのアプリは、SwiftUIの能力を示す最高の例ですので、今すぐサイトにアクセスしてチェックしてみてください。",
  "data/ph-top/2021/8/customily.json": "Customilyは、オンラインショップがパーソナライズされた商品を簡単に販売できるようにします。シンプルかつパワフルなデザインツールで、パーソナライズされた商品のライブプレビューを表示し、それを自動的に印刷、彫刻、刺繍が可能なファイルに変換します。",
  "data/ph-top/2021/8/odo-2-0.json": "Odoは、人生のあらゆるステージで共感できる仲間になることを目指した、マルチスキルを備えた人工知能です。プライベートな秘密の空間で、✅を学び、✅をリラックスさせ、✅を癒すことに焦点を当て、すべて会話で行う、人間のようなセルフケアのためのA.I.です。",
  "data/ph-top/2021/8/yac-remote-work-pack-on-setapp.json": "リモートワークを最適化し、疲れを溜めずに大切なことに集中できる、Mac用の15のツールを集めました。",
  "data/ph-top/2021/8/hyperbeam.json": "Hyperbeamは、離れた場所にいる大切な人たちと一緒に、ネットサーフィンやテレビ番組・映画の鑑賞ができる共有ブラウジングサイトです。無料でご利用いただけます（オプションでPremiumもご利用いただけます）。ダウンロードは不要です。",
  "data/ph-top/2021/8/request-video-by-sendspark.json": "顧客をサポートする最速の方法。Zoomミーティングを予約する代わりに、Gmail、Intercom、Zendeskなどでビデオリクエストのリンクを顧客に送信するだけです。お客様は、自分自身や自分の画面をすぐに録画できます。",
  "data/ph-top/2021/8/citycoins.json": "シティコインは、コミュニティに都市を改善し、プログラムする力を与えるとともに、個人と都市政府の両方に暗号による報酬を提供します。誰もがCityCoinを採掘し、スマートコントラクトを介してプログラムすることができ、さらにネットワークの利用が増えるとBTCを獲得することができます。",
  "data/ph-top/2021/8/integrately.json": "Integrately 2.0 は、技術者でなくても、ワンクリックでアプリを統合し、プロセスを自動化することができます。これを可能にするために、私たちは800万以上の自動化を作成してきました。また、常に追加しています。あなたがするべきことは、自動化を有効にすることです。",
  "data/ph-top/2021/8/the-upside-network.json": "📍 私たちは、地元のクリエイターと提携し、地元のスタートアップメディアを制作します。🎙 ポッドキャストやニュースレターを立ち上げ、維持するためのハードウェア、ソフトウェア、トレーニングを提供します。🎙 私たちは、スポンサーシップと運営を行い、収益を現地のパートナーと共有します。",
  "data/ph-top/2021/8/adonisjs-2.json": "AdonisJSは、RailsやLaravel、Djangoのような、Node向けのデータ駆動型Webアプリケーションの作成を支援するバックエンドフレームワークです。AdonisJSを使用すると、HTTPリクエストの処理、データベースへの問い合わせ、ユーザー認証、ファイルのアップロードなどを行うことができます。",
  "data/ph-top/2021/8/resource-center-by-userguiding.json": "2000人以上のお客様から、すべてのリソースを1つの場所に集める方法を求められていました...だから私たちはそれを作りました 新しい無料のウィジェットを使って、ブログ記事、ヘルプ資料、製品アップデートなどをアプリ内で紹介しましょう。",
  "data/ph-top/2021/8/mapus.json": "Mapusは、地図上を共同で探索したり、注釈を付けたりするためのオープンソースのツールです。描いたり、マーカーや線、エリアを追加したり、行きたい場所を探したり、他のユーザーを観察したりと、様々なことができます。",
  "data/ph-top/2021/8/rentera.json": "RentEraは、従来のレンタル業界のプロセスをデジタル化することで変革することを目的としたオンラインレンタルプラットフォームです。🆓 無料で使用でき、サインアップは不要です。📍 地域別の検索ツールです。🔍 あなたの住んでいる地域にある100種類の商品を見ることができます。",
  "data/ph-top/2021/8/document360-7-0.json": "顧客や従業員向けのセルフサービス型ナレッジベースを瞬時に作成できます（公開または非公開でアクセス可能）。お客様のための素晴らしいナレッジベースを持つことで、サポートチケットの量を減らします。",
  "data/ph-top/2021/8/neuton-ai-1.json": "自動化された人工知能を活用して、データのインサイトを探り、予測を立てる。- コーディングが不要 - 技術的なスキルが不要 - データサイエンスの知識が不要",
  "data/ph-top/2021/8/mailmodo-email-api.json": "Mailmodo API for Transactional Emailは、開発者がメールをコーディングすることなく、APIを使ってトランザクションメールを設定できるようにします。⏳ セットアップ時間の短縮 📧 ユーザーエクスペリエンスとコンバージョンを向上させるメール内のフォーム 📰 数分でメールを作成・編集 📤 実績のある配信能力",
  "data/ph-top/2021/8/evidently-ai.json": "Evidently は、運用中の機械学習モデルの評価と監視に役立ちます。このツールは、モデルのパフォーマンスに関する視覚的なレポートを生成し、問題の検出とデバッグを行います。Githubでリリースをフォローする： https://github.com/evidentlyai/evidently",
  "data/ph-top/2021/8/zesty-3.json": "Zestyの自律型クラウド管理ソリューションは、効率性の向上とクラウド費用の大幅な削減により、成長を加速させます。私たちのプラットフォームは、人の手を介さずに、リアルタイムのアプリケーションニーズに合わせて計算リソースを自動的に調整します。",
  "data/ph-top/2021/8/nocode-bible.json": "バブルの学習曲線を短縮しながら、開発のスピードを上げることができます。無料版では、アクションや演算子、ヒントなどが用意されています。プロバージョンでは、Bubbleアプリを開発する際に必要なものがすべてまとめられています。",
  "data/ph-top/2021/8/corvus-one.json": "完全なL4オートノミーにより、大規模施設のパレットやカートンの在庫確認を自動化。人間のパイロットも、何千もの位置情報シールやビーコンも必要ありません。",
  "data/ph-top/2021/8/startup-blowup.json": "スタートアップがふとしたきっかけで爆発してしまう理由を探ってみましょう。失敗の実話をチェックし、失敗から学び、失敗したスタートアップの仲間入りをしないようにしましょう。Made with ❤️ in Ukraine 🇺🇦.",
  "data/ph-top/2021/8/ppt-2-site-by-slideflow.json": "PPT 2 Siteは、PowerPointファイルをきれいなHTMLとCSSに変換します。完全無料で、ホスティングも付いています。",
  "data/ph-top/2021/8/angel-match-2-0.json": "Angel Matchは、90k以上の投資家のデータベースで、あなたのビジネスに適した投資家を探す面倒な作業から解放されます。このデータベースは、投資対象、ロケーション、投資ステージ、投資家のタイプ別に分類されています。",
  "data/ph-top/2021/8/storylane.json": "Storylaneは、マーケティングチームや営業チームが、クリック可能でインタラクティブな製品デモを作成し、共有することを可能にします。これらのデモをウェブサイトやキャンペーン、セールスフォローアップに埋め込むことで、質の高いリードを獲得し、より多くの取引を獲得することができます。",
  "data/ph-top/2021/8/thundra-foresight.json": "Foresightを使用して、CIパイプラインの完全な観測が可能になります。時間のかかるテストや不具合のあるテストを特定し、グリーンビルドを迅速に実現します。",
  "data/ph-top/2021/8/influencer-marketing-toolkit.json": "好きな有名人が使っているのを見て、影響されて購入したことはありますか？一方で、質の高いインフルエンサーを見つけることは困難です。そこで、クライアントジョイはインフルエンサー・マーケティング・ツールキットを作成しました。",
  "data/ph-top/2021/8/ko-fi-memberships.json": "Ko-fi Membershipsで確実な毎月の収入を得よう! あなたの最も重要なファンが様々なレベルであなたをサポートし、Discordでの役割、限定コンテンツ、物理的な報酬などのユニークな特典をアンロックしましょう。",
  "data/ph-top/2021/8/week.json": "Weekは、カレンダーを中心としたタスク管理ツールです。物事を成し遂げるには、まずスケジュールを立てる必要がありますが、Weekはまさにそれをサポートします。プロジェクトを作成し、それぞれに色をつけて、一日の過ごし方を確認しましょう。",
  "data/ph-top/2021/8/doubletick-for-gmail-2.json": "https://www.getdoubletick.com は、GmailとG-Suite用の無料かつ無制限のメール追跡ツールで、メールが受信者に読まれた場合、ダブルチェックマーク✔✔を追加し、リアルタイムで通知します（WhatsAppのように）。",
  "data/ph-top/2021/8/meh-camera.json": "MEHカメラへようこそ 写真を撮って、顔を自分がアップロードしたものと入れ替えてみましょう。楽しくて、MEHツウじゃない。",
  "data/ph-top/2021/8/1300-geometric-shapes.json": "これは完全に無料のコレクションです。お好きなようにお使いください。Figmaにも対応しています。",
  "data/ph-top/2021/8/mockfire.json": "Mockfireは、デザイナーやマーケターがインタラクティブなモックアップを作成し、ソーシャルメディアやGoogle広告のコンテンツをよりプロフェッショナルに表現することを可能にします。また、MockfireはGoogleバナー広告用のモックアップエディタを統合した最初のツールです。",
  "data/ph-top/2021/8/vinco.json": "Vincoは、企業が従業員の教育費を簡単に負担できるようにすることで、ラテンアメリカにおける大きなスキルギャップに対応し、従業員の定着率を向上させています。",
  "data/ph-top/2021/8/sugarokr.json": "シンプルで使いやすい、チームのための無料のOKR管理ソフトウェアです。SugarOKR は、チームが本当に重要な目標に集中し、会社の大きなビジョンに沿ったものにします。",
  "data/ph-top/2021/8/plai-2.json": "Plaiは、クリエイター、ソロプレナー、サイドハスラーのための広告ツールで、YouTube、TikTok、Google、Instagram上で、経験を必要とせず、数秒でターゲット広告を打ち出すことができます。",
  "data/ph-top/2021/8/teqatlas.json": "TeQatlasを使えば、創業者と投資家はお互いを見つけ、マッチングし、コミュニケーションし、ドキュメントを共有し、3倍速く取引を終えることができます⚡。",
  "data/ph-top/2021/8/mysignature-agency-hub.json": "Agency Hubは、マーケティングエージェンシー、デザインスタジオ、ITサービスプロバイダー向けの電子メール署名管理ソリューションです。✍️お客様のブランディングに合った署名を作成することができます。🙌ダッシュボードでお客様の署名を管理することができます。",
  "data/ph-top/2021/8/focus-323cb154-59ed-4497-b7dc-6a92f00a9e19.json": "会社のすべてのOKRを管理し、Focusでその進捗を確認する。毎日のチェックインで、アクションアイテムと最重要目標を結びつける。目標に沿ってチームを編成し、より良い結果を出す。そして、それをシンプルで直感的なインターフェースで実現します。",
  "data/ph-top/2021/8/virtuali.json": "Virtualiは、アバターや部屋をパーソナライズしたり、新しいつながりを作ったり、郵便局でポストカードを送ったり、仮想世界を体験したりすることで、オンラインでの対面体験を再現することを目的とした、ビジュアルな世界観を持つソーシャルプラットフォームです。",
  "data/ph-top/2021/8/flowdash-2-0.json": "Flowdashは、あらゆるデータベースクエリを本格的な社内ツールに変えることができます。データベースに接続するだけで、数分でアプリを構築することができます。コラボレーション、タスクトラッキング、チェックリスト、自動化などの機能が組み込まれており、プロセスを効率化します。",
  "data/ph-top/2021/8/modifai.json": "ModifAI.directは、これまで手作業で行っていたECサイト用の画像編集をAIで完全に自動化することで、画像編集のあり方を変えていきます。単純な背景除去だけでなく、一般的なEC画像のニーズにも対応していきます。",
  "data/ph-top/2021/8/walrus-3.json": "Walrusは、インドの若者を中心としたネオバンクで、インド人の貯蓄、消費、投資の向上を支援しています。Walrusは、24時間365日稼働し、2分で開設できる、完全デジタルのスマートな当座預金を提供しています。洗練されたネオンカラーのVISAカードは、柔軟な管理と素晴らしい特典を提供します。",
  "data/ph-top/2021/8/js-kid-pix-1-0-2021.json": "Kid Pix 1.0にはたくさんの思い出があるので、それをウェブサイトとしてリメイクしました。",
  "data/ph-top/2021/8/image-resizer-by-biteable.json": "Biteableのシンプルな無料画像リサイザーで、一般的なソーシャルメディアや広告フォーマットに合わせて画像をリサイズしましょう。フォーカスポイントを設定し、ワンクリックで50以上のフォーマットすべてをダウンロードできます。サインアップは不要です。",
  "data/ph-top/2021/8/buddy-15.json": "チームによるCI/CD導入時間を87%短縮 最も複雑なCI/CDワークフローでも数分で作成可能。BuddyはDevOps導入の勝者です。平均デプロイ時間12秒 スマートな変更検知、最先端のキャッシング、並列処理、最適化",
  "data/ph-top/2021/8/koia.json": "あなたが知っている、そして愛しているものに、Koiaで投資してみませんか。Koiaでは、象徴的な資産を分数化して、誰もが投資できるようにしています。まずは、高級ワインや時計、ポケモンカードなどのコレクターズアイテムからスタートしています。",
  "data/ph-top/2021/8/kensho-care-matching.json": "本日、ケンショーは「ケア・マッチング」を発表しました。これは、健康上の目標や好みに応じて個人的に医療機関を推薦し、患者をより迅速に適切なホリスティック・ケアにつなげる1対1の無料サービスです。",
  "data/ph-top/2021/8/gobillion-2.json": "GobillionはインドのPinduoduoです。私たちは、インドのTier2以上の都市に住む4億人の顧客のためにEコマースをソーシャル化し、顧客がグループで一緒に購入してお得な情報を得られるようにします。",
  "data/ph-top/2021/8/palenca.json": "Palencaは、ラテンアメリカの企業が雇用データや身元を簡単に確認できるようにし、身元調査や金融サービスの提供を可能にします。KavakやLalamoveのようなユニコーン企業は、金融サービスの提供や身元調査にパレンカを利用しています。",
  "data/ph-top/2021/8/pillar-2.json": "Pillarでは、精神的な敏捷性と身体的な健康（睡眠、栄養、ストレス）との関連性をサポートするために、エビデンスに基づいたアプローチでトレーニングを受けた、全米医療審査委員会認定のプロバイダーによる信頼性の高いコーチングを提供しています。",
  "data/ph-top/2021/8/tether-5.json": "Tetherは、チームがバグや製品のフィードバックを報告するための最も簡単な方法です。 Tetherが技術データを取得している間に、チームはスクリーンレコーディングでコンテキストを提供することができます。Tetherのダッシュボードでフィードバックを管理したり、Jiraなどのツールと統合することができます。",
  "data/ph-top/2021/8/youdict.json": "Saoirse Ronan」、「Superfluous」、「Take a rain check」などの言い方・使い方がわからない？YouTubeの何百万もの動画のキャプションを検索して、単語や表現、さらには名前を調べることができます。ネイティブスピーカーの言葉を聞く。そして、100％の自信を持って使うことができます。",
  "data/ph-top/2021/8/mello-3.json": "melloは、企業がウェルビーイングを測定し、追跡し、行動するための新しい基準であり、より幸せで、より健康で、よりやる気のあるチームを鼓舞します。私たちのチェックインは、チームの現在のワークフローの中で燃え尽き症候群を評価、対処、防止し、従業員の定着率を高めます。",
  "data/ph-top/2021/8/angel-s-club-by-clearangel.json": "資金が不足している、または資金を探しているアーリーステージのEコマース創業者のためのコミュニティで、ビジネスを成長させるための資金調達方法や非伝統的な戦略について話し合います。同じ志を持つ起業家とつながりながら、資金調達の戦略について学びましょう。",
  "data/ph-top/2021/8/diverse-fyi.json": "採用担当者が、多様な技術系の人材をサポートしたり、スポンサーになったり、調達したりできるコミュニティを見つけるための無料ディレクトリです。これらのコミュニティを合わせると、100万人以上の潜在的な候補者にリーチすることができ、毎週追加されています。",
  "data/ph-top/2021/8/desk360-v2.json": "新しいオムニチャネル・カスタマーサポート・プラットフォームは、複数のプラットフォームから送られてくるカスタマーメッセージを1つのページで管理することができ、作業を迅速化し、最高のカスタマーサポートを提供できるように設計されています。",
  "data/ph-top/2021/8/zenkit-projects.json": "理想的なプロジェクト管理ソリューションとは何か？私たちにとっての理想とは、全員が一堂に会して、本当に重要なことに集中できる場所です。Projectsは、プロジェクトを軌道に乗せるために必要なツール、レポート、グローバルビュー、ダッシュボードを提供します。",
  "data/ph-top/2021/8/cococart.json": "Shopifyの10倍の速さでオンラインストアを構築できます。ローカルビジネスのお客様は、コードもデザインもアプリのダウンロードも必要なく、数分でストアを立ち上げることができます。",
  "data/ph-top/2021/8/razorpayx-payroll-for-slack.json": "RazorpayX Payrollをお気に入りのワークスペースツールSlackに導入しました🔥🔥 これにより、チームは休暇、払い戻し、給与明細、勤怠などに関連する一般的な人事タスクをSlack内で共同作業することができます。もうツールの切り替えに時間を費やす必要はありません 🚀",
  "data/ph-top/2021/8/removaly.json": "私たちは、このような情報を見つけて削除し、毎日スキャンしてあなたの情報がインターネット上に残らないようにするソフトウェアを作りました。",
  "data/ph-top/2021/8/imagify-4.json": "なぜ、OGカードの内容を自分で選べるサービスがないのだろう？マーケター、グロースハッカー、ファウンダーがこぞって愛用するツール、Imagifyをご紹介します。Imagifyでは、リンクがどのように表示されるかをコントロールすることができます。",
  "data/ph-top/2021/8/cache-4.json": "CacheはDoorDashやUberEatsでコンビニエンスストアを作り、運営しています。小さな自動化されたダークストアを使って、配送ドライバーに商品を渡します。",
  "data/ph-top/2021/8/arc-3.json": "Arcは、現代のウェブのためのCDNです。遠く離れたデータセンターにある高価なサーバーではなく、Arcのネットワークはブラウザで構成されています。あなたのブラウザのように。大規模で、成長が速く、需要に応じてスケールアップし、これまでのCDNの何分の一かのコストでコンテンツを配信します。",
  "data/ph-top/2021/8/humans-in-tech.json": "Humans in Tech (HIT)は、技術系の人々の間で自発的で刺激的な会話を生み出すことを目的としたネットワークプラットフォームです。プロのネットワーキングにカジュアルなアプローチを取り入れ、刺激的な人々との1対1のチャットをこれまで以上に簡単に実現します。",
  "data/ph-top/2021/8/mentorcam.json": "Mentorcam（メンターカム）は、著名人と1対1でアドバイスやメンターシップを受けることができるマーケットプレイスです。メンターを見つけて、キャリア開発やスタートアップの資金調達、デートなど、さまざまなトピックについてアドバイスをもらうことができます。",
  "data/ph-top/2021/8/octauthent.json": "Octauthentは、あらゆるウェブサイトに認証機能を追加する最も簡単な方法です。- ログインフォームを1分以内に作成 - コードを1行も書かずにサイトに統合 - Octauthent ダッシュボードからユーザを管理",
  "data/ph-top/2021/8/monto-2.json": "Montoは、低額の固定料金で、関連会社の従業員が稼いだ賃金を24時間いつでもオンデマンドで入手できるサービスを提供しています。ユーザーは給料を受け取るタイミングを決めることができ、経済的に豊かになるために必要な柔軟性を得ることができ、数千ドルのコストや手数料を回避することができます。",
  "data/ph-top/2021/8/partybid.json": "PartyBidは、グループで資金を出し合い、一緒にNFTオークションに入札することができる製品です。誰でもPartyBidを作成または参加し、ETHを拠出して、集団の一員として入札を行うことができます。",
  "data/ph-top/2021/8/kidhab.json": "KidHabは、有益な習慣を楽しく身につけることができる、親子の共同作業アプリです。独自のゲーミフィケーションシステムにより、お子さんが定期的に便利な習慣を実行するように動機づけられ、レッスンを欠席すると進歩が失われます。",
  "data/ph-top/2021/8/design-junction-2.json": "Design Junctionは、デザイナーやクリエーターのためのワンストップ・リソース・ライブラリーです。",
  "data/ph-top/2021/8/figen.json": "あらゆる目的に使える、無料のポストカバー＆背景生成ツールです。",
  "data/ph-top/2021/8/suncheck.json": "日光浴は足りていますか？Suncheckでは、太陽光の摂取量を記録し、アーカイブすることができます。自分がどれだけの太陽エネルギーを得ているかを知ることで、健康的な生活習慣を身につけましょう",
  "data/ph-top/2021/8/64-design-tips.json": "🚨期間限定で無料になります 20年以上の経験と500以上の製品デザインをもとにした64のデザインヒントをご紹介します。⬇️ 全てのフォームデザインは、5000人のユーザーサンプルでテストされています。",
  "data/ph-top/2021/8/user-interface-museum.json": "User Interface Museumは、人気のあるデスクトップおよびモバイルアプリケーションのUIを収集し、長年にわたってどのように変化してきたかを紹介しています。",
  "data/ph-top/2021/8/algouniversity.json": "AlgoUniversityは、大学のCSカリキュラムと産業界で求められているものとのギャップを埋めます。アルゴユニバーシティでは、ライブ授業、業界関連プロジェクト、学習製品を提供しており、学生が一流のハイテク企業でソフトウェア・エンジニアリングの仕事に就くための準備をしています。",
  "data/ph-top/2021/8/ph100.json": "PH100では、ProductHuntが100 upvoteを達成した際に更新されます。これらは🔥🔥🔥とみなされます。TelegramとAirtableベースで自動更新されます。各ローンチはTimeTo100、メーカー、CommentUpvoteRatioなどで分析されます。https://www.ph100.club にアクセスしてください。",
  "data/ph-top/2021/8/calliope.json": "Calliopeは、オーディオミックスやメモのコレクションを作成する最もシンプルな方法です。プロジェクトでは、数回のタップでトリミングやマージが可能なオーディオセグメントを録音してインポートできます。",
  "data/ph-top/2021/8/alfred-4-5-universal-actions.json": "Alfred 4.5では、Powerpackの新機能を搭載しています。Universal Actionです。テキスト、URL、ファイルを取り込んで、Alfred内のどこからでも、あるいはMac上でユニバーサルアクションのホットキーを使ってアクションを実行することができます。",
  "data/ph-top/2021/8/sliceq.json": "SliceQは、電話、対面、オンラインでの注文を効率化するレストラン管理システムです。SliceQを使うことで、オーナーはスタッフ不足や週末のラッシュを管理しながら、10％以上の収益アップを実現することができます。",
  "data/ph-top/2021/8/nifty-drops.json": "NFTコレクターがすべてのブロックチェーンでNFTのドロップを見つけるのを支援し、NFTクリエイターがあなたのNFTローンチを無料でマークします。",
  "data/ph-top/2021/8/blogody-2.json": "より簡単に、より速く、より安全に、ブログを作成・公開できます。グローバルなCDNエッジで数秒で公開できます。遅いサイトや長い構築時間に別れを告げることができます。公開データと著作権のコントロールを取り戻すことができます。Blogodyを使えば、自分の言葉は自分で管理できます。",
  "data/ph-top/2021/8/promoz.json": "プロモーションビデオは、ユーザーが製品を手にする最初のタッチポイントの一つです。 あなたが解決しようとしている問題とソリューションを伝えるクリエイティブなプロモーションビデオは、あなたの製品を大きく前進させます。",
  "data/ph-top/2021/8/ai-writer-chrome-extension.json": "世界最先端のAIを使って、あなたの代わりに書いてください。ブログコンテンツ、ランディングページ、広告コピーなど、さまざまなものがあります。",
  "data/ph-top/2021/8/customerinsight.json": "顧客開拓のインタビューや顧客発見のタスクをサポートする専門家を探す 彼らはそれを1000回もやった。",
  "data/ph-top/2021/8/nomadely-space.json": "家事やチームの動向、余暇の過ごし方などは抜きにして、メインに集中しましょう 👩🏻💻✨ 私たちは生きるための条件を整え、あなたは前に進みます。",
  "data/ph-top/2021/8/go-eth-me.json": "Go ETH Meは、中間業者を介さずにイーサリアムを使って募金活動を行うことができるWeb3アプリケーションです。これは、寄付者が直接目的を支援できる分散型の未来への第一歩です。",
  "data/ph-top/2021/8/livemart-storefront.json": "LiveMartはストアフロントを提供します。ストアフロントを使用すると、SSL＆CDNはonlivemart.storeのサブドメインをバックアップし、数分であなたのオンラインストアを作成することができます。また、カスタムドメインを設定することができます。",
  "data/ph-top/2021/8/yichi.json": "YiChiは、中国語のマンダリンを完璧に話せるようにする言語学習アプリです。正しい発音とトーンを聞き、自分のバージョンを録音し、AIベースの音声評価で即座に正確なフィードバックを得て、正しく理解できるまで練習を続けましょう。",
  "data/ph-top/2021/8/lekh.json": "Lekhは、物理的なノートブックの経験を備えたデジタルノートブックです。カラフルな蛍光ペン、さまざまなページスタイル、付箋などが用意されています。Lekhは無料のProgressive Web Applicationで、ダウンロードしてオフラインで使用することができます。",
  "data/ph-top/2021/8/lasso-affiliate-wordpress-plugin.json": "Lassoは、CTRを高める最新の商品表示、リンク切れ警告、キーワードによる収益化、組織的なリンク管理を用いて、アフィリエイト収入を増加させる新しい方法です。既存のリンクから新たなアフィリエイトプログラムを見つけることもできます。🔥",
  "data/ph-top/2021/8/24-hours-of-nft.json": "24 Hours of NFT 素晴らしいNFTアートの無限ループ。あなたのNFTアートが毎日表示されるように、その日の秒数を主張してください。永遠に すでに140人以上のアーティストによって7200秒以上の秒数が請求されています。https://www.24hoursofnft.com でご自身の目でお確かめください。",
  "data/ph-top/2021/8/financial-model-template.json": "新興企業のために、しっかりとした構造で、使いやすく、正確な財務モデルを構築するには、何十時間もかかります。そこで、私たちはあなたに代わってほとんどの作業を行うことにし、テンプレートを考えました。",
  "data/ph-top/2021/8/buildinpublic.json": "#buildinpublicは、メーカーがプロジェクトに取り組む様子を公開するムーブメントです。このウェブサイトでは、#buildinpublicのすべてのツイートを読みやすいフィードにまとめています。他のメーカーの活動を見たり、#buildinpublicのハッシュタグを使って自分のアップデートを追加したりすることができます。",
  "data/ph-top/2021/8/graha.json": "Grahaは、初めてのリアルタイム・ライブ・ウェブサイト・コラボレーション・ツールです。チームは、ウェブサイトのテキストを編集し、スライダーやAIを搭載したCSSエディターを使って素早くデザインを反復し、ライブ・ウェブサイト上で直接フィードバックを収集し、ライブ・ウェブサイトのデザインを10倍速く完成させることができます。",
  "data/ph-top/2021/8/neuroflash.json": "🕒 人工消費者脳でリアルタイムにマーケティングコピーを作成・最適化し、適切なマーケティングメッセージを見つけることができます。🕒 もう当て推量はしない。時間を節約できます。✔️ ニューロフラッシュで、常に新鮮な文章を書くことができます。🎁 29€/月 (最初の200ユーザー).",
  "data/ph-top/2021/8/ai-link-building-pbn-manager.json": "私たちのAIは、キーワードに関連した権威あるコンテンツを持つ、ユニークで高速な高品質のウェブサイトを生成します。1つのキーワードを書くだけの簡単な作業です。私たちのAIはそれについてすべてを学び、コンテンツを生成し、最大98％のページスピード、CDNと個別のIPを持つホストされたウェブサイトを生成します。",
  "data/ph-top/2021/8/watercoolr.json": "Watercoolrは、世界中のリモートワーカーと昼夜を問わずつながることができるアプリです。他の人たちと交流したり、共同作業をしたり、単に「一緒にいる」ということに簡単にアクセスできるようになります。訪問したいwatercoolrの部屋を選択し、接続を開始します。",
  "data/ph-top/2021/8/are-you-ready-to-freelance.json": "フリーランスになる準備はできていますか-その答えとなるツールがあります MIROボードをダウンロードして、フォームに記入し、あなたが市場性のあるサービスを持っているかどうか、フリーランスのビジネスを成功させるために必要なリソースやソフトスキルがあるかどうかを学びましょう。",
  "data/ph-top/2021/8/readmark.json": "ReadMarkは、「マーク可能」なRSSリーダーです。他のRSSリーダーや既読サービスが提供する基本的な機能に加えて、ReadMarkは独自に、スムーズで気が散らないメモ取り体験「マーク」を提供します。ぜひお試しください。",
  "data/ph-top/2021/8/audience-kitchen.json": "Audience Kitchenは、通常はFacebookのインターフェースに隠れている95,000以上のオーディエンスターゲティングオプションを、広告主が簡単に検索・閲覧できるようにします。理想的なオーディエンスを構築し、FB広告アカウントにエクスポートして、数秒でターゲティングを開始できます。",
  "data/ph-top/2021/8/snapcalorie.json": "SnapCalorie」は、どんな食事でも写真を撮れば、正確なカロリー計算ができるアプリです。Google Lensの共同設立者によって作られたSnapCalorieは、数秒で食事の記録を取ることができ、平均して訓練を受けた栄養士よりも正確に記録することができます。",
  "data/ph-top/2021/8/statiks-2.json": "Spotifyで最も聴かれている音楽を、曲とアーティストの両方で確認できます。また、最も聴いた曲からSpotifyのプレイリストを作成することもできます。",
  "data/ph-top/2021/8/yare-io-2.json": "リアルタイムストラテジーゲームですが、マウスを使わず、JavaScriptのコードを書いてユニットを操作します。",
  "data/ph-top/2021/8/invezo.json": "Invezoは、株式と暗号通貨の分析ツールです。新世代の投資家のために、ソーシャルメディアのデータと古典的な市場データを統合した唯一のアプリです。",
  "data/ph-top/2021/8/keyri.json": "- モバイルではタップ、デスクトップではQRでパスワードレスのサインアップ/ログインを可能にするモバイルSDK - デバイスベースの生体認証を活用することで、アカウント乗っ取り詐欺を排除 - ログイン方法としても、高リスクのケースでは第二認証層としても利用可能",
  "data/ph-top/2021/8/great-email-templates.json": "自動化ツールに用意されているメールデザインテンプレートは、あまり良いものではないと考えています。そこで、私たちはいくつかのテンプレートをデザインしました。これらのメールテンプレートは、特にSaaSのグロースマーケターが育成キャンペーンを行うためにデザインされたもので、コードなしでHubSpotにインポートすることができます。",
  "data/ph-top/2021/8/devbox.json": "デスクトップアプリケーション（Windows、macOS、Linuxに対応）で、ソフトウェア（エンコーダー、デコーダー、ジェネレーター、ビューアーなど）の小さな便利なコレクションです。",
  "data/ph-top/2021/8/remix-4.json": "Remixは、誰でも簡単にスマートフォンから直接ミートアップ形式のイベントを開催したり、参加したりすることができます。ソーシャル機能を中核としたRemixは、参加者が2Dの楽しいイベントスペースで交流したり、ステージやプレゼンター、スクリーン共有が可能なオーディオルームに参加したりすることができます。",
  "data/ph-top/2021/8/qooore-2-0.json": "成功した金融インフルエンサーやプロのトレーダーが市場についての洞察を共有するソーシャル投資アプリです。最高のアナリストをフォローし、取引のアイデアを得ることができます。Qooore（クーア）は、金融業界で活躍しているインフルエンサーの意見を参考に、若者がお金を稼ぐ方法を学ぶことができます。",
  "data/ph-top/2021/8/actiondesk-2.json": "Actiondeskは、エンジニアチームを煩わせることなく、社内の誰もが簡単にデータを使って質問に答えることができます - スプレッドシートであるため、ピボットテーブルの作成や数式の使用が可能です - Actiondeskはデータベースに接続し、1時間ごとにデータを更新します",
  "data/ph-top/2021/8/flow-club.json": "遠隔地のコワーキングスプリントに参加して、気晴らしをしたり、自分の流れを見つけたり、アウトプットを倍増させたりしましょう。",
  "data/ph-top/2021/8/grow-295c75e4-28e7-4d80-819c-9d0f05cf4152.json": "Growは、Apple Healthを使って長続きする習慣を構築するための自動習慣トラッカーで、ついに手動記録に別れを告げることができました。また、Perfect Dayのチャレンジごとに習慣をつなげて、すべての目標を達成してメダルを獲得できるようにします!",
  "data/ph-top/2021/8/anyfiddle.json": "Anyfiddleは、開発者があらゆる言語のコードをオンラインで構築、実行、共有するためのプラットフォームです。NodeJS、React、NextJS、Django、Ruby on Railsなど、あらかじめ用意されたテンプレートを使ってコーディングを始めることができ、コードの共有はURLを共有するのと同じくらい簡単です。",
  "data/ph-top/2021/8/drinkie.json": "Drinkie（ドリンキー）は、ペットの食器を洗い、5日間分の水を確保してくれるスマートなセルフクリーニング式ウォーターディスペンサーです。スマートアプリを使えば、洗浄時間を遠隔操作したり、ペットの飲み方やディスペンサーの水位を監視したりすることができます。",
  "data/ph-top/2021/8/paloma-for-shopify.json": "Shopifyの店舗は、DMストアを立ち上げることができます。自動化されたショッピング会話を構築し、ウェブサイトよりも2～10倍のコンバージョンをもたらします。",
  "data/ph-top/2021/8/text-to-video-by-creatorkit.json": "モーショングラフィックスを使った、テンポの良いテキストビデオを数分で作成できます。⠀ CreatorKitプラットフォームの上に構築された新しいツールで、100種類以上のビデオやストーリーのテンプレートと一緒に使用できます。⠀ Product Huntコミュニティに限り、ベーシックプランに生涯、無料でアクセスできます!",
  "data/ph-top/2021/8/ira-design-2-0.json": "アイラデザインで自分だけの素敵なイラストを作ろう 🌟 NEW:アウトラインイラストができます。🌟 NEW:アウトラインイラストができました。",
  "data/ph-top/2021/8/playhouse-2.json": "Playhouse」は、販売中の住宅のビデオリストを閲覧するためのモバイルアプリです。TikTokのように楽しくて中毒性があり、Zillowのように実用的で実行可能です。",
  "data/ph-top/2021/8/weekly-visitor-report-by-clearbit.json": "ウィークリービジターレポートは、Clearbit Reveal社が提供する新しいツールで、ウェブサイトを訪れた企業を特定し、毎週金曜日にインタラクティブなサマリーを送信します。完全に無料で、簡単にインストールでき、あらゆるアウトバウンド活動に即座に付加価値を与えます。",
  "data/ph-top/2021/8/anakin.json": "Eコマースストアやブランドが、商品の詳細な価格、ベンダー、在庫状況、競合他社、レビューなどをリアルタイムに追跡できるようにします。",
  "data/ph-top/2021/8/veamly-lite.json": "ハイブリッドワークモデルで真のワークライフバランスと最適な生産性を実現するために、毎日のデジタルウェルビーイング評価を受けてみませんか。あなたのデジタル・ウェルビーイング・ジャーニーをスタートさせるための実用的な洞察力と提案を引き出します。",
  "data/ph-top/2021/8/playbook-5.json": "クラウドストレージを美しく。Playbookは、クリエイティブな作品を断捨離し、自動タグ付けし、インテリジェントに整理します。必要なものをシームレスにブラウズし、コラボレーションし、友人、同僚、クライアント、あるいは世界中の人々と共有することができます。",
  "data/ph-top/2021/8/credithero.json": "AWSの無料クレジットが不足していませんか？CreditHeroでは、最大2000ドル/月の追加利用が可能です。スタートアップ企業のうち、クレジットを使い切るのはわずか25%です。CreditHeroは、あなたのスタックを他の参加スタートアップのAWSアカウントにデプロイします - 簡単です!",
  "data/ph-top/2021/8/humantic-ai-for-talent.json": "本当の意味で針を動かす才能は、毎日のようにメッセージを浴びせられています。採用担当者として、あなたはどうやって目立つことができますか？HumanticのAIは、候補者が何を重視しているかを正確に予測し、候補者が反応する方法でTAをパーソナライズするようコーチします。",
  "data/ph-top/2021/8/compare-to-dev.json": "2つの画像を比較する簡単で便利なサービスです。商品開発の現場で、デザインと実際の動作のズレを確認したいときなどに役立ちます。",
  "data/ph-top/2021/8/glass.json": "あなたの写真がポイントです。Glassは、写真家のための新しい写真共有アプリとコミュニティです。広告、データトラッキング、公開カウント、エンゲージメントアルゴリズムなどは一切ありません。",
  "data/ph-top/2021/8/bugbug.json": "BugBugでは、コーディングをせずにテストを自動化することができるので、誰でも自分のウェブサイトやアプリケーションが、見た目や動作に問題がないかをチェックすることができます。これにより、時間の節約、テストの効率化、テストコストの削減が可能になります。",
  "data/ph-top/2021/8/new-tetrisly-v-1-5.json": "Tetrislyは、デザインシステムのUIコンポーネントライブラリをFigmaで作成するための、最も整理されたスターターキットの一つです。2000人以上のデザイナーやチームに信頼されています。バージョン 1.5: リフレッシュされた外観と改善された構造、再定義されたバリアントと自動レイアウト、無料の追加 Xenon テーマ。",
  "data/ph-top/2021/8/viralcopy.json": "💫 GPT-3を搭載したViralCopyは、トレンドとあなた自身のトーンを統合し、本物のキャッチーでコンバージョンのあるコピーを生成します。🚀 キャプション、ハッシュタグ、広告コピー、商品説明などを数秒で生成します。",
  "data/ph-top/2021/8/whaly.json": "Whaly🐳は、日常的に使用しているツールに直接接続されたノーコードのビジネス・インテリジェンス・プラットフォームです： ⒊ SQLを書かずにメトリクスを構築する 👯♀️ 一流のアクセスコントロールとコラボレーション ⒊ データをドリルダウンできるアクション可能なチャート",
  "data/ph-top/2021/8/berowra.json": "Berowraは、趣味や小規模ビジネスのためのオープンソースCMSで、わずか3分でコンテンツの上に構築を始めることができます。API、ファイルホスティング、Markdownサポートなどが付属しています。現時点では、Deta Spaceでベータ版が公開されています。",
  "data/ph-top/2021/8/the-complete-salesforce-bootcamp.json": "3ヶ月以内にコーディングを必要としない高収入のキャリアの範囲内で、実践的なプロジェクトと業界で認められた資格を用いて遠隔でトレーニングする包括的なSalesforce Bootcampです。",
  "data/ph-top/2021/8/pandai.json": "Pandaiは、東南アジアの学校の生徒向けの学習アプリです。昨年マレーシアでスタートしたPandaiは、現在25万人以上の学生がシラバスに基づいたアカデミックなクイズ（学年、科目、成績によってパーソナライズされたもの）を受け、学業成績の向上に役立てています。",
  "data/ph-top/2021/8/argonaut.json": "Argonautは、クラウド上での開発を自動化します。Argonaut は、インフラストラクチャとデプロイメントを自動化するための terraform と kubernetes の設定を、数週間ではなく数分で生成することができます。",
  "data/ph-top/2021/8/queue-0c95e5e2-a2f1-45b8-8523-a0b93a2d2fd5.json": "Queueは、Webデザイナーがフィードバックの混乱を避けるために、チームやクライアントがライブのWebサイトに直接コメントを残せるようにし、プロジェクトの完成を10倍早くします。URLをキューに貼り付けるだけで、ウェブサイト上で直接コメントを書くことができます。",
  "data/ph-top/2021/8/codex-by-openai.json": "OpenAIのCodexは、英語で書かれたテキストをコードに翻訳する新しい機械学習ツールです。Codexは、プロのプログラマーの作業をスピードアップするだけでなく、アマチュアがコーディングを始めるのにも役立つように設計されています。",
  "data/ph-top/2021/8/zorbi-2.json": "🧠 Zorbiは、忘れたときにだけ表示されるフラッシュカードで勉強を簡単にします。事前に作成されたデッキをインポートし、進捗状況を確認しながら、NotionのノートやあらゆるWebサイト/PDFからシームレスにカードを作成できます。",
  "data/ph-top/2021/8/zappi-ad-predictor.json": "動画広告をアップロードすると、無料でパフォーマンスを予測します - 広告の強みと弱みを確認します - 広告を業界のベンチマークと比較します - 本番前に広告を直感的にチェックします 数億ドルの広告で鍛えられています 📈📈",
  "data/ph-top/2021/8/video-calling-api-by-videosdk-live.json": "Videosdk.live は、あなたのアプリケーションのための低コードのビデオ通話開発者ツールを組み立てます。超簡単なワンクリックのビデオ通話APIを追加して、アプリケーションのエンゲージメントを向上させましょう。完全に保護されたチャット、録画、顧客とのコミュニケーションなどを利用できます。",
  "data/ph-top/2021/8/processica-customer-portal.json": "ノーコードのツールとミニマルなコーディングで構築されたカスタマーポータルは、プロジェクトの開始と管理、サブスクリプションの支払い管理、プロセスカエージェンシーのチームとのコミュニケーションをサポートします。",
  "data/ph-top/2021/8/analyticsverse.json": "Gitリポジトリやプロジェクト管理ツールからのエンジニアリング分析により、可視性の向上、ブロッカーの排除、迅速な納品を実現 -> ボトルネックやリスクの特定と解決 -> スプリントを客観的に分析し、スプリントレトロスペクティブを有意義なものにする。",
  "data/ph-top/2021/8/fusebot.json": "Fusebot: SlackとDiscordのための究極の開発者ボット。Node.jsでカスタムコマンドを書きます。SlackやDiscord上で何でも自動化、統合、実行できます。サーバーは必要ありません。あなたがコードを書けるなら、Fusebotはそれを実行できます。✨",
  "data/ph-top/2021/8/texta-ai.json": "マーケティングコピーを書くのが苦手な人は、絶対に頭が真っ白になります🚀。私たちは50以上の強力なコンテンツ生成ツールを構築し、あらゆる製品、あらゆるオーディエンスのためのコピーを数秒で書くことができます。",
  "data/ph-top/2021/8/notion-web-designer-hub.json": "Notion Web Designer Hubでは、リードステージからプロジェクト完了まで、すべてのフリーランスプロジェクトを一つの居心地の良い空間で管理することができます。- クライアントとの電話でのやり取りに必要なステップと質問 - 提案書に必要なプロジェクトコストの見積もり - プロジェクトの各構成要素に必要なチェックリスト",
  "data/ph-top/2021/8/hiro-wallet-for-stacks.json": "Hiro Walletは、STXを管理し、分散型アプリにサインインし、Stacksブロックチェーンと対話しながら資金を保護する安全な方法です。",
  "data/ph-top/2021/8/picklang.json": "最新のAI技術は、見たもので学習処理を行うように作られています。自分の写真やフィードを使って課題を解決し、チャレンジを完了し、アチーブメントを獲得し、無限のコンテンツを探索し、進捗状況を友達と共有することができます。",
  "data/ph-top/2021/8/vance-ai-photo-restorer.json": "https://vanceai.com/old-photo-restoration/、古い写真、破損した写真、傷ついた写真をオンラインで無料で復元することができます。Vance AIのAI愛好家によって開発されたAI picture restorerは、あなたの古い写真を生き返らせるために作られています。今すぐここをクリックしてhttps://vanceai.com/old-photo-restoration/。",
  "data/ph-top/2021/8/ui-guideline.json": "すべてのUIデザイナー／開発者がワークフローに組み込むべきハンドブックです。最も人気のあるデザインシステムとUIライブラリのすべての知恵を1つの場所に統合することで、あなたの作業を容易にし、調査時間を短縮します。",
  "data/ph-top/2021/8/the-design-quiz.json": "ディーター・ラムスが定義したグッドデザインの原則はいくつあるか知っていますか？また、最初のGUIプロトタイプが作られたのはいつでしょうか？デザインクイズでは、あなたのユーザーエクスペリエンス、ユーザーインターフェース、グラフィックデザインの知識を試すことができ、多くのことを学ぶことができます。",
  "data/ph-top/2021/8/dwindle.json": "Dwindleは、学生の借金を抱えている人たちが経済的に自由になれるように支援することを使命としています。アメリカ人は1.7兆ドル以上の学生ローンを抱えています。私たちのジョブボード製品は、借金から解放されたい人のためのソリューションとなることを目指しています。ご質問は https://dwindlestudentdebt.com/contact/ まで。",
  "data/ph-top/2021/8/100ms-video-sdk.json": "フルカスタマイズ可能な他のビデオSDKに比べて、10倍も少ないアプリケーションコードで、あなたのアプリケーションにライブビデオ会議を追加できます。FacebookやDisney+Hotstarで1日に何十億分もの時間を動かすライブビデオのインフラを構築したチームが開発しました。",
  "data/ph-top/2021/8/stream-club.json": "Stream Clubは、美しいライブストリームをデザイン、制作、放送する最も簡単な方法で、ブラウザから直接操作できます。",
  "data/ph-top/2021/8/literalclub.json": "リテラルは、あなたが読んだ本を記録し、あなたが信頼する人々を通して次のお気に入りの本を見つける場所です。本の推薦に関しては、信頼がアルゴリズムに勝り、私たちは皆、誰かに信頼されているという考えに基づいて設計されています。",
  "data/ph-top/2021/8/whatsform.json": "WhatsFormは、WhatsAppの会話でビジネスを管理する人のために作られています。1️⃣ WhatsApp内でデータを収集するためのフォームを作成 2️⃣ WhatsAppは各メッセージの98%の開封率を保証 3️⃣ 収集されたデータを使って、ビジネスを2倍速く行うことができます。",
  "data/ph-top/2021/8/youtube-highlighter-by-liner.json": "Youtube Highlightは、検索アシスタント＆Web Highlightingサービス「LINER」の新機能です。インスピレーションを受けた文章だけでなく、動画の好きな部分をハイライトすることができます。",
  "data/ph-top/2021/8/apptrana-ddos-protection.json": "AppTranaはフルマネージドWAFソリューションですが、この度、Behavioural DDOS Protection機能をリリースしました。この機能により、アプリケーション・トラフィックの挙動を理解し、変化するトレンドに合わせて保護設定を行うことができます。",
  "data/ph-top/2021/8/seo-powersuite-backlink-api.json": "インターネットをクロールする。すべての新しいバックリンクと失われたバックリンクを登録します。リンクポピュラリティに基づいて、ウェブ上のすべてのドメインとページの相対的なオーソリティを推定します。独自のダッシュボードを作成する。カスタムレポートの作成 お客様のユーザーに当社のデータを再販することができます。無限の可能性を秘めています。",
  "data/ph-top/2021/8/mediakits.json": "MediaKitsは、業界をリードするメディアキットビルダーをはじめとする一連の最先端ツールを通じて、独立系クリエイターのブランド収益化を支援するために設立された、クリエイターファーストのデータ分析会社です。",
  "data/ph-top/2021/8/linker-2.json": "Linkerは、リンクを保存、整理、共有するための軽量でシンプルなアプリです。ウェブアプリ、iOS/Androidアプリ、そして素敵なブラウザ拡張機能を提供し、あなたのリンクを素早く保存することができます。もう、ブラウザのブックマークフォルダをめくる必要はありません。",
  "data/ph-top/2021/8/qoa-3.json": "QOAは、Oatlyがミルクで成し遂げたように、チョコレートでも成し遂げようと、世界初の100%カカオフリーのチョコレートを開発しました。QOAのチョコレートは、従来のチョコレートと同じ味と感触でありながら、10倍の持続性を持っています。2035年までに、QOAはマスマーケット製品のチョコレートに取って代わるでしょう。",
  "data/ph-top/2021/8/candor.json": "Candorは、採用中のテクノロジー企業のリーダーシップ、採用担当者、同僚についての本音を伝えることで、求職者がより良いキャリアを選択できるようサポートします。",
  "data/ph-top/2021/8/nextretreat.json": "NextRetreatは世界初のオールインワンプラットフォームで、企業のリトリートやチームのオフサイトのオーガナイザーが、社内外でのオーガナイズ、コミュニケーション、シンクロナイズに通常費やす何百時間もの時間を削減します。👩💻 🌴 ☀️",
  "data/ph-top/2021/8/monoshop.json": "モノショップは、美しいeコマースサイトをできるだけ早く立ち上げることをサポートします。携帯電話から簡単に設定することができ、すべてのデバイスで美しく表示されることを確認できます。私たちはEコマースの構築をシンプルにしているので、お客様はコンテンツと販売に集中することができます。",
  "data/ph-top/2021/8/command-j-2-0.json": "Command + Jは、インドのデザインコミュニティの新人とプロを結びつけることを目的としたメンターシッププラットフォームです。そうすることで、インドのデザインに関する知識を誰にでもオープンでアクセスしやすいものにしていきたいと考えています。",
  "data/ph-top/2021/8/jinx.json": "新しい音楽を発見するのは難しいですか？Jinxは、あなたが今聴いている曲や、Apple Musicの既存のプレイリストに基づいて曲を提案します。また、日替わりのプレイリストを提案したり、自分の音楽に素早くアクセスできるウィジェットも用意されています。",
  "data/ph-top/2021/8/evidence.json": "Evidence は、オープンソースのコードベースのビジネスインテリジェンスツールです。従来のBIツールのようなドラッグ＆ドロップのインターフェースではなく、アナリストがSQLやマークダウンを記述することで、自動化されたレポートを構築することができます。",
  "data/ph-top/2021/8/the-nifty.json": "私は、NFT市場をモニターするための一連のツールを開発しました。この最初のバージョンは、無料でアクセスでき、市場の動きの毎日のダイジェストを含み、私の最新のポッドキャストのエピソードを含み、この分野でのキャリアの機会を表面化しています。",
  "data/ph-top/2021/8/bant-io.json": "bant.ioは、コールドアウトリーチによるB2B顧客の獲得を自動化する、オールインワンのリードジェネレーション＆セールスアクセラレーションサービスです。",
  "data/ph-top/2021/8/color-trends.json": "写真家やストックフォトの消費者が、どのような色が最も人気があるのかをよりよく理解できるように、最もパワフルなインサイトを集めました： ⬛️ 今年のトップ7カラー 🟪 クールカラーとウォームカラーのトップカラー 🟩 ストックフォトの7テーマのトップカラー",
  "data/ph-top/2021/8/syr.json": "Syrは、ユーザーに - 愛情を込めて作られた美味しい本物の料理を楽しむことができます。身の回りの食べ物を通して異文化を探求することができます。",
  "data/ph-top/2021/8/deskimo.json": "Deskimoでは、プロフェッショナルに管理された幅広いワークスペースにオンデマンドでアクセスでき、分単位で支払うことができます。メンバーシップもサブスクリプションもありません。現在、シンガポールと香港でサービスを提供しています。",
  "data/ph-top/2021/8/yous.json": "異なる言語を話す人たちが、自分の母国語と他の言語を話す人たちとの間で会話をし、お互いに理解することができる新しいコミュニケーション・ウェブ・アプリケーションです。⠀ 登録、ミーティングの作成、リンクの共有の3つのステップで簡単に利用できます。⠀ 無料でお試しください。",
  "data/ph-top/2021/8/alicorn-cloud.json": "Alicornは、スタートアップ企業のための、クラウドに依存しないプラットフォームです。AWSでもGCPでもAzureでも、Alicornがあればあなたのスタックはどこでも動きます。ワンクリックでクラウドプロバイダーを切り替え、ベンダーロックインを回避し、無料クレジットを使い切ることはありません。",
  "data/ph-top/2021/8/notifyxf.json": "Telegramで自分に通知を送る。あなたのサーバー/アプリ/ビジネスで発生したイベントを最も簡単に通知できます。",
  "data/ph-top/2021/8/orbitrics.json": "Orbitricsは、データの収集、分析、レビューを簡素化し、データに基づいた意思決定を行うためのエクスペリエンス管理プラットフォームです。アンケートを簡単に構築し、カスタマイズし、結果を分析し、さらにはボットとしてウェブサイトに埋め込むことも可能です。",
  "data/ph-top/2021/8/value-added.json": "最も価値のあるツイート、ツイッタルスレッド、ブログ、記事などのコレクション。様々なトピックやクリエイター、コミュニティを発見することができます。心理学からビジネスまで、人生から文章まで。保存する価値のある単一のツイートやツイスレッド。すべてがひとつの場所にあります。",
  "data/ph-top/2021/8/valisa.json": "ヴァリサは、最適な移動手段を提案することで、旅行の計画をサポートします。旅行にお金をかける必要はありません。どこから始めればいいのか教えてください、あなたを驚かせてみせます。ご予算は10ユーロですか？問題ありません。自分でチェックしてみましょう。",
  "data/ph-top/2021/8/ultimate-podcast-guide-v-1-0.json": "Ultimate Podcast Guide V 1.0は、Notionで構築されたポッドキャストダッシュボード整理システムで、ポッドキャストへの取り組みに圧倒されることはありません。ポッドキャスターのポッドキャストエピソードの再利用、管理、追跡、そしてコンテンツの取り組みを支援します。",
  "data/ph-top/2021/8/stream-follows.json": "StreamFollowsは、あなたの新しいフォロワーのために、カスタマイズ可能なウェルカムページを自動的に生成します。すべての視聴者は、あなたのコミュニティへの温かい歓迎を受けるに値します。",
  "data/ph-top/2021/8/result-tree.json": "私は、複数のウェブサイトでのオンライン検索を容易にするためにResulttreeを作りました。検索語を一度だけ書いて、複数のウェブサイトを開いたり、一度にすべてのウェブサイトを開いたりすることができます。各ウェブサイトでコピー＆ペーストする必要はありません。",
  "data/ph-top/2021/8/rarible-protocol.json": "Rarible Protocolは、NFTのプロジェクトやアイデアの市場投入プロセスを簡素化するためのツール群です。もうゼロから作る必要はありません。代わりに自分が本当に得意なことに集中してください - https://link.medium.com/YpblzPOcFib",
  "data/ph-top/2021/8/growthkit.json": "スタートアップ、スモールビジネス、ソロプレナーのキャリアを構築し、成長させるのに役立つトップ1％のツールやリソースを見つけてください - 200以上のリスト - 70以上のカテゴリーが表示されます - スタートアップのお得な情報 - ノーコードのプラットフォーム - VCのリソース - プロモーションの場 - などなど!",
  "data/ph-top/2021/8/strollhunt.json": "Strollhuntは、何気ない散歩をエキサイティングな冒険に変えてくれる、街を探索するための最も楽しい方法です。街はあなたの遊び場であり、すべての隠された宝石を探しに行きましょう SF、ロンドン、パリ、バルセロナで今すぐプレイすることも、あなたの街でゲームを作ってみんなでプレイすることもできます。",
  "data/ph-top/2021/8/no-paint-2.json": "NoかPaintを言って絵を作る無料ゲームです。コマンドを入力してプレイリストというマクロを実行したり、隅にあるコードで他の人の絵を読み込んだり、端末のカメラを使ったりすることもできますよ。",
  "data/ph-top/2021/8/maridesk.json": "不動産管理のワンストップソリューション、Marideskをご紹介します。Marideskは、不動産オーナーや管理者が、不動産と居住者を一つのエコシステムで簡単かつ効率的に管理するためのクラウドベースのプラットフォームです。https://maridesk.com/",
  "data/ph-top/2021/8/lightwidget.json": "Instagram用のレスポンシブなウィジェットです。あなたのウェブサイト、ブログ、オンラインストアなどに当社のウィジェットを埋め込むことができます。ホバーエフェクトやキャプションなどの複数のオプションを使って、様々なタイプのウィジェットを生成することができます。",
  "data/ph-top/2021/8/tempo-playlists-for-spotify-2.json": "プレイリストを作るときに、「インディーポップで始まり、バップエレクトロで終わり、どこかにスローなフォークがあるといいな」と思いついたものの、あとがわからないことはありませんか？- そんな時はTempoにお任せください。",
  "data/ph-top/2021/8/whyther.json": "Whytherは、シンプルで正確な天気予報アプリです。ウェブサイトとPWA( https://en.wikipedia.org/wiki/Progressive_web_application )でご利用いただけます。Whytherは、あなたが必要とするすべての天気を1つのエレガントなレイアウトで表示します。お客様のデータは一切保存されません。",
  "data/ph-top/2021/8/bettre.json": "このアプリの背景にあるアイデアはシンプルで、私の個人的な1年間の実験（ここで読むことができます： https://skob.medium.com/ ）や以下のような本に基づいています。📘 The Slight Edge 📗 Atomic Habits 📙 The Power of Habit あなたは習慣追跡アプリについて、どのような点が好きですか、嫌いですか？",
  "data/ph-top/2021/8/easyvoice.json": "Easyvoiceは、Amazon AlexaやGoogle Assistant向けの音声アプリをデザイン、プロトタイプ、公開するための、無料のオンライン・ノーコード・ツールです。あなたのアイデアを音声アプリで実現してみませんか？",
  "data/ph-top/2021/8/minimalist-3.json": "Appleのために設計された製品です。iCloudで同期。一度きりの購入です。ブラウザの拡張機能を使わずに自動入力が可能 2FAコードの生成 業界標準の256ビットエンドツーエンド暗号化 超高速ロック解除。家族で共有して購入。カナダ製です。永遠に無料でお試しいただけます。",
  "data/ph-top/2021/8/minymon.json": "ミニモンとは、あなたのウェブサイトに住むペットのことで、よくある質問に💬答えたり、ウェブサイトの訪問者と👋交流したり、✨あなたのブランドを構築することができます。",
  "data/ph-top/2021/8/anywebp.json": "https://anywebp.comis WebP画像を一般的なJPG/PNGやICOに変換することができるオールインワンのオンラインツールです。逆に、他の画像フォーマットをWebPに戻すこともできます。高速、無料で、画像をサーバーにアップロードする必要はありません。",
  "data/ph-top/2021/8/foaas-v2-3-1.json": "FOAAS（Fuck Off As A Service）は、人に「消えろ」と言うという一般的な問題に対して、最新のRESTfulでスケーラブルなソリューションを提供します。",
  "data/ph-top/2021/8/rocket-beta.json": "💡 より多くの時間を集中して過ごし、より深い集中状態になることを目的とした、まったく新しいソーシャルメディアです。⚡ 仕事を早く終わらせ、時間を有効に使い、技術的な意識を高めます。🌱 1時間集中するごとに1.2kgのCO2をオフセットします。",
  "data/ph-top/2021/8/onboardbase.json": "Onboardbaseは、環境変数、パスワード、クレジットカードなどの機密情報を、チーム全体で効果的かつ安全に、共同で作業、保存、管理、共有することを可能にします。",
  "data/ph-top/2021/8/diary-by.json": "Diary.byは、ブログ、日記、記事、コード、さらにはレシピのための、ミニマルでクリーン、広告やトラッキングのない出版プラットフォームです。",
  "data/ph-top/2021/8/greeked-and-blurred.json": "1. Webページ上の不要な情報を隠す 2. greekingとadaptive blurringを使用して、ページの構造を可能な限り明確にする 3. 要素を選択して、そのままの形で表示できる 4. ページにデータを追加しても動作を継続する",
  "data/ph-top/2021/8/unbugqa.json": "UnbugQAは、ソフトウェア・テクノロジー企業が、技術界で最も優れたソフトウェア・テスターや品質保証エンジニアを見つけ、雇用し、一緒に働くためのエコシステムを構築しています。",
  "data/ph-top/2021/8/makerlead.json": "MakerLeadは、オープンなスタートアップ企業の上位100社の月次収益を表示したランキングです。メーカーや起業家志望の方は、インディーズのスタートアップシーンで何が起こっているのかを明確に把握することができます。",
  "data/ph-top/2021/8/security-3d-icons.json": "49種類のセキュリティアイコンのコレクション。セキュリティや保護を視覚化する必要があるプロジェクトに最適です。すべてのレイヤーはカラースタイルに接続されています。そのため、色の変更がとても簡単にできます。",
  "data/ph-top/2021/8/onin.json": "チャットにいながらにして、時間を見つけたり、イベントを計画したりすることができます。早期アクセスプログラムに参加して、Oninを最初にお使いください。",
  "data/ph-top/2021/8/anachron-s-bubble-school.json": "Anachron's Bubble Schoolは、Techの知識を持たない人のための無料オンラインコースです。アカデミーは、あなたが始めるのに必要なすべてを網羅した、公開されたコンテンツのコレクションです。私たちは、あなたが素晴らしいものを作る方法を学ぶためにここにいます。",
  "data/ph-top/2021/8/wildpoint.json": "Wildpoint」は、ホストが自分の土地をユニークなキャンプ場として掲載し、ゲストが地形や周辺のアクティビティなどのフィルターを使って、そのキャンプ場を探すことができる新しいウェブプラットフォームです。",
  "data/ph-top/2021/8/carta-launch.json": "Carta Launchは、創業者がより強力なスタートを切るための無料プラットフォームです。リアルタイムの資金調達ベンチマーク、シナリオモデリング、自動化されたSAFE、キャップテーブル管理にアクセスすることで、ビジネスを構築することに多くの時間を費やし、管理タスクに費やす時間を減らすことができます。",
  "data/ph-top/2021/8/nsfw-rest.json": "あなたのプラットフォームをNSFWコンテンツから守るために、すべて無料で利用できます。画像（ビデオやその他の近未来のコンテンツ）をアップロードするだけで、NSFW（仕事には安全ではない）かどうかを簡単に検出できます。nsfw.restを利用しているプラットフォームの一つにfile.coffeeがあります!",
  "data/ph-top/2021/8/jawa.json": "Jawaは、ゲーマーがパーツを売買するための最初のマーケットプレイスです。Jawaは、数日前に立ち上げられ、認証された売り手、誰もが利用できる保護、スキャルピング禁止ポリシー、パーツの広範なデータベースを備え、Amanda Friedと強力なゲーマーのコミュニティが主導しています。",
  "data/ph-top/2021/8/purple-photo.json": "Purple photo Purple photoは、お客様のソーシャルメディアアカウント（Twitter、Facebook、Instagram、Linkedin）にリッチで美しいコンテンツを作成することを目的としています。",
  "data/ph-top/2021/8/oneclip.json": "クリップボードを近くの人と共有することができます。オープンソース、セットアップなし、サインアップなし。",
  "data/ph-top/2021/8/inetpet.json": "iNetPet: ペットのケアのためのグローバルハブ。AndroidとiOS用の無料アプリです。ペットの家庭教師と専門家の間のユニークなリアルタイムのインターフェイス。獣医、グルーミング、トレーナー、デイケアセンターからのすべての手続きを リアルタイムであなたの携帯電話に直接登録されます。",
  "data/ph-top/2021/8/yik-yak-3.json": "Yik Yakが帰ってきた! あなたとあなたの周りの人々をつなぐ、極めてプライベートなネットワークです。紐付け（ラベル）はありません。",
  "data/ph-top/2021/8/linkedin-scraper-email-finding.json": "最近のLinkedInスクレーパーは使いづらく、ひどいメール検索を提供しています。この問題を解決するために、ClearbitとHunter.ioに直接接続してメール検索を行っています。",
  "data/ph-top/2021/8/dall-e-mini.json": "DALL-E miniは、任意のテキストプロンプトから新しいイメージを生成することができます。上記の例をご覧になるか、今すぐお試しください。無料です。",
  "data/ph-top/2021/8/tara-ai-2-0-1.json": "ミッションクリティカルな製品のアップデートをTara AIで定義、計画、追跡する。コードの進捗状況を即座に把握できます。Tara AI は、タスク、スプリント、ドキュメントをコードに関連付けて、チームが製品を出荷できるようにする高速プロジェクト管理です。今では自動化も組み込まれています。",
  "data/ph-top/2021/8/kona-2-0-2.json": "チームはKona for Slackを使って一日の出来事を話すのが好きです。Kona 2.0では、新しいウェブダッシュボードが導入され、マネージャーがチームの健康状態をこれまでになく視覚化できるようになりました。",
  "data/ph-top/2021/8/infinity-maps.json": "地球は平らじゃないんだよ。あなたのツールはなぜ？無限にズームできるナレッジマップで、任意の量の情報を深く掘り下げます。プロジェクトを視覚的に表現し、空間的に整理することができます。",
  "data/ph-top/2021/8/lemon-4.json": "AWSは強力だが、UIは混乱している。Lemonは、VercelやHerokuのように直感的に操作できる代替UIです。 DevOpsのベストプラクティスが箱から出して付属しており、しかも無料です。",
  "data/ph-top/2021/8/rainforest-qa-2.json": "Rainforest QAは、製品チームの誰もが簡単に品質向上に貢献できる、ノーコードのテスト自動化プラットフォームです。毎月5時間までの自動テストを無料で実行できます。",
  "data/ph-top/2021/8/pickleball-stencil-by-boundaryally.json": "ピックルボールはアメリカで最も急速に成長しているスポーツですが、コートの数は十分ではありません。BoundaryAllyでは、数分でコートを設置し、どこでもプレーを始めることができます。",
  "data/ph-top/2021/8/storymaze-2.json": "StoryMazeは、没入感のあるスモーキーなオーディオストーリーが楽しめる、新しいインタラクティブアプリです。各ストーリーは、ボイスアーティストによって読み上げられます。エピソードの終わりに、あなたは主人公が次に何をすべきかを選ぶのを手伝い、物語の流れに影響を与えます。選択はあなたの手の中にあります。",
  "data/ph-top/2021/8/blossom-9.json": "ブロッサムは、これまで以上にコーチングを身近なものにします。あなたのプロフィールや目標に合わせて最適なコーチを見つけ、科学的根拠に基づいたアプリで進捗状況を確認することができます。自信を持って成長の旅に出て、最高の自分を開花させましょう。",
  "data/ph-top/2021/8/heycopy.json": "HeyCopyは、コピーライター、プロダクトビルダー、インディーハッカー、ハスラー、デザイナーなどが、コピーバディを使ってより良いライターになることをサポートします。コピーバディとは、HeyCopyが審査し、興味やスキルレベルに応じてマッチングするあなたのアカウンタビリティ・パートナーです。",
  "data/ph-top/2021/8/postdrips-by-contentdrips.json": "これは、パーソナルブランドのために作られた、シンプルな1ページのLinkedInドラフト＆スケジュールツールです。LinkedInのテキストを太字や斜体にしたり、投稿を実際にプレビューして、LinkedInでどのように表示されるかを確認することができます。シンプルなツールですが、十分な機能を備えています。",
  "data/ph-top/2021/8/how-to-get-started-with-cro-workbook.json": "あなたはCROの専門家ですか？そうでなければ、このワークブックはあなたのニーズにぴったりです! 60ページに及ぶテンプレートが満載で、この分野でのあなたのスキルを高め、プロ顔負けの成果を上げることができます。今すぐダウンロードして、CROを使いこなそう!",
  "data/ph-top/2021/8/studystream.json": "StudyStreamは、学生や若い社会人が24時間365日、リアルタイムで世界中の人たちと一緒に仕事ができるビデオプラットフォーム＆オンラインコミュニティです。毎日一緒に作業をする180カ国以上のユーザーにアカウンタビリティーとモチベーションをもたらします。",
  "data/ph-top/2021/8/elpha-talent-pool.json": "自分の文化に合った企業とのつながりを持つ。あなたのスキルや気になる文化的資質などのプロフィールを作成すると、あなたにぴったりの企業を紹介してもらえます。タレントプールは、5万人以上の女性がキャリアを築いているElphaの一部です。",
  "data/ph-top/2021/8/billfixers-2-0.json": "請求書への対応は最悪です。私たちは、あなたに代わって交渉し、お金と時間とストレスを節約します。さらに、値上げや割引の期限切れ、期間限定のキャンペーンなどを自動的に追跡し、常に最低価格でご利用いただけます。",
  "data/ph-top/2021/8/zoom-slack-sync-by-reclaim-ai.json": "カレンダーに登録されていないZoom通話に参加したり、Zoom通話を終了したりすると、Slackのステータスが自動的に「会議中」や「邪魔しないで」に更新されます（カレンダーに登録されていない場合や、通話が早く終わった場合も同様です）。ZoomとSlackとGoogleカレンダーを連携させることで、気が散らない会議を実現できます。",
  "data/ph-top/2021/8/grub-2.json": "Grubは、Java/Kotlinで作られたオープンソースで100%無料のUberEats UIクローンで、Android、iOS、Desktop & Webに対応しています。UberEats、Foodpanda、GrubHubなどのようなクロスプラットフォームのフードデリバリーアプリを単一のコードベースで構築することができます。⠀ ⭐ ⠀ https://github.com/sergeyCodenameOne/UberEatsClone でスターをつけてください。",
  "data/ph-top/2021/8/clearpitch42.json": "究極のエレベーターピッチのテンプレートです。42秒で、聞き手（投資家）が必要とする、あなた、あなたのスタートアップ、そのステージ、そしてあなたの要求を理解することができます。ステージやネットワーキングイベントでClearPitch42フォーマットを使用した後、次のミーティングを保証します。",
  "data/ph-top/2021/8/mockup-clips.json": "ウェブベースのビデオツールを使って、実際のシナリオでアプリやウェブサイトを紹介しましょう。メディアをドロップするだけですぐにプレビューでき、新しいリアルなビデオモックアップを4KまたはHDでエクスポートできます。",
  "data/ph-top/2021/8/appx.json": "AppXは、クリエイターがオンラインアカデミーのアプリ📱を立ち上げ、オンラインでコースを販売することができます。",
  "data/ph-top/2021/8/sigmaos.json": "SigmaOSは、仕事のために作られた最初のブラウザで、あなたをより速く、より良くするために設計されています。🗂️ ワークスペースでページやウェブアプリを整理することができます💤 スヌーズページで頭をスッキリさせることができます✂️ スプリットスクリーンでプロのようにマルチタスクをこなすことができます 今すぐ試してみてください: https://sigmaos.com",
  "data/ph-top/2021/8/jemi-2-0.json": "Jemiは、クリエイターや起業家のためのウェブサイトビルダーです。Linktreeの簡単さとSquarespaceのカスタマイズ性で、数分でウェブサイトを構築できます。手作りのテンプレートを使って夢のようなウェブサイトを作ってみませんか、それともゼロから始めてみませんか？",
  "data/ph-top/2021/8/million-dollar-email-templates-2-0.json": "1億円以上の会社のメール金庫を開けています。取引の交渉、商品の販売、バックリンクの生成、インフルエンサーの確保、多忙な人からの返信など、AppSumoで使用してきた40以上の一語一語のメールテンプレートを入手できます。🎉",
  "data/ph-top/2021/8/canvas-for-zoho-crm.json": "Canvasは、Zoho CRMに組み込まれたドラッグ＆ドロップのデザイン・スタジオで、すべてのチームのために、文脈に沿った、没入感のある、オーダーメイドのエクスペリエンスを作成できます。新しいデザインをゼロから作成することも、テンプレートを選んですぐに作成することもできます。",
  "data/ph-top/2021/8/tidycal-2-0.json": "メールでやりとりする代わりに、TidyCalのリンクを共有して、相手に都合の良い時間を選んでもらいましょう。複数の予約タイプを作成し、最大10個のカレンダーを接続し、Zoom、Google Meet、Zapier、Google Calendar、Office 365と統合することができます。",
  "data/ph-top/2021/8/visionrare-beta.json": "ファンタジーフットボールとスタートアップ投資の融合。⠀ 自分が信じているスタートアップの、NFTが支援する限定版ファンタジー株式を集めて取引し、トーナメントで競い合い、投資から実際のリターンを得る。🚀",
  "data/ph-top/2021/8/intersect-2-0.json": "Intersectは、データ・アプリケーションを最も簡単に構築・出荷できる方法です。シンプルなビルディングブロックで以下のことが可能です。あらゆるデータソースに接続 自分やチームのためにデータワークフローを構築 インタラクティブなダッシュボードやレポートを共有・公開 反復処理を自動化",
  "data/ph-top/2021/8/accord-2.json": "Accordは、成長目標を達成するために反復可能なセールス＆オンボーディングプロセスを構築する必要がある企業のための、カスタマーコラボレーションプラットフォームです。コラボレーション、透明性、エンゲージメント - お客様に喜ばれています。",
  "data/ph-top/2021/8/photo-toon.json": "Photo Toonは、ワンタップで写真を漫画風の絵に変えることができる写真・漫画アプリです。描いた絵は、アプリ内の画像エディタで編集してから、共有したり、デバイスに保存することができます。",
  "data/ph-top/2021/8/phishdeck.json": "PhishDeckは、高度なリアルタイム・フィッシング攻撃を簡単にシミュレーションし、セキュリティ意識向上プログラムの改善と測定を可能にします。すぐに使えるフィッシング・シミュレーション・テンプレート、レポート、実用的なインサイトを、シンプルで透明性の高い価格で提供しています。",
  "data/ph-top/2021/8/kinopio-2-0.json": "自分の考えを外に出して、それを視覚的につなげていく。Kinopioはあなたの心が動くように動作します。サインアップの必要はありません。",
  "data/ph-top/2021/8/product-design-assignments.json": "48時間以内にデザインを完成させるために徹夜をして、不合格になったことを覚えていますか？私たちは、これからデザイナーになる人たちが、面接を受ける前に練習できるような問題集を提供することで、彼らの生活を楽にしようとしています。",
  "data/ph-top/2021/8/antistalker-by-malloc.json": "Antistalkerは、アプリがあなたのデバイスのカメラやマイクを使用する際に通知します。これは、プライバシードットを超えています。アプリがどのくらいの時間使用され、どのくらいのデータがインターネットに送信されているのかを教えてくれます。",
  "data/ph-top/2021/8/huemint.json": "Huemintは、機械学習によってカラーパレットを生成します。ロゴのモックアップやウェブサイト、イラストなどで、配色を瞬時に視覚化することができます。",
  "data/ph-top/2021/8/scribd-downloader.json": "このクロームの拡張機能は、scribdのドキュメントをダウンロードするためのものです。",
  "data/ph-top/2021/8/truepush-for-shopify.json": "Truepushは、市場で最も急速に成長しているプッシュ通知ツールの1つであり、優れた品質の製品を低コストで提供することにより、多くの企業が高いROIを得られるよう支援することを使命としています。現在、月間180億件のプッシュ通知を行っています。現在、Shopifyに対応しています。",
  "data/ph-top/2021/8/carsifi-wireless-android-auto-adapter.json": "このアダプターを使えば、車にWiFiが搭載されていなくても、コードを使わずにワイヤレスでAndroid Autoに接続することができます。Kickstarterで初日に100%以上の資金調達を達成🚀。",
  "data/ph-top/2021/8/panda-pixel-website-design.json": "Panda Pixelは、低額な月額料金で、中小企業向けにコンバージョン率の高い美しいウェブ体験を提供します。完全にお客様のために作られ、サイト更新のサポートも無制限です。",
  "data/ph-top/2021/8/loginradius-cli.json": "Webアプリケーションやモバイルアプリケーションの認証やシングルサインオンを設定・管理するためのコマンドライン・インターフェース（CLI）をお探しですか？今回、LoginRadius CLIをご紹介します。ハッカーのようにパーカーを着よう!",
  "data/ph-top/2021/8/statsig.json": "Statsigは、最新の機能管理および製品実験プラットフォームであり、意味のあるデータインサイト、実用的な因果関係分析、他のサービスの10倍以上の実験を自動的に実行することで、出荷の迅速化を支援します。",
  "data/ph-top/2021/8/bucket-5.json": "Bucketは、やりたいことや一緒にやる人を見つけるためのソーシャルメディアプラットフォームです。",
  "data/ph-top/2021/8/battery-thing.json": "Macのバッテリーアイコンを好きな時に表示／非表示にすることができます。ワンクリックで、バッテリーの状態やBluetooth製品のステータスを表示します。",
  "data/ph-top/2021/8/opensales.json": "オープンセールスは、世界中の人々がコミュニティの力を使って見込み客になることができる、完全に無料のピアツーピア・ネットワークです。Chrome拡張機能をダウンロードするだけで、LinkedInの見込み客の仕事用メールを見つけることができます。",
  "data/ph-top/2021/8/creativeeditor-sdk.json": "CE.SDKは、完全にカスタマイズ可能なデザインエディターであり、わずか数行のコードでテンプレートベースのワークフローと自動化を可能にします。このエディタは、レイアウト、写真編集、タイポグラフィの長所を組み合わせたもので、どのようなユースケースにも簡単に対応できます。",
  "data/ph-top/2021/8/canonic-2.json": "Canonicは、ローコードで直感的に操作できるプラットフォームで、WebやモバイルアプリのスケーラブルなバックエンドやクラフトAPIを構築できます。開発者は、コードを1行も書かずに、すぐに生産可能なバックエンドを出荷することができます。コードを1行も書かずにです。",
  "data/ph-top/2021/8/gitnft.json": "GitNFTは、開発者がGitHubのコミットのNFTをミントし、シームレスにOpenSeaのマーケットプレイスに掲載することを可能にします。ミンティングのコストは、家計に優しい🍺です。",
  "data/ph-top/2021/8/riverside-fm-2-0.json": "クリエイターの皆さん、お待たせしました。~ 本日、Riverside 2.0🚀🚀をリリースしました ~ 数秒で素晴らしいポッドキャスト＆ビデオを作ることができます ~ よろしくお願いします。~ 🔤自動トランスクリプション 🎬AIスピーカービュー 🪄マジックエディター 📱iPhoneアプリ 💻フルHDスクリーンシェア収録",
  "data/ph-top/2021/8/launch-wiki-by-launch-kitty.json": "Launch Wikiには、Product Huntでの製品発表をより良くするための様々な指標に関する統計が含まれています! 統計は、理解しやすいように詳細なグラフィックや表、カスタムメトリクスで表示されています。",
  "data/ph-top/2021/8/elementsready.json": "Elements Ready - Elementor Addonsには、究極のElementorブロックとウィジェットが用意されています。テンプレートライブラリ、Readyセクション、柔軟なオプションにより、ユーザーにとってより効率的なものとなっています。これにより、あなたの時間と労力を確実に節約できます。",
  "data/ph-top/2021/8/standuply-for-ms-teams.json": "よく知られていて、最も人気のあるSlackアプリの1つであるStanduplyが、同じ機能を持ってMS Teamsに対応しました。MS Teamsのコミュニケーションにスパイスを加えてみませんか。",
  "data/ph-top/2021/8/pioneer-codex.json": "Pioneer Codexは、プロジェクトのアイデアから種まきまでを行うための最良の文章とビデオを集めたものです。Codexは、私たちが初期の創業者との何千もの会話の中で聞いた最も一般的な100の質問に直接答えています。",
  "data/ph-top/2021/8/wonderly.json": "Wonderlyは、AIを搭載したブラウザ拡張機能で、仕事や勉強、レジャーなどでネットサーフィンをする際に、オンラインでの情報検索をより速く、より便利にします。検索結果のリストではなく、ワンクリックでAIがキュレーションした短い回答を得ることができます。",
  "data/ph-top/2021/8/dashly-chatbot.json": "Dashly Chatbotは、ボットを構築し、ウェブサイトの訪問者をエンゲージするためのノーコードソリューションです。チャットボットは、リードを収集し、適格に判断し、適切なチームに渡します。そのため、誰と話しているのかがわかり、売上につながるパーソナライズされたコミュニケーションを実現します。",
  "data/ph-top/2021/8/ai-video-generator.json": "これは、VQGAN+CLIPアート生成アルゴリズムのホストバージョンです。クエリを入力するだけで、誰でも人工知能を使ったアートに挑戦することができます。好きなテキストを入力するだけで、このツールが完全にユニークな動画を生成してくれます。",
  "data/ph-top/2021/8/slapdash-command-bar.json": "コマンドバーは、現代のコンピュータ作業を退屈にさせず、より楽しくするSpotlightのようなツールです。キーボードを中心としたインターフェースで、素早く作業ができるように設計されています。",
  "data/ph-top/2021/8/vint-2.json": "Vintは、SEC認定の透明性のある取引プラットフォームにより、ワイン＆スピリッツ市場を投資可能なものにしています。Vintは、世界クラスのワインとウィスキーのテーマ別コレクションを作成し、1株10ドルからの効率的な投資を可能にしています。",
  "data/ph-top/2021/8/creative-habit-generator.json": "何かのクリエイターになりたい？このシンプルなジェネレーターを使って、そこに到達するために構築できる習慣を発見してください。",
  "data/ph-top/2021/8/serverful.json": "Serverfulは、サーバーレスの経験をコンテナにもたらします。ホスティングでも、AWSアカウントでも Githubリポジトリを接続するだけでデプロイできます。",
  "data/ph-top/2021/8/taskbar.json": "すべてのユーザーのニーズに応えるためにゲーム化された、初の完全に自律した自己主権型のギグエコノミープラットフォームになること。目標は、信頼できるWeb3.0エコシステムを介して、ユーザーのためのタスクのボーダレスな市場を通じて、大量のファイナンシャル・インクルージョンをサポートすることです。",
  "data/ph-top/2021/8/crumbs-privacy-from-the-makers-of-abp.json": "Crumbsは、Adblock Plusのメーカーであるeyeo社が開発した、最高の無料プライバシーツールです。😎 信じられないほどのプライバシー保護ツールのコレクション 🥸 EメールエイリアスでEメールを隠す 🍪 クッキーのポップアップをブロック 💪 データを可視化してコントロールしながら、公正なウェブをサポートする",
  "data/ph-top/2021/8/lead-forms-by-gosquared.json": "ユーザーの真の行動に基づいて作られた、ターゲットを絞ったオンボーディング・ジャーニーを引き起こすリード・キャプチャー・フォーム。",
  "data/ph-top/2021/8/bubble-video-commenting.json": "Bubbleは、ユーザーがあらゆるコンテンツの上にビデオコメントを作成、共有、反応することができるソーシャルビデオプラットフォームです。Bubbleを使って、写真、スクリーンショット、ビデオにコメントしたり、他の人にビデオコメントを要求することができます。getbubble.appでぜひお試しください。",
  "data/ph-top/2021/8/dewwy.json": "継続的な学習と自己成長が好きな方 Dewwyは週3回、最高の生産性／自己成長／継続的な学習コンテンツをメールでお届けします。⠀ 今すぐ私たちと一緒に学びましょう！ https://my.community.com/dewwy.",
  "data/ph-top/2021/8/the-breakaway.json": "The Breakaway」は、サイクリストをはじめとするフィットネス愛好家のためのモチベーション・コーチング・プラットフォームです。私たちのアプリは、PelotonやGarminなどの既存のプラットフォームのデータを利用して、サイクリストをコーチや友人と結びつけ、パーソナライズされた課題で上達をサポートします。",
  "data/ph-top/2021/8/ai-image-upscaler.json": "AI Image Upscalerで、よりシャープで大きな写真を手に入れよう 🔍 2倍、4倍、8倍に自動的に拡大されます。ピクセーションやディテールのボケもありません。🔥 ボーナス: GET IT リンクから 10 個の無料アップスケールを入手できます。",
  "data/ph-top/2021/8/lexicon-2.json": "Lexiconは、カスタマイズ可能なオープンソースのモバイルアプリで、エレガントなモバイルディスカッション体験を提供します。コミュニティのためのオープンソースプラットフォームであるDiscourse上に構築されています。Lexiconをフォークして、既存のDiscorseインスタンスに接続し、App storeに出荷しましょう。",
  "data/ph-top/2021/8/poppins.json": "Poppinsは、メッセージをアクションアイテムやディスカッショントピックとして、コンテキストを切り替えることなくSlack内に取り込むことで、Slackをアクション可能なものにし、1時間程度の時間短縮を実現します。世界中で100以上のチームがPoppinsを信頼しています。",
  "data/ph-top/2021/8/lassie-smoke.json": "Lassie Smokeは、Facebook Messenger用のボットです。タバコを吸うまでの時間をコントロールしたり、タバコを吸う間隔を長くすることを補助します。追加のソフトウェアを使用することなく、禁煙を実現します。😈",
  "data/ph-top/2021/8/synth-4.json": "音声で得た知識をAIで要約したり、リアルタイムのトランスクリプトから1クリックで情報を取り込んだりすることで、トップレベルの知識を得ることができます。Synthは、どのようなプラットフォームからでも、これらの知識を取り込み、要約し、取り出すことができます。",
  "data/ph-top/2021/8/instad-io.json": "画期的なウェブベースのイメージリスタイラーで、チャート、マップ、アイコン、ダイアグラム、イラストなどのあらゆるビジュアルを、数回のマウスクリックで自動的にスケッチ風／手描き風に変換することができます。",
  "data/ph-top/2021/8/cred-mint.json": "CREDの最初のコミュニティ製品は、信頼に基づいて作られています。信頼できる他のCREDメンバーに投資しながら、最大9％の利息を得ることができます。https://cred.club/mint にアクセスして、いち早くご利用ください。",
  "data/ph-top/2021/8/jumpskip-for-netflix.json": "Jumpskipは、NetflixのChrome拡張機能で、ジャンプカーに怯えずに映画を見ることができます。スキップ、ミュート、ジャンプケアが起こりそうなときに警告を表示、すべてのジャンプケアのタイムスタンプを表示、などなど。",
  "data/ph-top/2021/8/scrollingmockup-io-2.json": "ウェブデザインは爆笑ものです。マーケティング用のモックアップを作るのは そうではありません。ScrollingMockup.ioは、HDでアニメーションするスクロール・モックアップを数分で作成します。あなたのウェブサイトのURLを貼り付け、増え続けるテンプレートギャラリーから選択し、音楽を追加して投稿するだけです。",
  "data/ph-top/2021/8/deploy-empathy.json": "Deploy Empathy」では、お客様と会話することで、お客様の隠れたニーズや欲求、プロセスを引き出すスキルを身につけることができます。この本を読み終える頃には、自信を持ってお客様や潜在的なお客様にインタビューできるようになるでしょう。",
  "data/ph-top/2021/8/content-partner-by-justreachout.json": "JustReachOut Content Partnerは、コンテンツコラボレーションやパートナーシップを開始するために、あらゆる企業やブログのコンテンツマーケターやSEO担当者を非常に簡単に見つけることができます。URLを入力すると、コンテンツコラボレーションを開始するために必要な人のリストがすぐに表示されます。",
  "data/ph-top/2021/8/wyshbox.json": "Wyshboxにご挨拶。私たちは 簡単、手頃な価格、100％オンライン、完全にカスタマイズ可能、健康診断から解放される。お子さんを大学に通わせたいですか？いいですね。あなたの遺灰を宇宙に送りたいですか？それを実現しましょう。iOSまたはウェブで、無料であなたのWyshesを作り始めましょう。",
  "data/ph-top/2021/8/unmute-2.json": "ミュート解除は、音声合成を利用して、通話中にiPhoneがあなたの代わりに話すようにします。文章をあらかじめ登録したり、通話中にiPhoneに話してほしい言葉を入力したりすることができます。この機能は、無口な人（話すことができない／話さない）や、その他の言語障害がある人に役立ちます。",
  "data/ph-top/2021/8/docvita.json": "DocVitaは、インドのテレヘルス・プロバイダーです。Zoom、Meet、WhatsAppを使った専門的なケアを11の言語で提供しています。",
  "data/ph-top/2021/8/sharedinbox.json": "Slack内のチーム用共有インボックス - 既存のチームメール（help@、info@、sales@など）をSlackに接続して、外部のメールを使って簡単にコラボレーションができます。",
  "data/ph-top/2021/8/gallery-68556bee-1ea7-41e0-957c-2314270524e4.json": "ワンクリックで本番環境を複製したり、Github/Gitlabに接続してプルリクエストのビルドをトリガーしたり、Slack/Jiraを介してQAと環境プレビューを共有したりと、クラウド・プロバイダーや環境アーキテクチャを選びません。",
  "data/ph-top/2021/8/youtube-video-downloader-2.json": "シンプルなin oneのyoutube用ビデオダウンローダです。プロダクトハントのコミュニティでは目新しいものはありませんが、私のツールを使いたい人がいれば、みんなで共有したいと思いました。PWA（Progressive Web App）をインストールすると、さらに高速に動作します。広告が入っていますが、前にも言ったような気がしますが、ご了承ください。",
  "data/ph-top/2021/8/valkyrie.json": "Valkyrieは、3D/ARモデラーとデザイナーのためのノーコードのクリエイティブプラットフォームで、Unityのようにパワフルで、Photoshopのように簡単に使用できます。プログラマーではない人のために作られているので、学習しやすく、使いやすく、クリエイティブなプロジェクトを実現するための最速の方法となっています。",
  "data/ph-top/2021/8/live-chat-by-wotnot.json": "私たちは、カスタマーサポートをより簡単にするために、完全に改良されたライブチャットのインターフェースを紹介することにとても興奮しています。🚀 より速く! 😎 高効率 サポートチームのプレッシャーを軽減し、究極のチャット体験を提供しませんか？🤓",
  "data/ph-top/2021/8/questionwave.json": "私たちは、イベントでのQ&Aセッションをより速く、より整理されたものにするためにQuestionwaveを作りました。Questionwaveは、イベント主催者がイベント前やイベント中に質問を集めるのに役立ちます。100％無料、超高速、登録不要です。ご意見、ご感想をお聞かせください。",
  "data/ph-top/2021/8/poet-so.json": "Twitterの投稿を美しい画像として取り込み、共有することができます。Poet.soは、Twitterの投稿を他のプラットフォームで共有する際に、より視覚的で注目を集めるようにします。",
  "data/ph-top/2021/8/neodocs-wellness-card.json": "Neodocsは、スマートフォンからすぐに検査結果を出すことができます。当社のユーザーは、主要な栄養指標を追跡し、改善することを望む健康管理者です。",
  "data/ph-top/2021/8/mooze.json": "Moozeは、カスタムオーバーレイ、没入型プレゼンテーション、PiPスクリーン共有、リアクションなどで、ビデオ通話をパーソナライズすることができます。人々の記憶に残る印象を作りましょう。⚡️",
  "data/ph-top/2021/8/framestack.json": "Framestackは、あなたの次のアイデアを実現するために必要なツール/ライブラリ/フレームワークを集めたもので、オープンソースなので、誰でも新しい機能を追加したり、お気に入りのツールを追加したりして貢献できます。",
  "data/ph-top/2021/8/candlewaster.json": "Candlewasterは、本を読む習慣を身につけるためのアプリケーションで、読書データを記録し、そのデータを統計的にインタラクティブなグラフィックで表示することができます。",
  "data/ph-top/2021/8/tempus-3.json": "YouTubeのコメントをタイムスタンプ付きで効率的に管理・閲覧することができます。",
  "data/ph-top/2021/8/clip-it.json": "かつてはボタンを押すだけで簡単にできたクリッピング。今ではさらに簡単になりました。",
  "data/ph-top/2021/8/serp-preview-tool.json": "検索結果にどのように表示されるかを可視化する",
  "data/ph-top/2021/8/listlist.json": "ListListは、ユーザーがリストを通して整理された様々なタイプの情報を探索、共有、コラボレーションすることを可能にします。ListListは、リストとコラボレーションの力を利用して、友人やコミュニティの間でアイデアを効率的に共有するソーシャルメディア・アプリです。",
  "data/ph-top/2021/8/bloop-3.json": "bloopは、ライブラリのドキュメントやオープンソースのリポジトリから、関連するJSやTypeScriptのコード例を検索するin-IDEコード検索エンジンです。⠀ ライブラリ関数のパラメータ、出力、エラー処理を、Googleにアクセスすることなく確認できます。",
  "data/ph-top/2021/8/worthy-domains.json": "ドメインの調査方法を再考してみましょう。まず、価値のあるドメインを決定し、次にそのドメインの空き状況を確認します。その逆ではありません...。時代遅れのレジストラでの長時間の調査や、何百もの不適切な結果はもう必要ありません。今すぐ、あなたのドメイン決定を加速させましょう",
  "data/ph-top/2021/8/save-chrome-tabs-for-later-2.json": "現在開いているタブを簡単に保存し、後ですぐに復元することができます。もう、閲覧履歴を読み返して、どんなものが残っているかを知る必要はありません。クリックしていたのにアクセスできなかった重要な情報を見逃すことはありません。",
  "data/ph-top/2021/8/fsnotes-5.json": "皆さん、こんにちは！FSNotes 5がついにリリースされました。ここでは、macOSのための最も先進的なノートマネージャが完全に書き直され、電子を搭載しています... もちろん、Swiftは初期のようなものですが、たくさんの改良が加えられています。高度なタグ管理、フォルダツリー、洗練されたUI/UXなどです。",
  "data/ph-top/2021/8/good-launcher.json": "集中力を高め、生産性を向上させ、気が散らないようにするために、ミニマムでありながらパワフルなランチャーを作るための独自のアプローチ テーマを無料でサポート モチベーションを高めるコンテンツ、事実、ライフハックを表示 電話の使い方 ジェスチャーサポート",
  "data/ph-top/2021/8/informant.json": "ずっと⌘＋iを押すのが面倒だったので、これを作りました クリックや矢印キーの操作を監視し、現在選択されているファイルを追跡します。メニューバーやパネルインスペクタにあるすべてのメタデータを表示します。",
  "data/ph-top/2021/8/mynfteam.json": "mynfteamは、経験の有無に関わらず、その空間に情熱を持ったユニークでファンジブルなチームを見つけ、参加し、集まり、共にWAGMI！できるプラットフォームを提供することを目的としています。",
  "data/ph-top/2021/8/netumo.json": "Netumoは、ウェブホストやRESTful APIの合成監視を行うアップタイム監視サービスです。Netumo が問題を検出すると、SMS、Twitter、電子メール、Telegram、MS Teams、Slack を使ってエンドユーザに通知します。",
  "data/ph-top/2021/8/genomelink-2-0.json": "23andMe/AncestryDNAなどの企業でDNA検査を受けた方は、GenomelinkにDNAデータを転送することで、以下のような何百ものアプリのロックを解除することができます。🧬 23andMeよりも深い祖先レポート 🧬 AncestryDNAで得られるものよりも200以上多い体と心の特徴。",
  "data/ph-top/2021/8/figstack.json": "コードを読んだり書いたりするのは大変です。Figstack は、あらゆる言語のコードを理解し、言語間の翻訳を行い、ドキュメンテーションを自動化することで、重要なものを作ることに集中できるようにします。",
  "data/ph-top/2021/8/wicked-popups.json": "Tailwind CSS Pop-Ups/modalsは、Tailwind CSSを使ったウェブサイトのためのものです。18個のコード化されたTailwind CSSのダイアログ、サインアップ、ソーシャルポップアップは、HTMLとTalwind CSSで利用可能です。",
  "data/ph-top/2021/8/spatium.json": "美しい宇宙の画像と、現在のスカイマップの位置情報を新しいタブごとに表示します。",
  "data/ph-top/2021/8/loona.json": "loónaは、ストレスの多い長い一日から素早く切り離され、睡眠に適した気分になることができる初めてのアプリです。https://www.producthunt.com/posts/msqrd のチームから。",
  "data/ph-top/2021/8/booby-track-for-ios.json": "iCloudによる同期とバックアップ、ウィジェット、そして最新のビジュアルを備えたiOS版が登場しました。Booby Trackは、あなたの授乳の記録をiPhoneや腕時計で取ることができる、便利で楽しい方法です。",
  "data/ph-top/2021/8/hourglass-5.json": "Hourglassは、時計のように美しく回転する円錐形のグラデーションと、現在の時刻、次のカレンダーイベント、天気予報、現在再生中の曲などの追加情報を提供するオプションのテキストで、デスクトップ体験を刷新します。",
  "data/ph-top/2021/8/pathica.json": "Pathicaは、「Six Degrees Of Separation」という理論に基づいています。これは、地球上のどんな2人の人間も、5人以下の個人を介してつながることができる、という考え方です。その結果、「友達の友達」という発言の連鎖により、最大6段階で任意の2人をつなぐことができるのです。",
  "data/ph-top/2021/8/time-to-estimate.json": "ビデオ通話をしていると、手が切れたり、ひどいラグがあったりすることがありますよね。スクラムリーダーのカウントダウンに合わせて、じゃんけんのように拳を動かしているのに、全員が間違ったタイミングで見積もりをしてしまう。TTEはその解決策です。シンプルで楽しい。",
  "data/ph-top/2021/8/how-i-experience-web-today.json": "私たちは、このウェブ体験が好きではありません。なぜここにたどり着いたのか？",
  "data/ph-top/2021/8/usersplit.json": "Webアプリのユーザージャーニー全体の流れ、会話のメトリクス、重要なイベントをファネルで追跡し、アプリの重要なイベントで通知します。",
  "data/ph-top/2021/8/between.json": "Betweenでは、ノートパソコンや携帯電話を使って、物理的な会話を仮想空間にマッピングすることで、遠隔地の人がテレビに聞き残されないようにしています。遠隔地のスタッフは、物理的な部屋の周りにあるデバイスを使って、バーチャルな通話中の場所に応じて声を向けることができます。",
  "data/ph-top/2021/8/reportedly-2.json": "Reportedly.coは、投資家、アドバイザー、チーム全体で最新情報を共有するためのプラットフォームです。Reportedlyは完全に無料です（常に無料プランを提供しています）。",
  "data/ph-top/2021/8/moralis.json": "🏆 マネージドノードをお試しください (155M free req/月) ⭐️ スケーラブルで高速かつ堅牢なweb3インフラ🤯 キラーdAppsの構築、ホスティング、スケーリングに必要な全てが揃っています🥂 数ヶ月ではなく数日で市場に投入できます。",
  "data/ph-top/2021/8/lumify-care.json": "Lumify Careは、看護師が優れた能力を発揮するために必要なギアを見つけ、共有し、購入することを支援します。私たちは、ルミファイの製品ラインと、看護師が愛するブランド、組織、リソースをフィーチャーしたマーケットプレイスであるルミファイハブを通じてこれを行います。ルミファイハブは本日よりスタートします",
  "data/ph-top/2021/8/60-leaders-on-innovation.json": "私たちは、経営者、学者、技術者、イノベーションリーダー、起業家、スタートアップ企業の創業者など、世界各地の優れたリーダーたちに、イノベーションに関する一定の難問に答えてもらいました。60 LEADERS ON INNOVATION」では、彼らのユニークな視点を紹介しています。",
  "data/ph-top/2021/8/responsivize.json": "Responsivizeはオープンソースのデスクトップアプリで、レスポンシブWebサイトの開発に使用できます。このアプリでは、人気の高いiPhone、Android携帯、iPad、MacBookでウェブアプリをテストでき、カスタムディメンションデバイスを設定することもできます。",
  "data/ph-top/2021/8/commery.json": "Commeryは、商業テナントが最適なスペースを簡単に見つけることができます。テナントは、自分の希望する商業スペースを公開または匿名で掲載することができ、それにマッチしたスペースを持っているブローカーや家主からの連絡を受けることができます。",
  "data/ph-top/2021/8/trends-vc-2-0.json": "Trends.vcは、4万人以上の好奇心旺盛な起業家のためのコミュニティであり、ニュースレターです。No-Code、Micro Private Equity、Micro-SaaSなどのトピックを取り上げています...",
  "data/ph-top/2021/8/airschool.json": "https://airschool.com では、専門家がコホートベースのコースや非同期のコースを1つの場所から簡単に立ち上げることができます。🚀 😻 サブドメインを取得して、デジタルコース https://airschool.come を作成してください。💰 Stripe, PayPal, GooglePayなどで支払いを受け付けます。❤️ あなたの知識を収益化しましょう。",
  "data/ph-top/2021/8/podopolo.json": "Podopoloは、ポッドキャストの聴取をソーシャル化し、クリエイターにポッドキャスティングの収益をもたらします。400万ものポッドキャストからなる自分専用のライブラリ、ホストや友人との有意義な会話、そして聴くことや関わることで得られる報酬や社会的影響を想像してみてください。",
  "data/ph-top/2021/8/lazy-load.json": "Lazy loadは、ワンクリックでスケルトンのローディング画面を生成できます。これにより、Figmaで開発者のハンドオフのためのローディング・スクリーンをデザインする時間を十分に短縮することができます。",
  "data/ph-top/2021/8/the-gist-2.json": "他の自動化ツールに比べて手順や複雑さが少なく、よりシンプルでエレガントな自動化を構築できます。",
  "data/ph-top/2021/8/founder-s-handshake-prenup.json": "Founder's Handshake」と「Prenup」は、2人の（潜在的な）Co-Founderの間の仕事上の関係を公式化するものです。会社を作っている間、一緒にバイブする場合にテストするときにすべての法的な不確実性を取り除きます。",
  "data/ph-top/2021/8/focusli-2-0.json": "Today I launch Focusli 2.0 🚀 ------ Find the best music stream to study/relax ------ Choose from 30 stations ------ 5 Genres LOFI 🎵 Classic 🎹 Jazz 🎷 Techno 🎛️ Meditation 🧘 ------ 皆様のフィードバックをお待ちしております🙏。",
  "data/ph-top/2021/8/ratebunni.json": "💯 It's Complete: 500以上の金融機関があり、現在も増え続けています ☯️ 偏りがありません。📊 金利だけではありません。デジタル機能、顧客評価、コミュニティへの参加、申し込みの速さ、従業員の多様性などを見ることができます。",
  "data/ph-top/2021/8/stox-4.json": "株式、ETF、暗号資産のポートフォリオを追跡し、詳細なメトリクス、統計、ニュースなどを確認できます。価格アラートの設定、ウォッチリストの作成、投資に関する実用的な洞察を得て、より優れたトレーダーになりましょう。",
  "data/ph-top/2021/8/vite-2.json": "Viteは、今日のグローバルな労働力のために設計されています。- Employee https://www.vite.biz/en/learning-development - Improve https://www.vite.biz/en/engagement - Help in Retention & Happy Work Culture - Create Productive Environment - Help to Achieve Company Goals Get 6 Months Free Access: https://www.vite.biz/app/requestdemo/requestdemo.aspx",
  "data/ph-top/2021/8/vomit-space.json": "瞬間的な、あるいは告げられた感情を吐露するための空間。性別でもなく、絵柄でもなく、感情で人とつながる。一緒に幸せを祝ったり、サポートを示したり、意見を共有したりなど、すべてが匿名で可能です。",
  "data/ph-top/2021/8/smartaddress-io.json": "https://smartaddress.ioSmartAddress.IO は、まったく新しいアドレスを世界に紹介しています。21世紀のために作られました。もう不良アドレスはありません。宛先不明の人もいません。人に会ったり、顧客を見つけたりするのに迷うこともありません。",
  "data/ph-top/2021/8/airbooks.json": "Airbooksは、スモールビジネスやフリーランサーのために作られた、使いやすいグローバル会計・在庫管理モバイルアプリです。Whatsapp/Eメールで無制限に請求書や見積書などを送ることができます。スマートフォンさえあれば、どこでもビジネスを管理することができます。",
  "data/ph-top/2021/8/certificationpoint.json": "私たちのキャリアゲートウェイ準備プログラムは、プロジェクトベースの学習であるフリーランスのインタラクティブな経験構築コースであり、大学生が地元、全国、世界の企業やサービス購入者とつながる方法として、学生が獲得するための手段として機能しています。",
  "data/ph-top/2021/8/no-code-board.json": "Google Analytics、Google Search Console、Google AdWords用の美しいダッシュボードを60秒以内に生成します。",
  "data/ph-top/2021/8/overbrowsered.json": "このアプリは、macOSでリンクを開く際に、\"デフォルト \"のウェブブラウザではなく、最も最近使用したウェブブラウザで開くようにします。特にウェブ開発者のように、複数のブラウザを時々切り替えて使う場合に便利です。",
  "data/ph-top/2021/8/article-editor.json": "Article Editorは、複雑なリッチコンテンツのために作られたもので、サイトのページやアプリケーションと同じように見える必要があります。iframeで動作するので、BootstrapやBulmaなどのフロントエンドフレームワークを接続してスタイルを表示することができます。",
  "data/ph-top/2021/8/busta.json": "BUSTAは巨大で野心的なエコシステムであり、まもなく複数のゲームやトークンで構成されるようになります。BUSTAは、独自のDEX、ステーキングプール、アフィリエイトプログラム、パートナープログラム、DAOを備えており、複雑に編み込まれたアーキテクチャの中でも特にユニークな存在です。",
  "data/ph-top/2021/8/energyhawk.json": "EnergyHawkは、衛星画像と予測型AIを用いて、商業施設や産業施設のエネルギープロファイルを推定します。現在、全世界で20万以上の施設をカバーしているEnergyHawkを使うことで、クリーンテック業界の営業チームは、より迅速に見込み客を探し、取引を成立させることができます。",
  "data/ph-top/2021/8/supershots.json": "美しいグラデーションの背景を使って、スクリーンショットを数秒でスーパーショットに変身させます。魅力的なスーパーショットをソーシャルメディアで共有しましょう",
  "data/ph-top/2021/8/eddy-travels-ai-assistant.json": "✈️ 無料のAIトラベルアシスタントをあなたのウェブサイトにインストールして、売上からコミッションを得ましょう！ https://partner.eddytravels.com/",
  "data/ph-top/2021/8/slingshow.json": "Slingshowを使えば、誰でも数分で様々なインタラクティブで魅力的なイベントを作ることができます。以下のことが可能です。会話やアイスブレーカーでコミュニティを構築しましょう🤝 参加者がパネリストに会うことができます。",
  "data/ph-top/2021/8/pixlr-143bc6c0-e2e2-47fa-b23b-3ab77095cc6a.json": "オールインワンの写真編集＆グラフィックデザインプラットフォーム✨ インストール不要＆無料で使用可能✨ スマートなAIツール＆クールなエフェクト✨ 見事なソーシャルメディアテンプレート＆その他多数✨ 数百万のアセットを持つ巨大なクリエイティブライブラリ",
  "data/ph-top/2021/8/spirokit.json": "SpiroKitは、モバイルアプリケーションのためのデザインシステムです。丁寧に作られたコンポーネントとデザイン原則のコレクションが含まれており、アイデアを素早く製品化することができます。また、カスタマイズが容易で、開発経験を重視しています。",
  "data/ph-top/2021/8/direcon-for-twitter-spaces.json": "ディレコンは、クラブハウス＆Spotify Greenroomの分析プラットフォームとして初めて この度、ディレコンがTwitter Spacesにも対応しましたのでお知らせします。",
  "data/ph-top/2021/8/macro-0bcf56a5-02c4-4a1c-9785-d670b5bdcc3e.json": "他の人がZoomに参加していても、MacroでZoomミーティングに参加できます。ミーティングソフトウェアは、今や個人の選択に委ねられています。Macroは、会議のインターフェースをカスタマイズして、自分自身を表現したり、通話に参加していると感じられるまったく新しい方法を提供します。",
  "data/ph-top/2021/8/onebot-2.json": "ここでは、B2Bのバイヤージャーニーを簡素化する会話型コマースを前提としたAIチャットボットツール「OneBot」を紹介します。チャットウィンドウだけでなく、検索やカテゴリーページ、チェックアウトなど、ウェブサイトのさまざまな場所でユーザーと対話することができます。",
  "data/ph-top/2021/8/onboarding-checklist-by-usetiful.json": "ユーザー・オンボーディング・チェックリストは、ユーザー・オンボーディングを改善し、製品の採用率を向上させます。チェックリストは、より多くのユーザーに製品を導入してもらうための、科学的に証明された方法です。   ユーザーは、次のアクションを明確にしながら、自分のペースやスタイルで検討することができます。",
  "data/ph-top/2021/8/sprig-5.json": "Sprig（旧UserLeap）は、製品やユーザージャーニーの中で一口サイズの質問をすることができる、オールインワンの製品リサーチプラットフォームです。ビデオインタビュー、デザインコンセプトのテスト、実際のユーザーを対象としたマイクロサーベイなどを数分で簡単に行うことができます。",
  "data/ph-top/2021/8/startup-fundraising-playbook.json": "The Startup Fundraising Playbook』は、プレシードからシリーズAまでの資金調達を行う創業者を対象に、資金調達のトレンド、バイアス、アーリーステージの資金調達における「やるべきこと」「やってはいけないこと」をまとめたガイドです。",
  "data/ph-top/2021/8/webcrate-2.json": "WebCrateは、ウェブ上のリンクや記事などを一元的に整理、共有することができます。WebCrateはオープンソースで、Deta Spaceのパーソナルクラウドを利用して、簡単にセルフホスティングすることができます。WebCrateは単なるブックマークツールではありません。",
  "data/ph-top/2021/8/orderli.json": "Orderliは注文を簡単に、そして楽しくします。テーブルにあるQRコードをスキャンして、注文したいものをタップするだけで、バーやキッチンに直接注文を送ることができます。",
  "data/ph-top/2021/8/knowledgeos-beta.json": "KnowledgeOSは、あなたのお気に入りのブラウザのための近藤麻理恵です。パワフルな整理整頓とインタラクションで、あなたのブラウザをパワーアップさせます。仕事はより速く、よりスマートに。すべての作業やタブをコンテキストごとに簡単に管理できます。無料で使えて、あなたのデータをデバイスに保存できます。",
  "data/ph-top/2021/8/medis-2.json": "Medis 1が5年経過した後、Medis 2が登場しました。Medisは、美しく、使いやすいRedisのGUI管理アプリケーションです。Redisの専門家によって設計・開発されているので、危機的な状況でも信頼できるものとなっています。",
  "data/ph-top/2021/8/cabana-5-design-system-for-figma.json": "CabanaはFigmaのためのデザインシステムで、UIを素早く作成することができ、デザインのアイデアをより早く提示することができます。",
  "data/ph-top/2021/8/rally-859e8582-bf5a-469c-8dbd-15d1fdbd319f.json": "ラリーは、イーサリアムのブロックチェーンを利用したコミュニティで、クリエイターが活気ある独立した経済を立ち上げることができるオープンネットワークです。",
  "data/ph-top/2021/8/kickass-leads.json": "ベンチャーキャピタルで数百万ドルの資金を調達したばかりの企業1000社のリストを、複数の意思決定者の連絡先とともに毎月お届けします。CSVをエクスポートして、理想的な顧客を見つけ、連絡を取り、6桁の契約を結ぶことができます。9月5日まで50％割引価格でご提供",
  "data/ph-top/2021/8/ultimate-email-guide-for-indie-creators.json": "このガイドに掲載されている戦略は、過去10年間で200万ドル以上の製品を販売するために使用されてきました。このガイドは、私がクリエイターとして、メールマーケティングについて学んだことをまとめたものです。インディーズ/コンテンツ・クリエーター専用です。Eコマースブランド向けではありません。",
  "data/ph-top/2021/8/scrapex-beta.json": "Scrapex.aiがスクレイピングを自動化し、データ抽出の問題を大規模に処理します。お客様がリラックスしている間に、私たちはお客様が求めるデータを求める方法で取得します。",
  "data/ph-top/2021/8/menu-cards.json": "最も簡単で安全かつ実用的な方法で、オンラインQRメニューを動的に管理することができます。お客様にとって、きれいで、簡単で、速い。🦠",
  "data/ph-top/2021/8/research-ai.json": "Research AIは、学生がAIを使ってより明確に、より速くエッセイを書くことを支援するプライベートリサーチアシスタントです。現在、私たちは初期のベータ段階にあり、学生の生産性を高め、問題を解決する方法を考えています。私は、アイデア、フィードバックを評価します...",
  "data/ph-top/2021/8/lumo-2.json": "Lumoを使えば、iPadでリアルな絵が描けます。✏️✍️📈 iPadに紙を貼り付けて、光る線をなぞるだけで、美しいオーディオストーリーに命が吹き込まれます。",
  "data/ph-top/2021/8/direcon-for-twitter-spaces-2.json": "ディレコンは、Clubhouse & Spotify Greenroomの分析プラットフォームとして初めて採用されました。本日、ディレコンがTwitter Spacesにも対応したことをお知らせします。",
  "data/ph-top/2021/8/emphatic-by-connect365.json": "Emphatic by Connect 365は、完全に作成されたソーシャルメディアのコンテンツと自動投稿により、時間を節約し、最高の見込み客の心を掴むことができます。14日間のテストドライブを開始すると、6つのカスタムポストが無料で提供されます。",
  "data/ph-top/2021/8/noteledge-adbe10f0-a32c-4b8b-a572-fe7c45d227ea.json": "NoteLedgeは、クリエーターやデザイナーに最適なノートアプリです。パワフルなクリエイティブツールが搭載されており、PinterestやWebページからアイデアを素早く取り込み、すべてを一箇所にまとめて整理し、スケッチを描いてすぐに自分のデザインを始めることができます。",
  "data/ph-top/2021/8/savvycal-for-icloud.json": "おなじみのSavvyCalミーティングスケジューラーが、iCloudカレンダーに対応しました。",
  "data/ph-top/2021/8/nftport.json": "私たちのシンプルなAPIを使用すると、120秒で何でも無料でNFTに変えることができます。ブロックチェーンの経験は必要ありません。開発者による開発者のためのサービスです。元NATO、Nvidia、Moneseのチームが構築し、Polygon、Skype、Wiseの共同設立者がバックアップしています。",
  "data/ph-top/2021/8/pigeon-for-gmail.json": "Gmailの中に直接組み込まれた強力なCRMとオートメーションのスイートです。他のCRMが営業に特化しているのに対し、Pigeonはメーカーやクリエイターに最適なCRMです。アウトリーチを簡素化します。一度のメールマージではなく、自動フォローアップシーケンスを作成します。",
  "data/ph-top/2021/8/hippobase.json": "マネージドデータベースに過剰なコストをかける必要はない。HippobaseはPostgres、MySQL、MongoDB、Redisなどのオープンソース・ツールを簡単にセルフホストすることができます。",
  "data/ph-top/2021/8/heep.json": "Webflowを使ってWebサイトを制作するデザイナーや、ZapierやAirctableを使ってワークフローを自動化するデータプロを雇うことができます。Heepは、コードレスツールのパワーユーザーがポートフォリオを作成し、助けを求めている顧客とつながることで、その専門性を収益化することを支援します。",
  "data/ph-top/2021/8/mileways.json": "Milewaysでは、関連するすべてのフライト情報をリアルタイムで表示し、重要な更新情報を通知します。お友達やご家族と一緒に最新情報を入手する最も簡単な方法です。",
  "data/ph-top/2021/8/platequery-2.json": "悪質なドライバー、違法駐車、危険な運転を報告したり、ナンバープレートを調べて連絡したりすることができます。私たちは、米国のすべての州の数百万のナンバープレートの記録を持っています。新しい投稿はすべて、複数のソーシャルメディアアカウントに自動的に公開されます。",
  "data/ph-top/2021/8/jikoo-io.json": "チケッティング、コード不要のチャットボット、カスタマイズ可能なCRMを備えたオールインワンのライブチャットソフトウェアで、顧客基盤と収益を拡大します。100% 永久無料! ライブ チャット革命 2.0 に参加する準備はできていますか？",
  "data/ph-top/2021/8/talk-to-kanye.json": "TalkToKanyeは、カニエ・ウェストのように話したり考えたりするAIチャットボットです。ლ(╹◡╹ლ) 芸術、宗教、人生、ゴシップなど、人類史上最高のアーティストと何でも話してみましょう",
  "data/ph-top/2021/8/teleretro.json": "https://www.teleretro.com/ は、チームが楽しく魅力的なアジャイル・レトロスペクティブをオンラインで実行するのに役立ちます。レトロな雰囲気の中でビデオ、音楽、GIFを再生できます。",
  "data/ph-top/2021/8/illustrations-by-iconfinder.json": "ランディングページ、アプリ、プレゼンテーション、ドキュメントに命を吹き込む、高品質なイラストレーションのリソースです。豊富なスタイルパックの中から選べます。ブランドに合わせて色を編集できます。SVGまたはPNG形式でダウンロードできます。価格は、イラスト1点につき5ドルです。",
  "data/ph-top/2021/8/botmother.json": "顧客とのコミュニケーションをパーソナライズして迅速に行う。スマートなチャットボットを使おう コード不要のBotmotherエディタで、チャットボットの開発を簡素化できます。ほぼすべてのロジックを展開し、リアルタイムにカスタマージャーニーをパーソナライズすることができます。",
  "data/ph-top/2021/8/air-for-adobe-premiere-pro.json": "Airの新しいリモートビデオコラボレーションシステムは、チーム全員がPremiere Pro上で同じメディアにアクセスできるようにします。高価なハードドライブを輸送する必要はありません。チームのポストプロダクションワークフローが一元化され、これまで以上に効率的になります。",
  "data/ph-top/2021/8/instagram-for-intercom-by-octopods.json": "Octopods Instagram for Intercomは、最も人気のあるソーシャルネットワークの1つをIntercom Inboxにもたらします。Octopodsは、公式のInstagram Business APIを使用してIntercomとの深い統合を提供しており、IntercomとInstagramの最高の組み合わせを実現しています。",
  "data/ph-top/2021/8/rabbit-habit-tracker.json": "iOS14の強力なウィジェットセットを備えたシンプルな習慣トラッカーで、よりよい自分を築くことができます。アルゴリズムの核となるのは、ポジティブな習慣を形成するには21日、それをライフスタイルに変えるには91日が必要だという考えです。",
  "data/ph-top/2021/8/ramp-2-0.json": "コーポレートカード、経費管理、請求書の支払い、会計、レポートなどをシンプルかつ無料のソリューションに統合し、時間とコストの削減を実現します。Rampを使用している企業は、平均3.3%の経費を削減し、86%早く帳簿をつけることができます。",
  "data/ph-top/2021/8/frost-4-0.json": "Frost 4.0の紹介。ライティングアプリのNetflix。手間をかけずに初稿を仕上げることができます。ベルやホイッスルはありません。あなたとあなたの文章だけです。すべてのデスクトップ/ラップトップのブラウザで無料で利用できます。推奨されるブラウザは以下の通りです。Chrome、Safari。",
  "data/ph-top/2021/8/webtoapp-design.json": "webtoapp.designは、あらゆるウェブサイトをAndroidやiOS用のアプリに変換する、コード不要のソリューションです。ダッシュボードやAPIを使って、ユーザーにプッシュ通知を送ることができます。また、60日間の全額返金保証もご利用いただけます。",
  "data/ph-top/2021/8/genei-de8fd111-cf09-498e-8101-6cb3d2e2f27d.json": "質の高いコンテンツリサーチを数時間ではなく数分で 調査内容を自動的に要約し、記事、ブログ記事、レポートの初稿を簡単に作成することができます。",
  "data/ph-top/2021/8/tesla-for-ios-4-0.json": "- リフレッシュされた車両とエネルギーのホームページ - 簡素化されたSummonエクスペリエンス - 強化されたフォンキーサポート - アプリを開くとすぐに車両にコマンドを送信 - Teslaカタログのショッピング、注文の確認と管理",
  "data/ph-top/2021/8/sync-raise-hand.json": "- ✋ あなたが実際に挙げた手は、Google Meetの挙手ボタンの動作と同期します。- 🔐 すべての処理はブラウザ内で行われます。画像データがサーバーに送信されることはありません。",
  "data/ph-top/2021/8/10x-managers-community.json": "https://10xmanagers.com/ に無料でご登録いただけます。自分自身、従業員、そしてビジネスのためにハイパフォーマンスを求める本物のマネージャーたちのグループです。私たちは、本物の経営者の経験を、あなたが学び、成長するための実用的な洞察力に抽出します。",
  "data/ph-top/2021/8/the-modern-guide-to-sex.json": "セックスコーチのGeorgia Grace (@gspot._)がお届けする、包括的で楽しく、証拠に基づいた素晴らしいセックスの基礎に関するコーチングです。15のビデオエピソードは、性的健康、自信、喜びの解剖学、さまざまなタイプのセックス、リビドー、同意、境界線をカバーしています。",
  "data/ph-top/2021/8/buttons-generator.json": "あなたのプロジェクトで使える100以上のボタン。ボタンをクリックして、CSSをコピーしてください。",
  "data/ph-top/2021/8/shake-crash-reports.json": "アプリのクラッシュをユーザーとの関係構築の機会に変え、悪いレビューを防ぎ、問題を迅速に解決します。パーソナライズされたクラッシュレポートは、データの力を最大限に引き出します。影響を受けたユーザー、スタックトレース、スクリーンレコード、ネットワークログなどを自動的に確認できます。",
  "data/ph-top/2021/8/ocoya-2-0-1.json": "コンテンツマーケティングのためのオールインワンプラットフォームです。🖼️ 10,000以上のテンプレートと1,000,000以上の画像を備えたエディタで、ピカソのように絵を描こう 📊 Travis AIを使って、コンバージョン率の高いマーケティングコピーを生成しよう 📅 お気に入りのソーシャルプラットフォームに直接スケジューリングしよう 今すぐお試しください 👉 ocoya.net",
  "data/ph-top/2021/8/qapop.json": "QApopは、Quoraでのマーケティングキャンペーンの成功をサポートします。今までQuoraを利用したことがなくても、より多くの顧客を獲得し、売上を向上させるための独自のインサイトを発見することができます🚀。",
  "data/ph-top/2021/8/markdownx.json": "MarkdownXは、ヘッダー、リスト、画像、コードブロック、リンク、アニメーションGIF、Youtube Emdeds、Codepen Embedsなどのアイテムをドロップダウンメニューで提供する究極のマークダウンエディタです🚀 エディタはクリーンなMarkdownを出力し、プレビューモードも備えています🍿",
  "data/ph-top/2021/8/reviewr-ai.json": "https://reviewr.ai は、レビューを収集して要約するので、あなたはその必要がありません。Reviewrは最新のNLPを搭載しています。ウィジェットやAPIを使ってあなたのウェブサイトにレビューアを追加し、購入者の信頼を高めましょう。⠀ Reviewrが実際に動いている様子をご覧ください： 🎒 https://baqpa.com 💰 https://dealwyze.com",
  "data/ph-top/2021/8/lumina-4k-webcam.json": "LuminaはAIを使用して環境を理解し、適応することで、いつでも美しい姿を見せてくれます。最高級の4Kセンサーと組み合わせることで、大量の機材や複雑な設定、何千ドルものコストをかけずに、デジタル一眼レフのような写真を撮ることができます。",
  "data/ph-top/2021/8/rasterizer-io.json": "あなたのオンラインプロフィールのデータを利用したイメージジェネレーターです。あなたがデザインした画像で、購読者数をアピールしてみませんか？",
  "data/ph-top/2021/8/union54.json": "Union54は、アフリカ向けのデビットカード発行APIです。あらゆるソフトウェア会社が、銀行のパートナーや「クレジットカード・プロセッサー」を必要とせずに、顧客にデビットカードを提供することができます。アフリカ向けのMarqeta。",
  "data/ph-top/2021/8/careerist.json": "Careeristでは、技術者としてのキャリアを迅速にスタートさせることができます: 👩💻 高給の技術職のための実践的なトレーニング 🔎 求人情報に自動的に応募する 🏋️ ♀️ インターンシップで経験を積む 👨🏫 1:1のメンターと一緒に面接の準備をする",
  "data/ph-top/2021/8/dispatch-346ebcf1-712d-43be-b2d6-bc3a8cffcba6.json": "人々は常にサーバー固有のP2PやDiscordでのグループDMを望んでいました。この1つの機能が、人々をDiscordから遠ざけ、Slackに落ち着かせる破格の要因となっています。私たちはそれを変えるためにここにいます。個人サーバーにSlackのようなP2P、グループDMを追加します。",
  "data/ph-top/2021/8/smooth-talker.json": "ナレーションビデオを際立たせる：1.自動無音化 2. 数秒で魅力的なビデオを作る 3. どんなビデオにも対応 Smooth Talkerは、数秒でテンポの良いビデオを作るための自動編集をしてくれるアプリです。",
  "data/ph-top/2021/8/remote-company-finder.json": "リモートカンパニーファインダーでは、他のチームメンバーと同期して仕事ができるリモートチームを探すことができます。所在地を入力すると、あなたのタイムゾーンに最も多くの拠点を持つリモート企業が表示されます。",
  "data/ph-top/2021/8/noizable.json": "人間のノイズを含む100以上のオーディオファイルをダウンロードできます。プライベートや商業プロジェクトに自由にお使いいただけます。ウーッ」、「チンドン」、「ヤッ」などの音を手に入れましょう。",
  "data/ph-top/2021/8/meta-journal.json": "2021年の最大の成果は何ですか？日々の小さな勝利に気付き、達成日記を始めましょう。勢いをつけて、日々の進歩に目を向けることで、モチベーションを高め、自分に責任を持たせることができます。",
  "data/ph-top/2021/8/twittr-gems.json": "Twittr Gemsは、25以上のカテゴリーに分かれた50人以上のお気に入りのクリエイターによる最高のTwitterスレッドを、最も簡単な方法で見つけ、発見し、読むことができます。",
  "data/ph-top/2021/8/vehicle-listings-api.json": "このVehicle Listings APIを使えば、アプリやWebサイトで自動車関連のオンライン・コマース体験を簡単に実現できます。年式、メーカー、モデル、トリム、オプション、特徴、ロケーションなどの条件で車両を検索できます。https://auto.dev から車両の詳細と写真にアクセスできます。",
  "data/ph-top/2021/8/voicera-c056191a-efde-496e-a562-ace0f5f50bb3.json": "Voiceraを使えば、ブロガーやコンテンツライターは、ブログの内容に直接、臨場感あふれる音声ディクテーションを埋め込むことができます。それもワンクリックで。忙しい読者に、対話型のブログで語りかけることができ、リテンションを高めることができるのです。",
  "data/ph-top/2021/8/bebe.json": "ぴったりの赤ちゃんの名前を見つけよう マッチング機能を使って、自分と相手の好きな名前を確認することができます💜 30,000以上の名前が世界中から集められています💜 アカウントは必要ありません",
  "data/ph-top/2021/8/beyond-mars-art.json": "珍しいデジタルアートのマーケットプレイス。あなたのInstagramプロフィールの画像/動画を、beyond mars artで直接NFTとして販売します。使い方は簡単です。造幣局のコストはゼロ。",
  "data/ph-top/2021/8/dune-analytics.json": "暗号分析の検討、作成、共有 📈 数百のプロジェクトに対応した数千のダッシュボード 📊 DeFi、NFTなどの主要な指標を追う 👨💻 SQLを使って人間が読めるデータを照会する",
  "data/ph-top/2021/8/auxpad-notes.json": "AUXPADは、講義を受けている学生、会議中の専門家、インタビューを受けているジャーナリストなど、話した言葉を文字にする必要がある場合にはどこでも必須のアイテムです。👉 今すぐ無料でお試しください！ https://auxpad.com",
  "data/ph-top/2021/8/altafin.json": "AltaFinは、AltaFin Tokenを利用して、世界初の高APYの持続可能な暗号通貨貯蓄プラットフォームを立ち上げるというミッションを掲げています。あなたの暗号に最大22%のAPYを獲得しましょう。",
  "data/ph-top/2021/8/geniemoji.json": "Geniemojiは、デスクトップでの絵文字の使い方をこれまで以上にシンプルにするアプリです。このアプリの目的は、あなたのコマンドに基づいて最も適切な絵文字を提供することです。Geniemojiは、アプリを起動するとメニューバーに表示されます。Control + Eで呼び出すことができます。",
  "data/ph-top/2021/8/who-s-most-app.json": "ダウンロード無料! 何百もの質問から、二人がどれだけお互いのことを知っているかをテストする「Who's Most Likely」をプレイ! 質問は普通のものから、ロマンチックなもの、ちょっとおかしなものまで様々です。友達や家族、大切な人と一緒に遊んでみてください。",
  "data/ph-top/2021/8/crypto-backers.json": "﻿トップ9（公益性に基づく）のコインを閲覧し、暗号の未来をより早く世界の玄関口に届けるために、さらに努力するセレブたちを見つけてください。",
  "data/ph-top/2021/8/uideck-2-0.json": "フリーおよびプレミアムHTMLランディングページテンプレートとUIキット - Bootstrap、Tailwind CSS、Reactで構築されています。あなたのスタートアップのための完全なウェブサイトとランディングページを、美しいデザインで、スクラッチからコーディングせずに作成して発表しましょう。",
  "data/ph-top/2021/8/cvshine.json": "プロの意見を参考にして素敵な履歴書を作成し、新しい仕事のチャンスを掴みましょう。",
  "data/ph-top/2021/8/hey-design-systems.json": "デザインシステムの導入を検討しているが、どこから手をつけてよいかわからない。また、最新の技術を学ぶ必要がありますか？ここでは、デザインシステムに関するあらゆることをご紹介します。",
  "data/ph-top/2021/8/styler.json": "Stylerは、あなたのhashnodeブログを強化するために開発された、次世代のカスタムCSSビルダーです。ライブプレビュー、ダークモードサポート、ブレイクポイントサポート、テンプレートなど、あなたのブログを際立たせる素晴らしい機能を備えています。",
  "data/ph-top/2021/8/webden.json": "WebDenは、オープンソースのモバイル/タブレットフレンドリーなコードプレイグラウンドです。完全にクライアントサイドのアプリなので、プログレッシブウェブアプリ（PWA）として端末にインストールし、オフラインで使用することができます。",
  "data/ph-top/2021/8/pledre.json": "物理的な学校は管理コストが高く、非常に非効率的で、しかも時代遅れです。Pledreでは、数分でバーチャル・スクールを立ち上げ、州や国を越えて何百万人もの生徒にアクセスすることができます。",
  "data/ph-top/2021/8/common-surface-2.json": "Common Surfaceは、効果的で柔軟なハイブリッド・ワークカルチャーを構築するための複雑な作業をすべて処理する強力なハイブリッド・ワーキング・プラットフォームであり、従来の方法でそれを行おうとした場合に生じるフラストレーション、困難、対立からあなたを救います。",
  "data/ph-top/2021/8/featurebase.json": "Featurebaseは、顧客が製品に対してどのようなアイデアや問題を抱えているかを理解するのに役立ち、その結果、スタートアップを正しい方向に導くことができるのです。顧客からのフィードバック、バグレポート、機能要望などをすべて公開の掲示板に取り込むことができます。",
  "data/ph-top/2021/8/ayo-e924c48f-e8ac-417d-a179-eff0599cd169.json": "リンクを記録して共有するためのもう一つの方法（ひねりを加えたもの）。今のうちに希望のユーザー名をゲットしておきましょう :) 近日公開予定：リンクの短縮化と複数ページの管理。",
  "data/ph-top/2021/8/sentiful.json": "Sentifulは、ほとんどの物に隠れたメッセージを加えることができる拡張現実アプリです。テキスト、画像、動画などを追加して、プレゼントを個性的に演出することができます。",
  "data/ph-top/2021/8/storytale-2.json": "大きなイラスト市場が改善され、大きくなった。あなたのウェブサイト、プレゼンテーション、アプリのための高品質なシーンを一度に見つけることができます。本日は、月々13ドルでStorytaleのみに参加できます。",
  "data/ph-top/2021/8/swordfish.json": "セールスがリードを探すのにうんざりしていませんか？候補者の採用に時間がかかりすぎていませんか？次の見込み客や候補者を記録的な速さで見つけることができます。数秒で直接連絡先情報を得ることができます。携帯電話番号、個人およびビジネスメール、ソーシャルプロフィールなど。",
  "data/ph-top/2021/8/blurry.json": "ワンクリックですべての機密情報を隠すことができます。ポストビデオ編集の手間を省くことができます。",
  "data/ph-top/2021/8/microns.json": "Microns.ioは、販売中の最高のマイクロスタートアップを発見するためのニュースレターです。他の何百人もの起業家、投資家、インディーハッカーと一緒に、次の買収機会を探しましょう。",
  "data/ph-top/2021/8/yofte-e-commerce-ui-kit.json": "Yofteは、優れたコンバージョン率の高いEコマースサイトを作成するためのテンプレートです。https://shuffle.dev/marketplace/tailwind-ecommerce?ref=producthunt",
  "data/ph-top/2021/8/crypto-companies.json": "私たちの無料公開ディレクトリをチェックしてください。500社以上の企業を、業種やドメインごとに分類して探せます。暗号の世界をナビゲートするのに役立つように設計されています。",
  "data/ph-top/2021/8/mosaic-10.json": "見たこともないようなワークスペースの整理整頓！？シンプルさを犠牲にすることなく、ウィンドウを整理し、ワークスペースを最大限に活用しましょう! 🤩🖥 今すぐ、無料でお試しください！ https://mosaic.rcopstein.com/",
  "data/ph-top/2021/8/supportbell.json": "🔔 SlackでIntercom Conversation Ratingsの通知を受ける ⏩ サポートに不満のあるお客様にすぐに対応する。💬Slackでサポートチームのコラボレーションが可能になります。",
  "data/ph-top/2021/8/note-garden.json": "Hey Hunters 👋 Here is NOTE GARDEN! 連絡方法 E-Mail: learnobit@gmail.com Discord: https://discord.com/invite/WYkPZBQeNu Instagram: https://www.instagram.com/note_garden/ twitter: https://twitter.com/home Reddit: https://www.reddit.com/r/notegarden/",
  "data/ph-top/2021/8/smalldevtools.json": "https://Smalldev.tools には、エンコード/デコード、最小化、ダミーデータセットのテストなど、開発者がよく行う作業を支援する20以上のツールが用意されています。",
  "data/ph-top/2021/8/uservitals.json": "数秒でどこからでもフィードバックを収集し、ブランド化されたカスタマーポータルでロードマップを計画し、製品のアップデートを発表します。UserVitalsは、ユーザーフレンドリーで手頃な価格の製品でありながら、優れた製品を作ることができます。",
  "data/ph-top/2021/8/1upblitz.json": "1UpBlitzはblitzjsで構築されたSaaSスターターで、60時間以上の作業を省くことができます。🤑 複数のプランの作成 💸 プランのアップグレードとダウングレード 🔐 チームとメンバー 🔐 認証 💪 エンドツーエンドでテスト済み 👉 コピーを入手するには: https://1upblitz.com",
  "data/ph-top/2021/8/computer-engineering-for-babies.json": "Computer Engineering for Babies（赤ちゃんのためのコンピュータ工学）」は、コンピュータがどのような素材でできているかを、赤ちゃんが興味を持って学べるように作られたシンプルなボードブックです。CE150をスキップしてしまった人や、最初の2、3日を見逃してしまった人は、この本で追いつくことができるでしょう。",
  "data/ph-top/2021/8/digitalpress.json": "自分のGhostブログでブログ記事を作成し、公開することができます。あなたのドメインでブログを立ち上げ、数秒で簡単にコンテンツを公開できます。",
  "data/ph-top/2021/8/dime-2.json": "Dimeは、あなたのコンテンツをユニークなデジタルコレクティブルにする最も簡単な方法です。あなたのコレクションを購入、取引、展示することができ、そのプロセスは迅速かつ驚くほど簡単です。これは、NFTマーケットプレイスのすべての利点であり、参入の障壁を取り除いたものです。",
  "data/ph-top/2021/8/badaso.json": "BadasoはAPIとプラットフォームを構築する会社で、\"low code development platform \"や \"lcpd \"とも呼ばれています。Badasoは開発者がアプリケーションを10倍の速さで構築することをサポートします。また、Badasoはオープンソースであり、100%無料であることも重要です。",
  "data/ph-top/2021/8/minikey.json": "MiniKeyは、二要素認証用の最もシンプルなワンタイムパスワードジェネレータです。MiniKeyはメニューバーに表示され、生成されたコードをワンクリックでコピーしたり、MiniKeyから認証アプリにコードをドラッグしたりすることができます。",
  "data/ph-top/2021/8/zenland-ar-2.json": "Zenlandは、仏教に由来する禅、オットーの世界を再現したARベースのアプリで、よりバランスのとれた穏やかな生活を送るために、チャクラやエネルギーセンターを活性化させる瞑想活動に役立ちます",
  "data/ph-top/2021/8/guidedoc-2-0-2.json": "GuideDocは、世界中の優れた映画祭で受賞した1200本以上の作品を配信するストリーミング・ドキュメンタリー映画プラットフォームです。全収益の50%がプロデューサーや監督に直接還元されるため、彼らは良いドキュメンタリー映画を作り続けることができます。",
  "data/ph-top/2021/8/multiverse.json": "ユーザーが3Dアバターとしてフリーローミングで登場し、ライブボイスで対話するイマーシブユニバースのコレクションです。Universesは、世界中のクリエイティブなアーティストによって運営されているソーシャルコミュニティです。アーティストは、創作、共有、パフォーマンス、ライブ放送を世界中のオーディエンスに向けて行います。",
  "data/ph-top/2021/8/stately-viz.json": "Stately Vizは、XStateで作成されたステートマシンやステートチャートをリアルタイムで可視化、シミュレーション、検査します。",
  "data/ph-top/2021/8/laconic.json": "Laconicは、紙の本の引用文をスキャンして（100以上の言語で動作）、自分の本の要約を整理する、本好きのためのアプリです。無制限のスキャンとメモは無料で、追加のテキストフォーマットやタグは有料で利用できます。",
  "data/ph-top/2021/8/commont.json": "Commontは、あなたのウェブサイトにコメント欄を簡単に追加することができます。🎃 Headless - 自分でUIを書きます。広告は含まれていません。⚙️ 管理画面 - プロジェクトやコメントを管理できます。🎉 趣味での利用は無料 - 必要に応じてスケールアップできます。",
  "data/ph-top/2021/8/smart-ads-by-unbounce.json": "AIでデジタル広告の効果を高める。Smart Adsは、15億件以上のコンバージョンと7万人以上の顧客から得られたUnbounceのAIによるデータを利用して、よりパフォーマンスの高いデジタル広告を瞬時に生成し、マーケティング費用の最適化とコンバージョンの増加を実現します。",
  "data/ph-top/2021/8/icon-horse.json": "モバイルでもデスクトップでも、ウェブで製品を作るときには、ファビコン（ウェブサイトのロゴ）が必要になることがよくあります。Icon Horseはそのようなニーズから生まれました。任意のWebサイトのシンプルなURLをアプリに埋め込むことができます。また、アイコンが見つからない場合は、予備のアイコンが用意されています。",
  "data/ph-top/2021/8/hightouch-audiences.json": "オーディエンスは、誰でもSQLの力を利用できるようにします。1. データベース、データウェアハウス、スプレッドシートなど、あらゆるデータソースに接続 2. 3.Google Sheets、Slack、CRM、メール、広告ツールなど、60以上のツールにデータを送信できます。",
  "data/ph-top/2021/8/bits-2-0-by-creative-tim.json": "Bits 2.0 by Creative Tim は、反復的なコードを入力するのを避けるためのコードスニペットの素晴らしいライブラリです。テーマを丸ごとダウンロードする必要はありません ✅ Bootstrap snippets ✅ Tailwind CSS snippets 無料でお試しください。",
  "data/ph-top/2021/8/pixelied.json": "Pixeliedは、起業家や中小企業の経営者が数回のクリックで魅力的なデザインを作成できる、使いやすいオンラインデザインスイートです。",
  "data/ph-top/2021/8/noteli.json": "Noteliは、メモを取るために作られたオープンソースのCLIツールです。Noteliは、TypeScriptのパワーとAuth0のセキュリティ、そしてMongoDBを使って作られています。Noteliは、開発者がGUIで時間を浪費することなく、シェルから素早くメモを取るのに役立ちます :P",
  "data/ph-top/2021/8/bootstrappers-2.json": "スタートアップのための出版物です。",
  "data/ph-top/2021/8/warmer-ai.json": "Warmer.aiは、見込み客のLinkedinプロフィールやウェブサイトに基づいて、高度にパーソナライズされたメールを作成します。1回限りのメール作成や、CSVファイルを使った一括作成も可能です。",
  "data/ph-top/2021/8/oka-todo.json": "現在のストアにある「Todo」アプリは、あなたにとって少し複雑だと感じていますか？Oka Todoは、タスク管理をとても簡単でシンプルにする新しいTodoリストアプリです。- 画面側での表示／非表示 - タスクアイテムの折りたたみ／折りたたみ解除 - カラフルなグループ設定",
  "data/ph-top/2021/8/my-crypto-profile.json": "My Crypto Profileは、NFTのコレクションをTwitterで表示することができるブラウザ拡張機能です。- TwitterであなたのNFTをShillしたり、NFTアーティストを発見することができます - EthereumアドレスとTwitterアカウントを安全に接続します。",
  "data/ph-top/2021/8/wellpaper.json": "WellPaperは、ロック画面にスクリーンタイムとスマートフォンの使用状況を表示するダイナミックな壁紙です。スマートフォンの使用率が高まる中、自分の使用状況を把握する必要性はかつてないほど高まっています。",
  "data/ph-top/2021/8/walden-directory.json": "Walden Directoryは、様々な専門分野の高品質なコーチのコミュニティです。あなたにぴったりのコーチを見つけて、ディスカバリーコールを設定したり、メッセージを送って詳細を確認してください。",
  "data/ph-top/2021/8/lasershow-video.json": "動画はオーディエンスのエンゲージメントを高めます。LaserShowは、ビデオのアイデアと制作を自動化します。あなたのメッセージを動画で増幅することが、これまで以上に簡単になります。- あなたのブランディング、ニッチ、トピック、コンテンツ - 拡張されたAIがソーシャルメディアスタイルの動画をあなたの受信箱に届けます。",
  "data/ph-top/2021/8/sticker-doodle.json": "Sticker Doodleは、オリジナルのステッカーを作成して、iMessageで誰かに送ることができるアプリです。タップするだけで、あなたの最高のフィンガーペインティングを送ることができます。iPadをお持ちですか？Apple Pencilを使って、ステッカー・ドゥードゥルを本格的に作ってみましょう。",
  "data/ph-top/2021/8/workpatterns-for-zoom-apps.json": "Zoomを使った1:1ミーティングやチームミーティングで、マネジメントをさらに向上させることができます。アジェンダに基づいてコラボレーションを行い、WorkPatterns for Zoomがミーティングでの経験を導きます。決定事項、次のステップ、オーナーシップをZoomから離れることなく文書化することで、整合性を保つことができます。",
  "data/ph-top/2021/8/legiit-leads.json": "Legiit Leadsは、サービスベースのビジネスや代理店のための、究極のリードジェネレーションとフルフィルメントです。あなたの所在地とニッチな分野を入力するだけで、Legiit Leadsは数秒のうちにあなたのためにリードを見つけ、仕事を遂行する人を見つけます。",
  "data/ph-top/2021/8/grain-by-moment.json": "プロ仕様のビデオプリセットを数分で作成...すべてはiPhoneとiPadで。写真を編集するのと同じように、質感、色、粒状感、光の漏れ、境界線、オーバーレイなどを指で操作していくだけです。インポート、作成、エクスポートは、お気に入りの編集アプリケーションにすぐに戻すことができます。"
}