{
  "data/ph-top/2022/4/uizard-hat-1-0.json": "デザインモックアップを直接作成することができます。Uizard Hat 1.0を装着し、製品を視覚化すれば、アイデアから完全にインタラクティブなプロトタイプまでが完成します。真のデザイン思考のパワーを解き放ちましょう。🧙",
  "data/ph-top/2022/4/bookable-schedule-by-boomerang.json": "受信トレイにミーティングスケジュールを表示 - あなたとゲストのために 🧙♂️ Magic Live Calendar はリアルタイムで更新、ダブルブッキングなし、どこでも使える 📅 ゲストは自分のカレンダーを重ねられる ⚡ 予約が 23% 増加 🤝 思いやりあるミーティングのスケジュール方法",
  "data/ph-top/2022/4/greetpool.json": "あいさつは、みんなでするのがいい。友人や家族、同僚と楽しく🥳魅力的な✨グループカードを作り、お祝いをより思い出深いものにしましょう💛。",
  "data/ph-top/2022/4/shipyy.json": "Shipyyは、開発者やエンジニアが、既存のSQLクエリ、Python/JSスクリプト、Rest APIエンドポイントを使って、ビジネス、プロダクト、オペレーション、その他のチーム向けの社内ツールを（5分で）構築できるよう支援します。監査ログ、役割と権限を使用して、本番データベースを安全に確保する。",
  "data/ph-top/2022/4/unicorn-warrior.json": "創業者とマーケターが愛するチートシート ✅ 100以上のバイラルマーケティング戦略とフレームワーク（消化しやすい） ✅ 150以上のバイラルマーケティング事例（最大のバイラルマーケティング事例ライブラリ） ✅ 150以上の認知バイアスで顧客に影響力を与える",
  "data/ph-top/2022/4/product-discovery-3.json": "次の勝てる商品、サービス、機能を発見してください。このノティオン・スペースでは、顧客、ユーザー、従業員の声をもとに、アイデアの発想、スクリーニング、リサーチを3段階のシステムで行っています。",
  "data/ph-top/2022/4/hide-the-pain-harold-s-april-prank.json": "エイプリルフールに友人や同僚に最も有名なミームを使ったパーソナライズド・ビデオを作成しましょう。Colossyanの技術により、ハロルドは何千人もの人々にリーチし、個人的ないたずらを提供することができます。",
  "data/ph-top/2022/4/clovercities.json": "今のホームページはどれも同じに見えてしまう。私たちは、Web 1.0ホームページのための初のノーコードソリューションで、初期のWebの創造性を取り戻します。AIが生成したコンテンツ、ドラッグ＆ドロップのインターフェース、特殊効果、スマートウィジェット。そう、本当に動くんです",
  "data/ph-top/2022/4/vocally-2.json": "Amazon、Google、IBM、Microsoftといった世界有数のクラウドプロバイダーから、リアルで高品質な音声合成を実現します。テキストを550以上の音声で自然な響きの音声に瞬時に変換し、MP3オーディオファイルとしてダウンロードできます。",
  "data/ph-top/2022/4/notion-pack-for-coda.json": "パックでできること 📊 Notionのデータベースをワードクラウドやチャートとして可視化することができます。📧 Notionの値が変わると、オートメーションでSlackメッセージを送信します。🔄 アクションとPacksを使った2ウェイ同期で、Notionのアイコンやカバー、ページのプロパティを更新できます",
  "data/ph-top/2022/4/inside-com-d6efe3a7-cdd2-4436-9311-671f0067186c.json": "毎月25万人以上に届く素晴らしいニュースレターのコンテンツを、Reddit、Twitter、LinkedInに似たソーシャル・ネットワーキング・サイトに落とし込みました。",
  "data/ph-top/2022/4/background-remover-by-flexclip.json": "FlexClipの自動・正確・瞬時の背景リムーバーツール! 任意の画像をアップロードするだけで、あとはスマートAIが5秒で自動処理します。- 1クリックで簡単操作 - 画像の種類は問いません - 100％オンラインで自動処理 - 無料ですぐにダウンロードできます。",
  "data/ph-top/2022/4/breaking-bad-intro-creator.json": "Breaking Bad Intro Creatorは、カスタマイズされたオープニングを好きなテキストでカスタマイズし、画像やビデオとしてダウンロードすることができます。テキストに割り当てるべき化学元素を自動的に見つけます。あなたの名前と一緒にチェックしてください",
  "data/ph-top/2022/4/shamebot-by-wfhomie-1.json": "https://app.wfhomie.com/shame/、Slack上で同僚を公に貶めるには最適な方法です。あまり好かれていないチームメイトがミスをしたり、つまらない質問をしたり、下品なコメントをしたときは、ShameBotを使うのが一番簡単な方法で、相手の自尊心を疑わせることができます。",
  "data/ph-top/2022/4/seshhub.json": "Seshubは、あなたのスキルをネットショップにするお手伝いをします。1対1やグループでのミーティング、またPDFのダウンロード販売やプレゼントも可能です。Seshhubの最小限のインターフェースには、支払い処理、スケジュール設定、ビデオ会議、管理などが含まれています。"
}