{
  "data/ph-top/2022/1/token-around.json": "インテリジェント きびきびしている。素早く。暗号｜メタバース｜NFT｜DeFi インターネット、暗号のトレンド、ソーシャルメディアの活動をアルゴリズムで分析し、世界の暗号コミュニティから100以上のパブリッシャーから20分ごとにクイックサマリーをすぐにお届けしています。",
  "data/ph-top/2022/1/dialo-2.json": "QRコードやショートリンクで簡単にデジタル名刺をデザインし、共有することができます。連絡先アプリに直接、他の人の名刺を追加できます。",
  "data/ph-top/2022/1/tin.json": "Tinは、手動で環境を設定することなく、瞬時に実行可能なアプリケーションを生成できるTeamCodeの製品です。",
  "data/ph-top/2022/1/continuum.json": "クリエイターによるソーシャルプラットフォーム「Continuum（コンティニュアム）」をご紹介します。",
  "data/ph-top/2022/1/pika-2.json": "https://pika.rishimohan.me 無料・http://github.com/rishimohan/pika スクリーンショットを素早く美化するウェブアプリです。背景グラデーションの追加、影の調整、角丸の追加、間隔の調整などができます。PNGファイルとして保存したり、クリップボードにコピーすることができます。",
  "data/ph-top/2022/1/snappify.json": "snappifyは、美しいコードスニペットを簡単に作成・調整することができる優れたツールです。スナップショットにはあらかじめスタイルが定義されていますが、カスタマイズも可能です。",
  "data/ph-top/2022/1/harold-2-0.json": "もう、googleスプレッドシートやNotionのテンプレートを一度更新したら、二度と見ることはありません。ハロルドは、AIを搭載した一風変わったSMSボットで、あなたの習慣をトラッキングします：シンプル👊便利🙌＆楽しい🤓。",
  "data/ph-top/2022/1/sherpa-travel-restrictions.json": "シェルパは、正しい旅行書類を入手し、最新の旅行条件を理解するためのガイドです。独立した情報源であり、いかなる政府機関の後援、提携、資金提供を受けているわけではありません。",
  "data/ph-top/2022/1/menubarx.json": "https://menubarx.app/ は、アプリのように任意のウェブページをメニューバーに固定できる、強力な Mac メニューバーブラウザです。頻繁に訪れるウェブサイトのページや、ネイティブアプリがないウェブサイトでも、MenubarXはユーザーがより効率的かつ便利に使用できるようにします!",
  "data/ph-top/2022/1/open-target.json": "誰もが新しい年に向けて何らかの目標や期待を持っていますが、それを達成するために自分のモチベーションを維持するのは簡単なことではありません。体重を減らすこと、ブログ記事を公開すること、パッシブ収入を得ること、あるいは別のこと。オープン・ターゲットは、自分のモチベーションを維持するための方法なのです",
  "data/ph-top/2022/1/not-boring-habits.json": "学習習慣の行動科学と楽しくて美しいゲームを組み合わせることで、習慣を追跡するだけでなく、習慣を*構築することができます。毎日、ポジティブな習慣をマスターしたり、悪い習慣を退治するための不思議な旅の一歩を踏み出すことができます。",
  "data/ph-top/2022/1/pauseme-button.json": "Zoom通話中にワンクリックでビデオやオーディオをオン・オフできるBluetooth® Video and Microphone Controller（VMC）ボタン。",
  "data/ph-top/2022/1/accountit-2-0.json": "Accountitへようこそ。シンプルでありながら強力な日々の取引追跡ツールで、間違いなくあなたの財務の全体像を把握するのに役立ちます。Accountitを使えば、すべての取引の追跡と整理が可能なほど楽になります。",
  "data/ph-top/2022/1/value-app.json": "NFTのポートフォリオの価値をリアルタイムに把握するシンプルな方法です。",
  "data/ph-top/2022/1/qr-code-generator-99406f64-9c12-425a-9d40-c3b8d0f18cac.json": "QRコードジェネレータは、アプリのインストール、フィードバックの収集、ウェブサイトのプロモーション、Eメールの収集などを支援する、パワフルでシンプルなオールインワンのQRコードジェネレータです！QRコードジェネレータは、アプリのインストールを促進し、フィードバックの収集、ウェブサイトのプロモーション、Eメールの収集などを支援します。",
  "data/ph-top/2022/1/huski-ai.json": "eコマース領域で使用される商標、意匠、NFTなどの著作権コンテンツの使用状況をAIで検索するコンテンツ検索エンジン。ベータ版では、商標権のみを対象としています。",
  "data/ph-top/2022/1/vanillalist.json": "開発者の時間を節約し、高性能なWebアプリケーションを作成するための厳選された最高のバニラJavaScriptプラグインとリソースのリポジトリです。",
  "data/ph-top/2022/1/appmaker.json": "Appmakerは、Shopifyストアをモバイルアプリに変換するノーコードアプリビルダーです。ドラッグ＆ドロップ式のアプリビルダーを使用することで、ストアオーナーはネイティブアプリを簡単に作成し、Appstore/Playstoreにアップロードできるようになりました。AppmakerをあなたのShopifyストアに追加して試してみてください。",
  "data/ph-top/2022/1/tweet100-challenge.json": "#ツイート100は、Twitterでより多くの情報を発信するための100日間の無料チャレンジです。🛠 完全にノーコードで作られています 🤝 1日に最低1回は良いツイートができるようになります 📈 フォローが4000%も増えた人もいます! 🤯 無料で参加するか、コミュニティに参加してください。🚀",
  "data/ph-top/2022/1/life-tracker.json": "人生は貴重であり、あなたの時間も貴重です。あなたの活動を記録したデジタルジャーナルをポケットに忍ばせてください。ライフバランスを整え、集中力と生産性を高めましょう。",
  "data/ph-top/2022/1/interviewkit.json": "InterviewKitは、最大80%の時間短縮を可能にするオールインワン面接ツールです。このアプリは、面接にかかる時間を下げることで、より多くの人に面接をしてもらうための取り組みです。だから、より顧客志向の製品を作り、少しでも良い世界を作るのです❤️。",
  "data/ph-top/2022/1/relingo.json": "Relingoは、あなたが興味を持っていることに基づいて、英語の記事を読んだり、英語のビデオを見たりすることを支援します。",
  "data/ph-top/2022/1/web3jobsboard.json": "ブロックチェーン、暗号、スマートコントラクトのスタートアップから、Web3パラダイムの一端を担うことを望む大手企業まで、Web3分野の求人情報を提供します。",
  "data/ph-top/2022/1/glitch-editor-2022.json": "Glitchのエディターが過去最大のアップデートで最大300%高速化。アセット用の自動Fastly CDN、3Dモデルのプレビュー、インラインエラー報告、Prettierサポートの向上、GitHubインポート/エクスポート+ドメインへのワンクリックでのアクセスを提供します。",
  "data/ph-top/2022/1/kara-pure.json": "史上初、空気から水を作る機械。そして、pH9.2以上のアルカリ性に変える。7種類の希少な天然ミネラルで、水を豊かにする。そして、強力なUV-Cライトで連続的にろ過し、浄化します。毎日10リットルのきれいで安全な水をお届けします。",
  "data/ph-top/2022/1/300-web3-predictions-for-2022.json": "先週、何千人もの人が2022年のWeb3の予測を投稿しました。NFT、DAO、DeFi、P2E、BTC、ETH、L1s、L2sなど、先取りするためのTwitterスレッド上位50を紹介します。",
  "data/ph-top/2022/1/obsidian-flight-school.json": "オブシディアンフライトスクールは、教育製品であり、スターターキットです。オブシディアンという次世代ノートアプリをより速く、より上手に、そしてより自信を持って使えるようにするためのものです。⚡️ かつてないほど速くノートを飛び回れる...思考のスピードで",
  "data/ph-top/2022/1/unlock-7.json": "課金や物流から解放され、パッケージング、バージョン管理、顧客への製品配布からソフトウェアの構築に専念できるようになります。",
  "data/ph-top/2022/1/inboxthis.json": "今日、ウェブページや記事を保存して後で読むには、ブックマークを作成するか、新しいアプリ（例：Pocket）を使用するか、手動で自分にメールを送る必要があり、それは苦痛です😰！しかし、このアプリを使用することで、私たちは、ウェブページや記事を保存して、後で読むことができるようになります。InboxThisを使えば、どんな記事/ウェブページでも1クリックでメールの受信トレイに送ることができます👆。",
  "data/ph-top/2022/1/nft-inator.json": "NFT-Inatorは、手続き的に生成されたNFTプロジェクトの設計と開発を加速させる無償のツールキットです。カスタムデザイン、ランダムデザインの作成、レイヤーの組み合わせのテスト、Solana、Ethereum、Polygon用の画像とメタデータのエクスポートが可能です。",
  "data/ph-top/2022/1/jini-design.json": "デジタル資産のディレクトリにとどまらず、私の近刊「Frontend Schema」で紹介する新しい技術的プロセスを学ぶための試みでもあります。ロードマップはこちら: https://jini.design/?open=roadmap",
  "data/ph-top/2022/1/promoly.json": "Promolyは、クリエーターがオーディオコンテンツをメールやソーシャルメディアに配信するのを支援します。ストリーミング可能なリンク（Soundcloudなど）1つで、オーディオコンテンツをメールリストやソーシャルネットワークに配信するための魅力的なランディングページに変えることができます。",
  "data/ph-top/2022/1/non-nfts.json": "nonNFTsは、オープンソースのAI生成アートワークです。このプロジェクトの背景にあるのは、NFTの実態というよりも、むしろデザイントレンドとしてのNFTの誇大広告である。すべてオープンソースなので、すべてのアートを無料でダウンロードすることができます。",
  "data/ph-top/2022/1/travel-friends.json": "トラベルフレンズは、新しい土地に到着したときに、他の旅行者とつながるためのシンプルなウェブサイトです。地図にピンを追加し、近くにつながる他の旅行者がいるかどうかを探ります。",
  "data/ph-top/2022/1/salescamp-3.json": "Salescampは、セールスサイクルの各ステージで成長を促進するために、カスタマイズ可能なセールススイートです。すべての営業活動を一元管理し、ビジネスにとってより良い顧客を特定することができます。",
  "data/ph-top/2022/1/pollinate.json": "Revueから送信しなくても、Twitterの埋め込みサインアップ機能を使ってメルマガを育てることができるようになりました。beehiiv、Mailchimp、MailerLite、ConvertKit、Ghostと互換性があります。",
  "data/ph-top/2022/1/plask-2.json": "Plaskを使えば、ウェブカメラとブラウザがあれば、誰でもすぐに自分の動きをデジタル化してアニメーション化することができます。",
  "data/ph-top/2022/1/startup-recipes.json": "リーンスタートアップを学ぶのは簡単、実践するのは難しい! スタートアップレシピは、アイデア段階の起業家が最小実行可能製品を正しく構築することによって、できるだけ早く製品と市場の適合性を見つけるのを助けるチートシートです!",
  "data/ph-top/2022/1/ignition-gtm-beta.json": "Ignitionは、PMMとPMチームがより効果的に立ち上げ、プランニングにかかる時間を短縮し、社内の連携を強化することを支援します。ベストプラクティスに基づくワークフローを使用して、製品のタイムラインを予測し、プランを動的に推奨し、プラン/タスク/資産/計測を一元管理します。",
  "data/ph-top/2022/1/creator-resource-kit.json": "Creator Resource Kitは、Youtuber、ミュージシャン、フォトグラファー、ビデオグラファー、ライター、ポッドキャスター、ゲーマーのための1000以上のツールやリソースを集めた無料のコレクションで、常に成長を続けています。創作、配信、管理、学習、収益化、成長、その他を支援するツールです。",
  "data/ph-top/2022/1/verifykit.json": "SMSの代わりにIMプラットフォームを利用した新しい電話番号認証の方法です。WhatsAppやTelegramを利用してユーザーを認証し、認証コストを80%削減する一方、従来のSMSをサポートして、そこにいるすべての顧客にリーチします。",
  "data/ph-top/2022/1/meritverse.json": "Meritverseは、メタバースのためのプロフェッショナルネットワークです。私たちは、あなたのスキルを実証的にアピールし、あなたの成功を支援するインセンティブがあるプロフェッショナルネットワークを構築することを可能にします。🌐",
  "data/ph-top/2022/1/figma-academy.json": "Figma Academyは、Figmaの中で直接行われる実践的なレッスンで、高度な製品デザイン戦術を学ぶ、まったく新しいプログラムです。",
  "data/ph-top/2022/1/shakespeare-ai-email-writer.json": "さようなら、ライターズ・ブロック。SHAKEspeareにあなたのビジネス内容やコールドメールの目的を伝えると、あなたの代わりに文章を作成してくれます。あとは、お好きな原稿を選んで、Mailshakeのキャンペーンに追加するだけです。",
  "data/ph-top/2022/1/showtime-gasless-nft-marketplace.json": "ガス抜き：鋳造＋出品が無料、ガス代も無料。NFTの無料投下も可能! ◆インスタントロイヤリティ（Zoraのようなプラットフォームに対応）。◆最大10,000版まで造幣できる。すべて無料です。◆ 0xPolygonネットワークで環境に優しいNFTを実現。通常よりはるかに高速。",
  "data/ph-top/2022/1/airadvisor.json": "AirAdvisorは、お客様がフライトの中断に対する補償を受けることができるかどうかを確認し、お客様に代わって案件に取り組みます。過去3年以内にフライトの遅延、キャンセル、オーバーブッキングがあった場合、最大で600ユーロ（700ドル）の補償を受けることができる可能性があります",
  "data/ph-top/2022/1/obviously-ai-time-series.json": "私たちは、時間とは過去、現在、未来を捉える最も素晴らしい情報源であると信じています。そのため、私たちはObviously AI Time Seriesを開発しました。これは、特定の日付までビジネス上の重要なイベントを予測する、最も速く、最も正確なノーコードAIツールです。",
  "data/ph-top/2022/1/lohost-io.json": "簡単に言えば、lohostは、あなたがlohostウェブサイトクライアントをインストールした任意のローカルコンピュータからインターネットにウェブサイトを提供する方法です。すべてのファイルをローカルコンピュータに保存し、ウェブサイトが存在するサブドメインを選択します(https://{yourApp}.lohost.io)。",
  "data/ph-top/2022/1/articlestaff-2-0.json": "ArticleStaffは、フリーランスのライターを管理するためのワークフローシステムです。ライターへの報酬支払いやライターからの請求書の管理はもちろん、記事の公開日や各記事の進行状況を把握することができます。",
  "data/ph-top/2022/1/asimov-security.json": "ロボット開発者は、ロボットを世に送り出す前に、カスタマイズ可能でフレンドリーなソリューションを使って、品質ゲートを適用することができます。運用チームは、すべてのロボットのセキュリティ面を一元管理できる場所を手に入れることができます。",
  "data/ph-top/2022/1/certificates-by-graphy.json": "Certificates by Graphyを使えば、美しいカスタム証明書をすべての学習者に一度に配布することができます。テンプレートを選び、CSVファイルをアップロードし、ワンクリックですべての証明書を送信できます。学習者にはPDFが配布され、ワンクリックでLinkedInに追加できるオプションも用意されています。",
  "data/ph-top/2022/1/design-gradients.json": "デザイナーがキュレーションした、あらゆるプロジェクトに使える美しいグラデーションを探す人のための無料サイト。",
  "data/ph-top/2022/1/printable-chore-chart-for-kids.json": "3歳から12歳のお子様向けに、無料でカスタマイズでき、印刷もできる便利な家事チャートのテンプレート集を作りました。今すぐ無料チャートをダウンロード https://www.ursor.com で詳細をご覧ください。",
  "data/ph-top/2022/1/notion-resolution-board.json": "Notionで新年の抱負を計画し、記録することができます。",
  "data/ph-top/2022/1/yamak.json": "ブログ、ソーシャルメディア、ウェブサイト、広告、SEOのためのコンテンツとコピーを書くための、AIを搭載した次世代プラットフォーム。私たちは、AIを活用して、人間が質の高いデータを生成できるよう支援します。私たちは、膨大な時間と人的労力を節約することができます。これはとても良いことだと思います。）",
  "data/ph-top/2022/1/treeps.json": "あなたの人生を思い出してください。それは、あなたが経験した輝かしい瞬間の集合です。良いことも、悪いことも、感動したことも、辛かったことも、それが私たち自身を作り上げているのです。より幸せになるためには、新しいことをすることで、新しい生き生きとした瞬間を作り出さなければなりません。Treepsはそれをあなたに代わって選びます。700k以上のコミュニティに参加しよう",
  "data/ph-top/2022/1/strackify.json": "Strackifyでは、プロフィールを作成し、読んでいる本やカテゴリーを検索すると、アプリのコミュニティの誰かが自分の本にマッチしたプレイリストを追加していないか確認でき、アプリから離れることなく、読みながら聴くことができますよ。",
  "data/ph-top/2022/1/tipsly.json": "Tipsly.ioは、100以上の無料ツールを備えたフランスのツールボックスです。デザイナー＆プロダクトビルダー（ノーコード）のための最高のデジタルツールが含まれています。毎週、あなたがより生産的になり、デザインやウェブサイトに最適なツールを使用できるように製品を追加しています。",
  "data/ph-top/2022/1/studio-54-nft-s.json": "自分だけのカスタマイズNFTsストアを作る。あなたのブランドとコミュニティをあなたのドメインで築きましょう。あらゆるチェーン、あらゆる支払い方法に対応し、コーディング不要、初期費用ゼロでご利用いただけます。",
  "data/ph-top/2022/1/reel-unlimited-for-slack.json": "あなたのスタートアップのためにグラフィックデザインのタスクを無制限に依頼し、いつも使っているアプリ、Slack上でデザイナーとより速くコラボレーションすることができます。👋 Slack でデザインを依頼し、コラボレーションする 💯 最初のデザイン依頼は無料 ⏰ 24 時間のターンアラウンド（納期）。",
  "data/ph-top/2022/1/pomotimer.json": "Pomotimerはポモドーロテクニックタイマーです ⏲️ このサイトの目的は、勉強や仕事、コーディングなどに集中し、生産性を高めることです 🚀。",
  "data/ph-top/2022/1/phonecast-2-0.json": "iPhone/iPadをMacにワイヤレスでミラーリング。iPhone/iPadとMacをケーブルで接続する必要がありません。オンラインミーティングやゲーム、お絵かきなど、iPhone/iPadにあるものをライブで見せることができます。PhoneCast 2.0は、新しいレンダリングエンジンを搭載し、ケーブルでのキャストと同等の性能を実現しました。",
  "data/ph-top/2022/1/magic-copy-3-0.json": "Magic Copyは、スマホのテキストやリンクをコピーしてパソコンに貼り付けたり、逆にパソコンからテキストやリンクをコピーすることができる機能です それは魔法のように動作するユニバーサルクリップボードマネージャーです。すべてのデバイスと手間なく同期するリアルタイムのクリップボード＆メモアプリです!",
  "data/ph-top/2022/1/graaphics.json": "ソーシャルメディアに掲載する効果的なグラフィックを簡単に作成できます。背景、サイズ、フォント、カラー、テキストを選んで、すばやくデザインを書き出し、ソーシャルメディアに投稿する準備ができます。お客様の声や引用文に最適です。",
  "data/ph-top/2022/1/cronly.json": "内蔵のモニタリング機能でクラウド上のcronジョブを管理したり、ローカルのcronジョブに当社のモニターを使用することができます。実装は数行のシンプルなコードで可能です。既存のcronジョブの監視ツールや、cronジョブのタスクの実行をご利用ください。",
  "data/ph-top/2022/1/square-qr.json": "Square QRは、追跡可能な美しいダイナミックQRコードを生成するオンラインツールです。",
  "data/ph-top/2022/1/twitter-growth-challenge-2022.json": "2022年Twitter成長チャレンジに参加する。熱心なオーディエンスを増やし、賞品を獲得し、同じ志を持つ新しい仲間に出会おう。すべて無料です。",
  "data/ph-top/2022/1/notrix.json": "すべてのメモをブラウザのローカルストレージに保存するシンプルなメモアプリです。メモの作成、削除は100%プライバシーを守りながら無料で行えます。Markdownをサポートしています。",
  "data/ph-top/2022/1/memento-mori-notion-calendar.json": "Notionで作られたデジタルなストイックカレンダーです。このカレンダーを使うことで、毎週自分の死期を思い出しながら、また一つ生きたことにチェックを入れることで、少し良い生活を始めることができます。",
  "data/ph-top/2022/1/great-landing-page-copy.json": "Great Landing Page Copyは、ランディングページの優れたコピーライティングの例を探すためのインターネットの小さなコーナーです。",
  "data/ph-top/2022/1/ownvibe.json": "Ownvibeは、短い動画を使ってアイテムの売買ができる初めてのマーケットプレイスです。Ownvibeのショートビデオフィードで、新しいショッピングを体験してください。スワイプするだけで新しいアイテムが見つかり、気に入ったアイテムがあれば価格ボタンをタップして購入することができます。",
  "data/ph-top/2022/1/multiclock-screensaver.json": "カスタマイズ可能な24個の時計の文字盤を使って時刻を表示する無料のmacOSスクリーンセーバー（気の利いたアニメーションもあり",
  "data/ph-top/2022/1/glip-2.json": "Glipは、ライブストリーマーがNFTを投下し、ストリーム上でライブを行い、NFTコミュニティを構築するためのプラットフォームです。TwitchやYoutubeのストリーマーは、高額のプラットフォーム手数料を支払うことなく、新しい直接収益化チャネルを解放し、彼らのスーパーファンに排他的な経験を提供することができます。",
  "data/ph-top/2022/1/tulr-io.json": "Tulrは、ビデオ、テーブル、フォーム、カレンダーを組み合わせ、ワークフローに合わせた強力な自動化を適用することができます。応募者追跡、メールマーケティング、ビデオピッチなどの強力なアプリケーションを、最小限の支援で、誰でも作成することができます。",
  "data/ph-top/2022/1/databar-ai.json": "Databar.aiは、ノーコードのAPIマーケットプレイスです。3クリックであらゆるデータAPIに接続できます。🚀 専門知識は不要 🏁 迅速かつ簡単：ランディングからデータセットまで30秒以内 ✅ 自動認証、ヘッダー、ページ分割を行う。",
  "data/ph-top/2022/1/mesh-y.json": "Meshy は、美しくカラフルなメッシュグラデーションを生成するデザインツールです。色やサイズのカスタマイズが可能で、ランダムなメッシュグラデーションを複数生成することができます。グラデーションはPNG形式で自由にエクスポートできます。",
  "data/ph-top/2022/1/peach-productivity-clock.json": "生産性を向上させるのは難しいものです。Peachは、あなたの時間とその使い道を記録するための無料ツールです。プロが使っている生産性向上テクニックを応用しています。注：最良の結果を得るためには、テクニックとツールの両方を使用してください。",
  "data/ph-top/2022/1/speechly-reactive-voice-ui-api.json": "Speechlyは、高速、正確、かつシンプルな音声インターフェースAPIです。当社独自の技術により、音声認識やNLUの経験がない開発者でも、数行のコードで簡単にマルチモーダル音声UI機能をあらゆるデジタルアプリケーションに追加することができます。",
  "data/ph-top/2022/1/droit-addons-for-elementor.json": "Droit Addons for Elementorは、Elementorページビルダーのユーザー体験をより堅牢で強力なウィジェット、要素、モジュール、および機能で強化する、使いやすいプラグインです。",
  "data/ph-top/2022/1/wordle.json": "シンプルで無料のデイリーゲームです。マスターマインドとハングマンが子供を産んだら、Wordleになるでしょう。",
  "data/ph-top/2022/1/importify-dropshipping.json": "インポートファイはドロップシッピング商品を輸入し、店舗で販売しようとするeコマース販売者のための主要なプラットフォームです。インポートファイを使用することで、時間を節約し、より多くの売上とビジネスの管理に集中することができます。",
  "data/ph-top/2022/1/color-picker-chrome-extension.json": "AdCreative.aiチームによる、シンプルで軽く、無料で使えるHEXカラーピッカーで、あなたの使用状況やアカウントから情報を収集することはありません。注：我々は、今後数週間のうちにいくつかの計画されたアップデートを持っている。",
  "data/ph-top/2022/1/dark-habits.json": "毎日の習慣をgoogleシートに記録する。",
  "data/ph-top/2022/1/easypop.json": "コーディングやセットアップの手間がなく、5分以内にShopifyのオンサイトプロモーションを開始することができます。Easypopを使用して、顧客を魅了し、オーディエンスを増やし、売上を増加させましょう。",
  "data/ph-top/2022/1/iteration-x.json": "Iteration Xは、ライブのウェブサイトやウェブアプリをChromeで直接注釈し、編集することができます。スクリーンショットやビデオ通話、メールやチャットで時間とエネルギーを浪費する必要はもうありません。あらゆるページを改善し、その結果を数秒でチームと共有できます✌️。",
  "data/ph-top/2022/1/lottie-animations-by-iconscout.json": "10,000以上のロティ・アニメーションが収録されたライブラリーで、あなたのデザインをより豊かにします。ウェブ、アプリ、ソーシャルメディア、プレゼンテーションなど、あらゆる場所で使えるアニメーションで、エンゲージメントを高め、ユーザーエクスペリエンスを向上させましょう。静止画像にさようなら。",
  "data/ph-top/2022/1/amy-2.json": "AmyのAIを搭載したChrome Extensionは、Web上の情報や、会う人全員に関する実用的な洞察を提供することで、リサーチの日数を節約し、すべてのミーティングをパーソナライズしてエースになるようサポートします。",
  "data/ph-top/2022/1/listener-for-zoom.json": "Zoom通話の重要な瞬間をリアルタイムでブックマークし、長い録音を一口サイズのビデオクリップに簡単に変換できます。ベータ版で無料。Zoomのライセンス（有料）アカウントでのみ使用可能です。",
  "data/ph-top/2022/1/upscale-media-free-resolution-enhancing.json": "私たちのAIツールで品質を損なうことなく、自動的に画像の解像度を元のサイズの4倍までアップスケールします 🔥 無料で、永遠に使えます。🔍 画像を自動的に2倍、4倍と大きくする。✨ JPEG アーティファクトを除去 🤖 ピクセル化したり、細部をぼやけたりしない。",
  "data/ph-top/2022/1/manganum.json": "幻想的な写真やビデオの背景、非情なモチベーションウィジェットを備えたインスピレーション溢れる新しいタブは、あなたのGoogle Chromeを生産性の高いマシンに変えます。時計と天気予報のウィジェットもあります。ミンスクと東京で愛情を込めて開発されました🤍❤️🤍️。",
  "data/ph-top/2022/1/poeticmetric-analytics.json": "訪問者のプライバシーを侵害することなく、ビジネス上の意思決定を行うことができます。クッキーや個人情報の収集はありません。だから、クッキーバナーやGDPR、CCPA、PECRを気にする必要はありません。",
  "data/ph-top/2022/1/supernova-io.json": "Supernovaは、あらゆる分野で一貫性のあるデザインシステムを構築、管理、共有し、完全にカスタマイズ可能なドキュメントサイトを簡単に構築し、面倒なデザインシステム資産のコードベースへの配信を自動化することが可能です。",
  "data/ph-top/2022/1/zipmessage.json": "ZipMessageは、ライブミーティングを非同期の会話に置き換えます。顧客やチームメイトとビデオメッセージやスクリーンメッセージを送受信することができます。パーソナライズされたリンクを共有すれば、非同期の会話を開始できます。",
  "data/ph-top/2022/1/vision-ui-dashboard.json": "シンプルでクリエイティブなティムが作る、最もトレンディで複雑かつ革新的なチャクラUIとマテリアルダッシュボード。Chakra UIやMaterial UIのための革新的な管理者テンプレートであなたの開発を始めましょう。",
  "data/ph-top/2022/1/arcade-3.json": "ウェブサイト、ブログ記事、ツイートの中に埋め込むことができるインタラクティブなデモで、製品を紹介しましょう。アーケードは、作成、埋め込み、維持がとても簡単で、楽しく遊べます！ ⠀ アーケードの作成、埋め込み、維持がとても簡単で、楽しく遊べます。",
  "data/ph-top/2022/1/timo-2-0.json": "ToDoリストとタイムトラッキングをTimoで一元管理。複数のアプリケーションに踊らされることなく、重要なことに集中しましょう。仕事を終わらせ、顧客に請求することに集中しましょう。Timo で追跡すれば、顧客への請求書作成とタイムシートの記入に必要なものがすべて揃います。",
  "data/ph-top/2022/1/clover-v1.json": "Cloverは、メモ、タスク、ホワイトボード、デイリープランナーを1つの合理的なアプリに統合したデジタルノートブックです。",
  "data/ph-top/2022/1/collx.json": "CollX（「コレクト」）は、古くからの疑問に答えます。「それは何の価値があるのか？このアプリは、野球、サッカー、バスケットボールのカードをスキャンし、瞬時にIDを取得して平均的な市場価値を得ることができます。そして、コレクションを構築し、価値を追跡し、友人をフォローし、取引し、売買することができます。",
  "data/ph-top/2022/1/pointcard-titan.json": "PointCard™ Titanは、あなたと一緒に歩んでいくカードです。パーソナライズされた、正確で透明性の高いこの新しいチャージカードは、あなたがリワードを選び、ポイントを好きなように使うことを可能にします。",
  "data/ph-top/2022/1/alwane.json": "選択したウェブサイトや既存のCSSコードから色を抽出するウェブベースのツールです。また、色を再グループ化/順序付けして、最終的にCSS/Sassのカラーパレットを提供します。",
  "data/ph-top/2022/1/nonfik.json": "ノンフィクは、ゲーテッド・コンテンツ・ライブラリで、議論に値するフリーペーパーをベースに、以下のようなソーシャル・リーディング機能を搭載しています。共有可能な本棚 📚メモとディスカッション ⭐専門家とコミュニティのレビュー 🗂オンボーディングや仲間を教育するためのカスタムコレクション",
  "data/ph-top/2022/1/sieve-29e50984-ed30-49c2-a191-543178a4f3ae.json": "Sieveは、ビデオデータの保存、処理、自動検索を瞬時かつ効率的に行うためのAPIです。Sieveは、ペタバイト級の生ビデオの中から1%の興味深いデータを見つけ出し、重要なメタデータをタグ付けし、高品質のデータセットを構築します。",
  "data/ph-top/2022/1/workona-iphone-app.json": "Workona for iPhone は、いつでもどこでも仕事にアクセスできます。 外出先からプロジェクトのタブ、ドキュメント、リンクに簡単にアクセスできます。iPhoneでは、ウェブページを後で見るために保存したり、デスクトップのブラウザで開いているタブにアクセスすることができます。",
  "data/ph-top/2022/1/punksvsapes.json": "Punks vs Apesは、イーサリアムブロックチェーン上で初のオンチェーンパズルゲームです。このユニークなインタラクティブアートと音楽のNFTを9,998個収録しています。すべての動きは記録され、時間の終わりまで永遠にオンチェーンに保存されます。見てみてください、または自分でプレイしてみてください :)",
  "data/ph-top/2022/1/super-design.json": "毎日更新される何千ものスクリーンショットの中からベストなデザインを見つけ、クリエイティブなリサーチの時間を短縮できます。",
  "data/ph-top/2022/1/purrfect-utm-builder-by-stack-moxie.json": "簡単で間違いのないURLを作成できる、唯一の無料UTMビルダーです。正確なUTMは、正確な分析につながります。技術スタックを統合し、標準的な値を使用して、不十分なUTMの管理による分析の毛玉を回避します。それは「完璧」です - Uriel Trace Moxie \"U.T.M.\" 猫",
  "data/ph-top/2022/1/tiny-sketchbook-by-cloudhq.json": "Tiny Sketchbookは、シンプルな操作で素早く落書きアートが描けるアプリです。~5つのメリット~ ✅ スケッチで必要なものを視覚的に示す ✅ 落書きスケッチアートを作成 ✅ コラボレーション/チーム結合 ✅ 教室の課題 ✅ アートセラピーでストレス発散",
  "data/ph-top/2022/1/chaty.json": "Webサイト訪問者に摩擦のないカスタマーコミュニケーションを提供することで、顧客体験を向上させ、コンバージョンや売上につながる可能性を高めます。",
  "data/ph-top/2022/1/dryfta-2.json": "Dryftaは、イベント主催者が抄録やレビューの収集、オンラインでのチケット販売、インタラクティブなプログラムスケジュールの作成、バーチャルミーティングの開催、フル機能のネットワーキングアプリによる参加者のエンゲージメントを高めることを支援します。",
  "data/ph-top/2022/1/surfable-apps.json": "お気に入りのウェブサイトをアプリとしてインストールし、ドックやスポットライト検索から直接アクセスできます。このサービスは無料で、インストール可能なウェブサイトは100万件以上!",
  "data/ph-top/2022/1/buzz-by-streambee.json": "カメオを想像してください、でもDMのためです。Buzzは、クリエイターのためのDMマネタイズツールで、無料と有料のDMをサポートします。バズでは、あなたのファンとのチャットに最適なフィルターを使用することができます。Twitchと統合し、Twitchサブスクリプションをサポートすることで、本日ローンチしました。",
  "data/ph-top/2022/1/design-landscape-in-202x.json": "Adobe、Amazon、Figma、Nasdaq、Microsoftなどのシニアデザイナーが語る50以上のインサイト。+ 2022-2030年にデザインでキャリアを積むための12のアイデア。",
  "data/ph-top/2022/1/growth-hacking-resources-3.json": "このキュレーションされたグロースハッキングリソースリストは、グロースハッキングについて学ぶのに最適なリソースを示すことで、あなたがより速く成長するのを助けるでしょう。100以上のリソースにフルアクセスできるAirtableファイル このファイルには、リソース名、URL、説明、画像、種類が含まれています。",
  "data/ph-top/2022/1/nft-sales-bot.json": "NFT Sales Botは、私が2021年に最初の3つ（！）のNFTを立ち上げたときに、あったらいいなと思っていたツールです。なぜなら、NFTを販売するときは、自分のコミュニティ（DiscordやTwitterのフォロワーなど）のみんなに知ってもらいたいからです。なぜかって？この社会的証明がさらに売上を伸ばすからです。",
  "data/ph-top/2022/1/get-rich-quick.json": "お金を騙し取る複雑な方法を考案する代わりに、このウェブサイトにアクセスし、必要な金額を選択し、ウォレットのアドレスを入力し、ボタンをクリックするだけで、そのお金を手に入れることができます。手間いらず、簡単、シンプル、無料。どうぞお楽しみください。",
  "data/ph-top/2022/1/tipybit.json": "視聴者からの応援をビットコインで受け取ることができます。ライトニング・ネットワークのおかげで、誰でもすぐに1ドルでも送ることができます。メッセージを残すことも、匿名でチップを送ることもできます。制限なく世界中に公開されます。",
  "data/ph-top/2022/1/clay-css.json": "HTML要素に膨らんだふわふわの3Dクレイモルフィズムスタイルを適用するためのマイクロCSS利用クラスです。CSS変数によるカスタマイズと拡張が可能です。SASS mixinも含まれているので、より多くのスタイルを選択することができます。",
  "data/ph-top/2022/1/medusa-express.json": "🔥 1ページのチェックアウトフロー ⭐️ 自動生成された商品リンクから直接販売 ⚡️ オープンソースなので、独自のタッチを追加できる 🎉 数分で立ち上げられる 🛠 Next.js で構築されています。",
  "data/ph-top/2022/1/lusha-prospecting-platform.json": "Lusha Prospecting Platformは、最もシンプルで正確な方法で、夢のある見込み客を選別し、到達させることができます。レーザーターゲット化されたリストでプロスペクトの時間を削減し、意思決定者とより早くつながり、より多くの収益機会を創出します。",
  "data/ph-top/2022/1/heybooster-2-0.json": "heyboosterは、あらゆるマーケティングチャネルのデータを分析し、マーケティング戦略を最適化するための実用的なインサイトを提供します。問題点を浮き彫りにし、優先順位をつけてレポートします。",
  "data/ph-top/2022/1/mailercloud.json": "Mailercloudはクラウドベースのメールマーケティングツールで、優れた機能を豊富に備えており、ユーザーが読者と強い関係を築くのに役立ちます。エンゲージメント率やコンバージョンを向上させたい方に最適です。",
  "data/ph-top/2022/1/plum-lite.json": "プラム・ライトは、インドの小規模なチームでも簡単に始められる健康保険です。健康保険、無制限の医師の遠隔相談、ウェルネスセッション、薬や健康診断の割引、優れたカスタマーサポートが含まれています。月払いです。",
  "data/ph-top/2022/1/akiflow-3-0.json": "アキフローを使うと、こんなことができます。ショートカットとコマンドバーを使ってタスクやイベントを作成 🔔 ミーティング前にアラートを受け取り、ワンクリックで参加 などなど。",
  "data/ph-top/2022/1/free-bio-link-page-by-sendpulse.json": "Instagram、Twitter、YouTube のプロフィールにバイオリンク・ページを作成 🔗 ソーシャルプロファイルと連絡先を掲載 ✅ メーリングリストとチャットボットの購読者を獲得 ✅ 商品を紹介して販売 バイオリンク・ページは1つ無料、プレミアムプランは年間わずか$13です。",
  "data/ph-top/2022/1/karma-by-goodera.json": "Karmaは、Gooderaが提供するZoomアプリで、Zoomミーティング中にチームが良いことをしたり、良い気分になったりできるよう支援します。出席者は、100カ国以上の非営利団体のパートナーによってサポートされている大切な目的をサポートするために、たった10分で簡単なアクションを起こすことができます。",
  "data/ph-top/2022/1/thousand-faces-club.json": "Thousand faces club&nbsp;は、クリエイターが仲間を見つけ、メンターシップを求め、ベストプラクティスを発見するためのコミュニティです。若手クリエイターの成功への道のりを、より楽しく、より孤独にしないために、私たちは力を与えます。",
  "data/ph-top/2022/1/notion-themes.json": "Notion Themesは、Notionにカスタムテーマを適用するためのオープンソースのWeb拡張機能です。Notion Themesをインストールして、Notion全体のルック＆フィールを変更します。10種類以上のダーク/ライトカラースキームから選択できます。Chrome/ Brave/ Firefox/ Opera/ Egde ブラウザで動作します。",
  "data/ph-top/2022/1/hdr-plus-2-0.json": "プロ並みのHDR写真を簡単に撮影 オートモード：人工知能が最適なEVを選択し、HDR写真を撮影します。マニュアルモード：ISOと露出時間をシーンごとに調整します。アプリでもっと素敵な機能を発見",
  "data/ph-top/2022/1/people-also-search-for.json": "Googleのデータと検索結果を利用して、視聴者が（も）検索しているキーワードを見つけることができる無料ツールです。",
  "data/ph-top/2022/1/productlane.json": "フィードバック管理、顧客セグメンテーション、公開ロードマップ、自動生成される変更履歴でリニアを補完します。同じルック＆フィールで、CMD+K、ショートカット、ダークモード、リアルタイム同期、100msルールなど、何でもありです。",
  "data/ph-top/2022/1/dropshare-5.json": "スクリーンショット、スクリーンレコーディング、ファイル、文字通り何でもアップロードして、リンクですぐに誰とでも共有できます。Dropshareは、macOSとiOSで使えるファイル共有ツールで、ほとんどすべての一般的なストレージプロバイダとセルフホスティングソリューションで動作します。",
  "data/ph-top/2022/1/the-kool-aid-factory.json": "企業文化を正しく理解するには努力が必要です。クールエイドファクトリー」は、シリコンバレーで共有されている、「自分流」の企業文化を実現するためのプレイブックです。",
  "data/ph-top/2022/1/retroteam.json": "タイムボックス、プリセット、カスタムレトロフォーマットなどの機能を備えた、プライバシーを重視したRetroTeamの美しいプラットフォームで、付箋紙を捨て、オンラインでレトロスペクティブを実施することができます。",
  "data/ph-top/2022/1/grainients.json": "2000種類以上の高解像度グラデーションで、あなたのデザインを格上げします。3種類の粒状効果、18種類の2色と3色のグラデーションの組み合わせ、16種類のグラデーションレイアウトのバリエーションなど、幅広い粒状グラデーションをお試しください。",
  "data/ph-top/2022/1/popwork.json": "Popworkは、マネージャーとチームがより良い協力関係を築けるようにするアプリです。あなたのチームマネジメントを次のレベルへと導きます。1 対 1 の会議を円滑に進める 🌈 チームの雰囲気と仕事量を可視化する 💁 すぐにフィードバックを共有する ✅ 毎週フォローアップする 🎯 OKR を追跡する",
  "data/ph-top/2022/1/draw-your-nft.json": "さあ、ファンキーなNFTを描いてミントしよう 🖼。",
  "data/ph-top/2022/1/token-master.json": "Token Masterは、カラーデザイントークンを自動化するFigma用プラグインです。Token Masterを使えば、デザイントークンのスタイルを編集し、新しいカラーモードを素早く作成することができます。同じ色のトークンを選んで、一度に編集するだけです!",
  "data/ph-top/2022/1/copywriting-examples.json": "Marketing Examplesの作成者であるHarry Dryによる330以上の厳選されたコピーライティングの例です。",
  "data/ph-top/2022/1/creator-economy-buzz.json": "Creator Economy Buzzでは、毎週、クリエイターや投資家、この分野のソートリーダーから最も重要な記事、ビデオ、ブログ、ツイートを厳選してお届けしています。クリエイターにとって、重要な情報をキャッチアップする最も簡単な方法です。",
  "data/ph-top/2022/1/what-is-an-indie-maker.json": "😒 親戚にインディーズメーカーを説明するのに疲れていませんか？💡 次回はこのサイトを送ってあげましょう!",
  "data/ph-top/2022/1/community-tools-index-by-orbit-2.json": "コミュニティ・ビルダーが日常的に使用しているツールについて調査を行い、その結果を「コミュニティ・ツール・インデックス」にマッピングしました。18のカテゴリーにまたがる300以上のツールから、コミュニティの実現を支援する新しい有用なソフトウェアを発見することができます。",
  "data/ph-top/2022/1/snippet-3.json": "a macOS quick link finder inspired by https://uiw.tf get the https://testflight.apple.com/join/RTRJrZYM building this to remember all sorts of cool links and to hit my routines each day let me on twitter what'd like to see next!",
  "data/ph-top/2022/1/crater-invoice.json": "Craterは、Web3.0のために作られた製品を使いたい次世代の開発者、中小企業、企業のための、より直感的な請求書作成ソリューションです。",
  "data/ph-top/2022/1/dopplertask.json": "DopplerTaskは、タスクを簡単に自動化することができる画期的なオープンソースソフトウェアです。bashスクリプトの束でも、車をリモートで始動させるだけでも、自動化することができます。オートメーションの構築、実行、再利用、そして世界中の誰とも共有することができます。",
  "data/ph-top/2022/1/pigeonfiles.json": "Google Driveに直接ファイルを送信するための簡単なアップロードページを作成することができます。アップロードされるファイルのサイズに制限はありません。ファイルのセキュリティとプライバシーは万全です。",
  "data/ph-top/2022/1/celebrate.json": "ボタンをクリックすると紙吹雪が舞い、みんなで歓声が上がる。これは勝利を祝うためのものです。",
  "data/ph-top/2022/1/cash-app-taxes.json": "Cash App Taxes（旧Credit Karma Tax）は、連邦税と州税の申告を迅速、簡単、かつ100％無料で行うことができるサービスです。何百万人もの人々が私たちのサービスを信頼して無料で税金を申告しており、顧客は5つ星のうち4.8を評価しています。",
  "data/ph-top/2022/1/notion-investment-dashboard.json": "ダッシュボードに含まれるもの トレードエントリー後のインスタントおよび自動分析 ✔️ ライブ株価＆マーケットウィジェット用ガイド ✔️&nbsp; 新しい株式および暗号トレードを研究するためのテンプレートを備えた研究用端末",
  "data/ph-top/2022/1/nameible.json": "Nameibleは、ビジネス、スタートアップ、サイドプロジェクトのネーミングを作成するためのツールです。キーワードを追加し、接頭辞や接尾辞を選択し、リストの組み合わせから好きな名前を選ぶだけです。簡単!",
  "data/ph-top/2022/1/scenify.json": "オープンソースの画像・動画編集ソフト。ビルド時に提供可能な動的要素をサポートします。",
  "data/ph-top/2022/1/mailet.json": "Mailetは、1時間後に失効する一時的なメールアドレスを生成するプラットフォームです。ウェブサイトやソーシャルメディアに登録し、受信したメールをUIやAPIから読み取ることができます。また、スパムを回避し、セキュリティを高めることができます。",
  "data/ph-top/2022/1/reslant.json": "ディスカッションボードでは、質問、フィードバック、アップデート、機能に対する投票など、さまざまな方法で顧客を喜ばせることができます。設定には1分ほどかかり、どのような規模のコミュニティにも最適です。サインアップして、ボードを作成し、投稿を始めましょう。",
  "data/ph-top/2022/1/airpods-fit-test.json": "耳の形＆サイズに合わせて、どのAirpodsが一番フィットするかを予測するツールです。",
  "data/ph-top/2022/1/devkit-4.json": "DevKitは、開発者が日常的に必要とする多くのツールを備えたツールキットで、生産性を高め、怪しいウェブサイトや広告まみれのウェブサイトから身を守ることができます。今後数ヶ月の間に、さらに多くの機能が追加されます。",
  "data/ph-top/2022/1/panostory.json": "あなたのパノラマをInstagramやSnapに対応したストーリーに簡単変換 PanoStoryはiOSのパノラマをストーリー性のあるビデオに変換します 3つのステップで簡単にPanoStoryを作成できます。1. パノラマを選択、2.縦長のビデオに変換、3. インスタグラムアカウントでシェアしよう",
  "data/ph-top/2022/1/seshy.json": "1つのChromeウィンドウにたくさんのタブを表示するよりも、たくさんのChromeウィンドウに数個のタブを表示する方がよいでしょう。各Chromeウィンドウは、作業中の1つのタスクを表し、そのタスクに必要なタブのみを表示することができます。Seshyがお手伝いします。",
  "data/ph-top/2022/1/mentorium.json": "個人として、またプロフェッショナルとして、あなたの成長を手助けしてくれる素晴らしいメンターを見つけよう。たった一度の出会いが、あなたの世界を変えるかもしれません。そんなチャンスを無駄にしないでください。",
  "data/ph-top/2022/1/harmonic-analyzer.json": "Harmonic Analyzerは、Bytedance社の画期的な研究に基づき、200時間以上のピアノソロ録音を取り込んで学習した機械学習モデルを使って、ピアノ演奏の音符を正確に書き写すことができます。",
  "data/ph-top/2022/1/bluesky-timer-for-zoom.json": "Zoom会議の時間管理にお困りではありませんか？私たちがスケジュール管理をお手伝いします⏱。BlueSky Timerは、時計、アジェンダタイマー、シンプルなカウントダウン、出席、参加トラッカーを提供し、Zoomミーティングやウェビナーで直接利用できます。",
  "data/ph-top/2022/1/designsync.json": "DesignSync.jsは、Webflowのサイトを瞬時にNext.jsのプロジェクトにインポートするNext.jsテンプレートです。DesignSync.jsを使えば、デザインの専門家でなくても美しいNext.jsのサイトを構築することができます。フロントエンドの開発時間を大幅に削減できます。",
  "data/ph-top/2022/1/ccclaymoji.json": "3Dのような楽しい効果を持つ絵文字を作るための、楽しい小さなツールです。",
  "data/ph-top/2022/1/locket-widget.json": "Locketは、あなたのホーム画面に友達のライブ写真を表示するウィジェットです。それはあなたが気になる人々へのポータルのようなものです - 彼らは一日を通して何をしているのか少し垣間見ることができます。",
  "data/ph-top/2022/1/sealaunch.json": "SeaLaunch 🌊 🚀は、今後発売されるNFTのプレセールとドロップのための発見プラットフォームです。私たちの目標は、NFTプロジェクトがNFTの鋳造前に必要なすべての情報を得ながら、その発売を見守ることができるようにすることです。",
  "data/ph-top/2022/1/pachino.json": "開発中のポモドーロ・テクニック・タイマーです。- 素敵な禅モード。- 豊富なバックグラウンド・サウンド。- SwiftUIで構築され、macOSとiOSをクロスします。",
  "data/ph-top/2022/1/socialscribe.json": "Socialscribeは、ニュースレターのランディングページに「Subscribe w/ Twitter」ボタンを作成します。これらのボタンは、特にモバイルデバイスを使用している人のコンバージョンを最大50%（！）まで簡単に増加させます。デモを見るには、https://scribe.deta.dev/bomh をご覧ください。",
  "data/ph-top/2022/1/wproject.json": "wProjectは、WordPressで構築された、美しく、情報量の多いプロジェクト管理システムです。",
  "data/ph-top/2022/1/homies-2.json": "優れたデザインプロジェクトのために、キャラクター、背景、オブジェクトを備えた成長中の3Dシーンコンストラクタです。鮮やかな色彩と滑らかなテクスチャで、あなたの素晴らしいアイデアをウェブサイト上で表現したり、モバイルアプリを充実させたりしてください。Blender、Figmaと互換性があります。",
  "data/ph-top/2022/1/flat-icons-2-0.json": "Flat Icons Lifetime Bundle 2.0は、カスタマイズ可能な27,900個のユニークなアイコンを提供します。Webアプリ、FigmaとAdobe XDプラグイン（今後追加予定） ✔ AI、EPS、SVG、PDF、PNG、IconJarのアイコン ✔ 発売を記念してPHが67%オフ",
  "data/ph-top/2022/1/seo-checker-io.json": "SEO-Checker.ioは、SEOの取り組みを長期的に監視し、最適化することを支援します。私たちは、あなたのウェブサイトの不動産を改善し、トラフィックとコンバージョンを増加させる方法についての比類のない洞察を提供し、あなたの生活を容易にする消化しやすい監査レポートを提供することができます。",
  "data/ph-top/2022/1/nooble-1.json": "Noobleはソーシャルオーディオコミュニティアプリ! (Reddit for Audio) 「ステーション」と呼ばれる、技術、暗号、スタートアップなど、自分の興味のあるオーディオ・コミュニティに参加して、短いオーディオを消費してください。友人やネットワークから送られてくる質問に答えるだけで作成できます。",
  "data/ph-top/2022/1/shottr.json": "Shottrは、ピクセルにこだわる人のために作られた、小さく、速く、人間サイズのスクリーンショットアプリです。Swiftで作られ、M1用に最適化され、現時点では完全に無料です。",
  "data/ph-top/2022/1/othership.json": "一日の始まりに、集中力を養い、疲労と戦い、深く眠り、感情を調整し、科学的に裏付けられた呼吸法の方法と理由を学ぶことができます。",
  "data/ph-top/2022/1/loopcv.json": "Loopcvは、仕事探しを完全に自動化するNo.1のプラットフォームです。履歴書（CV）をアップロードし、仕事検索のパラメータ（職種、場所、その他のフィルタ）を定義し、毎日新しい仕事に応募するプロセスを自動化します（労力不要） 今日から始めましょう 🔥🔥。",
  "data/ph-top/2022/1/videodeck.json": "経験豊富なビデオグラファー、マーケッター、俳優からなる専任チームが、アイデアから完成まで、ビデオマーケティングのエースとしてお客様をサポートします。もちろん、200％手間がかかりません。",
  "data/ph-top/2022/1/joon-for-kids.json": "Joonは、子供たちにライフスキルを教えるための複合現実型モバイルゲームです。ポケモンとクラブペンギンのようなものですが、子供たちは親から与えられた課題をクリアするか、実生活でポジティブな習慣を実践することで、レベルアップし、新しいものをアンロックすることができるのです。",
  "data/ph-top/2022/1/notifo.json": "Notifoは、あらゆるチャネルに対応するオープンソースの通知サーバーです。メール、モバイルプッシュ、ウェブプッシュ、SMS、メッセージング、APIを通じた通知の確実な配信を処理します。Webプラグインは、お客様のWebサイトに埋め込むことができます。",
  "data/ph-top/2022/1/paisarocket.json": "PaisaRocketは、インド人向けに、フリーランスやクリエイターなどのリモートワーカーが、世界のどこからでも迅速に報酬を受け取れるよう、国境を越えた即時決済・請求書発行ツールを提供します。私たちは、暗号を活用し、より速く、より安価な支払いを実現します。",
  "data/ph-top/2022/1/assetdash.json": "AssetDashは、投資家のためのオールインワン・ポートフォリオ・トラッカーです。あなたの口座を接続し、リアルタイムであなたのすべての株式、暗号、NFT、DeFi、および未公開株を追跡します。AssetDashは100以上のプラットフォーム、暗号ウォレット、ブロックチェーン、および取引所をサポートしています。",
  "data/ph-top/2022/1/simplified-design.json": "史上初のAI搭載のクリエイティブアシスタントで、タブを切り替えることなく、すべてのマーケティングを完了させましょう。Simplifiedを使えば、大量のマーケティングキャンペーンをチームと一緒に軽快にデザインし、拡大することができます。",
  "data/ph-top/2022/1/unicorn-hunt-2.json": "このダックハントをプレイして、私たちのローンチツイート (shorturl.at/zFLR2) をRTすると、マーケティングVCであるスペースカデットに1万ドルの賞金が与えられます。私たちのファンドは、a16zからUSVまでのトップインベスターとともに、37のスタートアップに590万ドルを投資した1年目に続いています。クルーに参加しよう",
  "data/ph-top/2022/1/wizishop.json": "🚀&nbsp;A no-code online store builder with superior SEO tools 💥 400以上の統合機能を持つオールインワンソリューションです。追加のプラグインは必要ありません 継続的なオンライン教育と専門家によるビジネスコーチチームが、あなたの新しい冒険をサポートします!",
  "data/ph-top/2022/1/savvycal-for-stripe.json": "Stripe アカウントを接続して、SavvyCal スケジューリング リンクから直接支払いを収集できます。Stripeの統合は、SavvyCalプレミアムプランの機能です。最初の20人は、コードPHSTRIPEを使用して、3ヶ月間ベーシックの価格でプレミアムプランを利用することができます。",
  "data/ph-top/2022/1/elastic-metal.json": "ベアメタルはクラウドの二級市民であってはならない。Elastic Metalの登場です。ベアメタルの信頼性とクラウドの弾力性を併せ持ちます。0.083ユーロ/時または29.99ユーロ/月 ✔ 強力な専用マシン ✔ 当社の完全なクラウドエコシステムへの統合",
  "data/ph-top/2022/1/socialbook-video-background-remover.json": "新しいことは何もない、ただ良いことだ :-)",
  "data/ph-top/2022/1/drawkit-3d-builder-figma-plugin.json": "美しいデザインを構築：DrawKit 3D Builderを使用すれば、3Dイラストやアイコンを簡単に組み合わせて、Figmaファイルにドロップできます✏️ - 6つのカテゴリーがあります。ソーシャルメディア、暗号、火花＆その他 - 400以上の画像 - 各パックにはカラーバリエーションがあります🌈。",
  "data/ph-top/2022/1/wingman-mobile-app.json": "AIを活用した営業向けレベニューアクセラレーター「Wingman」がモバイルに登場。あなたのセールストーク、コーチングフィードバック、今後のミーティングなど、すべて指先で操作できます。だから、外出先で遊んだり、学んだり、コーチングしたりすることができるのです。",
  "data/ph-top/2022/1/gostartup.json": "GoStartupは、チャット＆チャンネル、チームカレンダー、タスク管理が一体となったオールインワンのワークスペースです。特にスタートアップのために手頃な価格で設計されたこのツールは、暗号化、統合、そして購入が可能なオールインワン・ツールです。究極のスタートアップOSです。",
  "data/ph-top/2022/1/illegal-analytics-scanner.json": "2022年1月13日、オーストリアデータ保護庁は、Google Analyticsを違法とする判決を下しました。Schrems IIの判決後、ウェブサイトはEUの訪問者データを米国または米国が管理するサーバーに転送できなくなった。ご自身のアナリティクスが法律に違反していないか確認してみてください",
  "data/ph-top/2022/1/project-management-templates.json": "プロのプロジェクトリーダーが作成した無料のプロジェクトマネジメントテンプレートと https://www.getguru.com/template/customer-service を使って、あらゆるタイプのプロジェクトを文書化し、よりスマートに仕事をしましょう。https://www.getguru.com/template/team-meetings の作成、https://www.getguru.com/template/project-management の管理、https://www.getguru.com/template/product-management の調整などのテンプレートが用意されています。他にもたくさんあります。",
  "data/ph-top/2022/1/the-2022-guide-to-productivity.json": "3週間の無料メール講座では、クリックアップとミネルバを使って仕事を効率化するプロセスを設定する方法を具体的にご紹介しています。個人用ワークスペースを設定する。🖊️ 仕事のテンプレートを作成する。📈 タスクをチームに委譲する。",
  "data/ph-top/2022/1/the-happiness-bar-gratitude-journal-22.json": "Notionを使って、美しい夢の弾丸／感謝日記を作りましょう。編集可能な日/週/月/四半期プランナープロンプトと睡眠、気分、冒険、ヒントなどを総合的に報告する342人以上のジャーナラーの意図的なジャーナル体験に参加しましょう。",
  "data/ph-top/2022/1/the-doge-nft.json": "Doge NFTは、世界で最も有名なミームのインスピレーションとなったオリジナル写真です。日本のKabosuのオーナーから購入され、ドージェを人々に戻すために$DOGトークンに分数化されました。",
  "data/ph-top/2022/1/dakiya.json": "dakiyaを使えば、アカウントを作ったり、メールサーバーに頼ったりすることなく、ウォレットアドレスがあれば誰にでもメッセージを送ることができます。メッセージは受信者の公開鍵を使って暗号化されます。メッセージの送信にはガソリン代がかかるので、重要なメッセージに限ります",
  "data/ph-top/2022/1/framer-sites-beta.json": "🔥 キャンバス上で本物のウェブサイトをデザインできます。数秒で公開。すべて超高速パフォーマンスで。Framerの新バージョンを出荷しますので、ぜひご協力ください。詳しくは、https://bit.ly/framer-beta をご覧ください。",
  "data/ph-top/2022/1/uteach.json": "Uteachは、数分で講師業を始めるためのオールインワン・プラットフォームです。Uteachを使えば、ユーザーはライブや録画のウェビナー、自動テスト評価、eスケジュール、自分のウェブサイトでのグループクラス、モバイルアプリなどの利点を享受することができます。",
  "data/ph-top/2022/1/dubverse.json": "Dubverseは、ディープラーニングとAIを用いて、コンテンツ制作者がリアルタイムに、ある言語から別の言語へ動画を吹き替えることを、半分のコストで可能にします。インターネット上のあらゆる動画を多言語化することをミッションに立ち上げました🚀。",
  "data/ph-top/2022/1/mailazy.json": "Mailazyは、開発者のために作られた強力なトランザクションメールシステムで、お客様のメールを確実にインボックス配信することができます。信頼できるグローバルなインフラと業界の専門知識で、迅速に統合し、顧客の受信トレイにメールを配信します。",
  "data/ph-top/2022/1/smartsuite.json": "SmartSuiteは、プロジェクト、進行中のプロセス、日常的なタスクなど、ワークフローの計画、追跡、管理を可能にするコラボレーション型のワークマネージメントプラットフォームを提供します。15カ国語に対応し、価格は1ユーザーあたり10ドルからです。",
  "data/ph-top/2022/1/the-optimal-path-podcast.json": "The Optimal Pathは、Mazeがお届けする、製品の意思決定に関するポッドキャストです。プロジェクト、製品、そして個人の旅において、重要な意思決定を形成した経験を明らかにするために、Ash Oliverが専門家と話をします。",
  "data/ph-top/2022/1/minimal-theme-for-twitter-4-0.json": "Twitter用Minimal Themeは、TwitterのUIをすっきりさせるために、意見を取り入れたスタイルのベースレイヤーを追加します。また、あなたのTwitterの経験をパーソナライズすることができます上に余分なカスタマイズを提供します。- フィードの幅をコントロール - ナビゲーションをコントロール - ゼンモード...などなど",
  "data/ph-top/2022/1/prepaid-ai-content-by-contentbot.json": "プリペイドAIライターと、必要な時に必要な分だけ支払う高品質なAIコンテンツを手に入れましょう。世界最先端のAIによるライティングをご利用ください。ブログコンテンツ、ランディングページ、広告コピーなど、さまざまな用途に対応します。",
  "data/ph-top/2022/1/creator-economy-pitch-decks.json": "クリエイターエコノミーの一翼を担おうとする起業家のためのリソースは非常に少ない。そこで私は、クリエイター系スタートアップが2億4700万ドルを調達するのに貢献したピッチデッキの最大規模のデータベースを構築することにしました。",
  "data/ph-top/2022/1/webcode-run.json": "ドキュメント、コード（フロントエンド＋バックエンド）、モニタリング、オペレーションを、一目で理解できるシンプルなWebノートブックにまとめることで、プロジェクト運用を簡素化することができます。WEBCodeは、開発者の体験と操作のしやすさに重点を置いています。",
  "data/ph-top/2022/1/instacap.json": "あらゆるWebページ、画像、PDFに対して、ワンクリックで注釈やビジュアルコメントを共有できます。リンクを介してPDF＆スクリーンキャプチャの上で直接非同期で議論することができます。会議もログインも不要⚡️。",
  "data/ph-top/2022/1/tootshot.json": "Mastodonの投稿のスクリーンショットを生成します。カスタマイズオプション：サイズ、パディング、グラデーション、ダークモード。あなたのトゥートを画像としてコピーまたはダウンロードできます。",
  "data/ph-top/2022/1/pepper-9.json": "PEPPERの電子筋肉刺激スーツで、いつでもどこでもトレーニング。常に進化し続けるEMSワークアウトビデオのライブラリから選択し、ワークアウト中にすべての電極の強度を個別に調整することができます。",
  "data/ph-top/2022/1/vimeomate.json": "Vimeomateは、Vimeoの高画質な動画を簡単にダウンロードできる、ChromeとEdge用の無料のVimeo動画ダウンロード拡張機能です。",
  "data/ph-top/2022/1/state-of-email-2022.json": "State of Email 2022には、250人以上の専門家による洞察とデータに基づく分析が含まれており、マーケティング担当者がメールのコンバージョンを改善するために役立ちます。2022年のメールマーケティングのトレンド ✅2021年のメールの間違いトップ5と解決策 💌メール＆配信の専門家による実践的なヒント",
  "data/ph-top/2022/1/memedb-2.json": "MemeDBは、ミームの作成を民主化する試みで、人気のあるミームテンプレートを実際の名前ではなく、感情でカタログ化し、誰もがミームを作成できるようにするものです Made with Softr",
  "data/ph-top/2022/1/truesource.json": "TrueSourceは、インテリジェントなデータ製品を構築して発売し、収益化するためのノーコード・プラットフォームです。クリエイターや企業がCrunchbaseやIMDbのようなデータ中心のアプリを5分で構築することを可能にします。サインアップして無料で構築しましょう",
  "data/ph-top/2022/1/content-ai-by-rank-math-seo.json": "何文字書けばいいのか、どんなキーワードやフレーズを使えばいいのか、FAQに答えればいいのか、などなど、推測で考えるのはやめましょう。A.I.（人工知能）の助けを借りて、あなたのサイトと現在ランキングされているコンテンツに合わせた洞察で、検索意図に沿ったコンテンツをモデル化します。",
  "data/ph-top/2022/1/desklog-io-2.json": "Desklogは、社員の生産性を高めるためのモチベーションを高める生産性最適化ツールです。アプリ/URLのトラッキング、自動スクリーンショット、勤怠管理、シフト管理、統合プロジェクト管理ソフトウェアなど、より多くの機能を備えています。",
  "data/ph-top/2022/1/adsius.json": "数分で主要なインターネットプラットフォームに広告を作成できるマーケティングプラットフォームで、マーケティングのスキルは必要ありません。FacebookとInstagramに簡単に広告を作成できます。近日中にさらに多くのチャンネルが利用可能になります",
  "data/ph-top/2022/1/micro-saas-ideas.json": "技術者やマーケティング担当者が、次の収益性の高いマイクロSaaSのアイデアを探すためのニュースレターです。収益性の高いMicro SaaSのニッチ市場について、データに裏付けられた分析と各アイデアの実行方法のガイドを掲載した週刊ニュースレターです。最高のアイデアを探すために何百時間ものリサーチを節約することができます。",
  "data/ph-top/2022/1/fable-677715a5-cf1d-49ee-bd6d-f71353a075ec.json": "PRDでコラボレーションを行い、ボタンを押すとJiraやLinearなどの課題追跡システムとの同期が可能です。Fableはチケットを作成し、PRDを更新して新鮮さを維持します。もうコピー＆ペーストは必要ありませんし、PRDが古くなることもありません。さらに、FableはSlackとdocsの意思決定を1つの場所に持ってきます。",
  "data/ph-top/2022/1/react-file-upload.json": "Box、Dropbox、Google Drive、OneDrive、Sharepointなどの多くのクラウドストレージAPIに接続し、アプリと任意のクラウドストレージサービス間で簡単にファイルのアップロードとダウンロードを提供するオープンソース、プラグアンドプレイFile Pickerです。",
  "data/ph-top/2022/1/game-of-codes-fantasy-maps.json": "NPMのダウンロード数やGitHubのスター数、ウェブサイトのトラフィックなど、実際のデータを使って、技術を国に見立てて可視化したのです。その方法論は、2つの別々のマップについて詳しく説明されています。- フロントエンド フレームワーク - CSS ライブラリ バックエンド & more are COMING SOON!",
  "data/ph-top/2022/1/found-dev-2-0.json": "Found.devは、開発者のためのジョブボードアグリゲーターです。私たちは毎日何十ものサイトを検索し、そこにある開発者のための最高の仕事を見つけ、リンクします！私たちは、開発者のための仕事を見つけ、リンクします！私たちは、開発者のための仕事を見つけるために、毎日何十ものサイトを検索します。さらに、すべての人は完全に無料で任意のジョブを手動で送信することができます。",
  "data/ph-top/2022/1/mui-library.json": "UXPinのMUIライブラリでデザイン - 90以上のインタラクティブなReactコンポーネントを使用します。数分でプロトタイプを作成し、開発者は準備されたコードをコピーするだけで、製品をより速く構築できます✨。",
  "data/ph-top/2022/1/range-goals.json": "チームが最も重要な目標に対して日々前進できるよう支援します。非同期チェックインやライブミーティングに目標の更新を簡単に追加できます。ハッシュタグを使用して、チームの目標を Asana や GitHub などのツールのワークアイテムにリンクします。目標のステータスを Slack から直接更新できます。",
  "data/ph-top/2022/1/proflow.json": "Proflowは、最新のWebflow開発の仕事とプロジェクトを紹介する無料の週刊ニュースレターです。",
  "data/ph-top/2022/1/airbuddy-2-5.json": "AirBuddyを使えば、Macの横でAirPodsケースを開くだけで、iPhoneやiPadでの操作と同じように、現在の状態をすぐに確認することができます。クリックするだけですぐに接続され、MacのオーディオをAirPodsで再生することができます。",
  "data/ph-top/2022/1/peak-culture-dashboard.json": "心も体もピークに達するための無料Chrome拡張機能。Chromeの新しいタブページを総合的なツールに変えましょう。毎日、より良い方法、より効率的な方法を見つけるために、絶え間ない探求を続ける人々のグループによって作られました。",
  "data/ph-top/2022/1/samelogic-2.json": "Painted Door ExperimentsとMicrosurveysを使用して、新製品や新機能を成功させるために必要なエビデンスを得ることができます。",
  "data/ph-top/2022/1/platforms-starter-kit.json": "本日、カスタムドメインに対応した最速のマルチテナントアプリケーションを構築するための包括的なテンプレートであるPlatforms Starter Kitの提供を開始します。デモをご覧になり、ご自身のアプリケーションをデプロイしてください。",
  "data/ph-top/2022/1/autumn8.json": "Autumn8は、デプロイメントプロセスの自動化と簡素化により、AIエンジニアリングチームの生産性を向上させます。学習済みAIモデルのデプロイをクラウド上で最適化・自動化するプラットフォームを提供します。",
  "data/ph-top/2022/1/no-code-tools-library.json": "No-Codeツールのための最も包括的なカタログです。- ウェブやモバイルアプリの構築、マーケティング、データ、自動化、統合、AI、Eコマースなど、さまざまな用途に対応します。",
  "data/ph-top/2022/1/wikitrivia.json": "ウィキペディアをベースに、歴史上の出来事を年表に並べ替えるというわかりやすいゲームです。",
  "data/ph-top/2022/1/mysuper-fan-3.json": "YouTubeクリエイターとして、スーパーファンを理解することは、より良いコンテンツを作るための第一歩です。SuperFanアプリを使えば、あなたのスーパーファンのリーダーボードを作成し、あなたのコンテンツに対するスーパーファンのエンゲージメントを深く掘り下げることができます。",
  "data/ph-top/2022/1/ticksy-2.json": "金融ツイッター💸は増え続け、株の話題でキャッシュタグが頻繁に使われるようになりました。Twitterで株のキャッシュタグを使う体験をもっと豊かにしたいと思い、この拡張機能を作りました！ 🚀 Twitterで株のキャッシュタグを使う体験をもっと豊かにしたいと思い、この拡張機能を作りました。💰",
  "data/ph-top/2022/1/embed-notion.json": "Embed Notionは、Notionの埋め込みスニペットを簡単に作成するためのジェネレータです。あなたのサイトにノティオンを簡単に数秒で埋め込むことができます。",
  "data/ph-top/2022/1/shapefest-2.json": "あらゆるものの3D形状を集めた膨大なライブラリ",
  "data/ph-top/2022/1/pestle-kitchen-companion.json": "ペストルは、あなたのお気に入りのレシピから大切な部分だけを取り出すのに役立ちます。3ページのストーリーは忘れて、重要なこと、材料、手順に集中しましょう。レシピの拡大縮小、単位の変換、無制限タイマーの開始など、さまざまな機能があります。",
  "data/ph-top/2022/1/free-form-templates-by-blocksurvey.json": "BlockSurveyですぐに使える、視覚に訴えるオンラインフォームやアンケートのテンプレート集です。",
  "data/ph-top/2022/1/nft-floor-finder.json": "お気に入りのNFTコレクションの特性から、フロア価格とフロアデプスを調べる最も簡単な方法です。ファンのお気に入り \"セクションでは、特定のコレクションで最も人気のある特性を探索することができます。",
  "data/ph-top/2022/1/better-copy.json": "任意のURLからすべてのテキストをスクレイピングし、ランディングページで使用を避けるべき単語のリストと照合するシンプルなアプリです。",
  "data/ph-top/2022/1/illustrations.json": "美しい無料＆プレミアムイラストをダウンロードできます。あなたは、あなたの要件に応じて原色と二次色をカスタマイズし、迅速にSVGまたはPNGとしてダウンロードすることができます。あなたがあなたの必要性に従って任意のイラストを見つけることができない場合は、私達に連絡し、私たちはあなたのためにそれを作成します。",
  "data/ph-top/2022/1/twitter-nft-avatar-maker.json": "透明な六角形のNFT Twitterアバターを作成して、あなたのTwitterプロフィール画像として使用できます 画像をアップロードするか、Twitterアカウントに接続して、ボットに現在のTwitterプロフィール画像を取得させることができます。",
  "data/ph-top/2022/1/ecommerce-os-by-contlo.json": "Eコマースビジネスを計画、開始、立ち上げ、拡大するために必要なすべてのコミュニティーのキュレーションによるリソースを集めたNotionコレクション - EコマースやD2Cビジネスの構築に必要なTwitterスレッド、書籍、アプリ、インフルエンサー、代理店など",
  "data/ph-top/2022/1/zero-code-club.json": "4週間でサイドプロジェクトを立ち上げる。このステップバイステップのガイド付きプラットフォームを通じて、収益を生み出す製品のコンセプトから立ち上げまでを行い、無料でコードなしのツールを使って製品を構築し、立ち上げることができます。",
  "data/ph-top/2022/1/shortpixel-adaptive-images.json": "Webサイトの画像に関する問題を数分で解決してくれる、使いやすいプラグインです。",
  "data/ph-top/2022/1/vault3-1.json": "パスワード、画像、ファイルなどのデジタル資産を保管する分散型保管庫です。",
  "data/ph-top/2022/1/groovifi.json": "Groovifiは、Spotifyユーザーがムード、ジャンル、BPM、年、アーティストタイプ、さらには音楽のキーとテンポなど、非常に具体的で細かい条件に従ってプレイリストを作成することができるプレイリスト・ジェネレーターです",
  "data/ph-top/2022/1/inkspired-2.json": "クリエイター、作家、読者のためのソーシャルストーリーテリングプラットフォーム。1,000,000人以上の参加者がいるコミュニティで、物語、シリーズ、小説を読んだり書いたりすることができます。英語、スペイン語、ポルトガル語、フランス語、ドイツ語、トルコ語、ロシア語で利用可能です。",
  "data/ph-top/2022/1/wagmipedia.json": "Web3を始めるには、圧倒されるかもしれません。私たちは、デザイナー、開発者、ビジネスマンのために、すべてを地図にしました。",
  "data/ph-top/2022/1/firefiles.json": "Firefilesは、firebaseのストレージバケットにドライブのようなインターフェイスを提供するアプリです。ファイルやフォルダのダウンロード、アップロード、管理をアプリ内で簡単に行うことができます。Firefilesは100%安全で、あなたのファイルはあなたの手元に残ります。",
  "data/ph-top/2022/1/how-big-is-the-baby.json": "妊娠中に赤ちゃんの大きさを視覚化するのは、大きくなったお腹しか見えないと難しいものです。\"How big is the baby \"は、妊娠中の両親が、毎日楽しいビジュアルテキストメッセージで赤ちゃんの大きさを視覚化するのを助けるSMSボットです。",
  "data/ph-top/2022/1/soketi.json": "シンプルで高速、かつ耐障害性の高いオープンソースのWSサーバです。📣 > 驚くほど速いスピード ⚡ > 他の競合製品より安い 🤑 > 使いやすい 👶 > Pusher Protocol v7 📡 > アプリベースのアクセス 🔐 > 本番環境に対応! 🤖 > 内蔵された監視機能 📈。",
  "data/ph-top/2022/1/mooze-2.json": "Moozeは、カスタムオーバーレイ、没入型プレゼンテーションとリアクションでビデオ通話をパーソナライズすることができます。人々の記憶に残るような印象を与えましょう。⚡️",
  "data/ph-top/2022/1/big-news.json": "ビッグニュースは、ニュースレターやRSSフィードなど、ウェブ上のさまざまなソースをシームレスに組み合わせて、ひとつの統一された読書体験にします。",
  "data/ph-top/2022/1/daedalos.json": "daedalOSは、Web上でのデスクトップ環境体験を再現したものです。https://dustinbrett.com/。",
  "data/ph-top/2022/1/eminer-2.json": "eMinerは、検索エンジンを使って人の連絡先を探し、リードを獲得するプロセスを自動化するGoogle Chrome拡張機能です。",
  "data/ph-top/2022/1/branding-kit.json": "ブランディングをもっと上手にしませんか？Notion Branding Kitには、夢のブランドをNotionで構築するためのツール、テンプレート、ステップバイステップの手順が含まれています。",
  "data/ph-top/2022/1/pallo.json": "オールインワンの金融プラットフォーム。ビジネスも個人的な財務も、会計も税金も、すべてパルロで管理しましょう。経費、請求書、領収書、顧客、走行距離の追跡、時間の追跡、財務的洞察、予算、転送、支払い、会計と税金。",
  "data/ph-top/2022/1/suprememinds.json": "Suprememindsは、技術系のライブセッション、AMA、講座を発見するためのプロダクトハントです。ユーザーは、数分以内にライブを行い、セッションを記録し、既存のコミュニティへのアクセスを使って100人の真のファンの支持を築き、専門家のライブセッションに参加することなどができます。",
  "data/ph-top/2022/1/habitate.json": "ハビテイトでは、ディスカッションフォーラム、コミュニティカレンダー、Cドライブ（フォルダ作成、ファイルアップロード、メンバーとの共有）が利用できます。そのすべてが、あなたのWebサイト上で実現します。",
  "data/ph-top/2022/1/automator-for-figma.json": "AutomatorはFigmaのプラグインで、ドラッグ＆ドロップでFigmaのタスクをワンクリックで実行するカスタム・オートメーションが作成できます。Figma プラグイン API のパワーを指先で操作できる、100 以上のアクションから選択できます。",
  "data/ph-top/2022/1/mockrocket.json": "驚異的な3Dデバイスモックアップとアニメーション製品ビデオで、あなたのアプリをアピールしてください。ブラウザから直接作成できます。経験は必要ありません。",
  "data/ph-top/2022/1/humans-3d-characters-v3-0.json": "Humans 3d characters (v3.0) - デザインプロジェクト用に様々なポーズのスタイリッシュな3Dキャラクターを集めた巨大なライブラリです。",
  "data/ph-top/2022/1/notion-avatar.json": "アバター作成 ソーシャルメディアのプロフィール画像や、ウェブサイト、Notionのダッシュボードに掲載できるNotionスタイルのプロフィール画像を白黒で作成します。ファイル形式: ファイル形式：PNG, JPEG 納期：24時間〜48時間",
  "data/ph-top/2022/1/superdense.json": "テキストはなく、アイコンのみ。🤩 すべてのブラウザとデバイスに対応した、最もコンパクトなブックマーク・マネージャーです。お気に入りのサイトが1クリックで表示されます。🚀",
  "data/ph-top/2022/1/fundamentals-of-creating-a-great-ui-ux.json": "\"Fundamentals of Creating Great UI/UX\" by Creative Timは、WebページやモバイルアプリのためのすべてのUI/UXデザインコンポーネントをデザインし、使用する方法を紹介します。クリエイティブ・ティムの8年間の経験に基づいています。",
  "data/ph-top/2022/1/raport.json": "複数のソースからデータを統合 📊 日次、週次、月次のパフォーマンスレポートをメールで受信 🔔 データの異常について通知 😊 迅速かつ容易に導入可能",
  "data/ph-top/2022/1/tip-jar-by-swapstack.json": "SwapstackのTip Jarは、ニュースレター作成者が読者から無料でヒントを集めることができるシステムです。新しい方法で読者とつながり、収入を増やすことができます。🛠共有可能なチップジャーページ。💰 Stripeで寄付を受け付けます❤️ サポーターからの愛を感じてください!",
  "data/ph-top/2022/1/youtube-video-download-api.json": "youtubeの動画をダウンロードして、MP4、MP3、M4Aに変換する。144p、360p、720pなど、様々な画質の動画を取得します。このAPIを使用すると、オーディオ付きまたはオーディオなしのビデオをダウンロードすることができます。",
  "data/ph-top/2022/1/cloudpouch.json": "CloudPouchは、AWSのコストを分析し、削減するためのデスクトップアプリケーションです。クリックできるチャート＆自動化されたインサイトを使って、瞬時に無駄を発見しよう お客様の請求データは誰にも(私たちにも)共有されません! 複数のAWSアカウントに対応しています。",
  "data/ph-top/2022/1/blackbox-911a10da-59fa-49b1-96ff-f944f07f4c7b.json": "あらゆるものからテキストを選択し、コピーする最速の方法です。今までにない。かなりクレイジーなアイデアであることは、私たちも承知しています。でも、BLACKBOXでできることには、きっと驚かされるはずです。最高のテキスト認識アプリを使う。",
  "data/ph-top/2022/1/doola-daos.json": "DAO LLC. EIN 米国の住所と銀行口座。米国での支払いへのアクセス 無料税務相談 年1回の州法遵守 IRSの税務申告 50,000ドルのスタートアップ特典。などなど。米国または米国以外の居住者として、どこからでも、数分で申告できます。暗号化された支払いも可能です。",
  "data/ph-top/2022/1/notesally-2-0.json": "Notesallyは、営業プロセスにおけるヒューマンエラーを低減するためのセールスイネーブルメントアプリです。営業チームのためのAIセーフティネットです。Notesallyは、営業担当者がデータ入力＆フォローアップを怠らないようにサポートします。Notesallyを使うことで、1週間あたり最大8時間を節約することができます。",
  "data/ph-top/2022/1/bettoredge.json": "私たちは、ベッターのコミュニティを調査し、彼らが毎週ベットをしながら、調査、ベット、友人との競争、自慢をするために40以上の異なるアプリを使用していることに気づきました。BettorEdgeは、このプロセスを簡素化し、手数料なしでこれらすべてを行うことを可能にします。より良いベッター体験。",
  "data/ph-top/2022/1/huntr-2-0.json": "求人情報をどこで見つけたかにかかわらず、求人情報の詳細を記録します。連絡先、メモ、日付、タスク、仕事内容、給与、場所、企業データなど。求職活動のためのCRMです。",
  "data/ph-top/2022/1/flip-clock-notion-widget.json": "あなたの概念を変える美しい時計です。* 設定も簡単だし、見た目もいい。",
  "data/ph-top/2022/1/neiighbor.json": "Neiighborは、ソーシャルウェルネスアプリで、接続されたユーザー間でウェルビーイングデータを交換し、互いの安全、幸福、自立を向上させるために、より良い情報に基づいた選択をすることを支援します。",
  "data/ph-top/2022/1/sourcegraph-d6443094-efa5-4bf2-8b38-366262e4173f.json": "ユニバーサルコード検索 巨大なコードベースでも高速に移動する。どんなレポでも、どんなホストでも。新しいコードベースへのオンボード、大規模なリファクタリング、コードの再利用の促進、効率の向上、セキュリティリスクへの対応、インシデントの原因究明など、さまざまなことが可能です。オープンソースコードを検索します。",
  "data/ph-top/2022/1/demostack.json": "デフォルトのデモでは不十分であり、カスタムバージョンに数週間を費やすこともできません。Demostackを使えば、数分でデモ環境を立ち上げることができ、会話ごとにストーリーを調整することができます。コードは必要ありません。",
  "data/ph-top/2022/1/fig-8.json": "Figは、エンジニアの端末での生産性を向上させます。私たちの最初の製品は、cd、git、npm/yarn、docker、aws などの何百ものパブリック CLI ツールを視覚的に補完する機能を追加します。⠀ プライベートなオートコンプリートが必要ですか？独自の補完機能を作成し、チーム内で共有することができます。",
  "data/ph-top/2022/1/saas-examples.json": "新しいSaaSのWebサイトのためのインスピレーションをお探しですか？他のSaaSのウェルカムメールを何百通も登録することなく、すぐにチェックしたいですか？それこそが、私がSaaSの例をまとめた理由です。常に最新のインスピレーション・ギャラリーを持つことができます。",
  "data/ph-top/2022/1/hockeystack-2-0.json": "HockeyStackは、マーケティング、収益、販売、製品データを統合する、SaaS企業向けの分析ツールです。ブログ記事のLTV、料金プランごとの月間サポート負荷、各マーケティングチャネルの機能使用率などのインサイトを明らかにします。",
  "data/ph-top/2022/1/clerk-sms-for-slack.json": "チームメンバーとSlackで直接SMSを送受信することができます。既存の電話番号を使用するか、自分の電話番号を持参してください。スレッドとチャンネルで動作し、リアルタイムと非同期のコミュニケーションのために、内部と外部の通信の間のギャップを埋めることができます。",
  "data/ph-top/2022/1/pepul.json": "Pepulは、インド発の新時代のインタレストベースのソーシャルネットワーキングプラットフォームです。プライバシーを重視したアプローチとハイパーローカルな接続性により、人々は同じ考えを持つ近くのリアルな人々と安全につながり、自分の興味に沿ったリアルなコミュニティを作ることができます。",
  "data/ph-top/2022/1/top-50-linkedin-messages-ebook-2022.json": "私たちは、あなたのネットワーキングを向上させるお手伝いをしたいと思います。なぜなら、あなたのネットワークはあなたの純資産だからです。この50のLinkedInメッセージは、あなたを刺激し、有意義な会話であなたのコネクションを築くのに役立ちます。",
  "data/ph-top/2022/1/podda-io.json": "Poddaは、ゲストによるポッドキャスト発見ツールです。",
  "data/ph-top/2022/1/cart.json": "数千のEコマースブランドのデータを発掘する。d2cマーチャントに最適です。",
  "data/ph-top/2022/1/nextui.json": "NextUIは、デザインの経験に関係なく美しいウェブサイトを作ることができる次世代UI Reactライブラリで、自動ダークモード認識、テーマサポート、簡単なカスタマイズ、クラス最高のDXなど、素晴らしい機能が搭載されています。",
  "data/ph-top/2022/1/early-learning-for-preschoolers.json": "アーリーラーニングは、小さなお子さまが生涯にわたって成功するための準備として、自分だけの先生とペアになることを目指します。ユニークでインタラクティブなアクティビティで、数字、読み書き、STEM、社会的情緒のスキルを身につけることができます。",
  "data/ph-top/2022/1/dealflow-2-0-by-micro-acquisitions.json": "Dealflowは、お気に入りのスタートアップ買収マーケットプレイスからの案件を集約し、チャンスを逃さないようにします。収益、ビジネスモデル、売上倍率、提示価格などで案件を並べ替えることができます。メールやSlackアラートでカスタムレポートを受け取ることができます。",
  "data/ph-top/2022/1/waitlyst-beta.json": "Waitlystは、製品主導の企業が製品のフィードバックを収集し、顧客を巻き込み、ビジネスを成功させるために設計されたデータ駆動型の意思決定を行うことを支援します。",
  "data/ph-top/2022/1/candor-2-0.json": "契約締結前に、チームとそのリーダーに関する公平でバランスのとれた一人称のフィードバックを公開することで、技術系の人材が職場で居場所を見つけることができるようにする。今すぐ登録し、Candorが提供する職場の帰属意識を高めるための方法を探求してください。",
  "data/ph-top/2022/1/signl-2.json": "Signlは、ニュース記事、メディア報道、ソーシャルバズなどを精査し、企業のトラクションの証拠を集約・定量化します。",
  "data/ph-top/2022/1/columns-ai.json": "Columns Ai は、ユーザーがデータの中から最も重要なストーリーを発見し、データストーリーやデータアプリで美しいビジュアライゼーションを通じて共有できるよう、ブラウザ、メール、Slack など、私たちが毎日使う同じプラットフォーム/ワークスペース上でサポートします。",
  "data/ph-top/2022/1/fastlien.json": "大量のオークションリストが利用できるFastLienでは、1000件ものタックス・リーエンや証書が素早く検索できます。",
  "data/ph-top/2022/1/coronavirus-bot.json": "600k以上のユーザーがパンデミック情報を把握するためにボットを使用しました。国別の確定症例、活動中の症例、回復した症例などを入手することができます。関連するトレンドを知ることができます。",
  "data/ph-top/2022/1/propelauth.json": "PropelAuthは、お客様の認証をホストし、管理します。ソーシャルログイン、マジックリンク、またはプロフィール写真の管理のような機能をワンクリックで追加することができます。私たちのB2Bサポートにより、あなたのユーザーは組織を作成し、チームメンバーを招待することができます。",
  "data/ph-top/2022/1/whatis-for-chrome.json": "Whatisは、専門用語、頭字語、プロジェクト、メトリクスなど、チームのコンテキストにアクセスし、整理することができます。SlackとChromeでアクセス可能です。",
  "data/ph-top/2022/1/whalepeek-nft-alerts.json": "NFTのトップインフルエンサーが投資、購入、売却する際にアラートを受け取ることができます。",
  "data/ph-top/2022/1/hirebeat-2-0.json": "ハイアービートは、中小企業が優秀な人材をより早く見つけ、採用するための世界初のオンデマンドリクルーティングプラットフォームです。採用プロセスにおいて、メール、googleドキュメント、スプレッドシートから解放されるよう支援します。",
  "data/ph-top/2022/1/approveit-3-0.json": "⏱ 10分以内に経費承認ワークフローを作成 ✅ SlackやEメールで直接承認を取得、自動リマインダーも可能 🔗 Approveitと会計システム、スプレッドシートを統合 🔃 条件ルールを使用してワークフローをカスタマイズ可能",
  "data/ph-top/2022/1/stonly-no-code-digital-adoption.json": "ロードマップに影響を与えることなく、各ユーザーにパーソナライズされたオンボーディングとトレーニングを大規模に提供します。ガイド、製品ツアー、チェックリストの作成と管理、ホットスポットやツールチップの配置を、わずか数クリックで開発不要で実現できます。",
  "data/ph-top/2022/1/myalice-for-shopify.json": "Shopifyのストアオーナーで、CXチームに1日25時間働いてもらう必要がありますか？または、カスタマーサービスチームのクローンを作ろうとしていますか？- それなら、MyAliceをチェックして、マルチチャンネル販売の可能性を最大限に引き出してください。",
  "data/ph-top/2022/1/teamout.json": "TeamOutは、チームリトリートのための会場を簡単に予約することができます。マネージャーはリトリートの計画に数ヶ月を費やすことがよくありますが、TeamOutはそれをわずか数日で行う手助けをします。その方法とは？数回のクリックで予約できる、堅牢な無線LANを備えた20以上のベッドルームのプライベート空間を提供することです。",
  "data/ph-top/2022/1/indiepaper.json": "IndiePaperは、あなたのようなセルフパブリッシングの著者が、執筆、編集、出版、組版、販売を単一の統合プラットフォームから行うことを可能にします。IndiePaperで次の本を出版し、今日からあなたの本でお金を儲けましょう。",
  "data/ph-top/2022/1/logo-to-use.json": "Logo to Useは、デザイナーが高品質なロゴ（SVGファイル）でデザインプレースホルダーを迅速かつ効率的にリッチ化するための、究極の無料ソリューションです。また、Unsplashに保存されている1億2千万点以上のロゴを、デザイナーとUnsplashに揺さぶることを目的としています。",
  "data/ph-top/2022/1/riku-ai.json": "Rikuは、複数のAIプロバイダを利用するためのプレイグラウンドを1つ提供します。プロンプトを保存して配布したり、コードをエクスポートしたり、コミュニティの残りのためにそれらを公開することができます。最高のプロンプト構築体験のために、1つの中心的な場所で最高の技術で実験してください。",
  "data/ph-top/2022/1/folder-colorizer-for-mac.json": "Folder Colorizerは、散らかったデスクトップで重要なフォルダを目立たせます。それは、フォルダ間をうまくナビゲートするために色に依存しているMacユーザーのために構築されています。あなたは、フォルダの色を変更し、絵文字や特別な画像の背景を追加することができます。",
  "data/ph-top/2022/1/ideabot-io.json": "Ideabotは、起業家やメーカー向けにAIが生成したビジネス＆アプリのアイデアを5つ、毎週配信しています🤖 半自動で、いつも面白いアイデアを5つ選んでから配信するようにしています。639人の購読者が今のところすでに愛用しています。💖",
  "data/ph-top/2022/1/adadot.json": "アダドットは、世界初の開発者のための、仕事用フィットネストラッカーです。生産性向上ソフトウェアやコラボレーションソフトウェアに隠されているデータを活用し、働き方と気分の改善を支援します。科学に根ざしています。GitlabとSlackに統合。",
  "data/ph-top/2022/1/kaedim.json": "Kaedim Platformを使って、2Dのアート、スケッチ、写真を自動的に3Dに変換しましょう。迅速な3D作成、プロトタイピング、イテレーションを費用対効果の高い方法で可能にします。",
  "data/ph-top/2022/1/passporter.json": "Passporterは、旅を簡単、シンプル、秩序あるものにすることで、より良い旅をサポートするコミュニティを通じて、旅のあらゆる局面で旅行者を支援するツールです。",
  "data/ph-top/2022/1/buildergroop.json": "私たちは、より良い未来を築くために努力する、野心的なGEN-Zビルダーたちの多様でオープンなコミュニティです。ハッカソン、スタートアップスタンドアップ、ポッドキャストなど、世界で最も才能ある起業家、デザイナー、開発者、コミュニティビルダーが集まっています。",
  "data/ph-top/2022/1/how-to-create-a-sales-plan.json": "販売計画をゼロから作成するのは大変だと思われるかもしれません。しかし、そんなことはありません。無料の営業計画書テンプレートと実践的なヒントが、この時間のかかる旅のガイドになります。営業計画の各段階については、ベルキンズの「営業計画の立て方」をお読みください。",
  "data/ph-top/2022/1/templateto.json": "シンプルなAPIを使用して、データをPDFやテキストファイルに変換します。アプリでテンプレートを管理 ドラッグ＆ドロップのテンプレートビルダーとLiquidの力を使って、素早くドキュメントテンプレートを作成したり、PDFに変換する必要のあるHTMLを送信するだけでよいのです。",
  "data/ph-top/2022/1/chikamichi.json": "閲覧履歴やブックマーク、タブのファジー検索を可能にする、とてもシンプルなChrome拡張機能です。Sidekickの検索ダイアログにインスパイアされています。日本語の「ちかみち」の意味は、「近道」です。",
  "data/ph-top/2022/1/notiolink.json": "bit.lyのような短いリンクを聞いたことがありますか？VercelとNotionのAPIを使えば、15分以内に無料でカスタムドメイン（例：clarence.link）で構築することができます。",
  "data/ph-top/2022/1/routinie.json": "Routinieは、目標に向かって確実に前進することができる、シンプルかつ効率的な習慣追跡ツールです。トラッカーやタイマー、ストリークや公開ページなど、効率的に自分磨きに取り組める機能が満載です。",
  "data/ph-top/2022/1/vanjaro.json": "超高速マーケティング＆コーポレートサイト、オンラインストア、ランディングページ、ブログ、ポートフォリオを作成するためのコード不要のオールインワンプラットフォームです。統合されたCMS、メンバーシップ、Eメールマーケティング、リードジェネレーション、ブログ、高度なSEOツールであなたのビジネスを成長させましょう。",
  "data/ph-top/2022/1/slick-gradient.json": "CSSカラーをフルに使った美しいCSSグラデーションの厳選コレクション。CSSを簡単にコピー＆ペースト",
  "data/ph-top/2022/1/formula-studio.json": "パワーユーザーの生産性を向上させるために作られたツールで、Googleシートの数式を扱う初めてのコードエディターです。",
  "data/ph-top/2022/1/notionforms.json": "https://notionforms.io/ は、Notion のためのシンプルで美しいフォームビルダーです。既存のNotionのテーブルからフォームを作成し、Notionのページやウェブサイトにフォームを埋め込み、すべてのフォーム送信をNotionで直接受け取れます。https://uncovered-breeze-c02.notion.site/Product-Hunt-NotionForms-Demo-13523146e2e44326ba4e7fc9cd3e3e98!",
  "data/ph-top/2022/1/rainbow-for-android.json": "Rainbowは、楽しく、シンプルで、安全なイーサリアムウォレットで、あなたの資産を楽しく管理することができます。⠀ 🥇 NFTの収集＆表示に最適なウォレット 🦄 内蔵のDeFiインテグレーション 🍎 ETHを直接購入することができる",
  "data/ph-top/2022/1/strelka.json": "犬のしつけは難しい🐶でも、そうであってはならない https://www.strelka.io/ アプリで、あなたの犬の年齢、犬種、性格に合わせた犬のトレーニングコースを受けることができます❤️ インタラクティブなビデオレッスンと実行可能な毎日のタスクで、1日わずか10分であなたの犬をトレーニングします。",
  "data/ph-top/2022/1/notion-fire-finance-dashboard.json": "パーソナル・ファイナンスへの無秩序なアプローチに構造を持たせる。支出を記録し、月次レポートを自動化し、経済的自立を目指しましょう。自動レポート ✔️ 予算と貯蓄の目標を設定/追跡 ✔ FIRE計算機",
  "data/ph-top/2022/1/kaibo-flex.json": "特許取得のオーディオ技術により、クリアな中高音域としっかりとした低音域を実現。細部まで正確に聞き取ることができます。",
  "data/ph-top/2022/1/penplay.json": "PenPlayは、機械学習ベースのお絵かきモバイルゲームで、楽しい体験と教育を一緒に提供します。私たちのゲームは、超素晴らしい機能で強化されています。我々は、このような迅速なペイント、ミラーペイントなど、さまざまなゲームモードを提示します。",
  "data/ph-top/2022/1/referme-acb82013-82ad-4d9f-a5cd-ea86b8ccc8b3.json": "応募する前に、さまざまな企業の担当者に履歴書を提示し、意見を聞く。",
  "data/ph-top/2022/1/iou-beer-bot.json": "IOU Beer Botは、シンプルかつ簡単に、Twitter上で感謝の気持ちを楽しく表現することができます。友達があなたに何かしてくれた？ビール一杯の借りができたと世界中に知らせましょう。",
  "data/ph-top/2022/1/zetup-me.json": "zetup.meは、ユーザーが自分のワークステーションやセットアップのアイテムを友人やフォロワーと共有することができる便利なプラットフォームです。ユーザーは、自分のセットアップにある製品のリンクを追加することができ、アフィリエイトリンクで収益を得ることができます。",
  "data/ph-top/2022/1/wordle-stats.json": "Wordleをプレイして、定期的にTwitterでシェアする？パフォーマンスを把握することができない？友人と比較したいですか？WordleStats を使用すると、次のことができます。1. あなたの毎日のパフォーマンスとストリークを参照してください2。友人と比較する 3. 共有",
  "data/ph-top/2022/1/ikigai-finder.json": "IKIGAIは、日本の概念で、あなたの存在理由を意味します。このテンプレートは、あなたの強み、弱み、興味、ライフスタイルの目標を評価しながら、幸せな生活を送るためのキャリア、副業、趣味を見つけるのに役立つものです。",
  "data/ph-top/2022/1/haile-training.json": "Haile Trainingは、あなたのすべてのワークアウトを記録するのに役立ちます。ワークアウトを作成し、結果をチェックオフ/入力しながら進めていくことができます。",
  "data/ph-top/2022/1/hagrid.json": "あなたは、自分のウェブサイトに人々を集めるために一生懸命に働いています。そして、彼らは彼らが聞きたいことがたくさんある！hagridは、訪問者が質問をし、あなたが応答するノーコードウィジェット、です。",
  "data/ph-top/2022/1/delibr-2-0.json": "ビルトインのユーザーストーリーマップでPRDを共同作成。クリーンな状態で開始し、必要に応じて見出しのテンプレートを挿入します。ドキュメントの一部を Jira 課題として指定し、Jira との完全な 2 方向同期を実現します。質問を入力すると、構造化された意思決定のためのファシリテーションを得ることができます。",
  "data/ph-top/2022/1/identi-2.json": "❤️ サポートしてくれるidentiコミュニティと一緒に成長 🙌 フィードで他の人の進歩に刺激を受ける 🤝 同じ考えの習慣構築者の部族に加わる 👩📸 写真やメモを追加して、日記に進歩を記録 🏫 ビデオによる説明 ➕ その他（コメント参照）。",
  "data/ph-top/2022/1/websites-for-kids.json": "安全で、教育的で、子供と一緒に楽しめるリンク集です。ウェブサイトからポッドキャストまで、料理からビットコインまで、さまざまなトピックがあります。私たちのアーカイブには、すべてが揃っています",
  "data/ph-top/2022/1/mini-photo-editor-for-figma.json": "Figmaの中に入っている小さなフォトエディタプラグインです。",
  "data/ph-top/2022/1/tradefluence.json": "Tradefluenceは、リテール・トレーダーと、市場に関する見識を売り込もうとする金融インフルエンサーを結びつける両面型のマーケットプレイスです。",
  "data/ph-top/2022/1/mintmynft.json": "MintMyNFTは、Polygonが提供するつぶやきをNFTにするための無料ツールです。",
  "data/ph-top/2022/1/notionmail.json": "Notionのページをメールとして送信 ✉️ ⚡&nbsp;Notion で知っているブロックを使ってメールを作成 🛠️&nbsp;Chilipepper などのツールを使ってフォーム回答からメールを自動送信 💰&nbsp;ConvertKit と比較して3K加入者ベースで70％以上節約できます。",
  "data/ph-top/2022/1/ai-powered-youtube-idea-generator.json": "YouTubeビデオの次のアイデアに困っていませんか？毎月のトップトレンドYouTubeビデオのデータでトレーニングされたGPT3モデルで、バイラルビデオのアイデアを生成します。",
  "data/ph-top/2022/1/brand-style-guide-kit.json": "もしあなたが、100ページ以上のスタイルガイドを作成する時間を短縮したい、そして紹介やリピートビジネスにつながるような優れたクライアント体験を提供したいと考えているブランド・ビルダーなら、この製品パートナーシップをチェックしてみてください。",
  "data/ph-top/2022/1/seedscout-2-0.json": "私たちは、技術者同士のより良いつながり方を構築しています。創業者、求職者、投資家は、無料で自分に関する情報をデータベースにアップロードできます。プロプランでは、他のデータベースを見たり、バーチャルスタートアップシティに参加したりすることができます。"
}