{
  "data/ph-top/2022/8/relume-library-2-0.json": "今日、私たちはライブラリ（別名：Relumeライブラリ2.0）を発表します！このライブラリには、以下のようなものが含まれます。その内容は？- 独自のWebflowコンポーネントライブラリを作成、保存、共有できるようになりました。- 275のUntiled UI Webflowコンポーネントへのアクセス - コミュニティが作った最初のライブラリです。",
  "data/ph-top/2022/8/otherweb.json": "クリックベイト、アイキャッチ、自動再生ビデオ、ペイウォール、党派的なエコーチェンバー、その他デジタルマーケティング担当者が次に思いつくようなものはありません。",
  "data/ph-top/2022/8/yolorekt.json": "Yolorektは、ブロックチェーン上に構築された分散型の短期予測市場プラットフォームで、超ゲーム化されたソーシャル価格予測と、最もダイナミックで直感的なユーザー体験を促進しています。",
  "data/ph-top/2022/8/docusaurus-2-0.json": "https://docusaurus.io/、一流のドキュメントサイトをあっという間に完成させることができます！ &nbsp; コンテンツに集中しましょう： Markdownファイルを書くだけです！ 5分でサイトを公開しましょう。プラグイン、テーマ、検索、ブログ、バージョニング、国際化、React...など、充実の機能。",
  "data/ph-top/2022/8/uchat.json": "UChatは、コーディングなしで16以上のソーシャルチャネルでビジネスを自動化するチャットボットビルダーです! オムニチャネル＋統一受信トレイ＆チケットシステム 👉 A.I Powered conversation 🔌 Built-in Ecommerce 👉 Mobile app for live chat 👉 Start free trial Now!",
  "data/ph-top/2022/8/polymath-robotics.json": "Python（ROSではない）を使って、シミュレーションで産業車両の自律行動を設計する。シミュレーションで設計したものは、同じコードを使って物理的な車両で実行することができます。",
  "data/ph-top/2022/8/keyviz.json": "Keyvizは、あなたの⌨️キーストロークをリアルタイムに視覚化するフリー＆オープンソースソフトウェアです！(*^_^*) スクリーンキャスト、プレゼンテーション、コラボレーション、またはいつでも必要なときに押している便利なショートカット/キーを聴衆に知らせましょう。",
  "data/ph-top/2022/8/storebuddy.json": "インスタグラムのアカウント/ショップを、注文を受けることができる完全な機能のEコマースサイトに変換します。登録 👉 インスタグラムアカウントの接続 👉 完了、ECストアを起動 ストアはカスタマイズ可能で、カスタムドメインと接続することができます。",
  "data/ph-top/2022/8/vibesition.json": "Vibesitionは、Spotifyを使って、ある曲のヴァイブから別の曲のヴァイブに遷移するプレイリストを作成することができます。",
  "data/ph-top/2022/8/maybuy-by-up.json": "メイビュウの紹介です。オーストラリアの若者が実際に持っているお金で、実際に好きなものを買えるようにするために作られたUpアプリの機能です。衝動買いとはおさらばです。",
  "data/ph-top/2022/8/remotebase-2.json": "スタートアップとトップ1%のソフトウェアエンジニアの人材をマッチングするマーケットプレイス。Remotebaseのソフトウェアエンジニアは、徹底的な審査を経て、月額固定費ですぐに採用することが可能です。エンジニアは24時間以内に企業とマッチングされます。",
  "data/ph-top/2022/8/threado.json": "Theado のご紹介 - エンゲージメントメトリクスの測定にとどまらない、パワフルで実用的なダッシュボードです。インサイトの取得、ワークフローの自動化、Slack、Discord、その他のプラットフォームでのメンバーの活性化が可能です。あなたの中の 10 倍のコミュニティ・ビルダーを解き放ちましょう。無料でお試しください。",
  "data/ph-top/2022/8/100ms-live-stream-sdk.json": "製品に双方向のインタラクティブなライブストリームを簡単に追加できます。どのブラウザやアプリからでもライブ配信ができ、ストリーマーや視聴者を共同ホストとして招待できます。プリビルド・アプリですぐに始められ、あなたのアプリでカスタム・ライブ体験を作成できます。",
  "data/ph-top/2022/8/backspace.json": "Backspace は、クリエイターのためのオンラインコミュニティをシンプルにします。Backspace は、コミュニティの構築、収益化、運営の過程で従来使用されてきた膨大な数のプラットフォームやツールを置き換えることで、これらすべてを一箇所でネイティブに行うことを可能にします。",
  "data/ph-top/2022/8/upon.json": "ユーザーの注意を一瞬で引きつける必要があります。💛 UpOnを使えば、どんなウェブサイトでもオンボーディングをすばやくデザインし、統合することができます 既製のテンプレートにより、ユーザーリテンションと効果的なエンゲージメントを向上させます。",
  "data/ph-top/2022/8/light-users-by-help-scout.json": "ライトユーザーの導入：ヘルプスカウトの新しいユーザーロールで、権限を制限し、ユーザー単価を抑えたものです。ライトユーザーとは、ヘルプスカウトの新しいユーザーロールです。",
  "data/ph-top/2022/8/daybridge-public-beta.json": "人生には、会議よりも大切なことがある。だから、私たちはこれまでとは違うものをつくろうとしています。私たちは、あなたが仕事を切り上げたり、素敵な旅行を計画したり、約束事を記録したりするのをお手伝いします。グループチャットを始めるように、友だちとの時間を簡単に見つけられるようにしたいのです。",
  "data/ph-top/2022/8/guide-for-project-managers.json": "プロジェクト管理には様々な方法があります。そんなあなたのために、Notionでは便利なリソースをすべて集めました。何百もの厳選されたリソースが一か所に集まっています しかも無料です。",
  "data/ph-top/2022/8/ballpark-research-template-library.json": "UXリサーチ、調査、Figmaプロトタイプなど、30以上のテンプレートにワンクリックでアクセスできます。デザインからコピー、デザインシステムの部品に至るまで、あらゆるものをテストできます。編集、リミックス、独自のブランディングやビデオの説明を追加して、自分だけのものを作ることができます。",
  "data/ph-top/2022/8/imgs.json": "アルゴリズム、ランキング、広告、人が踊るクレイジーなビデオ...。imgsは、お気に入りの写真を共有し、発見し、収集するためのオンラインプラットフォームです。",
  "data/ph-top/2022/8/queue-2d79f3b4-ec26-406b-9d5c-21a5c8a4e6ad.json": "🔥 Queueから新登場! 🔥 スタートアップのために吟味されたフリーランスデザイナーを雇うためのマーケットプレイスです。UI/UX、プロダクト、モーションデザイナーの専門家を雇うことができます。すべてのデザイナーは、ユーザーエクスペリエンス、デザイン、スタートアップとの経験の専門知識を徹底的に審査されます。",
  "data/ph-top/2022/8/browserku.json": "Webスクレイピング、スクリーンショット、PDF生成は、シンプルなHTTPリクエストと同じくらい簡単で、メンテナンスコストもかからないはずです。Browserkuは、これを誰にでも可能にします。",
  "data/ph-top/2022/8/article-rewriter.json": "AISEOのArticle rewriterは、コンテンツの意味を保ちながらリライトすることをシンプルにサポートします。GPT-3をはじめとするAIエンジンを使って、圧倒的なスピードでこれを実現します。",
  "data/ph-top/2022/8/sms-marketing-templates-text-editor.json": "SMSマーケティングは、eコマースで最も急速に普及しているトレンドです。このツールは、SMSマーケティングがいかにシンプルであるかを教えてくれるでしょう。テンプレートをクリックすると、クリップボードにコピーされます。テキストエディターでテンプレートをカスタマイズします。SMSの連絡先に表示される内容を正確にプレビューします。",
  "data/ph-top/2022/8/link-6.json": "LINKは、次世代のためのモバイルソーシャルアプリです。友達を招待してグループプロフィールを作ったり、自分の興味に合った人と出会ったり、近くの限定イベントを見つけたりできます。今すぐダウンロードして、10,000人以上のユーザーの仲間入りをしてください。",
  "data/ph-top/2022/8/500-pro-pitch-decks-by-slidddo.json": "ゼロからプレゼンテーションを作成する？500枚以上のピッチデッキスライドが用意されているライブラリを見てみましょう。最適なスライドを探し、目立つプレゼンテーションを素早く簡単に作成できます。",
  "data/ph-top/2022/8/shuffles-by-pinterest.json": "シャッフルズは、創造的な遊びと集団的なコラージュのための新しいアプリです。画像からオブジェクトを切り取り、コラージュを作成し、アニメーションやエフェクトで命を吹き込みます。",
  "data/ph-top/2022/8/casama.json": "Casamaは、ブラウザの拡張機能や複雑な設定なしに、数分でグループとして資金調達と執行が可能な暗号の取引ポジションを作成することができます。そのため、取引アイデアを友人と共有し、うまくいけば管理手数料を得ることができます。",
  "data/ph-top/2022/8/openbb-bot.json": "OpenBB Botは、高品質なマーケットデータ（例：「SBI-Market」）へのアクセスを簡素化することで、投資リサーチコミュニティをひとつにまとめています。",
  "data/ph-top/2022/8/b2b-customer-journeys-by-hockeystack.json": "HockeyStackは、各アカウントのすべてのステークホルダーから、チャネルを超えたマーケティングとセールスのすべてのタッチポイントを1つのジャーニーに集約しています。5分のセットアップで、あるアカウントの過去のタッチポイントをすべて確認し、そのジャーニーを理解することができます。",
  "data/ph-top/2022/8/craftwork-5.json": "Craftworkマーケットプレイスの新バージョンをご紹介します。世界中の作家が作成したインターフェースアセット、UX/UIキット、イラスト、テンプレートのデジタルストアです。デザイナー、スタートアップ、ブランドにとって、より速くデザインするための大きな助けとなることでしょう。",
  "data/ph-top/2022/8/defi-101-by-brew-money.json": "究極の分散型金融ガイドを作成しました。DeFi101は、全くの初心者のためのDeFiの入門書です。私たちは、業界で最も影響力のある人々と協力し、すべてのコンセプトを分かりやすく解説しています。",
  "data/ph-top/2022/8/superblog-2.json": "Superblogは、WordPressやMediumブログに代わる、圧倒的な速さのブログです。ブログはSEO、コンバージョン、スピードのために自動で最適化されるので、あなたはコンテンツを書くことに集中できます。最大の特徴は？Superblogに \"yourwebsite.com/blog \"を接続することができます。Superblogのブランドはありません。",
  "data/ph-top/2022/8/affiliate-corner.json": "アフィリエイト・コーナーは、最高のアフィリエイト・プログラムを見つけ、ニッチな洞察を数分で解き明かすことができる、あなた専用のリサーチ・ソリューションです。アフィリエイト・マーケティングの研究に費やす時間を100時間、1000ドル節約することができます。SEOの洞察、プロモーション戦略、その他の情報を提供します。",
  "data/ph-top/2022/8/sitekick-ai.json": "Sitekickは、AIランディングページビルダーです。コーディングやデザイン、コピーライティングのスキルを必要とせず、美しいランディングページを作成することができます。",
  "data/ph-top/2022/8/along.json": "動画は、たとえインターネット上であっても、フィルムの黎明期からあまり変わっていません。どのプラットフォームも、いまだに1つの静的なファイルしかアップロードできません。そこで私たちは、インターネットのためのより良いビデオ・プラットフォームを構築することに着手し、それを「Along」と名付けました。現在、iOSで利用可能です。",
  "data/ph-top/2022/8/spinach-io-2-0.json": "Spinach.ioは、より速く、より集中的なデイリースタンドアップの実行を支援します。よりシャープなアップデートを得る。デイリースタンドアップサマリーで全員に情報を提供します。そして、毎日、時間を取り戻しましょう。1チームにつき永久無料です。http://spinach.io で今すぐお試しください。",
  "data/ph-top/2022/8/trickle-3.json": "Trickleは、あなたのチームがコラボレーション、コミュニケーション、ハングアウトできる統一されたワークスペースです。ニュースフィード、埋め込み、ライブスレッド、リアクションにより、誰もが自分のアイデアを発言し、楽しく仕事をすることができます。",
  "data/ph-top/2022/8/lalal-ai-voice-cleaner.json": "LALAL.AI Voice Cleanerは、音声ファイルや動画ファイルから不要な音を除去するAI搭載のノイズキャンセリングオンラインサービスです。最先端の技術で、すべてのノイズとBGMをすばやく除去し、クリアな音声だけを残します。",
  "data/ph-top/2022/8/notion-social-media-kit.json": "ソーシャルメディアチャンネルを計画し、成長させる最も簡単な方法です。このNotion Social Media Kitの中には、ソーシャルメディアアカウントを成長させるために必要なものがすべて入っています。",
  "data/ph-top/2022/8/datamin-2.json": "Dataminは、ビジネスプロセスで生成されるデータに焦点を当てた、データモニタリングとタスク実行のソリューションです。業務に携わるお客様（Payments, Scoring, Revenue, Riskなど）が、データから期待値を設定し、その状況に応じてタスクを実行することを可能にします。",
  "data/ph-top/2022/8/feeeed.json": "私たちは1日に何時間も、私たちの注意を収益化するためにプログラムされたフィードをスクロールして過ごしています。その代わりに、自分自身のフィードを構築しましょう 出版物、ニュースレター、ウェブウィジェット、その他多くのソースを購読してください。広告なし、完全にデバイス上です。あなた自身の条件でスクロールしてください。）",
  "data/ph-top/2022/8/ask-a-doula-by-ruth-health.json": "あなたやあなたのパートナーは、妊娠中または産後5年までですか？質問や好奇心をお持ちですか？ルースヘルスのAsk A Doulaは、どんな質問でも、バースプランでも、授乳のサポートでも、その他のニーズでも、専任のドゥーラに無料でテキストメッセージで無制限にアクセスすることができます。",
  "data/ph-top/2022/8/valt-2.json": "VALTは、一般投資家向けに、オルタナティブ資産に特化した分散型ポートフォリオを提供する初の投資アプリです。Indiegogoの共同設立者と、最大の代替資産検索エンジンであるVincentによって提供されています。",
  "data/ph-top/2022/8/klasshour.json": "Klasshourは、課題、コースワーク、プロジェクトなど、学業上の問題を即座に解決してくれるチューターと学生をつなぐ役割を担っています。すべてリアルタイムで。",
  "data/ph-top/2022/8/hacker-news-slack-bot.json": "Hacker Newsであなたの会社・製品が紹介されたら、Slackで通知してくれるボットです。Powered by Vercel Functions & Upstash.",
  "data/ph-top/2022/8/skybucket.json": "SkyBucketは、様々なソーシャルネットワークやソースからのブックマークを、フォルダを作成し、説明を追加し、フィルタや検索バーを使って組み合わせ、管理するためのオールインワンコンセプトプラットフォームを提供します。デスクトップとモバイルで利用可能です。",
  "data/ph-top/2022/8/highlight-6.json": "Highlightは、お客様の問題を理解し、デバッグすることを容易にします。セッション再生、エラースタックのトレース、ユーザーコンソールの可視化により、Highlightはデバッグの謎を解き明かします。",
  "data/ph-top/2022/8/open-source-saml-sso-by-boxyhq.json": "SAML Jacksonを使えば、1週間以内に導入できるSAMLへの素直な統合を構築するだけです これは、SAMLログイン・フローをOAuth 2.0またはOpenID Connectフローとして実装し、SAMLプロトコルの複雑さをすべて取り除くことによって実現されています。",
  "data/ph-top/2022/8/sprig-concept-usability-testing.json": "Sprigのブラウザベースの非モデレートテストでは、あなたのアイデア、コンセプト、プロトタイプがユーザーに受け入れられるかどうかを、コードを一行も書く前に簡単に知ることができます。そのため、より成功しやすいユーザー中心の製品を構築することができます。",
  "data/ph-top/2022/8/galas-for-podcasters.json": "Galasは、異なるアプリのリスナーを結び付け、忠実なコミュニティにするサービスです： 🔥 あなたのPodcastを育てる 🔥 多くのフィードバックを得る 🔥 GoogleやApple Podcastsリスナーが出会い、コミュニケーションすることができます。",
  "data/ph-top/2022/8/marketing-examples-by-swipewell.json": "ヴィンテージ広告からSaaSの価格ページ、ブラックフライデーのEメールまで、あらゆるものを収録した無料のスワイプファイルです。200以上のカテゴリ、6,000以上のアセットがあり、現在も増え続けています。",
  "data/ph-top/2022/8/best-saas-hero-designs-for-inspiration.json": "SaaSランディングページのヒーロー画像デザイン240点以上をご紹介します。ヒーローセクションは、訪問者の注意を引くものです。私たちのチームが最高のヒーローセクションのリストを作成しましたので、あなた自身のヒーローセクションを考え出すことができます。",
  "data/ph-top/2022/8/insighthack.json": "企業、特許、科学、インフルエンサー、トレンド、ケーススタディ、ユースケースなど、技術的なトピックやデータセットを検索可能なデータベース。登録ユーザーは無制限に利用可能 無料",
  "data/ph-top/2022/8/code-insights.json": "などの疑問にお答えします。最も多くコードを書くのは何曜日か、1日の平均コード時間はどのくらいか、などの質問にお答えします。WakaTimeのプログラミング活動から得られた知見を自動的にコンパイルします。",
  "data/ph-top/2022/8/codeshield.json": "CodeShieldは、AWSのIAM権限を保護するのに役立ちます。これは、過剰な特権を持つIAM権限と特権の昇格を識別します。発見されたすべてのエスカレーション、危険にさらされているリソース、および推奨される修正について、ステップバイステップの悪用ウォークスルーを得ることができます。",
  "data/ph-top/2022/8/notion-starter-pack-4.json": "Notionの仕組みを理解することを目的とした、より生産的で整理された6つのテンプレートのエントリーレベルのコレクションです。テーブル、ソート、フィルタ機能を正しく設定し、ワークスペースがあなたのために働くようにする方法を学びます。",
  "data/ph-top/2022/8/noox-world-2.json": "Noox.worldは、ユーザーがSoulbound NFTとしてWeb3の成果を作成し、証明し、ミントすることができるプラットフォームです。Nooxのビジョンは、プロトコルが純粋にインセンティブに依存せず、強固なコミュニティを構築することを可能にするコミュニティプリミティブを構築することです。",
  "data/ph-top/2022/8/aworker-2.json": "Coinbase、OpenSea、Polygonなど、Web3領域で活躍する企業への就職を支援するサイトです。web3企業で仕事を探しながら、トークンを入手することができます。",
  "data/ph-top/2022/8/momo-3.json": "momoは、どのクレジットカードが一番得なのかを探すお手伝いをするモバイルアプリです。私たちのユーザーは、平均750ドルの追加リワードを獲得しています。",
  "data/ph-top/2022/8/knows.json": "Knowsは世界初のモジュラーシステムを採用したアイウエアです。部品サイズをカスタマイズでき、完璧なフィット感を実現します。もう挟んだり滑ったりすることはありません。あなただけの顔とスタイルにフィットする快適なフレームです。プロダクトハンターのために20％オフで出荷中です。",
  "data/ph-top/2022/8/dun-dun-dunning.json": "オンラインビジネスに携わっている方なら、不本意な解約（支払いに失敗したために顧客が離れていくこと）が嫌なものであることはおわかりでしょう。そこで、この問題の一歩先を行くスーパーアウルがいるとしたらどうでしょう？",
  "data/ph-top/2022/8/170-freelancer-tools.json": "成功したフリーランサーがセクターを超えて使用している最も必要な170以上のツールのカタログです。Notionのドキュメントは、定期的に新しいツールやリソースで更新されます。",
  "data/ph-top/2022/8/radar-by-meshed-labs.json": "Radarは、Web3資産を保護するブラウザ拡張機能です。特徴 🚨レポート -&nbsp; あなたの保留中の取引のリスクスコアを取得します。🖼 - あなたの資産がどのように変化するかを確認します。 🔎 - あなたが信頼するサイトやdAppにいることを知ることができます。",
  "data/ph-top/2022/8/datapad-2-0.json": "Datapadを使えば、すべての指標とKPIをポケットの中に入れておくことができます。チームでのKPIトラッキングが、かつてないほど迅速かつ容易になりました。どこにいても、ビジネスのトップに立ち続けることができます🏝。",
  "data/ph-top/2022/8/klasshour-2.json": "Klasshourは、生徒と独立したチューターをリアルタイムで結び、課題、コースワーク、プロジェクト、重要ポイントの理解、試験やテストの準備など、アカデミックな問題を即座に解決することを可能にします。",
  "data/ph-top/2022/8/saas-product-stack-for-startups.json": "私たちは、スタートアップの実行を改善するための新しいツールを常に探しています。適切なものを見つけるのは難しい。ここでは、あなたのスタートアップや次のサイドプロジェクトのために探索できる製品のキュレーションリストを紹介します。",
  "data/ph-top/2022/8/indie-kids.json": "Indie Makersのお気に入りのテックブランドを使った500枚の印刷可能なカラーリングページ。Indie Kidsにアクセス 👶 好きなブランドのカラーリングページをダウンロード ⚡ 印刷 🌈 子供に色を塗らせる 🚀 あなたが仕事をする間に",
  "data/ph-top/2022/8/email-marketing-funnel-guide.json": "リードジェネレーションにメールマーケティングを使うなら、最も関連性の高い、独占的なリードを誘導することを確認したいものです。このガイドでは、メールマーケティングファネルを効率的に構築する方法をご紹介します。",
  "data/ph-top/2022/8/betterfeedback.json": "BetterFeedbackは、製品チームが顧客のニーズをよりよく理解し、定性データに基づいて顧客が何に困っているかをリアルタイムに発見できるよう支援します。レビュー、サポートチケット、会話などを追加し、ユーザーが何を言っているか、なぜ言っているかを数秒で見つけることができます。",
  "data/ph-top/2022/8/wtfcrypto.json": "WTFcryptoは、暗号に遅れを取らないようにするためのニュースレターです。学生からおじいちゃんおばあちゃんまでの読者が、ユーモア、例え話、写真を通して暗号の重要な概念を把握できるように、週2回配信しています。",
  "data/ph-top/2022/8/do-better-with-less.json": "10日間の無料チャレンジで、顧客転換の最も無駄のない方法を解き明かしましょう。各チャレンジとレッスンは、あなたの受信トレイに直接配信され、プレイして勝つことができます。",
  "data/ph-top/2022/8/way-2-0.json": "より多くの訪問者をコンバージョンさせるカスタムランディングページを作成します。コーディングは必要ありません。テンプレートと、すぐに使えるたくさんのコンポーネントで、あなたのページを美しく、パワフルにします。30秒以内でランディングページを公開し、結果を出し始めることができます。",
  "data/ph-top/2022/8/userloop.json": "UserLoopは、eコマースブランドがファネルの各ステージで顧客を調査することを支援します。回答はShopifyのデータにリンクされ、最も価値のある顧客が何を求めているかを特定するのに役立ちます。アンケートに答えてくれたお客様には、ユニークな割引コードでインセンティブを与えることができます。",
  "data/ph-top/2022/8/txtmoji.json": "Txtmojiは、テキストを絵文字に暗号化し、パスワードで絵文字をテキストに復号化することができます。",
  "data/ph-top/2022/8/peerlink.json": "Peerlinkは、あなたのコーチングビジネスのためのウェブページを構築し、1:1プログラムをオンラインで販売し、顧客とのアポイントメントを管理する最も簡単な方法です。",
  "data/ph-top/2022/8/flappy-musk.json": "Flappy Muskは、初心者に優しい、楽しいインタラクティブなミームです。無料で遊ぶこともできますが、その代わりに「遊んで稼ぐ」を選択すると、賞金総額50ドルのトーナメントに毎日参加することができます!",
  "data/ph-top/2022/8/otternal-life.json": "毎日、小さなことでも努力することが、長い目で見れば大きな影響を与えます。難しいのは、その勢いを始めること、そしてそれを維持することです。Otternal Lifeのレジナルド（あなたの専属オトラー！）が、あなたの習慣づくりの旅を活性化するお手伝いをします。",
  "data/ph-top/2022/8/tomodoro.json": "Always On Top PIPモード、ホワイトノイズ生成、タスク、クールなテーマなど、クールな機能を備えたポモドーロ・ウェブアプリを、お気に入りのブラウザでお楽しみください。しかも、無料でオープンソースです。",
  "data/ph-top/2022/8/traek-io.json": "Traek.ioは、Webサイトオーナーが直面するいくつかの問題を解決するために、WebサイトオーナーによってWebサイトオーナーのために設計されたSaaSツールです。Traekは、リードジェネレーション、データ分析、訪問者の行動、チャット、トラフィックの監視、およびアラートに焦点を当てています。",
  "data/ph-top/2022/8/formbold.json": "パワフルなウェブフォームソリューション - あらゆるホスティングプラットフォームやフレームワークで動作し、コーディングやサーバーサイドの依存関係なしに、静的フォームを数秒で完全に動作させることができます。サイトフォームの送信をメール、Slack、Telegram、Notion などで直接受信できます。",
  "data/ph-top/2022/8/time-os.json": "デジタルワークスペース内のすべてを計画、レビュー、反映、追跡するための時間軸データベースのコレクションです。",
  "data/ph-top/2022/8/formosal.json": "Formosalは、美しいインターフェイスを持つオンラインフォームとアンケートのビルダーです。",
  "data/ph-top/2022/8/preset-bucket.json": "数回のタップで、プロカメラマンのように写真を編集できます。50 以上のスタイルを持つ 1,200 以上の Adobe Lightroom プリセットにアクセスできます。生涯アクセス ✅ 高画質プリセット ✅ 使いやすい ✅ インスタントダウンロード ✅ お金を節約する",
  "data/ph-top/2022/8/hhhue.json": "🎨デザインプロジェクトのために、美しくまとまった色を選ぶ簡単な方法。✨ 異なる背景色の上やフルスクリーンでパレットをプレビューし、パレットのカラーコードをRGB、HSL、HEXのいずれかで一度にコピーすることができます。",
  "data/ph-top/2022/8/carbos.json": "Carbosは、日常生活で簡単に使える炭水化物計算アプリです。糖尿病患者のための1日の炭水化物摂取量を計算するためのツールです。血糖値のバランスと糖尿病を維持するために、カーボスの使い方をご確認ください。",
  "data/ph-top/2022/8/cronit.json": "Cronitはオンラインクローンジョブサービスです。Cronitを使用すると、コードを入力したりサーバーを設定することなく、ブラウザからオンラインで定期的なタスクを定義、スケジュール、実行することができます。",
  "data/ph-top/2022/8/clickpod.json": "ClickPodは、トップ4カテゴリーにおけるトップオピニオンリーダーのベストポッドキャストを探し、発見し、聴くことができるようにします。",
  "data/ph-top/2022/8/joyline.json": "Joylineは、あなたのお気に入りの写真をプリントして、画面よりプリントを好むあなたの大切な人に毎月お届けします。",
  "data/ph-top/2022/8/deepchecks-testing-package-1.json": "手遅れになる前に、MLモデルやデータの問題を見つけよう! Deepchecksは、わずか数行のコードで、データの整合性、分布、モデルの性能に関する精巧なレポートを作成します。",
  "data/ph-top/2022/8/buddy-crush.json": "アカウンタビリティ・グループを作ったり、参加したりして、自分の習慣を追跡することを始めてください。モチベーションと説明責任を維持するために、一貫性リーダーボードを競い合うことができます。目標を達成するのが楽しくなる時間です。",
  "data/ph-top/2022/8/ironov.json": "AIデザイナーであるIronovは、デザイン業務を請け負い、瞬時にロゴのアイデアを出すことができる。24時間365日利用可能です。Ironovのニューラルネットワークとアルゴリズムは、非常に独創的で、場合によっては全く予想外の結果を生み出します。",
  "data/ph-top/2022/8/wind4tune.json": "従業員やパートナーに贈る、定期購入型のギフトサービス。ギフトオプションを1つ選択すると、あとは私たちにお任せください🙂 - e-グリーティングカードサービス 💌 - 法人向けケーキ配送サービス 🎂 - 法人向け商品配送サービス 👚 - ギフトオプションを1つ選択すると、あとは私たちにお任せください。",
  "data/ph-top/2022/8/instagreen.json": "Instagreenは、オンラインのライフフェイクサービスです。インスタグラムのために地球をゴミにする代わりに、今は写真だけを手に入れることができます。プライベートジェット機からステーキビュッフェまで、何千枚もの写真があります。パッケージをダウンロードし、投稿を開始します。",
  "data/ph-top/2022/8/communityscout.json": "コミュニティ・プラットフォームの選定にかかる時間を短縮します。この無料コミュニティ・ツールを使って、あなただけのおすすめプラットフォームを手に入れましょう。この無料ツールは、60以上の要素に基づいて最適なコミュニティ・プラットフォームを推奨するために作成されました。",
  "data/ph-top/2022/8/l62-ng.json": "あなたのリンクは簡潔で導線になりすぎていませんか？それならloooooooooooooooooooooooooooooooooooooooooooooooooooooooooo.ngが完璧な解決策です。このURL lengthenerはあなたのURLの長さを一桁伸ばします!",
  "data/ph-top/2022/8/craiyon.json": "Craiyon（旧DALL-E mini）は、任意のテキストプロンプトから画像を描画することができるAIモデルです。",
  "data/ph-top/2022/8/charged.json": "Chargedは、優れたデザインの電気製品を厳選し、人類の再生可能エネルギーへの移行を支援するものです。",
  "data/ph-top/2022/8/easier-gradients-for-figma.json": "Figmaのプラグインで、あなたの生活を便利にします。Easier gradientsは、グラデーションの反転や、正確な角度の選択など、いつも面倒に思っていることを手助けしてくれます。Figmaのグラデーションを、もっと簡単に。",
  "data/ph-top/2022/8/wordbook.json": "Wordbook は、YouTube での学習を邪魔しないオールインワンソリューションです。コースへのリンクを持ってきて、キャプションを取得し、任意の単語をクリックして定義を取得し、あなたの個人的な単語帳に保存します。20 個の Chrome タブを削除して、学習を開始します。",
  "data/ph-top/2022/8/heyhack-scan.json": "Heyhack Scan - ブラウザベースの革新的なアプローチで実際のハッカーセッションを模倣することにより、倫理的ハッカーのレベルを超える自動ペネトレーションテストソリューションです。あなたのウェブアプリを100％テストします。1分でテストを開始できます。無料でお試しください",
  "data/ph-top/2022/8/freemance.json": "Freemanceは、フリーランサーのプラットフォームと私たち自身のコイン$FREを嫌うという共通点で結ばれた、独立したフリーランサーのコミュニティとディレクトリです。",
  "data/ph-top/2022/8/hanko.json": "ハンコは、パスワードを超えた旅に出るための、軽量なオープンソースのユーザー認証ソリューションです。より良いセキュリティ、より高いコンバージョン率、そしてよりハッピーなユーザーのために。数分で次世代ログインを構築し、もう過去を振り返ることはありません。",
  "data/ph-top/2022/8/fundraising-template-2-0.json": "このNotionテンプレートは、あなたのスタートアップのための資金調達を成功させるのに役立ちます。投資家CRM、ピッチデッキコンテンツビルダー、メールコミュニケーション用テンプレートなど、さまざまなツールを備えています。",
  "data/ph-top/2022/8/palette-maker.json": "Palettemakerは、ロゴデザイン、UI/UX、パターン、ポスターなど、最も一般的なクリエイティブ分野の既成のデザイン例でカラーパレットを作成し、その動作をテストすることができる、クリエイティブプロフェッショナルと色好きのためのユニークなツールです。",
  "data/ph-top/2022/8/allo-2.json": "Alloは、分散したチームとしてのコラボレーション、エンゲージメント、および連携を維持するための総合的なソリューションです。ダッシュボード、目標設定、プロジェクト管理、デジタルホワイトボードなど、Alloはリモートワークをより簡単に、より視覚的に、そしてより楽しくするお手伝いをします。",
  "data/ph-top/2022/8/dagster-cloud.json": "開発ライフサイクル全体をカバーするクラウドネイティブオーケストレーターで、統合されたリネージと観測性、宣言型プログラミングモデル、クラス最高のテスト容易性を備えています。",
  "data/ph-top/2022/8/vev-2.json": "Vevは、開発者、デザイナー、マーケティング担当者のために作られた新しいタイプのWeb作成プラットフォームです。ノーコードとコードを組み合わせることで、プロフェッショナルなチームが創造的かつ技術的に完全に自由な状態で、最もワイルドなアイデアをウェブ上で公開できるよう支援します。",
  "data/ph-top/2022/8/the-founder-hotline.json": "アーリーステージのファウンダーに悩んでいる方 1-888-890-2656 (フリーダイヤル) に電話すると、数年前にあなたと全く同じ立場にいた経験豊富なビルダーや創業者と何でも話し合うことができます。",
  "data/ph-top/2022/8/prelaunchers.json": "Prelaunchersは、ユーザーが自分の問題に対して興味深い製品/アプリケーションを見つけ、メーカーと結びつけ、誰よりも早くその製品を採用することを支援します。",
  "data/ph-top/2022/8/playcode-javascript-sandbox-playground.json": "PlayCodeは、コードを入力すると、即座に追加タブでプログラムした内容を表示してくれるウェブサイトです。プログラミング言語やフレームワークを選択するだけで、何も設定する必要がなく、すぐに始めることができます。",
  "data/ph-top/2022/8/seo-for-product-market-fit-saas-startups.json": "サーチエヴァのSaaS SEO専門家チームは、初期段階を過ぎたSaaSスタートアップに特に役立つであろう、製品・市場適合段階を認識し乗り切るための実践的なアドバイスと洞察に満ちた総合ガイドを編集しました。",
  "data/ph-top/2022/8/flipped-off.json": "宇宙最大の中指コレクションで、あらゆるケースを想定しています。",
  "data/ph-top/2022/8/instagram-downloader-418e084d-b68e-465d-af49-11d1ab436f6a.json": "IGDLは、InstagramのDP、リール、写真、ビデオ、IGTV、ストーリー＆ハイライトをダウンロードする際に役立つツールです。モバイル、タブレット、パソコン、どのデバイスでも簡単に使用できます。",
  "data/ph-top/2022/8/suggestic-api.json": "SuggesticのAPIは、GraphQLをベースとした料理、レシピ、レストラン、食事計画の統一APIです。パーソナライズされた食事計画、USDA食品データベース検索、パーソナライズされたジャーニーにより、Suggesticは素晴らしい食品と健康アプリを簡単に構築することができます。",
  "data/ph-top/2022/8/ammersive.json": "Ammersiveは、「8D/3D/Spatial」と表現されるような、体験的な没入型オーディオのためのユニークなプラットフォームです。ボイスアーティスト、サウンドデザイナー、ライターによって制作され、リスナーをさまざまな領域、アイデア、コンセプトへの聴覚の旅に誘います。",
  "data/ph-top/2022/8/meet-jules.json": "購入履歴をもとにカーボンフットプリントを計算し、自分の立ち位置を把握することができます。あなたが信じるプロジェクトや技術を選んでください。計算された二酸化炭素排出量を毎月オフセットすることで、あなたのお金がソリューションの一部となることを実感できます。",
  "data/ph-top/2022/8/cilo.json": "Ciloの使いやすいフットプリントトラッカーは、あなたが購入した製品の炭素コストを確認し、個人的な削減のヒントを得て、友人や家族と気候変動目標の達成を競うことができます。",
  "data/ph-top/2022/8/workhub-spaces.json": "WorkHub Spacesを使えば、同僚や顧客との会話を1つの場所で継続することができます。",
  "data/ph-top/2022/8/companies-tools.json": "Product Huntのチームは、Notion、Zoom、Canva、Typeform、GitHub、Figma、Slack、その他6つのアプリを使用しています。約50チームがProduct Huntを使っています。これでも、300以上の技術チームが利用しています :)",
  "data/ph-top/2022/8/notion-to-do.json": "Notionに情報を入力するのは面倒です。そこで、そのお手伝いをするために、簡単で早い方法を作りました。それも、無料のNotion ToDoアプリです。あなたのものをNotionに直接入力する最速の方法です。さらに、あなたのすべてのNotionダッシュボードと安全に同期します。",
  "data/ph-top/2022/8/thestocks-v3.json": "TheStocks v3は、デザイナーに関連するあらゆる製品を毎日キュレーションし、分類しています。毎日新しい商品が追加されているので、デザイン分野の新商品を発見するためにいくつものウェブサイトをチェックする必要はありません。",
  "data/ph-top/2022/8/svix.json": "Webhookは面倒だ。開発者は配信の可否、再試行、監視、セキュリティについて心配する必要があります。Svixを使えば、最先端のWebhooksソリューションを数分で構築できるので、ビジネスに集中できます。",
  "data/ph-top/2022/8/umu-ai-audio-slides.json": "スピーカーノートとプロフィール写真付きのスライドデッキがあれば、すぐにプロフェッショナルなビデオコースを作成することができます。ボタンをクリックするだけで、退屈なコンテンツがAI技術によって自動的に楽しいマイクロラーニングの講義に変身します。",
  "data/ph-top/2022/8/1password-8-for-ios-and-android.json": "カスタマイズ可能なホーム画面で、自分好みに。Watchtower ダッシュボードで常に最新の情報を入手できます。iOS と Android 向けの 1Password が新しくなり、新鮮でモダンなデザインと、これまでで最もパーソナルなモバイル体験が実現しました。",
  "data/ph-top/2022/8/beanvest.json": "株式、ETF、ミューチュアルファンド、暗号通貨を含む25万以上の資産を追跡します。もうスプレッドシートを使って投資を記録するのはやめましょう。Beanvestは、あなたが手作業で行っていたことをすべて行い、さらにそれ以上のことも行います。",
  "data/ph-top/2022/8/random-icebreakers-by-parabol.json": "次の会議やイベントに最適なアイスブレーカーを見つけよう。このオープンソースのランダムアイスブレーキジェネレータでは、330以上のユニークで楽しいアイスブレーカーを厳選しています。すべてのアイスブレイクの質問は、多様なグループに対応できるよう吟味されています。",
  "data/ph-top/2022/8/trackify.json": "Trackifyは営業チームのKPIトラッキング、レポート、予測をエンドツーエンドで行うためのソフトウェアです。これは、何らかのアウトバウンドメッセージを送信したり、営業電話を受けたり、営業チームを持つすべての人のためのものです。また、営業担当者のモチベーションを上げるためのリーダーボードも備えています。",
  "data/ph-top/2022/8/lumina-desk.json": "ルミナデスクは、健康と生産性のためのデジタルデスクです。カレンダーの招待を見たり、電話やチャットの通知を受けたり、健康状態をモニターしたりと、様々なことができます。アプリをインストールして（または自分で作って）カスタマイズすることもできます。",
  "data/ph-top/2022/8/swipewipe.json": "あなたのカメラロールは汚れていませんか？Swipewipeを使えば、簡単に少しずつきれいにすることができます。写真を削除するには左にスワイプし、残すには右にスワイプします。完了した月にはチェックマークが入り、未完了の月にはプログレスホイールが表示されるので、あとどれくらいで完了するかがわかります。以上です。",
  "data/ph-top/2022/8/programming-knowledge-map.json": "このインタラクティブなナレッジマップは、プログラミングを始めるにあたって学ぶべきトピックを視覚化するために作成しました（放射状と直線状のモードがあります）。",
  "data/ph-top/2022/8/zuddl-studio.json": "Zuddl Studioは、新興企業、企業、代理店がスタジオ品質のビデオコンテンツを制作、録画、配信できるようにし、年間90％以上の制作コストと時間を削減します。イベント、ウェビナー、ライブストリーミングのためのパワフルなウェブベースのDIYソリューションです。",
  "data/ph-top/2022/8/vinovest.json": "ヴィノベストは、高級ワインへのアクセスにより、投資ポートフォリオを多様化することができます。この資産クラスは、伝統的に株式との相関が低く、年率2桁のリターンを上げています。",
  "data/ph-top/2022/8/convo-cash.json": "SMSのようなメッセージングプラットフォームでユーザーからの支払いを簡単に受け取り、より多くの収益を確保することができます。SMSの会話をデザインし、モバイル決済インターフェースを自動的に生成し、ユーザーからの現金の受け取りを開始します。1回の取引につきわずか5%です。",
  "data/ph-top/2022/8/xoforms-by-xobin.json": "XoFormsは、応募者の全行程を管理します。応募者からのビデオ回答、さまざまなバケットへの分類、評価によるスクリーニング、スコアに基づく応募者の自動絞り込み、非同期でのよりパーソナライズされた質問などを行うことができます。",
  "data/ph-top/2022/8/announcekit-2-0.json": "AnnounceKitは、製品チームが製品のアップデートやニュースを顧客に伝え、機能の採用を増やし、顧客の信頼を構築することを支援します。",
  "data/ph-top/2022/8/whist.json": "Whistは、あらゆるWebサイトの処理をクラウドにオフロードする「クラウドタブ」を搭載した初めてのブラウザです。重いウェブサイトがRAMを消費したり、コンピュータの速度を低下させたりする場合、ボタンをクリックするだけでクラウドタブを有効にすることができます。",
  "data/ph-top/2022/8/n8n-community-nodes.json": "n8nのセルフホスティングインスタンスに、ボタンを押すだけでコミュニティノードをインストールし、使用することができます。また、自分のノードを他の人が利用できるようにすることもできます。",
  "data/ph-top/2022/8/tweetnest.json": "TweetNestは、最高水準の本格的なTwitterエンゲージメントを実現する、最高のTwitterグロースプラットフォームです。高速で本物のフォロワーを取得します。あなたのような他のアカウントと係合することによって、あなたの聴衆を構築し、成長し、収益化する.",
  "data/ph-top/2022/8/awesomic-for-webflow.json": "Awesomicのスタートアップ向けオールインワンプランで、デザインとWebフロー開発に必要なものを1つのアプリで手に入れることができます。ロゴデザイン、ランディングページデザイン、ウェブフロー開発など、様々なサービスを月額定額制でご利用いただけます。Awesomic for Webflowでより早く立ち上げましょう",
  "data/ph-top/2022/8/pinxo-3d.json": "あなたのウェブサイト、アプリ、ソーシャルメディアのデザインに最適な3dシェイプオブジェクトをお届けします。クリックするだけで、どのようなプロジェクトでも使用することができます。私たちの100以上のオブジェクトで、我々はあなたが探しているものを見つけると確信しています。",
  "data/ph-top/2022/8/savvycal-meeting-polls.json": "会議する時間帯を投票してもらい、最も都合の良い時間帯を予約してもらう。無料で利用できます。迷惑な広告はありません。",
  "data/ph-top/2022/8/maindrop.json": "Maindropは、ウォレットの有無にかかわらず、楽しく簡単にNFTを作成し、誰にでも送ることができる方法です。特別な日、Web3のオンボーディング、新しいプロジェクトに招待するとき、または単に「gm」と言うときにもお使いください。",
  "data/ph-top/2022/8/jack-of-cold-mails-by-textcortex.json": "メールキャンペーンを何から始めたらいいのかわからない？この返信数増加のための30種類のテンプレート集は、あなたの「万能選手」になってくれることでしょう。これを使って 私たちは10万人のポットユーザーを獲得しました。🤖 私たちのメール作成AIをトレーニングしました。🤗 我々は、それらが他の人のために働いていることを知っています。",
  "data/ph-top/2022/8/guul-board-games-for-slack.json": "チームのモチベーションを上げたい？グールはそれに最適な方法です! チームビルディングのためのオンラインボードゲームをslackで提供しており、あなたのチームが爆笑することを保証します。",
  "data/ph-top/2022/8/uxpin-and-npm-integration.json": "NPMコンポーネントライブラリを使用して、UXPinでのプロトタイピングを加速させます。完全にインタラクティブなUIの設計を、数時間ではなく数分で開始できます。開発者はプロトタイプから必要なものをコピーするだけです。コーディングのスキルは必要ありません。",
  "data/ph-top/2022/8/zitadel.json": "アプリにユーザーを追加してみよう。ZITADELは、開発者がID管理を統合するために必要なすべてを提供します。オープンソースまたはサーバーレスのクラウドサービスとして提供します。Auth0のように素早く設定でき、Keycloakのようにオープンソースの認証が必要ですか？もう迷うことはありません。",
  "data/ph-top/2022/8/sidekick-ai.json": "Sidekickとは？私たちは、単なるリンクシェアよりも高度で、実際のアシスタントのすぐ下に位置するものと考えています。私たちは、ユーザーが会議を予約するための複数の方法を提供します。",
  "data/ph-top/2022/8/one-thing.json": "メニューバーには、最も重要なタスクや目標を入れます。そこにあることで、煩わしさを感じることなく、あなたを思い出すことができます。このアプリケーションは無料で、macOS 12.3以降が必要です。",
  "data/ph-top/2022/8/gyroscope-v5.json": "ジャイロスコープを一から設計し直し、シンプルなインターフェースで、実際のデータをもとにした新しい洞察をもたらし、科学で長生きすることを支援します。V5では、全く新しいフードトラッキングの体験ができ、新しい無料レベルもあります。",
  "data/ph-top/2022/8/kairon-2.json": "Kaironは、チャットボットのライフサイクル管理プラットフォームです。複数の統合機能により、チャネルをまたがるチャットボットの管理を支援します。テザードチャットボットを数分で作成、監視し、あらゆるチャネルに配備することが可能です。",
  "data/ph-top/2022/8/spot-2-0.json": "Spotは、チームがつながり、コラボレーションし、カルチャーを構築するための完全なソリューションです。ユニークな空間体験と強力なチームチャットの実装を組み合わせることで、ワークエクスペリエンスを次のレベルに引き上げることができます。",
  "data/ph-top/2022/8/logolivery.json": "私たちは、あなたのスタートアップのためのロゴを、安く、早く、そして質的にお手伝いするデザイナー、そしてマネージャーのチームです。💵 $79から（プロモコード使用） ⏰ 納期3日から 🧞♂️ 質の高いサービスを早く、安く得る 😻 そして、私たちはあなたを愛しています。",
  "data/ph-top/2022/8/literal-7ea9b396-3e71-4aa3-8b11-141cd2bdbf45.json": "Literalは、あなたが読んだ本を記録し、信頼できる人たちを通して次のお気に入りの本を発見する場所です。私たちは、個人の好みを尊重し、アルゴリズムよりも友人を信頼し、好きなもののまわりで人々をつなげます。",
  "data/ph-top/2022/8/system-css.json": "System.cssは、1984年から1991年まで稼働していたAppleのMonochrome System OSをベースにしたレトロなUIを構築するためのCSSライブラリです",
  "data/ph-top/2022/8/akurateco-payment-orchestration-platform.json": "プラットフォームで、すべての決済チャネルを効率的に一元管理できます。- 世界中の決済プロバイダと200以上の統合が可能 - 高度な機能により、最大30%以上のトランザクションを承認 - 処理コストを最大50%削減",
  "data/ph-top/2022/8/trellokr-by-conectohub.json": "ConectoHub OKR for Trelloは、アウトカム重視のチームのための強力なプラグインです。会社の目標に沿った形でチームを調整し、全員が同じページに立ち、本当に重要なことに集中することができます。",
  "data/ph-top/2022/8/roivenue-2.json": "賢いキャンペーンマーケターは、AIアトリビューションを利用して、収益拡大を促進し、利益を増加させます。",
  "data/ph-top/2022/8/coder-3.json": "Coderは、あらゆるOS、IDE、クラウドを利用したリモート開発のためのオープンソースプラットフォームです。リモートリソースを活用して業務をスピードアップし、新しいチームメンバーを即座にセットアップすることができます。",
  "data/ph-top/2022/8/trackabi-2.json": "Trackabiは、ゲーミフィケーションの手法を用いた従業員モニタリング、タイムトラッキング、休暇管理ソフトウェアで、退屈なことを楽しくしてくれます。Trackabiには、Web版、Windows、Linux、macOS用のデスクトップアプリ、iOS、Android用のモバイルアプリがあります。",
  "data/ph-top/2022/8/recoded.json": "あなたのコードの美しい画像や動画をオンラインで作成しましょう",
  "data/ph-top/2022/8/highlighted-for-ios.json": "\"App of the Day\" - Apple, Inc. 本のハイライトを強力にサポートし、読んだことを忘れるのを防ぎます。Highlightedは、本の重要な部分を簡単に記録、整理、再表示、エクスポートできます。",
  "data/ph-top/2022/8/sho-u.json": "Sho-uは、お気に入りの場所を作り、協力し、共有するためのモバイルファーストのアプリです。友達が街にいるのに案内できない？そんな時は、あなたのお気に入りの場所をシェアしてください。この辺りの良い場所を知らない？他の人が共有している場所を発見してください。",
  "data/ph-top/2022/8/minimarks.json": "チームやウェブ愛好家のためのコンパクトなブックマーク・マネージャーとスタート・ページ。コレクションをチームで共有し、記事、レシピ、チュートリアルなど、あなたが出会ったあらゆるものを整理できます。すべてのブラウザーとデバイスで動作します。",
  "data/ph-top/2022/8/wins-2.json": "ウィンズは、窓やワークスペースを整理整頓します。ドラッグやショートカットキーで起動するWinsは、Appleの方法でMacにスプリットウィンドウ機能をもたらすことに尽力しています。システムレベルの統合、高い効率性、Macのシステム機能のようにWinsを使うことができます。",
  "data/ph-top/2022/8/gradientify.json": "Gradientifyはウェブベースのオールインワングラデーションエディタで、あなたの次のプロジェクトのために、100以上の美しく丁寧に作られたグラデーションを提供しています。CSSスニペットのコピー、PNGのダウンロード、素敵なカラーグラデーションの生成、単一色の色合いや陰影を簡単に作ることができます。",
  "data/ph-top/2022/8/fm-radio.json": "FMラジオは、世界中のどこでも、いつでも、お気に入りのFMラジオにチューンインできるインターネットベースのラジオプラットフォームです。約200以上の国から65,000以上のラジオ局を無料でストリーミング配信しています。",
  "data/ph-top/2022/8/srty-link.json": "srty.link は、長い URL を他の人と共有するために設計されたリンクショートナーです。srty.linkを使えば、GoogleドキュメントやYouTubeの動画を同僚やクラスメートと共有する際に、リンク先を全部書き出す必要がなくなります。",
  "data/ph-top/2022/8/pie-chart-maker.json": "パイチャート・メーカー・オンライン 使いやすいツールで円グラフを無料で作成し、円グラフをjpg、png、svgファイルとしてダウンロードできます。あなたの選択に従って円グラフをカスタマイズすることができます。",
  "data/ph-top/2022/8/minimalist-habit-pack.json": "重要なことを記録し始め、目標に向かって前進するための、シンプルで効果的なHabit Packです。",
  "data/ph-top/2022/8/venture-roof.json": "トラクションと資金調達に必要なすべてが1つのパックに - 🔥 ARR0から$1M到達までの知識ベース 🤠 Startup Brain、すべてに関する巨大マインドマップ 💰 20K以上の投資家のリスト 🚀 500以上の加速器リスト 😎 7K以上のアドバイザーが1つのリストに",
  "data/ph-top/2022/8/email-warm-up-by-snov-io.json": "キャンペーンがスパムで終わるかどうかで悩むのはもうやめましょう。Snov.ioのAIによる完全自動のメールウォームアップを使えば、あなたのメールが最もエンゲージメントの高い受信トレイに届くようになります。",
  "data/ph-top/2022/8/digests-by-lockrmail.json": "ダイジェストは、同じ志を持つブランドからのコミュニケーションを1つのメールにまとめ、ご希望の日時に配信することができる強力なツールです。また、フィルターを追加することで、ダイジェストコンテンツをさらにキュレートすることも可能です。",
  "data/ph-top/2022/8/later-cam.json": "Later Camは、あなたの携帯電話を昔の使い捨てカメラに変えます。最大27枚の写真を撮影でき、プレビューや編集は不要です。撮影した写真は、光沢のある4x6プリントとして、現地の使い捨てカメラの半額で自宅のドアに郵送されます。",
  "data/ph-top/2022/8/ux-portfolio-playbook.json": "UXの仕事に就く。ストレスフリーで。応募、面接、最初のUXポートフォリオの作成など。あなたのUXアプリケーションの知識ベースがNotionにあります。",
  "data/ph-top/2022/8/kludd.json": "みんなが書いている。Kluddはみんなのためにある。タイプする。共有する。コラボレーションする。共に成長する。どこでも、どこでも。"
}