{
  "data/ph-top/2022/1/token-around.json": "インテリジェント きびきびしている。素早く。暗号｜メタバース｜NFT｜DeFi インターネット、暗号のトレンド、ソーシャルメディアの活動をアルゴリズムで分析し、世界の暗号コミュニティから100以上のパブリッシャーから20分ごとにクイックサマリーをすぐにお届けしています。",
  "data/ph-top/2022/1/dialo-2.json": "QRコードやショートリンクで簡単にデジタル名刺をデザインし、共有することができます。連絡先アプリに直接、他の人の名刺を追加できます。",
  "data/ph-top/2022/1/tin.json": "Tinは、手動で環境を設定することなく、瞬時に実行可能なアプリケーションを生成できるTeamCodeの製品です。",
  "data/ph-top/2022/1/continuum.json": "クリエイターによるソーシャルプラットフォーム「Continuum（コンティニュアム）」をご紹介します。",
  "data/ph-top/2022/1/pika-2.json": "https://pika.rishimohan.me 無料・http://github.com/rishimohan/pika スクリーンショットを素早く美化するウェブアプリです。背景グラデーションの追加、影の調整、角丸の追加、間隔の調整などができます。PNGファイルとして保存したり、クリップボードにコピーすることができます。",
  "data/ph-top/2022/1/snappify.json": "snappifyは、美しいコードスニペットを簡単に作成・調整することができる優れたツールです。スナップショットにはあらかじめスタイルが定義されていますが、カスタマイズも可能です。",
  "data/ph-top/2022/1/harold-2-0.json": "もう、googleスプレッドシートやNotionのテンプレートを一度更新したら、二度と見ることはありません。ハロルドは、AIを搭載した一風変わったSMSボットで、あなたの習慣をトラッキングします：シンプル👊便利🙌＆楽しい🤓。",
  "data/ph-top/2022/1/sherpa-travel-restrictions.json": "シェルパは、正しい旅行書類を入手し、最新の旅行条件を理解するためのガイドです。独立した情報源であり、いかなる政府機関の後援、提携、資金提供を受けているわけではありません。",
  "data/ph-top/2022/1/menubarx.json": "https://menubarx.app/ は、アプリのように任意のウェブページをメニューバーに固定できる、強力な Mac メニューバーブラウザです。頻繁に訪れるウェブサイトのページや、ネイティブアプリがないウェブサイトでも、MenubarXはユーザーがより効率的かつ便利に使用できるようにします!",
  "data/ph-top/2022/1/open-target.json": "誰もが新しい年に向けて何らかの目標や期待を持っていますが、それを達成するために自分のモチベーションを維持するのは簡単なことではありません。体重を減らすこと、ブログ記事を公開すること、パッシブ収入を得ること、あるいは別のこと。オープン・ターゲットは、自分のモチベーションを維持するための方法なのです",
  "data/ph-top/2022/1/not-boring-habits.json": "学習習慣の行動科学と楽しくて美しいゲームを組み合わせることで、習慣を追跡するだけでなく、習慣を*構築することができます。毎日、ポジティブな習慣をマスターしたり、悪い習慣を退治するための不思議な旅の一歩を踏み出すことができます。",
  "data/ph-top/2022/1/pauseme-button.json": "Zoom通話中にワンクリックでビデオやオーディオをオン・オフできるBluetooth® Video and Microphone Controller（VMC）ボタン。",
  "data/ph-top/2022/1/accountit-2-0.json": "Accountitへようこそ。シンプルでありながら強力な日々の取引追跡ツールで、間違いなくあなたの財務の全体像を把握するのに役立ちます。Accountitを使えば、すべての取引の追跡と整理が可能なほど楽になります。",
  "data/ph-top/2022/1/value-app.json": "NFTのポートフォリオの価値をリアルタイムに把握するシンプルな方法です。",
  "data/ph-top/2022/1/qr-code-generator-99406f64-9c12-425a-9d40-c3b8d0f18cac.json": "QRコードジェネレータは、アプリのインストール、フィードバックの収集、ウェブサイトのプロモーション、Eメールの収集などを支援する、パワフルでシンプルなオールインワンのQRコードジェネレータです！QRコードジェネレータは、アプリのインストールを促進し、フィードバックの収集、ウェブサイトのプロモーション、Eメールの収集などを支援します。",
  "data/ph-top/2022/1/huski-ai.json": "eコマース領域で使用される商標、意匠、NFTなどの著作権コンテンツの使用状況をAIで検索するコンテンツ検索エンジン。ベータ版では、商標権のみを対象としています。",
  "data/ph-top/2022/1/vanillalist.json": "開発者の時間を節約し、高性能なWebアプリケーションを作成するための厳選された最高のバニラJavaScriptプラグインとリソースのリポジトリです。",
  "data/ph-top/2022/1/appmaker.json": "Appmakerは、Shopifyストアをモバイルアプリに変換するノーコードアプリビルダーです。ドラッグ＆ドロップ式のアプリビルダーを使用することで、ストアオーナーはネイティブアプリを簡単に作成し、Appstore/Playstoreにアップロードできるようになりました。AppmakerをあなたのShopifyストアに追加して試してみてください。",
  "data/ph-top/2022/1/tweet100-challenge.json": "#ツイート100は、Twitterでより多くの情報を発信するための100日間の無料チャレンジです。🛠 完全にノーコードで作られています 🤝 1日に最低1回は良いツイートができるようになります 📈 フォローが4000%も増えた人もいます! 🤯 無料で参加するか、コミュニティに参加してください。🚀",
  "data/ph-top/2022/1/life-tracker.json": "人生は貴重であり、あなたの時間も貴重です。あなたの活動を記録したデジタルジャーナルをポケットに忍ばせてください。ライフバランスを整え、集中力と生産性を高めましょう。",
  "data/ph-top/2022/1/interviewkit.json": "InterviewKitは、最大80%の時間短縮を可能にするオールインワン面接ツールです。このアプリは、面接にかかる時間を下げることで、より多くの人に面接をしてもらうための取り組みです。だから、より顧客志向の製品を作り、少しでも良い世界を作るのです❤️。",
  "data/ph-top/2022/1/relingo.json": "Relingoは、あなたが興味を持っていることに基づいて、英語の記事を読んだり、英語のビデオを見たりすることを支援します。",
  "data/ph-top/2022/1/web3jobsboard.json": "ブロックチェーン、暗号、スマートコントラクトのスタートアップから、Web3パラダイムの一端を担うことを望む大手企業まで、Web3分野の求人情報を提供します。",
  "data/ph-top/2022/1/glitch-editor-2022.json": "Glitchのエディターが過去最大のアップデートで最大300%高速化。アセット用の自動Fastly CDN、3Dモデルのプレビュー、インラインエラー報告、Prettierサポートの向上、GitHubインポート/エクスポート+ドメインへのワンクリックでのアクセスを提供します。",
  "data/ph-top/2022/1/kara-pure.json": "史上初、空気から水を作る機械。そして、pH9.2以上のアルカリ性に変える。7種類の希少な天然ミネラルで、水を豊かにする。そして、強力なUV-Cライトで連続的にろ過し、浄化します。毎日10リットルのきれいで安全な水をお届けします。",
  "data/ph-top/2022/1/300-web3-predictions-for-2022.json": "先週、何千人もの人が2022年のWeb3の予測を投稿しました。NFT、DAO、DeFi、P2E、BTC、ETH、L1s、L2sなど、先取りするためのTwitterスレッド上位50を紹介します。",
  "data/ph-top/2022/1/obsidian-flight-school.json": "オブシディアンフライトスクールは、教育製品であり、スターターキットです。オブシディアンという次世代ノートアプリをより速く、より上手に、そしてより自信を持って使えるようにするためのものです。⚡️ かつてないほど速くノートを飛び回れる...思考のスピードで",
  "data/ph-top/2022/1/unlock-7.json": "課金や物流から解放され、パッケージング、バージョン管理、顧客への製品配布からソフトウェアの構築に専念できるようになります。",
  "data/ph-top/2022/1/inboxthis.json": "今日、ウェブページや記事を保存して後で読むには、ブックマークを作成するか、新しいアプリ（例：Pocket）を使用するか、手動で自分にメールを送る必要があり、それは苦痛です😰！しかし、このアプリを使用することで、私たちは、ウェブページや記事を保存して、後で読むことができるようになります。InboxThisを使えば、どんな記事/ウェブページでも1クリックでメールの受信トレイに送ることができます👆。",
  "data/ph-top/2022/1/nft-inator.json": "NFT-Inatorは、手続き的に生成されたNFTプロジェクトの設計と開発を加速させる無償のツールキットです。カスタムデザイン、ランダムデザインの作成、レイヤーの組み合わせのテスト、Solana、Ethereum、Polygon用の画像とメタデータのエクスポートが可能です。",
  "data/ph-top/2022/1/jini-design.json": "デジタル資産のディレクトリにとどまらず、私の近刊「Frontend Schema」で紹介する新しい技術的プロセスを学ぶための試みでもあります。ロードマップはこちら: https://jini.design/?open=roadmap",
  "data/ph-top/2022/1/promoly.json": "Promolyは、クリエーターがオーディオコンテンツをメールやソーシャルメディアに配信するのを支援します。ストリーミング可能なリンク（Soundcloudなど）1つで、オーディオコンテンツをメールリストやソーシャルネットワークに配信するための魅力的なランディングページに変えることができます。",
  "data/ph-top/2022/1/non-nfts.json": "nonNFTsは、オープンソースのAI生成アートワークです。このプロジェクトの背景にあるのは、NFTの実態というよりも、むしろデザイントレンドとしてのNFTの誇大広告である。すべてオープンソースなので、すべてのアートを無料でダウンロードすることができます。",
  "data/ph-top/2022/1/travel-friends.json": "トラベルフレンズは、新しい土地に到着したときに、他の旅行者とつながるためのシンプルなウェブサイトです。地図にピンを追加し、近くにつながる他の旅行者がいるかどうかを探ります。",
  "data/ph-top/2022/1/salescamp-3.json": "Salescampは、セールスサイクルの各ステージで成長を促進するために、カスタマイズ可能なセールススイートです。すべての営業活動を一元管理し、ビジネスにとってより良い顧客を特定することができます。",
  "data/ph-top/2022/1/pollinate.json": "Revueから送信しなくても、Twitterの埋め込みサインアップ機能を使ってメルマガを育てることができるようになりました。beehiiv、Mailchimp、MailerLite、ConvertKit、Ghostと互換性があります。",
  "data/ph-top/2022/1/plask-2.json": "Plaskを使えば、ウェブカメラとブラウザがあれば、誰でもすぐに自分の動きをデジタル化してアニメーション化することができます。",
  "data/ph-top/2022/1/startup-recipes.json": "リーンスタートアップを学ぶのは簡単、実践するのは難しい! スタートアップレシピは、アイデア段階の起業家が最小実行可能製品を正しく構築することによって、できるだけ早く製品と市場の適合性を見つけるのを助けるチートシートです!",
  "data/ph-top/2022/1/ignition-gtm-beta.json": "Ignitionは、PMMとPMチームがより効果的に立ち上げ、プランニングにかかる時間を短縮し、社内の連携を強化することを支援します。ベストプラクティスに基づくワークフローを使用して、製品のタイムラインを予測し、プランを動的に推奨し、プラン/タスク/資産/計測を一元管理します。",
  "data/ph-top/2022/1/creator-resource-kit.json": "Creator Resource Kitは、Youtuber、ミュージシャン、フォトグラファー、ビデオグラファー、ライター、ポッドキャスター、ゲーマーのための1000以上のツールやリソースを集めた無料のコレクションで、常に成長を続けています。創作、配信、管理、学習、収益化、成長、その他を支援するツールです。",
  "data/ph-top/2022/1/verifykit.json": "SMSの代わりにIMプラットフォームを利用した新しい電話番号認証の方法です。WhatsAppやTelegramを利用してユーザーを認証し、認証コストを80%削減する一方、従来のSMSをサポートして、そこにいるすべての顧客にリーチします。",
  "data/ph-top/2022/1/meritverse.json": "Meritverseは、メタバースのためのプロフェッショナルネットワークです。私たちは、あなたのスキルを実証的にアピールし、あなたの成功を支援するインセンティブがあるプロフェッショナルネットワークを構築することを可能にします。🌐",
  "data/ph-top/2022/1/figma-academy.json": "Figma Academyは、Figmaの中で直接行われる実践的なレッスンで、高度な製品デザイン戦術を学ぶ、まったく新しいプログラムです。",
  "data/ph-top/2022/1/shakespeare-ai-email-writer.json": "さようなら、ライターズ・ブロック。SHAKEspeareにあなたのビジネス内容やコールドメールの目的を伝えると、あなたの代わりに文章を作成してくれます。あとは、お好きな原稿を選んで、Mailshakeのキャンペーンに追加するだけです。",
  "data/ph-top/2022/1/showtime-gasless-nft-marketplace.json": "ガス抜き：鋳造＋出品が無料、ガス代も無料。NFTの無料投下も可能! ◆インスタントロイヤリティ（Zoraのようなプラットフォームに対応）。◆最大10,000版まで造幣できる。すべて無料です。◆ 0xPolygonネットワークで環境に優しいNFTを実現。通常よりはるかに高速。",
  "data/ph-top/2022/1/airadvisor.json": "AirAdvisorは、お客様がフライトの中断に対する補償を受けることができるかどうかを確認し、お客様に代わって案件に取り組みます。過去3年以内にフライトの遅延、キャンセル、オーバーブッキングがあった場合、最大で600ユーロ（700ドル）の補償を受けることができる可能性があります",
  "data/ph-top/2022/1/obviously-ai-time-series.json": "私たちは、時間とは過去、現在、未来を捉える最も素晴らしい情報源であると信じています。そのため、私たちはObviously AI Time Seriesを開発しました。これは、特定の日付までビジネス上の重要なイベントを予測する、最も速く、最も正確なノーコードAIツールです。",
  "data/ph-top/2022/1/lohost-io.json": "簡単に言えば、lohostは、あなたがlohostウェブサイトクライアントをインストールした任意のローカルコンピュータからインターネットにウェブサイトを提供する方法です。すべてのファイルをローカルコンピュータに保存し、ウェブサイトが存在するサブドメインを選択します(https://{yourApp}.lohost.io)。",
  "data/ph-top/2022/1/articlestaff-2-0.json": "ArticleStaffは、フリーランスのライターを管理するためのワークフローシステムです。ライターへの報酬支払いやライターからの請求書の管理はもちろん、記事の公開日や各記事の進行状況を把握することができます。"
}