{
  "data/ph-top/2022/3/standwithukraine-using-reface.json": "以前、リフェイスのユーザーは、自分自身をジャック・スパロウやアイアンマンにすり替えたことがあります。今度は、ゼレンスキー大統領に自分をスワップして、ウクライナの国歌であなたの写真をアニメーション化することをお勧めします。戦争についての情報を広め、ウクライナが自由を守るのを助けてください。",
  "data/ph-top/2022/3/web-stories-by-storyly.json": "あなたのウェブサイト上で直接、オリジナルで自動化されたストーリーを作成し、魅力的で教育的、そして行動を喚起することを開始します。Storyly Web Storiesは軽量でページスピードに優れたSDKであり、数分で統合できます。",
  "data/ph-top/2022/3/blockwallet.json": "ブロックウォレットは、暗号のためのシークレットモードで、使い慣れたユーザーフレンドリーなウォレット体験に高度なプライバシーツールを備えています。ブロックチェーン上で金融のプライバシーを取り戻しましょう - 今なら簡単です。",
  "data/ph-top/2022/3/tech-for-ukraine.json": "#TechForUkraineは、Tech To The Rescueが、紛争中のウクライナを支援する国際的な非営利団体とIT企業をマッチングさせるキャンペーンです。すべての技術系企業の参加を歓迎し、必要なところに支援を提供します。",
  "data/ph-top/2022/3/common-paper.json": "Common Paperは、双方が納得できる契約書を作成、交渉、締結することで、より迅速なクロージングを支援する構造化された契約書プラットフォームです。経験豊富な技術系弁護士の委員会によって作成された、無料のオープンソース契約書をベースに構築されています。",
  "data/ph-top/2022/3/craftmypdf.json": "コード不要! ドラッグ＆ドロップで簡単にPDFテンプレートをデザインし、再利用可能なテンプレートとJSONデータからピクセルパーフェクトなPDFドキュメントを生成することを可能にします。デモ: https://craftmypdf.com/live-demo-pdf-template-editor/",
  "data/ph-top/2022/3/character.json": "異なるトピックのカードをスワイプすると、価値観やユーモアなどに基づいたマッチングが行われます。例を添付します。クールな人たちに出会えることを祈っています。❤️ zoomやホームオフィスから一旦離れて、チェックしてみてください🤗。",
  "data/ph-top/2022/3/socket-2.json": "オープンソースのサプライチェーンに潜む悪意のある依存関係からあなたのアプリを守るためにSocketに依存してください。マルウェア、タイポスクワッティング、隠しコード、誤解を招くパッケージなど、オープンソースコードの60以上のレッドフラグをブロックします。",
  "data/ph-top/2022/3/this-interview-does-not-exist-2.json": "This Interview Does Not Existは、自然言語AI（GPT-3）を用いて、あらゆる職種の面接質問を生成しています。また、AIは自分の質問にも答えてくれます -&nbsp;it's crazy ⚡️。",
  "data/ph-top/2022/3/appliku.json": "Applikuは、GitHubやGitLabから自動的にサーバーを立ち上げ、Webアプリケーションを実行します。5分未満でセットアップし、クリックしてデプロイします。Applikuはあなたの個人的なDevOpsとして考えてください。",
  "data/ph-top/2022/3/flightcontrol.json": "Herokuは制限が多すぎるし、値段も高い。AWSは複雑すぎる。私たちは、世界トップクラスのデプロイメントDXをお客様のAWSアカウントにネイティブに導入することで、この2つを解決します。",
  "data/ph-top/2022/3/dotling.json": "ドットリングは、パフォーマンス、手頃な価格、アクセシビリティを損なうことなく、高いデザインの柔軟性を備えたWebサイトビルダーです。誰でも、何でも作れるように作られています。",
  "data/ph-top/2022/3/meteosales.json": "時間が経てば消えていくトレンドとは異なり、天候が消費者の行動に与える影響は絶え間ない。メテオセールスのアルゴリズムとAIは、お客様のEコマースにおける特定の天候に商品、バナー、CTAを関連付け、より良い販売、より高いコンバージョンを実現するために働きます。",
  "data/ph-top/2022/3/freshflows.json": "Freshflowsは、プロダクトマネージャーやメーカーにとって夢のような製品です。フレッシュフローズは、壁とワークスペースを中心に構成されています。FFの目標は、製品管理を民主化し、個人事業主を含むすべての人がそれを利用できるようにすることです。今すぐパブリックベータ版を入手",
  "data/ph-top/2022/3/fweb3.json": "web3で学び、構築する。 ブロックチェーン（この場合はPolygon）上で何かをすることで点灯する9つのドットがある。全て点灯させると、追加の$FWEB3トークンと記念のNFTが当たります。",
  "data/ph-top/2022/3/hearty-journal.json": "- 軍用レベルの暗号化でデータの安全性を確保 - 手書きスタイルの日記帳で幸福度をアップ - 1,300以上のステッカーで投稿を装飾 - 写真やYouTube動画を追加して日記をより鮮やかに - 親友や恋人と交換日記を作成可能",
  "data/ph-top/2022/3/fogbender.json": "既存のサポートツールは、すべて一人のユーザーと話をするために作られています。B2Bベンダーは、チームと対話するために、アカウントごとにSlackの共有チャンネルを設定します。Fogbenderは、共有チャネルのような体験を直接顧客ダッシュボードに埋め込むことを可能にします。",
  "data/ph-top/2022/3/content-analytics-by-dreamdata.json": "\"自分のコンテンツは収益に影響するのか？\" 🤷 https://dreamdata.io/content-analytics は、コンテンツがビューをドルや取引に変えているかどうかを示すために推測を止める Ὅ Dreamdataは、マルチユーザー、マルチセッションのB2Bバイヤージャーニーを追跡し、コンテンツをパイプラインと収益に結びつける。",
  "data/ph-top/2022/3/pixoo.json": "Pixooは、毎週成長する3Dイラストの販売に特化したプラットフォームです。ビジネス、ライフスタイルなど、様々なジャンルの3Dイラストを、月額課金でご利用いただけます。",
  "data/ph-top/2022/3/asset-money.json": "NFTトラッキング」ツールは存在しますが、多くの場合、NFTのフロアプライスしか表示されません。Asset Moneyは、NFTを管理し、レア度や特徴などに基づいてその価値を推定することができるプラットフォームです。",
  "data/ph-top/2022/3/devstream-1.json": "DevStreamはオープンソースのDevOpsツールチェーンマネージャで、1コマンドで5分以内に柔軟なDevOpsツールチェーンをセットアップすることができます。https://github.com/merico-dev/stream ツールの設定、管理、自動化を簡単に行うことができます。",
  "data/ph-top/2022/3/snippyly-sdk.json": "Snippylyは、FigmaやGoogle Docsのように、Webアプリをマルチプレイヤー化するSDKです。Y",
  "data/ph-top/2022/3/help-ukraine-widget.json": "あなたのウェブサイトにウクライナ支援ウィジェットを設置し、顧客や訪問者にロシアの侵略を阻止するための方法を知ってもらいましょう。ウィジェットは信頼できる情報源とリンクしており、寄付をしたり、ウクライナの戦争に関する事実上の情報を得ることができます。",
  "data/ph-top/2022/3/sales-onboarding-playbooks-by-accord.json": "Winning Playbooks - Free to replicate & customize 🖼 Multiple use cases: Sales-lead, PLG, onboarding, POCs 📈 Proven sales & onboarding motions from top startups 🚀 Founder-led Seed stage → Growth scale 👉 inaccord.com/playbook-gallery",
  "data/ph-top/2022/3/polywork-2.json": "仕事、プロジェクト、経験、コラボレーションを紹介するためのAI対応コミュニティとキャリアプラットフォーム、「あなたが何ができるかを世界が知ることが重要です」。",
  "data/ph-top/2022/3/supertrivia-for-web.json": "SuperTriviaは、あなたのウェブブラウザで楽しいトリビアを提供します。インストールもサインアップも必要ありません。同僚、友人、ファンなど、大人数で楽しむのに最適です。50以上のトピックと5k以上の問題で、ステロイドのKahootのようなものです。SuperTriviaは完全に無料です!",
  "data/ph-top/2022/3/contentideas-io.json": "ContenIdeas.ioは、キーワード、ドメイン、著者、またはこれらの組み合わせで検索するだけで、あなたのニッチに関連するトレンドや高パフォーマンスのコンテンツを見つけることができる100％無料のコンテンツディスカバリーツールです。",
  "data/ph-top/2022/3/fellow-3-2.json": "最新のフェロー機能、統合、改善で世界一のミーティングホストになる! 紹介するのは... アジェンダセクション、タグ、ミーティングタイマー、ミーティングフィードバック、アシスタントへの委任アクセス、🌈 ClickUpの統合、その他多数",
  "data/ph-top/2022/3/nautomate.json": "Nautomate は、Apple Shortcuts に強力な Notion のネイティブアクションを追加し、ワークスペースを自動化することができます。⠀",
  "data/ph-top/2022/3/easy-business-card-generator.json": "現代の生活は複雑です。デジタルビジネスIDを管理するアプリ、Quantz.cardsでそれを簡素化しましょう。",
  "data/ph-top/2022/3/winter.json": "Winterは、あなたの顧客がクレジットカードや銀行口座でNFTを購入するのをサポートします。Winterでは、簡単にインストールできるNFTチェックアウトウィジェットで、簡単にNFTを販売することができます!",
  "data/ph-top/2022/3/hardcover.json": "ハードカバーは、読んだ本や読みたい本を記録し、他の読者と永続的なつながりを持ち、人生を変えるような本と出会うためのソーシャルネットワークです。私たちは、反Amazon、親著作者、フィードバックを積極的に追求し、まだ始まったばかりです。📚",
  "data/ph-top/2022/3/rownd-auth.json": "Rownd Authは、コードスニペットにより、ブランドのすべてのWebサイトに摩擦のない認証とアカウント作成を追加します。Jamstack、Webflow、Wordpress？問題ありません。開発者は、サーバーサイドの呼び出しなしにローカルでプロファイル情報を使用し、ユーザー向けにあらゆるサイトをカスタマイズすることができます。",
  "data/ph-top/2022/3/karma-wireframe-kit.json": "Karmaは、900以上のユニークなブロックと組み立て済みの部品で構成された、丁寧に作られたワイヤーフレームキットです。Karmaは、Figmaユーザーのために作られたワイヤーフレームキットです。Figmaの最も進んだ部分をベースに、デザインの一貫性を一元化して共有できるようになっています。",
  "data/ph-top/2022/3/shepherd-4.json": "Shepherdは、GoogleカレンダーとGoogle Meetに直接プラグインして、チームで共同メモを取ったり、カスタム議題を設定したり、アクションアイテムを割り当てたり、他の生産性アプリケーションと接続するためのChrome拡張機能です。すべてを1つの場所で",
  "data/ph-top/2022/3/learn-earn-by-outscal.json": "Web2およびWeb3空間におけるゲーム開発者のための学びと稼ぎのコース。チャプターを完了すると、報酬を獲得できます。学習ポイントを獲得し、毎月のトーナメントに参加して、賞品と最大1ETHのエアドロップを競いましょう。",
  "data/ph-top/2022/3/recess-5.json": "Recessは、楽しくて素早いアクティビティを通じて、遠隔地にいるチームのつながりをサポートします。思慮深いプロンプトから気まぐれなプロンプトまで、私たちのアプリは、ラポールを改善し、信頼を構築するための行動科学研究に基づいて設計されています。すでに何千ものチームがRecessの恩恵を受けています。🐻",
  "data/ph-top/2022/3/treblle-for-iphone-ipad-and-mac.json": "Appleデバイス（iPhone/iPad/Mac）で利用できるTrebleのネイティブなオールインワンアプリでAPI管理を再構築しましょう🎉 リアルタイムAPIモニタリング、プッシュ通知アラート、自動生成ドキュメント、API分析、テスト、その他多くの機能を手に入れましょう。",
  "data/ph-top/2022/3/charades.json": "定番のアクティビティがリモートチーム用に生まれ変わりました。木曜日の新しいミキサーです。相手チームが出した単語を自分のチームが60秒で当てる。シャレードで氷を砕きましょう。",
  "data/ph-top/2022/3/habitual-money.json": "スプレッドシートから卒業し、金融筋を鍛える 💪 Amazon、Venmo、毎日の取引で使ったものを簡単に追跡し分類する 👌 カスタムカテゴリーですべてをパーソナライズし、スマートルールエンジンでお金を自動化する ✨。",
  "data/ph-top/2022/3/presailor.json": "プリセイラーとは、クリエイターが株式の希薄化なしに、投資家や視聴者から資金を調達できるように設計された資金調達プラットフォームです。",
  "data/ph-top/2022/3/submarine-me.json": "アンロックされた限定コンテンツを誰とでも共有できる。トークン・ゲートを次のレベルへ。NFTゲートのメディアはついに登場し、かつてないほど簡単になりました。Pinataがお届けします。",
  "data/ph-top/2022/3/deploysentinel-recorder.json": "DeploySentinel Recorderは、ブラウザのインタラクション（クリック、タイプ、スクロールなど）から直接PlaywrightとPuppeteerのスクリプトを自動生成します。完全なオープンソースで、ChromeとFirefoxで利用可能です。",
  "data/ph-top/2022/3/cues-sg.json": "Cuesは、独自のスマートコントラクトやWeb 3.0アプリのコードを、シンプルな3ステップのプロセスで生成するウェブサイトです。コイン、NFT、ステーキング、エクスチェンジ、ディストリビューションコントラクト。そう、あなたはコードの書き方を知る必要はないのです。",
  "data/ph-top/2022/3/project-cost-live.json": "このプロジェクトコストトラッカーは、ブートストラッパーがプロジェクトコストを追跡するために、これまでで最もシンプルになるように意図的に構築されています。ログインして、プロジェクトを追加し、コストの追加を開始するだけです。一回限り、毎日、毎月、毎年のコストを追加することができます。",
  "data/ph-top/2022/3/promote-route.json": "🤦プロモートルート。より良いWhatsApp™体験のために、自動化、カスタマイズ、一括テキスト送信、WhatsApp™マルチメディアメッセージの送信を可能にします。",
  "data/ph-top/2022/3/zenforms.json": "Zenformsは、リアルタイムのコラボレーション、Zenkit Suiteとの完全な統合、サブフォームによるレイヤー化されたデータ収集機能を備えたノーコードのWebフォームアプリです。",
  "data/ph-top/2022/3/local-3.json": "アマゾンの商品を現地で探す 送料を節約し、CO2排出量を削減し、地域経済に貢献します。1) Amazonで商品ページを開く 2) ブックマークバーの拡張機能アイコンをクリック 3) 関連するすべての店舗を地図で見ることができる!",
  "data/ph-top/2022/3/redirect-russia.json": "対ロシア制裁に参加し、たった1行のJavaScriptコードであなたのウェブサイトへのロシアのトラフィックをブロックします。",
  "data/ph-top/2022/3/massdriver.json": "MassdriverはDevOpsを容易にし、エンジニアはシンプルなダイアグラム・インターフェースを使用して、安全で本番環境に近いインフラを迅速にデプロイすることができます。IAM、ファイアウォール、アラート、モニタリングなど、コンテキストに応じた設定がすぐに可能です。",
  "data/ph-top/2022/3/tradex.json": "TradeXは、コビド感染者数、インフレ率、次期大統領など、これから起こる出来事の予測結果に賭けるための取引所です。",
  "data/ph-top/2022/3/crypto-donations-to-ukrainian-doctors.json": "ウクライナで起こっていることを支援するために、あなたの暗号の一部を良い原因に置くことを探しているなら - 私たちは、ウクライナの保健省に暗号の寄付を容易にするためにこの製品を作成しました。",
  "data/ph-top/2022/3/mdb.json": "ソーシャル/言語/フレームワーク/ライブラリなど、プロジェクトに使えるSVGベースの超クールなバッジ。生成されたマークダウンコード、プレビュー、バッジスタイルの変更を1クリックで取得できます。"
}