{
  "data/ph-top/2022/2/bubble-passwordless-auth-plugin-by-sawo.json": "Bubble.ioにパスワードレス認証をシームレスに統合し、コードなしでコンバージョンを54%増加させることができます。SAWOは、生体認証、ベータユーザー認証のサポート、マルチプラットフォームSDKを提供し、規模に応じて認証コストを75%削減することができます。",
  "data/ph-top/2022/2/first-100-users.json": "スタートアップの最初の100ユーザーを獲得する。実行可能なアイデア、明確なケーススタディ、シンプルなステップバイステップの説明。Hey Product Hunt 👋 オリーです。私は、創業者やメーカーが、無関係なインスパイアポルノから解放されて、ステップバイステップのマーケティングアイデアを見つけることができる場所を作りたかったのです。",
  "data/ph-top/2022/2/hera-calendar.json": "アカウントに関係なく、すべてのカレンダーを一か所で管理できます。Heraを離れることなく、イベントのスケジュール、空き時間の共有、一日の計画を立てることができます。タイムゾーンをサポートし、時間を保護する、リモートワーカーのために設計されています。サインアップして、Slackの活気あるコミュニティーに参加しましょう。",
  "data/ph-top/2022/2/gingko-writer.json": "まったく新しい書き方を試してみる。大枠の要約から詳細な散文まで、シームレスに書き進めることができます。カードと呼ばれる小さな「かたまり」で作業することで、より集中力を高めることができます。書きかけの文章を並べ替えることで、流動的に作業することができます。",
  "data/ph-top/2022/2/hugo-calendar.json": "あなたのカレンダー、メモ、タスク。簡単に整理できます。すべて一か所で。Hugoを使用すれば、会議のスケジュール、議題の準備、メモの共有など、チームや他のツールとのつながりを保つことができます。⠀ (Google または Microsoft 365 のアカウントで動作します。)",
  "data/ph-top/2022/2/ango-hub.json": "大規模な自動化とコラボレーションによるデータラベリングのためのオールインワンプラットフォーム。Ango Hubは、自動化とコラボレーションの最良の部分をプラグインベースのアーキテクチャに統合しています。AIによる支援とカスタムプラグインで、すべての非構造化データにアノテーションを付け、管理します。",
  "data/ph-top/2022/2/portant-workflow.json": "あなたの生活からコピー＆ペーストを削除します。〰Google フォームとシートを Docs と Slides に接続すると、チーム固有のニーズに合わせたカスタム ドキュメント ワークフローを作成できます。〰Portant は、仕事の退屈で重要な部分を解決し、楽しいことに集中できるようにします。",
  "data/ph-top/2022/2/tech-blogs.json": "オープンソースの技術系ブログ集。あなたのブログを追加して、記事の閲覧数を増やしましょう。",
  "data/ph-top/2022/2/a11yphant.json": "a11yphantは、開発者にウェブアクセシビリティの基本を教えます。短時間でインタラクティブなコーディングの課題やクイズをこなすことで、段階的に学ぶことができます。",
  "data/ph-top/2022/2/jet-admin.json": "社内ツールや顧客ポータルなどのカスタムビジネスアプリを、コードレスで驚くほど高速に構築できます。ドラッグアンドドロップの UI コンポーネントを使用して、あらゆるデータソースの上に複雑なマルチページアプリケーションを組み立てることができます。",
  "data/ph-top/2022/2/helloguru.json": "AirtableとTableauの出会い! 技術者でない人がデータを理解することを支援します。ユーザーはPostgresからGoogle Sheetsまで100以上のデータソースを組み合わせながら、コードを書くことなくチャートやテーブルを作成することができます。",
  "data/ph-top/2022/2/at-market.json": "at.marketには1000以上のドメイン名があり、あなたが欲しかったEメールを手に入れることができます。2つ目のメールアドレスは現在の受信ボックスを使用するため、すでに持っているメールアドレスと並行して、すべて無料で使用することができます。",
  "data/ph-top/2022/2/fitminder-3.json": "Fitminderは、健康、フィットネス、生産性を向上させ、座りっぱなしの仕事による悪影響を軽減します。長い一日の仕事の後、背中や首の痛みは忘れてしまいましょう Fitminderのエクササイズは、理学療法士との共同作業で生まれました。",
  "data/ph-top/2022/2/cosmo-by-exein.json": "Cosmoは、IoT開発者がデバイスの内部をより深く観察し、脆弱性を一目で理解し、簡単に修正できるようにするために開発されました。",
  "data/ph-top/2022/2/teacher-s-guide-for-english-for-tech.json": "現代の英語教師のための、現代的なツールです。✅技術業界の知識を広げる ✅より需要のある英語教師になる ✅有用なリソース、アクティビティ、ヒント、報酬を得る この教師用ガイドは、English For Techテキストとペアで使用することを想定しています。",
  "data/ph-top/2022/2/beseda-share.json": "1つのトピックで、会議をしない。ブラウザから直接ディスカッションを作成し、リンクを貼って誰でも招待できます。音声、ビデオ、テキストでコラボレーションを行い、終了したら結論でディスカッションを終了させます。チーム、ユーザー、顧客、請負業者とのディスカッションが可能です。",
  "data/ph-top/2022/2/coniun.json": "Coniunは、NFTの世界の参入障壁を下げることを目的としたプラットフォームです。新しいプロジェクトを発見し、NFTを管理できるようにするための分析を提供します。",
  "data/ph-top/2022/2/threadstart.json": "ThreadStartは、Twitterのスレッドを書き、スケジュールし、公開する最も簡単な方法です。リッチエディタを使えば、画像を追加したり、テキストをフォーマットしたりするのも簡単です。また、スレッドのプレビューはリアルタイムで更新されます。ThreadStart で時間を節約し、フォロワーを増やしましょう!",
  "data/ph-top/2022/2/climatiq-emission-tracking-api.json": "ClimatiqはREST APIで排出量計算の自動化を簡単に実現します。科学的に検証されたオープンデータを基にEdgeテクノロジーで構築された高速APIを使用して、貴社のソフトウェアに炭素測定値を組み込むことができます。",
  "data/ph-top/2022/2/resource-center-by-userflow.json": "Userflowの新しいリソースセンターは、ユーザーがアプリ内で直接ヘルプにアクセスできるようにします。リソースセンターはカスタマイズ可能なブロックのリストに拡張され、ユーザーは既存のナレッジベースを検索したり、必要に応じてUserflowフロー/ツアーを検索して開始したりすることが可能です。",
  "data/ph-top/2022/2/devtools-for-tailwind-css.json": "Tailwind CSSのDevToolsは、ブラウザ上でのデザイン、デバッグを復活させます。インテリセンスのオートコンプリート、JITのフルサポート、カスタムコンフィグ。ブラウザから直接操作できます。",
  "data/ph-top/2022/2/special-symbols-by-mumu-x.json": "絵文字や記号を、正確な名称を思い出すことなく選ぶことができます。Mumu Xは、GPT-3を利用した同義語を活用し、あなたの頭の中から思いついたものを元に絵文字や記号を探します。",
  "data/ph-top/2022/2/solana-pay.json": "次世代の加盟店決済のための分散型、安全、オープンソースの決済プロトコル「Solana Pay」をご紹介します。 羽ばたいていくお金。"
}