{
  "data/ph-top/2021/6/mobile-palette-generator.json": "モバイルパレットジェネレータは、マウスをクリックするだけで、モバイルやウェブアプリのカラーパレットを生成できる、シンプルかつパワフルなツールです。",
  "data/ph-top/2021/6/zospace-ui-kit.json": "美しいTailwindのテンプレートを作ることは、ロケットサイエンスではありません。✨ https://shuffle.dev/marketplace/zospace",
  "data/ph-top/2021/6/fastbee-price-tracker.json": "🙄 購入を検討しているが、価格が適正かどうかわからない？✅ FastBeeは購入したい商品の価格を追跡します。価格が変更されると、通知が届きます! さらに、Beeがあなたに代わって注文することもできます。",
  "data/ph-top/2021/6/venus-design-system.json": "もう一つのレベルで、より少ない労力で欲しいものをデザインしましょう 最も一般的な2000以上のUI/UXコンポーネントを搭載した使いやすいデザインツールで、世界水準のデザインをすぐに実現することができます。🔥",
  "data/ph-top/2021/6/designing-ux-for-saas.json": "この無料の電子書籍では、次のことを学ぶことができます。✅ UXとSaaSの基本、✅ 2021年のトレンドはどのようなものか、✅ SaaSビジネスにおけるUXの価値、✅ SaaS製品のUXデザインプロセス、✅ デザインプロセスを大幅に改善するためのヒントとツールを紹介しています。",
  "data/ph-top/2021/6/coherence-x4.json": "Coherence X4を使えば、どんなウェブサイトでも、妥協することなく、Mac上でクロムを使ったアプリに変えることができます。拡張機能の使用、タブ型やシークレット型のアプリの作成など、さまざまな機能があります。Coherence X4には、Microsoft EdgeとOperaのアプリも導入されています。",
  "data/ph-top/2021/6/findcreators-io-2.json": "クリエイター経済の成長をサポート🙌🏻 findcreators.ioでは、Instagramのバイオグラフィーにあるキーワードをもとにクリエイターを探すことができます。🌎 ライター、フィットネストレーナー、俳優、フォトグラファーを見つけて、一緒に仕事をしたり、ブランドを宣伝したり、プラットフォームに参加したりすることができます。",
  "data/ph-top/2021/6/developer-ipsum.json": "¯\\_🤓_/¯",
  "data/ph-top/2021/6/spacecasts.json": "ライブ・オーディオ・クリエイター集団。最高のクリエイターやオピニオンリーダーによるクラブハウスルームやツイッタースペースをすべて収録、収集しています。⠀ SpaceCastを投稿してみませんか？投稿はこちらから： https://www.ridehome.info/p/spaces/",
  "data/ph-top/2021/6/hack-the-interview.json": "Hack The Interviewは、90日以内の内定または返金を保証する唯一の面接トレーニングシステムです。HTIは、求職者が面接を受けるまでの間、キュレーションされたメンターのコミュニティに依存し、貴重なトレーニングを提供しています。",
  "data/ph-top/2021/6/spot-ca077a28-c6c6-4891-b915-a2716fa4734a.json": "Spotは、パフォーマンスの高いチームが必要とするコラボレーションとコミュニケーションの機能を備えたバーチャルオフィスです。音声、ビデオ、スクリーン共有、チャットなど、すべての機能をチームの手元に置くことができます。",
  "data/ph-top/2021/6/idea-canvas-univation.json": "Univationは、あなたのアイデアを構築したり、スタートアップ構築プログラムを実行するための最も簡単なプラットフォームです。",
  "data/ph-top/2021/6/nft-storage.json": "nft.storageは、オフチェーンのNFTデータを保存するために特別に作られた、全く新しいサービスです。データはIPFSとFilecoinに分散して保存されます。",
  "data/ph-top/2021/6/loomsdk-beta.json": "loomSDKは、あなたの製品にビデオメッセージングを追加するための最も簡単で信頼性の高い方法で、しかも無料です。このSDKを使えば、ユーザーはウェブアプリケーション内で直接Loomビデオを録画、埋め込み、視聴することができ、あらゆるワークフローに明確さと文脈を加えることができます。",
  "data/ph-top/2021/6/smart-stickers.json": "Smart Stickers」には、魅力的なデザインを実現するキャッチーなイラストが90点収録されています。3つのスタイルからお好きなものを選んで、あなたのデザインをカラフルに演出してください。FigmaとSketchに対応しています。",
  "data/ph-top/2021/6/ready-ui.json": "開発者、エージェンシー、スタートアップ、マーケッター、デザイナーが美しいウェブサイトを作るための200以上のUIブロック。すぐに使えるbootstrapのコードと、整理されたfigmaファイルで、次のWebサイトのデザインや開発を迅速に行うことができます。",
  "data/ph-top/2021/6/gitlive.json": "IDEを拡張し、遠隔地の開発チームが効果的に連携するために必要なリアルタイム機能を提供します。チームメイトが作業している内容を確認し、コミットする前にマージコンフリクトの通知を受けることができます。ビデオ通話を行い、ライブで一緒にコードを書く、VS CodeからJetBrainsへ",
  "data/ph-top/2021/6/drip-by-digitalax-1.json": "DIGITALAXは、Matic NetworkことPolygonと協力して、デジタルとフィジカルのハイブリッドなファッションラインを初めて立ち上げました。",
  "data/ph-top/2021/6/jitsu-2.json": "Jitsuは、イベントコレクションとAPIコネクタを備えたオープンソースのSegment代替製品です。選択した任意のデータウェアハウスにデータをストリーミングして収集することができ、2分で導入することができます。",
  "data/ph-top/2021/6/offline-ai.json": "Bye bye dating apps 👋 It's time for something new 😎 Offline AIに会いたい人のタイプを伝えるだけで、素敵な相手を見つけてくれます。アプリはありません。公開プロフィールもありません。スワイプもありません。あなたがコントロールするのです😸。",
  "data/ph-top/2021/6/google-forms-to-notion.json": "Form to Notionでは、Google Formを使ってNotion Tableにエントリを追加することができます。📝 Notion Tableに合ったFormを作成することができます。📌 このアドオンは、Google Form の改良版を Notion ページ内に埋め込むこともできます。",
  "data/ph-top/2021/6/growth-skills-assessment-test.json": "成長を成功させるには、製品管理やデータ、顧客獲得や実験デザインなど、さまざまな分野のスキルが必要です。この45分間のグロース・スキル・アセスメントは、グロース・スキルにおける自分の強みと盲点を理解するのに役立ちます。",
  "data/ph-top/2021/6/nice-avatar.json": "react-nice-avatarは、ユーザーのためのアバターを簡単に生成することができます。",
  "data/ph-top/2021/6/ticktick-6-0.json": "TickTickは、シンプルな操作で使えるオールインワンの生産性向上アプリです。To Doの管理、カレンダーでのスケジュール管理、メモの取り方、集中力の維持など、すべてを1つの場所で行うことで、人生を最大限に活用することができます。",
  "data/ph-top/2021/6/day-zero-by-day-one.json": "Day Zeroは、意欲的な創業者やシリアルビルダーが新しいアイデアを探求し、それを実現するためにコミュニティと共に働くためのコミュニティです。私たちは、新しいアイデアを考え、検証するためのツールとワークフローを提供しています。そうすることで、次の大きなアイデアが頭の中だけに留まらないようにします。",
  "data/ph-top/2021/6/nutrisense-v2-0.json": "NutriSenseは、主要なメタボリックマーカーをリアルタイムに追跡するデータ駆動型のメタボリックヘルスプラットフォームです。継続的なグルコースモニタリング、AIによる食事のトラッキング、専門家によるコーチングを用いて、健康上の目標を達成し、持続的な行動の変化を生み出すことをサポートします。",
  "data/ph-top/2021/6/letterlike.json": "購読者が何を読んで喜んでいるのか、何を読んでいないのかを知る。Letterlikeは、ニュースレターに「いいね！」ボタンを追加し、読者がコンテンツにフィードバックするための楽しくシンプルな方法です。",
  "data/ph-top/2021/6/process-street-automations.json": "Process Street Automationsは、重要なワークアプリをまとめて、チームの最も重要なプロセスを推進します。自動化を支えるのは、Salesforce、Jira、Slack、DocuSign、Google Sheetsとの新しいネイティブ統合セットです。Salesforce、Jira、Slack、DocuSign、Google Sheets。",
  "data/ph-top/2021/6/openphone-for-teams.json": "OpenPhoneは、スタートアップ企業向けのオールインワンビジネスフォンです。強力な通話機能、メッセージ機能、そして軽量なCRMが搭載されています。チームで電話番号を共有し、会話を共同で行うことができます。モバイル、ウェブ、デスクトップで利用できます。",
  "data/ph-top/2021/6/batteries.json": "iPhone、iPad、Apple Watch、Macのバッテリーを、すべてのデバイスで同時にトラッキングできます。あなたのデバイスに内蔵されているトラッキング技術を利用するので、バッテリーレベルは信頼できます。",
  "data/ph-top/2021/6/firefox-89.json": "Firefox のデザインを変更するにあたり、私たちのチームは、人々がどのようにブラウザを操作しているかを調査し、そのパターンと行動を観察しました。また、より快適な Web 体験を求める一般の人々からのフィードバックやアイデアに耳を傾けました。",
  "data/ph-top/2021/6/moonsense-recorder.json": "Moonsense Recorderは、https://play.google.com/store/apps/details?id=io.moonsense.recorder & https://apps.apple.com/us/app/moonsense-recorder/id1551215403 モバイルデバイス用の使いやすいアプリケーションで、複数のセンサーからのデータを記録し、分析のために保存したりラベルを付けたりすることができ、ライブプロトタイプをより早く構築する能力を与えてくれます。",
  "data/ph-top/2021/6/listnr-for-chrome.json": "Listnr for Chromeでは、インターネット上のお気に入りのコンテンツをPodcastに変換して聴くことができます。",
  "data/ph-top/2021/6/akiflow-2-0.json": "AkiflowはTasks + Calendarsの生産性向上アプリです⚡️ 複数のソースからタスクをキャプチャします⚙️ ショートカット(Plan/Snooze)で高速に処理します✅ 集中力と個人の組織性を高めますWin+Mac http://www.akiflow.com/ で無料でお試しください。",
  "data/ph-top/2021/6/socialmailer.json": "私たちは過去4年間、社内でSocialMailerを使って何万人ものインフルエンサーにコールドアウトリーチを行ってきました。私たちにとっては時間の節約になりましたし、あなたにとってもそうなると信じています。ご意見をお聞かせください。",
  "data/ph-top/2021/6/vectoricons-mixer-by-iconshock.json": "VectorIcons Mixerは、数千のベクターアイコンとカラフルな形状を組み合わせて、数回のクリックで新しいアイコンセットを生成することができるシンプルなオンラインツールです。たくさんのアイコンスタイルと、何百もの抽象的、幾何学的、有機的な形状を組み合わせることができます。",
  "data/ph-top/2021/6/saas-blocks-ui-kit.json": "SaaS Blocks UI Kitは、創業者やデザイナー、開発者が、美しく効果的なウェブサイトやランディングページを数分で作成できるようサポートします。70以上のブロックとコンテツ、コンポーネント、フリーフォントが含まれています。お好きな金額をお支払いください（今のところ）。",
  "data/ph-top/2021/6/savely.json": "Savelyは、次のバケーションのためにお金を貯めることができるiOSアプリケーションです。バケーションは目標から始まり、目標はSavelyから始まります。",
  "data/ph-top/2021/6/wicked-templates-2-0.json": "Tailwind CSS、Alpine.js、Next.jsを使用して作られたランディングページが素晴らしい。",
  "data/ph-top/2021/6/tidytag.json": "LinkedInは面倒くさい。そしてそれは、接続数が増えれば増えるほど悪化する。コネクションをセグメント化する便利な方法はありません。TidyTagがあれば大丈夫です。あなたのLinkedInを今すぐセグメント化しましょう",
  "data/ph-top/2021/6/whatsapp-chat-abandoned-cart-recovery.json": "このShopifyプラグインを使うと、WhatsAppを介して潜在的な顧客に放棄されたカードの回収通知を自動的に送信し、顧客を喜ばせることができます。他にもWhatsAppでショッピングに関する最新情報を送信することができます。WhatsAppチャットウィジェットの追加。",
  "data/ph-top/2021/6/the-dad-s-bucket-list.json": "子供たちが自分をヒーローのように見てくれることほど、父親として嬉しいことはありません。空が青い理由を説明しているときも、いじめっ子への対処法を教えているときも、少し鼻で笑うほど大笑いしているときも。",
  "data/ph-top/2021/6/waldo-for-analytics.json": "自動化された信頼性の高い方法で、分析イベントをテストすることができます。",
  "data/ph-top/2021/6/compairbnb.json": "いろんな場所のタブを💯開いていたことはありませんか？Compairbnbはあなたの時間を節約します。",
  "data/ph-top/2021/6/castyr.json": "Castyrは、新しいソーシャル・ポッドキャスティング＆リスニング・プラットフォームです。最大5分間の音声をスニップして注釈を付け、コミュニティフィードで共有し、フォロー可能なプロフィール上でカスタマイズ可能なコレクションに整理することができます。TikTokとGoodreadsがポッドキャストの赤ちゃんを産んだようなものです。",
  "data/ph-top/2021/6/twitter-blue.json": "本日より、オーストラリアとカナダで、Twitter Blueの第一弾を展開します。https://blog.twitter.com/en_us/topics/company/2021/introducing-twitter-blue.html",
  "data/ph-top/2021/6/google-cemetery.json": "Googleの100以上の失敗例に学び、収益性の高いビジネスを構築し、買収した企業を拡大する。",
  "data/ph-top/2021/6/prosoftly.json": "成長に必要なすべてがここにあります。クラウドベースの単一プラットフォーム上で、売上を伸ばし、マーケティング能力を強化し、顧客サービスを向上させることができます。",
  "data/ph-top/2021/6/healthy-relationship-with-cats.json": "猫は間違いなくユニークで素晴らしい生き物です。しかし、彼らを理解することは必ずしも容易ではありません。この電子書籍では、あなたの猫とコミュニケーションをとるための特別なテクニックを見つけることができます。完全無料です。",
  "data/ph-top/2021/6/zoho-salesiq-2-0.json": "マルチブランド管理、訪問者インサイト、リードスコア、プロファイルエンリッチメント、ライブチャット、メッセージングチャネル、コードレスボットビルダー、人間に近いNLP駆動のチャットボット、冒涜的な表現の管理などの機能を備えた、完全なカスタマーエンゲージメントプラットフォームです。",
  "data/ph-top/2021/6/poolsuite.json": "贅沢でありながらゆったりとした時間。軽薄でありながら洗練されている。夏の甘い音を11倍にしたようなサウンド。プールサイドに座っていたのが、The Poolsuiteのプライベートカバナにアップグレードされたのですから、バーチャルバッグを用意しましょう。",
  "data/ph-top/2021/6/checkout-page-digital-downloads.json": "Checkout Page Digital Downloadsを使って、インターネット上でデジタルダウンロードを販売しましょう。数回のクリックでチェックアウトページを作成し、ファイルをアップロードして、あなたのサイトにチェックアウトを追加したり、支払いリンクを共有することができます。どのようなプラットフォームでも動作し、コードは必要ありません。",
  "data/ph-top/2021/6/charmstone.json": "macOSのアプリケーションの起動と切り替えに空間記憶を使うと、驚くほどパフォーマンスが向上します。Charmstoneは、cmd+tabやDockをユニークかつシンプルにアレンジしたもので、あなたのワークフローに簡単に組み込むことができます。ドックを隠している場合は特に便利です。",
  "data/ph-top/2021/6/really-good-push-notifications.json": "様々な業種のプッシュ通知のアイデアや事例を厳選してご紹介します。Really Good Push Notificationsに登録すると、プッシュ通知のインスピレーションを直接受信箱に届けてくれるので、プッシュ通知のゲームを有利に進めることができます。",
  "data/ph-top/2021/6/zing-data.json": "Zingでは、数回タップするだけで、あなたのデータベース（PostgreSQL、今後も増える予定）から、外出先で簡単に質問をすることができます。* 質問をする * データを検索する * ビジュアライゼーションやテーブルを作成する * チームとチャットする...どこにいてもできます。",
  "data/ph-top/2021/6/clay-mockups.json": "🚨美しい、無料の粘土モックアップセットは、あなたのポートフォリオプロジェクトを披露するために使用することができます。私たちはModern Minimalのデザインに使用しています。👇 13°の回転ルールを覚えておくと、プロジェクトが一気に見栄え良くなります☝️。",
  "data/ph-top/2021/6/devzat.json": "ターミナルから直接、SSHでチャットができます。無料でオープンソースです。github.com/quackduck/devzat。星をつけてください。",
  "data/ph-top/2021/6/ens.json": "イーサリアムネームサービスは、オープンソースのブロックチェーンベースのネーミングプロトコルです。2017年初めにEthereum Foundationで開始されたENSは、2018年に独立した組織としてスピンオフしました。",
  "data/ph-top/2021/6/just-farts.json": "猫のおなら。⠀ それが狩りだ。⠀ 猫のおならです。",
  "data/ph-top/2021/6/hashgrow.json": "ハッシュグロウのモバイルアプリを使えば、Fbのリードフォームと連携して、新規リードの通知や、WhatsApp、Eメール、SMSでのフォローアップの送信が簡単にでき、テンプレートも用意されています。また、リードに電話をかけたり、アクティビティを追跡することもできます。",
  "data/ph-top/2021/6/lighthouse-8-0.json": "Lighthouse 8.0が登場しました。パフォーマンススコアのCOVバランスの改善、PSIとCanaryのDevToolsに搭載されたLighthouse Treemapとメトリックフィルタリング、そして全く新しいCSP監査です。",
  "data/ph-top/2021/6/zenown-2-0.json": "ZenOwnはあなたのパーソナルプロダクトアシスタントアプリです。✔ スキャンして商品を追加するだけ 📱 ビデオヒントで商品を最大限に活用する ⏰ 保証アラームをオンにする 🛍 ブランドの特別オファーを受ける 💰 数回タップするだけで販売/プレゼントする その他の機能は近日公開予定です。",
  "data/ph-top/2021/6/marketer-crew.json": "https://marketercrew.com/ は、マーケターとインディーメーカーのための週刊ニュースレターです。毎週月曜日と木曜日に、マーケティングが実際に楽しくなるようなメールをお届けします。また、最新のニュース、ツール、インサイトなどの情報を無料でお届けします。",
  "data/ph-top/2021/6/million-js.json": "現在の仮想DOMの実装は不十分です。複雑すぎるものから放棄されたものまで様々で、ほとんどのものは、生のパフォーマンスとサイズを犠牲にしなければ使用できません。Millionはこの問題を解決することを目的としており、ライブラリに依存しないVirtual DOMを提供し、Javascriptライブラリのコアとして機能します。",
  "data/ph-top/2021/6/huma-breath.json": "🌬️ 科学的に裏付けられた呼吸法で、不安を和らげ、早く眠りにつき、集中力を高め、エネルギーを得ることができます。🍃 ヒューマ・ブレスのエクササイズは素早く効果的で、文字通り1、2分であなたの状態を変えることができます。",
  "data/ph-top/2021/6/where-to-post-your-product.json": "厳選された280以上のウェブサイトのリストを使用して、スタートアップの露出とバックリンクプロファイル（SEOに良い）をスパークさせます。-タイプ -トピック -公開時期 -無料/有料 -難易度 -ドメインのオーソリティ -トラフィック量と上位国 -Majestic Trust & Citation Flows",
  "data/ph-top/2021/6/polyo.json": "Polyo by HelloConsent あなたのビジネスの性質に基づいて、あなたの聴衆が理解できるように包括的に書かれたカスタムの法的ポリシーを作成します。登録は必要ありません。100%無料で使用できます。",
  "data/ph-top/2021/6/siimpl-bookmarking.json": "オンラインで見つけた興味深いウェブサイト、画像、ビデオ、タブ、テキストを保存して、どのデバイスでもどこからでもアクセスできます。他の人と共有したり、機密性の高いサイトを隠しコレクションに保存して、ピンでしか表示されないようにすることもできます（覗き見されないように）。",
  "data/ph-top/2021/6/console-2.json": "何千人ものエンジニアと一緒に、アマゾンのエンジニアが監修した最新のオープンソースソフトウェアを毎週まとめてお届けします。",
  "data/ph-top/2021/6/koalendar.json": "Koalendarへようこそ! これは、ゲストが会議にサインアップできる使いやすいカレンダーです。Googleカレンダーと同期し、ZoomやGoogle Meetなどのビデオ会議ソフトと統合します。無料で簡単にデモができます- https://koalendar.com/e/demo",
  "data/ph-top/2021/6/gosun-chillest-2.json": "氷は最悪です。このポータブル電気冷蔵庫は、冷やすか凍らせるかの2つのゾーンがあり、内蔵バッテリーで食品の冷たさを10時間以上保ちます。Chillestは太陽の力で冷却するので、水気の多いサンドイッチや溶けた氷を忘れ、すべてが乾燥した状態で整理されます。",
  "data/ph-top/2021/6/seo-glossary-by-serpstat.json": "この150のSEO用語と記事のリストの目的は、あなたのSEO知識を深めることです。SEOは急速に発展しており、重要なコンセプトをより深く学ぶためのリソースを作ろうとしました。この用語集は定期的に更新されているので、いつでもご利用いただけます。)",
  "data/ph-top/2021/6/tooljet.json": "ToolJetはRetoolの代替となるオープンソースの製品です。ToolJetは、既存のデータベース、APIエンドポイント、外部サービスに接続し、コード不要のアプリビルダーを使って、データの上にアプリケーションを構築することができます。",
  "data/ph-top/2021/6/snip-3.json": "Snipは、どんなウェブサイトからでも、ワンクリックであらゆる要素を削除します。だから、あなたが見たいものだけが表示されます。あなたの選択は保存されます。次回、同じページにアクセスすると、削除された要素は非表示になります。Snipでは、最近の変更を元に戻したり、やり直したりすることができます。",
  "data/ph-top/2021/6/monarch-2.json": "Monarchは、経済的な目標を達成するために実際に役立つ、最新のパーソナルファイナンスアプリです。Monarchでは、あなたの経済生活全体を一箇所で管理し、経済計画を作成し、その計画に従って簡単に経済的な目標を達成することができます。",
  "data/ph-top/2021/6/koya-3.json": "KOYAでは、個人的なメッセージを簡単にスケジューリングすることができます。- 思い出（ビデオや画像） - URL（Spotify、YouTubeなど） - オプションのギフト（コーヒー、ビール、タコスなどに使える$$）。",
  "data/ph-top/2021/6/zoho-sheet-extension-web-clipper.json": "Zoho Sheet Webクリッパーは、データテーブルをスプレッドシートに瞬時にクリップすることができます。この拡張機能を使えば、ワンクリックでスプレッドシートを作成したり、アクセスしたりすることができます。つまり、このエクステンションを使えば、Zoho Sheetが一歩身近になるのです。",
  "data/ph-top/2021/6/kudos-ad4f1ed8-4840-404c-853c-e69afe290ac0.json": "Kudosは、赤ちゃんのお尻が1日中100％コットンに触れることができる最初で唯一の紙オムツです。特許出願中のDoubleDryTM技術と組み合わせることで、このおむつは、赤ちゃんの敏感な肌、地球、そしてあなたのソファを守るという点で、真のゲームチェンジャーとなるでしょう。)",
  "data/ph-top/2021/6/inspiration-database-1.json": "このデータベースは、現在の市場でどこに需要があるのかを確認したり、新しいサイドプロジェクトのインスピレーションを得たりすることを目的としています。このコレクションは8つのエアテーブルに分かれています： - 生のデータベース（147.000以上の製品） - 低評価だが人気のあるアプリ - 放置されているChrome拡張機能",
  "data/ph-top/2021/6/spotify-blend-beta.json": "Blendは、2人の友人がそれぞれの音楽的嗜好を融合させ、彼らのためだけに作られた1つのプレイリストを作るという新しい方法です。Blendは毎日更新され、ユーザーの好みの変化に応じて成長していきます。",
  "data/ph-top/2021/6/trendpop-hot-100.json": "Hot 100は、TikTokで最もバイラルなトレンドを追跡する最良の方法です。https://trendpop.social! TikTokのトップ100のサウンド、クリエイター、ハッシュタグを閲覧でき、バイラル度でランキングされ、毎日更新されます! 週間、月間、年間のランキングをご用意しています。",
  "data/ph-top/2021/6/storydoc.json": "静的なセールスやマーケティングのスライドを、美しいインタラクティブなWebプレゼンテーションに変えます。雑音を排除し、顧客エンゲージメントとコンバージョン率を向上させます。Storydocsはデザインやコーディングのスキルを必要とせず、簡単に変更することができます。早期アクセスを開始しました。",
  "data/ph-top/2021/6/motion-slack-app.json": "簡単なコマンド（/motion @user1 @user2 @user3）を入力するだけで、全員のカレンダーのコンフリクトやタイムゾーンをチェックし、全員が同意した上で、自動的にミーティングのスケジュールを決定します。カレンダーをチェックしてチャットでやりとりするよりも3倍速くなります。",
  "data/ph-top/2021/6/mooncamp.json": "https://mooncamp.com/ は、OKRやCheck-insなど、まだまだたくさんの機能を備えた、健康で幸せでハイパフォーマンスな企業文化を育むためのオールインワンOSです🚀。",
  "data/ph-top/2021/6/twitter-bot-without-code.json": "nocodeツールを使って、コードを全く書かずにTwitter Botを構築。Twitter APIは必要ありません🤯。",
  "data/ph-top/2021/6/learn-by-angellist.json": "New Venture Education Center by Angelist は、創業者、ファンドマネージャー、投資家向けに、ベンチャーキャピタルの様々なトピックや側面をカバーしています。ベンチャーキャピタルを理解するのに最適なリソースです。",
  "data/ph-top/2021/6/whatsapp-reminders.json": "GoogleカレンダーからWhatsApp番号に直接、会議のリマインダーや日課を受信できます。リマインダーにはGoogle Meets LinkとCall Coordinatesが含まれます。会議の30分前(または指定した時間)に通知します。WhatsAppで日報を受信して、常に最新の情報を得ることができます。",
  "data/ph-top/2021/6/fix-contrast.json": "コントラストの低いテキストは、最も一般的なアクセシビリティの問題であり、86.4%のページに影響を与えています。Polypane（https://polypane.app）で開発された技術をベースにしたこの無料の拡張機能は、アクセスしたサイトのコントラストの問題を自動的に修正します。",
  "data/ph-top/2021/6/pabio.json": "Pabioでは、プロのインテリアデザイナーによる家具付きのアパートを手に入れ、高品質な家具を月額制でレンタルすることができます。",
  "data/ph-top/2021/6/api-template.json": "APITemplate.ioは、最新のAPIベースのプラットフォームで、メディアコンテンツ生成のための2つの強力なAPIを提供するように設計されています - 画像とPDF",
  "data/ph-top/2021/6/idea-validation-template.json": "テンプレートの質問に答えることで、より深く掘り下げ、アイデアの重要な部分を表に出すことができます。",
  "data/ph-top/2021/6/korkuma.json": "コルクマは新しいライブコマースのSaaS製品です。私たちは、あらゆる規模の企業がウェブサイトでライブストリーミングを行い、[何でも]販売できるようにします。私たちは、市場で最も優れた価格対価値比で、ライブショッピングを大衆にとってより身近なものにしたいと考えています。",
  "data/ph-top/2021/6/wwdc21-by-raycast.json": "WWDC21に遅れずに参加しよう。Raycastでは、今年のセッションを素早く検索、フィルタリング、お気に入り登録することができます。WWDCアプリを使用して、週中またはその後いつでもすべてのビデオをダウンロードして見ることができます。wwdc.ioと共同でRaycastが作成しました。",
  "data/ph-top/2021/6/700-presentation-templates.json": "これらのPPTは、教育、健康、貿易などのビジネスや講義室でのプレゼンテーションに適しているだけでなく、プレゼンテーションを行うために使用することができる季節のパワーポイントのテーマとテンプレートと一緒に基本的な目的のデザインです。",
  "data/ph-top/2021/6/faves.json": "20k以上の待機リストをスキップする🌟 世界の賢い人たちが何を読み、何を見て、何をスクロールしているのか気になりませんか？Favesで調べてみましょう。私たちのキュレーターには、最高のVC、ファウンダー、プロダクトリーダーが含まれています。今すぐ登録して、2万人以上のウェイティングリストをスキップしましょう。",
  "data/ph-top/2021/6/discord-stages.json": "コミュニティサーバーでは、ステージを公開することで、Discord上のメンバーがサーバー内で行われている素晴らしい活動をライブで聴くことができるようになりました。歌ったり、おしゃべりしたり、新しいことを学んだりして、今すぐステージを作ったり、チューニングしたりしましょう。",
  "data/ph-top/2021/6/discord-message-embed-builder.json": "Discordボット用の埋め込みメッセージを作成するためのシンプルできれいなインターフェースです。メッセージのプレビューと送信に必要なすべてのコードを自動生成します。作成した埋め込みメッセージは、簡単な共有リンクを使って他の人と簡単に共有できます。",
  "data/ph-top/2021/6/playdate-5.json": "Playdateは、アプリとゲームのデザイナーであるPanicの初のハードウェアで、価格は179ドル、来月出荷予定で、12週間で24ゲームの \"シーズン \"が提供されます。また、かわいいスピーカードックや、ローコードでゲームが作れるプラットフォームも用意されています😻。",
  "data/ph-top/2021/6/poised.json": "Poisedは、パーソナライズされたデジタルコミュニケーションコーチであり、オンラインミーティング中に実用的なリアルタイムフィードバックを提供します。Poisedは、Zoom、Slack、Microsoft Teams、Google Meetなどのプラットフォームに対応しています。",
  "data/ph-top/2021/6/softr-2-0.json": "Softrは、Airtableから強力なWebアプリケーションやポータルを、最も簡単に、数分で構築することができます。コードは必要ありません。Softrを使えば、クライアントポータル、社内ツール、マーケットプレイス、オンラインコミュニティ、リソースディレクトリ、ウェブサイトなどを構築できます。",
  "data/ph-top/2021/6/f-ckoff.json": "YouTubeにはたくさんの広告があります。https://fuckoff.ytmagically は、「Skip Ads」を「F*ck Off」に変更します。広告をブロックするわけではありませんが、広告に対する気持ちが楽になるかもしれません。",
  "data/ph-top/2021/6/typomotion.json": "私たちは皆、Appleの「Don't Blink」広告を初めて見たときのことを覚えています。Typomotionでは、このようなキネティックなタイポグラフィビデオを数分で作成することができます。また、数回のクリックで音楽を調整したり、背景画像を変更したり、色を調整したりすることができます。その上...。無料です。",
  "data/ph-top/2021/6/be-live.json": "プロのように、手のひらの上で魅力的なライブストリームを実行しましょう。Be.Live Mobileアプリでは、以下のことができます。👋 ゲストを招待したり、視聴者とチャットしたりすることができます ✏️ 放送をブランディングすることができます",
  "data/ph-top/2021/6/catapult-translate-faster.json": "最新のA.I.とクラウド技術を用いたCatapultは、通常の3倍の速さで文章を翻訳することができます。さらに、元の文書と同じフォーマットやデザインを維持することができます。60以上の異なるファイルタイプで動作します。",
  "data/ph-top/2021/6/cord-3.json": "Cordは、マイクロモデルを用いた新しいアプローチにより、トレーニングデータの作成を自動化します。Cordを使えば、ラベリングプロセスを自動化された組立ラインに変えることができ、コンピュータビジョンアプリケーションのトレーニングデータを圧倒的なスピードで作成することができます。",
  "data/ph-top/2021/6/virtually-3.json": "Virtuallyは、支払い、ライブクラス、学生管理をサポートし、インパクトのあるコホートベースのコースを構築し、拡張するために必要なすべてのツールを提供します。⠀ https://www.buildingasecondbrain.com/, Ali Abdaal's https://academy.aliabdaal.com/, https://flockjay.com/ などのトッププログラムがVirtuallyを使用しています。",
  "data/ph-top/2021/6/ios-15-humane.json": "より人間らしいiOS体験のための野心的なコンセプト。Time Well Spent」、「Persuasive Design Settings」、「App Conditions」などの新機能により、Appleは、人間の注意を真に尊重するテクノロジーへと業界を導くことができるでしょう。",
  "data/ph-top/2021/6/bootstarters.json": "BootStartersは、最新のBootstrap 5に対応した以下のようなスターターテンプレート集です：⠀ ・管理者用ダッシュボード ・ダークテーマ ・Fluent Design Theme ・ブログテンプレート ・eコマーステンプレート ・複数のカラムレイアウト ・価格、ログイン、マガジン⠀ など。",
  "data/ph-top/2021/6/airy.json": "Airyは、オープンソースの会話プラットフォームで、会話データを安全かつプライバシーに配慮した方法で保存、構造化、利用することができます。Airyは、独自のメッセージングAPIのホスティングから会話型AIとの統合まで、さまざまなユースケースに対応します。",
  "data/ph-top/2021/6/daft-punk-cafe.json": "これは、ダフト・パンクがこの世界にもたらした永遠の遺産への賛辞です。彼らのトラックやライブショーの24時間ラジオを楽しんだり、ランダムなトラックの名前を推測して自分の「ファンレベル」をテストしたり、レベルアップしてより速いトラックでテトリスをしたりすることもできます。",
  "data/ph-top/2021/6/the-ultimate-design-tool-picker.json": "デザインツールの数が多すぎて選べない！？AからBに行くために、どれが一番いいのかを見つけてください。",
  "data/ph-top/2021/6/promptly.json": "あなたの仕事は、サポートメールで埋め尽くされていませんか？Promptlyは、Gmailで直接返信を自動化することで、カスタマーサポートの規模を拡大することができます。お客様のナレッジベースとライティングスタイルに合わせてトレーニングされたPromptlyは、お客様からのお問い合わせやリクエストに即座に対応できるように設計されています。📥",
  "data/ph-top/2021/6/100-resources-on-gpt-3.json": "私は、GPT-3に関する本を執筆したり、GPT-3アプリを構築する方法を研究したりする中で、これらのリソースを厳選しました。このリストは次のような人に役立ちます。 開発者、コーダーではない人、VCアナリスト、テックライター、プロダクトマネージャー、創業者。- 記事、ビデオ、デモ、アプリ、コミュニティ、ガイド、コードとノーコードのテンプレート、など。",
  "data/ph-top/2021/6/trove-9bfecb5b-573e-4a1c-9b90-f009bc69e885.json": "Troveは、共有する価値のある知識のための場所です。🗃️ メモやリンクをキュレーションして整理することができます 🕵️ 公開・非公開を問わず、他の人とコラボレーションすることができます🤝 💻 Chrome拡張機能で、ブラウザから直接保存することができます 👀 他の人をフォローすると、自分のフィードに他の人の知識が表示されます",
  "data/ph-top/2021/6/the-commit-platform.json": "Commitは、スタートアップエンジニアのキャリアニーズを第一に考える、初のプロフェッショナルネットワークです。コミットは、生涯にわたるピアツーピアのサポート、個別のキャリア開発、スタートアップの機会へのユニークなアクセスを提供する、遠隔地を優先した共同コミュニティです。",
  "data/ph-top/2021/6/gen-z-casa.json": "Gen Z Casaは、Gen Zerが自分にぴったりのコミュニティ・ハウスを見つける方法です。",
  "data/ph-top/2021/6/very-important-meeting.json": "最も重要なEuro 2020の試合が仕事中に行われることを考慮して、BBC iPlayerやITV playerのライブビデオストリームをビデオ通話に見せかけるChrome拡張機能を作りました。",
  "data/ph-top/2021/6/pallyy.json": "最もリーズナブルなソーシャルメディアスケジューリング＆自動投稿プラットフォーム。Instagram、Facebook、Twitter、LinkedInなど、すべてのソーシャルプラットフォームにコンテンツを一度に公開できます。",
  "data/ph-top/2021/6/spyneai-s-car-background-tool.json": "SpyneAIは、スタジオスタイルの背景をあなたの車に生成します。それは100％自動的に動作します。あなたの車の画像をアップロードし、好きな背景を選択して、私たちの魔法のAIが数秒であなたの車の画像を変換するのを見てください。フルハイビジョン画質でダウンロードできます。",
  "data/ph-top/2021/6/maze-templates.json": "あらかじめ用意された50以上のユーザーテストやアンケートのライブラリにアクセスして、コピー、カスタマイズ、自社のユーザーとの共有が可能です。コンテンツ、コンセプト、ユーザビリティテストからフィードバック調査まで、テンプレートを使えばインスピレーションを得て、より早くインサイトを収集することができます。",
  "data/ph-top/2021/6/cartloop-rewards.json": "私たちはCartloop Rewardsを構築し、Gorgias、Typeform、Clercaoなどのクラス最高のツールを使ってShopifyマーチャントがビジネスを成長させ、より多くの売上を達成できるようにしました。無料でアクセスして、あなたのShopifyストアをプロのように運営してみませんか？🚀",
  "data/ph-top/2021/6/icons8-google-docs-add-on.json": "何千もの手作りのアイコンをGoogle Docsの中で利用できます。Icons8アドオンは、Google Docs、Sheets、Slidesで動作します。- プレゼンテーションを充実させる - シートにスパイスを加える - 読み手を文書に引き込む",
  "data/ph-top/2021/6/price-tags-ios.json": "プライスタグアプリを使えば、ビジネス向けのソーシャルメディアコンテンツをわずか数分で簡単に作成できます。しかも、拡張現実（Augmented Reality）でも。あなたのブランドを際立たせるインパクトのあるコンテンツを作成しましょう",
  "data/ph-top/2021/6/match-dev.json": "Upworkで開発者のプロフィールを何時間も見ていませんか？TopTalやリクルーターに高い料金を払っていませんか？Match.devは、あなたやあなたのチームにぴったりの、吟味された開発者とペアリングしてくれるエキスパートと、無料で簡単にチャットすることができます。",
  "data/ph-top/2021/6/material-tailwind-kit-react.json": "Material Tailwind Kit Reactは、人気の高い2つのフロントエンド技術をベースにした、フリー＆オープンソースのUIキットです。Tailwind CSSとReactです。そのデザインは、GoogleのMaterial Designにインスパイアされています。✅ 120のエレメント ✅ 4つのサンプルページ",
  "data/ph-top/2021/6/protonmail-2-0.json": "エンド・ツー・エンドの暗号化メールサービス「ProtonMail」は、デザインを一新し、よりすっきりとした外観と、カスタマイズ可能なユーザーインターフェースを実現しました（テーマはダークバージョンとコントラストバージョンがあります）。",
  "data/ph-top/2021/6/the-sf-minute.json": "The SF Minuteは、サンフランシスコで最も人気のある地域情報誌です。毎週月曜日から金曜日まで、サンフランシスコのあらゆるニュースの中から、最も重要で興味深いものをお届けします。このニュースレターは、サンフランシスコで起こっている最新の情報を、素早く、簡単に読むことができます。",
  "data/ph-top/2021/6/nebo-4.json": "Neboは、技術者ではないチームメイトがコードを使わずにUIを構築することを可能にします。チーム内の誰もが、Reactコンポーネントを視覚的に組み立てて、マーケティングサイトやコアプロダクトのページを作ることができるようになります。",
  "data/ph-top/2021/6/nocodedevs-3-0.json": "プロが教える最新の#nocodeチュートリアル、Tips、トリックをご紹介します。膨大なライブラリーの中から、あなたのプロジェクトに必要なものを見つけてください。毎週、#nocodeメーカー、ツール、製品をフィーチャーした新しいPROおよびFREEビデオがリリースされます。",
  "data/ph-top/2021/6/investnix.json": "Investnixは、一般のインターネット・ユーザーに投資機会の世界を提供します。あらゆる投資分野から利益を得るための新しい可能性を、簡単かつ安全に発見し、学ぶことができます。",
  "data/ph-top/2021/6/hotglue.json": "hotglueは、ユーザーに真の価値を提供するために開発者が必要とする拡張性を犠牲にすることなく、スケールするネイティブSaaS統合を構築する最もシンプルな方法です。今すぐhotglueチームとのチャットを予約してください。",
  "data/ph-top/2021/6/unite-com.json": "あなたの大切なフォロワーを評価するために、グループでの自撮りが必要ですか？それとも、パンデミックで会えない友達と一緒に素敵な写真を撮りたい？unite.comへようこそ。ここでは、一人用の自撮り写真をグループ用のポートレートに統合します。今すぐ参加して、好きな人を招待しましょう",
  "data/ph-top/2021/6/ship-that-shit.json": "🚢 that💩は、あなたの💩をゲットするために毎月3つのイベントを開催するイベント型コミュニティです。1. デザインオフィスアワー 2. テクニカルオフィスアワー 3. 1ライナープラクティス/ファウンダースピードデート",
  "data/ph-top/2021/6/usage-for-mac.json": "あなたに相応しいモニターアプリです。もうすぐオープンベータ版が公開されます。そして発売はその数週間後になります。https://usage.pro",
  "data/ph-top/2021/6/wisesheets.json": "もう、分析する企業ごとに株式の財務情報をコピー・ペーストする必要はありません。世界の14の取引所の19年分の財務諸表と主要な指標をGoogle SheetsやExcelに直接取り込むことができます。",
  "data/ph-top/2021/6/superlocal.json": "スーパーローカルは、誰もが簡単に地元のコミュニティと深いつながりを持てるポジティブなプラットフォームです。私たちは、犯罪や安全に関する情報ではなく、本物の意味のあるつながりを地域社会にもたらすことで、これを実現しています。 ﻿﻿いつも自分の家のように。",
  "data/ph-top/2021/6/ui-chunks-e01-buttons.json": "UI Chunksは、デザインシステムの構造を意味する「チャンク」を学びやすく整理した、UIデザインの知識の完全なソースです。https://gumroad.com/a/43717747/EiVkk（74ページのガイド、Figma/Sketch Library）。この究極のボタンガイドを、コーヒー価格で手に入れよう。",
  "data/ph-top/2021/6/create-my-token.json": "Mintable、Burnable、Unlimited、Advancedを含むEthereum ERC20またはBinance BEP20トークンをブラウザから直接生成して配置します。コードもログインもセットアップも必要なく、たった5分で完了します。",
  "data/ph-top/2021/6/button-for-google-calendar.json": "Google Calendar™の概要をワンクリックで確認できるChrome™拡張機能です。また、通知機能や会議に素早く参加できる機能も備えています。このアプリを使えば、もう会議に参加できなくなるかもしれません。フリーでオープンソースです😇 自由なベラルーシ人によって愛を込めて作られました🤍❤️🤍",
  "data/ph-top/2021/6/adaptive-sdk.json": "Adaptive+は、アプリ内のSplashScreen提供のためのエディタとダッシュボードを備え、分析機能を内蔵した永久無料のモバイルSDKです。アプリのスプラッシュスクリーンを、アプリがまだロード中のユーザーにとってパワフルで魅力的な体験に変えてくれます。",
  "data/ph-top/2021/6/eevee.json": "あなたのテスラを充電するためのコストを発見してください。詳細なレポートを作成し、実際の消費コストを把握し、充電コストを会社の会計に含めることができます。すべて無料でご利用いただけます。",
  "data/ph-top/2021/6/cerebral-2.json": "不安と抑うつのためのヘルプ。オンラインでのプロバイダー訪問、ケアカウンセリング、処方箋のお届け。https://getcerebral.com/",
  "data/ph-top/2021/6/angellist-recruit.json": "真新しいAngelList Recruitは、スタートアップに適した人材を見つけ、つなぎ、採用するのに役立つ一連の製品です。AngelListの800万人以上のユーザーのネットワークを基に構築されたRecruitは、プレシードからポストIPOまでの10万社以上の企業の採用をサポートします。",
  "data/ph-top/2021/6/naturalycode.json": "💁 ♂ 役に立つ開発者をチームに加える 🤓 14のプログラミング言語を24時間365日即座に説明する準備ができている 👉 パーソナライズされたテンプレートを頼む 👌 ノーコーダーや開発者に最適 😃 今では説明を頼むことが喜びになっている ✅ 14日間の無料トライアル",
  "data/ph-top/2021/6/juno-3-0.json": "Junoは、ソーシャルリーディングプラットフォームです。良い本を見つけるのはとても難しいことです。私たちはこれをもっと簡単にしたいと思っています。Junoでは、お気に入りの本を共有したり、見つけたりすることができます。",
  "data/ph-top/2021/6/health-icons.json": "Health Iconsは、世界中の健康プロジェクトのために高品質のアイコンとシンボルを作成する、無料のオープンソースプロジェクトです。デザイナーと開発者からなるボランティアチームは、どんな用途にも使える大規模なアイコン群を作成するために集まりました。",
  "data/ph-top/2021/6/accord.json": "Accordは、スタートアップ企業の法的文書の作成、編集、署名を支援するウェブアプリです。NDA、LOI、MOU、Privacy Policy、Pilot Agreementsなどの無料テンプレートから始めましょう。",
  "data/ph-top/2021/6/nomad-terminal.json": "世の中にはたくさんの旅行コンテンツがあり、本当の逸品を見つけるのは困難です。そこで、私たちはNomad Terminalを立ち上げました。Nomad Terminalは、最も便利な旅行ツールやコンテンツを集めた旅行情報ディレクトリで、検索の手間を省くことができます🎉。",
  "data/ph-top/2021/6/helpspace-2.json": "充実した接客ツールで、あなたもお客様も大満足! チームインボックス、直感的なインターフェース、セルフサービスサイト、複数のインバウンドチャネルなどのメリットを享受し、市場での競争力を高めます。",
  "data/ph-top/2021/6/getfeedy.json": "お客様とのギャップをなくすために フィードバックを共有したり、興味深い製品の最新情報を入手したりすることを容易にしましょう。",
  "data/ph-top/2021/6/deploy-now.json": "IONOSのDeploy Nowを使えば、ビルドや帯域幅の制限なく、GitHubから静的なWebサイトやWebプロジェクトを直接git pushすることができます。ステージング、SSL、ジオアダンダント、DDoSで保護されたインフラは、無料プランに含まれています。",
  "data/ph-top/2021/6/nocode-revolution.json": "どんな問題に悩んでいても、ビジネスの規模に関わらず、NoCodeはあなたをサポートします。このページでは、コードを書かずにソフトウェアを開発することがどれだけ普及しているかを紹介します。",
  "data/ph-top/2021/6/thanaverage.json": "ThanAverageは、私たちが自分自身をどのように評価し、比較しているのかを非科学的に調査する小さなプロジェクトです。",
  "data/ph-top/2021/6/colors-9.json": "デザイナーやウェブ開発者にとって、COLORSは、次の美しいアートワークやユーザーインターフェースのために、適切な色を探求し、入手するのに役立ちます。",
  "data/ph-top/2021/6/twitter-profile-screenshot-with-nocode.json": "NocodeでTwitterプロフィールのスクリーンショットをアルバムにして、dropboxに保存。一定時間後にプロフィールのスクリーンショットを自動撮影する方法をご紹介します。",
  "data/ph-top/2021/6/uni-of-threads.json": "250以上のキュレートされたTwitterスレッドからプロダクトマネジメントを学ぶ",
  "data/ph-top/2021/6/zones-4.json": "この6ヶ月間、私は空き時間を利用して、おそらくしばらくの間、私の最後のアプリとなるであろうものに取り組んできました。このアプリは「Zones」と呼ばれ、あなたの人生の重要な部分を、タスク、サブタスク、アイデアを持つ別々のゾーンに整理するように設計されています。",
  "data/ph-top/2021/6/predesign.json": "私は、既存のモックアップテンプレートのウェブサイトでいくつかの問題を見て、その後、自分でそれらを解決することを決めたし、ここで私はあなたにあなたの個人的なだけでなく、プロフェショナルな仕事のために使用することができますにモックアップテンプレートのほとんどすべての種類を提供しています。",
  "data/ph-top/2021/6/unfreeze.json": "タイピングを減らし、コーディングを増やす。IDEに貼り付けられないコードのスクリーンショットにうんざりしていませんか？Unfreeze は、コードスニペット画像の OCR を行うシンプルな macOS アプリケーションです。- 要件：macOS Big Sur 11.0以上",
  "data/ph-top/2021/6/scarlet-illustrations.json": "135点の新しいシュールなイラストを使って、魅力的なUIデザインを作ってみませんか？スマートなコンセプトで、編集してあなたのブランディングに合わせるのも簡単です。Ai、SVG、PNG、Figma、Sketch、Adobe XDでインスタントダウンロードできます🔥 7000以上のイラストの一部 + 無料アップデート",
  "data/ph-top/2021/6/pretty-funnels.json": "Pretty funnelsは、デジタルファネルを整理・最適化するための無料ツールです🚀 👉 さまざまなマーケティングチャネルを理解する 👉 キャンペーンを事前に計画する 👉 獲得努力を価値あるものにする サインアップは必要ありません!",
  "data/ph-top/2021/6/bootstrap-builder-2.json": "高度に最適化された、設定可能で再構築されたダッシュボード モダンでユニーク、そして再構築された開発スタックは、HTML製品としてはこれまでになく、Nile Dashboardのためにゼロから作成されました。- フルスタイルカスタマイズ - レイアウトビルダー - コンポーネントビルダー",
  "data/ph-top/2021/6/nuftu.json": "最初のNFTを鋳造することは、初心者にとっては大変な作業です。ウォレットのセットアップ、エーテルの取得、イーサリアムのガス価格、異なるプラットフォームのナビゲート...。- それはとても複雑です。NUFTUはシンプルです。デジタルアートワークをアップロードし、米ドルで料金を支払えば、NFTの準備は完了です。",
  "data/ph-top/2021/6/suprematism.json": "シュプレマティズムはアートジェネレーターであり、インスピレーションの源でもあります。傑作を作って、写真として優れた品質で保存したり、プリントして壁に飾ったり、HDビデオとして保存したりすることができます。",
  "data/ph-top/2021/6/isometrica.json": "3Dイラストコンストラクタを使用して、Figmaで複雑なアイソメトリック・シーンを簡単に作成して、デザインを強化しましょう。自然なアイソメトリック・ビューを表現するために、影を適用することを忘れないでください。",
  "data/ph-top/2021/6/tella-2-0.json": "Tellaは、Webブラウザに常駐するカメラです。自分自身や画面、スライドなどを撮影することができます。ビデオの外観をカスタマイズすることができます。どこでも、すぐに共有できます。https://tella.video/intro-tella-20-3-cksh",
  "data/ph-top/2021/6/makini.json": "Makiniは、産業用システムのためのREST APIです。技術系企業は、顧客の産業用システムと接続するために、それがどのようなシステムであるかにかかわらず、すべて1つのシンプルなAPIを介して使用しています。これはPlaidのようなものですが、産業用です。",
  "data/ph-top/2021/6/core-web-vitals-in-website-auditor.json": "何百ものページを1つ1つGoogleのPageSpeed Insightsに通すのは面倒ですよね。WebSite Auditorの新しいモジュール「Core Web Vitals」を使えば、ウェブサイトの重要なページスピードデータを一箇所で自動的にチェックすることができます。",
  "data/ph-top/2021/6/the-kunalshah-show.json": "インドで最も好奇心旺盛な創業者の一人が語る、驚くべき洞察力とは？",
  "data/ph-top/2021/6/engagewith.json": "EngageWithで、より強く、より健康で、より幸せなチームを作りましょう。SlackやMicrosoft Teams内の自分のチャンネルで、チームメイトを評価しましょう。率直な感謝の気持ちを仕事の一部にして、大小の勝利を祝い、カスタマイズ可能な報酬を設定しましょう。",
  "data/ph-top/2021/6/read-something-great.json": "Read Something Greatでは、インターネット上のタイムレスな記事へのリンクを提供しています。一度に5つずつ表示されます。Change My Reads \"ボタンを押すと、さらに5つの記事が表示されます。次に退屈したときは、ソーシャルメディアでスクロールする代わりに、「Read Something Great」を読んでみてください。",
  "data/ph-top/2021/6/sktch-io.json": "https://sktch.io/ は、データドリブンでインタラクティブな Web サイトや Web アプリを構築するためのノーコードツールです。https://sktch.io/: 次のウェブサイト/アプリのMVPを開発するための最速の方法です。",
  "data/ph-top/2021/6/stripe-identity-2.json": "Stripe Identityは、グローバルユーザーのアイデンティティをプログラムで確認できるため、詐欺師からの攻撃を防ぎつつ、正当な顧客の摩擦を最小限に抑えることができます。",
  "data/ph-top/2021/6/system-color-picker.json": "これは、macOSに内蔵されているカラーピッカーを、多くの追加機能を備えたスタンドアローンのアプリとして提供するものです。コピー、ペースト、異なるカラーフォーマット間の変換、メニューバーからの直接切り替え、キーボードショートカット、ログイン時の起動など、様々な機能を備えています。",
  "data/ph-top/2021/6/drag-drop.json": "Drag & Drop Illustrations 80s-90sスタイルのシンプルなピクセルアート20点です。商業的なウェブプロジェクトやアプリに最適です。ファイルにはグローバルカラーが含まれており、簡単にカスタマイズできます。",
  "data/ph-top/2021/6/tactical-time-blocker.json": "このデイリーハイライトとタイムブロッキングのテンプレートは、最も重要なことに集中するのが難しい人のためのもので、何に集中すべきかが明確にわかるようになっています。✅ デイリーハイライト 🕰 適応型タイムブロッキング ✍️ メモ＋スケッチ用ドットグリッド",
  "data/ph-top/2021/6/headscroll.json": "HeadScrollは、ミュージシャンの楽器演奏をサポートする製品です。頭を傾けるだけで、譜面やコード、タブなどを操作することができます。この製品はまだベータ版ですが、皆様からのフィードバックをお待ちしています！😊。",
  "data/ph-top/2021/6/state-of-independence-2021.json": "コントラは、Li Jinとともに、「The State of Independence Report」を発表しました。デザイン、エンジニアリング、プロダクト、ライティング、コンテンツマーケティング、ソーシャルメディアなどの分野で活躍する10,000人以上の独立系ワーカーを対象に、仕事の内容、方法、理由を調査しました。レポートの全文は http://www.contra.com/freelance-industry-report-2021 をご覧ください。",
  "data/ph-top/2021/6/quest-5.json": "クエストでは、キャリアアドバイスを含むサウンドバイトを聞くことができます。それは、現場の専門家が短いオーディオクリップで専門的な質問に答えるところです。私たちは、仕事に関する親密で正直なストーリーを共有することで、キャリアを変えていくコミュニティです。",
  "data/ph-top/2021/6/open-design-sdk.json": "Open Design SDKは、Figma、Sketch、Adobe XD、Photoshop、Illustratorのデザインからデータを取得する、オープンソースのNode.jsライブラリです。",
  "data/ph-top/2021/6/retool-self-hosted.json": "ローコードアプリビルダーは、ドラッグ＆ドロップで簡単に作成できるビジュアルコンポーネントと、API、ロジック、エスケープハッチを組み合わせたもので、開発者は必要に応じてカスタムコードを作成することができます。また、お客様のプライベートネットワーク上で展開できるセルフサービスプランもご用意しています。",
  "data/ph-top/2021/6/ugly-deck-club.json": "問題：みんなあなたのデッキを嫌っている。なぜですか？ほとんどがクソだらけだからです。デザインが過剰で、派手すぎて、すべてのベルやホイッスルが単純な事実を隠している：あなたのコンテンツは最低だ。ここで醜いデッキの出番です。",
  "data/ph-top/2021/6/coinrule.json": "Coinruleは、あなたの暗号投資を自動化することで、あなたに代わって次の市場機会を捕らえます🔥 PHコミュニティ。Coinruleを7日間無料でお試し＋3ヶ月間10％割引（最大50ドル相当） http://bit.ly/CRoffer",
  "data/ph-top/2021/6/deepnote-for-teams.json": "Deepnoteは、データの探索、分析、提示を最初から最後までチームで行うためのノートブックです。Jupyterと互換性があり、クラウド上でリアルタイムのコラボレーションが可能です。",
  "data/ph-top/2021/6/founderfit-by-koble.json": "アーリーステージの投資家は、あなたが作っているスタートアップにフィットしているかどうかを判断してあなたを評価します。これをファウンダー・マーケット・フィットと呼びます。Founderfitは数秒でフィット感を計算するので、VCがあなたの経験をどう評価しているかを知ることができ、ピッチの際の当て推量を減らすことができます。",
  "data/ph-top/2021/6/q-stats-3-0.json": "Quoraマーケティングツール「Q-Stats」でQuoraマーケティングの世界への扉を開いてみませんか？最新版のQ-Statsでは、Quora上のすべての質問についてGoogleからSEOデータを取得し、ターゲット市場の関連する質問に焦点を当てます。",
  "data/ph-top/2021/6/fintech-by-sifted.json": "無料の週刊ニュースレター 毎週、ヨーロッパのフィンテックのトップトレンドやニュース、独占インタビューやインサイトを紹介しています🙌。",
  "data/ph-top/2021/6/lazyweb-alpha.json": "LazyWebは、広告やトラッキングのないシンプルなチャットインターフェースを備えた、会話型の検索エンジンです。質問に答えてくれたり、便利なリンクを送ってくれる賢い友人とのメッセージのようなものです。検索結果の表示方法を自分でコントロールできる初めての検索エンジンです。",
  "data/ph-top/2021/6/notion-finance-tracker-2.json": "美しく、直感的で、効率的に、個人の収入や支出、その他の財務活動を1つの場所で記録できるように設計されています。",
  "data/ph-top/2021/6/the-breakfast-2-0.json": "Breakfastは、出会い系アプリでもネットワークアプリでもありません。人のアプリです。実際に会って、新しい人と話す。朝食を食べながら。",
  "data/ph-top/2021/6/beams-3.json": "Beamsは、どんなテーマでも複数の声が集まるスペースです。どんなテーマでもマイクロポッドキャストを開始し、世界のどこからでも最大90秒のボイスレコーディングを共有できる人を追加します。会話の流れに合わせて、Beamsはあなたのグループとともに進化・成長していきます。",
  "data/ph-top/2021/6/carden.json": "Cardenは、消費したコンテンツを長期的な知識に変えるためのChrome拡張機能です。文脈に合わせてフラッシュカードを作成したり、詳細な統計情報を表示したり、ポイントを集めてレベルアップしたりと、さまざまな機能を備えています。",
  "data/ph-top/2021/6/lottiefiles-embed.json": "あなたのお気に入りのLottieのアニメーションをNotion, Medium, Ghostなどに埋め込むことができます - コピー＆ペーストで簡単にできます。https://lottiefiles.com/featured を見て、素晴らしいLottieアニメーションを見つけて、すぐに埋め込んでください! 質問がありますか？メイカーズに聞く",
  "data/ph-top/2021/6/outseta-2-0.json": "Outsetaは、認証、決済、サインアップフォーム、CRM、コミュニケーションツールなど、サブスクリプションビジネスに欠かせないタブレッスツールをすべて提供します。コードの有無にかかわらず、あらゆるウェブサイトビルダーや開発フレームワークと簡単に統合できます。",
  "data/ph-top/2021/6/plastic-tracker.json": "誤って落としてしまったプラスチックの破片が、どこに行ってしまったのか気になったことはありませんか？そんな疑問を解決するために、私たちは「Plastic Tracker」という地図を開発しました。場所を入力すると、プラスチックが海に落ちる可能性とその軌跡を見ることができます。",
  "data/ph-top/2021/6/reason-5.json": "Reasonはポッドキャスト好きのためのアプリです。友達と一緒にポッドキャストを聴いたり、素敵な発見を共有したり、ポッドキャストのホストとお互いにトピックについて話し合ったりできます🎧👋。",
  "data/ph-top/2021/6/razor-ui.json": "一貫性のあるコンポーネントライブラリを設計することは難しく、多くの時間とコストがかかります。私たちの解決策は Tailwind CSS用のモダンなUIキットです。あなたのプロジェクトにすぐに使えるインタラクティブなコンポーネントとテンプレートで、数え切れないほどの時間とお金を節約できます。",
  "data/ph-top/2021/6/testbox.json": "企業向けソフトウェアを購入する前に、複数の製品を比較検討することができます。スライド、売り込み、デモ、そして満たされない約束はもう必要ありません。購入プロセスを取り戻し、自信を持って決断することができます。無料でご利用いただけますので、お気軽にお問い合わせください。",
  "data/ph-top/2021/6/linkmngr.json": "LinkMngrは、リンクリターゲティング、ブランドリンク、チームコラボレーション、アナリティクスを備えた、シンプルで使いやすいリンク管理・短縮ツールです。",
  "data/ph-top/2021/6/flarum-1-0.json": "7年間の開発期間を経て、Flarum v1.0 \"Kangaroo \"がリリースされました! 新しいチーム、基盤、開発プロセス。最初の安定版をお届けするために、様々なことが変わりました。薄いベースソフトウェアで、大量の拡張が可能です。",
  "data/ph-top/2021/6/1password-8-for-windows.json": "私たちは、1PasswordがWindows上でできることをすべて再構築する旅に出ています。あなたも一緒に参加しませんか？",
  "data/ph-top/2021/6/premast.json": "プレマストを使えば、経験がなくてもプロフェッショナルなプレゼンテーションデザインを作成することができます。PowerPointとGoogle Slidesの両方に対応したPremastテンプレート、2つのソリューションをご紹介します。Premast plus WebアプリとPowerPointアドイン。ブランドコンテンツの作成、管理、共有。",
  "data/ph-top/2021/6/future-4.json": "Futureは、暗号や生物学、ゲームやソーシャルネットワークなど、テクノロジーが私たちの世界をどのように変えていくのかを探求するa16zの新サイトです。",
  "data/ph-top/2021/6/peanut-for-chrome.json": "ピーナッツが、より良いフライトとホテル選びをサポートします。閲覧中にCOVID-19の最新の旅行規則やビザの要件を確認したり、予約前にフライトの遅延を予測することもできます。今すぐExpedia、Booking、Google FlightsでPeanutをお試しください。Chromeに追加すると、無料でご利用いただけます。",
  "data/ph-top/2021/6/social-media-designs-and-templates.json": "ソーシャルメディアのデザインやテンプレートを活用して、コンテンツの企画・制作を加速させましょう。これらのテンプレートは、あらゆるソーシャルネットワークに対応しています。あなたのオーディエンスが最も活動的な場所に関わらず、今まで見せたことのないものがきっと見つかるはずです。",
  "data/ph-top/2021/6/mapwize-for-tableau.json": "MapwizeとTableauを連携させて、データを屋内マップ上でパワフルかつカラフルにビジュアル表現しましょう! 簡単にビジネスへの洞察を得ることができ、ショッピングモールの訪問者のトラフィックや収益が増加したり、オフィススペースのレイアウトを調整することができます🚀。",
  "data/ph-top/2021/6/ioon-1-0-rto.json": "またまた、こんにちは。昨年、IOONは#3 Product of the Dayとなり、Golden Kitty Awardsの最終選考に残ったことが発表されました。今日のIOONはReady To Orderです。というわけで、ようこそIOON RTO! IOON - 水と銀イオンだけ。リサイクル可能な、ポケットサイズのデバイスです。今すぐご注文ください。",
  "data/ph-top/2021/6/tachyon.json": "Tachyonは、ビッグデータの転送を容易にする、開発者優先のAPIです。例えば、ライフサイエンス企業がテラバイト級のシーケンシング情報を迅速かつ安全に、痛みのない方法で移動できるよう支援します。",
  "data/ph-top/2021/6/talscale.json": "Talscaleは、リモートで採用する技術者を評価するためのワンストッププラットフォームです。プロジェクトベースの評価やライブのペアプログラミング面接で候補者を評価し、一連のコラボレーションフレンドリーなツールでデータ駆動型の採用プロセスを構築します。",
  "data/ph-top/2021/6/anima-4.json": "Animaは、デザイナーと開発者のためのDesign to Codeプラットフォームです。Animaは、Figma、Adobe XD、Sketchのデザインを、開発者が使いやすいVue、HTML、Reactのコードに変換します。",
  "data/ph-top/2021/6/hera.json": "Heraは、あなたのミーティングのためのInboxです。- キー操作ひとつで次の会議に瞬時に参加できる - 会議にテンプレートを自動的に適用できる - 会議のハイライトや次のアクションをマークできる - NotionやTodoistにエクスポートできる...",
  "data/ph-top/2021/6/video-tool-stack.json": "厳選された80以上のビデオツールとプラットフォームのリストです。これらのツールは、動画クリエイター経済のバックボーンとなっています。メーカーやクリエイターを日々加速させているすべてのツールをご覧ください。",
  "data/ph-top/2021/6/rank-math-seo-pro.json": "Rank Math PROは、業界をリードするマーケターが信頼する世界有数のWordPress SEOプラグインです。そろそろ、何十もの余分なアドオンを必要とする（そして支払わなければならない）混乱を捨ててください。Rank Mathでシンプルにいきましょう。",
  "data/ph-top/2021/6/keypoints-for-google-slides.json": "KeyPointsアドオンは、生産性を10倍に向上させます。ユーザーがアップロードしたPDF/DOCXから抽出された重要なポイントでユーザーをサポートします。文書からのコピー/ペーストはもう必要ありません。AIにすべてを任せることができます。",
  "data/ph-top/2021/6/pico-max.json": "どこでも理想的な庭を育てることができます。10日間の毛細管現象を利用した自動給水機能、複数のマウント、伸縮式の成長ライトLEDシステムにより、寒い冬でも植物に毎日栄養を与えることができます。誰にでもできる... いつでも、どこでも栽培可能",
  "data/ph-top/2021/6/letterwell-2-0.json": "Letterwellは、メルマガの広告枠を売買するためのプラットフォームです。当社独自のマーケットプレイス・プラットフォームにより、毎月数千人のサイト訪問者がメールマガジン内の広告の売買を容易に行っています。",
  "data/ph-top/2021/6/clew-2-0.json": "頭の中で記録している仕事も、バラバラのツールの中で浮遊しているファイルも、メッセージスレッドの中で失われた文脈も、Clewですべてを解き放つことができます。デジタルブレイン-仕事に関連するすべてのものの記憶を文書化、視覚化、アーカイブする場所",
  "data/ph-top/2021/6/ghost-knowledge.json": "知識を得るためのより良い方法 1. 普段出版していない作家の読みたいエッセイのアイデアを提案する。2. 気に入ったアイデアをサポートするために、あなたは$を約束します。3. 3.私たちはお金を集め、著者と調整して、魔法を実現します✨。",
  "data/ph-top/2021/6/editr.json": "Editrは、あなたのビデオに完璧に近い字幕を自動的に追加します。あなたの動画を強化し、ミュートでコンテンツを見ている人を魅了します。動画をアップロードすると、機械学習とAIが数分で動画を書き起こします。",
  "data/ph-top/2021/6/notion-tools-2-0.json": "半年ほど前にNotion Toolsのhttps://www.notion.so/Notion-Tools-25d054da911344199cdf403cc04f317c を作ったのですが、https://www.reddit.com/r/Notion/comments/j2nnhj/a_curated_list_of_notion_third_party_apps_tools/ や https://www.youtube.com/watch?v=K24H6b0msrc の方々が手伝ってくれて、さらに追加することができました。皆さんからは、価格についての情報を追加してほしい、おすすめのものを教えてほしいという要望もありましたので、V2🙌に追加しました。",
  "data/ph-top/2021/6/adventurevue.json": "友達とのゲームナイトにインスピレーションが足りない？AdventureVueは、チャットボットエンターテイメントのNetflixです。論理的なスキルを試されるような、クレイジーなストーリーやミステリーが登場し、あなたの夜をアドベンチャーに変えます。無料でお楽しみいただけます。",
  "data/ph-top/2021/6/creators-toolkit.json": "驚きのクリエイターのための最大級のツールコレクション。Podcaster、Writer、Video Maker、Community/Newsletter Ownersなどの素晴らしいカテゴリーに最適なツールが見つかります。",
  "data/ph-top/2021/6/cartoon-selfie-by-cutout-pro.json": "人工知能の魔法で、あなたの写真を自動的に自撮り漫画にします。今すぐ自分の顔写真をアップロードすると、ワンタップで漫画のような自分になります。",
  "data/ph-top/2021/6/chatterbug-streams.json": "インタラクティブなライブストリームでスペイン語、フランス語、ドイツ語を学べる初のアプリ「Chatterbug Streams」で、新しい言語を学びましょう。リアルタイムのクイズや投票で自分のレベルに合ったPelotonのようなライブストリームを見ることができます。",
  "data/ph-top/2021/6/greenroom-by-spotify.json": "Spotifyの最新アプリで、バーチャルルームを使ってライブディスカッションを開催・参加できるようになりました。Spotifyのアカウントは必要ありません。議論の録音やチャットも可能で、スピーカーはジェムを獲得できます。",
  "data/ph-top/2021/6/ui-ux-checklist.json": "私の最初のテンプレート製品をチェックしてくれると、とても嬉しいし助かります。また、Ben Horowitz氏に触発されて、スタートアップにおける文化の創造と管理についての凝縮された概念文書を近日中に発表する予定です。応援よろしくお願いします。",
  "data/ph-top/2021/6/design-code-ios-2-0.json": "Swift、React、Flutterなどを使って実際にアプリを作って学ぶ。完全に再設計され、100％SwiftUIで作られています。ダウンロード、ピクチャーインピクチャー、お気に入り、履歴、ウィジェットなどの新機能を搭載。",
  "data/ph-top/2021/6/socialbook-checker.json": "動画を作ってくれるYouTuberを見つけることは、製品やサービスを宣伝するための超効果的な方法です。しかし、彼らと連絡を取るのはそれほど簡単ではありません。SocialBook checkerを使えば、YouTubeの検索結果からすぐに数百人のYouTuberにメールを送ることができます。",
  "data/ph-top/2021/6/trustpage.json": "お客様は、自分のデータが守られていることを知りたいと思っています。Trustpageは、あなたがどのようにそれを行っているかを簡単に示すことができます。あなたのビジネスを守り、顧客を満足させるために、オールインワンのTrust Centerで正しい手順を踏みましょう。",
  "data/ph-top/2021/6/graphcdn.json": "GraphCDNはあなたのGraphQL APIを拡張、検査、保護します。GraphQLエッジキャッシュでオリジンのトラフィックを最大95%削減し、アナリティクスでリクエストに関する洞察を得て、エラーを追跡し、悪意のあるクエリからAPIを保護します。",
  "data/ph-top/2021/6/ricotta-trivia.json": "Slackでチームと一緒に楽しみましょう。魅力的なトリビア、楽しいゲーム、アイスブレーカーで遊びましょう。- トリビアゲーム; 15k+の質問と15+のカテゴリー - 無料のアイスブレーカーゲーム - トレーニング、オンボーディング用のカスタムコンテスト オファーリンク - https://www.ricotta.team/trivia?ref=producthunt",
  "data/ph-top/2021/6/mega-creator.json": "Mega Creatorは、特別なスキルや高価なデザインソフトがなくても、誰もが素晴らしいビジュアルを作成できるオンライングラフィックアプリです。イラスト、写真、アイコン、AIによる顔写真など、テンプレートを使ったり、自分で作ったりすることができます。",
  "data/ph-top/2021/6/peppertype-ai.json": "🚀 Peppertype.aiでより良い、より速い文章を書こう! 広告のコピー、ブログ、コピーライティング、ウェブサイトのコンテンツ、商品説明など、25種類以上の素晴らしいコンテンツタイプを備えたPeppertype.aiは、あなたが必要とする唯一のコンテンツツールです。",
  "data/ph-top/2021/6/komodor.json": "Komodor は、開発者やオンコールチームが効率的かつ独立してトラブルシューティングできるようにする Kubernetes ネイティブのプラットフォームです。k8sスタック全体のコード、設定、サードパーティアプリの変更点を一元的に把握することができます。",
  "data/ph-top/2021/6/super-2-0.json": "Super 2.0には、super.siteサブドメイン、ページごとのコード＆SEO設定、パスワードで保護されたページ、ライブサイトエディタ、自動プリティURL、RTL言語サポートなど、Notionでウェブサイトを構築するための新機能が搭載されています。",
  "data/ph-top/2021/6/travel-guide-by-myluggage.json": "🏤 🏤 🏤 🏤 🏤 🙉 10分間の読書の後、旅行中に地元の人のように感じることを想像してみてください⚙ ️目的地に関する総合的で最も重要な洞察を得ることができます👉私たちのガイドであなたの旅行を最大限に活用してください。",
  "data/ph-top/2021/6/viasocket-ebl.json": "ViaSocket EBLは、複数のアプリとデータソースをシームレスに接続することで、カスタムワークフローを自動化することができます。従来であれば何日もかかっていたワークフローの自動化を、わずか数分の開発者の作業で実現できます。",
  "data/ph-top/2021/6/resume.json": "Figma用の高品質な履歴書テンプレートを10種類以上無料でダウンロードできます。",
  "data/ph-top/2021/6/tability-2.json": "Tabilityは、チームが成果に向けて一致団結するための、よりスマートでシンプルな方法です。シンプルで簡単な方法で、目標を計画、追跡、実行することができます。",
  "data/ph-top/2021/6/no-cs-degree-community.json": "独学やブートキャンプの開発者をサポートするコミュニティに参加してみませんか？経験豊富な開発者との音声通話によるAMAを行い、コードの学習、採用、より良い開発者になるための方法など、何でも質問することができます。",
  "data/ph-top/2021/6/notionery-automation-recipes.json": "Notionで作られた、インディーハッカーやノーコーダーのためのZapierオートメーションレシピ集です。数秒のワンクリックで自動化を有効にし、毎週8時間以上の時間を節約できます。",
  "data/ph-top/2021/6/refinery-website-editor.json": "Refineryは、静的なWebサイトでもReactアプリでも、どこでもあなたのコピーを改善します。AIが生成した提案を得て、ブラウザ上で編集を行い、公開することができます。Refineryは、PM、ファウンダー、マーケターがエンジニアに迷惑をかけずにコピーを微調整するために使用しています。",
  "data/ph-top/2021/6/realm-2.json": "Realmは、あなたの家のための最新のファイナンシャル・アドバイザーを構築しています。Realmの無料アカウントには、現在および潜在的な住宅価値の分析、リノベーションプロジェクトの正確なコストとROIの見積もり、予算と目標に基づいて優先順位を決定するツールが含まれています。",
  "data/ph-top/2021/6/captivate-2-0.json": "あなたのポッドキャストを、最もシンプルで洗練された方法で作成、管理、拡張することができます。2.0では、完全に刷新されたダッシュボード、簡素化されたワークフロー、優れたプロモーションツール、さらに多くのカスタマイズ可能な要素が含まれており、今後のさらなる発展に向けた基盤となっています。",
  "data/ph-top/2021/6/namify.json": "Namify.techは直感的なビジネスネームジェネレーターで、検索の本質を理解しようとし、実際に使える名前を提案してくれます キャッチーで意味のあるブランドネームのアイデアが1000件もあります ✅ ソーシャルハンドルの利用可能性 ✅ ドメインの利用可能性 ✅ 無料ロゴの利用可能性",
  "data/ph-top/2021/6/maker-stations.json": "Maker Stationsは、インスピレーションあふれるホームオフィスとマインドフルな生活をテーマにした出版物です。世界中のメーカーによる、美しく機能的なホームオフィスのセットアップを紹介しています。",
  "data/ph-top/2021/6/jebra.json": "2つのモジュールで構成されたデータ管理ソフトウェアです。(1)サードパーティのAPIを接続するデータエクスチェンジ。現在は社内で使用していますが、近々、外部の開発者向けにも使用する予定です。(2) Jebraチームが複雑なワークフローを自動化することを可能にするアナリティクスワークスペース。",
  "data/ph-top/2021/6/learney-2.json": "Learneyは、コミュニティが作成したナレッジグラフを使って、あなたの知識や興味に応じて最適な経路を計画することで、時間を節約します。",
  "data/ph-top/2021/6/podpage-2-0.json": "Podpage 2.0には、高度な収益化ツール、リスナーとのより良いつながり方、統合プラットフォーム、ゲスト管理、マルチユーザー・マルチポッドキャストアカウント、そして全面的に再設計されたユーザーダッシュボードが搭載されています。",
  "data/ph-top/2021/6/annie-music.json": "Annie Musicは、すべてのストリーミングプラットフォームからお気に入りの曲を1つのリンクで共有することができます。あなたの友人は、あなたのお気に入りの曲を、リンクを見つけるために何度もグーグル検索することなく楽しむことができます。Annieで共有するだけで、出来上がりです。",
  "data/ph-top/2021/6/battlecard-2.json": "最高のセールスツールは、長期的に大きな価値を持つ新興企業との連携を望んでいます。あなたが大きな市場を狙っている革新的な企業であれば、成功に必要なツールを紹介し、さらにROIを最大化するための無料クレジットも提供します。",
  "data/ph-top/2021/6/notion-portfolio.json": "わずか数分でポートフォリオを構築できるNotionテンプレートです。🖥️ あなたの仕事を紹介しましょう✍️ すべてのコンテンツをカスタマイズしましょう 📱 ソーシャルネットワークのプロフィールにリンクしましょう 🎙️ さまざまなプロジェクト、プロとしての経験、最高のコンテンツやポッドキャストのエピソードを共有しましょう。",
  "data/ph-top/2021/6/apostrophe-3-0.json": "オープンソースCMSをベースに開発されたパワフルなWebサイトビルダーで、マルチサイトに対応したインコンテクストのライブ編集やダイナミックなビジュアルデザインツールを提供します。拡張性に優れたモジュール式のシステムで、フルスタックのJS環境で、従来型またはヘッドレス型の導入が可能です。",
  "data/ph-top/2021/6/feed-5.json": "FEEDは、アイデアの共有をもっと楽しくする、新しいソーシャルビデオアプリです。誰とでも、どこでも、リアルタイムで話せて、集合ムービーが作れます。もうタイプする必要はありません。FEEDのコ・ストリーミング機能は、チャットとコラボレーションの新しい方法です。あなたのアイデアを共有するために、今すぐ新しいフィードに参加しましょう。",
  "data/ph-top/2021/6/dewey-3.json": "dewey.では、既存のTwitterブックマークをすべて取得し、検索、ソート、タグ付け、コレクションの作成、共有ができます。",
  "data/ph-top/2021/6/edge-2.json": "あなたのワークステーションをどこにでも。EDGEは、自宅で仕事をする際の生産性を高める、究極のラップトップおよびタブレット用アクセサリーです。必要な情報を常に目の高さに置くことができ、気が散ることもなく、携帯電話を充電したり、会議を明るくすることができます。",
  "data/ph-top/2021/6/vitadao.json": "VitaDAOは、初期段階の長寿研究に資金を提供する分散型集団です。私たちの使命は、オープンで民主的な方法で長寿治療薬の研究、資金調達、商業化を行い、人類の寿命を延ばすことです。",
  "data/ph-top/2021/6/copyhat.json": "半年前、私たちはGPT-3にTinderのオープナーを作成してもらい、それを本にまとめました。それらは面白く、驚くほど実用的なものでした。今回のCopyhatでは、この強力な言語モデルをポケットに入れておくことができるのです。",
  "data/ph-top/2021/6/interial.json": "Interialは、あなたが提供したビデオのフレームレートを、あなたの選択に応じて向上させます。現在、Interialでは、2倍または4倍のエンハンスメントを行うことができ、ビデオのフレームレートを大幅に改善し、よりスムーズにすることができます。",
  "data/ph-top/2021/6/cookie-popup-blocker.json": "https://world.hey.com/nasir/cookie-popups-have-ruined-the-web-fdaee6fe、madeeeのユーザーエクスペリエンスは最悪です。Cookie Popup Blockerは、無料でオープンソースのChrome拡張機能で、法的な条件に同意することなく、ブラウザに表示されるCookieポップアップを削除します。",
  "data/ph-top/2021/6/primer-rooms.json": "Primer Roomは、世界中の意欲的な子供たちが、自分の興味を探り、問題を解決し、共に創造するための、ライブでインタラクティブなオーディオ体験です。",
  "data/ph-top/2021/6/qr-code-generator-by-logaster.json": "ロゴスターでQRコードをすぐに作成できるようになりました。会社名やブランド名を入力し、ビジネスフィールドを選択し、共有したいリンクを挿入し、QRコードのスタイルを選択して「ダウンロード」をクリックするだけです。",
  "data/ph-top/2021/6/super-portfolio.json": "自分自身のための超強力なポートフォリオページを作成しましょう⚡️ あなたのオンラインプレゼンスをすべて1つの場所に集めましょう🥳 バイオ、カレンダー、ストーリー、リンク、ビデオ、プロジェクト、ツールスタックなど、様々なものを1つの場所にまとめたポートフォリオウェブサイトを簡単に作ることができます。",
  "data/ph-top/2021/6/notion-party-planners.json": "3つのテンプレートで構成されたパーティープランニングパック このテンプレートでは - 💸予算プランナー 🎈テーマのインスピレーション 🌮ベンダーの詳細 📝コラボレーション機能付きToDoリスト 🎮ゲームパーティーテンプレート 👰ウェディングプランナーテンプレート 🍨レシピのアイデア",
  "data/ph-top/2021/6/digital-design-talks.json": "🚨 偉大なデザイナーの知識を、意欲的なデザイナーと共有することができます🥰 毎週新しいインタビューが行われ、コミュニティから提案された質問も随時追加されます。✨ 業界をリードする人々の経験から学ぶことができます。",
  "data/ph-top/2021/6/sharedrop-2.json": "ShareDropは、ファイルを最初にサーバーにアップロードすることなく、デバイス間で直接、簡単かつ安全にファイルを共有することができる無料のウェブアプリです。",
  "data/ph-top/2021/6/autocomplete.json": "どんなテキストボックスでも文章をオートコンプリートしてくれるChrome ext。あらゆるウェブページのあらゆるテキストエリアで機能する、AIによる文章補完機能です。",
  "data/ph-top/2021/6/college-compendium.json": "最高の製品は、最高の知識を持った人が作る。一流大学の650以上のCSコースをクラウドソースで編集し、情報基盤を構築し、知的好奇心を探ります。",
  "data/ph-top/2021/6/newsly-2.json": "皿洗いや洗濯をしながら、料理をしながら、通勤しながら、リラックスしながら、流行のウェブ記事を聞いたり、自然な声で読んだりすることができます。お気に入りのトピックの最新情報を、これまで以上に簡単に得ることができます。SEOブログのアイデアや、英語の上達にも。ポッドキャストもあります。",
  "data/ph-top/2021/6/execute-3.json": "ブライアン・P・モラン氏とマイケル・レニントン氏の「12ウィーク・イヤー」のコンセプトを用いたこのテンプレートは、計画と実行の各ステップをガイドし、同期されたブロックやデータベース間で情報がシームレスに転送されます。",
  "data/ph-top/2021/6/tao-of-react.json": "構造的に優れた拡張性のあるReactアプリケーションを構築するためのルールとガイドラインの本です。アーキテクチャ、コンポーネント設計、テスト、パフォーマンスに関する実証済みのプラクティスを学ぶことができます。4つの章で構成されています。全部で70の原則があります。",
  "data/ph-top/2021/6/show-keys.json": "Show Keysは、ブラウザ上でキー操作を表示するユーティリティです。そして、それだけです。たった一つのことをするだけです。",
  "data/ph-top/2021/6/notion-website-kit.json": "Notion Website Kitでは、すぐに使えるテンプレートを使って、簡単にウェブサイトを立ち上げることができます。⚡️ 6種類のテンプレート🎨 色、フォント、テキストを簡単にカスタマイズできます。🔗 独自のリンクツリーを作成 👨💻 個人のウェブサイトを簡単に設定 📝 Notionを使ったウェブサイトの設定に役立つリソース",
  "data/ph-top/2021/6/inlytics.json": "LinkedIn Analytics For Personal Profiles --- ➡️ データを10倍速く分析する ➡️ 他の人にはないインサイトを見つける ➡️ 人々があなたのコンテンツにエンゲージする理由を見る ➡️ 複数のLinkedInアカウントを接続して、チーム、クライアント、エージェンシーと連携する",
  "data/ph-top/2021/6/billionaire-tax-calculator.json": "ForbesとProPublicaの画期的な調査に基づいたこの計算機を使えば、Maskify、Bezosify、Bloombergify、Buffettifyして税金を計算することができます。アメリカの税制がいかに超富裕層に有利なものになっているかがわかります。",
  "data/ph-top/2021/6/notion-landing-page-template-13856d86-dcb2-456d-ae6d-0445ea6011c3.json": "このNotionテンプレートには、以下のものがすべて含まれています。🎉 ヘッダー 💬 お客様の声 ✨ CTA ❓ FAQ 😸 ProductHuntバッジ 😸 説明文 💪 チームユーザー 💲 価格 📧 お問い合わせ 🗺 地図",
  "data/ph-top/2021/6/rick-s-reviews.json": "リック＆モーティ』のエピソードをランディングページに落とし込んだ！？リックとモーティのエピソードをランディングページにしました！キャラクターたちと一緒に、異なる次元や（奇抜な）別のタイムラインで、有名な失敗したスタートアップをレビューします。",
  "data/ph-top/2021/6/kilo-ssl-pro.json": "完全に管理されたSSL証明書管理システムを、サービスを指すすべてのドメインにSSL証明書を提供したいと考えているあらゆるSaaSに簡単に追加することができます。ブランディングページやトラッキングドメインを提供するSaaSに最適です。",
  "data/ph-top/2021/6/mypath.json": "キャリアを選択することは、人生において不可欠な決断のひとつです。仕事を経験した人の意見を参考にして、その選択をしてください。",
  "data/ph-top/2021/6/pricing-page.json": "製品の発売を控え、直前になって価格設定ページを作成する必要に迫られたことはありませんか？そして、価格を更新しようと思ったら、Stripeの設定とサイトの両方を更新する必要があります。今では自動生成され、同期されています。",
  "data/ph-top/2021/6/twm-logo-tester.json": "TWM Logotesterは、あなたのロゴの品質を即座にテストする無料で簡単な方法です。プロのデザイナーによって作られ、レビューされたこの製品は、4つの分野のデザイン基準に照らしてあなたのロゴをテストします。1. 1.独自性 2. スケーラビリティ 3. 背景の許容範囲 4. 色彩",
  "data/ph-top/2021/6/recruitbot-2.json": "リクルートボットは、機械学習を用いてお客様の採用傾向を理解し、3億5000万人以上の米国の候補者からなる独自のデータベースや、ATSに登録されているすべての履歴書から、インテリジェントに情報を収集することができます。",
  "data/ph-top/2021/6/noor-2.json": "Zoomのクローンや「バーチャルオフィス」のことは忘れてください。これは違います。2019年後半から、私たち3人は、リモートでコラボレーションするための素晴らしい体験を形にするために、毎日＆毎晩働きました。Slackではもう十分ではありません。私たちのユーザーは、すでに毎日何時間もNoorを使っています",
  "data/ph-top/2021/6/blurweb-app-2.json": "画面を共有したり、チュートリアルを録画したりする場合、機密情報の保護には時間がかかり、ライブでは不可能です。",
  "data/ph-top/2021/6/benetalk-3.json": "BeneTalkは、あなたのポケットの中のスピーチコーチです。吃音者による吃音者のためのデザインです。話すときにすぐにフィードバックを得て、進歩を記録し、洞察力を使って自分のリズムを見つけます。コミュニケーションに自信を持てるように、役立つ習慣を身につけましょう。",
  "data/ph-top/2021/6/monitor-buddy.json": "アップタイムの監視は、時に高価で複雑です。⠀ 私たちはそれを簡単かつ安価にします。⠀ 永久無料プランでは、最大5つのホストを監視することができます。クレジットカードは必要ありません。また、創業者が直接Twitterで24時間体制のカスタマーサポートを行っています。",
  "data/ph-top/2021/6/senpai-gg.json": "SenpAI.GGは、ゲームのパフォーマンスを向上させるAIベースのパーソナルゲームアシスタントです。SenpAI.GGデスクトップアプリケーションは、特許出願中のAI技術を活用して、ゲーム前、ゲーム中、そしてゲーム後にさまざまな推奨事項を提供します。",
  "data/ph-top/2021/6/recruitbot-3.json": "リクルートボットは、優秀な人材を採用するための最良の方法です。機械学習を利用して、あなたの夢の採用者から新しい候補者をリバースエンジニアリングすることで時間を節約し、あなたのメールから候補者の個人的な受信箱に直接ドリップキャンペーンを送信することで、あなたのレスポンスを最大化します。",
  "data/ph-top/2021/6/elementz.json": "革新的なAPIで使いやすく、美しいモダンなコンポーネントを持ち、コンポーネントのスタイルを簡単にカスタマイズできるTheme Makerツールも含まれています。UIライブラリに必要なものは何でも揃っています。",
  "data/ph-top/2021/6/transloader-3.json": "Macで何かをダウンロードしたいが、手の届かないところにあるのでは？問題ありません。Transloaderを使えば、どこにいても、iPhone、iPad、その他のMacからMacへのダウンロードを割り当てることができます。",
  "data/ph-top/2021/6/mars-genesis-1.json": "10,000個のユニークな火星の収集可能な小包は、地球全体をカバーし、所有者の証明はブロックチェーンに保存されます。デジタルカードをトレード＆コレクションして、火星の皇帝になろう👑。",
  "data/ph-top/2021/6/pause-4.json": "休暇管理ツールPauseは、チームを支援します。",
  "data/ph-top/2021/6/indie-worldwide.json": "Indie Worldwideは、世界中のインディーメーカーやファウンダーのためのオンラインミートアップグループです。私たちは、毎月のミートアップ、ウェビナー、そして非常に協力的でアクティブなSlackグループを開催しています。ぜひご参加ください。🌎🌍🌏",
  "data/ph-top/2021/6/dialogue-c3640a98-52fa-465a-951f-ff5ab2a48142.json": "Dialogue社のNo-Codeソリューションは、Eコマース中小企業がAIと自動化を利用して、迅速かつ容易に売上を増加させることを可能にします。ユーザーの行動をリアルタイムで分析、理解、最適化し、購入者に転換させます。",
  "data/ph-top/2021/6/surveys-by-hockeystack.json": "NPSをはじめとするリッチなアンケートを作成できる無料ツールです。デバイス別、サイト滞在時間別、終了意図別、ページ別にターゲットを設定できます。HockeyStackと連携し、質問の脱落、インプレッション、リファラー、フルユーザーセッションなどの詳細なデータを取得できます。",
  "data/ph-top/2021/6/dunk.json": "DUNKは、友達を秘密の目的地に連れて行くのに役立つモバイルアプリです! 👋 お友達を招待しましょう 🗓 日付と予算を決めましょう 🌎 秘密の目的地を選びましょう 🔥 D-DAYの前に、驚くようなからかい（ゲーム、手がかり、あえて）を作りましょう。",
  "data/ph-top/2021/6/kaapi-2.json": "Kaapiは、リモートマネージャーがより良いリーダーになるためのサポートをしてくれます❤️ 誰が不満を持っているかを把握する。🎉 一緒に楽しいアイスブレーカーゲームをする 📅 効果的なスタンドアップミーティングを行う などなど。リモートリーダーシップのための最新ツールキット😇。",
  "data/ph-top/2021/6/designify.json": "任意の写真をアップロードすると、魔法のように100％自動的にデザインに変換します。好きな編集を何枚もの写真に施し、美しい商品写真などをあっという間に一括作成できます。",
  "data/ph-top/2021/6/audience-feedback-for-creators.json": "NotionとTallyを使って、4つの簡単なステップで、完全に無料で「Audience Feedback/Ask Me Anything」を作成するテンプレートです。",
  "data/ph-top/2021/6/icebreakers-for-slack.json": "🧊 Brrrr....、あなたのSlackは凍えるような寒さです。氷を割る時が来ました。Boredでは、Slackに「アイスブレーカー」を用意しています。Boredは、あなたのSlackにアイスブレイクを提供します。楽しいコンテンツや奇妙なコンテンツを集めて、会話を盛り上げます。- スケジューリングして儀式を始めよう - 複数のチャンネルで使える",
  "data/ph-top/2021/6/mental-mirror-2-0.json": "メンタルミラーは、ジムで体を鍛えるように、心を鍛える能力を与えてくれます🏋️ 定期的に使用することで、あなたを取り巻く予測不可能な世界に立ち向かうための正しいスキルを身につけることができます😶🌫️。",
  "data/ph-top/2021/6/kin-habits.json": "Kinは、長続きする変化を生み出すためのソーシャル習慣追跡アプリです。健康的な習慣を効果的に身につけることを、簡単かつ楽しく実現します。新しい習慣を学んだり、既存の習慣を改善するためのコースを受講したり、友人と習慣を共有したり、さまざまなことができます。",
  "data/ph-top/2021/6/material-tailwind-dashboard-react.json": "Material Tailwind Dashboard Reactは、人気の高い2つのフロントエンド技術をベースにした、フリー＆オープンソースのダッシュボードです。Tailwind CSSとReactです。GoogleのMaterial Designにインスパイアされたデザインで、完全にコード化された膨大な数のコンポーネントを搭載しています。✅ 120のエレメント ✅ 2つのカスタマイズされたプラグイン ✅ 4つのサンプルページ",
  "data/ph-top/2021/6/floasis.json": "flOasis.ioでは、コネクション、ウェルビーイング、生産性のためのユニークな滞在を予約、共有することができます。刺激的な滞在💻リモートワークに適した🏄コミュニティとアクティビティ💡簡単で安全な予約🤩週単位、月単位の価格設定 滞在はリモートワーカーによってテストされ、承認されています!",
  "data/ph-top/2021/6/talk-to-your-users.json": "スタートアップ／プロダクトの世界では、「ユーザーと話せ」というのが最重要アドバイスのひとつです。このポッドキャスト（オリジナルの名前ですね）は、私が可能性のある/現在/未来/過去のユーザーと交わす実践的な例（実際の会話）のセットです。",
  "data/ph-top/2021/6/asking-franklin.json": "Asking Franklinは、コンテンツマーケターのための完全なツールセットです。人々がGoogleで探しているものを発見し、大量のコンテンツアイデアを得ることができます。今では、超強力なAIライティングアシスタントのおかげで、彼らの質問に関する記事を書くことができます。",
  "data/ph-top/2021/6/voice-channels-by-quill.json": "ボイスチャンネルは、通常のチャンネルと同じように、好きなだけ作成し、サイドバーに追加し、アクセスを制御し、リンクを張ることができます。スケジュールされたビデオ通話は、驚くほどフォーマルです。分散していても、オフィスのセレンディピティを捉えることができます。",
  "data/ph-top/2021/6/brave-search-beta.json": "Brave Searchベータ版は、あなたやあなたのクエリを追跡しません。これまでも。プライベートで独立しており、透明性の高いBrave Searchは、Googleに代わる真の選択肢です。モバイルでも、デスクトップでも、ウェブ上のどこにいても。プライベートな検索。安心して検索できます。痕跡を残さずに検索する。",
  "data/ph-top/2021/6/brand-kit-by-premast.json": "Premast Plus内のブランドキットでは、複数のブランドキットを作成してPowerPoint内でアクセスすることができます。自分のブランド資産を含むブランドキットを作成し、他の人にも使用してもらうことができます。ブランドを表現する統一されたプレゼンテーションを簡単に作成できます⚡。",
  "data/ph-top/2021/6/rocketlane.json": "Rocketlaneは、CS、オンボーディング、インプリメンテーションチームのための、目的別カスタマーオンボーディングプラットフォームです。Rocketlaneはあなたをサポートします。プロジェクトの目標達成 ⏰ Time-to-valueの短縮 🤩 5つ星のカスタマーエクスペリエンスの提供",
  "data/ph-top/2021/6/great-question.json": "Great Questionは、顧客調査を自動化します。参加者の募集から、インタビュー、アンケート、プロトタイプテストのスケジューリング、そして得られた情報をチームで共有するまで、すべてを1つの場所で行うことができます。顧客と話し、人々が望むものを作りましょう。",
  "data/ph-top/2021/6/noloco.json": "真のカスタムWebアプリケーションをこれまで以上に高速に構築します。Nolocoは、次世代の開発者のための完全なノーコードのソリューションです。Nolocoを使用すると、コードなしで強力な、カスタムWebアプリケーションを構築することができます - すべて1つのプラットフォームで。",
  "data/ph-top/2021/6/tweetflick.json": "Tweetflickは、お気に入りのツイートを保存、整理し、アクセスするためのスマートな方法です。ツイッターのパワーユーザーのためのツイートブックマークマネージャーです。",
  "data/ph-top/2021/6/copymonkey-ai.json": "CopyMonkey.aiは、Eコマース向けの商品説明文を生成・改善します。既存の説明文を評価し、不足している説明文を生成し、より良いパフォーマンスを確認することができます。",
  "data/ph-top/2021/6/video-podcasting-software.json": "最大4k,wavのオーディオ品質、自動転写、強力なテキスト検索を備えています。すべてのリモート",
  "data/ph-top/2021/6/viral-loops-for-newsletters.json": "あなたの出版物に紹介プログラムを素早く設定し、既存の読者があなたの読者を増やすことを可能にします。",
  "data/ph-top/2021/6/google-form-to-chatbot-2.json": "✅ 1分で既存のGoogleフォームをインタラクティブなチャットボットに変換することができます。✅ Googleフォームのアドオンとして作られており、チャットボットはCollect.chat内で作成されます。",
  "data/ph-top/2021/6/scaler.json": "FacebookのRobynアルゴリズムに基づいて作られた、Eコマースの顧客フローの穴を修正するためのツール「Scaler」をご紹介します。このツールは、KPI に対する E コマースの影響を簡単に見ることができ、メディア投資の効果を評価することができます。",
  "data/ph-top/2021/6/doodlicons.json": "無造作にデザインされたDoodleアイコンは、次のプロジェクトのワイヤーフレームに最適です。SVGとお気に入りのデザインツールをサポートしています。完全に無料のオープンソースです。",
  "data/ph-top/2021/6/frontend-toolbox.json": "たくさんのツールの中から、自分に合ったものを見つけるのは大変ですよね。そこで私はこのリストを作成しました。最高のものを簡単に見つけて時間を節約できるように。",
  "data/ph-top/2021/6/onfolk.json": "Onfolkは、人材の管理と給与支払いをシームレスにする企業向けソフトウェアです。タイム・オフ、自動化されたオンボーディング、英国の給与計算、そして中核的な人事をすべて1つのツールで行うことができます。スプレッドシートはもう必要ありません。さらに、年金、会計ソフト、一括払いなどのスマートな統合も可能です。",
  "data/ph-top/2021/6/instagram-hashtag-hunter.json": "あなたのInstagramプロフィールに合わせた適切なハッシュタグを見つけることができます。競合を分析して、関連するハッシュタグを手に入れよう。GrowMeOrganic Hashtag Hunterを使えば、Instagramのハッシュタグページのトップポストにランクインするのに役立つハッシュタグを見つけることができます",
  "data/ph-top/2021/6/vlc-mobile-remote-2.json": "VLC Mobile Remoteは、PC/MacでVLC、Netflix、Prime、Spotifyなどで再生しているメディアに、どこに座っていてもスマートフォン/タブレットでアクセスして操作できる、ユニバーサルリモコンのようなものです。",
  "data/ph-top/2021/6/cymfo.json": "Cymfoは、従業員がどのようにコミュニケーションをとり、感じ、反映しているかを分析します。その洞察力を利用して、メンタルヘルスの支援を行います。従業員が会社とのつながりを感じ、バランスのとれた充実した人生の一部であるポジティブな仕事体験をする環境を作りましょう",
  "data/ph-top/2021/6/not-real-twitter-2-0.json": "オリジナルのNot Real Twitterは、数年前にAirdevによって立ち上げられ、Bubbleを使ってコードなしで何ができるかを示すために作られました。それ以来、TwitterはUIを変更し、Bubbleはより強力になったので、コードなしで2.0を作る時が来ました。)",
  "data/ph-top/2021/6/accessible-livechat.json": "誰もがアクセスできる多機能なチャットウィジェットを作成します。あなたのオンラインビジネスを障がい者にも優しくし、顧客がより自由に会話できるようにします。",
  "data/ph-top/2021/6/seedscout.json": "2021年、ポッドキャストを始めることは、他の技術者と出会い、ブランドを構築するための最良の方法の一つです。Seedscoutは、このようなメリットを、仕事をせずに得られる方法です。予約、編集、制作は私たちに任せて、あなたは素晴らしい会話をすることに集中してください。",
  "data/ph-top/2021/6/product-ops-podcast-2.json": "製品運用部門は、スタートアップ企業の製品主導の成長のバックボーンになると考えられていますが、この分野ではまだ多くのことを学び、共有する必要があります。POPでは、世界各地の製品運用担当者の多様な視点と実用的な洞察を毎週お届けします。",
  "data/ph-top/2021/6/chrome-extension-kit-2-0.json": "マニフェストや環境の設定ではなく、Chrome Extensionの構築に時間を割く。Chrome Extension Kit には、実際に使用されている 17 種類のスターター テンプレートが含まれているため、面倒な作業を回避して、これまで以上に迅速な出荷に集中することができます。",
  "data/ph-top/2021/6/business-hr-tool-kit.json": "ビジネスを簡単かつエレガントに運営する 👉 契約書、ピッチデッキ、フォームを含むビジネス文書 👉 セールス、メディアキット、通知などのマーケティングテンプレート 👉 HRバンドル（フォーム、JD、ポリシー、採用モジュールを含む）。👉 インフォグラフィックとプレゼンテーション",
  "data/ph-top/2021/6/765-investment-funds-database.json": "https://www.linkedin.com/in/andrei-shemet-6a301495/ にテキストを送ってください。 私たちのアプリをチェックしてください https://apps.apple.com/gb/app/baby-sleep-tracker-shema/id1535608673",
  "data/ph-top/2021/6/3veta.json": "3vetaは、コンサルタントやクリエイター、サービス提供者に以下のような権限を与えるオールインワンソリューションです。📅 スケジュールを立てる、予約を受ける 🤙 ブラウザ上でビデオミーティングを開催する 💳 報酬を即座に受け取る 🌐 ウェブサイトを構築する ... and more!",
  "data/ph-top/2021/6/eyeware-beam.json": "iPhoneやiPadをWindows PCのヘッド＆アイトラッカーデバイスに！？iPhoneやiPadのTrueDepthセルフィーカメラを使って、Beamはゲームやストリームにヘッドトラッキングやアイトラッキングを素早く簡単に有効にすることができます。",
  "data/ph-top/2021/6/toucan-6.json": "品質、採用、アクセスに妥協することなく、最も明確で説得力があり、最も協力的なデータストーリーを記録的な速さで展開する 💪 コード不要のフレームワーク、ユニバーサルデバイス展開、柔軟なクラウドネイティブインフラを活用する",
  "data/ph-top/2021/6/june-for-slack.json": "Slackですぐに分析ができます。📊 指一本動かすことなくメトリクスを受け取ることができます🎉 マイルストーンが達成されたらお祝いしましょう👯♂️ メトリクスに基づいてチームをまとめることができます👉 試してみてください: https://slack.june.so",
  "data/ph-top/2021/6/typefully-pro.json": "強力な分析機能と高度なスケジューリング機能を備えたTypefullyアプリで、あなたのTwitterをレベルアップしましょう。",
  "data/ph-top/2021/6/stockhound-by-fabrikator.json": "StockHoundはShopify Storeのためのインテリジェントな在庫切れ監視員🐶です。StockHoundは、各商品の在庫切れの日付を予測し、在庫切れになりそうな商品のリストを送信します。複雑な問題をシンプルかつ効果的に解決してくれます。",
  "data/ph-top/2021/6/veezoo.json": "Veezooは、AIを活用したデータ分析ソリューションで、次のことを可能にします。 -技術者ではないユーザーが、平易な英語で質問することにより、データからインサイトを得ることができる -技術者が、セマンティックなSQLベースのモデリング言語を用いて、データの経験をキュレートすることができる 数秒で始められる",
  "data/ph-top/2021/6/13chats.json": "13Сhatsは、マーケティング担当者、営業担当者、サポートチームのための、クラウドベースのオールインワン・プラットフォームです。スマートなポップアップ、ウィジェット、ライブチャット、Facebook Messengerのチャットボットを使用して、オファーをパーソナライズし、訪問者をウェブサイトに留め、リードへと導きます。",
  "data/ph-top/2021/6/ecommerce-personalization-report-2021.json": "ネットコアクラウドは、2021年初頭に小売店200社と買い物客600人を対象に調査を行いました。このレポートでは、Eコマース小売業者のパーソナライゼーションの目標と課題について深く洞察し、さらに2021年に期待すべき主要なトレンドを発掘しています。",
  "data/ph-top/2021/6/sellercenter.json": "SellerCenterは、Amazon、Shopify、Aliexpress、Wish、Shoppe、Lazadaなどのベストセラーストアのリアルタイムデータとインサイトを提供することで、オンラインビジネスを運営する上でのアイデアを提供します。",
  "data/ph-top/2021/6/gosolo.json": "GoSoloでは、簡単にビジネスを開始し、ビジネス用の銀行口座を開設し、1営業日以内に請求書を発行して支払いを受けることができます。",
  "data/ph-top/2021/6/inai-vox.json": "私たちは、INAI Voxと名付けられた新しいAIの声を紹介します。✔ INAI Voxは、あなたの言語で、訛りのない流暢な声を出すことができます。47カ国語以上の言語を流暢に話すことができます。✔ 1日無料! プロダクトハントのための特別企画です。",
  "data/ph-top/2021/6/gantt-io-2-0.json": "Gantt.ioはユニークなガントチャートデザイナーで、驚くほど美しいプロジェクトプランを作成することができます。Gantt.ioは非常に素早く、非常に簡単に使用でき、プロジェクトのために関係者を説得したり、動員したりする際にプロ意識を示すことができます。",
  "data/ph-top/2021/6/hypercontext.json": "ハイパーコンテクストは、四半期ごとの優先事項、毎週のミーティング、エンゲージメント測定をすべて1つの場所にまとめることで、10万人以上のマネージャーとそのチームがハイパフォーマンスを発揮できるようにします。",
  "data/ph-top/2021/6/kobra.json": "Kobraは、機械学習のためのビジュアルプログラミング言語（Scratchのようなもの）です。⚡️ MLモデルやアプリを超高速で構築できます 🧱 ビジュアルなインターフェース = 複雑な構文を学ぶ必要はありません 📊 データセットマネージャとエディタを内蔵しています 💬 プロジェクトを世界と共有できます",
  "data/ph-top/2021/6/stakewise.json": "StakeWiseは、（2018年にさかのぼりますが）ETHのステイク体験全体をよりユーザーフレンドリーにし、個別にステイクした場合もプールの一部としてステイクした場合も、実際に柔軟にEtherを管理できるようにするというアイデアの産物でした。",
  "data/ph-top/2021/6/adeptid.json": "AdeptIDのAPIは、Future of Workアプリケーションを構築する誰もが、大卒ではない人材を発掘する方法にMLを簡単に組み込むことができます。AdeptIDは、（職種ではなく）伝達可能なスキルに基づいて、人材を仕事やトレーニングに結びつけます。",
  "data/ph-top/2021/6/courier-3.json": "CourierのAPIとStudioにより、開発者は適切なメッセージを適切なユーザーに適切なタイミングで届けることができます。無料で使える｜CC不要のSDK（Node.js、Python、Ruby、PHP、Go、Java用）。自動化｜ホワイトラベル｜受信トレイ／アプリ内｜環境設定",
  "data/ph-top/2021/6/spore.json": "Sporeは、あなたが稼ぎ、最高のコンテンツを共有し、ファンと交流するためのオールインワンの方法です。有料会員やポッドキャストのホスティング、ニュースレター、SMSなど、様々なサービスを提供しています。余分な手間をかけずに、すべてを一箇所で運営・管理できます。",
  "data/ph-top/2021/6/windows-11.json": "Windows 11は、新鮮な体験を通じて情熱を追求できる、落ち着いた創造的な空間を提供します。若返ったスタートメニューから、お気に入りの人、ニュース、ゲーム、コンテンツにつながる新しい方法まで",
  "data/ph-top/2021/6/bit-io.json": "巨大で安全な単一のPostgresデータベース。公開データと非公開データ。数秒でデータを追加。すべてのデータにクエリを実行。ワンクリックで共有できます。Postgresと互換性のあるデータベースを作成する最速の方法です。CSV/XLSをドラッグするだけで、データベースができあがります。",
  "data/ph-top/2021/6/wenew.json": "Beepleは、デジタルアートの分野で次の大きな動きをしようとしています。それは、時間の中の「象徴的な」瞬間を販売するNFTプラットフォームを立ち上げることです。",
  "data/ph-top/2021/6/ipod-classic.json": "Apple MusicやSpotifyでお気に入りの曲を聴きながら、iPodのノスタルジーに浸ることができるウェブアプリです。",
  "data/ph-top/2021/6/fococlipping.json": "ワンクリックで画像の背景を除去。最大3000x3000ピクセルのHD出力品質 簡単でユーザーフレンドリーなエディタインターフェイス カスタマイズされたテンプレートで画像の背景を変更できます。画像の一括処理機能は近日公開予定です。",
  "data/ph-top/2021/6/startup-academy-directory.json": "このディレクトリでは、50以上のスタートアップ・アカデミーとその顧客教育プログラムが紹介されています。このディレクトリには、50以上のスタートアップ・アカデミーとその顧客教育プログラムが掲載されています。よくある質問に対するメーカー自身の回答も含まれており、多くの刺激的な洞察をもたらします。",
  "data/ph-top/2021/6/cleep-pro.json": "Cleep Proは、あなたの人生の瞬間を簡単に撮影できる4KミニVlogカムです。サングラスや手首、帽子などに装着して、今までにない視点で次のビデオ撮影に臨みましょう。",
  "data/ph-top/2021/6/zero-to-marketing.json": "2週間ごとに1つのウェブサイトを選び、私がそのウェブサイトをどのように成長させるかを説明する短いケーススタディを書きます。",
  "data/ph-top/2021/6/trivia-2-0.json": "SlackやMS Teamsの中で、リアルタイムにチームと一緒に楽しいゲームをしましょう。1. トリビアクイズ (50K+ Qs, 毎月更新) 2. 人気のない意見の投票 3. ごちゃまぜワード 4. クロスワード 5. お絵かきクイズ 6. This or That 7. True or False 8. GIF Charades 9. ウォータークーラー",
  "data/ph-top/2021/6/laoshi.json": "老師は中国語の単語や文字の学習に役立ちます。お好きな教科書、科目、HSKをお選びいただけます。間隔を空けた反復練習で、単語を長く覚えられます。スマートフォンに直接漢字を描く練習ができます。",
  "data/ph-top/2021/6/landing-page-kit-from-framer.json": "ランディングページキットは、ドラッグ＆ドロップで簡単にインタラクティブなウェブサイトをデザインできるビルディングブロックのセットです。デスクトップサイトとモバイルサイトの両方に対応しています。- 60種類のコンポーネント - 100種類以上のカスタマイズ可能なプロパティとインタラクション - コードは不要",
  "data/ph-top/2021/6/maroo-2.json": "Maroo（YC S21）は、ウェディング業界向けに開発された新しい決済方法で、カップルが高金利のクレジットカードや個人ローンを避けることができます。その代わりに、結婚式にかかるすべての費用について、最大24ヶ月間、APR 0％の支払いプランを提供します。",
  "data/ph-top/2021/6/profilehunt.json": "Profilehuntは、あなたの仕事探しを整理するために作られたカンバンボードです。ブラウザの拡張機能を使って、どのウェブサイトからでも求人情報をボードに追加することができます。Profilehuntは、毎週リマインダーを送り、応募状況をアップデートします。",
  "data/ph-top/2021/6/sales-engagement-power-pack.json": "営業活動を始めるにあたっての注意点から、ビジュアルプロスペクティングのコツまで、営業活動を行う上で最も重要なポイントをまとめたお得で実用的なハンドブックで、実際に使われている数多くのテンプレートも含まれています。SDRによるSDRのための本です。",
  "data/ph-top/2021/6/markopolo-ai.json": "Markopolo AIは、Facebook、Google、InstagramでのPPCキャンペーンを自動化できるクロスチャネル広告SaaSです。GPT-3をベースにした広告作成機能をアドオンとして組み込むことで、エンドツーエンドのデジタル広告ソリューションを提供します。",
  "data/ph-top/2021/6/clearmix.json": "プロと一緒に体験談などの動画を作成する。ウェブカムやバーチャルスタジオでビデオを撮影し、その映像をプロが編集して、企業のウェブサイト、ブログ、YouTube、ソーシャルなどで使用します。",
  "data/ph-top/2021/6/rural-club-1-0.json": "フリーランスで仕事をしている方、リモートワークをしている方、自分でビジネスをしている方。もしかしたら、楽園のようなスペインやポルトガルにある最高の田舎で、リモートで仕事をするのが好きかもしれません。Rural Clubに参加して、田舎を愛する人たちのための厳選されたリソースを手に入れましょう。",
  "data/ph-top/2021/6/planta-2.json": "Plantaはスマートな農場管理ソフトウェアで、農場のすべての活動を簡単に計画、監視、分析することができます。",
  "data/ph-top/2021/6/hubstaff-tasks-2.json": "ハブスタッフ・タスクで生産性を向上させましょう。このアジャイルプロジェクト管理ソフトウェアは、チームがより少ない労力でより多くのことを行い、一緒にプロジェクトを計画し、ほとんどすべてを視覚化し、より多くのことを成し遂げることを可能にします。",
  "data/ph-top/2021/6/moonbeam.json": "次のお気に入りのポッドキャストを見つけるには、キュレーションされたハイライトのパーソナライズされたオーディオフィードを聴く必要があります。",
  "data/ph-top/2021/6/notion-minimalist-habit-tracker.json": "この概念テンプレートを使えば、ミニマルな概念環境の中で、自分の習慣を作り、記録し、振り返ることができます。特徴 - 習慣トラッカー - 週間目標統計 - 振り返りボード - 振り返り質問 - カスタムアイコンパックとカバー",
  "data/ph-top/2021/6/social-checkout.json": "Social Checkoutは、お客様が知り合いを紹介してグループ割引の利用を可能にする、すぐに使えるチェックアウトAPIです。マーチャントは、1回限りの購入と定期購入で異なる割引を設定することができます。顧客はより少ない支出で、マーチャントはより多くの利益を得ることができます。",
  "data/ph-top/2021/6/all-vision.json": "機械学習スタックは、All Visionなしでは完成しません。私たちのツールは、お客様に代わって新しいデータパターンを見つけて追跡し、お客様の既存のMLスタック用に構築されています。",
  "data/ph-top/2021/6/no-sugar-today.json": "糖質制限をしたいと思っていても、なかなか取り組めなかった？https://no-sugar-today.com は、砂糖を使わないようにするためのサポートをしてくれます。毎日チェックして、人前で自分の責任を果たしましょう。",
  "data/ph-top/2021/6/standupmonkey.json": "スタンドアップを行い、レポートを生成するためのセルフホスティングのslackボットです。",
  "data/ph-top/2021/6/page-pad.json": "Page Padは、ウェブ閲覧中に任意のウェブページにメモを作成するためのChrome拡張機能です。閲覧したあらゆるウェブページのメモを作成、編集、管理したり、特定のウェブサイト上のすべてのメモに簡単にアクセスできるようになります。",
  "data/ph-top/2021/6/dhiwise-kotlin-builder.json": "DhiWiseは、Android開発者のためのデザイン・トゥー・コード・プラットフォームです。あなたのFigmaファイルを、開発者が使いやすい、生産に適したAppコードに、光速で変換します。",
  "data/ph-top/2021/6/madgicx-budget-optimizer-for-fb.json": "Facebook広告の予算を手動で最適化するのは、複雑で時間のかかる作業なので、機械に任せるべきです。MadgicxのAutonomous Budget Optimizerに広告購入を任せて、予算が正しい方法で割り当てられるようにしましょう。",
  "data/ph-top/2021/6/hyperform-2.json": "あなたのウェブサイト、アプリ、APIをサーバーレスでホスティングします。一つのコマンドで、あなたのクラウドにデプロイされます。無料、オープンソース、そしてAWSとGoogle Cloudで動作します。",
  "data/ph-top/2021/6/company-culture-building-checklist.json": "このテンプレートには、従業員管理、エンゲージメントツール、アンケートなどが含まれています。また、従業員管理やリテンションに関するコンテンツも含まれています。 ご支援ありがとうございます。🙌",
  "data/ph-top/2021/6/predictive-analytics-tool.json": "予測分析ツールは、プログラミングを必要とせず、*.csvや*.xlsxのデータに以下の予測手法を適用することができます。- 線形回帰法 - ロジスティック回帰法 - 決定木分類法 マニュアルとサンプルデータが含まれています。",
  "data/ph-top/2021/6/lawzy.json": "たった40円で弁護士に質問ができるアプリ。フロリダ州のみ（今のところ）。新しい市場は近日公開予定です",
  "data/ph-top/2021/6/dojo-panda.json": "Dojo Pandaは、子供のための本の定期購読サービスで、毎月あなたの子供のためにパーソナライズされた本の箱を送ります。お子さまの年齢、これまでに本に触れたことがあるかどうか、読書レベル、興味、ご両親からのフィードバックなどに基づいて、本がパーソナライズされます。",
  "data/ph-top/2021/6/mockly.json": "Mocklyをチェック! 電子書籍やその他のファイルのための、カスタマイズ可能で魅力的なモックアップを素早く生成する方法です。PH/Gumroadローンチに最適です。PS: これはPHでの私の最初のプロダクトローンチです。",
  "data/ph-top/2021/6/this-song-plants-trees.json": "この短い（31秒）曲をストリーミング・プレイリストに追加してください。生成されたすべてのドルは、世界の森林再生のために使われます。100回のストリーミングごとに1本の木が植えられます。これは世界初のMP-Tree Offset your streamingです。",
  "data/ph-top/2021/6/bookmarked.json": "あなたのコミュニティでキュレーションされたブックマークコレクションを作成、共有、閲覧できます。🎉",
  "data/ph-top/2021/6/document-kit-for-pm-ui-ux-designer.json": "ドキュメントキットは、完全なデジタル製品の構築、研究、デザインを容易にするリソーステンプレートのフルセットです。- 6つの主要フェーズ - 各ステップのショーケース - カスタマイズ可能な25以上のドキュメント - 定期的に最新のドキュメントテンプレートを更新",
  "data/ph-top/2021/6/hide-my-web.json": "Hide My Webは、マウスのワンクリックでウェブページの要素を隠したり、ぼかしたり、ハイライトしたりすることができるクローム拡張機能です。また、Hide My Web を使用すると、ウェブページのタイトルを隠すことができます。Hide My Web の詳細については、弊社 Web サイトをご覧ください。",
  "data/ph-top/2021/6/balanced-8f5dd227-93f1-4e9d-8df6-4b58eaed2fe3.json": "Balancedは、使いやすさを追求した分散型のファイナンスプラットフォームです。ICONブロックチェーン上で資産を交換し、資産を借りたり流動性を供給することでBalance Tokens（BALN）が支払われます。BALN保有者は、プラットフォームの変更に対する投票権を持ち、ネットワーク手数料を得ることができます。",
  "data/ph-top/2021/6/copy-paste-css.json": "こんにちは！ 私の最新の小さなプロジェクトをご紹介します。また、いくつかのデザインシステムへのリンクも掲載しています。そう、Product Huntボタン🔥があります。",
  "data/ph-top/2021/6/prudentme.json": "Prudentは、個人の財務台帳を自動化し、意味のあるものにするためのデスクトップアプリです。資産、負債、収入と支出のアカウントをすべて把握できます。選択肢を明確にして、財務を最適化しましょう。すべてのデータはあなたのコンピュータに保存されます。",
  "data/ph-top/2021/6/type-studio-screen-webcam-recorder.json": "画面やウェブカメラをオンラインで録画する最も簡単な方法です。WindowsやMacで動作し、ソフトウェアのダウンロードやプラグインは必要ありません。録画したものをエディタで加工し、オンラインで直接共有することができます。すべてがシームレスなワークフローです。",
  "data/ph-top/2021/6/due-work-1.json": "due.workでは、たった1行のコードでサポートウィジェットを統合することができます。このウィジェットから、お客様はチケットを発行したり、フィードバックを作成したり、セルフサービスガイドを使って自分自身をガイドしたりすることができます。",
  "data/ph-top/2021/6/method-5.json": "方法5は、デザイナーからの最も頻繁な要望をカバーするために、11の人気カテゴリーの580以上のブロックで構成されています。データをコードに置き換えて、好きなスタイルを選ぶだけで、すぐに使えるウェブサイトやランディングページが完成します。Figma、Sketch、ReactJSに対応しています。",
  "data/ph-top/2021/6/reflective.json": "Reflectiveでは、人間が関与しない自動化されたビジネスワークフローを構築することができるため、最も複雑な手動プロセスであっても拡張することができます。コードは必要ありません。",
  "data/ph-top/2021/6/hashtrends.json": "HashTrendsアプリで、あなたのデジタル空間でのトレンドの話題を見つけることができます。あなたの周りでは様々なことが起こります。欲しいものを見逃さないように賢くなりましょう。新しいスタートアップが次々と登場する中、すべてのプラットフォーム用のアプリを管理し、適切なコンテンツを見つけることは困難です。",
  "data/ph-top/2021/6/ppc-gear.json": "PPC Gearが示す、Eコマース関係者がGoogle広告で損をするポイントとは？たった30秒で、パフォーマンスの低いキャンペーンを見つけ、それを解決するための迅速な方法をご紹介します。",
  "data/ph-top/2021/6/100-days-of-seo.json": "実用性の高いSEOのヒントを毎日受信箱に送り、100日でSEOの達人になりましょう。SEOエキスパートとしての8年以上の経験から得られたものです。",
  "data/ph-top/2021/6/dimely.json": "Dimelyは、あなたのデータを進んで透過的にマネタイズすることを可能にするアプリです。Dimelyを使えば、自分が絶対に納得できる方法で自分のデータを進んで共有することで、小さな受動的収入を得ることができます。友達を誘って、もっとたくさんの収入を得ましょう。",
  "data/ph-top/2021/6/bulletlog.json": "Bullet logは、ログの集約と統一のためのプラットフォームです。アプリケーションのログを収集し、問題をデバッグし、ビジネスイベントのアラートを設定し、slackやメールで通知を受け取ることができます。無料の開発者版もありますので、ぜひお試しください。",
  "data/ph-top/2021/6/ig-live-to-youtube.json": "IG Live to YouTubeソフトウェアは、Instagramのクリエイターのライブストリームを自動的に録画し、YouTubeに直接アップロードします。",
  "data/ph-top/2021/6/notion-sites.json": "Notionウェブサイトテンプレートのオールインワンライブラリ これらのテンプレートを使えば、Notionを使って素早く簡単に自分のウェブサイトやポートフォリオを作成することができます。",
  "data/ph-top/2021/6/claritee.json": "Clariteeのビジュアルコラボレーションハブとスマートワイヤーフレームオプションを使って、プロジェクトの初期段階でアイデアを明確にすることで、時間、コスト、RFC（変更要求）を削減します。",
  "data/ph-top/2021/6/mondrian-art-generator.json": "Hi Makers！🎨 オープンソースのジェネレーターを作ってみました 選択肢は無限にあります。- 何千もの美しい配色。- 写真の背景色をカスタマイズできます。- 写真の大きさは自由に設定できます。- 静止画と動画の切り替え - ジッター効果。",
  "data/ph-top/2021/6/portao-3.json": "Portão 3はLATAM地域の企業の出張、経費、支払いをサポートします。出張全体を記録するタイムラインから、最終的に100％管理するためのBIまで。経費を簡単に把握し、管理し、企業の出張費を30％節約することができます。",
  "data/ph-top/2021/6/tinter.json": "Tinterは、画像のカラーバリエーションを生成する小さなウェブツールです。このツールは、画像の品質を損なうことなく、複数のバリエーションを持つ画像のモノクロカラーを生成することもできます。",
  "data/ph-top/2021/6/portal-11.json": "Portalは、ゼロコンフィグ、P2P、暗号化されたライブフォルダ同期ツールで、あなたのギトギト感を尊重します。GitHub、Email、Google Photosのような3Pツールを使わずに、多くのデバイス間で写真、ビデオ、コードを同期するのに最適です。",
  "data/ph-top/2021/6/flowly-2.json": "FlowlyはNIHが支援するプラットフォームで、Pain StateからFlow Stateへの移行を教えてくれます。-リラックス効果のあるバーチャルリアリティの世界 -神経系をコントロールするためのバイオフィードバックトレーニング -進捗状況を把握するためのデータ分析 無料キット／メンバーシップ",
  "data/ph-top/2021/6/prosepen.json": "Prosepenは、クリエイティブなライターや読者のためのオールインワン・サイトです。美しいテキストエディタと複数のソーシャルメディア機能を備えています。あなたの文章を成長させ、あなたのファンを増やしましょう。",
  "data/ph-top/2021/6/calmframe.json": "Calmframeは、メッセンジャーのプロフィール写真にテキストフレームを作成する小さなウェブアプリで、もしかしたらあなたの休暇を救ってくれるかもしれません。",
  "data/ph-top/2021/6/60-startup-job-boards.json": "このStartup Job Board kitには、創業者が募集中の職務を掲載できる60以上のジョブボードウェブサイトが含まれています。このリストは、スタートアップ企業のファウンダーが求人情報を掲載したい場合に役立ちます。- フルタイム - パートタイム - インターン - フリーランサー",
  "data/ph-top/2021/6/easy-diagram.json": "基本的に、私はプロジェクトのためのアーキテクチャ図を構築するために苦労していましたが、正直なところ、適切なソリューションは見つかりませんでした。良いものではなかったり、多くの費用を支払わなければならなかったりしました。そこで、https://zdiagram.surge.sh/ 高品質のプロジェクトアーキテクチャを作成するためのシンプルなフリーツールを紹介します。",
  "data/ph-top/2021/6/investor-database-for-startup-founders.json": "この投資家データベースは、50人のVCとエンジェル投資家のデータと、彼らの電子メールアドレス、会社の詳細、リンクトイン、および所在地を含んでいます。このデータベースを1回の料金で入手し、投資家へのアプローチを開始することができます。あとは製品を作るだけです🚀。",
  "data/ph-top/2021/6/screenflow-10.json": "ScreenFlow 10は、macOS Big Sur向けに刷新された完全に新しいUIを持ち、カスタマイズ可能な新しいツールバー、再構築された環境設定ウィンドウ、改善されたタイムライントラック機能とメインメニューの構成を備えています。",
  "data/ph-top/2021/6/adsense-for-platforms.json": "ウェブ上の主要なスケーラブルな広告製品を使って、広告収益化をシームレスに統合します。AFPを利用するプラットフォームは、ネイティブダッシュボードにレポートを統合し、Googleがプラットフォームとエンドユーザーの両方に直接支払う柔軟なレベニューシェアを構築することができます。",
  "data/ph-top/2021/6/filmfinder.json": "映画を探すセッションを開始して、何を見るかを決定します。あなたの好みを設定して、一緒に映画をより早く見つけましょう。",
  "data/ph-top/2021/6/call-me-if-you-get-lost-id-generator.json": "Tyler, The Creatorの最新アルバムを記念して、自分と同じCall Me If You Get Lost IDを作成しましょう。",
  "data/ph-top/2021/6/sales-crm-by-cooby.json": "CoobyはモバイルファーストのセールスCRMで、スプレッドシートなしでセールスエンジンを数分で構築することができます👊。顧客のセグメント化、キープインタッチリマインダーの設定、パーソナライズされたWhatsAppメッセージの送信、再会すべき連絡先の提案を得ることができます。iOSでご利用いただけます。",
  "data/ph-top/2021/6/identid-me.json": "identid.meは、あなたが理想の仕事に就くためのお手伝いをしたいと思っています。5分以内に誰よりも目立つポートフォリオの作成をお手伝いします。PS：このプラットフォームは無料でご利用いただけます。",
  "data/ph-top/2021/6/applaunchpad-3-0.json": "AppLaunchpadは、App StoreやGoogle Playに掲載する魅力的なスクリーンショットを作成するためのデザインツールです。特徴 1) 無制限のレイアウトとデバイスフレームの色 2) Unsplashによる何百万もの背景画像 3) ローカライズ 4) 100以上の事前構築されたデザイナーテンプレート",
  "data/ph-top/2021/6/beach-nearby.json": "地元の人のように世界のすべてのビーチを知ることができます。何千ものクラウドソースのデータをナビゲートして、夏を楽しむためにあなたの近くのベストビーチを見つけてください。https://beachnearby.com",
  "data/ph-top/2021/6/streamline-4-0.json": "Streamline 4.0は、アイコンやイラスト、絵文字を探して適応させる最もシンプルな方法です。機能豊富なアプリの中で、最も完全で、一貫性があり、特徴的なUIセットがすべて一つ屋根の下に収められています。無料で入手できます。",
  "data/ph-top/2021/6/meetric.json": "Meetricは、カレンダー📆に接続して、会議のメモ✍️やToDo✅を会議に参加している誰とでも簡単に書き込めるSaas製品です🧑🤝🧑。",
  "data/ph-top/2021/6/waydev-freemium.json": "Waydevは、エンジニアリングマネージャーがフィーリング重視のアプローチからデータ重視のアプローチに移行することを支援します。ウェイデブには、日々の活動のための具体的な指標や、経営者のためのハイレベルなレポートが含まれています。👨💻 ウェイデブはチームの活動をより可視化してくれます。",
  "data/ph-top/2021/6/glide-2-0.json": "本日、私たちはGlide 2.0を発表します。Glideのほぼすべての側面が更新され、洗練されています。アプリのための楽しい新機能、アプリビルダーのためのパワフルな新機能、チームのためのコラボレーション機能、仕事のためにデザインされた新しいテンプレートなどがあります。",
  "data/ph-top/2021/6/pitchlane.json": "アウトリーチでコンバージョン率を高める最も効果的な方法は、パーソナライゼーションを利用することです。Pitchlaneを使えば、セールスのアウトリーチ用に何百ものパーソナルビデオをすぐに簡単に作ることができます。",
  "data/ph-top/2021/6/code-house.json": "Code Houseは、開発者のためのチートシートを集めたオールインワンの倉庫です。230以上のソースから厳選された300以上のチートシートで構成されています。カテゴリやソースによるフィルタリング、時間や人気によるソート、ダークモード、ブックマーク、新しいチートシートの追加、リクエスト機能など、様々な機能があります。",
  "data/ph-top/2021/6/today-12.json": "カスタマイズ可能なシンプルなTodoリストは、24時間ごとにリセットされるので、重要な日々のタスクに集中することができます。",
  "data/ph-top/2021/6/lyfe-2.json": "人生は、さまざまな出来事、習慣、人々が混沌としています。Lyfeは、自分の心身の健康に影響を与えるものを理解するのに役立つAI搭載のアプリです。ユーザーのデジタルフットプリントを活用し、データサイエンスとAIを用いて意味づけを行います。",
  "data/ph-top/2021/6/orbit-connect.json": "イベントやコミュニティ、ワークスペースを真のネットワーキングの場に変え、参加者がオンラインや対面でお互いを発見し、つながるための迅速で簡単な方法を提供します。",
  "data/ph-top/2021/6/courseos.json": "📹 レッスン、コース、生徒、収益など、次のコースに必要なすべての要素を管理することができます🔥 Notionだけを使って何百時間もの時間とお金を節約することができます🎁 発売中は完全無料でご利用いただけます。",
  "data/ph-top/2021/6/postdates.json": "元彼（誰か）から荷物を返してもらう。NYとLAで発売中。",
  "data/ph-top/2021/6/dico.json": "開発者が文言を編集する手間を省く：Dicoを使えば、Webアプリのハードコードされた文字列をチームの誰もが更新できます。",
  "data/ph-top/2021/6/agencymax.json": "AgencyMAXは、代理店が代理店のために作ったものです。プロジェクト管理、アセット管理、クライアントポータル、請求書作成、分析、タイムトラッキングなど、クリエイティブエージェンシーの管理に必要なすべてのツールが揃っています。",
  "data/ph-top/2021/6/massless-media-api.json": "Massless Media APIは、メディアの作成、処理、および共有のためのシンプルなREST APIを提供することで、開発を高速化します。この API を使用して、メディアアプリケーションを迅速に試作できます。",
  "data/ph-top/2021/6/telie.json": "番組視聴の旅を記録したり、最新の視聴体験を通じて友達とつながったり、グループで視聴する番組に投票したり、プライベートリストやパブリックリストで共同作業をしたり、アプリ内やInstagramのストーリーを通じて友達におすすめの映画を送ったりできます。",
  "data/ph-top/2021/6/surge-8.json": "シンプルでシングルコマンドのウェブパブリッシング。コマンドラインから離れることなく、HTML、CSS、JSを無料で公開できます。数秒でデプロイできます。カスタムドメインを無料で追加できます。どんなものでも、今すぐ、無料でデプロイできます。",
  "data/ph-top/2021/6/find-food-support-by-google.json": "Find Food Support」は、ホットライン、SNAP情報、地元のフードバンク、フードパントリー、学校給食プログラムの受け取り場所などを紹介するGoogleマップのロケーターツールなど、人々を食のサポートリソースに結びつけます。",
  "data/ph-top/2021/6/copilot-by-github-x-openai.json": "GitHub Copilotは、エディター上であなたと一緒に働き、行や関数全体を提案してくれます。OpenAIを搭載し、何十億行もの公開コードで鍛えられたCopilotは、あなたの時間を節約し、集中力を維持するのに役立ちます。",
  "data/ph-top/2021/6/google-street-discovery.json": "世界195カ国、9,000以上の美しいGoogleストリートビューのロケーションをご覧いただけます。",
  "data/ph-top/2021/6/notion-freelancer-pack.json": "Notion Freelancer Packは、テンプレートパックであり、フリーランスビジネス全体を成功裏に開始、運営、管理するために必要なものがすべて揃っているシステムです。",
  "data/ph-top/2021/6/imagenai.json": "Lightroomのプリセットに別れを告げる、写真編集の未来がここにある。あなたと同じように編集し、編集時間を75%削減する、唯一のAI搭載のパーソナライズされたLightroom編集アシスタント、ImagenAIをご紹介します。",
  "data/ph-top/2021/6/munch-by-moving.json": "Munchのニュースレターは、ただの暗号ニュースレターではありません。暗号業界のコンテンツを毎日お届けしています。😎 私たちは、ビットサイズの暗号の洞察、トレンド、テクニカル分析を5分で読めるように提供することで、ノイズを減らしています。",
  "data/ph-top/2021/6/huddle-say-it-with-video.json": "ビデオメッセージで、家族や友人とパーソナルな瞬間をより意味のある形で共有できます。",
  "data/ph-top/2021/6/payflow-2.json": "🤑 月の中で一番いい日は？PAIDをもらった時！！！？それがPayflowです 👷♀️ 従業員：いつでも、すぐに、個人的に、無料で 👔 雇用者：従業員が本当に望む福利厚生で、 生産性と従業員の福利厚生を向上させます。",
  "data/ph-top/2021/6/github-notion-sync.json": "GitHubのすべての課題、ラベル、担当者をNotionと自動的に同期します。複数のリポジトリを同期します。ワンクリックで設定できます。",
  "data/ph-top/2021/6/showell.json": "受賞歴のあるセールスイネーブルメントプラットフォームで、セールスコンテンツの管理、提示、共有、追跡が可能。今、あなたの近くのすべてのデバイスでプレミア化されています。",
  "data/ph-top/2021/6/online-video-templates-by-pixiko-com.json": "👉次のオンラインビデオプロジェクトにすぐに使用できるビデオテンプレート集です。💪広告、プロモ、ソーシャルメディア、個人使用のビデオなど、数クリックで魅力的なビデオを作成できます。🤩オンラインでの動画編集がこれまで以上に速くなります。スキルは必要ありません!",
  "data/ph-top/2021/6/notion-resource-pack.json": "Notionを使う人のためのリソースを厳選して紹介しています。",
  "data/ph-top/2021/6/appcircle.json": "iOS、Android、React Native、Flutter用のモバイルアプリの継続的インテグレーション、継続的デリバリ、継続的テストのための自動化されたモバイルDevOpsプラットフォームです。AppcircleはエンタープライズグレードのDevOpsを誰にでも提供します。DevOpsの知識もMacも必要ありません!",
  "data/ph-top/2021/6/radix-colors.json": "Radix Colorsは、ゴージャスなWebサイトやアプリをデザインするための、アクセシブルでオープンソースなカラーシステムです。28色のカラースケール、各スケールに12段階のステップがあります。ダークモード対応。アクセシビリティに対応しています。各スケールに対応した透明バリアント",
  "data/ph-top/2021/6/aligning-cs-sales-and-marketing.json": "このステップバイステップのガイドでは、次のことを学ぶことができます。✅ なぜ全社的な調整が重要なのか、✅ カスタマーサクセス、セールス、マーケティングの各チームを完全に連携させる方法、✅ 質の高いリードを生み出し、成功する顧客を創出する方法。",
  "data/ph-top/2021/6/captain-stack.json": "Captain Stack は VSCode の拡張機能で、StackOverflow のコードの断片をエディタから直接見つけることができます。VSCode Insider (最新/非安定版VSCode)を使用する必要があります。VSCode Insider は https://code.visualstudio.com/insiders/ で入手できます。",
  "data/ph-top/2021/6/magic-links-by-sparkloop.json": "ニュースレターにマジックリンクを追加すると、読者はワンクリックであなたのメールリストに登録することができます（無料）。私たちは、あなたのオプトインプロセスから摩擦を完全に取り除きます。そのため、ニュースレターのスポンサーやクロスプロモ-ションの登録者数が20～50％増加します。",
  "data/ph-top/2021/6/verified-tweets-only.json": "チェックを入れるか入れないかだけで、認証済みのツイートだけをフィルタリングすることができます。ホームフィード、検索結果、ツイートリプライなど、ツイートが表示されるあらゆる場所で動作します。",
  "data/ph-top/2021/6/xd-to-sketch-converter.json": "XD to Sketch Design Converterは、SketchでのXdデザインの変換、オープン、インポートを数秒で行うことができます。🚀 今日は、すべての変換が$0.99のみです。 https://avocode.com/convert-xd-to-sketch ❤️🔥。",
  "data/ph-top/2021/6/kwayet.json": "チームでコミュニケーションをとるためのアプリはいくつかありますが、どれもWhatsAppやiMessageのような直感性や利便性に欠けています。⠀ Kwayetは、WhatsAppやiMessageのような直感的で便利な機能をチームにもたらし、電話番号も必要ありません。",
  "data/ph-top/2021/6/de-journaliste-a-no-codeur-le-livre.json": "2019年、私はノーコードを発見し、そのスポークスマンになる機会を得ました。この本では、私の世界に飛び込んでいただき、No-Codeの冒険を始めるための鍵を手に入れていただきたいと思っています。",
  "data/ph-top/2021/6/lernit-1.json": "Lernitは、大企業や中堅企業が重要な目標を定義して追跡し、従業員を評価して訓練し、従業員の強みと弱みを判断して、個別の学習プログラムを通じてスキルを開発することを可能にする企業プラットフォームを提供しています。",
  "data/ph-top/2021/6/bunch-6.json": "Bunchは、プレーンなテキストファイルをパワフルな自動化機能に変えるmacOSアプリです。すべての機能をメニューバーから利用でき、キーボードからのアクセスにも完全に対応しています。アプリの起動/終了、システム設定の変更、作業中の様々なコンテキストの自動化などが可能です。",
  "data/ph-top/2021/6/skiff.json": "Skiff 0.1のご紹介です。Skiffは、完全なプライバシーを保ったまま、ドキュメントやノートの共同作業を行うことができます。匿名のリンクを共有したり、エンドツーエンドの暗号化で作業したり、自動的にアクセス権を失効させたりすることができます。⠀ ⚡ Signup for free beta access today --> skiff.org 🔥.",
  "data/ph-top/2021/6/mini-video-me.json": "Mini Video Meは、画面録画中にウェブカメラをコントロールして、画面の重要な部分がカメラで覆われるのを防ぐことができます。また、ズーム、オフセット、カメラの形状、境界線の色、位置変更やサイズ変更のホットキーを簡単にコントロールすることができます。",
  "data/ph-top/2021/6/wrangle-for-slack.json": "👍 WrangleはSlackで承認やチケットのワークフローを管理する最も簡単な方法です。SlackがWrangleを \"注目のアプリ \"に選んだ理由をご覧ください。インテークフォーム、承認、タスクを必要なワークフローにまとめます。",
  "data/ph-top/2021/6/sleepos-by-eight-sleep.json": "睡眠の最適化を実現するプラットフォーム「SleepOS」をご紹介します。新しいホーム画面では、「Smart Temp Autopilot」、「Health Insights」、「Weekly Reports」などの新機能をご紹介します。https://www.eightsleep.com/sleepos/",
  "data/ph-top/2021/6/saas-pricing-calculator-2.json": "あなたのMVPは終わりました。技術的な問題はすべて解決しました。価格モデルを除いて、すべてが発売に向けて準備されています。Indiebrandsの新しいフリービーがお手伝いします。1) さまざまな価格モデルを比較する 2) 料金、税金、年間請求額を理解する 3) 目標を設定して共有する"
}