{
  "data/ph-top/2022/2/bubble-passwordless-auth-plugin-by-sawo.json": "Bubble.ioにパスワードレス認証をシームレスに統合し、コードなしでコンバージョンを54%増加させることができます。SAWOは、生体認証、ベータユーザー認証のサポート、マルチプラットフォームSDKを提供し、規模に応じて認証コストを75%削減することができます。",
  "data/ph-top/2022/2/first-100-users.json": "スタートアップの最初の100ユーザーを獲得する。実行可能なアイデア、明確なケーススタディ、シンプルなステップバイステップの説明。Hey Product Hunt 👋 オリーです。私は、創業者やメーカーが、無関係なインスパイアポルノから解放されて、ステップバイステップのマーケティングアイデアを見つけることができる場所を作りたかったのです。",
  "data/ph-top/2022/2/hera-calendar.json": "アカウントに関係なく、すべてのカレンダーを一か所で管理できます。Heraを離れることなく、イベントのスケジュール、空き時間の共有、一日の計画を立てることができます。タイムゾーンをサポートし、時間を保護する、リモートワーカーのために設計されています。サインアップして、Slackの活気あるコミュニティーに参加しましょう。",
  "data/ph-top/2022/2/gingko-writer.json": "まったく新しい書き方を試してみる。大枠の要約から詳細な散文まで、シームレスに書き進めることができます。カードと呼ばれる小さな「かたまり」で作業することで、より集中力を高めることができます。書きかけの文章を並べ替えることで、流動的に作業することができます。",
  "data/ph-top/2022/2/hugo-calendar.json": "あなたのカレンダー、メモ、タスク。簡単に整理できます。すべて一か所で。Hugoを使用すれば、会議のスケジュール、議題の準備、メモの共有など、チームや他のツールとのつながりを保つことができます。⠀ (Google または Microsoft 365 のアカウントで動作します。)",
  "data/ph-top/2022/2/ango-hub.json": "大規模な自動化とコラボレーションによるデータラベリングのためのオールインワンプラットフォーム。Ango Hubは、自動化とコラボレーションの最良の部分をプラグインベースのアーキテクチャに統合しています。AIによる支援とカスタムプラグインで、すべての非構造化データにアノテーションを付け、管理します。",
  "data/ph-top/2022/2/portant-workflow.json": "あなたの生活からコピー＆ペーストを削除します。〰Google フォームとシートを Docs と Slides に接続すると、チーム固有のニーズに合わせたカスタム ドキュメント ワークフローを作成できます。〰Portant は、仕事の退屈で重要な部分を解決し、楽しいことに集中できるようにします。",
  "data/ph-top/2022/2/tech-blogs.json": "オープンソースの技術系ブログ集。あなたのブログを追加して、記事の閲覧数を増やしましょう。",
  "data/ph-top/2022/2/a11yphant.json": "a11yphantは、開発者にウェブアクセシビリティの基本を教えます。短時間でインタラクティブなコーディングの課題やクイズをこなすことで、段階的に学ぶことができます。",
  "data/ph-top/2022/2/jet-admin.json": "社内ツールや顧客ポータルなどのカスタムビジネスアプリを、コードレスで驚くほど高速に構築できます。ドラッグアンドドロップの UI コンポーネントを使用して、あらゆるデータソースの上に複雑なマルチページアプリケーションを組み立てることができます。",
  "data/ph-top/2022/2/helloguru.json": "AirtableとTableauの出会い! 技術者でない人がデータを理解することを支援します。ユーザーはPostgresからGoogle Sheetsまで100以上のデータソースを組み合わせながら、コードを書くことなくチャートやテーブルを作成することができます。",
  "data/ph-top/2022/2/at-market.json": "at.marketには1000以上のドメイン名があり、あなたが欲しかったEメールを手に入れることができます。2つ目のメールアドレスは現在の受信ボックスを使用するため、すでに持っているメールアドレスと並行して、すべて無料で使用することができます。",
  "data/ph-top/2022/2/fitminder-3.json": "Fitminderは、健康、フィットネス、生産性を向上させ、座りっぱなしの仕事による悪影響を軽減します。長い一日の仕事の後、背中や首の痛みは忘れてしまいましょう Fitminderのエクササイズは、理学療法士との共同作業で生まれました。",
  "data/ph-top/2022/2/cosmo-by-exein.json": "Cosmoは、IoT開発者がデバイスの内部をより深く観察し、脆弱性を一目で理解し、簡単に修正できるようにするために開発されました。",
  "data/ph-top/2022/2/teacher-s-guide-for-english-for-tech.json": "現代の英語教師のための、現代的なツールです。✅技術業界の知識を広げる ✅より需要のある英語教師になる ✅有用なリソース、アクティビティ、ヒント、報酬を得る この教師用ガイドは、English For Techテキストとペアで使用することを想定しています。",
  "data/ph-top/2022/2/beseda-share.json": "1つのトピックで、会議をしない。ブラウザから直接ディスカッションを作成し、リンクを貼って誰でも招待できます。音声、ビデオ、テキストでコラボレーションを行い、終了したら結論でディスカッションを終了させます。チーム、ユーザー、顧客、請負業者とのディスカッションが可能です。",
  "data/ph-top/2022/2/coniun.json": "Coniunは、NFTの世界の参入障壁を下げることを目的としたプラットフォームです。新しいプロジェクトを発見し、NFTを管理できるようにするための分析を提供します。",
  "data/ph-top/2022/2/threadstart.json": "ThreadStartは、Twitterのスレッドを書き、スケジュールし、公開する最も簡単な方法です。リッチエディタを使えば、画像を追加したり、テキストをフォーマットしたりするのも簡単です。また、スレッドのプレビューはリアルタイムで更新されます。ThreadStart で時間を節約し、フォロワーを増やしましょう!",
  "data/ph-top/2022/2/climatiq-emission-tracking-api.json": "ClimatiqはREST APIで排出量計算の自動化を簡単に実現します。科学的に検証されたオープンデータを基にEdgeテクノロジーで構築された高速APIを使用して、貴社のソフトウェアに炭素測定値を組み込むことができます。",
  "data/ph-top/2022/2/resource-center-by-userflow.json": "Userflowの新しいリソースセンターは、ユーザーがアプリ内で直接ヘルプにアクセスできるようにします。リソースセンターはカスタマイズ可能なブロックのリストに拡張され、ユーザーは既存のナレッジベースを検索したり、必要に応じてUserflowフロー/ツアーを検索して開始したりすることが可能です。",
  "data/ph-top/2022/2/devtools-for-tailwind-css.json": "Tailwind CSSのDevToolsは、ブラウザ上でのデザイン、デバッグを復活させます。インテリセンスのオートコンプリート、JITのフルサポート、カスタムコンフィグ。ブラウザから直接操作できます。",
  "data/ph-top/2022/2/special-symbols-by-mumu-x.json": "絵文字や記号を、正確な名称を思い出すことなく選ぶことができます。Mumu Xは、GPT-3を利用した同義語を活用し、あなたの頭の中から思いついたものを元に絵文字や記号を探します。",
  "data/ph-top/2022/2/solana-pay.json": "次世代の加盟店決済のための分散型、安全、オープンソースの決済プロトコル「Solana Pay」をご紹介します。 羽ばたいていくお金。",
  "data/ph-top/2022/2/intergalactic-football.json": "Intergalactic Footballは、自分だけのサッカークラブを所有し、経営することができるゲームです。選手の売買やチームの戦術を設定し、リーグ戦に出場して実際の報酬を獲得することができます。",
  "data/ph-top/2022/2/split-lease.json": "ハイブリッドワークの出現で、ハイブリッドリビングのソリューションが登場。Split Leaseは、毎週特定の曜日や毎月の週を借りて、必要な夜だけ遊ぶことができます。これは、2つ目のアドレスを設定する最も簡単な方法です。",
  "data/ph-top/2022/2/nifty-displays.json": "アクリル製の美しいバックライト付きディスプレイで、NFTのアートワークをリアルに展示。充電式バッテリー、プリント上のNFT情報とQR、交換可能な画像、壁や机の上に飾るための取り付けオプションが備わっています。",
  "data/ph-top/2022/2/automated-finance-tracker-tradingview.json": "家計簿をつけるのは、もう問題ではありません。取引を追加すれば、自動的に残高が更新されます。取引（イン/アウト）を追加し、支払/収入方法を選択すると、計算式がすべてを行います。",
  "data/ph-top/2022/2/contactform-dev.json": "1分でフォームを整えよう。あらゆるタイプのフォームの開発プロセスを簡素化するお手伝いをします。",
  "data/ph-top/2022/2/fundraising-kit.json": "8つのガイド、20以上のテンプレート、30以上のツールなど、ラウンドの調達に必要なものがすべて揃った無料のNotionページです。100以上の創業者インタビューに基づく。300人以上の創業者によってレビューされた👀。",
  "data/ph-top/2022/2/gainy.json": "Gainy は、投資リサーチを民主化し、個人投資家を外出先でプロの金融アナリストに変身させます。🎯 自分の興味に基づいたユニークな投資アイデアを発見することができます。🏦 目標とリスクプロファイルに応じた投資ポートフォリオを管理することができます。",
  "data/ph-top/2022/2/antetype-2.json": "Antetypeは、UXデザイナーのための先進的なプロトタイピングです。レスポンシブなレイアウト、要素の同期、あらゆるインタラクションが可能です。これらの機能により、あなたが作ったプロトタイプは、まるで最終製品のように感じられることでしょう。複雑なプロジェクトでも、ステークホルダーを驚かせることができます。",
  "data/ph-top/2022/2/testsigma-2.json": "Testsigma は、ノーコードでオープンソースのテスト自動化プラットフォームです。ウェブアプリケーション、モバイルアプリケーション、API用のテストを数分で作成できます。セットアップ不要 🏃 平易な英語で5倍速くテストを作成 🔧 AIでメンテナンス不要 🧩 アドオンで楽にプラットフォームを拡張する。",
  "data/ph-top/2022/2/untapped-link.json": "開発者、デザイナー、メーカー、創設者、マーケティング担当者、暗号愛好家にとって興味深い500以上のツールやリソースを厳選し、上位1％を検索します。200時間以上節約できます。40以上の異なるカテゴリ。500以上のツールのデータベース。アクセス、フィルタリング、成長、その他多数。",
  "data/ph-top/2022/2/learnflow.json": "Learnflowは、Webflowのクローンを作るプロジェクトで、人気のNo-codeツールを統合する方法を学ぶための19のステップバイステップの演習で構成されています。Webflowは、そのすべてを接着するためのプラットフォームとして機能します。このプロジェクトは、スポンサーであるWeglot、Crisp、8020、Minimumのおかげで、無料で提供されています。",
  "data/ph-top/2022/2/vidds-2.json": "Viddsはオンラインで素早く簡単にビデオを作成できるツールです。テンプレートや独自のデザインを使って、シーンごとにビデオを作成できます。高速で、柔軟で、効率的です。",
  "data/ph-top/2022/2/alike-health.json": "Alike Healthは、独自のAI、クラウドソーシング、ビッグデータを活用してカルテの力を活用し、パーソナライズドヘルスを実現するデジタルヘルスケアカンパニーです。",
  "data/ph-top/2022/2/humanities-illustrations.json": "Webサイトやアプリに使える、人間味あふれる手描きイラストライブラリ。ウェブサイトやアプリに簡単に組み込める、一風変わったキャラクターの手描き透明PNGイラスト35点を無料配布。暗い背景でも明るい背景でも使えます。",
  "data/ph-top/2022/2/smart-cut.json": "スマートカットは、ビデオの無音部分を自動的に削除し、生の映像を数秒で完全なラフカットに変換することができます。オンラインで動作し、2クリックで完了します。",
  "data/ph-top/2022/2/forms-by-flowdash.json": "魅力的でブランド力のあるフォームをすばやく構築できます。作成したフォームを任意の場所で共有または埋め込み、新規レコードの作成や既存レコードの更新を安全かつ効率的に行えます。さらに、Flowdashのプラットフォームには、タスク管理、自動化、分析、API、Webhooksなどが組み込まれています。",
  "data/ph-top/2022/2/block-protocol.json": "A POWERFUL NEW PROTOCOL FOR DEVELOPERS 構造化データの世界に接続したインタラクティブなブロックを構築して使用する データドリブンなブロックを構築して使用するためのオープンスタンダード。あなたのアプリケーションを人間にも機械にも読みやすいものにします。",
  "data/ph-top/2022/2/subscriptions-on-streamloots.json": "Streamlootsのサブスクリプションを使用すると、ライブストリーマーは、高価な手数料なしで、彼らのコミュニティに一貫してそれらをサポートさせることができます。",
  "data/ph-top/2022/2/pixelme-3.json": "NFTの影響でピクセルアートがトレンドになっている昨今、PixelMeは画力がなくても数クリックで自分だけの8bitプロフィール写真が作れる無料ツールです。また、ランダムでアバターを生成することも可能で、楽しみながら利用できます。",
  "data/ph-top/2022/2/petsjoin.json": "新しいペットに出会って、最高の仲間になる。",
  "data/ph-top/2022/2/sales-consultants-directory-by-close.json": "営業プロセスの構築や最適化が必要ですか？チームを雇う必要がありますか？一貫して優れた取引を成立させるための技術スタックを選択する必要がありますか？100人以上の営業コンサルタントのディレクトリは、詳細なインタビューと豊富なプロフィールで、適切なアドバイザーを見つけるのに役立ちます。",
  "data/ph-top/2022/2/quan.json": "Quanは、エンゲージメント調査とウェルビーイング特典の間のギャップを解消します。ウェルビーイングの問題の根本原因を特定することで、最も効果的な解決策を示し、マネージャーとチームが必要とするサポートを提供します。",
  "data/ph-top/2022/2/seekwise.json": "技術、デザイン、製品など様々な分野の素晴らしいメンターをSeekwise.orgで発見 - 検証済みのメンター - 1対1のセッション - グループセッション - 簡単なスケジュール設定 - セッション後のメモ - レビュー - 無料および有料のセッション - 簡単なオンボーディング",
  "data/ph-top/2022/2/devfolio.json": "devfolio.ioを使えば、手作り感とデザイン性の高いテンプレートに基づいたプロ仕様のポートフォリオウェブサイトを数クリックで作成でき、次の仕事を獲得する可能性を高めることができます。",
  "data/ph-top/2022/2/cal-com-for-web3.json": "昨年のCal.comの壮大なローンチの後、私たちはDAOや他のコミュニティのスケジュール管理のニーズを支援するWeb3アプリケーションで戻ってきました。私たちの使命は、何百万人もの暗号の先駆者を含む「みんなのためのスケジューリング・インフラ」を構築することです。",
  "data/ph-top/2022/2/school-of-kubernetes.json": "School of Kubernetesは100%無料のKubernetesコース、トレーニング、そしてプロのKubernetes開発者になるためのハンズオン知識です。オンデマンドでコンテンツにアクセスでき、クラウドネイティブのキャリアにおいて次のレベルの成長を引き出すことができます。ビルドを開始する 🚀。",
  "data/ph-top/2022/2/aurora-backgrounds.json": "100枚以上の高解像度、オーロラ背景画像。何百もの自然界の感動的な画像から、私たちのお気に入りの素晴らしいオーロラを厳選して作成しました。",
  "data/ph-top/2022/2/bunzz.json": "🛠 GUIを使って数クリックで独自のトークン、NFT、DeFi Dapp、NFT Marketplacesなどを構築 ⚙️ Dapp開発者にとって最高のバックエンドソリューションであると同時に、独自の新しいモジュールをアップロードできる 💻 Bunzz SDKを使ってアプリにweb3機能を統合する。",
  "data/ph-top/2022/2/formfunction.json": "Formfunctionは、インディペンデントアーティストやクリエイターのために作られた、1/1 Solana NFTのマーケットプレイスです。私たちは、クリエイターが環境に悪影響を与えることなく、NFTで生計を立てるためのツール、プラットフォーム、そしてコミュニティを構築しています。",
  "data/ph-top/2022/2/sweatynft.json": "SweatyNFTは、一行のコードも書かずに、最大10Kのジェネレーティブアート作品を簡単に作成し、OpenSeaなどのマーケットプレイスでNFTとして販売することを可能にします。",
  "data/ph-top/2022/2/tagteam.json": "AIはフツーに難しい。私たちのAPIを使えば、4週間でAIソリューションを立ち上げることができます。TagTeamは、非構造化テキストデータのNLP APIを構築します。- 世界トップクラスのAIを搭載。- 簡単かつ迅速に統合できます。- カスタマイズ可能。- 低価格で透明性の高い価格設定。- 完全かつ継続的な管理。",
  "data/ph-top/2022/2/the-one-dao.json": "世界中の匿名の人々の集団が、世界で最も大きく、最も豪華な家を購入する。クラブでのパーティー、ボーリング大会 DAOメンバーが楽しめる21の部屋、年間を通して暗号のイベントを開催。",
  "data/ph-top/2022/2/warwordly.json": "WarWordlyはWordleのようなもので、友人と一緒に単語を推測して競います。英語とスペイン語で利用可能です。",
  "data/ph-top/2022/2/bizarre-travel-app.json": "定番の旅の提案に飽きたら Bizarre Travelは、探検したい、食べたい、眠りたい、そんなあなたのために、奇抜でユニークな場所を探してくれます! 私たちは、あなたの興味、旅行スタイル、予算などに基づいて場所をお勧めします。クッキーカットのようなものはありません。",
  "data/ph-top/2022/2/wunderbucket-2.json": "ローカルフォルダをWebサイトに コマンドラインや設定なしで、高速で安全なWebサイトを求めるデザイナーや開発者向けです。Dropboxにかわいい静的ホスティングサービスが誕生したようなものです。",
  "data/ph-top/2022/2/reaktr.json": "Reaktrは、美しいオーディオビジュアライゼーションビデオを簡単に作成する方法です。音楽と背景の画像や動画を選ぶだけで、Reaktrがそれらをミックスし、音声に反応するビジュアライゼーションが行われます。",
  "data/ph-top/2022/2/create-app.json": "webpack、Parcel、snowpackで新しいフロントエンドプロジェクトを超速でセットアップします。Reactやsvelteなどのメインライブラリ、テストツール、UIライブラリを選び、生成された設定をブラウザで即座に確認することができます。プロジェクトが入ったzipをダウンロードして、ハッキングを始めましょう!",
  "data/ph-top/2022/2/exnge.json": "非常に簡単なノーコードインターフェースを使って市場価値を予測する独自のニューラルネットワークを作成し、一貫して市場を打ち負かす最大の分散型AIを私たちと一緒に作りましょう。または、私たちが公表している予測を閲覧するだけでも構いません...",
  "data/ph-top/2022/2/podify-for-spotify.json": "Spotifyのポッドキャストを音楽と切り離して楽しみたい、ポッドキャスト流に整理したい？それならPodifyはあなたのためにあります。PodifyはあなたのPodcastをシンプルな方法で整理するツールを提供し、あなたが聴きたい次のエピソードを見つけるのを助けてくれます。",
  "data/ph-top/2022/2/t-drive.json": "電報を無制限のファイルストレージとして利用し、データの保護はそのままに、利便性を大幅に向上させることができます。無料、無制限、広告なし。",
  "data/ph-top/2022/2/extension-manager.json": "Chromeブラウザの拡張機能の有効化・無効化は、あまり簡単ではありません。私たちはいつもちょっとしたUXの課題に直面しています。この拡張機能は、クローム拡張機能管理ユーティリティへの素早いアクセスを提供します。",
  "data/ph-top/2022/2/adoptics.json": "AdOpticsは、広告主が多数のキャンペーンや広告グループにわたって広告を大規模にテストできるGoogle広告のための広告A/Bテストプラットフォームです。",
  "data/ph-top/2022/2/medusa.json": "Medusaは、オープンソースのヘッドレス・コマース・プラットフォームです。私たちのビルディングブロックを使って、好きなようにセットアップをカスタマイズしてください。決済、CMS、配送、分析など、プラグインプレイで簡単にセットアップが可能です。- コマーススタックのオーナーシップを持つ",
  "data/ph-top/2022/2/appmaster-io.json": "ネイティブWebアプリケーションやモバイルアプリケーションの構築、ビジネスプロセスの自動化、スケーラブルなバックエンドのセットアップのためのオールインワンのノーコードプラットフォームです。ドラッグ＆ドロップのインターフェースですぐに使えるアプリケーションを構築し、任意のクラウドに配備したり、オフラインで実行したり、ソースコードをエクスポートしたりできます。",
  "data/ph-top/2022/2/paz-for-startups.json": "インドのアーリーステージのスタートアップ企業で、従業員や事業に保険をかけたいと考えているなら、Paz for Startupsは最もシンプルな方法です。従業員やビジネスのニーズに合わせて、保険プランをカスタム設計し、初日から利用することができます。",
  "data/ph-top/2022/2/elon-sh-tposts-quiz.json": "あなたはそのsh*tpostの臭いを嗅ぐことができますか？15の質問で、あなたのsh*tpost検出能力をテストします。出演は、あのイーロン。",
  "data/ph-top/2022/2/meetrecord.json": "顧客獲得は難しく、顧客維持はさらに難しい。顧客との出会いは、見逃しがちなインサイトに満ちています。MeetRecordは、カスタマーサクセスチームがミーティングから深い洞察を得て、顧客維持を促進し、アップセルの機会を見出すことを支援します。",
  "data/ph-top/2022/2/tollguru-toll-intelligence.json": "通行料 燃料 トリップの最適化 TollGuruでトリップの意思決定をコスト・インテリジェントにしましょう。フリート、OEM、MaaSプロバイダーは、トリップ前のコストと時間のトレードオフ、トリップ中の通行料アラート、トリップ後の通行料請求に弊社のAPIを使用しています。",
  "data/ph-top/2022/2/mixr-2.json": "Mixrは、ビデオチャット、アーケードゲーム、会話のきっかけ、自動ブレイクアウトルームを備えたバーチャルゲームトーナメントを遠隔地のチームが開催することができるソーシャルプラットフォームです。社員は、全社的なリーダーボードに向けてトロフィーを獲得しながら、交流を深めることができます。",
  "data/ph-top/2022/2/email-warmup-by-salesblink.json": "メールの到達率を高め、スパムフィルターに引っかからないようにするための自動メールウォームアップツールです。実際のアカウントからメールを送受信し、完全に自動化され、常にボックスに着信します。",
  "data/ph-top/2022/2/dashworks.json": "Dashworksは仕事のスタートページです。チーム内の情報、コレクション、FAQ、会社のニュースなど、さまざまな情報を見ることができます。ブラウザの新しいタブに設定すれば、いつでもキープレスでアクセスできます。",
  "data/ph-top/2022/2/gostret-ch-boost-productivity.json": "Go Stretchは、反復性ストレス障害の症状を改善・予防するための素早い休憩を促す、無料のオンラインツールです。仕事をするように、自分自身をケアすることができます。15分ごとに30秒の小休憩、1時間ごとに10mの休憩をリマインドしてくれます。",
  "data/ph-top/2022/2/purelist-pro.json": "Purelistは、あなたの生活に役立つシンプルなリストアプリです。ToDo、メモ、リマインダーなど、すべてこのアプリだけで可能です。シンプルで最小限のインターフェースで、使い方を覚える必要はありません。",
  "data/ph-top/2022/2/abstractops.json": "スケーリングスタートアップの管理業務を効率化し、プロダクトと顧客に集中できるようにします。人事、財務、法務、コンプライアンスなど数十のシステムに散在するデータとワークフローを一元化します。経験豊富なオペレーターによる指導のもと、単一プラットフォームで会社を運営することができます。",
  "data/ph-top/2022/2/spurr.json": "Spurrを使えば、画面から離れて、タイムゾーンを越えて、チームで協力しながらチャレンジすることができます。1,000マイルを一緒に走ったり、10,000回の腕立て伏せをしたり、あなたの創造力を発揮して、チームのためにオリジナルのチャレンジを作りましょう。",
  "data/ph-top/2022/2/simplified-ai-writer.json": "SimplifiedのAIライターで、1つのアプリでマーケティングをスケールアップ。広告、キャプション、引用文などのコピーを瞬時に生成します。ブログ、書籍などの長文コンテンツを数分で作成できます。スピード感のあるコンテンツワークフローをチーム内で構築できます。マジック？いいえ、そうではありません。単純化されています。",
  "data/ph-top/2022/2/frase-2-0.json": "高品質なSEOコンテンツの調査、執筆、最適化を数時間ではなく、数分で行うことができます。ボタンをクリックするだけでコンバージョン率の高いコピーを生成するAI Writerを搭載し、アップデートされました。",
  "data/ph-top/2022/2/tooljet-2.json": "ToolJetは、社内ツールや業務アプリケーションを構築・展開するためのオープンソースのローコードフレームワークです。ToolJetは、Retool、Mendix、Microsoft Power Apps、Outsystemsに代わるオープンソースのフレームワークです。",
  "data/ph-top/2022/2/growth-manager-workspace.json": "Canva、Gather.Town、InVideoなど、ゼロから6ヶ月足らずの間に様々な企業と連携し、Toplyneの成長を支えた成長ワークスペースがここにあります。",
  "data/ph-top/2022/2/clay-8.json": "Clayで人と企業の生きたデータセットを発見し、充実させ、行動することができます。手作業を減らし、Upworkへの依存を減らし、エンジニアリングの時間を美しい製品に集中させることができます。今日から、無料で始めましょう。",
  "data/ph-top/2022/2/respona.json": "レスポナで質の高いバックリンクを構築し、ウェブサイトのオーガニックトラフィックを新たな高みへと導きましょう。関連するアウトリーチの機会を見つけ、適切な人の連絡先を取得し、パーソナライズされた電子メールシーケンスを数分で送信することができます。",
  "data/ph-top/2022/2/email-stash.json": "Email Stashは、すべてのメールマーケティング担当者のためのワンストップリソースハブで、📚 ニュースレター、電子書籍、ブログ、ポッドキャスト、ビデオ📃 メールマーケティングツールと代理店🤝 コミュニティとエキスパートによるネットワーク拡大が含まれています。",
  "data/ph-top/2022/2/praisio.json": "大企業から中小企業まで、クドカン（PET）の送信や構造化されたフィードバックを簡単かつ楽しく行えるプラットフォームです。すべてのPETは会社のタイムラインに表示され、継続的にポジティブな話題を提供し、人事やマネジメントのために社会性などの図表やデータを提供します。",
  "data/ph-top/2022/2/regex-library.json": "最も一般的に使用される正規表現を、様々なプログラミング言語でのコード例とともに紹介します。JavaScript、Python、Java、C#、PHP。",
  "data/ph-top/2022/2/path-chooser.json": "たった4つのパラメータで、2つの可能な経路を選択。",
  "data/ph-top/2022/2/kissflow-community-platform.json": "Kissflowコミュニティ・プラットフォームは、1.コミュニティ管理 - Spaces、Conversations、Events、Members Directory 2.コミュニティ管理 - Space、Conversations、Events、Members Directoryをサポートすることに重点を置いています。タスク管理 - バックオフィスによる管理 3. コミュニティ・エンゲージメントの向上 - サービスとしてのコミュニティ・スペシャリストの提供",
  "data/ph-top/2022/2/newsletter-glue-2-0.json": "ブログを書くところにニュースレターを書く。Newsletter Glueは、WordPressの中にあるニュースレター発行プラットフォームです。ブロガー、出版社、ビジネスオーナー、会員制サイト、ニュースルームなど、ニュースレターをより安定的かつ迅速に発行したい人向けです。",
  "data/ph-top/2022/2/stately-editor-beta.json": "Stately Editorは、どんなに複雑なアプリケーションロジックやワークフローでも、作成、編集、シミュレーションが可能なビジュアルツールです。",
  "data/ph-top/2022/2/spinach-io.json": "⏲スタンドアップの時間を半分に短縮 🎯よりシャープなアップデートを取得 🔎進捗状況とブロッカーを確認 🥬より健康でハッピーなミーティングを導く。",
  "data/ph-top/2022/2/five-cents.json": "Five Centsは、あなたの支出や収入を記録するのに役立ちます。新しいエントリを追加するには、プルダウンして、定期的に洞察を確認し、正しい意思決定を行います。",
  "data/ph-top/2022/2/birthday-app.json": "友達の誕生日を持って、FACEBOOKから永遠におさらば。誕生日アプリは、あなたの連絡先や友人の誕生日をすべて見つけ出し、カレンダーを作成します。あなたは指一本動かす必要はありません。",
  "data/ph-top/2022/2/placement-boards.json": "自動化されたジョブボードを自分で作ることができます。無料で。会社別、地域別、職種別、リモートなど、さまざまな設定が可能です。一度設定すれば、あなたのジョブボードには自動的に最も新鮮な求人情報が取り込まれます。ポートフォリオ、パートナーネットワーク、ドリームカンパニーなど、様々なプロモーションが可能です。",
  "data/ph-top/2022/2/effortlessly.json": "⚡️ キャッチーな広告インスピレーションコンテンツを入手（厳選された、深いフィルターにかかった広告例） 🚩 クリエイティブコンセプトで広告をフィルター（例：アンボックス、eBook） 📐 適切なメタパラメータ（例：サイズ、フォーマット、カラー） 💡&nbsp;Style featureで新鮮な視覚化アイデアを発見する。",
  "data/ph-top/2022/2/devtools-tech.json": "Devtools Techは、実際の面接問題の練習、コースの視聴、ブログの閲覧、コミュニティへの参加、様々なドメインやトピックでの進捗の確認など、エンジニアが学び、改善し、成長するためのプラットフォームです。",
  "data/ph-top/2022/2/creatorclub.json": "クラウドファンディング、eコマース、そしてその先を利用した革新的な物理的製品ビジネスを立ち上げ、成長させるためのスタートアップのための初のコミュニティベースおよびeラーニングプラットフォームです! 2月14日まで新規クリエイターを募集しています。",
  "data/ph-top/2022/2/maze-clips.json": "クリップは、ライブのモデレートされたリサーチセッションを実行することなく、ユーザビリティタスクのビデオやスクリーンレコーディングをキャプチャする最も簡単な方法です。Mazeのメトリクスにヒューマン・コンテクストを導入し、短時間で見やすい録画にすることができます。",
  "data/ph-top/2022/2/notion-freelancer-os.json": "Notionでフリーランスのビジネスを管理し、成長させるためのオールインワン・オペレーティング・システム。",
  "data/ph-top/2022/2/twik-2.json": "Twikは買い物客を理解し、その意図を予測する。自律的なパーソナライゼーションにより、買い物客が本当に欲しい商品を提示し、売上を伸ばします。Twikは、各ユーザーにユニークな体験を提供します。- 設定やメンテナンスは必要ありません。",
  "data/ph-top/2022/2/fantastical-scheduling.json": "空き時間を使ってFantasticalのリンクを作成・共有し、他の人があなたのスケジュールに合わせてミーティングを予約できるようにします。提案] を使用して、複数の日時を選択し、Fantastical リンクを共有し、他の人が皆に適した会議を投票できるようにします。",
  "data/ph-top/2022/2/community-masters.json": "コミュニティ・マスターズは、377ページに及ぶコミュニティ構築のための無料ガイドです。私たち自身の経験から、Discordサーバーを5万人のメンバーに拡大し、独自のコミュニティアプリを12万人のメンバーと2200のコミュニティに構築しました。",
  "data/ph-top/2022/2/rosita-longevity.json": "欧米諸国の平均寿命は85歳ですが、健康寿命はわずか65歳です:( 私たちは、高齢者の49％に影響を与え、将来の依存症を引き起こす静かな疫病である痛みと虚弱を引き起こす慢性疾患を予防することによって、60歳以上の愛する人の健康寿命の延長を支援します。",
  "data/ph-top/2022/2/q-by-substrata.json": "Qは、B2Bセールスのためのメールコミュニケーションの天才です。数百万件のデータから、見込み客の状況を「行間を読む」ことで把握し、次に取るべき行動を導き、商談成立の可能性を高めます。",
  "data/ph-top/2022/2/recall-7.json": "リコールは、映画やレシピ、最新の暗号など、あなたが興味を持ち、情報を得たいと思う話題について知識を蓄えることに焦点を当てたメモ帳ツールです。ぜひご覧ください👉 https://www.recall.wiki/",
  "data/ph-top/2022/2/looksmutable.json": "ダイヤモンドは永遠だ。ほとんどのNFTはそうではありません。そのため、一部のNFTは、事前の通知なく、また、あなたがいくら支払ったとしても、あなたの許可なく、いつでも外観を変更したり、広告を追加したり、存在を停止したりする可能性があるという秘密が隠されているのです。",
  "data/ph-top/2022/2/duffel-payments.json": "Duffel Paymentsを使って、簡単に航空券を販売しましょう。セキュリティと信頼性の高いStripeとの提携により、当社のAPIを通じて顧客に直接請求することができます。長い承認や初期費用を省き、数分でセットアップから販売まで行えます。",
  "data/ph-top/2022/2/lucky-orange-2.json": "Lucky Orangeのコンバージョン率最適化ツールキットで、ウェブサイト訪問者の顧客化を妨げているものを確認することができます。世界中の30万以上のウェブサイトから信頼されているツールで、訪問者の行動を調査します。",
  "data/ph-top/2022/2/okrs-templates.json": "目標設定に苦労していませんか？テーマや機能別に整理された数多くのOKRテンプレートから、インスピレーションを得てください。気に入ったものが見つかったら、Tabilityを使って数クリックでトラッキングを開始できます。",
  "data/ph-top/2022/2/rebel-girls.json": "Rebel Girlsは、世界各国や歴史上の女性たちの冒険や功績を描いたオーディオストーリーで満たされており、あらゆるリスナーを楽しませ、鼓舞し、自信を持たせるように設計されています。",
  "data/ph-top/2022/2/pay-later-by-interviewing-io.json": "Google、Facebookなど一流企業のエンジニアによる匿名模擬面接。アルゴリズムやシステム設計の問題を解決し、一流企業への転職を実現します。就職が決まるまでお金はかかりません。",
  "data/ph-top/2022/2/sets-3.json": "Setsは、コミュニティポータルを作成するSlackのアドオンです。その特徴は メンバーが同じような興味を持つ人を見つけるためのシンプルなプロフィール メンバーがリソースを共有するためのWiki コミュニティに最新情報を提供するためのイベントカレンダー",
  "data/ph-top/2022/2/strac.json": "Stracは、SSN、運転免許証、パスポート、銀行明細書、納税証明書、医療記録など、機密性の高い顧客データを電子メールから削除するビジネスを支援します。メールに保存されていないデータは盗まれないので、コンプライアンス監査に見事に合格することができます。",
  "data/ph-top/2022/2/nyckel.json": "機械学習チームを雇用することなく、また高価なMLインフラを使用することなく、製品にAIを組み込むことができます。5分でモデルを学習し、10分でアプリケーションに統合できます。Nyckelの直感的なUIとAPIが、重い仕事をすべてやってくれます。",
  "data/ph-top/2022/2/qvault-3.json": "そのため、さまざまなプログラミングコースに手を出し、ブートキャンプにも参加したことがあるかもしれません。しかし、残念ながら、あなたと次の開発者の間には、まだ何かが立ちはだかっています。私たちのコースとプロジェクトは、あなたの足かせとなっている知識のギャップを埋めてくれるでしょう。",
  "data/ph-top/2022/2/sourcegraph-for-vs-code.json": "Sourcegraph for VS Codeは、200万以上のオープンソースリポジトリのインデックスをIDEから直接検索することができる拡張機能です。VS Codeを離れることなく、サンプルコードを素早く見つけ、依存しているすべてのオープンソースライブラリをナビゲートすることができます。",
  "data/ph-top/2022/2/mesh-6.json": "https://morflax.com/mesh、わずか数秒で素晴らしい3Dイラストをデザインすることができます。200以上のアイコンと既成のテンプレートでビジュアルコンテンツを作成します。要素をドラッグ＆ドロップし、変換、カスタマイズして、ブラウザで直接画像をダウンロードできます。"
}