{
  "data/ph-top/2021/4/wormhole-2.json": "Wormholeは、エンド・ツー・エンドの暗号化と自動的に期限切れになるリンクでファイルを共有できます。",
  "data/ph-top/2021/4/nuke-your-inbox-by-mailman.json": "Nukeボタンは、保留になっているすべてのメールに「数日後に返事をする」と返信します。その後、数日間にわたって、それらのメール（1日1～2通）が表示されるので、圧倒されることなく返信することができます。⠀ インボックスゼロへの最速の道。",
  "data/ph-top/2021/4/the-table.json": "JotFormでは、お客様の生産性を高めるための方法を考えています。JotFormの最新製品であるThe Tableは、お客様のあらゆるニーズを満たす強力な機能を備えた最先端のテーブルです。",
  "data/ph-top/2021/4/rejoy-health-2.json": "コンピュータビジョンを利用したアプリと独自のウェアラブルセンサーで強化されたフィジカルセラピストが、筋肉や関節の痛みに最適なケアを提供します。痛みの軽減が実証された後、私たちは誰もが私たちの疼痛管理プログラムにアクセスできるようになりました。",
  "data/ph-top/2021/4/therappy.json": "CBT理論の基礎を習得し、日常生活に導入することで、ストレスや不安に上手に対処できるようになります。1日20分を自分のために使う。",
  "data/ph-top/2021/4/nft-of-the-day.json": "どのNFTが一番高く売られているのか、高値で売られているのか、最新の情報を得ることができます💰。たまにランダムなNFTを見て、何があるのか知るのもいいですね👀。",
  "data/ph-top/2021/4/pumpmygas-by-optimist.json": "アーティストやコレクターのために、プラットフォーム別のガス料金をよりよく理解するための最初のガスツールです。ガス料金は変化するもので、何をするか、どこでするか、どの速度でするかによって異なります。上部の「🐢」と「🐇」でガスの速度を切り替えることができます。",
  "data/ph-top/2021/4/gpt-3-custom-ai-voices.json": "Resemble AIが新たに搭載したGPT-3との連携により、リアルな広告コピーや会話を瞬時に生成することができます。プロの声を収録した既存のライブラリを利用したり、独自のカスタムAIボイスを作成したりすることで、高品質なナレーションやダイアログを生成することができます。",
  "data/ph-top/2021/4/q-money-not-another-bank.json": "Q.Moneyは他の銀行とは異なり、あなたのすべての口座を結びつけ、あなたのお金の味方になります。ご注意：現在、以下の国の銀行をサポートしています。スペイン、ポルトガル、ドイツ、イギリス、フランス。",
  "data/ph-top/2021/4/adept-school.json": "学位の有無にかかわらず、次のポジションに就くことができるオンラインコミュニティです。独学で学んだ開発者やBootcampの卒業生が、ネットワークを構築し、機会を見つけられるようにサポートします。",
  "data/ph-top/2021/4/1brand.json": "1Brandのブランド成長ソフトウェアは、ブランド資産管理ツールを組み込んだブランドガイドラインのウェブサイトを作成します。インハウスブランドにとっては簡単で利用しやすく、あらゆる規模のエージェンシーにとってはパワフルな機能を備えています。",
  "data/ph-top/2021/4/blogging-by-1mb.json": "ブログを作成する 美しいものにしてください。あなたのものにしましょう。あなたのストーリーを伝えたり、写真を共有したり、人生について好きなことを記録したりする、あなたのパーソナルスペースです。他の1MBメンバーはあなたのブログをフォローしたり、ブログ記事に「いいね！」をつけることができます。あなたのブログは、1MBの高速で安全なネットワークで管理されます。",
  "data/ph-top/2021/4/lou-3.json": "Louは、わずか数分で起動し、社内で作られたように見えるインタラクティブな製品発表で、ユーザーを積極的に惹きつけ、維持することを容易にします。Louを使えば、コード不要の美しいツールチップやアナウンスを作成することができます。",
  "data/ph-top/2021/4/dog-language-translator-by-toucan-bark.json": "Toucan社の科学者は、BARK社の主要な研究者と熱心に協力し、画期的な成果を発表する準備をしています。私たちの最も身近な存在である毛皮の友人たちに、彼らの言葉で知らせることができるようになりました。",
  "data/ph-top/2021/4/vera-co-browsing.json": "チームメイトと一緒にどんなウェブサイトでもCobrowse! Vera co-browsingでは、友達と一緒にどんなウェブサイトでも閲覧することができます。Googleドキュメントで作業をしたり、一緒にビデオを見たり、好きなだけ自由にチャットすることができます。今後も様々な機能が追加される予定です。",
  "data/ph-top/2021/4/duolingo-roll.json": "言語学習は難しい...だから、私たちはそれを柔らかくしました。新しい言語のフレーズを教えてくれるトイレットペーパーです！トイレを教室に変えることができます。自然は最高のプッシュ通知ですから、もうレッスンを見逃すことはありません。",
  "data/ph-top/2021/4/web-app-design-system-kit.json": "柔軟な Figma コンポーネントの一貫したフレームワークで、プロジェクトを迅速に実現します。💡 コア・コンポーネント 🖊 フォーム・コンポーネント 🔮 ライブラリ・スタイル 🍱 テーブル＆チャート・コンポーネント 🎬 テンプレート",
  "data/ph-top/2021/4/freehand-royale.json": "Freehand Royaleは、すべての人のためのオンラインホワイトボードであるFreehandに直接組み込まれており、チームメイトに宇宙征服のゲームを挑みながら、あなたの毎日に喜びをもたらします。",
  "data/ph-top/2021/4/writing-prompts.json": "斬新な文章のヒントが瞬時に得られるのに苦労する必要はありません。ボタン一つでさまざまなトピックやテーマを利用することができます。",
  "data/ph-top/2021/4/pokedex-2.json": "Pokédexは、毎日1枚のレアなポケモンカードを販売するためのマーケットプレイスです。カードの種類は、ベースセットからバトルスタイルまで多岐にわたります。さらに、毎週土曜日と日曜日には、1996年までのボックス、カード、パックを対象としたフリービーを1名様にプレゼントします。",
  "data/ph-top/2021/4/startweb-africa.json": "使いやすいテンプレートを使って、プロ仕様のウェブサイトやランディングページ、ファネルをすぐに作ることができます。また、StartWebは以下のような方々をサポートします。- ドメイン登録/ウェブホスティング - 当社の開発者によるカスタムメイドのウェブサイト - CRM、支払い統合など",
  "data/ph-top/2021/4/focuslite.json": "FocusLiteは、スケジュールごと、または1日あたりの予算ごとにウェブサイトをブロックします。(アクセス数+期間)。さらにモチベーションを高めるために、有料で「ストリークを開始」することができます。ストリークを失うと、お金を失うことになります。",
  "data/ph-top/2021/4/verte.json": "https://useverte.com 3つの簡単なステップで、Segmentのイベントにアナリティクスを導入できます。📚 Segmentアカウントとの接続 📦 テンプレートの選択 🔍 イベントの選択 今すぐ始めよう！👉 https://useverte.com 👈",
  "data/ph-top/2021/4/faang-shadi.json": "トップテクノロジー企業の中から、あなたのソウルメイトを見つけてみませんか？",
  "data/ph-top/2021/4/billable.json": "Billableは、プロジェクトに費やした時間を管理するのに役立ちます。プロジェクトを選択するだけで、あなたの時間を記録することができます。日ごと、プロジェクトごと、クライアントごとに美しく整理されています。",
  "data/ph-top/2021/4/uniu.json": "もし、お金をもらって技術を学ぶとしたら？UniUは、野心的な人が新しいスキルを学び、学んだことを応用するために、学習タスクを完了するための暗号報奨金を提供することで、インセンティブを与えるニュースレターです。情報は素晴らしいものですが、行動はすべてを変えます。",
  "data/ph-top/2021/4/socialq.json": "SocialQ+は、Facebook、Instagram、Twitter、telegram、reddit、tumblr、rssフィードチームメンバーLinkedIn、Youtubeへの投稿を同じ場所でコラボレーション、スケジューリング、分析することができるバーチャルなソーシャルメディアのスーパーヒーローです。",
  "data/ph-top/2021/4/preflight-c2431d6d-e301-4be6-8352-9899c4bd4a67.json": "開発者がリリースする前に最も重要な部分をテストすることで、CSチケットを減らすことができます。テストでチケットを減らし、何が問題だったのかを開発者に説明させてください。",
  "data/ph-top/2021/4/growth-tweets.json": "毎週更新される厳選されたツイートのコレクションは、時間を節約し、素晴らしい読書体験を提供するために特別に調整されています。ツイッターの新しい楽しみ方を提案します。",
  "data/ph-top/2021/4/bloo-lo-fi-wireframe-kit.json": "すぐに使えるライブラリを多数収録しているので、アイデアの設計や試作を迅速に行うことができます。250以上のビルディングブロックと150以上のスクリーンテンプレートが用意されています。Figma、Sketch、XDで使用可能",
  "data/ph-top/2021/4/resoume-v2.json": "Resoumeは、次の仕事の面接に向けて、美しいウェブサイト、ポートフォリオ、履歴書を作成できるプラットフォームです。また、ソロのフロントエンド開発者として、喜びと愛と汗と涙をもって取り組んだ最大のプロジェクトでもあります🙃❤️💦🥺。",
  "data/ph-top/2021/4/juststream-2-0.json": "JustStreamは、CPU使用率の低いコンパクトな形状でありながら、メディアのストリーミングやテレビへのスクリーンキャストが可能です。どんなフォーマットでも、どんな解像度でも（Ultra HDを含む）、そして最も重要なことは、ケーブルを必要とせずにメディアを放送できることです。",
  "data/ph-top/2021/4/30k-under-30.json": "本日は、Zeitgeist（zeitgeist.fm）の新プロジェクト「30K under 30！」をご紹介します。これは、インターネット上で最も影響力のある30,000人の人物を、AIが表現した自薦リストです。自分をリストに推薦してみましょう。30Kunder30.com",
  "data/ph-top/2021/4/backprop.json": "Backpropは、機械学習によるソフトウェアの強化を簡単に実現するAPI/プラットフォームです。すぐに使える強力なモデル、簡単なカスタム・アップロード、スケーラブルなインフラ、そして手頃な価格設定など、Backpropには必要なものがすべて揃っています。",
  "data/ph-top/2021/4/lip-gloss.json": "Lip Glossは、端末のユーザーインターフェースを設計するためのGoライブラリです。表現力豊かな宣言型のアプローチで端末のレンダリングを行います。CSSに慣れているユーザーは、Lip Glossを使いこなすことができるでしょう。",
  "data/ph-top/2021/4/rewardme.json": "RewardMeは、お気に入りの加盟店で自動的にリワードを獲得できる、新しい形のリワードプログラムです。電子メールアカウントやクレジットカードをバインドするだけで、対象となる買い物に対して自動的に暗号通貨やリワードドルで報酬を得ることができます。",
  "data/ph-top/2021/4/cuely.json": "あなたは、休憩を取らずに10時間以上働いていますか？それはあなただけではありません。Cuelyは、行動デザイン、ポジティブ心理学、ソーシャルサポートを用いて、休憩を楽しくすることで、健康を維持し、より幸せな気分になることができます。",
  "data/ph-top/2021/4/chrome-theme-studio.json": "今まで使っていたブラウザのテーマは退屈で、味気なく、ただ古いだけだと思っていませんでしたか？Google ChromeやMicrosoft Edgeの新しいカスタムテーマで、毎日のブラウジングに彩りを加えてみませんか？テーマのすべての機能をカスタマイズして制御することができます。あなただけのテーマを作ってみませんか？",
  "data/ph-top/2021/4/webping.json": "webping.cloudは、あなたとすべての一般的なクラウドデータセンターとの間のレイテンシーを見つける最も簡単な方法です。1つのページですべてを同時にチェックできます。",
  "data/ph-top/2021/4/breathly.json": "Breathlyは、自分の呼吸に集中するための100％無料のモバイルアプリです。呼吸法を選択して、ガイドされたエクササイズに集中するだけで、毎日のリラクゼーションや呼吸トレーニングに利用できます。Breathlyは無料で、トラッカーやアプリ内課金はありません。",
  "data/ph-top/2021/4/reeview-for-shopify-sellers.json": "売り手にとって YouTubeや新規顧客から本物の製品レビュービデオを探して収集するプロセスを自動化することで、サイト滞在時間の延長やコンバージョン率の向上につなげます。⠀ 買い物客のために。ソーシャルプルーフ（社会的証明）をすぐに見ることができ、より優れた製品プレゼンテーションを体験できます。",
  "data/ph-top/2021/4/datature.json": "Datatureは、独自のコンピュータビジョンモデルを構築する最速の方法です。データセットの管理、アノテーション、トレーニング、デプロイなど、すべてのチームや企業が初日から正しいパイプラインを利用できるようにします。",
  "data/ph-top/2021/4/supabase-ui.json": "Supabase UIは、ReactとTailwindCSSで構築されたUIコンポーネントのコレクションで、Supabaseが社内のアプリケーションを構築する際に使用されています。",
  "data/ph-top/2021/4/movie-of-the-night.json": "ストリーミングサービス、ジャンル、キーワード、俳優、発売年、年齢フィルター、上映時間など、お好みの条件を入力すると、「Movie of the Night」は、カタログを何時間も見なくても、すぐに見始められる最適な番組を瞬時に探し出します。",
  "data/ph-top/2021/4/t-minus.json": "T-Minusは、宇宙関連の情報、打ち上げ、イベント、ニュース、ロケット、機関などへのアクセスを可能にする、最も優れた機能を備えた宇宙打ち上げ追跡アプリです。SpaceX、Rocket Lab、ULAなど、お気に入りの宇宙機関をフォローしましょう。",
  "data/ph-top/2021/4/visible-hands-2.json": "Visible Handsは、ベンチャー企業を設立する際に、代表的な人材を支援するバーチャルファーストのフェローシッププログラムを開催しています。このプログラムでは、14週間にわたり、会社設立のためのサービスと最大20万ドルの投資を提供します。",
  "data/ph-top/2021/4/daku.json": "すべての製品を見て、その製品に惹かれ、気に入ったら製品ハントのページに移動して、その製品の詳細情報を見ることができます。Dakuでは、新しいアプリ、ゲーム、書籍、ポッドキャストを毎日発見することができます。",
  "data/ph-top/2021/4/remindee-2-0.json": "美しいポップアップでリードを獲得し、イベント開始時や登録終了時には自動でメールを送信して参加者を増やします。",
  "data/ph-top/2021/4/nativeway.json": "Nativewayの目的はただひとつ。それは、言語学習者が最初の学習日からスピーキングをすることを奨励することです。",
  "data/ph-top/2021/4/operator-a894d115-cca8-4bb9-801f-6e0c30be54db.json": "Operatorは、シンプルで直感的な方法でリダイレクトを作成し、維持することができる使いやすいツールです。ドメイン全体を転送したり、私たちの統合の一つを使用して、既存のウェブサイト/アプリケーションのためのリダイレクトを管理することができます。",
  "data/ph-top/2021/4/x100.json": "x100 - the app that counts. x100は、トレーニング中のレップ数を記録するのに役立ちます。もう頭の中でレップ数を数える必要はありません。私たちが代わりに数えます。ワークアウト用の音楽を聴いたり、ニュースを見たり、オーディオブックを聴いたりしながら、x100がカウントしてくれます。",
  "data/ph-top/2021/4/gapt-ai.json": "Gapt.aiは同様のGPT-3 APIを提供しており、性能も良く、完全にオープンソースのコードを使用しているので低コストです。",
  "data/ph-top/2021/4/insumo.json": "Insumoのメールは、あなたのパーソナライズされた生産性アシスタントであり、生産性の目標を達成するためのカレンダーやサクラの習慣を1つのシンプルなメールに表示します。",
  "data/ph-top/2021/4/tidio-3.json": "Tidioは、直感的でコーディング不要のチャットボットツールで、お客様がコントロールできる自動化によってライブチャットを改善します。",
  "data/ph-top/2021/4/liquity-protocol.json": "Liquityは、ETHを担保に無利息の流動性を提供する分散型の借り入れプロトコルです。ローンは米ドルペッグの安定コインであるLUSDで発行され、斬新な流動化メカニズムにより、最低担保比率を110%に抑える必要があります。",
  "data/ph-top/2021/4/missinglettr-3.json": "ワンクリックで何十もの投稿を作成したり、ニッチで最もホットなコンテンツをキュレーションしたり、ソーシャルアウトプット全体を数ヶ月前からスケジュールすることができるMissinglettr。",
  "data/ph-top/2021/4/mailivery.json": "Mailiveryは、あなたのセールスメールがより頻繁に見込み客の受信箱に届くようにします。AIが作成したメールを受信箱に送り、迷惑メールから取り出し、信頼できるメールとしてマークし、お客様に返信します。ローンチディール： https://mailivery.io/deals/product-hunt",
  "data/ph-top/2021/4/mock-api-generator-2.json": "サンプルデータセットの上に、読み取りと書き込みのエンドポイントを持つREST APIを30秒以内に生成します。何十種類ものデータタイプでデータセットをカスタマイズできます。テスト、BIデモデータ、プロトタイプなどのために作られています。",
  "data/ph-top/2021/4/making-twitter-friends.json": "この7日間のメール講座では、自分のポジショニングの発見から、自分の周りに人の輪を作ること、人間心理を利用した人間関係の構築などを学びます。1日1通のメールで、毎日、実例とアクションを紹介しています。",
  "data/ph-top/2021/4/ux-challenges.json": "UXについての本を読むのをやめて、実際に試してみましょう 🛠 実戦的なエクササイズで練習しましょう。🛠 重要なスキルとツールを身につけましょう。💼 ポートフォリオに相応しい成果物を持ち帰ることができます。👩🏻💻 初心者から上級者まで幅広くご利用いただけます。",
  "data/ph-top/2021/4/lottiefiles-mobile-app.json": "LottieFilesウェブサイト、After Effects、またはAdobe Animateプラグインから、モバイル用のLottieアニメーションをテストできます。アニメーションをLottie、GIF、またはMP4として、関係者に簡単に送信できます。いつでも、どこでも、外出先でも、何千ものLottieアニメーションにアクセスできます。その他にもたくさんあります",
  "data/ph-top/2021/4/blog-platform-by-labiblog.json": "魅力的なコンテンツを制作して、営業力のある見込み客を集める。ブログサイトビルダー 簡単セットアップ 独自ドメイン ユーザーフレンドリーで美しいデザイン コンテンツとブログ記事を最適化するSEOツール。コンテンツ・マーケティング・キャンペーンに最適なプラットフォームです。",
  "data/ph-top/2021/4/empathy-loss-companion-app.json": "Empathyアプリは、ご家族に力を与え、経済的、法的、感情的、物流的など、必要なすべての情報とサポートを得て、自分のペースで喪失の現実を乗り越えることを可能にします。",
  "data/ph-top/2021/4/nopass-me.json": "ユーザーのアイデンティティを確認するためには、面倒な繰り返しのコードを書く必要があり、壊滅的なセキュリティ侵害のリスクがあります😱。オープンソースのMFA検証ソリューションであるNoPass.meを使えば、ワンタイムパスワードを安全に送信・検証し、ユーザーが本人であることを確認することができます。",
  "data/ph-top/2021/4/lenzgig.json": "LenzGig（レンツジグ）は、AR（拡張現実）関連の仕事を扱うオンラインマーケットプレイスです。世界的なARクリエイターや開発者とクライアントを結びつけます。Facebook、Instagram、Snapchatで自分のARフィルターを発表したいですか？私たちはあなたをサポートします。LenzGigに投稿するだけで、あとは私たちにお任せください。",
  "data/ph-top/2021/4/luma-2.json": "ソーシャルメディア（およびPH）は、コンテンツを共有するには最適な場所ですが、新しい関係を育むのは難しいものです。Lumaは、イベント、ニュースレター、メンバーのプロフィールなどで、コミュニティの関係を深めるために作られました。",
  "data/ph-top/2021/4/kaboom-2.json": "Kaboomは、楽しいJavaScriptのゲームプログラミングライブラリ/環境です。 https://replit.com/kaboom https://kaboomjs.com/ https://github.com/replit/kaboom",
  "data/ph-top/2021/4/endtrial.json": "すべてのトライアルを自動的に記録するので、お客様の手間が省けます。期限が切れる前にトライアルをキャンセルするようにお知らせしますので、必要のないサブスクリプションにお金を払ってしまうこともありません。",
  "data/ph-top/2021/4/yesim.json": "YESIMは、世界で最も機能的なeSIMアプリケーションです。eSIM対応の端末とYESIMアプリがあれば、ローミング料金やSIMカードの変更なしに、世界126カ国以上でモバイルインターネットに接続することができます。",
  "data/ph-top/2021/4/airtable-commerce.json": "Airtable Commerceは、AirtableのデータベースをEコマースのプラットフォームにするスターターキットです。顧客管理、注文管理、商品管理などの機能に加え、すぐに購入リンクを貼ることができます。",
  "data/ph-top/2021/4/mail-studio.json": "Mail Studioは、どこでも見栄えのするレスポンシブなメールを作成するためのデスクトップアプリケーションです。ビジュアル編集とコード編集をエレガントに組み合わせており、デザイナーと開発者の両方に適しています。Windows、macOS、Linuxで動作します。",
  "data/ph-top/2021/4/resumemaker-online-2-0.json": "ResumeMaker.Onlineでは、モダンで効果的な履歴書をわずか数分で作成することができます。会員登録不要で、今すぐ始められます。",
  "data/ph-top/2021/4/iheart-adbuilder.json": "iHeart AdBuilderは、中小企業向けのセルフサービス型オーディオ広告ソリューションです。iHeart AdBuilderは、ラジオ向けの唯一のプログラマティック・ソリューションであるJelliを採用しており、iHeartMediaの子会社です。",
  "data/ph-top/2021/4/presentations-by-canva.json": "プレゼンテーションの作成プロセスを再構築します。美しいプレゼンテーションテンプレートからインスピレーションを得て、同僚と同じドキュメントでリアルタイムに共同作成し、どんな聴衆をも魅了する、真に魅力的なプレゼンテーションを作成できます。",
  "data/ph-top/2021/4/snippyly-2-0.json": "Snippylyは、プライバシーに配慮したスクリーンキャプチャ＆コラボレーションツールです。あなたの考えをリンクですぐに共有できます。チームやクライアントとの延々としたやりとりはもう必要ありません。サインアップは必要ありません。フルページのスクリーンショット、ライブラリ管理、高度な共有アクセスが可能になりました。",
  "data/ph-top/2021/4/angle-audio.json": "Angle Audioは、本格的なグループ会話ができるクロスプラットフォームの無料ソーシャルオーディオアプリです。既存のトピックに参加したり、自分でトピックを立ち上げたり、スクリーン共有、テキストチャット、ライブセレブレーションなどの機能を使って、他のユーザーとオーディオ会話でつながることができます。",
  "data/ph-top/2021/4/evaboot.json": "セールスナビゲーターの検索結果のうち、平均して31%があなたのフィルターにマッチしていません。あなたの検索結果をワンクリックでクリーンな見込み客リストに変えます。スプレッドシートの作成に時間を費やす必要はありません。",
  "data/ph-top/2021/4/seoforlunch.json": "もうGoogleのアップデートを見逃さない。この「#SEOForLunch」は、マーケターが利用できる最高のSEOアップデート、記事、ツールのすべてを含む無料の週刊ニュースレターです。",
  "data/ph-top/2021/4/manufactory-illustration-constructor.json": "イラストコンストラクタは、面白いキャラクターを使って、ドリームチームのユニークなストーリーを手に入れる最も簡単な方法です。FigmaとSketchに対応しています。PNGシーンは無料です。",
  "data/ph-top/2021/4/vossle-webar.json": "Vossleは、企業が1分以内にAR（拡張現実）を作成することができる、コード不要のWebAR開発SaaSプラットフォームです。ワールドターゲット、イメージターゲットベースのキャンペーン、ゲーム、顔検出ベースのトライオンを体験するには、アプリのダウンロードは必要ありません。",
  "data/ph-top/2021/4/backgroundcut.json": "BackgroundCutは、任意の画像の背景を削除または交換するための最速かつ最も簡単な方法です。人工知能を使って画像を分析し、ワンクリックで画像の背景を切り取ります。画像をアップロードするだけで、5秒以内に背景を取り除くことができます。",
  "data/ph-top/2021/4/setapp-stories.json": "世界中で起きているクールなテクノロジーの話題をダイジェストであなたの受信箱にお届けします。何が起きているのか、なぜそれが重要なのかを一目でわかるように楽しく説明しています。Setapp Storiesを開くだけで、次から次へと記事が出てくるインターネットの渦に巻き込まれることなく、要点だけを楽しむことができます。",
  "data/ph-top/2021/4/mintly.json": "Mintlyは、世界中のジュエリーコミュニティのための採用プラットフォームです。Mintlyは、ジュエリー業界のプロフェッショナルが迅速に仕事を見つけられるように、また、採用担当者がスキルの高いプロフェッショナルを可能な限り短時間で見つけて採用できるようにサポートします。",
  "data/ph-top/2021/4/upvote-bell-2-0.json": "Upvote Bellは、Product Huntでプロジェクトを立ち上げたMakersのためのプロジェクト管理プラットフォームです。プロジェクトの統計情報、リアルタイムの通知、タスクやメモのボード、ハンターのリーダーボードなど、完璧なローンチのためのすべての機能が1つの場所に集約されています。",
  "data/ph-top/2021/4/image-to-sketch.json": "ImagetoSketch（イメージスケッチ）。高度なAI技術を駆使して、画像をスケッチに変換。ワンクリックであなたの写真、絵、画像に鉛筆のスケッチ効果を追加するのは、これまでになく簡単です。1枚の画像をアップロードするだけで、10種類のスケッチ効果が得られます。",
  "data/ph-top/2021/4/company-accounts-by-userlist.json": "あなたのSaaS製品は、アカウントごとに複数のユーザーがいたり、ユーザーごとに複数のアカウントがあったりしませんか？他のメール自動化ツールとは異なり、Userlistは企業をサポートしており、スマートな方法でチームに参加してもらうことができます。",
  "data/ph-top/2021/4/dash-10.json": "Dashは、スポーツとテクノロジーへの情熱の集大成です。長い間、StravaのAPIを使って何かを作りたいと思っていたので、Dashは何年にもわたって様々な形をとってきました。最終的には、iOS 14がリリースされたときに、これはリリースするのに適した機会だと思いました。",
  "data/ph-top/2021/4/mobile-app-website-no-code-builder.json": "コード不要のウェブサイトジェネレーターを使って、モバイルアプリのウェブサイトを⏳60秒で作成! このテンプレートは、📝MITライセンスのオープンソースです。Google Play/App Storeのマーケティング資料をテンプレートに記入して使用することができます。",
  "data/ph-top/2021/4/you-belong-in-tech-v1.json": "ブートキャンプの卒業生、独学で学んだ技術者、ピアニスト、漫画家、そしてその中間の人たち。ソフトウェアエンジニアリング、デザイン、プロダクトマネジメントの分野で、どのようにして最初の役割を獲得したのか、勝利を祝い、苦悩を明かし、学びを共有します。",
  "data/ph-top/2021/4/selectorshub.json": "SelectorsHubは、XPathとcssSelectorsを生成、記述、検証するためのNext Gen XPathツールです。shadow dom、iframe、svg、動的要素、マルチセレクタの生成、エラー処理をサポートしています。すべてのブラウザで利用できる唯一のXPathツールです。",
  "data/ph-top/2021/4/visto-qualify.json": "カナダに移住したいですか？Visto Qualifyは、カナダの65以上の移民プログラムへの参加資格を数分でチェックする無料ツールです。カナダの移民弁護士によって開発されたこのツールは、あなたの移民の旅を始めるための最も迅速な方法です。",
  "data/ph-top/2021/4/tapereal.json": "TapeRealを使用すると、活気のある社会的なコミュニティとあなたの排他的なオーディオ/ビデオコンテンツを販売するためのホットな新しい市場を得る。早ければ今日中にお金を作り始めましょう。",
  "data/ph-top/2021/4/office-pass-by-robin.json": "Robinは、場所よりも人を優先する最初のワークプレイスプラットフォームです。今日、私たちはこのビジョンをさらに強化し、フレキシブルなワークプレイスとハイブリッドワークをRobinエクスペリエンスの重要な一部とするためのアップデートを行いました。",
  "data/ph-top/2021/4/brandmo.json": "Brandmoは、起業家やスタートアップ企業がプレミアムブランド名を見つけて獲得するためのドメイン名マーケットプレイスとブランド名発見プラットフォームです。",
  "data/ph-top/2021/4/copykatai.json": "CopykatAIは、人工知能を使って、より良いコピーライティングを実現するソフトウェアです。Google広告のヘッドライン、商品名、スローガン、ブログのアイデアなど、様々な用途にご利用いただけます。この文章はCopykatAIを使って作成しました）15カ国語以上に対応しています。",
  "data/ph-top/2021/4/forget-spam-comment.json": "スパムコメントを防ぐために、プラグインはデフォルトのアクションパス（wp-comments-post.php）をボット用にブロックし、訪問者がコメントを残すためにスクロールしたときに、ユニークなハッシュクエリストリングでアクセスできるようにします。こうすることで、ボットによる自動化されたスパムコメントを防ぐことができます。",
  "data/ph-top/2021/4/savetweetvid.json": "インストールして、緑色のダウンロードボタンをクリックすると、twitterから任意のGIFやビデオをダウンロードすることができます。- 無料でご利用いただけます - 制限や広告はありません",
  "data/ph-top/2021/4/visible-investor-database.json": "投資家データベースは、スタートアップ向け投資家コミュニケーションツール「Visible」のメーカーであるVisible.vcが提供する無料のコミュニティです。あなたのアイデアを売り込む投資家を探すのにお使いください。また、ステージ、地域、重点産業、チェックサイズ、リードインベスターなどでフィルタリングできます。",
  "data/ph-top/2021/4/welltory-3-0.json": "Welltoryは、あなたの指先にいるヘルスコーチのようなものです。毎日、あなたのデータを使用して、レポート、チャート、洞察を作成し、あなたの体がどのように機能しているか、どのようにして体調を良くするかを示しています。🔗 あなたのフィットネストラッカーとアプリを同期するだけ💥 あなたのデータの力を発揮させてください。",
  "data/ph-top/2021/4/hotline-3.json": "Facebookのクラブハウス・コンペティターは、クリエイターがオーディエンスに語りかけることができる。参加者はテキストや音声で質問することができます。",
  "data/ph-top/2021/4/routine-2.json": "Routine (YC W21) は、タスク、メモ、カレンダーをひとつにまとめた高速生産性アプリです。⚡️ タスクとメモを一箇所に集める ⏳ 最も重要なことに取り組むための時間を確保する 🔗 会議のメモなど、情報を時間にリンクさせる お試しください： http://routine.co",
  "data/ph-top/2021/4/vagon-2-0.json": "Vagonを使えば、どんなデバイスもパフォーマンスワークステーションに早変わり。クラウド上の自分のスーパーコンピュータを使って、あらゆるデバイスからあらゆるチャレンジングなソフトウェアを実行できます。Vagonであなたのクリエイティブなパフォーマンスを高めましょう。",
  "data/ph-top/2021/4/predis-ai.json": "Predis.aiは、Instagramのマーケターが半分の時間でより良い投稿をすることを支援するAI/ML製品です。Predis.aiは 1. エンゲージメント向上のための改善提案。2. 2. キュレーションされたハッシュタグとキャプションのアイデアにより、投稿にかかる時間を大幅に短縮します。",
  "data/ph-top/2021/4/sentien-audio.json": "Sentien Audioは、一日中装着していても耳を塞がないオーディオヘッドセットです。タップ、ジェスチャー、ボイスコントロールなど、すべてSentien Audio上でデバイスを操作できます。朝に装着して、そのまま忘れてしまうこともあります。腕時計のように。",
  "data/ph-top/2021/4/timecamp-2.json": "労働時間を記録して、ビジネスの成功に欠かせない時間をより多く確保しましょう。ユーザー数、プロジェクト数、タスク数は無制限で、永久に無料です。",
  "data/ph-top/2021/4/stage-f7224c3c-c81a-4cf0-ae75-05c7ad48000e.json": "Stageは、アプリのワイヤーフレームを作成するためのブラウザベースのエディタです。既製のブロックを使って、アイデアを数分で視覚化できます。モバイルパターンのライブラリを使用して、アイデア出しのプロセスを開始できます。プロジェクトを共有し、ワンクリックでデザインツールにエクスポートできます。",
  "data/ph-top/2021/4/have-i-been-zuckered.json": "Have I Been Zuckered: Facebookのデータ流出にあなたの電話番号が含まれているかどうかを確認します。",
  "data/ph-top/2021/4/flinkit-friends.json": "Flinkit Friends！」は、解読すべきコード、発見すべき手がかり、解決すべきパズルが詰まった新しい現実世界のアドベンチャーゲームです。街中でのバトルロワイヤル。速く、楽しく、簡単に始められます。",
  "data/ph-top/2021/4/balloon-7.json": "Balloonは、コラボレーションからグループ思考を排除し、声を増幅することで、グループからのアイデア、フィードバック、インサイトを記録的な速さで引き出します。Balloonは会議時間を70%短縮し、Balloonで共有されるアイデアやフィードバックの80%以上が真新しいものです。",
  "data/ph-top/2021/4/productshot.json": "製品のスクリーンショットは、必要な場所に焦点を合わせることで、より良いパフォーマンスを実現します。この無料ツールを使えば、製品のスクリーンショットを、焦点の合った機能プレビュー画像に素早く変換できます。このスクリーンショットは、パフォーマンスが向上することがわかりました。🚀",
  "data/ph-top/2021/4/buildbites.json": "BuildBitesは、あなたのサイドプロジェクト、エージェンシー、スタートアップを活性化するために、Webflow専任の開発者を月額料金で提供します。",
  "data/ph-top/2021/4/how-many-plants.json": "🌱 お気に入りの観葉植物を網羅的に紹介しています。🪴 植物のお手入れに関する疑問を深く掘り下げます。🏺 Cool Plant People & Places, Planter finds, and design tips, and more.",
  "data/ph-top/2021/4/baseql.json": "BaseQLは、GraphQLのパワーをAirtableにもたらします。シンプルかつパワフルなエクスプローラーを使って、レコードのクエリ、フィルタリング、ミューティングができます。ローコードやノーコードのアプリケーションと簡単に統合できます。Slackでご参加ください： https://shorturl.at/nHR07",
  "data/ph-top/2021/4/g-profiler-by-granulate.json": "G-Profilerは、オープンソースの継続的なプロダクション・コード・プロファイラで、パフォーマンスを低下させ、コストを増加させるパフォーマンスのボトルネックを特定するのに役立ちます。G-Profilerを使用することで、開発チームはパフォーマンスを最適化し、月末のクラウド利用料金を削減することができます。",
  "data/ph-top/2021/4/flowrite-2.json": "言葉をすぐに送れるEメールやメッセージなどに変換することで、日々のコミュニケーションを活性化します。フローライトは、あなたの仕事場で、あなたの日々のタスクと個人的なスタイルに適応します。最新のAIを搭載し、最も生産的な人のために設計されています。",
  "data/ph-top/2021/4/clever-ads-for-google-sheets.json": "マーケティングデータの詳細な情報を簡単に得ることができます。データソースを選択するだけで、すべてのデータをGoogleシートにまとめ、データのサマリーを作成します。",
  "data/ph-top/2021/4/tweepsbook.json": "TweepsBookは、Twitterのパワーユーザーのためのブックマークツールで、さまざまなタグを追加したり、好みに応じてツイートを整理したりすることで、散らかった情報を整理することができます。TweepsBookを使えば、時間を有効に使って学習することができます。",
  "data/ph-top/2021/4/doing-content-right.json": "Doing Content Right」は、オンラインでの出版について知っておくべきことを網羅した資料です。競争が激化する中で、成功するブログやニュースレターを作成、執筆、運営する方法を紹介しています。また、新たにポッドキャスティングに関する項目も追加されています。",
  "data/ph-top/2021/4/purifier.json": "AIアシスタントは、ほとんどのビデオ会議プログラムで、オンラインミーティングの背景を変更したり、余計なノイズを除去したりします。⠀ 見せたくない場所からオンライン会議を開催し、干渉するノイズを取り除くことができるようになります。",
  "data/ph-top/2021/4/getkeywords.json": "インターネットは常に変化していますが、なぜか私たちのSEOツールは2007年に生きていると感じています - 退屈な、複雑な＆時代遅れ。GetKeywordsは、意図にフォーカスしたキーワードリサーチを提供しています。",
  "data/ph-top/2021/4/half-lemons-2.json": "Half Lemonsは、あなたがレシピアプリに求めていたこと、つまり、家にある食材を使ったレシピのアイデアを提供してくれる、賢いiOSアプリです。材料の可能性を最大限に引き出して、あなたの料理をパワーアップさせましょう。",
  "data/ph-top/2021/4/disbug.json": "Disbugは、ボタンをクリックするだけで、音声ナレーション付きで画面を記録し、技術的なログとともにjiraに投稿できるクローム拡張機能です。QAから修正まで、バグ修正にかかる膨大な時間を短縮します。テスターはより簡単に、開発者はより効率的に。",
  "data/ph-top/2021/4/found-dev.json": "Found.devは、単なる求人情報サイトではありません。開発者とそれを求める企業のためのプラットフォームなのです。企業はfound.devのダッシュボードから求人情報を掲載し、応募を管理することができます。開発者は、数回のクリックで自分のプロフィールを作成し、検索し、求人に応募することができます。",
  "data/ph-top/2021/4/deprocrastination-2-0-2.json": "仕事をせずにサーフィンをする？ブラウザに気を取られていませんか？   この拡張機能を使えば、脇道にそれることなく、仕事を続けられるように設定することができます。   サイト制限、ファンゾーン（またはフォーカスゾーン）、バッチルールで健全な制限を設定して、より集中できるようにしましょう。",
  "data/ph-top/2021/4/domain-picks.json": "毎日、小売価格（プレミアムではない）で登録できる3つの素晴らしいドメインを手に入れましょう。簡単です。共有されるドメインはすべて、利用可能かどうかとその価格が吟味されています。つまり、公開された時点で、そのドメイン名は小売価格で利用可能です。",
  "data/ph-top/2021/4/automated-stand-ups-by-devfair.json": "devfairは、リモート開発チームの交流の場です。私たちは、スタンドアップ、プランニング、レビュー、レトロスペクティブなどのために、自動化された専用のミーティングモードを構築しています。",
  "data/ph-top/2021/4/cro-tools-for-ecommerce-by-taplytics.json": "A/Bテスト、アナリティクス、メッセージングツールなど、Eコマースのために作られた完全なスイートで、ROASの向上、チェックアウトコンバージョンの最適化、顧客LTVの向上を実現します。開発チームのためのハイパフォーマンスツール。開発チームのための高性能ツールと、それ以外の人のためのノーコードツール。",
  "data/ph-top/2021/4/ultimate-icon-pack.json": "このセットには、2つの異なるスタイルで250以上のアプリケーションをカバーする、icnsおよびjpg形式の交換用アイコンが含まれています。MacOS Big SurとiOS 14に最適化されています。",
  "data/ph-top/2021/4/citonhub.json": "Citonhubは、開発者がメンターとなり、コミュニティを成長させ、収入を得るためのオールインワンプラットフォームです。",
  "data/ph-top/2021/4/sawo-labs.json": "ユーザーがパスワードなし、ワンタイムパスワードなしでログインできる、迅速で安全な認証ソリューションです。SAWO APIは、あなたのウェブサイト/アプリケーションのバックエンドに入り、オンボーディングプロセスを迅速かつ安全にし、また、あなたの認証コストの75％を節約することができます。",
  "data/ph-top/2021/4/frontend-toolkit.json": "Frontend Toolkitは、フロントエンドに関連する反復的な作業のためのユーティリティのコレクションです。カスタマイズ可能で、ニーズに合わせてすべてを設定することができます。",
  "data/ph-top/2021/4/fire-hunt.json": "Fire Hunt ウェブ上のあらゆる場所から製品発表を見つけ出し、それを読みやすい形で提供しています。",
  "data/ph-top/2021/4/duuce-v2.json": "Duuceは、ニュースレターを売買するための専用マーケットプレイスです。Duuceでニュースレターを始めたり、売ったりしましょう - 100%無料です。",
  "data/ph-top/2021/4/path-3.json": "Pathはシンプルで無料のアプリで、あなたの決断を文脈に沿って整理し、より管理しやすくするのに役立ちます。このアプリを使って、それぞれの選択肢があなたの人生の最も重要な部分に与える影響を視覚化してください。",
  "data/ph-top/2021/4/vemari.json": "Vemariは、ブッククリエイターが持つブックノートの価値を引き出すお手伝いをします。Vemariでは、ブックノートを書き、そのブックノートをテーマごとに分類し、ブックサークルで購読または無料で共有することができます。",
  "data/ph-top/2021/4/aicam.json": "AiCamは、古い携帯電話を、あなたの家、あなたの愛する人、あなたのペットを守るための高度なツールに変えます。AiCamは、AIイベント検知に基づくスマートアラートを備えており、データのプライバシーを完全に確保するためにオフラインで動作します。このアプリは最近、Apple App Storeで公開されました。",
  "data/ph-top/2021/4/liso-1.json": "あなたの毎日のオーディオニュースダイジェスト🎧 Lisoは、A.I.を使ってインターネットを調査し、あなたが好きなトップトレンドのストーリーやトピックを見つけて、毎日のオーディオダイジェストとしてナレーションします。現在、iOSでベータ版がリリースされており、Androidは現在開発中です。",
  "data/ph-top/2021/4/epicurious-interactive-cocktail-cabinet.json": "次の一杯に使いたい材料を3つまでクリックして、新しいシグネチャーカクテルを見つけましょう。ジンのボトルとレモン？ウイスキーとスイートベルモット？そのほかにも、さまざまな組み合わせのカクテルレシピをご覧いただけます。",
  "data/ph-top/2021/4/xago.json": "XAgoは、最後に散髪したのはいつだったか、野菜を食べたのはいつだったか、家に電話したのはいつだったか、映画を見たのはいつだったか、Product Huntに投稿したのはいつだったか、などを思い出すのに役立つシンプルなiPhoneアプリケーションです。",
  "data/ph-top/2021/4/crab-fit.json": "Crab Fitでは、みんなのスケジュールに合わせてイベントを開催することができます。上でイベントを作成して、参加者全員にリンクを送るだけです。結果はライブで更新され、みんなが空いている時間帯をヒートマップで確認することができます。",
  "data/ph-top/2021/4/want-to-go-by-whstl.json": "こんにちは！👋🏼 この3年間、私は世界の30以上の都市で1160以上のベストスポットのリストを作成してきました。レストラン、バー、カフェ、その他のことをするためにフィルタリングしてください。🚀⚡Feel free to share with the world! ⚡🚀",
  "data/ph-top/2021/4/khuro.json": "すべてのコンテンツは、あなたのために友人たちが厳選したものです。お友達が選んだ投稿だけが表示されます。Khuroでは、以下のことができます。 - 自分の投稿を見る友達や友達グループを簡単に選ぶことができます。- 友達と写真を共有することができます。- 自分の都合や予定、考えを投稿することができます。",
  "data/ph-top/2021/4/bereev.json": "https://bereev.com/?utm_source=product_hunt&utm_medium=website&utm_campaign=general は、自分がいなくなったときに大切な人の指針となるプランを作成するための死の準備アプリです。明確な指示を残す 🗄 重要な書類をアップロードする 🗄 大切な人へのメッセージを残す 🗄 相棒を招待して計画を見てもらう",
  "data/ph-top/2021/4/omenu.json": "独自のクラウドプラットフォームにより、Eメニューの作成と管理、フィードバックの取得、そして売上の向上を実現します! レストランの売上が15％アップします。 訪問者が友人にあなたを推薦してくれます - それはWow effect! お客様からのフィードバックが得られます これ以上はありません",
  "data/ph-top/2021/4/remotecamp.json": "さまざまな分野で活躍する人々が、「自分をもっと知りたい」という思いで結ばれ、ワーク＆ライフバランスを実現しています。",
  "data/ph-top/2021/4/brig-note.json": "Brig Noteは、録音とタイピングを効果的に組み合わせた、あなただけのメモツールです。Brig Noteを使えば、講義中の自分の声を録音したり、スピーチやイベントを録音してメモを取ることができます。",
  "data/ph-top/2021/4/hashtag-nfts-by-proof-of-culture.json": "私たちは、世界初のハッシュタグNFTです。デザインされたアートを販売するのではなく、デザイナーに依頼して、すべてのハッシュタグが鋳造されたことを表すユニークなものを作ります。Proof of Cultureは、ブロックチェーン上でカスタマイズされたアートを大規模に実現する最初の主要なNFTプロジェクトです。",
  "data/ph-top/2021/4/wozi.json": "Woziは、今まで食べられなかった健康的な食品で、甘いものを満足させることができます。Woziは、酸っぱい食べ物を甘く感じさせ、苦味を減らし、風味を増幅させる天然のフレーバーエンハンサーです。たった30秒で健康的な習慣を始めましょう。",
  "data/ph-top/2021/4/emolog.json": "エモログの使い方は簡単! 一日を総括する絵文字を選んで、記録するだけの簡単なものです。日記の内容は、好きなだけ記入できます! 気が乗らないときは、タイトルを残せばOK。たった数秒で貴重な感情を記録することもできます!",
  "data/ph-top/2021/4/launchsong.json": "最高の音楽が公開される、実力主義の音楽プラットフォームです。あなたが楽曲をランク付けすることで、楽曲のEloレーティングに影響を与え、それが他のユーザーの閲覧数に影響を与えます。また、あなたの好みを学習して、カスタムプレイリストを作成します。",
  "data/ph-top/2021/4/watchpubs.json": "会社に持ち込んで、YouTubeでミームを見たり新しいことを学んだり、SoundCloudで音楽を聴いたり、お気に入りのビデオをどこからでも再生できます。内蔵のYouTube機能（検索、関連ビデオ、トレンド、ビデオ情報",
  "data/ph-top/2021/4/stacky.json": "マイクロサイトを無料で作成。瞬時にQRコードやリンクを取得して共有することができます。レストランのテーブルでお客様にQRコードを表示させたり、専門的な情報や製品カタログへのリンクを共有したり、QRコードを使ってウィンドウショッピングをしたり、思いつくままに行動してみましょう。",
  "data/ph-top/2021/4/motive-realscore.json": "私たちは、ブランドが重要な問題に与える実際の影響について、世界最大のデータサービスを構築しています。私たちは、良い企業の良い製品を簡単に見つけることができます。",
  "data/ph-top/2021/4/ui-hut.json": "Figma、Sketch、Adobe XD用の何千ものウェブテンプレート、モバイルアプリテンプレート、イラスト、SVGアイコン、グラフィックアセットをダウンロードできます。",
  "data/ph-top/2021/4/bazo.json": "ウェブサイトの訪問者がどの会社のどこから来たのかを知ることができれば、よりパーソナルでリアルな方法で訪問者を迎えることができます。これにより、競合他社に差をつけ、より多くの売上を達成し、オンライン・コマースに人間味を加えることができるのです。",
  "data/ph-top/2021/4/quolum-saas-card.json": "SaaSのスプロールは手に負えない。クオラムSaaSカードのご紹介です。SaaSの購入に特化した法人カードです。SaaSの消費を追跡し、更新を管理します。ベンダーをホワイトリストに登録し、積極的に解約することができます。SaaSの支払いと利用状況のモニタリングがセットになっています。",
  "data/ph-top/2021/4/soft-ui-dashboard.json": "⭐ https://www.creative-tim.com/product/soft-ui-dashboard?ref=producthunt は、Bootstrap 5 用の魅力的な管理用テンプレートです。数百種類のエレメント、デザインされたブロック、完全にコード化されたページで構成されており、魅力的なウェブサイトやウェブアプリの作成に役立つことでしょう。✅ 70のフロントエンドエレメント ✅ 7つのサンプルページ Get for free!",
  "data/ph-top/2021/4/fluent-1-0.json": "Fluentは、ウェブを閲覧しながらフランス語、スペイン語、イタリア語（近日公開）を学習することができます。techcrunchを読みながら、twitterで投稿しながら、メッセンジャーで友達とチャットしながら、新しい単語を学ぶことができます。Fluent を使えば、毎日の学習が楽しくなります。ChromeにFluentを無料で追加",
  "data/ph-top/2021/4/nocodez.json": "NoCodeZ AIがあなたのビジネスストーリーをアプリに変換します。あなたはビジネスストーリーを書きます。あなたは、アプリで何を見るか、アプリがどのように動作するべきかを詳しく説明できます。私たちのAIは、あなたのストーリーを完全なインフラを備えたWeb、IOS、Androidアプリに変換します。短時間で簡単にできます。",
  "data/ph-top/2021/4/wave-2-0.json": "Waveは、Laravelで構築された究極のSoftware as a Serviceスターターキットです。バージョン2が書き直され、オープンソース化されました。このプロジェクトでは、記録的な速さで独自のSoftware as a Serviceを作成することができます🚀。",
  "data/ph-top/2021/4/lastbit-lite.json": "Lastbit Liteは、ヨーロッパの人々がビットコインやユーロで支払いをしたり、受け取ったりするための最速の方法です。ライトニングネットワークを介してビットコインの支払いを即座に送受信し、ドルコスト平均法でビットコインを管理します。",
  "data/ph-top/2021/4/rich-like-bill.json": "ビル・ゲイツのようなお金持ちになる💸 これは1％のチャンスを保証するための試行錯誤の方法です 膨大な努力と献身を必要としますが、忠実に実行すれば0〜133億ドルを稼ぐことができます💰 🤑",
  "data/ph-top/2021/4/startup-name.json": "あなたのプロジェクトのためのドメインを探す 既存のツールの推奨はいつも私には悪いと感じていたので、検索を容易にするためのツールです。SAASの名前に使われる100以上のトレンドの名前の修飾語を手動でキュレーションし、TLDを分類しましたが、それだけでAIもデタラメもありません。",
  "data/ph-top/2021/4/daily-prompt-writing-app.json": "https://dailyprompt.co.uk/ は、ライターズ・ブロックを打ち破り、毎日の執筆習慣を始めるのに役立つ、クリエイティブなライティング・プロンプトを提供しています。",
  "data/ph-top/2021/4/readme-so.json": "もうReadmeのセクションを忘れることはありません。READMEに追加するセクションを選択し、内容を編集し、ドラッグして再配置します。マークダウンのライブ更新レンダリングプレビューを見てから、README.mdファイルをダウンロードできます。",
  "data/ph-top/2021/4/uniclix-social-media-scheduler.json": "Uniclixは、数クリックでソーシャルメディアの投稿を一元管理し、スケジュールを立てることができます。Uniclixは、Instagramのビジネスアカウント、Facebookのページとグループ、Twitter、LinkedInのプロファイルとページに対応しています。",
  "data/ph-top/2021/4/acho-2-0-1.json": "Achoは、フラットファイル、アプリケーション、データベースから、ポイント＆クリックのGUIで、リアルタイムのデータテーブルや、ビジュアルなダッシュボードを作成することができます。",
  "data/ph-top/2021/4/cloudprint.json": "自宅にプリンターを置くのは過去の話。不恰好で高価なものですからね。⠀ CloudPrintを使えば、数回クリックするだけで、書類が玄関先に届きます。⠀ 親に印刷を頼むのはやめましょう。CloudPrintを使い始めましょう。",
  "data/ph-top/2021/4/social-studio.json": "人工知能が、あなたのわずかな言葉を何百もの高パフォーマンスのInstagram投稿に変えてくれます あなたのInstagramの旅をすべて自動化します。コンテンツやデザインから画像やキャプションまで、すべてを数分で自動化します。",
  "data/ph-top/2021/4/chess-opener.json": "オープニングのデータベースをLichess APIに接続し、統計やトップゲームなどの有益なオープニング情報を取得するために使用することで、ユーザーが簡単にチェスのオープニングを探索、分析、練習できるウェブアプリケーションを作成することができました。",
  "data/ph-top/2021/4/save-the-secret.json": "このツールは、パリ協定に基づく地球温暖化を遅らせ、2030年までに地球の気温上昇を1.5℃に抑えるために、あなたの国に何本の木を植えればよいかを試算します。2030年までにCO2排出による死亡者数を70万人削減",
  "data/ph-top/2021/4/headers-me-2.json": "https://headers.me では、複雑なデザインツールやテンプレートを使わずに、好きなソーシャルメディアのプラットフォームに合わせたカバー画像を作成することができます。無料のデモをお試しいただくか、プロプランにアップグレードしてご利用ください。",
  "data/ph-top/2021/4/sourcery-4.json": "SourceryはあなたのPythonコードを瞬時にレビューし、リファクタリングを行い、よりクリーンで読みやすいコードにします。まるでペアのプログラマーが常に隣で作業しているようなものです。PyCharm, VS Code, GitHub reposに1分でインストールできます。無料でご利用いただけます。",
  "data/ph-top/2021/4/whatis-2.json": "Whatisは、チーム内の用語、専門用語、プロジェクト名、頭字語を最も簡単に管理できる方法です。Slackから離れることなく、チームの効率を高め、ナレッジマネジメントを分散させ、新入社員のオンボーディングを容易にすることができます。",
  "data/ph-top/2021/4/journeys-by-indicative.json": "Indicativeの最新機能であるカスタマージャーニーは、顧客が製品を介してコンバージョンに至るまでの最も一般的な経路を発見するのに役立ちます。顧客が製品をどのように通過するかに基づいて、マルチパス・ファンネルやコホートを構築し、さらなる分析を行うことができます。",
  "data/ph-top/2021/4/rattle.json": "Rattleは、Salesforceの管理、案件のコラボレーション、実用的なインサイトの取得など、すべてをSlack上で行うことができるセールスコラボレーションプラットフォームです。B2Bの営業チームやカスタマーサクセスチームに最適です。",
  "data/ph-top/2021/4/the-2021-conversion-benchmark-report.json": "16の業界における良好なコンバージョン率を把握し、わかりやすい推奨事項を得ることで、これまでで最も高いコンバージョン率のキャンペーンを構築することができます。44,000以上のランディングページと33,000以上のコンバージョンから得られた知見をもとに、コンバージョンインテリジェンスの活用を始めましょう。",
  "data/ph-top/2021/4/nucleus-ui.json": "Nucleusは、次のモバイルアプリをデザインするために必要なビルディングブロックを提供する、無料のUIコンポーネントライブラリです。300以上のコンポーネントと30以上のスクリーンで、プロトタイプの作成やFigmaでのモックアップの作成をスピーディーに行うことができます。",
  "data/ph-top/2021/4/zujonow-live-sdk.json": "ZujoNow Live SDKは、WebRTC、RTSP、RTMPをサポートし、OBS Studio、StreamYard OBS Studioなどと互換性のある、ウェブ、アンドロイド、iOS向けのスケーラブルなライブストリーミングAPIです。ZujoNow Liveは、あなたのアプリをより魅力的にし、生活をより簡単にするのに役立ちます。",
  "data/ph-top/2021/4/visme-for-desktop.json": "Vismeは、世界中の個人やチームにビジュアルコンテンツを提供するクリエイティブエンジンです。デザインのバックグラウンドを問わず、誰でもプレゼンテーション、インフォグラフィック、ソーシャルポスト、さらにはビデオを含むインタラクティブなブランドコンテンツを作成することができます。",
  "data/ph-top/2021/4/paywall-screens.json": "iOSのペイウォール画面を完璧にデザインするために必要なものがすべて揃っています。他のアプリケーションで使用されている最高のペイウォールスクリーンをカテゴリー別に集めたコレクションを見て、インスピレーションを得ましょう。数多くのサンプルとコンポーネントを含むFigmaテンプレートを使って、自分のスクリーンをデザインできます。",
  "data/ph-top/2021/4/sourcery-pro.json": "Xcodeを拡張し、コード構造を理解した独自のライブテンプレートを作成する機能を備えたMac用アプリケーションです。好きなテンプレートを作成することができますが、このアプリには多くの人気テンプレートがバンドルされているので、すぐに使い始めることができます。",
  "data/ph-top/2021/4/state-of-saas-onboarding-2021.json": "インスピレーションを得て、ユーザー・オンボーディングのベストプラクティスや最新のトレンドについて学ぶことができます。データを利用して、成功しているSaaS企業の大半がすでに行っていることを上司に示すことで、最適化の取り組みに対する社内管理職の賛同を得ることができます。",
  "data/ph-top/2021/4/cloudflare-pages.json": "Cloudflare Pagesは、フロントエンド開発者がコラボレーションしてウェブサイトを展開するためのJAMstackプラットフォームです。",
  "data/ph-top/2021/4/willo-3.json": "オーラルケアの未来がここにある。初の子供用歯磨きロボット、Willoが登場しました。私たちの自動ブラッシングシステムは、子供たちが歯を磨く方法を刷新し、健康的な未来のために健康的な習慣を作ります🌟。",
  "data/ph-top/2021/4/11-fs-pulse.json": "11:FS Pulseには、世界中の主要な金融ブランドの何千ものユーザー・ジャーニーが掲載されています。自分の立ち位置を確認し、最高のものから学ぶことができます。⭐️ 4000以上のフィンテック・ジャーニー ⭐️ 500以上のブランド ⭐️ 50以上の国をカバーしています。",
  "data/ph-top/2021/4/vspace-2-0.json": "VSpaceを使えば、デスクトップのように便利なリンクを集めたスペースを作ることができ、自分やチームメイト、コミュニティが検索や共有に時間を費やすことがなくなります。簡単で、どんなワークフローにも対応できるのがいいですね。",
  "data/ph-top/2021/4/documint-for-stacker.json": "Documint integration for Stackerを使用すると、Stackerアプリケーションに強力なドキュメント生成機能を追加することができます。",
  "data/ph-top/2021/4/clever-ads-for-google-chat.json": "- Googleチャットボットに指標やグラフを聞いて、PPCキャンペーンの進捗状況を評価 - Facebook広告、Google広告、Microsoft広告を興味に応じてフィルタリングし、そのパフォーマンスを把握 - 近日公開予定 アラート、スケジュールレポート、ヒント",
  "data/ph-top/2021/4/hireterra.json": "Hireterraは、アメリカで転職を考えているITプロフェッショナルのための、慎重かつ非公開の多様な転職プラットフォームです。",
  "data/ph-top/2021/4/1password-secrets-automation.json": "1Passwordの信頼できるセキュリティアーキテクチャをベースに構築されたSecrets Automationは、SSHキー、APIトークン、その他のインフラの秘密を保護し、必要なときに必要な場所に供給します。",
  "data/ph-top/2021/4/vitaely-me.json": "Vitaely.meでは、LinkedInアカウントのデータを同期することで、わずか2分で自分だけのランディングページを作成することができます。",
  "data/ph-top/2021/4/supreme-2-0.json": "アジェンダをスクロールするだけで、過去に行った素晴らしいことや将来の計画を確認することができます。また、今日チェックしなかったことがあれば、Supremeが自動的に前倒しでチェックしてくれます。とても簡単です。",
  "data/ph-top/2021/4/car-thing.json": "音楽、ニュース、エンターテインメント、トークなどを車内に満たしてくれるSpotifyのスマートプレーヤーです。",
  "data/ph-top/2021/4/napkin-beta.json": "Napkinは、ブラウザで使える次世代のプロダクションレディのバックエンド開発ツールです。高速でパワフルなコードエディタ、ゼロコンフィグレーションによる即時デプロイメント、即時APIエンドポイント、無制限のλ関数。インフラなし。ボイラープレートもありません。ただのコードです。",
  "data/ph-top/2021/4/lofi-cafe.json": "集中したいとき、仕事をしたいとき、勉強をしたいとき、リラックスしたいときには、lofi.cafeにチューンインしましょう✨ YouTubeから厳選されたlofiのライブステーションが、美しいオンラインプレーヤーで見られます。",
  "data/ph-top/2021/4/thundra-sidekick.json": "あなたのコードを探ることは、日に日に難しくなっています。Thundra Sidekickは、アプリケーションデバッグのためのプロツールセットを提供します。Sidekick は、クラウドやオンプレミスにホストされた分散アーキテクチャのマイクロサービスなど、あらゆるアプリケーションのデバッグを支援します。",
  "data/ph-top/2021/4/meeting-calculator-2.json": "Googleカレンダーを接続して、過去1年間に会議に費やした時間を確認することができます。+カレンダーから11のリアルタイム統計を確認することができます。",
  "data/ph-top/2021/4/landing-page-checklist.json": "私の最初の製品であるLanding Page ChecklistのYucelです。Landing Page Checklistは、最高のランディングページを構築するための16のカテゴリーに分かれた100以上のツールを提供するキュレーションサイトです。何か質問があれば、ぜひ教えてください。)",
  "data/ph-top/2021/4/propoze.json": "提案書を作成するための新しい、改良された方法です。クリエイターと技術者のために設計・構築されました。洗練された高速なインターフェースにより、新しい提案をするのが楽しくなります。",
  "data/ph-top/2021/4/backlink-checker.json": "Free Backlink Checkerは、日々何十億ものページをクロールしている独自のバックリンクインデックスを搭載しています。このツールでは、あらゆるサイトのバックリンクを追跡・分析し、過去の統計情報を見たり、nofollow/dofollowでフィルタリングしたり、アンカーテキストデータを表示したりすることができます。",
  "data/ph-top/2021/4/leet-resumes.json": "レジュメは無料で作成できます。ベータ版のリリース以来、数千社のエンジニアのレジュメを作成してきました。ユーザーからは好評で、平均40ドルのチップをいただいています。今、私たちはすべてのプロフェッショナルに拡大しています。今すぐ無料のレジュメを手に入れよう。",
  "data/ph-top/2021/4/nocode-job-board.json": "優秀なNoCoderを採用して、NoCodeで夢の仕事を見つけよう。無料",
  "data/ph-top/2021/4/albacross-free.json": "B2Bのスタートアップ企業（あなたのことです）に、どの企業があなたのウェブサイトを訪れているか、何に興味を持っているか、そしていつ購入の準備をしているかを伝えます。月間500社の訪問者。SlackやPipedriveとのネイティブ統合。さらに、いつでも無料で、GDPRにも対応しています。",
  "data/ph-top/2021/4/pico-2-0.json": "Picoは、クリエイターがお金を稼ぐための必須ツールを提供しています。⠀ 独自のドメインで、メールの収集、定期購読の販売、顧客関係の管理を大規模に行うことができます。オーディエンスを理解し、収益の拡大を実現します。",
  "data/ph-top/2021/4/plasmic.json": "コードベースとシームレスに連動する、ビジュアルフロントエンドビルダーとウェブデザインツールです。チームに障害を与えず、誰でも出荷できるようになります。",
  "data/ph-top/2021/4/squido.json": "squidoは、静的なWebサイトを構築してデプロイするために必要なものをすべて含むことを目指しています。フレームワークを学んだり、コードを書いたり、デプロイメントで遊んだりする時間を無駄にすることはありません。コンテンツを書き、スタイルやレイアウトをカスタマイズし、ビルドしてデプロイするだけです。",
  "data/ph-top/2021/4/inprivy.json": "同僚や顧客など、誰とでも簡単に機密情報を共有できます。",
  "data/ph-top/2021/4/smart-invoice.json": "Smart Invoiceは、請求書発行の常識を覆します。 - プロジェクトの終わりではなく、始まりに送られる - クライアントが前払いする - 資金はエスクローに保管され、作業が完了するまで解放されない - Ethereumで構築されているため、支払いは迅速、安全、安価です。",
  "data/ph-top/2021/4/search-bar-shortcuts.json": "ブックマークを開くよりも、URLを入力した方が早い場合があります。⚡️Search Bar Shortcuts (Omnibox shortcuts)は、よくこの方法でいくつかのウェブサイトにアクセスする人のために作られています。この拡張機能は、それをさらに素早く、より確実に、そして予測可能なものにします。",
  "data/ph-top/2021/4/all-in-one-freelancer-crm.json": "フリーランスとしてのビジネスを管理するために必要なすべてが揃っています この素晴らしいNotionテンプレートを使えば、構造化されたプロスペクションプロセス、クライアントとのプロジェクト管理、パーソナライズされた販売提案の送信などが可能になります！ https://www.notion.so/All-in-One-Freelancer-CRM-f917232f62444398b2c4d0b5d24b92f5!",
  "data/ph-top/2021/4/jxl-for-jira.json": "JXLは、Jiraのパワーとスプレッドシートの親しみやすさを組み合わせたもので、ユーザーはすべての作業を1つの場所で楽に管理することができます。使いやすさ、スピード、そしてセキュリティが中心になっています。元に戻りたくなくなるでしょう。https://tcrn.ch/2RzhkjV",
  "data/ph-top/2021/4/muse-b0d3445e-a0b9-466f-a8ac-0cfeedd9fcaf.json": "Museは、あなたのニッチなニューストピックをすべて一箇所に集めるより良い方法です。あなたのトピックに最適な記事を詰め込んだニュースレターを毎週お届けします。アルゴリズムやニュースプラットフォームからではなく、あなたが気になるニュースを受信箱に届けます。",
  "data/ph-top/2021/4/new-telegram-web.json": "Telegram messengerは、アプリケーションの新しいウェブバージョンを2つリリースしました。これらは基本的な機能をすべて備えており、モバイルおよびデスクトップ端末でご利用いただけます。",
  "data/ph-top/2021/4/calendso.json": "Calendsoは、オープンソースのCalendlyに代わるサービスです。自分でホストすることも、私たちがホストすることもできます。高度なカスタマイズとオープンなAPIにより、あなたのビジネスにシームレスに統合します。デフォルトではホワイトレーベルで、あなたとあなたの訪問者にとって使いやすいようにデザインされています。",
  "data/ph-top/2021/4/trove-40cf084a-d26a-4849-916b-1195e3145925.json": "Troveは、インターネット上でハイライトやコメントを作成し、それをNotionに送信することができるクローム拡張機能です。今すぐ無料でTroveをお試しください。",
  "data/ph-top/2021/4/piktostory.json": "動画のエンゲージメントを高めたい？Piktostoryで、ドキュメントのような動画編集を体験してみませんか。ウェビナー、Zoomの録画、バーチャルイベントなどをカスタマイズした一口サイズのクリップにして、ソーシャルメディアでの効果を高めることができます。",
  "data/ph-top/2021/4/3d-business-characters-by-icons8.json": "楽しくて表情豊かな3Dイラストを、あなたのサイトにも。ビジネスシーンで活躍する人物を集めた検索可能なライブラリで、あなたのブランドにぴったりのマスコットを簡単に見つけることができます。- 細部までこだわったデザイン - 様々なジェスチャーやポーズが可能",
  "data/ph-top/2021/4/privacy-policy-template-by-juro.json": "JuroとStefania Passeraによるこれらのデザインパターンを使えば、退屈な法律文書を、人々が実際に読むことができる、透明で魅力的な文書に変えることができます。",
  "data/ph-top/2021/4/i-love-adaptive.json": "デバイスがなくても、サイトのレイアウトの表示を複数の画面で同時に確認したり、デザインレイアウトとの比較が可能です。このサービスの機能については、コメントで詳しくお伝えします。",
  "data/ph-top/2021/4/approveit-2-0.json": "見積書、アクセスリクエスト、ドキュメント、タイムオフなどの承認をスピードアップします。Slack内で承認リクエストを開始して応答し、チームの承認履歴を表示し、承認ワークフローをカスタマイズし、お気に入りのツールを統合することができます。",
  "data/ph-top/2021/4/bugout.json": "バグアウトは、API、ライブラリ、CLIの制作者が、⠀ - ユーザーが誰であるか - ソフトウェアをどのように使用しているか - どのような問題に直面しているか ⠀ ユーザーのプライバシーを尊重しながら、理解することができます。⠀ ユーザーが問題を抱えている場合、Bugoutはリアルタイムで修正を指示します。",
  "data/ph-top/2021/4/afterglow.json": "毎日15分、幸せ、暖かさ、やる気、好奇心、楽しさ、インスピレーションを、同じような考えを持つ人たちの2分間のポッドキャストで提供し、そして、他の人のために15分をより良くする手助けをすることができるでしょう。",
  "data/ph-top/2021/4/bridgezero.json": "BridgeZeroでは、活用できる100以上の長期ビザやレジデンスプログラムについて知ることができます。次はどこでリモートワークしますか？",
  "data/ph-top/2021/4/powertrade.json": "PowerTradeでは、携帯電話で簡単に暗号オプションを取引することができるので、24時間365日外出先でコールやプットを購入することができます。米国では利用できません。",
  "data/ph-top/2021/4/beta-console.json": "Beta Consoleは、すべての開発者ツールとベータ版の早期アクセスリリースのライブリストです。週刊開発者ツールニュースレターでは、最も興味深い2～3のプログラムを紹介していますが、常に100以上のアクティブなプログラムがあるため、このリストは毎日更新されるすべてのプログラムのリストです。",
  "data/ph-top/2021/4/bshare.json": "BShareはスタンドアローンのデジタル名刺共有アプリケーションで、デジタル名刺に切り替えたい経営者、請負業者、フリーランサー、その他のプロフェッショナルに最適です。",
  "data/ph-top/2021/4/betterwriter.json": "Chrome拡張機能をインストールするだけで、GPT-3を使ってより良い、より速い文章を書くことができます。任意のテキストを選択して、より良いコンテンツのアイデアを生み出すことができます。",
  "data/ph-top/2021/4/super-simple-stories.json": "SetappのSuper Simple Stories（SSS）は、最新の技術ニュースを楽しくナレーションで紹介するショートビデオシリーズです。あなたが楽しみながら魅力的な人間になれるように、あなたが持っていなかったすべての疑問に対する答えをお届けします。",
  "data/ph-top/2021/4/vidbix.json": "Vidbixは、お客様側に何かをインストールすることなく、お客様の画面と声を録音して問題を説明することができます。お客様にとってはより迅速な説明が可能となり、エージェントにとってはすべての状況を把握することができ、問題をより迅速かつ個人的に解決することができます。",
  "data/ph-top/2021/4/dji-air-2s.json": "DJI Air 2Sは、1インチのCMOSセンサー、強力な自律機能、600g以下のコンパクトなボディを特徴とする、移動するクリエイターのための究極のドローンです。",
  "data/ph-top/2021/4/upnote-for-android.json": "UpNoteは、Android、Mac、Windows、iOSで動作する、エレガントでパワフルなノートアプリです。メモを取りやすく、集中力を維持できるように設計されたUpNoteは、美しいインターフェイスと流動的なワークフローを組み合わせ、洗練されたメモを取ることができます。",
  "data/ph-top/2021/4/input-kit-from-framer.json": "本物のインタラクティブな入力を、あなたのキャンバスの上で「はい」と言ってみませんか？本物以上にリアルなInput Kitをご紹介します。32種類のカスタマイズ可能なテキストや数字の入力、トリガーなどが用意されています。Framerで無料で公開されているプレイグラウンドをチェックして、すべてのプロトタイプにネイティブな忠実さをもたらしましょう。",
  "data/ph-top/2021/4/reddit-bests.json": "Redditは、インターネット上で本物の製品レビューを見つけることができる最後の場所のひとつです。私はこれらのレビューを一つの場所に集約するためにReddit Bestsを作りました。",
  "data/ph-top/2021/4/ji-hn.json": "Ji.hnでは、視聴者の位置情報やプラットフォームデータに基づいて、簡単にリンクを短縮し、分析結果を提供することができます。",
  "data/ph-top/2021/4/beat-lock.json": "ビートを盗まれた？Beat Lockは、ビートメーカーやプロデューサーのための無料ツールで、音楽ストリーミングサービスで自分のビートを使用している人を発見することができます。デスクトップからファイルをアップロードしたり、BeatStarsのURLからファイルをインポートすることもできます。",
  "data/ph-top/2021/4/the-freelance-rate-calculator.json": "Freelance Rate Calculatorは、あなたの財務状況を包括的に把握し、将来に向けて現実的な目標を立てることができます。⠀ これは、最も重要な質問に答えてくれるものです。\"あなたのライフスタイルを維持するためには、どれくらいの料金が必要ですか？",
  "data/ph-top/2021/4/vacation-by-poolside-fm-2.json": "この度、私たちにとって最大の事業である日焼け止めの会社を立ち上げました。プールサイドFMの香りを知りたいですか？86年の夏が21年の夏になったような匂いを嗅ぎたい？私たちはあなたを持っています！皆様からの早期のご支援をお待ちしております。",
  "data/ph-top/2021/4/timelapse-in-google-earth.json": "2017年以来最大のGoogle Earthのアップデートで、私たちの地球を全く新しい次元である「時間」で見ることができるようになりました。Google EarthのTimelapseでは、過去37年間に撮影された2,400万枚の衛星写真が、インタラクティブな4D体験にまとめられています。",
  "data/ph-top/2021/4/spott-3.json": "スポットでは、画像や動画、PDFにインタラクティブなタグを追加して、訪問者が簡単にアクションを起こせるようにすることができます。スポットのショッパブルコンテンツは、何千ものEコマース、ブランド、代理店、不動産会社がオンラインコンテンツをより効果的に活用できるようサポートしています。",
  "data/ph-top/2021/4/vaxyes.json": "おめでとう、コヴィド-19のワクチンを接種したね。3つの簡単なステップで、旅行、ライブ、雇用主に使用できる安全なデジタルワクチン記録を取得することができます。無料で安全な認証済みのデジタル・ワクチン・カードを手に入れましょう。",
  "data/ph-top/2021/4/cast-pranker.json": "このアプリを使って、クロームキャストを使っているお宅にいたずらしましょう 基本的なページにテキストを追加したり、画像を貼り付けたりして、家族が見ているテレビにキャストすることができます。",
  "data/ph-top/2021/4/keypup-2-0.json": "いつも使っているツールで、開発の流れを一元的に把握することができます。整理され、優先順位付けされたクリーンなデータは、実用的な自動ボードに集約されます。チーム内の課題、PR、必要なアクションを簡単に追跡し、ホットな開発タスクを効率的にコラボレーションできます。",
  "data/ph-top/2021/4/travi.json": "Traviであなたの旅をシンプルに。旅行先を探索して、アクティビティから食事のオプションまで、お気に入りのことをブックマークしておきましょう。あなたの旅の好みを教えていただければ、一日一日をフォローするパーソナライズされた旅程を作成いたします。",
  "data/ph-top/2021/4/replit-ventures.json": "Replit Venturesは、4つのスタートアップと1つの非営利団体に、それぞれ2000ドルの助成金を提供します（ビットコインで）。さらに、ツール、メンターシップ、ネットワーキング、さらなる資金調達などの支援を受けることができます。",
  "data/ph-top/2021/4/json-manipulator.json": "Discoverable Jsonは、JSONデータ（ネストされていても）を有効なjavascriptの表現にフラット化します。絶対的なjavascriptのパスを使用することで、必要なデータの断片を簡単に検索することができます。また、自分に関係のないデータを削除することもできます。",
  "data/ph-top/2021/4/needle-x3.json": "特定のサイトに追加または削除されたキーフレーズを監視する： - 政府系サイトでの規制に関する言及を探す。- 競合他社における貴社ブランド、職種、特定の技術用語の言及を検出する。サイト全体をスキャンし、シンプルな変更レポートを毎日お送りします。",
  "data/ph-top/2021/4/growmeorganic-2.json": "GrowMeOrganic Instagram Scraperで、Instagramからハッシュタグ、フォロワー、フォロー、メディアのライカー、コメンターなどから、メール、電話番号、住所、ウェブサイトなどを抽出しましょう。無制限の無料トライアルで、ダウンロードしてすぐに使い始めることができます。",
  "data/ph-top/2021/4/audiotorium.json": "Audiotoriumは、位置情報を利用したパフォーマンスのための無料のライブオーディオアプリです。この位置情報アプリでご近所を再発見し、ブロックパーティーを盛り上げましょう。ステージパフォーマンスを新しい方法で録音し、ライブとして再生することで、新たなオーディエンスとの出会いが生まれます。",
  "data/ph-top/2021/4/cutout-pro-1.json": "Cutout.Proが提供するAIレタッチツールを使えば、人物、物体、動物、傷、欠陥、肌のシミ、ソバカス、シワ、ニキビなどの不要なものを写真から瞬時に取り除くことができます。Photoshopのクロンスタンプツールとはおさらばです。",
  "data/ph-top/2021/4/slash-e369429c-204b-4b1a-85d2-b88eec93c6f2.json": "Slashでは、あなたとあなたの友人が \"共同所有 \"する共同カードを発行します。友達とシームレスに費用を分担することで、通常の定期購入の数分の一の費用で済むようになります。",
  "data/ph-top/2021/4/nama-chat.json": "NAMAは、日常のテキストを言語練習ツールに変えるメッセージングアプリです。友達を招待して、100種類の言語でチャットを始めたり、練習モードに入って、会話の中の単語やフレーズを勉強したりすることができます。",
  "data/ph-top/2021/4/ovice-tour.json": "oViceは、遠隔地のチーム、イベント主催者、学術機関、コミュニティ管理者に2Dバーチャルスペースを提供します。ソーシャルとビジネスの両方のコミュニケーションを促進するoViceは、本物の会話を生み出し、バーチャル・コミュニケーション体験をカスタマイズするのに役立ちます。",
  "data/ph-top/2021/4/notion-meeting-notes.json": "会議でのタスク、アイデア、情報、イベントなどを記録するためのNotionシステム。",
  "data/ph-top/2021/4/thinking-like-a-cto.json": "本の中で取り上げられているトピック - CTOの役割 - 勇気の7つの現象 - 測定できなければ管理もできない - 独学のソフトウェア開発者と学者 - CTOはコードを書くべきか？- 全員を平等に扱う - 最高の人材を惹きつける...",
  "data/ph-top/2021/4/liprospect.json": "LiProspectは、クラウドベースのLinkedinプロスペクティング＆ヒューマナイズドオートメーションツールで、あなたのネットワークを拡大し、スマートなメッセージフローを構築し、Linkedinからより多くのリードを完全に自動生成することができます。",
  "data/ph-top/2021/4/which-frame.json": "🧠 OpenAIのCLIPニューラルネットワークで、動画を *semantically* 検索します。❓例です。サングラスとイヤホンをした人が映っているフレームは？🔍 テキスト、画像、テキスト＋画像で検索してみてください。👇 Thread https://twitter.com/chuanenlin/status/1244260281632481280 https://twitter.com/chuanenlin/status/1383411082853683208",
  "data/ph-top/2021/4/js-image-carver.json": "Seam Carvingアルゴリズムに基づくコンテンツ認識型の画像リサイザ",
  "data/ph-top/2021/4/amalytics.json": "起業家がAmazonでお金を稼ぐ機会は、販売者、アフィリエイト、生産者として何千もあります。amalyticsは、使いやすい検索エンジン形式でデータを提供しているので、数分で見つけることができます。",
  "data/ph-top/2021/4/cryptorchids.json": "CryptOrchidsは、NFTをベースとしたゲームで、プレイヤーは7日ごとに生きたCryptOrchidの花に正確に水を与えなければなりません。プレイヤーが1週間に3時間の水やりを怠ると、デジタルフラワーが枯れてしまい、販売できなくなります。",
  "data/ph-top/2021/4/keychron-k12.json": "Keychron K12は、狭い場所でも使用できる汎用性の高い60%のコンパクトなワイヤレスメカニカルキーボードで、ホットスワップにも対応しています。Windowsとの互換性を保ちつつ、Macユーザー向けに最適化された数少ない60%キーボードの1つです。",
  "data/ph-top/2021/4/startup-falcon.json": "Startup Falconは、アーリーステージのスタートアップのための評価計算ツールです。あなたは起業家ですか？- 素早く、簡単に、信頼できる評価を得ることができます。- 投資家との交渉に備えることができます。- あなたの強みを明らかにし、弱みに対処しましょう。",
  "data/ph-top/2021/4/their-news.json": "Their Newsは、あなたの既存の信念に挑戦し、ニュースバブルから脱却するためのニュースサイトです。彼らのニュースについて知っていれば、異なる意見を持つ人々をよりよく理解することができます（badum tsss 🥁）。",
  "data/ph-top/2021/4/100-in-100-challenge.json": "100日間で100人の新規有料顧客を獲得する。それが、このチャレンジです。それが挑戦です",
  "data/ph-top/2021/4/personal-libraries-by-read-this-twice.json": "本のコレクションを整理したり、お気に入りの本で読書リストを作ったり、友達や家族、世界中の人と共有したりすることができる、すてきな新しい方法です。",
  "data/ph-top/2021/4/adgate-media-self-serve.json": "AdGate Mediaのセルフサービス型広告プラットフォームでは、規模や予算を問わず、アプリチームがリワード型のユーザー獲得キャンペーンを実施できます。アプリユーザーのモチベーションを高め、インストール、登録、購読、購入、レベルXの完了など、意味のある測定可能なKPIを達成させることができます。",
  "data/ph-top/2021/4/building-mobile-apps-at-scale.json": "本書は、iOSおよびAndroidアプリケーションを大規模に構築する際にエンジニアが直面する課題と、その解決に向けた一般的な方法をまとめたものです。大規模」とは、ユーザー数が数百万人規模で、大規模なエンジニアリングチームによって構築されることを意味します。",
  "data/ph-top/2021/4/blank-12.json": "Blankは、よく使われる8つのカテゴリーの200以上のすぐに使えるブロックを集めたライブラリです。クリーンなデザインと整理されたシンボルが特徴です。SketchとFigmaに対応しています。",
  "data/ph-top/2021/4/jupiter-28d29256-f27a-4e61-917f-3fe1f4470918.json": "ジュピターは、パーソナライズされたレシピや商品の提案により、食事の計画や食料品の購入を簡単にします。ジュピターの自動操縦技術は、お客様の好みを学習するので、より良い食事、より少ない無駄、そして計画と買い物の時間を節約することができます。",
  "data/ph-top/2021/4/syde-2.json": "経営者や政治家、10％の株を持っている人たちが買っている銘柄をコピーしよう。プロダクトハントキャンペーン：先着100名様には、永久無料アカウントをご用意しております。",
  "data/ph-top/2021/4/zoom-with-me.json": "あなたは、バーチャルブロックで最もプロフェッショナルなZoomerになるでしょう。あなたのcustomonzoom.meやonzoom.videoのリンクを登録して、それを披露してください。",
  "data/ph-top/2021/4/video-call-checklist.json": "ビデオ通話チェックリスト」は、ズーム疲れを軽減するためのヒントを盛り込んだ、軽快で読みやすいガイドです。このガイドの各ヒントは、研究結果と数百時間に及ぶ私たち自身の経験に裏打ちされています。",
  "data/ph-top/2021/4/flexmonster-desktop.json": "セルフサービス型の分析ツールで、プロフェッショナルなレポートを作成します。インストールして開くだけで、すぐに使い始めることができます。コーディング、SQL、MS Excelなどの知識は必要ありません。しかも、無料でご利用いただけます。",
  "data/ph-top/2021/4/flow-genius.json": "既存のWebサイトをWebflowに変換。忙しいあなたのために、Webサイトを構築します。固定価格で、セットアップ費用はかかりません。いつでもキャンセルできます。",
  "data/ph-top/2021/4/spark-n.json": "こんにちは！私たちはProduct Huntに参加できて興奮しています。あなたのチームはZoom/Meet/Teamsに疲れていませんか？私たちのユニークな15分間のオンライン体験を、次のバーチャルチームミーティングに落とし込んで、Spark'n upを実現しましょう！創造的思考に火をつけ、チームの結束力を高め、生産性を刺激します。",
  "data/ph-top/2021/4/curryish-2.json": "あなたの周りにいる一流のホームシェフが作った本格的な家庭料理を、インドでお届けします。",
  "data/ph-top/2021/4/ai-sales-email-assistant-by-reply.json": "創造性に欠けていませんか？毎日、毎日、新しいテンプレートを考えるのに疲れていませんか？世界最先端の言語ジェネレーターであるGPT-3を搭載したReplyのAIセールスメールアシスタントを使えば、効果的でユニークなセールスメールやフォローアップを数秒で作成できます🚀。",
  "data/ph-top/2021/4/report-cards-by-sharma-brands-x-tydo.json": "Nik Sharma氏は、自分のポートフォリオブランドのパフォーマンスレポートを無料でシンプルに、毎日受信箱に送ってほしいと考えていました。Report Cardsは、DTCオペレーターに、ブランドのパフォーマンスのスナップショットを毎日、毎週、毎月提供しています。",
  "data/ph-top/2021/4/relate-1-0.json": "Relateは、ウェブ上で共に創造するためのオープンプラットフォームです。シンプルで直感的、かつ視覚的な環境で、迅速なウェブ制作が可能です。ネイティブウェブ、HTML/CSS/JSに対応しています。どこでも公開・出力が可能。どこからでも何でもインポートできます。ベンダーロックインのない完全なオープン性。",
  "data/ph-top/2021/4/troopl.json": "Trooplは、企業が優秀な人材に出会い、採用することを支援します。企業が求人情報を掲載すると、社会人のコミュニティ（スカウト）が、最適と思われる人材を推薦する。採用が成功した場合、スカウトは報酬を得ることができる。",
  "data/ph-top/2021/4/tinyvid.json": "希望のファイルサイズを設定すれば、TinyVidがそれを実現します。TinyVidは、ファイルサイズの制限に合わせてビデオを作成するという、非常に現代的な頭痛の種を解決するために作られています。",
  "data/ph-top/2021/4/inscribe.json": "Inscribeは、誰もがERC721 NFTにリッチなメタデータを「記す」ことができるオープンなプロトコルです。このプロトコルでは、まず署名を検証します。これにより、お気に入りのインフルエンサーのサイン入り記念品や、あなたが出会ったクールな人々のデジタルコレクションなどを作成することができます。",
  "data/ph-top/2021/4/liro.json": "Liroは、音声を自動的に認識してキャプションに変換することで、動画をよりわかりやすく、魅力的にすることができるiOSアプリです。あなたのビデオを視覚的にキャッチーで優れたものにしたいですか？キャプションのアニメーションスタイル、色、フォントを選ぶことができます。",
  "data/ph-top/2021/4/cryptopoops.json": "CryptoPoopsは、Ethereumのブロックチェーン上で鋳造時にライブで生成される、愛らしいいたずら好きのNFTです。色々な形や大きさがありますが、身近に置いておきたいタイプのプープです😘。",
  "data/ph-top/2021/4/sunshine-social.json": "平均的な人は7.6のソーシャルメディアプロファイルを持っていますが、バイオには1つのリンクしか許されていません。Sunshine Socialを使えば、1つのカスタムリンクグリッドからすべてのソーシャルプロファイルとウェブサイトを共有できます。",
  "data/ph-top/2021/4/peachy-pay.json": "Peachyでは、お客様に負担をかけずにこれらの支払いを回収することができます。お客様が回収した場合にのみ、私たちは報酬を得ることができます。現時点ではPeachyへのアクセスを制限していますが、今すぐ回収したい支払期限切れの請求書をお持ちのプロバイダーを優先して、早期にオンボーディングを行います。",
  "data/ph-top/2021/4/live-home-3d-4-0.json": "2016年以来の「Live Home 3D」の最大のアップデートは、大量の新しい革命的な変化をもたらします。斜面に家を建てることや、山の丘に庭を作ることが現実のものとなりました。",
  "data/ph-top/2021/4/storyteller-2.json": "Storytellerは、コード不要のインタラクティブ・チュートリアル・ビルダーです。製品のプロモーションに役立つ製品のデモンストレーションやインタラクティブな製品説明のほか、教育や遠隔指導にも利用できます。メールアドレスを送信すると、早期アクセスが可能になります。",
  "data/ph-top/2021/4/portico-1-0-for-ios.json": "アイデアや計画を一つの場所にまとめて、よりスマートに旅をしましょう...ウェブとiOSで登場です - 場所、ウェブページ、メールなど、旅行に必要なものは何でも保存できます。 - iOSの共有メニューを使って、Instagramや他のアプリからのアイデアを保存できます - アイデアを地図上に表示して、プランを最適化できます。",
  "data/ph-top/2021/4/payrequest-3-0.json": "今年も新製品を発表する時期がやってきました。バージョン3では、リアルタイムでの支払いページの編集、ダイナミックな支払いリンクの作成、顧客の管理、Zapierの統合など、いくつかの気の利いた機能を搭載し、ビジネスの管理をより簡単にしました。",
  "data/ph-top/2021/4/airtag-2.json": "Appleは本日、Appleの「Find My」アプリで大切なアイテムを管理し、見つけることができる、小さくてエレガントなデザインのアクセサリー「AirTag」を発表しました。",
  "data/ph-top/2021/4/new-imac.json": "iMacは、Mac史上最高のカメラ、マイク、スピーカーを搭載し、Touch IDを初めて搭載しました。",
  "data/ph-top/2021/4/visiotale.json": "ビジオターレは、経営者や起業家のための新しいオンラインスクールです。ビジュアルコミュニケーションの旅を、「PowerPoint 101」のコースから始められることを嬉しく思います。人目を引くプレゼンテーションの作成方法を学ぶことを目的としています。ホームタスクのフィードバックやフリービーも含まれています。",
  "data/ph-top/2021/4/balance-checkout.json": "Balance Checkoutは、B2Bのすべての決済ニーズに対応した初のセルフサービス型チェックアウトです。ネットタームファイナンスから請求書発行、小切手まで、B2Bのお客様は数回のクリックでお好きな方法でお支払いいただけます。",
  "data/ph-top/2021/4/framer-app-for-windows-and-mac.json": "WindowsとMacに対応した全く新しいFramerデスクトップアプリケーションが登場しました。画像の書き出し、リアルタイムのコラボレーション、スマートコンポーネントを搭載した完全無料のアプリケーションです。ブラウザのプロトタイピング機能をデスクトップで実現します。今すぐダウンロード - https://bit.ly/3as5n67",
  "data/ph-top/2021/4/contentbot-ai.json": "ボタンをクリックするだけで、完全なブログ記事を生成したり、コンテンツを拡張することができます。編集したり、追加したりして、すぐに使えるようになります。",
  "data/ph-top/2021/4/anywhere-2.json": "チームを超えて仕事を整理する。コスト削減と目標達成のために。- 複数のチームに合わせてワークフローをカスタマイズする - 繰り返しの作業を自動化する - データを構造的に保存し、必要に応じてクエリを実行する - 他のアプリケーションと統合する - ダッシュボードを視覚化する",
  "data/ph-top/2021/4/the-new-ipad-pro-2.json": "Appleは本日、iPadで可能なことの限界を押し広げる、史上最もパワフルで先進的なiPad Proを発表しました。Appleが設計したM1チップが加わったことで、パフォーマンスが飛躍的に向上しました。",
  "data/ph-top/2021/4/pond5-free-collection-1.json": "何千もの無料ビデオ、画像、音楽トラックをダウンロードできます。グローバルなアーティストコミュニティが作成した優れた作品を厳選しているので、あなたのビジョンに命を吹き込むことができます。ウェブサイト、ソーシャルメディア、マーケティングキャンペーンのために、世界に通用するコンテンツを作ることができます。",
  "data/ph-top/2021/4/reworked.json": "就活の際の企業研究は、時間的にも体力的にも絶対に苦痛です。でも、もうそんなことはありません。Reworkedを使えば、以下のことが可能になります。- シンプルで直感的、かつ新鮮なインターフェイスで、38項目にわたる企業の詳細なランキングと分析を提供します。",
  "data/ph-top/2021/4/prisma-orm.json": "Prismaは、Node.jsとTypeScriptのための次世代ORMです。Prismaは、PostgreSQL、MySQL、SQLite、Microsoft SQL Server (Preview)に対応したオープンソースのORMで、アプリケーション開発者がより速く、より少ないエラーで構築できるようにします。",
  "data/ph-top/2021/4/fantasy-invest-daily.json": "ファンタジーインベストデイリーは、1分間のニュースレターです。トレーディング＆投資の世界で起こる最新の出来事を、楽しく簡単な方法でカバーしています。ニュースレターの新版は、毎回あなたの受信箱に直接届きます。",
  "data/ph-top/2021/4/imgen-by-jitbit.json": "TwitterカードやFacebookのオープングラフ画像など、「カバー画像」を自動生成するシンプルな無料ツール＋APIです。",
  "data/ph-top/2021/4/sugarfree.json": "添加物なし、砂糖なし、1日の摂取量を少しずつ減らしていくなど、あなたのシュガーフリーの旅をお手伝いします。",
  "data/ph-top/2021/4/pm-exercises.json": "PM Exercisesは、技術系企業のプロダクトマネージャー面接の準備に必要なすべてのものを提供しています。このサイトは当初、ブログとしてスタートしましたが、現在では、PMの面接準備の旅に役立つ様々な機能を備えたプラットフォームとなっています。",
  "data/ph-top/2021/4/magnato.json": "起業を志す人たちが、ビジネスを構築するために必要なすべてのことを、リソースやコミュニティの助けを借りて、無料で学ぶことができます！🤘。",
  "data/ph-top/2021/4/bolt-one-click.json": "Bolt One Clickは、買い物客がどこでもワンクリックでチェックアウトできる、シンプルで合理的なチェックアウトシステムです。パスワードやユーザー名、クレジットカード番号の入力は不要です。その結果は？その結果、買い物客のコンバージョン率が60%向上し、小売店にとっても買い物客にとっても素晴らしい結果となりました。",
  "data/ph-top/2021/4/material-tailwind.json": "Material Tailwindは、Tailwind CSSとMaterial Designのための使いやすいコンポーネントライブラリです。複数のReactコンポーネントが用意されており、すべてTailwind CSSクラスとMaterial Designガイドラインで記述されています。VueJSやAngularなどのコンポーネントも近日公開予定です。",
  "data/ph-top/2021/4/design-base.json": "開発者のためのトップレートのキュレーションされたデザインリソースのライブラリです。UIインスピレーション、UIリソース、アイコン、フォント、イラストなど、さまざまなものがあります。",
  "data/ph-top/2021/4/cookiehub.json": "CookieHubは、自動でクッキーをスキャンする機能を備えた、ウェブ訪問者から同意を得るために必要なすべての機能を提供するクッキー同意ソリューションです。",
  "data/ph-top/2021/4/space-era.json": "iPhoneやiPadを空に向けるだけで、目に見えるすべての天体の詳細を知ることができます。12万個の星、リアルタイムで追跡された1200個の衛星、星座、メシエとコールドウェルの深宇宙天体、すべての太陽系といくつかの流星群をチェックできます。",
  "data/ph-top/2021/4/figjam.json": "FigJamは、チームがコラボレーション、ブレインストーミング、フローのマッピングなどを行うためのオンライン・ホワイトボードです。FigJamは簡単に学べて楽しく使えるので、誰でも参加してアイデアを共有することができます。",
  "data/ph-top/2021/4/alpaca-broker-api.json": "Alpaca Broker APIを利用することで、口座開設、資金移動の予約、報酬の付与、米国株の手数料無料取引、端株の取引など、証券サービスの各要素を提供することができます。",
  "data/ph-top/2021/4/clerk-2.json": "https://www.clerk.dev/?ref=producthunt&utm_source=producthunt&utm_campaign=launch&utm_medium=desc ReactまたはNext.jsアプリに安全な認証とユーザー管理を追加 🔒 2 factor authやデバイス管理などの必須セキュリティ機能 📈 コンバージョンに最適化されたSign UpとSign Inフォーム 🎨 内蔵されたテーマとオープンAPIで簡単にカスタマイズ可能",
  "data/ph-top/2021/4/cold-email-templates-by-clientjoy.json": "上手に書かれたコールドメールは、大きな違いをもたらします。私たちは、いくつかの素晴らしいテンプレートをご用意しました。これらのテンプレートは、業界標準であり、実戦的であり、シンプルかつインパクトのあるものです。これらのコールドメールテンプレートを使えば、きっとYesと言ってもらえるはずです。",
  "data/ph-top/2021/4/formtestr.json": "FormTestrは、リードフォームのテストを自動化することで、送信エラーをなくし、リードを増やし、収益を向上させます。",
  "data/ph-top/2021/4/human-cosmos.json": "ヒューマンコスモスは、マインドフルネス、心理学、ヒューマンデザイン、占星術を組み合わせて、あなたがよりよく生きるための特別な開発プランを作成するAI駆動のアシスタントです。",
  "data/ph-top/2021/4/lomi-home-composter.json": "Lomiは、バイオプラスチックを分解することができる世界初の家庭用コンポスターです。熱、摩耗、酸素を利用して、わずか4時間で堆肥化プロセスを完了させることができ、臭いも汚れもありません。",
  "data/ph-top/2021/4/meco.json": "Gmailの受信ボックスに余裕を持たせながら、マインドフル・リーディングのために作られたアプリでニュースレターを楽しむことができます。",
  "data/ph-top/2021/4/beyta.json": "世の中にはあまりにも多くのノーコードツールがあり、そのどれもが素晴らしいテンプレートを持っています。しかし、すぐに使える適切なテンプレートを見つけようと思ったら、インターネット全体をスキャンする必要があります。- Beytaがお手伝いします。テンプレートリストも積極的に更新していきます。)",
  "data/ph-top/2021/4/storyset.json": "あなたの次のプロジェクトのための素晴らしい無料のカスタマイズ可能なイラストです。カスタマイズしたり、アニメーションさせたり、ダウンロードしたりして、素晴らしいランディングページやアプリ、プレゼンテーションを作ることができます。",
  "data/ph-top/2021/4/autopsy-4.json": "2000件以上の失敗した会社の投稿があり、創業者のストーリーや会社の失敗分析をカバーしています。スタートアップのエコシステムを継続的に支援するために、今すぐあなたの検死結果を提出してください： https://startup-research.typeform.com/to/fOrakq",
  "data/ph-top/2021/4/job-description-generator-3.json": "当社のAIアルゴリズムが高品質なジョブ・ディスクリプションを生成し、企業が仕事に適したスキルを見極め、目立たせ、優秀な人材を集めるのに役立ちます。時間を最大80%節約できます。職種を入力するだけで、5分以内に魅力的な文章が完成します。無料です。",
  "data/ph-top/2021/4/lemon-lab.json": "レモン・ラボは、ジャーナリズムとコミュニティ・レビューを組み合わせて、質の高い健康・ウェルネス製品を表面化させています。より多くのテスト、より少ないレモン。",
  "data/ph-top/2021/4/superplate.json": "Superplateは、フロントエンド開発者のための画期的なCLIツールです。ビルド設定を必要とせず、数秒でボイラープレートプロジェクトを作成します。",
  "data/ph-top/2021/4/ramenhacks.json": "Ramen Hacksは、インターネット上にあるインスタントラーメンをより美味しくするためのハックを厳選して紹介しています。5分であなたの食事を変身させましょう",
  "data/ph-top/2021/4/bendis-ui-library-by-shuffle.json": "Bendis UI Library for Shuffle Editorは、モダンで大胆なデザインです。あなたのサイトに命を吹き込み、あなたのプロジェクトに少しだけ火を入れます。https://shuffle.dev/marketplace/bendis",
  "data/ph-top/2021/4/vilua.json": "あなたの健康を守り、最適化する - 警告のサインが出る前に あなたのヘルス・インデックス・スコアを調べて、あなたに合った健康増進のためのアドバイスを得てください。そして、あなたのヘルス・インデックスが時間とともに改善されていくのを見ることができます。",
  "data/ph-top/2021/4/httpdump-2.json": "HTTPDumpは、データをダンプし、リアルタイムで検査するためのユニークなエンドポイントを提供します。また、レスポンスの比較やモックを作成することもできます。",
  "data/ph-top/2021/4/wonderment.json": "ワンダーメントは、輸送に透明性をもたらします。当社の注文追跡プラットフォームは、Eコマースマーチャントに出荷の360°ビューを提供し、出荷の遅れや問題を自動的に検出し、ブランドは注文について顧客と積極的にコミュニケーションを取ることができます。👉 無料でお試しください：Wonderment.com",
  "data/ph-top/2021/4/do-one-better.json": "一般的な商品の本当の価格を知り、持続可能で倫理的な、より手頃な価格の代替品を提供する無料のワンストップショップです。私たちは、商品のライフサイクルや成分を調査し、信頼できるブランドを見つけることで、面倒な作業を代行します。",
  "data/ph-top/2021/4/pictory.json": "Pictory AIは、ブログ、ウェビナー、顧客インタビューなど、価値は高いが視認性の低い長編コンテンツを、数十本の短いソーシャルビデオ投稿に変換します。",
  "data/ph-top/2021/4/meet-for-slack.json": "Slack内でワンコマンドですぐにGoogle Meetを開始できます。ミーティングの設定、開始、招待状の送信には「/meet」を使います。すべてを一度に行えます。個人のDM、グループのDM、チャンネルで使えます。はい、これは1つのことをするだけですが、本当によくできています🚀。",
  "data/ph-top/2021/4/wortharead.json": "主流のニュースは最低だ。正直に言うと、ほとんどの非主流のニュースも最悪です。Worthareadでは、実際に良いと思えるニュースレターやブログを見つけることができます。",
  "data/ph-top/2021/4/slack-mood-check-in-by-troopr.json": "チームのムードを毎日把握し、傾向を見極めて行動に移すことができます。チームのムードを把握するためのTroopr Check-insは、設定が簡単で、完全にSlack内で非同期かつ匿名で動作します。リモートチームをケアするための素晴らしい方法です。",
  "data/ph-top/2021/4/loop-b53e47dd-47db-4f34-957d-16f338dd4cca.json": "ループは、スピーカーとリスナーが新しい方法で交流できるように、クラブハウスのライブルームからチャットルームを作成します。リンク、ミーム、ロースト、ツイッターのハンドルネームなどを一箇所で共有することができます。",
  "data/ph-top/2021/4/travlee.json": "英国内での環境にやさしい旅を計画し、木を植えることで排出量を相殺することができます。",
  "data/ph-top/2021/4/notion-finance-tracker.json": "この「ファイナンス・テンプレート」で、経費に区切りをつけましょう。この概念テンプレートは、✅&nbsp;必須経費 🤔&nbsp;裁量経費 🤑&nbsp;貯金 🎯&nbsp;所得分配 💌&nbsp;クーポン 💶&nbsp;領収書 今すぐ入手🔥してください。",
  "data/ph-top/2021/4/cohere-voice.json": "Cohere Voiceを使えば、サイト上でお客様と直接会話することができます。訪問者と即座にライブビデオ通話をしたり、サイト内を案内したりすることができます。ユーザーがサイトを離れることなく、すべてが可能です。",
  "data/ph-top/2021/4/stratum-wireframe-kit-for-figjam.json": "Stratum Wireframe Kitは、FigJamでワイヤーフレームを作成するためのコンポーネントを集めたライブラリです。オートレイアウトとバリアントをサポートしています。誰でも、いつまでも無料で使えます。",
  "data/ph-top/2021/4/sounds-of-earth.json": "Sounds of Earth」プロジェクトは、この地球のユニークさと自然の美しさを人々に思い出させることで、生態系の保護と回復への意識を高めることを目的としています。",
  "data/ph-top/2021/4/knugget.json": "Wikipedia、Blinkist、Ankiの3人がバーに行く。酔っぱらって、落ち込んで、そして、それがある。knuggetでは、知識のナゲットを発見し、間隔を空けた反復の助けを借りて、それらを覚えておくことができます。",
  "data/ph-top/2021/4/stanza-dev-1-0.json": "Stanzaでは、コードスニペット、技術記事、技術テストなど、コミュニティが作成した情報をもとに、コーディングスキルの向上をサポートしています👩 💻🧑💻。",
  "data/ph-top/2021/4/lockcard-a-new-dictionary.json": "従来の辞書では、単語を検索することはできても、それを定着させることはできませんでした。Lockcardは、単語を検索するたびに、その単語をどれだけ覚えているか、クイズの通知によってテストされるように設計されています。今すぐLockcardをダウンロードしましょう。",
  "data/ph-top/2021/4/wepik.json": "Wepikのテンプレートで美しいデザインを作りましょう。無料のテンプレートをカスタマイズしてダウンロードし、オンライン編集ツールで魅力的なデザインを作りましょう。カスタマイズ可能なInstagramストーリーテンプレートをデザインして、あなたのリーチを増やしましょう。",
  "data/ph-top/2021/4/cusdis.json": "Cusdis は、オープンソースで、軽量 (~5kb gzipped) で、プライバシーに配慮したコメントシステムです。",
  "data/ph-top/2021/4/uxreviewer-io.json": "ユーザーエクスペリエンスは、デジタル製品にとって最も重要な部分です。そして、最も軽視されがちな部分でもあります。UXreviewer.ioはこの状況を変えるために存在します。Webサイト、iOS/Androidアプリ、チャットボット、ボイススキルの具体的な改善案を含むUXレポートを入手できます。",
  "data/ph-top/2021/4/snakker.json": "Snakker™は、あなたのビジネス、オーディエンス、収益、売上、クリック、「いいね！」、「大好き！」を増やすために作られたプラットフォームです。何を発信したいかに関わらず、数分でSnak™を作成し、数秒で共有し、重要なことは、有益なフィードバックを即座に受け取り始めることです。",
  "data/ph-top/2021/4/emojise-0e552cde-2403-48e7-8461-b3991e29a81a.json": "あなたのウェブサイト、ブログ、または電子メールで、絵文字のパワーとシンプルさを使って、顧客のフィードバックやリードを収集します。",
  "data/ph-top/2021/4/chaos.json": "Chaosは、あらゆるリンク、画像、ドキュメントを保存できるブックマークアプリです。無限の入れ子やプレビューなどの強力な機能を使って、あなたのモノとシームレスに対話します。あなたのデータはクラウドに安全に保存され、デスクトップやウェブでアクセスできます。",
  "data/ph-top/2021/4/diagrams-net.json": "diagrams.netは、ダイアグラム・アプリケーションを構築するためのオープンソースの技術スタックであり、世界で最も広く使用されているブラウザベースのエンドユーザー・ダイアグラム・ソフトウェアです。",
  "data/ph-top/2021/4/getlocus.json": "バーチャルルームは、歩いたり、話したり、物を動かしたりできる現実の部屋のようなものです。チームビルディング、ブレインストーミング、レッスンなど、様々なコラボレーションツールを提供しています。GetLocusは、ビデオチャットではなく、ミーティングスペースなのです。デジタルの世界であなたの場所を確保しましょう",
  "data/ph-top/2021/4/memegine.json": "Memegineは、インターネット上のミームのための唯一の全文検索エンジンであり、インターネット上のあらゆる場所から数百万のミーム画像を検索することができます。",
  "data/ph-top/2021/4/add-to-calendar-link-generator.json": "Google Calendar、Outlook、Microsoft Office 365、Android、Apple、Yahoo Calendars用のAdd to Calendarリンクやイベントリマインダーボタンを生成します。",
  "data/ph-top/2021/4/stumbled.json": "インターネット上のランダムなWebサイトを発見してみましょう。Stumbledは、面白いもの、奇妙なもの、驚くようなもの、優れた品質のウェブサイト、時間をつぶすためのサイト、新しいことを学ぶためのサイトなどを厳選して集めています。",
  "data/ph-top/2021/4/qoooreman-vs-robinwho.json": "QoooreManは、株式市場の基本を理解し、RobinWhoのお尻を蹴ることができる、投資の世界からの興味をそそるゲームです。QoooreManをプレイするには、Qoooreアプリをダウンロードしてください。",
  "data/ph-top/2021/4/notion-scheduler.json": "Notionでは、イベント、タスク、プロジェクトのスケジュールを立てることができます。",
  "data/ph-top/2021/4/ensemble-chat.json": "Ensembleは、購読料で収益を上げるチャットコミュニティを簡単に始めることができます。自動化されたサブスクリプション管理、統合された請求書、カスタムブランディング、ビジネス分析ダッシュボード、無制限のユーザー/チャットルーム/履歴がパックになっています。",
  "data/ph-top/2021/4/scribe-ai.json": "メモ取りを自動化し、重要な瞬間のハイライトを共有する。あらゆる会議を記録し、書き起こすことができます。 面倒なメモを取る手間を省き、重要な瞬間をハイライトして共有することができます。 出席する必要のない会議をスキップすることができます。",
  "data/ph-top/2021/4/fan-of-sleep.json": "シンプルでカスタマイズ可能な、より良い睡眠を得るためのホワイトノイズファンです。配色を変えたり、スピードを設定したり、自然音をミックスしたり、zzz!",
  "data/ph-top/2021/4/alpe-audio.json": "Alpe Audioは、新しいタイプのオーディオプラットフォームです。学ぶことは、発見、好奇心、自分自身、そしてキャリアアップのための生涯にわたる努力です。しかし、外出の多い現代のライフスタイルでは、新しいコンテンツを吸収する唯一の時間である「外出先」に対応した教育コンテンツがありません。",
  "data/ph-top/2021/4/iconduck.json": "Iconduckは、146（数え）のオープンソースのアイコンとイラストセットのコレクションです。検索やダウンロードが可能で、個人的にも商業的にも利用できます（ライセンスによってはバックリンクを要求するものもあります）。",
  "data/ph-top/2021/4/restly-2.json": "睡眠の質は、心の健康と密接な関係があると考えています。ポジティブシンキングは、睡眠を改善するための新しいアプローチです。自己愛、自己成長、愛と友情、ストレスと不安、経済的安定 - どのカテゴリーでもお選びいただけます。休息を取りましょう! 💜",
  "data/ph-top/2021/4/box-piper-hacker-news.json": "この10年のために革新的に再構築されたHNのバージョン。改良されたUI/UX、Snapchatのようなストーリーモード、そしてHNのコンテンツをすぐに消費できるように「202X」の方法でデザインすることに焦点を当てています。また、この街の新しいhttps://twitter.com/boxpiperapp、1日1回、HNを更新します。",
  "data/ph-top/2021/4/pretrained-ai.json": "ホスティングされた独自のAPIエンドポイントを設定・導入し、テキスト、画像、その他のデータを最先端の機械学習を用いて数回のクリックで処理することができます。1つまたは複数のモデルを連結して、データを効率的に処理し、データからインサイトを抽出することができます。",
  "data/ph-top/2021/4/seotweets.json": "SEOの世界では遅れをとるのは簡単で、常に情報を得ることが重要です。ツイッターはつながりを保つのに最適な場所ですが、雑音が多いのが難点です。seotweets.ioでは、業界の著名人によるSEO関連のツイートを定期的に収集し、情報収集に役立てています。",
  "data/ph-top/2021/4/cinemate.json": "AIを使って映画のレコメンデーションを受けることができます。好きな映画を選ぶと、データベースにある1億件以上の評価をもとに、AIがすぐにおすすめの映画を見つけてくれます。",
  "data/ph-top/2021/4/avatar-u.json": "オープンソースのライブラリで、無限の（というかちょっとした）組み合わせが可能です。自分のアバターを作って楽しんでください。面白いメガネをかけた人、ワイルドなヘアスタイルの人、セクシーな服を着た人など。カスタムコンポーネント。👄口、👀目、👃鼻、💇髪型、👗衣装",
  "data/ph-top/2021/4/jarvis-by-conversion-ai.json": "人工知能を使って、より良いコピーを書こう。長文アシスタントを搭載したJarvisは、ブログやソーシャルメディアへの投稿、さらには書籍の執筆も可能です。Conversion.aiを使えば、ライターの悩みを解消して、高品質なコンテンツを圧倒的なスピードで作成できます。",
  "data/ph-top/2021/4/phigma.json": "https://www.phigma.app は、Figma用の100以上のProduct Huntテンプレートのコレクションです。✌️ 簡単に使えます 🧩 数回のクリックで全ての色、スクリーンショット、ロゴをカスタマイズできます 🚀 Product Huntのベストローンチにインスパイアされています ⏰ リサーチとデザインにかかる時間を100時間も節約できます PHとは無関係です。",
  "data/ph-top/2021/4/method-financial.json": "Method（YC S19）は、クレジットカード、学生ローン、自動車ローン、住宅ローンなど、ユーザーのあらゆる債務を、単一のAPIで簡単に支払うことができます。",
  "data/ph-top/2021/4/startup-video-directory.json": "このベストプロダクトビデオのキュレーションディレクトリには、40以上の技術系スタートアップが参加しています。クリエイター自身による回答も含まれており、刺激的な気づきをもたらしてくれるでしょう。",
  "data/ph-top/2021/4/oyster-2-0-2.json": "オイスターは、企業がグローバルな人材市場にアクセスする方法を急速に変革している分散型人材管理プラットフォームです。オイスターは、企業がグローバルな人材市場にアクセスする方法を急速に変革する分散型人材管理プラットフォームです。",
  "data/ph-top/2021/4/sshush.json": "創業者のためのプライベートチャットルームは素晴らしいものです。自分でルームを立ち上げたり、既存のルームに参加したりして、適切なタイミングで適切な会話をすることができます。部屋に10人のファウンダーが入ると、他の人はその部屋にアクセスできなくなります。あなたのスタートアップを後押しし、楽しんでください。",
  "data/ph-top/2021/4/zluri.json": "Zluriは、エンタープライズSaaS管理プラットフォーム（SMP）です。1つのダッシュボードから、SaaSアプリケーションの発見、管理、最適化、セキュリティの確保を支援します。要するに、ZluriはITチームをSaaS化された新しいランドスケープのコントロールに戻すのです。",
  "data/ph-top/2021/4/bartender-4-3.json": "Bartenderは、メニューバーを強力にサポートする受賞歴のあるmacOS用アプリケーションです。メニューバーのアイテム、表示内容、表示時間を完全にコントロールでき、メニューバーのアイテムは必要なときにだけ表示されます。",
  "data/ph-top/2021/4/talk-3.json": "Talkは、フリー＆オープンソースのウェブ用ビデオ会議アプリです。すべての主要ブラウザで動作します。サインアップなし。ダウンロードもありません。100%ピア・ツー・ピアです。",
  "data/ph-top/2021/4/this-is-tech.json": "ビジネス、科学、暗号通貨に関する3つのカテゴリーで30枚のイラストを用意しました。あなたのプロジェクトにおけるいくつかの技術的なプロセスを美しく描きます。SketchとFigmaに対応しています。すべてのPNGファイルは無料です。",
  "data/ph-top/2021/4/adorable-link.json": "絵文字はどこにでもありますが、リンクにはありません。実は、それを解決しました。絵文字対応のリンクを安全かつ迅速に作成します。オプションは無限で、あなたの想像力が限界です。シャツ、プロフィール、広告などに、あなたの愛らしいリンクを使ってください。",
  "data/ph-top/2021/4/the-design-encyclopedia-for-figma.json": "Design Encyclopedia は、綿密にドキュメント化された数千もの UI トークン、UI コンポーネント、ページ・レイアウト、インタラクション・パターン、ビジュアライゼーションを含む Figma Design System です。",
  "data/ph-top/2021/4/controld.json": "ControlDでは、マルウェア、広告、ソーシャルネットワーク、アダルトコンテンツ、IoTテレメトリなどの15カテゴリーのドメインや、70以上のサービスをブロックすることができるので、データを採取されたり、時間を浪費されたりすることを防ぐことができます。",
  "data/ph-top/2021/4/web-editor.json": "ウェブエディターは、あらゆるウェブサイトの要素を検査し、そのプロパティを変更し、コンテンツを挿入し、デザインし、思い通りにビジュアル化するのに役立ちます。専門的な知識は必要ありません。むしろ、このツールがあなたのために仕事をしてくれます。",
  "data/ph-top/2021/4/cooooookies.json": "あなたが受け入れたブラウザのCookieの数を追跡するクロームプラグインを入手してください。できるだけ多くのブラウザのCookieを受け入れるように競争してください。100ポンドの（本当に本物の）クッキーが当たります。",
  "data/ph-top/2021/4/uptimerobot-app-2-0.json": "ダウンタイムの通知を受け取ろう 設定、管理、そしてどこにいても通知を受けることができます。プッシュ通知と SMS 通知により、ダウンタイムや SSL 問題を二度と見逃しません。UptimeRobotの全面的に刷新されたモバイルアプリをお試しください。世界有数のアップタイム監視サービスです。",
  "data/ph-top/2021/4/breakout-groups-by-whereby.json": "Breakout Groupsでは、すべての料金プランのホストが、参加者が小さなグループに分かれて行うブレイクアウトセッションを開始できます。チームやクラスメートとの共同作業や、Wherebyでの友人との交流に最適です。",
  "data/ph-top/2021/4/img-downloader.json": "Imdownloaderは、画像を一括してダウンロードすることができるオールインワンのオンラインツールです。まず、1つのURLを使用して任意のウェブページから画像を一括ダウンロードできます。次に、Googleの検索エンジンから画像を一括ダウンロードできます。さらに、URLをコピーすることで、Instagramから画像や動画をダウンロードすることもできます。",
  "data/ph-top/2021/4/paletter.json": "シンプルなデザインが多い現代では、色の選択がこれまで以上に重要になっています。Paletterは柔軟なコントロールで、必要な色やバリエーションを見つけることができます。",
  "data/ph-top/2021/4/vidiwise.json": "お客様の行動に基づいたインスタントビデオ通話で売上をアップさせましょう。Vidiwiseは、たった1クリックで訪問者とつながることができる、コード不要のビデオコールプラットフォームです。",
  "data/ph-top/2021/4/cognitive-apps-api.json": "Cognitive Apps APIソリューションは、メンタルヘルス分析を既存のワークフローに統合するために設計されています。ムード分析、感情の検出、メンタルヘルス状態のトラッキング。APIソリューションは、ウェブやモバイル製品など、どのようなサービスにも対応します。",
  "data/ph-top/2021/4/jotform-approvals.json": "承認プロセスを効率化する。リクエストや申請書などをフォームで収集し、自動化された承認フローの中でタスクに変換します。提出物に迅速に対応し、自動メールを送信し、どのデバイスからでも承認プロセスを追跡することができます。",
  "data/ph-top/2021/4/write-on-video-for-android.json": "美しく、感動的なビデオを作成して、ビジネスに役立てましょう。Write-on Videoの豊富な機能により、最初から最後までビデオ制作を簡素化できます。ビデオコンテンツが完成したら、ソーシャルメディアで共有したり、プロジェクトをPDFのストーリーボードとしてエクスポートしたりすることができます。",
  "data/ph-top/2021/4/figma-design-system.json": "Figma Design System には、あらゆる複雑さのインターフェイスを作成するために必要な要素がすべて含まれています。これで、すべての要素をゼロから作成する必要はありません。このセットを作成する際に、最新のFigmaの機能をすべて盛り込みました。",
  "data/ph-top/2021/4/codingescape.json": "コーダーとノンコーダーのための初の脱出ゲームです。全く新しいコーディング体験を提供します。家族や友人、同僚と一緒に遊ぶ。100%オンラインで、リモートで、またはオンサイトで、チームで楽しむことができます。12以上のプログラミング言語で、なぞなぞとコーディングパズルを組み合わせて楽しめます。",
  "data/ph-top/2021/4/avokaado.json": "Avokaado は、ビジネスにおけるドキュメント ワークフローの効率化を支援する契約ライフサイクル管理プラットフォームです。あらゆるドキュメントのテンプレート化、ドラフト化、交渉、承認、署名を 1 つのプラットフォームで行うことができます。B2Bビジネスやスケールアップ企業に最適です。",
  "data/ph-top/2021/4/mighty-5.json": "Mightyは、クラウド上のパワフルなコンピュータから完全にストリーム配信される、より高速なブラウザです。50以上のタブを使用してもコンピュータが停止することはなく、ファンの音を気にすることなく作業ができ、Figmaは2倍速くなり、バッテリーの持ちも良くなります。",
  "data/ph-top/2021/4/bionicwp.json": "BionicWPでは、WordPressサイト向けの超高速マネージドホスティングを提供しています⚡ ⠀ - サイトスピードは24時間365日監視されています（他社では提供されていません！） - 無制限の編集 - 無制限の無料移行 - マネージドアップデート（テーマ、コア、プラグイン） - カスタムダッシュボード - 購入前の試用",
  "data/ph-top/2021/4/space-9e0d7ef1-dc3e-4f6f-9c38-43b26e24997f.json": "お客様向けの音声によるタウンホールやユーザーとの音声によるAMAを開催し、イベント後のポッドキャストをワンクリックで公開することで、エンゲージメントを促進し、リアルタイムの会話によるフィードバックを得ることができます - これらはすべて、快適で親しみやすい自社のウェブサイトで行うことができます。",
  "data/ph-top/2021/4/nextux-visual-editor.json": "NextUXを使えば、WebサイトやWebアプリ上でフルページのスクリーンショットをキャプチャし、文脈に応じたコメントを簡単に追加することができます。また、既存のデザインを切り取ったり、並べ替えたり、追加したり、ゼロからデザインを作成することもできます。無限のキャンバスの上で、リアルタイムにアイデアを共有し、迅速に反復していくことができます。",
  "data/ph-top/2021/4/datamilk.json": "DataMilkは、E-Commerceストアのユーザーエクスペリエンスを最適化し、コンバージョン率の向上や離脱率の低減を実現するAI駆動のツールです。コーディングやエンジニアリングのスキルは必要ありません。簡単な統合手順を踏むだけで結果が出ます。",
  "data/ph-top/2021/4/ad-report-by-pudding-ai.json": "自動化された広告パフォーマンスレポートを受信箱に直接メールで送信することで、KPIに役立つものとそうでないものを知ることができます。PuddingのAIと機械学習を活用して、どのような広告が製品やオーディエンスに効果的かを理解することができます。",
  "data/ph-top/2021/4/every-org-donate-crypto.json": "誰もが簡単かつ安全に暗号通貨を寄付して、米国のあらゆる慈善団体を支援し、納税証明書を得ることができるようになりました。Every.orgは、人々の寄付を支援する501(c)(3)の非営利団体です。非営利団体は、ウェブサイトに「Donate Crypto」ボタンを無料で設置することもできます。",
  "data/ph-top/2021/4/wordable.json": "Wordableは、CMSのアップロード、最適化、公開を迅速かつ簡単に行うことができます。コンテンツ、SEO要素、画像などをGoogle Docs（またはHTML）からご希望のCMSに直接エクスポートすることで、時間を節約し、ランキングを上げることができます。",
  "data/ph-top/2021/4/spotify-paid-subscriptions.json": "最もシンプルなサブスクリプション設定 ✔️ 簡単に収益を増加 ✔️ あなたのリスナー、あなたのコミュニティ ✔️ 本日より、クリエイターはAnchorの有料サブスクリプションへのアクセスにサインアップすることができ、プラットフォーム手数料が無料になります。http://anch.co/paidsubssignup",
  "data/ph-top/2021/4/client-onboarding-kit-for-notion.json": "小規模な代理店やフリーランサーのための、使いやすく、時間を節約し、大企業のクライアントに対してより良いドキュメント、セキュリティ、プロセスを提供するキットです。- クライアント・ダッシュボード・テンプレート、ドキュメント・ジェネレーター、プロジェクト・ボード＆タイムライン、その他多くの機能を備えています。",
  "data/ph-top/2021/4/butter-4.json": "Butterを使えば、1つの場所で楽しく共同作業ができるので、エネルギーを取り戻すことができます。⠀ アジェンダ、投票、ブレイクアウト、ミロ、楽しいリアクション、サウンドなどが内蔵されています。",
  "data/ph-top/2021/4/juphy.json": "📥 統一された受信箱で複数のクライアントを管理 ⠀ ⭐️ 「使いやすさ」＆「サポートの質」でトップ5にランクイン。⠀ 🏃🏻♀ ⠀ カスタマーサポートを簡素化し、対応力を向上させたい代理店、フリーランサー、中小企業に最適です。",
  "data/ph-top/2021/4/instant-3a9422b7-438c-4027-bdf5-57720c12c9cf.json": "Instantは、WooCommerceストア用のフリクションレスな1クリックチェックアウトで、オンラインセラーの売上を向上させるために開発されました。初回ユーザーはチェックアウト時に簡単なフォームに入力し、再来ユーザーはInstant対応ストアであれば1クリックチェックアウトが可能です。はじめよう- https://getinstant.co/ ⚡️",
  "data/ph-top/2021/4/stacks-accelerator.json": "Stacks（旧Blockstack）でビットコインネットワーク上に構築する優れたスタートアップチームに5万ドルを投資します。Eric Ries、Meltem Demirors、Thomas France、Sergey Nazarovなどのスピーカーやメンターが参加しています。あらゆるステージのスタートアップを受け入れ、レベルアップを支援します。",
  "data/ph-top/2021/4/devbook.json": "Devbookは、開発者が必要なリソースを見つけ、質問に素早く答えられるようにするための、開発者のための検索エンジンです。高速で、コードエディタからすぐにアクセスでき、キーボードだけで完全に制御できます。",
  "data/ph-top/2021/4/csml-playground.json": "CSML（Conversational Standard Meta Language）を使用したリッチな会話体験の設計、構築、テストを、全く新しいオープンプレイグラウンドを使ってブラウザから直接行うことができます。ログイン不要で、チャットボットのコードをすぐに共有することができます。",
  "data/ph-top/2021/4/zestack.json": "Zestackは、マーケティングと成長戦略のための \"Stack Overflow \"です。私たちの500人以上のコミュニティは、お互いに実践的な成長キャンペーンを学び、実行することに焦点を当てています。お待たせしました。今なら無料で参加できます。",
  "data/ph-top/2021/4/codemap-2-0.json": "Codemapは、ノーコード／ローコードとオートメーションのための世界初のフリーランス・マーケットプレイスです。スマート・ブリーフを使ってプロジェクトを説明すると、事前に審査された一流のノーコード・エキスパートやチームとマッチングします。あなたの製品、ツール、ワークフローを数日から数週間で立ち上げましょう。",
  "data/ph-top/2021/4/mockup-generator-by-pixeltrue.json": "Mockup Generatorを使えば、わずか数クリックで美しい製品モックアップを作成することができます。完全に無料です。5つのデバイスタイプで30種類以上のモックアップが用意されており、プロジェクトやマーケティングキャンペーンのための美しい製品モックアップを作成するのに十分な素材が揃っています。",
  "data/ph-top/2021/4/arc-2-0.json": "リモートの仕事を探している開発者のためのワンストップショップです。アークは世界中のリモートジョブを集約し、あなたに最適な仕事をリストアップします。アークのリモート開発者コミュニティに参加して、サポートを受けたり、キャリアを磨いたりしましょう。",
  "data/ph-top/2021/4/immersive-scenes-by-virtualoffice-2.json": "Zoom's Immersive Viewのためのブランディングされたシーンを作成します。シーンを選択し、ロゴをアップロードするだけで、あなたのバーチャルオフィスがZoom's Immersive Viewに対応したものになります。",
  "data/ph-top/2021/4/product-virality.json": "この無料電子書籍では、次のことを学ぶことができます。✅ なぜ正確に「バイラル」になるべきなのか、✅ さまざまなタイプの製品のバイラル性、✅ バイラルな製品の作り方、✅ たくさんの実例、✅ そして今日から実行できる実用的な戦略とヒントです。",
  "data/ph-top/2021/4/powerben-powerbank.json": "すぐに使えるバックアップ電源です。24000mAhの超大容量バッテリーとの組み合わせで、ONLY3分でiPhone12の容量を確保できます。車、太陽光発電、ACアダプタ、PDアダプタを使って、PowerBenを充電することができます。",
  "data/ph-top/2021/4/mars26.json": "Mars26は、高解像度、ナチュラルカラーのオープンソース火星地図です。過去に撮影されたCTXとVikingの衛星写真をもとに作成されており、完全に網羅されたインタラクティブな地図になっています。ズームインしたり、探索したり、お気に入りの火星の場所にツイートを置いたりすることができます。",
  "data/ph-top/2021/4/instagram-engagement-report-2021.json": "100万人のユーザーに共有された1億件以上のInstagramの投稿を分析し、Instagramマーケティングに関する最も完全で最新のリソースを無料で提供しています。何が効果的かを推測するのではなく、当社のデータと専門知識を頼りに、貴社のInstagram戦略が完全に最適化され、最新のものであることを確認してください。",
  "data/ph-top/2021/4/sellou.json": "Sellouはオンラインでの売買の方法を再設計します! 世界中の人々が商品を販売しているのを発見したり、あなたの商品をSellouで販売することができます。今回はオープンベータ版ですので、皆様からのフィードバックをお待ちしております。🙌 サインアップ https://sellou.com",
  "data/ph-top/2021/4/frido.json": "Fridoは、果てしなく続くToDoリストを作成する負担からあなたを解放するためにデザインされたToDoアプリです。",
  "data/ph-top/2021/4/glitch-instant-sites.json": "ReactやEleventyなどのフレームワークを使って、ライブURLで本格的なフルスタックサイトやスタティックサイトを1分以内にブラウザ上で無料で作成・公開することができます。Glitchでは、コード不要のツールやサイトビルダーよりも早く、簡単にサイトを作ることができますが、ロックインはありません。",
  "data/ph-top/2021/4/bookshlf-2.json": "デジタルコンテンツに無制限にアクセスできるようになったことで、私たちは発見し、学び、成長する大きな機会を得ました。Bookshlfは、クオリティとテイストを重視し、クリエイター（キュレーター）が自分の好きなコンテンツを共有することで、その知識や専門性を収益化できるようにしています。",
  "data/ph-top/2021/4/email-verify-api.json": "シンプルなGETリクエストでメールアドレスを検証する正確なAPIです。使い捨てのメールを簡単に検出し、メールボックスがアクティブかどうかを確認します。",
  "data/ph-top/2021/4/face-generator.json": "あなたの次のプロジェクトを表現するために、完璧な顔を作りましょう。Face Generatorでは、バーチャル・アイデンティティに必要な特徴や感情をダイヤルで入力し、リアルタイムで生成することができます。",
  "data/ph-top/2021/4/the-saas-cpo-checklist.json": "この包括的なチェックリストは、8年以上にわたる研究開発と100件以上のデータビズプロジェクトをまとめたもので、ユーザーのために差別化されたスケーラブルなダッシュボードを作成するのに役立ちます📊 アナリティクスプロジェクトの複雑さ、コスト、価値を生み出すまでの時間を短縮するためにお使いください💪 お楽しみください🤩。",
  "data/ph-top/2021/4/notea.json": "Noteaは、S3に保存されているSelf hosted Note taking appで、ワンクリックでVercelやAWSにデプロイしたり、Docker🐳でデプロイすることができます。Amazon S3、MinIO、Aliyun OSSなどのストレージに対応しています。これはTypeScript🚀で動いており、Mark Downが大好きです。",
  "data/ph-top/2021/4/moni-talks-2.json": "Moni Talks 🌶は、400以上のリソースから厳選された大量のコンテンツを、5分間のレポートとしてあなたの受信箱にお届けする、日刊の暗号ニュースレターです。毎日お届けします。次の100倍プロジェクトやF🤐CK FOMOをお見逃しなく。twtw, our Twitter: https://twitter.com/getmoni_talks",
  "data/ph-top/2021/4/bigvu-wordtrim.json": "BIGVUでは、話している動画を簡単にカットしたり、テレプロンプターアプリで録音したり、ファイルを取り込んだりすることができます。あなたのビデオは自動的に書き起こされます。あなたは、ビデオの開始と終了を指示する単語を選択するだけです。速くて簡単です。すべてはあなたの携帯電話から。",
  "data/ph-top/2021/4/emaily.json": "長いメールを書くのにうんざりしていませんか？Emailyは、2回のクリックでプロフェッショナルなメールを作成できる、使いやすいサービスです。コールドメール、求人情報、ニュースレターなど、あらゆる目的に応じた提案が得られます。もっと詳しく - https://emaily.app/",
  "data/ph-top/2021/4/rare-things-beta.json": "Rare Thingsは、世界的な職人による短編ビデオショッピングをお届けします。陶芸家、金属職人、木工職人、テキスタイル・アーティスト、レザー・クラフト、裁縫師など、世界中の熟練した職人のスタジオに入り、限定コレクションをご覧いただけます。",
  "data/ph-top/2021/4/product-market-fit-toolkit.json": "このツールキットはsalesfit.ioによって作られました。購入プロセス中に自動的に収集されたデータを使って、製品と市場の適合性を測定し、改善することができます（別のデータを使用することもできます。",
  "data/ph-top/2021/4/revops-cashflow-api.json": "アカウントのプロビジョニング、課金設定、オンボーディングコミュニケーションに煩わされることなく、価値をより早く提供することができます。",
  "data/ph-top/2021/4/lean-incubator.json": "アイデア開発をインキュベート＆マネジメントするためのワークシステムテンプレートです。",
  "data/ph-top/2021/4/skio.json": "Skioは、Shopifyのマーチャントがサブスクリプションを販売したり、グループ割引を行ったりするのに役立ちます。",
  "data/ph-top/2021/4/ubiq-security.json": "Ubiqは開発者のために暗号化を簡素化します。暗号化は正しく行うのが難しく、間違えるのも簡単です。だからこそ私たちはUbiqを作りました。Ubiqは完全にAPIベースのSaaSプラットフォームで、開発者は数行のコードと2回のAPIコールでアプリケーションに直接暗号化を組み込むことができます。",
  "data/ph-top/2021/4/prox.json": "プロックスは、ベストセラー作家、TEDxスピーカー、ビジネスアドバイザー、インフルエンサー、コンテンツクリエーターなどのトップエキスパートを厳選したネットワークです。関連する成功を証明している人々から、個別のアドバイス、本当の洞察、タイムリーな回答を得ることができます。",
  "data/ph-top/2021/4/jira-work-management.json": "Jira Work Managementは、ビジネスチームがJiraのパワーにアクセスするための新しいフレンドリーで直感的な方法であり、現代的なスタイルのコラボレーションのために構築された新機能を備えています。",
  "data/ph-top/2021/4/make-rs.json": "ここは、メーカーが自分の作ったものを世界に向けて発信する場所です。会社で働いていたことではなく、何をしてきたかを紹介する、これまでとは違ったタイプのプロフィールページです。",
  "data/ph-top/2021/4/ping-15.json": "Pingを使えば、チーム内で自発的にオーディオチャットを行うことができます。その場限りのミーティングでも、スケジュールを組んだり、Zoomリンクをコピーペーストする必要はありません。チームメイトがPingでライブしているのを見ましたか？チームメイトのアイコンをクリックするだけで、すぐに会話ができます。今なら無料でご利用いただけます。",
  "data/ph-top/2021/4/skotty.json": "Skottyは、スマートなモジュール式のブロックを使って、クライアントとのコミュニケーションを強化します。ブロックには、ファイルやメッセージ、ファイル要求、署名、ビデオ通話などが含まれます。ワークフローに合わせてブロックを組み合わせたり、並べ替えたりして、誰にでも送ることができます。",
  "data/ph-top/2021/4/iconic-6.json": "Iconicは、ピクセルパーフェクトなアイコンを集めた無料のコレクションで、増え続けています。毎週、新しいアイコンが追加されています。150個のアイコンがあります（.svg,png,fig）。お楽しみください。",
  "data/ph-top/2021/4/cohort-based-courses-by-pathwright.json": "オンライン学習者をCohortsに招待して、一緒に学びましょう。なぜなら、最高の学習は、アイデアを交換し、質問をし、同じ道を歩む人々と交流するときに起こるからです。https://www.youtube.com/watch?v=4tDcdhoo0Ug",
  "data/ph-top/2021/4/royalties-calculator.json": "このツールは、あらゆるミュージシャンを検索し、Spotify、Apple Music、Amazonなどの主要なストリーミング・プラットフォームでのロイヤリティがどれくらい発生するかを概算することができます。完全に無料です。",
  "data/ph-top/2021/4/bmoves.json": "bMovesは、フィールド活動を管理するためのジオ・ローカライゼーション・ソリューションです。現場でもオフィスでも利用できるbMovesは、すべての作業を文書化、視覚化、エクスポートすることができます。",
  "data/ph-top/2021/4/donate-to-india-s-covid-relief.json": "第二次世界大戦中のインドを支援するために寄付をすると、お返しにインドの優秀な製品開発者たちと一緒に過ごせます。",
  "data/ph-top/2021/4/codejudge.json": "Codejudgeは、自動化された現実世界の評価を通じて、企業が技術チームをより早く、より賢く、より良く構築することを支援します。私たちの実社会でのタスクは、127以上のスキルデータポイントを数秒で取得し、推測ではなくデータに基づいて技術チームを構築することを保証します。",
  "data/ph-top/2021/4/yespromo.json": "Redditをあなたのビジネスに活用する方法を学びましょう。30以上のサブレディットで成功した100以上のセルフプロモーションの投稿を無料で集めました。",
  "data/ph-top/2021/4/venture-capital-interview-trainer.json": "ベンチャーキャピタルに入りたいけど、面接のプロセスがどうなるかわからない？私たちは、ベンチャーキャピタルが応募プロセスで候補者に尋ねる60以上の実際の質問を集めました。",
  "data/ph-top/2021/4/channel-tools-for-slack.json": "https://www.channeltools.io、Slackのチームやチャンネルの全メンバーを別のチャンネルに一括招待することができます。また、チャンネルから全メンバーをすばやくエクスポートすることもできます。画面を消去したり、ランダムにユーザーを選んだりする便利なユーティリティーコマンドが付属しています。",
  "data/ph-top/2021/4/the-remote-meetings-handbook.json": "遠隔地での会議は、対面での会議に比べて独自のメリットがありますが、その独自のメリットを最大限に生かすためには、自分自身が新しいやり方に適応する必要があります。",
  "data/ph-top/2021/4/reach-live-2-0.json": "Reach.Live (YC W20) は、エンジニア、プロダクトマネージャー、コミュニティマネージャーが、ライブ & オンデマンドの Tech Talks & Product Demos を開催することを可能にするものです。",
  "data/ph-top/2021/4/papapal.json": "興味深い人々とメールを書くことで、外国語を学ぶことができます。🎁 フォームに記入して、プレゼントをもらう。💌 あなたの友達に会う。✍️ 書いて覚える。🗝 ここではシンプルさが重要です。アプリもない。料金もかかりません。👉 初心に戻って、新しい人と会って話し合おう。",
  "data/ph-top/2021/4/newsy.json": "今は使っていないドメインや未使用のドメインはありませんか？それを3クリックでRedditのような完全で機能的なソーシャルニュースアグリゲーターに変えてみませんか？Newsyは、あなたが必要とするすべての機能を備え、強力にこれを行うことができます。",
  "data/ph-top/2021/4/freekin.json": "地元の人のように」よりも良いものを。ツアーも、ガイドも、混雑も、スパムも、COVID-19もありません。気の合う仲間と、人里離れた、筋金入りの、ほとんど無料の場所を共有するための特別な旅行アプリです。",
  "data/ph-top/2021/4/awkward-silences-podcast.json": "Awkward Silencesへようこそ。このポッドキャストでは、インタビューをする人にインタビューをします。UXリサーチ、定性データ、そしてより良い製品やビジネスを構築するために人を理解する技術など、あらゆることについてオタク的に語っています。",
  "data/ph-top/2021/4/podroom.json": "PodRoomは、ポッドキャスターが同じ志を持つ人々とつながり、自らが運営するメディアとしての認知度を高め、最終的にはデジタル領域での広告収入のシェアを拡大するために必要なプラットフォームを提供します。",
  "data/ph-top/2021/4/instamint.json": "instamintは、クリエイターやinstagramユーザーが自分の投稿のNFTを作成できる初めてのプラットフォームです。お気に入りのinstagramのNFTを作成して共有することができるようになりました!"
}