{
  "data/ph-top/2022/8/relume-library-2-0.json": "今日、私たちはライブラリ（別名：Relumeライブラリ2.0）を発表します！このライブラリには、以下のようなものが含まれます。その内容は？- 独自のWebflowコンポーネントライブラリを作成、保存、共有できるようになりました。- 275のUntiled UI Webflowコンポーネントへのアクセス - コミュニティが作った最初のライブラリです。",
  "data/ph-top/2022/8/otherweb.json": "クリックベイト、アイキャッチ、自動再生ビデオ、ペイウォール、党派的なエコーチェンバー、その他デジタルマーケティング担当者が次に思いつくようなものはありません。",
  "data/ph-top/2022/8/yolorekt.json": "Yolorektは、ブロックチェーン上に構築された分散型の短期予測市場プラットフォームで、超ゲーム化されたソーシャル価格予測と、最もダイナミックで直感的なユーザー体験を促進しています。",
  "data/ph-top/2022/8/docusaurus-2-0.json": "https://docusaurus.io/、一流のドキュメントサイトをあっという間に完成させることができます！ &nbsp; コンテンツに集中しましょう： Markdownファイルを書くだけです！ 5分でサイトを公開しましょう。プラグイン、テーマ、検索、ブログ、バージョニング、国際化、React...など、充実の機能。",
  "data/ph-top/2022/8/uchat.json": "UChatは、コーディングなしで16以上のソーシャルチャネルでビジネスを自動化するチャットボットビルダーです! オムニチャネル＋統一受信トレイ＆チケットシステム 👉 A.I Powered conversation 🔌 Built-in Ecommerce 👉 Mobile app for live chat 👉 Start free trial Now!",
  "data/ph-top/2022/8/polymath-robotics.json": "Python（ROSではない）を使って、シミュレーションで産業車両の自律行動を設計する。シミュレーションで設計したものは、同じコードを使って物理的な車両で実行することができます。",
  "data/ph-top/2022/8/keyviz.json": "Keyvizは、あなたの⌨️キーストロークをリアルタイムに視覚化するフリー＆オープンソースソフトウェアです！(*^_^*) スクリーンキャスト、プレゼンテーション、コラボレーション、またはいつでも必要なときに押している便利なショートカット/キーを聴衆に知らせましょう。",
  "data/ph-top/2022/8/storebuddy.json": "インスタグラムのアカウント/ショップを、注文を受けることができる完全な機能のEコマースサイトに変換します。登録 👉 インスタグラムアカウントの接続 👉 完了、ECストアを起動 ストアはカスタマイズ可能で、カスタムドメインと接続することができます。",
  "data/ph-top/2022/8/vibesition.json": "Vibesitionは、Spotifyを使って、ある曲のヴァイブから別の曲のヴァイブに遷移するプレイリストを作成することができます。",
  "data/ph-top/2022/8/maybuy-by-up.json": "メイビュウの紹介です。オーストラリアの若者が実際に持っているお金で、実際に好きなものを買えるようにするために作られたUpアプリの機能です。衝動買いとはおさらばです。",
  "data/ph-top/2022/8/remotebase-2.json": "スタートアップとトップ1%のソフトウェアエンジニアの人材をマッチングするマーケットプレイス。Remotebaseのソフトウェアエンジニアは、徹底的な審査を経て、月額固定費ですぐに採用することが可能です。エンジニアは24時間以内に企業とマッチングされます。",
  "data/ph-top/2022/8/threado.json": "Theado のご紹介 - エンゲージメントメトリクスの測定にとどまらない、パワフルで実用的なダッシュボードです。インサイトの取得、ワークフローの自動化、Slack、Discord、その他のプラットフォームでのメンバーの活性化が可能です。あなたの中の 10 倍のコミュニティ・ビルダーを解き放ちましょう。無料でお試しください。",
  "data/ph-top/2022/8/100ms-live-stream-sdk.json": "製品に双方向のインタラクティブなライブストリームを簡単に追加できます。どのブラウザやアプリからでもライブ配信ができ、ストリーマーや視聴者を共同ホストとして招待できます。プリビルド・アプリですぐに始められ、あなたのアプリでカスタム・ライブ体験を作成できます。",
  "data/ph-top/2022/8/backspace.json": "Backspace は、クリエイターのためのオンラインコミュニティをシンプルにします。Backspace は、コミュニティの構築、収益化、運営の過程で従来使用されてきた膨大な数のプラットフォームやツールを置き換えることで、これらすべてを一箇所でネイティブに行うことを可能にします。",
  "data/ph-top/2022/8/upon.json": "ユーザーの注意を一瞬で引きつける必要があります。💛 UpOnを使えば、どんなウェブサイトでもオンボーディングをすばやくデザインし、統合することができます 既製のテンプレートにより、ユーザーリテンションと効果的なエンゲージメントを向上させます。",
  "data/ph-top/2022/8/light-users-by-help-scout.json": "ライトユーザーの導入：ヘルプスカウトの新しいユーザーロールで、権限を制限し、ユーザー単価を抑えたものです。ライトユーザーとは、ヘルプスカウトの新しいユーザーロールです。",
  "data/ph-top/2022/8/daybridge-public-beta.json": "人生には、会議よりも大切なことがある。だから、私たちはこれまでとは違うものをつくろうとしています。私たちは、あなたが仕事を切り上げたり、素敵な旅行を計画したり、約束事を記録したりするのをお手伝いします。グループチャットを始めるように、友だちとの時間を簡単に見つけられるようにしたいのです。",
  "data/ph-top/2022/8/guide-for-project-managers.json": "プロジェクト管理には様々な方法があります。そんなあなたのために、Notionでは便利なリソースをすべて集めました。何百もの厳選されたリソースが一か所に集まっています しかも無料です。",
  "data/ph-top/2022/8/ballpark-research-template-library.json": "UXリサーチ、調査、Figmaプロトタイプなど、30以上のテンプレートにワンクリックでアクセスできます。デザインからコピー、デザインシステムの部品に至るまで、あらゆるものをテストできます。編集、リミックス、独自のブランディングやビデオの説明を追加して、自分だけのものを作ることができます。",
  "data/ph-top/2022/8/imgs.json": "アルゴリズム、ランキング、広告、人が踊るクレイジーなビデオ...。imgsは、お気に入りの写真を共有し、発見し、収集するためのオンラインプラットフォームです。",
  "data/ph-top/2022/8/queue-2d79f3b4-ec26-406b-9d5c-21a5c8a4e6ad.json": "🔥 Queueから新登場! 🔥 スタートアップのために吟味されたフリーランスデザイナーを雇うためのマーケットプレイスです。UI/UX、プロダクト、モーションデザイナーの専門家を雇うことができます。すべてのデザイナーは、ユーザーエクスペリエンス、デザイン、スタートアップとの経験の専門知識を徹底的に審査されます。",
  "data/ph-top/2022/8/browserku.json": "Webスクレイピング、スクリーンショット、PDF生成は、シンプルなHTTPリクエストと同じくらい簡単で、メンテナンスコストもかからないはずです。Browserkuは、これを誰にでも可能にします。",
  "data/ph-top/2022/8/article-rewriter.json": "AISEOのArticle rewriterは、コンテンツの意味を保ちながらリライトすることをシンプルにサポートします。GPT-3をはじめとするAIエンジンを使って、圧倒的なスピードでこれを実現します。",
  "data/ph-top/2022/8/sms-marketing-templates-text-editor.json": "SMSマーケティングは、eコマースで最も急速に普及しているトレンドです。このツールは、SMSマーケティングがいかにシンプルであるかを教えてくれるでしょう。テンプレートをクリックすると、クリップボードにコピーされます。テキストエディターでテンプレートをカスタマイズします。SMSの連絡先に表示される内容を正確にプレビューします。",
  "data/ph-top/2022/8/link-6.json": "LINKは、次世代のためのモバイルソーシャルアプリです。友達を招待してグループプロフィールを作ったり、自分の興味に合った人と出会ったり、近くの限定イベントを見つけたりできます。今すぐダウンロードして、10,000人以上のユーザーの仲間入りをしてください。",
  "data/ph-top/2022/8/500-pro-pitch-decks-by-slidddo.json": "ゼロからプレゼンテーションを作成する？500枚以上のピッチデッキスライドが用意されているライブラリを見てみましょう。最適なスライドを探し、目立つプレゼンテーションを素早く簡単に作成できます。",
  "data/ph-top/2022/8/shuffles-by-pinterest.json": "シャッフルズは、創造的な遊びと集団的なコラージュのための新しいアプリです。画像からオブジェクトを切り取り、コラージュを作成し、アニメーションやエフェクトで命を吹き込みます。",
  "data/ph-top/2022/8/casama.json": "Casamaは、ブラウザの拡張機能や複雑な設定なしに、数分でグループとして資金調達と執行が可能な暗号の取引ポジションを作成することができます。そのため、取引アイデアを友人と共有し、うまくいけば管理手数料を得ることができます。",
  "data/ph-top/2022/8/openbb-bot.json": "OpenBB Botは、高品質なマーケットデータ（例：「SBI-Market」）へのアクセスを簡素化することで、投資リサーチコミュニティをひとつにまとめています。",
  "data/ph-top/2022/8/b2b-customer-journeys-by-hockeystack.json": "HockeyStackは、各アカウントのすべてのステークホルダーから、チャネルを超えたマーケティングとセールスのすべてのタッチポイントを1つのジャーニーに集約しています。5分のセットアップで、あるアカウントの過去のタッチポイントをすべて確認し、そのジャーニーを理解することができます。",
  "data/ph-top/2022/8/craftwork-5.json": "Craftworkマーケットプレイスの新バージョンをご紹介します。世界中の作家が作成したインターフェースアセット、UX/UIキット、イラスト、テンプレートのデジタルストアです。デザイナー、スタートアップ、ブランドにとって、より速くデザインするための大きな助けとなることでしょう。",
  "data/ph-top/2022/8/defi-101-by-brew-money.json": "究極の分散型金融ガイドを作成しました。DeFi101は、全くの初心者のためのDeFiの入門書です。私たちは、業界で最も影響力のある人々と協力し、すべてのコンセプトを分かりやすく解説しています。",
  "data/ph-top/2022/8/superblog-2.json": "Superblogは、WordPressやMediumブログに代わる、圧倒的な速さのブログです。ブログはSEO、コンバージョン、スピードのために自動で最適化されるので、あなたはコンテンツを書くことに集中できます。最大の特徴は？Superblogに \"yourwebsite.com/blog \"を接続することができます。Superblogのブランドはありません。",
  "data/ph-top/2022/8/affiliate-corner.json": "アフィリエイト・コーナーは、最高のアフィリエイト・プログラムを見つけ、ニッチな洞察を数分で解き明かすことができる、あなた専用のリサーチ・ソリューションです。アフィリエイト・マーケティングの研究に費やす時間を100時間、1000ドル節約することができます。SEOの洞察、プロモーション戦略、その他の情報を提供します。",
  "data/ph-top/2022/8/sitekick-ai.json": "Sitekickは、AIランディングページビルダーです。コーディングやデザイン、コピーライティングのスキルを必要とせず、美しいランディングページを作成することができます。",
  "data/ph-top/2022/8/along.json": "動画は、たとえインターネット上であっても、フィルムの黎明期からあまり変わっていません。どのプラットフォームも、いまだに1つの静的なファイルしかアップロードできません。そこで私たちは、インターネットのためのより良いビデオ・プラットフォームを構築することに着手し、それを「Along」と名付けました。現在、iOSで利用可能です。",
  "data/ph-top/2022/8/spinach-io-2-0.json": "Spinach.ioは、より速く、より集中的なデイリースタンドアップの実行を支援します。よりシャープなアップデートを得る。デイリースタンドアップサマリーで全員に情報を提供します。そして、毎日、時間を取り戻しましょう。1チームにつき永久無料です。http://spinach.io で今すぐお試しください。",
  "data/ph-top/2022/8/trickle-3.json": "Trickleは、あなたのチームがコラボレーション、コミュニケーション、ハングアウトできる統一されたワークスペースです。ニュースフィード、埋め込み、ライブスレッド、リアクションにより、誰もが自分のアイデアを発言し、楽しく仕事をすることができます。",
  "data/ph-top/2022/8/lalal-ai-voice-cleaner.json": "LALAL.AI Voice Cleanerは、音声ファイルや動画ファイルから不要な音を除去するAI搭載のノイズキャンセリングオンラインサービスです。最先端の技術で、すべてのノイズとBGMをすばやく除去し、クリアな音声だけを残します。",
  "data/ph-top/2022/8/notion-social-media-kit.json": "ソーシャルメディアチャンネルを計画し、成長させる最も簡単な方法です。このNotion Social Media Kitの中には、ソーシャルメディアアカウントを成長させるために必要なものがすべて入っています。",
  "data/ph-top/2022/8/datamin-2.json": "Dataminは、ビジネスプロセスで生成されるデータに焦点を当てた、データモニタリングとタスク実行のソリューションです。業務に携わるお客様（Payments, Scoring, Revenue, Riskなど）が、データから期待値を設定し、その状況に応じてタスクを実行することを可能にします。",
  "data/ph-top/2022/8/feeeed.json": "私たちは1日に何時間も、私たちの注意を収益化するためにプログラムされたフィードをスクロールして過ごしています。その代わりに、自分自身のフィードを構築しましょう 出版物、ニュースレター、ウェブウィジェット、その他多くのソースを購読してください。広告なし、完全にデバイス上です。あなた自身の条件でスクロールしてください。）",
  "data/ph-top/2022/8/ask-a-doula-by-ruth-health.json": "あなたやあなたのパートナーは、妊娠中または産後5年までですか？質問や好奇心をお持ちですか？ルースヘルスのAsk A Doulaは、どんな質問でも、バースプランでも、授乳のサポートでも、その他のニーズでも、専任のドゥーラに無料でテキストメッセージで無制限にアクセスすることができます。",
  "data/ph-top/2022/8/valt-2.json": "VALTは、一般投資家向けに、オルタナティブ資産に特化した分散型ポートフォリオを提供する初の投資アプリです。Indiegogoの共同設立者と、最大の代替資産検索エンジンであるVincentによって提供されています。",
  "data/ph-top/2022/8/klasshour.json": "Klasshourは、課題、コースワーク、プロジェクトなど、学業上の問題を即座に解決してくれるチューターと学生をつなぐ役割を担っています。すべてリアルタイムで。",
  "data/ph-top/2022/8/hacker-news-slack-bot.json": "Hacker Newsであなたの会社・製品が紹介されたら、Slackで通知してくれるボットです。Powered by Vercel Functions & Upstash.",
  "data/ph-top/2022/8/skybucket.json": "SkyBucketは、様々なソーシャルネットワークやソースからのブックマークを、フォルダを作成し、説明を追加し、フィルタや検索バーを使って組み合わせ、管理するためのオールインワンコンセプトプラットフォームを提供します。デスクトップとモバイルで利用可能です。",
  "data/ph-top/2022/8/highlight-6.json": "Highlightは、お客様の問題を理解し、デバッグすることを容易にします。セッション再生、エラースタックのトレース、ユーザーコンソールの可視化により、Highlightはデバッグの謎を解き明かします。",
  "data/ph-top/2022/8/open-source-saml-sso-by-boxyhq.json": "SAML Jacksonを使えば、1週間以内に導入できるSAMLへの素直な統合を構築するだけです これは、SAMLログイン・フローをOAuth 2.0またはOpenID Connectフローとして実装し、SAMLプロトコルの複雑さをすべて取り除くことによって実現されています。",
  "data/ph-top/2022/8/sprig-concept-usability-testing.json": "Sprigのブラウザベースの非モデレートテストでは、あなたのアイデア、コンセプト、プロトタイプがユーザーに受け入れられるかどうかを、コードを一行も書く前に簡単に知ることができます。そのため、より成功しやすいユーザー中心の製品を構築することができます。",
  "data/ph-top/2022/8/galas-for-podcasters.json": "Galasは、異なるアプリのリスナーを結び付け、忠実なコミュニティにするサービスです： 🔥 あなたのPodcastを育てる 🔥 多くのフィードバックを得る 🔥 GoogleやApple Podcastsリスナーが出会い、コミュニケーションすることができます。",
  "data/ph-top/2022/8/marketing-examples-by-swipewell.json": "ヴィンテージ広告からSaaSの価格ページ、ブラックフライデーのEメールまで、あらゆるものを収録した無料のスワイプファイルです。200以上のカテゴリ、6,000以上のアセットがあり、現在も増え続けています。",
  "data/ph-top/2022/8/best-saas-hero-designs-for-inspiration.json": "SaaSランディングページのヒーロー画像デザイン240点以上をご紹介します。ヒーローセクションは、訪問者の注意を引くものです。私たちのチームが最高のヒーローセクションのリストを作成しましたので、あなた自身のヒーローセクションを考え出すことができます。",
  "data/ph-top/2022/8/insighthack.json": "企業、特許、科学、インフルエンサー、トレンド、ケーススタディ、ユースケースなど、技術的なトピックやデータセットを検索可能なデータベース。登録ユーザーは無制限に利用可能 無料",
  "data/ph-top/2022/8/code-insights.json": "などの疑問にお答えします。最も多くコードを書くのは何曜日か、1日の平均コード時間はどのくらいか、などの質問にお答えします。WakaTimeのプログラミング活動から得られた知見を自動的にコンパイルします。",
  "data/ph-top/2022/8/codeshield.json": "CodeShieldは、AWSのIAM権限を保護するのに役立ちます。これは、過剰な特権を持つIAM権限と特権の昇格を識別します。発見されたすべてのエスカレーション、危険にさらされているリソース、および推奨される修正について、ステップバイステップの悪用ウォークスルーを得ることができます。",
  "data/ph-top/2022/8/notion-starter-pack-4.json": "Notionの仕組みを理解することを目的とした、より生産的で整理された6つのテンプレートのエントリーレベルのコレクションです。テーブル、ソート、フィルタ機能を正しく設定し、ワークスペースがあなたのために働くようにする方法を学びます。",
  "data/ph-top/2022/8/noox-world-2.json": "Noox.worldは、ユーザーがSoulbound NFTとしてWeb3の成果を作成し、証明し、ミントすることができるプラットフォームです。Nooxのビジョンは、プロトコルが純粋にインセンティブに依存せず、強固なコミュニティを構築することを可能にするコミュニティプリミティブを構築することです。",
  "data/ph-top/2022/8/aworker-2.json": "Coinbase、OpenSea、Polygonなど、Web3領域で活躍する企業への就職を支援するサイトです。web3企業で仕事を探しながら、トークンを入手することができます。",
  "data/ph-top/2022/8/momo-3.json": "momoは、どのクレジットカードが一番得なのかを探すお手伝いをするモバイルアプリです。私たちのユーザーは、平均750ドルの追加リワードを獲得しています。",
  "data/ph-top/2022/8/knows.json": "Knowsは世界初のモジュラーシステムを採用したアイウエアです。部品サイズをカスタマイズでき、完璧なフィット感を実現します。もう挟んだり滑ったりすることはありません。あなただけの顔とスタイルにフィットする快適なフレームです。プロダクトハンターのために20％オフで出荷中です。",
  "data/ph-top/2022/8/dun-dun-dunning.json": "オンラインビジネスに携わっている方なら、不本意な解約（支払いに失敗したために顧客が離れていくこと）が嫌なものであることはおわかりでしょう。そこで、この問題の一歩先を行くスーパーアウルがいるとしたらどうでしょう？",
  "data/ph-top/2022/8/170-freelancer-tools.json": "成功したフリーランサーがセクターを超えて使用している最も必要な170以上のツールのカタログです。Notionのドキュメントは、定期的に新しいツールやリソースで更新されます。",
  "data/ph-top/2022/8/radar-by-meshed-labs.json": "Radarは、Web3資産を保護するブラウザ拡張機能です。特徴 🚨レポート -&nbsp; あなたの保留中の取引のリスクスコアを取得します。🖼 - あなたの資産がどのように変化するかを確認します。 🔎 - あなたが信頼するサイトやdAppにいることを知ることができます。",
  "data/ph-top/2022/8/datapad-2-0.json": "Datapadを使えば、すべての指標とKPIをポケットの中に入れておくことができます。チームでのKPIトラッキングが、かつてないほど迅速かつ容易になりました。どこにいても、ビジネスのトップに立ち続けることができます🏝。"
}