{
  "data/ph-top/2022/7/avid-fm.json": "教えたいけど、動画講座を作るのが面倒くさい？AVIDのクリエイターは、すべて音声で行い、制作前にクラウドファンディングでアイデアを検証しています。さらに、学習者は最大16倍の成果を得ることができます。",
  "data/ph-top/2022/7/cleanmymac-x-menu-app.json": "5つの詳細なヘルスモニターの助けを借りて、あなたのMacの寿命を延ばすことを目的とした、まったく新しいCleanMyMac Xメニューアプリを紹介します。あなたのMacのストレージ、保護状態、CPUパフォーマンス、RAM、バッテリーに関する情報を即座に得ることができます。",
  "data/ph-top/2022/7/superflow.json": "私たちは、スタイル付きWebflowコンポーネントの最大のライブラリーを構築しています。テンプレートを複製する必要はなく、コンポーネントをコピーしてプロジェクトに貼り付け、あなたのブランディングを適用するためにカスタマイズすることができます。",
  "data/ph-top/2022/7/thanks-app-for-slack.json": "Slackのために作られたThanksは、チームやコミュニティの仲間に感謝するためのレコグニションアプリです。感謝の文化を築き、お互いに助け合うインセンティブを与えましょう。Thanksを使えば、同僚やコミュニティーのメンバーに感謝の気持ちを伝えるのを忘れることはありません。",
  "data/ph-top/2022/7/kleanmail-free-email-verifier.json": "AIを活用したクラウド型メール検証ツール「KleanMail」は、コストを大幅に削減し、メールの到達率を高めながら、良好なIP＆ドメインレピュテーションを維持することを可能にします。",
  "data/ph-top/2022/7/flywheel-2.json": "FlyWheelは、コミュニティ管理者の生活を楽にするSlack Superbotです。コミュニティメンバーに関するインテリジェントな分析を提供し、日常的なタスクを自動化することができます。また、ダッシュボードから直接すべてのクエリに応答することができます。",
  "data/ph-top/2022/7/internxt-send.json": "Internxt Sendは、オンライン上で安全にファイル共有ができる暗号化ファイル共有サービスです。匿名で誰にでも無料で大容量ファイルを送ることができます。Internxt Send はプライバシー会社 Internxt のプロダクトです。",
  "data/ph-top/2022/7/flashlist-for-react-native.json": "RNではリストが面倒です。また、空白のセルが好きな人はいないでしょう。今日、FlashListは以下を提供します。- UI スレッドで最大 5X FPS - JS スレッドで最大 10X FPS - 簡単なマイグレーション すでにいくつかのアプリに搭載されており、皆さんに試していただけるのを楽しみにしています。",
  "data/ph-top/2022/7/jd-generator.json": "無味乾燥なJDをパワフルなJeDisに変える！？AIアルゴリズムにより高品質の職務経歴書を生成し、企業が職務に適したスキルを見極め、優秀な人材を引きつけることを支援します。プロフェッショナルなJDを無料で作成することで、あなたの時間を最大90%節約できます。",
  "data/ph-top/2022/7/google-password-manager.json": "個人情報を安全に管理するためには、強力でユニークなパスワードが重要です。Google パスワード マネージャーは、パソコンや携帯電話（ウェブ上の Chrome、お気に入りの Android や iOS アプリ）で、パスワードの作成、記憶、自動入力を支援します。",
  "data/ph-top/2022/7/signaturepro.json": "SignatureProで美しくサインする方法をご紹介します。あなたのために素晴らしいサインを作るお手伝いをします！字が下手でも30分で書けるようになる方法をお教えします。",
  "data/ph-top/2022/7/podnotes-io.json": "このツールは、人工知能を使って、魅力的なショーノート、ブログ記事、エピソードタイトル、ソーシャルキャプション、トランスクリプションを作成することができます。このツールは、ローカルファイル、記述リンク、または単にポッドキャストを検索することによって、コンテンツを迅速に作成することができます。",
  "data/ph-top/2022/7/everyone-draw.json": "世界中の人々がピクセルアートを共同制作するための無限のキャンバス。16色、無限の可能性。",
  "data/ph-top/2022/7/bravo-2.json": "BRAVOは、従業員が毎日感謝の気持ちとモチベーションを感じられるようにする、真にパーソナライズされた表彰・報奨システムです。BRAVOの詳細な分析とレポート機能により、誰がより多く勝っているのか、次のプロジェクトで輝くために少し後押しが必要なのは誰なのかを知ることができます。",
  "data/ph-top/2022/7/notific-2.json": "Notificは、暗号ウォレット（Ethereumとpolygon）のためのマルチチェーン、マルチプラットフォーム通知サービスです。ユーザーはWhatsAppやTelegram上でウォレットのアクティビティをリアルタイムで取得することができます。",
  "data/ph-top/2022/7/60-pretty-random-illustrations.json": "動物、植物、食品、交通、フィクション、アイソメトリックなど、さまざまな分野の詳細なイラストを検索して、次のプロジェクトに役立てることができます。ビデオ、デッキ、ブランディング、レターヘッド、モーショングラフィックスなど、様々な用途でご利用いただけます。",
  "data/ph-top/2022/7/sales-os.json": "顧客、注文、製品のすべてをデジタルワークスペースに一元化する、キックアスで美しい販売管理システムです。",
  "data/ph-top/2022/7/batchable.json": "Batchableは、大規模な人間の作業を5クリックで実行することができます。数百人のグローバルワーカーを指揮する最適な方法です： ✅ 複雑なデータ入力 ✅ 電話（テレフォンツリー、ダイヤラー、IVRなど） ✅ PDF、CSV、文書からのデータ抽出",
  "data/ph-top/2022/7/terminal-gif-maker.json": "Terminal Gif Makerは、ターミナルインターフェースでコードサンプルを作成するためのツールです。プロジェクトのGIFを作成することができ、それをプロジェクトのREADMEに表示することができます。GithubやGitlabのようなgitプロバイダでGIFを使用することができます。",
  "data/ph-top/2022/7/journey-6.json": "Journeyは、3分間のシンプルな朝の習慣を通して、あなたの個人的な目標の達成を支援します。この習慣は、あらゆるスケジュールに適合し、あなたの毎日をより意図的に、より生産的に、よりコントロールしやすくします。",
  "data/ph-top/2022/7/gameflip-2.json": "Gameflipは、6M以上のゲーマーがデジタルアイテムを売買できるマーケットプレイスです。私たちは、新興のブロックチェーン技術における開発者、パブリッシャー、ゲーマー間のギャップを埋め、Gameflipをブロックチェーンベースのゲームを誰もがアクセスできるようにするための位置づけとしています。",
  "data/ph-top/2022/7/explaining-ukraine-podcast.json": "インターニュースウクライナが運営するウクライナに関するマルチメディアプロジェクトUkraineWorld.orgが制作するポッドキャストです。\"Explaining Ukraine \"は文字通り、ウクライナで起きている政治、社会、文化などの重要な出来事をすべて共通語で解説しています。",
  "data/ph-top/2022/7/shiftx.json": "ドラッグ＆ドロップで簡単に操作できる、データ連携型のプロセス可視化ツールです。組織内のすべての人が、プロセス、ワークフロー、カスタマージャーニーをすばやくマップし、理解できるようにします。ダウンロード不要で、お好みのブラウザで使用できます。",
  "data/ph-top/2022/7/zamgeldi-me.json": "zamgeldi.meは、トルコの製品の値上げに関するニュースを集めています。",
  "data/ph-top/2022/7/how-to-professionally-say.json": "同僚に言いたいけど、もっとプロフェッショナルに聞こえるようにしたい、そんな常套句のためのシンプルな静的ウェブサイトです。",
  "data/ph-top/2022/7/auto-subtitle-generator-by-media-io.json": "最大98％の精度でワンクリック自動字幕、多言語対応で大幅効率化!",
  "data/ph-top/2022/7/keytunity.json": "Keytunityは、Google Search Consoleのデータと、お客様のWebサイトのクロールを収集し、新しい、独自のキーワードを提案します。これらの提案には、新しい記事のアイデアやコンテンツの追加トピックが含まれ、トラフィックとサイトを成長させるように設計されています。",
  "data/ph-top/2022/7/ruttl-2.json": "ruttlは、生きているWebサイトに直接コメントを残したり、リアルタイムにCSSの編集を行うことができるWebサイトフィードバックツールで、的確なデザインフィードバックをチームで共有することができます。https://www.youtube.com/watch?v=vkx366sknD4&t=65s&ab_channel=Ruttl こちらをチェック",
  "data/ph-top/2022/7/laserfocus.json": "Laserfocusはセールスプロセスを可能な限りシンプルに、しかしシンプルにならないようにします。お客様が注力すべきことを示し、すべてがSalesforceに集約されるようにします。",
  "data/ph-top/2022/7/schnapps-3.json": "Solana上での分散型予測ゲーム。SOLの価格が上がるか下がるかを予想し、正解するとそのラウンドの賞金プールの分け前を獲得することができます。シュナップスをプレイすることで、あなたの先見性を試し、報酬を得ることができます。",
  "data/ph-top/2022/7/krock-io.json": "Krock.ioは、クリエイティブエージェンシー、ビデオ制作チーム、フリーランスのプロフェッショナルのためのコンテンツレビューとプロジェクト管理プラットフォームです。不明確な修正や長いメールのやり取りは忘れてください。レビューと承認のための機能で、クリエイティビティに集中することができます。",
  "data/ph-top/2022/7/rektmeter-by-wall.json": "Ethereum上の任意のNFT Walletの統計情報をチェックアウトするための楽しいツールです。ポートフォリオの価値、ATH、利益、ベスト＆ワーストパフォーマンスのNFTs、ハイライトフリップ、取引統計など。あなたのdegen frens Walletがどのようにされているかを見てみましょう!",
  "data/ph-top/2022/7/hagrid-2-0.json": "あなたは、自分のウェブサイトに人を集めるために一生懸命に働いています。そして、彼らは彼らが聞きたいことがたくさんある！hagridは、訪問者が質問をすることができ、あなたが応答するソーシャルQnAウィジェットです：信頼を追加し、あなたの聴衆と接続することができますインタラクティブなFAQ。",
  "data/ph-top/2022/7/arctaurus-2.json": "暗号通貨取引用のカスタムオートメーションを構築する。価格がテクニカル指標を突破したら、すぐに取引したいですか？簡単です。完全なカスタムマーケットメイキング戦略や、コインを全て売却するキルスイッチを構築したいですか？コーディング不要ですべて可能です。",
  "data/ph-top/2022/7/readapt.json": "ディスレクシアや視力低下など、読むことに困難がある人のために設計されています。Readaptを使えば、読書の好みをカスタマイズし、ウェブサイトやWord文書上のテキスト（英語またはフランス語）を読みやすさや好みに合わせて調整することができます。",
  "data/ph-top/2022/7/online-video-editor-by-media-io.json": "Media.ioエディターのインターフェイスは超明確で使いやすい。テンプレートやBGMも豊富で、字幕の自動生成機能も100％無料で使えます！（※）。Instagramのストーリーに合わせた編集も無料でできますよ〜。",
  "data/ph-top/2022/7/noysi-enterprise.json": "ノイジーエンタープライズは、あなたのビジネスやコミュニティの成長の味方です。Noysiは、あなたのビジネスやコミュニティのコミュニケーション・ハブとして、CNAMEを使って独自ドメインでカスタマイズできます。",
  "data/ph-top/2022/7/marvelorder.json": "過去と今後のマーベル映画とシリーズを、公開順、年代順、Official Disney+ In-Unverse Timeline順などで把握できます。",
  "data/ph-top/2022/7/outverse.json": "Outverseは、フォーラム、Notionスタイルのカスタムスペース、ビデオなどを組み合わせ、インターネットコミュニティの体験を再構築しています。",
  "data/ph-top/2022/7/screenleap-for-websites.json": "コードスニペットをサイトに追加して設定すると、Google Meetのような機能（画面共有、ライブビデオ、オーディオ、チャット）を使って、ウェブサイトから直接ユーザーと対話することができるようになります。",
  "data/ph-top/2022/7/plezi-one.json": "B2Bインバウンドマーケティング戦略を立ち上げ、展開するための圧倒的なマーケッターのための完璧なツールキット： 📈 獲得とSEOダッシュボード 🎣 フォームとリードマグネットによるコンバージョンアップ 💌 メールキャンペーンによるエンゲージメントの自動化",
  "data/ph-top/2022/7/uiscore-digital-marketplace-2-0.json": "デザイナー、エージェンシー、デベロッパーのためのスタジオ品質のデザインリソースを集めたライブラリーが増えている、厳選されたデジタルマーケットプレイス。",
  "data/ph-top/2022/7/plg-goal-templates.json": "PLG Goal templatesは、Slack、Sentry、Airtable Zoomなど、製品主導型のトップ企業で使用されている、既製のビジネス指標テンプレートです。チーム横断的に企業のステージに応じた適切なPLGゴールを設定することができます。",
  "data/ph-top/2022/7/neopop.json": "地域社会のために、地域社会とともに発展していくことが、私たちCREDの原動力です。NeoPOPを立ち上げたとき、私たちは開発者コミュニティのためにオープンソースにすることを計画しました。なぜなら、アートはみんなのものだからです。今日、私たちはNeoPOP UIフレームワークをWeb、Android、iOS、Flutter向けにオープンソース化しました。",
  "data/ph-top/2022/7/notion-sql-learning.json": "SQLの学習時間を短縮し、短期間で習得する方法をお探しですか？Notion SQL Learningは、SQLの学習を素早く開始できるように、シンプルでわかりやすい設計になっています。",
  "data/ph-top/2022/7/tauri-2.json": "Tauriは、すべての主要なデスクトップ・プラットフォーム用の小型で超高速なバイナリを構築するためのフレームワークです。開発者は、HTML、JS、CSSにコンパイル可能なあらゆるフロントエンドフレームワークを統合して、ユーザーインターフェースを構築することができます。",
  "data/ph-top/2022/7/swiftreply-2.json": "顧客からのメールや質問は繰り返され、同じ返事を書くのは時間がかかり、大変です ✅ SwiftReplyは、チーム全体の生産性を高め、顧客との対話を改善し、一貫した定型応答を書き、整理するためのオールインワンソリューションです。",
  "data/ph-top/2022/7/loops-cereal.json": "メールスタートアップと同じように、私たちもスワッグを愛用しています。でも、Tシャツやマグカップ、ステッカーでは、ベッドから起きる価値がありません。私たちは、何か活気のあるものを求めていました。ちょっと歯ごたえのあるものが。一日の始まりに、限定版のLOOPSをどうぞ。",
  "data/ph-top/2022/7/dropbase-2-0.json": "Dropbaseは、複雑で面倒なCSVやExcelファイルから、自動カラムマッピング、エラーハイライト、データ検証/クリーニングなどの機能を備えたSQLデータベースへのデータインポートを支援します。データベースのセットアップとホスティングが含まれており、技術的なサポートは必要ありません。",
  "data/ph-top/2022/7/just-launch-it.json": "自分が作っているものに誇りを持つこと。私たちの簡単な変更履歴を使って、あなたの製品が常に改善されていることを顧客に示しましょう。最新の製品変更、新機能、バグフィックスなどをお知らせください。起動するだけで、あとは私たちにお任せください。",
  "data/ph-top/2022/7/mockoops.json": "Mockoopsは、録画した画面をドラッグドロップしてテンプレートを選択するだけで、ビデオアニメーションを作成することができます。退屈なスクリーンキャストを感動的なアニメーションに変換して、お気に入りのソーシャルメディアにアップロードしましょう!",
  "data/ph-top/2022/7/and-notes.json": "And notes - & - は、シンプルなメモアプリのパワーにスマートさを加え、メモを取ることに集中し、その洞察を楽しむことができます。",
  "data/ph-top/2022/7/via-protocol.json": "Via Protocolは、53のDEX、15のブリッジ、5つのプロバイダーを使用し、13のСhainで高速かつ効率的でシームレスなスワップ体験を実現するために設計されたクロスチェーン流動性アグリゲーション・プロトコルです。Viaは、暗号の世界におけるVisaとMastercardのようなものと考えることができます。",
  "data/ph-top/2022/7/no-language-left-behind-by-meta.json": "FAIR（Facebook AI Research）は、現在200の異なる言語間の翻訳を行う最先端のAIモデルを構築し、オープンソース化しました。そのコードとモデルは、本日、Fairseqパッケージの一部として公開されています。",
  "data/ph-top/2022/7/free-invoice-generator-7b9d1cd6-eac9-4224-81eb-e61c03b41ac3.json": "誰も取引手数料を払いたくはないのです。Zelle、CashApp、Venmoなどのマーチャントツールは、取引手数料なしで取引を行うことができますが、顧客に請求書を発行する際には、プロフェッショナルではありません。Bloomの新しいインボイスジェネレーターは、これをエレガントな新しい方法で解決します。",
  "data/ph-top/2022/7/plural-2.json": "Pluralは、管理のオーバーヘッドなしにKubernetes上でアプリケーションをセルフホスティングするためのオープンソースのDevOpsプラットフォームです。SSO、自動アップグレード、秘密の暗号化が組み込まれており、マネージドサービスのすべての利点を、ロックインやコストなしで手に入れることができます。",
  "data/ph-top/2022/7/bobby-6.json": "Googleドキュメントを自動的にバックアップし、使用可能な形式に変換してローカルに簡単にアクセスできるようにするデスクトップアプリケーションです。",
  "data/ph-top/2022/7/developer-dao-fm.json": "Developer Dao FMは、クールなものを作りながら、Lofiミュージックを聴くことができる場所です。",
  "data/ph-top/2022/7/askbelynda.json": "askBelyndaは、Amazonで買い物をするために、何千もの吟味された環境に優しい製品を備えたChrome Extensionです。企業の価値観、認証、製品の品質を評価し、確実に持続可能な企業をサポートすることを確認します。サステナブルなショッピングをシンプルに",
  "data/ph-top/2022/7/stackbricks.json": "あらかじめ構築されたスタックから始め、後からカスタマイズする。AWSとGitHubを接続するだけで、あなたのスタックは数分で稼動します。JAMstack、API、マイクロサービス、データベースなどをデプロイできます。",
  "data/ph-top/2022/7/glowbom-2-0.json": "Glowbomは、世の中で最も人気のあるプラットフォーム向けのアプリやゲームを構築するためのノーコードツールです。ゲーム、ストア、チャットボット、アンケートなど、自由に組み合わせて、あなただけのオリジナルを作りましょう。Flutter、Unity、SwiftUI、Jetpack Compose、またはWeb3としてコードを書き出すことができます。",
  "data/ph-top/2022/7/tazapay.json": "TazapayはShopify、WooCommerce、MagentoなどのプラットフォームでAPIとプラグインを介して越境チェックアウトを提供します。173以上の市場でローカルコレクション（カードとカード以外）。シームレスなオンボーディングとノーコードの支払いリンクを作成するためのオプションを備えたダッシュボード。",
  "data/ph-top/2022/7/spoke-6d11f1fa-6535-4f41-82db-37b127f75099.json": "Spokeは、新しいビデオ会議文化の子供です。Zoom、Teams、Meet、または非同期のあらゆるビデオ通話から、録音、書き起こし、ハイライト、AI要約、会議メモの最終版を作成することができます! また、ワークスペース、検索エンジン、きめ細かな共有も可能です。",
  "data/ph-top/2022/7/collectible-avatars-by-reddit.json": "Redditの最も情熱的なビジュアルアーティストたちによってデザインされた新しい限定版コレクティブルアバターは、まもなくReddit Avatar Builderで購入できるようになり、その収益はアバターをデザインしたアーティストに寄付されます。",
  "data/ph-top/2022/7/the-social-app-2.json": "エンドツーエンドで暗号化されたサブスクリプションベースのグループチャットをバニティURLで起動します。フォロワーを収益化したり、グループを「有料ニュースレター」から新しい「有料グループチャット」にアップグレードしましょう。グループチャットを作成し、価格を設定し、URLを請求し、完了です。",
  "data/ph-top/2022/7/daily-3pm-links.json": "Googleからの収益とトラフィックを増やすには、高品質のバックリンクを構築するのが一番です。インターネットのトップサイトからリンク構築の機会をキュレーションする日刊の無料メール、⏰3pm Links emailは、これを簡単に実現します。",
  "data/ph-top/2022/7/openillux.json": "Openilluxは、素晴らしいフリーイラストのコレクションをキュレーションしたリストです。",
  "data/ph-top/2022/7/hypersonic.json": "Hypersonicは、NotionでのToDoの作成、完了、ナビゲーションをこれまで以上に高速に行うことができるRaycastの拡張機能です。あなたのちょっとした思いつきやタスクが、ショートカット1つで可能になります。",
  "data/ph-top/2022/7/iconz-2.json": "200以上の手作り3Dアイコン✌この3Dアイコンの究極のパックは、UI、ソーシャルメディア、ゲーム、AR/VRなど、さまざまな用途に使用できます。一度買えば、何度でも使える。",
  "data/ph-top/2022/7/designers-lobby.json": "Designers Lobbyは、ウェブから厳選された60以上のカテゴリーからなる1200以上のデザインリソースとツールのキュレーションコレクションで、あなたの時間と無駄なウェブワンダリングを省き、効果的で整ったワークフローを作ることをサポートします。",
  "data/ph-top/2022/7/notion-for-designers.json": "Notion for Designers™は、クリエイティブなプロジェクトから混沌としたワークフローを取り除くために開発され、シームレスなワークスペースを実現するための30以上のテンプレートが用意されています。",
  "data/ph-top/2022/7/homebrew-s-50-hr-resources-for-startups.json": "何百ものアーリーステージチームと密接に連携し、人事部の構築を支援してきたHomebrewチームは、あらゆるスタートアップ企業が世界クラスの社員を採用、管理、報酬を得るために役立つ50以上の厳選されたリソースを備えたこのガイドを無料でオープンソースとして提供します。",
  "data/ph-top/2022/7/pocketbase.json": "PocketBase はオープンソースの Go バックエンドで、リアルタイムデータベース、ファイル、ユーザー管理、管理者 UI、REST-ish API を内蔵し、すべて 1 つのポータブルな実行ファイルにコンパイルされています。FirebaseやSupabaseに代わる軽量なバックエンドと考えることができます。",
  "data/ph-top/2022/7/autoregex.json": "その2022年、RegExを手で書く必要はないはずです。AutoRegExはOpenAIのGPT-3を利用して、平易な英語から正規表現を生成します。",
  "data/ph-top/2022/7/amplify-ui.json": "Amplify UIは、クラウドに直接接続できる、アクセス可能でテーマ性の高い、パフォーマンスの高いReactコンポーネントのコレクションです。🎛 40以上のコンポーネント 🎨 デザイントークンでカスタマイズ可能 🧑 Figma統合で視覚的に構築 ⚡ さらに!",
  "data/ph-top/2022/7/keysho.json": "Keyshoは、軽量なオムニボックス検索体験をあなたのウェブアプリケーションに簡単に統合する方法です。Notion、Linear、Rampなどの業界のリーダーからインスピレーションを受け、Keyshoはインターネット上のWebサイトに⌘+K&nbsp;のパラダイムをもたらすことを目的としています。🚀⚡️",
  "data/ph-top/2022/7/piano-trainer.json": "MIDIキーボードを使って、自分のペースでピアノを学ぶことができます。 クイズモードでは、五音の輪や鍵盤の認識に関する知識を試すことができます。練習モードでは、スケール、コード、5分の1の練習に役立ちます",
  "data/ph-top/2022/7/sonic-wallet.json": "フリーランサーの皆様へ SonicWalletのプロフィールリンクを共有することで、以下のことが可能になります。💻 自分の仕事について顧客に伝える 💰 支払いと寄付を集める 💸 サービスの販売と宣伝 例：https://sonicwallet.com/pages/testbot 今日から無料で始めましょう👇...",
  "data/ph-top/2022/7/timeline-hero.json": "Timeline Hero ウェブアプリでプロジェクトのTimelineを簡単に作成できます。ガントチャートのような感覚で、タスクを依存関係でアレンジしてください。完成したTimelineはPowerPointにエクスポートして、プレゼンテーションに埋め込めます。",
  "data/ph-top/2022/7/borderless-2.json": "Borderlessは、誰もが資金調達のできる留学の機会を見つけることができる、コミュニティー構築型のプラットフォームです。このプラットフォームでは、透明性の高いストーリー、レビュー、要件、応募の手順が紹介されています。私たちは、国際的な才能と機会との間のギャップを埋めることができます。",
  "data/ph-top/2022/7/code-language-converter.json": "コード言語コンバーターオンラインは、人工知能を使用して、あなたのコードスニペットをあるプログラミング言語から別のプログラミング言語へ瞬時に変換します。",
  "data/ph-top/2022/7/apislist.json": "APIsListは、さまざまなオープンソースからコンパイルされたすべてのパブリックAPIのディレクトリで、APIsListパージングエンジンによってデータが強化されています。この製品は、最も楽しいものから最も生産的なものまで、さまざまなAPIを発見することができます。",
  "data/ph-top/2022/7/how-much-world.json": "私はいつも自分がどれだけ世界を訪れたかを視覚化したかったのですが、今はそれが可能です。サポートするさまざまなカラーパレットとソーシャル共有で、自分なりの方法でどれだけ旅行が好きかをみんなに知らせることができます。",
  "data/ph-top/2022/7/aircrate.json": "Aircrateを使えば、デジタルツール、ソフトウェア、製品を簡単に公開することができます。ディレクトリを使えば、5分以内にプロジェクトを提出することができます。プラットフォームにあらかじめ組み込まれたフィルターオプションに基づいて、ユーザーに適切なツールを見つけてもらいましょう。",
  "data/ph-top/2022/7/10web-booster-website-speed-optimization.json": "10Web Boosterで得られる完全なウェブサイトの最適化は、あらゆるホスティング上のウェブサイトを90以上のPageSpeedスコアにスピードアップし、Core Web Vitalsを向上させ、コンバージョン、Googleランキング、および全体的なパフォーマンスを向上させることができます。",
  "data/ph-top/2022/7/siter-io.json": "Siter.ioは、コードを使わずにウェブサイトをデザインして公開することができる、ノーコードウェブサイトビルダーです。ブラウザ上で直接、フリーハンドで、既に知っているツールを使ってデザインすることで機能します。",
  "data/ph-top/2022/7/swarmia.json": "最もパフォーマンスの高いソフトウェアチームには、毎日少しずつ良くなっていくという共通点があります。Swarmiaは、カルチャーや品質を犠牲にすることなく生産性を向上させるために必要な洞察力とツールを、エンジニアリング組織の全員に提供します。",
  "data/ph-top/2022/7/directual-for-web3.json": "Directualは、MVPを超えるためのプロレベルのノーコードプラットフォームです。洗練されたノーコードで素晴らしいWeb3アプリ（ブロックチェーンと統合）を構築できる焼きたての機能に出会えます!",
  "data/ph-top/2022/7/disbug-2-0.json": "Disbugは、QA、クライアント、エンドユーザーに快適なバグレポート体験を提供します。🍚ビデオでバグを説明 💬テクニカルログをキャプチャ 💻ピクセルパーフェクトなフィードバックのためにライブWebページ上で編集/コメント 🗣️ 好みのPMツールに自動的に投稿する",
  "data/ph-top/2022/7/dynamic-twitter-banner.json": "🐣&nbsp;Makers: この無料ツールで、ソーシャルプルーフを自動的に表示し、最新のフォロワーに感謝の意を表します。🕐&nbsp;方法は？Twitterのアカウントに接続して、すぐに始められます。📈📈フォロー率を上げ、楽しく読者を増やしましょう。",
  "data/ph-top/2022/7/the-history-of-ui.json": "この30年の間にUIがどのように変化したかをスクリーンショットギャラリーにまとめました。",
  "data/ph-top/2022/7/desklamp-2.json": "読書を生産的に、そして楽しくするPDFリーダー。パワフルで便利なリッチテキストエディタで余白のメモを作成します。一目でわかるハイライト表示と検索。ダイナミックブックマークで簡単にスクロール。チームとのコラボレーションも可能です。",
  "data/ph-top/2022/7/business-name-generator-by-namecheap.json": "ビジネスネームジェネレーターは、AIを利用して、あらゆる業種のユニークなビジネスネームを無制限に作成することができます。ブランド名に関連するキーワードを追加するだけで、ブランド名とWebサイトドメイン、カスタムロゴを生成します。",
  "data/ph-top/2022/7/removepaywall-2.json": "RemovePaywallは、あらゆるニュース記事やブログからソフトペイウォールや広告を削除することができるサイトです。無料で簡単に利用できます。記事のURLを入力するだけです。",
  "data/ph-top/2022/7/lendflow-credit-decisioning-engine.json": "Credit Decisioning Engineを使えば、数分で借り手を承認することができます。1つのAPIで数十のデータポイントを取得し、申請者のスコアとランク付けを行います。ワークフローを構築、自動化、最適化することで、クレジット商品をより迅速に立ち上げることができます。",
  "data/ph-top/2022/7/elude-2.json": "旅行計画の手間を省いてくれる唯一のアプリで、次の素晴らしい冒険を見つけよう。600ドルで行ける場所は？」と聞かれたら、私たちは何が可能かを教えてくれます。",
  "data/ph-top/2022/7/caplena.json": "面倒なテキスト解析作業を自動化する。実用的な洞察を得て、結果をダッシュボードで共有します。Augmented Intelligenceを搭載。オールインワン・プラットフォーム。",
  "data/ph-top/2022/7/luvly.json": "Luvlyは、パーソナライズされたフェイスフィットネスプログラム、スキンケアコース、フェイスマッサージのチュートリアル、食事プラン、スキンケア専門家のアドバイスを提供するフェイスヨガビューティーアプリです。このアプリは、自然な肌の輝きを高め、肌を癒し、顔の筋肉を整え、肌の老化を遅らせることを目的としています。",
  "data/ph-top/2022/7/zoom-to-beautiful-summary-converter.json": "Zoom to Summary converter」は、Typeformの新しい会話型製品「Relayed.ai」のプレビューです。あらゆるZoomミーティング（またはあらゆるミーティングファイル）をインポートし、AIが生成した美しいサマリーを出力します。これはRelayedができることのほんの一例です。https://relayed.ai。",
  "data/ph-top/2022/7/airgram-2-0-for-zoom-google-meet-teams.json": "Airgramは、マネージャー、チームリーダー、ハイブリッド/リモートチームのためのAIミーティングアシスタントです：🎙Zoom & Google Meetに自動参加、📝対面会議の記録をサポート、✂️クリップ＆シェアノート、🗂チームワークスペースの管理です。",
  "data/ph-top/2022/7/upnext-2.json": "インターネットによって、誰もが実質的にゼロコストで出版できるようになり、私たちは現在、何百万もの文章、音声、映像のコンテンツにアクセスできるようになったのです。この豊富な情報により、私たちはあらゆるトピックについて最新の情報を入手し、学ぶことができるようになりました。",
  "data/ph-top/2022/7/plug-play-by-swapstack-3.json": "メルマガで高報酬のアフィリエイト案件を数分で設定・運用する。💰 事前に承認された高報酬のアフィリエイト案件は、いつでも実行できます。✍️ 広告の見た目や雰囲気をクリエイティブにコントロールできる。📆月末に報酬が支払われます。",
  "data/ph-top/2022/7/daftpage.json": "Daftpageは、docのように動く新しいタイプのホームページビルダーです。美しいウェブサイト/ブログ/ナレッジベースを数分で作成できます⚡️ コードなしで、しかも無料で!",
  "data/ph-top/2022/7/investor-email-templates.json": "(潜在的な)投資家にメールを送っても、何の反応もないのでは？それはあなただけではありません。そこで、投資家向けメールのベストプラクティス・テンプレートを集めました。",
  "data/ph-top/2022/7/smthg.json": "トップクラスのデジタルツールから特典付きのページを作成し、お客様の製品を充実させましょう。適切な特典を選択するだけで、リンク形式のホワイトレーベル・ページが即日作成されます。そして、それをあなたの製品やCJの中に、もう一つのミニサービスとして簡単に埋め込むことができます。",
  "data/ph-top/2022/7/funnel-easy.json": "ウェブサイトのコンバージョン率を早く確認したいときがあります。その場合、大砲や複雑なツールを持ち出す必要はありません。FunnelEasyがあれば、頭痛の種はありません。シンプルで、速く、きれいです。数秒でファネルチャートを作成、エクスポート ⚡️。",
  "data/ph-top/2022/7/focus-timer-adjustable-hourglass.json": "私たちは、かつてないほど注意散漫になっています。Focus Timer は、ポモドーロやその他の時間制限の習慣を毎日のルーチンに無理なく美しく取り入れるためのツールです... 9軸加速度センサーを内蔵し、ひねるだけで時間を設定することができます。",
  "data/ph-top/2022/7/acure-io-autonomous-itops.json": "Acure.ioは、シンプルかつパワフルなAIOpsのインシデントコントロールとオートメーションのプラットフォームです。ローコードエンジンによるCMDBの構築と管理、IT全体の状態の可視化、1つのシステムからの自動化の実行、任意のアプリケーションを簡単にパフォーマンス監視にかけることができます。",
  "data/ph-top/2022/7/ai-powered-prospecting.json": "人工知能で高品質なリードを表面化させる。AIによって営業チームがどのようにクローズドウィンへの加速を可能にするかをご覧ください。ベータ版にご登録ください - Eメール teams@calixa.io.",
  "data/ph-top/2022/7/openpod.json": "私たちは、OSSプロジェクトが独自のDAOとカスタムトークンを作成するためのDAO-as-a-serviceプラットフォームです。開発者は自分の仕事に対してトークンを獲得し、初期のユーザー/ビリーバーはそれに投資することができます。トークンは、プロジェクトの特典/利益と引き換えたり、即時リターンのために売却したりすることができます。",
  "data/ph-top/2022/7/nothing-phone-1.json": "雑念が少ない。より多くの魂。機械として形成された、純粋な本能。美しいシンボルによって語られる。深い相互作用。そして、勇敢なシンプルさ。電話（1）は、私たちを取り戻すことができます。私たちに。",
  "data/ph-top/2022/7/sourcelevel-analytics.json": "プルリクエスト、コードレビュー、コラボレーション、スループット、リードタイムに関するメトリクスでソフトウェアエンジニアリングチームを活用できます。GitHub と GitLab からデータを収集し、ソフトウェアエンジニアリングプロセスの観測可能性を提供します。",
  "data/ph-top/2022/7/businesscards-io.json": "Businesscards.ioは、Apple Walletに名刺を入れておくことができるデジタル名刺サービスです。名刺をApple Walletに保存しておけば、誰かに会ったときに名刺を取り出し、QRコードを読み取ってもらうだけで、あなたの名刺のプロフィールが読み込まれます。",
  "data/ph-top/2022/7/profilepicmaker.json": "アニメのお姫様のようになりたいですか？それとも戯画化された悪役？古典的な自画像はどうでしょう？ProfilePicMakerは、高度なAIとチームからの愛によって、あなたのお気に入りのアニメシリーズのすべてを模倣するフィルタを持っています。",
  "data/ph-top/2022/7/ember-fund-s-nft-and-metaverse-indexes.json": "Ember Fundは、専門家が作成したテーマ別の暗号ポートフォリオと戦略に個人投資家がアクセスできるようにするセルフカストディ暗号投資アプリです。Bored ApesやCryptoPunksのような優良なNFT、メタバースのトップ資産であるBitcoinやEthereumに投資することができます。",
  "data/ph-top/2022/7/reflect-2-0-2.json": "好評のノートエディターの続編、Reflect 2.0を発表します。新機能は以下の通りです。- ノートのリビジョンを閲覧し、元に戻すことができます。 脳の可視化のデザインを変更しました。",
  "data/ph-top/2022/7/patr.json": "Patrは、静的サイト、Webアプリケーション、データベース、コンテナなどを数秒でデプロイできる、驚くほどシンプルなクラウドプラットフォームです。実際、Dockerファイルであらゆるものをビルド、デプロイ、ホストすることができます。また、私たちの開発チームからすぐにサポートを受けることができます。上限なし!",
  "data/ph-top/2022/7/lost-geometry.json": "様々なスタイルの91の抽象的な3Dオブジェクトの巨大なセット。Blenderで丁寧に作られたこれらの鮮やかな3Dオブジェクトで、あなたのインターフェイスにモダンなタッチを与えてください。マット、クレイ、ガラス、ブラックの4つのスタイルがあります。PNGバージョンは無料で入手可能です。",
  "data/ph-top/2022/7/photomash-studio-by-pixlr.json": "ワンタップで背景を削除✨ 商品や人物を紹介する画像を作成✨ 素晴らしいプロフィール写真や店舗の商品画像を作成✨ 一気に一括編集✨ その他多数...。",
  "data/ph-top/2022/7/sellscale.json": "SellScaleは、ウェブ全体から見込み客のデータをスクレイピングして、超パーソナライズされたコールドアウトリーチを生成します。見込み客が実際に読みたいと思うメールを生成し、{{ファーストネーム}}の交換とは程遠いものにします。SellScaleを使用すると、コールドアウトリーチにおいて最大で10倍のコンバージョンが得られます。",
  "data/ph-top/2022/7/notion-creator-course-2.json": "Notionのテンプレートをオンラインで販売し、お金を稼ぐ。Notionのテンプレートを作成・販売し、毎月2000ドル以上の副収入を得る方法をご紹介しています。",
  "data/ph-top/2022/7/baryl.json": "Barylは、AI/MLを使用して、あなたの個性や興味に合った素晴らしいレストランや隠れた名店をアルゴリズムでキュレーションします。ルートを最適化し、それぞれの場所を訪れるのに最適な時間を見つけ出し、あなたの経験を最大限に生かすお手伝いをします。",
  "data/ph-top/2022/7/shortcut-2-0-2.json": "Shortcutは、ソフトウェアチームが仕事を計画、管理、文書化するための最適な場所です。Shortcut は、チームのドキュメントを作業と同期させながら、すべて一箇所で管理できるようになりました。これにより、ソフトウェアチームは、ツールではなく、ビルドに集中することができます。",
  "data/ph-top/2022/7/hubspot-free-cms.json": "HubSpot Free CMS でウェブサイトを立ち上げ、管理し、拡張しましょう。数分でカスタムウェブサイトを立ち上げ、数時間で魅力的なコンテンツを公開し、何年にもわたってビジネスを成長させるために設計された無料のコンテンツ管理ツール群をご活用ください。",
  "data/ph-top/2022/7/slogan-generator-4.json": "キャッチーでユニークなビジネススローガンを作成します。",
  "data/ph-top/2022/7/superduo.json": "スーパーデュオは、高齢者一人ひとりに、訓練された楽しいバディをマッチングさせるデジタルコンパニオンサービスです。バディは、あなたのウーバーのスケジュール、食料品の注文、一緒にゲームをしたり、あなたの家族に最新情報を提供するためにチェックインするのを手伝います。",
  "data/ph-top/2022/7/eloking.json": "Elokingは、お客様とプロのLeague of Legends, CS:GO & Valorantプレイヤーをつなぐマーケットプレイスです! 🔥"
}