{
  "data/ph-top/2022/1/token-around.json": "インテリジェント きびきびしている。素早く。暗号｜メタバース｜NFT｜DeFi インターネット、暗号のトレンド、ソーシャルメディアの活動をアルゴリズムで分析し、世界の暗号コミュニティから100以上のパブリッシャーから20分ごとにクイックサマリーをすぐにお届けしています。",
  "data/ph-top/2022/1/dialo-2.json": "QRコードやショートリンクで簡単にデジタル名刺をデザインし、共有することができます。連絡先アプリに直接、他の人の名刺を追加できます。",
  "data/ph-top/2022/1/tin.json": "Tinは、手動で環境を設定することなく、瞬時に実行可能なアプリケーションを生成できるTeamCodeの製品です。",
  "data/ph-top/2022/1/continuum.json": "クリエイターによるソーシャルプラットフォーム「Continuum（コンティニュアム）」をご紹介します。",
  "data/ph-top/2022/1/pika-2.json": "https://pika.rishimohan.me 無料・http://github.com/rishimohan/pika スクリーンショットを素早く美化するウェブアプリです。背景グラデーションの追加、影の調整、角丸の追加、間隔の調整などができます。PNGファイルとして保存したり、クリップボードにコピーすることができます。",
  "data/ph-top/2022/1/snappify.json": "snappifyは、美しいコードスニペットを簡単に作成・調整することができる優れたツールです。スナップショットにはあらかじめスタイルが定義されていますが、カスタマイズも可能です。",
  "data/ph-top/2022/1/harold-2-0.json": "もう、googleスプレッドシートやNotionのテンプレートを一度更新したら、二度と見ることはありません。ハロルドは、AIを搭載した一風変わったSMSボットで、あなたの習慣をトラッキングします：シンプル👊便利🙌＆楽しい🤓。",
  "data/ph-top/2022/1/sherpa-travel-restrictions.json": "シェルパは、正しい旅行書類を入手し、最新の旅行条件を理解するためのガイドです。独立した情報源であり、いかなる政府機関の後援、提携、資金提供を受けているわけではありません。",
  "data/ph-top/2022/1/menubarx.json": "https://menubarx.app/ は、アプリのように任意のウェブページをメニューバーに固定できる、強力な Mac メニューバーブラウザです。頻繁に訪れるウェブサイトのページや、ネイティブアプリがないウェブサイトでも、MenubarXはユーザーがより効率的かつ便利に使用できるようにします!",
  "data/ph-top/2022/1/open-target.json": "誰もが新しい年に向けて何らかの目標や期待を持っていますが、それを達成するために自分のモチベーションを維持するのは簡単なことではありません。体重を減らすこと、ブログ記事を公開すること、パッシブ収入を得ること、あるいは別のこと。オープン・ターゲットは、自分のモチベーションを維持するための方法なのです",
  "data/ph-top/2022/1/not-boring-habits.json": "学習習慣の行動科学と楽しくて美しいゲームを組み合わせることで、習慣を追跡するだけでなく、習慣を*構築することができます。毎日、ポジティブな習慣をマスターしたり、悪い習慣を退治するための不思議な旅の一歩を踏み出すことができます。",
  "data/ph-top/2022/1/pauseme-button.json": "Zoom通話中にワンクリックでビデオやオーディオをオン・オフできるBluetooth® Video and Microphone Controller（VMC）ボタン。",
  "data/ph-top/2022/1/accountit-2-0.json": "Accountitへようこそ。シンプルでありながら強力な日々の取引追跡ツールで、間違いなくあなたの財務の全体像を把握するのに役立ちます。Accountitを使えば、すべての取引の追跡と整理が可能なほど楽になります。",
  "data/ph-top/2022/1/value-app.json": "NFTのポートフォリオの価値をリアルタイムに把握するシンプルな方法です。",
  "data/ph-top/2022/1/qr-code-generator-99406f64-9c12-425a-9d40-c3b8d0f18cac.json": "QRコードジェネレータは、アプリのインストール、フィードバックの収集、ウェブサイトのプロモーション、Eメールの収集などを支援する、パワフルでシンプルなオールインワンのQRコードジェネレータです！QRコードジェネレータは、アプリのインストールを促進し、フィードバックの収集、ウェブサイトのプロモーション、Eメールの収集などを支援します。",
  "data/ph-top/2022/1/huski-ai.json": "eコマース領域で使用される商標、意匠、NFTなどの著作権コンテンツの使用状況をAIで検索するコンテンツ検索エンジン。ベータ版では、商標権のみを対象としています。",
  "data/ph-top/2022/1/vanillalist.json": "開発者の時間を節約し、高性能なWebアプリケーションを作成するための厳選された最高のバニラJavaScriptプラグインとリソースのリポジトリです。",
  "data/ph-top/2022/1/appmaker.json": "Appmakerは、Shopifyストアをモバイルアプリに変換するノーコードアプリビルダーです。ドラッグ＆ドロップ式のアプリビルダーを使用することで、ストアオーナーはネイティブアプリを簡単に作成し、Appstore/Playstoreにアップロードできるようになりました。AppmakerをあなたのShopifyストアに追加して試してみてください。",
  "data/ph-top/2022/1/tweet100-challenge.json": "#ツイート100は、Twitterでより多くの情報を発信するための100日間の無料チャレンジです。🛠 完全にノーコードで作られています 🤝 1日に最低1回は良いツイートができるようになります 📈 フォローが4000%も増えた人もいます! 🤯 無料で参加するか、コミュニティに参加してください。🚀",
  "data/ph-top/2022/1/life-tracker.json": "人生は貴重であり、あなたの時間も貴重です。あなたの活動を記録したデジタルジャーナルをポケットに忍ばせてください。ライフバランスを整え、集中力と生産性を高めましょう。",
  "data/ph-top/2022/1/interviewkit.json": "InterviewKitは、最大80%の時間短縮を可能にするオールインワン面接ツールです。このアプリは、面接にかかる時間を下げることで、より多くの人に面接をしてもらうための取り組みです。だから、より顧客志向の製品を作り、少しでも良い世界を作るのです❤️。",
  "data/ph-top/2022/1/relingo.json": "Relingoは、あなたが興味を持っていることに基づいて、英語の記事を読んだり、英語のビデオを見たりすることを支援します。",
  "data/ph-top/2022/1/web3jobsboard.json": "ブロックチェーン、暗号、スマートコントラクトのスタートアップから、Web3パラダイムの一端を担うことを望む大手企業まで、Web3分野の求人情報を提供します。",
  "data/ph-top/2022/1/glitch-editor-2022.json": "Glitchのエディターが過去最大のアップデートで最大300%高速化。アセット用の自動Fastly CDN、3Dモデルのプレビュー、インラインエラー報告、Prettierサポートの向上、GitHubインポート/エクスポート+ドメインへのワンクリックでのアクセスを提供します。",
  "data/ph-top/2022/1/kara-pure.json": "史上初、空気から水を作る機械。そして、pH9.2以上のアルカリ性に変える。7種類の希少な天然ミネラルで、水を豊かにする。そして、強力なUV-Cライトで連続的にろ過し、浄化します。毎日10リットルのきれいで安全な水をお届けします。",
  "data/ph-top/2022/1/300-web3-predictions-for-2022.json": "先週、何千人もの人が2022年のWeb3の予測を投稿しました。NFT、DAO、DeFi、P2E、BTC、ETH、L1s、L2sなど、先取りするためのTwitterスレッド上位50を紹介します。",
  "data/ph-top/2022/1/obsidian-flight-school.json": "オブシディアンフライトスクールは、教育製品であり、スターターキットです。オブシディアンという次世代ノートアプリをより速く、より上手に、そしてより自信を持って使えるようにするためのものです。⚡️ かつてないほど速くノートを飛び回れる...思考のスピードで",
  "data/ph-top/2022/1/unlock-7.json": "課金や物流から解放され、パッケージング、バージョン管理、顧客への製品配布からソフトウェアの構築に専念できるようになります。",
  "data/ph-top/2022/1/inboxthis.json": "今日、ウェブページや記事を保存して後で読むには、ブックマークを作成するか、新しいアプリ（例：Pocket）を使用するか、手動で自分にメールを送る必要があり、それは苦痛です😰！しかし、このアプリを使用することで、私たちは、ウェブページや記事を保存して、後で読むことができるようになります。InboxThisを使えば、どんな記事/ウェブページでも1クリックでメールの受信トレイに送ることができます👆。",
  "data/ph-top/2022/1/nft-inator.json": "NFT-Inatorは、手続き的に生成されたNFTプロジェクトの設計と開発を加速させる無償のツールキットです。カスタムデザイン、ランダムデザインの作成、レイヤーの組み合わせのテスト、Solana、Ethereum、Polygon用の画像とメタデータのエクスポートが可能です。",
  "data/ph-top/2022/1/jini-design.json": "デジタル資産のディレクトリにとどまらず、私の近刊「Frontend Schema」で紹介する新しい技術的プロセスを学ぶための試みでもあります。ロードマップはこちら: https://jini.design/?open=roadmap",
  "data/ph-top/2022/1/promoly.json": "Promolyは、クリエーターがオーディオコンテンツをメールやソーシャルメディアに配信するのを支援します。ストリーミング可能なリンク（Soundcloudなど）1つで、オーディオコンテンツをメールリストやソーシャルネットワークに配信するための魅力的なランディングページに変えることができます。",
  "data/ph-top/2022/1/non-nfts.json": "nonNFTsは、オープンソースのAI生成アートワークです。このプロジェクトの背景にあるのは、NFTの実態というよりも、むしろデザイントレンドとしてのNFTの誇大広告である。すべてオープンソースなので、すべてのアートを無料でダウンロードすることができます。",
  "data/ph-top/2022/1/travel-friends.json": "トラベルフレンズは、新しい土地に到着したときに、他の旅行者とつながるためのシンプルなウェブサイトです。地図にピンを追加し、近くにつながる他の旅行者がいるかどうかを探ります。",
  "data/ph-top/2022/1/salescamp-3.json": "Salescampは、セールスサイクルの各ステージで成長を促進するために、カスタマイズ可能なセールススイートです。すべての営業活動を一元管理し、ビジネスにとってより良い顧客を特定することができます。",
  "data/ph-top/2022/1/pollinate.json": "Revueから送信しなくても、Twitterの埋め込みサインアップ機能を使ってメルマガを育てることができるようになりました。beehiiv、Mailchimp、MailerLite、ConvertKit、Ghostと互換性があります。",
  "data/ph-top/2022/1/plask-2.json": "Plaskを使えば、ウェブカメラとブラウザがあれば、誰でもすぐに自分の動きをデジタル化してアニメーション化することができます。",
  "data/ph-top/2022/1/startup-recipes.json": "リーンスタートアップを学ぶのは簡単、実践するのは難しい! スタートアップレシピは、アイデア段階の起業家が最小実行可能製品を正しく構築することによって、できるだけ早く製品と市場の適合性を見つけるのを助けるチートシートです!",
  "data/ph-top/2022/1/ignition-gtm-beta.json": "Ignitionは、PMMとPMチームがより効果的に立ち上げ、プランニングにかかる時間を短縮し、社内の連携を強化することを支援します。ベストプラクティスに基づくワークフローを使用して、製品のタイムラインを予測し、プランを動的に推奨し、プラン/タスク/資産/計測を一元管理します。",
  "data/ph-top/2022/1/creator-resource-kit.json": "Creator Resource Kitは、Youtuber、ミュージシャン、フォトグラファー、ビデオグラファー、ライター、ポッドキャスター、ゲーマーのための1000以上のツールやリソースを集めた無料のコレクションで、常に成長を続けています。創作、配信、管理、学習、収益化、成長、その他を支援するツールです。",
  "data/ph-top/2022/1/verifykit.json": "SMSの代わりにIMプラットフォームを利用した新しい電話番号認証の方法です。WhatsAppやTelegramを利用してユーザーを認証し、認証コストを80%削減する一方、従来のSMSをサポートして、そこにいるすべての顧客にリーチします。",
  "data/ph-top/2022/1/meritverse.json": "Meritverseは、メタバースのためのプロフェッショナルネットワークです。私たちは、あなたのスキルを実証的にアピールし、あなたの成功を支援するインセンティブがあるプロフェッショナルネットワークを構築することを可能にします。🌐",
  "data/ph-top/2022/1/figma-academy.json": "Figma Academyは、Figmaの中で直接行われる実践的なレッスンで、高度な製品デザイン戦術を学ぶ、まったく新しいプログラムです。",
  "data/ph-top/2022/1/shakespeare-ai-email-writer.json": "さようなら、ライターズ・ブロック。SHAKEspeareにあなたのビジネス内容やコールドメールの目的を伝えると、あなたの代わりに文章を作成してくれます。あとは、お好きな原稿を選んで、Mailshakeのキャンペーンに追加するだけです。",
  "data/ph-top/2022/1/showtime-gasless-nft-marketplace.json": "ガス抜き：鋳造＋出品が無料、ガス代も無料。NFTの無料投下も可能! ◆インスタントロイヤリティ（Zoraのようなプラットフォームに対応）。◆最大10,000版まで造幣できる。すべて無料です。◆ 0xPolygonネットワークで環境に優しいNFTを実現。通常よりはるかに高速。",
  "data/ph-top/2022/1/airadvisor.json": "AirAdvisorは、お客様がフライトの中断に対する補償を受けることができるかどうかを確認し、お客様に代わって案件に取り組みます。過去3年以内にフライトの遅延、キャンセル、オーバーブッキングがあった場合、最大で600ユーロ（700ドル）の補償を受けることができる可能性があります",
  "data/ph-top/2022/1/obviously-ai-time-series.json": "私たちは、時間とは過去、現在、未来を捉える最も素晴らしい情報源であると信じています。そのため、私たちはObviously AI Time Seriesを開発しました。これは、特定の日付までビジネス上の重要なイベントを予測する、最も速く、最も正確なノーコードAIツールです。",
  "data/ph-top/2022/1/lohost-io.json": "簡単に言えば、lohostは、あなたがlohostウェブサイトクライアントをインストールした任意のローカルコンピュータからインターネットにウェブサイトを提供する方法です。すべてのファイルをローカルコンピュータに保存し、ウェブサイトが存在するサブドメインを選択します(https://{yourApp}.lohost.io)。",
  "data/ph-top/2022/1/articlestaff-2-0.json": "ArticleStaffは、フリーランスのライターを管理するためのワークフローシステムです。ライターへの報酬支払いやライターからの請求書の管理はもちろん、記事の公開日や各記事の進行状況を把握することができます。",
  "data/ph-top/2022/1/asimov-security.json": "ロボット開発者は、ロボットを世に送り出す前に、カスタマイズ可能でフレンドリーなソリューションを使って、品質ゲートを適用することができます。運用チームは、すべてのロボットのセキュリティ面を一元管理できる場所を手に入れることができます。",
  "data/ph-top/2022/1/certificates-by-graphy.json": "Certificates by Graphyを使えば、美しいカスタム証明書をすべての学習者に一度に配布することができます。テンプレートを選び、CSVファイルをアップロードし、ワンクリックですべての証明書を送信できます。学習者にはPDFが配布され、ワンクリックでLinkedInに追加できるオプションも用意されています。",
  "data/ph-top/2022/1/design-gradients.json": "デザイナーがキュレーションした、あらゆるプロジェクトに使える美しいグラデーションを探す人のための無料サイト。",
  "data/ph-top/2022/1/printable-chore-chart-for-kids.json": "3歳から12歳のお子様向けに、無料でカスタマイズでき、印刷もできる便利な家事チャートのテンプレート集を作りました。今すぐ無料チャートをダウンロード https://www.ursor.com で詳細をご覧ください。",
  "data/ph-top/2022/1/notion-resolution-board.json": "Notionで新年の抱負を計画し、記録することができます。",
  "data/ph-top/2022/1/yamak.json": "ブログ、ソーシャルメディア、ウェブサイト、広告、SEOのためのコンテンツとコピーを書くための、AIを搭載した次世代プラットフォーム。私たちは、AIを活用して、人間が質の高いデータを生成できるよう支援します。私たちは、膨大な時間と人的労力を節約することができます。これはとても良いことだと思います。）",
  "data/ph-top/2022/1/treeps.json": "あなたの人生を思い出してください。それは、あなたが経験した輝かしい瞬間の集合です。良いことも、悪いことも、感動したことも、辛かったことも、それが私たち自身を作り上げているのです。より幸せになるためには、新しいことをすることで、新しい生き生きとした瞬間を作り出さなければなりません。Treepsはそれをあなたに代わって選びます。700k以上のコミュニティに参加しよう",
  "data/ph-top/2022/1/strackify.json": "Strackifyでは、プロフィールを作成し、読んでいる本やカテゴリーを検索すると、アプリのコミュニティの誰かが自分の本にマッチしたプレイリストを追加していないか確認でき、アプリから離れることなく、読みながら聴くことができますよ。",
  "data/ph-top/2022/1/tipsly.json": "Tipsly.ioは、100以上の無料ツールを備えたフランスのツールボックスです。デザイナー＆プロダクトビルダー（ノーコード）のための最高のデジタルツールが含まれています。毎週、あなたがより生産的になり、デザインやウェブサイトに最適なツールを使用できるように製品を追加しています。",
  "data/ph-top/2022/1/studio-54-nft-s.json": "自分だけのカスタマイズNFTsストアを作る。あなたのブランドとコミュニティをあなたのドメインで築きましょう。あらゆるチェーン、あらゆる支払い方法に対応し、コーディング不要、初期費用ゼロでご利用いただけます。",
  "data/ph-top/2022/1/reel-unlimited-for-slack.json": "あなたのスタートアップのためにグラフィックデザインのタスクを無制限に依頼し、いつも使っているアプリ、Slack上でデザイナーとより速くコラボレーションすることができます。👋 Slack でデザインを依頼し、コラボレーションする 💯 最初のデザイン依頼は無料 ⏰ 24 時間のターンアラウンド（納期）。",
  "data/ph-top/2022/1/pomotimer.json": "Pomotimerはポモドーロテクニックタイマーです ⏲️ このサイトの目的は、勉強や仕事、コーディングなどに集中し、生産性を高めることです 🚀。",
  "data/ph-top/2022/1/phonecast-2-0.json": "iPhone/iPadをMacにワイヤレスでミラーリング。iPhone/iPadとMacをケーブルで接続する必要がありません。オンラインミーティングやゲーム、お絵かきなど、iPhone/iPadにあるものをライブで見せることができます。PhoneCast 2.0は、新しいレンダリングエンジンを搭載し、ケーブルでのキャストと同等の性能を実現しました。",
  "data/ph-top/2022/1/magic-copy-3-0.json": "Magic Copyは、スマホのテキストやリンクをコピーしてパソコンに貼り付けたり、逆にパソコンからテキストやリンクをコピーすることができる機能です それは魔法のように動作するユニバーサルクリップボードマネージャーです。すべてのデバイスと手間なく同期するリアルタイムのクリップボード＆メモアプリです!",
  "data/ph-top/2022/1/graaphics.json": "ソーシャルメディアに掲載する効果的なグラフィックを簡単に作成できます。背景、サイズ、フォント、カラー、テキストを選んで、すばやくデザインを書き出し、ソーシャルメディアに投稿する準備ができます。お客様の声や引用文に最適です。",
  "data/ph-top/2022/1/cronly.json": "内蔵のモニタリング機能でクラウド上のcronジョブを管理したり、ローカルのcronジョブに当社のモニターを使用することができます。実装は数行のシンプルなコードで可能です。既存のcronジョブの監視ツールや、cronジョブのタスクの実行をご利用ください。",
  "data/ph-top/2022/1/square-qr.json": "Square QRは、追跡可能な美しいダイナミックQRコードを生成するオンラインツールです。",
  "data/ph-top/2022/1/twitter-growth-challenge-2022.json": "2022年Twitter成長チャレンジに参加する。熱心なオーディエンスを増やし、賞品を獲得し、同じ志を持つ新しい仲間に出会おう。すべて無料です。",
  "data/ph-top/2022/1/notrix.json": "すべてのメモをブラウザのローカルストレージに保存するシンプルなメモアプリです。メモの作成、削除は100%プライバシーを守りながら無料で行えます。Markdownをサポートしています。",
  "data/ph-top/2022/1/memento-mori-notion-calendar.json": "Notionで作られたデジタルなストイックカレンダーです。このカレンダーを使うことで、毎週自分の死期を思い出しながら、また一つ生きたことにチェックを入れることで、少し良い生活を始めることができます。",
  "data/ph-top/2022/1/great-landing-page-copy.json": "Great Landing Page Copyは、ランディングページの優れたコピーライティングの例を探すためのインターネットの小さなコーナーです。",
  "data/ph-top/2022/1/ownvibe.json": "Ownvibeは、短い動画を使ってアイテムの売買ができる初めてのマーケットプレイスです。Ownvibeのショートビデオフィードで、新しいショッピングを体験してください。スワイプするだけで新しいアイテムが見つかり、気に入ったアイテムがあれば価格ボタンをタップして購入することができます。",
  "data/ph-top/2022/1/multiclock-screensaver.json": "カスタマイズ可能な24個の時計の文字盤を使って時刻を表示する無料のmacOSスクリーンセーバー（気の利いたアニメーションもあり",
  "data/ph-top/2022/1/glip-2.json": "Glipは、ライブストリーマーがNFTを投下し、ストリーム上でライブを行い、NFTコミュニティを構築するためのプラットフォームです。TwitchやYoutubeのストリーマーは、高額のプラットフォーム手数料を支払うことなく、新しい直接収益化チャネルを解放し、彼らのスーパーファンに排他的な経験を提供することができます。",
  "data/ph-top/2022/1/tulr-io.json": "Tulrは、ビデオ、テーブル、フォーム、カレンダーを組み合わせ、ワークフローに合わせた強力な自動化を適用することができます。応募者追跡、メールマーケティング、ビデオピッチなどの強力なアプリケーションを、最小限の支援で、誰でも作成することができます。",
  "data/ph-top/2022/1/databar-ai.json": "Databar.aiは、ノーコードのAPIマーケットプレイスです。3クリックであらゆるデータAPIに接続できます。🚀 専門知識は不要 🏁 迅速かつ簡単：ランディングからデータセットまで30秒以内 ✅ 自動認証、ヘッダー、ページ分割を行う。",
  "data/ph-top/2022/1/mesh-y.json": "Meshy は、美しくカラフルなメッシュグラデーションを生成するデザインツールです。色やサイズのカスタマイズが可能で、ランダムなメッシュグラデーションを複数生成することができます。グラデーションはPNG形式で自由にエクスポートできます。",
  "data/ph-top/2022/1/peach-productivity-clock.json": "生産性を向上させるのは難しいものです。Peachは、あなたの時間とその使い道を記録するための無料ツールです。プロが使っている生産性向上テクニックを応用しています。注：最良の結果を得るためには、テクニックとツールの両方を使用してください。",
  "data/ph-top/2022/1/speechly-reactive-voice-ui-api.json": "Speechlyは、高速、正確、かつシンプルな音声インターフェースAPIです。当社独自の技術により、音声認識やNLUの経験がない開発者でも、数行のコードで簡単にマルチモーダル音声UI機能をあらゆるデジタルアプリケーションに追加することができます。",
  "data/ph-top/2022/1/droit-addons-for-elementor.json": "Droit Addons for Elementorは、Elementorページビルダーのユーザー体験をより堅牢で強力なウィジェット、要素、モジュール、および機能で強化する、使いやすいプラグインです。",
  "data/ph-top/2022/1/wordle.json": "シンプルで無料のデイリーゲームです。マスターマインドとハングマンが子供を産んだら、Wordleになるでしょう。",
  "data/ph-top/2022/1/importify-dropshipping.json": "インポートファイはドロップシッピング商品を輸入し、店舗で販売しようとするeコマース販売者のための主要なプラットフォームです。インポートファイを使用することで、時間を節約し、より多くの売上とビジネスの管理に集中することができます。",
  "data/ph-top/2022/1/color-picker-chrome-extension.json": "AdCreative.aiチームによる、シンプルで軽く、無料で使えるHEXカラーピッカーで、あなたの使用状況やアカウントから情報を収集することはありません。注：我々は、今後数週間のうちにいくつかの計画されたアップデートを持っている。",
  "data/ph-top/2022/1/dark-habits.json": "毎日の習慣をgoogleシートに記録する。",
  "data/ph-top/2022/1/easypop.json": "コーディングやセットアップの手間がなく、5分以内にShopifyのオンサイトプロモーションを開始することができます。Easypopを使用して、顧客を魅了し、オーディエンスを増やし、売上を増加させましょう。",
  "data/ph-top/2022/1/iteration-x.json": "Iteration Xは、ライブのウェブサイトやウェブアプリをChromeで直接注釈し、編集することができます。スクリーンショットやビデオ通話、メールやチャットで時間とエネルギーを浪費する必要はもうありません。あらゆるページを改善し、その結果を数秒でチームと共有できます✌️。",
  "data/ph-top/2022/1/lottie-animations-by-iconscout.json": "10,000以上のロティ・アニメーションが収録されたライブラリーで、あなたのデザインをより豊かにします。ウェブ、アプリ、ソーシャルメディア、プレゼンテーションなど、あらゆる場所で使えるアニメーションで、エンゲージメントを高め、ユーザーエクスペリエンスを向上させましょう。静止画像にさようなら。",
  "data/ph-top/2022/1/amy-2.json": "AmyのAIを搭載したChrome Extensionは、Web上の情報や、会う人全員に関する実用的な洞察を提供することで、リサーチの日数を節約し、すべてのミーティングをパーソナライズしてエースになるようサポートします。",
  "data/ph-top/2022/1/listener-for-zoom.json": "Zoom通話の重要な瞬間をリアルタイムでブックマークし、長い録音を一口サイズのビデオクリップに簡単に変換できます。ベータ版で無料。Zoomのライセンス（有料）アカウントでのみ使用可能です。",
  "data/ph-top/2022/1/upscale-media-free-resolution-enhancing.json": "私たちのAIツールで品質を損なうことなく、自動的に画像の解像度を元のサイズの4倍までアップスケールします 🔥 無料で、永遠に使えます。🔍 画像を自動的に2倍、4倍と大きくする。✨ JPEG アーティファクトを除去 🤖 ピクセル化したり、細部をぼやけたりしない。",
  "data/ph-top/2022/1/manganum.json": "幻想的な写真やビデオの背景、非情なモチベーションウィジェットを備えたインスピレーション溢れる新しいタブは、あなたのGoogle Chromeを生産性の高いマシンに変えます。時計と天気予報のウィジェットもあります。ミンスクと東京で愛情を込めて開発されました🤍❤️🤍️。",
  "data/ph-top/2022/1/poeticmetric-analytics.json": "訪問者のプライバシーを侵害することなく、ビジネス上の意思決定を行うことができます。クッキーや個人情報の収集はありません。だから、クッキーバナーやGDPR、CCPA、PECRを気にする必要はありません。",
  "data/ph-top/2022/1/supernova-io.json": "Supernovaは、あらゆる分野で一貫性のあるデザインシステムを構築、管理、共有し、完全にカスタマイズ可能なドキュメントサイトを簡単に構築し、面倒なデザインシステム資産のコードベースへの配信を自動化することが可能です。",
  "data/ph-top/2022/1/zipmessage.json": "ZipMessageは、ライブミーティングを非同期の会話に置き換えます。顧客やチームメイトとビデオメッセージやスクリーンメッセージを送受信することができます。パーソナライズされたリンクを共有すれば、非同期の会話を開始できます。",
  "data/ph-top/2022/1/vision-ui-dashboard.json": "シンプルでクリエイティブなティムが作る、最もトレンディで複雑かつ革新的なチャクラUIとマテリアルダッシュボード。Chakra UIやMaterial UIのための革新的な管理者テンプレートであなたの開発を始めましょう。",
  "data/ph-top/2022/1/arcade-3.json": "ウェブサイト、ブログ記事、ツイートの中に埋め込むことができるインタラクティブなデモで、製品を紹介しましょう。アーケードは、作成、埋め込み、維持がとても簡単で、楽しく遊べます！ ⠀ アーケードの作成、埋め込み、維持がとても簡単で、楽しく遊べます。",
  "data/ph-top/2022/1/timo-2-0.json": "ToDoリストとタイムトラッキングをTimoで一元管理。複数のアプリケーションに踊らされることなく、重要なことに集中しましょう。仕事を終わらせ、顧客に請求することに集中しましょう。Timo で追跡すれば、顧客への請求書作成とタイムシートの記入に必要なものがすべて揃います。",
  "data/ph-top/2022/1/clover-v1.json": "Cloverは、メモ、タスク、ホワイトボード、デイリープランナーを1つの合理的なアプリに統合したデジタルノートブックです。",
  "data/ph-top/2022/1/collx.json": "CollX（「コレクト」）は、古くからの疑問に答えます。「それは何の価値があるのか？このアプリは、野球、サッカー、バスケットボールのカードをスキャンし、瞬時にIDを取得して平均的な市場価値を得ることができます。そして、コレクションを構築し、価値を追跡し、友人をフォローし、取引し、売買することができます。",
  "data/ph-top/2022/1/pointcard-titan.json": "PointCard™ Titanは、あなたと一緒に歩んでいくカードです。パーソナライズされた、正確で透明性の高いこの新しいチャージカードは、あなたがリワードを選び、ポイントを好きなように使うことを可能にします。",
  "data/ph-top/2022/1/alwane.json": "選択したウェブサイトや既存のCSSコードから色を抽出するウェブベースのツールです。また、色を再グループ化/順序付けして、最終的にCSS/Sassのカラーパレットを提供します。",
  "data/ph-top/2022/1/nonfik.json": "ノンフィクは、ゲーテッド・コンテンツ・ライブラリで、議論に値するフリーペーパーをベースに、以下のようなソーシャル・リーディング機能を搭載しています。共有可能な本棚 📚メモとディスカッション ⭐専門家とコミュニティのレビュー 🗂オンボーディングや仲間を教育するためのカスタムコレクション",
  "data/ph-top/2022/1/sieve-29e50984-ed30-49c2-a191-543178a4f3ae.json": "Sieveは、ビデオデータの保存、処理、自動検索を瞬時かつ効率的に行うためのAPIです。Sieveは、ペタバイト級の生ビデオの中から1%の興味深いデータを見つけ出し、重要なメタデータをタグ付けし、高品質のデータセットを構築します。",
  "data/ph-top/2022/1/workona-iphone-app.json": "Workona for iPhone は、いつでもどこでも仕事にアクセスできます。 外出先からプロジェクトのタブ、ドキュメント、リンクに簡単にアクセスできます。iPhoneでは、ウェブページを後で見るために保存したり、デスクトップのブラウザで開いているタブにアクセスすることができます。",
  "data/ph-top/2022/1/punksvsapes.json": "Punks vs Apesは、イーサリアムブロックチェーン上で初のオンチェーンパズルゲームです。このユニークなインタラクティブアートと音楽のNFTを9,998個収録しています。すべての動きは記録され、時間の終わりまで永遠にオンチェーンに保存されます。見てみてください、または自分でプレイしてみてください :)",
  "data/ph-top/2022/1/super-design.json": "毎日更新される何千ものスクリーンショットの中からベストなデザインを見つけ、クリエイティブなリサーチの時間を短縮できます。",
  "data/ph-top/2022/1/purrfect-utm-builder-by-stack-moxie.json": "簡単で間違いのないURLを作成できる、唯一の無料UTMビルダーです。正確なUTMは、正確な分析につながります。技術スタックを統合し、標準的な値を使用して、不十分なUTMの管理による分析の毛玉を回避します。それは「完璧」です - Uriel Trace Moxie \"U.T.M.\" 猫",
  "data/ph-top/2022/1/tiny-sketchbook-by-cloudhq.json": "Tiny Sketchbookは、シンプルな操作で素早く落書きアートが描けるアプリです。~5つのメリット~ ✅ スケッチで必要なものを視覚的に示す ✅ 落書きスケッチアートを作成 ✅ コラボレーション/チーム結合 ✅ 教室の課題 ✅ アートセラピーでストレス発散",
  "data/ph-top/2022/1/chaty.json": "Webサイト訪問者に摩擦のないカスタマーコミュニケーションを提供することで、顧客体験を向上させ、コンバージョンや売上につながる可能性を高めます。",
  "data/ph-top/2022/1/dryfta-2.json": "Dryftaは、イベント主催者が抄録やレビューの収集、オンラインでのチケット販売、インタラクティブなプログラムスケジュールの作成、バーチャルミーティングの開催、フル機能のネットワーキングアプリによる参加者のエンゲージメントを高めることを支援します。",
  "data/ph-top/2022/1/surfable-apps.json": "お気に入りのウェブサイトをアプリとしてインストールし、ドックやスポットライト検索から直接アクセスできます。このサービスは無料で、インストール可能なウェブサイトは100万件以上!",
  "data/ph-top/2022/1/buzz-by-streambee.json": "カメオを想像してください、でもDMのためです。Buzzは、クリエイターのためのDMマネタイズツールで、無料と有料のDMをサポートします。バズでは、あなたのファンとのチャットに最適なフィルターを使用することができます。Twitchと統合し、Twitchサブスクリプションをサポートすることで、本日ローンチしました。",
  "data/ph-top/2022/1/design-landscape-in-202x.json": "Adobe、Amazon、Figma、Nasdaq、Microsoftなどのシニアデザイナーが語る50以上のインサイト。+ 2022-2030年にデザインでキャリアを積むための12のアイデア。",
  "data/ph-top/2022/1/growth-hacking-resources-3.json": "このキュレーションされたグロースハッキングリソースリストは、グロースハッキングについて学ぶのに最適なリソースを示すことで、あなたがより速く成長するのを助けるでしょう。100以上のリソースにフルアクセスできるAirtableファイル このファイルには、リソース名、URL、説明、画像、種類が含まれています。",
  "data/ph-top/2022/1/nft-sales-bot.json": "NFT Sales Botは、私が2021年に最初の3つ（！）のNFTを立ち上げたときに、あったらいいなと思っていたツールです。なぜなら、NFTを販売するときは、自分のコミュニティ（DiscordやTwitterのフォロワーなど）のみんなに知ってもらいたいからです。なぜかって？この社会的証明がさらに売上を伸ばすからです。",
  "data/ph-top/2022/1/get-rich-quick.json": "お金を騙し取る複雑な方法を考案する代わりに、このウェブサイトにアクセスし、必要な金額を選択し、ウォレットのアドレスを入力し、ボタンをクリックするだけで、そのお金を手に入れることができます。手間いらず、簡単、シンプル、無料。どうぞお楽しみください。",
  "data/ph-top/2022/1/tipybit.json": "視聴者からの応援をビットコインで受け取ることができます。ライトニング・ネットワークのおかげで、誰でもすぐに1ドルでも送ることができます。メッセージを残すことも、匿名でチップを送ることもできます。制限なく世界中に公開されます。",
  "data/ph-top/2022/1/clay-css.json": "HTML要素に膨らんだふわふわの3Dクレイモルフィズムスタイルを適用するためのマイクロCSS利用クラスです。CSS変数によるカスタマイズと拡張が可能です。SASS mixinも含まれているので、より多くのスタイルを選択することができます。",
  "data/ph-top/2022/1/medusa-express.json": "🔥 1ページのチェックアウトフロー ⭐️ 自動生成された商品リンクから直接販売 ⚡️ オープンソースなので、独自のタッチを追加できる 🎉 数分で立ち上げられる 🛠 Next.js で構築されています。",
  "data/ph-top/2022/1/lusha-prospecting-platform.json": "Lusha Prospecting Platformは、最もシンプルで正確な方法で、夢のある見込み客を選別し、到達させることができます。レーザーターゲット化されたリストでプロスペクトの時間を削減し、意思決定者とより早くつながり、より多くの収益機会を創出します。",
  "data/ph-top/2022/1/heybooster-2-0.json": "heyboosterは、あらゆるマーケティングチャネルのデータを分析し、マーケティング戦略を最適化するための実用的なインサイトを提供します。問題点を浮き彫りにし、優先順位をつけてレポートします。",
  "data/ph-top/2022/1/mailercloud.json": "Mailercloudはクラウドベースのメールマーケティングツールで、優れた機能を豊富に備えており、ユーザーが読者と強い関係を築くのに役立ちます。エンゲージメント率やコンバージョンを向上させたい方に最適です。",
  "data/ph-top/2022/1/plum-lite.json": "プラム・ライトは、インドの小規模なチームでも簡単に始められる健康保険です。健康保険、無制限の医師の遠隔相談、ウェルネスセッション、薬や健康診断の割引、優れたカスタマーサポートが含まれています。月払いです。",
  "data/ph-top/2022/1/akiflow-3-0.json": "アキフローを使うと、こんなことができます。ショートカットとコマンドバーを使ってタスクやイベントを作成 🔔 ミーティング前にアラートを受け取り、ワンクリックで参加 などなど。",
  "data/ph-top/2022/1/free-bio-link-page-by-sendpulse.json": "Instagram、Twitter、YouTube のプロフィールにバイオリンク・ページを作成 🔗 ソーシャルプロファイルと連絡先を掲載 ✅ メーリングリストとチャットボットの購読者を獲得 ✅ 商品を紹介して販売 バイオリンク・ページは1つ無料、プレミアムプランは年間わずか$13です。",
  "data/ph-top/2022/1/karma-by-goodera.json": "Karmaは、Gooderaが提供するZoomアプリで、Zoomミーティング中にチームが良いことをしたり、良い気分になったりできるよう支援します。出席者は、100カ国以上の非営利団体のパートナーによってサポートされている大切な目的をサポートするために、たった10分で簡単なアクションを起こすことができます。",
  "data/ph-top/2022/1/thousand-faces-club.json": "Thousand faces club&nbsp;は、クリエイターが仲間を見つけ、メンターシップを求め、ベストプラクティスを発見するためのコミュニティです。若手クリエイターの成功への道のりを、より楽しく、より孤独にしないために、私たちは力を与えます。",
  "data/ph-top/2022/1/notion-themes.json": "Notion Themesは、Notionにカスタムテーマを適用するためのオープンソースのWeb拡張機能です。Notion Themesをインストールして、Notion全体のルック＆フィールを変更します。10種類以上のダーク/ライトカラースキームから選択できます。Chrome/ Brave/ Firefox/ Opera/ Egde ブラウザで動作します。",
  "data/ph-top/2022/1/hdr-plus-2-0.json": "プロ並みのHDR写真を簡単に撮影 オートモード：人工知能が最適なEVを選択し、HDR写真を撮影します。マニュアルモード：ISOと露出時間をシーンごとに調整します。アプリでもっと素敵な機能を発見",
  "data/ph-top/2022/1/people-also-search-for.json": "Googleのデータと検索結果を利用して、視聴者が（も）検索しているキーワードを見つけることができる無料ツールです。",
  "data/ph-top/2022/1/productlane.json": "フィードバック管理、顧客セグメンテーション、公開ロードマップ、自動生成される変更履歴でリニアを補完します。同じルック＆フィールで、CMD+K、ショートカット、ダークモード、リアルタイム同期、100msルールなど、何でもありです。",
  "data/ph-top/2022/1/dropshare-5.json": "スクリーンショット、スクリーンレコーディング、ファイル、文字通り何でもアップロードして、リンクですぐに誰とでも共有できます。Dropshareは、macOSとiOSで使えるファイル共有ツールで、ほとんどすべての一般的なストレージプロバイダとセルフホスティングソリューションで動作します。",
  "data/ph-top/2022/1/the-kool-aid-factory.json": "企業文化を正しく理解するには努力が必要です。クールエイドファクトリー」は、シリコンバレーで共有されている、「自分流」の企業文化を実現するためのプレイブックです。",
  "data/ph-top/2022/1/retroteam.json": "タイムボックス、プリセット、カスタムレトロフォーマットなどの機能を備えた、プライバシーを重視したRetroTeamの美しいプラットフォームで、付箋紙を捨て、オンラインでレトロスペクティブを実施することができます。",
  "data/ph-top/2022/1/grainients.json": "2000種類以上の高解像度グラデーションで、あなたのデザインを格上げします。3種類の粒状効果、18種類の2色と3色のグラデーションの組み合わせ、16種類のグラデーションレイアウトのバリエーションなど、幅広い粒状グラデーションをお試しください。",
  "data/ph-top/2022/1/popwork.json": "Popworkは、マネージャーとチームがより良い協力関係を築けるようにするアプリです。あなたのチームマネジメントを次のレベルへと導きます。1 対 1 の会議を円滑に進める 🌈 チームの雰囲気と仕事量を可視化する 💁 すぐにフィードバックを共有する ✅ 毎週フォローアップする 🎯 OKR を追跡する",
  "data/ph-top/2022/1/draw-your-nft.json": "さあ、ファンキーなNFTを描いてミントしよう 🖼。",
  "data/ph-top/2022/1/token-master.json": "Token Masterは、カラーデザイントークンを自動化するFigma用プラグインです。Token Masterを使えば、デザイントークンのスタイルを編集し、新しいカラーモードを素早く作成することができます。同じ色のトークンを選んで、一度に編集するだけです!",
  "data/ph-top/2022/1/copywriting-examples.json": "Marketing Examplesの作成者であるHarry Dryによる330以上の厳選されたコピーライティングの例です。",
  "data/ph-top/2022/1/creator-economy-buzz.json": "Creator Economy Buzzでは、毎週、クリエイターや投資家、この分野のソートリーダーから最も重要な記事、ビデオ、ブログ、ツイートを厳選してお届けしています。クリエイターにとって、重要な情報をキャッチアップする最も簡単な方法です。",
  "data/ph-top/2022/1/what-is-an-indie-maker.json": "😒 親戚にインディーズメーカーを説明するのに疲れていませんか？💡 次回はこのサイトを送ってあげましょう!",
  "data/ph-top/2022/1/community-tools-index-by-orbit-2.json": "コミュニティ・ビルダーが日常的に使用しているツールについて調査を行い、その結果を「コミュニティ・ツール・インデックス」にマッピングしました。18のカテゴリーにまたがる300以上のツールから、コミュニティの実現を支援する新しい有用なソフトウェアを発見することができます。",
  "data/ph-top/2022/1/snippet-3.json": "a macOS quick link finder inspired by https://uiw.tf get the https://testflight.apple.com/join/RTRJrZYM building this to remember all sorts of cool links and to hit my routines each day let me on twitter what'd like to see next!",
  "data/ph-top/2022/1/crater-invoice.json": "Craterは、Web3.0のために作られた製品を使いたい次世代の開発者、中小企業、企業のための、より直感的な請求書作成ソリューションです。",
  "data/ph-top/2022/1/dopplertask.json": "DopplerTaskは、タスクを簡単に自動化することができる画期的なオープンソースソフトウェアです。bashスクリプトの束でも、車をリモートで始動させるだけでも、自動化することができます。オートメーションの構築、実行、再利用、そして世界中の誰とも共有することができます。",
  "data/ph-top/2022/1/pigeonfiles.json": "Google Driveに直接ファイルを送信するための簡単なアップロードページを作成することができます。アップロードされるファイルのサイズに制限はありません。ファイルのセキュリティとプライバシーは万全です。",
  "data/ph-top/2022/1/celebrate.json": "ボタンをクリックすると紙吹雪が舞い、みんなで歓声が上がる。これは勝利を祝うためのものです。",
  "data/ph-top/2022/1/cash-app-taxes.json": "Cash App Taxes（旧Credit Karma Tax）は、連邦税と州税の申告を迅速、簡単、かつ100％無料で行うことができるサービスです。何百万人もの人々が私たちのサービスを信頼して無料で税金を申告しており、顧客は5つ星のうち4.8を評価しています。",
  "data/ph-top/2022/1/notion-investment-dashboard.json": "ダッシュボードに含まれるもの トレードエントリー後のインスタントおよび自動分析 ✔️ ライブ株価＆マーケットウィジェット用ガイド ✔️&nbsp; 新しい株式および暗号トレードを研究するためのテンプレートを備えた研究用端末",
  "data/ph-top/2022/1/nameible.json": "Nameibleは、ビジネス、スタートアップ、サイドプロジェクトのネーミングを作成するためのツールです。キーワードを追加し、接頭辞や接尾辞を選択し、リストの組み合わせから好きな名前を選ぶだけです。簡単!",
  "data/ph-top/2022/1/scenify.json": "オープンソースの画像・動画編集ソフト。ビルド時に提供可能な動的要素をサポートします。",
  "data/ph-top/2022/1/mailet.json": "Mailetは、1時間後に失効する一時的なメールアドレスを生成するプラットフォームです。ウェブサイトやソーシャルメディアに登録し、受信したメールをUIやAPIから読み取ることができます。また、スパムを回避し、セキュリティを高めることができます。",
  "data/ph-top/2022/1/reslant.json": "ディスカッションボードでは、質問、フィードバック、アップデート、機能に対する投票など、さまざまな方法で顧客を喜ばせることができます。設定には1分ほどかかり、どのような規模のコミュニティにも最適です。サインアップして、ボードを作成し、投稿を始めましょう。"
}