{
  "data/ph-top/2022/7/avid-fm.json": "教えたいけど、動画講座を作るのが面倒くさい？AVIDのクリエイターは、すべて音声で行い、制作前にクラウドファンディングでアイデアを検証しています。さらに、学習者は最大16倍の成果を得ることができます。",
  "data/ph-top/2022/7/cleanmymac-x-menu-app.json": "5つの詳細なヘルスモニターの助けを借りて、あなたのMacの寿命を延ばすことを目的とした、まったく新しいCleanMyMac Xメニューアプリを紹介します。あなたのMacのストレージ、保護状態、CPUパフォーマンス、RAM、バッテリーに関する情報を即座に得ることができます。",
  "data/ph-top/2022/7/superflow.json": "私たちは、スタイル付きWebflowコンポーネントの最大のライブラリーを構築しています。テンプレートを複製する必要はなく、コンポーネントをコピーしてプロジェクトに貼り付け、あなたのブランディングを適用するためにカスタマイズすることができます。",
  "data/ph-top/2022/7/thanks-app-for-slack.json": "Slackのために作られたThanksは、チームやコミュニティの仲間に感謝するためのレコグニションアプリです。感謝の文化を築き、お互いに助け合うインセンティブを与えましょう。Thanksを使えば、同僚やコミュニティーのメンバーに感謝の気持ちを伝えるのを忘れることはありません。",
  "data/ph-top/2022/7/kleanmail-free-email-verifier.json": "AIを活用したクラウド型メール検証ツール「KleanMail」は、コストを大幅に削減し、メールの到達率を高めながら、良好なIP＆ドメインレピュテーションを維持することを可能にします。",
  "data/ph-top/2022/7/flywheel-2.json": "FlyWheelは、コミュニティ管理者の生活を楽にするSlack Superbotです。コミュニティメンバーに関するインテリジェントな分析を提供し、日常的なタスクを自動化することができます。また、ダッシュボードから直接すべてのクエリに応答することができます。",
  "data/ph-top/2022/7/internxt-send.json": "Internxt Sendは、オンライン上で安全にファイル共有ができる暗号化ファイル共有サービスです。匿名で誰にでも無料で大容量ファイルを送ることができます。Internxt Send はプライバシー会社 Internxt のプロダクトです。",
  "data/ph-top/2022/7/flashlist-for-react-native.json": "RNではリストが面倒です。また、空白のセルが好きな人はいないでしょう。今日、FlashListは以下を提供します。- UI スレッドで最大 5X FPS - JS スレッドで最大 10X FPS - 簡単なマイグレーション すでにいくつかのアプリに搭載されており、皆さんに試していただけるのを楽しみにしています。",
  "data/ph-top/2022/7/jd-generator.json": "無味乾燥なJDをパワフルなJeDisに変える！？AIアルゴリズムにより高品質の職務経歴書を生成し、企業が職務に適したスキルを見極め、優秀な人材を引きつけることを支援します。プロフェッショナルなJDを無料で作成することで、あなたの時間を最大90%節約できます。",
  "data/ph-top/2022/7/google-password-manager.json": "個人情報を安全に管理するためには、強力でユニークなパスワードが重要です。Google パスワード マネージャーは、パソコンや携帯電話（ウェブ上の Chrome、お気に入りの Android や iOS アプリ）で、パスワードの作成、記憶、自動入力を支援します。",
  "data/ph-top/2022/7/signaturepro.json": "SignatureProで美しくサインする方法をご紹介します。あなたのために素晴らしいサインを作るお手伝いをします！字が下手でも30分で書けるようになる方法をお教えします。",
  "data/ph-top/2022/7/podnotes-io.json": "このツールは、人工知能を使って、魅力的なショーノート、ブログ記事、エピソードタイトル、ソーシャルキャプション、トランスクリプションを作成することができます。このツールは、ローカルファイル、記述リンク、または単にポッドキャストを検索することによって、コンテンツを迅速に作成することができます。",
  "data/ph-top/2022/7/everyone-draw.json": "世界中の人々がピクセルアートを共同制作するための無限のキャンバス。16色、無限の可能性。",
  "data/ph-top/2022/7/bravo-2.json": "BRAVOは、従業員が毎日感謝の気持ちとモチベーションを感じられるようにする、真にパーソナライズされた表彰・報奨システムです。BRAVOの詳細な分析とレポート機能により、誰がより多く勝っているのか、次のプロジェクトで輝くために少し後押しが必要なのは誰なのかを知ることができます。",
  "data/ph-top/2022/7/notific-2.json": "Notificは、暗号ウォレット（Ethereumとpolygon）のためのマルチチェーン、マルチプラットフォーム通知サービスです。ユーザーはWhatsAppやTelegram上でウォレットのアクティビティをリアルタイムで取得することができます。",
  "data/ph-top/2022/7/60-pretty-random-illustrations.json": "動物、植物、食品、交通、フィクション、アイソメトリックなど、さまざまな分野の詳細なイラストを検索して、次のプロジェクトに役立てることができます。ビデオ、デッキ、ブランディング、レターヘッド、モーショングラフィックスなど、様々な用途でご利用いただけます。",
  "data/ph-top/2022/7/sales-os.json": "顧客、注文、製品のすべてをデジタルワークスペースに一元化する、キックアスで美しい販売管理システムです。",
  "data/ph-top/2022/7/batchable.json": "Batchableは、大規模な人間の作業を5クリックで実行することができます。数百人のグローバルワーカーを指揮する最適な方法です： ✅ 複雑なデータ入力 ✅ 電話（テレフォンツリー、ダイヤラー、IVRなど） ✅ PDF、CSV、文書からのデータ抽出",
  "data/ph-top/2022/7/terminal-gif-maker.json": "Terminal Gif Makerは、ターミナルインターフェースでコードサンプルを作成するためのツールです。プロジェクトのGIFを作成することができ、それをプロジェクトのREADMEに表示することができます。GithubやGitlabのようなgitプロバイダでGIFを使用することができます。",
  "data/ph-top/2022/7/journey-6.json": "Journeyは、3分間のシンプルな朝の習慣を通して、あなたの個人的な目標の達成を支援します。この習慣は、あらゆるスケジュールに適合し、あなたの毎日をより意図的に、より生産的に、よりコントロールしやすくします。",
  "data/ph-top/2022/7/gameflip-2.json": "Gameflipは、6M以上のゲーマーがデジタルアイテムを売買できるマーケットプレイスです。私たちは、新興のブロックチェーン技術における開発者、パブリッシャー、ゲーマー間のギャップを埋め、Gameflipをブロックチェーンベースのゲームを誰もがアクセスできるようにするための位置づけとしています。",
  "data/ph-top/2022/7/explaining-ukraine-podcast.json": "インターニュースウクライナが運営するウクライナに関するマルチメディアプロジェクトUkraineWorld.orgが制作するポッドキャストです。\"Explaining Ukraine \"は文字通り、ウクライナで起きている政治、社会、文化などの重要な出来事をすべて共通語で解説しています。",
  "data/ph-top/2022/7/shiftx.json": "ドラッグ＆ドロップで簡単に操作できる、データ連携型のプロセス可視化ツールです。組織内のすべての人が、プロセス、ワークフロー、カスタマージャーニーをすばやくマップし、理解できるようにします。ダウンロード不要で、お好みのブラウザで使用できます。",
  "data/ph-top/2022/7/zamgeldi-me.json": "zamgeldi.meは、トルコの製品の値上げに関するニュースを集めています。",
  "data/ph-top/2022/7/how-to-professionally-say.json": "同僚に言いたいけど、もっとプロフェッショナルに聞こえるようにしたい、そんな常套句のためのシンプルな静的ウェブサイトです。",
  "data/ph-top/2022/7/auto-subtitle-generator-by-media-io.json": "最大98％の精度でワンクリック自動字幕、多言語対応で大幅効率化!",
  "data/ph-top/2022/7/keytunity.json": "Keytunityは、Google Search Consoleのデータと、お客様のWebサイトのクロールを収集し、新しい、独自のキーワードを提案します。これらの提案には、新しい記事のアイデアやコンテンツの追加トピックが含まれ、トラフィックとサイトを成長させるように設計されています。",
  "data/ph-top/2022/7/ruttl-2.json": "ruttlは、生きているWebサイトに直接コメントを残したり、リアルタイムにCSSの編集を行うことができるWebサイトフィードバックツールで、的確なデザインフィードバックをチームで共有することができます。https://www.youtube.com/watch?v=vkx366sknD4&t=65s&ab_channel=Ruttl こちらをチェック",
  "data/ph-top/2022/7/laserfocus.json": "Laserfocusはセールスプロセスを可能な限りシンプルに、しかしシンプルにならないようにします。お客様が注力すべきことを示し、すべてがSalesforceに集約されるようにします。",
  "data/ph-top/2022/7/schnapps-3.json": "Solana上での分散型予測ゲーム。SOLの価格が上がるか下がるかを予想し、正解するとそのラウンドの賞金プールの分け前を獲得することができます。シュナップスをプレイすることで、あなたの先見性を試し、報酬を得ることができます。",
  "data/ph-top/2022/7/krock-io.json": "Krock.ioは、クリエイティブエージェンシー、ビデオ制作チーム、フリーランスのプロフェッショナルのためのコンテンツレビューとプロジェクト管理プラットフォームです。不明確な修正や長いメールのやり取りは忘れてください。レビューと承認のための機能で、クリエイティビティに集中することができます。",
  "data/ph-top/2022/7/rektmeter-by-wall.json": "Ethereum上の任意のNFT Walletの統計情報をチェックアウトするための楽しいツールです。ポートフォリオの価値、ATH、利益、ベスト＆ワーストパフォーマンスのNFTs、ハイライトフリップ、取引統計など。あなたのdegen frens Walletがどのようにされているかを見てみましょう!",
  "data/ph-top/2022/7/hagrid-2-0.json": "あなたは、自分のウェブサイトに人を集めるために一生懸命に働いています。そして、彼らは彼らが聞きたいことがたくさんある！hagridは、訪問者が質問をすることができ、あなたが応答するソーシャルQnAウィジェットです：信頼を追加し、あなたの聴衆と接続することができますインタラクティブなFAQ。",
  "data/ph-top/2022/7/arctaurus-2.json": "暗号通貨取引用のカスタムオートメーションを構築する。価格がテクニカル指標を突破したら、すぐに取引したいですか？簡単です。完全なカスタムマーケットメイキング戦略や、コインを全て売却するキルスイッチを構築したいですか？コーディング不要ですべて可能です。",
  "data/ph-top/2022/7/readapt.json": "ディスレクシアや視力低下など、読むことに困難がある人のために設計されています。Readaptを使えば、読書の好みをカスタマイズし、ウェブサイトやWord文書上のテキスト（英語またはフランス語）を読みやすさや好みに合わせて調整することができます。",
  "data/ph-top/2022/7/online-video-editor-by-media-io.json": "Media.ioエディターのインターフェイスは超明確で使いやすい。テンプレートやBGMも豊富で、字幕の自動生成機能も100％無料で使えます！（※）。Instagramのストーリーに合わせた編集も無料でできますよ〜。",
  "data/ph-top/2022/7/noysi-enterprise.json": "ノイジーエンタープライズは、あなたのビジネスやコミュニティの成長の味方です。Noysiは、あなたのビジネスやコミュニティのコミュニケーション・ハブとして、CNAMEを使って独自ドメインでカスタマイズできます。",
  "data/ph-top/2022/7/marvelorder.json": "過去と今後のマーベル映画とシリーズを、公開順、年代順、Official Disney+ In-Unverse Timeline順などで把握できます。",
  "data/ph-top/2022/7/outverse.json": "Outverseは、フォーラム、Notionスタイルのカスタムスペース、ビデオなどを組み合わせ、インターネットコミュニティの体験を再構築しています。",
  "data/ph-top/2022/7/screenleap-for-websites.json": "コードスニペットをサイトに追加して設定すると、Google Meetのような機能（画面共有、ライブビデオ、オーディオ、チャット）を使って、ウェブサイトから直接ユーザーと対話することができるようになります。",
  "data/ph-top/2022/7/plezi-one.json": "B2Bインバウンドマーケティング戦略を立ち上げ、展開するための圧倒的なマーケッターのための完璧なツールキット： 📈 獲得とSEOダッシュボード 🎣 フォームとリードマグネットによるコンバージョンアップ 💌 メールキャンペーンによるエンゲージメントの自動化",
  "data/ph-top/2022/7/uiscore-digital-marketplace-2-0.json": "デザイナー、エージェンシー、デベロッパーのためのスタジオ品質のデザインリソースを集めたライブラリーが増えている、厳選されたデジタルマーケットプレイス。",
  "data/ph-top/2022/7/plg-goal-templates.json": "PLG Goal templatesは、Slack、Sentry、Airtable Zoomなど、製品主導型のトップ企業で使用されている、既製のビジネス指標テンプレートです。チーム横断的に企業のステージに応じた適切なPLGゴールを設定することができます。",
  "data/ph-top/2022/7/neopop.json": "地域社会のために、地域社会とともに発展していくことが、私たちCREDの原動力です。NeoPOPを立ち上げたとき、私たちは開発者コミュニティのためにオープンソースにすることを計画しました。なぜなら、アートはみんなのものだからです。今日、私たちはNeoPOP UIフレームワークをWeb、Android、iOS、Flutter向けにオープンソース化しました。",
  "data/ph-top/2022/7/notion-sql-learning.json": "SQLの学習時間を短縮し、短期間で習得する方法をお探しですか？Notion SQL Learningは、SQLの学習を素早く開始できるように、シンプルでわかりやすい設計になっています。",
  "data/ph-top/2022/7/tauri-2.json": "Tauriは、すべての主要なデスクトップ・プラットフォーム用の小型で超高速なバイナリを構築するためのフレームワークです。開発者は、HTML、JS、CSSにコンパイル可能なあらゆるフロントエンドフレームワークを統合して、ユーザーインターフェースを構築することができます。",
  "data/ph-top/2022/7/swiftreply-2.json": "顧客からのメールや質問は繰り返され、同じ返事を書くのは時間がかかり、大変です ✅ SwiftReplyは、チーム全体の生産性を高め、顧客との対話を改善し、一貫した定型応答を書き、整理するためのオールインワンソリューションです。",
  "data/ph-top/2022/7/loops-cereal.json": "メールスタートアップと同じように、私たちもスワッグを愛用しています。でも、Tシャツやマグカップ、ステッカーでは、ベッドから起きる価値がありません。私たちは、何か活気のあるものを求めていました。ちょっと歯ごたえのあるものが。一日の始まりに、限定版のLOOPSをどうぞ。",
  "data/ph-top/2022/7/dropbase-2-0.json": "Dropbaseは、複雑で面倒なCSVやExcelファイルから、自動カラムマッピング、エラーハイライト、データ検証/クリーニングなどの機能を備えたSQLデータベースへのデータインポートを支援します。データベースのセットアップとホスティングが含まれており、技術的なサポートは必要ありません。",
  "data/ph-top/2022/7/just-launch-it.json": "自分が作っているものに誇りを持つこと。私たちの簡単な変更履歴を使って、あなたの製品が常に改善されていることを顧客に示しましょう。最新の製品変更、新機能、バグフィックスなどをお知らせください。起動するだけで、あとは私たちにお任せください。",
  "data/ph-top/2022/7/mockoops.json": "Mockoopsは、録画した画面をドラッグドロップしてテンプレートを選択するだけで、ビデオアニメーションを作成することができます。退屈なスクリーンキャストを感動的なアニメーションに変換して、お気に入りのソーシャルメディアにアップロードしましょう!",
  "data/ph-top/2022/7/and-notes.json": "And notes - & - は、シンプルなメモアプリのパワーにスマートさを加え、メモを取ることに集中し、その洞察を楽しむことができます。",
  "data/ph-top/2022/7/via-protocol.json": "Via Protocolは、53のDEX、15のブリッジ、5つのプロバイダーを使用し、13のСhainで高速かつ効率的でシームレスなスワップ体験を実現するために設計されたクロスチェーン流動性アグリゲーション・プロトコルです。Viaは、暗号の世界におけるVisaとMastercardのようなものと考えることができます。",
  "data/ph-top/2022/7/no-language-left-behind-by-meta.json": "FAIR（Facebook AI Research）は、現在200の異なる言語間の翻訳を行う最先端のAIモデルを構築し、オープンソース化しました。そのコードとモデルは、本日、Fairseqパッケージの一部として公開されています。",
  "data/ph-top/2022/7/free-invoice-generator-7b9d1cd6-eac9-4224-81eb-e61c03b41ac3.json": "誰も取引手数料を払いたくはないのです。Zelle、CashApp、Venmoなどのマーチャントツールは、取引手数料なしで取引を行うことができますが、顧客に請求書を発行する際には、プロフェッショナルではありません。Bloomの新しいインボイスジェネレーターは、これをエレガントな新しい方法で解決します。",
  "data/ph-top/2022/7/plural-2.json": "Pluralは、管理のオーバーヘッドなしにKubernetes上でアプリケーションをセルフホスティングするためのオープンソースのDevOpsプラットフォームです。SSO、自動アップグレード、秘密の暗号化が組み込まれており、マネージドサービスのすべての利点を、ロックインやコストなしで手に入れることができます。",
  "data/ph-top/2022/7/bobby-6.json": "Googleドキュメントを自動的にバックアップし、使用可能な形式に変換してローカルに簡単にアクセスできるようにするデスクトップアプリケーションです。",
  "data/ph-top/2022/7/developer-dao-fm.json": "Developer Dao FMは、クールなものを作りながら、Lofiミュージックを聴くことができる場所です。",
  "data/ph-top/2022/7/askbelynda.json": "askBelyndaは、Amazonで買い物をするために、何千もの吟味された環境に優しい製品を備えたChrome Extensionです。企業の価値観、認証、製品の品質を評価し、確実に持続可能な企業をサポートすることを確認します。サステナブルなショッピングをシンプルに",
  "data/ph-top/2022/7/stackbricks.json": "あらかじめ構築されたスタックから始め、後からカスタマイズする。AWSとGitHubを接続するだけで、あなたのスタックは数分で稼動します。JAMstack、API、マイクロサービス、データベースなどをデプロイできます。",
  "data/ph-top/2022/7/glowbom-2-0.json": "Glowbomは、世の中で最も人気のあるプラットフォーム向けのアプリやゲームを構築するためのノーコードツールです。ゲーム、ストア、チャットボット、アンケートなど、自由に組み合わせて、あなただけのオリジナルを作りましょう。Flutter、Unity、SwiftUI、Jetpack Compose、またはWeb3としてコードを書き出すことができます。",
  "data/ph-top/2022/7/tazapay.json": "TazapayはShopify、WooCommerce、MagentoなどのプラットフォームでAPIとプラグインを介して越境チェックアウトを提供します。173以上の市場でローカルコレクション（カードとカード以外）。シームレスなオンボーディングとノーコードの支払いリンクを作成するためのオプションを備えたダッシュボード。",
  "data/ph-top/2022/7/spoke-6d11f1fa-6535-4f41-82db-37b127f75099.json": "Spokeは、新しいビデオ会議文化の子供です。Zoom、Teams、Meet、または非同期のあらゆるビデオ通話から、録音、書き起こし、ハイライト、AI要約、会議メモの最終版を作成することができます! また、ワークスペース、検索エンジン、きめ細かな共有も可能です。",
  "data/ph-top/2022/7/collectible-avatars-by-reddit.json": "Redditの最も情熱的なビジュアルアーティストたちによってデザインされた新しい限定版コレクティブルアバターは、まもなくReddit Avatar Builderで購入できるようになり、その収益はアバターをデザインしたアーティストに寄付されます。",
  "data/ph-top/2022/7/the-social-app-2.json": "エンドツーエンドで暗号化されたサブスクリプションベースのグループチャットをバニティURLで起動します。フォロワーを収益化したり、グループを「有料ニュースレター」から新しい「有料グループチャット」にアップグレードしましょう。グループチャットを作成し、価格を設定し、URLを請求し、完了です。",
  "data/ph-top/2022/7/daily-3pm-links.json": "Googleからの収益とトラフィックを増やすには、高品質のバックリンクを構築するのが一番です。インターネットのトップサイトからリンク構築の機会をキュレーションする日刊の無料メール、⏰3pm Links emailは、これを簡単に実現します。",
  "data/ph-top/2022/7/openillux.json": "Openilluxは、素晴らしいフリーイラストのコレクションをキュレーションしたリストです。",
  "data/ph-top/2022/7/hypersonic.json": "Hypersonicは、NotionでのToDoの作成、完了、ナビゲーションをこれまで以上に高速に行うことができるRaycastの拡張機能です。あなたのちょっとした思いつきやタスクが、ショートカット1つで可能になります。",
  "data/ph-top/2022/7/iconz-2.json": "200以上の手作り3Dアイコン✌この3Dアイコンの究極のパックは、UI、ソーシャルメディア、ゲーム、AR/VRなど、さまざまな用途に使用できます。一度買えば、何度でも使える。",
  "data/ph-top/2022/7/designers-lobby.json": "Designers Lobbyは、ウェブから厳選された60以上のカテゴリーからなる1200以上のデザインリソースとツールのキュレーションコレクションで、あなたの時間と無駄なウェブワンダリングを省き、効果的で整ったワークフローを作ることをサポートします。",
  "data/ph-top/2022/7/notion-for-designers.json": "Notion for Designers™は、クリエイティブなプロジェクトから混沌としたワークフローを取り除くために開発され、シームレスなワークスペースを実現するための30以上のテンプレートが用意されています。",
  "data/ph-top/2022/7/homebrew-s-50-hr-resources-for-startups.json": "何百ものアーリーステージチームと密接に連携し、人事部の構築を支援してきたHomebrewチームは、あらゆるスタートアップ企業が世界クラスの社員を採用、管理、報酬を得るために役立つ50以上の厳選されたリソースを備えたこのガイドを無料でオープンソースとして提供します。",
  "data/ph-top/2022/7/pocketbase.json": "PocketBase はオープンソースの Go バックエンドで、リアルタイムデータベース、ファイル、ユーザー管理、管理者 UI、REST-ish API を内蔵し、すべて 1 つのポータブルな実行ファイルにコンパイルされています。FirebaseやSupabaseに代わる軽量なバックエンドと考えることができます。",
  "data/ph-top/2022/7/autoregex.json": "その2022年、RegExを手で書く必要はないはずです。AutoRegExはOpenAIのGPT-3を利用して、平易な英語から正規表現を生成します。",
  "data/ph-top/2022/7/amplify-ui.json": "Amplify UIは、クラウドに直接接続できる、アクセス可能でテーマ性の高い、パフォーマンスの高いReactコンポーネントのコレクションです。🎛 40以上のコンポーネント 🎨 デザイントークンでカスタマイズ可能 🧑 Figma統合で視覚的に構築 ⚡ さらに!",
  "data/ph-top/2022/7/keysho.json": "Keyshoは、軽量なオムニボックス検索体験をあなたのウェブアプリケーションに簡単に統合する方法です。Notion、Linear、Rampなどの業界のリーダーからインスピレーションを受け、Keyshoはインターネット上のWebサイトに⌘+K&nbsp;のパラダイムをもたらすことを目的としています。🚀⚡️",
  "data/ph-top/2022/7/piano-trainer.json": "MIDIキーボードを使って、自分のペースでピアノを学ぶことができます。 クイズモードでは、五音の輪や鍵盤の認識に関する知識を試すことができます。練習モードでは、スケール、コード、5分の1の練習に役立ちます",
  "data/ph-top/2022/7/sonic-wallet.json": "フリーランサーの皆様へ SonicWalletのプロフィールリンクを共有することで、以下のことが可能になります。💻 自分の仕事について顧客に伝える 💰 支払いと寄付を集める 💸 サービスの販売と宣伝 例：https://sonicwallet.com/pages/testbot 今日から無料で始めましょう👇...",
  "data/ph-top/2022/7/timeline-hero.json": "Timeline Hero ウェブアプリでプロジェクトのTimelineを簡単に作成できます。ガントチャートのような感覚で、タスクを依存関係でアレンジしてください。完成したTimelineはPowerPointにエクスポートして、プレゼンテーションに埋め込めます。",
  "data/ph-top/2022/7/borderless-2.json": "Borderlessは、誰もが資金調達のできる留学の機会を見つけることができる、コミュニティー構築型のプラットフォームです。このプラットフォームでは、透明性の高いストーリー、レビュー、要件、応募の手順が紹介されています。私たちは、国際的な才能と機会との間のギャップを埋めることができます。",
  "data/ph-top/2022/7/code-language-converter.json": "コード言語コンバーターオンラインは、人工知能を使用して、あなたのコードスニペットをあるプログラミング言語から別のプログラミング言語へ瞬時に変換します。",
  "data/ph-top/2022/7/apislist.json": "APIsListは、さまざまなオープンソースからコンパイルされたすべてのパブリックAPIのディレクトリで、APIsListパージングエンジンによってデータが強化されています。この製品は、最も楽しいものから最も生産的なものまで、さまざまなAPIを発見することができます。",
  "data/ph-top/2022/7/how-much-world.json": "私はいつも自分がどれだけ世界を訪れたかを視覚化したかったのですが、今はそれが可能です。サポートするさまざまなカラーパレットとソーシャル共有で、自分なりの方法でどれだけ旅行が好きかをみんなに知らせることができます。",
  "data/ph-top/2022/7/aircrate.json": "Aircrateを使えば、デジタルツール、ソフトウェア、製品を簡単に公開することができます。ディレクトリを使えば、5分以内にプロジェクトを提出することができます。プラットフォームにあらかじめ組み込まれたフィルターオプションに基づいて、ユーザーに適切なツールを見つけてもらいましょう。",
  "data/ph-top/2022/7/10web-booster-website-speed-optimization.json": "10Web Boosterで得られる完全なウェブサイトの最適化は、あらゆるホスティング上のウェブサイトを90以上のPageSpeedスコアにスピードアップし、Core Web Vitalsを向上させ、コンバージョン、Googleランキング、および全体的なパフォーマンスを向上させることができます。",
  "data/ph-top/2022/7/siter-io.json": "Siter.ioは、コードを使わずにウェブサイトをデザインして公開することができる、ノーコードウェブサイトビルダーです。ブラウザ上で直接、フリーハンドで、既に知っているツールを使ってデザインすることで機能します。",
  "data/ph-top/2022/7/swarmia.json": "最もパフォーマンスの高いソフトウェアチームには、毎日少しずつ良くなっていくという共通点があります。Swarmiaは、カルチャーや品質を犠牲にすることなく生産性を向上させるために必要な洞察力とツールを、エンジニアリング組織の全員に提供します。",
  "data/ph-top/2022/7/directual-for-web3.json": "Directualは、MVPを超えるためのプロレベルのノーコードプラットフォームです。洗練されたノーコードで素晴らしいWeb3アプリ（ブロックチェーンと統合）を構築できる焼きたての機能に出会えます!",
  "data/ph-top/2022/7/disbug-2-0.json": "Disbugは、QA、クライアント、エンドユーザーに快適なバグレポート体験を提供します。🍚ビデオでバグを説明 💬テクニカルログをキャプチャ 💻ピクセルパーフェクトなフィードバックのためにライブWebページ上で編集/コメント 🗣️ 好みのPMツールに自動的に投稿する",
  "data/ph-top/2022/7/dynamic-twitter-banner.json": "🐣&nbsp;Makers: この無料ツールで、ソーシャルプルーフを自動的に表示し、最新のフォロワーに感謝の意を表します。🕐&nbsp;方法は？Twitterのアカウントに接続して、すぐに始められます。📈📈フォロー率を上げ、楽しく読者を増やしましょう。",
  "data/ph-top/2022/7/the-history-of-ui.json": "この30年の間にUIがどのように変化したかをスクリーンショットギャラリーにまとめました。",
  "data/ph-top/2022/7/desklamp-2.json": "読書を生産的に、そして楽しくするPDFリーダー。パワフルで便利なリッチテキストエディタで余白のメモを作成します。一目でわかるハイライト表示と検索。ダイナミックブックマークで簡単にスクロール。チームとのコラボレーションも可能です。",
  "data/ph-top/2022/7/business-name-generator-by-namecheap.json": "ビジネスネームジェネレーターは、AIを利用して、あらゆる業種のユニークなビジネスネームを無制限に作成することができます。ブランド名に関連するキーワードを追加するだけで、ブランド名とWebサイトドメイン、カスタムロゴを生成します。",
  "data/ph-top/2022/7/removepaywall-2.json": "RemovePaywallは、あらゆるニュース記事やブログからソフトペイウォールや広告を削除することができるサイトです。無料で簡単に利用できます。記事のURLを入力するだけです。",
  "data/ph-top/2022/7/lendflow-credit-decisioning-engine.json": "Credit Decisioning Engineを使えば、数分で借り手を承認することができます。1つのAPIで数十のデータポイントを取得し、申請者のスコアとランク付けを行います。ワークフローを構築、自動化、最適化することで、クレジット商品をより迅速に立ち上げることができます。",
  "data/ph-top/2022/7/elude-2.json": "旅行計画の手間を省いてくれる唯一のアプリで、次の素晴らしい冒険を見つけよう。600ドルで行ける場所は？」と聞かれたら、私たちは何が可能かを教えてくれます。",
  "data/ph-top/2022/7/caplena.json": "面倒なテキスト解析作業を自動化する。実用的な洞察を得て、結果をダッシュボードで共有します。Augmented Intelligenceを搭載。オールインワン・プラットフォーム。",
  "data/ph-top/2022/7/luvly.json": "Luvlyは、パーソナライズされたフェイスフィットネスプログラム、スキンケアコース、フェイスマッサージのチュートリアル、食事プラン、スキンケア専門家のアドバイスを提供するフェイスヨガビューティーアプリです。このアプリは、自然な肌の輝きを高め、肌を癒し、顔の筋肉を整え、肌の老化を遅らせることを目的としています。",
  "data/ph-top/2022/7/zoom-to-beautiful-summary-converter.json": "Zoom to Summary converter」は、Typeformの新しい会話型製品「Relayed.ai」のプレビューです。あらゆるZoomミーティング（またはあらゆるミーティングファイル）をインポートし、AIが生成した美しいサマリーを出力します。これはRelayedができることのほんの一例です。https://relayed.ai。",
  "data/ph-top/2022/7/airgram-2-0-for-zoom-google-meet-teams.json": "Airgramは、マネージャー、チームリーダー、ハイブリッド/リモートチームのためのAIミーティングアシスタントです：🎙Zoom & Google Meetに自動参加、📝対面会議の記録をサポート、✂️クリップ＆シェアノート、🗂チームワークスペースの管理です。",
  "data/ph-top/2022/7/upnext-2.json": "インターネットによって、誰もが実質的にゼロコストで出版できるようになり、私たちは現在、何百万もの文章、音声、映像のコンテンツにアクセスできるようになったのです。この豊富な情報により、私たちはあらゆるトピックについて最新の情報を入手し、学ぶことができるようになりました。",
  "data/ph-top/2022/7/plug-play-by-swapstack-3.json": "メルマガで高報酬のアフィリエイト案件を数分で設定・運用する。💰 事前に承認された高報酬のアフィリエイト案件は、いつでも実行できます。✍️ 広告の見た目や雰囲気をクリエイティブにコントロールできる。📆月末に報酬が支払われます。",
  "data/ph-top/2022/7/daftpage.json": "Daftpageは、docのように動く新しいタイプのホームページビルダーです。美しいウェブサイト/ブログ/ナレッジベースを数分で作成できます⚡️ コードなしで、しかも無料で!",
  "data/ph-top/2022/7/investor-email-templates.json": "(潜在的な)投資家にメールを送っても、何の反応もないのでは？それはあなただけではありません。そこで、投資家向けメールのベストプラクティス・テンプレートを集めました。",
  "data/ph-top/2022/7/smthg.json": "トップクラスのデジタルツールから特典付きのページを作成し、お客様の製品を充実させましょう。適切な特典を選択するだけで、リンク形式のホワイトレーベル・ページが即日作成されます。そして、それをあなたの製品やCJの中に、もう一つのミニサービスとして簡単に埋め込むことができます。",
  "data/ph-top/2022/7/funnel-easy.json": "ウェブサイトのコンバージョン率を早く確認したいときがあります。その場合、大砲や複雑なツールを持ち出す必要はありません。FunnelEasyがあれば、頭痛の種はありません。シンプルで、速く、きれいです。数秒でファネルチャートを作成、エクスポート ⚡️。",
  "data/ph-top/2022/7/focus-timer-adjustable-hourglass.json": "私たちは、かつてないほど注意散漫になっています。Focus Timer は、ポモドーロやその他の時間制限の習慣を毎日のルーチンに無理なく美しく取り入れるためのツールです... 9軸加速度センサーを内蔵し、ひねるだけで時間を設定することができます。",
  "data/ph-top/2022/7/acure-io-autonomous-itops.json": "Acure.ioは、シンプルかつパワフルなAIOpsのインシデントコントロールとオートメーションのプラットフォームです。ローコードエンジンによるCMDBの構築と管理、IT全体の状態の可視化、1つのシステムからの自動化の実行、任意のアプリケーションを簡単にパフォーマンス監視にかけることができます。",
  "data/ph-top/2022/7/ai-powered-prospecting.json": "人工知能で高品質なリードを表面化させる。AIによって営業チームがどのようにクローズドウィンへの加速を可能にするかをご覧ください。ベータ版にご登録ください - Eメール teams@calixa.io.",
  "data/ph-top/2022/7/openpod.json": "私たちは、OSSプロジェクトが独自のDAOとカスタムトークンを作成するためのDAO-as-a-serviceプラットフォームです。開発者は自分の仕事に対してトークンを獲得し、初期のユーザー/ビリーバーはそれに投資することができます。トークンは、プロジェクトの特典/利益と引き換えたり、即時リターンのために売却したりすることができます。",
  "data/ph-top/2022/7/nothing-phone-1.json": "雑念が少ない。より多くの魂。機械として形成された、純粋な本能。美しいシンボルによって語られる。深い相互作用。そして、勇敢なシンプルさ。電話（1）は、私たちを取り戻すことができます。私たちに。",
  "data/ph-top/2022/7/sourcelevel-analytics.json": "プルリクエスト、コードレビュー、コラボレーション、スループット、リードタイムに関するメトリクスでソフトウェアエンジニアリングチームを活用できます。GitHub と GitLab からデータを収集し、ソフトウェアエンジニアリングプロセスの観測可能性を提供します。",
  "data/ph-top/2022/7/businesscards-io.json": "Businesscards.ioは、Apple Walletに名刺を入れておくことができるデジタル名刺サービスです。名刺をApple Walletに保存しておけば、誰かに会ったときに名刺を取り出し、QRコードを読み取ってもらうだけで、あなたの名刺のプロフィールが読み込まれます。",
  "data/ph-top/2022/7/profilepicmaker.json": "アニメのお姫様のようになりたいですか？それとも戯画化された悪役？古典的な自画像はどうでしょう？ProfilePicMakerは、高度なAIとチームからの愛によって、あなたのお気に入りのアニメシリーズのすべてを模倣するフィルタを持っています。",
  "data/ph-top/2022/7/ember-fund-s-nft-and-metaverse-indexes.json": "Ember Fundは、専門家が作成したテーマ別の暗号ポートフォリオと戦略に個人投資家がアクセスできるようにするセルフカストディ暗号投資アプリです。Bored ApesやCryptoPunksのような優良なNFT、メタバースのトップ資産であるBitcoinやEthereumに投資することができます。",
  "data/ph-top/2022/7/reflect-2-0-2.json": "好評のノートエディターの続編、Reflect 2.0を発表します。新機能は以下の通りです。- ノートのリビジョンを閲覧し、元に戻すことができます。 脳の可視化のデザインを変更しました。",
  "data/ph-top/2022/7/patr.json": "Patrは、静的サイト、Webアプリケーション、データベース、コンテナなどを数秒でデプロイできる、驚くほどシンプルなクラウドプラットフォームです。実際、Dockerファイルであらゆるものをビルド、デプロイ、ホストすることができます。また、私たちの開発チームからすぐにサポートを受けることができます。上限なし!",
  "data/ph-top/2022/7/lost-geometry.json": "様々なスタイルの91の抽象的な3Dオブジェクトの巨大なセット。Blenderで丁寧に作られたこれらの鮮やかな3Dオブジェクトで、あなたのインターフェイスにモダンなタッチを与えてください。マット、クレイ、ガラス、ブラックの4つのスタイルがあります。PNGバージョンは無料で入手可能です。",
  "data/ph-top/2022/7/photomash-studio-by-pixlr.json": "ワンタップで背景を削除✨ 商品や人物を紹介する画像を作成✨ 素晴らしいプロフィール写真や店舗の商品画像を作成✨ 一気に一括編集✨ その他多数...。",
  "data/ph-top/2022/7/sellscale.json": "SellScaleは、ウェブ全体から見込み客のデータをスクレイピングして、超パーソナライズされたコールドアウトリーチを生成します。見込み客が実際に読みたいと思うメールを生成し、{{ファーストネーム}}の交換とは程遠いものにします。SellScaleを使用すると、コールドアウトリーチにおいて最大で10倍のコンバージョンが得られます。",
  "data/ph-top/2022/7/notion-creator-course-2.json": "Notionのテンプレートをオンラインで販売し、お金を稼ぐ。Notionのテンプレートを作成・販売し、毎月2000ドル以上の副収入を得る方法をご紹介しています。",
  "data/ph-top/2022/7/baryl.json": "Barylは、AI/MLを使用して、あなたの個性や興味に合った素晴らしいレストランや隠れた名店をアルゴリズムでキュレーションします。ルートを最適化し、それぞれの場所を訪れるのに最適な時間を見つけ出し、あなたの経験を最大限に生かすお手伝いをします。",
  "data/ph-top/2022/7/shortcut-2-0-2.json": "Shortcutは、ソフトウェアチームが仕事を計画、管理、文書化するための最適な場所です。Shortcut は、チームのドキュメントを作業と同期させながら、すべて一箇所で管理できるようになりました。これにより、ソフトウェアチームは、ツールではなく、ビルドに集中することができます。",
  "data/ph-top/2022/7/hubspot-free-cms.json": "HubSpot Free CMS でウェブサイトを立ち上げ、管理し、拡張しましょう。数分でカスタムウェブサイトを立ち上げ、数時間で魅力的なコンテンツを公開し、何年にもわたってビジネスを成長させるために設計された無料のコンテンツ管理ツール群をご活用ください。",
  "data/ph-top/2022/7/slogan-generator-4.json": "キャッチーでユニークなビジネススローガンを作成します。",
  "data/ph-top/2022/7/superduo.json": "スーパーデュオは、高齢者一人ひとりに、訓練された楽しいバディをマッチングさせるデジタルコンパニオンサービスです。バディは、あなたのウーバーのスケジュール、食料品の注文、一緒にゲームをしたり、あなたの家族に最新情報を提供するためにチェックインするのを手伝います。",
  "data/ph-top/2022/7/eloking.json": "Elokingは、お客様とプロのLeague of Legends, CS:GO & Valorantプレイヤーをつなぐマーケットプレイスです! 🔥",
  "data/ph-top/2022/7/hype-day.json": "Web3プロジェクトのミント、景品、抽選のために高品質の登録を得ることができます。すべて無料です。ウォレットの残高 - 特定のNFTの保有 - Twitterのフォローとリツイート - Discordのメンバーシップとロール - 電子メールによる認証。",
  "data/ph-top/2022/7/dokkio-sidebar.json": "サイドバーは、Chromeのウェブメール、コラボレーション、リサーチにインテリジェンスを追加します。どのウェブページやウェブアプリケーションからでも、タブを切り替えることなく、ファイルのコンテンツやナレッジを利用できます。すべての検索は、ファイルが保存されているすべての場所で自動的に複数検索されます。",
  "data/ph-top/2022/7/figma-component-library.json": "最高のFigmaコンポーネントを一箇所に集めました。Figma の UI コンポーネントを発見し、コピーして貼り付けることで、最も効率的にデザインを構築することができます。あらゆるデザイン・プロジェクトに必要なものを一度に手に入れることができます。",
  "data/ph-top/2022/7/100-users-100-days-challenge-round-2.json": "USERS 💯 DAYS チャレンジのルールは簡単です。このチャレンジに参加すると、プライベートコミュニティ、マスターマインドグループ、1-1メンタリングなどへアクセスできるようになります。",
  "data/ph-top/2022/7/revenue-watcher.json": "Revenue Watcherは、スタートアップやインディーズプロジェクトの創業者から直接報告された収益数字を、慎重にキュレーションしてデータベース化したものです。数字は、Twitter、Hacker News、YouTube、Starter Story、Indie Hackersなどのプラットフォームから取得されています。",
  "data/ph-top/2022/7/unflow.json": "モバイルアプリに数行のコードを追加するだけで、PMやマーケティング担当者は、エンジニアリングの助けを借りずに、完全ネイティブのオンボーディングカルーセル、ビデオストーリー、フィードバックポップアップなどを送信できます。",
  "data/ph-top/2022/7/serve-3.json": "Serveは、開発者が自分のデータを使ったAPIを超高速で生成するためのツールです。SQLデータベース（PostgreSQL + MySQL）からGoogleシート、さらにはCSVやJSONまで、あらゆるデータをローコードソリューションによって認証されたAPIエンドポイントに変えることができるのです。",
  "data/ph-top/2022/7/alfred-5-2.json": "Alfredのワークフローエディターは、より速く、より効率的に、ユーザーフレンドリーでアクセスしやすくなるように、一から書き直されました。新しいキーボードショートカット、マウス操作、検索パレット、VoiceOverの改善など、多くのことを発見してください。",
  "data/ph-top/2022/7/plusidentity-browser-extension.json": "PlusIdentityは、最新の機能であるブラウザ拡張機能をご紹介します! Slackアプリ＋ウェブアプリと合わせて、自動ログインや自動入力などの新機能をお届けします。",
  "data/ph-top/2022/7/bookmarker-for-notion.json": "コンテンツに合わせた率直なURLプレビューで、Notionワークスペースにコンテンツを保存する新しい方法を解き放ちます。画像、テキストの抜粋、記事など、あらゆるものを保存することができます。",
  "data/ph-top/2022/7/vidpowr.json": "VidPowrは、インタラクティブな動画の作成、プレイヤーのカスタマイズ、動画のパーソナライズ、動画の自動化のためのオールインワン未来型動画プラットフォームです。VidPowrを使用して、マーケティングビデオを変換し、インタラクティブ性を追加し、販売し、リードを収集し、インサイトを確保することができます。",
  "data/ph-top/2022/7/mapedia.json": "マペディアは、クラウドソーシングによる学習プラットフォームです。新しいトピックを学び始めたり、最適な学習教材を見つけたり、次に何を学ぶべきかを考えたり、あなたと同じ道を歩む学習者とつながったりするのに最適な場所なのです。学習方法に悩むのではなく、学習することに時間を使いましょう。",
  "data/ph-top/2022/7/notion-second-brain-2-0.json": "Second Brainは、すべてを一箇所に集めて整理するデジタルシステムで、メモ、リソース、プロジェクト、目標などの管理をサポートします。",
  "data/ph-top/2022/7/tweepsbook-2.json": "TwitterがTwitter Blueでできなかったことを、私たちは無償で実現しました。TweepsBookは、あなたの「ジャイアン的」なブックマークをすべてインポート、整理、メモ、共有できる、より良いブックマークツールです。",
  "data/ph-top/2022/7/ava-maker.json": "AvaMakerは、アニメのアバターやソーシャルプロフィール画像を作成するための無料オンラインツールです。特別なアバターを生成してダウンロードし、他の人に差をつけましょう。トレンディなアバタースタイルと多数のエレメントが準備されています。SVGとPNGに対応。NFTメーカーとしても使用可能です",
  "data/ph-top/2022/7/supertokens-passwordless.json": "Slack、Medium、Instagramに続き、パスワードレスなログイン体験を可能に。パスワードレスで、開発者は電子メールIDや電話番号でユーザーを認証できるようになりました",
  "data/ph-top/2022/7/content-brief-generator.json": "AIの力で数時間ではなく数分でコンテンツ概要を生成。ワンクリックで概要を共有。",
  "data/ph-top/2022/7/fastlane-3.json": "fastlaneは、AndroidとiOSのデプロイメントを簡素化することを目的としたオープンソースのプラットフォームで、開発とリリースワークフローのあらゆる面を自動化します。",
  "data/ph-top/2022/7/marple-2.json": "テスト・計測データをクラウド上で管理し、可視化します。無料アカウントを作成し、データファイル（.csv、ulogなど）をドラッグ＆ドロップすると、さまざまな信号を一度に視覚化できます。",
  "data/ph-top/2022/7/gum-2.json": "スタートアップは難しい。成功するためには、すべてのファウンダーにコミュニティが必要だ! ガムの新しいビデオアプリは、スタートアップのためのTikTokのようなもので、スタートアップを一緒に作り、成長させることができます。スタートアップのTikTokのようなもので、スタートアップのクリエイターなら誰でも参加できます。あなたは何を作りますか？",
  "data/ph-top/2022/7/oniri-2.json": "Oniriを使って、夢を書き留め、理解し、コントロールしましょう。夢日記をつけ、最も人気のある明晰夢のテクニック、何百もの解釈、統計、その他にアクセスしましょう。",
  "data/ph-top/2022/7/spydialer.json": "- 電話番号について知りたい場合 - 必要な番号を入力するだけで、何が得られるかを確認できます。 名前を使って検索したい場合 - 名字と名前を入力すると、すべてのデータを無料で取得できます。",
  "data/ph-top/2022/7/endpoint-space.json": "URLをコピーして、フォームに貼り付けるだけです。このフォームから送信されたすべての情報は、あなたのアカウントのダッシュボードとメールに送信されます。また、複数のメールに同時に送信されたものを受け取るように設定することもできます。",
  "data/ph-top/2022/7/droplove.json": "独自のNFTスマートコントラクトを作成する。コード作業不要 外部のコントラクトはもう必要ありません。一度独自のコントラクトを構築すれば、それを完全にコントロールすることができます。",
  "data/ph-top/2022/7/flowductive.json": "Flowsで集中力を持続させ、楽しくユニークな方法で生産性を向上させましょう。",
  "data/ph-top/2022/7/twitter-uni.json": "Twitter Uniは、最も簡単な方法で、トップオピニオンリーダーの最高のTwitterスレッドとニュースレターを見つけ、発見し、読むことができます。",
  "data/ph-top/2022/7/daily-journal-3.json": "Daily Journalは、習慣から財務まで、生活のあらゆる側面を記録できるオールインワンのページです。編集システムはボタンをベースにしており、この方法はあなたの経験を可能な限り簡素化するために構築されています。",
  "data/ph-top/2022/7/git-story.json": "Git リポジトリから直接コミット履歴の動画 (.mp4) を作成することで、Git プロジェクトのストーリーを伝えることができます。Gitプロジェクトを視覚化し、チームで共有したり、ブログ投稿やYouTube用にGitアニメーションを作成したり、新しい開発者がGitを学ぶのを手助けしたりできます。",
  "data/ph-top/2022/7/printable-reflection-journals-ebook.json": "一年を振り返り、見直すのに役立つデジタル＆プリントアウト可能なプランナー集。",
  "data/ph-top/2022/7/locofy-ai.json": "Locofy.aiは、デザインをプロダクションレディなコードに変換することで、ビルダーを3～4倍速く立ち上げることを支援します。FigmaからReact, React Native, HTML-CSS, Next.js, Gatsbyへの変換を無料ベータ版でお試しください! レスポンシブデザインをタグ付けし、コンポーネントを作成し、ライブプロトタイプを取得し、コードをエクスポートするか、直接デプロイします。",
  "data/ph-top/2022/7/clientdb.json": "clientDBは、リアルタイムのWebアプリケーションを実現するためのオープンソースのインメモリデータベースです。高速でスケーラブルなアプリケーションを構築し、ユーザーにとって絹のような滑らかさを感じることができます。",
  "data/ph-top/2022/7/streamalive.json": "ライブストリーム、チームミーティング、ウェビナーをStreamAliveで生き生きとしたものにしましょう。チャットをワードクラウドから世界地図まで、リアルタイムのビジュアライゼーションに変換します。視聴者を退屈から解放するために、エンゲージメントの追跡、増加、変換を支援します。",
  "data/ph-top/2022/7/teta-cms.json": "Teta CMSは、CouchDBデータベース、ソーシャルOAuthプロバイダによるユーザー認証、リアルタイム購読、Ayayaによるカスタムクエリ、自動生成ドキュメント、使いやすく反応の良いユーザーインターフェイスを提供する、弊社のインハウスプラットフォームです。",
  "data/ph-top/2022/7/authsignal.json": "Authsignalは、ドロップインパスワードレス認証とノーコードルールエンジンを組み合わせた不正行為の自動化スイートです。シンプルなAPIを通じて統合されたAuthsignalは、不正行為の全体像を示し、お客様のチームがリアルタイムで摩擦を調整し、脅威を分析することを可能にします。",
  "data/ph-top/2022/7/paperoad.json": "Paperoadは、ドライブや旅行、マラソンの旅程をたどり、良い思い出を振り返るためのオリジナルポスターを作成することができます。",
  "data/ph-top/2022/7/activelink-by-xr-sports.json": "ActiveLink by XR Sportsは、音声＋動画のチャレンジを通じて、クリエイターが作成したオリジナルコンテンツの価値を高めるためのSocialFiツールです。ファンは、オンライン・チャレンジに参加し、報酬やお気に入りのクリエイターやコミュニティへのアクセス権を獲得することができます。",
  "data/ph-top/2022/7/get-intro.json": "Get Introは、投資家がスワイプ、マッチング、創業者との電話予約などを60秒以内に行うことができる資金調達プラットフォームです。** 本プレゼンテーションで使用されている画像は、当社の所有物ではございません。",
  "data/ph-top/2022/7/linkedin-automation-by-overloop.json": "LinkedInのアカウントをOverloopに接続し、プロフィール訪問、接続リクエスト、ダイレクトメッセージを自動化します。コールドメールとLinkedInの接触を組み合わせたマルチチャネル・キャンペーンで、営業ノルマを達成しましょう。",
  "data/ph-top/2022/7/paragraph-rewriter.json": "AISEOの段落リライターは、関連する詳細を維持しながら、コンテンツの構造を変換することで、段落の書き換えを簡単に支援します。GPT-3などのAIエンジンを用いて、圧倒的なスピードでこれを実現します。",
  "data/ph-top/2022/7/codex-a456c800-169b-4efa-baaa-0f0c49805ce7.json": "CodexはVS Codeの拡張機能で、エンジニアなら誰でも、特定のコード行にコメントや質問など、あらゆる種類のコンテンツを添付することができます。このコンテキストは、あなたのチームがビルドを継続する際に、あなたのコードをフォローします。あなたのチームがコードベースをより深く理解できるようにします。",
  "data/ph-top/2022/7/beauty-hunter.json": "美容製品の9割が購入後に使用されていないことをご存知でしょうか？ビューティーハンターのAIレコメンデーションエンジンは、数百万種類の成分を分析し、あなたにマッチしたスキンケア商品を提案してくれるんです!",
  "data/ph-top/2022/7/look-up-pro.json": "クリップボードから直接カスタムクエリを作成して、ウェブ検索を強化できます。macOSネイティブの検索機能のような、でもステロイドのような。",
  "data/ph-top/2022/7/snapchat-for-web.json": "Snapchat for Webは、チャットリアクションやチャットリプライなどのトップメッセージ機能に加え、近日中に展開されるレンズも搭載しています。Snapchat for Webは、現在、米国、英国、カナダなどでSnapchat+加入者に提供されています。",
  "data/ph-top/2022/7/tranch.json": "Tranchは、組み込み型のB2B Buy Now, Pay Laterソリューションです。Tranchは、SaaSプロバイダーやサービスプロバイダーに前払いを可能にし、顧客には柔軟な支払いを提供します。お客様は、1万ドルから25万ドルの請求書を3ヶ月から12ヶ月に渡って支払うことができます。",
  "data/ph-top/2022/7/50-hacks.json": "アカウントは必要ありません。インターネットが優秀なものをアップヴォートする。クラウドソーシングによる生産性向上のためのヒントが手に入ります。",
  "data/ph-top/2022/7/css-scan-3-0.json": "Inspect Element」にさよなら - カーソルを合わせた要素のCSSを瞬時にチェックし、そのルール全体をワンクリックでコピー ⚡.",
  "data/ph-top/2022/7/tam-calculator-by-clearbit.json": "Total Addressable Market (TAM) Calculatorは、市場規模＋価値を瞬時に算出することができる無料ツールです。高度なフィルター、ダイナミックな結果、Clearbitの4400万社以上の企業データベースへのアクセスにより、長く費用のかかる調査を数クリックで行うことができます。",
  "data/ph-top/2022/7/payload-cms-2.json": "Payloadは、CMSの世界でより良い選択肢を開発者に提供するために作られた、開発者ファーストのヘッドレスCMSとアプリケーションフレームワークです。ドキュメントからデザインまで、PayloadはCMSの現状を変えようとしています。",
  "data/ph-top/2022/7/youcode.json": "YouCode by You.comは、開発者のための検索エンジンです。スニペットをコピーし、AIでコードを書き、JSONを検証し、ドキュメント、ヒント、トリック、ユーティリティを従来の検索エンジンの10倍速く見つけることができます。",
  "data/ph-top/2022/7/hugo-67a588e9-d883-477a-94fa-cecc8128674d.json": "Hugoは、プロフェッショナルサービスのフリーランサーがビジネスを効率的に運営し、成長させるための完全なSaaSソリューションです📈 フリーランスのシンプルさと自由に恋してください🏖。",
  "data/ph-top/2022/7/record.json": "Recordは、ユーザーが問題を記録できるようにすることで、サポートチームがサポートサイクル時間を短縮できるようにします。このRecordは、ユーザーの問題を解決するために、社内で簡単に共有することができます。すべて、製品を使用し、何もダウンロードすることなく達成されます。",
  "data/ph-top/2022/7/supernormal-1-0.json": "Supernormalは、あなたの仕事のためのビデオHQです。あらゆるプラットフォームで会議を簡単にキャプチャーし、共有することができます。また、画面やカメラの録画と同期して会話を取ることができます。",
  "data/ph-top/2022/7/trunk-merge.json": "Trunk Merge は、プルリクエストのマージをオーケストレーションして、常にテストに合格するコードのリポジトリを維持するインテリジェントなサービスです。",
  "data/ph-top/2022/7/limewire.json": "LimeWireは、アーティストがレコードや音楽関連のアート、その他の収集品をファンやフォロワーに直接販売することに戻ることができるように、できるだけシンプルにすることを使命とする使いやすいNFTマーケットプレイスです。",
  "data/ph-top/2022/7/neuton-1.json": "Neutonは、インターネット上の最適なリソースとともにスキルのロードマップを使用して、あらゆるスキルをより速く習得できるようにする学習ツールです。また、Neutonは、教育関係者が教育コンテンツを宣伝するのにも役立ちます。",
  "data/ph-top/2022/7/image-host-company.json": "ImbBBですが、あなた自身のGoogle Driveで、すべてのメディア（画像、GIF、サウンド、ビデオ...）のソースリンクを取得します。どんな高解像度の画像でもホストできます。",
  "data/ph-top/2022/7/hopper-hq-2-0.json": "Hopper HQは、Instagram、TikTok、Facebook、Twitter、Linkedin、Pinterestへの投稿を簡単かつ視覚的に計画、スケジュール、自動公開できるソーシャルメディア管理・スケジューリングツールです。",
  "data/ph-top/2022/7/notion-time-tracking-by-everhour.json": "NotionやEverhourブラウザエクステンションから、労力をかけずに時間を記録することができます。EverhourはNotionのインターフェースにコントロールを組み込み、多くの便利な機能で拡張します。タイマーを使って時間を記録したり、手動で時間を記録したりすることができます。ProductHuntの皆さんには特別割引があります。☝️",
  "data/ph-top/2022/7/momentum-for-upsells-renewals.json": "Momentum for Upsells & Renewalsは、Slackのアカウントルームとカスタマーチャンネル、Zendesk、Gainsight、Catalystとの統合により、オンボーディング、アップセル、更新のプロセスを自動化し、営業チームの純金維持率を向上させることができます。",
  "data/ph-top/2022/7/liveflow-templates-for-google-sheets.json": "🛠 目標に合わせてカスタマイズした、コアなテンプレートセットを作成する。👬複製して、複数のチームやクライアントに提供する。💪 ライブダッシュボードでチームを強化し、顧客サービスを向上させる。😍 5回のクリックで、財務報告を月2日分削減できます。",
  "data/ph-top/2022/7/flycode.json": "FlyCode (YC S22) は、ウェブアプリケーションをコーディングなしで編集可能にすることで、企業がより迅速に製品を反復してリリースできるようにします。",
  "data/ph-top/2022/7/animaker-ios-app.json": "10秒! これだけで、新しいAnimaker Appでビデオを作ることができます! 不可能に聞こえますか？トレンディでプロフェッショナルなビデオ作成機能により、たった3つのステップでビデオを作成することができます。タップ、スワップ、作成! P.S. 絶対無料です!",
  "data/ph-top/2022/7/raycast-for-teams.json": "レイキャストは、Macの生産性を向上させるためのワンストップソリューションです。Raycast for Teamsで、この体験を企業に提供できることを嬉しく思います。コマンド、クイックリンク、スニペットを組織内で共有し、社内のワークフローをスピードアップします。",
  "data/ph-top/2022/7/call-to-action-examples.json": "CTA Examplesは、様々なゴールに対するコールトゥアクションのフレーズをキュレーションしたリストです。目的のCTAテキストをワンクリックでコピーし、適切な場所に貼り付けるだけです。",
  "data/ph-top/2022/7/copysmith-chrome-extension.json": "Copysmithは最先端のAIを使用して、Google Chromeブラウザ上で商品説明や広告コピーなどを生成・強化します。あらゆるプラットフォームでコンテンツを作成、編集、最適化できるため、これまでにない生産性とコンバージョン率の向上を実現します。",
  "data/ph-top/2022/7/virtual-cafes-by-workfrom.json": "カスタム背景画像、控えめなビデオチャット、お気に入りの音楽を組み合わせて、ゴージャスなオンラインミートアップスペースを作りましょう。あなたのコミュニティ、ブランド、目的に合わせて、すべてをカスタマイズしてください。コード不要のデザインツール ダウンロードやインストールは不要です。作る。作る。共有する。",
  "data/ph-top/2022/7/metafy-classes.json": "Metafyクラスでは、ゲームの専門家の知恵をグループで聞くことができます。クラスメイトとチームを組み、自分一人では解決できないような疑問も、多角的に学ぶことができます。",
  "data/ph-top/2022/7/stable-delaware.json": "Stableは、国税庁、政府機関、銀行などで使用できる恒久的なビジネスアドレスとバーチャルメールボックスを提供します。新しい住所は、デラウェア州で設立され、本社を州内に置きたい企業のためのものです。",
  "data/ph-top/2022/7/brand-studio-by-crowdspring.json": "Brand Studioは、あなたのブランドを瞬時に格上げするデザインツールです。ウェブサイトを追加したり、ロゴをアップロードすると、美しいブランドテンプレートが作成され、無料で編集することができます。テンプレートには、請求書、企画書、フライヤー、プレゼンテーションなどがあります。",
  "data/ph-top/2022/7/tech-pizza.json": "Tech Pizzaは、重要な技術ニュースについて毎週お届けするニュースレターです。シンプルで民主的、そして楽しく技術についていけるようにします。ピザのように🍕オーディオ📹またはテキスト📖で配信しています。",
  "data/ph-top/2022/7/bleep-beta.json": "Bleepは、あなたの思考とインスピレーションのためのバーチャルな家です。メモ、画像、リンクを追加して、あなたの心にあるものを捕らえることができます。それらを整理し、キュレーションするために部屋を作成します。自分だけの楽しいビジュアル空間を楽しみ、あなたと共に成長していきましょう。",
  "data/ph-top/2022/7/sleepagotchi.json": "Sleepagotchiは、一定の睡眠時間を保つことで、無料のNFTとSHEEPと呼ばれる暗号トークンでユーザーに報酬を与えるアプリです。ユーザーは毎朝1個の無料NFTと、よく眠れた場合は2個の無料NFTを得ることができます。",
  "data/ph-top/2022/7/clipdrop-figma-plugin.json": "ClipDropの最先端の画像処理ツールをFigmaで直接使用することができます。背景、オブジェクト、テキスト、人物、不具合などを1クリックで削除できます。また、画像を自動的に複数のレイヤーに分解することもできます。",
  "data/ph-top/2022/7/guide-for-podcasters.json": "ポッドキャスターのためのガイドを用意しましたので、作成、開発、プロモーションを簡単に行うことができます。もうインターネットで個々の情報を探し回る必要はありません。私たちはすべてを見つけ出し、分析し、最も有用なものだけを残しました🚀。",
  "data/ph-top/2022/7/atomic-sheets-by-better-sheets.json": "あらゆるGoogle Sheetに即座に追加できるコンポーネントのライブラリ。ユーザーが使用するシートにランディングページを追加することができます。Google シートでリードマグネットを作成 共有するシートにソーシャルシェアボタンを追加できます。人が見向きもしないような、より良い Google Sheets を作成できます。",
  "data/ph-top/2022/7/miro-for-google-meet.json": "Google MeetでMiroを活用すれば、タブの切り替えやアカウント不要で、同じビジュアル空間でチームとして共同作業を行うことができます。コラボレーションツールを活用して、すべてのミーティングをより包括的でコラボレーティブなものにしましょう。",
  "data/ph-top/2022/7/tully.json": "初の感情管理スマートブレスレットは、生体センサー、AI技術、機械学習アルゴリズム、および子供が自分の感情を認識し、管理し、効果的に対処できるように特別に設計されたパーソナライズされたコーチング方法論を組み合わせています。",
  "data/ph-top/2022/7/moni-3.json": "Moniは、トークンやNFTを追跡し、分析する最も簡単な方法です。ユーザーは新しいトレンド資産を発見し、チャートを表示し、最新ニュースを入手し、オフチェーンおよびオンチェーンデータを分析することができます。Moniアルファコミュニティはこちら： https://discord.com/invite/eqdaqqqnx8",
  "data/ph-top/2022/7/banana-3.json": "Bananaは3つの簡単なステップと1行のコードでMLモデルの推論ホストを提供します。サーバーレスGPUインフラで、アイドルGPU時間に対する支払いを止め、モデルを即座に本番環境にデプロイします。Bananaを利用してスケールを拡大しましょう。🍌",
  "data/ph-top/2022/7/portal-09f294dd-380c-4a73-8d6c-6bf098fd1762.json": "Portalは、実際に普通の人のために作られた最初の暗号ウォレットです。Portalを簡単に説明すると： ✅ 確認済みの受取人に簡単に送金 📝 実際に覚えている回復フレーズを選択 🔐 あなたの鍵、あなたの硬貨",
  "data/ph-top/2022/7/openflow.json": "マニュアル工程を完全自動化フローに ✅非技術者のためのコードビルダー ✅技術者のためのカスタマイズ可能なAPI ✅あらゆるアプリケーションの上に強力なAI 🥳Zapierより柔軟で使いやすく安価 🔥試しに使ってみてください。",
  "data/ph-top/2022/7/radix-ui-2.json": "Radix UIは、高品質でアクセシブルなUI、デザインシステム、Webアプリケーションを構築するための26個のスタイルなしReactコンポーネントのセットです。",
  "data/ph-top/2022/7/iollo.json": "iolloは血液中の500以上の分子を測定し、食事や行動、そして近い将来には治療介入をデザインし、より健康に、より長く生きることを支援します。",
  "data/ph-top/2022/7/tweepsmap-3.json": "アナリティクス、パブリッシング、モニタリングにより、活発なTwitterコミュニティを構築します。カレンダーにコンテンツをグループ化し、スレッド、投票、タグのスケジュールを立て、AIで最適なタイミングで自動投稿します。デモグラフィック、コンテンツ、キーワードで誰でも分析し、分析結果をフィルタリングできます。",
  "data/ph-top/2022/7/winter-nft-checkout-for-platforms.json": "WinterのクレジットカードNFTチェックアウトが企業に好評です。現在、Winter は、ローンチパッドとノーコードプラットフォームが NFT クレジットカードチェックアウトを大規模に作成するのを支援しています。",
  "data/ph-top/2022/7/olivine-marketplace.json": "2016年からプロダクトマーケティングのリーダーであるOlivineがお届けする、AWS、ServiceNow、Uberなどのトップテック企業や、B2B SaaSの数十社のアーリーステージスタートアップでの経験を持つ認定コンサルタントが担当します。価格は月額3,250ドルから。",
  "data/ph-top/2022/7/fing-desktop-3-0.json": "Fing Desktop 3.0は、あなたのインターネットセキュリティを次のレベルに引き上げます。Wi-Fiに接続されているすべてのデバイスの確認、インターネット速度テストの実行、ルーターの脆弱性のチェック、専門的なトラブルシューティングツールの入手が可能です。",
  "data/ph-top/2022/7/gomates-2.json": "Gomatesは、すでに知り合いで信頼している人たちと相乗りを管理するための便利なプラットフォームです。",
  "data/ph-top/2022/7/propstar-for-figma.json": "Figma 上で、バリアントとコンポーネントのプロパティのあらゆる組み合わせを含む、コンポーネントのすべての可能なインスタンスを生成し、整理されたラベル付きの表にすることができます。",
  "data/ph-top/2022/7/aspect.json": "Aspectはリアクトコンポーネントのためのビジュアルエディタです。Figmaプラグインを使ってデザインをコードに変換したり、Aspectのクローム拡張機能を使ってあらゆるサイトのUIをサンプルすることができます。",
  "data/ph-top/2022/7/sesh-3.json": "お子さまの癇癪について毎日報告すると、科学的な裏付けのある、すぐに使える個別テクニックを受け取ることができます。毎日ガイダンスを受け、テクニックの使い方を指導してもらうことができます。癇癪のコントロールの達人になる!",
  "data/ph-top/2022/7/face-swapper-2.json": "FaceSwapper (https://faceswapper.ai)は、顔を好きな他の顔に入れ替えることができるオンラインツールです。手動で顔を入れ替える必要はなく、顔写真をアップロードするだけで、AIシステムが自動的に処理します。",
  "data/ph-top/2022/7/terrabook.json": "AWSアカウントと完全に統合されたインブラウザIDE - インフラのReplitを考える。フロントエンド、バックエンド、データベースなど、あらゆるもののスニペットが用意されています。Terraform のコードを編集することも、自分で書くこともできます。",
  "data/ph-top/2022/7/nitro-2-0.json": "ニトロが商品とマーケティングの翻訳を簡単にします ランディングページ、電子メール、ブログ記事、プレゼンテーション、ドキュメントなどを翻訳します。>簡単なセルフサービスの発注 >Google Docsまたはプレーンテキストをアップロード >Google Docsのフォーマットを保持 >70言語 >API",
  "data/ph-top/2022/7/socialtribes.json": "この拡張機能を使うと、Facebookグループから自動的に回答を引き出すことができるので、バーチャル・アシスタントにお金を払ったり、回答をコピーペーストして時間を浪費したりする必要がなくなります。1. Facebookグループメンバーのデータを収集する 2. 新しいFacebookグループメンバーのデータをGoogleシートに送る",
  "data/ph-top/2022/7/one-click-videos-by-creatorkit.json": "CreatorKitは、Eコマースのために作られた動画作成ツールです。⠀ One click videosで、マーケッターはワンクリックでマーケティングビデオを作成することができます。⠀ お店のURLや商品ページを入力するだけで、100以上のブランデッドビデオを自動生成します。",
  "data/ph-top/2022/7/stella-2.json": "Stellaは、Slack、Notion、Google Suiteなどに存在する企業情報を取り込み、それらに基づいたサマリーをリーダーシップチーム向けに毎日作成するAIソリューションです。",
  "data/ph-top/2022/7/chrome-extension-for-bubble-2-0.json": "私たちのパッケージとプラグインを使用すると、ページの準備/変更、アクションのトリガー、スクリーンショットの取得、ソースコードの取得など、本格的な拡張機能を構築することができます。最新のマニフェスト v3 バージョンをサポートします。",
  "data/ph-top/2022/7/strell.json": "Strellは、SEO担当者やコンテンツマーケティング担当者が、オーガニック検索トラフィックを増やすためにコンテンツを書き、最適化するのを支援する、完全なコンテンツ最適化ツールです。",
  "data/ph-top/2022/7/neednect.json": "すべての旅行者にとって、NeedNectはパーソナライズされた旅行体験のための究極のプラットフォームです。私たちは、2人の旅行者が同じであることはないと信じています。私たちのプラットフォームは、あなたのニーズに合わせて旅行体験をカスタマイズするお手伝いをします。",
  "data/ph-top/2022/7/glyfs.json": "✶ glyfsは、iPhone、iPad、Macで、文字のコピー＆ペーストやドラッグ＆ドロップを簡単に行うことができます。また、✶ glyfs には、大文字小文字変換、単語/文字カウンター、テキストフォーマッターなど、シンプルなテキストツールがいくつか搭載されています。",
  "data/ph-top/2022/7/refresh-bot.json": "古い写真、ピクセル化された写真、ぼやけた写真、破損した写真をワンタップで高精細な写真に変換します。そして、泥だらけのフィルターで撮影したSnapchatの写真は、再びきれいになります。",
  "data/ph-top/2022/7/100-css-buttons.json": "サインアップから販売まで、ボタンがなければデジタルアクションは不可能です。人間とコンピュータのインタラクションの本質なのです。このパッケージで、あなたのWebサイトに、これまでにない新鮮な息吹を吹き込んでください。",
  "data/ph-top/2022/7/my-abortion-network.json": "中絶医療からヒロイズムを取り除きたい。中絶ケアの訓練を受けた臨床医のプールを拡大することで、中絶をこれまで以上に私的で身近なものにすることができます。これは医療に関することであり、政治的なことではありません。",
  "data/ph-top/2022/7/the-status-code.json": "The Status Codeは、APIファーストの製品やトレンドについて毎週お伝えする、スマートで無駄のない友人です。退屈な仕事をこなし、業界のトレンドを伝え、興味深いAPIファーストのスタートアップをカバーする友人だ。シンプルで、専門用語もなく、でたらめもない。",
  "data/ph-top/2022/7/280-productivity-resources.json": "生産性を高めるための最高のリソースを発見してください。生産性向上のためのリソースをお探しですか？",
  "data/ph-top/2022/7/form-with-sheet.json": "Webサイトのフォームデータを、コーディングなしで直接Googleスプレッドシートのテーブルに取り込むことができます。Googleアカウントに接続するだけです。",
  "data/ph-top/2022/7/recurring-payments-by-decentro.json": "顧客の銀行口座から定期的に支払いを引き落とすための、10倍シンプルで直感的なAPIソリューションです。定期購入、ローン、自動引き落とし、保険料の支払いなどを管理する必要があるインドのフィンテック企業にとって、非常に便利なソリューションです。",
  "data/ph-top/2022/7/heyhey-4.json": "HEYHEYは、あなたのデジタルプレゼンスを一元化し、個人ホームページのあり方を広げるお手伝いをします。厳選されたテーマから選ぶことができ、ページに関する分析結果を見ることができ、デジタルグッズを販売することができます。",
  "data/ph-top/2022/7/undaku-2.json": "Undakuは、モダンなシステムのための、最もオープンソースでノーコードのSaaS型プラットフォームです。Undakuで構築できるもの - B2B SaaSネイティブアプリケーション - Webアプリケーション - モバイルアプリケーション - 社内ツール/ビジネスプロセスオートメーション - Webサイト",
  "data/ph-top/2022/7/makerbox-frameworks.json": "マーケティングをレベルアップする ストレスフリーで。50の実戦的なマーケティングフレームワークで、より速く成長しましょう。10分間ガイドで、ポジショニングを明確にし、売上を伸ばし、オーディエンスを作りましょう。",
  "data/ph-top/2022/7/abbot.json": "Abbotは、チームがSlackで顧客との会話を記録し、手作業を自動化することを支援します。ビルトインのレポートと強力な統合レイヤーを備えたAbbotは、チームの作業時間を短縮し、終わりのない頭痛の種を減らすことができます。",
  "data/ph-top/2022/7/avoma-sales-playbook.json": "ほとんどのセールス・プレイブックは、一般的すぎて実用的ではありません。しかし、この本は違います。私たちは何百ものセールスコールを分析し、セールスリーダー、マネージャー、AE、SDRのための実行可能なプレイブックを作りました。その結果は？その結果、一般論に流されることのないプレイブックが完成しました。",
  "data/ph-top/2022/7/brandwork.json": "プロフェッショナルを活用することで、MVP構築時にロゴやブランド資産をどのように見せるべきかを考える時間を短縮できます。ブランドワークのチームは、迅速な構築の専門家であり、自分で行う心配やストレスなしに、高品質のブランド資産を得ることができます。",
  "data/ph-top/2022/7/views-figma-plugin.json": "Figma Views では、キャンバス内の気になる部分をブックマークすることができます。ファイルの主要な部分をマッピングするなど、もう一度見直したい部分を整理するために使用します。また、画面共有の際にも威力を発揮します。カーソルやパン、ズームを最小限に抑えることができます。",
  "data/ph-top/2022/7/play-spotify-together-in-remotion.json": "Spotify macOSアプリの音楽を同期させる軽量なオーディオルーム。話すと音楽がフェードアウトします。そして何より、誰でも無料で使えます。Spotify Premiumは必要ありません。",
  "data/ph-top/2022/7/web3-faces.json": "web3の自分のプロフィール写真とtwitterのハンドルネームをアップロードして、twitterのハンドルネームで検索すれば、誰でもあなたのpfpステッカーが見つかります。",
  "data/ph-top/2022/7/stray.json": "ストレイ』は、ネオンが輝く細密なサイバーシティの路地や、薄汚れた地下街を舞台にした、三人称視点の猫型アドベンチャーゲームです。",
  "data/ph-top/2022/7/coschool-lms.json": "CoSchoolは、複数のレッスンとインタラクティブなクイズでダイナミックなコースを作成できるWordPressのLMSプラグインです。公式アドオンを活用して、WooCommerce、EDD、Stripe、PayPalなどの多数の支払いソリューションを使用してコースを販売しましょう。",
  "data/ph-top/2022/7/stackup-3.json": "Stackupは、初心者でも簡単に暗号を使えるようにするモバイルウォレットです。Stackupを使えば、誰でもどんな暗号トークンやNFTでも即座に購入することができます。",
  "data/ph-top/2022/7/basedash-apps-actions.json": "数日ではなく、数分で社内アプリを出荷できます。データベースを接続し、データのレイアウトを選択するだけです。CRUD操作からリアルタイムのマルチプレイヤー、アクションを伴うAPIコールまで、すべてが箱から出してすぐに動きます。",
  "data/ph-top/2022/7/cycle-4.json": "Cycleは究極の製品管理ハブです。様々なソースから顧客インサイトを取得し、製品提供ワークフローに接続し、製品イニシアティブでコラボレーションし、リリースごとに顧客とのループを閉じます👉 https://www.cycle.app",
  "data/ph-top/2022/7/charmverse-2.json": "CharmVerseは、コミュニティの貢献者が日々の仕事を調整し、暗号ウォレットでサインインし、DAOトークン/NFTでワークスペースをアンロックするための場所です。オンボーディング、バウンティ管理、提案、プロジェクトトラッカー、データリポジトリを1つの場所に持ってきています。",
  "data/ph-top/2022/7/sirens-gallery.json": "Sirens Galleryは、戦争のギャラリーです。ロシアのウクライナに対する全面戦争について、AIが生成した1,991のアートワークで構成されています。すべてのアートワークはNFTとして販売されます。そのお金は人道支援に使われます。すでに2つのドロップが出ています。戦争の犠牲者を助けてください。",
  "data/ph-top/2022/7/dock-2.json": "Dockは、見込み客や顧客のためのコラボレーション・ワークスペースです。Dockは、デジタルセールスルーム、オンボーディングチェックリスト、クライアントポータル、プロジェクトハブを簡単にセットアップすることができます。",
  "data/ph-top/2022/7/cvat-computer-vision-annotation-tool.json": "CVATは、しばしばクローズドソースのプロプライエタリなシステムに留保されている強力な機能を含んでいます。使いやすさを追求し、データアノテーションのための最も速く、最も使いやすいツールの一つとして、AI業界で認められています。1M以上のダウンロード数を記録しています。",
  "data/ph-top/2022/7/wireshape-studio-beta.json": "Wireshapeは、メタバースとゲームクリエイターを支援するWeb3 3Dスキャンエコシステムです。Wireshape Studioでは、ARで3D NFTと対話し、Wireshape DAOロールにアクセスし、WS NFTと$WIRE残高をチェックします。コントリビューターは、写真から3D NFTを生成し、お金を稼ぐことができるようになります。",
  "data/ph-top/2022/7/mobile-paywall-collection.json": "モバイルペイウォール画面集：ペイウォールで試せるアイデア、トレンド、インスピレーションをご紹介します。400以上のモバイルペイウォール事例を収集し、毎月新しい画面を追加し、業界の専門家がコメントしたホットなペイウォールをニュースレターで配信しています。",
  "data/ph-top/2022/7/kickstart-your-ui-design-career.json": "「UIデザインの基本から、UIデザインの原理、デザイナーとしての進化、そして最初のクライアントを獲得する方法まで、ビギナーUIデザイナーが学ぶことができるeBookです。",
  "data/ph-top/2022/7/bard-3.json": "Bardは、アーティスト、作家、俳優、ミュージシャンなどが共同で世界を構築し、物語を語り、議論するためのソーシャルメディア・プラットフォームです。",
  "data/ph-top/2022/7/loggify.json": "もう、製品の進捗とお客様とのコミュニケーションの間に欠けることはありません。すべてのステークホルダーに一元的に情報を提供します。あなたのチーム、顧客、リードは、あなたを気に入ることでしょう。",
  "data/ph-top/2022/7/peach-8.json": "借金は苦しい💢-Peachなら、日常生活での買い物もローン返済に充てられるので、早く借金が返せるようになりますよ。",
  "data/ph-top/2022/7/playbooks-by-gosquared.json": "メールキャンペーンはストレスがたまるし、うまくやるには膨大な労力が必要です。オンボーディングメール。機能のお知らせ ウィンバックキャンペーン。10年分のデータとリサーチに裏打ちされたPlaybookを使えば、たった3クリックで送信することができます。",
  "data/ph-top/2022/7/bend-3.json": "企業の銀行口座（Brex、Mercury、AmExなど）に接続し、各購入の影響を推定することで、スタートアップ企業の二酸化炭素排出量測定を支援します。さらに、開発者向けのAPIアクセスも可能です。",
  "data/ph-top/2022/7/hello-cognition.json": "Hello Cognitionは、ソフトウェア開発者のための検索エンジンです。技術的な質問に対して、簡単な説明とウェブ上の関連するコードスニペットを使って即座に答えます。",
  "data/ph-top/2022/7/snaptro.json": "ビデオを録画し、作業中のリンクを追加すれば、無料のSnaptroページが完成します。営業担当者、求職者、AirBnbホストなど、具体的な使用例を詳しくご紹介しています。",
  "data/ph-top/2022/7/stripe-pricing-table.json": "Stripeで価格ページを構築します。コードレスで価格表を作成、カスタマイズできます。UIをサイトに埋め込めば、定額制や座席単位でのサブスクリプション、トライアルプランの販売を即座に開始できます。追加の決済統合は必要ありません",
  "data/ph-top/2022/7/actionable-book-club.json": "Actionable Book Clubは、ジェームズ・クリアの著書「アトミック・ハビッツ」から得た気づきを、実行可能な形に分解していくメルマガ講座です。毎日、きっちり10分で終わるメールが届きます。",
  "data/ph-top/2022/7/ingradients.json": "Ingradientsは、高解像度（最大6K）のメッシュグラデーション画像（とSVG）のコレクションです。次のデザインプロジェクト、ウェブサイト、フライヤー、アプリ、壁紙、パンフレットなどに最適です。",
  "data/ph-top/2022/7/share-for-ios.json": "Shareは、一人でもグループでも、自動化された投資戦略を構築できるモバイル投資アプリです。カスタムインデックスを作成し、ドルコスト平均法を使用して毎週自動的に投資することが簡単にできます。Product Huntユーザーはウェイティングリストをスキップしてください",
  "data/ph-top/2022/7/superful.json": "地域による、地域のための。Superfulは、コミュニティが成長するにつれて避けられなくなる面倒な物流をすべて合理化する、ユーティリティベースの無料プラットフォームです。許可リストの管理からウォレットの提出まで、あらゆることをカバーします。",
  "data/ph-top/2022/7/sliderule-2.json": "Slideruleは、フィンテック・リスク・チームのためのノーコード・ルール・エンジンです。組み込みのデータコネクタとリアルタイム分析により、不正、コンプライアンス、信用に関する自動意思決定ロジックを構築します。リスクルールをハードコーディングする必要はありません。Slideruleでリスクチームを強化しましょう。",
  "data/ph-top/2022/7/slackmin.json": "Slackminを使えば、チーム全員がSlackの中で簡単に管理機能を使うことができます。ウェブサイトのコンテンツ更新、顧客からのクレーム、注文履歴の確認、払い戻しなど、Slackminを使えば様々なことが可能になります。",
  "data/ph-top/2022/7/settle-3.json": "キャッシュフローは複雑である必要はありません。Settleは、請求書払い、買掛金、柔軟な資金調達をひとつにまとめ、ECサイト創設者が日々のキャッシュフローをよりよく管理できるようにし、さらに、より多くの時間を制作に費やすことができるようにします。",
  "data/ph-top/2022/7/warmy-io.json": "メールボックスは、最先端のAI自動処理により、最高の配信性を持つメールマーケティングキャンペーンのために準備されています。",
  "data/ph-top/2022/7/better-outreach.json": "Better Outreachは、B2Bセールスのアウトリーチメッセージのオンラインリポジトリで、独自のメールシーケンスに再利用、カスタマイズ、再利用することができます 📧。",
  "data/ph-top/2022/7/swaypay.json": "ブランドは、フォロワー数に関係なく、純粋に買ったもの、気に入ったものをTikTokingしてくれた買い物客に報酬を与えることを好むのです。Swaypayが登場するまでは、このようなことはとても難しいことでした。私たちが話をするほとんどのブランドは、参加したいと思っています。",
  "data/ph-top/2022/7/chord-genius.json": "🎸 コードと歌詞を見ながら、ギターで曲をより速く、より楽しく学べます。🎵 Spotify、Apple Music、またはYouTubeから音楽をストリーミング再生できます。🏃♂️ 再生速度を変えて、自分のペースで学べます。",
  "data/ph-top/2022/7/feature-flag-experimentation-by-devcycle.json": "DevCycleの新しい実験プラットフォームは、すべてのプラットフォームで実験と機能フラグ管理を提供し、エンジニアリングチームがシンプルかつ強力な分析で新機能の影響を簡単に理解できるようにします。",
  "data/ph-top/2022/7/founder-to-product-manager.json": "創業者が初めて製品管理の仕事に就くためのガイドです。",
  "data/ph-top/2022/7/cancelled-meetings-by-loom.json": "仕事で非同期更新のためにLoomに傾倒していると、少し時間が空くことがあります。そんな時、この香りに包まれながら、ゆったりとした時間を過ごしてみてはいかがでしょうか。",
  "data/ph-top/2022/7/radiant-2-0.json": "Radiantは、今話題のデジタルラジオサービスです。Radはあなたの好きな音楽を知っていて（Spotifyとの深い統合により）、イベント、天気、そしてパパのジョークまで更新しながら、あなたの一日のサウンドトラックを再生します。",
  "data/ph-top/2022/7/kmenu.json": "規模が大きくなるにつれ、ユーザーが圧倒されることなく、シームレスにアプリケーションを操作できるようにすることが課題となっています。そこで、コマンドメニューの出番です! このライブラリでは、ウェブサイト上でコマンドパレットを簡単に設定し、追加することができます。",
  "data/ph-top/2022/7/infinitycareers.json": "∞eduは、ブランドを大学化することで、技術職のキャリアをより身近なものにします。Coursera、LinkedIn Learning、Skillshareと提携し、実際の仕事内容のスキルを業界のトップコースとマッチングさせています。あなたの夢の仕事のカリキュラムを通して学ぶことができます。",
  "data/ph-top/2022/7/movicorn.json": "Movicornは、アプリケーションを他のクラウドプロバイダーからAWSに簡単に移行させることができます。お客様のコードを分析し、それに適したインフラを自動で構成します。GithubとAWSのアカウントを接続するだけで、あとはMovicornがやってくれます。",
  "data/ph-top/2022/7/hazel-quinn-slow-juicer.json": "世界初のスクラブレスジューサー、ヘーゼル・クインのスロージューサーをご紹介します。他のジューサーと違い、このスロージューサーはフィルターがなく、細長い溝があるため、想像以上にピュアなジュースを出すことができます。",
  "data/ph-top/2022/7/the-guide-to-no-code-marketplaces-2-0.json": "コードレスでオンラインマーケットプレイスを構築し、立ち上げ、拡大するために必要なすべてのことを知ることができます。このアップデート版（第2版）は、最新のプラットフォームとツールのアップデート、および新しい創業者の洞察を含む、50ページ以上の包括的なガイドです。",
  "data/ph-top/2022/7/email-testing-by-inbox-pirates.json": "Inboxpiratesで送信ボタンへの不安を解消し、メールの開封率をアップさせましょう。このツールを使えば、件名がどこで切れるか、さまざまなメールクライアントやデバイスでメールがどう見えるか、通知バーでどう見えるかを確認することができます。",
  "data/ph-top/2022/7/ursor.json": "URSORは好奇心旺盛な子供たちのための安全なブラウザです。広告もトラッキングもない、本来の子供のためのインターネットです。私たちは、家族がインターネットを、大きなテクノロジーの延長ではなく、子育ての延長として取り戻すことができるようなブラウザをデザインしました。ぜひお試しください。",
  "data/ph-top/2022/7/knowledgebase.json": "KnowledgeBaseを使用すると、オンサイトのヘルプセンターを作成し、顧客が独立して問題を解決することができますし、ケースを解決する際に知識を提供することによって、サポートエージェントを支援することができます。",
  "data/ph-top/2022/7/micro-saas-ideas-2.json": "マイクロSaaSのアイデアを探している技術者やマーケティング担当者のためのニュースレターとコミュニティ。収益性の高いMicro SaaSニッチに関する週刊ニュースレターを、データに裏付けられた分析と各アイデアの実行方法のガイドとともにお届けします。何百時間ものリサーチ時間を節約することができます。",
  "data/ph-top/2022/7/square-s-all-in-one-toolkit-for-managers.json": "実行可能な目標を定義し、進捗状況を確認し、1対1の議題を設定し、フォーカスを明確にして、賞賛を得るためにチームを管理するためのミッションコントロールが一箇所に集結 デザインリードの@Squareによって作成され、チームのキャリアアップを加速させるために1000人の技術リーダーに使用されています。",
  "data/ph-top/2022/7/dropblok.json": "DropBlokは、小規模なブランドのための、コード不要のドラッグ＆ドロップ式アプリビルダーです。モバイルアプリを展開するSquarespaceのような存在で、デザイナーによるテンプレートマーケットプレイスや完全なエンドツーエンドサポートを提供します。私たちのゴールは、アプリ構築のプロセスを民主化することです。",
  "data/ph-top/2022/7/dope-link-android-app.json": "Dope.Linkは、視聴者からお金やメールなどを集めることを、これまで以上に簡単にします。数秒のうちにストアを作成し、デジタル製品やサービスの販売を開始したり、バイオブロックの膨大なセレクションを使ってコンテンツを宣伝することもできます。",
  "data/ph-top/2022/7/ora-4-0.json": "Oraは、タスク管理、チーム、クライアントコラボレーションのためのオールインワンソリューションです。この新しいバージョンでは、新しいプロジェクトビューとグループ化およびソート方法によって、チームのタスクに新鮮な新しい視点をもたらしています。その他にも多くの改良点があります。"
}