{
  "data/reddit-ask/r/TooAfraidToAsk/comments/v23vyl/how_do_i_report_a_discord_server_for_child.json": "をする、ランダムなDiscordサーバーに参加し、荒らしをする、などです。\nサーバーを探す為にTwitterで \"discord \"と検索して、そ\nサーバーを見つけるために、ツイッターで \"discord \"と検索して、一番新しいサーバーに行ったんだ。\nというようなタイトルのサーバーへのリンクを見つけました。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v274xn/if_people_cant_use_mental_illness_as_an_excuse.json": "精神的な問題を言い訳にするなとは言わないが、少なくとも\nとはいえ、体調が悪いのは本人の意思ではないのです。宗教とは異なり、それは選択です。\n選択です。\n\nこのことを説明できる人はいますか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v29we0/is_antiracism_simply_thinly_veiled_racism.json": "反差別主義者」が、白人がいかにこの世界を形作ったかを語るのを見たことがあるが、その時\nアラブや中国の帝国が多大な貢献をしたと言うと、まるで嘘のような態度を取るのです。\nウソをついているようなものです。\n\nある女性は、クリスチャン・ヨーロッパが中世に家父長制を確立したと言いましたが\n私はアッバース朝カリフが...",
  "data/reddit-ask/r/askscience/comments/v29pew/what_determines_the_ideal_number_length_width_and.json": "風力発電機には3枚の長いブレードしかないのに、風車や\n風車や水車にはもっとたくさんの羽根があります。同様に、家庭用扇風機にも3枚、5枚、あるいはそれ以上の羽根があり、その長さもさまざまです。\n羽根の長さもさまざまです。どのように\nどのような使い方をするのが最適なのでしょうか。",
  "data/reddit-ask/r/NoStupidQuestions/comments/v24yuw/do_unattractive_people_find_other_unattractive.json": "メインを知ってる人に小心者だと知られたくないから捨て身で。\nでも、本当に...。\n\n魅力的な人もいれば、そうでない人もいることは、みんな知っている。\n魅力的な人もいれば、そうでない人もいる。魅力的でない人は、自分が魅力的でないことを知っているような気がします。\n自分が魅力的でないことを自覚してるんだ、だろ？にもかかわらず...",
  "data/reddit-ask/r/AskHistorians/comments/v2dv17/to_what_extent_did_normans_identity_as_norse.json": "9世紀半ば、フランス国王は、このような事態を防ぐための最良の方法を考え出した。\nバイキングがセーヌ川を荒らすのを防ぐには、バイキングを河口に常駐させるのが一番だと考えた。\nバイキングをセーヌ川の河口に常駐させ、土地と称号で彼らの忠誠心を買い取ることである。これがノルマン人である。ノルマン人\nノルマン人はその後、かなりの成功を収め、...",
  "data/reddit-ask/r/NoStupidQuestions/comments/v2e999/is_it_possible_to_shit_yourself_while_delivering.json": "出産時に穴を絞るときにも絞るのでしょうか？\n肛門を圧迫するのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/v2ca2i/did_frontier_people_in_ancient_times_speak_hybrid.json": "キングダム・オブ・ヘブン」を観たのですが、この映画の中で十字軍の騎士が「サラム・アライクム」と\nサラム・アライクム」と挨拶するシーンがありました。まず最初に思ったのは 「これは歴史的に正しいのだろうか？\n歴史的に正確なのか、彼らはそんな風に話していたのか？私はスペイン人で、スペインとモロッコの\nスペインとモロッコが交わる南部では、珍しいことではありません。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v29xlb/is_it_homophobic_or_whatever_to_dislike_the_lgbtq.json": "LGBTQの人たち自身が良い人であれば、どうということはない。\n良い人なら好き。悪い人たちなら、好きじゃない。ただ、このコミュニティ全体が好きではないのです。\nコミュニティ全体が嫌いなんだ。有害で、一般的なグループは好きではありません。\n\n(グループというのは、その中にいる人たちではなく、グループのアイデアのことです）。\n\nそして...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v2gguh/why_do_so_many_people_believe_that_you_cant_be.json": "白人を差別してはいけない』という考え方は、以前からありましたね。\nなぜ多くの人がそれを信じているのか、困惑している。私がこのことを議論すると、彼らはいつも\n白人はアメリカ人なのかイギリス人なのか？それ以外の国もたくさんあるのに。\nそれ以外の国もたくさんあるのに。? また、彼らは、「アメリカ人」「イギリス人」という括りで考える傾向があります。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v2cs44/if_someone_is_homophobic_racist_sexist_etc_and.json": "ソーシャルメディアにアクセスすると、多くの人々がそのようにお互いを描写しようとしているのがわかります。\n多くの人々が、お互いをそのように描写しようとしています。私の疑問は、なぜ私が、母親の地下室で見知らぬ人がホモフォビアや暴言を吐いたとしても\nホモフォビア（同性愛嫌悪）やレイシスト（人種差別）であることを気にする必要があるのか、ということです。もし、あなたがそれを自分の中だけに留めておくのであれば\nもしあなたがそれを自分の胸にしまっておくなら、私の意見は、あるコミュニティに対するあなたの考えについて...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v2npfu/why_are_half_the_questions_on_this_subreddit_just.json": "\"なぜ人々はクリス・ロックに怒っているのか？ウィル・スミスが過敏になっているだけでは？\n敏感になっているだけではないか？\"同感だ\"\n\n\"スーパーヒーロー映画が多すぎると感じる人はいますか？\" 「ええ、私はそう思います\n\n\"なぜドナルド・トランプはこんな馬鹿なことをするんだ？\" \"彼が馬鹿だから\"\n\n\"私が[政治的に正しくない意見]を信じてもいいのですか？\"...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v2kgzk/how_can_someone_be_both_nonbinary_and_gay.json": "高校を一緒に卒業した人が、今は \"ゲイ・ノンバイナリー \"と名乗っているんです。もし\nノンバイナリーとは、どちらの性にも当てはまらないという意味で、ゲイとは、同性に惹かれるという意味です。\nゲイとは同性に惹かれるという意味だとして、どうして同時にその両方になれるのでしょうか？",
  "data/reddit-ask/r/askscience/comments/v2glh3/why_arent_the_subspecies_of_brassica_rapa_just.json": "亜種と種の違いってなんだろうということですね。\n少なくとも植物の世界では 明確な区別があるのでしょうか？",
  "data/reddit-ask/r/AskWomen/comments/v2gpmm/what_is_sex_after_a_hysterectomy_like.json": "オーガズムはやはり満足できるものなのでしょうか？完治した後、ラフなセックスができるようになりましたか？\nできますか？もしそうなら、その状態になるまでにどれくらいの時間がかかりましたか？不快に感じる体位はありますか？\n不快に感じたり、避けなければならない体位はありますか？の恐怖を乗り越えられましたか？\nカフが切れるという恐怖は克服できましたか？合併症はありましたか？",
  "data/reddit-ask/r/AskHistorians/comments/v2ohrp/why_did_someone_put_a_shoe_in_the_wall_of_a_200.json": "リフォームの際、築200年の家の壁から古い靴を発見し\nを見つけた。なぜ、その靴が壁の中に入っていたのか、その理由を知りたいのです。\n情報を探しています。他にどのようなサブディットを試せばよいでしょうか。\n[https://www.reddit.com/r/shoes/] は適切ではないような気がします..."
}