{
  "data/reddit-changemyview/r/changemyview/comments/ovkd6d/cmv_funeral_directors_and_funeral_industry.json": "COVIDで死んだ人はどこに行くと思いますか？人は毎日死んでいます。\nしかし、この事件が始まって以来、葬儀場は大忙しです。\n葬儀屋さんは大忙しです。皆さんが聞いたことがあるのは、膨大な数の遺体が冷蔵保存されているということくらいでしょうか。\n冷蔵トラックに入れなければならないので...",
  "data/reddit-changemyview/r/changemyview/comments/ovnnye/cmv_white_collar_dress_codes_have_no_practical.json": "ブルーカラーの労働者が防護服を着るのは理にかなっている。表計算ソフトを作るのに、特別なスーツは\nスプレッドシートを作るのに特別なスーツは必要ありません。これに反して、私が見た一般的な議論は、次のようなものでした。\nスーツを着ると生産性が上がるという研究結果がある」というものです。\n生産性が向上するという研究結果がある。しかし、これらの研究はあくまでも...",
  "data/reddit-changemyview/r/changemyview/comments/ovr20r/cmv_pop_tarts_should_have_individually_labeled.json": "トーン編集：これは本当に私の見解ですが、軽い気持ちで書いています。Kellogg社に怒っているわけではなく\nただ純粋に、食べ物は認識できるものであるべきだと考えています。\n箱から出しても見分けがつくようにすべきだと思っているので、同じように困惑しています。\nなぜこの商品にはそのような表示がされていないのでしょうか？とはいえ、私は...",
  "data/reddit-changemyview/r/changemyview/comments/ovziw0/cmv_cnn_is_at_a_point_where_it_should_no_longer.json": "最初に言っておきたいのは、このような問題を抱えているのはCNNだけではないということだ。\nアメリカのニュースソースの大半が、これから説明するのと同じ問題を抱えている。\nしかし、この4年間でCNNは最悪の状態になっている。私は毎日、主要な情報源をすべてチェックしている。\n私は主要な情報源を毎日チェックしている（FOX、CNN、NYT、ロイター、ABC、MSN、AP...）。",
  "data/reddit-changemyview/r/changemyview/comments/oviv9x/cmv_reddit_makes_money_off_of_mentally_ill_people.json": "\"They do it for free\"\n\nこのミームをご存知かどうかわかりませんが、これはインターネット上の\n報酬なしで行っていることを指します。表面的には、これは\n表面的には否定的なことを言っているように見えますし、私もそう思いますが、その点にも同意します。\nしかし、その点にも同意します。\n\n数え切れないほどの...",
  "data/reddit-changemyview/r/changemyview/comments/ovxkci/cmv_if_we_need_covid_lockdowns_then_we_need_the.json": "誤解のないように編集すると、これはアンチロックダウンのCMVであり、より厳しい国境管理ではない。\nコントロールです。選挙で選ばれた政府は、政府が展示を行う場合、「自分の安全のために」合法的な市民の自由を奪うべきではありません。\nもし政府が不法な国境通過によるCovidの拡散を防ぐために故意の違法行為を行った場合、我々が選んだ政府は合法的な市民の自由を「自分たちの安全のために」奪うべきではない。\n違法な国境通過によるCovidの蔓延を防ぐために、政府が故意の違法行為を行ったとしても、選挙で選ばれた政府は、合法的な市民の自由を「自らの安全のために」奪うべきではない。繰り返しになりますが、私は...",
  "data/reddit-changemyview/r/changemyview/comments/ow1uq2/cmv_not_revealing_transgender_status_regardless.json": "ここのユーザーとの議論に触発されて。\n\n\n\n現在、私は外科的な手術を受けた人が、その人の体の中にいるとは思っていないという事実は完全に無視しましょう。\n私は手術で作られた性器が「自然」のものと比べて識別できないとは思っていませんが、これを完全に無視して\nこれを無視して、全く見分けがつかないということにしましょう。\n\n\n\nそれでは...",
  "data/reddit-changemyview/r/changemyview/comments/ow1amu/cmv_christianity_and_all_its_branches_have.json": "うん、ほとんどタイトル通りだね。宗教、特にキリスト教は\n特にキリスト教は、自分の聖書を事実だと思い込む心の狭い人たちを大量に生み出しました。\n心の狭い人たちを生み出してきました。もし、彼らが同意できないことがあって、それを裏付けるものを聖書の中に見つけることができれば\nそれを裏付ける聖書の記述を見つけても、彼らの考えを変えることはできません。I...",
  "data/reddit-changemyview/r/changemyview/comments/ow2n0t/cmv_jordan_peterson_is_the_most_willfully.json": "私が彼に興味を持ったのは、2016年に彼を例える見出しを次々と目にしたときでした。\n彼をヒトラーになぞらえた見出しや、人種差別主義者、女性差別主義者、トランスフォビック、ホモフォビックなどと言及した無数の記事を目にしたときです。\n差別主義者、女性差別主義者、トランスフォビック、ホモフォビックなど、数え切れないほどの記事を目にしたのがきっかけです。「これは面白い読み物になりそうだ。\n私は、「これは面白い読み物になりそうだ」と思って、彼のドキュメンタリーを見始めました。",
  "data/reddit-changemyview/r/changemyview/comments/ovyyii/cmv_fast_fashion_is_the_cause_of_severe_negative.json": "Shein、Zara、Topshopなどのファストファッションブランドは、環境問題の大きな原因となっています。\n安価で質の悪い、高額な商品を大量に生産した結果、環境問題が深刻化しています。\n品質の悪い使い捨ての衣料品を大量に生産した結果、環境問題の大きな原因となっています。ファッション業界全体では、800億円の利益を生み出しています。\nこれは地球上の一人当たり10着以上に相当します。これは、地球上の一人当たり10着以上に相当します。",
  "data/reddit-changemyview/r/changemyview/comments/ovvyys/cmv_heroin_should_not_be_a_drug_legally.json": "非犯罪化・合法化されるべき娯楽薬物は絶対にあります。\nマリファナは最も有名な例です。\n\nヘロインは、責任を持って使用すれば何の問題もないので、合法化すべきだという意見を聞いたことがあります。\n責任を持って使用すれば問題はないからです。\n\n私がヘロインに反対する主な理由は、個人的な経験からです。あるとき...",
  "data/reddit-changemyview/r/changemyview/comments/ovmgkt/cmv_extremely_overpowered_characters_especially.json": "私は正直、この点ではワンパンマンが好きです。\n不死身の神ではつまらないと知っているから、他にもいろいろとぶっ飛んだことをストーリーでやっている。\nストーリーです。\n\nDBZやジョジョと比べると、キャラクターが耐えられないほどのパワーを持っていて\n比べてみると、なんだか...つまらないですよね。あなたは、すべての...",
  "data/reddit-changemyview/r/changemyview/comments/ow58xl/cmv_mental_health_awareness_usually_focuses_on.json": "かなり書いてありますね。メンタルヘルスへの関心を高める」「メンタルヘルスに配慮する」などの言葉を聞くたびに\nメンタルヘルスに関心を持つ」とか「メンタルヘルスに配慮する」とか、そういう言葉を聞くたびに\n不安やストレス、軽度のうつ病などを意味しているように感じます。\n精神的な病気は、私は...と感じています。",
  "data/reddit-changemyview/r/changemyview/comments/ow6eh8/cmv_the_vitriol_towards_simone_biles_is_complete.json": "マスクに関して、アメリカの多くの人々が精神的苦痛を与えると主張しているのは驚きではないでしょうか。\n精神的苦痛を与えると主張しています。銃乱射事件になると、アメリカの大部分の人がすぐに\n銃乱射事件となると、アメリカの大部分の人はすぐに銃を撃った人の精神状態を指摘します。\n.... たとえ犯人が以前に診断を受けていなくても...",
  "data/reddit-changemyview/r/changemyview/comments/owfwpy/cmv_many_people_who_support_diversity.json": "まず、私のタイトルに「多くの」という言葉があることに注目してください。\nすべての人に当てはまるわけではありません。しかし、私は多くの人に当てはまると考えています。\n\n違法な人間はいない」「国境はない」などの概念を支持する人の多くは、偽善者であり、自分のためだけに信じていると思います。\n違法ではない」「国境はない」といった概念を支持している人の多くは偽善者であり、国のためにしか信じていません。\n国のためだけに信じているのです。",
  "data/reddit-changemyview/r/changemyview/comments/owhxzx/cmv_aliens_are_not_the_most_likely_explanation.json": "アメリカ空軍が大量のUFO報告書を機密解除して、未確認空中現象は政府が知っている実在のものであると認めたからです。\n未確認空中現象は政府が知っていて追跡している現実のものであると認めて以来\nしていることを認めて以来、私はたくさんのポッドキャストを聴き、たくさんの記事を読みました。\nこの問題に関する記事を何度も読みました。その中で、私がとても苛立たしいのは...",
  "data/reddit-changemyview/r/changemyview/comments/owi1kf/cmv_its_understandable_that_the_church_of_jesus.json": "彼らはモルモン書と呼ばれる別の聖典を持っています。\n教会と神殿があり、忠実なメンバーだけが入ることができ、神、イエス・キリスト、聖霊が三位一体であると信じています。\n神、イエス・キリスト、聖霊は3つの独立した存在であると信じています。他にも様々な\n他にも、彼らの信仰の一部であり、独自のものがたくさんあります...。",
  "data/reddit-changemyview/r/changemyview/comments/owl8q3/cmv_my_wife_shouldnt_get_the_2nd_dose_of_the.json": "タイトルでだいたいわかるでしょう。私たちは妊娠初期で、妻が2回目のファイザーワクチンを\n妻がまだ妊娠初期の段階で、ファイザー社のワクチンの2回目の接種を受けるべきかどうかを決めようとしています。\n判断しています。\n\n私たちはイギリスに住んでいますが、二人とも自宅で仕事をしていて、今のところ社会的に多くの人と会うことはありません。\n今のところ、社会的に多くの人と会うことはありません。",
  "data/reddit-changemyview/r/changemyview/comments/owptbx/cmv_there_is_no_evidence_that_the_officer_who.json": "今、r/news [/r/news]のトップニュースのひとつに、今週自殺した警官の話があります。\n先週、自殺した警官についてです。\n[https://www.cnn.com/2021/08/02/politics/dc-metropolitan-police-officer-suicide-january-6-capitol-riot/index.html].\nCNNの記事では、動機は明らかにされていませんが、大きく示唆しています。",
  "data/reddit-changemyview/r/changemyview/comments/owts1z/cmv_if_you_are_an_adult_male_living_alone_you.json": "つまり、これはかなり基本的なものなので、基本的には上に書いてある通りです。しかし、私の\n私の主な理由は以下の3点です。\n\n\n\n石鹸ですぐに洗える（尿は無菌状態ではありませんが、細菌の数は非常に少ないです。\n尿は実際には無菌ではありませんが、細菌レベルは非常に低いです）。)\n\n\n\n股間の高さにあるので、「欠ける」ことがない。\n\n\n\n膨大なコストを削減できる。",
  "data/reddit-changemyview/r/changemyview/comments/owt3tc/cmv_if_naturopaths_chiropractors_and_osteopaths.json": "3人の「代替」医療従事者はいずれも、西洋の証拠に基づく医療と疑似科学の両方を利用しています。\n西洋の証拠に基づく医学と疑似科学の両方を利用しています。もし彼らが、効果が証明された治療法だけを利用していたら\n効果が証明された治療法だけを利用していれば、もはや疑似科学を実践することはないでしょう。\n\nこれらの疑似科学がなければ、彼らの診療範囲は...と同じになります。",
  "data/reddit-changemyview/r/changemyview/comments/ox7mp8/cmv_we_should_not_allow_media_companies_to_run.json": "私がそう考える主な理由は以下の通りです。\n\n 1. 現在の大統領選の討論形式は、冗談のようなもので、国の恥となっています。\n    私たちの国の恥です。参加者は口を挟むことを許されるべきではない。\n    参加者は他の参加者より多くの質問をされるべきではありませんし、参加者は\n    許されるべきではない...",
  "data/reddit-changemyview/r/changemyview/comments/ox8lj0/cmv_there_is_no_such_thing_as_mansplaining_people.json": "参考までに、私は男性で、毎日のように仕事場で、私がすでに知っていることを説明しようとする人に目を丸くしています。\n私は男性ですが、職場ではほとんど毎日のように、私がすでに知っていることを説明しようとしたり、全く知識のないトピックで議論しようとする人たちに目を見張ります。\nUX/UI/デザイン）の専門家であるにも関わらず、全く知識のないトピックについて説明しようとする人たちに目を見張ることがあります。\n\nそこで私は、おそらく女性に多く見られることだと思いますが、これは...",
  "data/reddit-changemyview/r/changemyview/comments/ox73e0/cmv_who_you_go_on_holiday_with_is_more_important.json": "憧れの国や豪華なリゾート地、活気あふれる大都会に行っても\nあなたの会社が重要なのです。このような人たちと一緒に休暇を過ごすことを想像してみてください。\n彼らがやりたいことをすべて盛り込んだリストを持っているのに、あなたはそれに同意せず\nむしろ自発的にその場所を歩き回りたいと思っています（またはその逆）....",
  "data/reddit-changemyview/r/changemyview/comments/oxa6cu/cmv_when_public_companies_are_convicted_of_crime.json": "企業が犯罪行為で罰金を科せられるたびに、それがコストとして認められてしまう。\nビジネスを行う上でのコストとして受け入れられています。限界利益はわずかに減少し、あるいは\n罰金はすでに予想されていて、事前に配分されていることもあります。\n単なる賄賂と同じです。法律を持つ意味があるのか、もし...",
  "data/reddit-changemyview/r/changemyview/comments/oxf4hd/cmv_changing_homeless_people_to_unhoused_people.json": "私は大学のディベート部に所属していて、積極的にリベラルな大学に進学したばかりです。\n私がすでに怒鳴られたことのひとつは、ホームレスの人たちをそう呼ぶことでした。\n人々のことを「ホームレス」と呼ぶことです。彼らは私にunhouse individualsやpeople without housingと言って欲しいのです。\n住居のない人たち。これは非常に意味深で些細なことだと感じました。その理由は...",
  "data/reddit-changemyview/r/changemyview/comments/ox63re/cmv_it_doesnt_make_sense_to_compare_the_george.json": "数ヶ月前、このサブサイトでは、日本での暴動の影響についての記事がいくつかあったのを覚えています。\nジョージ・フロイドが殺された後の暴動は、1月6日に米国で起きた暴動よりもひどいという内容の投稿がいくつかあったのを覚えています。\nこのサブサイトでは、ジョージ・フロイド殺害後の暴動は、1月6日の連邦議会議事堂襲撃よりもひどいという投稿がいくつかありました。たいていの場合、その論理は次のようなものでした：「たった5人しか死んでいない。\n1月6日に国会議事堂で死んだのは5人だけで、実際にはほとんど...",
  "data/reddit-changemyview/r/changemyview/comments/oxjabt/cmv_politicians_should_all_be_given_the_same.json": "私は10代の頃からこの考えを持っていましたが、最近の別のcmvでの\n最近のcmvでは、政治的な討論会について思い出しました。\n\n選挙はお金で買えるということは、かなり広く知られています。これは、必ずしも\n金持ちの候補者が必ず勝つというわけではありませんし、お金をたくさん持っているクソみたいな候補者が\n金持ちの候補者が必ず勝つとは限らないし、金持ちのクソ候補者が必ず勝つとも限らない...。",
  "data/reddit-changemyview/r/changemyview/comments/oxabk3/cmv_i_shouldnt_have_to_wear_a_mask_if_im.json": "予防接種を受けていれば、マスクをしなくてもいいはずなのに。私は予防接種を受けたので\nその必要はありませんでした。私は州のマスク着用義務に基づいてマスクを着用しました。決められたルールに沿って行動しました。\nパンデミックの最初の1年ほどは、ルールを守って行動していました。\n\nマスクもしない、予防接種も受けない人は、病気になっても気にしないのは明らかです。\n彼らが示したのは...",
  "data/reddit-changemyview/r/changemyview/comments/ox7og9/cmv_no_scrap_yard_or_buyer_should_be_allowed_to.json": "触媒コンバーターの購入は、スクラップ業者が身分証明書と触媒コンバーターと一致する車のタイトルを提示しない限り、法的に認められません。\nスクラップ業者が触媒コンバーターと一致するIDと車のタイトルを提供しなければ、触媒コンバーターを購入することは法的に認められません。あまりにも多くの\n多くの人が触媒コンバーターを盗まれています。\n数百ドルにもなる高価な修理につながるのです。その結果、車が...",
  "data/reddit-changemyview/r/changemyview/comments/oxde88/cmv_removing_an_artist_from_music_festivals_youve.json": "(主題がそれに関連しているので、修辞的効果のために無修正の投稿) だから\nこれは、複数のフェスティバルがDababyをキャンセルしたことに直接反応したものです。最初に言わせてください。\n最初に言っておきますが、彼の発言について、あなたが思想的にどこに着地するかはどうでもいいのです。\nそれは私の見解の根拠ではありません。これは純粋に、充電...",
  "data/reddit-changemyview/r/changemyview/comments/oxjr0k/cmv_if_reddit_is_going_to_ban_subs_like_rmgtow.json": "なぜredditがmgtowを禁止したのか理解できる、あれはalt righterの吐き出しでいっぱいだったから\n憎しみをまき散らしていました。しかし、mgtow2も禁止されましたが、これは全くそのようなレベルではありませんでした。\nした。私が言いたいのは、もしredditがこれらのサブカルチャーを、性差別的であったり\n否定的なことを言っているとかで禁止したいのであれば...",
  "data/reddit-changemyview/r/changemyview/comments/oxr10e/cmv_the_problem_isnt_that_lizard_people_are.json": "私は、様々な政府をトカゲ人間が牛耳っているという興味深い陰謀論を知っています。\nアメリカなどの政府をトカゲ人間が牛耳っているという面白い陰謀論を知っています。\n\n常に、彼らがトカゲ族であるがゆえに、特に悪いことであるという前提で動いています。\nトカゲ人間だから悪いという前提で話が進んでいきます。これは心が狭く、不快なことです。私たちは偏見を持つべきではありません。\n偏見を持つべきではありません...",
  "data/reddit-changemyview/r/changemyview/comments/oxruv5/cmv_the_amount_of_black_peoplesites_on_social.json": "私自身もブラックです。ブラック・ツイッター」と呼ばれるものをたくさんフォローしています。そして\n率直に言って、多くのサイトが、DaBabyが音楽祭から追い出されるのは\nDaBabyが音楽祭から追い出されるのは間違っていると言っているサイトが多いのにはうんざりです。彼らは言論の自由を主張しています。\n言論の自由がどうのこうのと。\n\n彼が暴言を吐いたという事実は、...",
  "data/reddit-changemyview/r/changemyview/comments/oxw38p/cmv_nycs_vaccine_mandate_on_restaurants_gyms_is.json": "政府は国民の安全を守るために法律を制定しています。このケースでは、政府は\nこの場合、政府がこのような環境でワクチンを要求することは、市民の安全を守るために正当化されます。\nこの場合、政府がこれらの施設でワクチンを要求することは、全体的なコビドの蔓延を阻止し、これらの施設の利用者を保護するために正当化されます。\n\nシートベルトの例えがあります。法律では、あなたは...",
  "data/reddit-changemyview/r/changemyview/comments/oy0u2v/cmv_driving_tests_should_be_required_every_2.json": "高齢だけでは運転免許証を取り消す理由にはなりませんが、加齢に伴う身体や認知機能の低下がある方は\n反射速度の低下や視力の低下など、加齢に伴う身体的・認知的な問題を抱えている方は\n視力の低下など、加齢に伴う身体的・認知的な問題を抱えている人は、公共の場や自分自身に危険をもたらします。現在のところ\n現在、米国では、運転免許の再取得が義務付けられています...",
  "data/reddit-changemyview/r/changemyview/comments/oy2cxm/cmv_ubi_is_a_good_idea_and_should_be_implemented.json": "工業化時代以前は、誰もが自分の手や足を使って、物を育てたり\n作って、売って、食べ物と交換して......と、生きていけた。しかし、現在では\n世界は急速に変化し、指数関数的に効率が上がり、人々は職を失い、生活の糧を得ることができなくなりました。\n仕事を失い、生活の糧を得ることができません。これでは・・・。",
  "data/reddit-changemyview/r/changemyview/comments/oy8oy6/cmv_if_the_government_wasnt_so_untrustworthy_we.json": "みんなが相手を叩いているのを見ていると、まるで自分たちがこの状況を作ったかのように\n自分たちでこの状況を作ったように。科学的な根拠があって、みんなにワクチンを接種させようとしていることは理解しています。\nワクチンを接種して、みんながより良い生活を送れるように、そして元の生活に戻れるようにしたいという気持ちはわかります。しかし、私は\nしかし、これは政府の責任でもあると考えざるを得ません...。",
  "data/reddit-changemyview/r/changemyview/comments/oyay4x/cmv_private_businesses_requiring_proof_of.json": "民間企業や店舗がマスクや予防接種の証明書を要求しても、文句を言う権利はありません。\nマスクや予防接種の証明を要求されても文句を言う権利はありません。企業は\nマスクや予防接種証明書を提出しない人にはサービスを提供しないことで、予防接種を促進することは\nこれは、パンデミックを終わらせるための良い一歩だと思います。I...",
  "data/reddit-changemyview/r/changemyview/comments/oyhysw/cmv_no_one_should_be_canceled_for_a_past_mindset.json": "キャンセルが先ではなく、教育が先ではないでしょうか。誰もがそう思うでしょう。\nそうでしょうか？ここでのいくつかの例は、私にとって最も身近なものであるため、リベラルに偏っているかもしれません。\n政治的な議論をするつもりはありません。\nこれは政治的な議論をしたいのではなく、一般的なトピックである瞬間的なキャンセル...",
  "data/reddit-changemyview/r/changemyview/comments/oyk6lq/cmv_cultural_appropriation_is_not_a_thing_and_we.json": "自動起動されてしまうものもありますが、最後まで聞いてください。\n\n私が言いたいのは、こういうことです。私は常に、「文化的流用」が何であるかを理解せずに、「文化的流用」を訴えようとする人を見てきました。\nそれが何であるかを理解せずに、あたかも自分が怒られるべき文化の「擁護者」であるかのように\n怒らせるべき文化の「擁護者」であるかのように振る舞っています。それは典型的な\n一部のSJWと...",
  "data/reddit-changemyview/r/changemyview/comments/oy33e4/cmv_video_games_should_not_restrict_people_from.json": "正直なところ、シムズについての投稿を見て、誰かが彼らのゲームで子供を殺して\nしているのを見て、面白いなと思いました。しかし、その後私は\n最初の世代で死んでしまった子供を削除して、その代わりに\n私が思ったのは・・・。",
  "data/reddit-changemyview/r/changemyview/comments/oysool/cmv_police_vehicles_should_not_be_allowed_to_be.json": "パトカーが黒くて文字が濃くて識別しづらいのは\n私にとっては、警察は犯罪を防ぐために存在するのではなく、犯罪者を捕まえるために存在していると言っても過言ではありません。\n警察は犯罪を防ぐためにあるのではなく、犯罪を起こしている人を捕まえるためにあるのです。覆面パトカーには問題はありません。\n覆面パトカーは問題ありませんが、交通課のパトカーは・・・。",
  "data/reddit-changemyview/r/changemyview/comments/oysc4o/cmv_i_am_right_to_be_cynical_about_democracys.json": "私は、アメリカにおける民主主義の見通しについて、とても、とても、とてもひねくれています。日を追うごとに\n民主主義の終焉へのカウントダウンのチェックマークのように感じています。民主主義の\n民主主義を守ることは、私にとって、何よりも重要な課題です。\nなくてはなりません。そして、その防衛は...哀れ？トークン？少ない...",
  "data/reddit-changemyview/r/changemyview/comments/oynfn0/cmv_companies_who_ask_to_receive_a_bailout_should.json": "私のアイデアをさらに発展させると、この連邦政府が保有する株式は\nこの連邦政府が保有する株式は、25年などの長期にわたって譲渡できないようにします。例えば、もしGM\nが今までに受けたのと同じ額（50ドル、25ドル）で救済されたとします。\n(連邦政府が保有するGMの株式は約931,436,276株となります。",
  "data/reddit-changemyview/r/changemyview/comments/oy8zsi/cmv_eviction_is_not_violence.json": "Video [https://twitter.com/TeamAOC/status/1422287825521844225?s=20]\n\n立ち退きは暴力だと主張するAOC。\n\n私はそうは思いません。立ち退きが暴力的になることはありますか？もちろんです。\n\nしかし、自分が所有していない土地から誰かを追い出すことは、暴力的な行為ではありません。\n暴力ではありません。立ち退きは、手紙や口頭での簡単なものですが...。",
  "data/reddit-changemyview/r/changemyview/comments/oz1r0w/cmv_democracy_doesnt_work_because_people_are.json": "前置きが長くなりましたが、これを政治的な議論にしたくはありません。\nいかなるものでもありません。どちらかというと、民主主義の概念についての一般的な議論です。\n理論的には、誤った情報や無知な国民は、自らに大きなダメージを与えることができます。\n誤った情報や無知な国民は、政府や政権に投票することで、自分や他人に大きな損害を与えることができます。",
  "data/reddit-changemyview/r/changemyview/comments/oyo3q6/cmv_love_is_a_decision.json": "私は最近、愛の意味をここで反芻していましたが、結論としては\n愛とは、誰かや何かを自分よりも大切にするために、日々決断することだと思います。\n愛とは、誰かや何かを自分よりも大切にするために、日々決断することだと思います。\n\n他の人たちと議論していると、口語的な愛の定義がいかに多様であるかがわかります。\n愛の口語的な定義がいかに多様であるかがわかりました。",
  "data/reddit-changemyview/r/changemyview/comments/oz8dvj/cmv_almost_all_our_decisions_involve_some.json": "更新：より良いタイトルは、「ある程度操作されていても、合意されていないことにはならない」です。\n合意されていないことにはならない」です。\n\nインターネット上で、「ああ、でも（彼/彼女）は権力のある立場にいたから、本当は合意ではなかった」というようなことを言っている人を見るたびに\nそれがセックスについてであれ、他の決定についてであれ\nセックスにしても、その他の判断にしても、...",
  "data/reddit-changemyview/r/changemyview/comments/ozczlt/cmv_claw_machines_and_similar_should_disclose_odds.json": "昨日、このマシンの数々を見て思ったのだが、このマシンがディスクにならない理由があるのだろうか？\n確率を公表しない理由があるのかどうかを知りたい。爪とぎ機は、確か\n爪とぎ機は、機械が利益を得るのを確実にするために、ほんのわずかな時間だけ全力でおもちゃを掴むことで機能します。\n利益を得ることができるようになっています。もし、例えば、...",
  "data/reddit-changemyview/r/changemyview/comments/ozalh9/cmv_hyperloops_or_other_sort_of_tracked.json": "アメリカでは、すぐに（来世紀くらいに）飛行機の代わりに地上の交通機関（レール式やチューブ式）が使われるようになるとは思えません。\nアメリカでは、すぐに（来世紀かそこらに）飛行機の代わりになることはないと思います。\n\n私はアメリカを対象としていますが、これは私たちが小規模なプロジェクトで直面している問題を基にしています。\n小さなプロジェクト 政治、環境学、労働組合、土地...。",
  "data/reddit-changemyview/r/changemyview/comments/ozjrix/cmv_police_turning_of_body_camera_should_be.json": "警官のボディカムの映像や音声が、特に活動中に手動でオフにされたことが証明された場合は\nていたことが証明された場合、最初の違反は何ヶ月もの厳しい無給の停職処分とな\n最初の違反は、何ヶ月もの厳しい無給の停職処分とすべきです。2回目の違反は\n2回目は自動的に解雇され、不正操作の罪に問われるべきです。",
  "data/reddit-changemyview/r/changemyview/comments/ozttfn/cmv_guns_are_not_the_cause_of_crime.json": "だから私は、銃があるからといって場所が悪くなることはないと思っています。私は、銃が\nより危険な場所にしてしまうとは思いません。\n\n他の社会問題や健康問題の上に銃があると、より大きな問題になると思います。\nしかし、銃はそれだけでは問題になりません。\n\nアメリカで最も危険な都市を見てみましょう。デトロイト、セントルイス、...。",
  "data/reddit-changemyview/r/changemyview/comments/oztnxg/cmv_the_extended_policy_that_landlord_cant_evict.json": "1ヶ月とか2ヶ月とかならいいんですが、この方針は長すぎます。\nしかし、この方針はあまりにも長く続いています。私は個人的には家主ではなく、家を一軒しか持っていません。\nしかし、もしあなたが他の物件を所有しているのであれば、例えばお金を払って購入したのであれば、そこに住む人を管理することができるべきだと思います。\n誰がそこに住むかを管理できるはずです。\n\n賃借人が家賃を払わない場合、...",
  "data/reddit-changemyview/r/changemyview/comments/p01ajm/cmv_most_people_in_our_society_still_look_down_on.json": "私の考えでは、社会のほとんどの人が、生きている間に精神疾患を患った人を見下しています。\n社会のほとんどの人は、生きている間、精神疾患に苦しむ人を見下していると思います。しかし、もし誰かが精神疾患のために自殺した場合\n社会の多くの人は、生きている間は、精神疾患の人を見下しています。\n社会の多くの人は、突然、心から悪いと思うようになります。\n\n私の考えをもう少し詳しく説明すると...。",
  "data/reddit-changemyview/r/changemyview/comments/p00954/cmv_theres_nothing_wrong_or_unhealthy_with_living.json": "私は高機能自閉症を患っていますが、世界には私のような障害を持っていても、友達を作って社交的になれる人がいます。\n私は高機能自閉症を患っていますが、世界には私のような障害を持つ人でも友達を作って社交的になれる人がいます。\n私は高機能自閉症を患っています。\n\n基本的に私は内向的な人間で、人に興味がありません。私が\n無理に人付き合いをしようとすると、私はまるで......。",
  "data/reddit-changemyview/r/changemyview/comments/p052ob/cmv_collecting_unemployment_and_bypassing.json": "私の理解では、失業は雇用喪失の津波を防ぐために存在しています。\n社会にお金が流れるようにするために存在しています。\n\nしかし、これは保険でもあります。そのために人々はお金を払うのです。\n\nもし私が2021年製のメルセデス・ベンツに乗っていて、契約でカバーされている自然現象のために全損したとしましょう。\n契約でカバーされていたとしても...",
  "data/reddit-changemyview/r/changemyview/comments/p0139j/cmv_people_shouldnt_consider_religion_as_part_of.json": "このことについては、おそらく非難されることになるでしょうが、私は純粋に\n理解できないことがあります。\n\nなぜ誰もが宗教を自分のアイデンティティの一部だと考えるのでしょうか？それは\n宇宙、精神性、倫理、神、超自然的要素などに関する主張の集合体です。\n\nなぜ誰もが束になって...",
  "data/reddit-changemyview/r/changemyview/comments/p06twi/cmv_i_dont_think_its_always_justified_to_cancel.json": "まずは、ケビン・ハートから。2018年、ケビン・ハートが アカデミー賞の司会を務めることになったとき\n2009年から2011年にかけての一連の同性愛嫌悪のツイートが再浮上し、それが原因で結局\n彼は退任しました。これが正当化されたかどうかはわかりません。彼がこのようなコメントをしたのは、7～9年前のことです。\n彼は7～9年前にそのようなコメントをしており、彼は変わってしまったのかもしれません。彼らは...",
  "data/reddit-changemyview/r/changemyview/comments/p0aa72/cmv_its_the_retail_restaurant_and_fast_food.json": "ここでの私の意見は賛否両論です。PUAを収集していた人たちは、自分の国に戻って\n親元に戻ってPUAを集めた人、そのお金を使って何とか自分を高めようとした人、そして今では小売店やファーストフード、レストランで働く必要がなくなった人。\n小売店やファーストフード、レストランで働く必要がなくなった人と、PUAで得たお金を貯め込んでいる人です。\nPUAで得たお金を貯め込んでいる人と...。",
  "data/reddit-changemyview/r/changemyview/comments/ozwh82/cmv_there_should_be_an_age_limit_after_which_you.json": "12歳の子供がオリンピックに参加して優勝するのは素晴らしいことです。\nしかし、私はそれが許されるべきではないと思っています。オリンピックは大きなプレッシャーがあります。\n経験豊富な選手と戦うことは、子供たちにとって良くないことだと思います。\nオリンピックは大きなプレッシャーがあります。\n\n私が見た国では、アスリートたちは訓練を受けなければなりませんでした...。",
  "data/reddit-changemyview/r/changemyview/comments/p0e1le/cmv_attempts_by_americaeurope_to_instill.json": "21世紀は、西欧諸国が民主主義を広められないという壊滅的な失敗によって定義されました。\n民主主義を広めることができなかったことです。イラクへの侵攻やリビアへの介入は、漠然とした不十分な定義を用いています。\n漠然とした自由の概念を利用して、国家組織の破壊を行いました。\n漠然とした自由の概念を用いて、国家組織を破壊し、宗派間の争いを引き起こした。",
  "data/reddit-changemyview/r/changemyview/comments/p0dx3w/cmv_cannabis_should_be_legalized.json": "Okay a classic: これが一般的な意見であることは承知しています。私は、この\n私にとっては非常に明確なことなので、この記事を使って、異なる視点から物事を見てみたいと思います。\n大麻は合法化されるべきだと思います。\n特にアルコールやタバコがこれほどまでにフェティシズムを帯びているならば。あるいは、すべてを禁止すべきです。\n\nここでは...",
  "data/reddit-changemyview/r/changemyview/comments/p0gwds/cmv_animal_cruelty_negligence_and_especially.json": "動物が放置されたり、虐待されたり、時には拷問されたりしているビデオを見たことがあります。\n拷問されている映像を見たことがあります。酷いものです。罰則がほとんどないというのも信じられません。\nある男が動物を拷問しているビデオがありましたが、彼が受けたのは2ヶ月の懲役だけでした。\n懲役2ヶ月でした。\n\nまだ信じられないのは、もっと多くの懲役をもらえるということです...。",
  "data/reddit-changemyview/r/changemyview/comments/p0lldy/cmv_the_atomic_bombings_were_the_correct_move_and.json": "原爆投下は、道徳的に見ても、軍事的に見ても、とにかく右の\nの行動です。\n\n道徳的には、200万人の中国人を死なせるよりも、20万人の日本人を殺す方が良いでしょう。\n道徳的には、200万人の中国人を死なせるよりも、20万人の日本人を殺した方がいい。日本は大規模な戦争犯罪を犯していました。\n推定値を低く見積もっても、それは...",
  "data/reddit-changemyview/r/changemyview/comments/p0s7c5/cmv_i_am_the_only_being_in_the_universe.json": "最近になって、私は実際に存在するかもしれない唯一のものであることに気がつきました。\n他の人たちは、おそらく私の想像の産物に過ぎません。もし私が明日死んだら\n明日、私が死んだら、全宇宙は私と一緒に終わります。\n\n誰も私のこの考えを変えることができませんでした - 私は、この考えを変えるようなものを見たことがありません。\n私は、この考えを変えるようなものを一つも見たことがありません...",
  "data/reddit-changemyview/r/changemyview/comments/p0gce8/cmv_the_death_penalty_should_be_abolished_for.json": "私の考えは非常にシンプルで、いかなる市民も生まれながらにして以下のような制約を受けるべきではないと考えています。\nしかし、国家の権威と責任を受け入れることを選択した人は、より高い基準を求められるべきです。\nしかし、国家の権威と責任を受け入れることを選択した人は、より高い基準に従うべきだと思います。つまり、彼らは\n死刑を受けるだけではなく、死刑にならないようにしなければなりません。",
  "data/reddit-changemyview/r/changemyview/comments/p0ify4/cmv_any_religion_that_touts_its_leaders_as.json": "コビット以降、多くの人が「神に祈った」「神はワクチンを打つべきだと言った」と話しています。\n神に祈り、神はワクチンを受けるべきではないと言った」と話しています。\n\n間違っていたら訂正しますが、司教、長老、枢機卿、司祭は、神と対話するので\n神と話すから「特別」なのでは？誰もがやっていることなのに、なぜ彼らはそんなに特別なのでしょうか？\nなぜ私たちは必要なのでしょうか...",
  "data/reddit-changemyview/r/changemyview/comments/p0svp1/cmv_universal_health_care_can_and_should_be.json": "これに対する論理的な反論をぜひとも聞きたいものです。それはとても実用的で\n基本的なことだと思います。先進国の99％が何らかの形で導入しています。\n\n私は人生のかなりの部分をアメリカ以外のドイツと日本（国民皆保険の国）で過ごしてきました。\n(私はアメリカ以外のドイツと日本（国民皆保険制度のある国）で生活したことがありますが、その時に感じたことは...。",
  "data/reddit-changemyview/r/changemyview/comments/p0ujg4/cmv_simone_biles_opting_out_of_the_all_around.json": "最初に言っておくと、彼女がなぜそれをしたのか理解できますし、応援しています。\n体操は非常に危険なスポーツであり、間違った考え方をしていると致命的になります。\n致命的です。その上、ジャッジが彼女の難しさを強調することは、非常に士気を下げるものであるに違いありません。\nどんな人でもやる気をなくしてしまうものです。私が彼女の立場だったら...。",
  "data/reddit-changemyview/r/changemyview/comments/p0y5i6/cmv_employment_gaps_shouldnt_be_looked_so_down.json": "2年～6年の雇用の空白があった場合、文字通り説明しなければならないことは理解できます。\n働かないでいられる状況にないのであれば、よほどの成功を収めた人や\n働かないでいられる状況にないのであれば、よほどの成功者や\n働かずに済む方法を見つけて、急に必要になった......ということでもない限り、誰もがそうすべきだと思います。",
  "data/reddit-changemyview/r/changemyview/comments/p12pwc/cmv_fat_acceptance_is_the_same_as_enabling_an.json": "私はアルコール依存症の回復者です（断酒して約6年）。\n太っている人にはもっと配慮が必要だという記事や投稿を見ると、本当に腹が立ちます。\n私は自分を共感できる人間だと思っています。\n\n私は自分自身を共感できる人間だと思っていますし、誰かに声を大にして残酷なことをしたりはしませんが、これは本当に...。\nしかし、これは本当に...。",
  "data/reddit-changemyview/r/changemyview/comments/p18gnp/cmv_you_can_support_body_positivity_and_still_be.json": "ネット上のコミュニティや主流のメディアが、「健康でありながら肥満である」という物語を押し付けているのを見ると、私は本当にイライラします。\n肥満であっても健康でいられるというのは全くの誤りです。\nという話をしているのを見ると、とても残念に思います。太っていると（特に肥満だと）、心臓や肺などの臓器の周りに脂肪がたまります。\n肥満になると、心臓や肺などの臓器の周りに脂肪が蓄積され、それによって...",
  "data/reddit-changemyview/r/changemyview/comments/p16f0e/cmv_apple_is_building_the_very_1984esque.json": "最近のアップル社の発表では、あなたのすべての写真の暗号化されたハッシュをアップロードして\n確定した（CSAM）児童ポルノをチェックして、「影響を受けた」ユーザーを\n「報告すると発表しました。Appleは、国際的な監視と戦うことを誓っています。\nアップルは、自分たちが戦うと誓った国際的な監視の基盤を築いているのです。\n\n私はこう考えています。私の見解：これは...",
  "data/reddit-changemyview/r/changemyview/comments/p1emzb/cmv_the_wealthy_are_parasites_who_hoard_wealth.json": "富裕層がどれだけ社会を破壊し、私たちを冷酷な社会不適合者に変えたかがわかります。\n自分たちのために働き、自分たちを殺すか殺されるために、冷酷な社会病質者に変えてしまった。\n殺そうとしています。金持ちから盗むことは道徳的に間違っていないと信じています。\n道徳的に間違っていないと信じています... 彼らは自分たちが稼いだ富を溜め込んでいるのですから...。",
  "data/reddit-changemyview/r/changemyview/comments/p1bfmy/cmv_the_if_the_roles_were_reversed_argument_is_a.json": "例えば、黒人女性が白人女性を「ステイシー」と呼ぶ場合、相手の名前がそうでなければ\n黒人女性が白人女性を肌の色だけで「ステイシー」と呼ぶのは、白人女性が黒人女性を肌の色だけで「キシャ」と呼ぶのと同じです。\n肌の色を理由に白人女性が黒人女性を「キシャ」と呼ぶのと同じです。それを正論ではないと言ってしまうのは\n答えられない人がいるから、その考えを否定しているだけだと思います。どのようにして、あなたは...",
  "data/reddit-changemyview/r/changemyview/comments/p1if07/cmv_americans_fetishize_a_shitty_constitution.json": "選挙人団や上院議員の代表制については、改革の意見が多いので、ここでは触れません。\n改革についての意見は人気があるからです。\n\n毎年、アメリカの子供たちは、自分の国には天才的な政治家によって作られた最高の政治システムがあると教え込まれます。\n天才的な政治家によって作られた最高の政治システムがあると教え込まれています。しかし、実際には..,\nその...",
  "data/reddit-changemyview/r/changemyview/comments/p1jn77/cmv_the_government_should_not_just_be_focused_on.json": "まず第一に、私たちは「環境に優しい」とか「環境破壊を止めよう」とすべきではないと言っているのではありません。\nしかし、「取り返しのつかないことになる前に止めよう」という船は、とっくに出航しています。\nしかし、「取り返しのつかないことになる前に止める」という船はとっくに出航しています。\n\nCO2を吸ってすべてを元に戻すことはできませんし、変化はすでに進行しています。\n人間が介入しても、それを止めることはできません。\n\nその代わり...",
  "data/reddit-changemyview/r/changemyview/comments/p18atk/cmv_the_be_the_bigger_person_mentality_is_stupid.json": "私がRedditで読んだ記事の中で、誰かが「間違ったフォージングをしていないか？\n虐待を受けた人（特に児童虐待の被害者）に対して残酷なことをしたのは悪いことだったのかと\n虐待者（特に児童虐待の被害者）に対して残酷なことをした自分が悪いのではないかと問いかけ、悪いと言われ、「もっと大きな人間になれ」と言われたという投稿をRedditで読んだことがあります。\n\nこのような考え方は、遠回しに「あなたは...」と言っているだけではありません。",
  "data/reddit-changemyview/r/changemyview/comments/p1rok6/cmv_theres_a_lot_to_proud_about_in_us_history.json": "この国の暗い部分を見て、この国への憎しみや恥ずかしさを募らせている人たち（特に若い人たち）の話をよく耳にします。\n憎しみや恥ずかしさを感じるようになりました。\n憎しみや恥ずかしさを感じている人が多いようです。しかし、その一方で\n数え切れないほどのポジティブなことにはあまり目が向けられていないような気がします...。",
  "data/reddit-changemyview/r/changemyview/comments/p1tnqi/cmv_there_is_no_good_reason_for_movies_and_tv.json": "そのシーンを知っていますか？主人公が水の中から引き上げられる。死んでいるのか？\nOMGです。もう一人の主人公がすぐに胸骨圧迫を始めると\n突然、その人は水を吐いています。彼らは大丈夫だ。ばんざーい！」。\n\nもちろん、そうはいきません。心肺蘇生法を行った人は・・・。",
  "data/reddit-changemyview/r/changemyview/comments/p1u1fj/cmv_going_vegan_is_unsustainable_and_dangerous_to.json": "私は、世界全体（特定の地域を除く）で、肉を食べ過ぎていると思います。科学\n肉にしか含まれていない特定のアミノ酸があることは、科学的にも裏付けられています。\n神経の発達に必要なのです。年に数回のボーンブロススープでも\n年に数回のスープでも、大人には十分です....",
  "data/reddit-changemyview/r/changemyview/comments/p223ky/cmv_africanamericans_shouldnt_get_a_pass_for.json": "20世紀にアメリカで行われた医学実験では、アフリカ系アメリカ人をモルモットにしたタスキギー梅毒実験が行われたことはよく知られています。\nアフリカ系アメリカ人をモルモットにしたタスキギー梅毒研究では、「重要なことができる」と虚偽の説明をしながら\nタスキギー梅毒実験では、アフリカ系アメリカ人をモルモットにして、「重要な薬をもらっている」と偽って実験を行ったことはよく知られています。このことは\nアフリカ系アメリカ人が政府を信用していない理由として広く挙げられていますが...。",
  "data/reddit-changemyview/r/changemyview/comments/p21oro/cmv_the_top_100_billionaires_could_maybe_pay_for.json": "米国の2021年予算は約6.8兆円。上位100人のビリオネアの範囲は\n1,300億ドルから1,800億ドルです。ざっくりとした平均で、75Bドル×100で7.5Tドルとしましょう。ですから、仮に\n億ドル×100人で7.5兆ドルですから、仮に100％の富を手に入れたとしても、1年間は問題を解決できるかもしれません。\nそのほとんどは現金ではなく、現金をベースにした純資産です。",
  "data/reddit-changemyview/r/changemyview/comments/p24vjr/cmv_all_of_this_vaccine_hesitancy_is_really_just.json": "候補者が選挙で負けたからでも、もっと単純に「磁力」があるからでも、現政権を悪とみなしているからでも、あるいは\nもっと単純に「磁気」だからでも、現政権を悪と見なしているからでも、国を破滅させそうだからでも\n国を破滅させるとか、「未検証」だから安全ではないとか、そんないい加減な理由はまだ聞いていない。\nダサい理由はまだ聞いていない、本当の理由を...",
  "data/reddit-changemyview/r/changemyview/comments/p2d796/cmv_the_average_american_would_lose_to_a_goose_in.json": "皆さんこんにちは、このリンクを読んで\n[https://www.google.com/amp/s/www.thelondoneconomic.com/lifestyle/eight-per-cent-of-americans-think-they-could-beat-an-elephant-in-a-fight-269759/%3famp]\n一般的なアメリカ人の丸腰での戦闘能力について色々と考えてみました。\n欲しくなってしまいました。今、私は知っています...",
  "data/reddit-changemyview/r/changemyview/comments/p2epoz/cmv_womens_safety_advice_isnt_victim_shaming.json": "女性に「一般的な安全性を入れろ」と言うな、というような書き込みをよく見かけますが\n男性にはレイプするなと言ってくれ」というような書き込みをよく目にしますが、私も同感で、このようなことをしなければならないのは100％めちゃくちゃです。\nしなければなりません。\n\nしかし、私たちが生きているのはめちゃくちゃな時代なので、女性にイヤホンを外すようにアドバイスしたり\n緊急時の連絡先を登録しておくとか...。",
  "data/reddit-changemyview/r/changemyview/comments/p2kr1z/cmv_useless_higher_level_math_classes_calc_trig.json": "K-12年生は、大人になるまでにほとんどの人が知っておくべき基本的な情報を生徒に教えることを目的としています。\n大人になるまでに知っておくべき基本的な情報を教えることを目的としています。卒業するためには特定の科目が必要であることが合意されています。\n卒業するためには、特定の科目が必要であることが合意されています。これは、生徒が次のようなことについて十分な教育を受けられるようにするためです。\n教育委員会が重要だと判断したもの、例えば、自国の...",
  "data/reddit-changemyview/r/changemyview/comments/p2fy1m/cmv_covid_will_become_endemic_and_thus_masks.json": "私たちは、2020年から2021年の前半にかけて、世界的なパンデミックのために犠牲を払いました。\n世界的なパンデミックの影響で 私もかなり苦労しましたが、何とか乗り切ることができました。\nワクチンを接種して通常の生活に戻れるという、トンネルの先にある光があったからです。\n普通の生活に戻れるからです。私はマスクを着用しました。私はマスクをして、家に閉じこもっていました...",
  "data/reddit-changemyview/r/changemyview/comments/p2nlem/cmv_having_a_gun_in_the_home_does_not_make_me.json": "もっと言えば、多くの統計は個人レベルで適用されると役に立たなくなるような気がします。\n多くの統計は、個人レベルで適用すると役に立たなくなるように感じます。\n\n家庭に銃があると、銃による暴力の被害者になる可能性が2倍、3倍などになるとよく言われます。\n家庭に銃を持っていると、銃による暴力の被害者になる可能性が2倍、3倍などとよく言われます。\n\nこのようなことは、個人レベルに適用した場合には有用な情報ではありません...",
  "data/reddit-changemyview/r/changemyview/comments/p2uujh/cmv_the_concept_of_men_having_to_be_the_pursuer.json": "それは、社会的な考えに基づいて人生やモラルを形成することを男性と女性に強いるものです。\n人に役割を強いるように設計されています。誰かに声をかけてもらいたければ\n誰かに声をかけてもらいたければ、このアルファ・オス・ダンスを演じて、人々に興味を持ってもらうように強制しなければなりません。\n興味を持たせなければなりません。私は多くの人と友達になった後、話したことがあります...。",
  "data/reddit-changemyview/r/changemyview/comments/p2w05b/cmv_punishing_a_child_for_swearing_is_a_stupid.json": "注：スラー（中傷）は、トラウマと結びついていて、「Fuck」、「Shit」、「Ass」などとは全く別次元のものなので、含みません。\nFuck」、「Shit」、「Ass」などとは全く別のもので、特定の層を卑下するために作られたものだからです。\nとは全く別物です。\n\n編集部：タイトルは、「悪口に関する現在の社会的基準は、深刻な見直しが必要である」の方がいいかもしれません。\n悪口に関する現在の社会的基準は、深刻な見直しを必要としています...。",
  "data/reddit-changemyview/r/changemyview/comments/p2z5zj/cmv_the_idea_of_forced_diversity_doesnt_make_much.json": "メディアの制作においては、一般的に、潜在的な視聴者（視聴者、読者、プレイヤーなど）にアピールすることを目的としています。\n視聴者、読者、プレイヤーなどの潜在的なオーディエンスにアピールすることが目的です。\n多様性の押し付け」を皮肉ってもしょうがないですよね。\nクリエイティブな選択は、すべて正当なものであるか、すべて「強制」されたものであるかのどちらかです。例え誰かが...",
  "data/reddit-changemyview/r/changemyview/comments/p33u1x/cmv_if_my_body_my_choice_alone_is_an_insufficient.json": "私はワクチン反対派ではありませんし（両方持っていました）、生命保護派でもありません。\n私の体、私の選択、そして責任はそこで止まる」という主張は弱いと感じています。\n\n賛成派にはたくさんの正論がありますが、私はこれがその一つだとは思いません。\nその中の一つです。\n\nもし、あなたがボディ・オートノミーの議論が...",
  "data/reddit-changemyview/r/changemyview/comments/p35qki/cmv_businesses_struggling_to_hire_minimum_wage.json": "真の資本主義経済は、非常に低い失業率によって賃金の上昇をもたらします。\n失業率は非常に低い。企業が従業員の雇用や維持に苦労している場合、他にもっと良い選択肢があるとしたら\n企業が従業員の雇用や維持に苦労している場合、彼らの唯一の選択肢は、賃金やインセンティブによって仕事をより魅力的にするか、あるいはバスを廃止することです。\n賃金やインセンティブで仕事を魅力的にするか、あるいは廃業するしかありません。\n\n私たちの国では...",
  "data/reddit-changemyview/r/changemyview/comments/p3h4uz/cmv_the_average_us_american_is_uneducated.json": "まず第一に、私は彼らを責めるつもりはありません。\n意図的に押し付けられているとしか思えません。しかし、客観的な現実として、平均的なアメリカ人は\n歴史、政治、地理、物理・自然科学、哲学、言語などの基本的な批判的理解が不足しているということです。\n歴史、政治、地理、物理・自然科学、哲学、言語の基本的な批判的理解が不足しているというのが客観的な現実です。\n\nI...",
  "data/reddit-changemyview/r/changemyview/comments/p3h6pz/cmv_the_climate_change_movement_has_been_greatly.json": "一言で言えば、気候変動対策のキャンペーンを他の左派の政策と一緒に行うのは\n他の左派政策と一緒に気候変動対策を行うことは、運動にとって非常に有害であると思います。\n運動に大きな悪影響を与えています。私はオーストラリア人の視点から話をしますが、これは他の国の経験と類似していると思います。\nこれは他の国の経験にも類似していると思いますが、私はオーストラリア人の視点から話します。オーストラリアでは、第3...",
  "data/reddit-changemyview/r/changemyview/comments/p3eabx/cmv_nuclear_is_the_way_forward.json": "気候変動に歯止めをかけるには、早急に原子力エネルギー産業に資源を投入する必要があると思います。\n気候変動を食い止めるためには、早急に原子力産業に資源を投入する必要があります。原子力は\n原子力は、信頼性が高く、カーボンニュートラルな、現在の唯一のエネルギー源です。\n核廃棄物が発生するため、完璧ではないかもしれませんが...。",
  "data/reddit-changemyview/r/changemyview/comments/p3im6q/cmv_hiring_poc_to_play_white_characters_is_just.json": "ウィッチャー』のNetflixシリーズでは、イェンネファー役にアーニャ・チャロトラを採用しました。彼女はイギリス出身ですが\nイギリス出身ですが、インド人とのハーフでPOCです。また、Triss役の女優Anna Schafferも\nトリス役の女優アンナ・シャファーもドイツ出身ですが、こちらもPOCです。\n\nどちらのキャラクターも元々はスラブ系で、本の中ではPOCとは書かれていません。\n本の中ではPOCとは書かれていません。",
  "data/reddit-changemyview/r/changemyview/comments/p39qfd/cmv_parents_who_believe_their_children_owe_them.json": "それは私が育った家庭の方針であり、私の母は私たち（私と弟と妹）を一人で育てました。\n弟と妹）を一人で育てました。母は、自分が私たちを育てた以上、私たちは母に恩義があると信じています。\n他の人たちも同じようなことをしていると思います。親になることは自分勝手な選択だと思います。\n親になることは自分勝手な選択だと思っています（私は2人の娘の父親です）。そして、それゆえに、それは仕事なのです...。",
  "data/reddit-changemyview/r/changemyview/comments/p3uhuo/cmv_batmans_recruitment_of_robin_as_a_fellow.json": "バットマンのコミックでは、ロビン（様々な人が担っている役です）は\n若い世代で、時にはプレティーンでもありますが、最近では13～15歳の間です。\n\nここでは、バットマンのキャラクターの年齢について、別のRedditorの情報に基づいた意見を紹介します。\n含む...",
  "data/reddit-changemyview/r/changemyview/comments/p3znl8/cmv_the_us_government_should_waive_any_visa.json": "アフガニスタンは失われた原因であり、数え切れないほどの数のアフガニスタン人が民主主義の中で育ってきました。\n民主主義の中で育ってきたアフガニスタンの人々が、もうすぐ人魚の物語のようなディストピアに陥ってしまうのです。\nもうすぐです。数年前のイベントで、アフガニスタンの女性で構成された女子ロースクールチームに出会いました。\n私は数年前のイベントでアフガン女性の女子ロースクールチームに出会いましたが、彼女たちが今どんな状況に置かれているのか想像もつきません...。",
  "data/reddit-changemyview/r/changemyview/comments/p405gl/cmv_born_in_the_wrong_body_doesnt_make_sense.json": "これまでに何度か、次のような議論を目にしたことがあります。\nトランスジェンダーの人々の脳は、平均して、自分が認識している性別に、予想以上に似ていることを示す証拠がある。\nトランスジェンダーの人たちの脳は、平均して、遺伝的な性別の人たちから予想されるよりも、自分が識別する性別に近いことを示す証拠がある。\n遺伝的な性別の平均的なメンバーから予想されるよりも、トランスの人々の脳は彼らが識別する性別に近いことを示すいくつかの証拠がある。これは、彼らが何かを掴んでいることを示しています...",
  "data/reddit-changemyview/r/changemyview/comments/p3zkfu/cmv_people_who_post_photos_of_their_children_on.json": "子どもや赤ちゃんは、親や家族に「写真を撮られたくない」「写真を撮られたくない」と伝える機会がありません／ほとんどありません。\n写真を撮られたくない」「写真をネットで公開されたくない」と両親や家族に伝える機会はほとんどありません。\n子供や赤ちゃんは、親や家族に「写真を撮られたくない」「ネットに掲載されたくない」と伝える機会がありません。\n\n思い出のためだから」と言われることもあります。でも、ネットにアップされた写真は消えないし\n写真は消えないし、もし自分の子どもが...",
  "data/reddit-changemyview/r/changemyview/comments/p4bni0/cmv_dr_anthony_fauci_is_a_reliable_and.json": "この件に関しては、多くの方が悪魔の証明のような立場を取る必要があると思います。\nしかし、ネット上の政治的右派からの彼への憎悪があまりにも多いので、私はどうしても\nその怒りがどこから来るのかを理解しようとしています。彼が犯罪者のレッテルを貼られているのを見たことがあります。\n理由もなく、犯罪者、嘘つき、テロリストというレッテルを貼られています。\n\nI...",
  "data/reddit-changemyview/r/changemyview/comments/p4bjib/cmv_if_americans_dont_want_to_get_vaccinated_we.json": "予防接種を受けるための最後のチャンスとして、海外に送る前に警告することができます。\n接種を海外に送る前の最後のチャンスです。そうすれば、リソースを無駄にすることはありません。これらの\n何千ものワクチンが、人々が接種を拒否したために腐ってしまったという話は\nこれは需要と供給のミスマッチです。以来、...",
  "data/reddit-changemyview/r/changemyview/comments/p48g7e/cmv_the_united_states_senate_is_going_to_cause.json": "個人的には上院の使い道はないと思っています。理論的には、上院議員は\n上院議員は国家の利益を執行することになっていますが、実際には上院議員は自分の政党に迎合します。\n自分の政党に迎合しています。代表権は人口ではなく州に基づいています。\nそのため、より多くの人が上院議員になることができず、逆に上院議員の数が少なくなってしまうのです。",
  "data/reddit-changemyview/r/changemyview/comments/p4dk6p/cmv_if_a_grilled_cheese_sandwich_has_anything.json": "よくグリルチーズではないものをグリルチーズと呼んでいる人を見かけますが、私には理解できません。\n理解できません。ハムやターキー、あるいはブリスケットを使ったサンドイッチが、チーズではないのにどうして\nチーズが入っていないのに、どうしてグリルドチーズなのでしょうか？チーズは\nチーズは「グリルド・チーズ」と呼ばれるものの中で、後付けやアクセントにはなりません。",
  "data/reddit-changemyview/r/changemyview/comments/p42z45/cmv_there_is_no_valid_reason_for_supporting.json": "死刑制度の維持や復活を支持する人たちの主張には、数え切れないほどの欠陥があります。\n死刑制度を維持したり復活させたりする人たちの主張には、数え切れないほどの欠陥がありますが、それらのほとんどは、よく考えれば\nしています。\n\n\"くたばれ、奴らは自業自得だ！\"\n\n人間には欠陥があり、間違いを犯すものであり、100％完全な正義を設計することはできません。\n完全無欠の正義を設計することはできません...",
  "data/reddit-changemyview/r/changemyview/comments/p4iedx/cmv_conservatism_and_many_rightwing_beliefs_are.json": "恐怖というのは、右翼のスピーカーが思想を発表するときに使う恐怖を煽るレトリックのことです。\n思想を提示するために使用する。それは常に何かに対抗し、左翼、黒人、ユダヤ人、その他の人々が持つ我々の価値観を守るものとして提示されます。\n左翼、黒人、ユダヤ人、その他の少数派が「奪おう」とする価値観を守るために提示されます。\n「奪おうとするものです。\n\n第一の本能というのは、判断や意思決定のことです。",
  "data/reddit-changemyview/r/changemyview/comments/p4owhc/cmv_nonprofit_institutions_should_have_their.json": "教会もこの中に含まれます。\n\n私の考えでは、特に教会では、人々がそのようなことをしてはいけないという事件があまりにも多く発生しています。\n崇高な目的のために使われることを期待してお金を預けたのに、それが横領されて\n崇高な目的のために使われることを期待してお金を預けたのに、牧師のポケットに横領されてしまうという事件が、特に教会ではあまりにも多いのです。\n\n投入したお金がすべて...",
  "data/reddit-changemyview/r/changemyview/comments/p4lgzp/cmv_with_the_exception_of_medical_conditions_or.json": "様々な理由でワクチンを接種しないことを選択した人たちの投稿を数え切れないほど見てきました。\n数え切れないほどの理由があります。彼らに共通しているのは、合理的な判断ができないということです。\n判断していないことです。パンデミックが地球上のすべての人にどれほどの影響を与えているかを否定しているように見えます。\n否定しているように見えますが、彼らは自分の...",
  "data/reddit-changemyview/r/changemyview/comments/p4p2ou/cmv_banning_incel_subreddits_is_a_bad_idea.json": "あのサブ機に乗っている人たちは、単に精神的に病んでいるだけです。彼らのコミュニティを禁止すると\n単にそのユーザーの大半がよりフリンジなサイトや掲示板に移ってしまうだけです\n隔離された環境の中で、有害な思想を共有することになります。I\nインセル・サブ」の多くは、自分たちだけの世界に閉じこもる傾向があると思います...。",
  "data/reddit-changemyview/r/changemyview/comments/p4lthd/cmv_interpretation_of_back_the_blue_or_the_thin.json": "仕事が大変だから、お互いに助け合っているということではないと思います。\n(仕事が大変だから（より多くの仕事は危険だから）、緊密なコミュニティを望む大きなコミュニティだから\nサポートが必要なハードな仕事だから、という理由で、他の職業と同じように、他の良いジャズ\n他の職業と同じように。私は文字通り、悪いリンゴを守るためのものだと思っています。",
  "data/reddit-changemyview/r/changemyview/comments/p4s3ju/cmv_prolifers_and_prochoicers_both_want_abortions.json": "賛成派は中絶をほぼゼロにすることを望み、反対派は100万人程度の中絶を続けることを望む、という考え方があります。\n賛成派の人たちは、アメリカで年間約100万件の中絶が行われていることを望んでいます。\nアメリカでは毎年、年間100万件前後の妊娠中絶が行われています。しかし、私の考えでは、どちらの立場の人も実際には中絶をゼロに近づけたいと思っています。\nをゼロに近づけようとしています。\n\nプロ・リフターはもちろん、...",
  "data/reddit-changemyview/r/changemyview/comments/p4zve4/cmv_latinos_will_be_grouped_in_with_white_people.json": "そして、ギリシャ人とアイルランド人。歴史上、ある種のグループが、知られた事実として\nアメリカの白人文化に同化してきました。最も顕著なのは\nイタリア人である。イタリア人のアメリカへの移民は、大きな文化的イベントであり\n19世紀に始まりました。何百万人もの人々が移住し...",
  "data/reddit-changemyview/r/changemyview/comments/p4zuwk/cmv_the_united_states_abandonment_of_afghanistan.json": "私は、アフガニスタンを放棄することで、米国は不道徳な不正を行っていると信じています。\n不道徳なことをしていると思います。撤退を正当化する理由として私がよく目にするものを挙げ、それぞれがなぜ間違っているのかを説明します。\n撤退を正当化する理由としてよく挙げられるものを紹介し、それぞれが間違っている理由を説明します。\n私の意見では 1. アメリカはアフガニスタンにいるべきではなかった...",
  "data/reddit-changemyview/r/changemyview/comments/p53er2/cmv_the_government_should_pay_interest_on_our_tax.json": "ほとんどのアメリカ人は、税金を払いすぎた時のプロセスを知っています。\n一年を通して給料日ごとに税金を払いすぎて、確定申告の時期になると\nそして確定申告の時期になると、払いすぎた金額と同じ額の還付金を政府から受け取ることができます。\n\nしかし、考えてみれば、あなたがしたことは、自分のお金を政府に貸しただけなのです。",
  "data/reddit-changemyview/r/changemyview/comments/p540hv/cmv_women_contribute_to_toxic_masculinity_and.json": "タイトルにもあるように、フェミニストたちはいつも、女性と同様に男性も家父長制に苦しめられていると話しています。\n男性も女性と同じように傷つけられるという話をしていますが、これは私も賛成です。\n政治家などの権力者だけが、人類の歴史の中で繁栄してきました。しかし、今日では、私たちは\n西洋では平等主義に向けて多くの努力がなされていますが、はるかに...",
  "data/reddit-changemyview/r/changemyview/comments/p591nj/cmv_the_offensiveness_of_slurs_should_be_solely.json": "私と友人は、ある有名人が他の人の曲の中で中傷的な言葉を言ったことについて議論していました。\n彼女は18歳になって謝罪しました。\n\n私の友人は、「彼女は16歳の時にもっとよく知っておくべきだった、人種差別的だと知っていた。\nそれを言った彼女は人種差別者であり、キャンセルされたからといって気にすることはない」というものでした。\nキャンセルされるから気にしているだけだ」というものでした。\n\n私の...",
  "data/reddit-changemyview/r/changemyview/comments/p5dfib/cmv_extremely_loud_vehicles_such_as_motorcycles.json": "購入するクルマを選ぶとき、あるいは自分のクルマをどのようにカスタマイズするかを選ぶとき\n車を選ぶときには、選択肢があります。1990年代の古いセダンを買って、古いFMラジオをBluetooth受信機に交換することもできます。\n1990年代の古いセダンを買って、古いFMラジオをBluetoothレシーバーに交換するか、信頼性の高いSUVを買って\nこぼしやすい子供のためにこぼれないシートカバーをつけるとか、あるいは",
  "data/reddit-changemyview/r/changemyview/comments/p5hf32/cmv_new_nuclear_reactors_are_not_going_to_form_a.json": "このテーマは、多くの熱狂的な支持者がいて、その人たちから注目されているからです。\n私が何を言っていないのか、いくつか明確にしておきましょう。\n\n 1. 1. 私は予測的な見解を支持しているのであって、規範的な見解ではありません。私が主張しているのは\n    原子力発電が良いか悪いか、必要か不必要かを論じているのではない。\n\n...",
  "data/reddit-changemyview/r/changemyview/comments/p5jocr/cmv_the_concept_of_islamophobia_misses_the_bigger.json": "渋滞の中で車のキーをつけたまま放置する人や、飛行機にしがみついて逃げる人を見てきて\n文字通り飛行機にしがみついてアフガニスタンのイスラム首長国を脱出する人々を見た後では\nイスラム教が平和な宗教ではないことを知らないわけにはいかないでしょう。\n\nここで、主要な宗教の歴史を振り返ってみましょう...",
  "data/reddit-changemyview/r/changemyview/comments/p5n8uk/cmv_it_is_not_ok_to_make_posts_making_fun_of.json": "私は、彼らがコビドの継続的な普及を引き起こしていることを理解しています。\nお笑いはそのはけ口なのです。ワクチンに反対している弟を持つ者としては\nワクチンに反対している弟を持つ者として、犠牲者の死を祝福する投稿を見るのは気になります。彼は今までに\nメディアや家族に洗脳されているとしか思えません。",
  "data/reddit-changemyview/r/changemyview/comments/p5pga8/cmv_the_rise_of_onlyfans_is_an_overall_net.json": "私は純粋に、この件に関して新しい見解を求めています。\n私は自分の立場を一生懸命考えましたが、私の意見は親しい友人の何人かとはまだ少し対立しているようです。\n私の意見は、私の親しい友人の何人かと、まだ少し対立しているようです。\n\nそもそも、私はセックスワークに反対しているわけではありません。私は厳密にはセックス産業で仕事をしています。\n私の最後の年は...",
  "data/reddit-changemyview/r/changemyview/comments/p5xihg/cmv_pulling_out_of_afghanistan_was_the_right.json": "私は、バイデンの決断が正しかったと100％確信しています。これは、2年前から続いている戦争です。\n20年も続いているのに、何のために？何十億ドルものお金と何千人もの命が\n命を無駄にしています。私は、なぜ私たち（アメリカ）が戦争に参加しないのか、という同じような言い訳を聞くのに疲れました。\nなぜ我々（アメリカ）が留まる必要があったのか、という同じような言い訳は聞き飽きました。もちろん、戦争に参加することは...。",
  "data/reddit-changemyview/r/changemyview/comments/p62vmz/cmv_pedophilic_fanfiction_and_fanart_shouldnt_be.json": "私がいるオンラインスペースでは、この問題が話題になっていて、誰もが自分の意見を非常に強く主張しています。\n自分の意見を述べることができます。\n\nキーポイントです。小児性愛的なファンフィクションやファンアートというと、具体的には次のようなものを指します。\nとは、大人が16歳未満の未成年者とセックスすることを含むものです。 \nこの数字はほぼ全世界で...",
  "data/reddit-changemyview/r/changemyview/comments/p5yzxn/cmv_it_is_justifiable_to_include_religion_of_most.json": "UPDATE：私の見解を変更しました。\n\nある投稿で、アフガニスタンのタリバングループは、「イスラム教徒のテロリスト」というレッテルを貼るべきではない、という意見を目にしました。\nなぜなら、それは善良なイスラム教徒をさらに危険にさらし、汚名を着せることになるからです。\nなぜなら、善良なイスラム教徒をさらに危険にさらし、汚名を着せることになるからです。宗教は会話の中に入れないほうがいい、と。\nある市民は言う。\n\n私はそう思いますが・・・。",
  "data/reddit-changemyview/r/changemyview/comments/p6ifnt/cmv_choosing_a_career_you_dont_enjoy_just_for_the.json": "私たちの興味は、必ずしもお金になる仕事とは一致しません。あなたの興味がそうであれば、それは良いことです。\nしかし、それは例外的なことです。だからこそ、飢えた音楽家やフリーランスのライターがたくさんいるのです。\nフリーランスのライターが多いのはそのためです。多くの人は、自分が楽しいと思う仕事を選ぶことにします。\n実際には、その仕事は非現実的で、給料も......。",
  "data/reddit-changemyview/r/changemyview/comments/p60fm0/cmv_it_is_as_bad_for_a_girl_to_slap_a_guy_as_the.json": "残念ながら、社会はいまだに性差別的な考え方に固執しています。そのひとつが\n女の子が男を叩くのはそれほど悪くないが、男が女の子を叩くのはひどい。\n女の子を叩くのは悪いことではない。\n\n暴力は間違っています。性別に関係なく。それ以外の見方は性差別です。\n\n男の方が強いといっても、その優位性は相殺されてしまいます...。",
  "data/reddit-changemyview/r/changemyview/comments/p6r7ot/cmv_giving_babies_soda_is_child_abuse.json": "さて、最も露骨なポイントであなたを釣ったところで、議論の時間に入ります。\n\n赤ちゃんの体内には1～2杯の血液が流れているのですから、よほどのバカでなければ\n(そもそもあんなに大きくなってしまった親が一番の負け組ですが)\n赤ちゃんのシッピーカップにソーダや甘いアイスティーを入れるのは、よほどのマヌケでないとできません。それは純粋な...",
  "data/reddit-changemyview/r/changemyview/comments/p6wivp/cmv_there_should_be_a_separation_between_state.json": "かつてのように、そして特にこの国では宗教の自由を確保するために\n教会と国家は明確に分離されていました。\n今、国家と民間企業との分離を確実にするために、最新の見解が必要とされています。\n国家と民間企業の利益の分離を確実にするために、今、この見解を更新する必要があります。\n\nそれは陰謀ではなく、...",
  "data/reddit-changemyview/r/changemyview/comments/p6uqks/cmvtheres_nothing_wrong_with_not_wanting_to.json": "私は内向的で一人でいるのが好きです。誰かに言われるたびに\n友達がいないことを気にしていると言われると不健康な気がします。\n\nでも、もし私が友達を欲していなかったら？大学時代、私は自分が迷惑な人間だと気づいていました。\n迷惑な人間だと気づいていたし、今は年をとってもっとのんびりしているけど、友達はいない。",
  "data/reddit-changemyview/r/changemyview/comments/p6y01i/cmv_leaving_afghanistan_was_always_going_to_be_a.json": " 1. 飛行機にしがみついている人たちの動画が悲惨なのは知っていますし\n    タリバンは悪ですが、問題の事実は、アフガニスタンからの出発は\n    しかし、実際のところ、アフガニスタンからの脱出は常に混沌としたものであり、国外に脱出したいと思っている人全員を脱出させることはできません。\n    国外に脱出したいと思っている人全員を脱出させることはできません。私たちは、あと6ヶ月待つこともできましたし...",
  "data/reddit-changemyview/r/changemyview/comments/p6f14k/cmv_there_is_literally_nothing_racial_whatsoever.json": "人種、肌の色、信条、経済的地位、教育レベル、モラルの違いを問わず、税金を納める人々は\n人種、肌の色、信条、経済状態、教育レベル、モラルにかかわらず、自分の分の税金を払っている人は、それが自分にとって必要なことだからです。\nそれは、アメリカ市民としてのすべての利益を経済的に確保するために必要だからです。\nアメリカの市民であることで得られるすべての利益を経済的に確保するために必要だからです。\n\n税金を払うということは...",
  "data/reddit-changemyview/r/changemyview/comments/p70z1n/cmv_leashes_for_small_children_are_in_general_a.json": "ほとんどの人が見たことがあると思います。\n保護者が持っているか、あるいは保護者の腰のベルトに取り付けられていることが多いです。\n保護者が持っているか、あるいは保護者の腰にベルトをつけている。また、私たちの多くは、このような製品に対して、多くの人が否定的な反応を示すことを知っていると思います。\nそして、このリードに対して多くの人が否定的な反応を示していることも知っていると思います。",
  "data/reddit-changemyview/r/changemyview/comments/p78lqa/cmv_cultural_appropriation_is_not_wrong_because.json": "この記事を書こうと思ったのは、ある女性がツイッターで、「白人女性が麺類や餃子の料理本を作るべきではない。\nアジア人ではないので、白人女性が麺類や餃子の料理本を作るべきではないと\nアジア人ではないからです。私の視点では、私は自分の国の料理を作るために何もしていません。\n私の視点では、私は自分の文化的な食べ物を作るために何もしていないので、私には大きな意味はありません。",
  "data/reddit-changemyview/r/changemyview/comments/p7eqst/cmv_pedophilia_should_be_treated_as_a_mental.json": "最初にお断りしておきますが、私は決して子どもたちへの性的暴行を正当化しようとしているわけではありません。\n子供たちへの性的暴行を正当化しようとしているわけではありません。もちろん、それは嫌なことであり、不道徳なことです。そうは言っても、私は\n私の主張は、ペドフィリアを精神疾患として扱うことで、ペドフィリアの数を減らすことができるという信念に基づいています。\n精神疾患として扱うことで、小児性愛者の数が減るのではないかというのが私の主張です。",
  "data/reddit-changemyview/r/changemyview/comments/p7ttgc/cmv_islam_is_fundamentally_more_dangerous_than.json": "原理主義的な形態の宗教はほとんどが危険です。しかし、イスラム教はそれに加えて\n人々を統治する方法を説き、どのような法律を実行し、実行してはいけないかを明確に指示することで、このような層を増やしています。\nどのような法律を実行すべきか、実行してはならないかを明確に指示しています。\n\nこれは、公共の場で意見を交わしながら法を制定するというコンセプトとは直接矛盾しています。\nこれは、意見を考慮して公共の場で法律を策定するという概念とは全く矛盾しています...",
  "data/reddit-changemyview/r/changemyview/comments/p7odzz/cmv_implying_that_breastfeeding_promotion_shames.json": "私たちは、私たちの生活につながるような選択を促進し、奨励することが許されています。\n私たちは、より健康的な生活につながる選択を促進し、奨励することができます。もしあなたがこれらのことをしないことを選んだとしても、それは構いません、それはあなたの\nそれがあなたの選択です。だからといって、これらのことに関する情報が、参加するかどうかを選択するあなたの権利を攻撃することにはなりません。\nあなたがこれらのことをするかしないかを選択する権利を攻撃することにはなりません。それは...",
  "data/reddit-changemyview/r/changemyview/comments/p7qsyv/cmv_at_the_rate_were_going_the_lockdowns_and_mask.json": "最初のロックダウンでは、ワクチンを待たなければならないと言われました。\nそのワクチンが今ここにあるのですが、新しいワクチンの接種率は低下しています。\nワシントン州では、感染者数の増加に伴い、マスクの着用を義務付けることを発表しました。\nワシントン州では、患者数の増加に伴い、マスクの義務化を発表しました。\n\nさて、私たちは何を待っているのでしょうか？私たちが期待しているのは...",
  "data/reddit-changemyview/r/changemyview/comments/p7xbyn/cmv_people_into_the_extreme_parts_of_bdsm_have.json": "今では、「Dur, you're an incel」「Reee you must be fun in the bed」といったコメントが目に浮かびます。\nベッドの中では楽しいだろうな」。\n\nこの話は、当時の彼女が合法的なBDSMを紹介してくれたことに起因しています。\n本格的なBdsmを紹介されたことがきっかけです。最初はちょっとエロティックな感じがしたんだけど、その後\n暗い雰囲気になってきたことに気づきました。レザーだけではなく...。",
  "data/reddit-changemyview/r/changemyview/comments/p7wyfb/cmv_exams_should_be_open_booknotes.json": "エンジニアの学生として、これは学習において非常に重要なことだと思います。試験のために資料を暗記\n試験のために資料を暗記することは、資料を学ぶのに良い方法ではありません。\nオープンブックの試験を受ければ、教材の学習がずっと楽になります。\n\nすべての試験はオープンリソースであるべきだと思います。それは、メモを取るスキルを向上させ、...",
  "data/reddit-changemyview/r/changemyview/comments/p833ga/cmv_i_should_support_nuclear_energy_over_solar.json": "原子力は、安価で豊富、クリーンで安全なエネルギーです。工業的にも利用できます。\n工業的に利用できますが、太陽電池ではできません。すべてのエネルギーに注目すべきだと言われても\n私は、それは人々が原子力エネルギーに全力で投資していないだけだと思います。\n\nあなたの国の大部分を達成するためのロードマップがあります...",
  "data/reddit-changemyview/r/changemyview/comments/p855z6/cmv_men_wearing_shoe_lifts_shouldnt_be.json": "背の低い男性は、背の高い男性に比べて平均的に（すべての条件が同じであれば）魅力がないと広く考えられています。\n背の低い男性は、背の高い男性に比べて平均的に魅力が低いと考えられています（すべての条件が同じ）。しかし、これはどうしようもないことです。\n足を長くすることは、非常に高価で、リスクが高く、痛みを伴い、多くの\n何ヶ月もの回復期間を必要とします。リフト以外の方法はありません・・・。",
  "data/reddit-changemyview/r/changemyview/comments/p8qjn8/cmv_depression_related_subreddits_serve_no.json": "私はうつ病を患っており、自殺を理想とする段階にあり、一般的に言えば、いずれ自分の手で死ぬことを多少なりとも受け入れています。\n自分はいずれ自分の手で死ぬのだということを多少なりとも受け入れています。今日ではない。\n今日ではなく、おそらく明日でもないでしょうが、自分の人生の傾向を見ていて、良くなるとは思えません。\nよくなるとは思えません。本当は、ある人たちは、自分の手で...",
  "data/reddit-changemyview/r/changemyview/comments/p8ueaz/cmv_going_out_and_getting_drunk_every_weekend_is.json": "私はもうすぐ25歳になりますが、外に出てお酒を飲むのは\n酔っぱらうのは嫌だなと思うようになりました。その場では楽しく過ごせても、目が覚めるとお金が減っていたり、頭が痛くなったりする。\n目が覚めるとお金は減っていて、頭も痛くなっている。もっと他にできることがあるのではないかと思っています。\nもっと他にできることがあるのではないかと思っています。私は音楽を作るのが好きですが、いつもより多くのプレッシャーを感じています...。",
  "data/reddit-changemyview/r/changemyview/comments/p8xik8/cmv_babies_shouldnt_be_circumcised.json": "人は自分の体をできるだけコントロールできるようにすべきです。\n割礼を受けるかどうかは、親が決めるのではなく、人生の後半になってから決めることができます。\n割礼を受けるかどうかは、親が決めるのではなく、人生の後半になってから決めることができます。宗教的な観点から言えば、親としては自分の子供が割礼を受ける可能性があることを認識しなければなりません。\n親として宗教的な観点から、自分の子供が割礼に従わない可能性があることを認識しなければなりません。",
  "data/reddit-changemyview/r/changemyview/comments/p8zfvt/cmv_any_argument_of_hurry_or_youll_be_left_out.json": "ビットコインやその他のコインについて、私の考えが変わることは絶対に歓迎します。\nNFTを擁護しようとしている人にコメントを返したことで\nNFTや安定コイン、スマートコントラクトを擁護しようとしている人にコメントしたところ、それらがネズミ講や詐欺の一種であることを示す非常に具体的な事柄に気づきました。\nそれは、それらがネズミ講や詐欺の一種であるということです。\"if you...",
  "data/reddit-changemyview/r/changemyview/comments/p94unc/cmv_holding_opinions_so_dearly_that_you_consider.json": "意見を変えることは、通常、弱さや無能さの表れだと考えられています。\n多くの人は無意識のうちに自分が間違っていることを恐れています。\n\nしかし、私は、政治的なコミュニティの分裂が以前よりも大きくなっている理由は、反響が大きいことだけではないと考えています。\n政治家の分裂が以前に比べて大きくなったのは、エコーチェンバーや\nチャンバー、...",
  "data/reddit-changemyview/r/changemyview/comments/p8s694/cmv_anarchocommunism_cannot_support_any.json": "私は最近、歴史的な無構造化の試みに興味を持っています。\nある種のヒエラルキーが歴史的にどんな大きな人間にも必然的に存在してきたことを考えると、それが人間の行動に与える影響に興味があります。\n大規模な人間社会では、歴史的に見て、ある種のヒエラルキーは避けて通れないものでした。\n社会には、ある種の階層が必然的に存在します。トニー・ヘイセイが夢見た、構造のない...",
  "data/reddit-changemyview/r/changemyview/comments/p97any/cmv_reddit_is_not_a_great_place_to_get_advice_in.json": "Redditは、そのユーザーが一般的に内向的で、人との関係を築くのが苦手だという評判があります。\n人との関係を築くことや維持することが苦手だと言われています。しばらくしてから\n私が見てきたサブレディットや、私が話した何人かの人々を見ても、それは明らかです。\n明らかになりました。内向的であることは悪いことではありませんが、誤解しないでください。",
  "data/reddit-changemyview/r/changemyview/comments/p984mu/cmv_women_demanding_toilet_seat_to_be_kept_down.json": "私はシートを下げておくことを気にせず、家族や同居人、職場などで女性とトイレを共有するときはいつもそうしてきましたが\n家族や同居人、職場などで女性とトイレを共有するときは、いつもそうしています。\nそれはドアを開けておくような礼儀だと思っています。私が問題にしているのは\n女性が「こうあるべきだ」と要求したり、考えたりすることです。\n\nで...",
  "data/reddit-changemyview/r/changemyview/comments/p9a96d/cmv_firsttrimester_abortion_is_not_immoral.json": "最初に言いたいのは、すべての状況で中絶が道徳的だとは思わないということです。\n9ヵ月後に中絶することは、明らかに道徳的ではありません。私は、人の命自体が価値があるとは思いません。\n私は、人間の命それ自体に価値があるとは思いません。\n本質的な価値を与える最も重要な要素だと思います。\n\n感覚とは、経験する能力のことです。例えば...",
  "data/reddit-changemyview/r/changemyview/comments/p9c6x2/cmv_voluntarily_unvaccinated_people_should_be.json": "私は、経済的・社会的条件にかかわらず、誰にも医療を提供することを拒むべきではないと確信しています。\n私は、経済的、社会的な状況にかかわらず、医療を受けることができない人はいないと信じています。\n\nしかし、私が最も憤慨しているのは、コヴィドに対する完璧なワクチンがたくさんあることです。\n第一世界のほとんどの国では、コヴィドに対するワクチンは簡単に入手できます。\nしかし、私が最も憤慨しているのは、第一世界のほとんどの国で入手可能な、コヴィドに対する完璧なワクチンがたくさんあるのに、人々が...",
  "data/reddit-changemyview/r/changemyview/comments/p9p91m/cmv_person_of_color_sounds_wrong.json": "マイノリティのためのキャッチオールの言葉なら理解できる。\n\nしかし、私の友人は私を有色人種と表現しましたが、その言葉は異質なものに聞こえました。\n\nまるで自分が黒人であるかのように......なぜそれが気になるのか、はっきりとは言えないんだけどね。\nジム・クロウで黒人がどのように語られていたかと関係があるのかもしれません。\n\nでも...",
  "data/reddit-changemyview/r/changemyview/comments/p9qm78/cmv_men_and_women_are_not_the_same_there_are.json": "なぜか左翼の多くは、男性と女性は同じであり、すべての格差は性差別の結果であるという考えを信じています。\nあるにもかかわらず、男性と女性は同じであり、すべての格差は性差別の結果であるという考えを、なぜか多くの左翼が持っています。\n男性と女性の脳に違いがないとした研究は一つもなく、明らかに...\n男性と女性の脳に違いがないとした研究は一つもなく、いくつかの研究では明らかに...",
  "data/reddit-changemyview/r/changemyview/comments/p9vzkv/cmv_stablecoins_are_not_a_new_innovation_they_are.json": "銀行口座に10ドルを持っていても、実際には10ドルを所有しているわけではありません。所有しているのは\n銀行からの借用書が10枚あります。この借用書は、地元の銀行で現金に交換することもできますし\n銀行振込で直接支払い、他の人に換金してもらうこともできます。\n換えることができます。\n\nもし、銀行が倒産しても、私の借用書があれば安心です。",
  "data/reddit-changemyview/r/changemyview/comments/p9sbcz/cmv_different_outcomes_do_not_imply_discrimination.json": "先日、アメリカのDisparate Impactについて知り、ちょっと気になりました。\nちょっと気になりました。ここ【https://www.investopedia.com/disparate-impact-5114526】\nはDisparate Impactを次のように定義しています。\n\n>差別的影響とは、ある基準、要件、テスト、その他のスクリーニングを適用した結果を指す。\n差別的な影響とは、基準、要件、テスト、その他の審査を適用した結果",
  "data/reddit-changemyview/r/changemyview/comments/pa2vcs/cmv_circumcision_is_an_evil_practice_that_is_no.json": "割礼は明らかに時代遅れで、不必要で、野蛮な行為です。\n割礼が行われている唯一の理由は、ユダヤ人が宗教上の理由でそれを考案し\nそれを他のゴイムにも押し付けたからです。これは明らかに性器切除です。\n私は自分の身に起こったことを恐ろしく侵害されたと感じています。これは...",
  "data/reddit-changemyview/r/changemyview/comments/pa1hux/cmv_any_free_market_given_enough_time_will.json": "u/joopface [/u/joopface]さんとの素晴らしい議論を受けて、私はダウングレードします。\n避けられない」を「特定の分野と時間の長さに応じて、避けられない可能性が高い」に下げます。\nとします。(私がいまだに市場が嫌いなのはお分かりでしょうか？) 皆さん、議論をありがとうございました。\n1時間前に行きたかった自転車に乗ってきます :')\n\n\n\nで、、、。",
  "data/reddit-changemyview/r/changemyview/comments/pa3hvk/cmv_people_who_say_it_is_impossible_for_them_to.json": "まず言いたいのは、そう感じている人への共感と、それを十分に理解できること。\n誰かがそのことに不満を持っていることは理解できます。\n\nしかし、外見の違いだけで恋愛が「終わった」と主張するのは理解できません。\n終わった」という主張は理解できません。\n\n現実には、そのようなことはありません。",
  "data/reddit-changemyview/r/changemyview/comments/padj2r/cmv_an_opened_relationship_is_not_an_actual.json": "複数の配偶者を持つような宗教的な関係のことではありません。\n配偶者が複数いるような宗教的な関係のことではありません。交際していても、他のランダムな人たちといつもファックしている人たちのことです。\n他のランダムな人たちといつもファックしている人たちのことよ。それって、どうやって付き合うの？あなたは\nパートナーに忠誠を誓っているとは言えませんよね。また、それは...",
  "data/reddit-changemyview/r/changemyview/comments/pahsjk/cmv_woodrow_wilson_was_the_worst_president_in_us.json": "彼はあからさまな人種差別主義者で、連邦政府に隔離を導入し、ワシントンD.C.にジム・クロウを導入しました。\nクロウを導入しました。\n\n彼は南部でのリンチを制限することはせず、クー・クラックス・クラン（KKK）を全面的に支持しているように見えました。\n彼は南部でのリンチを制限せず、クー・クラックス・クラン(KKK)を全面的に支持しているように見えました。\n\n彼と彼の政権は、人種関係を少なくとも50年は後退させました。",
  "data/reddit-changemyview/r/changemyview/comments/pao8zt/cmv_we_should_have_more_movies_and_books_with_a.json": "エンターテインメントの世界には、悪と戦う高貴な主人公たちが登場します。\n自分の欠点を改善しようとし、最終的には世界を救うヒーローとして見られる。\n世界を救うヒーローとして登場します。悪役が登場する本や映画は比較的少ないです。\n悪役が前面に出てくる本や映画は少ないですが、それは悪いことです。\n\nまず、観客が...",
  "data/reddit-changemyview/r/changemyview/comments/paoet6/cmv_out_of_school_suspension_for_high_schoolers.json": "公立学校には、子供を路上に出さないという複数の機能があります。\n子供たちの社会化、社会の教訓を子供たちに伝えること、そして当然ながら\nそしてもちろん教育です。弁護士ドットコムによると\n[https://www.lawyers.com/legal-info/research/education-law/what-kinds-of-behavior-can-lead-to-suspension-from...",
  "data/reddit-changemyview/r/changemyview/comments/papieo/cmv_republicans_value_individual_freedom_more.json": "銃政策、気候変動、COVID-19政策を例に挙げてみましょう。\nこれらの問題に対する共和党の態度は、個人の利益や自由を重視し、集団の安全を犠牲にします。\n集団の安全を犠牲にしている。\n\n銃の場合は、銃の数が多ければ多いほど......ということを示す証拠が圧倒的に多い。\n銃が多ければ多いほど...",
  "data/reddit-changemyview/r/changemyview/comments/pas5eo/cmv_a_woman_slapping_a_man_is_abusedomestic.json": "何十年もの間、女性が怒ったり感情的に攻撃されたりしたときに男性を叩くことが許容されることが常態化しています。\n感情的に攻撃されたと感じたときに、女性が男性を叩くことが許容されることが何十年も前から普通になっています。肉体的な暴力は、非肉体的な暴力に対する\n肉体的な暴力は、非肉体的な暴力に対する適切な反応であってはなりません。\n\n私はこのことを、男性が次のようなことをするのは決して許されないという事実と同じように考えています。\n殴る...",
  "data/reddit-changemyview/r/changemyview/comments/paqlx8/cmv_everyday_people_will_have_to_make.json": "大企業が炭素問題の大部分の原因であり、気候変動の責任を負うべきだということはよくわかります。\n大企業が炭素問題の大部分の原因であり、気候変動の責任の多くを負うべきだということはよく理解しています。そして\n積極的に気候変動に立ち向かうためには、化石燃料や廃棄物の使用を制限するような\n化石燃料の使用や浪費を制限する法律が必要だと思います。",
  "data/reddit-changemyview/r/changemyview/comments/pasw8n/cmv_immigration_benefits_the_rich_but_not_the_poor.json": "多くの人が、移民は経済や国民にとって有益であると主張したがります。\n人々のためになります。誰もが利益を得ることができると主張しています。しかし、2015/16年の欧州移民危機を見ると\n2015/16年のヨーロッパの移民危機を見ると、2021年には全移民の約半分がまだ仕事を持っていない。\n2021年になっても移民の約半数が仕事を持っておらず、残りの半数のほとんどが低スキル・低賃金の仕事しかしていない...。",
  "data/reddit-changemyview/r/changemyview/comments/pazebm/cmv_it_is_perfectly_fine_to_only_want_to_date.json": "タイトルには、この景色がよく表れています。私は意図的にかなり包括的に話しています。\n共和党員や民主党員とはデートしない」かもしれないし\nスター・ウォーズが好きでない人とはデートしない」とも言えます。\n\n自分と相性の良い人を求めることに問題はないと思いますが...。",
  "data/reddit-changemyview/r/changemyview/comments/pb2v4p/cmv_most_people_would_be_okay_living_under_a.json": "まず第一に、私はほとんどの人が独裁政権を望んでいるとか、独裁政権を引き起こそうとしているとは言っていません。\n起こそうとするとは言っていません。確かに今はこのような人が増えていますし、それを目の当たりにしてきました。\nしかし、ほとんどの人は、あるレベルでは平和を望んでおり、そのためには\n波風を立てたくないのです。そうは言っても、もしも独裁政権が...。",
  "data/reddit-changemyview/r/changemyview/comments/pba7o1/cmv_all_healthcare_employees_and_public_sector.json": "これは、これらの非常に重要な職業を浄化するための絶好の機会です。\n狂っていたり、騙されていたり、危険だったり、知性がなかったり。\n\n医療関係者は、医学に忠実であることを要求されるべきです。\n医師や看護師がワクチン反対派である場合、仕事を続けることは許されません。\nワクチン反対派の医師や看護師は仕事を続けられないようにすべきです。なぜなら...",
  "data/reddit-changemyview/r/changemyview/comments/pbahj5/cmv_there_is_nothing_morally_wrong_with_eating_an.json": "コンテキストです。道徳的な理由から菜食主義を試してみようと考えていましたが、朝からオムレツを食べるのは大変だと感じています。\n倫理的な理由からヴィーガンに挑戦しようと考えていますが、朝のオムレツをやめるのは大変だと思っています。私の両親は\n私の両親は放し飼いにされた鶏を飼っていて、私たち家族を養うのに十分な卵を産んでくれます。\n家族の生活を支えるだけの卵を産んでくれます。この鶏は、特別に飼っているわけではありません。",
  "data/reddit-changemyview/r/changemyview/comments/pbd8xk/cmv_if_we_really_care_about_structural_inequality.json": "不平等をめぐる議論の多くは、所得に焦点が当てられがちです。私の考えでは\nのような基本的なもののコストが高い世界では、これは限定的な意味しかないと思います。\n避難所、医療、教育といった基本的なもののコストが非常に高い率で上昇している世界では、これはあまり意味がないと思います。私の意見では\nこの問題に純粋に取り組むためのより良い方法は、技術的な知識を活用することです...",
  "data/reddit-changemyview/r/changemyview/comments/pbcmt1/cmv_feminism_should_be_renamed.json": "さて、それではお付き合いください。最初に言っておきます。私は自分のことを\n私は自分をフェミニストだと思っています（この言葉は、女性は社会的地位を確立すべきだという考えを支持する人という意味で使っています）。\n女性が男性と同じ権利と機会を持つべきだという考えの支持者という意味で使っています）。)\nしかし、私は「ジェンダー平等主義」という言葉を使いたいと思っています...",
  "data/reddit-changemyview/r/changemyview/comments/pbepyr/cmv_the_lack_of_a_dislikedownvote_button_on_major.json": "私の見解 欧米で最も人気のあるソーシャル・メディア・プラットフォーム、すなわちFacebook。\nInstagram、Twitterの3つのソーシャルメディアには、「ダウングレート」に相当する反応がありません。これは\nRedditが過去10年以上にわたって示してきたように、ダウンボーテよりもアップボーテがはるかに多いコンテンツは\nRedditが過去10年以上にわたって示してきたように、ダウンボットよりもアップボットがはるかに多いコンテンツは、アルゴリズムのランキングで上位に移動し、...",
  "data/reddit-changemyview/r/changemyview/comments/pbfchx/cmv_it_is_irresponsible_to_have_children_when.json": "酷いとは言いません。ただ無責任なだけなのです。家計が厳しいなら\n子供を持てば、さらに財政が厳しくなります。もしあなたが地方に住んでいるならば\n世帯全体の年収が8万円を超えてから子供を作った方がいいと思います。\n(もしあなたが高価な地域に住んでいるなら、（二人とも年収4万円）子供を産むのは、世帯全体の収入が8万円を超えてからの方がいいと思います。",
  "data/reddit-changemyview/r/changemyview/comments/pbhj3v/cmv_what_we_learned_during_the_pandemic_leads_to.json": "OK、これは私にとって感情的に大きな問題ですが、できる限り客観的に\nできる限り客観的で合理的な意見を述べたいと思います。また、私は自分の考えをここで納得してもらいたいと思っていることも指摘しておきたい。\n私の考えが間違っていることをここで確信してもらい、もっと希望を持ちたいと思っています。\n希望を持っています。\n\n見解は\n\n 1. ほとんどの専門家の意見である...",
  "data/reddit-changemyview/r/changemyview/comments/pbontx/cmv_censoring_and_banning_social_media_antivaxx.json": "antivaxxの定義は、すべてのワクチンに反対している人たちです。本来の定義\n本来の定義は、COVIDが起こる前のものです。\n\n私たちは、発言力のある人を未知のプラットフォームで検閲するという段階は過ぎたと思っています。\nなぜなら、彼らは今やどこにでもいるからです。RedditやFacebookだけではありません。\nツイッターだけではありません。それは...",
  "data/reddit-changemyview/r/changemyview/comments/pby7dy/cmv_genocides_arent_worse_than_other_genocides.json": "位のジェノサイドなんてありません。原住民の抹殺。\n族、宗教、同胞などの絶滅は、どれも同じように恐ろしいものです。ザ\nホロコーストは、アメリカ大陸のジェノサイドよりも「良い」「悪い」ということはありませんでした。\n\nカンボジア人、ルワンダ人、ギリシャ人、その他にもたくさんの人がジェノサイドを起こしています。\n\n私はそうではありませんが・・・。",
  "data/reddit-changemyview/r/changemyview/comments/pbzkp5/cmv_within_the_scope_of_deliberations_on_public.json": "この国、アメリカでは、教会と国家の間に意図的な壁があるとされています。\n教会と国家の間には意図的な壁があるとされています。国家は、市民の公私の生活において、巨大な権力と影響力を行使することができます。\n国家は、市民の公私にわたる生活に大きな力と影響力を行使することができます。教会と国家の分離は\n教会と国家の分離は、それぞれの団体を他の団体から守るためのものです。国家は...",
  "data/reddit-changemyview/r/changemyview/comments/pc1eam/cmv_blackwater_evacuating_people_from_afghanistan.json": "ブラックウォーターがアフガン難民を避難させているということで、多くの人が騒いでいます。\nブラックウォーターは、6,500ドルを支払う意思と能力のあるアフガン難民を避難させているからです。これがブラックウォーターの悪徳商法のように見えるのは理解できます。\nブラックウォーターの悪徳商法のように思われるのもわかりますし、そうかもしれませんが、実際のところ世界は\nしかし、真実は、彼らがこのようなことをすることで、世界はより良い場所になるということです。彼らは決して...",
  "data/reddit-changemyview/r/changemyview/comments/pc318e/cmv_we_should_normalize_males_working_in.json": "私の甥っ子が最近pre-kに入ったのですが、ふと思ったことがあります。\n男性の幼稚園の先生を見たことがないような気がします。子供の世話をする必要のある分野で、子供の基本的な車の運転を任せられない男性が、どうして役割を持てるのでしょうか？\n子供の基本的な世話を任せられない男性が、子供の世話を必要とする分野で役割を果たすことができるでしょうか？\n父親は、オムツを替えたり、トイレを手伝ったり、寝かしつけをしたりします。",
  "data/reddit-changemyview/r/changemyview/comments/pc20ch/cmv_albums_of_live_performances_are_the_worst_of.json": "これは、スタジオアルバムがライブよりも優れているとか、その逆ということではありません。どちらも素晴らしいし\nどちらも素晴らしく、音楽に異なる側面をもたらします。\n\nスタジオ・アルバムは、高度に洗練され、プロデュースされたバージョンの曲を提供し、それは素晴らしいことです。\nこれは素晴らしいことです。エフェクトを使ったり、メンバーが複数の楽器を演奏したりするバンドは\nバンドがエフェクトを使ったり、メンバーが複数の楽器を演奏したりする場合、それは...",
  "data/reddit-changemyview/r/changemyview/comments/pc2l9d/cmv_the_us_prison_system_is_broken_and_doesnt.json": "誤解を恐れずに言えば、刑務所の目的は誰かの行動を罰して、その行動を繰り返さないように教えることです。\n刑務所の目的は、誰かの行動を罰し、同じことを繰り返さないように教えることです。アメリカの刑務所システムはこの目的を達成することはできません。\nアメリカの刑務所制度ではこの目的を達成することはできませんし、それに近いものでもありません。ヨーロッパ（特にノルウェーや北欧）の刑務所を見てください。\n(ヨーロッパ（特にノルウェーやスカンジナビア）の刑務所を見てください。",
  "data/reddit-changemyview/r/changemyview/comments/pc8t95/cmv_theres_nothing_wrong_with_having_a_60_height.json": "私は身長175cmの男性なので、その基準には当てはまりませんが、私のような人間には問題がありません。\nしかし、それを問題にすることはありません。肉体的な魅力は人間関係の大きな部分を占めており、とても重要です。\n重要です（見た目は重要です）。女性が180cm以上の男性が好きだとか、それとしか付き合わないと言っても、それは間違いです。\n女性が身長180cm以上の男性が好みだとか、その男性としか付き合わないと言うと、背の低い男性は怒って、まるで彼女が...というような態度を取るでしょう。",
  "data/reddit-changemyview/r/changemyview/comments/pcawwd/cmv_social_media_are_ruining_my_generation.json": "私は20歳の男性ですが、ソーシャルメディアは私たちの世代にとって、良いことよりも悪いことの方が多いと思います。\n聞いてください。彼らは包括性を教えていません。\n私は20歳の男性です。性を賛美している。\n性的労働を悪い意味で賛美し、それを奨励することになります。",
  "data/reddit-changemyview/r/changemyview/comments/pcd1ml/cmv_its_hypocritical_for_western_nations_to_trade.json": "サウジアラビアは中東最大のテロ資金提供者であり支援者である\n援助しています。彼らはISISを創設し、テロリスト集団に資金を提供しています。\nサウジマネーはイスラム国家に資金を提供し、サウジ市民は大量に彼らのために戦い、ワッハーブ主義の政府は見て見ぬふりをする。\nワッハーブ主義の政府は見て見ぬふりをしている、なぜなら彼らの...",
  "data/reddit-changemyview/r/changemyview/comments/pcd4u5/cmv_it_may_still_be_too_early_to_say_whether.json": "アメリカは民主主義の成功例のように思われていますが、実際にはその歴史のほとんどで\n実際には、その歴史のほとんどにおいて、非常に非民主的でした。実際、女性が投票できるようになったのは\n女性が投票できるようになったのは1920年代に入ってからです。地域の政策によっては、投票できる人にもっと制限がありました。\n政策によって、投票できる人が制限されていました。また、ご存知のように、初期のアメリカでは、（白人）男性のみが...",
  "data/reddit-changemyview/r/changemyview/comments/pcbc52/cmv_mandatory_resort_fees_at_hotels_should_be.json": "リゾートフィーとは、ホテルに宿泊する際に必要となる追加料金のことです。\nリゾートフィーとは、ホテルに宿泊する際に必要な追加料金のことで、理論的には、ホテルが提供する特定のアメニティを利用することができます。私は、このような\nこの種の料金は、おとり商法として禁止されるべきであり、いかなる必須料金であれ\nはすべての広告価格に組み込まれるべきだと思います。私は...",
  "data/reddit-changemyview/r/changemyview/comments/pcfkev/cmv_onlyfans_is_not_distasteful_because_of_the.json": "私の知る限り、パラソーシャルな関係が破壊的であるというのは議論の余地がありません。\n破壊的である。\n[https://www.pbs.org/wgbh/nova/article/parasocial-relationships/]\n\nこのような関係は、有名人の崇拝や極端なファンダムの形をとることが多い。\nこのような関係は、有名人の崇拝や極端なファンダムの形をとることが多く、人が公人に夢中になる...",
  "data/reddit-changemyview/r/changemyview/comments/pcba0l/cmv_assisted_suicide_by_euthanasia_should_be.json": "心身ともに深刻な病気にかかり、幸せな生活を送ることができない人には\n幸せな生活を送ることができない場合は、平和的な自殺幇助の選択肢があるべきだと思います。\nこのような人々を生かしておくことは利己的であり、これに反対しているのは私のような経験のない人々だけです。\n反対しているのは、その人たちに会ったことのない人や",
  "data/reddit-changemyview/r/changemyview/comments/pclw4n/cmv_children_have_absolutely_no_obligation.json": "多くの親（特にアジア文化圏（私はアジア人です））は、親が子供に老後の面倒を見ることを期待しています。\n世話をしてくれることを期待したり、言い訳をしたりします。\n私たちはあなたを保護し、食事を与え、衣服を着せたのだから、私たちが年を取ったら同じようにしなければならない」というような言い訳をします。\n私たちが年を取ったら、あなたも同じことをしなければなりません。\n\n私は絶対にそんなことは信じません。....",
  "data/reddit-changemyview/r/changemyview/comments/pcjmrq/cmv_calling_upon_reddit_to_delete_blatant.json": "Redditは全体的に、物議を醸すような情報や、全く正しくない情報も許容する傾向があります。\nこのサイトの情報は このことは、sinoのようなサブレディットで何度も実証されています。\nこのことは、天安門事件は起こらなかったと主張するsinoのようなサブレディットで何度も証明されています。\nこれは間違いなく危険なことであり、彼らに天安門事件の新たな弾みを与えることになるからです。",
  "data/reddit-changemyview/r/changemyview/comments/pcpxvu/cmv_its_perfectly_fine_better_even_to_crack_an.json": "YouTubeの料理動画をよく見ていると、シェフたちは必ずカウンターの上で卵を割っているようです。\n卵をカウンターの上で割っているようですが、中には「私は卵を割っていません」とはっきり言う人もいます。\nそれが正しい方法だと言う人もいます。私のやり方とは違うのかもしれませんが、いつも\n私がやってみると、いつも悪い結果になってしまいます。\n\nカウンターの割れ。私の場合は...",
  "data/reddit-changemyview/r/changemyview/comments/pcrynf/cmv_i_see_lots_of_people_on_reddit_talk_about_how.json": "ツイッターの話になると、みんな絶対にあのサイトを嫌っているようです。\nサイトです。それなのに、今、フロントページにはいくつかのツイートがあります。\nツイッターのスクリーンショットを投稿することに特化したサブレディットもあります。私は\n私はtwitterを頻繁に使っていないので、twitter上の人々が何をしているのか混乱しています...",
  "data/reddit-changemyview/r/changemyview/comments/pcl3rj/cmv_its_desirable_for_youth_to_incur_minor_but.json": "最近、若いドライバーが交通渋滞の中を狂ったように運転する映像をよく目にします。\nその多くが激しい事故、時には死に至るような事故を起こしています。自分自身の愚かさから\n自分の愚かさから15歳でトラックに轢かれてしまった者として、1つの事故だけでも\nたった一度の事故で、すべてが終わってしまうという事実をより強く感じました。",
  "data/reddit-changemyview/r/changemyview/comments/pcqisj/cmv_businesses_should_use_rolling_periods_to.json": "例えば、あなたが自動車ディーラーの従業員であれば、月に30台の車を販売するという目標を持ち、それ以上販売すれば、500ドルのボーナスを得ることができます。\n月に30台の車を売ることを目標とし、それ以上売れた場合には、30台以上の車1台につき500ドルのボーナスを得ることができるとします。\nボーナスは30台を超えるごとに500ドル。私はこのようなことは、従業員や顧客が損害を与えるような行動をすることを助長すると思います。\nこのようなことは、従業員や顧客がビジネスに損害を与えるような行動をとることを助長し、...",
  "data/reddit-changemyview/r/changemyview/comments/pcvcn5/cmv_its_ok_to_use_the_word_decimate_as_a_synonym.json": "12月は文字通り「10番目の月」という意味ですが、12月を「12番目の月」と呼んでも誰も怒りません。\n12月は文字通り「10番目の月」を意味します。では、なぜ他の人たちはそんなに怒るのでしょうか？\n\"decimate \"という言葉が、大きく打ち負かされたものを表現するのに\nなぜ他の人は怒っているのでしょうか？\n\n言葉は時代とともに変化します。例えば、「鹿」という言葉は、かつて...",
  "data/reddit-changemyview/r/changemyview/comments/pcz5to/cmv_blueberries_are_the_best_berry.json": "多様性\n\nパイ、ジャム、スムージー、マフィンなどなど、ベリー類の中でも\n謙虚なブルーベリーほど使い道の多いベリーはありません。イチゴには病みつきになるアイスクリームを作るという利点があります。\nしかし、最後にストロベリーマフィンを見たのはいつですか？I\nないと思っていました。クランベリー・ジュースはいいかもしれませんが...。",
  "data/reddit-changemyview/r/changemyview/comments/pd58lk/cmv_the_concept_of_the_friendzone_being_some.json": "断られるのは他の人と同じようにつらいことだと思いますが、友人に声をかけるときの\n友達、特に親友に声をかけるときのリスクですよね。\n親友ですからね。そんなことをしたら、何が待っているかわかりますよね。を知っておくべきです。\n友達になれるかどうかを知るべきです。",
  "data/reddit-changemyview/r/changemyview/comments/pd8kuo/cmv_the_world_would_be_better_off_if_mosquitoes.json": "夏も終わりに近づき、ありがたいことに蚊のシーズンも終わりました。毎年\n毎年、蚊に刺されないように、そして何かの病気にかからないように、ディートを塗りたくらなければなりません。\n蚊に刺されないように、そして何かの病気にかからないように。\n\n蚊が地球上に存在するのは、単に寄生して病気を広めるためです。",
  "data/reddit-changemyview/r/changemyview/comments/pdcacs/cmv_men_should_not_be_forced_to_support_their.json": "女性は、妊娠した後、母親にならず、それに伴うすべての責任を負わないと決めることができます。\n女性は、妊娠した後に母親にならず、それに伴うすべての責任を負わないと決めることができます。私の住んでいる地域では、中絶をするか、子供を養子に出すかを選ぶことができます。\n中絶するか、子供を養子に出すかを選ぶことができます。妊娠後に親になりたいかどうかを決めるのは\n妊娠後に親になりたいかどうかを決めることができます。男性には選択の余地がありません、後に...。",
  "data/reddit-changemyview/r/changemyview/comments/pddz0n/cmv_affirmative_action_for_college_admissions.json": "タイトルです。まず、私自身を例に挙げます。私はルンビー族インディアン\n(カード保持者）なので、大学は多くの機関から無料で提供されています。\n\n問題は、私の家族の多くが住んでいるノースカロライナ州ロベソン郡に私が住んでいないという事実から生じます。\n私の家族の多くが住んでいるノースカロライナ州ロベソン郡に私が住んでいないこと、そしてルンビー族が白人よりも貧しい傾向にあることです。\nルンビー族は白人よりも貧しい傾向にありますから...。",
  "data/reddit-changemyview/r/changemyview/comments/pddibd/cmv_debates_are_better_online_because_you_cant.json": "ある人がテーブルを置き、「Pro Life, change my view」と書かれたサインを出しています。さらに多くの人が会話に参加すると\n会話に参加する人が増えると、群衆のメンバーは「性差別主義者の豚」「私の体には権利がある\n私の体には私の権利がある」などと叫んで、より攻撃的な罵声を浴びせています。議論のポイントは\n討論会の目的は、人の心を本当に変えることでしたが、それは...。",
  "data/reddit-changemyview/r/changemyview/comments/pdon9h/cmv_if_smokers_can_be_refuse_lung_transplants_in.json": "病院がいっぱいで、他の人が来ても治療を拒否されている\n病院が満杯になり、他の病気で治療を受けられない人が出ています。ある退役軍人は虫垂炎で亡くなりました。\n虫垂炎で亡くなった退役軍人もいます。もういい加減にしてください。ミュータントを危険にさらしている人たちには\nワクチンを接種した突然変異のコビットを危険にさらしている人々には同情できません。",
  "data/reddit-changemyview/r/changemyview/comments/pdjhk3/cmv_do_your_own_research_is_antithetical_to_the.json": "今の社会があるのは、主に人間が仕事を区分けできるようになったことに起因しています。\n人間が仕事を区分けできるようになったからだと思います。\n\nいつからか（古代ギリシャかな？\nすべての人がすべてのことを知る必要はないことに気づいたのです。私たちは、ある分野に特化して仕事をすることができます。\n特定の分野に特化した仕事を...",
  "data/reddit-changemyview/r/changemyview/comments/pdr4hy/cmv_automated_banning_of_people_who_participate.json": "数年間参加していなかったsubreddit（/r/pokemongo）から追放されました。\n(/r/pokemongo)から追放されました。なぜなら、私が参加していない別のsubredditで1つのコメントをしたからです。\nその理由は、私が積極的に参加していない別のサブレディット（/r/conspiracy）で1つのコメントをしたからです。私はたまたま/r/conspiracyに立ち寄り、コビドの陰謀を嘲笑しました。\n私はたまたま/r/conspiracyに立ち寄り、コビドの陰謀論を嘲笑しました。その結果、「参加している」という理由で即座にBANされてしまいました...。",
  "data/reddit-changemyview/r/changemyview/comments/pdv8vz/cmv_if_a_man_discovers_he_is_not_the_father_he.json": "下記のようなストーリーのReddit Postを何度も見てきました。\nそれに対するコメントを見ていると、自分がそのようなことをしているのではないかと思えてきます。\nこの種の問題については、私の方が尻込みしているのかもしれません。\n\n男が子供を育てる\n\n女性が浮気をし、父性について嘘をついていたことを知る\n\n男性はどうしたらいいかと尋ねる\n\nReddit Hivemind says...",
  "data/reddit-changemyview/r/changemyview/comments/pdx5hb/cmv_it_is_not_wrong_to_think_religious_people_are.json": "個人的にはどの宗教も信じていません。\n育ちましたが。私が聞いた議論の中には、「神の存在を証明することはできない。\nis not real.\" 歯の妖精が実在しないことも証明できませんが、だからといってあなたの妄想を\n実在すると信じているあなたを妄想だと思うことはできません。それは宗教のようなもので...",
  "data/reddit-changemyview/r/changemyview/comments/pdyqxj/cmv_americans_really_need_to_get_on_the_bidet.json": "去年、トイレットペーパーが不足していたとき、私はトイレットペーパーを取り合う代わりにビデを注文しました。\nトイレットペーパーを取り合う代わりにウォシュレットを注文しました。その結果、トイレットペーパーの使用量が減り、お尻の穴もきれいになりました。\nその結果、トイレットペーパーの使用量が減り、お尻の穴がきれいになり、お尻を触る回数もトイレットペーパーを使っていた時よりも格段に減りました。\nトイレットペーパーを使っていた頃に比べて、肛門を触る回数が減りました。\n\nビデは優れていて、価格も手頃で、はるかに良い選択肢だと思います。",
  "data/reddit-changemyview/r/changemyview/comments/pdz4ll/cmv_when_interviewing_members_of_the_taliban_it.json": "アフガニスタンからの重要なニュースを受けて、多くの人が\nカブールで行われている避難などの状況について、多くの人が情報を求めています。\nカブール\n\nBBC、ABC、アルジャジーラなどは、女性レポーターを現地に配置して、タリバンのリーダーにインタビューしています。\nタリバンのリーダーにインタビューして、重要な情報を得ようとしています。",
  "data/reddit-changemyview/r/changemyview/comments/pe3f3c/cmv_politicians_spreading_vaccine_disinformation.json": "政治家は、特に今回のパンデミックのような大きな出来事の際に、私たちを導くために選ばれます。\n政治家は、特に現在のパンデミックのような大きな出来事の際に、私たちを導くために選ばれます。専門家の科学的データを無視して、市民にワクチンを信用するなというのは\nワクチンを信用しないように市民に伝え、文字通り人々を殺しています。これらの人々は、社会的にも法律的にも影響力を持っています。\n社会的にも、彼らが支持する法案にも影響力があります。私が言っているのは...",
  "data/reddit-changemyview/r/changemyview/comments/peh7oq/cmv_it_should_be_illegal_to_market_nonpermanent.json": "編集：私の言いたいことが明確ではなかったかもしれませんが、私が対象としているのは言葉ではなく、その言葉が伝える意味です。\n狙っているわけではなく、それらが伝える意味を 具体的な例を挙げて説明してみます。\n具体的な例で説明します。\n\n一般的な言い方としては、「GAME on PLATFORM」があります。\n\n\"Get Transport Fever 2 on GOG Galaxy \"は、ゲームを入手して...",
  "data/reddit-changemyview/r/changemyview/comments/pe6x4m/cmv_there_should_be_an_age_limit_for_us_president.json": "ここ数年の選挙では、私たちの選択がすべて超高齢者で、私たちの郡を代表していないことにうんざりしています。\n私たちの郡を代表していないのです。若い人たちが必要だと思います。\nほとんどの人が65～70歳で引退します。なぜ彼らが国を動かす必要があるのでしょうか？\n認知機能の低下が始まっていた大統領もいたのに...。",
  "data/reddit-changemyview/r/changemyview/comments/pelbp2/cmv_tipping_culture_is_toxic_and_needs_to_be_done.json": "私たちは、サーバーや宅配便のドライバーにチップを払わないと、すぐに権利を主張する人、わがままな人、失礼な人という烙印を押される社会に生きています。\nチップを払わないと、すぐに「権利がある」「わがままだ」「失礼だ」と言われてしまう社会です。サーバーの中には\n唾を吐いたり、食べ物をいじったりして脅し、わざとひどいサービスを提供する。\nチップを払わないからといって、注文の配達を拒否するサーバーもいます。",
  "data/reddit-changemyview/r/changemyview/comments/pem04k/cmv_the_educationlabor_system_in_the_united.json": "私は教育と労働を一緒にしていますが、これは密接な関係があるからです。\n教育の目的は、下の世代に教えて人々が知識を得るだけでなく、人々がキャリアを積んで生産的な生活を送れるようにすることです。\n教育の目的は、下の世代の人々に知識を与えるだけでなく、人々がキャリアを積んで生産的な生活を送れるようにすることです。\nそこで、今回は3つのパートに分けてご紹介します。\n\nパート1 K...",
  "data/reddit-changemyview/r/changemyview/comments/pemlsq/cmv_religious_exemptions_to_lawsregulations.json": "私が思うに、宗教上の免除とは、「この規則に従わなくてもよいという確固たる信念を持っているなら、この規則に従わなくてもよい」ということです。\nこのルールに従わなくてもよいという確固たる信念があるなら、そのルールに従わなくてもよい。\n\"ということです。ただし、「このルールに従うべきではない」と強く思っている人たちが、あらかじめ承認されたグループに属している場合に限ります。\nそのルールに従わなくてもよいと強く思っている人たちのグループに属している場合に限ります。\n\nI...",
  "data/reddit-changemyview/r/changemyview/comments/percty/cmv_if_youre_antivax_because_you_believe_in_my.json": "すべての原因は、私がアンチワクチン派から聞いている「私の体、私の選択」という反応にあります。\n私の選択 \"という言葉は、私たちが賛成派から聞いていた言葉と非常によく似ています。\nこれは長い間、プロチョイス運動から聞かされてきたこととよく似ています。私は、もしあなたがこの言葉を信じて\nこの言葉を信じて反ワクチンを主張するのであれば、あなたは...",
  "data/reddit-changemyview/r/changemyview/comments/pf7x1g/cmv_raita_is_a_place_for_people_to_get_their.json": "私が見るAITAの投稿の90％は、道徳的に問題のある判断や行動を投稿し、その行動を称賛されている人たちです。\n判断や行動を投稿して、その行動を称賛されています。\n\n実際に投稿者の行動を非難するような投稿はほとんどありません。\nまた、対立する両方の側面を見ようとする投稿もほとんどありません。\n\nさらに、いくつかの結果は...",
  "data/reddit-changemyview/r/changemyview/comments/pey51f/cmv_steve_irwin_regularly_took_stupid_risks_with.json": "まず最初に、スティーブ・アーウィンは純粋にいい人だったようだと言いたい。\n大きな心の持ち主だったようです。彼は明らかに動物を愛し、その保護に人生を捧げていました。\n守ることに人生を捧げていました。\n\nこのことから、多くのRedditerの目には当然ながら彼がヒーローとして映っています。私は彼を人間として攻撃するつもりはありません。\n人としての彼を攻撃するつもりはありません。彼はこんなことになるとは・・・。",
  "data/reddit-changemyview/r/changemyview/comments/pfamvb/cmv_if_it_makes_your_life_better_and_doesnt_cause.json": "神が存在するかどうかについて書かれた言葉はあまりにも多く、神を信じることが合理的かどうかについてはあまり書かれていないように思います。\n神を信じることが合理的であるかどうかについては十分に書かれていないと思います。私は、これを\n私は神が存在しないという前提でこれを書くつもりです。\n私は、神は存在しないという前提でこの文章を書くつもりです。なぜなら、その方が平均的なRedditユーザーに響くと思うからです。",
  "data/reddit-changemyview/r/changemyview/comments/pfbcp1/cmv_silencing_covid_antivaxxers_etc_isnt_the.json": "多くのサブレディットが非公開になり、NoNewNormalなどのサブレディットを禁止するようにRedditに働きかけようとしているのを見て\nNoNewNormalなどのサブリットを禁止するためにRedditに働きかけて非公開にするサブリットを多く見てきて、人やコミュニティをどう扱うかについて考え始めました。\n議論を呼ぶような意見を持つ人々やコミュニティをどのように扱うかについて考えさせられました。\nRedditは反響室としては常に悪いものでしたが...。",
  "data/reddit-changemyview/r/changemyview/comments/ov9foo/cmv_i_think_celebrities_should_be_more_open_about.json": "もし誰かがジム・シャーク・アスリート、IFBBプロ、あるいは20ポンドの体重を増やしたただの俳優であるならば\nチキンライスやブロッコリーを食べて筋肉をつけるというのは、現実にはほとんど\nしかし、多くの人が、このような人たちはステロイドを使用していると考えています。\n自然で、一生懸命トレーニングして、ダイエットすれば...。"
}