{
  "data/reddit-changemyview/r/changemyview/comments/mhlcu1/cmv_food_delivery_apps_are_bad_for_everyone_but.json": "私は、3つの異なるフードサービス会社で働いた経験があります。\n中規模のフランチャイズブランドで、そのビジネスモデルは主にデリバリーに基づいていました。\n宅配を中心としたビジネスモデルを持つ中規模のフランチャイズブランド、テイクアウト／宅配を中心とした大規模なフランチャイズ、そして地元で経営されている会社の3つのフードサービス会社で働いた経験があります。\nそして、地元で経営されている会社では...。",
  "data/reddit-changemyview/r/changemyview/comments/mhq9vf/cmv_prochoice_and_allowing_women_to_abort_their.json": "私はプロライフの主張を理解していますが、なぜ女性には\nしかし、100％正直に言うと、その理由を分解すればするほど、生命を無理矢理奪おうとしているとしか思えないのです。\nその理由を分析すればするほど、彼らは命を強引に世に送り出し、無責任に妊娠した人を罰しているだけのように思えてきます。\n罰しようとしているとしか思えません。\n\nプロライフ派の主張...",
  "data/reddit-changemyview/r/changemyview/comments/mhlobd/cmv_the_primary_reason_why_gender_and_race_are.json": "最初に断っておきますが、私はLGBTQ+や他の人種に対して不寛容ではありません。\nの人種に不寛容ではありません。私は、「私は色盲だから、人種を見ない」というような空想的な意見を持っている人でもありません。\n私は、「私は色盲だから、人種を見ない」などという空想的な意見を持っている人ではありませんし、そのような馬鹿げたこともしません。\n純粋に心の中で「どうでもいい」と思っています。見ないのではなく...。",
  "data/reddit-changemyview/r/changemyview/comments/mho3qu/cmv_modern_psychiatry_needs_to_go_under_major.json": "以下は、私の精神医学に対する最大の問題点です。誰かがそれに反論したり、取り上げたりしてくれると嬉しいです。\n誰かがそれに反論したり、取り上げたりしてくれると嬉しいです。\n\n 1. 精神科の薬は強力で、発達中の脳にどのような影響を与えるか理解していないにもかかわらず、子供たちにかなり自由に与えられています。\n    発達中の脳にどのような影響を与えるのか、全く理解できていないにもかかわらず。I\n    また、私が思うに...",
  "data/reddit-changemyview/r/changemyview/comments/mhtqh8/cmv_true_racial_and_gender_equality_is_marked_by.json": "私の考えでは、純粋に人が判断される真の実力主義とは、そのようなものだと思います。\n判断される真の実力主義こそが、真の人種・男女平等を実現する唯一の方法だと思います。\n真の人種平等、男女平等を実現する唯一の方法です。例えば、職場での採用枠を廃止し\n例えば、職場での採用枠を廃止し、代わりに個人の性格だけで採用することです。",
  "data/reddit-changemyview/r/changemyview/comments/mhqrik/cmv_april_fools_is_an_unpleasant_tradition_that.json": "私はエイプリルフールを知らないので、それも問題の一つかもしれませんが、率直に言って、この\n去年はちょっとサボってしまったので、実際に起こったときの衝撃は大きいです。\nが発生します。\n\nエイプリルフールには、多くの人や場所が、特にソーシャルメディア上で「いたずら」をします。\nソーシャルメディアのために。ここでは、かなり無害な例をご紹介します。",
  "data/reddit-changemyview/r/changemyview/comments/mhvxfe/cmv_there_is_no_legitimate_reason_to_be_an.json": "だから、私は警備員として働いています。最近、私の仕事の中で新しい大きな部分を占めているのが\nマスクを着用するように人々に注意することです。これはご想像の通り\nなぜマスクをしなければならないのか理解できない人たちとの激しい会話になることは必至です。\nなぜ私がこの単純なルールに従うことを求めるのか、理解できない人たちとの激しい会話に発展しています。....",
  "data/reddit-changemyview/r/changemyview/comments/mhyhtb/cmv_any_social_media_site_that_bans_criticism.json": "否定的な意見の嵐がクリエイターに悪い影響を与えるという主張は理解できますが\n否定的な意見の嵐がクリエイターの自尊心を傷つけてしまうという意見は理解できますが、同時にクリエイターである以上、批判を受け止めるだけの成熟した心を持つべきです。\n批判に直面することができます。ソーシャルメディアサイトやアプリで、ポジティブな表現しかしてはいけないというのは\nソーシャルメディアサイトやアプリが、ポジティブな表現しかできないというのは、これまでにないほど愚かなことであり、そのようなことがあってはならないと思います。",
  "data/reddit-changemyview/r/changemyview/comments/mi6ib8/cmv_it_should_be_illegal_for_social_media_to.json": "私は、ソーシャルメディアが存在しない時代に育ちました。私の子供時代は全体的に\n私の子供時代は、ストレスが少なく、インスタグラム以外の活動にも力を入れていました。\nインスタグラム以外の活動に力を入れていました。\n\nこのような活動は、私をより豊かにし、実際の世界での社会性を高めてくれました。\n\nネットいじめの話は数え切れないほどありますが...。",
  "data/reddit-changemyview/r/changemyview/comments/miexkr/cmv_a_creator_of_art_should_not_be_morally.json": "まず、この議論は、誰かが何をすべきかということに焦点を当ててほしい。\n\n例えば、ある作家がアメリカの白人男性だったとします。彼は、男性の深い個人的な経験について書きたいと思うかもしれません。\n男性、女性、ノンケ、ゲイ、小人、様々な人種の個人的な経験について書きたいかもしれません。\nあるいは、5人の白人男性についての物語を書きたいかもしれません...。",
  "data/reddit-changemyview/r/changemyview/comments/mihfen/cmv_american_football_is_no_more_of_a_chess_match.json": "すべてのプロスポーツには、戦略的な調整と反調整が必要です。\n両チームの戦略的な調整が必要です。\n\nほとんどのスポーツでは、それは流動的に、その場で行われ、アナウンサーが何が起こったかを説明する間もなく\nアナウンサーが何が起こったかを説明する間もなく、カジュアルな視聴者がプレーを処理するためにプレーとプレーの間に60秒もありません。\nプレイの間に60秒もないので、何気なく見ている人がそのプレイを処理することもできません。",
  "data/reddit-changemyview/r/changemyview/comments/min0t1/cmv_pulling_yourself_up_by_your_boot_straps_is.json": "イシューに対してよく見られるのが、「自分がやったのだから、自分ができるなら、誰でもできる。\n誰でもできる」というものです。これは、移民、最低賃金、教育の成功など、より広いシステムの中の個人のグループによく適用されます。\n移民、最低賃金、教育の成功など、より広いシステムの中の個人グループに適用されます。\n\nもっと具体的に言うと、このような意見を持つのは、以下のような場合に限られます。",
  "data/reddit-changemyview/r/changemyview/comments/mj71z9/cmv_hunting_for_sport_is_sadistic.json": "だから、狩猟をして、殺した動物を実際に食用や皮革などに利用することには抵抗がありません。\n食用や皮革などに利用することには抵抗がありません。私は肉を食べます。もちろん、それはどこかから来たものでなければなりません。\n個人が狩猟をすることは、従来の肉の入手方法よりも悪いことではありません。\n\nしかし、私はスポーツとしての狩猟を理解することができません。",
  "data/reddit-changemyview/r/changemyview/comments/mj1yey/cmv_the_majority_of_chinese_people_dont_want.json": "私は漢民族です。アメリカと中国の間で育ちました。よく聞かれる質問があります。\nよく聞かれるのが\n\n\"なぜ中国人は、我々が思うほど政府を憎まないのか？\"\n\n現代の中国の政党国家は、悪名高い人権侵害者であるからです。\nである。私は、そのような人権侵害の例をすべて列挙する必要はありません。",
  "data/reddit-changemyview/r/changemyview/comments/mjao8v/cmv_the_thank_you_for_your_service_trend_needs_to.json": "そもそもこの記事は、反軍や反戦の記事ではありません。議論したいわけではありません。\n議論したいわけではありませんので、仕事を続けてください。また、これは\n捨てアカウントでもあります。なぜなら、このテーマについては人々がかなり熱くなることがあるからです。\nこれも捨てアカウントですが、このテーマについてはかなり熱くなることがあります（当然ですが）。",
  "data/reddit-changemyview/r/changemyview/comments/mjbo8a/cmv_i_think_sex_work_is_morally_wrong.json": "今朝、私のガールフレンド、ルームメイトと私は、についての広範な議論をしました。\n議論しました。彼らの意見は、セックスワークは合法化されるべきであり\n正常化すべきだというものです。私も半ば同意しています。セックスワークは合法化されるべきだと。\n\nしかし、道徳的には、セックス・ワークは品位を落とすものであり、怠惰なものだと思います。もし私が...",
  "data/reddit-changemyview/r/changemyview/comments/mjnu3s/cmv_dating_for_many_cultures_but_in_the_us.json": "承諾文化が中心だった2018/19年からは、かなり落ち着いてきたわけですが\nその間、多くの進歩的な人たちが、デートや恋愛の文化を基本的なものに変えようとしていました。\nその間、多くの進歩的な人たちが、私たちのデートや関係性の文化を基本的なものに修正しようとしていました。\n暗黙の了解ではなく、明示的な同意に基づいて、デートや恋愛文化を見直そうとする多くの進歩主義者たちの強い後押しがありました。私が思うに、その...",
  "data/reddit-changemyview/r/changemyview/comments/mjsviy/cmv_emotional_intelligence_is_as_important_as.json": "感情的な知性と自己認識は、次のように重要視されるべきです。\n特に男性の自殺率のような社会的パンデミックが発生している現代では\n男性の自殺率のような社会的なパンデミックが発生している現代では特にそうです。感情的な知性は以下の点で非常に重要です。\n感情的な知性は、他人の傷を見極めるためにも、また自己認識のためにも重要です。",
  "data/reddit-changemyview/r/changemyview/comments/mjj7v7/cmv_reverse_racism_does_exist.json": "私は、人々が逆差別と呼ぶべきではないと思いますが、それは少し紛らわしいからです。\nでも、とにかく どんな人種でも、他の人種を差別することは可能です。そう、私は白人に対しても\n白人に対しても人種差別的になることがあります。人種差別の定義は、肌の色に基づく誰かへの偏見\n人種差別の定義は、肌の色に基づいて誰かに偏見を持つことです。通常、疎外された...",
  "data/reddit-changemyview/r/changemyview/comments/mjxl8g/cmv_tipping_is_bullshit_and_does_nothing_but.json": "イギリス人の視点で書かれています\n\n前置きが長くなりましたが、私は、従業員が本当にサービス以上のことをしてくれた場合、チップを渡すことに反対ではありません。\n前置きが長くなりましたが、私は、従業員が本当にサービス以上のことをした場合、チップを渡すことに反対ではありません。\nこれは以前にも投稿されたことがあると思いますが、個人的には「チップ文化」（特にアメリカ）は\n特にアメリカでは）...",
  "data/reddit-changemyview/r/changemyview/comments/mk21aa/cmv_the_most_unfair_advantage_a_person_can_have.json": "親は子供の将来を助けたり、傷つけたりするものです。お金持ちや教育熱心な親は、自分のお金や知識を\n金持ちや教育を受けた親は、お金や知識の恩恵を子供に与えることができますが、貧乏人や教育を受けていない親はどちらもできません。\n与えることができません。\n\nMark ZuckerbergとKylie Jennerはこの利点の例です。\n\nMark Zuckerbergの父親は、彼にAtari BASICのプログラミングを教えました...",
  "data/reddit-changemyview/r/changemyview/comments/mk3ot0/cmv_it_does_not_make_sense_for_religions_to_spend.json": "私はそれをr/AskReddit [/r/AskReddit]で尋ねたことがありますが、ただ怒った返事が返ってきました。\nちゃんとした会話ではなく、怒った返事が返ってきました。だから、ここでもう一度やってみると、うまくいくと思います。\n\n宗教はどのようにして美しい教会/モスクの建設にお金を使うことを正当化するのでしょうか？\n綺麗な教会やモスク、シナゴーグを建てるためにお金を使うことを、宗教はどのように正当化するのでしょうか？",
  "data/reddit-changemyview/r/changemyview/comments/mk70vi/cmv_its_not_good_or_healthy_to_keep_electing.json": "ジミー・カーターは最近、大統領選に出馬することについて、「私は次のようにすべきだと思います。\n年齢制限を設けるべきだと思います。もし私が80歳で、今より15歳若かったら、大統領としてのストレスや任務をこなすことはできないでしょう。\n大統領としてのストレスや任務をこなすことはできないでしょう」。\n\n彼の言うことはもっともです。良い大統領になりたければ、かなりの努力をしなければなりません...。",
  "data/reddit-changemyview/r/changemyview/comments/mk4h7z/cmv_kneeling_during_the_national_anthem_isnt_a.json": "なぜかというと、国歌斉唱の際に膝をついている人がいるが、それは敬意を表しているわけではない。\n国歌斉唱の際に膝をつくのは、無礼を働いているわけでも、無礼を働こうとしているわけでもありません。それは抗議の一種です。\n建物を壊したり、自分のものではないアクセサリーを盗んだりするのではなく\n私は、国歌斉唱の際に跪くことが、最も...",
  "data/reddit-changemyview/r/changemyview/comments/mkc9zp/cmv_karma_is_a_terrible_system_that_discourages.json": "仮定した信念のある場所に投稿することで何十ものカルマを失う危険性があるだけでなく\n仮定された信念のある場所に投稿することで、その信念に反対する人がその場所に投稿するのを客観的に阻止することになります。\nサブごとにカルマの制限があり、有機的な議論をすることがほとんどできません。\n有機的な議論をすることはほとんど不可能です。なぜなら、あなたは...",
  "data/reddit-changemyview/r/changemyview/comments/mke46f/cmv_we_help_others_because_we_feel_good_about.json": "私たちが下すすべての決断は、自分自身を納得させるための利己的なものだと思います。\n自分を納得させるため、あるいは自分の基本的な反応や潜在意識がそうさせているのだと思います。\n\n慈善活動もこの範疇に入り、本来ならば\n無私の行為です。人を助けようとする過程で、私たちは自分自身を説得するでしょう...。",
  "data/reddit-changemyview/r/changemyview/comments/mk3m14/cmv_i_believe_onlyfans_is_genuinely_damaging_for.json": "最初に言っておきますが、私はセックスに何の抵抗もありません。\nそして、セックスワーカーは基本的な労働者の権利に値すると信じています。\n\nとはいえ、去年からある種のトレンドがあったようです。\n若い人たち（私が見た限りではほとんどが女の子ですが、間違っているかもしれません）が...",
  "data/reddit-changemyview/r/changemyview/comments/mkfjpw/cmv_imperial_japan_was_just_as_bad_as_nazi_germany.json": "アメリカでは、純粋無比な悪の例としてナチズムがよく取り上げられます。I\n帝国日本も同様に悪であったと主張したい。\n\nそれぞれの政権で行われた総死亡数という点では、ほぼ同じ範囲内にあります。\nの範囲内です。ナチスは2500万人の死をもたらしたと言われていますが、私はその上限を見たことがあります。\nとか",
  "data/reddit-changemyview/r/changemyview/comments/mkj6od/cmv_mental_health_should_be_considered_equally.json": "私の考えを主張するには、2つの視点があります。1つは個人の視点で、個人の健康状態を\n個人のウェルビーイングを高め、苦しみを減らすことができます。もう1つは社会的利益です。\n経済的にも社会的にも皆が恩恵を受けるというものです。\n\n今日、私たちは皆、運動や健康な体の重要性を知っていて、人々...",
  "data/reddit-changemyview/r/changemyview/comments/mkwgb4/cmv_i_dont_see_any_benefits_in_waiting_for_sex.json": "結婚する前に、自分たちの相性を知っておくのはいいことだと思います。\n最初のデートでセックスしろとは言いませんが(笑)\nでも、真剣に付き合うなら、どこかでセックスをしなければ、それが「うまくいく」かどうかを知ることはできません。\nしかし、真剣な交際をするのであれば、いつかはセックスをしなければなりません。確かに、「宗教的」なカップルの結婚は多いと思いますが...。",
  "data/reddit-changemyview/r/changemyview/comments/ml2kdq/cmv_while_body_positivity_is_good_and_should_be.json": "人は自分の体に満足すべきです。それが事実であり、あなたが変わり始めるためには\n変わることができます。健康になる前に、自分を好きになる必要があります。自分を愛することで\n自分を愛することで、体重を減らす努力をし、体重を減らそうと決意するのです。\n体重を減らすために、自分を愛するべきです。しかし、体重400ポンドの肥満女性が...と言っても、そんなことはありません。",
  "data/reddit-changemyview/r/changemyview/comments/ml9ii8/cmvmost_people_have_no_clue_what_they_are_talking.json": "最近思うのですが、政治は多くの人にとってちょっとしたスポーツや娯楽になっているようです。\n多くの人にとって、政治はちょっとしたスポーツやエンターテイメントになっていると最近思うようになりました。\n\n私が問題視しているのは、ほとんどすべての人にとって明らかに二極化していることです。\n二極化です。このような二極化は、新しいコミュニケーションの方法が存在し、人々が...\n共有することができます。",
  "data/reddit-changemyview/r/changemyview/comments/mlea21/cmv_everyone_should_be_an_organ_donor_by_default.json": "腎臓透析を受けている若い男性の投稿を見て、このことについて考えさせられました。\n彼の話はよくわかりませんが、誰もが、特に若い世代の人たちが、ずっと待っている必要はないと思います。\n必要な臓器を手に入れるために待機する必要はないのではないでしょうか。\n必要な臓器を待つ必要はありません。私は、年齢に関係なく、誰もが...",
  "data/reddit-changemyview/r/changemyview/comments/ml8cpq/cmv_there_is_no_such_thing_as_humane_warfare.json": "毒ガスや人工的な飢餓など、戦争で使われる「非人道的」な戦術はすぐに非難されますが、兵士が死んでも気にしないようです。\n毒ガスや人工的な飢餓など、戦争で使われる「非人道的」な戦術はすぐに非難しますが、銃弾や大砲、ナイフなどで兵士が死ぬことには関心がないようです。\n兵士が銃弾や大砲、ナイフなどで死ぬことには関心がないようです。地雷で一瞬にして蒸発したとしても、最終的な結果は同じです。\n地雷で一瞬にして蒸発しても、感染してゆっくりと...。",
  "data/reddit-changemyview/r/changemyview/comments/mllqhq/cmv_kids_are_dumb_and_shouldnt_be_allowed_to_have.json": "最初に言っておきますが、私はトランスジェンダーの人たちに何の恨みもありません。もし、あなたが男性として生まれ\n男性として生まれた人が女性になったとしても、何の矛盾もなく「奥さん」と呼びます。\n呼ばせていただきます。衣装を女性らしく変えたい、性別適合手術を受けたい、薬を飲みたい\n性転換手術を受けたり、薬を飲んで体質を変えたり...。",
  "data/reddit-changemyview/r/changemyview/comments/mlnld7/cmv_sexual_harassment_training_should_include.json": "妻は職場でのセクハラ研修を終えたばかりで、男性がどのように女性に嫌がらせをしているかという統計を私に話してくれました。\n男性が職場でどのように女性に嫌がらせをするかの統計を話してくれました。私は彼女に、女性が男性に嫌がらせをする割合は？\n女性が男性に嫌がらせをする割合は？彼女のトレーニングには何も含まれていませんでした。I\nそれはとても奇妙で、性差別的だと思いました。私は統計を取るべきだと思います...",
  "data/reddit-changemyview/r/changemyview/comments/mlln46/cmv_while_it_is_efficient_for_public.json": "私は、インターネットに接続されたコンピュータネットワーク上で公共事業が未だに行われていない第三世界の国から来ました。\n公共事業がインターネットに接続されたコンピュータネットワーク上で運営されていない第三世界の国から来ました。物事をオンライン化することで得られる効率性はありますが\nオンライン化することで得られる効率はありますが、犯罪者がアクセスすることによるリスクに勝るとは思えません。\n犯罪者がアクセスすることによるリスクを上回るとは思えません。\n\nニュースでは...",
  "data/reddit-changemyview/r/changemyview/comments/mlxdjr/cmv_the_reason_men_ask_women_are_you_on_your.json": "私は最近、女性に生理中かどうかを尋ねるのは性差別だと知りました。\n私は自分のやり方を変えたいと思っていますが、生理中だからといって女性の行動を許すように言われたことのある男性は私だけではないでしょう。\n生理中だからといって、女性の行動を許すように言われた男性は私だけではないでしょう。\n生理中の女性の行動を許すように言われた男性は私だけではないでしょう。",
  "data/reddit-changemyview/r/changemyview/comments/mlxc7t/cmv_no_one_has_a_right_to_know_if_someones_gay.json": "同意した大人の間で閉ざされたドアの中で起こることは、彼ら自身の問題であり\n他の誰のものでもありません。\n\n誰とセックスするかは個人の問題であり、他の人が知る必要はありません。\nただし、不倫の場合は例外で、パートナーは自分の配偶者が浮気をしていることを知る権利があります。\n自分の配偶者が浮気をしていることを知る権利がある場合は例外です。",
  "data/reddit-changemyview/r/changemyview/comments/mlyrav/cmv_even_if_im_autistic_i_dont_care_im_happy_i.json": "と聞かれたことがありますし、家族の何人かは「そうじゃないか」と言っています。\nしています。\n\n家族は私の生活を改善するために診断を受けるように圧力をかけてきました。\n私の人生を向上させると考えているからです。\n\n確かに私は変ですが、誰も気にしません。私は私であることに満足しています。\n自閉症のレッテルを貼られる必要はありません...。",
  "data/reddit-changemyview/r/changemyview/comments/mm25da/cmv_being_a_poc_doesnt_make_you_an_expert_on.json": "単純に言いたいのは、POCとして、POCが自分を権威だと思っていることに苛立ちを覚えるということです。\nエスニック料理の作り方（その他）の権威だと思っていることにイラッとします。\n\n少し前に、白人のシェフが、麺類にシュラチャを入れるのはちょっと変だと話していました。\n麺類にシュラチャを入れるのは、ちょっと変だよね。麺類にシュラチャを入れると味が落ちるからだとか。そして人々は\n\"yooo...",
  "data/reddit-changemyview/r/changemyview/comments/mm40lq/cmv_the_standard_ketchup_packet_is_the_most.json": "理由\n\n-リサイクルできない\n\n-手を汚さずに開封して配ることが困難である。\n手や衣服、テーブル、ハンドル、その他の無実の人に付着することなく製品を配布することが難しい。\n\n-使用後の製品の置き場所がなく、紙ナプキンなどで包んでおかなければならない。\n紙ナプキンなどで包んでおく必要がある。\n\n-別の方法...",
  "data/reddit-changemyview/r/changemyview/comments/mlyblg/cmv_i_shouldnt_have_to_care_about_all_the_stuff.json": "私は米国出身ではありません。私には私の政治の心配があります。47人が逮捕されました。\n香港の国家安全法の結果、47人が逮捕されました。私にとって、これはブラック・アムよりも\n私にとっては、アメリカの黒人が哀れな警察に殺されることよりも重要です。\n私にとっては、哀れな警察によって黒人が殺されることよりも重要です。しかし、私のニュースはそうは思いません。reddit、youtube、instagram、...。",
  "data/reddit-changemyview/r/changemyview/comments/mm0svx/cmv_paternity_testing_should_become_normal.json": "EDIT：不倫を女性のせいにすることを懸念する人が多いようなので、男性や\n遺伝的疾患の有無を調べるために、男性や医療関係者が父子鑑定を依頼することができます。\n遺伝性疾患などを調べるために、男性や医療関係者が親子鑑定を依頼することがあります。これは父親が父性を知るためにも、子供の幸せのためにも有益な使い方です。\n子供の幸せのためになります。\n\n父性詐称は、以下のような場合に起こります。",
  "data/reddit-changemyview/r/changemyview/comments/mm3s23/cmv_if_its_racist_to_tell_black_people_to_change.json": "白人と黒人の比較をしたのは、それが最初に思い浮かんだからです。\n私自身も黒人ですから。最近、私がショックを受けているのは\n最近、男性と女性、そして男性による女性への暴力をめぐる話題にかなりショックを受けています。\n男性による女性への暴力 私はほとんどの統計を把握していますが、私は...",
  "data/reddit-changemyview/r/changemyview/comments/mml3gy/cmv_college_and_university_shouldnt_be_the.json": "中学・高校の生徒が大学に進学することへのプレッシャーは大きすぎます。\nや大学に進学することへのプレッシャーが大きすぎます。大学進学が大きなステップであると考えられるのはよくわかります。\nしかし、誰もがそのステップを踏む必要はありません。\n\n経験から言うと、私は2019年8月に中学を卒業しましたが、その時は\nをしたいと思いました。",
  "data/reddit-changemyview/r/changemyview/comments/mmlfly/cmv_a_non_autistic_person_should_be_able_to_play.json": "文法や句読点については事前にお詫びします\n\n自己紹介 多くの人がこの問題について話していますが、私は愚かな問題だと思っています。\n私は、物語と俳優がその人物についての虚偽を広めないという前提で、どんな人物でも演じることができるべきだと思います。\n物語と俳優が、障害についてのデマを広めていないことを前提に、どんな人でも演じることができるべきだと思います。\n障害\n\n私は...",
  "data/reddit-changemyview/r/changemyview/comments/mmqjgo/cmv_there_is_no_value_watching_the_news_anymore.json": "今の情勢を見ていると、いかに今のニュースが不要かということがよくわかると思います。\nニュースステーションが存続しているのは奇跡に近いですね。広告が主な収入源なのはわかりますが\n広告が主な収入源であることはわかりますが、自分に関係のない出来事を人が見ることに\nどうでもいい出来事を見ることに価値を感じません。さらに、私は...",
  "data/reddit-changemyview/r/changemyview/comments/mmx0gs/cmvus_army_advertisements_are_incredibly_scummy.json": "これらの広告に接する必要のない幸運な方のために、以下をご紹介します。\n[https://youtu.be/7fiManEc2Tk] そして、もう一つの広告はこちらです。\n[https://youtu.be/lz_ak7AVYkg] 本質的に、彼らは3つの悪いことをしています。\n\n軍隊をビデオゲームのように描いていますが、これは、ビデオゲームは\nなぜなら、ビデオゲームは（明らかに）...",
  "data/reddit-changemyview/r/changemyview/comments/mn52ps/cmv_if_covid19_was_a_dry_run_to_see_how_we_act_in.json": "コヴィドが存在するのか、人間が作ったものなのか、新世界秩序のナノボットを投与する道具として使われているのか、などという議論を始めたくはない。\n新世界秩序のナノボットを投与するための道具として使われているかどうかなどの議論はしたくありません。私が思うに\n反マスク・自由の戦士」対「怖がりの立派な市民」という構図は、もう十分に見聞きしたと思います。\nもう十分に見聞きし、うんざりしていると思いますが...。",
  "data/reddit-changemyview/r/changemyview/comments/mn1ntz/cmv_i_dont_see_why_lovecraft_being_a_racist_is_a.json": "ラヴクラフトは、「大きな影響を与えたが、当時としては超絶的な人種差別主義者であり、それを無視することはできない」と常に言われている作家の一人です。\nしかし、彼は当時としては非常に人種差別的だったので、それを無視することはできません」。\nしかし、今日彼の作品を読んでいる私たちにとって、彼が人種差別主義者であることがなぜ重要なのか、私にはよくわかりません。\n彼が人種差別者であることが、今日彼の作品を読んでいる私たちにとってなぜ重要なのか、私にはわかりません。\n\nつまり、彼が人種差別主義者であることは、今日、彼の作品を読んでいる私たちにとっては大きな問題なのです。",
  "data/reddit-changemyview/r/changemyview/comments/mn5cfk/cmv_the_have_you_ever_been_xyz_checkboxes_on_job.json": "これは私が最近気になっていたことなのですが、その裏側はどうなっているのか気になりました。\nその反対側はどうなっているのか興味がありました。多くの求人票には、「解雇されたことがありますか？\n解雇されたことがありますか？」「有罪判決を受けたことがありますか？\nといった質問があります。中にはさらに進んで、「辞職したことがありますか、あるいは...」というものもあります。",
  "data/reddit-changemyview/r/changemyview/comments/mng55s/cmv_the_resurgence_of_horoscopes_on_social_media.json": "占いやタロットカードは、真実ではなく、ちょっとした楽しみや自己分析のために読む人も多いと思います。\n占いやタロットカードを真実と考えるのではなく、ちょっとした楽しみとして、あるいは自分を見つめ直すために読む人が多いことは理解しています。\n\nしかし、最近ではソーシャルメディアでの占いが大ブームとなっています。\n多くの人が真剣に提示しているのを目の当たりにしました。私のような人は...",
  "data/reddit-changemyview/r/changemyview/comments/mnk3yy/cmv_redditors_often_ignore_hanlons_razor.json": "ハンロンの剃刀」[https://en.wikipedia.org/wiki/Hanlon%27s_razor]によると、彼らは意地悪ではなく、ただ下手なだけだそうです。\n意地悪なのではなく、ただ下手なだけなのです。\n\n> 愚かさで十分に説明できることを悪意に帰してはならない。\n\n私の見解です。\n\nRedditではこの分野での貢献が少なすぎると思います。\nそして、あまりにも...",
  "data/reddit-changemyview/r/changemyview/comments/mnzc75/cmv_nobody_should_be_jailed_for_speech.json": "そこで最近知ったのが、イギリスのホロコースト否定論者、アリソン・シャブロズさん。\n反ユダヤ主義的な発言で投獄されました。私は、これは人権に対する冒涜であり\n私は、これは人権に対する冒涜であり、不道徳だと思います。\n\n私は、シャブロズの発言はすべて、絶対的に悪であり、思想的にも、知的にも問題があると思います。\n思想的にも、知的にも...。",
  "data/reddit-changemyview/r/changemyview/comments/mo1z41/cmv_if_life_is_a_gift_then_i_have_the_right_to.json": "(これはr/unpopularopinion [/r/unpopularopinion]では人気がなさすぎるようなので\nこちらの方が良い議論ができるかもしれません)。\n\nどんな理由であれ、欲しくないプレゼントを返すことは失礼にあたります。\nしかし、それが良いことだと思えば、そうすることは一般的には問題ないと思われます。\n\n人...",
  "data/reddit-changemyview/r/changemyview/comments/mo8q4v/cmv_the_only_muslims_who_we_risk_radicalising_by.json": "イスラム過激派によるテロ事件が起きると、政府や企業は「これはイスラム教ではない」という反応を示す。\n政府やアメリカ企業の反応は、「これはイスラム教ではない。\nISISはイスラム教とは関係ない」というものです。私たちに提示された理論的根拠は、「イスラム教と呼ぶことで\nイスラム教と呼ぶことで、イスラム教徒を過激化させる危険性があるからです。\n\nBs. 私は...",
  "data/reddit-changemyview/r/changemyview/comments/mojb4m/cmv_some_form_of_birth_control_should_be.json": "安全で効果的な避妊具は、希望するすべてのアメリカ人に無料で提供されるべきです。\n安全で効果的な避妊法が、希望するすべてのアメリカ人に無料で提供されるべきです。\n\nこれにはピル、不妊治療薬、コンドーム、ダイアグラムなどが含まれます。\n男性用の化学的避妊薬もいつかは必要になるでしょう。\n\n低コストの基準は決定されるでしょうが、もし...。",
  "data/reddit-changemyview/r/changemyview/comments/modadr/cmv_if_you_are_taking_collegelevel_courses_you.json": "これは第一世界の問題だと思いますが、教授が学生に紙だけでノートを取るように強制するのは我慢できません。\n紙でしかノートを取らせないとか、ノートの書き方が指定されているとか\n書き方を指定されたり、ノートを提出させて採点されたりするのは許せません。\n採点のためにノートを提出させたりするのは許せません。どれだけ多くの研究で紙は...という結果が出ていようと、私は気にしません。",
  "data/reddit-changemyview/r/changemyview/comments/mo63f0/cmv_the_cdc_3_foot_rule_change_for_schools_is.json": "CDCはそのガイドラインを更新し、生徒間の距離を6\nフィートから3フィートに変更しました。この変更は、科学や安全性とは何の関係もありません。\nこの変更は、科学や安全性とは何の関係もなく、より多くの子供たちを建物の中に押し込めることに関係しています。\n\nなぜ、4フィートや5フィートではなく、3フィートなのでしょうか...。",
  "data/reddit-changemyview/r/changemyview/comments/mobb4l/cmv_being_proud_of_or_ashamed_of_where_you_were.json": "私はイギリス人ですが、イギリス人であることを誇りに思っているとは言えません。むしろ、ここで生まれ育ったことを幸運だと感じています。\nイギリスで生まれ育ったことを幸運だと感じていますし、同じイギリス人が社会の発展のためにしてきたことはとても素晴らしいことです。\nイギリス人が社会の発展のためにしてきたことはとても素晴らしいことです。また、イギリス人が過去にひどいことをしたことも知っています。\nイギリス人がひどいことをしたことも知っています。イギリス人であることを誇りに思うかというと、そうではありません。恥ずかしいと思うのは...",
  "data/reddit-changemyview/r/changemyview/comments/motoij/cmv_learning_is_super_fun_and_if_you_dont_find_it.json": "私は学ぶことが大好きです。学校が終わって家に帰ると、何だかとても落ち着くのです。\nコーヒーを飲みながら毛布にくるまって勉強するのが最高に落ち着きます。\nコーヒーを飲みながら、毛布にくるまって勉強する。\n\n私は15歳のときにすべてのクラスで落第点を取るようになるまで、学校が好きではありませんでした。\nでも、15歳になって授業に落第するまでは学校が好きではありませんでした。",
  "data/reddit-changemyview/r/changemyview/comments/mp3iya/cmv_republicans_and_democrats_need_to_figure_out.json": "大学時代にリバタリアンだった私は、自分の声が聞かれないと感じる気持ちがよくわかります。\n聞いてもらえないと感じる気持ちがわかります。自分の価値観や問題が真剣に受け止められていない、聞いてもらえていないと感じるのは\n感じます。政治的に意見の合わない人たちから沈黙させられたり、誤解されていると感じるのはどんなことか。\n沈黙したり、誤解されたりする気持ちはよくわかります。私は、私たちの生活の中でのフラストレーションを感じています。",
  "data/reddit-changemyview/r/changemyview/comments/mpdzj8/cmv_intentionally_adding_characters_to_a_name_or.json": "最近、TwitterやRedditなどのサイトでは、ユーザーが偏見のある人物やブランドについて暴言を吐いたり、特定の文字を置き換えたりする傾向が見られます。\n最近、ツイッターやレディットなどのサイトでは、ユーザーがある人物やブランドについて暴言を吐いたり、特定の文字をキャラクターに置き換えたりする傾向があります。\n文字に置き換えるというものです（例：Tr*mp、@OC、B！denなど）。\n\n最初はその目的が何なのかわかりませんでしたが、周りの人に聞いてみると、その理由は「...。\n理由は、「...",
  "data/reddit-changemyview/r/changemyview/comments/mpi7wf/cmv_the_saying_deep_down_im_a_good_person_makes.json": "私は、「彼/彼女は心の底ではとても優しくて、親切で、思いやりがある」というようなことを言う人がいます。\nと言う人がいますが、彼らの行動はその言葉とは正反対です。\n嫌な人間であることに罪悪感を感じることは、良い人間であることと同じではありません。\n私たちは、自分がとった行動によって定義されます。もし誰かが子供にお金を払っていなかったら...。",
  "data/reddit-changemyview/r/changemyview/comments/mpr4jj/cmv_we_have_gotten_to_the_point_where_resisting.json": "この法律の元々の文脈には意味があります。警官が逮捕しようとする容疑者全員と\n逮捕しようとする容疑者全員と物理的に戦う必要はありません。だから、もしあなたが\n逮捕に抵抗することを違法とすれば、容疑者が逮捕に協力する動機付けになります。\n逮捕に協力する動機になります。\n\nしかし、警官はこの法律を悪用し、今ではどんな抵抗も...と解釈しています。",
  "data/reddit-changemyview/r/changemyview/comments/mpvo8y/cmv_i_am_a_misogynistic_bitter_angry_incel_please.json": "最初にお読みください：この記事は長いかもしれませんが、私は多くの有害な意見を持っています。\n考え方があり、それを変えたいと思っています。この記事は長いかもしれません。\n私は本当に自分を変え、向上させ、このような憎しみに満ちた考えや信念を取り除きたいのです。\nこのような憎しみに満ちた考えや信念を取り除きたいのです。また、もしそう聞こえたらごめんなさい...。",
  "data/reddit-changemyview/r/changemyview/comments/mq6zeb/cmv_medical_professionals_shouldnt_be_allowed_to.json": "私が見落としている他の見解があって、これが何か悪いアイデアになるのではないかと思って、ここに投稿しました。\n私が見落としている意見がないかどうかを確認したくて、ここに投稿しました...\n\n私の叔母は看護師ですが、真剣にワクチンを拒否していて、ほぼ毎日COVIDの患者を助けています。\n叔母はほぼ毎日COVIDの患者さんのお手伝いをしています...その上、叔母は私の家族を訪問するために州外に飛び立ちたいと言っています。\nその上、叔母は私の他の家族を訪問するために州外に飛びたがっていて、その家族もまた...",
  "data/reddit-changemyview/r/changemyview/comments/mq1war/cmv_video_uploaders_on_porn_sites_should_have_to.json": "セックスワークが本当の仕事であれば、他の職場と同様に規制されるべきです。ちょうど\n私たちが雇用主に身分を明かして契約書にサインしなければならないように、セックスワーカーがビデオに出演する際には身分を明かすことが必要です。\nセックスワーカーがビデオに出演する際には、自分の名前を名乗り、同意したという記録を残すことが求められるべきです。\n承諾したという記録を残すことが求められます。その主な目的は...",
  "data/reddit-changemyview/r/changemyview/comments/mqe3ze/cmv_traveling_with_someone_else_is_better_than.json": "旅行は私の好きなことのひとつであり、これからもたくさんのことをしたいと思っています。\n近いうちにもっとたくさんのことをしたいと思っています。そうは言っても、私は一人旅をしたことがありません。私はいつも\n少なくとも1人の人と一緒に行きました。長所もあるとは思いますが、誰かと一緒に旅行することで得られる長所は\n誰かと一緒に旅行することで得られるメリットはかなり大きいです。\n\n長所...",
  "data/reddit-changemyview/r/changemyview/comments/mqfi5w/cmv_ghost_and_paranormal_are_not_real_and_and.json": "精神的に病んでいる人の中には、注目を集めるために嘘をつく人もいますが、それは少数派だと思います。\n幽霊を信じる人の多くは、本当に超常現象を見たと思っているからだと思います。\n幽霊を信じる人の多くは、本当に超常現象を見たと思っているからだと思いますが、そのようなケースは、脳が十分な情報を処理できないために\nしかし、そのようなケースは、脳が処理するのに十分な情報を持っていないために...。",
  "data/reddit-changemyview/r/changemyview/comments/mqjn0a/cmv_unmarked_police_cars_shouldnt_be_allowed_to.json": "私がこのように考える理由は、警察は一般市民を保護し、奉仕することを目的としているからです。\n一般市民のためのものです。道を走っている暗いマークのないSUVよりも、マークのついた見やすい車に旗を振ったほうが、はるかに簡単で安全でしょう。\nマークの付いていない暗いSUVが道路を走っているよりも、マークの付いた見やすい車に旗を立てる方がはるかに簡単で安全です。\n\nまた、もしあなたが他の車が見えない暗闇の中を運転していて...",
  "data/reddit-changemyview/r/changemyview/comments/mql5kn/cmv_there_is_nothing_wrong_in_doing_selfless.json": "基本的にはタイトル通り。もし、あなたがウェイターに100ドルのチップを渡したいと思うなら、それはあなた自身が良い気分になり、彼らがあなたに感謝するからです。\nウェイターに100ドルのチップを渡したいとしたら、それは完全に立派な\n慈愛に満ちた動機です。ウェイターは、その100ドルの動機を気にしていません。\n彼らはただ、食料品を少しでも買えるようになってホッとしているだけなのだから...。",
  "data/reddit-changemyview/r/changemyview/comments/mqvkke/cmv_tasers_that_look_or_feel_like_guns_should_be.json": "私が銃器業界にいた80年代後半は、テーザー銃が現在のような形になり始めたばかりでした。\n私が銃器業界にいたのは80年代後半で、当時のスタンガンは現在の形に変化し始めたばかりでした。\n\nオリジナルのテーザー銃。\n\nhttps://ids.si.edu/ids/deliveryService?id=NMAH-AHB2015q109328&max=1000\n\n現代のスタンガン。\n\nhttps://www.researchgate.net/profile/Gary...",
  "data/reddit-changemyview/r/changemyview/comments/mqtu3p/cmv_if_you_are_anti_vax_or_anti_mask_because_you.json": "ワクチン反対派やマスク反対派は、健康上の義務や個人の自由に反対していますが、私はそれに賛成です。\nしかし、企業が非協力的であることを理由にサービスを拒否したい場合、同じ自由の下で行うことができるはずです。\nしかし、もし企業が不参加を理由にサービスを拒否したければ、同じ自由の下でそれを行うことができるべきです。\nこの国民はそれに同意していないようです\n\nこれは、この国の人々が同意しないことのようです。",
  "data/reddit-changemyview/r/changemyview/comments/mr8i9e/cmv_gaslighting_has_been_rendered_meaningless_due.json": "意味はわかります。映画を見たことがあります。表現としては適切だと思います。\n被害者に疑問を抱かせ、自分の現実を見失わせるように仕組まれた、特定かつ意図的な、支配的な虐待の形を表現していると思います。\n疑問を抱かせ、自分の現実を見失わせるように仕組まれています。\n\nしかし、ここ数年、この言葉がネット上のどこにでも投げ捨てられているように感じます。\n投げかけられているように感じます。",
  "data/reddit-changemyview/r/changemyview/comments/mr3q8z/cmv_if_school_children_were_treated_like_adults.json": "学校で子どもたちに自由を与えることは、直感的には難しいことだと思います。\n誰もが最初に考えるのは、手綱を外して混沌を助長することだからです。\n混乱を助長してしまうからです。\n\nしかし、対等な立場で尊重されることは、若い人たちの学習プロセスの重要な部分を占めていると思うのです。\n対等に尊重されることは、若い人たちの学習プロセスの重要な一部だと思います。子どもたちを励ますのにも役立ちますし...。",
  "data/reddit-changemyview/r/changemyview/comments/mr7myo/cmv_subreddits_that_limit_who_can_post_and.json": "まずは \"and \"に注目してください。明らかに、サブの機能上、どちらか一方を制限する必要があるサブもあります。\nサブの機能上、どちらか一方を制限する必要があるサブもあります。私が言っているのは、投稿とコメントの両方の権限を制限するサブについてです。\n投稿とコメントの両方の権限を制限するサブのことです。これで明確になりましたが、両方の形式の交流を制限することは\n私のredditでの経験では、両方のインタラクションを制限することで（人を怒らせたくないので...。",
  "data/reddit-changemyview/r/changemyview/comments/mrghwv/cmv_toilet_paper_should_be_installed_so_that_it.json": "その方が気持ちがいい。トイレットペーパーを取ろうとするときに、手が壁に擦れるのを感じたい人はいないでしょう。\nトイレットペーパーを取ろうとするときに、手が壁を擦るのを感じたい人はいないでしょう。確かに、黒板に爪を立てて引っ掻くほどひどくはありませんが、それに近いものがあります。\n黒板に爪を立てるほどではありませんが、それに近いものがあります。自分にとっても、周りの人にとっても、悪いことのように感じられます。\n自分にとっても周りの人にとっても悪いことだと思います。\n\nその方が清潔です。どんなに...",
  "data/reddit-changemyview/r/changemyview/comments/mrmd4c/cmv_a_naturalized_citizen_is_more_patriotic_than.json": "コンテキスト 私はペンシルバニア州で生まれましたが、両親の永住権申請（グリーンカード申請）が2週間遅れたため\nの申請（グリーンカード申請）が2週間遅れたため、私はペンシルバニア州で生まれました。私は、中国生まれの\n中国生まれの市民とみなされます。\n\n私は18歳の時に積極的に中国の市民権を放棄しに行かなければなりませんでした。\n18. 私は18歳の時に中国国籍を放棄しました。",
  "data/reddit-changemyview/r/changemyview/comments/mrfc2i/cmv_smoking_is_your_own_responsibility_and_choice.json": "さて、まずは私の意見として基本的な「ルール」を紹介したいと思います。\n\n喫煙が体に良いとか、ニコチンが中毒性のある物質ではないとか、誰かを非難したり見たりすることを主張しているわけではありません。\n喫煙が良いことだと主張しているわけでも、ニコチンが中毒性のある物質ではないと主張しているわけでもありません。\nタバコを吸うことで誰かが非難されたり、悪者扱いされたりすることを主張しているわけではありません。\n\nさらに言えば、私が言っているのは、これからタバコを始める人のことで...",
  "data/reddit-changemyview/r/changemyview/comments/mrndbg/cmv_if_you_criticize_others_for_using_retarded_as.json": "> 前置きが長くなりました。前置きが長くなりましたが、私は、知性がないと思われる人に怒りを向けるのは\n> 怒りを向けることは間違っていて非合理的だと思います。もしあなたがこの言葉を中傷として使っている人なら\n> この言葉を中傷として使う人は、この投稿をよく読んで、私があなたの行動を推奨しているわけではないことを理解してください。\n> あなたの行動を擁護するものではありません。あなたがそれで呼ばれたことを嬉しく思います....",
  "data/reddit-changemyview/r/changemyview/comments/mrpxu9/cmv_historically_socially_progressive_views_have.json": "奴隷制度から統合、女性の権利、同性愛者の権利、そして現在のトランスジェンダーの権利に向けた戦いに至るまで\nトランスの権利に向けた戦いなど、「進歩的」な考え方は、最終的に社会で受け入れられる考え方になりました。\n社会の中で受け入れられるようになりました（私はアメリカを中心とした視点で話しています。\n他の国のことは言えませんが...。",
  "data/reddit-changemyview/r/changemyview/comments/mrer37/cmv_layman_should_always_side_with_academic.json": "現代のアメリカでは、人々が自分で調べて、それに反する結論を出すことが一般的な傾向になっているようです。\nあるテーマについて個人的に調べて、学者の結論とは違う結論を出すのが、現代アメリカの一般的な傾向のようです。\nこれは非常に傲慢で、率直に言って愚かなことだと思います。\n\nこれは非常に傲慢で、率直に言って愚かな行為だと思います。\nなぜなら、それは、何も知らない人が...",
  "data/reddit-changemyview/r/changemyview/comments/mso0nk/cmv_people_would_be_happier_in_small_communities.json": "私たちが社会で直面している問題の多くは、コミュニティとの断絶から来ていると思います。\n思うのです。\n\n他の国のことはわかりませんが、イギリスではミレニアル世代（とその子供たち）がノマド化しています。\n英国では、ミレニアム世代（とその子供たち）がよりノマド的になっています。最終的な目標は、自分で不動産を購入することです。\n最終的な目標は、不動産を購入して利益を得て売却することです。だけでなく、...",
  "data/reddit-changemyview/r/changemyview/comments/mst79l/cmv_the_uss_democracy_cant_be_fully.json": "アメリカは代議制民主主義を採用しているので、国民は自分たちのために人を選び\n選挙で選ぶことになります。しかし、私たちは実際には、自分たちの意見を代表する人を選んで投票させているわけではないと思います。\nその代わりに、戦略的な投票を行っています。\n\n第3党に投票する人の数は、自分が望んでいるよりも少ない。",
  "data/reddit-changemyview/r/changemyview/comments/mt0c2r/cmv_america_treats_their_citizens_like_shit_and.json": "前置きが長くなりましたが、私が唯一考慮しない議論は、比較のための議論です。\n例えば、「○○国はこうしているから、あなたは感謝すべきだ。\nあるいは視点を変えるべきだ」というようなものです。私はそれに同意しないだけでなく、アメリカとその欠点に注目したいと思います。\nアメリカとその欠点に焦点を当てたいのです。他国との比較ではなく...",
  "data/reddit-changemyview/r/changemyview/comments/mtb438/cmv_employers_testing_new_hires_for_thc_needs_to.json": "雇用主が検査する薬物のリストからTHCを除外する必要がある。人々が\n人が仕事以外の自由な時間に何をしてくつろごうと、彼らには関係のないことです。\n\nジョージア州ではDelta 8 THCが合法的に販売されており、バージニア州では今年の7月にすべてが合法化される予定です。\nバージニア州では今年の7月にすべてを合法化する予定です。私は、なぜアルコールが何かというと...理解できません。",
  "data/reddit-changemyview/r/changemyview/comments/mtg741/cmv_violent_crimes_should_be_punished_more.json": "免責事項：私は弁護士ではありません。\n私は弁護士ではないので、判決や刑罰がどのように機能するかについてのニュアンスを見逃しているかもしれません。\n\n暴力や暴力の脅威は、その背後に重みがあれば、より厳しく罰せられます。\n暴力や暴力の脅威は、その背後にある重みが大きいほど厳しく罰せられます。例えば、単純な...",
  "data/reddit-changemyview/r/changemyview/comments/mtpiad/cmv_its_incredibly_selfish_to_name_a_kid.json": "注：文化的な名前（歴史的に黒人の名前を含む）については言及していません。\nのことではありません。)\n\n私はもうすぐ子供が生まれるのですが、グループ内の何人かの人は、自分の考えを\nロックな人もいます。最近では、男の子に \"Anakyn \"という名前をつけようとしている人がいました。彼らは\n具体的には...",
  "data/reddit-changemyview/r/changemyview/comments/mtz0zb/cmv_its_wrong_of_businesses_to_ask_me_to_tip_for.json": "最初に言っておきますが、アメリカのチップ文化は全体的に最低だと思います。\n従業員の賃金をチップで補助するべきではありません。\nそもそも従業員には適正な賃金が支払われるべきです。\n\n私はここ数年の傾向として、カウンターサービスしか提供していない食べ物屋さんが\nここ数年の傾向として、カウンターサービスのみのお店では...",
  "data/reddit-changemyview/r/changemyview/comments/mu84wm/cmv_if_whatever_makes_your_character_different.json": "その前にはっきりさせておきたいのは、人種の話をしているのではないということです。ある\n人種の話をすべきだと考える人もいるかもしれませんが、私はそうは思いません。理由はよくわかりませんが、たぶん\nなぜかというと、私が読んだ物語（黒人やブラックコードのキャラクターが登場するもの）は\n私が読んだ（黒人やブラックコードのキャラクターが登場する）物語は、何らかの形で人種が中心になっていて、それが物語にプラスになっているからです。I...",
  "data/reddit-changemyview/r/changemyview/comments/mui03n/cmv_people_who_complain_about_electronic_music.json": "私はアマチュアの音楽プロデューサーで、ジャズ、ロック、ヒップホップ、エレクトロニックなど、さまざまなジャンルに手を出してきました。\nジャズ、ロック、ヒップホップ、エレクトロニックなど、さまざまなジャンルを手がけてきました。メインストリームのダンストラックの作曲プロセスは\nメインストリームのダンストラックの作曲プロセスは、例えばクラシック音楽の場合と同じです。\nコード進行を作って、メロディを作って弾いて、伴奏をつけて......。",
  "data/reddit-changemyview/r/changemyview/comments/mu66rr/cmv_bringing_up_failed_socialistcommunist.json": "思想を整理しておくと、「そりゃあ共産党員は言うだろう」とか「名前に同志が入っているんだから、そりゃあ考えるだろう」とかのスパムを受けないように\nとか「同志の名を冠しているのだから、こう考えるのは当然だ！」とか言われないように、自分の思想を明らかにしておきます。\nとか言われないように。\n\n私は社会民主主義寄りの民主的社会主義者ですが、次のように考えています。\nマルクスは非常に優れた点とアイデアを持っていました（弁証法...",
  "data/reddit-changemyview/r/changemyview/comments/mv529h/cmv_in_most_situations_you_should_just_assume.json": "人の性別を決めつけないことを大々的にアピールする人がいます。ある人によると\nある人によると、出会ってすぐに代名詞を聞くべきだということです。\n聞くことになっています。これは馬鹿げている。\n\n論点1\n\nこのような考え方をする動機は見当違いだと思います。人は、誰かに\n人は、誰かが......という考えに",
  "data/reddit-changemyview/r/changemyview/comments/mvbr5s/cmv_the_death_of_makiyah_bryant_is_a_poor_example.json": "メディアは、黒人の16歳の少女、マキヤ・ブライアントが白人警官に殺された事件を報道しています。\n白人警官による16歳の黒人少女Makiyah Bryantの死を、同じ日に行われたChauvinの評決と関連づけて報道しています。その意図は明らかです。\nその意図は明らかです。この事件を、警察による残虐行為の一つとして描き\n意図は明らかです。\n\nしかし、マキヤ・ブライアントを撃ったのは...",
  "data/reddit-changemyview/r/changemyview/comments/mvmnf9/cmv_makiyah_bryant_is_an_example_of_the_black.json": "まず始めに、警察の改革は確かに必要であり、不当な発砲や悪い警官がいることは確かです。\n不当な発砲や悪い警官がいることは確かです。Derek Chauvinは刑務所で腐っていくべきです。\n獄中で腐るべきです。\n\nそれはさておき。マキヤ・ブライアントの状況を見ると、これは私たち地域社会が必要とする例です。\n私たちは地域社会を守る必要があるという例です...",
  "data/reddit-changemyview/r/changemyview/comments/mvr44c/cmv_thomas_lane_should_receive_a_lighter_sentence.json": "ショービンの部下である新米警官であるにもかかわらず、レーンの行動を考えると\nレーンの行動を考えると、他の2人の警官に比べてはるかに軽い刑罰で済むと思います。\nレーンは、他の2人の警官に比べてはるかに軽い刑罰を受けるべきだと思います。\n\nレーンはショービンに、フロイドを横にした方がいいのか、それとも......と3回問いかけました。\n姿勢を変えるべきかどうかをショービンに3回尋ねました。",
  "data/reddit-changemyview/r/changemyview/comments/mw1ntk/cmv_runpopularopinion_is_a_sub_for_popular.json": "そのサブは人気のある意見のためのサブになっていて、タイトルに人気という言葉を使うこともできません。\nタイトルにpopularという言葉を使っても、\"meta \"として削除されてしまいます。\n\nあのサブレディットのホットポストを見てください、文字通りすべて人気のある\n意見です。例えば、アナルは気持ち悪い、子供を産むのは選択肢の一つ、誰かに魅力を感じないことは\n誰かに惹かれないこと...",
  "data/reddit-changemyview/r/changemyview/comments/mw3q8i/cmv_there_is_no_way_to_be_a_responsible_cat_owner.json": "これは私が以前から持っていた意見であり、外猫派の人たちと議論しようとしていたものです。\n外猫派の人たちと話し合おうとしてきました。ほとんどの話題はニュアンスがあると思いたいのですが（だからここに投稿しているのですが\nしかし、この話題に関しては、ニュアンスを感じることができませんでした。\n以下は私の理由であり、私がどのような議論をしてきたかを概説してみます。",
  "data/reddit-changemyview/r/changemyview/comments/mw3lsk/cmv_canada_is_not_exceptional_in_any_way_when.json": "カナダ出身の私は、数え切れないほどのYouTube動画を見たり、他国の統計を読んだりしてきました。\n他の国の統計を見たりしています。私は、この国を去るべきだと確信しています。\n去るべきだと確信しています。\n\nカナダがしていることで、他の国がはるかに優れていないことは何もありません。\n\nカナダは何か特別に優れたことをしているわけではありません。\n\n北欧の...",
  "data/reddit-changemyview/r/changemyview/comments/mw9583/cmv_whether_you_like_it_or_not_the_media_has_a.json": "私はこのことについてもっと深く考えてみたいと思います。\n保守派、リベラル派のトークポイントがあっても、彼らが押したい物語があるということです。\n例えば\n\n例えば、Fox Newsは「選挙は盗まれた」というナラティブを押しました。彼らは\n彼らはBLMの信用を落とそうとしていますが、キャピトル・ヒルを支持しています・・・。",
  "data/reddit-changemyview/r/changemyview/comments/mwiu3w/cmv_circumcision_is_an_extremely_wrong_and.json": "さて、私はイギリス出身ですので、一部の宗教を除いて、ここではそれほど一般的ではありません。\n宗教を除いては一般的ではありません。しかし、多くの文化では、赤ちゃんのペニスの一部を切り取ることが伝統となっています。\n誰も問題にしません。\n\nアフリカのいくつかの国では、女性の膣の一部を切り取ることが行われていますが\n非常に嫌われていますが...。",
  "data/reddit-changemyview/r/changemyview/comments/mwofqv/cmv_pharmaceutical_companies_should_not_advertise.json": "特定の症状のための薬と言っても、季節的なアレルギーのための薬や、風邪やインフルエンザのための薬ではありません。\n季節性アレルギーの薬や風邪・インフルエンザの薬ではありません。\n腎臓病や乾癬など、非常に特殊な健康状態のための薬です。\n\nアメリカ人の多くは、特定の症状のための薬についてほとんど知りません。",
  "data/reddit-changemyview/r/changemyview/comments/mwshjp/cmv_the_blm_movement_is_turning_into_something.json": "先日のマキア・ブライアントの銃撃事件では、彼女がナイフを持っていなかったという説や\n彼女はナイフを持っていなかったと言う人もいれば、自分を守ったと言う人もいます。\nボディカムの映像では明らかにナイフを持っていて刺そうとしていたのに、それがなければ殺されていたかもしれない。\n彼女はナイフを持っていて、刺そうとしていたことがボディカムの映像で明らかになっています。",
  "data/reddit-changemyview/r/changemyview/comments/mxia4i/cmv_lying_to_a_sexual_partner_about_being_on.json": "避妊をしないでセックスをするために、パイプカットをしたと嘘をついた男性は、罰せられて当然です。\n罰せられて当然です。もし男性がパートナーの知らないうちに（および／または承認なしに）セックスの途中でコンドームを外したら、それは罰せられて当然です。\n罰せられてしかるべきです。もし女性が以下のように嘘をついたら\n女性が避妊していると嘘をついて男性とセックスした場合、彼女は罰せられて当然です...",
  "data/reddit-changemyview/r/changemyview/comments/mxdeen/cmv_copyright_should_be_returned_to_28_years_with.json": "米国では、1900年代初頭から1976年までの作品の著作権期間は\n28年で、さらに28年延長できるオプションがついていましたが、現在はさらに延長されています。\n延長された\n\n> 1978年1月1日以降に創作された作品については、著作権保護期間は\n> 1978年1月1日以降に創作された作品の著作権保護は、著作者の生涯に加えてさらに70年間続きます。これは...",
  "data/reddit-changemyview/r/changemyview/comments/mxpg4z/cmv_kids_shouldnt_be_forced_into_any_religion.json": "神が存在するかどうか、存在したとしてもどの宗教が正しいのかわからないということを考えると\nもし存在したとしても、どの宗教が正しいのかわからない。\n宗教を絶対的な真理として教えることは、本当に間違っていると思います。このような理由から、教会や宗教学校では子供を\n教会や宗教学校に子供を入れてはいけません。彼らはそうではありません...",
  "data/reddit-changemyview/r/changemyview/comments/mxv6qf/cmv_conceiving_children_when_you_have_a_severe.json": "何よりもまず、いくつかのことを整理しておきたいと思います。\n\n私は、行動面でも思想面でも、決して優生学を支持したり、擁護したり、あるいはその他の方法で支援したりするものではありません。\n優生学の行動や思想を支持するものではありません。優生学は人類の歴史上の汚点であり、常に悪につながるものです。\n常に悪につながるものです。この投稿は、優生学に賛同したり、行動を呼びかけたりするものではありません。",
  "data/reddit-changemyview/r/changemyview/comments/my32xq/cmv_starbucks_standard_house_blend_coffee_is.json": "スターバックスのハウスブレンドコーヒーは、他のブランドに比べて、私だけでなく大多数の人にとって、焦げた味がして美味しくないというのが、私の個人的な経験です。\n私だけでなく、多くの人が他のブランドと比較して、スターバックスのハウスブレンドのコーヒーは、焦げた味がして美味しくないと感じています。IMO\nダンキンドーナツ、クリスピークリーム、マクドナルド、そしてほとんどの主要なファストフードチェーンは、スターバックスよりも美味しいブラックコーヒーを提供しています。\nスターバックスよりも美味しいブラックコーヒーがあると思います。その事実は...。",
  "data/reddit-changemyview/r/changemyview/comments/my2ftw/cmv_if_we_stop_shaming_sex_work_we_have_to_stop.json": "私は、セックスワークを非犯罪化し、セックスワーカーを辱めることをやめようという動きを理解しています。\n辱めることをやめようという動きを理解しています。私自身も、ほとんどすべての男性と同様に、インターネット上でセックスワークを消費しています。\nしかし、現実の生活の中でセックスワークを利用することはありませんし、それは非常に軽視されているからです。\nしていません。私は、複数のガールフレンドから、一緒にはいられないと言われたことがあります・・・。",
  "data/reddit-changemyview/r/changemyview/comments/myexet/cmv_smoking_around_children_is_child_abuse.json": "喫煙や副流煙が健康を害することは、誰もが知っている事実です。\n喫煙者でさえもその事実を認めています。親の仕事は、自分の子供たちにタバコを吸わせないようにすることです。\n親の役目は、子供が健康であることを確認することです。\n特に建物の中や車の中のような密閉された空間で喫煙することは、子供たちに...",
  "data/reddit-changemyview/r/changemyview/comments/mysari/cmv_humiliating_men_and_boys_is_far_too_common.json": "そして、それを可能にしたり、奨励したりしない唯一の人々は、それが起こることさえ考えないか、軽視するでしょう。\n思わないか、軽視します。\n\n私は友人たちと一緒にいて、女性がジョークのネタにされたことはありません。\n笑いの種になったことは一度もありませんでした。私は10年以上前から女性を知っています。\n10年以上の付き合いがありますが、思い出せません...。",
  "data/reddit-changemyview/r/changemyview/comments/mywfxa/cmv_1_vote_should_count_as_1_whole_vote_during.json": "何千万人もの有権者を無視するようなシステムを、なぜ誰が維持しようとするのでしょうか？\n何千万人もの有権者を無視するシステムを維持したい人がいるのでしょうか？\n\nさらに、人気投票で勝利した候補者を支持しなければ、あなたの一票が結果に反映されないというシステムを支持する人がいるでしょうか？\nの人気投票で過半数を獲得した候補者を支持しない限り、あなたの一票が結果に反映されないシステムを支持する人はいないでしょう。\nあなたの一票が結果に反映されないシステムを支持する人がいるでしょうか？",
  "data/reddit-changemyview/r/changemyview/comments/myxj02/cmv_people_who_mindlessly_use_words_like_marxism.json": "そろそろ保守派の人たちは、カール・マルクスの「共産党宣言」を読んでみてはいかがでしょうか。\n宣言」を読んでみてください。もし、あなたが常に政治的な哲学者を参照する必要があると感じるならば\n彼らが実際に書いたものを読むことが重要です。\nおかしなおじさんが書いたという話を鵜呑みにするのではなく。\n\nユニバーサル・ヘルスケアは本当に...",
  "data/reddit-changemyview/r/changemyview/comments/myxq9i/cmv_libertarianism_is_essentially_just.json": "わがまま」とは、自分のことだけを考えて、周りの人のことは純粋に気にしないことです。\n周りの人のことは気にしない。それは、政治的には、すべてを自分のために\n自分のことだけを考え、他人のことは気にしないということです。\n\nリバタリアンが問題について語るとき、これらの問題は...",
  "data/reddit-changemyview/r/changemyview/comments/mz7ygn/cmv_there_is_nothing_wrong_with_pirating.json": "私は高校生で、1年間ずっと研究プロジェクトを行ってきました。私の\n講師が推薦してくれたのは\n私の信じられないほどニッチなテーマに関連していると思われる200ページの教科書を推薦してくれました。\nしかし問題は、私が見つけた最低価格は約100ドル、平均価格は約200ドルでした。\n平均価格は約200ドルでした。私は...",
  "data/reddit-changemyview/r/changemyview/comments/mzbetj/cmv_you_are_selfish_if_you_choose_to_not_take_the.json": "私は、もしあなたがCovid-19ワクチンの提供を受け、受けられるだけの健康状態にありながら、何らかの理由で受けないことを選択した場合、あなたは自分勝手な人間だと思います。\n何らかの理由で受けないことを選択するのは、本当のことを知らない利己的な人間だと思います。\n本当の問題が何であるかを知らない利己的な人だと思います。ワクチンを受けられない人たちのことは気にならないのですか？\nワクチンを受けられない人のことは気にならないのですか？そのような人たちが一番被害を受けているのです。....",
  "data/reddit-changemyview/r/changemyview/comments/mz6p6o/cmv_femaledatingstrategy_is_a_group_of_women.json": "この記事のタイトルとしては完璧ではないかもしれませんが、とりあえず書いておきます。\n\nそのサブの投稿を見るたびに、「いい男なんて残ってない」とか\nといった内容のものだったり、ただ単に男性をゴミ扱いするものだったりします。確かに、世の中には叩かれても仕方ないような\n殴られて血まみれになってドブに捨てられるべき動物がいるのはわかりますが...。",
  "data/reddit-changemyview/r/changemyview/comments/mzr23d/cmv_most_americans_who_oppose_a_national.json": "私は軍隊を辞めるまで、国民皆保険制度には反対だと思っていました。\n軍隊を辞めるまでは、国民皆保険制度には反対だと思っていました。確かにVAは必ずしも素晴らしいものではありません。\nレジを見ずに診察を終えて病院を出るのは素晴らしいことです。\nそのためには何千ドルもの費用が必要になります。",
  "data/reddit-changemyview/r/changemyview/comments/mzl8jf/cmv_ghibli_studios_is_better_than_walt_disney.json": "これは、私の父があなたの父よりも優れているということではありません。誤解のないように言っておきますが、どちらもそれぞれ魅力的です。\nしかし、ジブリの方がより深いストーリーテリングと複雑な伝承を持っています。\n偏見かもしれませんが）。私が見たディズニー映画の中で、これに近いのは\nトレジャー・プラネットですが、あれはわざと潰したんですね。そして・・・。",
  "data/reddit-changemyview/r/changemyview/comments/mzp46s/cmv_meditation_techniques_should_be_taught_as.json": "さて、あなたが何を考えているかはわかります。\"やれやれ、新時代の占星術少女の登場だな。\nクリスタルの癒しの力について語りに来たのか...」と思うでしょう。\n\nしかし、それは私のチーフではありません。\n\n私が今日お話ししたいのは、生理学的、心理学的な健康への恩恵が広範囲に渡って記録されていることです。\n生理的にも心理的にも良い影響を与えることができる...",
  "data/reddit-changemyview/r/changemyview/comments/mztcsw/cmv_owning_a_pet_bird_and_keeping_it_a_cage_its.json": "鳥をペットとして飼っている人が、鳥をずっとケージに閉じ込めているのを見ると\nとても悲しい気持ちになります。\n\n私の考えでは、鳥は空を飛び、翼を広げるものです。それは、鳥にとって\nそれが鳥の基本的な欲求であり、そのためにあるのだと思います。ペットとして檻に入れられている鳥を見ると心が痛みます。\nペットとしてケージに入れられている鳥を見ると心が痛みます。",
  "data/reddit-changemyview/r/changemyview/comments/n0aw7o/cmv_if_if_we_want_to_talk_about_the_government.json": "学生ローンの借金を帳消しにすれば、多くの人が助かると思いますが、後から来た学生が同じような目に遭うと\n同じ運命をたどる後続の学生は、残念ながら取り残されてしまいます。\n捨てられてしまいます。\n\n私は解決策のアイデアを持っていますが、それに対するご批判をいただきたいと思っています。\n\nまず最初に、私の考えに影響を与えるいくつかの事柄を述べたいと思います。",
  "data/reddit-changemyview/r/changemyview/comments/n0iae9/cmv_ufc_fights_would_gain_more_support_and_make.json": "ネガティブな話題が多い中、ここではもう少し明るい議論をしてみましょう。この\n経済に詳しい人が私の考えを変えてくれるかどうか、気になります。\n経済に詳しい方がいたら、私の考えを変えてくれるかもしれません。\n\n現在、UFCのPPVは、ESPNプラスの月6回に加えて、各イベントで70ドルです。I\n私が思うに、横行しているのは...。",
  "data/reddit-changemyview/r/changemyview/comments/n074i9/cmv_the_american_idea_of_freedom_is_a_lie.json": "アメリカ人は、世界の他の国々よりも多くの自由を経験していると思いたがっています。\nアメリカ人は、世界の他の人々よりも多くの自由を享受していると思いたがっています。\n\nしかし、経済的流動性の低さ、格差や貧困の大きさ、そして階級の違いなどから\nつまり、多くのアメリカ人が他の国に比べて自由ではないということです。\n\n選択肢がなければ自由にはなれません。で...",
  "data/reddit-changemyview/r/changemyview/comments/n0jwsj/cmv_if_you_pirate_the_music_of_your_favorite.json": "1. ストリーミング業界のアーティストへの支払い方法は、小規模なアーティストにとっては完全に不正なものです。\nクリエイターの\n\nマーチャンダイジングやコンサートのチケットを購入した場合、そのお金は誰の手に渡るのでしょうか？例えば、1/3がアーティストに支払われるとします。\n1/3はTシャツのプロデューサーやコンサート会場のオーナーに、2/3はアーティストとマネージメントに支払われます。\n\nもし、あなたがSpotify Premiumを購入し、100％音楽を聴くとしたら...。",
  "data/reddit-changemyview/r/changemyview/comments/n0mk8u/cmv_if_the_catholic_church_prevents_biden_from.json": "私はカトリック教徒です。私はプロチョイスです。私の牧師は私がプロチョイスであることを知っています。この日曜日、私は\n私は聖体を受けることを妨げられたり、促されたりしませんでした。\n\nバイデン大統領はカトリック教徒です。彼はすべてのアメリカ人にプロチョイスの選択肢を提供しています。\n彼はすべてのアメリカ人にプロチョイスの選択肢を提供し、信教の自由を確保しています。一度も会ったことのないカンザス州の司教たちは\n会ったことのないカンザス州の司教たちは...",
  "data/reddit-changemyview/r/changemyview/comments/n0ftwe/cmv_people_who_talk_in_twitchspeak_are_annoying.json": "Twitchのチャットでは、面白い人が面白いことをしていることがあります。\nしかし、Twitchのチャットでは建設的な会話はほとんどありません。\nくだらない絵文字トークをスパムする人がいるからです。\n私は、人々はTwitchの言語を理解しているので、クールなギャングの一員だと思っていますが...。",
  "data/reddit-changemyview/r/changemyview/comments/n0s7qe/cmv_tying_politicians_salaries_to_the_median.json": "民間企業では、業績ボーナスやコミッションを含む給与体系は、雇用主がインセンティブを求めている仕事に人気があります。\n雇用主が効果的で生産的な仕事ぶりにインセンティブを与えたいと考えている仕事には、業績ボーナスやコミッションを含む給与体系が人気です。\n効果的で生産的な仕事ぶりにインセンティブを与えたい場合に人気があります。1対1ではないにしても、政府のリーダーの給与が\n1:1ではないにしても、政府のリーダーの給与が、国民の中央値の所得から導き出されるのは",
  "data/reddit-changemyview/r/changemyview/comments/n0n75m/cmv_i_think_the_freedom_of_speech_defense_online.json": "皆さんが中国やトルコなどの話をする前に、注意してください。\n私が言っているのは、実際の政府による実際の検閲のことではありません。\n自分を表現する権利が主に禁止されたソーシャルメディアサイトによって止められていることに不満を持つ人々の話です。\n自分の表現する権利が、主に禁止したソーシャルメディアサイトによって止められていることに不満を持っている人たちの話です。つまり....",
  "data/reddit-changemyview/r/changemyview/comments/n0y17l/cmv_christians_have_no_basis_for_condemning.json": "CMV: クリスチャンは、同性愛を非難する根拠がありません。\n聖書にも書いてありません。結婚という文脈の中では罪ではありません。これは、LGBTの多くの人々に害を与えている教義です。\n多くのLGBTQコミュニティに害を与えています。これまでに発表された\n昔からある明らかな科学的根拠は抜きにして...",
  "data/reddit-changemyview/r/changemyview/comments/n11jq7/cmv_thrift_storessecond_hand_storesop_shops.json": "さらには、サイズごとに服を分類し、そのサイズの中の色ごとに分類することもできます。\n\n自分に合う服が10％もないのに、服の棚を全部見て回るのは時間の無駄ですよね。\n自分に合う服が10％もないのに、ラック全体を見て回るのはもったいないですよね。たとえ黒のパンツを買うにしても\n黒のパンツを買いたいと思っても、すべての黒のパンツを見たいとは思いませんし...。",
  "data/reddit-changemyview/r/changemyview/comments/n1l2fn/cmvamerica_is_still_the_land_of_opportunity_hard.json": "私はフィリピンに住んでいます。大学でアメリカに住む機会がありました。\nレストランで働いていました。給料はすごかったですよ。とんでもない額を稼いでいました。\n稼いでいました。私の出身地では、これは高級管理職の給料です。I\n卒業もしていないのに、もう稼いでいるんですよ....",
  "data/reddit-changemyview/r/changemyview/comments/n1kg6j/cmv_if_someone_lives_a_full_happy_life_and_dies.json": "すべての文化が異なることは理解していますが、ここではアメリカのように機能しているものについてお話します。\n葬儀に関しては、アメリカ 私は、非常に高齢で自然死した場合（必要に応じて基準を設けるために82歳以上が良いでしょう。\n必要に応じて基準を設けるためには82歳以上がいいかもしれません。\n人生が提供するすべてのパッケージを手に入れたことになり、誰もが...",
  "data/reddit-changemyview/r/changemyview/comments/n1wejl/cmv_buying_new_underwear_every_6_months_is_a_scam.json": "先日、私の友人が、下着は6～12ヶ月ごとに買い替えることが「医師の推奨」だと言っていました。\nそうしないと不衛生だからだそうです。私はそれを調べました。\n調べてみると、彼の主張を裏付けるような記事や記述がいくつかありました。\nしかし、実際に調べてみると、その理由はいつも...。",
  "data/reddit-changemyview/r/changemyview/comments/mhes6z/cmv_the_concept_that_the_man_should_pay_for_the.json": "このスレッドはもちろん、伝統的な性別のストレートな男性と女性についてです。\nの役割を果たします。\n\n男である私が、知ろうとするたびに倍額を支払う必要があるという考え方は\nお酒の席での会話は、時代遅れであるだけでなく、正直言って困惑します。\n女性の中には、様々な人がいるので、もどかしい。"
}