{
  "data/reddit-ask/r/TooAfraidToAsk/comments/pfmbj5/im_a_24_year_old_virgin_who_has_never_had_a.json": "私は24歳の大学生で、生まれてからずっとフィリーに住んでいます。\n昔から男女問わず友達が多いです。私は誰からも好かれます。\n人当たりがよく、面白くて、社交的なんだ。誰とでも会話をすることができる。\n誰とでも会話ができます。容姿については、私は約...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pfnyiy/everyone_knows_its_never_okay_to_read_someone.json": "アンネ・フランクの日記は、昔から私の読書リストに入っていますが、なかなか購入する気になりません。\n買う気になれない。というのは、彼女は10代で、人に読ませるつもりで日記を書いていなかったからです。\n彼女は10代で、人に読まれることを意識して日記を書いていなかったからです。確かに、この本が出版された時には彼女は死んでいましたが\n出版された時には彼女は死んでいましたが、本当に読んでもいいのでしょうか？読んでもいいのか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pfpuqv/what_if_we_just_replaced_precious_jewels_with.json": "先日、ビヨンセとその前の数人のセレブが、有名なイエローダイヤモンドを身につけていたことが話題になりました。\n有名なイエローダイヤモンドを身につけていたことが話題になりました。\nそのダイヤモンドは（他のダイヤモンドと同様に）、奴隷鉱山で採掘された非常に暗く非倫理的なものです。\n\nそこで私は、色付きの（あるいは透明な）宝石の形をしたガラスを身につけることはできないだろうかと考えました...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pfol8p/how_the_fuck_am_i_supposed_to_get_an_entry_level.json": "就職活動を始めてまだ日が浅いのですが、これは私の神経を逆なでするような話です。\n緊張している。私は会社の資産になるために一生懸命働き、自分の力を発揮したいと思っています。\n働きたいと思っているのですが、誰もが2〜3年の経験を求めているので、とてもがっかりしています。\n私はとても落胆しています。私は、もういいやという気になっています。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pft2v7/what_if_instead_of_getting_married_to_someone_to.json": "これは仮説的な状況であり、説明されている状況は文化的な\n規範となります。肯定的な影響と否定的な影響についての回答を期待しています。\n回答をお待ちしています。\n\n返事はしないでください\n\n\"it's possible.\"\n\n\"It's not possible. \"と答えてください。\n\n編集1\n\nこのことは、ゲイのような機会を増やすことになる...。",
  "data/reddit-ask/r/askscience/comments/pfrjtl/askscience_ama_series_im_a_particle_physicist_at.json": "ハリー・クリフです。私はケンブリッジ大学の素粒子物理学者で、CERNの大型ハドロン衝突型加速器である\nCERNの大型ハドロン衝突型加速器のLHCb実験に従事していますが、ここでは、人類の最大の疑問に答えることができる新しい粒子や力の兆候を探しています。\n物理学の最大の疑問に答えてくれる可能性のある新しい粒子や力の兆候を探しています。\n物理学の最大の疑問に答えることができる新しい粒子や力の兆候を探しています。私の最初の著書『HOW TO MAKE AN APPLE PIE FROM...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pfs9eq/after_finding_information_that_my_teen_daughter.json": "13歳の娘の部屋を掃除していたら、彼女が愛していて恋人がいるという話が出てきました。\n恋人がいたことが書かれていました。私は、娘が安心して受け入れられ、何かを隠す必要がないと感じて欲しいと思っています。\nしかし、この話を持ち出して、彼女が何かの理由で私を怒らせるようなことはしたくありません。\nその情報は彼女の日記にありました。その情報は彼女の日記に書かれていて、私は誓って...",
  "data/reddit-ask/r/AskWomen/comments/pfuedq/what_are_you_looking_forward_to_for_the_month_of.json": "ちょっとした会話のきっかけになればと思いまして🥰。",
  "data/reddit-ask/r/AskHistorians/comments/pfiws6/how_socially_accepted_was_reading_a_softcore.json": "この質問は、『ビバリーヒルの警官II』を再見したときに、ポール・ライザーが演じるジェフリー・フリードマン刑事がプレイボーイ誌を読んでいる場面からヒントを得たものです。\nライザーの演じるジェフリー・フリードマン刑事が、仕事中にプレイボーイ誌を隠しもせずに読んでいる。\nポール・ライザー演じるジェフリー・フリードマン刑事が、仕事場でプレイボーイ誌を何の隠し味もなく読んでいる。\n\nこのシーンを見たときに、ホテルのコーヒーテーブルの上にプレイボーイの雑誌が置いてあるのを見た記憶が蘇りました。\nの家のコーヒーテーブルにプレイボーイ誌が置いてあるのを見た記憶を思い出した。",
  "data/reddit-ask/r/AskHistorians/comments/pfv7dj/postww2_how_did_east_germans_rationalize_now_we.json": "それとも私の考えが間違っているのでしょうか？私の質問は、どのようにして穴を開けられた人口が\nナショナリズム・ファシズム・ナチスのイデオロギーを何十年も叩き込まれた国民が、突然、ソ連の\n共産主義の理想を支持したのか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pfydy5/why_isnt_the_us_building_temporary_hospitals_to.json": "重症化してもワクチンでかなり軽減されることは知っていますが、多くの人が頑なに受けようとしないので\nしかし、多くの人がワクチンを摂取することを躊躇しているので、国が一時的な予防措置を取ったという話を見たことがありません。\n臨時の医療施設を作って対応しているという話を見たことがありません。",
  "data/reddit-ask/r/AskWomen/comments/pfto17/what_expectations_make_yall_feel_the_most_pressure.json": "女性の権利についての本を読んでいて、長年にわたって様々な面から女性に課せられてきた多くのプレッシャーに気づきました。\n様々な面からの圧力があることに気づきました。天気\n文化的、結婚的、社会的基準、重要な他者からの期待、その他様々な面で\n他にもいろいろあります。皆さんは何から最もプレッシャーを感じていますか？....",
  "data/reddit-ask/r/AskHistorians/comments/pg057s/the_powmia_flag_is_based_on_a_thoroughly.json": "このコメント\n[https://www.reddit.com/r/AskHistorians/comments/l88o0f/were_there_any_verified_american_pows_who_were/]\nは、陰謀論の起源と、その主張が何度も繰り返されてきたことをうまく説明しています。\n(その主張は何度も調査され、反論されていますが、私には\nしかし、なぜそのようなことが起こったのかはわかりませんでした。",
  "data/reddit-ask/r/askphilosophy/comments/pfy8j7/how_is_beastiality_generally_considered_bad_but.json": "先日、Big JoelのYouTube動画でこの質問を見ました。\n(https://youtu.be/DGwiyyZhNpM) アップロード者は、獣姦が悪いと言っています。\n動物の痛みから喜びを得るから悪いと言っていますが、肉を食べる人にとっては\n食べる人にとっては、食べたいという欲求の副産物でしかないからです。\n\nこの答えはとても...と思います。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pg8thb/where_the_fuck_are_the_plus_sized_mens_models.json": "タイトルにもあるように、私は男性よりも女性のプラスサイズのモデルをよく見かけます。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pg8bzv/to_all_people_with_a_partner_how_much_sex_do_you.json": "週/日/月に何回くらいですか？恋人がいない/結婚していない人からの質問です。\n恋人がいたことがない、結婚していない人間が言うのもなんですが、正直なところ、どんな答えが返ってくるかわかりません。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pga5oi/where_can_i_hide_condoms_and_where_can_i_dispose.json": "私の性生活はまだ始まったばかりなので、隠すためのアイデアが思い浮かびません。\n親に見つからないような場所に隠して処分するアイデアが浮かばない。\n見つけてください。",
  "data/reddit-ask/r/AskHistorians/comments/pfqn4i/what_happened_to_the_spouses_of_those_sentenced.json": "囚人の配偶者も移送されたのか？そうでない場合、その結婚はそのままでしたか？\nていたのか、それともそれぞれが他の人と自由に結婚できたのか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pg5pyl/someone_left_a_plastic_bag_with_what_appears_to.json": "本当に怖かったし、理解できません。誰か、何か\n玄関に置いてあった理由をご存知の方はいらっしゃいますか？\n\n編集：玄関と網戸の間に置かれていました - 2つのドアの間に挟まれたように\n2つのドアの間に挟まれたように置かれていました。これは偶然ではありません。\n\n2回目の編集：私たちはダウンタウンのようなところに住んでいて...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pg96pi/what_happened_to_hard_ice_cream.json": "私たちが子供の頃（90年代以上の子供たちだと思いますが）、冷凍庫の中のアイスクリームが固くなっていたのを覚えていますか？\n冷凍庫の中のアイスクリームが固くて、アイスクリームスクープをお湯で温めないとすくえなかったのを覚えていますか？\n掬うことができました。\n\n今では、どんな古いスプーンでも、どんなアイスクリームブランドでも使えるようになりました。そして、最近のアイスは\n最近では、アイスクリームが溶けるのがとても早くなりました。\n\nI...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pg4qoj/how_much_concern_should_there_actually_be_that.json": "テキサス州の人工妊娠中絶法案は、明らかに確立された権利を侵害する凶悪なものです...そして\nそれなのに、全体としてはまだ続いているようです。最高裁はいつも、政治的な影響を受けないようにと話しています。\nしかし、この時点で判事たちがイデオロギーに基づいて判断していることは明らかです。\nイデオロギーに基づいて判断していることは明らかで、もはや...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pg6nqf/is_it_better_to_drive_a_shot_person_to_the.json": "これがここで許されるかどうかわかりませんが\n\n詳細は省きますが、数ヶ月前、私の車の中で人が殺されました。\n病院には連れて行かず、車を停めて911に通報しました。\n\n彼はすでに車の中で亡くなっていました 今でも人々は私を非難し、私が運転すべきだったと言います。\n私が車を運転すべきだったと言っています 彼のいくつかの...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pg9o6e/how_does_drunk_texting_work_in_chinese.json": "英語では単語の綴りがごちゃごちゃになってミスタイプになってしまいますが、中国語では\nピンインを変えると全く違う文字になってしまうのでは？\n中国語では、ピンインを変えると全く違う文字になり、文章の意味が大きく変わってしまうのではないでしょうか？あるいは、中国語を話す人は、見た目の違いから意味を推測できるのでしょうか？\n中国人は、見た目は違うが音は似ている文字から意味を推測できるのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pgdyw5/i_really_dont_understand_the_new_law_in_texas.json": "ちょっと極端ですが、こんなことがあったらどうしますか？医者はどうするか？\n妊婦さんが「赤ちゃんを殺そうと思います」と言ったら、お医者さんはどうしますか？\n彼女は精神的な病気とみなされるのでしょうか？それでも彼女に赤ちゃんを産ませるのでしょうか？誰かが\n誰かが、彼女が胎児を傷つけようとするのを止めることができるでしょうか？",
  "data/reddit-ask/r/askscience/comments/pgfkcn/askscience_ama_series_im_jon_schwantes_from.json": "こんにちは、Reddit。PNNLのJon Schwantesです。私と私のチームは、歴史上の大きな謎の一つを解明するために\n歴史上の大きな謎の一つを解明しようとしています。第二次世界大戦中、アメリカとナチス・ドイツは核技術の開発を競っていました。\nドイツは核技術の開発を競っていました。連合国はそれを阻止しました。\n連合国はドイツの計画を阻止して 2インチ×2インチのウラン・キューブを没収しました...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pgh02v/should_we_create_a_rtooafraidtoasknsfw.json": "正直なところ、私が最近目にする質問の100％は、性的なことに関するものか、またはnsfwです。\n他のタイプの質問のためのスペースを確保するために分離すべきかもしれません。\nこのサブレディットを独立させるべきではないでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pghiyj/is_it_rude_to_masturbate_in_bed_when_your_partner.json": "色々な理由でパートナーが今はセックスをしたくないと言っています。これまでに\n2020年に入ってから5回ほどセックスしています。\n\n私は明らかに相手を尊重し、相手に主導権を握らせていますが、私はまだ興奮したいのです。\n彼らが私の隣で寝ている間に私が（静かに、ポルノではなく）オナニーをしたら、失礼にあたるでしょうか？\n\n私は...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pgjy8t/where_could_you_hide_a_sex_toy_where_your_lil.json": "昨日、母と喧嘩をしたのですが、その過程で、母が私がセックスグッズを持っていることを知っているのは\nそもそも私が性的玩具を持っていることを母が知っているのは、（会話とは関係ないが\nそもそも私が性的玩具を持っていることを知っているのは、弟がそれを見つけたからだと認めました。彼は私の物を見るのが好きで\n彼は私の物を見るのが好きで、私には何もできません...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pghhpu/im_a_canadian_transplant_living_in_texas_my.json": "もちろん、これからお母さんになる人にとっては、最悪のシナリオの1つです。\nしかし、私は今、とても現実的な恐怖を感じています。私の命が危険にさらされた場合、解約するという選択肢はなくなるのでしょうか？\n私の命が危険にさらされた場合、妊娠を解除する選択肢はなくなるのでしょうか？重度の遺伝子異常がある場合はどうでしょうか。\n重度の遺伝子異常がある場合には、妊娠を完全に乗り切らなければならないのでしょうか？",
  "data/reddit-ask/r/askscience/comments/pglvry/how_do_lungs_heal_after_quitting_smoking.json": "皆さん、こんにちは。ここで何かを感じ取ろうと思っています。もし私が喫煙者で、禁煙した場合\n肺が回復するには1ヶ月かかると言われています。\n完全に禁煙した場合、肺が回復し始めるまでに1ヶ月かかるとインターネットでは言われています。肺は禁煙後、毎日少しずつ回復していると思うのですが\n肺の健康を取り戻すのに1ヶ月かかるというのは...",
  "data/reddit-ask/r/AskHistorians/comments/pgiu9v/did_construction_technology_only_improve_rapidly.json": "カエサルの注釈書の第4章で、ナポレオンは次のように批判している。\nプルタルクが紀元前55年のシーザーのライン橋を奇跡と呼んだことを批判し，その橋は1809年の彼の橋に比べて\n1809年の彼のものと比べても目立たないと述べている。私は彼が時間差を無視しているのが可笑しいと思う。\n時差を無視しているのが笑える。しかし、もしかしたら、私は私たちの急速な...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pgmq3i/how_do_women_wearing_tampons_have_spontaneous_sex.json": "純粋に興味があるのは、女性が性的に盛り上がったときに、タンポンを捨てなければならないときに\nタンポンを捨てなければならない時に、女性はどのようにして「その場にいる」ことができるのでしょうか？\n女性はどのようにして「その瞬間」を過ごすことができるのでしょうか？) 私にパートナーがいたときは、その日にセックスするかどうかを先読みして、タンポンをつけないようにしていました。\nパートナーがいたときは、その日にセックスをするかどうかを先読みして、そのためにタンポンをつけないようにしていました。",
  "data/reddit-ask/r/Ask_Politics/comments/pg4cyr/how_does_this_supposedly_clever_new_texas.json": "私が調べたところによると、この新しい法律は、民間人が中絶業者やその他の人を訴えることができるという訴訟原因を作ったということです。\n民間人が中絶業者や中絶を幇助した人を訴えることができるというものです。\nこの新法は、民間人が中絶業者や中絶を幇助する者を訴えることができる訴訟原因を作ったというものです。\n\nつまり、この法律は裁判で争うのが難しいということです。\n判決を下す司法官は...",
  "data/reddit-ask/r/AskHistorians/comments/pgkqs6/did_any_historical_armies_employ_shamans.json": "そのような人たちに、未来を占ってもらったり、戦いの前に兵士を祝福してもらったり、戦いから離れた場所で勝利を祈ってもらったりすることが\n戦いの前に兵士を祝福したり、戦いから離れて安全な場所で勝利を祈ったりすることが\n世界の多くの文化では、このような人々に未来を占ってもらったり、戦いの前に兵士を祝福してもらったり、戦いから離れて安全な場所で勝利を祈ったりすることが一般的でした。(魔法があるかどうかを聞いているのではありません。\nP）。)\n\nしかし、私が特に興味を持っているのは、そのようなことが...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pgox9d/is_it_ok_to_want_to_be_alone_95_of_the_time.json": "率直に言うと、私は人が好きではありません。人と会ったり、友達を作ったりすることにも興味がない。\n人と会ったり、友達を作ったりすることに興味がありません。家族と数人の選ばれた友人だけが\n話す努力をしているのは家族と数人の友人だけです。\n\n自分が不安を抱えているとは思っていません。他の人には礼儀正しいのですが、集団の中には入りたくないのです。\n集団の中には入りたくないのです。私は少し...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pgqp01/why_arent_more_americans_visibly_outraged_that.json": "裏切り者だとか、軍隊に感謝していないとか言われるのが怖くて、この質問はできません。\nてしまうのではないかと恐れています。この20年間、多くの人々が路上に放り出され、多くの家族が生活の維持に苦労してきました。\nこの20年間、多くの人々が路上に放り出され、多くの家族がホームレスになる寸前で頭を抱えていました。\n多くの家族がホームレスになる寸前で頭を悩ませています。調査によると...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pge8sr/does_breast_size_actually_matter.json": "私は小柄な方ですが、付き合っている男性が、元彼は体重が重い方だったと\n比べているわけではないと言っていましたが、今はとても意識しています。\n彼は比較していないと言いましたが、私は今とても意識しています。胸の小さい人が好きな男性はいますか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pgr94t/why_are_americans_so_obsessed_with_abortion.json": "複雑な問題であることは理解していますが、彼らは他の多くの重要な問題を無視しているようです。\n他の多くの重要な問題を無視して、この問題を延々と訴え続けているように思えます。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pgrl94/can_it_be_possible_that_the_microphone_in_your.json": "確かに、数時間前や一日前に話したばかりの製品が宣伝されている広告を目にすることがあります。\n数時間前、あるいは一日前に話したばかりの製品が宣伝されている広告を見ることがある。\n\n今朝、彼女に電池を買う話をしたら、夕方には電池を届ける広告が出てきた。\n夕方になると、電池を配達する広告が出てきます。二人とも電池については何も入力していないし\nそのようなことはしていません。....",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pgqlwc/how_can_texas_push_policies_that_protect_the.json": "私は、現在のテキサス州の政治的戦場に心から困惑しています。\n人々は、マスクをするかしないかという「個人の権利」を激しく主張しています。\nしかし、女性のリプロダクティブ・ライツが組織的に破壊されていることに反発する人はほとんどいません。\n女性のリプロダクティブ・ライツが組織的に破壊されていることに反発している人はほとんどいません。....",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pgq77g/why_do_prolife_proponents_not_support_all_the.json": "性教育／避妊教育といったプログラムのことです。\n避妊具の提供、WICの改善、予防的ケアのための子どもの医療費の\n養子縁組をより身近なものにすること。\n養子縁組をより身近なものにしたり、里親制度を改善したり、などです。\n\nなぜ...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pgvlze/can_the_church_of_satan_make_abortions_a.json": "カソリックが自分の宗教を他人に押し付けることにはうんざりです。テキサスはまさに\nテキサス州は、教会が国家から分離していないことの最も最近のエピソードです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pgwrjx/aside_from_condoms_why_are_there_no_birth_control.json": "避妊具は、男性にとっては正しい用語ではないかもしれません。なぜ他に\n精子の生産量を減らしたり、止めたりすることができないのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pgxfpe/after_what_distance_is_an_orgy_still_considered.json": "4組のカップルが1フィート離れたところでセックスをしていたら、それはおそらく\n乱交パーティーです。\n\nしかし、その距離を延ばしてみたらどうでしょう？\n\nカップルが50フィート離れていたらどうでしょう？100? 1000??\n\nサッカー場1つ分の距離にいる人たちが、パートナーを入れ替えたり、交換したりしても、それは乱交なのでしょうか？\nパートナーを交換して...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pgv88e/how_the_hell_is_krispy_kreme_making_a_profit.json": "さて、まずクリスピークリームは、ワクチンを接種した人に無料でドーナツを配っています。\n個人的にはとても素晴らしいことだと思っています。しかし、これを1回限りの取引にするのではなく\nしかし、メディアの注目を集めるための美徳主義のような1週間の一回限りの取引ではなく、彼らはこれを5ヶ月以上続けています。\nこれを5ヶ月以上も続けています。さて、本当に...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pgyl1t/is_anyone_else_not_doing_the_best.json": "簡単なことですが、一般的な状況を考えると......すべてに身振り手振りをつけます。\n-私は今、ベストな状態ではないと思っています（特に、自治権を奪おうとしている国のアメリカ人女性として）。\n特に、アメリカ人女性として、私の自主性を奪おうとしている国で）。)\n\n友人に聞いてみたところ、彼らも同様に気分が悪いと言っていましたが、他に誰か\n他には...",
  "data/reddit-ask/r/AskHistorians/comments/ph0yzm/how_did_the_ottoman_army_go_from_being_the_terror.json": "オスマン帝国の軍隊（および帝国全体）が、ヨーロッパの軍事的・科学的発展についていけなかったという話はよく聞きます。\nヨーロッパの軍事的、科学的発展に追いつけなかった。そのため、オスマン帝国は\n一時は「ヨーロッパの恐怖」と呼ばれ、その軍隊はほとんど常に勝利を収めていましたが\nそのため、一時は「ヨーロッパの恐怖」と呼ばれ、その軍隊はほぼ常に勝利を収めていたのですが、19世紀初頭にはほとんど笑いものにされてしまいました。",
  "data/reddit-ask/r/AskHistorians/comments/ph0et5/japan_is_considered_a_full_democracy_yet_since.json": "タイトルですが、私の記憶では2つの例外（90年代と2000年代）を除いては\n自民党は基本的に日本を無傷で支配してきたと思います。これは私にとっては驚きです。\nこれは、様々な政党が存在することや、日本経済が繁栄していないことを考えると、驚くべきことです。\n日本の経済はもう何十年も繁栄していません。....",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ph1j9i/why_can_women_abort_out_of_pregnancies_but_men.json": "まず第一に、私は選択を支持します。自分の体でやりたいことをやるのです。しかし\nしかし、私が理解できないのは、なぜ女性は子供を産まないことを選択できるのに\n一方、男性は女性が選択した場合、自分が望まなかった赤ちゃんに経済的支援をしなければならない。\n女性が望めば、男性は望んでいない赤ちゃんに経済的援助をしなければならない。\n\n私には、もし女性が赤ちゃんを産みたいと思えば、...",
  "data/reddit-ask/r/askscience/comments/ph5yvv/can_and_how_protons_fuse.json": "問題は単純で、2つの陽子がクーラムズの壁を越えるとどうなるのか？\n融合してある種のハドロンを作るのか？それとも、2つの陽子はお互いにくっついて\nそれとも、2つの陽子はお互いにくっついて原子核のようなものを作るのでしょうか？それとも何か他のことが起こるのでしょうか？",
  "data/reddit-ask/r/askscience/comments/ph2crv/in_space_is_it_as_easy_to_accelerate_an_object.json": "宇宙では、地球上のように物体を高速に加速することは難しいのでしょうか？\n難しいのでしょうか？\n\n地球上では、時速20〜30マイルで走ることは、時速220〜230マイルで走ることよりもはるかに簡単です。\n\n空気抵抗や工学的な制限がない場合、物体を高速化するための制限要因があるとすれば、それは何でしょうか？\n空気抵抗や工学的な制限がない場合、より速い速度に到達するための制限要因があるとすれば、それは何でしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/phav6u/why_is_the_personhood_of_a_fetus_determined_by.json": "機能的には生後6週間の胎児の方が自律的ではないのに、心拍だけでその状態になるのはあまりにも恣意的だと思います。\n生後6週間の胎児は、ミミズよりも自律的で発達していません。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ph84sk/do_you_feel_like_youve_lost_2_years_of_your_life.json": "パンデミックが始まった時、私は15歳で、今は17歳ですが、周りを見ても実感がありません。\n感じない。逃してしまった多くの経験があり、それがとても不思議に感じられます。\n\nパンデミックが始まって以来、私はオンラインスクールを利用しています（私が通っていた高校では\n私の高校では、パンデミックが始まったときにひどいオンラインプログラムがありましたが、私はオンラインスクールに通っていました。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/phdprt/do_americans_actually_think_they_are_in_the_land.json": "私が無知なだけかもしれませんが、正直なところ、アメリカは他のほとんどの第一世界の国と比べて\n他の第一世界の国々と比べて、アメリカは市民の自由に関しては最下位のようです。\n市民の自由に関しては、アメリカは他の第一世界の国々に比べて最下位のようです。\n\nこれはアメリカを非難しているわけではありません。どの国にも欠点はあります。しかし、私は\n厄介な性質を持った...",
  "data/reddit-ask/r/NoStupidQuestions/comments/ph8i3a/is_it_bad_to_wear_a_gamer_headset_to_a.json": "例えば、私は多くの教授たちと研究プロジェクトに関するミーティングを行っています。\nプロジェクトを進めています。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/phf5r3/are_american_people_really_living_on_paycheck_to.json": "月末までに次の給料が保証されていないと意味がありません。\n住む場所や健康保険など、必要なものをすべて失ってしまうということですか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/phh2he/why_has_this_sub_recently_become_people_pushing.json": "最近の \"ホット \"な質問は、基本的にすべてそうです。\"なぜ[高い人気を誇る意見]が現状維持ではないのか？\n人気のある意見]が現状ではないのはなぜか？\" そして誰もがそれに食いつく。\n\nそして、そう、私はここで自分の課題を押し付けているのです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/phhohm/why_does_the_united_state_get_flack_about.json": "私が思うに、この件に関しては、アメリカの方が特にひどいのでは？私はヨーロッパの国々に移住することを\nヨーロッパの国々に移住することを検討しましたが、メキシコからの移民にも多くの規則と費用がかかります。\nメキシコからの移民に対しても",
  "data/reddit-ask/r/NoStupidQuestions/comments/phcq1e/if_you_woke_up_tomorrow_and_realised_youre_the.json": "自慰行為をするとは言えません。",
  "data/reddit-ask/r/AskHistorians/comments/phf31m/an_american_idiom_is_to_add_the_phrase_and_the.json": "編集：最後の文は、「What can AskHistorians shed」とすべきでした。\nこの特定のトピックに関して、AskHistoriansは何を照らしてくれるのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/phdk46/american_comic_book_author_rob_liefeld_is_not.json": "まず、私は漫画にあまり興味がないので、リーフェルドのことは評判でしか知りません。\nとアート\n[https://3.bp.blogspot.com/-LpUNDt1iQBw/TheIbJ_ArAI/AAAAAAAAI4M/k2Cdc9IHHnk/s1600/liefeld-cap.jpg]。\n今日、彼のことを調べていたら、彼には以下のような擁護者がいることがわかりました。\nグラント・モリソンとか...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/phoy3t/why_is_masturbation_so_heavily_frowned_upon_in.json": "私はクリスチャン（女性）ですが、誰かと積極的に性交渉をしていないのに、自慰行為をして何が悪いのか完全には理解できませんでした。\n結婚前に誰かと積極的に性交渉をしていないのに、自慰行為をして何が悪いのかよくわかりませんでした。\n私は、結婚前に誰かと積極的に性交渉をしていないのに、自慰をして何が悪いのかよくわかりませんでした。12歳の時、母にいつオナニーしていいか聞いたのを覚えています。\n12歳の時、母にいつ自慰行為をしていいか聞いたことがあります。",
  "data/reddit-ask/r/AskWomen/comments/pho1sc/what_i_want_to_say_is_thank_you_x.json": "長年の読者であり、今回初めてコメントします。\n\nここ数ヶ月、本当に辛いことが多かったのですが、このサブレディットには本当に助けられました。\nスルー\n\n今までコメントをアップするために参加していなかったのは残念ですが、これからも投稿を続けてください。\nあなたがどれだけ多くの人にポジティブな影響を与えているかわかりません。\n\nみんなありがとう🙂🙂❤。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/phsoqe/people_who_buy_reddit_coins_why.json": "私はredditがくれる無料の賞はすべて受け取りますが、このためにお金を使うことはありません。\nここにお金を使う人は、なぜそうするのですか？お金持ちなんですか？私は本当にただ\n興味津々",
  "data/reddit-ask/r/AskHistorians/comments/phrjj6/in_the_manga_kurosagi_corpse_delivery_service_an.json": "スキャンはしていませんが、この漫画のある章では、ある死を捜査しているときに\n笹山はその事件が731部隊と関係があることに気づき、若い主人公たちに731部隊のことを知っているかどうか尋ねる。\n731部隊と関係があることに気づき、若い主人公たちに731部隊のことを知っているかどうか尋ねる。すると\n頭のいい佐々木でさえ知らないと、笹山は文句を言う。",
  "data/reddit-ask/r/AskHistorians/comments/photfj/i_recently_saw_the_classic_film_casablanca_for.json": "私は1942年にはいなかったので、当時のアフリカ系アメリカ人の典型的な描写と比較して、サムのキャラクターがどのように映っていたかはわかりません。\n当時のアフリカ系アメリカ人の典型的な描写と比較して、サムのキャラクターがどのように映ったかはわかりません。\n当時のアフリカ系アメリカ人の典型的な描写と比べて、サムのキャラクターがどのように映っていたかはわかりません。\n\n一方で、彼はボギーの二枚目で、非常に忠誠心が強いのですが、従属的ではありませんでした。\nしかし、従属的ではなく、悲惨な状況ではよく発言していました...。",
  "data/reddit-ask/r/AskHistorians/comments/php9is/reasons_for_locating_many_concentration_camps_in.json": "イスラエルの現外務大臣であるヤイル・ラピド氏は、次のように語っています。\nと述べています。\n\n> ナチスが絶滅の中心地を作ったのは偶然ではありません。\n> ポーランドです。彼らはポーランド人が協力してくれることを知っていたのです。\n\nこの主張は正しいでしょうか？ポーランド人の意思」とは...",
  "data/reddit-ask/r/askscience/comments/phvr8h/where_does_the_co2_absorbed_by_trees_end_up.json": "木が取り込んだCO2の最終的な行き先は何でしょうか？木の体？それとも\n森が燃えてしまったら、また大気中に放出されるの？",
  "data/reddit-ask/r/AskHistorians/comments/phutzg/how_were_teenagers_going_into_battle_and_not_only.json": "16歳の子供が、年長者や熟練者と戦える体力や経験を持っているとは思えません。\n経験豊富な年配の方々と戦えるだけの体力と経験があるでしょうか？\n経験豊富な年配の方々と戦える体力や経験があるでしょうか？さらにおかしいのは、彼は王位継承者であり、なぜ彼の父親がそのようなことを許したのか？\n彼の父親はなぜそのようなことを許したのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pi19uo/is_it_just_me_or_does_2019_seem_like_a_lifetime.json": "なぜこのような質問をしたかというと、2019年は最後の年として\nすべてが普通に感じられた最後の年であり、それ以来、この世界は大きく変化したので、私は\n2019年からまだ2年しか経っていないことが信じられませんが、それ以降に経験した変化を見ると、2019年が100年だったように感じます。\n2019年からたった2年しか経っていないことが信じられません。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pi1whm/isnt_it_more_logical_to_assume_that_death_is.json": "多くの宗教では、死後の世界は天国と地獄のようなものとして描かれていますが、不思議と\n死後の世界が生前と全く同じ体験であると考えることは、あまり一般的ではないのが不思議です。\n生まれる前と全く同じ経験をすると考えることは、あまり一般的ではないのが不思議です。もし、時間が逆転して、劣化して生まれる前に戻ったとしたら\n生まれていない状態に劣化したとしても、死は全く同じことではないでしょうか？\n\nっていうか...。",
  "data/reddit-ask/r/askphilosophy/comments/phuztd/is_jordan_peterson_really_a_profound.json": "ジョーダン・ピーターソンは天才だ」と断言する人に出会うことがあります。\n天才、いや、ポストモダン・ネオマルクス主義（文化的ボリシェヴィズム）の魔の手から我々を救うために送られた救世主だと断言する人たちに出会います。\nネオマルクス主義（文化的ボリシェヴィズム、誰？\n\n私はこれらの人々に、彼は哲学者でもなければ宗教学者でもないと言います。\nしかし、彼らは私に「私はただ...」と言うのです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pi03f9/what_is_so_hot_about_virgins.json": "全然わからないんだけど、なんでインセルの人ってそんなに処女が欲しいって言うの？やはり\n使い古された女は嫌だ」ということと関係があるんだろうけど、ただただキモいし、俺が見てる以上に\n私が見ている以上にキモいと思うのです。私はそれを頭の中でまとめようとしています。\n頭の中でまとめようとしていますが、理解できません。",
  "data/reddit-ask/r/AskHistorians/comments/phzr81/what_do_we_know_about_the_ecological_effects_of.json": "私が思いつく可能性としては、動物の移動ルートの乱れです。\n誰かがそれに気づいたかどうかはわかりません。メンテナンスや工事のために、水やその他のものを迂回させるのは\nメンテナンスや建設のために、水やその他のものを迂回させることは？ありがとうございました。",
  "data/reddit-ask/r/AskHistorians/comments/pi4x8r/ive_heard_about_it_but_what_exactly_is_fascism.json": "さて、知らないからといって殺される前に言っておくと、私はファシズムが\n悪いものだということは知っていますが、その理由は知りません。ヒトラーはもちろんですが、ムッソリーニやフランコの政権で特に悪いことをしたという記憶はありません。\nムッソリーニやフランコの政権で特に悪いことをした記憶はないし、少なくともホロコーストのようなものではない。\nそれは一体何なのか？政策や自由など、何を必要としているのか。",
  "data/reddit-ask/r/AskWomen/comments/phs7lp/has_your_relationship_with_your_father_gotten.json": "このスレッドには、美しく傷つきやすく、オープンで正直なコメントが並んでいます。\n親のような存在との関係は、自分自身の価値や本質的な価値を反映するものではないということを、皆さんにお伝えしたいと思います。\n自分自身の価値や本質的な価値を反映しているわけではありません。❤️",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pi6a0h/a_math_problem_my_mom_showed_me_help.json": "ある男が80ドルの服を買う。彼はそれを100ドルで売ります。その後、彼はそれを90ドルで買い戻します。\n110ドルで売りました。問題は、彼がどれだけのお金を稼いだかということです。私は次のように考えます。\n私は40ドルだと思いますが、母は20ドルだと言います。\n\n編集：混乱した数学から安全な人はいないと思います。\n\n怪物を作ってしまった",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pi4wpl/how_do_i_stop_choking_up_when_im_trying_to_stand.json": "今日もこの馬鹿のせいで泣きそうになっていた。\nどうすれば、このような気持ちを抑えることができるでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pi6p7o/does_personality_really_matter_more_than_looks.json": "私はredditのアーカイブを見て、以下のような質問の多さに気付きました。\n「しかし、これらのスレッドでは、「太った/ぽっちゃりした男性を好む女性はいますか？\nこのようなスレッドでは、「It's personality that matters」のような答えで質問をかわしているコメントが多く見られます。\n重要なのは性格だ」というような答えで質問をかわしているコメントを多く見かけます。私が質問をかわしていると言うのは、彼らが...",
  "data/reddit-ask/r/AskWomen/comments/pi7zgb/if_youve_ever_confronted_a_partner_about_cheating.json": "彼らはどのくらいの期間、嘘をつこうとしたのか、あるいは正直に話そうとしたのか。\n経験を",
  "data/reddit-ask/r/NoStupidQuestions/comments/pi9vza/not_to_get_political_or_anything_but_what_the.json": "彼は熊なのか？What the fuck???? Why is he red ????",
  "data/reddit-ask/r/NoStupidQuestions/comments/picng3/should_i_leave_a_negative_review_exposing_the.json": "簡潔に言うと、私は以前、技術系の会社で働いていて、2020年の11月頃に入社しました。\n年11月頃に入社し、今年の1月下旬頃に退職しました。\n扱われたからです。彼らが私に言ったこと、したことの一部を紹介します。\n\n- 私はお酒を飲まないのですが、彼らは常に私にお酒を飲むべきだと言っていましたし、彼らは\nしようとしていました。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pifpit/why_do_jocks_do_super_gay_hazing_rituals_on.json": "最近、私の母校である高校がちょっとした危機に見舞われました。陸上部の年長者たちが、若い子たちに痴漢行為をしていたのです。\n陸上部の年長者が年少者を虐待していたのです。彼らは「カップチェック」と言って、若い男子のショーツを下ろして\n年下の男子のショーツを下ろして、手でタマやペニスをカップに入れていました。彼らは\nまた、他の状況でも、彼らのペニスを触っていました。\n\n購入時に...",
  "data/reddit-ask/r/AskHistorians/comments/pibo2j/were_european_royal_meals_as_lavish_as_they_are.json": "ヴァイキング」、「ローマ」、「ゲーム・オブ・スローンズ」、「チューダーズ」、「スパルタカス」などの人気テレビシリーズでは\nThe Crownなどの人気テレビシリーズでは、エリートや王、首長などが、しばしば\nテーブルの近くに座って食事をしています。これは\n映画にもたくさん出てきます。\n\n当時のほとんどの人は、一人で食べていける...",
  "data/reddit-ask/r/AskHistorians/comments/pihm6d/apparently_german_and_englishspeaking_historians.json": "クレオパトラの祖先の問題は、インターネット上でよく「議論」されている問題です。\nこのRedditでも他のサイトでも、インターネット上でよく「議論」される質問です。\n一般的には、クレオパトラはエジプト人ではなく、ギリシャ人であると指摘されがちです。\n\nさて、私はドイツの大学で歴史を学んでいますが、その中で...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pie4g6/is_it_weird_that_i_can_only_handle_23_hours_of.json": "以前は、これはSOの家族だけのことだと思っていましたが、最近、自分の友人や家族に対しても同じだと気づきました。\n自分の友人や家族も同じだということに最近気づきました。数時間後には\n数時間後にはもう交流したくなくなり、一人になりたい、妻と二人でいたいと思うようになりました。\n妻と一緒にいたいと思うようになりました。",
  "data/reddit-ask/r/askphilosophy/comments/pigaiz/i_am_teaching_introduction_to_philosophy_and_im.json": "何か提案はありますか？何かお役に立てることがあれば、本当にありがとうございます。\n\n倫理学、認識論、心の哲学の3つの分野で、それぞれ1つのムービーが必要です。\n心の哲学」です。\n\nこれらは非公式の「映画会」で、学生たちが集まって見ることになります。\n視聴することになります（講師の私はいません）。クラスは以下のように設定されています...",
  "data/reddit-ask/r/askscience/comments/pioh4a/can_the_coronavirus_mutate_to_be_less.json": "バリエーションが増えるごとに透過性が増しているように思いますが、その逆は可能でしょうか？\nその逆は可能ですか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/piqe53/how_do_i_tell_a_friend_she_needs_to_shower_often.json": "私の親友には、本当に臭い人がいます。彼女の衛生状態は最悪です。彼女は\n歯も髪も磨かないし、きれいな服も着ない。彼女は一緒にいて一番楽しい人です。\n一緒にいて一番楽しい人だし、話すのも好きだけど、彼女は臭い。私は、彼女に少しだけ\n私がしている衛生管理の秘訣を少し話してみたのですが、それに加えて歯磨きもしない...。",
  "data/reddit-ask/r/AskWomen/comments/pihp1x/what_is_a_habit_you_wish_you_adopted_sooner.json": "若い頃にやっていたら、今の生活がもっと楽になっていただろうな、と思うようなことです。\n若い頃にやっていたら、今の生活がもっと楽になっていただろうと思えるもの。",
  "data/reddit-ask/r/AskHistorians/comments/piryyd/in_1971_over_96_of_voters_in_egypt_libya_and.json": "ウィキペディアによると、リビア、エジプト、シリアは、1971年にアラブ共和国連邦への加盟を問う住民投票を\n同時にアラブ共和国連邦への加盟を決めた。エジプトは投票率99.96%、投票率98.1%で承認。\nエジプトは投票率99.96%、投票率98.1%、リビアは98.6%、投票率94.6%、シリアは96.4%、投票率89.7%で承認された。\nシリアは96.4％、投票率89.7％であった。正確であれば、これは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/piperh/do_other_people_find_themselves_wanting_to_just.json": "暗いところでヘッドホンをフルにして、誰にも邪魔されずに座っていたいと思うことが多いのです。\n誰にも邪魔されずに",
  "data/reddit-ask/r/NoStupidQuestions/comments/pit6hr/what_do_mummies_actually_want.json": " * Vampires want to suck your blood or make you their thrall.\n\n * ♪ゾンビはあなたの脳を食べたい\n\n * ゴーストはやり残したことがある。\n\nこれらのミイラたちは、実際には何を達成しようとしているのでしょうか？\n\nブレンダン・フレイザーの映画では、死んだ妻を復活させようとしていたが、それは特定の...\nそれはちょっと特殊な...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pixlxa/why_are_so_many_tech_questions_solvable_by_have.json": "IT関係者の方、ご説明ください。\n\n技術的な問題は、デバイスの電源を切ったり入れたりすることで解決できるという話があります。\n私はこの言い伝えが実際にかなり正しいことを発見しました。\nこれはなぜでしょうか？なぜ、コンセントを抜いたり、再起動したりするだけで、問題が解決するのでしょうか？\nよくあることなのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/piv8pd/do_americans_really_go_to_church_as_often_as.json": "私はオーストラリア出身ですが、60歳以下の人が自分の「教会」について話すのを文字通り聞いたことがありません。\n自分の「教会」について話しているのを聞いたことがありません。\n\nしかし、私が見たForged in Fireのほとんどすべてのエピソードでは、出場者は常に何らかの形で自分の教会について言及していました。\nしかし、私が見たForged in Fireのほとんど全てのエピソードで、出場者は常に何らかの形で自分の教会について言及しています。同じように\nアメリカの他のテレビ番組でも同じです。彼らは...",
  "data/reddit-ask/r/askscience/comments/pj0zwo/is_it_possible_for_fossils_to_be_found_in.json": "息子と一緒にmagic school busを読んでいて、こんな疑問が浮かびました。もし\n堆積岩の中で化石ができて、その岩が変成岩になったとしたら\n化石はその過程で生き残ることができるのか？",
  "data/reddit-ask/r/AskHistorians/comments/pj00os/a_common_critique_of_the_interstate_highway.json": "ここに [http://iqc.ou.edu/2014/12/12/60yrsmidwest/] 私が話していることの視覚的な例があります。\nオクラホマ大学の例です。\n\n以下は、テキストによる具体的な批評の例です。\n\nCNNより\n[https://www.cnn.com/2021/02/27/cars/buttigieg-highway-removals/index.html]をご覧ください。\n\n> Njeri Camara, 61, can't....",
  "data/reddit-ask/r/AskHistorians/comments/piv4rg/in_british_schools_philip_ii_of_spain_felipe_ii.json": "それは教育カリキュラムと関係があるのか、それとも歴史家たちが彼を「タレント」とみなしていないのか。\n歴史学者たちは、彼を「真の」イングランド王と見なしていないのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/pj3zty/can_anyone_shed_some_light_on_the_transition_from.json": "私の友人（助産師を目指している）は、白人男性の医師が女性を病院に入れないようにするために移行が起こったと主張しています。\n移行が起こったのは、白人男性の医師が女性をプロセスから遠ざけるためだと主張する友人がいます。\nと主張しています。これは... 私には信じられません。この主張に信憑性はあるのでしょうか？どのようにして\n出産時の死亡率は、...の結果、どのように変化しましたか？",
  "data/reddit-ask/r/AskWomen/comments/pjammi/what_is_a_small_cheap_thing_you_like_to_buy_when.json": "化粧品でなくても、いわば「物欲をそそる」ものであれば何でもいいのです。\nといったものです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pj9uo4/does_anyone_else_grope_their_own_ass_just_to_see.json": "男の形をしているのが残念ですが",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pizwmp/wait_do_americans_actually_pay_for_the_hospital.json": "私はいつも、それが現在進行形のジョークだと思っていました....",
  "data/reddit-ask/r/askscience/comments/pj4rr9/dolphins_use_echolocation_to_visualize_objects.json": "例えば、「魚」という言葉に対して、魚の音像（または簡略化したもの）を再現することができるか。\n魚の音像（または簡略化したもの）を再現できるか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pjcpqp/is_27_too_old_to_be_putting_glowinthedark_stars.json": "自意識過剰になるかどうかはわかりませんが :/。",
  "data/reddit-ask/r/AskHistorians/comments/pje30i/zoroastrianism_was_probably_the_most_followed.json": "パウロの時代には、ローマの支配下に多くのゾロアスター教のコミュニティが存在していました。\nパウロの時代 なぜ初期のクリスチャンは彼らの改宗に力を入れなかったのでしょうか？それは、彼らの\nキリスト教徒がゾロアスター教に挑戦することは、政治的に問題があったのでしょうか？\n\n初期のユダヤ人は、ゾロアスター教徒を同じ神を信じる者として見ていたのですか？彼らはきっと...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pja284/is_it_a_normal_or_okay_reaction_to_get_mad_at.json": "私の彼氏は、自分と他の人との3Pをしないかと聞いてきました。\nと聞かれました。最初は怒らないようにしていましたが、今は動揺しています。この反応は大丈夫なのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/pjcd6o/at_what_point_in_history_did_the_idea_of_a_chain.json": "例えば、ローマの複数の場所に存在する標準化された酒場の設定に、ローマ人が立ち寄ることができるでしょうか？\n例えば、ローマの複数の場所に存在する標準的な居酒屋の設定に、ローマ人が立ち寄ることができるでしょうか？中世の労働者は、自分の近くの都市の複数の場所で同じ\n中世の労働者は、同じ道具を最寄りの都市の複数の場所で見つけることができたでしょうか？ヴィクトリア朝の貴族が\nヴィクトリア朝の貴族は、スポーツや......同じ品質の道具を見つけることができるでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pjgf3r/why_am_i_never_stressed_out_by_actual_stressful.json": "私はとても後ろ向きです。私は普通の人がするようなことではストレスを感じません。\n人生の厳しい状況のほとんどは、私を悩ませませんが、小さなことでは\n躊躇します。\n\n近くでの喧嘩、警察の出動、災害の発生、感情の爆発、死、口論などなど。\n感情の爆発、死、口論などは、私には関係ありません。I...",
  "data/reddit-ask/r/askscience/comments/pj9dit/why_is_there_discrete_states_of_matter_as_opposed.json": "なぜ物質は、固体→液体→気体という個別の相を経るのではなく\nバターのような、シロップのような、連続した変化ではなく",
  "data/reddit-ask/r/NoStupidQuestions/comments/pjdzkt/what_do_flys_even_want_from_me.json": "ハエが頭の周りをブンブン飛び回り、顔にぶつかっては消えていく。これで彼が得るものは\nこれで何が得られるのだろう？",
  "data/reddit-ask/r/askscience/comments/pji1bh/why_is_laser_light_monochromatic.json": "一般的な説明では、電子がある軌道から別の軌道に移動することで\nその際に放出される光はE=hfで与えられます。しかし、電子の\n電子の位置は確率で決まる「曖昧」なものなので、放出された光の波長が小さく変化しないのはなぜだろう？\nはなぜ波長の小さな変化を示さないのか？(あるいは...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pjhb76/why_are_boobs_attractive.json": "彼らは本来セクシーではなく、ただの脂肪の塊なのに、なぜ私はこんなにも好きなのか？\n好きになってしまったのか",
  "data/reddit-ask/r/NoStupidQuestions/comments/pjksbn/i_am_pregnant_and_my_boyfriend_and_his_mother_are.json": "彼がセックスのためだけに私と付き合っていたことは知っています。私は経験豊富で、彼は保守的な家庭で育ったので\n保守的な家庭で育ちました。母親は科学者で、父親はエンジニア。この\nこの人も原子力関係の仕事をしていて、とても尊敬されています。彼は26歳で\n彼は26歳で、すでに高給取りの仕事をしています。とにかくキャリアを重視していて・・・。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pjnrrw/is_it_wrong_that_ive_really_enjoyed_covid_lockdown.json": "たくさんのことができました。たくさんの本に目を通しましたし、積み残していたゲームにも追いつきました。\n積み残していたゲームや映画に追いつき、さらには自分で文章を書き始めました。\n\n経済的な意味合いについては十分に理解しています。私の友人の何人かは同じように苦労しています。\n私の友人の中にも苦労している人がいますが、尊敬の念を込めて彼らにこのようなことを言うつもりはありません。しかし、それは本当に...",
  "data/reddit-ask/r/AskHistorians/comments/pjo3r5/turkey_lost_15_of_its_population_in_wwi_and.json": "この画像が正しいかどうかはわかりませんが\n[https://1.bp.blogspot.com/-PzeAoM_nh8A/VgDQQkOgd7I/AAAAAAAAoHA/Uo_LOdwMJ2E/s1600/WW1.jpg]\nこの画像が正しいかどうかはわかりませんが、私の死傷者数の根拠となっているものです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pjra9e/how_can_i_ascertain_my_birth_place_to_get_a_birth.json": "最低でもカリフォルニアにあることは知っている。絞り込めるのは、おそらく\n100の病院に絞ることができますが、電話でこんなに時間をかけるより、もっと良い方法があると思います。\n何か良い方法はないものか。",
  "data/reddit-ask/r/askscience/comments/pjb87r/why_is_bacteria_phagotherapy_not_widely_used_to.json": "家族が超難治性のバクテリアに何ヶ月も悩まされていて\n唯一の解決策（羽毛布団療法）はどこにもないようです。",
  "data/reddit-ask/r/AskHistorians/comments/pjlxv3/did_alexander_the_great_actually_face_defeat_or.json": "最近では、多くの人が「無理だ」と言ったり書いたりしています。\nアフガニスタンです。ソビエトやイギリス、そしてアレキサンダー大王を見てみろ」と。それは\n私の理解では、アレクサンダーはアケメネス朝を3つの戦いで破っています。\nグラニカス、イッソス、ガウガマラです。これらの戦いが行われたのは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pjth6e/is_my_boyfriend_gay_or_is_something_else_wrong.json": "F27と彼氏のM30。付き合って8年ほどになりますが、3年ほど前からセックスレスになりました。\n3年ほど前からセックスをしなくなりました。私たちはお互いにマスターベーションをするだけです。通常は、私が彼に頭を与え\n私が彼に頭を差し出し、彼が私がイクまで指を入れてくれます。彼は、もうセックスを楽しめないと言っています。\n彼はもうセックスを楽しめないと言っていますが、それは痛いからです。彼が挿入しようとすると...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pjrg5j/my_boyfriend_wants_to_break_up_because_i_am_not.json": "私は大学を卒業していないので（準学士号は持っています）、本物の情熱を持っていません。\n情熱を持って、旅をしたり、ウェイトレスやその他の仕事をしたのは24歳のとき。\n歳.... 彼は、私が趣味を持っているだけで、物事についてあまり知らないと言います。例えば、私は\n子供の頃は馬に乗って育ったけど、今はただ...。",
  "data/reddit-ask/r/AskHistorians/comments/pjup0w/single_lifewanting_to_be_alone_in_the_middle_ages.json": "以前から気になっていたのですが、中世のシングルライフはどうだったのでしょうか？\n独身男性や独身女性は一人で生活していたのでしょうか？\nまた、中世の人々がどれだけ一人でいられたかという観点からも、この質問をしています。\nまた、中世の人々がどれだけ一人でいられたかという点からもこの質問をしています。\n私の先生は、貧しい人々は一人ではいられず、混雑した家に住まなければならなかったと言っていました。\nと言っていました。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pk1z89/nsfw_do_guys_prefer_sloppy_blowjobs.json": "こんなことを聞くのは馬鹿げていると思う。私はいつも清潔で、過飽和でもなく、大きな音でもない、うるさいくらいのフェラチオをしてきました。\n騒がしいフェラチオはしません。文句を言われたことはありませんが、グループでの会話の中で、男の人は飽和状態が好きだということが出てきました。\n男の人は飽和状態が好きで、変な湿った音やぐちゃぐちゃした感じが好きだという話になりました。それは\n本当にそうなのでしょうか？TMIで申し訳ありませんが、私はただ好奇心旺盛で少し不安なのです...。",
  "data/reddit-ask/r/AskHistorians/comments/pjr8fe/where_black_americans_ever_employed_as_spies_in.json": "TYPO: Where*ではなくWere",
  "data/reddit-ask/r/AskHistorians/comments/pk33oh/was_the_spanish_flu_ever_as_politicized_and.json": "当時、人々はマスクをして社会的な距離をとっていたのでしょうか？議論したり、いがみ合ったりしていたのでしょうか\nマスクをすることを拒否していたのでしょうか？公共の場では緊張感があり、covidの最初の頃のようにオープンキャリーをしていたのでしょうか？\n公衆の面前では緊張感があったのでしょうか？大統領はマスク着用を推奨していたのか？",
  "data/reddit-ask/r/AskHistorians/comments/pk6390/what_are_the_cultural_and_theological.json": "イエスはユダヤ人でしたが、彼が始めた運動は全く別のものになりました。\nムハンマドも同じように「新しい」宗教を始めましたが、彼の「オリジナル」の宗教は何だったのでしょうか？\n宗教は？彼はユダヤ人だったのか？キリスト教だったのでしょうか？私の理解では、これらの宗教的伝統は\n私の理解では、これらの宗教は彼の周辺に存在していましたが、その関係ははっきりしませんでした。",
  "data/reddit-ask/r/AskHistorians/comments/pk686p/which_side_did_the_romans_walk_on.json": "イメージ\n[https://old.reddit.com/r/ArtefactPorn/comments/pjx20g/a_mosaic_that_says_bene_lava_wash_well_discovered/]\n最近、r/ArtefactPorn [/r/ArtefactPorn]に投稿された、アルジェリアのティムガッドにあるローマ時代（紀元1～2世紀）の浴場の入り口にあるモザイクの画像があります。\nアルジェリアのティムガッドにあるローマ時代（紀元1〜2世紀）の浴場の入り口にあるモザイクの画像[/rArtefactPorn]が最近投稿されました。この\nモザイクには2つのメッセージが描かれています...",
  "data/reddit-ask/r/AskWomen/comments/pk50bl/how_important_is_emotional_maturity_when_it_comes.json": "お金、似たような趣味、肉体的な魅力といったものと比べて、どのような順位にあるのでしょうか。\n理由は？",
  "data/reddit-ask/r/askscience/comments/pkb3vd/are_there_shortterm_longterm_and_working.json": "例：ADHDの人は、気が散ることで長期的な目標に挑戦することが多いのか、それとも日々の仕事にしか影響しないのか。\n気が散ることが原因で、長期的な目標に挑戦することが多くなるのか、それとも日常的な作業にしか影響しないのか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pk7r91/isnt_calling_all_races_and_ethnicities_that_arent.json": "私はBIPOCという言葉を使わない地域の出身なので（あるいは他の\n私はBIPOCという言葉を使わない地域の出身です。このような言葉はとても人種差別的に思えます。\n私にはとても差別的に見えます。白人以外のすべての人種を一緒にしているのです。\nそれらのグループは非常に異なっています。混血の子供である私にとって、それは...。",
  "data/reddit-ask/r/AskHistorians/comments/pk8brf/the_issue_of_collective_memory_of_the_spanish_flu.json": "私は、ペルー人の父とフランス系ドイツ人の母を持つ息子です。20世紀初頭の\n20世紀初頭、私のペルー人家族は、クスコ地方のアマゾン側の上層中産階級の土地所有者で、ドイツ人家族は、クスコ地方のビジネスマンでした。\n20世紀初頭、私のペルー人家族はクスコ地域のアマゾン側の中流階級の土地所有者で、私のドイツ人家族はフランクフルトのビジネスマンでした。\n私のドイツ人家族はフランクフルトのビジネスマンで、フランス人家族は農民と木工職人でした。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pk6esa/how_many_water_molecules_does_it_take_for_water.json": "1つの分子が固体にも液体にも気体にもなれないことは知っています。\n相を意味のあるものにするには何個の分子が必要なのか、この場合は液体です。",
  "data/reddit-ask/r/askphilosophy/comments/pkc0c3/in_1790_immanuel_kant_makes_the_famous_statement.json": "この解釈は何か間違っていますか？カントは違うことを言っていたのか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pkqo2e/every_time_i_encounter_some_disappointment_i_get.json": "心の中では、「自殺して、新しい人生を始めなさい。\nこの人生では何もできない」と心の中で言っているような気がします。心の中で殺されそうになります。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pkmrki/am_i_an_outoftoucholdguy_boss.json": "ご意見をお聞かせください。\n\n私(35m)は組織内で上級管理職に就いています。私の下にはいくつかのチームがあります。\n各チームには私の直属の部下であるチームリーダーがいます。\n私に直接報告します。私の最高のチーム（23歳から27歳までの8人）は、社内で他の女性と婚約しているレズビアンの方が管理しています。\nその人は社内で別の女性と婚約していて...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pkjlza/why_are_some_women_so_angry_about_men_leaving_the.json": "私は女性ですが、男性が便座を上げっぱなしにしていても気になりません。私は\n私はおしっこをする前に便座を下ろすことができます。また、トイレの後は必ず手を洗います。\nトイレの後は必ず手を洗いますから、「気持ち悪い」というのは、私にとっては馬鹿げた理由です。\nそれは私が5人家族の中で2人の女性の1人として育ったからかもしれません...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pkpsag/whats_the_appeal_of_sniffing_womens_panties.json": "私はこのクソ映画を見たことがありますが、Redditの動画では、クリープ・ガバメントの\n少女のパンティの匂いを嗅いでいた。\n小児性愛者を調査していました。それだけでも胸が悪くなります。\n\nしかし、そんなことをしたいとは想像もできません...どんな臭いがするんだろう？\n何の匂いがするんだろう？グーチとスワンプ...。",
  "data/reddit-ask/r/askscience/comments/pkk91l/are_there_long_term_effects_from_covid_in_fully.json": "長い間潜んでいて、初めて投稿し、このパンデミックで長い間負けています。\n\n私が覚えているのは、COVIDによる脳、心臓、肺への長期的なダメージの証拠を示す複数の論文が発表されたことです。\n症状が出ていなくても、COVIDによって脳や心臓、肺に長期的なダメージを受ける可能性があるという論文が複数発表されていました。\n複数の論文が発表されました。\n\n1）それはどの程度正確なのでしょうか？2)もしそうだとしたら、それは...",
  "data/reddit-ask/r/AskHistorians/comments/pkp5ox/men_going_down_on_women_in_ancient_rome.json": "古代ローマの男性はプッシーを食べていた？私の家では熱い議論が交わされています。SOS",
  "data/reddit-ask/r/AskHistorians/comments/pkwho9/ama_im_garrett_ryan_author_of_naked_statues_fat.json": "皆さん、こんにちは。私はギャレット・ライアン博士、別名u/toldinstone [/u/toldinstone]です。私はローマの歴史家です。\nローマの歴史家で、最近、初めての人気本を出版しました。裸の彫像。\n裸の像、太った剣闘士、そして戦象」です。古代ギリシャ・ローマ人についてのよくある質問\nギリシャ人とローマ人についてのよくある質問 [https://amzn.to/2WSMAgF]です。一連の...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pkttt5/why_do_americans_think_free_speech_also_goes.json": "何か失礼なことを言っただけでサブスクから追放されたと訴える投稿をよく目にします。\n失礼なことを言ったり、物議を醸すようなことを言ったりしただけで その上、自由がないとわめき散らしています。\nこれはなぜでしょうか？",
  "data/reddit-ask/r/askscience/comments/pkvrdg/are_spiral_galaxies_on_their_last_leg_of_life.json": "皆さん、こんにちは。\n\nこれは、ブラックホールが大きくなって、すべての星iを引っ張っているような、銀河の人生の最終段階なのでしょうか？\nブラックホールが大きくなって、すべての星が銀河の中心に引き寄せられて、光の渦を作っているのです。\n光の渦を作っているのでしょうか？\n\nそうだとすると、円盤状やベルト状の形をしている銀河は、ブラックホールの力で...続きを読む\nブラックホールが十分な力を持っているからです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pkuxjq/just_like_homophobes_are_uncomfortable_with_same.json": "例として考えたのは、子供がロボットを持ち帰った場合です。ええ、言いましたよ。\n私はロボット恐怖症です。",
  "data/reddit-ask/r/askscience/comments/pkxwbd/is_the_flu_we_get_vaccinated_for_today_just_a.json": "インフルエンザウイルスは、基本的に毎年異なる株が存在することを知っています。\nだからこそ、毎年、新しいインフルエンザの予防接種が行われるのだと思います。これは、1918年の\nスペインのパンデミックの影響でしょうか？\n\n私は、Covidは多かれ少なかれ今後も存在すると考えています。\n年に一度の変種があるかもしれない...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pl0nvj/how_should_a_man_dress_for_a_first_date.json": "男性はどのようにして過不足なく服を着こなすことができるのでしょうか？\nどうすればいいのでしょうか？きちんとした第一印象を与えるための一線はどこにあるのか？\nのか？あなたが男性に求めるファッションやスタイルを教えてください。\n初対面の男性に求めるファッションやスタイルについて教えてください。",
  "data/reddit-ask/r/askscience/comments/pl03tq/is_the_lifearc_of_a_star_determined_100_by_its.json": "星には様々な種類と大きさ（赤色巨星、青色矮星など）があり、星は複数の形態をとることができると理解しています。\n矮星など）があり、星は年齢や燃料の組成の変化に伴って、さまざまな「形」になることは理解しています。\n燃料の組成が変わると、星は複数の「形」になることを理解している。\n\n星の質量が、その星の重要な属性の多くを決定することは理解していますが、星の質量はどのようなものでしょうか？\n星の寿命やその他の...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pl4lrt/asking_women_how_do_you_feel_about_men_with.json": "トリミングが良いかもしれません。皆さんのご意見をお聞かせください。",
  "data/reddit-ask/r/askscience/comments/pl39tu/hospital_staff_have_always_been_very_careful_but.json": "病院での治療の費用対効果を検討する際には、感染症のリスクを考慮する必要があります。\n感染症のリスク、さらには特に耐性のあるバクテリアの感染のリスクもあります。\nその上、特に耐性菌の感染リスクもあります。コヴィドへの警戒心が高まるにつれて、他の種類の感染症の数が減少しているのでしょうか？\nCovidへの警戒が強まると、他の感染症の数は減っていくのでしょうか。",
  "data/reddit-ask/r/AskHistorians/comments/pl2oil/grandpas_mystery_wwii_destination_per_secret.json": "私の祖父は101歳以上で亡くなりましたが、その答えは見つかりませんでした。\n祖父は101歳で亡くなりましたが、「1609-Aという秘密の目的地は何だったのか」という単純な疑問の答えを見つけることはできませんでした。\n\n祖父が残した自叙伝には、軍人時代の素晴らしい体験談がたくさん載っています。\n彼は自伝を残していますが、そこには戦闘機のパイロットや砲術士として軍隊にいた頃の素晴らしい体験談がたくさん書かれています...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pl26zp/am_i_asexual_if_i_could_take_it_or_leave_it.json": "基本的には、数年前からセックスをしておらず、追求していないだけです。I\n定期的にオナニーをしていますが、恋愛に力を入れる気はありません。\n一晩だけの関係や浮気も魅力的なコンセプトではありません。時々、私は\n寂しくなることもありますが、それは一瞬のことで、今は独立した生活を楽しんでいます・・・。",
  "data/reddit-ask/r/AskHistorians/comments/pl6drg/is_moving_out_at_18_an_artifact_of_world_war_ii.json": "ある人が、タイやパキスタンの子供たちのソーシャルメディアへの投稿を紹介してくれました。\nアメリカの大学院に進学する際に求められる自立心に戸惑っているタイやパキスタンの子供たちの投稿を紹介しました。\nなぜなら、彼らの文化では、成人してから結婚するまでの間、家に住み、家事を手伝うのが普通だからです。\n彼らの文化では、成人してから結婚するまでの間、家に住んで手伝いをするのが普通です」。\n\n私が興味を持ったのは...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pl6s0x/why_do_so_many_movies_and_tv_shows_have_volume.json": "編集部：私が探していた答えは、おそらく「ボリューム・レベリング」でした。私はこれをオンにして\nテレビのオーディオオプションでオンにしたところ、音声がかなり均一なレベルで来るようになり\n自分ではあまり調整しないようにしています。\n\nもしかしたら、ダイナミックレンジ圧縮も同じようなものなのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pkuurw/does_the_feeling_of_still_being_a_teenager_ever.json": "私は20歳ですが、特に精神的にはまだ16歳のような気がします。\n目を閉じると40歳になっているような、年をとることへの絶望感があります。I\n同年代の人たちを見てショックを受けています。\n同年代の人たちが実際に大人のように見え、行動しているのを見てショックを受けます。時々、私は忘れてしまいます。",
  "data/reddit-ask/r/AskWomen/comments/pl1kc2/what_is_something_you_have_contradicting_or_mixed.json": "自分の中で矛盾していたり、混同していたりすることは何ですか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pla0gr/do_boys_not_get_touched_often.json": "私は16Fに16Mの彼がいますが、彼はとてもキュートで、私が気にしているわけではありません。\nある日、私は彼にそれを指摘します。彼は私を愛しているからだと言いました。\nそして、彼が本当に触れるのは私だけなんです。\n\n私は「えっ」と思いましたが、彼は「他には考えられない」と言いました。\n他の人は考えられないって...",
  "data/reddit-ask/r/AskHistorians/comments/pldkd4/what_happened_to_the_23trillion_rumsfeld.json": "https://www.c-span.org/video/?165947-1/defense-business-practices\nhttps://www.c-span.org/video/?c4683428/user-clip-23-trillion",
  "data/reddit-ask/r/askscience/comments/plhmur/why_shouldnt_you_get_the_covid19_vaccine_if_you.json": "少し調べてみましたが、一番近い答えは、「ある人は軽い症状が出る」というものでした。\n予防接種を受けた後、特に2回目の予防接種を受けた後に、軽度から重度の風邪やインフルエンザのような症状が出る人がいることから\n特に2回目のワクチン接種後に軽度から重度の風邪やインフルエンザのような症状が出る人がいることから、もしワクチンを接種してすでに体調が悪い場合は\nこのような場合には、ワクチンを接種した後、すでに体調が悪い場合には、さらに症状が悪化する可能性が高いということです。",
  "data/reddit-ask/r/TrueAskReddit/comments/pl0woa/rather_than_having_one_federally_mandated_minimum.json": " * Living Wage Calculator [https://livingwage.mit.edu/]\n * 多くの人々は、連邦政府が義務付ける単一の最低賃金は機能しないと言います。\n   アメリカでは生活費が異なるため、連邦政府が強制する単一の最低賃金は機能しないと多くの人が言っています。\n * それを考慮した上で、各州の最低賃金は......という法律があってもいいと思いますか？\n   州の最低賃金は...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pl9xn6/why_are_people_mean_online.json": "いつも思うのですが、「誰と話しているかわからない」ということです。子供なのか、言葉や理解力に障害のある人なのか\n子供なのか、言葉や理解力に障害のある人なのか、脆弱な場所にいる人なのか、誤解を招くような全く異なる背景を持つ人なのか。\n誤解を招くような全く異なる背景を持つ人なのか？そして、たとえ\nそうでなかったとしても、私は誰かが...。",
  "data/reddit-ask/r/AskHistorians/comments/pl4mm0/did_store_clerks_really_have_the_authority_to_cut.json": "これを覚えている年配の方にランダムに質問します。よくあること\n2000年代半ば以前の映画やテレビでよく見られたのが、クレジットカードを使うと\nクレジットカードが使えなくなると、カードが破棄されるというものでした。スーパーの店員さんが\n店員さんが大きなハサミを取り出して、カードを真っ二つに切ります。....",
  "data/reddit-ask/r/TooAfraidToAsk/comments/plin0j/how_much_is_to_much_masturbating.json": "普段は2～3日に1回はオナニーをしていますが、それでも多いと感じます。\nいつになったらオナニーのしすぎになるのでしょうか？",
  "data/reddit-ask/r/AskWomen/comments/pleuej/what_are_your_random_items_that_make_you_feel.json": "白い靴下を履いて暗い色のズボンを履くと、白い足の猫を連想して可愛いからです。\n白い足の猫を思い出すからです。",
  "data/reddit-ask/r/AskHistorians/comments/plk9yc/as_a_formerly_clueless_united_states_citizen_how.json": "親しい友人は、旅のグループで育ちましたが、子供の頃にアメリカに送られたことがあります。\n90年代に子供としてアメリカに送られました。最近、彼女の一族が分裂することになったとき、何が決め手になったのか聞いてみました。\n私は最近、彼女の一族が分裂したときの決め手は何だったのかと尋ねたところ、その後の展開に心を痛めていました。私が彼女に尋ねたのは\n私が彼女に尋ねたのは、情報を見つけるのにとても苦労しているからです...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/plmdc4/do_you_support_the_latest_vaccine_mandates.json": "私はそれを支持します",
  "data/reddit-ask/r/TooAfraidToAsk/comments/plol51/why_is_it_so_difficult_to_find_condoms_in_smaller.json": "私の結婚式の野菜は平均より小さいです。それは少しも気になりません。\n今のところ苦情を受けたことはありませんが、スーパーや薬局で買う一般的なコンドームは\nスーパーマーケットや薬局で買う一般的なコンドームでは、性交が少し気まずくなってしまうのです。\nバットマンがマントを失くさないようにしないと...。",
  "data/reddit-ask/r/askphilosophy/comments/plamrk/what_if_persons_seen_as_mentally_ill_are_in_fact.json": "心の健康は、大多数の人が「どうであるか」で決まるからです。しかし、もし\n精神的に病んでいる少数派の人が、現実を体験している人だとしたら？",
  "data/reddit-ask/r/askscience/comments/plpkdh/wikipedia_states_the_human_nose_is_extremely.json": "北カリフォルニアでは昨夜、今年に入って初めての雨が降りました。\n誰もが雨の匂いが好きだと話しています。\n今は雨の匂いが好きだと話しています。",
  "data/reddit-ask/r/NoStupidQuestions/comments/plsc2e/what_is_the_point_in_hiding_nipples_when_the_most.json": "これはよくあることで、私には理解できませんが、バストはおよそ見えています。\n胸はだいたい見えていて、ほんの一部分だけが見えていないのですが、その部分は本当に重要なのでしょうか？",
  "data/reddit-ask/r/askscience/comments/plq6ib/are_there_any_biological_differences_between_male.json": "気になったのは、男性の髪の毛は女性の髪の毛とはメイクが違うのか？もし、DNAレベルで\n髪の毛をDNAレベルで見た場合、その髪の毛の出身者の性別を特定することができるのでしょうか？\n識別できるのでしょうか？\n\nなぜこのような質問をしたかというと、一般的に女性は長い髪型をしていて、男性は短い髪型をしています。\n一般的に女性は長い髪型で、男性は短い髪型です。これは100％文化的なものなのでしょうか...。",
  "data/reddit-ask/r/AskHistorians/comments/plnix1/is_there_a_reason_the_nazi_and_soviet_ministries.json": "厳密には、啓蒙・宣伝省と煽り・プロパガンダ省の2つがあります。\n技術的には「啓蒙・宣伝省」と「扇動・プロパガンダ省」ですが、ふと思ったのです。\nほとんどのディストピア・フィクションや現実世界の権威主義国家では、プロパガンダを担当する部署の名前は、もう少しベールに包まれています。\nしかし、ふと思ったのですが、多くのディストピア・フィクションや現実世界の権威主義国家では、プロパガンダを専門とする部署の名前は、もう少しベールに包まれています。",
  "data/reddit-ask/r/AskWomen/comments/pltff3/childfree_women_how_do_you_handle_it_when_a_close.json": "具体的には、子どもを持つことでライフスタイルや価値観が変化する中で\nどうやって調整するのか？",
  "data/reddit-ask/r/AskHistorians/comments/plsibx/surely_the_earl_of_sandwich_wasnt_the_first_guy.json": "サンドウィッチ伯爵は、食事をパンの間に挟むことを思いついたという話があります。\nサンドイッチ伯爵は、トランプをしながらでも食事ができるようにと、パンの間に食事を挟むことを思いついたそうです。しかし\n人間は何千年も前からパンを食べていたわけですから、他にもそういう人がいたのではないかと思います。\n人間は何千年も前からパンを食べていたのだから、他にもパンを食べた人がいたはずだと思うのですが...。",
  "data/reddit-ask/r/AskWomen/comments/pllhtp/whats_your_relationship_with_porn.json": "あなたはどのくらいの頻度でそれに耽溺し、そのためにセックスライフに問題が生じたことはありますか？\nそれが原因でセックスライフに問題が生じたことはありますか？同様に、その習慣が健康的/正常であるかどうかについて考えたことはありますか？\n健康的であるかどうかを考えたことはありますか？この業界は主に男性をターゲットにしているので、あなたの意見を聞きたいと思っています。\n業界は主に男性を対象としているので、皆さんの意見に興味があります。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/plme7k/why_is_there_no_whisper_mark.json": "エクスクラメーションマークとクエスチョンマークがあります。ウィスパーマークはクールです。\n人にメッセージを送るときには、より正確に\n話すときや特定の言葉を言うときの私の口調を表します。",
  "data/reddit-ask/r/AskHistorians/comments/plzb25/megathread_a_brief_history_of_september_11th_2001.json": "20年ルールのロールオーバーは年初に行われるので、その時に投稿しました。\nその時に\n[https://www.reddit.com/r/AskHistorians/comments/kocf1z/meta_an_historical_overview_of_911_as_the_20_year/]をご覧ください。\nしかし、このイベントの重要性と、それに伴う悪い歴史のために、再投稿しました。\nしかし、このイベントの重要性と、それに伴う悪い歴史のために、私たちは再投稿しました...",
  "data/reddit-ask/r/AskHistorians/comments/plkzhs/by_the_time_of_cleopatra_most_egyptian_pyramids.json": "その構造や目的に関する知識は、ほとんど保存されていたのでしょうか、それとも多くが失われてしまったのでしょうか。\nそれとも、時間の経過とともに失われてしまったのでしょうか？重要な文化遺産とされていたのか、奇妙な\n重要な文化遺産とされていたのか、奇妙な珍品とされていたのか、あまり注目されていなかったのか、などなど。\n\nところで、クレオパトラを引き合いに出したのは、質問を単にクレオパトラに限定するためではありません。\n単に彼女に限った質問ではありませんが...。",
  "data/reddit-ask/r/AskWomen/comments/pm39as/what_are_the_advantages_to_having_small_boobs.json": "うつ伏せになりやすいとは言わないが、巨乳でも支障はないと思われる。\n妨げにはなりません。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pmamas/why_do_the_2977_people_who_died_in_911_matter.json": "民間人の死は本当に悲劇だと思います。しかし、なぜ\nアメリカ人やメディアが、これらの死に注目し、重要視するのは\n他の人たちにはほとんど関心がないのです。",
  "data/reddit-ask/r/askscience/comments/pm9jpe/how_effective_is_the_vaccine_against_each_of_the.json": "具体的には、OGウイルスと南アフリカ版、イギリス版、デルタ版との比較です。\n南アフリカ、イギリス、デルタの各ウイルスとの比較です。\nワクチンの効果に違いはありますか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pma1ut/why_are_events_like_911_or_pearl_harbor.json": "アメリカがこれらの出来事をテロ攻撃と呼ぶのは理解できますが、私の長年のアメリカの公教育や社会生活では一度も\n私は、アメリカの公教育や普通の社会で、アメリカの行動をテロと呼ぶのを聞いたことがありません。\n誰かがアメリカの行動をテロリズムと呼ぶのを聞いたことはない。これらの行動によって、多くの罪のない人々の命が奪われています。\nこれらの行動によって、多くの罪のない人々の命が奪われました。原爆を投下するように...。",
  "data/reddit-ask/r/AskHistorians/comments/pm3pg8/is_it_common_for_historians_to_refer_to.json": "オスマン帝国の住人はオスマン帝国をそう呼んでいたのか？中世のドイツ人は\n中世のドイツ人は、自分たちを「神聖ローマ帝国」の一部と考えていたのでしょうか？中国の各王朝はどうでしょうか？\n中国の各王朝は？",
  "data/reddit-ask/r/askscience/comments/pmehd2/why_did_it_take_16_hours_for_the_first_message_to.json": "私が読んだ本によると、信号が渡るのに16時間かかったそうです。\n電気が時速200マイル以下に減速することは可能なのでしょうか？\n時速200マイル以下に減速できるのか？帰りはなぜ1時間しかかからなかったのか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pm6st3/is_not_feeling_emotions_something_that_normally.json": "私が子供の頃は、日常の何気ないことでも、自分の行動や経験が何かしらの感情を呼び起こしていたのを覚えています。\n日常の何気ないことでも、何かしらの感情が湧き上がってきたものです。それは\nうまく言えませんが、例えば、外を散歩していると、鳥のさえずりや、顔に当たる風や\n小鳥のさえずり、顔に当たる風、花の香り...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pmegbj/to_people_who_got_circumsized_late_whats_the_the.json": "私は早くから割礼を受けているので、包茎の感覚がわかりません。\n今まで聞いた話では、包茎をしたことがない人や、私のように包茎の記憶がない人から、仮説的な違いを聞いただけでした。\nこれまでに聞いたのは、包茎にしたことがない人や、私のように包茎だったことを覚えていない人の仮説的な違いだけです。\nこれまでに聞いたことがあるのは、包茎をしたことがない人や、私のように包茎だった記憶がない人の仮説的な違いだけです。実際に経験した人に聞いてみたいと思います。",
  "data/reddit-ask/r/AskHistorians/comments/pmet3z/why_did_opium_cause_so_many_problems_in_china_but.json": "私の知る限りでは、イギリスなどでもアヘンが売買されていました。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pmjgfx/is_there_any_way_to_stop_my_abusive_mother.json": "私の母はひどい虐待を受けていて、6年ほど前に私を捨てたにもかかわらず、いまだに私を扶養家族として税金を請求しています。\n6年ほど前に私を追い出したにもかかわらず、まだ私を扶養家族として税金を請求しています。私は小心者なので、どんなことがあっても母を助けたくはありません。\n可能な限り助けたくありません。以下のような方法はありませんか？\n\nA) 彼女が私を扶養家族として請求するのを止める。\n\nB)もっと良い方法は、彼女を詐欺罪で捕まえることです。I...",
  "data/reddit-ask/r/AskHistorians/comments/pmjrdg/is_there_evidence_for_the_cobra_effect_story.json": "r/history [/r/history]で、u/jehoshua42 [/u/jehoshua42]さんが、以下のような質問をしました。\n問題を解決しようとすると、かえって問題を悪化させてしまう例について。\n\n私の頭に浮かんだ例は、（例えばQIなどで）よく語られる話です。\n英国統治時代にコブラに懸賞金をかけたところ、そのコブラが...」という話です。",
  "data/reddit-ask/r/AskHistorians/comments/pmkshi/a_common_question_on_this_sub_asks_who_was.json": "明らかにこの3つは、彼らが残した遺産の最良の部分よりもはるかに複雑なものです。\nしかし、彼らが支持したのは、無私、自由、平等、非暴力でした。\n20世紀初頭までにそのような理想を体現していたのは誰でしょうか？イエス？アシジの聖フランシス\nof Assisi？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pmmkm5/do_fat_people_starve_slower.json": "人によっては非常に不快な質問であることは承知していますが、悪気はありません。それよりも\n人体への疑問です。通常は7日間の無食ですが、その間に脂肪の量は変化するのでしょうか？\n脂肪の量は変化するのでしょうか？例えば、以下のような場合です。体重700ポンドの人が、筋肉210、体脂肪10%の場合\nと普通の体210では 大きな違いがあるのか、それとも死が訪れるのか...。",
  "data/reddit-ask/r/AskHistorians/comments/pmdhn4/why_is_the_roman_empire_after_212_ad_not_regarded.json": "ナショナリズムは非常に近代的な概念であるとよく言われます。\nよく、ナショナリズムはフランス革命の直前にフランスで生まれた非常に近代的な概念だと言われます。しかし、ローマ時代の市民権概念\n市民権、ロマニタス（「ローマ人らしさ」）、そして特にローマ文明を受け入れれば誰でも\nローマの文明を受け入れれば、誰でもローマ人になれるという考え方は、ひどく...。",
  "data/reddit-ask/r/AskHistorians/comments/pmluaw/how_serious_was_the_talibans_offer_to_hand_over.json": "2001年10月、タリバンは、アメリカがOBLに証拠を与えれば、OBLを引き渡すと申し出た。\n証拠を提示した。明らかにそれは実現しませんでしたが、その理由については興味があります。\n\nhttps://www.theguardian.com/world/2001/oct/14/afghanistan.terrorism5",
  "data/reddit-ask/r/NoStupidQuestions/comments/pmnt35/how_do_i_become_less_stupid.json": "私の両親は私をホームスクールに通わせていました。ホームスクールとは、英語を教えてくれて、インターネットをさせてくれるということです。\nその結果、私は頭が悪く、それを直したいと思っています。\nそれを直したいと思っています。",
  "data/reddit-ask/r/askphilosophy/comments/pm5ys3/peter_singer_and_capitalism.json": "様々な問題に対するシンガーのアプローチについて質問があります。例えば、以下のようなものです。\n慈善団体への寄付や菜食主義などです。功利主義者であるシンガーは、最も多くの選好を満足させ、より多くの喜びや痛みをもたらす\n最も多くの選好を満足させ、より多くの喜びと痛みをもたらす結果を促進することを目指しています。\nしかし、なぜシンガーが個人の行動を重視するのか、私にはわかりません。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pm8lfi/how_do_you_handle_constantly_being_disappointed.json": "この世のすべてのものが私を失望させているように感じます。人々。物事。\n明日世界が終わっても構わない。世界がゴミになるような気がして\n私は世界がゴミになるような気がして、どうやってこの頭の中を整理したらいいのかわかりません。",
  "data/reddit-ask/r/AskHistorians/comments/pmd58i/why_did_people_from_nepal_not_climb_mount_everest.json": "先日、ネパール人クライマーの本を読んでいたら、欧米人よりもネパール人クライマーの方が\nこの間、ネパール人クライマーの本を読んでいたら、ヨーロッパ人やアメリカ人よりもネパール人クライマーのクライミングを推進していると書いてあった。もちろん\nもちろん、20世紀にヨーロッパ人をエベレストに案内したシェルパのことは知っています。\nしかし、シェルパがいなくなる前にエベレストに登ろうとしたネパール人はいたのだろうか？",
  "data/reddit-ask/r/AskHistorians/comments/pmdx4g/when_did_it_become_common_for_american_women_to.json": "先日、私の母（1948年生まれ）が不思議なことを言った。母は\n子供の頃、耳のピアスはあまり一般的ではなかったと言いました。\n\n彼女はミネアポリスで育ちましたが、彼女によると、耳にピアスをしている女性はラテン系だけだったそうです。\n耳にピアスをしているのはラテン系の女性だけだったそうです。\n\n彼女が耳にピアスをしたのは、大学に入ってからでした。",
  "data/reddit-ask/r/AskHistorians/comments/pmt11j/at_he_time_of_its_publication_1924_was_the_twist.json": "ネタバレになりますが、なぜそれが問題にならないかを一瞬述べます。\n\n\"The Most dangerous Game \"は、リチャード・コーネルの短編小説で、大きな白人ハンターのサンガー・レインズフォードが、プライベートな島の海岸に流れ着く。\n猟師のサンガー・レインズフォードは、ボート事故で私有地の島に流れ着き、島の所有者ザロフ将軍と出会う。\n島の所有者であるザロフ将軍と出会う。将軍は...。",
  "data/reddit-ask/r/AskHistorians/comments/pml1zl/did_any_prominent_exnazis_become_involved_in.json": "私は、旧ドイツ国防軍の将軍たちが「クリーンなドイツ国防軍」という神話を支持したり、ナチスの将校たちが「クリーンなドイツ国防軍」を否定した事例をたくさん知っています。\nまた、ナチスの将校がホロコーストについての個人的な知識や関与を否定しているケースもあります。\nしかし、著名なナチスはいただろうか？しかし、著名なナチス（例えば、階級的にはかなり上に位置する将校）はいたのだろうか？\nしかし、著名なナチス（例えば、下っ端よりもはるかに上に位置する将校や、政治的に影響力のある人々...）はいたのだろうか？",
  "data/reddit-ask/r/AskHistorians/comments/pmuyso/we_hear_that_mohawk_ironworkers_built_new_york.json": "モヒカン族の鉄工所がニューヨークの高層ビルの多くを手がけたのは、彼らが高所恐怖症ではないからだという話を何度も目にしました。\nモホーク族は高所恐怖症ではないので、ニューヨークの超高層ビルの工事を担当したという話をよく聞きます。それは本当なのか？\nそれは本当なのか、そしてその考えはどこから来たのか。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pmx7ob/why_on_earth_did_chris_browns_career_not_die.json": "彼がまだ音楽を作っていることは、実際に私にとっては嫌なことなのです。彼には何か\n彼の身に何か起こったのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/pmu2ft/recommendation_whats_the_contemporary_equivalent.json": "Hi Historians!\n\n私の姪は歴史の勉強にとても興味を持ち始めていて、私は昔GG&Sを読んだことを懐かしく思い出しました。\n昔、GG&Sを読んで、歴史上の出来事のシステム的要因についての新しい考え方を得たことを懐かしく思い出しました。\n私は昔、G&Sを読んで、歴史上の出来事におけるシステム的要因についての新しい考え方を得たことを覚えています。\n\nG&Sを購入して読んでもらおうと思いますが...。現代の歴史学者は\nもしかしたら・・・。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pmtwzp/does_anyone_else_also_feel_like_the_online_world.json": "すべてが標準化され始めているのを見ると、ちょっと悲しくなります。\nすべてが標準化され、融合し始めているのを見ると、ちょっと悲しくなりますね。これはなぜだと思いますか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pn1guk/is_there_any_way_i_can_hide_the_reddit_live_thing.json": "私はあなたの楽器の腕前など知ったことではありません。楽器を持っているのはいつもクソ女\n楽器を持っている",
  "data/reddit-ask/r/AskHistorians/comments/pmrgwv/in_both_sweden_and_denmark_standarized_language.json": "ノルウェーでは方言が主要なコミュニケーション手段であり、Bokmalはほとんど使われません。\n私の記憶では、二人のノルウェー人がお互いに理解できない場合でも、Bokmalよりも英語を使うことが多いようです。\nボックマル語よりも英語を使うことが多いようです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pmx9c7/when_wiping_after_taking_a_shit_do_you_just_wipe.json": "何度も拭いて、指を数ミリ押し込んで、きれいにする。\nミリメートル。ほんの少しだけ、私の穴に。あなたもそうしていますか？\nそれともディープクリーンをしますか？\n\nある時、学校で2層式のトイレットペーパーを使っていたのですが、下痢をしてしまい、トイレットペーパーが浸みてしまいました。\nトイレットペーパーが浸みてきて、押して...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pn3j5q/help_how_do_i_begin_to_address_a_very_sudden_and.json": "今朝、世界の頂点に立っているような気分で目覚めた。\n\n起きて、庭仕事をして、近所の人が家の改修工事をするのを手伝って\nプロジェクトを手伝った。\n\n3時間後に戻ってきた。いつものように犬に挨拶すると、彼女はとても興奮していた。\n私を見てとても興奮していました。彼女はいつもベッドの上で寝ているが、年をとったものだ。\n\n私は...",
  "data/reddit-ask/r/AskHistorians/comments/pn712a/wikipedias_article_on_us_civil_war_prison_camps.json": "写真はこのページの一番上にあります。\nhttps://en.wikipedia.org/wiki/American_Civil_War_prison_camps\n\n私が興味を持ったのは、彼が本当に回復できるような状態ではないように思えたからです。\nこの状態では動くことすらできないのではないかと思ったからです。\nしかし、キャプションによると、彼はまだ「かろうじて生きている」と主張しています...",
  "data/reddit-ask/r/AskHistorians/comments/pn8d58/what_happened_after_they_took_the_cocaine_out_of.json": "つまり、何か公衆衛生上の問題があったのではないかということです。何らかの\n人口の何割かが禁酒していたのか？もしそうなら、それはどのように処理されたのか？\nどのように対処したのか。少し調べてみたところ、ソーダにコカインが入っていたことや\n炭酸飲料にコカインが入っていたことや、なぜそれをやめたのかなどの情報はすぐに見つかりました。",
  "data/reddit-ask/r/AskHistorians/comments/pn5xcy/its_1875_king_ludwig_ii_and_by_extension_all_of.json": "私は難聴者ですが、最近ブロードウェイのショーを見に行きました。劇場では\n劇場からヘッドフォンをもらったので、歌手の声をもっと大きな音量で聞くことができました。\n実際に歌詞を理解し、ショーを楽しむことができました。\n聴覚障害者の生活について考えさせられました...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pn8nji/is_it_a_dumb_idea_to_wear_a_ring_to_deter_older.json": "仕事をしていても、人前で仕事をしていても、私は常に\n少なくとも私の2倍以上の年齢の男性から常に注目されています。\nそして、いつも私を口説いたり、デートに誘ったりしようとするのです。それは嫌なことで\n本当に不安になります。彼らの多くは私をフェチにしています（その多くは...）。",
  "data/reddit-ask/r/AskWomen/comments/pmvhym/how_do_you_respond_to_someone_who_says_youre_too.json": "このようなことがよくあるのは私だけではないと思いますが、世の中の女性はこのようなことにどのように反応するのでしょうか？\n女性はどのように反応するのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pncyir/do_people_actually_100_trust_their_so.json": "EDIT3です。驚きましたね。人々はパートナーを100％信頼しているようです。\nパートナーを100％信頼しているようです。私をダウンボットするのはやめてください。私はあなたの聖なる理念を攻撃するつもりはありませんでした。\n批判したわけではありません。ただ、私の中でどうしても理解できないことを質問しただけです。\n疑問に思っただけです。気分を害する必要はありません。",
  "data/reddit-ask/r/AskHistorians/comments/pn86l4/the_meaning_of_one_of_the_words_in_the_lords.json": "ウィキペディア[https://en.wikipedia.org/wiki/Epiousios]によると、St Jeromeが\n西暦382年に主の祈りの中でこの言葉の意味を特定するのに苦労したと報告しています。\n福音書の中でも最もよく知られている部分の一つにある単語の意味が、数人の人間にとってこれほどまでに謎であったとは、私には驚きです。\n福音書の中でも最もよく知られている部分の一つであるこの単語の意味が、数年前にはこのような謎になっていたとは驚きです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pndr6n/why_doesnt_modern_society_run_on_a_24_hour.json": "私は大人になってからずっと夜勤（ミッドとスイング）をしてきました。たまには\n会議に出席するため、あるいはその他のランダムな理由で、数日間、日勤になることがあります。\nランダムな理由で。そのような時は、仕事以外でも慌ただしく過ごしています。通勤時間は\n通勤時間が渋滞で30分以上長くなったり、ランチを食べたり...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pnhk39/i_just_came_out_of_a_1hr_work_meeting_and_didnt.json": "新しいプロジェクトに参加したところ、プロジェクトマネージャーからミーティングに参加するように言われました。\n依頼されました。\n\n私は新入社員でまだ手探りの状態なので、見学するだけでした。\n\n議論したい内容や大まかなテーマは理解していましたが\nなぜか肝心なことは何もわからない...。",
  "data/reddit-ask/r/askscience/comments/pnfj82/are_there_any_elements_in_the_earths_crust_which.json": "地球に似ている惑星の種類について言えば、例えば金が多いか少ないか。\n地球に似た惑星の種類について、例えば金の量は、現在の惑星の形成モデルでは、本来あるべき量よりも多いのでしょうか、少ないのでしょうか？\n惑星の形成方法に関する現在のモデルによると、例えば金が多いのか少ないのか？\n\n****、ある鉱物や元素の埋蔵量が異常に多い惑星が存在する可能性はありますか？\nある鉱物や元素の埋蔵量が異常に多い惑星はあるでしょうか？私が知っているのは...",
  "data/reddit-ask/r/askscience/comments/pnf6z8/why_is_sugar_sticky.json": "台所のテーブルに糖分を含んだ液体の水たまりを落としたとします。\nそれがあなたの手にくっついたとします。なぜベタベタするのか？水和した砂糖はなぜベタベタするのか？",
  "data/reddit-ask/r/askscience/comments/pni9wg/is_the_age_of_the_universe_a_matter_of_perspective.json": "宇宙は138億年と言われていますが、それは耳の重力から見たものではありません。\nそれは地球の重力から見た場合です。例えば、ブラックホールの周りの惑星で生命が生存していたら\nブラックホールの周りの惑星で生命が生存できるとしたら、宇宙の年齢の視点はもっと古いものになるのでしょうか？\nもっと古くなるのでは？私は、ビッグバンが一度だけ起こり、その時点では...",
  "data/reddit-ask/r/AskHistorians/comments/pneyle/how_were_the_european_powers_and_especially.json": "9年戦争はヨーロッパの経済を疲弊させ、特にフランスの経済を疲弊させました。\nフランスの経済は疲弊していた。その5年後に、なぜ11年もの長期にわたる大戦争ができたのでしょうか？\nのか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pnjpvy/i_fell_for_that_dumb_instagram_sugar_daddy_scam.json": "私（19F）はその愚かなシュガーダディの詐欺に引っかかりました。もっとよく知っておくべきだったのですが\n妙な理由で赤旗を無視してそのまま入ってしまいました。お金に目がくらんだのか\nお金に目がくらんでしまったのかな。皆さんが私のことを馬鹿だと言ってくれても全然構いません。\n馬鹿だと言われても仕方ありません。この男から3,000ドルの小切手を受け取り、入金した...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pnj9xg/men_with_high_libidos_who_are_in_long_term.json": "私は結婚して何年も経ちますが、かなり最近までこの問題はあまりありませんでした。\n問題ではありませんでした。妻が私ほど夢中になっていないことは知っていましたが、彼女はいつも私に「問題ない」と言っていました。\n問題ないと言ってくれていました。今では一方的になってしまったので、どうしてもセックスする気になれません。\nセックスをする気になれないし、できたとしてもいつも...",
  "data/reddit-ask/r/NoStupidQuestions/comments/png2yq/why_do_slavic_people_never_use_the.json": "ただの映画のステレオタイプだと思っていましたが、突然、私の会社が、サブシ\nブルガリア、ロシア、チェコに子会社を持つポーランド企業に買収されてしまったのです。\nと言われました。\n\n彼らが何かを書くときには、ほとんど「the」を使いません。今のように、私たちが技術的な問題を抱えているときは\n今のように、技術的な問題が発生したとき、IT担当者の一人がこう言いました...",
  "data/reddit-ask/r/AskHistorians/comments/pni4b3/did_karl_marx_arm_himself_if_so_with_what.json": "マルクスは次のように言っています。「いかなる口実でも、武器と弾薬は降伏してはならない。\n労働者を武装解除しようとするいかなる試みも、必要ならば力ずくで阻止しなければならない。\n彼が武装していたかどうか、また何で武装していたかはわかっているのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pnfvhz/why_isnt_child_support_a_universal_flat_rate.json": "1人の子供にいくらかかるのか、なぜそんなに課金されないのか？子供は月に20万円も必要ではありません。\n月に20万円も必要ではありません。もしそうであれば、なぜ金持ちの親を持つ子供のことを気にするのでしょうか？\n貧乏な親よりも金持ちの親を持つ子供の方が大事なのか？\n家賃、食料品、洋服など。私が間違っているかもしれませんが・・・。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pnle9x/is_life_really_just_working_a_40_hour_work_week.json": "私は18歳になったばかりですが、私の理解では、大人になるということは、無意味で過酷な仕事を週5日して、生活費を確保することです。\n意味のない過酷な仕事を週5日もして、生活費を確保すること。\n週5日の無意味で過酷な仕事をして、生活できるだけのお金を稼ぎながら、人間関係や趣味など、生き甲斐を感じる時間がほとんどない。\n人間関係や趣味など、生きがいを感じるための時間はほとんどありません。そして週末は...。",
  "data/reddit-ask/r/askscience/comments/pnhce5/could_a_solar_sail_spacecraft_carry_its_own_laser.json": "物理学の古典的な問題に、「なぜヨットに扇風機をつけないのか」というものがあります。\n風がないときに船を動かすために、なぜヨットに扇風機をつけないのか？明らかな答えは次の通りです。\nファンは常にセイルに与えるのと同じかそれ以上の衝撃を反対方向に与えるからです。\nファンは常にセイルに与えるのと同じかそれ以上の衝撃を逆方向に与えるからです。これと同じ原理が、太陽電池にも当てはまるのでしょうか。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pngugn/why_does_it_cost_tens_of_thousands_of_dollars_up.json": "毎月1500ドル程度の住宅ローン／税金／その他を払えるほどの収入はありません。しかし\n1795ドルの家の家賃を払えるだけのお金持ちです。それはどうしたら意味があるのでしょうか？\nのか？なぜ銀行員はそれが合理的だと思うのか？\n\n巨大な前払い費用に何の意味があるのか？私には純粋に悪意があるとしか思えません。\nただの...",
  "data/reddit-ask/r/AskHistorians/comments/pnho7s/how_famous_was_edwin_booth_when_he_was_alive_how.json": "俳優は、現代の俳優と同じくらい有名だったのか、それともあまり有名ではなかったのか（私は有名ではないと思っていますが、間違っているかもしれません）。\nしかし、私は間違っているかもしれません。)",
  "data/reddit-ask/r/AskHistorians/comments/pnnneu/when_big_cities_like_london_or_paris_first_built.json": "このような都市では、人口減少に伴い、この問題がより深刻になってきたと思います。\nまた、ロンドンの「Great Stink」のような出来事が引き金になったこともあります。\nロンドンの「大悪臭」のような出来事が引き金になったことは知っていますが、興味があるのは当時の政治的議論がどのようなものだったかということです。\nしかし気になるのは、当時の政治的な議論はどうだったのかということです。誰が反対したのか？どんな主張をしていたのか...。",
  "data/reddit-ask/r/AskHistorians/comments/pnhjvk/what_were_the_effects_of_having_all_the_police.json": "9.11のドキュメンタリー番組では、必ず消防や警察の出動要請の場面が出てきます。\n消防や警察の通信指令員が「全員がワールドトレードセンターに集まるように」と呼びかけている場面が必ず出てきます。\nこれは文字通りの意味で、消防署や警察署には人員が不足していた。\n消防署や警察署では、人員が不足していたのでしょうか。そうだとすると、火事はどのようにして...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pnme75/not_to_be_dark_but_whats_currently_the_thing.json": "最近のあなたを支えているのは、生きていること、幸せなことですか？これは文字通り\nただの質問で、批判はしません。",
  "data/reddit-ask/r/AskHistorians/comments/pns1tk/why_werent_native_americans_the_primary_slave.json": "ネイティブ・アメリカンが奴隷にされていたことは、クリストファー・コロンブスがプエルトリコで奴隷にしたのをはじめ、いくつかのケースで理解しています。\nクリストファー・コロンブスがプエルトリコで しかし、アメリカ大陸で主に奴隷にされていたのがアフリカ人だったのはなぜでしょうか？\nアメリカ大陸で奴隷にされたのは、なぜアフリカ人だったのでしょうか？経済的にも利便性の面でも、ヨーロッパから来た人たちが\n経済的にも利便性の観点からも、ヨーロッパの人々が...",
  "data/reddit-ask/r/AskHistorians/comments/pnpwow/how_come_there_were_so_many_cave_paintings_found.json": "ウィキペディアの洞窟壁画のページを見ていたら\n[https://en.m.wikipedia.org/wiki/Cave_painting]を見ていたら、有名な洞窟画の大半が\n見つかっている有名な洞窟画の多くはフランスにあることに気がつきました。これには何か理由があるのでしょうか？\n理由はあるのでしょうか？\n\nフランスには先史時代の人間が多く住んでいたのでしょうか...",
  "data/reddit-ask/r/AskHistorians/comments/pndkk5/monday_methods_revisiting_female_composers_and.json": "人類の歴史の大部分で、女性は脇役、二次的な役割に追いやられてきました。\n脇役、副次的な役割に追いやられてきました。家父長制や異性愛が終わったと言いたいところですが、そうではありません。\n異形性は終わったと言いたいところですが、そうではありません。女らしさ、女性らしさは\n女性性や女性らしさは、弱さや感情と結びつけられ、最小化され続けています....",
  "data/reddit-ask/r/AskWomen/comments/pnxfbz/raskwomen_whats_your_most_shallow_dealbreaker_and.json": "もちろん、ただの好奇心です。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pnyyll/is_it_a_valid_reason_to_quit_my_job_in_the_first.json": "私は数日前に新しい仕事に就きました。私はリスティング広告に掲載され、人事担当者から\n月曜から金曜まで、1日8～10時間働くと人事担当者に言われました。しかし、私の\n昨日（僕にとっては3日目）は14時間半、今日は1時間半働いたよ。\n昨日（私にとっては3日目）は14時間半、今日はすでに11時間になってしまいました...。",
  "data/reddit-ask/r/AskHistorians/comments/po046x/why_were_such_strange_feudal_privileges_given_to.json": "> 彼の特権の一つは、オーカムの領地を訪れた身分の高い人から、馬蹄の没収金を請求することでした。\n> 蹄鉄の没収を請求することでした。蹄鉄のユニークなコレクション\n> 王族や貴族から贈られた蹄鉄のユニークなコレクション\n> [https://en.wikipedia.org/wiki/Peers_of_the_realm] 荘園を通過する。\n> 壁に飾られています・・・。",
  "data/reddit-ask/r/AskHistorians/comments/po1nu8/why_have_india_and_burma_had_so_little_historical.json": "ベンガルとアッサム（ビルマと国境を接するインドの地域）はインドの一部でした。\nの時代からインドの一部でした。しかし、インドからビルマへと国境を越えると、文化的な変化が急激に起こります。\nインドとビルマの国境を越えると、インド系、ヒンドゥー/ムスリム系から\nインド系、ヒンドゥー・イスラム系から、シナ系、仏教系へ。それはなぜか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/po6117/were_not_removing_sexual_questions_hide_the_posts.json": "タイトル\n\n気軽に/r/JustUnsubbedでカルマを稼ぎに行こう！「OOOOH HOW DARE\nRedditors use a q&a reddit for q&a, dae sexers of sexxit, Whats the sexiest sex've ever sexed.\nあなたが今までにしたことのあるセックスは何ですか？\n\nI've JuSt UnSuBbEd FrOm ToOaFraIdToAsK BeCaUsE PeOpLE AsK QuEsTiOnS I DoNt\nPeRsOnAlLy ThInK NeEd to'be...",
  "data/reddit-ask/r/askscience/comments/pnxt2q/why_are_the_decks_angled_on_aircraft_carriers.json": "このテーマに関するYouTubeのショートムービーに加えて、アングルドデッキの理由に関するいくつかの短い記事を読みました。\nアングルド・デッキの理由についての短い記事をいくつか読みましたが、どうやら私には\nしかし、私には大きな頭脳が欠けているようです。どの情報源も、あなたが「わかっている」ことを前提にしているようで\nあまり詳しく説明していません。\n\nデッキを90度から回転させて...というのは理解できます。",
  "data/reddit-ask/r/askphilosophy/comments/pnrii5/is_having_children_inherently_selfish.json": "最後まで聞いていただけると幸いです。はっきり言って、私は真剣に哲学を学んだことはありません。\nしかし、私は個人的な苦悩に対処しており、それがしばしば哲学的な問題につながるのです。\n哲学的な問題を抱えています。そして、これについての意見を聞きたいと思っています。\n\n最近、私は生殖について考えていて、人間はどのように違うのか...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/po8x8k/where_did_i_go_wrong_whats_changed.json": "私は息子と、性的に何が適切かを話し合わなければなりませんでした。私の\n妻が息子の閲覧履歴を見たところ、アナルやフィスティング、レズビアンばかりでした。\n\n私は息子の夢と空想を壊すために、ほとんどのレズビアンはポルノに出てくるようなものではないし、女性は肛門に拳を入れられるのを好まないと伝えました。\nレズビアンはポルノに出てくるような人ではないし、女性はアナルでフィストされるのを好まないと言って、彼の夢や妄想を壊してしまった。それは...",
  "data/reddit-ask/r/AskHistorians/comments/po2vvb/what_did_marble_sculptors_do_with_all_of_the.json": "ただゴミ箱に捨てたのか、それとも何かリサイクルの方法があったのか。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pogs64/why_does_my_username_have_a_cake_picture.json": "編集：皆さん、ありがとうございました。来年のためにこのことを覚えておいて、また馬鹿なことをしないように\n来年のために覚えておきます。\n\n今日は私の誕生日ではありませんが、私のプロフィールをチェックしたところ、私の誕生日が記載されていました。\nです。どうしてケーキがあるの？みんなに見えるのか、それとも僕だけに見えるのか？",
  "data/reddit-ask/r/askphilosophy/comments/po4k5u/philosophy_as_a_hobby_is_it_even_possible.json": "こんにちは、お聞きしたいのですが、哲学（エッセイを書くことも含む）は\n哲学（エッセイを書いたり、二次資料や一次資料を読んだりすることを含む）は良い趣味になりますか？趣味で書いたエッセイが\n趣味で書いたエッセイが学術的に認められる可能性はありますか？\n\n私は子供の頃から哲学に興味を持っていましたが、その道を選ぶことはありませんでした。\n哲学に興味を持っていましたが、その道を選ぶことはありませんでした...",
  "data/reddit-ask/r/NoStupidQuestions/comments/poibr3/would_it_be_illegal_to_rise_up_against_a.json": "例えば、私が大規模な不正選挙が行われた町に住んでいて、警察が政府の武装組織として使われているとします。\n警察は政府の武装組織として使われていて、この状況を黙認するように威嚇しています。\n合法的に何かをしようとすると、踏みつけられてしまうのです。それは\n連邦政府は、地方自治体を鎮圧するために武器を持って立ち上がることを違法としています。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/poh6b4/why_is_a_lack_of_jealousy_a_turn_off_for_some.json": "私は自分に自信がないので、嫉妬するような人間ではありません。もし誰かが私を騙そうとするならば\n彼らは私を騙します。もし浮気をしたら、その人は私のことを気にかけていなかったということで、私のために早く関係を終わらせてくれたということです。\n早めに関係を終わらせてくれました。わからないことにストレスを感じることに意味はないと思います。\n分からないことにストレスを感じる意味がありません。あなたは誰かと交際している...",
  "data/reddit-ask/r/NoStupidQuestions/comments/poj6e1/is_there_a_term_for_when_in_order_to_explain.json": "誰かに何かを説明するときに、その説明のために自分が何をしなければならないかを示す公式用語がありますか？\n誰かに何かを説明するために、他の複数の事柄やテーマを説明しなければ理解してもらえない場合の正式な用語はありますか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pok1ei/its_normal_to_cry_when_you_dont_understand_the.json": "先生が問題を出してくれたのですが、私は2つ目の問題で50分も悩んでしまい、解けませんでした。\n50分ほど悩んだのですが、解けませんでした。友達が助けてくれたので、1つ目の問題だけは解けました。\n友達が助けてくれたからです。\n\n気がついたら50分経っていて、何も進んでいませんでした。\n本当に腹が立って、泣き出してしまいました。",
  "data/reddit-ask/r/AskHistorians/comments/pomvdr/as_the_captain_of_a_royal_navy_frigate_during_the.json": "フリゲート艦の艦長は通常、自分の船を好きな色に塗ることができた。\nパトリック・オブ・ブライアンが信じているように、フリゲート艦の艦長は通常、自分の船を好きな色に塗ることができ、海外で銃を数門追加することもできた。\nO'Brianが信じるところでは\n\n英国海軍の艦長たちは、自分たちの船をより自分たちのものにするために、他にどのような改造をしたのでしょうか？\n他には？例えば、人を増やしたり...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pondob/isnt_the_bible_heresy_technically.json": "私の知る限り、キリスト教徒は「神の言葉に従う」ものであり、聖書は2000年前にイエスの言葉を\n2000年前に書き留められたイエスの言葉です。しかし、現在は新約聖書があります。\nイエスが自分の作品をチェックするために降りてきたという話は聞いたことがありません。\n人々は神の言葉を見て、「いや、私はそうは思わない...」と言ったのではないでしょうか。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ponqrd/why_do_vegans_try_to_create_vegan_meat_do_they.json": "菜食主義者を害するつもりはありませんし、彼らは本当に善意でやっていると思います。\nしかし、肉を使わない動物性食品の代用については心配になってきました。彼らは、肉食の人に試してもらうために\n動物を傷つけずに肉を味わうためのものなのか？\n動物を傷つけずに肉を味わうためなのか。彼らは自分たちが再現された味を食べていると思っているのだろうか...。",
  "data/reddit-ask/r/AskWomen/comments/pohpji/ladies_whats_a_flirting_strategy_that_has_never.json": "アイコンタクト、髪の毛で遊ぶ、遊び心を持つ、無邪気に振る舞う、などなど。\n実際に何が役に立ったのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/poqdtc/was_jesus_a_psychopath.json": "邪悪な宗教の仮面を剥ぐ』という本を読みました。\n山の説教について分析しています。私が疑問に思ったのは、イエスが説いた「敵を愛せ」という言葉の邪悪さを理解したときです。\n疑問に思ったのは、イエスが説いた \"敵を愛せ \"という言葉の邪悪さです。この言葉には、愛と敵という二つの強い言葉があります。\n愛と敵という二つの強い言葉があります。もしあなたに敵がいたら、その人は必ず...",
  "data/reddit-ask/r/AskHistorians/comments/pok8fj/in_a_deleted_scene_for_the_movie_jarhead_the.json": "20年ルール違反で誤って削除されてしまったので再掲\n(Jarheadは第一次湾岸戦争の話）。)\n\nこれが問題のシーンである。https://www.youtube.com/watch?v=x9BUxnVhq7Y\n\nサウジアラビアには、主に石油労働者と......で構成された西洋のコミュニティがあると、以前読んだことがあります。\n前に読んだのは、サウジアラビアには主に石油労働者と...",
  "data/reddit-ask/r/NoStupidQuestions/comments/popgvs/is_ot_normal_for_me_to_be_worried_that_im_boring.json": "僕は16歳の男の子ですが、自分がつまらない人間ではないかと悩んでいます。僕は\n私は漫画やDnDなどが好きですが、私の周りには楽しい人がいないような気がします。\n\nEdit: 優しい言葉やアドバイスをくれた皆さんに感謝します。",
  "data/reddit-ask/r/AskWomen/comments/pol56e/what_are_some_of_the_financial_decisions_that_you.json": "あるいは、やってよかった",
  "data/reddit-ask/r/Ask_Politics/comments/pofy9w/why_did_mitch_mcconnell_block_the_911_victims.json": "最近では、ジョン・スチュワートが9/11の\n犠牲者のための基金と、これを阻止するMitch McConnellについてです。アメリカ人ではない私にとって、基金を支援するのは当然のことのように思えます。\n基金を支援するのは当然のことのように思えます。\n基金を支援するのは当然のことのように思えます。\n\nしかし、私が信じていることを実現するのは難しい...。",
  "data/reddit-ask/r/askscience/comments/pol934/did_the_black_plague_end_because_natural.json": "現在のヨーロッパの免疫システムは、黒死病を撃退する強い能力を持っているのでしょうか？\n疫病を退治する能力があるのか？\n\nそうでないとしたら、ペストはどうやって終息したのか？",
  "data/reddit-ask/r/AskHistorians/comments/pov9p9/a_common_view_of_the_napoleonic_wars_can_be.json": "フランス、ドイツ、オーストリア、ロシアなどの多くの人々がこのような考え方をしていないのではないかと私は非常に疑っています。\nフランス、ドイツ、オーストリア、ロシアなどの多くの人々がこのような見解を持っていないことに非常に疑問を感じています。\nしかし、私はそれらの言語を話せないので、彼らの見解を調べることはできません。\n\n同様に、この問題に関する一次資料を調べてみると、すぐに気づかされます。\nとすぐに気づかされます・・・。",
  "data/reddit-ask/r/AskHistorians/comments/powcdf/why_did_robert_e_lee_continue_to_fight_at.json": "戦いの初日、南軍は北軍をゲティバーグ周辺の丘陵地帯に押し戻した。\nゲティスバーグ周辺の丘陵地帯に北軍を押し戻した。リーは、この丘が強固な防御陣地になることを知っていた。\nリーは、丘陵が強固な防御陣地になることを知っており、将軍たちにできるだけ丘陵を取るように命じたことからもわかるように\n取ることができるならば、その丘を取るように将軍たちに命じたことからもわかります。それなのに、なぜリーはわざわざ北軍を攻撃したのだろう...。",
  "data/reddit-ask/r/TrueAskReddit/comments/porm67/would_the_citizens_living_in_the_us_be_better_off.json": "カリフォルニアの人はテキサスの政治が嫌い。逆に言えば、カリフォルニアの人々は\nテキサスの人々はカリフォルニアの政治を嫌っている。\n\nさらに、ウィスコンシン州の風景や地域の問題は、フロリダ州のそれとは全く異質です。\nウィスコンシン州の風景や地域の問題は、フロリダ州のそれとは全く異なります。\nニューメキシコ州やロードアイランド州とは全く違う。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pp421d/why_are_so_many_bathroom_sink_faucets_1_inch_away.json": "手を洗うのが大変ですが、何となくできているような気がします。",
  "data/reddit-ask/r/AskHistorians/comments/poyh17/did_ancient_greeks_and_romans_wear_underpants.json": "以上です。",
  "data/reddit-ask/r/AskHistorians/comments/pp4pxf/if_robin_hood_were_real_and_were_to_host_a_feast.json": "中学生の時に読んだロビン・フッドの本では、誘拐したふりをして\n誰かを誘拐したふりをして、おいしい食事をごちそうして、お金をプレゼントして\nお金をプレゼントして送り出すという話を読んだことがあります。いつも彼らが食べていた食べ物\n特にチーズは柔らかそうだった。",
  "data/reddit-ask/r/AskHistorians/comments/pp2wmx/ww2_what_was_my_grandfather_doing_in_norway.json": "こんにちは。\n\n*私の質問はそれほど複雑ではないと思いますが、私はただ、文脈と理解を求めています。\n文脈と理解を求めています。漠然としていて申し訳ありませんが、私は歴史や祖父のことをあまり知りません。\n歴史や祖父のことをよく知りません。\n\n私の祖父は第二次世界大戦中にアメリカに従軍していましたが、私の家族の間では何となく知られていましたが\n祖父は第二次世界大戦中にアメリカに従軍しました。",
  "data/reddit-ask/r/AskWomen/comments/poy7iz/tips_on_how_to_look_good_in_photos_others_take_of.json": "ありがとうございます💞。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pp5gbn/sorry_that_this_question_will_put_you_on_blast.json": "こんにちは、だから私は本当にたくさんのことを考えすぎています。私は平均的な体格に比べて小さいです。\n今は彼女がいませんが、将来のことを考えると考えてしまいます。\n私は平均的な体格に比べて小さいので、今は彼女がいませんが、特に将来のことを考えるとよく考えます。私の年齢（19-22）では、ほとんどの人にとってセックスは大きな問題です。\n私の年齢（19-22）では、ほとんどの人にとってセックスは大きな問題であり、特に恋愛においては、彼らは...を切望しています。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ponpzo/what_is_the_proper_social_etiquette_when.json": "私がレイ・スティーブンスで、ブリジット・ザ・ミゼットに出会ったとします。それは私が5フィート8インチで\n相手は成長しきっていて170cm以下ということになります。\n\n * 私は普通に立って、首を曲げますか？\n * 私は相手の目の高さに近づこうとしますか？膝をつくか、膝を曲げるか\n   Khalisiが見ていたように膝をついたり、曲げたりしますか？\n * Do I...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pp8hob/is_it_bad_to_take_money_from_a_guy_online.json": "数ヶ月前、私はインスタのストーリーで「お金を貸してください」と、ほとんど冗談のように言っていました。\nすると、ある男性が返信してくれて、必要な分のお金を実際に渡してくれたんです。それ以来\n私が何をしたいかを彼に伝えると、彼はそのためのお金をくれます。\n\n彼は「経済的支配」と呼ばれるものに夢中で、どうやらそれは...",
  "data/reddit-ask/r/askscience/comments/ppcukl/askscience_ama_series_we_are_microbiologists.json": "明日は国際微生物デーなので、それを記念して\n今回は、私たちの大好きな微生物「菌類」についてご紹介します。Netflixで「ファンタスティック・ファンギ」をご覧になった方は\nNetflixの「ファンタスティック・ファンジー」をご覧になった方は、菌類の世界を十分にご理解いただけたと思います。しかし、菌類の魅力はワクワクすることだけではありません。\n菌類の魅力はサイケデリック・ドラッグだけではありません。\n\n今日は私たちと一緒に...",
  "data/reddit-ask/r/AskHistorians/comments/ppdxwr/it_wasnt_about_slavery_exposing_the_great_lie_of.json": "アマゾンでこの本を見つけたのですが、この本にはかなり怪しげな議論が書かれています。\n怪しげな議論や、「奴隷制についてではない」という物語に合わせて事実をマッサージするような主張が満載です。\nの物語に合うように事実を修正しています。\n\nこの本に詳しい南北戦争の歴史家の方で、この本のどこが有効なのか（もしそうなら）指摘してくれる人はいないだろうか。\nこの本に詳しい南北戦争の歴史家の方で、この本のどこが有効なのか指摘していただける方はいらっしゃいませんか？",
  "data/reddit-ask/r/AskHistorians/comments/pp6pcc/where_was_homers_the_iliad_found_was_it_found.json": "ホメロスの『イリアス』は発掘現場で発見された？それとも、現代まで語り継がれ、書き継がれてきたものの一つなのか。\n現代まで伝えられ、書かれてきたものなのか？複数の場所で書かれた記録が\n複数の場所で書かれたものがまとめられているのでしょうか？ご協力ありがとうございました。",
  "data/reddit-ask/r/AskHistorians/comments/pph3d1/what_do_historians_know_about_the_y_chromosome.json": "昨日、この質問を投稿しようとしたのですが、削除されてしまいました。モデムからは\nサブレディットのガイドラインに沿って質問を修正して投稿するように言われました。その時の\nmodsはそれについて親切でした。modsに拍手を送りましょう。\n\nここで[https://www.nature.com/articles/s41467-018-04375-6]記事を...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ppmx4q/my_wife_wants_me_to_start_wearing_a_condom_again.json": "10年連れ添った妻が、セックスの時にはまたコンドームをつけてほしいと言ってきました。\n\"後始末を楽にするために\" 彼女とは結婚前からコンドームを使っていません。\n結婚前からコンドームを使っていません。そんなことを言われても困るのですが、彼女はそれが理由だと言います。\nそれが彼女の理由です。彼女はセックスについて何も言っていませんが...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pplfov/how_do_blind_people_with_service_dogs_pick_up_the.json": "彼らの犬はいつ、どこで糞をするのか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pp9vx8/why_is_it_even_necessary_or_important_to_identify.json": "例えば、名前をつけたり、何かを識別したりする必要がなく、自分の好きなものや好みのものを楽しむことができるのではないでしょうか。\n名前をつけたり、特定のものとして認識する必要はないのでは？\nなぜ一部の人にとっては、そうすることが重要であり、また他の人に自分のアイデンティティを知らせることが重要なのでしょうか？\n識別することが重要なのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pppcen/are_you_supposed_to_wear_a_shirt_under_a_pullover.json": "また、洗う前に何度も着ることができますか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ppjp8n/what_are_you_supposed_to_do_if_nothing_is_fun.json": "私はもうすぐ40歳になります。人生ではいろいろなことをしてきました。しかし、それはもう\nもう何をしても幸せにはなれないんだ。基本的には\n一人で何かをして楽しむことができません。\n\n抗うつ剤は飲んでいます。セラピストにも診てもらっています。彼女はこれを\nこれは...",
  "data/reddit-ask/r/NoStupidQuestions/comments/ppsl0s/when_youre_laying_in_bed_w_your_eyes_closed_but.json": "私はいつも、「少なくとも目玉を休めている」と考えて自分を慰めています。\n私はいつも「少なくとも目玉を休めているんだから！」と自分を慰めています。私はそれに何か意味があるのかと思っています。\n\n私が言っているのは、肉体的なテストではなく、精神的なテストのことです。",
  "data/reddit-ask/r/AskHistorians/comments/ppuly9/why_is_athens_still_around_but_not_sparta.json": "ペロポネソス戦争でスパルタが勝利したにもかかわらず、なぜアテネは今も存在し、スパルタは存在しないのか？\nペロポネソス戦争でスパルタが勝ったにもかかわらず、なぜアテネはスパルタではなく今も残っているのか？",
  "data/reddit-ask/r/askscience/comments/ppw1on/how_will_todays_media_be_preserved_in_the_future.json": "YouTubeで公開されているすべてのビデオは、何年も先（数百から数千）の歴史的なアーカイブに保存されるのでしょうか？\n(何百年、何千年も先の未来に保存されるのでしょうか？\nビデオ、映画、音楽などの大半が失われてしまうのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/ppnvc2/in_aladdin_1992_aladdin_in_his_guise_of_prince.json": "これは数ヶ月前の再投稿で、回答を得ようとしたものです。これは\n最初の投稿では回答が得られませんでした。",
  "data/reddit-ask/r/AskWomen/comments/ppvb1t/what_are_some_compliments_that_someone_gave_you.json": "私は「愛で導く」と言われたことがありますが、この言葉は私の心を幸せにしてくれます :)",
  "data/reddit-ask/r/AskHistorians/comments/ppx472/why_did_industrialization_under_the_song_dynasty.json": "宋の時代の経済は、たくさんの鉄を溶かし、石炭の力を利用していました。\n石炭の力を利用した。彼らは、異なる使用価値を互いに交換する究極の商品である貨幣を持っていました。\n貨幣があったということは、商品生産があったということです。しかし\n工業化と商品生産の特徴にもかかわらず、中国は...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ppuf5f/is_the_term_latinx_cringy_and_culturally_ignorant.json": "例えば... この言葉はとても...無知な感じがします。使っているのを見かけるのは\n使っているのを見たことがあるのは、アメリカの大学関係者だけです。彼らはこの言葉を流行らせようとしていますが\nそうではありません。文字通り、スペイン語では使えません。使えるのは\n英語でしか発音できません。\n\nそして、これはただのケースではありません...。",
  "data/reddit-ask/r/AskHistorians/comments/ppsnxe/why_did_china_become_a_permanent_un_security.json": "現在のような強さはありませんでした。彼らには軍事力もなければ\n世界的な「安全保障」を押し付けるだけの軍事力も富もありませんでした。今の中国の力を見て同盟国が彼らを選んだのなら理解できますが\n連合軍が中国の力を基準にして彼らを選んだのなら理解できますが、当時はそうではありませんでした。彼らには\n連合国側が中国の力を考慮して彼らを選んだのなら理解できますが、当時は違います。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pq1jeb/what_causes_the_wet_spot_after_sex_do_most_people.json": "今回の質問は、最近見た他の記事のコメントに触発されたものです。\n濡れた場所で寝る」という話を聞いたことがきっかけです。\n\nほとんどの人は、セックスの後に掃除をしないのですか？私と私のパートナーは、いつもすべてを拭いて\nシャワーを浴びる前にティッシュを使って止めます。\nシャワーを浴びる前にティッシュを使って...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ppz55u/what_are_your_thoughts_about_this.json": "「レイプや近親相姦の場合にのみ中絶を支持するのであれば、そのような考え方を強化することになります。\n女性が自分の体に対する権利を持つためには、誰かが最初にそれを侵害しなければならないという考えを強化していることになります。\nという考えを強化していることになります」。",
  "data/reddit-ask/r/AskHistorians/comments/ppvkl4/in_the_song_good_ol_rebel_the_speaker_says_he.json": "連合国側は、ほとんどの場合、建国の父や革命世代を敬い、北側が建国を踏みにじっていると非難していたことは知っています。\n盟約者団は建国の父や革命世代を尊敬し、北側が建国の理念を踏みにじっていると非難した。\nジョージ・ワシントンを国璽に採用したこともあります。\n\nしかし、いくつかの逸話やトリビアが散見され、それらは...",
  "data/reddit-ask/r/AskHistorians/comments/pq2kj5/in_medieval_europe_there_existed_a_superstition.json": "まず、これらの話を本当に信じた人がいたという前提で話を進めます。\n想定しています。現代の私たちから見れば、とても馬鹿げた話ですが、少なくとも、これらの話を本当に信じていた人がいたのです。\n信じていた人もいたのではないでしょうか？\n\n次に、これらの話には、赤ちゃんや自分自身が誘拐されないようにするためのアドバイスが多く含まれています。\n誘拐されないようにするためのアドバイスが書かれています。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pq58ur/why_do_so_many_people_think_biden_is_incapable.json": "EDIT: 前置きが長くなりましたが、私は「Biden支持者」ではありません。\n投票しませんでした。しかし、私は彼がより良い大統領になると感じました。\n彼は人生のすべてを政治に捧げてきたからです。トランプ氏よりも適任だと思います。\nトランプ氏よりも適任だと思います。\n\nバイデンのスピーチを見たとき、彼はただ...。",
  "data/reddit-ask/r/AskWomen/comments/pq0tzk/what_are_some_examples_of_your_boundaries.json": "最近、いたるところで「境界」という言葉を目にしますが、正直なところ、私には「境界」がないような気がします。\n自分には境界線がないし、自分の境界線が何なのかもわからない。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pq88wk/because_of_a_tik_toc_trend_my_sons_school_closed.json": "息子からのメールによると、とてもひどいウンコがしたいとのことで、すべてのトイレが\nトイレには鍵がかかっていた。信じられませんでしたが、学校に電話してみると、息子は本当のことを言っていました。\n本当だったのです。暫く議論した後、学校側は息子にオフィスのトイレを使わせてくれることになりました。\nオフィスのトイレを使わせてくれることになりましたが、周りには管理者がいました。私の息子は...",
  "data/reddit-ask/r/askphilosophy/comments/ppxwu0/how_can_science_be_objective_when_humans_are.json": "人間は主観と主観的な感覚によって制限されているので、科学はどうやって\n科学は客観的になりうるのか？\n\n他の種族では、色や波長の見え方が違います。なぜ、人間の感覚では\n人間の感覚は客観的な現実をありのままに認識しているのに、他の生物はこのように認識している。\nなぜ人間の感覚は客観的な現実をそのまま認識するのでしょうか？\n\nどんな根拠があるのか...。",
  "data/reddit-ask/r/askscience/comments/pq8c6s/is_petrified_and_fossilized_the_same_thing.json": "そうでない場合、どのような違いがありますか？",
  "data/reddit-ask/r/AskHistorians/comments/pq50yn/how_did_albania_actually_fall_into_the_whole.json": "最近、レアアースのビデオで、アルバニアがいかにして内戦に巻き込まれ、ねずみ講やマルチ商法で経済破綻したかを見ました。\nネズミ講やマルチ商法で経済破綻したことを経験しました。残念なことに\n実際にどのような出来事があったのか、ビデオの詳細はかなり短く、また\nWikipediaもほとんど役に立たないようです。\n\n誰か歴史家の方、お願いします...。",
  "data/reddit-ask/r/askscience/comments/pq8929/why_is_high_blood_pressure_considered_a_bad_thing.json": "高血圧は通常、心臓発作と関連していますが、私はその理由がわかりません。\nその理由がわからない。圧力の高いパイプの方がきれいになるのではないか？\n\n高血圧は心不全の原因なのでしょうか、それとも症状なのでしょうか、つまり、問題なのは血圧ではなく、心不全の暗示なのでしょうか。\n血圧が問題なのではなく、血圧が高いと......という意味合いです。\n血圧が高いと...",
  "data/reddit-ask/r/AskHistorians/comments/pq8k5a/homosexuality_was_legal_in_revolutionary_and.json": "革命時に同性愛が合法化され、その後のナポレオンの刑法でも再確認されたことを知っています。\n後のナポレオンの刑法でも再確認されています。また、この時代の著名な\nこの時代の政治家や公人が同性愛者だと言われているのを聞いたことがあります。\nとはいえ、この時代の著名な政治家や公人が同性愛者だったかどうかについての情報は見当たりません。",
  "data/reddit-ask/r/AskHistorians/comments/pqboov/when_patrick_obrian_was_revealed_to_have.json": "私は、ここにいる多くの人々と同様に、Patrick O'Brian（パトリック・オブライアン）の\nAubrey-Maturinシリーズの大ファンです。私がこの作家を知っていたのは、本の後ろに付いていた自伝的なメモだけでした。\n著者について知っていたのは、彼の本の印刷版の後ろに付いていた自伝的なメモだけでした。それは\n基本的には次のようなことが書かれています（記憶に頼っていますが、間違っていたらごめんなさい...）。",
  "data/reddit-ask/r/AskHistorians/comments/pq9i8i/how_much_were_the_economies_of_european_nations.json": "何人の人がいるかは、作ることができる物の絶対量に直結しているようです。\n作れるもの、作れるもの、達成できるものなどの絶対量に直結しているようです。各国はそれを\n災難だと思ったか？それを止めようとしたのか？",
  "data/reddit-ask/r/AskHistorians/comments/pq4g46/what_exactly_was_nazi_germany_holding_out_for.json": "第二次世界大戦の前半におけるドイツの計画がどのようなものであったかについては、これまでも多くの議論がなされてきました。\n戦争前半のドイツの計画については多くの議論がなされてきました。\n負け始めた戦争後半はどうだったのでしょうか？ヴォルクシュトゥルムやバルカンの戦いなどの\nバルジの戦いなどは、時間を稼ごうとしていたように見えますが、その稼ぎ方は...。",
  "data/reddit-ask/r/AskHistorians/comments/pqjz96/the_irish_potato_famine_18451852_while_often.json": "ざっと見たところ、この2つのイベントには多くの共通点があります。両国とも\n両国とも、占領者による経済政策の失敗の犠牲となった。\n英国のレッセフェール（自由放任）資本主義への徹底したこだわりや、スターリンの近代化への突進など\n近代化を急いだスターリンのように。\n\nアイルランドのジャガイモ飢饉は、日本では考えられないことです。",
  "data/reddit-ask/r/AskWomen/comments/pqhhs9/former_tomboys_who_did_a_180_became_totally.json": "最初に断っておきますが、おてんばだった女性が少し変わって、今では何かに夢中になっているということではありません。\n女性らしさと男性らしさの中間に位置する女性のことではありません。\n男性的なものと女性的なものの中間にいる女性のことではありません。現実にはよくあることだと思いますし、私の女性の友人にもそういう人がたくさんいます。\n女性の友人の多くがそうです。\n\n私が質問しているのは、おてんば娘から少し変わって、今では女性らしさと男性らしさの中間にいる女性のことです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pqjyjp/why_is_having_to_show_and_id_to_vote_considered.json": "もっと小さなことでもI.D.が必要であることを考えると、最悪のアイデアではないと思う。\nしかし、私は以前にも間違いを犯したことがあります。さて、どうしたものか？\n\n編集：タイトルは「an I.D.」のつもりでした。申し訳ありませんが、今日は早起きしすぎました。\n今日はこの辺で。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pqlqnh/why_do_gay_people_exist.json": "これは賛否両論あると思います。あらかじめ断っておきますが、私はLGBTQを支持し、尊重しています。\nLGBTQコミュニティを支持し、尊重しています。進化論的な観点からすると\n進化の観点から、選ばれた個人が自分を排除することは、私たちの種にとって有害ではないでしょうか？\n進化の観点からすると、選ばれた個体が交配相手から自分を排除することは、種にとって不利益ではないでしょうか。あるいは、逆に...",
  "data/reddit-ask/r/TrueAskReddit/comments/pqaaz3/what_is_that_one_seemingly_meaningless_decision.json": "私の場合は、小学6年生の時に受講した音楽の授業にさかのぼります。\n年です。決め方はコインで決めました。そのクラスで何人もの友達と出会うことになるとは知らなかったのです。\nそのクラスで、今でも知り合いで、毎日話していて、私の人生にある種の影響を与えている複数の友人に出会うとは思いませんでした。\n私の人生にある種の影響を与えています。彼らは、私の人生にある種の影響を与えてくれました。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pqo060/are_all_the_sponsors_that_youtubers_promote_over.json": "私はレイコンを買おうと思っていますが、それは私のイヤホンが壊れかけているからというのもありますし、youtube大王に屈しているからかもしれません。\n買う価値はありますか？私はいつも\n重いスポンサーが付いているものはあまり質が良くないと思っていますが、実際にはどれも試していません。\n実際にはどれも試していません。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pqnnzk/am_i_intolerant_for_hating_religion.json": "私はあらゆる宗教を軽蔑していますが、宗教を実践している人はほとんどの場合、不幸で無教養な人のように見えます。\nある程度、不幸で無教養な人が多いように思います。何百万人もの賢くて良い宗教家がいることは知っています。\nしかし、もし宗教がなければ、彼らはもっと多くのことを達成できると思います。\nもし宗教がなければ、もっと多くのことを達成できると思います。\n\n私が思うに、それは...",
  "data/reddit-ask/r/askscience/comments/pqhqky/can_we_use_viruses_to_genetically_modify_organisms.json": "私の理解では、ウイルスは細胞のDNAに付加してウイルスの工場にします。\n工場にすることができます。しかし、もしウイルスが持っているDNAの一部を交換したら、それは遺伝子の改変を可能にするのではないでしょうか？\n遺伝子組み換えができるのでは？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pqgnhh/is_this_a_good_enough_reason_to_break_up_wsomeone.json": "私(21)と彼(23)は付き合って3年ちょっと。最近になって\nもうこの関係に居たくないと感じています。\n\n彼や関係のことではなく、ただしばらく一人になりたいと感じています。\nしばらく一人になって、自分の人生で何がしたいのかを考えたいんです。本当に、私はただイメージがわかないんです...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pqojmz/why_does_the_american_health_care_debate_fixate.json": "アメリカの医療費はとんでもなく高いのですが、どうやってコストを下げるかではなく、誰に税金をかけるかに注目しているようです。\nどうやってコストを下げるかではなく、誰に課税するかに焦点を当てているようです。なぜ私たちは、コストを削減する方法に目を向けないのでしょうか？\nコストを削減する方法に目を向けないのでしょうか？\n\n明確にするために編集しました：世論は、税金をベースにした単一支払いの医療保険を開発することに集中しているようです。\n基づいた単一支払いの医療保険の開発に集中しているようです。I...",
  "data/reddit-ask/r/askscience/comments/pqoqxd/does_the_abundance_of_plants_that_have_embryonic.json": "ご協力ありがとうございました :)",
  "data/reddit-ask/r/AskHistorians/comments/pqssgg/whats_the_history_behind_the_stereotypical_young.json": "今でも様々なメディアで目にすることがありますが、特大のローリーポップとオーバーオールを伴っているかもしれません。\n大きなロリポップとオーバーオールを伴って。\n大人の男性が子供のように見えるような、コミカルな効果を狙った着こなしにも\n笑いを誘うために、大人の男性に着せることもあるでしょう。\n\n私の疑問は、この帽子がいつ、何のために作られたのか？なぜ今でも...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pqu74c/do_white_people_walk_on_eggshells_when_theyre.json": "私は17歳の黒人の子供ですが、この質問をしたのは、新しい歴史の先生ができたからです。\n歴史の先生は、「人種差別はまだ存在する」というような世界で最も明白なことを言って、黒人に「受け入れられたい」と思っているようです。\n人種差別はまだ存在する」というような、世界で最も明白なことを言って、黒人に「受け入れられたい」ようです。私は間違っているかもしれません。\n私は間違っているかもしれませんが、彼女には負け犬根性があるような気がします...",
  "data/reddit-ask/r/AskHistorians/comments/pqxqib/in_the_parent_trap_1961_the_plot_hinges_on_the.json": "最近、1961年にウォルト・ディズニーが製作したオリジナルの「ペアレント・トラップ」を再見しました。\nウォルト・ディズニーが1961年に作ったものです。この映画の設定は、双子の娘が生まれてすぐに離婚して両親に引き離され、一人の娘は両親に育てられるというものです。\n双子の双子が生まれてすぐに離婚して両親に引き離され、一人の娘がそれぞれの両親に育てられているというものです。\nそして、14年後にお互いを発見します。",
  "data/reddit-ask/r/AskHistorians/comments/pqu0uu/how_long_has_69_been_the_funny_sex_number.json": "人類は何千年も前からそのような活動を楽しんでいたと思われますが\nいつから69という数字と結びついて、よく知られるようになったのでしょうか。\n慣用句になったのは？\n\nアラニス・モリセットが1995年の『Jagged Little Pill』のどこかで使っていたのを覚えています。\nだから、これは20年に一度のことではないと思うのですが...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pr114r/does_this_call_for_being_fired.json": "私の同僚は、5分間私に向かって叫び、大声で私を「バカ女」と呼びました。\n私の上に立ち（私は座っていました）、私の顔に指を指しながら、「バカ女」と大声で言いました。\n私は精神衛生施設で働いています。\n私は精神衛生施設で働いていますが、彼女が......と思うでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pr40ap/is_sex_really_all_that_good.json": "私のユーザー名はチェックアウトされています。しかし、すべての誇大広告やもののように。それは本当にすべてのことですか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pr6tnd/isnt_treating_all_men_as_rapists_because_men_are.json": "私はこれらを2つの同等の苦境として比較するつもりはありません。ただ、私は\n子供の世話をしていると男性は横目で見られるということを彼女に説明した後で、ちょっと考えてみました。\n子供の世話をしていると、男性は横目で見られてしまう。元キャンプカウンセラー、教師、ベビーシッターとして。\nこれは気になる傾向ですね。特に、私は子供を持ちたいと思っているので...",
  "data/reddit-ask/r/AskWomen/comments/pqzfhq/if_you_could_have_the_singing_voice_of_any_female.json": "時代、ジャンル、知名度を問わないシンガー。",
  "data/reddit-ask/r/askscience/comments/pr618y/is_the_uncertainty_principle_basically_because_at.json": "基本的に私の質問は、少なくとも私にとっては、量子スケールが測定を困難にすることは直感的に意味があるように思えます。\n量子スケールが測定を困難にしていることは、直感的に理解できるように思います。\nしかし、多くの人がこのように話しているのを見たことがないので、私が間違った方向に進んでしまったのではないかと思っています。\nと思っています。\n\n例えば、私が測定したいのは...",
  "data/reddit-ask/r/AskHistorians/comments/pr4f42/are_there_muslim_communities_in_spain_to_this_day.json": "私は、今でも重要なイスラム教徒のコミュニティがあるかどうかを知りたいと思いました。\nスペインには、アル・アンダルス時代から存在し、迫害を逃れて今もなお存在している\n迫害を逃れて今も存在しているのでしょうか？\n\nもしあるとすれば、それは大体どこにあるのでしょうか？私は、彼らがどのように\n彼らの...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pr90gz/why_is_it_ok_for_a_woman_to_have_full_control_of.json": "シナリオ：二人の人間が一夜限りの関係を持つ。コンドームが破れる。両方の\n最終的に妊娠したことに気づく。二人はテキサスとは正反対の州に住んでいます。\nの州に住んでいますが、女性は妊娠を維持したいと思っています。男性は\n父親になりたくないし、経済的にも恵まれていないと言う。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pra8w9/my_wife_29f_and_i_28m_have_sex_about_once_a_month.json": "付き合って5年、結婚して1年ほどになります。私たちが初めて出会ったときは\nほぼ毎日1回はセックスしていましたが、徐々に減っていきました。私がその話題を持ち出すと\n私は何度かその話をして、もっと頻繁にしたいと言いました。彼女は自分のせいではないと言います。\n彼女は自分のせいではないと言い張り、いつも何かが起きてしまいます。さらに、...",
  "data/reddit-ask/r/askscience/comments/prb8lk/if_you_use_hormone_blockers_to_stop_puberty_would.json": "トランスジェンダーケアの議論について、ちょっと思ったことがあります。もし子供が\n思春期を阻止するために処方された場合、自分の体が「したい」と思うことを阻止するために永遠に飲み続ける必要があるのでしょうか？\n永遠に飲み続ける必要があるのでしょうか？体が望んでいるからといって\n体がどんなプロセスを試みようともしないので、服用をやめることができるポイントはあるのでしょうか...",
  "data/reddit-ask/r/AskHistorians/comments/prckf0/in_peanuts_an_unseen_adult_character_is_shown_to.json": "ピーナッツ』に登場する短命なキャラクター555 95472は、妹の3と4とともに、みんなが番号付けされていることに不満を持った父親の犠牲になりました。\n犠牲になったのは、父親がみんなに番号を振っていることに不満を持っていたからです。\nどうせ番号付けされるなら、自分たちの郵便番号にしてしまおうと考えたのです。\nどうせ番号がつくなら、郵便番号を名字にしてしまえばいい」と考えたのです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/prcez7/im_a_foreigner_who_has_never_been_to_ihop_how.json": "編集部：「行かない方がいい」というご意見には感謝していますが、たとえお勧めできないとしても\n勧められなくても、私は自分の養子先の国の文化について何かを学びたいと思っています。\n養子先の国の文化を知りたいと思っています。MoMA、カーネギーホール、自由の女神、ワッフルハウス、ラスベガスのストリップ......すべての有名な場所に行きました。\nワッフルハウス、ラスベガス・ストリップ......すべての有名な場所に行ったことがあります。代わりにあなたにお願いしたいのは...",
  "data/reddit-ask/r/AskWomen/comments/pqzkqk/when_did_you_know_a_date_was_over.json": "何かをした、言った？いつごろから「もう行かない」と決めたのですか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/prgm5p/is_sex_really_that_important_in_a_relationship.json": "私はパートナーを見つけましたが、二人ともセックス、つまり性交にそれほど興味がないようです。\nという意味です。そのことを親友に話したら、彼は「どうやってうまくいくんだろう」と言ったんだ。\nと言われました。今、私は混乱しています。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/prhnsq/how_are_people_able_to_eat_ass_without_getting.json": "お尻を食べるという話はよく聞く気がします。そうすると\nとてつもない病気になるのでは？これで死なない人の方が多いのはなぜ？",
  "data/reddit-ask/r/askscience/comments/prfm7t/can_lightning_really_crack_rocks_and_damage.json": "フィクションの中では、稲妻は次のような驚異的な力を持っていると考えられています。\nTNT火薬のように石を砕くことができる驚異的な力だと思われています。自然界では実際にこのようなことが起こるのでしょうか？\n自然界ではどうでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pri12r/is_wanting_to_kill_yourself_actually_bad.json": "残していく人たちはどうするのか」というジレンマを知っているからこそ、興味を持ったのです。\nというジレンマがあります。私には残すべき人がいません。私には楽しい人生はありません。I\n一人暮らしです。気にかけてくれる人もいません。仮にいたとしても、それが何か？もし、私が\n人生の永続性と向き合いたくなければ...",
  "data/reddit-ask/r/NoStupidQuestions/comments/primtt/what_the_hell_does_based_mean.json": "gen z slangに関連して。都会の辞書で調べてみたけど、まだわからない。\n理解できません。それは良いことなのか？悪い言葉なのか？\n\nsimp \"や \"stan \"はだいたいわかるのですが、これはよくわかりません。私はまだ24歳ですが\nまだ24歳なのに、年をとったような気がします。",
  "data/reddit-ask/r/askscience/comments/prjxa0/re_the_current_volcanic_eruption_of_la_palma_and.json": "心配しなくてもいいのでは？",
  "data/reddit-ask/r/NoStupidQuestions/comments/prhrdt/how_do_i_tell_a_family_member_that_their_dreams.json": "実家にいる兄(26M)は、自分が大物になると信じている。\n働かなくてもいいと思っています。私（17M）は彼の目標をサポートしたいと思っています。\n私（17M）は彼の目標をサポートしたいと思っていますが、これは私にとっては絶対に不合理なことです。彼のファンは非常に少なく\n彼のファンは非常に少なく、彼が配信するゲームは下手です。彼には...",
  "data/reddit-ask/r/AskWomen/comments/prbucj/canadian_women_of_reddit_what_are_your_thoughts.json": "同じカナダ人が選挙についてどう感じているのか気になっています。\n煽っているわけではありませんよ。)",
  "data/reddit-ask/r/NoStupidQuestions/comments/prm8cn/do_you_ever_get_post_social_anxiety.json": "人との交流会に参加して、それが楽しくて楽しくて仕方がないのに、家に帰ってから、何でこんなことをしていたんだろうと考えることがあります。\nしかし、家に帰ってから話したことを振り返ってみると、馬鹿なことを言ったとか、冗談を言い過ぎたとか、自分を恥ずかしい存在にしてしまったと感じることがあります。\n私は馬鹿なことを言ったとか、冗談を言い過ぎたとか、自分を恥ずかしい存在にしてしまったとか",
  "data/reddit-ask/r/AskWomen/comments/prhujg/what_is_the_national_goto_drunk_food_in_your.json": "変化するかどうかを確認したいので、このnglには非常に興味があります。",
  "data/reddit-ask/r/AskHistorians/comments/prn9km/tomas_aquinas_wrote_that_animals_do_not_have.json": "動物が本当に苦しんでいないという考えは、愚かなようで、他にどんな言葉で表現したらいいのかわかりません。\n他の言葉で表現することはできません。\n\nしかし、非常に有名で影響力のある2人の思想家が、この考えに同意しているのです。\nこの考えに同意しています。\n\n動物には本当の感情がないという考えは、もしかしたら...と思ってしまいます。\nは...",
  "data/reddit-ask/r/AskHistorians/comments/prqx54/what_is_the_longest_surviving_country.json": "正確には、解散や大きな政権交代がなく、最も長い期間存続している国はどこか？\n解散や大きな政権交代をせずに、最も長く存在している国はどこでしょうか。\n傀儡（かいらい）、革命、帝国主義、その他の理由で）解散したり、政府が大きく変わることなく、最も長く存在している国は？)",
  "data/reddit-ask/r/NoStupidQuestions/comments/prsthz/do_dicks_and_balls_flop_around_when_you_run.json": "バストのある人は、ブラジャーや、特にスポーツブラなど、安定感のあるものを身につけることが多いですよね。\n安定しています。また、クロッチカップがあることも知っています。でも、もしあなたが通りを素早く走ったら\n通りをちょっと走っただけで、彼らはちょっとおかしくなってしまうのでしょうか？(ダジャレですが）。)",
  "data/reddit-ask/r/askscience/comments/prvhou/has_anyone_ever_proposed_a_more_systematic.json": "化学の世界では、便利な任意の名前をつけることがあります（「dihydroge」の代わりに「water」。\n一酸化二水素」ではなく「水」）がありますが、常に化合物の実態を表す予測可能な学名を\nその化合物が実際に何であるかを説明する予測可能な学名が必要です。「一酸化二水素」＝2つの水素と1つの酸素\n一酸化二水素」＝2つの水素と1つの酸素）。)\n\n私は頭が良いとは言えませんが・・・。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/prrmtn/why_is_walking_at_night_considered_so_abnormal.json": "私は普段からやっている人間ですが、少なからず人に\nこの話題になると、私の頭が3つあるような態度をとる人が何人もいました。しかし、究極のケーキの上のアイシングは\n少し前のことです。家族の一人がErの仕事をしていて、「あの夜、歩いていたの？\nと聞かれた。結局、私はその近くにある女子学生クラブの前を歩いていたのです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/prwxiv/how_do_i_tell_my_girlfriend_i_think_she_should.json": "私の彼女は、控えめに言っても繊細です。5年前に付き合い始めて以来\n年前に付き合い始めて以来、彼女は時間とともに徐々に大きくなってきました。私は気にしていませんでしたが\n今では階段を上るときに息が切れるほどになってしまいました。\nまた、正直なところ、彼女に対する私の魅力にも影響を与え始めています....",
  "data/reddit-ask/r/AskHistorians/comments/pryw1n/im_a_traveler_in_ad1200_going_from_lübeck_across.json": "巡礼者ではなく、世俗的な旅行者がどのようにして数百マイルの旅をするのか興味があります。\n巡礼者ではなく、一般の旅行者がどのようにして数百マイルの旅をするのか興味があります。\n\n私は限りなく中流階級に近く、農奴でも貴族でもありません。ただ\n農民兼商人です。\n\nガンダルフ・スタイル」で行くか？ポニーと小さな荷車で物資を運んで...",
  "data/reddit-ask/r/NoStupidQuestions/comments/ps009b/why_are_men_conditioned_to_believe_that_small.json": "私は今までに色々な男性と付き合ってきましたが、おちんちんが小さい人は正直、ベッドの上では素晴らしくて\nベッドの上では素晴らしく、一緒にいてとても楽しかったです。それなのに、私が付き合おうとしていたのは\nある男性と付き合うことになったのですが、その男性は「彼に大きなチンポを期待してはいけない」と発言し続けていて\nしかし、ある男性と付き合うことになり、その男性は「大きなチンポを期待してはいけない」と発言し続け、私は気が滅入ってしまいました。",
  "data/reddit-ask/r/AskHistorians/comments/prutwd/were_man_eating_animals_a_common_problem_during.json": "闇の中の亡霊」をご覧になっていない方は、ぜひご覧になってみてください。\n興味深いですよ\n\nさて、私たちはアフリカかインドかオーストラリアのジャングルの中に鉄道を建設しています。\n蚊の他に、かなりの数の命を奪った危険な動物はいましたか？\nかなりの数の命を奪った危険な動物はいましたか？\n\nもし誰かが望むなら...",
  "data/reddit-ask/r/NoStupidQuestions/comments/ps2ay3/is_it_weird_for_a_20_year_old_male_to_be_friends.json": "一般的な意見としては、私が思っていたように、かなり奇妙だということのようです。\nと思われます。ありがとうございます。",
  "data/reddit-ask/r/NoStupidQuestions/comments/ps6cwd/isnt_it_nice_how_dogs_dont_care_about_if_you_have.json": "彼らは通常、あなたのそばにいたいと思っていて、あなたがどんなに醜くても、どんなに無口でも関係ありません。\nあなたがどんなに醜くても、どんなに無口でも",
  "data/reddit-ask/r/NoStupidQuestions/comments/ps7wc0/accidentally_broke_into_someones_car.json": "今夜は団地の中でdoordashをしていました。私の住んでいるところはもう暗いのですが\n周りには街灯があまりありませんでした。私の車はシルバーの\n日産アルティマです。お客さんに料理を渡すために車を降りて、自分の車と思われるところまで戻ってきて\n自分の車だと思って戻ると、ロックが解除されていませんでした。私はトリプルA...",
  "data/reddit-ask/r/NoStupidQuestions/comments/psbap8/what_is_the_best_way_to_find_a_girlfriend.json": "私の経歴を少し紹介します。私は29歳の男性で、これまで一度も交際したことがありません。\n付き合ったことがありません（まだ童貞です）。社会不安があり、一般的な不安もあります。\n不安があります。主な趣味はビデオゲームで、読書や政治も好きです。\n\n私は信じられないほど孤独で、正直言って何から始めたらいいのかわかりません...。",
  "data/reddit-ask/r/AskHistorians/comments/psflc3/was_there_a_dollar_equivalence_in_the_marshall.json": "ちょっと匂うような9gagの投稿（https://9gag.com/gag/aDdE1wB）があります。\nb*llocks、これは実際に研究されている分野なのか気になりました。  基本的に、それは\nツイッターの投稿には次のように書かれています。   「1960年以来、世界はアフリカへの援助に約9,000億ドル（今日のドルで）を費やしてきました。\nOECDによると、1960年以来、世界はアフリカへの援助に約9,000億ドル（現在のドル換算）を費やしてきました。   「その後...",
  "data/reddit-ask/r/AskHistorians/comments/psdxrm/is_calling_the_first_world_war_that_and_not_the.json": "私は今、1900年という時代と、その前段階である第一次世界大戦について、いろいろと聞いたり読んだりしています。\n第一次世界大戦の前哨戦です。第二次世界大戦のことが頭の片隅にない状態で考えてみると\nバルカン半島、ロシア、オーストリア、ドイツ、さらにはアメリカにまで影響を与えたことを、より広く認識することができました。\nバルカン半島、ロシア、オーストリア、ドイツ、さらにはアメリカにまで影響を与えたことがわかりました。\n\n私からは...",
  "data/reddit-ask/r/AskWomen/comments/psgdmw/what_are_your_thoughts_on_gender_neutral_restrooms.json": "私はイギリスで政府職員をしていますが、私たちの新しい建物には、性別を問わないトイレしかありません。\n小便器もいくつか設置される予定です。\n\nイギリスではジェンダー・ニュートラルなトイレがどんどん導入されています。\nこのことについて皆さんはどう思われますか？あなたは賛成ですか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/psk19x/why_do_people_keep_insist_on_having_kids_if_we.json": "ただ、それはとんでもないことだと思います。誰もが、疑いや不安のある世界に生まれてくるべきではありません。\n疑いと不安の世界に生まれてくるべきではありません。さらに、子供がいないことや、自分の時間に好きなことができることは、言うまでもなく\n自分の時間に好きなことができるということは、子供を育てるより何倍も楽です。\n子供を産まないで、自分の時間に好きなことをしている方が、育てるよりも何倍も楽だということです。子供を産むことを選択するのは、まるで負けたような気がします。",
  "data/reddit-ask/r/AskHistorians/comments/psewmw/at_the_turn_of_the_century_why_was_the_ottoman.json": "オスマン帝国は、ヨーロッパの政治に関して、より多くの発言力を持っていたようで\nフランス、イギリス、ドイツ、ロシアと同じレベルではないにしても、軍事的にはかなり強大な力を持っていました。\nフランス、イギリス、ドイツ、ロシアと同じレベルではないにしても、軍事的にはかなり手強い存在でした。一方、スペインとポルトガルはこのレベルには到底及ばず\n一方、スペインとポルトガルはこのレベルには遠く及ばず、この時点では帝国を失っていました。つまり...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/psf61p/if_the_vagina_doesnt_stretch_or_change_as_a.json": "私は処女ですが、検診の際には「処女ですか」と聞かれます。\n処女であるかどうかを聞かれますが、その場合は、より小さな検鏡を使用して\nと聞かれます。膣は単に伸びて元に戻ると理解していたので、これには戸惑いました。\n私の理解では、膣は単に伸びて元の大きさに戻るだけだと思っていたので、これには戸惑いました...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ps7e2v/why_is_the_gabby_petito_case_getting_so_much_more.json": "これが注目に値しないと言っているわけではありませんし、よく知られるべきだと思います。\nしかし、このような事件は毎日のように起きているように思えます。\nしかし、このような事件が毎日のように起きている中で、なぜこの事件が話題になったのでしょうか？",
  "data/reddit-ask/r/askphilosophy/comments/ps99i0/how_can_philosophers_hold_certain_extreme_beliefs.json": "タイトルにもあるように、哲学者はあることを信じているにもかかわらず、そのことが真実ではないか、自分には当てはまらないかのように生きていることがあります。\n哲学者は、あることを信じながら、それが真実ではないか、自分には関係ないかのように生活することができるでしょうか。\n私の質問は、偽善が含まれているかどうかということです。\n個人としてのジョンと、個人としてのジョンとの間に、偽善があるのか、あるいは分離があるのか、ということです。",
  "data/reddit-ask/r/askscience/comments/psn46o/why_does_the_immune_system_take_so_long_years_to.json": "私は医療についての理解が浅いです。しかし、私には、免疫システムは\n免疫システムは通常、数週間から数ヶ月以内にウイルス感染に対処することができます。\n数ヶ月で対処できるようです。しかし、HPVウイルスは何年もかかることがあります。\n倒すのに何年もかかることがあります。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/psqigq/why_do_we_mock_those_untrusting_of_government.json": "クリートゥスとその仲間たちは、おそらく無学で愚かな存在であると理解しています。\nしかし、政府を信用していないことで彼らを馬鹿にするのはどうかと思います。\n政府の乱用の長い長い検証可能な実績があり、長い間透明性に欠けていて\nしかし、なぜ彼らが政府を信用しないことを馬鹿にするのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/psoxq7/if_a_roman_soldier_from_the_2nd_century_were_to.json": "装備の違いを超えて、彼は基本的な慣習や戦術、構造を理解しているだろうか。\n軍隊の基本的な慣習、戦術、構造を理解しているでしょうか？それとも、ほとんどすべてが初めての経験になるのでしょうか？\n\n彼の視点から見ると、軍隊の全体的な訓練と規律は変化しているだろうか？\n彼の視点から見ると、軍隊の全体的な訓練と規律は大きく変わったと思われるだろうか。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pstzv8/my_girlfriend_never_wants_to_do_the_work_when_we.json": "長い話になりますが、私の関係は4年以上続いていて、私はセックスを楽しんでいます。\n彼女は僕が興味を持てば毎日でもいいと言っていますが、僕の性欲は彼女ほど高くないようです。\n私の性欲は彼女ほど高くないようです。私は彼女に何かを始めて欲しいと言っています。\n私は彼女に何かを始めて、上に乗ったり、仕事をしたりするように言うのですが、彼女は非常に固執します...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pswxhi/17_year_old_unvaxxed_wanting_to_get_vaccinated.json": "私は17歳で、私の住んでいる州（カナダ）では、法的にVISAの取得が認められています。\n私は17歳で、私の住んでいる州（カナダ）では、親の確認なしに法的にワクチンを受けることができます。私はそれを取得することを考えてきました\n親に隠れて接種しようと考えていましたが、新しく導入されたワクチン\nパスポートは、私のもう一つのモチベーションになっています。\n\nこのパスポート...",
  "data/reddit-ask/r/AskWomen/comments/pso6x5/why_do_you_feel_safe_or_unsafe_on_reddit.json": "初めてのランド脅威を報告しなければなりませんでした。他にどれだけの人がこのような問題に直面しているのか\nしているのでしょうか？\n\nUPDATE: 回答をくださった皆さん、本当にありがとうございました。嬉しいのは、このように\n私たちの大部分が安全を保つ方法を見つけられて嬉しいです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/psxbjo/why_is_gabby_petito_such_a_big_deal_when_there.json": "失礼な言い方かもしれませんが、なぜ彼女のケースが全国的に注目されているのか、正直わかりません。\n他の何千もの同じようなケースが話題にならないのに、なぜ彼女のケースが全国的に注目されているのか、正直わかりません。\n何か特別な理由でもあるのでしょうか？\n\n非常に悲劇的な出来事であることは間違いありませんが、私が理解しようとしているのは、何が...\nワラント...",
  "data/reddit-ask/r/NoStupidQuestions/comments/psyaif/if_no_id_is_required_to_vote_in_the_us_how_do.json": "私はアメリカ人ではありませんが、それは私を悩ませます。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/psyrr3/will_i_stop_ever_getting_boners_by_just_looking.json": "私の彼女は、些細なことでもいつも私を興奮させてくれます。\nハグしたり、抱き合ったり、キスをしたり、仲良くしたり、ちょっとした体の触れ合い。時には、彼女を長時間見ているだけで\n長時間彼女を見ているだけでも勃起してきます。明らかに私は\nもちろん、タイミングが合えば勃起したいと思っていますが、なんだか...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pt1afi/why_do_some_murder_or_disappearing_person_cases.json": "この質問は、ギャビー・プティートの調査によってもたらされたものです。\n筋違いや無神経と思われるかもしれませんが、なぜ彼女の死が、毎日起こっている他の殺人事件よりも大きな反響を呼ぶのでしょうか？\nなぜ彼女の死は、毎日起こっている他の殺人事件よりも大きな反応を示すのでしょうか？起こってしまったことはひどく、恐ろしいことです。\n起こってしまったことは恐ろしいことですが、私には理由がわかりません。\n\nこの...",
  "data/reddit-ask/r/AskHistorians/comments/pt0gc4/to_what_extent_is_modern_european_and_western.json": "植民地主義や帝国主義に参加した過去の国々が多大な利益を得たことは明らかです。\n帝国主義に参加した過去の国々は多大な利益を得ましたが、長期的にはどのような影響があるのでしょうか？\n豊かさや経済的な強さにどのような長期的影響があるのでしょうか？直接的な参加だけではなく\n間接的にも、例えば北欧諸国のように、参加しなかった...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pt4qx4/why_do_so_many_people_in_america_not_know_how.json": "米国の第10条では、言論の自由は、政府の干渉を受けずに自分の意見を持ち、それを自由に表現する権利を保護しています。\n自分の意見を持ち、それを政府の干渉を受けずに自由に表現する権利を\n表現する権利を保護しています。基本的に政府は、あなたの発言に対して法律を制定したり、罰したりすることはできません。\nこれは素晴らしいことです。\n\nこれは素晴らしいことです！しかし、私がよく目にするのは、誰かがこう言うことです。",
  "data/reddit-ask/r/AskHistorians/comments/pszdae/why_wasnt_nixtamalization_popular.json": "ニクタマリゼーション（トウモロコシを石灰岩の溶液に浸すこと）は、アステカや一部のアメリカ原住民が何世紀にもわたって行ってきたことだと読みました。\nアステカやアメリカの原住民が何世紀も前から行っていた）は、トウモロコシの栄養価を大幅に\nトウモロコシの栄養価を大幅に向上させることができます。なぜ他の国ではこの方法が採用されないのでしょうか？私は\nヨーロッパでは数多くの栄養失調や飢饉が発生していますが、これは...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pt5v6x/how_to_check_into_a_hotel.json": "批判しないでください。私は社会不安とASDを持つ若い成人で、多くの交流があります。\n私は社交不安とASDを持つ若い成人で、多くの交流がありますが、その「台本」を知りません。私が知りたいのは、ホテルにチェックインするときに、あなたは何をするか、何を言うかです。\nホテルにチェックインするとき、もしあなたがオンラインで予約して支払いを済ませていたら、あなたは何をしたり、何を言ったりしますか？\n既に予約済みです。受付に行って...何を言うの？",
  "data/reddit-ask/r/AskWomen/comments/pt20uc/how_did_you_introduce_an_adult_toy_into_your.json": "それはあなたのパートナーとの問題でしたか？もしそうなら、大人のおもちゃに対する相手の気持ちをどうやって和らげましたか？\n大人のおもちゃに対する気持ちをどうやって和らげましたか？コミュニケーションや本音などが大切なのはわかっていますが\n重要だと思います。具体的に何をして、効果がありましたか？ありがとうございます。",
  "data/reddit-ask/r/NoStupidQuestions/comments/ptcats/meth_isnt_a_cool_drug_so_why_do_people_try_it.json": "覚醒剤中毒について理解できないことは、人々がどのようにして覚醒剤を試してしまうかということです。\nそもそも試してしまうのかということです。他の薬物については、なんとなく理解できます。ある種の神秘性やロマンチックさが\n神秘性やロマンティシズムがあります。マリファナは、チーチ・アンド・チョンのようなゆったりとした雰囲気がある。\nエクスタシーやコカインは、パーティーや楽しい時間を過ごすことを連想させます。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ptdsd4/why_does_the_popular_narrative_focus_so_much_on.json": "前置きが長くなりましたが、私は、超富裕層の方々は、自分たちの生活に必要なお金を払っていないと確信しています。\nバイデン氏の税制改革は十分ではないと思います。\n\nしかし、もし私たちが公平な税制を手に入れて、ベゾスやマスクが公平な負担をするようになったとしましょう。\nやMuskが公平な負担をするようになったとしましょう。するとどうなるでしょう？何かが止まる...",
  "data/reddit-ask/r/askscience/comments/pt9gpj/why_do_soybeans_curd_why_dont_other_legumes_curd.json": "豆腐の代わりになるものを探していました。私の食料品店には\n大豆はありません。豆腐」を作ることができる、代替のマメ科植物はすべて、作られています。\nミルク状にしてペースト状にしてから冷やします。大豆入りの豆腐は\nモッツァレラのようなものです（低温殺菌牛乳使用時）。大豆は...",
  "data/reddit-ask/r/AskHistorians/comments/ptahc5/13rd_of_all_norwegians_moved_from_norway_to.json": "アイルランド人を失った英国は、多くの国会議員がそれを許容範囲内の損失と考えたようです。\nドイツ人やイタリア人の割合は、イギリスの中でも最も多いと言われています。\n人口に占めるドイツ人やイタリア人の割合はもっと低かったのです。ドイツは移民によって数百万人を失いましたが\nドイツは移民によって数百万人を失いましたが、その打撃を吸収するために数千万人を抱えていました、同様に...",
  "data/reddit-ask/r/AskHistorians/comments/ptd6rx/its_thought_that_ernest_hemingway_killed_himself.json": "これがKGBのレベルに達したのか？誰もが隣人を告発する？これは\n膨大なマンパワーが必要なように思えますが、監視のためだけに人が派遣されたのでしょうか？\n監視するためだけに派遣されたのでしょうか？\n\n私がこのアイデアを得た記事へのリンク\n\nhttps://www.theguardian.com/books/2011/jul/03/fbi-and-ernest-hemingway",
  "data/reddit-ask/r/NoStupidQuestions/comments/ptas0u/what_are_insects_doing_when_they_just_sit.json": "例えば、バスルームに虫除けのクモを飼っているのですが、そのクモが\n次の食事が来るまで何時間もそこに座っています。\n食べた後は、ほとんど何もせずにじっとしているだけです。\n\n考え事をしたり、退屈したり、何をしているのでしょうか...",
  "data/reddit-ask/r/AskHistorians/comments/pt32er/why_werent_there_more_suicides_during_historic.json": "例えば、私はドイツ人ですが、第二次世界大戦末期にロシア軍がドイツに侵攻した際、多くの自殺者が出たことを知りました。\n私はドイツ人ですが、第二次世界大戦の終わりにロシア人がドイツに侵攻したとき、多くの自殺者が出たことを知りました。また、戦後にガスが復活した途端、多くの人々が自殺したという話もあります。\n私はドイツ人です。しかし\n強制収容所などでの自殺についてはほとんど書かれていません。\n\nもちろん...。",
  "data/reddit-ask/r/askscience/comments/ptdjbx/do_viruses_eventually_reach_some_stable_optimal.json": "予めお断りしておきますが、私は生物学の理解が浅く、さらにウイルス学の理解も浅いので\nそのため、非常に画一的な質問になってしまうかもしれません。ウイルスは、その遺伝情報を\n遺伝情報はRNAにコード化されていると理解しています。RNAは次のような構成になっています。\nいくつかの塩基の組み合わせ（ACUG）で構成されていて、これらの組み合わせは...",
  "data/reddit-ask/r/AskHistorians/comments/pt3hoq/marco_polo_claimed_human_flesh_was_sold_for_food.json": "マルコポーロが書いた記述（というか、ラスティケロが書いた記述）を見ると\n福建省では人肉が他の肉と一緒に食用として売られていたことを示唆している。\n福建省では人肉が他の種類の肉と一緒に食用として売られていた。この記述がなされた時、この都市は包囲されていなかったので\nこのカニバリズムの事例は、極端な...が原因ではない。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ptnoe7/are_modern_headlights_way_too_bright_or_am_i_too.json": "バートアイボール...なぜLEDを使うのか疑問です。私の窓からはヘッドライトしか見えません。\n全然見えないんです。日中でないと運転もできません。予定を変更して\nスケジュールを変更しなければならない。\n\n古い車を除けば、それほど悪くはない。それほど悪くないよ。\n\n請求書の支払いがあるので、ドアダッシュで運転していますが、私は...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/ptlbex/anyone_else_feel_that_the_taste_of_a_drink.json": "アイスコーヒーはガラスのカップでしか飲まない。それ以外のものを使うと変な味がするんです。\n変な味がします。紙コップのアイスコーヒーは最悪です。でもこれは\n紙の味がわかるので、納得できます。\n\n同様に、瓶ビールはグラスに注がれたビールよりも劣る。\n\n誰か...",
  "data/reddit-ask/r/NoStupidQuestions/comments/ptmtvq/if_the_word_for_something_that_looks_like_a_dick.json": "美術の授業でジョージア・オキーフの絵を見ていたのですが、その時はまだ\n言葉が出てきませんでした。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pt88fe/is_cheating_really_an_accident.json": "テレビ番組や映画では、登場人物がパートナーを裏切ると、たいていの場合は\nテレビ番組や映画では、主人公がパートナーを裏切ると、たいていの場合、「おっと、こんなことになっちゃった」という感じで表示されます。人は本当に浮気をしますか？\n偶然？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ptlia9/is_it_wrong_to_be_disturbed_by_the_celebration_of.json": "Redditでの死の賛美に心を痛めている人はいませんか？\n\nさて聞いてください、私はこのように始めたいと思います。\n\n 1. 私は反バクテリアではありません。\n 2. 私はCOVIDに対して完全に予防接種を受けています。\n 3. ワクチンは安全で効果的であり、誰もが早急に接種すべきであると認識しています。\n    早急に接種すべきです。\n 4. 私は、それらの...",
  "data/reddit-ask/r/askscience/comments/ptsno7/why_is_the_dark_matter_halo_spherical.json": "不遜な科学者ですが、ご容赦ください。私の理解では、銀河は円盤状になっています。\n銀河は角運動量の保存のために円盤状になっていると理解していますが、私が見た暗黒物質に関するすべてのデータでは\n私が見た暗黒物質に関するすべてのデータは、それが銀河の周りにほぼ球状に分布していると言っています。\nしかし、私が見たダークマターのデータでは、ダークマターは銀河の周りにほぼ球状に分布しているというものでした。これはなぜなのか、何か説があるのでしょうか？それとも...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pttr1v/has_there_ever_been_a_vaccine_causing_problems_to.json": "そう、私はそれを受け取ることに躊躇しているのです。そのことで私を批判してください。私は間違った情報を広めているわけではありません。\n誤った情報を広めているわけではありません。誤報と言われていることに疑問を持っているのです。\nこのことで禁止されても、私は気にしません。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ptmiej/how_many_of_you_never_did_any_drugs_or_alcohol.json": "私は、17歳の弟に、薬物やアルコールをやったことがあるかどうか、また、誘われたことがあるかどうかを尋ねました。\nと聞いたところ、「ない」と答えました。\n私は15歳までにドラッグやアルコールをやっていたことを知っているからです。\n\n皆さんの中で、実際に高校生活を全うした方はいらっしゃいますか？",
  "data/reddit-ask/r/AskHistorians/comments/pttu83/why_was_the_german_military_not_nazified_like_the.json": "私の理解では、ナチスが権力を握ると、基本的に市民社会のあらゆる側面をナチスの機関に変えてしまいました。\n市民社会のあらゆる側面をナチスの機関に変えてしまいました。最も有名なのは、ヒトラー・ユース\n特に有名なのはヒトラー青年団で、すべての青年団に取って代わりました。\n\nしかし、ドイツ軍は基本的にプロイセン人の支配下にありました。\n軍の専門家や貴族が管理していました。",
  "data/reddit-ask/r/askscience/comments/ptgjsl/why_dont_we_feel_air_pressure.json": "私が見てきた標準的な説明では、これは私たちの両側にある空気が均等に押し出されているからだと言われています。\n均等に押しているからというのが一般的な説明ですが、必ずしもそうとは限りません。例えば、テーブルの上に平らに手を置いた場合\n机の上に手を置いた場合、手の下には大気からの圧力と釣り合う空気がありません。\n手の下には空気がないので、大気からの圧力と釣り合いません。\n\nその点を除けば、...",
  "data/reddit-ask/r/AskHistorians/comments/ptwg9n/medieval_japanese_people_had_their_height.json": "魚は大量に手に入れることができます。私はそれがわからない。\n\n読んでみると、どうやらスパルタ人は平均的なギリシャ人よりも背が高かったようで、それは\n豊かな牧草地のおかげで、魚の多い食事とは対照的だったそうです。",
  "data/reddit-ask/r/AskWomen/comments/ptwu3u/how_did_you_tell_the_stylist_you_hate_what_they.json": "スタイリストの対応はどうだったのでしょうか。気まずかったですか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pu1jia/when_did_the_95_job_become_the_85.json": "真面目な話、9-5なんてあったの？\n\nどこの国でも、8時にスタートして5時に退社し、その間に無給の昼食を取るのが普通のようです。\nその間に無給の昼食があるというのが普通のようです。\n\n9-5という言葉がどこから来たのかわからない",
  "data/reddit-ask/r/askscience/comments/pu7o0e/why_havent_we_selected_for_avocados_with_smaller.json": "他の多くの果物や野菜は、農家が品種を選択して育てています。\n種子の大きさがどんどん小さくなっていきます。しかし、市販されているアボカドは、いまだに\n果実の質量の大部分を占める大きな石があります。なぜでしょう？",
  "data/reddit-ask/r/AskWomen/comments/pu6nnc/women_of_reddit_what_symptoms_of_mental_illness.json": "自分が心の病であることを知っていてもいなくても、長い間、心の病とは結びつかなかったことがあなたの身に起こります。\n長い間、心の病と結びつかなかったことはありますか？なぜ精神疾患だと気づかなかったのか？\nなぜそれが心の病だと気づかなかったのか、何が原因でそう思ったのか。\n感情的、精神的、身体的、職業的、対人的...。何でも結構です。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ptxd0n/women_of_reddit_does_it_weird_you_out_when_guys.json": "正直なところ、彼らがいれば私は一目見ることができます。まるで私の目が\n自動的にそうする。もちろん、誰かを不快にさせるようなことはしたくありません。\n不快な思いをさせたくありません。女性の視点から見て、誰かにオッパイをチェックされるのはどんな感じですか？\n女性の視点では、誰かに胸をチェックされたとき、どのように感じますか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pu47if/when_western_people_say_we_should_grab_something.json": "私の国（韓国）では、このようなフレーズは通常、親しみを込めた挨拶であり、実際の意味を持つことはほとんどありません。\n私の国（韓国）では、このような言い回しは通常、親しみを込めた別れの挨拶であり、実際に相手をつかまえる意図を示すことはほとんどありません。\nることはほとんどありません。この言葉を聞いた後に誰かと約束をしようとすると\nこの言葉を聞いた後に誰かと約束をしようとすると、きっと気まずい思いをすることになるでしょう。迷ったのですが...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pu9z4y/why_do_we_tend_to_censor_sexnudity_more_strictly.json": "先日、テレビ番組「スーパーナチュラル」を見ていたら、斬首のエピソードがありました。\n斬首されたエピソードを見ました。この番組の年齢区分はTV-14です。\n\nこれを見て不思議に思ったのですが、なぜこのような、首を切り落とすような、ある程度明確な暴力行為を伴うものが\n暴力行為がはっきりしているのに、なぜTV-14になっているのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/pu1ucr/tiananmen_1989_is_it_true_that_the_chinese_army.json": "これはredditやその他の場所で頻繁に言及されていますが、それは本当ですか？\nまた、それを記録したとする写真は信頼できるソースからのものですか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pu0vpp/why_do_we_normalize_getting_fat.json": "私は25Mで、ディープサウスに住んでいます。私は6フィート2インチで180ポンドです。アクティブな生活をしています。\nクリーンな食事をしています。同僚のほとんどは、ランチにサラダを持ってくることを嘲笑します。\nランチにサラダを持ってきたり、休憩中に歩いたりしていると、同僚から嘲笑されます。頑張るのはやめようといつも言われています。\n頑張らなくても代謝が追いついてくるし、どんなものを食べているのか...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/puco1r/is_it_bad_to_cry_as_a_male_when_your_dog_dies.json": "2週間以内に愛犬を処分しなければなりません。\n泣いたり落ち込んだりするのは変なことなのかどうかわからないんです。",
  "data/reddit-ask/r/askphilosophy/comments/pts5w2/why_is_there_such_strong_disdain_towards.json": "私が軽蔑しているというのは、最近いくつかの論文や記事を読んだところ、通常のSOS批判と並んで\n二元論や汎精神論のようなものに対する通常の批判に加えて、多くの人が本当にemotionalな反応をしているようです。\n多くの人が、本当に.... 感情的な反応をしているようなのです。\n侮辱や流行語を使っていたり、ただ...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pudb2k/how_does_rain_not_kill_you_when_it_falls.json": "橋から何かを落としたり、山から小石を投げたりすると、誰かを殺してしまうようなことがあるじゃないですか。\n山から小石を投げると人が死ぬかもしれませんよね？追加のボーナス質問です。私はバカですか？\nバカなの？",
  "data/reddit-ask/r/NoStupidQuestions/comments/ptw6nr/what_are_some_ways_to_make_50100_dollars_in_under.json": "その金額が必要なのに、どうやって手に入れようかと悩んでいます。I\n借りればいいのかもしれませんが、それでは問題が大きくなってしまいます。何かアイデアはないだろうか？\n\nまた、私は免許を持っていませんが、万が一、ユーバーやデリバリーを提案された場合には",
  "data/reddit-ask/r/AskHistorians/comments/puajsq/were_any_american_religious_organizations.json": "https://en.wikipedia.org/wiki/The_Apotheosis_of_Washington\n\nアメリカのカフェには、神々の中にワシントンが描かれた巨大な壁画があります。\nアメリカの国会議事堂には、神々の中にワシントンが描かれた巨大な壁画があります。これは確かに...面白いですね。確かに、この壁画には\nアメリカ人が建国の父たちをどのように扱っているかについて、多くのことが書かれています。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/puc9m0/do_you_ever_get_secretly_enraged_when_hearing.json": "編集部：私が言いたいことは、赤ちゃんよりも子供の方がより包括的な言葉だと思います。I\n親が全く何もせず、子供を無視していると特に腹が立ちます。\n特に腹が立つのは、親が全く何もせず、子供を無視している場合です。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pujnmp/why_is_it_okay_for_us_to_point_out_imperfections.json": "体重に敏感な人たちが、自分の体重を認めようとしないのは、とても滑稽なことだと思います。\n自分で直接コントロールできることを認めようとしない...。私は「デブ恐怖症」などではありません。\n私は「デブ嫌い」などではなく、これが一般的な傾向だと気づいただけです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pufmdv/how_come_people_almost_universally_say_vagina.json": "私の解剖学的な理解が正しければ、膣口は外側の部分で、誰もが扱う部分であり\n膣はその奥にある管です。\n膣はそこからさらに奥へと続く管で...。",
  "data/reddit-ask/r/AskHistorians/comments/pueq0k/i_saw_on_rhistoryporn_a_antikkk_group_called_the.json": "新聞に掲載されている写真を見ると、正直なところKKKを揶揄しているようにも見えました。\nKKKを揶揄しているようにも見えたのですが、万が一私が間違っていたら、どなたか教えてください。\n誰か教えてください。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pum9az/is_fuck_the_most_versatile_word_in_the_english.json": "fuck this, we're fucked, go fuck yourself, fuck!!!, I don't give a fuck,\nfuck-all, fuck off, for fuck's sake, fucked over, you do this all the fucking time, fuck me dead, what the fuck (すべての否定的な意味合い)\nfuck me dead, what the fuck (すべての否定的な意味合い)\n\nOR!\n\nこれはクソかっこいい/クソすごい、ファックイェー、ファックしよう、私はしたい...",
  "data/reddit-ask/r/askscience/comments/pukavf/you_can_get_yellow_either_by_having_monochromatic.json": "異なる周波数の光を混ぜても、新しい単色の光は生まれません。\nそれぞれの周波数が重なり合ったものだからです。では、なぜ\nRGBの色を組み合わせると、光の周波数を変えて得られる色と同じ色になるのはなぜでしょうか？\n光の周波数を変えて得られる色と同じ色になるのはなぜでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/punqi1/scooby_doo_has_an_episode_where_scooby_wins_1.json": "1) 100万ドルの連邦政府の現金は、今日では何の価値もないでしょう。\nコレクターズアイテムでも何でも。\n\n2）連合軍の現金は本当に使われていたのか？当時の銀行では使われていたのか？\n\n3）100万ドルの連邦政府の現金をため込むような人はいたのでしょうか？\nそして、100万ドルもの連邦政府のお金をためる人がいたでしょうか？\n\nただの興味本位ですが...。",
  "data/reddit-ask/r/AskWomen/comments/pulttn/how_old_are_you_and_whats_the_most_important.json": "編集部：うわー！？いろいろな反応があってすごいですね。ありがとうございます。頑張って\n全部読んで返信しようと思っています。どんどん来てね❣️。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pur9pt/why_do_gay_people_talk_like_that.json": "決して同族嫌悪や憎悪を込めているわけではありません。ただ、興味があるだけです。\nそのようなことを言う人のほとんどは、すぐにゲイだと思ってしまいますし、ほとんどの人は\nそして、ほとんどの場合、私は正しかったのです。\n\nこれは人種の問題ではなく、白人と黒人が同じように話すのを聞いたことがあるからです。\n話すのを聞いたことがあります。\n\nでは、質問に戻ります。あなたは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/puv8ik/i_genuinely_feel_nothing_towards_my_own_newborn.json": "Edit 2; この投稿は爆破されているので、私はただコメントをTLDRするつもりです。\n同じような経験をしている人のためにコメントを書きます。\n疑問が解消されて、とても気分が良くなりました。\n\n1) 産後は男性にもあります。もしそう感じたら、自分自身を教育してください。\n恐れずに助けを求めてください。そして...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pus5fl/the_vagina_is_super_close_to_the_butthole_does.json": "昨晩、私と彼女はドギー・スタイルの体勢で愛し合っていました。で、気がついたら\n肛門は思っていたよりもずっと膣に近いんだよね。それは何か問題を起こすでしょうか？\n問題ない？例えば、なぜそのようになっているのか？私は今でも女友達の穴を見ると興奮します。\nしかし、私の好奇心はそれがどのようなものであるかを考えさせます。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/puu7vx/do_bald_people_hear_water_tapping_on_their_head.json": "今日は雨が降っていましたが、傘をささずに行動するハゲを見かけました。\n傘をささずに過ごしていた。私は今、重大な疑問を持っています。",
  "data/reddit-ask/r/askscience/comments/puudpz/can_anything_in_the_universe_travel_faster_than.json": "馬鹿げた質問かもしれませんが、それは可能ですか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/puxzfh/are_sex_clubs_real.json": "セックスクラブ」と呼ぶ人がいるのを聞いたことがありますし、テレビでも何度か見たことがあります。\n描かれているのを何度か見たことがあります。お金持ちだけのものなのか、過去のものなのか、都市伝説なのか。\n都市伝説なのか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/puuaau/what_is_the_reload_time_on_toilets.json": "適切な言葉を知らないが、私のトイレは再び水を流せるようになるまで10分はかかると思う。\n一方、私の学校のトイレは何十回も連続して流しても問題ありません。\n私の学校のトイレは何十回も連続して流しても問題ありません。なぜ、どうやって？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pv2v0e/is_it_bad_feeling_guilty_after_wanking.json": "オナるたびに片思いの女の子のことを考え始めるんだけど、絶対に\nそんなことをしている間は彼女のことを考えたくないんだ、なんだか気味が悪いし\n気持ち悪いし、楽しむこともできない。\n\n私の説明が悪かったようです。私が言いたかったのは、私は以下のように感じています。\n彼女が必要なんだ...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pv0i5r/how_does_anything_exist_at_all_and_why_does.json": "だから、私は人生を理解しようとしているのです。厳密に科学を信じるか、宗教を信じるかに関わらず\n厳密に科学を信じるか、宗教を信じるかに関わらず、どうやって何かが存在するのか？何もないはずなのに\n何もないはずなのに、何もないというのはどのようなものなのでしょうか？それはただの黒ではないでしょう\nそれは何かがあるからです。つまり、何かが存在するということを超えて...",
  "data/reddit-ask/r/NoStupidQuestions/comments/puz78v/why_did_many_us_soldiers_date_or_come_back_with.json": "これは馬鹿げた質問だと理解していますが、主に、軍隊がなったのは\n現地の人との関係に厳しくなったのか？\n\nベトナムでは独身女性が増えたのでしょうか？中近東の女性は、アメリカ人と二人きりになると\n中東の女性は、アメリカ人男性と二人きりになると、非常に厳しい結果になるのでしょうか？それとも\nそれとも、アジアン・フェティッシュは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/puw7h2/why_do_some_people_refuse_to_wash_their_hands.json": "パンデミックの時に一番気になっていた。トイレの個室を持っている人が\nストールを持っていても手を洗わない人がいます。ある女性がトイレから出てきて、流れる蛇口の前に立って髪を整えた後、洗わずに出て行くのを見ました。\n洗面所から出てきた女性が、流れる蛇口の前で髪を整え、洗わずに出て行くのを見ました。I\n私の家族には、トイレの後に手を洗わないことで有名な人がいます。",
  "data/reddit-ask/r/AskWomen/comments/pv3okv/when_did_you_realise_how_much_women_do_to_protect.json": "私の気づきのストーリー、コンテクストはコメントにあります。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pv54sv/todays_release_by_the_lancet_refers_to_people.json": "*アソコのある人ではなく、アソコのある体。",
  "data/reddit-ask/r/askphilosophy/comments/puo7ay/is_it_conceptually_impossible_for_there_to_have.json": "私が誰かに「無」とは何かを説明するとき、私はまるで無の「存在」を誓っているようです。\n無の「存在」を約束しているようなものだ。しかし、もし何かが存在するのであれば、何もないわけではありません。\n何もない。これは私の表現が間違っているのか、それとも言葉の限界なのか。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pv6ct3/do_other_men_feel_jealousuncomfortable_when_their.json": "私は男性であり、そのように感じています。他の男性も私と同じようなことをしているのか知りたかったのです。\n男性が他の女性を見ていることに不満を持っている女性はたくさんいますが\n私は他の男性が私と同じように感じているのか知りたかったのです。\n\n編集部：時と場所と相手によって違いがあると思いますか（メディアの場合。\n知らない人が...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pupdse/do_schools_in_america_not_use_physical_punishment.json": "アメリカの友人と話をしていて、私の学校では違反した人には鞭打ちをすると言ったら、とても心配しているようでした。\n私の学校では、ルールを破った人には鞭を打つのよ」と言うと、とても心配そうにしていました。",
  "data/reddit-ask/r/askscience/comments/pv5kfv/why_the_exhaust_gas_of_a_rocket_engine_or_a_jet.json": "推力について個人的に勉強していたときに、ロケットエンジンの\nロケットエンジンの収束・発散ノズルについて読んでいると、燃焼室を出た排気ガスがマッハ1になると\n燃焼室を出た排気ガスがマッハ1になると、排気ガスは\n圧縮性流体の速度（ここではマッハ...",
  "data/reddit-ask/r/AskHistorians/comments/pv6z4y/how_did_the_ancients_interpret_the_delay_between.json": "光の速さや音の速さの理解は非常に新しいものですが\nしかし、それは常に観測可能でした。人々はいつ頃からそれを理解し始めたのでしょうか？2,000年前の人がどのように\n2,000年前の人はどう理解していたのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pvati5/if_there_is_a_gender_pay_gap_for_the_same_job_why.json": "これと似たような投稿がありましたが、多くの研究が、異なる職種の男女の給与を比較していることを説明しています。\n男性と女性の給与を異なる仕事で比較する研究が多いことを説明しています。しかし、私は\n同じ仕事での給与比較に興味があります。私は工学部の学生で、最終学期の一環として\n私は工学系の学生で、最終学期の一環として、議論を含むクラスを取っています。",
  "data/reddit-ask/r/AskHistorians/comments/puv7db/what_prejudices_would_a_german_jewish_veteran_of.json": "r/interestingasfuck [/r/interestingasfuck]に面白い投稿がありました（ここまでが\nユダヤ人の退役軍人が、自分の店の前にナチスのポスターを貼られているという写真です。\n彼の店の外にナチスが貼られているという写真です。コメントを掘り下げてみると、これはリチャード・スターンではないかと思われます。\n- ドイツ系ユダヤ人で、後にアメリカ軍に入隊して...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pvee5j/do_most_guys_actually_not_know_anything_about_the.json": "私は、「男はクリトリスを見つけられない」というステレオタイプを聞いて育ちました。\n男はクリトリスを見つけられない」というステレオタイプを聞いて育った私は、それがいつも悪い男性の恋人を犠牲にしたジョークだと思っていました。\n男なら誰でも知っていることだと思っていました。しかし、私は最近、ある性体験をしました。\n褒められたことがありました。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pvh7ie/why_do_companies_think_that_interrupting_videos.json": "私にとっては、その製品を嫌いになるだけです。みんなに迷惑をかけているんじゃないの？\nこの30秒の広告が私の食事の時間のビデオを邪魔している。\nこの30秒の広告は素晴らしい。\n\nなぜこのような広告が人気なのでしょうか？私は一般的な話をしていますが、誰もが思い当たることがあると思います。\n私は一般的な話をしていますが、私は誰もが特定の...を考えることができます。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pvb9kb/do_women_like_shaving_their_legs.json": "私個人は若い女性ですが、足の毛を剃ることにあまり抵抗がありません。それはただ\n時間がかかるし、脚が毛深いのは気にならないんです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pv2geu/who_would_win_an_olympic_length_triathlon_out_of.json": "スイマーは、プロのスイマーが非プロのスイマーに比べて非常に速いからだと思います。\n思う。しかし、それぞれの種目で他の2人に勝つために、乗り越えられないほどのリードを築くかどうかはわかりません。\n他の2人に勝てるほどのリードを築けるかどうか...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pvf1wn/why_do_american_movies_make_it_look_like_only.json": "アメリカの映画では、浮浪者や酔っぱらい、精神的に病んでいる人、怪しい人、奇妙な性格の人だけがバスに乗るというテーマになっている気がします。\nアメリカの映画では、浮浪者、酔っぱらい、精神病者、怪しい人、変な人しかバスに乗らないというテーマになっている気がします。\n\nアメリカでは普通の人はバスに乗らないの？きっとそうなんでしょうね。",
  "data/reddit-ask/r/AskHistorians/comments/pv8tyd/i_read_burgundians_were_often_called_false_french.json": "国民国家が存在しなかった時代に、人々がこのような\nブルゴーニュ人は \"フランス人であってフランス人でない \"という概念を持っていたということです。\n\nスペイン人がポルトガル人を「偽スペイン人」と呼んだり、ドイツ人がオーストリア人を「偽オーストリア人」と呼んだりしたことは聞いたことがありません。\nスペイン人がポルトガル人を「偽スペイン人」と呼んだり、ドイツ人がオーストリア人を「偽ドイツ人」と呼んだりしたことは聞いたことがありません。\n当時は\n\nこの...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pvgpds/what_has_donald_trump_done_to_get_the_massive.json": "彼が大統領選に出馬すると発表したとき、私は20代前半でした。私が見たのは\n私が見ていたのは、彼が最も愚かなことを言ったり、実際に誤った判断をしたりしていただけだった。\n判断しているようにしか見えませんでした。しかし、国の半分は彼を神と崇めていました。私には理解できませんでした。\n理解できませんでした。そして今でもそうです。人々はいまだにトランプの旗を振っています...。",
  "data/reddit-ask/r/AskHistorians/comments/pvctut/how_have_muslim_scholars_traditionally_reconciled.json": "非ムスリムには、クルアーンが完全に保存されているという主張を否定するという選択肢があるのは当然です。\nムスリムの中には、特に近代において、クルアーンの一部が失われたとするアハディースを否定する人もいます。\nムスリムの中には、特に現代において、クルアーンの一部が失われたとするアハディースを否定する人もいます。しかし\n伝統的なムスリムのアハディース研究者は、複数のアハディースを分類...",
  "data/reddit-ask/r/AskHistorians/comments/pvgfq6/why_did_the_british_not_just_give_the_american.json": "独立戦争に向けて、アメリカ人にとって大きな難問だったのは\n表現なくして課税なし」ということでした。では、なぜイギリスは、アメリカ人に代表権を与えるだけでなく\nアメリカ人に代表権を与えなかったのか？そんなことをしても、アメリカ人には\nそうすれば、議会で植民地側の代表者を圧倒し、...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pvogxr/23_m_a_woman_ive_never_met_is_offering_me_5000.json": "EDIT: 詐欺でした。彼女はPayPalで5000ドルを送るふりをして、受け取る前に「彼女の代理人」に50ドル払わなければならないと言いました。\n受け取る前に「彼女の代理人」に50ドル払わなければならないと言っていました。彼女が嘘をついていることはわかっていました。\nそのようなことをしなければならないという通知をPayPalから受け取っていなかったので、彼女が嘘をついていることはわかりました。\nまた、彼女の唯一の証拠は、偽のスクリーンショットで...。",
  "data/reddit-ask/r/AskHistorians/comments/pvmx2v/how_did_middle_age_empires_keep_control_of.json": "例を挙げると、17世紀初頭のプロイセンのようなものです。\n17世紀初頭のプロイセン\n[https://www.zum.de/whkmla/histatlas/germany/prussia17011740.gif]では\n複数の、ある程度大きな飛び地国家が、本国から完全に切り離されていて\n国から完全に切り離された複数の大規模な飛び地があり、海路でも繋ぐことができない...",
  "data/reddit-ask/r/askscience/comments/pvjx8z/what_is_the_scientific_consensus_about_the.json": "私は新しい仕事に就きましたが、プロセスを継続するためにポリグラフ・テストを受けさせられました。\n私は問題なく仕事に就くことができましたが、これは科学的に正確なのか、あるいは合法なのか疑問に思っています。\n科学的に正確なのか、あるいは合法なのか、私はアメリカにいません。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pvr09i/why_are_engineers_so_arrogant.json": "もちろん、すべてのエンジニアが傲慢なわけではありませんが、私の経験では、傲慢な人は\n私の経験では、この分野には他の分野よりも傲慢な人たちが集中しています。\n\n過去に多くの議論を聞いてきましたが、最も一般的なのは、「自分は他の人よりもずっと努力してきた。\n他の人よりもずっと苦労してきたのだから...というものです。",
  "data/reddit-ask/r/askscience/comments/pvrdqw/are_neutrinos_not_faster_than_light.json": "ニュートリノが光速を超えて飛ばないことを科学者たちは証明し続けている。\nを証明し続けています。もしそうだとしたら、超新星のような宇宙現象が起きた場合、なぜニュートリノは光よりも先に私たちに届くのでしょうか？\nニュートリノは光より先に私たちに届くのでしょうか？何が光の到達を妨げているのでしょうか？\n何が光の同時到達を妨げているのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pvtzl3/is_it_wrongweird_to_not_follow_the_news_for_the.json": "ここ数年、徐々にニュースを追わなくなってきました。たまに見出しに目を通すことはあっても\nたまにヘッドラインに目を通しますが、それだけです。\n\n自分自身の問題に対処しなければならないからです。ニュースを追うことは、私の不安を増大させるだけで\n不安が増すばかりで、楽しくありません。自分の心の健康のために、もうやめました。\nやめました。\n\n別に...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pvx57m/what_part_of_ass_do_people_eat.json": "膣を舐めるといっても、小陰唇、大陰唇、クリトリスの周りを舐めたり、舌で遊んだりするのは明らかです。\n小陰唇、大陰唇、クリトリスの周りを舐めたり、舌で遊んだり、膣の中に舌を入れたり、周りを舐めたりしています。\n周りを舐める。しかし、お尻はどうでしょう？ケツチェックの肉を噛んだりしている人を想像していました。\nケツチェックの肉を噛んだりしている人を想像していました(笑)",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pvxfcy/why_should_asexuality_be_recognized_by_the_lgbtq.json": "明らかにこの投稿は、学び、理解することを意図して行われています。",
  "data/reddit-ask/r/askscience/comments/pvt329/do_we_need_inflation.json": "私の理解では、インフレは負の側面しかなく、主に経済の分かりやすさの面で\n経済のわかりやすさという点で。昔の金本位制の時代には、確かにそれは避けられなかったかもしれません。\n確かに昔の金本位制では避けられなかったかもしれませんが、今の時代、金本位制を維持することに意味があるのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pvxwx7/is_giving_blowjobs_considered_dirty.json": "私（40歳、バツイチ）はデートや出会い系を利用するのは初めてです。自分では理解しているつもりでしたが\n何度かデートをして、それがきっかけで付き合うことになりました。\n一夜限りの関係になったり、その後も会ったりしています。どちらの男性もベッドではとても寛大で\nベッドではとても寛大で、長い間私に集中していました。私は、この好意は...と感じています。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pvuxo7/why_do_we_hate_communism.json": "29F、こちらはアメリカン。なぜまた、共産主義を憎むのか？それは正当なものなのか？",
  "data/reddit-ask/r/askscience/comments/pvxu1o/how_can_stardust_create_stars_if_a_stars_need.json": "もし、(a)星が水素を必要とし、(b)星の塵が形成されるならば、星の塵はどのようにして星を作るのでしょうか？\n星の水素がなくなった後に星くずができるとしたら、どうやって星をつくるのでしょうか？",
  "data/reddit-ask/r/askscience/comments/pvpnao/what_makes_a_gene_dominant_or_recessive.json": "優性遺伝子と劣性遺伝子の違いは何ですか？私が知っているのは\n優性遺伝子が劣性遺伝子に勝ることは知っていますし、それはインターネットでも\nインターネットで調べてみました。しかし、そもそも何が原因で特定の遺伝子が他の遺伝子よりも優位に立つのか、その説明が見つかりません。\nそもそも何が原因で特定の遺伝子が他の遺伝子より優位になるのかの説明が見つかりません。",
  "data/reddit-ask/r/AskHistorians/comments/pw5vds/the_munsters_and_its_rival_series_the_addams.json": "その年のテレビシーズン終了時に、この番組はニールセンで18位、24.7の視聴率を記録しました。\n視聴率24.7、「アダムス・ファミリー」は23.9で23位でした。当時\n当時のニールセンは、アメリカのテレビ世帯の何％が番組を見ているかを示すものでした。\n当時のニールセンは、アメリカのテレビ世帯の何％が番組を見ているかを示すものでした。翌年末には...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pw4ban/does_anyone_else_leave_their_fan_on_nonstop.json": "このファンを持って1年になりますが、一度も電源を切ったことがありません。\n(数秒の停電であれば別ですが、それはカウントしていません。\n正直なところ、このファンが発する音のせいだと思うのですが、テレビがあるようにこのファンをつけておくと\nホワイトノイズのためにつけているので、無音ではありません。",
  "data/reddit-ask/r/askscience/comments/pw8f5i/why_isnt_knowing_the_structure_of_a_molecule.json": "私たちは常に新しい化合物や薬の実験を行い、ある特性を確認して\n新しい化合物や医薬品は、常に実験を行い、特性を把握し、挙動や安全性、有効性を判断します。しかし、構造がわかっていれば\n構造がわかれば、どのような状況でも反応することができるのでは？",
  "data/reddit-ask/r/AskWomen/comments/pwdgal/what_are_actions_or_movements_that_you_feel.json": "例えば、その場で飛び跳ねたりすると、胸を意識してしまうので嫌だなと感じます。\n自分の胸を意識してしまうからです。",
  "data/reddit-ask/r/AskHistorians/comments/pw5ptf/how_were_mercenaries_hired_during_medieval_times.json": "大規模な戦争やキャンペーンの際には、多くの王国が傭兵を雇って、トレーニーと一緒に部隊を強化していたことを理解しています。\n傭兵を雇って、訓練された騎士や徴兵された農民と一緒に戦力を増強していたことは理解できます。\nしかし、その傭兵はどのようにして雇われ、選ばれたのでしょうか？\n傭兵はどのようにして雇われたのでしょうか？傭兵はどのようにして選ばれたのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pw7ip9/what_fluid_are_women_who_squirt_during_sex.json": "私は、セックスの時にオシッコをしているだけだと思っていましたが、ネット上の情報を見ると\n他の腺からの液体ではないかという情報もあります。これに対する明確な答えはどこにもないようです。\nこれに対する明確な答えはどこにもないようです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pwb8z0/i_whats_the_point_of_french_kissing.json": "私のカルマのせいで削除されてしまうかもしれませんし、このフレアが正しいかどうかもわかりません。\nしかし、もし誰かがこれを見たら、答えてくれると嬉しいです。\n本当に理解できません\n\n編集：実際のところ、どのように機能するのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pwfrcg/hey_so_who_are_they_and_why_would_they_make_chem.json": "ボーナスポイントでは、Chem trailとは何かを説明してくれます。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pvzh0g/what_can_a_person_do_when_theyre_out_of_options.json": "皆さん、こんにちは。\n\n私はRedditに何年も滞在していますが、私の投稿からは想像もつかないでしょう。\n履歴を見てもわからないと思います。私は自分自身を守る傾向があります。しかし、私は困っていて、この質問をすることができる人がいません。\nこの質問をできる人がいないのです。\n\n私はカナダ（サスカチュワン州）に住んでいますが、働くことができません。障害者手当に頼っています。\n給付金に頼っています（これは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pwik4b/do_women_have_postnut_clarity.json": "なぜか頭に浮かんできました。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pwgp06/for_those_who_were_able_to_how_do_you_accept.json": "タイトルにあるように、チャンスがあるようなふりをするのはもうやめました。\n人生で一人も友達がいなかっただけでなく、明らかに誰も私に興味を持っていませんでした。\n誰も私に興味を持ってくれないし、それでいいと思う。\n私の身体的な障害を知り、境界線上の...",
  "data/reddit-ask/r/AskHistorians/comments/pweoqk/in_the_movie_first_man_buzz_aldrin_is_made_out_to.json": "ヒーローたちの現実は、公式の物語とは異なることが多いと思います。\nしかし、これは一般的な認識とは非常に大きな違いがあるようです。\nググってみても、このバズ・オルドリンの特殊な描写の起源を見つけることはできませんでした。\nこのバズ・オルドリンの特別な描写の起源を見つけることができません。唯一出てきたのは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pwcga8/why_is_life_so_boring_and_only_gets_more_boring.json": "30歳、仕事に行って、帰ってきて、ちょっと走ったり、リフティングしたりして、食べて、ゲームして。\n寝る、の繰り返し。\n\n恋人はいないし、恋愛感情もない（僕の人生にはデートというものがない）。\nは基本的に同じ立場です。\n\n正直なところ、全てがつまらないです。私が最も幸せで生き生きとしていると感じる時は\nそれは...",
  "data/reddit-ask/r/askscience/comments/pwm36s/why_do_antigen_rapid_tests_not_work_after_15.json": "私は、2種類の抗原迅速検査を使用したことがあります。どちらも「15分以上経過した場合は\n検査後15分以上経過した場合は有効ではないとのことです。\nテストキットに溶液を落とす）から15分以上経過した場合は、結果が有効ではないと言われています。) これはなぜでしょうか？結合を行う着色・色のついた分子の\n15分以上経過すると、結合を行う着色・色の分子が働かなくなったり、弱くなったりするのでしょうか...。",
  "data/reddit-ask/r/AskHistorians/comments/pwmygv/meditations_by_marcus_aurelius_and_translation_in.json": "Meditationsを聴いていて、心に残る一節がありました。\n\n#1\n\n> 彫刻家は、老婆や老人の中に、ある種の花のような新鮮な美しさを見出すだろう。\n> また、自分の奴隷少年の魅惑的な魅力を冷静な目で見ることができるだろう。\n> 自分の奴隷少年たちの魅惑的な魅力を冷静な目で見ることができるだろう。第3.2巻（ペンギンクラシック版；...",
  "data/reddit-ask/r/AskWomen/comments/pwq7u3/what_are_some_great_albums_by_women_that_feature.json": "ほとんどの \"偉大な \"アルバムは、若くて色気のない、怒りっぽい人たちのことを歌っているような気がします。\n悩んでいて、何度も何度も付き合っているセクシーなパートナーとうまくやっていこうとしている。\nそれは悪いことではありません。それは悪いことではありませんが、私も年をとってきましたし、青春を超えた世界についてのキャッチーな歌も聞きたいのです。\n青春の先にある世界についてのキャッチーな歌が聴きたいのです",
  "data/reddit-ask/r/AskHistorians/comments/pwsx8o/is_the_american_attitude_to_drinking_in_modern.json": "イギリス人である私は、イギリス人の視点でしか人生を知らず、それに伴ってお酒に対する\nそれに伴い、お酒に対する考え方も変わってきました。私が子供の頃、特別な日に1本のビールが許されたのを覚えています。\n14歳のとき、特別な日にビールを1本飲ませてもらったのを覚えています。\n16歳になると、父が飲んでいるものは何でも一緒に飲んでいました。",
  "data/reddit-ask/r/askscience/comments/pwsc3a/is_the_flu_shot_the_same_in_different_parts_of.json": "オレゴン州でインフルエンザの予防接種を受けた後、メイン州に引っ越したとしても、予防効果はあるのでしょうか？\n守られますか？アメリカを横断して3,000マイルの距離を移動するのですが、移動前にインフルエンザの予防接種を受けようと思っていました。\n引越し前にインフルエンザの予防接種を受けようと思っていましたが、引越し後まで待つべきでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/pwpvd9/why_was_winston_churchill_voted_out_of_office_in.json": "何かで読んだのですが、第二次世界大戦がヨーロッパで終結した後、チャーチルは\nイギリスの選挙で屈辱的な敗北を喫した。それはなぜか？どこを探しても明確な答えがないので\nどこを探しても明確な答えが出てこないので、ここで聞いてみました。ありがとうございました。",
  "data/reddit-ask/r/AskHistorians/comments/pwu5oc/how_likely_was_it_that_a_roman_legionary_would.json": "もちろん、これは幅広い質問であり、いつ、どのような戦争であったかによっても異なります。\nしかし、平均的に見て、兵士たちは達成することを期待していたのでしょうか？それとも、望み薄だったのでしょうか？\nのか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/px23av/why_are_most_of_the_rap_songs_about_fucking.json": "私がこの質問をしたのは、2000年以前のラップの曲で、意味のある、歌詞が耳に心地よい、とても良い曲を見つけたからです。\n現在のラップは、「この女、アバズレ。\n俺はたくさんのビッチとファックしている、金だ金だ、嫌いな奴は嫌いだ」という内容です。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pwy34u/am_i_the_only_person_that_occasionally_reacts_to.json": "例えば、私が仕事で疲れて帰ってきたときに、お皿に料理を作って\nソファに向かう途中で落としてしまったとします。\nそして架空のカメラの方を見る。もし私がテレビ番組に出演していたら、彼らはこれを\n第四の壁を壊す」とでも言うのでしょうか。\n\n皆さんの中にも同じようなことをしている人はいますか？",
  "data/reddit-ask/r/askscience/comments/pwvj48/does_the_wood_from_different_trees_burn_at.json": "具体的には、Osage Orangeという特定の木について疑問に思っています。\n非常に高い燃焼温度を持っています。その木から木炭を作ったとしたら\n他の木の木炭よりも熱く燃えますか？\nタグが間違っていたらごめんなさい。「...」を使うかどうか迷ったのですが。",
  "data/reddit-ask/r/NoStupidQuestions/comments/px2mfk/why_is_physical_junk_mail_allowed_to_continue.json": "ダイレクトメールならまだしも、封筒や小型の看板など、すぐに捨てられてしまうものがたくさんあります。\n人々のポストに押し込まれ、すぐに捨てられてしまう封筒や小型の看板がたくさんあります。\n\n製紙業は森林破壊に直結しているのに、なぜこのようなことが許されるのでしょうか？\n森林破壊に直結しているのに、なぜこんなことが許されるのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/px022x/on_the_front_page_there_is_a_story_about_betty.json": "Snopesによると、二人が裏付けをとっているので、事件は真実だという。簡単な\n最近発表された多くのリンクを見ることができます。私が見たいのは\n私が見たいのは、彼女を批判しているオリジナルの記事やコメントです。\n1) アメリカ全体で流行っているのか、一部の地域でしか流行っていないのか...",
  "data/reddit-ask/r/AskHistorians/comments/px7moo/after_the_massacre_in_rwanda_the_un_admitted_its.json": "ルワンダの大虐殺に匹敵するような民族浄化はまだ起きていませんが、このような質問をしたのは\nルワンダの大虐殺に匹敵するような民族浄化はありませんでしたが、倫理的なグループに対する攻撃はいくつかありました。\n倫理的なグループへの攻撃が行われており、今では中国でも大きな事件が起きています。\n\n国連は、民族（のようなもの）の抹殺を防ぐことができたのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/px5suk/why_do_restaurants_have_dishwashing_machines_that.json": "友人がこれに関するミームのようなものをシェアしていましたが、これは真実です。2006年に初めてレストランの仕事をしたのですが\n2006年に初めてレストランの仕事をしましたが、その時は本当に速い食器洗い機があって、レストランとしては普通でした。\nレストランでは普通です。でも、家ではもっともっと時間がかかります。今は2021年ですが\n今は2021年ですが、もっと早く食器を洗うのが当たり前になるべきだと思います。\n\n私は...",
  "data/reddit-ask/r/askscience/comments/px6s00/can_nuclear_waste_still_be_used_for_energy.json": "私の知る限りでは、原子力発電所の廃棄物燃料はまだ\n放射性物質やミサイルを含んでいます。廃棄物管理は、原子力エネルギーに対する最大の反論であると思われます。\n廃棄物管理は、原子力エネルギーの最大の対案であると思われますが、廃棄物をどうすることができるのでしょうか？\n\n廃棄物からエネルギーを生成する別の構造の原子炉を使用することはできますか？\nそれとも\n\nそれとも...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/px849x/where_the_fuck_do_fruit_flies_come_from.json": "このバナナと桃を買ったばかりなのに！？",
  "data/reddit-ask/r/AskHistorians/comments/px43fj/why_is_labrador.json": "何の価値もないタイガの大きな塊が、なぜか本土から切り離されて\n本土から切り離され、ニューファンドランド島に割り当てられている。ほとんど誰も住んでいない\nそこにはほとんど誰も住んでおらず、天然資源もあまりなく、気候も定住には適していません。\nなぜそこが独立した島なのか...",
  "data/reddit-ask/r/AskHistorians/comments/px85pc/why_are_new_hampshire_and_vermont_so_different.json": "ニューハンプシャー州には家族が多く、バーモント州にも年に2、3回行きます。\n年に数回バーモント州にも行きます。この2つの州には、ちょっとしたライバル意識があるようですね。\nそれぞれの州の文化は多くの点でかなり異なっていますし、政治的にも大きく異なっています。\n少なくともニューイングランドの政治に関しては、大きく異なっています。どのようにして...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/px34n1/is_there_more_truth_than_joke_behind_military.json": "私の家族には軍人がいて、予備役の友人も何人かいるのですが、このようなことを聞いてはいけないと思ってきました。\n悪い記憶を呼び起こすのではないかと思い、これまで質問したことがありませんでした。軍人の妻が浮気をしていることは\n軍人の妻が浮気をしているというジョークはよく聞きますが、実際にはそれほど悪いことなのでしょうか？\nなのでしょうか？それとも、ただ単に注目されているだけなのでしょうか...。",
  "data/reddit-ask/r/AskHistorians/comments/px2vmi/did_cowboys_and_native_americans_ever_actually.json": "私は最近、アメリカ西部の歴史を読み漁っています（主な理由は\nレッド・デッド・リデンプション2をプレイしたことが主な理由です😅）、こんなことが気になり始めました。ハリウッドでは\nハリウッド映画では、カウボーイとネイティブ・アメリカンは常に争っているというのが定番でした。\nしかし、私の基本的な知識でも...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pwrtga/do_you_think_mods_on_reddit_abuse_their_power.json": "自分のサブレディットで人をいじめているモッズがどれだけいるかが気になります。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pxgufw/reddit_is_a_private_company_but_who_are_its.json": "所有率の高い上位のオーナーをランキングで見つけたい。これが公開されているかどうかはわかりませんが\n公開されているかどうかはわかりませんが",
  "data/reddit-ask/r/NoStupidQuestions/comments/pxg413/is_it_just_me_or_did_youtube_increase_the_length.json": "以前は2つのCMがあって、1つは15秒以上だとスキップできるようになっていました。\nいつから15秒のCMが2本になり、スキップできなくなったのですか？",
  "data/reddit-ask/r/AskHistorians/comments/pxbgds/why_did_the_ban_on_pork_skip_christianity_but.json": "こんにちは。\n\n私は高校生に世界史を教えていますが、「世界の宗教」の単元では\n世界の宗教」の単元では、3つのアブラハム系宗教をグループ化して、生徒たちがオリジナルの宗教の変遷を見られるようにしています。\n3つの異なる宗教を通じたオリジナルのアイデアの進行を見ることができます。\n\nしかし、今年はなぜか、私はランダムにこのような考えを持っていました...",
  "data/reddit-ask/r/AskWomen/comments/pxgvex/how_important_is_it_to_you_that_your_partner.json": "もし、それがあなたにとって重要なことであれば、デートの初期段階でそれをどのように把握しようとしますか？\nデートの初期段階でそれをどのように把握しようとしますか？\n\nETA: どのようなタイプの政治的な不一致が、あなたに誰かとの関係を断ち切らせるのでしょうか？\n誰かとの関係を断ち切るには？",
  "data/reddit-ask/r/askscience/comments/pxlvi0/why_are_men_in_western_countries_half_as_fertile.json": "Spermageddon」というViceの短編ドキュメンタリーを見ました。\n[https://www.youtube.com/watch?v=yVyzjEF_sKw]という、男性の\nFertility Crisis（男性不妊の危機）について語っています。\n\nこのビデオでは、あるメタ分析を参照しています。\n[https://academic.oup.com/humupd/article/23/6/646/4035689]を引用しています。",
  "data/reddit-ask/r/AskHistorians/comments/pxlpdw/what_caused_the_assyrians_to_and_i_believe_this.json": "皆さん、こんにちは。\n\nここで初めて世界史Iを教えます（普段は西洋史IIを教えています）。\nアッシリア人について初めて深く調べています。\n\n私が得た情報によると、アッシリア人は紀元前1300年代にある種の宗教的対立を経験し、その後、アッシリア人は宗教的対立を克服したということです。\n紀元前1300年代に何らかの宗教的紛争を経験し、その後、彼らは...",
  "data/reddit-ask/r/AskHistorians/comments/pxb9at/at_a_first_glance_occupational_burnout_sounds.json": "編集部：もしそうなら、それはどのように受け止められたのでしょうか？もしメンバーの一人が倒れた場合、コミュニティはどのように対応したのでしょうか？\nのメンバーが発症した場合、コミュニティはどのように対応しましたか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pxt2jb/do_you_serve_cake_at_adult_birthday_parties.json": "先日、妻が自分の誕生日を祝うために、数人の友人を招待しました。私はこの日のためにケーキを\nこの日のためにケーキを注文し、食後に出しました。ケーキを見た友人たちは、本当に驚いたようでした。\nケーキを見て驚いていました。\n\nハッピーバースデーを歌った後、数切れをカットしてデザートプレートに載せました。\n誰も手をつけなかった。I...",
  "data/reddit-ask/r/AskHistorians/comments/pxnco3/did_nazi_germany_have_comic_books_and_if_so_what.json": "この質問をしようと思ったのは、私がこれまでに多くの漫画を見てきたからです。\n第二次世界大戦中のアメリカのコミックで、スーパーヒーローがナチスを倒している表紙をよく見かけました。ドイツの子供たちは\nドイツの子供たちは、キャプテン・ドイッチュラントがチャーチルを殴る話を読んだのでしょうか？",
  "data/reddit-ask/r/AskWomen/comments/pxvf8n/women_who_left_tech_when_did_you_leave_and_why.json": "統計では以下のようになっています。\n\n 1. コンピュータ・サイエンスの専門家のうち、女性はわずか20％。\n 2. 50％の女性が35歳までにテクノロジー分野でのキャリアを放棄する。\n 3. 女性は男性よりも45％高い割合で技術職を辞めている\n\n(Accenture社とGirls Who Code社のデータによる。)\n\nあなたが技術職を辞めた理由は何ですか？",
  "data/reddit-ask/r/askscience/comments/pxszfk/askscience_ama_series_i_am_geoff_barnes_md_a.json": "私はジェフ・バーンズ医学博士で、アメリカのミシガン大学ヘルスシステムで循環器と血管の専門家として働いています。\nアメリカのミシガン大学ヘルスシステムで心臓専門医、血管専門医として働いています。あなたは\nツイッターでは@GBarnesMD [https://twitter.com/GBarnesMD]でフォローできます。私の\n私の専門分野は、抗凝固療法、静脈...",
  "data/reddit-ask/r/AskHistorians/comments/pxss8k/why_are_japanese_noble_families_translated_as.json": "なぜクランなのか？なぜ翻訳者は「一族」という言葉を選んだのでしょうか？なぜ同じような意味を持つ他の言葉ではなく\nなぜ似たような意味を持つ他の言葉ではないのか。なぜ「clan」が選ばれたのか、その理由は？\n家」ではなく「一族」を選んだ理由は？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pxumns/can_i_legally_stalk_a_stalker.json": "私の友人(22F)には、私(36F)が思うようなストーカーがいます。誰も何もしてくれません。\n誰も何もしてくれません。なぜなら、彼は今までに何もしていないからです。私の友人は恐れています。\n彼は彼女の安全感を破壊しました。彼は仕事場で何時間も彼女の席に座っています。\n駐車場まで追いかけたり、あらゆるアプリでメッセージを送ったり...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pxx8uc/do_muslims_jews_and_christians_worship_the_same.json": "私たちムスリムは、ユダヤ人やキリスト教徒が崇拝するのと同じ神を崇拝していると信じています\n私はいつもユダヤ人やキリスト教徒の友人にこのことを尋ねるのを恐れていました。\nTooAfraidToAsk あなたたちは何を信じていますか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/py251m/are_there_straight_guys_which_enjoys_shoving.json": "これは非常に恥ずかしい質問ですが、だからこそここに投稿しています。\n\nお尻に何かを突っ込んでいる男の話を聞くと、必ずと言っていいほど、その男はゲイだというジョークを聞かされます。\nお尻に何かを突っ込んでいる男の話を聞くと、必ずと言っていいほど、その男がゲイだというジョークを聞きます。でも、もしお尻にGスポットがあるのなら\nお尻にGスポットがあるのなら、お尻に物を突っ込んで楽しんでいるノンケもいるのでは...？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/py1m59/is_it_common_to_not_be_able_to_cum_during_your.json": "童貞を捨てるときに一番心配したのは、5分しかもたないのではないかということでした。\nそれを心配していたんだ。私たちは15分ほどイチャイチャして、その後40分ほどセックスしました。\n終わっていないという結論に達するまで、40分ほどやりましたが、すでに午前3時を過ぎていました。\n午前3時を過ぎていました。彼女はとてもセクシーで、私が...という感じは全くありませんでした。",
  "data/reddit-ask/r/askscience/comments/pxtsmc/is_two_50mph_cars_crashing_same_as_100mph_car.json": "時速50マイルで2台の車が衝突した場合、同じ力が発生するのか？\n時速100マイルの車が1台だけ木にぶつかるのと同じ力が発生するのか\n(ぶつかるのと同じ力が発生するのでしょうか？)\n\n両方の衝突の真ん中に圧力測定器があったとしたら、それは同じ圧力を読み取るでしょうか？\n同じですか？\n\n\n\nありがとうございました。くだらない質問だったらすみません...。",
  "data/reddit-ask/r/AskHistorians/comments/pxzh2l/how_far_back_in_human_history_were_people.json": "考えれば考えるほど、不思議です。食べることは必要であり、本能的なことですが\n食べることは本能的に必要なことですが、タバコは絶対にダメです。植物・肉類を経口的に摂取する\n植物や肉を経口的に摂取すると、時には違った高揚感が得られたり、体や心に強い影響を与えることがあります。\nしかし、それを吸うということは、全く新しいレベルの創造性を必要とします。....",
  "data/reddit-ask/r/NoStupidQuestions/comments/py6dv3/would_it_violate_hipaa_if_my_primary_care_doctor.json": "私は22歳ですが、彼女が私の医療記録や情報にアクセスできるかどうか、私が書いた書類ではわかりません。\n私の医療記録や情報にアクセスできるかどうかはわかりません。しかし、私が医師に会った同じ日に、私は彼女に言いました。\n私がセックスをしていることを母に知られるのは不安だと伝えました。\nそれが理由で乳頭腫検査と婦人科の紹介を避けた理由です。",
  "data/reddit-ask/r/askscience/comments/py9bvs/a_standard_internal_combustion_engine_burns_fuel.json": "単純に考えて、C8H18+13.5O2=8CO2+9H2O、つまり14.5個の気体分子が17個の気体分子になります。\n分子になります。これは、シリンダー内の圧力が原因なのか、それとも熱が発生して膨張することが原因なのか？\n放出された熱とその結果としての膨張（理想気体の法則とほぼ一致）？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pycbg0/i_got_a_strippers_number_but_what_does_it_mean.json": "こんにちは！！！！！！！！！！！！！！！（笑 簡潔にまとめてみますね。私は初めてストリップクラブに行きました。\n暇だったし、僕しかいなかったので、その夜働いていた唯一の女の子と長い時間話していました。\nその夜働いていた唯一の女の子と長い時間話していました。何度かプライベートダンスをして、基本的には\nその女の子と何時間も話していました。私は20代前半で、彼女は後半...",
  "data/reddit-ask/r/askscience/comments/pyfyh9/similar_to_a_recently_asked_question_if_2_cars.json": "その場合、2台分の時間と空間をどうするか？互いの姿がより鮮明になるのか？\n互いをより強く意識するようになるだろうか。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pyhaaf/whats_the_weirdest_thing_you_stuck_your_dick_in.json": "誰もが経験したことのあることだと思います。それは\nホルモンの多い10代の頃は、何も知らなかったり、良いアイデアだと思っていたことが\nムラムラした頭で",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pyhxng/if_a_woman_slept_with_identical_twin_brothers_and.json": "友達を誘う",
  "data/reddit-ask/r/AskWomen/comments/pygrpz/so_many_clothes_made_for_women_pants_trousers.json": "ボクサーが少しでも上がってきたら、立ち止まって引っ張り出します。\n誰が見ていようと気にしません。どうやって対処していますか？もしこれが、あなたが我慢しなければならない最悪の服\n我慢しなければならない最悪の服の悪夢でなければ、何を我慢すればいいのでしょうか？\n\n編集* 多くはそのようにデザインされていないので、人々はただ小さすぎたり、大きすぎたりするものを着ています。\n小さすぎるものを着て、それを引きずる...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pycy6w/do_some_people_work_from_like_7am3pm_instead_of_95.json": "夜勤をする人がいるのは知っていますが、日勤も同じように様々なことがあります。例えば\n午前6時～午後2時",
  "data/reddit-ask/r/AskHistorians/comments/pyfiu5/why_was_alan_turing_condemned_for_his.json": "なぜアラン・チューリングは悪者にされ、有罪判決を受け、化学的に去勢されたのでしょうか？\n同時代の知識人であるジョン・メイナード・ケインズが同性愛を公言していたにもかかわらず\nケインズは、同性愛を公言していたにもかかわらず、大目に見られていた。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pylefe/people_who_walk_around_in_public_talking_with.json": "耳に当てて話したり、イヤホンをつけたりしてみては？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pyka52/nsfw_is_it_bad_for_me_as_an_adult_man_to_be.json": "私は31/Mで、今週までは童貞でした。不安や鬱の経験が多い\nうつ病を患っています。この子（29/F）とは1ヶ月ほど前から付き合っていますが、私はオープンにしています。\n彼女は僕がどこから来たのかを最初からオープンにしていて、僕がより快適に過ごせるように、とても素晴らしく、忍耐強くサポートしてくれました。\n彼女はとても素晴らしく、僕がもっと快適に過ごせるように辛抱強くサポートしてくれています。I...",
  "data/reddit-ask/r/AskHistorians/comments/pyile4/how_italian_cuisine_became_something_so.json": "マッシモ・ボットゥーラは、伝統的な料理に手を加えることで有名になりました。\n地元の人々の怒りを買うことで有名になりました。インターネット上では、イタリア料理の食材に手を加えて怒っているイタリア人の動画がよく見られます。\nインターネット上では、イタリア料理の材料の変更や修正に怒るイタリア人の動画がよく見られます。\nイタリア人は伝統的な料理しか好まないというイメージがあります。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pyf9p9/do_movie_theatre_workers_really_care_if_you_sneak.json": "もしあなたが映画館で働いているなら、人々が自分のスナックをこっそり持ち込むことを本当に気にしますか？\nスナックをこっそり持ち込む人を気にしますか？誰かがそんなことをしたら、トラブルになりますか？",
  "data/reddit-ask/r/AskHistorians/comments/pymhas/cosmo_kramer_never_slipped_one_past_the_goalie.json": "1994年10月13日、Seinfeldのエピソード「The Chinese Woman」が初放送されました。このエピソードでは\nこのエピソードでは、Kramerの精子の数が少ないということが一つのポイントになっています。登場人物のジェリーとクレイマーは\n登場人物のジェリーとクレイマーが議論しています。\n\n\n\n> KRAMER: You ever get a woman pregnant?\n> \n> JERRY: すまない、クレイマー。その記録は...",
  "data/reddit-ask/r/askscience/comments/pypq57/if_a_person_inhales_some_amount_of_a_virus_ex.json": "私の大学では、ワクチンとマスクが義務づけられていますが、予想通り、いまだに風邪をひいている学生がいます。\nいます。常に廊下を移動しているので、潜在的に（というか可能性として）ウイルスにさらされています。\n(私は常に廊下を移動しているので、少なくともウイルスの一部にさらされる可能性があります。果たして\n私は長い間、コヴィドに対する超免疫を獲得するチャンスがあるのでしょうか...",
  "data/reddit-ask/r/AskHistorians/comments/pyp9hu/i_am_a_british_or_french_soldier_in_wwi_my_army.json": "ほとんどの人は処刑されないと思いますが、彼らが何をするのか、何を言うのか、いつも気になっていました。\nと思っていました。私は叱られるだろうか？懲戒免職？それとも、背中を叩いて「ああ」と言ってくれるのだろうか。\nあなたはベストを尽くした」と背中を叩かれるのか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pyratq/why_is_why_are_you_so_quiet_such_a_socially.json": "大人しくてシャイな内向的な私は、幼い頃からこの質問をよく受けてきました。\n私の最も古い記憶の中にもあります。そして、20歳になった今でも時々この質問を受けることがあります。\n歳になった今でも時々この質問を受けます。\n\n私はこの質問があまり好きではありませんでした。\n自分がなぜそんなに静かなのか、そしてさらに静かな時は...",
  "data/reddit-ask/r/askscience/comments/pyr9ak/as_humans_are_we_always_carrying_viruses_or_do_we.json": "私は高校レベルの生物科学を学んだ後、主にコンピュータサイエンスを学んできました。\nコンピュータサイエンスを学んできました。ウイルスの無症候性キャリアーになる人がいることは理解しています。\nウイルスの無症候性キャリアになる人がいると聞きましたが、その仕組みを理解したいと思います。私の理解では\n私の理解では\n\n * 免疫不全の患者、例えば...",
  "data/reddit-ask/r/askphilosophy/comments/pyk3vi/a_96_year_old_woman_was_arrested_today_to_stand.json": "他の場所で質問されていたらすみません、何も見つかりませんでした。私が今日読んだのは\n第二次世界大戦中の死のキャンプで秘書としての役割を果たしたために裁判にかけられた老婆の話です。\n第二次世界大戦中に死の収容所で秘書をしていたことで裁判にかけられたという記事を読みました。矛盾した問題だと思うので、これらの問題に関する文章を探していました。\nこのような問題についての文章を探していました。\n\n疑問点としては、「これらの人々を追跡することだけが目的なのか？",
  "data/reddit-ask/r/AskHistorians/comments/pyvqx4/in_1960_ruby_bridges_was_one_of_six_children_who.json": "このウィキペディアの記事[https://en.m.wikipedia.org/wiki/Ruby_Bridges]には\nルビーはテストに合格し、そのおかげで白人ばかりの学校に入学することができたという。\n白人ばかりの学校に入学することができた。彼女はまだ6歳でした。テストにはどのような問題があったのでしょうか？\nテストにはどのような問題が出題され、誰がそれを実施し、誰がその答えが..."
}