{
  "data/reddit-changemyview/r/changemyview/comments/pyzxpq/cmv_people_who_cheat_regardless_of_the.json": "最初にお断りしておきますが、私自身は浮気をされたことがありません。\nしていません。\n\nただ、なぜ人は、うまくいっていないと相手に伝えたり、他に移る前に終わらせたりする礼儀を持たないのか、理解できません。\n他の人間関係に移る前に、うまくいかないことを相手に伝えたり、関係を終わらせたりする礼儀を持たない人がいることが理解できません。\n関係に移行する前に終わらせる礼儀を持たない人がいることが理解できません。それは私にとっては意味のあることです...",
  "data/reddit-changemyview/r/changemyview/comments/pz8lzw/cmv_gangbangs_are_gay.json": "なぜラッパーは曲の中でギャングバンガーであることを歌うのか、実際にはギャングバンガーは超ゲイである。\n考えてみると、1人の女の子が13人の裸の男性と一緒にいるのですから。\n1人の女の子の周りに13人の裸の男がいて、みんな順番を待っている。男たちが過ごす時間のほとんどは\n他の裸の男の横でジャックしていることになります。",
  "data/reddit-changemyview/r/changemyview/comments/pzfkoc/cmv_reddit_should_have_an_unseen_option_when.json": "私の考えを変えようとする人がいるかどうか、誰もが実際に良い考えだと思っているかどうかはわかりません。\n思うのですが、Redditには投稿をフィルタリングするオプションを設けるべきだと思います。\nユーザーがまだ見ていないもので投稿をフィルタリングするオプションを持つべきだと思います。\n\nこれは素晴らしいことだと思います。なぜなら、通常、未読の投稿がたくさんあるからです。\nしかし、あなたは...",
  "data/reddit-changemyview/r/changemyview/comments/pzacfc/cmv_i_am_not_smartknowledgeable_enough_to_have.json": "政治を例に挙げると ほとんどの人は、正義の味方になりたいと思っています。\n人種差別などが許されると考える人はほとんどいません。\nと思っている人は少ないと思います。私は明らかに「人種差別は悪いことだ」と考えています。\n私は明らかに「人種差別は悪いことだ」という派であり、多くの人にとっては政治的左派に賛成すべきだということになります。しかし...。",
  "data/reddit-changemyview/r/changemyview/comments/pzs8vd/cmv_as_long_as_men_arent_encouraged_as_much_to.json": "議論は非常にシンプルだと思います。私たちは社会的に、他の人々の行動や性格的特徴を\n社会的に好ましいと思われる行動や性格的特徴を、他の人々に奨励します。\n社会のためになると考えるからです。つまり、ここ数十年で私たちが行ったことは、女性が多くの側面を取り入れることを奨励することでした。\nこの数十年で私たちが行ったことは、女性が伝統的なステレオタイプの男性の役割の多くの側面を採用することを奨励することでした。",
  "data/reddit-changemyview/r/changemyview/comments/q02gbi/cmv_people_broadly_agree_on_who_is_good_looking.json": "これは私の個人的な見解であり、多くの個人的な経験に裏打ちされていると思います。\nしかし、逸話は信頼できる証拠ではありませんので、実際の科学的データを見つけました。\n実際の科学的データを見つけました。以下にリンクしたレビュー記事では\n研究者たちは、11のメタアナリシスによって、人々の考えとは逆に...",
  "data/reddit-changemyview/r/changemyview/comments/pzykgu/cmv_our_modern_day_laws_should_never_be_based_on.json": "聖書は、ある人にとっては道徳的な指針ですが、現代の法律に関しては全く関係ありません。\n現代の法律に関しては全く無関係です。聖書は、レイプ、虐殺、奴隷、殺人、人身御供などを奨励しています。\nや人身御供を奨励しています。私はそのような恐ろしいことが合法化されることを望んでいません。\n聖書が命じているように、合法的で奨励されたものにはしたくありません。\n\nありがたいことに、私たちは...",
  "data/reddit-changemyview/r/changemyview/comments/pzwen8/cmv_comunism_is_an_unreacheable_utopia.json": "私は何年も前からこのテーマに関心を持ち、何人かの活動家や様々な社会主義団体のメンバーと議論してきました。\n何人かの活動家や様々な社会主義団体のメンバーと議論してきました。\n議論してきました。その中で、彼らの異なる視点から見て、一つのことが私には残っています。\nそれは、彼らが目指すと主張している社会が...",
  "data/reddit-changemyview/r/changemyview/comments/q04hhe/cmv_white_americans_who_say_that_white_south.json": "私は南アフリカ出身の18歳の白人男性です。私は南アフリカ出身の18歳の白人男性です。\nネット上で白人のアメリカ人に何度も言われました。あなたはアフリカ出身ではありません。\nあなたはアフリカから来たのではなく、原住民を殺して奴隷にした邪悪な植民者の子孫に過ぎない。\nヨーロッパに帰れよ。ヨーロッパに帰れ」と。教えてください、アメリカ人、なぜ...",
  "data/reddit-changemyview/r/changemyview/comments/pzx7ri/cmvtwoxchromosomes_should_not_be_on_the_front_page.json": "(私の主張は他のアイデンティティに基づくエコーチェンバーにも当てはまりますが、これはまさに\n私が知っている中で唯一のフロントページです)\n\nTwoxchromosomesは、女性と女性のアイデンティティを持つ人々のための場所です。私はそうは思いませんが\nしかし、「安全な場所」で自分の経験を共有することが重要だと考える人もいます。\n「安全な空間」で経験を共有することが重要だと考える人もいます。",
  "data/reddit-changemyview/r/changemyview/comments/q0byi6/cmv_the_idea_that_men_should_pay_for_everything.json": "初デートのポイントは何ですか？2人の人間が一緒に会って、うまくいけば楽しい時間を過ごして\nうまくいけば2回目のデートにつながる楽しい時間を過ごすことができます（あなたの好みであれば付き合うこともできます）。\nあなたの好みであれば）。) 一般的には、二人が楽しめることを中心にデートを計画します。\n楽しむことができます。それが悪い時間であろうと、良い時間であろうと...。",
  "data/reddit-changemyview/r/changemyview/comments/q08va3/cmv_lawsrules_that_have_a_religious_exemption_are.json": "これは宗教を否定するものではなく、無意味な法律や規則についての話です。\n行われています。もし規則があっても、宗教上の理由でそれを回避することができるのであれば\nそのルールはそもそもそれほど重要ではなく、おそらく誰にも適用されるべきではないでしょう。\n誰にも適用すべきではありません。もし、そのルールが本当に重要なものであれば、...",
  "data/reddit-changemyview/r/changemyview/comments/q0cusk/cmv_euthanasia_or_assisted_suicide_should_be.json": "反出生主義についての私の考えと同様に、私がこの結論に至ったのは、多くの人々が\n多くの人が苦しんでいるのを見てきて、その苦しみを終わらせるための有力な選択肢になると思ったからです。\nと考えたからです。私は単純に、人は自分の意思で死ぬ権利を認められるべきだと思います。\n私は単純に、人は自分の意思で死ぬ権利を認められるべきだと思います。なぜ、他人に死を強要しなければならないのでしょうか？",
  "data/reddit-changemyview/r/changemyview/comments/q0jx0l/cmv_polyamory_is_just_promiscuity_and_the_is.json": "オープンリレーションズという考え方には懐疑的です。人は無欲だと言いますが、私は\n一人の人間に身を捧げるという考えは、愛の真髄ではないと思います。\n愛です。人々は自分のケーキを食べようとしているようにしか思えないのです。これは\n嫉妬の話だけではなく、もし誰かを愛しているのであれば、それは...",
  "data/reddit-changemyview/r/changemyview/comments/q0gi49/cmv_too_many_people_blame_their_crappy_behaviour.json": "このような問題を抱えている仲間が何人かいるのですが、彼らの行動がいつも\nしかし、彼らの行動が悪くなると、それを精神疾患のせいにするようです。\n\n大目に見てくれるのはありがたいのですが、一方で、自分の行動に責任を持たなければならない時もあります。\n責任を取る必要があります。\n\n例を挙げてみましょう。- 約束した時間に来ない...",
  "data/reddit-changemyview/r/changemyview/comments/q0iekr/cmv_homemakers_are_the_most_under_appreciated.json": "他の国のことは経験がないので何とも言えませんが、少なくとも私の人生では\nしかし、少なくとも私の人生では、自分がどれだけ正当に貢献しても認められない人は\n家族や地域社会にどれだけ貢献しているかを認めてもらえないのが\nそれは主婦です。\n\nしばしば、それは彼らの...",
  "data/reddit-changemyview/r/changemyview/comments/q0pjd1/cmv_prostitution_should_be_fully_legal.json": "私の見解の要点は\n\n-売春防止法は意味をなさない：同意した大人とセックスすることは合法であり、広く普及している。\n合意した大人とセックスすることは合法的（かつ広範）です。同意した大人とセックスすることは合法であり、広く普及している。しかし\n性的サービスを売ることは違法です。買うのは違法だが、売るのは違法ではないという場所も同様です。\n買うのは違法だが、性的なものを売るのは違法である。",
  "data/reddit-changemyview/r/changemyview/comments/q0suxa/cmv_marijuana_is_safer_and_less_physically_and.json": "前置きが長くなりましたが、私は誰かにマリファナが完全に無害だとか、マリファナを吸うべきだと説得しようとしているわけではありません。\n説得しようとしているわけではありませんし、タバコを吸うべきだと言っているわけでもありません。私が言いたいのは\nアルコールよりも安全であるということです。\n\n1: 中毒性と禁断症状\n\nマリファナはアルコールよりも中毒性が低いです。と言っているわけではありませんが...。",
  "data/reddit-changemyview/r/changemyview/comments/q0ty77/cmv_braids_are_not_cultural_appropriation.json": "三つ編み\n[https://www.byrdie.com/history-of-braids#:%7E:text=In%20relation%20to%20time%20periods,braid%20from%201644%20to%201912%3B]\nは、文化の流用ではありません。5500年前から使われていて、ほとんどの文化で\nほとんどの文化で着用されています。\n\n現代のコーンロウは、カリブ海の...",
  "data/reddit-changemyview/r/changemyview/comments/q127jk/cmv_i_think_the_nonbinary_gender_identity_is.json": "最初に言っておきたいのは、私はすべての人を完全に受け入れ、誰がどのような代名詞で呼ばれたいかを尊重するということです。\n代名詞を尊重します。私はこのことについて自分の考えを持っています。\n私は女性ですが、たまに男性的な服装をすることがあります。\n\n私は女性ですが、時には男性的な服装をすることもありますし、まれには\nドレス...",
  "data/reddit-changemyview/r/changemyview/comments/q0wwzc/cmv_cultural_appropriation_at_least_as_its_used.json": "さて、ここでオーストラリアでのちょっとしたエピソードを紹介しましょう。何年も前の出来事ですが\nググるとこの話が出てきます。数年前にディスニー・プリンセスのイベントがありました。\n数年前のことです。無邪気な少女たちが自分の好きなお姫様の格好をして並んでいました。\n好きなお姫様の格好をして並んでいました。そこにいたのは、小さな原住民の...",
  "data/reddit-changemyview/r/changemyview/comments/q11gmh/cmv_we_should_use_minority_deprivation_rather.json": "こんにちは、Hivemimdです。\n\n皆さん、お元気ですか？\n\n私は、人種、特に人種差別について議論するときに、現在一般的に「白人の特権」と呼ばれているものよりも、「少数民族の剥奪」という言葉の方が良いと思います。\n人種、特に人種的抑圧や差別について議論するとき、あるいは人種問題についてのキャンペーンでは、「白人の特権」と呼ばれているものの方が良いと思います。\n人種、特に人種的な抑圧や差別について議論するとき、あるいは人種問題について語るキャンペーンでは、現在一般的に「白人の特権」と呼ばれているものの方が良いと思います。これは\n少数のために...",
  "data/reddit-changemyview/r/changemyview/comments/q13owi/cmv_there_are_no_rules_in_standup_comedy_so.json": "コメディアンが面白いことを言っても、それが少しでも差別的だったり、性差別的だったりすると、問題になることがよくあります。\n笑いを誘うようなことを言ってトラブルになることがよくありますが、それはちょっとした、あるいは非常に大きな人種差別や性差別です。\"you can't punch down\",\n評論家はよくこう言います。性差別的、人種差別的なことを言って、それが面白くない場合もある。\n笑えないことを言って、反感を買うこともあるでしょう。\n\nI...",
  "data/reddit-changemyview/r/changemyview/comments/q1d0i2/cmv_pronouns_are_great_but_the_over_the_top.json": "また、職場や学校などでは、自分が何をしているのかを聞いてみるのもいいかもしれません。\n職場や学校などで、自分の代名詞が何かを尋ねることも素晴らしいことだと思います。\n\n * He/Him\n   \n * She/Her\n   \n * They/Them\n   \n * Xe/xem\n\nしかし、最近は若い人を中心に増えてきています。\nBug/Bugself、God/Godself、...と名乗る人が若い人を中心に増えています。",
  "data/reddit-changemyview/r/changemyview/comments/q195qo/cmv_most_drag_shows_are_offensive.json": "ドラッグショーなどはクィア文化の大きな部分を占めていますし、私自身はとてもリベラルなブッチレズビアンなので、これは私にとって難しい見解です。\nというのも、ドラッグショーなどはクィアカルチャーの大部分を占めていますし、私自身もとてもリベラルなブッチレズビアンです。\n\n最初に言っておきますが、私は男性（あるいは他の性別）と認識している人が「女性的」な服を着たり、化粧をしたり、あるいは\n男性であることを認識している人が「女性らしい」服を着たり、化粧をしたり...",
  "data/reddit-changemyview/r/changemyview/comments/q1656h/cmv_separated_parents_who_share_5050_custody_are.json": "片親だと言っている人を見たことがありますが、元配偶者やパートナーと\n元配偶者やパートナーとの親権が50対50であることを知りました。それは、私にとっては奇妙なことです。\n100%の責任を持っているという意味で「片親」である文字通りの親を知っている者としては、奇妙に思えます。\n私は、文字通りの \"片親 \"を知っている者として、奇妙に思えます。",
  "data/reddit-changemyview/r/changemyview/comments/q1ots3/cmv_fat_acceptance_does_absolutely_nothing_and.json": "私は何かを見逃しているかもしれないので、私の考えが変わることを歓迎します。\n\n始める前に、ここでは明白なことを除外させていただきます。医学的に痩せられない人や\n医学的に痩せられない人や、肥満とみなされる人は例外です。\n明らかに物理的に何もできないので、例外です。\nのことです。",
  "data/reddit-changemyview/r/changemyview/comments/q1m26k/cmv_a_decentralized_monetary_system_is_inherently.json": "私が分散型金融と言っているのは、特に銀行や中央銀行を方程式から排除することです。\n中央銀行を方程式から排除することです。\n理論的には、中間業者や最後の貸し手（lender of last resort）がいない状態で、お互いに貸すことができます。\nこれにより、理論的には、中間者や最後の貸し手がいない状態で、お互いに貸し出しを行うことができます。また、これにより、中央の組織は...",
  "data/reddit-changemyview/r/changemyview/comments/q1wrhd/cmv_its_not_just_that_the_minimum_wage_is_too_low.json": "誤解を恐れずに言えば、誰もが1週間の労働で得られる収入で生活できるようにすべきです。\n一週間の仕事で得られる収入で生活できるようにすべきだ。人の時間に対して適切な報酬を支払って生きていけない会社は\n会社は存続すべきではないと思っています。ただ、最低賃金の金額だけに注目すると......。\n最低賃金の金額に注目するだけでは、事実から目をそらしてしまいます...。",
  "data/reddit-changemyview/r/changemyview/comments/q1vafo/cmv_breaking_news_should_be_forbreaking_news.json": "今朝、目が覚めるとニュース速報が流れていたので、もちろん見ることにしました。\nフェイスブックがダウンしたという内容だったのです。\n\nまず第一に、このニュースはこれほど多くの時間を割くべきではありませんでした。もし\nフェイスブックが半日ダウンしたことが、あなたの人生にそれほど大きな影響を与えていたとしたら\nそして、あなたが...",
  "data/reddit-changemyview/r/changemyview/comments/q2ay4e/cmv_atheism_isnt_a_religion_and_it_should_never.json": "無神論は宗教ではありませんし、宗教と同じカテゴリーに括られるべきではありません。\n無神論の定義は、「神を信じないこと」です。無神論は組織的な宗教とは似ても似つかないし\n組織された宗教とは似ても似つかぬもので、集団的な目標もないようです。\nキリスト教徒はよく間違って宗教に分類しようとしますが...。",
  "data/reddit-changemyview/r/changemyview/comments/q2j9me/cmv_joel_osteen_is_a_piece_of_garbage.json": "人々が彼を擁護するのは、彼が献金皿ではなく本の売り上げからお金を得ているからです。\n人々は彼を擁護します。彼は、神は彼が豊かになることを望んでいると言います。なぜなら、彼は愛されており、神は彼を見守っているからです。\nしているからです。だから、寄付されることで利益を得られる何千人もの人々のことは気にしないでください。\n彼は神の特別な人であり、あなたもそうなれるのです。あなたにも...",
  "data/reddit-changemyview/r/changemyview/comments/q2ph3q/cmv_rather_than_criticizingaiming_their_anger_at.json": "特にRedditでは、大家さんへの罵詈雑言を目にすることが多いです。I\nこれは、Covidに関連した立ち退きのための滞在と、その滞在期間が終了したときに人々が何をしているかについての懸念が関係していると思います。\nCovidに関連した立ち退きのための滞在や、滞在期間が終了したときに人々が何をしているかについての懸念もあると思います。しかし、人々は次のように話しています。\n大家さん...それも母子家庭の大家さんが貸しているような...。",
  "data/reddit-changemyview/r/changemyview/comments/q2so2h/cmv_i_have_no_faith_in_humanity_after_how_people.json": "アンチワクチン派、アンチマスク派、パンデミックをデマと呼ぶ陰謀論者など\nこのような人々にはいつも驚かされます。彼らの頑固さ、愚かさ、身勝手さは\n愚かさ、身勝手さは、この規模ではあり得ないと思っていたレベルです。\nパンデミックのすべての段階で パンデミックのすべての段階で、彼らは新たな限界を見つけました。",
  "data/reddit-changemyview/r/changemyview/comments/q2b9t0/cmv_as_a_constituent_of_a_corrupt_government_i.json": "欧米諸国では、税金を公平に払っていない人たちに怒りを感じている人が多いですね。\n欧米諸国では、税金を公平に払っていない人に対して怒っている人が多いですね。アメリカではどうかわかりませんが、私の出身地（フィリピン）では\nアメリカではどうかわかりませんが、私の出身地（フィリピン）では、政府が税金を使ってくれるとは到底思えません。\n政府が私の税金を賢く使ってくれるとは思えません。\n\n私の国では、政治家は...",
  "data/reddit-changemyview/r/changemyview/comments/q2w16l/cmv_the_symmetrical_analog_stick_placement_on.json": "私は、プレイステーションのコントローラーは正しく、Xboxのコントローラーはアナログスティックの配置が悪いと思っています。\nコントローラーのアナログスティックの配置は、より悪いコントローラーだと思います。そう思う理由はたくさんありますが\n私がそう思う理由はたくさんありますが、誰かが私の考えを変えてくれないかと思っています。\n\n私はシューティングゲームをプレイすることが多いので、私にとっての大きなポイントは...。",
  "data/reddit-changemyview/r/changemyview/comments/q2ytv3/cmv_police_should_have_to_pass_a_physical_as_well.json": "これが全てを物語っていると思うので、短くします。私たちは、心臓に負担がかかるようなストレスの高い状況にいる警官を抱えています。\n心臓に負担がかかるようなストレスの多い状況では、通常は車を運転しています。\nまた、徒歩での追跡調査も行わなければなりません。\nなどなど。このような状況では、警察官と一般市民の両方にメリットがあると思います。",
  "data/reddit-changemyview/r/changemyview/comments/q31et8/cmv_telling_little_boys_to_toughen_up_or_put_some.json": "多少痛い怪我をしても、いちいち泣く必要はありません。私は大人の女性が\n大したことのない怪我で泣いている大人の女性を見たことがありますが、あざが残るかもしれませんが、それくらいの\nその程度のことで。多くの少年たちが教えられているように、痛みに対処する方法を学んでください。\n\n男の子に泣いてはいけないと教えるのは、毒々しい男らしさではありません。",
  "data/reddit-changemyview/r/changemyview/comments/q31yaf/cmv_nuclear_power_should_replace_fossil_fuels.json": "化石燃料がいまだに問題となっているのは、適切な方法で化石燃料を作っていないからです。\n誤解しないでいただきたいのですが、私は風力、太陽光、水力を支持しています。\n誤解しないでほしいのですが、私は風力、太陽光、水力を支持しています。\n地球温暖化以外の形で環境に影響を与えるか、あるいは生産性が低いか...",
  "data/reddit-changemyview/r/changemyview/comments/q3a56h/cmv_the_minneapolis_police_department_is_depraved.json": "ミネアポリスの警察について知れば知るほど、うんざりしてきます。\nしています。この警察官たちは、平和な人々を動物のように狩って、殴った後に拳を突き合わせたり、罵ったりしていた。\n殴った後に罵声を浴びせる。彼らは覆面パトカーから発砲し、人々が殴られたと思って反撃したことに驚いています。\n驚いているようですが、人々は車で殴られたと思って反撃しています。",
  "data/reddit-changemyview/r/changemyview/comments/q36bi3/cmv_body_positivity_has_the_wrong_message.json": "私は、BMI値が健康的な範囲を超えている人は、身体的にもリスクがあると考えています。\n身体的な健康を害する可能性があります。心臓病、糖尿病、臓器不全などのリスクが高くなります。\n心の健康を保つために、「自分の体型を誇りに思え」などと言われます。\nまた、精神的な面でも、心の病を引き起こすリスクがあります。",
  "data/reddit-changemyview/r/changemyview/comments/q3fiso/cmv_the_facebook_whistleblower_is_doing_exactly.json": "火曜日、フェイスブックの「内部告発者」フランシス・ハウゲンが議会で証言しました。\n[https://www.nytimes.com/live/2021/10/05/technology/facebook-whistleblower-frances-haugen]\nし、フェイスブックの規制を求めました。\n\nインターネットやソーシャルメディアに対する政府の規制が強まるのは、良いことです。\nフェイスブックと...",
  "data/reddit-changemyview/r/changemyview/comments/q3f5gl/cmv_having_a_cat_or_a_dog_as_a_pet_in_a_city.json": "双方にメリットがあると理解しています。ペットは人を幸せにしてくれます。\nペットは人を幸せにし、寂しさを和らげ、時には人生で最高または唯一の伴侶となります。\nペットは人を幸せにします。また、ペットにとっても、シェルターから家庭に入ることは、大当たりしたようなものです。\nジャックポットを当てたようなものです。\n\nとはいえ、猫が幸せな生活を送ることはできないような気がするのですが...。",
  "data/reddit-changemyview/r/changemyview/comments/q3n41l/cmv_neopronouns_like_xey_zir_and_xe_have_no.json": "なぜそう思うのか、その理由を述べる前に、私にはノンバイナリーの友人がいます。\nこの意味と重要性について聞いてみました。\n私はBen Shapiro owns liberalのビデオを見て、それに基づいて議論したわけではありません。\n\n\n\nネオ代名詞の定義は、新しい(neo)代名詞のカテゴリーです。",
  "data/reddit-changemyview/r/changemyview/comments/q3n1ah/cmv_its_crazier_not_to_believe_in_aliens_than_to.json": "ちょうどこのビデオを見たところです。\nhttps://www.reddit.com/r/oddlyterrifying/comments/q37xrc/how_big_this_universe_really_is/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\n地球上には約870万種の生物が存在しています。人間はそのうちの1種である。\nそのうちの一つです。何十億もの生物の中で、人間が占める割合はとても高いのですが...。",
  "data/reddit-changemyview/r/changemyview/comments/q3ov4r/cmv_computer_games_now_have_better_music_than.json": "若い頃、映画を見に行って、そのクオリティーの高さに驚かされたことを覚えています。\nスコアの質に驚かされたものです。サウンドトラックを購入して聴いていたほどです。聴いていない人はいないでしょう。\n帝国の行進」を聞いて、背筋がゾクゾクしない人はいないでしょう。\n時を超えて愛される音楽です。すべての映画（というほどでもないが）に...",
  "data/reddit-changemyview/r/changemyview/comments/q3ovat/cmv_adding_phobic_to_the_end_of_a_statement_does.json": "文章の最後に「恐怖症」という言葉を付け加えるだけで、相手の視点を無視して\n自分が正しいと思い込んでしまうことになります。\nこれでは、オープンな議論ができません。\n\nもし、その人がLGBTQコミュニティを嫌っていたらどうするの？\nのコミュニティを嫌っていたらどうするの？",
  "data/reddit-changemyview/r/changemyview/comments/q3r2p3/cmv_military_shouldnt_be_able_to_recruit_in.json": "教室に入って、大人ではない人の目を見て、その人の将来を約束して、その人を冷たくしてしまうようなことはできないはずです。\n大人ではない人の目を見て、未来を約束して、冷徹な殺人者に変えてしまうようなことがあってはならない。\n殺し屋にしてはいけない。\n\n彼らは、自分が担っている役割の重大さや、それが彼らの人生にどのような影響を与えるかを理解していません。\nその人の人生にどのような影響を与えるかを理解していません。もし、大人が子供を誘惑したら...。",
  "data/reddit-changemyview/r/changemyview/comments/q3jokk/cmv_choosing_to_not_shave_your_head_completely.json": "ハゲの兆候が出てきたら、髪を剃らないのは情けなくて見栄を張ることになる、というのがよくある話です。\n髪の毛を剃らないことは、何か哀れで虚しいことのように思われています。まるで、若さや若々しさにしがみつこうとして\n若さや若さにしがみつこうとして、惨めに失敗したり、恥をかいたりしているようなものです。\n自分自身を恥じているようなものです。唯一の \"尊厳ある \"行動は、辞職することだと...。",
  "data/reddit-changemyview/r/changemyview/comments/q3tavn/cmv_average_service_should_receive_3_stars_on_5.json": "まず、個人的には、基準が明確に示されていない限り、クラウドソースのレビューはあまり信用できません。\n基準が明確に示されていない限り、個人的にはクラウドソースレビューをあまり信用しません。もしサイトやアンケートに、星3つと星4つの比較が明記されていなければ\n4つ星と比較して3つ星の意味を明記していなければ、システム全体が大雑把になってしまいます。しかし、私の考えでは、3は\n私の考えでは、3つの星は平均的であり、半分の星は...",
  "data/reddit-changemyview/r/changemyview/comments/q3xkm4/cmv_the_tv_series_the_wire_champions_conservative.json": "参考：若干のネタバレあり（10年以上前の番組なので\n\n\n\nHBOシリーズ「The Wire」のファンの方は、一見すると、「The Wire」はリベラルで中立的な考えを示す番組だと思われるかもしれません。\n一見すると、リベラルな考えに中立的な番組だと思うかもしれません。\n多くの人々は、警察の失敗や、麻薬業界で働く人々のことを指摘するでしょう...",
  "data/reddit-changemyview/r/changemyview/comments/q3zi3k/cmv_if_a_news_headline_quotes_someone_stating.json": "基本的には、「言った」という言葉が最もニュートラルな言葉であるというのが私の考えです。\nというのが私の考えです。他の言葉には特定の意味合いが含まれているため、誤解を招く可能性が高くなります。\n誤解を招く恐れがあります。次の3つの仮想的なヘッドラインを考えてみましょう。\n\n\"Government insider claims policy X has been a failure\" (政府関係者、政策Xは失敗だったと主張)\n\n\"Government...",
  "data/reddit-changemyview/r/changemyview/comments/q3ze9m/cmv_the_root_cause_for_cosmetic_surgery_is_fear.json": "このことについて、私はしばらく前から家族や友人と議論しています。彼らの\n彼らの主張は、もし自分の外見について何か気になることがあって、それが変えられるなら\n変えられるものなら、変えればいいじゃないか」というものです。\n\nこれに対して私は、「なぜそれがあなたを悩ます必要があるのか？あなたは自分の価値を高めるために幸せになるべきです。\nそうでなければ...",
  "data/reddit-changemyview/r/changemyview/comments/q48hb1/cmv_toothpaste_squeezers_are_a_waste_of_money.json": "このような製品を指しています。\n[https://www.amazon.com/dp/B084KHHF5F/ref=cm_sw_r_oth_api_glt_fabc_225C9YW97R2VBJ149QD3?_encoding=UTF8&psc=1]\nこれはお金の無駄遣いだと思います。\n\n私の妻は歯磨き粉のチューブを2、3ヶ月で使い切ってしまいますが、この例では気前よく見積もってみます。\nこの例では気前よく見積もって...。",
  "data/reddit-changemyview/r/changemyview/comments/q4cjw6/cmv_rhode_island_should_be_absorbed_into.json": "歴史的な問題を除けば、ロードアイランド州が独自の州である理由はもはやありません。\nRhode Islandが独自の州である理由はもはやありません。代わりにLittle Rhodyを分割して、本土西部はコネチカット州に併合して\n本土西部はコネチカット州に併合して、ナラの東側は\nナラガンセット湾以東はマサチューセッツ州の一部になる。これは良いことではあるが...。",
  "data/reddit-changemyview/r/changemyview/comments/q4hi1c/cmv_social_media_companies_tracking_storing_or.json": "「しかし、あなたはToSで同意しています」って、うるさいな。ToSに記載することはできないはずです。\n入れることはできません。\n\n\"でも、彼らは民間企業だから、やりたいことをやれるはずだ\"\n黙れ。ネスレもエロンもBPもモンサントも、好き勝手にやらせてもらえた私企業です。\nその結果どうなったかというと...。",
  "data/reddit-changemyview/r/changemyview/comments/q4e829/cmv_calling_a_black_person_whitewashed_is_racist.json": "(既に話題になっていたらリンクしてください😁)\n\ntiktokをよく見ていると、黒人の人が「ちゃんと」話しているビデオがありますよね。\n基本的にはAAVEではなく、「ちゃんと」話している黒人のビデオがあると、何百ものコメントが寄せられます。\n白人に選ばれたのか？\n彼らはまた...",
  "data/reddit-changemyview/r/changemyview/comments/q4p4lz/cmv_the_play_hamilton_encourages.json": "歴史好きで、BAの歴史家で、最近では歴史の教師でもある私は、長い間\n一般の人々が多くの歴史上の出来事をどのように見ているかに不満を持っていました。\n歴史を教えたいと思ったのはそのためです。だからこそ、歴史を教えたいと思ったのです。私は\n情熱的でニュアンスに富んだ歴史の理解を促したい...",
  "data/reddit-changemyview/r/changemyview/comments/q4r1f1/cmv_society_needs_to_get_back_to_ignoring_speech.json": "例外はありますが、それはその人が権力や権威のある立場にいて、その人の発言がネガティブなものであった場合です。\n権力者の立場にあり、その発言が生活の中で人々に悪影響を与えていることを示している場合です。\n企業の経営者、政治家、法律上の権限を持つ人など、生活の中で人々に悪影響を与えていることを示す場合です。\n権力者の場合です。\n\nただし、その場合は...",
  "data/reddit-changemyview/r/changemyview/comments/q4pla8/cmv_single_issue_evangelical_antiabortion_voters.json": "福音主義者の家族と何度か話をしたことがあります。\n彼らは信仰に基づいたいくつかの政治的スタンスにはとても厳しく、厳格なのですか？\nしかし、他の多くのことは気にしないのでしょうか？血の犠牲が人生の大きな部分を占めていないように。\n例えば、血の犠牲は人生の重要な部分ではないとか、なぜ貝を食べたり、布を混ぜたりしてはいけないのかとか...。",
  "data/reddit-changemyview/r/changemyview/comments/q4s63v/cmv_hating_on_people_who_take_refuse_the_covid19.json": "特にネット上では、自分の意思ではなく、自分の意思で行動している人のことをこう呼ぶのが一般的になっています。\nワクチンを拒否する人を「バカ」「わざとらしい」と言ったり、さらには、ワクチンを拒否する人を\n病気になって死ぬのはいいことだと思っているようです。\nと言っています。\n\nこれは、現代医学に対する前例のない拒否反応です。",
  "data/reddit-changemyview/r/changemyview/comments/q5159q/cmv_dave_chappelle_was_not_being_transphobic.json": "最初に断っておきますが、私はタイトルにある断言に100％同意しているわけではありません。\nだからこそ、私はここに来て、皆さんとお話をして、この状況をよりよく理解し、意見を持つことができるようにしたのです。\nこの状況についてより良い理解と意見を形成するために、ここに来たのです。少し背景を説明すると、私は\n私はこの論争について、私のセラピストと話しました。",
  "data/reddit-changemyview/r/changemyview/comments/q54j0l/cmv_everyone_should_make_good_money_not_just.json": "すべての労働者は、社会に対してサービスを提供しています。人々は、「なぜワッパー・フリッパーが良いお金を稼がなければならないのか？\n人は「なぜワッパー・フリッパーが儲かるのか？彼らはそれに値しない」と言います。私はそれに同意しません。彼らは\n私たちが好きな食べ物を作っているのですから。そうでしょう。美味しいワッパーが嫌いな人はいないでしょう。\nこのようなことを言う人は、まるで未熟な...と言っているかのようです。",
  "data/reddit-changemyview/r/changemyview/comments/q5d6q8/cmv_pizza_makers_should_spend_extra_time_to_make.json": "最初は、反対側のないCMVのように見えます。しかし、これだけの数の\n私が今まで食べてきたピザの中には、トッピングが偏っているものがたくさんありました。\n私はこのCMVが必要だと思っています。全てのピザについてですが フル\nピザ屋さんのフルパイ、冷凍ピザ、パーソナルパイ。空っぽの状態で...",
  "data/reddit-changemyview/r/changemyview/comments/q5eg52/cmv_sometimes_i_feel_like_people_from_usa_wants.json": "なぜ人々は自分たちのことをアフリカ系アメリカ人、イタリア人、アジア人、ネイティブ・アメリカン......と呼ぶのが好きなのでしょうか？\nアジア人、ネイティブ・アメリカン......自分の主な文化以外のものを指すのはなぜだろう？ヨーロッパ人である私は\nアメリカから来た人たちが人種差別についてオンラインで議論したり、親が日本人だからといって\n自分の両親が日本人だからといって、自分を日本人と呼んだりするのは、ヨーロッパ人としてとても不思議に思います。",
  "data/reddit-changemyview/r/changemyview/comments/q5hmnu/cmv_the_slavery_in_the_old_testament_is.json": "私は25年以上もクリスチャンでした（現在はAgnostic）。クリスチャン時代には\n旧約聖書の奴隷制度についての私の見解は、基本的に「当時の社会的規範は\n神は自分が持っているもので仕事をしようとした」というものでした。\n\nこれはひどい言い訳です。なぜなら、神が道徳を作った人は、そのようなことをすべきではないからです。",
  "data/reddit-changemyview/r/changemyview/comments/q5e0jr/cmv_in_self_defense_the_defender_should_have.json": "誤解のないように申し上げますが、ここでは脅威がまだ続いている場合についてのみお話します。もし誰かが\n逃げている人の背中を撃つことはできないはずです。\n後ろから撃つべきではありません。しかし、誰かに殴られて、まだ脅威が残っている場合は\n刺すか撃つかして無力化することができるはずです。パンチは...",
  "data/reddit-changemyview/r/changemyview/comments/q5ift8/cmv_the_current_political_climate_us_is_mostly_a.json": "どのような政策が「正しい」と考えているかは、明らかに人によって違います。\nポリシーの違いがあります。しかし、その多くは、エコー・チャンバラの作成によって誇張され、悪化しています。\nエコーチェンバー（反響室）を作ることで誇張され、悪化させています。\nその結果、メディアやその他の権力者は、自分の影響力や収入を増やすために、エコーチェンバーを利用することになります。\n\nそこには...",
  "data/reddit-changemyview/r/changemyview/comments/q5nf40/cmv_following_the_rules_of_the_road_when_driving.json": "礼儀正しい」というのは、私が左のウィンカーを出したら、後ろの車や左の車が少しだけスピードを落として、私が追い越せるようにしてくれた、という意味ではありません。\n私が左ウインカーを出したら、後ろと左の車が少しスピードを落としてくれて、私が追い越すことができた、という意味ではありません。そういうのはありがたいですね。\nそういったことには感謝している。私が言っているのは、すべての交通法規を無視して、その結果、非常に危険な状態になっている人のことです。\nその結果、非常に予測不可能な状態になってしまうのです。ここでいくつか...",
  "data/reddit-changemyview/r/changemyview/comments/q5pwyn/cmv_fahrenheit_is_less_usefull_than_celcius.json": "華氏を支持する意見で最も多いのは、システムのベースである\nこれは、0＝本当に寒い、100＝本当に暑いという意味です。これは確かに日常的に使われるシステムで\nこれは間違いなく日常的に使われるシステムであり、それに慣れていれば天候がどのように振る舞うかを\n慣れていれば、天候がどのように変化するかを知ることができます。\n\nしかし、しばしば0-100の例は...。",
  "data/reddit-changemyview/r/changemyview/comments/q5ov6d/cmv_giving_reddit_awards_to_celebrities_or_large.json": "著名人や有名な大企業に賞を与えるのは、賞もお金ももったいない。\n賞とお金の無駄遣いです。例えば、ここを見てください。\n\nhttps://www.reddit.com/user/RobinhoodTeam/\n\nこのアカウントはRobinhood／RobinhoodのCOOが所有しています。彼女は多くの賞を受賞しています。\n金賞を含む多くの賞を受賞しています...",
  "data/reddit-changemyview/r/changemyview/comments/q5wch8/cmv_i_am_happy_to_see_that_seeking_therapy_is.json": "これは私が感じたことです。これは、私や私の周りにいる人たちと関係があるかもしれませんが\n周りにいる人との関係もあるかもしれませんが、「セラピーを受けてみませんか？\n人を黙らせる方法として、「セラピーを考えたことがありますか」というセリフを言う人が増えてきたように感じます。\n人を黙らせる方法として、「セラピーを考えてみませんか？彼らは本当に聞きたくないのです...。",
  "data/reddit-changemyview/r/changemyview/comments/q5px8l/cmv_the_use_of_the_word_depressed_as_an_adjective.json": "長い記事ではなく、短い記事にしたいと思います。もちろん、それが\nこれでは何の保証にもなりませんが、私は、少なくとも\n私は、少なくとも心の底から、この問題について何か議論をしてほしいと思っています。\n\n最近では、「...」などの言葉の使用が取り締まられています。",
  "data/reddit-changemyview/r/changemyview/comments/q5wx18/cmv_it_makes_more_sense_logically_to_join_the.json": "Redditのコミュニティでは、軍隊を下げて楽しんでおり、軍隊は \"バカ \"だと言っています。\nしかし私は、18歳で軍隊に入隊する方が、大学に行くよりも論理的に理にかなっていると思います。\n大学に行くよりも、18歳で軍隊に入る方が論理的に理にかなっていると思います。\n\n大学です。長所。どこの学校に入れるかの選択肢が増える。\n長所 より多くの...",
  "data/reddit-changemyview/r/changemyview/comments/q5xda8/cmv_it_should_be_socially_acceptable_for_men_to.json": "私は何も思いつきません、私は本当に努力しました、私はただ人々が何を考えているのか知りたいのです。\nどうなんだろう？私は本当にここを見ています。今の社会が平等であるというならば\n女性が男性用の服を着ているときに、男性が女性用の服を着ることを許せないということはないはずです。\n女性がいつも男性の服を着ていても誰も気にしないのに。私の...",
  "data/reddit-changemyview/r/changemyview/comments/q5y5zu/cmv_china_is_basically_the_same_if_not_worse_than.json": "まず第一に、最も明白なことは、彼らは少数民族のジェノサイドを犯しているということです。\n確かに多くの人をガス室に押し込むようなレベルの虐殺ではありません。\nしかし、戦前のナチスドイツも同様でした。中国は組織的に\nあらゆる文化を破壊し、完全に...",
  "data/reddit-changemyview/r/changemyview/comments/q6186e/cmv_traffic_laws_should_be_enforced_by_an_unarmed.json": "警察官に交通法規を守らせることは、資源の非効率的な使用であり\n一般市民と警察官の両方にとって不必要に危険な状況を作り出しています。\nることになります。警察は非常に多くの難しい仕事を抱えています。\n交通違反の取り締まりを外せば、警察官は交通違反の取り締まりに集中でき、より良い仕事ができるようになります。",
  "data/reddit-changemyview/r/changemyview/comments/q621lb/cmv_unless_you_are_an_elite_or_personally_profit.json": "ジュリアン・アサンジは現在、英国のベルマーシュ刑務所に収監されています。\n米国政府は、アサンジの身柄を引き渡さないとした下級裁判所の判決を不服として控訴しており、その決定を待っています。\n米国政府は、アサンジを米国に送還しないとした下級審判決に対する控訴審の判決を待っています・・・。",
  "data/reddit-changemyview/r/changemyview/comments/q68itd/cmv_the_catholic_church_is_the_oldest_running_and.json": "フランスはカトリック教会の最新の司法管轄区域です。\nフランスでは、カトリック教会が歴史的な児童虐待を行っていたことが明らかになりました。\n\n小児性愛者は、子供たちに手をかけ、虐待するために潜入し、信頼を得られる機会に惹かれることは明らかです。\n潜入して信頼を得て、手なずけたり虐待したりする機会に惹かれるのは明らかです。これはカトリック教会に限ったことではありません。\nカトリック教会に限ったことではありませんが...",
  "data/reddit-changemyview/r/changemyview/comments/q6amx0/cmv_trickle_down_economics_does_not_work_and_the.json": "私は古い 私の人生のほとんどはトリクルダウン経済が行われてきました。大企業に大幅な\n大企業に減税をすれば、米国内に企業が残り、それが最終的には中小企業にも届く。\n大企業に減税をすれば、大企業はアメリカ国内に留まり、最終的には小市民にまで届く。私の経験では、それは起こりませんでした。私の経験では、そうはなりませんでした。\n大幅な税の不均衡で、富はトップに保たれています。コストが...",
  "data/reddit-changemyview/r/changemyview/comments/q5zf9m/cmv_you_should_not_use_reddit_as_a_primary_source.json": "こちらのスレッドに触発されました\n[https://old.reddit.com/r/changemyview/comments/q5xsnt/cmv_i_should_get_the_covid19_booster_even_though/]をご覧ください。\nTL;DR あるredditorは、COVIDワクチンのブースターを受けることについて、自分の考えを変えてほしいと言っていました。\nワクチンブースターを受ける資格も権限もないにもかかわらず、その見解を変えてほしいというものでした....",
  "data/reddit-changemyview/r/changemyview/comments/q6kua0/cmv_all_drugs_should_be_fully_legalized_including.json": "私は、すべてのドラッグ（そう、すべてのドラッグ）は直ちに合法化されるべきだと信じています。\n人々がそれらを販売するための合法的で規制された、そして課税された市場を作るべきだと思います。\n\n> (；`・ω・）＞でも、そうなると、みんな好きな時にドラッグを試せるようになってしまいますね。薬物の過剰摂取は\n> 過剰摂取が急増してしまう\n\n人々がドラッグを試したいと思うなら、私は...。",
  "data/reddit-changemyview/r/changemyview/comments/q6cc4v/cmv_neo_pronouns_are_useless.json": "もちろん、私はlgbtqを支持していますが、言葉を作って表現する意味が理解できませんでした。\n言葉を作って、それを代名詞と呼ぶ意味がわかりませんでした（例えば、xe/xemのように）。その代名詞が何を意味しているのかもわからないし\nその代名詞が何を意味しているのか、どうやって自分が作ったものに\n識別できるのか理解できません。例えば、自分の性別を作ったとしても...。",
  "data/reddit-changemyview/r/changemyview/comments/q6mvsu/cmv_gender_doesnt_change_throughout_the_day.json": "https://www.ravishly.com/im-genderfluid\n\n私は、「ジェンダーフルイド」とは、ジェンダーを探求している人という意味であって、一日中異なるジェンダーと呼ばれたいと感じている人という意味ではないと考えていました。\n一日のうちに異なる性別で呼ばれたいと感じていることを意味します。\n\n「一日の中で、男性的なものから、アンドロジナスなもの、女性的なものまで、様々に変化することがあります。\nアンドロジナス、フェミニン...。",
  "data/reddit-changemyview/r/changemyview/comments/q6n2bf/cmv_there_is_no_mental_health_epidemic_were_just.json": "現代の若者の間では、「心の病」が蔓延していると言われています。\nしかし私は、これは何も新しいことではないと主張します。私たちはようやく\n私たちはようやく、メンタルヘルスの問題を認識し、それを受け入れるようになりました。前の世代では\n以前の世代では、人々はセラピーに行くことはなく、それは...と認識されていました。",
  "data/reddit-changemyview/r/changemyview/comments/q6omck/cmv_saying_that_you_cannot_be_racist_towards_a.json": "人種差別＝権力＋特権」という感情の裏にある論理を理解しつつも\n特権」という感情の背後にある論理は理解できますが、その主張は、世界中で起こっている偏見や差別の範囲を理解しようとすると、崩れてしまいます。\n世界中で日常的に起きている偏見や差別の範囲を理解しようとすると、この議論は崩れてしまいます。\n世界中で日常的に起こっている偏見や差別の範囲を理解しようとすると、議論は破綻してしまいます。\n\n私はチュニジアの路上で唾を吐きかけられたことがあります...",
  "data/reddit-changemyview/r/changemyview/comments/q6i01j/cmv_wandavision_romanticized_wanda_and_her.json": "もし私がトラウマのある人生を送っていて、愛する人を失ったことでブチ切れてしまい\n大勢の人を誘拐してしまったら、その場で狙撃されて犯罪者扱いされてしまう。\nワンダビジョンでワンダがやっていたのは、まさにこのことなのです。\n\n精神病エピソードは、誰もが本質的に犯罪者になるわけではありません。物事は...",
  "data/reddit-changemyview/r/changemyview/comments/q6y1wj/cmv_the_movement_toward_canceling_people_for.json": "批判的なことを言ったり書いたりしたために、仕事をクビになったり、ボランティアのポストから外されたりした人たち。\n集団を不快にさせるような発言や文章を書いたことで、仕事を解雇されたり、ボランティア活動から外されたりすることは、価値のある教訓ではありません。\n自分の考えやジョーク、言葉で人を怒らせたら...と教えているのです。\n人々に教えているのは、もしあなたの考えやジョーク、言葉で不快感を与えた場合、スピーチや書き言葉によって...",
  "data/reddit-changemyview/r/changemyview/comments/q6sasp/cmv_the_believesurvivors_movement_is_too_extreme.json": "[EDIT] 私は、このスローガンを必要以上に文字通りに読んでいるだけではないかという結論に達しました。\n読んでしまっているのではないかという結論に達しました。私は物事を文字通りに受け取る傾向があります。\n「BelieveSurvivors」というスローガンは、彼らの言葉を100％絶対的な真実として受け止めるべきだと思わせますが、実際はそうではありません。\n絶対的な真実であるかのように思わせますが、実際はそうではありません。私の考えを変えてくれてありがとう。",
  "data/reddit-changemyview/r/changemyview/comments/q71f8c/cmv_communism_is_a_fundamentally_unworkable.json": "そもそも共産主義とは、すべての財産が公的に所有され、資源が人々に与えられる経済システムと定義しています。\n共産主義とは、マルクスが描いたように、すべての財産が公的に所有され、市民のニーズを満たすために資源が与えられる経済システムです。\n共産主義とは、マルクスが提唱した経済システムです。\n\nしかし、このシステムには、いくつかの根本的な欠陥が内在しています。\n逃れることはできない。\n\nその最大の...",
  "data/reddit-changemyview/r/changemyview/comments/q742hc/cmv_we_should_defund_the_atf.json": "ATFに0ドルの予算を与えよう。彼らは最も無能で腐敗した連邦法執行機関であることを組織的に証明している。\n最も無能で腐敗した連邦法執行機関であることを組織的に証明してきました。ウェイコ、ルビー\nウェイコ、ルビーリッジ、彼らの銃密造スキャンダル。それは表面上のことに過ぎません。彼らには\nあらゆる法律の中で、最も尻軽で腐敗した、全く狂った歴史を持っています...",
  "data/reddit-changemyview/r/changemyview/comments/q75f3f/cmv_the_subreddit_twoxchromosomes_is_one_of_the.json": "そこでの投稿の大部分は男性に対する性差別的なもので、彼らは極端に一般化しており\n極端に一般化していて、男性が例えばレイプ犯であったり、あらゆる面で悪かったりすることを書いていることが多いです。\n社会的な合図を理解していない、などと書いています。権威主義的でもあります。\n批判的で市民的な会話をしようとすると...。",
  "data/reddit-changemyview/r/changemyview/comments/q7bgco/cmv_the_uswnt_has_no_clothes.json": "CNNが費用を負担して制作した新しい映画が公開され、米国女子サッカー界のパーティー構造に関する数年間のメディアの報道を締めくくる。\nアメリカ女子サッカーの党派構造について、メディアが大きく取り上げた数年間を締めくくるものです。\n\n彼女たちは一貫して不平等な賃金を主張してきた。\n\n彼女たちの訴訟を棄却した公式の判断は次のようなものだった。\n以下の点です。\n\n彼女たちとその...",
  "data/reddit-changemyview/r/changemyview/comments/q7esuq/cmv_legitimate_news_sites_need_to_stop_saying.json": "何でもかんでも「叩かれる」ことにはうんざりです。全く意味のないことです。もし\n誰かが誰かに「叩かれた」としても、実際に何が起こったのか何もわからない。\n実際に何が起こったのかについては何もわかりません。\n\nニュースは実際に何が起こったのか、なぜ起こったのかを報道する必要があります。何か違法なことがあったのか？はたまた\n誰かの単なる意見なのか？正当なものなのか...。",
  "data/reddit-changemyview/r/changemyview/comments/q7hab0/cmv_it_is_ok_to_give_a_beggar_money.json": "私は、物乞いの人がお金を要求している場合、その人にお金をあげてもいいと確信しています。\n\n確かに、多くの人はそのお金を利用して、不愉快なことに使うでしょう。\nしかし、もしあなたが物乞いにお金をあげて、その人が自分のために食べ物を買ったり、面接のためにスーツを買ったりすることができたとしたらどうでしょう。\n仕事の面接のためのスーツを買うことができたとしたら...。",
  "data/reddit-changemyview/r/changemyview/comments/q7jlfz/cmv_adding_pronouns_to_emails_sigs_and_zoom_call.json": "さて、「スティーブン」という人からメールが届いたとします。スティーブンさんはどんな\n代名詞は？おそらく「he/him」ではないかと推測します。でも、もしかしたら\nスティーブンは実際にシスウーマンである可能性があります。結局のところ、私はマイケルという名前の女性を知っていますし\nマリアという名前のシスの男性にも何人か会ったことがあります。だから、それは...",
  "data/reddit-changemyview/r/changemyview/comments/q7y58k/cmv_xenogenders_arent_valid_and_dont_make_any.json": "この信念は、カテゴリーとその実用性という考えに基づいています。カテゴリーがあると\nあるカテゴリー（この例では「性別」）があるとき、それがカテゴリーであるためには、あるものを含み、他のものを除外しなければなりません。\n除外しなければカテゴリーとは言えません。もしそれが自分の好きなように成形できるのであれば、それはカテゴリーではありません。\nそれはもうカテゴリーではなく、ただの言葉であり、...",
  "data/reddit-changemyview/r/changemyview/comments/q82vrq/cmv_the_united_states_should_require_a_stint_of.json": "フィンランドのような国では\n[https://en.wikipedia.org/wiki/Conscription_in_Finland], デンマーク\n[https://en..wikipedia.org/wiki/Conscription_in_Denmark]、ノルウェー、ギリシャなどの国では\n国民が一定の年齢に達すると、数ヶ月間の兵役が義務付けられています。\n異議を唱える人には...",
  "data/reddit-changemyview/r/changemyview/comments/q8427b/cmv_the_variants_mrs_and_miss_should_be.json": "これらのバリエーションを持つ正当な理由はありません。昔、女性が\n女性が男性と結婚する対象と見なされていた時代には、より多くの目的がありました。しかし、今ではそれは\n今では、様々な場面で女性が結婚していることを公表することは、不必要な判断材料となっています。\n結婚していることを公表することを期待されているのは、不必要な判断です。また、「Miss...」の使用は",
  "data/reddit-changemyview/r/changemyview/comments/q85he5/cmv_things_like_watch_your_drink_or_use_a_buddy.json": "r/coolguides [/r/coolguides]では、「飲み物を見たら、スパイクしてはいけない」とか\n飲み物を見たら、スパイクしてはいけない」など、これらのヒントを逆さまにして\n犠牲者を出すべきではないという理由で、これらのヒントを逆転させています。しかし、これらは\n犠牲者を責めることではありません。もし、あなたが家のドアに鍵をかけず、それが...",
  "data/reddit-changemyview/r/changemyview/comments/q8c63k/cmv_genital_mutilation_of_minors_must_be_banned.json": "ここでは欧米の話をしていますが、他の地域では状況が異なるかもしれません。\nの地域ではどうでしょうか？\n\n女の子の性器の一部を手術で切除することが違法であるとする正当な理由は見当たりません。\n女の子の性器の一部を手術で切除するのは違法で、男の子の性器に同じことをするのは完全に合法で、（少なくともアメリカでは）一般的でさえあります。\nしても全く問題ありません。唯一の理由は、それが...",
  "data/reddit-changemyview/r/changemyview/comments/q868e6/cmv_there_is_nothing_inherently_wrong_with_the.json": "コンテキスト 私は、非常にリベラルな都市で、テクノロジーとアートの両方に関連する分野で働いています。\nリベラルな街で、技術と芸術の両方に関わる仕事をしています。この1年で、多くの論文や記事が発表されました。\nこの1年で複数の論説や記事が出回り、技術関連の語彙を変えるように人々に呼びかけています。\nテックの世界で使われる言葉を変えようと呼びかけています。例えば、「ブラックリスト」や「ホワイトリスト」などの用語を削除することです。",
  "data/reddit-changemyview/r/changemyview/comments/q8pzax/cmv_curved_phone_screens_are_designed_to_be_more.json": "私は自分の携帯電話（Huawei p30 pro）を馬鹿みたいに落下させてしまいましたが、私がつけていたカバーは少しも保護されていませんでした。\nカバーは少しも保護されておらず、完全に粉砕されてしまいました。\n評判の良い電話ショップに修理を依頼したところ、220ユーロの修理代を請求されました。\nと言われました。私の気のせいでしょうか、それとも...3倍、4倍くらいの金額でしょうか。",
  "data/reddit-changemyview/r/changemyview/comments/q8wzeb/cmv_exams_should_utilize_multiple_choice_less.json": "つまり問題は、多肢選択式の場合、学生が学習ではなく、詰め込みや暗記、反芻をしてしまうことが多いということです。\n詰め込み、暗記、反復を促します。ある種の科目では、複数の選択肢\n推測や消去法で正解にたどり着けない場合は、多肢選択式でも問題ありません。\n推測や消去法では正解にたどり着けない場合は、多肢選択式でも問題ありません。",
  "data/reddit-changemyview/r/changemyview/comments/q8yq0e/cmv_jason_voorhees_is_highly_derivative_of.json": "スラッシャー・ホラーのサブジャンルには、全体的に共通した特徴があります。\nがあります。ある種の殺人鬼が集団をストーキングして殺していく。\n人々（多くの場合、ティーンエイジャー）を一人ずつ殺していきます。多くの人はこれを最初のスラッシャーとは呼ばないでしょうが\n最初のスラッシャーとは言わないが、最も重要な映画の一つは、ジョン・カーペンターの...",
  "data/reddit-changemyview/r/changemyview/comments/q97a6m/cmv_builtin_ads_on_youtube_are_bs_and_should_not.json": "私は、YouTuberが動画の中でスポンサーの宣伝をしている場合、それはかなり\n卑怯だと思います。クリエイターがマネタイズを必要としていることは理解しています。だから、私は\n30秒～2分程度の広告をスキップすることには反対しません。私が言いたいのは、クリエーターが\nこれ以上話を進める前に、私たちの......」と言った場合の話です。",
  "data/reddit-changemyview/r/changemyview/comments/q9crtx/cmv_rude_servers_shouldnt_expect_tips.json": "おそらく、この件については、捨て台詞を選んだ方が良かったと思うかもしれませんが、ここで紹介します。\n\n私はアメリカ人ではありませんが、ここではアメリカのチップ文化に注目しています。\nここではアメリカのチップ文化に注目しています。イギリスにもチップの文化はありますが、私たちは標準的な最低賃金を受け取っているので、「期待される」チップは\n最低賃金を受け取っているので、「期待される」チップは一般的に10％程度です。私は10年以上も前に...",
  "data/reddit-changemyview/r/changemyview/comments/q95blb/cmv_lavish_campaign_contributions_to_usa.json": "夕食時に家族と議論したのは、「米国の政治家への多額の選挙寄付は透明性に欠ける」という論点でした。\nアメリカの政治家への献金は透明性に欠ける。しかし、誰も反論\nしかし、誰も反論や反証を思いつきませんでした。何かありますか？\n\n簡単な英語で書いてください。英語は私の第一言語ではありません。私は政治家ではありません。\n政治的な...",
  "data/reddit-changemyview/r/changemyview/comments/q9htmt/cmv_conservatives_are_the_ones_that_are_actually.json": "まず、私が「保守的」と言っているのは、保守的な意見を持っている人全般を意味しています。\n一般的に保守的な意見を持つ人のことで、保守的な投票をする人のことではありません。しかし、保守派の人たちはよく\nしかし、保守派の人たちは、最近の人たちは敏感すぎると文句を言いますが、実際には彼らこそが\nしかし、実際には、彼らは変化を望まないので、彼らは...に不快感を覚えます。",
  "data/reddit-changemyview/r/changemyview/comments/q9k0rh/cmv_context_needs_to_be_determined_before_u_can.json": "誰かが何かを攻撃的または人種差別的であると言う前に、全体の文脈を必要とします。\nそうでなければ、あなたは不完全な理解しかできず、判断する資格はありません。\n判断を下す資格はありません。\n\n私の主張を裏付けるために、ここで例を挙げます。\n\n左側に3人のユダヤ人グループがいて、誰かが「those...」と言うのを聞いたとします。",
  "data/reddit-changemyview/r/changemyview/comments/q9qziz/cmv_trying_to_rewrite_spanish_with_the_stupid_x.json": "誤解のないように言っておきますが、ラテンアメリカ人というのは、メキシコ、中央アメリカ、南アメリカの人々を指します。\nアメリカに移住したラテン系の人々だけでなく、メキシコ、中米、南米の人々を意味します。\n\n言語は文化の最も重要な部分であると私は考えています。二番目は\nは伝統・儀式、3番目は料理、4番目は芸術.... です。",
  "data/reddit-changemyview/r/changemyview/comments/q9goeu/cmv_racegendersexuality_should_be_removed_from.json": "この2つのストーリーの違いは何でしょうか？1. 人が家に侵入して\n車を盗む 2. 白人男性が家に侵入し、車を盗む\n\n明らかに、答えは人種と性別です。細かいことを言っていると思われるかもしれませんが\n意識的にどのように認識しているかを考えなければなりません。",
  "data/reddit-changemyview/r/changemyview/comments/q9hqk9/cmv_there_is_a_fundamental_difference_between.json": "医療、食料、水は人間の基本的なニーズであり、権利ではありません。これは意味深に見えるかもしれませんが\nこの境界線を曖昧にしてしまうことは、現在のPeopleの\nこの境界線を曖昧にすることは、現在の政治的言説のかなり否定的な側面です。まず、定義から始めましょう。\n定義から始めましょう。\n\n必要：人間が合理的に維持するために必要なもの...",
  "data/reddit-changemyview/r/changemyview/comments/q9z90w/cmv_men_should_have_the_right_to_optout_of.json": "ここでは、「男性の権利」をテーマにしてみたいと思います。\nの問題に焦点を当てたいと思います。これは、中絶の道徳性についての議論ではありません。\n本題に入るために、中絶は道徳的に倫理的であり、安全であり、状況に関係なくすべての女性が利用できるものであると仮定します。\n倫理的で、安全で、すべての女性にとって利用しやすいものであると仮定します。",
  "data/reddit-changemyview/r/changemyview/comments/q9zuua/cmv_term_limits_on_the_basis_of_age_for_united.json": "米国では、議会と大統領に年齢による任期制限を設ける必要があります。\n大統領に年齢による任期制限を設ける必要があります。\n\n70歳以上の高齢者は、精神的な衰えにより、雇用されないとみなされることが多いし\n70歳以上の高齢者は、精神的な衰えや時代との乖離により、雇用されないと思われがちですが、米国では多くの高齢者が政治家として\nアメリカでは多くの人が政治家として活躍しています。最高齢の...",
  "data/reddit-changemyview/r/changemyview/comments/q9uyr9/cmv_i_dont_think_georgia_should_outlaw_the_combat.json": "ジョージア州のいくつかの郡では、戦闘裁判という選択肢があります（質問があればコメントでお答えします）。\nコメントでお答えします）、ジョージア州のいくつかの郡で行われています。基本的には、民事訴訟（通常は少額訴訟）で取るべきルートです。\nこれは一種の野蛮で原始的なものですが、ほとんどの州では非合法です。\nこれは野蛮で原始的なことですが、ここジョージア州のほとんどの郡や市では非合法です...",
  "data/reddit-changemyview/r/changemyview/comments/qa1oz1/cmv_the_term_latinx_is_an_imperialist_intrusion.json": "私はこのビデオに出会いました。https://youtu.be/UCVCPJqIguU\n\nずっと若いラテン系の生徒が、ラテン系の先生に向かって、ラテン系という言葉を採用するように説得しています。\nラチノックスという言葉を採用するように先生に迫ります。\n\n最後には \"nx \"で終わる英語の単語を並べて間違った例え話をしています。\n.... でも、このビデオの内容を損なうものではありません...",
  "data/reddit-changemyview/r/changemyview/comments/qa5xkt/cmv_modern_day_american_christianity_is_only.json": "EDIT: 私が言いたいのは、アメリカのキリスト教はポジティブな制度として組み立てられているということです。\n実際には、不寛容と偽善で社会を積極的に抑制しています。\nと偽善で社会を阻害しているということです。\n\nEDIT 2: キリスト教が文化や政策に与える影響についての私の視点は変わっていないと思います。\nEDIT 2: キリスト教が文化や政策に与える影響についての私の視点は変わっていないと思いますが、どなたかが指摘されたように、3人に1人は",
  "data/reddit-changemyview/r/changemyview/comments/qa9xlj/cmv_marijuana_should_be_legalized_in_all_50_states.json": "このテーマについては、理解できないことがたくさんあります。例えば\nある州ではマリファナが合法だが、すべての州では合法ではないというのは、意味がわからない。州\n州には独自の法律を持つ権利がありますが、私の疑問は「なぜ？なぜ\nなぜ一部の州だけでマリファナを合法化するのか？何が理由で合法化されていないのでしょう...",
  "data/reddit-changemyview/r/changemyview/comments/qae1si/cmv_had_jfk_lived_he_would_still_be_remembered_as.json": " 1. カリスマ性：これがJFKが好かれている最大の理由であろう。\n    生きていたとしても、それは変わらないでしょう。彼は米国史上最もカリスマ性のある人物として記憶されています。\n    アメリカ史上最もカリスマ性のある人物として記憶され、それによって彼は政治的スペクトラムを超えて心をつかむことができたのです。\n    彼は米国史上最もカリスマ性のある人物として記憶されています。JFKの支持率は最も高かった。\n   ...",
  "data/reddit-changemyview/r/changemyview/comments/qakf69/cmv_drugs_should_be_completely_decriminalised_for.json": "個人的に使用するための薬物を所持していても、それを告発することはできません。\n告発すべきではありません。私は、麻薬の売人や販売者は法の責任を負うべきだと思います。\nしかし、使用者を犯罪者扱いすることは、問題を助長するだけです。\n問題を助長することになります。薬物乱用の問題を抱えているほとんどの人は、その理由が...",
  "data/reddit-changemyview/r/changemyview/comments/qaixj9/cmv_bitcoin_mining_using_non_renewables_should_be.json": "地球温暖化は人類の生存にとって深刻な脅威であり、正当な理由なくこの問題に拍車をかけているのは正気の沙汰ではありません。\n正当な理由もなく、この問題に拍車をかけるのは非常識です。現在、ビットコイン\nマイニングは、年間でアルゼンチンの国全体よりも多くの電力を消費しています。ビットコインには\nビットコインのマイニングを禁止しても、デメリットはほとんどないでしょう...。",
  "data/reddit-changemyview/r/changemyview/comments/qaq4cv/cmv_the_term_elope_does_not_include_the_concept.json": "とてもシンプルなコンセプトです。意味的な変化は、elopeという言葉が、今では適用できるほど劇的に変化したとは思えません。\n意味の変化は、elopeという言葉が劇的に変化して、小さなローカルなものに適用されるようになるほどではないと思います。\n意味的な変化は、小さくてローカルなものに適用されるほど劇的に変化していないと思います。\n\nオックスフォードの辞書で定義されている「elope」とは\n\n> 結婚するために密かに逃げること、特に...",
  "data/reddit-changemyview/r/changemyview/comments/qaqvys/cmv_im_convinced_that_people_who_believe_in.json": "Edit: View changed, fellas. 皆さんの投稿に感謝しています。\nここで提供されるすべての意見と情報に感謝します。すべての投稿が貢献しており、crazyashley1さんの投稿が\n限界を超えてしまいました。誰もが何かを素直に信じるために、定義された証拠や、どんな証拠でも良いというわけではありません。\n私はそれが面白いと思います...。",
  "data/reddit-changemyview/r/changemyview/comments/qb0yi5/cmv_the_us_needs_to_tax_the_rich_more_and.json": "金持ちにヨットは必要ない、誰もがセカンドチャンスを得るべきだ、すべての人間は尊厳を持って生きるべきだ、などと一日中議論しています。\nすべての人にセカンドチャンスがあり、すべての人が尊厳を持って生きられるべきだと。I\nこれらはすべて、再分配を求めるまっとうな議論だと思います。\n\nでも、中には「自分のお金じゃないんだから、あなたには権利がない」と言う人もいるでしょう...。",
  "data/reddit-changemyview/r/changemyview/comments/qb48d5/cmv_gender_is_not_a_social_construct_gender.json": "この記事は、トランスフォビア（性的少数者）を揶揄するものではありません。\nではありません。\n\nジェンダーについては、最近の議論の中でもよく取り上げられています。\nこの5年ほどの間に、ジェンダーは社会的な構成要素であるということがよく言われるようになりました。\nなぜなら、異なる文化には異なる...",
  "data/reddit-changemyview/r/changemyview/comments/qb2cvm/cmv_deus_ex_machina_as_a_plot_device_used_in_any.json": "主人公が壁に背を向けているような状況では、何度も見てきました。\n主人公が壁に背を向け、状況は悲惨で、逃げ場がないように見え、すべての希望が失われているような状況を何度も見てきました。\nどんな状況でも、主人公が壁に追い込まれ、逃げ場がなく、希望を失った時に、主人公やその場にいた人とは全く関係のない奇跡が訪れて\n主人公やその場にいた人の行動とは全く関係のない奇跡が訪れ、救われる...。",
  "data/reddit-changemyview/r/changemyview/comments/qbdo8f/cmv_there_is_no_reason_for_the_us_to_support.json": "ここでは、イスラエルの状況について理解しています。イスラエルは現在\nイスラエルに無差別にロケット弾を打ち込むテロ組織「ハマス」と戦っている。\nイスラエルに無差別にロケット弾を打ち込むテロ組織ハマスと戦っています。これに対抗するために、アメリカは約30～40億ドルの寄付を行っています。\nアイアンドームという防衛システムのために、アメリカは年間約30～40億ドルの資金を提供しています...",
  "data/reddit-changemyview/r/changemyview/comments/qb70mz/cmv_preference_in_physical_attraction_doesnt.json": "言葉足らずのタイトルで申し訳ありませんが、他に言い方が思いつきませんでした。\n表現しました。\n\n最近、\"Game or Lame \"というビデオを見ていたのですが、これは男性が口説き文句を言い、女性がそれを最終的に1人に絞るというゲームです。\nこのゲームは、男性が口説き文句を言い、女性がそれを最終的に一人に絞るというものです。あるエピソードでは\nエピソードの一つでは、女性が男性の一人をノックアウトして...",
  "data/reddit-changemyview/r/changemyview/comments/qbdt09/cmv_censoring_the_word_rpe_does_no_good.json": "注：私はネイティブスピーカーではありませんので、私が言及した言葉の細かい意味合いを知らないかもしれません。\n私はネイティブスピーカーではないので、私が言及した言葉の細かい意味合いを理解していないかもしれません。\n\nf*ckやsh*tのような言葉は失礼な言葉とみなされ、それを検閲することが礼儀やマナーであるという考えがあります。\n打ち切るのが礼儀だと思っています。\n\nでもね。Rape IS very bad. それは「悪い」言葉でもなければ、失礼な言葉でもありません。それは...",
  "data/reddit-changemyview/r/changemyview/comments/qbfhe1/cmv_child_genital_mutilation_should_be_completely.json": "私の信念は次のようなものです。\n\n * 子供たちは恣意的な永久脱毛を受けるには幼すぎると判断されています。\n   子供はまだ幼いので、たとえ本人の同意があったとしても、恣意的に体を変えることはできないと判断されています。例えば、以下のようなことです。\n   例えば、子供にタトゥーを入れることは違法です。\n\n * 性器切除は大人になっても元に戻らない。\n\n * それは非常に...",
  "data/reddit-changemyview/r/changemyview/comments/qbnpfp/cmv_the_guillotine_is_better_than_lethal_injection.json": "死刑にするなら、ギロチンを使った方がいい。綺麗ではありませんが\n綺麗ではありませんが、致死注射よりもはるかに人道的です。致死性注射は\n高価で、面倒で、非効率的で、残酷です。\n\n致死注射の問題点。\n\n-企業は死刑執行のために州に薬を売りたくありません...",
  "data/reddit-changemyview/r/changemyview/comments/qbkh1y/cmvwe_should_never_see_master_chiefs_face.json": "Haloシリーズは、エキサイティングで、深く、素晴らしいゲームを提供してきました。\nを提供してきました。\n\n主人公（Haloでは人類やアービターのような他のキャラクターの話もあるので準主人公）が\n主人公（Haloでは人類やアービターのような他のキャラクターの話をするので半主人公）は)\n\n主人公は、普段は無口で無表情な男です。\n\nしかし、キャラクターの行動は十分に語っています。\n\nそれは...",
  "data/reddit-changemyview/r/changemyview/comments/qbrle0/cmv_weve_gone_from_striving_for_virtue_to.json": "何が美徳か、何が正義か、何が道徳か、といったことはもはや議論されない。最近では、人々が信じていることをただ受け入れるための\n人々が信じていることをただ受け入れるための社会運動がたくさんあります。I\nそれらの団体を否定するつもりはありませんし、それら自体が良い目的であるかどうかは別として\n否定するつもりはありません。しかし、美徳という概念全体が消えてしまったのです...。",
  "data/reddit-changemyview/r/changemyview/comments/qc45m0/cmv_i_would_rather_people_be_blunt_with_me_and.json": "私の世代（今の10代以上の若者）は、なぜか\n私の世代（今の10代以上の若者）は、なぜかコミュニケーションを重要視しておらず、忘れてしまっているようです。\nしています。女の子が僕に好意を持っているとき、彼らはたいてい「好きだよ」とは言わずに「ヒント」を出します。\n好きだよ」とは言わずに「ほのめかす」のが普通です。それは簡単なことではありませんが、ヒントは...。",
  "data/reddit-changemyview/r/changemyview/comments/qc4gbs/cmv_im_female_and_im_sexist_but_i_want_to_believe.json": "私はシングルマザーで、12歳の息子がいます。毎日、このことについて考えています。\n彼を育てています。個人的な経験から、私の見解が偏っているかもしれないことは承知しています。\n認識しています。また、社会は正反対の価値観を持った男の子と女の子を育てます。\n共に失敗する運命にあります。\n\n警告-ここでは絶対的なものを使用しています。\n\nだから、すべての父親は、私が...",
  "data/reddit-changemyview/r/changemyview/comments/qcd5bm/cmv_employees_should_be_able_to_opt_out_of_unpaid.json": "ベースラインを確立しよう 私は、現在働いている職場に対してこのような意見を持っています。\n他の雇用主がどのようにランチブレイクを扱っているかはわからない。雇用主が休憩時間を提供することが義務付けられていることは理解しています。\n私の意見は、従業員は必要に応じて無給の休憩を自由に選べるべきだというものです。\n私の意見は、従業員が無給の休憩時間をどのように使うかを、必要に応じて自由に選択すべきだというものです...",
  "data/reddit-changemyview/r/changemyview/comments/qcmjlf/cmv_climate_protestors_should_target_the.json": "これは、現在行われているExtinction Rebellionの抗議活動と、その姉妹団体であるイギリスのInsulate Britainに基づいています。\nイギリスで行われているExtinction Rebellionとその姉妹団体Insulate Britainを参考にしています。\n\n私の理論では、彼らは次のようなことをすれば、より効果的に目的を達成できると考えています。\nインフラを危険にさらし、産業や政府に直接関係する人々に迷惑をかけることで\n産業、政府...",
  "data/reddit-changemyview/r/changemyview/comments/qchuqq/cmv_america_sucks_in_2021_because_rich_people.json": "テーゼ。アメリカの中産階級と貧困層は、貧しく統治されていることをたまに恨む程度である。\nアメリカの中流階級や貧しい人々は、貧弱な統治をされていることに憤慨することがあるだけだ。金持ちは常に、統治されていることに腹を立てている。\n\nこの国が労働者にとって最悪ではなかった最後の時代には、最高税率は80％～90％だった。\n最高税率は80％～90％の範囲にありました（1940年代と1950年代）。金持ちは誰も...",
  "data/reddit-changemyview/r/changemyview/comments/qcq1zw/cmv_the_british_cheese_toastie_is_superior_to_the.json": "私は、イギリスとアメリカという言葉で、作り方のスタイルの違いを表現しています。\nチーズサンドの作り方の違いを説明するのに、イギリス人とアメリカ人という言葉を使いました。\n厳密にはそれだけではありませんが。\n\n誤解を恐れずに言えば、イギリスの多くの家庭には、このような機械が1台たくわえられています。\n戸棚の奥に隠れていることが多いのではないでしょうか。",
  "data/reddit-changemyview/r/changemyview/comments/qcuqos/cmv_abortion_is_always_tragic_and_should_be_rare.json": "中絶についての私の考えは、安全で合法的であるべきだが、できる限り稀であるべきだというものです。\n赤ちゃんを失うことは常に悲劇的なことですから。\n\n赤ちゃんを失うことは常に悲劇であるからです。\n流産を嘆く女性（および男性）について、何度も友人や家族と話をしたり、インターネットで何十もの投稿を見てきました。流産\n妊娠したことを...",
  "data/reddit-changemyview/r/changemyview/comments/qda3zy/cmvi_dont_think_religion_should_be_a_reason_to.json": "私は15歳で、（私の考え方を理解してもらうために）明らかに私は\n高校生です。もしあなたが男女一緒の体育の授業を受けたことがあるなら、ダンスユニットがあります。\nダンスユニットでは、女性の場合は男性と組まなければなりませんが、もし宗教上の理由で\nしかし、もしあなたの宗教が、男性に触れるようなことをしてはいけないと言っていたら...。",
  "data/reddit-changemyview/r/changemyview/comments/qd7swo/cmv_pitbulls_should_not_be_viewed_as_inherently.json": "最近、ここで「ピットブルは危険な犬種である」という本質的なコメントを見ました。\n犬種である」というコメントを見ました。私はそれに反論しましたが、圧倒的な反対意見に驚きました。\n驚いたのですが、反対意見が多かったのです。では、私はここで間違っているのでしょうか？\n\n私の考えでは、ピットブルが本質的に凶暴であると主張することは、ピットブルに失礼です。\nピットブルは本質的に暴力的であると主張することは、ピットブルに失礼であり、人間にも偏見を与えているというのが私の考えです。",
  "data/reddit-changemyview/r/changemyview/comments/qdka8a/cmv_it_is_wrong_to_use_small_dick_or_variations.json": "私は、人の本質的な性質を侮辱の根拠とすることは、間違っていると考えています。\n侮辱することは間違っていると思います。言葉を改善するための方法は、他にも数え切れないほどあります。\nこれを例外とする正当な理由はありません。\n例外とする正当な理由はありません。\n\n私は、このような考え方の副次的な部分として、次のように考えています...",
  "data/reddit-changemyview/r/changemyview/comments/qdkd35/cmv_i_hate_my_pet_just_died_posts.json": "動物関連のサブページ（あるいはすべて）をスクロールしていると、このようなものに出くわすことがあります。\nこのようなものに出会わないようにすることは不可能です。私は必ず最初に写真やビデオを見ます。\nそして、誰かのペットを見たときに感じる暖かい気持ちの半分くらいは\n誰かのペットを見たときに感じる暖かい気持ちの半分くらいで、タイトルが何かだと気づくのです。",
  "data/reddit-changemyview/r/changemyview/comments/qdr0x3/cmv_the_most_plausible_outcome_of_death_is.json": "先週くらいまでは神や死後の世界を信じていましたが、自分の信念に疑問を持ち始めました。\n自分の信じていることに疑問を持ち始めました。\nその一つが死後の世界です。\n\n現在わかっている限りでは、意識は（おそらく）脳に接続されています。\n私たちが死ぬとき、脳は完全には...",
  "data/reddit-changemyview/r/changemyview/comments/qdpsrn/cmv_constitutional_monarchies_have_no_place_in.json": "私がヨーロッパのような立憲的なものに限って話をしているのは\nヨーロッパのような立憲的なものに限って話をしているのは、たとえ民主主義が成立していて、君主が単なる図式化された存在であっても\n国家元首の地位は継承され、納税者は（警備を含む）費用を負担しなければなりません。\nそのため、納税者は国家元首の地位を継承し、国家元首全体の経費（警備も含む）を負担しなければなりません。",
  "data/reddit-changemyview/r/changemyview/comments/qe3wj0/cmv_the_term_gatekeeping_has_no_place_in.json": "私が言いたいのは、誰かが自分は自閉症だと言っても、その診断基準を満たすだけの自閉症の症状を持っていない場合には\n自閉症の症状がなく、その診断基準を満たしていない場合、自閉症ではないと言うことは\n自閉症ではないというのは、「門番」ではありません。診断とは、以下の定義です。\n異なるタイプの脳や異なるタイプの人間の苦しみを定義するものである...",
  "data/reddit-changemyview/r/changemyview/comments/qe7eu0/cmv_thou_shall_not_rape_is_an_example_of_a.json": "普遍的な法則とは、カントの定言命法によれば、誰もが例外なく従うことのできる\n普遍的な法則とは、誰もが絶対に例外なく従うことができるものです。\n\nこの格言に反するような状況は考えられません。\nこの格言に反するような状況は考えられません。なぜなら、レイプは決して問題解決にはならないからです。人は\n人が死ぬことはありません...",
  "data/reddit-changemyview/r/changemyview/comments/qe8nw6/cmv_conservatives_use_identity_politics_just_as.json": "編集部：いいえ、すべての保守派がこのようなことをしていると言っているわけではありません。\nアイデンティティ・ポリティクスを利用しています。\n黒人の保守派を人種的なスラーや人種に基づいた侮辱と呼ぶのは人種差別であり、そのようなことをしている人を見るたびに私はゾッとします。\n誰かがそれをするのを見るたびに、私はぞっとします。\n\n 1. 白人が人種差別的であると主張する。",
  "data/reddit-changemyview/r/changemyview/comments/qed8ym/cmv_the_solution_to_lack_of_representation_in.json": "メディアでの表現に反対しているわけではありません。個人的にはあまり気にしていませんが\n多くの人にとって重要であり、最終的には必要なことだと認識しています。\n必要なことだと認識しています。しかし、歴史的な作品に関しては、意味のない表現を強要することは\nしかし、歴史的な作品に関しては、意味のない表現を強制することは良くないと思います。そうではなく、私たちは...",
  "data/reddit-changemyview/r/changemyview/comments/qeban8/cmv_we_shouldve_never_shipped_manufacturing_to.json": "製造業の大部分が国内から海外にシフトしているような気がしますが\n(この40年間、製造業が自国から海外（特に中国）にシフトしたことで、経済的、倫理的、さらには経済的にも多くの問題が発生したと思います。\nこの40年間、経済的にも倫理的にも、さらには経済的にも多くの破壊的な問題を抱えているように感じます。\n\n私は、多くのことに関して「アメリカ第一主義」になるべきだとは言いません。\nしかし、私は信じています...",
  "data/reddit-changemyview/r/changemyview/comments/qefoon/cmv_a_gun_is_always_loaded_regardless_of_who_you.json": "これは何度も頭に叩き込まれたことですが、私は、人々が\nこれが適用されない正当なケースがあるのかどうか、興味があります。私がいつも言われていたのは\n銃をチェックしたばかりであろうと、撃ち終わったばかりであろうと、その他の状況に関わらず\nどんな状況であっても、唯一安全なアプローチ方法は...",
  "data/reddit-changemyview/r/changemyview/comments/qecx2k/cmv_echo_chambers_and_engagementfocused_media_are.json": "近年、多くのテーマで意見の対立が激しくなってきているように思います。I\n私の関心は、どちらが正しいかということではありません。\n私が心配しているのは、どちらが正しいかということではなく、このような状況の中で社会が共存できるかということです。\n懸念しているのは、正しいか間違っているかということではなく、このように大きくなっていく違いの中で、社会として共に生きていけるかということなのです。\n\n政治 - アメリカでは、...",
  "data/reddit-changemyview/r/changemyview/comments/qegdrg/cmv_african_americans_have_more_culture_in_common.json": "アメリカで生まれ育った人は、アメリカ人です。\n特に労働者階級はそうです。私たちは同じ文化を共有し、同じ苦労をしています。\n苦労しています。私がここで伝えたいのは、もし私たちが部族意識を持つのをやめれば\n違いを生み出すことができるかもしれないということです。黒人か白人かは関係ありません...",
  "data/reddit-changemyview/r/changemyview/comments/qel3pm/cmv_singing_a_song_or_lyric_that_has_the_nword_in.json": "私は、「n」という言葉の背後には、たくさんの荷物や歴史、文脈があることを理解しています。\n語の背後には、黒人ではない私には理解しきれない多くの荷物や歴史、文脈があることを理解しています。そうは言っても\n黒人ではない私には理解できません。\n差別主義者というレッテルを貼られることなく、n wordを含む歌詞を歌うことができないという理屈は理解できません、それ以外には...。",
  "data/reddit-changemyview/r/changemyview/comments/qecw4q/cmv_mlk_was_entirely_against_rioting_and_to_say.json": "正直なところ、抗議行動としての暴動をどう思うかは定かではありません。\nそれはともかく、左派の人たちが「私たちは」「私たちは」「私たちは」と言うのは\n実際にMLKは暴動を起こしていたし、暴動を支持していたんだ！」というようなことを左翼が言うと I\n思わず笑ってしまい、首を横に振ってしまいます。",
  "data/reddit-changemyview/r/changemyview/comments/qesnb3/cmv_cancel_culture_is_a_manipulative_tactic_used.json": "キャンセル文化は迷惑です。誰もが完璧ではないので、誰もが間違いを犯しますが、何が迷惑かというと\nその間違いを利用して、あなたの言葉の中にヒップクライシスを探して、あなたをストローマンとして利用する人がいることです。\nストローマンとして利用しています。\n\n私は、それが相手を貶めるための手段であり、自分の作品を宣伝するための手段ではないと考えざるを得ません。\n私は、それが相手を貶めるための方法であって、自分の意見を通すための方法ではないと考えてしまいます。",
  "data/reddit-changemyview/r/changemyview/comments/qeufza/cmv_in_a_humane_society_painless_assisted_suicide.json": "年齢制限があるのは、人の脳が発達するのは20代半ばまでであり\n20代半ばまで脳が発達していないことと、若い頃は感情や生活環境の変化が大きいため\n若い頃は感情や生活環境の変化が大きいからです。タイムロックを設けるべき\n安楽死幇助に申し込んだ後、待たなければならないのは...。",
  "data/reddit-changemyview/r/changemyview/comments/qeqaa5/cmv_tribalism_is_the_biggest_obstacle_in.json": "この問題は米国で最も顕著であるため、ここでは主に米国の政治に関する私の指摘を利用しています。\nしかし、これは他の民主主義政治にも当てはまります。\n\nhttps://en.wikipedia.org/wiki/Tribalism\n\n現代の民主主義は、よく言われるような理想的なシステムになるまでには、まだまだ長い道のりがあります。\nよく言われる理想的なシステムになるまでにはまだ長い道のりがあります。しかし、私は...",
  "data/reddit-changemyview/r/changemyview/comments/qf2108/cmv_belief_systems_that_rely_heavily_on_shame_are.json": "羞恥心は精神衛生上有害であり、特に子供にとっては有害であるということは、社会的にも同意されているようです。\n特に子どもにとっては有害です。私の州では、意図的に子どもに自分が悪い子だと思わせることは\n意図的に「自分はダメな人間だ」と思わせることは、精神的な虐待やネグレクトとみなされます。\nネグレクトとみなされます。これは、社会サービスに関与する理由となります。いくつかの例を挙げると...",
  "data/reddit-changemyview/r/changemyview/comments/qfccof/cmv_neopronouns_are_selfish.json": "トランスの権利には賛成です。ジェンダーロールは炎に包まれ、ジェンダーアイデンティティーは灰の中から立ち上がるべきです。\nしかし、私たちには誰もが使う3つの代名詞があります。\nこれらのどれにも当てはまらなければ、自分の固有の代名詞が使われなくても怒ることはできません。\n自分だけの代名詞が使われていなくても怒ることはできません、なぜならあなたは強制的に...",
  "data/reddit-changemyview/r/changemyview/comments/qfc094/cmv_burgers_are_sandwiches.json": "ハンバーガーはサンドイッチではないと考える人が何人もいることに驚かされます。\n明らかにサンドイッチです。\nサンドイッチの定義は、2つのパンやクラッカーなどの間に何かを挟むことです。\nハンバーガーは、2つのパンの間にビーフ（時にはチキン）パティを挟んだものです。",
  "data/reddit-changemyview/r/changemyview/comments/qff4qj/cmv_saying_sex_work_is_real_work_is_dangerous.json": "私はこのテーマについて、自分の考えを変えようとは思わず、反対意見を聞きたいと思っています。\nしかし、私は自分の立場を再評価し、自分の論理が間違っているかもしれないと気づくことには前向きです。\nしかし、私は自分の立場を再評価し、自分の論理が間違っているかもしれないと気づくことはできます。\n\nしかし、私は自分の立場を再評価し、自分の論理が間違っているかもしれないと気づくことはできます。ただ、私は\nただ、「ランジェリーを着て...」と「...」の間の境界線は、「...」だと思っています。",
  "data/reddit-changemyview/r/changemyview/comments/qfma4w/cmv_apartments_should_reserve_their_ground_floors.json": "自分が住んでいるアパートが火事になり、3階に住んでいたとします。\n階に住んでいるとします。エレベーターに乗ると、もちろん「火事の場合はこちらへ」というサインがあります。\n階段を使ってください」と書かれています。でも、もしあなたが車いすやスクーターに乗っていたら\nスクーターだったらどうでしょう。階段は使えないので、唯一の選択肢は...。",
  "data/reddit-changemyview/r/changemyview/comments/qfscr7/cmv_its_not_an_employees_responsibility_to_find_a.json": "私が仕事を始めた頃は、休む前に数日前に連絡を入れておけば\n数日前に連絡すれば、マネージャーがスケジューリングしてくれました。自分の代わりになる人を見つけていれば良かったのですが\n自分の代わりになる人を見つけていれば良かったのですが、それは期待していませんでした。\n\nしかし、ある時点でそれが変わったようで、今では従業員が...",
  "data/reddit-changemyview/r/changemyview/comments/qfwx95/cmv_college_in_the_us_isnt_free_because_doing_so.json": "軍隊に入ることの最大のセールスポイントの一つは、大きな\n兵役に就く最大の魅力は、GIビルを通じて中等教育に使える多額の奨学金を得られることです。\n多くの新兵や退役軍人に話を聞くと、大学の学費を払うために入隊したという話をする人が多い。\n多くの新兵や退役軍人に話を聞くと、彼らの多くは、大学の学費を払うために軍隊に入ることを話します。",
  "data/reddit-changemyview/r/changemyview/comments/qg0l1v/cmv_taxing_unrealized_capital_gains_is_an.json": "私の言いたいことを説明するために、簡単な例を挙げてみましょう。\n\nある会社の株を100ドル分購入し、その株が価値を上げて500ドルになったとします。\nつまり、私は400ドル相当の「未実現キャピタルゲイン」を税金として支払うことになります。\n\nもし、その株が急落して50ドルになったら、突然、私は政府に...\n私の資産は...",
  "data/reddit-changemyview/r/changemyview/comments/qgjnc9/cmv_abortion_is_a_red_herring_political_issue_and.json": "と扱う中絶擁護者は、どちらの立場でもかなり簡単に見つけることができます。\nこの問題は、政治的な議論を支配する唯一の問題です。\n\nアメリカでは年間61万件の中絶が行われています。比べてみると、心臓病では年間65万人、がんでは\n~比べてみると、心臓病では年間65万人、がんでは年間60万人が亡くなっています。癌や心臓病が悪いことは誰もが認めるところですが\n悪いことだとは思いますが...",
  "data/reddit-changemyview/r/changemyview/comments/qgic8r/cmv_despite_disillusioned_people_humans_are.json": "人類は悪化の一途をたどっていると考えている人たちがいます。\n考える人もいます。このようなタイプの人はよく知っています。しかし、私はそうではないと思います。\nのです。でも、チャレンジしてみてください。私は、人類が悪くなることも、人間が悪くなることもありません。\n悪くなるのではなく、良くなっていると思います、例え人種のるつぼであっても...。",
  "data/reddit-changemyview/r/changemyview/comments/qgegs2/cmv_its_not_okay_to_reach_out_to_someone_you.json": "デートの際のプロフィールには、自分のソーシャル・ハンドルネームを記載していませんが、私は\n私のインスタグラムを見つけてくれた人もいましたよ。\n私と同じ大学に通っている人もいて、共通のフォロワーがいるからです。このようなことがあってはならないと思います。\n私たちがマッチしなかったということは、私が...",
  "data/reddit-changemyview/r/changemyview/comments/qgvk0h/cmv_waking_up_early_doesnt_necessarily_mean_that.json": "なぜ、早起きは偉いとされ、遅起きの人を見下すのか理解できません。\n遅く起きた人を見下すのか理解できません（少なくとも私の国、インドでは\n\n私が遅く起きるのは、10時から仕事を始めるからで、もし朝5時に起きたら10時までエネルギーを消耗するだけです。\n朝5時に起きたら、10時までエネルギーを消耗することになります。9時に起きて...",
  "data/reddit-changemyview/r/changemyview/comments/qgq4k1/cmv_every_social_media_site_would_be_like_4chan.json": "誰もが4chanがある種の異常であると錯覚したがる。\nインターネットの顔についた嫌なニキビのようなもので、「本当の」インターネットは歓迎すべき健全な場所だと\n歓迎された健全な場所であると錯覚したいのです。\n\nしかし、4chanはインターネット上で唯一、法的に保護されたすべての言論が許される場所です。\n許されている唯一の場所なのです。",
  "data/reddit-changemyview/r/changemyview/comments/qgyjwf/cmv_cancel_culture_is_a_conservative_dogwhistle.json": "最近、インターネット上の言説でよく見かける言葉が、この考え方です。\n「ここ数週間は、Dave Chappelleの新しいコメディー番組をめぐる論争のせいで\nDave Chappelleの新しいコメディ・スペシャルをめぐる論争のためです。興味深いことに、この考え方は\n興味深いことに、この考えは中道左派（私は...と感じています）の間でも人気があるようです。",
  "data/reddit-changemyview/r/changemyview/comments/qgjxeu/cmv_pronouns_other_than_heshethey_defeat_the.json": "私は包括性に何の問題もありませんし、あなたがなぜ誰に惹かれているのかということも気になりません。\nあなたが誰に惹かれているのか、それはあなたの問題です。しかし、代名詞のポイントは\n誰かを識別/参照するための一般的な用語であることです。現在、78の代名詞があります。\nジェンダーの代名詞は78個あります。その時点で、より多くのことを...",
  "data/reddit-changemyview/r/changemyview/comments/qh2us4/cmv_there_is_a_shortage_of_workers_because_the.json": "私はプロのシェフですが、パンデミックとロックダウンは食の現場をまるで\nパンデミックとロックダウンは、神の怒りの拳のようにフードシーンを襲いました。多くのレストランがすぐに営業を停止して事態を収拾しました。\n多くのレストランが営業を停止し、廃業していきました。一部のレストランでは\nダインアウトに変更することでビジネスを継続したレストランもありました。",
  "data/reddit-changemyview/r/changemyview/comments/qhfig1/cmv_i_think_it_should_be_okay_to_criticize_people.json": "西洋では、他の文化や民族が行った残虐行為を擁護する声をよく耳にします。\n我々は彼らの悪行を裁く立場にはない。\n西洋文化の産物であり、西洋の価値観を教え込まれているのだから。\n西洋文化の産物であり、西洋の価値観に洗脳されているのだから。私はこの感情は...",
  "data/reddit-changemyview/r/changemyview/comments/qhl9p7/cmv_people_should_stop_referring_to_american.json": "\"白人文化 \"はアメリカ文化の代名詞であり、それはアメリカ人の多くが白人であり\nアメリカ人のほとんどが白人であり、「白人文化」がアメリカの支配的な文化だからです。人々は、アメリカ文化を「白人文化」と呼ぶのをやめて\nアメリカの文化を「白人文化」と呼ぶのはやめて、「アメリカ文化」と呼ぶべきです。\n「アメリカの文化は白人以外の人を同化させないからです...。",
  "data/reddit-changemyview/r/changemyview/comments/qhpfuy/cmv_money_does_buy_happiness_its_literally_the.json": "お金で幸せは買えません。その発言は、完全な嘘である\n貧乏人が自分の現状に嫌悪感を抱かないようにするためだけに使われる\n使われています。もちろん、お金で幸せを買うことはできます。世界は文字通り、通貨のアイデアの上に成り立っています。\n世界は文字通り通貨のアイデアの上に成り立っています。仮定するには絶対的な愚か者でなければなりません・・・。",
  "data/reddit-changemyview/r/changemyview/comments/qhx1iz/cmv_theres_no_reason_for_me_to_put_my_pronouns_in.json": "私の同僚の多くは、Eメールの署名やその他の仕事上のやり取りの中で、自分の代名詞を使っています。\n他のタイプの仕事上のやりとりでも 私は彼らがそうすることに全く問題はありません。\nしています。そのやり方には全く不満はありません。\n\nしかし、私もそれに倣って、自分の代名詞をメールの署名に入れる必要はないと思っています。\n署名....",
  "data/reddit-changemyview/r/changemyview/comments/qi1j3a/cmv_its_disingenuous_to_tell_someone_to_love_your.json": "芸能人や \"インフルエンサー \"に限らず、一般的にもそうですね。多くの人が\n多くの人が「ありのままの自分を愛する」というメッセージを発信していますが、彼ら自身は\nすっぴんになるのを嫌がったり、フィルターやフォトショップを使ったり、整形したりしています。\n整形をしています。\n\n私が今までに経験した中で、最もおかしかったことのひとつは......。",
  "data/reddit-changemyview/r/changemyview/comments/qi278p/cmv_science_cannot_tell_you_to_do_something.json": "免責事項：このような主張をすると、おそらくアンチバクサーと呼ばれることになるでしょう。\n私はワクチンを接種したことを明確にしておきたいと思います。\n私はワクチンを接種しましたし、医学的に問題のない方には接種をお勧めします。\n\nそれはさておき、私は多くのプロ・ワクチンやプロ・マンデートを目にする...",
  "data/reddit-changemyview/r/changemyview/comments/qhx7f5/cmvi_dont_have_to_respect_your_culture_or.json": "タイトルが示すように、私はすべての文化や宗教を尊重しなければならないとは思っていません。\nすべての文化や宗教を尊重しなければならないとは思っていません。私の考えに合わない考えを推進している場合もありますから。\n私の道徳的価値観に合わない考えを推進している可能性があるからです（女性差別、性差別、不平等、人種差別、小児性愛など）。私が尊重しなければならないのは\n私が尊重しなければならないのは、希望する宗教とその実践に従うという人の選択です。",
  "data/reddit-changemyview/r/changemyview/comments/qi6oud/cmv_buying_expensive_diamond_weddingengagement.json": "高価で時代を超越したダイヤモンドリングを購入するという行為は、デビアス社によって永続的に行われています。\n人為的に高い価格を維持するためにダイヤモンドの供給を抑制するデビアス社が\n高価なダイヤモンドリングを購入する行為は、デビアス社によって永続的に行われています。\n\nダイヤモンド・リングから得られる有用性は、価格とは全く無関係です。\n価格とは完全に切り離されています。これは、他の日常的なものにも言えることです...。",
  "data/reddit-changemyview/r/changemyview/comments/qif42b/cmv_returning_your_shopping_cart_is_always_the.json": "どんなに急いでいても、どんな状況でも、あなたの食料品用カートが確実に\n返してもらうことは、どのような場合でも正しいことです。私は絶対に嫌です。\n誰かがカートを置いたままの場所に車を停めようとするのは絶対に嫌です。私には\n弁解の余地はないと思います。駐車場はただでさえ事故が多いのに・・・。",
  "data/reddit-changemyview/r/changemyview/comments/qibiiy/cmv_passion_trusting_your_feelings_should_be.json": "100万人の王様が、100万人の臣下のために、100万の決断をしたとしたら、その心は\n百万人の王が「自分の感情を信じろ」という考え方で臣民のために百万回の決断をしたとしたら、もう一人の百万人の王は\n別の100万人の王が、冷静な考え方（バルカン式）で100万回の決断をしたとしたら、後者のグループの方がより多くの成功を収めるでしょう。\nは、より多くの成功を収めるでしょう。\n\n誰かが擁護するときは必ず",
  "data/reddit-changemyview/r/changemyview/comments/qhtxyb/cmv_circumcision_for_children_should_be_illegal.json": "割礼は、ほとんどの場合、医学的に不要であるだけでなく、明らかに子どもの権利を侵害しています。\n子供の権利を明らかに侵害しています。同意できる年齢の人がいるなら\n同意できる年齢の人がいれば、それはそれでいいでしょう。\n宗教の名の下に子供を切り刻むことが許されるのは、完全に狂気の沙汰です。\nしてはならないことだと思います。",
  "data/reddit-changemyview/r/changemyview/comments/qixmg2/cmv_freddy_krueger_is_the_greatest_horror_movie.json": "彼はすべてオリジナルのキャラクターで、素晴らしいバックストーリーを持っていて、彼のアイデアは\nジェイソン、ミッシェル、チャッキーのような10年前の類似したキャラクターよりも、彼の存在ははるかに不穏である。\nMichealやChuckyのような10年代のキャラクターよりもはるかに不穏な存在です。私のフレディは、最高のドレススタイル、最高の殺人方法、最高のセリフを持っています。\n私のフレディは、最高の服装、最高の殺し方、そして最高のセリフを持っています。",
  "data/reddit-changemyview/r/changemyview/comments/qj7xcv/cmv_the_mass_resignations_and_push_for_higher.json": "私は大学に行き、一生懸命働いて4年制の学位を取得しました。その後、時給25円程度の仕事に就きました。\n毎年少しずつ昇給しながら、時給25円程度の仕事に就きました。\n\n今では、サービス業が時給20ドル以上に跳ね上がっているので、中流階級の\nサービス業が時給20円以上に跳ね上がっている今、すでに時給20円台の中流階級の賃金は上がっていないし、これからも上がらないだろう...。",
  "data/reddit-changemyview/r/changemyview/comments/qj9jbx/cmv_most_influencers_are_just_random_attention.json": "このコメントは、いわゆるインフルエンサーの99％に当てはまることに注意してください。中には\n実際に商品を販売したり、人々に自分のスタイルやファッションを真似させたりする人は確かに少数です。\nしかし、インフルエンサーと呼ばれる人たちの大多数は、ポダンクの外向的な人たちです。\nインフルエンサーと呼ばれる人たちの大半は、田舎町の外向的な人たちです。",
  "data/reddit-changemyview/r/changemyview/comments/qjdyxs/cmv_capitalism_and_socialism_have_become.json": "資本主義や社会主義に反対していると主張する人は、通常、何を言っているのかわからない。\n自分が何を言っているのかわからない。私は現状に疑問を持つことには賛成ですが、これらの言葉はあまりにも流布しすぎて\n意味を失ってしまっています。では、なぜもっと正確に\nもっと正確に 経済のこと、人間のこと......いろいろなことを議論しましょう。",
  "data/reddit-changemyview/r/changemyview/comments/qjapxt/cmv_the_definition_of_asexuality_is_too_broad_and.json": "このツイートを見てから考え始めたことがあります。それは、アセクシャルモデル\nアセクシャルをテーマにしたランジェリーラインの広告です。\nhttps://twitter.com/SophNar0747/status/1453702975222919168?t=2zXdqNmFzX5C8xV7pUL99A&s=09\n\nどうやらアセクシャルの定義が広がってきているようです。\n楽しめるようになったらしい...",
  "data/reddit-changemyview/r/changemyview/comments/qjr7dt/cmv_in_the_western_world_there_is_no_point_in.json": "カナダとアメリカに限定して説明しますが、他の国にも当てはまると思います。\n\n少子化が問題視されているのを聞くと、仮にそれが問題だとしても、どうすればいいのかと\n問題だとしても、どうしたらいいんだろう？私の考えを変えてほしいのは\n今の私は悲観的です。なお、この記事は...の話ではありません。",
  "data/reddit-changemyview/r/changemyview/comments/qjr0r7/cmv_employers_abuse_immigration_visas_instead_of.json": "最近、中産階級の減少、生活費に対する賃金の低下、アメリカ人の教育水準の低さなどが話題になっています。\n生活費に比べて賃金が低いことや、アメリカ人の「教育」を受けた人が少ないことが話題になっています。\n最近では、中産階級の縮小、生活費に対する賃金の低下、特定の役職に就くための「教育を受けた」アメリカ人の不足などが話題になっています。\n\n私は、このような状況は、企業が地元の人材を育てたり、時間をかけたりすることを求めなくなったことが原因だと考えています。\n私が思うに、このような状況になったのは、企業が人材育成や現地での教育に時間をかけようとしなくなったからだと思います。",
  "data/reddit-changemyview/r/changemyview/comments/qjsvwa/cmv_the_claim_that_100_companies_produce_71_of.json": "よく、「100社で71％の二酸化炭素を排出している」という話を聞きます。これは\n技術的には正しいのですが、いくつかの定義があります。また、よく耳にするのが\nそのため、この100社に浄化してもらうだけで気候変動は解決する、とも言われます。\n気候変動を解決することができます。しかし、これは...",
  "data/reddit-changemyview/r/changemyview/comments/qjy87s/cmv_being_antivax_is_inherently_selfish.json": "物理的にワクチンを接種できない人は除外されます。\nあなたと、あなたに対するある種の人々の見方を気の毒に思います...。\n\n私はリバティの議論を理解していますか？個人的には共感できなくても、絶対にそうです。\n個人的には共感できませんが...。\n\nそれはともかく、他の人を危険にさらしていることには変わりないので...。"
}