{
  "data/reddit-changemyview/r/changemyview/comments/pfkd0r/cmv_people_arent_smarter_than_people_50_years_ago.json": "前置きが長くなりましたが、昔に比べて教養のない人は減ったと思いますが\nしかし、私たちはあまり賢くなっていないと思うのです。オリンピックの後、私はいくつかのことを見てきました。\nオリンピックの後、人々はより大きく、より良く、より速く、より強くなったと言うものを見ました。それは\n私たちが「より賢く」なったとは明確に書かれていませんでしたが、それは...。",
  "data/reddit-changemyview/r/changemyview/comments/pfm9tr/cmv_the_pandemic_wasnt_hard_for_all_of_us.json": "全員」が大変だったというのはやめてほしい。もしあなたが億万長者だったら......。\n苦労しなかったでしょう。もし、あなたが虐待を受けていた家庭の出身で、まだ勉強中/未成年であれば\n勉強していたり、未成年であったりしたら、それはそれで大変だったと思います。もし、あなたが経済的に苦境に立たされた人であれば\nパンデミック前に経済的に苦しい状況にあった人は、その苦しさを...",
  "data/reddit-changemyview/r/changemyview/comments/pfod3m/cmv_shaming_someone_for_being_short_is_worse_than.json": "私は、恥をかくことは間違っていると感じており、本当に価値のある人以外はすべきではないと思っています。\n誰かが本当にそれに値する場合以外はすべきではありません。しかし、人々がこのようなことをするのを止めることはできません。\nそれが私の考えです。\n\n私がこのように思うのは、人が自分の体のある部分をどれだけコントロールできるかということです。\n私はこのように感じています。人は非常に小さな...",
  "data/reddit-changemyview/r/changemyview/comments/pfuxje/cmv_the_us_government_has_lost_all_credibility.json": "アフガニスタンは、振り返ってみれば、完全に無駄で、人の命とお金を浪費した一連の戦争の最新のものです。\n振り返ってみると、完全に無駄で、人の命とお金の浪費である。ベトナム、イラク、アフガニスタン。\nこれらはすべて失敗した戦争である。責任者はそれを知っていたし、様々な政治的理由で終わらせたくなかった。\n様々な政治的理由で戦争を終わらせたくなかったのです。私たちは、この戦争がどれほどひどいものかを知ることができます...",
  "data/reddit-changemyview/r/changemyview/comments/pfw3f1/cmv_there_is_no_point_in_telling_kids_that_there.json": "子供」というのは、8歳くらいまでの人のことです。\n\n親が子供に「男の子の色と女の子の色なんてないよ」と言っているのをよく耳にします。\n男の子の色と女の子の色なんてないんだよ」という親の声をよく耳にします。\n\n私もそれに同意したいと思います。男の子がピンクを好きでも、女の子がブルーを好きでも、何の問題もありません。\n男の子がピンクを、女の子がブルーを好むことは悪いことではありませんし、子供がそのことで仲間はずれにされるべきではありません・・・。",
  "data/reddit-changemyview/r/changemyview/comments/pfn2lo/cmv_every_us_president_in_the_last_20_years_at.json": "私は今の政治にはあまり関心がないので、私はこのまま\n私が生きている間に大統領になった人たちにこだわるつもりですが、過去の多くの人たちも\n過去の大統領の多くもそうであるべきだと思います。しかし、この記事のために、私は次のことについて話します。\nブッシュ、オバマ、トランプ、バイデン。これは、私にとって良いことだと思います...",
  "data/reddit-changemyview/r/changemyview/comments/pfwskw/cmv_the_withdrawal_of_troops_from_afghanistan_was.json": "最初に言っておきますが、撤退のやり方はあらゆる意味で最悪で、100％撤退すべきだったと思います。\nあらゆる意味でひどかったし、100％別の方法で対応すべきだったと思う。\n撤退の時期を遅らせたり、国が安定していることを確認したりするなど、100％別の方法で対応すべきだったと思います。\n撤退を遅らせるとか、国が安定するようにするとか）。)\n\nしかし、全体的に見れば、米軍を撤退させることは...",
  "data/reddit-changemyview/r/changemyview/comments/pfzq04/cmv_antivaxxerscoviddeniers_should_be_given_the.json": "反ワクチン主義者や陰謀論者は、トリアージの対象となるべきだという意見をRedditで見かけました。\n反ワクチン主義者や陰謀論者はトリアージの対象となるべきだ、あるいは治療を受ける権利を放棄するような誓約書に署名すべきだ、という意見をRedditで見かけました。\n治療を受ける権利を放棄するようなサインをすべきだという意見を見たことがあります。これは、保守的なプロパガンダや一般的な偽物に対する不満からきているのだと思います。\n保守的なプロパガンダや、一般的な疑似科学的治療への不満からきているのでしょうが...",
  "data/reddit-changemyview/r/changemyview/comments/pg9ejg/cmv_overpopulation_is_an_issue_and_declining.json": "多くの人が、人口過剰は実際の問題ではないと話しているのを見たことがあります。\n地球にはもっとたくさんの人が住めるスペースがあり、第一世界の少子化を改善する必要があるということです。\n第一世界では少子化を改善する必要があると言っていますが、私はこの2つの主張には大いに反対です。\n私はこの2つの主張には大いに反対です。まず、「地球にはもっとたくさんの人が住めるスペースがある」という主張には、私は大いに反対です。",
  "data/reddit-changemyview/r/changemyview/comments/pgfb3h/cmv_the_fact_that_pharmaceutical_companies_would.json": "例えば、製薬会社に勤める化学者が新薬を発見したとします。\n安価で簡単に作ることができ、副作用もなく、ウイルスや細菌の感染症や癌などのどんな病気でも治すことができる新しい薬/分子を発見したとします。\nウィルスや細菌の感染症、癌など、どんな病気でも治すことができる。議論のために言っておくと\n議論のために、人々がこの薬を自宅で自分で作ることができるとしましょう...。",
  "data/reddit-changemyview/r/changemyview/comments/pgkddz/cmv_no_one_wants_to_kill_babies_and_passing_laws.json": "私はこれを、胎児が赤ん坊であるかどうかの議論にしているわけではありません。\n私の考えは、中絶を禁止しようとしても、中絶の数を大幅に減らすことはできないということです。\n私の考えは、中絶を禁止しようとしても、中絶の数を大幅に減らすことはできないということです。最近テキサス州で可決されたSB8法では\nテキサス州で可決されたSB8法については、多くの議論と憤りがあります。その...",
  "data/reddit-changemyview/r/changemyview/comments/pgk6r7/cmv_nfts_are_internet_beanie_babies.json": "NFTは、ゲームのチケット販売やプロ向けのトレーディングカードなど、社会の中で活躍しています。\nトレーディングカードのようなものです。もし、バンクシーのような有名な企業やアーティストがNFTを作ったとしたら、それは価値を持ち続けると思います。\n価値があると思います。このような例外を除いて、私はNFTの価値を認めていません。\nこのような例外を除いては、一度盛り上がったコレクターのブームが継続するとは思えません。",
  "data/reddit-changemyview/r/changemyview/comments/pgmipl/cmv_anyone_who_says_that_mask_mandates_infringe.json": "マスクも下着も、他人を守るために体を覆う布地です。\n人を守るために体を覆うものです。\n\n裸体を禁止する法律があるのは、公共の安全を守るためだということです。\n誰かのヌードを見たときのトラウマからの安全を守るためです。\n\nこの議論は、個人の自由と公共の安全の間で展開されます。その...",
  "data/reddit-changemyview/r/changemyview/comments/pgtgv0/cmv_it_is_foolish_to_try_to_punish_people_with.json": "障がい者の投票権を制限しろ」という書き込みやコメントを多く見かけました。\n気に入らない信念を持つ人の投票権を制限しろ」「アンチワクチンの信念を持つ人には医療を与えるべきではない」という書き込みを多く見ました。\nといった書き込みをよく見かけます。そのようなことをする価値が本当にあるのでしょうか？\n\nあなたの信念が世間で人気があり、愛されている場合は好意的に見えるかもしれません。\nでも...。",
  "data/reddit-changemyview/r/changemyview/comments/pgthwr/cmv_the_gender_pay_gap_is_largely_explained_by.json": "女性は男性に比べて給料が少ない」という一般的な意見を聞き始めた頃は\n男性に比べて女性の給料が低いという一般的な意見を聞き始めた頃（2015年頃）は\nそれは、雇用主やビジネスモデルに深く根ざした制度的な偏見の結果だと思っていました。\n雇い主やビジネスモデルに深く根ざした制度的な偏見の結果だと思っていました。\n\nそれ以来、何度か、私は...",
  "data/reddit-changemyview/r/changemyview/comments/ph7bby/cmv_the_best_way_to_eat_a_banana_is_to_completely.json": "なぜか、ほとんどの人がこのようにバナナを食べるようです🍌。つまり、彼らは\nバナナの皮を部分的に剥いて、皮を持って食べます。望ましい食べ方は\nバナナを食べるときは、皮を完全に剥いて捨ててから、最初の1本を食べるのが好ましい。\n好みの食べ方は、皮を完全に剥いて捨ててから最初の一口を食べることです。\n\n最初の利点は、完全な...",
  "data/reddit-changemyview/r/changemyview/comments/ph8pzw/cmv_the_usas_version_of_capitalism_is_just.json": "アメリカ人は、「資本主義」というと何かにつけてすぐにガチガチになる。\nしかし、ここからが本題です。\n\n中世のヨーロッパでは、ほとんどの人が農奴でした。隷属者は、支配階級が法律で保有する資源（土地）を使って\n(サーフは、支配階級が法律によって保有する資源（土地）を、武力に支えられて（当時は\n働いていました。) サーフは、生産...",
  "data/reddit-changemyview/r/changemyview/comments/phawqg/cmv_its_perfectly_okay_to_snitch_on_someone_its.json": "もし誰かが報告する価値のあることをしたら、それを報告する。さて、これは\n些細なことを報告するという意味ではありませんが、私はこれまでに、100％正しいと思われる状況を見てきました。\n密告者」というレッテルを貼られたために報告しないように圧力をかけられた状況を見たことがあります。\n密告者」というレッテルを貼られて報告しないように圧力をかけられた状況を見たことがあります。例えば、9年生の時、私の携帯電話が...",
  "data/reddit-changemyview/r/changemyview/comments/phce5n/cmv_dinner_and_a_movie_dates_should_go_movie.json": "EDIT: はっきりさせておきたいのは、ほとんど知らない人と一緒にやれと言っているのではないということです。\nと言っているわけではありません。私が考えているのは、以前から知っていたり、すでに1、2回デートをしたことのある人をデートに誘う場合です。\n私が考えているのは、以前から知っていたり、すでに1～2回デートをしたことがある人をデートに誘うということです。また、私は本当に\n食事と映画、どちらが先かということを議論したいだけなのですが...。",
  "data/reddit-changemyview/r/changemyview/comments/phcs5f/cmv_us_society_will_normalize_living_with_your.json": "アメリカの若者たちは、賃金の低迷と不動産価格の高騰に苦しんでいます。\n賃金の低迷と不動産価格の高騰に苦しんでいます。そのため、自分で買ったり貸したりすることができなくなり、親と同居しなければならなくなりました。\n親との同居を余儀なくされます。\n\n多くのアメリカ人が考えているように、家族が一緒に暮らすことは悪いことではありません。\n家族が一緒に暮らすことは、世界のほとんどの国で機能しています。",
  "data/reddit-changemyview/r/changemyview/comments/pho71b/cmv_there_is_no_moral_difference_between_killing.json": "私はベジタリアンなので、どちらも食べたくありません。しかし、最近いくつかのニュース記事を目にしました。\n最近、中国や他のアジア諸国に圧力をかけて、犬の殺処分や消費を禁止しようとしている運動家の記事をいくつか見ました。\n犬の殺処分と食用を禁止するよう、中国やその他のアジア諸国に圧力をかけようとしている運動家のニュースを最近いくつか見ました。\n\n私にとっては、この2つに道徳的な違いはありません。というのは逆説的だと思います。\nin...",
  "data/reddit-changemyview/r/changemyview/comments/phs15z/cmv_a_stay_at_home_husband_is_no_different_than_a.json": "私の家では私が稼ぎ頭です。また、私は女性です。しかし、私は\n夫は何をしているのか」と聞かれ、「働いていない」と答えると\n働いていないと答えると、心配そうな顔をされたり、「働いていないことが気になるのか」と質問されたりします。\n働いていないと言うと、心配そうな顔をされたり、\"働いていないことが気になるの？\"と聞かれたりします。あるいは似たような性別...。",
  "data/reddit-changemyview/r/changemyview/comments/phxdae/cmv_everyone_voting_in_favor_of_abortion.json": "安全な人工妊娠中絶の入手を困難にして、夜も安心して眠れるようにすることは、極めて短絡的で無気力なことです。\n安全な人工妊娠中絶の入手を困難にして、あなたが安心して眠れるようにすることは、非常に短絡的で無関心なことです。\n既に問題となっている里親制度を支援することもなく、間接的に望まれない、あるいは支援のない出産で\n望まない、あるいはサポートされない出産に追われることになります。これは...",
  "data/reddit-changemyview/r/changemyview/comments/phj7ue/cmv_people_shouldnt_get_off_as_easily_with_racism.json": "質問をさせてください。人種差別的なコメントを何度聞いたことがありますか？\n白人に対する人種差別的な発言を聞いたことがありますか？辛い食べ物の話をしているときに、白人のピーナッツがどうのこうのと言われたことがあるかもしれません。\n誰かが「白人はスパイスに対する耐性が低い」と言ったことがあるかもしれません。皮肉なことに\n皮肉なことに、同じ人が人種差別的な発言をしているのを聞いたことがあるかもしれません。",
  "data/reddit-changemyview/r/changemyview/comments/phxm7v/cmv_instead_of_asking_society_to_change_language.json": "アメリカでは、幼い頃から他人の悪口に影響されないことを学びます。\nアメリカでは、幼い頃から「棒と石で私の骨を折るかもしれない...」というようなスローガンがあります。\nなどのスローガンがあります。これは、人種差別の激しいアメリカ南部でマイノリティとして育った私にとって、とても重要なことでした。\n人種差別の激しい南部の州でマイノリティとして育った私にとって、これはとても重要なことでした。",
  "data/reddit-changemyview/r/changemyview/comments/pi067y/cmv_weddings_are_overwhelmingly_for_women_and.json": "フォーマルな結婚式というのは、私にとってはひどいものに思えます。計画、ストレス、費用\n時代遅れの儀式のようなゴミのようなもので、すべてが無駄に思えます。\n無駄な時間とお金の浪費に思えます。すべての準備と儀式は悪夢のようです\n私には悪夢のようです。もし、結婚式がもっと...ということであれば、魅力を感じるかもしれません。",
  "data/reddit-changemyview/r/changemyview/comments/pi2lz6/cmv_it_should_be_illegal_for_a_company_to_post.json": "これは、雇用主と従業員の関係の基本的な要件であるはずです。\n雇用者は自分の地位に対していくら払うかを言い、従業員は\n応募者はその報酬で仕事をしたいかどうかを決める。\n\n給料を言わないとか、膨大な量を要求するとか、そういうくだらないことはしない。",
  "data/reddit-changemyview/r/changemyview/comments/pi0ipt/cmv_the_invention_of_the_internet_has_made_it.json": "前置きが長くなりました。私は、私たちがより技術的に精通した未来に向かって進んでいると信じています。\n私たちの世代は、主観的にはもっともっと知的であるべきだと思います。\n知的になると思います。\n\n考えてみてください。私たちは、人類史上最も技術的に進歩した時代に生きています。\n私たちは、人類史上最も技術的に進歩した時代に生きており、多くの情報を手に入れることができます。",
  "data/reddit-changemyview/r/changemyview/comments/pi4gi7/cmv_québec_is_for_all_practical_purposes_a.json": "だから手始めに これは、ケベック州の分離主義を主張するものではありません。むしろ、これは\nケベックはすでに事実上独立国であるという規範的な主張である\n\n文脈 私は生涯英語圏のトロントニアンで、仕事のために近々ケベックシティに引っ越す予定です。\n仕事のために近々ケベック市に引っ越す予定です。様々な理由から、私はいつもケベックを半独立国と見ていました。",
  "data/reddit-changemyview/r/changemyview/comments/pictll/cmv_individual_sustainability_is_meaningless_the.json": "免責事項として、持続可能性に対する個人としての行動を明らかにしておきたいと思います。\nを明らかにしたいと思います。廃棄物ゼロの人間になるには、まだまだ遠いと自覚していますが\nしかし、私は自分を平均以上の人間だと思っています。例えば、トイレやナプキンにはリサイクルペーパーを使い\n例えば、再生紙のトイレやナプキン、金属製のストローを使ったり、買い物袋を再利用したり...。",
  "data/reddit-changemyview/r/changemyview/comments/pigmgv/cmv_parents_with_obese_children_should_be_charged.json": "少し太っている子の話ではなく、病的な肥満の子の話です。\n病的なほどの肥満 彼らは、肥満が後々引き起こす問題を理解していません。\n肥満が後々に引き起こす問題を理解しておらず、若いうちに身体の健康を保つことの重要性を理解していないのです。\n\nそのため、親の無責任さが際立っています。",
  "data/reddit-changemyview/r/changemyview/comments/pif9g8/cmv_human_civilization_will_collapse_within_my.json": "最初に警告しておきますが、特に実存するリスクや気候変動の影響について不安や憂鬱を感じやすい方は\n不安や憂鬱になりやすい方、特に実存的リスクや気候変動の影響について不安や憂鬱になりやすい方は、お気をつけください。\nまた、この議論を完全に避けるようにしてください。\n\nこの話をしていると自分がおかしくなったような気がしてくるので、投げやりに。すみません\nすべてについて...",
  "data/reddit-changemyview/r/changemyview/comments/pik7zy/cmv_if_others_around_me_refuse_to_get_the_covid.json": "私はアメリカのある地域に住んでいますが、そこではワクチンを接種していない人の数が非常に多いのです。\n私が住んでいるアメリカでは、ワクチンを受けていない人が非常に多いのです。私は3月と4月に1回目と2回目のコヴィド注射を受けました。\n\n研究によると、すでにワクチンを接種した人が3回目の予防接種を受けると、強い保護効果があることがわかっています。\n調査によると、3回目の予防接種は、すでに予防接種を受けている人にも強い保護効果があるそうです。それは、すでに...",
  "data/reddit-changemyview/r/changemyview/comments/pim01q/cmv_i_dont_think_theres_going_to_be_a_way_to.json": "個人ベースでは、LGBTQコミュニティを理解できます。\n\n同性と付き合いたい・結婚したい？もちろん誰も気にしません。あなたは自分とは\n自分と違う性別を名乗りたい？私には関係ありません、あなたはあなたで。違う代名詞を使いたいですか？\n違う代名詞を使いたい？いいよ、いいよ。\n\nでも、そうすると、問題や矛盾が出てきて...。",
  "data/reddit-changemyview/r/changemyview/comments/pilxup/cmv_social_media_can_be_one_of_the_worst_parts_of.json": "これは、何年もソーシャルメディアを利用してきた人間の意見です。一部の\nこれまでで最も下劣な行為を表現するプラットフォームを持っているのです。\n表現することができます。\n\nUSオープンを見ている人なら、Sloane Stephensが受けた虐待について知っていると思います。\nStephensが受けた罵詈雑言についてはご存知でしょう。そうでない人は、テニスの後...",
  "data/reddit-changemyview/r/changemyview/comments/piyhu3/cmv_all_arguments_about_abortion_boil_down_to.json": "1歳の子供の命を奪うことが殺人であることは誰もが認めるところです。中絶\n意見の相違があるのは、それをどこまで後退させれば殺人とみなさないのかについて、ほとんどの人が同意していないからです。\n中絶の意見の相違があるのは、それをどこまで下げれば殺人とみなさないのかについて、多くの人が同意しないからです。\n\n私は、子供が生まれた後、「命」を絶つことで殺人罪で有罪にすることに、ほとんどの人が同意していると思います。\n命」を終わらせるために殺人罪で有罪にすることは、ほとんどの人が同意していると思います。しかし、もし私たちが...",
  "data/reddit-changemyview/r/changemyview/comments/pj2veq/cmv_boys_shouldnt_be_circumcised.json": "私の見解を変えます。男児の割礼は性器切除です。\n\n背景：毎年、アメリカの男児の約70％が割礼を受けています。これはほとんど\n生後すぐに行われます。割礼はスメグマ（チンカス）の蓄積を防ぎますが\n(割礼はスメグマ（チンカス）の蓄積を防ぎますが、適切な衛生管理も重要です。割礼には...",
  "data/reddit-changemyview/r/changemyview/comments/pj22jw/cmv_abortion_is_no_different_than_pulling_the.json": "中絶は、脳死状態の人にプラグを抜くのと本質的に同じ概念であるにもかかわらず、どうして不道徳だとか、殺人だとか言うことができるのでしょうか？\n脳死状態の人のプラグを抜くのと本質的には同じ概念なのに、どうして中絶が不道徳だとか殺人だとか言えるのでしょうか？\n胎児を身体から取り除くと、それだけでは生きていけません。\n同じように、脳死状態にある人を生命維持装置から外すと、その人は...",
  "data/reddit-changemyview/r/changemyview/comments/pj1yc3/cmv_the_use_of_plastic_surgery_and_hormone.json": "EDIT: 性別違和感は医学的な病気であり、医学的にも問題があるという考えに基づいた議論にはデルタをつけました。\n性同一性障害は医学的な病気であり、医学的な治療法があります。私は、過去に「病気」というレッテルを貼ることは\n疾患とすることは危険だと言われたことがあったからです。\n疾患とすることは危険だと言われていたからです。なぜなら、かつてはゲイであることは...",
  "data/reddit-changemyview/r/changemyview/comments/pixtgh/cmv_mr_beasts_prizes_are_fake.json": "週末、YouTubeのアルゴリズムは、私にこのビデオを見るよう勧めました。\n\nhttps://www.youtube.com/watch?v=zxYjTTXc-J8\n\nその内容は、100人の人が輪になって、最後に残った人が50万ドルをもらえるというものです。\n50万ドルの賞金が与えられるというものです。ビデオの中で、参加者は\nゲームをしているのですが...",
  "data/reddit-changemyview/r/changemyview/comments/pjcj0g/cmv_australia_isnt_a_democracy_anymore.json": "この不穏な新法案を読んだ後、わずか24時間後には\nこの不穏な法案を読んで、オーストラリアの現在の政治システムについて考えてみることにしました。\nオーストラリアの現在の政治システムについて考えてみたいと思います。\n\n「2020年監視法改正法案（Identify and Disrupt）は、オーストラリア連邦...\nオーストラリア連邦...",
  "data/reddit-changemyview/r/changemyview/comments/pjibuc/cmv_most_of_the_economic_issues_affecting.json": "- 先進国では高齢化が進んでいる\n\n- 先進国では都市化が進んでいる\n\n- 先進国では、富裕層と高学歴化が進んでいる\n\n- 女性の社会進出が進んでいる\n\n\n\nだからこそ、政治家は団塊世代の利益のために行動する。\n半分の...",
  "data/reddit-changemyview/r/changemyview/comments/pjoh6c/cmv_gender_identity_is_one_of_the_most_conflated.json": "最近では、誰もがジェンダーとそのあらゆる側面について議論しているように思えます。I\n私はLGTBQのほとんどの側面を支持していることをお伝えしておきます。性的指向\nは、私にとって完全に意味のあるものです。好きな人を愛し、好きな人とセックスをしたい。別に\n大したことではありません。でも、性自認やその他のことに関しては...。",
  "data/reddit-changemyview/r/changemyview/comments/pjqm2y/cmv_now_that_taliban_are_in_power_afghanistan.json": "それで、タリバンが国を占領した。彼らの目的は、あらゆる軍事的な反対勢力を壊滅させることです。\n彼らの目的は、軍事的な反対勢力を壊滅させ、生の力で完全な支配権を確立し、利用可能なあらゆる資源を略奪することです。\n資源を略奪することです。彼らは、人道的援助から得られるものを除いて、経済や住民の福利厚生には全く関心がありません。\n人道的な援助から得られるものを除いて、経済や住民の幸福には全く関心がありません。\n\n広い...",
  "data/reddit-changemyview/r/changemyview/comments/pjqnd1/cmv_one_cannot_have_a_genuine_opposition_to.json": "はじめに、そして透明性のために言っておきます。私はプロチョイスの男性です。\n私は、中絶の権利が法制化されているアメリカの州に住むプロチョイスの男性です。\n\n賛成派の人から「賛成派ではなく、出産派だ」と非難されることがよくあります。\nプロライフではなく、プロバースだ」と非難されたプロライフの人たちがよく目にする答えは、「個人的な深いヘルプでは...」というものです。",
  "data/reddit-changemyview/r/changemyview/comments/pjty9f/cmv_the_size_and_spending_on_our_military.json": "米国は、これまでに戦ったすべての「戦争」で同点（膠着状態）か敗北を喫している\nアメリカは第二次世界大戦以来、すべての「戦争」で引き分け（膠着状態）か負けている。それなのに、アメリカは世界最大の軍隊を持ち、最大の武器販売国である。\n武器や弾薬の最大の販売者であり、他の裕福な西洋諸国よりも軍事費をかけています。\n他の裕福な西洋諸国よりも軍事費が多いのです。世界で最も先進的であり、かつ...",
  "data/reddit-changemyview/r/changemyview/comments/pjl7fb/cmv_teenagers_and_kids_should_be_less_exposed_to.json": "私は最近中近東の高校を卒業した17歳の男子です。\n卒業してから夏休みに入って、covidの調子が悪いので\n家にいなければならないので、インターネットやテレビを利用しています。テレビを見ると、それは\nトルコやギリシャでの山火事、中国での洪水...といった具合です。",
  "data/reddit-changemyview/r/changemyview/comments/pjy8tg/cmv_if_you_believe_abortion_should_be_illegal_on.json": "胎児を人間として保護しなければならないのであれば\nその胎児を「殺人」や「児童虐待」から保護する必要がある人間と考えるなら、その胎児は\n胎児は法的に子供と同じように扱われるべきです。つまり、胎児は市民であり\n親は国外追放から保護されます。\n\nつまり、子供...",
  "data/reddit-changemyview/r/changemyview/comments/pjyu9v/cmv_joking_about_the_deaths_of_unvaccinated.json": "私は完全に予防接種を受けており、3回目の接種を受ける予定で、マスクも着用しています。\nしています。自分と家族がCOVIDから安全であるために、最大限の努力をしています。\n私はすべての食料品や荷物を拭いています。スクラブを脱いで、すぐに\nシフトから帰宅するとすぐに洗濯機に入れて...",
  "data/reddit-changemyview/r/changemyview/comments/pkey1o/cmv_to_restrict_abortion_on_purely_religious.json": "1796年のトリポリ条約では、アメリカは「決してキリスト教に基づいて設立されたものではない」とされています。\nキリスト教に基づいて設立されたものではない」と述べています。\n\nアメリカ人の75％は何らかの形でキリスト教を信仰しているかもしれませんが、（州や連邦レベルの）政策を多数決だけで決めるのは\n州や連邦レベルで）多数決だけで政策を決めるのは、本質的にアメリカ的ではありません。また\n確立した法律がないという事実は...",
  "data/reddit-changemyview/r/changemyview/comments/pkejam/cmv_i_dont_buy_the_whole_we_could_have_stopped.json": "WHOがコヴィドの存続を発表したことで、「早い段階でこれを阻止する機会があった」という注意書きが、なんだか腑に落ちません。\nこれを止める機会が早くからあった」という注意書きは、なんだかでたらめのような気がします。\n\n確かに、人間が食べる必要も、薬をもらう必要も、病院に行く必要も、子供と触れ合う必要も、電話をかける必要もない完璧な世界では、このようなことはありません。\n食べる必要も、薬をもらう必要も、病院に行く必要も、子供と触れ合う必要も、警察を呼ぶ必要も、家を確認する必要もない完璧な世界では、確かに",
  "data/reddit-changemyview/r/changemyview/comments/pks7hd/cmv_its_not_erasing_history_to_remove_statues.json": "像の撤去は歴史を消してしまうとよく言われますが、それはロバート・E・リーであれ何であれ、問題となっている人物についての「議論がなくなる」からです。\nロバート・E・リーであれ、クリストファー・コロンブスであれ、問題となっている人物についての「議論」がなくなるからです。\nロバート・E・リーであれ、クリストファー・コロンブスであれ、その他の物議を醸す人物であれ、その像が撤去されると\n議論がなくなる」からです。しかし、歴史を消しているわけではない、とも言われています。",
  "data/reddit-changemyview/r/changemyview/comments/pkx184/cmv_the_western_world_needs_a_cultural_shift_on.json": "このパンデミックの時点では、アメリカの誰もがマスクを持っていると言ってもいいでしょう。\nマスクを持っています。アメリカ人である私は、パンデミックが起こる前は\n医療現場や危険な作業環境以外でマスクをしている人を見たことがありませんでした。\n海外にいるとき以外は。私がアメリカに駐在していたときは...",
  "data/reddit-changemyview/r/changemyview/comments/pkz0ap/cmv_a_fetus_being_alive_is_irrelevant.json": " 1. 女性には、血液、組織、臓器、生命維持装置などを提供する義務はありません。\n    また、他の人間を守るために自分の体内に何かを入れる義務もありません。\n    他の人間を守るために自分の体内に何かを入れる義務はない。\n\n 2. 胎児が取り出されて保育器に入れられ、自力で生きられるのであれば。\n    それは構わない。\n\n 3....",
  "data/reddit-changemyview/r/changemyview/comments/ple99p/cmv_bidens_vaccine_mandate_has_a_multitude_of.json": "最高裁はすでに1905年に7対2で強制ワクチンの側に判決を下している。\nワクチン接種に関する個人の自由の権利は、集団の権利に勝るものではないと判断したのです。\n集団の権利に勝るものではないと判断しました。これは、何十もある判例のうちの一つに過ぎません。\n数十件のうちの1件に過ぎない。\n\nジェイコブソン対....",
  "data/reddit-changemyview/r/changemyview/comments/pljvmn/cmv_as_long_as_neighborhood_schools_are_the_norm.json": "私は以前、教師をしていました。よく、「教育は平等であるべきだ」と言う人がいます。\n教育は平等であるべきで、子供に素晴らしい教育を受けさせるために引っ越しをする必要はない」という不満をよく耳にします。\n\n理論的には賛成です。しかし、いくつかの理由から現実的ではありません。\n\n最大の理由は、州が独自の基準を設定していることです。ある州では...",
  "data/reddit-changemyview/r/changemyview/comments/pl3456/cmv_if_being_unvaccinated_should_bar_you_from.json": "ワクチンを接種していない人の医療行為を見合わせることを支持する主な論拠は\nワクチンを受けていない人が治療を受けない最大の理由は、100％無料で受けられる予防措置を拒否したために\n自分のせいで病気になった人が、100％無料の予防措置を拒否したために、病院のベッドが患者で埋まってしまい\n自分のせいで病気になったのではないのに、病院のベッドが患者で埋まってしまうことで、危険にさらされる可能性があるからです。",
  "data/reddit-changemyview/r/changemyview/comments/plpuew/cmv_colleges_are_becoming_more_and_more_of_a.json": "EDIT: アジアは地理的に大きな要因であることは、コメントでの会話からもわかりました。\nこの見解が妥当であるかどうかは、コメント欄での会話から気づきました。\n\n私は誰？人口の多いアジアの名門大学でSTEM分野のデュアルディグリーを取得した最終学年の大学生です。\nアジアの人口の多い国の名門大学でSTEM分野のデュアルディグリーを取得しています。\n\n大学とその増え続けるサービス...",
  "data/reddit-changemyview/r/changemyview/comments/pm0m2x/cmv_the_original_method_is_better_than_common.json": "なぜ変更されたのか？誰が変えたのか？この簡単な数学の新しいやり方のどこが特別なのか、誰か教えてくれないかな。\nこの簡単な数学の新しいやり方が特別なのか、誰か教えてほしい。理解できません! さて... I\nやり方はわかったんだけど、なんでそれが元の方法よりいいのかがわからないんだよね\n理解できません。つまり、壊れていないなら直さなくてもいいんじゃないかと...。",
  "data/reddit-changemyview/r/changemyview/comments/pm48p2/cmv_almost_irregardless_of_opinion_if_we_expect.json": "今日、アジア人の彼女とこの会話をしていました（これは\n後で説明します)。私は基本的に、どんなに嫌なことでも\nどんなに嫌なことでも、よほどのことがない限り、誰かを非難すべきではないというのが私の考えです。\n私は基本的に、どんなに嫌なことでも、よほどのことがない限り、ほとんどのテーマで誰かの推論や道徳観を非難すべきではないという視点を持っています。言い換えれば...",
  "data/reddit-changemyview/r/changemyview/comments/pm3vjc/cmv_the_rich_of_the_middle_east_do_not_give_a.json": "すべての場合において、例外があります。しかし、私の見るところ、豊かな中近東の国々は\n豊かな中東諸国は、贅沢で壮大なバブルを自ら強化しています。\n\n例えば、ナイジェリアやインドのような第三世界の国々の国民は、中近東の外国人に比べてはるかに低賃金です。\n例えば、ナイジェリアやインドといった第三世界の国々の国民の給料は、中近東の外国人の給料に比べて、はるかに少ないものです・・・。",
  "data/reddit-changemyview/r/changemyview/comments/pm9gph/cmv_humane_euthanisia_should_be_legal.json": "私は動物を扱うことを生業としています。回復の見込みのない重篤な病気の患者さんには\n回復の見込みがない場合は、安楽死を勧めます。これが、思いやりのある\nこれが思いやりのある選択です。安楽死を選択しない人がどうなるか、私は見てきました。患者は\n患者さんはますます悪化し、何日も何週間も苦しみ続け、ついには...。",
  "data/reddit-changemyview/r/changemyview/comments/pmm672/cmv_banks_should_not_be_too_big_to_fail.json": "too big to fail」のようなことを推進することは、ひどい行為に報いることであり\n人々、労働者、市場、企業、政府などにどのような影響を与えるかにかかわらず、企業が好きなことをすることを認めています。\n人口、労働者、市場、企業、政府などにどのような影響を与えるかに関わらず、企業が好き勝手にできるようにしているのです。あなたが言っているのは「ああ\nしまった、わざと人々を騙すようなことをしたのか...」と言っているのです。",
  "data/reddit-changemyview/r/changemyview/comments/pmr0qs/cmv_the_body_positivity_movement_is_extremely.json": "誰かが投稿していたら申し訳ないのですが、やっぱりすごく腹が立ちます。私はもうすぐ\n私は減量に成功してから3ヶ月が経とうとしています。\nボディ・ポジティブ・ムーブメントを目にすると、私の血が騒ぎます。ジャンクフードを食べ続けてもいいんだよ、と人々を励ましているようで\nジャンクフードを食べ続けることを奨励したり、肥満であっても何もしなくても大丈夫だと...。",
  "data/reddit-changemyview/r/changemyview/comments/pmr441/cmv_i_shouldnt_have_to_even_bother_to_think_about.json": "ばかばかしい。私はいくつかの暗号交換を行いましたが、いずれも100米ドル以下で、その後に聞いたのは\n税金が0であっても、100ドルの利益のために***申告しなければなりません。\nばかばかしい。明らかにIRSはこの少額を申告しない私を追い詰めるつもりはありません。\nむしろ申告する方がコストがかかるのに......。",
  "data/reddit-changemyview/r/changemyview/comments/pmyr6n/cmv_outdoor_cats_are_an_unacceptable_invasive.json": "猫を外に出している人は、自分の動物が環境に不可逆的な害を与えることを喜んでいるのです。\n環境に取り返しのつかない害を与えることになる。猫を外で飼うことはとても当たり前のことで、広く普及しています。\n外で猫を飼うことが当たり前になっていて、猫は「殺し屋」だと冗談を言って笑っている人もいます。\n鳥や爬虫類を玄関先に置き去りにしているのです。時折、彼らは...",
  "data/reddit-changemyview/r/changemyview/comments/pn5xmu/cmv_trans_athletes_should_not_be_allowed_to.json": "格闘技とは、相手が動けなくなるほどのダメージを与えることです。\n続けることができないほどのダメージを与えることです。言うまでもなく、格闘技には体力と運動能力が大きく影響します。\n体力や運動能力が戦闘に大きく影響することは言うまでもありません。トランスのアスリート（MTF）が、そうでないアスリートと比較して競技に参加することは、不道徳なだけでなく、危険なことだと思います。\nトランスのアスリート（MTF）が、そうでないアスリートと競うことは、不道徳なだけでなく、危険なことだと思います。",
  "data/reddit-changemyview/r/changemyview/comments/pn1tiz/cmv_climate_change_is_impossible_to_solve_because.json": "郊外の典型的な地域を見ると、なぜ私たちが絶対に気候変動を解決できないのかがよくわかります。\n気候変動を解決することはできません。\n\nこの地域の人々は普通の人です。毎日仕事に行って、家に帰ってきて\n帰宅して子供と過ごす。\n\nしかし、彼らは郊外の大きなマックマンション（5000平方フィート）に住み、車を運転しています。",
  "data/reddit-changemyview/r/changemyview/comments/pn7xmc/cmv_vatican_city_shouldnt_beshouldnt_be.json": "e: 私のタイトルは「バチカン市国は主権国家であるべきではない／バチカン市国は主権国家として認められるべきではない」という意味です。\nshould't be recognized as a sovereign state \"という意味ですが、今になって、上のようなタイプの書き方では、とても変だと気づきました。\n今になって気がついたのですが、上記のようにタイプしたのでは、とても奇妙に見えます。\n\n国家の構成理論の下では、VCが国家であることは理解しています。\n認識されているからだと理解しています。",
  "data/reddit-changemyview/r/changemyview/comments/pnejil/cmv_covid_antivaxxers_arent_worried_about_the.json": "右派の馬鹿げた反ワクチン・ヒステリーは、注射に対する懸念の結果ではありません。\n射に対する懸念の結果ではありません。ビル・ゲイツのマイクロチップやジョージ・ソロスの資金提供など、彼らの言い訳は\nビル・ゲイツのマイクロチップやジョージ・ソロスの資金提供など、大規模な陰謀とされるものを言い訳にしているのは\n彼らの言い訳は、ただ単に、左翼を動かしている人たちへの嫌悪感や憎悪を隠すためのものです。",
  "data/reddit-changemyview/r/changemyview/comments/pnhgfd/cmv_the_folks_over_at_rhermancainreward_are_sick.json": "あのサブを見ると、誰もがコビトの死を美化しているように見えるが\nワクチンを受けていない人たちの死を称えているように見えます。その人たちは、母親、父親、娘、息子です。確かに彼らは\nしかし、なぜ私たちは彼らの死を祝うのでしょうか？それは\n文字通り、副産物の名の下に、その「報酬」があるのです。私が言いたいのは...",
  "data/reddit-changemyview/r/changemyview/comments/pnor29/cmv_corporal_punishment_is_a_form_of_child.json": "CMV: 体罰は児童虐待の一種であり、米国では違法とすべきです。\nアメリカでは違法であるべきです。\n\n体罰を禁止することに反対する人たちは、私たちの世代が「特権階級のパンジー」ばかりだと思っているからでしょうか？\n体罰を禁止することに反対する人は、私たちの世代が「特権階級のパンジー」だらけだと思っているからでしょうか？\n体罰禁止に反対する人は、自分の親が体罰をしていたからでしょうか？",
  "data/reddit-changemyview/r/changemyview/comments/pnhrn0/cmv_in_a_representative_democracy_there_should_be.json": "そのため、アメリカ（この記事ではアメリカを使用しますが、これはどの国の代表者にも適用できます）は、しばしば当然のことと考えられています。\nこの記事ではアメリカを例にしていますが、代表的な「民主主義」団体であればどこにでも適用できます。\n代表的な民主主義を持っています。しかし、そうではありません。\n\nもしあなたが代表機関の候補者に「投票」して、その候補者が選挙で負けてしまったら、あなたは何も言えません。\nあなたには何の発言権もありません。",
  "data/reddit-changemyview/r/changemyview/comments/pnpggo/cmv_tenochtitlan_was_far_more_impressive_than.json": "文字通り、水の上に建っている。24時間以内に200マイル先までメッセージを送ることができるメールシステムがありました。\n24時間以内に200マイルもの距離を送ることができる、世界最速の郵便サービスがありました。実際に\n今日の郵便の輸送よりも速いのです。15階建てのピラミッド。\n国籍に関係なく、すべての国民に無料の教育を保証していました。",
  "data/reddit-changemyview/r/changemyview/comments/pnthwe/cmv_abolishing_the_police_is_a_lazy_and.json": "警察が常に地域社会に良い影響を与えているとは言いませんし、暴力や人種差別が比較的広範な問題であることも否定しません。\n暴力や人種差別が警察活動に起因する比較的広範な問題であることも否定しません。\n暴力や人種差別が、警察活動に起因する比較的広範な問題であることも否定しません。\n\n私が純粋に比較しているのは、警察の欠陥のある構造と、実際の代替案です。\n代替案です。\n\n1）民営化された治安部隊。司法は...",
  "data/reddit-changemyview/r/changemyview/comments/pnu8hg/cmv_every_adult_person_if_they_revealed_all_their.json": "優しいおばあちゃんでも、超素敵なお友達でもいいんです。もし\nみんなが自分の本音をすべてさらけ出したら、それが政治であれ、人種であれ\n政治、人種、他人への思いなど、あらゆることについて本音をすべてさらけ出したら、社会は何かを\n社会から「排除」され、「淘汰」され、「悪者」にされてしまうようなことが...。",
  "data/reddit-changemyview/r/changemyview/comments/pnzsny/cmv_people_should_stop_confusing_the_words.json": "アメリカの政治的な議論で私が腹立たしいと思うのは、LiberalやLeftistという言葉を\nリベラルや左派という言葉を、あたかも同義語のように使っていることです。ここでは\nなぜこのようなことになってしまったのか、私なりに混乱した説明をしてみたいと思います。\nまた、なぜ、このような状況に陥ったのか、そして、なぜ、このような状況に戻ることが重要なのか、私なりの見解を述べたいと思います。",
  "data/reddit-changemyview/r/changemyview/comments/po2g1h/cmv_the_us_government_should_reform_their.json": "アメリカ政府は、所得税で得たお金の使い方が下手だということを証明していると思います。\nアメリカ政府は、所得税で得たお金をうまく活用できていないと思います。米国政府の収入の50％は、所得税から生まれています。\n収入の50％が所得税です。\nhttps://www.taxpolicycenter.org/briefing-book/what-are-sources-revenue-federal-government\n\n政府の無駄遣いは非道いものです。",
  "data/reddit-changemyview/r/changemyview/comments/pnv4mp/cmv_it_is_completely_justified_to_hate_the_new.json": "私は時々、Redditのほとんどがアメリカ的であることが嫌になります。私はインド人で、ここで手に入るワクチンを摂取しました。\n私はインド人ですが、ここで手に入るワクチンを飲みましたし、常にマスクをしています。\nなぜならインドだから。\n\nでも、在宅ワークの素晴らしさを理解していても（完全に賛成です）、どうしても気持ちが乗らない。\n賛成しています）、私はどうしても同じように感じることができません。",
  "data/reddit-changemyview/r/changemyview/comments/po7v0x/cmv_rfemaledatingstrategy_is_one_of_the_most.json": "ここでの大きな皮肉は、もし彼らの一人がこれを読んだら、彼らは自分の台座の上に乗り、嘲笑するだろうということです。\n台座に乗って嘲笑するでしょう。おそらく、彼らが存在する理由のもう一つの「例」であるため、祝福するでしょう。\n彼らが存在する理由の一つであるからです。ああ...そうか...。\n\nそこには多くの偽善とテロリズムがありますが、最も\n私が見た中で最も憎しみに満ちたレトリックは...",
  "data/reddit-changemyview/r/changemyview/comments/pog058/cmv_unpeeled_or_only_partially_peeled_shrimp_clam.json": "食事をするときは、誰もがリラックスして楽しい時間を過ごしたいと思っているはずです。\n食事をするときは、リラックスして楽しいものでなければなりません。誰かがしなければならない最後のことは\nパスタに手術をするのは一番避けたいことです。しかし、レストランが海老のパスタを提供している場合は、まさにそれが求められます。\nしかし、レストランが提供する海老のパスタには、そのようなことが求められます。",
  "data/reddit-changemyview/r/changemyview/comments/poflki/cmv_ken_jennings_hoe_response_on_jeopardy_should.json": "2004年に「ジョパディ！」のチャンピオンになった際、Ken Jennings氏は悪名高い回答をしました。\n[https://youtu.be/KoPFkjF-Bdo] \"What's a hoe?\" と答えました。\n道具の時間」というカテゴリーで次のように答えました。\n\n> 園芸用の長い柄の道具を指すこの言葉は、不道徳な喜びを意味することもあります。\n> シーカーです。\n\nアレックス・トレベックが判定したのは、...",
  "data/reddit-changemyview/r/changemyview/comments/poqszc/cmv_industry_standards_for_plussized_beauty_only.json": "プラスサイズのモデルは、女性のファッションの主流となっています。\nプラスサイズの男性モデルはどこにいるのでしょうか？\n\n昨日、Huluを見ていたら、Old NavyのCMでプラスサイズの女性たちが踊っている広告が出てきました。\n昨日Huluを見ていたら、Old NavyのCMでプラスサイズの女性たちが踊っている広告が出てきました。私はそのCMについて少し考えていました。\nと思っていたのですが...。",
  "data/reddit-changemyview/r/changemyview/comments/poraq3/cmv_genderneutral_pronouns_reinforce_the_gender.json": "性別による役割分担は時代遅れであり、アメリカでは人々が結婚する現実的な理由はありません。\n性規範や性別役割に縛られる現実的な理由はありません。今日の主流文化では、男性も女性も社会的に受け入れられています。\n伝統的にどちらかの性に属していたことを、男女ともに行うことが社会的に認められています。\n伝統的にはどちらかの性別に属していたものが、今日では男女ともに社会的に受け入れられています。例えば、...",
  "data/reddit-changemyview/r/changemyview/comments/potgtg/cmv_in_most_cases_people_that_choose_to_home.json": "構造化された標準的なカリキュラムがあったとしても、親は自分が知っている、あるいは知っていると思っていることを子供に教えることしかできません。\n自分が知っていること、知っていると思っていることを子供に教えることしかできません。親が教える内容は、親の個人的な信念や偏見に基づいたものになります。\n教える内容は、親の個人的な信念や偏見に基づいて偏ったものになります。\n代替案の提示や議論はありません。親が反...",
  "data/reddit-changemyview/r/changemyview/comments/poulih/cmv_exposure_to_misinformation_and_invalid.json": "ジョン・スチュアート・ミルは、160年前に『自由について』という名著の中で、次のように論じています。\n160年前、ジョン・スチュアート・ミルは、古典的な『自由論』の中で、「xに賛成するとされる議論や証拠を聞くことを拒否すれば、xが間違っているかどうかを真に知ることはできない」と論じたことは、最も優れた言葉でした。\nx'を支持するとされる議論や証拠を聞くことを拒否すれば、'x'が偽りであるかどうかを真に知ることはできない」と述べています。例えば、次のような場合です。\nある社会が、ホロコースト否定派や反...",
  "data/reddit-changemyview/r/changemyview/comments/pow3r4/cmv_forcing_people_to_use_inclusive_language_is.json": "免責事項：私は、すべての人がどのような言語、代名詞、電子メールを使用する権利を支持します。\n婉曲表現を使う権利を支持します。しかし、私はいつもその好意に応えるわけではありません。私はこれをしません。\n恨みや憎しみからではありません。\n\nもしこの記事のどこかで、私が冗談やパロディを言っていると思われたとしても、そうではありません。\nない。時々、私はただ...",
  "data/reddit-changemyview/r/changemyview/comments/poub0s/cmv_youth_and_high_school_sports_have_become_way.json": "私は自分で自分の日付を入力するつもりです。私が高校を卒業したとき\n20年前、私が高校を卒業した頃は、フットボールのシーズンは秋に始まり、12月のある日に終わりました。\n12月です。その後、バスケットボールのシーズンが始まり、春には多くの子供たちが陸上競技をしていました。\n春には陸上競技をしていました。夏にはフットボールのキャンプがあったのを覚えていますが...。",
  "data/reddit-changemyview/r/changemyview/comments/pp125e/cmv_allison_macks_sentence_of_3_years_for_sex.json": "判決のガイドラインは14～17年でした。彼女は3年と社会奉仕活動を受ける\n性的人身売買、性的人身売買の共同謀議、強制労働の共同謀議の罪で、3年と社会奉仕を受ける。\n共謀したことになります。彼女はNXIVMの副会長として、女性たちを性奴隷に誘いました。\n彼女はNXIVMの副会長であり、女性を性奴隷に誘い、何人かに自分のイニシャルの焼印を押していました。",
  "data/reddit-changemyview/r/changemyview/comments/povc3u/cmv_my_reduced_participation_in_capitalism_and.json": "私は現在、アマゾンのような非倫理的な行為が知られている企業にお金を出すのを控えています。\nアマゾンのように、非倫理的な行為が知られている企業にお金を出すのを減らそうとしています。道徳や倫理が主観的な尺度であることは理解していますが\n主観的な尺度であることは理解していますが、私は個人的に、労働者の搾取、低賃金、劣悪な労働条件の証拠がある企業は\n労働者の搾取、低賃金、劣悪な労働環境、違法行為...。",
  "data/reddit-changemyview/r/changemyview/comments/pp7y6s/cmv_this_trend_of_college_kids_glorifying.json": "私は最近、大学1年生になったのですが、私の周りにはたくさんの人がいることにショックを受けました。\n共産主義者や社会主義者として認識している人が多いことに衝撃を受けました。家族が共産主義国出身の者としては\n共産主義国の出身者として、彼らは実際に共産主義国に住んでいることを理解していないように思います。\n共産主義での生活がどのようなものか、よく理解していないようです。実際に共産主義国に住んでいる人はいません。",
  "data/reddit-changemyview/r/changemyview/comments/ppal4s/cmv_there_is_no_ethical_way_to_become_a.json": "まず第一に、所得格差。経済の構造上、富の量が\n富が不均等に分配されるようになっています。お金が労働のコストに使われるのではなく\n労働力のコストにお金が回るのではなく、一部の超富裕層に直接お金が回ります。これらの製品の需要が増えれば増えるほど\n製品の需要が増えれば、最低賃金労働者の仕事が増え、より多くのお金が...",
  "data/reddit-changemyview/r/changemyview/comments/pp8z8j/cmv_implementation_of_any_extremist_ideology.json": "共産主義、ファシズム、ドミニオン主義、サラフィズム、絶対王政など、スペクトルのどの部分について話すかは問題ではありません。\n共産主義、ファシズム、ドミニオン主義、サラフィズム、絶対王政などなど。\n\n共産主義、ファシズム、ドミニオン主義、サラフィズム、絶対王政など、どの分野であっても、これらのイデオロギーが実行されると、生活水準が低下します。\nこれらのイデオロギーが実行された結果、生活水準の低下、文化遺産の破壊、個人の自由の破壊、社会的停滞、経済...\n社会的停滞、経済的停滞...。",
  "data/reddit-changemyview/r/changemyview/comments/ppj0r2/cmv_nicki_minaj_is_not_somebody_we_should_be.json": "私は、人々がなぜ医療情報に関心を持つのかについて、とても困惑しています。\nNicki Minaj? まじめな話、なぜ？\n\n彼女は正式な教育を受けておらず、特に科学の分野ではありません。政府、ファウチ、そして\nホワイトハウスは、彼女の周りで会話を楽しむべきではありません。実際に。\n彼女は十分な手術を受けており...",
  "data/reddit-changemyview/r/changemyview/comments/pphd5n/cmv_if_we_solve_the_problem_of_food_deserts_we.json": "米国では、9人に1人がSNAP（Supplemental Nutrition Assistance Program：栄養補助プログラム）を利用しています。\nプログラム（フードスタンプとしても知られており、米国の低所得者向けの最大の食料支援プログラムである\nCenter on Budget\nand Policy Prioritiesが発表しました。SNAPの給付金は、その内容によって異なる...",
  "data/reddit-changemyview/r/changemyview/comments/ppn253/cmv_defunding_the_police_will_only_worsen_the.json": "まず最初に： - メンタルヘルスサービスに資金を提供すべきでないと言っているわけではありません。私たちは\n絶対にそうすべきです。- 警察が軍のおもちゃを買うことを認めるべきだとは言っていない。\n買っていいとは言っていません。私たちは警察に資金を提供しているのだから、警察が何を買ったり使ったりすることが許されるかを決めることができるのは当然だ。\n使うことができます。- 悪行に報いるべきだとは言っていないし、単に...",
  "data/reddit-changemyview/r/changemyview/comments/ppqrgn/cmv_nuclear_energy_is_a_viable_tool_to_revert.json": "原子力が理想的なものではないこと、欠点があることは十分承知しています。\nしかし、私が思うに、原子力発電に関するほとんどの懸念は解決できるものです：放射性廃棄物が出ること。\n放射性廃棄物が出ること、歴史上ひどい核災害があったこと、核兵器の開発に使われる可能性があること、そして...。\n核兵器の開発に使われる可能性があること、そして...。",
  "data/reddit-changemyview/r/changemyview/comments/pplh60/cmv_a_criminal_defendants_civil_liberties_and_due.json": "犯罪や、世間が望むような処罰を受けていない人のニュースがあるたびに\n世間が望んでいるほどの罰を受けていない人が出てくると、必ずと言っていいほど\n以下のようなコメントが必ずと言っていいほど寄せられます。\n\nこの小児性愛者は技術的な理由で \"免れた \"のだ。この小児性愛者は詭弁を弄して \"無罪放免 \"になった！これは公平なのか？\n\n\"どうして...",
  "data/reddit-changemyview/r/changemyview/comments/ppscg4/cmv_20_years_in_the_middle_east_wouldve_been.json": "メキシコのカルテルは、アメリカやカナダの麻薬の大きな供給源となっています。彼らは政府のように\n政府のようにメキシコを支配し、政府のように麻薬農家に税金を課し、政府のように公共事業を立ち上げるものもある。\n政府のように公共事業を立ち上げています。軍隊の力を使ってカルテルと戦うこと20年。\n軍隊の力でカルテルと戦うことで、20年後には\n\n1）メキシコを（ある種の）同盟国にして...",
  "data/reddit-changemyview/r/changemyview/comments/pq2cmn/cmv_being_in_the_military_doesnt_make_you_a_hero.json": "私は軍の退役軍人です。ベトナム戦争に従軍しました。兵役に英雄的な要素はありません。\n兵役に英雄性はありません。私は、社会経済的に恵まれない環境にいる子供たちが、厳しい環境から逃れるために\n恵まれない社会経済的背景を持つ子供たちが、行き詰った生活から逃れるために軍に参加しています。そして軍隊は\n軍隊がそれを提供してくれるのは間違いありません。私は兵役に就き、それを喜んでいます。....",
  "data/reddit-changemyview/r/changemyview/comments/pq39dr/cmv_with_very_few_exceptions_single_family_houses.json": "アメリカの住宅事情はどうにもならない。私は今、初めての住宅購入を検討しています。\n数年後にワシントン州西部で最初の家を買おうとしていますが、そこの状況はとんでもないものです。\nそこでの状況は馬鹿げています。家は希望額より何万円も高い値段で売られています。\n提示価格よりも何万円も高い価格で家が売られ、不動産業者は家が売れたその日に多くのオファーを受けています。",
  "data/reddit-changemyview/r/changemyview/comments/pqep7w/cmvi_am_terrified_of_dying_please_change_my_view.json": "こんにちは、私は誰かがこのトピックに関する私の見解を変えてくれることを強く望んでいました。\nと思っていました。私はこれまで良い人生を送ってきました。私はまだ25歳で、これからもずっと\n私はまだ25歳で、これからの人生があります。家族、友人、ガールフレンドにも愛されています。しかし、私は\n死は絶対に怖いです。終わりのない無の世界が...。",
  "data/reddit-changemyview/r/changemyview/comments/pqh0wl/cmv_the_lgbt_community_is_extremely_unwelcoming.json": "最初に申し上げておきますが、私は個人に関してはLGBTQA+をとても支持しています。\n私はLGBTQA+を支持しています。\n私は、個人に関してはLGBTQA+をとても支持しています。しかし、私自身は\nLGBT+のコミュニティは非常に歓迎されず、受け入れられないと感じています。",
  "data/reddit-changemyview/r/changemyview/comments/pqnr3d/cmv_the_problem_isnt_that_bezos_is_a_billionaire.json": "そこで、私はこう考えています。ベゾスは一番のお金持ちです。私はそれでいいと思います。\n経済の大部分に革命を起こしたのだから。あなたがそれでいいかどうかは別の話です。\nこの議論では無視しますが、彼のやっていることには私が軽蔑するものもあります。\nこの議論では無視します。彼の富は、彼が所有する株式によるものです...。",
  "data/reddit-changemyview/r/changemyview/comments/pqtstg/cmv_youtube_should_allow_comment_dislikes_to.json": "ほとんどのYoutubeユーザーは以前から気付いていたと思いますが、YouTubeのコメントは\nYouTubeのコメント欄には「好き」と「嫌い」のボタンがありますが、「嫌い」のボタンは\n実際には何もしていないようです。せいぜいコメントの評価に影響を与えるくらいです。\nバックグラウンドでコメントの評価に影響を与えることはあっても、コメントの表示に影響を与えることはありません...。",
  "data/reddit-changemyview/r/changemyview/comments/pqsbvi/cmv_there_is_nothing_wrong_with_american_gun.json": "私はマルクス主義者ですが、マルクス自身が「いかなる口実でも武器と弾薬を渡してはならない。\n労働者を武装解除しようとするいかなる試みも、必要ならば力ずくで阻止しなければならない。\n労働者の武装解除の試みは、必要ならば力ずくで阻止しなければならない」と言っています。\nアメリカで起きている銃乱射事件のほとんどは、学校やその他の社会的状況に起因していると思います。\nアメリカで起きている銃乱射事件の多くは、それらを取り巻く社会的状況に起因していると思います；学校...",
  "data/reddit-changemyview/r/changemyview/comments/pr5izr/cmv_more_support_should_be_offered_to_those.json": "他の国ではどうなのかわかりませんが、イギリスでは、精神的な問題を抱えている人のために、無料で治療を受けることができます。\nイギリスでは、精神的な問題を抱えている人のために、無料で治療を受けることができます。とはいえ\nNHSのこの部門は、他の部門と同様に資金が不足しています。\nと思いますが）。) 当然のことながら、これらの治療法は...",
  "data/reddit-changemyview/r/changemyview/comments/prex47/cmv_the_best_part_of_a_drumstick_ice_cream_cone.json": "コーンの底に詰まっている固まった安物の小さなチョコがおいしい。\nおいしい。確かに、アイスクリームも美味しいし、ナッツも...フィリングも...ですが、私がドラムスティックを買うのは、最後のほんの一口のためだと思います。\nしかし、私がドラムスティックを買う理由は、最後のほんの一口のチョコレートとワッフルコーンが混ざったものを食べるためだと確信しています。\n私がドラムスティックを買う理由は、チョコレートとワッフルコーンが混ざった最後の小さな一口のためだと思います。ワッフルさえ買えれば・・・。",
  "data/reddit-changemyview/r/changemyview/comments/prgxtg/cmv_the_american_healthcare_system_is_broken.json": "私はアメリカ人で、アメリカの医療制度を学ぶために勉強しています。\n私が目にするのは、保険がいかにシステムに悪影響を与えているかということと、医師が書類や記録に追われて\n医師は事務処理や記録に追われ、患者との時間を大切にすることができません。\n患者さんと充実した時間を過ごすことができなくなりました。\n\n私がよく耳にするのは、モラルの喪失と燃え尽き症候群についてです。",
  "data/reddit-changemyview/r/changemyview/comments/prsmez/cmv_its_not_okay_to_punch_above_like_how_some.json": "今回は、スウェーデンのセレブが「I hate men, HATE HATE\nHATE！」とインスタグラムやツイッターなどに投稿しているスウェーデンのセレブがいます。\n\n彼らは皆、同じ言い訳を使っていて、「少数派として上を殴ることは決して間違っていない。\n私はそうは思いません。\n\n私はそうは思いません。もし私たちがある地点に到達するとしたら...。",
  "data/reddit-changemyview/r/changemyview/comments/prwvmz/cmv_god_is_just_santa_claus_for_adults.json": "あなたはサンタクロースやすべての「魔法」を信じ、明らかに非論理的な問題を無視しています。\nプレゼントがもらえるからです。そして、ようやく世界を理解したとき\nプレゼントがもらえるからです。神様も同じです。\n人間が作ったすべての宗教も同じようなものです。あなたはすべてを無視して...",
  "data/reddit-changemyview/r/changemyview/comments/prymcu/cmv_countries_are_slowly_becoming_more_and_more.json": "TL;DR: 政府と民間企業の両方が、ほとんどの国で市民的自由と個人的自由を侵食しています。\n個人の自由を侵食しています。\n\nアメリカでは愛国者法が施行され、他の国でも同じような法律が制定されています。\n政府は、正当な理由がほとんどないのに、民間人を監視しています。\n政府が採用する...",
  "data/reddit-changemyview/r/changemyview/comments/psjsdd/cmv_the_trend_in_moviesseries_that_glorifies_it.json": "タイトルは自分で説明します。\n唯一の例外は、自己防衛のためにボールを蹴ることです。\n(または男性が女性に極端な性差別やセクハラをした場合)、または\nレイプの報復としての去勢。\n\nそれ以外の場合は、ただの性的暴力と屈辱であり、それは痴漢行為と同じくらい厳しいものです。\nそれ以外の場合は、ただの性的暴力と屈辱であり、それは痴漢行為と同じくらい厳しいものです。",
  "data/reddit-changemyview/r/changemyview/comments/psk8ol/cmv_theres_no_such_thing_as_a_religious_exemption.json": "ワクチンの「宗教上の免除」なんてありません。\n\n誤解のないように言っておきます。私は他の宗教のことはよく知りませんが、聖書とキリスト教の教義はよく知っています。\n聖書やキリスト教の教義はよく知っていますし、聖書には予防接種については何も書かれていません。\n予防接種については何も書いていません。\n\n聖書には、隣人を愛することについて多くのことが書かれており、それは...",
  "data/reddit-changemyview/r/changemyview/comments/psjpnx/cmv_culture_is_not_defined_by_your_skin_colour.json": "最近、「白人文化」という言葉をよく耳にするようになり、とても困惑しています。\n困惑しています。白人をひとつの文化にまとめてしまうのは、ちょっと人種差別ではないでしょうか？\n差別的ではないでしょうか？アフリカ系アメリカ人が皆、同じ文化を持っていると言っても、少し違和感があるのではないでしょうか？\n同じ文化を持っていると言っても、少し違和感がありませんか？育った白人を例にとると...。",
  "data/reddit-changemyview/r/changemyview/comments/pspbmk/cmv_paparazzi_should_be_illegal.json": "最近、カニエが朝4時に家に来たパパラッチを叱っている古い映像を見ました。\n朝4時に家に来たパパラッチを叱っている映像を見ました。Kanyeの言っていることはもっともで、なぜ自分の家ではなく\n自分の家でもないのに、なぜそんな時間に家の外にいなければならないのか？普通の人はそんなことをしたら嫌がらせで逮捕されてしまう\n普通の人はそんなことをしたらハラスメントで逮捕されるけど、いきなりカメラを持っていたら...。",
  "data/reddit-changemyview/r/changemyview/comments/psusti/cmv_the_vast_majority_of_incels_are_unwanted.json": "全く平均的な（時にはそれ以下の）製品を何度見たか数え切れないほどです。\n平凡な男が、とてつもなくホットな人と付き合うのを何度も見た。\n\n彼らはどうやってそんなことをしたのでしょう？信じられないかもしれませんが、それは彼らが\n批判するのではなく、実際に女性との付き合い方を学ぶことに時間を費やしたからです。\nオンラインで批判するのではなく、実際に女性との付き合い方を学んだからです。",
  "data/reddit-changemyview/r/changemyview/comments/psre0z/cmv_assisted_suicide_should_be_legal_to_anyone.json": "私は、自殺幇助は、1歳以上の人には合法的に行われるべきだと考えています。\n18歳以上であれば、自殺幇助を合法的に行うべきだと考えています。理由は簡単で、私たちは自分の体に対する自律性を持つべきであり、自分がいつ、どのように自殺するかを決めるべきです。\nいつ、どのように死ぬかを決めるべきだからです。精神的に病んでいる必要はありません。\n自殺する必要はありません。時々、人生は最悪で、あなたの状況は...",
  "data/reddit-changemyview/r/changemyview/comments/pst1ak/cmv_woke_americans_who_say_us_is_a_third_world.json": "若者たちが、アメリカは最低だとか、自分の特権を調べろとか言っているのを見ると\nアメリカはクソだとか、自分の特権をチェックしろとか（笑）、グッチのベルトを持った第三世界の国だとか。\nベルトをしているのを見て、本気で心を動かされました。\n\nこのような特定の子供たちは、人生で何かにお金を払う必要がなかったのです。\n親がそうしているから...。",
  "data/reddit-changemyview/r/changemyview/comments/pt0k2o/cmv_landlords_are_over_villainized.json": "大家さんに嫌な思いをしている人は多いと思いますが、私は大家さんが過剰に非難されていると思います。\nしかし、私は大家が過剰に非難されていると思います。\n\n全ての大家さんが何千ものビルを所有する大金持ちではありません。\n\n公平に見ても、我々が認めている以上に、彼らは入居者から嫌な目に遭っていると思います。\n認めたくないのです。\n\n真面目な話、あなたは...",
  "data/reddit-changemyview/r/changemyview/comments/pt3wsr/cmv_i_dont_think_human_society_has_what_it_takes.json": "簡単な用語の定義が必要です。気候大変動というのは、私が提案しているのは\n摂氏3度という具体的な基準値を提案しています。\n\nこれは私があまりにも頻繁に考えていることであり、これまでもずっと考えてきたことです。\n今もそうです。最近父親になって、若い家族がたくさんできたことの副作用かもしれません。\n若い家族が多いことの副作用かもしれませんが...。",
  "data/reddit-changemyview/r/changemyview/comments/pt50fq/cmv_if_it_isnt_sexist_to_have_sex_preferences.json": "人種差別や性別差別では、身体的特徴を利用して潜在的な能力を差別します。\nは、パートナー候補を差別するために利用されています。\n\nチンコが嫌いな人は、男とはやらないし、デートもしない。黒人の特徴が嫌いな人は\n黒人の特徴が嫌いな人は、黒人とは付き合わないでしょう。これらは、どちらも...",
  "data/reddit-changemyview/r/changemyview/comments/pt8ofc/cmv_gay_marriage_should_be_legalised_in_all.json": "なぜ同性婚が合法化されないのか、私には理解できませんでした。\nなぜ人々が反対しているのかという意見を調べてみましたが、宗教的な答えしか返ってきませんでした。\nと答えています。私は無宗教です。私はバイセクシャルでボーイフレンドがいますが、二人とも宗教的背景を持っています。\n宗教的背景があり、無神論に改宗しました。それに基づいて、あなたは...",
  "data/reddit-changemyview/r/changemyview/comments/ptcghe/cmv_americans_have_been_split_apart_by_the_media.json": "この2年間、何でもかんでも政治の話にしてきましたが、その結果どうなったかというと\n私たちにもたらしたものを見てください。私たちの国を見てください、どれだけバラバラになっているか。アメリカ人としての誇りは\nアメリカ人としての誇りはどこへ行ってしまったのでしょう。私たちがすることといえば、反対意見を支持する他の人々を非難することだけです。\n反対意見を支持する人の悪口を言うだけなのか？",
  "data/reddit-changemyview/r/changemyview/comments/pteddo/cmv_pregnant_women_should_be_automatically.json": "私はカトリック教徒ですが、私の父は数年前に幹細胞治療を受けました。それによって\n生活の質が大幅に向上しました。事前に知っていたのは、女性のアフタービ\n女性の出産後の血液には、たくさんの幹細胞が含まれていて、それを利用することができます。\n使える幹細胞がたくさん含まれていて、実際に女性がそれを提供することができるということを事前に知りました。私は...",
  "data/reddit-changemyview/r/changemyview/comments/pthme4/cmv_blues_states_should_take_a_leaf_out_of_texass.json": "単純なことですが、「あなたが拳を振るう権利は、私の鼻が始まるところで終わる」という原則に基づいています。\n拳を振るう権利は私の鼻先で終わる」という原則に基づき、自由を行使した人が誰かに損害を与えた場合は\n誰かが自由を行使することで誰かに犠牲を強いることになれば、その責任者は責任を負うべきです。 \n政治的な現実は、ワクチン接種を拒否した人に責任を負わせることを制限するかもしれませんが...。",
  "data/reddit-changemyview/r/changemyview/comments/ptxdb1/cmv_insurance_is_a_scam.json": "自動車保険やホームオーナーズ保険は詐欺です。ねずみ講のように運営されていることが多い\nねずみ講のようなものです。保険金を請求すると料金が上がります。なぜ私たちは保険料を払うのでしょうか？\n保険会社から受け取ったお金を、時間をかけて返済しなければならないとしたら。\nなぜ保険料を払うのでしょうか...。\n\n私は、あなたが何か問題を抱えていることを知っています...",
  "data/reddit-changemyview/r/changemyview/comments/ptztth/cmv_the_us_republican_party_is_not_fascist_and.json": "もし、あなたがこれらの声明の1つを信じているなら、もう1つを信じるべきです。\n\n理由はこうです。\n\n共和党主導の分断政権から民主党主導の政権への政権交代が8ヶ月後に迫っています。\n共和党主導の分断政権から民主党主導の政権への政権交代が8ヶ月後に迫っています。共和党政権から3年後\n共和党主導の政権からは3年後です。もし、政権交代を経験していたら...。",
  "data/reddit-changemyview/r/changemyview/comments/pu21g3/cmv_there_is_no_good_reason_against_universal.json": "CMV: 米国では、18歳未満の子供に国民皆保険を適用しない理由はありません。\nアメリカ\n\n 1. 健康保険は雇用と結びついているので、子供は自分の健康保険に入ることができません。\n    健康保険は雇用と結びついており、フルタイムの仕事は学校であるべきだからです。\n 2. 子どもたちは社会的弱者の一人であり、社会としては...",
  "data/reddit-changemyview/r/changemyview/comments/pu50qh/cmv_16_while_a_historically_awful_event_was_not.json": "私の考えが変わるかどうか気になる一番のポイントは、誰も\nトランプもクルーズも、共和党の誰もが、自分の支持者が首都を襲撃して議員に危害を加えることを\n共和党の誰もが、自分たちの支持者に首都を襲撃させ、議員に危害を加えることを計画していなかったということです。\n共和党の誰もが、トランプの政権維持のために支持者に首都を襲撃させ、議員に危害を加えることを計画していなかったということです。\n\nまず第一に、もしそれが計画されていたとしたら、何...",
  "data/reddit-changemyview/r/changemyview/comments/pu8jp9/cmv_your_religion_should_have_no_effects_on_my.json": "あなたの宗教はあなたの宗教であり、私の法律に影響を与えるべきではありません。あなたは\n自分の体で何をしたいか、誰と結婚したいかを選ぶことができます。\n誰と寝るかを選ぶことができます。私は自分の体で何をしたいのか、誰と寝るのかを選ぶことができます。\n選ぶことができます。\n\n純粋に理解できないのは、2,000年前の...",
  "data/reddit-changemyview/r/changemyview/comments/pu4oun/cmv_asshole_aggregation_subreddits_dedicated_to.json": "r/vaxxhappenedや/r/therightcantmemeのようなサブは、他の何百ものサブと同様に、他のサイドのアホを強調するために存在しています。\nのようなサブは、結局のところ、彼らのプロパガンダをプラットフォーム化して\n彼らのプロパガンダをプラットフォーム化し、彼らのメッセージに対する主流の露出を増やしているだけです。\nメッセージング戦略の主流への露出を増やしているだけです。\n\nシラミや右翼が何でも投稿するように...",
  "data/reddit-changemyview/r/changemyview/comments/pu4cl9/cmv_regional_restrictions_in_software_are.json": "皆さん、こんにちは。この話題はredditの大半の方には馴染みのないものかもしれませんが\nしかし、東欧人である私は、正直言って意味のない制限にぶつかっています。\n私は東欧人として、正直言って意味のない制限にぶつかっています。\n\n例を挙げてみましょう。私は、Alexaが搭載されたBluetoothスピーカーを持っています。Spotify\nのプレミアムを利用しています。繋ごうとすると...",
  "data/reddit-changemyview/r/changemyview/comments/puksvs/cmv_there_is_nothing_intrinsically_wrong_with.json": "(1)カニバリズムは最近の（比較的最近の）タブーであり、徹底的に西洋の\nタブーである。すべての大陸で行われてきた（あるいは行われている）が、最も有名なのは、アメリカ大陸と太平洋\n最も有名なのはアメリカ大陸と太平洋地域です。ヨーロッパでも歴史上の様々な時期に行われていました。\n行われていました。\"カニバリズム \"はカリブ族に由来する。\n\n(2)その...",
  "data/reddit-changemyview/r/changemyview/comments/puni86/cmv_the_us_federal_government_should_institute_a.json": "米国には、債務問題とデータセキュリティの問題があります。\nアメリカには債務問題とデータ・セキュリティ問題がありますが、これらは相互に有益な解決策があると考えています。\nつまり、データを侵害した企業や機関に厳しい財政的な影響を与えることです。米国では、あらゆる分野でデータ侵害がシステム的に再発しています。\n米国では、あらゆる分野でデータ侵害が再発しており、組織...",
  "data/reddit-changemyview/r/changemyview/comments/pumx0q/cmv_institute_a_proper_minimum_wage_rather_than.json": "今日は、アメリカのチップ文化についての会話に遭遇しました。\n個人的には馬鹿げていると思っています。予想通り、この話題に参加したほとんどのアメリカ人は\nこの話題に参加したほとんどのアメリカ人は、チップを出すことに賛成で、外食はすべきだと悪趣味な議論をしていました。\nチップを払えない客は外食を避けるべきだ」と悪口を言っていました。",
  "data/reddit-changemyview/r/changemyview/comments/puqq7n/cmv_a_workstudy_program_where_active_addicts_get.json": "依存症になったことのある人や知っている人は、次のハイがなければ何も始まらないと思っています。\nハイになります。家賃、請求書、食べ物などは、肝臓を切り刻んだようなものだ。そんな人たちが\n困ったことになってしまいます。\n\nもし、ヘロイン中毒者などのための職業プログラムを始めることができれば、彼らは...。そうすれば...。",
  "data/reddit-changemyview/r/changemyview/comments/pv4a43/cmv_at_least_part_of_the_reason_of_why_mens.json": "タイトルからして変ですが、説明させてください。\n\n男性の立場から言うと、男性に影響を与える社会的な問題はたくさんあります。\n家裁や刑事裁判での偏見、ホームレス、成功しなければならないというプレッシャー、様々なサポートの少なさなど\n様々な問題に対するサポートの少なさなどです。このような問題は、男性の社会的地位の向上には、（積極的な）関心が寄せられていません。\n注目されていません。",
  "data/reddit-changemyview/r/changemyview/comments/pv5lgb/cmv_910_people_buying_the_brand_new_iphone_13_on.json": "CMV: Appleのマーケティングは非常に強力で、何百万人もの \"生涯顧客 \"を抱えています。\n何百万人もの \"生涯顧客 \"に融資していますが、彼らには性能面でのアップグレードはありません。もし\n新しいiPhoneの外観以外のすべての部品を交換したとしたら\n新しいiPhoneの外観以外の部品をすべて交換しても、購入する人の9/10は気づかず、...",
  "data/reddit-changemyview/r/changemyview/comments/pv630v/cmv_boba_fett_at_least_as_he_appears_in_the.json": "私はスター・ウォーズの超ファンであることを断っておきますが、少なくともディズニー・キャノンについては\n私はスターウォーズの超ファンです。すべてのショーを見て、すべてのゲームをプレイし、すべての映画を定期的に見返し、さらにいくつかの本も読みました。\n本も何冊か読んでいます。\n\nそういった意味では、ボバ・フェットが最も...\n最も...",
  "data/reddit-changemyview/r/changemyview/comments/pv79q7/meta_a_brief_clarification_on_rule_5.json": "ルール5の削除メッセージが不明確で、よく誤解されています。\nそのため、改訂します。以前は次のように書かれていました。\n\n> コメントは、会話に意味のある貢献をしなければなりません。以下のようなコメントは\n> リンク、ジョーク、「書かれたアップヴォート」だけのコメントは削除されます。ユーモアとアファメーション\n> の...",
  "data/reddit-changemyview/r/changemyview/comments/pvew60/cmv_highschools_in_nations_with_wide_internet.json": "私は、インターネット上で人々がお互いにストレスや苦悩、その他の悪感情を抱く原因の大部分は、何らかの理由で\nインターネット上で人と人との間に大きなストレスや苦痛、その他の悪感情が生じてしまうのは、ある程度は\nもし、公教育でインターネットの知識の基準を作ったとしたら...。\nもし、公教育でインターネットの知識の基本レベルを確立したら...",
  "data/reddit-changemyview/r/changemyview/comments/pv8mqo/cmv_extended_payment_terms_should_be_abolished.json": "その仕組みを簡単に説明し、なぜあなたがこの問題に関心を持たなければならないのかを論じる簡単なシラバスを提供します。\nこの問題に関心を持つべき理由を簡単に説明します。\n\nまず、私は経済学者や会計士ではなく、大企業で働くビジネスリーダーです。\n私は経済学者でも会計士でもなく、大企業で働くビジネスリーダーです。\n世界の片隅で起きていることを見て、いくつかの結論を導き出し、...",
  "data/reddit-changemyview/r/changemyview/comments/pvh0l8/cmv_america_should_have_tax_funded_healthcare.json": "1）アメリカ以外にも多くの国で導入されていること\n\n2）現在の価格が高すぎる。診断を受けるために何百ドルも払うなんて\nばかばかしい\n\n\"しかし、私の個人主義\"\n\nこの議論は私を悩ませます。警察を取り上げて、自活することを強要すべきなのか\n警察を廃止して自活させるべきか？\n\nまた、ただ、...",
  "data/reddit-changemyview/r/changemyview/comments/pvnjye/cmv_skin_color_plays_a_pretty_minor_role_when.json": "まず第一に、私は怒っている白人ではありません（それどころではありません）が、私の意見では\n私の考えでは、肌の色は特権を決定する上ではかなり小さな役割を果たします。\n\n特権の多くは、充実した生活を送るために誰かが持っている手段の種類によって決まります。\n充実した生活を送ることができます。体力のある有色人種は、高度な...",
  "data/reddit-changemyview/r/changemyview/comments/pvsvkp/cmv_capitalist_practices_are_seriously_causing.json": "EDIT : 「消費者主義」という言葉がピッタリだと思います。\n私の頭の中では、同じようなものです。\n\n私はこの問題と折り合いをつけようとしていて、ちょっと複雑なんですが、理解してください。\n私はこの問題に折り合いをつけようとしていて、少し複雑なのですが、あなたがCMVをするためのポイントを段落に分けて説明できるように最善を尽くします。\nしかし、私は、あなたがCMVに参加するためのポイントを持った段落に分けて、最善を尽くします。\n\nすべて...",
  "data/reddit-changemyview/r/changemyview/comments/pvugat/cmv_i_solely_blame_the_current_state_of_the.json": "この記事を作成した時点で、米国では1日あたり約2000人の死者が出ています。\nCovid-19による死亡者数は1日あたり約2000人です。これほど多くの死者が出たのは3月以来のことです。\nウイルスのデルタ型が広がっていることから、このパンデミックを乗り越えるという点では後退し始めています。\nこのパンデミックを乗り越えるためには、後退し始めています。私たちは戻り始めている...",
  "data/reddit-changemyview/r/changemyview/comments/pvkg56/cmv_theres_nothing_really_wrong_and_terrible.json": "生きるために働かなければならないのは馬鹿げている、という話を多くの人が聞いたり見たりしています。\n生きるために働かなければならないなんて、馬鹿げている」という話をよく耳にします。人類が誕生して以来、私たちは生きるために働かなければなりませんでした。\n生きるために働かなければなりませんでした。それが畑仕事であっても、それ以外のことであっても。\n生きるために働かなければなりませんでした。すべての動物は生きていくために働き、狩りをしなければなりません。",
  "data/reddit-changemyview/r/changemyview/comments/pvwycj/cmv_social_media_causes_more_problems_than_its.json": "ソーシャルメディアとは、Facebook、Instagram、Tiktok、その他のプラットフォームのことです。\nソーシャルメディアとは、Facebook、Instagram、Tiktok、その他のプラットフォームで、顔やアイデンティティが実際の人のように結び付けられているものを指します。\n\nソーシャルメディアは、人々が遠く離れた場所でコミュニケーションをとり、物語を共有することを可能にします。\nソーシャルメディアは、遠距離でのコミュニケーションを可能にし、ストーリーを共有し、遠く離れた人や「異質」な人とのつながりを提供します。",
  "data/reddit-changemyview/r/changemyview/comments/pw6k5o/cmv_to_solve_the_housing_crisis_we_should_just.json": "もし、不動産帝国を解体し、個人や企業が所有する家の数に上限を設ければ\n個人や企業が所有できる家の数に上限を設ければ、彼らは売らざるを得なくなり、価格が現実のものに戻ってくるでしょう。\nまた、住宅を必要としている人たちにも住宅を提供することができます。\n- 個人の上限を例えば5軒（余裕を持って）にしてはどうでしょうか - 小規模な不動産...",
  "data/reddit-changemyview/r/changemyview/comments/pwd4wg/cmv_sex_work_should_be_decriminalized_not.json": "セックスワークを合法化すべきでない理由はたくさんあります。人々は、それがマクドナルドのような\nマクドナルドなどの他の仕事と変わらないと言われますが、そうではないことはわかっています。\n本当ではありません。あなたが誰かの注文を取っている写真は、おそらくあなたの将来に悪影響を及ぼさないでしょう。\n裸の写真は将来に悪影響を及ぼすでしょう。あなたはいつも、どのように...",
  "data/reddit-changemyview/r/changemyview/comments/pwfp6f/cmv_climate_change_protesters_who_block.json": "イギリスのニュースでは、数日に一度、主要な道路や自動車道で逮捕者が出たというニュースが流れます。\n気候変動活動家が道路を封鎖したため、幹線道路で逮捕者が出たというニュースが英国では毎日のように報道されています。これは\nこれは彼らが抗議するための一般的な方法のようですが、私は逆効果だと思っています。\n\n私は環境問題に関心がありますが、運転手としては、もし...",
  "data/reddit-changemyview/r/changemyview/comments/pwithn/cmv_residential_homes_should_only_be_sold_to.json": "さて、人類の仲間たちよ......これは議論の余地があるだろうから、私は問題と計画の詳細を説明するつもりだ。\n問題と計画を説明します。\n\n問題：大金持ちが物件を買い占め、普通の人と直接競合している。\n競合している。普通の人は、個人の収入に応じて不動産を購入することが制限されています。\n普通の市民は、個人の収入や保有資産に応じて、不動産の購入を制限されています...。",
  "data/reddit-changemyview/r/changemyview/comments/pwm9bw/cmv_the_united_states_is_actually_doing_a_pretty.json": "なるべく簡潔にまとめようと思います。\n\n最近、アメリカでは予防接種が大変なことになっているという話を耳にします。\nアンチバクサーのせいで、アメリカの予防接種がいかにひどいことになっているかを聞いています。よく引き合いに出されるのが\n全人口の55％が予防接種を受けているという数字がよく引用されます。\n30日...",
  "data/reddit-changemyview/r/changemyview/comments/pwro0y/cmv_if_you_are_nonbinary_it_is_ok_and_completely.json": "AFABの非バイナリーの友人が、見ず知らずの人に電話で性別を間違われたことについて、Instagramに暴言を投稿しました。\n見ず知らずの人に電話で性別を間違えられたことをInstagramに投稿しました。すると、他の誰かが、そのビジネスを報告すべきだと答えました。\nまた、見知らぬ人に性別を間違われた話や\nまた、見知らぬ人から性別を間違えられた話や、人々がそう思い込むことがどれほど恐ろしいことかを紹介しています...",
  "data/reddit-changemyview/r/changemyview/comments/pwpl1s/cmv_any_social_media_that_has_a_like_button.json": "ソーシャルメディア上の投稿を（機能的に）ダウンノートやディスカウントする機能がないと\n好きなことを言っても、ほとんど肯定的な意見しか返ってこない環境を作っていることになります。\n肯定的なフィードバックしか得られないような環境になってしまいます。例えば、ものすごく差別的な投稿をした人がいたとします。\nとてつもなく人種差別的な投稿をした人がいたとします。1万人の人がこのような投稿をしたかもしれません。",
  "data/reddit-changemyview/r/changemyview/comments/pwn722/cmv_there_is_no_excuse_for_cheating_in_a.json": "編集部：私が言っているのは、アメリカやカナダなどの似たような国の話であって、離婚が違法であったり、事実上できない国の話ではありません。\n離婚が違法であったり、事実上不可能であったりする国ではありません。\n\n配偶者や恋人を裏切る正当な理由があるとは思えません。\n配偶者や彼氏・彼女を裏切る正当な理由があるとは思えません。特に結婚となると、誓いの言葉を述べてから\n誓って約束したのですから・・・。",
  "data/reddit-changemyview/r/changemyview/comments/pwngya/cmv_misogynistic_rap_music_fuels_rape_culture_is.json": "ウィキペディアの記事「ラップミュージックにおけるミソジニー」のように\n[https://en.wikipedia.org/wiki/Misogyny_in_rap_music] の記事が示すように\n女性蔑視は、ラップ・ミュージック、特に最も人気のあるラップ・ミュージックに顕著かつ広く見られる特徴です。\n最も人気のある表現では、女性差別が顕著に見られます。このことが私の人生に大きな影響を与えた理由はいくつかあります。\n私に重くのしかかってきた理由はいくつかあります。",
  "data/reddit-changemyview/r/changemyview/comments/px3zc1/cmv_the_right_to_vote_should_never_be_removed.json": "(編集：デスクトップに切り替えたので、新しい投稿を見つけるのに苦労しています...。\nあなたの記事に返信していなかったら、申し訳ありません。)\n\n私が知っている限りでは、アメリカで（永久的または一時的に）権利を剥奪される方法は以下の通りです。\n一時的に）米国で権利を剥奪される唯一の方法は、以下の通りです。1)犯罪 2)借金 3)障害者 4)居住地...",
  "data/reddit-changemyview/r/changemyview/comments/px7c9e/cmv_its_fine_to_call_yourself_vegan_if_youre_only.json": "Redditに登場するヴィーガンの多くは、ヴィーガンとはライフスタイルやイデオロギーのことだと言います。\nヴィーガンになるためには、動物愛護に熱心でなければならず、非常に厳しい態度で臨まなければなりません。\nしなければなりません。もしそうでなければ、ただの「植物ベース」に過ぎません。\n\nしかし、カジュアルな使い方では、ヴィーガンとは食生活のことを指します。人が話すときは\nヴィーガンとか...",
  "data/reddit-changemyview/r/changemyview/comments/pxf1uy/cmv_it_is_the_responsibility_of_members_of_the.json": "毎日のように新しい代名詞や無神経と言われる発言が出てくるような気がします。\n1日おきに。これは私にとっては問題ではありません。私は人々を好きなように呼び、好きなように扱うことができます。\n好きなように呼んで、好きなように扱えばいいと思っています。しかし、どのような言葉が受け入れられるかは\n私の責任ではないのですが...。",
  "data/reddit-changemyview/r/changemyview/comments/pxb2sg/cmv_for_those_who_arent_selling_the_us_should.json": "麻薬をやっただけで何十年も刑務所に入るのはかなりおかしいと思います。私は決してそれを支持しません。\n擁護するわけではありませんが、もし本当に「更生」を目的としているのであれば、それは\n牢屋に入れられているだけでなく、他の方法で薬物を断つ機会を与える方が理にかなっているのでは？\n房の中に座っているだけではなく、他の手段できれいになる機会を与える方が意味があるのではないでしょうか？もっと良い方法があるのではないでしょうか。",
  "data/reddit-changemyview/r/changemyview/comments/pxescs/cmv_abolishing_mental_institutions_in_the_us_was.json": "私の見解を述べる前に、いくつかの背景情報と個人的な逸話を提供することで、私の考えを理解してもらえると思います。\n私の見解を述べる前に、いくつかの背景情報と個人的な逸話を提供することで、この問題に対する私の見解を明確にすることができると思います。\n\n米国の医療制度の問題点については何となく認識していましたが\nアメリカの医療制度の問題点についてはなんとなく知っていましたが、医療制度がどれほど劣悪な扱いを受けているのかについては全く知りませんでした...。",
  "data/reddit-changemyview/r/changemyview/comments/pxl7on/cmv_forcing_a_vegan_diet_on_your_dogs_and_cats_is.json": "犬や猫は植物性の食事でも生きていけますが、健康の基礎となる理想的な栄養状態は\n健康の基礎となる理想的な栄養を摂取することができません。\n\n特に猫は、肉を使わない食事には向いていません。なぜなら、彼らは義務的な肉食動物\n義務的肉食動物、つまり真の肉食動物であるからです。\n見つかった...",
  "data/reddit-changemyview/r/changemyview/comments/pxeibe/cmv_if_a_leader_is_democratically_elected_the.json": "人は政治家とは違うという話をよくしますが、政治家の行動で人を判断してはいけません。\n政治家が何をしているかで人を判断してはいけないということです。しかし、私は\nこれは、責任を回避するための戦術に過ぎないと思います。私は\n実際の投稿では、特定の国を非難するつもりはありませんが...。",
  "data/reddit-changemyview/r/changemyview/comments/pxqkrm/cmv_a_significant_amount_of_redditors_have_no.json": "これは、このウェブサイトに掲載されているあらゆる政治的な投稿について言及しています。並び替え\n上位のコメントを見ると、対立する政党を攻撃するような一般論が複数出てきます。\n批判しています。例えば、先ほどr/all [/r/all]の記事のトップコメントを見ました。\n共和党は人種差別主義者だが、自分たちはそうではないのでそれを否定する」という内容の投稿がありました。",
  "data/reddit-changemyview/r/changemyview/comments/pxv9fs/cmv_the_keyboard_click_sound_on_phones_does.json": "これは多くの携帯電話に搭載されている機能であり、ユーザーエクスペリエンスを向上させるものではありません。\nユーザーエクスペリエンスを向上させるものではありません。何かを入力していれば、入力していることがわかります。画面を見つめていれば\n画面を見つめていれば、入力していないことがわかりますが、音は何の役にも立ちません。\n携帯電話にキーボードが付いていても、キーボードの音ほどは大きくありません。",
  "data/reddit-changemyview/r/changemyview/comments/pxwvvx/cmv_people_who_condemn_other_people_for.json": "編集：私はドイツ出身です。これは一般的に、ほとんどの政党が人権を無視していないことを意味します。\nアメリカのある政党がいかにひどいかを語っても、私の考えを変えることはできないでしょう。\nアメリカのある政党がいかにひどいかを語っても、私の考えは変わりません。\n\n西洋のほとんどの国は民主主義国家であり、その基本原則の一つは多元主義です。\n多元主義です。多元主義...",
  "data/reddit-changemyview/r/changemyview/comments/pxphej/cmv_an_artist_being_a_terrible_person_doesnt_make.json": "私が今までで一番好きなシリーズやストーリーを人に話した後に最初に聞く言葉は\nるろうに剣心）の話をした後に真っ先に言われるのが「そのマンガ家のこと聞いたことある？\n私は文字通り、好きなシリーズだと言っただけです。\n私はおそらく作者と彼の現在の作品や取引を把握していると思います。\n\nそんな人のために、ちょっとしたメモを。",
  "data/reddit-changemyview/r/changemyview/comments/py6h11/cmv_the_posts_in_rgunfights_should_be_blurred.json": "サブはエントリー時にnsfwタグがついていることを実感します。それとは別の話です。\nフロントページをスクロールして、何の警告もなく、これから銃の乱射をグラフィックで表現したビデオが始まるという投稿を見るのとは話が違います。\nそれは、フロントページをスクロールすると、何の警告もなく、銃による暴力や、場合によってはその銃による暴力で実際に死亡する様子をグラフィックで表現したビデオが始まるという記事を見ることとは違う。\nそれは、銃による暴力や、場合によってはその銃による暴力で実際に死んでしまうことを示すグラフィックです。私はこれまで...",
  "data/reddit-changemyview/r/changemyview/comments/pyjita/cmv_there_is_virtually_no_reason_to_have_spaces.json": "そもそも私は、性自認やジェンダーの存在を否定しているわけではありません。しかし\nアイデンティティのために社会的物理的空間を分離する大きな理由はありません。\nアイデンティティのために社会の物理的空間を分ける大きな理由はありません。ほとんどの男性/女性の区分（トイレ、刑務所、ドレッシングルームなど）は、身体の物理的な違いによって分けられています。\n体の違いで分けられているのであって...。",
  "data/reddit-changemyview/r/changemyview/comments/pylydc/cmv_transgender_inclusion_fairness_and_safety.json": "これは、私が個人的に抱いている見解ではなく、スポーツにおけるトランスジェンダーの受け入れに関する広範な調査の結論でもあります。\nスポーツにおけるトランスジェンダーの受け入れについて、Equality in Sportが行った幅広いレビューの結論でもあります。\n[https://equalityinsport.org/docs/300921/Guidance%20for%20Transgender%20Inclusion%20in%20Domestic%20Sport%202021.pdf]\nイギリスのEquality in Sport []が行った、スポーツにおけるトランスジェンダーの受け入れに関する幅広いレビューの結論でもあります。\n\nこれまで長い間...",
  "data/reddit-changemyview/r/changemyview/comments/pyjr7y/cmv_most_back_in_my_day_type_statements_are_worth.json": "欠陥のある見方かもしれませんが、多くの人は独善的な考え方をやめて\n年配の方の方が良いアドバイスをしてくれることが多いのです。\nなぜなら、若い人たちよりも多くの時間をかけて間違いを犯し、それに対処する良い方法を見つけてきたからです。\nなぜなら、若い人たちよりも多くの時間をかけて間違いを犯し、それに対処する良い方法を見つけてきたからです。それは...",
  "data/reddit-changemyview/r/changemyview/comments/pyn1ps/cmv_it_is_not_transphobic_not_to_wish_to_date_a.json": "トランスの人を憎んでいるから付き合いたくない、というのは\nそれは間違っています。これは私の意見なので、私の個人的な見解を説明します。\nこれは私の意見なので私の個人的な見解を説明しますが、実際には私の見解を肯定するか否定するかしたいのです。\nこれは私の意見であり、最終的には私はできるだけ愛情を持って受け入れたいと思っているので、私の見解を確認または否定したいと思っています。私が惹かれるのは...",
  "data/reddit-changemyview/r/changemyview/comments/pyod3b/cmv_the_consensus_that_centrism_is_badwrong_and.json": "この作品は、おそらく長い作品になるでしょう。前置きが長くなってしまいましたが、私は\n自分はPCM用語でいうところの「LibCenter」だと思っています。さらに、私のRedditでの経験は\nRedditでの私の経験は、主に次のようなものです：非政治的なサブ、例えばビデオゲームのサブや\nニッチな話題のサブ、そして左派系のサブなどです。",
  "data/reddit-changemyview/r/changemyview/comments/pyq93v/cmv_netflix_should_bring_back_advanced_dungeons.json": "Netflixは、チャンが「ブラックフェイス」を着用していたため、「Community」のこのエピソードを削除しました。\n\n私のスタンスはあまり複雑ではありません。\n\nまず、ダークエルフは間違いなく人種的ステレオタイプに基づいていることを理解しています。\nそして、このエピソードを削除することに賛成する唯一の論拠は、次のようなものだと思います。\n何かに基づいて何かを支持するということは...。"
}