{
  "data/reddit-ask/r/TooAfraidToAsk/comments/pywouz/why_arent_prisons_more_self_sustainable_so_taxes.json": "ブラックミラーのエピソードで、一日中自転車に乗っていて、国中に電気を供給している人がいました。\n国中に電気を供給している人たちがいました。なぜ囚人たちは\n終身刑の囚人は何の貢献もしていないのに、私たちの税金で食べ物やシェルターに囲まれた生活をすることができます。\n私たちの税金で衣食住を提供することはできないのでしょうか？\n\n編集：これを取らないでください...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pz38ka/why_are_black_americans_called_african_americans.json": "私（白人でイギリス人）にとっては奇妙に思えますが、確かにアメリカで生まれればアメリカ人です。\n曾祖父母がどこから来たかは重要ではないのでは？\n曾祖父母がどこから来たかは関係ないのでは？\n\n私の祖父はドイツ出身ですが、私はアングロ・ジャーマンとは呼ばれませんでした。\n\n私には不思議に思えます。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pz25q2/why_birth_control_method_are_usually_done_with.json": "私は女性で、避妊も問題なくできていますが、友人の多くは\nホルモン系の避妊具で問題を抱えている友人をたくさん見てきました（例：ニキビ、気分、出血など）。\nコンドームを使うのを嫌がる男性の友人もいます。なぜ、男性用の\n男性用のオプションがもっとなかったのか？私が知っている限りでは...",
  "data/reddit-ask/r/AskWomen/comments/pz3cnd/when_you_encounter_males_who_claim_period_pains.json": ".... 単に教育目的で聞いているだけですが。)",
  "data/reddit-ask/r/NoStupidQuestions/comments/pyz8gx/if_i_accidentally_started_a_fire_in_my_hotel_room.json": "これは全くの仮定の話です。までに火が大きくなって制御不能になっていたとします。\n私が服を着たり、毛布を持ったりした時には、火が大きくなっていたとします。私はヒーローでしょうか？\nヒーローなのか、犯罪者なのか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pz4i1t/after_a_totally_normal_interaction_with_coworkers.json": "あまりないですね。私は実際、自分はまあまあの会話力があると思っています。世間話はあまり好きではありませんが\n世間話はあまり好きではありませんが、必要であればできますし、誰かがおしゃべりをしていれば、喜んで話しかけます。\n誰かが話しかけてくれれば喜んで話しますし、社交の場で緊張したり心配したりすることもありません。\n\nしかし、一日の終わりになると、時々、私はある日のことを思い出します。",
  "data/reddit-ask/r/askscience/comments/pz768a/how_does_europa_have_liquid_water.json": "ハビタブルゾーンとは、惑星に液体の水が存在できる唯一の距離だと理解しています。\n惑星に液体の水が存在できる唯一の距離だと理解しています。これ以上近づくと蒸発してしまい、これ以上離れると\n凍ってしまいます。太陽のハビタブルゾーンは0.9〜1.5オー ルですが、木星は太陽から平均5.2オー ル離れています。\n木星は太陽から平均5.2オーレの距離にあり、最も近い距離にある...。",
  "data/reddit-ask/r/askscience/comments/pz84vu/which_of_a_nuclear_explosions_effects_are_unique.json": "放射能や放射性降下物は明らかに放射性燃料源によるものですが、閃光やキノコ雲のようなものはどうでしょうか。\n閃光やキノコ雲のようなものは？例えば、リトルボーイの効果を12,000トンの通常爆弾でどれだけ再現できるでしょうか？\n1万2千トンの通常の爆薬で、リトルボーイの効果をどれだけ再現できるでしょうか？",
  "data/reddit-ask/r/askscience/comments/pz7tna/why_are_galactic_centers_always_occupied_by_black.json": "私は最近、タイソン博士から、すべての銀河（少なくとも大部分は。\n私たちが調べたすべての銀河（少なくとも大部分は、今回の発表では正確ではなかった）の中心には\nその中心にはブラックホールがあるようです。そこで、なぜそうなるのかを考えてみました。\nこの銀河スケールの降着円盤は、私が得た最良のアイデアです。....",
  "data/reddit-ask/r/AskHistorians/comments/pz6bj6/in_egyptian_history_the_reforms_of_muhammad_ali.json": "日本は改革によって、中国を征服し、ロシアや（当初は）米国を打ち負かすことができる世界の大国になった。\n一方、エジプトはイギリスの植民地となり、1952年に独立しました。\nエジプトはイギリスの植民地となり、1952年になってようやく独立しました。なぜでしょう？",
  "data/reddit-ask/r/AskHistorians/comments/pzbppu/what_was_the_state_of_middle_eastern_antisemitism.json": "アラブ世界はユダヤ人にとって楽園のようなもので、シオニストが来るまではすべてが順調だったという話をネットでよく見かけます。\nユダヤ人にとっては楽園のようなもので、シオニストがやってくるまではすべてが順調だった。また、同様に\nユダヤ人活動家からは、二流のディミーの地位やヘブロンの大虐殺のような出来事を引き合いに出して、反発する声が多く聞かれます。\nヘブロンの大虐殺のような出来事を引き合いに出すユダヤ人活動家の反発を目にします。ミズラヒ・ユダヤ人として...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pz8jtn/why_do_men_think_women_constantly_masturbate_with.json": "キュウリを見て「これをおまんこに入れたい」と思ったことがないような。そして私は\nそんな女性には会ったことがありません。これは男性の奇妙な配線フェチの一種なの？それとも\n何世代にもわたって受け継がれてきたものなのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pzdv13/why_is_racism_against_indian_people_so_normalized.json": "いつもインド人を馬鹿にして、「みんな詐欺師だ」とか「みんなテクニカルサポートの仕事をしている」とか言っている人を見かけます。\n詐欺師だ」とか「技術サポートの仕事をしている」などと言って、インド人をバカにしている人をよく見かけます。また\nまた、インド人に対して非常に差別的なジョークを言っている人をよく見かけますが、自分が差別的なことをしているとは思っていません。\n差別的なジョークを言っている人をよく見かけますが、自分が差別的なことをしているとは思いません。彼らはそのことでトラブルになることもありません。....",
  "data/reddit-ask/r/AskHistorians/comments/pzgww5/how_did_white_southerners_in_the_us_view_sexual.json": "たくさんの質問があります。ここでは、それらを分解してみました。\n\n- 奴隷所有者の家庭の他のメンバーは、所有者が奴隷に性的暴行を加えていたことを知っていたでしょうか、あるいは疑っていたでしょうか。\n疑うでしょうか？\n\n- 南部の家長は、自分の息子が奴隷に性的暴行を加えていることを知ったら、どう反応するでしょうか？\n南部の家長はどう反応するでしょうか？\n\n- 他の...",
  "data/reddit-ask/r/AskWomen/comments/pzf5aw/why_did_your_relationship_ended_other_than_being.json": ".",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pzmyv1/do_you_believe_that_healthcare_workers_should_be.json": "医学的な理由でできない場合は例外です。",
  "data/reddit-ask/r/askphilosophy/comments/pzcco6/who_to_read_after_nietzsche.json": "同僚の10代の息子は、臨床的にはうつ病で、スペクトラムもあり、去年はニーチェに夢中になっていました。\n去年はニーチェに夢中になっていました。彼は自然にニーチェの哲学に共感していますが\n彼はニーチェの哲学に自然と共感しますが、それを批判的にとらえるほど成熟していません。彼にとってニーチェは\nは「真実」を理解しており、その「真実」の一部は、「人生は...」です。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pzihdk/how_does_a_morbidly_obese_man_take_care_of.json": "正直なところ、これは私にとって参考になります。私はセルフケアを教えてもらえませんでした。私は自分自身を無視していました。\nそれが原因で自分自身を無視するようになってしまいました。自分を大切にする方法も知りません。\n自分のケアの仕方もわかりません。髪の毛の一部は抜け落ち、他の部分は白髪になっています。\nフォアハンドはひび割れて乾燥しているし、その他の特徴としては...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pzmj1e/if_i_actually_responded_to_one_of_those_daddies.json": "私が何を言っているのかわからないという幸運な人は、一般的に\n肉体的なセックスは、それに含まれません。ヌードは期待されますが、正確な金額を送らなければならないような明確な\n正確な金額を送らなければならないような明確な取引ではありません。プレゼント」は収入になりますか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pzo9ac/why_did_i_dream_nsfw_about_my_mom.json": "さて、昨夜は奇妙な夢を見たんだよ。なぜかというと、そんなことは\n考えたこともありませんでした。これは普通のことなのか、それとも助けが必要なのか？私は19歳です。",
  "data/reddit-ask/r/TrueAskReddit/comments/pzcuuo/what_is_stopping_a_coalition_of_states_ny_cali.json": "赤色の州もかなり入るのではないでしょうか。なぜ\n医療費の議論は、なぜ国の議会に委ねられているのでしょうか？コスト削減の効果は\n半分の州しか参加していないのに、コスト削減効果が十分に得られないのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pzmw1b/why_do_some_men_feel_like_sending_a_dick_pic_will.json": "男性としては、なぜ未承諾のチンポ写真を送るのか理解できません。例えば、何を考えて\n何を考えているのか、それが物事を前進させると本当に思っているのか。(もし\nすでに聞かれていたらごめんなさい)",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pza1rx/how_is_rfragilewhiteredditor_referring_to_white.json": "この記事は間違いなく彼らのサブで終わるでしょうが、正直、もし誰かが\n人の肌の色に基づいた名前を軽蔑的な方法で呼ぶ人がいたら\n敬遠されてしまいます。なぜ肌の色で人を侮辱するのか、そして怒られたからといってもろいと言うのか？\n侮辱するのか？私がおかしいのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/pzel4e/jeanbaptiste_denys_preformed_the_first_human.json": "最初の輸血では動物の血を使っていたので、何か問題があったのではないかと思っていました。\n動物の血を使っていたので、血液型や血液由来の病気のことを知らなかったのです。\n血液型や血液由来の病気を知らなかったのですから。条件や使用された血液を考えると、彼の被験者は中毒のリスクが高いように思えます。\n毒物混入の危険性が高いと思われます。",
  "data/reddit-ask/r/AskHistorians/comments/pzu0z0/in_egypt_napoleon_told_his_army_soldiers_from_the.json": "ナポレオンがこのように言ったとされる時、ギザの3つのピラミッドは4300～4400年前（現代の放射性炭素年代測定による）のものであった。\n4300-4400年前（現代の放射性炭素年代測定法による）であり、ナポレオンの推定値は非常に近い。\nナポレオンの推定値は非常に近いものとなります。また、引用の有無にかかわらず\nこの引用が創作であろうとなかろうと、グーグルでざっと調べてみると...。",
  "data/reddit-ask/r/AskHistorians/comments/pzj00r/were_roman_gladiatorial_fights_ever_worked_like.json": "二人のグラディエーターは、事前に勝敗や大まかな概要を決めておいて、どちらも本気にならないようにするのではないかと想像しています。\n二人の剣闘士は、どちらも大怪我をしたり殺されたりしないように、事前に勝敗と大まかな概要を決めておきたいと思うでしょう。\n正当な試合の場合と同じようにね。その昔、カーニバルのレスラーたちは\nその昔、カーニバルのレスラーが試合をしたのは、彼らがレスリングをするためだと聞いたことがあります...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pzwlys/female_breasts_dont_arouse_me_in_the_least_is.json": "だから胸は、どこに行っても胸は。見るたびに「何だ」と思ってしまうのですが\nどうなの？ただの胸じゃないか」と思ってしまいます。性的な意味で見ているわけでも、興奮しているわけでもありません。\n興奮もしません。今までたくさんの胸を見てきましたが、何が人を性的に興奮させるのか理解できません。\n興奮するのか理解できません。",
  "data/reddit-ask/r/askscience/comments/pzvtrk/does_dna_change_over_time.json": "ヒトのDNAゲノムは年齢とともに変化するのか？つまり、子供のDNAを検査して\nつまり、子供のDNAを検査して、その人が高齢になったときに、同じ人の完全なプロフィールと完全に一致することができるのでしょうか？\nつまり、子供のDNAを検査して、高齢になったときに同じ人と完全に一致することができるのか？",
  "data/reddit-ask/r/askscience/comments/q011ji/about_6_months_ago_hundreds_of_millions_of.json": "フロリダで行われている実験では、オスの蚊だけが繁殖するように設計された蚊が登場します。\n最終的にはメスの蚊がいなくなることを目標に、オスの蚊だけを繁殖させる実験がフロリダで行われています。\n最終的にはメスの蚊がいなくなることを目指しています。\n\n地元の蚊の数をなくすために、最大で10億匹の蚊が放たれます。\n蚊を放ちます。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pzz8c5/going_to_be_a_first_time_father_not_sure_if_we.json": "複雑な心境です。私自身は割礼を受けましたが、今の時代、割礼を受けることは\n必要ないような気がします。本人が望めば、後からでも割礼をすることができると考えています。\n本人が望めばいつでもできると考えています。何かメリット、デメリットはありますか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pzybwj/idk_if_this_is_a_stupid_question_but_where_the.json": "ティーンエイジャーの父親になりたくないし、何かを捕まえたいとも思わないけど、誰もその方法を教えてくれなかったんだ。\nしない方法を教えてくれなかった。",
  "data/reddit-ask/r/AskHistorians/comments/pzuco6/can_anyone_please_explain_joan_of_arc.json": "ジョアンはどうしても納得できないことがあります。彼女は未来を語り、彼女は熟練した\n騎士として、政治家として、当時の法律家と同じくらい有能だった。\n何か腑に落ちません...。\n\nしかし、ソースを見ると同じ話をしているのです。彼女は本当にただの一人の\n最も例外的な人物の一人だったのか...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pzubx9/why_do_so_many_people_like_seinfeld_tv_show_so.json": "私はそれを理解していません。redditではこのシリーズを数少ない実際に面白いシットコムの一つとして崇めている人たちがいるけど\n崇拝していますが、私はこのシリーズの半分以上を見ました。\n私はシーズン1の半分以上を見ていますが、一度も笑っていません。シットコムは私の好みのタイプではありません。\n例えば、「ゴールデン・ガールズ」はほとんどの場面で私を笑わせてくれます。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q01f5u/when_cuddling_how_do_i_prevent_getting_a_boner_is.json": "私[17m]は最近彼女と一緒になったのですが、二人ともこれまでに付き合ったことがないので、ゆっくりと進めています。\n二人ともこれまでに付き合ったことがないので、ゆっくりとしたペースで進んでいます。私たちは映画を見て、一緒に寝ることにしました。\n金曜日に映画を見て、一緒に寝ることにしました。私にとって、彼女は今まで見た中で最も美しい人です。\n僕が今まで見た中で一番美しい人です。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pzw8az/why_is_it_necessary_to_celebrate_your_birthdays.json": "今日は私の誕生日です。私は20歳です。祝う気分にはなれません。なんだか\n祝っても意味がないような気がします。誕生日は、私に\n自分が年を取ったことを思い出すだけです。私はもう子供ではありません。私は20代の最悪の時期にいます。\n20代というのは、一生懸命働かなければならない時期で、大人になり始める時期なのです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q07hf9/if_a_man_uses_protection_but_the_woman_still_gets.json": "母親は、男性が子供の人生にお金を払い、その一部になることを望んでいると仮定します。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q09isz/my_friend_is_17_and_is_dating_a_26_year_old_man.json": "彼らは1年以上も付き合っていたので、当時、彼女は15歳、彼は24歳でした。二人はゲームで出会い\n彼らはゲームで出会い、遠距離恋愛をしていて、実際に会ったことはありませんが\nフェイスタイム、メール、電話をいつもしています。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q07n1r/whats_the_best_way_to_legally_and_peacefully_to.json": "郊外の素敵な地域にあるタウンハウスを借りています。ただ一つ問題がある。\n高額な家賃に加えて、不幸なことに、隣に不気味で嫌な奴が住んでいることだ。\n不幸なことに、隣には不気味で厄介なクソ野郎が住んでいるのだ。このシワシワのチンポは、忙しくないときは\n酷いソフトロックのクソ音楽をかけている暇があったら（忍び寄ったり見つめたりしながら...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q0bk07/do_people_actually_like_the_taste_of_pussy.json": "オマンコの味を本当に楽しんでいる人はいるのだろうか、それともみんな口をそろえて\nパートナーが聞きたいと思っていることを言っているだけなのか？私は、正直なところ、私には\n正直に答えてくれないような気がします。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q0ay50/is_it_socially_acceptable_for_me_to_dress_up_as.json": "誓って、これは冗談の投稿ではありません。私と私の友人は、ハロウィンでハンバーガーとドナルド・マクドナルドになります。\nロナルド・マクドナルドになります。私たちの学校はハロウィンには営業していません、なぜなら日曜日だからです。\nしかし、校長先生は前日の金曜日に仮装することを許可してくれました。\n私たちの計画は、その日の放課後にマクドナルドまで歩いて行き、...",
  "data/reddit-ask/r/NoStupidQuestions/comments/q0c1j7/the_alphabet_song_rhymesrightright.json": "自分がおかしくなりそうです。家族と口論になって、みんなが言うには\nアルファベットの歌は韻を踏むものではないと。なんだと！？\n\nABCDEF G\n\nHIJKLMNO P\n\nQRSTU V\n\nWXY AND Z",
  "data/reddit-ask/r/AskHistorians/comments/q0f6rb/was_new_york_in_the_70s_as_sleazy_and_corrupt_as.json": "この質問で誰かを怒らせるつもりは全くありません。私はアメリカ人ではありません。\n私はアメリカ人ではありませんが、「タクシードライバー」は私の大好きな映画です。\nはどこまで正確なのかと思っていました。\nニューヨークが犯罪にまみれた薄汚い、道徳的に嫌な場所であるという描写がどの程度正確なのか気になりました。私は\nさらに興味があるのは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q04qqi/what_do_you_guys_think_are_the_most_unmoanable.json": "ランダムなシャワー思考🤷♀️。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q0gwda/why_is_nestle_still_allowed_to_publicly_operate.json": "ネスレが非人道的なことをたくさんしてきたように。私がタイトルで述べたことは\nネスレは、裁判所もこのことを知っています。\nネスレはいまだに、自分たちがしてきた悪いことに対する注意をほとんど払わずに、公的に運営しています。\nネスレはいまだに公的に運営されています。\n\n私はここで止めておきます、この記事がNo.1を破って欲しくないので...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q0jjtw/what_is_the_psychological_term_for_this.json": "ソーシャルメディアやRedditではもう何度も見たことがあります。例えば、あなたが\n午後4時に医者の予約が入っていて、現在は午前10時です。あなたには6時間の時間があります。\n時間もあります。それなのに、その時間に何もしないでいると\n何もしないのは、イベントが始まるからです。私はこれまで、人々が...",
  "data/reddit-ask/r/NoStupidQuestions/comments/q0g5o6/why_do_we_work_so_much_still_even_though_modern.json": "朝6時に起きて、8時に仕事に行き、18時に帰宅して、夕食を作り、ジムに行って\nその後、1時間ほどの自由時間があります。これを週に5日繰り返す。\n1年に46〜47週。\n\nまるで、働くために生きているかのようです。昔は働かないと生きていけませんでした。\n今日の世界では、その必要はありません。私たちは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q0n2h2/married_redditors_how_often_do_you_and_your.json": "質問にあるように...。推測するに、私の答えは多分次のようなものでしょう。\n年に10回程度では足りません。また、妻が楽しんでいるからではなく、義務として行われているように感じます。\n妻が楽しんでいるからではなく",
  "data/reddit-ask/r/NoStupidQuestions/comments/q0lu3v/am_i_the_only_one_who_doesnt_really_care_if_im.json": "自分が生きている間に人に良い影響を与えたいと思わないわけではありません。I\nただ、「レガシー（遺産）」などにはあまり関心がありません。",
  "data/reddit-ask/r/AskHistorians/comments/q0g4c9/how_did_byzantine_emperors_ie_alexios_komnenos.json": "翻訳者を使ったのか、それとも警備員が簡単な命令のためにギリシャ語で特定の言葉を覚えたのか。\n簡単なコマンド\n\n私自身の質問に答えているようですが、私は後者だと思います。\nアレクシオスの時代には、衛兵はアングロサクソンとスカンジナビア人で構成されていたからです。\n4人から5人にするよりも簡単なのではないでしょうか。",
  "data/reddit-ask/r/askscience/comments/q0q9kd/can_an_individuals_blood_carry_a_cure_for_a_virus.json": "コビドの生存者の血漿が感染症対策になるという実験結果を読んだことがあります。\n拡散防止に役立つとの実験結果を読んだことがあります。しかし、一人の人間の血液が感染の鍵を握るという可能性に、どれだけの真実性があるのだろうか。\n映画のように、一人の人間の血液がウィルスを蔓延させる鍵になるという可能性が\n映画",
  "data/reddit-ask/r/AskHistorians/comments/q0l96q/how_were_longships_actually_useable_how_did_they.json": "北欧の長船は、レイドやトレードには向いていないようです。\nした。私がこれまで見てきたレクリエーションでは、船首から船尾まで実質的に人で埋め尽くされていないと作動しませんでした。\n漕ぐ人で船首から船尾まで埋め尽くさないと動きません。\n船首から船尾まで人が溢れていないと動かないし、船尾には商品やお金を入れる場所がない。では、どこに保管していたのか...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q0w3ca/why_are_gold_diggers_frowned_upon_for_being_in_it.json": "これは、典型的な金食い虫、ホットガールのシナリオに基づいています。",
  "data/reddit-ask/r/askphilosophy/comments/q0gkgm/what_are_some_good_videos_to_show_1718_year_olds.json": "哲学的な内容の20分前後のビデオを探しています。\n特に、政治哲学、心の形而上学、美学などです。\n新しいアイデアや破壊的なアイデアであれば何でも構いません。カリキュラムに関連している必要はありません。\nドキュメンタリーやインタビューがいいですね...。",
  "data/reddit-ask/r/AskHistorians/comments/q0v9qy/being_sent_to_work_in_a_roman_mill_was_up_there.json": "メッセニオという人物は、プラウトゥスの『メナクミ』に登場する。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q104tf/doesnt_releasing_felonies_and_giving_them.json": "大多数の人にとって、就職と住居の確保は、遠隔地で快適に暮らすための\n少なくともアメリカでは、法を守って快適な生活を送るためには、雇用と住居の確保が欠かせません。\nアメリカでは 刑期を終えた重罪犯が釈放され、保護観察やその他の釈放条件に従った場合、なぜ\n刑期を終えた重罪犯が釈放され、保護観察やその他の釈放条件を遵守した場合、なぜ...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q11nbh/why_are_indian_dudes_so_horny.json": "インドで女性がビーチに行こうとすると、男性が取り囲んでいるというようなビデオをたくさん見ました。\n男たちが彼女を取り囲んで写真を撮っていたりします。ほとんどの女性が、インド人男性から性的なDMを受け取っているような気がします。\nほとんどの女性が、インド人男性から性的なDMを受け取っているような気がします。それを揶揄した巨大なミームも存在します。\nこの状況を揶揄する巨大なミームフォーマットもありますが、私の質問は...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q11l70/why_do_averagely_sized_dildos_hurt_going_in_your.json": "タイトルの通りです。私のパートナーと私は寝室で新しいことを試してみました。\n彼女は私の後ろにチンポを突っ込もうとしましたが、あまりにも不快だったので、私は大きなウンコについて考えるようになりました。\nでかいウンコのことを考えるようになって...うん。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q14x2t/how_difficult_is_finding_the_vaginal_opening.json": "私は処女とセックスしたいと思っていますが、なぜか膣の開口部が見つかりません。\n暗闇の中、ペニスだけで開口部を見つけるのは難しいのではないでしょうか（No\n彼女は不潔だと思っているので、手は使わないでください。また、彼女は宣教師の立場を望んでいます）。)\nこのゲームをハードにプレイしながら、どうやってその入り口を見つけるのか...。",
  "data/reddit-ask/r/AskHistorians/comments/q1523d/if_the_anglo_saxons_largely_came_to_britain_from.json": "デンマーク人はアングロサクソン人が去った後にデンマークに移住したのか、それともかつては両方が同時に住んでいたが、アングロサクソン人だけが移住を決めたのか。\nデンマーク人はアングロサクソンが去った後にデンマークに移住したのか、それともかつては両方が同時に住んでいたが、アングロサクソンだけがイギリスに移住することにしたのか\nイギリスに移住することになったのでしょうか？",
  "data/reddit-ask/r/askscience/comments/q14tfc/how_sure_are_we_that_nuclear_fusion_reactors_are.json": "地球上の研究室では常に核融合が起こっていることを知っています。\n投入した以上のエネルギーを取り出すことができる核融合炉を作ろうとしているグループがいくつかあります。\n投入したエネルギーよりも多くのエネルギーを取り出すことができる核融合炉を作ろうとしているグループがいくつかあります。\n\n疑問なのは、このようなネット・ポジティブな核融合反応の試みが実際に可能であると、どの程度確信できるのかということです。\n実際に可能なのかということです...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q0yjb7/is_it_strange_to_laugh_at_your_own_thoughts.json": "車を運転していると、よくコメディー・スキットのことを考えて笑うことがあります。\n僕はコメディの天才だからね。でも、これをルームメイトの前でもやってしまうと\nでも、ルームメイトの前でも同じことをしていて、時々、頭がおかしいんじゃないかという目で見られます。誰かが黙ってそこに座っているのを見るのは奇妙なことだとは思いますが\n他の人が黙って座っているのを見て笑うのは変だとは思いますが...。",
  "data/reddit-ask/r/AskHistorians/comments/q0zt7a/ive_heard_that_north_american_natives_didnt_have.json": "最初の感謝祭の話は疑わしいとは思いますが、それでもある程度の歴史的事実に基づいています。\n歴史的な事実に基づいています。ワンパノアグ族の原住民が、ピューリタンにトウモロコシやカボチャなどの新世界の作物の育て方を教えたこと。\nワンパノアグ族の原住民が、ピューリタンにトウモロコシやカボチャなどの新世界の作物の育て方を教えたこと。\n\nしかし、北アメリカの原住民は狩猟採集をしていたとも聞いています。\nそうではなくて...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q19e4y/is_anybodys_facebook_not_working.json": "なぜかFacebookは工事中のようで行けません。\n工事中のようです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q17jgp/how_do_i_tell_a_girl_her_vagina_stinks.json": "これは正直なところ、疑問です。彼女をバカにしているわけでも何でもないんです。私たちは\n隠れてセックスしていたら、臭いの匂いがひどくて、つい\n寝返りを打ってピストンをやめました。私が寝返りを打ったとき、布団が私の上に降りてきました。I\nこれは、布団の中でおならをした後、布団を上げるのと同じように...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q1dyxc/do_you_guys_sometimes_close_reddit_only_to_open.json": "編集：私だけではないことがわかってよかったです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q18emo/if_i_were_to_pee_on_my_fence_would_my_neighbors.json": "私はまだやらないと思いますが、うまくいくでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/q1k69g/the_revolutions_of_1848_swept_all_across_europe.json": "1789年のフランス革命のようなヨーロッパの古い重要な革命は、国から国へと広がらなかった。\nこのように国から国へと広がっていくことはありませんでした。何が違ったのでしょうか？逆に言えば\n逆に、ロシアやスペインのような少数の地域が影響を受けなかったのはなぜでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q1ol0i/why_are_women_so_surprised_that_penises_can.json": "ガールフレンドが僕のボールで遊んでいて、ボールが完全な球体ではなく、卵のようだと驚いていました。\n完全な球体ではなく、卵のようだと驚いていました。その後、彼女はそれらを入れ替えようとしました（左から右に）。\n切り替えようとして（左から右へ、ちょっと怖かった）、気が狂ったようになった。この機会に、私は彼女に\n私はこの機会に、彼女に思いつく限りの素晴らしいペニスとボールの操作を見せてあげました...。",
  "data/reddit-ask/r/AskWomen/comments/q1eakk/for_those_of_you_who_like_your_job_what_do_you_do.json": "このために学位を取得したのですか？",
  "data/reddit-ask/r/AskHistorians/comments/q1tgk9/how_did_romania_remain_a_latin_country_despite.json": "私はラテンアメリカ出身ですが、ルーマニア人と話していると、彼らは常にラテン系と認識しています。\n興味深いことに、私はその言語のいくつかの単語しか理解できません。\n興味深いと感じています。私はいくつかの単語しか理解できませんが、良いラテン語の影響はどのようにして生まれたのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q1zbxg/am_i_a_bad_friend_if_i_sometimes_get_annoyed_with.json": "うまく説明できませんので、ご容赦ください。英語は第一言語ではありません。\n私の第一言語ではありません。落ち込むことが悪いことだと言っているわけではありません。I\n私はこの友人が精神的な健康に関わるすべての苦労や戦いをサポートしています。\n彼女が必要な助けを得ていることを嬉しく思っています....",
  "data/reddit-ask/r/AskHistorians/comments/q20e02/im_a_medieval_townsperson_living_in_britain_lets.json": "仮に私が男性で、貧乏ではないが金持ちには程遠いと仮定します。\n平均的な町民を想像しています。もし違いがあるならば、私には妻と子供がいるかもしれません。\n違いがあるとすれば。\n\nこのような人が、このような「小旅行」に何を求めているのか知りたいですね。\nこのような人が、このような「小旅行」に何を必要とするのか知りたい。\n\nこの旅行に必要なものは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q1ysml/why_do_people_always_ask_on_this_sub_are_men_or.json": "この質問が多すぎると思うのは私だけでしょうか？\n\n人間はパイナップルが好きか？好きな人間もいれば嫌いな人間もいる。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q24b3e/am_i_weird_for_being_obsessed_with_having_sex.json": "私は昔から性欲の強い女性だったと思います。結婚する前は毎日オナニーをしていました。\n結婚する前は毎日オナニーしていました。夫とはセックスをとても楽しんでいます。今、私が夢中になっているのは\n夫との性交に夢中になっています。私の口は文字通り彼のペニスを求めています。I\n私の口で彼の喜びをコントロールするのが大好きです。ジーズ...ただ...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q29gcw/does_anyone_actually_like_large_tomato_slices_on.json": "水のような食感と味は、私にはとても魅力的ではなく、味を台無しにしてしまいます。\n味が台無しです。誰かが実際に食べたいと思っているのか、それともただ単にサンドイッチに入っているように見えるのか？\n食べるのが好きな人はいますか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/q289xj/am_i_wrong_or_does_the_entire_concept_of.json": "理論的には、サブは人気のない意見を投稿するためのものですが、誰もが\n賛成の意見にはupvoteするので、上位の投稿は常に人気のある意見になります。\n人気のない意見ではなく、人気のある意見が上位を占めます。\n\nまた、そのサブの投稿が「扇情的」という理由で削除されたという話もよく聞きます。\n「扇動的」という理由で削除されたという話もよく聞きますが...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q25wzv/what_is_it_with_the_catholic_church_and_diddling.json": "もし、他のグループや職業がこのようなことを大量に行っていたら、それは\n何十年も前に禁止されていたでしょう。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q24o2m/is_it_ok_for_a_straight_guy_to_be_into_womens.json": "ソーシャルメディアを見ていると、女性の服や美意識が気になって仕方ありません。\n楽しんでいるようです。男の人がそれに夢中になるのは普通のことだと思います。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q2aksz/how_do_incredibly_obese_people_afford_to_eat_that.json": "私はバランスのとれた食事を全くしていませんが、高カロリーの食品でも\nそんなに太るほど買えません。体重増加のために作られた食品を食べない限り\n太るために作られた食品を食べない限り、多くの人がこれを買えないのは理解できません。これが正しいセンスだとは思いませんが\nしかし、私は誤って...ということがないようにしたいのです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q28o8o/why_do_gender_pronouns_matter.json": "私はどうしてもジェンダー・フルイドを理解できません。\n\n私にとっては、その背後にある哲学は、それが戦おうとするジェンダーの固定観念を強化するものです。\n対抗しようとしています。\n\n例えば、男性が女性的な行動を好むとします。なぜ彼が「ジェンダーニュートラル」や女性的なものに切り替えることがそんなに重要なのでしょうか？\nジェンダーニュートラル」や「女性的な代名詞」に切り替えることがなぜ重要なのでしょうか？\n\nそれは、「男性は...」という考えを強化するものではないでしょうか。",
  "data/reddit-ask/r/AskHistorians/comments/q25lwl/is_it_coincidence_that_the_former_axis_powers.json": "これは長いショットで、かなりニッチな質問かもしれませんが、私はここに歴史的なリンクがあるかどうか興味がありました。\n歴史的なつながりがあるのか気になります。\n\n基本的に、万年筆の世界（/r/fountainpensをチェックして、私が話していることを知ってください。\n基本的に、万年筆の世界（/r/fountainpensをチェックしてみてください。\nドイツ（ペリカン、...）。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q22esa/why_doesnt_youtube_have_mute_function_to_hide_the.json": "他のソーシャルメディアがそうであるように、誰かのコンテンツが気に入らない場合は\nその人のコンテンツを永遠に隠してしまう「ミュート」機能があってもいいと思います。\nいつまでも。\n\nYouTubeがそれをしない理由があるのでしょうか？あるいは、すでにしていて私が気づいていないのかもしれません。\nもしそうであれば、その方法を教えてください。",
  "data/reddit-ask/r/askphilosophy/comments/q1w21l/books_that_are_named_like_being_and_time.json": "私は、ハイデガーの『存在と時間』を参照するために「名詞と名詞」という命名規則を使っている哲学書の愚かで小さなリストを作成しています。\nハイデガーの『存在と時間』への言及として「名詞と名詞」という命名規則を使っている哲学書のリストを作成しています。\n誰かがもっと知っているのではないかと思っていました。\n\n私が今持っているもの\n\n * 怒りと時間』（ピーター・スローテルダイク著\n * サルトルの『存在と無』（原題：Being and Nothingness\n * Being and...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q1tzem/how_can_i_stop_myself_from_growing_up_like_the.json": "私は父が大嫌いで、毎日、自分が成長して父のようになってしまうのではないかと怯えています。\n恋人や人々の精神的・肉体的負担になることは絶対に避けたいです。\n恋人や大切な人の精神的負担にはなりたくありません。",
  "data/reddit-ask/r/AskWomen/comments/q290vf/how_attractive_do_you_think_you_are.json": "他のスレッドで同じような投稿を読んで、女性の視点からの意見を聞いてみたいと思いました。\n女性の意見も聞いてみたいと思いました。",
  "data/reddit-ask/r/AskHistorians/comments/q26ac0/how_accurate_is_the_idea_that_the_spanish.json": "私の学校の歴史の教科書では、スペイン帝国はフランスやイギリスに比べて最も残忍な植民地支配国として描かれていました。\n私の学校の歴史教科書では、スペイン帝国は、フランスやイギリスに比べて、植民地支配の中で最も残忍な帝国として描かれていました。その考えはもっともらしいのですが\nしかし、アメリカや英国全体では、反カソリックや反スペインがあったことを知っています。\n過去には反カトリック、反スペインの問題がありました。だからこそ、私は...",
  "data/reddit-ask/r/NoStupidQuestions/comments/q26nfp/am_i_really_bisexual_if_ive_never_technically.json": "私は最近、男性だけでなく女性にも惹かれることを知りました。\nこのことから、私はバイセクシャルだと思っていました。8年間連れ添ってきた夫は、そのことをとても気に入っています。\n応援してくれていて、想像できるように励ましてもくれます。(目を丸くして)\n何人かの女性に性的に惹かれる以外に、私には本当に...",
  "data/reddit-ask/r/askscience/comments/q2i2q2/askscience_ama_series_i_am_a_medicinal_chemist.json": "Hi Reddit! 私の名前はクリストファー・マッカーディです。\n痛みや薬物乱用を治療するための薬剤の設計、合成、開発を研究しています。\n痛みや薬物乱用を治療するための薬剤の設計、合成、開発を行っています。私の研究は\n新規シグマ受容体リガンドの研究は、薬の開発につながる可能性を秘めています...",
  "data/reddit-ask/r/AskHistorians/comments/q2i4e7/how_was_the_relationship_of_the_original_hippies.json": "友達と60年代の話をしていたら、誰かが「ヒッピーのカウンターカルチャーは今では存在しない。\nカウンターカルチャーは現代ではありえない。\nと言っていました。しかし、60年代にもテレビは存在していましたし、インターネットとそれほど変わらないと思います。\nインターネットとそれほど変わらなかったと思います。しかし、誰かが正しく指摘したのは...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q2aogi/how_do_i_gently_tell_the_girl_ive_been_seeing.json": "ここ数週間付き合っている女の子がいるんだけど、本当に好きなんだ。感じています。\n多くの点で一致していると感じています（同じユーモアのセンス、同じ趣味、同じ大学のコースなど）。\nしかし、彼女にはどうしても克服できない匂いの問題があります。彼女は\n今日、彼女が来て、少しの間抱き合った後、私たちはずっとイチャイチャしていました...",
  "data/reddit-ask/r/AskWomen/comments/q2iv2y/how_to_command_respect_at_work_as_a_feminine.json": "男性優位の環境で成功するためには、女性的な外見や物腰の柔らかさ、優しさが邪魔になると思いますか？\n男性優位の環境で成功するのに邪魔だと思いますか？人目を引く存在になったり\n能力があるにもかかわらず、年上の男性同僚から相手にされなくなることを避けるにはどうしたらいいですか？",
  "data/reddit-ask/r/AskHistorians/comments/q2gg7o/why_did_southeast_asia_indianize_and_not_sinicize.json": "東南アジアは、東アジア（中国）と南アジアの中間に位置することから、その名が付けられました。\n東南アジアという名前は、東アジア（中国）と南アジア（インド）の中間に位置することから名付けられました。ベトナムを除き、SEAは歴史的に「インド空間」に位置してきました。\nインドの勢力圏」と呼ばれている。\n\nカンボジアのような国でも、インドの王子が結婚したという建国神話があります。\n現地のお姫様と結婚したという建国神話があります。\n\nもちろん...。",
  "data/reddit-ask/r/AskHistorians/comments/q2hz8l/is_the_claims_in_the_wikipedia_article_on_timothy.json": "私は脚本家です（趣味レベルではありますが）。このYouTubeを見つけました。\n人気チャンネル「Sam O'nella Academy」のビデオを見つけました。\n奇妙で不穏な事実や人々についてのビデオを制作している人気チャンネル「Sam O nella Academy」のビデオを見つけました。\nロード・ティモシー・デクスター（Lord Timothy Dexter）は、アメリカで自営業を営んでいましたが、彼は...",
  "data/reddit-ask/r/NoStupidQuestions/comments/q2i9m4/why_do_some_people_believe_that_italians_arent.json": "人種は社会的構成要素だから」なんて言わないでください。\n質問の答えになっていません。正確な理由を知りたいのです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q2qjsn/do_women_hate_having_sex_with_their_husbands.json": "性について知っているのは、ソーシャルメディアやテレビや映画や\n私が見たところ、女性はセックスが嫌いなようです。自分にとっては重荷で、パートナーのために我慢するもののように\nパートナーのために我慢しているような。\n\nパートナーに何かをしてもらうためにセックスを我慢する女性のように。\nそれはつまり...",
  "data/reddit-ask/r/AskHistorians/comments/q2ls1a/in_the_ip_man_movies_chinese_people_bow_to_each.json": "また、これはカンフーのコミュニティに特有のものなのか、それとも\n中国人はどこでもこのようにお辞儀をするのでしょうか？\n例えば、敬意を表して人にお辞儀をしたり、挨拶をしたり、禅（チャン）のコミュニティでお辞儀をしたり、などです。\n\n何か情報があれば教えてください。",
  "data/reddit-ask/r/askscience/comments/q2ttc1/why_are_there_varying_cooking_safety_temperatures.json": "それとも、死滅温度の異なる様々な種類のバクテリアが、異なる種類の生肉で増殖するのでしょうか？\n異なる種類の生肉で増殖するのか？",
  "data/reddit-ask/r/AskHistorians/comments/q2um9e/shinto_is_a_collection_of_japanese_folklore.json": "具体的に言うと、神道は伝統的に非常に多様な信仰体系ですが、国家神道は統一された信仰体系で\nが、国家神道は日本中どこでも同じような統一された信仰体系であったということです。\n統一された信仰体系でした。\n\n一律であるためには、国家が何を神道とみなしているかを明確にしなければなりません。\n神道の伝統、...。",
  "data/reddit-ask/r/AskHistorians/comments/q2vma1/during_world_war_i_on_the_western_front_trench.json": "ざっと検索すると、第一次世界大戦の考古学に関する情報にたどり着きますが、私は\n私は第一次世界大戦中の考古学に興味があります。に関するいくつかの記事を除いては\nフランシス・バックリー（イギリスの軍人から考古学者に転身）や、兵士に記録させたドイツ軍の司令官の記事を除いては\n兵士に先史時代の墓地を記録させたという記事を除いては・・・。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q2r3jn/what_do_adults_do_at_work.json": "こんなくだらない質問をして嫌われないようにしたいのですが、私はちょうど\n卒業後、初めてフルタイムのデスクワークを始めました。\n何年も学生生活を送り、様々な小売店やフードサービスの仕事をしてきましたが、自分の時間を何に使ったらいいのかわかりません。\n自分の時間をどう使えばいいのかわかりません。この仕事は、1分1秒を争うような初めての仕事です...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q2effc/why_are_cannabis_users_get_angry_and_salty_when.json": "小さな小さな研究論文が発表されるたびに、長期的にはマイナスの影響があると\n大麻の長期的な悪影響を証明する小さな小さな研究論文が発表されると、必ずと言っていいほど、それを受け入れることを拒否するコメントが寄せられます。\n受け入れようとしないコメントがたくさんあります。これらの研究には、いつも怒りや攻撃的な反応が寄せられる。\n\nなぜそんなことになるんだ？依存症？彼らは大麻ビジネスの株を持っているのか？",
  "data/reddit-ask/r/AskHistorians/comments/q2oxhc/want_to_be_the_height_of_fashion_askhistorians_is.json": "tl;dr: ここをクリックしてチェックしてください。\n[https://www.teepublic.com/stores/shopraskhistorians]\n\n何が起こっているのか\n\n私たちは、ユーザーがコミュニティのテーマに沿ったグッズを手に入れることができる新しいプログラムを試験的に開始するために、管理者を支援することに同意しました。\nコミュニティをテーマにしたグッズを手に入れることができるようにする新しいプログラムの試験運用を管理者が支援することに合意しました。私たちはAskHistoriansのグッズを提供しました。\nの年末賞の賞品として提供してきました。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q2zsto/should_we_all_just_delete_facebook_and_instagram.json": "内部告発の疑惑を踏まえて？最善の策は何か？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q2kwn5/woman_does_height_really_matter_in_a_relationship.json": "確かに僕は身長が低いので（5フィート5インチ）、これまでにも「G1を取るのは難しい」と言われてきました。\n身長のせいで彼女を作るのは難しいと言われてきました。正直なところ、相手の女性が自分より背が高いかどうかは気にしません。\n正直なところ、相手の女性が僕より背が高いかどうかは気にしていません。また、私が背の高い女性とデートしたり、一緒にいたいと思うのは変でしょうか？\nまた、背の高い女性とデートしたり、一緒にいたいと思うのは変でしょうか？",
  "data/reddit-ask/r/askscience/comments/q36m27/askscience_ama_series_im_diego_pol_a.json": "こんにちは！古生物学者であり、ナショナルジオグラフィックの探検家でもあるディエゴ・ポルです。\n古生物学者のディエゴ・ポルです。ここ数年、私は南米の南端にあるパタゴニアで恐竜の調査と発見を行っています。\n南米の南端に位置するパタゴニアで恐竜を発見しています。私は\nエジディオ・フェルリオ大学の科学部の部長を務めています...",
  "data/reddit-ask/r/NoStupidQuestions/comments/q39zqa/what_do_they_do_with_foreskin.json": "具体的には、割礼後の包皮はどうするのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/q34spg/why_did_european_emperors_adopt_the_title_caesar.json": "皇帝を名乗るヨーロッパの君主は皆、ローマ帝国の後継者であると主張しているようです。\nローマの後継者である皇帝を名乗るヨーロッパの君主は皆、「シーザー」という称号とその派生語を選びました。\nオーストリア・ハンガリー・ドイツでは「カイザー」、ロシア・ブルガリアでは「ツァーリ」、オスマントルコでは「カイザー・イ・ラム」というように。\nオスマン帝国ではカイザー・イ・ラムと呼ばれています。\n\nまた、「アウグストゥス」という称号は、「カエサル」よりも地位が高かったのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/q33w6f/what_drugs_wouldve_been_available_to_jesus_of.json": "ヒッピーについての最近の投稿に気を取られ、リンクされている記事の一つである\nヒッピーを初期のキリスト教徒と比較した司教の記事を引用していました。\nその中で、紀元1世紀頃のレバントでの薬物使用について考えさせられました。\n1世紀頃のレバントでの薬物使用について考えてみました。\n\n議論のために、仮にその比較が...",
  "data/reddit-ask/r/AskHistorians/comments/q35fvn/were_there_any_atheist_societies_in_the_past.json": "過去の様々な文明や社会では、組織的な宗教や、少なくとも超自然的な存在が信じられてきました。\n組織的な宗教を信じ、少なくとも超自然的な力の存在を信じてきました。この信念は\nこの信仰は、マヤ、アステカ、シュメール、インディアンなどの複雑な社会にも共有されています。\nこの信念は、マヤ、アステカ、スーメリア、インド、ギリシャ、中国などの複雑な社会と、それほど複雑でない社会の両方で共有されています。これらの社会は...",
  "data/reddit-ask/r/AskHistorians/comments/q3bowq/sparta_wasnt_that_effective_in_war_were_there_any.json": "紹介すると、スパルタは実はちょっとダサい。のBrett Devereaux氏は、この点について\nUnmitigated PedantryのBrett Devereauxがこのシリーズで良い仕事をしています。\n[https://acoup.blog/2019/08/16/collections-this-isnt-sparta-part-i-spartan-school/],\n要約すると、彼らは子供たちを残酷なまでに教え込み、93%の子供たちを...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q3667j/how_to_get_rid_of_a_crush_thats_ruining_my.json": "僕が好きな女の子は2つ上のHSで、僕は彼女と付き合える可能性は非常に低いと思っています。\n思うのですが、彼女に会うと一日が明るくなり、会わないと超落ち込みます。\n落ち込みます。彼女が話しかけてくると、とても気分が高揚して、もっと頑張ろうという気持ちになります。\n頑張ろうという気持ちになります。\n\n彼女は1週間の休暇に入ったばかりで、学校には来ませんが...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q3drhk/if_a_squirrel_finds_another_squirrels_nut_stash.json": "それともカップルで行くのかな？🐿",
  "data/reddit-ask/r/askscience/comments/q389fv/what_happened_to_the_milwaukee_protocol_for_rabies.json": "最近、イリノイ州でPEPを拒否した男性が狂犬病で死亡したという話を聞いて\n2004年に狂犬病から生還した最初の人間とされた少女をめぐる大げさな報道を思い出しました。\n2004年に狂犬病から生還した最初の人間とされた少女の話を思い出した。その後、多くの絶望的なケースでMPが試されたことを思い出します。\nその後、多くの絶望的なケースでMPが試みられたが、成功しなかったことを思い出す...。",
  "data/reddit-ask/r/AskHistorians/comments/q3gfyl/at_the_start_cheers_is_about_a_group_of_people_in.json": "仕事が終わった後、1日4～5時間もバーで過ごすなんて考えられません。このようなライフスタイルは\n1980年代後半には、このようなライフスタイルが一般的だったのでしょうか？当時の \"リアル \"なバーカルチャーとはどのようなものだったのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q3jfrw/do_girls_ever_just_fiddle_down_there.json": "誤解のないように言っておきます。私が言っているのは、自慰行為のことではありません。\n飽きたり、疲れたりして、ベッドに横になって、遅くなって、何かを見ていたりして。\n(youtubeやnetflixなど）を見ていて、快感を意図せずに自分の体を触っているような状態のことです。\n快楽の",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q3hnmg/do_people_really_daydream_about_sex_at_work.json": "毎日、普通に仕事をしているだけなのに、すっかり変態になった気分です。\nのものになっています。もちろん、私はダウンタイムの多い仕事をしているので、消防士が空想にふけるとは思っていませんが。\n消防士が白昼夢を見るとは思っていませんが。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q3niwm/how_can_i_stop_my_bf_from_peeing_on_floor.json": "彼は太っていて、おしっこをするときは座っています。縁と便座の間の隙間からオシッコが飛び散ります。\n縁と便座の間の隙間から飛び散ります。これを止めるにはどうしたらいいですか？本人は\n床におしっこをするのを止める方法がわからないと言っています。\n他に方法はないのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q3l1ge/why_do_so_many_people_believe_in_stupid.json": "地球は平らだとか、月面着陸は嘘だとか、そういった陰謀論のことです。\n地球は平らだとか、月面着陸は偽物だとか、我々はシミュレーションの中に生きているとか、そういう陰謀論のことです。\n刺激的だからです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q3qr1e/longtime_guy_friend_sent_me_a_dick_picwhy_am_i_so.json": "簡単な背景を説明すると...この人とは11年くらいの付き合いになります。私たちは結婚している間はあまり話しませんでした。\n私が結婚している間はあまり話しませんでしたが、私は新たに離婚しました（祝福しないでくださ\nお祝いしないでください。私はとてもショックを受けています）。彼は別の州にいます。\n私は彼に全く魅力を感じていませんし、私はそうではないと言っています...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q3ro2z/is_it_unethical_morally_wrong_for_a_workplace_to.json": "年に一度の定期検診の一環として、私の知らないうちに妊娠検査が行われていました。\n知らなかった。他の同僚は誰も気にしていないようで、それほど大きな問題ではありませんでした。\nでも、なんだか変な気分でした。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q36qve/what_is_it_like_to_fall_in_love_and_to_be_in_love.json": "こんにちは、私は20代後半（もうすぐ30歳）の女性ですが、これまで自分をオープンにしてデートや恋愛をしたことがありません。\n私は20代後半（もうすぐ30歳）の女性です。\n\n誰かと恋に落ちることや、完全に深く恋に落ちることがどんな感じなのか、全くわかりません。\n誰かと恋に落ちることや、完全に、そして深く恋に落ちることがどういうことなのかわからないのです。\n\n何年にもわたって、私は友人たちが幸せになったり、不幸になったりするのを見てきました。\n不幸な...",
  "data/reddit-ask/r/askscience/comments/q3iaek/do_people_with_better_memory_havemaintain_more.json": "私はあるオンライン講義（運良くyoutubeで見つけました）で、脳は常に変化していることを知りました。\n脳は常に変化している。新しいシナプスができたり、古いシナプスが消えたり。\n\n神経科医は、私たちが他のことでは良くなっても、何かのことではどうしても悪くなってしまうのは、このためだと言っていました。\n別のことが上手になると何かが下手になるのはこのためだと。しかし、彼はまた...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q3saji/how_is_pediphillia_a_mental_disorder_but.json": "この質問は、非常に気持ち悪いというか、非常に同族嫌悪的に聞こえます。私は\nそのどちらでもない。ただ、興味があるだけです。\n\nもし小児性愛が精神障害とみなされるなら（みなされるべきですが）、なぜ同性愛は精神障害ではないのでしょうか？\n同性愛は精神疾患ではないのでしょうか？(そうすべきだとは言いませんが）ただ、その定義がとても似ているという事実だけです。\n定義が非常に似ているという事実だけで...",
  "data/reddit-ask/r/askscience/comments/q3vf3x/askscience_ama_series_im_a.json": "最近、内部告発者が、フェイスブックが自社の製品が有害であることを知っていたことを暴露しました。\nしかし、学術研究者たちは、ソーシャルメディアが青少年に与える影響を何年も前から研究しています。\nしかし、学術研究者は何年も前からソーシャルメディアが青少年に与える影響を研究しています。私は国連大学チャペル校で心理学と神経科学の助教授をしています。\n私はUNC-Chapel Hillの心理学と神経科学の助教授として、ソーシャル・メディアの影響について教えています。",
  "data/reddit-ask/r/AskWomen/comments/q3hfth/what_is_your_opinion_on_squid_game_on_netflix.json": "Netflixで配信されている韓国のサバイバルドラマのテレビシリーズです。\n\nあなたはどう思いますか？\n\n英語の吹き替えではなく、韓国語の吹き替え版をどう思いますか？\nと間違った翻訳をしていませんか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q3y4fw/will_my_vagina_ever_go_back_to_normal.json": "セックスの記事を増やしてしまって申し訳ないのですが、この質問を誰にすればいいのか、本当にわかりません。\nこの質問を誰にしたらいいのかわかりません。\n\n編集：私は女性に答えてもらいたいし、非常に教養のある男性に答えてもらいたいと思っています。これは私にとって重大なことです。\n私にとっては深刻な問題です。\n\n先週、私と彼氏がセックスをしていて、彼は普通サイズのディルドを私の中に入れました。\n私の中に...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q3u72v/is_it_just_me_or_is_answering_the_question_what.json": "タイトルにあるように、皆さんは答えにくいと思いますか？私はいろいろなことをして過ごしていますが\nいろいろなことをして過ごしていますが、どうしても答えられないことがあります。私の「趣味」はどれも\n私の「趣味」は、普通のこと、誰もがやっていることにしか思えません。皆さんは\n皆さんも同じように悩んでいますか？それとも、皆さんはいつも完璧な...",
  "data/reddit-ask/r/AskHistorians/comments/q3yhhl/were_candles_a_purely_cottage_industry_in_the.json": "帝政ロシアの主な輸出品が蜜蝋だったように、帝政ロシアの主な輸出品が蜜蝋だったという話を読みました。\nロシアの主要な輸出品であった。\n\n誰がこの生の蝋を買って、蝋燭を製造していたのか。ロウソクは、一家が自分で買うほど安かったのでしょうか？\n一家が毎月または毎年必要なものを購入できるほど安かったのか、それとも非常に貴重で農民の一家が......。\n貴重なものだったのか、それとも農民の家族が...",
  "data/reddit-ask/r/AskHistorians/comments/q41swl/how_did_the_indonesian_islands_go_from_hinduisim.json": "ある情報筋は、それはトレーダーだったと言い、またある情報筋は、それはまた侵略されたと言う。ヒンドゥー教徒は\nヒンドゥー教徒はバリに逃げたそうですが、なぜ彼らを殺してしまわないのでしょうか？なぜ何百年も滞在させたのか？\n何百年も滞在させたのか？しかし、仏教は小さいながらも重要な役割を果たしています。\nタイの北部には仏教寺院がいくつかあり、そこには...",
  "data/reddit-ask/r/AskHistorians/comments/q40asf/how_did_red_lentil_soup_become_a_staple_in.json": "私の母（そしてその前の祖母）は、赤レンズ豆とハムホックを使って、冬に温まるスープを作ります。\nこのレシピに似た、赤レンズ豆とハムホックを使った暖かい冬のスープを作ります。\n[https://www.gct.com/community/the-inside-scoop/the-buzz/scottish-red-lentil-soup]。\nこの記事を信じるならば、スコットランドでのオンライン投票でもトップになっています。\n気に入っているようです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q3zwib/if_you_stick_a_vacuum_in_your_vagina_and_turn_the.json": "今日、家の掃除をしていて気になったことがあります。",
  "data/reddit-ask/r/AskHistorians/comments/q435xk/a_friend_of_mine_just_told_me_that_until_the.json": "友人の話によると、MLKが誕生するまでは、黒人男性が白人女性とセックスしているところを発見されると、逮捕される可能性があったそうです。\n黒人男性が白人女性とセックスしているところを発見されたら、レイプ罪で逮捕されて死刑になるかもしれない、と。\nほとんどのヘイトクライムは、実際には関係を持ったことに対する反応に過ぎないのだと。\n彼の話によると、これはマルコムXとボクサーの...にも起こったことだそうです。",
  "data/reddit-ask/r/AskHistorians/comments/q42oyc/prof_edward_j_watts_argues_that_eastern_roman.json": "タイム誌に掲載されたこのエッセイでは\n[https://time.com/6101964/fabricated-fall-rome-lessons-history/], Edward J.\nWatts（カリフォルニア大学サンディエゴ校の歴史学教授）はこう言っています。\n\n> 今では小学生から学者まで、西ローマ帝国は476年に滅亡したと習っているが、5...\n> ローマ帝国は476年に滅亡したと小学生から学者までが知っているが、5...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q43co5/why_do_americans_accept_their_terrible_working.json": "私はイギリス出身ですが、私は常に年間最低25日の有給休暇を取る権利があります。\n病気になっても給料がもらえますし、NHSも存在します。\n私は、人々がこれらを要求することを望んでいないように見えることが理解できません。\nこれは産休とかそういうことを深く考える前の話です。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q3zyep/how_the_fuck_do_we_shave_our_balls_without.json": "電気カミソリも試してみましたが、怖くて使えませんでした。\n古典的なカミソリで試してみましたが、泡の多い部分を通過させるのは不可能です。\n古典的なカミソリで試してみましたが、ペニスのすぐ下のようなひだの多い部分には通せません。\n助けてください。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q3x7iw/why_do_i_overshare_so_much_when_talking_to_people.json": "私はいつも後から「なんでそんなことを言ったんだろう」と考えてしまい、ただただ\n理解できないのかな？😂",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q4a0ol/why_do_guys_send_unsolicited_dick_pics.json": "一度も「好きな子が好きそうだな」と思ったことはありません。\nと思ったことはない。と思ったことは一度もありません。なぜ他の男たちはそれを送るのか？私には理解できません。\n理解できません。\n\n編集：私は男ですが、ありがたいことにこのような写真を送られることはありません。私が尋ねているのは\nこのようなことが起こると、私たちの印象が悪くなるからです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q477fb/has_anyone_noticed_there_seem_to_be_more.json": "なんだか頭がおかしくなりそうな気がします。私が住んでいるところでは、もっとたくさんの人が来ています。\n私の家だけではありません。3人の友人が「ブヨやコバエは残念だけど、どこから来るのかわからないよ」というようなことを\nブヨやコバエは残念だけど、どこから来るのかわからないよ」というようなことを言っていました。\nと言われました。もしかしたら、これはただの...",
  "data/reddit-ask/r/AskHistorians/comments/q3yu2l/the_bible_is_often_though_of_as_the_endallbeall.json": "私はキリスト教徒ですが、キリスト教の最大の問題点は、聖書が恣意的な表現の集まりのように見えることです。\n聖書は、人間によって書かれた恣意的に選択されたテキストの集合体のようです。\n聖書は人間によって書かれた恣意的なテキストの集合体のようです。\nキリスト教にとって重要なことは、作者が書いたものが「直接...」であるという事実のためです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q47f7i/why_do_we_have_special_biohazard_waste_bins_in.json": "27歳の女性である私には理解できないことです。生理中の血液は\n病気になりにくいとか？",
  "data/reddit-ask/r/AskHistorians/comments/q46wi5/if_i_was_a_villager_woman_of_1650s_england_and_i.json": "ニール・ゲイマンとテリー・プラチェットの『Good Omens』を再読しての質問です。\n....had was been materially helped by Agnes's petticoats,\nその中に50ポンドの火薬と30ポンドの釘を隠していた。\n釘を隠していました。\n\n私は芸術的ライセンスをよく知っていますが、私はそれを...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q4hpn8/im_not_an_anti_vaxxer_but_do_think_people_should.json": "私はモデナの予防接種を受けていますが、3月に初めて受けた時にも受けていました。I\n私は非常に科学を支持しています。多くの誤った情報が、人々にワクチンを受けないように導いていることは理解しています。\nしかし、私はそれが彼らの選択であると信じています。\nそれは彼らの体であり、彼らの選択であるべきです。私はこれを信じています...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q4kvt4/do_you_masturbate_everyday.json": "毎日オナニーしている人はいますか？もしそうなら、なぜ毎日しているのか、飽きないのか。\n飽きないでやっていますか？私は毎日する傾向がありますが、最近、私の性欲が低下していると感じています。\n私は毎日していますが、最近、性欲がとても低下していると感じています。\nしてしまうことがあります。\n\nこれは誰にでも起こることですか？",
  "data/reddit-ask/r/askscience/comments/q4m4fq/where_does_the_human_body_gets_chlorine_for.json": "確かに、食卓用の塩には質量比でかなりの量の塩素が含まれていますね。\n(60%). しかし、毎日1〜2gの塩を食べなければならないわけではありません。初期の人類は\n初期の人類は、何千年も前まで塩を簡単に手に入れることはできなかったでしょう。\n\nでは、消化に必要なクロリド酸はどこから得られるのでしょうか？私は純粋に...",
  "data/reddit-ask/r/askscience/comments/q4mh45/why_does_mars_have_any_surface_features_given.json": "今日、9歳の娘がこの質問をしました。ググってみると、火星には\n火星にはプレートテクトニクスは絶対にない。惑星の表面が非常に滑らかになるために、すべてのものが腐食されるのではないか？\n惑星の表面はとても滑らかになるのでは？しかし、火星には谷や渓谷、山があることはわかっています。\n谷や峡谷、山があることがわかっています。それは小惑星の衝突によるものでしょうか？\n\nすみません、もしこれが...",
  "data/reddit-ask/r/AskHistorians/comments/q4kbwb/why_were_the_indoiranians_not_interested_much_in.json": "私はインド人なので、この議論のインド側の事情をよく知っています。ここでの「大きな疑問」の1つは\nここでの「大きな疑問」の一つは、地球上で最も古い文明の一つであり、科学のように扱われてきたにもかかわらず、なぜ歴史を記録したり\n地球上で最も古い文明の一つであり、文法や言語学などの分野で比較的高度な技術を持っていたにもかかわらず\n地球上で最も古い文明の一つであり、文法や言語学などの分野で比較的高度な技術を持っていたにもかかわらず",
  "data/reddit-ask/r/AskHistorians/comments/q499gm/malcolm_x_was_in_norfolk_prison_colony_where_a.json": "マルコムXの自叙伝からの抜粋。\"ノーフォーク・プリズン・コロニーの図書館は、その優れた特徴のひとつだった。\n卓越した特徴のひとつである。パークハーストという大富豪が自分の図書館をそこに遺した。\n彼はおそらく更生プログラムに興味を持っていたのだろう。\n彼は歴史と宗教に興味があった。何千冊もの彼の...",
  "data/reddit-ask/r/NoStupidQuestions/comments/q4qjua/why_are_there_condoms_in_different_flavours.json": "コンドームは避妊具ではないのですか？女性の膣などの中に入るもので、口ではありません。\n口ではなく、女性の膣やその他の場所に入ります。そこには味蕾がありません。\n\nフレーバー付きのコンドームはどのように機能するのでしょうか？私には信じられないことばかりです。",
  "data/reddit-ask/r/AskHistorians/comments/q4ulp4/how_did_the_soviets_react_to_american_advances_in.json": "そこで、インテル4004のCPUについて読んでいると[https://en.wikipedia.org/wiki/Intel_4004]。\nを読んでいて、これが気になりました。\n\n> フェデリコ・ファギンは、それまで誰も成し遂げられなかったことを達成しました。\n> フェデリコ・ファギンは、これまで誰も成し得なかったことを成し遂げました。\n\nこれは非常に大きな飛躍だと思います。これは大きな飛躍だと思います！そして、これによって...",
  "data/reddit-ask/r/AskHistorians/comments/q4vtie/did_stalin_pledge_to_send_soviet_troops_to.json": "こんにちは。\n\n最近、ロビン・D・G・ケリーの「ハンマーと鍬」という本を読み始めました。\n[https://en.wikipedia.org/wiki/Hammer_and_Hoe] ロビン・D・G・ケリーの本を読み始めました。\nもっと読みたいと思った言葉がありました。その言葉をグーグルで検索したところ、古い...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q4y8rs/why_do_we_only_hear_of_priests_messing_with_small.json": "ググれば出てきますが、そこに私の言いたいことの一部があります。それを解明しようとすると\n2つの可能性を考えてみました。\n\n 1. 1.神職は比例してより多くの同性愛者を惹きつける。\n 2. 2.メディアの偏向、おそらくより多くの注目を集めているから\n\nあなたはどう思いますか？",
  "data/reddit-ask/r/AskHistorians/comments/q4n64g/announcing_the_best_of_september_award_winners.json": "今年もベストアンサーを発表する時がやってきました。\n9月の受賞者\n[https://www.reddit.com/r/AskHistorians/comments/q0hdfe/best_of_september_voting_thread/]!\n\n今月の「フレアチョイス賞」は、/u/Trevor_Culleyさんです。\nアレクサンダー大王の...",
  "data/reddit-ask/r/AskHistorians/comments/q523qx/how_do_historians_feel_about_paradox_interactive.json": "何が正しくて何が間違っているのか、どのような物語や神話を永続させているのか、大戦略の舞台として歴史を利用していることについてどう思うか。\n彼らが歴史を大戦略の舞台として利用していることについて、どのように感じていますか？",
  "data/reddit-ask/r/AskHistorians/comments/q5659t/ancient_celts_allegedly_feared_that_the_sky_would.json": "空が落ちてくるという恐怖は、アステリックス[]のコミックに出てくるギャグだと思っていました。\nアステリックス[https://en.wikipedia.org/wiki/Asterix]のコミックのギャグだと思っていました。しかし、その後、「Kings\nand Generals [https://www.youtube.com/channel/UCMmaBzfCCwZ2KqaBJjkj0fw]のビデオを見ました。\nアレクサンダー大王の征服-バルカンキャンペーン335...",
  "data/reddit-ask/r/AskHistorians/comments/q56o89/as_a_result_of_911_was_osama_bin_ladens_aim_to.json": "この20年間、私が聞いてきた話では、OBLは次のような共通のストーリーがあります。\nOBLは、ソ連がアフガニスタンで行ったのと同じように、米国が中東での戦争に巻き込まれ、米国を破綻させることを意図していた。\nソ連がアフガニスタンで行ったのと同じように、アメリカが中東での戦争に巻き込まれて破産し、中東の専制君主を倒してサルビア人を導入する余地を残すことを意図していたというのです。\nその結果、中東の専制君主を倒し、サラフィスト政権を樹立することができる。\n\nしかし...。",
  "data/reddit-ask/r/AskWomen/comments/q51ddt/have_you_experienced_obstetric_violence_whats.json": "産科暴力について学んだ後、これがこんなにも隠された流行であることに衝撃を受けました。\n疫病であることに衝撃を受けました 女性として恐ろしくなりました。フェミニストとして、女性の権利と尊厳が守られるために、活動が必要だと感じています。\nフェミニストとして、医療現場や妊娠・出産時に女性の権利や尊厳が尊重されるための活動が必要だと感じています。\nフェミニストとして、女性の権利と尊厳が医療現場や妊娠・出産時に尊重されるための活動が必要だと感じています。私が興味を持っているのは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q511uw/is_it_wrong_to_feel_like_im_not_worthy_my_partner.json": "私には彼氏がいて、彼はとても優しくて親切なのですが、私は彼にとって不十分だと感じています。\n感じています。彼はそうは思っていないようですが、私にとっては、私はもっと良い存在であるべきだと感じています。\n彼はそうは思っていないようですが、私には、もっといい人がいるはずなのに、なぜかそうではないような気がします。そんな自分が嫌でたまりません。\n今まで何かで自分を嫌いになったことはありませんでした。私たちはまだ付き合って1年しか経っていないのに...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q54hlb/what_do_i_do_if_i_know_she_is_faking_her_orgasm.json": "彼女の笑顔を見ればわかる。そして、その後は何も話さない。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q4t7ib/how_do_you_bring_your_own_lunch_to_work_without.json": "話は変わりますが、私は来週から初めての事務職に就くことになりました。\n今までの仕事は、買ってくるか自分で作るかのレストランで働いてきました。\n自分で作ることができました。\n\n外出の手間を省くためにお弁当を持って行きたいと思っているのですが\n初日にお弁当を持って出勤する自分を想像しています。",
  "data/reddit-ask/r/AskHistorians/comments/q57gxk/addiction_to_opium_was_widespread_in_china_in_the.json": "私の知識不足で、100年以上経ってもアヘン問題が残っていたのか、それとも\nあるいは、中国がアヘンの「流行」を見事に根絶したのか。\nそうであれば、どのようにしたのでしょうか。",
  "data/reddit-ask/r/AskHistorians/comments/q5hjz7/in_1966_only_42_of_americans_wanted_to_keep_the.json": "出典はこちら。ギャラップ社\n[https://news.gallup.com/poll/221030/death-penalty-support-lowest-1972.aspx]\n\n1900年半ば以降、死刑制度を廃止しようとする一般的な傾向に反しているため、奇妙に思えます。\n1900年代半ば以降の死刑廃止の一般的な傾向とは逆になっているからです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q50qfr/is_a_45_minute_drive_too_much_for_an_11hr_pay.json": "45分ほど離れたところで別の仕事のオファーを受けました（今の職場は通勤時間が5分程度）。\nしかし、今までの給料に加えて11ドルの追加料金が発生します。\n\n編集部：皆さんのご意見にとても感謝しています。妻と私は以前、この話をしました。\nしかし、私はこの話を聞いたときに冷めてしまったんです...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q5j5d8/at_what_age_do_we_accept_that_a_persons_lack_of.json": "とても奇妙なティーンエイジャーとの交流の後、このことを考えていました。\n\n時々、子供や10代の若者は何も知らないことがあります。\n\nただ単に頭が良くないだけで、それが一生続くこともあります。\n続くこともあります。\n\nこれが見られるラインはどこにあるのだろう？\n\n私は、13歳か14歳のその人が、ただの...と思っています。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q5o6ft/why_does_my_crotch_throb_when_i_think_about.json": "警告：これは読むと非常に困ったことになります。視聴者の判断をお願いします。これは\n唯一の警告です。\n\n私はめったにないことですが、私は恐ろしい混乱したものに興奮します（本当の興奮ではなく、むしろ股間の反応のようです）。\n興奮することはほとんどありません。興奮するのはその物自体ではない。\nそれは、本当にめちゃくちゃで、恐ろしくて...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q5qr86/am_i_supposed_to_brush_my_tongue.json": "私はそれについて聞いたことがありませんでしたが、最近、あなたがどのようにすべきかという記事を見ました。\nと書いてあるのを見て、興味を持ちました。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q5rix6/why_doesnt_pregnancy_and_parenthood_absolutely.json": "私は人を辱めたり、子供を持たないように説得するつもりはありません。\n\nこの世に人間を送り出すことを考えたとき、純粋にその理由が思い浮かばないのです。\nその理由が思い浮かばないのです。愛のため？自分の子供を愛さない人もいるし、子供が親を愛さないこともある。\n親を愛さない子供もいる。そういうこともあるだろう。充実感のため？可能性としては...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q5tleh/did_i_get_raped.json": "このことは、私にとって、心を開いて書くことがとても難しいことです。\nをご覧ください。とても長くなってしまいましたが、すべてのアドバイスに感謝しています。\n\n私の背景を少し説明します。私は若い頃、性的虐待を受けていました。\n16歳の時の最初の性的接触は暴行でした。\n\n1年前、私の直前に...",
  "data/reddit-ask/r/AskHistorians/comments/q5tl1n/gustavus_iv_of_sweden_apparently_had_a_deranged.json": "N.A.M.ロジャーの『The Command of the Ocean』のナポレオン戦争の項を読んでいた。\n553ページで彼はこう言っています。\n\n> 英国の唯一の同盟国は、不安定なスウェーデンのグスタフ4世であった。\n> 彼の世界観は『黙示録』の狂った解釈に基づいていた。\n\nこの主張は、...",
  "data/reddit-ask/r/askscience/comments/q5vmde/can_you_be_dyslexic_in_one_language_and_not_be_in.json": "私はディスレクシアと診断されたことはありませんが、自分ではそうではないかと思っています。\n私は4つの言語を話すことができます。私は4つの言語を話すことができます。英語は私の母国語ではありませんが\n英語は母国語ではありませんが、問題を抱えたことはありません。でも、母国語の長い単語を発音するのは難しいんです。\n母国語の長い単語を発音するのが難しく、それが...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q5tro8/what_did_ancient_philosophers_mathematicians.json": "彼らは自分の考えや発見に対して報酬を得ていたのだろうか？乙女たちが手渡しでブドウを食べさせてくれたのか\n乙女が葡萄を食べさせてくれたのか？彼らはどこで寝ているのか？どうやって\nどうやってお金を払っていたのか？\n\n基本的にはタイトル通りです。",
  "data/reddit-ask/r/askphilosophy/comments/q5jex9/if_i_cease_to_exist_someday_then_what_i_have_to.json": "思い出を持ち帰ることができず、自分が存在していたことを認識できないまま粉々になってしまうのであれば\n自分が存在していたことを認識できないまま粉々になってしまうとしたら、それは何を意味するのでしょうか。\nその意味は？なぜ何かをするのか？\n\n私たちが自分自身を破壊しないのは、私たちが自分自身でいられる唯一のチャンスがあるからです。\nあるいは、何かを期待して...",
  "data/reddit-ask/r/AskHistorians/comments/q5zxzw/marijuana_became_illegal_in_the_us_due_to.json": "1930年代、デュポン家では怪しげなビジネスが行われていた。\nウィリアム・ランドルフ・ハースト、ハリー・アンスリンガーの3人です。彼らはプロパガンダを作った\n彼らは大麻を違法にして、大麻が彼らのビジネスに対抗できないようにするためのプロパガンダを作ったのです。\n彼らのビジネスに対抗できないようにするためにプロパガンダを作ったのです。彼らは成功し、大麻は...",
  "data/reddit-ask/r/AskHistorians/comments/q5w29o/danes_saxons_pictsits_all_confusing_me.json": "だから、実際の歴史に基づいて サクソン人はもともとイングランドに住んでいた人たちです。\nそれとも他の人から奪ったのでしょうか？その後、デーン人\n(バイキングとは？)がサクソン人からイングランドを奪うためにイングランドに侵入しました。デーン人は\nはバイキングですよね？、いや、バイキングは北欧人ですよね？\n\nというわけで...。",
  "data/reddit-ask/r/AskHistorians/comments/q61gl8/it_is_said_that_oxford_university_is_older_than.json": "この答えを見つけました。\nhttps://www.reddit.com/r/AskHistorians/comments/5d8r64/oxford_university_was_established_c_1096_how_have\n\nしかし、店員の教育が必要なこと以外には必ずしも詳しく書かれていません。他に何を\n勉強したりマスターしたりできるのでしょうか？鍛冶屋のような腕利きのギルドマンもいたのでしょうか？\n鍛冶屋のような熟練したギルドマンもいたのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q5y6r4/how_do_people_not_know_what_is_rape.json": "私はちょうど、暴力的で攻撃的な性的出会いの心を痛めた投稿を読んでいました。\n暴力的で攻撃的な性的接触があり、投稿者はレイプされたのかと問いかけていました。これ以上彼女にトラウマを与えたくないので、リンクは貼りませんが\nこれ以上、彼女にトラウマを与えたくないので、リンクは貼りませんが、私は疑問に思いました。\n\n私は地獄のようにダウンブレートされることを期待していますが、なぜ多くの女性は、私の...",
  "data/reddit-ask/r/AskHistorians/comments/q5ph6j/what_happened_to_the_japanese_leftist_movements.json": "日本では60年代後半から70年代にかけて、大学生による大規模な左翼的抗議運動がありました。\n暴力に発展することもありました。これらの出来事は、当時の日本の文化やメディアに忘れがたい足跡を残しました。\n当時の日本の文化やメディアに大きな影響を与えました。\n\nしかし今、日本の若者は本当に無関心で、同じ情熱やエネルギーを持っていないように見えます。\n同じ情熱やエネルギーを持っているようには見えませんが...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q66mao/do_any_dudes_actually_pee_using_the_flaps_in_your.json": "フラップを使っている人はいますか？私はいつも下に引っ張る方が簡単だと思っています。ボクサーでも\nボクサーでもフラップは使いやすいですが、特にタイティーホワイトでは\nガントレットを通過しなければなりません。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q66ude/how_do_i_cope_with_the_fact_that_im_only_average.json": "文脈から 世界的なサイバーセキュリティの専門家になって、権威あるハッキング大会で国際的に活躍したい。\n世界的なサイバーセキュリティの専門家になり、権威あるハッキング大会で国際的に活躍したいと思っています。私は19歳です。\nの私には、仕事に対する意欲や良心の呵責は全くありませんが、これは大変なことです。\nなぜなら、この分野の仕事で素晴らしい成果を上げている人たちは皆、...",
  "data/reddit-ask/r/NoStupidQuestions/comments/q691u6/does_anyone_else_listen_to_one_song_over_and_over.json": "タイトル",
  "data/reddit-ask/r/NoStupidQuestions/comments/q6aftf/are_americans_often_rude_against_foreigners_in.json": "ビデオゲームが好きなのは、ネイティブと一緒に英語の練習ができるからです。彼らは\n最初は親切にしてくれますが、ホンジュラスから来たと言うと、次のような質問をしてきます。\nのような質問をしてきます。\n\n * ホンジュラスには車があるのか、それとも馬に乗るのか？\n * テレビは何か知ってる？\n *基本的なニーズのない生活は...",
  "data/reddit-ask/r/NoStupidQuestions/comments/q68ahe/how_can_i_tell_if_someone_has_stdsherpes_before_i.json": "なぜなら、真実ではない人もいるからです。どうやって見分けるの？",
  "data/reddit-ask/r/askscience/comments/q6h6ch/askscience_ama_series_were_scientists_and.json": "トロイア型小惑星は、太陽系と同じくらい古い岩石質の世界であり、その軌道を共有する\n木星と同じ軌道で太陽の周りを回っている。外惑星を形成した原始物質の残骸と考えられています。\n外惑星を形成した原始的な物質の残骸と考えられています。10月16日には、NASAのルーシー\nミッションは10月16日にフロリダ州ケープカナベラルから打ち上げられる予定です。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q6bbz2/when_talking_about_racial_problems_in_america_why.json": "若い黒人男性としては、白人が自分たちの仕事をしているように感じるのは腹立たしいことです。\n白人がNワードを使っているとか、白人に子供がいるとか、人種問題に関しては些細なことに\n白人がNワードを使うとか、白人がドレッドヘアにするとか、白人が黒人の絵文字を使うとか\n白人がNワードを使っているとか、白人がドレッドをしているとか、白人が黒人の絵文字を使っているとか。これらは本当の問題ではありません....",
  "data/reddit-ask/r/AskHistorians/comments/q6krmc/meta_as_much_as_ive_enjoyed_raskhistorians_for.json": "教える側としては、理解することの方が重要であるという原則があります。\n場合によっては、単純化しすぎたり、他のヒューリスティックな方法を用いたりすることが\n新しいことを学ぶ際には、単純化しすぎたり、ヒューリスティックな表現が良いきっかけになることがあります。また、学習が進むにつれて\n正確さの修正がより重要になってきます。\n\n以来...",
  "data/reddit-ask/r/AskWomen/comments/q6hy0x/how_do_you_deal_with_friends_who_make_slysubtle.json": "女性の皆さん、このようなタイプの友人と付き合ったことはありますか？怪しい発言をしたり、ちょっとしたことであなたを貶めたりするような\n怪しい発言をしたり、ちょっとしたことであなたを貶めたり。あなたは彼らにどのように対応しますか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q6m0zd/is_it_weird_to_want_to_get_oral_but_not_give_oral.json": "オーラルを受けたいけど、受けてもいいのかわからない。\n私には全くホットではありません。私はアファブです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q6ocr9/does_getting_a_boner_make_a_sound.json": "私は耳が聞こえないので、このような馬鹿げた質問をしているのですが、人々は私をからかって\n「勃起の音が聞こえない」とからかわれました。\n\nしかし、彼らが私をからかっているだけなのか、それとも勃起が実際に音を出すのか、私にはわかりません。\n音がするのかはわかりません。微妙な音なのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q6j1m8/why_are_most_guys_so_quite_during_sex.json": "どうやら、私が単独で聴覚的な体験を提供することを期待されているようです。\n一人での聴覚体験を期待されているようです。私は、より多くのことを促すために、あまり努力していません。パートナーに話したこともあります。\n試行錯誤しています。つまり、彼は長持ちさせることに集中しているのだろうか？音を出さなければ\n音を出さなければ、質問されます。\n\n何が起こっているかの洞察？",
  "data/reddit-ask/r/askscience/comments/q6ht1t/isnt_co2_emission_reduction_without_carbon.json": "つまり、私の理解では、空気中のCO2含有量が地球の温度の変化率を決定するだけです。\n地球の温度の変化率を決定するだけです。現在、地球上の太陽放射によるエネルギー余剰は\n現在、地球上の太陽放射によるエネルギーの余剰は約1W/m²であり、これが温暖化につながります。\n仮にCO2の排出量を瞬時にゼロにすると...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q6iyao/after_ricecooking_some_rice_ive_noticed_this.json": "ググっても名前も出てこないからね。そして、いくら米を洗っても\nお米をいくら洗っても少しは残っています。\n\n炊飯器のスプーンにぶら下がっているものを撮影しました。\n\nhttps://i.imgur.com/jFaNKuq.jpg\n\n私は自炊をするのは初めてです。\n\n悩むべきでしょうか？低価格の商品を買ってしまったのかな...？",
  "data/reddit-ask/r/askscience/comments/q6n8y2/what_would_happen_if_we_removed_too_much_co2_from.json": "地球は非常に脆弱な生態系であり、すべてはバランスが重要です。ある\n惑星規模の比較的小さな出来事が、数年に渡って私たちの気候を大きく変えてしまうことがあります。\n数え切れないほどの年月をかけて気候を大きく変えることができます。地球温暖化がそれを物語っています。\n\n現在、二酸化炭素の回収は可能ですが、現時点では...",
  "data/reddit-ask/r/NoStupidQuestions/comments/q6rqq0/do_people_not_keep_their_pizza_receipt.json": "ドミノで働いています。\n\n男性からの電話。昨日、ピザを注文したのですが、変な臭いがしました。\n\n私：マネージャーに寄りかかって、男性はピザが変なにおいがすると言っていましたが、作り直してあげましょうか？\n\nマネージャー：レシートを持っているかどうか聞いてください。\n\n私：尋ねる\n\n男：ARE YOU KIDDING? 誰がピザのレシートを持っているんだ！？\n\nDude lost his marbles over a question.",
  "data/reddit-ask/r/NoStupidQuestions/comments/q6swdh/if_the_usa_has_freedom_of_religion_then_why_cant.json": "憲法修正第1条に信教の自由があり、親が子供を強制的に中学に行かせるとしたら\n親が子供に教会に行くことを強要し、子供がそれを嫌がった場合、親は修正第一条の権利を否定したとして起訴される可能性があります。\n憲法修正第1条の権利を否定したことになりますか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q6aloa/are_online_dating_apps_truly_that_bad_for_guys.json": "私はかなり長い間、デートゲームから離れていましたが、現在の私の人生で起こっているあることに基づいて\n現在の生活の中で、あることが起きれば、またデートの場に戻ってくるかもしれません。\nしれません。\n\n私はインターネットのあらゆる場所で、絶対にひどい経験をしたという話をたくさん読みました。\n酷い経験（主に、マッチしない、偽物の...",
  "data/reddit-ask/r/AskHistorians/comments/q6wvua/some_ancient_roman_and_greek_statues_portray_men.json": "この質問をした像は、ファルネーゼのヘラクレスです。\n[https://museum.classics.cam.ac.uk/sites/museum.classics.cam.ac.uk/files/casts/277_0.jpg]です。\nそのような体を手に入れるのは、今日のフィットネスや栄養に関する知識をもってしても難しいでしょう。\nこのような体は、フィットネスや栄養に関する今日の知識をもってしても手に入れるのは難しいでしょう。ディスカスに描かれているような体は...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q6rh87/im_old_44_and_new_to_reddit.json": "?4r]の意味を教えてください。申し訳ありません。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q6xs3e/why_do_parents_who_kick_their_children_out_the.json": "親としての責任を最小限にしたいのであれば、いっそのこと何もしなければいいのに。\nなくてもいいのでは？彼らはその責任の見返りに何を求めたのだろうか？",
  "data/reddit-ask/r/AskWomen/comments/q6tqh2/what_did_you_think_only_rich_people_could_have_or.json": "\"普通 \"の定義は、自分が住んでいる地域や国の \"普通 \"であって、世界全体の \"普通 \"を決めるものではありません。\n世界全体の普通を決めるのではありません。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q7477a/my_girlfriend_has_stopped_shaving_her_armpits_and.json": "これはアドバイスを求めるには奇妙なことであり、私はそれについてあまりにも有害であることを避けようとはしていません。\nただ、他の人の意見を聞きたいだけなんです。\n\n\n\n私の好みは他の人がどうするかの最終的な言葉ではないと分かっていますが、一応背景として\n背景として、私は個人的にきれいに剃った髪に惹かれます。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q7037u/how_do_adults_make_friends.json": "明日は私の誕生日ですが、人生について少し考えさせられました。I\n周りを見渡してみると、この何年かの間、引っ越しや結婚を繰り返してきた中で\n周りを見渡してみると、この何年かの間、引っ越したり、結婚したりして、自分の友達を一人も作っていないことに気がつきました。皆、私の夫のような人たちだと思います。\n夫の部下のようなものだと思います。私は彼らを愛していますが、誤解を恐れずに言えば、私はちょっと...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q78nfi/am_i_racist_for_saying_that_people_like_cleopatra.json": "確かに、アフリカにあるのはわかりますが、アフリカに住んでいる人がいきなり黒人になるような\nアフリカに住んでいる人が突然黒人になるような、アフリカ全土が黒人であるかのように振る舞っています。\nクレオパトラは、ヘレニズム／ギリシャの白金の最後のファロアーでした。ハンニバルは\nフェネキア人の植民地であり国家であったカルタゴ出身です。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q77hlb/can_someone_please_explain_the_turning_right_on_a.json": "編集：皆さんのコメントに感謝します。これで私の考えがはっきりしました。私が言いたいのは\nイギリスでは赤でも左折できると思っている人が多いようですが、これは絶対にできません。\n赤で左折できると思っている人が多いようですが、それは絶対にできません。",
  "data/reddit-ask/r/askscience/comments/q78k2i/does_a_combustion_reaction_always_need_to_have_an.json": "反応に有機化合物が存在しない場合は？それは\nすでに燃焼反応ではないと考えられるのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q7apw6/why_is_so_much_japanese_porn_centered_around_the.json": "タイトル 私はHentai/Japanese pornが好きな男です。しかし、非常によくあるテーマは\n男が女をレイプしているだけなのに、途中で女が「気持ちいい」と気づいて\nその途中で女性は「気持ちいいから欲しいに違いない」と気付いて（これは100％嘘です。\nこれは100％間違いで、体がどう反応するかにかかっています）、そしてそれから...。",
  "data/reddit-ask/r/askscience/comments/q76nz6/how_did_a_space_rocket_take_off_again_from_the.json": "映画などのドキュメンタリーで何度も見たことがあるのですが、宇宙では\nスペースシャトルは大気圏外に出るとプロペラが切り離され、しばらく飛行した後に\nそして、しばらく飛行した後、安全な場所（月を考えてみてください）に着陸します。今、私が悩んでいるのは\nもし、ロケットに推進力がなければ...ということです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q7977l/how_much_blood_loss_is_needed_to_lose_an_erection.json": "だから......。人間とヴァンパイアのゲイ・エロティック・ファンフィクションを書いています。\n人間はヴァンパイアにされることに同意し、一緒に愛し合う。\n恐怖心をなくすために (全ては、巨大なスマット作品であり\n承諾と信頼、そして圧倒的な愛に重点を置いた巨大なスマホ作品です...。",
  "data/reddit-ask/r/askscience/comments/q7f7qs/why_is_the_verb_for_to_be_so_irregular_in_so_many.json": "これは、私が感覚的な知識以上のものを持っているすべての言語について言えることです。\n英語、ヘブライ語、ギリシャ語、スペイン語、そしてドイツ語です。これらの言語のいくつか（ドイツ語と\nこれらの言語の中には（ドイツ語と英語）非常に似ているものもあれば（ヘブライ語とスペイン語）非常に異なるものもあります。しかし\nしかし、すべての言語には、非常に不規則な活用があります。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q7cl2k/how_do_people_come_to_terms_with_the_fact_that_a.json": "私は数年前に大学を卒業し、給料も良く、福利厚生も充実した仕事に就いています。\n給料も良く、福利厚生や休暇なども充実した仕事に就いています。仕事ができることにとても感謝しています。\n仕事をしている限り、これは私にとって最高の状況だと思います。\nしています。\n\nしかし、今後20年から40年は......と考えると......。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q7ijyj/was_my_cashier_wrong_for_denying_me_a_condom.json": "因みに私は14歳です。カナダに住んでいます。彼女を誘う前に、私はコンドームを買うことが合法であることを確認しました。\n彼女に聞く前に、私はコンドームを買うことが合法であるかどうかを確認しましたが、驚いたことに、それは何とか合法でした。レジの店員は\n私が未成年であることを理由に売ることはできないと主張しました。私は彼女に次のように言いました。\n何歳になってもコンドームは買えますよ」と言ったのですが、彼女は頑として拒否しました。I...",
  "data/reddit-ask/r/AskHistorians/comments/q7bmk2/how_if_at_all_would_oliver_have_known_fagin_was.json": "オリバー・ツイスト」を高校時代以来、初めて読み直しています（10代の私はディケンズを全く評価していませんでした）。\nディケンズを全く理解していませんでした）、Faginが物語の中ですぐに\n物語の中ですぐにユダヤ人であることが判明したことに衝撃を受けました。オリバーが彼をそのように認識しているとは明示されていませんが\nオリバーが彼をそのように認識しているとは明示されていませんが、私の読みでは、それは...。",
  "data/reddit-ask/r/askphilosophy/comments/q78kmw/doing_my_ma_in_philosophy_now_and_im_getting.json": "私の混乱には、オリジナルなものや新しいものはありません。\n\n意味の飽和を経験すると、人は一時的に意味を失うまで言葉を繰り返す。\n一時的に意味を失うまで繰り返す。私は、自分が存在するすべての概念に対して同じことを感じます。\n繰り返される言葉だけではなく、私の存在の中のあらゆる概念に対して同じことを感じます。私が考えるすべてのものは、ほとんど本能的に\n意味を失ってしまうのです。",
  "data/reddit-ask/r/AskWomen/comments/q7iofp/how_many_orgasms_do_you_expect_during_sex.json": "もちろん、一度でもあればいい。そして、もっと多い方がいいでしょう。しかし\n一回のセックスでオーガズムを感じるのは「十分」でしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/q7hoqw/orwell_mentioned_london_and_paris_business.json": "1944年のトリビューンのコラムで\n[http://www.telelib.com/authors/O/OrwellGeorge/essay/tribune/AsIPlease19440811.html]。\nオーウェルは、西アフリカ人がロンドンのダンスクラブは白人だけだと言われたという逸話に反応した。\nオーウェルは、西アフリカ人がロンドンのダンスクラブは白人専用だと言われたという逸話に反応しています。\n\n> 数日前、ある西アフリカ人が、ロンドンのあるダンスホールが......と知らせてきた。\n> ホール...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q7sqgp/when_a_black_man_called_me_a_slt_a_ho_etc_why_did.json": "27F. 今日、私は食料品店でちょっとした口論になった。ある男性が\n私を放っておかず、ずっといちゃついていましたが、私は完全に\n完全に無視していたにもかかわらず、彼は私に付きまとい、最終的にはますます失礼な発言をし始めました。\nコメントをし始めました。彼は私のトロリーからいくつかの野菜を取り出し、私は...",
  "data/reddit-ask/r/AskHistorians/comments/q7ks5r/youre_invited_to_a_live_roundtable_next_week_all.json": "10月21日（木）午後5時（日本時間）より、「女性がどのようにして\n歴史の中で女性がどのように不当に表現されてきたかについて、質疑応答を行います。\n\n登録はお済みですか？ここであなたのスポットを予約してください\n[https://cz86404.na1.hubspotlinksfree.com/Btc/RI+113/cZ86404/VW9K9K3GGwW7V92_Kd6Nm-15VfQRxk4yCwhpN13dgqX3lScZV1...",
  "data/reddit-ask/r/AskHistorians/comments/q7fycy/the_silk_road_ran_through_some_pretty_rugged.json": "EDIT: 少し明確にしておきたいのですが、私は気まぐれにシルクロードを選びました。\n/が指摘したように、実際には存在しなかったので、最良の例ではありません。\nのです。一般的には、陸地をベースにしたキャラバンの旅に興味があります。\n一般的には、荒れた土地を横断するキャラバンの旅に興味があります。",
  "data/reddit-ask/r/AskWomen/comments/q7nds9/how_important_is_it_to_you_that_your_partner_be.json": "あなたのS/Oが、あなたの何を愛しているのか、なぜあなたを愛しているのかを明確に説明できない場合、それは問題ですか？\nあなたにとって問題ですか？なぜ、あるいはなぜそうでないのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q7xgn1/how_do_i_tell_my_sister_to_stop_sitting_on_my_lap.json": "明白な理由によるAltアカウント\n\n姉と私は文字通りの親友です。彼女は私より1歳年上です。私は\n16.\n\n学校から帰ってくると、私は自分の部屋のPCでSNSを見るのが日課です。\n姉は私の膝の上に座り、自分の学校で起こったことについて話し始めます。\n\n認めたくはないが、私は...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q7w6ry/would_i_see_significant_progress_from_doing_100.json": "今、私は大学に通っていますが、ジムに通う余裕がないことに気づきました。\nジムに通う余裕はありません。\n\nそこで、週3回のジムでのエクササイズの代わりに、毎日自重エクササイズをしたいと思いました。\nエクササイズをしたいと思いました。\n\n腕立て伏せ100回、腹筋100回、スクワット100回、カーフレイズ100回を毎日行うとしたら、私は..,\n果たして私は...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q7uvj5/why_is_hypersexualization_a_big_part_of.json": "誤解のないように申し上げますが、私はLGBT+の人たちが必ずしもこのような行動をとっているわけではなく\nLGBT+の人々が必ずしもこのような行動をとることを言っているのではなく、LGBT+の動きに関連する文化のことを言っているのです。\nLGBT+のムーブメントに関連する文化のことです。このことで私を嫌いにならないでください、私は理解したい一人の人間です。\n理解してください。\n\n私は、ゲイの人たちがたくさんいるという事実を知っています...。",
  "data/reddit-ask/r/AskHistorians/comments/q7woy9/ive_always_struggled_to_see_the_american_war_of.json": "つまり、アメリカ人はこの地域の先住民ではなかったのです。\n\n免責事項：私はアメリカ人ではありませんし、アメリカの独立戦争についてもあまり深く理解していません。\nアメリカの独立戦争についてはあまり深く理解していません。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q7zdgl/do_you_only_put_the_condom_on_the_penis.json": "コンドームはペニスにつけるのか、それとも睾丸にもつけるのか？例えば、コンドームを転がしたときに\n転がすときに、左に転がすものがあるかもしれませんが、睾丸にかぶせますか？\n睾丸の上に置きますか？",
  "data/reddit-ask/r/AskWomen/comments/q7m9z5/what_do_you_consider_unfaithful_in_a_relationship.json": "体験談募集",
  "data/reddit-ask/r/AskHistorians/comments/q80wnq/richard_nixon_seems_smarmy_due_to_watergate_but.json": "ニクソンが追求したものの中で、反感を買いそうなものをいくつか紹介します。\n支持者の反発を招きそうなものを挙げてみましょう。\n\n * アメリカの家庭に収入を保証する「ファミリー・アシスタンス・プラン」を提案した。\n   アメリカの家庭に収入を保証する「ファミリー・アシスタンス・プラン」を提案。\n * 環境保護庁の設立。\n * 環境保護庁の設立。",
  "data/reddit-ask/r/askscience/comments/q7z2xb/if_a_persons_brain_is_split_into_two_hemispheres.json": "このビデオを見て考え始めました。\nhttps://www.youtube.com/watch?v=wfYbgdo8e-8\n\n痙攣を抑えるために脳の半球の間の橋を切る手術を受けた後の人への影響について書かれています。\n脳の半球の間の橋を切る手術をした後の人への影響について話しています。\n\nこのビデオでは、例えば、両方の...",
  "data/reddit-ask/r/AskHistorians/comments/q7zvqv/im_a_polymath_and_inventor_in_1830s_england_one.json": "ジェイムズ・グライクの「ザ・インフォメーション」より\n[https://en.wikipedia.org/wiki/The_Information:_A_History,_a_Theory,_a_Flood]をご覧ください。\nチャールズ・バベッジの説明。\n\n> バベッジは、インキングペンを使ってカーブをトレースする鉄道記録装置を考案した。\n> バベッジは、1000フィートの長さの紙に曲線を描くインクペンを使った鉄道記録装置を考案した。\n>...",
  "data/reddit-ask/r/AskHistorians/comments/q83bw7/when_did_the_church_make_premarital_sex_a_sin.json": "アブラハムの妻サラは、自分の女奴隷ハガルをアブラハムに与え、世継ぎを作るためにセックスをさせた。\n跡継ぎを作るために、アブラハムに女奴隷ハガルを与えました（創世記16:1-4）。ヤコブの妻であるレイチェルとレアは、それぞれの女奴隷をヤコブに与えて、跡継ぎを作らせました。\nヤコブの妻であるレイチェルとレアは、それぞれの女奴隷をヤコブに与え、世継ぎを作るためにセックスをさせました。\n跡継ぎを作るために、ヤコブにそれぞれの女奴隷を与えました（創世記30:1-13）。ユダはかつて、自分が連れてきた女性を...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q83ao8/nsfw_normal_to_be_scared_to_masterbate_in_front.json": "美しい彼女と一緒になって5年になりますが、正直、彼女の前でマスターベーションするのはちょっと怖いです。\n彼女の前でマスターベートをするのは正直ちょっと怖いです。彼女は私のように高い性欲を持っていませんし\nどのように私はこの緊張の多くを解放するために試してみたいことをそれをもたらすためにいくつかのアドバイスを得たいと思いました。\n緊張をほぐしたいと思っています。見てはいけないのでしょうか...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q86ad0/reverse_pedophilia.json": "10代の若者が積極的に大人との性的・恋愛関係を求め、自分が未成年であることを伝えなかった場合は\n自分が未成年であることを伝えなかった場合、そのティーンエイジャーはある種の犯罪者なのでしょうか？\n\nこのシナリオでは、大人がまさに被害者です。しかし、法廷では\nとはいえ、法廷では小児性愛者とみなされると思いますが...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q82wxe/why_do_people_become_obsessed_with_celebrities.json": "私はそれを理解したことがありません。振り返ってみると、私が子供の頃に人気のあった有名人は\n振り返ってみると、子供の頃に人気のあった有名人が思い浮かびますが、感情移入できるような傑出した有名人はいませんでした。\n感情移入できるような有名人はいません。登場人物を思い浮かべ、彼らが演じていた人物や物事に対する自分の子供時代の感情的なつながりを思い浮かべることはできますが\n感情移入することができますが、そうではありません...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q8a5pu/is_morning_sex_that_good.json": "誰もがそう言っていますが、朝のセックスを考えると、あの恐ろしい口臭、眠気、空腹感が頭から離れません。\nあの恐ろしい息遣いを思い浮かべると、眠くてたまらなくなり、空腹感に襲われます。とか、朝の\n朝のセックスはとても恐ろしいものに違いない。私はセックスをしたことがありませんが、それをするととても疲れるかもしれません。\n疲れてしまうのかもしれませんね。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q8cx6i/why_is_everyone_so_horny_on_this_sub.json": "🤨 誓って、1日に20回は同じ質問がされていると思います。簡潔に言うと\nこの質問を見たことがない好奇心旺盛な皆さんのために要約します。\n\nはい、女性はセックスが好きです。フェラを楽しむ女性もいれば、そうでない女性もいる。はい、女性は\n女性は実際に存在する!\n\n私のテッドに来てくれてありがとう...",
  "data/reddit-ask/r/AskHistorians/comments/q8bh7e/how_did_iroquois_tribes_have_sexual_relationships.json": "現代的な考えなのか、ヨーロッパ的な考えなのかわかりませんが、関係を持つときにプライバシーを守るという\nしかし、大家族の中でパートナーと親密な関係を築こうとする考えは、私にとってはかなり不愉快です。\nパートナーと親密な関係を築こうとする大家族の生活は、私にとってはかなり居心地の悪いものです。\n私はただ、恋愛や性的関係がどのように機能するのかを理解しようとしているだけです。",
  "data/reddit-ask/r/AskHistorians/comments/q8cb0f/my_childhood_church_taught_that_the_haitian.json": "90年代後半から00年代前半にかけて、カンザス州での出来事です。\n\n編集：\"or has it been around for many years?\" は、おそらく \"or\nis/was it widespread?\" とすべきでした。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q89lsp/is_anyone_else_basically_an_idiot_because_of_very.json": "それが私を苦しめています。というのも、私はyoutubeで動画を作ったり、小説を書いたりしてお金を稼ぎたいのですが\nyoutubeの動画を作ったり、小説を書いたりしてお金を稼ぎたいと思っているのですが、私はまるで白紙の状態で、まるでレンガの壁を見つめているようです。\n頭の中は空っぽで、今まで経験したことはほとんど忘れてしまっている。\n忘れてしまいました。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q8hyoq/anyone_sleep_just_so_they_dont_have_to_deal_with.json": "かなり変な家庭に住んでいます。(16M) 愛のない家庭とは言いたくありませんが\nかなり \"冷たい \"感じがします。かなり厳しいので、自分の部屋で電話をしてはいけないし\n自分の部屋で電話をしてはいけないし、インターネットで人と話してはいけないし、（ゲームとかで\n私にはたくさんの雑用があります。家中を掃除しなければならないし...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q8imp0/why_do_men_ejaculate_inside_of_women_act.json": "羞恥心を煽っているわけでは絶対にありません。しかし、その理屈がわからないのですが？どうやって\n避妊をせずに女性の中に射精して、女性が妊娠したときにショックを受けたり驚いたりするカップルがいるのでしょうか？\n女性が妊娠するとショックを受けたり驚いたりするのでしょうか？人々は妊娠がどのように起こるかを理解していないのでしょうか？\n妊娠はどのようにして起こるのか理解できないのでしょうか？明らかに、私はそのようなカップルのことを言っているのではありません。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q8hepw/when_crickets_find_a_mate_do_they_finally_shut.json": "裏庭のコオロギに他のコオロギを投げつけて、コオロギをなだめることはできますか？",
  "data/reddit-ask/r/AskWomen/comments/q89ecl/if_you_lost_your_job_tomorrow_how_long_do_you.json": "また、どのような分野・業界で働いていますか？",
  "data/reddit-ask/r/AskHistorians/comments/q8kzqp/my_high_school_us_history_teacher_said_the.json": "その先生は、カトリック系の男子軍事学校で、次のように主張しました。\nイギリスでピューリタンが直面した問題は、彼ら自身が作り出したものであると主張した。彼女は\n社会的な圧力や迫害はほとんどなかったという。\n社会からの圧力や迫害はほとんどありませんでした。むしろ彼らが直面したのは、単に...",
  "data/reddit-ask/r/askscience/comments/q8n5ld/the_uk_recently_lost_a_1gw_undersea_electrical.json": "これがそのストーリーです。\nhttps://www.theguardian.com/business/2021/sep/15/fire-shuts-one-of-uk-most-important-power-cables-in-midst-of-supply-crunch\n\n発電量と消費量のバランスが必要なことは承知しています。気になるのは\n気になるのは、さっきまで発電していた \"余剰 \"電力がどうなるのか...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q8nk2r/like_how_girls_can_put_flashlights_under_their.json": "詳しい文脈はr/glowtits [/r/glowtits]をご覧ください。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q8ks1u/how_come_men_are_always_said_to_be_way_more_horny.json": "私がとても変わっているだけなのでしょうか？多くの女性から「彼氏や彼女と同じくらいの頻度でセックスしたい」という話を聞いたことがあります。\n彼氏や旦那と同じくらいの頻度でセックスしたいという女性はたくさんいます。そして、r/deadbedroomsを見ると\n[r/deadbedrooms]を見ると、異性交際をしている女性がたくさんいます。\n\nフックアップを見てみると、男性がフックアップするのはずっと簡単です。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q8vfmf/im_in_a_sexless_marriage_with_a_controlling_wife.json": "感情移入はしたくない。ただ、もう一度触ってもらいたいのです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q8pnp0/what_is_2_girls_1_cup.json": "前から気になっていたのですが、怖くて調べられません。",
  "data/reddit-ask/r/AskHistorians/comments/q8q0jb/the_last_duel_claims_charges_of_rape_in_14th.json": "ソースを提供しているエリック・イェーガー氏の本は、若干混乱していますが\nと言っています。\n\n> レイプ事件の起訴と処罰は、被害者の社会的地位や政治的影響力に左右されることが多かった。\n> 階級や政治的影響力に左右されることが多かった。フランスでは、窃盗などの軽い犯罪で有罪になった女性は、しばしば刑務所に入れられた。\n> フランスでは、窃盗などの軽い罪で有罪になった女性はしばしば死刑になり、...",
  "data/reddit-ask/r/NoStupidQuestions/comments/q8wyvl/is_it_wrong_to_want_my_future_girlfriend_to_not.json": "私は15歳ですが、VAPEやタバコは一般的に不健康だと思います。\n将来の彼女にドラッグをやらせたくない。",
  "data/reddit-ask/r/AskWomen/comments/q8rrvf/what_do_you_on_those_days_at_work_that_you_are_at.json": "何かヒントがあれば教えてください。ありがとうございます。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q93tco/why_do_men_ask_me_to_smile.json": "これは投票されないような気がしますが、答えが必要なので、とりあえず\nとにかく投稿します(笑)。\n\nこれは、休んでいるビッチフェイスの女性によく見られることですね。男性はいつも\n男性はいつも「なんで笑わないんだよ」とか「もっと笑えよ」とか\n\"どうしてそんなに意地悪な顔をしているんだ？\"\n\nなぜ、彼らは...",
  "data/reddit-ask/r/NoStupidQuestions/comments/q91g21/why_are_wet_wipes_allowed_to_call_themselves.json": "商品の販売方法には様々な規制があります。\n真っ赤な嘘を言ってはいけないのです。水に流せる」ワイプは真っ赤な嘘のようですが\nでも、どうして嘘を言ってもいいの？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q8zlg6/is_it_just_me_or_has_google_web_search_result.json": "最近、Googleで検索してもうまくいかず、関連性のない答えが返ってくることが多くなりました。\n他の検索エンジンに頼らざるを得なくなりました。覚えているのは\n10年前は、何かを検索すると、最初の結果はたいてい欲しいものでした。\n欲しかったものでした。今では、3番目か4番目に表示されます。最初の...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q946zy/so_mary_was_14_when_she_gave_birth_to_jesus.json": "キリスト降誕祭の話は、同意を得ていない10代の若者が無理やり赤ん坊を身ごもり、ガスを使って\n承諾していないティーンエイジャーが無理やり赤ちゃんを身ごもって、天使にガスを吸わせてもらって、何マイルも旅をして\n貧しいために誰も助けてくれない。\n貧しいので誰も助けてくれず、彼女は生きて産まなければならなかった...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q93k04/why_dont_we_call_countries_what_they_call.json": "ドイツがドイッチュラントを名乗るなら、なぜ英語では「Germany」、スペイン語では\nスペイン語では \"Alemania \"などと呼ぶのでしょうか？\n\nスペインがEspañaを名乗るなら、なぜ英語化された名前を持っているのか？また、英語のアルファベットにはñ\nは英語のアルファベットには存在しませんが、Espanyaなどと簡単に言えますよね。\n似たようなものです。\n\nと思うのですが・・・。",
  "data/reddit-ask/r/AskHistorians/comments/q8rism/despite_very_different_origins_greeks_and_turks.json": "最近知ったのですが、Tzazikiはギリシャ語でCacik（トルコの\nヨーグルトソース）のギリシャ語訳だと知りました。) どちらの文化も、ヨーグルトをベースにした多くの\n極めて似通ったヨーグルトベースのレシピが多く、料理の大部分にヨーグルトを使用しています。\n料理の大部分にヨーグルトを使用しています。\n\nトルコ人の祖先は遊牧民である。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q91198/why_is_everyone_on_reddit_so_mean_and_toxic.json": "ここは右も左もいじめっ子だらけって感じですね。\n\n何か反対意見を言うと、ダウンボットされて消されてしまう。\n\n反対意見を言うと、ギャングのように名指しで嫌がらせをしてきます。\nメンタリティを持っています。\n\nまるでこの場所は惨めな人たちで溢れているようです。\n\nなぜこのような場所でなければならないのかというと・・・。",
  "data/reddit-ask/r/AskHistorians/comments/q90784/did_people_lose_their_minds_about_getting.json": "これはCovid-19に関する質問ですが、私は自分の人生の中で、「アンチ・ヴァックス」運動の拡大を見てきました。\n私の人生において、「アンチ・ヴァックス」運動が拡大していくのを見てきました。反ワクチン」は歴史的に頻繁に起こることですか？\n頻発しているのでしょうか、それとも異常なことなのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q99n6o/should_i_be_upset_or_just_let_it_go.json": "この2、3ヶ月間、私は街の外で仕事をすることが多かったんです。私の妻は5年間\n歳の妻は2人の子供と一緒に家にいます。彼女は学校の最終学年なので\n自分でやることが多いので、あまり頼まないようにして、私が家にいないときに彼女が楽になるように最善を尽くしています。\n私が家にいないときも、家にいるときも、妻が楽になるように最善を尽くしています。私は...",
  "data/reddit-ask/r/AskWomen/comments/q96any/how_do_you_cope_when_everything_goes_wrong.json": "特にそれが一度に起こるような場合は？\n\nすべてに圧倒されず、ポジティブでいるために何をしていますか？",
  "data/reddit-ask/r/AskHistorians/comments/q9bce6/whats_different_about_america_specifically_that.json": "オーストラリア ポートアーサーの虐殺、全国銃器協定。\n\nカナダ École Polytechniqueでの大虐殺；数年後に銃規制法を制定。\n\nニュージーランドは20年ルールの対象外だが、クライストチャーチの大虐殺をきっかけに\nは同様の取り組みを行った。\n\nこれらの国はすべて英語圏で、多数派は...",
  "data/reddit-ask/r/NoStupidQuestions/comments/q93sng/does_anyone_else_get_this_strange_feeling_when.json": "それは、私が持っていなかった何かに対するノスタルジアのようなものです。私が知らなかった何か\n欲しかったもの。何かのために......でも、それが何なのかはわからない......。\n\nそれは私に別の時代を思い出させます、私が想定している時代は、今よりもずっと単純で、ずっと幸せでした。\n今よりずっと幸せだったと思う",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q9boef/what_media_would_i_have_likely_experienced_if_i.json": "大きな疑問なので、少しずつ説明していきます。カルト教団に生まれた。もうその中にはいない\nカルトには入っていません。\n\nしかし、カルト教団に生まれたことで、すべてのエンターテイメントやメディアから遮断されてしまいました。\nメディアに関連したものはすべて遮断されました。\n\n誰か、私と同年代の多くの人が経験したことのある、良いリストを持っていませんか？\n映画、番組、本、ゲーム...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q9igfj/why_do_dentistshygienists_insist_on_engaging_you.json": "気づいていないかもしれませんが、あなたは今、私の大きく開いた口の中に、たくさんの道具を入れています。\n気づいていなかったのなら、あなたは今、私の大きく開いた口の中に、たくさんの道具と一緒に入っている。私は今、本当に話すことができません。\n基本的には「はい」「いいえ」と呻くだけで、この気まずい会話をしなければなりません。\nあなたの質問に",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q9hmuf/are_you_ok_with_having_sex_with_someone_who_hasnt.json": "一般的な体毛ではなく、陰毛のことです。\nオーラルセックスでは",
  "data/reddit-ask/r/NoStupidQuestions/comments/q9hmq7/what_can_a_man_do_if_a_girl_suddenly_changes_her.json": "かなりの頻度で考えることですが、怖いですよね。私はまだ21歳で\nまだ21歳で、子供を作る計画も準備もしていませんが、インターネットで時々読むクソ記事を見ると\n女性はピルを飲んでいると嘘をついた、男性は子供の養育費を払わなければならない、など。\n女はピルを飲んでいると嘘をつき、男は養育費を払わなければならず、女は...。",
  "data/reddit-ask/r/AskHistorians/comments/q9l4se/is_the_removal_of_pubic_hair_a_recent_practice_or.json": "削除された最近の投稿に触発されて、これは今まで考えたこともなかったことです。\n今まで考えたこともなかったことです。世界中で人々が陰毛を処理したり剃ったりしてきた広範な歴史があるのでしょうか？\n世界中で陰毛を処理したり、剃ったりする人々の広範な歴史があるのでしょうか、それともこれは最近のことなのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/q9kvv3/how_do_i_get_rid_of_this_unwanted_dog_without.json": "この悪夢を見続けて1年が経ちました。それが我が家に持ち込まれたのは\n何の脈絡もなく質問されてから、我が家に持ち込まれました。\"ねえ、あなたは犬が好き？\"\nと聞かれ、私の間抜けが \"うん、そうだね \"と答えたことがきっかけです。\n\n次の日、ボーダーコリーを飼うことになりました。私は犬を育てたり、訓練したり、世話をしたりすることを望んでいませんでした。\nなぜなら...",
  "data/reddit-ask/r/AskWomen/comments/q9epvi/women_of_reddit_what_is_your_experience.json": "編集：皆さんへ。\n\nお話をお聞かせいただき、ありがとうございました。今回の質問は、映画「The\nWolf of Snow Hollowです。ネタバレはありませんので、映画をご覧ください。",
  "data/reddit-ask/r/AskHistorians/comments/q9lrmz/in_romans_1_2627_paul_says_that_paganism_is_the.json": "これが問題の一節です。\n\n「26 このために、神は彼らを恥ずべき欲情に走らせた。彼らの女たちも\n自然な性関係を不自然な性関係に変えてしまった。27 同じように、男たちも\n27 同じように、男たちも女との自然な関係を捨てて、互いに欲情した。\n互いに欲情した。男たちは...",
  "data/reddit-ask/r/NoStupidQuestions/comments/q9kl78/is_there_a_support_group_for_daughters_with_hot.json": "自分のタイトルが面白いと思うのはもちろんですが、純粋に興味があるのは、MILFポルノだけでなく、これに特化したRedditグループがあるかどうかです。\nこれに特化したRedditのグループがあるかどうか、純粋に興味があります。\n\n私はこれまでずっと、「醜い妹」や「不幸な遺伝の実験台」として追いやられてきました。\n遺伝の実験台にされてきましたが、特に同年代の仲間からは 人々は\n思わず...",
  "data/reddit-ask/r/AskWomen/comments/q9m2hg/whats_your_impression_about_people_who_constantly.json": "インフルエンサーではなく、一般の人で、自分の持ち物を頻繁に投稿している人。\n(派手な車やデザイナーズバッグなど）を頻繁にソーシャルメディアに投稿している一般の人たちです。それによって、あなたが彼らをどのように\n印象が変わりますか？",
  "data/reddit-ask/r/AskHistorians/comments/q9lqek/what_did_world_war_2era_carrierbased_pilots_do_in.json": "彼らは何日も何週間も戦闘任務に就かない日が続いたに違いない。\n少なくとも、ほとんど戦闘任務（例：戦闘空中哨戒）はなかったはずです。\n\nそれぞれの船には何十人ものパイロットがいて、物資を食いつぶしていたに違いありません。\n補給物資を食いつぶしていたことを考えると、パイロットとしての仕事以外では何に使われていたのでしょうか？\n\nそれとも私の思い込みでしょうか...。",
  "data/reddit-ask/r/AskHistorians/comments/q9q6zv/ive_read_that_there_was_a_position_in_accent.json": "私の妻は長年、胃腸科のナースプラクティショナーで、私はICUの看護師として働いています。\nICUの看護師として働いています。以前から私は、人々にウンチをさせるために様々なことをするように命令されたとき、「私は彼らの羊飼いになります」と言ってきました。\nウンチをさせるために様々なことをするように命じられたとき、私は「彼らの監視役になります」と言ってきました。もしあなたが\nボーナスポイントは、上記の地位を表す象形文字を教えてくれると嬉しいです。私の妻は...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q9t53j/do_you_have_a_one_that_got_away.json": "私は若い頃、親しい男友達がいて、その人に恋をしていました。私たちは\n何年も親友として過ごしてきましたが、最終的には結婚しました。\n彼はパニックになって私を遠ざけてしまったのです。その後、数年間はあまり話をしませんでした。\n数年は本当に話をしませんでした。結局、私は引っ越しをして、今の私の彼に出会いました...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q9xami/what_is_good_place_to_hide_your_dildo.json": "最近、ディルドを買ったのですが、親には絶対に見つかってほしくありません。\n誰かいい方法を教えてください。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q9wg33/what_is_a_job_that_an_idiot_like_me_can_do.json": "私はIQが低いです。それは私が10代の頃にセラピストで行った公式なものでした。I\n90点でした。つまり、普通の人の下限ですね。しかし、私にとってはまだ低すぎるのです。\n低いです。\n\n私のような人はどんな仕事ができるのでしょうか？どんな仕事ができるのか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/q9ypyf/why_do_so_many_people_on_reddit_hate_rantiwork.json": "あのサブレディットには過激な人もいますが、私はサブレディットに目を通しました。\nそのサブレディットを見てみると、大多数の人が、より高い賃金、最低賃金を求めているように見えます。\n賃金の上昇、最低賃金の引き上げ、労働条件の改善、そしてアメリカ人は国民皆保険を望んでいるようです。\nアメリカ人は国民皆保険を望んでいます。憎しみはどこから来るのか？I...",
  "data/reddit-ask/r/NoStupidQuestions/comments/q9vyc0/can_i_get_paid_to_listen_to_peoples_problems.json": "第二の収入源を探していて、人の話を聞いてアドバイスするのが得意らしい。\n人の話を聞いたり、アドバイスをしたりするのは得意なので、もしかしたら私の知らないチャンスがあるかもしれない。\n気づいていないチャンスがあるかもしれません。\n\n編集\n\nまた、実際に学位を取ることも考えました。",
  "data/reddit-ask/r/AskHistorians/comments/qa31qb/the_wikipedia_page_for_emperor_meiji_of_japan.json": "こちらの記事[https://en.wikipedia.org/wiki/Emperor_Meiji]をご覧ください。",
  "data/reddit-ask/r/NoStupidQuestions/comments/q9xa3f/why_do_lots_of_people_believe_in_god_but_often.json": "幽霊が聖書や教会に含まれているかどうかはわかりませんが、悪魔は含まれていますよね。\n狂ったように疑わなければならないのに、天使や神への信仰は何でも結びつけようとするこの考え方はどうなのでしょうか？\n天使や神への信仰があれば、それを何かに結びつけようとするでしょう？私は宗教が嫌いではありません。\n私は宗教を嫌いませんし、これは攻撃ではなく、ただ純粋に...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/q9xby8/why_are_humans_born_in_the_year_2000_the_very.json": "私たちは \"ジェネレーションZ \"と定義されていますが、ミレニアムの定義は\n1000年です。私たちはまさに千年紀の定義であるべきだと思います。\nミレニアルの定義そのものであるべきだと思います。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qa4ue7/farmers_of_reddit_how_can_i_go_about_striking_a.json": "レストランのために野菜をたくさん買いたいけど、中間マージンを取りたくない。\n男だ。私は何百、何千もの農場の近くに住んでいるので、誰かに教えてもらいたいのです。\n私は何百、何千もの農場の近くに住んでいます。\nありがとうございます。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qa5phe/why_do_people_in_movies_cut_their_palm_when_they.json": "血液を採取するには本当に非現実的な方法のように思えますし、手を怪我しているためにハンディキャップを負っているようなものです。\n手を怪我しているので、ハンディキャップがあります。",
  "data/reddit-ask/r/askscience/comments/qa4hxx/how_do_electrical_grids_manage_phase_balance.json": "米国では、ほとんどの住宅には単相電力が供給されており、通常は分相変圧器を介して\nこの変圧器の上流にある この変圧器の上流のどこか、おそらくは配電変電所で\nこの変圧器のどこか上流、おそらく配電変電所で、その単相が三相変圧器から引き出されています。\n変電所のどこかで、その単相が三相のトランスから引き抜かれている。\n\nでは、どのような仕組みで位相のバランスを保っているのでしょうか。それは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qaj948/how_do_i_navigate_family_who_refuse_to.json": "私の祖父は、男の子供全員をレイプしました。長男は19歳で自殺してしまいました。\n\n彼は私のいとこの男性全員を子供の頃にレイプしました。\n\nこれはよく知られていることで、議論の余地はありません。\n\n彼は5年前に亡くなりましたが、人々はいまだにその人を賞賛し、彼がいかに偉大であったかを称えるような追悼文を投稿しています。\n彼がいかに偉大であったかを賞賛しています。何人かは無自覚で、何人かは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qajgme/how_is_islam_not_a_cult.json": "前置きが長くなりましたが、私は「イスラムの国」の出身で、現在はそこに住んでいます。\n国」に住んでいます。私はイスラム教徒の家庭で育ち、イスラム教を教えられました。私はそのことを知っています。\nを知っています。また、私はイスラム教徒を侮辱するつもりはありません。彼らが何を信じるかは自由です。\n彼らが何を信じようと自由です。\n\nとにかく私が言ったように、私の両親は私にイスラム教を...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qaisjz/yeast_is_a_type_of_fungus_how_do_women_get_a.json": "写真は本当に見たくないので、怖くて調べられません。",
  "data/reddit-ask/r/askscience/comments/qajecn/why_is_my_pot_hydrophobic_where_it_contacts_the.json": "ポットの写真 [https://i.imgur.com/IVXCpEh.jpg]\n\nレンジの写真 [https://i.imgur.com/kyB8V7M.jpg]\n\n洗い終わった鍋をシンクに置いているところです。水が溜まっていく様子が\nレンジと同じパターンで水が溜まっているのがわかります。ポットはスチール製ですが\nレンジも同じだと思います。底の部分は...",
  "data/reddit-ask/r/AskHistorians/comments/qag7k4/why_do_womens_clothes_in_general_reveal_more_skin.json": "ほとんどのカテゴリーの服で、女性用の服は男性用の服よりも肌を露出しています。\n男性用の服よりも肌の露出が多いのです。また、女性の服は体にフィットしていることが多いです。\n体にフィットしています。\n\n女性服の「セクシュアル化」はどのようにして起こったのでしょうか？20世紀以前は\n男性も女性も服は...だったようです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qak1a8/which_is_more_environmentally_worst_throwing_my.json": "洗い流した後にゴミ箱に入れる方が良いとは思いますが\n1つの瓶のために使う水の量を考えてみてください。ケチャップやピーナッツバターなどにも同じことをしていたら\nケチャップやピーナッツバターなど そのためにどれだけの水を無駄にしているのか、どうやって十分にすすぎを行ったのかを確認してみましょう。\nトリアージの人が捨てないようにするには、どうすればいいんだろう...。",
  "data/reddit-ask/r/AskHistorians/comments/qajtsu/in_the_uk_areas_associated_with_paganism_and.json": "こちらはイギリスのキノコマップ[https://www.magicmushroommap.com/map]で、目立つのは\nウェールズ、南西部、スコットランドに顕著な地域があります。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qahrcr/why_do_men_have_to_pay_child_support_but_women.json": "さて、タイトルはちょっとわかりやすいですが、少し背景を説明しましょう。女性は\n妊娠をやめる、つまり中絶するという選択肢がありますが、もし男性が妊娠をやめることを選び\n養育費を払わなければならないのでしょうか？\n養育費を払わなければならないのでしょうか？もし父親が5年後に出て行ったら...というのは理解できます。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qamtrx/why_do_people_hate_math_more_than_the_other_main.json": "なぜ数学は非常に難しいというイメージがあるのでしょうか？私はあるYouTubeチャンネルをフォローしています。\n私がフォローしているYouTubeチャンネルでは、コミュニティで「一番苦手な科目は何か」という投票を行っています。\nその結果、満場一致で（75％くらい）数学が選ばれました それが気になるのは\n子供の頃、私は数学（と科学）をある程度は好きだったのですが...。",
  "data/reddit-ask/r/AskHistorians/comments/qaj6iq/was_isaac_asimov_really_the_first_author_to_come.json": "これは、人と人との間で常に伝えられる「事実」の一つであるが、決して\n問われることはない。それは最初のものだったのか、それともただ続いたものだったのか？\n\nつまり、アイザック・アシモフの『銀河帝国』は、人類が主導したiPS細胞の最初の出版物だったのか？\n人類が主導した恒星間文明の公表された例だったのか？",
  "data/reddit-ask/r/AskHistorians/comments/qaqi8r/what_was_colin_powells_role_in_the_us_militarys.json": "私の質問は、タイトルにある通りです。私がよく知っているのは\n私は2000年頃のイラクの論争についてはよく知っていますが、パウエルが\nベトナムに関わっていたことは全く知りませんでした。\n\n基本的には、パウエルが軍の虐殺を隠そうとする試みを主導したというツイッターでの言及から来たものです。\n虐殺を隠そうとしたということです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qaqd7e/males_raised_by_single_moms_what_did_you_learn.json": "5月に夫が突然亡くなりました。今は、9歳の息子と6歳の娘を育てるために\n歳の息子と6歳の娘を育てています。\n\n夫は早くに父を亡くし、母に育てられました。彼は\n先生から「引っ張らなくてもいいんだよ」と説明されたという話をしていましたが...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qazwxc/is_this_abusive.json": "どうやって聞いたらいいのかわからない。しかし、私の母は私の体に権利があると思っています。これには\nブラジャーを着けたくないのに、手術後に母の目の前でブラジャーを着けさせられたこと。\n自分でシャワーを浴びることができたのに、少なくとも1週間はシャワーを浴びさせられました。\n自分でシャワーを浴びることができるのに、少なくとも1週間はシャワーを浴びさせられました。彼女は、私が...と思っていると、私を掴んでつねったりします。",
  "data/reddit-ask/r/AskWomen/comments/qaq8uo/what_made_you_finally_realize_that_you_were.json": "また、誰かを \"卒業 \"したという人は、少し自尊心が強いと思いますか？\n自己中心的だと思いますか？",
  "data/reddit-ask/r/askscience/comments/qaxw8e/how_does_adding_texture_to_a_surface_reduce_drag.json": "エアバス社では、空気抵抗を減らすために、サメの皮膚のくぼみを模倣しようとしていると聞きました。\nざらざらしたものが滑らかなものよりも空気抵抗を減らすというのは理解できませんが\n理解できません。これはどのような仕組みなのでしょうか？ゴルフボールにディンプル（くぼみ）があるのと同じようなものでしょうか？",
  "data/reddit-ask/r/AskWomen/comments/qat1hl/do_you_feel_certain_words_have_lost_their_meaning.json": "必要であれば、なぜその特定の言葉を投稿することもできます。",
  "data/reddit-ask/r/askscience/comments/qau2u6/how_would_i_give_directions_to_earth.json": "仮定の話。目覚めたらエイリアンの宇宙ステーションにいた。意思疎通は問題なくできていて\n彼らは善良な人々であり、人類にとって脅威ではないと判断した。しかし、私は家に帰らなければならない。\n\n自分が天の川の中にいることはわかっている。どれくらい眠っていたのかはわからない。彼らは\n銀河系のほとんどは、目に見えるドキュメントで...",
  "data/reddit-ask/r/NoStupidQuestions/comments/qb1r27/why_my_girlfriend_taste_like_copper.json": "初めて彼女にオーラルセックスをしたところ、何度もオーガズムを感じた後に\n何度もオーガズムに達した後、銅の味がする液体を味わい始めました。\n1円玉を舐めているような銅の味がしました。皆さんの回答に感謝します。",
  "data/reddit-ask/r/AskHistorians/comments/qaw29k/the_askhistorians_2021_digital_conference_is_here.json": "皆さん、こんにちは。\n\n明日は正式にAskHistorians 2021 Digitalの初日が始まります。\nカンファレンス[https://www.askhistorians.com/2021-digital-conference]の初日を迎えます これからの3日間、私たちは\nこれから3日間、素晴らしいコンテンツが用意されていますので、皆さんにすべてを体験していただきたいと思っています。\n皆さんにすべてを体験していただきたいと思っています。そのために...",
  "data/reddit-ask/r/AskHistorians/comments/qb6pto/in_1982s_first_blood_rambo_asks_a_woman_if_she.json": "また、『First Blood』の原作は、アメリカがベトナムに関与していた頃の1972年に出版された本です。\n1972年に出版された本が原作です。枯れ葉剤に関する同様の記述は見当たりませんでした。\n枯れ葉剤についての記述は見当たりませんでしたが、ベトナム戦争直後、枯れ葉剤の影響はどのように認識されていたのでしょうか。\n枯れ葉剤の影響は、ベトナム戦争直後にはどのように認識されていたのでしょうか。",
  "data/reddit-ask/r/AskHistorians/comments/qb89zx/megathread_day_one_of_the_askhistorians_2021.json": "8ヶ月に及ぶ企画、収録、編集、研磨を経て\nAskHistorians 2021 Digital Conferenceがいよいよ開催されます。組織委員会を代表して\n組織委員会を代表して、今年のイベントに[https://youtu.be/xA-ldDJPbWs]を歓迎します。\nイベントを開催します。\n\n2020年、私たちは最初のデジタルカンファレンスをここredditで開催しましたが、...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qbau0n/can_you_exercise_your_dick.json": "私の話を聞いてください。ペニスが筋肉であるならば、他の筋肉のように、定期的に刺激・活性化されると大きくなるのでしょうか？\n他の筋肉と同じように大きくなりますか？",
  "data/reddit-ask/r/AskWomen/comments/qb6wbp/one_day_a_new_rule_is_enforced_where_the_cost_of.json": "明確にするために編集しました：はい、流通、開発、広告などを含めることができます。\nアドバタイジング",
  "data/reddit-ask/r/AskWomen/comments/qb4t7t/overweightobese_women_of_reddit_what_made_you_get.json": "真面目な質問です。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qba7du/why_do_some_christians_despise_halloween_though.json": "私は教会で育ち、非常に火と石の多い環境でしたが、ハロウィーンを祝いました。年を重ねるごとに\n年を重ねるごとに、ハロウィンを嫌って子供に参加させない人（クリスチャン）が増えてきました。\n自分の子供を参加させない人（クリスチャン）が増えてきました。過去にハロウィンの起源が何であったにせよ\n昔はともかく、今はそれが当たり前ではないのでしょうね。クリスチャンが染めることができれば...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qbbp4p/how_do_nonsexual_like_asexuals_or_demisexual.json": "言葉足らずでしたが、基本的に私は最近とても孤独を感じています。\nハグされたり、抱きしめられたりすると嬉しいです。\n\n一夜限りの関係は無理だし、不安やパフォーマンスの問題もある。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qbdqlc/why_dont_people_use_the_bathroom_fan.json": "多くのバスルーム(新しいものはすべて？)には、臭いを早く消すために、排気口に空気を吸い込むファンが付いています。\nにおいの除去を早めます。また、トイレの音を小さくするという副次的な効果もあります。\n用を足すときの音を小さくする効果もあります。\n\n人が来ても使わないんですよ。うちの人は使わなかった。私の\nガールフレンドも使っていない...",
  "data/reddit-ask/r/AskHistorians/comments/qbcym7/the_five_civilized_tribes_cherokee_muscogee.json": "五つの文明部族は、18世紀に黒人の家畜奴隷制を採用し、実践していました。\n18世紀になって 涙の道（Trail of Tears）で故郷を追われたとき、彼らは奴隷を新しい居留地に連れて行きました。\n涙の道」で故郷を追われたとき、彼らは奴隷を新しい居留地に連れて行きました。部族の奴隷制度は\n部族の奴隷制度は、南北戦争の終わりに廃止されました。",
  "data/reddit-ask/r/AskHistorians/comments/qbeksp/tibet_preccp_a_slave_based_theocracy.json": "中国に併合され、社会主義的な経済改革が行われる前のチベットは、封建的な奴隷制度を持つ神政国家であったという主張を聞いたことがあります。\n社会主義的な経済改革が行われる前のチベットは、封建的な奴隷制度を持つ神政国家だった、という話を聞いたことがあります。\nこれはどの程度正しいのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/qbd1ky/conference_announcement_due_to_a_widespread.json": "残念ながら、このタイトルがすべてを物語っています。\n基調講演者であるDevon Mihesuah博士の講演は明日に延期しなければなりませんでした。\n明日に延期せざるを得なくなりました。\n\n\n基調講演は、明日、同じ時間（米国東部時間午前11時）に行われます。\n10月20日（水）です。\n\nすでに登録されている方は、こちらをご覧ください。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qba541/i_dont_understand_how_unemployment_is_low_but.json": "概念的に頭に入ってきません。私は公認会計士なので、さまざまな業界の人と話をします。\n私はCPAなので、あらゆる業界の人と話をしますが、誰もが人手不足に悩んでいます（特に熟練したプロ\n専門家）。) 私の街のダウンタウンを車で走っていると、どのチェーン店やレストランも\n私の街のダウンタウンを車で走ると、どのチェーン店やレストランでも、最低賃金の2倍の賃金で募集中の看板を掲げています。",
  "data/reddit-ask/r/askscience/comments/qb92a0/why_are_the_seatbelts_on_cars_buses_and_airplanes.json": "具体的には、なぜバスでは、調整に時間のかかる2点式シートベルトを採用しているのか？\n調整するのに時間がかかります。車の3点式シートベルトのような安全性はなく、飛行機のシートベルトのように簡単に調整したり取り外したりすることもできません。\n飛行機のシートベルトのように簡単に調整したり取り外したりすることもできません。",
  "data/reddit-ask/r/AskHistorians/comments/qayzlm/what_was_the_role_of_female_soviet_troops_when.json": "私は最近、第二次世界大戦中のソ連軍への女性の参加について読んでいます。\n第二次世界大戦中のソ連軍への女性の参加について読んでいます。女性は労働力や看護師としてだけでなく、（他の軍隊に比べて）実際の戦闘にも大きく参加していました。\n他の軍隊に比べて）実際の戦闘にも大きく参加していました。\n\n私が第二次世界大戦の授業で覚えているのは、大規模な略奪行為が...",
  "data/reddit-ask/r/askscience/comments/qbafyi/is_there_an_upper_limit_to_the_highest_possible.json": "私はエンジニアではありませんし、ジェットエンジンの物理学についても初歩的な理解しかありません。\n私はエンジニアではありませんし、ジェットエンジン、特に民間旅客機の背後にある物理学については初歩的な理解しかありません。\n\n確かに、民間旅客機でバイパス比を高くすると燃費が良くなるという物理学の多くは、私にとっては直感に反するものでした。\n確かに、民間旅客機のバイパス比を高くすると燃費が良くなるという物理学の話は、私にとっては非常に直感に反するものでした。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qbgauc/is_reddit_decreasing_in_quality.json": "私はTik Tokのリポストのリポストのリポストのリポストを見るのに疲れました。\n最終的には、私のナンの写真よりも質が悪くなるでしょう。ほとんどの \"人気 \"のある\n人気のある \"サブレディット \"のほとんどは、tik tokのビデオを再投稿しているだけです。この人たちは、tik tokの動画を見て、どんな喜びを\n彼らはredditでtik tokのビデオを見ることで、どんな喜びを得ているのでしょうか、、、。",
  "data/reddit-ask/r/askscience/comments/qbevnl/are_planetary_rings_always_over_the_planets.json": "その位置は、惑星やその環が形成される雲のディスクに関係していると理解しています。\nしかし、リングの形成には他のメカニズムもあるので\n緯度や角度の違いによるリング形成のメカニズムはあるのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qb0itt/why_are_we_calling_it_the_ahmaud_arbery_trial_if.json": "ほとんどの国のケースでは被告人の名前で呼んでいます。例えば\n例えば、「ケイシー・アンソニー裁判」や「OJシンプソン裁判」、最近では「R・ケリー裁判」などです。\n「R・ケリー裁判」です。Ahmaud Arberyは裁判にかけられている人ではありませんが、彼の名前で呼ぶことで\n彼の名前で呼ばれることで、彼の人生が裁判にかけられているような気がして...。",
  "data/reddit-ask/r/AskHistorians/comments/qbaxay/why_hitler_didnt_do_the_whole_fascist_salute.json": "いつもこんな風に腕を組んでいるようです。\nhttps://www.lepoint.fr/images/2015/03/13/adolf-hitler-nazi-allemagne-3089324-jpg_2763435_1250x625.JPG\nなんでやねん",
  "data/reddit-ask/r/AskHistorians/comments/qbi0kv/did_an_asterix_and_obelix_village_really_exist.json": "アステリックスとオベリックスの漫画に出てくる村は完全に自律していた\nガウスの他の地域が征服されても、ローマ帝国から完全に独立していました。もちろん、その村はフィクションですが\nもちろんその村はフィクションですが、何か実在するものがベースになっているのではないかと\nと思っています。ローマ帝国の中で、このような村はあったのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/qbprvl/why_did_grappling_martial_arts_seem_to.json": "皆さん、こんにちは。\n\nレスリング（あらゆるバリエーション）は、トルコ・ペルシャの勢力圏で行われている「主要な」伝統的武術であることに気づきました。\n西アジア、中央アジア、南アジアのトルコ・ペルシャの勢力圏で行われている「主要な」伝統武術です。\nレスリングは、西アジア、中央アジア、南アジアのトルコ・ペルシャ勢力圏で行われていた「主要な」伝統武術であり\n現代のグレコローマンやフリースタイルに加えて、文字通り無数の「ネイティブ」なレスリングがあります。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qbrxe8/why_do_people_on_reddit_get_offended_when_someone.json": "他の宗教をバカにしたコメントがたくさんあり、それらが賞を受けたり、多くのアップヴォートを受けたりするのを見ます。\nしかし、誰かがイスラム教で同じことをしようとすると、人々は彼らをダウンコートして\nイスラム教嫌いや人種差別主義者だと非難されます。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qbwnov/why_are_people_so_disgustednauseated_by_the_idea.json": "具体的には、「この話をされると吐き気がする」とか「親がセックスしているのを見たら漂白したくなる」といったものです。\nたり、親がセックスしているのを見たら目を白黒させたいと思ったりする人が\nといった方々です。\n\n私は自分の親がセックスしているところを見たくありません。\n私には、両親がセックスをしているのを見たくありません。私にとってそれは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qc0bv5/my_boyfriend_said_he_got_a_boner_just_from.json": "これは実際に起こることなのでしょうか？例えば、男の人が誰かとキスをして勃起することが本当にあるのでしょうか？\n誰かとキスをして勃起することがあるのでしょうか？(私は若くてデートするのが初めてなので、知りませんでした）。)",
  "data/reddit-ask/r/AskHistorians/comments/qbxd87/megathread_day_two_of_the_askhistorians_2021.json": "AHDC 2021の2日目にようこそ!\n\n初日の内容はお楽しみいただけましたでしょうか？ご覧になれなかったパネルは\nご覧になれなかったパネルは、YouTubeチャンネル\n[https://www.youtube.com/channel/UCJudPwztZyg2BQjhetw_bww]でご覧いただけます。\nまた、最初の3つのパネルのAMAスレッドからの質問と回答は...",
  "data/reddit-ask/r/AskWomen/comments/qbzk4x/whats_something_youve_had_to_sacrifice_for_your.json": "健全な犠牲になるか、不健全な犠牲になるか、どちらでもいいのです",
  "data/reddit-ask/r/askscience/comments/qbutvb/the_number_of_colours_a_human_can_distinguish_is.json": "引用があれば助かります、ありがとうございます :)!",
  "data/reddit-ask/r/AskHistorians/comments/qc4lkt/ive_seen_in_multiple_ww2_movies_where_soldiers.json": "例えば、映画「忘れられた戦い」では、飛行機が墜落したイギリス軍の兵士が\n墜落したイギリス兵は、カナダ軍に発見され、清掃され、食事を与えられ、カナダの制服を着せられて\nそして、カナダの制服を着せて、複数の戦闘に参加させました。\nさて、このようなことが実際に起こったと仮定すると。なぜかというと...",
  "data/reddit-ask/r/AskHistorians/comments/qbzpvm/have_any_historians_argued_that_the_war_of_1812.json": "そうでない場合は、その考えを裏付ける十分な証拠があるのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/qc1a8i/does_anyone_elses_reddit_experience_feel_like.json": "📷\n\n投稿しようと思うたびに、大人たちが感情を込めて議論しているのを聞いている子供のような気持ちになります。\n大人たちが感情的な問題を議論したり、民主的社会主義の細かい点を議論しているのを聞いている子供のような気がします。\n私は隣のテーブルで知的な質問の仕方を考えています。\n私は隣のテーブルに座って、馬鹿げた質問をするための知的な方法を考えています。つまり、それは...",
  "data/reddit-ask/r/askscience/comments/qc1jdb/ask_anything_wednesday_engineering_mathematics.json": "毎週恒例の「Ask Anything Wednesday」へようこそ！今週は\n今週は、工学、数学、コンピュータサイエンスを中心に\n\nこれらのトピックの中で、投稿する価値があるかどうかわからない質問がありますか？\n投稿する価値があるかどうかわからない質問はありませんか？典型的な/r/AskScienceの投稿にはちょっと思慮が足りないものがありますか？\nどんな質問でも構いません...",
  "data/reddit-ask/r/AskHistorians/comments/qc68h8/chesnut_trees_made_up_25_of_the_forests_in_the.json": "栗は単なるおやつではなく、1年のうちで最も重要なものだったという印象を持っています。\n一年のうちで最も重要なものです。栗の木が枯れたとき、人々は飢えたのでしょうか？栗の木はどのように\n経済や食生活の中で、栗の木はどのような存在でしたか？消えてしまったら大変なことになりますか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/qc4cqo/what_precisely_is_antitrans_and_damaging_about.json": "私はこの質問で何かを擁護したり非難したりしているわけではありません。ただ、私の場合は\n何が気に食わないのか、何が傷つくのかがわからない。\n誰かに説明してもらいたいのです。",
  "data/reddit-ask/r/askscience/comments/qcbyie/how_does_it_make_sense_to_mix_and_match_vaccines.json": "ワクチンはどれも違っていて、中には全く違う働きをするものもあると思いました。\nと思っていました。その場合、同じものを2つ用意するよりも、混合ワクチンの方が効果が低いのでは？\n同じものを2つ用意するよりも効果が低いのでは？1つのワクチンを接種するよりも効果があるのでしょうか？\n効果があるのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qcey5t/is_it_possible_to_swallow_an_indesgestible_string.json": "ずっとこの夢を見続けている......なぜだろう",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qcgldt/have_you_ever_had_a_feeling_that_somebody_was.json": "階下に住んでいたルームメイトは、コヴィドの影響で隔離されていました。彼が言うには\n軽い症状が出ていて、料理や皿洗いをしているのを見たことがあります。彼は\n昨日の朝、私たちのゴミを車道の端まで運んでくれましたが、その日の夜、彼のFacebookには\nその日の夜、彼のFacebookには10時間も活動していないと書かれていました...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qclph1/i_have_felt_racismxenophobia_from_black_people.json": "私はアメリカで生まれましたが、両親は強制送還され、私は3歳の時に連れて行かれました。\n私は大学進学のためにアメリカに戻ってきたのですが、中流階級のメキシコ人家庭に生まれ、重いメキシコ訛りがありました。\nアメリカの大学に戻ってきたんだけど、メキシコの中流階級の家庭から、重いメキシコ語のアクセントで、ミシガン州のフードに住んでいたんだ。私は親戚のガソリンスタンドで働いていました。\n親戚のガソリンスタンドで働いていたんだけど、最初の...",
  "data/reddit-ask/r/askscience/comments/qcq8nb/does_highend_hardware_cost_significantly_more_to.json": "私は、民生用ハードウェアよりもはるかに高いコア数のCPUを使用するHPCを扱っています。\n使っています。あるシステムでは、1CPUあたり64コアのAMD Zen2 7742を使用しています。\nCPUあたり64コアのAMD Zen2 7742を使用しています。1コアあたりに換算すると\nコンシューマー用のCPUと比べても、ハイエンドであってもかなり高いです。",
  "data/reddit-ask/r/AskHistorians/comments/qc80f3/why_is_australias_force_removal_of_children_with.json": "私の理解では、オーストラリアは1960年代まで先住民の子供を連れ去ることを行っていました。\n集団の子供を強制的に他の集団に移すことがジェノサイド行為と明記されていることを考えると、オーストラリアでは1960年代までは\n集団の子供を強制的に他の集団に移すことは、ジェノサイドの行為として明記されていることを考えると なぜこれが\n虐殺行為とみなされないのでしょうか？私が理解しているのは...",
  "data/reddit-ask/r/AskHistorians/comments/qcod0w/megathread_day_three_final_day_of_the.json": "楽しい時間は本当にあっという間ですね。\n\n今日がAHDC2021の最終日とは信じられませんが、私たちはカンファレンスがどのように行われたか、信じられないほど満足しています。\nカンファレンスの進行状況には大変満足しています。最初の6つのパネルは\n最初の6つのパネルでは、素晴らしい歴史家の方々による本当にエキサイティングな研究が紹介されました。\n積み上げてきたのは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qcml3v/does_the_sadness_ever_go_away.json": "大人になるということは、ただ一つの大きな悲しみの塊だと感じている人はいませんか？人生の目的とは\n人生の目的は？週に40時間以上も働いて、給料は安いし、好きでもないことをするのは\n好きでもないことをして？誰かに自分をさらけ出して、打ちのめされること？そして\n人が嘘をついて愛していると言っても、捨てられるのを聞くのか？\n\nI...",
  "data/reddit-ask/r/AskHistorians/comments/qcjujw/why_didnt_norse_explorers_introduce_old_world.json": "最近、私が注目しているのは、「バイキング・エクスプローラー」の\n探検家に注目が集まっています。\n\n様々なヨーロッパ人グループが1500年以降にアメリカ先住民と最初に接触した際の生物学的な影響については\nまた、1500年以降のアメリカ先住民との最初の接触による生物学的影響もよく知られています。その説明は\nの不足と考えられています。",
  "data/reddit-ask/r/AskHistorians/comments/qcmra6/its_now_established_fact_that_vikings_were_in.json": "また、なぜ彼らの到来によって、致命的な影響を及ぼす旧世界の病気が広がらなかったのか。\n後にスペイン人がアメリカに渡った時に起こったような、致命的な影響を与える旧世界の病気が広がらなかったのはなぜでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/qcsq1j/why_does_the_peoples_republic_of_china_often_use.json": "この質問のタイトルを何にするか決めるのも大変でした。\nしかし、中国では、政府の政策などに特定の命名法を用いることが多いことに気づきました。\n中国では、政府の政策などに特定の命名法を使うことが多いようです。\nを使っていることに気づきました。the [number] [things]\" または \"the [number] [things] and...\" です。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qcq82t/why_does_it_seem_like_reddit_turns_every.json": "ここではみんなが同質化してしまうんですよね。同じようなくだらない「Redditのユーモア」や\n妙に「どうでもいい」ことを強調したり、コメントで人に反論する傾向があったり\nコメントで人と議論する傾向があったり、自分の大切な人を「hubby」や「SO」と呼んだり、コメントチェーンでQueenの曲を引用したりと\nクイーンの曲を引用するなど.... これらはランダムな例ですが、...",
  "data/reddit-ask/r/AskHistorians/comments/qc8gff/did_the_nazis_have_any_intention_of_telling_the.json": "オスト将軍計画とホロコースト計画が完了したと仮定した場合、ヒトラーはどのような計画を立てたのでしょうか。\nホロコーストが完了した後、ナチスが絶滅させようとしたソ連の征服地にドイツ人が入植し始めると、ヒトラーはどのような計画を立てたのでしょうか？\nナチスが絶滅させようとしたソビエト連邦の征服地にドイツ人が入植し始めたら、ヒトラーはどのような計画を立てたのでしょうか？彼は\nもし、将来のドイツ人入植者たちが...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qctkcr/what_did_dave_chappelle_do.json": "なぜ人々はDave Chappelleに怒っているのか？Googleで調べたところ、彼はコメディアンだということしかわかりませんでした。\nコメディアンです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qcud1g/do_you_think_prostitution_should_be_legal.json": "私は合法であるべきだと思います。",
  "data/reddit-ask/r/AskHistorians/comments/qcx8f9/hitler_was_an_artist_mussolini_was_a.json": "ロバート・O・パクストンの『ファシズムの解剖』を読んでいて知ったのですが、以前は\nムッソリーニは学校の先生をしていました。私が最初に思ったのは、元学生であることを想像して\n彼が独裁者になるまでの元生徒を想像してみてください。それは私にとって奇妙な体験でした。\n奇妙な体験をしたものだと思いました。次に考えたのは、「もしかしたら...」ということです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qczez2/should_there_be_an_upper_age_limit_for_government.json": "ジョー・バイデン、ドナルド・トランプ、ナンシー・ペロシ、バーニー・サンダース、エリザベス・ウォーレン、ミッチ\nマッコンネル、ジャネット・イエレン、ジョー・マンチンなどは70歳を超えていますが、これらは私が知っているだけでも\nこれは私が知っている限りの話です。\n\nアメリカ国民のために、彼らは全員退陣すべきだと思います。\nそれ以上の年齢の人は...",
  "data/reddit-ask/r/AskHistorians/comments/qczecp/why_are_torture_chambers_so_damn_common_in.json": "誓って言うが、私は何十もの様々な「拷問室」（多くの場合、実際にはなかった拷問のための装置を詰め込んだだけの部屋）に出会ってきた。\n実際には使われていない拷問器具を詰め込んだだけの部屋）に何十回も遭遇している。)\nヨーロッパの多くの都市や国で、様々な「拷問室」（多くの場合、実際には使われていない拷問器具が詰め込まれただけの部屋）に出会ってきたが、それらはすべて同じような条件を満たしている。\n不正確な日付、死んだ目をしたダミー、生き生きとした描写...。",
  "data/reddit-ask/r/AskWomen/comments/qd2g5l/how_often_do_you_ladies_deal_with_sexism.json": "卵巣を持っていて政治的発言をしたことで殺されればいいと言った人がいました。\n政治家として発言したことで殺されればいいと 私は5つの言葉しか言っていないのに。他には？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qd7d06/do_guys_wipe_their_penis_heads_after_peeing.json": "聞くのは馬鹿げているかもしれませんが、私は友人が振っているのを見たことがあるだけで、女性としては\n女性としては、細菌のために拭いたりしますよね（イースト菌感染やUTIのリスク）。\n誰か説明してください...。",
  "data/reddit-ask/r/AskHistorians/comments/qd66ds/why_did_humans_stop_using_atlatl.json": "槍投げ→アトラートル→アーチェリーと進んでいったのはわかりますが\nなぜアトラートルは維持されなかったのか？特に戦場では？ローマ人のように\n槍や弓を使っていましたが、もし弓と投げ槍を組み合わせていたら、どれだけの被害が出たでしょうか？\n弓術とマンモスを倒すための投げ槍を組み合わせていたら、どれだけの被害が出たか...。",
  "data/reddit-ask/r/AskWomen/comments/qcvw3a/have_you_ever_feared_losing_control_how_did_you.json": "この言葉を見て、知り合いの女性たちが共感してくれました。あなたはどのようにして\nコントロールを失う」という不安にどのように対処していますか？それはどこから来るのだと思いますか？\n\n「私がこれまでに出会ったほとんどすべての女性は、自分は狂気の淵にいるのだという秘密の信念を持っている。\n自分の中には深くて狂った部分があると密かに信じています。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qd7hd8/why_does_the_us_politics_subreddit_appear_to_be.json": "このサブレディットは非常に一方的で、反共和党や反保守主義者のためのエコーチャンバーのように見えます。\n反共和党や反保守的なレトリックのエコーチェンバーのようです。政治サブレディットは、政治の両サイドのためのオープンで文化的な議論のためにあるべきです。\n政治サブレディットは、政治的スペクトラムの両サイドのためのオープンで市民的な議論のためのものであるべきです。",
  "data/reddit-ask/r/askphilosophy/comments/qcxu70/if_karl_marx_isnt_making_moral_claims_about.json": "マルクスをはじめとする社会主義の理論家たちは、自分たちの思想が道徳的な善悪に染まることを望んでいないことは承知しています。\nしかし、マルクスや他の人々が、搾取や地主は寄生虫であると語るとき、彼らは実際に何を意味しているのでしょうか？\n搾取だとか、地主は寄生虫だとかを語るとき、それが道徳的でないなら、彼らは実際に何を意味しているのでしょうか？\n道徳的ではない",
  "data/reddit-ask/r/NoStupidQuestions/comments/qd6y6k/does_anyone_actually_want_a_folding_screen_phone.json": "私にとって、折りたたみ式の画面を持つ携帯電話は、全体的に馬鹿げたアイデアのように思えますが\n私は折り畳み式でない携帯電話で十分満足しています。純粋に実用的な観点からすると\n純粋に実用的な観点から言えば、ひび割れなどの問題が発生しやすくなります。彼らは\n売れていますか？持っている人を知っていますか？それとも、ただのマーケティングなのか...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qdbm31/do_people_actually_not_pick_their_nose.json": "やらないわけにはいかないようです。息ができなくなるほどの\nブーガーで息ができなくなる。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qd9pld/every_time_i_put_in_both_earbuds_and_cant_hear.json": "足音や誰かに肩を叩かれているような幻覚を見て、すぐにイヤホンを引き抜いた。\nすぐにイヤホンを外した。なぜ私の脳はこんなことをするのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/qdabji/how_did_19th_century_dickensianera_londoners_keep.json": "私がこの質問をしたのは、「伝統的な」スーツやアウターコートの色が黒であることを知ったからです。\n汚れを隠すために黒を着ていたという伝説があるからです。\n汚れを隠すために黒い服を着ていたという伝説があるからです。それを聞いて、たとえその神話が間違っていたとしても......と思いました。\n顔や手などの露出している部分が...",
  "data/reddit-ask/r/askscience/comments/qdbx6r/did_theia_actually_smash_into_the_earth_or_is.json": "月（ルナ）がどのようにしてできたかについての主な説は、火星サイズの原始惑星「テイア」が\nテイアと呼ばれる火星サイズの原始惑星が別の原始惑星と衝突し、その際に放出されたものが合体して月になったというのが主な説です。\n月ができたという説です。しかし、テイアのすべてが月になったわけではなく、火星の質量は\n火星の質量は6.39e23、月の質量はその10倍以上ですし...。",
  "data/reddit-ask/r/AskHistorians/comments/qdgri3/what_did_muslim_historians_during_the_golden_age.json": "中世のイスラムの思想家たちが古代ギリシャの哲学に影響を受けたことは知っていますが\n中世イスラムの思想家たちが古代ギリシャの哲学に影響を受けたことは知っていますが、彼らはそれに先立つグレコ・ローマンの哲学も学んだのでしょうか？\nもしそうであれば、彼らはそれらをどのように考えたのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/qdevw0/at_sports_events_when_they_put_a_kiss_cam_on_the.json": "誰かが人に聞きに行くのか、それともどうでもいいことなのか。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qdhmcw/do_other_languages_have_alphabet_songs.json": "私は息子にABCを歌っているのですが、他の言語にも子供が文字を覚えるための独自の歌があるのでしょうか？\n他の言語にも文字を覚えるための歌があるのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qdi3wq/is_all_of_adulthood_just_living_in_misery.json": "私は21歳なので、大人になるのは初めてだと思います。でも、この先のことを考えると\n暗い気持ちになります。そして、ほとんどの人が同じように感じているようです。私の同僚は、自殺協定をネタにしています。\n私の同僚は自殺行為を冗談にして、人生がいかに悲惨かをいつも話しています。\n誰もが橋から飛び降りることをいつも「冗談」にしているようです....",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qdh7gy/is_it_ok_to_have_a_quick_glance_at_a_womens_chest.json": "私の友人の女性たちは、「おっぱいがきれいに見える」服を好んで着ています。\nい服を着たがる女友達がいます。見た目がよければ、チェックしてもいいのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/qdj0k8/i_had_a_strange_urge_to_jiggle_my_gfs_belly_fat.json": "どうすれば、彼女が自意識過剰でなくなるのか？抱き合っている時にお腹を触ると嫌がるようになりました。\nもう数ヶ月になりますが、抱き合っている時にお腹を触ると嫌がります。\n\n編集：ちなみに彼女も太ってはいません。\n可愛いと思って掴んだり揉んだりしていますが、もしかしたらそれは...。",
  "data/reddit-ask/r/AskWomen/comments/qdja2j/which_conventionally_attractive_features_arent.json": "例：背が高い、背が高い、教養がある",
  "data/reddit-ask/r/NoStupidQuestions/comments/qdhkca/why_do_filming_productions_not_use_entirely_fake.json": "アレック・ボールドウィンに起こったことを考えると、（私は被害者とその家族に同情します。\n人を傷つける可能性のある銃をなぜ使うのだろうか？\n使うのか？フェイクを全部使って、音とかも全部ポストで付ければいい。私たちは\n今はCGIが簡単に手に入る時代です。きっと、そんなことはないんだろうけど...。",
  "data/reddit-ask/r/askscience/comments/qdku0a/the_extended_warm_period_during_the_boring.json": "億分の1時代の地球の気温は、現在よりも約4℃高かった。\n温室効果ガスの濃度が高かったためです。科学者たちは、CO2\n海洋酸性化の証拠がないため、科学者たちはCO2を原因と断定している。メタンは\nメタンも生物起源のものであり、メタン菌によるものであることから除外されました。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qdieu8/do_we_really_need_to_represent_every_race_in.json": "最近、「『ハリー・ポッター』は私のようなインド人の子供を代表するチャンスがあった」という記事を見ました。\n私のようなインドの子供たちを表現するチャンスがあったのに...。\". どんな種類のメディアでも、誰もが表現を必要としているのでしょうか？I\n私はアメリカの映画やイギリスの映画を見ますし、Netflixの番組では「イカのゲーム」を見ます。\n私はアメリカの映画もイギリスの映画も、Netflixのゲームも見ますが、その中に誰かが含まれていても気になりません...",
  "data/reddit-ask/r/AskWomen/comments/qdllqg/would_you_go_to_an_allfemale_club_night_and_why.json": "ナイトクラブは楽しいものですが、多くの女性にとっては居心地の悪い環境でもあります。\n女性にとっては不快な環境であることもあります。\n\nもし、バーやナイトクラブで女性限定のイベントがあったら、あなたはそこに行きますか？\nバーやナイトクラブで、女性だけを対象としたイベントがあったら、あなたはそこに行きますか？他の多くの女性がそこに行きたいと思うでしょうか？\n他の多くの女性がそこに行きたいと思いますか？",
  "data/reddit-ask/r/AskHistorians/comments/qdimt4/the_average_inaugural_age_of_us_presidents_has.json": "EDIT: 興味深いことに、大統領になった5人のFounding Fathersの中では\n興味深いことに、大統領になった5人の建国の父の平均就任年齢は、さらに高い（約58歳と8ヶ月\nヶ月）となっています。)",
  "data/reddit-ask/r/AskHistorians/comments/qdmyih/why_was_mongolias_request_to_join_the_ussr.json": "この質問をしたu/rnsei [/u/rnsei]さんのおかげで、ある左101\nサブでこの質問をしましたが、回答はありませんでした。こんなことがあるとは知りませんでした。なぜ\nなぜモンゴルは歓迎されないのか？目的は共産主義を世界に広めることだったのではないでしょうか？\n世界に共産主義を広めることが目的なのでは？もっと地政学的なニュアンスがあったのでは......。",
  "data/reddit-ask/r/AskHistorians/comments/qdhahk/are_or_were_german_historians_pressured_to_avoid.json": "最近読んだドイツの記事1では、著者が次のように述べています。\nドイツの歴史家の間では、「」という言葉を使わなければならないという非公式なルールがあると述べています。\nドイツの歴史家の間では、ナチスについて語るときには「Nationalsozialismus」（国家社会主義）という言葉を使わなければならないという非公式なルールがあり、そのルールを破って\nそのルールを破って他の用語を使う者は...",
  "data/reddit-ask/r/AskHistorians/comments/qdzeai/meta_impact_of_this_subreddit.json": "今日は質問がありません。\n\nr/AskHistorians [/r/AskHistorians]を10年近く購読しています。I\n自分では思いつかないような質問にも、素晴らしい答えが返ってきます。\n毎週のように、なぜ私がこんなにも歴史が好きなのかを思い出させてくれるような、よくできた答えに出会います。\n歴史が大好きな理由を思い出させてくれます。\n\n8...",
  "data/reddit-ask/r/NoStupidQuestions/comments/qdynd7/anyone_else_feel_horrible_for_alec_baldwin.json": "撮影現場の誰もが経験していることを想像することはできませんが、彼はきちんとした人のようです。\nしかし、彼は善良な人のようで、私はただ彼に同情しています。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qdxteu/how_do_i_flirt_with_a_guy.json": "私は女の子で、この人に片思いをしているのですが、彼にもっと私のことを気にかけてもらいたいのです。\nと思っています。どうしたら彼とイチャイチャできますか？私は今まで恋愛をしたことがありませんし、重要な人とイチャイチャしたこともありません。\n今まで大切な人と付き合ったり、イチャイチャしたことがないので、それを壊したくありません。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qdzljq/would_it_be_weird_to_name_my_first_child_after_a.json": "聞くことを恐れているわけではなく、ただ興味があるだけで、誰にも相談できないのです。\n私の妻は第一子を妊娠中（妊娠3ヶ月ほど）で、もし女の子だったら\n名前は「カイリ」にしようと決めています。私はキングダムハーツが大好きです。\nキングダムハーツとストーリーが大好きで、それはただの...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qe26st/are_there_people_that_actually_have_0_friends.json": "時々、コメント欄に「私には友達がいません」と書いてある人がいます。本当なのか嘘なのかわからない\n本当かどうかわかりませんでした。人生の中で少なくとも1人の友人がいないというのは考えにくいことです。\n人生で1人も友達がいないなんて考えられませんよね。私自身は内向的で、わざわざ人と付き合って友達を作るようなことはしません。\n私自身は内向的で、わざわざ人付き合いをして友達を作ることはありませんが、それでも昔知り合った親しい友人がいます...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qe2wfe/is_the_nword_used_outside_the_united_states_is_it.json": "こんにちは。\n\n私はインド出身ですが、N-Wordはどこの国でも不快なものだと思っていました。\nと思っていました。しかし、アメリカ以外で使われているのを見たことがありません。親切に\n教えてください。\n\n追伸：誰かを怒らせるつもりはなく、ただ興味があるだけです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qdvsd8/why_do_some_women_have_the_audacity_to.json": "これは、r/ActualPublicFreakoutsのようなサブレディットで誰もが見たことがあるものです。\n[/r/ActualPublicFreakouts]などで紹介されています。男と女が\n男と女が何かについて言い争っているとき、（どんな状況であっても\n男と女が口論をしていると、女はエスカレートして物理的に...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qe35wq/why_are_americans_accepting_the_2party_system.json": "私はEUの国から来たのですが、そこでは数多くの異なる政党が存在しています。\n私はEUの国から来ましたが、そこでは多数の異なる政党に投票することができます。\n多くの異なる意見などが代表されているので、私にとってはとても意味のあることです。しかし、アメリカのシステムでは、民主党と共和党の2つの政党しかありません。\n民主党と共和党の2つの政党しかありません。300人以上の国民がいる国なのに",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qe4p92/i_dont_feel_sexually_assaulted_but_i_am.json": "常に触れられているというのは、抱っこやおんぶのことではありません。つまり、先日\n私は指で触られているところで目が覚めたのですが、彼は文字通り眠っていました。これはいつもではなく\nいつもではなく、今はとても頻繁に起こっています。これでは、私にとって\n安眠できません。これは誰にでも起こることなのでしょうか...。",
  "data/reddit-ask/r/askscience/comments/qe65vo/have_there_been_any_attempts_to_build_a_solid.json": "小型の固体ロケットモーターの用途はたくさんありそうですね。\n0％から100％、あるいはそれ以上の出力が可能な小型固体ロケットモーターには多くの用途がありそうです。\n\nサイズ的にはJATOロケットのようなものを想像しています。\n実現しているものを想像しています。\n\nそれは、例えば破壊するためのメカニズムのような単純なものかもしれませんが...。",
  "data/reddit-ask/r/AskHistorians/comments/qdxwq8/hours_after_the_911_attacks_the_secretary_of.json": "これは、シンクタンク「新アメリカ世紀プロジェクト」への参加と関係があったのでしょうか。\nシンクタンク「アメリカ新世紀プロジェクト」との関係は？",
  "data/reddit-ask/r/askscience/comments/qe0a7w/why_do_some_people_whove_recovered_from_covid19.json": "私の免疫に関する基本的な理解は、初めてウイルスに感染したとき、免疫システムが抗体を作り、ウイルスを中和します。\n免疫システムが抗体を作り、それがウイルスを中和し、その抗体が\nその抗体はその後も血流に残ります。その後、ウイルスが再感染した場合\n抗体はすでにそこにあって、ウイルスを中和する準備ができている...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qe3vqi/why_cant_1820_yo_drink_if_theyre_considered.json": "なぜ18歳（19歳、20歳も）が結婚して子供を持ち、経済的に完全に自立して一人暮らしができるのか、私には理解できません。\n結婚し、子供を持ち、経済的に完全に自立し、一人暮らしをし、収益性のある（または収益性のない）ビジネスを始め、家を買う。\n儲かる（儲からない）ビジネスを始めたり、家を買ったり、車を運転したり、大人になるためのほぼすべての要素を備えています。\n大人になるためのほぼすべての面で。しかし、彼らは自分の家を買うことができません...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qeazhe/how_weirdcreepy_would_it_be_for_a_grown_man_in.json": "私には仕事も家もあります。オリジナルのパッケージに入ったビニール製のポップスとかではありません。\n包装されたものではありません。つまり、1ドルショップの恐竜や戦車やお城のことです。私はずっと\n息苦しさや創造性のなさを感じています。アクションフィギュアやおもちゃを持っていて\n心の中で冒険したいと思っています。私はそれがもしかしたら助けになるかもしれないと思います...",
  "data/reddit-ask/r/AskHistorians/comments/qe5xaf/according_to_wikipedia_katherine_stieglitz_was.json": "最近、彼女の父親であるアルフレッド・スティーグリッツについての本を読んでいて、彼女についての記述を見つけました。\nStieglitzについて読んでいて、彼女が48年間も施設に収容されていたことを知ってショックを受けました。ウィキペディアの\nウィキペディアの記事には何も書かれていませんでしたが、時代的に考えて、おそらくロボトミー手術によって\nロボトミー手術で自分の世話ができなくなったのではないかと...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qe97uy/why_is_kanye_regarded_as_a_lyrical_genius_what.json": "私はカニエや彼のファンに悪意はありませんし、彼の音楽（StrongerとPowerの激しい叩き合い）のサウンドは支持できます。\n彼の音楽のサウンド（StrongerとPower slap hard）には賛同できますが、歌詞が......なぜそんなに良いと思われているのか、理解できません。\nなぜ良いとされているのか理解できません。正直なところ、多くの歌詞は、ブランド崇拝の嵐のように感じられます。\n正直なところ、多くの歌詞はブランド崇拝、自己顕示欲の嵐のように感じられ、全く...",
  "data/reddit-ask/r/NoStupidQuestions/comments/qeeh5r/am_i_weird_for_changing_my_socks_everyday.json": "今日の朝、娘と彼女と会話していたら\n私が毎日靴下を履き替えていることが、なぜか娘の口から語られました。\n\n私のガールフレンドはこれに驚き、彼女も私の娘も毎日靴下を変えていないと思っていたようです。\n毎日靴下を履き替えることはないはずです。私はここでは変な人なのでしょうか？\n\nもし、私が...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qeerrh/19m_i_constantly_feel_like_i_want_to_end_my_life.json": "タイトル通り、私は普通の生活をしていて、家族も友人もいます。\n誰もがそうであるように、時には孤独を感じます。でも、時々、突然不機嫌になったり\nいきなりやる気をなくしてしまうことがあります。すべてが順調に進んでいたとしても、ほんの数秒のうちに\n数秒後には絶望感に襲われて...。",
  "data/reddit-ask/r/AskHistorians/comments/qee4hd/why_are_there_so_few_indigenous_peoples_in_europe.json": "北極圏には、指定された先住民族が多数存在することを知っています。\n例えば、サーミの人々です。\n\nしかし、なぜ他のグループが先住民族とみなされないのか、私にはよくわかりません。\n例えば、ゲール語系の島民やハイランダー、アイルランド人、アルバニア人、バスク人などです。これらの多くは\nこれらの多くは先住民族の特徴を持っていますが...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qekoug/would_you_enter_a_relationship_with_someone_who.json": "全部ソロでやってるって言って セックステープは出しません。会うことは禁止されています。\nサイトでの出会いは禁止です。感情は一切ありません。肉体的なものは一切ありません。あなたには\nあなたの地域や国の誰にも知られないように、すべての場所をブロックすることができます。\n見つけることができます。儲かるし、いろいろおごってもらえる....",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qel099/is_it_a_douchebag_move_to_not_want_a_relationship.json": "声をかけないのは失礼だと思います。会えば手を振ったり、笑顔を見せたりしますが\nしかし、一緒に食事をしたり、家で試合を見たりしたいとは思いません。\n彼らの家でゲームを見たいとは思わない。ご存知の通り、私は世界で最も社交的な男ではありません。私は\nこの質問をするのが怖いのは、誰もがそうすると思われるからです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qemxoo/guys_did_you_ever_had_sex_with_a_girl_on_her.json": "生理中にセックスすることは、生理痛を和らげるだけでなく、パートナーを助けることにもなりますよね。\nそれとも完全に拒否したのですか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qekrf6/why_is_racism_towards_south_asian_people_not.json": "私は南アジア（インド）出身の女性ですが、インターネット上で多くのカジュアルな人種差別を経験してきました。\n私は南アジア（インド）の女性ですが、インターネット上で多くのカジュアルな人種差別を経験してきました。\nかなりハードで、誰もこれを取り上げていないようですが！？テレビシリーズなどでも、このことについて少しも触れられていません。\nテレビシリーズか何かで、このことについて少しでも触れていないのは、せめてもの救いです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qenzhb/why_does_tv_and_movie_representation_matter_so.json": "私は黒人ですが、これはいつも疑問に思っていたことです。\n\n私は映画やテレビ番組をよく見ていますが、白人の洗脳や全体的な表現の言説とは無縁だと感じていました。\n私は映画やテレビ番組をよく見ますが、そのようなメディア作品の中で、白人の洗脳や、黒人や他の民族、文化的な表現が全体的に不足しているという言説に、私はつながりを感じませんでした。\n私は映画やテレビ番組をよく見ていますが、白人洗脳の言説や、そうしたメディア作品に黒人やその他の民族、文化的な表現が全体的に欠けていることには、全く関係を感じませんでした。私はいつもこのように感じていました。\na...",
  "data/reddit-ask/r/NoStupidQuestions/comments/qekf28/when_girls_squirt_thats_just_pee_right.json": "答えは明白だと思うので、自分でも信じられないのですが......。\n誰も明確な答えを言ってくれないような気がします。\n\n真面目な話、もしそれがおしっこではないとしたら......それは何なのか？\n\nこの液体はどこに保持されているのでしょうか？\n\nこの液体を満タンにして歩いている女性はいるのでしょうか？\n彼女たちは一度も \"潮吹き \"したことがないから...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qer7gt/how_do_i_tell_an_unsympathetic_manager_i_cant.json": "明日、愛犬を安楽死させることを決定しました。\n\n私は仕事をしなければならないのですが、明らかにできません。上司は気にしません。\n去年、他の人がこのような状況になったことを覚えています。\n嘲笑していました）。) すでに若干の人手不足です。\n\nどうか、私を助けてください。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qernx1/do_parents_who_dont_allow_the_opposite_sex_inside.json": "最近、redditでこのことについてのミームを見て、このルールについて聞いたことがありました。\n親が決めたこのルールについては聞いたことがありました。女の子の友達が家に来たときは、いつも私の部屋に行っています。\nいつも私の部屋に行くのですが、親はそのことについて何も言わなかったです。\n私の両親は何も言わなかった。私の友達の親は誰もそんなルールを持っていません...。",
  "data/reddit-ask/r/askscience/comments/qeolk9/what_is_the_current_accepted_risk_of_covid19.json": "前にも聞かれたことがあると思うので先に謝っておきます。\nもし誰かが教えてくれるならば、少しでも明確にしたいと思います。私が読んだのは\n[今年の初めに発表されたCDCのアップデートを読みました。\n主に呼吸器系の飛沫を介して感染し、表面には出てきません。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qet3mu/when_does_the_adult_kick_in.json": "私は26歳で、2人の子供（3歳と6歳）と、住宅ローンを抱えています。私はまだ大学を卒業していませんが\n私はまだ大学を卒業していませんが、結婚しています。自分の健康保険にも加入している。\n車の保険、電話のプラン...。私はかなり大人ですよね？でも、そうは思えません。\n息子の学校の他の親たちを見ていると、そうは思えないのです。彼らはそれを持っている...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qesh2q/does_everyone_think_christians_are_just_dumb.json": "キリスト教を悪いタイプのもののように語る人を見たことがあります。\n世界で最も悪いタイプの人々のようにキリスト教を語る人を見たことがありますが、それはどういうことなのでしょうか。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qeuo79/is_it_bad_that_im_18_feel_far_closer_to_being_a.json": "私のような年齢の人は、大人になってから行動しないといけないと言われ続けています。\nと言われ続けてきました。しかし、正直なところ、私は大人になったとは全く思っていませんし、大人のように振る舞うのは\n何かについて真剣に話し合う必要があるときだけです。全体的に見て、私はまだ\n私はまだ何も知らない子供のように感じていて、完全には...",
  "data/reddit-ask/r/AskHistorians/comments/qeve3z/was_the_red_army_better_at_selfreflection_than.json": "一般の人々の（過度に単純化された）ステレオタイプは、ドイツ国防軍は非常に有能でプロフェッショナルであったのに対し、ソ連では軍事的革新が妨げられていたというものです。\nソ連ではスターリンの粛清によって軍事的革新が妨げられていたのに対し\nスターリンの粛清によって軍事的革新が妨げられた。\n\nしかし、42年から3年にかけてのウクライナでの作戦に関するプリット・ブッターの著書を読むと、（彼によると）私は次のような印象を受ける。\n彼によれば）いかに厳密に...",
  "data/reddit-ask/r/AskWomen/comments/qeccew/what_do_you_think_about_marriage.json": "あなたが考える健全な結婚とは何ですか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qer9uk/how_does_me_being_vaccinated_impact_other_people.json": "皆さん、こんにちは。\n\n私は1回目の投与を受け、明日2回目の投与を受ける予定です。これは私にとって個人的な決断であり\n私は若くて健康ですが（最も危険な状態ではありません）、これは個人的な決断で、実行することにしました。\n最も危険なグループではありません）。)\n\nしかし、予防接種を受けないことは自分勝手だという意見を右から左へと聞いてきました。\nワクチンを打たないのは自分勝手だという意見を耳にすることがありますが...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qepx4x/is_it_just_me_or_do_breasts_and_butts_look_better.json": "さらに、肌の色に縛られている間に、服の色の選択肢が増えて楽しい。\nヌードになると",
  "data/reddit-ask/r/AskWomen/comments/qext5u/whats_that_one_fetish_you_really_dont_want_to.json": "純粋に合法的なものについてです（当然ながら、誰も違法なものを見つけたいとは思っていません）。\nどうしても見たくないp*rnhubの検索は何ですか？",
  "data/reddit-ask/r/AskHistorians/comments/qezg92/are_there_any_notable_nude_statues_from_greek_and.json": "大理石の塊を買って、正統派の古典彫刻の偽物を作ろうと考えています。\n古典彫刻の偽物を作ろうと思っています。多少、女性の形に落ち着きました。\nアイデアや参考にするために、古典、ルネッサンス、現代の彫像をよく見ています。\nアイデアや参考にするために、古典やルネッサンス、現代の彫像を見て過ごしています。一つは...",
  "data/reddit-ask/r/NoStupidQuestions/comments/qexhhn/some_friends_from_the_us_are_coming_to_visit_me.json": "例えば、ヨーロッパやヨーロッパ人、おそらく北欧人に対するステレオタイプはありますか？\n私が10点にしてもいいくらいです。あるいは、私が嘘をついても信じてもらえるような\n信じてもらえますか？\n\n私が考えているのは、おもちゃの銃をプレゼントされて、アメリカに着いたときに\nアメリカに着いてから「これは伝統なんだ」と言われるのとは逆のことを考えています。",
  "data/reddit-ask/r/AskHistorians/comments/qet2v0/why_was_roman_catholicism_such_a_trend_among_the.json": "私の主な情報源はオーウェルで、彼は定期的にカトリックへの改宗に言及しています。\nイギリスの知識人の間では、カトリックへの改宗がトレンドになっていると定期的に言及し、カトリックの改宗者と共産主義者を比較しています。\nカトリックへの改宗者と共産主義者の比較をしています。ウィガン埠頭への道 \"からのいくつかの例\n\n\"彼は、5年後には...若々しいスノッブ・ボルシェビキのどちらかだ。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qf14a7/does_anyone_else_think_of_or_reference_the_movie.json": "映画の中で、お天気キャスターか何かのタレントが、いつも「B」と言うシーンがある。\n彼はいつも「B-E-A-Utiful」という言葉を口にします。何らかの理由でスペルが必要になったときには\n何らかの理由でスペルが必要になったとき、私はいつもそのシーンを参照しながら\nそうです。これは私だけでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/qf297q/is_it_normal_that_i_look_forward_to.json": "一人の時間があって、やりたいことができる唯一の時間なんです。\n暗闇の中でYouTubeの動画を見たり、とにかく一人になれる。その時間を毎日楽しみにしているのは、普通のことでしょうか？\nその時間を毎日楽しみにしているのは普通のことでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/qeqsqa/does_anyone_else_talk_to_themselves_as_if_theyre.json": "私は常に大声でCan you just shut up to myself upと言っています。\n変なことや悲しいことを考えているときに 誰かこのようなことをしている人がいないかと思っていました。私も\nなぜそんなに眠いんだ？",
  "data/reddit-ask/r/AskHistorians/comments/qerk4l/when_do_we_consider_something_colonization_and.json": "これは私が以前から考えていたことです。\n植民地化について授業で議論していて、ずっと考えていたことです。私たちは通常、アメリカの西への進出を植民地化とは見ていません。\n第二次世界大戦でドイツが東進したのと同じように、アメリカの西進は植民地化ではなく、領土の拡大だと考えます。\n第二次世界大戦でドイツが東に向かって突き進んだのと同じです。では、具体的にどのような...",
  "data/reddit-ask/r/NoStupidQuestions/comments/qf7nxf/wtf_are_you_supposed_you_do_when_people_sing_you.json": "私は現在42歳ですが、ずっと気まずい思いをしています。それは私に\n体が痛くなります。",
  "data/reddit-ask/r/askscience/comments/qf7z2r/how_do_we_actually_know_the_number_of_protons_in.json": "各元素の原子番号がどのような方法で発見されたのか気になるところです。\n発見されました。そこまで見える顕微鏡は当然ありませんからね。\n直接目で見て分かるものではないことは明らかですが、検索エンジンで調べてもなかなか良い答えが見つかりません。\n検索してもなかなか良い答えが見つかりません。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qf6qk4/if_nonbinary_means_you_dont_identify_as_female_or.json": "失礼なタイトルになってしまったら申し訳ないのですが、このことを考えて、Googleで調べてみると\nGoogleで調べてみたら、ちょっと困ったことになりました。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qfda9q/why_do_girls_on_dating_apps_mention_not_liking.json": "いい趣味だと思いますが、釣りのどこが悪いのでしょうか？単に動物を捕まえる/狩ることに関連したものが好きではないということでしょうか？\n動物を捕まえること、狩ることが好きではないということでしょうか？菜食主義者ばかりではないでしょう。\nだろうか？それとも、そういうことをする人は保守的だと思われているのでしょうか？どちらにしても\nどちらにしても、女の子は自分の...を気にしないような気がします。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qfge54/is_saying_blue_lives_matter_racist.json": "私はこの問題についてあまり詳しくありませんが、私の学校では、ある子供が石にblue lives matterと書いていました。\nmatter」と書いた岩がありました。その後、私の学校の誰かが「人種差別主義者を暴く」というアカウントを作りました。\n誰がそんなことをしたのかを発表する予定です。でも、blue lives matterと言うのは人種差別なのか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/qfdgol/why_would_you_not_go_back_in_time_to_live_in.json": "ネット上には80年代をロマンティックに表現する部分が多くあります。そうでない人はどうでしょうか？\nそうでない人は？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qewqpk/why_do_some_parents_tease_their_kids_for_talking.json": "子供の頃に買ってもらった記憶があります。小学生の時には\n女の子の友達の話をしていました。親が「お前は小柄だな」とか\n\"お前には小さな彼女がいるようだな \"とかね。\n\nとか言ってからかっていました。絶対にそれが原因で何かの\n不安になったりして...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qfelvo/why_can_cats_be_violent_but_dogs_cant.json": "犬は噛まれてもほとんど血が出ないので処分しますが、猫は噛まれると\n飼い主を血が出るほど引っ掻いたり噛んだりしているのを見たことがあります。\n笑われてしまう。なぜだろう？",
  "data/reddit-ask/r/AskHistorians/comments/qfg7us/did_the_us_actually_honor_any_of_the_treaties_it.json": "ネイティブアメリカンの部族・民族・グループに関するアメリカの歴史についての私の理解は\nの部族・民族・グループは、一般的に次のようなパターンであったと思います。\n\n 1. アメリカとある部族や国との間で条約が結ばれ、国境を設定したり\n    アメリカと部族や国との間で、国境を設定したり、お互いに土地の特定の部分を所有する権利があることを宣言したりする。\n\n 2. 白人...",
  "data/reddit-ask/r/askscience/comments/qfbzwh/what_is_the_meaning_when_people_say_9999_the.json": "この言葉はよく耳にしますが、私にはあまり意味がありません。\n\n光の速度は大きな数字なので、その最後の0.01%で多くのことが変わると思います。\n光速は大きな数字ですから、その最後の0.01%の間に多くのことが変化すると思いますが、その変化が起こるときに何か他の重要なことが起こるのでしょうか？\n\nまた、質量のあるものを速度cまで加速させるためには、...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qfgk49/normal_to_think_of_ex_even_if_broken_up_for_two.json": "別れてもう何年も経ちますが、今でも毎日のように思い出すことがあります。私は他の人に移ったし\n私は他の人に移ったし、彼女もそうだと思いますが、まだ彼女のことが頭から離れません。\n非常にランダムですが、お祭りに行く夢を見て、振り向くと彼女が私をすぐに見ていました。\n振り向くと彼女が私を見ていました。これで目が覚めました...。",
  "data/reddit-ask/r/AskHistorians/comments/qfjh6o/most_americans_learn_about_the_pilgrims_and.json": "もっともらしい政治的動機を考えるのは難しいことではありません - ピルグリムが宗教の自由を求めたのは、より象徴的なことです。\n信仰の自由を求める巡礼者たちの姿は、奴隷や年季奉公人の労働力を利用した商業的な事業よりも共感を呼ぶものです。\n特に政治的なリベラル派にとっては。しかし\n実際のところ、アメリカの学校の子供たちは、ピルグリムについて学んでいるのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qfnja3/why_isnt_it_wrong_for_people_in_extreme_poverty.json": "私は純粋に理解できません。私が言っているのは、通常の貧困状態にある人々のことではありません。\n私が言っているのは、子供を食べさせ、着せ、教育することができる通常の貧困状態にある人々のことではありません。\n私が言っているのは、通常の貧困状態にあり、子供を養い、服を着せ、教育を受けさせることができる人々のことではありません。\nつまり、逃れられないような貧困の中にいて、自分自身を養うことさえできない人々です。\n\nなぜ私たちは、このような状況を擁護するのでしょうか...",
  "data/reddit-ask/r/askscience/comments/qfjibo/does_the_rainfall_from_onceinalifetime_storms.json": "昨日、カリフォルニア州を襲った爆弾サイクロンは、各地で記録的な大雨を降らせました。\n記録的な大雨となりました。疑問なのは、この記録的な降雨が、平均的な降雨量が多い年に比べて\nこの記録的な雨は、平均以上の雨が降った年と同じように、全体の干ばつ状態に有益なのかどうか。\n疑問なのは、この記録的な降雨は、数ヶ月にわたって平均以上の降雨があった年と同じように、全体的な干ばつ状態に有益なのかということです。例えば、この水は...",
  "data/reddit-ask/r/AskHistorians/comments/qfil9k/how_did_societies_that_were_primarily_nomadic.json": "歴史上、遊牧民の社会は数多く存在しており、その多くが\n金属製の武器を使っていたようです。その武器はどこで手に入れたのでしょうか？簡単な鍛冶屋や製錬所なら、なんとか梱包して運ぶことができるかもしれません。\n簡単な鍛冶屋や製錬所なら、なんとか梱包して移動できそうだが、鉱山となるとそうはいかない。\n鉱山ではない。\n\n鉱床の周りに定住地があったのだろうか...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qfsg27/do_men_judge_what_a_womans_labia_look_like.json": "私は性行為をしたことがありませんが、AVをたくさん見てきたので、私の大陰唇は以下のように見えます。\n私の大陰唇はそれらのビデオで見たものとは全く違います。\n\nセックスが何であるかを知らなかった少女時代にも、次のように考えていました。\n私の体は凸凹していて、片方の「唇」（震え声）は大きくてフリフリしていて、突き出ている。\nもう片方の唇は...。",
  "data/reddit-ask/r/askscience/comments/qfftk6/are_there_any_avian_species_that_havent_evolved.json": "ヒクイドリが紀元前60年頃に出現したことは知っていますが、それよりも遡って、できればチクシュルブ以前に出現した鳥類をご存知でしょうか？\nもっと昔、できればチクシュルブ以前の鳥類をご存知ですか？",
  "data/reddit-ask/r/AskWomen/comments/qfk8yu/what_percentage_of_your_friendsacquaintances_are.json": "生活費や住宅費のコストは、世界中で何年も前から上昇しています。\nしています。若者が実家で長く暮らす割合は、過去数十年に比べて格段に高くなっています。\n若者が実家に長く住む割合は、数十年前に比べて格段に増えています。\n\nあなたの友人・知人・同僚のうち、25歳以上の人の割合はどのくらいですか？\n25歳以上",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qfvgh8/do_you_believe_that_pretty_privilege_exist.json": "以前からこの話を聞いていたので、他の人の意見が気になっていました。\n他の人の意見が気になります。綺麗な人の方が生きやすいと思いますか？\n社会的基準で醜いと判断された人よりも、きれいな人の方が楽な人生を送れると思いますか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/qfpr4y/is_it_rude_to_reject_an_invitation_to_touch_a.json": "24Fで子持ちです。同僚が妊娠していて、みんなが彼女のお腹を触って\nお腹を触って赤ちゃんが蹴っているのを感じていました。私は一人だけお腹を触っていませんでした。\n彼女は私の手をつかんでお腹に当てようとしました。私は手を引いて\n私は手を引っ込めて、「ちょっと...感じたくない」と彼女に言いました。",
  "data/reddit-ask/r/AskHistorians/comments/qfgad7/did_roy_cohn_rise_to_political_power_by.json": "ロイ・コーンの急成長には興味がある。彼には多くの困難がありました。\n反ユダヤ主義のユダヤ人」や「ゲイのホモフォビア」と言われています。\n彼はおそらく、トランプ氏のメンターとして知られています。しかし、コーンのメンターは誰だったのでしょうか？\n\n彼が初めてFBI長官のJ・エドガー・フーバーに会ったとされるのは、その頃...",
  "data/reddit-ask/r/NoStupidQuestions/comments/qfvenh/why_do_doctors_and_medical_staff_have_shift_that.json": "病院での患者のケアに悪影響を与えるだけでなく、多くの混乱を招くような気がします。\nまた、多くの失敗を招くのではないかと",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qfwcvf/how_do_people_just_do_stuff_is_life_not.json": "シャワーや洗濯などの簡単なことをするだけでも、かなりのモチベーションが必要です。\n洗濯をするだけでもやる気が出ます。他の人と話していると、頭の中が1分間に1000マイルも回転します。授業に出ても\n授業を受けている間は、自分でも解離しているような気がします。\n終わるまでの時間を数えているような感じです。みんなにとって、すべてのことがこんなに大変なのでしょうか？どうすれば...",
  "data/reddit-ask/r/AskHistorians/comments/qfrtdd/california_famously_enacted_gun_control_when_the.json": "マルフォード法は、ブラック・パンサーが銃を持てないようにするための明確な法律でした。\nブラックパンサーが銃を携帯することを阻止するためのものだった。そして、彼らは「反対の意思を示すため」に議場に入った。しかし、（少なくとも後から考えると\nしかし（少なくとも今になってみれば）、この演出は、議員たちが「武装した黒人の一団」に怯えて\n武装した黒人の一団」に恐れをなして、法案を可決することを保証しているように思えます...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qfyvtf/when_did_5_out_of_5_stars_start_to_become_the.json": "これはebayの評価やuberの評価、その他多くの（主にオンラインの）評価システムで見られることです。\nレーティングシステムで見られます。Uberを使い始める前にこのことを知っていてよかったです。\nそうでなければ、私はうっかり人々に嫌な思いをさせてしまい、本当に感動的なものにしか5つ星を付けられなかったでしょう。\nそうでなければ、うっかり人々に嫌な思いをさせてしまい、本当に感動的なものにだけ5つ星をつけてしまうところでした。私は、多くの人がUberを利用していることを知りませんでした。",
  "data/reddit-ask/r/askscience/comments/qfqkiy/can_hybrid_caves_form_in_which_some_chambers_are.json": "洞窟システムの形成である「Speleogenesis」について知りたいのですが。私の理解では\n地下水が石灰岩のカルストに穴を開けてできたもの、溶岩流でできたもの、の3種類しかないと理解しています。\n地下水が石灰岩のカルストに穴を溶かしてできたもの、溶岩が引いた後の溶岩流によってできたもの\n溶岩が引いた後の溶岩流によって形成されたもの、そして稀にある氷床下の氷の洞窟の3種類しかありませんが...。",
  "data/reddit-ask/r/AskHistorians/comments/qfslw8/in_madness_and_civilization_michel_foucault_cites.json": "17-24を参照\n[https://archive.org/stream/Michel_Foucault_Madness_And_Civilization/Michel%20Foucault%2C%20Richard%20Howard%20%28transl.%29%20-%20Madness%20and%20Civilization_%20A%20History%20of%20Insanity%20in%20the%20Age%20of%20Reason%20%282013%2C%20Vintage%29_djvu.txt]\n\nさて、誰にでもわかるように、...",
  "data/reddit-ask/r/AskHistorians/comments/qg1q4o/how_did_the_dutch_acquire_such_good_relations.json": "後者の出典： https://en.wikipedia.org/wiki/Perry_Expedition",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qg3111/my_girlfriend_has_given_me_a_pass_to_bang_other.json": "では、最後まで聞いてください。\n\n私を捕まえるのは、いつもの罠ではありません。僕の彼女とは、並外れた\nコミュニケーションをとっています。ずいぶん前のことですが、彼女が付き合っている間に、両方の人と\n考えたことがあるかを尋ねた すると、彼女ははっきりと「ない」と言った。\n\nしかし、彼女は僕の性欲が強いことを認めているので...",
  "data/reddit-ask/r/NoStupidQuestions/comments/qgac5l/is_it_trashy_to_swim_in_underwear.json": "私の航空会社では、乗り継ぎに失敗しました。私はプール付きのホテルにいて、自分の着ている服だけが\n着ている服だけです。フロリダはめちゃくちゃ暑いので、これはいいかもしれませんが、一日の午後のために水着にお金を使いたくありません。\n一日の午後のために水着を買うのはもったいない。それはあまりにもゴミのようなものですか？",
  "data/reddit-ask/r/askscience/comments/qg8579/what_does_it_mean_to_solve_einsteins_field.json": "アインシュタインの場の方程式を解いたのは、シュワルツシルトなどだと読みました。\n\nアインシュタインは、自分で解けない方程式をどうやって書いたのでしょうか？\n\n私が目にする方程式は複雑ですが、基本的な代数に集約されているようです。\n方程式ができたら、あとはXを解くだけではないでしょうか？\n\n推測ですが・・・。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qgdnoz/why_am_i_being_ghosted_out_of_nowhere.json": "私（26M）が彼女（23F）と出会ったのは、職場で開かれた大規模なパーティーでした。踊っていると、彼女が私の方に来て\n踊っていると、彼女が私の方に来て、イチャイチャし始めました。私たちはとても相性が良く、意気投合しました。\nました。結局、パーティーが終わった後、お互いに安っぽい小さな野郎になってしまいました。\nパーティーが終わった後も、お互いにちょっとしたイチャイチャをしていました。",
  "data/reddit-ask/r/AskHistorians/comments/qgbts1/how_true_is_the_common_argument_that_the.json": "以前の軍隊は、貴族の戦士に多くを依存していた。\n何年も剣や槍の訓練を受け、重厚な鎧を身につけていましたが、今ではどんな庶民でも\n今では、どんな農民でも、たった2週間の訓練と的確な射撃で、その鎧や訓練、剣を打ち破ることができます。\n今では、どんな一般の農民でも、たった2週間の訓練と的確な射撃で、その鎧や訓練、剣を打ち破ることができるのです。これにより、貴族の間では...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qgbtu6/how_does_one_actually_go_about_asking_for_a_raise.json": "私はここ数年、時給25ドルを稼いでいて、それなりに良かったのですが、今は\n以前は13ドルがやっとだった会社が、今は20ドル前後の会社が多くなってきた。\nこの時点で給料を上げるべきだと思っています。\nなくても、もっと簡単な仕事をしてお金をもらうだけです。私は今まで一度も要求したことがありません。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qggie7/why_do_people_practically_revere_donald_trump.json": "この投稿がダウンボットされていることこそが、このサブに投稿した理由です。",
  "data/reddit-ask/r/askphilosophy/comments/qg1sro/if_youre_trapped_in_the_dream_of_the_other_youre.json": "ドゥルーズはこれらの引用で何を言いたかったのか？",
  "data/reddit-ask/r/AskWomen/comments/qgliwf/whats_something_you_did_with_past_partners_that.json": "その理由は？\n\nNSFWでもPGでも問題ありません。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qgn5sg/would_it_be_wronginappropriate_to_give_my_3.json": "私(21m)は、3人(30-45/2m/f)のチームで週5-6日、1日11時間ほど働きます。\n1日11時間の仕事をしています（ニューヨークでの建設管理はとても楽しいです）。私が20歳の時に採用されました。\n私は20歳で採用されましたが、彼らは私にたくさんの我慢をさせてくれましたし、私をたくさん指導してくれました。私たちは\nみんなとても仲がいいんですよ。\n\nこの1年間、私は取引をしてきました。",
  "data/reddit-ask/r/AskHistorians/comments/qgh1ol/did_kids_actually_have_to_kill_their_frogs_before.json": "ETを見ていて、エリオットが生物学の授業を受けているときに、ETが酔っぱらってテレビを見ているシーンがありました。\nそのシーンでは、子供たちが生きたカエルにクロロホルムを与えて\n解剖する前にクロロホルムの綿球を与えて窒息させたりするシーンがありました。それは\n80年代の公立学校の生物学では、実際に標準的なやり方だったのでしょうか...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qgird9/should_i_send_a_letter_explaining_to_an_ex_why_i.json": "私が14歳の時、ある男の子と付き合っていたのですが、私たちはとても恋をしていました。1年間付き合いました。\n残念なことに、私の祖母は人種差別主義者で、私をとても虐待していました（彼女は私の親権を持っていました）。\n彼は黒人だったの。おばあちゃんは私たちがキスしているところを見つけて、もし彼と別れなければ\n彼と別れなければ精神病院に送られると言われました...。",
  "data/reddit-ask/r/AskWomen/comments/qgndop/what_do_you_think_about_womenonly_passenger_cars.json": "女性専用客車とは、女性だけを対象とした地下鉄車両のことです。女性専用車両\nいくつかの国（ブラジル、日本など）では、主にハラスメントを減らすために設置されています。\nハラスメントや痴漢などを減らすために また、女性と男性を強制的に分離するために設置されています。\n女性と男性を強制的に分離するためにも設置されています。あなたの街でこのようなものを支持しますか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qg3lyf/how_to_overcome_the_fear_to_ask_a_woman_out.json": "サブのメンバーの皆様。\n\n私は18歳から27歳まで10年近くお付き合いをしていました。\n27歳まで続いていました。宗教上の問題と両親の反対により、残念ながら終わりました。\n両親の反対で残念ながら終わりました。私はインド出身で、女性に対してシャイなところがあります。それは\n苦しみから抜け出すのに時間がかかりました...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qgq3qy/why_do_people_hate_electric_cars.json": "私はいつも、0-60を3秒で走るテスラのビデオのコメントをスクロールします。\n3秒くらいで0-60を達成しているテスラのビデオのコメントを見ると、すべてのコメントが「今までで最も退屈な0-60」、「爆弾を運転して楽し\nとか、「爆弾を運転するのは楽しい」とか、「電気自動車は未来ではない。壊れていないなら、直さなくていい。\n壊れていなければ直す必要はない」というものです。人々は本当にガソリン代を払って、自分の...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qgpro3/19m_am_i_being_forced_to_grow_up_too_fast_or_am_i.json": "今日、父は私がどれだけお金を貯めているかを確認していました。大した額じゃないけど\n大した額ではないが、ひどい額でもない。新しい仕事を始めて2ヶ月、2,000円以上はあるはずだ。\n2,000円以上になるはずだった。しかし、その代わりに1,000ドルと少し余分にありました。彼は私に、このままお金を使い続けるなら、何のために働いているのか\n使ってしまうと、無駄に働いていることになると言われました。\n\n私は彼に、これらのすべては...",
  "data/reddit-ask/r/NoStupidQuestions/comments/qgsh4s/i_just_read_an_article_that_talked_about_a_black.json": "Claudette Colvinは彼女の名前です、ご参考までに。",
  "data/reddit-ask/r/AskHistorians/comments/qgtia7/are_antilgbtq_laws_in_african_countries_a.json": "アフリカの多くの国の反LGBTQ+は、ヨーロッパの植民地政府の産物だと聞いたことがあります。\nアフリカの多くの国の反LGBTQ+は、ヨーロッパの植民地政府の産物であり、必ずしも現地の文化ではないと聞いています。例えば、以下のような場合です。\nボツワナの高等裁判所が2019年に同国の反LGBTQ+法を覆した際には\n裁判官はこの法律を批判した...。",
  "data/reddit-ask/r/AskHistorians/comments/qgs8ga/when_was_europe_discovered.json": "探検というと、ヨーロッパ人が探検家であるかのように語られることが多いのですが。しかし\n他の文明（中国、ペルシャ、インド、日本、ジャワなど）がヨーロッパを発見したのはいつですか？\n中国人、ペルシャ人、インド人、日本人、ジャワ人、マレー人、サハラ以南のアフリカ人、中近東の人々など）は、いつヨーロッパを発見したのでしょうか？\n世界の他の文明（中国人、ペルシャ人、インド人、日本人、ジャワ人、マレーシア人、サハラ以南のアフリカ人、中東人など）がヨーロッパを発見したのはいつでしょうか？",
  "data/reddit-ask/r/askscience/comments/qgrngj/if_most_matter_gets_hot_as_it_expands_and_cools.json": "私は今、冷凍サイクルについて学んでいますが、今までの経験からすると混乱してしまいます。\n熱くなると物体が膨張し（金属、水、木など）、冷えると収縮すると読んできたからです。\n収縮すると読んできたからです。",
  "data/reddit-ask/r/askscience/comments/qgxc40/ask_anything_wednesday_biology_chemistry.json": "毎週恒例の「Ask Anything Wednesday」へようこそ！今週のテーマは\n今週のテーマは、生物学、化学、神経科学、医学、心理学です。\n\nこれらのトピックの中で、投稿する価値があるかどうかわからない質問がありますか？\n投稿する価値があるかどうかわからない質問はありませんか？典型的な/r/AskScienceの投稿にはちょっと思わせぶりな内容でしょうか？\nそんなことはありません。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qgxn8w/is_it_disrespectful_to_park_a_car_in_front_of.json": "近所に車を何台も所有している人がいて、その人の友達を何人も集めていることがあります。\n車を何台も持っていて、友達を何人か家に呼んだりします。ある日突然、彼の車道には3〜4台の車が並び\n路上には4～6台の車が停まっています。そのうちの数台はほとんど動きません。2日前、彼らは\n私の家の前に黒のP71ポリスインターセプターが停まっていて、私は...",
  "data/reddit-ask/r/NoStupidQuestions/comments/qgvgi3/can_we_get_rid_of_voting_for_politicians_instead.json": "一国の国民全員が、何かを約束する政治家に投票するのではなく、個々の政策に投票したらどうでしょう。\n何かをしてくれると約束した政治家に投票するのではなく そんなことができるだろうか。",
  "data/reddit-ask/r/askscience/comments/qgsqz3/does_a_computer_processor_get_worn_out.json": "タイトルにあるように、もし私が2台の同じコンピューターを購入し、1台を数年放置した後に\n片方は数年放置し、もう片方は重い計算を年中無休で行った場合、「性能の良い」プロセッサは「磨耗」してしまうのでしょうか？\n「性能の良い」プロセッサは「消耗」してしまうのでしょうか？どのように？他のコンポーネントを考慮しないで\n考慮していません(ファン、バッテリーなど、プロセッサのみ)",
  "data/reddit-ask/r/NoStupidQuestions/comments/qgv2d7/anybody_else_genuinely_prefer_rainovercast_over.json": "誤解を恐れずに言えば、太陽は素晴らしく、絶対に必要なものですが...。\n雨が降ると純粋にワクワクする人はいませんか？あるいは、オーバーキャスト（上空に暗い灰色の雲）のある日は、明るい日よりも\n暗い灰色の雲が上にある日は、明るい太陽の日よりも楽しいですか？\n\n\n\n誰もがいつも天気の良さについて話しているのに、見てみると・・・。\n見てみると...",
  "data/reddit-ask/r/NoStupidQuestions/comments/qgzf0s/my21m_first_girlfriend_20_of_5_years_just_cheated.json": "Edit1: 応援してくれてありがとうございます。私はあなたの音楽が本当に素晴らしい\nこれは 一つ一つ試しています。言うまでもなく、私は彼女のことを全く嫌いではありません。\n時々、彼女が他の男とキスしたり、一緒に手をつないだりしている暗い考えが浮かんできます。\n時々、彼女が他の男とキスしたり、一緒に手をつないだりしているのを暗く考えてしまいます。でも...",
  "data/reddit-ask/r/AskWomen/comments/qh65aw/how_would_you_react_to_your_date_using_a_coupon.json": "例 あなたのデート相手は、50ドル以上のディナーが20ドル引きになるクーポンを持っています。あなたのデート相手は\nクーポンを現金/カードと一緒にペイブックに入れた。\n\nあなたは彼らをどう思いますか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qh5xf9/what_does_circle_jerk_mean.json": "真面目な話、あちこちで見かけますが、いまだに意味がわかりません;-。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qgvn0z/is_it_bad_that_once_i_no_joke_msturbated_to_myself.json": "鏡を使って",
  "data/reddit-ask/r/AskHistorians/comments/qgtsyj/sessue_hayakawa_a_japanese_man_was_one_of.json": "K-POPが人気を博しているのと同じ時期に、反アジア人種差別が増えているのではないかと思い、このことを考えました。\nK-POPが盛り上がっているのと同じ時期に、反アジア人種差別が増えているのではないかと思い、これを考えました。20年ルールを破ってはいけないので\n20年ルールを破ってはいけないので、過去にあった似たようなことを聞いてみようと思いました。\n過去にあった似たようなことを聞いてみようと思いました。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qh75en/do_you_ever_think_youre_not_really_here.json": "説明してみます。\n\n時々、私はこの（人生の）すべての出来事を見ているのではないかと思うことがあります。すべての出来事や日々の生活が見えているような\nすべての出来事や日々の生活が見えるのに、自分はそこから離れているような。よく思うのは\n自分は数年前に死んでいて、これは別の現実なのではないかと思うことがあります。\n\nあるいは、とんでもないことをしたいという強い衝動に駆られたり...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qh84g3/why_are_so_many_people_on_reddit_unable_to.json": "複数のサイトや掲示板で何十年もやっている熱心な荒らしやクソ投稿者としては\n複数のサイトや掲示板で何十年もやっていますが、正直なところ、風刺がこれほど読まれているサイトに出会ったことはありません。\n風刺がどれほど馬鹿げていても福音的な真実として受け入れられるサイトに出会ったことはありません。私は\n私は最も不条理で馬鹿げた意見や話をすることができました（してきました）。",
  "data/reddit-ask/r/AskWomen/comments/qhaxpj/women_who_are_kind_of_loners_how_are_you_doing.json": "あなたの人生はどうですか？友達はたくさんいても、自分は一匹狼だと思っていますか？\n一匹狼だと思いますか？もしそうなら、なぜですか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qhe4zf/can_i_go_to_a_black_barbershop_if_im_white.json": "どうでしょう。普通の理髪店は退屈で、このようなブラックな理髪店では人々が楽しく過ごしているのを見ます。\n楽しんでいる人たちを見ることができますが、私は受け入れられるでしょうか？\n変な目で見られたりするのかな？すごく行きたいです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qhd7fs/what_exactly_are_nfts_and_why_do_people_hate_them.json": "最近、多くの人がNFTに不満を持っているのを目にしました。\n検索してみましたが、よくわかりませんでした。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qh89cg/why_was_there_even_live_bullets_on_set.json": "だから、私はすべての指が baldwin に向けられていることを知っています、それは訓練されていないからです。\nしかし、偽物の弾丸が使われているのに、なぜ彼が訓練を受ける必要があるのでしょうか？\n\n本当の疑問は、そもそもなぜ映画のシーンに本物の銃弾があったのか？\nそもそも\n\nそして、この情報が正しいかどうかはわかりませんが、どうやらそれは...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qh6qeh/when_my_grandma_with_dementia_forgets_something.json": "確かに「必要ない」「はい、絶対に正しい」という場合もあると思います。\n絶対に訂正してください」という場合もあるでしょうが、グレーゾーンもあります。\n\n例えば、アレルギーがあるものをアレルギーがないと言われても、私は彼女に言わせません。\nしかし、彼女が「私の好きな色は青だった......」と言っても、私は彼女に同意します。\n私の好きな色は青だった...",
  "data/reddit-ask/r/askscience/comments/qhexf7/how_could_an_ssri_reduce_the_likelihood_of.json": "最近のブラジルの研究では、COVID-19に感染したリスクのある人にフルボキサミンを投与したそうです。\n最近のブラジルの研究では、COVID-19に感染したリスクの高い人にフルボキサミンを投与したそうです。SSRI投与群の11％が入院を必要とした。\n対照群では16％でした。\n\n[この研究に関するニュース記事\n[https://www.seattletimes.com/seattle-news/health/cheap-antidepressant...",
  "data/reddit-ask/r/askphilosophy/comments/qh1e64/how_can_i_keep_my_opinion_while_reading.json": "私は古典をすべて読みたいと思っています。「メノ」を読んで、とても気に入りました。\n気に入りました。でも、読みすぎると自分の考えが作者になってしまうのではないかという不安があります。\n著者になってしまうのではないかという不安があります。これを防ぐにはどうしたらいいですか？また、お勧めの本があれば教えてください。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qhetxu/how_do_i_get_amazon_to_accept_my_negative_review.json": "私の愛犬は、アマゾンで購入した関節用のサプリメントを与えた後に亡くなりました。私は\n症状が出ている様子を撮影した動画と、死亡診断書の写真を添付して\n死亡診断書の写真と獣医の請求額3,000ドルを添えて。\n$3k.\n\n私は3回ほど商品のレビューを残そうとしましたが...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qhczcc/should_i_tell_my_parents_i_need_eyeglasses.json": "私の目は悪くなっていて、先生たちは私に眼鏡が必要だと言っています。\n怒られそうで怖くて言えません。どうしたらいいですか？\nどうすればいいですか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qhf9ie/for_people_whove_been_part_of_a_sugar_daddy.json": "多くの人がアレンジを想定していることを実感しています。でも、実際にやった人の声を\n実際に体験した人の声を聞きたい。\"シュガーダディ \"は何を与えたのか？女の子は何を\n女の子は何を与えたのか？どうやって「値段」を決めたのか？それともしたの？どれくらいの頻度で？決まったルールがあったのでしょうか？\nルールがあったのか、それとも流動的なものだったのか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/qhdujk/how_do_you_defend_against_a_robbery_at_knife_point.json": "もちろん遵守することが一番ですが、そうでない場合はどうでしょうか。銃なしでどうやって\n銃を持たずにどうやって強盗から逃れるのか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/qhj0zn/if_you_were_staying_in_a_hotel_room_with_your_so.json": "基本的に私とSOは遠距離恋愛中で、彼らが遊びに来ることになっています。I\n私は両親と同居しているので、一週間ホテルを借りています。私には贅沢なことに\nお菓子や毛布などの快適なものをたくさん用意しています。そこで、どなたか\nどなたかお勧めの持ち物を教えてください。",
  "data/reddit-ask/r/AskHistorians/comments/qhlq2x/im_a_soapmaker_by_trade_and_i_was_wondering_how.json": "ヤードリーは英国王室御用達の石鹸です。\nヤードリーは英国王室御用達の石鹸メーカーであり、昔からそうであったことは知っていますが、少なくとも一部の石鹸メーカーは尊敬されていたはずです。\n多少はね。",
  "data/reddit-ask/r/askscience/comments/qh92ie/how_recently_did_we_discoverunderstand_evaporation.json": "1万年前の人々は、\"よぉ、俺の水はどこへ行った？\"と言っていたのか？どのような理論で\n実際に何が起こっているかを知る前に、蒸発についてどのような理論を持っていたのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qhngst/yall_ever_take_like_5_minutes_after_pooping_just.json": "開放された後、肛門を落ち着かせるのが好きです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qhnthg/what_do_you_think_about_women_going_out_braless.json": "また、なぜ女性が着なければならないのか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qhprz6/is_letting_your_girlfriendsignificant_other.json": "最近、ある女の子と別れました。\n束縛されているように感じたからです。一過性のものだと思っていましたが\nしかし、元彼にメールをしたところ、彼女は他の女の子とイチャイチャしていて、彼氏はそれでいいと言っているそうです。\n彼氏はそれでいいと言っていました。これは普通のことですか？私が遅れているだけなのでしょうか...。",
  "data/reddit-ask/r/askscience/comments/qhpgar/what_makes_a_high_basic_ph_so_dangerous.json": "理科の授業でpHの勉強をしていて、NaOHを使った実験をしたのですが、その時に\npHが13/14であることから、最も基本的な物質のひとつであることがわかります。ボトルには「腐食性があります」と書かれていました。\n腐食性があるとボトルに書かれていたので、びっくりしました。私は\n塩基性とは酸性ではないこと、つまり優しいことだと思っていました。私は明らかに...",
  "data/reddit-ask/r/NoStupidQuestions/comments/qhlhcb/for_all_the_women_who_didnt_find_out_they_were.json": "どうやって知らないのか\n[https://www.reddit.com/r/NoStupidQuestions/comments/qhlhcb/for_all_the_women_who_didnt_find_out_they_were/hidk0q3/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3]\nコメント。そして、もう一つの...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qhruqy/why_is_saying_offensive_things_about_straight.json": "同じような有害なメッセージに見えますが、一部の人はダブルスタンダードを持っているようです。\n二重基準になっている人もいるようなので、よくわかりません。忘却の彼方にダウンボートされるかもしれない",
  "data/reddit-ask/r/NoStupidQuestions/comments/qhpyeb/i_shaved_a_little_too_rough_how_do_i_get_rid_of.json": "2日前に金玉を剃ったのですが、今は赤いブツブツができていて、痛くてイライラします。\n痛くて痛くてたまりません。どうしたら治りますか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qhi11l/why_use_lgbtqiapk_when_lgbt_is_exactly_the_same.json": "基本的にはタイトル通り。最初はLGBTだったのが、LGBT+になりました。\nLGBT以外にも多くの性的嗜好があるので、妥当なところだと思います。\n\nしかし、LGBTコミュニティに関する投稿を読んだところ、OPが「LGBTQIAPK+」を使っていました。\nLGBTQIAPK+. 他の文字は何を表しているのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/qhv4fz/my_main_reason_to_lose_weight_is_so_i_can_talk_to.json": "私はもともと体格がよく、痩せたいと思って運動や健康的な食事をするようになりましたが\n健康的な食事をするようになりましたが、実際に体重が減っているのは\n女の子と話せるようになったからです。僕は今まで一度も恋愛をしたことがありません。\n今まで一度も恋愛をしたことがないのですが、その主な理由は太っているからだと感じています...",
  "data/reddit-ask/r/askphilosophy/comments/qhg3bi/could_you_perceive_reality_without_interpreting_it.json": "人間の解釈を \"オフ \"にしても、目の前で起きていることを理解することができるのか？\n目の前で起こっていることを理解することができますか？",
  "data/reddit-ask/r/askscience/comments/qhoky7/if_youre_under_a_mountain_would_the_slight.json": "今日、生徒からこのような質問を受けました。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qhqbuw/settle_a_debate_for_me_is_sushi_considered_a.json": "カリフォルニアロールやそれに匹敵する「軽い」寿司（特に巻物）を6～8個、昼食に食べることです。\n(特に巻物）を昼食に食べています。",
  "data/reddit-ask/r/askscience/comments/qho2b5/does_water_count_as_boson_since_it_has_even.json": "ボソンとは、整数のスピンを持つ粒子のことだとどこかで読んだことがあります。そして、アルファ\n偶数個のフェルミオン（この場合は陽子と中性子）で構成されているので、アルファ粒子もボゾンです。\n偶数個のフェルミオン（この場合は陽子と中性子）で構成されているからです。)\n\nもし、どんな複合粒子でも偶数個のフェルミオンで構成されているなら、次のようになるのではないでしょうか。\n水分子もボソンになるのでは？",
  "data/reddit-ask/r/AskHistorians/comments/qi0791/many_cultures_had_customary_dowry_paid_by_the.json": "技術的な違いがあるのは承知していますが（持参金は花婿には支払われません。\n花婿に支払われるのではなく、家族全員に与えられる）。) しかし、私はこう思います。\n大まかに言えば、その通りだと思います。持参金は、新婦の家族の資金を家計に加えるものです。\n世帯に追加されるのに対し、花嫁代金は逆に...。",
  "data/reddit-ask/r/AskHistorians/comments/qho6wz/how_do_historians_working_in_one_language_account.json": "欧米では英語が学術的な共通語になっていますが、彼の言葉はまだまだたくさんあると思います。\n西洋以外の言語で書かれた歴史も十分にあります。\n西洋以外の言語で書かれた歴史も、まだまだたくさんあるはずです。しかし、その大半は翻訳されていません。\nイタリア語であれ、アラビア語であれ、中国語であれ、翻訳されずに残っています。",
  "data/reddit-ask/r/AskHistorians/comments/qhw1lu/the_famous_horror_theater_of_grand_guignol_in.json": "この有名な劇場に関するImaginary Worldsのエピソードを聞いた後、wikipediaで調べてみると\nウィキペディアで調べてみると、次のように書かれています。\n\n> 興奮を得るために多くの人がショーに参加した[2] バルコニーの下には\n> 尼僧が教会の礼拝を見るために作られた）箱があって\n> 演劇を見る人のために用意されていた...。",
  "data/reddit-ask/r/AskWomen/comments/qhymi2/what_irresponsible_thing_do_you_want_to_do_rn.json": "タイトルにあるように、あなたが今、無責任だとわかっていて、やりたいと思うことを我慢していることは何ですか？\n無責任だとわかっていて、やりたい気持ちを抑えていることは？",
  "data/reddit-ask/r/NoStupidQuestions/comments/qhu691/is_it_legal_to_ask_for_my_sex_age_especially_race.json": "私は最近、米国での仕事のために採用されましたが、これまで米国で働いたことはありません。\n\n私の国では、このような質問はすべて、まず無礼であり、最も重要なのは\n違法です。もし、私の国で人種を尋ねたら、私は知らないし、検察官はあなたを縛るかもしれません。\n逮捕されてしまうかもしれません。あなたはすべての弁護士を魅了するでしょう...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qi59v8/does_this_count_as_sexual_abuse.json": "私が12歳の頃、母が私のことを妊娠していると思っていたという状況がありました。\n妊娠していると思っていたのですが、それは母の被害妄想でした。母は私に、医者と一緒に母の前で処女性テストを受けさせました。\n医者と一緒に母の目の前で行われました。\n\n今日に至るまで、私はセックス（まだ経験していませんが）や何かを自分の中に入れることに不安を感じています。\n入れることに不安を感じています。それはとても小さな出来事でしたが、私は...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qia2lt/why_are_sex_scenes_almost_always_rrated_when.json": "つまり、殺人や殺害は、愛し合うことよりも、もっと慎まれるべきではないかと...。\n愛することよりも抑制されるべきでは？",
  "data/reddit-ask/r/AskHistorians/comments/qhzngz/how_much_credit_card_fraud_did_there_used_to_be.json": "1987年に公開された素晴らしい映画『プレーンズ・トレインズ・アンド・オートモービルズ』を見終わったところです。\n1987年の素晴らしい映画です。この映画の冒頭で、スティーブ・マーティンとジョン・キャンディがクレジットカードを使うシーンがあります。\nキャンディが、インプリンターで刷られたクレジットカードを使っています。私は思わず\n私は、クレジットカードの不正使用が大きな問題になっていたのではないかと思わずにはいられませんでした...。",
  "data/reddit-ask/r/AskHistorians/comments/qibgd5/how_would_a_medieval_shop_have_looked_like_would.json": "中世を舞台にしたゲームをプレイすると、必ずと言っていいほど\nお店」があります。\n本からポーションまで、様々なものを買うことができる建物です。スーパーマーケットとまではいきませんが、100年前の角市場のようなものです。\nスーパーマーケットとまではいきませんが、一昔前のコーナーマーケットのようなものです。\nどのくらいリアルかというと......。",
  "data/reddit-ask/r/AskWomen/comments/qid48v/whats_your_irrational_hate.json": "私のは...ハロウィン(´・ω・`)",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qiarj2/i_have_a_pimple_on_my_penis_how_do_i_get_rid_of.json": "私は16歳で、ちょっと変な質問ですが、ちょっと心配しています。I\n顔にはできなくてよかったのですが、陰部にできてしまったようです。\nニキビは根元に近いところにできていて、そこにはボディグルーミング剤を使っていますが、私は処女です。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qi8l0v/is_giving_someone_a_kiss_on_the_top_of_their_head.json": "僕と彼女は「ほぼ付き合っている」状態ですが、まだキスはしていませんが、いつもハグをしています。\nしている。彼女は僕より背が低いのですが、ハグをすると彼女の頭がちょうどいい高さになります。\n彼女の頭のてっぺんに簡単にキスできるんだ。これは良いことなのでしょうか？\n頭のてっぺんにキスをするのは変なことですか？それは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qif61s/how_do_i_tell_someone_they_talk_way_too_much.json": "最近仲良くなった人（中年後半の女性です）が\nとてもよくしゃべる。\n\nでも、彼女は他に話す人がいなくてとても孤独なので、理解して許しています。\nでも、彼女は本当に他に話す人がいなくて、とても孤独だから、理解してあげている。\n\nしかし、問題は...私たちは何時間も一緒に過ごします...彼女が話すだけで。私は何か言うかもしれません\n少しだけ...",
  "data/reddit-ask/r/NoStupidQuestions/comments/qifqk5/is_guys_gender_neutral.json": "私はレストランで働いていますが、女性のグループにサービスを提供しているときに、時々気まずさを感じます。\n女性のグループにサービスを提供しているときに、\"Hey guys... \"と言うときに気まずさを感じます（\"Hey ladies \"とは言いません。\nとは言いません。) では、この言葉は性別を問わないのでしょうか？もしそうでなければ、何か代わりになるものはありますか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qig5gs/is_it_weird_that_as_a_dude_i_prefer_to_sit_down.json": "私の家族は、それが超変だと言っていますが、わかりません。",
  "data/reddit-ask/r/AskHistorians/comments/qignt7/the_fantasy_trope_of_a_city_guard_was_largely.json": "はっきりさせておきたいのは、私が言及している形は、原始的な\n市民法や刑法を執行するプロの警察を描いたものです。これは\nこれは通常、刑務所や司法制度と連携しています。公平性と腐敗\n設定によって異なりますが、これらは私が考える基本的な考慮事項です。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qihbya/am_i_homophobic_for_thinking_that_non_binary.json": "今まで言う勇気がありませんでしたが、ずっと気になっていました。\nノンバイナリーの知り合いがいないので、Redditで聞くのが一番だと思います。\nバイナリの人を知らないので、Redditで聞くのが一番だと思います。\n\nノンバイナリーって一体何？男性とも女性ともつかない人たちのことだと聞いたことがあります。\n男性とも女性ともつかない人たちのことだと聞いています。でも今、あなたが説明しているのは...",
  "data/reddit-ask/r/AskHistorians/comments/qinxb6/in_the_famous_clip_from_the_eric_andre_show_do.json": "Heres [https://i.kym-cdn.com/photos/images/original/001/291/783/f32.jpg_large]\nザ・エンチェンジ",
  "data/reddit-ask/r/NoStupidQuestions/comments/qihgw2/does_boomer_no_longer_mean_someone_born_in_the.json": "団塊の世代」と言っている人の投稿をよく見かけますが、その人は10代、20代の親です。\n10代、20代の方の親御さんです。私は30代ですが、私の両親は団塊の世代ではありません。\n団塊世代ではなく、X世代です。\n\n団塊の世代は今、60～70代です。",
  "data/reddit-ask/r/AskHistorians/comments/qimffo/what_do_you_do_if_you_have_a_family_secret_about.json": "この質問をするのに最適な場所かどうかわかりませんが、歴史をどのように記録するかということなので\n歴史をどのように記録するかということなので、歴史家に聞くのが適切だと思います。\n\n私の祖母の両親は芸術家でした。ほとんどの人は彼らの名前を知らないでしょうが\n曾祖父の作品は知っています。彼らは両方とも...",
  "data/reddit-ask/r/AskWomen/comments/qipqzp/how_do_you_feel_about_lab_grown_diamonds.json": "エンゲージメントリング用",
  "data/reddit-ask/r/NoStupidQuestions/comments/qis72p/i_was_just_pooped_on_by_a_man_while_walking_is.json": "観覧席の下を歩いていたら、隣にウンコが飛び散って靴やズボンについた。\n靴とズボンについた。ふと見ると、男の人が観覧席の横にお尻を浮かせていました。\n見上げると、男が観客席の横に尻を浮かせていた。彼は逃げてしまい、今私はここでウンコまみれになっています。誰を呼べばいいんだろう、警察？\nこれは犯罪ですか？どうやって検査するの？\n\nPS 冗談ではありません...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qiqdsq/how_come_those_who_believe_in_spirits_and.json": "すべてはタイトルにある。本質的な内訳：なぜ、スピリチュアルをバカにするのはいいが\nスピリチュアルをからかうのはいいけど、他の宗教は「禁止」で「無礼」なのはなぜ？",
  "data/reddit-ask/r/AskWomen/comments/qipvza/how_do_you_feel_when_misogynist_try_to_uno.json": "男性の問題と女性の問題が混同されている場合、どのように感じますか？\n\n例えば、配偶者からの虐待などです。女性の方がはるかに高い確率で苦しんでいますが、男性も同様に苦しんでいます。\n苦しんでいます。その事実が最初の指摘を無効にするために使われたとき、あなたは通常どのように反応、または感じますか？\nあなたは通常、どのように反応し、感じますか？なぜですか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qixtt2/isnt_touchinghurting_someones_nuts_sexual.json": "映画やシリーズでは、女性の主人公が誰かを蹴ったり掴んだりして、より強く、よりワルになっていくように描かれています。\n蹴ったり、誰かの金玉をつかんだりして、女性主人公がより強く、よりワルになっているように見せる映画やシリーズがあります。\n性的暴行であるべきなのに、いつもコメディーシーンとして描かれています。なぜかはわかりませんが、誰もが、人を傷つけることは\nなぜかというと、誰もが誰かの金玉を傷つけることは、かなり生意気でかっこいいと思っているからです。でも私は...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qiyzf2/my_husband_died_in_2020_and_i_discovered_after.json": "私の夫は、26年間結婚生活を送っていましたが、自分でもひどい関係だったと認める女性と\n私の夫は、26年間結婚生活を送っていました。彼らには2人の可愛い子供がいました。彼は離婚し、私はその半年後に彼と出会いました。\n半年後に出会いました。彼は親切で思いやりのある人でした。こんなに相性のいい人に出会えたなんて、信じられなかったわ。\nこんなに相性のいい人に出会えたなんて。私たちはとても合っているように思えました...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qj03nn/how_do_chinese_people_text.json": "これはジョークではありません。理解できないのですが、キーボードはどうやって動くのでしょうか？I\n先日、誰かの肩越しに見てみると、文字の破片で文字を作っているように見えました。\n文字のかけらで文字を作っているように見えました。こんな風に言うとバカみたいだけど\n私が言うとバカみたいですが、あれはクレイジーですよ。",
  "data/reddit-ask/r/AskHistorians/comments/qitwn6/do_we_know_much_about_what_the_life_of_the_last.json": "彼らは自分たちが最後の種であることを知っていたのだろうか？それはいつ起こったのか？\nネアンデルタール人を絶滅に追いやった力は何だったのか？",
  "data/reddit-ask/r/AskHistorians/comments/qizeiw/why_is_the_korean_war_often_neglected_in_western.json": "この質問は、このニュース記事に触発されたものです。アメリカのアフガニスタンでの戦争は終わった。\nアメリカのアフガン戦争は終わったが、北朝鮮との真の意味での最長の戦争は続いている\n[https://www.abc.net.au/news/2021-10-24/north-korea-americas-longest-war-a-challenge-for-joe-biden/100559598]\n\nこの記事では、「最も...",
  "data/reddit-ask/r/askscience/comments/qj3yaq/do_powerful_space_telescopes_able_to_see_back_to.json": "検索しても他に同じような質問が見つからなかったのですが、もしこれが以前に\n前に質問されていたらごめんなさい。\n\nジェームズ・ウェッブ望遠鏡は、2億5千万年前の宇宙を見ることができるように準備されています。\nもっと小さいと思われる宇宙を見ることができるかもしれません。仮に、若い宇宙の全体像を捉えることができたとします。\n若い宇宙全体の画像を撮影できるとしたら...",
  "data/reddit-ask/r/NoStupidQuestions/comments/qizmek/when_people_today_are_lost_in_remote_areas_like.json": "あるいは、この技術は小型で安価なので、小型のドローンをコンステレーションで飛ばして\nこの技術はコンパクトで安価なので、小型のドローンをその地域に送り、携帯電話の多点指向性を計算することができます。\nこの技術はコンパクトで安価です。\n\n捜索・救助用の低コストAWACSを想像しています。ネットを素早く展開すれば\n電話が切れる前にネットを展開すれば...",
  "data/reddit-ask/r/NoStupidQuestions/comments/qj4c0b/what_do_nondepressed_single_and_no_kids_30_year.json": "ただ、数年来の付き合いが終わってしまったので、少し迷っています。どんなことでも\n助けになります。",
  "data/reddit-ask/r/AskHistorians/comments/qj0qzj/how_did_the_word_polack_become_an_offensive_term.json": "Polackという言葉は、民族的にポーランド人でない限り、あまり知られていません。\n少なくとも私が住んでいるところ（シカゴ）ではそうなのですが。奇妙に思えるのは\nポーランド語（Polak、ポーランド人の男性バージョン）の英語化が\n不快感を与える、または品位を落とす",
  "data/reddit-ask/r/NoStupidQuestions/comments/qj525r/considering_reproduction_and_birth_is_necessary.json": "タイトルの通りです。",
  "data/reddit-ask/r/askscience/comments/qittsy/what_is_different_about_kids_biology_that_the.json": "ワクチンの科学的根拠は、年齢とは無関係のようです。子供は抗体を作るのが\n抗体ができるのが遅いとか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qj8xlq/are_there_actually_women_that_find_the_dad_bod.json": "太った人を嫌っているように見えないように、そう言っているのでしょうか？\n誰もが魅力的に見えるように社会が彼らに圧力をかけているのでしょうか？\n\n誰もが好みを持っていることは理解していますが、ネット上ではお父さんの体への愛が多いように感じます。\nオンラインではパパの体への愛が多いようです。それほど人気があるとは信じられません。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qj8jpj/is_it_weird_to_not_like_sex.json": "あなたが恋愛に関するあらゆることが好きなように、あなたも愛情を注いで好きになることができます。\nキスしたりしても、セックスはしない。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qjiopm/after_a_woman_gives_birth_what_happens_to_the.json": "ただ基本的にはお腹がどうなるか、みたいな。どこに行くの？どうなるのか？\nその物理的な特性は何ですか？",
  "data/reddit-ask/r/AskWomen/comments/qjh90t/whats_one_thing_you_wish_you_knew_about_someone.json": "コメント欄でのご意見・ご感想をお待ちしています<3",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qjlist/why_is_ok_for_people_who_arent_white_to.json": "白人ではない私の友人は、ハロウィンパーティーでキム・ポッシブルの仮装をしました。\nパーティーに参加したのですが、見事に着こなしていました。私は、自分が白人だからといって\n自分が白人だからといって、好きなフィクションのキャラクターに扮することができないのはちょっと悲しい。\n白人です。\n\nこの投稿で悪気があるわけではなく、私はただ...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qjmaz7/is_it_disrespectful_to_have_sex_when_your.json": "純粋な質問ですが、ルームメイトのエチケットなどについてはよく知りませんし、このようなことが起こるべきかどうかもわかりません。\nこれは起こるべきことなのかどうか。皆さんの考えを教えてください。\nまた、はっきりさせておきたいのですが、ルームメイトは別の部屋にいますが、隣の部屋のようなものです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qjlq9c/can_my_cat_kill_me_by_chomping_down_on_my_jugular.json": "馬鹿げた話かもしれませんが、私は猫ちゃんが首の近くにいると不安になります。\n仰向けになって私の手で遊んでいる時も不安になります。彼の爪はかなり鋭く長いので\n手を差し出して、手首の大事なところを切られたらどうしようと思うと怖いのです。\nこれは実際に起こりうることなのか、それとも私が...。",
  "data/reddit-ask/r/AskHistorians/comments/qjoz2p/pederasty_was_tolerated_in_many_premodern.json": "例えば、William Dalrympleは『The Anarchy』の中で、1788年にデリーを略奪したアフガン軍のリーダーGhulam Kadir\n1788年にデリーを略奪したアフガン軍のリーダー、グラム・カディールは、ムガル帝国の皇帝シャー・アラム2世の目をつぶし\n皇帝シャー・アラム2世を盲目にし、彼の家族を特に残酷に扱ったのではないかと推測している。\nこれはKadirが若い政治家だった頃、シャー・アラムがKadirを虐待した可能性が高いからである。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qjhfc5/what_is_this_intense_painful_feeling.json": "24歳、女性です。何を感じているのか、その感覚が何と呼ばれているのか、よくわかりません。\n感じているのか、何と呼ばれているのかわからない。今までこのような経験をしたことはほとんどありませんでした。\n\n基本的に、私はこの自己啓発記事を読んでいて、突然、自分自身について恐ろしく感じました。\n自分のことが恐ろしくなって、強烈に変な方向に興奮して...。",
  "data/reddit-ask/r/askscience/comments/qjn489/is_sarscov2_more_infectiouscontagious_than.json": "コロナウイルスには様々な種類がありますが、SARS-CoV-2は通常のコロナウイルスよりも致死率が高く\nSARS-CoV-2は、通常のコロナウイルスに比べて、非常に致死性が高く、通常は軽度の上気道炎を引き起こすだけです。\n軽い上気道炎を起こすだけです。\n\n通常のコロナウイルスもSARS-CoV-2と同じように感染するのか、それとも似たようなものなのかと思っていました。\n似ているのではないかと思っています。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qjlqc1/why_do_memories_remembered_by_smell_seem_much.json": "ショッピングモールでふと嗅いだ元カレの香水を嗅ぐと、記憶が蘇って変な気持ちになる、という話ではありません。\n思い出がよみがえってきたり、変な気持ちになったりしますが、それも\nそれもあります。\n\n他にも、おばあちゃんが昔作ってくれたデザートの匂いや\nおばあちゃんが若い時に作ってくれたデザートの匂いとか...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qjsm1n/how_will_i_be_able_to_forgive_my_fiancé_for_the.json": "私(25F)は妊娠19週目に定期的な超音波検査を受け、次のように言われました。\n子宮頸管が2cm拡張していると言われました。子宮頸管を締めるために一晩拘束されましたが\n残念ながら、手術予定日の数時間前に破水してしまいました。すべての検査結果は\n全ての検査が陰性だったので、医師からは正式な回答は得られませんでしたが...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qjqllo/do_men_want_and_enjoy_when_women_kisses_their.json": "タイトルの通りですね。また、これについては女性の意見も必要です。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qjroue/after_spending_a_night_with_friends_who_love_and.json": "自分が言ったこと、やったことを思い出し、批判されているのではないか、二度と話してくれないのではないか\n批判されているのではないか、二度と話してくれないのではないか、嫌われているのではないか、私は不器用だったのではないか、という考えが頭から離れません。\n頭から離れず、とても悲しくなります。どうして私はこんな風になってしまったんだろう？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qjqy9v/why_are_americans_obsessed_with_blowing_leaves.json": "私の知る限りでは、アメリカ人は葉っぱを吹いて回る唯一の民族です。\nなぜあなたはそうするのですか？他の国の人たちは、葉っぱをそのままにしています。\n肥料が必要なのはそのためです。なぜ\n落ち葉を拾うのですか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qjw282/do_people_wash_their_bum_instead_of_wiping_after.json": "私の文化では、誰もがビデを使ってウンチの後にお尻を水で洗います。\n欧米諸国では、ティッシュで拭くだけです。個人的には\n考えてみると、もし自分の手にうんちがついていたら、ただ拭くだけでなく\n手にうんちがついていたら、ティッシュで拭くのか、手を洗うのか...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qjuehh/why_is_relationship_advice_on_reddit.json": "私が言っているのは、明らかな虐待のケースではなく、できれば辞めた方がいいということです。私が言っているのは\n私が言っているのは、人々が予定されていたデートに行かないことについて一度だけ口論になったという状況です。\n予定されていたデートに行かなかったことで一度だけ口論になり、コメント欄では「ああ、彼らは明らかに\nコメント欄では、「ああ、彼らはあなたのことを全く気にかけていないのだから、別れた方がいい、明らかに...」というようなことを言っています。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qjpab0/what_do_you_say_when_someone_says_merry_christmas.json": "感謝の気持ちを伝えていますか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qk177p/was_this_racist.json": "今夜、白人がマイケルのコスプレをしてハロウィンのハウスパーティーに現れました。\nジャクソン（アルバム「BAD」のジャケット）の格好をしていた。\nなぜなら、ジャコは黒人であり、彼は肌の状態をからかっているからです。困ったことに、僕はこの人を知っていて\n彼はマイケル・ジャクソンが好きで、ダンスをしたり...。",
  "data/reddit-ask/r/AskHistorians/comments/qjxwko/gary_webb_famously_died_of_two_gun_shot_wounds_to.json": "この事件は、CIAの介入が報復として行われた明確な事例の一つとして指摘されている。\nウェッブが麻薬密輸への関与について不利な秘密を暴露したことへの報復として\n復讐のためにCIAが介入したとされています。私の知る限りでは、その関係の深さについての情報は\n密輸はコントラとの間で許されていたことがわかっていても、機密扱いになっています...。",
  "data/reddit-ask/r/AskWomen/comments/qk0r3i/if_your_partner_fell_in_love_with_someone_else.json": "これは誰にとっても大きな不安だと思いますが、あなたの理想的な結果は何ですか？\n彼らはあなたと一緒にいて、気持ちを押し殺してくれる？捨てられる？浮気される？彼らは\n言わない？どの選択肢も良さそうですが、あなたなら何を選びますか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/qjk4mn/is_reddit_a_leftleaning_website.json": "ある人がredditは右寄りのサイトだと主張しているコメントを見て、それはおかしいと思いました。\nそれはおかしいと思いました。私がr/popular[/r/popular]で見た限りでは。\nr/popular [/r/popular]で見たところ、コメントや投稿の大半は左寄りですが、redditは右寄りのウェブサイトなのでしょうか？\n右寄りのウェブサイトですか？",
  "data/reddit-ask/r/AskHistorians/comments/qjyqtl/marcus_aurelius_is_probably_the_most_well_known.json": "瞑想」をはじめとする彼の著作は、古代のストイックな思想に関する代表的な著作として知られています。\n彼の思考プロセスや人生観を知ることができます。\nしかし、彼が制定した政策や、皇帝としてとった大きな行動の中で、ストイックな思想に起因するものはあるのだろうか。\nしかし、彼が行った政策や皇帝としての大きな行動の中で、彼のストイックな考えに起因するものはあるのでしょうか。",
  "data/reddit-ask/r/AskHistorians/comments/qjv0j1/historians_rightly_point_out_that_cortés_invasion.json": "私は高校の教師ですが、私が教えられた単純なストーリー（ジャレド・ダイアモンドの説明）に代わるものを明確にするのに苦労しています。\n私は高校の教師ですが、私が教わった単純なストーリー（ジャレド・ダイアモンドの「世界征服」の記述）に代わるものを明確にするのに苦労しています。\nインカ帝国の征服についてのジャレド・ダイアモンドの記述は、私の幼稚園から高校までの歴史の授業で1回だけでなく2回も出てきました。\nの歴史の授業に出てきました。) スペイン征服の7つの神話』を読んだのは...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qjt3ko/why_do_americans_have_storage_units_is_this_a.json": "私はアジアに住んでいますが、これには頭が下がります。このユニットを購入した人のビデオをたくさん見ますが\nなぜ新しい所有者があなたの持ち物を手に入れるのでしょうか？これは、もしあなたが\n払ってもらえなかったり、捨てられたりするのでしょうか？混乱しています。",
  "data/reddit-ask/r/askphilosophy/comments/qjpxuz/what_is_the_best_argument_for_gods_existence.json": "ありがとうございます。",
  "data/reddit-ask/r/NoStupidQuestions/comments/qjxvhr/how_did_we_as_a_society_decide_that_toilet_paper.json": "これは米国に限ったことではありますが、私の考えでは、私たちが集団で行っていることの中で、最も嫌で古臭いことのひとつです。\n私たちが一般的に行っていることの中で、最も嫌悪感を抱く古風なもののひとつです。\n\n個人的には、糞をした後はシャワーに直行します。\nその方がより衛生的だと思うからです。最も嫌なことではないことはわかっています。\nことではないと思いますが...。"
}