{
  "data/reddit-ask/r/NoStupidQuestions/comments/npie2j/really_important_for_me_its_tearing_my_family.json": "2週間前の夕食時にこの話をしたら、家族がバラバラになってしまいました。\nしています。母は数千個しか入らないと思っていますが、父は数十億個と思っています。\n父は数十億、兄妹は数兆、私はせいぜい数百万、少なくても数十万だと思っています。\n私はせいぜい数百万、少なくても数十万だと思っています。それが多くの人を巻き込んで...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nphila/does_anyone_else_know_a_lot_of_people_but_still.json": "私は17歳の男性ですが、多くの人を知っていると思います。\nどこで会っても、1分から場合によっては1時間以上も会話ができるような人たちです。\n場合によっては1時間以上になることもあります。\n\nしかし、多くの人を知っていても、本当の意味での友達はまだいません。\n友達がいない...。",
  "data/reddit-ask/r/TrueAskReddit/comments/nphwqp/why_is_it_that_people_let_go_of_their_dreams_and.json": "私はまだ20歳ですが、このことについてよく考えます。夢を追いかけることが、自分の幸せにつながるのではないか。\n幸せになることではないのでしょうか？2.1人の子供がいて、郊外の家に住んでいて、普通の9時から5時までの生活をしていると\n私にはちょっとつまらないことのように思えます。この設定は多くの人にとってうまくいかないものですが、それでも\nこの設定は多くの人にとってうまくいかないのに、いまだにデフォルトとして見られています。どなたか年配の方に説明していただけますか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/npl4k3/can_anyone_give_advice_on_what_to_do_if_a.json": "アメリカ、カリフォルニア州 私の住んでいる地域は、ほとんどが路上駐車です。私の隣人はジャンクのBMWを買うのをやめません。\n誇張ではなく、彼は23台ものジャンクBMWを所有しています。\n誇張ではなく、彼は23台ほど持っていて、うちの通りの駐車場のほとんどを占領しています。彼らは全然いい車ではありません。\nほとんどが「クレイグリスト・スペシャル」です。彼の前庭はまるで...。",
  "data/reddit-ask/r/AskWomen/comments/npunfs/women_who_successfully_found_a_partner_online_how.json": "どのくらい探していましたか？何を基準にしていましたか？誰に会うかはどうやって決めたの？\nどうやって決めましたか？",
  "data/reddit-ask/r/AskWomen/comments/npueaq/women_who_started_making_a_lot_more_money_than.json": "ついつい、相手にしかできないようなことをしてしまう。\nしてしまうことはありませんか？\n\n何かするたびにお金を払う義務があると感じたり、何かプレゼントを持ってくる義務があると感じたりしていませんか？\nプレゼントを持ってくるなどの義務を感じますか？大家族や両親、兄弟姉妹の場合はどうでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/npwj4l/am_i_the_only_one_who_thinks_it_is_too_much_of_a.json": "私はこの症状をオープンにすることを否定しているわけではありません。\n私がネット上で出会ったこの症候群のティーンエイジャーは皆、同じようにエッジの効いた発言をしているのが面白いです。\nティックで、いつも指をくわえて、「ファックユー」と言って、首を前に曲げています。\nもし、私がこの症状について、ただのアホであるならば...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nptvvi/do_you_feel_that_hollywood_films_have_lost_the.json": "ここ10年ほど、ハリウッド映画が記憶に残らなくなってきています。I\n俳優の名前も覚えられないし、知る気にもなれない。例えば、スパイダーマンが\nが公開された時、映画を見た後にトビー・マクガイアとキルスティン・ダンストが誰なのか覚えていた。\nとKirsten Dunstの名前を覚えていました。でも、今のスパイダーマンは知らないんです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/npv2et/almost_30yrs_old_and_i_feel_like_im_still_waiting.json": "私はもうすぐ30歳になりますが、まだ付き合ったこともなく、日々の生活を送っています。\n具体的なキャリアプランもなく、常に何かを待っているような気がしています。\n実現しない何かを待っているような気がしています。世界で起こっていることを考えると、私の心配は浅はかに思えるかもしれません。\n世界で起こっていることを考えると、私の心配は浅はかだと思いますが、私は...",
  "data/reddit-ask/r/askscience/comments/npwh7z/a_2_year_old_toddler_learns_about_6000_words_and.json": "A」と「B」という2歳の子供がいるとします。A君は幼少期を両親だけで過ごしてきました。\n両親だけで過ごしてきました。Bは、両親、祖父母、叔父叔母を含む共同家族で子供時代を過ごしました。\n両親、祖父母、叔父叔母を含む共同家族と過ごしました。果たして彼らの\n2歳の時の言葉の習得率は違うのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/npxb0w/testing_period_of_rules_change_no_exampleseeking.json": "皆さん、こんにちは。\n\n前置きが長くなりましたが\n\n私たちは、ルールを恒久的に変更することを考えています。\n例を求めない」ルールを削除し、より広範な許容範囲に変更することを考えています。今後1ヶ月間は\n今後1ヶ月間はテストを行い、その時点で恒久的な変更を行うかどうかを検討する予定です。\nこの変更を恒久的なものにするかどうかを検討します...",
  "data/reddit-ask/r/NoStupidQuestions/comments/npswf5/does_anyone_else_have_a_hard_time_being_on_social.json": "私が目にするのは、人々の生活が素晴らしいものばかりです。\n家が3軒、車が10台あって、1日も働かなくていいんだぜ。\n週に60時間も働かなければならないし、子供にも会えないし、寝ていても疲れてしまう。\nまるで自分が変わり者のようで、何もできないような...",
  "data/reddit-ask/r/AskHistorians/comments/nq7gze/why_are_greekroman_ruins_so_much_better_preserved.json": "イランは2,500年前から続く文明の中心地です。ペルシャの\n最盛期のペルシャの都市は、ギリシャの都市と同じくらい壮大なものでした。\nギリシャの古典建築はよく知られているのに、なぜ古代ペルシャの建築は知られていないのか？なぜ\nクテシフォン、パサルガダエ、ペルセポリスなどの遺跡がほとんど残っていないのはなぜだろう。",
  "data/reddit-ask/r/AskHistorians/comments/npvtx2/qin_and_zhao_mobilised_up_to_a_million_men_in.json": "タイトルの通り、長平の戦いの歴史的な描写は\n秦・趙ともに約50万人の規模の軍を送ったとあります。そして\n趙が敗れた後、秦は趙の兵士40万人を生き埋めにしたという。\n\nこのような数字はとても信じられません。比べてみると、軍隊は...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nq2xrt/why_does_it_bother_people_so_much_that_i_prefer.json": "最近、私の住んでいる州では、マスク規制が再び解除されました。私は外で働いています。\n私は街中で仕事をしていて、いろいろな整備工場やボディショップを回っています。\n人に会います。私は完全に予防接種を受けていますが、マスクをしている私に会う人のほとんどが\nワクチン接種をしているかどうか聞かれます（なぜマスクをしているかの釣り？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nqidvx/do_anyone_else_get_annoyed_at_someone_who.json": "こんな気持ちになるのはちょっと嫌だな...と思いながらも、この何か大事なことについて会話をしていると\n時には重要な話をしていても、彼らは突然、番組や携帯電話に夢中になってしまうのです。\n番組に夢中になったり（チャンネルを変えたり）、携帯電話に夢中になったりします。彼らはただ\n私の注意を引こうとすると、彼らは...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nqio9m/why_do_people_consider_jk_rowling_transphobic.json": "今気づいたのですが、彼女が実際に何を言ってこのようなキャンセルをしたのかよくわからないので\nで、そのツイートを見るためにgoogleにアクセスしました。トランスフォビア的なものは見当たりませんでした。\nそれとも私が間違った記事を読んでしまったのでしょうか？\n\n私は彼女を擁護しているわけではありませんが、非難しているわけでもありません。\n私が持っていないと仮定して...",
  "data/reddit-ask/r/AskHistorians/comments/nqlq0g/are_there_any_historical_figures_who_were_thought.json": "オットー・ブラウンは、ドイツの共産主義者で、ソ連や東\nドイツの共産主義者。後年、毛沢東の顧問を務めていた李徳であることが明らかになった。\n長征のリーダーだった毛沢東の顧問だったことが後に判明しました。他にも、2つの異なる歴史上の人物だと思われていた人たちの例はありますか？\n他にも、2人の異なる歴史上の人物だと思われていた人物が、...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nqka4y/why_dont_more_men_sit_when_they_pee.json": "最初はとんでもないことを言っているように見えるかもしれませんが、この記事の最後まで読んでいただければ\nこの記事を読むことで、皆さんの考えが少しでも変わることを願っています。\n\n私の考えでは、おしっこをするときに座ることにはたくさんの利点があります。\n\n 1. 目立たない。誰かのトイレに行って、その場でおしっこを漏らすのは絶対に嫌です。\n    誰かのトイレに行って、みんなに聞こえるような大音量で小便をするのは絶対に嫌です。",
  "data/reddit-ask/r/AskHistorians/comments/nqv7cl/a_1944_comic_in_which_lex_luthor_uses_an_atomic.json": "加えて、誰か答えを持っている人がいれば。\n\n * マンハッタン計画以前から、原子エネルギーを武器に使うというアイデアがポップカルチャーの中に存在していたことは知っています。\n   マンハッタン計画以前から、原子エネルギーを武器に使うというアイデアが大衆文化の中にあったことは知っている。もし原子爆弾のアイデアが漫画家が知っているほど有名だったとしたら\n   漫画家が知っているほど有名だったとしたら、漫画の読者が......を知ることに何の問題があるのでしょうか。\n   漫画家が知っているほど原子爆弾のアイデアがよく知られていたとしたら、漫画本の読者が知っていることに何の問題があるだろうか。",
  "data/reddit-ask/r/AskHistorians/comments/nqq21z/what_was_the_process_to_reintegrate_newly.json": "バンド・オブ・ブラザース』では、強制収容所を解放するシーンがあります。\nしかし、兵士たちは、栄養失調のために囚人たちにあまり多くの食料を与えることはできないと言われます。\n栄養失調になっているため、あまり多くの食料を与えることはできないと言われ、囚人たちを収容所に戻さなければなりません。\n収容所に戻らなければなりません。\n\n具体的にはどのようなプロセスなのかというと...。",
  "data/reddit-ask/r/AskHistorians/comments/nqny7g/who_was_the_gentleman_who_stands_outside_the.json": "このウィキペディアの記事によると\n[https://en.wikipedia.org/wiki/Uniforms_of_the_Royal_Air_Force#Historic_uniforms]\n後にRAFの空軍元帥となったジョン・スレソーは、当時のRAFのユニフォームを\n当時のRAFの制服について、「汚い淡いブルーにたくさんの金色をあしらったもの。\nそれを見ると、どうにもこうにも...。",
  "data/reddit-ask/r/Ask_Politics/comments/nqmpw2/is_critical_race_theory_something_that_is.json": "最近、保守派の人たちが、全米の学校で批判的人種理論を教えているという話をよく耳にします。\n批判的人種理論を教えています。しかし、実際に教えている学校を聞いたことがありません。\n実際に教えている学校はありません。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nqug8y/does_anyone_else_hate_when_people_call_them.json": "私はもう、誰からの電話かわからないと携帯電話にも出ませんし、「If\n大事な用件ならメッセージを残すだろう \"と言っています。私が思うに、ほとんどの場合、テキストを使うことで\n自分の考えを明確にしたり、自分の言っていることを考えたりする時間が増えるだけでなく\n双方が他の作業に集中することができるからだと思います（not...",
  "data/reddit-ask/r/NoStupidQuestions/comments/nqt9qd/if_i_was_going_to_die_of_heat_stroke_and_only_had.json": "簡単に言うと、ボールがないと仮定します。",
  "data/reddit-ask/r/askscience/comments/nqvz98/what_exactly_is_missing_for_the_covid19_vaccines.json": "ワクチンの安全性と有効性を示す結果を信頼しています。私は\n反ワクチン派ではない人と話していたのですが、コビドのワクチンは急がされていると言って受けたくないと言っていました。\nワクチンは急いで作られたものだと言っていました。私は、その人に、このワクチンはある一定の基準を満たしていると説明しました。\n徹底したブラインドテストを行い、重要なステップを省略していないことを説明しました。また、私は...",
  "data/reddit-ask/r/AskHistorians/comments/nr3vaw/what_were_some_notable_or_interesting_conspiracy.json": "最近、別の場所での交流がきっかけで、過去の陰謀論について考えてみました。\n過去にどのような陰謀論があったのかを考えてみました。また、それらが何か大きな影響を与えたのか、それともただ単に奇妙なだけだったのかにも興味があります。\n奇妙なものだったのか、ということです。国が間違った情報を作ったり広めたりすることは聞いたことがありますが\n誤報キャンペーンを行う国があると聞いたことがありますが、正直なところ調べたことはありません...。",
  "data/reddit-ask/r/AskHistorians/comments/nrca05/why_were_the_27th_army_group_killing_other_army.json": "天安門事件で私が理解できなかったことの1つに\n第27軍団は、警察や他の軍団を虐殺したり、軍の衛生兵や警官隊をAPCで轢いたり、銃撃したりしていたようです。\n兵士を撃ったり、負傷した兵士を処刑したりしていました。\n兵士を撃ち、負傷した兵士を処刑した。\n\n私が読んだところでは、彼らは...",
  "data/reddit-ask/r/AskHistorians/comments/nr8qo8/why_are_chinese_dynasties_not_named_after_the.json": "通常、\"dynasty \"は、ハプスブルク家のような支配者や有力者の一族を指します。\nハプスブルク家のように。しかし、中国の歴史では、「王朝」は別の用語のようです。\n中国の歴史では、「王朝」は別の用語のようで、中国が異なる家系に支配された時代ごとに\n王朝」と呼ばれていますが、支配者一族の名前は付いていません....",
  "data/reddit-ask/r/AskHistorians/comments/nrclng/where_does_the_idea_that_poverty_is_a_moral.json": "私はエッセイを書いているのですが、私が主張したのは、「貧しい人が貧しいのは、その人自身の道徳的な欠陥のためだ」と言っている人がいるということです。\n貧乏人は自分のモラルがないから貧乏なんだ」と言っています。私が若い頃、学校で聞いたことがあります。\nしかし、私は信頼できるソースを見つけることができませんでしたし、ソースを見つけることもできませんでした。\nと言っています。では、この発言は全くの誤りなのでしょうか？その...",
  "data/reddit-ask/r/NoStupidQuestions/comments/nrhvg1/are_there_any_subreddits_on_this_site_that.json": "あるsubredditに投稿しようとしたところ、アカウントが60日以上経っていないと投稿できないと言われました。\nまた、投稿するには500のコメントカルマが必要だと言われました。\n\nこれはちょっと馬鹿げていると思いました。新規ユーザーはどうやって\n6つのサブレディットしかないのに、新規ユーザーはどうやって活動するのでしょうか？",
  "data/reddit-ask/r/TrueAskReddit/comments/nr9gco/why_are_people_as_a_whole_so_unforgiving_of_first.json": "一般的に、人は誰かの第一印象を手放すのが難しいと言われています。\n人の第一印象を捨てきれない人が多いようです（私も時々そうです）。第一印象は\n私の経験では、第一印象はほとんど正確ではありません。例えば、人があなたに慣れるのに時間がかかったり、最初は緊張していたり\n最初は緊張していたり、社会的な状況を始めるのが難しかったりします。では、なぜ...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nrjqxm/is_it_weird_that_im_irked_by_someone_bringing_up.json": "私はバイセクシャルの女性で、現在シスの関係にあります。私はバイセクシャルであることを誇りに思っています。\n私のセクシュアリティを知っている人は多いと思います。私は今まで、自分の個性の大きな部分を占めているとは\n自分の性格の大部分を占めていると感じたことはありません。\n男性と付き合ったこともあります。私はたまたまコミットした...",
  "data/reddit-ask/r/NoStupidQuestions/comments/nrj9te/you_ever_look_in_the_mirror_directly_into_your.json": "あなたが魅力的に見えるからでも、その逆でもなく、目を見開くという行為は\n目を見開いて自分を直視するという行為に、私は恐怖を感じます。それはまるで\n私は本当にこの体をコントロールしているのだろうか \"と考えてしまうのです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nrmlaa/how_do_people_see_thunderstorms_as_a_form_of.json": "誰か教えてください。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nrmf3h/does_anyone_else_not_believe_in_religion_or.json": "私は無神論者ですが、宗教について学ぶことはとてもクールで、とても興味深いことです。\n興味深いです。また、オカルトマジックなども超面白いです。\n\n今日、友達と一緒にマジックショップに行ったんだけど、そこでは癒しや幸運をもたらすクリスタルが売られていて\nタロットカードもあったし、本もあったし・・・。",
  "data/reddit-ask/r/NoStupidQuestions/comments/nrjbbm/why_arent_there_playgrounds_for_adults.json": "大きな公園でも、どの遊び場を見ても、13歳以下の子供向けのものばかりですし\n11歳までは遊ばないことになっています。私は、ブランコや\nブランコや鉄棒、ロッククライミング、滑り台などがあるところはありません。\nただ。大人のための遊び場です。大人のサイズのものです。私は...",
  "data/reddit-ask/r/AskHistorians/comments/nrho2x/the_rise_of_nazi_germany_is_often_blamed_on_the.json": "これは私が以前から疑問に思っていたことです。イタリアには\nイタリアは、ナチスが支配権を獲得できた理由としてよく挙げられる条約や賠償金、制限などの負担がなかった。\nナチスが支持を得られた理由として挙げられる条約や賠償金、制限などがイタリアにはありませんでした。\n\n当時のイタリアの状況は、一般市民にとって悪いものだったのだろうか？彼らは第一次世界大戦を\n第一次世界大戦を虚しいものと捉えていたのか......。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ns0c9e/why_does_modern_healthcare_focus_on_extending.json": "私の大学では、化学療法の有効性やアルツハイマー病患者の寿命が向上したという論文を目にします。\n私の大学では、化学療法の効果が上がったとか、アルツハイマー病の患者さんが長生きしたとかいう発表を目にします。しかし、糖尿病や脊柱管狭窄症の患者さんが\n糖尿病や脊柱管狭窄症の人がより便利な生活を送るための治療法のニュースはない。\nなどなど。\n\n人々がますます長生きするようになると、経済を圧迫することになります。人々の...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ns44ru/should_onlyfans_models_have_to_pay_to_advertise.json": "Nsfw redditはOnlyfans、Snapchat seller、cash appなどで台無しになっていると思います。\nなどなど。私は、女性がこのようなことをしたいのであれば、何の問題もありませんが、私が思うに、redditは、自由に共有したい人々のためのアマチュアのユーザーコンテンツプラットフォームです。\n私が思うに、redditは、アイデア、写真、ミーム、アートなどを自由に共有したい人たちのための、アマチュアのユーザーコンテンツプラットフォームです。\nアイデア、写真、ミーム、アートなどを自由に共有したい人たちのためのアマチュア・ユーザー・コンテンツ・プラットフォームです。",
  "data/reddit-ask/r/AskHistorians/comments/ns5e22/its_some_time_between_18301860_and_im_a_white.json": "ネイティブからの脅威だけでなく、環境や動物からの脅威もあります。\n私はどのような環境や動物の脅威に直面するのだろうか？",
  "data/reddit-ask/r/AskHistorians/comments/nseqms/from_1876_to_1916_the_two_main_spanish_political.json": "このシステムは、あまりにも魅力的で奇妙なので、何を質問していいのかわからない。\n質問していいのかわからないほどです。私は当時のスペインの政治情勢についてはまったく無知なので\n当時のスペインの政治情勢についても全く無知なので、どんな背景があるのか興味があります。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nsj5v3/does_anyone_else_feel_like_they_lack_that.json": "私は大学入学を数ヶ月後に控えていますが、私が選んだコースはまだ\n私が選んだコースは、まだほんの少ししか興味を持っていないように感じます。\n\nこれは学校の勉強に限ったことではありません。\n\n具体的な夢を持っていない他の人たちと比べても、私の場合は、そのようなことはないということに気づきました。\n夢を持っていない人と比べても",
  "data/reddit-ask/r/NoStupidQuestions/comments/nsn21l/does_anyone_else_find_taking_a_shower_to_be.json": "毎回1マイルは走った気がします。",
  "data/reddit-ask/r/Ask_Politics/comments/ns83ic/can_democrats_pass_smaller_piecemeal.json": "超高速インターネットのように、20年後の未来を見据えたインフラの必要性は、誰もが感じていると思います。\n20年後にインターネットが数十億倍になっても、私たちの生活が破綻しないような、将来性のあるインフラが必要です。\n20年後にインターネットの速度が何十億倍にもなっていても、地方のコミュニティがアクセスできるような\nアクセスできるようになります。\n\nインターネットの速度が遅いことは、地方のコミュニティにとっては死刑宣告です。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nslehx/why_cant_we_keep_masks_on_as_a_normal_clothing.json": "新しいデザインのマスクを装着することで、多くの可能性を秘めています。\nマスクをすると\n\n病気からの保護\n\n人やカメラによる顔認識からのプライバシー\n\n不安要素（ニキビや傷など）のカバー\n\n自分が誰であるかということで差別されにくい\n\n私たちが惹かれるのは...",
  "data/reddit-ask/r/askscience/comments/nsqumo/is_there_an_orbital_distance_that_would_allow_an.json": "私の理解では、物体が軌道上にあるためには、地表に近ければ近いほど速く移動しなければなりません。\n地表に近いほど速く移動しなければなりません。\n\n地球の自転が遅すぎて、同じ速度で移動しても軌道上に留まることができないのかもしれません。\n軌道上に留まるには、地球の回転が遅すぎるのかもしれません。\n\nしかし、私は地球の軌道上に、ある地点があるかどうか知りたいと思いました。\n植えられる場所があるのかどうか...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nsrexe/is_it_normal_to_think_every_now_and_then_that_it.json": "もし私が生まれてこなかったら、人生のすべてのクレイジーな出来事や苦労を経験することはなかっただろうと思うのです。\n私は、生まれてこなかったら、人生のクレイジーさや苦難を経験することはなかっただろうと思います。素敵なこともあるとは思うのですが\nバランスが取れていないような気がします...。正直なところ、全然足りていません。\nつまり... 何のために？このクソみたいな経験をして、決して...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nstk03/why_name_a_condom_trojan.json": "くだらないと思われるかもしれませんが、とても気になることがあります。なぜコンドームのブランド名に\nトロイの木馬が、トロイ戦争の時にトロイ人をおびき寄せてギリシャ人を取り込み、敵が寝ている時に攻撃するためのものだったとしたら、なぜコンドームにトロイの木馬というブランド名をつけるのか。\nトロイの木馬は、トロイ戦争でトロイ人をおびき寄せてギリシャ人を取り込み、敵が眠っている間に攻撃するためのものだったとしたら。\nその意味はかなり矛盾しているのでは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nsuw1h/why_do_people_claim_looks_and_money_dont_matter.json": "はっきり言って、女性は男性に恋愛の義務があるなどとは思っていません。しかし、私は\nしかし、男性がデートの悩みや見た目の影響を語ると、即座にバッシングされたり、恥をかかされたりするような気がしてなりません。\n見た目がどのように影響するかを男性が話すと、即座にバッシングされ、恥をかかされるような気がしてなりません。\"Just be confident bro\"\n\" それはあなたの性格のせいでしょう」。人はどうして否定したり...",
  "data/reddit-ask/r/NoStupidQuestions/comments/nsw6qt/is_it_normal_i_18_m_still_have_sleepovers_with_my.json": "僕は18歳の男ですが、この女の子は僕と同い年で、3歳の頃からの親友です。\n3歳の頃からの親友で、今はただの友達です。保育園で出会って以来、僕らは\n幼稚園で出会って以来、意気投合して、秋には同じ大学に一緒に行くことになったんだ。私たちの\n金曜日の夜のお泊り会は、私たちの友情以来の伝統なの...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nsxya5/does_anyone_else_get_the_inescapable_feeling_that.json": "この数週間、私は腹の底から揺るぎない悲しみを感じていました。\nそれは自分自身や自分の人生に対する悲しみだったような気がします。私は本当に子供時代を過ごすことができませんでした。\n私は子供時代を過ごせなかったし、特に普通の10代を過ごすことができませんでした。\nを経験しました。私が16歳のときに父が亡くなり、私は自分の役割を果たさなければなりませんでした...",
  "data/reddit-ask/r/AskWomen/comments/nswcxs/update_supplementary_rules_for_thersday_here_to.json": "皆さん、こんにちは。6月も順調にスタートしていることと思います。ここでは、モデレーションポリシーに関する\n今回は、モデレーションポリシーに関する注意点と最新情報をお届けします。早速ですが、今回は\n\n\nTHERSDAY\n\nあなたが提案し、私たちはそれに耳を傾けました：あなたは母性、子育て、妊娠、および同様の関連記事のない日を望んでいたのです。\n母性、子育て、妊娠、その他類似の関連記事がない日を望んでいました。これを受けて、私たちはこの日を拡大しました。",
  "data/reddit-ask/r/AskWomen/comments/nsym37/what_did_you_buy_from_social_media_that_actually.json": "興味本位で反対側の投稿に便乗してみました..... 買ってよかったものは何ですか？\n驚いたことはありますか？",
  "data/reddit-ask/r/askphilosophy/comments/nssovk/i_need_book_recommendations_to_practice_critical.json": "どのような誤謬が存在するかについては、理論的なレベルではよくわかっています。しかし\n誤謬のリストはかなり長いので、オットの議論をすぐに分析して誤謬を探すのは難しいです。\nしかし、誤謬のリストはかなり長いので、すぐに議論を分析して誤謬を探すのは難しいです。\n\n数学の教科書のような）練習問題がある本や教科書はありますか？\nのような）練習問題がある本や教科書はありますか？",
  "data/reddit-ask/r/AskWomen/comments/nt1frm/women_who_arewere_pregnant_but_were_unable_to_get.json": "unable to」というのは、あらゆる理由（法律、宗教、信念など）によるものです。",
  "data/reddit-ask/r/AskHistorians/comments/nt4qj1/what_drove_printing_press_makers_to_include_the.json": "インターネットで言語のビデオを見ていたら、古い棘のある文字「þ（th）」について話していた。\nとげのある文字「þ」（th）が、一般的な書体では使用できなかったため、印刷された本では「y」（Ye Olde Whateverのように）に変換されてしまったという話でした。\n印刷された本の中では、「y」に変換されていました。\nこれは、一般的なフォントでは使用できなかったからです。同様に、かつては「ß」という文字がありましたが、これは...",
  "data/reddit-ask/r/AskHistorians/comments/nsxmcf/why_is_south_africa_the_only_african_country_with.json": "特にサブサハラ・アフリカ諸国です。私は、17〜1800年代（だったと思う）に、ヨーロッパ諸国の間で\nアフリカのどの地域を誰が植民地にするかを巡って、ヨーロッパ諸国の間で権力闘争が繰り広げられたことは知っています。\n誰がアフリカのどの地域を植民地にするかで、ヨーロッパの国々の間で権力争いがあったことを知っています。北アフリカは、おそらく白人の人口が多いと思います。\n北アフリカは白人の人口が多いと思いますが、それは北アフリカに非常に近いからではないでしょうか。",
  "data/reddit-ask/r/NoStupidQuestions/comments/nt9k93/is_it_weird_for_me_to_like_moss_over_any_other.json": "誰もが... 気に入りましたか？柔らかくて、鮮やかな緑で、個性的。\n個性的で、変なところで見つけられるし、実際に膨大な種類があって\nバラエティに富んでいます\n\nなるほど...。孤独な苔クラブを作るしかないのかな。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ntd4l2/does_anyone_else_feel_scared_and_overwhelmed_as.json": "家賃を払わないと家にいられない、そのためには月曜日に仕事をしないといけない、ということを考えると、ちょっと立ち止まってみたくなる。\nそのためには月曜日に仕事をしなければならないことを考えると、過呼吸になりそうになる。\n過呼吸のようになってしまいます。仕事を失うことを心配し始め、どれくらいの期間これを続けなければならないのかを考え始めます。\nあと50年から60年は働かないといけないんじゃないかと思い始めました。",
  "data/reddit-ask/r/NoStupidQuestions/comments/ntaatz/why_is_it_so_much_easier_to_spot_typos_only_𝘢𝘧𝘵𝘦𝘳.json": "私は誓って、私が作っている投稿や、私が送っているメッセージ、あるいは\n何度も何度も読み返してみます。\n誤字脱字、句読点や語調などの一般的な誤りに気づくのは、完成して送信ボタンを押したときです。\n句読点や語調などの一般的な誤りを発見してしまう\n\n確かに私だけではありません。なぜかというと・・・。",
  "data/reddit-ask/r/AskHistorians/comments/nt3l5t/shakespeare_wrote_hamlet_and_had_a_son_called.json": "同じ名前なのに、標準化されていないために違う表記になっている。\nスペルが違うのでしょうか？\n\n別の名前だが、たまたま似たような綴りになっているのか？\n\nこのように名前の文字を変えることはよくあったのでしょうか？また、他にも例があるのでしょうか？\n\n自分の子供に何か重要なことを名前にするのは一般的だったのでしょうか？",
  "data/reddit-ask/r/Ask_Politics/comments/nsxy3l/what_is_the_connection_between_qanon_and_the.json": "QAnonは明らかに共和党の政治に大きな影響を与えています。\n十数人の \"QAnon \"下院議員が自分たちの議会を持っています。\n\nしかし、これは何なのか、彼らは何を望んでいるのか、そしてなぜ地球上で最も強力な国であるこの国の政治に関わっているのか。\n地球上で最も強力な国の政治に、なぜこのようなものが存在するのでしょうか？\n\nリズ・チェイニーは共和党が...と警告しました。",
  "data/reddit-ask/r/NoStupidQuestions/comments/ntbada/my_dog_pooped_out_a_condom_should_i_be_worried.json": "同棲している彼女と付き合って半年ほど経ちました。ある夜、私が犬の散歩をしていると\n犬の散歩中に犬がコンドームを漏らしてしまいました。彼女は避妊をしていたので\n私たちは約6ヶ月間コンドームを使用していませんでした。心配すべきでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/ntcbl5/why_would_a_grave_in_rural_vermont_be_surrounded.json": "こんにちは！私はバーモント州の田舎に住んでいます。私はバーモント州の田舎に住んでいて、地元にはとても小さな墓地があります。\n半年に一度の割合で訪れています。そこには家族が埋葬されています。そこにある石の多くは\nその墓地にある石の多くは1800年代半ばから後半のものですが、最近のものもあります。\n\n私が質問している特定の石は、日付が...",
  "data/reddit-ask/r/AskWomen/comments/ntgoww/for_those_who_got_into_a_healthy_relationship.json": "特に最初は毒のある人間関係しか経験していない人にとっては",
  "data/reddit-ask/r/NoStupidQuestions/comments/ntedlf/wouldnt_any_plane_you_cant_identify_be_a_ufo.json": "誰もが「UFOは実在する」「政府がUFOを確認した」と言っています。\nUFO」と言っていますが、UFOとは、空を飛んでいて、識別できない物体を指すのではないでしょうか？\n識別できない物体が飛んでいたら、それをUFOと呼ぶのではないでしょうか？正直なところ、これは文法的な質問というよりも、もっと些細な質問です。\nしかし、UFOはすでに実在していたのではないでしょうか、そして...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ntqokq/you_ever_notice_that_the_people_who_acts_like.json": "それはなぜだろう。彼らの頭の中には、「ああ、この人は私と同じことをした。\n禁止にしてしまおう」と考えたのでしょうか。",
  "data/reddit-ask/r/AskHistorians/comments/nu7c4e/why_did_nearly_all_of_the_worlds_civilisations.json": "人間は20万年前から存在していたと言われています。世界で最初の文明は\nメソポタミアという世界初の文明が誕生したのは、わずか1万2千年ほど前のことです。私が想像するに\n人類が誕生してから文明が誕生するまでに、必要な期間はないのではないでしょうか。\n人類が誕生してから、文明が誕生するまでに必要な期間はないのではないでしょうか。メソポタミアは約18万8,000年かけて誕生した...。",
  "data/reddit-ask/r/AskHistorians/comments/nu4ges/since_potatoes_have_not_been_discovered_yet_what.json": "ジャガイモは、一般的な食生活には欠かせないものですが、北米で発見されたという点では、私にとっては比較的新しいものです。\nジャガイモは北米で発見されたということで、私にとっては比較的新しいものです。ジャガイモを料理に取り入れる前には\nジャガイモが食卓に登場する前には、伝統的な根菜やデンプンが料理に使われていたのでしょうか？\nあったのでしょうか？",
  "data/reddit-ask/r/TrueAskReddit/comments/nu6yrp/is_companies_stealing_our_data_really_that_bad.json": "以前は、パーソナライズド広告はちょっと不愉快で侵略的なものだと思っていました。思うに、それは\nあなたの習慣を記録しているのですから。しかし、しばらくすると、私はそれらに慣れて\nでも、しばらくすると慣れてきて、本当に気にする必要があるのかと考えるようになりました。最悪の場合、私が好きなものを宣伝してくれるのであれば\n私が好きなものを宣伝してくれるなら、それでいいと思う。正直言って...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nue4o2/why_do_people_think_that_lollipops_are_only_for.json": "私は17歳の男ですが、ロリポップを食べていると、誰もが「私はもうすぐ大人だ。\nロリポップは子供のものだから、大人のおやつを食べた方がいい」と言われてしまいます。\n大人のおやつを食べるべきだと言われます。",
  "data/reddit-ask/r/AskWomen/comments/nukdsz/women_who_dont_like_bras_how_do_you_get_away.json": "人前でシャツの下に乳首があるのと、パッド付きのブラジャーの下に乳首が隠れているのとでは、どちらが安心できるかということです。\nパッド付きのブラジャーの下に隠しているのとでは それとも、ブラジャーをつけずに乳首を隠す方法がありますか？\n乳首を隠す方法はありますか？",
  "data/reddit-ask/r/askphilosophy/comments/nu74bw/ethics_is_it_okay_to_enjoy_the_rain.json": "くだらない質問ですが、ここに書いておきます。\n\n台風やハリケーンがもたらした雨を楽しむことは、倫理的に「大丈夫」でしょうか？\n倫理的に問題ないのでしょうか？\n\n私は台風が頻繁に来る国の出身ですが、内向的な私は雨が心地よく感じます。\n内向的な私にとって、雨は心地良いものです....",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nuhsxp/does_anybody_else_have_a_slight_fear_of_a_snake.json": "私はイギリスに住んでいますが、ありえないことだとは思いますが、トイレから入ってきた蛇に噛まれた人のニュースを聞いたことがあります。\nトイレに入ってきた蛇に噛まれた人のニュースを聞いたことがあります。\n何もできなくなるわけではないのですが、万が一に備えてトイレにトイレットペーパーを詰める傾向があります。\n私は万が一に備えてトイレにトイレットペーパーを詰める傾向があるので、その方法を知りたいと思っています。",
  "data/reddit-ask/r/AskHistorians/comments/nue09r/its_europe_in_the_14th_century_and_war_is_raging.json": "現代では、明らかに、大統領が中東のキャンプに入り込んだとしたら\n彼は十分に知られているので、もし誰かが彼になりすましていたとしたら、それはミスティックな状況です。\n誰かが彼になりすましているとしたら、それはミスティークのような状況であり、無作為に彼を名乗っているわけではありません。\n\nこの質問は、実際に「ウエスト・ウィング」のエピソードから来ています。",
  "data/reddit-ask/r/askphilosophy/comments/nuktag/child_beauty_pageants.json": "こんにちは！私たちはイギリスの3年生／8年生で、倫理的なプロジェクトに取り組んでいます。\n子供の美容整形をテーマにして、それが道徳的に正当化されるかどうかを考えることにしました。\n道徳的に正当化されるかどうかをテーマにすることにしました。私たちは、試験の点数を上げるために、子供の美容整形についての哲学的な視点を探しています。\n私たちは、試験の点数の一つとして、子供の美容整形について哲学的な視点を探しています。",
  "data/reddit-ask/r/AskHistorians/comments/nuw3wt/in_the_sherlock_holmes_stories_holmes_and_watson.json": "これはもともと\n[https://www.reddit.com/r/AskHistorians/comments/my5go4/in_the_original_sherlock_holmes_stories_holmes/]\n先月、/u/Jerswarが質問していましたが、回答が得られなかったので、私も気になっています。\nとのことです。",
  "data/reddit-ask/r/AskHistorians/comments/nun2k9/how_common_would_knowledge_of_spaghetti_be_in.json": "先日、『リード・デッド・リデンプション2』をプレイしたのですが、その中で、あるキャラクターが「客として来ていたイタリア人からスパゲッティを食べた。\nスパゲッティを食べたが、他のキャラクターはそれが何なのかわからなかった。\n他のキャラクターはそれが何なのか知らないようでした。そのキャラクターは\n見た目はミミズのようで、味は...」と言っていました。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nv1slj/what_do_you_do_when_you_realize_you_are_the_toxic.json": "最近、私は目を覚まされました。私の婚約者（今年の年末に結婚します）が\n今年の年末に結婚する）が、私が永遠に良いパートナーであると感じられるかどうか、考え直していると言ったのです。\n私は永遠に良いパートナーであり続けることができるのだろうか？その言葉は、貨物列車のように私を襲いました。私は今まで\n自分がどれだけひどいパートナーであったか、あまりにも見えていませんでした。それは...",
  "data/reddit-ask/r/AskHistorians/comments/nuz38g/how_did_nations_during_the_height_of_naval.json": "基本的にはその通りだと思います。推測するに、ある国が他の国に宣戦布告した場合、彼らは海上の船と連絡を取ろうとしましたか？\n他国に宣戦布告した場合、海上の船、特に軍艦と連絡を取り、外交状況の変化を知らせようとしたのでしょうか？\n外交状況の変化を知らせるために、海上の船、特に軍艦と連絡を取ろうとしましたか？それとも\n自分たちだけでやっていたのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/nv5rcr/two_of_my_favorite_movies_the_kings_speech_and.json": "前者では、チャーチルは、エドワードとウォリス・シンプソンの結婚に反対するような、王室の尊敬すべきアドバイザーとして登場します。\nエドワードとウォリス・シンプソンとの結婚に反対し、バーティにキング・ジョージ6世という名前を勧める人物として登場しています。\nバーティはキング・ジョージ6世を自分の名前として使うように提案した人物です。\n\n後者では、ジョージ王はチャーチルを軽蔑しているように見えますし、二人は確かに......。\nしているようです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/nvisiu/can_someone_please_tell_me_why_my_dog_decided.json": "彼女は反省もせずに捨てられ、そもそもなぜそれが必要だったのかを知りたい。\nそもそもの話です。なぜだ。",
  "data/reddit-ask/r/NoStupidQuestions/comments/nvn4nx/what_does_dying_feel_like.json": "私は21歳で、末期がんの患者です。しばらくは調子が良かったのですが\n借りていた時間が終わってしまったようです。私は肺にユーイング肉腫を患っています。\n肺にユーイング肉腫がありますが、これがさらに進行するとどうなるのか、誰か教えてください。\nこの病気がさらに進行し始めるとどうなるのか、誰か教えてください。私が知りたいのは、私が何をしているのかということです...",
  "data/reddit-ask/r/AskHistorians/comments/nvj04f/is_there_a_working_theory_for_how_ancient.json": "私の調査によると、現代人からのクロスコンタミネーションはほぼ排除されているようです。\n同一のミイラを異なる人が異なる方法で検査していますので、現代人からの交差汚染はほぼ否定されています。\n同じミイラでも異なる民族、異なる方法で検査されています。\n\n\n\n古代エジプト人は、西洋に伝わる薬物をどのように...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nvjot0/is_it_ok_to_just_feel_fucking_sad_all_of_the.json": "時々、こんな風に思うことがあります。良い生活、良い友人などがいます。でも\n時々、数時間だけ悲しい気持ちになることがあって、その理由がわからないことがあるんです。例えば\n今、私は200ドルを失ったので、そのことで自分自身にかなり腹を立てています。\nしかし、多くの場合、理由もなく悲しみが訪れ、私は...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nvoskj/am_i_bad_for_being_slightly_sad_that_lockdown.json": "ロックダウンは最悪でしたが、少なくとも私だけがいつも家に一人で閉じ込められているようには感じませんでした。\nひとりで家に閉じ込められているような感覚はなくなりました。今はロックダウンが解除されたように感じますが、私個人としては\n個人的には、お店に行けるようになったことを除けば、まだ続いています...。",
  "data/reddit-ask/r/askphilosophy/comments/nvnqib/whats_a_day_in_the_life_of_a_philosophy_professor.json": "私は高校生で、この進路を考えています。\nタイトルに加えて、やりがい、給料、仕事のチャンスなど、何でも答えてください。\nその他、特記すべきことがあれば教えてください。",
  "data/reddit-ask/r/AskHistorians/comments/nvjqln/in_the_united_states_especially_among.json": "米国では、少なくとも1930年代から、高等教育が共産主義につながるのではないかという恐れが\nアメリカでは、少なくとも1930年代から、高等教育が共産主義につながるという恐れが、一般の人々の意識の中にはっきりと存在していたようです。このような\n前近代・近世の高等教育機関、あるいは古代の高等教育機関でも、過激化への同様の恐れがあったのでしょうか。\n前近代・近世の高等教育機関、あるいは古代の高等教育機関においても、同様の過激化の恐れがあったのでしょうか。",
  "data/reddit-ask/r/AskHistorians/comments/nvygz0/when_did_99_pricing_become_ubiquitous.json": "20ドルよりも1999ドルの方が正当化しやすい、という基本的な心理は理解できます。\n20ドルではなく19.99ドルを使うことを正当化しやすいという基本的な心理は理解できます。しかし、いつからこのような価格設定が一般的になったのでしょうか？\nこのような価格設定が一般的になったのはいつ頃なのでしょうか？また、このような価格設定を始めた人や業界はあるのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/nw8wkg/am_i_being_abused.json": "友人に聞くと「そうだね」と言われますが、家族に聞くと「馬鹿げている」と言われます。\nと言われてしまいます。\n\n私はドアに鍵をかけてはいけないのですが、両親はドアに南京錠をかけているので、私は南京錠なしでは家を出ません。\nそれがないと家から出られません。父はいつも何かにつけて私たちに大声で叫び、母はいつも怒っています。\n母は私が何かするといつも怒っていて・・・。",
  "data/reddit-ask/r/AskHistorians/comments/nw7r1f/the_mt_vernon_website_lists_at_least_one.json": "記事へのリンクはこちらです。\nhttps://www.mountvernon.org/george-washington/health/washingtons-teeth/george-washington-and-slave-teeth/#-\n\nこの記事の著者は、この取り決めはワシントン大統領と無名の奴隷の間で共通かつ自発的に行われたと結論づけているようです。\nワシントン大統領と無名の奴隷の間で自発的に行われたものであると結論づけています。",
  "data/reddit-ask/r/AskHistorians/comments/nvz3ap/why_is_judy_garland_regarded_as_a_gay_icon_when.json": "間違っているかもしれませんが、私は彼女の人生について読んでいました（うさぎの穴に入りました）。\n彼女がLGBTコミュニティに関係しているという記述はありませんでした。\nしかし、彼女はゲイのアイコンとして見られているようです（彼女の夫がゲイの不倫をしていたにもかかわらず\nしかし、彼女はゲイのアイコンとして見られているようです。) 私が見たのは、彼女のいくつかのコメントだけですが・・・。",
  "data/reddit-ask/r/AskHistorians/comments/nw4z28/when_did_a_few_seconds_of_harp_music_become.json": "誰かが「昨日のことのように覚えている」と言うと、ハープが鳴るというのは定番のパターンです。\nと言うと、ハープが鳴って、波打って記憶や夢の中に入っていくというのが定番です。\nこれはどのように始まって、ここまで具体的になったのでしょうか？",
  "data/reddit-ask/r/askscience/comments/nw9z9h/what_affects_the_lifespan_of_memory_t_and_b_cells.json": "気になって情報を探していたのですが、どうしても見つかりませんでした。\n見つかりませんでした。記憶リンパ球が感染後に形成されることは知っています。しかし\nなぜ長生きする人としない人がいるのか、何がそうさせるのかは知りませんでした....",
  "data/reddit-ask/r/askscience/comments/nvzdow/why_doesnt_the_strong_nuclear_force_have_an.json": "つまり、強い核力は、弱い力のようなもので、範囲が狭いのです。\n\n強い力の範囲は約1x10^-15メートル（つまりかなりの短距離）。\n\n弱い力は、実際には存在しないほど巨大な粒子によって伝達されるため、範囲が狭いのです。\n弱い力は、巨大な粒子によって伝達されるため、範囲が狭く、実際には作ることができません。",
  "data/reddit-ask/r/AskHistorians/comments/nwicge/gonzalo_guerrero_was_shipwrecked_and_then.json": "ゴンサロ・ゲレロは、マヤにとって貴重な軍事知識を持っていたのでしょうか？\nマヤにとって貴重な軍事知識を手に入れたのでしょうか？そしてそれは、スペインの辺境の地から来た下層階級の船乗りが持っているのが普通でしょうか？\nスペインの辺境の地から来た下層階級の船乗りが持っているのが普通でしょうか？\n\nまた、マヤではカッチェク（軍閥）を地元の貴族の生まれの人に限定していたのではないでしょうか？\n貴族の出身者に限定するのでは？\n\nまた、ついでに言えば、...",
  "data/reddit-ask/r/AskHistorians/comments/nwc23c/historians_who_specialize_in_early_american.json": "この9ヶ月間、私は、1804年に建てられたと広く伝えられているオハイオ州シンシナティの家の年代を確認しようとしてきた。\nオハイオ州シンシナティの家は、1804年に建てられたと広く伝えられている。\n\n事実はこうだ。新聞記事や郡の記録、家のプレートには1804年と書かれていますが\n事実：新聞記事、郡の記録、家のプレートには1804年と書かれていますが、私は1834年までしか確認できませんでした。それは地図に記載されている日付です。\nプレートの日付です。",
  "data/reddit-ask/r/AskHistorians/comments/nwemge/did_some_early_american_settlers_abandon_their.json": "歴史家の皆さん、今回のテーマが面白くて魅力的なものになることを願っています。\n議論していただきたいと思います。\n\n要するに、どこかでいくつかのコメントを読んだのですが、その要点はこうです。\n\n\"一部のピューリタンは、植民地を離れてネイティブ・アメリカンと暮らすことを決めた。\nアメリカ人と一緒に暮らそうと考えた」というものです。\n\n他のコメントによると、若いピューリタンは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nw2ev1/am_i_in_the_minority_for_disliking_cars_and.json": "私の頭の中では、都市部であれば自分の車は必要ないと考えています。\nそこがポイントなんですよね。密度が高いということは\n密集しているということは、徒歩、自転車、公共交通機関、あるいはライドシェアですべてを達成できるということです。車が増えると\n車が増えると、その能力が失われてしまいます...",
  "data/reddit-ask/r/AskWomen/comments/nwmq9y/ladies_how_did_you_push_yourself_to_take_care_of.json": "身体的、精神的、感情的、そして霊的なすべての面で。",
  "data/reddit-ask/r/askscience/comments/nwl3ck/why_does_the_moderna_vaccine_include_two_100.json": "考えると、全体の有効率は同程度です。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nwnf5q/does_anyone_else_get_mildly_depressed_when_you.json": "誰かの動画を見終わって、その人のチャンネルを見に行ったら、最後にアップロードされたのが1年前だった時のような感覚。\n最後にアップロードされたのが1年前だった時のような感覚です。有名なチャンネルならまだいいのですが\n知名度の高いチャンネルならまだしも、小さなチャンネルだと悲しい気持ちになります。それは\n物語を読み終えた時のような、憂鬱な気分になります。それは...",
  "data/reddit-ask/r/NoStupidQuestions/comments/nwllt6/if_a_smoker_falls_into_a_coma_for_a_long_time.json": "こんなに長い間タバコを吸っていないということは、タバコをあきらめたようなものです。\nタバコを吸うのをあきらめたような",
  "data/reddit-ask/r/askphilosophy/comments/nwhto2/can_philosophy_offer_some_comfort.json": "私は哲学者でもなければ、哲学の訓練を受けたわけでもなく、ほとんどのことを理解できるほど賢くもありません。\n私は哲学者でもないし、哲学の訓練を受けたわけでもないし、ほとんどのことを理解できるほど頭がいいわけでもありません。\nと形而上学的な不確かさであり、同等の論理的強度を持つ議論を提供する学派の間で迷っています。\n同等の論理的強度を持つと思われる論者の間で迷っています。",
  "data/reddit-ask/r/AskHistorians/comments/nwn6ga/given_strong_mongol_taboos_around_blood_and_the.json": "ジャック・ウェザーフォードの「ジンギスカンと近代世界の形成」を読み終えました。\nウェザーフォード この本は、モンゴル人とその歴史について魅力的に語っています。\nモンゴル人とその文化、そしてその文化が他の文化に与えた影響について、何世紀にもわたって流布されてきた誤解を解きほぐしてくれます。\n興味深い内容でした。\n\n読んでみて疑問に思ったことがあります。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nwyyr6/as_a_white_person_living_in_the_us_i_want_someone.json": "*ずっと前に学校で習っておくべきだった。",
  "data/reddit-ask/r/NoStupidQuestions/comments/nx4vp6/does_anyone_else_get_really_sad_on_their.json": "今日は私の誕生日ですが、私は毎年、本当に落ち込んでしまいます。これは\n人にはよくあることなのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/nx6zjc/does_anybody_else_stop_their_microwave_at_exactly.json": "P.S. (最後の3回のビープ音があなたを裏切ります)",
  "data/reddit-ask/r/askphilosophy/comments/nwqiup/south_asian_philosophy.json": "皆さん、こんにちは。私はアメリカの学校で哲学を学んでいる南アジアの学生です。\n哲学は大好きですが、読むものの多くは明らかに西洋哲学です。私は\n誰か、私が始めるためにチェックできる本や作家を知っている人はいませんか？\n誰かに聞いてみたいと思います。明らかに、以下のようなものがあります...",
  "data/reddit-ask/r/AskWomen/comments/nx3rnu/how_did_you_learn_to_stop_apologizing_for.json": "-20代の女性",
  "data/reddit-ask/r/AskHistorians/comments/nx5znk/are_the_stories_of_a_society_a_reflection_of_its.json": "ケルトやアイルランドの民話をよく読んでいるのですが、そこにはたくさんの\n近親相姦、そして多くのレイプもあります。\n\n疑問なのは、作家や語り部が物語のスパイスとして装飾を加えたのか、それともレイプや近親相姦は当たり前だったのかということです。\nそれとも、レイプや近親相姦は当たり前のことだったのでしょうか？ それとも、王族同士のレイプや近親相姦は、王族の間では考えられなかったのでしょうか？\n王族間のレイプや近親相姦は考えられなかったのか？",
  "data/reddit-ask/r/AskHistorians/comments/nx0ckm/im_an_average_peasant_farmer_in_16th_century.json": "これには基本的な足し算、引き算、そしてある程度の経済の理解が含まれます。\n経済学の理解も必要です。平均的な農家の人たちは、大きな数字を扱えるだけの教育を受けていたでしょうか。\nそれとも、お金を数えるような単純なことしかできなかったのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/nx3z8b/what_were_napoleonic_war_veterans_opinions_about.json": "1858年に撮影されたナポレオン軍の兵士の唯一の写真15枚を見て、私は疑問に思った。\n疑問に思った。彼らはナポレオン3世が権力を得たことをどう思っていたのだろうか。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nxa7pr/why_do_americans_always_go_on_about_freedom_like.json": "アメリカが他の国と比較されるとき、アメリカ人はいつも自分たちの自由を強みにするようです。\nアメリカ人は、他の国と比較されるときにはいつも、中国よりも自由であることを強みにしています。しかし、私には\nイギリスやEUにはない、アメリカの自由というものを理解できません。\nどちらかというと、私は資本主義に強制されていないと感じています...。",
  "data/reddit-ask/r/askscience/comments/nxakev/do_other_vaccines_that_are_widely_used_also_have.json": "ググってみましたが、コビドのワクチンに関するものしか出てきませんでした。\n驚くことではありませんが）。) そこで、広く使われている他のワクチン（インフルエンザやポリオなど）でも、1/2の確率で発症するものがあるのではないかと考えました。\n広く使われている他のワクチン（インフルエンザやポリオなど）でも、100万分の1の確率で血栓ができるのでは？\n血栓ができる確率は100万分の1なのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/nxi8ms/was_genghis_khans_mongolia_actually_safe_to_travel.json": "ゲンギスハーンが支配していた時代のモンゴルは、巡礼者や商人が端から端まで山賊に遭わず安全だったという話をよく聞きます。\n巡礼者や商人がどこまでも旅をしても山賊に遭わない安全な国だったとよく読みます。はたして\n果たしてそれは真実なのか？あんなに広大な土地を統治していて、どうしてそんなことが可能だったのか？\n可能だったのか？なぜ、規模の小さい他の帝国では...",
  "data/reddit-ask/r/AskHistorians/comments/nxmei0/was_there_any_resistance_to_the_rationing_that.json": "第二次世界大戦中のアメリカにおける配給制度は、アメリカ人にとって普遍的な市民の義務と考えられていたのでしょうか。\nアメリカ人にとって普遍的な市民の義務と考えられていたのか、それとも国民の間に顕著な抵抗があったのか。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nxlt49/why_is_it_that_the_phrase_you_get_what_you_pay.json": "例えば、人に最大限の努力を求めておきながら、極端に給料が安いというのは\nのか？私たちの仕事は、本質的に私たちが提供するものよりも価値が低いのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nxl479/why_are_conservatives_so_upset_over_critical_race.json": "40年以上前からあるんですか？なぜ突然、彼らはこんなにも動揺しているのか？\nそれは\n\n> 批判的人種理論は40年以上前からある学術的な概念です。\n> 批判的人種理論とは、40年以上前に提唱された学問的概念です。\n> 批判的人種理論は、人種差別は社会的な構成要素であり、単に個人の偏見の産物ではなく、...",
  "data/reddit-ask/r/askscience/comments/nxfyrs/does_anyone_know_what_octyal_hydroxide_stearate_is.json": "ググってみても、そんな名前のものは出てきません。代わりに出てくるのが\nステアリン酸オクチルは全く別物です。どなたかご存知でしたら\nまた、他の名前があるかどうかも知りたいです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nxt5lc/where_are_all_the_adult_jungle_gymsplaygrounds.json": "マジかよ！！！」と思った。公園や学校で子供用に用意されていますが、私がそれで遊んだら\n怪しい人になってしまいます。もっと多くの大人が、小学校の休み時間のように、遊びに行く楽しい場所を持っていたら\nもっと多くの大人が、小学校の休み時間のような楽しい遊び場を持てば、アメリカの肥満は減るでしょう。\nそうですね。\n\n体育館があると言っても、それは...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/nxlz42/why_are_american_houses_made_of_drywall.json": "誰かが壁に穴を開けたり、激しく傾いたりしている映像を見るたびに\n傾いている映像を見るたびに、アメリカの家はなぜあんなに薄っぺらい布でできているのだろうと\nアメリカの家はなぜあんなに薄っぺらい壁なんだろう？弱い地震などで崩れてしまいそうです。\nそんな感じです。",
  "data/reddit-ask/r/AskHistorians/comments/nxr1p2/the_last_emperor_was_filmed_in_beijing_in_the_the.json": "そのシーンはこちら[https://www.youtube.com/watch?v=9CitfXK_BvY]でご覧いただけます。\n溥儀の元収容所長で友人でもある人物が、紅衛兵に「腐った右翼」と罵倒されるシーン。\n\"腐った右翼」と罵倒されています。当時の中国共産党は、毛沢東の行き過ぎた行為に対するこのような批判を許容していたのでしょうか？\n当時の中国共産党は、毛沢東の行き過ぎた行為に対するこのような批判を許容していたのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/nxqxdv/why_was_the_us_army_so_stingy_with_awarding_the.json": "ジョージ・ワシントンは中将（死後1976年に昇格するまで）。\nワシントン以降、陸軍の最高位（司令官・参謀）は、准将、少将、中将が務めていました。\nグラントまでは、准将、少将、中将が務めていました。\nグラントは南北戦争後に昇進しました。グラントの2人の後継者は...",
  "data/reddit-ask/r/AskWomen/comments/nxet4a/how_do_you_deal_with_women_who_actively_put_you.json": "滅多にないことなのですが、いざそうなってしまうとどうしたらいいのかわからなくなってしまいます。\nそのような場合、皆さんはどのように対処されますか？",
  "data/reddit-ask/r/askscience/comments/nxr1z0/how_does_host_selection_work_for_different.json": "寄生蜂には何千種もの種類があり、毛虫や蜘蛛など、卵を産み付ける宿主も多様である。\nイモムシ、クモ、アブラムシなど、多様な宿主に卵を産み付ける。\nアブラムシなど しかし、例えば、タランチュラホウスズメバチが、イモムシに卵を産み付けて\n蜘蛛を好んで狙うだけなのか、それとも...",
  "data/reddit-ask/r/AskHistorians/comments/nxds21/how_did_american_emigrees_in_19101950s_europe_get.json": "1920年代の著名なアメリカ人の多く（ガートルード・スタイン、ジョセフィン・ベイカー、ヘミングウェイ。\nヘミングウェイ）は、フランスの市民権を持っていませんでしたが、長期間の滞在を許されていました。\nフランスに長期滞在することができました。\n\n彼らはビザを申請しなければならなかったのでしょうか、それともアメリカ人に広く門戸を開いていたのでしょうか。\n\n当時はパスポートが普及し始めたばかりで...。",
  "data/reddit-ask/r/AskHistorians/comments/nxvovr/how_would_a_medieval_banker_guarantee_that.json": "キングス*として",
  "data/reddit-ask/r/NoStupidQuestions/comments/nxsuee/why_do_people_like_joe_rogan.json": "何年も前から良い評判を聞いていたので、ようやく彼の作品を見てみましたが\n何年も前から良い評判を聞いていたのに、男 彼はただ、大きな酔っ払いのゴリラのように座っていて、「うーん...」と言っているだけ。\n時々 \"mm... \"と言って、本当に基本的な質問をします。私は彼のインタビューを見ました。\nMacaulay CulkinとRobery Downey Jr.のインタビューを見ましたが、彼はまるで・・・。",
  "data/reddit-ask/r/AskHistorians/comments/ny261y/how_did_skinhead_culture_got_hijacked_by_racists.json": "私が知っている限りでは、最初は無害な動きであった。しかし、その後、70年代、80年代に\nしかし、70年代、80年代になると、ネオナチと結びつくようになりました。その理由は何ですか？\nのか？",
  "data/reddit-ask/r/askscience/comments/ny6l7p/how_far_does_the_radius_of_suns_gravity_extend.json": "太陽の重力はどこまで届くのか？また、海王星を過ぎた天体にはどのような影響があるのでしょうか。\n海王星を過ぎた天体にはどのような影響があるのでしょうか？例えば、冥王星はどのようにして星系内に留まっているのでしょうか？太陽の重力によるものでしょうか？\n冥王星は、太陽の重力によって、あるいは星系内のすべての天体の重力の合計によって、どのように維持されているのでしょうか？太陽系の半径の大きさには何が影響するのでしょうか？\n太陽系の半径の大きさには何が影響するのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/ny7s7m/why_does_chris_brown_still_have_a_career.json": "そして、彼の支持者の大半が女性である理由は?????。",
  "data/reddit-ask/r/NoStupidQuestions/comments/ny4fnl/this_isnt_a_troll_post_but_i_need_to_know_if.json": "これは深刻な質問です。私は16歳です。\n私は機械を見るたびに、その機械になったときの気持ちを感じることができます。\n芝刈り機で草を刈るのがどんな感じか、車で高速道路を走るのがどんな感じかを知っているように。\n車でフリーウェイを走る気持ちがわかるように。ガレージのドアがどれだけ重いかは、それを感じることができるからです。\n想像するのではなく、感じるのです...。",
  "data/reddit-ask/r/AskWomen/comments/nxxlrv/hey_women_of_reddit_what_are_you_currently.json": "編集部：皆さん、本当にありがとうございました。本当に感動しました。\n皆さんにも成功例があるといいですね。\n\n周りの人にも、自分自身にも、より良い人間になれるように努力しています。\n周りの人にも、自分自身にも、後悔しないように改善していきたいと思います。",
  "data/reddit-ask/r/askscience/comments/ny2rl4/how_strong_is_the_evidence_for_alternative.json": "隕石の衝突。わかります。大きな衝撃、イリジウム、恐竜の死。しかし、最近、私は\nしかし、最近、ある地質学者に出会いました。彼は、大量絶滅とは無縁の、もっと大きなクレーターが他にもあることを指摘しています。\n大量絶滅とは無縁のもっと大きなクレーターがあると指摘し、K-Pg大量絶滅にはストーリーがあると確信している地質学者に最近出会いました。\nK-Pg大量絶滅イベントの背景にはもっと複雑なストーリーがあると確信している地質学者に出会いました。\n私は...",
  "data/reddit-ask/r/askscience/comments/nyfopn/would_any_of_the_recent_flu_vaccines_protect_me.json": "編集部：最近のインフルエンザワクチンで標的とされているマーカーのどれかが1918年型インフルエンザのものであるかどうか。\n1918年型インフルエンザの最近のインフルエンザワクチンで標的とされているマーカーはありますか、もしあったとしたら私を守ることができますか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nyohsc/what_happened_with_the_nursing_profession_when_i.json": "私が知っているアンチワクチンの馬鹿な人の中には、看護師がいます。そしてさらに\n最近の研究では、彼らは「ワクチンを躊躇する」ことが知られています。そうなんです。\n彼らは解剖学や生物学を知っていて、学位を持っている必要はないのでしょうか？\n\n昔からこうだったのか、私が気づかなかっただけなのか、それともだんだんと...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nymii2/i_wanted_to_kill_myself_at_18_but_i_only_kept.json": "私は、18歳の時よりも20代前半の今の方が、非常に行き詰まりを感じ、落ち込んでいます。\n18.",
  "data/reddit-ask/r/NoStupidQuestions/comments/nyqpcf/how_do_girls_cum_what_comes_out_and_how_long_does.json": "参考までに、私は宗教色の強い地域に住んでいて、私の学校の性教育は\n学校の性教育はかなりゴミのようなものです。避妊具を使わないことの危険性を教えてくれるだけで\n避妊具を使用しないことの危険性について教えるだけで、他には何もありません。私は17歳ですが、女性の解剖学について多くの質問があります。\n私は17歳ですが、学校や親が教えてくれないような女性の解剖学についてたくさんの疑問を持っています...。",
  "data/reddit-ask/r/askscience/comments/nyv1qh/why_dont_microplastics_keep_breaking_down.json": "私の理解では、「物」の断片が溶解したり、より小さな断片に分解されると\nそのプロセスは、表面積と体積の比率が変化することで加速されると理解しています。\n海の中のプラスチックは「マイクロ」サイズの破片に分解されたように見えますが\nそして...止まった？何か基本的な単位があるのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/nyw2g5/when_the_swedish_parliament_was_looking_for_a_new.json": "ジャン・ベルナドットがどのようにしてスウェーデンの王になったのかという話は、はっきり言ってかなりクレイジーです。\n控えめに言っても、映画で見たら全く馬鹿げていると言うでしょう。\nしかし、それが起きたのです。\n\nさて、私の理解が正しければ、スウェーデン議会にはいくつかの要件がありました。\n満たす必要がありました。\n\n * 君主は...であってはならない",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nz96dv/im_19_but.json": "気がつけばドールハウスを買いに行ったり、またおもちゃで遊んだりしたくなっていました。\nBPDのことで悩んでいて、何をすれば気分が良くなるのかと自問自答したところ、私の脳はおもちゃとドールハウスと答えました。\n私の脳はおもちゃとドールハウスと答えましたが、誰かがそれを再び手にしたことがありますか？\n密かに再び手にして、変な気分になった人はいますか？",
  "data/reddit-ask/r/askphilosophy/comments/nz0yey/do_forces_actually_exist.json": "ニュートン力学の代わりにラグランジュ力学を使って、物理の問題を練習していました。\n力があまり考慮されていないことに気づきました。\n力が考慮されていないことに気づき、力は実際に存在するのか、それとも\n力は物理学者が物体の動きを説明するために使っている便利な構成要素なのだろうか？",
  "data/reddit-ask/r/AskHistorians/comments/nyos7f/why_did_the_house_of_saud_choose_to_call_their.json": "私の理解では、イスラム教で自分を王と呼ぶことは、神への冒涜と考えられます。\n冒涜していると考えられます。では、なぜ\n非常に宗教的な国家を建設していたサウド家は、それをスルタンではなく、サウディアラビア王国と呼んでいました。\nスルタン国や首長国などではなく、なぜサウディアラビア王国と呼んだのでしょうか...。",
  "data/reddit-ask/r/AskHistorians/comments/nzaow1/how_many_doctors_and_other_professionals_knew.json": "編集部： 稼動中（内部告発者が名乗り出た1932年から1972年の間のどの時点でも\n行われていた間（内部告発者が名乗り出た1932年から1972年の間のいずれかの時点）、医療関係者の間ではどの程度常識になっていましたか？\n医療関係者の間ではどの程度知られていましたか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/nz5lri/am_i_the_only_one_that_just_gives_up_writing.json": "タイトルの意味 コメントへの返信を書いていて、途中で投げ出してしまうことがよくあります。\n誰も見てくれない、気にしてくれない、誰かが見てくれると思って、途中であきらめてコメントを捨ててしまうことがよくあります。\n誰も見てくれない、気にしてくれない、誰かが失礼なことを言うんじゃないか？今でも、この記事を書くのをやめたいと思っています。\nこの記事を書くのをやめようかと思っていますが、私はドラマになっているかどうかわかりません...。",
  "data/reddit-ask/r/AskHistorians/comments/nz71db/why_is_cocaine_not_as_wildly_accepted_now_as_it.json": "80年代から70年代にかけて、コークは大流行し、映画には予算がつき、雑誌にはコークストローの\n雑誌にはコークのストローの広告が掲載されていました。\n\nしかし最近では、当時のように文化的に許容されるレベルではありません。\n\n何が起こったのか？\n\nクラックの流行により、コークを使用している人のイメージが、ウォール街やハリウッドの金持ちの白人から変わったのでしょうか？\nハリウッドの富裕層から...",
  "data/reddit-ask/r/askscience/comments/nzh4j0/the_earth_is_about_45_billion_years_old_and_the.json": "どの時点で、その沈黙が知的生命体の稀少性を示していると言えるのでしょうか。\n知的生命体の希少性を示していると言えるでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/nzilbi/bathing_a_guest_and_rubbing_them_with_oil.json": "オデッセイを読んでいて思ったのですが、妻や娘が男性客を風呂に入れたり、油を塗ったりするのは\n男の客を風呂に入れたり、油を塗ったりしている。ネストルの娘の一人はテレマコスを、ヘレンはオデュッセウスを入浴させている。\nテレマカス、ヘレンはオデュッセウスを入浴させたという。古典には、私が知らないだけで、もっと多くの例があるはずです。\n古典の中にはもっとたくさんの例があると思いますが、私の頭の中では思いつきません...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/nzna5b/aunt_recently_diagnosed_with_alzheimers_how_do_i.json": "私にとってはデリケートな話題なので、投げやりに。\n\n\n\n私の大叔母は遠くに住んでいますが、いつも私の人生の中でとても身近で大切な存在でした。\n私の人生にとって大切な存在です。子供の頃、彼女は私に音楽を教えてくれました。\n私はプロのミュージシャンとして活躍しています。あまり詳しいことは言えませんが、私は彼女をとても愛しています。\nだから...",
  "data/reddit-ask/r/askphilosophy/comments/nzfzbs/reincarnation_doesnt_make_sense_to_me.json": "もし私が死んで、私の「魂」が別の人や物に生まれ変わるとしたら、その次の転生先では\n魂が別の人や物に生まれ変わったとしても、その人は私の記憶や身体的特徴を全く持っていません。\nその人はどんな意味で私と関係があるのでしょうか？\n\nもし他の転生体が全く異なる肉体と精神を持っているとしたら、私の他のどの部分が\n私のどの部分が...",
  "data/reddit-ask/r/NoStupidQuestions/comments/nz8hbk/are_men_not_supposed_to_wear_rings_while_engaged.json": "婚約したばかりの私は、地元の宝石店で指輪のサイズを測りに行きました。\n地元の宝石店に指輪のサイズを測りに行きました。\n\n店に着いて、ダイヤモンドを近くで見て、指輪をサイズ直しに出したのですが\nサイズ直しに出したところ、とても気に入った指輪が見つかりました。結局、自分用に購入しました。\n自分のために買うことにしました。",
  "data/reddit-ask/r/NoStupidQuestions/comments/nzmp1l/what_can_i_do_to_be_less_intimidatingscaring_to.json": "(私はredditを利用していないので、この質問をどこに投稿すればいいのかよくわかりません。\n頻繁には利用していません。もし、より適したsubredditをご存知でしたら、教えてください。ありがとうございます。)\n\n私(25m)はかなりの大男(6フィート3)です。2年前からハゲてきてしまいました。\n鏡を見るたびに生え際が気になって仕方がない...。",
  "data/reddit-ask/r/AskHistorians/comments/nzs2dt/in_9_ad_wang_mang_abolished_slavery_in_china.json": "また、このような大規模ともいえる改革をどのように進めていったのでしょうか。それは\nこの行動は、社会を改革したいという純粋な気持ちから行われたのか、それとも何かの政治的企てなのか\n政治的な企てか？",
  "data/reddit-ask/r/AskHistorians/comments/nzo9a8/were_there_any_prominent_abolitionists_among_the.json": "私は、奴隷制度が雇用不足などの問題を引き起こしたと多くの人が考えていたことを知っています。\nしかし、当時の主要な思想家たちが、このような問題に取り組んでいたかどうかは、私にはわかりません。\nしかし、この時代の主要な思想家の中に、奴隷制度という概念自体に反対していた人がいたかどうかはわかりません。\nということです。",
  "data/reddit-ask/r/AskHistorians/comments/nzn983/why_do_historians_point_to_the_invasion_of_poland.json": "第二次世界大戦の歴史は、ヒトラーのポーランド侵攻を「第一次世界大戦」と呼んでいるようです。\nポーランド侵攻が「公式」な開戦とされているようですが、なぜ中華民国と日本の間で起きた\n中華民国と日本の間で起きた盧溝橋事件が、なぜ第二次世界大戦の公式な開戦とみなされないのか？\n第二次世界大戦の公式な開戦とみなされないのはなぜか？一見すると、かなりのヨーロッパ中心主義のように見えますが...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nzpbxc/16_year_old_dating_a_24_year_old.json": "私は19歳（F）で、妹は16歳、彼氏は24歳です。妹は母や父には言っていません。\nなく、妹の友達も彼氏の友達も誰も知らないそうです。彼らは\n彼氏と彼女がすることはすべてやっていて、セックスもしています。彼女が私に話してくれたので、私は私の懸念を表明しました。\n明らかに私は認めていないので、心配しています。そして、私は知らない...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nzrld0/anyone_else_grow_up_not_with_role_models_but_with.json": "わかりづらかったらごめんなさい。基本的に私は、尊敬するモデルや指導者がいたという記憶がありません。\n尊敬したり、指導を受けたりするようなロールモデルがいた記憶はありません。私は、絶対にこうなりたくないと思う人たちと一緒に育ちました。\nのようになりたくない人たちと一緒に育ちました。彼らは悪い手本となり、私は彼らのようにならないために必要なことをしようとします。\n努力しています。似たような話をお持ちの方はいらっしゃいますか？また、どのようにして...",
  "data/reddit-ask/r/TrueAskReddit/comments/nzw8k6/why_is_male_bisexuality_doubted_more_than_female.json": "バイセクシャルは皮肉なことに、一部のストレートの人たちだけでなく、LGBTの世界でも汚名を着せられています。\n皮肉なことに、バイセクシャルは一部のストレートの人々だけでなく、LGBTの世界でも汚名を着せられています。一般的には、「バイの女性は、本当は\n男性の場合は、両方の性に惹かれていることになります。\n\nしかし、男性の場合、両方の性別に惹かれるということになると、多くの人が疑っています。\n疑ってしまいます。私が最近思ったのは...。",
  "data/reddit-ask/r/AskHistorians/comments/o038s0/roughly_2000_years_ago_paul_the_apostle.json": "私は、ユダヤ人という言葉が、名目上はユダ族の一員であることを示していると理解しています。\nユダ族の一員であることを理解しています。しかし、私の理解では、ユダヤ人という言葉は、現在、ヘブライ系の血を引くと主張するすべての人の包括的な用語であり\nヘブライ系の血を引く者の総称であり、実際のユダ族のメンバーに限らないということです。\nユダ族だけではありません。\n\nもし、すべてのユダヤ人がユダ族の子孫だったら...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0c4t2/anyone_else_finds_those_tedx_talks_pretentious.json": "嫌いな人は見なければいい」というのはわかっています。私はそのうちのいくつかを見ただけで\n十分でした。似非インテリが本質的に何もないことを話しているようにしか見えません。\n本質的には何もないことを話している似非知識人の集まりのようです。",
  "data/reddit-ask/r/askphilosophy/comments/nzz41t/is_necrophilia_immoral.json": "私の直感では、それは不道徳だと言いたいところですが、私は道徳哲学者ではありませんし、その立場を正当化できるかどうかもわかりません。\nその立場を正当化できるかどうかはわかりません。しかし、私は道徳哲学者ではありません。\n亡くなった方に失礼だとは思いますが、何もないものに失礼なことをするのは\n意識していないものに、どうして失礼なことができるのでしょうか、また、不道徳なことなのでしょうか...",
  "data/reddit-ask/r/AskHistorians/comments/o090b0/is_the_spanish_black_legend_a_real_thing_or_just.json": "スペインの黒い伝説」から、もっとニュアンスのある分析を取り出すことはできないだろうか。\nどの程度が真実で、どの程度が悪意のあるプロパガンダなのか。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0bqof/why_is_my_cat_hellbent_on_watching_me_take_a_shit.json": "狂ったようにドアを引っ掻き始め、私がドアを開けるまで止めません。\n私がドアを開けるまで止まりません。そして、私を見て判断します。\n\nいつも見ている、判断している、見ている",
  "data/reddit-ask/r/askscience/comments/o0bncs/askscience_ama_series_we_have_60_years_of.json": "\"私たちは、REN21 [https://www.ren21.net/] のチームの一員であり、学界、NGO、産業界、政府からなるネットワークです。\n学界、NGO、産業界、政府、個人で構成されたネットワークで、世界の再生可能エネルギーへの移行を支援しています。\n再生可能エネルギーへの移行を支援しています。\n\n本日、「Renewables 2021 Global Status Report」を発表したので、AMAを開催します。\nAMAを開催し、再生可能エネルギーについて語り合います。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0cy0x/ive_seen_women_complain_about_their_pocket_sizes.json": "そんなに必要なものなら、誰かが（おそらく女性が）女性向けにポケット付きの服を作ってくれてもいいんじゃないかな？\nポケットのついた女性向けの服を作ることができるのではないでしょうか？",
  "data/reddit-ask/r/askphilosophy/comments/o0cvm9/has_any_philosopher_ever_questioned_cogito_ergo.json": "ちょっと突飛な話かもしれませんが、このデカルトの基本的な真理にさえ疑問を投げかけるような哲学的な考えが、これまでに生まれたことがあるかどうかを知りたいのです。\nデカルトのこの基本的な真理にさえ疑問を投げかけるような哲学的な考えは生まれなかったのでしょうか？\n\nまた、「あなたは騙されているかもしれない」という仮説の証拠として、デカルトは\n私たちの感覚は不完全であり、それゆえに騙される可能性があるという事実を利用しました....",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0ilgt/how_do_you_feel_when_you_see_a_chubbier_guy_at.json": "私は17歳で、少しぽっちゃりしているので、ジムに行くのがちょっと心配です。私は\n不安を解消していますが、たまに人の目が気になります。",
  "data/reddit-ask/r/askscience/comments/o0cs74/did_the_goods_south_image_capture_colliding.json": "GOODSの南側の画像を見ていたら\n[https://hubblesite.org/contents/media/images/2016/39/3920-Image.html?keyword=goods]\n衝突している2つの銀河のようなものに気がつきました。\n[https://i.imgur.com/J3GBTVC.png]。\n\nこれは画像の錯覚なのか、それとも衝突しているのか...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0gnq2/why_do_we_add_yie_to_the_end_of_words_to_make.json": "例えば、以下のようなものです。DogはDoggieになります。Cat/KittenはKittyになります。RabbitsはBunnyです。\nいとこはクジラのぬいぐるみを持っていて、whaleyと名付けました。\nwhaley。かわいいものを表現するだけではありません。oopsとwhoopsは、oopsieとwhoopsieになります。\noopsieとwhoopsie。ウンチもウンピィになります。なぜ、私たちは...",
  "data/reddit-ask/r/askscience/comments/o0cbbe/if_the_earth_was_hit_by_another_large_planetary.json": "もし、他の大きな天体が衝突して、大量の破片が放出されて月ができたとしたら\n月ができたとしたら、私たちの軌道はおかしくなったはずです。\nなぜ、今でも比較的円形なのか？",
  "data/reddit-ask/r/askscience/comments/o0i9s0/how_deep_can_water_be_before_the_water_at_the.json": "水が純粋なH20（海水ではない）であると仮定します。水圧が相変化を起こすのに十分な深さになるまでに、この水\n水圧が相変化するのに十分な大きさになるまで、この水域はどのくらいの深さになるでしょうか？その深さでは、水はどのように見えますか？\nその深さでは水はどのように見えますか？どのような種類の氷ができますか？\n\n平均的な海水はこの答えを変えるでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/o0ii71/in_bbc_sitcom_blackadder_goes_forth_eponymous.json": "それとも、スーダンキャンペーンは、第一次世界大戦前の都合の良い裏話なのでしょうか？\nだろうか？戦闘の恐ろしさという点では、ボーアのキャンペーンの方が意味があるのではないでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0blll/why_are_there_people_in_developed_countries_who.json": "私は「Benefits Britain」を見ていたのですが、これは正直なところ、給付を受けている人を怠け者のように見せるためにかなり偏っています。\n正直なところ、給付金を受け取っている人々を怠惰な拝金主義者のように見せるために、かなり偏った見方をしています...。これは、それ自体が大きな問題です。\n\nしかし、それでも疑問は残ります。この人たちはいったい何なんだろう？とか\nプロテクションを使うことを考えないなんてありえない、なぜ...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o0sw1w/why_dont_we_reopen_most_things_and_just_let.json": "なぜ再開せずに、予防接種を受けたくない人たちに\n予防接種を受けたくない人が病気になってしまうのでは？今はまだ、予防接種を受けたい人が受けられない時期なのかもしれませんね。\n今はまだ、予防接種を受けたい人が受けられない段階なのかもしれません。とはいえ、そろそろ\n近づいているのでは？",
  "data/reddit-ask/r/askscience/comments/o0k1fs/why_are_liquids_almost_always_shinyreflective.json": "私は家具を塗装しているところですが、なぜほとんどのものが\n疑問に思ったのですが、なぜ液体状のものには光沢があるのでしょうか？フラットフィニッシュの塗料でも、乾くまではツヤがあります。\nペンキ、アイシング、ファンデーションなど、すべて濡れた状態では光沢があります。そして、素材によっては\n乾いて固まってもツヤがあるものがあります。なぜでしょう？私はそれが...",
  "data/reddit-ask/r/Ask_Politics/comments/o0dqh4/why_do_republicans_seem_to_be_more_organized_and.json": "皆さん、これは私がここ5～10年の間に気づいたことです。\n昔からそうだったのかもしれませんが、私がはっきりと気づかなかっただけかもしれません。でも。\n共和党による長期的な戦略や策略は、日本の場合よりもはるかに多いように思います。\n共和党の方が、民主党よりもはるかに長期的な戦略や策略があるように思えます。例えば、ニュースの中で...",
  "data/reddit-ask/r/AskHistorians/comments/o0w9hv/in_the_middle_ages_were_merchants_allowed_to.json": "著者は、羊毛商人が1ペニーを4分の1に切り分けて、ファースの支払いができるようにしたことを描いています。\nファーセントを払えるように。このようなことが許されていたのでしょうか？偽造や価値の低下を心配する国家は、汚損も避けたがるように思えます。\n偽造や価値の低下を心配する国家は、汚損を避けたいと思うでしょう。\nまた、人々はコインを丸ごと所有することを好むでしょう。",
  "data/reddit-ask/r/AskHistorians/comments/o0ts67/did_english_nobility_get_involved_in_the_lives_of.json": "初めてDownton Abbyを見ています。この番組では、架空のダウントン・アビーの領主であるクローリー夫妻が\n架空のダウントン・アビーの領主であるクローリー家は、その家で働き、暮らす使用人たちの生活にとても深く関わっています。\nこの番組では、架空のアビー屋敷の領主であるクローリー夫妻が、屋敷で働き、暮らす使用人たちの生活に深く関わっています。彼らの個人的な生活についてもよく知っています。\n彼らの私生活を熟知しており、さらには彼らに別の仕事を与えようと糸を引くことも......。",
  "data/reddit-ask/r/AskHistorians/comments/o0ywsi/how_did_the_sailors_of_the_earlymodern_and_even.json": "先日、昔の仲間たちとボートに乗る機会がありました。\n初めての経験だったので、サングラスを持ってこなかったのですが、とても明るい日だったので\n日でした。私は目を細めないように必死になっていたのですが、親友の一人が予備のサングラスを差し出してくれました。\nサングラスをくれました。私の目の救済は驚くべきもので、私は...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o0ya4i/can_anyone_tell_me_what_im_supposed_to_do_with_my.json": "今日は私のケーキの日です。2年目に突入したということはわかっているのですが（2回目です\n2回目）ということは知っていますが、特に何かをしなければならないということはありません。笑\n真面目にやっている人を見たことがありますが、それはRedditに最低でも2年はいることを示しているからなのかはわかりません。\nそれとも他に何かあるのでしょうか...。",
  "data/reddit-ask/r/AskHistorians/comments/o0u0e8/how_common_was_establishing_a_system_of.json": "塔の上の乙女の質問に触発されて...",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0w4xb/who_the_fuck_is_buying_all_these_houses_with_cash.json": "アメリカでは今、どこもかしこも異常な住宅危機に見舞われているようです。\n私が住んでいるところでは 私が住んでいるところでは、手頃な価格の住宅はゼロです。私が住んでいるところでは\nあっという間に買われてしまうので、実際には全く住宅がありません。このお金持ちの人たちはいったい誰？\nこのお金持ちの人たちは誰なんだろう？なぜ彼らは急に家を買うようになったのか...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o14hye/why_do_neonazis_so_often_deny_the_holocaust.json": "つまり、明らかに「彼らはバカだ」という事実はさておき、論理的には、もしネオナチがナチスをそれほど愛しているならば\nネオナチはナチスを愛しているのに、なぜそこまでして\n\"ホロコーストが起こらなかったことを「証明」しようとするのか？確かに、ナチスを愛し、崇拝しているのであれば\n彼らがナチスを愛し、崇拝しているのであれば、その「功績」を支持すべきであり、もし...",
  "data/reddit-ask/r/askscience/comments/o161aj/how_does_mad_cow_disease_stay_dormant_for_upto.json": "献血についてのスレッドを読んでいたら、狂乱期にイギリスで生まれた人は\n狂牛病が蔓延していた時代にイギリスで生まれた人は、現在でも献血をすることができないそうです。\n今日は 狂牛病はどのようにしてそんなに長い間、目に見える悪影響もなく眠っているのでしょうか？\n狂牛病はどうしてそんなに長い間、目に見える悪影響を受けずに眠っているのでしょうか？狂牛病が蔓延した時期に生まれた人は、現在でも献血ができないそうです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0zqp5/in_the_us_is_it_commonplace_to_have_a_garbage.json": "これが金持ちのことなのか、貧乏人のことなのか、アパートのことなのか、映画だけのことなのか、過去のことなのかを考えています。\nアパートのことなのか、映画の中だけのことなのか、過去のことなのか、それとも\nそれとも、普通にあるものなのかを考えています。誰かが手を入れて掃除するとスイッチが入るという話を聞きます。\n誰かが手を入れて掃除するとスイッチが入るとか、結婚指輪が......。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o15puc/how_do_i_tell_my_friends_that_am_dieing.json": ".... 私は去年の3月頃に末期の病気と診断されました。\nこのことを知っているのは、私の両親と数人の家族だけです.... 私が死ぬのは\n1年以内に死ぬと思います（最近の診断書によると）。\n\n友達は誰もこのことを知りません...。そして、これは私の大学時代の友人たちです。\nでした。....",
  "data/reddit-ask/r/AskHistorians/comments/o18r5m/in_1947_a_group_of_33_japanese_soldiers_on_the.json": "有名な日本軍の戦力外通告の話はもっと長いのですが、それでも日本兵の集団が\n日本兵の集団が4分の1以下の島で、生きて見つからずにいられるというのは\nマンハッタンの4分の1にも満たない大きさの島に、何千人もの敵兵がいる中で\n驚くべきことです。彼らについて、私たちは何を知っていますか？彼らはどのようにして...",
  "data/reddit-ask/r/askphilosophy/comments/o1bt7n/is_it_possible_to_understand_hegel_without_having.json": "私はただのエンジニアですが、悪い連中（哲学者）と仲良くなって、いろいろな哲学的なものを紹介してもらいました。\nいろんな哲学的なことを教えてもらった。ヘーゲルの話もしますが\n彼らはヘーゲルの話をしますが、それは私がアンテナ設計や高度な物理学の話をするのと同じようなものです。\nハイレベルな物理学を語るのと同じように。",
  "data/reddit-ask/r/AskWomen/comments/o1chlp/how_has_your_view_on_love_and_relationships.json": "上記の質問！？ある本を読み終えて、ここ数年で自分の恋愛観がどれだけ変わったかを実感しました。\n恋愛観がここ数年で大きく変わったことに気づかされました。",
  "data/reddit-ask/r/AskWomen/comments/o1fqfv/men_apply_for_a_job_when_they_meet_only_60_of_the.json": "ソース\nhttps://hbr.org/2014/08/why-women-dont-apply-for-jobs-unless-theyre-100-qualified\n\n女性が感じる「詐欺師症候群」が現実になってきた！？",
  "data/reddit-ask/r/AskHistorians/comments/o16rv2/is_the_current_obsession_with_spoilers_really_a.json": "redditでネタバレについての議論を読んだところ、一部のユーザーが以下のように主張していました。\n\"私たちの祖父母」はネタバレを気にしていなかったし、祖父母の時代には人々の娯楽への接し方が\n私たちの祖父母の時代には、エンターテイメントに対するアプローチの仕方が違っていたのです。現在のネタバレへのこだわりは\n祖父母の時代には、人々のエンターテイメントへの接し方は違っていた。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o1a7xr/what_do_orchestra_conductors_actually_do_to_help.json": "音楽家たちは皆、とても熱心に訓練されているように見えますし、全員がずっと楽譜を見ているように見えます。\n指揮者がいなくなっても、大きな違いはないのでしょうか？\n指揮者がいなくても、大きな違いはないのでしょうか？",
  "data/reddit-ask/r/askscience/comments/o13haj/what_happens_to_a_person_dying_of_thirst_if_they.json": "海を漂うイカダの上で喉が渇いて死にそうになっている人がいたら、助けにならないとわかっていても海水を飲みたくなるだろう。\n役に立たないとわかっていても、ついつい海水を飲んでしまいますよね。\n\n海水を飲んだら、その人はどうなるのでしょうか？\n\nいずれ死ぬことはわかっていますが、どのようにして死ぬのかが気になります。具体的には以下のようになります。\n起こるのか...。",
  "data/reddit-ask/r/Ask_Politics/comments/o143by/why_is_the_covid_lab_leak_theory_now_accepted_as.json": "念のために申し上げますが、研究室からの漏洩というのは、研究中のウイルスが逃げ出したということです。\n漏れたという意味です。\n\n研究室からの漏洩が絶対にあり得ないと考えていた科学者は少なかったと思います。\nしかし、コビットが自然由来ではないという話を持ち出す人は、ちょっとした陰謀論者と見なされた。\nちょっとした陰謀論者と見られていました。\n\nさて、その...",
  "data/reddit-ask/r/AskHistorians/comments/o14mpx/why_has_occultism_always_had_such_strong.json": "19世紀から20世紀にかけてのオカルティズムやエキゾテリシズムは、なぜファシズムや人種差別、伝統主義と強い結びつきがあるのか。\nファシズム、人種差別、伝統主義との強い結びつきがあるのはなぜでしょうか？\n\n例えば、ブラヴァツキーの人種観、ゲノンの多年主義の教義、エヴォラの自称「エヴォラ」などが挙げられます。\nエヴォラの自称「スーパーファシズム」などです。何か本質的なものがあるのでしょうか？\nあるのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/o15mft/why_do_some_americans_have_such_a_vehement_hate.json": "例えば、バイリンガルのアメリカ人が、バイリンガルの人に「英語がうまく話せない」と言っても\n例えば、英語がうまく話せないことを理由に、バイ/トリリンガルの人を非難するようなことです。しかし、英語以外の異なる言語を聞いただけで怒るのも\n英語以外の言語を聞いただけで怒る。\n\n実際の経験から疑問に思っただけです。\n\n編集部：たくさんの回答ありがとうございました！コンセンサスはただ...。",
  "data/reddit-ask/r/AskHistorians/comments/o1o7c9/did_fur_traders_in_north_america_build_extremely.json": "これは、カナダの教師たちが好んで繰り返す歴史的な「事実」です。\n何気ない会話の中にも出てきます）。)\n\n北米の毛皮貿易では、ヨーロッパ人は原住民が調達したビーバーの毛皮と金属製品を交換して、フェルトの帽子にしていました。\nビーバーの毛皮と交換して、フェルトの帽子にしてヨーロッパに持ち帰りました。\nヨーロッパでは その中で、...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o1kar4/is_it_normal_to_feel_sexual_attraction_but_not.json": "私は誰かとセックスする必要性を感じていませんが、自分が無性愛者だとも思いません。\nと思っています。\n\n私の理解では、無性愛者は性的魅力を感じませんが、私は感じます。I\n何人かの人をセクシーだと感じ、その人について性的な空想をすることができます。しかし、問題は\nしかし、現実にはその人とセックスしたいとは思いません。....",
  "data/reddit-ask/r/NoStupidQuestions/comments/o1tqer/are_most_white_collar_jobs_just_easy.json": "去年大学を卒業したばかりのみんな！？奇妙な出来事の連続といくつかの幸運(とタイミング？)により\n最初の仕事ではすぐに昇進して、今では年収6,000万円を超える高給取りのプロジェクトマネージャーになったよ。\nかなり高給取りのプロジェクト・マネージャーになって、年収はほぼ6桁で\n今では年収6桁に届きそうな高給取りのプロジェクト・マネージャーになり、最初の数ヶ月でトップ・エグゼクティブに報告するようになりました。",
  "data/reddit-ask/r/askscience/comments/o1ue31/how_does_the_immune_response_that_causes_hay.json": "私はいつもイネ科の花粉の季節になるとつらい思いをするのですが、最近になって\nモデナワクチンを接種しました。いつも使っている抗ヒスタミン剤を飲んでも、ワクチンの効果に影響はないと言われています。\nその理由を知りたいと思います。\n\nアレルギーは免疫反応であり、抗ヒスタミン薬は...",
  "data/reddit-ask/r/NoStupidQuestions/comments/o1sx6a/if_you_have_sex_with_someone_already_in_a.json": "最近わかったのは、すでに付き合っている人と、そのことを意識して寝るのは、何もしていないからOKだと思われていること。\nその事実を知っていても、何の義務もなく、何も悪いことをしていないので\n義務がないから、何も悪くない」と考えている人がいることを発見しました。\n\n私は個人的には間違っていると思います、浮気された相手以外の全ての当事者が\nしているのですから。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o1unkp/are_big_nipples_unattractive_and_why_do_mine_keep.json": "毎月、生理になると乳輪が大きくなり、とても大きくなります。\nこんなに乳輪が大きい人は、よほど胸が大きい人でない限り見たことがありません。\nこんなに乳輪が大きい人は、よほど胸が大きい人でない限り見たことがありません。私の胸はどちらかというと小～中くらいなので、おっぱいと乳首の比率が違います。\n乳首とおっぱいの比率が全然違います。これは現在も続いています。私が言うには、彼らは...",
  "data/reddit-ask/r/AskHistorians/comments/o1mlv0/was_13_year_olds_getting_married_in_tudor_times.json": "歴史的には20代まで結婚しない人が多かったと聞いています。\nしかし、18歳未満の結婚は合法でした（現在も多くの地域で合法ですが）。\n\nよく「ロミオ＆ジュリエット」や「キャサリン・ハワード」などの説明を聞きますが\nよく、ロミオとジュリエットや、キャサリン・ハワードとヘンリー・マノックスの関係を、年齢の違いから説明する人がいますが...。",
  "data/reddit-ask/r/AskHistorians/comments/o1vwdw/why_did_the_british_put_the_50year_provision.json": "私がこのことを理解できないのは、一方では、中国に香港を支配されたくなければ\n中国に香港を支配されたくないのであれば、そもそも領土を割譲しなければよかったのではないかと\n香港を中国に支配されたくないのであれば、そもそも領土を割譲しなかったはずです。その一方で、もし彼らが\n領土を譲らなければならないという強いプレッシャーを感じていたのであれば、なぜ...",
  "data/reddit-ask/r/NoStupidQuestions/comments/o1yk2w/do_couples_in_muslim_countries_often_confuse_or.json": "例えば、ブルカを着ていたら、誰が誰だかわからないでしょう。\n身長や声だけでは誰が誰だかわからないと思いますが、純粋に誰かを相手と勘違いしてしまうケースはありますか？\n他人をパートナーと勘違いしてしまうケースはありますか？",
  "data/reddit-ask/r/AskHistorians/comments/o23w6j/what_are_some_historical_examples_where_bad.json": "私が考えていたのは、ザポリジアン・コサックとマスコーヴィチとの間で結ばれたペレヤスラフ条約のことです。\nマスコビーとの間のペレヤスラフ条約を考えていました。コサック側はムスコヴィがコサック国と同盟を結ぶと言っていたようですが\nコサック側は「ムスコヴィがコサック国と同盟を結ぶ」と言い、ムスコヴィ側は「コサック国がムスコヴィの傘下に入る」と訳したらしい。\n国はムスコヴィの下になり、実質的にコサック国になる...と言っていたらしい。",
  "data/reddit-ask/r/AskHistorians/comments/o1vrue/how_historically_unusual_was_it_for_france_to.json": "自由の女神のような大きさのプレゼントは、なんとも不思議な感じがします。これまでに\n国同士でそのような大きなジェスチャーをした歴史はあるのでしょうか？両国の政府間でどのような\n両国の政府間でどのような調整が行われたのか、それとも、突然のことだったのか。\nサプライズだったのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/o1zp77/what_was_the_public_toilet_experience_in.json": "古代ローマのトイレについて私が知っている限りでは、彼らは木製、時には石製のベンチを備えた簡素な部屋でした。\n時には石造りのベンチが置かれていました。この簡素な部屋にはプライバシーはなく\nトイレに行く人が着ているチュニックを除けば、プライバシーはありません。ある場所では、バケツ\n共同で使うスポンジが棒についていて、それで拭くことができるようになっていました。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o285vz/am_i_the_only_one_who_cant_take_themselves.json": "相手に何かをしてあげようとすると、とても気まずくなります。\n笑われるのではないかと思ってしまいます。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o2bsbd/does_anyone_else_write_out_entire_narratives_in.json": "これは、私が参加しているすべてのサブマシンで常に行っていることです。私は誰かの投稿やコメントに\n誰かの投稿やコメントに反応して、全部スクラップしてしまいます。",
  "data/reddit-ask/r/Ask_Politics/comments/o1ncr8/can_states_move_their_election_days_to_juneteenth.json": "リベラル派の人たちが、選挙の日を国民の祝日にしようと呼びかけているのを見たことがあります。\n人々が投票しやすくなるように。民主的な政府を持ついくつかの州では\n民主的な政府を持ついくつかの州では、すでに選挙の日を州の休日にしていますが、これはその州の政府機関にのみ影響します。\nその州の政府機関にのみ影響を与えます。\n\nもし、民主党政権の州が...",
  "data/reddit-ask/r/AskHistorians/comments/o26prw/i_regularly_read_that_romans_greeks_and.json": "断食を推奨する作品からNYTのこんな記事まで\n[https://www.nytimes.com/2021/06/17/style/lindy.html]を読んでいると\nギリシャ人、ローマ人、ビザンチン人は朝食を食べなかったという話をよく読みます。\n\nしかし、ientaculumについては、多くの文献があるようです。\n\nでは、この考えはどのようにして生まれたのでしょうか？どこ...",
  "data/reddit-ask/r/AskHistorians/comments/o261sa/how_much_contact_did_medieval_europe_have_with.json": "アイスランドは、9世紀後半まで全くの無人島だったことはもちろん知っています。\n発見され、定住された後は、他のヨーロッパ諸国との交流はあったのでしょうか？\nヨーロッパの他の地域との交流はあったのでしょうか？\n\nまた、アイスランド人はグリーンランドのことを知っていたと思いますが、他のヨーロッパ人はグリーンランドのことを知っていたのでしょうか？\nアイスランド人はグリーンランドのことを知っていたでしょうが、他のヨーロッパ人はグリーンランドのことを知っていたのでしょうか？もしそうなら...。",
  "data/reddit-ask/r/askphilosophy/comments/o25763/do_there_exist_novels_or_other_fiction_works.json": "ここまで自然言語から切り離されたストーリーは、とてもクールだと思います。\n美しさや文章にこだわらず、人や物がどのように作用するかという前提や特性から\nこれほど自然言語から切り離された物語は、とてもクールだと思います。それが楽しいかどうかはわかりませんが\n楽しめるかどうかはわかりませんが、アイデアは面白いと思いますし、私なら...と思います。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o2gdtj/who_picks_up_a_seeingeye_dogs_poo.json": "目の見えない人が盲導犬を連れて外出したとき、犬がうんちをしなければならないとします。\nウンチをした場合、誰がそのウンチを拾いますか？その犬は目の見えない人を誘導するように訓練されているのでしょうか？\n誘導するように訓練されているのでしょうか？\n\n眠れない間に考えるくだらないことへようこそ(笑)。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o2bp0k/does_anyone_else_with_a_good_life_ever_just_feel.json": "多くの基準で、私は良い生活をしています。私は第一世界の国に住んでいます。私は\n楽しんでいる需要のある分野で、かなりの報酬を得られる仕事をしています。\n今の道を歩み続ければ、一生のうちにかなりのお金を稼げるだろう。私には7年間付き合っている彼女がいます。\n私には7年間付き合っている彼女がいて、心から愛しています。I...",
  "data/reddit-ask/r/NoStupidQuestions/comments/o2kmic/does_anyone_else_get_weirded_out_saying_their_own.json": "奇妙な質問ですが、私は誰かに自分の名前を言わなければならないとき、あるいは自分の名前を使って誰かのことを話さなければならないとき、不快になります。\n自分の名前を言わなければならない時や、自分の名前を使って他の人のことを話さなければならない時、私は不快になります。自分の名前が嫌いなわけではありませんが\n自分の名前は嫌いではないけど、言わなければならない時は好きになれません。誰かこのような人はいますか？",
  "data/reddit-ask/r/AskWomen/comments/o2loov/why_are_there_so_many_rules_around_what_women.json": "の女性だけの服の種類が多いように感じます。\n高校生後半から大学生の女性だけの服が多い気がします。高校生前半だと若すぎて\nみんなに批判されてしまう。大学生になると、「大人っぽい」服装が必要になります。\n\"大人っぽい \"格好をしないといけないし、そうしないと頑張りすぎだと思う。大人...",
  "data/reddit-ask/r/AskHistorians/comments/o2epi8/this_may_be_a_silly_question_but_did_medieval.json": "私は子供の頃、お姫様の衣装を持っていましたが、基本的には可愛いダンサブルな帽子に\nガーゼがついているものでした。ごく一部の歴史的なアイテムや絵画に描かれているのを見たことがありますが\n描かれているのを見たことがありますが、思ったほど一般的ではないようですね。はたして\nこれらのコーンハット／クラウンは本当に被られていたのでしょうか？誰が？そして、それらはただ着用されていたのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/o29obq/does_the_fantasy_trope_of_high_versions_of.json": "ファンタジーの世界では、ある社会の貴族が、一般的な言語とは異なる古いバージョンの言語を維持している例が多くあります。\n社会の貴族が、その社会の庶民の言語とは異なる古いバージョンの言語を維持している例があります。\n例えば「ゲーム・オブ・スローンズ」の高貴なヴァラリアン、あるいは\n40kのハイゴシックなどです。私が気になっているのは、これが純粋に「貴族の言葉」なのかということです。",
  "data/reddit-ask/r/AskHistorians/comments/o28p9v/the_temperance_movement_in_the_us_is_strongly.json": "昔、高校の歴史の先生がテンペランス運動は女性の間で広まったと言っていました。\n運動が女性の間で広く受け入れられ、会員になったのは\n禁酒法時代のアメリカでは、アルコール依存症の割合が非常に高かったため、女性の間で広く受け入れられ、会員になったのです。\n禁酒法以前のアメリカでは、アルコール依存症（したがって、飲酒による家庭内暴力）の割合が非常に高かったため、女性の間で広く受け入れられ、会員になったと述べていた。禁酒法時代のアメリカでは、アルコール依存症の割合が非常に高かったため、女性の間でテンペランス運動が広く受け入れられ、会員になったということでした。",
  "data/reddit-ask/r/AskHistorians/comments/o2pd09/did_the_television_show_frasier_influence_the.json": "数週間前に初めて「Frasier」を見たのですが、ナイルズやM.O.S.が、「Frasier」を見ている時に、何度も\nナイルズやマーティがスターバックスを超高級コーヒーと呼ぶ場面が何度かありました。\nナイルズにとっては、とても重要なことです。\n\nその時に気付いたのですが、確かにスターバックスは最初はシアトルのローカルなお店でした。\n一般の人にはわからなかったのではないかと思いました。",
  "data/reddit-ask/r/AskHistorians/comments/o2p66g/why_is_the_holiday_called_juneteenth_and_how_did.json": "何を祝う日なのかは知っているし、もちろんJuneteenthが6月と19日のポートマンテウであることも知っている。\nしかし、なぜ「奴隷解放の日」や「解放の日」ではなく、単に日付にちなんだ名前なのでしょうか？\n解放記念日」とか「解雇記念日」とかではなく、なぜ日付だけの名前なのでしょうか？そして、なぜ奴隷解放を祝う日なのでしょうか？\nそして、なぜ奴隷解放の日ではなく、奴隷解放を祝う日なのでしょうか...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o2q55n/is_it_normal_to_not_to_cry_in_a_sad_real_life.json": "すごく変なんです。例えばですよ。彼女が何か悪いことがあって泣いていたら、私は悲しいと思います。\n悲しいと思うけど、泣きたいとは思わない。音楽を聴いていて、ディズニー映画の古い曲を聴いていたら\n音楽を聴いていて、Tarzanのようなディズニー映画の古い曲を聴くと、赤ちゃんのように泣いてしまいます。または\n番組で悲しいシーンを見たり、本や漫画で読んだりすると...。",
  "data/reddit-ask/r/askphilosophy/comments/o2mshm/female_philosophers.json": "この1年で哲学に興味を持ち、ニーチェやストア派、カミュの作品をほぼすべて読みました。\nカミュの作品をほとんど読みましたが、女性の哲学者の作品はまだ読んでいません。\n女性の哲学者の作品はまだ読んでいません。\n\n私のように哲学に比較的慣れていない者にとって、読む価値のある女性哲学者は誰でしょうか？\n私のように哲学に比較的慣れていない者にとって、読む価値のある良い女性哲学者はいますか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/o2s8kl/is_anyone_noticing_a_huge_spike_in_ads_on_youtube.json": "正直、今はAd-Blockerを使いたいです。絶対におかしいです!\n\n15分のビデオの中に4つのダブル広告が入っています。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o2mi42/did_online_privacy_get_progressively_worse.json": "基本的には、悪化したのか、それともいつも同じで、今になって人々の意識が高まったのか。\nそれとも昔から同じで、今になってより意識されるようになったのでしょうか？Alexaのようなものは存在しなかったので除外しています。\nブラウザやインスタントメッセンジャーなど、既存の製品についても質問します。\nなどの既存の製品にも当てはまります。",
  "data/reddit-ask/r/AskHistorians/comments/o2lbf8/why_did_the_south_korea_and_the_west_help_north.json": "90年代は、北朝鮮が飢饉で崩壊寸前の国になり、ロシアが事実上の小国になった。\nロシアはソビエト連邦の崩壊と無能なエリツィン政権により、事実上の小国に成り下がっていました。\nロシアはソビエト連邦の崩壊と無能なエリツィン政権により事実上の小国になり、中国は今ほど強くなく、米国の世論は\n中国は今ほど強くはなく、アメリカの国民は...で元気を取り戻していた。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o2u9q0/why_is_everyone_so_accepting_of_being_spied_on_by.json": "私にはとても奇妙に思えますが、人々はそれを受け入れています。アメリカでは25日に憲法4条が改正されました。\n政府がこのようなことをするのを防ぐべきだと思います。携帯電話の電源を完全に切ることはできません。\nメーカーはバッテリーを簡単に取り外せないようにしているので、携帯電話の電源を完全に切ることはできません。\nまた、Apqple社が最近発表したばかりの「Find...",
  "data/reddit-ask/r/askscience/comments/o2tj79/why_dont_mrna_vaccines_require_an_adjuvant.json": "他のほとんどの種類のワクチン、特に不活化されたウイルス／細菌やサブユニット\nワクチンは、良好な免疫反応を引き出すために、アジュバントを併用する必要があります。\n免疫につながる良好な免疫反応を誘発するために、アジュバントを併用する必要があります。私の知る限り、ベクターワクチンもまた、アジュバントを含んでいます。\n\"私の知る限りでは、ベクターワクチンにも「アジュバント」が含まれていて、それはワクチンを投与するために使用される実際のウイルスの形をしています。",
  "data/reddit-ask/r/AskHistorians/comments/o316vw/in_philip_freemans_collection_of_irish_legends.json": "フリーマンの一節を紹介します。\n\n> ある若くて美しい修道女がいて、彼女は処女の誓いを立てた。\n> 彼女は処女の誓いを立てていたが、人間の弱さゆえに若い頃の欲望に負けて男と寝てしまった。\n> 彼女は妊娠し、子宮が膨らみ始めた。彼女はブリギッドのもとを訪れて\n> 彼女の赦しと助けを求めて ....",
  "data/reddit-ask/r/NoStupidQuestions/comments/o34lq6/why_do_humans_teeth_need_to_be_brushed_and_other.json": "なぜ他の動物は虫歯にならないのか、みたいな。彼らの歯と私たちの歯は何が違うのか？\n彼らの歯と私たちの歯は何が違っていて、私たちの歯は違ったダメージを受けるのでしょうか。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o3aiux/does_anyone_else_not_want_to_have_children_to.json": "私は、その言葉遣いが意味をなすことを望んでいます。\n\n私が子供を持ちたくない理由はいくつかありますが、包括的なものは\n人生は厳しいということです。新しい魂をこの世に送り出して、これまでの人生であったような面倒なことをさせるべきではないと思っています。\n新しい魂をこの世に送り出して、前の世代が残していったくだらないものに対処させるべきではないと思っています。\n\n否定的な意見もわかりますが...。",
  "data/reddit-ask/r/AskHistorians/comments/o38qsm/why_is_greece_known_by_a_significantly_different.json": "ヒンディー語ではギリシャはYunanと呼ばれています。これは今でも広く使われている言葉で、あちこちにYunaniの薬などを売る店があります。\n今でも広く使われていて、あちこちにYunaniの薬などを売る店があります。この2つの名前はどのようにして生まれたのでしょうか？\nどうやって生まれたのか、お互いにリンクしているのか、なぜこんなにも違うのか。\nお互いに。",
  "data/reddit-ask/r/AskHistorians/comments/o37ke4/when_did_the_us_navy_decide_to_build_ships_that.json": "そういえば、ロサンゼルスのUSSアイオワを訪れたとき、船の寸法を教えてくれた。\nこのクラスは、特にパナマ運河を通過できるように設計されています。\nパナマ運河を通過できるように設計されたと言っていましたが、それは海軍の艦艇を海岸から海岸へと迅速に移動できることが\n海軍艦艇を海岸から海岸へと迅速に移動させることは、米国にとって当然ながら非常に重要なことだったからです...。",
  "data/reddit-ask/r/askscience/comments/o39z7d/is_misophonia_culturally_dependent.json": "文化によっては、大きな声で食べることが礼儀とされています。私の家では、私はあなたを殺すかもしれません。\n私の家では、あなたを殺すかもしれません。ミソフォニアは、文化によって大きく異なる症状を示すものなのでしょうか？\nミソフォニアは、統合失調症のように、文化によって大きく異なる症状を示すものなのでしょうか？また、どのような\nその場合、どのような特徴があるのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/o35hm4/do_i_like_being_alone_or_is_being_alone_what_im.json": "正直なところ、私は友達がいないまま成長しました。子供の頃は、誰かの家に行ったこともなく\n他人の家に行ったこともないし、お泊りしたこともないし、誕生日会に行ったこともない。\nパーティーに行ったこともありませんでした。高校時代は、ダンスに行ったこともなければ、誰にもメールしたこともありません。\n放課後に人と会ったこともないし、彼女を作ったこともない....",
  "data/reddit-ask/r/AskHistorians/comments/o3hkld/an_explainer_of_juneteenth_and_a_celebration_of.json": "皆さん、Juneteenthおめでとうございます。\n\nご存知ない方もいらっしゃるかもしれませんが、ジュネーテンスはアメリカで奴隷制度が廃止されたことを祝う日です。\n6月19日にテキサス州ガルベストンがアメリカの統治下に入ったことを記念して、アメリカで奴隷制度が終了したことを祝う日です。\n6月19日にテキサス州ガルベストンがアメリカの支配下に入ったことを記念しています。ガルベストンは、奴隷解放宣言が出された最後の主要な反乱軍の領土でした。\nガルベストンは、奴隷解放宣言が出された最後の反乱軍の領土でした。",
  "data/reddit-ask/r/AskHistorians/comments/o3chqx/why_has_russia_never_collapsed.json": "なぜロシアは中国のような他の国のように崩壊したり分裂したりしないのか？\n中国のような他の国のように、ロシアが崩壊したり分裂したりしないのはなぜでしょう？ロシアは地理的に巨大で、文化的にも民族的にも信じられないほど多様です。\n民族的にも多様です。これほどバラバラで多様な国は、少なくとも2、3回は崩壊していると思っていたでしょう。\n少なくとも2、3回は崩壊しているだろうと思っていました。確かに、...",
  "data/reddit-ask/r/AskWomen/comments/o2yphg/what_are_your_main_problems_with_dating_in_general.json": "セクシュアリティやオリエンテーションは問いません！ 差し支えなければコメントに明記してください。\nしてください。",
  "data/reddit-ask/r/TrueAskReddit/comments/o3fyro/what_is_going_on_in_the_minds_of_those_lying_to.json": "この4人は\n[https://www.bbc.com/news/uk-england-hereford-worcester-57501164]は、病院に患者がいないように見せかけて\n病院に患者がいないように見せかけ、パンデミックが起きていないように見せかけました。なぜ\nなぜそんなことをしたのでしょうか？\n\nデマを信じる人の気持ちもわかります。人間はその種の問題を抱えています。\n人間にはそういう問題がある。しかし...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o3ok8m/who_else_deeply_loves_their_partner_but_would.json": "ガールフレンドと一緒に暮らして3年になります。二人ともお互いのことが大好きで\n今でも仲良くしています。同じ部屋で寝ない方が、お互いによく眠れることに気がつきました。\n同じ部屋で寝ない方がよく眠れるようになった。ベッドを共有していないカップルがいたら\nその経験を共有できるカップルはいますか？それはあなたを傷つけるか、強化するか...",
  "data/reddit-ask/r/askphilosophy/comments/o3ilnn/struggling_to_read_foucault_am_i_too_dumb_to_read.json": "2週間ほど前にMadness and Civilizationを始めました。ゆっくりと読んでいます。\n読んでいますが、章の終わりにはクリフノートを見て全体像を把握する必要があると感じています。\n全体のポイントを把握するためにクリフノートを見る必要があると感じています。\n\n時には、とても簡単に本を追うことができますが、他のポイント、特にFoucault...\nフーコーが...",
  "data/reddit-ask/r/NoStupidQuestions/comments/o3ps7m/how_the_heck_is_my_generation_supposed_to_buy.json": "私が目にするのは、住宅価格が過去最高を記録したという記事ばかりです。\n史上最高の住宅価格を記録し、その上昇率は一向に衰えそうにありません。\nまた、そもそもなぜこんなことになったのか？\n\nまた、そもそもなぜこのような状況になってしまったのか、なぜ何もしないのか。\nなぜ何もしないのか？\n\n私の話が少しおかしいかもしれませんが...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o3wh5w/anyone_else_just_not_care_about_covid_anymore.json": "地獄のような批判を受けないことを願っていますが、誰もが...Covid関連のことには関心がないのです。\n気にならなくなった人はいますか？私は純粋にデルタ・バリアントには興味がありません。\n多分、これが4つ目のバリエーションだからだと思います（ブラジルのバリエーションについてはそう言われていましたが、「まだ最も致命的なもの」です）。\nブラジル版でも言われていましたが）。)\n\n私が気にしないのは...",
  "data/reddit-ask/r/AskWomen/comments/o3zggd/was_anyone_the_weird_girl_in_school_how_are_you.json": "小学校、中学校、高校時代に友達がいなくて、ランチで一人で座っていた？",
  "data/reddit-ask/r/NoStupidQuestions/comments/o44oag/does_anyone_else_feel_like_were_not_supposed_to.json": "インターネットや缶詰、車、名声など、今の社会では人間はうまくやっていけないことが明らかになってきていると思います。\nインターネット、缶詰、車、名声...など、現在の社会状況では人間はうまくやっていけないことが明らかになってきています。それは\nおそらく、私たちの猿の脳には無理なのでしょう。私たちは自分たちが処理できる以上のものを作ってしまったような気がします。\n扱いきれないほどのものを作ってしまった気がします。もうすぐ私たちは新しい健康に悩まされることになると思います...。",
  "data/reddit-ask/r/askphilosophy/comments/o42x4y/how_can_one_morally_justify_spending_money_on.json": "一日の終わりに、ハンバーガーやナチョスを食べたいと思うたびに\n苦労した一日の終わりにハンバーガーやナチョスを食べたいと思うたびに、5～10ドルの喜びが、動物解放団体や客観的に必要としている慈善団体の支援に使えたのではないかと思わずにはいられません。\n動物解放団体や、客観的にお金を必要としている慈善団体を支援するために使えたのではないかと思います。\n5～10ドルの喜びは、動物解放団体や慈善団体を支援するために使うことができたはずだ。\n\nこの感覚は何だろう...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o42lc0/why_do_flatearthers_care_what_shape_the_earth_is.json": "丸くないという概念が、なぜか気になって仕方がない。なぜ\n人はそんなに気にするのか？なぜ人は形について嘘をつくのか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o4f5ya/why_do_anorexicbulimic_people_get_so_much.json": "私は幼少期から10代にかけて肥満気味で、「太っている」といじめられていました。\n太っていることで常にいじめられていました。大人になった今、私は拒食症で、食べるのがやっとです。\n拒食症で、不安発作を起こさずに食事をするのがやっとで、憂鬱で孤独な日々を送っています。その\n今までと違うのは、人々が私を助けようとしてくれることです。\n\n生物学的な理由があるのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o45ror/does_anyone_else_find_mass_shooting_more.json": "明らかに私はアメリカ人ですが、ほとんどの民主主義国では少なくとも殺人は悪いことだと思っています。\n悪いことだと思っています。私は気にしないのではなく、予見可能な未来に何もできないことを知っているのです。\n予測可能な未来には何もできないことを知っているから、大量殺人のたびに「ああ、死者は二桁にもなっていない。\n犠牲者は二桁にもなっていないし、そんなに悪いことではない。何をすればいいんだろう...。",
  "data/reddit-ask/r/askscience/comments/o44hzz/why_flux_is_some_finite_number_even_if_there_are.json": "球体の中に電荷+qの荷電粒子がある場合、球体を通過する磁束はq/⋳といいます。\n球体を通過する磁束はq/⋳ₒחとなります。しかし、有限の半径を持つ球を通る電界線は無限に存在します。\nしかし、有限の半径を持つ球を通る電界線は無限にあります。では、どうして\n磁束は有限なのでしょうか？",
  "data/reddit-ask/r/AskWomen/comments/o4atww/women_who_arent_naturally_social_butterflies_how.json": "例えば、ハウスパーティー、職場の親睦会、クラブ、ダンスフロアのある社交場など。",
  "data/reddit-ask/r/AskHistorians/comments/o485jo/i_am_interested_in_seafaring_native_american.json": "バハマをはじめとする東の島々に人が住んでいたということは\n東海岸には海を渡る技術を持った人々が住んでいたことを示しています。\n海を渡る技術を持った海洋民族が東海岸に住んでいたと思われるが、彼らに関する資料は見当たらない。\nしかし、彼らに関する資料は見つかりません。私は間違った場所を見ていたのだろうか？彼らは...",
  "data/reddit-ask/r/AskHistorians/comments/o4hii8/if_a_modern_catholic_were_to_be_transported_to.json": "この時代、キリスト教の信仰はかなり分裂していたと聞いています。\n分裂していました。この時代には、明確な教義を示すことを目的とした複数の審議会が召集されています。\n明確な教義を示すことを目的とした複数の審議会が開かれました。私が興味を持ったのは\n私は、この時代のキリスト教の信仰がどのように認識されるのかに興味があります。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o4k756/did_i_come_across_a_dead_body_should_i_contact.json": "今日、彼女と私はカヤックに行きました（ミシガン州のアッパー半島）。\n海岸沿いに何度も立ち寄って岩を探しました。そのうちの一つで、私たちは\n木々の列の後ろには畑があるように見えました。私はそれを確認したかったので\n調べてみようと思い、行ってみました。それは、木立の後ろにある池だったのです。",
  "data/reddit-ask/r/AskHistorians/comments/o4kxvs/why_is_siberia_so_well_settled_compared_to_other.json": "シベリアを人口密集地と呼ぶのはおかしいと思いますが、カナダ北部やグリーンランドなど、同じような気候の場所と比べると\nカナダ北部やグリーンランドなど、気候が似ている他の地域と比べると、実際には非常に恵まれています。\nシベリアは人口密度が高いです。ノボシビルスク[]のような多くの大都市があります。\n[https://en.wikipedia.org/wiki/Novosibirsk],...",
  "data/reddit-ask/r/NoStupidQuestions/comments/o4ke6a/why_do_people_reply_to_questions_in_the_customer.json": "質問コーナーで商品の下に質問があるのを見ると、とても面白いです。\n質問コーナーにある製品の下にある質問に「よくわかりません」という答えがあるのは\nと答えているのを見ると、とても笑えます。\n\nしばらく前に、誰かが製品の寸法について質問しているのを見たことがあります。\n質問コーナーで製品の寸法について質問している人がいて、他の人が「私は...」と答えていたのを覚えています。",
  "data/reddit-ask/r/AskHistorians/comments/o4ma7x/in_downton_abbey_1922_a_character_gets_an.json": "1922年を舞台にした『ダウントン・アビー』シーズン4第7話では、エセルがロンドンの医師のもとで\n中絶をするためにロンドンの医者に行く。彼女は叔母に、キングスクロス駅で雑誌を見て医者のことを知ったと言った。\n叔母には、キングスクロス駅で雑誌を見てその医者を知ったと話しています。\n\n当時、中絶は違法でした。叔母は看護師に、その医者は\n\"「本当に...。",
  "data/reddit-ask/r/AskHistorians/comments/o4m2jm/why_did_people_in_the_us_and_uk_during_the_1800s.json": "夏の日の例： https://images.app.goo.gl/b4dVomuUNTJm9zct5\n\nテニスの例： https://images.app.goo.gl/84CxkVNpuNRmNugd7\n\nハイキング： https://images.app.goo.gl/rC9EZ9WZf3nEee977\n\n暑さ、泥、汗、におい、運動性、快適性は？スタイルは？\n当時のスタイルは、すべてに優先していたのでしょうか？",
  "data/reddit-ask/r/AskWomen/comments/o4laar/for_women_who_never_get_hit_on_or_crushed_on_how.json": "また、それを知った他の人の反応はどうですか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o4u2y4/are_there_people_who_are_just_destined_to_be.json": "私の友人は、ほとんどの時間を離脱しているように見えます。会話を楽しむことができません。\n会話を楽しむことはありません。友達が少なく、親しい友人もいない。ほとんどの場合、物事について話すことができない。\nほとんどの場合、物事について話すことができない。変わった人だと言われることもある。以前は\n以前はとても面白かったのですが、今は引きこもっています。\n\n彼は良い人ですが、ただ...。",
  "data/reddit-ask/r/TrueAskReddit/comments/o4fsfo/why_are_usamerican_sandwichesburgers_so.json": "少なくとも料理番組では、通常のヒューマの口の1.5～2倍の大きさに作られる（ように見える）。\n普通の人間の口の1,5～2倍の大きさに作られていて、それを食べると、蛇が餌を食べるために顎を外すのを見ているような気分になる。\n食べると、蛇が顎を外して食べるのを見ているような気分になります。\n\n例1 [https://youtu.be/lMAVnI-2MIA] 例2\n[https://youtu.be/3f0vm1k2SmI]",
  "data/reddit-ask/r/askscience/comments/o4ojij/is_there_any_form_of_matter_that_cannot_be.json": "つまり、元素の働きの標準的なルールを破るような質量があるのか？",
  "data/reddit-ask/r/AskHistorians/comments/o4z9xv/did_ancient_roman_cities_have_their_own_distinct.json": "例えば、ニューヨーカーはタフでうるさいと思われ、シアトル出身者は思いやりのあるリベラルと思われます。\nシアトル出身の人は、思いやりのあるリベラルだと思われています。ポンペイの人は、ワイン産業が盛んな街であることから、酔っぱらいと思われるでしょうか？\nポンペイの人は、ワイン産業の中心地であることから、酒飲みと思われるでしょうか？ローマの市民は\nローマの市民は、その都市が...であることから、金持ちの俗物と見られるだろうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/o4uk9l/why_is_prostitution_frowned_apon.json": "私が言っているのは、同意の上での売春のことで、人は自ら進んでこの職業を選ぶのです。\n職業です。強制的な売春や児童買春は200％悪いことです。\n\n宗教上の理由を無視して、売春をタブー視する理由はないと思います。\n他の合法的な仕事の選択肢がある中で、まっとうな生活をしているのですから。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o4xdap/if_your_heart_stopped_beating_would_your_death.json": "脳卒中などについてはよくわからないので、このサブで質問しています。\n\n心臓が詰まっていると死ぬ前に痛みを感じることがあるのは知っていますが\nもし心臓が止まってしまったらどうでしょうか。詰まりもなく、筋肉の収縮もなく、あなたの死は痛みますか？\n死は痛みますか？\n\n別の質問ですが、脳卒中は常に痛みを伴うものなのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/o533op/anyone_else_with_a_fucked_up_family_here_who.json": "強調しておきたいのは、自分よりも良い子供時代や青春時代を過ごした人を批判しないということです。\n判断しているわけではありません。しかし、私はしばしば、それほど完璧ではない家族を持つ人を探していることに気がつきました。\nしかし、私はしばしば、それほど完璧な家族ではない人を探していることに気づきました。それは、私の周りにいる人たちが、私のことを脅かしているように感じるからだと思います。\nそれは、家族に囲まれていると威圧感を感じてしまうからだと思います。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o5543v/is_anyone_else_scared_to_change_jobs_because_your.json": "今日、内定をもらったのですが、どうしたらいいかわかりません。今の仕事は決して楽しいものではありません。\nハードな仕事ですが、同僚は家族のように感じますし、私は会社に自分を証明してきました。\n自分自身を会社に証明してきました。転職は最初からやり直すようなもので、このままでは失敗するのではないかと不安です。\n誤った判断をしてしまうのではないかと不安です。",
  "data/reddit-ask/r/TrueAskReddit/comments/o4xs8x/have_any_of_you_successfully_come_back_from_being.json": "最初に言っておきますが、私は社会の中で日常的に問題なく機能しています。\n洞窟の中に住んでいるわけでも、人と積極的に交流しないわけでもありません。\nただ、一般的な人間（自分も含めて）に対して、苦い失望感が募っています。\n含む）に苦い失望感を募らせています。) どこに行っても、ただ弱さを見ているだけのように思えて...。",
  "data/reddit-ask/r/AskHistorians/comments/o4v0c8/what_were_the_borders_of_the_incan_empire_like.json": "私が本当に知りたいのは、大きなインカ帝国と小さなアマゾンの部族との間に、何らかの「緩衝文化」があったとしたら\n大規模で広大なインカ帝国とアマゾンの小部族との間に、何らかの「緩衝文化」があったかどうか。\n例えば、アンデス山脈の東側、現代のペルーとエクアドル）。",
  "data/reddit-ask/r/AskWomen/comments/o4xvdl/what_is_your_favourite_app_something_you_find.json": "例えば、日常生活、日記、期間追跡、危険予知、セキュリティ、写真編集、手帳、プロダクト、などです。\n危機管理、セキュリティ、写真編集、整理整頓、生産性向上など。私のことは気にしないでください。\n私は情報を溜め込んでいるだけです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o4l2n7/would_it_be_weird_if_i_21f_became_friends_with_an.json": "彼女は私が働いている職場の患者さんで、他の年配の女性たちと話そうとしています。\n友達が欲しいと言っていました。彼女はほとんどの場合、一人で孤立しています。\nもう自分で運転することもできません。私が彼女の友達になることを申し出たら、変でしょうか？\n友人になることを提案したら変でしょうか？彼女はよく話すのが好きで、私の...を思い出させてくれます。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o53h9g/if_bras_are_necessities_then_why_didnt_we_evolve.json": "くだらない質問だったらすみません。私は胸の小さい女性なので、なぜブラジャーが必要なのか本当にわかりません。\nなぜブラジャーが必要なのか理解できません。ブラジャーは背中を支えるために重要だと聞いたことがあります。\n特に胸の大きい女性にとっては、背中を支えるためにブラジャーが重要だと聞いたことがありますし、胸の大きい女性がそう言っているのも確かです。\n胸の大きい女性がそう言っているのを聞いたことがあります。胸の大きい女性からもそう言われますが、胸が大きいだけではありません。",
  "data/reddit-ask/r/AskHistorians/comments/o58fhj/yalta_tehran_these_conferences_would_not_just.json": "大規模な政治集会では、人々は何のために食事をしているのだろう？\n食」です。食物アレルギーを持つ者としては、特に私のようなアレルギー体質の人間が多く使用している国では、常に最優先事項です。\n特に、私のようなアレルギーを持つ人が多い国では。みんなイラン料理を食べたのかな？\nヤルタではボルシチを食べていたのでしょうか？",
  "data/reddit-ask/r/askphilosophy/comments/o59km7/is_there_a_name_for_this_experience.json": "他にどこに聞けばいいのかわからないので、我慢してください。\n\n私は若い頃、意図的に自分をこのような精神状態にしていました。\n状態にしていました。\n\n部屋の中を見回して \"これは何だろう？\"と考えていました。それを繰り返していると\n繰り返すと、その物体は不条理で無意味で不気味なものに見えてくる。できれば・・・。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o4xn5z/why_are_butts_so_sexy_seriously_why.json": "この質問はずっと気になっていて、胸のつかえが取れません。I\nググってみたのですが、十分な回答が得られませんでした。つまり、その部分では\n糞が出てくるのはwtfのようなものです。",
  "data/reddit-ask/r/askscience/comments/o5iqml/if_tesla_was_on_the_path_of_making_electricity_be.json": "編集部：無線のようなものではなく、もっと短い距離ではどうでしょうか？例えば、WiFiのようなものですね。\n充電器から5m離れていても充電できるようにするために。\n今の \"ワイヤレス \"充電は、ケーブル充電よりも拘束力が強いのです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o5k0p0/have_we_swung_too_far_the_other_way_with_the.json": "正当な苦情を持っていた妻が、カレン族と思われたくないという理由で苦情を言うのを恐れていたので聞いた。\nカレンだと思われたくないからです。\n\nカレンがマネージャーに会いたがっている」というのは、実際にマネージャーに会ったり苦情を言ったりする理由がある社会的に不安な人々に悪影響を与えますか？\n実際にマネージャーに会ったり、苦情を言ったりする理由がある社会的に不安な人々に悪影響を与えるのでしょうか？私たちは\nそこを偽ることはできません...。",
  "data/reddit-ask/r/AskHistorians/comments/o5imj4/until_which_point_in_time_did_the.json": "また、低サクソン語などとの相互理解もあったのでしょうか？イギリスの王たちは\n征服しようとしたのか、それとも他の方法で交流したのか？",
  "data/reddit-ask/r/AskHistorians/comments/o5mmvo/are_the_indian_subcontinents_current_religious.json": "はっきりさせておきたいのは、イギリスがイスラム教徒、シーク教徒、ヒンドゥー教徒、ジャイナ教徒などのコミュニティを作ったということではありません。\nコミュニティを作ったということではなく、支配を強固にするために、彼らの間の分裂を演出し\n自分たちの支配を強固なものにするための分割統治戦術として、彼らの間に分断を生み出したということです。私はこの考えが、私の表層の\n私は、このテーマに表面的に触れる中で、この考えがかなり広範囲に提唱されているのを見てきました。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o5mkdr/if_bread_is_jesus_body_and_wine_is_jesus_blood.json": "くだらない質問だとは思いますが、気になります。そして、何も\nクリスチャンに対してではありません。ただ、興味があるだけです。",
  "data/reddit-ask/r/AskWomen/comments/o5d2gk/how_do_you_handle_getting_ghosted_outoftheblue_by.json": "友人、大切な人、その中間の人。",
  "data/reddit-ask/r/AskWomen/comments/o5lpcb/when_budgeting_what_is_the_first_thing_and_last.json": "もしお金がないとしたら、最初に削る贅沢、最後に犠牲にするものは何ですか？\n喜んで犠牲にする最後のものは何ですか？",
  "data/reddit-ask/r/TrueAskReddit/comments/o5bsed/how_are_you_supposed_to_interview_for_another_job.json": "ほとんどのインタビューは通常の勤務時間中に行われるようですが、すでに通常の勤務時間中に仕事をしている場合はどうすればいいのでしょうか？\n通常の仕事をしている人はどうするの？",
  "data/reddit-ask/r/NoStupidQuestions/comments/o5iit4/if_my_penis_is_so_sensitive_why_cant_it_read.json": "くだらないけど純粋な疑問 ペニスの先端には、指先よりも多くの神経終末があります。\n指先よりも神経終末が多い（4,000対3,000）のに、点字のドットを見分けられるのは指先なんですよね。\n点字のドットを見分けることができるのは指先です。何が違うのか？神経の種類が違うのでしょうか？\n神経なのか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/o5n02i/what_is_the_theythem_version_of_calling_somebody.json": "私はほとんどの人と話すときには、いつも「ma'am」や「sir」などの適切な尊敬の代名詞を使います。\n私は生まれも育ちもテキサス人なので、そうするように心に刻まれているのです。\n私は生まれも育ちもテキサス人なので、そうするように心に刻まれています。昨晩、アンドロジナス（両性具有）のウェイターがいたので、ふと疑問に思ったんです。\n疑問に思ったのですが、ノンバイナリーの人にとってはどうなのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/o5o61e/why_are_carrelated_words_so_different_in_british.json": "イギリス英語とアメリカ英語は、一般的にはそれほど違いはありません。しかし、車の話になると\n車の話になると、まるで別の言語のようになります。ほとんどの単語が\n異なります。\n\nトランク/ブーツ、フード/ボンネット、タイヤ/タイヤ、フロントガラス/ウィンドスクリーン、シグナル/インジケーター。\ngas/petrol, gas/accelerator, truck/lorry, car...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o5t2bw/in_english_we_call_our_planet_earth_which_is_just.json": "Edit: これまでに多くの回答を得たにもかかわらず、誰かのために未回答のままにしています。\n他の場所から来た人がこれを見て、私たちが知らないことを知っているかもしれないので、未回答のままにしておきます。\n他の国の人がこれに出会って、私たちが知らないことを知っているかもしれないからです。\n\n編集2：これを回答済みにしました。皆さん、素晴らしい回答をありがとうございました。\nちょっと寂しいですが...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o61odx/does_anyone_else_type_reddit_at_the_end_of_a.json": "教育における「文字数」が、私たちの社会にこのような影響を与えているのでしょうか。\n\n特定の製品についてのレビューでも、一般的な質問でも、私はいつもgoogle検索の後に\n\"私はいつもgoogle検索の後に「reddit」をクリックします。最近の記事は、*ADS*「DO YOU\nACCEPT COOKIES FROM THIS WEBSITE? \"*ADS\\Article *blahblahblah never gets...",
  "data/reddit-ask/r/AskHistorians/comments/o6190j/in_those_american_states_that_did_not_join_the.json": "私が聞きたいのは、奴隷主と奴隷の関係は以前と同じように続いていたのかということです。\n以前と同じように？奴隷所有者は、社会全体から奴隷を解放するように勧められたり、圧力をかけられたりして、事実上、奴隷制度は廃止されたのでしょうか？\n社会全体が奴隷を解放するように促したり、圧力をかけたりして、事実上、奴隷制度が廃止されたのでしょうか？奴隷所有者は\n奴隷所有者は第五列の可能性があるとみなされ、疑われていたのでしょうか...。",
  "data/reddit-ask/r/AskHistorians/comments/o608i7/how_did_abolitionist_like_frederick_douglass.json": "また、人種による反応の違いはあったのでしょうか？白人の奴隷制廃止論者は\n白人の奴隷廃止論者は、司法制度は公正であり、刑事罰としての奴隷制度は適切であると信じていました。\n罰としての奴隷制度は適切であると考えていました。\n白人の奴隷廃止論者は、司法制度は公正であり、刑事罰としての奴隷制度は適切であると信じていたのに対し、黒人の奴隷廃止論者は当然ながら躊躇していたのでしょうか？",
  "data/reddit-ask/r/AskWomen/comments/o5ydq7/women_of_reddit_what_do_you_do_when_youre_sick_to.json": "みたいな、うふふ。\n\n^(こんなことしてたらダウンノートされちゃうかな？)",
  "data/reddit-ask/r/askphilosophy/comments/o5mmi6/whats_your_general_reading_strategy_in_the.json": "皆さん、こんにちは。ここではちょっとしたメタ的な議論をします。\n\n私はこれまで、「注意深く読まなければ、まったく読まなかったことになる」と主張してきた人間の一人です。\n慎重に読まなければ、まったく読まなかったことになる」と主張してきた一人です。私の研究生活では、私は自分自身を誇りに思っています。\n同僚が主張するほどには読んでいないかもしれませんが\n読んだと主張する同僚もいますが",
  "data/reddit-ask/r/AskHistorians/comments/o60qzf/was_napoleon_a_nice_guy.json": "彼の行動や政策の観点からではなく、彼は一緒にいたり、ビールを飲んだりするのに素直にかっこいい人だったか？\n一緒にいても、ビールを飲んでもかっこいい人だったか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/o66ust/why_dont_the_police_have_to_go_to_law_school.json": "彼らの仕事は、法律を守ることが中心ではないでしょうか。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o69nu8/i_asked_my_interviewer_what_was_her_proudest.json": "インタビューは非常にうまくいき、彼女は私の回答のほとんどに満足してくれました。\n私が面白いと思ってくれたのか、いくつかの回答では笑っていました。\n何か質問があるかと聞かれたので、「この会社で一番誇れることは何ですか？\nこの会社で一番誇れる瞬間は？\n\nと聞くと、彼女は「私が与えているような...」と答えた。",
  "data/reddit-ask/r/askscience/comments/o6ao2v/how_effective_is_the_jj_vaxx_against.json": "予防接種を受けた場合の入院や死亡の可能性について、具体的な統計を記載した信頼できるテキストを見つけることができません。\nJJワクチンを接種し、Cov19のDelta型に感染した場合の入院や死亡の可能性について、具体的な統計を示した信頼できる資料はありません。\nCov19のDelta variantに感染した場合の入院・死亡の可能性について、具体的な統計を示した信頼できる文献が見つかりません。\n\nどなたか教えていただければ幸いです。ありがとうございました。",
  "data/reddit-ask/r/AskHistorians/comments/o5o126/would_there_have_been_name_humour_as_we_know_it.json": "名前のユーモアというのは、特定の名前を使ってKarenやKyleのようなステレオタイプを示したり\nカレン、カイルといったステレオタイプを示すために特定の名前を使ったり、金持ちを示すために凝った／「ファンシー」な名前を使ったりするようなことです。\n金持ち。あるいは、小学生が誰かの名前をからかうのと同じように、誰かの名前を\n誰かをいじめるために誰かの名前をからかうこと。",
  "data/reddit-ask/r/AskHistorians/comments/o65h68/how_did_european_colonizers_battle_the_sun_in.json": "私はタークス・カイコス諸島から戻ってきたばかりの色白のアイルランド人男性です。\n日焼け止めの最新技術を駆使しても、焼けてしまいました。どのようにして\n15,16,17,18世紀の主に白人の入植者たちは、どのようにして日々を過ごし、仕事をし、生活していたのでしょうか？\n15、16、17、18世紀の白人の入植者たちは、そのような環境の中でどのように生活し、仕事をしていたのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/o69pjs/what_was_the_reaction_of_the_east_germans_when.json": "東ドイツの1世となったドイツ人のかなりの部分は、ナチス政権を積極的に支持していたか、少なくとも\n積極的にナチス政権を支持していたか、少なくとも暗黙の共犯者だったでしょう。\n暗黙の共犯者であったことでしょう。ナチスが共産主義を宿敵の一つと見なしていたことを考えると......。\nナチスが共産主義を宿敵の一つとし、存亡の危機と考えていたことを考えると、少なからずの...",
  "data/reddit-ask/r/AskHistorians/comments/o638j7/what_would_be_a_good_place_to_start_for_a_person.json": "最近、ミシシッピアン墳墓群を訪れましたし、メサベルデにも行く予定です。\nメサベルデを訪れる予定です。これらの場所について学ぶことは魅力的であるだけでなく、自分自身もあまり知らないことがあると気づかされました。\n興味深いだけでなく、私もあまり知らないことに気づかされました。\n\n具体的に何かを学ぶ必要はなく、できればドキュメンタリーや写真集を探しています。\nできればドキュメンタリーか本を探しています...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o5pn03/why_do_some_people_literally_roar_when_they.json": "このうるさいくしゃみのせいで、毎回ウンチをしてしまいます。",
  "data/reddit-ask/r/askscience/comments/o5yrec/whats_the_main_barrier_to_creating_an_hiv_vaccine.json": "ウイルスの変異が早すぎるのではないか？ウイルスが複雑すぎるのか？\n抗原表面が複雑すぎて、有効な抗体ができないのでは？このウイルスは\nmRNAワクチン技術に適しているか？\n使えそうなタンパク質があるか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/o61wyl/why_is_everyone_scared_of_china_becoming_the_most.json": "編集部：中国が第一勢力になる前に核攻撃をすべきだったようです。\n中国がナンバーワンになる前に核を使うべきだった。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o6l4bd/my_understanding_is_that_you_have_no_control_in.json": "この状況は、「思考は悪人を作らず、行動が悪人を作る」という考え方に類似しているのではないかと考えています。\n\"思考が悪人を作るのではなく、行動が悪人を作る」という考え方に似ていると思いましたが、これはよく当てはまると思います。\n思考は中立で、世界に影響を与えません。行動は世界に影響を与えません。\n世界に影響を与えることはありませんが、それでも道徳的には問題ないのかもしれません....",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o6m6bn/do_people_really_think_porn_with_girls_getting.json": "痛そうだし、女の子が楽しそうにしているはずがないと感じます。彼らは\n小さな女優さんが出演していることが多いです。さらに悪いことには、複数の男性俳優が参加しています。\nさらに悪いことに、複数の男性俳優が関わっていて、全体的に残酷な印象を受けます。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o6kbkm/why_does_becoming_a_barber_harder_than_becoming_a.json": "私のルームメイトは化粧品の仕事をしていましたが、何百、何千時間ものトレーニングが必要だと言っていました。\n警察官になるための訓練は、数ヶ月間のものだそうです。\nヶ月",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o6obcf/imagine_person_is_graduating_from_yale_law_school.json": "可能であれば、統計情報を含む",
  "data/reddit-ask/r/NoStupidQuestions/comments/o6nyxs/should_i_wear_hat_backwards_or_front.json": "https://imgur.com/a/WFQki3p",
  "data/reddit-ask/r/AskHistorians/comments/o6kdzs/are_we_still_looking_for_lost_literature_from.json": "今日、あるポッドキャストを聴いていたら、司会者が、過去の文学はもう存在しないという話をしていました。\n過去の文学はもう存在しない（スッラが回想録を書いた！）という話をしていました。\n私は、歴史家はまだこのようなものを探しているのだろうかと考え始めました。歴史家が\n歴史家がもっと...のようなものを見つけるチャンスはあるのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o6q9o0/did_anyone_else_like_wearing_a_mask_because_it.json": "わからないけど、個人的にはマスクをしている時としていない時では、マスクをしている時の方がずっといいと思うんだ。\n笑うし、目もきれいに見えるからね。\n\n悲しいことに、今マスクを外しているのは、顔色が悪くなって、人から醜いと思われるのが怖いからです。\n醜いと思われそうで悲しい😂😅。",
  "data/reddit-ask/r/TrueAskReddit/comments/o6bxtn/racism_towards_african_americans_how_i_can_better.json": "もし私が正しい用語を使っていなかったり、無神経な言い方をしていたら、あらかじめお詫びしておきます。\n無神経に聞こえたら、ごめんなさい。無知や世間知らずを言い訳にしてはいけないことは理解していますが\n私は東南アジア人ですが、アメリカの政治やそれに関連する要素については、あまり深く語られることはありません。\n私は東南アジア人ですが、アメリカの政治やそれに関連する要素について深く語られることはあまりありませんし、そのような状況は...。",
  "data/reddit-ask/r/Ask_Politics/comments/o6bllv/how_does_a_large_country_go_from_3rd_world_status.json": "私はシンガポール人で、自分の国の歴史を調べています。主なテーマは\nイギリスが去った後から今日までの変遷についてです。私の国は、なんとか\n私の国は...ご存知の通り、僻地から二度見する価値のある国になりました。一言\n我が国の指導者が作ったプログラムの大半は...",
  "data/reddit-ask/r/AskHistorians/comments/o6rg64/how_effective_were_the_soviet_union_and_other.json": "がないという状態の物語は、かなり安全だと思います。\nソ連にはホームレスがいないという国家シナリオは、グラスノスチとペレストロイカの下ですぐに崩壊しました。\nホームレスであることは犯罪とみなされていましたが、それだけでは、いくつかの場所（特にロシア）で、ホームレスがいないという話が広まるのを防ぐことはできませんでした。\n特に80年代に入ってからは）。しかし、...",
  "data/reddit-ask/r/AskHistorians/comments/o6zfwj/how_obvious_and_wellcoordinated_were_volleys_of.json": "ピーター・ウィルソンは「ヨーロッパの悲劇」の中でネルトリンゲンの戦いについて述べています。A History of Thirty Years War\n三十年戦争の歴史』の中で、ネルトリンゲンの戦いを描いたピーター・ウィルソンは、次のように述べている。\n\n> スペイン人は、恐れていたスウェーデンの一斉射撃に対処する方法も知っていた。\n> 敵が砲撃の準備をするたびにしゃがみこんだ。弾丸が彼らの上をかすめるや否や\n> 彼らの上を...",
  "data/reddit-ask/r/AskHistorians/comments/o6vltl/what_sort_of_influence_has_africanamerican.json": "アフリカ系アメリカ人がアフリカの政治やパン・アフリカニズムに関与していたことは知っています。\nアフリカ系アメリカ人がアフリカの政治やパン・アフリカニズムに関わったことは知っていますが、ほとんどの議論は、アフリカそのものというよりも、アメリカの言説への影響についてのもののようです。\n議論のほとんどは、アフリカそのものよりも、アメリカの言説への影響についてです。",
  "data/reddit-ask/r/askscience/comments/o6ysqw/ice_burns_make_no_sense_to_me_on_a_molecular.json": "熱すぎるものや冷たすぎるものの上では、伝導によって肌にダメージを与える可能性があります（-5°C ～ 54°C）。\n54 °C). 速く動く分子が細胞にダメージを与えることは、なんとなく理解できます。\nしかし、ゆっくりと動く分子と接触した皮膚細胞がダメージを受ける原因は何でしょうか？\nしかし、ゆっくりと動く分子と接触した皮膚細胞がダメージを受ける原因は何でしょうか？細胞や血液中の水分は...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o6tzd0/does_anyone_else_look_into_the_beautiful_night.json": "なぜかというと、私はいつも生きることよりも死ぬことを考えているからです。多分、それは\n人生で次のことをしたいと思っているからです。今日は私の誕生日です。\n今日は私の誕生日ですが、私はただ生きることの反対のことをしたいのです。",
  "data/reddit-ask/r/AskWomen/comments/o6u1g4/what_are_some_long_hair_struggles_youve_encouraged.json": " * 遭遇",
  "data/reddit-ask/r/NoStupidQuestions/comments/o6y1kk/what_are_some_worktrade_secrets_youre_legally.json": "編集部：皆さん、本当に面白いコメントをされていますね。本当にありがとうございます。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o72dtv/is_it_bad_that_i_fantasize_about_my_boyfriends.json": "私と私の彼氏は3Pについて話していて、2人ともかなりオープンな考えを持っています。\n二人ともかなりオープンな考えを持っていますが、まだ行動に移すことには抵抗があります。彼は\n彼は他の男性に私を使わせて、自分はそれを見ていて、私に何をさせるか教えてくれるということを空想しています。\n妄想しています。正直なところ、彼が最初にこの話をしたとき、私は少し混乱しました...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o6zeg5/why_do_people_get_so_offended_by_swear_words.json": "前置きが長くなりましたが、私は神経衰弱で、悪口には本当に苦労しています。\n私にとって悪口とは、単に自分が使える言葉を使って強調したり表現したりすることです。\n\n誤解しないでほしいのですが、誰かを不快な名前で呼ぶと侮辱になることは理解しています。\n侮辱になることは理解しています。\n\n私が理解できないのは、人々がなぜ...",
  "data/reddit-ask/r/askphilosophy/comments/o6qq0m/what_philosophy_books_for_friend_who_locked_up.json": "やあ、/r/askphilosophy、私は必要な時にあなたに会いに来ました。\n\n私には3年間監禁されている親友がいるのですが、彼に楽しくて面白い読み物を提供しようと思っています。\n楽しくて面白い読み物を提供しようと思っています。問題は、彼の読解力が平均以上ではないことです。\n彼の読解力は平均以上ではありません。\n本を...",
  "data/reddit-ask/r/AskHistorians/comments/o6x833/how_did_people_find_each_other_in_metropolises_in.json": "ローマを例に考えてみましょう。誰かの名前を聞いたことがあっても、その人がどこに住んでいるかを知らなかったとしたら\nどこに住んでいるのかわからない場合、どうやって探すのでしょうか？周りの人に聞いてみるしかなかったのでしょうか？\nその人を知っている人を見つけるまで、その地域を尋ねるしかないのだろうか？",
  "data/reddit-ask/r/askphilosophy/comments/o6u0za/i_didnt_ask_to_be_born_what_is_the_philosophical.json": "数年来の親しい友人が、ちょうど彼女と別れたところです。\n恋人と別れました。彼はここ数日落ち込んでいますが、ちょうど昨日、彼は私に質問しました。\n僕は頼んで生まれてきたわけじゃないんだ。ただランダムに生まれてきたんだ。\n存在している。なぜ私がこのような製品を作らなければならないのか、その理由を教えてください。",
  "data/reddit-ask/r/AskWomen/comments/o73u6x/whats_something_you_get_compliments_on.json": "ただ、気分の良いスレッドを盛り上げたいだけなのです。人に褒められたことを教えてください\nを教えてください。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7448s/how_is_it_legal_to_price_something_to_11000_of_a.json": "物理的に支払うことはできないし、銀行は私の残高をその小数点以下で測定しないので、意味がありません。\n私の銀行は私の残高を小数点以下まで測定しないので、それを含めることは法的にどうなのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/o75azt/why_is_ableism_bad.json": "キャブリズム」という言葉をずっと耳にしていたので、その意味を調べてみることにしました。\n\n障がいのある人はない人よりも何らかの点で劣っていると考えること」だそうです。\n思うこと」だそうです。しかし...それは真実ではないのでは？他の条件が同じであれば、目が見えないことは悪いことです。\n盲目であることは、目が見えることに比べて悪いことだと思います。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o6zkzw/how_should_i_celebrate_me_being_7_months_clean.json": "私は今日で正式に7ヶ月間の禁酒を達成しましたが、この素晴らしい日をどのようにして\nこの素晴らしい日をどうやって祝えばいいのか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o7bp89/as_a_man_is_it_okay_to_want_to_be_the_sub_in_the.json": "今までの恋愛では、私は支配者でなければなりませんでしたが、心の底では\n本当は従順であることを望んでいるのです。しかし、そのことを相手に打ち明けるのは非常に抵抗があります。\nしかし、このことをパートナーに打ち明けるのは非常に気が引けるのです。\nなぜなら、男性がサブであることが好きだと認めることは、どのように受け取られるかが怖いからです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o6xnqo/does_anyone_else_eat_primarily_just_to_survive.json": "だから、たまにレストランで食事をするときは、いつも楽しく食事をしています。しかし\n家で食事をするとなると、その逆になります。\n\n説明しましょう。私は料理が下手なわけではありません。私は料理が下手なわけではなく、そこそこ美味しく食べられる料理を\nそれなりの料理を作ることができます。問題は、あまりにも時間がかかりすぎることだ。買い出しに行ったり\nお店に行ったり...",
  "data/reddit-ask/r/AskHistorians/comments/o7c9rc/mass_graves_of_indigenous_peoples_keep_getting.json": "ちょうど4時間前、カナダのレジデンシャル・スクールの跡地でさらに多くの集団墓地が発見されました。\nカナダのレジデンシャル・スクール[https://www.bbc.com/news/world-us-canada-57592243]。\nこの情報源がBBCであることを考えると、イギリスのメディアがこのような残虐行為を捏造したり誇張したりしているとはとても思えません。\nこのような残虐な事件を、イギリスのメディアが捏造したり誇張したりするとは思えません。",
  "data/reddit-ask/r/TrueAskReddit/comments/o7axf0/what_do_you_think_children_of_today_will_change.json": "世代を経るごとに、子育てに対する考え方が文化的に変化していきます。\n世代を経るごとに、子育てに対する考え方が変わっていきます。例えば、かつては体罰が当たり前で、ほとんどの親が躊躇なく行っていました。\nかつては体罰が当たり前で、ほとんどの親が何のためらいもなく体罰を行っていました。時が経つにつれ、体罰はタブーになってきました。\n体罰をタブー視するようになったのは、将来の世代に...",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7dziu/why_cant_britney_spears_just_leaveflee_her.json": "私はただ混乱しています。人権侵害のように思えますが...。\n\nまた、私の投稿をダウンブレートするのは簡単だ、それはクソ質問だ",
  "data/reddit-ask/r/AskHistorians/comments/o7cqjo/were_ancient_civilizations_aware_that_they_were.json": "仮に、あなたが最初の農耕社会の一つに住んでいる人だとします。\n自分の祖先が狩猟採集民であることを知っていますか？\n\n自分の祖先が狩猟採集生活をしていたことを知っているだろうか。それとも、今の生活を知っているだけだろうか。\n狩猟採集生活をしていたことを知っているでしょうか、それとも、農業や基本的な社会がある今の生活しか知らないでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7j1qb/why_do_people_always_assume_youre_arguing.json": "これはよくあることなのでしょうか、それとも私の問題で議論好きに見えてしまうのでしょうか。\n喧嘩腰になってしまうのでしょうか？",
  "data/reddit-ask/r/askscience/comments/o7er3l/do_tides_levels_predict_sinkhole_formation_in.json": "この質問が時事問題についての反科学的な仮定を求めるものであれば、事前にお詫びします。\nイベントについての反科学的な推測になるかもしれません。\n\n最近起きたマンションの倒壊事故は、マイアミで今月最高の潮位が3日続いた後に起きました。\nマイアミでは今月の最高潮の3日後に起きました。さらに、それは最干潮の15分前に起こりました。\n3フィートを超える潮が2日間続いた後...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o7kd31/can_you_guys_answer_my_questions_about_america.json": "皆さん、こんにちは。今のところ怖くて聞けないのですが、ここは安全な空間のようですね。\n\n 1. 1. プロムとは一体何ですか？プロムって何ですか？\n 2. なぜ多くの人が軍隊に入るのですか？楽しくなさそうだから。\n 3. なぜ人々は家族から遠く離れた場所に引っ越すのか？私は何かを見続けている。\n    のようなものを見続けています...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o7mbho/being_a_man_complimenting_women_how_can_i_make.json": "私には女性の友人が多いのですが、彼女たちがFacebookなどにアップしている写真を見ると\n女性の友人が多いのですが、彼女たちがFacebookなどに投稿している写真を見ると、その写真の美しさを褒めたくなります。\n褒めてあげたい。男性としては、気持ち悪いと思われるのではないかと心配になりますが、本当は彼女たちが自分のことを良く思えるように褒めてあげたいのです。\n褒めてあげたいだけなのに、気持ち悪いと思われないか心配です。どのように...",
  "data/reddit-ask/r/AskHistorians/comments/o7p60u/britain_in_the_1970s_a_hell_on_earth.json": "1970年代の英国は、ストライキやインフレ、過激な労働組合、非効率的な経営などにより、経済的に不安定な状態にあったと言われています。\n絶え間ないストライキ、インフレ、過激な労働組合、非効率的な産業などが原因で、イギリスは経済的に行き詰まっていた。\nというものであった。マーガレット・サッチャーの支持者は、彼女が英国を衰退から救ったと主張した。\n衰退からイギリスを救ったと主張しています。この見解はどれほど有効なのでしょうか？イギリスは描かれているほど悪い国だったのだろうか？...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o7hl9s/why_is_slavery_in_america_talked_about_so_much.json": "私がイギリスを持ち出したのは、私の家族がイギリスが植民地化した国の出身だからです。\n植民地化した国の出身だからです。イギリスの下での私の家族の生活は地獄でした...暴力、飢饉、大虐殺。\n大虐殺でした。多くの人がカリブ諸島などに送られ、年季奉公人として働かされました。\n私の家族の生活は地獄でした。これは、エリザベス女王の...",
  "data/reddit-ask/r/AskHistorians/comments/o7lui3/teotihuacan_was_the_most_influential_and_powerful.json": "私はこの蜘蛛の女神について読み続けていますが、同じ疑問を感じています。\n\nもし都市国家がそれほど影響力を持っていたのなら、どうしてこの女神は消えてしまい、その地域のパンテオンに組み込まれなかったのか？\nその地域のパンテオンに組み込まれなかったのか？メソアメリカは非常にシンクレティックであり\n様々な文化から神々を取り入れていました。\n\nその原因は...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7n2ox/what_the_hell_are_you_supposed_to_do_while.json": "なぜかわからないけど、これまでで一番気まずい思いをした。誰か教えてください。\n教えてください、あなたは何をしますか？笑顔？一緒に歌う？何？",
  "data/reddit-ask/r/AskWomen/comments/o7vchu/derek_chauvin_got_sentenced_to_225_years_in.json": "当初は30年の予定でした。彼が受けた判決についてはどう思いますか？",
  "data/reddit-ask/r/AskHistorians/comments/o7y5xc/who_was_healthier_a_rich_citydweller_in_1st.json": "中世ヨーロッパの都市は人口吸収源だったと聞いたことがありますが、古典期の都市はどうでしょうか？\n古典派の都市は？少なくとも裕福な人々にとっては、都市に住むことは生活するための良い手段だったようです。\n少なくとも裕福な人々にとっては、都市に住むことはかなり良い方法だったようです（ローマ人の多くは、可能な限り田舎の別荘に逃げ込んだとしても\nしかし、ローマ人の多くは、可能な限り農村の別荘に逃げていました）。) しかし、貧しい人々はどうだったのでしょうか（私も...）。",
  "data/reddit-ask/r/askscience/comments/o7pgeu/does_name_familiarity_create_unintended_bias.json": "意図しない名前の差別については、いくつかの研究がなされていることは知っています。\nしかし、より一般的な親近感バイアスについてのデータはあるのでしょうか？\n一般的な親近感バイアスについてのデータはあるのでしょうか？\n\n最近の例では、私は営業職に就いていますが、ストレスの多い朝を過ごしていました。\n私は営業の仕事をしていますが、朝からちょっとしたストレスを感じていて...",
  "data/reddit-ask/r/AskHistorians/comments/o7svod/queen_elizabeth_i_of_england_and_oda_nobunaga.json": "英国女王エリザベス1世が1533年9月7日に生まれ、織田信長が1534年7月3日に生まれたことは、とても興味深いことです。\nと織田信長は1534年7月3日に生まれており、わずか299日しか違わないのです。\n\nhttps://en.wikipedia.org/wiki/Elizabeth_I\n\nhttps://en.wikipedia.org/wiki/Oda_Nobunaga\n\n二人はお互いの存在を知っていたのだろうか、、、、。",
  "data/reddit-ask/r/AskHistorians/comments/o7yi82/napoleon_iiis_wife_empress_eugenie_owned_a_pair.json": "ウジェニー皇后のために作られた、蜘蛛の糸で作られた貴重な一点物の小さなグレーの手袋の話を何度か見たことがあります。\n皇后ユージェニーのために作られた、蜘蛛の糸で作られた貴重な一組のグレーの小さな手袋をいくつか見たことがあります。しかし、私はそれらの写真や\nしかし、その写真は見当たらないし、博物館に所蔵されているという情報もない。そこで\n私の推測では、それらは失われたか、破壊されたのではないかと...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o7mhr1/people_who_say_paris_is_the_most_beautiful_city.json": "よく見聞きする話なので、ちょっと気になっています。実際に行ったことのある人は\n実際に行ったことがある方は、どこがそんなに良かったのか教えてください。\n同じ場所に行ったことがないからです。",
  "data/reddit-ask/r/AskHistorians/comments/o7ospc/what_were_the_mechanics_of_sex_work_like_in_1st.json": "この質問は、Key and Peeleのスケッチから生まれました。\nマグダレンのポン引きがやってきて、イエスと一緒にいる彼女を見つけ、彼を彼女の新しいポン引きと勘違いしてしまう。\nヒモと勘違いしてしまう。私はマグダラのマリア自身がセックスワーカーであった可能性が低いことを知っています。\n殆どのセックスワーカーはヒモを持っていなかったのではないかと...",
  "data/reddit-ask/r/AskWomen/comments/o7tlva/women_over_30_whats_a_hobby_you_started_late_in.json": "Edit: late in lifeではなくLater in lifeと書きたかった。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7xggk/does_anyone_else_instantly_forget_what_shirt.json": "誰かがそれを言った瞬間、私は自分のシャツに何が付いているかすぐに忘れてしまい\nシャツに何が付いているか忘れてしまい、ありがとうと言う前に下を向いてしまいます(笑)。",
  "data/reddit-ask/r/askscience/comments/o7znd1/why_is_chickenpox_more_dangerous_for_adults.json": "大人が水疱瘡にかかると、より危険な症状が出て、死亡する確率が高くなります。\n水疱瘡は、大人の方が危険な症状が出て、死亡する確率も高いのですが、なぜ大人は子供よりも症状が重いのでしょうか？グーグル\nはその理由を教えてくれませんでした。大人の方が悪いというだけで、その理由はわかりませんでした。\n理由はわかりません。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7vsjl/why_are_ids_a_bad_thing_when_it_comes_to_voting.json": "少し前に、投票の際に身分証明書を必要としないことを望む人たちがいると見ました。\n投票の際に身分証明書を必要としないようにしたいという意見がありました。なぜそのようなことが必要なのでしょうか？もちろん、アメリカにおいてですが。\n\n編集* 今のところ、私が得たものは、貧しい人々についてのものです（あるいは、ある人は人種差別と言いましたが、私はこれについて何が人種差別なのか分かりません）。\nしかし、何が差別的なのか私にはわかりません。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o849jj/why_dont_incels_just_hire_an_escort.json": "本当に理解できないのですが、セックスができないことがそれほどの苦痛をもたらすのであれば\nそんなに悩んでいるのなら、そんなに幸せなことなのか。なぜエスコートを頼まないの？それは\n毎回料理をしなければならないことに 不満を持っているようなものです あなたは、文字通り\nお金を払えば誰かに料理を作ってもらい、食事を提供してもらうことができます。",
  "data/reddit-ask/r/AskHistorians/comments/o7lkc0/the_history_of_greek_myths.json": "スティーブン・フライの「神話」を聴き直していて、ギリシャ神話がいかにバラバラな信仰体系の巨大な集合体であるかについて考えていました。\nギリシャ神話は、異なる信念体系が織り込まれた巨大な集合体のようだと考えています。\n織り込まれている。ギリシャ神話の発展の歴史を探してみたのですが\nしかし、神話自体の再話を超えることは困難です。それは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o83rw5/does_anyone_feel_like_reddit_just_fucking_sucks.json": "ゆっくりと劣化しているように見えますが、ひどいビデオプレーヤーとの間には\n文字通り私のフィード上のすべての投稿に1つか2つの広告が表示され、さらに1つか2つの「おすすめです。\n似たようなサブレディットを見ていたからおすすめ」というものが1つ2つ。\n通常は全く興味のないsubredditsです。大嫌いです。\n\n編集：...",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7v7ke/why_do_toddlers_who_fall_over_and_slam_their_face.json": "よく見かける光景ですね。幼児が転んでも、私は全く問題ないと思っています。\n本当に大丈夫だと思った瞬間に泣き出してしまう。\nまるで5秒間、痛みを感じていないか、反応を待っているかのようです。\n親や他の人の反応を待っているような...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o85p15/whos_the_idiot_at_reddit_hq_that_decided_to_make.json": "ひどいもんです。一人でやっていたらクビになるし、チームでやっていたらクビになる。\n一人ならクビ、チームなら全員がクビになるべきです。正直、このアプリをアンインストールします。名前が欲しいです。",
  "data/reddit-ask/r/AskHistorians/comments/o7z2y5/i_love_you_guys_ive_learned_so_much_from_you_guys.json": "ここにいる人たちはGOOD NERDSの例です。皆さんは歴史に詳しくて、ここに来るたびに\nここに戻ってくるたびに新しいことを学びます。私は歴史学者ではありませんが（素人です）、私の仕事の分野では\n私の仕事の分野では、頻繁に迅速な歴史的回答が求められます。あなた方は私に\n情報を提供してくれます。そして、とても評判の良い...",
  "data/reddit-ask/r/askscience/comments/o83585/when_someone_is_emotional_and_choked_up_or_has_a.json": "基本的にはタイトル通りなのですが、たまに本当に悲しくて泣いていると、喉が閉まるような感じがして話すのが大変な時があります。\n喉が閉ざされるような感じがして話すことができないことがあるのですが、これはどういうことなのでしょうか？\nそれはどういうことですか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7zr3e/what_actually_happens_if_you_get_a_boner_at_a.json": "何か社会的なルールでもあるのでしょうか？誰も気にしないのかな？そんなことを\n今、ふと思いました。\n\nまた、生理。生理中はダメなのか、それとも何かプロセスがあるのか。\n何かプロセスがあるのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/o88jml/why_is_naked_yoga_allowed_on_youtube_while_other.json": "意味がわからない...YouTubeで裸のヨガを検索すると、出てくるのは...そう、裸の\nのヨガになってしまいます。これが許されるのに、他のYouTuberが悪口を言うと鬼籍に入るのはなぜ？\n鬼籍に入るのか？",
  "data/reddit-ask/r/AskHistorians/comments/o8amxp/in_a_til_thread_discussing_the_significance_of.json": "数年前に大学のアメリカ史の授業で学んだことですが、アメリカは信じられないほどの人種差別をしていたそうです。\nアメリカは信じられないほどの人種差別主義者でした。日本人を人間以下の存在とみなしていたほどです。\n日本人を人間以下の存在と考え、日系人を収容所に入れることが一般的に行われていました。\n当時の（白人の）人々にとっては常識のように思えました。....",
  "data/reddit-ask/r/askscience/comments/o8cmbg/how_do_we_know_weve_discovered_a_new_species_of.json": "この記事[https://www.bbc.co.uk/news/science-environment-57432104]の主張は\n新種の人間を発見したと主張していますが、この主張は一つの化石に基づいているので\nしかし、その主張は一つの化石に基づいているので、それが一人の人間ではなく、ある種の能力を持っていたことをどうやって知ることができるのでしょうか？\n遺伝的欠陥のある一人の人間ではないと、どうやってわかるのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o88wzq/why_is_everyone_in_america_so_opinionated_on.json": "アメリカ人でない私は、多くのアメリカ人が、ピザのパイナップルのような問題や\nアメリカ人は、ピザのパイナップルのような問題から、人生や選択のプロ、反ワクチン主義者のような\nVaxxersなど。誤解しないでいただきたいのですが、意見を持つことは全く問題ありませんし、人間の傾向でもあります。\n人間の傾向です。すべての国とその国民は、それぞれの国について意見を持っています。",
  "data/reddit-ask/r/askphilosophy/comments/o877wx/how_do_you_justify_private_ownership_of_land.json": "私は、家や自転車などの芸術品については、個人所有の概念を理解しています。\n家や自転車などの人工物については、私有権の概念を理解しています。誰かが仕事をして材料を集め、人工物を作りました。\n誰かが材料を集めて人工物を作ったのですから、当然、その人工物の所有権を主張します。\nその所有権を主張します。創作者が所有者であり、彼らが望めば、彼らは...",
  "data/reddit-ask/r/AskHistorians/comments/o8aash/its_a_known_fact_that_robert_mcnamara_was_a_huge.json": "マクナマラの手法の欠点についてのエッセイを書きたいのですが（EDIT: In regard to Vietnam war\n歴史の授業でマクナマラの手法の欠陥についてエッセイを書きたいのですが、簡潔で正確な指標を\n簡潔で正確な指標を得ることは非常に困難です。私が見つけた最高のものは\n歴史家のドナルド・フィッシャー・ハリソンの論文が一番でした。しかし、これは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o8j7u9/does_anyone_else_love_when_theres_a_typo_in_a_book.json": "私はただそれに興奮し、笑顔になり、誰もが完璧ではないことを思い出すのです。\n何十人もの人がその本を読み、校正し、印刷所に送り、何千部、何百部もの本を作っても\nその本を何十人もの人が読み、校正し、印刷所に送り、スペルミスや句読点を忘れたまま何千、何百万部もの本を作る。\nそれは誰かを笑わせるのでしょうか、それとも...。",
  "data/reddit-ask/r/AskHistorians/comments/o8gpfc/george_washington_carver_said_he_his_sister_and.json": "また、「Ku Klucked」という言葉は、無法者たちが最初のクランに属していたということでしょうか？I\n彼が生まれたのは南北戦争が終結した頃だから、これは戦後の話になる。\n戦後ということになりますが、彼の生い立ちについては記録が残っていないために\nしかし、彼の初期の話については、記録がないので詳細は不明と言われている。",
  "data/reddit-ask/r/AskHistorians/comments/o89l5t/what_might_the_singer_of_barretts_privateers.json": "この曲自体はフィクションですが、非常にリアリティがあります。この曲を知らない人は\nこの歌を知らない人のために説明すると、1778年にカナダの17歳の少年が、イギリス王室の私掠船に乗り込んで\n1778年、カナダの17歳の少年が、イギリス王室の私掠船に乗り込み、アメリカの船を狙う。その船は、まったく使い物にならず\nアメリカ人によって破壊されてしまいますが...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o8jp8d/why_does_no_one_seem_to_care_that_the_us_prison.json": "基本的にタイトルにあるように、米国憲法では、人々は自由労働を強制されることはないと直接述べられています。\n自由な労働を強制することはできません。..... 投獄されていない限り、投獄率はそれを反映しています。\nそれ以来、投獄率はこのことを反映しています。投獄率が改善される直接的なインセンティブがあります。\n憲法にその記述がある限り、投獄率は高いままです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o8iedn/is_this_a_fetishbdsm_related.json": "なぜかわからないけど、誰かに強制的に性的なことをさせられていると思うと、すごく興奮してしまう。\n誰かと性的なことをしなければならない、さもなければ \"罰 \"を受ける、という考えにとても興奮するのです。それはBDSMのようなものだと思います。\nのことだと思いますが、同意が彼らの最大の関心事なので、本当にわかりません。このように感じることは\n健全なのか？強制的にあることをさせられたいと思うのは、健全なことなのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/o8p8fl/where_does_the_stereotypical_image_of_a_robber.json": "それは、犯罪行為をしている人にとって、非常に特殊なイメージである。\n個人の私有財産の概念と同じくらい古いものであることは間違いありません。",
  "data/reddit-ask/r/AskWomen/comments/o8mlml/do_you_get_regular_bikini_waxes_why_or_why_not.json": "たった今、2年ぶりにワックス脱毛をしてきました...うっ。痛い。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o8um4z/do_women_really_not_enjoy_working_for_female.json": "付き合っている女の子が最近新しい仕事に就いて、「上司が男性でよかった」と言っていました。\nが男性でよかったと言っていました。どういう意味なのか聞いてみると、基本的には、上司になる年配のキャリアウーマンの多くは\n上司になった年配のキャリアウーマンの多くは、若い女性が社会に出てくると、自分の権力や社会的名声を奪う競争相手とみなして\n上司になる年配のキャリアウーマンの多くは、職場にいる若い女性を自分の権力や社会的名声の競争相手と見なし、彼女たちに嫉妬し、それゆえに...",
  "data/reddit-ask/r/AskHistorians/comments/o8vcpn/ive_walked_into_a_17th_century_british_coffee.json": "さらに、ラテやエスプレッソのような認識をするものはありますか？",
  "data/reddit-ask/r/AskHistorians/comments/o8wcwp/so_whats_the_deal_with_the_merovingian_kings.json": "メロビンジアンについて読んで、中世初期を理解しようとするたびに\n以下のようなことが書かれている（ウィキペディアより\n[https://en.wikipedia.org/wiki/Merovingian_dynasty]）が起こる。\n\n> メロビンジアンの支配の最後の1世紀の間、王たちはますます\n> 儀礼的な役割に追いやられていった。実際に...",
  "data/reddit-ask/r/askscience/comments/o8paqg/is_it_true_some_prey_taunt_predators.json": "どこかで聞いた話ですが、ガゼルはとても足が速いので、かなり生意気で、チーターに運動能力を見せて挑発するそうです。\nチーターに運動能力を見せつけて、「俺は速いから試してみろ」と言っているようなものです。\n\nまた、シマウマの中には、ライオンを直視しながら飄々としたクールな性格を見せるものもいます。\nライオンを直視して飄々とした冷静さを見せるシマウマがいるかと思えば、実際に殺してしまったシマウマもいたり...。",
  "data/reddit-ask/r/askscience/comments/o8ryu9/if_ocean_waves_are_a_perturbation_of_a_medium_the.json": "電気は物質を必要としないことがわかっています（例：誘導充電器は真空や宇宙でも作動します）。\n電気は物質を必要としないことがわかっていますし（例えば、誘導充電器は真空や宇宙で動作します）、光も必要です（宇宙から見ても宇宙は真空です）。\n場の媒体は何だろうと考えています。",
  "data/reddit-ask/r/askscience/comments/o8y04s/how_do_they_know_that_the_skull_found_in_harbin.json": "ちょうどその記事を読んでいたら、ホモ・ロンギのオスの絵がありました。\nlongiの男性の絵があり、なぜ女性ではないのかと思いました。科学的に知る方法はあるのでしょうか？\n頭蓋骨からそれを知るための科学的な方法はあるのでしょうか、彼らの特徴がH.Sapiensと異なることを考えると。\nホモ・サピエンスとは異なる特徴を持つ彼らを、頭蓋骨から科学的に知る方法はあるのだろうか？\n\nその後、「古人類」でググってみると、ほとんどが...。",
  "data/reddit-ask/r/AskHistorians/comments/o931b4/my_greatgrandfathers_sister_went_missing_in.json": "R5：これは、私の曾祖父の父親が、娘の誘拐後にシカゴ・トリビューン紙に出した全ページ広告です。\n娘が誘拐された後、曾祖父の父親がシカゴ・トリビューン紙に出した全面広告です。話によると、娘は\n話によると、娘はシカゴのサウスサイド（当時は裕福な地域）にあるピアノ教室に向かって歩いていました。\n歩いていたが、ピアノのレッスンには間に合わなかった。彼らは...",
  "data/reddit-ask/r/NoStupidQuestions/comments/o8yj19/how_did_every_nation_decide_to_agree_to_a_7day.json": "近代化以前には、このルールを守らない国もあったと思いますが\nしかし、どのようにして全ての国で週休7日制が実現したのでしょうか？",
  "data/reddit-ask/r/askscience/comments/o921m0/why_dont_planes_have_dimples_like_golf_balls.json": "ゴルフボールの表面にディンプル（くぼみ）をつけると空気力学的に有利になるのであれば\n車や飛行機、船など、空気抵抗を少なくしなければならないものには、この設計原理を使わないのでしょうか？\n車や飛行機、船など、空気抵抗を少なくする必要があるものに、この設計原理を使ってはどうでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/o93r4r/do_animals_with_less_brainpower_make_mistakes_the.json": "蟻を例にしてみましょう。働きアリの仕事は卵を掃除することですが、忘れてしまうことはありませんか？\n忘れてしまうことはありませんか？あるいは、卵を飛ばしてしまうこともあるでしょうか？それとも、彼らの脳は\n解釈の余地がないのでしょうか？\n\n逆に、人間の子供に2+2は何かと聞くと、おそらく...と答えるでしょう。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o99kba/there_are_studies_shown_that_workers_who_stay.json": "これは私が何度も考えてきたことですが、理解できませんでした。私はちょうど\nほとんどの仕事の給料は、今の私の給料のほぼ2倍です。\n2倍の給料をもらっています（そのうちの1つは給料が2倍です）。\n\n私たちは2～3年ごとに転職する文化を持っていますが、それが意味を持つのは...",
  "data/reddit-ask/r/NoStupidQuestions/comments/o99ao0/anybody_else_genuinely_prefer_rainovercast_over.json": "誤解を恐れずに言えば、太陽は素晴らしく、絶対に必要なものですが...。\n雨が降ると純粋にワクワクする人はいませんか？晴れの日よりも曇りの日の方が楽しいという人はいませんか？\n暗い灰色の雲）の日の方が、明るい日差しの日よりも楽しいという人はいませんか？\n\n誰もがいつも天気の良さを語っているような気がしますが、それにしても\n見てみると...",
  "data/reddit-ask/r/NoStupidQuestions/comments/o98x8i/are_there_any_websites_that_feature_recipes.json": "サブレディットやソーシャルメディアのページがあることは知っていますが、私は専用のウェブサイトを探しています。\n専用のウェブサイトを探しています。特別なダイエットをしているわけではありません。ありがとうございます。\n\n編集：解決済みとしましたが、ご提案があれば遠慮なくお寄せください。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o970a9/whats_the_point_of_keeping_up_to_date_and_aware.json": "アマゾンの倉庫労働者に対する忌まわしい扱いから、太平洋の巨大なゴミの山、熱帯雨林の伐採まで。\n太平洋の巨大なゴミの山、チョコレートを美味しく滑らかにするためのパーム油のために熱帯雨林を伐採すること、政治的腐敗...。\n滑らかなチョコレートを作るためのパーム油のために熱帯雨林を伐採したり、政治的な腐敗があったり...。\nニュースを読んだり、ポッドキャストを聞いたりすると、すべてが憂鬱になります。そんなとき、私は...",
  "data/reddit-ask/r/NoStupidQuestions/comments/o90i7c/am_i_being_manipulative.json": "少し前に、同じクラスにかわいい女の子がいることに気づいて、私（F/26）は同じプログラムの友達に彼女のことを聞いていました。\n同じプログラムの友達に彼女のことを聞いていました。共通の友人はいませんでした。結局、私は\n彼女のアカウントを見つけたのは、プログラムの学生用インスタグラムでした。\n私が彼女を探していた同じ週に彼女が紹介されていました。その中で、私は...",
  "data/reddit-ask/r/AskHistorians/comments/o8zkf6/do_we_have_any_evidence_to_support_the_classic.json": "フェミニストの知的基盤の中で最も繰り返されているテーマの一つが\n人間は（猿の仲間のように）「自然に」平等主義であり、1万年前の家父長制移行期までは\n万年前に家父長制へと移行するまでは、そのように生きてきた。\n\nこの共通の物語では、当時は父系制は存在しませんでした。女性は...",
  "data/reddit-ask/r/askscience/comments/o9aalo/are_birds_today_descended_from_a_single_dinosaur.json": "基本的にはタイトル通りです。私たちは知っていますか？もしそうでなければ、私たちは知ることができるのでしょうか？\n\nそれとも、この質問が意味をなさないほど、私の進化に対する理解が浅いのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o9hr06/is_the_downvote_button_a_youre_being_a_dick.json": "私は、自分の意見に反対した場合ではなく、最低な態度をとった人にのみダウンボートをします。\n私はいつも、ダウンボットは誰かがアホなことをしたときにするものだと思っていました。\nしかし、時々「私は個人的にこのビデオゲームが好きではありませんでした」というようなことを言っただけでダウンボットされることがあります。\nでも、たまに「個人的にこのゲームは好きではありませんでした」と言っただけでダウンボットされることがあります。",
  "data/reddit-ask/r/AskHistorians/comments/o9ia8h/i_am_a_european_king_living_between_10001500_i.json": "ヨーロッパの王族は家庭内暴力にどのように対応したのでしょうか？また\n一般的に知られるようになり、私が介入しなかった場合の反応は？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o9hx4z/am_i_the_only_one_who_never_remembers_artist.json": "特定のアーティストを頻繁に聴くのでなければ、たとえ以前に聴いたことがあっても、アーティスト名やアルバム名を覚えることはほとんどありません。\nアーティスト名やアルバム名は、たとえ以前に聞いたことがあっても、ほとんど覚えていません。そして、私は\n1日に4～12時間音楽を聴いています（ゲームやアクティビティをするときだけ）。\n\nみんながいつも「Lil Shitball9000の新曲聞いた？私は...",
  "data/reddit-ask/r/AskWomen/comments/o9d2a4/how_do_you_feel_about_victorias_secret_getting.json": "彼らの代わりに、以下のようなアスリートやトランスジェンダーの代表者を含む「VSコレクティブ」を設立する予定です。\nメーガン・ラピノエなどのアスリートやトランスジェンダーの代表者が参加します。ソースはコメントにて。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o9fk56/can_anyone_else_not_piss_or_shit_if_they_feel.json": "例えば、公共のトイレで人が出入りしていると\n気持ち悪くて小便ができないんですよ。\nこの小さな仕切りで、後ろには俺が何をしているか知っている男たちがいて\n後ろで何年も小便せずに立っているのを見られてしまう....",
  "data/reddit-ask/r/askscience/comments/o9msp0/having_a_large_supply_of_atp_inhibits_oxidative.json": "エネルギーをトリアシルグリセロールとして蓄えるよりも、ATPを蓄えておいた方が体に良いのではないでしょうか？\nエネルギーをトリアシルグリセロールとして蓄えるよりも、ATPを蓄えた方がいいのでは？\n\n編集部：私の推測では、ATPは脂肪よりもエネルギー密度が低いので、作り続けると風船のように膨らんでしまうのではないでしょうか。\nATPを作り続けると風船のように膨らんでしまうのではないでしょうか。また、アデノシンが不足しているのではないか？\nアデノシンの量が足りないのではないかとも考えていますが...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o9m3mq/is_it_normal_for_a_man_to_get_slightly_physical.json": "私（女性）は、交際を始めて6年になります。私の唯一無二の\n比べられるものがありません。(20代半ばです。) 今年の初めに婚約しました。\n今年の初めに婚約しました。私たちの間ではすべてが素晴らしいのですが\nたまに喧嘩をすると、彼はカッとなって手を出そうとします...",
  "data/reddit-ask/r/AskWomen/comments/o9nb59/how_would_you_love_to_celebrate_your_birthday.json": "皆さんのアイデアを聞かせてください。低予算のもの、贅沢なもの、居心地の良いもの、冒険的なもの、昼間のもの、夜のもの、何でも結構です。\n昼間のアクティビティや夜のアクティビティなど、何でも結構です。",
  "data/reddit-ask/r/AskWomen/comments/o9jti1/women_who_live_with_their_parents_how_do_you.json": "つまり、常に口うるさい、喧嘩をする、批判される、あるいは全体的に気分が悪いということです。\n家での生活を楽しむことができません。そのような状況からどのように自分を守っていますか？儀式、習慣、対処法、考え方などがあれば教えてください。\nマインドセットなどがあれば教えてください。",
  "data/reddit-ask/r/AskHistorians/comments/o9mes2/ive_seen_viking_skulls_with_fileddown_teeth_do_we.json": "ファイルダウンした歯の写真\n[https://medieval.gumlet.net/wp-content/uploads/2014/06/viking-filed-teeth.png?compress=true&quality=80&w=768&dpr=2.0].",
  "data/reddit-ask/r/AskWomen/comments/o9idlo/how_do_you_feel_about_the_way_your_boobs_look.json": "別のサブサイトで、女性がブラジャーを着けるかどうかについて、男性に好みがあるかどうかを尋ねる投稿を見ました。\n女性がブラジャーをしているかどうか、好みがあるかどうかという質問をしたところ、多くの回答者が\n違いがわからない」「気にしない」という回答が多かったです。あなたはどう思いますか？",
  "data/reddit-ask/r/AskWomen/comments/o9x1sb/whats_the_problem_with_panty_lines.json": "つまり、他に何を着ればいいのかということです。女性がボクサーパンツを履いているとは思えません。\n女性がボクサーパンツを履くとは思えません。",
  "data/reddit-ask/r/NoStupidQuestions/comments/o9yr2v/how_many_times_can_you_go_through_a_roundabout.json": "こんにちは、私はベイクドですが、私は違法ではないかと思っていました。\n友達は、ロータリーで何度も何度も回るのは違法だと思っていました。\n違法なのかどうか、もしそうならどうなのか、誰か教えてください。",
  "data/reddit-ask/r/AskHistorians/comments/o9j1qb/web_dubois_asserted_that_around_the_1880s1890s_to.json": "もちろんデュボアが正しいことを前提にしていますが、なぜドイツの大学なのか？何がそんなに\nそれほど特別なのか？彼の言う「本当の地位」とは何だったのか？明らかに学部長は\n学部長もそうですが、その他の「本当の」立場とは何でしょうか。また、ハーバード大学の評判はどうだったのか？\nまた、当時のハーバード大学の評判は？ユーモアのある...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o9wzi6/whats_the_point_of_having_a_mansion.json": "私が見てきたほとんどのお金持ちは、十中八九このような豪邸を購入します。\n疑問なのは、なぜ？\n\n私は大金持ちではありませんし、大邸宅のようなところに住んだこともありません。\n推測の域を出ないのですが、外から見ていると\n外から見ると豪邸を持つことは",
  "data/reddit-ask/r/Ask_Politics/comments/o9ouhk/are_trumps_scotus_judges_less_conservative_than.json": "ゴーシュが指名されたとき、私はポロ・サイエンスの教授たちから、彼はスカリアの右でトーマスの左になるだろうと言われました。\nスカリアの右、トーマスの左に位置すると言われていました。カバノフが指名されたとき\nゴルシュの右、トーマスの左と言われていたのを何度も聞きました。\nゴルスキの右、トーマスの左と言われていました。バレットのときは、少なくとも2回は聞いた...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oa36sf/isnt_anyone_else_worried_about_how_much_waste.json": "私たちは、必要のないときでも、一度だけ、あらゆるものにビニール袋を使います。\n\n私たちは、電話やテレビ、ゲーム機などのテクノロジーを購入しますが、それらは10年以内に壊れてしまいます。\n私たちは、電話やテレビ、ゲーム機などのテクノロジーを購入しますが、それらは10年以内に陳腐化し、新しいモデルのために捨ててしまいます。\n\n私たちは毎日大量の食品を捨て、ゴミ箱には鍵をかけます。\n\nオフィスでは、書類をシュレッダーにかけています。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o9vvc2/am_i_the_only_one_that_thinks_power_mods_on.json": "AwkwardTheTurtleのような \"Power Mods \"は何千ものsubredditsのモデレーターです。\nのモデレーターであり、日々その権力を乱用して、同意できない人を追放しています。\nAwkwardTheTurtleは2500以上のサブレディットのモデレーターであり、その多くは偶然にも非常に人気があります。\n非常に人気があります。\n\n免責事項：私はちょうど禁止されている...",
  "data/reddit-ask/r/NoStupidQuestions/comments/oa231x/if_i_farted_into_someones_butthole_then_they.json": "ETA: OK、実用性を無視する。チューブか何かがあると仮定して、どんな手段であれ\n屁が肛門に入ったとします。そこから先は",
  "data/reddit-ask/r/AskHistorians/comments/oa4m5m/dan_carlin_hh_ep_39_carlin_says_scipio_aemilianus.json": "上記の発言に真実性はあるのでしょうか？\n\nまた、当時のスキピオ・アエミリアヌスはローマの将軍で、カトーはおそらく\nある島の総督だったようです。\n\nローマの元老院議員が、王に対してそのような無礼な態度をとることができるでしょうか？エジプトでも\nその他の場所でも。総督の親戚はどうだろう。下っ端の...",
  "data/reddit-ask/r/AskHistorians/comments/oa7f7v/in_the_image_below_depicts_a_qing_soldier_from.json": "画像\n[https://en.m.wikipedia.org/wiki/File:ChineseSoldierByWilliamAlexander1793.JPG]\n\n注：駐清マカートニー大使館の図案家ウィリアム・アレクサンダーが描いたもの\n中国",
  "data/reddit-ask/r/AskHistorians/comments/oad9zy/why_does_it_always_seem_to_circle_around_to.json": "歴史的に見ても、ユダヤ人はしばしば軽蔑の対象となります。\n蔑まれることが多い。現代の憎悪は、福音主義に根ざしているようなので納得できます。\nしかし、例えばアルゼンチンの軍事政権がなぜユダヤ人を選んだのか？\nなぜ、アルゼンチンの軍事政権は、ユダヤ人を（ある程度）代表して選んだのでしょうか...",
  "data/reddit-ask/r/NoStupidQuestions/comments/oacwo1/is_it_rude_to_feed_someone_weed_laced_brownies.json": "基本的には、少し前に私のいとこが、自分の両親に少しだけ食べさせた例を話してくれました。\n両親に知られないように「ウィード・ブラウニー」を少し（明らかに異常な量ではありませんが）食べさせたという話です。\n知らなかった。両親は全く葉っぱを吸わないので、日常的なイタズラとは違いますよね。\nたとえ葉っぱが無害であっても、あなたはこれを考えるでしょうか...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/oaf244/why_do_i_keep_hearing_pre_madana_all_the_time.json": "彼女は有名になる前に何か別のことをしていたのでしょうか、それとも私が馬鹿なのでしょうか？\n\n編集：私がバカなだけでした",
  "data/reddit-ask/r/askphilosophy/comments/oa4yvv/are_there_other_universitylevel_courses_like.json": "YouTubeの大学レベルの講座のリンクが欲しい。\n\n- 死 [https://youtube.com/playlist?list=PLEA18FAF1AD9047B0] by Shelly kagan\n\n- Justice [https://youtube.com/playlist?list=PL30C13C91CFFEFEA6] by Sandel",
  "data/reddit-ask/r/NoStupidQuestions/comments/oa8z8b/if_food_takes_hours_to_digest_why_do_i_have_to.json": "時には、食事を終える前にそうなることもあります。例えば、私は今、朝食に自作のマスゲイナーを飲んでいます。\nプロテインパウダー、オートミール、バナナ、MCTオイル、ピーナッツバター、アーモンドミルク、水）を飲んでいます。\nピーナッツバター、アーモンドミルク、水）シェイクをほぼ飲み終えたところで、トイレに行きたくなりました。\nトイレに行きたくなりました。(#2)\n\nこの状態が続いています...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oadc7m/if_we_hate_arguing_and_how_divided_america_is.json": "また、年に一度、あるいは月に一度、インターネットを遮断する日/週を設けるのはどうでしょうか。\n月に一度でもいいから。\n\nこれは議論を始めるためではありません、あなたがどちらのチャンネルを嫌うかは関係ありません、どちらも悪いです。\n好むと好まざるとに関わらず。\n\nEdit:\n\n\n議論はしないでください、そして偏った回答はしないでください",
  "data/reddit-ask/r/NoStupidQuestions/comments/oafj5q/is_there_a_name_for_a_kink_where_you_get_your.json": "私の人生における最高の経験は、ディーラーと一緒にいて、ただ話をしたり、ゲームをしたりしていたときのものでした。\nただ話をしたり、ゲームをしたりしていました。\n性的な意味でそれを望むことに名前はありますか？",
  "data/reddit-ask/r/AskHistorians/comments/oa5nlw/how_seriously_did_the_imperial_japanese_navy.json": "私は人生の中で太平洋戦争について多くの本を読んできましたが、その中でよく\n潜水艦による商取引は、日本の戦争能力を低下させるのに役立った」という記述をよく目にしました。\n日本の戦争能力を弱めるのに役立ったという記述をよく目にしました。アメリカが使った戦術は、ナチス・ドイツの影響を大きく受けているという記事を読んだことがあります。\nアメリカの戦術は、ナチスドイツの狼煙に大きな影響を受けていたと読んだことがあります。",
  "data/reddit-ask/r/askscience/comments/oaa9d0/is_vaccination_always_recommended_after_infection.json": "COVID-19の予防接種は、過去にウイルスの陽性反応が出たことがあっても推奨されると理解していますか？\nのワクチン接種が推奨されると理解していますか？これは、水痘のような（比較的新しい）ワクチンを持つ他のタイプの病原体についても同様ですか？\n水疱瘡のような（比較的）新しいワクチンを持つ他の病原体の場合も同様ですか？なぜでしょうか、なぜ\nなのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/oa5ay2/how_did_the_police_proceduraldrama_become_such_a.json": "警察の手続きやドラマは、テレビ番組の中で非常に大きな割合を占めており、何十年も前からそうでした。\n数え切れないほどの「Law and Order」のようなエピソード番組から、「Brooklyn 99」のようなジャンル融合番組まで、何十年にもわたって存在している。\nブルックリン99」のようなハイブリッドなジャンルまで。\n\nこれはどのようにして始まったのですか？この種の番組がこれほど一般的になった要因は何でしょうか？\nこの種の番組がこれほど一般的になった要因は何か？視聴者の要望と、それに応えるためにはどうすればいいのか。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oaasnq/would_you_really_be_upset_if_you_caught_your.json": "r/loveafterporn [/r/loveafterporn]を読んでいたのですが、そこでは女性たちが密かにポルノを見ているパートナーについての話を共有していました。\n密かにポルノを見ているパートナーについての話を共有していますが、ほとんどの話がとても悲痛であることに困惑しました。\nほとんどの話がとても悲惨なものでした。ポルノ依存症の可能性があることを知ると、不安になるほどの大きな\n不安になったり、落ち込んだりするほどの大きな苦痛を感じます。ほとんどの...",
  "data/reddit-ask/r/NoStupidQuestions/comments/oakydp/do_you_guys_considered_the_term_you_guys_to_be.json": "インスタグラムを見ていて気になったのですが、相手の性別がわからない場合は\n性自認がわからない場合は、「皆さん」ではなく「皆さん」と言うべきだというものでした。\nあなたのことは知りませんが、私や他の多くの知り合いは、性別に関係なく「あなたたち」という言葉を使っています。\n私はあなたのことは知らないが、私や他の多くの人々は、性別に関係なく人を指す言葉として「あなたたち」という言葉を使っている。それは...",
  "data/reddit-ask/r/AskWomen/comments/oam6fl/what_was_your_fuck_i_need_therapy_moment.json": "私は最近、このような啓示を受けましたが、他の人はいつ、どのような啓示を受けたのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/oajgd1/why_is_st_louis_not_as_culturally_french_as_new.json": "セントルイスはフランス領ルイジアナの主要都市だったようですが、ニューオーリンズと違って\nオーリンズとは異なり、セントルイスはそのフランスの遺産の多くを失ってしまったようです。なぜ、ニュー\nなぜニューオリンズは、セントルイスよりもフランス的であり続けることができたのでしょうか？実質的なアイルランド人\nやドイツ系の...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oao58w/why_is_lesbian_twin_porn_generally_seen_as_okay.json": "タイトルです。かなり美化されていて、ほとんどの人は間違っているとは思いませんが、もしこれが\n本当の非同性の双子や家族だったら、気持ち悪いと思うでしょうね。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oapgte/is_it_considered_weird_to_masturbate_in_the.json": "私のプロフィールを見て、今日の私の投稿を読んでみてください。\n今日の記事を読んでみてください。多くの人が、一人で家にいても家の中の共有スペースでオナニーをするのは普通ではないと言っていました。\nひとりで家にいても、家の中の共有スペースでオナニーするのは普通じゃないと多くのコメントがあり、正直驚きました。\n笑\n\nとにかく、たまに一人で家にいるときは、家の中でオナニーをしています。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oaqsq4/why_do_we_get_annoyed_at_customers_for_bad.json": "本気で答えがわかりません。助けてください。",
  "data/reddit-ask/r/NoStupidQuestions/comments/oagsve/why_do_british_people_tend_to_turn_statements.json": "例えば、イギリス人は、\"that's a big dog \"と言う代わりに、次のように言います。\n\"that's a big dog, isn't it?\"",
  "data/reddit-ask/r/askscience/comments/oas3hs/since_there_isnt_any_resistance_in_space_is.json": "物体を減速させる抵抗がなければ、加速は止まらない。\nでは、物体（例えば空の宇宙船）が光速に達するまで加速し続けることは可能なのでしょうか？\n光速に到達するまで加速し続けることは可能でしょうか？\n\nその場合、どうなるのでしょうか？光速が限界なので、加速は止まりますか？\n光速が限界ですから、加速は止まりますか？",
  "data/reddit-ask/r/AskHistorians/comments/oa8nqu/its_1066_and_im_somewhere_in_northwestern_europe.json": "少し背景を説明すると、私が実際に尋ねているのは、その日の「科学ニュース」にどれだけリンクできるかということです。\nその日の「科学ニュース」にどれだけリンクしているのか？何の脈絡もない、ただの天のお告げなのか\n脈絡のない天のお告げなのか、それとも「ああ、そうだ、司祭が言っていた、司教が言っていた、手紙をもらった」のようなものなのか。\n司教が言ってたよ、ローマから手紙が来て、何かが見えるってさ...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/oaoy4b/is_it_weird_if_your_parents_put_a_camera_in_your.json": "私は対立するのが嫌いなので何もしませんし、正直ここにあってもいいと思っています。\nいますが、「普通」の家庭ではおかしいらしいです。最初は\n最初はプライバシーの侵害だと感じましたが、半年ほど前から慣れてきました。\n慣れてきました。私の両親も私の家に押しかけてきます。",
  "data/reddit-ask/r/AskHistorians/comments/oas5da/crassus_is_often_criticized_for_crossing_through.json": "アレクサンダー大王の拡大の道\n[https://en.m.wikipedia.org/wiki/Alexander_the_Great#/media/File%3AMacedonEmpire.jpg]をご覧ください。\nクラッススが通った道のちゃんとした写真はありませんが、これは\n[https://earlychurchhistory.org/wp-content/uploads/2014/11/carrhae-Map2.jpg]\nカーヘの位置の一般的な地図...",
  "data/reddit-ask/r/AskHistorians/comments/oau8uy/can_you_develop_a_meaningful_degree_of_historical.json": "私は歴史が好きで、「正しいことをする」ということに深くこだわっています。このサブレディットを見ていると\nこのサブレディットを見ていると、（「本当の/良い」歴史学と比較して、人気のある歴史学のずさんな歴史学を批判する際によく見られますが\nといったコメントをよく見かけます。\nあなたが参考にすべき著者は、そうそうたるメンバーで、彼らは...の専門家です。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oay14h/anyone_write_out_long_responses_only_to_delete.json": "人が私のredditの履歴を調べて、後で全く関係のない問題に利用したことが何度もあります。\nの履歴を調べられて、それを全く関係のない問題に利用されたことが何度もありました。\n時にはreddit以外の場所でも\n\n私は、たとえそれがただの意見であり、大した価値がないものであっても、書くことや意見を述べることを本当に楽しんでいます。\nたとえそれがただの意見であり、大した価値のないものであっても。これは...",
  "data/reddit-ask/r/askscience/comments/oavzi7/do_semi_aquatic_animals_get_ticks_and_lice.json": "皆さん、カモノハシが体を掻いているビデオを見て、考えさせられました。\n考えました。\n\nカモノハシはダニやシラミに感染するのでしょうか？\n\nほとんどの時間、水中にいるわけですから、ダニやシラミは溺れてしまうのではないでしょうか？\n溺れてしまうのでは？\n\nまた、水棲の哺乳類はダニやシラミに感染するのでしょうか？\n\n編集：水生生物の寄生虫についての返信がいくつか見られますが...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ob1g15/as_an_american_what_is_something_really_patriotic.json": "免責事項: 私は誰かが投稿するのを止めることはできませんが、私は肯定的なコメントが欲しいです。\n肯定的なコメントが欲しいです。アメリカが嫌いだとか、国旗を燃やせとか、ネガティブなことを言ってくれる人を探しているわけではありません。\n国旗を燃やせとか、ネガティブなことを言われたいわけではありません。私は機嫌がよく、人を助けたいと思っています。\nどうか私の機嫌を損ねないでください。ありがとうございました。:)",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ob6jmq/does_anyone_else_feel_like_they_dont_want_sex_but.json": "私だけでしょうか？\n\n編集部：もしこれが一般的な意見であれば申し訳ありませんが、私は聞いたことがないだけです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ob1n5d/why_does_my_voice_get_higher_when_im_talking_to.json": "ですから、私はやや深みのある声の女性です（普段は疲れた声を出しています）。しかし、私は\nしかし、男性と話すとき、特にロマンチックなレベルで興味を持っている男性と話すとき、私は高いトーンで話します。\nしかし、男性と話すとき、特に恋愛レベルで興味を持っている男性と話すとき、私はより高いトーンで話すことに気づきました。",
  "data/reddit-ask/r/NoStupidQuestions/comments/ob7zx9/how_do_i_stop_being_racist.json": "私は筋金入りの人種差別主義者に育てられました。\"筋金入り \"とは、白人以外の人々に嫌がらせをするという意味で、おそらく今でもそうでしょう。\n筋金入りの人種差別主義者に育てられましたが、その筋金入りというのは、白人以外の人々に毎日嫌がらせをしたり、暴行を加えたりして\n筋金入りの人種差別主義者に育てられましたが、今ではもう彼らとは関わりたくありません。\n\n私は3年ほど前から自分自身のために努力してきましたが、とてもうまくいっています。\n今は...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ob16tm/does_anyone_else_tend_to_resent_whatever_gains.json": "それは意図的なものではなく、潜在的なものです。ただ、何かが突然、みんながやっているような\n誰もがやっていることで、突然狂ったように支持されることに憤りを感じ始めます。それはトレンドであったり、有名人であったり\n流行でも有名人でも何でもいい。\n\n自分が好きだった人気のないものが突然爆発して、みんながそれに群がっていると、ちょっと悲しくなります。\n皆がそれに夢中になっているのを見ると、少し悲しくなります。なぜなら、私は...",
  "data/reddit-ask/r/askscience/comments/ob6jor/what_are_the_theoretical_minimal_and_maximal.json": "pHについては初歩的に理解しています。pHは0以下と14以上があり得ること、pHは温度に依存するのでかなり異なる値になることを理解しています。\n14以上が可能であり、pHは温度に依存するため、極端な温度では全く異なる値が可能であることを理解しています。\n極端な温度では全く異なる値が得られることを理解しています。\n\nある物質を絶対零度にしたり、すべての物質を......に変換したりすることは自由です。\nすべての物質を...",
  "data/reddit-ask/r/Ask_Politics/comments/ob2rrl/what_are_some_of_the_simpler_changes_the_united.json": "私は、この質問が善意の質問であるとモデレータが見てくれることを本当に心から願っています。私は\n政治が非常に複雑で混乱していると感じながらも、常により多くの知識を得ようと努力している者として\n人々がより幸せになり、より良い生活を送れるように、単純に考えてみたいと思っています。\n人々がより幸せに、より良く暮らせるようなことを考えてみたいと思います。\n\n私は、この問題が..."
}