{
  "data/reddit-ask/r/AskHistorians/comments/ovkw4w/what_do_we_know_about_jesus_from_a_secular.json": "彼の本名や性格、仕事内容は？彼はどのように見られていましたか？\n特に、彼の世俗的な伝記があれば、お勧めの本を教えてください。\n彼についての良い世俗的な伝記があれば、お勧めの本を教えてください。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ovog65/is_it_unusual_for_a_woman_to_think_her_own.json": "私は3人の子供に加えて3回の流産を経験しましたが、いずれもかなり早い時期でした。最新のものは\n10週目でした。生まれた子供たちを愛していますが、流産してもあまり動揺しませんでした。\n流産してもあまり動揺しませんでした。最初の流産では一度だけ泣いたことがありますが、それだけでした。でも\n他の女性と話していて、その話をすると、彼女たちはとても...。",
  "data/reddit-ask/r/askscience/comments/ovlrfc/why_are_marie_curies_possessions_kept_in_lead.json": "このような投稿を目にすることがあります。\n[https://old.reddit.com/r/interestingasfuck/comments/ovj6om/marie_curies_laboratory_notebook_from_18991902_is/]\n彼女の体や持ち物が放射能に汚染されていて、鉛の箱に入れられているという\n箱に入れられています。半減期が最も長いラジウムの同位体はRa256で、これは...",
  "data/reddit-ask/r/NoStupidQuestions/comments/ovq0wj/why_do_adults_stop_having_sleepoversslumber.json": "性的な出会いではなく、少年たちがCODやマインクラフトで遊んでいるところにピザを持ってきて\nピザを食べながらCODやマインクラフトをプレイしたり、共産主義について適当な会話をしたりしていた。\n朝の4時まで続く。高校生の頃は、学校で10時間以上の「仕事」があったので、このようなことをしていました。\n高校生の頃は、学校の授業中に10時間以上の「仕事」がありました。なぜ大人はこのようなことをしないのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/ovq99r/how_do_i_get_rid_of_a_stalker.json": "私は14歳の男の子ですが、この1ヶ月間、男の人が私をストーキングしています。私の犬は頻繁に外に出る必要があります。\n私の犬は頻繁に外に出る必要があります（彼はまだ子犬です）が、この不気味な男はいつも外にいます。\nベンチに座って僕を見ています。彼はいつも友好的に振る舞い、私と話をしようとします。\n私と話をしようとします。いつも夕方になると、彼は私の後を追って...",
  "data/reddit-ask/r/AskWomen/comments/ovrxar/how_do_you_handle_years_and_years_of_being_single.json": "実際の関係を築くのに適した、相性の良い相手を見つけられないような\n関係を築くことができません。特に、あなたがとても肉体的に優れていて、誰かとキスしてから何ヶ月も経っているような場合はそうです。\n誰かとキスをしても",
  "data/reddit-ask/r/NoStupidQuestions/comments/ovr2fx/is_it_wrong_for_your_parents_to_make_you_go_to.json": "母と父は、私が無神論者であることを知っているにもかかわらず、いつも私をキリスト教の教会に行かせます。\n私が無神論者であることを知っていても、母と父は私をキリスト教の教会に連れて行き、祈りを捧げさせようとしています。\nでも、それは私には合わないのです。私は教会が好きではないし、それは私の宗教ではありません。\n私はもうすぐ18歳になりますが、馬鹿げているとしか思えません...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/ovsdai/is_there_a_mathematical_question_thats_even.json": "No I'm not joking",
  "data/reddit-ask/r/AskHistorians/comments/ovp3wv/would_columbus_and_his_crew_have_died_if_america.json": "私の知る限り、コロンブスは世界を一周してアジアに到達できると期待していたようです。\nコロンブスが世界を一周してアジアに到達できると期待したのは、地球が普通の人よりもずっと小さいと思っていたからです。\nコロンブスは世界を一周してアジアに到達できると期待していた。\n\nもしアメリカがなかったら、アジアの東方面に到達するという任務は失敗していただろう。\nアジアの東方面に到達するという任務は失敗していただろう...。",
  "data/reddit-ask/r/AskHistorians/comments/ovpfcz/how_long_did_it_take_for_deported_brits_to_start.json": "タイトルだけで結構です。私は喜んで、他の\nアメリカ以外の植民地化された場所や国外追放された場所についても喜んで紹介します。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ovxlg2/why_do_conservatives_believe_my_body_my_choice.json": "追記編集：保守派の方からのご意見もお待ちしています。保守的でない人は返信しないでください。\n保守的でない方は返信しないでください。ありがとうございます。",
  "data/reddit-ask/r/askscience/comments/ovx0q6/are_there_any_published_reports_of_the_increased.json": "密閉された場所に長時間いるとCOVID19に感染してしまうことで、現在、航空機での旅行のリスクが高まっているかどうか、またその度合いはどの程度なのか、まだわかっていません。\n密閉された機内で長時間過ごした場合にCOVID19に感染した結果、航空機での旅行がよりリスクの高いものになったかどうか、またその程度はどのようなものか、まだわかりません。\n密閉された機内で、少なくとも1人のウイルス感染者がいる状態でCOVID19に長時間感染した結果、今日の航空旅行がよりリスクの高いものになったかどうか、またどの程度リスクの高いものになったかはまだわかっていません。",
  "data/reddit-ask/r/AskHistorians/comments/ovti45/what_really_happened_to_cairo_illinois.json": "そして、なぜ初期の推進者たちが考えていたようにはいかなかったのか。\n戦略的に重要で、商業的にも有利な場所にあったからです。\nオハイオ川とミシシッピ川の合流点という、戦略的に重要で商業的にも有利な場所にあったからです。\n\n何年も前に何度か車で通ったことがあり、いろいろな話を聞きました。\n話を聞いてみると...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ow1uuo/when_someone_spends_the_night_how_long_are_you.json": "私は他の人と同じように抱き合うのが好きだし、行為の後に横になって話をするだけでも\nした後、横になって話をするのが好きなんだ。でも、最終的にはちょっとしたスペースが欲しいんだ。抱き合っていると\n腕が寝てしまうと、上に人が乗っているので安眠できません。\n腕が寝てしまうと、その上に人が乗っかっているので安眠できません。しかし、私はいつも緊張しています、もし...",
  "data/reddit-ask/r/askscience/comments/ovyt2l/what_happens_when_lightning_strikes_the_ocean.json": "正直なところ、海に雷が落ちるかどうかはわかりませんが、もし落ちたとしたら\nどうなるのでしょうか？\n\n例えば、プールに雷が落ちると、プールの中にいる人は感電してしまうらしいのですが\n海でも同じようなことが起こるのでしょうか？近くの魚は死んでしまうのでしょうか？\n衝突からどのくらい離れたところに...",
  "data/reddit-ask/r/askscience/comments/ovyloc/can_the_iss_orbit_the_earth_in_such_a_way_that_is.json": "それを望むなら？\n\n乗っている人にとってはですが",
  "data/reddit-ask/r/NoStupidQuestions/comments/ovzlqi/does_anyone_else_stop_their_microwave_with_1.json": "爆弾を拡散しているような？",
  "data/reddit-ask/r/AskHistorians/comments/ow2ybq/why_is_uncle_tom_a_slur.json": "実は何年も前に『アンクル・トムの小屋』という本を読んだことがあるのですが、どうしても\nなぜ「アンクル・トム」が侮蔑語になるのか、私には理解できません。彼は、成熟した大人の「男の人」として描かれています。\n成熟した大人の「男の人」として描かれていて、自分の歩く道をカバーしています。彼はこの本のヒーローです。\n他の奴隷の逃亡を助けたために殺害された本の主人公です。では、なぜ...",
  "data/reddit-ask/r/AskWomen/comments/ovunq2/why_is_it_so_much_more_common_and_expected_for.json": "元彼」という言葉は、文化的には「嫌いな人」や「人生の悪役」と同義であり、「元彼」という言葉を使う人はあまりいません。\n憎い人」や「私の人生の悪役」と同義語であるという文化的な意味合いが大きく、完全に否定的ではない形で元カレについて語る人はほとんどいません。\n否定的ではない形で元恋人のことを語る人の方が圧倒的に少ないのです。\n\n私の知り合いにも、元カレのことを疑っている人がいるほどです。\ngood...",
  "data/reddit-ask/r/NoStupidQuestions/comments/owbk2t/why_is_being_stagnant_in_life_so_frowned_upon_by.json": "私は最近、毎週金曜日に休みを取るために仕事量を80％に減らすことにしました。\n承知の上で、昇進のチャンスを失ってしまいました。\n\n私の家族や友人のほとんどは、困惑したり、笑ったりしていました。\n「このような考え方では、遠くに行くことはできないだろう」などと言って、私を笑っていました。付け加えれば、私はすでに\n私はすでに...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oweu98/am_i_becoming_a_millenniboomer_or_is_modern_music.json": "2020年代は、失われた音楽の10年になると思います。私だけかもしれませんが、私はラジオをつけるよりも\nラジオを聴くよりも、2000年代のスローバックを聴きたいと思っています。このことを何人かの友人に話してみました。\nこのことを何人かの友人に話したところ、彼らも同じ意見でした。ある時点で、私は\nソングライターはアイデアが尽きてくると思うんです。疑問に思ったのですが...",
  "data/reddit-ask/r/NoStupidQuestions/comments/ow8b6c/is_it_weird_or_unusual_to_go_to_the_public.json": "(皆さんの好意的な意見に驚いています）。)",
  "data/reddit-ask/r/askscience/comments/ow98u9/why_doesnt_the_immune_system_attack_implanon.json": "なぜ、他の異物のように、インプラントを攻撃して破壊しようとしないのでしょうか？\n他の異物のように",
  "data/reddit-ask/r/askscience/comments/ow9l1e/is_our_solar_system_self_sufficient.json": "私たちの太陽系だけが存在する仮想的な宇宙では\n偶然にできた太陽系でも、すべてが同じようになるでしょうか？",
  "data/reddit-ask/r/askscience/comments/owap3h/is_a_rivers_water_temperature_affected_by_weather.json": "夏になると、私はよく友達と近くの渓流に泳ぎに行きます。\n彼らによると、雨が降った後の晴れた日に潜るのは良くないそうです。\nなぜなら、雨が渓流全体を冷やしているかもしれないからです。正直なところ、私にはとても馬鹿げた理由に思えます。\n沢の水は流れているのだから、理由としては非常に馬鹿げていると思うのだが...。",
  "data/reddit-ask/r/askscience/comments/owe2bp/why_are_adverse_reactions_to_vaccines_more_common.json": "COVIDワクチンの副反応に目を通していたのですが、興味深いことに\n興味深いのは、CDCの報告によると、若年層の方がより多くの副反応を経験していることです。\n興味深いのは、CDCの報告によると、若い人の方が年配の人よりもCOVIDワクチンの副反応を経験する（少なくとも報告する）可能性が高いということです。\n興味深いことに、CDCの報告によると、若い人の方が年配の人よりもCOVIDワクチンの副反応を経験する（あるいは少なくとも報告する）可能性が高いそうです。私はそれが...と思っていました。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/owg7gd/why_are_lesbian_women_so_fetishized.json": "どうしても理解できません。\n\n先日、彼と友人と話をしていて、「なぜ、\"Summer \"になると、\"Summer \"にならないのか？\nテレビで「ゲイの独身者」とかが出てこないのはなぜかと聞いていました。\n\n私の友人は、テレビ会社はゲイの独身女性を出す前に、レズビアンの独身女性を出す方が多いだろうと言っていました。\nなぜなら、レズビアンは...。",
  "data/reddit-ask/r/AskHistorians/comments/owbxvi/how_did_armies_deal_with_rapists_prior_to_rape.json": "u/sunagainstgold [/u/sunagainstgold]さんは、次のような素晴らしい回答でこのことに触れています。\n中世における性的暴力について。私は、これは独立した質問に値するほど明確であると思いました。\n私の質問は大まかに言って\n\n\n\n私の質問は、大まかに言えば、レイプした兵士の結果はどうだったのか、ということです。\n人をレイプしたり、性的に暴行したりした兵士は、どのような結果になったのでしょうか？",
  "data/reddit-ask/r/AskWomen/comments/owgb8y/what_are_your_favorite_things_to_do_alone.json": "ひとりの方がいいものもあります。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/owj6zt/who_brushes_their_tounge.json": "私の歯磨きの習慣は、歯を磨いた後に舌を磨くことです。\n歯を磨いた後に舌を磨くことです。理由はいろいろありますが、基本的には古い角質や細菌を取り除くためです。\n細菌を除去するためです。\n\nしかし、他の人はどのように舌を磨いているのでしょうか？よくあることなのでしょうか？\n一般的でしょうか？",
  "data/reddit-ask/r/askscience/comments/owkeq6/why_cant_you_refuel_while_the_engine_is_running.json": "私はこの「ルール」を車の文脈で知っていますが、飛行機や船にも当てはまるのではないでしょうか。\nや船にも当てはまると思います。なぜこのようなことが起こるのでしょうか？給油することで燃焼室が開くわけではありません。\n燃焼室が開くわけではないし...。それに、もしガスが発火の危険性があるとしたら、タンクの中のガソリンからは発火しないのでは？\nタンク内のガソリンから発火するのでは？拙い知識で申し訳ありませんが・・・。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/owi4if/do_men_like_to_have_their_ass_licked_by_their.json": "シャワーを浴びた直後の話ですよ。私はそれが好きで、穴を弄られるのが好きです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/owpgxj/is_it_ok_for_me_as_a_straight_guy_to_put_a_dick.json": "私は27歳のノンケですが、なぜか口の中にペニスを入れてみたいと思っています。\n口の中にペニスを入れるとどんな感じになるのか試してみたいのです。\n\nはっきりさせておきたいのは、僕は100％ストレートだということです。これは議論の余地があると思いますが\n女性とマンコにしか惹かれないのは確かだ 私は単に\n欲しいのは...",
  "data/reddit-ask/r/AskHistorians/comments/owr7e3/why_is_it_often_colonels_and_not_generals_that.json": "近代史を振り返ってみると、下級武官（大尉、大佐、下級元帥のグループ）が\n(下級武官（大尉、大佐、下級大将のグループ）がクーデターを企てたり、成功させたりすることが多いようです。\nクーデターを起こそうとしたり、それに成功したりするのは、下級武官（大尉、大佐、下級将軍のグループ）が多いようです。高級将校によるクーデターももちろんありますが\n将軍によるクーデターもたくさんありますが・・・。",
  "data/reddit-ask/r/NoStupidQuestions/comments/owutbe/how_do_people_who_work_a_95_job_go_to_the.json": "個人的な休暇でほとんど説明がつきますが、毎週のセラピーは？毎週仕事を休むわけにはいかないし\n毎週仕事を休むわけにもいかないし...。\n\n\n\nまた、ある銀行がPM業務の需要を利用して、遅くまで営業しないのはなぜでしょうか？\n遅くまで営業している銀行があります。",
  "data/reddit-ask/r/askphilosophy/comments/owibjm/ive_never_been_to_the_eiffel_tower_how_can_i_know.json": "このサブレディットで質問するのが正しいことを願います。\n\n塔を例にとると、実際にそこにいなくても、その塔が本物だとどうやって知ることができますか？\n知ることができますか？私が見たタワーの写真やビデオが全て作り物である可能性は極めて低いですが、完全に不可能ではありません。\n可能性は低いですが、不可能ではありません。あるいは、誰かが私に「行ったことがある」と言ったとしても\n誰かがそこに行ったことがあると言っても、それは...",
  "data/reddit-ask/r/AskHistorians/comments/ox5p0v/before_food_allergies_became_knowndetected_would.json": "もしそうなら、このような間違いが起こった歴史的な出来事が記録されていますか？\nあるのでしょうか？この人が毒殺されたのは非常に不思議だが、アレルギーや病気の可能性もある」というように。\nアレルギーや病気の可能性もある」という意味で、もしそうだとしたら、その小さな断片がどのくらいの影響を与えるのか。\nもしそうだとしたら、そのような小さな知識がどれだけ大きな影響を与えることができるのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/oxe4ce/ancient_roman_roads_are_useable_2000_years_after.json": "私たちは、生存バイアスによって過去の業績に対する見方が偏っているのかもしれません。\n生存バイアスがかかっているのかもしれませんが、現代のインフラには\n現代のインフラは、一度の寿命を超えて構築されることはほとんどありません。その一方で、ヨーロッパの何十もの都市を訪れると\n一方で、ヨーロッパの何十もの都市を訪れると、古い建物、道路、水...",
  "data/reddit-ask/r/AskHistorians/comments/ox5c4l/how_were_people_tracked_down_in_the_middle_ages.json": "今日、私たちは、電話を鳴らしたり、パスポートをチェックしたりと、人を見つける方法をたくさん持っています。\n調べることができます。\n\nテレビや映画では、登場人物が国中の騎士や衛兵に追われる場面がよくあります。\n国中で騎士や衛兵に追われる場面をよく目にしますが、彼らはしばしば「痕跡を拾う」と言いますが、これは少し突飛な話です。\n\nでは、無法者はどのようにして国中を追われたのでしょうか？例えば、高...",
  "data/reddit-ask/r/AskHistorians/comments/oxginf/revenge_of_the_nerds_1984_is_now_notorious_for.json": "映画には歯がゆいシーンがたくさんありますが（ぐったりとした投げ方の動作\n女の子が彼氏だと思っている人とセックスしている（実際にはそうではない）のが一番NG。\n今日では最も悪名高いものです。\n\nこの映画は同時期に物議を醸したのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/ox5rry/in_the_50s_in_the_southern_usa_if_a_white_man.json": "私（白人男性）は、テネシー州のガールフレンド（黒人女性）のところに滞在します。\n数年後には結婚したいと思っているんだ。\nテネシー州に異性交遊禁止法があったとき、このような状況にある人たちは何ができたのだろうかと考えました。\nテネシー州に異性交遊禁止法があったとき、このような状況にある人たちはどうしていたのだろうと思いました。私たちのどちらかが、法的な罰を受けることになるのでしょうか...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ox6lo6/do_nonwhite_people_bleach_their_buttholes.json": "肛門を漂白する目的が肌の色を明るくすることだとしたら\nそれは有色人種にとっては無意味であり、好ましくないことではないでしょうか？肛門の漂白は\n肛門の漂白は本当に白人だけのものなのか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oxam88/do_men_prefer_a_hairless_vagina.json": "私（F18）は、ほとんどの男性が実際にパートナーに剃ってもらいたいと思っているのかどうか、とても興味があります。\n剃ってほしいと思っているのか、とても気になります。私は剃っても問題ないと思いますが、毛がすぐに生えてくる毛深い女性にとっては\n私は剃っても問題ないと思いますが、毛深い女性はすぐに毛が生えてくるので、翌日に無精ひげが出てしまうのは勿体ないです。\n翌日に無精ひげが目立つのはもったいないし、時間もかかるし...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ox1qd8/how_do_i_report_cp_specifically_if_its_on_discord.json": "ツイッターを見ていたら、誰かがdiscordにポルノのリンクを貼っていたので、普通のことだと思って参加した。\n普通の動画だと思って参加したんだけど、その動画は明らかに\n未成年の女の子の動画だった その動画は、あるクソ野郎がメールや操作をしている画面を録画したものだった。\n14歳以下の女の子にメールを送って操って...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oxcqzv/am_i_too_old.json": "私は30歳(M)で、ずっとヒーリーズが欲しかったのですが、子供の頃に親が買えなかったので\n子供の頃は親が買えませんでした。今、私はお金を持っていますが、私は年を取りすぎているのではないかと思っています。\n履くには年齢的に無理かなと思っています。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ox7e6c/someone_said_im_not_allowed_to_draw_people_of.json": "さて、少し前のことですが、私が描いたポックの絵を投稿したことで、ある人が私に激怒しました。\n黒人のキャラクターを描くのは差別だと言われました。\nこれは本当ですか？この絵にはステレオタイプはなく、攻撃的でもありませんでした。\n私の義理の兄と義理の母にも聞いてみましたが...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/oxel2n/why_do_people_make_it_feel_weird_to_leave_work_as.json": "というわけで、新しい仕事を始めて、今日は4週目の初日でした。これが私の\nオフィスでの仕事は初めてです。勤務時間は8時から5時、昼食は1時間です。I\n私は通常、8時の5～10分前には到着し、（ある日、出口を間違えて15分遅れたことを除いては\n8時になってから仕事を始めます。",
  "data/reddit-ask/r/NoStupidQuestions/comments/ox4jq9/why_does_reading_old_commentspostsvideos_on_the.json": "6時間後に編集。\n\n尋ねられているので、この記事のタイトルで私が話していた1つの記事は\n23年前のPCゲームのコントローラーサポートについてです。\n歳のPCゲームのコントローラーサポートについてでした。そのため、多くの理由から良い例とは言えません（今になってわかりました。\n最初に思い浮かんだだけです）。)\n\nその...",
  "data/reddit-ask/r/askscience/comments/ox7rvp/how_to_understand_that_godels_incompleteness.json": "素人目には、彼の不完全性定理と完全性定理が矛盾しているように見えます。\n矛盾しているように見えますが、どちらも真であることがわかります。\n\n完全性定理は、\"真のものは何でも証明できる \"と言っているように見えます。しかし、その\n不完全性定理は、「証明可能性には限界がある」ということを示しているように思えますが......。",
  "data/reddit-ask/r/askscience/comments/oxg13j/how_does_chickenpox_keep_reappearing_if_its_so.json": "デルタCOVIDと水疱瘡を比較して、コミュニケーションのしやすさを考えてみました。\nもし、ほとんどの人が子供の頃に水疱瘡にかかり、その後免疫ができたとしたら、私はどうすればいいのだろう？\n殆どの人が子供の頃に水疱瘡にかかり、その後免疫ができたとしたら、どうして水疱瘡は再発するのだろう？媒介となるものがあるはずです。\nつまり、一人の子供が水疱瘡にかかり、それを他の子供にうつす必要があるのではないでしょうか。",
  "data/reddit-ask/r/AskHistorians/comments/oxnlcy/what_was_the_original_intentlogic_behind_the.json": "大統領が事前の承認なしに個人を赦免する権限を与えるのは、奇妙な決定のように思える。\n特に、大陸議会がこのような問題を解決するために多大な努力をしたことを考えると、事前の承認なしに\n大陸議会が権力を均等に配分するために大変な苦労をしたことを考えると、奇妙な決定のように思えます。\n特に、大陸議会が権力の均等な配分を確保するために多大な努力をしたことを考えると、奇妙な決定のように思える。建国の父は、この恩赦に何を期待していたのでしょうか。",
  "data/reddit-ask/r/AskHistorians/comments/oxjpom/were_there_any_sacrifices_or_battles_lost.json": "最近聞いた話では、英国政府はコベントリーが攻撃されるというドイツの無線を解読したが\n英国政府は、コベントリーが攻撃されることを示すドイツのラジオ放送を解読しましたが、チャーチルは、コベントリーから避難しないようにと命令しました。\nチャーチルは、エニグマを解読していたことをドイツに悟られることを恐れて、避難も防衛もしないように命じたそうです。\nそれは、イギリス人がエニグマを解読できることをドイツ人に悟られることを恐れてのことだった...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/oxmuiy/is_it_illegak_to_bet_on_baby_racing.json": "Just wonderin",
  "data/reddit-ask/r/askscience/comments/oxouav/why_are_the_largest_black_holes_we_know_of_so_far.json": "YouTubeのチャンネル「Kurzgesagt」は最近、既知の最大級のブラックホールに関するビデオをアップロードしました。\n話題になっている大きなブラックホールの多くは、最も遠くにあるもののようです。\n大きなブラックホールの多くは、最も遠い場所にあるようです。OJ 287とTON 618はどちらも数十億光年の距離にあります。\n我々から数十億光年の距離にあります。\n\n遠くを見ていると...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oxt09v/can_we_please_stop_asking_about_genital_hair.json": "感想を聞く質問が45件もあり、今、活発に行われています。これが\n好きな人もいれば、そうでない人もいます。自分のやりたいことをやって\n好きなことをして、自分に自信を持って、快適に過ごしましょう、それがどんな意味であれ。\n\n手入れをしないと、たぶんかゆくなります。あなたが得るかもしれない...",
  "data/reddit-ask/r/NoStupidQuestions/comments/oxrprm/why_arent_limitedterm_marriage_contracts_a_thing.json": "2年、5年、10年、15年......と、期間終了時に更新するかしないかの選択ができます。\nそうすれば、面倒な離婚をしなくても、法的手続きや多くの人の生活が楽になりますよね。\n\nそうすれば、法的手続きや多くの人の生活が楽になるのでは？\n弁護士や専門的な法律の経験を持つ人が意見を述べてくれることを期待しています。",
  "data/reddit-ask/r/NoStupidQuestions/comments/oxtmmv/to_the_people_who_wear_very_revelling_clothes_in.json": "このような質問をして、悪い人だと思われないことを願っています。\n理由を理解できませんでした。外出するときだけ露出度の高い服を着る人がいますが\n外では露出度の高い服しか着ない人がいて、それを見られると動揺してしまう。見られたくないのに、なぜ自分の体を\n見られたくないのに、なぜ体を強調するのでしょうか？私が最もよく耳にするのは...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oxvoad/men_who_are_into_woman_would_boobs_with_big_scars.json": "褒めてもらいたいとか、再確認してもらいたいとか、そういうことではなくて、誰にでも体の向きがあって、それが\nそのうちの一つであったとしても理解できます。\n\n私は乳房縮小術を受けましたが、残念なことに、私の皮膚はそれから快く回復しませんでした。\n(私は乳房縮小術を受けましたが、残念なことに私の皮膚はそこからきれいに回復しませんでした（ケロイドです、興味のある方はグーグルで調べてみてください）。\n乳首の周りや",
  "data/reddit-ask/r/NoStupidQuestions/comments/oxgwnj/am_i_posting_wrong.json": "他のサブレディットに投稿しても、誰もが無視します。\n実際には投稿されていないのに、何か変なことをしているのでしょうか？\n投稿しているのか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/oxu4bu/why_are_some_comments_collapsed.json": "なぜランダムなコメントが記事に折りたたまれているのですか？傾向が見られない...それは\n不適切なコメントではなく、ランダムなコメントなのです。何か\n理由はありますか？",
  "data/reddit-ask/r/AskHistorians/comments/oxrtio/did_mustafa_kemal_atatürk_really_order_the.json": "9日前にこの質問をしたところ、19のupvoteがありましたが、回答がありませんでしたので、再度質問します。\nもう一度質問します。",
  "data/reddit-ask/r/AskHistorians/comments/oxtouh/as_ethiopia_is_one_of_the_first_christian_nations.json": "つまり、イタリアが植民地化しようとする前は\n\nググってみましたが、質問に対する答えはありませんでした。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oxwhp9/why_do_i_have_a_better_feeling_after_jerking_it.json": "最近では、エロ本やエロ写真を見た後の方が満足度が高いことに気づきました。\nエロティックな写真では満足できるが、ポルノビデオでは満足できない。理由はわからないが、怖くて聞けない。\n聞くのが怖い。",
  "data/reddit-ask/r/NoStupidQuestions/comments/oxzdnm/please_help_me_find_if_my_friend_is_trolling_me.json": "私は英語もゲームも超初心者なので、友人の一人が「英語で会話するのは全く問題ない。\nGTA5での会話のように会話しても全く問題ないと言っていました。私は\n疑っています。というのも、その言葉は私には下品に感じられるのですが、友人はそれは単なるインフォーマルなコミュニケーションの方法だと言っています。\nただのインフォーマルなコミュニケーション方法だと言っていました。しかし、私の友人は、それはカジュアルなコミュニケーションだと言いました。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oxvlhx/could_we_add_a_new_rule_to_the_sub_if_you_can.json": "このサブテーマで目にするのは、ボディイメージ、性別、髪型、アイデンティティなどに関する質問がほとんどです。\nアイデンティティなどです。これらの質問はすべて、「男性/女性はxやyが好きですか」というようなものです。\ny\". これらの質問はすべて、「人によりけり」と答えることができます。\n\nこれでは、とてもつまらないサブテーマになってしまいます。このサブは若い人向けなのかな...。",
  "data/reddit-ask/r/AskHistorians/comments/oxuepf/was_nationalismpatriotism_really_an_idea_that.json": "よく耳にするのは、愛国心や今日でいうところのナショナリズムを感じさせるような考え方です。\n愛国心や民族の誇りというものは、比較的新しいものだという考え方をよく耳にします。\n\nしかし、ちょっと待ってください。民族的なレッテルはまだ存在していたのではないでしょうか。ヨーロッパの王国は\nヨーロッパの王国は、その中の民族や支配的な部族の名を冠していました。聖人ビーデも\n例えば...。",
  "data/reddit-ask/r/AskHistorians/comments/oy1ag6/during_the_early_modern_period_contacts_between.json": "この質問をしたのは、美学がどれだけ文化の壁を越えられるかに興味があるからです。\n文化的な境界をどれだけ超えられるかに興味があるからです。ヨーロッパの芸術がイスラムや中国の芸術に影響を与えたことは知っています。\nアブ・ファズルは、ヨーロッパの芸術家の「世界的な名声」について言及しています。\nアブ・ファズルはヨーロッパの芸術家の「世界的名声」について語っていますが、このテーマについてもっと知りたいと思っています。アジアの批評家たちは...",
  "data/reddit-ask/r/AskWomen/comments/oxxavj/those_of_you_who_are_homemakers_by_profession.json": "edit: 「主婦とはどんなものか」と聞いただけでマイナス評価を受けるとは\n尋ねただけで、なぜダウンボットされるのでしょうか？\n\n主婦をやると決めたときに、何かを捨てたり、残したりしたものはありますか？\n捨てたもの、残さなければならないものはありますか？\n\nもし、あなたが主婦になる決断をする前に、経済的にもキャリア的にもやる気があったとしたら、あなたは...\n主婦になることを決める前に",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oxynoo/addicted_to_masturbating.json": "私は24歳になったばかりで、13年以上も自慰行為に依存していることに気づきました。\n13年 ....\n\nこれまでの人生の中で、「絶対にやめてやる」と自分に言い聞かせたことは数え切れないほどありました。\nと自分に言い聞かせてきました。しかし、いつも何度も何度もその悪い習慣を繰り返してしまうのです。\n何度も繰り返してしまいます。\n\n友達に「オナニーしてるの？",
  "data/reddit-ask/r/askscience/comments/oxwul5/does_the_original_covid19_strain_still_exist_and.json": "ただ、イギリスとオリジナルのウイルスがまだ存在するかどうかは気になるところです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oy8qfs/my_brother_has_been_sexualy_harassing_me_for_the.json": "私の弟は長い間、私にセクシャルハラスメントをしてきました。\n私の服を脱がそうとしたり、局部をつかんだり、私が着替えているところを盗撮したり、私とセックスしようとしたりしています。\n私が着替えているところを盗撮したり、私とセックスしようとしたりしています。私は何度も両親に伝えようとしました。\n両親に伝えようとしましたが、自閉症だからよくわからないと言われてしまいました。彼らは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oy43g9/do_you_see_rinterestingasfuck_and_read_it_as.json": "すみません。今さら見直すこともできません。",
  "data/reddit-ask/r/NoStupidQuestions/comments/oy8goe/report_friend20ffor_sleeping_with_minor15m.json": "皆さん、こんにちは！私の周りには現在、未成年の人と付き合っている人がいます。\nそれは私にとってとても気持ち悪いことで、私がオンラインでどのように手玉に取られたかを思い出させます。\n私たちの州の同意年齢は16歳（ミシガン州）で、現在、彼女はその人と彼のお母さんと一緒に暮らしています。\n現在、彼女は彼との間に子供を作りたいと思っています。どうしたら...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oydly4/is_it_still_considered_rape_if_there_was_guilt.json": "以前から、私のパートナーは、私に無慈悲な仕打ちをしてきました。\n私がセックスをしたくないと言うと、鬱のスパイラルに陥ります。私は説明しようとします。\nその場では全く興味がないことを説明しようとします。\n\nそうすると、相手は悲しくなって黙ってしまい、私を無視するようになります。私ができる唯一の方法は・・・。",
  "data/reddit-ask/r/NoStupidQuestions/comments/oy77xu/help_is_my_cat_purposely_putting_me_to_sleep.json": "愛猫と私はいつも一緒です。私の部屋は彼女の部屋。私のベッドは彼女のベッド。彼女は\n走り回ったり、窓からウサギを見たりしていますが、いつも最終的には私のベッドの上に\n結局は私のベッドに寄り添っている。そして、私が彼女と一緒に横になって一休みしたり、テレビを見たりすると\n一緒に横になってテレビを見ていると、ゴロゴロと鳴いておねだりしてきます...。",
  "data/reddit-ask/r/AskWomen/comments/oy2emk/what_is_your_favorite_cereal.json": "こんにちは",
  "data/reddit-ask/r/askscience/comments/oy0m7h/is_highlow_iq_positively_correlated_with_an.json": "IQは精神病と正の相関があるとする資料もあれば、負の相関があるとする資料もある。\n負の相関があるとする資料もあります。この点について文献は不確かなのか\nそれとも、このテーマに関して科学界に分裂があるのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oyfek9/do_midgets_have_normal_sized_penises.json": "頭の大きさが普通だから、小人のペニスは小さいのか？それとも\n他の頭も普通の大きさなのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/oy0ca7/why_do_most_cups_go_instead_of.json": "なぜ多くのカップは、全体が同じ大きさではなく、上部が下部よりも大きいのでしょうか？\n同じサイズではなく",
  "data/reddit-ask/r/AskHistorians/comments/oyf9z9/how_common_was_organized_crime_in_the_medieval.json": "私は、20世紀に組織犯罪がいかに大きな役割を果たしたかについて考えてきました。\n世紀、そして少なくとも19世紀の一部において、組織犯罪がいかに大きな役割を果たしていたかを考えています。私は\n疑問に思うのは、これはどのくらい前から続いているのかということです。\n\n組織化された保護ラケット、密輸や密造、雇われ殺人などです。\n雇われサービス（目的は...",
  "data/reddit-ask/r/askscience/comments/oyeg3f/is_it_even_feasible_to_terraform_mars_without_a.json": "火星のテラフォーミングについてよく耳にしますが、先日、月のテラフォーミングの方が簡単だというビデオを見ました。\n月でやったほうが簡単だというビデオを見ました。しかし、私が知る限り、彼らはひとつの重大な問題を省いているようです。\n私の知る限りでは、1つの重大な問題を省いているようです。\n\n太陽風で大気が吹き飛ばされないようにするには、磁場が必要です。それがないと\nそれがなければ、なぜこのような...",
  "data/reddit-ask/r/AskHistorians/comments/oyctfr/were_the_late_60s_and_70s_more_progressive_for.json": "最近、昔の映画を見ていて、LGBTの権利について先進的な映画があることに驚かされました。\n60年代後半から70年代にかけての映画の中には、LGBTの権利について先進的なものがいくつかあります。\n例えば、『シャフト』や『Dog Day Afternoon』、『真夜中のカウボーイ』などです。で\nShaft』では、ゲイのバーテンダーが登場します。彼はある意味、ステレオタイプで......。",
  "data/reddit-ask/r/NoStupidQuestions/comments/oydyv1/i_dont_understand_why_crazy_antichoice_people_are.json": "もっと軽い罪で逮捕・勾留されている人を見たことがあります。私には理解できません。\n\nエディット：私は \"クレイジー \"と書いたことに注意してください。\n\n平和的に自分の意見を表明することに反対はしませんが、検閲はあまり好きではありません。\n検閲はあまり好きではありません。",
  "data/reddit-ask/r/askphilosophy/comments/oy9sm5/what_would_a_utilitarian_make_of_the_truman_show.json": "この番組は、それを見た何百万人もの人々に喜びをもたらしました。同時に、それは\n人を操作して、その人の人生を完全なものにするという恐ろしいコンセプトです。\nこの番組が現実にあったとしたら、実用主義者は反対するでしょうか？\n反対するでしょうか？どう反応するだろうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oygin5/how_do_we_still_allow_male_circumcision.json": "女性の割礼が忌まわしいほど間違っているのに、なぜまだ男性の割礼を許しているのか\nどちらも無承諾の子供を切り刻んでいるのに、なぜそれが許されるのでしょうか？",
  "data/reddit-ask/r/askscience/comments/oykxuf/what_happened_to_herd_immunity.json": "パンデミックの初期には、集団免疫の獲得について多くの議論がなされました。\nしかし、デルタ・バリアントが世界中で猛威を振るうにつれ、集団免疫の話はなくなってしまったようです。\nしかし、デルタ型が世界中で猛威を振るうようになると、集団免疫に関するすべての話はなくなってしまったようです。これはなぜでしょうか？それとも、私が状況を誤解しているだけなのでしょうか？\n状況を誤解しているのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/oy7rsx/moby_dick_queequeg_and_homossexuality_in_19th.json": "こんにちは！この質問は以前にもされたことがありますが、回答はありませんでした。冒頭の\nモビーディック』の冒頭で、イシュマエルとQueequegの関係は、現代の私たちが理解するものと非常に近いものです。\n現代の私たちが同性愛者として理解するものに非常に近いものがあります。クィーケグはイシュマエルをつかみ、結婚したと言います。\n結婚したと言っています（おそらく彼の文化では、それは彼らが...という意味でしょう）。",
  "data/reddit-ask/r/AskHistorians/comments/oyme8o/in_the_sexual_confession_of_a_russian_anonymous.json": "この本は、匿名の語り手がセックスの歴史を語る自叙伝であるとされています。\n語り手が自分の性の歴史を語る自伝である。彼は時々、少し誇張しているように見える。\nこのナポリでのエピソードは、事実に基づいているのだろうか。\n読んでいてとてもショックを受けました。\n\nいくつかの引用...",
  "data/reddit-ask/r/AskHistorians/comments/oyt4h5/have_judaism_christianity_and_islam_always_been.json": "私は、同じような物語や伝統に基づいた似たような信仰があったのではないかと思っていました。\n同じような物語や伝統に基づいた信仰があって、それが消滅したり、他のものに飲み込まれたりしたことはないだろうか。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oytcop/do_guys_find_saggy_boobs_considered_to_be.json": "自分の体に不安を感じていましたが、体重が減りました。約90ポンドです。\n今、私は114歳ですが、私のオッパイはなんというか、ハリがなくなってしまいました。かなりたるんでいます。\n垂れてしまっていて、とても不安です。私は最近19歳になり、自分をアピールしようとしています。\n出会いの場に身を置こうとしています。私は、私たちがそのようなことをするとは思わない...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oyv08n/have_the_majority_of_guys_used_a_cum_sock_to.json": "私は今まで、何かに基づいてそれらが存在するものだと思っていましたが、そうではないようです。\nそうではないようなので、どれくらい一般的なのか気になっていました。",
  "data/reddit-ask/r/NoStupidQuestions/comments/oyo4d3/whats_a_high_paying_job_for_stupid_incompetent.json": "友人（とても親しい友人）を尋ねる",
  "data/reddit-ask/r/AskHistorians/comments/oynnog/the_death_of_stalin_paints_nikita_khrushchev.json": "予想外というのは、プレジデンムのメンバーにとっても、一般の人々にとっても、ということです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oys280/if_i_was_threatened_with_my_partners_suicide_is.json": "このサブレディットの最近の人気記事を見て、自分の経験について考えてみました。\nそして、それをどのように分類すべきかを考えました。\n\n何年も前の高校生の頃、私はよくセックスを強要されていると感じる関係にありました。\nセックスを強要されていると感じていました。最初はうまくいっていたのですが、1年ほど経った頃、彼が以下のことを話し始めました。\n落ち込んでいて...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/oyx3mz/at_20_years_old_is_it_normal_to_have_grown_apart.json": "TL;DR 私は、半年以上返事をくれなかったすべてのソーシャル・メディアの人を友達解除しました。\n半年以上返信のない人は誰もいなくなってしまいました。\n私も連絡を取ろうとしなかったわけではありませんが、彼らはいつも私を既読のままにして、私の友人であり続けることに興味を示さなかったのです。\n友達になる気もない。\n\n確かに、私は...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oyxlyi/when_do_we_stop_talking_about_how_to_prevent.json": "過去20年間の気候変動に関する研究を見てきました。\n研究結果は悪化の一途をたどっています。ある研究では、私たちは帰れない地点を通過したと言っています。\n大西洋の海流が変化している可能性があるという研究結果を読んだばかりです。\n大西洋の海流は変化の過程にあるかもしれないという研究を読んだばかりです。\n\n人間の性質として、私たちは反応しません...",
  "data/reddit-ask/r/askscience/comments/oyglq0/if_all_of_our_solar_systems_planets_are_orbiting.json": "つまり、太陽系の惑星は、すべての楕円軌道が共通の平面上にあることに近いのです。\n楕円軌道が共通の平面上にあることになります（私の理解では、水星は黄道から約7度離れた最も遠い平面上にあります）。\n黄道から約7度離れています）。)\n\nこのことから、太陽の光の一部が黄道面から外れてしまうことは容易に想像できます。\n8...",
  "data/reddit-ask/r/askscience/comments/oyrnua/how_will_cooling_as_a_result_of_the_amoc_current.json": "この記事\n[https://www.washingtonpost.com/climate-environment/2021/08/05/change-ocean-collapse-atlantic-meridional/]をご覧ください。\nこの海流が止まってしまうと、北半球の一部が寒くなってしまう可能性があるそうです。\n北半球の一部が寒くなる可能性があるそうです。それは冬だけが寒いということでしょうか、それとも1年中寒いということでしょうか？また\n暑さはまだ続くのでしょうか...？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oylaxl/if_republicans_are_so_maga_and_patriotic_why_are.json": "編集部：ここにはたくさんのトリガーを持った人がいます。",
  "data/reddit-ask/r/askscience/comments/oz0bo1/i_recently_learned_covid_has_a_lipid_membrane_but.json": "タイトルにあるように、ウイルスはタンパク質の殻にDNAを詰め込んだもので、宿主の細胞にDNA（またはRNA）を注入するものだと教わりました。\nが詰め込まれたタンパク質の殻で、宿主の細胞にDNA（またはRNA）を注入すると教わりました。今になってわかったことは\n膜を持ち、複数の膜タンパク質を持っているものもあるとのこと。\n私の頭の中にあるイメージよりもずっと複雑です。今の私は...",
  "data/reddit-ask/r/AskWomen/comments/oz3tbq/what_were_your_first_thoughts_when_you_met_your.json": "あるいは、最初に話をしたときに、その人に対してどのような感覚・直感を持っていたか。\nその人と最初に話したとき、どんな感じがしましたか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oz37es/what_are_your_reasons_to_keep_on_living.json": "提案が欲しい",
  "data/reddit-ask/r/askscience/comments/oz3x50/what_is_p_hacking.json": "P値とは何か、Pハッキングとは何かというTED-EDのビデオを見て、混乱しています。\nP値は正確には何を証明しているのでしょうか？P値が0.05以下だと仮説が正しいということですか？\n仮説が正しいということですか？\n\nリンク： https://youtu.be/i60wwZDA1CI",
  "data/reddit-ask/r/AskWomen/comments/oz6o4p/whats_something_you_are_looking_forward_to_thats.json": "自分がワクワクすることなら何でもいいんです。",
  "data/reddit-ask/r/askphilosophy/comments/oz3j5o/if_you_abstain_from_evil_deeds_due_to_fear_of.json": "例えば、同僚がテーブルの上に置いた携帯電話を私が盗まなかったのは\nテーブルの上に置いてあった携帯電話を盗まなかったのは、CCTVに映るのを恐れたからだとします。\n\n愚かなことをしたくないので、深酒をしない。\n\nウェイターやサービススタッフに敬意を持って接するのは、自分が十字架にかけられたくないからだ\nにはりつけにされたくないからだ。",
  "data/reddit-ask/r/NoStupidQuestions/comments/oz46ch/why_is_it_so_common_for_indian_youtubers_to_make.json": "ネイティブスピーカーではないので、相手のひどい訛りを解読しようとすると、頭が混乱してしまいます。\n訛りを解読しようとすると頭が混乱します。\n別の言語を話していることに気がつきます。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oz6uio/why_is_usa_never_held_liable_for_killing_innocent.json": "なぜダブルスタンダードなのか？",
  "data/reddit-ask/r/AskHistorians/comments/oz4r0x/why_is_jack_the_ripper_almost_always_portrayed_as.json": "そのような人は、貧困にあえぐW.S.のスラム街の中でもひときわ目立っていたのではないかと思います。\n貧困にあえぐスラム街ホワイトチャペルでは、そのような人は非常に目立っていたと思います。そして、被害者の一人は\n犠牲者の一人が死の直前に潜在的な客と話しているところを目撃されている。\nジャックと思われる客と話しているところを目撃されています。そして彼はあなたの格好をしていた...",
  "data/reddit-ask/r/NoStupidQuestions/comments/oz91sc/is_it_illegal_for_a_35_year_old_to_hook_up_with_a.json": "35歳の同僚が、自分が好きで付き合おうとしている女の子の写真を見せてくれました。\n付き合おうとしています。彼は彼女が17歳だと言いました。聞くまで知らなかったそうです。\n聞くまで知らなかったそうです。彼は彼女がもっと年上だと思っていました。\n\n彼はまだ興味があると言っていました。\n\nこれって違法じゃないの？\n\n彼女は18歳未満です。\n\n私はアメリカに住んでいます。で...",
  "data/reddit-ask/r/NoStupidQuestions/comments/oyydju/why_is_there_such_an_insane_amount_of_normalized.json": "どうしてもその理由がわかりません。言及しているコメントやスレッドは\nロマや「ジプシー」（これは侮蔑的な意味ではなく、ただの言い回しとして\n人種差別や偏見の塊になってしまいます。誰か\nなぜこのようなことが蔓延し、常態化しているのか説明できますか？\n\n編集：これは...",
  "data/reddit-ask/r/askscience/comments/ozao4h/why_isnt_water_used_in_hydraulic_applications.json": "水が一般的に非圧縮性であるならば、なぜより多くの水理学的用途に使用されないのでしょうか？\n使われていないのでしょうか？\n\n車のブレーキラインを空にして水を入れても、ブレーキラインは機能しますか？\nそれでも動くのでしょうか？\n\n唯一考えられるのは、水は簡単に凍ってしまうので、システムがすぐに壊れてしまうということです。\n水は簡単に凍ってしまうので、システムがすぐに壊れてしまうのです。",
  "data/reddit-ask/r/askscience/comments/ozdflz/with_such_a_high_r0_why_didnt_measles_just_burn.json": "インターネット上では、デルタ・バリアントを使った方が集団免疫に早く到達できるという憶測を目にしました。\nデルタ型は拡散が早いので、集団免疫を獲得するのが早いのではないかという憶測をインターネットで見たことがあります。\nもしそうだとしても、なぜ自然に麻疹が消滅するほどの集団免疫を獲得できなかったのでしょうか？\n麻疹が自然に消滅するほどの集団免疫ができなかったのだろうか（参考までに、麻疹は...",
  "data/reddit-ask/r/NoStupidQuestions/comments/ozc633/how_to_add_nsfw_flair.json": "私の場合は、none、unanswered、answered flairの3つの選択肢しかありません。",
  "data/reddit-ask/r/AskHistorians/comments/oz9b54/what_does_historical_research_actually_look_like.json": "これがsubredditにとってメタ的すぎるかどうかは全くわかりませんが、私は\n適切だと思います。\n\n私は最近、オックスフォード大学が公開したビデオを見ていました。\n最先端の歴史的研究」について言及していましたが、私は研究とは何かをよく理解していないので、少々二度見してしまいました。\nというのも、私は研究とは何かをよく理解していないからです...",
  "data/reddit-ask/r/AskWomen/comments/ozg8w0/single_women_when_did_you_just_stop_dating_or.json": "その理由は？オーバー30のAsk Womenグループからコピーしました-からの回答を見たいと思います。\nここの回答も見てみたい",
  "data/reddit-ask/r/AskWomen/comments/oz8zps/from_your_own_experiences_where_do_you_believe.json": "私はこれを信じているわけではありません（男性として、それは私自身の経験を反映していません）。\nただ、この固定観念について皆さんがどのように考えているのか、また自分や友人など\nあなた自身や友人などの間で、この固定観念についてどのような見解をお持ちなのかをお聞きしたいのです。",
  "data/reddit-ask/r/AskWomen/comments/ozi6fj/how_do_you_get_over_the_fearsocial_stigma_of.json": "その快適な...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ozkbda/are_women_wary_of_every_man_when_walking_on_the.json": "女性が警戒する理由を聞いているわけではありませんし、警戒することを批判しているわけでもありません。I\nあなた方が不気味な捕食者から、控えめに言っても多くのデタラメを経験していることを認識しています。\nプレデター（捕食者）から、控えめに言っても多くのデタラメを経験していることは認識しています。\n\n私がこの質問をしているのは、私が近所を散歩するたびに、女の子たちが\n私たちが同じ歩道にいるとき、女の子はとても私を警戒しているように見えます。",
  "data/reddit-ask/r/NoStupidQuestions/comments/ozhfdg/whats_the_british_idiom_that_sounds_like_ball_egg.json": "編集：今、私は馬鹿にされているように感じます。Ball acheは明らかに私が聞いたものです。\n訛っているし、私はテキサス人だから外国人だと思っていました。みんなありがとう。\nr/nostupidquestions [/r/nostupidquestions]がまさにその意味であることを教えてくれました。",
  "data/reddit-ask/r/askscience/comments/ozhht2/does_human_vision_have_a_better_horizontal.json": "人間の場合、目が水平に並んでいると水平方向の解像度が高くなるのか\nそれとも、縦横ともに同じなのでしょうか？また、人間の\nまた、人間の視覚のアスペクト比はどうなっているのでしょうか？円形か楕円形か、あるいは何か\n全く違うのでしょうか？\n\n最近、ビデオコーディングを少し勉強したのですが...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ozj97m/how_much_can_a_guys_boner_lift_if_a_item_was.json": "私が言っているのは、それにアイテムを貼り付けた場合のことです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/ozjp00/am_i_the_only_one_who_loves_certain_songs_but.json": "自分でもよくわからないのですが、音楽によっては自分の中で何かが引き起こされ、ある種の感情が生まれます。\nそれは悲しみであったり、幸せであったりするのですが、それを言葉で説明するのは難しいですね。\n言葉で説明するのは難しいです。理解してもらえると嬉しいです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oznex4/how_much_is_the_average_female_willing_to_do_anal.json": "私の過去のガールフレンドは皆、気が済むまで「やってみたい」と思っていました。\n私が付き合っている女性の多くは、私を感動させるためか、「やってみたい」と思っています。平均的な\nアナルに興味のある男性が目の前にいない状態で、平均的な女性はどのように考えているのでしょうか？\n目の前にいない状態で",
  "data/reddit-ask/r/AskHistorians/comments/ozi1la/how_prevalent_was_fetal_alcohol_syndrome_in.json": "当時の飲み物は蜂蜜酒やワインなどで、母親が新鮮な水源を確保したり、ミルクを飲んだりしない限り、このような状態になったと聞いています。\n母親が新鮮な水源を利用したり、ミルクを飲んだりしない限り、24時間アルコール飲料を飲んでいたことになる。\n24時間体制でお酒を飲んでいたそうです。\n\n明らかに、彼らはそれを診断する方法を持っていなかったし、それを認識することもできなかった\n(おそらく)生まれてくるすべての赤ちゃんが...",
  "data/reddit-ask/r/NoStupidQuestions/comments/ozqw6y/do_people_staying_multiple_days_at_the_hospital.json": "病院のベッドに数週間滞在する人はマスターベーションをするのでしょうか？もしそうなら、どのくらいの\nプライバシーは確保されているのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ozq8wb/why_are_the_men_in_straight_porn_so_ugly.json": "まともな男が出てくるビデオを探す方がよっぽど時間がかかります。\n実際に...",
  "data/reddit-ask/r/AskHistorians/comments/ozp6rf/how_did_the_irish_become_so_commonplace_in_police.json": "基本的に何かを見ていると（特に時代劇）、警察官としてのアイルランド人\nはよく知られた慣用句です。これは本当の現象なのでしょうか？もしそうだとしたら、なぜ、よりによってアイルランド人が\nまた、そうでないとしたら、そのステレオタイプはどこから来ているのでしょうか？\nのか？",
  "data/reddit-ask/r/AskHistorians/comments/ozrls1/what_did_napoléon_bonaparte_think_of_simón_bolívar.json": "ナポレオンは、シモン・ボリーバルや彼の提唱する「グラン・コロンビア」についてコメントしたり、意見を述べたりしたことがあっただろうか。\nグラン・コロンビア 二人が同じ時期にスペインと戦っていたのは、ごく短い期間だったかもしれません。\n技術的には同じ時期にスペインと戦っていたごく短い期間だったと思いますが、それを認めたことはありますか？\n認められていたのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/oztglz/how_will_our_primary_sources_survive_for_future.json": "これは、過去20年の技術を含むため、20年ルールに違反する可能性があります。\n20年ルールに違反する可能性があります。しかし、私の質問は、歴史そのものよりも、歴史的手法に向けられたものです。\nしかし、私の質問は、歴史そのものよりも歴史的手法に向けられたものです。\n\n一次資料が物理的なものからデジタル化されていく中で、将来の歴史家はどのようにして一次資料にアクセスするのでしょうか。\n物理的メディアからデジタルメディアへと移行していく中で、将来の歴史家はどのようにして一次資料にアクセスするのでしょうか？例えば...",
  "data/reddit-ask/r/AskWomen/comments/ozp5ab/whats_the_best_thing_about_your_partner.json": "逆の質問がここに投稿されていて、それを心配して質問しました。\n落ち込んでしまうのではないかと思ったので、ここでは落ち込んだ人を元気にするための投稿をしました。\nキュートなストーリー。",
  "data/reddit-ask/r/NoStupidQuestions/comments/ozqk6z/anyone_else_experience_postshower_limbo.json": "入るのに少し苦労しますが、一度入ると永遠にいられます。\n時間が止まったような感覚になります。\n\nとても内省的で無気力になり、次の数日間は裸でいたいと思うようになります。\n裸で数時間過ごしたくなります。私だけ？",
  "data/reddit-ask/r/TrueAskReddit/comments/ozdvwo/why_do_an_overwhelming_number_of_people_feel_so.json": "親は「自分は一生懸命育てたのに、子供はそれを理解してくれない」と嘆き、子供は「自分は一生懸命育てたのに」と嘆きます。\n育ててくれたことを理解していない」と言い、子供は「自分が一番頑張ったのに」と文句を言う。\n子供たちは、自分のベストでは十分ではなかった、自分の子供を同じようには育てられないと訴える。\n子供たちは、自分の子供時代は自分が持っていたものだと思っているので、自分の子供を同じようには育てないと言います。",
  "data/reddit-ask/r/NoStupidQuestions/comments/ozrq39/which_olympic_medal_has_been_won_by_the_most.json": "スポーツには、これでもか、これでもかというほどの数の国に支配されているものがあります。\n\nしかし、歴史的に見て、すべての競技の中で最も「自由度の高い」メダルは何でしょうか？\nオリンピックの全競技の中で、最も「自由」なメダルは？\n\n編集2：金メダル、1位という意味です。混乱を招いていたらすみません。\n\nを編集しました。\n\nまた、英語が下手で申し訳ありませんが、無視してください...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ozwy15/guys_dont_feel_anything_when_women_are_riding_them.json": "だから、私(22f)の好きな体位の一つは騎乗位です。しかし、数日前に私は\n同僚(m24)と話をしていたら、女性が騎乗位の時にただ前後左右に動くだけだと\n女性が騎乗位で前後左右に動くだけでは、男性は女性ほど感じないそうです。彼が言うには、インとアウトを繰り返す方がはるかに\nと言っていました。これは本当ですか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/ozpghm/why_are_black_americans_called_africanamerican_if.json": "私は白人で、おそらくアイルランドかどこかの出身ですが、ヨーロッパ系アメリカ人とは呼ばれていません。\nヨーロッパ系アメリカ人とは呼ばれていません・・・。",
  "data/reddit-ask/r/NoStupidQuestions/comments/ozrk1u/do_you_always_wash_your_hands_after_pooping.json": "その場合、実際にどのくらい洗浄しているのか、また常に石鹸を使用しているのか。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ozvzye/do_any_other_men_sit_when_they_pee.json": "多分、私がアメリカ人で、変な社会的基準があるからだと思います。\nそれに従わない人はたいてい笑われます）。) 私が話した男性のほとんどは\n立っておしっこをすると言いますし、その話をするときはとても男らしい言い方をします。\nとても男性的な方法で話します。\n\n私はいつも座っておしっこをしていますが...。",
  "data/reddit-ask/r/Ask_Politics/comments/ozjxns/why_are_countries_allowed_to_settle_disputes_by.json": "なぜ、国同士は殺し合うことで紛争を解決することが許されるのに、個人同士は殺し合うことで紛争を解決することが許されないのでしょうか。\n個人が殺し合って紛争を解決することは許されないのでしょうか？\n\n私はこれまで、国同士が宣戦布告することは当然のことだと思っていました。\nと思っていました。\n\nしかし、これは二重基準のように思えます。\n\n明らかに、殺すことは...",
  "data/reddit-ask/r/askscience/comments/ozvvwd/what_caused_20th_centurys_polio_epidemics_as_the.json": "最近、ポリオの歴史について読み始めたのですが、私が読んだ資料には\n私が読んだ資料では、20世紀以前にはポリオは流行していなかったと書かれていました。誰か、その理由を教えてください。\nなぜそうなったのか、どなたか教えてください。よろしくお願いします。",
  "data/reddit-ask/r/askscience/comments/ozzzda/whats_the_reason_jupiter_and_neptune_are.json": "どちらも水素80％、ヘリウム20％が主成分だとすると、なぜ木星は茶色で海王星は青いのでしょうか？\n海王星は青いのか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/ozwcl7/why_do_people_think_graveyard_shift_is_horrible.json": "ここ7、8年はずっと墓場仕事をしています。シフト開始時間は\n午後9時から午前2時までのシフトです。それはとても素晴らしいことです。仕事場への行き帰りの交通手段がありません。\n仕事ができます。一般的にはボーナスが支払われる。一日中、アクティビティやアポイントメントに使える。\n予定を入れることができます。\n\n私は、なぜ人々がそれを恐ろしい、魂のようなものだと思うのか分かりません。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ozrwzb/how_to_meet_new_people_and_form_deep.json": "私は現在、東欧系外国人としてスウェーデンに住んでいます。私が働いているのは\n私は技術系の仕事をしていますが、仕事に対してかなり野心的だと言えます。\n過去4年間、仕事に11時間以上を費やしてきました。その理由は\nその理由は、技術が好きだからというのもありますが、それだけではなく、仕事をしてみたいという気持ちもあります。",
  "data/reddit-ask/r/AskWomen/comments/ozzdmf/to_the_ones_who_genuinely_believe_that_its.json": "この時点で、私はより良い未来への楽観的な見通しを失っていました。\nまだ希望を持っている人の考えを聞きたいです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ozz4wz/people_living_with_stds_how_do_you_meet_potential.json": "不治の病と診断された性病患者で、現在は一緒にいない人。\nくれた人と一緒にいない人。新しい出会いを求めるとき、あなたはどうしますか？あなたは\nそれとも、後になってから何気なく話すのでしょうか？\nそれとも後になってからさりげなく話題にしますか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p062wj/what_do_i_tell_my_relatives_when_they_try_to.json": "私と妻は、初めての家を購入するための手続き中です それに伴って、私たちには\n私たちが引っ越すときには、多くの家族が訪れたいと考えています。私の計画は\n最終的には、空き部屋の一つに、念願のセックスダンジョンを作るつもりです。\nそこで問題になるのが... 彼らはいつ...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p05mh3/why_are_there_so_many_sex_related_questions_on.json": "これは少しメタ的な話かもしれませんが、ここ数年、ここから私の一般的なフィードへの投稿のほぼ8/10が\nここから私の一般的なフィードに送られてくる記事のほぼ8/10は、すべてセックスに関することです。\n\n私はそのことに特に問題を感じていません。\n疑問に思っていたからです。....",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p01aea/why_do_feminists_support_sex_workers_of_various.json": "セックスワーカーとは、ポルノスター、カムガール、オンリーファン、自発的な売春婦（それらが存在する場合）を意味します。\nが存在します）。) もし私が性奴隷や人身売買について知りたいと思っていたら、そのことについて質問していたでしょう。\n尋ねたでしょう。これは、オランダのような状況についての質問です。\nアムステルダムの赤線地帯や、プロの...",
  "data/reddit-ask/r/NoStupidQuestions/comments/p0730m/why_are_lesbian_bars_rare_but_gay_bars_common.json": "最近、デートアプリ(Hinge)を使っていたら、レズビアンバーに寄付する特集をやっていました。\nレズビアンバーに寄付していました。全米で21軒しか残っていないそうです。\nアメリカ全体で21軒しかないと言っていました。対照的に、僕の街（SF）にはおそらく20以上のゲイバーがあります。私がイリノイ州の田舎町に住んでいた頃は\n15年前にイリノイ州の田舎町に住んでいたときは、そこにもゲイバーがありました。",
  "data/reddit-ask/r/AskWomen/comments/p0brry/what_are_some_of_the_things_worth_splurging_on.json": "例：靴",
  "data/reddit-ask/r/askscience/comments/p0cwsx/why_isnt_geothermal_energy_not_widely_used.json": "原子炉と同じことができ、基本的には無料で、より多くのエネルギーの可能性を持っています。\nより多くのエネルギーポテンシャルを持っているのに、なぜこれほどまでに利用されていないのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/p07dd6/why_do_people_talk_about_terraforming_mars_venus.json": "他の惑星で可能なことは、地球でも可能であるような気がします。もし\n地球がダメなら、他の惑星のテラフォーミングも期待できません。どのように\n不毛の岩や蒸し暑い地獄絵図のような惑星が、実際の地球よりも暑くても住みやすい環境を作るのは簡単なのでしょうか？\n実際の地球よりも暑くて住みやすい惑星とは？",
  "data/reddit-ask/r/askphilosophy/comments/p07j4k/is_math_real.json": "誰か、数学が「本物」かどうかについて話してみませんか？これは私の\n哲学の中でも最も好きなテーマの一つですが、他の人と話す機会はほとんどありません。\n話す機会はほとんどありません。私は決して専門家ではありません。",
  "data/reddit-ask/r/AskHistorians/comments/p0eutz/in_avatar_firelordking_zuko_lived_as_a.json": "彼らが農民や平民として過ごしたとしたら、その経験は彼らや彼らの支配にどのような影響を与えたのだろうか。\nその経験は、彼らや彼らの統治にどのような影響を与えたのでしょうか？\n\n階級制度を利用して出世した人や非嫡出子ではなく、生まれながらにして\n階級制度を利用して出世した人や非嫡出子のことではなく、世襲で生まれた人のことです。\n\n同様に、別の場所に追放された人...",
  "data/reddit-ask/r/AskWomen/comments/p0f118/ladies_what_are_the_habits_that_make_your_life.json": "(upd - たくさんの素晴らしい習慣を借りることができました！)",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p0ibjx/how_do_i_tell_a_guy_ive_only_ever_had_sex_once.json": "10年ほど前から気になっていた男性と交際することになりました。\n10年ほど前から気になっていた男性と交際を始めようとしているのですが、どうしても避けられない会話に悩んでいます。\n一度だけ挿入されたことがありますが、それはセックスではなく、酔って暴行されたようなものでした。\n酔っぱらって暴行したようなものだった。\n\n私はセックスのことを考えても何も起こらないのですが...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p0hwpr/if_a_boy_accidentally_pushes_his_sister_down_a.json": "今、大森というゲームでこの現象が起きています。お願い\n警察を呼ばないでください。",
  "data/reddit-ask/r/AskHistorians/comments/p0cb4f/how_accurate_are_famous_historical_podcasts_and.json": "歴史の素人である私は、学術的な書籍や雑誌を手に入れることができません。\nオンラインでの支払いができない国の出身なので、学術書や雑誌にアクセスできません。\nなくても大丈夫です）。)\n\nしかし、私はできるだけ自由に利用できる幅広い資料を使って歴史を学ぼうとしています。\n可能な限り自由に利用できる幅広い資料で歴史を学ぼうとしています。私が見つけたニッチな3つのポッドキャストといくつかの...",
  "data/reddit-ask/r/AskHistorians/comments/p0jklw/in_1872_victoria_woodhull_and_her_sister_tennie.json": "タイトル通りですが、大まかに言うと、レイプされた後に10代の若者がどんな選択肢を持っていたかに興味があります。\n白人で労働者階級から中産階級と仮定して）レイプされた後にどのような選択肢があったかに興味があります。このレイプの状況には\nこのレイプの状況について何か特別なことがあって、彼らは売春をする運命にあったのでしょうか？\n売春を余儀なくされたのか？家族のもとに帰ることはできたのでしょうか？\n\n私は...",
  "data/reddit-ask/r/TrueAskReddit/comments/p09xax/why_are_the_comments_in_youtube_and_facebook_so.json": "私は母にワクチンを受けるように説得しているのですが、なぜか母は\n母はなぜかワクチンを受けたくない理由を説明しません。私は、youtube/googleで\n\"reasons why people don't want the vaccine\" or \"medical opinion on vaccine\" and\n膨大な数のアンチワクチンのコメントを読みました。",
  "data/reddit-ask/r/AskHistorians/comments/p0lxz7/i_am_soviet_party_elite_in_the_1980s_with_first.json": "いつも読んでいるのですが、レイト・コムにはどこにでもあるようなセリフの理由の一つは\n晩年の共産主義体制に伴う回線の偏在の理由のひとつは、国内で生産されたものが\n国内で生産されたものは、アクセスの良い人に先に行き、店頭には並ばなかったからだと読んだことがあります。\n\nしかし、もしあなたがそのようなエリートであったならば、一般の人々が手にする果物や野菜を手に入れることができたでしょうか？\n一般の...",
  "data/reddit-ask/r/askscience/comments/p0mtm1/will_a_second_covid_infection_necessarily_be.json": "軽い病気で感染し、回復し、さらに6ヶ月が経過した場合（抗生物質がなくなる\nその後、再び感染した場合、免疫システムはやはり\n必ずしも反応が良くなる（軽症/さらに軽度の病気になる）のでしょうか？もし、2回目の感染が\nもし2回目の感染が新しい（より危険な）変種だったら？",
  "data/reddit-ask/r/NoStupidQuestions/comments/p0ngou/anyone_else_ever_have_a_feeling_of_regret.json": "私はいつもこの感覚を持っています。例えば、何週間も前から買おうと思っていた新しい時計などを買うときは\n何週間も前から買おうと思っていて、長所や短所、他の選択肢を調べていたのに\nしていたのに、いざ注文するとなると、かなり極端な気持ちになってしまう。\n非常に後悔し、しばしばキャンセルしたいと思うほどです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p0lnh0/why_do_so_many_people_choose_expensive_fertility.json": "みなさん、こんにちは。最近、このことが気になっていたので、ここで聞いてみようと思いました。\n\n体外受精（IVF）は、女性が体外受精（IVF）を行う際に選択する、高価で、長く、複雑な治療プロセスです。\n体外受精は、自然妊娠ができないときに女性が選択する高価で長く複雑な治療法です。なぜ彼女たちは\n世界中には何百万人もの子供がいるのに、なぜそんなことをしなければならないのでしょうか...",
  "data/reddit-ask/r/NoStupidQuestions/comments/p0s8z5/why_does_my_girlfriends_dad_keep_disrespecting_me.json": "まず、私は17歳です。彼女と付き合ってもうすぐ1年になります。彼女の父親の家に行くたびに\nるたびに、少なくとも3つのジョークを言われます。\n俺のことを女々しいと言ってくる。ある夜、それが連発されて、本当に腹が立ちました。\nイライラした。\n\n例えば、僕の彼女が2階に上がって...",
  "data/reddit-ask/r/AskHistorians/comments/p0e7u1/during_the_american_revolution_to_what_extent.json": "独立宣言に署名した人物のほとんどが、裕福な土地所有者や商人、弁護士であったことは、非常に注目に値します。\nはかなり裕福で、裕福な土地所有者、商人、弁護士である傾向がありました。\n彼らは裕福な地主、商人、弁護士、またはその3つの組み合わせである傾向がありました。また、「専制的な法律」のほとんどが\n革命の原因となった「専制的な法律」（砂糖法、...",
  "data/reddit-ask/r/AskWomen/comments/p09if8/whats_a_movie_that_absolutely_broke_your_heart.json": "泣きたい気分なんだけど、何かオススメある？\n\n編集部：たくさんのお勧め映画に圧倒され、とても感謝しています。\n私の一週間は、皆さんのお勧めの映画を見るために、今から予約でいっぱいです🥺。ありがとうございます\n🙏🏻",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p0sd0t/how_the_fuck_am_i_supposed_to_be_happy_when_the.json": "私は17歳ですが、2050年までに世界が滅びることを説明する記事を見ました。\nなぜ誰もこのことを十分に認識していないのか、このようなことが起こると知ってどうやって幸せになればいいのか\nこのようなことが起こるのを知って、どうやって幸せになればいいのでしょうか？私には大切な家族がいて、素晴らしい人生を送ってほしいと思っています。\n素晴らしい人生を送りたいと思っています。そうでない人はいるのでしょうか...。",
  "data/reddit-ask/r/askphilosophy/comments/p0i4zn/is_academia_necessary_to_produce_useful_philosophy.json": "こんにちは、私は哲学の分野でキャリアを追求することについてアドバイスを求めています。私はそれほど\n私は、お金のことよりも、質の高い哲学的議論を研究し、議論し、書くことに関心があります。\n哲学的な議論をすることです。これまでの標準的な道はアカデミックなシステムでしたが\n私は教育でつらい経験をしており、完全には信じていないか...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p0sp07/birth_control.json": "さて、私は18歳を目前に控えた17歳の女性ですが、いろいろ考えた結果\n避妊することに決めました。\n私にはボーイフレンドがいて、私と彼は最終的にセックスをしたいと思っているのですが、私と彼はコンドームを使うつもりです。\n望まない妊娠をする可能性を減らしたいので、コンドームを使用するつもりです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p0skb8/why_do_conservative_positions_on_average_tend_to.json": "私が会ったり、話を聞いたりした保守派の多くは、ワクチン接種反対（一般的なもので、必ずしもワクチンが必要というわけではありません。\n反ワクチン（一般的なもので、コビドワクチンとは限りません）、反マスク、気候変動を信じない。\nなどなど。これらの立場はすべて、実際の科学的事実に関連しています。\n科学的な研究では、予防接種やマスクは一貫して...",
  "data/reddit-ask/r/AskHistorians/comments/p0p3gh/how_far_west_was_the_us_revolutionary_war_fought.json": "独立戦争の舞台となったのは、ご存知のように13のオリジナルコロニーです。\nしかし、この13の植民地は、1770年代にはアメリカ大陸のかなり奥の方まで広がっていました。\nこの地図が示すように、1770年代にはアメリカ大陸のかなり奥まで広がっていました。\nhttps://www.history.com/topics/colonial-america/thirteen-colonies\n\nそこで質問ですが、アメリカ大陸のどのあたりまで...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p0v33o/does_anyone_actually_like_dicks_orand_vaginas.json": "私はエースでも何でもなく、他の人と同じようにムラムラしていますが、それらの実際の\n体のパーツはちょっと苦手です。私はトップでもボトムでもオーラルでも何でも構いません。\n私は彼または彼女が楽しい時間を過ごすのを手伝いたいだけなので、どちらかでトップ、ボトム、オーラル、または何でも構いません。しかし、決して\nどちらの体の部位でも、「くそ、これは...」と思うことはありません。",
  "data/reddit-ask/r/AskHistorians/comments/p0yd5v/why_did_the_french_nobles_listen_to_the_advice_of.json": "これは単なる偶然だったのだろうか。どのみち、その頃にはフランスは領土を取り返し始めていただろう。\nどのみち、その時期にはフランスは領土を取り返し始めていたのではないか？ジョアンには戦術の予備知識があったのか？",
  "data/reddit-ask/r/askscience/comments/p0fpzp/how_much_if_at_all_have_covid_vaccines_been.json": "この質問は、一般に公開されているワクチンに当てはまります。私たちはまだ\nバージョン1.0のままですか？より多くの種類が研究され、処方は改善されましたか？はたして\n緊急リリースのガイドラインに沿ってリリースされたことを考えると、1.0にさえなっていないのでは？\n緊急リリースのガイドラインに基づいてリリースされたことを考えると、1.0にさえなっていないのでしょうか？\n\nアメリカでは、ファイザーや...という話しか聞きません。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p0i72m/why_is_there_so_much_information_about_losing.json": "私はBMIが16.5で、健康でコンディションも悪くありません。私は今も昔も、身長は上位1％、体重は下位1％の\n身長は上位1％、体重は下位1％です。積極的に体重を増やそうと何年も努力してきましたが\n成功していません。",
  "data/reddit-ask/r/askscience/comments/p0wo6v/does_airconditioning_spread_covid.json": "私はインドに住んでいますが、最近、私の州ではジムがオープンしました。\nその制限とは、「ジムは50％の能力で運営し、午後4時には閉鎖し、エアコンなしで機能しなければならない」というものです。\nジムは定員の50％で運営すること、午後4時には閉鎖すること、エアコンなしで機能すること」です。\n\n最初の2つは問題ありませんが、エアコンなしでトレーニングするのは...。",
  "data/reddit-ask/r/askscience/comments/p12bhm/why_is_dengue_fever_more_likely_to_be_lethal_the.json": "この病気は、複数の感染者がいると、反応が悪くなると聞いたことがあります。\n良くなるどころか、悪くなると聞いたことがあります。これは、私が知らない他の多くの病気でも、実際には普通のことなのでしょうか？\n私が知らないだけなのでしょうか？それともデング熱は何か特別なのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p156a5/do_prisoners_masturbate_in_prisonjailsolitary.json": "ちょっとした質問ですが",
  "data/reddit-ask/r/NoStupidQuestions/comments/p12trd/can_you_blow_your_horn_at_a_cop.json": "先日、赤信号で警官の後ろにいました。信号が青になっても、その警官は\n警官は行かなかった。私はクラクションを鳴らそうと思いました。\nヘイ、バディ、イッツ・グリーン、ジャスト・メーキング・ユー・ソーイット、ロード・レイジではなくてね。\nでも、警官に嫌がらせをするのは心配だった。それで、クラクションを鳴らすことができるのは...",
  "data/reddit-ask/r/askscience/comments/p0nbvs/how_does_the_immune_system_defend_from_airborne.json": "私の理解が正しければ COVID-19は、気道に存在するACE2受容体に結合します。\n気道にあるACE2受容体に付着します。\n\nそのため、感染を引き起こすために血流を経由する必要はありません。\nそして、細胞に感染すると、その細胞がサイトカインを放出するのを抑制するタンパク質を放出します。\nその細胞がサイトカインを放出するのを抑制するタンパク質を放出します...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p0z38d/do_people_mostly_men_actually_go_beat_their_meat.json": "ウォール街の狼」のシーンを見たことがあると思いますが、こんなことが実際に起こっているんですね。\n実際に起こっています。私が以前働いていた職場には、ストレスがたまるとトイレで豆をはじいてしまうと公言する女性がいました。\nストレスが溜まるとトイレで豆まきをすると公言していました。私は何かを見逃しているのでしょうか？\n何か見逃していませんか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/p17mxm/why_isnt_an_addiction_to_amassing_huge_amounts_of.json": "買いだめや他の依存性の傾向と同じように見られない実際の理由はありますか？\nのように見られていないのでしょうか？つまり、他の多くの依存症と同じように、ダメージを与え、強迫観念に駆られ、すべてを捧げるように見えるのです。\n他の多くの依存症と同じように有害で、強迫観念的で、すべてを飲み込んでいるように思えますが、なぜこの一つの依存症が良いことのように喧伝されるのでしょうか？\nなぜ、この中毒だけが良いことのように言われるのでしょうか？",
  "data/reddit-ask/r/TrueAskReddit/comments/p15f3q/why_dont_the_olympics_maintain_a_single_venue_for.json": "たった一度の一ヶ月間のイベントのために、スタジアムなどを建設するためには、大量の資源が必要となります。\nたった1ヶ月のイベントのために、スタジアムなどの建造物を建設するためには、大量の資源が必要です。今年の東京オリンピックでも\n今年の東京オリンピックでも、インドネシアの熱帯雨林で森林破壊を引き起こす木材を使用したことで\n今年の東京オリンピックでも、インドネシアの熱帯雨林の森林破壊を引き起こし、オランウータンの生態系に影響を与える木材を使用したことで、反発を受けました。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p0ypz9/is_it_bad_if_my_balls_hang_a_little_lower_than_my.json": "参考までにディックは約4インチ、僕のディックは軽視されていないので変には見えないと思います。\nしかし、考えてみると面白いですね。僕は肌がきれいで\n私は肌がきれいで、顔色もいいので、老けて見えたり、しわになったりしません。\nしかし、それがどのように受け取られるか心配です。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p17y8t/ever_since_biden_got_elected_it_seems_like_news.json": "オバマ大統領とトランプ大統領の任期中は、彼らがニュースを独占していたのを覚えています。すべての\n主要な記事には必ず彼らのことが書かれていました。実際、今でもGoogleで「政治」を検索すると\nバイデンよりもトランプの方が多くの記事を見つけることができるでしょう。\nOUR PRESIDENT. なぜ彼が注目されないのか、私には不思議に思えてなりません。",
  "data/reddit-ask/r/AskWomen/comments/p14das/what_made_your_thirties_way_better_than_your.json": "その理由は？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p1a5k4/are_you_supposed_to_be_turned_on_when_you_go_to_a.json": "例えば、あなたがストレートの男性で、目の前で裸の女性が踊っていたら\n勃起してしまうのでしょうか？勃起しても何もできませんよね。\n勃起してもどうしようもないから、そういう公共の場で勃起するのは変な感じだけど、もしストリッパーに興奮しなかったら\nストリッパーに興奮しないのであれば、何の意味があるのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/p1b3ef/we_imagine_huntergatherer_life_as_unchanging_for.json": "狩猟採集民」という言葉は、一般的な意識の中に、人々が持っている一般的な考え方よりも、学術的にはあまり良くないイメージを喚起する。\n狩猟採集民」という言葉は、一般の人々の意識の中に\n恒星間旅行についての一般的な考えよりも、学術的な情報に基づいていないイメージを一般意識に喚起する。センチネルをはじめとする様々な未接触民族は、しばしば「石器時代の名残」と呼ばれます。\nセンチネルをはじめとする様々な未接触民族は、しばしば「石器時代の名残」と呼ばれ、それは「狩猟採集」を意味している。",
  "data/reddit-ask/r/AskHistorians/comments/p0w6gb/during_the_hundred_years_war_did_the_english.json": "エドワード3世の場合は、ヘンリー5世の場合とは異なる答えになったでしょう。\nヘンリー5世？",
  "data/reddit-ask/r/AskHistorians/comments/p1c9i5/was_racism_a_problem_within_pirate_crews.json": "様々なドキュメンタリーやフィクションの中で、海賊は\n海賊は当時としてはかなり平等主義的で、白人だけでなく黒人の乗組員も雇っていた。\n白人だけでなく、黒人の乗組員も雇っていた。しかし、人種差別的で奴隷を所有し、奴隷貿易を行っていた社会の出身である白人は、本当に平等主義的だったのでしょうか？\nしかし、人種差別的で奴隷を所有し、奴隷貿易を行っていた社会から来た白人は、果たして黒人の船員を...",
  "data/reddit-ask/r/askscience/comments/p1dag9/in_moviestv_they_say_there_are_always_a.json": "今、「ザ・ラストシップ」を見ているのですが（笑）、「イミューン」の話をしているときに、「イミューン」の話をしていないことに気づきました。\nCOVID-19に対して自然に免疫を持つ人がいるという話は聞いていません。\nCOVID-19に対して自然に免疫を持つ人がいるという話は聞いていませんが、なぜでしょう？",
  "data/reddit-ask/r/AskHistorians/comments/p1jb6b/why_is_sweet_tea_so_prevalent_in_the_american.json": "北部出身の私は、10代の頃に南部に移住しました。\n\n北部の人はスイートティーをうまく作れないんです。\nたり、無糖で冷やして出したり、溶けない砂糖パックを使ったり(笑)、または\n長く置いておくと腐ってしまうんですよね。\n\nなぜスイートティーは南部の文化なのでしょうか？\n\n私は...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p1e3mf/when_do_people_start_wanting_sex.json": "私は16歳の女の子です。性欲は完全に正常で、過去に健康上の問題がありましたが、現在はホルモン上の問題はありません。\n過去に健康上の問題がありましたが、現在はホルモン上の問題はありません。ただ、私には\nセックスに魅力を感じません。\n\n私が何かを感じたのは、片思いしていた人とキスをしたときです。\nキスしても何も感じなかったので、何かおかしいと思ったんだと思います。\n\n私には...",
  "data/reddit-ask/r/AskHistorians/comments/p1eo39/native_americans_and_severe_storms.json": "だから、北アメリカ、特にアメリカが最も厳しい天候に見舞われているというのがTIL。\n年間で1万個以上の激しい嵐と1000個以上の竜巻が発生しています。また\n北部ではブリザード、南部ではハリケーンが発生しています。\n\nネイティブアメリカンはこれらの嵐にどのように対処したのでしょうか？彼らは、嵐の発生しやすい地域から移動したのでしょうか？\n避難したのでしょうか？",
  "data/reddit-ask/r/askscience/comments/p1fb1g/why_do_we_get_sore_throats.json": "喉の痛みの原因（ウイルスや細菌の感染など）は知っています。\nこの質問をネットでしようとすると、そのような答えしか出てきません。\n私が知りたいのは、その理由です。私たちは粘液を緩めようとして咳をします。\n咳をするのは粘液を緩めようとするためであり、熱を出すのは体や免疫系がより機能するようにするためです...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p1jvg4/why_is_it_easier_to_alter_our_sleep_cycles_to.json": "他の情報は不要だと思います。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p1l73d/how_many_of_yall_would_be_able_to_live_in_a.json": "シナリオ あなたはすでに結婚していますが、数ヶ月後にパートナーが自分は\n性だと言い出しました。あなたは離婚を申請しますか、それとも結婚生活を続けますか？\n\n二人とも20代後半から30代前半だと仮定します。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p1nb35/do_astronauts_at_the_iss_masturbate.json": "つまり、もし私がほとんどすべての人類から取り残され、妻や夫からも離れてしまったとしたら\n妻や夫から離れて、ほぼすべての人類から取り残されるとしたら、最終的には自己満足に頼ることになるだろう。宇宙飛行士はどうやって\nどうやって自慰をしているのでしょうか？洗面所でできるかもしれませんが、私が読んだところでは\nしかし、私が読んだところによると、宇宙での糞や小便はすべて...に変えられるそうです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p1ev7x/when_i_was_a_kid_i_always_remember_frozen_pizzas.json": "私のことを馬鹿だと言っても構いません。正直に言うと、私は今、かなり疲れています。",
  "data/reddit-ask/r/askscience/comments/p194gq/what_happens_mechanically_when_i_activate_ecomode.json": "スポーツモードにすると「サスペンションが硬くなる」と聞いたことがありますが、それは単にショックが硬くなるということでしょうか？\nショックがより圧縮されるとか、そういうことなのでしょうか？お返事をお待ちしております。",
  "data/reddit-ask/r/askscience/comments/p1fyhb/is_there_any_actual_evidence_to_support_the_idea.json": "私は数え切れないほどの人から、足フェチは、自分の足に性的行動や興奮を記録する脳の部分が近いことが「原因」だと繰り返し聞いてきました。\n足フェチは、性的行動や興奮を記録する脳の部分と、足を記録する脳の部分が近いことが「原因」だと、数え切れないほどの人が言っています。\n足フェチと脳」でググると、ほとんどすべての結果がこのようなポップサイエンス的な説明になっています。\nそして、「フットフェティッシュと脳」をグーグルで検索すると、ほとんどすべての結果がこれに関するポップサイエンスタイプの説明です。それは...",
  "data/reddit-ask/r/AskHistorians/comments/p1owx8/i_am_peter_samsonov_author_of_sherman_tanks_of.json": "こんにちは、r/AskHistorians [/r/AskHistorians]! おそらく、私がいくつかの戦車関連の質問に答えているのを見たことがあると思います。\n戦車に関する質問に答えているのを見たことがあると思います。私は主にソ連の鎧について書いていますが\n私は主にソ連の装甲について書いていますが、私の気を引いた答えはレンドリース戦車に関するものでした。I\n本が一冊書けるくらいだと言っていたので...。",
  "data/reddit-ask/r/AskWomen/comments/p19hcx/women_with_depression_what_are_some_alternatives.json": "処方された薬に影響を与えないように、また、他の人と一緒にいるときにリラックスできるように。\n他の人と一緒にいるときにもリラックスできます。",
  "data/reddit-ask/r/askscience/comments/p1r695/why_did_we_go_from_a_delta_variant_of_covid.json": "この記事によると\n[https://www.cnn.com/2021/08/07/health/lambda-coronavirus-variant-wellness-explainer/index.html]\n現在、COVIDのラムダ型が存在し、主に南米の人々に影響を与えています。\nに影響を与えています。\n\nこれはもちろん、デルタバリアントの流行の真っ只中にあります。\nこの記事によると...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p1mnhv/is_it_weird_for_a_girl_to_only_watch_gay_porn.json": "私は物心ついたときからゲイ・ポルノを見ていました。思うに、私が見ているのは\nストレート・ポルノに出てくる女の子がいかに迷惑か、そして彼女たちがどのように扱われるかが嫌いだからです。\n扱われるのが嫌だからです。また、レズビアン・ポルノはあまりにも偽物っぽい。友達にその話をしたら、みんなショックを受けていました。\nみんなショックを受けていました。このようなことをしている人はいますか？",
  "data/reddit-ask/r/AskWomen/comments/p1olxv/what_are_your_thoughts_on_dating_a_friends_ex.json": "ティーンエイジャーの頃は、元カレには手を出さないのが女の子の掟。しかし、大人になるとどうでしょう？この暗黙のルールは\nこの暗黙のルールのせいで、運命の人を見つけることができないのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/p1nl3h/why_cant_we_increase_the_lifespan_of_animals_with.json": "ほとんどの犬や猫が10年以上（せいぜい2年）も飼い主と一緒にいられず、他のペットは5年以下しか生きられないというのは悲しいことだと思います。\n10年以上（せいぜい2年）、中には5年未満のペットもいます。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p1onn9/is_it_homophobic_if_a_straight_person_is.json": "私は非常に保守的で宗教的な国に住んでいますが、私はクローゼットの中のバイです。私の\nストレートの妹は、ゲイカップルがキスなどの愛情表現をしているのを見ると、いつも「えーっ」と言っています。\n私のストレートの妹は、ゲイカップルがキスなどの愛情表現をしているのを見ると、いつも「えっ」と言っています。私はいつもNetflixでシリーズや映画を繰り返し見ています。\n主にリビングルームで見ています。それは...",
  "data/reddit-ask/r/AskHistorians/comments/p1t4d6/did_japanese_ww2_soldiers_suffer_from_the.json": "南京のレイプや731部隊のような事件で 兵士や科学者の中には\nホロコーストが始まる前にドイツ兵が大量殺戮を行った後に受けたような心理的影響を受けた兵士や科学者はいましたか？\nホロコーストが始まる前に、ドイツ兵が大量殺人を犯した後に受けたような心理的影響を受けた兵士や科学者はいたでしょうか。高い確率で\nアルコール依存症、自殺、うつ病などの割合が高かったのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/p1wgh8/whats_the_deal_with_the_junglethemed_funerals_for.json": "モンテフィオーレは何度か言及していますが、その伝統がどこから来ているのか説明していないように思います。\nその伝統がどこから来ているのかは説明していなかったと思います。最近、「ステイト・フューネラル」を見たのですが、ヤシの木が\nスターリンの棺の周りには椰子の木が非常に目立っていました。\n\nこれはとても奇妙で、エキゾチックで、外国のようで、どこか不謹慎な感じさえするのですが...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p1tozv/why_has_tooafraidtoask_devolved_into_sexually.json": "このサブレディットは、毎日のように以下のようなバカげた質問で占められています。\n\n * \"Do astronauts at ISS masturbate?\"\n * \"Do prisoners masturbate?\"\n * \"女の子がゲイポルノを見るのは変ですか？\"\n * \"なぜ私はレイプされたいのか？\"\n\n残念なことに、これらの質問はsubreddit全体を支配しており、...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p1m2uh/where_does_the_gay_accent_come_from.json": "誰かを怒らせるつもりはありませんが、純粋に興味があって、例えば、ゲイの人たちはそういう風に話すことを選んでいるのか、それとも自然なことなのか。\n選んでいるのか、それとも自然にそうなっているのか。カミングアウトした時だけそういう話し方をするようですが\nカミングアウトした時にだけそういう話をするようですが、クローゼットの中にいる人たちはそういう話をしません。\n自然なことだとしたら、彼らはそれを抑制するのでしょうか？\n\n(もしそれが自然なことであれば、彼らはそれを抑制するのでしょうか？",
  "data/reddit-ask/r/askphilosophy/comments/p1jdb7/is_there_an_ethical_argument_for_meat_consumption.json": "そして政治へ\n\n主にThe Veganosphere/Vegetarianosphereです。\n\nこの話題を扱うとき、動物製品の消費に関する最も一般的な問題は\n消費に関する最も一般的な問題は、動物の屠殺にまつわる倫理観です。\n\nヴィーガニズムの感覚論は、おおよそ、植物は十分に感覚を持っていないというものです。\nとしています。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p1hpvv/soooooo_im_in_a_bit_of_a_pickle_and_im_now.json": "update : 現在、Urgent Careセンターで診察を待っています。血の状態が悪くなってきたので\n血の状態が悪くなってきたので、やっと来ました。\n\nupdate 2 : 胃腸炎の可能性が高く、オンダンセトロン（ゾフラン）を処方された。\n直腸検査（最初に行きたくなかった理由）で血が出た。血が出た。\nGIに診てもらうように紹介状を書いてもらいました。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p1q3yw/why_is_it_no_big_deal_for_women_to_wear_mens.json": "慣れていないだけなのでしょうか。一般的な男性と同じような服装をする女性を知っています。\n普通の男性と同じような服装をしている女性を知っていますし、普通のスーツを着ている人もいます。しかし、もし男性が同じようにして\n変な人だと思われるかもしれません。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p220nb/im_a_guy_and_im_going_to_lose_my_virginity_soon.json": "投稿ルールに合わない投稿は削除しますのでご連絡ください。\n削除します。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p1vi23/do_straight_women_pleasure_themselves_to_gay_porn.json": "ストレートの男性がレズビアン・ポルノを見るのは知っているし、これは馬鹿げた質問かもしれないが\nでも、知っておく必要があると思います。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p24l7e/whats_the_acceptable_mature_reaction_to.json": "\"This guy smacks your girl's ass, wyd? \"というミームを見たことがあります。\n\n真面目な話、このような状況であなたはどうすればいいのでしょうか？明らかに、暴力は\n暴力は絶対にいけません。警察に連絡しますか？加害者と対決しますか？すぐに\nその場を離れて女性を慰める？",
  "data/reddit-ask/r/askscience/comments/p1sami/is_there_an_increase_in_the_average_iq_of_people.json": "鉛は脳の発達を妨げ、人間の動きを少し鈍くすることがわかっています。ある\n有鉛ガソリンは、何世代にもわたって人々のIQを低下させてきたと主張する人もいます。\n世代の人々のIQを下げたと主張する人もいます。有鉛ガソリンが世界的に禁止されてからしばらく経ちました。\n世界的に禁止されて久しいですね。\n\n世代間のIQに無視できない差はあるのだろうか。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p26znt/how_do_i_not_make_someones_vagina_sore_pls_read.json": "先日、ある女の子に指を入れていたのですが、彼女が「痛い」と言うまで、大体10分くらいしかやっていませんでした。\n彼女が痛くてやめたいと言うまで。私は優しくしていたので\n何か間違っているのでしょうか？私は何か間違ったことをしていたのでしょうか、それとも何かできることがあるのでしょうか？\n避けることができますか？私はセックスの経験が浅いので、申し訳ありません。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p220nb/removed_by_reddit.json": "[コンテンツポリシーに違反しているという理由でredditによって削除されました。\n[/help/contentpolicy]を参照してください。]",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p2c92p/what_is_the_first_few_things_you_say_to_your.json": "短時間でより多くの人に届けるには、upvoteをつけることをお勧めします。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p2fsvo/why_the_fuck_are_we_still_catering_to.json": "真面目な話、何？なぜ？なぜ私たちは、私たちが生きていかなければならない地球を破壊している人々を支援しているのでしょうか？\n私たちが生きていかなければならない地球を台無しにしている人たちを なぜ私たちは彼らに食事を提供し、彼らの車を運転するのでしょうか？\n車を運転したり、洗濯物を洗ったりするのか？私は幻想を抱いています。\n人間の苦しみと搾取によって得たものを手に入れたすべての金持ちが...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p29sos/what_does_one_do_when_they_find_out_their_family.json": "話せば長くなりますが、とても身近な家族が恐ろしい犯罪を犯したことが明らかになりました。\n恐ろしい罪を犯してしまったのです。(警察は認識しているが、家族は否定していない。\n正式な手続きが進んでいます）。)\n\n社会的な期待は、私たちが彼とのすべての接触を断ち切り、決して話さないようにすることだと思われます。\n話すことはない...",
  "data/reddit-ask/r/askscience/comments/p292wb/what_happen_when_an_infected_cell_replicate_itself.json": "こんにちは。\n\n私が知りたいのは、もしある細胞がウイルスに感染したり\n「例えば、ワクチンからのmRNAに感染したとします。もし、その細胞が\n複製されたらどうなりますか？新しい細胞には、ウイルスやmRNAが含まれているのでしょうか？\n\n私がこのことを考えているのは、運動をすると加速して...",
  "data/reddit-ask/r/AskWomen/comments/p2avcm/whats_the_most_genuinely_nice_thing_a_guy_did_for.json": "いい人がAホールで、いい人のふりをしているだけという話はよく聞きますが\nいい人のふりをしているだけです。また、女の子が利用されるという話も聞きます。しかし、私が知りたいのは\n見返りを期待せずに純粋に良いことをしている人の話は？\n見返りを期待せずに",
  "data/reddit-ask/r/askscience/comments/p2f4ht/what_is_gravitational_potential_always_negative.json": "なので、無限大の重力ポテンシャルが0になるのは、理解しています。\n重力場の強度が無限大で0になるからです。分からないのは\nなぜ物体が元の質量に近づいても重力ポテンシャルが大きくならないのか？\n源の質量 重力ポテンシャルのエネルギーは増加しますが、...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p2ioae/can_someone_explain_to_me_how_wanting_to_lose.json": "コンテキスト。私はこの2年間、減量の旅を続けてきました。\nこの2年間で体重を90ポンド落とし、久しぶりに200ポンドを切りました。感じています。\n気分は最高です。しかし、ツイッターで自分の進歩に口を出したことで、脂肪恐怖症と呼ばれるようになりました。\n私が太っているのが嫌いだとほのめかしているのではないかと。つまり...そう、私はちょっと...",
  "data/reddit-ask/r/askscience/comments/p2dmlw/ask_anything_wednesday_economics_political.json": "毎週恒例の「Ask Anything Wednesday」へようこそ！今週は\n今週は、経済学、政治学、言語学、人類学を中心にお届けします。\n\n今週は、経済学、政治学、言語学、人類学を取り上げます。\n投稿する価値があるかどうかわからない質問はありませんか？典型的な/r/AskScienceの投稿にはちょっと思慮が足りないものでしょうか？\nそんなことはありません。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p2ew06/in_general_do_people_really_care_about_std.json": "バーやクラブなどで見知らぬ人と会って、ベアバックセックスやフェラチオ、食事をしている人の話をネットで読みます。\n裸でセックスをしたり、フェラチオをしたり、外で食事をしたりしても、性病にかかる心配はないという話をネットで読みました。もちろん、私は\n勿論、ポルノや何かの話ではありません。でも、出会い系アプリや知り合いで知り合った人でも\n出会い系アプリで知り合った人や、ただの知人・友人でも、話し始めると",
  "data/reddit-ask/r/AskHistorians/comments/p2m4jz/is_it_true_that_american_puritans_didnt_actually.json": "どれだけのプロパガンダ（宗教的、あるいは反宗教的な観点から）があるのか、そして\nどの程度がプロパガンダで、どの程度が事実なのか。",
  "data/reddit-ask/r/askphilosophy/comments/p2ahx2/hi_i_am_an_assistant_to_a_political_philosophy.json": "皆さん、こんにちは。ご覧いただきありがとうございます。)\n\n最近、哲学の中で話題になっていることの一つに\nいわば「カノンの限界」、そして「カノンの向こう側を見るべきかどうか」ということです。\nその先を見るべきかどうかということです。哲学はあまりにも大きなテーマなので、どの大学でも選択をしなければなりません。\n哲学はあまりにも大きなテーマなので、すべての大学が選択しなければなりません...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p2bls1/why_dont_governmentsscientistscorporations_try_to.json": "つまり、彼らは都市全体を破壊する技術を持っていて、月に自国の旗を立てることができます。\nマリアナ海溝でスキューバダイビングをする技術を持っているのに、なぜか人間の基本的な欲求を満たす技術を作ったり完成させたりしていません。\n人間の基本的な欲求を満たす技術を作ったり、完成させたりしていません。\n\n不可能な技術というわけではありません。ある人は、RO水を使った浄水器で\n塩水を飲めるようになると言っていた人がいましたが...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p2ptzs/why_are_the_nsfw_subs_on_reddit_absolutely.json": "昔は普通の人が楽しんだり、自慢したりしていたんだけどね。今では全てのNSFW\nサブはほぼ100％onlyfansのコンテンツクリエーターです。控えめにしようとしているサブは一度も見たことがありません。\n控えめにしているところはありません。少なくとも成功はしていないでしょう。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p2rmi9/what_is_the_most_fup_thing_youve_ever_done_and.json": "それは、誰にも話したことのないような奇妙な話であったり、奇抜な話であったりします。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p2skct/whats_the_proper_response_to_getting_nudes.json": "何を言えばいいんだ？\n\nどうやら「Ayo this shits cash」ではダメらしい？\n\n編集：10分間の議論の後、彼女は私をブロックしました。クソ",
  "data/reddit-ask/r/AskHistorians/comments/p2oiku/what_recipesfoods_that_were_once_commonplace_are.json": "また、その方向に向かっているのに、人々が気づいていない現代の料理があるのではないでしょうか。\n気づいていないかもしれません。",
  "data/reddit-ask/r/askscience/comments/p2xigv/askscience_ama_series_i_am_dr_claire_mclintock_a.json": "私は、ニュージーランドのオークランドを拠点とする臨床検査技師のクレア・マクリントックです。\nニュージーランドのオークランドを拠点としています。ニュージーランドのオークランド市立病院のNational Women's Healthに勤務しています。\n私はニュージーランドのオークランド市立病院のNational Women's Healthに勤務しており、女性の血栓症や止血性疾患を中心に臨床と研究を行っています。\n女性の血栓症や止血障害を研究しています。私は以前、社長を務めたことがあります...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p2tj00/whats_so_bad_about_socialism_anyway.json": "私はもっと理解したいと思っているので、泥沼に引き込まないでください。私は\n率直に言って、資本主義は一部の人にしか通用しないようです。\n率直に言って、資本主義はこの国の一部の人々のためにしか機能していないようです。人々は「他人の請求書にお金を払いたくない」と言いますが、彼らはすでに払っているのです。\nと言いますが、彼らはすでに支払っているのです。それが生活保護であろうと、高い給料であろうと...。",
  "data/reddit-ask/r/AskHistorians/comments/p30fpv/poisoning_wells_was_a_common_practice_in_times_of.json": "ローマ人がペルシャに侵攻したときや、クルザス戦争など、ある種の紛争を読むと\nクルツァーデの戦いでは、敵に水を与えないために井戸に毒を入れたという話が多く出てきます。\nしかし、どのようにして行われたのか、どのような種類の毒を使ったのか、どのような方法で\nどのようにして行われたのか、どのような毒を使ったのか、このプロセスは元に戻せるのか、などについて詳しく説明している人はいません。\n\n想像するに...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p2xzdh/can_anyone_else_smell_when_a_woman_is_on_her.json": "女性の場合、少なくとも私の場合は、生理中は常に自分の血の匂いがするので\n生理中は 高校生の頃はそれが気になって仕方がありませんでした。\n\n久しぶりに気になってしまった。でも、今朝起きてみると\n匂いがしました。それでまた考えたんです。みんなはこの匂いを嗅ぐことができるだろうか？",
  "data/reddit-ask/r/askscience/comments/p2mkfy/how_much_of_the_population_is_affected_by_herpes.json": "(免責事項：この質問に対する書き込みsubredditであるかどうかはわかりませんが\nここが一番適切だと思いました。もし他に投稿できる場所があれば、遠慮なく\nお気軽に教えてください)\n\n私の質問はとても明確ですが、明確な答えを見つけるのに苦労しました。\n私は少し調べてみたのですが...",
  "data/reddit-ask/r/AskHistorians/comments/p2xybh/in_the_book_1984_orwell_describes_how_the_party.json": "私の理解では、オーウェルは『1984年』の多くの部分を当時のファシストや共産主義者の政権に基づいていると思います。\n当時のファシストや共産主義政権を題材にしていると理解していました。\n\nしかし、私の知る限り、ソ連の党員は普通の服装をしていました。\n兵士のような服装はあっても、機械工や工場労働者のような服装はありませんでした。\n\nしかし、毛沢東や金正恩は、実際に工場のような服装をしていました...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p2zgan/are_men_just_less_physically_desirable_than_women.json": "何と言っていいのかわかりませんが、私には生涯、次のような印象があります。\n男としての価値を求められるには、機能的な価値を持つことが必要です。\n道具箱の中の道具のように。\n\nただし、実際にはそれほど望ましいものではありません。というか、少なくとも私はそう感じています。\n女性のために多くの努力をしなければならないと感じています。",
  "data/reddit-ask/r/AskWomen/comments/p2ttl6/women_of_reddit_have_you_ever_said_no_to_your.json": "いつも仕事でNOと言うのに苦労していました。でも、一度言ってみると、解放感がありました。\n解放された気分になります。もっと頻繁に言う必要があります。",
  "data/reddit-ask/r/askscience/comments/p2zxi8/is_there_a_temperature_where_nuclei_themselves.json": "すべての化学化合物は、最終的に化学結合が破壊される温度があります。\nすべての化学物質は、最終的に化学結合が破壊されて、構成する原子やイオンに分離する温度があります。では、原子核が陽子に分解するような\n原子核が陽子と中性子に分解されるような、とんでもなく高い温度があるのでしょうか？\n中性子と陽子に分解するような、とんでもなく高い温度があるのでしょうか。また、それ以上の温度では...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p36yhq/do_pornstars_feel_wierd_that_a_lot_of_their.json": "16歳にして頻繁にポルノを見ている者としては、あまり考えたことがありませんでした。\n若い男の子がAVを見ていることを好きにならないで欲しいですね。\nと思ってしまいます。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p37j4u/my_sister_got_turned_down_for_a_job_because_she.json": "姉は、この仕事の最初の2回の面接を通過し、順調に進んでいるように見えました。\nたのですが、採用担当者が彼女のソーシャルメディアのアカウント名を尋ねてきました。\nソーシャルメディアのアカウント名を聞かれました。\n\n姉は丁寧に説明して、このようなことをされるのは気が引けると言いました。\n彼女のアカウントはすべてプライベートなものであり、友人でもあります...",
  "data/reddit-ask/r/askphilosophy/comments/p31xzi/arguing_for_the_existence_of_god_and_arguing_that.json": "15年前に大学で哲学の授業を1回受けただけですが、ご容赦ください。そして、私は\nここで何度も議論されていたら申し訳ないのですが、何も見つけられませんでした。\n\nいつも思うのですが、神の存在を主張している人は、たまたまその神の存在も主張しているような気がします。\nたまたま自分が信じている神の存在を主張しているだけのようです....",
  "data/reddit-ask/r/NoStupidQuestions/comments/p3eggr/why_do_people_say_sorry_for_formatting_im_on.json": "ジルはとても怒っている人です [http://imgur.com/gallery/bVoGYsD]\n\n何がきっかけだったのか [http://imgur.com/gallery/KqxDH0F]",
  "data/reddit-ask/r/AskWomen/comments/p3b7sx/whats_your_biggest_insecurity.json": "そして、それを受け入れようとしているのか、対処しようとしているのか。あるいは、それを愛していますか？\n\nもしそうなら、あなたの経験を教えてください。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p3bswx/how_do_i_wash_my_face_without_spilling_water_on.json": "皆さんはどのようにしていますか？今まで生きてきた中で、他の人がどうやって顔を洗うのか理解できませんでした。\n他の人は顔を洗ってもただ乾いているだけなのか、理解できませんでした。どうやって？どうやってすすぎをして、石鹸を使って\n洗い流して、石鹸を使って、再度洗い流して、その後は乾いているのか？どうしたら水が垂れてこないのか？私は水の量を減らそうとしました。\n水の量を少なくしようとしましたが、そうすると石けんが落とせません。",
  "data/reddit-ask/r/AskHistorians/comments/p3k8h5/im_a_twentysomething_in_east_germany_in_1978_and.json": "私の質問は、東ドイツにおける西洋メディアの普及についてです。\n公式に認められていないメディアを消費する市民に対して、国家は実際にどのような反応を示したのか、そしてこのことに関する現在の研究があるのかどうか。\nまた、これに関する最新の研究があれば教えてください。\n\nこの質問の入り口として、「スターウォーズ」を使っています。大人になって\n自分自身が...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p3itgy/do_you_support_human_euthanasia_if_they_have_a.json": "個人的には、末期の病気で安らかに逝きたいと思うなら安楽死を支持します。\n安らかに逝きたいと思うのであれば、安楽死を支持します。苦しんで家族に医療費や葬儀代の負担を強いるくらいなら、安らかに死にたいと思います。\n家族に医療費や葬儀代の負担を強いるくらいなら、安らかに死にたい。安楽死は一般化されるべきです。\nなぜなら、患者は外出する権利を持つべきだからです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p3k8ir/is_there_somewhere_i_can_buy_crystals_or.json": "ある水晶をネットで探そうとしているのですが、価格を吊り上げたり、ヒーリング・エネルギー・電磁波防止・電磁波の影響を謳っているサイトばかりが出てきます。\n癒し、エネルギー、EMF保護、波動などを謳って値段を吊り上げているサイトばかりです。\nしかし、私はただ、魔法の料金なしで購入できる場所を見つけたいのです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p3m4ix/how_many_of_you_used_to_be_jerks_but_have_now.json": "嫌な人から良い人に変わるまでのストーリーを知りたいですね。\nいい人になった話を聞かせてください。人にひどいことをするのはもうたくさんだと、どの時点で決心しましたか？\n人にひどいことをするのはもうたくさんだと思いましたか？",
  "data/reddit-ask/r/AskWomen/comments/p3lnrl/what_are_the_weirdest_thing_youve_ever_been_told.json": "私はこの質問の多くのバージョンを男性に見てきましたが、女性にはありませんでした。I\n男性の方がはるかに多くの悩みを抱えていることは理解していますが、それでも男性だけに当てはまるものではありません。\n彼らだけに当てはまるものではありません。\n\nあなたやあなたが知っている人（女性）は、どんな変なことをしたことがありますか？\n思われないようにするにはどうしたらいいと思いますか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p3qobz/when_a_girl_youre_seeingdating_asks_you_to_join.json": "彼女があなたの存在を気に入っていたり、おしゃべりをしているだけでも変ですよね？",
  "data/reddit-ask/r/AskHistorians/comments/p3gdmy/what_are_some_common_explanations_for_germanys.json": "私の理解はかなり素人的なものですが、私の理解は以下の通りです。\nドイツは、第一次世界大戦前に何とか巨大な経済大国になり、その後、何とか回復して\n第2次世界大戦では、ヨーロッパ全体にとって脅威となるまでに回復した。\nそして、第2次世界大戦では、西ドイツだけでなく...",
  "data/reddit-ask/r/askscience/comments/p3l44n/askscience_ama_series_im_dr_rebecca_schwarzlose_a.json": "こんにちは、Reddit! 私は認知神経科学者のレベッカ・シュワルツローズです。\n脳内マップについて、そして私たちの小さな脳がどのようにして、私たちが楽しむことのできる素晴らしい感覚や能力の範囲を作り出すのかについてお話します。\n脳地図についてお話します。あなたが顔を想像するとき、あなたは\n同じ脳地図を使っていることを知っていますか...",
  "data/reddit-ask/r/NoStupidQuestions/comments/p3vn8a/is_it_just_me_or_has_reddit_started_showing_so.json": "3回の投稿ごとに広告が表示されます。私が気付いただけなのか、それとも実際に広告を多く表示することにしたのかはわかりません。\n実際に広告を多く表示することにしたのかはわかりません。これだけの広告を表示すれば\n広告を表示することで、アプリが1日おきにクラッシュするのを止められると思っているのでしょう。",
  "data/reddit-ask/r/AskHistorians/comments/p3s9iy/was_classical_music_ever_the_pop_music_of_the.json": "私はピアニストであり、クラシック音楽を愛する者ですが、リストについての伝説を聞いたことがあります。\n「最初のロックスター」という伝説を聞いたことがありますが、それは彼の音楽、そしておそらくすべてのクラシック音楽が\n彼の音楽、そしてクラシック音楽は、昔は今よりもずっと一般の人々に人気があったという印象を受けました。\n印象を受けました。それは本当ですか？一般の人もいたのかな...。",
  "data/reddit-ask/r/AskHistorians/comments/p40j0r/how_did_afghanistan_go_from_being_relatively.json": "アメリカの一般的な人々は（西欧諸国のほとんどもそうだと思いますが）、基本的にアフガニスタンをテロリストと見なしてきました。\nアフガニスタンをテロリスト国家、あるいは破綻した国家と見なしてきた。\n弱い中央政府を背景に民族が衝突している破綻した氏族的国家であると考えてきた。\nと考えてきた。それに加えて、アフガニスタンは...",
  "data/reddit-ask/r/NoStupidQuestions/comments/p4147v/why_is_it_called_a_9_to_5_when_most_office_jobs.json": "昔のサラリーマンは昼休みもなく、7時間しか働けなかったのですか？今でも\nいまだに9時から5時まで働いている人がたくさんいます。どうなんでしょう？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p4431e/why_do_only_western_countries_make_such_a_big.json": "例えば、日本では、アジア人以外の人を政府の役職に就かせようと主張する人はいないでしょう。\n政府の役職にアジア人を増やそうとする人はいません。なぜアメリカやヨーロッパでは、このような考え方が広まっているのでしょうか？\nやヨーロッパでしか通用しないのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/p466o4/is_anybody_else_noticing_what_feels_like_an.json": "それが社会的地位であれ、性別であれ、人種であれ。どこを見ても分裂の種を見ているような気がします。\nどこを見ても分裂の種があるように感じます。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p4591z/do_you_hate_yourself_after_masturbating_do_you.json": "本当に悔しい思いをしています。私の考え方が間違っているのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p3x5u8/is_it_unnatural_or_weird_that_i_25_m_have_to_have.json": "昨晩、何度かデートしたことのある女の子が、自分のアパートに連れてきてくれました。\n彼女はセックスをしたがっているように感じました。僕は彼女とイチャイチャし始めた。\nせめてそれだけでもと思い、彼女とイチャイチャし始めましたが、それ以上の気持ちには\nそれ以上はしたくなかった。ただ、彼女には「あまり動きたくない」と言ってしまいました...。",
  "data/reddit-ask/r/askscience/comments/p46qk8/if_an_air_bubble_is_accidentally_left_in_a.json": "EDIT : 答えを教えてもらったので、コメントをくれた人に感謝します。\nさよなら",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p46noh/what_happened_to_the_ozone_layer.json": "初等教育では、オゾン層には穴があり、それは大きな問題だと頭に叩き込まれました。\n大問題だと頭に叩き込まれていましたが、個人的には誰かがそれを取り上げたり、話したりするのを見たことがありませんでした。\nしかし、個人的にそれを取り上げたり、話したりしている人を見たことがありません...。その問題は解決されたのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p47agu/why_do_so_many_people_on_reddit_enjoy_kicking.json": "正直、何度も見たことがあります。落ち込んだり、悩んだりしている人の投稿を見ていると\n鬱で苦しんでいる人や、状況に悩んでいる人が投稿すると、コメント欄には必ずと言っていいほど\nコメントでは、「それはOPのせいだ」と言って、自分を助ける努力を全くしない人がいます。\n昨日のサブ記事では 昨日、私が投稿したサブ記事の中で、私は自分のことを話していないと...",
  "data/reddit-ask/r/AskHistorians/comments/p467sk/how_did_people_stand_to_wear_so_much_clothing_in.json": "19世紀の人々は、たくさんの服を着ていたようです。気候に左右されることなく\n気候に関わらず、ジャケット、ベスト、アンダーシャツを着ている人をよく見かけます。\n砂漠でも。軍服は襟が高く、夏でも重ね着をしていることが多いようです。\n夏でも何枚も重ね着をしています。\n\nこれに耐えられる人はいるのだろうか...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p49pbv/since_the_world_has_obviously_given_up_on.json": "ボーナス質問：世界の他の国々は、独裁的な政府によって運営されている国と比較して、民間によって運営されている国をどのように見ているでしょうか？\n独裁的な政府が運営する国（タリバンに似ています。\n実際にはタリバンに似ています。) もしその国が国民に悪い影響を与えるビジネスをしていなければ、彼らはその国を尊敬するでしょうか？\n尊重するでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/p3to9f/do_other_countries_have_the_same_type_of_flag.json": "私はこれを見つけました、そして他にもたくさんあります\n[https://www.sportsmansoutdoorsuperstore.com/products2.cfm/ID/213424/ug1950204cku/glock-19-gen4-9mm-15-round-pistol-with-american-flag-battleworn-cerakote-finish-(マデ)]\n\nアメリカの国旗についてのルールをまとめた本があります。\nたたみ方の違いや、いつ...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p49ml5/are_you_supposed_to_talk_during_sex.json": "そうだとしたら、何が良いのか悪いのかというような明白なこと以外に、何について話しているのでしょうか？\n感じるか感じないかなどの明らかなこと以外に",
  "data/reddit-ask/r/NoStupidQuestions/comments/p49z3u/does_the_casualness_of_asking_somebody_how_are.json": "私は韓国出身で、日本にもしばらく住んでいましたが、現在は10年近くアメリカに住んで仕事をしています。\n私は韓国出身で、日本にもしばらく住んでいましたが、現在は10年ほど前からアメリカに住んで仕事をしています。私が気づいたことのひとつは\nアメリカやヨーロッパの国々では、同僚や何気ない知り合いと話をするとき、最も一般的な挨拶は\nアメリカやヨーロッパのいくつかの国では、同僚や何気ない知り合いと話をするとき、最も一般的な挨拶は...",
  "data/reddit-ask/r/AskHistorians/comments/p4aht5/my_great_grandfather_was_in_the_sas_serving_in.json": "こんにちは。今、祖母の家を片付けているのですが、屋根裏でこのコートを見つけました。\n叔父によると、第二次世界大戦でSASに所属していた曾祖父がノルウェーから持ち帰ったものだそうです。\n叔父は、第二次世界大戦でSASに所属していた曾祖父がノルウェーから持ち帰ったものだと言っていました。\n私の叔父は、第二次世界大戦でSASに所属していた私の曾祖父がノルウェーから持ち帰ったものだと言っていました。\n\nこれは、あまりにもクールな話ですね...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p44bq9/anyone_not_really_fear_their_own_death_but_fear.json": "病気で育った私は、自分の死を恐れたことはありませんでした。しかし、親父が死んだことで\n落ち込んでいます。彼は素晴らしい人で、私たちは完璧な関係を築いていました。だから、私には\nもちろん、「もしも」ということはありません。でも、それでも彼を失いたくはありません。今の気持ちは\n枕に向かって叫びたいような、泣きたいような、そんな気持ちになります。",
  "data/reddit-ask/r/AskHistorians/comments/p4bewn/how_common_was_second_sleep_really_in_medieval.json": "数年前、A・ロジャー・エキルヒ氏の著書『At Day's Close』が話題になった。過去の時代の夜\n中世ヨーロッパでは、二峰性の睡眠が普通だったという考えが広まりました。\nこれは多くの英字新聞に掲載され、「知ってましたか？\nこれは、英語の新聞の多くで繰り返され、「Did you know」のような人気のある豆知識となりました。考え方としては、むしろ...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p4f7cq/f24_how_do_you_orgasm_through_penetrative_sex.json": "バイブレータは女性への神の贈り物のようなもので、絶対に私を欲求不満から救ってくれます。\n欲求不満を解消してくれます。私がオーガズムを感じる唯一の方法だと思います。\n\nでも、誰かが私のクリトリスをこすってくれる感覚が嫌いなんです。そして\nまた、挿入されても私は感じません。\n\n誰かコツを教えてください。女の子が助けを求めています。\n\nまた、私は...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p48jbs/what_does_the_new_reddit_privacy_policy_mean.json": "9月12日に実施される主なアップデートの内訳を、目を通したことのある方に教えてください。\n9月12日？私が思うに、このサイトはあなたが投稿したすべての情報を収集します。これまで\nこれまでもそうだったのでしょうか？\n\nまた、すでにサイトに掲載されたものもすべて「収集」されるのではないでしょうか。\n推測しています。収集」とは何を意味するのでしょうか...。",
  "data/reddit-ask/r/askphilosophy/comments/p46il9/why_should_we_study_philosophers_that_failed_to.json": "ニーチェは、少し長い間、奈落の底を見つめていたようです。ハイデガーは\n真正性に悩んでいた。キルケゴールは、「私の憂鬱は、私が知っている中で最も忠実な愛人だ」と言ったかもしれません。\n私のうつ病は、私が知っている中で最も忠実な愛人である。\n\n彼らの個人的な哲学が彼らの生涯において失敗したのであれば、なぜ私たちは今日彼らを研究するのでしょうか？\n哲学を学ぶのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p4l01t/is_it_wrong_to_go_to_church_with_your_family_if.json": "最近、誰もが教会に行く州に引っ越してきたのですが、近所の人に誘われて\n近所の人に誘われて行きました。子供たちがこんなに喜んでいるのを見たことがありませんし、反社会的な性格の妻が\n反社会的な妻にも良い友人ができ、家族は本当に幸せそうです。I\n私自身も気に入っていて、何人かの友人ができましたし、多くの...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p4pfyu/is_it_considered_creepy_or_pervy_when_having_a.json": "個人的には、ヌードビーチに行ったことはありませんが、いつも「あそこはどんな感じなんだろう？\nと思っていました。そこで勃起することは、不気味で変態的だと思われますか？\n勃起を抑えられないこともありますよね。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p4pob1/why_did_my_karma_just_completely_reset.json": "カルマが30k、コメントカルマが150kほどあったのですが、単にページを更新しただけでは\nこれは何かの不具合でしょうか？\n\n編集：私の場合、今は戻っているようですが...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p4p4lz/should_i_be_concerned_if_my_girlfriend_of_six.json": "彼女は今、別の国で学校に通っているので、自分の国の通貨の口座を持っていないと言っていました。\n自国の通貨の口座を持っていないというので、私に助けを求めてきました。彼女は私に\nスクリーンショットと自分の口座番号を添えて送金するように言われたので、「彼女のお父さんから\n振り込むように言われました。",
  "data/reddit-ask/r/askscience/comments/p4s7nl/what_is_the_science_behind_fomite_transmission.json": "私の夫は、コヴィドの感染について非常に心配しています。\n私たちは今でもパッケージからすべての食料品を取り出し、再利用可能な容器やフリーザーバッグなどに入れています。\n食料品はすべてパッケージから取り出し、再利用可能な容器やフリーザーバッグなどに入れています。完全に衛生的でない限り、外からの荷物はほとんどありません。\n完全に消毒されていない限り、外の荷物はほとんど家の中に入れません。\n\nI...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p4ruy1/any_other_nonamericans_absolutely_bummed_that.json": "憎しみはないし、このサイトがアメリカ製であることもわかっているが...。\nテッド・クルーズ、アンドリュー・クオモ、ファウチのことを知らなければならない理由は全くありません。\nまたはFauci。",
  "data/reddit-ask/r/AskHistorians/comments/p4s0tz/whats_the_nursery_rhyme_ring_around_the_rosie.json": "子供の頃、実はペストのことではないと聞いたことがあります。\nそれまで私が思っていたようなものではありませんでした。しかし、これを聞いて私は疑問に思いました。\n疫病だとしたら、「Ring around the Rosies」とは何のことだろう？\n\nはっきりとした答えがないことは承知していますが、果たして...。",
  "data/reddit-ask/r/AskHistorians/comments/p4tawd/how_accurate_is_the_we_have_always_fought_article.json": "これは\n[https://aidanmoher.com/blog/featured-article/2013/05/we-have-always-fought-challenging-the-women-cattle-and-slaves-narrative-by-kameron-hurley/]をご覧ください。\n\nこの記事を初めて読んだのは数年前で、それ以来ずっと心に残っています。この\n歴史上の紛争における女性の役割は...」と主張しています。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p4q95l/people_who_have_sucked_their_own_dick_if_i_suck.json": "では、早速ですが説明します。もし私が自分のペニスを吸うことができたら......。\n口の中のペニスとペニスの味を、実際にペニスを吸われた時以上に感じるだろうか？\n実際に吸われている以上に感じるのでしょうか？誰かが私の質問を理解してくれることを願っています。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p4sd1d/what_can_a_woman_do_if_she_is_pregnant_but_the.json": "これは、私の友人のケースです。彼女は22歳で、相手は26歳です。二人は実際には付き合っていなかったし\nしていなかったのですが、このようなことになりました。問題は彼の出身地です。\n彼は社会的地位の高い家庭の出身で、彼女は高校の勉強しかしていませんでした。彼はこう言いました。\nこれが、彼女が彼の子供の母親になることがない理由です....",
  "data/reddit-ask/r/AskHistorians/comments/p4sl9c/historically_have_governments_initiated_by_a.json": "クーデターは不安定で、多くの場合、反民主的であることを理解しています。私は\n私は、自分の西洋文化的な考え方を超えて、このような状況があったのかどうかを知りたいのです。\nクーデターが地元の住民にとってあまりひどい結果にならなかった状況があったのかどうかを知りたいのです。\n地元の人々にとってひどい結果にならなかったかどうかを知りたいのです。良い結果につながったことはありますか？\n\n私は...",
  "data/reddit-ask/r/NoStupidQuestions/comments/p4hf5v/do_people_actually_like_dr_pepper.json": "念のため申し上げますが、私はスウェーデンに住んでおり、ここではドクターペッパーはほとんど売られていません。\n\nお店のお菓子売り場で、アメリカから輸入されたドクターペッパーを見て\nアメリカから輸入されたDr.Pepperを見て、「かっこいい、食べたことないな\nと思って買った。で、買って、店の外で開けてみたら、それが...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p4vjsw/how_do_i_prepare_a_girl_for_my_tiny_shclong.json": "もう10年近く誰ともデートしていませんが、最後に付き合っていた女の子が\n最後に付き合っていた女性が、僕のペニスの小ささを笑っていたからです（勃起すると4インチで、かなり細いです。\n測ったことはないけど）を笑われてショックでした。女の子をゲット\n数ヶ月前に彼女ができて、そろそろその段階にきています。どうやって...",
  "data/reddit-ask/r/NoStupidQuestions/comments/p4y248/why_is_the_us_being_blamed_for_the_taliban_taking.json": "私は純粋に学びたいと思っていますし、「アメリカが一番」という考え方ではなく、「日本が一番」という考え方です。\nアメリカが一番」という考え方ではありませんが、もしアメリカが長い間保護を提供して\nアフガニスタンがアメリカに依存しない持続可能な計画を作らなかったとしたら、なぜRedditでは多くの人がアメリカの撤退を非難しているのでしょうか。\nRedditでは多くの人が、アメリカが撤退したことを非難していますが、それは...",
  "data/reddit-ask/r/AskHistorians/comments/p4vq5b/was_suicide_among_slaves_common_in_ancient_times.json": "私は最近、インドの出稼ぎ労働者(m.m.)の自殺率が信じられないほど高い(1週間に2人という)という記事を読みました。\nドバイやUAEで働くインド人出稼ぎ労働者（現代の奴隷）の自殺率が非常に高い（週に2人ほど）という記事を読みました。\nの自殺率が非常に高いという記事を読みました。\n\nこの数字が高くないのは、彼らの多くがインドやその他の場所に家族を持っているからだと思います。\nインドやその他の国に家族がいて、頼りにしている人が多いからだと思いますが...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p5196z/how_do_women_with_long_nails_wipe_their_ass.json": "タイトルの通りです。お尻の長い爪を持つsaweetieのような女性を見ていると\n気になって仕方がありません。",
  "data/reddit-ask/r/askscience/comments/p515vl/did_dinosaurs_roam_the_entire_planet_or_did_they.json": "例えば、森の近くに住んでいたのか、水があったのか、暑かったのか寒かったのか、などです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p539fq/im_very_liberal_and_reddit_is_afraid_to_admit.json": "私はバイデンが好きではなかったし、アフガニスタンからの撤退は政治的な賭けだと思っていました。\n政治的なギャンブルだと思っていました。大統領になるための良い選択肢（バーニー）があれば良いのですが。",
  "data/reddit-ask/r/Ask_Politics/comments/p4tbon/the_usa_and_australia_have_lost_almost_every_war.json": "タリバンの最近の成功はとても大きく、すでに包囲している\nカブール\n[https://www.abc.net.au/news/2021-08-15/taliban-takes-jalalabad-with-kabul-now-in-sights-afghanistan/100378750?fbclid=IwAR00uITuq-gJMCiqWGMn3Xssd7pE3F93zN0yhB-leAYSSGeK8_4AbnWlqQw].\n第二次世界大戦後のほとんどすべての戦争で、私たちは...",
  "data/reddit-ask/r/askscience/comments/p546v6/why_do_horseradish_and_wasabi_seem_to_burn.json": "私はホットソースが大好きで、辛ければ辛いほどいいと思っています。\nしかし、カロライナ・リーパーが燃えるのとホラーが燃えるのとでは、大きな違いがあることに気がつきました。\nとワサビの火傷には大きな違いがあります。それはなぜでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p56ru3/does_it_make_you_depressed_that_life_is_constant.json": "最低でも週に40時間は仕事をして、その上でなんとか\nそして、仕事が休みの日には、家の中で時間のない仕事をしなければなりません。\n忙しくてできなかったことを、家の中でやらなければなりません。\n忙しくてできなかったことを家の中でやる。そして、それはまた次の日から始まります。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p57wn8/am_i_the_only_one_who_feels_sad_when_i_see.json": "今の世の中の状況を知っているだけに、（過去数十年の間にもっとひどいことがあったのは知っていますが\nこの数十年でもっとひどい目に遭ってきたことは知っていますが）、この世界に新しい赤ちゃんが生まれても\nこの世に生まれてくる赤ちゃんは、たくさんの悪いことに対処しなければなりません。\nクソ 気候変動は以前にも増して明らかで、私は...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p55py2/im_terrified_to_get_the_vaccine_can_people_who.json": "捨てアカウント。宜しくお願いします。失礼なコメントは許されません。私はただ\n答えを得ようとしている一人の人間です。\n\n私の家族は彼らのワクチンで私を絶対的に怖がらせています。\n陰謀を企てています。その一方で、私はまたCovidの数値が上昇していることに怯えています。\n\n私が考えているのは...",
  "data/reddit-ask/r/NoStupidQuestions/comments/p5ep19/why_do_american_labour_laws_seemingly_favour_the.json": "アメリカの労働者の権利は、他の西洋諸国に比べて非常に弱いようです。\n雇用者は労働者を搾取するようなでたらめなことをする権利がはるかにあります。なぜ\nなのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p5em47/what_are_the_differences_between_sex_in_porn_and.json": "私の友人はよく、この2つは全く違うものだと話しています。映像でしか見たことのない私にとっては\nスクリーン上でしか見たことがない私にとっては、何が違うのだろうと思います。",
  "data/reddit-ask/r/AskHistorians/comments/p5f27p/ive_been_taught_that_when_europeans_found_the_new.json": "しかし、私はヨーロッパの病気が原住民にどのような影響を与えたかという説明しか聞いたことがありません。\nその逆ではありません。でも、私が聞いたところによると\nヨーロッパ人は衛生状態が悪く、ほとんど入浴しません。\nアメリカの先住民は清潔でよく風呂に入っていた。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p5g8n4/what_was_the_us_actually_doing_in_afghanistan_the.json": "できるだけ多くのことを調べましたが、私は軍人ではありません。\n私は軍人ではないので、完全には理解できません。アメリカがタリバンと和平協定を結んだという記事を読みました。\nアメリカは2020年2月にタリバンと和平協定を結び、14ヶ月で軍隊を撤退させることに合意したと読みました。\nアメリカは2020年2月にタリバンと和平協定を結び、14ヶ月後に軍隊を撤退させることに同意したと読みました。その後、バイデンは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p599pj/can_i_ask_the_sex_worker_i_am_hiring_to_go_on_a.json": "私は27歳の男性ですが、全く魅力的ではなく、2～3/10の評価です。I\nまた、社会不安があり、自尊心もほとんどなく、他にもいくつかの欠点があります。\n社会不安があり、自尊心もほとんどなく、他にもいくつかの欠点があって、デートの選択肢にはなりません。どうしてもセックスがしたいのですが、今はできません。\n今はそれができません。要するに私はインセルなのです。\n\n私の性的な...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p5fgo5/how_do_women_pee.json": "だから結局のところ、怖くて聞けないのですが、どうしたらそうなるのでしょうか？となっています。\n17年以上前からの疑問なのですが、Googleで検索することもできず、私が使っているのは\n共有のPCを使っているので、Googleで検索することもできません。",
  "data/reddit-ask/r/askscience/comments/p5flnf/what_is_the_specific_advantage_of_a_moon_base.json": "現在、いくつかの国が月に恒久的な施設を建設する計画を立てています。\n月に恒久的な施設を設置する計画を立てている国がありますが、そのような施設を建設することで\n同じ施設を宇宙に浮かべるのと比べて、どのような利点があるのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p5h4ss/why_do_people_get_botox_when_it_almost_always.json": "自分の外見を気にして取得する人が多いようですが\nしかし、ほとんどの場合、結果的にはもっと悪くなってしまいます。それはまるで、もし私が\n自分の犬が一日中濡れているとどれだけ臭うか気になって、カビ臭い匂いを避けるために常に濡らしておくようなものです。\nカビ臭い匂いがしないように常に濡らしておくようなものです。",
  "data/reddit-ask/r/AskHistorians/comments/p5g97c/shields_with_a_λ.json": "スパルタのホープライトが盾にΛακεδαίμωνをつけていたという考えを裏付ける考古学的な証拠はありますか？\nΛακεδαίμωνのΛを盾につけていたという説を裏付ける考古学的証拠はありますか？\n\nヘロドトスやクセノフォンでそのような記述を読んだ記憶はありませんが、一般文化ではかなり広まっているようです。\n大衆文化ではかなり広まっているようです。",
  "data/reddit-ask/r/AskHistorians/comments/p5ltmh/what_caused_the_mujahideen_to_schism_into_alqaeda.json": "アフガニスタンの状況がそうであるように、別のsubredditでは人気のある投稿があります。\nレーガンがムジャヒディーンと会っているという悪名高い写真が、別のサブレディットに投稿されています。\nムジャヒディーン これを見て私は、何がこのグループを分裂させたのか、また、2つのグループの関係はどうなっているのかについて考えました。\n2つのグループの関係は現在どうなっているのかを考えました。",
  "data/reddit-ask/r/AskWomen/comments/p5gy5n/what_aspect_of_your_period_would_you_give_up_if.json": "だから、痙攣をあきらめれば、血液や気分の変化を維持しなければならない。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p55t1c/americans_how_do_you_feel_after_your_gov_took.json": "私なら激怒して反乱を起こすかもしれませんが、私はアメリカ人ではありません。\"War on Terror \"ですか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p5odab/are_we_really_going_to_pretend_like_the_us_didnt.json": "誰もこのことについて話していないような気がします。このようなことが起こらないようにするには\nこのようなことが起こらないようにするために 嘆願書か何か？\n\nアメリカ人にとってもアフガニスタン人にとっても、何兆円ものアメリカの税金が罪のない人々の殺害に使われるのは不公平だと思います。\nアメリカの納税者のお金が、私たちが知っている目的のために罪のない人々を殺すために使われたことは、アメリカ人にとってもアフガニスタンの人々にとっても不公平に思えます。\nこれは不公平だと思います。",
  "data/reddit-ask/r/AskHistorians/comments/p5lbve/what_is_the_level_of_continuity_between_the.json": "Rashida Tlaib議員がこんなツイートをしていました。\n[https://twitter.com/RepRashida/status/1427028625774284802] 今日の彼女のツイートでは\nアメリカがソビエトに対抗して支援したムジャヒディーンと、現在アフガニスタンを支配しているタリバンとを直接結びつけています。\n現在アフガニスタンを支配しているタリバンとの間に直接的な関係があるとしています。反論として、ツイッターで誰かが\nは、「...",
  "data/reddit-ask/r/NoStupidQuestions/comments/p5jfko/when_youre_out_on_a_date_and_a_girl_says_youre.json": "デートの時にこういうのが多くて困るんですよね(笑)\n\n彼らの言いたいことはわかるけど",
  "data/reddit-ask/r/NoStupidQuestions/comments/p5d3yy/are_dudes_in_the_taliban_wearing_eye_makeup.json": "私はアフガニスタンでのこのクソショーを見ていますが、何人かの男たちは以下のように見えます。\nジャック・スパロウ少佐です アイライナーをつけることはタリバンの男には許されるのか?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p5t20a/do_black_peoples_eyelids_block_more_light_than.json": "私は白人ですが、昼間に昼寝をしてまぶたを閉じると、光が溢れてきます。\n光が差し込んでくると、まぶた越しに光が見えるんです。\n\nそこで私は考えました。黒人は（あるいは肌の色が黒い人は）、目を閉じたときに見える光の量が少ないのだろうか？\n目を閉じたときの光の量は少ないのでしょうか？また、本当に色白の人は、目を閉じたときに光が見えにくいのでしょうか？\n苦労しているのだろうか...。",
  "data/reddit-ask/r/AskHistorians/comments/p5hxdg/how_was_leon_trotsky_viewed_in_the_poststalin.json": "スターリン時代、レオン・トロツキーはスターリンの最大の標的の一つであった。\nスターリンのパラノイアの最大の標的となった。粛清されるまでになったのです。\n粛清されるほどだった。スターリンの死と\nトロツキーは、スターリンの死後、フルシチョフの脱亜入欧計画によって、多くの人々のように更生された。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p5sac5/realistically_what_kind_of_sex_positions_would.json": "現在では、喜びを最大化するために、また楽しみのために、様々なセックスの体位があると思いますが\nしかし、当時は性交の再現性を重視していたのではないでしょうか。\nだから、彼らはどんな体位がデフォルトだったのかなと思って。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p5ttkj/would_you_date_a_girl_with_an_onlyfans_account.json": "理由を説明してください。",
  "data/reddit-ask/r/askscience/comments/p5ky0k/how_exactly_does_training_for_muscle_hypertrophy.json": "筋力増強のためのトレーニングではなく、肥大化のためのトレーニングの一般的なルールは、最大値の70％、1セット10回といったところです。\n筋力増強のためのトレーニングではなく、肥大化のためのトレーニングの一般的なルールは、最大値の70％、1セット10回というようなものです。これは一般的な数字です。\nこれは一般的な数字であり、正確ではありませんし、一般的な科学でもあります。\nこれは一般的な数字であり、正確ではありません。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p5r4gr/why_is_that_people_who_made_terrible_life.json": "薬物やアルコールの乱用で何度も刑務所やリハビリ施設に入っている人。\n薬物やアルコールの乱用で何度も刑務所やリハビリ施設に入ったり、薬物の影響を受けながら多くの犯罪を犯したり、あるいは\n純粋な私利私欲のために、人間として最低な行為をしてしまったために、頭脳明晰な状態で犯罪を犯してしまった。\n純粋な私利私欲のために、人間として最低の行為をしてしまったが、その後、人生を変えてしまった...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p5xd0t/why_is_kanye_west_allowed_to_have_a_mental.json": "このような状況の違いを生み出した要因は何か？\nどのような要因があったのでしょうか？どちらの場合も双極性躁病です。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p5ws1j/how_far_apart_can_your_boobs_be_without_them.json": "私はいつも自分のおっぱいを気にしていたので、「きっと大丈夫、気にするのは私だけ」と自分に言い聞かせていました。\nと自分に言い聞かせていました。自分のおっぱいがこんなにもひどいとは\n私のおっぱいと似たような距離にある、失敗したおっぱい手術を見るまでは、それがどれほど悪いことなのか気づきませんでした。もし私が\nブラジャーをしていなければ、その隙間に手がすっぽり入ってしまうほどです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p5y516/am_i_a_failure_as_an_epidemiologist_for_not_being.json": "私は疫学者で、Covid-19の対応に取り組んできました。\n私は疫学者です。私自身、家族全員、友人全員が完全に予防接種を受けています。\nワクチンを接種しています。(分かりやすいように編集しました)\n\nしかし、私のボーイフレンドはワクチン接種を拒否しています。彼は古い統計を投げ出し\n彼は古い統計を投げて、自分は知らないと言います。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p5xilg/do_you_usually_ask_sexual_partners_about_sexual.json": "まず、これまで一度もセックスをしたことがない（F23）。やってみたいし、魅力的な人に誘われたら、カジュアル・セックスでもいいと思う。\nしたいし、魅力的な人に誘われたらカジュアル・セックスもしてみたい。しかし一方で、私は\nでも一方で、性的健康についてはちょっと心配です。例えば、出会ったばかりの人とカジュアル・セックスをすると\n出会ったばかりの人とカジュアル・セックスをしたら、その人のデートの履歴を知らないし...。",
  "data/reddit-ask/r/askscience/comments/p61i3y/askscience_ama_series_hey_reddit_we_are_nasa.json": "NASAといえば、ロケットや宇宙開発を思い浮かべるかもしれませんが\n皆さんが食べている食品にもNASAが大きく関わっていることをご存知ですか？地球の衛星は、宇宙から\n地球の衛星からは、私たちの大好きな果物や野菜、穀物などの漁業や牧場、農業の様子を見ることができます。\n私たちが大好きな果物、野菜、穀物などの漁業、牧場、農業の様子を宇宙から見ることができます。NASAのデータは、農家や...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p5vp7b/do_men_pee_every_time_they_poop.json": "私は女性ですが、男性がウンチをするとき、オシッコを我慢することができるのでしょうか？そして、もし\nおしっこをするとしたら、おしっこを押している間、座ったままなのでしょうか？それとも、男性は\n立っておしっこをした後、座ってすぐにおしっこをするのでしょうか？\n\n私の場合、おしっこは毎回同時に出ます。すべてが一\n一気に出てきます。",
  "data/reddit-ask/r/AskHistorians/comments/p5xtgp/was_it_really_once_normal_for_people_to_fall.json": "悲しみ、トラウマ、うつなどが\n以前はもっと理解されていたのですから。私が言いたいのは\n何週間も、あるいは何ヶ月もベッドで療養しなければならない（時には昏睡状態や緊張状態が続くこともある）という具体的な話です。\n療養しなければならないというものです。\n\nそのような...",
  "data/reddit-ask/r/AskHistorians/comments/p60hi6/how_did_couples_deal_with_cultural_differences_in.json": "時系列が曖昧で申し訳ないのですが、スペインのフィリップがメアリー王妃と結婚した時のことを考えています。\nスペインのフィリップがメアリー王妃と結婚したときのことです。\nカトリーヌ・オブ・アラゴンはアーサー王子にラテン語で手紙を書きました。\nアーサー王子にラテン語で手紙を書いたのは、他の言葉が話せなかったからだと...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p64dy9/anyone_belittling_someone_else_for_a_googleable.json": "あなた方は、ネットに出てくるのではなく、実際に重要なことに関心を持ってほしいと思います。\nオンラインで、人々が「TOO AFRAID TO ASK」と呼ばれるサブサイトで合法的に活動していると仮定するのではなく\n質問するのが怖い」というサブメニューで人々が正当なことをしていると仮定するのではなく、彼らの投稿履歴を「調べる」ことに忙しく、なぜここでカルマを貯めさせたり、質問を許したりするのかと要求することに\nなぜここでカルマを稼がせるのか、質問を許すのか...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p63p39/is_it_wrong_to_not_want_to_date_people_with_kids.json": "子供のいる人と付き合いたくないというのは間違っていて、自分勝手だと言われました。\n\n私は個人的には子供が欲しくないし、最終的に、特に結婚すれば、その子供は\n子供は欲しくないし、最終的には、特に結婚すれば、子供はあなたの人生の一部になると思う。ある時点で、あなたは\n親のような存在になります。\n\n編集：もう少し詳しく説明すると、これは...。",
  "data/reddit-ask/r/AskHistorians/comments/p64nab/in_hbos_rome_there_is_a_dedicated_man_who_reads.json": "本人の動画[https://www.youtube.com/watch?v=xH0kO5qcPf8]をご紹介します。\nを見てください。読むことが仕事だったこの「職業」について、もっと知りたい\n上院の発表を読むことが仕事だったこの「職業」について、もっと知りたい。さらに付け加えると。ローマには、主要都市を巡回するような\n国のニュース」（法律や...）を広めるために主要都市を回っていたのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/p68sm4/considering_muhammad_had_several_wives_who_were.json": "ムハンマドの妻たちについての記事を読んで、私は彼の妻たちの多くが活発で教養があることに驚かされました。\n私は、ムハンマドの妻たちがいかに活発で教養があるかに驚かされました。特に、学者としての\n特にアイシャ・ビント・アブ・バクルの学者としての素養には驚かされました。このような基盤があるにもかかわらず、イスラム教の一部の宗派は、なぜ\n女性の教育を悪者扱いするようになったのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/p6538x/how_did_the_us_navy_come_up_with_its_world_war_ii.json": "大まかな慣例としては、以下のようなものがあったと思います。\n戦艦には州の名を、戦闘艦には領土の名を、巡洋艦には都市の名を\n駆逐艦は人名（主に海軍の英雄）、潜水艦は魚名、空母は主に歴史上の人物名。\n空母は主に歴史的な戦いや船、人の名前をつけていましたが...。",
  "data/reddit-ask/r/AskWomen/comments/p6g6by/women_who_have_lived_with_their_best_friends_and.json": "共感してくれる人を探しています。おそらく、いくつかの友人関係を失ったり\nこれほど悲しく、ストレスを感じたことはありません。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p68ql9/is_anyone_elses_reddit_being_super_slow.json": "かなりイライラする",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p6qr0m/do_you_ever_personify_objects_and_feel_bad_for.json": "例えば、私は2つの時計を持っていますが、どちらか一方を身につけると、不安になります。\nもう一方の時計が、私が選ばなかったことを悲しく思っていたらどうしようと心配になります。私は大丈夫でしょうか？\nセラピストを呼んだほうがいいですか？",
  "data/reddit-ask/r/AskHistorians/comments/p6r5ya/in_jarhead_a_marine_trainee_in_the_scout_sniper.json": "映画や本のJarheadは20年以上前の時代を扱っているので、20年ルールについてはクリアしていると思います。\nは20年以上前の時代を扱っています。とはいえ、この映画の原作が回想録であることは知っています。\nしかし、私はこの映画が回想録を基にしていることを知っています（そして、昔読みました）。\nしかし、この出来事が本に書かれているかどうか、どの程度正確かどうかは覚えていない...。",
  "data/reddit-ask/r/AskWomen/comments/p6m9n0/what_is_the_dumbest_thing_youve_been_told_you.json": "Edit: typo error, I meant good girlfriend for*.",
  "data/reddit-ask/r/AskWomen/comments/p6qfg7/how_do_we_avoid_turning_our_friendship_and.json": "通常、友人関係では、辛い時にはサポートを求めます。I\n私たちの社会的関係における一般的なコンセンサスは、困難な時期を経験したときに\n困難な時期を経験したときに頼りになる人を持つことだと思います。\nしかし、どんな関係にも境界線が必要です....",
  "data/reddit-ask/r/NoStupidQuestions/comments/p6wzju/does_anyone_else_automatically_ignore_pinned.json": "私は好奇心旺盛な猫です",
  "data/reddit-ask/r/AskHistorians/comments/p6tlqd/the_home_owners_association_seems_universally.json": "このことについて、私が見つけた唯一の情報は、ホームオーナー・マネジメント会社の宣伝文句ではなく\n会社のプロパガンダ以外の情報は、黒人を近所から締め出すための方法だと主張する、ソースのないウェブサイトだけでした。\n根拠のないウェブサイトによると、レッドライニングの勃興期に黒人を近隣から排除するための方法だったそうです。これは\nもっと詳しく知りたいと思います。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p6xorn/is_it_normal_for_a_15_yr_old_guy_to_cry.json": "バカげていると思うかもしれませんが、私が知っている尊敬する男性たちは皆、私や他の人の前で泣いたことがありません。\n尊敬している男性は、私や他の人の前で泣いたことがありません。私は月曜日に学校があります。\nヶ月前に妹を亡くしたばかりなんです。私は泣いてはいけないような気がします。\n涙を流してはいけないような気がします。私の家では普通ではなかったからです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p6nnkm/why_is_the_idea_of_eternity_in_heaven_comforting.json": "死を恐れるのは当然のことですが、本当に永遠に生きたいと思う人はいるのでしょうか？\n永遠に生きていたいと思う人はいるのでしょうか？もし天国が地上の生活と同じで、痛みや苦しみを除いたものだったら\n痛みや苦しみを除いて、天国が地上の生活と同じだったら、それでも疲れないでしょうか？そして、もし疲れないのであれば\n疲れないとしたら、天国での生活は惨めで退屈なものになってしまうのではないか...。",
  "data/reddit-ask/r/AskHistorians/comments/p6upur/how_culinarily_unusual_might_a_cheeseburger_have.json": "その上で、一般的な食生活への期待は、階級や性別によってどの程度異なっていたのでしょうか。\n階層や性別によって、一般的な食事に対する期待値はどのくらい違っていたのでしょうか？",
  "data/reddit-ask/r/askscience/comments/p6vlt9/what_is_it_about_coronavirus_that_we_have_to_keep.json": "これが「コヴィッドは本物じゃない」ということにならなければいいのですが。私はコヴィドに感染し、ワクチンを接種しました。\nワクチンも打ったし、マスクも手洗いもしている。\nしかし、私は科学者ではありませんし、このウイルスがポリオやスズキなどのウイルスと何が違うのか興味があります。\nポリオのように一生に一度しか予防接種を受けられないようなウイルスとは何が違うのか、私たちは・・・。",
  "data/reddit-ask/r/AskHistorians/comments/p6ue5f/the_argument_i_often_hear_against_tax_the_rich_is.json": "タイトルにもあるように、金持ちへの課税に反対する意見としてよく聞くのは\n金持ちが「出て行って」しまい、その出て行った金持ちが国に悪い影響を与えるというものです。\n州や国に悪影響を与えるというものです。\n\n歴史上、支配者や国家元首が金持ちへの課税を強化し、その結果...という出来事はありますか？\n統治者や国家元首が金持ちへの課税を強化し、その結果、...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p73fdm/why_is_trump_not_allowed_on_twitter_but_the.json": "タリバンがアフガニスタンを支配していますが、私は非常に高い教育を受けているわけではありませんが\n彼らはアフガニスタンでひどいことをしているのに、なぜツイッターが許されているのか不思議です。\nなぜツイッターが許されているのか？\n\nお返事ありがとうございました。",
  "data/reddit-ask/r/AskHistorians/comments/p6manv/in_the_3rd_century_bc_crossing_the_alps_earned.json": "確かに600年は長いですが...アルプスは北イタリアの特徴の一つです。\n北イタリアの特徴です。越えられない自然の障壁が、どうして「ああ、丘を越えた」になったのか。\n越えられない自然の障壁が、イタリアに向かう軍隊にとって、「ああ、丘を越えたな、気づかなかった」程度の\nになってしまったのでしょうか？",
  "data/reddit-ask/r/askscience/comments/p7440g/do_higher_initial_viral_loads_create_a_more.json": "具体的にはCOVIDに。とどこかで読んだことがあります。もしそうなら、どの程度の\n強い相関があるのか、また、初期のウイルス量が高いためにモ\nほとんどの人が死んでしまうような高い初期ウイルス量になるポイントはあるのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/p7cdsk/the_jewish_temple_at_elephantine_postdates_the.json": "一般的には、ユダヤ人は最初は多神教で、カナンの大規模なパンテオンを崇拝していたと考えられています。\nYHVHを主神とするカナンの神々の大規模なパンテオンを崇拝していたと考えられています。一般的な説\nユダヤ人が一神教に転向した経緯については、他の神々の存在を認める「一神教」が発展したとする説が一般的です。\n- 他の神々の存在を認めながらも、その神々を...",
  "data/reddit-ask/r/AskHistorians/comments/p78ess/how_was_the_future_depicted_in_sciencefiction.json": "例えば、1950年代/1960年代の小説では、「the」の人間の生活を描く際には\n未来」の人間の生活を描く際には、アルミホイルの服を着たり、ロボットの召使や空飛ぶ車を持っていたりします。\n空飛ぶ車などが登場します。\n\n最近では、『アバター』（2009年）に見られるようなVRやその他の技術があります。\n\nこれらのアイデアが可能なのは、もちろん...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p7c23d/why_does_it_seem_to_be_okay_to_use_the_term.json": "アメリカ人以外の人が聞いています。はっきり言って、どちらも馬鹿げていると思います。\n色を持たない人には一度も会ったことがありません。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p75o4b/whats_the_point_of_no_nut_november.json": "だから、人の話を聞いてもピンとこない。\n\nモラルや宗教上の問題がない限り、自慰行為は無害であり\n一週間のうち、せいぜい30分程度しかかからないし、男性にとってはいくつかの癌のリスクを減らすことができる。\n男性の場合、いくつかの癌のリスクを減らすことができるようです。\n\n恋愛においては、1ヶ月間断っても怒られないのでは...？",
  "data/reddit-ask/r/NoStupidQuestions/comments/p7ct4g/can_i_jack_off_w_my_cat_in_the_room.json": "私は19歳ですが、変なのはわかっていますが、脱ぎたいのですが、猫がベッドの下で寝ているので\nベッドの下で寝ているんだけど、彼と一緒にするのは変な感じがするんだよね。\n私が何をしているのか......同意を求める必要があるのか......こんな時はどうすればいいのか......。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p7fkuc/can_i_finger_a_girl_with_nail_polish_on.json": "恋人ができたばかりですが（イェーイ！）、私もネイルを塗り始めました。と思っていました。\nいいのかな？塗っていいブランドとそうでないブランドがあるのでしょうか？",
  "data/reddit-ask/r/askscience/comments/p7doit/why_are_metals_such_good_heat_conductors.json": "私の貧弱な物理学の知識では、金属が良い電気伝導体であることは\n意味があります。高校では、金属は格子を作っていて、その中では電子が多かれ少なかれ自由に動き回り、電流を生み出すと教わりました。\n電子は多かれ少なかれ自由に動き回り、電流を発生させます。\n炭素のようなものもダイヤモンドのように格子を作りますが、それは...",
  "data/reddit-ask/r/askscience/comments/p7bfgr/what_happens_to_the_gut_microbiome_when_a_person.json": "断食をすると、体に良い変化が起こると聞きました。また、よく発達した\nよく発達した腸内細菌叢は、健康な体の重要な部分であるようです。しかし、数日間食事をしないことが\n数日間食事をしないと、マイクロバイオームにどのような影響があるのでしょうか？腸内細菌は食物不足で死んでしまうのでしょうか？\n腸内細菌は食物の不足により死滅するのでしょうか？それとも、多様性が減少するのでしょうか？それとも体が...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p7f8fa/people_of_reddit_i_live_in_lebanon_where.json": "私は20歳ですが、とても老けた感じがします。毎日の睡眠時間は最大でも5時間です。\n目が覚めると未来のことを考えてしまうからです。\nこの国では明日のことは予測できません。私はこの国から抜け出せないと感じています。今日、私は\n他の国の人たちはどうやって...と一日中ベッドに横たわっていました。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p7h417/do_americans_really_have_people_whose_job_is_to.json": "映画の中でよく見かけるのですが、大きなお店では、しばしば、それが\n他の仕事をしている店員が交代でやっていたり、警備員がやっていたりするのではなく、その人の全体的な仕事のようです。\n他の仕事をしている店員とか、警備員とかではなく。\n\nもしこれが実際の仕事で、あなたが経験したことがあるなら、それはどうでしたか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/p7fbx6/why_do_babies_children_need_to_be_forced_to_eat.json": "子育てをしていてよく耳にするのが、「食事をしない」ということです。\n食べることを拒否してしまうことです。野菜や苦手な食べ物だけでなく、何でも食べてしまう。\n赤ちゃんを騙して口を開けさせて、食べ物を忍ばせるのが一般的らしいです。\nこっそり食べるのが普通らしい。\n\n食べることは基本的な生存本能ではないのでしょうか？どうしたものか...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p7elxl/is_it_wrong_to_drive_an_old_car_until_it_falls.json": "新しい車にアップグレードする必要があるというコメントを受け続けています。\n今の車はまだ信頼性が高く、すべてが機能していて、120kmの走行距離ですが、すべてが問題なく機能しています。\nしかし、私の現在の車はとても信頼性が高く、すべてが機能しており、120km走行していますが、すべてが問題なく機能しています。",
  "data/reddit-ask/r/askscience/comments/p7h4s8/how_are_permanent_magnets_formed.json": "さらに、なぜ暖房で財産を失うのか",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p7mh3w/do_70_year_olds_have_sex.json": "私は70歳になってもきっと頬を叩いていると思います。",
  "data/reddit-ask/r/askscience/comments/p7og7y/if_a_recently_deceased_human_corpse_is_placed_in.json": "もしそうだとしたら、肌が日焼けするプロセスが起こらなくなる平均的なカットオフタイムはいつですか？\n日焼けが起こらなくなる平均的な時間はいつですか？\n\n太陽の中ではなく、地球上の直射日光の下では、多くの混乱があるようなので\n地球上の直射日光の下での話です。",
  "data/reddit-ask/r/AskHistorians/comments/p7pgd6/a_handful_of_the_founding_fathers_returned_home.json": "個人的には、1780年代までに法律を制定した建国の父を3人知っている。\nアレクサンダー・ハミルトン、ジョン・マーシャル、パトリック・ヘンリーだ。私が調べたところによると\nハミルトンは、政治的な目的でニューヨーク州の弁護士になったようだ。\n例えば、トレスパス法を廃止するなどの政治的な目的で。それが私の考えでは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p7nzv8/if_someone_is_wearing_a_latexsuit_and_farts_what.json": "例えば、小さな泡ができるのか？スーツ全体に広がるのか？それは\n逃げ道はありますか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p7tkl1/why_are_the_ku_klux_klans_officer_titles_so_stupid.json": "KKKについての本を読んでいたら、メンバーの肩書きに奇妙なものが多いことに気づきました。\nインペリアル・ウィザード、グランド・ドラゴン、エグザルテッド・サイクロプス、ジャイアンツ、ゴブリンなど。\nサイクロプス、ジャイアンツ、ゴブリン、そして、頭にKlを付けた単語だけの称号は言うまでもありません。\nといったものです。\n\nこのウルトラには違和感しかありません...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p7rc6z/update_on_my_nut.json": "昨日だったと思いますが、「左の睾丸が紫色で痛い」とここに書き込んだのは\nその投稿をご覧になった方にお伝えしたいのですが、私は土曜日に睾丸を摘出する手術を受けます。\n土曜日に摘出手術を受けます。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p7vszr/do_men_only_enjoy_rapid_sex.json": "女性としては、ゆっくりと情熱的に愛し合うことが好きです。抱き合うようにゆっくりとした時間を楽しみます。\n全身裸でお互いに溶け合うように寄り添うように\n寄り添うようにゆっくりと。\n\nしかし、この経験は、ほとんどが私の頭の中だけのものであり、以下のような理由で得られたいくつかの試練でもあります。\n私が今まで付き合ってきた男性は、急に動き出す傾向があるからです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p7vxuj/why_is_only_fans_banning_porn.json": "私はonlyfansを使ったことはありませんが、私の理解では、基本的にはウェブサイトで\n誰かのアカウントに登録して、その人がアップロードしたAVを見ることができるサイトだと理解しています。今\nポルノを禁止しているようですね。それは馬鹿げたビジネス上の決定のように思えるし\n道徳的な理由からではないでしょうね。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p7qbs0/why_would_onlyfans_ban_porn.json": "正直に言うと、Onlyfansを知っている人や使っている人がいるのは\nそこにポルノがあるからです。この瞬間まで、Onlyfansがポルノ専用サイトではないことを知らなかった。\nOnlyfansが専用のポルノサイトではないことも知らなかったし、それを知っていてもまだ\n今でもポルノ以外の目的があるとは言えません。これは...",
  "data/reddit-ask/r/AskHistorians/comments/p7xfep/can_someone_enlighten_me_about_japan_war_crime_in.json": "私はインドネシア人です。日本の占領が過酷なものであったことは知っていますが（殺人やレイプなど。\n日本が3年間しか滞在していなかったにもかかわらず、オランダよりも悪かったことは知っています。\n学校での予備軍の運命については何も知りません。韓国人や\n中国人が「昔の敵」が靖国神社に祀られていることを知っているように...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p7xxhw/why_is_it_that_when_you_wake_up_in_the_morning.json": "また、2回目の睡眠時に見る夢が、なぜか毎回奇妙で面白いのです。\n毎回？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p7jld2/why_doesnt_fauci_or_the_cdc_heavily_recommend.json": "肥満とビタミンD不足のアメリカ人にコヴィドが効いているというデータがたくさん出ています。\n肥満とビタミンD不足のアメリカ人に最も影響を与えるというデータをよく目にします。このデータは極めて明確で、議論の余地もありません。他には\nそれ以外の解釈はありません。\n\n1日1時間の運動（ウォーキング、ジョギング、サイクリング、水泳、リフティング、日光浴、縄跳びなど）をしなさいというのはどうでしょうか。\n太陽の光を浴びる、縄跳びをする......。",
  "data/reddit-ask/r/AskHistorians/comments/p835k9/how_do_we_know_that_saturn_devouring_one_of_his.json": "私の理解では、キンタ・デル・ソルドの絵画は、誰かに見られることはなかった。\nゴヤの死後に発見されたとのことです。\nゴヤの死後に発見されたと聞いています。あの絵は、心を失った男の芸術的ビジョンではなかったのか？\nそれが実際に...であることをどうやって知ることができますか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p84nmi/do_people_keep_their_glasses_on_during_sex.json": "これはとても奇妙な質問で、こんなことを聞くのは気が引けるのですが、これは私の頭の中にある\n私の頭の中にあるものです。私は童貞で、メガネをかけていますが、メガネなしではほとんど見えません。\nメガネなしではほとんど見えません。だから、セックスの時に眼鏡をかけたままの人がいるのか、いないのか、疑問に思わずにはいられませんでした。\n疑問に思いました。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p839cb/why_do_people_call_you_racist_if_you_say_that_you.json": "他のsubredditsを見ていたら、コメント欄に白人にしか惹かれないと書いている人がいた。\n白人にしか惹かれないと言っていましたが、少し前に見たストリームでは\nストリーマーが同じことを言っていたんだけど、どちらの場合も人々は彼らをダウンブ\nまた、少し前に見たストリームでは、ストリーマーが同じことを言っていました。\n\nそれは単なる好みの問題です。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p844d0/what_even_is_only_fans_if_its_not_for_porn.json": "私は文字通り、OFはPatreonのような購読サイトだと思っていましたが、ポルノのためのものでした。\nどうやら私は間違っていたようです(笑)\n\n編集：分かりやすくするために文章を再構成",
  "data/reddit-ask/r/askscience/comments/p86d5h/does_anything_have_the_opposite_effect_on_vocal.json": "ヘリウムを使うと声が高くなるという科学的なことは直接知りませんが\nしかし、それとは逆の効果をもたらすものがあるのではないかと考えていました。\nしかし、声帯が低い音を出すという逆の効果を生み出すものがあるのではないかと思ったのです。",
  "data/reddit-ask/r/askscience/comments/p8djsg/nowadays_dogs_get_vaccinated_for_several.json": "少なくともアメリカでは、犬は狂犬病、ジステンパー、パルボの予防接種を受け、心臓病の薬を飲みます。\n狂犬病、ジステンパー、パルボの予防接種、心臓病の薬を飲んでいます。1900年頃の昔は、犬はこれらの病気にかかって死んでいたのでしょうか？\n狂犬病は例外です。狂犬病は例外だと思いますが、症状が出た時点で\n狂犬病は例外で、症状が出た時点で早急に殺処分されていました。しかし...",
  "data/reddit-ask/r/AskWomen/comments/p88d31/whats_the_first_thing_you_do_when_you_come_home.json": "あるいは、学校や職場からの帰宅時の儀式など、あなたが持っているものを教えてください。",
  "data/reddit-ask/r/AskHistorians/comments/p86q3v/why_did_the_ottoman_sultans_use_kidnapped.json": "私はオスマン帝国の歴史（およびイェニチェリの歴史）をほとんど知らずにこの質問をしています。\n私はオスマン帝国の歴史（そしてイェニチェリの歴史）をほとんど知らずに質問しています。\n\nイェニチェリはなぜ誘拐されたキリスト教の奴隷から結成されたのでしょうか？私は最初\n最初は、中世のユダヤ人がお金に紛れ込んだような、抜け道的なものだと思っていました。\nと思っていたのですが",
  "data/reddit-ask/r/NoStupidQuestions/comments/p8e3qg/why_is_god_considered_a_male_when_life_comes_from.json": "生命の誕生には女性が必要であり、地球はかつてガイア（母なる大地）と呼ばれていました。\n地球。しかし、私たちは神が男性であると考えていますが、なぜでしょうか？\n\n男性が世界を支配していること以外に、何か理由があるのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/p8jfq5/how_badly_did_the_average_slaveowner_treat_their.json": "なぜこのような質問をしているかというと、ちょっとした裏話があります。数週間前\n私は数週間前にルイジアナ州に休暇で行き、Whitney Plantationのツアーに参加しました。私たちの\nツアーガイドはクレオールの黒人で、もちろん黒人がそこで受けたひどい仕打ちを説明してくれました。\n黒人がそこで受けたひどい仕打ちを説明してくれました。しかし、ツアーの最後の方で、彼は...",
  "data/reddit-ask/r/AskHistorians/comments/p8jc63/regarding_judging_historical_figures_by_the_mores.json": "歴史学者ではない人たちと話していて、あることを「普遍的に間違っている」と議論していました。\n普遍的に間違っている」と話していました。歴史上の人物を見る際のベストプラクティスを議論するための言葉を見つけるのに苦労しています。\n歴史上の人物を見る際のベストプラクティスについて、特に同時代の\n特に、その時代に現代的な価値観を持った同時代人がいた場合には。ここでは、いくつかの...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p8hxy6/are_you_afraid_of_not_having_enough_energy_to.json": "私の一番の心配事は、年を取ってから仕事をするよりも先に進む気力がないことです。\n年を取ったときに、仕事以上のことをする気力がないことです。なぜか、上の世代は40代から60代までは元気があるように感じます。\n40代から60代前半までは、なぜか元気があります。時には20代後半から60代前半の同年代の友人たちよりも\n20代後半から30代前半の同年代の友人よりも多いことがあります。私はまだ29歳ですが、私のエネルギーは...",
  "data/reddit-ask/r/askscience/comments/p8cfy6/why_are_there_so_many_vitamin_b_types_and_how.json": "また、なぜ数字や単語の名前があるのか？それらはすべての状況で交換可能なのか\nそれとも状況に応じて使い分けているのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p8ih2f/why_are_vegans_so_aggressive_but_vegetarians_so.json": "私の人生で気づいた傾向があります。それは、ヴィーガンの人たちのほとんどが\n菜食主義者は、私が会う人の中でも最も攻撃的な人が多いのですが、ベジタリアンは非常に友好的です。\nベジタリアンは非常に友好的ですか？これはなぜでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/p8nyxr/why_havent_we_invented_a_hangover_cure.json": "人生に疑問を持ち、最後の2杯は本当に必要だったのかと、ここに横たわっていると\n思うのですが、私たちは医療面で大きな進歩を遂げましたが、なぜこのような進歩がないのでしょうか？\n\n二日酔いに効く薬を作るのは難しいかもしれない。しかし、なぜ私たちには\n吐き気、痛み、不安を和らげる薬を飲めばいいんじゃない？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p8h54q/do_girls_even_enjoy_penetration.json": "私が読んだ限りでは、他の形態のセックスの方が女性にとっては楽しいようです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p8obh0/should_i_be_concerned_about_my_extremely.json": "私は17Mです。私は包皮をあまり引っ込めることができません（頭の半分くらいまでしかありません）。\nで、亀頭を軽く触ったり叩いたりしても、とても違和感があります（痛くはないですが\n痛みはありません）。) これは普通のことでしょうか？心配したほうがいいですか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p8qs4a/i_need_help_for_my_little_brother_advice.json": "弟は14歳で大丈夫なの？で、数ヶ月前にお姉ちゃん（16歳）との賭けに勝ったって\n数ヶ月前にお姉ちゃん（16歳）と賭けをして勝ったんだって。そして、私は「うん\nそれはすごい! 何の賭けだったの？\" そしたら、お姉ちゃんが5ドルをあげるって言うんです。\nそして、お姉さんが5ドルあげるから、もし、女の子から個人的に...",
  "data/reddit-ask/r/NoStupidQuestions/comments/p8q3dj/how_do_americans_go_by_their_day_and_how_do_they.json": "INFO: r/AskAnAmerican [/r/AskAnAmerican]に投稿しましたが、なぜか\n私の投稿は許可されませんでした。Redditでは多くのアメリカ人を見かけるので、ここで回答を得られればと思っています。\nここで回答を得られればと思っています。ありがとうございます。\n\nたくさんの質問があり、かなり変わっていると思われるかもしれませんが、ご容赦ください。\nお付き合いください。\n\n 1. あなたは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p8pnmq/at_what_point_do_we_just_let_survival_of_the.json": "ワクチン接種に関しては COVIDの予防接種を受けるのに十分な時間がありました。\nCOVIDの予防接種を受けてください。多くの世論調査によると、COVIDを接種した人への同情度は低いようです。\n多くの世論調査では、COVIDに感染し、予防接種を受けることができたにもかかわらず、それを選択しなかった人々に同情的でないという結果が出ています。\n\nでは、どの時点ですべての制限を解除して、元の生活に戻るのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/p8r0z2/are_you_getting_excited_about_the_askhistorians.json": "昨年、私たちはここredditで初めてのカンファレンスを開催しました。\n好評だったので、再び開催することになりました。カンファレンスは10月19日から21日までの間、ここで開催されます。\nテーマは「[Deleted] & Missing History: 過去を再構築し\n過去を再構築し、...",
  "data/reddit-ask/r/askscience/comments/p8tciv/does_organic_matter_decompose_in_highly.json": "チェルノブイリで最も放射線を浴びた地域は山火事のリスクが高いという記事を過去に読んだことがあります。\nチェルノブイリの最も放射線の強い地域では、枯れ木が大量に蓄積されているため、山火事のリスクが高い。\n放射能の影響でバクテリアが十分に繁殖できず、分解が進まないからです。\nこれは、放射線の影響でバクテリアが十分に繁殖できず、分解が進まないためです。そこで、こんな疑問が浮かびました。",
  "data/reddit-ask/r/AskHistorians/comments/p8u3we/in_the_podcast_dolly_partons_america_someone.json": "この（とても楽しい）ポッドキャストを聞いていて、このセリフが発せられたときに\n私はそれを一時停止し、すぐに説明を求めてグーグルで調べましたが、あまり見つかりませんでした。その\nコメントのトランスクリプトです。\n\n> エリザベス・キャット。\n> \n> ええ、ヒルビリーという言葉の起源を知っていますか？\n> \n> Jad:\n> \n> いいえ。\n \n> エリザベス...",
  "data/reddit-ask/r/AskWomen/comments/p8p9uh/married_young_how_did_it_turn_out_and_are_you.json": "また、現時点での付き合いの長さは？何かを逃したような気がしませんか？\nもっと待っていればよかったと思うことはありますか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p8slma/is_it_okay_that_im_fine_with_being_mediocre.json": "私の周りの人たちはみんな、こんな素敵な人になりたいと思っていて、大きな夢を持っているような気がします。\n大きな夢を見たりしているような気がします。野心的であることは立派な特徴だと思いますが\n向上心を持つことは立派なことだと思いますが、私はそうは思いません。私はただ生きたいと思っています。生きていくために。しかし、私は\n人として向上したい、学びたい、良くなりたいと思っていますが、しかし...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p8xddb/what_do_you_do_right_after_a_guy_comes_in_your.json": "彼氏とコンドームなしでセックスをするようになってから、毎回、彼が私の中で射精した直後に\n彼が私の中に射精した直後、私は立ち上がり、足の間にタオルを挟んで不器用にバスルームに歩いて行きます。\nタオルを足に挟んで あまりエレガントではありませんね。他の人はどうしているのだろう？\n他の人はどうしているのか、何か違う方法があるのか？",
  "data/reddit-ask/r/askscience/comments/p8ushd/why_is_the_floor_of_the_uyuni_salt_desert.json": "なぜこのような形になるのか。https://images.app.goo.gl/8HscWWGJApbzKyGp7",
  "data/reddit-ask/r/askscience/comments/p8vtoe/if_mrna_vaccines_remain_proven_safe_is_it.json": "もちろん、これらのことに気をつけるのが一番です。とはいえ、この新しい\nこの新しい予防接種では、「旧来の」ワクチンの不確実性の多くが排除されています。\nそうですね。仮に、mRNAを体内に取り込む方法が同じで、生成されるタンパク質が\n体内にmRNAを取り込む方法が同じで、生成されるタンパク質が無害だとすると、そこには...",
  "data/reddit-ask/r/NoStupidQuestions/comments/p90nig/why_is_raskreddit_suddenly_full_of_questions_like.json": "なぜかというと、ヘッドラインに書かれていることをすべて読んだからです。",
  "data/reddit-ask/r/AskHistorians/comments/p8r700/in_wwi_france_held_on_for_four_years_and_wound_up.json": "第二次世界大戦では、ドイツ軍は思い切って5つのパンツァー師団をアルデンヌの森に押し込んだそうですね。\nアルデンヌの森に5個のパンツァーを投入しました。この作戦は成功し、フランス軍の戦線を突破しました。\nフランス軍の前線を突破しました。ラインは再編成できず、そのために\nダンケルクへの退却が行われ、残ったフランス軍も...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p8rkca/how_can_a_single_person_that_lives_alone_reward.json": "私は独身で寂しがり屋なので、落ち込んだ時や長い時間をかけて自分にご褒美をあげたい時は\n食べ物を注文したり、自慰行為をしたりすることしか考えられず、非常に落ち込みます。\n非常に落ち込んでしまいます。自分へのご褒美や元気を出すために、他に何ができるでしょうか？\n\n編集部：たくさんのご回答ありがとうございました。私が購入したのは、大...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p92ukv/if_you_could_become_visibly_physically_fit_within.json": "指をパチンと鳴らすと、5～10秒程度の非常に強い痛みがあります。\n痛みがありますが、最後には気分が良くなり、自分の体を見てみると、まるでスーパーヒーローのようです。\n自分の体を見ると、まるでスーパーヒーローのようになっています。あなたもやってみませんか？",
  "data/reddit-ask/r/TrueAskReddit/comments/p8s2sn/with_the_trend_of_unskilled_highpaying_jobs_being.json": " * ジョブ・オートメーションの影響を受ける最大のグループは、次のような人たちです。\n   何らかの理由で高等教育を受けることができない人たち。\n   つまり、良い仕事に就くチャンスは、残念ながらほとんどが非熟練労働市場にあるということです。\n   つまり、良い仕事に就くための最良のチャンスは非熟練労働市場にあり、残念ながらそこでほとんどのジョブ・オートメーションが行われている。\n *...",
  "data/reddit-ask/r/AskHistorians/comments/p92h81/how_lorem_ipsum_a_text_from_ancient_rome_turned.json": "オリジナルのLorem Ipsumは、ローマ共和国の末期にキケロによって書かれたものです。\n有名なローマ人が書いたこの文章が、なぜ一般的なランダムテキストの代名詞になったのでしょうか？\nなぜそれが選ばれたのか？どのようにしてそんなに人気が出たのか？",
  "data/reddit-ask/r/AskWomen/comments/p96rlt/what_do_you_want_to_hear_from_a_guy_after_telling.json": "そのことを伝えた後、男性からどのようなことを言われたいですか？\n伝えた後、男性にどのような行動をとってほしいと思いますか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/p9cn0l/if_you_are_an_unattractive_person_how_are_you.json": "誤解を恐れずに言えば、「美しさは見る人の目の中にある」などと言われることもありますが\nしかし、圧倒的な証拠によると、美しさと誰がデートするかはかなり予測可能であり\n美しさと誰と付き合うかは、かなり予測可能であり、魅力的であることは\n魅力には客観的な要素があります。もし誰かのスケールが...",
  "data/reddit-ask/r/AskHistorians/comments/p9ciif/the_full_name_of_pedro_i_the_first_emperor_of.json": "編集\n\nどうやらポルトガル王室だけではないようです。\nオーストリア・ハンガリー帝国の最終皇帝であるチャールズ1世は、8人の子供たちに13以上の名前を\n8人の子供たちに13以上の名前をつけました。\n\n * オットーは「フランツ・ヨーゼフ・オットー・ロバート・マリア・アントン・カール・マックス・ハインリヒ・シクストゥス・クサヴァー」。\n   Felix Renatus Ludwig Gaetan Pius Ignatius」(17)\n *...",
  "data/reddit-ask/r/AskHistorians/comments/p9clw2/apparently_mark_twain_blamed_sir_walter_scott_for.json": "トウェインが風刺家であることはわかります。しかし、この記事\n[http://www.twainquotes.com/SirWalterScott.html] トウェインが書いたこの記事は、現代の作家によって探求されたものです。\nライター\n[https://harpers.org/2007/07/how-walter-scott-started-the-american-civil-war/]。\nスコットは、過度にロマンティックな空想家で、その著作は...を広めたと書かれています。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p9brgg/when_haiti_is_ravaged_by_an_earthquake_why_isnt.json": "一つの島なのに、地震の話は一部分でしか聞かない。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p9fuin/how_can_i_get_rid_of_the_horny.json": "いつもムラムラしていないだけで、私の人生はとても豊かになるような気がします。\n感じます。何か薬でもあるのかな(笑)",
  "data/reddit-ask/r/AskHistorians/comments/p97kqh/why_was_stalin_looked_on_unfavourably_in_the_ussr.json": "私は決して歴史に詳しいわけではありませんので、質問の前提が間違っていたら申し訳ありません。\n誤っているかもしれません。私の理解するところでは、スターリンと毛沢東の政策は、彼らの後継者によって\n後継者によって取り消されたと聞いています。しかし、毛沢東の中国国内での評価はほぼそのままだったようです。\nスターリンとスターリニズムが汚れたものになったのに対し、毛沢東の中国国内での評価はほとんど変わらなかったようです。",
  "data/reddit-ask/r/AskHistorians/comments/p9a14c/why_didnt_flak_cannons_used_against_airplanes.json": "第二次世界大戦の映像や戦争映画を見ると、対空砲が上空を榴弾で埋め尽くし、いたるところで爆発している。\n対空砲が榴弾で埋め尽くされ、いたるところで爆発しているのに、その榴弾が\n対空砲が上空を榴弾で埋め尽くし、あちこちで爆発している映像やWW2の戦争映画を見ても、その榴弾が高射砲陣地に降り注ぎ、砲を使っている兵士に危害を加えないのはなぜ？",
  "data/reddit-ask/r/AskWomen/comments/p9cqb6/has_anyone_here_specifically_those_over_30_gone.json": "女性の中には、いつも楽しくて素敵な友達がいて、一緒に過ごすのが好きな人もいれば\n一緒に過ごすのが好きな女性がいる一方で、他の女性は、自分の人生を充実させるのにとても苦労しているようです。\n頼れる人が1人か2人もいない女性もいるようです。そして、どちらのグループも相手の状況やその経緯を理解していないようです。\nどちらのグループも相手の状況やその経緯を理解していないようです。\n\nそれで...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p9mpp7/why_do_americans_reply_with_the_state_they_live.json": "これはよく気づくことです。アメリカ人は、他の人たちが州や場所を知っていると思っているのでしょうか？\nアメリカ人は、他の人が州とその位置を知っていると思っているのでしょうか？それとも、アメリカから来たと言うだけでは、十分に具体的ではないのでしょうか？\nいのでしょうか？\n\nBtw 私はアメリカ人ではありません。\n\n編集1：カナダ人ではありません。\n\n編集2：「アメリカは巨大だ」はもうやめてください。他の国も同じです。\n\n編集3：ヨーロッパを使うなら...。",
  "data/reddit-ask/r/AskHistorians/comments/p9ou6h/why_is_the_american_southeast_the_worst_at.json": "私はアメリカの南東部、特にアラバマ州に住んでいます。I\nミシシッピ州とアラバマ州は基本的に何をするにも最悪だというジョークをネットでよく読みます。\nというジョークをよく読みますが、本当にその通りだと思います。アラバマ州と\nアラバマ州とミシシッピ州は、あらゆる分野で最下位かそれに次ぐ位置にあります。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p9mxv5/why_is_american_television_obsessed_with.json": "高校生向けのクソ番組が多く、どれもセックスが多く、不適切な関係も多い。\n教師との不適切な関係も多い。それとも\n20代前半とか？",
  "data/reddit-ask/r/AskHistorians/comments/p9j8ow/did_ethnic_etruscans_retain_their_culture_after.json": "私はエトルリア人について調べています。\nローマに征服された後、すぐに彼らについての話をやめてしまうことに気がつきました。\n彼らは独自の文化を持っていました。彼らは独自の文化を持っていて、それは一夜にして消えてしまったわけではないと思うのですが。\n一夜にして消えてしまったわけではないでしょう？",
  "data/reddit-ask/r/NoStupidQuestions/comments/p9o9ib/does_anyone_else_feel_embarrassed_when_their.json": "私はわざとフロントガラスのワイパーの速度を道路を走っている他の人に合わせるようにしています。\nたとえ雨で目がくらむような状態であってもです。誰かこのようなことをする人はいますか？\nそれとも、雨を怖がっている猫のように見えるのが怖いのでしょうか？",
  "data/reddit-ask/r/askphilosophy/comments/p9hlpj/what_is_a_favorite_color.json": "タイトル 好きな色」を持つということはどういうことなのか？好みはどのように\nは、正確に言えばクオリアと関係があるのでしょうか？誰かが「色yより色xが好き」と知っていることから、どんな意味のある情報が得られるのか\n誰かが「色yよりも色xが好き」ということを知ることで、どんな意味のある情報が得られるのでしょうか？好きな色を一つに絞ることは可能でしょうか。\n好きな色を一つに絞ることは可能でしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p9w685/do_any_other_guys_find_it_weird_to_call_women.json": "ただ、私には不思議な感じがします。\"かわいい \"というのは、子猫やウサギ、子供などに使う言葉です。\n子猫やウサギ、子供などに使う言葉です。大人の女性に惹かれていることを「かわいい」という言葉で示すのは\n\"かわいい \"という言葉で大人の女性に惹かれていることを示すのは、ちょっと間違っていると思うんですよね。",
  "data/reddit-ask/r/AskHistorians/comments/p9vvhd/why_did_mao_fail_to_introduce_an_alphabetbased.json": "最近知ったのですが、毛沢東は中国の文字体系の改革を支持していたようです。\n第二次世界大戦後の識字率向上のために、毛沢東は中国の文字体系をラテン語やキリル文字に改革することを支持していた。\n第二次世界大戦後の識字率向上のために、毛沢東は中国の文字体系をラテン語やキリル文字に改革することを支持していた。\nスターリンなどが彼を説得しようとした。\n\n私が毛沢東について知っているすべてのことは、私に信じさせてくれます...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/p9vzi3/my_wife_proposed_a_dissolution_should_i_counter.json": "5月11日、彼女からの誘いで2人でセックスをしました。5月12日、彼女は私に\n解散したいと言ってきました。5月13日、彼女は家に書類を持ってきて記入しました。\n5月14日、彼女は「しばらく女性と付き合ってみる」と言いました。\n\n私たちは2015年から付き合い、2018年から結婚しています....",
  "data/reddit-ask/r/askscience/comments/p9vmal/how_is_it_that_covid19_booster_vaccines_help.json": "私は少し混乱しています。\n\n私の理解では、バリアントは、ワクチンから作られる抗体とは「見た目」が違うので\nワクチンから作られた抗体とは「見た目」が違うので、結果的にワクチンが\nその結果、ワクチンはそれほど効果的ではないということです。\n\nそれなのに、なぜ3回目のワクチンを接種すると、デルタのような亜種に効果があるのでしょうか？\nデルタのような変種には...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p9xlhk/is_this_what_being_an_adult_is_meant_to_feel_like.json": "私は自分の仕事が好きです。私は自分の仕事を楽しんでいます。私は8:00-16:00に働いています。\n\n仕事を終えて、ジムに行って、ジムを終えて、家に帰って、夕食を作った時には、もう19:00です。\n夕食の準備をすると、もう19:00になってしまいます。何かをする気力もありません。\n何もする気力がありません。\n\n仕事が終わって友達と遊んでいる人を見かける。一緒に食事に行ったり...。",
  "data/reddit-ask/r/AskHistorians/comments/pa13hj/monday_methods_the_new_qing_turn_and_decentering.json": "始める前に一言。このマンデー・メソッドの記事はに行くために書かれています。\nこの記事は、8月26日午後5時から6時（PST）に開催されるReddit Talkイベントに合わせて書かれたものです。\np.m., PST. タイムゾーンの変換を含む詳細は、イベントの最後に記載されています。\nこの記事の最後に記載します。\n\n\nはじめに\n\n多くの学生や愛好家が...",
  "data/reddit-ask/r/AskWomen/comments/pa7yd8/women_when_have_you_ever_seen_a_man_you_werent.json": "あなたは、男性が他の人に「間違っているからやめた方がいい」と言うのを見たことがありますか？\nあなたとの関係が原因ではなく、間違っているからだと。",
  "data/reddit-ask/r/AskHistorians/comments/pa4tgp/the_earliest_discovered_preserved_cheese_was.json": "世界最古のチーズのソース。\n[https://www.usatoday.com/story/tech/2014/02/25/worlds-oldest-cheese/5776373/]",
  "data/reddit-ask/r/NoStupidQuestions/comments/pa0hpd/are_americans_really_as_bad_at_geography_as_the.json": "YouTubeでは、アメリカ人が世界地図の国名を判別できないという動画をよく見かけます。\nYouTubeでは、アメリカ人が世界地図の国名を判別できないという動画をよく見かけます。\n\n私はいつも、これは単にビデオが馬鹿の中の馬鹿を選んでいるだけだと思っていました。\nそれとも実際に地理の知識がないのでしょうか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pa6cq4/why_is_it_socially_acceptable_to_body_shame_men.json": "性差別的な意味で言っているのではありませんし、男性でも女性でも何でもない人が体を辱められるべきではありません。\n女性であろうと何であろうと しかし、特にソーシャルメディアでは、明らかに二重基準があることに気がつきました。\n特にソーシャルメディアでは、明らかに二重基準があることに気づきました。\n\n男性が体を辱められても、普通はジョークとして流されますよね？なぜでしょう？",
  "data/reddit-ask/r/AskWomen/comments/pa7ndg/what_is_the_biggest_myth_that_you_grew_up_with.json": "私にとっては、「あなた（女性）の初めてのセックスはとても重要で、人生を左右する\n人生を左右する」。史上最大のクズです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pacek0/why_have_the_proud_boys_not_been_declared_a.json": "カナダではすでにテロリストと認定されているのに、なぜアメリカでは認定されないのか？彼らは\nペイントボールで人を撃ちまくったり、人を殴ったり、物を壊したりします。\nまた、他の過激派グループと同じような意見を持っています。なぜこれまで\nなぜ今まで起きなかったのでしょうか？彼らは基本的に新しいKKKです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pa7cnc/how_can_i_get_my_younger_brother_to_stop_using.json": "私の弟（13歳）は、意味もわからずに性的なジョークを多用しています。\n意味を知らずに 笑えますが、やめさせようとしています。\nやめさせようとしています。\n\n彼は「69 nice」、「That's what she said」、「Your mom」/「Doing your mom」などを使っています。\nmom \"を使っています。\n\n私はどのような戦略を使えばいいのでしょうか...",
  "data/reddit-ask/r/AskHistorians/comments/pa31vn/ac_odyssey_states_that_spartan_men_had_to_marry.json": "Googleはあまり役に立たない。ペロポネソス戦争のスパルタについて書かれています。\nそれが重要なら",
  "data/reddit-ask/r/TooAfraidToAsk/comments/paafsa/do_all_women_in_their_early_30s_go_through_a_type.json": "私は33歳ですが、最近はほとんど発情しているように感じています。私の体は魅力的な男性/女性に物理的な反応をしています。\n魅力的な男性や女性に身体が反応してしまい、彼氏の注目を浴びることができません。\n十分ではありません。これは普通のことなのでしょうか？私の体は子供を欲しがる年齢になっているのでしょうか（そんなことはありませんが\nしない）年齢なのでしょうか？) セックスしたい、セッ○スしたい、と思うのはほとんど苦痛です。",
  "data/reddit-ask/r/AskHistorians/comments/pa20cv/so_two_frankish_knights_and_a_bishop_walk_into_a.json": "様々な敵意や固定観念を持った異なる文化が共存していると\n互いの敵意や固定観念を持った異なる文化が一緒に暮らすと、必然的に互いの特徴や風刺画が生まれ、ジョークの材料になります。\nジョークのネタになるようなお互いの風刺画が生まれます。例えば、遅いエストニア人\n鈍いエストニア人、鈍いフィンランド人、素直で世間知らずの自分たち......。",
  "data/reddit-ask/r/TrueAskReddit/comments/pa4akn/to_what_extent_should_we_put_the_burden_of_saving.json": "これはメディアでよく見られることですが、彼らは大企業であるにもかかわらず、なぜか気候変動や汚染を認めています。\n大企業であるにもかかわらず、気候変動や汚染を認めています。\nしかし、その解決策は私たちが達成しなければならないものであるというニュアンスが常に含まれています。\n- 車の運転を控えてガスの発生を抑えたり、流し台から離れないようにしたり...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/paamp2/is_it_okay_to_be_hurt_over_my27f_boyfriend33m.json": "数週間前、私の彼氏がonlyfansに登録していることを知りました。\n彼の携帯を見ていたら、課金のテキストが出てきました。\n彼は何度も何度も言っていましたが、まるで私が何のための課金なのかわからないように\nのです。私はとても傷つきました。数ヶ月前、彼は自分のメールを見ていて...",
  "data/reddit-ask/r/AskHistorians/comments/pa7j6t/should_the_majority_of_latin_american_countries.json": "スターリン率いるソビエト連邦は、東欧に共産主義政権を樹立した。\nフルシチョフとブレジネフは、これらの国が依然として共産主義であることを確認しつつ、国家に対する規制を緩和しました。\n国家に対する規制を緩和した。しかし、彼らはハンガリー、ユーゴスラビア、ポーランドへの侵攻を開始した。\nしかし、共産主義やワルシャワ条約加盟国が...と思ったときには、ハンガリー、ユーゴスラビア、ポーランドに侵攻しました。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/paklw6/why_arent_women_who_falsely_accuse_men_of_rape.json": "この記事を詳しく説明する前に、私が言ったことを文脈から切り離さないでください。私は決して\n私は決してレイプという凶悪犯罪の重大性を軽視しようとしているわけではありません。\nレイプは最低で堕落した犯罪であり、レイプ犯は最悪の方法で殺されるべきだと思います。\nレイプ犯は最悪の方法で殺されるべきだと思います。そうは言っても、いつも気になっていたのは...",
  "data/reddit-ask/r/askscience/comments/pag9fm/do_we_have_any_studies_on_reinfection_rates_with.json": "どなたかご存じの方はいらっしゃいますか？ありがとうございます。",
  "data/reddit-ask/r/AskHistorians/comments/pai9ke/how_did_ancient_egypt_maintain_such_a_consistent.json": "第3王朝のこの作品のように。\nhttps://www.almendron.com/artehistoria/wp-content/uploads/2014/12/egipto-cat-018-250x443.jpg\n\nは、プトレマイオス朝のこの作品と非常によく似ています...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pap1jf/if_being_transgender_isnt_about_gender_roles_then.json": "最近、トランスジェンダーについての本を少しずつ読んでいます。\nトランスジェンダー。気づいたことは、ほとんどのトランスジェンダーの人が、自分がシスではないことに気づいていたという事実です。\n子供の頃から自分がシスではないことを知っていたと言いますが、どうやって知ったのかと聞かれると\nと聞かれると、MtFの人たちは「えっと、...」と答えることが多いです。",
  "data/reddit-ask/r/askscience/comments/pap5ym/do_caterpillars_have_stomachs.json": "3歳の子供が聞いてきたのですが、グーグルで調べても信頼できる答えは見つかりませんでした。\nと思います。私はそう思うのですが、答えがないということは私も気になります。\nしています。何か助けになることがあれば、ぜひ教えてください。ありがとうございました。",
  "data/reddit-ask/r/askscience/comments/pao1b7/if_i_release_an_ant_back_outside_can_it_find_its.json": "くだらない質問だったらごめんなさい。蟻を外に放してしまったのですが\nこれからどうなるのか気になります。\n\n編集：何が起こっているのかわかりません。コメントが15件あると表示されていますが\n4つしか見えません😢。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pangz2/why_do_people_say_that_violence_isnt_the_answer.json": "最初に言っておきますが、私は暴力を支持していませんし、暴力が正当化されるのは\n暴力が正当化されるのは、スポーツ（ボクシングや格闘技）や自衛のためだけだと思います。",
  "data/reddit-ask/r/NoStupidQuestions/comments/paqoy1/is_student_loan_really_that_common_in_america.json": "私はインド人ですが、皆さんが学生ローンを持っている、あるいは持っていたとしても、それが冗談なのか本気なのかわかりません。\n私はインド人ですが、皆さんが持っている、あるいは持っていた学生ローンについて、冗談なのか本気なのかわかりません。",
  "data/reddit-ask/r/AskHistorians/comments/pamfct/russias_colonization_of_siberia_makes_little_sense.json": "いろいろな人が同じことを言っているのを聞いたが、東のほとんどのハン国が北への進出をしなかったのは\n東部のほとんどのハン国は、補償が少なかったため、それ以上北に進出しなかった。\n\nしかし、ではなぜロシアはそんなことをしたのか？つまり、ほとんどの人は「できたから」と言うでしょう。\nしかし、それならば、なぜ他の国は......。",
  "data/reddit-ask/r/AskHistorians/comments/pat42b/i_was_taught_that_zwarte_piet_black_pete_was.json": "私はそれが見た目ほど不快なものかどうかわからなかったので調べてみました。\n特に、黒い顔が実際の黒い顔なのか、それとも（私が教わったように）煤（すす）のつもりなのか。\n煤（すす）だと思われていたのか（私はそう教わりました）。\n\nwikipedia [https://en.wikipedia.org/wiki/Zwarte_Piet#Origins]の記事では\nの記事では、もっとひどいことになっているようですが....",
  "data/reddit-ask/r/AskHistorians/comments/pakuv6/was_the_sikh_empire_noticeably_nicer_than.json": "現在、世界の一部の地域では、シク教徒は寛大で親切だという評判があります。\nそれは帝国にも当てはまるのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/pat4u3/pliny_the_elder_reported_that_two_indians_washed.json": "ローマ人はこの時代、インドに精通していましたが、そのような人たちが\nインドの船がアフリカを回って北海に入ったとは考えにくい。\n\nイヌイットや他のアメリカ・インディアンのグループが旅するには、それほど遠くはないでしょうが\nイヌイットや他のアメリカンインディアンのグループが旅をするにはそれほど遠くはないでしょうが、ローマ人が同じように...というのはおかしいですね。",
  "data/reddit-ask/r/AskHistorians/comments/paxz6x/im_a_crotchety_old_man_in_the_1700s_what_do_i.json": "携帯電話が社会的孤立や利己主義の原因になっていると言われていますよね。\n少し前の新聞では、公共の場での社会的な会話から「気をそらす」と書かれていたのに\n公共の場での会話の妨げになるからです。ノートパソコンは、本を台無しにし、子供たちが字を書けないと非難されています。\nノートパソコンは本をダメにしたと言われ、子供たちは字を書くことを知らないと言われ、紙が使えるようになったのは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/panki8/why_is_the_western_world_so_supportive_of_the.json": "肥満は決して良いことではありません。これは紛れもない事実ですが、欧米諸国では\nそうでないと言う人を批判します。わざわざ太った人を辱めるようなことを言うつもりはありません。\n太っている人をわざわざ辱めるようなことを言うつもりはありませんが（それは残酷です）、そのようなライフスタイルを支持する人もいないはずです。\nそのようなライフスタイルを支持すべきではありません。寿命が短くなる...。",
  "data/reddit-ask/r/AskHistorians/comments/pampi8/did_catharismthe_cathar_heresy_actually_exist.json": "トム・ホランドの『ドミニオン』では、カタル派の思想は、日本の伝統的な宗教とは異なるものである可能性が高いと述べています。\n教会が作り出したものである可能性が高いと述べています。これは\n歴史的なコンセンサスなのでしょうか？実際には何が起こっていたのでしょうか？",
  "data/reddit-ask/r/TrueAskReddit/comments/paq50q/what_is_the_next_step_if_you_suspect_being_slowly.json": "私（28F）は、同居人（23F）に毒殺されたのではないかと疑っている。\n解決できない問題があったので、いつまでも口をきかないという方法をとった。\n私たちは食べ物を置いておく場所を共有していて、私は食べ物を食べた後にいつも気分が悪くなることに気づきました。\n私の食べ物を食べた後、いつも気分が悪くなるのですが、それはありませんでした...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pavo3z/do_guys_like_being_called_handsome_or_cute.json": "私はbumbleで男の人にメッセージを送ろうとしています😩 あなたの意見を聞かせてください、または男の人がこれを好きではないならば\nこれが好きなんだよね",
  "data/reddit-ask/r/askscience/comments/pb8wjv/askscience_ama_series_hi_reddit_im_a_critical.json": "こんにちは、Redditors! 私の名前はMarc Mossです。この20年間、私は\nストレスがクリティカルケアナースやその他の医療従事者に与える影響を研究しています。\n私はこの20年間、クリティカルケア看護師をはじめとする医療従事者のストレスの影響を研究しています。\n\nまた、私はコロラド大学アンシュッツ・メディカル・キャンパスの医学部教授で、呼吸器系の部門長を務めています。\nまた、私はコロラド大学アンシュッツ・メディカル・キャンパスの医学部教授であり、呼吸器系の部門長でもあります...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pb9b6k/am_i_controlling_for_wanting_my_girlfriend_to.json": "参考までに、私たちは20代半ばで、約9年間付き合っています。彼女は\n以前はタバコを吸っていましたが、6年ほど前にやめました。最近、彼女に新しい友人ができました。\n(最近、彼女は新しい友人（全員喫煙者）を作り、ストレスの多い新しい仕事を始めました。彼女が密かにタバコを吸っていたことを知ったのは\nたまたま見つけたので、こっそり吸っていたことがわかりました。私は、このような気持ちになりました...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pb8yp3/has_anyone_ever_gone_out_to_a_bar_and_ended_up.json": "近いうちに旅行でゲイバーに行ってみようと思っているのですが、その時に思ったのが\n誰かと付き合ってしまったらどうしよう？\"と考えてしまう。\n\nでも、実際にはどれくらいの頻度でこのようなことが起こるのでしょうか？",
  "data/reddit-ask/r/askscience/comments/pb9l1d/how_is_the_effectiveness_of_the_vaccines_waning.json": "気になっていたのですが、どうしてそれがワクチンを無効にするのか理解できませんでした。\nワクチンが効かないのに、症状が軽減されるなんて。",
  "data/reddit-ask/r/askscience/comments/pb2gzx/since_titans_atmosphere_is_mostly_methane_what.json": "大気中の酸素が不足しているだけなのか？もし、大量の冷凍酸素を含んだ彗星が\n凍結した酸素を大量に含んだ彗星が、タイタンに高速で衝突したら？基本的には\nタイタンのガスを爆発させる最も簡単な方法は何か？それは可能なのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/pbae3p/kind_of_a_stupid_question_but_what_would_a_front.json": "第1次世界大戦は塹壕戦でイメージしやすいですが、第2次世界大戦の前線はどのようなものでしょうか。\nの前線はどのようなものでしょうか？もちろん、様々な例があり、様々な答えがあるでしょう。\nしかし、ここではドイツとソビエト、そして後にドイツと連合国がフランスで戦った時の前線を例に挙げてみましょう。\nドイツとソビエト、その後のドイツと連合国のフランスの前線を例に挙げてみましょう。\n\n例えば、私は...",
  "data/reddit-ask/r/askphilosophy/comments/pb4jo6/philosophy_of_mind_question_when_we_describe_the.json": "イルカ、チンパンジー、カラス、タコなどの動物には、これまでにない高度な推論や問題解決能力があることはよく知られています。\nイルカ、チンパンジー、カラス、タコなどは、他の動物にはない高度な推論や問題解決能力を持っています。\nイルカ、チンパンジー、カラス、タコなどは、他の動物にはない高度な推論や問題解決能力を持っていることはよく知られている。このような行動があるからこそ、人間はここまで成功したのです。\n人間はこのように成功してきました。しかし、人間の偉業を語るとき、...",
  "data/reddit-ask/r/AskWomen/comments/pazw5m/women_who_walked_away_from_professional_careers.json": "法律事務所やハイテク企業などでは、若手のうちは女性が多いのですが、上級者になると女性は少なくなります。\n下級生に女性が多く、上級生になると少なくなります。\n女性はヒエラルキーの一番上では稀です。去っていった女性たち - あなたのストーリーは何ですか？\nストーリーは？\n\n編集部：あなたの意思決定にとても興味があります...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pbdrf1/why_is_the_us_government_asking_china_to_accept.json": "イスラム教徒を大量虐殺している国に、イスラム教徒の難民を受け入れろというのは、かなり危険な気がします。\nイスラム教徒を大量虐殺している国に",
  "data/reddit-ask/r/askscience/comments/pbhybc/studies_from_2003_in_china_showed_that_80_of_the.json": "https://pubmed.ncbi.nlm.nih.gov/15061910/\nhttps://pubmed.ncbi.nlm.nih.gov/14561956/\nhttps://pubmed.ncbi.nlm.nih.gov/15663874/\n\n私の限られた理解では、これはSARS-1がこれらのリスクグループで早期に検出されずに広がり、変異する機会があったことを示している。\nこれは、私の限られた理解では、SARS-1がこれらのリスクグループで以前から検出されずに広がっていて、変異するチャンスがあったということです。\n\n私はそのようなものを見つけることができません...",
  "data/reddit-ask/r/AskHistorians/comments/pbgc53/the_majority_of_supreme_court_justices_appointed.json": "アメリカの歴史を振り返ると、大多数の\n[https://www.pewresearch.org/fact-tank/2017/03/20/what-backgrounds-do-u-s-supreme-court-justices-have/]\n最高裁判事の大半は選挙で選ばれた職に就いていますが、少数（4分の1以下）は\n連邦控訴裁判事を務めたことのある者は4分の1以下である。多くのSCOTUS判事は...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pbn4v1/i_cant_cum_with_my_girlfriend_why.json": "彼女にフェラチオや手コキを何度かされたことがあるのですが、その度に\n終わることができません。ほとんどの場合、自分で自慰行為をして終わります。\n自分でオナニーして終わることが多いのですが、それにしても一人でオナニーしている時よりもずっと手間がかかります。\nひとりでオナニーをするよりもはるかに手間がかかります。私は彼女のフェラチオや手コキを楽しんでいますし、私たちは試しました...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pbl1p5/what_are_the_chances_the_onlyfans_porn_ban_and.json": "彼らは、このアイデアを大々的に宣伝し、支払い業者に、このようなアイデアに対する反発がいかにひどいかを示しました。\nそして、彼らのすべてのモデル（現在と未来）に、このようなアイデアに屈することはないということを示しました。\nTumblrのように決済業者に屈することはないとわかっているということを\nがしたように。そして、彼らがしなければならなかったのは、いくつかの声明を出して...",
  "data/reddit-ask/r/AskWomen/comments/pbobsp/what_outrageously_misogynistic_incident_or.json": "時には思いもよらないところからやってくる。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pbtboy/is_it_okay_to_attend_christian_events_as_an.json": "私は大学に入学したばかりで、新しい友達を作るのに苦労しています。\nキリスト教系のクラブがキャンパスでチラシを配っていて、新入生向けのイベントをやっていて\n無料の食べ物や賞品を提供するイベントを行っています。先週は、お互いを知るためのミーティングがありました。\n先週、彼らはお互いを知るためのミーティングを行い、私はスナックの袋（ジュース、...）を獲得しました。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pbq8ow/why_is_los_angeles_and_las_vegas_pronounced_the.json": "私の知っている人は皆、\"los \"と \"las \"を同じように発音しています..... でも、なぜでしょう？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pbxfvl/isnt_shaming_men_for_being_virgins_actually.json": "奇妙に聞こえるかもしれませんが、聞いてください。私は南アジアのイスラム教国の出身です。\nredditで気付いたことの一つは、西洋社会の男性は処女を失うことに大きなプレッシャーを感じているということです。\n童貞を捨てなければならないという強いプレッシャーを感じています。童貞という言葉は、実際に\n侮辱として使われることが多いです。侮辱の例としては、「He...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pbwr2f/do_you_look_people_in_the_eye_as_you_walk_by_them.json": "これは私が今までにした質問の中で最も愚かなものかもしれません。\n\nあなたは通り過ぎるとき、人の視線を受け止めますか？存在しないかのように振る舞っていますか？\n存在しないように振る舞いますか？視線が合ったら、すぐに目を見開きますか？\n\n視線を合わせることは、動物界の多くの人々と同じように、難しいことのように感じます。\n動物界でもそうです。私は...",
  "data/reddit-ask/r/askscience/comments/pbt56u/does_the_moon_other_planets_experience_earthquake.json": "誰かがr/moon [/r/moon]で、月に地震があるかどうかを質問しました。\nそれを見て、他の惑星（月も？\n地震はあるのだろうか？",
  "data/reddit-ask/r/askscience/comments/pbx1gg/why_is_gravity_stronger_in_the_ocean_than_on_land.json": "この\n[https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2015/04/bouguer_gravity_anomaly/15360623-1-eng-GB/Bouguer_gravity_anomaly.jpg]\n重力異常の地図を見ると、すべての海はすべての陸地よりも重力が大きいことがわかります。\n陸地よりも海の方が重力が大きいことがわかります。これは、陸地の方が標高が高いからでしょうか？水は密度が低いので...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pbyfsf/do_people_actually_have_sex_under_blankets.json": "毛布をかぶった男がセックスをしている広告を見た。実用的ではないようです。",
  "data/reddit-ask/r/AskHistorians/comments/pbyvol/what_documents_do_historians_have_now_that_gibbon.json": "私の理解では、ギボンの著作はかなり長い間、この問題に関する事実上の本だった。\nしかし、何百年もの時を経て、今では理解できるようになりました。\nしかし、数百年の時を経て、さらに研究を重ねると、当然のことながら、少し時代遅れになっているようです。\n\nもちろん、彼には炭素年代測定法のような技術はなかっただろう。\n水中の難破船...",
  "data/reddit-ask/r/AskHistorians/comments/pc4li5/why_didnt_the_united_states_manifest_destiny.json": "高校では、「明白な運命」という考え方によって、アメリカは1800年にカリフォルニアに到達するまで西への征服を続けたと習いました。\n西へ西へと征服を続け、1800年代にはカリフォルニアに到達した。\nなぜ彼らは北極まで北上しなかったのでしょうか？\n\n最近見た記事では、カナダの人口のほとんどがアメリカとの国境沿いに住んでいて\nアメリカとの国境沿いに住んでいて",
  "data/reddit-ask/r/NoStupidQuestions/comments/pcbhbn/what_prevents_girls_filling_up_with_water_when.json": "Tik tokのビデオを見て以来、ずっと疑問に思っていた馬鹿げた質問の一つです。\n疑問に思っていました。\n\n女の子はプールに飛び込むと水でいっぱいになりますか？\n\nそれを防ぐ方法は？\n\n実際に水が入ってきたらどうなるの？\n\n私たちのお尻の穴はどうなるの？\n\n性的に知りたいです(笑)",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pcbxfq/do_people_with_curly_hair_also_have_more_curly.json": "どうやってこの質問にたどり着いたのかわかりませんが、今は気になっています。",
  "data/reddit-ask/r/AskHistorians/comments/pc1e9y/why_is_coffee_culture_so_heavily_based_on_italian.json": "カプチーノ、カフェラテ、エスプレッソなど、多くのコーヒー飲料がなぜイタリアに起源を持ち、命名されているのか興味があります。\nカプチーノ、ラテ、エスプレッソなど、多くのコーヒー飲料がイタリアに起源を持ち、その名前が今日まで続いているのはなぜか。\nそして、それらの名前がどのように今日まで続いているのか。私が見つけた最も良い答えは、イタリアがヨーロッパに初めてコーヒーを輸入した国だということでした。\nイタリアがヨーロッパに初めてコーヒーを輸入したというのが一番の答えでしたが、それだけでは...。",
  "data/reddit-ask/r/AskHistorians/comments/pccaqc/before_european_contact_did_the_native_hawaiians.json": "私の理解では、ハワイはポリネシアから1〜2回の波で移住してきたと考えています。\nその後、キャプテン・クックが到着するまで、ハワイは独自の小さな生態系を形成していました。\nキャプテン・クックが到着するまで、ハワイは独自の生態系を保っていたと理解しています。\n\n最初の入植からヨーロッパ人との接触までの間、ハワイの人々はアジアや......などの文化的記憶を持っていたのでしょうか？\nハワイの人々はアジアやヨーロッパの文化的な記憶を持っていたのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pcmuov/why_do_men_like_to_ejaculate_on_a_womans_face.json": "それはあなたが彼女の顔や美しさなどに惹かれているからなのか、それとも、あなたがそのようなことを言っていることに支配的なレベルがあるからなのか。\n彼女の顔に自分の種をぶちまけているという事実に支配力があるのでしょうか？知りたいですね。\n知りたいですね。\n\n皆さん、ご回答ありがとうございました。今夜もセックスしてきます!",
  "data/reddit-ask/r/NoStupidQuestions/comments/pcevq1/if_someone_who_has_had_plastic_surgery_dies_would.json": "終わった後の骸骨にぶら下がっている人の胸のインプラントのイメージが頭から離れない。\nぶら下がっているイメージが頭から離れません。\n\n私はそれを失っています......誰かの肉が注射の後に腐るのはどうなるのでしょうか？\n腐っていくのか？骨の上で皮のスープのようになってしまうのでしょうか？それとも\nオリーブオイルのように分離するのか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pcouqd/why_do_i_want_to_punch_jake_paul_in_the_face.json": "私は大人なので、彼のコンテンツを見たことはありませんが、先ほどGoogleニュースで彼の写真を見て\nGoogleのニュースで彼の写真を見て、その気持ちに圧倒されました。\n殴りたくなりました。",
  "data/reddit-ask/r/askscience/comments/pcl2nr/askscience_ama_series_were_marine_scientists.json": "私たちは、スペインの調査船「Sar」に乗船している科学者と技術者のチームです。\nスペインの調査船サルミエント・デ・ガンボア号に乗船し、カーボ・ベルデの深海生態系を探る4週間のクルーズを行っています。\nカーボベルデの深海生態系を探索する4週間のクルーズです。\n\n船上には、遠隔操作車両（ROV）「Luso」、自律型水中ロボット（AUV）「Autosse」があります。\nAUV（自律型水中ロボット）Autosub6000、3...",
  "data/reddit-ask/r/AskHistorians/comments/pcm80d/question_about_ye_olde_timey_cuisine_when_did.json": "ソルトとペッパーは、いつ、どのようにして、西洋料理には欠かせない2つの調味料になったのでしょうか？\n西洋料理には欠かせない調味料です。他の料理でも同じように使われているのでしょうか？\n\n防腐剤としての役割や入手のしやすさを考えると、塩が主食になるのはわかります。\n.... でも、なぜコショウ？ヨーロッパ原産の植物ですか？それは...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pcsscp/can_pre_cum_get_a_girl_pregnant.json": "検索はあちこちで行われています。誰も知らないような気がします。皆さんはどう思われますか？\n皆さんの考えは？\n\n編集：いや、みんな、挿入してないよ。コンドームがなかったので、グラインドに徹しました。\nオーラルなど。私が尋ねたのは、グラインドでのプレザーメンのためでした。ただ、私は\nその前の精液の可能性があるかどうかを知りたかったのです...。",
  "data/reddit-ask/r/askscience/comments/pcnjor/does_exposure_to_covid19_after_vaccination_extend.json": "私の理解では、予防接種による免疫は時間の経過とともに低下します。\nだからこそ、（少なくともファイザーにとっては）ブースターショットが提供されるのだと思います。\nしかし、もしワクチンを接種した人が、接種後しばらくしてから公共の場に出かけるようになったとしたら\nしかし、ワクチンを受けた人が、ワクチンを受けた後しばらくしてから、公共の場に出て行くようなことがあれば...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pcs2h8/if_every_cell_in_your_body_is_replaced_in_7_years.json": "私たちの皮膚の間にあるインクの粒子であることは理解していますが、タトゥーの隣にあるすべての細胞が入れ替わった後、少なくとも極端に変形しないのはなぜでしょうか？\n少なくとも、タトゥーの隣にあるすべての細胞が入れ替わった後は、極端に変形しないのでしょうか？",
  "data/reddit-ask/r/askscience/comments/pcytlw/why_do_some_organs_come_in_pairs_and_others_are.json": "左右対称になるメカニズムは、どのような器官のペアでも同じなのでしょうか？\n臓器のペアでも同じですか？片方しかない臓器ではなぜそうならないのか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pcxfhn/i_am_ashamed_to_have_this_thought_but_is_it_wrong.json": "残酷なことかもしれませんが、誰にも危害を加えてほしくないのですが\nワクチンを接種したものの、他の致命的な病気にかかってしまった人が、反ワクチン主義者のせいで急にケアが必要になり\nワクチンを打たなかったからといって、反ワクチン主義者が急に治療を必要としたために、他の致命的な病気にかかった人たちが早く帰らなければならないことに腹が立ちます。\nワクチンを打たなかったからといって、反ワクチン派が突然治療を必要とするからです。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pd1i6o/does_anyone_else_see_the_d_in_disney_as_a.json": "子供の頃からずっとGが逆になっているように見えていて、Dだとわかっていても\nDだとわかっていても、Gが見えてしまうのです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pd3tnm/where_can_i_find_help_with_paying_for_suicide.json": "ここで質問していいのかわかりませんが、この問題を解決するためにかなり必死になっています。\n解明したいと思っています。夫が寝室で命を落とし、私は基本的な掃除をすることができましたが\n基本的な掃除はできましたが、それだけでは不十分で、この暑い時期には臭いがきつくて\n臭いがきつすぎます。\n\n私は部屋の適切な危険な清掃が必要です...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pcusrg/is_the_usa_a_source_of_invasive_species_in_other.json": "アメリカでは、アジアンコイ、ロシアンアザミ、チャイニーズエルムなどが大量に発生しています。\nアメリカでは、アジアンコイ、ロシアンアザミ、チャイニーズエルムなどがありますが、他の国では、アメリカ発の外来種があるという話は聞いたことがありません。\nアメリカ",
  "data/reddit-ask/r/NoStupidQuestions/comments/pcxn9u/where_do_i_find_nice_porn.json": "どのAVサイトに行っても、「ラフ」や「マレガシ」の動画が多い気がします。\n誰が見ても違和感がないような動画があるサイトはありますか？\nいるサイトはありますか？\n\n参考になればと思いますが、私はバイの男性です。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pcv0cp/do_straight_women_get_turned_on_by_guys_butts.json": "edit: また、どのような方法で彼らを興奮させるのでしょうか？彼らは何を想像しているのでしょうか？\nといったところでしょうか。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pcqh1u/i_am_23_i_finally_made_my_first_10k_month_i_work.json": "1ヶ月でこれだけの金額を稼いだのは、私の人生で初めてのことです。\n同時に、これまでの人生で最も多く働いたことにもなります。60時間労働\n週に60時間、月に240時間。\n\n年収7万円の友人を見ても、彼らは毎日9時から5時まで働いているんだ。\n毎日、9時から5時まで働いています。それ以外にも...。",
  "data/reddit-ask/r/AskHistorians/comments/pcx5fr/as_a_liege_lord_why_would_i_wall_in_my_daughter.json": "イタリアとデンマークの2つの城を訪れた私は、世紀を超えてヨーロッパを横断する2つの驚くほど似通った\n100年以上の時を経て、ヨーロッパを横断する、驚くほど似通った2つの物語に感動しました。地方の有力者の若く美しい意志の強い娘が\n地域の有力者の娘が、政治的に決められた結婚を拒否します。それは\n彼女は馬小屋の少年に恋をしており、おそらく...",
  "data/reddit-ask/r/AskHistorians/comments/pcpyx5/is_the_term_indigenous_meaningful_to_historians.json": "最近、「マオリ：ニュージーランドの先住民族」というタイトルの人気記事を目にしました。\nという記事を見て、この言葉が気になりました。最初は、どこかの地域に最初に入植した人類に対して使っているような気がしますが\nその地域に最初に移住してきた人類に対して使う言葉のように思えますが、「The Vikings: indigenous people」とは言わないと思います。\n\"The Vikings: the indigenous people of Iceland\" とは言わないと思います。\nでは、これは...。",
  "data/reddit-ask/r/AskHistorians/comments/pcyxby/was_there_a_real_life_equivalent_to_dungeons_and.json": "テーブルトップのロールプレイングゲームでは、冒険者のパーティが各地を旅して、クエストをこなしていきます。\nあちこちを旅して、クエストをこなしていきます。ダンジョンを探検したり、モンスターを狩ったり\n時には、見つけたものすべてを殺して略奪することもあります。\n(Murder Hobos」と呼ばれています。)\n\n過去には......ありましたか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/pd9lf4/why_is_learning_you_were_an_accident_such_a_big.json": "大騒ぎする人たちを見てきましたが、もし自分が事故に遭ったと言われたら、私は\n自分が事故に遭ったと言われたら、「そうか」と納得して、子供も欲しくないと思うでしょう。\n\n何も変わらない、少なくとも私個人への影響は皆無だろう。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pdblat/is_it_weird_to_watch_exclusively_lesbian_porn_as.json": "私はレズビアンのAVしか見ません。ストレートのポルノも、女性向けの「ロマンティック」なものも試してみましたが\n楽しんだことはありません。自分のセクシュアリティに疑問を持ち始めました。\n自分のセクシュアリティに疑問を持ち始めましたが、自分が女性とセックスしたいとは100％思っていません。でも、男性に惹かれるのは確かです。\nしかし、私は男性に惹かれていると確信しています。なぜなら、片思いの相手とキスしたいと思うからです。このようなことはありませんか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pd9evx/does_sex_really_not_feel_good_for_women.json": "というわけで、私は男です。抗うつ剤を服用していますが、ご存知のようにこれは\nオーガズムを感じることができません。しかし、私はセックスが大好きで、パートナーを喜ばせることが大好きです。私は\nオーガズムに達しなくても気にしません、なぜならセックス自体が気持ちいいからです。\n\nしかし、私が話をする多くの女性は、反対の意見を持っていることに気づきました。彼女たちにとっては...",
  "data/reddit-ask/r/AskHistorians/comments/pcydbv/what_is_the_consensus_regarding_the_cias_alleged.json": "アメリカの調査報道ジャーナリストであるゲイリー・ウェブは、1996年に発表した一連の記事の中で\nアメリカの調査ジャーナリスト、ゲイリー・ウェブは、1996年に発表した一連の記事の中で、80年代後半に都心部で流行したクラックの蔓延にCIAが一役買っていると論じ、物議を醸した。\nこの記事は1996年に発表され、物議を醸しました。この記事は\n最終的には、記事を掲載した新聞社によって否定された。",
  "data/reddit-ask/r/askscience/comments/pd7bcr/is_there_a_known_correlation_between_having.json": "私はこのように（愚かな）考えました。皮膚は最大の器官であり、神経系は脳や体につながっている。\n神経系は脳と体につながっているので、特別に「神経系」を持っている人は、皮膚も「特別に神経系」になっているのではないかと思いました。\nだから、「神経質」な神経系を持っている人は、「神経質」な肌も持っているのでは？例えば\n肌トラブルが起こりやすいとか？\n\nいくつか知られていることはありますが...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pdaaly/if_someone_with_a_last_name_like_sargeant_joins.json": "ランクに対応した名前があることで、混乱はありませんか？I\n高校時代の知り合いにSargeantという名前の人がいて、「Sargeant Sargeant」の活躍を想像してみんなで笑っていました。\n\"Sargeant Sargeant \"の活躍を想像して笑っていました。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pdf33a/china_is_currently_the_largest_prosecutor_of.json": "どこかの国の国民がそのような標的になるのは当然だとは言いません。\nただ、興味があるだけです。\n\nエディット：PERSECUTINGであって、Prosececutingではありません。オートコレクトです。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pdgep3/when_americans_are_taught_geography_at_school_do.json": "誰かを怒らせるわけではありませんが、私の人生の中で、アメリカ人がアフリカから来た何かや誰かについて話すとき、彼らは国を特定しませんでした。\nアメリカ人がアフリカから来た人の話をするとき、国を特定しませんでした。\nアフリカが一つの国であることを意味しています。\n\n例えば、先日見たビデオでは、アメリカ人女性が「私のフィアンセはアフリカから来たのよ」と言って続けていました。\nはアフリカから来たのよ」と言って、続けて...。",
  "data/reddit-ask/r/AskWomen/comments/pdccze/how_would_you_feel_if_you_found_out_your_partner.json": "おまけの質問です。どのような理由であれば受け入れられ、逆であれば受け入れられないでしょうか？",
  "data/reddit-ask/r/askscience/comments/pdiz59/why_cant_fish_get_rabies.json": "皆さん、こんにちは。\n\n水族館好きで、狂犬病予防注射を2回受けています。私はいわば危険な生活をしてきました。\n生きてきました。しかし、皆さんに質問があります。\n\n近所の魚屋さんで、大きな魚（シクリッドだと思います）に刺されたオーナーと冗談を言い合っていました。\n大きな魚（シクリッドだと思います）に傷つけられたオーナーと冗談を言いました。狂犬病についての冗談を言ったら、彼はパニックになってしまいました...。",
  "data/reddit-ask/r/askscience/comments/pdle47/do_fully_vaccinated_people_who_still_get_covid.json": "ただ、完全にワクチンを接種した人の方が症状が軽いかどうかについての研究はあるのでしょうか？\n症状が軽いかどうかについての研究はありますか？私と私の娘は二重にワクチンを接種しており、両方の注射は\nモデナ",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pdqhan/has_humanity_gone_full_retard_or_has_the_internet.json": "最近のインターネットでは、どこを見ても、人々が知恵遅れのことを言ったりやったりしている映像が絶えません。\n自己認識や自己反省が全くないような知恵遅れなことを言ったりやったりしている人の動画をよく見かけます。\nコヴィドが発売されてから約2年が経ちますが、未だにコヴィドの存在を信じていない人がいます。\nQAnonグループは、ますます...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pdptjh/my_boyfriend_keeps_calling_me_slut_in_bed_but_i.json": "私の彼氏と私は去年交際を始め、数ヶ月間ベッドで過ごした後（セックスはしませんでしたが\n彼は私に、彼の尻軽女にならないかと聞いてきましたが、私はノーと答えました。\n彼は私を客観視したときだけ興奮すると言っていたので、私はイエスと答えました。でも\n今は本当に後悔していて、全然好きじゃないし、派生して...",
  "data/reddit-ask/r/AskHistorians/comments/pdbhou/were_there_ever_any_eras_in_which_humanity.json": "私たちは歴史上最も進んだ時代に生まれた」と多くの人が言いますが、私が考えたのは\n思うのですが、歴史上いつの時代に生まれたかに関わらず、どんな人でも\nそれぞれの時代の、それぞれの「最も進んだ時代」に生まれているのではないかと思ったのです。また\nそのような時代はあったのでしょうか。それは...。",
  "data/reddit-ask/r/AskHistorians/comments/pds7lt/how_did_people_in_the_medieval_era_imagine_the.json": "現代では、多くの人が未来に空飛ぶ車があると想像しています。\n空飛ぶ車や宇宙船があると想像している人が多いと思います。中世の人々がどのように未来を想像していたかを示す証拠はありますか？\n中世ではどうだったのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/pduaeo/what_was_cod_how_did_it_work_why_did_so_many.json": "ジョー・ポストマンは本当に通販で代引きをしていたのだろうか？\nまた、郵便局はどのようにして他の企業の現金の受け渡しをしていたのでしょうか？\n\n私が子供の頃、テレビの通販商品の広告には必ずと言っていいほど「代金引換不可」が明記されていました。\n私が子供の頃、テレビの通販商品の広告には必ずと言っていいほど「代金引換不可」と明記されていました。",
  "data/reddit-ask/r/AskHistorians/comments/pdu1i3/is_historical_pornography_considered_a_reliably.json": "例えば、70年代や80年代のAVでは、現在に比べて体毛の量が多い俳優がよく登場します。\n今と比べて体毛の量が多い。これは、当時の消費者がより毛深いものを好んだということなのでしょうか？\nこれは、当時の消費者がより毛深いものを好んでいたということなのか、それともポルノ業界の何かを反映したものなのか。",
  "data/reddit-ask/r/AskHistorians/comments/pdvv08/where_did_the_asians_sit_on_the_bus_during_the_us.json": "歴史の授業で忘れられているのが、アジア人とアジア系アメリカ人の歴史です。\n公民権運動のような歴史の頂点に立ったアジア人やアジア系アメリカ人の歴史です。例えば、公民権運動の時代。\nアジア人はバスのどこに座っていたのか？アジア人はバスのどこに座っていたのか、隔離されたレストランでは横や裏のドアを使っていたのか。\n隔離されたレストランでは、アジア人も横や後ろのドアを使っていたのでしょうか？アジア人はどこにいたのか？彼らは何をしていたのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pdu1r0/why_do_other_middle_eastern_countries_never_seem.json": "アフガニスタン人は、アメリカやカナダ、イギリスではなく、他のイスラム圏の国に移住する方が文化的にも意味があるのではないでしょうか？\nアメリカ、カナダ、イギリスではなく、他のイスラム圏の国に移住する方が文化的にも意味があるのではないでしょうか？\n\nEDIT: 明らかに私はこの件に関して十分な調査をしておらず、この投稿を急ぎすぎました。\n急ぎすぎました。",
  "data/reddit-ask/r/AskWomen/comments/pduto1/women_of_reddit_those_who_have_filed_for_sexual.json": "編集部：この件に関するコメントを全て読みました。共有していただきありがとうございます。\nみんなと、この記事へのこれからのコメントを このようなことが起こっているのは、本当に心が痛みます。\n起こっています。私は自分自身の状況を経験しています。私は皆さんのことを個人的には知りません。\n皆さんには本当に感謝しています。\n\n編集2：辞めた人は...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pdvj36/why_is_american_football_called_football_when.json": "私はアメリカ人です。ただ、私はそれを理解していません。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pdz4i9/do_men_play_with_their_balls_in_a_non_sexual_way.json": "女の子はおっぱいをいじったり、お尻を叩いたり、退屈しのぎに自分をチェックしたりと\n退屈しのぎに自分をチェックしたりします。睾丸はどうですか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pdv07l/should_i_give_money_to_panhandlershomeless_people.json": "彼らの窮状には共感しますが、私はガソリンスタンドで働いているので、あまりお金を出すことができません。\nガソリンスタンドで働いているので、あまりお金はありません。私はガソリンスタンドで働いているので、あまりお金はありませんが、2年前から同じ人が同じ場所でお金を要求しています。\n2年前から同じ場所でお金を要求しています。彼らにとっては、テキサスの夏の暑さの中でじっとしているよりも、仕事を探した方がいいのではないでしょうか。\n毎日、テキサスの太陽の下で座っているよりも、仕事を探した方がいいのでは？私は精神的なものを理解しています。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pdtp14/does_anyone_write_out_things_and_then_delete.json": "私はredditをあまり利用したことがありません。実際のソーシャルメディアのように。私はいつも\nくだらないことを書いて人を怒らせたくないから、何も言わずに潜んでいます。\n怒らせたくないからです。試してみましたが、ただ何かを書き出して、見知らぬ人が反応してくれるような\n私は試してみましたが、私が何でも書き出して、見知らぬ人が反応して、ランダムな話をする場所を見つけることができませんでした。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pe952y/can_someone_spoil_lost_for_me.json": "で、結局なんだったんだ？最後のどんでん返しとは？どこまで詳しく書いてもいいし\n好きなだけ詳細に書いてもいいし、クリフノート版でもいい。\n\nLostは少なくとも10年は記憶にあります。私は本当にそれを見たことがないし\n気にしていませんでした。でも、何年も経ってから何があったのか知るのはいいことだと思います。\nなぜなら、私は確かに...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pechsh/why_do_i_receive_such_hate_from_people_when_they.json": "個人的には偽物のおっぱいは好きじゃないんだけどね。ごく一部の例外を除いて（例えば\n癌や怪我の後に医学的に必要とされる、極端に形の悪いものや劇的に異なるサイズなどの\n癌や怪我の後で医学的に必要な場合など）ごく少数の例外を除いて、私はAカップや自然に垂れ下がったDDを見たいと思います。\nの方がいいと思います。女性（または男性！私の中では嫌いではありません）がすべきではないと言っているわけではありませんが...。",
  "data/reddit-ask/r/AskHistorians/comments/pea8wg/what_happened_to_bodies_after_historic_battles.json": "スコットランドの歴史を読んでいると、イングランドとスコットランドの様々な戦いが話題になります。\n何千人もの死者を出したイングランドとスコットランドの戦い（937年ブルーナンバーの戦\nBrunanburhの戦い、1297年のStirling Bridgeの戦い、1314年のBannockburnの戦い、など）。) I\n犠牲になった人たちがどうなったのか気になって仕方がありません。で...",
  "data/reddit-ask/r/AskHistorians/comments/pedsh4/how_did_first_world_and_third_world_come_to_mean.json": "政治的な対立を意味する言葉が、なぜ経済発展のレベルを意味するようになったのか？\n発展を意味するようになったのでしょうか？",
  "data/reddit-ask/r/AskHistorians/comments/pefsst/what_did_the_egyptians_know_about_their_rich.json": "エジプトでの考古学的発見についてのドキュメンタリーを見たばかりで\n墓やピラミッドがヨーロッパ人によって科学的に発見される前に、エジプト人は墓やピラミッドについてどう考えていたのだろうかと思いました。\nヨーロッパの考古学者によって科学的に発見される前は\nエジプト人は墓やピラミッドについてどう思っていたのでしょうか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pe2jca/why_are_male_pleasure_toys_harder_to_find_than.json": "最近考えていたのですが、SNS上では「W.I.S.」や「W.I.S.」といったお店が\n例えば、ウォルマートのように、女性用のプレジャー・トイを公共の場に置いているお店があります。(私はそれでいいと思います。\nしかし、男性用のおもちゃは)\n\nしかし、男性用のプレジャー・トイは、目立たないお店、つまりセックス・ショップに行かなければなりません。そして\n私は不思議に思うのですが、それはなぜでしょうか...。",
  "data/reddit-ask/r/AskHistorians/comments/pebqlr/what_type_of_clothing_or_protection_did_vikings.json": "ヴァイキングはどうやってあの極寒の海を渡ったのだろう？\n厳寒の海をどうやって渡ったんだろう？私は、「きっと何重にも重ねていたんだろうね。\n風や海から守るために、何重にも重ねたり、何かの保護具（木の板とか）を使って\n風や海から何重にも保護していたに違いないと言いました。しかし、私の友人はどのようにして...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pehdyi/as_a_reminder_antivax_comments_and_pushing_nonfda.json": "このサブの外で何を言おうと構いませんが、ここでそれを持ち出した瞬間に\nここに持ち込んだ時点でBANされますよ。\n\n陰謀論やNNN、イベルメクチンなどのアカウントをNGにしていないからといって\nあなたが医学的な意見を持っている他の無知なサブサイトからアカウントを削除していないからといって\nそれらのサブを持っている人を受け入れるということではありません...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pegilw/why_does_no_one_tell_you_how_to_actually_function.json": "今年の初めに家を追い出されたばかりの私には、予算の立て方が全くわかりません。\n私の家の状況は、控えめに言っても良くありません。\n控えめに言っても良いものではありませんでしたし、彼らは私にあまり教えてくれませんでしたし、それは私を精神的にひどく引き裂いています。\n精神的にもかなり参っています...ヘルペス",
  "data/reddit-ask/r/askscience/comments/pek6no/why_are_antiparasitics_ie_hydroxychloroquine.json": "実際の効果や政治的な問題はさておき、なぜ抗寄生虫剤が治療として考えられているのか\n治療法として考えられているのでしょうか？\n\n何か共通するメカニズムがあるのでしょうか？\n\nそれとも、研究者たちは何でもかんでも投じて、何が刺さるか見ているだけなのでしょうか？\n\n編集： remdesivirではなくIvermectinでした。綴りを変えたくなかったので...。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pejq29/why_is_it_considered_rude_to_ask_what_someone.json": "私はこれを理解できませんでした。私は自分の収入を人に話すことに何の問題もありません。\nしかし、なぜか私が尋ねた誰もがショックを受け、「そんなことを聞くべきではない」「誰にも言わない」と言うのです。\n誰にも言わないよ」と言うのです。\n\n何がそんなに秘密なの？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pemx6e/is_it_ok_to_be_a_lesbian_but_not_want_to_be_in.json": "否定されるかもしれませんが、私はlgとは一切関係を持ちたくありません。\n私はレズビアンですが、lgbtqコミュニティとは関わりたくありません。\n\n詳細はこちらをご覧ください。みんなの考えとは違うかもしれないけど、私は自分が\n積極的にlgbtqコミュニティに参加することは、私が知っている人たちからより排斥されているように感じます。\n私の知っている人たちからは、もっと排除されているような気がして...。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pepe67/have_you_ever_peed_in_your_backyard_even_when_you.json": "家の裏庭で、単におしっこをしてしまったことが何度かありました。\nまた、家の中にいたのに裏庭に出ることにしたこともあります。\nまた、家の中にいても、気分的に裏庭に出てしまうこともあります。\n\nこのようなことをした人はいますか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pepdrx/why_is_it_when_women_have_periods_it_is_so_painful.json": "全くわからないし、純粋に知りたいです。でも、「怖くて聞けない」ので、ここに来ました。\nしています。\n\nPs. フレアはよくわからなかったので、そうですね。",
  "data/reddit-ask/r/AskHistorians/comments/peolov/the_wikipedia_article_for_the_gi_movement_claims.json": "問題の記事[https://en.wikipedia.org/wiki/G.I._movement]には\nリンクされているソース[http://home.mweb.co.za/re/redcap/vietcrim.htm]は動作しません。\n私にとっては \"戦争末期までに少なくとも600人の将校が断片的に殺された。\n300人以上が戦闘を拒否し、約5万人のアメリカ人が...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pes5co/i_slept_with_someone_a_year_ago_now_i_become.json": "NOTES: 彼がすでに結婚しているとは知りませんでした! 彼は友人の友人です。当時\n当時、私たちは共通の友人のパーティーの後にセックスをしました。二人ともバカみたいに酔っていたわけではなく\nほろ酔い程度でした。それは、私たちが以前からいちゃついていたからです。\nパーティーが始まった時からいちゃついていたので 私たちは話していて、最後にはファックしてしまった...。",
  "data/reddit-ask/r/TrueAskReddit/comments/pedp97/why_is_a_low_sex_drive_generally_considered_a_bad.json": "Googleで \"low sex drive \"と入力すると、ほとんどの検索結果が「性欲を高める方法」であることがわかります。\n向上させる方法を紹介しています。反対に「性欲がない」と入力しても、「性欲がある」とされる場所では結果が出ないようです。\n問題視されています。\n\n私は20代の男性ですが、自分では性欲が低いと思っています。私は19歳になってから\n19歳になってからオナニーを始めましたが、それは...",
  "data/reddit-ask/r/askscience/comments/pegg4m/how_dense_are_asteroid_fields_and_would_they_pose.json": "スターウォーズのエピソードVを見ていて気になったのですが、小惑星のフィールドは\nあんなに密集しているものなのか？また、ほとんどの小惑星は同じ方向に動いていると考えてよいのでしょうか？\nまた、ほとんどの小惑星は同じ方向に動いていると考えていいのでしょうか？",
  "data/reddit-ask/r/AskWomen/comments/perz1y/how_old_are_you_and_how_much_money_do_you_have.json": "みんなの貯金額を見て興味を持った",
  "data/reddit-ask/r/NoStupidQuestions/comments/pewiy1/if_you_were_as_rich_as_jeff_bezos_would_you_help.json": "友人の婚約者と話していて、もし自分がジェフ・ベゾスのようなお金持ちだったら\nジェフ・ベゾスほどのお金持ちだったら、ホームレスを助けたり、第三世界の国々に\n電気やきれいな水を提供するなどして。人々が助けられたいと思っている限りね。私は\n私は人に何かを強要する人間ではありません、たとえあなたがそう思っていても...。",
  "data/reddit-ask/r/AskHistorians/comments/petaxn/what_kind_of_support_garments_if_any_did_women.json": "私は西欧のサポートウェアの歴史についてはよく知っています。\nステイやコルセットはその典型的な例ですし、中世のカートルは縫製技術が発達すればバストをサポートしたでしょう。\n中世のカートルは、縫製技術が発達すればバストをサポートしていたでしょう。\n縫製技術が発達すれば、中世のカートルはバストを支えていたでしょうし、様々な文脈で「ブラの原型」の証拠を見たことがあります。私が考えていたのは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pf0md8/do_guys_like_the_way_girls_look_when_theyre.json": "AVなどで女の子がフェラをしている時の姿がずっと嫌いでした。\n私も自分の姿を見るのは好きではありません。\nポルノのコメントを見ていると様々な反応があったので、聞いてみました。\n私だけかどうかはわかりませんが、お気軽にお問い合わせください。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pf0dk3/what_happens_at_a_nude_beach_when_a_guy_gets_an.json": "ランダムなシャワーの感想。",
  "data/reddit-ask/r/TooAfraidToAsk/comments/peusz0/isnt_whitewashing_the_same_as_blackwashing_a.json": "私は失礼なことを言うつもりはありませんが、ただ混乱しているだけです。\nある人が他の人のアートのキャラクターを白塗りにしていると言っているのを見て、それは何も問題ないと同意しました。\nでも、同じ人がアートの中の白人を黒人に変えているのを見ると、かなり混乱します。\n混乱しているのですが、同じ人がアートの中の白人を黒人に変えているのを見ると、とても混乱します。",
  "data/reddit-ask/r/AskHistorians/comments/pf35uf/before_the_invention_of_the_toothpastemints_did.json": "口臭を消す方法が記録されていた？",
  "data/reddit-ask/r/AskHistorians/comments/pexzp8/how_did_neonazi_groups_become_prevalent_in.json": "ロシアやウクライナなどでネオナチグループが流行したのはなぜですか？理由は明白です。\n最も反ナチス的な国だと思われがちですが\n西ヨーロッパや北米に比べると、かなり多いようですね。その上\nそれに加えて、数世代にわたって教育を受けてきたことで...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pf5y04/why_are_more_men_interested_in_porn_than_women.json": "混乱している人が多いので編集します。なぜ男性の方が女性よりも多くAVを見るのか、ということを聞きたかったのです。\nする",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pf88ty/is_it_ok_to_get_an_abortion_for_an_unplanned.json": "女性が予期せぬ妊娠をしたが、子供を養える年齢であり、子供を養う経済的な余裕がある。\n子供を育てる経済的な余裕があるが、未婚（ボーイフレンドがいる）で\nただ単に今は子供が欲しくないというだけのことです。中絶をしてもいいのでしょうか？",
  "data/reddit-ask/r/askscience/comments/pf6pok/are_there_visible_clouds_in_space.json": "最近、スターシチズンというゲームをプレイしたのですが、実際に宇宙に雲のような構造物があることにかなり戸惑いました。\n宇宙空間に雲のような構造物があることにかなり戸惑いました。現実には存在しないものだと思っていたので\n現実には存在しないと思い、インターネットで検索してみました。しかし、何も見つかりませんでした。\n\nゲームだから仕方ないですよね。ゲームだからファンタジーの要素もあるかもしれない。でも、私は...。",
  "data/reddit-ask/r/askscience/comments/pf66e8/why_arent_people_with_alopecia_universalis_deaf.json": "ですから、脱毛症や耳が聞こえないことについての基本的な情報は知っているので、私の質問は奇抜なものかもしれません。\n奇抜な質問かもしれません。私はずっと、人間の聴覚能力は耳の中の小さな毛が振動することで得られると思っていました。\n耳の中の小さな毛が振動して、脳が魔法をかけて、聞こえるようになるんだと思っていました。\n聞こえます。\n\nそれと同時に、脱毛症の人は...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pf6ryz/my_girlfriend_just_asked_me_for_a_dick_pic_women.json": "タイトル",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pf6af6/what_was_the_war_in_afghanistan_for.json": "私はニュースを見ないので、何が起こっているのかわかりませんが、質問するのは馬鹿げていると思います。\n何が起こっているのかわかりません。私がここで読んでいるのは、私たちは絶対に勝てないとか、私たちはここでは善人ではないと言っている人たちです。\nここで読んでいるのは、私たちが勝てるはずがないとか、私たちはここでは善人ではないとかいうものばかりです。爆撃で13人の兵士を失ったことは知っています。\n爆撃で13人の兵士を失ったとありますが、その程度のことしか知りません。\n\nI...",
  "data/reddit-ask/r/AskHistorians/comments/pfa33t/if_i_wash_my_dishes_by_only_wiping_them_with_a.json": "必要に応じて冷水をかけたり、水に浸したりしますが、常にではありません。\n石鹸、酢、漂白剤などは絶対に使わない。この方法で掃除をしている友人がいます。\n彼らをちゃんと侮辱してやりたいと思っています。原始人と呼ぶにはあまりにも漠然としすぎています。何を\nいつ頃、さまざまな掃除方法が開発されたのか、私たちは知っていますか？",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pfehzq/update_i_told_her_i_slept_with_someone_a_year_ago.json": "数時間前に更新情報を投稿しましたが、ずっと削除されていました。今回、再度投稿します。\n今回もやります。 \n\n背景を簡単に説明すると、去年、友人のパーティーである男性と出会い、いちゃいちゃして\n最近になって新しい友人ができ、私がセックスした相手が彼女の夫であることがわかった。\n私がセックスした相手は、彼女の3年間の夫であることがわかりました。 \n\n私は知らなかったし、彼は...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pfeiln/how_do_i_convince_my_paranoid_brother_that_its.json": "私の兄は最近、この奇妙なナンセンスなものに夢中になっていて、これはその中でも最も新しいものです。\n最新のものに固執しているようです。暗くなるのが早いから、空で何が起こっているのか見えないと言っている。\n空で何が起こっているのか見えないと言っています。",
  "data/reddit-ask/r/AskHistorians/comments/pf4d3p/the_us_civil_war_seems_oddly_simplistic_is_this.json": "米国市民は、限られた問題で真っ二つに分かれた一つの国です。\n宗教や民族の違いもなく、外国からの介入もありません。\nそして、戦争が終わり、元の政府の下で国が再統一されます。\n政府の下で統一される。",
  "data/reddit-ask/r/TrueAskReddit/comments/peyozr/people_who_where_old_enough_to_grow_up_without.json": "私は1999年に生まれたので、常に何らかの形でデジタル技術が私の周りにありました。\n何らかの形で私の周りに存在しています。しかし、私が若かった頃は、いわゆる普通の関係の最後尾にいたことを覚えています。\nテクノロジーとの関係は、いわゆる普通の関係でした。子供の頃、毎日のようにコンピュータを使うことはありませんでした。\n子供の頃は、毎日のようにコンピュータを使っていたわけでも、携帯電話を持っていたわけでもなく......。",
  "data/reddit-ask/r/NoStupidQuestions/comments/pf9ds1/why_is_there_no_good_porn_with_a_couples_love.json": "純粋な愛情を求めているのかもしれませんが、それにしても、いつも浮気のビデオを見なければならないことには飽きました。\nいつも浮気のビデオを見なければならないことにうんざりしています。\n飽きてしまいました。",
  "data/reddit-ask/r/AskWomen/comments/pfc4rk/in_what_ways_have_you_seen_your_jobprofession.json": "うまくいったものはありますか？",
  "data/reddit-ask/r/AskHistorians/comments/pfbd6s/would_we_recognize_the_roman_senate_from_a.json": "言い方が悪くて申し訳ないのですが、私が本当に聞きたいのは、ローマの元老院が、アメリカの議会、あるいは現代の立法機関にどれだけ似ているかということです。\nローマの元老院は、米国議会や英国議会などの現代の立法機関にどのように似ているのか、ということです。\n英国議会のような現代の立法機関にどれだけ似ているかということです。例えば、元老院には現代の立法機関のような委員会があったのでしょうか？\n例えば、元老院には現代の立法機関のような委員会があったのか？元老院には役員がいたのでしょうか（つまり、リーダー、ホイップ、...）。",
  "data/reddit-ask/r/AskHistorians/comments/ov8tmv/which_side_of_the_road_did_allied_forces_drive_on.json": "そんなことを思ったのは、WW2のオンラインゲームをプレイしているときでした。トラックをぶつけて\n味方の戦車にぶつかり、逆走したと怒鳴られた。\n道路 彼らは分厚いヨーロッパ訛りの声で、私が悪いのだと怒鳴り返しました。\n逆走しているのです。その時、ふと思ったんです...。",
  "data/reddit-ask/r/AskHistorians/comments/ov9xmg/did_preindustrial_people_have_terrible_mental.json": "戦争、性的虐待、死別など、恐ろしい経験をした人たちが\nこのような現代社会では、子供の頃の傷跡を一生背負い続けることが多い。\nの世界です。産業革命以前の文明では、このような比較的ありふれたこと（たとえば\n古代ギリシャの衒学趣味のように、人々に同じような影響を与えるのだろうか？",
  "data/reddit-ask/r/AskWomen/comments/ov8wf2/tea_drinkers_whats_your_favorite_and_how_do_you.json": "特別なフレーバーコンボはありますか？加糖、ミルク入り、自然派？ホットかコールドか？",
  "data/reddit-ask/r/NoStupidQuestions/comments/ovd6yb/why_do_people_in_shows_like_the_walking_dead_even.json": "なぜ、生きるのか？何のために？毎日がホラーだ",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ovdql1/what_are_some_examples_of_the_bad_things_trump.json": "こんなこと聞いてボロボロにしないでくださいよ。私はまだ10代です。\n超保守的な州で超保守的な家庭で育ちました。すべての\nトランプ（と政治全般）について私が得た情報は、Fox\nニュース、家族、教会のメンバー、そして、私は何か欲しい...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ovdtrg/was_i_raped.json": "さて、タイトルは厳しいようですが、本題に入らせていただきます。私の友人で\n数週間前からちょっかいを出しているのですが、精神的に荒れているようでした。\n彼女が抱えている問題を解決するために、一緒に行ってあげました。\n私は19Mです。それで彼女はやっと落ち着いて、私たちは...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ovgiaf/normal_for_best_friends_to_suck_each_others_dick.json": "親友同士なら一生に一度、あるいは二度、フェラチオをするのが普通なのでしょうか？\nたまにしかない？それとも、私たち二人はすでにゲイで、ただ単に私たちが知らないだけなのでしょうか？\n自覚しているのでしょうか？あなたの考えを聞かせてください。ありがとうございました。"
}