{
  "data/reddit-changemyview/r/changemyview/comments/n270so/cmv_trying_illegal_drugs_should_not_be_taboo.json": "私は自分の主張を4つの部分に分けていますが、それぞれの部分については\nそれぞれについて、私の見解を変えることができます。\n\n1) 医学界、政府、社会が「麻薬は悪いものだ」と言っても、それは\nそれだけで事実として受け止めるべき議論ではありません。\n\n人類はまだ、脳の仕組みをほとんど知らないのです....",
  "data/reddit-changemyview/r/changemyview/comments/n2gtva/cmv_not_all_men_is_an_appropriate_response_to.json": "私のタイトルが私の主張を十分に表現しているとは思えません。\n一言では言い表せないので、ここで私の立場を説明します。\nここでは\n\nかなり一般的な視点だと思います。全ての男性ではない」というのは、「全ての男性」という言葉に対する自然な反応だと思います。\n男はみんなゴミ」.... のような発言に対する自然な反応だと思います。",
  "data/reddit-changemyview/r/changemyview/comments/n2jl1c/cmv_smartphones_should_have_their_charging_docks.json": " 1. 車の中では、その後、カップホルダーに携帯電話を入れることができます。ダッシュに電話ホルダーが付いている人にとっては\n    ダッシュにフォンホルダーを付けている人にとっては、トップサイドドックは特に害はありません。\n    しています。\n\n 2. これは間違っているかもしれませんが、もしあなたが机の上でラップトップを使っていて\n    机の上でノートパソコンを使い、ノートパソコンのUSBを使って携帯電話を充電している場合、それは...",
  "data/reddit-changemyview/r/changemyview/comments/n2k3f2/cmv_moral_and_humanity_can_exist_entirely_without.json": "話題が二極化しているのはわかっています。そして、私は無神論／神道一般について議論したいとは思いません。\n一般的な無神論/神道については議論したくありません。しかし、私は過去に友人と宗教について多くの議論をしてきました。\n議論してきました。私は無神論者です（自分の考え方に一番合っていると思っています）。\n私は無神論者です。",
  "data/reddit-changemyview/r/changemyview/comments/n2m4d2/cmv_as_a_us_citizen_living_and_working_abroad_i.json": "私は欧州で有効かつ合法的な長期滞在権を持っており、留学先でも現地の企業で働いて収入を得ています。\nホスト国では現地の企業で働いて収入を得ています。そのため、現地の税金をすべて支払っています。\n喜んで納税しています。私はヨーロッパでの生活を楽しんでおり、社会的なセーフティーネットがあることを楽しんでいます。\n私はヨーロッパでの生活を楽しんでおり、社会的なセーフティーネットがあることを楽しんでいます。",
  "data/reddit-changemyview/r/changemyview/comments/n339mo/cmv_elon_musk_is_an_asshole_for_naming_his_kid_x.json": "なぜ、このような名前をつけるのでしょうか？私にとっては\n子供に「ヒトラー」や「バービー」と名付けるのと似ています。その名前は、発音できないし、常に\nいじめなどの不必要な注目の的になってしまいますし、実際には何の意味もありません。\nそして、ダディ・マスクが関連性を保つこと以外には、本当の意味での使用はありません。",
  "data/reddit-changemyview/r/changemyview/comments/n3dol8/cmv_jesus_being_a_real_person_who_walked_this.json": "私は12年間カトリックの学校に通っていましたが、その間に、イエスは間違いなくこの世を歩いた実在の人物であると\nイエスは間違いなくこの世を歩いた実在の人物であり、それは聖書にはない歴史的証拠で証明できる。\nそれは聖書にはない歴史的証拠によって証明されます。\n神の存在を証明するものとして提示されます。\n\nだから、必然的に、あなたが...",
  "data/reddit-changemyview/r/changemyview/comments/n3ik56/cmv_delivery_people_shouldnt_be_expected_to.json": "自分の犬が他人を威嚇しないようにできないなら、配達員が危険を冒してまであなたの荷物を届けることを期待すべきではありません。\n配達員が危険を冒してまで荷物を届けることを期待すべきではない。\n\n\"でも子犬は噛まないよ、うるさいだけだよ\"\n\nあなたの場合はそうかもしれませんが、配達員はそれを知りませんし、小さな犬種でも皮膚を傷つけることがあります。\n犬種でも皮膚を破る可能性があることを知らない....",
  "data/reddit-changemyview/r/changemyview/comments/n3n8ml/cmv_saying_that_everyone_is_a_good_mom_is_like.json": "すべての育児教材で聞いたり読んだりするのは、もううんざりです。私は去年子供を産みました。\n去年出産したのですが、妊娠した時からこのメッセージを\nどこにいても。\n\n私たちは一度も会ったことがありませんが、一体どうやって私が良い母親だとわかるのでしょうか？誰もが良いものを持っているとは限らない。\n誰もが良いものだとは限らないでしょう？どうやって...",
  "data/reddit-changemyview/r/changemyview/comments/n3f3a4/cmv_dating_apps_should_maintain_racial_preference.json": "人種や肌の色を問わず、誰とでもデートできるようにしていますが、誰もがそうではないことも知っています。\nしかし、すべての人がそうであるとは限りません。しかし、すべての人がそうであるとは限りません。\n私は、自分の人種を理由に私とのマッチングを望んでいない潜在的なマッチを通過する必要はありません。私は\nむしろ、私とのマッチングに前向きな人のプロフィールを推薦してほしい。",
  "data/reddit-changemyview/r/changemyview/comments/n38s2r/cmv_onlyfans_should_change_their_age_minimum_to.json": "多くの人がOnlyFansをカムサイトや他の売春サイトよりもInstagramに似ていると考えています。\nのようなものだと考えています。\n\nインフルエンサーは、InstagramでOnlyFansを何百万人もの若いフォロワーに宣伝しています。\nインフルエンサーがInstagramで自分のOnlyFansを何百万人もの若いフォロワーに宣伝しています。\n解放されていることと同一視されています（これは確かに...）。",
  "data/reddit-changemyview/r/changemyview/comments/n3tfql/cmv_a_womens_quota_and_similar_special_treatments.json": "あなたが私の喉に飛び込んでくる前に、私はこれをインセルの端くれになるために頼んでいるのではありません。\nむしろ、このトピックについての私の見解を変えてもらいたいと思っています。\n\n背景 私はドイツに住んでいて、STEM分野の学士号を取得しようとしています。\nSTEM分野の学士号を取得しようとしています。私たちの選挙はまもなく始まりますが、私はほとんどの記事を読みました。",
  "data/reddit-changemyview/r/changemyview/comments/n4248f/cmv_is_impossible_to_be_a_nonspiritual_person_in.json": "AAは宗教ですが、自分で「高次の力」を選択することを奨励するものです。\nを選択することを奨励する宗教です。私は去年断酒して、AAについて調べましたが、文字通りカルト的なもので、頭が真っ白になりました。\nいかにカルト的であるかということに頭を抱えました。それ以来、私は断酒しています。\n\nまず、断酒だけが目的ではありません。それは、人生を送るためのものです。",
  "data/reddit-changemyview/r/changemyview/comments/n44lev/cmv_the_voting_age_should_be_linked_with_the_age.json": "私の考えでは、徴兵制（本人の同意なしに強制的に戦争に参加させること）は\n徴兵制（同意なしに戦争に参加させること）は、政府が自分の意思に反して何かをさせたり、投獄したりできる唯一の方法です。\n徴兵制（同意なしに戦争に行かせること）は、政府が自分の意思に反して何かをさせたり、投獄したりする唯一の方法であり、それは自分の直接的な利益のためではない。\n\nつまり、シートベルトを着用することを強制することと、戦争に参加することを強制することは大きく異なるのです。",
  "data/reddit-changemyview/r/changemyview/comments/n4m94i/cmv_criticising_something_as_cultural.json": "この件についてはいくつかのスレッドがありますが、私は自分で作ることにしました。\n議論が自分の考えを表しているようには思えなかったので、自分で作ることにしました。\n\n何かを文化的流用と批判することは、間違っているだけでなく、誰かの人種差別を表現するために使われる傾向があると、私はよく感じます。\n誤っているだけでなく、誰かの人種差別を表現するために使われることが多いです。\n内在化された...",
  "data/reddit-changemyview/r/changemyview/comments/n4fvxg/cmv_mass_shooters_of_today_are_the_same_people.json": "1987年にアメリカで活動していた連続殺人犯は198人でした。2019年には\nは2人の現役連続殺人犯しかいなかった。出典\n[https://www.abajournal.com/news/article/serial-killings-are-waning-leading-to-speculation-about-the-cause]\n\nこれを読んだときは驚きました。連続殺人なんて...と思っていました。",
  "data/reddit-changemyview/r/changemyview/comments/n4to8w/cmv_cursing_is_like_shouting_occasionally.json": "私は息子1歳の男の子の父親です。まだ言葉は話せませんが、何かを教えなければと思っています。\n教えることを考えなければならないと思っています。\n厳しい言葉に対する態度です。\n\n私もたまにきつい言葉を使うことがありますが、それは悪いことではありません。\nそれを教えるのは偽善的だと思うのですが・・・。",
  "data/reddit-changemyview/r/changemyview/comments/n4tay4/cmv_crypto_is_more_gambling_than_investing.json": "皆さん、こんにちは。これは私が非常に混乱していることです。人々は\nこのようなランダムな暗号を購入し、それを投資と呼んでいますが、その「投資」には何の裏付けもありません。\n実際には何の裏付けもありません。会社に投資すると、株を手に入れて\n会社に投資すると、その会社の状況に応じて価値が上がったり下がったりする株を手に入れます...",
  "data/reddit-changemyview/r/changemyview/comments/n4vgqy/cmv_i_dont_think_it_makes_sense_to_reinterpret.json": "私はゲイなので、このようなことをしてくれる人たちには本当に感謝しています。そして今、私はその人たちを恨んでいるようなものです。\n申し訳ありませんでした。しかし、バイブル\nとトーラ、コーランなど、コーランは少し違うと思いますが\nしかし、コーランは少し違うと思います。なぜなら、コーランはまだかなり文字通りに受け取られているからです。",
  "data/reddit-changemyview/r/changemyview/comments/n5a9kq/cmv_its_impossible_or_very_difficult_to_be.json": "ずっと前から、LinkedInにコンテンツを投稿したいと思っていました。何よりも\n何よりも、プロフェッショナルな関係を築くための適切なツールであることに同意できます。\n適切に利用すれば、プロとしての関係を築くための適切なツールであることには同意できます。\n\nしかし、それは私が使いこなせていない理由と同じです。\n\nなんか...偽物っぽくて、堅苦しくて、本物じゃない。\n\nI...",
  "data/reddit-changemyview/r/changemyview/comments/n5fj89/cmv_its_a_good_thing_that_birth_rates_are.json": "最近、少子化が話題になっていますが、私が読んだ記事のほとんどは\n少子化の影響で経済的に厳しい状況になっているという記事が多いですね。\nといった内容です。経済的な困難を克服する必要があることは確かですが\n克服しなければならないと思います。",
  "data/reddit-changemyview/r/changemyview/comments/n5472v/cmv_most_people_arent_actually_interested_in.json": "ほとんどの答えは、今日、グーグルで検索して、いくつかの記事を読めば、簡単に見つかります。\n読むことができます。それにもかかわらず、人々は間違った情報を鵜呑みにして\n誤った情報を鵜呑みにしてしまうのです。\n\nピュー・リサーチによると\n(https://www.journalism.org/2020/07/30/americans-who-mainly-get-their-news-on-social-media-are...",
  "data/reddit-changemyview/r/changemyview/comments/n5g5e0/cmv_conservatism_in_the_us_since_2016_has.json": "保守派の間では、オバマ大統領をめぐる樺太論争に代表されるように、誤った信念が目立つようになりました。\nしかし、オバマ大統領に関する論争は、リベラル派の陰謀と同様に高い水準にある。\nアメリカでははるかに多く見られるようになった。\n\n保守派のフィルターバブルは現実を大きく歪め、保守派で広く受け入れられている\n保守派で受け入れられている...",
  "data/reddit-changemyview/r/changemyview/comments/n5hhb7/cmv_republicans_arent_doing_enough_to_address.json": "この国のイスラム系アメリカ人は、コミュニティ内の過激化への対応を怠った場合の代償をよく知っています。\n私は自分のコミュニティ内での過激化への対処を怠った代償をよく知っています。\n\nイスラム社会では長年にわたり、過激派の増加の原因はごく少数の誤ったイスラム教徒にあるという信念が貫かれてきました。\nイスラム社会では長年にわたり、過激主義者が増えている原因は、ごく少数の誤ったムスリムにあると考えられてきました。\n長年にわたり、イスラム社会は、ごく少数の誤ったムスリムだけが、コミュニティ内の過激派感情を増大させているという信念を貫いてきた。",
  "data/reddit-changemyview/r/changemyview/comments/n5u96r/cmv_cultural_concerns_over_gentrification_seem.json": "別の人気サブサイトでは、ニューオリンズで白人女性が黒人男性と対立しているビデオが投稿されていました。\nニューオーリンズで白人女性が黒人男性と対立しているビデオが投稿されていて、多くのコメントが\nコメントの多くは、ニューオリンズのような都市のジェントリフィケーション（高級化）についての文句でした。ほとんどのコメントは\n殆どのコメントは、住宅コストの上昇については何も言及していませんでした - 彼らは...",
  "data/reddit-changemyview/r/changemyview/comments/n64e7t/cmv_pressing_tab_after_typing_in_a_username.json": "皆さん、こんにちは。\n\nこれはとても簡単なCMVだと思います。ユーザー名（またはメール）を入力した後にタブを押すと\nユーザー名（またはメールアドレス）を入力した後にタブを押すと、必ずすぐにパスワードの入力を開始できるようにすべきだと思います。\nパスワードを入力してください。その他のプロンプト（新しいアカウント、パスワードを忘れた\nパスワードを忘れた）というプロンプトは、パスワードのプロンプトの後に置くことができると思います...",
  "data/reddit-changemyview/r/changemyview/comments/n5vuyq/cmv_recycling_is_overreported_and_cant_solve_our.json": "皆さん、こんにちは。\n\n私は今、大学でリサイクル（主にプラスチックのリサイクル）について研究しています。私の\n最初の数ヶ月の研究では、政府（少なくともEU）はリサイクルの数字を過大に報告し\n政府は（少なくともEUでは）リサイクルの数字を過大に報告し、一般的にはリサイクルはより効率的なものとして描かれています。\n実際よりもはるかに効果的で真の意味での循環型プロセスであるかのように見せているということです。....",
  "data/reddit-changemyview/r/changemyview/comments/n64jnz/cmv_in_modern_america_in_most_fields.json": "現代のアメリカでは、ある分野で何らかの矛盾が生じると、それは何か漠然とした、あるいは目に見えない障壁の証拠であるという奇妙な考えがあります。\n漠然とした、あるいは目に見えない差別の壁のようなものがあるのではないかと考えてしまうのです。\n差別です。多くの場合、それは人種や民族によるものです。しかし、なぜ私たちは自動的に\n差別されているからだと考えるのでしょうか？私は...",
  "data/reddit-changemyview/r/changemyview/comments/n62crf/cmv_nuclear_energy_is_just_the_best.json": "少なくとも近未来においては、ダイソン球のようなものができるまでは、相対的にクリーンな電力を原子力でまかなうことができると思います。\n少なくとも近未来においては、ディスオン・スフィアのようなものができるまでは、原子力は比較的クリーンな電力を供給できるかもしれません。\n\n多くの人がいまだに原子力を怖がっていますが、私はそれはナンセンスだと思います。\n彼らは、チェルノブイリのような出来事を考えていますが、実際には、チェルノブイリのような出来事があったとしても\nその...",
  "data/reddit-changemyview/r/changemyview/comments/n6jgw5/cmv_prisoners_slated_to_be_executed_should_be.json": "ほら...念のため。どちらにしても、彼らを殺しているわけですから、これで干ばつやコビド19のような問題を解決できるかもしれません。\n干ばつやコヴィド-19のように、これをすることで解決するかもしれません。また、囚人の視点から見ても\n致死性注射に比べて、自分の死に対する恐怖感が少なくて済むので\nもし私が洗浄されて、9インチの刃が私の体に突き刺さっていたら...。",
  "data/reddit-changemyview/r/changemyview/comments/n6hw6g/cmv_living_in_the_us_is_not_that_bad.json": "私はヨーロッパの非EU諸国出身です。ここの人たちはいつも先進国に出稼ぎに\n働いています。何人かは戻ってきて、何人かは残って住み続けます。\n彼らの多くは、ドイツ、オーストリア、スウェーデン、オランダに行きます。これらの国は\n最も人気のある国です。ごく一部の人たちは、実際には...。",
  "data/reddit-changemyview/r/changemyview/comments/n6ifm9/cmv_universities_should_have_professors_dedicated.json": "学費が高騰しているにもかかわらず、教授の教え方が悪いために学生が苦労するケースが増えているようです。\n学費が高騰しているにもかかわらず、教授の教え方が悪いと学生が悩むことが多くなっているようですが、パンデミックやオンライン学習が\nパンデミックとオンライン・ラーニングはこのことを強調しています。\n\n大学は、教えるだけで他の仕事をしない教授を雇うのが筋だと思います。\n教えるだけで、他の仕事をしていない教授を雇うのは理にかなっていると思います。",
  "data/reddit-changemyview/r/changemyview/comments/n67yx4/cmv_there_is_no_reason_anyone_should_have_to_work.json": "私たちのほとんどは癌を治していないし、癌を治している人たちは休むべきだ。そうすれば\nそうすれば、実際にがんを治すことができるかもしれません\n\nこれは私の胸の内を明かすためのものかもしれませんが...。\n\nでも、21歳から65歳までの人生で、1週間に1日しか楽しめないのに、何の意味があるんだろう？\n21歳から65歳までの人生で、週に1日しか楽しめないのに、何の意味があるのでしょうか...。",
  "data/reddit-changemyview/r/changemyview/comments/n6y914/cmv_cutlery_should_be_placed_at_the_end_of_a.json": "みんながどれくらい強く感じているのかはわからないが、今まで行ったほとんどのビュッフェで\n今まで行ったほとんどのビュッフェで、私はこの点に悩まされてきました。ほとんどの場合\nビュッフェの列の最初にカトラリーが置かれていて、最後に行くまでに\n最後の方になると、「あ、あの時のカトラリーは......」と気づくのです。",
  "data/reddit-changemyview/r/changemyview/comments/n6ye42/cmv_breakdown_in_political_discourse_is_caused_a.json": "世界の問題を解決できない政治家の話ではありません。\n私が言っているのは、世界の問題を解決できない政治家のことではなく、橋を燃やしたり、ツイッター戦争を煽ったり\n社会からの反発を恐れて自分の意見を言えないでいる人たちのことです。\n\n私の経験では、耳を傾け、最善を想定し、セカンドチャンスを与えることで...",
  "data/reddit-changemyview/r/changemyview/comments/n7dce2/cmv_the_home_toilet_seat_up_versus_down_debate_is.json": "蓋を閉めるとシートが下がります。蓋を閉めれば、部屋中に飛び散る\nウンチの粒子が部屋中に飛び散るのを最小限に抑えることができますよね。そうですね。\n公衆トイレには通常、蓋がないことは承知しています。しかし、あなたの家のトイレには\nしかし、あなたの家のトイレには間違いなくある。\n\nおしまい。\n\nP.s. 私の最初の投稿は...",
  "data/reddit-changemyview/r/changemyview/comments/n79664/cmv_people_at_grocery_stores_who_pick_out_meat.json": "ひき肉や鶏の胸肉などの肉類が、冷えた場所から出されると\n気が変わった怠け者のお客さんによってシリアル通路に置かれてしまったりすると\n気が変わった怠け者のお客さんが、冷たい場所から取り出した肉をシリアルの通路に置いてしまった場合、その肉はお店で捨てなければなりません。私はこれを\nこれは万引きと同じで、お店はすべてのお金を失うことになりますから...。",
  "data/reddit-changemyview/r/changemyview/comments/n7j68z/cmvcircumcision_should_be_illegal_until_a_child.json": "ご存知ない方もいらっしゃるかもしれませんが、割礼とはペニスの一部である包皮を切り取ることです。\n割礼とは、ペニスの一部である包皮を切除することです。\n\nこの行為は何世紀にもわたって伝統的に行われてきました。\n正当化されてきました。現代では、次のように正当化する人もいます。\n清潔を保つのが簡単だから」と正当化する人もいます。一部の親は...",
  "data/reddit-changemyview/r/changemyview/comments/n7tdio/cmv_you_dont_get_automatic_claim_to_your_races.json": "はじめに、これは非常に非礼な話題であり、一部の人からは膝を打つような、あるいは防御的な反応を引き起こすかもしれないことを理解しています。\nしかし、私は純粋に議論し、学ぶためにここにいます。\nあるいは、議論して自分の立場を守るために。\n\n私は日本に住む白人のアメリカ人で、子供の頃から日本の文化を学び、参加してきました。\n私は日本に住む白人のアメリカ人で、子供の頃から日本の文化を学び、楽しんできました。",
  "data/reddit-changemyview/r/changemyview/comments/n82951/cmv_the_plural_noun_guys_is_gender_neutral_in.json": "他のいくつかの言語と同様に、性別が曖昧なグループに話しかけるときに使用される複数形の名詞を持つことが一般的です。\n曖昧な性別のグループに話しかけるときに使われる複数形の名詞があるのが一般的です。(例えば、中国語のtāmen\n(he/him/she/her/itの複数形)などがありますが、英語にはこのような特定の単語はありません。\nしかし、英語にはこの説明にすべての面で合致する特定の単語がありません。They/themが効く...。",
  "data/reddit-changemyview/r/changemyview/comments/n7yr8v/cmv_using_religion_to_avoid_certain_laws_is_not.json": "幸いなことに、アメリカでは宗教の自由が非常に重視されています。\n私は個人的には無宗教ですが、宗教を実践する自由を完全に理解し、支持しています。\n宗教を実践する自由を完全に理解し、支持しています。しかし、宗教の自由を口実に、ある行為が法律から免除されるのは理解できません。\n宗教の自由という名目で、ある行為が法律から免除されるのは理解できません。例えば...",
  "data/reddit-changemyview/r/changemyview/comments/n8aqhe/cmv_we_are_entering_an_unhealthy_culture_of.json": "私は最近、BBCの記事を読んでいました。\n新しい用語のリストを見つけました。その中には次のようなものが含まれていました: asexual,\nace, demisexual, aromantic, gray-sexual, heteroromantic, homoromantic, allosexual。\nallosexualです。これにより、いくつかの深い考えが表面化しました。",
  "data/reddit-changemyview/r/changemyview/comments/n8mu8k/cmv_life_is_better_as_an_adult_compared_to_being.json": "私は、責任の増加についての全体的な考え方を理解しています。\nしかし、大人になってからの方が、子供の頃よりもずっと良いと思います。\nしかし、大人になってからの方が子供の頃よりもずっといいと思います。\n\n考えてみれば、不満や要望を言っても理解してもらえたり、聞いてもらえたりする可能性が高いですよね。\n愚痴や要望を聞いてもらえる可能性が高くなります。",
  "data/reddit-changemyview/r/changemyview/comments/n8j3j8/cmv_christianity_is_just_a_religion_and_it_is_not.json": "私はクリスチャンで、キリスト教に生まれ、強い信仰心を持っています。\n多くのクリスチャンが、自分たちの宗教が「」と呼ばれると怒るのは、本当に奇妙なことだと思います。\n私たちの宗教が「ただの宗教」と言われたり、「宗教」と言われたりすると、多くのクリスチャンが怒るのは本当に不思議です。\n\n私の理由は\n\nそれはただの宗教であり、宗教以外の何物でもありません、それは...。",
  "data/reddit-changemyview/r/changemyview/comments/n8pqi7/cmv_telling_disabled_people_they_are_lazy_and.json": "多くの健康状態を抱えている私にとって、仕事をすることはかなり不可能です。\n私は重度の喘息、視力の問題、時々視力が落ちます。\nアレルギー、片方の腎臓、腎臓結石、発作（睡眠時のもので、頻繁に起こるものではありません。\n頚椎症（首の問題）、めまい、不安、TBI（外傷性...",
  "data/reddit-changemyview/r/changemyview/comments/n8r0ds/cmv_there_is_no_reason_other_than_tradition_that.json": "名前を変えたい人がいてもいなくても、どちらでも構いません。それは\n個人の判断で決めればいいと思います。結婚を機に姓を変えたいという理由はあると思いますが\n結婚して名字を変えたいという理由はあると思います。\n女性が自動的に...という理由はないと思います。",
  "data/reddit-changemyview/r/changemyview/comments/n8qkph/cmv_gatekeeping_a_culture_is_illogical.json": "抹茶を作る前に泡立て器を濡らさなかったことで、文化的流用だと非難されている白人男性のビデオを見ました。\n抹茶を作る前に泡立て器を濡らさなかったことで、文化的流用だと非難されていました。私はアジア人ですが、この男は私よりもお茶作りについて詳しいので\n抹茶を点てる前に泡立て器を濡らさなかったことで、文化的流用として非難されていました。\nコメントには様々な人種の人がこの男に向かってこんなことを言っているのか理解できませんでした...。",
  "data/reddit-changemyview/r/changemyview/comments/n8v1am/cmv_if_you_say_anyone_below_x_age_cant_be_know_if.json": "最初はこの意見に同意していましたが、いかに根本的に愚かであるかを理解しました。\n根本的に愚かなことだと気づくまでは。自分がゲイであることを理解するのは難しいことではありません。\n難しいことではありません。それは、ホモフォビアの世界で嘲笑されることを想定して、ゲイであることを避けようとすることでした。\n嘲笑されないようにゲイであることを避けようとすることでした。私は、ほとんどの人が...",
  "data/reddit-changemyview/r/changemyview/comments/n8vad0/cmv_given_no_further_context_it_makes_sense_to.json": "アメリカ人以外の人が、Redditで誰もがそうだと思い込んでいることについて、定期的に文句を言っています。\nをアメリカ人だと思い込んでいる人たちについて、アメリカ人ではない人たちが不満を言っているのをよく見かけます。私の考えでは、平均的なRedditの利用者がアメリカ人であると仮定するのは理にかなっていると思います。\nはアメリカ人だと考えるのが妥当だと思います。Redditのユーザーの約51％はアメリカ人で、アメリカはRedditのユーザー数が最も多い国の約13倍です。\nアメリカのRedditユーザー数は、次に多い国の約13倍です。",
  "data/reddit-changemyview/r/changemyview/comments/n94mwe/cmv_the_antiscience_that_is_rampant_today_is.json": "2000年代前半から半ばにかけて、私はアレックス・ジョーンズのような人物から、現在のような反科学的な運動が横行する初期段階を目にしました。\nアレックス・ジョーンズに代表されるように、今日のような反科学運動が横行しているのを目の当たりにしました。\n\n私の友人の一人が、地球温暖化はデマだというくだらない言葉を呟き始めました。\nアレックス・ジョーンズのページから直接引用した研究結果を引用して、地球温暖化はデマだというくだらないことを呟き始めました...",
  "data/reddit-changemyview/r/changemyview/comments/n8zn8c/cmv_its_not_helpful_to_any_cause_to_say_that_its.json": "私がこのようなことを言うのは、ソーシャルメディア上で「マイノリティ/女性/lgbtq/障害者の友人に問題を尋ねてはいけない」というような投稿があるからです。\nマイノリティ/女性/lgbtq/障害者の友人に、彼らのアイデンティティにまつわる問題や差別について聞くな。\n自分のアイデンティティにまつわる問題や差別について友達に聞かないで、あなたはもう知っているはずだから」という投稿があるからです。私はこれをとても\n理解できません。\n\n誰かが正義の味方になろうとしているときに...",
  "data/reddit-changemyview/r/changemyview/comments/n9fy68/cmv_all_these_new_cryptos_plastered_all_over_the.json": "かなりのタイトル。cryptoで常にupvoteされているクソ記事や\nのサブやその他の場所で常に/r/allのトップにいるクソは、古典的なMLMと変わりません。\n古典的なMLMと変わりません。多くの人を騙して自分の後に買ってもらうことで\nあなたは、あなたの後に購入するために、あなたが販売してお金を稼ぐことができるように...",
  "data/reddit-changemyview/r/changemyview/comments/n9996u/cmv_white_people_can_suffer_racism_in_america.json": "まず、この件に関して非常に重要なことを述べさせていただきます。\n\n人種差別は、社会学・社会科学の分野では、多くの定義と多くの異なる概念があります。\n科学の世界では様々な定義や概念があります。\n\n私が言いたいのは、人種差別は単一ではなく、個人の人種差別、構造的人種差別、制度的人種差別などがあるということです。\n個人的なレイシズム、構造的なレイシズム、制度的なレイシズムなどなど。\n\nそして、あなたは多くの...",
  "data/reddit-changemyview/r/changemyview/comments/n9o864/cmv_the_right_to_religious_freedom_should_not_be.json": "イギリスが「転換療法」を禁止する準備をしているという記事を読んだところです。\n続けることができるかどうかは、「信教の自由」への影響を考慮する必要があります。\n\"宗教の自由」への影響です。\n\nこれには腹が立ちます。もしある宗教の慣習が時代遅れで、型にはまらない人々にダメージを与えるものであれば、きっと...\n宗教の実践が時代遅れで、型にはまらない人にダメージを与えるものであれば、きっと...。",
  "data/reddit-changemyview/r/changemyview/comments/na88bp/cmv_the_new_idea_of_calling_white_people.json": "聞いていない人のために説明すると、最近Tiktokでよく見かける言葉です。\n白人には文化がないとか、スパイスに耐性がないとか、そういったことと一緒に\n白人には文化がないとか、スパイスに耐性がないとか...。\n\n私は、この言葉がn-wordや他の人種的中傷と同じくらい悪いものだと言うつもりはありません。\nそうではありません、主な理由は...。",
  "data/reddit-changemyview/r/changemyview/comments/na9tg8/cmv_there_should_be_a_mandatory_violent_offender.json": "ついでに言えば、仮釈放中の重犯罪人は全員、地元の警察署に登録して、その情報を公開するように強制されないのはなぜだろう？\n仮釈放中の重犯罪者は、地元の警察署に登録して、その情報を公開するように強制されないのでしょうか？\n\nもし私に子供がいたら、性犯罪のことだけではなく、仮釈放中の犯罪についても知りたいと思います。殺人者やその他の犯罪者についても知りたい。\n殺人者や他人に暴力を振るった者など、果ては...。",
  "data/reddit-changemyview/r/changemyview/comments/nak6eo/cmv_being_antiisrael_is_not_antisemitic.json": "イスラエルやイスラエル政府の政策を批判しても、自動的に反ユダヤ主義になるわけではありません。\n自動的に反ユダヤ主義になるわけではありません。例えば、パレスチナ自治区に関するイスラエル政府の政策を否定・批判することは、誰にでもできることです。\n批判することは自由です。これは\nこれは、イスラエルでも同じです。\n\nイスラエルに反対したり、イスラエルに賛成する行動をとっても、それは...",
  "data/reddit-changemyview/r/changemyview/comments/nam8r7/cmv_political_entities_and_activists_who_derive.json": "思いやりのレンズを通して敵を見ることができなければ、自分の考えの正当性を、それが思いやりのあるものだという理由で正当化することはできません。\n思いやりのレンズを通して敵を見ることができなければ、自分の考えの正当性を思いやりに基づいて正当化することはできません。\n例えば、民主党が同性愛者への思いやりから道徳的に優位に立っていることを正当化することはできません。\n例えば、民主党が同性愛者を思いやることで道徳的に優位に立っていることを正当化することはできませんが、もしあなたがプロライフのスタンスを...",
  "data/reddit-changemyview/r/changemyview/comments/nacy4f/cmv_reddit_needs_to_put_a_stop_to_the_propaganda.json": "私がRedditを利用している間、NewsやPublicFreakoutsのような特定のサブカルチャーに注目していました。\nイスラエルを悪者にするために中東から発信されるプロパガンダマシンを\nイスラエルを悪者にするための中東のプロパガンダに大きな問題があることに気がつきました。しばしばその投稿は、反イスラエル的な投稿しかしないアカウントから行われます。\n反イスラエル的なものを投稿するだけのアカウントから投稿されたり、記事を投稿したりしています。",
  "data/reddit-changemyview/r/changemyview/comments/naum17/cmv_locking_up_more_black_hair_care_products_by.json": "先日、ジョン・オリバーの「Hair」という番組を見たのですが、その中で彼は\nウォルマートやCVSのような店では、「白」（テクスチャーのない）ヘアケア製品よりも「黒」（テクスチャーのある）ヘアケア製品を\n白人用のヘアケア製品よりも、黒人用のヘアケア製品の方がよくロックされている。\nこれは社会的な人種差別に起因するものです。彼は続けてこう説明しました。",
  "data/reddit-changemyview/r/changemyview/comments/nb4pce/cmv_the_panic_buying_of_gasoline_within_the.json": "なぜなら、もしパイプラインにランサムウェアが侵入したというニュースが、もっと前に届いていたら、私たちは何もできなかっただろうと思うからです。\nパイプラインで発生したランサムウェアのニュースが、もっと遅くここに届いていたら、今のような反応は得られなかったと思わずにはいられません。\nこのような反応はありません。\n\nパニックになってガソリンを買いだめしてはいけないと言われています。\nと言われていますが、いまだに人々は...",
  "data/reddit-changemyview/r/changemyview/comments/nbhug3/cmv_making_children_finish_their_plate_of_food.json": "子供は好き嫌いが多いものですが、もし食べ終わってお腹が空いていないと言ったら\nお腹が空いていないと言えば、おそらく空腹ではないのでしょう。乳児はお腹が空いたら泣くという基本的な感覚を持っています。\n乳児はお腹が空いたら泣くという基本的な感覚を持っていますが、数年後には子供たちは\nお腹が空いていることを認識することができます。食べることを強要することで...",
  "data/reddit-changemyview/r/changemyview/comments/nbliej/cmv_gender_fluidity_reinforces_gender_roles.json": "まず最初に、私自身がLGBTQ+コミュニティの一員であることから、私はLGBTQ+コミュニティの大いなる支持者であることをお伝えしたいと思います。\nコミュニティーを支持しています。私は誰も傷つけるつもりはありません。\nただ、これは私が純粋に理解できない概念です。\nのです。\n\n私は子供の頃、車やスポーツなどの「男の子のためのもの」に夢中でした...",
  "data/reddit-changemyview/r/changemyview/comments/nbk8bh/cmv_abortion_is_moral_because_of_lack_of.json": "中絶に関する投稿はよくあることだと思いますが、私がここで言いたいのは、特に取り上げられているのを見たことがないということです。\nここで私が言いたいのは、特に取り上げられているのを見たことがないことです。\n\n法的にも現実的にも、生まれた時点でのプロチョイスの立場を強く主張することができると思います。\n法律的、実用的なレベルでは、出生の時点に近いところでプロチョイスの立場を強く主張できると思います。しかし、私は次のようにも考えています。\n道徳的な立場は非常に...",
  "data/reddit-changemyview/r/changemyview/comments/nb5fuo/cmv_if_you_point_out_to_your_overweight_friends.json": "太りすぎが喫煙よりも健康に悪いのはわかりますが\n深刻な健康被害をもたらすという点では似ていますが、これはそのことではありません。\nこれはそういうことではありません。\n\n醜い」という理由で人をいじめたり、馬鹿にしたりして、その人を気遣うふりをするのが好きな人がいます。\n健康に気を遣っているように見せかけている人がいます。つまり、、、。",
  "data/reddit-changemyview/r/changemyview/comments/nbm6h8/cmv_if_we_cant_as_humanity_effectively_deal_with.json": "マスクをして、遠くにいて、経済的に支援して、ウイルスが死滅するのを待つくらいのことは必要なかったでしょう。\nウィルスが死滅するのを待つ間、住民を経済的に支援する以上のことはできなかったでしょう。\nしかし、今ではワクチンがあったとしても、これは何年も続くだろうと思われます。\n何年も。\n\n気候変動は目に見えないものですが、その影響で...",
  "data/reddit-changemyview/r/changemyview/comments/nblug9/cmv_there_is_a_reasonable_case_that_at_least_some.json": "アメリカの法律では Treason [https://www.law.cornell.edu/uscode/text/18/2381] と定義されています。\n以下のように定義されています。\n\n> 米国に忠誠を誓っているにもかかわらず、米国に対して戦争を仕掛けた者、または\n> 米国に忠誠を誓って、米国に対して戦争を仕掛けたり、米国の敵に忠誠を誓って、米国内やその他の場所で彼らに援助と慰めを与えた者は\n> またはその他の場所で、反逆罪を犯す。\n\nこのミラー...",
  "data/reddit-changemyview/r/changemyview/comments/nblybr/cmv_the_nobody_meme_is_fundamentally_flawed.json": "ジョークの前提は、誰も何も言わなかったのに、実際の対象者である誰かが\nミームの対象者である誰かが、何も言わずに何か馬鹿げたことや無意味なことで反応したというものです。\n\nしかし、このミームは、現在いつも表示されているように、「誰も」や「誰か」ではなく、「誰も」が何も言わないことを示しています。\n誰か」や「みんな」が言うのとは対照的に、「誰も」が何も言わない。",
  "data/reddit-changemyview/r/changemyview/comments/nblesv/cmv_cyberattacks_on_infrastructure_are_terrorism.json": "最近、米国東部の主要な燃料供給パイプラインがサイバー攻撃を受けました。\n疑問が浮かび上がってきました。パイプラインに対する物理的な妨害行為があったとして\nパイプラインに対して物理的な妨害行為が行われ、そのパイプラインが数日間にわたって停止したとしたら\nそれはテロ行為として扱われます。加害者は、もし...",
  "data/reddit-changemyview/r/changemyview/comments/nbwqwi/cmv_it_should_be_illegal_for_huge_media_companys.json": "そんなことをしても全く意味がありません。世界を悪くするだけです。人は\n何でもニュースに頼ってしまいます。天気予報も、大統領候補の情報も、自分の街で起きていることも、ニュースを見ます。\nニュースを見るのは、天気、大統領候補の情報、自分の街で何が起こっているかの情報などなど\nその他にもたくさんあります。このような誤った情報は、本当に...",
  "data/reddit-changemyview/r/changemyview/comments/nc97zz/cmv_it_is_completely_appropriate_for_free_music.json": "ねえ。\n\n昔（私はまだ子供でした）は、音楽を買うか、海賊版を買うかのどちらかで、その間はなかったと記憶しています。\n買うか、海賊版を買うか、その中間がなかったと思います。好きなアーティストの新しいアルバムが出ると（私の両親は私に幅広い音楽を見せてくれました。\n私の両親は私に幅広い音楽を見せてくれました）好きなアーティストの新しいアルバムが出ると、私は母に12ドルの出費を懇願しました。\n12～15ドルのお金を使うように母に頼んでいました。\n\n事実、私はいくつかの...",
  "data/reddit-changemyview/r/changemyview/comments/nce7e6/cmv_cattle_farming_needs_to_be_massively_reduced.json": "畜産業は最悪です。畜産農家に悪意はありません、なぜなら個人レベルでは\n個人レベルでは問題ないかもしれませんが、現在の畜産業の運営方法はひどいものです。さて。\nこれらの批判の多くは全ての畜産業に当てはまるが、工業的な畜産業に最も関係がある。\n工業的な畜産に最も関連しています。\n\nまず、それは...",
  "data/reddit-changemyview/r/changemyview/comments/ncreqn/cmv_vaccine_hesitancy_is_not_the_same_as_antivax.json": "ワクチンを受けることに懐疑的な人々に対して、多くの反発が見られます。\n特に、FDA（米国食品医薬品局）の完全な承認を得ていないという文脈で、ワクチンの摂取に懐疑的な人々に反発しています。\n私の考えでは、マスクをして、ウイルスを広げないように最善を尽くしている限り、全く問題ないと思います。\n私の意見としては、マスクをして、ウイルスを広めないように最善を尽くしている限り、全く問題ないと思います。",
  "data/reddit-changemyview/r/changemyview/comments/ncztb5/cmv_a_sustainable_and_healthy_vegan_diet_would.json": "一般的に考えられていることとは異なり、脂肪は人間の生活においてかなり重要な栄養素です。\n工場で加工される前の主な摂取源の一つは、乳製品や動物の脂肪であった。\n乳製品や動物性脂肪などの動物から摂取していました。\n\n現在、私たちが食べている食品の多くは、季節に応じて... 1800年のボストニアンは\n食べていませんでした...",
  "data/reddit-changemyview/r/changemyview/comments/ndg18m/cmv_the_best_way_to_end_racial_inequality_is_for.json": "人種で人を判断する理由は（誰にも）ありません。そうしようとすると\nしようとすると、不平等に対抗するために不平等を利用することになり、結局、平等は生まれません。\n平等にはなりません。\n\n誰かが他の人よりも知的であるならば、その人は報酬を受けるに値する。\n報酬に値するのは、その人が有能だからであって、他の人がどうかということではありません。",
  "data/reddit-changemyview/r/changemyview/comments/ndktgm/cmv_if_god_exists_he_wouldnt_care_if_i_was.json": "今日、そして歴史上、非常に多くの異なる宗教が存在します。\n崇高な力が存在していて、その力のために特定のことをしなければならないと主張しています。\n祈り、祝日を祝い、犠牲的な供物を捧げるなど）。部外者である私は\n部外者（無神論者）である私には、ある宗教がより「正しい」かどうかはわかりませんが...。",
  "data/reddit-changemyview/r/changemyview/comments/ndnadp/cmv_if_someone_is_reliant_on_your_body_for.json": "賛成派が「中絶は殺人だ」と言うと、毎回腹が立ちます。だって、もしそうだったら\nもしそうだとしたら。私たちは社会の中で常に「殺人」を許容しています。戦争、処刑、自治。\n戦争、処刑、自主性。例えば、胎児が完全に成長した人間だったとしましょう。\n人間だったとしましょう。そして、その人称の状態についての議論はなかった。\n\n完...",
  "data/reddit-changemyview/r/changemyview/comments/ndu6nr/cmv_gentrification_is_a_difficult_but_necessary.json": "ジェントリフィケーションが多くの人々にとって困難なプロセスであることには絶対に同意します。\nそれによって傷つく人もいるだろうし、人を不快にさせる理由も理解できます。\n不快に感じる人がいることも理解できます。\n\nしかし同時に、ほとんどの進歩は困難なものです。\n\nジェントリフィケーションとは何かを評価してみましょう。人々はそこに人種的な要素を加えますが\n誰でも...",
  "data/reddit-changemyview/r/changemyview/comments/ndx7kw/cmv_the_persons_responsible_for_the_current_price.json": "この命を救う薬の利益率は、合理的なものを超えています。I\nこのような価格を設定したり、支持したりする人たちは、間接的に\nその結果起こる死、痛み、苦しみ、精神的苦痛に間接的に責任があると思います。\n私は、これらの価格を設定したり、支持したりする人々は、結果として起こる死、痛み、苦しみ、精神的苦痛に間接的に責任があると考えます。歴史的に見ても、合法だからといって...",
  "data/reddit-changemyview/r/changemyview/comments/ne0wmi/cmv_requiring_everyone_to_state_their_pronouns_is.json": "私はCISです。まずはそれから始めます。もうお分かりだと思いますが。\n\n代名詞を明示しない限り、全員を「彼ら/彼女ら」と呼ぶべきだという圧力が高まっています。\n代名詞を明示しない限り、全員を「彼ら/彼女ら」と呼ぶべきだという圧力がかかっています。だから今、次のような圧力もかかっています。\n誰もが自分の代名詞を明示するように圧力をかけられています。\nとして...",
  "data/reddit-changemyview/r/changemyview/comments/ndt26l/cmv_you_can_hate_the_cruel_religion_of_islam_and.json": "私は合理的な無神論者として、あらゆる宗教や迷信を軽蔑しています。\n特にイスラム教は、現代において最も残忍で抑圧的で残酷な宗教の一つです。\nこの時代の最も残忍で抑圧的で残酷な宗教です。\nそうは言っても、この宗教の最大の犠牲者はイスラム教徒であると私は確信しています。\n確信しています。彼らの唯一の罪は、生まれながらにして...",
  "data/reddit-changemyview/r/changemyview/comments/ne5mrx/cmv_just_because_a_story_bookmoviewhatever_has.json": "今日、あるスレッドを読んだのですが、そこでは多くの人が「指輪物語」に何か変更を加えるとしたら\n指輪物語にどんな変更を加えるかを話し合っていました。人気のある提案は\n正直なところ、これには腹が立ちました。\n人種差別をなくすことは、物語のアークをなくすことでもあるからです・・・。",
  "data/reddit-changemyview/r/changemyview/comments/nerkh7/cmv_advocating_for_policy_that_makes_your_life.json": "redditでは、主に右翼を「自分たちの利益に反する投票をした」などと批判している人を何度も見かけました。\n\"自分の利益に反する投票をした」などと主に右翼を批判しているのをよく見かけます。彼らの政治については何とでも言えますが\n自分の利益のために投票すべきだという議論には欠陥があります。\n自分の利益のために投票すべきだという議論には欠陥があります。また、私が見た...",
  "data/reddit-changemyview/r/changemyview/comments/netc91/cmv_adoption_should_be_free_and_foster_care.json": "いつものことですが、「カナダではこうしている」とか「ヨーロッパやEUではこうしている」とウェブで検索していると\nカナダではこうしている」とか「ヨーロッパやEUではこうしている」ということをウェブで検索していると、「草はもっと青くて、ここには葉っぱしかない」ということに気づきます。\nカナダやヨーロッパでは、養子縁組は100％無料です。\n\nカナダとヨーロッパでは、養子縁組は100％無料ですが、あなたがその人の能力を確認するために厳しいプロセスを踏まされます。\n厳格なプロセスを経て、あなたに能力があるかどうかを確認します。",
  "data/reddit-changemyview/r/changemyview/comments/nev5mz/cmv_planned_obsolescence_is_the_same_as.json": "まず、計画的陳腐化とは、コスト削減のために質の悪い部品や材料を使うこととは違います。\nコスト削減のために品質の悪い部品や材料を使うこととは違います。計画的陳腐化(P.O.)とは、意図的に以下のような設計上の欠陥を盛り込むことです。\n計画的陳腐化（P.O.）とは、意図的に設計上の欠陥を盛り込み、一定期間後に製品が動作しなくなったり\n計画的陳腐化（P.O.）とは、ある一定の時間が経過すると製品が動作しなくなったり、性能が低下したりするように、意図的に設計上の欠陥を含めることです。これには必要なアイテムは含まれていません...",
  "data/reddit-changemyview/r/changemyview/comments/nf0az2/cmv_the_ethnicity_of_the_voice_actor_should_not.json": "私の友人は、あるアニメスタジオが、自分が演じるキャラクターと同じ民族の声優だけを起用することを推進していることに拍手を送っていました。\nあるアニメスタジオが、キャラクターと同じ民族の声優だけを起用していることに拍手した友人がいます。\nしていることを賞賛した友人がいます。彼女の言い分は、その方がキャラクターに忠実になれるというものでした。\n\n私は、文化的な理解がより重要であると主張しました...",
  "data/reddit-changemyview/r/changemyview/comments/nfhhgz/cmv_everyone_running_for_office_in_office_or_in_a.json": "政府を構成する個人を、企業や外国人による外部からの影響から確実に保護することは\n政府を構成する個人が、企業や外国人による外部からの影響を受けないようにすることは、民主主義を強固なものにするための重要な要素です。\n民主主義を強固なものにするための重要な要素です。税金を公開することで\n不当な影響の兆候がないかどうかを確認することができます。それは...",
  "data/reddit-changemyview/r/changemyview/comments/nfk3ns/cmv_nudes_are_not_a_gift_and_should_be_deleted.json": "最初に断っておきますが、私は法律上の成人を撮影した写真のみを対象としています。\n撮った写真のみを対象としています。未成年者に言及しているわけではありませんし、そのようなコメントには返信しません。\nそのようなコメントには返信しません。\n\nまた、この記事のポイントは、法律や一般的な圧力とは異なり、個人のモラルを考慮することでした。\nこの投稿のポイントは、法律や典型的な圧力ではなく、個人的なモラルにあると考えています...",
  "data/reddit-changemyview/r/changemyview/comments/nfhnc1/cmv_people_who_live_in_europe_and_claim_to_have.json": "私はこれを見るとイライラしてしまいますが、私にはその違いがよくわかりません。\nどちらも安全な場所を離れているわけではなく、文化も比較的似通っています。\n例えば、新しいメキシコ人がメイン州の人々と全く正反対であることや、アラスカが日本とは違うことと比べれば、文化は比較的似ています。\n例えば、新しいメキシコ人がメイン州の人々と全く正反対であることや、アラスカがカリフォルニアとは全く違うこと、そして...。",
  "data/reddit-changemyview/r/changemyview/comments/nf22cc/cmv_i_cant_seem_to_believe_in_nonbinary.json": "参考までに、私はシスの女性です。私は普段はとても寛容でオープンマインドなのですが\nノンバイナリーという概念にはどうしても納得がいきません。私はジェンダーを\nトランスジェンダーは完全に受け入れますが。I\n私は、性別は「アイデンティティ」ではないと思っていますし、あなたが...",
  "data/reddit-changemyview/r/changemyview/comments/ng0v94/cmv_police_shouldnt_give_so_many_instructions_to.json": "私が言っているのは、「読む権利」のことではなく、次のような状況のことです。\n誰かが警察に投降しようとしているとき（多くの場合、複数の警官が銃を向けているとき）に\n誰かが警察に降伏しようとしているときのことだ。) 警察官がそれぞれ異なる命令や指示を同時に叫ぶことはよくあることです。\nそれぞれの警官が異なる命令や指示を同時に叫ぶのはよくあることです。例えば、次のような命令です。",
  "data/reddit-changemyview/r/changemyview/comments/ng964d/cmv_wanting_to_be_in_the_beauty_standards_is_okay.json": "私は、ありのままの自分を愛する人々を全面的に支持します。私の意見としては\n世界が美の基準に関して、より寛容な社会に向かっているのは素晴らしいことだと思います。\n私の意見では、世界が美の基準に関してより寛容な社会に向かっていることは素晴らしいことです。しかし、人に合わせて自分を変えようとする誰かの心を変えようとする人は嫌いです。\n誰かの心を変えようとする人は嫌いです。例えば、私の場合は...",
  "data/reddit-changemyview/r/changemyview/comments/ngapwd/cmv_reddit_is_a_terrible_place_for.json": "タイトルが全てを物語っています。私は、人々がアドバイスを求める投稿をどれだけ見てきたことでしょう。\n些細なことでも「別れたほうがいい」というコメントがたくさんあります。\n別れた方がいい」というコメントがたくさん寄せられているのをよく目にします。\nここまでくると、redditorsがいつも同じようなことを言うという内輪のジョークになってしまいます。",
  "data/reddit-changemyview/r/changemyview/comments/ngw1i0/cmvthe_chicago_mayor_refusing_to_do_interviews.json": "ご存知ない方もいらっしゃるかもしれませんが、シカゴ市長は、1on1のみを提供すると述べています。\nインタビューをするのは「有色人種」に限ると述べています。\n[https://wgntv.com/news/politics/mayor-lightfoot-defends-granting-interviews-to-only-black-and-brown-journalists/]\n\nもし、ガルセッティ（ロサンゼルス市長であり、日本でもおなじみ）が1対1のインタビューに応じたらどうなるか、ちょっと想像してみてください。",
  "data/reddit-changemyview/r/changemyview/comments/nh9kda/cmv_factory_farming_is_literally_the_worst_thing.json": "この記事では、「モノ」とは、単一のシステム／イベント／を指します。\nの発生を意味します。もちろん、工場での農業は、工場での農業＋私がつま先をぶつけたことよりも悪いことではありません。\nしかし、工場での農業と私がつま先をぶつけたことは、一つの「事」ではありません。\n\"thing\" 同様に、ホロコースト、アメリカの奴隷制度、アルメニアの...",
  "data/reddit-changemyview/r/changemyview/comments/nhk4ae/cmv_donald_trump_wasnt_the_worst_president_in.json": "ドナルド・トランプを「史上最悪のアメリカ大統領」と呼ぶことは、一般的な言説と主流メディアの両方で流行しています。\nドナルド・トランプ氏を「史上最悪のアメリカ大統領」と呼ぶことが流行しています。私にはどうしても\n私にはその意見が理解できません。\n\n確かに、トランプ氏は犯罪者であり、人種差別主義者であり、馬鹿であり、自己愛の強い社会病質者であります。\n喜んで人を殺すでしょう。",
  "data/reddit-changemyview/r/changemyview/comments/nhxbaf/cmv_as_long_as_it_looks_like_youre_trying_i.json": "昨日、友人たちとレストランに行ったのですが、その時のウェイトレスが非常に\n非常に新しい人でした。\n\nそして悪い。\n\n\n\n凄く悪い。\n\n\n\n彼女は前菜の注文を受けてから、再びテーブルを回って\n前菜を注文した後、再びテーブルを回ってメインディッシュを注文したのですが、1つ足りなかったので、友人が彼女を呼び戻さなければなりませんでした。\n私の友人は彼女が振り向いた後に呼び戻さなければなりませんでした・・・。",
  "data/reddit-changemyview/r/changemyview/comments/nhu3dd/cmv_its_immoral_to_choose_to_have_deaf_children.json": "ろう者の文化は、歴史、芸術、共有された価値観や制度で豊かです。過去には\n聴覚障害者の親になろうとする人たちの中には、現代の医療技術を使って\n自分の子供が耳の聞こえない人であることを保証するために\n[https://www.theguardian.com/science/2008/mar/09/genetics.medicalresearch]としています。\nある人は...",
  "data/reddit-changemyview/r/changemyview/comments/nhvc79/cmv_the_biggest_reason_for_the_large_increase_in.json": "12年前、私の友人は陸軍の救急救命士としての経験を生かして\nカメラ付きドローンを飛ばしてパイプラインや送電線の検査をするビジネスを始めました。\n検査をするビジネスを始めました。これは非常に成功しましたが、私は米軍がこのような素晴らしい情報収集能力を知っていると思っていました。\n情報収集能力の高さを知っていると思っていましたが...",
  "data/reddit-changemyview/r/changemyview/comments/nig96c/cmv_although_filmmakers_and_actors_may_be_very.json": "私は映画が大好きで、いつかはショートフィルムを作りたいと思っています。でも、どうしても\n努力しても見返りが少ないような気がしてなりません。例えば、2、3世代後には\n2、3世代後には、どんなに有名な映画でも忘れ去られてしまい、そのストーリーも\nどんなに人生を変えたり、感動させたりしたとしても...。",
  "data/reddit-changemyview/r/changemyview/comments/niij3k/cmv_decorative_glittersparkles_below_a_certain.json": "私の見解です。\n\nある直径以下のキラキラとしたものは、生態学的、倫理的、そして人間の健康上の問題を十分に引き起こすため、法的に規制する必要があると思います。\n人の健康にも影響を及ぼすと考えます。\n\n私の理由は\n\n 1. 生態系-キラキラとしたものは、表向きはマイクロビーズやプラスチックと変わりません。\n    プラスチック\n    [https://www.fda.gov/cosmetics/cosmetics-laws...",
  "data/reddit-changemyview/r/changemyview/comments/nir17h/cmv_kicking_your_child_out_when_they_turn_18_is.json": "少なくともアメリカでは、子供が18歳になったら家を出なければならないと考える親が多いようですね。\n18歳になったら、家を出なければならないと考える親が多いようです。この考え方は、多くの理由から私には残酷に思えます。\n(親がまだ子供をそこに置いておく余裕があると仮定して)。\n\n 1. 1.高卒の学歴だけでは、生活費を得るのに十分ではない。\n  ...",
  "data/reddit-changemyview/r/changemyview/comments/nj21xr/cmv_we_should_be_able_to_block_subreddits_just.json": "率直に言って、redditでのcivilという言葉は、このサイトでの投稿の5%以下にしか使えないでしょう。\nこのサイトの投稿の5％以下にしかなりません。それを考えると、自分が登録したコミュニティの外に出るのは\n自分が登録したコミュニティの外に出ることは、すでに少し危険なことなのです。いつ\n自分の発言がいつ嫌がらせにつながるかわからないし、それに...",
  "data/reddit-changemyview/r/changemyview/comments/njicb3/cmv_helicopter_parents_is_the_worst_kind_of.json": "最近、私はヘリコプターペアレントによく遭遇します。私には理解できないのですが\n理解できません。子供の身体的な安全を確保することが重要であることには全く同意します。\nしかし、精神的な健康や社会的な経験を犠牲にしてはいけません。\n\n私の近所には、5歳の子供を手の届く範囲から離さない人がいます...。",
  "data/reddit-changemyview/r/changemyview/comments/njjv8n/cmv_snitching_needs_to_stop_being_seen_as_a_bad.json": "何かを見たら、何かを言う。ほとんどの場合、問題はありません。\nほとんどがそうです。伝えるべきことを伝えるのと、ただ単に物事にケチをつけるのとでは大きな違いがあると思っています。\n些細なことは気にしないようにしましょう。\nもし、あなたが暴行を受けていて、私が角を曲がったところに来て...。",
  "data/reddit-changemyview/r/changemyview/comments/njnb8j/cmv_all_the_problems_people_attribute_to.json": "世界のあらゆる問題を資本主義のせいにしている人をよく見かけますが\nこれらの問題は、社会主義の下でも同じように簡単に存在するでしょう。\n\n私は、問題は資本主義ではなく、腐敗にあると思います。腐敗は、社会主義のもとでも\n腐敗は社会主義の下でも存在し、私たちを悩ませているすべての問題が\n今日、私たちを悩ませているすべての問題は、...",
  "data/reddit-changemyview/r/changemyview/comments/njtfhb/cmv_americans_who_do_not_want_universal.json": "自分の税金を少しでも安くするために、お金がないからといって母親が子供を医者に連れていけないようにするのは\n自分の納税額を少しでも減らすために、母親に子供を医者に連れて行く余裕がないことを嫌がるのは、嘆かわしいことです。癌患者が\n癌患者が、自分の家に帰れないことを心配しなければならないとは\n癌患者が、救命治療のために家を売らなければならなかったために、帰る家がないという心配をしなければならないというのは...。",
  "data/reddit-changemyview/r/changemyview/comments/njup6u/cmv_obsession_with_picking_a_side_is_one_of_the.json": "私は、投票日になるとどちらかを選ばなければならないと思っています。\n特に、多くの投票システムの自然な結果として生じる2つの政党システムを考えると、どちらかを選ばなければなりません。\nしかし、自分の「側」がすることすべてに賛成する必要はありません。\n\"しかし、自分の「側」がすることすべてに賛成する必要はありませんし、相手の「側」がすることすべてに反対する必要もありません...",
  "data/reddit-changemyview/r/changemyview/comments/nk53af/cmv_the_politicizationpolarization_of_covid_and.json": "私はこれまで、「ワクチンで自閉症になる」というアンチ・ヴァックス派ではありませんでした。そして正直なところ、私は\n展開されているコビドワクチンは、現代科学の奇跡だと思います。\n\nとはいえ、ウイルス自体を政治的に取り上げることが多く、誤った情報が流布してしまっています。\n誤った情報につながっています。両者ともに。これが顕著に伝わり、簡単に...。",
  "data/reddit-changemyview/r/changemyview/comments/nke8rk/cmv_the_palestineisrael_conflict_is_not_some.json": "私の見解ですが\n\n * イスラエル人はパレスチナに正当な権利を持っていません。\n * 1948年に彼らの国が作られる前に、イスラエルは存在しなかった。\n   国際協定に違反している）。)\n * 紀元前1000年（3000年以上前）の古代部族の話は・・・。\n   としてカウントされません。",
  "data/reddit-changemyview/r/changemyview/comments/nkytt6/cmv_touch_buttons_in_cars_are_a_safety_risk.json": "最近の車には、タッチスクリーンやタッチボタンが搭載されています。残念ながら多くの\n昔ながらのボタンやノブを排除して、インフォテイメントシステムに組み込んでもいいと考える自動車メーカーが多いのが残念です。\nノブを排除してインフォテインメントシステムに統合することを良しとしています。\n\nつまり、ドライバーがエアコンの温度を調節したいときには\n押す...",
  "data/reddit-changemyview/r/changemyview/comments/nky2l1/cmv_dark_mode_is_better_than_light_mode.json": "ダークモードを使うと、目に光が入らないので気持ちがいいです。\n夜間など周囲が薄暗い場合は特に重要です。見た目だけでなく\n見た目が良くなるだけでなく、目が疲れにくくなります。\n\nダークモードは、夜間に使用するのに適しているだけでなく、光よりも優れています...",
  "data/reddit-changemyview/r/changemyview/comments/nl2txh/cmv_we_should_stop_throwing_around_the_term.json": "私は、「社会主義／社会主義者」という言葉は、せいぜい曖昧な言葉で、しばしば脱線してしまいます。\nアメリカでは、有益な政治的議論ができないことが多いのです。右派の人々が\n右派の人々が「社会主義」と言うとき、彼らが思い浮かべるのは典型的には\nよく言えばお粗末な福祉国家、悪く言えば残忍な全体主義....",
  "data/reddit-changemyview/r/changemyview/comments/nlnm1c/cmv_people_who_believe_women_are_queens_are.json": "基本的にタイトルにあるように、女性は女王であり、このように扱われなければならない。\n女性は女王であり、このように扱われなければならず、もし浮気をしたり別れたりしたら、それはあなたのせいです。\nツイッターやフェイスブック、そして私が知っているほとんどの人が抱いている信念です。私が思うに\n彼らはインセルを生み出した責任があると言えるでしょう...",
  "data/reddit-changemyview/r/changemyview/comments/nlogxm/cmv_musical_stars_are_no_more_talented_than_tens.json": "私は音楽家ではありませんが、多くの \"スター \"の声の悪さにはいつも気づかされます。\n\"スター」の声がいかに悪いかを一貫して感じています。ボブ・ディランのように、ほとんど歌えないという極端な例もある。\nしかし、一般的には、ラジオから聞こえてくる平均的なミュージシャンの音楽的才能には何の感銘も受けません。\nもっと一般的に言えば、ラジオから聞こえてくる平均的なミュージシャンの音楽的才能には何の感銘も受けません。私はよく...",
  "data/reddit-changemyview/r/changemyview/comments/nlr1fm/cmv_there_is_nothing_inherently_racist_about_not.json": "はっきり言って、黒人に対するステレオタイプ（「黒人はXYだと思う」）や人種間の対立が原因で黒人と付き合いたくないというのは\n黒人に対する固定観念（「黒人はXYだと思う」）や、異人種間の交際に反対して、黒人と交際したくないというのは、確かに人種差別的です。\nは、確かに人種差別的です。しかし、肌の色に惹かれないという理由で黒人とデートしたくないというのは、人種差別ではありません。\nしかし、肌の色に惹かれないために黒人とデートしたくないというのは人種差別ではありません。\nほとんどの人は、...",
  "data/reddit-changemyview/r/changemyview/comments/nm8dy4/cmv_just_because_something_is_offensive_or_edgy.json": "もちろん、越えてはいけない一線はあります。もし誰かが、真剣に誰かを怒らせようとしたり\n誰かが真剣に誰かを怒らせようとしていたり、ガスライティングをしようとしていたら、その人は\n結果に直面します。しかし、攻撃性はほとんど主観的なものです。インターネット上では\nインターネット上の）人々は、ジョークのために仕事を失い、大量の...",
  "data/reddit-changemyview/r/changemyview/comments/nmg704/cmv_nuclear_energy_is_good.json": "気候変動は人類の脅威であり、エネルギー部門は世界の温室効果ガスの3分の2以上を排出しています。\n世界の温室効果ガス排出量の3分の2以上を占めています。この割合は、原子力エネルギーが利用されていれば\n原子力がもっと普及していれば、この割合はもっと低くなるはずです。石炭発電所で1テラワット時の電力を生産すると\n石炭発電所で1TWhの電力を生産すると、世界全体の温室効果ガス排出量の273倍になります。",
  "data/reddit-changemyview/r/changemyview/comments/nmo3qd/cmv_you_shouldnt_be_allowed_to_post_pictures_of.json": "私は親ではないので、ここでは違う視点からの意見に興味がありますが、私は\n少なくとも18歳になるまでは、子供の顔写真をネットに掲載することは許されないと思います。\n最低でも18歳になるまでは。\n\n私のポイントは\n\n 1. 私は、ソーシャルメディアがまだ普及していない時代に育ったので、この問題はありませんでした。\n    しかし、私たちはどのように...",
  "data/reddit-changemyview/r/changemyview/comments/nn08k5/cmv_ducks_are_a_better_pet_andor_farm_animal_than.json": "ちょっとおバカな話ですが、聞いてください。ニワトリは大好きですが、アヒルが\nが王冠を手にします。以下が私の主張です。\n\n1) アヒルの方が断然かわいい。悪気はありませんが、アヒルの子の方が勝つでしょう\nいつもそうです。大人になっても、見ていて笑えます。\n一日中ゴロゴロしています。\n\n2)彼らは...",
  "data/reddit-changemyview/r/changemyview/comments/nmox5k/cmv_the_covid_lotteries_in_the_us_are_a.json": "本当に、このタイトルがすべてを物語っています。アメリカの複数の州（オハイオ州、コロラド州、カリフォルニア州。\nアメリカの複数の州（オハイオ州、コロラド州、カリフォルニア州など）では、COVIDワクチンを接種した人に抽選で数百万ドルをプレゼントしています。\nCOVIDのワクチンを接種した人に抽選で数百万ドルをプレゼントします。このお金は、州からの（通称。\n税金）です。) 私は、これは資金の著しい誤用であり、...",
  "data/reddit-changemyview/r/changemyview/comments/nn6e4b/cmv_if_one_of_my_coworkers_resigns_andor_is_fired.json": "もしあなたの職場で従業員がいなくなり、その代わりにあなたが仕事をしなければならなくなったら\nあなたの雇用主は、あなたにもっと多くのお金を与えるべきだと思います。その人に給料を払っていないのだから、その人には\nその人に給料を払っていないのですから。なぜそれが公平なのか？\n本来ならば無料でやらなければならないことを",
  "data/reddit-changemyview/r/changemyview/comments/nnm901/cmv_child_abusers_should_be_registered_into_a.json": "児童虐待は、私たちの社会に広く浸透している問題であり、その影響は深刻です。\n壊滅的な影響を与えます。虐待は、大人になっても続く深刻な脳の損傷を引き起こす可能性があります。\nうつ病、統合失調症、IQや学業成績の低下などの神経認知機能の障害、さらには\nIQや学業成績の低下、イライラ、...などの神経認知障害を引き起こす可能性があります。",
  "data/reddit-changemyview/r/changemyview/comments/nnnme1/cmv_additional_taxes_on_gasoline.json": "Context:\n\n> カリフォルニアに住んでいる人はガソリンが5ドルになる準備を、そうでない人も...\n> \n> カリフォルニア州の法律がガソリン価格を押し上げていますが、バイデン政権は\n> バイデン政権はこれらの法律を全国的なものにしようとしています...\n> \n> カリフォルニア州のドライバーはなぜポンプで高い料金を払うのか？より高いオクタン価のブレンドのせいだ\n> 税金と...",
  "data/reddit-changemyview/r/changemyview/comments/nnp64p/cmv_science_requires_a_certain_degree_of_faith.json": "まず、私は無宗教ですし、科学の知識もあります。しかし、現実には\n平均的な人にとっては、科学は一種の信仰のようなものです。一般の人は、あるテーマについて十分な知識を得るための\nあるテーマについて十分な知識を得るためには、時間も理解力もありません。そこに到達するには\n一生かかっても無理です。そのため、彼らの見解は...",
  "data/reddit-changemyview/r/changemyview/comments/nodx2w/cmv_jesus_would_prefer_socialist_policy.json": "ジーザスは、収益に投資し、誰もが平等に教育や医療を受けられるようにすることを信じるでしょう。\n誰もが平等に教育や医療を受けられるようにすることを第一に考えるでしょう。税金を払うことを盗みとは考えないでしょう。\n税金を払うことを盗みだとは思わないでしょう。もしあなたに自由意志があるのなら、億万長者にならずに税金を払う自由意志もあるはずです。\n自由意志があるなら、億万長者にならず、税金を払わない自由意志もあるはずです。普通の人になればいいんだよ、もし...。",
  "data/reddit-changemyview/r/changemyview/comments/no3sn7/cmv_employers_should_not_be_able_to_fire_someone.json": "私はモラル条項と呼ばれるものを指しています。仕事以外の違法な行為は\n仕事以外の違法行為は、当然のことながら上記の文言には含まれません。\n\n企業が従業員にモラル条項に署名させることに問題があるのは\n企業が従業員にモラル条項に署名させることに問題があるのは、モラルがグレーなテーマだからです。このことは、中絶を見ればわかります。",
  "data/reddit-changemyview/r/changemyview/comments/nohfww/cmv_prayingthanking_god_for_foodwatershelter_etc.json": "私は、神が存在するかどうかという点ではなく、仮に存在するとします。\n\nこのようなことに感謝するのは愚かなことです。なぜなら、あなたは本質的に、問題を解決するために問題の原因に感謝しているからです。\n問題を解決してくれた問題の原因に感謝することになるからです。\n\nこれを別の言葉で表現してみましょう。\n\n私がわざとビルに火をつけて人を救ったとします。しかし、もし...",
  "data/reddit-changemyview/r/changemyview/comments/nonu8s/cmv_its_messed_up_for_a_gay_person_to_stay_in_a.json": "私は決して同性愛者を嫌っているわけではありませんが、多くの人が、クローゼットに閉じこもっている同性愛者との交際を完全に容認していることに苛立ちを覚えます。\nクローゼットに閉じこもっているゲイがストレートの人と関係を持つことを完全に容認している人が多いことに苛立ちを覚えます。\n認めている人が多いことに苛立ちを覚えます。多くの人がこれを同性愛恐怖症と勘違いしていることは承知しています。\n反発を受けるのは覚悟の上です。しかし、私はあなたにお願いしたいのです...。",
  "data/reddit-changemyview/r/changemyview/comments/np11ob/cmv_if_we_simply_paid_those_that_are_unable_to.json": "私は純粋に、ほとんどの人が働きたいと思っていると思っています。しかし、ごく一部の人は働かず\n働かない人もいますし、働いても意味がない人もいます。\n働かない人がいて、たとえ働いたとしても何の意味もありません。\n\n私は、ベーシックなユニバーサルインカムを支給すれば、本当に働けない人や働きたくない人は\n働けない人や働きたくない人が、自分の好きなことをできるように、ベーシック・ユニバーサル・インカムを支給すればいいと思います。",
  "data/reddit-changemyview/r/changemyview/comments/novx8x/cmv_subreddits_directed_towards_a_race_or_gender.json": "今日、私はRedditモバイルで右にスワイプすると、たくさんの写真を見ることができることを知りました。\n存在することを知らなかったサブRedditの数々を見ることができます。\n\n新しく見つけたRedditのサブライブラリーをスクロールした後、私は次のものに出くわしました。\nr/femaledatingstrategy [/r/femaledatingstrategy].\n\nなんてことでしょう...。\n\nまずそこに投稿するには女性である必要があります。そして...",
  "data/reddit-changemyview/r/changemyview/comments/np67db/cmv_for_women_to_receive_all_of_the.json": "平等な社会を目指しているのに、人口の半分が負担を強いられるのは公平ではないと思うのです。\n人口の半分が法律によって負担を強いられ、残りの半分が同じ利益や権利を得ているのは公平ではないと思います。\n負担を強いられる一方で、残りの半分の人々が同じような利益や権利を享受しているのは公平ではないと思います。\n負担を強いられるのは公平ではありません。これは、日本の法律の正当性を問うものではありません。",
  "data/reddit-changemyview/r/changemyview/comments/np38tl/cmv_its_perfectly_okay_to_not_want_to_socialize.json": "基本的に私は30歳の自閉症の男性で、これまでの人生で一度も自分に合ったことがありませんでした。\nでした。\n\nこのことは、大学時代に自分がいかに孤立していて奇妙であるかに気づいたときに明らかになりました。\nした。懸命に努力しても、クラスメートや先生とうまくいかない。\n私はクラスメートや先生と仲良くなることはありませんでした。\n\nまた、私が気付いたのは...",
  "data/reddit-changemyview/r/changemyview/comments/npgqnc/cmv_the_amount_of_morallyquestionable_or_couplike.json": "アメリカ人として、私たちはいつも「軍隊を支援しなさい」と言われますが、多くの場合、これは無害なように見えます。\n多くの場合、これは無害なことのように思われます...。しかし、歴史を学ぶにつれ、道徳的に疑問視されていることが多く、「軍隊を支持する」ことが難しくなってきています。\nしかし、歴史を学ぶにつれ、自国がどれだけ多くの道徳的に疑問のある紛争に巻き込まれてきたかを知ると、「軍隊を支持する」ことが難しくなってきました。\n私たちの国がどれだけ多くの道徳的に疑問のある紛争に巻き込まれてきたかを知ると、「軍隊を支持する」ことが難しくなってきました。",
  "data/reddit-changemyview/r/changemyview/comments/n1wejl/cmv_buying_new_underwear_every_6_months_is_a_scam.json": "先日、友人が「医師が推奨する」買い替えの方法について話していました。\n下着は6ヶ月から12ヶ月に一度、そうでないと不衛生だという。私はそれを調べました。\n彼の主張を裏付けるような記事や文章がいくつかあることがわかりました。\nしかし、実際に調べてみると、その理由はいつも......。"
}