{
  "data/reddit-changemyview/r/changemyview/comments/obdava/cmv_inserting_nonwhite_characters_into_stories.json": "最近フローズン2の映像を見ましたが、白人以外のキャラクターがかなり多いことに気づきました。\n驚いたのは、白人以外のキャラクターがかなり多いことです。私はこのような追加の論理を理解していません。\n追加されました。Frozen』は何百年も前のスカンジナビアを舞台にしています。これは単なる\n多様性の浅い試みなのでしょうか？\n\n私が今までで一番好きな番組は「Avatar:...",
  "data/reddit-changemyview/r/changemyview/comments/obbfc0/cmv_it_is_socially_acceptable_to_make_fun_of.json": "タイトルはもっと適切に表現できたはずです。私は、社会的に受け入れられるべきだとは言っていません。\n受け入れられるべき」と言っているのではなく、「現在は（無意識のうちに）受け入れられている」と思っているということです。\nと言っているのであって、そうあるべきではありません。社会的に認められていないことを納得させてくださいと言っているのです。\n受け入れられていないことを証明してください。\n\n誰かが誤解する前に言っておきますが、これはつまり...という意味ではありません。",
  "data/reddit-changemyview/r/changemyview/comments/obfpgz/cmv_social_media_is_toxic_to_society.json": "ソーシャルメディアサイトでソーシャルメディアを批判するのは皮肉に思えるかもしれませんが、私は適切だと思います。\nしかし、私はそれが適切だと思います。\n\n私の意見では、ソーシャルメディアは人類の最悪の傾向を恐ろしく加速させ、社会を汚染しています。\nソーシャルメディアは人類の最悪の傾向を加速させ、社会に害を及ぼしていると思います。\n\n慢性的な判断、表面的な嘘、間違った情報のエコーチェンバー...。",
  "data/reddit-changemyview/r/changemyview/comments/obh4kl/cmv_piracy_can_be_justified.json": "違法コピーが正当化される理由はいろいろあると思います。\n\nまず、ある人がサービス（映画、アニメ、ゲームなど）に合法的にお金を払うだけの資金を持っていて、エンターテインメントはこうあるべきだという理由でお金を払わない場合です。\nサービス（映画、アニメ、ゲームなど）に合法的にお金を払うことができる人が、エンターテインメントは自由であるべきだと考えてお金を払わない場合。\nまず、サービス（映画、アニメ、ゲームなど）に合法的にお金を払うことができる人が、娯楽は無料であるべきだと考えてお金を払わない場合、違法コピーは正当化できません。\n\nまた、私は海賊版サービスを...",
  "data/reddit-changemyview/r/changemyview/comments/obe27y/cmv_the_less_you_focus_on_things_out_of_your.json": "ある人は、スポーツや恋愛のことで悩みます。人は、自分の好きなスポーツや\n自分の好きなスポーツチームがビッグタイトルを獲得することや、かわいい人が自分を好きになってくれることを願って、多くのエネルギーを費やします。\n自分ではどうしようもないことなのに、好きなスポーツチームが優勝したり、かわいい人に好かれたりすることに多くのエネルギーを費やす。\n自分ではどうにもできないことなのに。\n\n私の場合、それは株式市場、政治、...。",
  "data/reddit-changemyview/r/changemyview/comments/objxpa/cmv_bidens_claim_that_you_would_need_f15s_and.json": "Viewはこの文に関連しています。\n\nhttps://youtu.be/SHLHkmWoYDU\n\n根拠は？\n\nアメリカはイラク戦争でかなり負けました。確かにサダムは追い出しましたが\nしかし、イスラム過激派や元イラク軍の民兵を全く制圧できませんでした。彼らが去った後は\nイスイスは、イラクの大部分を征服するだけでなく、その強さを手に入れました...",
  "data/reddit-changemyview/r/changemyview/comments/obldx3/cmv_in_a_layman_conversation_nitpicking_on.json": "あなたの専門分野が何であれ、このような経験をしたことがあるのではないでしょうか。誰かが心理学者に\n誰かが心理学者に「フェティッシュ」のような不正確な言葉の使い方を訂正する。経済学の博士号を持っている人に\n経済学の博士号を取得している人に「無料のものはないから無料とは言えない」と訂正された。A\n物理学者が「重量」の使い方を訂正する、などなど。あるいは、個人的に...",
  "data/reddit-changemyview/r/changemyview/comments/obp7da/cmv_woman_who_demand_both_equality_and_chivalry.json": "さて、星に向かって......私が言う「騎士道精神」とは何かを明らかにしたいと思います。人に敬意を持って接するとか、ドアを開けておくとか、そういう意味ではありません。\n尊敬の念を持って人を扱うとか、ドアを開けておくとか、そういうのはまともな人間の特徴です。\n人間の特徴です。私が言いたいのは、男性が女性をデートに誘い、デートの計画を立てなければならないということです。\n私が言いたいのは、男性が女性をデートに誘い、デートの計画を立て、お金を払い、さらにその他のこと（彼女はそれを反故にするでしょうから）をしなければならないということです。",
  "data/reddit-changemyview/r/changemyview/comments/obwn05/cmv_adult_programs_and_songs_shouldnt_be_censored.json": "企業は、あなたの子供を育てる必要はありません。あなたは彼らの親であり、彼らを育てる責任があります。\n育てていく責任があります。もし、子供にある番組を見たり聞いたりしてほしくないと思うなら、それはあなたの責任です。\n番組を見たり聞いたりしたくなければ、それはあなたの責任です。ラジオで50の異なる小さな歪んだ部分を持つ歌を聞くと\n歪んだ部分が50個もある曲をラジオで聞くと笑ってしまいます。もしそれが...",
  "data/reddit-changemyview/r/changemyview/comments/obwzwl/cmv_the_line_should_be_drawn_at_theythem.json": "先日、インスタグラムを見ていたら、フォローしている人が自分のストーリーに投稿していました。\n聞いたことのない代名詞を使った複数のスライドが投稿されていました。\nその中にviv/vovとxe/xerというのがあったんです。私は、このようなものを\n私たちの社会にこのようなものが必要な理由は何もありませんし、何のメリットもありません...",
  "data/reddit-changemyview/r/changemyview/comments/obt46b/cmv_in_breaking_bad_there_are_some_serious_meth.json": "1.) 3ヶ月間、週に200ポンドのメスを作っている。(出典：The show)\n\n2.) メスは1オンス40ドルで売られている。(出典\n\nジェシーは「彼は1ポンド40ドルで売っている」と言い続けている。私はこのことについて3つの可能性を考えています。\nこれには3つの可能性があります。\n\nA.) 彼は1ポンド40ドルを意味している。メスを作るためにあらゆるリスクを負っているのに、それは\nような気がしますが・・・。",
  "data/reddit-changemyview/r/changemyview/comments/oc1c0n/cmv_a_person_should_not_be_able_to_be_charged.json": "私が大学にいた頃、ルームメイトがある夜飲みに行き、バーで誰かと口論になり\nバーで誰かと口論になって、帰ることにしたんです。彼は飲み過ぎたことに気づき\n彼は飲み過ぎたことに気付き、車を呼んだのです。8月中旬で、外はとても暑かった。\n外は8月中旬でとても暑かったので、車を待っている間、彼は自分のトラックに座って...",
  "data/reddit-changemyview/r/changemyview/comments/obywd5/cmv_certain_hairstyles_do_not_belong_to_certain.json": "白人が自分の文化でのみ着用されるべきだと信じている髪型をしていると、POCがyoutubeやtiktokで怒っているのを見たことがあります。\n自分たちの文化でのみ着用されるべきだと信じている髪型を白人がしていることにPOCが怒っているのを見たことがあります。\n理解できません。\n\n私は、ヨーロッパ人女性が北欧/バイキングスタイルの三つ編みのやり方を紹介しているYouTubeのビデオを見ていました。\n北欧/バイキングスタイルの三つ編みのやり方を紹介しているヨーロッパ人女性のYouTube動画を見ていました。彼女は2つのコーンロウを編んでいました...",
  "data/reddit-changemyview/r/changemyview/comments/oc1guc/cmv_people_should_not_have_received_their_drivers.json": "これはアメリカで起きていることです。ロードテストを受けずに運転免許証を取得した人を何人も知っています。\n運転免許証を取得した人を何人も知っています。これは、パンデミックの際に政府が行ったとんでもない\nパンデミックの際に政府が行った馬鹿げた選択です。確かに、すぐに免許を取得できない人にとっては最悪だったでしょう。\nすぐに免許を取得できない人にとっては最悪でしたが、安全のためには...。",
  "data/reddit-changemyview/r/changemyview/comments/oc4vkm/cmv_suicide_prevention_ralliessocial_media.json": "正直なところ、私は何人かの友人を自殺で亡くしています。\nそれが私の考え方の原動力になっています。人々はTシャツを作り\nTシャツを作ったり、5kmマラソンをしたり、自殺防止についてソーシャルメディアに投稿したりしました。\nTシャツを作ったり、5キロマラソンをしたり、SNSで自殺防止の記事を載せたりしています。これはいったい誰の役に立つのでしょうか？もし誰かが...",
  "data/reddit-changemyview/r/changemyview/comments/ocacpo/cmv_field_sobriety_tests_should_not_be_up_to_the.json": "アルコール以外のものでも酔う可能性があることを理解しているので\nその理由はわかっています。しかし、訓練を受けていない警察官が、実際に罪を問うかどうかを決めるのは好きではありません。\nしかし、訓練を受けていない警官が、実際に罪を問うかどうかを決めるのは好きではありません。\n私は、運転者はせいぜい酒気帯びタンクに連れて行かれて、それから釈放されるべきだと思っています...。",
  "data/reddit-changemyview/r/changemyview/comments/oc567x/cmv_equal_pay_pertaining_to_womens_football.json": "これを鵜呑みにしてはいけません。同じオフィスで同じ仕事をするなど、他のことでも同一賃金は合理的です。\nしかし、スポーツの世界では しかし、スポーツの文脈では、私は、女性のスポーツ界での同一賃金はありません。\n現在の女性市場では、女子サッカーの同一賃金は現実的ではないと思います。\n\n私のスポーツに関する一般的な知識からすると 選手の給与は通常...",
  "data/reddit-changemyview/r/changemyview/comments/ocsila/cmv_undercover_police_and_infiltrators_and.json": "警察が盗むつもりで靴のトラックを出したとしたら、論理的には\n税金で購入したものだから、一般の人に配っていたことになる。\nプレゼントしたことになります。\n\nまた、覆面パトカーやバン、クルーザーを日常的な交通違反の取り締まりに使用することは、明らかに違憲です。\nあきらかに違憲だと思いますが...。",
  "data/reddit-changemyview/r/changemyview/comments/ocvz3l/cmv_instagram_has_lost_its_edge_and_will_die_out.json": "インスタグラムは減少傾向にあり、今後数年間はその傾向が続くでしょう。\n最終的に死に絶えるまで。そう考える私の理由は以下の通りです。\n\n1 - インスタグラムはニッチを失っている\n\nインスタグラムは、写真共有プラットフォームとして成功したニッチを持っていました。\n今でも多くのクリエーターや...",
  "data/reddit-changemyview/r/changemyview/comments/ocw144/cmv_we_should_tax_the_externalization_of_a_cost.json": "例えば、鶏肉をアメリカから中国に運んで、そこで加工する方が安い。\n加工され（低賃金などの理由で安くなる）、アメリカに戻される。\nアメリカに戻ってきます。これは、海を渡ることでより多くの汚染を引き起こす、非常に恐ろしい行為です。\nこれは、海を越えた輸送のために多くの汚染を引き起こし、資本を奪う非常に恐ろしい行為です。",
  "data/reddit-changemyview/r/changemyview/comments/ocyx3j/cmv_its_okay_to_end_relationships_friendships.json": "一般的な意見とは異なり、政治とは単に税金をどうするかという違いだけではありません。\n税金をどうするかの違いだけではありません。また、民族、性別、性的指向のような、無害で中立的な属性でもありません。\n民族、性別、性的指向のような無害で中立的な属性ではありません。あなたの所属する政党は、あなたのコアバリューの反映であり\nあなたのコア・バリューの反映であり、あなたのコア・バリューは...の内容です。",
  "data/reddit-changemyview/r/changemyview/comments/od34fv/cmv_saying_thank_you_for_your_service_to_someone.json": "まず、国を守るために強制的に戦争に駆り出された場合（例えば第一次世界大戦など）には、「ありがとう」と言うのは理にかなっていると思います。\n祖国を守るために強制的に戦争に駆り出された場合（例えば第一次世界大戦とか、あれは残酷だった）には「ありがとう」と言うのはわかりますが\nしかし、それ以上のことになると、私はいつも困惑してしまいます。時々、誰かが感謝された後、文字通りスタンディングオベーションがあります。\n誰かが感謝された後、文字通りのスタンディングオベーションが行われることも...",
  "data/reddit-changemyview/r/changemyview/comments/od8z8z/cmv_i_think_that_approaching_someone_in_real_life.json": " 1. すぐにフィードバックが得られる。拒絶されているのではないか、興味を持ってくれているのに返事が遅いのではないか、などと考える必要はありません。\n    拒否されているのではないか、彼女は興味を持っているが返事が遅いのではないか、などと考える必要はありません。\n    その場で答えが返ってくるからです。\n 2. アプローチした瞬間に、世界中のイケメンたちと競争する必要がありません。\n    あなたがアプローチした瞬間に、世界中のイケメンと競争することはありません。あなたは...",
  "data/reddit-changemyview/r/changemyview/comments/odausa/cmv_as_a_married_father_of_two_young_children_it.json": "今日はみんなに最高のパフォーマンスをしてもらいたいんだ。\n私の考えを変えてほしいからです。\n\n私は10代の頃からバイクを手に入れたいと思っていましたが、お金がありませんでした。\nお金がない。今は買えるようになりましたが、私は結婚して2人の子供がいるので、どうしても\n余計なリスクを負うことになるのではないかと...。",
  "data/reddit-changemyview/r/changemyview/comments/odeibr/cmv_a_world_where_teachers_are_fired_for_their.json": "私は彼らを解雇する理由がなく、不道徳だと思います。道義に反するというのは、雇用主が法的にできないという意味ではありません。\n雇い主が合法的にできないという意味ではなく、雇い主がそんなことをしたら私は嫌だという意味です。\n私の見解は公立学校から来ています。ここでは政府が教師を雇う雇用主です。\n教師を雇う雇用主です。\n\n教師の能力が低下することはありませんが、それは...",
  "data/reddit-changemyview/r/changemyview/comments/od6h1i/cmv_mlks_a_letter_from_a_birmingham_jail_is_a.json": "誤った平和を望むリベラル派を批判したMLKの言葉は、今の世界にも通じるものを感じます。\n私たちが今生きている世界にとても近いものを感じます。黒人の私でさえ、この手紙で彼が語っているような罠に陥ってしまったほどです。\n彼がこの手紙の中で語っているような罠に陥ってしまいました。\n\n多くのマイノリティが多くの抑圧に直面していますが、デフォルトの反応はいつも「もし...」です。\nいつも「もし...",
  "data/reddit-changemyview/r/changemyview/comments/odjq8u/cmv_smoking_weed_everyday_is_not_a_healthy_habit.json": "批判されるかもしれませんが、私は毎日葉っぱを吸うことが健康的だとは思いません。\n毎日大麻を吸うことが健康に良いとは思えないし、意見が分かれているので自分の意見を変えることにも前向きです。\nこれは私の関係において論争の的となっている問題なので、私の意見を変えることに前向きです。私のパートナーは毎日葉っぱを吸うことを信じている\n私のパートナーは毎日大麻を吸っても問題ないと考えていますが、私は大麻とアルコールは似たようなものだと思っています...",
  "data/reddit-changemyview/r/changemyview/comments/od8qx8/cmv_the_daily_show_and_similar_shows_do_more_harm.json": "ジョン・スチュワート、そしてトレバー・ノアの2人は、ユーモアがあっていつも楽しく見ていました。時には\n時には、貴重な洞察や魅力的なインタビュー、印象的なジャーナリズムを披露してくれることもありました。\n印象的なジャーナリズムを披露することもありました。しかし、通常は、彼らが保守派の偽善者を非難するのを見るのが一番の楽しみでした。\n彼らが保守派の偽善を非難するのを見るのが一番の楽しみでした。\n\nしかし...。彼らは...",
  "data/reddit-changemyview/r/changemyview/comments/odavbx/cmv_peoples_outrage_over_shacarri_being_banned.json": "薬物検査に失敗したことで、多くの人が本当に怒っているようですね。それは\n薬物検査に引っかかっても何の影響もないことを望んでいる人たちはおかしいですよね。\n薬物検査に引っかかっても何の影響もないようにと考える人たちはおかしいです。私は大麻の薬物検査をすることが正しいとは思いません。\n基準はすでにそこにあるのです。彼女の母親が死んでしまったのはひどいかな...。",
  "data/reddit-changemyview/r/changemyview/comments/odrdvw/cmv_many_americans_are_ungrateful_for_living_in.json": "毎年、7月4日になると、独立を祝うという事実に対して、さまざまな人が文句を言っているのを目にします。\n私たちは独立を祝っているのです。その根拠は、現在と過去の両方の国に問題があるというものです。\n現在も過去も、この国には問題があるということです。\n\nアメリカに住むことは特権であり、それを否定することは...",
  "data/reddit-changemyview/r/changemyview/comments/odgp3z/cmv_the_usa_lost_the_afghan_war.json": "今週、ほとんどの米軍兵士がアフガニスタンを離れました。そして、ベトナムのように、それはコストのかかる大惨事となりました。\nコストのかかる大失敗だった。アフガン遠征は、アメリカにとってほとんどの基準で失敗でした。\n\n * 彼らはタリバンを倒せなかった。\n * 彼らはタリバンを倒すことができなかった。\n * タリバンを倒せなかった。",
  "data/reddit-changemyview/r/changemyview/comments/oe0e2l/cmv_if_there_isnt_space_for_white_men_to_feel.json": "最近の白人至上主義の高まりは、マイノリティや女性の受け入れや評価の高まりと直結していると思います。\n最近の白人至上主義の高まりは、マイノリティグループや女性の受け入れや評価の高まりと直結していると思います。疎外された白人男性は\n疎外された白人男性は、これらのグループが肌の色や性別などで認められているのを見て、同じことを求めます。\n認められているのを見て、同じことをしたいと思うようになりました。ただし、彼らが自分の一部であると感じられる唯一の方法は\nのように感じることができる唯一の方法です。",
  "data/reddit-changemyview/r/changemyview/comments/oe1apm/cmv_all_social_media_platforms_are_trying_to_copy.json": "すべてのソーシャル・メディア・プラットフォームは、フルスクリーンの動画を「スワイプするだけ」のプラットフォームに統合しようとしています。\nスワイプするだけ」のプラットフォームに統合しようとしていますが、私はそれが嫌いです。Redditも同じことをやっていて、私はそれが嫌いです。私は\nホームページから動画をスワイプしたときに、古いコンテンツを送り込もうとするようなクソみたいなアルゴリズムはいらない。\nそして、新しい「チャット」コメントのレイアウトも嫌いです....",
  "data/reddit-changemyview/r/changemyview/comments/oe4y7v/cmv_gmail_is_streets_ahead_of_outlook_in_everyday.json": "私は、OutlookとGmailの両方を使用する企業環境で働いたことがあります。\nはブランディングなどで特定の企業に合わせていますが、基本はGmailです。\nを使っています。) 同じような職場環境で両方を使ってみて、私が思うのは\nGmailの方がわずかに優れているというだけでなく、はるかに優れていると思います。",
  "data/reddit-changemyview/r/changemyview/comments/odx41x/cmv_crypto_is_logistically_unworkable_and_is_thus.json": "ビットコインやその他の通貨がなぜ未来の金融なのか、納得のいく答えはまだ出ていません。\n説得力のある答えはまだありません。私には明らかな、いくつかの基本的な欠陥があります。\n私には明らかです。\n\n * フィアットの価値を下げること。フィアットは、CO2のための不条理なお金の印刷のために、多くの場所ですでに良い状態ではありません。\n   フィアットは、COVID救済のために無茶苦茶なお金を刷ったために、すでに多くの場所でいい状態ではありません...。",
  "data/reddit-changemyview/r/changemyview/comments/oe4p16/cmv_im_tired_of_this_constant_attempt_at.json": "はっきり言っておきましょう。私は薬物に関してはかなりのリベラル派です。I\n合法化、課税、規則化されるべきだと思います。\n合法化されるべきだと思います。私はクリーンな人間で、酒も飲まず、タバコも吸いません。\nタバコも吸いません。マリファナやサイケデリックには興味がありますが・・・。",
  "data/reddit-changemyview/r/changemyview/comments/oeak4c/cmv_some_parents_genuinely_deserve_to_have_their.json": "虐待する親だけではなく、やりすぎた親ならなんでもいいんです。\n自己愛が強く、頑固で、視野が狭く、独りよがりで......。\n恐ろしい親を表現するために考えられるすべての言葉を使っています。毒親。\n\n毒親であれば、なぜ子供が親の面倒を見なければならないのか...。",
  "data/reddit-changemyview/r/changemyview/comments/oehe3h/cmv_continuing_to_put_people_coming_out_as_gay_in.json": "有名人がゲイであることをカミングアウトするたびに、ソーシャル・メディアでは\nカミングアウトしたことで、ヒーローだとか、強い人だとか。これが20年以上前であれば\nこれが20年以上前であれば、私は完全に同意します。しかし、最近では、プライド月間が設けられていて、かなりの数の有名人がゲイであることを公表しています。\n今では、多くの人々がゲイを受け入れているので、私は...",
  "data/reddit-changemyview/r/changemyview/comments/oem7nf/cmv_dog_breeds_such_as_pugs_dachshunds_and.json": "見出しにあるように、ある種の犬種（他の動物も）は、動物の福祉のために存在すべきではありません。\n動物の福祉のためには存在すべきではありません。私はパグを飼っていた多くの人を知っています。\nパグを飼っていて、呼吸を直すために獣医に連れて行かなければならない人をたくさん知っています。\nなぜなら、彼らの顔の構造は完全に破壊されているから...。",
  "data/reddit-changemyview/r/changemyview/comments/oejsee/cmv_its_not_racist_to_not_being_able_to.json": "これに応えたものだと正直に言うと\n[https://www.reddit.com/r/WhitePeopleTwitter/comments/odaxhu/they_can_barely_manage_english/?utm_medium=android_app&utm_source=share]\n数日前に爆発したr/whitepeopletwitter [/r/whitepeopletwitter]の投稿です。\nこの投稿では、次のような人は人種差別者だと主張しています。",
  "data/reddit-changemyview/r/changemyview/comments/oew0yl/cmv_it_should_be_illegal_for_health_insurance.json": "アメリカを拠点にしているのは明らかです。私の意見では、保険会社が一般消費者が利用できない「プランの割引」を利用できることは違法であるべきです。\n一般消費者が利用できない「プランの割引」を保険会社が利用できるのは違法だと思います。\n違法にすべきだと思います。例えば、私は最近、血液検査と画像診断が必要になりました。クエスト\ndiagnostics社は2回の血液検査で合計800ドル近くを請求しました....",
  "data/reddit-changemyview/r/changemyview/comments/of1s67/cmv_reddit_has_gone_from_the_front_page_of_the.json": "長い間潜んでいて、時々コメントをしていますが、まず最初に、このことをお伝えしたいと思います。\nこれは明らかにすべての人やredditのすべてに当てはまるものではないことをお伝えしたいと思います。\nこれは全ての人やredditの全てに当てはまるものではありません。物事を学ぶのに最適なサブサイトはたくさんあります。\nまた、他の有用な情報から適切な洞察を得ることも簡単です。",
  "data/reddit-changemyview/r/changemyview/comments/oexrwn/cmv_the_best_years_of_your_life_are_alwaysnow_so.json": "多くの人が自分の人生を見て、「自分は若すぎる、もっと年を取らなければならない」と感じています。\n中年の人たちは、「あの時、今の自分を知っていれば」と後悔したり、自分の人生がいかにくだらないものかを考えたりして時間を無駄にしています。\n後悔したり、今の人生がいかにくだらないかを考えて時間を無駄にしている。\nしかし、彼らは、どんなに陳腐であっても、あなたの...",
  "data/reddit-changemyview/r/changemyview/comments/of8y6f/cmv_the_united_states_is_slowly_but_totally.json": "救いようのない政治的偏向から、化石燃料への永遠の依存、精神衛生・医療の危機、銃による暴力まで、さまざまな問題があります。\nメンタルヘルスとヘルスケアの危機、そして銃による暴力まで。市民権はさておき\nこれは小さな脚注ではなく、大きな改善であることは理解しています）を除けば\n文字通り何も良くなっていない、改善されていないように思えます。",
  "data/reddit-changemyview/r/changemyview/comments/ofa28a/cmvtheres_a_distinct_double_standard_between.json": "最初に断っておきますが、これは女性を非難するためのものではありません。\n女性を非難するためのものではありません。サブページの説明にあるように、私は自分の見解が間違っているかもしれないと理解しています。\n私の見解には欠陥があるかもしれませんが、それはそれとして受け入れます。基本的に私がこのように感じるのは\n私がこのように感じるのは、子供の頃のことが原因です。\n\n私の母は...",
  "data/reddit-changemyview/r/changemyview/comments/ofd9ip/cmv_men_should_not_be_expected_to_pay_on_the.json": "今は2021年ですが、女性の権利と平等を固く信じている私としては\n男性は最初のデートでお金を払うべきではないと思います。\n\nなぜなら、このような伝統は古くて性差別的であり、女性が働けず誰かに依存していた時代にまでさかのぼるからです。\n女性が働けず、夫に依存していた時代に遡るものですが、今日では女性は強くなりました。\n強くなっています。",
  "data/reddit-changemyview/r/changemyview/comments/of3ttm/cmv_rachel_nichols_isnt_wrong_for_her_comments.json": "現在、レイチェル・ニコルズがNBAファイナルのクルーから外されたことが報道されています。\nNBAファイナルのクルーから外されました。何が起こっているのかわからない人のために説明すると、基本的には\nレイチェル・ニコルズが「自分のことを恥ずかしいと思っている」と言っているテープが出回っていました。\nNBAファイナルのレポーターとしての主役の座を奪われたと感じているという内容のテープが残っていましたが...",
  "data/reddit-changemyview/r/changemyview/comments/ofkrg1/cmv_your_experiences_with_men_andor_woman.json": "人々は自分のデートの経験を全体に関連付ける。\"すべての男は\n私が今まで付き合った男はみんなそうだった」とか「女の子はみんな頭がおかしい!\n俺が付き合った女はみんな狂っていた！」とか。(私が言いたいステレオタイプの例\nの例です。)\n\nこれは、あなたの男女の判断やあなた自身の...",
  "data/reddit-changemyview/r/changemyview/comments/ofmbql/cmv_there_should_be_no_politicians_that_are_in.json": "これはつまり、アメリカの平均死亡年齢が\n78～80歳だとすると、70歳以上の人は（丸い数字で言えば）誰もが\nつまり、アメリカの平均死亡年齢が78〜80歳だとしたら、70歳以上の人には、広い範囲の意思決定をさせてはいけないということです。\n\nこのことについては、多くの分裂的で政治的な考えを持つ人々が私に反対することは承知しています。\nこのことについては、多くの意見の相違があることは承知しています（特に、...",
  "data/reddit-changemyview/r/changemyview/comments/ofnuvz/cmv_debates_are_meaningless_without_fact_checking.json": "議論をしている人が統計や「事実」を引き合いに出しても、それを真実として受け入れる人がいるのは理解できません。\n\"事実」を真実として受け入れてしまうのは不思議です。大規模な討論会（特に選挙の討論会は非常に重要です）では\n大規模な討論会（特に選挙）では、参加者は事前に検証可能な事実を提出しなければならないと思います。\n大規模なディベート（特に選挙は重要なので）では、参加者は事前に検証可能な事実を提出しなければならないと思います（例えば、国内の失業率や...",
  "data/reddit-changemyview/r/changemyview/comments/ofoq2j/cmv_many_countries_are_becoming_more.json": "これは確かに議論のあるトピックですが、最初に免責事項として申し上げますと、私はリバタリアンではありません。\n私はリバタリアンではなく、個人的にはどちらかというと中道派です。\nまた、ロックダウンに反対しているわけでもありません。私はアメリカに住んでいません。\nアメリカにも住んでいませんし、二大政党にも所属していません...。",
  "data/reddit-changemyview/r/changemyview/comments/ofrp49/cmv_americans_are_insulated_to_outside_thoughts.json": "最初にお断りしておきますが、私はアメリカに行ったことがありませんし、アメリカ人との交流もありません。\nまた、アメリカ人との交流もありません。これは主に、アメリカのポップカルチャーの影響や世界のアメリカを経験してきたことからまとめたものです。\nこれは、アメリカのポップカルチャーの影響とアメリカのグローバルな政治を経験したことからまとめられたものです。\n\n\n\n私の考えでは、アメリカは国の大きさも人口も大きいですが...。",
  "data/reddit-changemyview/r/changemyview/comments/ofwbcr/cmv_pastors_should_not_be_allowed_to_hold.json": "牧師が政治家になることを認めることは、本質的に教会と国家の間の溝を埋めることになります。\n教会と国家は神聖なものであり、いかなる形でも結びつけてはいけません。\n牧師はもちろん、常に信仰に基づいた法律を求め、神の色に染まった眼鏡で物事を見て、一般的に教会と国家を結びつけたがるでしょう。\n神の色に染まった眼鏡で物事を見て、一般的には教会と国家を結びつけたがるでしょう...。",
  "data/reddit-changemyview/r/changemyview/comments/ofr2n0/cmv_racism_is_not_just_about_minorities_meaning.json": "人種差別の定義が「人種を理由にした差別」であることに同意できるならば\n人種による差別」という定義に同意するならば、なぜ人種差別は、「マイノリティ」とみなされる集団に対するものでなければ\nなぜ人種差別が叫ばれるのかというと、「少数派」とされるグループ（国ごとの割合ではなく、世界的な割合を見ても意味がありません。\n国ごとではなく、世界全体の割合を見ても意味がありませんが...。",
  "data/reddit-changemyview/r/changemyview/comments/og7a61/cmv_on_disassociating_myself_from_politics.json": "私は非政治的です。私は自由主義的な考えも保守的な考えも持っています。\nしかし、この話題にはあまり興味がないので、声高には言わないことにしています。\n積極的には発言しません。また、私は非常に受動的な人間で、ほとんどのことに受動的であることが自分の利益になります。\n私は非常に受動的な人間であり、私の周りのほとんどのことに受動的であることが私の利益になります。",
  "data/reddit-changemyview/r/changemyview/comments/oga4kz/cmv_anyone_should_be_able_to_opt_outleave_a_home.json": "私は、HOAが存在する理由を理解していますし、HOAを好む人もいます。\n関係者全員が同じ考えを持っていて、物事がうまくいくのは（その人たちにとって）素晴らしいことです。\n\nしかし、刻々と変化するHOAの管理者のルールに縛られたくない人は、絶対に...。\nHOAの刻々と変わる管理者の刻々と変わるルールに縛られたくない人は、絶対に...",
  "data/reddit-changemyview/r/changemyview/comments/oga317/cmv_homeless_people_deserve_empathy_instead_of.json": "彼氏とのドライブ旅行で、食料を調達したところ、ホームレスが\nその地域では、ホームレスがかなり増えていました。私はサンドイッチが余っていたので\n歩道に座って荷物を持っていたホームレスの人に分けてあげようと思ったんです。\nバッグを持って歩道に座り、ドライブスルーを見ていた特定のホームレスに分け与えたかった。\n\n私は「Could I...」と言いました。",
  "data/reddit-changemyview/r/changemyview/comments/ogaj9j/cmv_donald_trump_did_more_harm_than_good_to_the.json": "トランプ大統領の任期中、共和党は下院と上院の両方で敗北し、彼は2度弾劾された。\nトランプ氏は2度弾劾され、再選に失敗し、ソーシャルメディアの利用を禁止されました。\nそれまでの共和党の大統領の中で、最も多くの人々に共和党への不信感を抱かせたと言っても過言ではありません。\n彼以前のどの共和党大統領よりも多くの人々にGOPへの不信感を抱かせました。どんな政治家や政治団体でも、このようなことがあるようです。",
  "data/reddit-changemyview/r/changemyview/comments/ogcea4/cmv_misgendering_someone_isnt_an_act_of_violence.json": "私はこのシナリオがよく使われるのを見てきましたが、人々がこのナンセンスな話を本当に信じているのか、私には理解できません。\n人々がこのような馬鹿げた話を信じることができるのか、私には理解できません。この記事の一番下にリンクを貼っておきます。\n私の記事の下にある記事をリンクして、私が何を言っているのかを簡単に説明します。\n基本的には、このブロガーが書いた記事によると、...",
  "data/reddit-changemyview/r/changemyview/comments/ogd3tj/cmv_reddit_bots_that_reply_to_comments.json": "redditのボット活動が急増していることに気づきました。\nこのようなアカウントが毎日毎日、コメントを投稿することができるというのは、とても素晴らしいことだと思います。\nほとんどの場合、お互いにほぼ同じコメントをしています。\n\nスパムはすでにredditのTOSに反していますが、それこそが彼らの正体です。スパムです。\n\n幾つかの...",
  "data/reddit-changemyview/r/changemyview/comments/ogftzq/cmv_my_friends_death_in_afghanistan_was_in_vain.json": "私の幼なじみ（米海兵隊のスナイパー）は、アフガニスタンでの戦闘で戦死しました。\nアフガニスタンで 20年後、米軍はこの地域から撤退します。I\n戦争は完全に失敗し、彼の死は無駄だったと思っています。この考えは\n他の誰とも共有していません。私は、彼の死が...と信じたい。",
  "data/reddit-changemyview/r/changemyview/comments/ogkyj3/cmv_china_is_an_authoritarian_state_that_should.json": "タイトルが全てを物語っています。中国はその西部でイスラム教徒に対して積極的に大量虐殺を行っている。\n中国は国の西部で、イスラム教徒に対して積極的に虐殺を行っています。\nウイグル人」と呼ばれ、現代の強制収容所に入れられている...",
  "data/reddit-changemyview/r/changemyview/comments/ognwkq/cmv_protesting_on_the_highway_and_streets_is.json": "デモ参加者が道路に立って交通を妨害したために轢かれてしまったビデオを見たことがあります。\n轢かれてしまったデモ参加者の映像を見たことがあります。\n意図的であれ、偶然であれ、抗議者を追い越そうとし、誰かを轢いてしまったり、抗議者と一緒にいる人を轢いてしまったりしたからです。\nその過程で何人かの人をはねてしまったのです。\n\n確かにそれはありますが...",
  "data/reddit-changemyview/r/changemyview/comments/ogwixg/cmv_var_in_football_soccer_is_a_good_thing_and.json": "VARとは \"video assisted referee \"のことです。サッカーでは、試合中に\n\"審判がファウルかハンドボールかなどを判断するために、試合中に「ライブ」ビデオを再生することです。\nファウルやハンドボールなどの判定に役立てています。私は専門家ではありませんが\n専門家ではありませんが、このシステムがどのように利用されているかについては、...",
  "data/reddit-changemyview/r/changemyview/comments/ogk3ua/cmv_the_misuse_of_the_word_objectively_has_become.json": "タイトルにもあるように、ほとんどの場合、景色を見ることができます。ここ数年、Redditやその他のソーシャルメディアでは\nここ数年、Redditや他のソーシャルメディアでは、何かを「客観的に面白い」と表現したり\n客観的に見て面白い」と表現したり、「最低賃金の引き上げは低所得者にとって客観的に悪い」などと発言したりする人が\n最低賃金の引き上げは、低所得者にとって客観的に悪いことだ」というような発言をする人がいます。その...",
  "data/reddit-changemyview/r/changemyview/comments/oh1j13/cmv_the_statecountycity_should_be_on_the_hook_for.json": "このタイトルは私の考えに近いものですが、私の頭の中にある刑事司法改革のアイデアの一部です。\n私の頭の中にある刑事司法改革のアイデアの一部ですが、簡潔にするために\n簡潔にするために、今はこの2つに絞られています。\n\n全体的な目標は、金持ちのアメリカ人と普通のアメリカ人の扱いを標準化することです。\nその...",
  "data/reddit-changemyview/r/changemyview/comments/ogxq4o/cmv_the_clock_should_stop_in_football_soccer_when.json": "私は時々サッカーを見るのですが、どうしても理解できなかったことがあります。\nサッカーを見ていてわからなかったのは、プレーが終わっても時計を止めないこと。現在、彼らはデッドタイムをアディショナルタイムという形で\nアディショナルタイムという形で時計に戻していますが、これにはいくつかの問題があります。\nこれについては\n\n正しい時間が加算されないのです。何度か...",
  "data/reddit-changemyview/r/changemyview/comments/oh8zsn/cmv_the_age_of_18_is_treated_so_weirdly.json": "17/19と16/18の関係が適切かどうかを推測している投稿を目にします。\n17/19と16/18の交際が適切かどうか、若い人たちが手玉に取られていないかどうかを推測する書き込みや\n18歳と25歳以上の関係を擁護する書き込みも見られます。\n個人的な生活の中で好きなことをする権利があるはずだからです。何かが...",
  "data/reddit-changemyview/r/changemyview/comments/ohh4ps/cmv_being_able_to_freeze_time_is_the_best.json": "時間を止めることができるというのは、最高のスーパーパワーだと確信しています。\nこの力があれば、私のすべての夢（善と悪の両方）を叶えることができます。\n\nここで重要なのは、超能力が生活の中でどのように役立つかということを話しているということです。\n普通」の生活をしているときにどのように役立つかを話しているということです。つまり、私は自分の人生の一部になろうとはしていないということです。",
  "data/reddit-changemyview/r/changemyview/comments/ohgj5x/cmv_i_think_that_streaming_services_that_add.json": "私はこれまでにたくさんの「黒い声」を見てきました。私はアメリカ空軍にいたので、モーガン\nフリーマンは私にとって遠い \"兄弟 \"のようなもので、彼を見るのが好きでした（好きでない人はいないでしょう）。\nはないでしょう）。) ブレイドでは決してたじろぎませんでした。ウィル・スミスは、私が子供の頃に初めて聴くことを許されたラッパーでした。\n尊敬していますし、今でも尊敬しています。",
  "data/reddit-changemyview/r/changemyview/comments/ohelox/cmv_no_matter_how_heinous_someones_crime_they.json": "私の考えでは、裁判制度は100％の事実に基づいて（理論的に完璧に作動するとしても）有罪にはならないので、これを望むべきだと思います。\n裁判所は100％の事実に基づいて有罪判決を下すことはありません（たとえ理論的に完璧に運用されていても）。それは単に\n12人の人間が（裁判の場で）満場一致で「合理的な疑いを越えて有罪である」と判断した場合に有罪となるのです。\n合理的な疑いを超えて有罪であると、12人の人々が（裁判の場で）満場一致で決めたことに基づいて有罪にするのです。\n\nすべての有罪判決で...",
  "data/reddit-changemyview/r/changemyview/comments/ohsuxl/cmv_human_sexuality_is_binary_by_design_with_the.json": "皆さん、こんにちは。生化学者です。\n\nタイトルの引用は、人間の生物学的な性についての私の見解を表しています。\n人間は二元的な種であるということです。クラインフェルター/ターナーのような状態が存在することは、他の性別の存在を示唆するものではありません。\nのような状態が存在するということは、他の性の存在を示唆するものではなく、それらは単に二元系の遺伝的\n二元的なシステムの遺伝的バリエーションに過ぎないのです。\n\nその考えは...",
  "data/reddit-changemyview/r/changemyview/comments/ohr7hl/cmv_most_of_the_deaths_of_military_members_in.json": "私はこのことについてよく考えていて、これを聞くのは非常に失礼だし、人を動揺させるものですが\nしかし、これを話すことは重要だと思います。このことについて語らないことは\nこのことを話さないことは、将来の戦争の犠牲者にとって、話すことで得られる害よりも大きいと思います。\nと思います。このような状況では、元に戻すことはできません。",
  "data/reddit-changemyview/r/changemyview/comments/oi0zp0/cmv_by_filling_balloons_with_helium_you_are.json": "ヘリウムは非常に限られた資源で、現在の使用量では25～30年でなくなると予想されています。\n現在の使用量では25～30年でなくなると予想されています。現在は、MRI装置の冷却材として、また\nまた、世界中の対テロリスト部隊で原爆やダーティーボムを検出する放射線検出器としても使用されています。\n原爆やダーティーボムを検出するための放射線検出器として使用されています。ヘリウムは、核融合によってのみ生成されます...",
  "data/reddit-changemyview/r/changemyview/comments/oi6bzg/cmv_obtaining_a_college_degree_today_is_an.json": "私は22歳の大学生で、学費を稼ぐためにレストランでフルタイムで働いています。\n教育を受けています。大学教育は、かつては投資であり、リターンを得ることができました。\n仕事やキャリアという形で返ってくるものでした。私は、民間企業のキャリアのための資格は\n大幅に変化していると思います。\n\n今朝、あるツイートを読みました...。",
  "data/reddit-changemyview/r/changemyview/comments/oi6rjn/cmv_the_british_royal_family_is_silly_and_not.json": "英国人への警告です。\n\nここでの明らかなポイントは、君主制の考え方は時代遅れであるということです。だけでなく\n後継者は民主的なコンセンサスではなく血縁によって選ばれるだけでなく、英国の国民は\n英国の人々は、一族のライフスタイルに資金を提供しても、特に見返りはありません。\n統治が...",
  "data/reddit-changemyview/r/changemyview/comments/ohuush/cmv_if_someone_gets_repeatedly_arrested_for.json": "刑務所を出たり入ったりしている重罪犯のニュースを、数え切れないほど目にします。\n数え切れないほどの回数です。しかし、彼らは何度も何度も釈放され続け\n致命的な犯罪を犯すことになるのです。もし誰かが間違いを犯しても\n懲りずに社会に出てきたとしても...。",
  "data/reddit-changemyview/r/changemyview/comments/ohxrtj/cmv_prisoners_and_parolees_should_retain_their.json": "重大な犯罪を犯した人が選挙権を失うのは当然のことのように思えました。\n重大な犯罪を犯した人が選挙権を失うのは当然のことのように思えましたが、私の頭の中では、重罪犯はゲームのルールを破ったと考えていました。\n重罪犯は民主主義というゲームのルールを破ったのだから、プレイすることは許されないと考えていたのです。\n昨日、テキサス州の仮釈放者のケースについて読んでいると......。",
  "data/reddit-changemyview/r/changemyview/comments/oior64/cmv_for_environmental_reasons_it_should_be.json": "衣服の生産は、資源を消費し、汚染を引き起こします。だからこそ\n環境保護のために私たちができることのひとつは、新しい服を買うのを減らし、今ある服をより長く使うことです。\n既存の服をより長く使うことです。これが環境フットプリントの何割を占めるかという議論には興味がありません。\nこれが環境フットプリントの何分の1を占めるかを議論することには興味がありません。この...",
  "data/reddit-changemyview/r/changemyview/comments/oimpya/cmv_men_who_reject_fatherhood_from_the_onset_of.json": "女性が子供の責任から逃れることができるなら（中絶を非難しているわけではありません。\n中絶を非難しているわけではありません）、同じ機会が男性にも与えられるべきだと思います。\n男性が保護具の有無に関わらず、セックスをしようと決めた時に選ぶことができるというのは不公平だし、正直言ってあまり意味のないことだと思います。\n避妊の有無に関わらず、男がセックスをするタイミングを選べるというのは不公平だし、正直、あまり意味のないことだと思います。",
  "data/reddit-changemyview/r/changemyview/comments/oirgug/cmv_millennials_are_more_techliterate_than_zoomers.json": "私は、すべての世代が前の世代よりも技術的な知識を持っているという考えを信じていません。\n特に、ズームインする人たちを「デジタルネイティブ」と称賛するのはどうかと思います。実際のところ、私は\nミレニアル世代は、この基準ではズームイン世代を大きく上回っています。確かに、私たちは\n確かに、TikTokやその他の最近の流行は使わないかもしれませんが、私たちは膨大な量の...",
  "data/reddit-changemyview/r/changemyview/comments/oiud13/cmv_men_should_not_automatically_be_shamed_for.json": "男性が女性に暴力を振るわれている映像をよく目にします。\n男性が反撃しようとすると、誹謗中傷され、時には逮捕されることもあります。傍観者の中には\n傍観者の中には、女性は何も悪くなく、男性はただ可哀想な無実の女性を叩いているだけだと思い込んでいる人もいます。\n傍観者の中には、女性は何も悪くなく、男性は罪のないかわいそうな女の子を殴っているだけだと思い込んでしまう人もいます。\n\n女性を守るために男性を非難することは...",
  "data/reddit-changemyview/r/changemyview/comments/oiy4fc/cmv_socialism_and_capitalism_have_ceased_to_be.json": "最近では、「社会主義」と「資本主義」という言葉は、強烈な偏見に満ちており\n社会主義」と「資本主義」という言葉は非常に偏ったものであり、政策においても大きな意見の対立を引き起こしています。このような電光石火のような言葉は\n賛成でも反対でも、何にでもラベルを貼るようになっています。\n賛成でも反対でも、それだけで議論が決まるかのようにレッテルを貼る。\n\nこのようにして...",
  "data/reddit-changemyview/r/changemyview/comments/oj5p2h/cmv_calling_white_people_colonizers_and_terms_of.json": "私の見解を変えるか、文脈や視点を得るための手助けをしてください。\n理解するのに苦労していますが、実際に重要な声に耳を傾けたいと思っています。\n実際に重要な声に耳を傾けたいと思っています。私は他の環境で学ぼうとしましたが、これはデリケートな問題です。\n私は他の環境で学ぼうとしましたが、これはデリケートな問題であり、多くの場合、感情が...",
  "data/reddit-changemyview/r/changemyview/comments/oj5h8c/cmv_sex_work_should_be_treated_the_same_way_other.json": "セックス・ワークは、常に何らかの形で社会に存在しています。それが何であれ\n売春、支配、風俗、さらには演技など。ですから、私は\n現代では、他の仕事と同じように評価されるべきだと思います。\n他の仕事と同じように扱われるべきだと思います。\n\nもしあなたがセックスワークに反対するのであれば、それはあなたのイメージがそうであるからかもしれません。",
  "data/reddit-changemyview/r/changemyview/comments/ojg36d/cmv_if_you_rape_and_murder_two_15_year_old_girls.json": "1980年に2人の女子高生をレイプして殺害したコリン・ピッチフォークの公開を控えていることにちなんで\n1980年代に2人の女子高生をレイプして殺害した\n\nhttps://news.sky.com/story/colin-pitchfork-man-raped-and-murdered-two-schoolgirls-to-be-released-after-government-loses-challenge-12354840\n\nこの人は絶対に釈放してはいけない、どんなに...",
  "data/reddit-changemyview/r/changemyview/comments/ojnu9v/cmv_the_term_karen_is_used_way_too_much_to.json": "ハーメオット\n\n私はそれを得る。最初のカレンが髪を切って出てきてからというもの\n些細なことですぐに店長と話したいと言ってきた。\n働いている人たちを酷使しながら、とんでもなく些細なことですぐに店長と話したいと言ってきたときから、私たちは皆、この行動を警戒してきました。\nこのような行動には誰もが注意を払ってきました。\n\nしかし、今、私が見ているのは...。",
  "data/reddit-changemyview/r/changemyview/comments/ojj4sk/cmv_just_because_someone_gets_in_a_fight_with_a.json": "否定できない事実であるかのように、私の周りの人たちは皆、自分の考えを変えて欲しいと思っています。\n否定できない事実であるかのように振る舞っているからです。\n\n最近のビデオを見ていると、カレン族などがマイノリティと喧嘩をして\nビデオがウェブにアップロードされ、その人は嘲笑され、仕事を失ったりします。\n仕事を失ったりしています。",
  "data/reddit-changemyview/r/changemyview/comments/ojwfsu/cmv_categorizing_twitter_posts_on_reddit_by_the.json": "Redditに肌の色を表すカテゴリーがあると誰かのためになるという正当な理由を教えてください。\n肌の色でRedditにカテゴリーを設けることが誰かのためになる正当な理由を教えてください。もし私たちが人種差別や分離を克服しようとしているのであれば\nここでそれを奨励するのはやめるべきだと思います。\n\nもし、Twitterのリポスト専用のサブサイトを持つつもりなら、どうして\nFunnyTwitter,...",
  "data/reddit-changemyview/r/changemyview/comments/ojs045/cmv_knowledge_is_the_best_superpower.json": "先週から、最高の超能力について多くの議論が交わされています。\nこの問題について私の意見を述べたいと思います。いつでも知りたいことを知ることができるのは\n知りたいことをいつでも知ることができる能力は、最高の超能力です。実用的な観点から\n実用的な観点からは、新しい言語を学んだり、より良いサービスを得る方法を学んだりすることができます。",
  "data/reddit-changemyview/r/changemyview/comments/ok4y49/cmv_the_us_media_frequently_uses_propaganda_to.json": "権力者たちは、自分たちのコミュニティを改善することに焦点を当てた、統一された中低階級の人々の能力を恐れています。\n自分たちのコミュニティをより良くすることに焦点を当てた中低階級の人々がどのような能力を発揮するか、権力者たちは恐れています。彼らはコミュニティを破壊します。\n根本的に違うものだと信じ込ませて、コミュニティを分断します。\nアイデンティティ・ポリティクスでお互いを憎む理由があると信じさせることで、コミュニティを分断します。",
  "data/reddit-changemyview/r/changemyview/comments/ok5e8o/cmv_casting_historically_inaccurate_races_in.json": "誤解しないでいただきたいのですが、私は表現力を強く信じています。歴史的に不利な立場に置かれている人や\n歴史的に不利益を被ってきた人々や迫害されてきた人々が、ポップカルチャーの中で自分たちの姿を見ることができるのは、大きな違いだと思います。\n歴史的に不利益を被ってきた人々や迫害されてきた人々が、ポップカルチャーの中で自分たちの姿を見ることは大きな違いを生むと信じています。また、それが社会全体に与える影響も知っています。\n私は葛藤しています。多くの有色人種の俳優たちが...",
  "data/reddit-changemyview/r/changemyview/comments/ok8v1b/cmv_there_arent_as_many_programming_jobs_as.json": "どこの国でも、プログラミングは最高の職業選択であり、良い仕事をしたいならコードを学ぶだけで良いと言われています。\nコードを学べばいいと言われています。\nしかし、すべての人に十分な仕事があるわけではありません。私は、プログラミングの仕事の数が\nプログラミングの仕事が増えていることは認識していますが、どれだけの人が...",
  "data/reddit-changemyview/r/changemyview/comments/okfl56/cmv_the_insurrectionist_lady_deserved_to_get_shot.json": "いわゆる「法執行機関支持派」の人たちが、国会議事堂に不法侵入して物色し、暴力的に阻止しようとすることを見過ごせないのはおかしいと思います。\n国会議事堂に不法侵入して物色し、暴力的に証明書の発行を止めようとしていることがわからないのは不思議です。\n次期大統領の認証を阻止しようとすることが、重大な結果につながることではないということに\n悲惨な結果になるべきではないのです。これらの同じ人々は、泥棒が...",
  "data/reddit-changemyview/r/changemyview/comments/okg183/cmv_casual_sex_is_like_using_someone_elses_body.json": "真のつながりがなく、感情もなく、緊張感もなく、求愛もなく、すぐにセックスに突入すると\nすぐにセックスに突入してしまうと、多くの場合、何も感じません。\n\n機械的な肉体的快感だけ。おそらく、初めての場合は気まずい思いをするでしょう。\n終わった後の空しさもあるかもしれません。しかし、全体的に見ると、睡眠の経験は...",
  "data/reddit-changemyview/r/changemyview/comments/oklapn/cmv_influencers_should_not_be_expected_to_speak.json": "私の勘違いかもしれませんが、これは本当に腹立たしいことです。\n\nソーシャルメディアで新しい社会問題が話題になると、ほとんどのインフルエンサーのコメントは\nインフルエンサーのコメント欄には、その話題を積極的に取り上げるようにとの声が殺到します。\nしています。インフルエンサーがその問題についての認識を広めることを選択するのは素晴らしいことですが\nそれは素晴らしいことですが...。",
  "data/reddit-changemyview/r/changemyview/comments/okq3dx/cmv_fur_is_no_morally_different_than_leather.json": "編集部：議論の現実的な目的のために、私は、肉の代わりに植物由来のものを利用できない人や\n肉の代わりに植物性のものを食べられない人や、毛皮の代わりに服を着られない人のような\n毛皮の代わりになる衣服を手に入れることができない人などの特定のケースは取り上げていません。私が言っているのは、ほとんどの\n都市部の資源のある人々のことです。\n\nモラルという点では、私は...",
  "data/reddit-changemyview/r/changemyview/comments/okrat2/cmv_if_worker_coopts_are_really_that_much_better.json": "本当にシンプルです。資本主義国家において、労働者の協同組合を禁じるものは何もありません。\n禁じるものはありません。もしあなたと他の労働者たちが、自分たちの工場を建てて\n自分の工場を建てて、一緒に所有したいと思ったら たとえ100人いたとしても。そうすることは自由です。\nそうするのは自由です。それどころか、所有者としての権利は守られる。",
  "data/reddit-changemyview/r/changemyview/comments/oksx5h/cmv_police_officers_should_not_be_considered_a.json": "最近では、ユタ州の女性がプロポリスを踏んでヘイトクライムで起訴されました。\n\"Back the Blue \"の看板を踏んだとして、ヘイトクライムに問われました。警察官は連邦政府の保護対象ではないことは承知しています。\nるクラス（人種、肌の色、宗教や信条、性別、年齢など）ではありません。\n州法、特にSB103「VICTIM TARGETING PENALTY」を参照します。",
  "data/reddit-changemyview/r/changemyview/comments/oktc0i/cmv_the_royal_family_has_used_meghan_markle_as_a.json": "アンドリュー王子とエプスタインとの関わりは完全に見過ごされているようです。\nスキャンダルが発覚して以来、彼がどのように保護されてきたのか、誰もが忘れています。\nその一方で、メディアはハリーとメーガンをミンチにしています。この二人が一緒にいるのは\n本当に偶然の一致なのでしょうか？\n\nわかった、多分メーガンは...",
  "data/reddit-changemyview/r/changemyview/comments/ol5qm4/cmv_our_lives_are_entirely_luck_and_the.json": "自分のことは誰にも選べません。私たちは親を選ぶことはできません。\n親も、どこで生まれたかも、どれだけお金を持って育ったかも選べない。自分の脳や体を選ぶことはできません。\n脳も体も、遺伝的特徴も選べない。逆境にあっても努力して達成しようとする意欲があれば\n逆境にあっても努力して成果を上げる意欲があれば、その意欲も...",
  "data/reddit-changemyview/r/changemyview/comments/oky8o0/cmv_political_affiliation_should_not_be_treated.json": "最近、人種や性別のように「政治的所属を保護された階級にすべきだ」という意見をよく目にします。\n人種や性別のように保護されるべきだ」という意見や、「政治的所属で人を判断するのは不公平だ」という意見を\nという意見をよく目にします。私がこの問題で一番気になるのは\n政治的所属は、何の変哲もない、しばしば...とは全く比較にならない。",
  "data/reddit-changemyview/r/changemyview/comments/ol8d56/cmv_political_correctness_is_just_self_righteous.json": "PCは、自己愛の強い人たちが、自分のことを良くするために\n人よりも優れた正義の味方のように振る舞うことで、自分自身をより良く感じるための手段です。私の理解では\n人種差別やホモフォビアの中傷など、故意に誰かを怒らせようとすることは\n誰かを怒らせようとすることは許されることではありませんが、他の...",
  "data/reddit-changemyview/r/changemyview/comments/olb0tk/cmv_women_only_clubs_are_discriminatory.json": "私はここで少し言葉を失っています。公立中学校には「テクノロジー・クラブ」があります。\nクラブ」があり、息子はそれに参加したいと言ってきました。彼は超興奮していました。\n\nしかし、どうやら彼はチラシを読み間違えたようで、それは女子だけのものだそうです。私がそのチラシを読んだとき\n私はチラシを読んだときに、おそらく参加できないだろうと言いました。\n\n明らかに彼はとてもがっかりしていて...。",
  "data/reddit-changemyview/r/changemyview/comments/ol91wo/cmv_i_dont_care_you_have_kids_in_the_workplace.json": "私は30代半ばで、大企業のセールスマネージャーをしています。ちなみに、私の会社は素晴らしく\n私の会社は素晴らしく、これまで何の問題もありませんでした。\nしかし、私は自分のキャリアの中で、あまり語られることのないアンバランスさを経験し、観察してきました。\nしかし、私はキャリアの中で、ほとんど語られることのない不均衡を経験し、観察してきました。",
  "data/reddit-changemyview/r/changemyview/comments/ol67fz/cmv_cultural_appropriation_is_not_a_real_thing.json": "私は専攻を変える前に社会学を1年間勉強しました（私には向いていませんでした）。\n先生の一人が熱心に教えてくれたアイデアの一つが、「覇権と文化的収用」でした。\nヘゲモニーと文化的適正化」でした。\n\n辞めてから考えたのですが、文化的流用というのは、少なくとも矛盾していますよね。\n矛盾している...",
  "data/reddit-changemyview/r/changemyview/comments/olexr1/cmv_sizing_for_womens_clothing_should_be_based_on.json": "Tシャツやスウェットなどのカジュアルウェアは、メンズ／レディース／ユニセックスで\nTシャツやスウェットなどは、一般的にメンズ/レディース/ユニセックスでS、Mなどのサイズが販売されており、フィット感はあまり重要ではありません。\nフィット感はそれほど重要ではありません。しかし、パンツやドレス、フォーマルウェアなど、より正確なフィット感が求められるものには\nより正確なフィット感が必要な場合、男性用の服は...",
  "data/reddit-changemyview/r/changemyview/comments/oli0eu/cmv_there_should_be_much_stronger_regulation_of.json": "まず第一に、なぜ現代では広告主がこれほどまでに効率的になったと考えられるのかを論じたいと思います。\n現代では 第二に、なぜ広告主を強く規制すべきだと考えるのかを論じたい。\n規制すべきであると考える理由を述べたい。\n\n現実には、現在のテクノロジー環境では、お金がものを言い、それが声高に語られています。\n声が大きい。声が大きいというだけでなく、...",
  "data/reddit-changemyview/r/changemyview/comments/ol7chi/cmv_minimum_word_requirements_are_unhelpful.json": "このシナリオでは、学校やある種の職場で見られるような\n学校や職場などで、一定の長さ以上でないと、作文などが\n学校や職場で、一定の長さ以上でないと不合格になってしまうような状況を指します。その長さは、次のような単位で表されることがあります。\nページ数（A4のX面、Yフォント、Zサイズ）、またはワード数で表されることがあります。そこに...",
  "data/reddit-changemyview/r/changemyview/comments/olrc34/cmv_when_typing_a_penis_emote_it_is_better_to_use.json": "だから、皆さんもどこかでこんな風にペニスのエモートを打ったことがあるのではないでしょうか。8=====D.\n見た目は問題ないですよね？私は違います。私はこのように入力する方がずっと好きです。6=====D、そして\nなぜこの場合、6＞8なのか、それを裏付ける実質的な証拠があります。\n\nその理由は\n\n 1. 1.エモートのボールのような8は、文字通りの...",
  "data/reddit-changemyview/r/changemyview/comments/om0fk5/cmv_democracy_in_its_current_format_does_not.json": "選挙が4年ごとに行われることを考えると、政党は勝利を得るために、長期的には不利になるかもしれない短期的な改善を行う動機付けになります。\n票を獲得し、政権を維持するために、長期的には不利益になるかもしれない短期的な改善を行うことになります。\n票を獲得し、政権を維持するために、長期的には不利益になるかもしれない短期的な改善を行うことになります。これに加えて、長期的な利益は、次の政権与党が吸収してしまうようです。\n政権を取った次の政党がその手柄を横取りしてしまうのです。(trump...",
  "data/reddit-changemyview/r/changemyview/comments/om5fya/cmv_all_advertising_should_be_disclaimed_as_such.json": "英国ではすでに実施されていると思いますが、あらゆる種類の広告には\n広告であることを明白に示す大きな表示が必要です。映画にプロダクトプレイスメントがある場合は\n映画の中にプロダクトプレイスメントがあれば免責事項、Redditにマーケティングのために作られたミームやポストがあれば\nマーケティングのために作られたミームやRedditへの投稿があれば、（はい、私は特に...。",
  "data/reddit-changemyview/r/changemyview/comments/om64fd/cmv_religiousbased_prohibitiondiscouragement_of.json": "低所得者層の多い地域で高校教師をしていると、宗教の主流がローマ・カトリック（その他のカ\n普及している宗教はローマ・カトリック（およびその他のカトリックのスピンオフ）です。\n\nまた、私の生徒の多くは大学に行かず、大家族の出身であることも気になりました。\nまた、私の生徒の多くは大学に行かず、大家族で、若くして子供を産み始める人が多いことにも気づきました。大学...",
  "data/reddit-changemyview/r/changemyview/comments/om5l3l/cmv_if_the_purge_was_real_the_population_of_the.json": "パージの1作目を見ましたが...大嫌いでした。ひどい映画で、登場人物は腹が立つほど愚かで\n登場人物は腹立たしいほど愚かで、アイデア全体がかなりバカげていたと思います。\n\nもしパージが実際に行われるとしたら、かなりの数（つまり数百万人）のアメリカ人がパージのために国を離れると思います。\n数百万人）のアメリカ人がパージのために国を離れ、それを待つことになると思います。",
  "data/reddit-changemyview/r/changemyview/comments/om6geq/cmv_posts_from_people_under_the_age_of_18_should.json": "私の主な理由は、この種のサブウーファーに関するアドバイスは、せいぜい大げさで、人生を台無しにするようなものばかりだからです。\nよく言えば大げさ、悪く言えば人生を台無しにしてしまうようなアドバイスが多いからです。ユーザーは以下のようなアドバイスをする傾向があります。\n復讐の妄想、言葉による殺人の妄想を実現するためのアドバイスをする傾向がありますが、それは投稿者のためになるアドバイスではありません。\n投稿者の利益を一番に考えたアドバイスではなく\n\nまた、...",
  "data/reddit-changemyview/r/changemyview/comments/omfp29/cmv_i_think_the_government_should_introduce.json": "グレン・グリーンウォルドは、ナンシー・ペロシとポール・ペロシの株式ポートフォリオの詳細を記事にした。\nポートフォリオを紹介しています。過去2年間の彼らの株式取引の75％は シリコンバレーの大手ハイテク企業でした\nシリコンバレーの大手ハイテク企業です。これは、主要な法案が下院で審議されているときに起こったことです。\n下院では、ナンシーが監督する委員会が管理しています。",
  "data/reddit-changemyview/r/changemyview/comments/omgs2e/cmv_euthanasia_should_be_widely_legalized_for_all.json": "他人に危害を加えたり、自殺者の家族に迷惑をかけたりするような大げさな自殺方法よりも、はるかに優れた選択肢だと思います。\n他人を傷つけたり、自殺者の家族が脚光を浴びたりするような大げさな自殺方法よりも、はるかに良い選択肢です。\n自殺者の家族が脚光を浴びることにもなりかねません。人は生まれてくることを選べないのだから、生まれてこないことを選ぶことがタブーであるとは思えません。\n生きることをやめることを選択することがタブーであるとは思えません。そして、私...",
  "data/reddit-changemyview/r/changemyview/comments/omh7j0/cmv_if_you_are_opposed_to_mask_mandates_but_not.json": "顔を覆うようなマスクをするのは好きではありません。人との会話が難しくなるし\nくしゃみをすると、マスクを取り替えるまで不快な思いをします。好きになれないのも無理はありません。\n好きになれないのも理解できます。私はシートベルトをするのが好きではありません。していないのと同じくらい\nシートベルトをしないのと同じくらい快適ではありません。しかし、法律では...",
  "data/reddit-changemyview/r/changemyview/comments/omn37w/cmv_racism_can_never_be_fully_eradicated_it_can.json": "人種差別は、人類の歴史の中でずっと存在してきました。人類の歴史の中で、一人の人間が\n100％人種差別をしない人間は存在しませんでした。一度もです。これを読んでいるあなたも\nこれを読んでいるあなたも 私たちは皆、生まれつき偏見を持っています。育てられ方や教えられ方によって、他の人よりも表立って差別的な人もいます。\n表立って差別的な態度をとる人もいますが、私たちは皆...",
  "data/reddit-changemyview/r/changemyview/comments/om9cfu/cmv_the_vast_majority_of_the_top_posts_on.json": "r/AmItheAsshole [https://www.reddit.com/r/AmItheAsshole/]には、本当に厳しい状況があります。\n自分が間違っているのかどうかわからないような、本当に厳しい状況があります。\nしかし、Hot and r/all [/r/all]に掲載されるようなものは、ほとんどが\nしかし、Hot and r/all [/r/all]に投稿されたもの、つまり、最も...",
  "data/reddit-changemyview/r/changemyview/comments/omrbmc/cmv_antihunting_is_peak_human_arrogance.json": "これは、無秩序な狩猟や、絶滅の危機に瀕した動物の密猟を意味しているのではありません。\n絶滅の危機に瀕した動物の密猟のことではありません。狩猟を嫌う人たちの多くは\n狩猟を嫌う人の多くは、肉食動物が他の動物を殺すことには問題がないにもかかわらず、動物を殺すことは残酷だと主張します。\n肉食動物が他の動物を殺しても問題ないのに、動物を殺すのは残酷だと主張します。",
  "data/reddit-changemyview/r/changemyview/comments/omqxgm/cmv_the_temporarily_embarrassed_millionaire.json": "ジョン・スタインベックは、「アメリカでは社会主義が根付かなかった。\n貧乏人は自分たちを搾取されるプロレタリアートではなく、一時的に困窮した大富豪と見なしているからだ。\n社会主義はアメリカに根付かなかった。最近、多くの人がこの議論を使っているのを目にします。\n(主にredditで) 誰かが大富豪や億万長者を擁護するときに、この議論を使う人をよく見かけます...",
  "data/reddit-changemyview/r/changemyview/comments/omveo8/cmv_every_fine_should_be_income_based_no.json": "誰かを経済的に罰するには、これが唯一の公平な方法ですが、そもそもそんなことをすべきかどうかは別の話です。\nそもそもそんなことをすべきかどうかは、別の日の話題にしましょう。\n\nお金持ちが、正義を求める警察官に対して、肩をすくめたり、比喩的に金袋を投げつけたりしないようにするには、お金持ちにお金を払わせるしかありません。\nお金持ちが、正義を求める警察官にお金を投げつけることがないようにするには、お金持ちが支払う金額の\n割合で...",
  "data/reddit-changemyview/r/changemyview/comments/omkg7z/cmv_there_is_nothing_wrong_with_swearing.json": "明らかな理由により、この投稿には汚い言葉が含まれます。\n\n編集：u/bluepillarmy [/u/bluepillarmy]さんは、私の悪口に対する大まかな考え方を見事に変えてくれました。\n親しくない人の前で悪口を言うのは失礼にあたるという形式的な問題であり、親しい人には\n親しくない人の周りで悪口を言うのは失礼だと考えられる形式的な問題であり、親しい友人は悪口を言わない傾向があるからです...。",
  "data/reddit-changemyview/r/changemyview/comments/omik3b/cmv_body_positivity_is_a_dangerous_mindset_to.json": "はっきり言って、ボディポジティブが悪いことだとは思いません。私は、ボディポジティブが悪いことだとは思いません。\n一般的ではない魅力的な体型が現代のメディアをリードしている世界では、素晴らしい考え方だと思います。\n現代のメディアを牽引しています。それがNetflixの番組であれ、電車の駅での香水の広告であれ\nそれがNetflixの番組であろうと、駅の香水の広告であろうと、自分のことを不当に責めてしまうのは簡単です。",
  "data/reddit-changemyview/r/changemyview/comments/omd54g/cmv_cruise_ships_are_the_most_obscene_way_for.json": "クルーズ船は、社会が考え出した最も卑猥な「バカンス」かもしれない。そもそも\nそもそも、カーニバル社やロイヤル・カリビアン社などの会社は、アメリカに本社を置いています。\nしかし、不条理な海事法のために、ほとんど、あるいは全く税金のかからない国の旗を掲げています。\nカーニバルはパナマ、ロイヤル・カリビアンは...）。",
  "data/reddit-changemyview/r/changemyview/comments/ond9ob/cmv_we_all_should_have_the_right_to_scrutinize.json": "私はクリスチャンの家庭で育ち、ヨーロッパのいくつかの国に住んだことがあります。\n様々なバックグラウンドを持つ人々と仕事をしてきました。自分はスピリチュアルだと思っています。\nしかし、組織された宗教には属していません。\n\n私は宗教は馬鹿にされるべきだと思っています。なぜなら、歴史的に見て、宗教団体は\n使ってきたからです。",
  "data/reddit-changemyview/r/changemyview/comments/onhpyz/cmv_parents_who_refuse_to_take_their_screaming.json": "他のサブサイトにも投稿したのですが、それは偏った視聴者だったかもしれません。\nCMVに投稿して、より多くの人に見てもらいたいと思います。\n\nこの親御さんは、他人への共感や一般的な礼儀を欠いているとしか思えません。\n礼儀がないように思えます。もし、あなたが彼らに何かを言ったり、見たりしたならば、私は賭けてもいいでしょう。\n何か言ったり、見たりしたら、きっと...。",
  "data/reddit-changemyview/r/changemyview/comments/on5k26/cmv_we_should_revert_back_to_taking_the_seen.json": "テクノロジーの発達により、私たちはお互いにつながりやすくなりました。\nそうでなければ連絡を取ることができなかった人々と再会することもできます。\nメッセージを読んだらすぐに返信しなければならないというプレッシャーは\nメッセージを読んだらすぐに返信しなければならないというプレッシャーは、良いことよりも悪いことの方が多いのです。\n\nこの機能があればあるほど...",
  "data/reddit-changemyview/r/changemyview/comments/onpyo3/cmv_neopronouns_is_just_attention_seeking_with.json": "私はhe/she/theyに問題はありません（theyでも複数形なのでちょっと微妙ですが\nしかし、それほど大きな問題ではありません）。) しかし、私は今、いわゆる「ネオ代名詞」と呼ばれるクレイジーな\nいわゆる「ネオ代名詞」の世界を学び始めました。もしあなたが知らないのであれば、これらはたくさんの\n自分には合わないと主張する人たちのために作られた言葉です。",
  "data/reddit-changemyview/r/changemyview/comments/onznld/cmv_life_is_going_to_get_progressively_worse_for.json": "さて、非常に基本的なことですが、避けられないのが気候変動です。凍えるような冬や\n凍てつく冬、記録的な夏の猛暑は悪化の一途をたどっており、私は\n私が生きている間に人類が解決策を見つけて（そしてそれをうまく実行して）くれるとは到底思えません。\n私が生きている間に解決策を見つけ、それを実行に移すことができるかどうか、人類に対する信頼はゼロです。\n\n次に、経済格差の拡大です。",
  "data/reddit-changemyview/r/changemyview/comments/onq03a/cmv_public_eating_areas_should_have_handwashing.json": "私はアメリカに住んでいますが、公共の施設では手洗い場しか用意されていないことにいつも不満を感じています。\nトイレの中にしか手洗い場がないことにいつも不満を感じています。これでは、食事の前などに定期的に手を洗うにはとても不便です。\nレストランで食事をする前など、定期的に手を洗うにはとても不便です。\n私が思い出すのは、トイレの中に洗面台があったレストランです。",
  "data/reddit-changemyview/r/changemyview/comments/oo4v9e/cmv_penalizing_an_athlete_for_their_naturalborn.json": "かなり大雑把なタイトルにしてしまいましたが、具体的には、ナミビアの選手が禁止されたケースを指しています。\nナミビアの選手が禁止されたケース\n[https://www.cnn.com/2021/07/06/us/black-women-athletes-treatment-olympics-spt/index.html]\nテストステロン値が高いことを理由に、ナミビアの選手が特定のレースへの出場を禁止されたケースを指しています。\n\n私はそれを熟考してきました...。",
  "data/reddit-changemyview/r/changemyview/comments/oo4lkf/cmv_requiring_vaccines_does_not_unduly_restrict.json": "すべての社会は、社会全体の利益のために、個人の自由を何らかの形で損なうような法律を制定しています。\nその社会の全体的な利益のために、個人の自由を何らかの形で弱める法律を制定します。\n\n車の運転速度を規制したり、同意年齢を定めたり、窃盗を罰したりする法律があるのはこのためです。\n窃盗を罰するなどの法律があるのはそのためです...。\n\n確かに、時速100キロ以上で走り回るのは楽しいですが、それは同時に危険な状態を作り出しています...",
  "data/reddit-changemyview/r/changemyview/comments/ooctq5/cmv_if_you_lock_90_of_your_games_content_behind_a.json": "これが私のゲーム業界に対する考え方です。私は自分の財布で投票します。私は、多くのゲームが\n多くのゲームがコンテンツの大部分をクソみたいな有料壁や無料プレイに閉じ込めているのが気に入らない。\n私はすべてのコンテンツを手に入れるために、ゲームのフルプライスを支払います。\nすべてのコンテンツを手に入れるためにフルプライスでゲームを購入します。もし私が全てのコンテンツをプレイする唯一の方法が...",
  "data/reddit-changemyview/r/changemyview/comments/oofhz0/cmv_while_we_should_love_disabled_people_for.json": "これは万人共通の真理かもしれませんが、実際に人と話したことはありません。\n人と話したことはありませんが、障がい者を祝福し、できるだけ多くの活動に参加させることは可能だと思います。\n祝福したり、できるだけ多くの活動に参加させたりすることは可能だと思います。\n健康であってほしいと願いながらも、障害者を祝福し、できるだけ多くの活動に参加させることは可能だと思います。私は、ダウンについて議論することは理解していますが...",
  "data/reddit-changemyview/r/changemyview/comments/oo6ysm/cmv_in_popular_destination_cities_airbnb_does_way.json": "墜落する場所を見つける方法として始まったウェブサイトが、地元の人にホストされて、より「a」を持つことは皮肉なことだと思います。\n墜落する場所を探したり、地元の人にホストしてもらったり、より「本物」の体験をする方法として始まったウェブサイトが\nそれが今では、「本物の体験」ができない理由になっているのは皮肉なことだと思います。\n\n最初に断っておきますが、私が初めてAirBnBを利用したのは...。",
  "data/reddit-changemyview/r/changemyview/comments/oolkmt/cmv_the_olympics_are_becoming_increasingly_less.json": "ソーシャルメディアでは、アスリートが24時間365日何をしているか、どのようにトレーニングしているかを見ることができます。\nトレーニングをしているのかを知ることができます。オリンピックで常に表彰台に上る選手がいる主な国は、比較的平和なので\n比較的平和な国なので、国内での競争はほとんどありません。このようなアスリートを\nソーシャルメディアやオリンピック以外の場でアスリートたちを見ると、まるで...",
  "data/reddit-changemyview/r/changemyview/comments/oocl49/cmv_if_voter_id_laws_are_racist_because.json": "ジョージア州の有権者ID法や、民主党員がテキサス州から逃げ出して阻止したような有権者ID法が人種差別的であるならば\n民主党員がテキサスから逃げ出して阻止したようなものが人種差別であるならば、なぜ私たちは、不利な立場にある人々がDMVや\n不利な立場にある人々が、DMVやIDを取得できる機関にアクセスできるようにすることに、なぜ私たちは注力しないのでしょうか？\n身分証明書を発行してくれる団体にアクセスできるようにすることに集中してはどうでしょう？人種差別の主張の唯一の根拠となっているのは、マイノリティの...",
  "data/reddit-changemyview/r/changemyview/comments/oorsmf/cmv_not_accepting_a_lot_of_asylum_seekers_doesnt.json": "背景 スウェーデン人として、この視点は主に過去から来ています。\n2015年の難民危機の際、スウェーデンはヨーロッパで2番目に移民数の多い国となりました。\nスウェーデンは一人当たりの新規亡命申請数がヨーロッパで2番目に多い国でした。スウェーデンは\nスウェーデンはこれらの人々の多くを社会に統合することに失敗し、その結果、...",
  "data/reddit-changemyview/r/changemyview/comments/ooshdt/cmv_people_will_get_covid_going_forward_its_part.json": "ワクチンを打てば大丈夫というデータが出ているのに、なぜ人々はCOVIDの画期的な症例を心配するのでしょうか？\nワクチンを打てば大丈夫というデータが出ているのに。私たちはCOVIDを100％予防しようとしているわけではありません。\nワクチンはCOVIDを100%予防するものではなく、COVIDに遭遇したときのために免疫システムの準備をしているだけです。\nワクチンはCOVIDに遭遇したときのために免疫システムを準備しているだけです。私の知っている人たちは皆、断固とした態度で...",
  "data/reddit-changemyview/r/changemyview/comments/oosv7r/cmv_minnesota_state_rep_john_thompson_should_be.json": "まず最初に、州議会議員が問責決議を受けるとはどういうことでしょうか？\n\n> 問責決議とは、グループの許容基準に反した行動をとった個人（多くの場合、グループのメンバー）を、グループが公式に、かつ公的に非難することです。\n> グループのメンバーであることが多いのですが、その個人の行動がグループの許容基準に反していると\n> 個人の行動を非難することです。米国では、政府の...",
  "data/reddit-changemyview/r/changemyview/comments/op20at/cmv_dislikes_or_equivalents_are_good_and_most.json": "最近、Twitterは「いいね！」をつけることを検討しています。I\nこれは良いアイデアだと思いますし、長い目で見れば、プラットフォーム上の有害性を\n軽減できると思います。\n\n最初は、嫌悪感やネガティブな評価の機能が毒性を悪化させるように見えるかもしれません。\n毒性を強めるように見えるかもしれませんが、私は...",
  "data/reddit-changemyview/r/changemyview/comments/op0gja/cmv_unless_you_are_a_white_supremacist_there_is.json": "白人は一枚岩ではなく、ヨーロッパからインドまで広がっています。そこには\n何百もの異なる文化があり、何百もの異なる伝統があります。\n\n現代の「白人」であるヨーロッパでさえ、何十もの異なるグループがあります。\n\nでは、白人の文化的アイデンティティとは何でしょうか？それは実際にはありません。そして、それは...",
  "data/reddit-changemyview/r/changemyview/comments/op6dll/cmv_being_attractive_is_one_of_the_most_important.json": "まず、身体的に魅力的であることは、モデルのような外見であることを意味しません。\nしかし、衛生面や服装、太っていないことなど、さまざまな面で自分自身を大切にしていることが、平均以下の人を魅力的にするのです。\n太っていないことなど、さまざまな面で自分を大切にすることで、平均以下の人でも魅力的な人に変えることができます。\n魅力的な人に変わります。誰も10点満点でなければならないとは言っていませんが...。",
  "data/reddit-changemyview/r/changemyview/comments/opdpey/cmv_people_shouldnt_lose_their_jobs_be_socially.json": "Edit : Hi all, こんなにたくさんの回答があるとは思っていませんでした。読んでみて\n読んで、それに応じた回答をしていきたいと思います。ありがとうございます。今のところ、素晴らしい議論ですね。\n\nよく「人は変わる」とか「誰にでもセカンドチャンスを与えるべきだ」とか言いますが\nしかし、私たちは、有名人や他の人たちの例を数え切れないほど見ています...",
  "data/reddit-changemyview/r/changemyview/comments/opdk5h/cmv_a_country_prioritizing_its_citizens_is_the.json": "昨日、私はある投稿をしました。\n[https://www.reddit.com/r/changemyview/comments/oorsmf/cmv_not_accepting_a_lot_of_asylum_seekers_doesnt/]\n道徳と難民についての投稿をしたところ、多くの議論がなされていましたが\n私は、現実世界の例を使って、理論的なことを議論しようとすると、そのようなことにはならないと思いました。\n理論的な...",
  "data/reddit-changemyview/r/changemyview/comments/op93rs/cmv_being_a_member_of_a_historically_oppressed.json": "これには賛否両論があるようです。私はこのことをtumblrに投稿したことを\n友人」が削除してほしいと言ってきました。その友人は後に私の加害者であることが判明しました。\n私の加害者でもありました。だから、私はある種の反対意見をあまり信用していません。I\n私がその意見を信じる理由はたくさんあります。\n\n私は...",
  "data/reddit-changemyview/r/changemyview/comments/opcyut/cmv_the_us_government_rather_than_us_billionaires.json": "いくつかの用語を定義し、議論を明確にする。\n\n\"アメリカの繁栄 \"とは、この場合、進歩を表すキャッチオールです。例えば、人々は\n働かずに済む、より良い医療を受けられる、インフレにならない、手頃な価格の住宅を手に入れたい、など。\n住宅などです。\n\n問題」とは、政府が繁栄を妨げていること、および/または...",
  "data/reddit-changemyview/r/changemyview/comments/opfg96/cmv_the_catholic_church_has_no_place_in_the.json": "確かに今のローマ法王はかっこいいですが、基本的には神にコンプレックスを持つ小児性愛者の集まりです。\n神のコンプレックスを持っています。私の考えでは、カトリック教会は基本的に何も良いことをしていません。\n十字軍を創設したこともあり、テロ組織としてはアルカイダよりも悪いと思います。\nテロ組織としてはアルカイダよりも悪い。私には理解できませんが...。",
  "data/reddit-changemyview/r/changemyview/comments/opiukt/cmv_the_best_way_to_stop_crime_is_not_to_have.json": "今、犯罪とそれを阻止する方法についての議論が行われています。あるグループは\n警察官の増員や厳罰化が必要だと熱弁しています。しかし、それでは犯罪を止めることはできません。\nなぜなら、ほとんどの犯罪の原因を解決することができないからです。\n\nほとんどの犯罪は、状況や必要性によって引き起こされます。確信を持って...",
  "data/reddit-changemyview/r/changemyview/comments/opnq5b/cmv_public_perception_of_american_law_enforcement.json": "これは、アメリカの警察に批判的で不信感を抱いている多くの人が共有している暗黙の感情だと思います。\nアメリカの警察に批判的で不信感を持っている人の多くが、このような思いを抱いているのではないでしょうか。\n\n警察官が4歳の子供を怒鳴りつけたり、カメラで老人を殴ったりしたニュースを聞くと、いつも最初は憤慨します。\n警察官が4歳の子供に叫んだり、カメラの前で老人を倒したりするニュースを聞くと、いつも最初は憤慨します。\n続いて、「彼は......」。",
  "data/reddit-changemyview/r/changemyview/comments/opvm54/cmv_folks_need_to_recognize_that_there_are_people.json": "それは、中絶に関する議論でも見られます。中絶賛成派の人たちは、中絶反対派の人たちが主張できる唯一の論点は、時代遅れの訴えだと言いたがります。\n賛成派の人たちは、賛成派の人たちが反論できるのは時代遅れの宗教への訴えだけだと言いたがります。\n宗教を支持していない人もいるのに、賛成派の人は、賛成派が反論できるのは時代遅れの宗教への訴えだと言いたがります。\n宗教を信じていない人もいるのに。賛成派の人たちは、中絶をしない人たちがいるのに、宗教に訴えるのは時代遅れだと言いたがります。",
  "data/reddit-changemyview/r/changemyview/comments/opvuwl/cmv_convenience_charges_and_other_surcharges_are.json": "コンビニエンス・チャージは、売上の約5％を占めるポイント・オブ・セールス・チャージです。\nコンビニエンス・チャージとは、売上の約5％を占める販売手数料のことです。\nをカバーするためのものです。レジ係としての私の経験では、POSでの取引の95％はカードです。\nカードです。それがどうして「非標準」なのでしょうか？\n\nデビット・クレジットの使用は非常に...",
  "data/reddit-changemyview/r/changemyview/comments/oq10bd/cmv_im_reluctant_to_get_an_electric_car_because.json": "ガソリンスタンドは危険な感じがするので、なるべく行かないようにしています。\n安全ではないからです。多くの男性はそれがどのようなものかわからないでしょうし、また、そのようなものを与えることもないでしょう。\n考えることもないでしょう。私は国中をドライブするのが好きなのですが、小柄な女性がドライブするのは\n小柄な女性が8万円台の車に乗っているのは賢明ではないと思います。",
  "data/reddit-changemyview/r/changemyview/comments/oq2lut/cmv_playing_video_games_as_a_single_hobby_without.json": "基本的には、年を重ねるごとに、ゲーム業界がいかに迷惑で不愉快な存在であるかがわかってきました。\nビデオゲームコミュニティがいかに迷惑で不愉快かということを実感しています。\n\nこれは全ての人に当てはまるわけではありませんが、過去10年間、様々な人と出会ってきたことで\nこの10年間、ゲーム業界で様々な人に会ってきましたが、大多数の人が不快で面白くない人です。\n面白くない人たちです。\n\n私は...",
  "data/reddit-changemyview/r/changemyview/comments/oqf90h/cmv_standing_up_to_wipe_is_far_superior_to.json": "私は男性なので、この経験が女性にとってどのように違うのかを語ることはできません。\n今回の投稿は、私の仲間である男性に向けたものです。\n\nウンコをした後に立ち上がると、お尻へのアクセスが非常に楽になります。さらに\nさらに、お尻に手を伸ばすために、自分のアソコに手を回す必要もありません。\n個人的には、私は...",
  "data/reddit-changemyview/r/changemyview/comments/oqpsf4/cmv_i_dont_think_a_distinction_should_be_made_if.json": "悲劇の報道を聞いていると、女性や子供が犠牲になったと聞くことがあります。\n犠牲者の中には女性や子供も含まれています。\n\n子供はともかく、女性が犠牲になったことは関係ないと思います。\n犠牲者がいたことは関係ないと思います。ましてや目立ってはいけないと思います。\n\n小説の中でも、もしかしたら...。",
  "data/reddit-changemyview/r/changemyview/comments/or09ur/cmv_prisoners_who_sexually_abuse_molesters_arent.json": "最初に断っておきますが、私は児童虐待者を支持しているわけではありませんし、擁護しているわけでもありません。\n擁護するものでもありません。小児性愛者や痴漢は、まったくもって嫌なものです。\n\n最近、自警団（たいていは20歳代の若者）が男に立ち向かって\n男たちに立ち向かい、小児性愛者と非難された人を即座に殴り倒しています。彼らは...",
  "data/reddit-changemyview/r/changemyview/comments/or04qn/cmv_the_answer_to_the_voter_id_debate_in_the_us.json": "編集：CMVの後半にUS citizenと書かれているはずですが、私はこのタイプミスに気付きませんでした。\nRedditではタイトルの編集ができないので、タイプミスを見つけられませんでした。\n\nこれにより、左派が抱えるアクセスや人種差別の問題が解消され、右派が望む安全性が確保されます。\n右派が望むセキュリティを与えることになります。\n\n誰もが自由にIDにアクセスできるようになれば、IDを必要とする...",
  "data/reddit-changemyview/r/changemyview/comments/or3loa/cmv_any_cop_thats_caught_planting_evidence_could.json": "EDIT: タイトルは \"could \"ではなく \"should \"にすべきです。\n\nかなりストレートでシンプルですね。国中のあらゆる法執行機関で働くことを連邦政府が禁止すべきです。\n国中のあらゆる法執行機関で働くことを連邦政府が禁止すべきです。\n私は彼らが刑務所に送られることを望んでいますが、それは別のCMVです。\n\nこの投稿はこれに触発されたものです...",
  "data/reddit-changemyview/r/changemyview/comments/oqy6s6/cmv_at_this_point_people_who_claim_that_black.json": "CMVコミュニティの皆さん、こんにちは。\n\n私のCMVはタイトルの通りです。私は、BLMをBlack Lives Matterだけの意味で捉えている人たちが、信じられません。\nBLMをBlack Lives Matterだけの意味で捉えている人たちが、悪意を持って議論しているか、あるいは\n悪意を持って主張しているのか、あるいは故意に無知なのか。私は、このように考える人は\n私は、このように考える人々は、信用を落とそうとしていると考えています...",
  "data/reddit-changemyview/r/changemyview/comments/or8mye/cmv_choosing_to_use_both_shethey_or_hethey.json": "歌手のハルジーは、最近、ある雑誌が彼女の代名詞を間違って使用した後、「意図的に彼女を軽視した」として、これ以上の報道はしないと宣言しました。\n雑誌が彼女の代名詞を誤って使用したことで、彼女を「意図的に軽視した」と宣言しました。この雑誌は\n雑誌は彼女の記事の表紙で、彼女がどちらでもよいとして「she/they」を使っていることを紹介しました。\nしかし、その後の記事では \"she \"しか使っていません。",
  "data/reddit-changemyview/r/changemyview/comments/oragxs/cmv_we_need_nuclear_or_fossil_fuel_power_plants.json": "こんにちは。\n\nこれは、私の考えを変えたり、最新の情報を得たりするためのものです。\n基本的に、これは再生可能エネルギーに対する最も古い議論です。私は考えました。\nこれは、エネルギー生成を変えるという意味では、深刻な問題だと思っています。\nしかし、世間ではあまり気にされていないようですね。",
  "data/reddit-changemyview/r/changemyview/comments/orj12f/cmv_conspiracy_theories_run_rampant_because_our.json": "政治の世界では、ほとんどの権力者が嘘をつき、真実を捻じ曲げることで知られています。\n私は歴史学者ではありませんが、何世代にもわたってそうであったようです。\n私たちは彼らが嘘をつくのを許し、好きな時に好きなことを信じています。\nよく知られた嘘つきを信じることは、陰謀論的なナンセンスを信じることよりも愚かです。",
  "data/reddit-changemyview/r/changemyview/comments/orj6za/cmv_a_lot_of_ruleslawspolicies_that_are_meant_to.json": "例えば、Redditのポリシーでは、1番目のルールとしてハラスメントやいじめを禁止しています。\nなどとなっています。このルールの規定は、実際にハラスメントに直面しているグループにのみ適用されるというものです。\n白人や男性ではなく、実際にハラスメントに直面しているグループにのみ適用されるという規定です（これは実際にredditの公式\nこれは実際にreddit管理者の公式なスタンスです）。)\n\nこのようなルールは、基本的には言わないのでしょうか...。",
  "data/reddit-changemyview/r/changemyview/comments/ork9l0/cmv_americans_are_the_most_heavily_propagandized.json": "まず、アメリカ人がバカだと言っているわけではありません。真面目な話です。\n\n私はたくさんの旅をして、いくつかの国（アメリカを含む）に住んだことがありますが、この考えはいつも戻ってきます。\n私は多くの国を旅し、いくつかの国（アメリカを含む）に住んだことがありますが、この考えはいつも戻ってきます。明らかに私には大きな選択バイアスがかかっています。\nこれは非常に変わりやすい見解です。\n\n中国は...",
  "data/reddit-changemyview/r/changemyview/comments/orlp6u/cmv_making_the_olympics_essentially_pay_per_view.json": "これはアメリカを中心とした話ですが、多くの国ではここよりも簡単にオリンピックを見ることができます。\n観ることができます。お金を払わないと合法的にオリンピックを見ることはできません。\n合法的にオリンピックを見るには、何かのサービスにお金を払わなければなりません。\n私が持っていたオリンピックへの熱意が失われてしまいます。私は、トレーニングや...",
  "data/reddit-changemyview/r/changemyview/comments/orzj99/cmv_the_us_should_not_reimpose.json": "次のような事実があります。\n\n * 米国におけるCOVIDによる死亡は、ほぼすべてがワクチン未接種者によるものである。\n   [https://apnews.com/article/coronavirus-pandemic-health-941fcf43d9731c76c16e7354f5d5e187]\n * ワクチン接種の有無は所属政党と高い相関がある\n   [https://jahoo.shinyapps.io/vaxpolitics/]\n *...",
  "data/reddit-changemyview/r/changemyview/comments/orvnvw/cmv_psychological_tests_in_job_applications_do.json": "採用担当者として、ずっと考えていたことがあります。私は自分のチームの候補者を\n私は自分のチームの候補者を自分で選ぶのが好きで、常にバランスのとれたハイパフォーマンスのチームを作りたいと思っています。\nパフォーマンスの高いバランスの取れたチームを作りたいと考えています。このようなテストでは、潜在的な心理的問題や、会社の目標に対する適合性に焦点を当てすぎているように感じます。\n問題に焦点を当てすぎているような気がします。",
  "data/reddit-changemyview/r/changemyview/comments/os08cv/cmv_wearing_camopatterns_as_a_civilian_is_not.json": "今週参加するフェスティバルのために、小さなショルダーバッグ（eastpak-classic-style）をセールで購入しました。\n迷彩柄が入っています。I\nこれは不快感を与えるかもしれないし、人に嫌われるかもしれないし、例えばキャンプの雰囲気を壊すかもしれないと言われました。\n例えば、キャンプの雰囲気を壊すことになると言われました。私はこのことに驚きました。",
  "data/reddit-changemyview/r/changemyview/comments/os5z4m/cmv_dental_care_should_be_included_in_the.json": "この議論は、国民皆保険制度があるアメリカ以外の国では、より重要な意味を持ちます。\n特に、強力な医療システムを持つヨーロッパの国々では、歯科治療を含まない\n歯の治療は含まれていません。\n\nどうやら誰かがある時点で、口は人体の一部ではないと判断したようです。\n口は人間の体の一部ではないと誰かが決めたらしい（？私は...",
  "data/reddit-changemyview/r/changemyview/comments/os8pwd/cmv_nuclear_power_while_dangerous_at_times_is_as.json": "何十年も前から、原子力発電所とその危険性を否定する動きがあります。\nその危険性を訴えています。チェルノブイリや福島の原子力発電所の事故を例に挙げています。\nチェルノブイリや福島の原子力発電所の事故を例に挙げていますが、これらは悲劇的なものではありますが、原子力の安全性や原子力が持つ全体的なメリットを示すものではありません。\n原子力の安全性や、原子力が持つ全体的なメリットを表しているわけではありません。\n\n75%が...",
  "data/reddit-changemyview/r/changemyview/comments/osksnn/cmv_if_dressage_can_be_considered_an_olympic.json": "私には、馬場馬術とは、馬を訓練してダンスをさせることだと思えるのです。それは、ライダーが\n騎手は、馬が自分の命令に従えるように、できる限りの訓練をして\n可能な限り正確な動きをするために、馬が命令に従うように訓練することです。それは\n騎手の身体能力はそれほど高くないようです。しかし...",
  "data/reddit-changemyview/r/changemyview/comments/oshkkh/cmv_if_your_shower_thoughts_are_your_most.json": "シャワー思考とは、シャワーを浴びているときにしか考えられないような、奇妙で面白い思考のことをいいます。\nシャワーを浴びている時にしか考えられないような 私の友人たちはこのことについて話していました。\nシャワーを浴びているときに最高の考えが浮かぶということで意見が一致しました。\nシャワーを浴びているときに最高の考えが浮かぶということで一致しました。また、このような面白い思考のためのサブレディットも存在します。",
  "data/reddit-changemyview/r/changemyview/comments/oskctm/cmv_academia_isnt_biased_towards_leftwing.json": "怒る人もいるかもしれませんが、最後まで聞いてください。\n\n学業とは、現実をありのままに、文化的・社会的な期待からできるだけ離れて観察することです。\n文化的、社会的な期待からできるだけ離れて、ありのままの現実を観察し、その事実がこれまでの自分の考えと矛盾していたら\nそして、その事実が今まで考えていたことと矛盾していたら、今までの思い込みを捨てて...。",
  "data/reddit-changemyview/r/changemyview/comments/oslb6j/cmv_radical_healthcare_reform_in_america_such_as.json": "私の考えはこうだ。反ワクチン感情の背後にある大きな（有機的な）理由は\n医療業界への不信感です。多くの人は、ワクチンに違和感を覚えることから、その道に入るようです。\nワクチンは大手製薬会社が儲けるための手段に過ぎないと感じることで、多くの人がこの道に進み始めているようです。\n多くの人は、ワクチンは大手製薬会社がより多くのお金を稼ぐための手段に過ぎないと感じることで、その道に進み始めます。アメリカでは、多くの人が実際に...",
  "data/reddit-changemyview/r/changemyview/comments/osmddg/cmv_people_who_make_false_rape_claims_should_get.json": "ここ数年、レイプの冤罪事件があちこちで発生しているようです。\n訴えられた人は人生を台無しにされ、被害者面をしている人は無罪放免。\n犠牲者になった人は無罪放免。\n\n私は、このような冤罪事件の犯人は刑務所に入るべきだと思います。\n訴えられた人と同じくらいの刑期を...",
  "data/reddit-changemyview/r/changemyview/comments/ospk4x/cmv_simone_biles_bailing_on_the_final_rotation_of.json": "BIGな序文。大坂なおみ選手が全仏オープンを辞退したとき、記者会見をさせられる代わりに\n大坂なおみ選手が記者会見をする代わりに全仏オープンを辞退したとき、私は誇らしく思いましたし、メンタルヘルスのために立ち上がった彼女をとても誇りに思いました。\nメンタルヘルスのために立ち上がった彼女を誇りに思いました。\n\n私は、メンタルヘルスへの意識を高め、偏見をなくすことを支持しています。\nこれは、「黙っていればいい」というものではありません。これは、「黙っていればいい」というものではありません。",
  "data/reddit-changemyview/r/changemyview/comments/ostfak/cmv_most_modern_day_movement_instill_victim.json": "私が多くの運動を支持するのに苦労する大きな理由は、私が本当に、つまり被害者意識が嫌いだからだと思います。\n私は被害者意識がとても嫌いです。\n\n私はいつも、誰かの犠牲になっていると感じたとき、人として最悪の状態になっていました。\n私はいつも、誰かの犠牲になっていると感じたときに、人として最悪の状態になります。\n\n確かに私は...",
  "data/reddit-changemyview/r/changemyview/comments/osp0nz/cmv_here_in_the_united_states_of_americausa_adult.json": "まず第一に、誰かに影響を与えたり、傷つけたりしない選択はすべて合法化されるべきだと思います。\n合法化すべきだと思います。大人の売春（18歳以上）は、一般的に双方の大人の間で合意されたものです。\n大人の売春（18歳以上）は、一般的に双方の大人の間で合意されたものです。片方の大人がもう片方の大人に親密な関係を求めてお金を払い、二人ともそれに同意します。\n親密な関係のためにお金を払い、二人ともそれに同意しています。つまり、一方の大人が...",
  "data/reddit-changemyview/r/changemyview/comments/osz59q/cmv_if_i_am_vaccinated_i_shouldnt_be_mandated_to.json": "この1年ほど、やるべきことはすべてやりました。私は社会的に\n社会的に距離を置き、どこでもマスクを着用し、家にいるようにし、そして\nワクチンもできるだけ早く接種しました。私の知り合いでワクチンを接種していない人は\n少なくとも私の地域では、ワクチンを接種していない唯一の人は、単にそれを望んでいないのです。なぜ私が...。",
  "data/reddit-changemyview/r/changemyview/comments/ot0zb5/cmv_the_death_penalty_should_be_given_to_people.json": "現代の奴隷制度は、アメリカをはじめとする西側民主主義諸国では最大のジョークのひとつです。\nアメリカのような西側民主主義国では、奴隷制度を擁護する最大のジョークの一つです。奴隷制度は決してなくならない、全くのジョークだよ\n人々は受刑者の労働力が搾取されていることを気にしていますが、彼らはまだ\n家族に比べて法の下で人間らしく扱われているのに、受刑者の労働力が搾取されていることを気にするなんて、まったくのジョークです。",
  "data/reddit-changemyview/r/changemyview/comments/osmu8n/cmv_every_human_on_earth_needs_a_entire.json": "タイトルが全てを物語っています。自分の周りで起こっていることに注意を払わない人の多さに愕然とします。\n周りで起きていることに注意を払わない人の多さに呆れてしまいます。\n\n風景や環境に注意を払わないために、車の事故や人がただ怪我をするのを何度も目撃しました。\n周りの景色や環境に注意を払わないために、怪我をしてしまう人をたくさん見てきました。\n怪我をしてしまうのです。\n\nこれには...",
  "data/reddit-changemyview/r/changemyview/comments/osp1i8/cmv_the_jan_6_commission_will_not_hold_anyone.json": "委員会の声を聞かなければならない人たちが、一番聞いていないような気がします。\n視聴する可能性は低い。せいぜい、お気に入りのメディアソースから抜粋されたクリップを手にして\n好みのメディアソースから抜粋され、メディアの個性が彼らの展望を形作ることになる。\n\n弾劾裁判では、召喚状を無視することができるということがわかりましたが...。",
  "data/reddit-changemyview/r/changemyview/comments/otbfy2/cmv_microaggressions_should_take_intent_into.json": "私は会社からDEI（Diversity Equity and Inclusion）研修に参加することを求められました。\n私は会社からDEI（Diversity Equity and Inclusion）研修に参加することを求められましたが、その中で「加害者が何を意図したかは関係ない。\n害があったのだから。\" この論理がどこから来ているのかは理解できますが、職場、正義、あるいは\n職場や司法、社会では通用しない原則です。\n\nここで、私は...",
  "data/reddit-changemyview/r/changemyview/comments/ot3puu/cmv_blm_movement_has_really_been_taken_over_by.json": "何かをする前にオッケー。私はBlack Lives Matterを信じています。ただ、もうこの運動を支持していません。\n運動を支持しないだけです。2020年にラテン系アメリカ人として、すべての警察の残虐行為と虐待を目の当たりにして\n虐待を目の当たりにして、心に響くものがありました。\n運動の最盛期には黒人コミュニティと一緒に行動していました。しかし、ラテンアメリカ人、イスラム教徒、アジア人...。",
  "data/reddit-changemyview/r/changemyview/comments/otmxoh/cmv_there_is_nothing_inherent_about_whiteness.json": "征服すること\n\nネイティブ・アメリカンは一つの均質な集団であると誤解している人が多いようです。\n同質のグループであると誤解している人が多いです。しかし、実際にはそうではありませんでした。戦争や紛争は、アメリカ人に伝わったものではありません。\nヨーロッパ人がアメリカに持ち込んだものではありません。アメリカには様々な部族が存在していました。\nアメリカの先住民族は、理想と利害が対立していたために、それぞれの部族が...",
  "data/reddit-changemyview/r/changemyview/comments/otjjxp/cmv_its_absolutely_ridiculous_that_religion_is.json": "誤解しないでいただきたいのですが、私はまだ科学に挑戦すべきだと考えています。\n仮説に対して他の具体的なアイデアで挑戦することが、科学のすべてなのです。\n仮説に他の具体的なアイデアをぶつけて、理論、あるいは事実を形成するのが科学というものです。しかし、宗教は、科学的な理論や事実に\nしかし、宗教は科学的な理論や考えに挑戦する場所ではありません。\n\n宗教は...",
  "data/reddit-changemyview/r/changemyview/comments/otgata/cmv_conspiracy_theories_arent_inherently_invalid.json": "最初にお断りしておきますが、この記事で使用している例は、あくまでも例であって\n私の個人的な見解を反映している場合もあれば、そうでない場合もあります。私は、特定の理論についてどちらかの立場に立つことはせず\nこの記事では、特定の説についてどちらかの立場に立つことはせず、その説を述べることにします。\n\n陰謀論とは、ある出来事や一連の出来事を説明するための理論です。",
  "data/reddit-changemyview/r/changemyview/comments/otsj77/cmv_allowing_russia_to_compete_as_roc_in_the.json": "まず最初に、私はロシアチームがROC（ロシアオリンピック委員会）という名前で出場することを認めているとは思いません。\nロシアチームがROC（ロシアオリンピック委員会）の名で出場することは、正当な罰だとは思いません。私は次のように考えています。\nロシアという名前で出場しているため、意図した罰が与えられていないと思います。\n罰が与えられないと思います。\n\nその名前で出場するのではなく、私は...",
  "data/reddit-changemyview/r/changemyview/comments/otsvkj/cmv_debating_religion_is_impossible_because_the.json": "私は何度もレリゴーの議論を試みましたが、根本的な欠陥の一つは\n根本的な欠陥は、宗教家が常に「神は実在する」というスタンスからスタートすることです。これはディベートの\n議論の基本的なルールを破っています。神の存在は肯定的な主張であり、その主張を裏付ける証拠を提示しなければなりません。\n神の存在は肯定的な主張であり、その主張を裏付ける証拠を持ってこなければ、本質的に...",
  "data/reddit-changemyview/r/changemyview/comments/otwng0/cmv_we_can_only_achieve_equality_through.json": "今の世代は、特定のグループの良いところを宣伝し、彼らに力を与えようとしています。\nしかし、これは振り子を逆に振っているだけだと思うのです。\n私たちが真の平等を手に入れる唯一の方法は、単に気にしないことだと思います。\n\n人の良いところを言うことは、同じようにダメージを与えると思うのですが...。",
  "data/reddit-changemyview/r/changemyview/comments/otyhs5/cmv_todays_woke_culture_is_making_many_people.json": "私は、マイノリティの闘争がますます盛んになり、被害者を辱めることがなくなった時代に生きていることを嬉しく思いますが。\n犠牲者を辱めるのをやめる時代になったことは喜ばしいことです。少なくとも、私たちは努力しています。しかし、たとえ私が\n人々やその背景、個々の苦悩をより理解することは良いことだと思います。\n理解を深めることは良いことだと思いますが、私はこのような社会を作ってしまうことを嫌っています...。",
  "data/reddit-changemyview/r/changemyview/comments/ou3oxs/cmv_loli_is_pedophilia.json": "私の考えでは、ロリコンはペドフィリアです。さて、「現実にはありえない」とか「アニメではわからない」とか言う前に\n「アニメではわからない」と言われる前に説明します。\n\nロリコンがペドフィリアなのは、特に子供をターゲットにしているからです。\n探すことで、子供のヘンタイを探そうとしていることになります。もし、あなたが\n偶然にも...",
  "data/reddit-changemyview/r/changemyview/comments/ou2pah/cmv_mental_health_education_has_been_neglected_on.json": "メンタルヘルス教育が社会的に軽視されてきたのは、わざとだと思います。\n意図的に...。\n\n精神的にネガティブな状態にある人は、自分が何をしているのか分からなくなる傾向があります。\n自分の価値を認めず、自分の不安から他人を批判する傾向があります。また、新しいアイデアを受け入れることもできません。\n新しいアイデアを受け入れることができません。\n\n私たちの政府は、以下のような人々を必要としています...",
  "data/reddit-changemyview/r/changemyview/comments/ou9qt9/cmv_wearing_a_mask_and_vaccine_mandates_are_not.json": "そのため、共和党員からは、ワクチンやマスクの義務化は、米国政府のコントロールのためだという声をよく聞きます。\n政府がコントロールするためだと。\n\nしかし、この議論は無意味だと思います。マスクの着用やワクチンの接種を義務付けることが、どうして\n政府の管理下に置かれることになるのでしょうか？アメリカ政府は、無料でワクチンを提供することで、何を得ることができるのでしょうか？\nアメリカ政府は無料でワクチンを提供することで何を得ることができるのでしょうか...。",
  "data/reddit-changemyview/r/changemyview/comments/ou9sl8/cmv_the_us_bloated_military_budget_is_thanks_to.json": "私の考えでは、軍は防衛関連企業によって腐敗しています。\n\nこれらの企業は戦争で金儲けをしています。ペンタゴンの元職員がこれらの企業のスタッフになっています。\nこれらの企業は、戦争でお金を稼ぎ、元国防省の役人がこれらの企業のスタッフになっています。\n外交政策を歪めることができるのです その外交政策とは、介入を含む...",
  "data/reddit-changemyview/r/changemyview/comments/oudr3x/cmv_nobody_should_have_to_tailor_resumes_or_cover.json": "これは、候補者がATSで履歴書全体を書き直すことを強制する場合にも当てはまります。\nATSで求職者に履歴書を全部書き直させることや、いい加減に作られたフィルターを通すために職務経歴書の言葉を使い回すことを教える家内工業の不条理さ\n怠惰に設計されたフィルターを通過するために職務記述書の言葉を使いまわすことを教える家内工業の不条理さ、そして、企業の注目を集めるためには\nまた、審査員の注意を引くためには、自分の力が必要だという考えもあります...",
  "data/reddit-changemyview/r/changemyview/comments/ou3ryd/cmv_the_24hour_news_cycle_is_ruining_the_olympics.json": "NBCやその系列局をはじめ、誰もが「速報」の第一報を求めているので\nネタバレしないようにするのはほぼ不可能です。勝者は\n体操女子総合の優勝者は、NBCの午後の番組開始と同時に息を呑んで発表された。\nNBCの午後の番組の最初に、息をのんで発表されました。",
  "data/reddit-changemyview/r/changemyview/comments/oubgfc/cmv_product_placement_advertisements_and_other.json": "ストリーミングTVでは、作家や監督が意図したように、一定の流れで番組を見ることに甘んじています。\n脚本家や監督が意図したように、一定の流れを見ることができます。何らかの理由で生放送に戻らなければならなくなったときには\n何らかの理由で生放送に戻らなければならなくなったとき、広告の切れ目がとても邪魔になります。番組から時間を奪うだけでなく\n番組の時間を奪うだけでなく、CMの音量が違ったり...。",
  "data/reddit-changemyview/r/changemyview/comments/ounnoo/cmv_if_youre_taking_onlyfan_pictures_in_your.json": "何よりも注意していただきたいのは、一線があるということです。\n電話をかけたり、セクハラをしたりしてはいけません。しかし、もしあなたがトイレに行くときに単純に\nトイレに行っていると、「ああ、他の仕事で時計を鳴らしに行くのか！」とか、「ファンサービスの部屋ではなく、トイレだということを忘れるなよ。\nとか「トイレだよ、ファンサービスの部屋じゃないことを忘れるなよ」などなど。ISウェル...",
  "data/reddit-changemyview/r/changemyview/comments/ourfq9/cmv_everyone_should_learn_two_foreign_languages.json": "ある年齢以下の子供は、言語を習得するのがはるかに容易であるという強い科学的証拠があります。\nある年齢以下の子供たちは、言語を習得するのがはるかに容易であり、言語を話すことができるということは\n非常に有用なツールです。私の考えでは、子供たちが中学や高校になってから外国語を学び始めるのは\n私の考えでは、子供たちが外国語を学び始めるのを中学や高校まで待たせるのは、彼らが...",
  "data/reddit-changemyview/r/changemyview/comments/ouwcvg/cmv_starting_a_post_with_throwaway_account_to.json": "よく見かける光景ですね。誰かがストーリーを投稿して、最初に「捨てアカウント\n捨てアカウント」と書いてから、非常にユニークで具体的な\n極めてユニークで特殊なストーリーを投稿して、明らかにその人たちに認識されるような\n極めてユニークで特殊なストーリーを投稿します。例えば...",
  "data/reddit-changemyview/r/changemyview/comments/ouuy0m/cmv_the_way_we_treat_slurs_is_weirdly.json": "似たようなテーマで投稿した\n[https://www.reddit.com/r/changemyview/comments/mkv0w5/cmv_normalising_the_use_of_slurs_is_bad_but_the/]\n少し前に投稿したのですが、特にこの点についてはあまり反論がなかったので\nこの点については特に反論がなかったので、独自のCMVを作るべきだと考えました。はっきりさせておきますが、これは\nプロのスラー...",
  "data/reddit-changemyview/r/changemyview/comments/ov1clv/cmv_white_people_can_experience_racism_alongside.json": "最初に申し上げたいのは、多くのPOCが日常的に経験している人種差別を軽視しているわけではないということです。\n多くのPOCが日常的に経験している人種差別を軽視しているわけではなく、大きな問題であり、解決のためには注意が必要だと考えています。\nこれは大きな問題であり、解決のためには注意が必要です。\n\nソーシャルメディアでは、白人は人種差別を経験しないと主張する人々の投稿をよく目にします。\n人種差別を経験することはないと主張する人々の投稿によく遭遇します。その...",
  "data/reddit-changemyview/r/changemyview/comments/ov5vt6/cmv_i_think_most_other_gender_identities_are.json": "トランスジェンダーには興味があります。\n10代の \"トランスジェンダー \"が段階を踏んでいるだけです。\n\nしかし、多くの非バイナリーの人々は、「伝統的な性別の役割」に適合したくないと決めたことで、特別な存在になりたいと思っている人々だと思います。\n伝統的な性別の役割」に適合したくないと決めたからです。\nそれは...",
  "data/reddit-changemyview/r/changemyview/comments/ov8smv/cmv_governments_are_just_organized_crime_on_a.json": "CMV: 毎日のようにニュースで、政府が組織犯罪を取り締まっているという記事を目にします。\n組織犯罪を取り締まるという記事を毎日のように目にします。\n政府が所有していないものなら何でもです。しかし、ニュースではあまり取り上げられません。\n政府は、おそらくあなたの背後で同じことをしていたということです。",
  "data/reddit-changemyview/r/changemyview/comments/ov92pw/cmv_social_media_and_new_wave_parenting_has.json": "若い世代がよりオープンで、様々な生き方を受け入れていることは評価できますが\n受け入れていることは評価できますが、一方で、私たちの世代では\n私たちの世代は、少しでも違う意見を持つ人に対して、我慢できないほど不寛容になっていると思います。\n\n私(20M)は、インターネットと共に育ち、社会的な活動に参加してきました。",
  "data/reddit-changemyview/r/changemyview/comments/ovb9rp/cmv_being_made_to_pay_taxes_to_the_government_for.json": "国民皆保険制度は、民営化された医療制度と比較すると、特に短所よりも長所の方が大きいと思います。\n特に民営化された医療システムと比較した場合、メリットの方が大きいと思います。\nなぜ国民皆保険制度が一般的でないのか、私には理解できません。\nなぜ、国民皆保険制度が一般的でないのか理解できません。",
  "data/reddit-changemyview/r/changemyview/comments/ovepiv/cmv_as_a_vaccinated_american_telling_me_to_wear_a.json": "ワクチンを接種すればCOVIDに感染しないという保証はありませんが、データによれば\n入院や死亡の可能性は、ワクチンを接種した人にとってはごくわずかであることがデータで示されています。\nワクチンを接種した人は、接種していない人に比べて、入院や死亡の可能性はごくわずかであるというデータがあります。多くの人がCOVIDの健康被害を考慮していることを考えると、これは非常に重要なことです。\nワクチンを接種する前からCOVIDの健康リスクは無視できると考えている人が多いのですから...。",
  "data/reddit-changemyview/r/changemyview/comments/ov9foo/cmv_i_think_celebrities_should_be_more_open_about.json": "もし誰かがジムシャークのアスリートやIFBBプロ、あるいは20ポンドの筋肉をつけただけの俳優であれば\nチキン、ライス、ブロッコリー」を食べて20ポンドの筋肉をつけた俳優がいたとしても、現実にはほとんどの人がステロイドを使用しています。\nステロイドを使用している可能性がありますが、多くの人はこれらの人々が自然であり\nしかし、多くの人々はこれらの人々が自然であり、ハードなトレーニングと食事をすれば...",
  "data/reddit-changemyview/r/changemyview/comments/ob61pw/cmv_san_joses_new_gunowners_pay_for_gun_violence.json": "サンノゼは、新しい政策を制定し、すべての希望者に、この政策を強制することにしました。\n憲法修正第2条の権利を行使するために、保険に加入する必要があります。\n銃乱射事件の被害者に支払う\n\n私はそれは間違っていると思います。私がなぜそう思うのか、このシナリオを想像してみてください。\nこのように\n\n「自分の権利を行使するすべての人は..."
}