{
  "data/tweet-nytimes/2022/5/1520710885911711745.json": "デルタ航空は、アラスカ行きの500万匹のミツバチの荷物をアトランタに迂回させ、暑い駐機場にミツバチの荷物を放置してしまいました。地元の養蜂家たちが救助に向かったが、生き残ったのはごくわずかだった。\"これはまさに無駄であり、絶対的な悲劇だ\" https://t.co/Zc3dRi3XkB",
  "data/tweet-nytimes/2022/5/1520658041523351554.json": "ケーブルニュースのプライムタイムで最も視聴率の高い番組の司会者であるタッカー・カールソンは、視聴者に恐怖心を植え付けるために単純な物語を使用する。彼がどのように過激な思想や陰謀論を広めているのかを理解するために、1,150のエピソードを分析しました。以下はその結果です。https://t.co/qUVe1jpso4",
  "data/tweet-nytimes/2022/5/1520763740068761600.json": "ナンシー・ペロシは土曜日、ウクライナの首都を予告なしに訪問し、戦争が始まって以来、ヴォロディミル・ゼレンスキー大統領と会談した米国高官の中で最高位となった。彼女は大統領に、「私たちのコミットメントは、戦いが終わるまであなたのそばにいることです」と語った。https://t.co/qiefJPVPMt https://t.co/ms1jTh5Fdg。",
  "data/tweet-nytimes/2022/5/1520775064228143104.json": "ウラジーミル・プーチン支持を理由に降板したロシアの歌姫に代わり、ウクライナ人ソプラノ歌手リウドミラ・モナスティルスカが土曜日にメトロポリタンオペラで「トゥーランドット」のタイトルロールを歌い上げた。カーテンコールでは、モナスティルスカはウクライナの国旗に包まれて登場した。https://t.co/QRSM8hZPUN https://t.co/rV8DaOlLHT",
  "data/tweet-nytimes/2022/5/1520778838179041281.json": "タッカー・カールソンは、熱烈なドナルド・トランプ信者の代表格だ。2016年以降、彼の番組はトランプの魅力の感情的な核心部分、つまり多様性を増す米国に対する白人のパニックに焦点を当てた。\n\nこのシフトがカールソンの出世の原動力となり、フォックスニュースを再構築した。https://t.co/MPDVIOql1p https://t.co/2kA4Da8gvl。",
  "data/tweet-nytimes/2022/5/1520816587091161088.json": "タッカー・カールソンは視聴者の恐怖心を武器に、ケーブルニュース史上最も人種差別的な番組を作り上げたといえる。\n\nニューヨーク・タイムズ紙の調査によると、彼の台頭がフォックス・ニュースや米国の保守主義の変容といかに絡み合ってきたかがわかります。https://t.co/176OLUd00R。",
  "data/tweet-nytimes/2022/5/1520880084168622082.json": "世界初のディスコを開いたとされるレジーヌが92歳で死去。彼女は、当時最も有名なナイトスポットであったマンハッタンの「レジーヌ」をはじめ、ヨーロッパ、中東、アメリカ大陸に23のクラブを展開し、5億ドルの帝国を築いた。https://t.co/FMFz5XwWRn https://t.co/w9aTgR0WGX。",
  "data/tweet-nytimes/2022/5/1520975151587864576.json": "ロシアで数少ない自営業の大物であるオレグ・ティンコフ氏が、自国のウクライナ戦争に反対を表明した。今、彼は身を隠している。\n\n独占インタビューで彼は、「プーチン大統領の下でのロシアの未来を信じていない」と語った。https://t.co/fT5ta26ddn。",
  "data/tweet-nytimes/2022/5/1520960028609495040.json": "ナンシー・ペロシ下院議長は週末にキエフを訪れ、ヴォロディミル・ゼレンスキー大統領と会談し、ウクライナの対ロシア支援を表明する2度目の米国上級代表団を率いている。https://t.co/d2MxIjKfYF",
  "data/tweet-nytimes/2022/5/1520861890137800705.json": "フィリピンの大統領選挙が近づく中、多くの若い有権者がレニ・ロブレド副大統領を支持している。独裁者の息子であるフェルディナンド・マルコスJr.に対して、彼女は長い勝算に直面しており、古い世代には強権支配を懐かしむ人もいる。https://t.co/mR3BtaVp7M。",
  "data/tweet-nytimes/2022/5/1521067004517654528.json": "ロシアはウクライナ戦争に地上戦闘力の約65％を投入しているが、その4分の1以上が「戦闘不能」になっている可能性が高いと英国は発表した。この評価は、ロシア軍が大きな損失を被ったという情報報告に加えて、https://t.co/J2TOBmDRLV。",
  "data/tweet-nytimes/2022/5/1520897119820955655.json": "キム・カーダシアンとピート・デヴィッドソンがワシントンでレッドカーペットデビューすることを選んだのは、彼らが世界からどう見られたいかを明確に示していた。https://t.co/03mrWFFrMX。",
  "data/tweet-nytimes/2022/5/1520965927038337025.json": "\"2ヶ月の暗闇\"\n\nウクライナ・マリウポルのアゾフスタル製鉄所の地下に隠れている人たちの避難が進んでいる。ある労働者は、もう何週間も陽の光を見 ていないと語った。https://t.co/4FNMCBB91S https://t.co/N1wyvwBfTG",
  "data/tweet-nytimes/2022/5/1521145957299232769.json": "速報です。最高裁は、ボストンが市庁舎でキリスト教の旗を掲げるグループを拒否したのは憲法修正第1条に違反するとの判決を全会一致で下した。https://t.co/lvPYldWgNb。",
  "data/tweet-nytimes/2022/5/1521044360879644677.json": "\"私たちは変化を求めている\"\n\n多くの若いフィリピン人は 大統領選の最有力候補が 故独裁者の息子であるフェルディナンド・マルコス・ジュニアであることを ひっくり返そうと狙っています https://t.co/lsOfAdxQWV"
}