{
  "author": "darkfighter101",
  "the_new_excerpt": "At my university I see publications about advances in the efficacy of\nchemotherapy or longevity of Alzheimer’s patients. But I see no news on\ntreatments to help people with diabetes or scoliosis to live more useful lives,\netc.\n\nAs people live longer and longer, this will strain our economy. Peoples…",
  "original_created_utc": 1622796344,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の大学では、化学療法の有効性やアルツハイマー病患者の寿命が向上したという論文を目にします。\n私の大学では、化学療法の効果が上がったとか、アルツハイマー病の患者さんが長生きしたとかいう発表を目にします。しかし、糖尿病や脊柱管狭窄症の患者さんが\n糖尿病や脊柱管狭窄症の人がより便利な生活を送るための治療法のニュースはない。\nなどなど。\n\n人々がますます長生きするようになると、経済を圧迫することになります。人々の...",
      "title": "なぜ現代の医療は、健康な生活の質や長さよりも、寿命を延ばすことに重点を置いているのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我的大学里，我看到关于化疗疗效的进展的出版物\n化疗或阿尔茨海默氏症患者的长寿。但我没有看到关于\n帮助糖尿病患者或脊柱侧弯患者活得更有意义的治疗方法。\n等等。\n\n随着人们的寿命越来越长，这将给我们的经济带来压力。人们...",
      "title": "为什么现代医疗服务更注重延长生命的长度而不是健康生命的质量和长度？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我的大學裏，我看到關於化療療效的進展的出版物\n化療或阿爾茨海默氏症患者的長壽。但我沒有看到關於\n幫助糖尿病患者或脊柱側彎患者活得更有意義的治療方法。\n等等。\n\n隨着人們的壽命越來越長，這將給我們的經濟帶來壓力。人們...",
      "title": "爲什麼現代醫療服務更注重延長生命的長度而不是健康生命的質量和長度？"
    }
  ],
  "title": "Why does modern healthcare focus on extending length of life more than the quality and length of a healthy life?",
  "created_utc": 1622817270,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>At my university I see publications about advances in the efficacy of chemotherapy or longevity of Alzheimer’s patients.  But I see no news on treatments to help people with diabetes or scoliosis to live more useful lives, etc.</p>\n\n<p>As people live longer and longer, this will strain our economy.  Peoples bodies will break down at the same age, so we cannot raise the retirement age.</p>\n\n<p>The most useful thing to do to maintain a functioning retirement system is for healthcare to focus on increasing quality of life rather than lifespan, as it will allow people to be healthy longer and retire later.</p>\n\n<p>Healthier people in general are happier than older but sicker people, so why do governments/healthcare shift focus?</p>\n</div><!-- SC_ON -->",
  "score": 257,
  "permalink": "/r/TooAfraidToAsk/comments/ns0c9e/why_does_modern_healthcare_focus_on_extending/",
  "subreddit": "TooAfraidToAsk",
  "id": "ns0c9e",
  "is_self": true,
  "media": null,
  "is_video": false
}