{
  "author": "MikeNice81_2",
  "original_created_utc": 1637325694,
  "title": "Is there any evidence that Trotskyist joined and shaped the Republican Party in America during the 20th century?",
  "created_utc": 1637373917,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In her article &quot;The Myth of the Classically Educated Elite&quot; Naomi Kanakia makes the following claim,</p>\n\n<p>&quot;Indeed, the one area where Classical education continues to be in vogue is among neoconservatives: that group of former Trotskyists who turned to the Republican Party in the late 20th century and became a huge (albeit now waning) influence on conservative politics.&quot;</p>\n\n<p>Is there a firm basis for an assertion that the neoconservative movement was an extension (or evolution of) Trotskyism and Marxism?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/qxfeba/is_there_any_evidence_that_trotskyist_joined_and/",
  "subreddit": "AskHistorians",
  "id": "qxfeba",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In her article \"The Myth of the Classically Educated Elite\" Naomi Kanakia makes\nthe following claim,\n\n\"Indeed, the one area where Classical education continues to be in vogue is\namong neoconservatives: that group of former Trotskyists who turned to the\nRepublican Party in the late 20th century and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ナオミ・カナキアは、「The Myth of the Classically Educated Elite」という論文の中で、次のように述べています。\n次のように主張しています。\n\n「実際、古典教育が流行し続けているのは、ネオコンの間である。\n新保守主義者の間では、かつてのトロツキストのグループが、レプチュードに転向して\n20世紀後半に共和党に寝返った元トロツキストのグループで、...",
      "title": "20世紀のアメリカで、トロツキストが共和党に参加して形作ったという証拠はあるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "纳奥米-卡纳基亚在她的文章《受过古典教育的精英的神话》中提出\n提出以下主张。\n\n\"事实上，在古典教育继续流行的一个领域是\n新保守主义者：那群在20世纪末转向共和党的前托洛茨基主义者。\n他们在20世纪末转向共和党，并...",
      "title": "是否有证据表明托洛茨基主义者在20世纪加入并塑造了美国的共和党？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "納奧米-卡納基亞在她的文章《受過古典教育的精英的神話》中提出\n提出以下主張。\n\n\"事實上，在古典教育繼續流行的一個領域是\n新保守主義者：那羣在20世紀末轉向共和黨的前托洛茨基主義者。\n他們在20世紀末轉向共和黨，並...",
      "title": "是否有證據表明托洛茨基主義者在20世紀加入並塑造了美國的共和黨？"
    }
  ]
}