{
  "author": "LpcArk357",
  "original_created_utc": 1637093454,
  "title": "NFTs... Have people lost their minds?",
  "created_utc": 1637106071,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I&#39;m not new to crypto and Blockchain technology. However I have not been paying super close attention to what&#39;s been going on. Does anyone have any clue why people are paying hundreds, and even thousands, if not hundreds of thousands of dollars for stupid little pictures (NFTs)? I understand that the pictures are &quot;unique&quot; as non-fungible tokens are well, non-fungible. I spent a few minutes on opensea and I just can&#39;t imagine paying $215 for an 8 bit viking with a stripe shirt. Valuable art usually has some type of historical value to it. I understand why Davinci pieces are expensive. Do people really believe that buying these NFTs means they&#39;re going to hold them and get rich off them later on? Because to me it looks like the only people getting rich are the ones getting away with selling them first off and leaving the bag with the buyers.</p>\n</div><!-- SC_ON -->",
  "score": 360,
  "permalink": "/r/CryptoCurrency/comments/qvgvdu/nfts_have_people_lost_their_minds/",
  "subreddit": "CryptoCurrency",
  "id": "qvgvdu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I'm not new to crypto and Blockchain technology. However I have not been\npaying super close attention to what's been going on. Does anyone have any clue\nwhy people are paying hundreds, and even thousands, if not hundreds of thousands\nof dollars for stupid little pictures (NFTs)? I understand that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ですから、私は暗号やブロックチェーン技術には慣れていません。しかし、私はこれまで\n何が起こっているのか、非常に注意を払っていません。誰か手がかりを持っていますか？\nなぜ人々はくだらない小さな絵に何百ドル、何千ドルも払うのか？\n愚かな小さな絵（NFT）に何百ドル、何千ドルも払う理由を誰か知りませんか？私はそれを理解しています...。",
      "title": "NFT... 人々は気が狂ってしまったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我对加密货币和区块链技术并不陌生。然而，我一直没有\n超级密切关注所发生的事情。有没有人知道\n为什么人们要为愚蠢的小图片（NFT）支付几百甚至几千，甚至几十万的费用？\n愚蠢的小图片（NFTs）而支付数百甚至数千美元？我明白，...",
      "title": "NFTs... 人们是否失去了理智？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我對加密貨幣和區塊鏈技術並不陌生。然而，我一直沒有\n超級密切關注所發生的事情。有沒有人知道\n爲什麼人們要爲愚蠢的小圖片（NFT）支付幾百甚至幾千，甚至幾十萬的費用？\n愚蠢的小圖片（NFTs）而支付數百甚至數千美元？我明白，...",
      "title": "NFTs... 人們是否失去了理智？"
    }
  ]
}