{
  "author": "Mike_millions",
  "the_new_excerpt": "I’ve seen outrageous posts and bets here recently, and people have lost money\nbecause they have no idea what they are doing. So, I’m just going to leave this\nhere and post it again, or a long version throughout the week to lower this\nmadness and save people from losing money. I honestly hope…",
  "original_created_utc": 1614505886,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "最近我在这里看到一些离谱的帖子和赌注，大家都输了钱。\n因为他们不知道自己在做什么。所以，我只是要离开这个。\n这里再发一遍，或者整个星期发一个长版，降低这个\n疯，救人于水火之中。我真心希望...",
      "title": "GME是一只MEME股票"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近我在這裏看到一些離譜的帖子和賭注，大家都輸了錢。\n因爲他們不知道自己在做什麼。所以，我只是要離開這個。\n這裏再發一遍，或者整個星期發一個長版，降低這個\n瘋，救人於水火之中。我真心希望...",
      "title": "GME是一隻MEME股票"
    }
  ],
  "title": "GME IS A MEME STOCK",
  "created_utc": 1614525414,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve seen outrageous posts and bets here recently, and people have lost money because they have no idea what they are doing. So, I’m just going to leave this here and post it again, or a long version throughout the week to lower this madness and save people from losing money. I honestly hope newcomers see this...</p>\n\n<p>Tl;dr: STOP OVERTHINKING</p>\n\n<p>Treat GME like a meme stock and buy on the dip. If you buy options, set the expiration for end of month/April. Doesn’t matter what the strike price is because of IV Crush. You can sell anytime without effecting the cause (always pay yourself, keeps your head clear). If you sell before stimmies, buy back in. Gamma is pending. </p>\n\n<p>Longer version:</p>\n\n<p>There will be a squeeze and a gamma squeeze this month (March). Follow the money/word of mouth. The real catalysts are social media and upcoming stimulus. </p>\n\n<p>GME is a meme stock, meaning it does not function like other stocks. It’s abnormal. Therefore, it has high IV and is constantly in a state of IV Crush. This means if you buy options, it doesn’t matter what your strike price is. All that matters is the expiration. Set longer expirations for your calls/puts so you can sell whenever you feel like paying yourself and buy the shares to support the cause. </p>\n\n<p>GME being a meme is not a bad thing. In fact, it’s why we can do this. You don’t need an over complicated strategy to make profit here. The stock will rise and gamma when the little people are given 600 billion dollars to invest. Hedge funds know this and will use this as the opportunity to win the war. This isn’t new information. This has been in play since January, possibly even before. Why did DFV set his calls to expire in April? Why are hedgies repositioning themselves? Why did shorties call foul play against us in January? Play it smart and safe and you won’t lose a dime and will make unbelievable profits. </p>\n\n<p>Remember that we are small fish in a gigantic pond that has existed even before DFV decides to make his move. I can elaborate on this later. While we may be small fish, the great equalizer is the stimulus. Some of you don’t remember this: but shorties and hedgers cries foul play, blaming the government for giving people the power to take their profits because the stimulus gave millions of people the same buying power as hedge funds. Fueled by word of mouth, which travels at the speed of light because of social media, it created an explosion that they could not control, so they shut down the game. It will happen again. </p>\n\n<p>I think people are overthinking this and coming up with convoluted plans, when all you have to do is buy and hold. Sell your options, but hold your shares. Rinse and repeat. It’s what hedge funds are doing. It’s all there if you look at the charts AND the options. Look at the whole picture and follow the money. </p>\n\n<p>Cash app finally added GameStop to purchase, meaning ANYBODY can buy the stock, AND the the stimulus is on its way. Put it together. Don’t look for a made up catalyst. It’s right there in front of all of us. It happens with hertz, and it happened in January. Don’t underestimate the power of the Apes and social media. </p>\n\n<p>I left a lot of things unexplained but you get the picture. Also, for those of you who are spreading the word, keep it up and ramp it up before the stimmies drop. Doing God’s work (not religious just an expression). I’ll see you all in Andromeda (galaxy far away because this is going intergalactic). </p>\n\n<p>This is just my opinion, trying to save lives not give financial advise. If it sounds this way that’s interpretation. </p>\n\n<p>I eat crayons and huff gas fumes for fun!</p>\n\n<p>I hope all newcomers see this...</p>\n\n<p>Edit: thank you all so much! I am replying to you Damn apes as fast as I can! Am I officially an Ape now? I love you guys and want ALL OF US to prosper! I left some things out like how “GameStop is a cow that produces infinite milk and that’s why shorties keep coming back to ‘squeeze’” but I thought it was implied lol my B. I was planning on making a more in-depth version of this post soon though!</p>\n\n<p>Whenever you are confused and dissuaded by all the misinformation, come back here or speak my name. I’ll be there to put you back on the right path.</p>\n</div><!-- SC_ON -->",
  "score": 6053,
  "permalink": "/r/wallstreetbets/comments/luc6hf/gme_is_a_meme_stock/",
  "subreddit": "wallstreetbets",
  "id": "luc6hf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937752781
}