{
  "author": "Innit4theTech",
  "original_created_utc": 1631901994,
  "title": "Diversification is not buying different crypto-currencies.",
  "created_utc": 1631914476,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Diversify in other markets as well, don’t put all your money on crypto. As bullish as I am on Crypto, I have not invested more than what I can afford to lose, which is what all of you should be doing too!</p>\n\n<p>Stocks, Bonds, Real Estate, Physical Assets are just some ways to diversify. I would 100% recommend you to invest in these markets as well as in crypto. </p>\n\n<p>If the crypto market collapses, you should always have a back up. Which is why I also recommends everyone to have an Emergency Fund as well!</p>\n\n<p>I know holding a shitcoin like USD isn’t a smart investment but in case of emergency it’s super easy to use and is accepted everywhere.</p>\n\n<p>Tldr; Diversify in other markets as well, and don’t put all your money into crypto!</p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/CryptoCurrency/comments/pq5dxw/diversification_is_not_buying_different/",
  "subreddit": "CryptoCurrency",
  "id": "pq5dxw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Diversify in other markets as well, don’t put all your money on crypto. As\nbullish as I am on Crypto, I have not invested more than what I can afford to\nlose, which is what all of you should be doing too!\n\nStocks, Bonds, Real Estate, Physical Assets are just some ways to diversify. I\nwould 100%…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "他の市場にも分散して、すべての資金を暗号につぎ込まないようにしましょう。私も\n私は暗号に強気ですが、失ってもいい金額以上は投資していません。\n皆さんもそうしてください。\n\n株式、債券、不動産、現物資産は、分散投資の方法のひとつです。I\n私は100％...",
      "title": "分散とは、異なる暗号通貨を購入することではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "也要在其他市场上分散投资，不要把你所有的钱都放在加密货币上。就像\n虽然我看好加密货币，但我的投资没有超过我能够承受的范围。\n损失，这也是你们所有人应该做的\n\n股票、债券、房地产、实物资产只是分散投资的一些方式。I\n将100%...",
      "title": "分散投资不是购买不同的加密货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "也要在其他市場上分散投資，不要把你所有的錢都放在加密貨幣上。就像\n雖然我看好加密貨幣，但我的投資沒有超過我能夠承受的範圍。\n損失，這也是你們所有人應該做的\n\n股票、債券、房地產、實物資產只是分散投資的一些方式。I\n將100%...",
      "title": "分散投資不是購買不同的加密貨幣。"
    }
  ]
}