{
  "author": "gentlestone",
  "the_new_excerpt": "With the influx of new investors taking interest in the stock market and\nthinking about investing, first and foremost I applaud you for taking the first\nsteps! Being young and wanting to see your money grow puts you in an even better\nsituation for the future!\n\nHowever, if you aren't familiar with…",
  "original_created_utc": 1615126119,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "随着大量新的投资者对股票市场的兴趣和\n思考投资，首先我为你采取的第一个\n步！年轻的时候，想看到自己的钱增长，让你处于一个更好的。\n的情况下，为未来!\n\n不过，如果你不熟悉...",
      "title": "PSA：新投资者--考虑在开立经纪账户之前，先开立一个罗斯/传统IRA，以接触股市。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着大量新的投資者對股票市場的興趣和\n思考投資，首先我爲你採取的第一個\n步！年輕的時候，想看到自己的錢增長，讓你處於一個更好的。\n的情況下，爲未來!\n\n不過，如果你不熟悉...",
      "title": "PSA：新投資者--考慮在開立經紀賬戶之前，先開立一個羅斯/傳統IRA，以接觸股市。"
    }
  ],
  "title": "PSA: New Investors - Consider opening a Roth/Traditional IRA before opening a brokerage account to get exposure to the stock market.",
  "created_utc": 1615130826,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>With the influx of new investors taking interest in the stock market and thinking about investing, first and foremost I applaud you for taking the first steps! Being young and wanting to see your money grow puts you in an even better situation for the future!  </p>\n\n<p>However, if you aren&#39;t familiar with the tax advantages of a retirement account such as a Roth IRA, I encourage you all to look into how those accounts work, as you can invest in mutual funds and ETFs to gain exposure to various aspects of the stock market to get started.</p>\n\n<p>Maxing out your annual contributions will put you in a fantastic spot down the road! And if you have money left over to invest, definitely open a brokerage account and play the game, but consider tax advantaged accounts first! </p>\n\n<p>Much love to all of you! May your lives all be prosperous!</p>\n</div><!-- SC_ON -->",
  "score": 54,
  "permalink": "/r/investing/comments/lzrde7/psa_new_investors_consider_opening_a/",
  "subreddit": "investing",
  "id": "lzrde7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542574796
}