{
  "author": "AceyFacee",
  "original_created_utc": 1654691927,
  "title": "Is gender a real thing?",
  "created_utc": 1654768855,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When it comes to gender identity, I find it very difficult to answer ‘What is it to be a woman/man’ without either appealing either to physical sex, or a set of traits, characteristics or actions which aren’t shared by all. &lt;/p&gt;\n\n&lt;p&gt;I think that if we have to say, to be a woman is to be a caregiver, a mother, or anything like that, or to say that a man is a provider, or a protector or something like that, then we’re back to the old rigid gender categorisation of behaviours and characteristics which are often very generalised and stereotypical. &lt;/p&gt;\n\n&lt;p&gt;The problem then, is if gender is often said to be a kind of feeling, and that feeling appeals to preconceived notions of what a woman or a man should be like, then how can we say that gender is a thing without appealing to some traditional or almost conservative conception of what a man or a woman is, or what they’re supposed to look like?&lt;/p&gt;\n\n&lt;p&gt;Are we left then with either; gender exists, and it is constituted by social labels being attributed to traits, characteristics and behaviours/interests. Gender exists, and it is tied to biological sex (hence hormone treatment and surgery). Or gender is not something which can be applied to humans, more like something which is applied to words, and thus doesn’t exist in the way it is said to be as an identity. &lt;/p&gt;\n\n&lt;p&gt;I’d appreciate some insight on this and hopefully to have an actual conversation on the matter! &lt;/p&gt;\n\n&lt;p&gt;I would also like to clarify, that I do not aim to devalue ANYBODY, or to dismiss anyone’s feelings. I just want to have a conversation where we can ask questions about what we do not know, in order to hopefully get closer to the truth together.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/askphilosophy/comments/v7oo1n/is_gender_a_real_thing/",
  "subreddit": "askphilosophy",
  "id": "v7oo1n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "When it comes to gender identity, I find it very difficult to answer ‘What is it\nto be a woman/man’ without either appealing either to physical sex, or a set of\ntraits, characteristics or actions which aren’t shared by all.\n\nI think that if we have to say, to be a woman is to be a caregiver, a…"
}