{
  "author": "RepresentativeSalt82",
  "the_new_excerpt": "OMG you all, did you hear that when bitcoin was worth much less that people had\nto use more of them to equate the value of the item/service that they bought at\nthe time!\n\nBut now, since bitcoin is worth so much more, that same about of bitcoin is\nworth so much more!\n\nClearly if they had not bought…",
  "original_created_utc": 1613952705,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "OMG你们，你们听说过吗，当比特币的价值大大降低的时候，人们有了\n用其中更多的钱来等价于他们所购买的物品/服务的价值。\n的时候!\n\n但是现在，由于比特币的价值高了很多，所以同样关于比特币的价值是\n值这么多钱！\n\n显然，如果他们没有买...",
      "title": "OMG你们都听说过10年前有人用[此处插入数字]比特币购买了[此处插入项目/服务]吗! 今天，这些比特币将价值[乘以上述数字乘以当前比特币价格]!!!!!!!。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "OMG你們，你們聽說過嗎，當比特幣的價值大大降低的時候，人們有了\n用其中更多的錢來等價於他們所購買的物品/服務的價值。\n的時候!\n\n但是現在，由於比特幣的價值高了很多，所以同樣關於比特幣的價值是\n值這麼多錢！\n\n顯然，如果他們沒有買...",
      "title": "OMG你們都聽說過10年前有人用[此處插入數字]比特幣購買了[此處插入項目/服務]嗎! 今天，這些比特幣將價值[乘以上述數字乘以當前比特幣價格]!!!!!!!。"
    }
  ],
  "title": "OMG did you all hear that 10 years ago somebody bought [insert item/service here] for [insert number here] bitcoins! Today those bitcoins would be worth [multiply aforementioned number times current bitcoin price]!!!!!!!",
  "created_utc": 1613982923,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>OMG you all, did you hear that when bitcoin was worth much less that people had to use more of them to equate the value of the item/service that they bought at the time!</p>\n\n<p>But now, since bitcoin is worth so much more, that same about of bitcoin is worth so much more!</p>\n\n<p>Clearly if they had not bought that item/service and just kept those bitcoin, they would have been so rich since clearly it would not have been an option at the time for them to just buy more bitcoin at the same price and keep those.</p>\n\n<p>Moral of the story: It now costs more than a pizza just to send BTC.</p>\n</div><!-- SC_ON -->",
  "score": 326,
  "permalink": "/r/CryptoCurrency/comments/lpae3a/omg_did_you_all_hear_that_10_years_ago_somebody/",
  "subreddit": "CryptoCurrency",
  "id": "lpae3a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332879173
}