{
  "author": "Rejoicing_Tunicates",
  "original_created_utc": 1646415981,
  "title": "Did Chinese eunuchs ever have love/sex lives?",
  "created_utc": 1646443266,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m very fascinated by eunuchs from Imperial China. I know there are lots of stories about them being corrupt or bad, but I&amp;#39;m also curious about the more human side of them. &lt;/p&gt;\n\n&lt;p&gt;If I was going to lose my penis and testicles, I know that how it would affect my love life would be one of the first things on my mind. The thing is I know sexuality is very malleable and I figure losing those parts wouldn&amp;#39;t mean you would completely lose your sense of desire and pleasure, especially knowing there are other erogenous zones on the body.&lt;/p&gt;\n\n&lt;p&gt;And of course that is just the sexual side of things, there is also the romantic and emotional aspect of love. &lt;/p&gt;\n\n&lt;p&gt;So did eunuchs take lovers? Did they ever write romantic poems or anything like that? Did they express any of those feelings, or was there an expectation that emasculation meant a total loss of those things? &lt;/p&gt;\n\n&lt;p&gt;Thanks a bunch, have a nice day everyone.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 129,
  "permalink": "/r/AskHistorians/comments/t6ojum/did_chinese_eunuchs_ever_have_lovesex_lives/",
  "subreddit": "AskHistorians",
  "id": "t6ojum",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I'm very fascinated by eunuchs from Imperial China. I know there are lots of\nstories about them being corrupt or bad, but I'm also curious about the more\nhuman side of them.\n\nIf I was going to lose my penis and testicles, I know that how it would affect\nmy love life would be one of the first things…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、中国帝国の宦官にとても魅力を感じています。多くの人が\n堕落しているとか、悪いとかいう話もありますが、それよりも、もっと本質的なところに興味があります。\n人間的な側面がある。\n\nもし、私がペニスと睾丸を失うとしたら、それがどのように影響するかは分かっています。\n恋愛は、まず最初にすることだと思います。",
      "title": "中国の宦官には恋愛・性生活があったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对帝国中国的太监非常着迷。我知道有很多\n我知道有很多关于他们腐败或坏的故事，但我也对更多的\n他们人性的一面。\n\n如果我将失去我的阴茎和睾丸，我知道这将如何影响\n我的爱情生活将是第一件事......",
      "title": "中国的太监有没有过爱情/性生活？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對帝國中國的太監非常着迷。我知道有很多\n我知道有很多關於他們腐敗或壞的故事，但我也對更多的\n他們人性的一面。\n\n如果我將失去我的陰莖和睾丸，我知道這將如何影響\n我的愛情生活將是第一件事......",
      "title": "中國的太監有沒有過愛情/性生活？"
    }
  ]
}