{
  "author": "understand_dont_imgn",
  "original_created_utc": 1630859585,
  "title": "I am teaching Introduction to Philosophy and I'm looking for 3 movies for philosophy movie nights. Any ideas?",
  "created_utc": 1630902657,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Any suggestions? Thanks so much for any help.</p>\n\n<p>I need one movie for ethics, one movie for epistemology, and one movie for philosophy of mind. </p>\n\n<p>These would be informal &quot;movie nights&quot; where the students would congregate to watch (without me, their instructor, present). The class is set up such that all the students live in the same dorm (you can think of it like a boarding school if you&#39;d like). These are first-year college students. </p>\n\n<p>For epistemology I&#39;ve selected The Matrix ... because we&#39;ll be talking about external world skepticism. Any ideas for ethics (especially the difference between consequentialism and Kantian ethics) and philosophy of mind (especially about dualism vs physicalism)? Cheers</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/askphilosophy/comments/pigaiz/i_am_teaching_introduction_to_philosophy_and_im/",
  "subreddit": "askphilosophy",
  "id": "pigaiz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Any suggestions? Thanks so much for any help.\n\nI need one movie for ethics, one movie for epistemology, and one movie for\nphilosophy of mind.\n\nThese would be informal \"movie nights\" where the students would congregate to\nwatch (without me, their instructor, present). The class is set up such that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "何か提案はありますか？何かお役に立てることがあれば、本当にありがとうございます。\n\n倫理学、認識論、心の哲学の3つの分野で、それぞれ1つのムービーが必要です。\n心の哲学」です。\n\nこれらは非公式の「映画会」で、学生たちが集まって見ることになります。\n視聴することになります（講師の私はいません）。クラスは以下のように設定されています...",
      "title": "私は哲学入門を教えているのですが、哲学映画会用に3本の映画を探しています。何かアイデアはありませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有什么建议吗？非常感谢任何帮助。\n\n我需要一部关于伦理学的电影，一部关于认识论的电影，以及一部关于心灵哲学的电影。\n心灵哲学的电影。\n\n这些将是非正式的 \"电影之夜\"，学生们将聚集在一起观看\n观看（没有我，他们的老师在场）。这个班级的设置是这样的：...",
      "title": "我在教哲学概论，我在为哲学电影之夜寻找3部电影。有什么想法吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有什麼建議嗎？非常感謝任何幫助。\n\n我需要一部關於倫理學的電影，一部關於認識論的電影，以及一部關於心靈哲學的電影。\n心靈哲學的電影。\n\n這些將是非正式的 \"電影之夜\"，學生們將聚集在一起觀看\n觀看（沒有我，他們的老師在場）。這個班級的設置是這樣的：...",
      "title": "我在教哲學概論，我在爲哲學電影之夜尋找3部電影。有什麼想法嗎？"
    }
  ]
}