{
  "author": "BradVet",
  "original_created_utc": 1642844553,
  "title": "You might have been too late for this cycle, but you’re now early for the next one",
  "created_utc": 1642908980,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For newcomers to the market, I know that times are  tough at the moment so I wanted to try and provide some light in what could become a dark tunnel for a while. Crypto caught my attention in late 2017, mainly due to constantly seeing bitcoin memes on reddit (You know that gif with the coin on the vertical rollercoaster) well that was posted non-stop as bitcoin hit higher highs everyday on the way to $20,000. By the time I finished doing some research and carefully selecting my buys, I happened to sell my car. I decided to invest 25% of it into crypto on Jan 8th 2018. Lol you heard that right, Jan 2018, the entire market crashed and my alts bleed 80% plus, they continued to bleed until I lost about 85% and I stayed red for nearly two years. Instead of selling and exiting, I decided that with the halving every four years I was this time in early for the 20/21. I held, dca’d and saw this sub turn to a ghost town (only recently got my own account to get some moons) but eventually the next cycle came. Time in the market always beats trying to time it, so get ready to say you were early for the 23/24 cycle ATHs.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/s9yzus/you_might_have_been_too_late_for_this_cycle_but/",
  "subreddit": "CryptoCurrency",
  "id": "s9yzus",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For newcomers to the market, I know that times are tough at the moment so I\nwanted to try and provide some light in what could become a dark tunnel for a\nwhile. Crypto caught my attention in late 2017, mainly due to constantly seeing\nbitcoin memes on reddit (You know that gif with the coin on the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "新しく市場に参入される方にとって、今は大変な時期だと思います。\n暗いトンネルに入りそうな時に、少しでも明かりを灯したいと思っています。\nということです。クリプトが私の目に留まったのは、2017年後半、主に常に目にするようになった\nビットコインのミームがredditにアップされている（コインを乗せたGIFがあるじゃないですか？",
      "title": "このサイクルには遅すぎたかもしれないが、次のサイクルには早くなった。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于刚进入市场的人来说，我知道目前形势很严峻，所以我\n我想试着在可能成为黑暗隧道的地方提供一些光明。\n的光明。加密货币在2017年底引起了我的注意，主要是由于不断看到\n在reddit上看到比特币的备忘录（你知道那个有硬币的gif图）。",
      "title": "你可能对这个周期来说太晚了，但你现在对下一个周期来说还很早。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於剛進入市場的人來說，我知道目前形勢很嚴峻，所以我\n我想試着在可能成爲黑暗隧道的地方提供一些光明。\n的光明。加密貨幣在2017年底引起了我的注意，主要是由於不斷看到\n在reddit上看到比特幣的備忘錄（你知道那個有硬幣的gif圖）。",
      "title": "你可能對這個週期來說太晚了，但你現在對下一個週期來說還很早。"
    }
  ]
}