{
  "author": "Learning2Crypto",
  "the_new_excerpt": "There are a lot of new members likely buying the dip, so I think this needs to\nbe said again. YOU DO NOT own any Crypto Currency that you buy on Robinhood.\n\nYou can not withdraw any cryptocurrency you buy on Robinhood, platforms like\nRobinhood defeat the whole purpose of cryptocurrency.\n\nRobinhood…",
  "original_created_utc": 1619150308,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "新しいメンバーがディップを購入する可能性が高いので、これはもう一度言う必要があると思います。\nもう一度言っておきます。あなたは、Robinhoodで購入したいかなる暗号通貨も所有しません。\n\nRobinhoodで購入したいかなる暗号通貨も引き出すことはできません。\nRobinhoodのようなプラットフォームは、暗号通貨の全ての目的を台無しにします。\n\nRobinhood...",
      "title": "リマインダーです。ロビンフッドで暗号通貨を購入しないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有很多新成员可能会买下这块地，所以我认为这一点需要\n我认为需要再次说明。您不拥有您在Robinhood上购买的任何加密货币。\n\n你不能提取你在Robinhood上购买的任何加密货币，像这样的平台\nRobinhood违背了加密货币的整个目的。\n\nRobinhood...",
      "title": "提醒您。切勿使用Robinhood购买加密货币!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有很多新成員可能會買下這塊地，所以我認爲這一點需要\n我認爲需要再次說明。您不擁有您在Robinhood上購買的任何加密貨幣。\n\n你不能提取你在Robinhood上購買的任何加密貨幣，像這樣的平臺\nRobinhood違背了加密貨幣的整個目的。\n\nRobinhood...",
      "title": "提醒您。切勿使用Robinhood購買加密貨幣!"
    }
  ],
  "title": "REMINDER: DO NOT use Robinhood to buy Crypto Currency!",
  "created_utc": 1619178073,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There are a lot of new members likely buying the dip, so I think this needs to be said again. YOU DO NOT own any Crypto Currency that you buy on Robinhood.</p>\n\n<p>You can not withdraw any cryptocurrency you buy on Robinhood, platforms like Robinhood defeat the whole purpose of cryptocurrency.</p>\n\n<p>Robinhood has shown in the past that it is willing to halt trading of securities and certain cryptocurrencies which has caused users to lose thousands of dollars.</p>\n\n<p>If you are new here I would recommend first reading up on cryptocurrency. Don&#39;t just jump in on fear of missing out. Make sure that you know what you are getting into first.</p>\n\n<p>You can purchase cryptocurrencies from several popular exchanges/platforms. Binance, Kraken and Coinbase are reputable ones you can turn to. You can then either choose to keep your coins on the exchange or the preferable option to create your own wallet and transfer your cryptos there. You should note that there will often be a transaction or &quot;gas fee&quot; when moving most crypto&#39;s off an exchange and into your wallet which depending on how much of a crypto you own might not make it worth it to move off an exchange.</p>\n\n<p>From there you should better set. There are ton of threads on this subreddit about crypto that will probably answer the majority of questions you have so always google them (reddit search isn&#39;t the best...) </p>\n\n<p>Enjoy!</p>\n</div><!-- SC_ON -->",
  "score": 313,
  "permalink": "/r/CryptoCurrency/comments/mwmsmq/reminder_do_not_use_robinhood_to_buy_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "mwmsmq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776207032
}