{
  "author": "chrisdh79",
  "the_new_excerpt": "Intel may see its market share fall to a new low next year, in large part thanks\nto Apple's decision to move away from using Intel processors in its Mac\ncomputers and instead use Apple silicon.\n\nAs a result of the four Macs with ‌M1‌ and upcoming releases, Intel this year\nwill lose 50% of its orders…",
  "original_created_utc": 1624016863,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "来年、インテルの市場シェアは過去最低を記録するかもしれない。\nその理由のひとつは、アップル社が同社のMacにインテル社製のプロセッサーを使用せず、代わりにアップル社製のシリコートを使用することを決定したことです。\nその理由の一つは、アップル社が同社のMacにインテル社製プロセッサを使用せず、アップル社製シリコンを使用することを決定したことにあります。\n\nM1を搭載した4台のMacと今後発売されるMacの結果、今年のインテルは\nは受注の50％を失うことになる...。",
      "title": "インテル・プロセッサーの市場シェアは、アップル・シリコンの影響で来年には最低になるかもしれない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "英特尔明年的市场份额可能会降至新低，这在很大程度上是由于\n苹果公司决定在其Mac电脑中不再使用英特尔处理器，而是使用苹果公司的芯片。\n电脑中不再使用英特尔处理器，而是使用苹果芯片。\n\n由于四台装有M1的Mac电脑和即将发布的产品，英特尔今年\n将失去50%的订单...",
      "title": "英特尔处理器市场份额明年可能降至新低，原因是苹果芯片"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "英特爾明年的市場份額可能會降至新低，這在很大程度上是由於\n蘋果公司決定在其Mac電腦中不再使用英特爾處理器，而是使用蘋果公司的芯片。\n電腦中不再使用英特爾處理器，而是使用蘋果芯片。\n\n由於四臺裝有M1的Mac電腦和即將發佈的產品，英特爾今年\n將失去50%的訂單...",
      "title": "英特爾處理器市場份額明年可能降至新低，原因是蘋果芯片"
    }
  ],
  "title": "Intel Processor Market Share May Fall to New Low Next Year Due to Apple Silicon",
  "created_utc": 1624028614,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Intel may see its market share fall to a new low next year, in large part thanks to Apple&#39;s decision to move away from using Intel processors in its Mac computers and instead use Apple silicon.</p>\n\n<p>As a result of the four Macs with ‌M1‌ and upcoming releases, Intel this year will lose 50% of its orders from Apple, and eventually, losing all orders from the Cupertino tech giant will lead to Intel&#39;s market share falling below 80% in 2023, according to DigiTimes.</p>\n\n<p>However, Apple&#39;s in-house developed Arm-based processor series is expected to play the key role in taking a major chunk from Intel&#39;s share in the upcoming year, the sources said.</p>\n\n<p>Intel is expected to lose nearly 50% of its orders from Apple in 2021 and will eventually obtain no orders from the client. Losing Apple&#39;s 10% market share and seeing AMD staying firmly with another 10%, Intel&#39;s share in the notebook market is likely to slip below 80% in 2023, the sources noted.</p>\n\n<p><a href=\"https://www.macrumors.com/2021/06/18/intel-market-share-falling-apple-silicon/\">https://www.macrumors.com/2021/06/18/intel-market-share-falling-apple-silicon/</a></p>\n</div><!-- SC_ON -->",
  "score": 42,
  "permalink": "/r/stocks/comments/o2n8xt/intel_processor_market_share_may_fall_to_new_low/",
  "subreddit": "stocks",
  "id": "o2n8xt",
  "is_self": true,
  "media": null,
  "is_video": false
}