{
  "author": "Wunic",
  "original_created_utc": 1631364373,
  "title": "Is not feeling emotions something that normally happens when you grow up? Like, when I was a kid, I could really FEEL emotions even when nothing unusual was happening and I experienced life much more \"vividly\", whereas nowadays I feel almost nothing even when something super dramatic happens.",
  "created_utc": 1631412559,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I remember that when I was a kid, everything I did and experienced, even ordinary things that I did on a daily basis, invoked some emotion in me. It&#39;s really hard to describe, but for example, when I went for a walk outside, the birds chirping, the wind blowing against my face, the smell of flowers blooming in the warm afternoon, the sunlight radiating against my skin, etc. all really made me feel something. Like, I experienced all these things really vividly and the overall atmosphere really made me feel emotions. It&#39;s impossible for me to describe, but it felt like life had some &quot;flavor&quot;. </p>\n\n<p>I&#39;m 19 years old now and nowadays my surroundings don&#39;t make me feel any emotions anymore. I don&#39;t experience the &quot;atmosphere&quot; of my surroundings anymore like when I was a kid. It&#39;s as if my life back when I was a kid was a magical, vivid, full color fantasy movie whereas nowadays it&#39;s all a bland, monotonous, black and white video. Everything I experience feels so much less vivid and nothing invokes any emotion in me anymore. Not only do I no longer feel the atmosphere and &quot;mood&quot; of my physical surroundings anymore, but events that happen in my life don&#39;t make me feel anything either. For example, two of our dogs that I&#39;ve been around since my childhood died recently and I didn&#39;t  even feel any sadness even though I loved both of them. When I go outside nowadays, I don&#39;t EXPERIENCE things like birdsong or the scent of flowers anymore the way I felt them when I was a kid. It&#39;s like all the zest and flavor has just disappeared from my life. </p>\n\n<p>I haven&#39;t been officially diagnosed with depression, but for the past three years I&#39;ve felt extremely sad almost every day. Sometimes I can pinpoint the thought/thing that&#39;s making me sad, but on some days I really hvae no idea why I feel sad. During my first year of high school it was so bad that I actually physically cried quite often, and I pretty much spent most of my time just lying in bed and doing nothing after I got home from school. As a kid I was happy and full of life, but these past three years have been so bad that I&#39;ve become a diehard antinatalist and I no longer plan to have children later in life because I don&#39;t want future generations to experience something this bad. I don&#39;t think I have depression because I can still perform my daily tasks normally and my grades are top notch, but even if it isn&#39;t depression, I&#39;m no longer sure whether what I&#39;m experiencing is normal because I feel like if it was normal, humanity would&#39;ve gone extinct by now. I&#39;m not going to k1ll m¥s3lf, but I feel like at this point the only reason I&#39;m living is that I&#39;m waiting for my life to be over and the faster it&#39;s over the better it is for me.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/pm6st3/is_not_feeling_emotions_something_that_normally/",
  "subreddit": "TooAfraidToAsk",
  "id": "pm6st3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I remember that when I was a kid, everything I did and experienced, even\nordinary things that I did on a daily basis, invoked some emotion in me. It's\nreally hard to describe, but for example, when I went for a walk outside, the\nbirds chirping, the wind blowing against my face, the smell of flowers…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が子供の頃は、日常の何気ないことでも、自分の行動や経験が何かしらの感情を呼び起こしていたのを覚えています。\n日常の何気ないことでも、何かしらの感情が湧き上がってきたものです。それは\nうまく言えませんが、例えば、外を散歩していると、鳥のさえずりや、顔に当たる風や\n小鳥のさえずり、顔に当たる風、花の香り...。",
      "title": "感情を感じなくなることは、大人になると普通に起こることなのでしょうか？例えば、私が子供の頃は、何も変わったことが起きていなくても感情を感じることができ、人生をより \"生き生きと \"体験していましたが、最近では、超劇的なことが起きてもほとんど何も感じません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我记得，当我还是个孩子的时候，我所做的一切和经历的一切，甚至是\n我每天做的普通事情，都会引起我的一些情绪。这很难描述。\n真的很难描述，但例如，当我去外面散步时，鸟儿的鸣叫，风吹拂着我的脸庞，以及在我面前晃来晃去。\n鸟儿的鸣叫，风吹拂着我的脸，花的香味......",
      "title": "没有感觉的情绪是在你长大后通常会发生的事情吗？就像，当我还是个孩子的时候，即使没有什么不寻常的事情发生，我也能真正感受到情绪，我更 \"生动 \"地体验生活，而现在，即使有超级戏剧性的事情发生，我也几乎没有感觉。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我記得，當我還是個孩子的時候，我所做的一切和經歷的一切，甚至是\n我每天做的普通事情，都會引起我的一些情緒。這很難描述。\n真的很難描述，但例如，當我去外面散步時，鳥兒的鳴叫，風吹拂着我的臉龐，以及在我面前晃來晃去。\n鳥兒的鳴叫，風吹拂着我的臉，花的香味......",
      "title": "沒有感覺的情緒是在你長大後通常會發生的事情嗎？就像，當我還是個孩子的時候，即使沒有什麼不尋常的事情發生，我也能真正感受到情緒，我更 \"生動 \"地體驗生活，而現在，即使有超級戲劇性的事情發生，我也幾乎沒有感覺。"
    }
  ]
}