{
  "author": "RVCFever",
  "the_new_excerpt": "I feel like with /u/deepfuckingvalue being positioned as the figurehead of the\n$GME movement and the 'if he is still in I'm still in' crowd that some people\nmay feel betrayed if he decided to sell his whole position and take profits.\n\nJust remember that when DFV was buying $GME at prices as low as…",
  "original_created_utc": 1612233416,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得随着/u/deepfuckingvalue被定位为数字头的。\n$GME运动和'如果他还在，我就还在'的人群中，有些人的\n如果他决定卖掉整个仓位并获利，他可能会觉得被出卖了。\n\n请记住，当DFV在低价买入GME时... ...",
      "title": "我希望作为一个社区，我们可以尊重/u/DeepFuckingValue的决定，如果/当他决定卖出$GME，而不是对一个从未说过他打算持有到时间结束的人翻脸。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得隨着/u/deepfuckingvalue被定位爲數字頭的。\n$GME運動和'如果他還在，我就還在'的人羣中，有些人的\n如果他決定賣掉整個倉位並獲利，他可能會覺得被出賣了。\n\n請記住，當DFV在低價買入GME時... ...",
      "title": "我希望作爲一個社區，我們可以尊重/u/DeepFuckingValue的決定，如果/當他決定賣出$GME，而不是對一個從未說過他打算持有到時間結束的人翻臉。"
    }
  ],
  "title": "I hope as a community we can respect /u/DeepFuckingValue's decision if/when he decides to sell $GME and not flip out on a guy who's never once said he's planning to hold till the end of time.",
  "created_utc": 1612283549,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I feel like with <a href=\"/u/deepfuckingvalue\">/u/deepfuckingvalue</a> being positioned as the figurehead of the $GME movement and the &#39;if he is still in I&#39;m still in&#39; crowd that some people may feel betrayed if he decided to sell his whole position and take profits.</p>\n\n<p>Just remember that when DFV was buying $GME at prices as low as $4 per share he wasn&#39;t signing up for the &#39;diamond hands never sell&#39; club and he never got into the play for reasons like smashing hedge funds, curing cancer etc. That stuff has all come about from us and people jumping on the bandwagon.</p>\n\n<p>WSB before this crazy week that has changed the sub forever was all about taking on risk to try and make money fast. DFV has achieved that on a scale we haven&#39;t seen before and if he decides to take profits we should support him doing so and not get upset that it may affect the price etc or say he betrayed a cause he never signed up for.</p>\n\n<p>If you&#39;ve watched the guys youtube you will know he&#39;s an extremely nice and likeable guy, would hate to see people calling him judas or whatever if he decides to sell.</p>\n</div><!-- SC_ON -->",
  "score": 47511,
  "permalink": "/r/wallstreetbets/comments/lald38/i_hope_as_a_community_we_can_respect/",
  "subreddit": "wallstreetbets",
  "id": "lald38",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518561500
}