{
  "author": "MajorityHippo",
  "the_new_excerpt": "Was my Birthday today, my mum got me a cake, but of course she did she's my\nmother. I have a job in retail with a bunch of other young adults around my age,\nwe are all chummy in work but its all fake really... Not one of them would've\nsaid Happy Birthday without me telling them it was my…",
  "original_created_utc": 1620600819,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日は私の誕生日だったので、母がケーキを用意してくれました。\n母です。私は同年代の若者たちと一緒に小売業の仕事をしています。\n職場ではみんな仲良くしていますが、本当は全部嘘なんです...。彼らの中には、私が言わないと\n私の誕生日だと言わずにハッピーバースデーと言う人は一人もいませんでした。",
      "title": "23歳になったばかり（M）友達0人の生活をしている人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天是我的生日，我妈妈给我买了一个蛋糕，当然，她是我的母亲。\n母亲。我在零售业有一份工作，和一群与我年龄相仿的年轻人在一起。\n我们在工作中都很友好，但其实都是假的...... 他们中没有一个人会\n如果我不告诉他们这是我的生日，他们没有一个人会说生日快乐......",
      "title": "刚满23岁（男），还有人过着没有朋友的生活吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天是我的生日，我媽媽給我買了一個蛋糕，當然，她是我的母親。\n母親。我在零售業有一份工作，和一羣與我年齡相仿的年輕人在一起。\n我們在工作中都很友好，但其實都是假的...... 他們中沒有一個人會\n如果我不告訴他們這是我的生日，他們沒有一個人會說生日快樂......",
      "title": "剛滿23歲（男），還有人過着沒有朋友的生活嗎？"
    }
  ],
  "title": "Just turned 23 (M) Does anyone else live a life with 0 friends?",
  "created_utc": 1620639091,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Was my Birthday today, my mum got me a cake, but of course she did she&#39;s my mother. I have a job in retail with a bunch of other young adults around my age, we are all chummy in work but its all fake really... Not one of them would&#39;ve said Happy Birthday without me telling them it was my birthday. </p>\n\n<p>I have no friends, in fact the only person outside of my family to get me anything was my manager who is twice my age, he got me a cake (that all the colleagues happily eat).</p>\n\n<p>I don&#39;t think I&#39;m bad at socialising, bad looking, smelly, rude or anything bad in particular... But I think everyone realises that they would rather hangout with more interesting individuals in their circles.</p>\n\n<p>Its actually really hard to gain friends or enter a friend group once you get into your twenties or more importantly gain a romantic partner because most relationships start within friend circles.</p>\n\n<p>I mean, I try to work on myself to exercise and gain better finances to better my life but what good is owning a lot of money and a big house someday if I have no one to truly share it with, only people that will befriend me to leach of me.</p>\n\n<p>All I know is, I feel really alone and also not alone because its all I know.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/n8prpk/just_turned_23_m_does_anyone_else_live_a_life/",
  "subreddit": "NoStupidQuestions",
  "id": "n8prpk",
  "is_self": true,
  "media": null,
  "is_video": false
}