{
  "author": "Burdiez",
  "original_created_utc": 1632282884,
  "title": "Why wasn't nixtamalization popular?",
  "created_utc": 1632328253,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve read that nixtamalization (soaking corn in a limestone solution; Aztecs and some American Natives did it for centuries) greatly improves the nutritional value of corn. Why haven&#39;t people adopted the method in other countries? I&#39;ve read of numerous malnutritions and famines in Europe could&#39;ve been easily avoided by nixtamalization (Since it seems corn was available but didn&#39;t provide all the necessary nutrients to survive in it&#39;s raw form, causing diseases). Why wasn&#39;t it popular despite the great nutritional benefits it offered?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/pszdae/why_wasnt_nixtamalization_popular/",
  "subreddit": "AskHistorians",
  "id": "pszdae",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've read that nixtamalization (soaking corn in a limestone solution; Aztecs and\nsome American Natives did it for centuries) greatly improves the nutritional\nvalue of corn. Why haven't people adopted the method in other countries? I've\nread of numerous malnutritions and famines in Europe could've…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ニクタマリゼーション（トウモロコシを石灰岩の溶液に浸すこと）は、アステカや一部のアメリカ原住民が何世紀にもわたって行ってきたことだと読みました。\nアステカやアメリカの原住民が何世紀も前から行っていた）は、トウモロコシの栄養価を大幅に\nトウモロコシの栄養価を大幅に向上させることができます。なぜ他の国ではこの方法が採用されないのでしょうか？私は\nヨーロッパでは数多くの栄養失調や飢饉が発生していますが、これは...",
      "title": "なぜニクソン化が流行らなかったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我读到过Nixtamalization（将玉米浸泡在石灰石溶液中；阿兹特克人和一些美国土著人在几个世纪前就这样做了。\n阿兹特克人和一些美国土著人已经这样做了几个世纪）大大改善了玉米的营养价值。\n玉米的营养价值。为什么其他国家的人没有采用这种方法？我已经\n我读到过欧洲的许多营养不良和饥荒，这可能是...",
      "title": "为什么不流行nixtamalization？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我讀到過Nixtamalization（將玉米浸泡在石灰石溶液中；阿茲特克人和一些美國土著人在幾個世紀前就這樣做了。\n阿茲特克人和一些美國土著人已經這樣做了幾個世紀）大大改善了玉米的營養價值。\n玉米的營養價值。爲什麼其他國家的人沒有采用這種方法？我已經\n我讀到過歐洲的許多營養不良和饑荒，這可能是...",
      "title": "爲什麼不流行nixtamalization？"
    }
  ]
}