{
  "author": "shipOfMe",
  "original_created_utc": 1657147691,
  "title": "What are some mistakes you've seen from academics of other disciplines (physics, math, neuroscience, psychology, etc.) who have tried to branch into philosophy or use philosophical arguments in their work? Are these mistakes different than those made by other people just getting into philosophy?",
  "created_utc": 1657229785,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am a systems neuroscientist who studies learning and memory. I have been thinking about topics related to representation and causation, and have begun, in response, delving into philosophical literature. One thing I&amp;#39;ve realized is how often philosophical language is used in scientific text despite the authors not having much of a philosophical background. Sometimes, this is taken to the worst case scenario where a scientist will themselves write philosophy without a solid understanding of the field they believe they&amp;#39;re contributing to. It seems like this is a problem unique from just learning philosophy for the first time, as these scientists have usually already published many times, and are used to having their voices heard. I&amp;#39;m not saying people can&amp;#39;t cross disciplines, and I think specialists in a field can sometimes offer unique insights into philosophical problems. However, I would like to avoid as many mistakes as I can if possible. I can&amp;#39;t avoid using language steeped in philosophical meaning, and I have a job I need to do, so it&amp;#39;s not the case that I can just wait until I know enough to continue my research or publications. But if I can avoid major mistakes as I continue to learn that would be ideal. My field is particularly tricky as I sit in the cross-roads of people doing work on consciousness, the sense of self, the sense of others, representation, memory, etc. It feels like a philosophical juggernaut being run by engineers.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/vt2xvr/what_are_some_mistakes_youve_seen_from_academics/",
  "subreddit": "askphilosophy",
  "id": "vt2xvr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am a systems neuroscientist who studies learning and memory. I have been\nthinking about topics related to representation and causation, and have begun,\nin response, delving into philosophical literature. One thing I've realized is\nhow often philosophical language is used in scientific text…"
}