{
  "author": "shipOfMe",
  "original_created_utc": 1657147691,
  "title": "What are some mistakes you've seen from academics of other disciplines (physics, math, neuroscience, psychology, etc.) who have tried to branch into philosophy or use philosophical arguments in their work? Are these mistakes different than those made by other people just getting into philosophy?",
  "created_utc": 1657229785,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am a systems neuroscientist who studies learning and memory. I have been thinking about topics related to representation and causation, and have begun, in response, delving into philosophical literature. One thing I&amp;#39;ve realized is how often philosophical language is used in scientific text despite the authors not having much of a philosophical background. Sometimes, this is taken to the worst case scenario where a scientist will themselves write philosophy without a solid understanding of the field they believe they&amp;#39;re contributing to. It seems like this is a problem unique from just learning philosophy for the first time, as these scientists have usually already published many times, and are used to having their voices heard. I&amp;#39;m not saying people can&amp;#39;t cross disciplines, and I think specialists in a field can sometimes offer unique insights into philosophical problems. However, I would like to avoid as many mistakes as I can if possible. I can&amp;#39;t avoid using language steeped in philosophical meaning, and I have a job I need to do, so it&amp;#39;s not the case that I can just wait until I know enough to continue my research or publications. But if I can avoid major mistakes as I continue to learn that would be ideal. My field is particularly tricky as I sit in the cross-roads of people doing work on consciousness, the sense of self, the sense of others, representation, memory, etc. It feels like a philosophical juggernaut being run by engineers.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/vt2xvr/what_are_some_mistakes_youve_seen_from_academics/",
  "subreddit": "askphilosophy",
  "id": "vt2xvr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am a systems neuroscientist who studies learning and memory. I have been\nthinking about topics related to representation and causation, and have begun,\nin response, delving into philosophical literature. One thing I've realized is\nhow often philosophical language is used in scientific text…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、学習と記憶を研究するシステム神経科学者です。私はこれまで\n表現と因果関係のトピックについて考えており、それを受けて哲学的な文献を調べ始めた。\nを考え、哲学的な文献を調べ始めています。私が気づいたことの1つは\n科学的な文章の中で、いかに頻繁に哲学的な言葉が使われているか...ということです。",
      "title": "他の分野（物理学、数学、神経科学、心理学など）の研究者が、哲学の分野に進出しようとしたり、自分の仕事に哲学的な議論を使おうとしたりした場合、どのような失敗がありましたか？これらの間違いは、哲学の世界に入ったばかりの人が犯す間違いと違うのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一名系统神经科学家，研究学习和记忆。我一直在\n思考与表征和因果关系有关的话题，并已开始。\n作为回应，开始深入研究哲学文献。我意识到的一件事是\n哲学语言在科学文本中的使用是多么频繁......",
      "title": "你从其他学科（物理学、数学、神经科学、心理学等）的学者那里看到了哪些错误，他们试图将自己的工作分支到哲学或使用哲学的论点？这些错误与其他刚刚进入哲学领域的人所犯的错误有区别吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一名系統神經科學家，研究學習和記憶。我一直在\n思考與表徵和因果關係有關的話題，並已開始。\n作爲回應，開始深入研究哲學文獻。我意識到的一件事是\n哲學語言在科學文本中的使用是多麼頻繁......",
      "title": "你從其他學科（物理學、數學、神經科學、心理學等）的學者那裏看到了哪些錯誤，他們試圖將自己的工作分支到哲學或使用哲學的論點？這些錯誤與其他剛剛進入哲學領域的人所犯的錯誤有區別嗎？"
    }
  ]
}