{
  "author": "palefyres",
  "original_created_utc": 1636544429,
  "title": "Can someone explain why most philosophers believe free will exists? Logically, isn't there no way?",
  "created_utc": 1636621156,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is in regards to the philpapers survey saying that the majority of philosophers believe in free will.</p>\n\n<p>Off Merriam-Webster:</p>\n\n<p><strong>free will</strong></p>\n\n<p><strong>1:</strong> voluntary choice or decisionI do this of my own <em>free will</em></p>\n\n<p><strong>2:</strong> freedom of humans to make choices that are not determined by prior causes or by divine intervention</p>\n\n<p>Isn&#39;t everything we do determined by our genetics and environment? Many serial killers are born with genetic psychopathy and are raised in abusive/cold environments growing up, just by going through the biographies of the most famous ones (Ted Bundy, The Night Stalker, Ed Helms, etc.).</p>\n\n<p>So how can free will exist? Any decision we make is influenced by factors out of our control. Can someone knowledgeable help me understand why most philosophers believe in it? This is an appeal to authority but: a psychology lecturer from Stanford came to our college and explained this in detail, with him saying with conviction that it is impossible for free will to exist and that it&#39;s an illusion. He said that everything in our life is determined by our parents, as they give us their genetics and dictate our environment.</p>\n\n<p>Thank you.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/qqsioe/can_someone_explain_why_most_philosophers_believe/",
  "subreddit": "askphilosophy",
  "id": "qqsioe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is in regards to the philpapers survey saying that the majority of\nphilosophers believe in free will.\n\nOff Merriam-Webster:\n\nfree will\n\n1: voluntary choice or decisionI do this of my own free will\n\n2: freedom of humans to make choices that are not determined by prior causes or\nby divine…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、フィルペーパーの調査で、大多数の哲学者が\n哲学者の大半が自由意志を信じているというphilpapersの調査についてです。\n\nオフのメリアム-ウェブスター。\n\n自由意志\n\n1: 自発的な選択または決定私は自分の自由意志でこれを行う\n\n2: 人間が事前の原因や神によって決定されない選択をする自由。\n人間が選択する自由。",
      "title": "ほとんどの哲学者がなぜ自由意志が存在すると考えているのか、誰か説明してください。論理的には仕方がないのでは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是关于philpapers的调查说，大多数的\n哲学家相信有自由意志。\n\n关闭梅里亚姆-韦伯斯特。\n\n自由意志\n\n1：自愿的选择或决定我这样做是出于我自己的自由意志。\n\n2：人类做出选择的自由，而不是由事先的原因或神明决定的。\n由神决定的。",
      "title": "谁能解释一下为什么大多数哲学家认为自由意志存在？在逻辑上，不是没有办法吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是關於philpapers的調查說，大多數的\n哲學家相信有自由意志。\n\n關閉梅里亞姆-韋伯斯特。\n\n自由意志\n\n1：自願的選擇或決定我這樣做是出於我自己的自由意志。\n\n2：人類做出選擇的自由，而不是由事先的原因或神明決定的。\n由神決定的。",
      "title": "誰能解釋一下爲什麼大多數哲學家認爲自由意志存在？在邏輯上，不是沒有辦法嗎？"
    }
  ]
}