{
  "author": "LouisXIV-LeGrand",
  "the_new_excerpt": "Greetings all, c'est moi, your longest known monarch in all of history. It is\nme, King Louis XIV of France. But you may call me le Grand, or if you prefer, le\nRoi Soleil, the Sun King. I have seen these movies about me, and they portray me\noh so poorly. One focuses around my death, others trying to…",
  "original_created_utc": 1617316118,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，是我，你们历史上最悠久的君主。它是\n我，法国国王路易十四 但你可以叫我大帝，或者如果你愿意，叫我... ...\n太阳王Roi Soleil，太阳王。我看过这些关于我的电影，他们把我描述成了\n哦，如此糟糕。一个围绕着我的死亡，其他试图... ...",
      "title": "我的光荣一生，路易十四！"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，是我，你們歷史上最悠久的君主。它是\n我，法國國王路易十四 但你可以叫我大帝，或者如果你願意，叫我... ...\n太陽王Roi Soleil，太陽王。我看過這些關於我的電影，他們把我描述成了\n哦，如此糟糕。一個圍繞着我的死亡，其他試圖... ...",
      "title": "我的光榮一生，路易十四！"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "皆さん、こんにちは！歴史上最も長い歴史を持つ君主である私です。それは\n私、フランス王ルイ14世です。しかし、皆さんは私のことを le Grand と呼ぶこともできますし、もしお望みであれば le Roi Soleil（太陽の王）と呼ぶこともできます。\nロワ・ソレイユ、太陽王と呼んでもいい。私についての映画を見たことがありますが、彼らは私をとても悪く描いています。\nあまりにもお粗末に描かれています。あるものは私の死に焦点を当て、他のものは私を...",
      "title": "[映画のピッチ] 私、ルイ14世の輝かしい人生!"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは！歴史上最も長い歴史を持つ君主である私です。それは\n私、フランス王ルイ14世です。しかし、皆さんは私のことを le Grand と呼ぶこともできますし、もしお望みであれば le Roi Soleil（太陽の王）と呼ぶこともできます。\nロワ・ソレイユ、太陽王と呼んでもいい。私についての映画を見たことがありますが、彼らは私をとても悪く描いています。\nあまりにもお粗末に描かれています。あるものは私の死に焦点を当て、他のものは私を...",
      "title": "[映画のピッチ] 私、ルイ14世の輝かしい人生!"
    }
  ],
  "title": "[FILM PITCH] THE GLORIOUS LIFE OF ME, LOUIS XIV!",
  "created_utc": 1617353278,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Greetings all, c&#39;est moi, your longest known monarch in all of history. It is me, King Louis XIV of France. But you may call me le Grand, or if you prefer, le Roi Soleil, the Sun King. I have seen these movies about me, and they portray me oh so poorly. One focuses around my death, others trying to create lies out of my court. How about a grand movie about me from my own perspective?</p>\n\n<p>I began as a small child, suddenly ruling France at the age four. It was rough, my childhood. Growing up was brutal. I felt neglected, scared, yet I was the King. How dare the people treat me like that? Then at age nine, it got worse. A long civil war. I will never forgive Paris. </p>\n\n<p>Once I was of age, I was a magnificent soldier on the battlefield. But I also fell in love, with the beautiful niece of Mazarin. It was a forbidden love, my dearest Marie. But as king, I could not pursue it, so I married Marie-Thérèse of Austria. This marriage secured the peace we needed with Spain. </p>\n\n<p>After Mazarin died, I truly began my reign. I swore that I would bear responsibility for the entire realm. This was my divine right, as King Louis XIV of France. Everything belonged to me. </p>\n\n<p>I made France beautiful. I supported the arts. I made France the most glorious place in Europe. No small detail escaped me. Look at the Palace of Versailles. It is proof of all my hard work at glory. I also have many children, and my heir, Louis, though he died before me, his son, Louis XV, long may he reign. I pray that my dynasty lives on. </p>\n\n<p>I also did start a few wars here and there, expanded French lands, but no need to focus on that. It seems I got carried away here. My film, my glorious film will be managed by me. It must show the struggle of a small boy, given the throne at the age of four, the pain he felt, to the glorious battlefield, to my forbidden love, to my dearest Palace of Versaille. I want my film to focus on me and my glory. </p>\n\n<p>After all, you have probably seen a portrait of me. I must be in charge of everything for my film. It is absolutely mine. Now that this &quot;film pitch&quot; is done, how is my dearest descendant King Louis XXV doing? </p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/mi6pbm/film_pitch_the_glorious_life_of_me_louis_xiv/",
  "subreddit": "AskHistorians",
  "id": "mi6pbm",
  "is_self": true,
  "media": null,
  "is_video": false
}