{
  "author": "Bulliiish",
  "the_new_excerpt": "I observed a good number of people choose crypto over stocks or ETFs because\nthey want to get rich quicker.\n\nCrypto is not a place where you can rely on getting rich overnight. The stories\nabout people becoming millionaires in days: realize that for every one who does,\nthousands else have failed.…",
  "original_created_utc": 1619921684,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "株やETFではなく暗号を選ぶ人が多いのは、早く金持ちになりたいからだと思います。\nより早く金持ちになりたいからです。\n\n暗号は、一夜にして金持ちになることを期待できる場所ではありません。数日で億万長者になった人の話\n数日で億万長者になった人の話は、そうなった人の数だけ、他の何千人もが失敗していることを理解してください。\n他の何千人もが失敗している....",
      "title": "極めて短い時間で金持ちになりたいという考え方は危険です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我观察到很多人选择加密货币而不是股票或ETF，因为他们想快速致富。\n他们想更快地致富。\n\n加密货币不是一个你可以依靠一夜致富的地方。这些故事\n人们在几天内成为百万富翁的故事：要知道，每一个人都是如此。\n其他数以千计的人都失败了....",
      "title": "想在极短的时间内致富的心态是危险的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我觀察到很多人選擇加密貨幣而不是股票或ETF，因爲他們想快速致富。\n他們想更快地致富。\n\n加密貨幣不是一個你可以依靠一夜致富的地方。這些故事\n人們在幾天內成爲百萬富翁的故事：要知道，每一個人都是如此。\n其他數以千計的人都失敗了....",
      "title": "想在極短的時間內致富的心態是危險的。"
    }
  ],
  "title": "Having the mindset of wanting to getting rich in an extremely small amount of time is dangerous.",
  "created_utc": 1619945112,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I observed a good number of people choose crypto over stocks or ETFs because they want to get rich quicker.</p>\n\n<p>Crypto is not a place where you can rely on getting rich overnight. The stories about people becoming millionaires in days: realize that for every one who does, thousands else have failed. People thinking that being a millionaire can happen to them easily, comes to the point where people are chasing pumps in bad investments like Doge or Safemoon with lots of cash and getting burned. It&#39;s just greed.</p>\n\n<p>Crypto is often a long haul, something to hold and be patient for, and those in the short term shouldn&#39;t have too high expectations of where their investment will lead, if they hold onto good projects.</p>\n\n<p>Don&#39;t chase for the moon, let the moon come to you.</p>\n</div><!-- SC_ON -->",
  "score": 367,
  "permalink": "/r/CryptoCurrency/comments/n2wysp/having_the_mindset_of_wanting_to_getting_rich_in/",
  "subreddit": "CryptoCurrency",
  "id": "n2wysp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380962690
}