{
  "author": "Zarkorix",
  "original_created_utc": 1628872528,
  "title": "I traded my way from 0.33 ETH to 1.92 ETH. Here's what I learnt.",
  "created_utc": 1628897838,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I originally bought 0.33 ETH in Mar 21&#39; for a total of ~$430 . Since then and <strong>without using any additional fiat</strong>, I traded my way to 1.92 ETH - currently worth $6190. I no longer own this ETH, so I&#39;m happy to disclose the exact amounts. I did the same with other cryptos but I&#39;m using ETH here as an example.</p>\n\n<p>I did this using technical analysis, fundamental analysis and gauging overall market sentiment. In other words: selling highs, buying lows. I will not share the details of any strategies here. </p>\n\n<p>But, here&#39;s what I learnt about the overall experience:</p>\n\n<ul>\n<li>Crypto is more predictable than it appears but only on a macro level. You cannot account for FUD, unforeseen news or black/white swan events - all of which can and will risk your entire portfolio.</li>\n<li>Trading is incredibly stressful. My mental health suffered and every aspect of my life took a hit. I grew obsessive. </li>\n<li>The FOMO is incredibly strong but patience is key if you&#39;re to make it out alive and in-profit. It was a constant battle between the two. There will always be another opportunity but it&#39;s hard to see that when there are large red/green candles in your face.</li>\n<li>It&#39;s time-consuming and a full-time job. I&#39;d keep an eye on charts 10h+ a day. </li>\n<li>It&#39;s addictive. You&#39;re always chasing that next trade.</li>\n</ul>\n\n<p>Do I regret it? <strong>No.</strong> Because (i) it worked for me (ii) I learnt a lot.</p>\n\n<p>Will I continue to do it? <strong>No</strong>. It&#39;s just not worth it. Health &gt; wealth. I&#39;ll be returning to DCA.</p>\n</div><!-- SC_ON -->",
  "score": 220,
  "permalink": "/r/CryptoCurrency/comments/p3or3z/i_traded_my_way_from_033_eth_to_192_eth_heres/",
  "subreddit": "CryptoCurrency",
  "id": "p3or3z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I originally bought 0.33 ETH in Mar 21' for a total of ~$430 . Since then and\nwithout using any additional fiat, I traded my way to 1.92 ETH - currently worth\n$6190. I no longer own this ETH, so I'm happy to disclose the exact amounts. I\ndid the same with other cryptos but I'm using ETH here as an…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は当初、3月21日に0.33ETHを合計430ドルで購入しました。それ以来\nそれ以来、追加のフィアットを使用せずに、1.92ETHまで取引して、現在の価値は\n$6190. 私はもうこのETHを所有していないので、正確な金額を開示しても構いません。I\n他の暗号でも同じことをしましたが、ここではETHを例に挙げています。",
      "title": "私は0.33ETHから1.92ETHまでトレードしました。私が学んだことは以下の通りです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最初在3月21日买了0.33ETH，总价约为430美元。从那时起\n在没有使用任何额外的法币的情况下，我交易到了1.92ETH - 目前价值\n$6190. 我不再拥有这个ETH，所以我很乐意透露具体的金额。I\n对其他加密货币也是如此，但我在这里用ETH作为一个例子。",
      "title": "我的交易方式是从0.33ETH到1.92ETH。以下是我学到的东西。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最初在3月21日買了0.33ETH，總價約爲430美元。從那時起\n在沒有使用任何額外的法幣的情況下，我交易到了1.92ETH - 目前價值\n$6190. 我不再擁有這個ETH，所以我很樂意透露具體的金額。I\n對其他加密貨幣也是如此，但我在這裏用ETH作爲一個例子。",
      "title": "我的交易方式是從0.33ETH到1.92ETH。以下是我學到的東西。"
    }
  ]
}