{
  "author": "Kevin3683",
  "original_created_utc": 1627503156,
  "title": "There are over 3 million of us in this sub alone. If we want cryptocurrency and the technology behind it to be successful, we need to lead the way.",
  "created_utc": 1627551727,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>WHO?</h1>\n\n<h2>You. Yes, you, me, and everyone else that knows there needs to be change.</h2>\n\n<p>The people that lost everything in 2008, the people that work their asses off but get pay raises lower than the inflation rate, the people that have to pay fees when their savings account doesn’t have a balance that suits their bank, the people that earn 0.05% interest at a bank that loans out 10 times more money that’s kept in its reserves and charges interest on all of it. There’s a better way but they’re not going to cut themselves out. </p>\n\n<h1>HOW?</h1>\n\n<h2>By doing whatever you can alongside investing.</h2>\n\n<p>Ask stores and businesses if they accept crypto.  Do you own a business? Explore how you could accept crypto as a form of payment. Are you a marketer? Reach out to existing projects, they may need your help. Are you a game developer or would you like to be? Think about how blockchain technology could improve in game currency, micro transactions, even statistics.  </p>\n\n<p>Think about ways that you can take part in the adoption of not just decentralized, secure money and banking, but of the underlying technology. Whether it’s implementation, creation, education or simply taking part in awareness, we can all do a part. </p>\n\n<h3>We can’t just wait and hope for adoption and hope it’s what we want it to be.</h3>\n\n<h1>WHY</h1>\n\n<h2>The original idea had us in mind, not the people and institutions that already control the monetary system, banking, and all our forms of transactions and record keeping. We stand the to gain the most.</h2>\n\n<p>This is not a crazy, tin foil hat idea. This is not an illogical or unachievable goal.  While we’re buying, selling, HODLing and shit posting they are creating CBDCs and large tech and retail companies, the largest companies on the planet that effectively control our economy, are having to calm us down about rumors of their entry in cryptocurrency. Who should lead the way on this? Banks and billionaires? The people that <em>already</em> control our money? </p>\n\n<h3>The groundwork has been laid. There’s a chance that we can control our own money. There’s a chance that we can govern how our monetary system works, that we can lend securely to each other without unjustified bias. We deserve fair rates and no middle man making billions in fees, while paying us a joke of an interest rate, while charging 18% for credit and creating money out of thin air for those sweet, sweet 30 year American dream mortgages.</h3>\n\n<p>Should we be ok with banks and government(they’re almost as one at this point) leading the way? Or should we lead the way? The small business owners, the laborers, the regular people that get shat on, the banked and unbanked unlike. The people that Satoshi had in mind when he envisioned and executed a code that paved the way for decentralized, trustless, immutable transactions and tracking of all types. </p>\n\n<p>I believe we have more power than we realize. I believe those that stand to lose do realize it though. It’s our money, goods and services after all. </p>\n\n<p>Industry has formed around making money off of other people’s money and modesty, ethics, and fairness don’t profit quite enough. I’m tired of having to trust someone else for everything. Think of how much trust you have to put in people, institutions and businesses on a daily basis. Money, food, medicine, ownership, the list is long. </p>\n\n<h3>They need us to need them, they want money, monetary policy, and banking to be complicated and they need us to leave transactions, tracking, and record keeping left to the professionals. I don’t blame them, you get accustomed to a certain way of life and you fear change but change is constant and it’s time for some things in our society to change.</h3>\n\n<p>Edit: spelling</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/othy8u/there_are_over_3_million_of_us_in_this_sub_alone/",
  "subreddit": "CryptoCurrency",
  "id": "othy8u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "WHO?\n\n\nYOU. YES, YOU, ME, AND EVERYONE ELSE THAT KNOWS THERE NEEDS TO BE CHANGE.\n\nThe people that lost everything in 2008, the people that work their asses off\nbut get pay raises lower than the inflation rate, the people that have to pay\nfees when their savings account doesn’t have a balance that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "WHO？\n\n\nあなたです。そう、あなた、私、そして変化が必要だと知っているすべての人です。\n\n2008年にすべてを失った人たち、一生懸命働いているのにインフレ率より低い昇給しかない人たち\n一生懸命働いてもインフレ率より低い昇給しかない人たち、貯金をしても手数料を払わなければならない人たち\n貯金口座の残高が足りずに手数料を払わなければならない人たち...。",
      "title": "このサブだけでも300万人以上の人がいます。暗号通貨とその背後にある技術を成功させたいのであれば、私たちが先頭に立つ必要があります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "谁？\n\n\n你。是的，你，我，还有其他知道需要改变的人。\n\n那些在2008年失去一切的人，那些拼命工作的人\n但加薪幅度低于通货膨胀率的人，当他们的储蓄账户没有钱时不得不支付费用的人。\n当他们的储蓄账户没有余额时不得不支付费用的人......。",
      "title": "仅仅在这个子里就有300多万人。如果我们希望加密货币和它背后的技术能够成功，我们需要引领潮流。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "誰？\n\n\n你。是的，你，我，還有其他知道需要改變的人。\n\n那些在2008年失去一切的人，那些拼命工作的人\n但加薪幅度低於通貨膨脹率的人，當他們的儲蓄賬戶沒有錢時不得不支付費用的人。\n當他們的儲蓄賬戶沒有餘額時不得不支付費用的人......。",
      "title": "僅僅在這個子裏就有300多萬人。如果我們希望加密貨幣和它背後的技術能夠成功，我們需要引領潮流。"
    }
  ]
}