{
  "author": "IAmTheGlazed",
  "original_created_utc": 1641333588,
  "title": "Is adult life really as miserable as people make it out to be?",
  "created_utc": 1641340284,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Everyone on Reddit once they have reached 18 makes it seem that living the adult life is awful. That we are all dirt poor, living paycheck to paycheck, working every day of your life, never having time for hobbies, being more aware of the shit world around us. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s the pattern I see around me online and even in the people, I interact with around me. I&amp;#39;m 19 so I have been thinking about this for a while. I enjoy life, im having a fun time at university but what about after?&lt;/p&gt;\n\n&lt;p&gt;Is life really this bad?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/rw5yh0/is_adult_life_really_as_miserable_as_people_make/",
  "subreddit": "TooAfraidToAsk",
  "id": "rw5yh0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Everyone on Reddit once they have reached 18 makes it seem that living the adult\nlife is awful. That we are all dirt poor, living paycheck to paycheck, working\nevery day of your life, never having time for hobbies, being more aware of the\nshit world around us.\n\nThat's the pattern I see around me…",
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Reddit上的每个人一旦达到18岁，就会让人觉得过着成人的生活\n生活是可怕的。我们都是土生土长的穷人，靠工资过日子，工作\n你生活的每一天，从来没有时间做爱好，对我们周围的狗屎世界有更多的了解。\n我们周围的狗屎世界。\n\n这是我在周围看到的模式...",
      "title": "成人生活真的像人们所说的那样悲惨吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Reddit上的每個人一旦達到18歲，就會讓人覺得過着成人的生活\n生活是可怕的。我們都是土生土長的窮人，靠工資過日子，工作\n你生活的每一天，從來沒有時間做愛好，對我們周圍的狗屎世界有更多的瞭解。\n我們周圍的狗屎世界。\n\n這是我在周圍看到的模式...",
      "title": "成人生活真的像人們所說的那樣悲慘嗎？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "18歳になったRedditでは、誰もが大人として生きているように見えます。\n人生はひどいものです。私たちは皆貧乏で給料日前の生活を送り\n趣味の時間もなく、毎日を過ごしていると、だんだん意識してくる。\n私たちを取り巻くクソな世界。\n\n私の周りではそういうパターンが多いです...。",
      "title": "大人の生活は、人が言うほど惨めなものなのだろうか。"
    }
  ]
}