{
  "author": "UniqueCold3812",
  "original_created_utc": 1654074977,
  "title": "If someone is homophobic, racist, sexist etc and keeps those traits to themselves , why should I care??",
  "created_utc": 1654108166,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Like if you go on any social media you will find a lot of people trying to protray each other like that. My question is why should I care that some random stranger in their mom&amp;#39;s basement is homophobic or racist. If you keep it to yourself then my opinion on your thoughts about some community doesn&amp;#39;t matter.&lt;/p&gt;\n\n&lt;p&gt;I am getting tired of all this virtue signalling.&lt;/p&gt;\n\n&lt;p&gt;Edit:- I have seen many comments and i have changed my stance on the issue. Not doing anything is really bad for the society.&lt;/p&gt;\n\n&lt;p&gt;Here is a very profound poem regarding the issue.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;First they came for the Communists\nAnd I did not speak out\nBecause I was not a Communist&lt;/p&gt;\n\n&lt;p&gt;Then they came for the Socialists\nAnd I did not speak out\nBecause I was not a Socialist&lt;/p&gt;\n\n&lt;p&gt;Then they came for the trade unionists\nAnd I did not speak out\nBecause I was not a trade unionist&lt;/p&gt;\n\n&lt;p&gt;Then they came for the Jews\nAnd I did not speak out\nBecause I was not a Jew&lt;/p&gt;\n\n&lt;p&gt;Then they came for me\nAnd there was no one left\nTo speak out for me&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Written by Martin Niemöller&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/v2cs44/if_someone_is_homophobic_racist_sexist_etc_and/",
  "subreddit": "TooAfraidToAsk",
  "id": "v2cs44",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Like if you go on any social media you will find a lot of people trying to\nprotray each other like that. My question is why should I care that some random\nstranger in their mom's basement is homophobic or racist. If you keep it to\nyourself then my opinion on your thoughts about some community…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ソーシャルメディアにアクセスすると、多くの人々がそのようにお互いを描写しようとしているのがわかります。\n多くの人々が、お互いをそのように描写しようとしています。私の疑問は、なぜ私が、母親の地下室で見知らぬ人がホモフォビアや暴言を吐いたとしても\nホモフォビア（同性愛嫌悪）やレイシスト（人種差別）であることを気にする必要があるのか、ということです。もし、あなたがそれを自分の中だけに留めておくのであれば\nもしあなたがそれを自分の胸にしまっておくなら、私の意見は、あるコミュニティに対するあなたの考えについて...",
      "title": "もし誰かが同性愛者、人種差別主義者、性差別主義者などで、その特徴を自分自身の中に留めているならば、なぜ私が気にしなければならないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你去任何社交媒体上，你会发现很多人都试图\n我的问题是，我为什么要关心这个问题呢？我的问题是，我为什么要关心一些随机的\n我的问题是，我为什么要关心一些在他们妈妈的地下室里的陌生人是同性恋者或种族主义者。如果你把它保留在\n那么我对你对一些社区的想法的看法...",
      "title": "如果有人是同性恋者、种族主义者、性别歧视者等，并将这些特征留给自己，我为什么要关心呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你去任何社交媒體上，你會發現很多人都試圖\n我的問題是，我爲什麼要關心這個問題呢？我的問題是，我爲什麼要關心一些隨機的\n我的問題是，我爲什麼要關心一些在他們媽媽的地下室裏的陌生人是同性戀者或種族主義者。如果你把它保留在\n那麼我對你對一些社區的想法的看法...",
      "title": "如果有人是同性戀者、種族主義者、性別歧視者等，並將這些特徵留給自己，我爲什麼要關心呢？"
    }
  ]
}