{
  "author": "Realistic_Option1",
  "original_created_utc": 1660917512,
  "title": "Why do people who don’t support gun control not see mass/school shootings as a problem?",
  "created_utc": 1660924518,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Not looking to turn this into a debate about republicans/conservatives. Just genuinely trying to understand. A lot of the arguments by people who don’t support gun control say that we should be just adding armed security at schools etc.\nI’m trying to understand why they think that adding more “guns” into the equation will do more harm then good?&lt;/p&gt;\n\n&lt;p&gt;EDIT: to add, they also dismiss the fact that the shootings are a result of how easy it is to access guns. No other country in the world has the same problem and also have such lax gun laws. How can they not see a correlation?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 180,
  "permalink": "/r/TooAfraidToAsk/comments/wseprv/why_do_people_who_dont_support_gun_control_not/",
  "subreddit": "TooAfraidToAsk",
  "id": "wseprv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Not looking to turn this into a debate about republicans/conservatives. Just\ngenuinely trying to understand. A lot of the arguments by people who don’t\nsupport gun control say that we should be just adding armed security at schools\netc. I’m trying to understand why they think that adding more…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "共和党/保守党の議論にするつもりはない。ただ\n純粋に理解しようとしているのです。銃規制を支持しない人たちの主張の多くは\n銃規制を支持しない人たちの主張の多くは、学校に武装した警備員を配置するべきだ、などと言います。\nなどと言います。私は、なぜ彼らが、さらに武装警備員を増やすことを考えるのか、理解したいのです...",
      "title": "銃規制を支持しない人たちは、なぜ集団・学校での銃乱射事件を問題視しないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不希望把这变成一场关于共和党人/保守派的辩论。只是\n真心实意地想了解。很多不支持枪支管制的人的论点都是\n支持枪支管制的人说，我们应该只是在学校增加武装保安\n等等。我试图理解为什么他们认为增加更多的...",
      "title": "为什么不支持枪支管制的人不认为大规模/校园枪击事件是一个问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不希望把這變成一場關於共和黨人/保守派的辯論。只是\n真心實意地想了解。很多不支持槍支管制的人的論點都是\n支持槍支管制的人說，我們應該只是在學校增加武裝保安\n等等。我試圖理解爲什麼他們認爲增加更多的...",
      "title": "爲什麼不支持槍支管制的人不認爲大規模/校園槍擊事件是一個問題？"
    }
  ]
}