{
  "author": "Queasy-Tour7362",
  "original_created_utc": 1645706773,
  "title": "Russia invaded Ukraine and the markets were quick to react: ETH broke below $2,500 and fell 10% overnight",
  "created_utc": 1645720933,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As you can see, the situation with cryptocurrencies changes from hour to hour during this crisis, which is extremely difficult and unfavorable. ETH falls 10% as a result of a larger market decline. This post on CryptoPotato caught my attention because I&amp;#39;ve been investing in ETH for a few years.  &lt;/p&gt;\n\n&lt;p&gt;The article said: &amp;quot;ETH broke the support at $2,500. This opens the way for a potential drop towards $2,200, which is the first serious level to halt any further declines. The previous support at $2,500 has turned into resistance, and the market outlook is grim. The US stock market is due to open later today and may pull ETH lower still.&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re all already dealing with high gas prices and delayed transactions, and we&amp;#39;re all looking for answers through various platforms, whether it&amp;#39;s Loopring, Metis, or something else, and now we&amp;#39;re facing such a drop that it&amp;#39;s truly a bad scenario. Do you have any concerns about it?  &lt;/p&gt;\n\n&lt;p&gt;Another news is that Russian-born Ethereum co-founder Vitalik Buterin blasts Putin for Ukraine invasion as crypto nosedive said: &amp;quot;Ethereum is neutral, but I am not.&amp;quot;&lt;br/&gt;\nI believe that ETH is neutral but it is inevitable that this whole situation will affect its current value, as it has an impact on the entire crypto market. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/hnykd5081sj81.png?width=1813&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=86878fb11d2d997ca0c41f15a96464702dfe72b6\"&gt;ETH chart for 24th Feb&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 348,
  "permalink": "/r/CryptoCurrency/comments/t0a7m4/russia_invaded_ukraine_and_the_markets_were_quick/",
  "subreddit": "CryptoCurrency",
  "id": "t0a7m4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As you can see, the situation with cryptocurrencies changes from hour to hour\nduring this crisis, which is extremely difficult and unfavorable. ETH falls 10%\nas a result of a larger market decline. This post on CryptoPotato caught my\nattention because I've been investing in ETH for a few…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このように、暗号通貨をめぐる状況は刻々と変化しています。\nこの危機的状況の中、極めて困難で不利な状況です。ETHは10％下落\nより大きな市場の下落の結果として。CryptoPotatoのこの投稿は、私の目に留まりました。\n私は数年前からETHに投資しているため、注目した...",
      "title": "ロシアがウクライナに侵攻し、市場は素早く反応した。ETHは2500ドルを割り込み、一晩で10％下落しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如你所看到的，在这场危机中，加密货币的情况每时每刻都在变化\n在这场危机中，这是非常困难和不利的。ETH下跌10%\n作为一个更大的市场下跌的结果。CryptoPotato上的这篇帖子引起了我的注意\n因为我一直在投资ETH，已经有几个...",
      "title": "俄罗斯入侵乌克兰，市场迅速作出反应。ETH跌破2,500美元，一夜之间下跌10%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如你所看到的，在這場危機中，加密貨幣的情況每時每刻都在變化\n在這場危機中，這是非常困難和不利的。ETH下跌10%\n作爲一個更大的市場下跌的結果。CryptoPotato上的這篇帖子引起了我的注意\n因爲我一直在投資ETH，已經有幾個...",
      "title": "俄羅斯入侵烏克蘭，市場迅速作出反應。ETH跌破2,500美元，一夜之間下跌10%。"
    }
  ]
}