{
  "author": "_ArtosisCurse_",
  "original_created_utc": 1636883499,
  "title": "How to create and sell NFTs for free (no gas fees) - A step by step tutorial",
  "created_utc": 1636900246,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>A lot of people asked me after my last post how they can create NFTs themself. So here is a short tutorial how you can mint (and hopefully sell) NFTs with absolutly no cost to you.</h1>\n\n<p>Disclaimer: First of there are multiple different platforms and blockchains on which you can mint NFTs and all of them have advantages and disadvantages, but here i am going to focus on the plattform Opensea and the polygon blockchain (matic). Thats because this way allows you to create NFTs without paying gas fees, which would be necessary if you mint on the eth blockchain for example.</p>\n\n<p>Selling NFTs that need fees to create requires a much higher price for profit because you need to sell for more than the gas fees you payed at least. This is not easy to do.</p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li><strong>Connect your ETH wallet with Opensea</strong> (you dont need to have funds in that wallet btw.) I would recommend either metamask or coinbase wallet. Both work well and are easy to use. And dont forget to back up that recovery phrase while your at it. <strong>You will need your wallet to confirm many of the actions taken here to have i ready for the process.</strong></li>\n<li><strong>NFTs on Opensea are created within a collection so you first need to create on of thoose.</strong> To do this click on my collections and then on create. Most of the important stuff happens here.</li>\n<li><strong>Set up the collection.</strong> You now pick a name for your collection and can add things like banners to the page or a description. You can also set the amount of Royalties here (This is the percentage you will get from every NFT created by sold between to people. So if you sell an NFT for $4 you get thoose $4 but if the buyer then resells that NFT again you get a percentage. I usually choose 10%)</li>\n<li><strong>Pick the correct blockchain.</strong> You can now choose between the ETH and Polygon Blockchain. <strong>If you want to pay no gas fees choose the polygon blockchain.</strong> After that click on create. You will need to confirm the actions you take while setting up the collection in your wallet.</li>\n<li>Now that you have set up a collection you can start minting NFTs. <strong>Just click on your collection and then on Add item.</strong></li>\n<li><strong>You can now upload a piece of art (picture, music whatever) and mint it as an NFT.</strong> You can also choose how many copys you want to mint. If you have things like stats or unlockable content you get when you purchase the NFT you also drop off of that here.</li>\n<li><strong>You can now go inside your collection and click on your NFTs and then sell to put a price on them.</strong> The price must be atleast $2 on Opensea. You can also choose how many copys of that NFT you weant to sell.</li>\n<li>???</li>\n<li>Profit</li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p>Another disclaimer: Minting an NFT is much, much easier that actually selling on. You either need to have a following already or have a different way to get peoples attention. There are a bunch of subreddits where you can do giveaways to promote your collection which is a good way to start and got me to my first few sales.</p>\n\n<p>Thank you for reading. Cheers :)</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/qtmm1n/how_to_create_and_sell_nfts_for_free_no_gas_fees/",
  "subreddit": "CryptoCurrency",
  "id": "qtmm1n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A LOT OF PEOPLE ASKED ME AFTER MY LAST POST HOW THEY CAN CREATE NFTS THEMSELF.\nSO HERE IS A SHORT TUTORIAL HOW YOU CAN MINT (AND HOPEFULLY SELL) NFTS WITH\nABSOLUTLY NO COST TO YOU.\n\nDisclaimer: First of there are multiple different platforms and blockchains on\nwhich you can mint NFTs and all of them…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "前回の投稿の後、多くの方からNFTを自分で作成する方法を聞かれました。\nそこで、このチュートリアルでは、全くコストをかけずにnftsを作成し、販売する方法をご紹介します。\nここでは簡単なチュートリアルをご紹介します。\n\n免責事項：まず、あなたがNFTを鋳造できる複数の異なるプラットフォームとブロックチェーンがあります。\nNFTを鋳造することができます。",
      "title": "無料でNFTを作成して販売する方法（ガス代不要） - A step by step tutorial"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很多人在我的上一篇文章后问我，他们如何能自己创建Nfts。\n因此，这里是一个简短的教程，你如何能够以绝对没有成本的方式铸造（并希望能够出售）Nfts\n绝对没有成本。\n\n免责声明：首先，有多个不同的平台和区块链，你可以在其上铸币。\n你可以铸造NFT，而且所有这些都...",
      "title": "如何免费创建和销售NFT（不收汽油费）--一步一步的教程"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多人在我的上一篇文章後問我，他們如何能自己創建Nfts。\n因此，這裏是一個簡短的教程，你如何能夠以絕對沒有成本的方式鑄造（並希望能夠出售）Nfts\n絕對沒有成本。\n\n免責聲明：首先，有多個不同的平臺和區塊鏈，你可以在其上鑄幣。\n你可以鑄造NFT，而且所有這些都...",
      "title": "如何免費創建和銷售NFT（不收汽油費）--一步一步的教程"
    }
  ]
}