{
  "author": "wealgo",
  "original_created_utc": 1630686789,
  "title": "Algorand Mega Post (and more tokenomics discussion)",
  "created_utc": 1630719185,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m sure I’ll catch some flack for yet another Algorand post – but I’ve seen a slew of misinformed posts surrounding Alogrand’s tokenomics. Want to clear the air, discuss governance, and hopefully spur some good discussion. I’ll include links/sources to enable people to drill down as desired.</p>\n\n<p><strong>Table of Contents:</strong></p>\n\n<p>What is Algorand?<br/>\nAlgorand’s Team<br/>\nAlgorand’s Ecosystem/Roadmap<br/>\nDeep Dive: Algorand’s Tokenomics  </p>\n\n<p><strong>What is Algorand:</strong>  </p>\n\n<p>Algorand is Silvio Micali’s envisioned solution to the blockchain “Trilemma” – security, scalability, and decentralization. It leverages Pure Proof-of-Stake (PPoS), which achieves consensus by leveraging the following sequence of events:</p>\n\n<ol>\n<li><p>Block Proposal: Accounts propose new blocks to the network</p></li>\n<li><p>Soft Vote: Committee votes on proposals and filters down to one</p></li>\n<li><p>Certify Vote: Separate committee votes to certify the block</p></li>\n<li><p>Each node receives a certificate for the block and writes it to the ledger</p></li>\n<li><p>New round is initiated and process starts over with new block proposers and voters </p></li>\n</ol>\n\n<p>This differs from other PoS chains for a couple reasons. First, to improve security, Algorand uses cryptographic sortition - which allows a set of users to secretly select themselves to participate in Algorand’s consensus protocol, without them being known to anyone else—including potential adversaries. Second, the “Pure” in PPoS implies consensus participants are free to come and go as they please – with Algos not locked up or “bonded” for any period of time.</p>\n\n<p>Another note – Algorand has traditionally incentivized participation by issuing participation rewards on every block (generally averaged out to ~5.7% for holding Algo). This is changing over the next few months, as Algorand rolls out their governance program. Beginning October 1st, Algo holders will be able to commit Algos (1 algo per 1 vote) into governance, and will be rewarded for participation in voting. As a note – “committed” algo aren’t locked, and can be sold during governance, with the ramification of not incurring governance rewards. Depending on how many total Algos are committed – these new rewards can range from 12% (4b total committed) to 30%+ (1b or below total committed). These rewards will be in addition to the normal ~5.7% participation rewards from Oct-Dec, which will end following this first governance cycle. </p>\n\n<p>Sources:<br/>\n<a href=\"https://www.algorand.com/technology/algorand-protocol\">https://www.algorand.com/technology/algorand-protocol</a> - Official Algorand page covering PPoS.<br/>\n<a href=\"https://www.algorand.com/technology/faq\">https://www.algorand.com/technology/faq</a> - Official Algorand FAQ<br/>\n<a href=\"https://prismic-io.s3.amazonaws.com/algorandfoundationv2/1f4bd113-3f64-4d3e-b69b-bcd988305359_ALG102-21Q2-C_Governance+Proposal_en-IE_FINAL.PDF\">https://prismic-io.s3.amazonaws.com/algorandfoundationv2/1f4bd113-3f64-4d3e-b69b-bcd988305359_ALG102-21Q2-C_Governance+Proposal_en-IE_FINAL.PDF</a> – Official Algorand Governance Proposal<br/>\n<a href=\"https://algorand.foundation/governance/first-period-rewards\">https://algorand.foundation/governance/first-period-rewards</a> - Official Algorand governance rewards information<br/>\n<a href=\"https://www.youtube.com/watch?v=zNdhgOk4-fE\">https://www.youtube.com/watch?v=zNdhgOk4-fE</a> – Lex Friedman’s interview with Silvio Micali<br/>\n<a href=\"https://algorandcom.cdn.prismic.io/algorandcom%2Fece77f38-75b3-44de-bc7f-805f0e53a8d9_theoretical.pdf\">https://algorandcom.cdn.prismic.io/algorandcom%2Fece77f38-75b3-44de-bc7f-805f0e53a8d9_theoretical.pdf</a> – Original Theoretical Algorand Whitepaper  </p>\n\n<p><strong>Algorand’s Team:</strong>  </p>\n\n<p>Algorand’s team + Silvio’s interview with Lex Friedman (linked above) is what initially sold me on Algorand. I’m only going to list a few of the key team-members, but please refer to the source link to dive deeper.. again, the team’s reputation/authority/network is extremely important for top-down adoption Algorand is targeting.</p>\n\n<p>Silvio Micali (Founder) - Silvio Micali has been on the faculty at MIT, Electrical Engineering and Computer Science Department, since 1983. Silvio is the co-inventor of probabilistic encryption, Zero-Knowledge Proofs, Verifiable Random Functions and many of the protocols that are the foundations of modern cryptography. Silvio is the recipient of the Turing Award (in computer science), of the Gödel Prize (in theoretical computer science) and the RSA prize (in cryptography). He is a member of the National Academy of Sciences, the National Academy of Engineering, the American Academy of Arts and Sciences and Accademia dei Lincei.</p>\n\n<p>Steve Kokinos (CEO) - Steve is the CEO of Algorand and responsible for overall business vision and strategy. Steve is a serial entrepreneur, most recently co-founder and Executive Chairman of Fuze, where he was responsible for corporate strategy. </p>\n\n<p>Sean Ford (COO) - Sean is the COO of Algorand, responsible for go-to-market execution and operations including product management, engineering, marketing and global community development. Sean joins Algorand from LogMeIn where he was the Chief Marketing Officer responsible for global marketing strategy, product marketing, ecommerce, communications, brand leadership, and demand generation. Sean has also held several executive leadership roles including CMO and COO of Zmags, CMO of Syncsort, and as vice-president of Global Business Unit (GBU) marketing at Oracle reporting to the CMO where he was responsible for Oracle’s vertical industry applications worldwide.</p>\n\n<p>Paul Milgrom (Economic Advisor) - Paul Milgrom is the Shirley and Leonard Ely professor of Humanities and Sciences in the Department of Economics at Stanford University. In 2020, <strong>Milgrom was awarded the Nobel Prize in economics for improvements</strong> to auction theory and inventions of new auction formats. Additionally, he was named a 2020 Distinguished Fellow of the American Economic Association. According to the Distinguished Fellow citation, Milgrom “is the world’s leading auction designer, having helped design many of the auctions for radio spectrum conducted around the world in the last thirty years, including those conducted by the U.S. Federal Communications Commission.”</p>\n\n<p>Christian Catalini (Economic Advisor) - Christian’s main areas of interest are the economics of digitization, entrepreneurship, and science. His research focuses on blockchain technology and cryptocurrencies, the economics of equity crowdfunding and startup growth, and the economics of scientific collaboration. Christian is one of <strong>the principal investigators of the MIT Digital Currencies Research Study, which gave access to all MIT undergraduate students to Bitcoin in the fall of 2014. He is also part of the MIT Initiative on the Digital Economy and the recently launched Digital Currency Initiative.</strong></p>\n\n<p>Sources:<br/>\n<a href=\"https://www.algorand.com/about/our-team\">https://www.algorand.com/about/our-team</a> - Official Algorand Team page.  </p>\n\n<p><strong>Algorand’s Ecosystem/Roadmap:</strong>  </p>\n\n<p>From a high-level, Algorand’s marketing efforts target enterprises (state/business) and large institutions to inspire top-down adoption (see their head of marketing’s (Keli Callaghan) recent AlgoFest interview - <a href=\"https://www.youtube.com/watch?v=4aqMVsXVS3s\">https://www.youtube.com/watch?v=4aqMVsXVS3s</a>). This differs largely from the grassroots marketing/adoption efforts conducted by other chains – with marketing often geared towards consumer adoption first (via AirDrops, weekly AMAs, high-levels of community engagement). The top-down approach has flaws – it can limit the growth of the ecosystem (DEXs, swaps, total transaction counts and related growth of confidence in the tech), it’s much slower (enterprises don’t just adopt – they do research, analysis, testing, etc). As a result, and relative to other chains, Algorand’s peer-to-peer ecosystem has grown at a much slower pace, which serves as one contributing factor towards slower price growth. To combat this, Algorand has set aside significant amounts of funding – and hosts/attends a significant amount of blockchain events – to inspire devs to build the tools required to promote ecosystem growth. The top-down approach also has benefits. There’s an opportunity cost incurred when marketing/development efforts are focused on a grassroots marketing campaign – largely, you risk over-developing and over-committing resources towards solutions that benefit a niche population at the expense of mass adoption. Anyone that’s done strategy development/implementation understands the complexities involved to successfully nest a major technological progression into enterprise-level goals/objectives – it takes a significant amount of resourcing, team authority, and synthesis among various stakeholders. As a biased Algorand holder – this is where I hope their top-down marketing/influence attempts, paired with their team authority in the field, pay off. </p>\n\n<p>Ecosystem Sources:<br/>\n<a href=\"https://www.algorand.com/ecosystem\">https://www.algorand.com/ecosystem</a> - Algorand’s official ecosystem page.<br/>\n<a href=\"https://www.algocurator.com/\">https://www.algocurator.com/</a> - Unofficial outlet that captures upcoming ecosystem projects.<br/>\nThere’s also various in-depth posts on both the Algorand and AlgorandOffical subreddits. Recommend diving in if you’re interested in learning more – it’s a great community.  </p>\n\n<p><strong>Deep Dive: Algorand’s Tokenomics</strong>  </p>\n\n<p>Here’s where most of the confusion seems to be – and admittedly, this took a while to wrap my head around.. and I&#39;m still not confident in why some discrepancies exist in circulating supply counts. Algorand is relatively new (founded in 2017 but not launched until June 2019), and as such, is still relatively early in its distribution schedule.</p>\n\n<p>As of today, ~3.0b (30%) of the total Algo supply has been injected into the circulation through the inaugural auction in June 2019 and then via community rewards, Early Backer / Relay Node Runner reward vesting, grant funding, and structured sales. This 3b number will likely ruffle feathers – as algoexplorer.io lists circulating supply as 5.7b. I believe this discrepancy is due to pending future participation rewards and early backer/relay node runner rewards counting as circulating.. although I’m honestly not sure. If someone has a concrete answer there – please post. Until then, I’m using ~3.0b which is listed in Algorand’s most recent official Economic Evolution Report (Sep 2021) on page 2.</p>\n\n<p>Algorand’s Economic Evolution Report (Sept 2021 – linked below) breaks down historical distribution – and uses charts that I recommend you view. </p>\n\n<p>The Algo market started with an initial tiny supply, so that subsequent reward flows, represented mainly by participation rewards (paid to all holders) and first-node-runner rewards (paid to the initial supporters that had invested in the project and committed to run relay nodes), had a disproportionate inflationary impact. This led to the need to introduce some early reforms to tokenomics. </p>\n\n<p>First, participation rewards were stabilized compared to the initial distribution trend, until market conditions, almost one year later, allowed them to restart growing. Second, the vesting plan was changed, first by pausing vesting for several months (EIP-09092019PC and EIP-10182019), and later (EIP-11252019AF) by introducing a new vesting agreement shifting payments to node runners to the further future and allowing in return a contingent increase and a possible acceleration, but the latter only when the market will be sufficiently mature for smooth absorption. This second piece is where I see the most confusion – and is generally call “accelerated vesting” for the “early backers/relay node runners”. I’ll copy out of the official proposal – EIP-11252019AF (and then explain after):</p>\n\n<p>////////</p>\n\n<p><strong>Variables:</strong><br/>\n  A: a fixed award amount, set to 0.0015 (0.15%) of the Node Runner’s original total vesting amount<br/>\n  <strong>DAB</strong> (“daily acceleration base”): a moving parameter, initially set to $0.30.<br/>\n  <strong>MAd</strong>: 30-day moving average of the Algo price in US dollars on day d</p>\n\n<p>Each day, Algos vest, in an amount that is 1/365 of the yearly amount specified in the base rate.</p>\n\n<p>On day <strong>d</strong>, if the moving average <strong>MAd</strong> is larger than <strong>DAB</strong>:</p>\n\n<p>The Node Runner receives additional Algos in an amount proportional to the difference between <strong>MAd</strong> and <strong>DAB</strong>, and the number of days <strong>d</strong> that have elapsed since the start of the program.</p>\n\n<p>Specifically, on day d, with moving average <strong>MAd</strong> and daily acceleration base <strong>DAB</strong>, the additional amount of Algos will be <strong>A*(MAd - DAB)*d.</strong></p>\n\n<p>The parameter <strong>DAB</strong> is updated to <strong>MAd</strong></p>\n\n<ol>\n<li>The distribution terminates when the Node Runner has received 125% of its original allocation.</li>\n</ol>\n\n<p>////////</p>\n\n<p>So.. lots of words to essentially say – additional algo’s will be distributed to the early backers/relay node runners when the <strong>MAd</strong> (current 30-day moving average of Algo price) is higher than the <strong>DAB</strong> (which started at .30 but has since progressed to the most recent highest 30-day moving average). The amount distributed is <strong>.15% * (MAd – DAB) * day</strong>. It’s important to note a couple things here:</p>\n\n<p>1 – The total ALGO max supply is 10b. This accelerated vesting could account for up to 3.125b (original 2.5b + 25% contingent) – and ends after those Algo are distributed. </p>\n\n<p>2 – From the Sep ’21 Economic Evolution Report – “As a result of acceleration, on June 16, essentially 2 years after launch, when the original vesting program was supposed to be completed, around <strong>2BN</strong> had actually been distributed, almost 80% of the original predicted amount..” this implies that <strong>no more than 1.25b</strong> remains to be distributed as part of the price-sensitive accelerated vesting program.</p>\n\n<p>3 – From a personal standpoint – I don’t see the <em>accelerated vesting</em> portion of this as a bad thing. Top down adoption requires a certain stability and lack of investor craze – this helps with that. That said, the sheer number of Algo distributed to the early backer/relay node runners is over 30% of the total supply, giving a relatively small group of organizations a large amount of governance ability. This is one of the largest issues I see with Algorand present day.</p>\n\n<p>Beyond the accelerated vesting – the remainder of the tokenomics seem easy to explain: </p>\n\n<p>Participation Rewards – 2.5b<br/>\nEarly Backers Relay Nodes - 2.5b + Contingent Incentives (~1.2b)<br/>\nTotal – <strong>6.2b</strong></p>\n\n<p>Innovation Fund - 400 M<br/>\nProtocol R&amp;D and Capital Markets Innovation - 400 M<br/>\nFoundation Algo Grant Program (with community voting) - 250 M<br/>\nResearch and Social Good Program - 200 M<br/>\nTotal – <strong>1.25b</strong></p>\n\n<p>Algorand Inc - 2000 M<br/>\nAlgorand Foundation - 500 M<br/>\nAlready Injected for operations and ecosystem - 50 M<br/>\nTotal – <strong>2.55b</strong></p>\n\n<p>= <strong>10b</strong></p>\n\n<p>This distribution schedule started in 2019 and runs through 2030 – there’s an extremely valuable bar graph on Algorand’s official tokenomics page (linked below). Couple key points – the majority of distribution happens from now to 2026, with only ~1b distributed from 2026-2030. We&#39;re currently ~30% through total distribution..  and lastly governance voting will likely steer future consideration of coin distribution. Running out of steam here - but I hope you made it this far, and I hope this is valuable.</p>\n\n<p>Sources:<br/>\n <a href=\"https://algorand.foundation/the-algo/algo-dynamics\">https://algorand.foundation/the-algo/algo-dynamics</a> - Algorand’s official tokenomics page.<br/>\n <a href=\"https://www.algorand.com/about/our-history\">https://www.algorand.com/about/our-history</a> - Algorand’s official history page.<br/>\n <a href=\"https://prismic-io.s3.amazonaws.com/algorandfoundationv2/dcbe6c89-251a-41b3-9c78-23d8ecabd6c1_Algo+Economic+Evolution+Report+Sept+2021.PDF\">https://prismic-io.s3.amazonaws.com/algorandfoundationv2/dcbe6c89-251a-41b3-9c78-23d8ecabd6c1_Algo+Economic+Evolution+Report+Sept+2021.PDF</a> – Algorand’s Economic Evolution Report (Sep 2021)<br/>\n <a href=\"https://algorandfoundation.cdn.prismic.io/algorandfoundation/eb2a8c69-2262-42f8-99a4-09df485207b5_EIP-11252019AF_+Conditional+Accelerated+Vesting+Nov+30.pdf\">https://algorandfoundation.cdn.prismic.io/algorandfoundation/eb2a8c69-2262-42f8-99a4-09df485207b5_EIP-11252019AF_+Conditional+Accelerated+Vesting+Nov+30.pdf</a> – Accelerated Vesting Information</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/ph8p9r/algorand_mega_post_and_more_tokenomics_discussion/",
  "subreddit": "CryptoCurrency",
  "id": "ph8p9r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m sure I’ll catch some flack for yet another Algorand post – but I’ve seen a\nslew of misinformed posts surrounding Alogrand’s tokenomics. Want to clear the\nair, discuss governance, and hopefully spur some good discussion. I’ll include\nlinks/sources to enable people to drill down as desired.\n\nTable…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "またしてもアルゴランドの記事でお叱りを受けるかもしれませんが、アルゴランドのトークノミクスを巡る\nアルゴランドのトケノミクスをめぐっては、間違った情報の投稿が相次いでいます。誤解を解きたいと思います。\n誤解を解き、ガバナンスについて議論し、うまくいけば良い議論が生まれることを期待しています。その際には\n必要に応じて掘り下げることができるように、リンクやソースを記載します。\n\n表...",
      "title": "アルゴランド・メガ・ポスト（その他のトケノミクスに関する議論"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我肯定会因为又一篇阿尔戈兰的帖子而受到一些批评--但我已经看到了一大批围绕阿尔戈兰的象征性经济学的错误帖子。\n但我已经看到了围绕Alogrand的象征性学说的一系列错误信息的帖子。我想澄清一下\n澄清空气，讨论治理，并希望能激发一些好的讨论。我将包括\n链接/来源，使人们能够根据需要进行深入研究。\n\n表...",
      "title": "Algorand巨贴（和更多的tokenomics讨论"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我肯定會因爲又一篇阿爾戈蘭的帖子而受到一些批評--但我已經看到了一大批圍繞阿爾戈蘭的象徵性經濟學的錯誤帖子。\n但我已經看到了圍繞Alogrand的象徵性學說的一系列錯誤信息的帖子。我想澄清一下\n澄清空氣，討論治理，並希望能激發一些好的討論。我將包括\n鏈接/來源，使人們能夠根據需要進行深入研究。\n\n表...",
      "title": "Algorand巨貼（和更多的tokenomics討論"
    }
  ]
}