{
  "author": "gemparkanbj",
  "the_new_excerpt": "As you all know, February was a very bad month for Tesla. The company's stock\nfell 20%. March did not bring relief. The decline did not continue, but things\nstill don’t go their way, while the general market continues to grow.\n\nTesla is a great company, but I don't want to buy its shares even today.…",
  "original_created_utc": 1623636639,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さんもご存知の通り、2月はテスラにとって非常に悪い月でした。同社の株価は\n20％下落しました。3月になっても安心はできませんでした。落ち込みは続きませんでしたが\n市場全体が成長を続ける中、同社は依然として思い通りにはいきません。\n\nテスラは素晴らしい会社ですが、今でもその株を買いたいとは思いません....",
      "title": "テスラよりもリスクの少ない電動化とエコロジーへの投資方法"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家都知道，2月份对特斯拉来说是一个非常糟糕的月份。该公司的股票\n跌了20%。三月并没有带来缓解。跌势没有继续，但事情\n仍然不顺，而总体市场继续增长。\n\n特斯拉是一家伟大的公司，但我今天也不想买它的股票....",
      "title": "与特斯拉相比，投资电气化和生态学的风险更小"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家都知道，2月份對特斯拉來說是一個非常糟糕的月份。該公司的股票\n跌了20%。三月並沒有帶來緩解。跌勢沒有繼續，但事情\n仍然不順，而總體市場繼續增長。\n\n特斯拉是一家偉大的公司，但我今天也不想買它的股票....",
      "title": "與特斯拉相比，投資電氣化和生態學的風險更小"
    }
  ],
  "title": "Less risky way to invest in electrification and ecology than Tesla",
  "created_utc": 1623668252,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As you all know, February was a very bad month for Tesla. The company&#39;s stock fell 20%. March did not bring relief. The decline did not continue, but things still don’t go their way, while the general market continues to grow.</p>\n\n<p>Tesla is a great company, but I don&#39;t want to buy its shares even today. In order for the company&#39;s valuation to be justified, in a few years, Elon Musk and his team must not only maintain leadership in the growing segment of electric cars, but also win competition in new segments. For example, self-driving cars, driverless taxis, you can also take over the orbital transport sector. Oh, this is already SpaceX...</p>\n\n<p>In short, Tesla is still unreasonably expensive. However, a reasonable investor today should take a course towards clean energy. All developed countries&#39; politicians talk about this, and they are ready to provide support. It is a really promising investment trend.</p>\n\n<p>Cheaper companies developing renewable energy sources (renewables) would be a good alternative to Tesla. Here is a list of ETFs (<a href=\"https://www.etf.com/channels/renewable-energy-etfs\">https://www.etf.com/channels/renewable-energy-etfs</a>) that you can use. By investing in them, we get more diversification, lower risks (P/E of companies in the sector is in the 30-40x region; most companies are profitable), as well as the same &quot;discount&quot; as on Tesla shares (renewables fell with it).</p>\n\n<p>Take a look at the graph below. Renewables are just as profitable as tech companies.</p>\n\n<p>Graph:</p>\n\n<p><a href=\"https://sun9-59.userapi.com/impg/GsmKApdEmg-MY4jGpcFQsjttkdiRrcfsYdKKJQ/k1bFdI6il08.jpg?size=806x623&amp;quality=96&amp;sign=71e8a8b5e53038856700029eb687bb8d&amp;type=album\">https://sun9-59.userapi.com/impg/GsmKApdEmg-MY4jGpcFQsjttkdiRrcfsYdKKJQ/k1bFdI6il08.jpg?size=806x623&amp;quality=96&amp;sign=71e8a8b5e53038856700029eb687bb8d&amp;type=album</a></p>\n</div><!-- SC_ON -->",
  "score": 74,
  "permalink": "/r/investing/comments/nzc3vi/less_risky_way_to_invest_in_electrification_and/",
  "subreddit": "investing",
  "id": "nzc3vi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009742344
}