{
  "author": "HaveADrinkOnMeCosby",
  "the_new_excerpt": "The most undervalued stock on Wall Street AND a high short %\n\nHuya operates a freemium platform. It sells ads across its platform, but it\ngenerates most of its revenue from virtual gifts viewers can buy for their\nfavorite broadcasters. Last quarter, Huya generated 94% of its revenue from its\nlive…",
  "original_created_utc": 1612817211,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "华尔街最被低估的股票，也是高空%的股票。\n\nHuya经营的是一个免费增值平台。它在整个平台上销售广告，但它\n其大部分收入来自于观众可以为他们购买的虚拟礼物。\n最喜欢的广播公司。上个季度，互娱94%的营收来自于旗下的\n活...",
      "title": "华亚是市场上最被低估的股票？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "華爾街最被低估的股票，也是高空%的股票。\n\nHuya經營的是一個免費增值平臺。它在整個平臺上銷售廣告，但它\n其大部分收入來自於觀衆可以爲他們購買的虛擬禮物。\n最喜歡的廣播公司。上個季度，互娛94%的營收來自於旗下的\n活...",
      "title": "華亞是市場上最被低估的股票？"
    }
  ],
  "title": "Huya the most undervalued stock in the market?",
  "created_utc": 1612838681,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The most undervalued stock on Wall Street AND a high short %</p>\n\n<p>Huya operates a freemium platform. It sells ads across its platform, but it generates most of its revenue from virtual gifts viewers can buy for their favorite broadcasters. Last quarter, Huya generated 94% of its revenue from its live streaming business, and the remaining 6% from online ads. Remember this last part. </p>\n\n<p>Huya&#39;s monthly active users (MAUs) rose 18% year-over-year to 172.9 million last quarter. Within that total, its mobile MAUs grew 16% to 74.2 million, and its total number of paid users increased 13% to 5.3 million.</p>\n\n<p>CEO Rongjie Dong attributed that growth to an increase in e-sports tournaments throughout the shorter summer and its deeper ties with Tencent, the world&#39;s largest video game publisher. If Huya closes its planned merger with Douyu next year, its MAUs could more than double to nearly 370 million, with over 13 million paid users.  </p>\n\n<p>PINTEREST has less monthly active users and is worth 50 BILLION!!!!</p>\n\n<p>Huya generates higher profits because it shares a near-duopoly with Douyu, is backed by Tencent&#39;s massive video game business, and generates most of its revenue from higher-margin virtual gifts instead of lower-margin digital ads.</p>\n\n<p>Wall Street expects Huya&#39;s revenue and earnings to rise 40% and 74%, respectively, this year. Next year, analysts expect its revenue and earnings to rise 23% and 36%, respectively. Based on those estimates, Huya looks incredibly cheap at 19 times forward earnings and just two times next year&#39;s sales.</p>\n\n<p>Those forecasts don&#39;t account for Huya&#39;s potential merger with Douyu, which could easily double its annual revenue. But its valuation should remain roughly the same after the all-stock merger, since it will grant current shareholders of Huya and Douyu equal halves of the new company.</p>\n\n<p>Tencent holdings is about to merge DOYU and HUYA into the biggest online gaming streaming service in China (roughly 80%). </p>\n\n<p>I predict tencent (the “kingmaker”) will turn it into an advertisement giant, they will have roughly 370 million active users (think Pinterest at 50B mcap) at a market cap of 10B (post merger). </p>\n\n<p>This is a HIGHLY shorted stock at 35% of float. It is being manipulated, I believe, because the shorts are having a problem covering with the recent run up (they just filed the merger with the SEC) so an “analyst” gave it a downgrade to help them out today. </p>\n\n<p>This is a buying opportunity of a lifetime. Huya/DOYU will be a dominate player in the biggest growing sector there is right now (Chinese gaming)... and UNLIKE GameStop, it is a highly profitable business and IS severely undervalued at it’s current price. </p>\n\n<p>I went YOLO with 36,000 shares and will provide updates as it progresses.</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/stocks/comments/lflejw/huya_the_most_undervalued_stock_in_the_market/",
  "subreddit": "stocks",
  "id": "lflejw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123203789
}