{
  "author": "cgilbertmc",
  "original_created_utc": 1627389019,
  "title": "Is Biden waiting for full FDA approval of the vaccine before mandating all military get vaccinated for Covid-19?",
  "created_utc": 1627483706,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have heard that several present and former members of the military are asking why the covid-19 vaccine is not mandatory in the services, especially for close quarters duty such as the Navy, Coast Guard and aircraft crews of all services.</p>\n\n<p>I also believe that all prison inmates (especially federal inmates) should be vaccinated unless there is a medical reason against it. Even those in short term confinement should get the vaccine or show proof of vaccination.</p>\n\n<p>The only reason I can think of Biden not issuing an executive order now, is the FDA&#39;s pending approval.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/Ask_Politics/comments/oslwe5/is_biden_waiting_for_full_fda_approval_of_the/",
  "subreddit": "Ask_Politics",
  "id": "oslwe5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have heard that several present and former members of the military are asking\nwhy the covid-19 vaccine is not mandatory in the services, especially for close\nquarters duty such as the Navy, Coast Guard and aircraft crews of all services.\n\nI also believe that all prison inmates (especially federal…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、現役の軍人や元軍人の何人かが、なぜコビド-19ワクチンの接種が義務化されていないのか？\nなぜコヴィド-19ワクチンの接種が義務化されていないのか、特に近親者の場合はどうなのか、と。\n特に、海軍、沿岸警備隊、全軍の航空機乗組員のような近距離任務に就く者には。\n\nまた、私は、すべての刑務所の受刑者（特に連邦政府の...",
      "title": "バイデン氏は、すべての軍人にCovid-19の予防接種を義務付ける前に、FDAによるワクチンの完全な承認を待っているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我听说一些现任和前任军人正在询问\n为什么各军种不强制接种covid-19疫苗，特别是对于海军、海岸警卫队和各军种的飞机机组人员等近距离工作的人员。\n特别是对于海军、海岸警卫队和各军种的飞机机组人员等近距离执勤的人员。\n\n我还认为，所有监狱的囚犯（尤其是联邦...",
      "title": "拜登是否在等待美国食品和药物管理局对该疫苗的全面批准，然后再强制要求所有军人接种科维德-19疫苗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我聽說一些現任和前任軍人正在詢問\n爲什麼各軍種不強制接種covid-19疫苗，特別是對於海軍、海岸警衛隊和各軍種的飛機機組人員等近距離工作的人員。\n特別是對於海軍、海岸警衛隊和各軍種的飛機機組人員等近距離執勤的人員。\n\n我還認爲，所有監獄的囚犯（尤其是聯邦...",
      "title": "拜登是否在等待美國食品和藥物管理局對該疫苗的全面批准，然後再強制要求所有軍人接種科維德-19疫苗？"
    }
  ]
}