{
  "author": "Sakura_Petals_GL",
  "original_created_utc": 1641286193,
  "title": "Are most men plagued with skid marks in their underwear, or am I just meeting unlucky/unhygienic people??",
  "created_utc": 1641294793,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I’m honestly just not sure at this point. I once lent some white basketball shorts to my dad when he wasn’t doing so great financially, and was living with me at my apartment. When I finally got them back after literal weeks (he’s the opposite of a punctual person) there were… um… well 💩 stains on the back area of them. Thoroughly grossed out, trying to be understanding, I proceeded to wash them 4 times, ended up under my bed folded up, stains still there, just to be washed again every now and then because I’m kinda afraid to wear them. &lt;/p&gt;\n\n&lt;p&gt;At first, I thought this is something that was an odd ‘my dad thing’, until I got my hands on my boyfriend’s white, Naruto boxer briefs. They’re absolutely adorable but I felt pretty awkward when putting them in the wash, only to notice there were skid marks in his underwear too. &lt;/p&gt;\n\n&lt;p&gt;I also remember seeing them in various places like visiting my brother and accidentally noticing his underwear thrown over the side of the hamper, as well as some bedrooms of guy friends’ of my boyfriend’s, when I’d be invited to go hang with them. &lt;/p&gt;\n\n&lt;p&gt;This honestly, and completely undisrespectfully, troubles me. Idk about EVERYONE, but every woman I know wipes that bum over and over again until the paper is as bright as, well, paper, even if it takes 25 sheets… and my mom agrees. None of us have had that problem in our underwear since we were 6 at the very latest. &lt;/p&gt;\n\n&lt;p&gt;So, my question is, are you guys just spending your entire lives wiping your bootyhole incorrectly and no one ever correcting you? Did your mothers not teach you how to do it right, or are y’all just slowly forgetting over the years?…because I honestly can’t think of any logical reason that I know this many people with skid marks in nearly every pair of underwear, and they’re all men. &lt;/p&gt;\n\n&lt;p&gt;It seems silly, but it’s a legitimate question I just can’t get out of my head 😂😂😂&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/TooAfraidToAsk/comments/rvpvml/are_most_men_plagued_with_skid_marks_in_their/",
  "subreddit": "TooAfraidToAsk",
  "id": "rvpvml",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So I’m honestly just not sure at this point. I once lent some white basketball\nshorts to my dad when he wasn’t doing so great financially, and was living with\nme at my apartment. When I finally got them back after literal weeks (he’s the\nopposite of a punctual person) there were… um… well 💩 stains…"
}