{
  "author": "666CryptoGod420",
  "original_created_utc": 1639265284,
  "title": "Do you also feel like all those pro-crypto politicians are just taking advantage of the crypto hype and they don't actually know shit about crypto?",
  "created_utc": 1639291303,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;They all act like they are super friendly, innovative tech guys who support innovative stuff but I feel like they don&amp;#39;t know shit about crypto and it&amp;#39;s tech, they are just supporting to take advantage of the crypto hype. They are not tech guys, they are just politicians. They don&amp;#39;t understand more than an average twitter guy. They&amp;#39;re supporting it because they see all this hype and they think &amp;#39;&amp;#39;I better join this hype and take advantage of it&amp;#39;&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;And yeah, I know, they are just politicians at the end of the day, I shouldn&amp;#39;t be expect more from them.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 163,
  "permalink": "/r/CryptoCurrency/comments/rebl6x/do_you_also_feel_like_all_those_procrypto/",
  "subreddit": "CryptoCurrency",
  "id": "rebl6x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "They all act like they are super friendly, innovative tech guys who support\ninnovative stuff but I feel like they don't know shit about crypto and it's\ntech, they are just supporting to take advantage of the crypto hype. They are\nnot tech guys, they are just politicians. They don't understand more…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼らは皆、超フレンドリーで革新的な技術者であるかのように振る舞い、サポートしています。\n革新的なものですが、彼らは暗号やそれについて何も知らないような気がします。\n彼らはただ暗号の誇大広告に便乗してサポートしているだけです。彼らは\n技術者ではなく、ただの政治家です。彼らはもっと理解していない...",
      "title": "暗号推進派の政治家たちは、暗号の宣伝に便乗しているだけで、実際には暗号のことなど何も知らないと感じていますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他们都表现得非常友好，是支持创新的技术人员。\n但我觉得他们对加密货币和它的技术一无所知。\n技术，他们只是在支持利用加密货币的炒作。他们是\n不是技术人员，他们只是政治家。他们不了解更多...",
      "title": "你是否也觉得所有那些支持加密货币的政客只是利用了加密货币的炒作，他们实际上对加密货币一无所知？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他們都表現得非常友好，是支持創新的技術人員。\n但我覺得他們對加密貨幣和它的技術一無所知。\n技術，他們只是在支持利用加密貨幣的炒作。他們是\n不是技術人員，他們只是政治家。他們不瞭解更多...",
      "title": "你是否也覺得所有那些支持加密貨幣的政客只是利用了加密貨幣的炒作，他們實際上對加密貨幣一無所知？"
    }
  ]
}