{
  "author": "28502348650",
  "original_created_utc": 1624528082,
  "title": "Does anyone else eat primarily just to survive, and doesn't enjoy their meals at all?",
  "created_utc": 1624583733,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So when I eat at a restaurant on a rare occasion, I always enjoy my meal. But when it comes to eating at home, it&#39;s the opposite. </p>\n\n<p>Let me explain. It&#39;s not that I&#39;m a terrible cook. I can make a half decent meal that I&#39;d somewhat enjoy. The problem is it takes too damn long. Going to the store, buying all the ingredients, cooking everything up at home, then of course washing all the pots, pans and dishes... All for just 15-20 minutes of eating. </p>\n\n<p>So instead I make relatively healthy meals that are pretty bland but easy to make. Plain rice, chicken and some vegetables sauteed in the pan. I make a big container of chicken at the start of the week and eat from it every day. Or, mashed potatoes and a can of tuna with some vegetables on the side. Again, a thing of mashed potatoes lasts several days. I really hate eating this stuff but it&#39;s all very low-effort and fulfills my nutritional needs. I don&#39;t really care about seasoning because it&#39;s also a lot of work and it doesn&#39;t really make it taste that much better.</p>\n\n<p>Anyone else out there who does the same?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/o6xnqo/does_anyone_else_eat_primarily_just_to_survive/",
  "subreddit": "TooAfraidToAsk",
  "id": "o6xnqo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So when I eat at a restaurant on a rare occasion, I always enjoy my meal. But\nwhen it comes to eating at home, it's the opposite.\n\nLet me explain. It's not that I'm a terrible cook. I can make a half decent meal\nthat I'd somewhat enjoy. The problem is it takes too damn long. Going to the\nstore,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、たまにレストランで食事をするときは、いつも楽しく食事をしています。しかし\n家で食事をするとなると、その逆になります。\n\n説明しましょう。私は料理が下手なわけではありません。私は料理が下手なわけではなく、そこそこ美味しく食べられる料理を\nそれなりの料理を作ることができます。問題は、あまりにも時間がかかりすぎることだ。買い出しに行ったり\nお店に行ったり...",
      "title": "生きるためだけに食事をしていて、食事を全く楽しめない人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，当我很少在餐馆吃饭时，我总是很享受我的饭菜。但是\n当谈到在家里吃饭时，情况却恰恰相反。\n\n让我解释一下。这并不是说我是一个糟糕的厨师。我可以做一顿半像样的饭菜\n我有点喜欢。问题是它需要太多该死的时间。去到\n商店，...",
      "title": "是否有人主要是为了生存而吃饭，根本不享受他们的饭菜？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，當我很少在餐館喫飯時，我總是很享受我的飯菜。但是\n當談到在家裏喫飯時，情況卻恰恰相反。\n\n讓我解釋一下。這並不是說我是一個糟糕的廚師。我可以做一頓半像樣的飯菜\n我有點喜歡。問題是它需要太多該死的時間。去到\n商店，...",
      "title": "是否有人主要是爲了生存而喫飯，根本不享受他們的飯菜？"
    }
  ]
}