{
  "author": "i-dler",
  "the_new_excerpt": "TLDR: HODL with a purpose and your overnight gains will come.\n\nAs you grow older, you realize that 10 years feels like yesterday. Whereas when\nyou are young, you make big plans and think that 10 years is all it takes for\nthe average person to succeed in life. Well, I am sorry to rain on your…",
  "original_created_utc": 1619428614,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TLDR: 目的を持ってHODLをすれば、オーバーナイトゲインが得られます。\n\n年をとると、10年が昨日のことのように感じられるようになります。一方、若い頃は\n若い頃は大きな計画を立てて、平均的な人が人生で成功するには10年あればいいと思っています。\n若い頃は大きな計画を立て、平均的な人が人生で成功するには10年あれば十分だと考えています。さて、あなたの雨を降らせて申し訳ありませんが...。",
      "title": "宇宙でスタートする若い人たちへのアドバイス。10年はあなたが思っているようなものではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "简而言之：有目标地进行HODL，你的隔夜收益就会到来。\n\n随着年龄的增长，你会发现10年的时间就像昨天。而当\n你年轻的时候，你制定了大的计划，并认为10年是普通人成功的全部条件。\n就能在生活中取得成功。好吧，我很抱歉给你带来麻烦。",
      "title": "给初入职场的年轻人的建议。10年不是你想象的那样。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "簡而言之：有目標地進行HODL，你的隔夜收益就會到來。\n\n隨着年齡的增長，你會發現10年的時間就像昨天。而當\n你年輕的時候，你制定了大的計劃，並認爲10年是普通人成功的全部條件。\n就能在生活中取得成功。好吧，我很抱歉給你帶來麻煩。",
      "title": "給初入職場的年輕人的建議。10年不是你想象的那樣。"
    }
  ],
  "title": "Advice to young people starting out in the space. 10 years is not what you think it is.",
  "created_utc": 1619444739,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TLDR: HODL with a purpose and your overnight gains will come.</p>\n\n<p>As you grow older, you realize that 10 years feels like yesterday. Whereas when you are young, you make big plans and think that 10 years is all it takes for the average person to succeed in life. Well, I am sorry to rain on your parade, but for most people, it takes more than just 10 years to become financially independent to the point that they can start enjoying life to some extent.  </p>\n\n<p>The point I am trying to make is, don&#39;t chase overnight gains, you will lose your sanity and your money. I am putting sanity first because it can&#39;t be bought.</p>\n\n<p>10 years from now, and even better, 20 years from now you have the chance of looking back at your net worth and realize that it only took you 10 or 20 years, which at that point will seem like overnight.</p>\n</div><!-- SC_ON -->",
  "score": 552,
  "permalink": "/r/CryptoCurrency/comments/mytl66/advice_to_young_people_starting_out_in_the_space/",
  "subreddit": "CryptoCurrency",
  "id": "mytl66",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776210468
}