{
  "author": "cliwise",
  "original_created_utc": 1636205513,
  "title": "You don’t quite understand the BTC halving and halving cycles, but are you too afraid to ask at this point? Here’s a quick intro for you.",
  "created_utc": 1636238482,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There can only ever be 21 million Bitcoin. Roughly every four years, the amount of new coins being created is halved - an event called the <em>halving</em>. The idea is that a <strong>reduction of new Bitcoins created combined with increased demand leads to higher prices</strong>. This is why Bitcoin is often described as being deflationary by design.</p>\n\n<p>For a more vivid comparison, imagine what would happen to the price of gold if half of the world’s gold mines collapse every four years. This comparison has its merits because Bitcoin is often described as a store of value (SoV), a property commonly assigned to gold. A prevalent model to be considered in this context is Plan B’s Stock To Flow Model. It compares Bitcoin’s stock, the size of the existing stockpiles or reserves of Bitcoin, and its flow, the yearly production, to commodities such as gold or silver. The model continues to hold up well and strengthens the arguments for halving events to have a considerable impact on the price of Bitcoin.</p>\n\n<p>A halving event kicked off a Bitcoin bull run in 2012 and 2016. Most analysts would agree that we are currently in one as well. How this cycle is going to play out is where analysts begin to have controversial discussions. One idea is that Bitcoin is nowadays more established, has garnered more institutional investors, and is an attractive inflation hedge. This belief is referred to as being in a Bitcoin “supercycle” / “the last cycle” and implies that we will see less of a price pullback than the previous cycles have had.</p>\n\n<p>The other belief is that we will experience another sharp price uptake before reaching a peak followed by a spectacular price drop, a so-called blow-off top, just like the 2012 and 2016 cycles have had. Regardless of how the price of Bitcoin will develop, the best thing you can do to prepare is to think through what both scenarios would mean for you.</p>\n\n<p>If you liked this quick intro, consider checking out my weekly newsletter, <a href=\"https://www.thebitcoinespresso.com/p/the-bitcoin-espresso-1\">The Bitcoin Espresso ☕</a> .</p>\n\n<p>You can find Plan B’s stock-to-flow model <a href=\"https://medium.com/@100trillionUSD/modeling-bitcoins-value-with-scarcity-91fa0fc03e25\">here</a>.</p>\n\n<p>If you want to see how the halvings affect the Bitcoin price, I can recommend the <a href=\"https://twitter.com/HalvingTracker\">@halvingtacker</a>. It shows how the price of Bitcoin developed in a comparison between 2012, 2016, and the current cycle.</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/8dGhSRvR0lNjpDlle9esDPNRNAlkE6UAu9zjuDo_Ki8.jpg?auto=webp&s=12463d1678c909dae26760d25a0b5256ebb1d44a",
          "width": 1200,
          "height": 1200
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/8dGhSRvR0lNjpDlle9esDPNRNAlkE6UAu9zjuDo_Ki8.jpg?width=108&crop=smart&auto=webp&s=2efdbc4db4385e2a8a94664eb90c53ad267c40d6",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/8dGhSRvR0lNjpDlle9esDPNRNAlkE6UAu9zjuDo_Ki8.jpg?width=216&crop=smart&auto=webp&s=fe66c3bed206b50b8730bf6954239378efbf9f72",
            "width": 216,
            "height": 216
          },
          {
            "url": "https://external-preview.redd.it/8dGhSRvR0lNjpDlle9esDPNRNAlkE6UAu9zjuDo_Ki8.jpg?width=320&crop=smart&auto=webp&s=28ca536de5be83345df20d40bdb6856e2f02dc34",
            "width": 320,
            "height": 320
          },
          {
            "url": "https://external-preview.redd.it/8dGhSRvR0lNjpDlle9esDPNRNAlkE6UAu9zjuDo_Ki8.jpg?width=640&crop=smart&auto=webp&s=eb33c0036204276650c1ded12f1a3eb579d20941",
            "width": 640,
            "height": 640
          },
          {
            "url": "https://external-preview.redd.it/8dGhSRvR0lNjpDlle9esDPNRNAlkE6UAu9zjuDo_Ki8.jpg?width=960&crop=smart&auto=webp&s=896c759cdaef50f11ee715ce77733e8d7e16ef9c",
            "width": 960,
            "height": 960
          },
          {
            "url": "https://external-preview.redd.it/8dGhSRvR0lNjpDlle9esDPNRNAlkE6UAu9zjuDo_Ki8.jpg?width=1080&crop=smart&auto=webp&s=1289c3f20b8eb161047a37e7581e8e3bf3f33d4c",
            "width": 1080,
            "height": 1080
          }
        ],
        "variants": {},
        "id": "tuy0Og6y_UlyBFyOGaVZXEU5m3HC7FMXoXxVn2HCn-A"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/qo0azw/you_dont_quite_understand_the_btc_halving_and/",
  "subreddit": "Bitcoin",
  "id": "qo0azw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There can only ever be 21 million Bitcoin. Roughly every four years, the amount\nof new coins being created is halved - an event called the halving. The idea is\nthat a reduction of new Bitcoins created combined with increased demand leads to\nhigher prices. This is why Bitcoin is often described as…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインは2100万個しか存在しません。大体4年に一度、新しいビットコインの量が\n半分になるというイベントがあります。考え方としては\nビットコインの新規発行量が減り、需要が増えれば価格が上昇するというものです。\n価格が上昇するというものです。これが、ビットコインがしばしば「...」と表現される理由です。",
      "title": "BTCの半減、半減サイクルをよく理解していないが、今更聞くのも憚られるのでは？そんなあなたのために簡単な紹介をします。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比特币只能有2100万枚。大约每四年，新币的数量\n新币的数量就会减半--这一事件被称为减半。这个想法是\n创造的新比特币的减少与需求的增加导致了\n更高的价格。这就是为什么比特币经常被描述为...",
      "title": "你不太了解BTC减半的周期，但你此时不敢问吗？这里为你简单介绍一下。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣只能有2100萬枚。大約每四年，新幣的數量\n新幣的數量就會減半--這一事件被稱爲減半。這個想法是\n創造的新比特幣的減少與需求的增加導致了\n更高的價格。這就是爲什麼比特幣經常被描述爲...",
      "title": "你不太瞭解BTC減半的週期，但你此時不敢問嗎？這裏爲你簡單介紹一下。"
    }
  ]
}