{
  "author": "lupertazzis",
  "original_created_utc": 1630479844,
  "title": "How the fuck am I supposed to get an “entry level job” when all these jackass employers are asking for multiple years of experience?",
  "created_utc": 1630504523,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I haven’t been job searching for long but holy fuck is this getting on my nerves. I’m willing to work my ass off to become an asset to a company and make something of myself but with everyone asking for 2-3 yEaRs Of ExPeRiEnCe I’m getting so discouraged. I’m very close to saying fuck it and just breaking my back at construction (despite my university degree) for something more than minimum wage.</p>\n\n<p>A lot of these listings don’t even have pay posted so I’m probably customizing resumes and wasting all this time to get denied $16.12/hour for an alleged entry level job that requires 25 years of experience</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/pfol8p/how_the_fuck_am_i_supposed_to_get_an_entry_level/",
  "subreddit": "NoStupidQuestions",
  "id": "pfol8p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I haven’t been job searching for long but holy fuck is this getting on my\nnerves. I’m willing to work my ass off to become an asset to a company and make\nsomething of myself but with everyone asking for 2-3 yEaRs Of ExPeRiEnCe I’m\ngetting so discouraged. I’m very close to saying fuck it and just…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "就職活動を始めてまだ日が浅いのですが、これは私の神経を逆なでするような話です。\n緊張している。私は会社の資産になるために一生懸命働き、自分の力を発揮したいと思っています。\n働きたいと思っているのですが、誰もが2〜3年の経験を求めているので、とてもがっかりしています。\n私はとても落胆しています。私は、もういいやという気になっています。",
      "title": "何年もの経験を求められる中で、どうやって「エントリーレベルの仕事」に就けばいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我找工作的时间并不长，但他妈的这让我很不爽。\n紧张。我愿意拼命工作，成为一个公司的资产，让自己有所成就。\n但每个人都要求有2-3年的工作经验，我感到非常沮丧。\n越来越灰心了。我很想说，去他妈的，就这样吧。",
      "title": "当所有这些混蛋雇主都要求我有多年的工作经验时，我他妈的怎么能得到一份 \"初级工作 \"呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我找工作的時間並不長，但他媽的這讓我很不爽。\n緊張。我願意拼命工作，成爲一個公司的資產，讓自己有所成就。\n但每個人都要求有2-3年的工作經驗，我感到非常沮喪。\n越來越灰心了。我很想說，去他媽的，就這樣吧。",
      "title": "當所有這些混蛋僱主都要求我有多年的工作經驗時，我他媽的怎麼能得到一份 \"初級工作 \"呢？"
    }
  ]
}