{
  "author": "fouriels",
  "the_new_excerpt": "The metanarrative/received wisdom - at least in the UK - surrounding\nlead/asbestos and their general phase-out in contemporary society generally goes\nsomething like this: 'Lead/asbestos was really useful because it corrodes\nslowly/is really good at stopping fire and is found everywhere, but like…",
  "original_created_utc": 1615140845,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "至少在英国，围绕着以下问题的元叙事/公认的智慧：\n铅/石棉及其在当代社会中的普遍淘汰情况。\n这样的东西。\"铅/石棉真的很有用，因为它会腐蚀\n慢慢地/是真正的善于阻止火灾，并发现无处不在，但像... ...",
      "title": "既然铅和石棉的有害影响已被人们熟知了几个世纪，为什么铅和石棉的使用在现代（及更早的时期）如此广泛？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "至少在英國，圍繞着以下問題的元敘事/公認的智慧：\n鉛/石棉及其在當代社會中的普遍淘汰情況。\n這樣的東西。\"鉛/石棉真的很有用，因爲它會腐蝕\n慢慢地/是真正的善於阻止火災，並發現無處不在，但像... ...",
      "title": "既然鉛和石棉的有害影響已被人們熟知了幾個世紀，爲什麼鉛和石棉的使用在現代（及更早的時期）如此廣泛？"
    }
  ],
  "title": "Why was the use of lead and asbestos so widespread in the modern period (and earlier) when their detrimental effects have been known for centuries?",
  "created_utc": 1615190046,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The metanarrative/received wisdom - at least in the UK - surrounding lead/asbestos and their general phase-out in contemporary society generally goes something like this: &#39;Lead/asbestos was really useful because it corrodes slowly/is really good at stopping fire and is found everywhere, but like radium watches etc we did not understand the dangers during e.g the industrial revolution (where they were ubiquitous) - we are now Smarter and Wiser and have phased it out&#39;.</p>\n\n<p>However, I found out only today that not only has both lead AND asbestos poisoning been understood since antiquity (as one of the first major environmental hazards!), but that this was so well known that it was accounted for (?) - from <a href=\"https://reddit.com/r/AskHistorians/comments/31b1ac/was_lead_really_the_best_choice_for/\">an earlier askhistorians thread</a>:</p>\n\n<blockquote>\n<p>The issue of lead pipes comes from <em>standing water</em>. When water simply sits in pipes, it will then pick up trace parts of the metal it sits in [...]  This is important because you have to remember that the majority of the Roman water delivery system was basic gravity fed. Over long distances, the Roman aqueducts would only decline by no more than five degrees at most. This kept the water flowing constantly.</p>\n</blockquote>\n\n<p>Similarly for asbestos, from <a href=\"https://jamanetwork.com/journals/jama/article-abstract/330445\">this JAMA letter</a>:</p>\n\n<blockquote>\n<p>A truly new disease has a classic description to which little can be added as time goes on, but the unwary reporter of a &quot;new&quot; disease who ignores classical literature, whether medical or not, is apt to be only a resurrection man. Asbestosis is so &quot;new&quot; a disease that industry has reluctantly accepted it as an occupational hazard. And yet Strabo, the Greek geographer and historian (63 B. C.—24 A. D.) described the dangers of asbestos weaving, and Pliny the Younger (61-113 A. D.), in his description of the diseases of slaves, called asbestosis an occupational disease. Both writers stated that the use of asbestos in the manufacture of handkerchiefs, headcloths, and tablecloths was common, and that the cost of these articles was equal</p>\n</blockquote>\n\n<p>I recognise that the idea of &#39;lost classical wisdom&#39; is generally unhelpful or unrealistic, but on the wikipedia page for lead poisoning it suggests:</p>\n\n<blockquote>\n<p>With the <a href=\"https://en.wikipedia.org/wiki/Industrial_Revolution\">Industrial Revolution</a> in the 19th century, lead poisoning became common in the work setting. The introduction of lead paint for residential use in the 19th century increased childhood exposure to lead; for millennia before this, most lead exposure had been <a href=\"https://en.wikipedia.org/wiki/Occupational_disease\">occupational</a>. An important step in the understanding of childhood lead poisoning occurred when <a href=\"https://en.wikipedia.org/wiki/Toxicity\">toxicity</a> in children from lead paint was recognized in Australia in 1897. France, Belgium, and Austria banned white lead interior paints in 1909; the <a href=\"https://en.wikipedia.org/wiki/League_of_Nations\">League of Nations</a> followed suit in 1922. However, in the United States, laws banning lead house paint were not passed until 1971, and it was phased out and not fully banned until 1978.</p>\n</blockquote>\n\n<p>I struggle to believe that we collectively somehow forgot that lead/asbestos are toxic - my best guess is that a combination of lobbying and under-education of the population, which resulted in other horrors during the industrial period, would account for this. But i&#39;d like to hear from someone more knowledgeable how these substances really took off (especially in the modern UK period) and caused so much damage, when their effects have apparently always been known.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/lzw743/why_was_the_use_of_lead_and_asbestos_so/",
  "subreddit": "AskHistorians",
  "id": "lzw743",
  "is_self": true,
  "media": null,
  "is_video": false
}