{
  "author": "SubstantialWatch4627",
  "original_created_utc": 1626531880,
  "title": "Made a tool to match your startup with your dream investors and help you get funded",
  "created_utc": 1626535596,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you&#39;re a first time founder, you&#39;ll appreciate how difficult the task of raising money for your startup is without industry connections or knowhow. When I began this process, I would Google &#39;funds for startups&#39; and scroll through every plausible-seeming link. As you can imagine, this was a very inefficient use of time.</p>\n\n<p><strong>Solution</strong></p>\n\n<p>The process of raising funds seems rather archaic, and we set out to change that by harnessing modern technology. We created <a href=\"https://thebacker.co/\">thebacker.co</a>, a smart platform to match you with the right investors. Here&#39;s how it works:</p>\n\n<ol>\n<li>You answer some questions about your startup, which takes about 2 minutes.</li>\n<li>You receive a tailored list of investors to your inbox within 24 hours.</li>\n</ol>\n\n<p>I&#39;d really appreciate any feedback on the idea, website or the list of investors. Thanks for reading!</p>\n\n<p>I also created <a href=\"https://www.reddit.com/r/thebackerfundraising/\">r/thebackerfundraising</a>. There doesn&#39;t seem to be a sub focused on a founder&#39;s fundraising journey, which I think is one which requires a lot of peer support. It&#39;ll be a sub for any tips, questions or advice on raising funds as a startup. Please join if it&#39;s something you think would be useful!</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/j6wmnMv1jJEl_2_ID-2V1KOnO8XVzrv05TYVdlVTxV4.jpg?auto=webp&s=6cbc3e8eea60a4a0c16ae035c8a6005fbd0363f5",
          "width": 494,
          "height": 494
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/j6wmnMv1jJEl_2_ID-2V1KOnO8XVzrv05TYVdlVTxV4.jpg?width=108&crop=smart&auto=webp&s=b045296994b2eb11ff5ab15cb330e7e33fcfc653",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/j6wmnMv1jJEl_2_ID-2V1KOnO8XVzrv05TYVdlVTxV4.jpg?width=216&crop=smart&auto=webp&s=e564181dfa13f1861642aa2f67fbffb73df55834",
            "width": 216,
            "height": 216
          },
          {
            "url": "https://external-preview.redd.it/j6wmnMv1jJEl_2_ID-2V1KOnO8XVzrv05TYVdlVTxV4.jpg?width=320&crop=smart&auto=webp&s=cf8b42eb6586a0e4e895f12ed57ccef637b22264",
            "width": 320,
            "height": 320
          }
        ],
        "variants": {},
        "id": "6dQx_-219xOhMhXPci_WhPAguL4lyIvvZHer_CIbOBU"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/SideProject/comments/om58a9/made_a_tool_to_match_your_startup_with_your_dream/",
  "subreddit": "SideProject",
  "id": "om58a9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If you're a first time founder, you'll appreciate how difficult the task of\nraising money for your startup is without industry connections or knowhow. When\nI began this process, I would Google 'funds for startups' and scroll through\nevery plausible-seeming link. As you can imagine, this was a very…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "初めての創業者であれば、スタートアップのための資金調達が、業界のコネやノウハウなしには、いかに困難な作業であるかを理解できるでしょう。\n業界でのコネクションやノウハウがなければ、スタートアップの資金調達がいかに難しいかをご理解いただけると思います。私が\n私がこのプロセスを始めたとき、私は「スタートアップ向けの資金」をグーグルで検索し、もっともらしいものをスクロールして見ていました。\n私がこのプロセスを始めたとき、私は「スタートアップのための資金」をグーグルで検索し、もっともらしいリンクをすべてスクロールしました。ご想像のとおり、これは非常に...",
      "title": "あなたのスタートアップと理想の投資家をマッチングさせ、資金調達を支援するツールを作りました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你是第一次创业，你会明白在没有行业关系或知识的情况下，为你的创业公司筹集资金是多么困难的事情。\n在没有行业关系或专业知识的情况下，为你的初创企业筹集资金是多么困难。当\n我开始这个过程时，我会在谷歌上搜索 \"初创企业的资金\"，并滚动浏览每一个看似合理的链接。\n每一个看似合理的链接。正如你可以想象的那样，这是一个非常复杂的过程。",
      "title": "做了一个工具来匹配你的创业公司和你的梦想投资者并帮助你获得资金"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你是第一次創業，你會明白在沒有行業關係或知識的情況下，爲你的創業公司籌集資金是多麼困難的事情。\n在沒有行業關係或專業知識的情況下，爲你的初創企業籌集資金是多麼困難。當\n我開始這個過程時，我會在谷歌上搜索 \"初創企業的資金\"，並滾動瀏覽每一個看似合理的鏈接。\n每一個看似合理的鏈接。正如你可以想象的那樣，這是一個非常複雜的過程。",
      "title": "做了一個工具來匹配你的創業公司和你的夢想投資者並幫助你獲得資金"
    }
  ]
}