{
  "author": "riseofthepengwingss",
  "original_created_utc": 1634594760,
  "title": "What to do when husband is really cheap?",
  "created_utc": 1634604538,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As the title says, I have a bit of a husband problem. </p>\n\n<p>I am trying to somewhat enjoy my life at the moment, but my husband is really cheap. And this is really impacting how much I can enjoy my life.</p>\n\n<p>He is the primary income maker in our family, and he refuses to let me see any of it. I try to suggest one meal out a month, even just to Wendy&#39;s, I have to keep up my appearance for him and I like the occasional shopping trip but he just says no, that the money is to YOLO into Doge. And he says I have expensive taste for wanting to go and visit my parents in a different state but he&#39;s the one who keeps saying we&#39;re going to the moon soon, like that&#39;s gonna be cheap!</p>\n\n<p>I have tried explaining to him that I sacrificed my career for his and I deserve to have a bit of fun, but he keeps telling me we can retire next year with his investments. I saw he was up $5 on Safemoon so asked for a new hot wheels toy but he&#39;s having none of it.</p>\n\n<p>How do you lot deal with your husband&#39;s? Do they support you or do they just check the charts 24/7? And any advice for my situation?</p>\n</div><!-- SC_ON -->",
  "score": 395,
  "permalink": "/r/CryptoCurrency/comments/qax5x7/what_to_do_when_husband_is_really_cheap/",
  "subreddit": "CryptoCurrency",
  "id": "qax5x7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As the title says, I have a bit of a husband problem.\n\nI am trying to somewhat enjoy my life at the moment, but my husband is really\ncheap. And this is really impacting how much I can enjoy my life.\n\nHe is the primary income maker in our family, and he refuses to let me see any\nof it. I try to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルの通り、私はちょっとした夫の問題を抱えています。\n\n私は今の生活をなんとか楽しもうとしていますが、夫は本当に\nケチです。このことが、私が人生を楽しむことに大きな影響を与えています。\n\n彼は我が家の主な収入源なのですが、その収入を私に見せようとしません。\n見ようとしません。私は努力していますが・・・。",
      "title": "夫が本当に安い場合はどうするか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说，我有一点丈夫的问题。\n\n我正努力在某种程度上享受我的生活，但我的丈夫真的是\n吝啬。这确实影响了我享受生活的程度。\n\n他是我们家庭的主要收入来源，但他拒绝让我看到任何\n的。我试图...",
      "title": "当丈夫真的很便宜时，该怎么办？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說，我有一點丈夫的問題。\n\n我正努力在某種程度上享受我的生活，但我的丈夫真的是\n吝嗇。這確實影響了我享受生活的程度。\n\n他是我們家庭的主要收入來源，但他拒絕讓我看到任何\n的。我試圖...",
      "title": "當丈夫真的很便宜時，該怎麼辦？"
    }
  ]
}