{
  "author": "Teknobejb",
  "original_created_utc": 1635081405,
  "title": "Does anybody else here just not want to buy a house?",
  "created_utc": 1635100248,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>hi :)  does anyone else just not want to buy a house. </p>\n\n<p>I&#39;m in my late 20s and i love travelling.  It is my dream to live abroad permanently.  I don&#39;t want to live in my home country so the idea of buying a house and renting it out so I can go live abroad without losing money is just a nightmare to me.  When I got into investing and crypto, it seems to me that the gains I would get from crypto and stocks if I play it right would be just as good as investing in a house. Ideally both would be good but I am going off the income I have now. </p>\n\n<p>What is your situations or feeling about the property thing</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/qerz8h/does_anybody_else_here_just_not_want_to_buy_a/",
  "subreddit": "CryptoCurrency",
  "id": "qerz8h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "hi :) does anyone else just not want to buy a house.\n\nI'm in my late 20s and i love travelling. It is my dream to live abroad\npermanently. I don't want to live in my home country so the idea of buying a\nhouse and renting it out so I can go live abroad without losing money is just a\nnightmare to me.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "hi :) 家を買うのが嫌になった人はいませんか？\n\n私は20代後半で、旅行が大好きです。海外に永住するのが夢なんです。\n永住したいと思っています。自分の国には住みたくないので、家を買ってそれを貸して、海外でも安心して暮らせるようにしようと考えています。\n家を買って、それを貸して、お金を落とさずに海外で暮らそうなんて、私にとっては悪夢です。\n私にとっては悪夢です。....",
      "title": "家を買いたくないと思う人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨 :) 还有人不想买房子吗。\n\n我已经20多岁了，我喜欢旅行。我的梦想是能在国外生活\n永久居住。我不想住在我的祖国，所以我想买一个房子，然后把它租出去，这样我就可以去国外生活，而不至于被人发现。\n我不想住在我的国家，所以买房子并把它租出去，这样我就可以在不损失钱的情况下去国外生活，这对我来说只是一个噩梦。\n对我来说是一场噩梦，....",
      "title": "这里还有人只是不想买房子吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨 :) 還有人不想買房子嗎。\n\n我已經20多歲了，我喜歡旅行。我的夢想是能在國外生活\n永久居住。我不想住在我的祖國，所以我想買一個房子，然後把它租出去，這樣我就可以去國外生活，而不至於被人發現。\n我不想住在我的國家，所以買房子並把它租出去，這樣我就可以在不損失錢的情況下去國外生活，這對我來說只是一個噩夢。\n對我來說是一場噩夢，....",
      "title": "這裏還有人只是不想買房子嗎？"
    }
  ]
}