{
  "author": "yellowrights",
  "original_created_utc": 1633510173,
  "title": "Why did Southeast Asia Indianize and not Sinicize?",
  "created_utc": 1633547759,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Southeast Asia, gets its name from being in between East Asia (China) and South Asia (India). With the exception of Vietnam, SEA has historically been in the &#39;Indian sphere of influence.&#39;</p>\n\n<p>Even nations like Cambodia have founding myths upon which an Indian prince married a local princess.</p>\n\n<p>Of course you also still have significant Chinese influence in SEA, examples being Chinese influence in Thai architecture, Chinese influence in Malay traditions, etc. but overwhelmingly, Indian culture has been much more influential.</p>\n\n<p>Historically (especially after the colonial period with coolie labor), there have also been significant ethnic Chinese populations in SEA.</p>\n\n<ul>\n<li>Why was Indian influence much greater than Chinese influence in SEA?\n\n<ul>\n<li>Why did Indian derived scripts, martial arts, clothing, jewelry, food, religion, etc. come to dominate SEA instead of Chinese ones?</li>\n</ul></li>\n<li>How did this phenomenon take place?\n\n<ul>\n<li>I know that the Chola Empire and possibly more ancient Indian sailors?/conquerors?/monks? are contributors to this.</li>\n<li>I also have heard the fact that many Chinese dynasties were insular and didn&#39;t look to directly spread their influence, but surely there were enough other time periods in which Chinese wanted to spread Chinese culture further?</li>\n</ul></li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/q2gg7o/why_did_southeast_asia_indianize_and_not_sinicize/",
  "subreddit": "AskHistorians",
  "id": "q2gg7o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Southeast Asia, gets its name from being in between East Asia (China) and South\nAsia (India). With the exception of Vietnam, SEA has historically been in the\n'Indian sphere of influence.'\n\nEven nations like Cambodia have founding myths upon which an Indian prince\nmarried a local princess.\n\nOf course…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "東南アジアは、東アジア（中国）と南アジアの中間に位置することから、その名が付けられました。\n東南アジアという名前は、東アジア（中国）と南アジア（インド）の中間に位置することから名付けられました。ベトナムを除き、SEAは歴史的に「インド空間」に位置してきました。\nインドの勢力圏」と呼ばれている。\n\nカンボジアのような国でも、インドの王子が結婚したという建国神話があります。\n現地のお姫様と結婚したという建国神話があります。\n\nもちろん...。",
      "title": "なぜ東南アジアはインド化し、中国化しなかったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "东南亚，因其位于东亚（中国）和南亚（印度）之间而得名。\n处于东亚（中国）和南亚（印度）之间。除了越南之外，东南亚在历史上一直处于\n'印度的势力范围'。\n\n甚至像柬埔寨这样的国家也有建国神话，在这个神话中，一位印度王子与当地公主结婚。\n娶了当地的公主。\n\n当然...",
      "title": "为什么东南亚会出现印度化而不是汉化？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "東南亞，因其位於東亞（中國）和南亞（印度）之間而得名。\n處於東亞（中國）和南亞（印度）之間。除了越南之外，東南亞在歷史上一直處於\n'印度的勢力範圍'。\n\n甚至像柬埔寨這樣的國家也有建國神話，在這個神話中，一位印度王子與當地公主結婚。\n娶了當地的公主。\n\n當然...",
      "title": "爲什麼東南亞會出現印度化而不是漢化？"
    }
  ]
}