{
  "author": "Trompdoy",
  "original_created_utc": 1625893211,
  "title": "Create a dead man's switch so that if you kick the bucket tomorrow, your crypto wallets can be recovered by your family.",
  "created_utc": 1625913036,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Whether your house catches fire and burns up the seed phrase you stored in a notebook, or you die tomorrow, you&#39;ll want to be sure you have a backup plan.  Personally, I have two separate notebooks in two places that are guarded from weather and fire because I don&#39;t keep any of my recovery info stored digitally.  I began doing it because I wondered what would happen if I died unexpectedly, and I realized nothing would.  My wallets would just sit untouched for the rest of time.  If I kick the bucket, I want to make sure my family is taken care of, and so I also created a dead man&#39;s switch.</p>\n\n<p>It sounds cooler than it is (it&#39;s still pretty cool and makes me feel like James Bond) but you can go to google inactive account management <a href=\"https://myaccount.google.com/inactive\">https://myaccount.google.com/inactive</a> and make a plan for when your primary email account is inactive for X amount of time.  If you don&#39;t log in for that period or show any sign of activity, an email can automatically be sent out to a predetermined list.  Your wife, your parents, your best friend, etc.  My automated email provides directions on how to recover my wallets and where to find my recovery information.</p>\n\n<p>I thought this was a pretty cool and easy to set up feature and could change the lives of your loved ones if something were to happen to you.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/cmLH5_KhNpwuUXn0_L5DIhSm5epCL070q6Txqz5c5Ro.jpg?auto=webp&s=27cae616f896fab4438f69a43f28967881f190c7",
          "width": 192,
          "height": 192
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/cmLH5_KhNpwuUXn0_L5DIhSm5epCL070q6Txqz5c5Ro.jpg?width=108&crop=smart&auto=webp&s=a59d442517fe2a7de37b209f6f0f99373690086f",
            "width": 108,
            "height": 108
          }
        ],
        "variants": {},
        "id": "zcxtbc2oJ6aU3Oi_qaGrQRE7Yp7xzBH4hoZq-RlMgdA"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/ohcd2f/create_a_dead_mans_switch_so_that_if_you_kick_the/",
  "subreddit": "CryptoCurrency",
  "id": "ohcd2f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Whether your house catches fire and burns up the seed phrase you stored in a\nnotebook, or you die tomorrow, you'll want to be sure you have a backup plan.\nPersonally, I have two separate notebooks in two places that are guarded from\nweather and fire because I don't keep any of my recovery info…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "家が火事になってノートに保存していた種明かしが燃えてしまっても、明日死んでしまっても\nノートブックに保存していた種明かしを燃やしてしまっても、明日死んでしまっても、バックアッププランを用意しておきたいものです。\n個人的には、復旧作業を行わないために、風雨や火災から守られた2つの場所に2冊のノートを用意しています。\n風雨や火災から守られた場所に2冊のノートを置いています。",
      "title": "デッドマンズスイッチを作成し、明日あなたが倒れたとしても、暗号化された財布を家族が回収できるようにします。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "无论你的房子着火了，烧掉了你储存在笔记本上的种子短语，还是你明天死了，你都要确保你有一个备份计划。\n笔记本，还是你明天就死了，你都要确保你有一个备份计划。\n就我个人而言，我有两个独立的笔记本，分别放在两个地方，以防止\n气候和火灾，因为我不保留我的任何恢复信息......",
      "title": "建立一个死人的开关，这样如果你明天死了，你的加密货币钱包就可以被你的家人收回。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "無論你的房子着火了，燒掉了你儲存在筆記本上的種子短語，還是你明天死了，你都要確保你有一個備份計劃。\n筆記本，還是你明天就死了，你都要確保你有一個備份計劃。\n就我個人而言，我有兩個獨立的筆記本，分別放在兩個地方，以防止\n氣候和火災，因爲我不保留我的任何恢復信息......",
      "title": "建立一個死人的開關，這樣如果你明天死了，你的加密貨幣錢包就可以被你的家人收回。"
    }
  ]
}