{
  "author": "ProfessorDefiant6947",
  "original_created_utc": 1644716624,
  "title": "Isn’t it inherently selfish of God to create humans just to send some of us to hell, when we could’ve just not existed and gone to neither hell or heaven?",
  "created_utc": 1644722193,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi, just another person struggling with their faith and questioning God here. I thought about this in middle school and just moved on as something we just wouldn’t understand because we’re humans but I’m back at this point so here we are. If God is perfect and good why did he make humans, knowing we’d bring sin into the world and therefore either go to heaven or hell. I understand that hell is just an existence without God which is supposedly everything good in life, so it’s just living in eternity without anything good. But if God knew we would sin and He is so good that he hates sin and has to send us to hell, why didn’t he just not make us? Isn’t it objectively better to not exist than go to hell? Even at the chance of heaven, because if we didn’t exist we wouldn’t care about heaven because we wouldn’t be “we.”&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/TooAfraidToAsk/comments/sr6ycg/isnt_it_inherently_selfish_of_god_to_create/",
  "subreddit": "TooAfraidToAsk",
  "id": "sr6ycg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi, just another person struggling with their faith and questioning God here. I\nthought about this in middle school and just moved on as something we just\nwouldn’t understand because we’re humans but I’m back at this point so here we\nare. If God is perfect and good why did he make humans, knowing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、ここにも信仰に悩む人、神様に疑問を持つ人がいます。I\n中学生の頃、このようなことを考えていましたが、ただ単に、私たちが考えていることとして\n人間だから理解できないだろうけど、この地点まで戻ってきたので、ここで紹介します。\nです。もし神様が完璧で良い人なら、なぜ人間を作ったのでしょうか？知っているのに...",
      "title": "人間は存在しなければ、地獄にも天国にも行けなかったのに、一部の人間を地獄に送るためだけに人間を創ったのは、本来、神の利己主義ではないでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，这里只是另一个在信仰中挣扎并质疑上帝的人。I\n我在中学的时候就想过这个问题，但只是把它当作我们无法理解的事情来处理。\n因为我们是人类，所以无法理解，但我又回到了这一点上，所以我们在这里\n归来了。如果上帝是完美和善良的，他为什么要创造人类，知道...",
      "title": "上帝创造人类只是为了把我们中的一些人送入地狱，而我们本来可以不存在，既不下地狱也不上天堂，这难道不是本质上的自私吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，這裏只是另一個在信仰中掙扎並質疑上帝的人。I\n我在中學的時候就想過這個問題，但只是把它當作我們無法理解的事情來處理。\n因爲我們是人類，所以無法理解，但我又回到了這一點上，所以我們在這裏\n歸來了。如果上帝是完美和善良的，他爲什麼要創造人類，知道...",
      "title": "上帝創造人類只是爲了把我們中的一些人送入地獄，而我們本來可以不存在，既不下地獄也不上天堂，這難道不是本質上的自私嗎？"
    }
  ]
}