{
  "author": "KofiOlut",
  "original_created_utc": 1638696141,
  "title": "I don't think anyone in this sub actually sold their position during the dip - we are all too indoctrinated by our own repetitive mantras to be even faced by it, this was market manipulation only.",
  "created_utc": 1638708784,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First of all, what exactly is market manipulation you might ask:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;&lt;strong&gt;Market manipulation is an attempt to artificially influence an asset’s price or the market’s behavior.&lt;/strong&gt; This typically involves a single individual or group looking to create an illusion in the market, so they can profit from the aftermath. For example, a pump and dump may involve a person pumping a penny stock’s price with fake news and then profiting at the peak. You may recognize that example from Wolf of Wall Street, the true story of notorious stock-market manipulator Jordan Belfort.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Four Common Market Manipulation Strategies&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;1. Pump and Dump&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The crypto market’s most prevalent offender is the pump and dump, which involves a group of people working together to artificially inflate a coin’s value. Pump and dumps usually target low-market cap coins that are available on limited exchanges. The group’s insiders will buy a coin early and dump it once there is enough attention from traders and investors buying in. In recent years, pump and dumps have become more accessible via social media communities like Reddit, Telegram and Discord. You may have recognized them from names like Crypto Pumps. In these situations, the leaders typically profit while most of the participants end up taking a loss&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;2. Whale Wall Spoofing&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Spoofing was a common tactic used during Bitcoin’s early days and still happens on less-regulated exchanges. This strategy involves a whale placing large orders to create fake buy or sell walls in the order books, hence the name spoofing. For example, if they wanted to create a bearish sentiment and drive a coin’s price down, a whale will set large sell orders to trick investors into panic selling. Once the selloff occurs, the whale removes their sell orders and proceeds to buy more at a discounted price.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;3. Wash Trading&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Wash trading is similar to whale wall spoofing because they both feed misleading information to the market. This strategy involves a person or group rapidly buying and selling the same cryptocurrency to inflate the volume artificially. The asset’s increased activity gains attention from traders and investors, which distorts the price even more. Smaller, unregulated exchanges will typically perform wash trades to inflate trading volume, generate more commission and entice more users. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;4. Stop Hunting&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Stop hunting involves whales driving a cryptocurrency’s price to a level where market participants have set stop-loss orders. Most people set their stop orders around the same key technical levels. The whale executes multiple sell orders to drive the price down and trigger the stops, which causes high volatility and an opportunity to rebuy the asset at a lower price.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Source: &lt;a href=\"https://www.binance.com/en/blog/fiat/what-is-market-manipulation-in-cryptocurrency-421499824684902912\"&gt;What is Market Manipulation in Cryptocurrency?&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;So what can you do against Market Manipulation: &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;&lt;strong&gt;How do I Deal With Market Manipulation&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Tracking market manipulation is a tricky game of hide and seek. Remember always to do your research and due diligence before investing money in any asset. We’ve listed four basic strategies you can use to protect your crypto holdings from market manipulation.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;1. Double-check with different sources&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Don’t rely on a single source of information, like the order book, to verify an asset’s movement. Compare your asset’s data across different sources like Coingecko and Coinmarketcap. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;2. Focus on historical price trends&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;Whales will sometimes inflate volume by performing wash trades on multiple exchanges. For example, posting a large trade on a popular exchange while doing the opposite on a smaller one. Traders can avoid this whale tactic by basing their decisions on historical price trends instead of recent movements. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;3. Longer-term contracts vs. perpetual futures&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Whales will sometimes drive prices to liquidate their shorts and benefit from a long position of equal size. For an unbiased method, always compare the premium on longer-term contracts to perpetual futures. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;4. Dollar-cost average (DCA) with recurring buy&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;If you’re more of a HODLer than a trader, you can use Binance’s recurring buy feature to dollar-cost average (DCA). This strategy will not only lower your exposure to potential market manipulation price swings but also strengthen your crypto holdings. Remember, market manipulation causes more harm to short-term traders since the effects happen quickly before the market corrects itself. If you’re interested in learning more, you can read our &lt;a href=\"https://www.binance.com/en/support/faq/24936156c8e440ce852ba9558fd766aa\"&gt;recurring buy FAQ guide&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;5. Diversify your portfolio&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Your crypto portfolio should include a healthy mix of different assets according to your risk appetite. In other words, don’t put all your eggs in one basket—don’t all in. If your portfolio is properly diversified, market manipulation can only affect a small percentage of your assets.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Source: &lt;a href=\"https://www.binance.com/en/blog/fiat/what-is-market-manipulation-in-cryptocurrency-421499824684902912\"&gt;What is Market Manipulation in Cryptocurrency?&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think any of us trained Hodler&amp;#39;s were part of this crash this saturday. If anything this sub does, it teaches you basic crypto knowledge in the form of ever repeating mantras:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;It indoctrinates you with the 10 commandments of this sub (DCA; DYOR; HODL; etc.) and melds it into our brains so we don&amp;#39;t forget the next time a minor correction happens. I am thankful to all of you indoctrinators out there, keep up the community spirit.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 246,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/1l_EEsM-rPYCpggUfp-xgRyIzz8O4bYRADaHTNBglOA.jpg?auto=webp&amp;s=e2791b854793ec34b3375e12dd74773bab87eec7",
          "width": 1600,
          "height": 900
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/1l_EEsM-rPYCpggUfp-xgRyIzz8O4bYRADaHTNBglOA.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=7f30fd4e9eb2ef089372db8ec2b0771a22054e3e",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/1l_EEsM-rPYCpggUfp-xgRyIzz8O4bYRADaHTNBglOA.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=8cd2452d0e9f26ec5514fdab646cdb706b39c72c",
            "width": 216,
            "height": 121
          },
          {
            "url": "https://external-preview.redd.it/1l_EEsM-rPYCpggUfp-xgRyIzz8O4bYRADaHTNBglOA.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=64297603dbb714efe1c1492fe5f097916d888b7c",
            "width": 320,
            "height": 180
          },
          {
            "url": "https://external-preview.redd.it/1l_EEsM-rPYCpggUfp-xgRyIzz8O4bYRADaHTNBglOA.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=8538f682ce122a5ce0df6b0c047b77c589105cdb",
            "width": 640,
            "height": 360
          },
          {
            "url": "https://external-preview.redd.it/1l_EEsM-rPYCpggUfp-xgRyIzz8O4bYRADaHTNBglOA.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=d9543439c67c2eb3616e06c5dae871399346646d",
            "width": 960,
            "height": 540
          },
          {
            "url": "https://external-preview.redd.it/1l_EEsM-rPYCpggUfp-xgRyIzz8O4bYRADaHTNBglOA.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=4087394f644baf3d608bd1fbc022f789e192b224",
            "width": 1080,
            "height": 607
          }
        ],
        "variants": {},
        "id": "AztbJkJDtTeEPtv4v5idFxdZx5adgaDm9oYJ_KsR82E"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/r9c1l9/i_dont_think_anyone_in_this_sub_actually_sold/",
  "subreddit": "CryptoCurrency",
  "id": "r9c1l9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "First of all, what exactly is market manipulation you might ask:\n\n\"Market manipulation is an attempt to artificially influence an asset’s price or\nthe market’s behavior. This typically involves a single individual or group\nlooking to create an illusion in the market, so they can profit from…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず、「相場操縦とは何か」と問われることがあります。\n\n「市場操作とは、資産価格や株価に人為的な影響を与えようとする試みです。\n市場の動き これは、通常、単一の個人またはグループが関与しています。\n市場に錯覚を起こさせ、そこから利益を得ようとする。",
      "title": "私たちは皆、自分の繰り返しのマントラに洗脳されていて、それに直面することすらできませんでした。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，你可能会问到底什么是市场操纵。\n\n\"市场操纵是指试图人为地影响一项资产的价格或市场行为。\n市场的行为。这通常涉及一个个人或团体\n试图在市场上制造假象，以便他们能够从中获利。",
      "title": "我不认为在这个子里有人真的在下跌期间卖出了他们的头寸--我们都被自己重复的咒语灌输得太厉害了，甚至无法面对它，这只是市场操纵。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，你可能會問到底什麼是市場操縱。\n\n\"市場操縱是指試圖人爲地影響一項資產的價格或市場行爲。\n市場的行爲。這通常涉及一個個人或團體\n試圖在市場上製造假象，以便他們能夠從中獲利。",
      "title": "我不認爲在這個子裏有人真的在下跌期間賣出了他們的頭寸--我們都被自己重複的咒語灌輸得太厲害了，甚至無法面對它，這只是市場操縱。"
    }
  ]
}