{
  "author": "samuel19xd",
  "original_created_utc": 1636394626,
  "title": "What are you people buying right now?",
  "created_utc": 1636407273,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Literally every top coin is hitting ATH recently. BTC, ETH, DOT and SOL to name a few. So in this bullrun, what are you people buying? I am looking into coins that hasn&#39;t reached ATH yet like LINK, MATIC, XRP, ADA etc. But during a bullrun it&#39;s really hard to decide where to put that extra DCA money. Obviously, following my routine but I am thinking of decreasing the BTC and ETH ratio try putting in extra cash into ALTs. </p>\n\n<p>What do you people suggest? I hold DOT, LINK, MATIC and ALGO (my wife would not let me sell it, she said she likes the name). Recently heard about Loopring but seeing it go parabolic, I am holding my horses. FTM is another candidate I bought some while ago. This sub has suggested several coins in past that was actually profitable (ALGO and ADA included). </p>\n\n<p>Now, I am here out in the wild asking those random internet people to suggest some solid projects to invest (DCA actually) in during a bullrun. May the crypto lords answer my prayer!</p>\n</div><!-- SC_ON -->",
  "score": 273,
  "permalink": "/r/CryptoCurrency/comments/qpj97u/what_are_you_people_buying_right_now/",
  "subreddit": "CryptoCurrency",
  "id": "qpj97u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Literally every top coin is hitting ATH recently. BTC, ETH, DOT and SOL to name\na few. So in this bullrun, what are you people buying? I am looking into coins\nthat hasn't reached ATH yet like LINK, MATIC, XRP, ADA etc. But during a bullrun\nit's really hard to decide where to put that extra DCA…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、文字通りすべてのトップコインがATHにヒットしています。BTC、ETH、DOT、SOLなどなど。\nいくつか挙げられます。では、このブルランの中で、皆さんは何を買っているのでしょうか？私は、まだATHに達していないコイン\nLINK, MATIC, XRP, ADAなど、まだATHに達していないコインに注目しています。しかし、ブルラン中は\nその余ったDCAをどこに置くかが難しいんだよね...。",
      "title": "皆さんは今、何を買っていますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "从字面上看，最近每个顶级币都在冲击ATH。BTC、ETH、DOT和SOL等等。\n寥寥无几。那么，在这轮牛市中，你们都在买什么？我正在研究的是\n诸如LINK、MATIC、XRP、ADA等还没有达到ATH的币。但在牛市中\n真的很难决定把多余的DCA放在哪里......",
      "title": "你们这些人现在在买什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從字面上看，最近每個頂級幣都在衝擊ATH。BTC、ETH、DOT和SOL等等。\n寥寥無幾。那麼，在這輪牛市中，你們都在買什麼？我正在研究的是\n諸如LINK、MATIC、XRP、ADA等還沒有達到ATH的幣。但在牛市中\n真的很難決定把多餘的DCA放在哪裏......",
      "title": "你們這些人現在在買什麼？"
    }
  ]
}