{
  "author": "oxedei",
  "the_new_excerpt": "I was looking into how much I wanna have invested in stocks before I go part\ntime somewhere in the future. I don't really spend a lot of money so most of my\nincome just sits there, with some of it invested.\n\nI know I could easily live off 2k bucks a month, but obviously that takes quite\nthe…",
  "original_created_utc": 1621173440,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "パートタイムで働く前に、どのくらい株式投資をしておきたいかを考えていました。\n将来、どこかでパートタイムになる前に、どれくらい株に投資しておきたいかを考えていました。私はあまりお金を使わないので、収入のほとんどは眠っています。\n収入の一部を投資に回しているんだ。\n\n月に2,000ドルあれば簡単に生活できると思いますが、明らかにそれはかなりの額を必要とします。\nそれは...",
      "title": "株式のリターンで生活することを目標とする場合、どのくらいの投資を考えているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在研究在我将来去某个地方做兼职之前，我应该在股票上投资多少钱。\n某个地方做兼职。我并不怎么花钱，所以我的大部分收入就放在那里，有一些是投资。\n收入只是放在那里，其中一部分用于投资。\n\n我知道我可以很容易地靠每月2千块钱生活，但显然这需要相当的\n的。",
      "title": "如果你的目标是靠股票收益来生活，你想投资多少钱？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在研究在我將來去某個地方做兼職之前，我應該在股票上投資多少錢。\n某個地方做兼職。我並不怎麼花錢，所以我的大部分收入就放在那裏，有一些是投資。\n收入只是放在那裏，其中一部分用於投資。\n\n我知道我可以很容易地靠每月2千塊錢生活，但顯然這需要相當的\n的。",
      "title": "如果你的目標是靠股票收益來生活，你想投資多少錢？"
    }
  ],
  "title": "If your goal is to live off your stock returns, how much are you looking to invest?",
  "created_utc": 1621191437,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was looking into how much I wanna have invested in stocks before I go part time somewhere in the future. I don&#39;t really spend a lot of money so most of my income just sits there, with some of it invested.</p>\n\n<p>I know I could easily live off 2k bucks a month, but obviously that takes quite the investment to get passively each month.</p>\n\n<p>What are you guys aiming for? What&#39;s your strategy to achieve your goal?</p>\n</div><!-- SC_ON -->",
  "score": 515,
  "permalink": "/r/stocks/comments/ndovur/if_your_goal_is_to_live_off_your_stock_returns/",
  "subreddit": "stocks",
  "id": "ndovur",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590804456
}