{
  "author": "Jxntb733",
  "original_created_utc": 1638743912,
  "title": "How much further down the crypto rabbit hole can one go?",
  "created_utc": 1638761522,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When I got into the space early this year it opened my eyes to a world of macroeconomic thinking, I deep dived. &lt;strong&gt;HARD&lt;/strong&gt;. I started by watching all the MIT Gary Gensler lectures, all of the videos where  Micheal Saylor proved he was a maximalist. I read books trying to understand the gold standard, the bitcoin standard, where Peter Schift is coming from. I reading the white paper again and again, understanding byzantine, and then others.             &lt;/p&gt;\n\n&lt;p&gt;In the past year I&amp;#39;ve learned &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;To code hashes and blockchains in python, &lt;/li&gt;\n&lt;li&gt;Staking and swapping&lt;/li&gt;\n&lt;li&gt;Tax laws in both my countries, &lt;/li&gt;\n&lt;li&gt;How to spot good/bad news article&lt;/li&gt;\n&lt;li&gt;Tracked hash rates moving to North America &lt;/li&gt;\n&lt;li&gt;Charted on chain metrics &lt;/li&gt;\n&lt;li&gt;Watched interview after interview &lt;/li&gt;\n&lt;li&gt;Read about the fourth turning demographic crisis era, of new digital internet money revolution&lt;/li&gt;\n&lt;li&gt;Participated in macroeconomic lectures and seminars.&lt;br/&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;em&gt;I get it.&lt;/em&gt; I think most of us here do.          &lt;/p&gt;\n\n&lt;p&gt;Where does it stop? I feel like I’ve gotten the equivalent of a bachelors degree in DeFi market finance having been hyper obsessed the past many months. What’s next? Do I learn how to build my own cryptos? Learn Haskell? Do I start trading evolving NFTs ‘for the tech’? Set up nodes just for principles sake?              &lt;/p&gt;\n\n&lt;p&gt;I’ve become desensitized to the volatility and have just decided not to sell until 2033. What do I do till then?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 197,
  "permalink": "/r/CryptoCurrency/comments/r9rhh2/how_much_further_down_the_crypto_rabbit_hole_can/",
  "subreddit": "CryptoCurrency",
  "id": "r9rhh2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "When I got into the space early this year it opened my eyes to a world of\nmacroeconomic thinking, I deep dived. HARD. I started by watching all the MIT\nGary Gensler lectures, all of the videos where Micheal Saylor proved he was a\nmaximalist. I read books trying to understand the gold standard, the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今年の初めにこの分野に参入したとき、私はこの世界に目を見開きました。\nマクロ経済学的な考え方に、深く潜り込みました。一生懸命に。まずMITの\nゲイリー・ゲンスラーの講義や、マイケル・セイラーが自分のことを\nマキシマリスト。金本位制を理解するために本を読みました...",
      "title": "暗号のウサギの穴にどこまで入り込むことができるだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我在今年年初进入这个领域时，它打开了我的眼睛，让我看到了一个宏观经济思维的世界。\n宏观经济思维，我深陷其中。很努力。我开始看所有麻省理工学院的\nGary Gensler的讲座，所有Micheal Saylor证明他是一个\n最大主义者。我读了一些书，试图了解金本位制，也读了一些书。",
      "title": "在加密货币的兔子洞里还能走多远？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我在今年年初進入這個領域時，它打開了我的眼睛，讓我看到了一個宏觀經濟思維的世界。\n宏觀經濟思維，我深陷其中。很努力。我開始看所有麻省理工學院的\nGary Gensler的講座，所有Micheal Saylor證明他是一個\n最大主義者。我讀了一些書，試圖瞭解金本位制，也讀了一些書。",
      "title": "在加密貨幣的兔子洞裏還能走多遠？"
    }
  ]
}