{
  "author": "Jim_Dickskin",
  "the_new_excerpt": "I've been applying to jobs and holy fuck the process is absolutely insane. You\nspend hours writing up your resume including all of your employment history,\nthen they ask you to upload the resume, then you have to re-type it in AGAIN or\neven multiple times despite it literally being the exact same…",
  "original_created_utc": 1619632474,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は仕事に応募してきましたが、その過程は全くもって狂っています。あなたは\n何時間もかけて職歴を含めた履歴書を書く。\nそして、その履歴書をアップロードするように言われ、文字通り全く同じ内容にもかかわらず、もう一度、あるいは何度も入力しなければなりません。\n何度も入力し直さなければならず、文字通り全く同じ内容にもかかわらず",
      "title": "1つの仕事のために3回も応募書類の詳細を再入力する必要がないように、すべての仕事を仲介する単一のウェブサイトが存在しないのはなぜですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在申请工作，他妈的这个过程绝对是疯狂的。你\n你花几个小时写好你的简历，包括你所有的工作经历。\n然后他们要求你上传简历，然后你必须重新输入，甚至多次输入，尽管它是完全一样的。\n甚至多次，尽管它实际上是完全相同的......",
      "title": "为什么没有一个单一的网站，所有的工作都要通过它，这样你就不必为一个工作重新输入每一个该死的申请细节3次？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在申請工作，他媽的這個過程絕對是瘋狂的。你\n你花幾個小時寫好你的簡歷，包括你所有的工作經歷。\n然後他們要求你上傳簡歷，然後你必須重新輸入，甚至多次輸入，儘管它是完全一樣的。\n甚至多次，儘管它實際上是完全相同的......",
      "title": "爲什麼沒有一個單一的網站，所有的工作都要通過它，這樣你就不必爲一個工作重新輸入每一個該死的申請細節3次？"
    }
  ],
  "title": "Why isn't there a single website that all jobs go through so you don't have to re-enter every single fucking detail of your application 3 times for one job?",
  "created_utc": 1619686612,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been applying to jobs and holy fuck the process is absolutely insane. You spend hours writing up your resume including all of your employment history, then they ask you to upload the resume, then you have to re-type it in AGAIN or even multiple times despite it literally being the exact same goddamn information you just uploaded on your resume.</p>\n\n<p>It&#39;s always:</p>\n\n<p>Find job</p>\n\n<p>Go to their website because they don&#39;t use Indeed for some stupid reason.</p>\n\n<p>Upload your resume</p>\n\n<p>Type the entire fucking thing out again on their application despite it being the exact same information you just uploaded.</p>\n\n<p>Why the fuck isn&#39;t there a single service that every business can use so we can stop this bullshit where you have to sign up for every single goddamn website separately only to re-submit the same fucking information multiple times for no apparent reason?</p>\n\n<p>It&#39;s absolutely insane and a gigantic waste of time.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/n0kn38/why_isnt_there_a_single_website_that_all_jobs_go/",
  "subreddit": "NoStupidQuestions",
  "id": "n0kn38",
  "is_self": true,
  "media": null,
  "is_video": false
}