{
  "author": "wiptheman",
  "original_created_utc": 1639459968,
  "title": "The crypto market is a wonderfully efficient mechanism for transferring wealth from the impatient to the patient.",
  "created_utc": 1639488722,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A lot of people come to the crypto market to “get rich quickly”. And although it’s possible (if you buy and sell a meme coin at the right time) I would argue most people will not get that lucky.&lt;/p&gt;\n\n&lt;p&gt;The good news is that much more people could make a lot of money in the crypto market by just being patient. Here are a couple of tips to achieve just that:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Find a crypto project who’s value you believe in for the long term (10 years or more). Ask yourself: will this coin still be useful in ten years? Understand in what you are investing. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Invest money you can afford to lose or at least money you won’t need in the short term (5 years min) so that you are not forced to sell in a potential crypto winter.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Favor Cryptos that allow staking with decent APY. And stake them for as long as you hodl them.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Since you are in for the long run, become your own bank and understand how to manage your private keys safely. Avoid the exchange failure risk.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Be patient, buy more during crypto winter or big dips and enjoy the bull market or pumps. Remember if the past is any indication cycles are driven by Bitcoin halvings and last 5 years or more.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If you need money in the future consider borrowing against your cryptos (Coinbase offers that option already) so you don’t have to sell them. This avoids a taxable event and allows you to continue benefiting from your average annual growth and staking rewards. This is called a Lombard loan and this is how the rich get super rich.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I would argue if you invest in the right cryptos the best time to sell them will be never. &lt;/p&gt;\n\n&lt;p&gt;Good luck everyone!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/rg0b0r/the_crypto_market_is_a_wonderfully_efficient/",
  "subreddit": "CryptoCurrency",
  "id": "rg0b0r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A lot of people come to the crypto market to “get rich quickly”. And although\nit’s possible (if you buy and sell a meme coin at the right time) I would argue\nmost people will not get that lucky.\n\nThe good news is that much more people could make a lot of money in the crypto\nmarket by just being…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人が「早く金持ちになりたい」と思って暗号市場にやってくる。そして、しかし\n可能である（ミームコインを適切なタイミングで売買すれば）、と私は主張する。\nほとんどの人は、そんな幸運に恵まれないでしょう。\n\n良いニュースは、もっと多くの人が暗号で大金を稼ぐことができるということです。\nということである。",
      "title": "暗号市場は、せっかちな人から我慢強い人へ富を移転させるための素晴らしく効率的なメカニズムです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很多人来到加密货币市场是为了 \"快速致富\"。而尽管\n这是有可能的（如果你在正确的时间购买和出售一个纪念币），我认为\n大多数人不会那么幸运。\n\n好消息是，更多的人可以在加密货币市场上赚很多钱。\n市场上赚大钱，只需...",
      "title": "加密货币市场是一个奇妙的高效机制，将财富从没有耐心的人手中转移到病人手中。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多人來到加密貨幣市場是爲了 \"快速致富\"。而儘管\n這是有可能的（如果你在正確的時間購買和出售一個紀念幣），我認爲\n大多數人不會那麼幸運。\n\n好消息是，更多的人可以在加密貨幣市場上賺很多錢。\n市場上賺大錢，只需...",
      "title": "加密貨幣市場是一個奇妙的高效機制，將財富從沒有耐心的人手中轉移到病人手中。"
    }
  ]
}