{
  "author": "sisushkaa",
  "original_created_utc": 1642957116,
  "title": "Why is feeding your children junk 24/7 &amp; making them morbidly obese not seen as child abuse?",
  "created_utc": 1642977372,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;for context, I live in Canada so what I&amp;#39;m gonna say may differ from country to country. but here, it&amp;#39;s not something many people see as child abuse.&lt;/p&gt;\n\n&lt;p&gt;they usually jump right to &amp;quot;well parents are stessed&amp;quot; &amp;quot;the kid is just naturally like that&amp;quot; etc etc. which to an extent, I understand. some people have medical conditions that make them gain weight easier, parenting can be stressful, etc etc. but there&amp;#39;s a huge difference between feeding your child shit 3 nights a week because your stressed vs always feeding them garbage and completely neglecting their health.&lt;/p&gt;\n\n&lt;p&gt;if you&amp;#39;re too stressed to never feed your child properly and set them up with a huge amount of health problems, you shouldn&amp;#39;t be a parent. it&amp;#39;s never the child&amp;#39;s fault that they&amp;#39;re obese, and yall have watered down the severe effects of obesity to where you think it&amp;#39;s not a big deal (especially on young people).&lt;/p&gt;\n\n&lt;p&gt;a great example is my family. they&amp;#39;re all obese, all have a lot of health problems caused by their obesity, and they have pushed it onto their children. my brother was 200lbs at age of 12, all we had was junk food. the only reason I didn&amp;#39;t end up there was because I was with my dad most of the time. &lt;/p&gt;\n\n&lt;p&gt;we grew up really poor, I&amp;#39;m talking $500 a month for a family of 3 in an expensive city. but that&amp;#39;s still no excuse. whenever I was given money to go out and buy stuff for food, I would always be able to bring back healthier foods for the same price. you have to look for the sales and browse through many stores, but it&amp;#39;s worth it.&lt;/p&gt;\n\n&lt;p&gt;not to mention the large amount of bullying you&amp;#39;re subjecting your child too. children are cruel, no &amp;quot;body positivity&amp;quot; stuff you tell them will stop them from bullying. and it&amp;#39;s all your fault as the parent. it&amp;#39;s so incredibly heartbreaking.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/say2js/why_is_feeding_your_children_junk_247_making_them/",
  "subreddit": "TooAfraidToAsk",
  "id": "say2js",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "for context, I live in Canada so what I'm gonna say may differ from country to\ncountry. but here, it's not something many people see as child abuse.\n\nthey usually jump right to \"well parents are stessed\" \"the kid is just naturally\nlike that\" etc etc. which to an extent, I understand. some people…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はカナダに住んでいますので、国によって異なるかもしれませんが、ご了承ください。\nしかし、ここでは、多くの人が児童虐待と見なすことはありません。\n\n親は我慢している」「子供は生まれつきのものだ」と言うのが一般的です。\nある程度は理解できるけど、人によっては...。",
      "title": "なぜ、24時間365日ジャンクを食べさせ、病的なまでに肥満させることが、児童虐待と見なされないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为了说明情况，我住在加拿大，所以我要说的可能因国家而异。\n但在这里，很多人不认为这是虐待儿童。\n\n他们通常会直接跳到 \"父母是被强迫的\"\"孩子是天生的 \"等等。\n在某种程度上，我理解这一点。",
      "title": "为什么24小时不间断地给孩子喂食垃圾，使他们病态地肥胖，却不被视为虐待儿童？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲了說明情況，我住在加拿大，所以我要說的可能因國家而異。\n但在這裏，很多人不認爲這是虐待兒童。\n\n他們通常會直接跳到 \"父母是被強迫的\"\"孩子是天生的 \"等等。\n在某種程度上，我理解這一點。",
      "title": "爲什麼24小時不間斷地給孩子餵食垃圾，使他們病態地肥胖，卻不被視爲虐待兒童？"
    }
  ]
}