{
  "author": "LandOfMunch",
  "the_new_excerpt": "Anyone have an update on Oatly IPO date and valuation? Have been a fan for years\npatiently waiting until I can invest.\n\nFrom Yahoo. March 2nd - Sweden-based Havre Global said Feb. 24 that it will list\nits stock. Investors waiting on the sidelines for further IPO details and\nconfirmation of the true…",
  "original_created_utc": 1616453579,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "谁有欧特丽IPO日期和估值的最新消息？多年来一直是我的粉丝\n耐心等待，直到我可以投资。\n\n来自雅虎。3月2日消息，总部位于瑞典的Havre Global公司2月24日表示，将在上市的\n其股票。投资者在观望中等待进一步的IPO细节和\n确证",
      "title": "奥特利IPO日期？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "誰有歐特麗IPO日期和估值的最新消息？多年來一直是我的粉絲\n耐心等待，直到我可以投資。\n\n來自雅虎。3月2日消息，總部位於瑞典的Havre Global公司2月24日表示，將在上市的\n其股票。投資者在觀望中等待進一步的IPO細節和\n確證",
      "title": "奧特利IPO日期？"
    }
  ],
  "title": "Oatly IPO date?",
  "created_utc": 1616489976,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Anyone have an update on Oatly IPO date and valuation? Have been a fan for years patiently waiting until I can invest. </p>\n\n<p>From Yahoo. March 2nd - Sweden-based Havre Global said Feb. 24 that it will list its stock. Investors waiting on the sidelines for further IPO details and confirmation of the true market size for milk substitutes may have had their questions answered.</p>\n\n<p>Starbucks confirmed Monday that all of its stores nationwide will offer guests the option of adding Oatly&#39;s non-dairy milk substitute product as of Tuesday. The oat-based milk can be included in all of Starbucks&#39; spring menu options.</p>\n\n<p>Oatly&#39;s IPO details will likely be presented to the public in the coming weeks. The company could be seeking a $10-billion valuation in an eventual listing.\n————————————————————————\nAlso:</p>\n\n<p>PRNewsWire included Oatly among its top oat milk brands, with other competitors in the market being Happy Planet Foods Inc., Danone (Silk), and Earth’s Own Food Company. In 2019, the global oat milk market size was $360.5 million. By 2027, that figure is projected to grow to $995.3 million. </p>\n\n<p>One reason for oat milk’s increase in popularity is that it is often fortified with calcium and vitamin D, helping create a balanced diet for vegans and those with lactose intolerance. A greater acceptance of vegan lifestyles is also a factor. Oat-based dairy replacements have also grown in popularity because data suggest they have a lower environmental impact than some other plant-based milks, such as almond and cashew milk.</p>\n</div><!-- SC_ON -->",
  "score": 45,
  "permalink": "/r/stocks/comments/mb08se/oatly_ipo_date/",
  "subreddit": "stocks",
  "id": "mb08se",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752822093
}