{
  "author": "Matteustheone",
  "the_new_excerpt": "Honestly, if there is anything that will speed up adoption of crypto, it’s the\ncrooked banks. We live in Germany, we’re we are now being charged 11 bucks\nmonthly to even own a checking account. Not to mention the constant micro fees\nfor every freaking single action taken. Every year I get a bank…",
  "original_created_utc": 1624055463,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正直なところ、暗号の導入を加速させるものがあるとすれば、それは\n歪んだ銀行です。私たちはドイツに住んでいますが、当座預金を持つだけで毎月11ドルを請求されています。\n当座預金を持つだけで毎月11ドルを請求されます。言うまでもなく、何かするたびに小額の手数料がかかります。\n何をするにも小額の手数料がかかります。毎年、私は銀行から...",
      "title": "銀行は自ら墓穴を掘っているのだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "老实说，如果有什么东西会加速加密货币的采用，那就是那些\n腐败的银行。我们住在德国，我们现在被收取11美元的费用\n甚至拥有一个支票账户。更不用说不断的小额费用\n每一个该死的单一行动。每年我都会收到银行的通知。",
      "title": "银行是在自掘坟墓!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "老實說，如果有什麼東西會加速加密貨幣的採用，那就是那些\n腐敗的銀行。我們住在德國，我們現在被收取11美元的費用\n甚至擁有一個支票賬戶。更不用說不斷的小額費用\n每一個該死的單一行動。每年我都會收到銀行的通知。",
      "title": "銀行是在自掘墳墓!"
    }
  ],
  "title": "Banks are digging their own graves!",
  "created_utc": 1624069834,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Honestly, if there is anything that will speed up adoption of crypto, it’s the crooked banks. \nWe live in Germany, we’re we are now being charged 11 bucks monthly to even own a checking account. Not to mention the constant micro fees for every freaking single action taken. \nEvery year I get a bank statement with all the fees from the passing year are listed. \nIn 2020 I spend $700 USD on fees! \nIn the mean time, my bank is building huge extravagant offices and paying their Executive brass millions in bonuses.<br/>\nThe banking system is broken. \nIf only crypto would have a better reputation, if people would just understand how crypto can free them from being scammed out of their hard earned cash, adaption would be imminent.<br/>\nAs Crypto fans, we need to stop talking about “Lambos and moonshots”, and start talking about the crypto technologies, that can change humanity forever.</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/o31xzh/banks_are_digging_their_own_graves/",
  "subreddit": "CryptoCurrency",
  "id": "o31xzh",
  "is_self": true,
  "media": null,
  "is_video": false
}