{
  "author": "DetroitMotorShow",
  "original_created_utc": 1632137591,
  "title": "Today 2 other Chinese real estate companies collapsed. This is a big BUST! It is clear why China banned crypto - CCP could never let their people use crypto and get out of this crisis.",
  "created_utc": 1632173422,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you thought Evergrande was the only one in trouble, there has been some big news today.</p>\n\n<p>2 other Chinese property developers have collapsed today</p>\n\n<p><a href=\"https://preview.redd.it/l7tqcsx88no71.jpg?width=1440&amp;format=pjpg&amp;auto=webp&amp;s=46ab6b03edcb3672172a5d882e241ccd24740458\">Property developer Sinic Holdings (Group) Co Ltd crashed 87&#37; today and trading was halted completely.</a></p>\n\n<p><a href=\"https://preview.redd.it/yzud6puf8no71.jpg?width=1504&amp;format=pjpg&amp;auto=webp&amp;s=95bfdc09e91fda2bc4be49a55fabc7075af803fa\">Another one Guangzhou R&amp;F Properties Co Ltd seems to be following route</a></p>\n\n<p>According to market analyst Henrik Zeberg, 7 out of 10 largest Chinese Real Estate companies are on the verge of collapse.</p>\n\n<p>Remember China kicked out crypto completely just months ago. Many were trying to find reasons for that, but no one was able to pin point anything conclusive. Sure ban trading, but why remove Bitcoin mining which was contributing a huge portion back to the Chinese economy? Why hunt down traders who were paying their fair share of taxes? Why seize and confiscate mining equipment? </p>\n\n<p>Now it is becoming clear - the Chinese economic collapse was well underway and the government didnt want people to have an alternate escape route. With crypto, including miners, they could easily convert their investments and savings and escape this big bust. By shutting crypto down completely, the CCP has ensured that whatever misery now engulfs the Chinese economy, the people will not have an easy way out. </p>\n\n<p>To get out of this mess, the CCP will have to devalue their currency massively, plunging people into poverty and rendering their savings worthless. If they had access to crypto, they could have saved themselves. CCP made sure this option wasnt available to them.</p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/CryptoCurrency/comments/prsypq/today_2_other_chinese_real_estate_companies/",
  "subreddit": "CryptoCurrency",
  "id": "prsypq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If you thought Evergrande was the only one in trouble, there has been some big\nnews today.\n\n2 other Chinese property developers have collapsed today\n\nProperty developer Sinic Holdings (Group) Co Ltd crashed 87% today and trading\nwas halted…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "困っているのはEvergrandeだけではないと思っていたら、今日は大きなニュースがありました。\n今日は大きなニュースがありました。\n\n他の2つの中国の不動産開発会社が今日、崩壊しました\n\n不動産開発会社のSinic Holdings (Group) Co Ltdは、本日87%の暴落を起こし、取引が停止されました。\n取引が停止された...",
      "title": "今日、他の2つの中国の不動産会社が崩壊しました。これは大きなBUSTです。中国が暗号を禁止した理由は明らかだ。中国共産党は国民に暗号を使わせて、この危機から抜け出すことはできなかった。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你认为恒大是唯一陷入困境的公司，那么今天有一些重大的消息。\n今天的新闻。\n\n今天还有两家中国房地产开发商倒闭了\n\n房地产开发商中粮控股（集团）有限公司今天暴跌87%，并停止交易。\n被停止交易...",
      "title": "今天，还有两家中国房地产公司倒闭了。这是一个巨大的灾难! 很明显，中国为什么禁止加密货币--中国共产党永远不可能让他们的人民使用加密货币并摆脱这场危机。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你認爲恆大是唯一陷入困境的公司，那麼今天有一些重大的消息。\n今天的新聞。\n\n今天還有兩家中國房地產開發商倒閉了\n\n房地產開發商中糧控股（集團）有限公司今天暴跌87%，並停止交易。\n被停止交易...",
      "title": "今天，還有兩家中國房地產公司倒閉了。這是一個巨大的災難! 很明顯，中國爲什麼禁止加密貨幣--中國共產黨永遠不可能讓他們的人民使用加密貨幣並擺脫這場危機。"
    }
  ]
}