{
  "author": "2bcompany",
  "original_created_utc": 1628855046,
  "title": "Simple guide to Smart Contracts",
  "created_utc": 1628904608,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As ADA is set to finally get smart contracts I found it fit to try and make a simple and understandable guide as to how smart contracts work, what they do and why they’re regarded as beneficial.</p>\n\n<p>How Smart Contracts work:</p>\n\n<p>The fundamentals of a smart contract is quite easy to explain. They’re programs on the blockchain (made up by code) that executes certain actions when specific predetermined conditions are met and have been verified. Simply put the contracts works by “If/when…then…” statements. They can also be described as self-executing contracts written into lines of code that binds two or more people on predetermined agreements while also excluding an centralized authority, legal system or other external enforcement mechanism. </p>\n\n<p>The benefits of Smart Contracts:</p>\n\n<p>So why use smart contracts? Why not just have a third party confirm a transaction or some other mechanism? Well, simply put, it takes more time, costs more money, isn’t as trustworthy and is prone to human error and/or manipulation. </p>\n\n<p>Smart contracts are set on predetermined conditions met by both parties of the contracts meaning that when a conditions is met the contract executes automatically. You don’t need to file any paperwork and no third party needs to be involved, it’s efficient. That also leads to the other beneficial part, all transactions are transparent  because encrypted records of all transactions are shared across the participants. Encrypted records also means better protection from hackers, especially when every record on a distributed ledger is connected to each other. You would have to hack an entire chain of records just to change one and that’s not easy.</p>\n\n<p>Summary/TL:DR</p>\n\n<p>So, to summarize, smart contracts bring more efficiency, more security, more transparency and cost less. The one drawback it can have is the risk of having bad coding, but with ADA I don’t really think that will be an issue!</p>\n\n<p>Hope you guys learned something from this and take care!</p>\n\n<p>Sources:\n- <a href=\"https://www.ibm.com/topics/smart-contracts\">https://www.ibm.com/topics/smart-contracts</a>\n- <a href=\"https://blockgeeks.com/guides/smart-contracts/\">https://blockgeeks.com/guides/smart-contracts/</a>\n- <a href=\"https://www.investopedia.com/terms/s/smart-contracts.asp\">https://www.investopedia.com/terms/s/smart-contracts.asp</a></p>\n\n<p>Ps. If the format is a bit weird it’s because I’m writing this on mobile. Might delete and repost if it’s a big issue for people.</p>\n</div><!-- SC_ON -->",
  "score": 211,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/IVsJDLaKzpDDNc9xYOV6y0dhz4UL2MZUovLmfY13zuk.jpg?auto=webp&s=6243d415f5cd922924a097c7706ea7d0b8c2a0c7",
          "width": 671,
          "height": 503
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/IVsJDLaKzpDDNc9xYOV6y0dhz4UL2MZUovLmfY13zuk.jpg?width=108&crop=smart&auto=webp&s=019e71bbf96aa1faecfd658602f5871961ec5ebd",
            "width": 108,
            "height": 80
          },
          {
            "url": "https://external-preview.redd.it/IVsJDLaKzpDDNc9xYOV6y0dhz4UL2MZUovLmfY13zuk.jpg?width=216&crop=smart&auto=webp&s=4ec99d2c5ab8122cbc9c4cbed7071fe9c2390667",
            "width": 216,
            "height": 161
          },
          {
            "url": "https://external-preview.redd.it/IVsJDLaKzpDDNc9xYOV6y0dhz4UL2MZUovLmfY13zuk.jpg?width=320&crop=smart&auto=webp&s=230cf150c3102461bea7e65186b00089f399a18b",
            "width": 320,
            "height": 239
          },
          {
            "url": "https://external-preview.redd.it/IVsJDLaKzpDDNc9xYOV6y0dhz4UL2MZUovLmfY13zuk.jpg?width=640&crop=smart&auto=webp&s=4ce0a05e477c25c978e4f52d43d3a19058575993",
            "width": 640,
            "height": 479
          }
        ],
        "variants": {},
        "id": "cBgRUfgpUyYFsmCYqWG3YjMPJjmRRr-nsy4qfayUVkY"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/p3lps6/simple_guide_to_smart_contracts/",
  "subreddit": "CryptoCurrency",
  "id": "p3lps6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As ADA is set to finally get smart contracts I found it fit to try and make a\nsimple and understandable guide as to how smart contracts work, what they do and\nwhy they’re regarded as beneficial.\n\nHow Smart Contracts work:\n\nThe fundamentals of a smart contract is quite easy to explain. They’re…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ADAがついにスマートコントラクトを導入することになったので、スマートコントラクトがどのように機能するのか、シンプルでわかりやすいガイドを作ってみようと思いました。\nスマートコントラクトがどのように機能するのか、何をするのか、そしてなぜスマートコントラクトが\nスマートコントラクトの仕組み、役割、メリットとされる理由をわかりやすく解説します。\n\nスマートコントラクトの仕組み\n\nスマートコントラクトの基本を説明するのはとても簡単です。それは...",
      "title": "スマートコントラクトの簡単な説明"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "由于ADA最终将获得智能合约，我发现它适合尝试并制作一个\n简单易懂的指南，介绍智能合约如何工作，它们的作用和\n为什么它们被认为是有益的。\n\n智能合约是如何工作的。\n\n智能合约的基本原理是很容易解释的。它们是...",
      "title": "智能合约的简单指南"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "由於ADA最終將獲得智能合約，我發現它適合嘗試並製作一個\n簡單易懂的指南，介紹智能合約如何工作，它們的作用和\n爲什麼它們被認爲是有益的。\n\n智能合約是如何工作的。\n\n智能合約的基本原理是很容易解釋的。它們是...",
      "title": "智能合約的簡單指南"
    }
  ]
}