{
  "author": "acharismaticjeweller",
  "original_created_utc": 1633256821,
  "title": "Was New York in the 70s as sleazy and corrupt as it's depicted in Martin Scorsese's Taxi Driver (1976)?",
  "created_utc": 1633267625,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I absolutely don&#39;t mean to offend anyone with this question. I&#39;m a non-American and &#39;Taxi Driver&#39; is my favorite movie of all-time and I was wondering to what extent it was accurate in it&#39;s synchronic<br/>\ndepiction of New York as a crime-riddled, seedy and morally repulsive place. I&#39;m also curious as to why it was New York in particular that was affected this way as opposed to other American cities.</p>\n</div><!-- SC_ON -->",
  "score": 207,
  "permalink": "/r/AskHistorians/comments/q0f6rb/was_new_york_in_the_70s_as_sleazy_and_corrupt_as/",
  "subreddit": "AskHistorians",
  "id": "q0f6rb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I absolutely don't mean to offend anyone with this question. I'm a non-American\nand 'Taxi Driver' is my favorite movie of all-time and I was wondering to what\nextent it was accurate in it's synchronic\ndepiction of New York as a crime-riddled, seedy and morally repulsive place. I'm\nalso curious as to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この質問で誰かを怒らせるつもりは全くありません。私はアメリカ人ではありません。\n私はアメリカ人ではありませんが、「タクシードライバー」は私の大好きな映画です。\nはどこまで正確なのかと思っていました。\nニューヨークが犯罪にまみれた薄汚い、道徳的に嫌な場所であるという描写がどの程度正確なのか気になりました。私は\nさらに興味があるのは...",
      "title": "70年代のニューヨークは、マーティン・スコセッシ監督の『タクシードライバー』（1976年）で描かれているように、いかがわしい、腐敗した街だったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我绝对不是想用这个问题来冒犯任何人。我是一个非美国人\n出租车司机》是我一直以来最喜欢的电影，我想知道在什么程度上\n我想知道它在多大程度上对纽约的同步描述是准确的？\n我想知道它对纽约作为一个犯罪猖獗、肮脏和道德上令人厌恶的地方的同步描述有多准确。我\n我也很好奇...",
      "title": "70年代的纽约是否像马丁-斯科塞斯的《出租车司机》（1976）中描绘的那样肮脏和腐败？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我絕對不是想用這個問題來冒犯任何人。我是一個非美國人\n出租車司機》是我一直以來最喜歡的電影，我想知道在什麼程度上\n我想知道它在多大程度上對紐約的同步描述是準確的？\n我想知道它對紐約作爲一個犯罪猖獗、骯髒和道德上令人厭惡的地方的同步描述有多準確。我\n我也很好奇...",
      "title": "70年代的紐約是否像馬丁-斯科塞斯的《出租車司機》（1976）中描繪的那樣骯髒和腐敗？"
    }
  ]
}