{
  "author": "hippoctopocalypse",
  "the_new_excerpt": "I tried this a while ago, though I was throwing the money at options on\nrobinhood, just to give myself something to do. Needless to say, it didn't work\nout. I blew a bunch of money and started smoking again just a few months later.\n\nNow, though, I feel like it's different. I'm honestly looking for a…",
  "original_created_utc": 1613869193,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "前段时间我试了一下，虽然我是把钱扔在期权上的。\nRobinhood，只是为了给自己找点事做。不用说，这并不奏效\n出。我吹了一堆钱，几个月后又开始抽烟。\n\n现在，虽然，我觉得它是不同的。老实说，我在寻找一个... ...",
      "title": "我正在戒烟，每周用买烟的钱买比特币."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "前段時間我試了一下，雖然我是把錢扔在期權上的。\nRobinhood，只是爲了給自己找點事做。不用說，這並不奏效\n出。我吹了一堆錢，幾個月後又開始抽菸。\n\n現在，雖然，我覺得它是不同的。老實說，我在尋找一個... ...",
      "title": "我正在戒菸，每週用買菸的錢買比特幣."
    }
  ],
  "title": "I'm quitting smoking and buying Bitcoin every week with what I would've spent on cigarettes.",
  "created_utc": 1613882102,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I tried this a while ago, though I was throwing the money at options on robinhood, just to give myself something to do. Needless to say, it didn&#39;t work out. I blew a bunch of money and started smoking again just a few months later.</p>\n\n<p>Now, though, I feel like it&#39;s different. I&#39;m honestly looking for a way to give myself a comfortable future. I&#39;m a felon bartender with a useless degree, and the pittance of a contribution to my 401k my paychecks provide is just mathematically insignificant. What&#39;s clear to me is that I&#39;m perfectly happy literally burning my money, so I shouldn&#39;t have any trouble spending the same amount on something with real appreciating value -- <em>my future well-being</em>. And Bitcoin, of course.</p>\n\n<p>Wish me luck.</p>\n</div><!-- SC_ON -->",
  "score": 5841,
  "permalink": "/r/Bitcoin/comments/lolbr0/im_quitting_smoking_and_buying_bitcoin_every_week/",
  "subreddit": "Bitcoin",
  "id": "lolbr0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332871867
}