{
  "author": "juanjux",
  "the_new_excerpt": "Little story time:\n\nI discovered Bitcoin at its infancy, in 2009, via Slashdot. At the time, I saw\nit as a funny stupid think (magic Internet coins!) and downloaded the wallet\nand, being the nerd I am, mined some blocks on my puny 2011 CPU at my parents\ncomputer. I actually mined A LOT of blocks,…",
  "original_created_utc": 1618395317,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "小話の時間です。\n\n私がビットコインを知ったのは、2009年の黎明期で、スラッシュドット経由でした。当時の私は、これを\nウォレットをダウンロードして、オタクの私は自分のダジャレでいくつかのブロックを採掘しました。\nそして、オタクの私は、両親のコンピュータにあった2011年製のちっぽけなCPUでいくつかのブロックを採掘しました。\n私はオタクです。実際にはたくさんのブロックを採掘しましたが...",
      "title": "私の失敗から学んでください。自分の月に到達したとしても、決してすべてのスタックを売ってはいけない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "小故事时间。\n\n我在2009年发现了比特币的雏形, 通过Slashdot. 当时，我看到\n它作为一个有趣的愚蠢的想法（神奇的互联网硬币！），并下载了钱包。\n而且，作为书呆子的我，在我父母那里，在我那小气的2011年CPU上挖了一些块。\n电脑。其实我挖了很多块，... ...",
      "title": "从我的错误中学习。永远不要卖掉你所有的堆栈 即使你达到你的个人月亮。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "小故事時間。\n\n我在2009年發現了比特幣的雛形, 通過Slashdot. 當時，我看到\n它作爲一個有趣的愚蠢的想法（神奇的互聯網硬幣！），並下載了錢包。\n而且，作爲書呆子的我，在我父母那裏，在我那小氣的2011年CPU上挖了一些塊。\n電腦。其實我挖了很多塊，... ...",
      "title": "從我的錯誤中學習。永遠不要賣掉你所有的堆棧 即使你達到你的個人月亮。"
    }
  ],
  "title": "Learn from my errors: NEVER sell all your stack even if you reach your personal moon.",
  "created_utc": 1618411520,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Little story time:</p>\n\n<p>I discovered Bitcoin at its infancy, in 2009, via Slashdot. At the time, I saw it as a funny stupid think (magic Internet coins!) and downloaded the wallet and, being the nerd I am, mined some blocks on my puny 2011 CPU at my parents computer. I actually mined A LOT of blocks, since I forgot I had the miner running. At 50 BTC per block, we are speaking about hundreds of Bitcoins, with no pool involved! Then, another day, I saw another Bitcoin article on Slashdot and one of the comments said he would buy Bitcoins. At the time, I didn&#39;t really think Bitcoin was going to be anything more than a funny experiment so, via Paypal, I sold all my coins to this guy (who I thought at the time must be stupid). This allowed me to pay for some small holiday with my girlfriend. I also stopped mining.</p>\n\n<p>Had I kept 10% of my stack, I would be fucking rich today.</p>\n\n<p>Jump forward to 2013 and I read about Bitcoin crazy volatility. Well, I said, where there is volatility there can be profit, so I started trading Bitcoins and doing some nice gains. At some point I stopped trading in <a href=\"https://bitcoin.de\">bitcoin.de</a> and kept around 500 BTC (most of them earned trough trading, I bought maybe 100 at an average buy price of a whooping 9 euros) for some time, but when they reached above 30 euros about a year later, I decided to sell them to get a nice new car.</p>\n\n<p>Had I kept 10% of my stack, I would had a VERY comfortable financial independence today.</p>\n\n<p>I went back to Bitcoin in 2017 and have been DCA&#39;ing since them (both in Bitcoin and other coins I really like technologically like Ethereum, Monero and Nano). I sold a little of my stack in this bull run mostly to cover my investment in my latest three years and have a little personal reward for painfully HODLing trough the ice age, but I still keep most of my stack. This time my moon is clear and ambitious: financial independence and not having to sell my work to others, which I estimate I can reach, before taxes, with about one million euros. I&#39;m very, very far away from that target but I have high hopes for the next post-halvenings so I continue slowly buying. Anyway, I learned from my errors and even if I reach that target I&#39;m NOT selling everything again. Will kept 10% of whatever amount I have at least until some huge necessity required me to sell it.</p>\n\n<p><strong>TL;DR never sell all your stack, no matter if you think you have reached your personal moon.</strong></p>\n</div><!-- SC_ON -->",
  "score": 587,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/gXK7N5t0gsJSEhcDBp66eMNgW12MCMZG2SQ2Lb9iDL0.jpg?auto=webp&s=c17d7872eeb474c14addea95321c61555030ec34",
          "width": 250,
          "height": 250
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/gXK7N5t0gsJSEhcDBp66eMNgW12MCMZG2SQ2Lb9iDL0.jpg?width=108&crop=smart&auto=webp&s=d70d013f25570af7c795bd324a9f737815837de0",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/gXK7N5t0gsJSEhcDBp66eMNgW12MCMZG2SQ2Lb9iDL0.jpg?width=216&crop=smart&auto=webp&s=4887858f0d3ed714f9f4bb861a83d61b2334c3e0",
            "width": 216,
            "height": 216
          }
        ],
        "variants": {},
        "id": "vXBBAzCVQ2psA-YQTwaiYL9G5OySsqrkMxrYtxFjw5U"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/mqnkx1/learn_from_my_errors_never_sell_all_your_stack/",
  "subreddit": "CryptoCurrency",
  "id": "mqnkx1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566615683
}