{
  "author": "PolloDiablo82",
  "the_new_excerpt": "If you post anything on the crypto related forums indicating that you are new,\nyou will get dm's from people wanting to \"help\" you out. These are off course\nscams. And if you have ANY doubt if it maybe a scam but you are not sure.... its\na scam!\n\nSome returning stories;\n\nI have a site that gives…",
  "original_created_utc": 1622903762,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号関連のフォーラムに新参者であることを示す投稿をすると\nあなたを「助けたい」と思っている人たちからDMを受け取るでしょう。これらはもちろん\n詐欺です。詐欺ではないかと少しでも思ったら、....。\n詐欺だ!\n\nいくつかのリターンストーリー。\n\n私のサイトでは...",
      "title": "すべてのクリプトノーブへの警告"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你在加密货币相关论坛上发布任何信息，表明你是新来的。\n你就会收到想要 \"帮助 \"你的人发来的备忘录。这些当然是\n骗局。如果你有任何疑问，如果它可能是一个骗局，但你不确定....。\n骗局!\n\n一些返回的故事。\n\n我有一个网站，提供...",
      "title": "警告所有的隐居者"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你在加密貨幣相關論壇上發佈任何信息，表明你是新來的。\n你就會收到想要 \"幫助 \"你的人發來的備忘錄。這些當然是\n騙局。如果你有任何疑問，如果它可能是一個騙局，但你不確定....。\n騙局!\n\n一些返回的故事。\n\n我有一個網站，提供...",
      "title": "警告所有的隱居者"
    }
  ],
  "title": "A warning to all cryptonoobs",
  "created_utc": 1622933650,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you post anything on the crypto related forums indicating that you are new, you will get dm&#39;s from people wanting to &quot;help&quot; you out. These are off course scams. And if you have ANY doubt if it maybe a scam but you are not sure.... its a scam!</p>\n\n<p>Some returning stories;</p>\n\n<p>I have a site that gives (xx) percent on all your coins!</p>\n\n<p>I am (or have a friend) that manages crypto let me help you out!</p>\n\n<p>Click this link to go to my broker site I own I can give you a discount!</p>\n\n<p>They always ask for your WhatsApp (aka your phone number!) Never give your number or adress or any personal information to ANYONE who dm&#39;s you as a base rule.</p>\n\n<p>I&#39;m sure this info is hidden away in a sticky somewhere but I have to deal with this so much and there are a lot of new people coming so I just had to speak up for a bit.  Friendly greetings and watch out.</p>\n</div><!-- SC_ON -->",
  "score": 209,
  "permalink": "/r/Bitcoin/comments/nsx36n/a_warning_to_all_cryptonoobs/",
  "subreddit": "Bitcoin",
  "id": "nsx36n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404877359
}