{
  "author": "Lich_Hegemon",
  "original_created_utc": 1655203441,
  "title": "The manga \"Isaak\" tells the story of a Japanese man fighting in Europe during the 30 years war. Do we know of any Japanese warriors or people who made their way to Europe and lived there during this period?",
  "created_utc": 1655245062,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If not, is the idea itself realistic? It is mentioned that the man traveled from Japan through Jakarta to Holland in a trip that took about a year.&lt;/p&gt;\n\n&lt;p&gt;Would people from the HRE have been aware of Japan or heard stories about it though the Dutch?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/vc0nlq/the_manga_isaak_tells_the_story_of_a_japanese_man/",
  "subreddit": "AskHistorians",
  "id": "vc0nlq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If not, is the idea itself realistic? It is mentioned that the man traveled from\nJapan through Jakarta to Holland in a trip that took about a year.\n\nWould people from the HRE have been aware of Japan or heard stories about it\nthough the Dutch?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そうでないとしたら、そのアイデア自体が現実的なのでしょうか？その人は、日本からジャカルタを経てオランダまで、約1年かけて旅をしたと書かれています。\n日本からジャカルタを経てオランダまで、約1年かけて旅をしたとある。\n\nHREの人たちは日本を知っていたのだろうか、オランダ人から日本の話を聞いたのだろうか。\nを聞いただろうか？",
      "title": "漫画「イザーク」は、30年戦争のヨーロッパで戦う日本人の物語です。この時代にヨーロッパに渡り、生活した日本人の戦士や人物はいるのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果不是，这个想法本身是否现实？书中提到，这个人从\n经由雅加达到荷兰，历时约一年。\n\n来自HRE的人是否知道日本或听说过关于它的故事？\n报道过吗？",
      "title": "漫画《Isaak》讲述了30年战争期间一个日本人在欧洲作战的故事。我们是否知道在这一时期有任何日本武士或人前往欧洲并在那里生活？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果不是，這個想法本身是否現實？書中提到，這個人從\n經由雅加達到荷蘭，歷時約一年。\n\n來自HRE的人是否知道日本或聽說過關於它的故事？\n報道過嗎？",
      "title": "漫畫《Isaak》講述了30年戰爭期間一個日本人在歐洲作戰的故事。我們是否知道在這一時期有任何日本武士或人前往歐洲並在那裏生活？"
    }
  ]
}