{
  "author": "AchuTMM",
  "original_created_utc": 1651231782,
  "title": "Why does the internet have a strong presence of Americans?",
  "created_utc": 1651248657,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I live in Asia (GMT+8), they are half way across the world but I still see quite a lot of American presence. The thing I noticed is that other online users assume that I am American (or any person outside of the US for that matter) without any sort of confirmation or evidence. All the units used online is also American, USD, Fahrenheit, Foot, Inches. I have to specify to other internet users that I dont use USD or any of the listed units. Its as if I am the only non-American on the Internet.   &lt;/p&gt;\n\n&lt;p&gt;I barely meet any person outside of the US even though most of the day time for me is night for them. Occasionally I meet an Indian or a European but its very rare.   &lt;/p&gt;\n\n&lt;p&gt;Another thing I saw is that Americans casually use &amp;quot;Republican&amp;quot; or &amp;quot;Democrat&amp;quot; to describe someone or something bad. Like don&amp;#39;t know either of it and I&amp;#39;m pretty sure people outside of the USA wouldn&amp;#39;t know either.  &lt;/p&gt;\n\n&lt;p&gt;One glaring example is &lt;a href=\"/r/Politics\"&gt;r/Politics&lt;/a&gt; when I first typed it out on the search bar I thought I would be greeted with International Politics and News but turns out its just yet another American thing.   &lt;/p&gt;\n\n&lt;p&gt;Like I don&amp;#39;t get it, why is everything on the internet about the USA?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/uejsvd/why_does_the_internet_have_a_strong_presence_of/",
  "subreddit": "TooAfraidToAsk",
  "id": "uejsvd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I live in Asia (GMT+8), they are half way across the world but I still see quite\na lot of American presence. The thing I noticed is that other online users\nassume that I am American (or any person outside of the US for that matter)\nwithout any sort of confirmation or evidence. All the units used…"
}