{
  "author": "AchuTMM",
  "original_created_utc": 1651231782,
  "title": "Why does the internet have a strong presence of Americans?",
  "created_utc": 1651248657,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I live in Asia (GMT+8), they are half way across the world but I still see quite a lot of American presence. The thing I noticed is that other online users assume that I am American (or any person outside of the US for that matter) without any sort of confirmation or evidence. All the units used online is also American, USD, Fahrenheit, Foot, Inches. I have to specify to other internet users that I dont use USD or any of the listed units. Its as if I am the only non-American on the Internet.   &lt;/p&gt;\n\n&lt;p&gt;I barely meet any person outside of the US even though most of the day time for me is night for them. Occasionally I meet an Indian or a European but its very rare.   &lt;/p&gt;\n\n&lt;p&gt;Another thing I saw is that Americans casually use &amp;quot;Republican&amp;quot; or &amp;quot;Democrat&amp;quot; to describe someone or something bad. Like don&amp;#39;t know either of it and I&amp;#39;m pretty sure people outside of the USA wouldn&amp;#39;t know either.  &lt;/p&gt;\n\n&lt;p&gt;One glaring example is &lt;a href=\"/r/Politics\"&gt;r/Politics&lt;/a&gt; when I first typed it out on the search bar I thought I would be greeted with International Politics and News but turns out its just yet another American thing.   &lt;/p&gt;\n\n&lt;p&gt;Like I don&amp;#39;t get it, why is everything on the internet about the USA?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/uejsvd/why_does_the_internet_have_a_strong_presence_of/",
  "subreddit": "TooAfraidToAsk",
  "id": "uejsvd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I live in Asia (GMT+8), they are half way across the world but I still see quite\na lot of American presence. The thing I noticed is that other online users\nassume that I am American (or any person outside of the US for that matter)\nwithout any sort of confirmation or evidence. All the units used…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はアジア（GMT+8）に住んでいるので、彼らは地球の裏側にいるのですが、それでもかなり\nを見ることができます。私が気づいたことは、他のオンラインユーザーは、私がアメリカ人\n私がアメリカ人（あるいはアメリカ以外の人）だと思い込んでいることです。\nと思い込んでいることです。使用する単位はすべて...",
      "title": "なぜ、インターネットはアメリカ人が強いのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我住在亚洲（GMT+8），他们在地球的另一端，但我仍然看到相当多的美国人。\n很多美国人的存在。我注意到的一点是，其他在线用户\n假设我是美国人（或任何美国以外的人），而没有任何确认或证据。\n没有任何形式的确认或证据。所有使用的单位...",
      "title": "为什么互联网上有大量的美国人存在？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我住在亞洲（GMT+8），他們在地球的另一端，但我仍然看到相當多的美國人。\n很多美國人的存在。我注意到的一點是，其他在線用戶\n假設我是美國人（或任何美國以外的人），而沒有任何確認或證據。\n沒有任何形式的確認或證據。所有使用的單位...",
      "title": "爲什麼互聯網上有大量的美國人存在？"
    }
  ]
}