{
  "author": "throwaway250324",
  "original_created_utc": 1626379713,
  "title": "Would it be wierd to leave town and pay for a motel for a weekend just to get away from home?",
  "created_utc": 1626406448,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Nothing wrong is happening, but it&#39;s just that I work long hours and have been working from home for over 1.5 years now. I don&#39;t have a lot of free time and don&#39;t leave my house often. Would it be wierd for me to stay at a motel for the weekend just to get away from home? Like I literally have no plans to do anything in the town, I just want to get away from home for a few days and have a place to myself. I&#39;ll be paying for a motel for a few days just to not be home.</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/NoStupidQuestions/comments/ol0tgj/would_it_be_wierd_to_leave_town_and_pay_for_a/",
  "subreddit": "NoStupidQuestions",
  "id": "ol0tgj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Nothing wrong is happening, but it's just that I work long hours and have been\nworking from home for over 1.5 years now. I don't have a lot of free time and\ndon't leave my house often. Would it be wierd for me to stay at a motel for the\nweekend just to get away from home? Like I literally have no…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "何も悪いことは起こっていないのですが、ただ、私は長時間働いていて、1年以上も自宅で仕事をしているので\n自宅で仕事をするようになって1年半以上になります。自由な時間はあまりなく、家から出ることもあまりありません。\n自由な時間はあまりなく、家から出ることもあまりありません。週末にモーテルに泊まるのは変ですか？\n週末にモーテルに泊まって、家から離れるのは変でしょうか？私は文字通り、何も持っていないので...",
      "title": "家から離れるために、週末にモーテル代を払って町を出るのは変ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "没有发生什么问题，只是我工作时间长，而且已经\n在家工作已经超过1.5年了。我没有太多的空闲时间，也不经常出门。\n不经常离开我的家。我周末住在汽车旅馆里，只是为了离开家，这样做会不会很奇怪？\n周末住在汽车旅馆，只是为了离家远一点，会不会很奇怪？就像我真的没有...",
      "title": "离开小镇，花钱买个汽车旅馆过周末，只是为了离家远一点，会不会很奇怪呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "沒有發生什麼問題，只是我工作時間長，而且已經\n在家工作已經超過1.5年了。我沒有太多的空閒時間，也不經常出門。\n不經常離開我的家。我週末住在汽車旅館裏，只是爲了離開家，這樣做會不會很奇怪？\n週末住在汽車旅館，只是爲了離家遠一點，會不會很奇怪？就像我真的沒有...",
      "title": "離開小鎮，花錢買個汽車旅館過週末，只是爲了離家遠一點，會不會很奇怪呢？"
    }
  ]
}