{
  "author": "GodConcepts",
  "original_created_utc": 1658754006,
  "title": "How do drugs target our cancerous cells, and not our normal cells, when administered?",
  "created_utc": 1658806577,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If we have a population of normal and cancer cells, and we give a drug to this population. And lets say this drug induces apoptosis. Usually, the drug would have a detrimental effects on the cancerous cells, but would pretty much cause the normal cells to be unaffected. How is that? If the drug can induce cell death in both normal and cancerous cells, why do the cancerous cells tend to die first? Is it because cancerous cells are way better at metabolism than non-cancerous cells, and so they suck everything from their environment; Therefore the normal cells get a small quantity of the drug, while the cancerous cells consume most of it and hence die?&lt;/p&gt;\n\n&lt;p&gt;(I know that some drugs might target  molecules that are unique to cancerous cells. However for the ones that are non-specific, how do these drugs manage to destroy our cancerous cells pretty well, while sort of not over-harming our normal cells)&lt;/p&gt;\n\n&lt;p&gt;(if anyone has like really credible references that would be nice also&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/askscience/comments/w7od4e/how_do_drugs_target_our_cancerous_cells_and_not/",
  "subreddit": "askscience",
  "id": "w7od4e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If we have a population of normal and cancer cells, and we give a drug to this\npopulation. And lets say this drug induces apoptosis. Usually, the drug would\nhave a detrimental effects on the cancerous cells, but would pretty much cause\nthe normal cells to be unaffected. How is that? If the drug can…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正常な細胞とがん細胞の集団があり、これに薬剤を投与すると\nこの集団に薬を与えるとします。そして、この薬剤がアポトーシスを誘導するとします。通常、この薬物は\nがん細胞には有害な影響を及ぼしますが、正常細胞にはほとんど影響を及ぼしません。\n正常な細胞は影響を受けません。どうなんだ？もしその薬が...",
      "title": "薬が投与されると、どうして正常な細胞ではなく、私たちのがん細胞を狙い撃ちするのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我们有一个由正常细胞和癌细胞组成的群体，而我们给这个群体服用一种药物\n群体。让我们说，这种药物会诱导细胞凋亡。通常情况下，这种药物会\n对癌细胞有不利的影响，但几乎会导致\n正常细胞不受影响。这是怎么回事呢？如果该药物能...",
      "title": "在用药时，药物如何针对我们的癌细胞，而不是正常细胞？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我們有一個由正常細胞和癌細胞組成的羣體，而我們給這個羣體服用一種藥物\n羣體。讓我們說，這種藥物會誘導細胞凋亡。通常情況下，這種藥物會\n對癌細胞有不利的影響，但幾乎會導致\n正常細胞不受影響。這是怎麼回事呢？如果該藥物能...",
      "title": "在用藥時，藥物如何針對我們的癌細胞，而不是正常細胞？"
    }
  ]
}