{
  "author": "jesusvsaquaman",
  "original_created_utc": 1639412746,
  "title": "You can literally buy a Big Mac for 0.00002 BTC ($6) in El Salvador today",
  "created_utc": 1639446416,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Blessed be the day we can finally enter stores and buy things like sandwiches and groceries using crypto.&lt;/p&gt;\n\n&lt;p&gt;I have a feel that this reality might take us some time, but eventually it will happen at some point especially if El Salvador proves in the upcoming years that accepting crypto as legal tender is in fact a good idea.&lt;/p&gt;\n\n&lt;p&gt;But for now, we’re gonna have to watch and envy as bystanders. At least we’re starting to see some projects like Alchemy Pay work on bridging between fiat and crypto for retailers and businesses. &lt;/p&gt;\n\n&lt;p&gt;And while it’s technically not “crypto payment” it is expoing more and more people and businesses to crypto which will definitely help for a much smoother transition from fiat to crypto later on in the future.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/rfjjmf/you_can_literally_buy_a_big_mac_for_000002_btc_6/",
  "subreddit": "CryptoCurrency",
  "id": "rfjjmf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Blessed be the day we can finally enter stores and buy things like sandwiches\nand groceries using crypto.\n\nI have a feel that this reality might take us some time, but eventually it will\nhappen at some point especially if El Salvador proves in the upcoming years that\naccepting crypto as legal…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "やっと店に入って、サンドイッチなどを買える日が来たことに感謝します。\n暗号を使った食料品\n\nこの現実には時間がかかりそうな予感がしますが、いずれは\n特にエルサルバドルが今後数年の間に、以下のことを証明すれば、いつかは実現するでしょう。\n暗号を合法的に受け入れる...",
      "title": "エルサルバドルでは、文字通り0.00002BTC（6ドル）でビッグマックを買うことができます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "祝福有一天我们终于可以进入商店，用加密货币购买三明治和杂货等物品。\n和食品杂货。\n\n我觉得这个现实可能需要一些时间，但最终它将会\n特别是如果萨尔瓦多在未来几年证明\n接受加密货币为合法...",
      "title": "今天在萨尔瓦多，你可以用0.00002 BTC（6美元）买到一个巨无霸。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "祝福有一天我們終於可以進入商店，用加密貨幣購買三明治和雜貨等物品。\n和食品雜貨。\n\n我覺得這個現實可能需要一些時間，但最終它將會\n特別是如果薩爾瓦多在未來幾年證明\n接受加密貨幣爲合法...",
      "title": "今天在薩爾瓦多，你可以用0.00002 BTC（6美元）買到一個巨無霸。"
    }
  ]
}