{
  "author": "Apollo-Innovations",
  "the_new_excerpt": "In Band of Brothers, there’s a scene where they liberate a concentration camp.\nHowever, the soldiers are told that they can’t provide too much food to the\nprisoners because of their malnutrition and require the prisoners to go back\ninto the camps.\n\nI was wondering what was the exact process, such as…",
  "original_created_utc": 1622651919,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "バンド・オブ・ブラザース』では、強制収容所を解放するシーンがあります。\nしかし、兵士たちは、栄養失調のために囚人たちにあまり多くの食料を与えることはできないと言われます。\n栄養失調になっているため、あまり多くの食料を与えることはできないと言われ、囚人たちを収容所に戻さなければなりません。\n収容所に戻らなければなりません。\n\n具体的にはどのようなプロセスなのかというと...。",
      "title": "解放されたばかりのホロコースト被害者を社会に復帰させるためには、どのようなプロセスが必要だったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在《兄弟连》中，有一个场景是他们解放了一个集中营。\n然而，士兵们被告知，他们不能向囚犯提供太多的食物。\n因为他们营养不良，要求囚犯回到集中营。\n进入集中营。\n\n我想知道具体过程是怎样的，比如...",
      "title": "让新解放的大屠杀受害者重新融入社会的过程是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在《兄弟連》中，有一個場景是他們解放了一個集中營。\n然而，士兵們被告知，他們不能向囚犯提供太多的食物。\n因爲他們營養不良，要求囚犯回到集中營。\n進入集中營。\n\n我想知道具體過程是怎樣的，比如...",
      "title": "讓新解放的大屠殺受害者重新融入社會的過程是什麼？"
    }
  ],
  "title": "What was the process to reintegrate newly liberated Holocaust victims back into society?",
  "created_utc": 1622676177,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In Band of Brothers, there’s a scene where they liberate a concentration camp. However, the soldiers are told that they can’t provide too much food to the prisoners because of their malnutrition and require the prisoners to go back into the camps. </p>\n\n<p>I was wondering what was the exact process, such as health, financial and civil aid provided to the victims, from the moment the gates were opened?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/nqq21z/what_was_the_process_to_reintegrate_newly/",
  "subreddit": "AskHistorians",
  "id": "nqq21z",
  "is_self": true,
  "media": null,
  "is_video": false
}