{
  "author": "Fleegalicious",
  "original_created_utc": 1633615976,
  "title": "How to make a banger post on r/Cryptocurrency",
  "created_utc": 1633642396,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Are you trying to get some of that delicious karma? Are you a humble moon farmer, just trying to make ends meet? Well then this is the guide for you! This is how to make a banger post on this sub.</p>\n\n<p><strong>STEP ONE: IS IT A BULLISH POST?</strong></p>\n\n<p>Is your coin of choice going up? Have you seen the triple double golden shower triangle? Well, the funny numbers only go up so you best spread the word! Be sure to tell everyone that your coin is pumping, will keep pumping, and will never stop pumping. </p>\n\n<p><strong>IS IT A <em>TECHNICAL</em> ANALYSIS?</strong></p>\n\n<p>Did you take the price chart and take it to art class? If you have doodled and discovered some fun shapes in the chart than you bet your ass it’s technically analyzed! Just take a crayon, and take a chart, you can try this at home! They’re never wrong!</p>\n\n<p><strong>IS YOUR POST A NEWS ARTICLE THATS BEEN SHARED 5 TIMES ALREADY?</strong></p>\n\n<p>Have you seen the article posted already in this sub? Doesn’t matter! You can just keep posting the same shit over and over until you get likes! Take that sweet karma from everyone else! That’s how Reddit works!</p>\n\n<p>DOES YOUR POST USE <strong>BOLD</strong> AND <em>ITALIC</em> CHARACTERS?</p>\n\n<p>Bitches love *<em>bold and *italic</em> characters!!! Go nuts</p>\n\n<p><strong>IS IT FINANCIAL ADVICE?</strong></p>\n\n<p><em>This is not financial advice</em></p>\n\n<p><strong>CONCLUSION</strong></p>\n\n<p>Remember friends, if you want a banger post, you need to give people that sweet, sweet hopium. It’s the most addicting drug known to man. If you actually know what you’re talking about, then it’s best to stay a lurker.</p>\n\n<p><em>This is post advice</em></p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/q39zdz/how_to_make_a_banger_post_on_rcryptocurrency/",
  "subreddit": "CryptoCurrency",
  "id": "q39zdz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Are you trying to get some of that delicious karma? Are you a humble moon\nfarmer, just trying to make ends meet? Well then this is the guide for you! This\nis how to make a banger post on this sub.\n\nSTEP ONE: IS IT A BULLISH POST?\n\nIs your coin of choice going up? Have you seen the triple double…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "美味しいカルマを手に入れようとしていませんか？あなたは謙虚な月の農家で\nただ生活するだけで精一杯ですか？これはそんなあなたのためのガイドです。これは\nこれは、このサブサイトで人気のポストを作る方法です。\n\nステップ1．それは強気のポストですか？\n\nあなたの選んだコインは上がっていますか？あなたはトリプルダブルを見たことがありますか？",
      "title": "r/Cryptocurrencyでのバンガーポストの作り方"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你是否想获得一些美味的因果关系？你是一个卑微的月亮\n农民，只是为了维持生计？那么，这就是为你准备的指南! 这就是\n是如何在这个子上做出一个重要的帖子。\n\n第一步。这是一个看涨的帖子吗？\n\n你选择的钱币在上涨吗？你有没有看到三倍的双...",
      "title": "如何在r/Cryptocurrency上发表一个爆炸性的帖子"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你是否想獲得一些美味的因果關係？你是一個卑微的月亮\n農民，只是爲了維持生計？那麼，這就是爲你準備的指南! 這就是\n是如何在這個子上做出一個重要的帖子。\n\n第一步。這是一個看漲的帖子嗎？\n\n你選擇的錢幣在上漲嗎？你有沒有看到三倍的雙...",
      "title": "如何在r/Cryptocurrency上發表一個爆炸性的帖子"
    }
  ]
}