{
  "author": "SuperSnoot",
  "the_new_excerpt": "Apologies, I have used Google but seem to get mainly results from the current\nevents that are occuring. I'd like to know the historic context in an easy to\nunderstand way before I form an opinion either way. TIA",
  "original_created_utc": 1621204412,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "申し訳ありませんが、私はGoogleを使用しましたが、主に現在起こっている出来事からの結果を得ているようです。\n起こっている出来事が中心のようです。歴史的な背景をわかりやすく知りたいと思っています。\n歴史的背景をわかりやすく知りたいと思っています。TIA",
      "title": "私は明らかに無知なのですが、どなたかイスラエルとパレスチナの間で何が起こっているのかを平易に説明してください。現在の出来事につながる継続的な問題があることは知っていますが、かなり複雑なようなので、この問題について少し勉強してみたいと思っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "抱歉，我使用了谷歌，但似乎主要是从当前发生的事件中得到的结果。\n事件发生的结果。我想知道历史背景，并以一种易于\n的方式了解历史背景，然后再形成意见。TIA",
      "title": "我在这里显然是无知的，但谁能用通俗的语言解释一下以色列和巴勒斯坦之间到底发生了什么？我知道有一个持续的问题，导致了当前的事件，但这一切似乎相当复杂，我想在这个问题上教育一下自己。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "抱歉，我使用了谷歌，但似乎主要是從當前發生的事件中得到的結果。\n事件發生的結果。我想知道歷史背景，並以一種易於\n的方式瞭解歷史背景，然後再形成意見。TIA",
      "title": "我在這裏顯然是無知的，但誰能用通俗的語言解釋一下以色列和巴勒斯坦之間到底發生了什麼？我知道有一個持續的問題，導致了當前的事件，但這一切似乎相當複雜，我想在這個問題上教育一下自己。"
    }
  ],
  "title": "I'm clearly ignorant here but can someone please explain in layman's term what is happening between Israel and Palestine? I know there has been an on-going issue that has resulted in current events but it all seems fairly complex and I'd like to educate myself a bit on the issue.",
  "created_utc": 1621223659,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Apologies, I have used Google but seem to get mainly results from the current events that are occuring. I&#39;d like to know the historic context in an easy to understand way before I form an opinion either way. TIA</p>\n</div><!-- SC_ON -->",
  "score": 144,
  "permalink": "/r/TooAfraidToAsk/comments/ndztqy/im_clearly_ignorant_here_but_can_someone_please/",
  "subreddit": "TooAfraidToAsk",
  "id": "ndztqy",
  "is_self": true,
  "media": null,
  "is_video": false
}