{
  "author": "JackedAccountant",
  "the_new_excerpt": "A significant portion of /r/CryptoCurrency lurkers are young guns with a bit of\nmoney to their names. If that is you, then you may have been tempted to yolo in\nyour savings during this crash to \"stack crypto\" because popular youtubers and\ntop reddit posts keep touting that markets will…",
  "original_created_utc": 1623123195,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "/r/CryptoCurrency lurkerのかなりの部分は、ちょっとしたお金を持った若い人たちです。\nである。もしあなたがそうだとしたら、この暴落の中で貯金をヨロシクして\n人気ユーチューバーやredditのトップ記事では、この暴落の中で貯金をヨロシクして「stack crypto」したくなったかもしれません。\n人気ユーチューバーやredditのトップ記事が市場は...と謳っているからです。",
      "title": "YoutuberやRedditの投稿で、この暴落時に暗号を積み重ねることについて聞いてはいけません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "/r/CryptoCurrency潜伏者中有很大一部分是年轻的枪手，他们的名字里有一点儿钱。\n币的年轻人。如果你是这样的人，那么你可能已经受到诱惑，在这次大跌中把你的储蓄拿出来 \"堆积加密货币\"。\n你的储蓄在这次暴跌中被用来 \"堆积加密货币\"，因为流行的优酷网和\n因为流行的YouTube和Reddit上的帖子一直在吹嘘市场将...",
      "title": "不要听信Youtubers和Reddit上关于在这次崩盘期间堆积加密货币的帖子。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "/r/CryptoCurrency潛伏者中有很大一部分是年輕的槍手，他們的名字裏有一點兒錢。\n幣的年輕人。如果你是這樣的人，那麼你可能已經受到誘惑，在這次大跌中把你的儲蓄拿出來 \"堆積加密貨幣\"。\n你的儲蓄在這次暴跌中被用來 \"堆積加密貨幣\"，因爲流行的優酷網和\n因爲流行的YouTube和Reddit上的帖子一直在吹噓市場將...",
      "title": "不要聽信Youtubers和Reddit上關於在這次崩盤期間堆積加密貨幣的帖子。"
    }
  ],
  "title": "Don't listen to Youtubers and Reddit posts about stacking crypto during this crash.",
  "created_utc": 1623135250,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A significant portion of <a href=\"/r/CryptoCurrency\">/r/CryptoCurrency</a> lurkers are young guns with a bit of money to their names. If that is you, then you may have been tempted to yolo in your savings during this crash to &quot;stack crypto&quot; because popular youtubers and top reddit posts keep touting that markets will rebound. </p>\n\n<p>Make no mistake, they don&#39;t know shit.</p>\n\n<p>I don&#39;t either, but that&#39;s why this post isn&#39;t necessarily advice, its purpose is to be a reminder: do a <strong>risk check</strong>.</p>\n\n<p>Ask yourself: Can you truly stomach 80%+ in losses? Did you invest over 50% of your savings into crypto to try and escape the rat race? Are you reading top posts and following crypto celeb advice instead of doing your own thorough research? Snap out of it. Seriously, take a moment to check if you are alright with losing everything you&#39;ve invested, because the chances of your portfolio plunging through the water is <strong><em>very real</em></strong>. </p>\n\n<p>I&#39;m just saying: <strong>think twice</strong>.</p>\n</div><!-- SC_ON -->",
  "score": 1473,
  "permalink": "/r/CryptoCurrency/comments/nuvbwh/dont_listen_to_youtubers_and_reddit_posts_about/",
  "subreddit": "CryptoCurrency",
  "id": "nuvbwh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404882875
}