{
  "author": "finance_buff",
  "original_created_utc": 1649322602,
  "title": "Is it okay if I tell my gay friend (previously office colleague) not to touch my hands in a flirtatious way?",
  "created_utc": 1649331771,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;25 M here. &lt;/p&gt;\n\n&lt;p&gt;I’m not sure if it is meant to be flirtatious but a part of me assumes not, since he knows I’m in a long term relationship with my girl. &lt;/p&gt;\n\n&lt;p&gt;I’m in no way homophobic but I just feel weirdly uncomfortable getting my hands touched by a guy in that way. I gently pull it away without making things awkward as almost always there are other colleagues present when we talk in office. I even thought he would get a hint the first time but he didn’t. He also jokes often how he would totally date me if I were gay, or how gays would love having me on the other side on their team, but my common sense dictates he means it light-heartedly. &lt;/p&gt;\n\n&lt;p&gt;Should I confront him? I don’t want him to feel bad since he has often shared how badly he has been bullied throughout his teenage years by homophobes. &lt;/p&gt;\n\n&lt;p&gt;Other alternative is just reducing my interaction entirely. &lt;/p&gt;\n\n&lt;p&gt;I dunno! New territory here…&lt;/p&gt;\n\n&lt;p&gt;Edit: Seems like all the 5 comments I got until now are pointing at the same thing. Dunno why I didn’t have that level of clarity. Will do as suggested, guys. Thanks.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 149,
  "permalink": "/r/TooAfraidToAsk/comments/ty8z12/is_it_okay_if_i_tell_my_gay_friend_previously/",
  "subreddit": "TooAfraidToAsk",
  "id": "ty8z12",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "25 M here.\n\nI’m not sure if it is meant to be flirtatious but a part of me assumes not,\nsince he knows I’m in a long term relationship with my girl.\n\nI’m in no way homophobic but I just feel weirdly uncomfortable getting my hands\ntouched by a guy in that way. I gently pull it away without making…"
}