{
  "author": "finance_buff",
  "original_created_utc": 1649322602,
  "title": "Is it okay if I tell my gay friend (previously office colleague) not to touch my hands in a flirtatious way?",
  "created_utc": 1649331771,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;25 M here. &lt;/p&gt;\n\n&lt;p&gt;I’m not sure if it is meant to be flirtatious but a part of me assumes not, since he knows I’m in a long term relationship with my girl. &lt;/p&gt;\n\n&lt;p&gt;I’m in no way homophobic but I just feel weirdly uncomfortable getting my hands touched by a guy in that way. I gently pull it away without making things awkward as almost always there are other colleagues present when we talk in office. I even thought he would get a hint the first time but he didn’t. He also jokes often how he would totally date me if I were gay, or how gays would love having me on the other side on their team, but my common sense dictates he means it light-heartedly. &lt;/p&gt;\n\n&lt;p&gt;Should I confront him? I don’t want him to feel bad since he has often shared how badly he has been bullied throughout his teenage years by homophobes. &lt;/p&gt;\n\n&lt;p&gt;Other alternative is just reducing my interaction entirely. &lt;/p&gt;\n\n&lt;p&gt;I dunno! New territory here…&lt;/p&gt;\n\n&lt;p&gt;Edit: Seems like all the 5 comments I got until now are pointing at the same thing. Dunno why I didn’t have that level of clarity. Will do as suggested, guys. Thanks.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 149,
  "permalink": "/r/TooAfraidToAsk/comments/ty8z12/is_it_okay_if_i_tell_my_gay_friend_previously/",
  "subreddit": "TooAfraidToAsk",
  "id": "ty8z12",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "25 M here.\n\nI’m not sure if it is meant to be flirtatious but a part of me assumes not,\nsince he knows I’m in a long term relationship with my girl.\n\nI’m in no way homophobic but I just feel weirdly uncomfortable getting my hands\ntouched by a guy in that way. I gently pull it away without making…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "25 Mはこちら\n\n浮気のつもりなのかどうかわからないが、そうではないと思い込んでいる部分がある。\n私が恋人と長く付き合っていることを知っているからです。\n\n私は決して同性愛者嫌悪症ではないのですが、ただ、手を出されるのは変な感じがします。\nそんな風に男に触られる。私はそっとそれを引き離すと...。",
      "title": "ゲイの友人（以前は会社の同僚）に、ノリで手を触らないように言ってもいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这里是25M。\n\n我不确定这是否是为了调情，但我的一部分假设不是。\n因为他知道我和我女朋友有长期的关系。\n\n我没有同性恋恐惧症，但我只是觉得被一个男人以这种方式触摸我的手会感到奇怪的不舒服。\n被一个男人以这种方式触摸感到很不舒服。我轻轻地把它拉开，没有让..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏是25M。\n\n我不確定這是否是爲了調情，但我的一部分假設不是。\n因爲他知道我和我女朋友有長期的關係。\n\n我沒有同性戀恐懼症，但我只是覺得被一個男人以這種方式觸摸我的手會感到奇怪的不舒服。\n被一個男人以這種方式觸摸感到很不舒服。我輕輕地把它拉開，沒有讓...",
      "title": "ゲイの友人（以前は會社の同僚）に、ノリで手を觸らないように言ってもいいのでしょうか？"
    }
  ]
}