{
  "author": "jesusvsaquaman",
  "original_created_utc": 1642352636,
  "title": "BTC isn't anonymous, if something finds your address your whole history f3ck'd",
  "created_utc": 1642372517,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There’s more to decentralization than using BTC&lt;/p&gt;\n\n&lt;p&gt;I see these people all the time, and I’m sure you do as well. People who think that once they’ve moved on to using BTC, they’re forever freed of taxes, institutions, the government, and ‘big brother’. Well it doesn’t work that way, and those a little more experienced in crypto will tend to agree.&lt;/p&gt;\n\n&lt;p&gt;Bitcoin was an experiment, it went well but it still has a long way to go. Bitcoin isn’t anonymous, it’s pseudonymous, anyone who can find one address of yours, can track your entire search history. &lt;/p&gt;\n\n&lt;p&gt;Something else Bitcoin has to work on, is the largeholder control. A few whales control the majority of the market. Decentralized organizations have already solved this using DAOs. You see when you use a DAO, take BitDAO for example, you don’t have to put your trust in the hands of a few sketchy men. &lt;/p&gt;\n\n&lt;p&gt;Instead, you are given the choice of handing your confidence to the entirety of the public. No honest man is in power, and no power is given to an honest man. You can’t trust humans to control your fortunes. You too, should handle a share of the responsibility of the fortunes of yours as well as others, and that’s how DAOs work. &lt;/p&gt;\n\n&lt;p&gt;If you only trust politicians to rule and soldiers to fight, then don’t be surprised when war is fought by fools and governments are ruled by cowards.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 389,
  "permalink": "/r/CryptoCurrency/comments/s5g5ue/btc_isnt_anonymous_if_something_finds_your/",
  "subreddit": "CryptoCurrency",
  "id": "s5g5ue",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "There’s more to decentralization than using BTC\n\nI see these people all the time, and I’m sure you do as well. People who think\nthat once they’ve moved on to using BTC, they’re forever freed of taxes,\ninstitutions, the government, and ‘big brother’. Well it doesn’t work that way,\nand those a little…"
}