{
  "author": "katiecharm",
  "original_created_utc": 1653206744,
  "title": "Crypto has never existed through a global recession before. All bets are off, and we might be about to see the first *true* crypto crash - and it might knock the wind out of even the hardest hodlers.",
  "created_utc": 1653219210,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m seeing far too much chatter from people who are a.) sure we are entering a 2 year bear market and others who are b.) sure this is just a dip in an extended cycle.  &lt;/p&gt;\n\n&lt;p&gt;I have a question for all of you people: when was the last time you were hungry, and I mean really hungry?  When was the last time you were already late for rent and wondering what around your house you could sell to make up the difference?  &lt;/p&gt;\n\n&lt;p&gt;Make no mistake: I am a crypto maximalist.  One of the OGs.  But I also strive to be a realist.  And let me assure you: people who can’t afford basic necessities don’t have time for made up internet coins.  &lt;/p&gt;\n\n&lt;p&gt;After being involved with crypto for many years I went through a rough patch in 2019 - 2020 where I was on food stamps and begging for rent money on social media.  I was selling my shit on eBay and relying on charity to make it from one month to the next.  I gotta say, I gave zero shits about what was going on in crypto land.  My vision was focused on just making it day to day.  &lt;/p&gt;\n\n&lt;p&gt;And I think a lot of people are going to end up in that same mindset if a real recession hits us.  People aren’t gonna have extra money to buy &lt;em&gt;any&lt;/em&gt; crypto, not monkey nfts, not dog coins, not Algorand, not Ether, not even fucking Bitcoin itself.  &lt;/p&gt;\n\n&lt;p&gt;And I think you should mentally prepare for that.  &lt;/p&gt;\n\n&lt;p&gt;It should be a possibility on your mental list that crypto might be about to experience it’s first &lt;em&gt;true&lt;/em&gt; crash, and it will seem like an extinction level event.  &lt;/p&gt;\n\n&lt;p&gt;———  &lt;/p&gt;\n\n&lt;p&gt;edit: the fact that this is getting almost unanimously downvoted tells me I’m probably right.  Y’all ride that hopium into the ground.  To make money in this game you need to do the &lt;em&gt;opposite&lt;/em&gt; of what everyone believes.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 444,
  "permalink": "/r/CryptoCurrency/comments/uv6f5v/crypto_has_never_existed_through_a_global/",
  "subreddit": "CryptoCurrency",
  "id": "uv6f5v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m seeing far too much chatter from people who are a.) sure we are entering a 2\nyear bear market and others who are b.) sure this is just a dip in an extended\ncycle.\n\nI have a question for all of you people: when was the last time you were hungry,\nand I mean really hungry? When was the last time…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、a.) 2年間の弱気相場に突入すると確信している人たちと、b.) 長期的な弱気相場の一服に過ぎないと確信している人たちのおしゃべりをあまりにも多く見ています。\n年弱気市場に入ると確信している人たちと、b.) これは長期的なサイクルにおける単なる落ち込みに過ぎないと確信している人たちとの間で、あまりに多くのおしゃべりを目にします。\nという意見もあります。\n\n皆さんに質問です。最後にお腹が空いたのはいつですか？\n本当に空腹だったのはいつですか？最後にお腹が空いたのはいつですか...",
      "title": "Cryptoはこれまで世界的な不況を経て存在したことはない。すべての賭けは失敗し、我々は最初の*真の*暗号暴落を見ようとしているかもしれません - そしてそれは最も困難なホドラーでさえ風を切るかもしれません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到太多来自人们的议论，他们a.)确信我们正在进入一个为期两年的熊市，而其他人则b.)确信这只是延长的熊市中的一次下跌。\n确信我们正在进入一个为期两年的熊市，而其他一些人则认为这只是延长周期中的一个低点。\n周期。\n\n我有一个问题要问你们所有人：你们最后一次饥饿是什么时候。\n我是说真的饿了？上一次是什么时候...",
      "title": "Crypto从未在全球经济衰退中存在过。所有的赌注都取消了，我们可能即将看到第一次*真正的*加密货币崩溃--它可能会把最难对付的人打倒在地。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到太多來自人們的議論，他們a.)確信我們正在進入一個爲期兩年的熊市，而其他人則b.)確信這只是延長的熊市中的一次下跌。\n確信我們正在進入一個爲期兩年的熊市，而其他一些人則認爲這只是延長週期中的一個低點。\n週期。\n\n我有一個問題要問你們所有人：你們最後一次飢餓是什麼時候。\n我是說真的餓了？上一次是什麼時候...",
      "title": "Crypto從未在全球經濟衰退中存在過。所有的賭注都取消了，我們可能即將看到第一次*真正的*加密貨幣崩潰--它可能會把最難對付的人打倒在地。"
    }
  ]
}