{
  "author": "nickoskal024",
  "original_created_utc": 1627928285,
  "title": "Why can't you refuel while the engine is running?",
  "created_utc": 1627942958,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know this &#39;rule&#39; in the context of cars, but I assume also true for airplanes and boats. Why is this the case? Its not like refuelling opens the combustion chamber... And if fumes are the ones in danger to ignite, couldn&#39;t that happen from the petrol in the tank anyway? Excuse my poor knowledge of internal combustion engines !</p>\n\n<p>Edit: Thanks for all the answers. To simplify, I will make a clarification before going to sleep; for automobiles, what are the potential sources of ignition? The electrical wiring? The buildup of static charge? The heat in the engine components? Or the engine&#39;s combusting? ... For a brand new car what would be the main danger, and how has this changed over the years i.e. by using different materials?</p>\n</div><!-- SC_ON -->",
  "score": 140,
  "permalink": "/r/askscience/comments/owkeq6/why_cant_you_refuel_while_the_engine_is_running/",
  "subreddit": "askscience",
  "id": "owkeq6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know this 'rule' in the context of cars, but I assume also true for airplanes\nand boats. Why is this the case? Its not like refuelling opens the combustion\nchamber... And if fumes are the ones in danger to ignite, couldn't that happen\nfrom the petrol in the tank anyway? Excuse my poor knowledge of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこの「ルール」を車の文脈で知っていますが、飛行機や船にも当てはまるのではないでしょうか。\nや船にも当てはまると思います。なぜこのようなことが起こるのでしょうか？給油することで燃焼室が開くわけではありません。\n燃焼室が開くわけではないし...。それに、もしガスが発火の危険性があるとしたら、タンクの中のガソリンからは発火しないのでは？\nタンク内のガソリンから発火するのでは？拙い知識で申し訳ありませんが・・・。",
      "title": "なぜ、エンジンをかけたまま給油できないのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道这个 \"规则 \"是针对汽车的，但我认为对飞机和船只也是如此。\n和船。为什么会出现这种情况？它不像加油会打开燃烧室\n燃烧室... 如果油烟有被点燃的危险，难道不会发生吗？\n罐中的汽油就不会发生吗？请原谅我的知识不足...",
      "title": "为什么不能在发动机运转时加油？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道這個 \"規則 \"是針對汽車的，但我認爲對飛機和船隻也是如此。\n和船。爲什麼會出現這種情況？它不像加油會打開燃燒室\n燃燒室... 如果油煙有被點燃的危險，難道不會發生嗎？\n罐中的汽油就不會發生嗎？請原諒我的知識不足...",
      "title": "爲什麼不能在發動機運轉時加油？"
    }
  ]
}