{
  "author": "Adudam42",
  "the_new_excerpt": "What do you think about this statement? I've read so much in the news this year\nabout the explosion of retail investing. Most of it has been overtly critical of\nthe apparent inexperience and irresponsibility of new retail investors despite\nstrong evidence that retail investors don't do much, if…",
  "original_created_utc": 1607967239,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你对这份声明有什么看法？今年我在新闻里读了很多东西\n关于散户投资的爆炸性增长。它的大部分都公开批评\n新散户投资者明显缺乏经验和不负责任，尽管\n强有力的证据表明散户投资者做得不多，如果…",
      "title": "华尔街先发制人地将散户投资者定位为下一次崩盘原因的替罪羊"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你對這份聲明有什麼看法？今年我在新聞裏讀了很多東西\n關於散戶投資的爆炸性增長。它的大部分都公開批評\n新散戶投資者明顯缺乏經驗和不負責任，儘管\n強有力的證據表明散戶投資者做得不多，如果…",
      "title": "華爾街先發制人地將散戶投資者定位爲下一次崩盤原因的替罪羊"
    }
  ],
  "title": "Wall Street is preemptively positioning retail investors as a scapegoat for the cause of the next crash",
  "created_utc": 1607978896,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What do you think about this statement? I&#39;ve read so much in the news this year about the explosion of retail investing. Most of it has been overtly critical of the apparent inexperience and irresponsibility of new retail investors despite strong evidence that retail investors don&#39;t do much, if anything, in terms of actually moving the market. Meanwhile, industry insiders are effectively engaging in the same risky plays you see on WSB, just on a way larger scale that actually has implications for the market. Think the whole Softbank story earlier this year. </p>\n\n<p>I think most people agree that this market is a bubble that will eventually pop. And I feel like Wall Street, as usual, will find a scapegoat to deflect blame onto. I have a feeling this time is will be retail investors.</p>\n</div><!-- SC_ON -->",
  "score": 1220,
  "permalink": "/r/stocks/comments/kd25q4/wall_street_is_preemptively_positioning_retail/",
  "subreddit": "stocks",
  "id": "kd25q4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260493109
}