{
  "author": "mistercleaver",
  "original_created_utc": 1650501734,
  "title": "Given the hatred and vitriol seen in the Yugoslav wars and the modern day within the Balkans, how was Yugoslavia able to stay together for so long?",
  "created_utc": 1650548201,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have recently become somewhat fascinated by the apparent disdain for neighboring nations seen in the Balkan states (a term I use somewhat interchangeably with post-yugoslav states, sometimes including Greece, Bulgaria, Romania, and Turkey due to similar nationalist rhetoric seen online). This hatred seems to go back long before the Yugoslav wars since there are some examples of it in Clark&amp;#39;s &amp;quot;The Sleepwalkers&amp;quot; (though I know this is a somewhat contentious book online) and I am just wondering how Yugoslavia was able to become united at all in the first place given this apparent hatred, as well as why it took so long (almost 10 years after the death of Tito) for the state to completely fall apart.&lt;/p&gt;\n\n&lt;p&gt;Thank you for your time.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/u8b06y/given_the_hatred_and_vitriol_seen_in_the_yugoslav/",
  "subreddit": "AskHistorians",
  "id": "u8b06y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have recently become somewhat fascinated by the apparent disdain for\nneighboring nations seen in the Balkan states (a term I use somewhat\ninterchangeably with post-yugoslav states, sometimes including Greece, Bulgaria,\nRomania, and Turkey due to similar nationalist rhetoric seen online).…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、バルカン半島諸国（私はこの言葉を多少使っています）に見られる、近隣諸国を蔑視するような態度に、いささか惹かれるものがあります。\nバルカン諸国に見られる、隣国を蔑視するような態度（私はこの言葉を多少なりとも\nギリシャ、ブルガリア、ローマを含むこともあります。\nネット上で見かけるナショナリストのレトリックに似ていることから、ギリシャ、ブルガリア、ルーマニア、トルコを含むこともある）......。",
      "title": "ユーゴスラビア紛争や現代のバルカン半島に見られる憎しみや暴力を考えると、なぜユーゴスラビアはこれほど長く一緒にいることができたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，我对巴尔干国家对邻国的明显蔑视感到有些着迷。\n在巴尔干国家（我在某种程度上将这个词与后南斯拉夫国家互换使用）看到的对邻国的明显蔑视，让我有些着迷。\n我在某种程度上与后南斯拉夫国家互换使用，有时也包括希腊、保加利亚、罗马尼亚和土耳其。\n由于在网上看到类似的民族主义言辞，罗马尼亚和土耳其也在其中）....",
      "title": "鉴于在南斯拉夫战争和现代巴尔干地区内看到的仇恨和尖锐，南斯拉夫是如何能够长期保持在一起的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，我對巴爾幹國家對鄰國的明顯蔑視感到有些着迷。\n在巴爾幹國家（我在某種程度上將這個詞與後南斯拉夫國家互換使用）看到的對鄰國的明顯蔑視，讓我有些着迷。\n我在某種程度上與後南斯拉夫國家互換使用，有時也包括希臘、保加利亞、羅馬尼亞和土耳其。\n由於在網上看到類似的民族主義言辭，羅馬尼亞和土耳其也在其中）....",
      "title": "鑑於在南斯拉夫戰爭和現代巴爾幹地區內看到的仇恨和尖銳，南斯拉夫是如何能夠長期保持在一起的？"
    }
  ]
}