{
  "author": "stonkgamble",
  "original_created_utc": 1645606874,
  "title": "Why do gay men often have these \"gay voices\"?",
  "created_utc": 1645615722,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was wondering why you can very often hear from the sound of a man&amp;#39;s voice that he is gay.&lt;/p&gt;\n\n&lt;p&gt;They tend to have that high, soft voice.&lt;/p&gt;\n\n&lt;p&gt;Is it because they changed their voices after coming out so people notice they are gay? Is it some hormone stuff? Do they actively &amp;quot;work&amp;quot; on getting a higher softer voice, or does it come by itself? &lt;/p&gt;\n\n&lt;p&gt;I really don&amp;#39;t have any idea.&lt;/p&gt;\n\n&lt;p&gt;Please don&amp;#39;t get me wrong, I have no problem at all with people living their sexuality, I don&amp;#39;t feel uncomfortable around gay people at all, I was just always wondering why this is and too afraid to ask.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/TooAfraidToAsk/comments/szcwjl/why_do_gay_men_often_have_these_gay_voices/",
  "subreddit": "TooAfraidToAsk",
  "id": "szcwjl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was wondering why you can very often hear from the sound of a man's voice that\nhe is gay.\n\nThey tend to have that high, soft voice.\n\nIs it because they changed their voices after coming out so people notice they\nare gay? Is it some hormone stuff? Do they actively \"work\" on getting a higher\nsofter…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "という声がよく聞かれるのはなぜだろう？\n彼はゲイです。\n\n彼らはあの高くて柔らかい声の傾向があります。\n\nカミングアウト後に声を変えることで、周囲に気づかれるようになったからでしょうか。\nはゲイなのでしょうか？ホルモン的なものなのか？彼らは、より高くするために積極的に「努力」しているのでしょうか？\nよりソフトに...",
      "title": "なぜ、ゲイにはこうした「ゲイの声」が多いのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在想，为什么你经常能从一个男人的声音中听出他是同性恋？\n他是同性恋。\n\n他们往往有那种高而柔和的声音。\n\n是不是因为他们出柜后改变了自己的声音，所以人们注意到他们是同性恋？\n是同性恋？是一些荷尔蒙的原因吗？他们是否积极地 \"努力 \"使自己的声音更高、更软？\n更软的声音。",
      "title": "为什么男同性恋者经常有这些 \"同性恋的声音\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在想，爲什麼你經常能從一個男人的聲音中聽出他是同性戀？\n他是同性戀。\n\n他們往往有那種高而柔和的聲音。\n\n是不是因爲他們出櫃後改變了自己的聲音，所以人們注意到他們是同性戀？\n是同性戀？是一些荷爾蒙的原因嗎？他們是否積極地 \"努力 \"使自己的聲音更高、更軟？\n更軟的聲音。",
      "title": "爲什麼男同性戀者經常有這些 \"同性戀的聲音\"？"
    }
  ]
}