{
  "author": "J-Force",
  "original_created_utc": 1649685966,
  "title": "Monday Methods – Black Death Scholarship and the Nightmare of Medical History",
  "created_utc": 1649733925,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In the coming years and decades, many histories of the Covid-19 pandemic will be written. And if Black Death scholarship is any indicator of how historical pandemics are studied, those histories may suck. In this Monday Methods we’re going to look at the Black Death and how current scholarship treats the issue of pneumonic plague, an often neglected type of plague that has recently been studied extensively in Madagascar where plague is endemic to local wildlife and occasionally spreads to the human population. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Some Basic Facts&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;First, let’s lay out the basics of the Black Death in Europe and the characteristics of plague according to the latest medical research, simplified a bit to be understandable to a normal person. From 1347-53, the Black Death killed around half of the European population and also spread at least to north Africa and the Middle East. It and subsequent resurgences termed the Second Pandemic formed the second of three plague pandemics, the first being the Plague of Justinian (in the 6th century AD) and the third being the Third Pandemic (19th-20th century). Plague is caused by the bacteria Yersinia pestis (YP from now on), which attacks the body in three main ways. There is septicaemic plague, a rare form when the bacteria attacks the cardiovascular system. There is bubonic plague, where it attacks the lymphatic system (a crucial part of the immune system that produces white blood cells). And there is pneumonic plague, which is a lung infection. A person could have just one or a combination of these depending on which specific parts of the body YP attacks. For our purposes, we only need to care about bubonic and pneumonic plagues and the debate over the role played by pneumonic plague in the devastating pandemic that we call the Black Death. &lt;/p&gt;\n\n&lt;p&gt;Bubonic plague is spread by flea bites. YP can live in fleas, and when an infected flea bites a human it introduces the bacteria to the body. In response to the bite, the immune system sends in white blood cells to destroy whatever unwelcome microorganisms have entered the skin. However, YP infects the white blood cells and they carry bacteria to the lymph nodes, causing the lymph nodes to swell drastically with pus and sometimes burst. These are the distinctive buboes that give the bubonic plague its name, though the swelling of lymph nodes can be caused by many illnesses and on its own is called lymphadenitis. Bubonic plague kills around half the people who get it, though it varies considerably. It can spread from flea carrying animals, including humans if their hygiene is poor enough to be carrying fleas. &lt;/p&gt;\n\n&lt;p&gt;Pneumonic plague occurs in two main ways. It can develop either from pre-existing bubonic plague as the walls of the lymph nodes get damaged by the infection and leak bacteria into the rest of the body (this is called secondary pneumonic plague, because it is secondary to buboes) or be contracted directly by inhaling bacteria from someone else with pneumonic plague (this is called primary pneumonic plague). Regardless of how a person becomes infected, it is, to quote the WHO, “invariably fatal” if untreated, as the bacteria and its effects suffocate the victim from within as their lungs are turned into necrotic sludge. The most obvious symptom is spitting and coughing blood. It can kill people in under 24h, though 2-3 days is more normal. Because pneumonic plague is so deadly and quick, it was believed that it could not be important in a pandemic as it ought to burn itself out before getting far; a few people get it, they die within days, and it’s over as long as the sick don’t cough on anyone. &lt;/p&gt;\n\n&lt;p&gt;However, a recent epidemic of primary pneumonic plague in Madagascar disproved this. Although there is always a low level of plague cases in Madagascar, the government noticed on 12 September 2017 that the number of cases was a little higher than usual and notified the World Health Organisation the next day. The number of cases continued to simmer at a few per day and seemed to be under control. On 29 September, cases abruptly skyrocketed. The WHO sent in rapid response teams and brought it under control over the next couple of weeks before the epidemic gradually declined. Even with swift and strict public health measures and modern medicine (plague is easily treated with antibiotics if caught early), the 2017 outbreak killed over 200 people and infected around 2500, mostly in the first two weeks of October. But of that roughly 2500, only about 300-350 showed symptoms of bubonic plague. One very unlucky person got septicaemic plague, but the vast majority of cases were of primary pneumonic plague that was passed directly from person to person with extraordinary ease. This demonstrated that pneumonic plague’s narrow window of infectivity is no barrier to a potentially catastrophic explosion in cases, especially in urban areas, and this longstanding idea that primary pneumonic plague cannot sustain its own epidemics was evidently incorrect. Most pre-2017 medical literature on pneumonic plague is either outdated or outright discredited. Put a pin in that. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The Medieval Physicians&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;With that in mind, let&amp;#39;s look at how contemporaries describe the Black Death. When the outbreak arrived in Italy, there was a scramble to identify the disease, its behaviour, and find possible treatments. The popular image of medieval medicine is that it was all quackery, and although that’s fair outside of proper medical circles (Pope Clement VI’s astrologists blamed the pandemic on the conjunction of Saturn, Jupiter, and Mars in 1341), actual doctors and public health officials often advocated techniques and practises that have been found to be effective. It is true that medieval doctors did not understand why the disease happened, but they did understand how it affected the body and they understood the concept of contagion. One of the first medieval doctors to write about the plague was Jacme D’Agremont in April 1348, and although he knew nothing about how to treat the plague and drew mainly on pre-existing ideas of disease being caused by ‘putrefaction of the air’ (this was the best explanation anyone had, or really could have had given the absence of microscopes), he was eager that:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;‘Of those that die suddenly, some should be autopsied and examined diligently by the physicians, so that thousands, and more than thousands, could benefit by preventive measure against those things which produce the maladies and deaths discussed.’&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;He was far from the only person advocating mass autopsies of the dead, and such autopsies were arranged. During and after the Black Death, many treatises were written on the characteristics of plague based on a combination of autopsies and experience of the plague ripping through the author’s local area. Here are a couple of the more detailed accounts:&lt;/p&gt;\n\n&lt;p&gt;Firstly, &lt;em&gt;A Description and Remedy for Escaping the Plague in the Future&lt;/em&gt; by Abu Jafar Ahmad Ibn Khatima, written in February 1349. Abu Jafar was a physician living in southern Spain.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;‘The best thing we learn from extensive experience is that if someone comes into contact with a diseased person, he immediately is smitten with the same disease, with identical symptoms. If the first diseased person vomited blood, the other one does too. If he is hoarse, the other will be too; if the first had buboes on the glands, the other will have them in the same place; if the first one had a boil, the second will get one too. Also, the second infected person passes on the disease. His family contracts the same kind of disease: If the disease of one family member ends in death, the others will share his fate; if the diseased one can be saved, the others will also live. The disease basically progressed in this way throughout our city, with very few exceptions.’&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;He further notes that there are possible treatments for bubonic plague that he had seen work in a handful of cases (probably more coincidental than causal, which Abu Jafar alludes to when he says ‘You must realise that the treatment of the disease… doesn’t make much sense’). Of those who have the symptom of spitting blood, he says ‘There is no treatment. Except for one young man, I haven’t seen anyone who was cured and lived. It puzzles me still.’ &lt;/p&gt;\n\n&lt;p&gt;Next up, &lt;em&gt;Great Surgery&lt;/em&gt; by Gui de Chauliac. He was Pope Clement VI’s personal physician, got the bubonic plague himself and lived, and probably played a role in coordinating the above-mentioned autopsies. In 1363 he finished his great compendium on surgery and treatments, describing both the initial outbreak of the Black Death and a resurgence from 1361-3. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;‘The said mortality began for us [in Avignon] in the month of January [1348] and lasted seven months. And it took two forms: the first lasted two months, accompanied by continuous fever and a spitting up of blood, and one died within three days. The second lasted the rest of the time, also accompanied by continuous fever and by apostemes [tumors] and antraci [carbuncles] on the external parts, principally under the armpits and in the groin, and one died within five days. And the mortality was so contagious, especially in those who were spitting up blood, that not only did one get it from another by living together, but also by looking at each other, to the point that people died without servants and were buried without priests. The father did not visit his son, nor the son his father; charity was dead, hope crushed.’&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;From these we can see that many well informed contemporaries could describe the main symptoms accurately, observed that the disease took two main forms, and that some sources ascribe significance to both in equal measure. That probably seems quite straightforward, and from the WHO’s studies on plague and these contemporary accounts one might think it uncontroversial to say that pneumonic plague was a significant factor in the Black Death’s death toll in some cities. That is not the case. A lot of historians are adamant that pneumonic plague was insignificant despite the evidence to the contrary.   &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Problem 1 – We Suck at Understanding Plague, And Always Have&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Although YP as the cause of the Black Death had been theorised since the Third Pandemic, we only fully confirmed that YP caused the Black Death in the 21st century when in 2011 a group of researchers analysed samples from two victims in a 14th century grave in London. The bacteria was well enough preserved that the genome could be reconstructed, and all doubt that YP was in fact going around killing people in the middle of the 14th century was expelled. Since then, paper after paper has been written trying to map out the progression of the Black Death (no real surprises there, it roughly matches what contemporaries believed) and there is some evidence that the variant of YP chiefly responsible for the Black Death originated in the marmot population of what is now Kazakhstan, was endemic to that region, and slowly spread across the steppe until it ended up on the Black Sea coast boarding a ship to Italy. &lt;/p&gt;\n\n&lt;p&gt;The discovery of what caused plague has its own complicated history, but for our purposes it&amp;#39;s worth going back to the Manchurian Plague of 1910-1911 and a 1911 conference that aimed to nail down the characteristics of plague. Back in the early 20th century, many doctors were adamant that the plague was carried by fleas on rats based on their experience dealing with outbreaks in south-east Asia, but the Malayan doctor Wu Lien-teh (who was in charge of dealing with the Manchurian Plague) found that this failed to explain the disease he was encountering. It showed the symptoms of plague, but from his autopsies he found it was primarily a respiratory infection with buboes being a rarer symptom. The Manchurian Plague was a pneumonic one that killed some 60,000 people, and Wu rapidly became the world leading expert on pneumonic plague. &lt;/p&gt;\n\n&lt;p&gt;Western doctors urged better personal hygiene and pest control to defeat plague, while Wu believed it would be immensely beneficial if people in the area wore protective equipment based on surgical masks that could filter the air they breathed. Refined and modern versions of his invention, then known as the Wu mask, are probably quite familiar to most of us in 2022. Although Wu’s discoveries regarding the characteristics of plague were lauded locally and by the League of Nations, western doctors were generally skeptical of his findings because it really looked to them like plague was primarily spread by fleas and was characterised by buboes. At a 1911 conference about the plague, Wu was overshadowed by researchers who pinned the epidemic on fleas carried by the tarbagan marmot (a rodent common to the region) as instrumental in the disease&amp;#39;s spread. The reality is that both Wu and his western counterparts were right, but the fleas narrative became strongly engrained over other theories in the English speaking world. I&amp;#39;m guessing not many of us learned about pneumonic plague in school but did learn about fleas, rats, and bubonic plague. &lt;/p&gt;\n\n&lt;p&gt;To an extent, this continues to this day even within some medical communities. The American Center for Disease Control states:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;‘Humans usually get plague after being bitten by a rodent flea that is carrying the plague bacterium or by handling an animal infected with plague. Plague is infamous for killing millions of people in Europe during the Middle Ages.’&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;They further note on pneumonic plague that:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;‘Typically this requires direct and close contact with the person with pneumonic plague. Transmission of these droplets is the only way that plague can spread between people. This type of spread has not been documented in the United States since 1924, but still occurs with some frequency in developing countries. Cats are particularly susceptible to plague, and can be infected by eating infected rodents.’&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;To the CDC, pneumonic plague is barely a concern and only worth one sentence more than the role of cats. However, the World Health Organisation, which has proactively studied plague in Madagascar where outbreaks are common, states: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;‘Plague is a very severe disease in people, particularly in its septicaemic (systemic infection caused by circulating bacteria in bloodstream) and pneumonic forms, with a case-fatality ratio of 30% to 100% if left untreated. The pneumonic form is invariably fatal unless treated early. It is especially contagious and can trigger severe epidemics through person-to-person contact via droplets in the air.’&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The CDC’s advice reflects the American experience of plague, as they have rarely had to deal with a substantial outbreak of primary pneumonic plague, and not at all in recent history. The WHO has a more global perspective. Whether a plague outbreak is primarily pneumonic or bubonic doesn’t seem to follow a clear patten. To quote from the paper ‘Pneumonic Plague: Incidence, Transmissibility and Future Risks’, published in January 2022:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;‘The transmissibility of this disease seems to be discontinuous since in some outbreaks few transmissions occur, while in others, the progression of the epidemic is explosive. Modern epidemiological studies explain that transmissibility within populations is heterogenous with relatively few subjects likely to be responsible for most transmissions and that ‘super spreading events’, particularly at the start of an outbreak, can lead to a rapid expansion of cases. These findings concur with outbreaks observed in real-world situations. It is often reported that pneumonic plague is rare and not easily transmitted but this view could lead to unnecessary complacency…’&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Because some western public health bodies have been slow to accept the WHO’s findings, a historian writing about the Black Death could come to radically different conclusions on the characteristics and transmission of medieval plague just because of which disease research body they trust most, or which papers they happen to have read. If they took as their starting point a paper on plague published before 2017 and deferred to the CDC, then they would reasonably assume that the role of pneumonic plague in the Black Death was barely noteworthy. If they instead began with studies about the 2017 outbreak in Madagascar and deferred to the WHO, they would reasonably assume that pneumonic plague is capable of wreaking havoc. Having read about twenty papers and several book chapters in writing this, I feel confident in saying that many historians’ beliefs on the characteristics of plague are not really based on medical science. Much of the historical literature I looked at was severely lacking in recent medical literature and fall back on a dismissal of pneumonic plague that is, at this point, a cultural assumption.&lt;/p&gt;\n\n&lt;p&gt;To an extent, that isn’t really their fault. A further complication here is the pace of publication on the medical side. One of the recent innovations in archaeology has been the analysis of blood preserved inside people’s teeth, which are usually the best-preserved bones, and this has opened a fantastic new way of studying plague and historical disease in general. But it’s only something that became practical about a decade ago. Modern research on plague has been largely derived from outbreaks in Madagascar in the 2010s, so that’s all very recent and continually improving. Furthermore, due to Covid, research into infectious disease is rolling in money and the pace of research has accelerated further as a result. In just the time it took me to write this, several new papers on plague were published. A paper on plague from as recently as 2020 could be obsolete already. Medical research on plague moves at such a pace these days that it’s almost impossible to be up to date and comprehensive, making authoritative research somewhat difficult because any conclusion may be overturned within a few years. Combine that with the fact that publishing academic articles or books in history can take over a year from submission to full publication, the field could move on and make the book partially outdated before it hits the shelves even if it was up to date when written. A stronger and globally authoritative understanding of plague will probably emerge in the coming couple of decades, but right now the state of research is too volatile. This raises another problem: &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Problem 2 – The Historical Evidence Often Sucks&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Writing the history of disease is extremely difficult, if only because it requires doctoral level expertise in a variety of radically different fields to the extent that it’s not really possible to be adequately qualified. Someone writing the history of a pandemic needs to be an expert in both epidemiology and the relevant period of history. At the very least, they need to be competent in reading archaeological studies, medical journals, and history journals, which all have different characteristics and training requirements to understand. A history journal article from 10 years ago is generally taken as trustworthy, but a medical journal article from 10 years ago has a decent chance of being obsolete or discredited. Not all historians writing about disease are savvy to that. Many medical papers, used to methodologies built around aggregating data, don’t know what to do with narrative sources like a medieval medical treatise, so they tend to ignore them entirely. It would really help if our medieval sources were more detailed than a single paragraph on symptoms and progression. &lt;/p&gt;\n\n&lt;p&gt;But they generally aren’t. Most have been lost to time. Others are fragmentary and limited. The documentary evidence like legal records (mainly wills) can be problematic because many local administrations struggled to accurately record events as their clerks dropped dead. To give a sense of scale, the &lt;em&gt;Calendar of Wills Proved and Enrolled in the Court of Husting&lt;/em&gt;, which contains a record of medieval wills from the city of London, usually has about 10 pages of entries per year. For the years 1348-1350, there are 120 pages of entries. But even that is a tiny fraction of the people who died there, and we have no way of really knowing how reliably they track the spread of the disease because a lot of victims would have died before having the chance to write a will. The worse an outbreak was, the harder it would have been to keep up. And London was one of the better maintained medieval archives that did an admirable job of functioning during the pandemic. This means our contemporary evidence leaves us with a very incomplete understanding of the Black Death in local administrative documents, though the sheer quantity of wills gives the misleading impression that we’ve got evidence to spare. &lt;/p&gt;\n\n&lt;p&gt;Additionally, medieval sources don’t always provide the clearest picture of symptoms and severity. The ones I quoted above are as good as it gets. In part, this is because many medieval writers felt unable to challenge established classical wisdom from Roman writers like Galen. But it is mostly because they did not have the technology to really understand what was happening. A further issue is the fact that a set of symptoms can be caused by several diseases. Most sources give us a vague paragraph saying that a plague arrived and killed a lot of people. We don’t know that ‘plague’ in these contexts always means &lt;em&gt;the&lt;/em&gt; plague, just like when someone says they have ‘the flu’ they don&amp;#39;t necessarily know they&amp;#39;ve been infected with influenza; they know they have a fever and runny nose and think &amp;#39;oh, that&amp;#39;s the flu&amp;#39;. In the case of plague symptoms, there are a lot of diseases that cause serious respiratory issues, and many that cause localised swelling. Buboes are strongly associated with YP infection, but they can also be caused by other things such as tuberculosis. The difficulty of identifying plague was perceived as so significant that late medieval Milan had a city official with the specific job of inspecting people with buboes to check whether it was really plague (in which case public health measures needed to be enacted), or if they had something that only &lt;em&gt;looked&lt;/em&gt; like plague. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Problem 3 – These Factors Diminish the Quality of Scholarship&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;These challenges manifest in a particularly frustrating way. When a paper is submitted to a journal, it has to go through a process of peer review in which the editorial panel of the journal scrutinise it to check that the paper is worthy of publication, and they will often contact colleagues they know to weigh in. But how many medievalists sit on the editorial board of journals like &lt;em&gt;Nature&lt;/em&gt; or &lt;em&gt;The Lancet&lt;/em&gt;? Likewise, how many epidemiologists have contacts with historical journals like &lt;em&gt;Journal of Medieval Studies&lt;/em&gt; or &lt;em&gt;Speculum&lt;/em&gt;? While writing this, I have read over a dozen medical journals on the Black Death in respected medical journals that would get laughed at if submitted to a history journal. I assume the reverse is also true, but I lack the medical expertise to really know. To illustrate this, let’s have a look at a couple of recent examples (I’d do more but there’s a word limit to Reddit posts).  &lt;/p&gt;\n\n&lt;p&gt;Beginning with an article I really do not like, let’s look at ‘Plague and the Fall of Baghdad 1258’ by Nahyan Fancy and Monica H. Green, published in 2021 in the journal &lt;em&gt;Medical History&lt;/em&gt;. On paper, this ought to be good. It’s a journal that deliberately aims to bridge the gap between medical and historical research, and the paper is arguing a bold conclusion: that plague was already endemic to the Middle East before the Black Death, reintroduced by the Mongols via rodents hitching a ride in their supply convoys. The authors explain that a couple of contemporary sources note that there was an epidemic following the destruction of Baghdad in 1258 in which over 1000 people a day in Cairo died. To be clear, the paper could be correct pending proper archaeological investigation, but I’m not convinced based on the content of the paper. I think this is a bad paper and I question whether it was properly peer reviewed. The accounts of this epidemic in 1258 are vague, but one the paper quotes is this from the polymath Ibn Wasil:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;#39;A fever and cough occurred in Bilbeis [on the eastern edge of the southern Nile delta] such that not one person was spared from it, yet there was none of that in Cairo. Then after a day or two, something similar happened in Cairo. I was stationed in Giza at that time. I rode to Cairo and found that this condition was spreading across the people of Cairo, except a few.&amp;#39;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Ibn Wasil did write a medical treatise that almost certainly went into a lot more detail, but it is unfortunately lost. All we have is this and a couple of other sources that say almost the same thing. Ibn Wasil caught the disease himself and recovered, but that alone should tell us that this epidemic probably wasn&amp;#39;t plague. If the disease was primarily a respiratory infection (and this is what Ibn Wasil describes it as), then it can’t have been pneumonic plague because Ibn Wasil survived it. If the main symptoms were a nasty fever and cough, then that could be almost any serious respiratory illness. The statement “not one person was spared” should not be taken literally, and even if we do take it literally it is unclear if Ibn Wasil means that it was invariably fatal - and Ibn Wasil was living proof that it wasn’t - or just that almost everyone caught it. Nevertheless, the fact that this pneumonic disease was survivable is sufficient to conclude that it was not plague. That the peer review process at &lt;em&gt;Medical History&lt;/em&gt; failed to catch this is concerning. Although I can’t be sure - I&amp;#39;m not aware of any samples have been taken from victims of the 1258 epidemic to confirm what caused it - I would wager that the cause was tuberculosis, which can present similarly to plague but is less lethal. The possibility that Ibn Wasil may not be describing plague is not given much discussion in the paper. That there are diseases not caused by YP that look a lot like plague is also not seriously considered. It is assumed that because Ibn Wasil describes this epidemic with the Arabic word used to describe the Plague of Justinian, he is literally describing plague. This paper, though interesting, does not seem particularly sound, especially given the boldness of its argument. The paper &lt;em&gt;could&lt;/em&gt; be right, but this is not the way to build such an argument. This paper should have attempted to eliminate other potential causes of the 1258 epidemic, and instead it leaps eagerly to the conclusion that it was plague. &lt;/p&gt;\n\n&lt;p&gt;Next, &lt;em&gt;The Complete History of the Black Death&lt;/em&gt; by Ole Benedicow. This 1000-page book, with a new edition in 2021 (cashing in on Covid, I suspect), is generally excellent and an unfathomable amount of research went into it. It is currently the leading book on the Black Death and its command of the historical side of plague research is outstanding. Unfortunately, it cites only a small amount of 21st century literature. For pneumonic plague he relies heavily on Wu Lien-Teh’s treatise on pneumonic plague written in 1926, some literature from the 1950s-1980s, and then his own previous work. Given how much our understanding of plague has developed in just the last five years, that’s a serious issue. On pneumonic plague, Benedicow says: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;‘Primary pneumonic plague is not a highly contagious disease, and for several reasons. Plague bacteria are much larger than viruses. This means that they need much larger and heavier droplets for aerial transportation to be transferred. Big droplets are moved over much shorter distances by air currents in the rooms of human housing than small ones. Studies of cough by pneumonic plague patients have shown that ‘a surprisingly small number of bacterial colonies develop on culture plates placed only a foot directly opposite the mouth’. Physicians emphasize that to be infected in this way normally requires that one is almost in the direct spray from the cough of a person with pneumonic plague. Most cases of primary pneumonic plague give a history of close association ‘with a previous case for a period of hours, or even days’. It is mostly persons engaged in nursing care who contract this disease: in modern times, quite often women and medical personnel; in the past, undoubtedly women were most exposed. Our knowledge of the basic epidemiological pattern of pneumonic plague is precisely summarized by J.D. Poland, the American plague researcher.’&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Almost all of this has been challenged by recent real world experience. The ‘studies of cough by pneumonic plague patients’ he cites here is from 1953, while the work of J.D. Poland is from 1983. In fact, the most recent thing he cites in his descriptions of pneumonic plague that isn’t his own work is from the 20th century, and some of it is as old as the 1900s. If he was using those older articles as no more than historical context for the development of modern plague research then that would be fine, but he uses these 1900s papers as authoritative sources on how the plague works according to current scientific consensus, which they certainly are not. Benedicow writes that he sees no reason to change his assessment of pneumonic plague for the 2021 edition of this book, which unfortunately reveals that he didn’t even check the WHO webpage, or papers on pneumonic plague from the last five years. This oversight presents itself in a way that is both rather amusing and deeply frustrating. Several sources from the Black Death describe symptoms that seem to be pneumonic plague, and Gui’s account tells us that in Avignon this was especially contagious. That matches our post-2017 understanding of how pneumonic plague can work, but Benedicow spends several pages trying to discredit Gui’s account. To do this, he cites an earlier section of the book (as in, the passage quoted above). Had Benedicow updated the medical side of his understanding, then he would not have to spend page after page trying to argue that many of our major sources were wrong about what their communities went through. What a waste of time and effort! &lt;/p&gt;\n\n&lt;p&gt;While I can’t be certain that Gui was completely right about his observations, or that his description can be neatly divided into a pneumonic phase and bubonic phase, I do think recent advances in our understanding of pneumonic plague mean we should be more willing to trust the people that were there rather than assuming we know better because of a paper from 1953, especially when their descriptions line up well with what we’ve learned since. If Benedicow wants to argue that some of our contemporary sources put an unreasonable amount of emphasis on respiratory illness – which is an argument that could certainly be made well - he needs to do that using &lt;em&gt;current&lt;/em&gt; medical scholarship rather than obsolete or discredited literature from the 20th century. This book is extremely frustrating, because it’s fantastic &lt;em&gt;except&lt;/em&gt; when it discusses pneumonic plague and suddenly the book seems cobbled together from scraps of old research. &lt;/p&gt;\n\n&lt;p&gt;But it’s not a hopeless situation. There are some really good papers on the Black Death, they just tend to be small in scope. A particularly worthy paper is ‘The “Light Touch” of the Black Death in the Southern Netherlands: An Urban Trick?’, published in Economic History Review in 2019. It aims to overturn a longstanding idea about the Black Death, namely that there were regions of the Low Countries where it wasn’t that bad. It does this by sorting administrative records through a careful methodology, paying close attention to the limits of local administration and points out serious errors in previous papers on the subject (particularly their focus on cities rather than the region as a whole). The paper rightly points out that fluctuations in records of wills may be heavily distorted by variation in the geographic scope of the local government’s reach as well as the effects of the plague itself, suggesting that the low number of wills during the years of the Black Death was not because it passed the region by, but because parts of the government apparatus for processing wills ceased to function. A similar study on Ghent (cited by this paper) found the same thing. The paper uses a mix of quantitative analysis of administrative records combined with contemporary narrative sources, all filtered through a thorough methodology, to argue that the Low Countries did not do well in the Black Death. On the contrary, it may have done so badly that it couldn’t process the wills. But this is a study on one small region of the Low Countries, and barely treads into the medical side. In other words, it’s good because it has stayed in its lane and kept a narrow focus. The wider the scope of a paper or book, the greater the complexity of the research, and with that comes a far greater opportunity for major mistakes. &lt;/p&gt;\n\n&lt;p&gt;In addition to this, papers like ‘Modeling the Justinianic Plague: Comparing Hypothesized Transmission Routes’, published in 2020, may also offer a way forward. Although about a different plague pandemic, it uses a combination of post-2017 medical knowledge and historical evidence, though it is primarily the former. It uses mathematical models for the spread of both bubonic and pneumonic plague to see what combination fits with the historical evidence. It’s worth noting here that the contemporary evidence for the Plague of Justinian shows very little, if any, evidence that pneumonic plague was a major issue; there is no equivalent to Gui’s account of Avignon. The paper explains that minor tweaks to the models could be the difference between an outbreak that failed to reach 100 deaths a day before fizzling out and the death of almost the entire city of Constantinople. It concludes that although the closest model they could get to what contemporaries describe was a mixed pandemic of both bubonic and pneumonic, they were not at all confident in that conclusion and deem it unlikely that a primary pneumonic plague occurred in Constantinople. The conclusion they &lt;em&gt;are&lt;/em&gt; confident in is that because it was so hard to get the models to even slightly align with the contemporary figures for deaths per day, the contemporary evidence should be deemed unreliable. If we want to prove that sources like Gui are wrong, this is probably the way to do it, not literature from the 50s. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The State of the Field&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Current Black Death scholarship is a mess, but not a hopeless one. There are good papers chipping away at very specific aspects of the pandemic, but several leading academics who have much broader opinions (such as Green and Benedicow) struggle to keep up with both the relevant historical or medical literature. Green’s article on the plague in 13th century Egypt is implausible, but it got published anyway. Benedicow seems completely unaware of medical advances that discredit significant chunks of his otherwise exemplary work, and unfortunately that tarnishes his entire body of research. There are medical papers that pay no regard at all to the historical literature, and plenty of historical literature that shows a deep lack of understanding of what the state of the medical side has been since 2017. There is a recent book that purports to be a drastic improvement - &lt;em&gt;The Black Death: A New History of the Great Mortality in Europe, 1347-1500&lt;/em&gt; by John Aberth - but it’s not out in my country until 5 May 2022 (there was apparently a release last year going by reviews, but I can’t find it). I really hope it hasn’t made the same oversights as other, recent books on the Black Death. If it succeeds, it might be one of the few books on the Black Death that is both historically and medically up to date. &lt;/p&gt;\n\n&lt;p&gt;The only path forward long term is a cross-disciplinary approach involving teams of both historians and medical professionals. This took me a month to write because I was going back through paper after paper from 2017 onward to check that what I’ve written is correct to the best of our current understanding, and even then I have probably made errors. That paper on the Plague of Justinian was mostly beyond my understanding, as I have no idea what differentiates a good mathematical model of a disease from a bad one and I had to ask for help. If we are to write an &lt;em&gt;actual&lt;/em&gt; ‘Complete History of the Black Death’, then it has to be done by a team of both leading medical researchers and historians specialising in the fourteenth century. If we do not do that, then the field will continue to go in circles.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Bibliography&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Andrianaivoarimanana, Voahangy, et al. &amp;quot;Transmission of Antimicrobial Resistant Yersinia Pestis During A Pneumonic Plague Outbreak.&amp;quot; &lt;em&gt;Clinical Infectious Diseases&lt;/em&gt; 74.4 (2022): 695-702.&lt;/p&gt;\n\n&lt;p&gt;Benedictow, Ole Jørgen. &lt;em&gt;The Complete History of the Black Death&lt;/em&gt;. Boydell &amp;amp; Brewer, 2021.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;The Black Death: The Great Mortality of 1348-1350: A Brief History with Documents&lt;/em&gt;. Springer, 2016.&lt;/p&gt;\n\n&lt;p&gt;Bramanti, Barbara, et al. &amp;quot;Assessing the Origins of the European Plagues Following the Black Death: A Synthesis of Genomic, Historical, and Ecological Information.&amp;quot; &lt;em&gt;Proceedings of the National Academy of Sciences&lt;/em&gt; 118.36 (2021).&lt;/p&gt;\n\n&lt;p&gt;Carmichael, Ann G. &amp;quot;Contagion Theory and Contagion Practice in Fifteenth-Century Milan.&amp;quot; &lt;em&gt;Renaissance Quarterly&lt;/em&gt; 44.2 (1991): 213-256.&lt;/p&gt;\n\n&lt;p&gt;Dean, Katharine R., et al. &amp;quot;Human Ectoparasites and the Spread of Plague in Europe During the Second Pandemic.&amp;quot; &lt;em&gt;Proceedings of the National Academy of Sciences&lt;/em&gt; 115.6 (2018): 1304-1309.&lt;/p&gt;\n\n&lt;p&gt;Demeure, Christian E., et al. &amp;quot;Yersinia Pestis and Plague: An Updated View on Evolution, Virulence Determinants, Immune Subversion, Vaccination, and Diagnostics.&amp;quot; &lt;em&gt;Genes &amp;amp; Immunity&lt;/em&gt; 20.5 (2019): 357-370.&lt;/p&gt;\n\n&lt;p&gt;Evans, Charles. &amp;quot;Pneumonic Plague: Incidence, Transmissibility and Future Risks.&amp;quot; &lt;em&gt;Hygiene&lt;/em&gt; 2.1 (2022): 14-27.&lt;/p&gt;\n\n&lt;p&gt;Fancy, Nahyan, and Monica H. Green. &amp;quot;Plague and the Fall of Baghdad (1258).&amp;quot; &lt;em&gt;Medical History&lt;/em&gt; 65.2 (2021): 157-177.&lt;/p&gt;\n\n&lt;p&gt;Heitzinger, K., et al. &amp;quot;Using Evidence to Inform Response to the 2017 Plague Outbreak in Madagascar: A View From the WHO African Regional Office.&amp;quot; &lt;em&gt;Epidemiology &amp;amp; Infection&lt;/em&gt; 147 (2019).&lt;/p&gt;\n\n&lt;p&gt;Mead, Paul S. &amp;quot;Plague in Madagascar - A Tragic Opportunity for Improving Public Health.&amp;quot; &lt;em&gt;New England Journal of Medicine&lt;/em&gt; 378.2 (2018): 106-108.&lt;/p&gt;\n\n&lt;p&gt;Parra-Rojas, Cesar, and Esteban A. Hernandez-Vargas. &amp;quot;The 2017 Plague Outbreak in Madagascar: Data Descriptions and Epidemic Modelling.&amp;quot; &lt;em&gt;Epidemics&lt;/em&gt; 25 (2018): 20-25.&lt;/p&gt;\n\n&lt;p&gt;“Plague.” Centers for Disease Control and Prevention, 6 Aug. 2021, &lt;a href=\"https://www.cdc.gov/plague/index.html\"&gt;https://www.cdc.gov/plague/index.html&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;“Plague.” World Health Organization, &lt;a href=\"https://www.who.int/news-room/fact-sheets/detail/plague\"&gt;https://www.who.int/news-room/fact-sheets/detail/plague&lt;/a&gt; &lt;/p&gt;\n\n&lt;p&gt;Rabaan, Ali A., et al. &amp;quot;The Rise of Pneumonic Plague in Madagascar: Current Plague Outbreak Breaks Usual Seasonal Mould.&amp;quot; &lt;em&gt;Journal of Medical Microbiology&lt;/em&gt; 68.3 (2019): 292-302.&lt;/p&gt;\n\n&lt;p&gt;Randremanana, Rindra, et al. &amp;quot;Epidemiological Characteristics of an Urban Plague Epidemic in Madagascar, August–November, 2017: An Outbreak Report.&amp;quot; &lt;em&gt;The Lancet Infectious Diseases&lt;/em&gt; 19.5 (2019): 537-545.&lt;/p&gt;\n\n&lt;p&gt;Roosen, Joris, and Daniel R. Curtis. &amp;quot;The ‘Light Touch’ of the Black Death in the Southern Netherlands: An Urban Trick?.&amp;quot; &lt;em&gt;The Economic History Review&lt;/em&gt; 72.1 (2019): 32-56.&lt;/p&gt;\n\n&lt;p&gt;White, Lauren A., and Lee Mordechai. &amp;quot;Modeling the Justinianic Plague: Comparing Hypothesized Transmission Routes.&amp;quot; &lt;em&gt;PLOS One&lt;/em&gt; 15.4 (2020): e0231256.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/u18kbn/monday_methods_black_death_scholarship_and_the/",
  "subreddit": "AskHistorians",
  "id": "u18kbn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In the coming years and decades, many histories of the Covid-19 pandemic will be\nwritten. And if Black Death scholarship is any indicator of how historical\npandemics are studied, those histories may suck. In this Monday Methods we’re\ngoing to look at the Black Death and how current scholarship…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今後数年、数十年の間に、コヴィッド19のパンデミックに関する多くの歴史が\n書かれた。そして、もし黒死病の研究が、歴史上どのようなものであるかを示すものであるならば\nパンデミックに関する研究は、最悪なものになるかもしれない。今回のマンデーメソッドでは\n黒死病と、現在の学問がどのようなものかを見ていく。",
      "title": "月曜日のメソッド-黒死病の学問と医学史の悪夢"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在未来几年和几十年里，将有许多关于Covid-19大流行病的历史被书写出来。\n撰写。如果黑死病学术研究是历史大流行病研究的任何指标\n大流行病的研究，这些历史可能会很糟糕。在本周一的方法中，我们将\n我们来看看黑死病以及当前的学术研究如何...",
      "title": "周一方法--黑死病学术研究和医学史的噩梦"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在未來幾年和幾十年裏，將有許多關於Covid-19大流行病的歷史被書寫出來。\n撰寫。如果黑死病學術研究是歷史大流行病研究的任何指標\n大流行病的研究，這些歷史可能會很糟糕。在本週一的方法中，我們將\n我們來看看黑死病以及當前的學術研究如何...",
      "title": "週一方法--黑死病學術研究和醫學史的噩夢"
    }
  ]
}