{
  "author": "Skazius",
  "the_new_excerpt": "Go ahead and yell at me but how bad is it really to use Stash app or Robinhood\nto build a Bogle-esque portfolio, both give you access to total US,\ninternational, and bond markets and the UI doesn't make you want to gouge your\neyes out. I know they skim money with order routing on robinhood, I know…",
  "original_created_utc": 1621381206,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "怒られそうですが、StashアプリやRobinhoodを使ってボーグルのようなポートフォリオを構築することがどれほど悪いことか。\nを使ってボーグル風のポートフォリオを組むことがどれほど悪いことか。\n債券市場にアクセスすることができ、UIは目をえぐりたくなるようなものではありません。\n目を抉りたくなるようなUIではありません。ロビンフッドのオーダールーティングでお金をくすねているのは知っていますが...。",
      "title": "このような証券会社のUIには心が痛みます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "继续骂我吧，但使用Stash应用程序或Robinhood建立Bogle式的投资组合到底有多糟糕呢？\n来建立一个博格尔式的投资组合，这两个软件都能让你访问美国、国际和债券市场的全部信息。\n国际和债券市场，而且其用户界面不会让你想把眼睛挖出来。\n眼睛。我知道他们在Robinhood上通过订单路由来获取资金，我知道...",
      "title": "其中一些经纪公司的用户界面伤害了我的灵魂。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "繼續罵我吧，但使用Stash應用程序或Robinhood建立Bogle式的投資組合到底有多糟糕呢？\n來建立一個博格爾式的投資組合，這兩個軟件都能讓你訪問美國、國際和債券市場的全部信息。\n國際和債券市場，而且其用戶界面不會讓你想把眼睛挖出來。\n眼睛。我知道他們在Robinhood上通過訂單路由來獲取資金，我知道...",
      "title": "其中一些經紀公司的用戶界面傷害了我的靈魂。"
    }
  ],
  "title": "The UI of some of these brokerages hurts my soul.",
  "created_utc": 1621415945,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Go ahead and yell at me but how bad is it really to use Stash app or Robinhood to build a Bogle-esque portfolio, both give you access to total US, international, and bond markets and the UI doesn&#39;t make you want to gouge your eyes out. I know they skim money with order routing on robinhood, I know stash is $3 per month, they both have the data you need right there and everything is streamlined for automated investing.</p>\n</div><!-- SC_ON -->",
  "score": 39,
  "permalink": "/r/Bogleheads/comments/nfpvpn/the_ui_of_some_of_these_brokerages_hurts_my_soul/",
  "subreddit": "Bogleheads",
  "id": "nfpvpn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590802231
}