{
  "author": "Incorrect_passport",
  "original_created_utc": 1632910633,
  "title": "Not having enough FIAT to invest in crypto feels bad",
  "created_utc": 1632925880,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I do a work with a lot of  responsibility but the people i work for are basically slavers and pay a misery.</p>\n\n<p>Now let&#39;s add, a girlfriend who lives in another city and  unfortunately  doesn&#39;t have a work so everytime i want to see her i have to spend 70-80 euros just for high speed train (one way, 140-160 for 2 tickets) + all other kind of expenses.</p>\n\n<p>At the end of the month i basically have nothing left to put in crypto, and this makes me feel bad becouse i know i&#39;m not building my future like this.</p>\n\n<p>I know there&#39;s people in situations worst than mine, and i feel you. I personally try to save money as much as possible, i also sold everything i could sell that i don&#39;t use anymore to have that extra cash to invest.</p>\n\n<p>Every little amount we can afford to invest (and to lose, never forget this) is worth, i wish i had those 20k to invest like some of you,  unfortunately i don&#39;t, so best i can do is build this slowly but steadily.</p>\n\n<p>Sorry for the rant, have a nice day</p>\n</div><!-- SC_ON -->",
  "score": 195,
  "permalink": "/r/CryptoCurrency/comments/pxse69/not_having_enough_fiat_to_invest_in_crypto_feels/",
  "subreddit": "CryptoCurrency",
  "id": "pxse69",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I do a work with a lot of responsibility but the people i work for are basically\nslavers and pay a misery.\n\nNow let's add, a girlfriend who lives in another city and unfortunately doesn't\nhave a work so everytime i want to see her i have to spend 70-80 euros just for\nhigh speed train (one way, 140…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は責任のある仕事をしていますが、私が働いている人たちは基本的には\n働いている人たちは基本的に奴隷のようなもので、悲惨な生活を送っています。\n\nさらに、別の都市に住んでいるガールフレンドがいて、残念ながら仕事がないので\n仕事をしていないので、彼女に会いたい時はいつも70〜80ユーロものお金を\n高速鉄道（片道、140...",
      "title": "クリプトに投資するのに十分なFIATを持っていないことは、悪いことだと思っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从事的工作责任重大，但我的工作对象基本上是\n奴隶主，付出的代价很惨重。\n\n现在我们来补充一下，我有一个女朋友，她住在另一个城市，不幸的是她没有工作。\n遗憾的是，她没有工作，所以每次我想去看她的时候，我都要花70-80欧元买高速火车（单程140欧元）。\n高铁（单程，140...",
      "title": "没有足够的FIAT来投资加密货币的感觉不好"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從事的工作責任重大，但我的工作對象基本上是\n奴隸主，付出的代價很慘重。\n\n現在我們來補充一下，我有一個女朋友，她住在另一個城市，不幸的是她沒有工作。\n遺憾的是，她沒有工作，所以每次我想去看她的時候，我都要花70-80歐元買高速火車（單程140歐元）。\n高鐵（單程，140...",
      "title": "沒有足夠的FIAT來投資加密貨幣的感覺不好"
    }
  ]
}