{
  "author": "ApprehensiveStudy671",
  "original_created_utc": 1660043833,
  "title": "Is going down on women emasculating?",
  "created_utc": 1660060917,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Do some women find it as not masculine? Years ago I met a guy who told me that he dated a woman from some non Western country and the first time they were intimate, he wanted to go down on her and she stopped him by saying that real men don&amp;#39;t do that. She was fine with giving him oral though. I was told that going down on women was normalized through porn and that back in the old days, very few men would do such thing. The man who told me this was a friend&amp;#39;s grandpa. I don&amp;#39;t know but I wonder if any women or men see it as something not masculine or simply as something that emasculates a man. I know that many are totally fine with it but I keep wondering if it was somehow normalized through porn.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 156,
  "permalink": "/r/TooAfraidToAsk/comments/wk0o7t/is_going_down_on_women_emasculating/",
  "subreddit": "TooAfraidToAsk",
  "id": "wk0o7t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Do some women find it as not masculine? Years ago I met a guy who told me that\nhe dated a woman from some non Western country and the first time they were\nintimate, he wanted to go down on her and she stopped him by saying that real\nmen don't do that. She was fine with giving him oral though. I was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "男性的でないと感じる女性もいるのでしょうか？数年前、ある男性に会いました。\nある非西洋的な国の女性とデートをして、初めて親密になったとき、その女性は\nをしようとしたら、彼女が「本当の男はそんなことしない」と言って止めたそうです。\nと言って止めたそうです。彼女はオーラルをするのは平気だったそうですが。私は...",
      "title": "女性に下手に出るのはエマニュシュアル？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有些女性认为这不是阳刚之气吗？几年前我遇到一个人，他告诉我说\n他和一个来自非西方国家的女人约会，他们第一次接触时\n他们第一次亲密接触时，他想在她身上下水，她阻止了他，说真正的男人不会这样做。\n男人不会这样做。不过她对给他口交倒是无所谓。我当时...",
      "title": "对女人下流的行为是否有损人格？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有些女性認爲這不是陽剛之氣嗎？幾年前我遇到一個人，他告訴我說\n他和一個來自非西方國家的女人約會，他們第一次接觸時\n他們第一次親密接觸時，他想在她身上下水，她阻止了他，說真正的男人不會這樣做。\n男人不會這樣做。不過她對給他口交倒是無所謂。我當時...",
      "title": "對女人下流的行爲是否有損人格？"
    }
  ]
}