{
  "author": "madtm14",
  "original_created_utc": 1648251443,
  "title": "In season 2 of Bridgerton, it is revealed that the previous Lord Bridgerton died after an allergic reaction to a bee sting in 1803. Would medical professionals have known that this was the case during the Regency era, or the time immediately before it? Or would it have been a mysterious death?",
  "created_utc": 1648319386,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know exactly what the understanding of allergies would have been at the time. Were doctors aware of allergies and their cause to any extent? If not, what would Lord Bridgerton&amp;#39;s death have been attributed to?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/to72ng/in_season_2_of_bridgerton_it_is_revealed_that_the/",
  "subreddit": "AskHistorians",
  "id": "to72ng",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don't know exactly what the understanding of allergies would have been at the\ntime. Were doctors aware of allergies and their cause to any extent? If not,\nwhat would Lord Bridgerton's death have been attributed to?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "でのアレルギーの理解がどうだったのか、正確にはわかりません。\n当時は 医師はアレルギーやその原因についてある程度知っていたのでしょうか。もし、そうでなければ。\nブリッジャートン卿の死は、何に起因していたのだろうか？",
      "title": "Bridgertonのシーズン2では、先代のBridgerton卿が1803年に蜂に刺されたアレルギー反応の末に死亡したことが明らかにされている。リージェンシー時代、あるいはその直前の時代に、医療関係者がこのような事実を知っていただろうか？それとも謎の死だったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道当时对过敏的理解到底是什么？\n当时。医生在任何程度上都知道过敏及其原因吗？如果没有。\n布里奇顿勋爵的死亡会被归因于什么？",
      "title": "在《布里奇顿》第二季中，人们发现前任布里奇顿勋爵是在1803年被蜜蜂蜇伤后出现过敏反应而死亡。在摄政时代或紧接着的时代，医学专家会知道这种情况吗？还是说这将是一次神秘的死亡？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道當時對過敏的理解到底是什麼？\n當時。醫生在任何程度上都知道過敏及其原因嗎？如果沒有。\n布里奇頓勳爵的死亡會被歸因於什麼？",
      "title": "在《布里奇頓》第二季中，人們發現前任布里奇頓勳爵是在1803年被蜜蜂蜇傷後出現過敏反應而死亡。在攝政時代或緊接着的時代，醫學專家會知道這種情況嗎？還是說這將是一次神祕的死亡？"
    }
  ]
}