{
  "author": "Mr_bike",
  "original_created_utc": 1636951390,
  "title": "So I just learned that Benjamin Cowen has a Ph.D. in Nuclear Engineering",
  "created_utc": 1636969260,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Jumped into the deeper end of investing and cryptos this year after I got my feet back on the ground. Was always wary of watching YouTubers for their input especially if it is someone with &#39;those&#39; kinds of thumbnails. I saw someone on this subreddit recommended Coin Bureau, then Guy recommended a few channels including Benjamin Cowen and Digital asset news, and these three have been my go-to channels now.</p>\n\n<p>Was watching his &#39;Bitcoin: powers of x2&#39; this morning and in the last bit of it, he was talking about how he really likes the math when he dubiously speculates because his undergrad was in math, and his Ph.D. is in Nuclear engineering. He said it so casually and after months of watching this guy for shit and giggles, I never choked on my coffee. I never thought to look up his linkin page and yeah. You can google it yourself. Was a NASA undergraduate research assistant and taught NASA space camps during his undergrad. Cross-referenced this and yeah, we don&#39;t deserve this guy&#39;s free analysis. </p>\n\n<p>This guy is always so mellow, realistic, and conservative. He could have easily come onto Youtube calling himself Dr.Crypto and yelling, &quot;I studied for NASA so we&#39;re going to the moon bois!&quot; But Nah, the dude&#39;s chill with a cardboard desk and just likes math enough so he got a Ph.D. in it and offers us free T.A., and if we want we can pay for more, but no pressure. Gotta respect this guy.</p>\n</div><!-- SC_ON -->",
  "score": 373,
  "permalink": "/r/CryptoCurrency/comments/qu8adg/so_i_just_learned_that_benjamin_cowen_has_a_phd/",
  "subreddit": "CryptoCurrency",
  "id": "qu8adg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Jumped into the deeper end of investing and cryptos this year after I got my\nfeet back on the ground. Was always wary of watching YouTubers for their input\nespecially if it is someone with 'those' kinds of thumbnails. I saw someone on\nthis subreddit recommended Coin Bureau, then Guy recommended a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は今年、投資とクリプトの深みにはまっています。\n投資とクリプトに飛び込んだ。YouTuberを見て意見を聞くことにはいつも注意していました。\n特に \"あの \"種類のサムネイルを持つ人の場合は。私は、このサブレディットで誰かが\nこのsubredditで誰かがCoin Bureauを勧めているのを見て、Guyさんが...",
      "title": "ベンジャミン・コーウェンが原子力工学の博士号を持っていることを知りました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今年，在我重新站稳脚跟之后，我跳进了投资和加密货币的深层领域。\n我的脚回到了地面上。我一直对观看优酷网友的投入持谨慎态度\n尤其是那些有 \"那些 \"缩略图的人。我看到有人在\n这个分论坛上有人推荐了Coin Bureau，然后Guy又推荐了一个...。",
      "title": "所以我刚刚了解到，本杰明-考文有一个核工程的博士学位"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今年，在我重新站穩腳跟之後，我跳進了投資和加密貨幣的深層領域。\n我的腳回到了地面上。我一直對觀看優酷網友的投入持謹慎態度\n尤其是那些有 \"那些 \"縮略圖的人。我看到有人在\n這個分論壇上有人推薦了Coin Bureau，然後Guy又推薦了一個...。",
      "title": "所以我剛剛瞭解到，本傑明-考文有一個核工程的博士學位"
    }
  ]
}