{
  "author": "Zennyzen0",
  "original_created_utc": 1628561683,
  "title": "Is there any actual evidence to support the idea that foot fetishes are caused by a \"cross-wiring\" in the brain of genitalia and feet?",
  "created_utc": 1628606129,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve heard countless people repeat to me that foot fetishes are &quot;caused&quot; by the proximity of a part of the brain that registers sexual behavior/arousal to one that registers feet, and if you google &quot;foot fetish and brain&quot; practically every result is some pop-science type description of this. It feels like the real answer would be a lot more nuanced, but I&#39;m not seeing much pushback.</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/askscience/comments/p1fyhb/is_there_any_actual_evidence_to_support_the_idea/",
  "subreddit": "askscience",
  "id": "p1fyhb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've heard countless people repeat to me that foot fetishes are \"caused\" by the\nproximity of a part of the brain that registers sexual behavior/arousal to one\nthat registers feet, and if you google \"foot fetish and brain\" practically every\nresult is some pop-science type description of this. It…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は数え切れないほどの人から、足フェチは、自分の足に性的行動や興奮を記録する脳の部分が近いことが「原因」だと繰り返し聞いてきました。\n足フェチは、性的行動や興奮を記録する脳の部分と、足を記録する脳の部分が近いことが「原因」だと、数え切れないほどの人が言っています。\n足フェチと脳」でググると、ほとんどすべての結果がこのようなポップサイエンス的な説明になっています。\nそして、「フットフェティッシュと脳」をグーグルで検索すると、ほとんどすべての結果がこれに関するポップサイエンスタイプの説明です。それは...",
      "title": "足フェチは、性器と足の脳内での「クロスワイヤリング」によって引き起こされるという考えを裏付ける、実際の証拠はあるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我听过无数人向我重复，恋足癖是由以下原因 \"造成的\n大脑中记录性行为/唤醒的部分与记录脚的部分相近而导致的。\n如果你用谷歌搜索 \"恋足癖和大脑\"，几乎每个结果都是一些流行科学类型的描述。\n结果都是一些流行科学类型的描述。它...",
      "title": "是否有任何实际证据支持恋足癖是由生殖器和脚在大脑中的 \"交叉布线 \"造成的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我聽過無數人向我重複，戀足癖是由以下原因 \"造成的\n大腦中記錄性行爲/喚醒的部分與記錄腳的部分相近而導致的。\n如果你用谷歌搜索 \"戀足癖和大腦\"，幾乎每個結果都是一些流行科學類型的描述。\n結果都是一些流行科學類型的描述。它...",
      "title": "是否有任何實際證據支持戀足癖是由生殖器和腳在大腦中的 \"交叉佈線 \"造成的？"
    }
  ]
}