{
  "author": "RoadTheExile",
  "the_new_excerpt": "In my mind, this is probably unfair, but tobacco is a very American crop (the\ncontinents that is, not specifically the USA), it thrives in this hot moist\nenvironment that screams the US South and I'm sure plenty of places in Latin\nAmerica. During World War 2 obviously Americans could grow our own,…",
  "original_created_utc": 1622423750,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の考えでは、これは不公平かもしれませんが、タバコは非常にアメリカ的な作物です。\nアメリカ大陸でのことで、特にアメリカでのことではありません）、アメリカ南部を代表する高温多湿の環境で育ちます。\n湿った暑い環境で育ちます。\n第2次世界大戦中は、アメリカ人が栽培できました。第二次世界大戦中、アメリカ人は当然、自分たちでタバコを栽培することができましたが...。",
      "title": "第二次世界大戦中、みんなはどこでタバコを買っていたの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我看来，这可能是不公平的，但烟草是一种非常美国化的作物（是指各大洲，而不是专门指美国）。\n大陆，而不是具体的美国），它在这种湿热的环境中茁壮成长。\n它在这种炎热潮湿的环境中茁壮成长，让人联想到美国南部和我确信拉丁美洲的很多地方。\n美国的很多地方。在第二次世界大战期间，显然美国人可以种植我们自己的，...",
      "title": "在第二次世界大战中，每个人都在哪里得到香烟？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我看來，這可能是不公平的，但菸草是一種非常美國化的作物（是指各大洲，而不是專門指美國）。\n大陸，而不是具體的美國），它在這種溼熱的環境中茁壯成長。\n它在這種炎熱潮溼的環境中茁壯成長，讓人聯想到美國南部和我確信拉丁美洲的很多地方。\n美國的很多地方。在第二次世界大戰期間，顯然美國人可以種植我們自己的，...",
      "title": "在第二次世界大戰中，每個人都在哪裏得到香菸？"
    }
  ],
  "title": "Where was everyone getting cigarettes in World War 2?",
  "created_utc": 1622454105,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In my mind, this is probably unfair, but tobacco is a very American crop (the continents that is, not specifically the USA), it thrives in this hot moist environment that screams the US South and I&#39;m sure plenty of places in Latin America. During World War 2 obviously Americans could grow our own, but where were the Russians and the Germans getting their stuff from? I would imagine we weren&#39;t exactly eager to sell luxury goods to the Nazis, and bullets and trucks probably took priority for the Soviet shipping lines. Did Japan have some colonies in the Pacific where they could grow it?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/nop4nq/where_was_everyone_getting_cigarettes_in_world/",
  "subreddit": "AskHistorians",
  "id": "nop4nq",
  "is_self": true,
  "media": null,
  "is_video": false
}