{
  "author": "FakeDaVinci",
  "original_created_utc": 1647882767,
  "title": "Are Pitbulls really that dangerous or are the people who desire to own a pitbull that make it such a dangerous breed?",
  "created_utc": 1647901495,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have seen plenty of clips of friendly pitbulls, some of them do look adorable. However, I am aware that they are very dangerous if they end up attacking someone and should not be treated lightly. But in this case what is the bigger factor in pitbulls having the reputation they have? The fact that mild mannered pitbulls exist is at least an indication that it isn&amp;#39;t all of them.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 122,
  "permalink": "/r/NoStupidQuestions/comments/tjgr88/are_pitbulls_really_that_dangerous_or_are_the/",
  "subreddit": "NoStupidQuestions",
  "id": "tjgr88",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have seen plenty of clips of friendly pitbulls, some of them do look adorable.\nHowever, I am aware that they are very dangerous if they end up attacking\nsomeone and should not be treated lightly. But in this case what is the bigger\nfactor in pitbulls having the reputation they have? The fact that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、フレンドリーなピットブルのクリップをたくさん見てきたし、中には可愛らしく見える子もいる。\nしかし、ピットブルはとても危険な動物であることも知っています。\nそのため、このようなことはありません。しかし、この場合、何がより重要なのでしょうか？\nピットブルの評判を高めた要因とは？それは...",
      "title": "ピットブルは本当に危険なのか、それともピットブルを飼いたいと願う人たちが危険な犬種にしているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我见过很多友好的比特犬的片段，其中一些看起来确实很可爱。\n然而，我知道，如果它们最终攻击别人，它们是非常危险的。\n不应被轻易对待。但在这种情况下，什么是更大的\n是什么因素使比特犬有这样的声誉？事实是，...",
      "title": "斗牛犬真的那么危险吗？还是那些渴望拥有斗牛犬的人让它成为一个危险的品种？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我見過很多友好的比特犬的片段，其中一些看起來確實很可愛。\n然而，我知道，如果它們最終攻擊別人，它們是非常危險的。\n不應被輕易對待。但在這種情況下，什麼是更大的\n是什麼因素使比特犬有這樣的聲譽？事實是，...",
      "title": "鬥牛犬真的那麼危險嗎？還是那些渴望擁有鬥牛犬的人讓它成爲一個危險的品種？"
    }
  ]
}