{
  "author": "Poor_Literature_",
  "the_new_excerpt": "WKHS is clearly set to explode higher given high shot interest of 45% and lack\nof borrow (borrow rate currently ~20%).\n\nNot only that but unlike some other short traps (like WISH which had a very low\nfloat so short % was artificially high), WISH's float is 85% of its shares\noutstanding so the short…",
  "original_created_utc": 1623248291,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "WKHSは、45％という高いショット金利と、借り入れがない（現在の借り入れ金利は～20％）ことから、明らかに爆発的に上昇すると思われる。\n借り入れがない（借り入れ率は現在約20％）。\n\nそれだけでなく、他のいくつかのショートトラップ（浮動株が非常に少ないためにショート率が人為的に高くなっているWISHのような）とは異なります。\nWISHのように浮動株が非常に少ないため、空売りの割合が人為的に高くなっている）とは異なり、WISHの浮動株は発行済株式数の85％なので、空売り...\nWISHの浮動株は発行済み株式数の85%なので、空売りは...",
      "title": "WKHS、ショートスクイーズに突入 - 借り入れなし、ショートインタレストは45%。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "鉴于45%的高利率和缺乏借款（目前借款利率约为20%），WKHS显然将爆发出更高的收益。\n借款（目前借款利率约为20%）。\n\n不仅如此，与其他一些空头陷阱不同的是（如WISH，它的浮盈率很低，所以空头率被人为地抬高了），WISH的浮盈率很高。\n所以空头比例被人为地提高了），WISH的流通股占其股份的85%。\n所以空头...",
      "title": "WKHS将面临空头挤压--没有借款和45%的空头兴趣"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "鑑於45%的高利率和缺乏借款（目前借款利率約爲20%），WKHS顯然將爆發出更高的收益。\n借款（目前借款利率約爲20%）。\n\n不僅如此，與其他一些空頭陷阱不同的是（如WISH，它的浮盈率很低，所以空頭率被人爲地擡高了），WISH的浮盈率很高。\n所以空頭比例被人爲地提高了），WISH的流通股佔其股份的85%。\n所以空頭...",
      "title": "WKHS將面臨空頭擠壓--沒有借款和45%的空頭興趣"
    }
  ],
  "title": "WKHS Set for Short Squeeze - No borrow and 45% Short Interest",
  "created_utc": 1623281199,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>WKHS is clearly set to explode higher given high shot interest of 45% and lack of borrow (borrow rate currently ~20%).</p>\n\n<p>Not only that but unlike some other short traps (like WISH which had a very low float so short % was artificially high), WISH&#39;s float is 85% of its shares outstanding so the short interest cannot be lowered simply by releasing shares from lockup. </p>\n\n<p>This all sets up for a massive squeeze in a short time span as short sellers simply cannot pay such a high borrow rate especially with shorts being targeted, the panic will set in soon and this will easily take off to $25 or higher.</p>\n\n<p>I am all in on Jun 18th $20 calls as I believe a short squeeze is inevitable and coming ASAP once the crowd loses interest in WISH (fake high short interest) and CLOV</p>\n</div><!-- SC_ON -->",
  "score": 1347,
  "permalink": "/r/wallstreetbets/comments/nvx0yj/wkhs_set_for_short_squeeze_no_borrow_and_45_short/",
  "subreddit": "wallstreetbets",
  "id": "nvx0yj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404895338
}