{
  "author": "Martin_Buber",
  "original_created_utc": 1624407870,
  "title": "In those American states that did not join the Confederacy but still had legal slavery such as Maryland, Delaware and Missouri, what was the practice of slavery like during the war?",
  "created_utc": 1624422413,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What I mean to ask is, did things for slave masters and slaves continue to go on as before? Were slave owners encouraged or pressured to free their slaves by the society writ large, so that slavery was abolished de facto? Were slave owners seen as a potential fifth column and subject to suspicion? How did slave owners who supported the Union and the federal government justify their side in the conflict with regards to their practice of slavery, since they surely would&#39;ve known that if the South lost the war then slavery would be abolished throughout the nation? Or did they not know that, and believe that at wars end the nation would return to the antebellum status quo, or that slavery would only be abolished in those states which rebelled? </p>\n\n<p>That last point seems quite difficult to believe, as the abolitionist movement had already become much more  radical and uncompromising throughout the 50s, after the passage of the Fugitive Slave Act and the Kansas-Nebraska Act, and the subsequent armed conflict which followed that, and that years of war with hundreds of thousands dead or maimed would only increase that sentiment.</p>\n\n<p>My apologies if this is a query with a well known answer, I&#39;m not American and have only recently developed an interest in the history of the United States.</p>\n\n<hr/>\n\n<p>As an addendum to the primary question, I would also like to know what the practice of slavery was like in these border states before the war? From what I&#39;ve read, in decades preceding the war there was a movement of slaves and slave owners toward the deeper South, and the traditional plantation economy was already in decline in states such as Maryland; does this mean that most slaves in these places would&#39;ve been household servants, field hands for smallholders, or even workers in urban and bourgeois professions and the trades?</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/AskHistorians/comments/o6190j/in_those_american_states_that_did_not_join_the/",
  "subreddit": "AskHistorians",
  "id": "o6190j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "What I mean to ask is, did things for slave masters and slaves continue to go on\nas before? Were slave owners encouraged or pressured to free their slaves by the\nsociety writ large, so that slavery was abolished de facto? Were slave owners\nseen as a potential fifth column and subject to suspicion?…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が聞きたいのは、奴隷主と奴隷の関係は以前と同じように続いていたのかということです。\n以前と同じように？奴隷所有者は、社会全体から奴隷を解放するように勧められたり、圧力をかけられたりして、事実上、奴隷制度は廃止されたのでしょうか？\n社会全体が奴隷を解放するように促したり、圧力をかけたりして、事実上、奴隷制度が廃止されたのでしょうか？奴隷所有者は\n奴隷所有者は第五列の可能性があるとみなされ、疑われていたのでしょうか...。",
      "title": "南部連合に参加せず、メリーランド州、デラウェア州、ミズーリ州など、合法的な奴隷制を維持していたアメリカの州では、戦時中、奴隷制はどのように行われていたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想问的是，奴隶主和奴隶的事情是否继续下去了？\n像以前一样吗？奴隶主是否受到社会的鼓励或压力而释放他们的奴隶？\n奴隶主是否受到整个社会的鼓励或压力，使奴隶制在事实上被废除？奴隶主们是否被视为\n是否被视为潜在的第五纵队而受到怀疑？",
      "title": "在那些没有加入南方联盟但仍有合法奴隶制的美国州，如马里兰州、特拉华州和密苏里州，战争期间的奴隶制实践是怎样的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想問的是，奴隸主和奴隸的事情是否繼續下去了？\n像以前一樣嗎？奴隸主是否受到社會的鼓勵或壓力而釋放他們的奴隸？\n奴隸主是否受到整個社會的鼓勵或壓力，使奴隸制在事實上被廢除？奴隸主們是否被視爲\n是否被視爲潛在的第五縱隊而受到懷疑？",
      "title": "在那些沒有加入南方聯盟但仍有合法奴隸制的美國州，如馬里蘭州、特拉華州和密蘇里州，戰爭期間的奴隸制實踐是怎樣的？"
    }
  ]
}