{
  "author": "cityslicker265",
  "the_new_excerpt": "I'm not going to give you a wall of text that you will probably skim through,\ninstead I'd like to show you 4 graphs that I've studied at length which I feel\ndepict my thesis in shortest amount of time then provide brief explanations\n\nThesis- The stock market is at an unsustainable high valuation and…",
  "original_created_utc": 1619937822,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここでは、皆さんが読み飛ばしてしまうような大量の文章を提供するつもりはありません。\nその代わりに、私がじっくりと研究した4つのグラフをお見せしたいと思います。\n私の論文を最短時間で表現し、簡単な説明を加えた4つのグラフをお見せします。\n\n仮説- 株式市場は維持できないほどの高評価を受けており、...",
      "title": "9月までに市場が30～50％の調整を行うと思う理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不打算给你一墙的文字，你可能会略过。\n相反，我想向你们展示我详细研究过的4个图表，我觉得这些图表\n在最短的时间内描绘出我的论点，然后提供简短的解释\n\n论点--股票市场处于不可持续的高估值，而...",
      "title": "为什么我认为市场将在9月前出现30-50%的调整"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不打算給你一牆的文字，你可能會略過。\n相反，我想向你們展示我詳細研究過的4個圖表，我覺得這些圖表\n在最短的時間內描繪出我的論點，然後提供簡短的解釋\n\n論點--股票市場處於不可持續的高估值，而...",
      "title": "爲什麼我認爲市場將在9月前出現30-50%的調整"
    }
  ],
  "title": "Why I think the market will see a 30-50% correction by September",
  "created_utc": 1619954600,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m not going to give you a wall of text that you will probably skim through, instead I&#39;d like to show you 4 graphs that I&#39;ve studied at length which I feel depict my thesis in shortest amount of time then provide brief explanations</p>\n\n<p><strong>Thesis-</strong> The stock market is at an unsustainable high valuation and when tracking historical times of similar booms we see a sharp pullback in the years following a squeeze of like magnitude. High speculation coupled with total uncertainty in rate tapering timing will lead to a 30+% correction in the summer of 2021. Retail spending will be at ATH, supply shortages will be at ATH, and inflation levels will spike to 2009-2010 levels.</p>\n\n<p><strong>Graph #1 - Bank Of America Global Research Sell Side Indicator</strong>*(this charts buy and sell signals based on 15year averages)*</p>\n\n<p><a href=\"https://preview.redd.it/ydij4ihjfmw61.png?width=620&amp;format=png&amp;auto=webp&amp;s=f611bea4713da9a7257ba2708dd8a0e9b595960e\">Currently we are less than one point from a sell indication(blue line nearing red line). In history, corrections occur directly following a sell signal call.</a></p>\n\n<p><strong>Graph #2 - VIX/VXV</strong>*( the VIX is a real-time market index representing the market’s expectations for volatility over the coming 30 days, the lesser know VXV measures implied volatility three months out. One way to look at fear/greed is to use the VIX divided by the VXV: VIX/VXV ratio )*</p>\n\n<p><a href=\"https://preview.redd.it/wt3l6uw7imw61.png?width=1553&amp;format=png&amp;auto=webp&amp;s=10d9ec18390ed9a56dfd4908687db964456e330f\">The current VIX/VXV ratio sits at 0.754. When the rate is about this low, vertical blue lines, returns for the S&amp;P500 are often less than stellar. Namely, in 2012 the S&amp;P500 lost 10-14% eventually. In 2015 the index stalled almost a year, adding a mere 3.5%, only to lose nearly 15%. Similarly, in 2016, albeit the pullback was shallow (-5%). In 2017 there were several &lt;0.75 readings, and the market ignored those, gaining almost 20% since the first reading in August 2020 but losing at least 6% since the last &lt;0.75 reading from December 2020. Besides, less low readings, like in 2018 and 2019, can still lead to 20% losses.</a></p>\n\n<p><strong>Graph #3 - Fibonacci Retracement</strong> <em>(Fibonacci retracement levels are horizontal lines that indicate the possible locations of support and resistance levels. It shows how much of a prior move the price has retraced. The direction of the previous trend is likely to continue. However, the price of the asset usually retraces to one of the ratios listed above before that happens. )</em></p>\n\n<p><a href=\"https://preview.redd.it/u2kxm0abjmw61.png?width=1427&amp;format=png&amp;auto=webp&amp;s=f99b4385974681a7d962fa060f3789f94808a0ef\">The white lines are the resistance levels at 8 month intervals. The 5th sequence of the cycle usually results in the further move to the downside. Following this trend, the 5th wave would happen between july and september 2021.</a></p>\n\n<p><strong>Graph #4- VIX Bollinger Bands</strong> <em>( Bollinger Bands are curves drawn in and around the price structure usually consisting of a moving average (the middle band), an upper band, and a lower band that answer the question as to whether prices are high or low on a relative basis.</em> <em>The narrow bands suggest a period of low volatility. Widening bands suggest an increase in volatility often associated with a trending market environment )</em></p>\n\n<p><a href=\"https://preview.redd.it/mgqaw23ckmw61.png?width=1256&amp;format=png&amp;auto=webp&amp;s=c6f3bb372d06e78930b81efa8e1f2ba5067f546f\">In the graph, we see the VIX(Tracks options volatility) at two time periods: 2008 Recession &amp; Present Day. In 2008 we saw the VIX fall through 2009 and into early 2010 as the economy was bailed out. Bollinger bands leveled out at peak separation from top and bottom bands which led to a market sell off shortly after, further lengthening the economic recovery. Following this trend we are in the same cycle as post 2008 recovery, with the markets speculation growing towards a potential catalyst in the form of an interest, tax or wage rate hike.</a></p>\n\n<p><strong>CONCLUSION</strong>: History shows us there is cycles to our financial nature as human beings, analysis shows us the cycle end is nearing. Overvaluation, abundance of cash, and supply restrictions will ultimately lead to a correction in anticipation of coming inflation.</p>\n\n<p><strong>PREDICTIONS</strong> Federal reserve begins slowing asset purchasing in June and overvalued mid and small cap stocks will sell off to offset heavy weighted holdings( lowers taxes with realized losses), by July 4th news reports on lay offs from material shortages will begin, July and August will be red, and September-December will be a recovery back to 200 day moving averages.</p>\n\n<p>$SPY $350 &amp; VIX $50 by 7/15</p>\n</div><!-- SC_ON -->",
  "score": 4948,
  "permalink": "/r/wallstreetbets/comments/n30u1l/why_i_think_the_market_will_see_a_3050_correction/",
  "subreddit": "wallstreetbets",
  "id": "n30u1l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380970814
}