{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "Good Friday evening to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning October 4th, 2021.\n\n# **October may have a bad reputation, but stocks are entering a normally positive period - [(Source)](https://www.cnbc.com/2021/10/01/october-may-have-a-bad-reputation-but-stocks-are-entering-a-normally-positive-period.html)**\n*****\n> October may have a bad reputation, but the fourth quarter has mostly been a positive time for stocks.\n*****\n> Despite worries about central bank tightening, the debt ceiling, Chinese developer Evergrande and Covid-19, many strategists expect stocks to eclipse recent highs after a rocky period in October.\n*****\n> The S&P 500 has averaged outsized gains of 3.9% in the fourth quarter and was up four out of every five years since World War II, according to CFRA. The next best quarter is the first, with an average gain of 2.3%. The worst is the third, up just 0.6%.\n*****\n> “Q4 2021 will likely record a higher-than-average return. However, investors will need to hang on tight during the typically tumultuous ride in October, which saw 36% higher volatility when compared with the average for the other 11 months,” notes CFRA chief investment strategist Sam Stovall.\n*****\n> The S&P 500 eked out a small gain for the third quarter, but was down nearly 5% for the month of September, with a bad ending as the S&P 500 dropped 1.2% on Thursday.\n*****\n> The indexes kicked off the first trading session in October on a positive note, however. With the S&P 500 adding 1.1% and the Nasdaq closing 0.8% higher on Friday. The Dow Jones Industrial Average added 482.54 points.\n*****\n> https://i.imgur.com/FEg9jmU.png\n*****\n> Bespoke Investment Group analyzed the behavior of the S&P 500 in years when it was up solidly year-to-date heading into the fourth quarter. In those years, the market typically gained in the quarter, but there were weaker than normal returns in October and the quarter itself, when September was a negative month.\n*****\n> “The S&P 500 has been down in September 50 times since 1928, and in those years, it has actually averaged a decline of 0.41% in October and a gain of just 0.75% in Q4,” Bespoke noted. When September’s performance was positive, the S&P gained a much stronger 1.6% average in October and an average 5% in the fourth quarter, according to the firm.\n*****\n> Bespoke found that while October is remembered for stock market crashes, like those in 1929 and 1987, the market is usually positive. The Dow, for instance, gained 60% of the time in October over the past 50 years, averaging an increase of 0.5%. It was negative most of the time in September, with an average loss of 0.9%.\n*****\n> # Jobs, jobs, jobs\n> One of the first hurdles markets face in the new quarter is Friday’s employment report, potentially one of the final triggers for the Federal Reserve’s decision on when to taper its $120 billion-a-month bond buying program.\n*****\n> Economists expect about 475,000 jobs were added in September, according to an early consensus figure from FactSet. Just 235,000 payrolls were added in August, about 500,000 less than expected.\n*****\n> “The only way I could see them delaying the tapering is if we get a very weak number, something closer to zero,” said Ethan Harris, head of global economic research at Bank of America. “Anything that looks like 100,000, 200,000, they just go ahead” with the taper.\n*****\n> Harris said the biggest concern for the economy remains Covid, though new cases are slowing.\n*****\n> “The big question is when does the Covid story start to fade a bit, allowing activity to come back,” he said. He expects the pandemic will continue to be a big factor in the labor market in September.\n*****\n> “We think fear of getting Covid on the job was a big factor in August and will be a factor in September as well,” he said. “By October, the early hints are people are starting to feel more comfortable and you should get some beginnings of a reacceleration of job growth.”\n*****\n> The market got some positive news on that front on Friday with Merck’s promising data for its Covid antiviral pill.\n*****\n> # Central banks tightening\n> A big event in the fourth quarter could be the beginning of the unwind of the Federal Reserve’s easy policies.\n*****\n> The central bank last week signaled it is nearly ready to take that first step away from the policies used during the pandemic to maintain financial market liquidity and help the economy.\n*****\n> The Fed is widely expected to announce in November that it will start to slow its bond purchases, and Fed Chairman Jerome Powell said he expects it to finish by the middle of next year.\n*****\n> Other central banks around the world are also making the same noises or actually moving to raise interest rates. Bond market pros now expect a trend toward higher interest rates.\n*****\n> Just in the past week, rates shot higher, with the 10-year Treasury yield rising from about 1.31% while the Fed was meeting Sept. 22 to as high as 1.56% just a week later. On Friday, the yield eased back a bit to just under 1.50%.\n*****\n> https://i.imgur.com/9dO7jZc.png\n*****\n> The move toward tapering so far has not had much impact on markets, though strategists say it could if yields shoot higher. The bond buying program, or quantitative easing, was also credited with providing market liquidity, which has been fuel for stock market gains.\n*****\n> “The Fed is trying very hard to telegraph what they are doing well in advance and take the shock out of what they’re doing. Bond yields have gone up a bit but not in a way that’s troubling for the economy,” said Harris. “The real risk from the Fed comes when they start talking about hiking interest rates. ... That’s a story for next year.”\n*****\n> Rising yields would become more risky for stocks if they were to continue to move up rapidly. Tony Crescenzi, PIMCO executive vice president, said he expects the benchmark 10-year Treasury yield to trade in a range of 1.50% to 2% this year.\n*****\n> Crescenzi said the move higher in yields has to do with more persistent inflation expectations and the Fed’s persistent move toward less easy policy. “It’s still marching forward with its plan to taper and eventually tighten,” he said. “The taper doesn’t set a date for tightening, but the clock starts ticking once the taper begins.”\n*****\n> The jump in rates rattled stocks in the past week, particularly tech stocks. The S&P 500 was lower by 2.2% for the week and the Nasdaq shed 3.2%.\n*****\n> # Surprising earnings\nEarnings have been a big catalyst for the stock market, with huge upside surprises boosting sentiment this year. But some strategists warn that if companies sound too cautious when they report third-quarter profits in the next couple of weeks, that could be a forewarning for the market.\n*****\n> Julian Emanuel, head of equity and derivative strategy at BTIG, said rising earnings estimates for this year and next year have been a tailwind. “Those in our view have now plateaued and potentially peaked,” he said. “If the market perceived they peaked rather than plateaued on a near to medium-term basis, then we have a problem for the stock market.”\n*****\n> Investors are also watching the supply chain issues that are disrupting many companies’ ability to get parts and even products. They are already impacting earnings and pressuring margins. Some have already warned about the problem, and more are expected to detail the issues during earnings calls.\n*****\n> Congress averted a government shutdown, but political feuding is likely to hang over the markets in the fourth quarter. The bigger task facing lawmakers will be to raise the debt ceiling, which could become worrisome for markets if the government reaches the limit before action is taken.\n*****\n> As the fourth quarter moves ahead, the fate of the proposed $3.5 trillion infrastructure plan, which is opposed by Republicans and some Democrats, remains up in the air. Bank of America’s Harris said he expects it to be cut back to about $1.5 trillion.\n*****\n> # Other issues\nChinese property developer Evergrande’s failure to make its debt payments temporarily spooked the market in September. Its problems are not solved even as investors expect that a financial meltdown will be averted.\n*****\n> Evergrande’s progress will remain an important story for the markets in the fourth quarter, as the company struggles under its $300 billion debt burden.\n*****\n\n# **This past week saw the following moves in the S&P:**\n###### **([CLICK HERE FOR THE FULL S&P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/DxoNJCE.png))**\n\n# **S&P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/nz0naN5.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/uWt4LHK.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/JSLq6e1.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/RtabSpV.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/tJmePd2.png))**\n\n# **S&P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/6HSoEdC.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ScqSlq1.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/e0S19DA.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!]())**\n(T.B.A. THIS WEEKEND.)\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/JWcdTjl.png))**\n\n# **Friday's Stock Analyst Upgrades & Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/JeByjl1.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/4dO1a3g.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/vOWwHAb.png))**\n\n*****\n\n> # Mega Caps Underperforming as Energy Explodes\n\n> In November of last year, we took a look at the performance spread between the equal and market cap weighted versions of the S&P 500. The chart below provides an update through the end of September where positive readings indicate outperformance of the equal-weight S&P 500 and negative readings indicate outperformance of the market cap weighted index. In March 2020, as the market was plunging from the February peak and bottoming towards the end of the month, mega-caps such as Apple (APPL), Microsoft (MSFT), Alphabet (GOOGL), Amazon (AMZN), and Facebook (FB) significantly outperformed the broader market, resulting in a 5.68 percentage point spread between the return of the equally weighted and market cap weighted S&P 500. Whereas the equal-weighted index declined 18.19% in March 2020, the market cap weighted index dropped 'just' 12.51%. In a reversal of these trends, the equal-weighted index outperformed between the months of September 2020 and March 2021, rallying 30.84% while its market cap weighted counterpart gained 18.14%. Over these months, there was a maximum monthly spread of 3.37 percentage points in favor of the equal-weighted index, which occurred last December. In recent months, mega-caps briefly took back the reins before the trend reversed in September when the equal-weighted index outperformed by 0.82 percentage points.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/10/10121-Spread.png))**\n\n> With the month of September behind us, the table below lists the 18 stocks in the S&P 500 that finished the month up over 10%, and less than a quarter of the stocks in the index (22%) finished the month higher. Overall, the average performance of stocks in the index was a decline of 3.7 percentage points. While short-term performance has been weak, on a YTD basis, 81.42% of S&P 500 stocks are up on the year, and the overall average gain is 18.90%. Of the stocks that have rallied 10%+ in September, more than half are from the Energy sector and another three come from the Financials sector.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/10/over-ten-percent-updates.png))**\n\n*****\n\n> # Q3 Asset Class Performance\n\n> Q3 and the month of September are now in the books, and it was not a great period for US equities. As shown in our asset class performance matrix below, the sole portion of the US equity market that was higher in September was Energy stocks. Every other sector, theme, and major index was lower on the month. As for global equities, performance was more mixed with declines ranging from 11.73% for Brazil (EWZ) to a 3.55% gain for Russia, though, most country ETFs were lower on the month.\n\n> Commodities had a good month particularly in the energy space with crude oil (USO) gaining 9.41% and Natural Gas (UNG) rising an astounding 31.59%. That lifted the total gain in Q3 to 54.13% while it has returned almost 120% year to date; the best performer for both time periods. Precious metals, namely silver (SLV), on the other hand, was hit particularly hard. As for c/ryptos, Ethereum (ETHE) was another top performer YTD and in Q3, but September pared those gains. ETHE fell 13.62% in September while B/itcoin (GBTC) also fell by double-digit percentages.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/10/acpm093021.png))**\n\n*****\n\n> # Could There Be An October Crash?\n\n> “October: This is one of the peculiarly dangerous months to speculate in stocks. The others are July, January, September, April, November, May, March, June, December, August and February.” Mark Twain\n\n> Well, it was bound to end eventually, but the S&P 500 Index will finish September in the red, ending an incredible seven month win streak. As we noted last month, these long win streaks actually tend to be quite bullish for future returns, with the S&P 500 higher six months later 13 out of 14 times. Yes, stocks were down some in September, but this still bodes well for the near-term.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.30.21-Blog-Chart-1.png?ssl=1))**\n\n> Speaking of the near term, here comes October. As Marc Twain explained many years ago, October has long been a source of anxiety for stock investors. “October is known for some spectacular crashes and many expect bad things to happen again this year. 1929, 1987, and 2008 all come to mind when we think about this month,” explained LPL Financial Chief Market Strategist Ryan Detrick. “But the truth is this month is simply misunderstood, as historically it is about an average month.”\n\n> As the LPL Chart of the Day shows, since 1950, October ranks as the 7th best month, while the past 10 and 20 years it ranks as the 4th best month. In a post-election year it comes in 5th. So October clearly isn’t one of the best months of the year, but by no means is it the worst either.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.30.21-Blog-Chart-1-v2.png?ssl=1))**\n\n> Now, let’s be very clear though, October is known for volatility. No month has seen more 1% moves (up or down) than October, with some of the largest 1-day moves (both up and down) taking place this month. Heck, the S&P 500 hasn’t had a 5% pullback all year (the average year sees about three) and the last one was nearly a full year ago, one of the longest such streaks ever. Not to mention the S&P 500 has now gone an incredible 317 trading days in a row above its 200-day moving average, one of the longest streaks ever. What we are getting at is a 5-7% pullback could potentially come at any time given we haven’t had one in so long.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.30.21-Blog-Chart-3.png?ssl=1))**\n\n> Here are some other interesting statistics to think about regarding the S&P 500 in October.\n> * It has been 21 years (2000) since October didn’t close at least up or down 1%. Several percent moves up or down are quite common for this month in other words.\n> * For six years in a row October has alternated between higher and lower. Given 2020 it was in the red, it could be time for a bounce in 2021. (More on this below)\n> * The last two times the S&P 500 was up more than 15% year-to-date heading into October, stocks gained each time (2013 and 2019).\n> * The author’s birthday is on October 28, one of the historically most bullish days of the year. Coincidence?\n> It turns out stocks don’t like politics much. The S&P 500 performs much better in odd numbered years than even years. Remember, even numbered years have elections and midterms in November. Some pre-election jitters makes sense to us, which could bode well for 2021.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.30.21-Blog-Chart-4.png?ssl=1))**\n\n> Don’t forget the fourth quarter is historically the best for stocks, with the third quarter the worst. Stocks rise 3.8% on average during the fourth quarter, but the past seven times the S&P 500 was up 15% year-to-date heading into the home stretch of the year, the fourth quarter was higher every single time, up a very impressive 5.8%. In other words, should there be any October scares, investors may want to use the weakness as an opportunity to add to core positions.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.30.21-Blog-Chart-5.png?ssl=1))**\n\n*****\n\n> # Four Charts That Signal the Reopening Trade May Be Back\n\n> Stocks have come a long way since the S&P 500 bear market low way back on March 23, 2020, but despite the general strength of the bull market we’ve seen two very different types of trades leading markets at different times. They include a “work-from-home” trade characterized by strength among large caps and growth-style oriented stocks, strong performance by U.S. stocks in particular, and well contained interest rates. At other times, we’ve seen a “reopening trade,” where mid- and small-cap stocks have performed well, cyclically-oriented value-style stocks have led, interest rates have pressed higher, and performance across geographical regions has been more even. For most of the last six months the work-from-home trade has dominated, but we’re seeing some signs of potential rotation toward a reopening theme once again.\n\n> “It’s increasingly looking like the Delta-related surge in COVID-19 cases, while still dangerous, has passed its peak, and there are signals that markets may be anticipating the next stage of economic reopening,” said LPL Chief Market Strategist Ryan Detrick. “After a mid-summer head fake, we’re seeing signs that this time the rotation might stick.”\n\n> It all starts with interest rates. The 10-year Treasury yield started to stabilize in early August, and since then we’ve seen steady movement higher as elevated inflation looks increasingly sticky in the near term, and markets start to anticipate global central bankers slowly winding down extraordinarily supportive monetary policy. The full transition to neutral policy will likely take years, and central banks will remain supportive for some time, but the change in direction does matter. Seeing the 10-year yield move higher despite stock losses on Tuesday may be a telling sign.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.29.21-Blog-Chart-2.png?ssl=1))**\n\n> A higher 10-year Treasury yield has supported financial sector stocks, which are the largest sector in the Russell 1000 Value Index. The breakout in relative strength compared to the August peak may signal a more sustainable change in direction this time.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.29.21-Blog-Chart-3.png?ssl=1))**\n\n> It’s still too early to call a reversal by value-style stocks overall, but financial sector strength helps. Rising interest rates also tend to increase the value of near-term earnings over less visible long-term earnings growth, which may also give value stocks an edge. While there are some signs of a reversal higher in the value trade, what we’ve seen so far isn’t persuasive in isolation. But added to the broader market signals, we see potential for further relative strength, particularly for cyclical value sectors.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.29.21-Blog-Chart-1.png?ssl=1))**\n\n> The relative strength of small caps looks more robust, breaking out to the upside after treading water for several months. Small caps went through a stretch of extraordinarily strong performance between September 2020 and March 2021, and it’s not completely surprising that they gave back a good share of those gains after coming so far so fast, but we still think the economic environment is likely to be supportive for small- and mid-caps compared to large.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.29.21-Blog-Chart-4.png?ssl=1))**\n\n> We’ve been anticipating a rotation back to the reopening trade for some time. If you look at the charts there’s really been relative stability between the two themes since mid-July, but the last few weeks have provided solid signals of a potential reversal. With the latest surge in COVID-19 cases likely past peak, vaccination rates slowly rising, and economic surprises starting to come back into balance after a series of disappointments, it’s no surprise to see the shift toward the reopening theme.\n\n> But there are some potential economic negatives that support this trade as well, such as high commodity prices, higher interest rates, and growing risk of stickier inflation. Nevertheless, we think the fundamental backdrop for equities remains positive on the whole, and we continue to recommend modest overweights to equities while leaning into cyclically-oriented value sectors and tilting away from large caps.\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending October 1st, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 10.3.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n> * (**T.B.A. THIS WEEKEND.**)\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!]())**\n(T.B.A. THIS WEEKEND.)\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!]())**\n(T.B.A. THIS WEEKEND.)\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release & consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n> # ***Monday 10.4.21 Before Market Open:***\n> ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!]())\n(NONE.)\n\n> # ***Monday 10.4.21 After Market Close:*** \n> ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/cF0CbQE.png))\n\n*****\n\n> # ***Tuesday  10.5.21 Before Market Open:***\n> ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/D4dB9sd.png))\n\n> # ***Tuesday 10.5.21 After Market Close:*** \n> ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/jDBI2Dv.png))\n\n*****\n\n> # ***Wednesday 10.6.21 Before Market Open:*** \n> ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/qVRtzZv.png))\n\n> # ***Wednesday 10.6.21 After Market Close:*** \n> ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/V7gDj4f.png))\n\n*****\n\n> # ***Thursday 10.7.21 Before Market Open:*** \n> ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/hZ42eSL.png))\n\n> # ***Thursday 10.7.21 After Market Close:*** \n> ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/HNdhjgf.png))\n\n*****\n\n> # ***Friday 10.8.21 Before Market Open:*** \n> ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/I2ihrfy.png))\n\n*****\n\n> # ***Friday 10.8.21 After Market Close:***\n> ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!]())\n(NONE.)\n\n*****\n\n> # (T.B.A. THIS WEEKEND.)\n**T.B.A. THIS WEEKEND.)** T.B.A. THIS WEEKEND.).\n\n> #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=SPY&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks. :)",
  "author_fullname": "t2_eaak0",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Wall Street Week Ahead for the trading week beginning October 4th, 2021",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_pzjkyw",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.94,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 46,
  "total_awards_received": 3,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 46,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1633130443,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Good Friday evening to all of you here on <a href=\"/r/stocks\">r/stocks</a>. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.</p>\n\n<p>Here is everything you need to know to get you ready for the trading week beginning October 4th, 2021.</p>\n\n<h1><strong>October may have a bad reputation, but stocks are entering a normally positive period - <a href=\"https://www.cnbc.com/2021/10/01/october-may-have-a-bad-reputation-but-stocks-are-entering-a-normally-positive-period.html\">(Source)</a></strong></h1>\n\n<hr/>\n\n<blockquote>\n<p>October may have a bad reputation, but the fourth quarter has mostly been a positive time for stocks.</p>\n\n<hr/>\n\n<p>Despite worries about central bank tightening, the debt ceiling, Chinese developer Evergrande and Covid-19, many strategists expect stocks to eclipse recent highs after a rocky period in October.</p>\n\n<hr/>\n\n<p>The S&amp;P 500 has averaged outsized gains of 3.9% in the fourth quarter and was up four out of every five years since World War II, according to CFRA. The next best quarter is the first, with an average gain of 2.3%. The worst is the third, up just 0.6%.</p>\n\n<hr/>\n\n<p>“Q4 2021 will likely record a higher-than-average return. However, investors will need to hang on tight during the typically tumultuous ride in October, which saw 36% higher volatility when compared with the average for the other 11 months,” notes CFRA chief investment strategist Sam Stovall.</p>\n\n<hr/>\n\n<p>The S&amp;P 500 eked out a small gain for the third quarter, but was down nearly 5% for the month of September, with a bad ending as the S&amp;P 500 dropped 1.2% on Thursday.</p>\n\n<hr/>\n\n<p>The indexes kicked off the first trading session in October on a positive note, however. With the S&amp;P 500 adding 1.1% and the Nasdaq closing 0.8% higher on Friday. The Dow Jones Industrial Average added 482.54 points.</p>\n\n<hr/>\n\n<p><a href=\"https://i.imgur.com/FEg9jmU.png\">https://i.imgur.com/FEg9jmU.png</a></p>\n\n<hr/>\n\n<p>Bespoke Investment Group analyzed the behavior of the S&amp;P 500 in years when it was up solidly year-to-date heading into the fourth quarter. In those years, the market typically gained in the quarter, but there were weaker than normal returns in October and the quarter itself, when September was a negative month.</p>\n\n<hr/>\n\n<p>“The S&amp;P 500 has been down in September 50 times since 1928, and in those years, it has actually averaged a decline of 0.41% in October and a gain of just 0.75% in Q4,” Bespoke noted. When September’s performance was positive, the S&amp;P gained a much stronger 1.6% average in October and an average 5% in the fourth quarter, according to the firm.</p>\n\n<hr/>\n\n<p>Bespoke found that while October is remembered for stock market crashes, like those in 1929 and 1987, the market is usually positive. The Dow, for instance, gained 60% of the time in October over the past 50 years, averaging an increase of 0.5%. It was negative most of the time in September, with an average loss of 0.9%.</p>\n\n<hr/>\n\n<h1>Jobs, jobs, jobs</h1>\n\n<p>One of the first hurdles markets face in the new quarter is Friday’s employment report, potentially one of the final triggers for the Federal Reserve’s decision on when to taper its $120 billion-a-month bond buying program.</p>\n\n<hr/>\n\n<p>Economists expect about 475,000 jobs were added in September, according to an early consensus figure from FactSet. Just 235,000 payrolls were added in August, about 500,000 less than expected.</p>\n\n<hr/>\n\n<p>“The only way I could see them delaying the tapering is if we get a very weak number, something closer to zero,” said Ethan Harris, head of global economic research at Bank of America. “Anything that looks like 100,000, 200,000, they just go ahead” with the taper.</p>\n\n<hr/>\n\n<p>Harris said the biggest concern for the economy remains Covid, though new cases are slowing.</p>\n\n<hr/>\n\n<p>“The big question is when does the Covid story start to fade a bit, allowing activity to come back,” he said. He expects the pandemic will continue to be a big factor in the labor market in September.</p>\n\n<hr/>\n\n<p>“We think fear of getting Covid on the job was a big factor in August and will be a factor in September as well,” he said. “By October, the early hints are people are starting to feel more comfortable and you should get some beginnings of a reacceleration of job growth.”</p>\n\n<hr/>\n\n<p>The market got some positive news on that front on Friday with Merck’s promising data for its Covid antiviral pill.</p>\n\n<hr/>\n\n<h1>Central banks tightening</h1>\n\n<p>A big event in the fourth quarter could be the beginning of the unwind of the Federal Reserve’s easy policies.</p>\n\n<hr/>\n\n<p>The central bank last week signaled it is nearly ready to take that first step away from the policies used during the pandemic to maintain financial market liquidity and help the economy.</p>\n\n<hr/>\n\n<p>The Fed is widely expected to announce in November that it will start to slow its bond purchases, and Fed Chairman Jerome Powell said he expects it to finish by the middle of next year.</p>\n\n<hr/>\n\n<p>Other central banks around the world are also making the same noises or actually moving to raise interest rates. Bond market pros now expect a trend toward higher interest rates.</p>\n\n<hr/>\n\n<p>Just in the past week, rates shot higher, with the 10-year Treasury yield rising from about 1.31% while the Fed was meeting Sept. 22 to as high as 1.56% just a week later. On Friday, the yield eased back a bit to just under 1.50%.</p>\n\n<hr/>\n\n<p><a href=\"https://i.imgur.com/9dO7jZc.png\">https://i.imgur.com/9dO7jZc.png</a></p>\n\n<hr/>\n\n<p>The move toward tapering so far has not had much impact on markets, though strategists say it could if yields shoot higher. The bond buying program, or quantitative easing, was also credited with providing market liquidity, which has been fuel for stock market gains.</p>\n\n<hr/>\n\n<p>“The Fed is trying very hard to telegraph what they are doing well in advance and take the shock out of what they’re doing. Bond yields have gone up a bit but not in a way that’s troubling for the economy,” said Harris. “The real risk from the Fed comes when they start talking about hiking interest rates. ... That’s a story for next year.”</p>\n\n<hr/>\n\n<p>Rising yields would become more risky for stocks if they were to continue to move up rapidly. Tony Crescenzi, PIMCO executive vice president, said he expects the benchmark 10-year Treasury yield to trade in a range of 1.50% to 2% this year.</p>\n\n<hr/>\n\n<p>Crescenzi said the move higher in yields has to do with more persistent inflation expectations and the Fed’s persistent move toward less easy policy. “It’s still marching forward with its plan to taper and eventually tighten,” he said. “The taper doesn’t set a date for tightening, but the clock starts ticking once the taper begins.”</p>\n\n<hr/>\n\n<p>The jump in rates rattled stocks in the past week, particularly tech stocks. The S&amp;P 500 was lower by 2.2% for the week and the Nasdaq shed 3.2%.</p>\n\n<hr/>\n\n<h1>Surprising earnings</h1>\n\n<p>Earnings have been a big catalyst for the stock market, with huge upside surprises boosting sentiment this year. But some strategists warn that if companies sound too cautious when they report third-quarter profits in the next couple of weeks, that could be a forewarning for the market.</p>\n\n<hr/>\n\n<p>Julian Emanuel, head of equity and derivative strategy at BTIG, said rising earnings estimates for this year and next year have been a tailwind. “Those in our view have now plateaued and potentially peaked,” he said. “If the market perceived they peaked rather than plateaued on a near to medium-term basis, then we have a problem for the stock market.”</p>\n\n<hr/>\n\n<p>Investors are also watching the supply chain issues that are disrupting many companies’ ability to get parts and even products. They are already impacting earnings and pressuring margins. Some have already warned about the problem, and more are expected to detail the issues during earnings calls.</p>\n\n<hr/>\n\n<p>Congress averted a government shutdown, but political feuding is likely to hang over the markets in the fourth quarter. The bigger task facing lawmakers will be to raise the debt ceiling, which could become worrisome for markets if the government reaches the limit before action is taken.</p>\n\n<hr/>\n\n<p>As the fourth quarter moves ahead, the fate of the proposed $3.5 trillion infrastructure plan, which is opposed by Republicans and some Democrats, remains up in the air. Bank of America’s Harris said he expects it to be cut back to about $1.5 trillion.</p>\n\n<hr/>\n\n<h1>Other issues</h1>\n\n<p>Chinese property developer Evergrande’s failure to make its debt payments temporarily spooked the market in September. Its problems are not solved even as investors expect that a financial meltdown will be averted.</p>\n\n<hr/>\n\n<p>Evergrande’s progress will remain an important story for the markets in the fourth quarter, as the company struggles under its $300 billion debt burden.</p>\n\n<hr/>\n</blockquote>\n\n<h1><strong>This past week saw the following moves in the S&amp;P:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/DxoNJCE.png\">CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/nz0naN5.png\">CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Indices for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/uWt4LHK.png\">CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Futures Markets as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/JSLq6e1.png\">CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!</a>)</strong></h6>\n\n<h1><strong>Economic Calendar for the Week Ahead:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/RtabSpV.png\">CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!</a>)</strong></h6>\n\n<h1><strong>Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/tJmePd2.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for the Past Week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/6HSoEdC.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Pullback/Correction Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/ScqSlq1.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Rally Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/e0S19DA.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Most Anticipated Earnings Releases for this week:</strong></h1>\n\n<h6><strong>([CLICK HERE FOR THE CHART!]())</strong></h6>\n\n<p>(T.B.A. THIS WEEKEND.)</p>\n\n<h1><strong>Here are the upcoming IPO&#39;s for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/JWcdTjl.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Friday&#39;s Stock Analyst Upgrades &amp; Downgrades:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/JeByjl1.png\">CLICK HERE FOR THE CHART LINK #1!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/4dO1a3g.png\">CLICK HERE FOR THE CHART LINK #2!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/vOWwHAb.png\">CLICK HERE FOR THE CHART LINK #3!</a>)</strong></h6>\n\n<hr/>\n\n<blockquote>\n<h1>Mega Caps Underperforming as Energy Explodes</h1>\n\n<p>In November of last year, we took a look at the performance spread between the equal and market cap weighted versions of the S&amp;P 500. The chart below provides an update through the end of September where positive readings indicate outperformance of the equal-weight S&amp;P 500 and negative readings indicate outperformance of the market cap weighted index. In March 2020, as the market was plunging from the February peak and bottoming towards the end of the month, mega-caps such as Apple (APPL), Microsoft (MSFT), Alphabet (GOOGL), Amazon (AMZN), and Facebook (FB) significantly outperformed the broader market, resulting in a 5.68 percentage point spread between the return of the equally weighted and market cap weighted S&amp;P 500. Whereas the equal-weighted index declined 18.19% in March 2020, the market cap weighted index dropped &#39;just&#39; 12.51%. In a reversal of these trends, the equal-weighted index outperformed between the months of September 2020 and March 2021, rallying 30.84% while its market cap weighted counterpart gained 18.14%. Over these months, there was a maximum monthly spread of 3.37 percentage points in favor of the equal-weighted index, which occurred last December. In recent months, mega-caps briefly took back the reins before the trend reversed in September when the equal-weighted index outperformed by 0.82 percentage points.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/10/10121-Spread.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>With the month of September behind us, the table below lists the 18 stocks in the S&amp;P 500 that finished the month up over 10%, and less than a quarter of the stocks in the index (22%) finished the month higher. Overall, the average performance of stocks in the index was a decline of 3.7 percentage points. While short-term performance has been weak, on a YTD basis, 81.42% of S&amp;P 500 stocks are up on the year, and the overall average gain is 18.90%. Of the stocks that have rallied 10%+ in September, more than half are from the Energy sector and another three come from the Financials sector.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/10/over-ten-percent-updates.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Q3 Asset Class Performance</h1>\n\n<p>Q3 and the month of September are now in the books, and it was not a great period for US equities. As shown in our asset class performance matrix below, the sole portion of the US equity market that was higher in September was Energy stocks. Every other sector, theme, and major index was lower on the month. As for global equities, performance was more mixed with declines ranging from 11.73% for Brazil (EWZ) to a 3.55% gain for Russia, though, most country ETFs were lower on the month.</p>\n\n<p>Commodities had a good month particularly in the energy space with crude oil (USO) gaining 9.41% and Natural Gas (UNG) rising an astounding 31.59%. That lifted the total gain in Q3 to 54.13% while it has returned almost 120% year to date; the best performer for both time periods. Precious metals, namely silver (SLV), on the other hand, was hit particularly hard. As for c/ryptos, Ethereum (ETHE) was another top performer YTD and in Q3, but September pared those gains. ETHE fell 13.62% in September while B/itcoin (GBTC) also fell by double-digit percentages.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/10/acpm093021.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Could There Be An October Crash?</h1>\n\n<p>“October: This is one of the peculiarly dangerous months to speculate in stocks. The others are July, January, September, April, November, May, March, June, December, August and February.” Mark Twain</p>\n\n<p>Well, it was bound to end eventually, but the S&amp;P 500 Index will finish September in the red, ending an incredible seven month win streak. As we noted last month, these long win streaks actually tend to be quite bullish for future returns, with the S&amp;P 500 higher six months later 13 out of 14 times. Yes, stocks were down some in September, but this still bodes well for the near-term.</p>\n\n<h6><strong>(<a href=\"https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.30.21-Blog-Chart-1.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Speaking of the near term, here comes October. As Marc Twain explained many years ago, October has long been a source of anxiety for stock investors. “October is known for some spectacular crashes and many expect bad things to happen again this year. 1929, 1987, and 2008 all come to mind when we think about this month,” explained LPL Financial Chief Market Strategist Ryan Detrick. “But the truth is this month is simply misunderstood, as historically it is about an average month.”</p>\n\n<p>As the LPL Chart of the Day shows, since 1950, October ranks as the 7th best month, while the past 10 and 20 years it ranks as the 4th best month. In a post-election year it comes in 5th. So October clearly isn’t one of the best months of the year, but by no means is it the worst either.</p>\n\n<h6><strong>(<a href=\"https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.30.21-Blog-Chart-1-v2.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Now, let’s be very clear though, October is known for volatility. No month has seen more 1% moves (up or down) than October, with some of the largest 1-day moves (both up and down) taking place this month. Heck, the S&amp;P 500 hasn’t had a 5% pullback all year (the average year sees about three) and the last one was nearly a full year ago, one of the longest such streaks ever. Not to mention the S&amp;P 500 has now gone an incredible 317 trading days in a row above its 200-day moving average, one of the longest streaks ever. What we are getting at is a 5-7% pullback could potentially come at any time given we haven’t had one in so long.</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.30.21-Blog-Chart-3.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Here are some other interesting statistics to think about regarding the S&amp;P 500 in October.\n* It has been 21 years (2000) since October didn’t close at least up or down 1%. Several percent moves up or down are quite common for this month in other words.\n* For six years in a row October has alternated between higher and lower. Given 2020 it was in the red, it could be time for a bounce in 2021. (More on this below)\n* The last two times the S&amp;P 500 was up more than 15% year-to-date heading into October, stocks gained each time (2013 and 2019).\n* The author’s birthday is on October 28, one of the historically most bullish days of the year. Coincidence?\nIt turns out stocks don’t like politics much. The S&amp;P 500 performs much better in odd numbered years than even years. Remember, even numbered years have elections and midterms in November. Some pre-election jitters makes sense to us, which could bode well for 2021.</p>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.30.21-Blog-Chart-4.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Don’t forget the fourth quarter is historically the best for stocks, with the third quarter the worst. Stocks rise 3.8% on average during the fourth quarter, but the past seven times the S&amp;P 500 was up 15% year-to-date heading into the home stretch of the year, the fourth quarter was higher every single time, up a very impressive 5.8%. In other words, should there be any October scares, investors may want to use the weakness as an opportunity to add to core positions.</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.30.21-Blog-Chart-5.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Four Charts That Signal the Reopening Trade May Be Back</h1>\n\n<p>Stocks have come a long way since the S&amp;P 500 bear market low way back on March 23, 2020, but despite the general strength of the bull market we’ve seen two very different types of trades leading markets at different times. They include a “work-from-home” trade characterized by strength among large caps and growth-style oriented stocks, strong performance by U.S. stocks in particular, and well contained interest rates. At other times, we’ve seen a “reopening trade,” where mid- and small-cap stocks have performed well, cyclically-oriented value-style stocks have led, interest rates have pressed higher, and performance across geographical regions has been more even. For most of the last six months the work-from-home trade has dominated, but we’re seeing some signs of potential rotation toward a reopening theme once again.</p>\n\n<p>“It’s increasingly looking like the Delta-related surge in COVID-19 cases, while still dangerous, has passed its peak, and there are signals that markets may be anticipating the next stage of economic reopening,” said LPL Chief Market Strategist Ryan Detrick. “After a mid-summer head fake, we’re seeing signs that this time the rotation might stick.”</p>\n\n<p>It all starts with interest rates. The 10-year Treasury yield started to stabilize in early August, and since then we’ve seen steady movement higher as elevated inflation looks increasingly sticky in the near term, and markets start to anticipate global central bankers slowly winding down extraordinarily supportive monetary policy. The full transition to neutral policy will likely take years, and central banks will remain supportive for some time, but the change in direction does matter. Seeing the 10-year yield move higher despite stock losses on Tuesday may be a telling sign.</p>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.29.21-Blog-Chart-2.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>A higher 10-year Treasury yield has supported financial sector stocks, which are the largest sector in the Russell 1000 Value Index. The breakout in relative strength compared to the August peak may signal a more sustainable change in direction this time.</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.29.21-Blog-Chart-3.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>It’s still too early to call a reversal by value-style stocks overall, but financial sector strength helps. Rising interest rates also tend to increase the value of near-term earnings over less visible long-term earnings growth, which may also give value stocks an edge. While there are some signs of a reversal higher in the value trade, what we’ve seen so far isn’t persuasive in isolation. But added to the broader market signals, we see potential for further relative strength, particularly for cyclical value sectors.</p>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.29.21-Blog-Chart-1.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>The relative strength of small caps looks more robust, breaking out to the upside after treading water for several months. Small caps went through a stretch of extraordinarily strong performance between September 2020 and March 2021, and it’s not completely surprising that they gave back a good share of those gains after coming so far so fast, but we still think the economic environment is likely to be supportive for small- and mid-caps compared to large.</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.29.21-Blog-Chart-4.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>We’ve been anticipating a rotation back to the reopening trade for some time. If you look at the charts there’s really been relative stability between the two themes since mid-July, but the last few weeks have provided solid signals of a potential reversal. With the latest surge in COVID-19 cases likely past peak, vaccination rates slowly rising, and economic surprises starting to come back into balance after a series of disappointments, it’s no surprise to see the shift toward the reopening theme.</p>\n\n<p>But there are some potential economic negatives that support this trade as well, such as high commodity prices, higher interest rates, and growing risk of stickier inflation. Nevertheless, we think the fundamental backdrop for equities remains positive on the whole, and we continue to recommend modest overweights to equities while leaning into cyclically-oriented value sectors and tilting away from large caps.</p>\n</blockquote>\n\n<hr/>\n\n<h1><strong>STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending October 1st, 2021</strong></h1>\n\n<h6><strong>([CLICK HERE FOR THE YOUTUBE VIDEO!]())</strong></h6>\n\n<p>(VIDEO NOT YET POSTED.)</p>\n\n<h1><strong>STOCK MARKET VIDEO: ShadowTrader Video Weekly 10.3.21</strong></h1>\n\n<h6><strong>([CLICK HERE FOR THE YOUTUBE VIDEO!]())</strong></h6>\n\n<p>(VIDEO NOT YET POSTED.)</p>\n\n<hr/>\n\n<p>Here are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-</p>\n\n<hr/>\n\n<blockquote>\n<ul>\n<li>(<strong>T.B.A. THIS WEEKEND.</strong>)</li>\n</ul>\n</blockquote>\n\n<hr/>\n\n<h6><strong>([CLICK HERE FOR NEXT WEEK&#39;S MOST NOTABLE EARNINGS RELEASES!]())</strong></h6>\n\n<p>(T.B.A. THIS WEEKEND.)</p>\n\n<h6><strong>([CLICK HERE FOR NEXT WEEK&#39;S HIGHEST VOLATILITY EARNINGS RELEASES!]())</strong></h6>\n\n<p>(T.B.A. THIS WEEKEND.)</p>\n\n<hr/>\n\n<p>Below are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:</p>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Monday 10.4.21 Before Market Open:</em></strong></h1>\n\n<h6>([CLICK HERE FOR MONDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())</h6>\n\n<p>(NONE.)</p>\n\n<h1><strong><em>Monday 10.4.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/cF0CbQE.png\">CLICK HERE FOR MONDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Tuesday  10.5.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/D4dB9sd.png\">CLICK HERE FOR TUESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Tuesday 10.5.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/jDBI2Dv.png\">CLICK HERE FOR TUESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Wednesday 10.6.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/qVRtzZv.png\">CLICK HERE FOR WEDNESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Wednesday 10.6.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/V7gDj4f.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Thursday 10.7.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/hZ42eSL.png\">CLICK HERE FOR THURSDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Thursday 10.7.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/HNdhjgf.png\">CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 10.8.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/I2ihrfy.png\">CLICK HERE FOR FRIDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 10.8.21 After Market Close:</em></strong></h1>\n\n<h6>([CLICK HERE FOR FRIDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())</h6>\n\n<p>(NONE.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>(T.B.A. THIS WEEKEND.)</h1>\n\n<p><strong>T.B.A. THIS WEEKEND.)</strong> T.B.A. THIS WEEKEND.).</p>\n\n<h1>(<a href=\"https://charts.finviz.com/chart.ashx?t=SPY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<h1>DISCUSS!</h1>\n\n<p>What are you all watching for in this upcoming trading week?</p>\n\n<hr/>\n\n<p>I hope you all have a wonderful weekend and a great trading week ahead <a href=\"/r/stocks\">r/stocks</a>. :)</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "pzjkyw",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "bigbear0083",
  "discussion_type": null,
  "num_comments": 1,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/pzjkyw/wall_street_week_ahead_for_the_trading_week/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/pzjkyw/wall_street_week_ahead_for_the_trading_week/",
  "subreddit_subscribers": 3086014,
  "created_utc": 1633213827,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1633130443,
  "the_new_excerpt": "Good Friday evening to all of you here on r/stocks [/r/stocks]. I hope everyone\non this sub made out pretty nicely in the market this past week, and is ready\nfor the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week\nbeginning October 4th,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/stocks[/r/stocks]をご覧の皆様、金曜日の夜はいかがお過ごしでしょうか。このサブの皆さんは\nこのサブにいる皆さんは、先週の市場でうまく儲けて、新しい取引の準備ができていることと思います。\nこれから始まる新しい取引に向けて準備ができていることと思います。\n\nここでは、今週の取引に向けて知っておくべきことをまとめました。\n10月4日からの取引に備えて、知っておくべきことをまとめました...",
      "title": "2021年10月4日から始まる取引週のWall Street Week Ahead"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "祝各位在r/stocks [/r/stocks]的朋友们周五晚上好。我希望每个人\n在过去的一周里在市场上赚得盆满钵满，并为新的交易做好准备。\n迎接新的交易周的到来。\n\n以下是你需要知道的一切，让你为本周的交易做好准备\n从10月4日开始，...",
      "title": "2021年10月4日开始的交易周，华尔街一周前瞻"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "祝各位在r/stocks [/r/stocks]的朋友們週五晚上好。我希望每個人\n在過去的一週裏在市場上賺得盆滿鉢滿，併爲新的交易做好準備。\n迎接新的交易周的到來。\n\n以下是你需要知道的一切，讓你爲本週的交易做好準備\n從10月4日開始，...",
      "title": "2021年10月4日開始的交易周，華爾街一週前瞻"
    }
  ],
  "source_updated_at": 1633685994916
}