{
  "author": "Set1Less",
  "original_created_utc": 1636643152,
  "title": "Discord cancelled its plan to implement Crypto, after backlash from nocoiners. Yet another company did a 180 on adopting crypto. We must be co-ordinate better if we have to see crypto get adopted widely.",
  "created_utc": 1636666466,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Discord earlier announced that they will implement crypto features, and even teased screenshots of what looked like crypto and NFT features in their product. It looked like they had been working on crypto implementation for a while. </p>\n\n<p>But since they did that, nocoiners have been constantly threatening them, claiming they will cancel their subscription if Discord implements crypto.</p>\n\n<p>As a result, their CEO just announced that they are infact not going to be implementing crypto at this point. </p>\n\n<p><a href=\"https://preview.redd.it/x388fq4zczy71.jpg?width=1248&amp;format=pjpg&amp;auto=webp&amp;s=36943bdbae7be6e26a2de9524e651aed18e39776\">Discord CEO: We have no plans to ship this internal concept</a></p>\n\n<p>After Discord announced their plan, the nocoiner gang were very visibly organised in trying to cancel Discord. Over 100k posts were made on the Discord forums, threatening Discord to either stop their adoption of crypto, or these nocoiners will cancel their Discord subscription. Several popular accounts posted threads on Twitter asking people to &quot;vote with their money&quot; and cancel their Discord subscriptions.</p>\n\n<p>As a result, Discord pulled the plug. </p>\n\n<p>Absolutely no one from crypto side told Discord that their move was welcome. No one tried to tell Discord how wrong these nocoiner arguments were.  </p>\n\n<p>Majority of those in crypto were happy to be shilling their coins here, watching numbers go up while yet another big company did a 180 on adopting crypto due to the pressure from nocoiners. They are so far winning these battles. </p>\n\n<p>As a community, we need to do better.</p>\n</div><!-- SC_ON -->",
  "score": 187,
  "permalink": "/r/CryptoCurrency/comments/qrn9ey/discord_cancelled_its_plan_to_implement_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qrn9ey",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Discord earlier announced that they will implement crypto features, and even\nteased screenshots of what looked like crypto and NFT features in their product.\nIt looked like they had been working on crypto implementation for a while.\n\nBut since they did that, nocoiners have been constantly…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Discordは以前、暗号化機能を実装することを発表し、さらには\nのスクリーンショットを公開していました。\nそれは、彼らがしばらくの間、暗号の実装に取り組んでいたように見えました。\n\nしかし、彼らがそれを行って以来、nocoinersは常に...",
      "title": "DiscordがCryptoを実装する計画をキャンセル、nocoinersからの反発を受けて。また、別の企業が暗号の採用を180度変えてしまいました。暗号が広く採用されるようにするには、私たちはもっとうまく調整しなければなりません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Discord早些时候宣布，他们将实施加密货币功能，甚至还\n甚至还预告了他们产品中看起来像加密货币和NFT功能的截图。\n看上去他们已经为实现加密货币工作了一段时间。\n\n但自从他们这样做后，Nocoiners一直在不断...",
      "title": "Discord取消了实施Crypto的计划，因为受到Nocoiners的反击。然而，另一家公司在采用加密货币方面做了180度的调整。如果我们必须看到加密货币被广泛采用，我们必须更好地进行协调。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Discord早些時候宣佈，他們將實施加密貨幣功能，甚至還\n甚至還預告了他們產品中看起來像加密貨幣和NFT功能的截圖。\n看上去他們已經爲實現加密貨幣工作了一段時間。\n\n但自從他們這樣做後，Nocoiners一直在不斷...",
      "title": "Discord取消了實施Crypto的計劃，因爲受到Nocoiners的反擊。然而，另一家公司在採用加密貨幣方面做了180度的調整。如果我們必須看到加密貨幣被廣泛採用，我們必須更好地進行協調。"
    }
  ]
}