{
  "author": "ILostYouButIFoundMe",
  "original_created_utc": 1655667214,
  "title": "I enjoy spending 90% of my time alone and have no desire for things such as relationships. Something wrong or totally normal?",
  "created_utc": 1655690089,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I&amp;#39;m a 23 years old introverted guy and ever since I was 17, I realized I really enjoy being alone and I found that I could even be alone for an extended period of time. At the time I was dealing with some depression, but eventually over the years I got in to a healthier mental state. However, one thing that never changed, was my strange enjoyment of being alone. I&amp;#39;ve never been in a relationships and when people have asked if I&amp;#39;m seeing someone, I&amp;#39;ve said that I&amp;#39;m completely fine by myself, however people have looked at me differently because of that, as if I&amp;#39;m depressed or a loser or something. I spend most of my free time doing things such as watching movies, working out and just chillin by myself. Some people have said that one day I will change my mind about being alone, but they&amp;#39;ve been saying things like that for 5+ years and.. uhh.. I&amp;#39;m still pretty sure that being alone is what I like the most. It&amp;#39;s just so peaceful and there&amp;#39;s no drama. So my question is, is it normal to want be alone most of the time and have no desire for relationships?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/vg2q7h/i_enjoy_spending_90_of_my_time_alone_and_have_no/",
  "subreddit": "TooAfraidToAsk",
  "id": "vg2q7h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So I'm a 23 years old introverted guy and ever since I was 17, I realized I\nreally enjoy being alone and I found that I could even be alone for an extended\nperiod of time. At the time I was dealing with some depression, but eventually\nover the years I got in to a healthier mental state. However,…"
}