{
  "author": "LordCommanderBlack",
  "original_created_utc": 1638028831,
  "title": "Weird question about Welsh versus Anglo Saxon beauty standards",
  "created_utc": 1638055954,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This question is inspired by the historical fiction-Arthurian retelling &quot;The Warlord Chronicles&quot; by Bernard Cornhill so high possibility of it being made up to highlight the cultural divide for the book.</p>\n\n<p>Old monk Derfel is telling his and Arthur&#39;s story to a welsh queen patron and Derfel tells of his old lady love and her blonde hair and blue eyes.</p>\n\n<p>The welsh queen balks at these &quot;saxon features&quot; and finds them strange, not beautiful.</p>\n\n<p>As far as we can tell, would the Welsh and the Saxons have had different beauty standards and would the Welsh have thought blonde hair and blue eyes as strange and foreign?</p>\n\n<p>I&#39;m well aware that they saw each other as foreign, &quot;Welsh&quot; being a Saxon word that means &quot;foreigner&quot; after all, but would they have been &#39;alien&#39; to each other on the fundamental level of appearance as well?</p>\n</div><!-- SC_ON -->",
  "score": 118,
  "permalink": "/r/AskHistorians/comments/r3gg0v/weird_question_about_welsh_versus_anglo_saxon/",
  "subreddit": "AskHistorians",
  "id": "r3gg0v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This question is inspired by the historical fiction-Arthurian retelling \"The\nWarlord Chronicles\" by Bernard Cornhill so high possibility of it being made up\nto highlight the cultural divide for the book.\n\nOld monk Derfel is telling his and Arthur's story to a welsh queen patron and\nDerfel tells of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この質問は、バーナード・コーンヒルの歴史小説・アーサー王物語「The\nバーナード・コーンヒル著「ウォーロード・クロニクルズ」に触発されたものです。\nこの本の文化的な隔たりを強調するために。\n\n老僧Derfelがウェールズの女王のパトロンに自分とアーサーの物語を語っています。\nDerfelが語るのは...。",
      "title": "ウェールズ人とアングロサクソン人の美の基準についての奇妙な質問"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个问题的灵感来自于历史小说--亚瑟人的重述《战神纪》。\n伯纳德-康希尔（Bernard Cornhill）所写的《军阀编年史》，所以它被编造的可能性很大\n以突出该书的文化鸿沟。\n\n老和尚Derfel正在向一位威尔士女王的赞助人讲述他和亚瑟的故事。\nDerfel讲述了...",
      "title": "关于威尔士人与盎格鲁撒克逊人美容标准的奇怪问题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個問題的靈感來自於歷史小說--亞瑟人的重述《戰神紀》。\n伯納德-康希爾（Bernard Cornhill）所寫的《軍閥編年史》，所以它被編造的可能性很大\n以突出該書的文化鴻溝。\n\n老和尚Derfel正在向一位威爾士女王的贊助人講述他和亞瑟的故事。\nDerfel講述了...",
      "title": "關於威爾士人與盎格魯撒克遜人美容標準的奇怪問題"
    }
  ]
}