{
  "author": "my_balls_touch_floor",
  "original_created_utc": 1649932120,
  "title": "Why is \"people of color\" not considered ultra racist?",
  "created_utc": 1649938818,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When I was young, saying &amp;quot;colored people&amp;quot; in english countries was considered racist as fuck. I live in a french speaking place and we just say &amp;quot;black people&amp;quot; (une personne noire), always been this way and still today.&lt;/p&gt;\n\n&lt;p&gt;But now english-speaking countries have started saying &amp;quot;people of color&amp;quot; and I literally do not understand. Why would you not just say black people, that just sounds natural and normal, while saying people of color sounds like you&amp;#39;re straight out of 1950&amp;#39;s alabama and angry about a black person in your bus.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 196,
  "permalink": "/r/NoStupidQuestions/comments/u3eb3i/why_is_people_of_color_not_considered_ultra_racist/",
  "subreddit": "NoStupidQuestions",
  "id": "u3eb3i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "When I was young, saying \"colored people\" in english countries was considered\nracist as fuck. I live in a french speaking place and we just say \"black people\"\n(une personne noire), always been this way and still today.\n\nBut now english-speaking countries have started saying \"people of color\" and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が若い頃、英語圏で「colored people」と言うと、「有色人種」と言われました。\n人種差別的だ 私はフランス語圏に住んでいますが、\"黒人 \"としか言いません。\n(une personne noire)、ずっとそうでしたし、今もそうです。\n\nでも今、英語圏の国々は「有色人種」と言い始めていて...。",
      "title": "なぜ「有色人種」は超差別主義者と見なされないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我年轻的时候，在英语国家说 \"有色人种 \"被认为是\n种族主义者。我住在一个讲法语的地方，我们只说 \"黑人\"。\n(une personne noire)，一直都是这样，现在也是。\n\n但现在英语国家已经开始说 \"有色人种\"，并且...",
      "title": "为什么 \"有色人种 \"不被认为是极端种族主义者？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我年輕的時候，在英語國家說 \"有色人種 \"被認爲是\n種族主義者。我住在一個講法語的地方，我們只說 \"黑人\"。\n(une personne noire)，一直都是這樣，現在也是。\n\n但現在英語國家已經開始說 \"有色人種\"，並且...",
      "title": "爲什麼 \"有色人種 \"不被認爲是極端種族主義者？"
    }
  ]
}