{
  "author": "milonuttigrain",
  "original_created_utc": 1637985765,
  "title": "Meanwhile, the third largest Bitcoin address just bought 991 BTC at $54,190 few hours ago. This address has accumulated 7,066 more BTC in Nov 2021. Don't panic sell, keep your DCA steady. The bull market is far from over.",
  "created_utc": 1638009738,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>One of my favourite activities is whale watching. According to Bitinfocharts, the third largest Bitcoin address just bought another 991 BTC at an average price of $54,190.34 few hours ago.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/95sshkq962281.png?width=1087&amp;format=png&amp;auto=webp&amp;s=b4573674298deda0d32a02d82a548e67ff280112\">As seen on Bitinfocharts website, this address has just bought 991 BTC today, and has accumulated a lot of BTC in November 2021.</a></p>\n\n<p>This address now has <strong>114,959.56997991 BTC</strong></p>\n\n<p><a href=\"https://preview.redd.it/icw6pf3l62281.png?width=511&amp;format=png&amp;auto=webp&amp;s=fc2bb925d619c93419621f5c358bc8aedcf94dc7\">Balance as at 27 November 2021 as per Bitinfocharts website</a></p>\n\n<p>There is still dispute whether this address is a whale or an exchange, but this is a pretty good indicator of how the whales are reacting. So while many planktons are scared off, the whales are accumulating more Bitcoins than ever. </p>\n\n<p>Another interesting thing: This address ranked 81th in February 2019 but have now become the third largest address. Note the first two largest addresses are exchanges (Binance 1st, Bitfinex 2nd)</p>\n\n<p>DCA plus swim-with-the-whale strategy: DCA is the first choice for many small retail investors like us. But also time like this is the perfect opportunity to swim with the whales (of course not by leverage!). The whales move the market and I do think they do it to make even more profits.</p>\n\n<p>I have written a post last week about DCA strategy and the best one in my opinion is: regular DCA + set aside a fund to buy when the flash crash happens. See how the whales swim.</p>\n\n<p>This address has made 3,931,206,864.56 USD profit ever since. But even when we confine it to November, this address appears to time the market perfectly, it sold 1,500 BTC on 09 November 2021 when BTC hit $67,510.46.</p>\n\n<p>I put this into a spreadsheet:</p>\n\n<p><a href=\"https://preview.redd.it/rem6yxjra2281.png?width=719&amp;format=png&amp;auto=webp&amp;s=7f6f045395295356e37a9360e0806f742cfbbab3\">Third largest Bitcoin address activities in November 2021 - summary</a></p>\n\n<p>So I think: DCA, don&#39;t panic, buy the dip like the whales do. The bull market is far from over. Technically we had always been in a bull market since 2010, thinking long term.</p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/CryptoCurrency/comments/r34tot/meanwhile_the_third_largest_bitcoin_address_just/",
  "subreddit": "CryptoCurrency",
  "id": "r34tot",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "One of my favourite activities is whale watching. According to Bitinfocharts,\nthe third largest Bitcoin address just bought another 991 BTC at an average\nprice of $54,190.34 few hours ago.\n\n\n\nAs seen on Bitinfocharts website, this address has just bought 991 BTC today,\nand has accumulated a lot of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の好きなアクティビティのひとつにホエールウォッチングがあります。Bitinfochartsによると。\n3番目に大きいビットコインアドレスが、数時間前に平均価格54,190.34ドルでさらに991BTCを購入しました。\n54,190.34ドルでした。\n\n\n\nBitinfochartsのウェブサイトで見られるように、このアドレスは今日991BTCを買ったばかりです。\nこのアドレスは、今日、991BTCを購入し、多くの...",
      "title": "一方、3番目に大きなビットコインアドレスは、数時間前に991BTCを54,190ドルで購入したばかりです。このアドレスは2021年11月に7,066BTCをさらに積み上げています。パニック売りをせず、DCAを安定させましょう。強気相場はまだ終わっていない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最喜欢的活动之一是看鲸鱼。根据Bitinfocharts的数据。\n第三大比特币地址在几个小时前刚刚买入另外991个BTC，平均价格为\n几个小时前，平均价格为54,190.34美元。\n\n\n\n在Bitinfocharts网站上看到，这个地址今天刚买了991个BTC。\n并且已经积累了大量的...",
      "title": "同时，第三大比特币地址在几个小时前刚刚以54,190美元买入991个BTC。这个地址在2021年11月又积累了7,066个BTC。不要恐慌性抛售，保持你的DCA稳定。牛市还远未结束。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最喜歡的活動之一是看鯨魚。根據Bitinfocharts的數據。\n第三大比特幣地址在幾個小時前剛剛買入另外991個BTC，平均價格爲\n幾個小時前，平均價格爲54,190.34美元。\n\n\n\n在Bitinfocharts網站上看到，這個地址今天剛買了991個BTC。\n並且已經積累了大量的...",
      "title": "同時，第三大比特幣地址在幾個小時前剛剛以54,190美元買入991個BTC。這個地址在2021年11月又積累了7,066個BTC。不要恐慌性拋售，保持你的DCA穩定。牛市還遠未結束。"
    }
  ]
}