{
  "author": "WeirdUniversity136",
  "original_created_utc": 1649707491,
  "title": "Does every Lowes hardware store have a small colony of birds living in the rafters?",
  "created_utc": 1649722035,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Every time I walk into a Lowe’s, BJs or other large warehouse-style store that has high ceilings there seems to be birds flying around near the ceiling and chilling on the rafters. Like they came in from outside and are now in the store. The stores can’t really do shit since they’re way the fuck up high. Do they come inside and get trapped? Do they know how to get out? Did they come in on purpose just to build nests and shit? So do they just die of starvation and fall to the floor? If there’s anyone here that works at Lowe’s, can you please tell me what happens to these birds? And have you ever found a dead bird on the floor during your shift? Tell me if your local Lowe’s has birds in the rafters.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/NoStupidQuestions/comments/u1g5nc/does_every_lowes_hardware_store_have_a_small/",
  "subreddit": "NoStupidQuestions",
  "id": "u1g5nc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Every time I walk into a Lowe’s, BJs or other large warehouse-style store that\nhas high ceilings there seems to be birds flying around near the ceiling and\nchilling on the rafters. Like they came in from outside and are now in the\nstore. The stores can’t really do shit since they’re way the fuck up…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ロウズやBJsなど、大型の倉庫型店舗に足を踏み入れるたびに\n天井が高いので、天井付近を鳥が飛び回っているようです。\n垂木を冷やしている。外から入ってきて、今、この中にいるような感じです。\n店舗に 店側は、高所なので何もできないのだが...。",
      "title": "どのローズの金物店にも、垂木に住む鳥の小群がいるのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每次我走进Lowe's、BJs或其他大型仓库式商店，有高高的天花板，似乎有鸟在天花板附近飞来飞去。\n有高高的天花板，似乎都有鸟儿在天花板附近飞来飞去，并在椽子上乘凉。\n在椽子上发呆。就像它们从外面进来，现在在店内\n店里。这些商店不能做任何事情，因为它们是他妈的高......",
      "title": "是否每家Lowes五金店都有一个小鸟群住在椽子上？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每次我走進Lowe's、BJs或其他大型倉庫式商店，有高高的天花板，似乎有鳥在天花板附近飛來飛去。\n有高高的天花板，似乎都有鳥兒在天花板附近飛來飛去，並在椽子上乘涼。\n在椽子上發呆。就像它們從外面進來，現在在店內\n店裏。這些商店不能做任何事情，因爲它們是他媽的高......",
      "title": "是否每家Lowes五金店都有一個小鳥羣住在椽子上？"
    }
  ]
}