{
  "author": "BrilliantMango3291",
  "original_created_utc": 1659031842,
  "title": "How to flirt as a man if it's seen as inappropriate to flirt outside of parties, clubs and bars?",
  "created_utc": 1659044317,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know why, but every single one of my friends or family tell me it&amp;#39;s inappropriate to talk to a woman if I see her in public. I&amp;#39;m not planning to be creepy, I just want to go over and say hi, if she may want to grab a drink if she has the time or something along these lines.&lt;/p&gt;\n\n&lt;p&gt;Is it really inappropriate? Is it because there are seemingly too many creeps nowadays?&lt;/p&gt;\n\n&lt;p&gt;Edit: Just because some people think bad of me here is an explanation regarding parties and bars. I hate being surrounded by drunken people. I got some issues with people being drunk. That&amp;#39;s why I hate locations that serve alcohol in general. And thanks for thinking I got an issue because women feel safe there. I don&amp;#39;t feel safe there.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 143,
  "permalink": "/r/TooAfraidToAsk/comments/wagxab/how_to_flirt_as_a_man_if_its_seen_as/",
  "subreddit": "TooAfraidToAsk",
  "id": "wagxab",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don't know why, but every single one of my friends or family tell me it's\ninappropriate to talk to a woman if I see her in public. I'm not planning to be\ncreepy, I just want to go over and say hi, if she may want to grab a drink if\nshe has the time or something along these lines.\n\nIs it really…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜかわからないが、友人や家族の誰もが、「これは」と言う。\nと言われます。になるつもりはない。\nただ挨拶に行き、もし時間があれば飲みにでも行きたいと思っています。\nとか、そういうことを言いたいだけなんです。\n\nそれは本当に...",
      "title": "パーティーやクラブ、バー以外でイチャつくのが不適切とみなされる場合、男性としてイチャつくにはどうしたらいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道为什么，但我的每一个朋友或家人都告诉我这是\n如果我在公共场合看到一个女人，就不应该和她说话。我并不打算成为\n我并不打算让人讨厌，我只是想过去打个招呼，如果她想喝一杯，如果\n如果她有时间的话，可以去喝一杯，或者类似的事情。\n\n这是否真的...",
      "title": "如果在聚会、俱乐部和酒吧以外的地方调情被视为不合适，那么作为一个男人如何调情？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道爲什麼，但我的每一個朋友或家人都告訴我這是\n如果我在公共場合看到一個女人，就不應該和她說話。我並不打算成爲\n我並不打算讓人討厭，我只是想過去打個招呼，如果她想喝一杯，如果\n如果她有時間的話，可以去喝一杯，或者類似的事情。\n\n這是否真的...",
      "title": "如果在聚會、俱樂部和酒吧以外的地方調情被視爲不合適，那麼作爲一個男人如何調情？"
    }
  ]
}