{
  "author": "UpgradeNotSure",
  "the_new_excerpt": "I’m very skeptical about ICLN. It’s largest position is PLUG which I feel is\nrisky as I’m not convinced hydrogen will become mainstream compared to EV’s\n(even though hydrogen has some advantages over EV in transportation).\nFurthermore, the majority of its holdings are in foreign companies and I’m…",
  "original_created_utc": 1611115771,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我对ICLN持怀疑态度。它最大的仓位是PLUG，我感觉是\n风险很大，因为我不相信氢气会比电动车成为主流。\n即使氢气在交通方面比电动车有一定优势）。\n此外，其持有的大部分股份都是外企，我...",
      "title": "是我的错觉还是ICLN没有说服力？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對ICLN持懷疑態度。它最大的倉位是PLUG，我感覺是\n風險很大，因爲我不相信氫氣會比電動車成爲主流。\n即使氫氣在交通方面比電動車有一定優勢）。\n此外，其持有的大部分股份都是外企，我...",
      "title": "是我的錯覺還是ICLN沒有說服力？"
    }
  ],
  "title": "Is it just me or is ICLN not convincing?",
  "created_utc": 1611143795,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m very skeptical about ICLN. It’s largest position is PLUG which I feel is risky as I’m not convinced hydrogen will become mainstream compared to EV’s (even though hydrogen has some advantages over EV in transportation). Furthermore, the majority of its holdings are in foreign companies and I’m not convinced Biden’s administration will lead to significantly more adoption of green energy on foreign soil. </p>\n\n<p>This ETF was trading in the $10 area for the last ten years until the v-shaped recovery started and then Biden was elected and it rocket shipped. I don’t get the argument of cheaper and more accessible green tech because green tech isn’t that much better off than it was a year ago when it was trading at $12. When I look at peoples reasoning for holding ICLN it’s almost always because either Biden was elected or because green tech is cheaper and more feasible now. While I think green sectors will see an increase in valuations, I just don’t see either of those reasons panning out for this specific ETF. Am I missing something else?</p>\n</div><!-- SC_ON -->",
  "score": 83,
  "permalink": "/r/stocks/comments/l11cw9/is_it_just_me_or_is_icln_not_convincing/",
  "subreddit": "stocks",
  "id": "l11cw9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311219654
}