{
  "author": "ReluctantAccountmade",
  "original_created_utc": 1657810098,
  "title": "what's up with the sickly child trope?",
  "created_utc": 1657818118,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I read a lot of old children&amp;#39;s books growing up, and something I noticed in some of the kids books from the turn of the Twentieth Century is the trope of the weak, sickly child who just needs to get out in nature and roughhouse a little and then they&amp;#39;re magically cured (see Klara in Heidi, Colin in The Secret Garden). &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m curious about what anxieties and values this trope reflects — was increasing industrialization making Europeans anxious about raising children in polluted cities? Was this just wishful thinking about an easy cure for childhood illnesses? Was it a moralizing view that disabilities could be cured by circumstance and willpower? Or was it about romanticizing rural life as pure and healthy? Curious if any children&amp;#39;s lit scholars out there have written about this!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 153,
  "permalink": "/r/AskHistorians/comments/vyxnrz/whats_up_with_the_sickly_child_trope/",
  "subreddit": "AskHistorians",
  "id": "vyxnrz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I read a lot of old children's books growing up, and something I noticed in some\nof the kids books from the turn of the Twentieth Century is the trope of the\nweak, sickly child who just needs to get out in nature and roughhouse a little\nand then they're magically cured (see Klara in Heidi, Colin in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は子供の頃、古い絵本をたくさん読みましたが、その中で気がついたことがあります。\n20世紀初頭の子供向けの本で気づいたのは、「弱くて、病弱な子供は、ただ自分の力を必要としている」という\n弱くて病弱な子供は、自然の中に出て行って、少し遊ぶだけでいいんだ。\nハイジ』のクララや、『虹の女神』のコリンのように。",
      "title": "病弱児商法とは何事か"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在成长过程中阅读了很多旧的儿童书籍，我注意到在一些\n我注意到在二十世纪初的一些儿童书籍中，有这样一个特例\n虚弱、多病的孩子只需要走到大自然中去，做一些粗暴的动作\n然后他们就被神奇地治愈了（见《海蒂》中的克拉拉，《科林》中的科林）。",
      "title": "怎么会有病态的孩子的说法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在成長過程中閱讀了很多舊的兒童書籍，我注意到在一些\n我注意到在二十世紀初的一些兒童書籍中，有這樣一個特例\n虛弱、多病的孩子只需要走到大自然中去，做一些粗暴的動作\n然後他們就被神奇地治癒了（見《海蒂》中的克拉拉，《科林》中的科林）。",
      "title": "怎麼會有病態的孩子的說法？"
    }
  ]
}