{
  "author": "electricviper",
  "the_new_excerpt": "In the recently released litepaper, the team explains the focus on NFTs and\nDeFi.\n\nThere are many interesting aspects I firmly believe are making this project a\nhuge crypto moonshot just waiting to explode.\n\nThey have recently had their first NFTs auction for a quite big name of the\nmusic industry,…",
  "original_created_utc": 1617005588,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在最近发布的文字文件中，该团队解释了对NFTs的关注和\n德菲。\n\n有许多有趣的方面，我坚定地认为，正在使这个项目成为一个\n巨大的加密月球，就等着爆发。\n\n他们最近进行了第一次NFTs拍卖，拍卖的对象是一个相当大牌的。\n音乐产业，...",
      "title": "Origin Protol's（OGN）在其新的 litepaper 中宣布，在 OUSD 协议的基础上，衔接点对点 NFTs 市场+去中心化金融和借记卡的支付应用。我呼吁 \"不是如果，而是什么时候 \"的Moonshot!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在最近發佈的文字文件中，該團隊解釋了對NFTs的關注和\n德菲。\n\n有許多有趣的方面，我堅定地認爲，正在使這個項目成爲一個\n巨大的加密月球，就等着爆發。\n\n他們最近進行了第一次NFTs拍賣，拍賣的對象是一個相當大牌的。\n音樂產業，...",
      "title": "Origin Protol's（OGN）在其新的 litepaper 中宣佈，在 OUSD 協議的基礎上，銜接點對點 NFTs 市場+去中心化金融和借記卡的支付應用。我呼籲 \"不是如果，而是什麼時候 \"的Moonshot!"
    }
  ],
  "title": "Origin Protol's (OGN) announced bridging peer-to-peer NFTs marketplaces + decentralized finance and a payment app with debit card on top of the OUSD protocol in their new litepaper. I call for a 'not if but when' Moonshot!",
  "created_utc": 1617032842,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the recently released litepaper, the team explains the focus on NFTs and DeFi.</p>\n\n<p>There are many interesting aspects I firmly believe are making this project a huge crypto moonshot just waiting to explode.</p>\n\n<p>They have recently had their first NFTs auction for a quite big name of the music industry, an auction that surprised everyone for how smooth it worked but especially for the mindblowing result of selling the first-ever tokenized NFT music album for over $11M. This sparked a lot of attention in the music industry and showbiz in general, to the point that the team was invited to join some celebrities, famous industry professionals and influencers on clubhouse parties and other talks over NFTs topics (on their YouTube channel there is one with Kim Dotcom and  Paris Hilton :D ). Those days we could see with our eyes more and less famous music industry players literally entering their Telegram channels and Discord asking for collaborations and partnerships in order to replicate what they did for the record auction they managed for 3LAU.</p>\n\n<p>They&#39;re maybe making it on the news for the NFTs now but something some people may not know is that they&#39;re also the same people behind <a href=\"https://www.ousd.com/\">OUSD</a>, the first-ever stable coin that passively earns a yield without any action from users end -basically removing all the complexities with earning fees through lending or supplying liquidity to automated market makers-  apart of buying/minting the tokens and keep them in their wallets. In addition to a stable coin that we could consider like a saving account where you earn interests but also simultaneously still being in the position to spend your OUSD as soon as you decide to do so (no lock period), they&#39;re also working on &quot;implementing a new peer-to-peer payment app with an associated debit card built on top of OUSD, that combines the ease of peer-to-peer payments with a high-yield savings account that beats traditional savings accounts by a factor of 10 to 100x&quot;.</p>\n\n<p>Now given that these were just a taste of a number of interesting concepts in the litepaer, that the team is made of <a href=\"https://www.originprotocol.com/en/team\">respectable well-known professionals</a> in the industry coming from companies such as PayPal, Google, YouTube etc, the above premises and everything in the litepaper, I am getting more and more interested in the future of this project.</p>\n\n<p>Last but not least, they grew it and still growing the project quite organically since 2017/2018, without any real advertising campaigns, as most of the crypto projects do instead in order to get quickly famous, but that is also something that often makes &#39;burn&#39; and disappear those projects quickly.</p>\n\n<p>I hope this has got someone as interested as much as it has happened for me.<br/>\nAs usual in these cases, DYOR (<a href=\"https://www.originprotocol.com/en/litepaper\">here is the litepaper</a> on their website), don&#39;t sleep too long on it though because big exposure has arrived, Sheldon Evans and Alex Becker are big in crypto and just spoke about OGN in these last 2 days <a href=\"https://youtu.be/5p8LgjMQbyE?t=929\">here</a> and <a href=\"https://youtu.be/IO8gX4vPkRA?t=1106\">here</a>, it is really one step from getting among top coins, and you know what that means...understanding a project high value before the real boom is the key.</p>\n</div><!-- SC_ON -->",
  "score": 176,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/IF_bc6BTIW2YN_DIpCbK5Vk9cKqvkGIvvN4oLyzKh4A.jpg?auto=webp&s=9918d7027c18310bb5b06f991b6832d65d814bae",
          "width": 1200,
          "height": 630
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/IF_bc6BTIW2YN_DIpCbK5Vk9cKqvkGIvvN4oLyzKh4A.jpg?width=108&crop=smart&auto=webp&s=81f6704721de8f9ec2c36efea485056028579440",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/IF_bc6BTIW2YN_DIpCbK5Vk9cKqvkGIvvN4oLyzKh4A.jpg?width=216&crop=smart&auto=webp&s=3d7f1b85f51ba20f8ef4ca7c8a45a1bf3010f31d",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/IF_bc6BTIW2YN_DIpCbK5Vk9cKqvkGIvvN4oLyzKh4A.jpg?width=320&crop=smart&auto=webp&s=ae5adaed24d1f58d37ddbe4bc8f1063d3deb9d32",
            "width": 320,
            "height": 168
          },
          {
            "url": "https://external-preview.redd.it/IF_bc6BTIW2YN_DIpCbK5Vk9cKqvkGIvvN4oLyzKh4A.jpg?width=640&crop=smart&auto=webp&s=24a2fbcf0450a82bfd00988a201461a226eee095",
            "width": 640,
            "height": 336
          },
          {
            "url": "https://external-preview.redd.it/IF_bc6BTIW2YN_DIpCbK5Vk9cKqvkGIvvN4oLyzKh4A.jpg?width=960&crop=smart&auto=webp&s=29058aa2905c4c25a77b0163d2dac9e555941d70",
            "width": 960,
            "height": 504
          },
          {
            "url": "https://external-preview.redd.it/IF_bc6BTIW2YN_DIpCbK5Vk9cKqvkGIvvN4oLyzKh4A.jpg?width=1080&crop=smart&auto=webp&s=66aaab3ea23c998ed270eff70720252196dc58dd",
            "width": 1080,
            "height": 567
          }
        ],
        "variants": {},
        "id": "GRjnBwC2A-a5DQucviWGK5FrP5Gzd_Dgfyjh2Oziodo"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/mfkoln/origin_protols_ogn_announced_bridging_peertopeer/",
  "subreddit": "CryptoCurrency",
  "id": "mfkoln",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357137119
}