{
  "author": "uptown47",
  "the_new_excerpt": "I've got a good friend who has been told that a certain crypto-currency is going\nto rise substantially (I know I know... I'm cynical as well).\n\nThe thing that makes me ponder whether this is genuine or not is that the advice\nshe has received is from a very trusted source to her - i.e. someone with a…",
  "original_created_utc": 1620199266,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ある暗号通貨が大幅に上昇すると言われている親友がいます。\n大幅に上昇すると言われている親友がいます（分かっています、分かっています...私もひねくれ者です）。\n\nこれが本物かどうか考えさせられるのは、彼女が受けたアドバイスが非常に信頼のおける人物からのものであるということです。\n彼女が受けたアドバイスは、彼女にとって非常に信頼のおける情報源、つまり、金融機関に勤めている人からのものだということです。",
      "title": "あなたの意見では、暗号通貨は健全な投資ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有一个好朋友，他被告知某种加密货币将大幅上涨（我知道我知道......我也是愤青）。\n将大幅上涨（我知道我知道......我也很愤世嫉俗）。\n\n让我深思的是，这是否是真的？\n她收到的建议是来自一个她非常信任的来源--也就是说，有一个人对她来说是非常重要的。",
      "title": "在您看来，加密货币是否是一项合理的投资？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一個好朋友，他被告知某種加密貨幣將大幅上漲（我知道我知道......我也是憤青）。\n將大幅上漲（我知道我知道......我也很憤世嫉俗）。\n\n讓我深思的是，這是否是真的？\n她收到的建議是來自一個她非常信任的來源--也就是說，有一個人對她來說是非常重要的。",
      "title": "在您看來，加密貨幣是否是一項合理的投資？"
    }
  ],
  "title": "In your opinion is crypto-currency a sound investment?",
  "created_utc": 1620215297,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve got a good friend who has been told that a certain crypto-currency is going to rise substantially (I know I know... I&#39;m cynical as well).</p>\n\n<p>The thing that makes me ponder whether this is genuine or not is that the advice she has received is from a very trusted source to her - i.e. someone with a lot of money who wouldn&#39;t deliberately steer her wrong.</p>\n\n<p>I&#39;ve always thought of crypto-currency as just a big gamble - a bit like AIM penny shares - but I&#39;m not an &quot;investor&quot; as such and don&#39;t know a lot about investing. I wondered whether, in your opinion, there&#39;s any future in cc and which currencies (if any) you would see as a &#39;good&#39; investment?</p>\n</div><!-- SC_ON -->",
  "score": 241,
  "permalink": "/r/investing/comments/n5a2ms/in_your_opinion_is_cryptocurrency_a_sound/",
  "subreddit": "investing",
  "id": "n5a2ms",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380966990
}