{
  "author": "AdeptCrow3733",
  "the_new_excerpt": "My brother and I were both soldiers, but he didn't make it out uninjured. He was\nassigned to Bagdad, and was a turret gunner in a quick response unit. On a slow\nday, as they were rounding a corner near a square, an IED was triggered sending\nthe humvee into the air and catapulting him 60ft. They…",
  "original_created_utc": 1614537658,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我和我哥都是军人，但他没能安然无恙地出来。他是...\n被派往巴格达，是快速反应部队的一名炮手。在一次慢\n一天，当他们在广场附近转弯时，一个简易爆炸装置被引爆，将他们送进了医院。\n悍马车飞到空中，把他弹射到60英尺高的地方。他们...",
      "title": "WSB救了我弟弟的命! 在伊拉克受伤和严重的创伤后应激障碍之后，目标和希望让一切都变得不同了! 谢谢你们！"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和我哥都是軍人，但他沒能安然無恙地出來。他是...\n被派往巴格達，是快速反應部隊的一名炮手。在一次慢\n一天，當他們在廣場附近轉彎時，一個簡易爆炸裝置被引爆，將他們送進了醫院。\n悍馬車飛到空中，把他彈射到60英尺高的地方。他們...",
      "title": "WSB救了我弟弟的命! 在伊拉克受傷和嚴重的創傷後應激障礙之後，目標和希望讓一切都變得不同了! 謝謝你們！"
    }
  ],
  "title": "WSB saved my brother's life! After being wounded in Iraq, and severe PTSD, a purpose and hope made all the difference! Thank you!",
  "created_utc": 1614551211,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My brother and I were both soldiers, but he didn&#39;t make it out uninjured. He was assigned to Bagdad, and was a turret gunner in a quick response unit. On a slow day, as they were rounding a corner near a square, an IED was triggered sending the humvee into the air and catapulting him 60ft. They thought he was dead, and after securing the area realized he was alive. They flew him to Germany, then to Walter Reed, where he eventually wore up and was told he&#39;d never walk, and that they had resected some of his lover and intestines.</p>\n\n<p>After a year in a wheel chair, and working hard every day, he was able to walk again, then run. I remember him telling me he couldn&#39;t wait to get back to his unit. The Army medically retired him though, and he went into a deep depression, with which he struggled for a number of years. He eventually graduated from college with an engineering degree, but his accomplishments were overshadowed by his PTSD.</p>\n\n<p>About 2 months ago, i showed him <a href=\"/r/wallstreetbets\">r/wallstreetbets</a> and the dd that people were doing on the gme stock. He YOLO&#39;d his savings and sold half at 302,giving him enough to pay off his mortgage! E talk everyday, and he just got an amazing job 2 weeks ago doing R&amp;D in his major. He is focused, heavily invested in gme, and doesn&#39;t care what the price does. He likes the stock , and the community here have been encouraging and uplifting.</p>\n\n<p>THANK YOU ALL!!! you may not think you have an impact s an individual, but this is about more than just stocks. It is about people!</p>\n\n<p>To the moon!!!</p>\n\n<p>EDIT: I can&#39;t believe the love and support! I tried to respond and thank everyone for the awards and kind words, but can&#39;t keep up, so thank you all! I&#39;ve got mad respect for my fellow apes!</p>\n</div><!-- SC_ON -->",
  "score": 14778,
  "permalink": "/r/wallstreetbets/comments/lun2co/wsb_saved_my_brothers_life_after_being_wounded_in/",
  "subreddit": "wallstreetbets",
  "id": "lun2co",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937752787
}