{
  "author": "sapiel",
  "the_new_excerpt": "It could very well continue to go down, but even so, I'm only adding about 4% to\ntotal dollar amount wasted \"invested\" for a 25% reduction in cost average. It's\na small price to pay for a significant risk reduction.\n\nMy reasons for not writing this stock off:\n\n1) Like many here, I got into it late…",
  "original_created_utc": 1613515764,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "它很可能会继续下跌，但即使如此，我也只增加了4%左右。\n浪费的总金额 \"投资\"，成本平均降低25%。它的\n一个小小的代价，却换来了风险的大幅降低。\n\n我不注销这只股票的原因。\n\n1）像这里的许多人一样，我进入它晚了... ...",
      "title": "个人意见。今天我的GME仓位增加了20%左右，不建议你也这样做。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "它很可能會繼續下跌，但即使如此，我也只增加了4%左右。\n浪費的總金額 \"投資\"，成本平均降低25%。它的\n一個小小的代價，卻換來了風險的大幅降低。\n\n我不註銷這隻股票的原因。\n\n1）像這裏的許多人一樣，我進入它晚了... ...",
      "title": "個人意見。今天我的GME倉位增加了20%左右，不建議你也這樣做。"
    }
  ],
  "title": "Personal opinion: Increased my GME position by about 20% today, not recommending you do the same.",
  "created_utc": 1613543252,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It could very well continue to go down, but even so, I&#39;m only adding about 4% to total dollar amount <del>wasted</del> &quot;invested&quot; for a 25% reduction in cost average. It&#39;s a small price to pay for a significant risk reduction. </p>\n\n<p>My reasons for not writing this stock off:</p>\n\n<p>1) Like many here, I got into it late in the game and ~80% down as of right now. The current residual risk of losing 100% of the investment is only 20%. The potential upside is much higher.</p>\n\n<p>2) There is a large amount of calls up to $800 for the next 4 weeks that were bought by much bigger entities than baby powder snorting retards of this subreddit like myself. I want to see how that plays out.</p>\n\n<p>3) There are ongoing government inquiries, no global consensus on the SI, and lots of other factors that make it a useless exercise to try to predict anything at the moment.</p>\n\n<p>4) I&#39;m not much of a gamer, but I actually like the company. I think there&#39;s a lot of opportunity for growth from many angles, just based on the industry alone. I feel like we&#39;re kind of maxed out as a society on creating original movies. I don&#39;t believe that we can just continue cloning sequels and remakes like the Hollywood&#39;s been doing for the past 10 years. Video games on another hand are becoming more and more immersive and are equally fun and story-rich as movies, some may argue even better. Generationally, more and more people are going to be accustomed to gaming as well as they get older. The shift will take some time, but it&#39;s already happening.</p>\n\n<p>TLDR: Whatever it is you do in life, don&#39;t panic, take deep breaths, hydrate, get outside, and and listen to good music.</p>\n\n<p>Not financial advise. My job is in risk management that has nothing to do with finances and I know nothing about stocks.</p>\n</div><!-- SC_ON -->",
  "score": 1588,
  "permalink": "/r/wallstreetbets/comments/llftek/personal_opinion_increased_my_gme_position_by/",
  "subreddit": "wallstreetbets",
  "id": "llftek",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728635249
}