{
  "author": "Kellywasmyfirst",
  "original_created_utc": 1636240139,
  "title": "What is the one coin you would never sell?",
  "created_utc": 1636256430,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We all have our own dear coin/token, which has earned a special place in our hearts. A coin which you would never sell, no matter the price. A coin you would keep even if the price plummeted or skyrocketed to moon. </p>\n\n<p>&#x200B;</p>\n\n<p>As for me, I would have to go with Bitcoin. It was my first coin that I ever owned, it&#39;s sort of like a blue chip coin which means it&#39;s nothing flashy, just ol&#39; reliable OG coin. But I do have to admit BTC isn&#39;t perfect either. Mostly I&#39;m worried about the distant future, as we all know the mining rewards will diminish every halving cycle, and there might come a point at which miners will no longer find it profitable to mine and they may abandon the original chain a go fork another. But that&#39;s a very distant future, I&#39;m talking 20 or more years, and lots of stuff will definitely change until then.</p>\n\n<p>&#x200B;</p>\n\n<p>And what about your favorite coin?</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/qobn58/what_is_the_one_coin_you_would_never_sell/",
  "subreddit": "CryptoCurrency",
  "id": "qobn58",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We all have our own dear coin/token, which has earned a special place in our\nhearts. A coin which you would never sell, no matter the price. A coin you would\nkeep even if the price plummeted or skyrocketed to moon.\n\n\n\nAs for me, I would have to go with Bitcoin. It was my first coin that I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちは皆、心の中に特別な場所を得た、自分の大切なコイン／トークンを持っています。\nあると思います。どんなに高い値段でも絶対に売らないようなコイン。価格が急落しても、高騰しても\nそのコインは、たとえ価格が急落しても、急上昇しても手放さないでしょう。\n\n\n\n私の場合は、ビットコインですね。ビットコインは、私が初めて手にしたコインでした。",
      "title": "絶対に売らないコインは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都有自己亲爱的硬币/信物，它在我们的心中赢得了一个特殊的位置。\n心中的特殊位置。一枚你永远不会出售的硬币，无论价格如何。一枚你会\n即使价格暴跌或暴涨到月球，你也会保留。\n\n\n\n就我而言，我不得不选择比特币。这是我的第一个硬币，我...",
      "title": "什么是你永远不会出售的硬币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都有自己親愛的硬幣/信物，它在我們的心中贏得了一個特殊的位置。\n心中的特殊位置。一枚你永遠不會出售的硬幣，無論價格如何。一枚你會\n即使價格暴跌或暴漲到月球，你也會保留。\n\n\n\n就我而言，我不得不選擇比特幣。這是我的第一個硬幣，我...",
      "title": "什麼是你永遠不會出售的硬幣？"
    }
  ]
}