{
  "author": "ollie149",
  "the_new_excerpt": "I couldn’t be happier for him now, but I’m ashamed to say that I thought he was\ncrazy a few months ago.\n\nAfter reading all of the skeptics and crypto-veterans bash on XRP and Ripple all\nday, I was convinced that my dad was falling for a pyramid scheme. He’d\nsubscribed to a bunch of crypto YouTube…",
  "original_created_utc": 1618443077,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今ではこれ以上の幸せはありませんが、恥ずかしながら、数ヶ月前は彼のことを\nと思っていました。\n\n懐疑論者や暗号ベテランがXRPやリップルを叩いているのを一日中読んでいたので\n私は父がマルチ商法に騙されていると確信していました。父は\n沢山の暗号のYouTubeに登録していて...",
      "title": "私の父（先週の土曜日で44歳）は、0.40～0.60ドルの頃からXRPに深く（2万ドル）投資しています。来月には初めての新車を買う予定ですが、これも暗号のおかげです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我现在不能再为他高兴了，但我很惭愧地说，我以为他是... ...\n几个月前的疯狂。\n\n在阅读了所有的怀疑论者和加密老手对XRP和Ripple的抨击之后，所有的\n一天，我确信我的爸爸是落入了一个传销计划。他\n订阅了一堆加密YouTube... ...",
      "title": "我爸爸（上周六44岁）从0.40-0.60美元左右开始就一直球深（2万美元）进入XRP。下个月，他将购买他的第一辆全新的汽车，而这只是因为加密的缘故。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我現在不能再爲他高興了，但我很慚愧地說，我以爲他是... ...\n幾個月前的瘋狂。\n\n在閱讀了所有的懷疑論者和加密老手對XRP和Ripple的抨擊之後，所有的\n一天，我確信我的爸爸是落入了一個傳銷計劃。他\n訂閱了一堆加密YouTube... ...",
      "title": "我爸爸（上週六44歲）從0.40-0.60美元左右開始就一直球深（2萬美元）進入XRP。下個月，他將購買他的第一輛全新的汽車，而這只是因爲加密的緣故。"
    }
  ],
  "title": "My dad (44 last Saturday) has been balls deep ($20k) into XRP since around $0.40-0.60. Next month he’ll be buying his first ever brand new vehicle and it’s only possible because of crypto",
  "created_utc": 1618479033,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I couldn’t be happier for him now, but I’m ashamed to say that I thought he was crazy a few months ago.    </p>\n\n<p>After reading all of the skeptics and crypto-veterans bash on XRP and Ripple all day, I was convinced that my dad was falling for a pyramid scheme. He’d subscribed to a bunch of crypto YouTube accounts that would post daily videos talking only about XRP, followed them on Twitter, it was the only project he was interested in. And every day here I read how terrible the project was and how it didn’t stand for what crypto was meant to be. Every time I listened to one of his YouTube videos while working with him I thought he was crazier and crazier.    </p>\n\n<p>Looking back, it’s obvious that I forgot what a lot of people are realizing here: crypto is realistically all about the profits.    </p>\n\n<p>I’m happy for my dad; I’m happy I never told him how crazy he was; I’m happy he subscribed to all those XRP-shilling channels and never lost interest; I’m happy Ripple, both as a company and a coin, is doing well.    </p>\n\n<p>I wish I could thank the crypto community, but sometimes I guess you just have to put faith in what you believe in and ignore all the debate. So, thank you everyone, if you’re in here, that made this possible and thank you everyone who keeps the markets moving!</p>\n</div><!-- SC_ON -->",
  "score": 270,
  "permalink": "/r/CryptoCurrency/comments/mr2t5a/my_dad_44_last_saturday_has_been_balls_deep_20k/",
  "subreddit": "CryptoCurrency",
  "id": "mr2t5a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566616779
}