{
  "author": "samuth",
  "the_new_excerpt": "So I was trying to decide what to get my niece for her first birthday last July.\nI figured she's probably gonna get loads of crappy toys that she will quickly\ngrow out of . I had just started buying BTC earlier that year so I thought I\nwill get her some, I only bought £50.00 worth for her when it…",
  "original_created_utc": 1619368757,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "去年の7月、姪の1歳の誕生日に何を贈ろうかと考えていました。\nおそらく、すぐに飽きてしまうようなくだらないおもちゃをたくさんもらうことになるだろうと思いました。\nその年の初めにBTCを買い始めたばかりだったので、彼女に何かプレゼントしようと思いました。\n買ってあげようと思いました。",
      "title": "去年の夏、姪っ子の1歳の誕生日にビットコインを買ったことで笑われた。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我试图决定在去年7月我侄女的第一个生日时送她什么。\n我想，她可能会得到大量蹩脚的玩具，她很快就会长大。\n那年早些时候，我刚刚开始购买BTC，所以我想我会给她一些。\n我只给她买了50.00英镑的东西，当它出现时。",
      "title": "去年夏天，我为我侄女的第一个生日买了比特币，被人嘲笑。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我試圖決定在去年7月我侄女的第一個生日時送她什麼。\n我想，她可能會得到大量蹩腳的玩具，她很快就會長大。\n那年早些時候，我剛剛開始購買BTC，所以我想我會給她一些。\n我只給她買了50.00英鎊的東西，當它出現時。",
      "title": "去年夏天，我爲我侄女的第一個生日買了比特幣，被人嘲笑。"
    }
  ],
  "title": "Laughed at for buying my Niece bitcoin for her first birthday...Last summer.",
  "created_utc": 1619379528,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I was trying to decide what to get my niece for her first birthday last July.  I figured she&#39;s probably gonna get loads of crappy toys that she will quickly grow out of . I had just started buying BTC earlier that year so I thought I will get her some, I only bought £50.00 worth for her when it was worth $8000ish dollars. When my brother and his wife the parents of my niece opened the card to a message that said &quot; You now own 0.0066 Bitcoin&quot; they seemed a bit confused, my brother in law then laughed out loud and said&#39; Who buys a baby Bitcoin&#39;. I have to admit I felt pretty bad... It&#39;s now worth almost £300.00 and counting. I said she can withdraw when she&#39;s 18.</p>\n</div><!-- SC_ON -->",
  "score": 3294,
  "permalink": "/r/Bitcoin/comments/mybzz1/laughed_at_for_buying_my_niece_bitcoin_for_her/",
  "subreddit": "Bitcoin",
  "id": "mybzz1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776205682
}