{
  "author": "Suit_Artistic",
  "original_created_utc": 1642544493,
  "title": "CRYPTO SECRETS - what no one tells you",
  "created_utc": 1642567566,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;TLDR:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;You&amp;#39;re not gonna make it in crypto unless you know the bullshit &amp;amp; secrets that go on beyond the scenes. In this thread i will tell you what you need to know. You may not like it, but it&amp;#39;s important if you want to level up.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;INTRODUCTION&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Forget everything you think you know about cryptocurrency. &lt;/p&gt;\n\n&lt;p&gt;You need to realise crypto is a game. A game where, most likely, you will lose. A game filled with players with more experience than yourself. Players with far more influence, connection and often skill. The inconvenient truth is we aren’t all ‘gonna make it’ &lt;/p&gt;\n\n&lt;p&gt;Beyond Bitcoin &amp;amp; some credible projects there are countless failed ones. Some projects have good intentions but are grossly overvalued. Others are quite simply scams &amp;amp; money grabs.&lt;/p&gt;\n\n&lt;p&gt;But before you get angry at me &amp;amp; stop reading. Before you heckle ‘FUD’ or ‘You’re Not Gonna Make It’. Let me explain myself.&lt;/p&gt;\n\n&lt;p&gt;Yes crypto is filled with scams &amp;amp; scammers, but there is big money to be made. But only IF you understand how the rules of this game work &amp;amp; how to play it successfully. At the moment  many of you are playing the game blindfolded. Giving others the upperhand. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s why for this first post I will pull back the curtain. And reveal the rules of the game. The rules many don’t want you to know. If you’ve been in the game for a while you may know some of them. If you’re new, read it twice and let it all sink in.&lt;/p&gt;\n\n&lt;p&gt;Why am I doing this? Why am I revealing these secrets? Because before I teach you anything you need to know how this game works. You need to know these rules if you want to have a chance at actually winning. Because if you want to win this game, you must first know how it is played.&lt;/p&gt;\n\n&lt;p&gt;So you have two choices in front of you, do you want to learn the truth &amp;amp; get better.&lt;/p&gt;\n\n&lt;p&gt;Or do you want to carry on, hopiuming for the best&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;THE FIVE SECRET RULES&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;1 BE WARY OF INFLUENCERS&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Anyone who has been in crypto for more than six months will likely be aware of the first rule. Many of you will have been wrecked by a big YouTube influencer, who shilled you some random alt coin. You were told it would x100, you aped in &amp;amp; now it&amp;#39;s down 80%. Don’t be embarrassed or ashamed of this. To tell you the truth the same happened to me. In fact it was the best thing that ever happened to me. It taught me to actually do my own research, think for myself &amp;amp; find good people to teach me.&lt;/p&gt;\n\n&lt;p&gt;Yes there are good people in this crypto game (i’ll share some at the bottom of this article) but you need to understand many are not your friend &amp;amp; they don’t care about your bags. The problem is actually much bigger than you realize too. Many of the biggest YouTube influencers collude together in private telegram groups. They work together to hunt coins with a low market cap &amp;amp; volume, ones that can easily be pumped (and then dumped) in price. They work together to cut deals on new crypto projects and ensure their bags get filled before anyone else. Only to dump on their ‘fans’ down the line. Do you think it’s a confidence that MoonCarl worked with BitBoy, Crypto Banter, MM Crypto &amp;amp; Lark Davies to shill Kasta? I think not.&lt;/p&gt;\n\n&lt;p&gt;“But influencer xx is different &amp;#39;&amp;#39; I hear you cry. Well maybe you got lucky &amp;amp; found a good one. Yet even then, you need to be careful. Because if the person has millions of followers on YouTube they may still invertedly pump the price, as their followers ape in. Like it or not, you need to be weary of big YouTube influencers. They aren’t your friend &amp;amp; they don’t care about your god damn bags.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;2 BE CAUTIOUS OF BAD PROJECTS&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Some projects will ‘make it’ &amp;amp; usher in a new store value (Bitcoin), Economies (L1s), Defi, gaming (Play2Earn) &amp;amp; digital ownership (NFTs). However most projects won&amp;#39;t. Some projects will have good intentions and create a token to fund an exciting vision. But even then you have to ask the question…if the idea is so good &amp;amp; so financially lucrative, why are they willing to give up so much equity? Would you give up guaranteed money in a lucrative project? I think not. Yes some are committed to a decentralized future but they are few and far between.&lt;/p&gt;\n\n&lt;p&gt;Much worse is a bunch of less honorable ‘founders’ and ‘VCs’ that spotted an opportunity for a quick cash grab. These folks, mainly from a sales background, realized pretty quickly that they could get very rich (with very little effort) by doing an ICO and marketing the hell out of it. Their primary business objective isn’t to build a decentralized future, it’s simply to market the hell out of a project and dump their bags on newbies. You need to tell who are the “good” VCs and who are the “bad ones”.&lt;/p&gt;\n\n&lt;p&gt;Now all of this doesn&amp;#39;t mean you can’t make good money on bad projects, some people made millions off them. But I think you need to be aware of what is going on here, so you can plan your strategy accordingly. Next week I will go into more detail on the strategy I take on finding altcoins and managing risk.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;3 DON&amp;#39;T JOIN A CULT&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Perhaps one of the most dangerous aspects in crypto is the cult. It starts out innocently enough. A friend or someone you respect shills you a crypto project. You decide to read up on it via their website and whitepaper. You begin to follow the project on Twitter and join the Discord &amp;amp; Telegram groups. But this is where the problems start. Because the deeper you go into a project &amp;amp; the more involved you feel, the more dangerous it becomes. You are led to believe you are in a ‘community’ &amp;amp; that you are all ‘gonna make it&amp;#39;, when in fact you are joining a cult.&lt;/p&gt;\n\n&lt;p&gt;Cult’s are incredibly dangerous in crypto, because they remove your objectivity &amp;amp; critical thinking on a project. You&amp;#39;re surrounded by people in Telegram groups &amp;amp; Discords, who all hold the same biased belief system. And these belief systems &amp;amp; subsequent emotions are amplified ten fold, because money is involved. Think about it, no one is going to doubt their own project when they have so much money invested.&lt;/p&gt;\n\n&lt;p&gt;You see cult members everywhere. They are your friends in whatsapp groups, desperately trying to shill you a coin they aped into. They are those random people on Twitter trying to constantly push a project onto you. Everyday I get so many requests to buy project ‘x’ or ‘x to the moon’ but i will never listen. I will always form my own strategy (which will change with time &amp;amp; research) and evaluate accordingly. Some of you may not like my bluntness, but I am not here to tell you what you want to hear or sugar coat it. I want to help you &amp;amp; tell you the truth.&lt;/p&gt;\n\n&lt;p&gt;In short, it’s essential you do four things:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Form your own strategy based on research (and always be willing to change it).&lt;/li&gt;\n&lt;li&gt;Don’t become a cult member, always be objective.&lt;/li&gt;\n&lt;li&gt;Don’t fall for random shills everyone is talking about.&lt;/li&gt;\n&lt;li&gt;Don’t listen to people who only believe in one project &amp;amp; refuse to change their hypothesis.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;4 DONT HODL&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;HODL right? That&amp;#39;s what we are told to do. Just HOLD and we are all going to make it. Nope. Outside of Bitcoin and maybe Etherum, you cannot blindly HODL a project. There is no guarantee it is going to make it or that it will be around in the next five years. The altcoin space is incredibly volatile, which is great for exponential gains but can also get you wrecked if you blindly hold onto your bags.&lt;/p&gt;\n\n&lt;p&gt;You need to stop falling in love with a project. Oh ‘but the tech is so good’ or ‘the founder is a genius’ I hear you cry. I really don’t care. You need to stop holding your bags for years and take profits when you can. Taking profits is not only essential to de-risk yourself, it is also a great way to release capital to invest in other projects. I recently wrote a thread on taking profits, which seemed to be popular, which you can read below.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;5 STACK BLUE CHIPS&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;As I have said earlier, most altcoins won’t make it. Even if they run up x5 or x10 this bull run there is still a chance they could run to zero in the next bear market. Whether you like it or not, your primary objective should be to use the altcoins to increase your gains, take profits and layer into ‘less volatile’ projects like Bitcoin. For all the talk of ‘Bitcoin is a boomer coin’ the fact is, it is the project that has been around the longest and the one which almost certainly won’t fail. And let&amp;#39;s be honest if someone offered you fifty Bitcoin, would you really say no?&lt;/p&gt;\n\n&lt;p&gt;Again many of you won’t like this point of view, but again i am not here to sugar coat things. The crypto game is tough and I want to help you by telling you the truth.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;CONCLUSION&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;If you made it this far, I salute you. Many will have got angry at the truths I laid out. Others may have become disillusioned that the whole game is rigged and there is no hope of winning. But this is not the case at all. As I mentioned at the beginning of this article you first need to know the rules of the game, if you want a chance to win it. This first article is essential because it sets the ground rules of what to avoid &amp;amp; what to do; be weary of big influencers, don’t join a cult, don’t HODL alts &amp;amp; always stack blue chips (Bitcoin).&lt;/p&gt;\n\n&lt;p&gt;Now we have these rules in place, and truths exposed, we can begin to build our own strategy and figure out how to play this game better.&lt;/p&gt;\n\n&lt;p&gt;Thank you for reading!&lt;/p&gt;\n\n&lt;p&gt;original source: &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://brandsandblockhain.substack.com/p/the-secrets-rules-of-crypto\"&gt;https://brandsandblockhain.substack.com/p/the-secrets-rules-of-crypto&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 340,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/3pX8VHF1moOE8JziUXYFAcYDBdAYdQzk1Sn28_hA-WI.jpg?auto=webp&amp;s=6d6955c2ad4b59189eb3e173abf07f35222144a9",
          "width": 976,
          "height": 549
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/3pX8VHF1moOE8JziUXYFAcYDBdAYdQzk1Sn28_hA-WI.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=e3cdd56009fc805cde3342c2cec43e7b78429428",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/3pX8VHF1moOE8JziUXYFAcYDBdAYdQzk1Sn28_hA-WI.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=0da6138cd4077f823c2f382b09ec365661fcda42",
            "width": 216,
            "height": 121
          },
          {
            "url": "https://external-preview.redd.it/3pX8VHF1moOE8JziUXYFAcYDBdAYdQzk1Sn28_hA-WI.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=4054f2f26a71ca2a763e7b86ebfe311cb0b90b82",
            "width": 320,
            "height": 180
          },
          {
            "url": "https://external-preview.redd.it/3pX8VHF1moOE8JziUXYFAcYDBdAYdQzk1Sn28_hA-WI.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=53f1c44974b3be8aae15fc341551d53c717a6ba8",
            "width": 640,
            "height": 360
          },
          {
            "url": "https://external-preview.redd.it/3pX8VHF1moOE8JziUXYFAcYDBdAYdQzk1Sn28_hA-WI.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=ae48adf2ae01d916fc41fee012fb912970ca7943",
            "width": 960,
            "height": 540
          }
        ],
        "variants": {},
        "id": "2RsMCC7o3PP8JPRkuYsUTEInZV9mUYDOE9qlehH9Rjo"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/s79mzy/crypto_secrets_what_no_one_tells_you/",
  "subreddit": "CryptoCurrency",
  "id": "s79mzy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "TLDR:\n\nYou're not gonna make it in crypto unless you know the bullshit & secrets that\ngo on beyond the scenes. In this thread i will tell you what you need to know.\nYou may not like it, but it's important if you want to level up.\n\nINTRODUCTION\n\nForget everything you think you know about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TLDR\n\n暗号で成功するためには、暗号のデタラメと秘密を知らなければなりません。\n舞台裏で起きていること。このスレッドでは、あなたが知るべきことをお話しします。\n嫌かもしれないが、レベルアップを目指すなら重要なことだ。\n\nはじめに\n\nあなたが知っていると思うことはすべて忘れてください...",
      "title": "CRYPTO SECRETS - 誰も教えてくれないこと"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "简而言之。\n\n除非你知道幕后的废话和秘密，否则你不可能在加密货币领域有所作为。\n场景之外的事情。在这个主题中，我将告诉你你需要知道的东西。\n你可能不喜欢它，但如果你想提高水平，这很重要。\n\n简介\n\n忘记你认为你知道的一切......",
      "title": "秘密 - 没有人告诉你的东西"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "簡而言之。\n\n除非你知道幕後的廢話和祕密，否則你不可能在加密貨幣領域有所作爲。\n場景之外的事情。在這個主題中，我將告訴你你需要知道的東西。\n你可能不喜歡它，但如果你想提高水平，這很重要。\n\n簡介\n\n忘記你認爲你知道的一切......",
      "title": "祕密 - 沒有人告訴你的東西"
    }
  ]
}