{
  "author": "rootpl",
  "original_created_utc": 1636490701,
  "title": "We haven't seen the real euphoria phase of this bull run yet.",
  "created_utc": 1636519389,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Looking back at previous years on how BTC performed we can clearly see the real &#39;blow-off top&#39; moments in crypto. If we take a look at the 2014 bull run for example we can see that it was growing rater steadily for weeks but then the final &#39;blow-off top&#39; unfolded and in just four weeks it increased in price by 500% (this is from a weekly time frame so each bar represents one week):</p>\n\n<p><a href=\"https://preview.redd.it/41o1e8mkpmy71.jpg?width=430&amp;format=pjpg&amp;auto=webp&amp;s=d19d38a7dcfa2e4761b9509e763590723a070383\">https://preview.redd.it/41o1e8mkpmy71.jpg?width=430&amp;format=pjpg&amp;auto=webp&amp;s=d19d38a7dcfa2e4761b9509e763590723a070383</a></p>\n\n<p>If we measure it from the last dip before that crazy run, it was 9 weeks in total and a 1234% increase:</p>\n\n<p><a href=\"https://preview.redd.it/sc2l8dlormy71.png?width=499&amp;format=png&amp;auto=webp&amp;s=3626c2daab27ef551c4927c4d1f93538d114f6a5\">https://preview.redd.it/sc2l8dlormy71.png?width=499&amp;format=png&amp;auto=webp&amp;s=3626c2daab27ef551c4927c4d1f93538d114f6a5</a></p>\n\n<p>Then 2017 happened, and a similar situation happened again, since last big dip it went on an insane run and in just five weeks and the price increased by 250%: </p>\n\n<p><a href=\"https://preview.redd.it/ktu8jwvrpmy71.jpg?width=420&amp;format=pjpg&amp;auto=webp&amp;s=ff0be05d47e153849060a5af5ce52f118ae41729\">https://preview.redd.it/ktu8jwvrpmy71.jpg?width=420&amp;format=pjpg&amp;auto=webp&amp;s=ff0be05d47e153849060a5af5ce52f118ae41729</a></p>\n\n<p>And this is how 2021 looks like:</p>\n\n<p><a href=\"https://preview.redd.it/ddugpv5ypmy71.jpg?width=472&amp;format=pjpg&amp;auto=webp&amp;s=5145274dbfbda5a3b41a827dc63d938e6caf2844\">https://preview.redd.it/ddugpv5ypmy71.jpg?width=472&amp;format=pjpg&amp;auto=webp&amp;s=5145274dbfbda5a3b41a827dc63d938e6caf2844</a></p>\n\n<p>Can you see how the growth was kind of steady again for months and months? Some ups and downs. And then it took 12 weeks from the bottom of that big dip in January 2021 to reach ATH and a total price increase of 127%. I mean who gets out of the bed for a modest 127%? Pfffft! And it took nearly three months, booooring right?</p>\n\n<p>But if we measure it from the last big dip in February it&#39;s even more boring, it was 8 weeks before it hit ATH and it was going sideways for quite some time really and ended up with a modest 51% increase:</p>\n\n<p><a href=\"https://preview.redd.it/egzxlh1gqmy71.png?width=633&amp;format=png&amp;auto=webp&amp;s=3f54ef77f3b8f02bd2f651ec09115f3a9a8ef0f9\">https://preview.redd.it/egzxlh1gqmy71.png?width=633&amp;format=png&amp;auto=webp&amp;s=3f54ef77f3b8f02bd2f651ec09115f3a9a8ef0f9</a></p>\n\n<p>What I&#39;m trying to say is that we haven&#39;t seen the real ride yet. The real &#39;blow-off top&#39; I personally will get excited when I see vertical walls of green, walls that you need freaking climbing gear to get on top of those walls. We haven&#39;t seen one yet IMO. And I hope we&#39;ll see one this year or maybe in Q1 next year? It&#39;s that time when everyone talks about crypto. Your boss, your mailman, your grandma that random dude in a bar. It&#39;s time when your brothers and sisters who know that you are into crypto start sending you money so you can buy some for them because they don&#39;t know how to do it. That&#39;s when dreams come true. I wish everybody that we&#39;ll see a proper &#39;blow-off top&#39; sooner than later. It is going to be freaking insane!</p>\n</div><!-- SC_ON -->",
  "score": 179,
  "permalink": "/r/CryptoCurrency/comments/qqcudr/we_havent_seen_the_real_euphoria_phase_of_this/",
  "subreddit": "CryptoCurrency",
  "id": "qqcudr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Looking back at previous years on how BTC performed we can clearly see the real\n'blow-off top' moments in crypto. If we take a look at the 2014 bull run for\nexample we can see that it was growing rater steadily for weeks but then the\nfinal 'blow-off top' unfolded and in just four weeks it increased…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BTCの過去のパフォーマンスを振り返ると、本当の意味での「ブローオフ・トップ」がはっきりとわかります。\n暗号の「ブローオフ・トップ」の瞬間を明確に見ることができます。例えば、2014年のブルランを見てみましょう。\n例えば、2014年の強気の相場を見てみると、何週間も安定して上昇していましたが、その後、最後の「ブローオフ・トップ」が展開され\n最後の「ブローオフ・トップ」が展開され、わずか4週間で...",
      "title": "今回のブルランでは、まだ本当の意味でのユーフォリア（幸福感）の段階を見ていません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "回顾前几年BTC的表现，我们可以清楚地看到加密货币真正的\n爆炸性顶部 \"的时刻。如果我们看一下2014年的牛市运行，例如\n例如，我们可以看到，它在数周内稳步增长，但随后的\n最后的 \"炸顶 \"展开了，在短短四周内，它增加了...",
      "title": "我们还没有看到这轮牛市运行的真正欣喜阶段。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "回顧前幾年BTC的表現，我們可以清楚地看到加密貨幣真正的\n爆炸性頂部 \"的時刻。如果我們看一下2014年的牛市運行，例如\n例如，我們可以看到，它在數週內穩步增長，但隨後的\n最後的 \"炸頂 \"展開了，在短短四周內，它增加了...",
      "title": "我們還沒有看到這輪牛市運行的真正欣喜階段。"
    }
  ]
}