{
  "author": "TLu_03",
  "original_created_utc": 1631147161,
  "title": "Am I an out-of-touch-old-guy boss?",
  "created_utc": 1631175497,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Looking for some feedback. </p>\n\n<p>I (35m) am in a senior management position within my organization. I have several teams that work for me, and each team has a team lead who reports directly to me. My best team (8 individuals ages 23-27) is managed by a lesbian who is engaged to another woman within our organization. </p>\n\n<p>Today my best team was hanging near my office having small talk. I heard “that’s fucking gay” from one of the females on the team. I have heard “that’s gay” several times from several members of this team; only in passing or when they are shooting the shit. </p>\n\n<p>Anyways, I pop out and ask the whole team to come into my office. I bring up how “gay” used in a derogatory manner could be offensive, and oh ya, have you guys forgotten your team lead is gay? The female who I heard say it tells me she identifies as LGBTQIA and she doesn’t care about it, but she also has never asked her boss how she felt about it. Ok. “How would you guys feel if I was in front of all the teams and said ‘that’s fucking gay’?” Everyone agreed it wouldn’t be cool. </p>\n\n<p>I didn’t tell them they couldn’t go around saying that, but I spoke to being professional and being cognizant of who is around. I think the general consensus was “that’s fucking gay” was no big deal to them.</p>\n\n<p>Am I out of touch? Was it wrong I used their team lead as an example?</p>\n</div><!-- SC_ON -->",
  "score": 126,
  "permalink": "/r/NoStupidQuestions/comments/pkmrki/am_i_an_outoftoucholdguy_boss/",
  "subreddit": "NoStupidQuestions",
  "id": "pkmrki",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Looking for some feedback.\n\nI (35m) am in a senior management position within my organization. I have\nseveral teams that work for me, and each team has a team lead who reports\ndirectly to me. My best team (8 individuals ages 23-27) is managed by a lesbian\nwho is engaged to another woman within our…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ご意見をお聞かせください。\n\n私(35m)は組織内で上級管理職に就いています。私の下にはいくつかのチームがあります。\n各チームには私の直属の部下であるチームリーダーがいます。\n私に直接報告します。私の最高のチーム（23歳から27歳までの8人）は、社内で他の女性と婚約しているレズビアンの方が管理しています。\nその人は社内で別の女性と婚約していて...",
      "title": "私は時代遅れの年寄りの上司なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "希望得到一些反馈。\n\n我（35岁）在我的组织中担任高级管理职位。我有\n有几个为我工作的团队，每个团队都有一个直接向我报告的团队领导。\n直接向我汇报。我最好的团队（8人，年龄23-27岁）由一名女同性恋者管理。\n她与我们的另一位女性订婚。",
      "title": "我是一个不合时宜的老家伙老板吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "希望得到一些反饋。\n\n我（35歲）在我的組織中擔任高級管理職位。我有\n有幾個爲我工作的團隊，每個團隊都有一個直接向我報告的團隊領導。\n直接向我彙報。我最好的團隊（8人，年齡23-27歲）由一名女同性戀者管理。\n她與我們的另一位女性訂婚。",
      "title": "我是一個不合時宜的老傢伙老闆嗎？"
    }
  ]
}