{
  "author": "WeeniePops",
  "the_new_excerpt": "So my dad is getting toward his 70s and is a retired CPA. He's always done my\ntaxes for me ever since I started working. He's also a pretty conservative and\ntraditional guy financially, and is pretty slow to adopt new technology (he just\nlearned how to text and got a smart phone like 2 years ago).…",
  "original_created_utc": 1616658958,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以我爸快70多岁了，是个退休的注册会计师。他总是做我的\n自从我开始工作后，他就为我缴税。他也是一个相当保守和\n在经济上是个传统的人，而且对新技术的采用相当缓慢（他只是在他的公司里，他的公司是一个很好的公司）。\n学会了如何发短信，并在2年前买了一部智能手机）....。)",
      "title": "我终于告诉我的潮爸，我投资了加密技术。它并没有像预期的那样..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我爸快70多歲了，是個退休的註冊會計師。他總是做我的\n自從我開始工作後，他就爲我繳稅。他也是一個相當保守和\n在經濟上是個傳統的人，而且對新技術的採用相當緩慢（他只是在他的公司裏，他的公司是一個很好的公司）。\n學會了如何發短信，並在2年前買了一部智能手機）....。)",
      "title": "我終於告訴我的潮爸，我投資了加密技術。它並沒有像預期的那樣..."
    }
  ],
  "title": "I finally told my boomer dad I invest in crypto. It did not go as expected...",
  "created_utc": 1616683240,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So my dad is getting toward his 70s and is a retired CPA. He&#39;s always done my taxes for me ever since I started working. He&#39;s also a pretty conservative and traditional guy financially, and is pretty slow to adopt new technology (he just learned how to text and got a smart phone like 2 years ago). Anyway, I started investing in crypto in Jan 2019, and vowed never to tell him until I absolutely had to, like when I finally took profits and had to report the capital gains. I always knew he&#39;d have a terrible reaction to it. Well, last year when Link had it&#39;s big run up I decided to finally sell a little bit of it, since it way outperformed the rest of the market. I am very much a hodler, but that move just seemed too obvious at the time and it ended up paying off. Jump to a few days ago and my dad asks me when I&#39;m going to give him my tax info. I had been trying to hold off but I decided to finally spill the beans. I grit my teeth and told him I had been buying crypto since 2019 and that I had X number of capital gains to pay this year... and the first thing he said was... &quot;Well I hope you didn&#39;t sell all of it! Bitcoin just went over 60k the other day!&quot; My jaw hit the floor. I had NO idea he kept up with this stuff. I went on to tell him about my portfolio and unrealized gains I currently have. I thought he was going to tell me to sell it all and run for the hills. He told me to keep holding!! He then told me about how he has block chain company stocks, he knows about Bitcoin and Ethereum, knows about Michael Saylor and Elon Musk&#39;s interest in Btc. He even follows some advisors who talk a lot about crypto. He wants me to teach him more about crypto and may consider buying some himself. </p>\n\n<p>Guys, honestly I&#39;m not sure what the point of this post is, but I just had to get this off my chest. I feel like such a weight has been lifted from me, and idk, if you&#39;re on the fence about telling someone, maybe just go for it. I was truly shocked and surprised how much my old school boomer dad knew about crypto and how supportive he was of me getting into it. Hopefully this will give someone the courage to be more open about crypto, because at the end of the day, we DO need to talk about it and encourage adoption, regardless of the opinions we <em>think</em> we may receive. Alright, sorry for rambling. Have a good night!</p>\n\n<p><strong>TL:DR: Didn&#39;t want to tell my non tech savvy boomer dad I invested in crypto because I thought he&#39;d call me an idiot. Turns out he already knows a bunch about crypto and is fully supportive of my investments. Good vibes.</strong></p>\n</div><!-- SC_ON -->",
  "score": 628,
  "permalink": "/r/CryptoCurrency/comments/mcsz5x/i_finally_told_my_boomer_dad_i_invest_in_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "mcsz5x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357135569
}