{
  "author": "etheraider",
  "the_new_excerpt": "Revised and updated with additional points\n\n--------------------------------------------------------------------------------\n\nFor those of you who are new, you may not know but the next 3-6 months are\narguably the most significant months in the 5+ year history of the Ethereum\necosystem. And here is…",
  "original_created_utc": 1616773076,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "经修订和更新，增加了要点\n\n--------------------------------------------------------------------------------\n\n对于那些新来的人，你可能不知道，但未来3-6个月是\n可以说是Ethereum 5年多历史上最重要的几个月。\n生态系统。而这里是...",
      "title": "Ethereum价值主张。新手指南"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "經修訂和更新，增加了要點\n\n--------------------------------------------------------------------------------\n\n對於那些新來的人，你可能不知道，但未來3-6個月是\n可以說是Ethereum 5年多歷史上最重要的幾個月。\n生態系統。而這裏是...",
      "title": "Ethereum價值主張。新手指南"
    }
  ],
  "title": "The Ethereum Value Proposition: A Beginner's Guide",
  "created_utc": 1616784747,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Revised and updated with additional points</p>\n\n<hr/>\n\n<p>For those of you who are new, you may not know but the next 3-6 months are arguably the most <strong>significant</strong> months in the 5+ year history of the Ethereum ecosystem. And here is why:</p>\n\n<p>1) <strong>EIP-1559</strong> is confirmed to launch this summer. What this means is that net &quot;issuance&quot; which means new coins minted is going to be <strong>dramatically</strong> lowered. To put it in perspective the, the issuance rate right now is 4.5% per year, the estimates for the issuance rate after EIP 1559 is implemented are .5 - 1%. Why does this matter? So bitcoin issuance halves every 4 years right? and from that we see the bull run begin and bitcoin goes on a tear. Well an issuance drop from 4.5% is the equivalent of 3 halvenings happening at one time. (4.5 cut in half to 2.25 again to 1.125 and again to .56). Ethereum is already at a multi year low supply on exchanges, once this happens Ethereum will become <strong>instantly</strong> scarce. People are starting to dub this the &quot;Cliffening&quot;</p>\n\n<p>2) <strong>Staking and POS</strong> - Staking means you can lock up your ETH and you get paid rewards just like miners get rewarded for buying all the equipment and running the rigs and monitoring them and then being compensated for validating the blocks. You are going to be able to do the exact same thing without any of the upfront costs, right now you can only stake on your own node which very few users are able to do or on a few exchanges, but very soon coinbase will be allowing you to stake directly on their app. It will literally be the click of a button and you will be earning rewards. <strong>This will also further &quot;Lock up&quot; millions of additional ETH and remove them from the circulating supply</strong> and therefore further increase the scarcity of ETH.  As mentioned before ETH supply on exchanges is already at a multi-year low, once coinbase implements staking a significant portion of the ETH being traded on coinbase and other exchanges will &quot;poof&quot; and be locked away. This means way less circulating supply which economically should put upward pressure on the price. </p>\n\n<p>The Ethereum Devs are now also going to try to merge to POS (full proof of stake with <strong>zero</strong> mining) a lot sooner as early as fall, which means in 6 months time there could be no miners dumping coins every day on markets. This is a significant point because the people who are now earning the &quot;new&quot; ETH being minted are the hodlers, and because the those users do not have a lot of up front or fixed costs, what do you think they are going to do? Sell all their rewards instantly (like the miners do now) or continue holding and letting their rewards grow in value?\nThe switch to POS will incentive people to hodl and remove selling pressure from ETH. </p>\n\n<p>3) <strong>Scaling</strong> - the top 2 scaling solutions coming out in the next few months are optimism and arbitrum. (Optimism just announced yesterday their release is confirmed for July and Arbitrum is right now in their final testnet and will most likely launch before Optimism) They will allow dapps to basically copy paste their code and onboard onto a super fast highway where essentially they can do hundreds to thousands of TPS for almost no cost. Think Elon building his underground tunnels under LA, thats how L2 will work. People will be able to seamless board and unboard and go super fast from A to B and get back above ground (L1) all while reducing congestion and costs. This will be incredibly bullish for the ecosystem because 1. fees will substantially go down in the network, 2. More ETH will be locked up in protocols because a lot of the DEFI applications will once again be cheap to use for the average user. Uniswap for example which is the number one gas user on the network is going to launch with Optimism shortly after its May 5th launch (one month away).  Once that happens between 20-30% of the congestion is going to come off the network lowering fees <strong>substantially</strong> and increase the usage on the network. <strong>ETH will be the most used blockchain in the world by a long shot.</strong></p>\n\n<p>4) <strong>Economies of Scale</strong> - Just like when the internet went from dialup to broadband to high speed to fiber this evolution enabled brand new usecases and applications to exist, like online streaming, online gaming, social media etc the Ethereum blockchain and its scaling will enable entirely new and innovative use cases. This nascent &quot;bubble&quot; in NFTs is an example of one of these new use cases in its infancy. Right now, it looks like random, hype driven, mania. <strong>But what happens when online games that are integrating with ENJIN and Ethereum let you trade your in game items &quot;across&quot; platforms?</strong> You have a rare item in world of warcraft that you can then trade for something rare in Fortnite or Diablo or whatever.... the gaming industry is a multi billion dollar industry and this is the first time in history that users will be able to truly <strong>own</strong> their in game items.....NFT&#39;s all of a sudden stop being a bubble and have real world applications in a very powerful way. This is just one example of the possibilities that come with the growing economics of scale in Ethereum, and we are already starting to see them unfold. </p>\n\n<p>5) <strong>Technicals/Historical patterns/Risk Reward Opportunity</strong> - ETH the last bull run outperformed Bitcoin the entire cycle. The ETH BTC ratio went over .1, which is over a 3x from its current ratio now. The ratio has also been in an ascending pattern for the last 6 months and right now we are at the bottom of that pattern and if we continue it are going to make a substantial move up in the coming months <a href=\"https://np.imgur.com/a/g8z4Nwq\">https://np.imgur.com/a/g8z4Nwq</a> The chart pattern would also coincide with all the &quot;news&quot; of the coming developments listed above, staking on coinbase, EIP 1559, scaling all of that, so we could very well see a massive bullish move on Ethereum in a &quot;perfect storm&quot; of great news, development, and technical analysis.</p>\n\n<p><strong>TL:DR:</strong> In short after EIP 1559 Ethereum, very much like Bitcoin, will have increasing scarcity and significantly increase its viability as a store of value. <strong>But in a uniquely new way it will be able to combine that scarcity also with an increasing and incredible amount of utility</strong>, with more and more ETH locked up, collaterilized, staked, burned up in gas, and used in dapps and transactions. It will be like if gold which is already a rare asset, all of a sudden needed to be used to build all the roads, buildings, structures and businesses of society. Thats what ETH is to the ETH ecosystem.</p>\n\n<p><strong>The increasing scarcity and increasing utility of ETH will be a deadly combination.</strong></p>\n\n<p>So why am I telling you all of this? Because for a change, Id like to see the new guy get ahead of the curve and buy before the massive potential pump while the waters are quiet, not when every headline is screaming buy buy buy and price has already pumped. And because I am sick and tired of seeing noobs getting screwed over by all these scammy youtubers, shills and other trying to take advantage of new investor ignorance. I was once in your shoes and it sucked not knowing what to believe (it still sucks) and seeing so many people trying to manipulate me into buying their stupid hype coin with no future.</p>\n\n<p>I got so much flak from people for posting this like Im trying to &quot;pump my bags&quot;..... to those people I say: I own Ethereum obviously because Im not a hypocrite, but if you think one post on reddit from a nobody is going to swing the markets up 100&#39;s of dollars and make me rich........lol.</p>\n\n<p>At the end of the day, do whatever you want, but this is exactly the sort of content I joined this sub years ago for, and over the years it was posts like this that helped me understand and make better investment decisions, and so this is me just trying to give back. Good luck.</p>\n</div><!-- SC_ON -->",
  "score": 1080,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/V3nslGsUNfgCTu7EJbtL1DR53zCLD9o8UFROGuzdnIg.jpg?auto=webp&s=c79deecec0e88e95ed9e309840b8d4b78b07f88a",
          "width": 600,
          "height": 315
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/V3nslGsUNfgCTu7EJbtL1DR53zCLD9o8UFROGuzdnIg.jpg?width=108&crop=smart&auto=webp&s=40beeb5c8cfcca8e5cf423cc5fffd516901c2390",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/V3nslGsUNfgCTu7EJbtL1DR53zCLD9o8UFROGuzdnIg.jpg?width=216&crop=smart&auto=webp&s=68bea9d7f9b9be8aa05084823629b9e13491eb50",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/V3nslGsUNfgCTu7EJbtL1DR53zCLD9o8UFROGuzdnIg.jpg?width=320&crop=smart&auto=webp&s=0195af7203b0d4180ee8f571c8a8a951e8e6d0bb",
            "width": 320,
            "height": 168
          }
        ],
        "variants": {},
        "id": "kFTQUaph2MQNSNzUSTHpTrlN_yS0YvjJ1acZI71HNWo"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/mdrc4t/the_ethereum_value_proposition_a_beginners_guide/",
  "subreddit": "CryptoCurrency",
  "id": "mdrc4t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357135585
}