{
  "author": "LegalHelpNeeded3",
  "the_new_excerpt": "As a long-time member of the sub, I fucking LOVE loss porn. Like holy shit this\nlast week has been amazing. But the accompanying stories have ruined my loss\nboner, so it’s time to address this.\n\nThere have been increasing posts of people pouring their life savings into GME\nand other meme stocks,…",
  "original_created_utc": 1612634819,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "作为子的老会员，我TMD很喜欢亏损色情。就像我的妈呀这\n上周已经很神奇了。但随之而来的故事却毁了我的失落感\n骨子里，所以是时候解决这个问题了。\n\n有越来越多的帖子说，有人把一生的积蓄都投入到金交所中去了\n和其他备忘录股，...",
      "title": "这一周很漫长，要做好准备，迎接未来的到来。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲子的老會員，我TMD很喜歡虧損色情。就像我的媽呀這\n上週已經很神奇了。但隨之而來的故事卻毀了我的失落感\n骨子裏，所以是時候解決這個問題了。\n\n有越來越多的帖子說，有人把一生的積蓄都投入到金交所中去了\n和其他備忘錄股，...",
      "title": "這一週很漫長，要做好準備，迎接未來的到來。"
    }
  ],
  "title": "This has been a long week, be prepared for what’s to come.",
  "created_utc": 1612672177,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As a long-time member of the sub, I fucking <strong>LOVE</strong> loss porn. Like holy shit this last week has been amazing. But the accompanying stories have ruined my loss boner, so it’s time to address this. </p>\n\n<p>There have been increasing posts of people pouring their life savings into GME and other meme stocks, hopping on the hype train hoping to make a buck. This is an absolutely terrible idea. <strong>You should absolutely never invest money you cannot afford to lose.</strong> And if you made some money, take out your initial investment and play with the gains, it’s free money after all.</p>\n\n<p>Us OG’s want to see you make money. That’s what the sub is about. We want to see people take stupid fucking risks, but not lose their livelihood doing it. Please also remember to do your own DD. Or at the very least, click on some of the links people put in their DD and try and understand how they reached that conclusion.</p>\n\n<p>Next, recognize what a <em>”pump &amp; dump”</em> scheme is. We’ve seen a lot of them come through this sub in the past, so we know what to watch out for. Many new folks however, aren’t familiar with any of that. If you see someone try to hype up a security, do research into it before you buy. If there’s no new news out or they’re a tiny company, absolutely <strong>DO NOT</strong> get involved. You will get burned. </p>\n\n<p>Finally, it’s okay to take profits. You never lose when you’re up and cash out, you’re just securing those gains. It’s also okay to take the loss and reinvest in something else. There are no rules dictating you have to make that money back in that same stock.</p>\n\n<p>And remember this saying: <em>”Bulls make money. Bears make money. Pigs get slaughtered.”</em></p>\n\n<p>Don’t be a pig. Don’t get greedy. </p>\n\n<p>Welcome to the casino. Stay a while. But remember to check out some other tables/machines. Don’t go all in on craps when you don’t know how to play craps. </p>\n\n<p>TLDR: read the fucking post you shits</p>\n\n<p>Edit: Positions because I’m a degenerate retard:</p>\n\n<p>Cash from GME and TSLA gains. Currently a liquid portfolio until Monday.</p>\n</div><!-- SC_ON -->",
  "score": 1951,
  "permalink": "/r/wallstreetbets/comments/le31f7/this_has_been_a_long_week_be_prepared_for_whats/",
  "subreddit": "wallstreetbets",
  "id": "le31f7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123213450
}