{
  "author": "WhoAmIEven2",
  "original_created_utc": 1631541776,
  "title": "Why do Slavic people never use \"the\"?",
  "created_utc": 1631564419,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I thought it was just a movie stereotype, but then suddenly my company was bought by a Polish company with subsidiaries in Bulgaria, Russia and the Czech Republic. </p>\n\n<p>Whenever they write something they almost never use &quot;the&quot;. Like now, when we are experiencing technical issue, one of the IT guys said &quot;we will look into issue and fix problem&quot;. </p>\n\n<p>This isn&#39;t meant to dunk on them. My English is far from perfect and I probably make typical Swedish mistakes, but since it&#39;s so common when people from the Slavic world speak English I just have to ask.</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/NoStupidQuestions/comments/png2yq/why_do_slavic_people_never_use_the/",
  "subreddit": "NoStupidQuestions",
  "id": "png2yq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I thought it was just a movie stereotype, but then suddenly my company was\nbought by a Polish company with subsidiaries in Bulgaria, Russia and the Czech\nRepublic.\n\nWhenever they write something they almost never use \"the\". Like now, when we are\nexperiencing technical issue, one of the IT guys said…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ただの映画のステレオタイプだと思っていましたが、突然、私の会社が、サブシ\nブルガリア、ロシア、チェコに子会社を持つポーランド企業に買収されてしまったのです。\nと言われました。\n\n彼らが何かを書くときには、ほとんど「the」を使いません。今のように、私たちが技術的な問題を抱えているときは\n今のように、技術的な問題が発生したとき、IT担当者の一人がこう言いました...",
      "title": "なぜスラブ人は「the」を使わないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我以为这只是电影中的刻板印象，但后来我的公司突然被一家在保加利亚、俄罗斯和捷克设有子公司的波兰公司收购。\n被一家在保加利亚、俄罗斯和捷克都有子公司的波兰公司收购。\n共和国。\n\n每当他们写东西时，他们几乎从不使用 \"the\"。就像现在，当我们正在\n遇到技术问题时，一个IT人员说...",
      "title": "为什么斯拉夫民族从不使用 \"the\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我以爲這只是電影中的刻板印象，但後來我的公司突然被一家在保加利亞、俄羅斯和捷克設有子公司的波蘭公司收購。\n被一家在保加利亞、俄羅斯和捷克都有子公司的波蘭公司收購。\n共和國。\n\n每當他們寫東西時，他們幾乎從不使用 \"the\"。就像現在，當我們正在\n遇到技術問題時，一個IT人員說...",
      "title": "爲什麼斯拉夫民族從不使用 \"the\"？"
    }
  ]
}