{
  "author": "mhucpr",
  "the_new_excerpt": "Time in the market is the key factor, so if you're patient, you'll make decent\nmoney regardless of how much you have invested.\n\nEven if all you have invested is a few hundred dollars, that amount could be\nsignificant to you, and the gains you receive will also be significant, A\nsmaller investment at…",
  "original_created_utc": 1619717778,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "市場での時間が重要な要素であり、忍耐強い人であれば、投資額に関わらず、きちんとした\n辛抱強く続けていれば、投資額に関係なく、きちんと稼げるようになります。\n\nたとえ数百ドルしか投資していなくても、その額はあなたにとって大きなものになるでしょう。\n得る利益も大きくなるでしょう、A\n少ない投資で...",
      "title": "10万円でも50万円でも、投資したことに変わりはありません。肝心なのは、自分の将来を良くするために何かをしているということです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "市场上的时间是关键因素，所以如果你有耐心，无论你投资多少，你都会赚到体面的\n无论你投资多少，都能赚到钱。\n\n即使你只投资了几百美元，这个数额对你来说也是很重要的，你得到的收益也会很可观。\n对你来说意义重大，你获得的收益也将是巨大的。\n较小的投资在...",
      "title": "如果你投资10万美元或50万美元，这并不重要。底线是，你在做一些事情来改善你的未来。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "市場上的時間是關鍵因素，所以如果你有耐心，無論你投資多少，你都會賺到體面的\n無論你投資多少，都能賺到錢。\n\n即使你只投資了幾百美元，這個數額對你來說也是很重要的，你得到的收益也會很可觀。\n對你來說意義重大，你獲得的收益也將是巨大的。\n較小的投資在...",
      "title": "如果你投資10萬美元或50萬美元，這並不重要。底線是，你在做一些事情來改善你的未來。"
    }
  ],
  "title": "It doesn't matter if you invested $100 or $500K. Bottom line is, you're doing something to improve your future.",
  "created_utc": 1619745503,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Time in the market is the key factor, so if you&#39;re patient, you&#39;ll make decent money regardless of how much you have invested.</p>\n\n<p>Even if all you have invested is a few hundred dollars, that amount could be significant to you, and the gains you receive will also be significant, A smaller investment at first is ideal to test the waters, it gives you time to understand how crypto works, and do your own research on projects. DCA helps manage your Crypto investment, and is a favoured method of the sub.</p>\n\n<p>When I started I would&#39;ve been amazed just to double my investment, things are looking good now thanks to my patience. Remember, only invest what you can afford to lose, do your own research, and don&#39;t be afraid to ask, we&#39;re friendly here.</p>\n</div><!-- SC_ON -->",
  "score": 867,
  "permalink": "/r/CryptoCurrency/comments/n19nfz/it_doesnt_matter_if_you_invested_100_or_500k/",
  "subreddit": "CryptoCurrency",
  "id": "n19nfz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380959903
}