{
  "author": "JimmyRecard",
  "original_created_utc": 1629709130,
  "title": "Why did Mao fail to introduce an alphabet-based writing system despite saying that he wanted to do so?",
  "created_utc": 1629725403,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve learned recently that Mao was in support of reforming the Chinese writing system to use Latin or Cyrilic alphabet to aid in increasing literacy following the end of the WW2 and that Stalin, among others, tried to dissuade him from doing so.</p>\n\n<p>Everything that I know of Mao leads me to believe that he would not have been... &#39;encumbered&#39; by such considerations as history or tradition or even practicality of his ideas and plans, so what transpired around him to lead him to abandon this idea? Did it ever become more than just an idea?</p>\n\n<p>Why would Stalin oppose such a plan, even informally? I would imagine that spreading Cyrilic alphabet to billion Chinese people would potentially make it as dominant as Latin is today, and surely Stalin understood that? Wouldn&#39;t this be in line with the &#39;Workers of the world, unite&#39; ideas and Comintern/Cominform goals?</p>\n\n<p>I&#39;m familiar with some of the practical linguistic problems of such a plan (no standard Chinese at the time until Bejing Mandarin was defined, problems of hanzi logograms not defining pronunciation and many variations existing which no alphabet system could account for).</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/p9vvhd/why_did_mao_fail_to_introduce_an_alphabetbased/",
  "subreddit": "AskHistorians",
  "id": "p9vvhd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've learned recently that Mao was in support of reforming the Chinese writing\nsystem to use Latin or Cyrilic alphabet to aid in increasing literacy following\nthe end of the WW2 and that Stalin, among others, tried to dissuade him from\ndoing so.\n\nEverything that I know of Mao leads me to believe…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近知ったのですが、毛沢東は中国の文字体系の改革を支持していたようです。\n第二次世界大戦後の識字率向上のために、毛沢東は中国の文字体系をラテン語やキリル文字に改革することを支持していた。\n第二次世界大戦後の識字率向上のために、毛沢東は中国の文字体系をラテン語やキリル文字に改革することを支持していた。\nスターリンなどが彼を説得しようとした。\n\n私が毛沢東について知っているすべてのことは、私に信じさせてくれます...。",
      "title": "毛沢東は、アルファベットを使った文字を導入したいと言っていたにもかかわらず、なぜ導入できなかったのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近了解到，毛泽东支持改革中国的文字系统，使用拉丁字母或西里尔字母。\n使用拉丁字母或西里尔字母，以帮助提高二战后的识字率。\n二战结束后，斯大林等人曾试图劝阻他不要这样做。\n这样做。\n\n我对毛泽东的一切了解使我相信...",
      "title": "为什么毛泽东说他想引进以字母为基础的书写系统，但却没有这样做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近了解到，毛澤東支持改革中國的文字系統，使用拉丁字母或西裏爾字母。\n使用拉丁字母或西裏爾字母，以幫助提高二戰後的識字率。\n二戰結束後，斯大林等人曾試圖勸阻他不要這樣做。\n這樣做。\n\n我對毛澤東的一切瞭解使我相信...",
      "title": "爲什麼毛澤東說他想引進以字母爲基礎的書寫系統，但卻沒有這樣做？"
    }
  ]
}