{
  "author": "Spreizbacken",
  "original_created_utc": 1635691689,
  "title": "You wouldn't have held BTC even if you bought in under $1 in 2009 and deep down you know it!",
  "created_utc": 1635719445,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Do you remember the time when you first heard of Bitcoin? What was your first thought?<br/>\nSome fake digital money, ponzi scammy scheme?<br/>\nYeah, most of us did. This is why so few of us actually invested back than and even those who did didn&#39;t have even the 80% of the conviction we have today.<br/>\nBTC is now 13 years old, we have seen it rally, we have seen it fall down to almost nothing and it has persisted the test of time. We know this now, but nobody knew it back than.</p>\n\n<p>If you invested back than and got your money x10, chances of you not cashing out and are very close to zero, because at that time, back than this is what any sane person would have done.</p>\n\n<p>Don&#39;t kill your vibe with &#39;&#39;what if I bought and held, I would&#39;ve been a millionaire by now!&#39;. No. You didn&#39;t buy because you didn&#39;t have the conviction and free money to risk. You wouldn&#39;t have held, because the risk back than was way way bigger than it is now.</p>\n\n<p>Be easy on yourself, keep healthy.<br/>\nStay positive and pay attention on your actions now, no reason to live in the past.</p>\n</div><!-- SC_ON -->",
  "score": 174,
  "permalink": "/r/CryptoCurrency/comments/qjr107/you_wouldnt_have_held_btc_even_if_you_bought_in/",
  "subreddit": "CryptoCurrency",
  "id": "qjr107",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Do you remember the time when you first heard of Bitcoin? What was your first\nthought?\nSome fake digital money, ponzi scammy scheme?\nYeah, most of us did. This is why so few of us actually invested back than and\neven those who did didn't have even the 80% of the conviction we have today.\nBTC is now…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "初めてビットコインの存在を知った時のことを覚えていますか？最初に何を考えましたか？\nどう思いましたか？\n偽のデジタルマネー、ネズミ講のようなスキーム？\nええ、ほとんどの人がそう思いました。だからこそ、実際に投資をした人は少ないし\n投資をした人でも、現在の80％の確信すら持てなかったのです。\nBTCは現在...",
      "title": "2009年に1ドル以下で購入したとしても、BTCを保有していなかったでしょうし、心の底ではそう思っているはずです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你还记得你第一次听说比特币是什么时候吗？你的第一个想法是什么？\n想法？\n一些假的数字货币，庞氏骗局？\n是的，我们大多数人都这么想。这就是为什么我们中很少有人真正投资，即使是那些投资的人，也没有得到甚至更多的钱。\n即使是那些投资的人，也没有我们今天80%的信念。\nBTC现在是...",
      "title": "即使你在2009年以低于1美元的价格买入，你也不会持有BTC，而且你内心深处也知道这一点!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你還記得你第一次聽說比特幣是什麼時候嗎？你的第一個想法是什麼？\n想法？\n一些假的數字貨幣，龐氏騙局？\n是的，我們大多數人都這麼想。這就是爲什麼我們中很少有人真正投資，即使是那些投資的人，也沒有得到甚至更多的錢。\n即使是那些投資的人，也沒有我們今天80%的信念。\nBTC現在是...",
      "title": "即使你在2009年以低於1美元的價格買入，你也不會持有BTC，而且你內心深處也知道這一點!"
    }
  ]
}