{
  "author": "Equivalent-Sweet-559",
  "original_created_utc": 1627908972,
  "title": "Are we missing out on Tezos?",
  "created_utc": 1627922442,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think Tezos is really undervalued. I’m new to all stuff about crypto but I can see they got potential. They are assured to have large gains and they have a lot of good projects. Even though they may not be bought in enough volume to make it reach the marketcap position right now, it is adopted at a fast pace and its developers are working hard to improve it even more.</p>\n\n<p>They have solid projects too, and just recently a <a href=\"https://twitter.com/TezosIsrael/status/1420838225636204548?s=20\">tweet</a> from Tezos Israel surfaced about them running a node and validating blocks in a Tesla car. With Tesla working with them, it is now geared up to power one of the most advanced blockchains, aiming to help secure the network while on the road.</p>\n\n<p>It is one of the best long term holds and they have blockchain upgrades consistently. Honestly, with the recent developments with them, I think people are not paying much attention to it when they’ve got so good tangible projects.</p>\n</div><!-- SC_ON -->",
  "score": 580,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/kvsLIi4c3YK683DyBfTatzNOATeVFSiWNlzoBQulscI.jpg?auto=webp&s=4392cd90721ab9cf3919d87a293c11c5713158fa",
          "width": 140,
          "height": 105
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/kvsLIi4c3YK683DyBfTatzNOATeVFSiWNlzoBQulscI.jpg?width=108&crop=smart&auto=webp&s=3cd4f5c9e18812c8f4b499e96d5d88ea946b91a3",
            "width": 108,
            "height": 81
          }
        ],
        "variants": {},
        "id": "2W3IaLseTjVdM8huGkW5tzBPMcU5u1VdGHky_-1EV4A"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/owdxjk/are_we_missing_out_on_tezos/",
  "subreddit": "CryptoCurrency",
  "id": "owdxjk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I think Tezos is really undervalued. I’m new to all stuff about crypto but I can\nsee they got potential. They are assured to have large gains and they have a lot\nof good projects. Even though they may not be bought in enough volume to make it\nreach the marketcap position right now, it is adopted at…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Tezosは本当に過小評価されていると思います。私は暗号に関するすべてのことに慣れていませんが、彼らが潜在的な可能性を持っていることはわかります。\n可能性を秘めていると思います。彼らは大きな利益を得ることが保証されていますし、多くの良いプロジェクトを持っています。\n良いプロジェクトがたくさんあります。今のところ、市場規模に達するほどの量は買われていないかもしれませんが\n今のマーケットキャップの位置に達するほどの量は買われていないかもしれませんが、それは採用されています。",
      "title": "Tezosを見逃していませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为Tezos的价值真的被低估了。我对所有关于加密货币的东西都很陌生，但我可以看到他们有潜力。\n看到他们有潜力。他们肯定会有很大的收益，他们有很多\n好的项目。尽管他们可能没有足够的购买量来使其\n达到现在的市值位置，但它是在...",
      "title": "我们是否错过了Tezos？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲Tezos的價值真的被低估了。我對所有關於加密貨幣的東西都很陌生，但我可以看到他們有潛力。\n看到他們有潛力。他們肯定會有很大的收益，他們有很多\n好的項目。儘管他們可能沒有足夠的購買量來使其\n達到現在的市值位置，但它是在...",
      "title": "我們是否錯過了Tezos？"
    }
  ]
}