{
  "author": "BewareTheGiant",
  "original_created_utc": 1643731452,
  "title": "A tweet has been circulating claiming the USSR capped rent at 4% of the worker's salary. Is there any credence to this claim?",
  "created_utc": 1643747542,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In a few subreddits a screenshot has been posted saying that rents were capped at 4% of salary. This is generally used to contrast with rent costs in present-day United States and other nations of the so-called &amp;quot;Western Block&amp;quot;. While I can&amp;#39;t find the original tweet, several others have made this claim with this same figure (an example here from the Dublin chapter of the Communist Party of Ireland: &lt;a href=\"https://twitter.com/dublincpi/status/1223163308485873669?t=xQCLdz8E4SLrzUGCgb512w&amp;amp;s=19\"&gt;https://twitter.com/dublincpi/status/1223163308485873669?t=xQCLdz8E4SLrzUGCgb512w&amp;amp;s=19&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;My question is: where does the figure come from? Does it hold up in any sense? What is being left unsaid by boiling the issue down to that one number? How do we properly compare access to housing in the USSR and the US (or other &amp;quot;capitalist&amp;quot; countries)?&lt;/p&gt;\n\n&lt;p&gt;I want to thank this great community, and apologize in case this has already been asked/answered. I tried searching the FAQs and Reddit history and didn&amp;#39;t find anything.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/shyfjq/a_tweet_has_been_circulating_claiming_the_ussr/",
  "subreddit": "AskHistorians",
  "id": "shyfjq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In a few subreddits a screenshot has been posted saying that rents were capped\nat 4% of salary. This is generally used to contrast with rent costs in\npresent-day United States and other nations of the so-called \"Western Block\".\nWhile I can't find the original tweet, several others have made this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いくつかのsubredditsでは、家賃の上限が設定されたというスクリーンショットが投稿されています。\n給与の4％である。これは、一般的に家賃の相場と対比させるために使われます。\n現在の米国をはじめとするいわゆる「西側ブロック」の国々。\n元のツイートは見つからないものの、他の何人かの人がこの...",
      "title": "ソ連では家賃の上限が労働者の給料の4％だったとするツイートが出回っている。信憑性はあるのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在一些分论坛上，有人贴出一张截图，说租金的上限是\n为工资的4%。这通常被用来与当今美国和其他所谓的\"\"国家的房租成本进行对比。\n今天的美国和其他所谓的 \"西方集团 \"国家的房租成本。\n虽然我找不到原始推文，但其他几个人已经把这个...",
      "title": "有一条推特流传，声称苏联将房租的上限定为工人工资的4%。这种说法有什么可信度吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在一些分論壇上，有人貼出一張截圖，說租金的上限是\n爲工資的4%。這通常被用來與當今美國和其他所謂的\"\"國家的房租成本進行對比。\n今天的美國和其他所謂的 \"西方集團 \"國家的房租成本。\n雖然我找不到原始推文，但其他幾個人已經把這個...",
      "title": "有一條推特流傳，聲稱蘇聯將房租的上限定爲工人工資的4%。這種說法有什麼可信度嗎？"
    }
  ]
}