{
  "author": "BewareTheGiant",
  "original_created_utc": 1643731452,
  "title": "A tweet has been circulating claiming the USSR capped rent at 4% of the worker's salary. Is there any credence to this claim?",
  "created_utc": 1643747542,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In a few subreddits a screenshot has been posted saying that rents were capped at 4% of salary. This is generally used to contrast with rent costs in present-day United States and other nations of the so-called &amp;quot;Western Block&amp;quot;. While I can&amp;#39;t find the original tweet, several others have made this claim with this same figure (an example here from the Dublin chapter of the Communist Party of Ireland: &lt;a href=\"https://twitter.com/dublincpi/status/1223163308485873669?t=xQCLdz8E4SLrzUGCgb512w&amp;amp;s=19\"&gt;https://twitter.com/dublincpi/status/1223163308485873669?t=xQCLdz8E4SLrzUGCgb512w&amp;amp;s=19&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;My question is: where does the figure come from? Does it hold up in any sense? What is being left unsaid by boiling the issue down to that one number? How do we properly compare access to housing in the USSR and the US (or other &amp;quot;capitalist&amp;quot; countries)?&lt;/p&gt;\n\n&lt;p&gt;I want to thank this great community, and apologize in case this has already been asked/answered. I tried searching the FAQs and Reddit history and didn&amp;#39;t find anything.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/shyfjq/a_tweet_has_been_circulating_claiming_the_ussr/",
  "subreddit": "AskHistorians",
  "id": "shyfjq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In a few subreddits a screenshot has been posted saying that rents were capped\nat 4% of salary. This is generally used to contrast with rent costs in\npresent-day United States and other nations of the so-called \"Western Block\".\nWhile I can't find the original tweet, several others have made this…"
}