{
  "author": "emshanu",
  "original_created_utc": 1637563011,
  "title": "Who else is DCAing for their children and families?",
  "created_utc": 1637574116,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A year ago I joined Reddit to learn a bit more about cryptocurrencies. I was pretty clueless to begin with but I started delving into the posts and comments of this sub, I read the BTC white paper, and it wasn’t long before I bought some BTC. I remember how excited I was!</p>\n\n<p>I kept following this sub and over the next months I learned about blockchain technology, DeFi, NFTs…  I also bought ETH, ADA, AMP and more recently ALGO with just as much excitement as that first time I bought BTC! I learned to DCA, to buy the dips, to hodl and to ride the market waves. Heck, it was thanks to this sub that I even had my first FOMO moment a few weeks ago and bought some LRC!</p>\n\n<p>But what brings me the most joy one year on is that I’ve now bought a hardware wallet and some crypto for each of my newborn twins. It’s the BEST thing I can do for them with all that I’ve learned over the last few months. I’m sharing it with you all because the typical reaction I get when I tell people in my life is “Oh but you’ve opened a bank account for them too, right?”. </p>\n\n<p>I plan to buy them a bit more crypto every year on their birthdays, to educate them about it and give them their wallets when they’re 16 or so… I hope they’ll think it’s cool that their Mum did this for them!</p>\n\n<p>So I’d love to know who else is doing something similar? Have you bought crypto for your children, siblings, nephews, nieces, grandchildren? Or maybe for your cats and dogs? (Obvs not including hamsters because we all know they DYOR).</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/qzf4hd/who_else_is_dcaing_for_their_children_and_families/",
  "subreddit": "CryptoCurrency",
  "id": "qzf4hd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A year ago I joined Reddit to learn a bit more about cryptocurrencies. I was\npretty clueless to begin with but I started delving into the posts and comments\nof this sub, I read the BTC white paper, and it wasn’t long before I bought some\nBTC. I remember how excited I was!\n\nI kept following this sub…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1年前、私は暗号通貨についてもう少し学びたいと思い、Redditに参加しました。私は\n最初はかなり無知だったのですが、このサブの投稿やコメントを掘り下げていくうちに\nBTCのホワイトペーパーを読み、すぐにBTCを購入しました。\nBTCを購入しました。とても興奮したのを覚えています。\n\n私はこのサブを追い続けました...。",
      "title": "子どもや家族のためにDCAを実践している人は他にいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一年前，我加入Reddit，想多了解一些加密货币。我一开始是\n但我开始深入研究这个子的帖子和评论。\n我阅读了BTC白皮书，没过多久我就买了一些\nBTC。我还记得我当时有多兴奋\n\n我一直在关注这个子...",
      "title": "还有谁在为他们的孩子和家庭进行DCA？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一年前，我加入Reddit，想多瞭解一些加密貨幣。我一開始是\n但我開始深入研究這個子的帖子和評論。\n我閱讀了BTC白皮書，沒過多久我就買了一些\nBTC。我還記得我當時有多興奮\n\n我一直在關注這個子...",
      "title": "還有誰在爲他們的孩子和家庭進行DCA？"
    }
  ]
}