{
  "author": "Stewe304",
  "the_new_excerpt": "So.. I'm a bit embarrased to write this, but if it prevents a single person from\nnot losing money, it's worth it. Here goes.\n\nI'm a student who had a bit of spare money which just kept sitting and\ndepreciating on my savings account. I don't really need that money and it isn't\nanything lifechanging…",
  "original_created_utc": 1614325787,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我有点不好意思写这个，但如果它能阻止一个人从...\n不赔钱，值得。下面就说说吧。\n\n我是一个学生，我有一点闲钱，这钱就一直放着，并\n在我的储蓄账户上贬值。我并不真的需要那笔钱，而且它也不是。\n任何改变生活的事情...",
      "title": "不要做杠杆交易。求你了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我有點不好意思寫這個，但如果它能阻止一個人從...\n不賠錢，值得。下面就說說吧。\n\n我是一個學生，我有一點閒錢，這錢就一直放着，並\n在我的儲蓄賬戶上貶值。我並不真的需要那筆錢，而且它也不是。\n任何改變生活的事情...",
      "title": "不要做槓桿交易。求你了"
    }
  ],
  "title": "Don't leverage trade. Please.",
  "created_utc": 1614343849,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So.. I&#39;m a bit embarrased to write this, but if it prevents a single person from not losing money, it&#39;s worth it. Here goes.</p>\n\n<p>I&#39;m a student who had a bit of spare money which just kept sitting and depreciating on my savings account. I don&#39;t really need that money and it isn&#39;t anything lifechanging (I couldn&#39;t even buy a car with it), so I decided to go all-in in crypto. I picked DOT for sensible risk-reward ratio. Things have been going great, when DOT peaked I doubled my money. I wanted to sell something to buy a new laptop at that point but my DOT was locked in staking and, more impornantly, I had a huge exam coming.</p>\n\n<p>When things were crashing for a few days I finally decided to unstake a third of my holdings - unstaking period on Binance is 2 days, my 60 DOTs arrived yesterday. After I passed (hooray!) the exam, I was really exctasic, and so was crypto, for that matter. I was convinced BTC was now safely above 50K USD. I hade prior experience with leverage trading, It always went like this: <strong>made money -&gt; got greedy -&gt; increased leverage -&gt; lost everything.</strong> Total amount lost is like 150 USD - so nothing terrible - but my potential profits (if a pulled the trigger) were in 1-2K USD area. That sucked but at least it wasn&#39;t my money.</p>\n\n<p>I didn&#39;t really like the idea of selling my DOT as I truly believe in it&#39;s future - but i found something called futures. Didn&#39;t realy understand it but aparantelly there is also a possibility to leverage trade with your tokens (instead of USD) as collateral. That sounded great, were finally recovering from the crash to 45K USD, why not make a bit of extra money?</p>\n\n<p>I started with 3x leverage, nothing crazy and plenty of cushioning if shit hits the fan. In a few hours I made profit made a profit of 10 DOT or 340 USD - that&#39;s crazy, I&#39;m from Europe and this is more than I made at my part time job for all of February! I was really pleased with myself, I passed the exam, my girlfriend came over and now this.</p>\n\n<p>This all happened after 4 sleepless nights, I was really nervous about that exam and couldn&#39;t sleep. Finally, I decided to go in bed - and my stupid ass opened another leveraged trade, after all, BTC was now stable, right? I woke up 9 hours later, BTC meanwhile dropped from 51 do 47K and my long trade lost value from 70 DOTs to 30. I could have swalloved it and cut my losses but I didn&#39;t, of course.</p>\n\n<p>In the next few hours I opened and closed many long/short trades with increesing leverage, just trying to save what lost. That didn&#39;t work. It never works - especially when greed and panic takes over. During the course of writing my post a lost last 12 DOT on overleveraged trade in the final attempt to break even. I didn&#39;t even care about it - despite 12 DOT being more than I make in a month.</p>\n\n<p>I&#39;m feeling like shit right now, called my girlfriend who is really awesome and managed to improve my mood a bit. Also I still have 2/3 of my DOT holdings, I&#39;m not in a loss - but my P/L is really close to 0 now. Decided to withdraw the rest from staking and will concider selling some of it if the market rises again. That said, I can&#39;t imagine how this possible feels when you loose your family savings or even take a loan to trade crypto.</p>\n\n<p>I guess the bottom line is this: <strong>Don&#39;t be greedy</strong>. It&#39;s not that hard to make more money out of it but you get in a never ending downvard spiral - always wanting more, more, more... Also, there are more important things in life than money - one of them is mental health. If you get severely depressed as a result of investing in crypto, it isn&#39;t worth it. I don&#39;t care what you say, it just isnt.</p>\n\n<p>I&#39;m sorry for a chaotic post but I really wanted to get it out of my self. Leverage trading is shit. Market will recover, your losses won&#39;t. Please, spread the FUD about leverage trading, I&#39;m going to go for a walk now. Also, I&#39;m sure there are far worse stories than mine - I&#39;d be happy to hear them if you got over it and want to further encourage people not to do this.</p>\n\n<p>Stay strong.</p>\n</div><!-- SC_ON -->",
  "score": 429,
  "permalink": "/r/CryptoCurrency/comments/lssskt/dont_leverage_trade_please/",
  "subreddit": "CryptoCurrency",
  "id": "lssskt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937735126
}