{
  "author": "Efologonuh",
  "the_new_excerpt": "Congratulations, you did it! You HODL'd through bear markets, DCA'd into your\nfavorite projects, even put in a little extra during dips and crashes, and now\nyou're rich.\n\nBut wait, you live in a country where you pay taxes on your crypto trades and\nsales. You'll hardly be rich after taxes, and why…",
  "original_created_utc": 1621542656,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "おめでとうございます、やりましたね。あなたは弱気な市場をHODLし、お気に入りのプロジェクトにDCAして\nお気に入りのプロジェクトに参加し、ディップやクラッシュ時には少し余分に投資して、今ではお金持ちです。\nそして今、あなたはお金持ちです。\n\nしかし待ってください、あなたは暗号取引と販売に税金を払う国に住んでいます。\n販売しています。税金を払ってもお金持ちにはなれませんし、なぜ...。",
      "title": "税務署が減税を要求したら、どうする？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "祝贺你，你做到了！你在熊市中的表现很好。你通过熊市进行了HODL，DCA进入了你喜欢的项目\n喜爱的项目，甚至在下跌和暴跌时多投了一点，而现在\n你已经发财了。\n\n但是，等等，你生活在一个要为你的加密货币交易和销售缴税的国家。\n销。税后你很难成为富人，为什么...",
      "title": "那么，税务人员想要他的那份，现在怎么办？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "祝賀你，你做到了！你在熊市中的表現很好。你通過熊市進行了HODL，DCA進入了你喜歡的項目\n喜愛的項目，甚至在下跌和暴跌時多投了一點，而現在\n你已經發財了。\n\n但是，等等，你生活在一個要爲你的加密貨幣交易和銷售繳稅的國家。\n銷。稅後你很難成爲富人，爲什麼...",
      "title": "那麼，稅務人員想要他的那份，現在怎麼辦？"
    }
  ],
  "title": "So the tax man wants his cut, now what?",
  "created_utc": 1621594061,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Congratulations, you did it! You HODL&#39;d through bear markets, DCA&#39;d into your favorite projects, even put in a little extra during dips and crashes, and now you&#39;re rich.</p>\n\n<p>But wait, you live in a country where you pay taxes on your crypto trades and sales. You&#39;ll hardly be rich after taxes, and why should the government take so much of <em>your</em> profits anyway? You&#39;re the one who watched charts, held when things got tough, and spent countless hours researching the best coins to maximize profits. You don&#39;t need nor want the tax man taking any of your hard earned money, so what do you do? How do you get around this?</p>\n\n<p><em>You don&#39;t.</em></p>\n\n<p>Pay your taxes.</p>\n\n<p>Don&#39;t be an idiot.</p>\n</div><!-- SC_ON -->",
  "score": 356,
  "permalink": "/r/CryptoCurrency/comments/nhaogg/so_the_tax_man_wants_his_cut_now_what/",
  "subreddit": "CryptoCurrency",
  "id": "nhaogg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197381662
}