{
  "author": "bigbear0083",
  "the_new_excerpt": "Good Sunday morning to all of you here on r/stocks [/r/stocks]. I hope everyone\non this sub made out pretty nicely in the market this past week, and is ready\nfor the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week\nbeginning February 22nd,…",
  "original_created_utc": 1613910452,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在r/stocks[/r/stocks]上，大家周日早上好。我希望大家\n在过去的一周里，这个子在市场上取得了相当不错的成绩，并且已经准备好了。\n为未来新的交易周。\n\n以下是你需要知道的一切，让你为本周的交易做好准备。\n2月22日开始，...",
      "title": "2021年2月22日开始的交易周华尔街一周前瞻"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在r/stocks[/r/stocks]上，大家週日早上好。我希望大家\n在過去的一週裏，這個子在市場上取得了相當不錯的成績，並且已經準備好了。\n爲未來新的交易周。\n\n以下是你需要知道的一切，讓你爲本週的交易做好準備。\n2月22日開始，...",
      "title": "2021年2月22日開始的交易周華爾街一週前瞻"
    }
  ],
  "title": "Wall Street Week Ahead for the trading week beginning February 22nd, 2021",
  "created_utc": 1613917484,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Good Sunday morning to all of you here on <a href=\"/r/stocks\">r/stocks</a>. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.</p>\n\n<p>Here is everything you need to know to get you ready for the trading week beginning February 22nd, 2021.</p>\n\n<h1><strong>Stronger economic data could power stocks that thrive in a rebound in the week ahead - <a href=\"https://www.cnbc.com/2021/02/19/stronger-economic-data-could-power-stocks-that-thrive-in-a-rebound-in-the-week-ahead.html\">(Source)</a></strong></h1>\n\n<hr/>\n\n<blockquote>\n<p>A decline in new Covid infections, along with improving economic data and stimulus hopes, could boost stocks that flourish in a resurging economy in the week ahead.</p>\n\n<hr/>\n\n<p>In the past week, expectations for a strong economic rebound helped boost interest rates.</p>\n\n<hr/>\n\n<p>While the broader stock market was choppy, sectors that do well in a rebound – financials, airlines and industrials – stood out as leaders. This is known as the reflation trade.</p>\n\n<hr/>\n\n<p>Those stocks gained at the expense of growth and technology, down 2%. Strategists expect that reflation trade to continue as signs suggest that the economy could make a sharp comeback.</p>\n\n<hr/>\n\n<p>The S&amp;P 500 was down 0.7% on the week to 3,906, while the Dow was up a tiny 0.1% at 31,494. The Nasdaq was off 1.57% for the week, to 13,874, with the decline in tech. Apple, for instance, gave up 4% on the week.</p>\n\n<hr/>\n\n<p>The big event in the week ahead is testimony from Federal Reserve Chairman Jerome Powell, who delivers his semi-annual testimony on the economy before the Senate Banking Committee on Tuesday and the House Financial Services Committee Wednesday.</p>\n\n<hr/>\n\n<p>He is expected to discuss the increase in interest rates, as well as concerns that inflation could begin to take off.</p>\n\n<hr/>\n\n<p>“He’s going to have to acknowledge that the data is improving and the virus situation is improving quite materially,” said Mark Cabana, head of U.S. rates strategy at Bank of America. “It is going to be hard for him to sound as dovish as he has been.”</p>\n\n<hr/>\n\n<p>But Powell is expected to continue to emphasize that the Fed will keep rates low for a long time and maintain its easy policies to help the economy.</p>\n\n<hr/>\n\n<h1>Improving forecasts</h1>\n\n<p>Economists this past week ratcheted up tracking forecasts for first quarter gross domestic product, fueled in part by an unexpectedly sharp jump of 5.3% in January retail sales.</p>\n\n<hr/>\n\n<p>Goldman upped first-quarter growth to 6%, and Morgan Stanley said it was tracking at 7.5% for the first quarter. Economists linked the surprise gain in retail sales to stimulus checks sent to individuals under the last $900 billion stimulus program approved by Congress in late December.</p>\n\n<hr/>\n\n<p>The Biden administration has proposed another $1.9 trillion Covid relief package. That could come before the House of Representatives in the coming week.</p>\n\n<hr/>\n\n<p>″[Powell’s] going to stick to the script. The script is lawmakers need to continue to provide support for the economy. He’s going to be supportive of the administration’s effort to get a big package through,” said Mark Zandi, chief economist at Moody’s Analytics.</p>\n\n<hr/>\n\n<h1>Key data during the week</h1>\n\n<p>Earnings continue to be important. There are more than 60 companies reporting, including Home Depot, Macy’s and TJX.</p>\n\n<hr/>\n\n<p>Key economic reports dropping next week include durable goods on Thursday, along with personal income and spending data on Friday</p>\n\n<hr/>\n\n<p>The Friday report includes the personal consumption expenditure price index, which the Fed monitors. The market is on the lookout for signs of rising inflation.</p>\n\n<hr/>\n\n<p>“I think the boom is going to start sooner than most people think,” said Ed Keon, chief investment strategist at QMA.</p>\n\n<hr/>\n\n<p>He said the stronger economy is helping drive Treasury yields higher, with the 10-year hitting a one-year high of 1.36% on Friday. Keon said the vaccine rollout is helping the outlook, as is the slowing spread of the virus.</p>\n\n<hr/>\n\n<p>“I think people were expecting a second-half boom, but I think the second quarter is going to be very strong, as people change their behavior,” he said.</p>\n\n<hr/>\n\n<p>“The caution when it comes to savings and not going out, that’s going to go away sooner than we think,” Keon said. “Right now, you might see a 10% GDP number in the second or third quarter. That’s also due to the fact we’re likely to get a big stimulus package.”</p>\n\n<hr/>\n\n<p>He said investors are underestimating the surge in economic activity that should start in March and pick up steam in the second and third quarter as more people resume dining out and other activities.</p>\n\n<hr/>\n\n<p>“I think the world is going to look very different than it has over the past 12 months. We’re still bullish. We’re still overweight stocks,” Keon said.</p>\n\n<hr/>\n\n<p>He said a flood of money could hit the economy.</p>\n\n<hr/>\n\n<p>“The size of the U.S. economy last year was about $21 trillion,” Keon added. “Households now have excess savings of about $1.5 trillion and the stimulus package probably will be in the vicinity of $1.2, $1.6 trillion.”</p>\n\n<hr/>\n\n<p>He said the service sector should start to see a benefit that has been lifting the goods making side of the economy. “You’re going to see an incredible boom.”</p>\n\n<hr/>\n</blockquote>\n\n<h1><strong>This past week saw the following moves in the S&amp;P:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/KHikwKA.png\">CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Indices for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/qGZEgZB.png\">CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Futures Markets as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/E5ZhAnt.png\">CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!</a>)</strong></h6>\n\n<h1><strong>Economic Calendar for the Week Ahead:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/TIhMYEf.png\">CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!</a>)</strong></h6>\n\n<h1><strong>Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/Y65lpFs.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for the Past Week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/EY3NC9X.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Pullback/Correction Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/wmMRYoi.png\">CLICK HERE FOR THE CHART!</a></strong></h6>\n\n<h1><strong>Major Indices Rally Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/VasEMj8.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Most Anticipated Earnings Releases for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/uT5kxuP.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Here are the upcoming IPO&#39;s for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/uOalt0h.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Friday&#39;s Stock Analyst Upgrades &amp; Downgrades:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/SMspx2i.png\">CLICK HERE FOR THE CHART LINK #1!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/RP7xVdo.png\">CLICK HERE FOR THE CHART LINK #2!</a>)</strong></h6>\n\n<hr/>\n\n<blockquote>\n<h1>Value Outperforming Growth But Only for Large Caps</h1>\n\n<p>While the S&amp;P 500 traded lower today, value stocks had a strong finish to the week. Starting with a look at dividend stocks, the iShares Select Dividend ETF (DVY) rose 1.35% today for its best day since January 6th when DVY rose nearly 4%. As shown below, DVY has recently been on a tear.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/02/021921-DVY.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Along with the dividend ETF (DVY), the iShares S&amp;P 500 Value ETF (IVE) rose 0.31%, reaching a new 52-week high intraday. That compares to the growth counterpart, the iShares S&amp;P 500 Growth ETF (IVW), which saw a bearish engulfing on its 0.65% decline. Today was the widest outperformance for value (IVE) over growth (IVW) since mid-January. As shown below, while both are still trending nicely higher long-term, the value ETF is at new highs while growth is closer to its 50-day moving average.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/02/021921-SP.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/02/021921-SP.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Value&#39;s outperformance today only applied to large caps, though. While small caps have fallen over the past several sessions, the Russell 2000 Growth ETF (IWO) and Russell 2000 Value ETF (IWN) both rebounded nicely today with identical gains of 2.08%. In the case of small-cap growth (IWO), the recent declines have been more severe meaning today&#39;s strong performance still leaves it further below its highs than small-cap value (IWN).</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/02/021921-R2K.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/02/021921-R2K.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Industrial Metals Shining Bright</h1>\n\n<p>While precious metals like gold have been facing their fair share of selling recently alongside rates, elsewhere in the metals markets, industrial metals have been surging. Year to date, industrial metals—as proxied by the Bloomberg Industrial Metals total return index—are up 11.43% while their precious metals counterpart is down by over 4%. With a fairly flat January, most of those gains have come from this month alone. As shown below, so far this month the Bloomberg Industrial Metals index has risen 11.41% for its strongest performance through the first 14 trading days of a month since September of 2012. Going back to the start of the index in early 1991, the only other months with stronger performance were March of 2008 (11.42) and April of 2006 (14.94).</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/02/021921-Metals-1.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Again, whereas industrial metals are flying, precious metals have been trending lower since the summer. In the chart below, we show the relative strength of the Bloomberg Industrial Metals index versus the precious metal counterpart index over the past five years. Times that the line is rising indicates outperformance of industrial metals and vice versa. Precious metals had been outperforming since mid-2018, but the relative strength line bottomed out back in August of last year. From then through the late fall, industrial metals outperformed, and after some consolidation from November through the end of January, industrials are once again outperforming in a big way.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/02/021921-Metals-3.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Delving deeper, tin, copper, and nickel have been leading in those gains. As shown in the charts below, both year to date and over the past year, these three metals have risen the most with tin in the number one spot in both respects.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/02/021921-Metals-2.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/02/021921-Metals-4a.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>One Year Later: 3 Lessons Learned Since the Market Peak</h1>\n\n<p>“Bulls make money, bears make money, and pigs get slaughtered.” Old Wall Street saying.</p>\n\n<p>Today marks one year since the market began to price in the effects that COVID-19 would have on the world. The old market adage “stairs up, elevator down” certainly rang true over the coming weeks, as the S&amp;P 500 recorded the fastest bear market (closing 20% below a previous all-time high) in history, accomplishing that feat in a mere 16 days.</p>\n\n<p>The stock market is a peculiar mechanism however, and despite the turmoil the world has experienced since the outbreak of the pandemic, the S&amp;P 500 marched forward to set new all-time highs less than 6 months later on August 18 and hasn’t looked back. So after such a wild year since the market peaked on this day in 2020, what have we learned?</p>\n\n<p><strong>1. Markets are forward looking.</strong> While it’s difficult to pin down a date when we can expect our lives to completely return to normal, the stock market is already pricing in the normalization of daily life, even if that remains uncertain. Economic conditions around the world have been improving relative to how they were at the beginning of the pandemic. While pockets of weakness remain, the market is more concerned with where the economic conditions will be, not where they are currently.</p>\n\n<p><strong>2. Sector performance is dynamic.</strong> Investing in “stay at home” themed growth and technology stocks whose earnings were viewed to be relatively well insulated by the effects of the pandemic and subsequent lockdowns provided both downside protection during the March volatility as well as outperformance after the market bottomed. However, as shown in the LPL Chart of the Day, conventional early-cycle leadership from financials and energy stocks has emerged over the past three months:</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/02/2.19.21-Blog-Chart-1.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p><strong>3. Remember your timeline.</strong> Everyone would love to be able to pull their money at the exact top, avoid all major market corrections and reinvest at the bottom, but unfortunately, there is no holy grail timing mechanism and market volatility is the cost of admission for stock investing. “It’s our jobs as investors to focus on our long-term goals,” noted LPL Financial Chief Market Strategist Ryan Detrick. “Drawdowns and bear markets are part of the path to get there, and limiting the latest shiny object from affecting our decisions is key to any investment strategy.” If an investor pulled their money from the market during last year’s volatility, there have been a plethora of reasons to be hesitant to reinvest it, and the subsequent bounce from the lows happened in a flash, meaning they may have bought back in at a higher price than they originally sold.</p>\n\n<p>Thankfully, bear markets and extreme volatility like we experienced last year are rare, but they provide a unique learning opportunity for investors. No one truly knows what the future holds for the stock market, so making sure we learn from the past is crucial for long-term success as investors. For more on our market and economic views, check out our most recent Global Portfolio Strategy publication.</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Stimulus Matters: Retail Sales Rebound Big in January</h1>\n\n<p>The US economy had a tumultuous year in 2020, to say the least, and after rebounding strongly in the third quarter, the holiday surge in COVID-19 cases increased the risk that the economy may stumble heading into the new year. The sharp increase in new COVID-19 cases led to additional curbs on activity to contain the virus, triggering a rise in weekly jobless claims, and many feared we might have a double-dip recession.</p>\n\n<p>Sensing a need to act, Congress passed a fifth relief bill at the end of December, including additional direct payments to households. The lame-duck injection of fiscal stimulus to the US economy was just what it needed. Following a weak retail sales number in December—ordinarily one of the strongest months for retail sales—consumer spending rebounded firmly in January, rising 5.3% month over month according to the US Census Bureau—the most in seven months—and greater than all of the estimates in the Bloomberg economist survey.</p>\n\n<p>Looking under the hood makes the headline number even more remarkable. As shown in the LPL Chart of the Day, the largest month over month increases came in categories associated with discretionary spending, including a 23.5% surge in spending at department stores:</p>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/02/Blog-2.18.21.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>“Fiscal stimulus was just what the doctor ordered for the US consumer in January,” added LPL Financial Chief Market Strategist Ryan Detrick. “The boom in spending on discretionary categories could become a trend if a wave of pent-up demand gets unleashed on the economy in 2021.”</p>\n\n<p>Clearly, direct payments to households had a major effect on January’s retail sales, so does this mean that February sales will disappoint? Not exactly. Direct payments to households totaled roughly $166 billion, but the increase in January sales was only $29 billion and the savings rate remains high. Of course, not all of that money was spent on retail items, but there may be some gas left in the tank for February retail sales, particularly by individuals who didn’t receive their payments until later in the month or who will be receiving a credit on their federal tax returns.</p>\n\n<p>Earlier this month, we raised our gross domestic product (GDP) forecast for the US from 4–4.5% to 5–5.5%. Yesterday’s retail sales number puts us on a solid path toward achieving that target—and may even raise the prospects of exceeding it. The first quarter of 2021 is expected to be the weakest of the year, so the January surge in retail sales removes much of the risk of the US economy stumbling out of the gates as we begin 2021.</p>\n\n<p>However, a strong start to the year may embolden the call for a smaller price tag for President Biden’s fiscal stimulus proposal. Despite this, we ultimately believe a stimulus package north of $1 trillion is likely, which should prime the US economy for continued growth in 2021 as the battle against COVID-19 improves.</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Tech Leading in New Highs</h1>\n\n<p>The S&amp;P 500 has been reversing from its record highs over the past couple of sessions, but on an individual stock basis there are still a large number of names that have reached new 52-week highs. As shown in the charts from our Daily Sector Snapshot below, through yesterday&#39;s close, a net percentage of just over 15% of the S&amp;P 500 reached new 52-week highs. That is the strongest reading in new highs since January 12th. Outside of several days at the start of 2021, the only other days of the pandemic era with as high if not higher readings were September 2nd, October 9th, and November 9th. Most of the sectors are also seeing their number of new highs rise to strong levels. In addition to the S&amp;P 500, yesterday&#39;s reading for Communication Services, Financials, Materials, and Tech all were in the top decile of all days since at least 1990. In the case of Materials, while new highs have been trending higher and yesterday&#39;s reading was historically strong, it was still well off the record highs from earlier this year.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/02/021721-NNH.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>On the other hand, perhaps the most impressive sector in terms of net new highs has been Technology. Yesterday, 35.53% of the sector&#39;s stocks reached a new 52-week high. Not only is that the highest reading with respect to the other sectors, but that high reading also stands in the top 0.5% of all days for the sector since at least 1990. In other words, there have only been 38 other days since 1990 that the Tech sector saw as strong of a reading in net new highs as yesterday. The most recent of those was November 9th when 43.84% of the sector touched a new 52-week high. Overall, in the context of more broadly positive breadth with strong readings in new highs for other sectors, Tech&#39;s large number of new highs is an added plus for the broader market given the massive 28.08% weight of the sector.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/02/021721-NNH-Tech.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Small Cap Growth Taking the Lead</h1>\n\n<p>One of the topics we covered in last Friday&#39;s Bespoke Report was the outperformance of small caps over the past year. Even on a much shorter time horizon, that outperformance has been evident. As shown in the snapshot of our Trend Analyzer below, in the five days ending last Friday and on a year to date basis, both Small Cap Growth (IJR) and Small Cap Value (IJS) have been two of the top-performing ETFs in our US Styles screen while large-cap counterparts have also been higher but with more modest gains. With a particular focus on growth stocks, while the S&amp;P SmallCap 600 Growth (IJT) ETF was up the most of these ETFs last week with a 3.96% gain, the S&amp;P 500 Growth ETF (IVW) was the second-worst performer after &#39;only&#39; rising 1.05%. That continued a trend that has been in place YTD with the performance spread between the two ETFs topping ten percentage points.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/02/021621-TA.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>We are coming up on the one-year anniversary of the last highs on February 19th, 2020 just before the COVID crash. For most of the past year since then, large-cap growth (IVW) had actually been outperforming small-cap growth (IJT), but since the new year began, small-cap growth has jumped ahead. Now, the S&amp;P Small Cap Growth ETF (IJT) is up 35.31% since the 2/19/20 high compared to a 28.16% gain for the S&amp;P 500 Growth ETF (IVW). As shown in the second chart below, IJT had been catching up on IVW for some time now though. The relative strength line of IJT versus IVW had been in a downtrend for most of the past five years meaning large-cap growth had been generally outperforming the small-cap counterpart. Since the lows last March, the line trended sideways meaning neither one saw significant outperformance, but come the fall, the line has taken off in favor of small caps. With more outperformance in the past week and a half, that line has turned sharply higher once again reaching the highest level since December of 2019 last week.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/02/021621-Small-vs-large-2a.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Is A/D Line Signally Late-February Weakness?</h1>\n\n<p>Back on January 21 in our February Almanac post our Market Probability Chart highlighted the pattern of late-February seasonal weakness. A disappointing jobless claims number today appears to be the straw the sent the market lower. In this chart of the NASDAQ 100 Index (NDX) I have overlaid the NASDAQ Composite Advance/Decline Line. The NASDAQ A/D Line peaked and flattened out about six trading days ago and is now heading lower.</p>\n\n<p>This coincides with the seasonal pattern of late-February weakness. However, we expect recent support to hold above 13,000. Should that level be breached major support exists around the old September doji high of 12,240. Considering how far the market has come in the face of some formidable economic and pandemic obstacles and how frothy sentiment had become, a little consolidation and pullback is to be expected.</p>\n\n<p>We may see some further weakness into month-end and into March, but with vaccine rollout gaining some traction, more stimulus likely and a supportive Fed we do not expect any major selloff at this juncture.</p>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/e5f4b2427b7d5d4b28aae29e57eecf9b/74d4cbea052ab1c5-33/s500x750/45f747ae1ae952b17ebfa05517216899ec4f49ae.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<h6><strong>(<a href=\"https://i.imgur.com/uT5kxuP.png\">CLICK HERE FOR NEXT WEEK&#39;S MOST NOTABLE EARNINGS RELEASES!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/jtxCols.png\">CLICK HERE FOR NEXT WEEK&#39;S HIGHEST VOLATILITY EARNINGS RELEASES!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/b6PPTlQ.jpg\">CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE MONDAY&#39;S MARKET OPEN!</a>)</strong></h6>\n\n<hr/>\n\n<p>Below are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:</p>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Monday 2.22.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/EcVeV4l.png\">CLICK HERE FOR MONDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Monday 2.22.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/Iz5xLzt.png\">CLICK HERE FOR MONDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Tuesday  2.23.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/4p4q8a9.png\">CLICK HERE FOR TUESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Tuesday 2.23.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/EgzN86P.png\">CLICK HERE FOR TUESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/ODRTBoH.png\">CLICK HERE FOR TUESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Wednesday 2.24.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/3udXvVZ.png\">CLICK HERE FOR WEDNESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/sMcEWeM.png\">CLICK HERE FOR WEDNESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!</a>)</h6>\n\n<h1><strong><em>Wednesday 2.24.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/EHTrDMd.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/bzVMSxO.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/79N1qSy.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Thursday 2.25.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/WwOgLCj.png\">CLICK HERE FOR THURSDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/wZD3pAb.png\">CLICK HERE FOR THURSDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!</a>)</h6>\n\n<h1><strong><em>Thursday 2.25.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/FztoNlM.png\">CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/MuAL2DJ.png\">CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/gkCoskC.png\">CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 2.26.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/UCHvMLo.png\">CLICK HERE FOR FRIDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 2.26.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/To6WCZh.png\">CLICK HERE FOR FRIDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<p>(NONE.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>NVIDIA Corp. $597.06</h1>\n\n<p><strong>NVIDIA Corp. (NVDA)</strong> is confirmed to report earnings at approximately 4:20 PM ET on Wednesday, February 24, 2021. The consensus earnings estimate is $2.80 per share on revenue of $4.83 billion and the Earnings Whisper ® number is $3.26 per share. Investor sentiment going into the company&#39;s earnings release has 84% expecting an earnings beat The company&#39;s guidance was for earnings of $2.63 to $2.95 per share. Consensus estimates are for year-over-year earnings growth of 50.54% with revenue increasing by 55.56%. Short interest has increased by 9.0% since the company&#39;s last earnings release while the stock has drifted higher by 13.0% from its open following the earnings release to be 25.0% above its 200 day moving average of $477.72. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Monday, February 8, 2021 there was some notable buying of 5,340 contracts of the $580.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 6.7% move on earnings and the stock has averaged a 3.3% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=NVDA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Square, Inc. $276.57</h1>\n\n<p><strong>Square, Inc. (SQ)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, February 23, 2021. The consensus earnings estimate is $0.24 per share on revenue of $3.10 billion and the Earnings Whisper ® number is $0.34 per share. Investor sentiment going into the company&#39;s earnings release has 82% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 4.00% with revenue increasing by 136.02%. Short interest has increased by 11.3% since the company&#39;s last earnings release while the stock has drifted higher by 49.3% from its open following the earnings release to be 69.5% above its 200 day moving average of $163.16. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Thursday, February 4, 2021 there was some notable buying of 8,562 contracts of the $260.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 9.5% move on earnings and the stock has averaged a 8.7% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=SQ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Moderna, Inc., $174.74</h1>\n\n<p><strong>Moderna, Inc., (MRNA)</strong> is confirmed to report earnings at approximately 7:00 AM ET on Thursday, February 25, 2021. The consensus estimate is for a loss of $0.25 per share on revenue of $326.58 million and the Earnings Whisper ® number is ($0.17) per share. Investor sentiment going into the company&#39;s earnings release has 75% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 32.43% with revenue increasing by 2,223.59%. Short interest has decreased by 26.9% since the company&#39;s last earnings release while the stock has drifted higher by 155.7% from its open following the earnings release to be 91.8% above its 200 day moving average of $91.12. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Thursday, February 4, 2021 there was some notable buying of 3,120 contracts of the $190.00 call expiring on Friday, April 16, 2021. Option traders are pricing in a 10.0% move on earnings and the stock has averaged a 8.7% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=MRNA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Plug Power, Inc. $55.89</h1>\n\n<p><strong>Plug Power, Inc. (PLUG)</strong> is confirmed to report earnings at approximately 7:00 AM ET on Thursday, February 25, 2021. The consensus estimate is for a loss of $0.07 per share on revenue of $83.34 million and the Earnings Whisper ® number is ($0.09) per share. Investor sentiment going into the company&#39;s earnings release has 65% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 16.67% with revenue decreasing by 9.08%. Short interest has decreased by 42.8% since the company&#39;s last earnings release while the stock has drifted higher by 187.4% from its open following the earnings release to be 159.1% above its 200 day moving average of $21.57. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Monday, February 8, 2021 there was some notable buying of 10,007 contracts of the $30.00 call and 10,000 contracts of the $27.00 put expiring on Friday, January 20, 2023. Option traders are pricing in a 13.6% move on earnings and the stock has averaged a 6.6% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=PLUG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Salesforce $246.56</h1>\n\n<p><strong>Salesforce (CRM)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Thursday, February 25, 2021. The consensus earnings estimate is $0.74 per share on revenue of $5.68 billion and the Earnings Whisper ® number is $0.81 per share. Investor sentiment going into the company&#39;s earnings release has 81% expecting an earnings beat The company&#39;s guidance was for earnings of $0.73 to $0.74 per share. Consensus estimates are for year-over-year earnings growth of 42.31% with revenue increasing by 17.09%. Short interest has increased by 45.9% since the company&#39;s last earnings release while the stock has drifted higher by 9.3% from its open following the earnings release to be 12.4% above its 200 day moving average of $219.29. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Tuesday, February 16, 2021 there was some notable buying of 9,921 contracts of the $190.00 put expiring on Friday, March 19, 2021. Option traders are pricing in a 6.4% move on earnings and the stock has averaged a 7.5% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=CRM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>DraftKings Inc. $60.91</h1>\n\n<p><strong>DraftKings Inc. (DKNG)</strong> is confirmed to report earnings at approximately 7:00 AM ET on Friday, February 26, 2021. The consensus estimate is for a loss of $0.56 per share on revenue of $229.70 million and the Earnings Whisper ® number is ($0.55) per share. Investor sentiment going into the company&#39;s earnings release has 75% expecting an earnings beat. The stock has drifted higher by 34.2% from its open following the earnings release to be 40.4% above its 200 day moving average of $43.39. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Wednesday, February 17, 2021 there was some notable buying of 4,991 contracts of the $55.00 put expiring on Friday, February 26, 2021. Option traders are pricing in a 9.5% move on earnings and the stock has averaged a 8.4% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=DKNG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Home Depot, Inc. $279.64</h1>\n\n<p><strong>Home Depot, Inc. (HD)</strong> is confirmed to report earnings at approximately 6:00 AM ET on Tuesday, February 23, 2021. The consensus earnings estimate is $2.61 per share on revenue of $30.45 billion and the Earnings Whisper ® number is $2.74 per share. Investor sentiment going into the company&#39;s earnings release has 80% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 14.47% with revenue increasing by 18.11%. Short interest has increased by 39.1% since the company&#39;s last earnings release while the stock has drifted higher by 2.8% from its open following the earnings release to be 4.9% above its 200 day moving average of $266.45. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Wednesday, February 17, 2021 there was some notable buying of 2,578 contracts of the $290.00 call expiring on Friday, February 26, 2021. Option traders are pricing in a 4.0% move on earnings and the stock has averaged a 2.9% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=HD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Domino&#39;s Pizza, Inc. $371.46</h1>\n\n<p><strong>Domino&#39;s Pizza, Inc. (DPZ)</strong> is confirmed to report earnings at approximately 7:30 AM ET on Thursday, February 25, 2021. The consensus earnings estimate is $3.79 per share on revenue of $1.38 billion and the Earnings Whisper ® number is $3.85 per share. Investor sentiment going into the company&#39;s earnings release has 73% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 21.09% with revenue increasing by 19.96%. Short interest has increased by 43.8% since the company&#39;s last earnings release while the stock has drifted lower by 8.5% from its open following the earnings release to be 4.1% below its 200 day moving average of $387.16. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. Option traders are pricing in a 7.0% move on earnings and the stock has averaged a 8.5% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=DPZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Jumia Technologies AG $55.92</h1>\n\n<p><strong>Jumia Technologies AG (JMIA)</strong> is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, February 24, 2021. The consensus estimate is for a loss of $0.46 per share on revenue of $49.45 million. Investor sentiment going into the company&#39;s earnings release has 65% expecting an earnings beat. Short interest has decreased by 38.8% since the company&#39;s last earnings release while the stock has drifted higher by 326.9% from its open following the earnings release to be 163.7% above its 200 day moving average of $21.21. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Wednesday, February 17, 2021 there was some notable buying of 3,805 contracts of the $67.00 call expiring on Friday, February 26, 2021. Option traders are pricing in a 19.5% move on earnings and the stock has averaged a 19.5% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=JMIA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Overstock.com, Inc. $101.20</h1>\n\n<p><strong>Overstock.com, Inc. (OSTK)</strong> is confirmed to report earnings at approximately 8:00 AM ET on Wednesday, February 24, 2021. The consensus earnings estimate is $0.30 per share on revenue of $730.40 million and the Earnings Whisper ® number is $0.39 per share. Investor sentiment going into the company&#39;s earnings release has 79% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 141.10% with revenue increasing by 96.94%. Short interest has decreased by 2.7% since the company&#39;s last earnings release while the stock has drifted higher by 23.4% from its open following the earnings release to be 64.8% above its 200 day moving average of $61.43. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Tuesday, January 19, 2021 there was some notable buying of 1,557 contracts of the $50.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 16.3% move on earnings and the stock has averaged a 14.1% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=OSTK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<h1>DISCUSS!</h1>\n\n<p>What are you all watching for in this upcoming trading week?</p>\n\n<hr/>\n\n<p>I hope you all have a wonderful weekend and a great week ahead <a href=\"/r/stocks\">r/stocks</a>.</p>\n</div><!-- SC_ON -->",
  "score": 4305,
  "permalink": "/r/stocks/comments/low4ch/wall_street_week_ahead_for_the_trading_week/",
  "subreddit": "stocks",
  "id": "low4ch",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332885068
}