{
  "author": "shypooper69",
  "original_created_utc": 1629979189,
  "title": "It Is Estimated That 4 Million Bitcoins Have Been Lost, That is almost 20 percent of the Total BTC that will ever exist (21 million) . That's a huge number !! Let that sink in.",
  "created_utc": 1629996768,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>Re-upload because There was an AMP link in the last post and the bot didn&#39;t like it .</h1>\n\n<p>What would you do if you had a stash of Bitcoins that you could not access because you have lost the keys, damaged your hardware or sent it to a so-called burn address?</p>\n\n<p>Well, guess what? An estimated 4 million Bitcoins have been lost forever. The number is significant, considering that only 21 million BTCs will ever be mined. Experts believe that over 20 percent of the lost coins cannot be retrieved.</p>\n\n<p>Scary, right? How does something like this happen?</p>\n\n<p>The BTC blockchain is immutable and irreversible. This means that once a transaction is completed, it cannot be canceled or reverted. If you send your crypto assets to the wrong wallet, they are gone.</p>\n\n<p>The cryptography used to secure these coins has no empathy. It doesn’t care if you are on the verge of having a heart attack. If you do not use the correct key, you will not access the wallet. Maybe a quantum computer could crack a private key, but decades may pass before it happens. Besides, it may not be possible even with the next generation of computers because developers are already working on creating quantum-proof solutions.</p>\n\n<p>Another interesting story of lost BTC - In 2013, James Howells, who lives in Wales, threw out a hard drive with 7,500 bitcoins on it. When he realized how much the value of Bitcoin had shot up in recent years, he went looking for the drive. Now, he’s trying to get his local city council to allow him to excavate the landfill in an attempt to find the drive. He’s claiming to offer a portion of the proceeds if the city allows him to look through the trash.</p>\n\n<p><a href=\"https://imgur.com/a/2qvkolB\">Calculation Of Lost BTCs</a></p>\n\n<p>Study by - <a href=\"https://www.chainalysis.com/\">Chainalysis</a></p>\n\n<p>Ps - Please backup your Reddit vault atleast and write the recovery phrase somewhere !</p>\n</div><!-- SC_ON -->",
  "score": 276,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/slk0TBIVxRBaeQ_TyeXT-w1COi-I3MIQ08df8eWfvJY.jpg?auto=webp&s=b0b873276db7a0e71be2eb53bb5afdf6d7f66253",
          "width": 638,
          "height": 180
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/slk0TBIVxRBaeQ_TyeXT-w1COi-I3MIQ08df8eWfvJY.jpg?width=108&crop=smart&auto=webp&s=90db550a06d20c16e313ae4c25dcc0101288f523",
            "width": 108,
            "height": 30
          },
          {
            "url": "https://external-preview.redd.it/slk0TBIVxRBaeQ_TyeXT-w1COi-I3MIQ08df8eWfvJY.jpg?width=216&crop=smart&auto=webp&s=d841d86f53c4618857ed23358797d98265efb21e",
            "width": 216,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/slk0TBIVxRBaeQ_TyeXT-w1COi-I3MIQ08df8eWfvJY.jpg?width=320&crop=smart&auto=webp&s=3c7d9f2acc65bd2632a22befafabcfb8981d7331",
            "width": 320,
            "height": 90
          }
        ],
        "variants": {},
        "id": "R1mMrM9XslqM7KJbujdsBrYMKwvsNtAtDkMSiMadNE0"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/pby19p/it_is_estimated_that_4_million_bitcoins_have_been/",
  "subreddit": "CryptoCurrency",
  "id": "pby19p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "RE-UPLOAD BECAUSE THERE WAS AN AMP LINK IN THE LAST POST AND THE BOT DIDN'T LIKE\nIT .\n\nWhat would you do if you had a stash of Bitcoins that you could not access\nbecause you have lost the keys, damaged your hardware or sent it to a so-called\nburn address?\n\nWell, guess what? An estimated 4 million…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "前回の投稿にアンプのリンクがあったため、ボットが気に入らずに再アップロードしました。\nIT .\n\nもしあなたが、鍵をなくしてアクセスできないビットコインを隠し持っていたら、どうしますか？\nキーを紛失したり、ハードウェアを損傷したり、いわゆる「焼き捨てアドレス」に送ったためにアクセスできないビットコインを隠し持っていたらどうしますか？\nいわゆるバーンアドレスに送ってしまったからです。\n\nどうしますか？推定400万...",
      "title": "失われたビットコインは400万枚と推定され、これはこれまでに存在した全BTC（2100万枚）の約20％にあたります。これは非常に大きな数字です。これは非常に大きな数字です！このことを覚えておいてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "重新上传，因为上一篇文章中有一个放大器的链接，机器人不喜欢。\nIT.\n\n如果你有一个藏匿的比特币，但你无法进入，你会怎么做？\n因为你失去了钥匙，损坏了你的硬件，或者把它发送到一个所谓的\n烧毁的地址？\n\n那么，你猜怎么着？估计有400万...",
      "title": "据估计，有400万个比特币已经丢失，这几乎是永远存在的BTC总量（2100万）的20%。这是一个巨大的数字！! 让这个数字沉淀下来。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "重新上傳，因爲上一篇文章中有一個放大器的鏈接，機器人不喜歡。\nIT.\n\n如果你有一個藏匿的比特幣，但你無法進入，你會怎麼做？\n因爲你失去了鑰匙，損壞了你的硬件，或者把它發送到一個所謂的\n燒燬的地址？\n\n那麼，你猜怎麼着？估計有400萬...",
      "title": "據估計，有400萬個比特幣已經丟失，這幾乎是永遠存在的BTC總量（2100萬）的20%。這是一個巨大的數字！! 讓這個數字沉澱下來。"
    }
  ]
}