{
  "author": "WrathfulZach",
  "original_created_utc": 1625324786,
  "title": "Stellar Lumens are awesome, and almost too useful. Great for circumventing fund transfer delays on exchanges.",
  "created_utc": 1625361156,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello fellow crypto zealots. I have a personal observation on XLM. It is so useful for moving money between exchanges and wallets that I have a lot of trouble holding it. </p>\n\n<p>I first bought into XLM at around 10 cents, but was never able to hold it for long. It’s so fast and cheap to move it. </p>\n\n<p>For example, I use Coinbase pro to purchase assets and there is a waiting period from the time I deposit my fiat, to the time I can move my new assets to my wallet. When I purchase a coin I want to stake immediately like ATOM or ALGO, I just transfer an equal value of XLM from my wallet back to the exchange. This allows me to bypass the waiting period and start staking my new coins instantly. Then when my deposit clears, I just move it back for almost nothing, instantly. I’m sure a lot of you do this, but I felt like I discovered fire the first time i thought of this and wanted to share it. </p>\n\n<p>I am bullish on stellar and think it’s future is bright, even if it has been moving sideways for a bit. I still find it so useful that it is difficult for me to leave it alone.</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "permalink": "/r/CryptoCurrency/comments/oczs1l/stellar_lumens_are_awesome_and_almost_too_useful/",
  "subreddit": "CryptoCurrency",
  "id": "oczs1l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello fellow crypto zealots. I have a personal observation on XLM. It is so\nuseful for moving money between exchanges and wallets that I have a lot of\ntrouble holding it.\n\nI first bought into XLM at around 10 cents, but was never able to hold it for\nlong. It’s so fast and cheap to move it.\n\nFor…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、Crypto Zealotsの皆さん。私はXLMについて個人的な見解を持っています。これはとても\n取引所とウォレットの間でお金を移動するのに便利なので、私はこれを持っているのが大変です。\n持っているのが大変です。\n\n私は最初、10セント程度でXLMを購入しましたが、長く保有することはできませんでした。\n長く持つことはできませんでした。動かすのがとても速くて安いからです。\n\nそのため...",
      "title": "ステラルーメンはすごい！便利すぎるくらいです。取引所での資金移動の遅延を回避するのに最適です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "热衷于加密货币的朋友们，你们好。我对XLM有一个个人观察。它是如此\n它对于在交易所和钱包之间移动资金是如此有用，以至于我有很多\n困难。\n\n我第一次买入XLM是在10美分左右，但从未能够长期持有它。\n长时间。它的移动速度非常快，而且很便宜。\n\n对于...",
      "title": "Stellar Lumens非常棒，而且几乎太有用了。对规避交易所的资金转移延迟很有帮助。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "熱衷於加密貨幣的朋友們，你們好。我對XLM有一個個人觀察。它是如此\n它對於在交易所和錢包之間移動資金是如此有用，以至於我有很多\n困難。\n\n我第一次買入XLM是在10美分左右，但從未能夠長期持有它。\n長時間。它的移動速度非常快，而且很便宜。\n\n對於...",
      "title": "Stellar Lumens非常棒，而且幾乎太有用了。對規避交易所的資金轉移延遲很有幫助。"
    }
  ]
}