{
  "author": "TwistedFluke",
  "original_created_utc": 1635351669,
  "title": "What's a coin that was popular and had a lot of hype at one time, but now completely died down?",
  "created_utc": 1635363340,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I remember few years ago hanging with my friend who was showing me crypto. I saw a list of the most active crypto with BTC trading at around 2k I believe and ETH at 100. I was an idiot and told him how I wasn&#39;t sold on the world of crypto, but that was when I was a broke student and now I hold a good amount of crypto. The reason I ask this question is the top 100 was nothing like it was today. I remember him talking about Ripple like it was the next big play, but now no one talks about it.</p>\n\n<p>My question is more directed to coins that had an immense amount of hype behind it and now you rarely hear about it or simply it became a failed project. I believe this question is a good one for people to have an understanding of what to look for or how not all projects survive after a bit of time.</p>\n</div><!-- SC_ON -->",
  "score": 280,
  "permalink": "/r/CryptoCurrency/comments/qh0eku/whats_a_coin_that_was_popular_and_had_a_lot_of/",
  "subreddit": "CryptoCurrency",
  "id": "qh0eku",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I remember few years ago hanging with my friend who was showing me crypto. I saw\na list of the most active crypto with BTC trading at around 2k I believe and ETH\nat 100. I was an idiot and told him how I wasn't sold on the world of crypto,\nbut that was when I was a broke student and now I hold a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数年前、友人と一緒に暗号を見せてもらったのを覚えています。私が見たのは\n最も活発な暗号のリストを見たのですが、BTCは確か約2,000円、ETHは100円で取引されていました。\nは100ドルでした。私は馬鹿だったので、彼にいかに自分が暗号の世界で売れていないかを話しました。\nしかし、それは私が一文無しの学生だった時の話で、今では私が持っているのは・・・。",
      "title": "一時は人気があって大騒ぎになったが、今はすっかり衰退してしまったコインとは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我记得几年前，我和我的朋友在一起，他给我看加密货币。我看到\n我看到一个最活跃的加密货币列表，其中BTC的交易价格在2千左右，我相信ETH\n在100美元左右。我是个白痴，告诉他我并不看好加密货币的世界。\n但那是在我还是个没钱的学生的时候，现在我已经有了自己的财富。",
      "title": "什么是一度流行并有很多炒作的硬币，但现在完全消亡了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我記得幾年前，我和我的朋友在一起，他給我看加密貨幣。我看到\n我看到一個最活躍的加密貨幣列表，其中BTC的交易價格在2千左右，我相信ETH\n在100美元左右。我是個白癡，告訴他我並不看好加密貨幣的世界。\n但那是在我還是個沒錢的學生的時候，現在我已經有了自己的財富。",
      "title": "什麼是一度流行並有很多炒作的硬幣，但現在完全消亡了？"
    }
  ]
}