{
  "author": "Abhishekgarg0",
  "original_created_utc": 1642513381,
  "title": "The scammer who received the single largest payment of 26BTC has received a total of 87BTC.",
  "created_utc": 1642524847,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So recently a person fell prey to a Bitcoin doubling scam and sent the single largest payment of 26BTC to the scammer.&lt;/p&gt;\n\n&lt;p&gt;I found the scammers wallet address and found that the scammer has received a whooping total of 87 BTC(Worth a total of 3.6 mil).&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/zvt7kv9u2gc81.jpg?width=1280&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=989bf9aa6db66fbbc249eb9b94544d65cad4fdd8\"&gt;His bitcoin address has been reported on scam alert. &lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This person managed to earn 3.6mil dollars from a YouTube live video. This money is enough for someone to retire and live a happy life and falling for such a petty scam is stupidity at its finest. Now there is one very happy Nigerian prince out there. Doing almost nothing for a cool 3.6 million dollars.&lt;/p&gt;\n\n&lt;p&gt;I have decided to do research on tools that can be used to not fall for these scams. I will make a post on what these scams look like, what you can do to make other people aware and not fall for these yourself. It may not be perfect but I will try. I can use all the help I can get. There is no one out there who will double your money willingly.&lt;/p&gt;\n\n&lt;p&gt;Edit:- Thanks for the awards. I have made a promise and intend to keep it. If you guys have any suggestions please do DM me.&lt;/p&gt;\n\n&lt;p&gt;Edit 2:- Many of you don&amp;#39;t know how these scams work, &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/s1a7ft/can_someone_explain_to_me_how_people_fall_for/?utm_source=share&amp;amp;utm_medium=web2x&amp;amp;context=3\"&gt;so here is my old post attempting to explain it.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 1981,
  "permalink": "/r/CryptoCurrency/comments/s6xtxm/the_scammer_who_received_the_single_largest/",
  "subreddit": "CryptoCurrency",
  "id": "s6xtxm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So recently a person fell prey to a Bitcoin doubling scam and sent the single\nlargest payment of 26BTC to the scammer.\n\nI found the scammers wallet address and found that the scammer has received a\nwhooping total of 87 BTC(Worth a total of 3.6 mil).\n\nHis bitcoin address has been reported on scam…"
}