{
  "author": "NationalTeamFootball",
  "original_created_utc": 1637218835,
  "title": "Is it worth it to lose your virginity with the first best girl that comes along just to de-dramatize it?",
  "created_utc": 1637232992,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Read everything before replying.</p>\n\n<p>22M virgin here. I get enough looks and Tinder matches to know I&#39;m somewhat attractive. I had originally planned to do it with someone I was in a relationship, but I seem to struggle more in that regard. It&#39;s not so much the sex itself. I just wanna know what it&#39;s like, and if it ends up being terrible, so be it.</p>\n\n<p>My only concern is that I&#39;ll deeply regret it if I do it with a girl on Tinder, but at the same time I think it won&#39;t matter in the long run, even if I do it.</p>\n\n<p>What are your thoughts and what would you do?</p>\n</div><!-- SC_ON -->",
  "score": 119,
  "permalink": "/r/TooAfraidToAsk/comments/qwk2u2/is_it_worth_it_to_lose_your_virginity_with_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "qwk2u2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Read everything before replying.\n\n22M virgin here. I get enough looks and Tinder matches to know I'm somewhat\nattractive. I had originally planned to do it with someone I was in a\nrelationship, but I seem to struggle more in that regard. It's not so much the\nsex itself. I just wanna know what it's…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "すべて読んでから返信してください。\n\n22Mの童貞です。自分がある程度魅力的だということを知るために、十分な視線とTinderマッチを受けています。\n魅力的です。元々は付き合っている人とするつもりだったのですが\n本来は付き合っている人とするつもりでしたが、その点ではより苦労しているようです。というよりも\nセックスそのものではありません。ただ、それが何なのかを知りたい...。",
      "title": "脱ドラマ化のために、最初に来た最高の女の子と童貞を失うことに意味があるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在回复前请阅读所有内容。\n\n我是22岁的处男。我在Tinder上得到了足够多的目光和匹配，知道我是有一些\n吸引力。我原本打算和我有关系的人做，但我似乎在这方面更困难。\n但我似乎在这方面比较纠结。它不是那么多的\n性本身。我只是想知道它是什么...",
      "title": "与第一个出现的最好的女孩失去童贞，只是为了去掉戏剧性，这样做值得吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在回覆前請閱讀所有內容。\n\n我是22歲的處男。我在Tinder上得到了足夠多的目光和匹配，知道我是有一些\n吸引力。我原本打算和我有關係的人做，但我似乎在這方面更困難。\n但我似乎在這方面比較糾結。它不是那麼多的\n性本身。我只是想知道它是什麼...",
      "title": "與第一個出現的最好的女孩失去童貞，只是爲了去掉戲劇性，這樣做值得嗎？"
    }
  ]
}