{
  "author": "Khwarezm",
  "the_new_excerpt": "I was thinking about how much information can be gleaned from the city about\nfascinating elements of Roman life that would otherwise be lost to us,\neverything from food, to art, to city design, to graffiti. Are there comparable\nsites in other high profile ancient societies that managed to capture…",
  "original_created_utc": 1621553995,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ローマの魅力的な要素について、街からどれだけの情報が得られるかを考えていました。\nローマの生活の魅力的な要素について、街からどれだけ多くの情報が得られるかを考えました。\n食べ物、芸術、都市設計、落書きなど、あらゆるものです。他の有名な古代社会にも同じような\n他の有名な古代社会では、このような情報を得ることができるのでしょうか？",
      "title": "ポンペイの保存は、最盛期のローマ帝国を研究する考古学者や歴史学者にとって、まったくもって不運なことのように思えますが、中国やインド、中東などの他の古代文明にも同様の遺跡があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在想，从这个城市可以收集到多少关于罗马生活的信息\n迷人的罗马生活元素，否则我们就会失去这些信息。\n从食物，到艺术，到城市设计，到涂鸦。是否有类似的\n在其他高知名度的古代社会中，是否也有类似的遗址能够捕捉到...",
      "title": "对于考古学家和历史学家研究罗马帝国的鼎盛时期来说，庞贝城的保存似乎是一个绝对荒谬的运气，在中国、印度或中东等地，是否有其他古代文明的类似遗址？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在想，從這個城市可以收集到多少關於羅馬生活的信息\n迷人的羅馬生活元素，否則我們就會失去這些信息。\n從食物，到藝術，到城市設計，到塗鴉。是否有類似的\n在其他高知名度的古代社會中，是否也有類似的遺址能夠捕捉到...",
      "title": "對於考古學家和歷史學家研究羅馬帝國的鼎盛時期來說，龐貝城的保存似乎是一個絕對荒謬的運氣，在中國、印度或中東等地，是否有其他古代文明的類似遺址？"
    }
  ],
  "title": "The preservation of Pompeii seems like an absolutely absurd bit of luck for archaeologists and historians studying the Roman empire at its height, are there comparable sites for other Ancient civilizations in places like China, India or the Middle East?",
  "created_utc": 1621568953,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was thinking about how much information can be gleaned from the city about fascinating elements of Roman life that would otherwise be lost to us, everything from food, to art, to city design, to graffiti. Are there comparable sites in other high profile ancient societies that managed to capture such a snapshot in time due to unusual circumstances, like a pyroclastic flow?</p>\n</div><!-- SC_ON -->",
  "score": 148,
  "permalink": "/r/AskHistorians/comments/nhesq7/the_preservation_of_pompeii_seems_like_an/",
  "subreddit": "AskHistorians",
  "id": "nhesq7",
  "is_self": true,
  "media": null,
  "is_video": false
}