{
  "author": "No_Seesaw1134",
  "the_new_excerpt": "$AMH - Clear uptrend right into support and volume support, which is great. Just\nsurvived earnings it seems which is also good. 200EMA holding, all indicators\nare low as well.\n\n\n\n$APPF - Good support down here but we have a few days to wait it out and watch\nthough. Indicators all super low, and it…",
  "original_created_utc": 1614733980,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "$AMH - 明确的上升趋势，正好进入支撑和成交量支撑，这是伟大的。只是\n熬过了财报，看来这也是好事。200EMA持有，所有指标\n是低以及。\n\n\n\n$APPF - 这里有很好的支撑，但我们还有几天时间来等待，并观察。\n虽然。指标都超低，而且... ...",
      "title": "我的观察清单3/3/2021"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "$AMH - 明確的上升趨勢，正好進入支撐和成交量支撐，這是偉大的。只是\n熬過了財報，看來這也是好事。200EMA持有，所有指標\n是低以及。\n\n\n\n$APPF - 這裏有很好的支撐，但我們還有幾天時間來等待，並觀察。\n雖然。指標都超低，而且... ...",
      "title": "我的觀察清單3/3/2021"
    }
  ],
  "title": "My Watchlist For 3/3/2021",
  "created_utc": 1614777871,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>$AMH  - Clear uptrend right into support and volume support, which is great. Just survived earnings it seems which is also good. 200EMA holding, all indicators are low as well.</p>\n\n<p>&#x200B;</p>\n\n<p>$APPF - Good support down here but we have a few days to wait it out and watch though. Indicators all super low, and it is looking good but we need to see some type of life.</p>\n\n<p>&#x200B;</p>\n\n<p>$AWR  - Falling due to earnings as well, but we are right near support. Very low risk play here, all indicators are super low, it is looking prime.</p>\n\n<p>&#x200B;</p>\n\n<p>$COR  - Again, crashing right into support - so let&#39;s wait for some sign of life. Indicators are all low which is also good.</p>\n\n<p>&#x200B;</p>\n\n<p>$CTSO - Testing the 200EMA at old resistance, which is great. All indicators are all low as well which is good!</p>\n\n<p>&#x200B;</p>\n\n<p>$ERIE - This channel up is sexual. Earnings seems to have been survived, but 200EMA, support, and trend up here. Indicators all low looking good for a continuation.</p>\n\n<p>&#x200B;</p>\n\n<p>$HRTX - Great value, support, and 200EMA right above it so we should wait. Looking real tasty. Indicators are all low here.</p>\n\n<p>&#x200B;</p>\n\n<p>$IAA  - Support, trend up, and 200EMA are all right here holding it up. Indicators are low which is good too!</p>\n\n<p>&#x200B;</p>\n\n<p>$NI   - Great value on this descending triangle but it has fairly low reward, but super low risk. Indicators are low, but RSI is just fair.</p>\n\n<p>&#x200B;</p>\n\n<p>$RNG  - Bouncing off the 200EMA, support, and possible trend up here. Looking real good! Indicators are all low as well!</p>\n</div><!-- SC_ON -->",
  "score": 48,
  "permalink": "/r/stocks/comments/lwhkov/my_watchlist_for_332021/",
  "subreddit": "stocks",
  "id": "lwhkov",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937744946
}