{
  "author": "One_Molasses_8415",
  "original_created_utc": 1631744356,
  "title": "Crypto is cool and fun but MAKE SURE you are Taking care of your Mental Health.",
  "created_utc": 1631770365,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This post is a reminder to take care of your mental physical health, social life and career.  </p>\n\n<p>I‘m a Doctor and I studied, treated and experienced <strong>Addiction</strong>.\n(Weed, but overcame it, I can’t imagine those addicted to Coke or Heroin how do they manage..) </p>\n\n<hr/>\n\n<p><em>Medical Definition: Addiction:  A biopsychosocial disorder characterized by compulsive engagement in rewarding stimuli despite adverse consequences</em></p>\n\n<p><strong>Stage1</strong>: Experimentation. Very few people set out to become addicted. </p>\n\n<p><strong>Stage2</strong>: Regular Use &amp; Abuse. </p>\n\n<p><strong>Stage3</strong>: Dependency &amp; Tolerance. </p>\n\n<p><strong>Stage4</strong>: Addiction.</p>\n\n<p>Most of us started with minimal amounts when we started until we reached today snd we look at our portfolios and check the graphs, see a tweet, check reddit, go back to the charts, call our crypto-buddy discuss news, farm .. etc </p>\n\n<p>This all is huge and time consuming ! </p>\n\n<hr/>\n\n<p>1) How do you define an alcoholic from a a person who enjoys drinking alcohol normally? </p>\n\n<p>2) What’s the difference between a man who smokes weed for fun or someone who fails their exams because of being stoned the whole time? </p>\n\n<p>3) How do we diagnose a patient with depression vs. normal mood fluctuation in an individual? </p>\n\n<p>4) How do you differentiate between a person with an eating disorder or a person who cares about what they eat and how they look? </p>\n\n<p>The answer to all questions (1-4) is one :</p>\n\n<p><em>If the subject’s ordinary daily routines, social relations and career are disrupted then this is called a Disorder</em></p>\n\n<hr/>\n\n<p>I love this sub and made out many friends some of them are 30 years older ! But at the end, real life lies beyond your screen.</p>\n\n<p>If the Base of your Dominant Hand and Thumb on the phone hurts, it means you are overusing your phone. </p>\n\n<p>Look away from your phone every now and then, Bears and Bulls will come your way either you look or not. \nBuy your coins. \nClose your apps. </p>\n\n<p>Go out breathe some fresh air, sit by the river, See your parents while they’re still alive, no amount of money in the world will compensate their existence in your life…\nSee your friends, have a drink. </p>\n\n<p>Make sure your career isn’t damaged but your interest in Crypto, make sure you care about the people who care about you. \nI haven’t seen them in while, and I can’t wait to be able to see them again it hurts sometimes..</p>\n\n<p>Eat Healthy, Work out, Sleep enough hours. </p>\n\n<p>Healthy Body = Healthy Mind</p>\n\n<p>Healthy Mind = Healthy Body </p>\n\n<p>I hope everyone here is taking good care of themselves while DCAing &amp;amp;amp; HODLing !</p>\n\n<p>P.S.  Don’t take too much Hopium, there’s no antidote but I’m working on one.</p>\n\n<p>*Edit : Thank You so much for the Support, Love and Awards!</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/pp0dhr/crypto_is_cool_and_fun_but_make_sure_you_are/",
  "subreddit": "CryptoCurrency",
  "id": "pp0dhr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This post is a reminder to take care of your mental physical health, social life\nand career.\n\nI‘m a Doctor and I studied, treated and experienced Addiction. (Weed, but\novercame it, I can’t imagine those addicted to Coke or Heroin how do they\nmanage..)\n\n-----------------------------------------------…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この投稿は、自分の心と体の健康、社会生活を大切にするための注意喚起です。\nやキャリアを大切にするためのものです。\n\n私は医師であり、アディクションを研究し、治療し、経験しました。(マリファナですが\nコーラやヘロインの中毒者がどうやって管理しているのか想像できません。\n管理するのか...)\n\n-----------------------------------------------…",
      "title": "暗号はクールで楽しいものですが、自分の精神的な健康にも気を配るようにしましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这篇文章提醒我们要照顾好自己的心理身体健康、社交生活\n和事业。\n\n我是一名医生，我研究、治疗并经历过毒瘾。(大麻，但\n我无法想象那些对可乐或海洛因上瘾的人，他们是如何\n管理...)\n\n-----------------------------------------------…",
      "title": "加密货币很酷，很有趣，但请确保你照顾好自己的心理健康。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這篇文章提醒我們要照顧好自己的心理身體健康、社交生活\n和事業。\n\n我是一名醫生，我研究、治療並經歷過毒癮。(大麻，但\n我無法想象那些對可樂或海洛因上癮的人，他們是如何\n管理...)\n\n-----------------------------------------------…",
      "title": "加密貨幣很酷，很有趣，但請確保你照顧好自己的心理健康。"
    }
  ]
}