{
  "author": "No-Incident-2646",
  "original_created_utc": 1641484498,
  "title": "I just don’t understand the influencer culture?",
  "created_utc": 1641504493,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I guess this is a question…. As I’ve been traveling I’ve seen a lot of influencer stuff. More times than not they are rapid shooting pictures and then moving on. I was on top of a mountain in Lake Como watching the absolute most gorgeous sunset I’ve seen in my life. I look over and this girl and guy run over and start taking pictures like no tomorrow. Not once stopping to look at the sunset. I just don’t get how people spend their days doing this. Is it a hobby? I’m just very confused.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/TooAfraidToAsk/comments/rxhsad/i_just_dont_understand_the_influencer_culture/",
  "subreddit": "TooAfraidToAsk",
  "id": "rxhsad",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I guess this is a question…. As I’ve been traveling I’ve seen a lot of\ninfluencer stuff. More times than not they are rapid shooting pictures and then\nmoving on. I was on top of a mountain in Lake Como watching the absolute most\ngorgeous sunset I’ve seen in my life. I look over and this girl and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは質問なのでしょうが...。旅をしていると、多くのことを目にします。\nインフルエンサーのものです。写真を撮るのが早かったりすることが多く\n移動する。私はコモ湖の山の上で、最も素晴らしい光景を目にしました。\n今まで見たことのない豪華な夕焼け。ふと見ると、この女の子と...",
      "title": "インフルエンサー文化が理解できないんだけど？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想这是一个问题.... 随着我的旅行，我已经看到了很多\n影响者的东西。更多的时候，他们是快速拍摄照片，然后\n继续前进。我在科莫湖的一座山顶上观看了我所看到的绝对最\n绚丽的夕阳，这是我一生中见过的。我看过去，这个女孩和...",
      "title": "我只是不理解影响者文化？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想這是一個問題.... 隨着我的旅行，我已經看到了很多\n影響者的東西。更多的時候，他們是快速拍攝照片，然後\n繼續前進。我在科莫湖的一座山頂上觀看了我所看到的絕對最\n絢麗的夕陽，這是我一生中見過的。我看過去，這個女孩和...",
      "title": "我只是不理解影響者文化？"
    }
  ]
}