{
  "author": "Bluestuff11",
  "original_created_utc": 1624650977,
  "title": "Why do toddlers who fall over and slam their face on the ground sit up and look around with a calm expression on their face for a full 5 seconds before they freak out?",
  "created_utc": 1624700074,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I see this all the time. Toddlers will fall down and I swear they are totally fine and right when you think they are actually all good they burst into tears. It&#39;s like for 5 full seconds they are absolutely not experiencing pain or they are waiting for a reaction from parents or others before deciding how to feel about absolutely eating the sidewalk.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/o7v7ke/why_do_toddlers_who_fall_over_and_slam_their_face/",
  "subreddit": "NoStupidQuestions",
  "id": "o7v7ke",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I see this all the time. Toddlers will fall down and I swear they are totally\nfine and right when you think they are actually all good they burst into tears.\nIt's like for 5 full seconds they are absolutely not experiencing pain or they\nare waiting for a reaction from parents or others before…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "よく見かける光景ですね。幼児が転んでも、私は全く問題ないと思っています。\n本当に大丈夫だと思った瞬間に泣き出してしまう。\nまるで5秒間、痛みを感じていないか、反応を待っているかのようです。\n親や他の人の反応を待っているような...。",
      "title": "転倒して顔を地面に叩きつけた幼児が、パニックになるまでの間、なぜか5秒も座って穏やかな表情で周囲を見渡している。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我经常看到这种情况。幼儿会摔倒，我发誓他们完全没事。\n当你认为他们真的没事的时候，他们却突然哭了起来。\n这就像在整整5秒钟内，他们绝对没有经历过痛苦，或者他们\n他们在等待父母或其他人的反应，然后再...",
      "title": "为什么摔倒在地的幼儿会坐起来，带着平静的表情环顾四周，整整5秒钟后才抓狂？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我經常看到這種情況。幼兒會摔倒，我發誓他們完全沒事。\n當你認爲他們真的沒事的時候，他們卻突然哭了起來。\n這就像在整整5秒鐘內，他們絕對沒有經歷過痛苦，或者他們\n他們在等待父母或其他人的反應，然後再...",
      "title": "爲什麼摔倒在地的幼兒會坐起來，帶着平靜的表情環顧四周，整整5秒鐘後才抓狂？"
    }
  ]
}