{
  "author": "Qtredit",
  "original_created_utc": 1634379840,
  "title": "REMEMBER: DO NOT FOMO. This bull run is awesome but it can't go up forever.",
  "created_utc": 1634398866,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It is not always smart buying at every green day you see. There are cases of temporary increases and buying at the peak is the least profitable time. Although it is not possible to predict when the peak will be and when there will be a decline, it is worth stopping and thinking and not rushing and FOMOing.</p>\n\n<p>I bought at almost ATH in the previous giant bull run so I&#39;m just back to the break even point on some of my crypto.</p>\n\n<p>The real profits come when you buy low, not at ATH.</p>\n\n<p>Its not financial advice, but you really should stop and think even though there&#39;s a hype right now.</p>\n\n<p><strong>Edit: Just to clarify, I wish this bull run will continue till 100K BTC / 20K ETH or more, I&#39;m out of fiat so I only want this to go up.\nBut, I don&#39;t want people to make the same mistakes I have made.</strong></p>\n\n<p><strong>Edit2: Obviously the market will continue to rise, but there&#39;s no reason to buy at the highest point.\nYou better buy when BTC is 58K and not 61K, cause when it does reach 70K or 200K, you have made more profit.\nAnd after such a pump, the prices are likely to go down a bit, IMHO</strong></p>\n</div><!-- SC_ON -->",
  "score": 199,
  "permalink": "/r/CryptoCurrency/comments/q99czr/remember_do_not_fomo_this_bull_run_is_awesome_but/",
  "subreddit": "CryptoCurrency",
  "id": "q99czr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It is not always smart buying at every green day you see. There are cases of\ntemporary increases and buying at the peak is the least profitable time.\nAlthough it is not possible to predict when the peak will be and when there will\nbe a decline, it is worth stopping and thinking and not rushing and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "緑の日を見たら必ず買うのが賢い方法とは限りません。場合もあります。\n一時的に上昇する場合もあり、ピーク時に買うのは最も利益の少ない時期です。\nいつがピークでいつが下落かを予測することはできませんが、焦らずに立ち止まって考えてみる価値はあります。\n予測することはできませんが、焦らずに立ち止まって考える価値はあると思います。",
      "title": "REMEMBER DO NOT FOMO。このブルランは素晴らしいものですが、永遠に上がり続けることはできません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在你看到的每一个绿色的日子里，购买并不总是明智的。有一些情况是\n暂时性的增长，而在高峰期买入是最不赚钱的时候。\n虽然不可能预测什么时候是高峰，什么时候会出现下跌，但值得停下来思考，不要急于求成。\n但值得停下来思考，不要急于求成。",
      "title": "请记住。切勿畏首畏尾。这轮牛市行情很好，但它不可能永远涨下去。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在你看到的每一個綠色的日子裏，購買並不總是明智的。有一些情況是\n暫時性的增長，而在高峯期買入是最不賺錢的時候。\n雖然不可能預測什麼時候是高峯，什麼時候會出現下跌，但值得停下來思考，不要急於求成。\n但值得停下來思考，不要急於求成。",
      "title": "請記住。切勿畏首畏尾。這輪牛市行情很好，但它不可能永遠漲下去。"
    }
  ]
}