{
  "author": "slvbtc",
  "original_created_utc": 1649801084,
  "title": "The crypto transaction bill being pushed through by Cynthia Lummis makes bitcoin transactions less than $600 no longer subject to capital gains tax reporting in the US.",
  "created_utc": 1649831524,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If this bill passes think about how that will change behaviour. You can sell your btc in bulk through exchanges and pay CGT, or you can spend your bitcoin at mcdonalds and walmart when you go shopping and pay zero tax.&lt;/p&gt;\n\n&lt;p&gt;This is a pretty big deal. It will lead to a huge chunk of bitcoiners moving away from exchanges and just spending their btc whenever they need to.&lt;/p&gt;\n\n&lt;p&gt;This would change behaviour immensely by financially incentivising people to move away from treating bitcoin as an investment on an exchnage to actually spending it as money.&lt;/p&gt;\n\n&lt;p&gt;Big big deal for the US if this bill passes IMO.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 314,
  "permalink": "/r/Bitcoin/comments/u2aple/the_crypto_transaction_bill_being_pushed_through/",
  "subreddit": "Bitcoin",
  "id": "u2aple",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If this bill passes think about how that will change behaviour. You can sell\nyour btc in bulk through exchanges and pay CGT, or you can spend your bitcoin at\nmcdonalds and walmart when you go shopping and pay zero tax.\n\nThis is a pretty big deal. It will lead to a huge chunk of bitcoiners…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もしこの法案が通れば、行動がどう変わるか考えてみてください。あなたは\nビットコインを取引所で大量に購入し、CGTを支払うか、あるいはビットコインを\nマクドナルドやウォルマートで買い物をすると、税金がゼロになります。\n\nこれはかなり大きなことです。ビットコイナーの巨大な塊につながる...",
      "title": "Cynthia Lummisが推進している暗号取引法案では、600ドル未満のビットコイン取引は米国でのキャピタルゲイン税報告の対象外となりました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果这个法案通过，想想这将如何改变行为。你可以通过交易所出售\n你可以通过交易所大量出售你的比特币并支付CGT，或者你可以在购物时在\n麦当劳和沃尔玛购物，并支付零税。\n\n这是一个相当大的问题。它将导致一大批比特币用户...",
      "title": "辛西娅-卢米斯正在推动的加密货币交易法案使得低于600美元的比特币交易不再需要在美国进行资本利得税申报。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果這個法案通過，想想這將如何改變行爲。你可以通過交易所出售\n你可以通過交易所大量出售你的比特幣並支付CGT，或者你可以在購物時在\n麥當勞和沃爾瑪購物，並支付零稅。\n\n這是一個相當大的問題。它將導致一大批比特幣用戶...",
      "title": "辛西婭-盧米斯正在推動的加密貨幣交易法案使得低於600美元的比特幣交易不再需要在美國進行資本利得稅申報。"
    }
  ]
}