{
  "author": "CloudFish1",
  "the_new_excerpt": "I don't sweat often or get dirty, so I feel like there's barely any need to\nchange. I will change clothes after maybe 2 days, but I feel like there's little\nneed to change clothes every time. My clothes will still smell good after the\nfirst use, and although that's not a sign of cleanliness (being…",
  "original_created_utc": 1619404716,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "汗をかいたり、汚れたりすることが少ないので、着替える必要性がほとんどないように感じます。\n着替える必要がほとんどないような気がします。2日後くらいには着替えますが、毎回着替える必要はほとんどないような気がします。\n毎回着替える必要はないと思っています。1回目の使用でも服に良い香りがします。\nそれは清潔であることの証ではありませんが（笑）。",
      "title": "最初の使用後に洗濯しない人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不经常出汗或弄脏，所以我觉得几乎没有必要\n换衣服。也许2天后我会换衣服，但我觉得几乎不需要换衣服。\n需要每次都换衣服。我的衣服在第一次使用后仍然很香。\n虽然这并不是清洁的标志（因为...",
      "title": "还有人在第一次使用后不洗衣服吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不經常出汗或弄髒，所以我覺得幾乎沒有必要\n換衣服。也許2天后我會換衣服，但我覺得幾乎不需要換衣服。\n需要每次都換衣服。我的衣服在第一次使用後仍然很香。\n雖然這並不是清潔的標誌（因爲...",
      "title": "還有人在第一次使用後不洗衣服嗎？"
    }
  ],
  "title": "Does anyone else not wash clothes after the first use?",
  "created_utc": 1619420494,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t sweat often or get dirty, so I feel like there&#39;s barely any need to change. I will change clothes after maybe 2 days, but I feel like there&#39;s little need to change clothes every time. My clothes will still smell good after the first use, and although that&#39;s not a sign of cleanliness (being dirty but smelling clean), there are no dirt marks or sweat or anything. I don&#39;t know if I should start changing clothes more often or what I&#39;m doing is fine. I don&#39;t feel dirty or anything, I feel fine as is, as a little bacteria most likely wouldn&#39;t get me sick or anything anyway. My peers usually say something along the lines of &quot;ew, you&#39;re disgusting&quot; or &quot;don&#39;t you feel dirty?&quot; if I admit this to them.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/mynr3j/does_anyone_else_not_wash_clothes_after_the_first/",
  "subreddit": "TooAfraidToAsk",
  "id": "mynr3j",
  "is_self": true,
  "media": null,
  "is_video": false
}