{
  "author": "ElegantAnastasia",
  "original_created_utc": 1645784447,
  "title": "Did it help for Jews to convert to Christianity during WW2?",
  "created_utc": 1645806482,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve read that there was a relatively big conversion of Jews to Catholicism during the holocaust. However, I couldn&amp;#39;t find many sources that say if that helped the Jews to not be followed/persecuted and to what extent did it help, if it even did something. That&amp;#39;s why I&amp;#39;m asking here.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Would convert to Christianity &amp;#39;solve&amp;#39; the problem of being a Jew during ww2? Let&amp;#39;s say you converted during the war or while in the camp, would they let you out?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;And I apologize in advance if this question is insensitive, rude, triggering, or upsetting to anyone. That is not my intention, I just want to know more about the bigger picture; is it the religion itself or the fact that they belonged to a certain group with traditions and so on?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 116,
  "permalink": "/r/AskHistorians/comments/t10qcw/did_it_help_for_jews_to_convert_to_christianity/",
  "subreddit": "AskHistorians",
  "id": "t10qcw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've read that there was a relatively big conversion of Jews to Catholicism\nduring the holocaust. However, I couldn't find many sources that say if that\nhelped the Jews to not be followed/persecuted and to what extent did it help, if\nit even did something. That's why I'm asking here.\n\n\n\nWould…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ユダヤ人のカトリックへの改宗が比較的多かったという話を読んだことがあります。\nホロコーストの時に しかし、そのことが、「大虐殺を引き起こしたかどうか」を示す資料は、あまり見当たりません。\nユダヤ人が追跡・迫害されないようにするために役立ったのか、どの程度役立ったのか、仮に役立ったとして\nということです。だから、ここで聞いているんです。\n\n\n\nそうですか...",
      "title": "第二次世界大戦中、ユダヤ人がキリスト教に改宗することは有効だったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我读到，在大屠杀期间，有一个比较大的犹太人改信天主教的过程\n在大屠杀期间。然而，我找不到很多资料说这是否\n是否有助于犹太人不被跟踪/迫害，以及在多大程度上有帮助，如果有的话。\n它甚至起到了一些作用。这就是为什么我在这里问。\n\n\n\n会不会...",
      "title": "犹太人在二战期间皈依基督教有帮助吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我讀到，在大屠殺期間，有一個比較大的猶太人改信天主教的過程\n在大屠殺期間。然而，我找不到很多資料說這是否\n是否有助於猶太人不被跟蹤/迫害，以及在多大程度上有幫助，如果有的話。\n它甚至起到了一些作用。這就是爲什麼我在這裏問。\n\n\n\n會不會...",
      "title": "猶太人在二戰期間皈依基督教有幫助嗎？"
    }
  ]
}