{
  "author": "ionslyonzion",
  "the_new_excerpt": "To all the WSB brigaders who claim the only people here are \"paper handed\nbitches upset about their loss\", please ask yourself why you're doing this. Put\nyour phone away, take a walk, and think about what you're doing. You'll be lucky\nif WSB as a sub doesn't get clapped because of all of this…",
  "original_created_utc": 1612328881,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "致所有声称这里只有 \"纸上谈兵 \"的WSB大兵们\n母狗为自己的损失而难过\"，请问自己为什么要这样做。把\n把手机收起来，散散步，想想你在做什么。你会很幸运\n如果WSB作为一个副牌不因为这一切而被鼓掌......",
      "title": "我得把这事儿解决了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "致所有聲稱這裏只有 \"紙上談兵 \"的WSB大兵們\n母狗爲自己的損失而難過\"，請問自己爲什麼要這樣做。把\n把手機收起來，散散步，想想你在做什麼。你會很幸運\n如果WSB作爲一個副牌不因爲這一切而被鼓掌......",
      "title": "我得把這事兒解決了"
    }
  ],
  "title": "I need to get this off my chest.",
  "created_utc": 1612337283,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>To all the WSB brigaders who claim the only people here are &quot;paper handed bitches upset about their loss&quot;, please ask yourself why you&#39;re doing this. Put your phone away, take a walk, and think about what you&#39;re doing. You&#39;ll be lucky if WSB as a sub doesn&#39;t get clapped because of all of this brigading. </p>\n\n<p>I made over 200% of my initial deposit and I got out because I&#39;m an <em>investor</em>, not an activist. I did my research a long time ago and decided to go with GME and I got out when I saw where this was going. </p>\n\n<p>I understand if you got caught up in the hype because honestly I did too. But I checked myself <strong>hard</strong> because that isn&#39;t what I&#39;m here for. I&#39;m here to make money and bounce and look for the next trade. That&#39;s it. After Thursday&#39;s events I knew the playing field changed. I am truly sorry if you lost money on this and we&#39;re not here to rub it in your face. You&#39;re going through something we&#39;ve all gone through and I know what it feels like to take a shot in the gut.</p>\n\n<p>However, this new wave of &quot;investors&quot; couldn&#39;t have started in a worse way - thinking WSB is anything more than YOLO bets and loss porn. Now millions of people think they have found the prophecy of get-rich-quick schemes and that <strong>is not</strong> what stock trading is. The denial and doubling-down happening now can be partially blamed on the stages of grief but some of you are going further than that. Some of you will be indirectly responsible for ruining lives and you need to think about that. What is happening now is wrong and you guys are playing with people&#39;s livelihoods. You&#39;re playing with real fucking lives here. This is not stock trading, this is lunacy.</p>\n</div><!-- SC_ON -->",
  "score": 114,
  "permalink": "/r/stocks/comments/lbg7t3/i_need_to_get_this_off_my_chest/",
  "subreddit": "stocks",
  "id": "lbg7t3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518541063
}