{
  "author": "rayou111x",
  "the_new_excerpt": "In this post, we will go over the Best Canadian Index ETFs. I selected only\nhighly popular ETFs with a minimum asset under management of 3 Billion dollars.\nFirst things first, we will go over some definition and the pro and cons of\nholding index ETFs.\n\n\nWHAT’S AN INDEX ETF\n\nThere are several types…",
  "original_created_utc": 1616816797,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在这篇文章中，我们将介绍最佳加拿大指数ETF。我只选择了\n高度流行的ETF，最低管理资产为30亿美元。\n首先，我们将先介绍一些定义和利弊。\n持有指数ETF。\n\n\n什么是指数ETF\n\n有几种类型...",
      "title": "加拿大指数ETF XIU - XIC - VCN - ZCN比较"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這篇文章中，我們將介紹最佳加拿大指數ETF。我只選擇了\n高度流行的ETF，最低管理資產爲30億美元。\n首先，我們將先介紹一些定義和利弊。\n持有指數ETF。\n\n\n什麼是指數ETF\n\n有幾種類型...",
      "title": "加拿大指數ETF XIU - XIC - VCN - ZCN比較"
    }
  ],
  "title": "Canadian Index ETFs XIU - XIC - VCN - ZCN comparison",
  "created_utc": 1616855181,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In this post, we will go over the Best Canadian Index ETFs. I selected only highly popular ETFs with a minimum asset under management of 3 Billion dollars. First things first, we will go over some definition and the pro and cons of holding index ETFs. </p>\n\n<h3>What’s an Index ETF</h3>\n\n<p>There are several types of ETFs. And, index ETFs are the king of the hill. In fact, the first ever ETF introduced to a North American Exchange was an index ETF. Index ETFs offer exposure to a large number of securities and sometimes to a whole stock exchange at a very low cost. Their main goal is to acquire, on your behalf, all the securities that constitute a specific index in order to achieve the same return of the tracked index minus the fees.</p>\n\n<h3>Does Index funds pay dividend?</h3>\n\n<p>Yes they do. Since Index ETFs holds all shares of companies part of the index, if these companies pay dividends then a dividend will be distributed. See below the performance table, the dividend yield is included.</p>\n\n<h3>Popular indexes</h3>\n\n<h4>S&amp;P/TSX Capped Composite Index (Index)</h4>\n\n<p>includes over 200 top-ranked Canadian stocks, representing approximately 95% of the Canadian equity market. Constituent securities must pass minimum float-adjusted and liquidity screens to qualify and maintain membership in the Index. Index weights are capped at 10% of the Index’s float-adjusted market capitalization and are reviewed quarterly.</p>\n\n<h4>S&amp;P/TSX 60</h4>\n\n<p>An index constituted of the 60 largest companies in the Toronto Stock Exchange</p>\n\n<h4>FTSE Canada All Cap</h4>\n\n<p>The FTSE Canada All Cap Domestic Index is a market-capitalization-weighted index representing the performance of Canadian large-, mid- and small-capitalization companies. As of Feb 28th, this index had 178 member stocks.</p>\n\n<h3>Pro and cons of index investing?</h3>\n\n<p><strong>Pros:</strong></p>\n\n<p>-Low MER: Because Index ETFs are a passive style of investment, they do not require an active manager. This is why the cost to operate an Index ETF is cheaper than say an Actively managed ETF. Low MER means you will benefit more from the returns the funds makes;</p>\n\n<p>-Investing in a index fund has proven to be a great strategy in the long term (if you have more than 5 years horizon).</p>\n\n<p><strong>Cons:</strong></p>\n\n<p>-Index ETFs are volatile since they are tied directly to the performance of a stock exchange. Exchanges tend to rally quickly on a glimpse of good economic news but also fall sharply when investors are pessimistic about the near term. This is why it’s important when you buy an index ETF to keep it for the long run and not short term.</p>\n\n<p>-Some investors prefer to have control over their investments and cherry pick stocks. Obviously, this is not possible under an index fund which basically holds all stocks part of the index without any pre-selection process.</p>\n\n<h3>ETFs selected for the analysis</h3>\n\n<p>Now that we are done with the definitions, below are the Best Canadian Index ETFs list. We will focus in our comparison on the largest ETFs in Canada in terms of the Asset Under Management.</p>\n\n<p>ETF                                                          AUM in Millions</p>\n\n<p>Ishares S&amp;P TSX 60 Index – <strong>XIU</strong>                          10,173 </p>\n\n<p>Ishares Core S&amp;P TSX Capped Comp – <strong>XIC</strong>       7,800 </p>\n\n<p>BMO S&amp;P TSX Capped Comp – <strong>ZCN</strong>                   5,337 </p>\n\n<p>Vanguard FTSE Canada All Cap – <strong>VCN</strong>                  3,404 </p>\n\n<p>&#x200B;</p>\n\n<p><strong>Name           MER                   Div                             1y                3y               5y</strong> </p>\n\n<p>XIU                  0.15%              2.79%                      14.27%     8.93%           10.36% </p>\n\n<p>XIC                       0.06%            2.78%                     14.82%         8.81%         10.36% </p>\n\n<p>ZCN                      0.08%           2.98%                      14.90%         8.77%            10.35% </p>\n\n<p>VCN                     0.06%           2.49%                      14.86%          8.24%          10.05% </p>\n\n<p>The long term performance for XIU, XIC, ZCN is similar (around 10.35%). VCN is bit lower than the rest at 10.05%. </p>\n\n<p>&#x200B;</p>\n\n<h1>Comparison volatility</h1>\n\n<p>Beta</p>\n\n<p>Ishares S&amp;P TSX 60 Index – <strong>XIU</strong>                             0.91 </p>\n\n<p>Ishares Core S&amp;P TSX Capped Comp – <strong>XIC</strong>           0.98 </p>\n\n<p>BMO S&amp;P TSX Capped Comp – <strong>ZCN</strong>                      0.98 </p>\n\n<p>Vanguard FTSE Canada All Cap – <strong>VCN</strong>                  0.99 </p>\n\n<p>Beta is a measure of risk in comparison to the market. The higher the Beta the higher the volatility </p>\n\n<p>XIU has the lowest volatility among our 4 contenders. This is probably due the fact that its’ holdings are exclusively large Canadian companies. Large companies tend to be more stable than the overall market. The other ETFs have a beta of 1 which is not surprising since they track a more global market index. </p>\n\n<h1>Ishares S&amp;P TSX 60 Index (XIU.TO)</h1>\n\n<p>iShares S&amp;P/TSX 60 Index ETF as its’ name implies, it’s a fund that is constituted with the 60 largest companies that are members of the TSX. It’s the most popular ETF in Canada with 10 Billion dollars in Assets. This ETF is representative of the Canadian economy which is dominated by the Energy and Financial sector as you can see below n the sector allocation table.</p>\n\n<p>The number of holdings for the ETF is 60. It has the highest MER in the list but this did not really impact its long term performance in comparison with the other funds. For the 1 year performance, XIU recorded a slightly lower performance than the other ETFs.</p>\n\n<h1>Ishares Core S&amp;P TSX Capped Comp (XIC.TO)</h1>\n\n<p>Seeks long-term capital growth by replicating the performance of the S&amp;P®/TSX® Capped Composite Index, net of expenses. While XIU has 60 holdings in total, XIC is much larger with 219 Canadian companies. In terms of performance both XIU and XIC are quite close. XIC has a lower MER 0.06% in comparison to XIU at 0.15%. XIC is dominated by Energy and Financial companies which is the same case for XIU.</p>\n\n<h1>BMO S&amp;P TSX Capped Comp (ZCN.TO)</h1>\n\n<p>ZCN is the third contender in this list of Best Index ETFs in Canada. The BMO S&amp;P/TSX Capped Composite Index ETF (ZCN) has been designed to replicate, to the extent possible, the performance of the S&amp;P/TSX Capped Composite Index (Index), net of expenses. Both ZCN and XIC are quite similar. They both track the S&amp;P/TSX Capped Composite index. XIC has a lower MER.</p>\n\n<h1>Vanguard FTSE Canada All Cap – VCN</h1>\n\n<p>Vanguard FTSE Canada All Cap Index ETF seeks to track the performance of a broad Canadian equity index that measures the investment return of large-, mid- and small-capitalization, publicly traded securities in the Canadian market.</p>\n\n<p>&#x200B;</p>\n\n<p>Link to similar post <a href=\"https://wyzeinvestors.com/?p=1161\">comparing Canadian Index ETFs that track US markets</a> (S&amp;P 500 and Nasdaq 100)</p>\n</div><!-- SC_ON -->",
  "score": 86,
  "permalink": "/r/investing/comments/me5yvd/canadian_index_etfs_xiu_xic_vcn_zcn_comparison/",
  "subreddit": "investing",
  "id": "me5yvd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357140056
}