{
  "author": "kherven",
  "original_created_utc": 1647970076,
  "title": "Why do pain relievers (NSAID/acetaminophen) relieve chronic pain while seemingly not affecting acute pain?",
  "created_utc": 1647979785,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;On the rare occasion I have a headache, I&amp;#39;ll often reach for a Tylenol to help relieve the pain.&lt;/p&gt;\n\n&lt;p&gt;Usually this is relatively effective. Either it&amp;#39;ll eliminate the pain completely or reduce it to a much more manageable level. &lt;/p&gt;\n\n&lt;p&gt;Yet, even under the effects of something like Tylenol or Ibuprofen, if I were to say, pinch my arm, I&amp;#39;d still feel essentially the same amount of pain as normal. &lt;/p&gt;\n\n&lt;p&gt;Is there a biochemical reason for this? Is there a difference between acute and chronic pain? Or is there perhaps some psychological component to it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/askscience/comments/tk87u1/why_do_pain_relievers_nsaidacetaminophen_relieve/",
  "subreddit": "askscience",
  "id": "tk87u1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "On the rare occasion I have a headache, I'll often reach for a Tylenol to help\nrelieve the pain.\n\nUsually this is relatively effective. Either it'll eliminate the pain completely\nor reduce it to a much more manageable level.\n\nYet, even under the effects of something like Tylenol or Ibuprofen, if I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まれに頭痛がするとき、私はよくタイレノールに手を伸ばします。\n痛みを和らげます。\n\n通常、これは比較的効果的です。痛みが完全になくなるか\nあるいは、もっと扱いやすいレベルまで下げることができます。\n\nしかし、タイレノールやイブプロフェンのようなものの効果があっても、もし私が...",
      "title": "鎮痛剤（NSAID/アセトアミノフェン）は、急性痛には効果がないように見えるのに、なぜ慢性痛を和らげるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在少数情况下，我有一个头痛的问题，我经常会伸手去拿泰诺，以帮助\n缓解疼痛。\n\n通常情况下这是相对有效的。要么它能完全消除疼痛\n或者把它减少到一个更容易控制的水平。\n\n然而，即使在泰诺或布洛芬等药物的作用下，如果我...",
      "title": "为什么止痛药（NSAID/acetaminophen）能缓解慢性疼痛，而似乎不影响急性疼痛？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在少數情況下，我有一個頭痛的問題，我經常會伸手去拿泰諾，以幫助\n緩解疼痛。\n\n通常情況下這是相對有效的。要麼它能完全消除疼痛\n或者把它減少到一個更容易控制的水平。\n\n然而，即使在泰諾或布洛芬等藥物的作用下，如果我...",
      "title": "爲什麼止痛藥（NSAID/acetaminophen）能緩解慢性疼痛，而似乎不影響急性疼痛？"
    }
  ]
}