{
  "author": "GroundbreakingLack78",
  "the_new_excerpt": "Everyone talks about missed opportunities, but sometimes the opportunities are\nright in front of them and they fail to take advantage, to recognise them.\nPeople are still sleeping on ”insert your favourite coin here”. If you want to\nbuy BTC or ETH, do it now! If you want to buy ADA, NANO, DOT,…",
  "original_created_utc": 1617551968,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "每个人都在谈论错失机会，但有时机会是\n就在他们面前，他们却没有利用，没有认识到他们。\n人们还在 \"在这里插入你最喜欢的硬币 \"上睡觉。如果你想\n买入BTC或ETH，现在就买! 如果你想购买ADA，NANO，DOT，... ...",
      "title": "人们想回到过去购买BTC，然而他们现在却在睡觉。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每個人都在談論錯失機會，但有時機會是\n就在他們面前，他們卻沒有利用，沒有認識到他們。\n人們還在 \"在這裏插入你最喜歡的硬幣 \"上睡覺。如果你想\n買入BTC或ETH，現在就買! 如果你想購買ADA，NANO，DOT，... ...",
      "title": "人們想回到過去購買BTC，然而他們現在卻在睡覺。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "チャンスを逃したという話はよく聞きますが、チャンスは目の前にあることもあります。\n目の前にあるのに、それに気づかず、活用できないことがあるのです。\n人々はいまだに「お気に入りのコインをここに置いてください」と言って眠っているのです。もし、あなたが\nBTCやETHを買いたいのであれば、今すぐ実行してください。ADA、NANO、DOT、...を買いたいと思ったら、今すぐ実行してください。",
      "title": "人々は過去に戻ってBTCを買いたいと思っているのに、今は眠っている。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "チャンスを逃したという話はよく聞きますが、チャンスは目の前にあることもあります。\n目の前にあるのに、それに気づかず、活用できないことがあるのです。\n人々はいまだに「お気に入りのコインをここに置いてください」と言って眠っているのです。もし、あなたが\nBTCやETHを買いたいのであれば、今すぐ実行してください。ADA、NANO、DOT、...を買いたいと思ったら、今すぐ実行してください。",
      "title": "人々は過去に戻ってBTCを買いたいと思っているのに、今は眠っている。"
    }
  ],
  "title": "People wants to go back in time to buy BTC, yet they are sleeping now.",
  "created_utc": 1617575460,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Everyone talks about missed opportunities, but sometimes the opportunities are right in front of them and they fail to take advantage, to recognise them. People are still sleeping on <em>”insert your favourite coin here”</em>. If you want to buy BTC or ETH, do it now! If you want to buy ADA, NANO, DOT, MONERO, ETH, MATIC, AAVE, ALGO, UNI, LTC or any from the 4,500~ cryptos, do it now !</p>\n\n<p>Sometimes, luck is when opportunity meets preparation. The opportunity of a lifetime has been in front of people for a months if not years now! Many people dismiss crypto because they don’t understand it. Instead of giving an hour of their time to begin learning about the problems that crypto solves.</p>\n\n<p>Stop listening to good ol’ banks. They don’t care about you. Be aware, and have clear frame of mind.</p>\n\n<p>Born too late to explore the Earth. Born too early to explore the stars. But born just in time to invest in Cryptocurrency. Don’t hesitate to take opportunities. It’s your time now !</p>\n</div><!-- SC_ON -->",
  "score": 614,
  "permalink": "/r/CryptoCurrency/comments/mjyy4e/people_wants_to_go_back_in_time_to_buy_btc_yet/",
  "subreddit": "CryptoCurrency",
  "id": "mjyy4e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961875629
}