{
  "author": "Frederik1234",
  "the_new_excerpt": "If you are new to crypto, these times can be scary. It's uneasy for all of us.\n\nBut it's at these times gains are made. Not by trading (for some, sure) but by\nstudying and planning your strategy. Now it's time for you to do your research\non which coins you believe in and align your bags…",
  "original_created_utc": 1621168624,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号に慣れていない人は、このような時代は怖いものです。私たち全員にとって不安です。\n\nしかし、このような時こそ、利益が得られるのです。トレードではなく（一部の人はそうでしょうが）、勉強して戦略を練ることで\n勉強して戦略を練ることです。今は、どのコインを買うかを研究する時です。\nどのコインを信じているかを調べて、荷物を揃えましょう。",
      "title": "暗号の怖いところへようこそ。ここで利益が出るのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你是加密货币的新手，这些时间可能是可怕的。这对我们所有人来说都是不安的。\n\n但正是在这些时候，才有了收获。不是通过交易（对一些人来说，当然），而是通过\n研究和规划你的战略。现在是时候让你做你的研究了\n哪些硬币是你所相信的，并调整你的袋子...",
      "title": "欢迎来到加密货币的可怕部分。这是有收益的地方。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你是加密貨幣的新手，這些時間可能是可怕的。這對我們所有人來說都是不安的。\n\n但正是在這些時候，纔有了收獲。不是通過交易（對一些人來說，當然），而是通過\n研究和規劃你的戰略。現在是時候讓你做你的研究了\n哪些硬幣是你所相信的，並調整你的袋子...",
      "title": "歡迎來到加密貨幣的可怕部分。這是有收益的地方。"
    }
  ],
  "title": "Welcome to the scary part of crypto. This is where gains are made.",
  "created_utc": 1621191433,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you are new to crypto, these times can be scary. It&#39;s uneasy for all of us.</p>\n\n<p>But it&#39;s at these times gains are made. Not by trading (for some, sure) but by studying and planning your strategy. Now it&#39;s time for you to do your research on which coins you believe in and align your bags accordingly. </p>\n\n<p><strong>It&#39;s true what they say, &quot;Time in the market, beats timing the market&quot;</strong>. So don&#39;t over-leverage, don&#39;t sell high or on the way down, and stick to projects/coins you believe in. If you believe in crypto, your goal is to still be in this game years down the road. </p>\n\n<p>And it&#39;s way more profitable than jumping ship from coin to coin depending on what&#39;s pumping. Plus you will learn a lot along the way.</p>\n\n<p>Once you&#39;ve aligned your bags accordingly, all you need to do is to lay in a coma, trust your intuition and try to keep yourself from refreshing prices 24/7. </p>\n\n<p>This part is difficult for all of us to do, but it&#39;s important. Doing this is a lot easier if you have hobbies or things you&#39;re passionate about outside crypto. So try to pick up a new hobby or do something that keeps you from looking at charts every 5 minutes and FOMO into any shitcoin that&#39;s pumping this day. </p>\n\n<p>Best of luck to all of you.</p>\n</div><!-- SC_ON -->",
  "score": 8150,
  "permalink": "/r/CryptoCurrency/comments/ndng7x/welcome_to_the_scary_part_of_crypto_this_is_where/",
  "subreddit": "CryptoCurrency",
  "id": "ndng7x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590799660
}