{
  "author": "Bn1995",
  "original_created_utc": 1655296398,
  "title": "I have never seen an asset get more shit than Bitcoin",
  "created_utc": 1655310963,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My God this pullback has brought out this surreal seething hate from people that honestly is hard to put into words. Massively up voted posts across reddit from people calling bitcoin a scam, saying that they&amp;#39;re popping champagne watching people lose money. In what world are people that obsessed with an asset that they don&amp;#39;t even own? Not to mention that the ENTIRE macro market is in a pullback right now, not just crypto. Yet you don&amp;#39;t see gold, the s&amp;amp;p 500 ect getting anywhere near this amount of shit, it&amp;#39;s only crypto. I&amp;#39;ll never understand it. You don&amp;#39;t want to own it, don&amp;#39;t own it. But who obsesses so much about an asset that doesn&amp;#39;t affect their lives at all is beyond me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 545,
  "permalink": "/r/Bitcoin/comments/vcth28/i_have_never_seen_an_asset_get_more_shit_than/",
  "subreddit": "Bitcoin",
  "id": "vcth28",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My God this pullback has brought out this surreal seething hate from people that\nhonestly is hard to put into words. Massively up voted posts across reddit from\npeople calling bitcoin a scam, saying that they're popping champagne watching\npeople lose money. In what world are people that obsessed…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なんということでしょう。この引き戻しによって、人々からこの超現実的な憎悪が沸き起こったのです。\n正直なところ、言葉にするのは難しいです。redditに投稿された、ビットコインを詐欺だと言う人や\nビットコインを詐欺だと言っている人、シャンパンを飲んでいるところを見ていると言っている人。\nを飲んでいると言っています。一体全体、人々はそこまで執着しているのだろうか...。",
      "title": "ビットコインよりクソな資産を見たことがない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的上帝，这次回调带来了人们超现实的仇恨。\n说实话，很难用语言来表达。在reddit上有大量的投票帖子，来自于\n人们说比特币是个骗局，说他们在喝着香槟看着\n人们失去了金钱。在什么样的世界里，人们如此痴迷于...",
      "title": "我从来没有见过一种资产比比特币得到更多的狗屎。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的上帝，這次回調帶來了人們超現實的仇恨。\n說實話，很難用語言來表達。在reddit上有大量的投票帖子，來自於\n人們說比特幣是個騙局，說他們在喝着香檳看着\n人們失去了金錢。在什麼樣的世界裏，人們如此癡迷於...",
      "title": "我從來沒有見過一種資產比比特幣得到更多的狗屎。"
    }
  ]
}