{
  "author": "ThreeTonChonker",
  "original_created_utc": 1631063488,
  "title": "Anyone notice how shitty /r/CryptoCurrency has become?",
  "created_utc": 1631115824,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><ol>\n<li> The only thing that regularly makes it to the front page is anti crypto news, especially anti bitcoin.</li>\n<li> I responded to the El Salvador concerned citizen post yesterday to explain why Bitcoin could succeed and that assuming it will fail ahead of time just becomes a self fulfilling prophecy. My post was removed after 30 minutes and I got a message from the mods saying it could be reinstated if I donate by buying moon coin.</li>\n<li> Today the top sticky threads in the subreddit are about how their mods have manipulated Moon Coin and now the community has to decide what to do next with their pyramid scheme.</li>\n</ol>\n\n<p>The common trend with financial subreddits (WSB and CryptoCurrency especially) seems to be that if they get remotely popular, shithead mods take over, and then it’s all about convincing people to sell their stocks or coins at a discount and to buy into their bullshit instead.</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/Bitcoin/comments/pk0dgc/anyone_notice_how_shitty_rcryptocurrency_has/",
  "subreddit": "Bitcoin",
  "id": "pk0dgc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": " 1. The only thing that regularly makes it to the front page is anti crypto\n    news, especially anti bitcoin.\n 2. I responded to the El Salvador concerned citizen post yesterday to explain\n    why Bitcoin could succeed and that assuming it will fail ahead of time just\n    becomes a self fulfilling…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": " 1. 定期的にフロントページに掲載されるのは、アンチ・クリプト\n    ニュース、特にアンチビットコインです。\n 2. 昨日、エルサルバドルの関係者の投稿に返信して、ビットコインが成功する可能性を説明しました。\n    ビットコインが成功する可能性がある理由を説明し、前もって失敗すると仮定することは、ただの自己満足になってしまいます。\n    自己実現になってしまいます。",
      "title": "誰か、/r/CryptoCurrencyがどれだけクソになったか気づいていますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": " 1. 唯一经常出现在头版的是反加密货币的\n    新闻，尤其是反比特币。\n 2. 2.我昨天回应了萨尔瓦多相关公民的帖子，解释了\n    为什么比特币可以成功，而提前假设它将失败只是因为\n    成为一个自我实现的...",
      "title": "有谁注意到/r/CryptoCurrency已经变得多么糟糕？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " 1. 唯一經常出現在頭版的是反加密貨幣的\n    新聞，尤其是反比特幣。\n 2. 2.我昨天迴應了薩爾瓦多相關公民的帖子，解釋了\n    爲什麼比特幣可以成功，而提前假設它將失敗只是因爲\n    成爲一個自我實現的...",
      "title": "有誰注意到/r/CryptoCurrency已經變得多麼糟糕？"
    }
  ]
}