{
  "approved_at_utc": null,
  "subreddit": "investing",
  "selftext": "I'm interested in everyone's expectations in the market next year as we enter into an interesting situation with inflation, supply constraints, constant pent-up demand, interest rate hikes (later), and faster tapering.\n\nI'll give my expectations here first\n\nI think that inflation will remain fairly high through 2022 but it won't be at the levels that it is now, maybe around 3-4%, which puts most bonds at negative real rates right now, forcing investors if they want a real return to go into the equity markets and/or chase high yield bonds.\n\nWhen the federal reserve starts hiking interest rates I personally don't expect that they will raise them at a very fast pace however if inflation doesn't start taming down they might. When rates rise the risk-free rate rises and its effect on equities is usually bad. As the discount rate rising the price that investors are willing to purchase a security will decrease or at least for institutional investors won't which of course make up most of the market. I think that may not be the case next year however because if investors still need to go into the equity market to chase real returns, the equities should still rise. I'm worried that equities are already in a slight bubble and that another year of these returns could show a market correction back down. If I was a betting man I would assume that within the next 1-3 years there will be a negative return in the S&amp;P500 which has only happened once in the last 12 years.\n\nInvestors still can't enter into the bond market without giving up a return. Sure an investor can buy futures contracts on treasuries because they expect an upward shift in the yield curve, which I expect to happen, to get a higher yield and decrease their interest rate risk. However, if you cannot accurately predict when the fed is done raising rates then that won't help you as when you are obligated to buy those treasuries you will have interest rate risk issues. Buying short-term bonds to help with duration would help that problem but those also will more than likely result in a negative real return anyways if inflation doesn't cool off and the equity should've been the move anyways.\n\nI would say that the Financial Services sector will benefit from the rising yields especially as corps and people demand large purchases as demand is hot.\n\nI would also say that Industrials and Cyclicals will outperform as demand will drive the Cyclicals and the Industrials from infrastructure and servicing the demand in Cyclicals.\n\nI think that elevated Materials prices will fall, hurting that sector.\n\nStaples could be a hedge against a downturn in the market which I expect in the coming years.\n\nTechnology and communication services may have a bumpy road ahead with rising rates because the discount rate increasing hurts them the worst. Comm services wouldn't be as greatly affected but because of high tech companies in the space. More value may be the direction to take.\n\nI'm always bullish on healthcare as innovations and rising populations will always benefit that sector. I may change my focus away from Biotech and into more stable earning healthcare companies.\n\nPersonally, I think Value over Growth or at least blend.\n\nAnd this is of course not financial advice just my personal opinions on the market next year.",
  "author_fullname": "t2_5l6mdvyv",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "The Market Outlook in 2022",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/investing",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_rgkmix",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.76,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 162,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 162,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1639525121,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.investing",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m interested in everyone&amp;#39;s expectations in the market next year as we enter into an interesting situation with inflation, supply constraints, constant pent-up demand, interest rate hikes (later), and faster tapering.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll give my expectations here first&lt;/p&gt;\n\n&lt;p&gt;I think that inflation will remain fairly high through 2022 but it won&amp;#39;t be at the levels that it is now, maybe around 3-4%, which puts most bonds at negative real rates right now, forcing investors if they want a real return to go into the equity markets and/or chase high yield bonds.&lt;/p&gt;\n\n&lt;p&gt;When the federal reserve starts hiking interest rates I personally don&amp;#39;t expect that they will raise them at a very fast pace however if inflation doesn&amp;#39;t start taming down they might. When rates rise the risk-free rate rises and its effect on equities is usually bad. As the discount rate rising the price that investors are willing to purchase a security will decrease or at least for institutional investors won&amp;#39;t which of course make up most of the market. I think that may not be the case next year however because if investors still need to go into the equity market to chase real returns, the equities should still rise. I&amp;#39;m worried that equities are already in a slight bubble and that another year of these returns could show a market correction back down. If I was a betting man I would assume that within the next 1-3 years there will be a negative return in the S&amp;amp;P500 which has only happened once in the last 12 years.&lt;/p&gt;\n\n&lt;p&gt;Investors still can&amp;#39;t enter into the bond market without giving up a return. Sure an investor can buy futures contracts on treasuries because they expect an upward shift in the yield curve, which I expect to happen, to get a higher yield and decrease their interest rate risk. However, if you cannot accurately predict when the fed is done raising rates then that won&amp;#39;t help you as when you are obligated to buy those treasuries you will have interest rate risk issues. Buying short-term bonds to help with duration would help that problem but those also will more than likely result in a negative real return anyways if inflation doesn&amp;#39;t cool off and the equity should&amp;#39;ve been the move anyways.&lt;/p&gt;\n\n&lt;p&gt;I would say that the Financial Services sector will benefit from the rising yields especially as corps and people demand large purchases as demand is hot.&lt;/p&gt;\n\n&lt;p&gt;I would also say that Industrials and Cyclicals will outperform as demand will drive the Cyclicals and the Industrials from infrastructure and servicing the demand in Cyclicals.&lt;/p&gt;\n\n&lt;p&gt;I think that elevated Materials prices will fall, hurting that sector.&lt;/p&gt;\n\n&lt;p&gt;Staples could be a hedge against a downturn in the market which I expect in the coming years.&lt;/p&gt;\n\n&lt;p&gt;Technology and communication services may have a bumpy road ahead with rising rates because the discount rate increasing hurts them the worst. Comm services wouldn&amp;#39;t be as greatly affected but because of high tech companies in the space. More value may be the direction to take.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m always bullish on healthcare as innovations and rising populations will always benefit that sector. I may change my focus away from Biotech and into more stable earning healthcare companies.&lt;/p&gt;\n\n&lt;p&gt;Personally, I think Value over Growth or at least blend.&lt;/p&gt;\n\n&lt;p&gt;And this is of course not financial advice just my personal opinions on the market next year.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qhhq",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "rgkmix",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "ChaoticSquids210",
  "discussion_type": null,
  "num_comments": 44,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/investing/comments/rgkmix/the_market_outlook_in_2022/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/investing/comments/rgkmix/the_market_outlook_in_2022/",
  "subreddit_subscribers": 1963904,
  "created_utc": 1639541878,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1639525121,
  "the_new_excerpt": "I'm interested in everyone's expectations in the market next year as we enter\ninto an interesting situation with inflation, supply constraints, constant\npent-up demand, interest rate hikes (later), and faster tapering.\n\nI'll give my expectations here first\n\nI think that inflation will remain fairly…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "来年の市場について、みなさんがどのような期待をお持ちなのか、興味があります。\nインフレ、供給制約、一定の\n需要増、利上げ（後）、テーパリングの加速。\n\nここでまず私の予想を述べますと\n\nインフレはかなり続くと思うのですが...。",
      "title": "2022年の市場展望"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对大家对明年市场的预期很感兴趣，因为我们进入了一个跨年度的市场。\n通货膨胀、供应限制、持续的被压抑的需求、加息（稍后）和更快的紧缩政策，进入了一个有趣的局面。\n被压抑的需求，加息（稍后），以及更快的缩减。\n\n我在这里先给出我的预期\n\n我认为，通货膨胀将保持相当...",
      "title": "2022年的市场前景"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對大家對明年市場的預期很感興趣，因爲我們進入了一個跨年度的市場。\n通貨膨脹、供應限制、持續的被壓抑的需求、加息（稍後）和更快的緊縮政策，進入了一個有趣的局面。\n被壓抑的需求，加息（稍後），以及更快的縮減。\n\n我在這裏先給出我的預期\n\n我認爲，通貨膨脹將保持相當...",
      "title": "2022年的市場前景"
    }
  ],
  "source_updated_at": 1639734118431
}