{
  "author": "Zijdehoen",
  "original_created_utc": 1634569388,
  "title": "It is Time we ALL unfollow Elon and other \"Crypto Celebrities\"",
  "created_utc": 1634600421,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>I am aware that cryptocurrencies would not have been as big or widespread as it is now without the help and love of some famous personalities, bringing the name to the masses.</em> </p>\n\n<p>However, <strong>we do NOT need them</strong>. Yes they helped, but we would have reached this point anyway later in time. </p>\n\n<p><strong>The problem is</strong> that some of these figures think they are some kind of founder or pioneer of certain projects, and unfortunately the <del>people</del> sheeple follow them in whatever they say. </p>\n\n<p>Today, our beloved <em>BiTcOiN WaSteS EnErGy BuT RoCkEts DoN&#39;t</em> friend Elon Musk tweeted this:  </p>\n\n<p><a href=\"https://preview.redd.it/vjy48dzp38u71.png?width=317&amp;format=png&amp;auto=webp&amp;s=e6faa91fb1563f43c048bcdfec1fe4c539e7db75\">Literally nothing</a></p>\n\n<p>Which is just a stupid animal figure holding a rocket. Ofcourse the <em>sheeple</em> think this obvious rabbit is some kind of dog, so what happens? <strong>Dogecoin and Shiba Inu pump hard.</strong> </p>\n\n<p><strong>When is this going to stop?</strong> John McAfee was convicted and rotted in his cell because of this but Elon can keep pumping his portfolio without any consequence as long as it is vague enough?</p>\n\n<p>It is time we stop following him and other hypocrites. They are unhealthy for our community and crypto in general.</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/qaoh1o/it_is_time_we_all_unfollow_elon_and_other_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qaoh1o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am aware that cryptocurrencies would not have been as big or widespread as it\nis now without the help and love of some famous personalities, bringing the name\nto the masses.\n\nHowever, we do NOT need them. Yes they helped, but we would have reached this\npoint anyway later in time.\n\nThe problem is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号通貨は、有名な方々の協力と愛がなければ、これほど大きく、広く普及することはなかっただろうと思います。\n有名人の助けと愛がなければ、暗号通貨はここまで大きく普及しなかったと思います。\n大衆にその名を広めることができました。\n\nしかし、彼らを必要としているわけではありません。確かに彼らは助けてくれましたが、いずれにしてもここまで到達していたでしょう。\nここまで来れたのは後の祭りです。\n\n問題は...。",
      "title": "みんなでElonや他の \"Crypto Celebrities \"のフォローを外す時が来た。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道，如果没有一些知名人士的帮助和爱护，加密货币不会像现在这样大，也不会像现在这样普遍。\n如果没有一些知名人士的帮助和爱护，把这个名字带给大众，就不会有现在的规模和普及。\n到大众面前。\n\n然而，我们并不需要他们。是的，他们提供了帮助，但我们本来就会达到这一点\n但我们还是会在后来达到这个地步。\n\n问题是...",
      "title": "现在是时候让我们全部取消对埃隆和其他 \"加密货币名人 \"的关注了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道，如果沒有一些知名人士的幫助和愛護，加密貨幣不會像現在這樣大，也不會像現在這樣普遍。\n如果沒有一些知名人士的幫助和愛護，把這個名字帶給大衆，就不會有現在的規模和普及。\n到大衆面前。\n\n然而，我們並不需要他們。是的，他們提供了幫助，但我們本來就會達到這一點\n但我們還是會在後來達到這個地步。\n\n問題是...",
      "title": "現在是時候讓我們全部取消對埃隆和其他 \"加密貨幣名人 \"的關注了"
    }
  ]
}