{
  "author": "girekejixo",
  "the_new_excerpt": "As the title said, a friend was thinking of selling his SATs for some shitcoin\ncuz he was chasing \"higher returns\". Spend 15 mins and convinced him not to\nsell. I told him if he really wants, just buy the shitcoin when his next salary\ncomes but stay focused on BTC and the bigger picture. I am pissed…",
  "original_created_utc": 1621345431,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルの通り、友人が自分のSATを売ってクソコインを手に入れようと考えていました。\nより高いリターンを求めていました。15分かけて、売らないように説得しました。\n説得しました。私は彼に、もし彼が本当に欲しければ、次の給料が入ったときにそのクソコインを買えばいい。\nしかし、BTCと大局的な観点に集中してください。私は腹を立てています。",
      "title": "Rant: 友人にBTCをクソコインに売らないように説得しなければならなかった。このシットコインのポンピングはやめるべきだ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说，一个朋友想卖掉他的SAT以换取一些狗屎币。\n因为他在追求 \"更高的回报\"。我花了15分钟，说服他不要卖。\n卖。我告诉他，如果他真的想要，就在他的下一次工资来临时买下这个狗屎币吧\n但要保持对BTC和大局的关注。我很生气...",
      "title": "咆哮：不得不说服一个朋友不要把他的BTC卖给一个狗屎币。这种抽水的狗屎币需要停止。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說，一個朋友想賣掉他的SAT以換取一些狗屎幣。\n因爲他在追求 \"更高的回報\"。我花了15分鐘，說服他不要賣。\n賣。我告訴他，如果他真的想要，就在他的下一次工資來臨時買下這個狗屎幣吧\n但要保持對BTC和大局的關注。我很生氣...",
      "title": "咆哮：不得不說服一個朋友不要把他的BTC賣給一個狗屎幣。這種抽水的狗屎幣需要停止。"
    }
  ],
  "title": "Rant: Had to convince a friend not to sell his BTC for a shitcoin. This pumping of shitcoins needs to stop",
  "created_utc": 1621380636,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As the title said, a friend was thinking of selling his SATs for some shitcoin cuz he was chasing &quot;higher returns&quot;. Spend 15 mins and convinced him not to sell. I told him if he really wants, just buy the shitcoin when his next salary comes but stay focused on BTC and the bigger picture. I am pissed off at these get rich quick stuff that people are getting into. Had to come here to vent. Won&#39;t be doing this type of convincing again.Not sure if I will get downvoted but had to type this out. End.</p>\n</div><!-- SC_ON -->",
  "score": 191,
  "permalink": "/r/Bitcoin/comments/nfb2lh/rant_had_to_convince_a_friend_not_to_sell_his_btc/",
  "subreddit": "Bitcoin",
  "id": "nfb2lh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590795290
}