{
  "author": "HeungMinSwan",
  "the_new_excerpt": "I knew a guy called John. me and him had been friends for a long time, nearly 10\nyears i think. i got into crypto a while back and i'd obviously talk about it\nwith him, encourage him to start as it is a great hobby to have. John claimed he\nwas too 'busy' to invest, i.e. playing video games all day…",
  "original_created_utc": 1623561255,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はジョンという男を知っていました。私と彼は長い間、10年近く友達だったと思います。\n私はしばらく前に暗号を始めましたが、彼とは当然その話をしました。\n始めるように勧めていました。ジョンは、自分は\n投資するには忙しすぎる、つまり一日中ビデオゲームをしていると...。",
      "title": "私の友人にCryptoを紹介しましたが、今では私と話すことはありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认识一个叫约翰的人。我和他是很长时间的朋友，差不多10年了。\n我和他已经是很长时间的朋友了，我想差不多有10年了。\n与他讨论，鼓励他开始，因为这是个很好的爱好。约翰声称他\n他太 \"忙 \"了，没时间投资，也就是整天玩电子游戏......",
      "title": "把我的朋友介绍给Crypto，现在他不愿意和我说话了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認識一個叫約翰的人。我和他是很長時間的朋友，差不多10年了。\n我和他已經是很長時間的朋友了，我想差不多有10年了。\n與他討論，鼓勵他開始，因爲這是個很好的愛好。約翰聲稱他\n他太 \"忙 \"了，沒時間投資，也就是整天玩電子遊戲......",
      "title": "把我的朋友介紹給Crypto，現在他不願意和我說話了。"
    }
  ],
  "title": "Introduced my friend to Crypto, Now he wont speak to me.",
  "created_utc": 1623573939,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I knew a guy called John. me and him had been friends for a long time, nearly 10 years i think. i got into crypto a while back and i&#39;d obviously talk about it with him, encourage him to start as it is a great hobby to have. John claimed he was too &#39;busy&#39; to invest, i.e. playing video games all day and jacking off in his uni dorm room.</p>\n\n<p>However, recently, John had a change of heart. he wanted to pull himself together and thought that crypto would be the catalyst so he came to me to learn. naturally i was ecstatic, this was one of my best friends and i really enjoy teaching people things. I taught John everything i knew, how to use exchanges, how to set up a wallet, how to spot good projects, the trends of the market etc.. i spent countless hours of my personal time helping him learn basic things (he is a bit slow).</p>\n\n<p>Now, i warned John to steer clear of shitcoins. i told him that although you may get lucky and get rich quick, the chance of this happening is so low and newbies like him fall victim to these scams the most. he was very off put by this and assured me he would avoid them.</p>\n\n<p>A few weeks go buy and i received a very long message from John. He told me he was quitting crypto and he had lost all of his savings he put in. i was shocked, but as i read the message it became clear to me what had happened. he said a youtuber had basically shilled him a &#39;low market cap&#39; coin telling him he could 50x his money in a week. Yes, John fell victim to a pump and dump.</p>\n\n<p>This is where it gets worse, i replied asking why would he do this when i advised him otherwise. i got no message back, i called him a few days after and to my shock the phone would instantly hang up. John blocked me on everything, not just phone but instagram, whatsapp, facebook. i was shocked and upset, i had done nothing wrong. i asked one of our mutual friends if i could speak to John, and he told me that John wanted nothing to do with me because i had made him lose all his money,</p>\n\n<p>He didnt blame himself, or even the scammy youtuber, he blamed the person who introduced him to crypto and <strong>warned</strong> him of scams.</p>\n\n<p>It really hurts writing this knowing ive lost someone i knew for 10 years over something i didn&#39;t even do. i just tried to help.</p>\n\n<p>The moral of the story is don&#39;t advise people to get into crypto, or tell them what to invest in, friends or even family, because when shit goes south the first person they will blame is you.</p>\n</div><!-- SC_ON -->",
  "score": 15696,
  "permalink": "/r/CryptoCurrency/comments/nypc2e/introduced_my_friend_to_crypto_now_he_wont_speak/",
  "subreddit": "CryptoCurrency",
  "id": "nypc2e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009738579
}