{
  "author": "frankinreddit",
  "original_created_utc": 1651869177,
  "title": "Why does Italy seem to get a pass in WWII for be an Axis power?",
  "created_utc": 1651888461,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If I mention the Italians in WWII bombed my mom’s country non-stop for about two years and tried to starve the people there, Italian Americans look at me like I just kicked their dog, while they have no issue talking about what Germany or Japan did. In fact, in the US, it seems we acknowledge Italy was part of the Axis powers, but never talk about what they did in the war. Heck, Vichy French gets talked about more.&lt;/p&gt;\n\n&lt;p&gt;Why does Italy get a pass for WWII?&lt;/p&gt;\n\n&lt;p&gt;Edit: darn title typo. That’s what I get for posting from phone in the rain. Sorry folks.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 122,
  "permalink": "/r/AskHistorians/comments/ujwm0b/why_does_italy_seem_to_get_a_pass_in_wwii_for_be/",
  "subreddit": "AskHistorians",
  "id": "ujwm0b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If I mention the Italians in WWII bombed my mom’s country non-stop for about two\nyears and tried to starve the people there, Italian Americans look at me like I\njust kicked their dog, while they have no issue talking about what Germany or\nJapan did. In fact, in the US, it seems we acknowledge Italy…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "第二次世界大戦中、イタリア人が私の母の国を約2年間ノンストップで爆撃したことを言えば\nイタリア系アメリカ人は、私が彼らの犬を蹴ったかのような目で私を見ます。\nイタリア系アメリカ人は、ドイツや日本がやったことは平気で話すくせに、自分の犬を蹴飛ばしたような顔をするんです。\n日本がやったことは問題なく話す。実際、アメリカではイタリアを認めているようです...。",
      "title": "第二次世界大戦でイタリアが枢軸国であることを理由に免罪符をもらっているように見えるのはなぜか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我提到意大利人在二战中不停地轰炸我妈妈的国家大约两年\n试图让那里的人挨饿，美国的意大利人看我的眼神就像我刚刚踢了他们的狗。\n而他们在谈论德国或日本的所作所为时却毫不介意。\n日本的所作所为。事实上，在美国，我们似乎承认意大利...",
      "title": "为什么意大利在二战中似乎因为是轴心国而被放过了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我提到意大利人在二戰中不停地轟炸我媽媽的國家大約兩年\n試圖讓那裏的人捱餓，美國的意大利人看我的眼神就像我剛剛踢了他們的狗。\n而他們在談論德國或日本的所作所爲時卻毫不介意。\n日本的所作所爲。事實上，在美國，我們似乎承認意大利...",
      "title": "爲什麼意大利在二戰中似乎因爲是軸心國而被放過了？"
    }
  ]
}