{
  "author": "yaotard",
  "the_new_excerpt": "Opening a fixed deposit account with the bank is cool. But you can do that in\nthe cryptoworld too!\n\nFor all the newbies, I’ll try to break staking down for you. Staking is an\nalternative consensus mechanism (way to verify and secure transactions) that\nallows users to generally secure crypto networks…",
  "original_created_utc": 1619319013,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "銀行に定期預金口座を開設することは、クールなことだと思います。でも、それが暗号の世界でもできるんです\nクリプトの世界でもできます。\n\n初心者の皆さんのために、ステーキングについて説明してみましょう。ステーキングとは\n代替的なコンセンサス・メカニズム（取引の検証と安全性確保の方法）であり\n安全な暗号ネットワークを構築することができます。",
      "title": "ステーキングが新たな節約になる理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在银行开立一个定期存款账户是很酷的。但你可以在\n也可以这样做!\n\n对于所有的新手来说，我将尝试为你分解赌注。赌注是一种\n另一种共识机制（验证和保障交易的方式），允许用户普遍保障加密货币的安全。\n允许用户在一般情况下确保加密网络的安全...",
      "title": "为什么钉子是新的储蓄"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在銀行開立一個定期存款賬戶是很酷的。但你可以在\n也可以這樣做!\n\n對於所有的新手來說，我將嘗試爲你分解賭注。賭注是一種\n另一種共識機制（驗證和保障交易的方式），允許用戶普遍保障加密貨幣的安全。\n允許用戶在一般情況下確保加密網絡的安全...",
      "title": "爲什麼釘子是新的儲蓄"
    }
  ],
  "title": "Why Staking is the new Saving",
  "created_utc": 1619343845,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Opening a fixed deposit account with the bank is cool. But you can do that in the cryptoworld too!</p>\n\n<p>For all the newbies, I’ll try to break staking down for you. Staking is an alternative consensus mechanism (way to verify and secure transactions) that allows users to generally secure crypto networks with minimal energy consumption and setup. This means that you don’t have to purchase a mining rig to mine for more coins, you can just use the coins you own, lock it up (stake it) in a smart contract, and you make more coins by helping the network!</p>\n\n<p>Staking acts as a great “passive income” opportunity for those who want to support crypto networks while making mostly hands-off money. What you are doing is having different cryptos lying around in different places, all of which is generating more coins every single day, and you don’t have to do a single thing. Think of it like having multiple bank accounts and each of them are earning you a 5-10% APY every year. It really is the case, I am not trying to hype staking up. </p>\n\n<p>There is also different kinds of staking, mainly locked staking and flexible staking. Locked simply means you have to leave your crypto in there for a fixed period of time, and will be unable to withdraw it out. Flexible is straightforward, you can take it out anytime you want to. I hope I included the main things to know before jumping into staking. If anyone reading this hasn’t looked into staking yet, I highly suggest it. It is the best form of passive income in my life right now, and I hope more people start having this stream of passive income as well!</p>\n\n<p>Like the saying in this subreddit goes: Give a man a steak and he&#39;ll eat for a day. Teach a man how to stake, he&#39;ll eat forever.</p>\n</div><!-- SC_ON -->",
  "score": 300,
  "permalink": "/r/CryptoCurrency/comments/mxz880/why_staking_is_the_new_saving/",
  "subreddit": "CryptoCurrency",
  "id": "mxz880",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776208829
}