{
  "author": "Odysseus_Lannister",
  "original_created_utc": 1652848737,
  "title": "For all you hoping for tether to die a quick and spectacular death, what do you think is going to happen?",
  "created_utc": 1652899417,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Been seeing even more “rip the bandaid off” and more amateur sleuthing into how tether is worthless/smoke and mirrors. Some have gone so far to call tether a cancer that must die for crypto to ascend to some magical new ath. &lt;/p&gt;\n\n&lt;p&gt;Personally, I acknowledge that they aren’t a model coin and do have suspicious backing/audit history, but I’m not rooting for their outright implosion. I seriously think people underestimate the ripple effects throughout crypto that would happen if USDT went bust. Something like 60-70% of all BTC volume is done through USDT and it’s a massive part of crypto volume in general. It this goes up in smoke, then exchanges can go under and volume would dry up considerably. This would lead to massive price drops and liquidity crises that would give governments free reign to completely shape crypto with whatever regulations they see fit. &lt;/p&gt;\n\n&lt;p&gt;I’d prefer for USDT to slowly be replaced by USDC/DAI/etc and be less influential rather than the above scenario. Why do so many people think that USDT going bust would only cause short term pain?&lt;/p&gt;\n\n&lt;p&gt;Disclaimer: been around since 2017 and yes, I know about Mt. Gox. Something like this would be worse Imo.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 304,
  "permalink": "/r/CryptoCurrency/comments/us4w6f/for_all_you_hoping_for_tether_to_die_a_quick_and/",
  "subreddit": "CryptoCurrency",
  "id": "us4w6f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Been seeing even more “rip the bandaid off” and more amateur sleuthing into how\ntether is worthless/smoke and mirrors. Some have gone so far to call tether a\ncancer that must die for crypto to ascend to some magical new ath.\n\nPersonally, I acknowledge that they aren’t a model coin and do have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さらに多くの「絆創膏をはがす」ような行為や、素人がどのようにテザーに価値を見いだすかについて調べています。\nテザーがいかに無価値であるか、素人なりに調べています。一部の人々は、テザーは暗号が魔法のような新しい世界に昇華するために死ななければならない\n暗号が魔法のような新しい世界に昇華するためには、テザーは死ななければならない癌であるとまで言っている人もいます。\n\n個人的には、テザーがモデルコインでないことは認めますし、また、テザーには...",
      "title": "テザーの迅速かつ壮大な死を望んでいる皆さんは、何が起こると思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到了更多的 \"撕掉创可贴 \"和更多的业余侦查活动，以了解\n拴系是没有价值的/烟雾和镜子。有些人甚至称tether是一个\n癌症，为了让加密货币上升到某个神奇的新高度，必须死掉。\n\n就个人而言，我承认他们不是一个模范币，而且确实有...",
      "title": "对于所有希望系绳快速而壮观地死去的人来说，你认为会发生什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到了更多的 \"撕掉創可貼 \"和更多的業餘偵查活動，以瞭解\n拴系是沒有價值的/煙霧和鏡子。有些人甚至稱tether是一個\n癌症，爲了讓加密貨幣上升到某個神奇的新高度，必須死掉。\n\n就個人而言，我承認他們不是一個模範幣，而且確實有...",
      "title": "對於所有希望繫繩快速而壯觀地死去的人來說，你認爲會發生什麼？"
    }
  ]
}