{
  "author": "HR8614",
  "original_created_utc": 1625529412,
  "title": "How do we know the various COVID-19 Vaccines won't have complications arise in 5/10/20 years?",
  "created_utc": 1625545091,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Throwaway because &#39;no question is a stupid question&#39; doesn&#39;t exist when it comes to the vaccines, seems either you&#39;re pro or anti and any questions seem to lump you in the anti group.</p>\n\n<p>My genuine question is this, how do we know there won&#39;t be complications that arise in 10+ years? If the first vaccines have been out for a year or so and were rushed to hospitals as an emergency, surely they haven&#39;t had long term testing.</p>\n\n<p>If a medicine for the common cold came out tomorrow, but had no long term testing, I would be concerned. Theres been plenty of times that things that seemed great at the time turned out to be a problem in the future (Asbestos was great, until it wasn&#39;t. Thalidomide seemed to be the perfect way to cure morning sickness, until it caused huge complications.).</p>\n\n<p>I&#39;m in a bit of a rut, I don&#39;t believe the ridiculous conspiracies that some throw out, but how can we be sure there won&#39;t be an issue that arises in the future? Theres been plenty of medications that seem to work wonders (i.e male birth control pill) that end up failing long term trials, yet how has a vaccine made within a year and a half had that long term testing?</p>\n\n<p>Thanks for any information that can educate me further on the matter, seems it&#39;s hard to ask questions these days without running into misinformation or being labled an anti-vaxxer.</p>\n</div><!-- SC_ON -->",
  "score": 114,
  "permalink": "/r/TooAfraidToAsk/comments/oejfcm/how_do_we_know_the_various_covid19_vaccines_wont/",
  "subreddit": "TooAfraidToAsk",
  "id": "oejfcm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Throwaway because 'no question is a stupid question' doesn't exist when it comes\nto the vaccines, seems either you're pro or anti and any questions seem to lump\nyou in the anti group.\n\nMy genuine question is this, how do we know there won't be complications that\narise in 10+ years? If the first…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ワクチンに関しては、「質問は愚かな質問である」という言葉は存在しないので、投げやりになります。\nワクチンに関しては、賛成派か反対派のどちらかであり、質問をすると反対派にまとめられてしまうようです。\n賛成派か反対派のどちらかで、質問があると反対派にまとめられてしまうようです。\n\n私の純粋な疑問は、10数年後に発生する合併症がないとどうやってわかるのかということです。\n10数年後に合併症が起こらないとなぜわかるのでしょうか？もし、最初の...",
      "title": "様々なCOVID-19ワクチンが、5年後、10年後、20年後に合併症を起こさないとどうやってわかるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "扔掉是因为 \"没有问题是愚蠢的问题 \"在涉及到疫苗时并不存在。\n当涉及到疫苗时，似乎你不是赞成就是反对，任何问题似乎都会把你归入反对组。\n任何问题似乎都会把你归入反方阵营。\n\n我真正的问题是，我们怎么知道10多年后不会出现并发症？\n在10年以上的时间里出现？如果第一...",
      "title": "我们怎么知道各种COVID-19疫苗在5/10/20年内不会有并发症出现？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "扔掉是因爲 \"沒有問題是愚蠢的問題 \"在涉及到疫苗時並不存在。\n當涉及到疫苗時，似乎你不是贊成就是反對，任何問題似乎都會把你歸入反對組。\n任何問題似乎都會把你歸入反方陣營。\n\n我真正的問題是，我們怎麼知道10多年後不會出現併發症？\n在10年以上的時間裏出現？如果第一...",
      "title": "我們怎麼知道各種COVID-19疫苗在5/10/20年內不會有併發症出現？"
    }
  ]
}