{
  "author": "livhab",
  "original_created_utc": 1646632286,
  "title": "Does everyone feel like they need to make things “even” on their body?",
  "created_utc": 1646642274,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It’s kind of hard to explain, I guess like for example if I step on a crack with one foot I have to step on another crack with the other foot. And I often need to have even pressure/touch on my body on both sides, especially if I’m overstimulated. (If I don’t it feels really uncomfortable and I guess like something is wrong?) I think it all used to be worse or like more noticeable when I was a kid than it is now but I definitely do it. Anyway, does everyone do this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 131,
  "permalink": "/r/NoStupidQuestions/comments/t8icck/does_everyone_feel_like_they_need_to_make_things/",
  "subreddit": "NoStupidQuestions",
  "id": "t8icck",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It’s kind of hard to explain, I guess like for example if I step on a crack with\none foot I have to step on another crack with the other foot. And I often need\nto have even pressure/touch on my body on both sides, especially if I’m\noverstimulated. (If I don’t it feels really uncomfortable and I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "説明するのが難しいのですが、例えば、クラックを踏んだら\n片方の足で別の亀裂を踏まなければならない。そして、私はしばしば\nの場合は特に、左右の体に均等に圧力やタッチをかける必要があります。\n過度な刺激を与える。(そうでないと、とても居心地が悪くなってしまうし...。",
      "title": "皆さんは、自分の体の中で「均等」にしなければいけないと思っているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这很难解释，我想，比如说，如果我用一只脚踩在一个裂缝上，我必须用另一只脚踩在另一个裂缝上。\n我必须用另一只脚去踩另一条裂缝。而且我经常需要\n我经常需要在身体两侧有均匀的压力/触摸，特别是在我受到过度刺激的时候。\n过度刺激的时候。(如果我不这样做，就会感觉非常不舒服，我...",
      "title": "是否每个人都觉得他们需要使自己身上的东西 \"均匀\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這很難解釋，我想，比如說，如果我用一隻腳踩在一個裂縫上，我必須用另一隻腳踩在另一個裂縫上。\n我必須用另一隻腳去踩另一條裂縫。而且我經常需要\n我經常需要在身體兩側有均勻的壓力/觸摸，特別是在我受到過度刺激的時候。\n過度刺激的時候。(如果我不這樣做，就會感覺非常不舒服，我...",
      "title": "是否每個人都覺得他們需要使自己身上的東西 \"均勻\"？"
    }
  ]
}