{
  "author": "MaybeYouHaveAPoint",
  "original_created_utc": 1635199999,
  "title": "California famously enacted gun control when the Black Panthers took to carrying guns. During debate on the bill, the Panthers took guns into the chamber itself -- which seems like it would obviously cause the bill to PASS, not fail. What was their goal with that move?",
  "created_utc": 1635225711,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The Mulford Act was pretty explicitly to stop the Black Panthers from carrying guns.  And they entered the chamber &quot;to show their opposition&quot;.  But (at least in hindsight), it seems like this stunt guaranteed that the legislators would get scared of &quot;a band of armed Negroes&quot; and pass the bill BECAUSE of this event.</p>\n\n<p>Did they really think their action would make the legislatures vote it down?  Or did they <em>want</em> it to pass for some reason?  Or maybe they saw it as inevitable, with or without their demonstration?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/qfrtdd/california_famously_enacted_gun_control_when_the/",
  "subreddit": "AskHistorians",
  "id": "qfrtdd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The Mulford Act was pretty explicitly to stop the Black Panthers from carrying\nguns. And they entered the chamber \"to show their opposition\". But (at least in\nhindsight), it seems like this stunt guaranteed that the legislators would get\nscared of \"a band of armed Negroes\" and pass the bill BECAUSE…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "マルフォード法は、ブラック・パンサーが銃を持てないようにするための明確な法律でした。\nブラックパンサーが銃を携帯することを阻止するためのものだった。そして、彼らは「反対の意思を示すため」に議場に入った。しかし、（少なくとも後から考えると\nしかし（少なくとも今になってみれば）、この演出は、議員たちが「武装した黒人の一団」に怯えて\n武装した黒人の一団」に恐れをなして、法案を可決することを保証しているように思えます...。",
      "title": "カリフォルニア州では、ブラックパンサーが銃を携行するようになってから、銃規制が行われたことで有名です。法案審議の際、パンサーたちは銃を議場に持ち込んでいましたが、これでは法案が否決されるどころか、可決されるに決まっています。彼らの目的は何だったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "莫尔福德法》非常明确地是为了阻止黑豹组织携带\n枪支。而他们进入议院是为了 \"表明他们的反对\"。但是（至少在\n但（至少在事后看来），这个噱头似乎保证了立法者会被\n害怕 \"一帮武装的黑人 \"并通过该法案，因为......",
      "title": "当黑豹组织开始携带枪支时，加利福尼亚颁布了著名的枪支管制。在该法案的辩论中，黑豹组织将枪支带入会议厅本身--这看起来显然会使该法案获得通过，而不是失败。他们这样做的目的是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "莫爾福德法》非常明確地是爲了阻止黑豹組織攜帶\n槍支。而他們進入議院是爲了 \"表明他們的反對\"。但是（至少在\n但（至少在事後看來），這個噱頭似乎保證了立法者會被\n害怕 \"一幫武裝的黑人 \"並通過該法案，因爲......",
      "title": "當黑豹組織開始攜帶槍支時，加利福尼亞頒佈了著名的槍支管制。在該法案的辯論中，黑豹組織將槍支帶入會議廳本身--這看起來顯然會使該法案獲得通過，而不是失敗。他們這樣做的目的是什麼？"
    }
  ]
}