{
  "author": "Basilikon",
  "original_created_utc": 1634309384,
  "title": "THE LAST DUEL claims charges of rape in 14th century France were a species of property crime made against the husband or father of the woman. What was the legal nature of sexual assault in the high middle ages?",
  "created_utc": 1634341886,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Eric Jager&#39;s book, which provides the source, is slightly more confusing than the screenplay, saying:</p>\n\n<blockquote>\n<p>The prosecution and punishment of rape often depended on the victim’s social class and political clout. In France women convicted of lesser crimes like theft were often put to death, while many males guilty of rape escaped with a mere fine—compensation that was often paid not to the victim herself but to her father or husband, since <strong>rape counted less as sexual violence against a woman than as a property crime against her male guardian.</strong> Legal records show that clerics, men holding church office, numbered disproportionately among those accused of rape and that they often escaped serious punishment by claiming “benefit of clergy,” which entitled them to have their cases tried by the church rather than by the secular courts.</p>\n\n<p>The circumstances of the crime, including the frequent absence of any witnesses, often made a charge of rape hard to prove in a court of law. And in France the female victim, no matter what her social standing, high or low, could not bring charges in the first place without the cooperation of her husband, father, or male guardian. Many rape victims, threatened afterward by their attackers with shame and dishonor, chose to keep silent rather than risk ruining their reputation, or that of their family, by making the crime public. So if <strong>in theory rape was a serious crime for which the law provided heavy penalties, in practice it often went unpunished, unprosecuted, and even unreported.</strong></p>\n</blockquote>\n\n<p>What work is Jager&#39;s &quot;in theory&quot; doing here?  What is the nominal attitude on the books? Was it the case that it was de jure a crime against the woman but de facto treated as a crime against the man?  Or was it de jure also a crime against the man for &quot;violation of property&quot;?</p>\n\n<p>Moreover, was rape unique in that a woman was required to have her male guardian as a sponsor to bring the charge before the court, or was this a case with all criminal (or civil?) charges?</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/q8q0jb/the_last_duel_claims_charges_of_rape_in_14th/",
  "subreddit": "AskHistorians",
  "id": "q8q0jb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Eric Jager's book, which provides the source, is slightly more confusing than\nthe screenplay, saying:\n\n> The prosecution and punishment of rape often depended on the victim’s social\n> class and political clout. In France women convicted of lesser crimes like\n> theft were often put to death, while…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ソースを提供しているエリック・イェーガー氏の本は、若干混乱していますが\nと言っています。\n\n> レイプ事件の起訴と処罰は、被害者の社会的地位や政治的影響力に左右されることが多かった。\n> 階級や政治的影響力に左右されることが多かった。フランスでは、窃盗などの軽い犯罪で有罪になった女性は、しばしば刑務所に入れられた。\n> フランスでは、窃盗などの軽い罪で有罪になった女性はしばしば死刑になり、...",
      "title": "THE LAST DUEL 14世紀のフランスでは、レイプの罪は、女性の夫や父親に対する財産的な犯罪の一種であった。中世の性的暴行の法的性質はどうだったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "埃里克-贾格尔的书提供了资料来源，但比起剧本来略显混乱。\n剧本中说。\n\n> 对强奸的起诉和惩罚往往取决于受害者的社会\n> 阶级和政治势力。在法国，被判定犯有较轻罪行的妇女，如\n> 盗窃罪往往被处以死刑，而......",
      "title": "最后的决斗》称，在14世纪的法国，对强奸的指控是针对妇女的丈夫或父亲的一种财产犯罪。在中世纪早期，性侵犯的法律性质是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "埃裏克-賈格爾的書提供了資料來源，但比起劇本來略顯混亂。\n劇本中說。\n\n> 對強姦的起訴和懲罰往往取決於受害者的社會\n> 階級和政治勢力。在法國，被判定犯有較輕罪行的婦女，如\n> 盜竊罪往往被處以死刑，而......",
      "title": "最後的決鬥》稱，在14世紀的法國，對強姦的指控是針對婦女的丈夫或父親的一種財產犯罪。在中世紀早期，性侵犯的法律性質是什麼？"
    }
  ]
}