{
  "author": "Gorillahair2000",
  "original_created_utc": 1628872695,
  "title": "50 years ago today, president Nixon abolished any sense of value from money. 38 years later, Satoshi Nakamoto was able to restore value.",
  "created_utc": 1628883251,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>On the Friday afternoon of August 13th, 1971, President Nixon staged a live broadcast to temporarily (lol) cease the conversion of United States Dollars into Gold at a fixed rate set by the government. This was mainly due to the fear of countries withdrawing gold from the US Central Banks.</p>\n\n<p>We will never forget 1971. We will never forget 1987. We will never forget 2001. We will never forget 2008 and most definitely we will never forget 2020.</p>\n\n<p>You can either trust in politicians or you can trust in math.</p>\n</div><!-- SC_ON -->",
  "score": 204,
  "permalink": "/r/Bitcoin/comments/p3ot7e/50_years_ago_today_president_nixon_abolished_any/",
  "subreddit": "Bitcoin",
  "id": "p3ot7e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "On the Friday afternoon of August 13th, 1971, President Nixon staged a live\nbroadcast to temporarily (lol) cease the conversion of United States Dollars\ninto Gold at a fixed rate set by the government. This was mainly due to the fear\nof countries withdrawing gold from the US Central Banks.\n\nWe will…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1971年8月13日の金曜日の午後、ニクソン大統領は生放送を行い\n1971年8月13日金曜日の午後、ニクソン大統領は生放送を行い、政府が定めた一定のレートで米ドルを金に交換することを一時的に（笑）中止した。\n政府が設定した一定のレートで米ドルを金に交換することを一時的に（笑）中止した。これは主に、日本の金融危機を危惧してのことだった。\nこれは、各国がアメリカの中央銀行から金を引き上げることを恐れたためである。\n\n私たちは...",
      "title": "50年前の今日、ニクソン大統領は貨幣の価値観を廃止しました。それから38年後、サトシ・ナカモトが価値を取り戻すことができました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "1971年8月13日星期五下午，尼克松总统进行了一次现场直播，暂时停止了美元的兑换。\n暂时(笑)停止了将美元按固定汇率兑换成黄金的做法。\n暂时停止按政府规定的固定汇率将美元兑换成黄金。这主要是由于担心\n各国从美国中央银行提取黄金的恐惧。\n\n我们将...",
      "title": "50年前的今天，尼克松总统废除了货币的任何价值感。38年后，中本聪得以恢复价值。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "1971年8月13日星期五下午，尼克松總統進行了一次現場直播，暫時停止了美元的兌換。\n暫時(笑)停止了將美元按固定匯率兌換成黃金的做法。\n暫時停止按政府規定的固定匯率將美元兌換成黃金。這主要是由於擔心\n各國從美國中央銀行提取黃金的恐懼。\n\n我們將...",
      "title": "50年前的今天，尼克松總統廢除了貨幣的任何價值感。38年後，中本聰得以恢復價值。"
    }
  ]
}