{
  "author": "clit_or_us",
  "original_created_utc": 1643929899,
  "title": "How can I acquire moons as a lurker?",
  "created_utc": 1643949076,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I like the idea of moons although there seems to be absolutely no use for them outside of getting special features in this sub? I also don&amp;#39;t have much to contribute to the CC sub. I enjoy reading the discussions and seeing the panic/anger that ensues with the market fluctuations, but besides upvoting, I got nothing! Is there anything outside of posting/commenting that can help me get the moons that are highly sought after? I&amp;#39;m not asking for a handout here. But the fact remains: How can I go to the moon if I don&amp;#39;t have any moons?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 594,
  "permalink": "/r/CryptoCurrency/comments/sjxf29/how_can_i_acquire_moons_as_a_lurker/",
  "subreddit": "CryptoCurrency",
  "id": "sjxf29",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I like the idea of moons although there seems to be absolutely no use for them\noutside of getting special features in this sub? I also don't have much to\ncontribute to the CC sub. I enjoy reading the discussions and seeing the\npanic/anger that ensues with the market fluctuations, but besides…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ムーンは使い道がなさそうですが、私は好きです。\nこのサブの特典を得ること以外には？また、私はあまり\nCCサブに貢献する。私はディスカッションを読むのが好きで\n相場変動でパニックになるのは仕方ないとして、それ以外に...。",
      "title": "ムーンの獲得はどうすればいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我喜欢月球的想法，尽管它们似乎完全没有用途。\n除了在本子中获得特殊功能外？我也没有什么可\n对CC子集的贡献。我喜欢阅读讨论和看到\n恐慌/危险随之而来的市场波动，但除了...",
      "title": "作为一个潜伏者，我怎样才能获得月球？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我喜歡月球的想法，儘管它們似乎完全沒有用途。\n除了在本子中獲得特殊功能外？我也沒有什麼可\n對CC子集的貢獻。我喜歡閱讀討論和看到\n恐慌/危險隨之而來的市場波動，但除了...",
      "title": "作爲一個潛伏者，我怎樣才能獲得月球？"
    }
  ]
}