{
  "author": "pancakefroggy",
  "the_new_excerpt": "I ask friends and they say yes, but I ask family members and they say I’m being\nridiculous.\n\nI’m not allowed to lock doors, but my parents have padlocks on the door so I\ndon’t leave the house without them. My dad constantly screams at us for\neverything and my mom’s always mad at me for doing…",
  "original_created_utc": 1623279890,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "友人に聞くと「そうだね」と言われますが、家族に聞くと「馬鹿げている」と言われます。\nと言われてしまいます。\n\n私はドアに鍵をかけてはいけないのですが、両親はドアに南京錠をかけているので、私は南京錠なしでは家を出ません。\nそれがないと家から出られません。父はいつも何かにつけて私たちに大声で叫び、母はいつも怒っています。\n母は私が何かするといつも怒っていて・・・。",
      "title": "私は虐待を受けているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我问朋友，他们说是，但我问家人，他们说我是在做梦。\n荒唐。\n\n我不被允许锁门，但我的父母在门上挂了锁，所以我\n没有挂锁我就不会离开家。我爸爸经常对我们大喊大叫\n而我的妈妈总是对我做的事情很生气...",
      "title": "我被虐待了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我問朋友，他們說是，但我問家人，他們說我是在做夢。\n荒唐。\n\n我不被允許鎖門，但我的父母在門上掛了鎖，所以我\n沒有掛鎖我就不會離開家。我爸爸經常對我們大喊大叫\n而我的媽媽總是對我做的事情很生氣...",
      "title": "我被虐待了嗎？"
    }
  ],
  "title": "Am I being abused?",
  "created_utc": 1623288041,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I ask friends and they say yes, but I ask family members and they say I’m being ridiculous.</p>\n\n<p>I’m not allowed to lock doors, but my parents have padlocks on the door so I don’t leave the house without them. My dad constantly screams at us for everything and my mom’s always mad at me for doing something that makes me happy.</p>\n\n<p>I can’t express my own opinions without being yelled at. I’m not allowed to have friends over or talk to people that my parents haven’t met. Every time I cry, I’m yelled at and told I’m being dramatic.</p>\n\n<p>However, my parents also buy things for me, feed me, clothe me, put a roof over my head, and give me access to the internet (but they go through my search history when I get upset for any reason).</p>\n\n<p>Am I being abused, or am I just being ridiculous?</p>\n</div><!-- SC_ON -->",
  "score": 209,
  "permalink": "/r/NoStupidQuestions/comments/nw8wkg/am_i_being_abused/",
  "subreddit": "NoStupidQuestions",
  "id": "nw8wkg",
  "is_self": true,
  "media": null,
  "is_video": false
}