{
  "author": "TittiesnSteins",
  "the_new_excerpt": "So I’ve got a decent option strategy that I use on QQQ and SPY that I’ve back\ntested and to prove consistent returns, what backtesting doesn’t show is\nemotion.\n\nThe setup was placed Monday, put credit spreads on QQQ needing it to close above\n305. This was based on historical and current data,…",
  "original_created_utc": 1615040302,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我有一个体面的期权策略，我用在QQQ和SPY上，我已经背负了\n经过测试，为了证明收益的一致性，回测没有显示的是\n情绪。\n\n布置在周一，把QQQ的信用价差需要收在上面。\n305. 这是以历史和当前数据为基础的，...",
      "title": "总是交易计划。忍耐力占上风，本可挽回1100元的损失"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我有一個體面的期權策略，我用在QQQ和SPY上，我已經揹負了\n經過測試，爲了證明收益的一致性，回測沒有顯示的是\n情緒。\n\n佈置在週一，把QQQ的信用價差需要收在上面。\n305. 這是以歷史和當前數據爲基礎的，...",
      "title": "總是交易計劃。忍耐力佔上風，本可挽回1100元的損失"
    }
  ],
  "title": "Always trade the plan. Patience prevails and would’ve saved an $1100 loss",
  "created_utc": 1615056594,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I’ve got a decent option strategy that I use on QQQ and SPY that I’ve back tested and to prove consistent returns, what backtesting doesn’t show is emotion.  </p>\n\n<p>The setup was placed Monday, put credit spreads on QQQ needing it to close above 305. This was based on historical and current data, stimulus news and where the charts sat, it was a good trade. </p>\n\n<p>The week goes through, we break 305, so I exit and replace the trade -$400 loss for a 300 close. Which is fine as the gains will be $800.</p>\n\n<p>My dumb ass decides to sit and watch the market and not walk away for a few hours. QQQ breaks 300, 299, 298. I didn’t like it. It came back to 301 and I sold out at a -700 loss. </p>\n\n<p>Qqq finished the day at 308. </p>\n\n<p>My original plan, backtested, proved that this is successful 98% of the time. Guess what, it would have been successful and a clean $500 gain. Now I’m sat on an $1100 loss because I didn’t grip myself and trade the plan. </p>\n\n<p>Anyway, the funds this freed up enabled me to buy a tonne of HEXO, NIO, ENVB, and ANTX, some with options which are now ITM. It’s a shame but here we are. </p>\n\n<p>Trade the plan, have patience.</p>\n</div><!-- SC_ON -->",
  "score": 72,
  "permalink": "/r/stocks/comments/lz2g1b/always_trade_the_plan_patience_prevails_and/",
  "subreddit": "stocks",
  "id": "lz2g1b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542576973
}