{
  "author": "onestrokeimdone",
  "original_created_utc": 1636106971,
  "title": "You probably would have lost everything in the dotcom boom.",
  "created_utc": 1636155615,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sorry to break this news to you, but yes, you probably would have bought <a href=\"https://pets.com\">pets.com</a> instead of the googles or amazons of the dotcom era. We are in a different market, but people tend to be the same more or less. </p>\n\n<p>While hype is important, it can only last for so long. Everyone here probably knows a talker, someone who can really sell themselves, but when it comes time for them to perform they just don&#39;t measure up. Most crypto tokens are this way. Most crypto tokens have a rabid fan base who loves to talk about how great their token is. The token is going to be revolutionary. The token has so much potential. The token is so great that they haven&#39;t even taken 5 minutes to play its game, service, product or convince someone to even use it. </p>\n\n<p>Imagine this for a moment. There are thousands of tokens out there all vying for adoption yet nobody is actually adopting them. On the protocol level theres hundreds of tokens fighting to be the pipes and wires like the hundreds of telecom companies that came before them who now only have a few remaining and surviving. On the user level theres hundreds of tokens that cant even get 100 app store reviews or 100+ daily users.</p>\n\n<p>I challenge you to ask yourself what crypto applications do you use everyday? What crypto applications do you see your parents, grandparents, coworkers, etc using? If its a pipe or wire, then what makes it stand out from the others like the hundreds of telecom giants that failed before it?</p>\n\n<p>Theres only two crypto companies that I know of with over 50m users and the third will be hitting that in about a month or two and the fourth will hit that in probably 14 months from now. If you cant name these 4 companies or get close then theres a pretty good chance you would have never bet on the amazons or googles.</p>\n\n<p>If you are doing what everyone else is doing then you are going to be like everyone else. The people in this market who are going to be millionaires and billionaires are going to be the ones who tap the value in undervalued coins and tokens, the creators, or the ones who just see what nobody else sees. There is still insane opportunity out there hiding in plain sight. The biggest businesses in the world create the products/services you use every single day. You don&#39;t have to look far to find those &quot;hidden gems&quot; trust me on this, they are not hiding.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/qn7we2/you_probably_would_have_lost_everything_in_the/",
  "subreddit": "CryptoCurrency",
  "id": "qn7we2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Sorry to break this news to you, but yes, you probably would have bought\npets.com [https://pets.com] instead of the googles or amazons of the dotcom era.\nWe are in a different market, but people tend to be the same more or less.\n\nWhile hype is important, it can only last for so long. Everyone here…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このニュースをお伝えするのは申し訳ないのですが、そう、おそらくあなたは\npets.com [https://pets.com]を、ドットコム時代のgooglesやamazonの代わりに買っていたかもしれませんね。\n私たちは異なる市場にいますが、人々は多かれ少なかれ同じ傾向を持っています。\n\n誇大広告は重要ですが、それは長くは続かないものです。ここにいる全員が...",
      "title": "ドットコムブームの時には、おそらくすべてを失っていたでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很抱歉告诉你这个消息，但是是的，你可能会购买\npets.com [https://pets.com]，而不是网络时代的google或amazons。\n我们处在一个不同的市场，但人们往往或多或少都是一样的。\n\n虽然炒作很重要，但它只能持续这么久。这里的每个人...",
      "title": "你可能会在网络热潮中失去一切。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很抱歉告訴你這個消息，但是是的，你可能會購買\npets.com [https://pets.com]，而不是網絡時代的google或amazons。\n我們處在一個不同的市場，但人們往往或多或少都是一樣的。\n\n雖然炒作很重要，但它只能持續這麼久。這裏的每個人...",
      "title": "你可能會在網絡熱潮中失去一切。"
    }
  ]
}