{
  "author": "epicluca",
  "the_new_excerpt": "I'm doing research into DCA and think i'm along the right lines. I don't want to\nput huge amounts in yet as I'm still sort of finding my feet. Tempted to just\nflat out put $10 a week into ETH or BTC, or maybe up it to $20 and do 10 in one\nof those and 10 into (well researched) altcoins. What kind of…",
  "original_created_utc": 1620652643,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "DCAについて調べていますが、私の考えは間違っていないと思います。まだ手探りの状態なので、巨額の投資はしたくありませんが\nまだ自分の足元が見えていないので、多額の資金を投入したくありません。誘惑されます。\nETHやBTCに週に10ドル、あるいは20ドルにして、どちらかに10ドル、（よく研究されてい\nあるいは、20ドルにして、どちらかに10ドル、（よく研究された）アルトコインに10ドル入れようかと思っています。どのような...",
      "title": "1週間に10ドルを暗号に投資する価値はあるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在对DCA进行研究，认为我的思路是正确的。我不希望\n我还不想投入大量资金，因为我还在寻找自己的位置。我很想只是\n每周投入10美元到ETH或BTC中，或者增加到20美元，在其中一个中投入10个\n其中的10美元和10美元投入（经过充分研究的）替代币。什么样的...",
      "title": "每周投资10美元到加密货币中值得吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在對DCA進行研究，認爲我的思路是正確的。我不希望\n我還不想投入大量資金，因爲我還在尋找自己的位置。我很想只是\n每週投入10美元到ETH或BTC中，或者增加到20美元，在其中一箇中投入10個\n其中的10美元和10美元投入（經過充分研究的）替代幣。什麼樣的...",
      "title": "每週投資10美元到加密貨幣中值得嗎？"
    }
  ],
  "title": "Is it worth investing $10 into crypto a week?",
  "created_utc": 1620704361,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m doing research into DCA and think i&#39;m along the right lines. I don&#39;t want to put huge amounts in yet as I&#39;m still sort of finding my feet. Tempted to just flat out put $10 a week into ETH or BTC, or maybe up it to $20 and do 10 in one of those and 10 into (well researched) altcoins. What kind of strategy do you guys think is best?</p>\n\n<p>edit: I should clarify I have stable income and am already signed up to three exchanges, already have some Altcoins etc from 2018 which I&#39;ve come back to after losing interest from the crash. Deciding to give it another go now I have a stable income.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/n947sk/is_it_worth_investing_10_into_crypto_a_week/",
  "subreddit": "CryptoCurrency",
  "id": "n947sk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985992420
}