{
  "author": "NathanGorgeous",
  "the_new_excerpt": "Since last summer I'd been doing multiple buys and sells virtually every single\ntrading day. Made a lot of money doing it, but it was always so hard for me to\nbuy something and hold.\n\nBuy TSLA at $550? Sell it right after at $600 and throw it all into a random\nbiotech penny stock that would 2x the…",
  "original_created_utc": 1614920996,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "从去年夏天开始，我就开始做多笔买卖，几乎每笔买卖都是\n交易日。做的时候赚了不少钱，但对我来说总是那么难\n买点东西，然后持有。\n\n在550元买入TSLA？在600美元的时候卖出，然后把它全部扔进一个随机的\n生物技术仙股，将2倍的...",
      "title": "在过去的几周里，我学会了如何做一个投资者而不是交易者。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從去年夏天開始，我就開始做多筆買賣，幾乎每筆買賣都是\n交易日。做的時候賺了不少錢，但對我來說總是那麼難\n買點東西，然後持有。\n\n在550元買入TSLA？在600美元的時候賣出，然後把它全部扔進一個隨機的\n生物技術仙股，將2倍的...",
      "title": "在過去的幾周裏，我學會了如何做一個投資者而不是交易者。"
    }
  ],
  "title": "The past few weeks have taught me how to be an investor rather than a trader.",
  "created_utc": 1614943458,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Since last summer I&#39;d been doing multiple buys and sells virtually every single trading day. Made a lot of money doing it, but it was always so hard for me to buy something and hold. </p>\n\n<p>Buy TSLA at $550? Sell it right after at $600 and throw it all into a random biotech penny stock that would 2x the next day. That was the routine for months.</p>\n\n<p>Now? I&#39;ve been throwing every penny I reasonably can into the market and buying without any plan to sell in the short term due to the consistent red days. I&#39;m buying mostly recovery plays too. It&#39;s just funny because this climate has basically turned me into an investor rather than a day trader haha.</p>\n\n<p>*nothing here is financial advice.</p>\n</div><!-- SC_ON -->",
  "score": 181,
  "permalink": "/r/stocks/comments/ly4nd9/the_past_few_weeks_have_taught_me_how_to_be_an/",
  "subreddit": "stocks",
  "id": "ly4nd9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542576943
}