{
  "author": "BlubberWall",
  "original_created_utc": 1637814574,
  "title": "CCIP-019 - Disable Live Posts",
  "created_utc": 1637859556,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://np.reddit.com/r/CryptoCurrencyMeta/comments/p38rb2/disable_live_posts/\">Link to pre-proposal</a></p>\n\n<p><a href=\"https://np.reddit.com/r/CryptoCurrency/comments/qh2l1z/ccip019_disable_live_posts/\">Link to previous poll</a></p>\n\n<h1>Explanation for resubmission:</h1>\n\n<p>I fully understand if anyone feels they want to vote against it on principle against re-runs. </p>\n\n<p>This poll was ran last cycle. The moon threshold last time was very high from how many moons voted in the two previous rounds before it. The turn out last round did not keep pace with the threshold growth. There were 9.1M moons that voted to pass this proposal, meaning that in any other round it would have passed. With a low turn out last round, the threshold is lowered this time reflecting that. </p>\n\n<p>I truly believe that this had an overwhelming amount of community support, and just unlucky timing on when it was posted. Should this proposal fail again with a more reasonable threshold this month, I will not be re-running it in the future. </p>\n\n<h1>Summary:</h1>\n\n<p>Through my personal observations here, I have never seen a live post intentionally created and used by a non-mod. They are consistently accidently created, and can&#39;t be converted once made. I propose they be disabled overall to prevent their accidental creation.</p>\n\n<h1>Problem Statement:</h1>\n\n<p>I will be the first to admit this is not a crushing, dire issue. However, it is a consistent one. While browsing I will occasionally see live posts being made, and every single time the poster says they made a mistake and can&#39;t change it. These users tend to be newer members of the sub, and this to me doesn&#39;t seem like a good ending for their early experience posting. Live posts do not get the attention other post types receive, which can stifle legitimate questions and conversations from someone trying to get into either the sub or crypto in general.</p>\n\n<p>Going further, these posts now also will be counted against a users daily posts. Since the posters tend to be newer members, this again seems like a negative experience for newer members of the sub.</p>\n\n<p>With low user interaction, taking up one of a users three daily posts, and the almost always accidental nature of them, they seem to add nothing of value to this sub as a whole.</p>\n\n<h1>Solution:</h1>\n\n<p>Live threads should be disabled. Mods would still be able to create/use them for any planned events or other official posts. This would prevent their accidental creation, and everything associated with that as said in the problem statement</p>\n\n<h1>Concerns:</h1>\n\n<p>- Users would not be able to make live posts if they legitimately wanted to</p>\n\n<p>This is true. I would like to ask how many users have actually ever intentionally made a live post here, and had a positive enough reception to want to create another one? Could it have just been posted in the daily for the same results? The daily is itself basically a live post without officially being one. <a href=\"https://np.reddit.com/r/CryptoCurrencyMeta/comments/otdn3x/should_we_try_making_the_daily_a_live_thread/\">This pre-proposal</a> looked into changing the daily into a live post and was overwhelmingly shot down. No one seems to like live posts despite that actually being a place for one.</p>\n\n<p>For the what I believe to be very few intentional ones that I have never seen, they are very much outweighed by the accidently created ones.</p>\n\n<h1>Conclusion</h1>\n\n<p>Did I write an entire governance poll about a minor issue like this that will probably only impact a newer user once or twice overall?</p>\n\n<p>Yes.</p>\n\n<p>If I had accidently done this in one of my first few posts, It would have slightly bothered me. While its not a big issue if there is no reason for this slight annoyance to be possible, why not fix it to give new users the best chance at a positive first interaction with this sub and potentially crypto in general?</p>\n\n<p><a href=\"https://www.reddit.com/poll/r1nxe4\">View Poll</a></p>\n</div><!-- SC_ON -->",
  "score": 259,
  "permalink": "/r/CryptoCurrency/comments/r1nxe4/ccip019_disable_live_posts/",
  "subreddit": "CryptoCurrency",
  "id": "r1nxe4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Link to pre-proposal\n[https://np.reddit.com/r/CryptoCurrencyMeta/comments/p38rb2/disable_live_posts/]\n\nLink to previous poll\n[https://np.reddit.com/r/CryptoCurrency/comments/qh2l1z/ccip019_disable_live_posts/]\n\n\nEXPLANATION FOR RESUBMISSION:\n\nI fully understand if anyone feels they want to vote…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "プレプロポーザルへのリンク\n[https://np.reddit.com/r/CryptoCurrencyMeta/comments/p38rb2/disable_live_posts/]\n\n前回の投票へのリンク\n[https://np.reddit.com/r/CryptoCurrency/comments/qh2l1z/ccip019_disable_live_posts/]\n\n\n再提出の説明です。\n\n投票したいと思う人がいることは十分理解していますが...。",
      "title": "CCIP-019 - ライブ投稿の無効化"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "预案链接\n[https://np.reddit.com/r/CryptoCurrencyMeta/comments/p38rb2/disable_live_posts/]\n\n链接到以前的投票\n[https://np.reddit.com/r/CryptoCurrency/comments/qh2l1z/ccip019_disable_live_posts/]\n\n\n对重新提交的解释。\n\n如果有人觉得要投票，我完全理解...",
      "title": "CCIP-019 - 禁用实时帖子"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "預案鏈接\n[https://np.reddit.com/r/CryptoCurrencyMeta/comments/p38rb2/disable_live_posts/]\n\n鏈接到以前的投票\n[https://np.reddit.com/r/CryptoCurrency/comments/qh2l1z/ccip019_disable_live_posts/]\n\n\n對重新提交的解釋。\n\n如果有人覺得要投票，我完全理解...",
      "title": "CCIP-019 - 禁用實時帖子"
    }
  ]
}