{
  "author": "2443222",
  "the_new_excerpt": "The reason palantir was down recently was due to lockup expiration, which\nhappened on Feb 18.\n\nEarly investors and employees that hold their shares for over a decade was able\nto sell portion of their shares to buy their new shiny car, house, and/or other\nreasons, had already done so.\n\nNow is your…",
  "original_created_utc": 1614814773,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "最近palantir下跌的原因是由于锁仓到期，这\n发生在2月18日。\n\n早期的投资者和持股超过十年的员工能够\n卖出部分股票，以购买他们的新车、房子和/或其他东西。\n原因，已经这样做了。\n\n现在是你的...",
      "title": "Palantir的价值被低估了，是时候让它最终起飞了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近palantir下跌的原因是由於鎖倉到期，這\n發生在2月18日。\n\n早期的投資者和持股超過十年的員工能夠\n賣出部分股票，以購買他們的新車、房子和/或其他東西。\n原因，已經這樣做了。\n\n現在是你的...",
      "title": "Palantir的價值被低估了，是時候讓它最終起飛了。"
    }
  ],
  "title": "Palantir is undervalued and is time for it to finally take off.",
  "created_utc": 1614853563,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The reason palantir was down recently was due to lockup expiration, which happened on Feb 18.</p>\n\n<p>Early investors and employees that hold their shares for over a decade was able to sell portion of their shares to buy their new shiny car, house, and/or other reasons, had already done so.</p>\n\n<p>Now is your chance to pick up the best long term AI and data analytic company with the biggest moat in tech.</p>\n\n<p><strong>Consider these factors:</strong></p>\n\n<p>-High Growth in the hottest AI and data analytic industry.</p>\n\n<p>-Very low debt</p>\n\n<p>-Very high Gross Margin and Operating margin that keep going up as revenue increase at the same time, means that are really well run and they&#39;ll be very profitable in the future.</p>\n\n<p>-Sticky customers that include governments and big expertises.</p>\n\n<p>-Limitless use case across almost any industry. Help BP become greener. Aid in cancer research. Help prevent wildfire in california. Help distribute the vaccine for covid-19. Help prevent future pandemic and disasters. Basically limitless use cases that help any corporation or government run large amount of data to discover the truth behind their data.</p>\n\n<p>-Palantir create disruptive future software that is ready for prime time and only recently started to get adopted by large corporation.</p>\n\n<p>-Great leadership</p>\n\n<p>-Cream of the crop employees. Beat out all of the FANNG companies.</p>\n\n<p>-No real competitors. Huge moat. One of the co-founder is Peter Thiel, also a co-founder of Paypal, and the author of &quot;Zero to One&quot;. Where his philosophy is  always &quot;aim for monopoly, competition is for losers &quot;.</p>\n\n<p>-Very forward looking. They create technology not for the past, but for the future need. Karp, their CEO said their goal is to become the world most &quot;important software company&quot; in the future.</p>\n\n<p>- They are able to create test simulation on your whole companies to see how different components affect your overall business from top to bottom and see how one change can affect the entire organization.</p>\n\n<p>-Create massive value for their clients by saving cost and becoming more efficient.</p>\n\n<p>-Allow any employees from your organization to make meaningful contribution without hiring costly data scientist that only perform ad-hoc task.</p>\n\n<p>-SaaS with apollo. Apollo allow SasS to be in almost anything like a submarine, with little or unstable internet connection, harsh environments, humvees, and etc. Before Apollo everything is frozen in time with old and unsecured legacy preinstalled software.</p>\n\n<p>- Interactive and easy to use user interface that is customizable to whatever you want.</p>\n\n<p>-Can be integrated with private cloud, AWS, google cloud, hybrid cloud, etc.</p>\n\n<p>-Highest level security trusted by the government.</p>\n\n<p>-They can now massively scale their services.</p>\n\n<p>-Significantly reduced their deployment from Months down to Hours and Days.</p>\n\n<p>-Ontology create a overview and blueprint of the entire organization and see how each component interact in real-time.</p>\n\n<p>-Modular of their foundry software for small and mid-size business</p>\n\n<p>-Recent partnership with IBM increase palantir&#39;s Sales force from less than 30 to over 2000. Palantir was able to grow to ~1 Billion annually revenue with virtually no salespeople before 2020.</p>\n\n<p>-no code, abstract away time consuming processes, saving organization from hiring costly computer scientist, giving business managers/executive with no coding background, no CS degree, or no data science degree ability to contribute and make meaning decisions from the bottom up. Just like Windows did for the personal PC, Palantir is doing it for data analytics and AI. This is a big deal. The next frontier of technology after data analytics and AI, It is going to be bigger than the internet.</p>\n\n<p>-Allow data from different silos and types to flow in real-time to make better decisions. What life have taught me is that making the right decision at the right time is the most important thing in the world.</p>\n\n<p>-Constantly adding new features and making improvements to existing product line.</p>\n\n<p>- There is no doubt that big data analytics and AI is next technology that is going starting to go mainstream and is going to be a big game changers and will create massive wealth for first adaptors because it is a winner takes all market.</p>\n\n<p>The progress of technology:</p>\n\n<p>Internet-&gt;Personal PC-&gt;Web Search-&gt;Ecommerce-&gt;Social Media-&gt;Smartphone-&gt;Cyber Security-&gt;Cloud Computing-&gt;Streaming-&gt;cryptocurrency-&gt;Automation-&gt;Data Analytics-&gt;AI</p>\n\n<p>Data Analytics-&gt;AI is the last frontier and will create the most value and wealth because their application is limitless.</p>\n</div><!-- SC_ON -->",
  "score": 3517,
  "permalink": "/r/wallstreetbets/comments/lx7i43/palantir_is_undervalued_and_is_time_for_it_to/",
  "subreddit": "wallstreetbets",
  "id": "lx7i43",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542579468
}