{
  "author": "epicsaurav",
  "original_created_utc": 1624984838,
  "title": "I made an app to make people smile!",
  "created_utc": 1625002567,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently developed an app that is based around happiness and only showing positive news, as well as jokes and cute videos of animals.</p>\n\n<p>Especially during a time like this where headlines are full of negativity and millions of people struggle with their mental health, I wanted to make an app that could brighten someone&#39;s day by making them smile.</p>\n\n<p>The app uses a sentiment analysis AI algorithm that I developed to filter out the negativity and only show positive stories.</p>\n\n<p>It would mean the world to me if you could take a moment out of your day and download the app, and if anyone has any feedback I would love to hear it!</p>\n\n<p>Here is the website: <a href=\"https://lapisnews.tech/\">lapisnews.tech</a></p>\n\n<p>App Store: <a href=\"https://apps.apple.com/us/app/lapis-news-only-the-good-news/id1527590034\">https://apps.apple.com/us/app/lapis-news-only-the-good-news/id1527590034</a></p>\n\n<p>I hope you have a great day :)</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/oac0vb/i_made_an_app_to_make_people_smile/",
  "subreddit": "SideProject",
  "id": "oac0vb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I recently developed an app that is based around happiness and only showing\npositive news, as well as jokes and cute videos of animals.\n\nEspecially during a time like this where headlines are full of negativity and\nmillions of people struggle with their mental health, I wanted to make an app\nthat…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は最近、幸せをテーマにしたアプリを開発しました。\nポジティブなニュースや、ジョーク、動物のかわいい動画などを紹介するアプリを開発しました。\n\n特に今のような時期は、ニュースの見出しがネガティブなものばかりで\n何百万人もの人々が心の健康に悩んでいる今、私はこのようなアプリを作りたいと思いました。\nそれは...",
      "title": "人を笑顔にするアプリを作りました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近开发了一个基于幸福的应用程序，只显示积极的新闻以及笑话和可爱的动物视频。\n积极的新闻，以及笑话和动物的可爱视频。\n\n特别是在这样一个头条新闻充斥着消极情绪，数百万人在心理健康方面挣扎的时期。\n特别是在这样一个头条新闻充满负面情绪，数以百万计的人与他们的心理健康作斗争的时代，我想做一个应用程序\n我想做一个应用程序，...",
      "title": "我做了一个让人微笑的应用程序!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近開發了一個基於幸福的應用程序，只顯示積極的新聞以及笑話和可愛的動物視頻。\n積極的新聞，以及笑話和動物的可愛視頻。\n\n特別是在這樣一個頭條新聞充斥着消極情緒，數百萬人在心理健康方面掙扎的時期。\n特別是在這樣一個頭條新聞充滿負面情緒，數以百萬計的人與他們的心理健康作鬥爭的時代，我想做一個應用程序\n我想做一個應用程序，...",
      "title": "我做了一個讓人微笑的應用程序!"
    }
  ]
}