{
  "author": "ProfessorDifficult80",
  "original_created_utc": 1628829198,
  "title": "What Are Some Common Explanations for Germany's Ridiculous Economic Strength and Ability to Recover after Both World Wars?",
  "created_utc": 1628887102,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have quite a layman&#39;s understanding of events, but my understanding is that Germany somehow managed to become a huge economic power leading up to WW1, then somehow managed to recover to the point that it was a threat to all of Europe again in WW2, and then not only did Western Germany have an economic miracle, but even East Germany was the best off Eastern bloc economy (even despite massive reparations imposed by the USSR). And of course now anyone can see Germany&#39;s rankings on lists by GDP and other metrics today. What is Germany&#39;s &quot;secret&quot;?</p>\n\n<p>I&#39;m particularly amazed by their recovery after WW2. My understanding is that not only was their infrastructure destroyed during the war, but the East Germany in particular even had all of its heavy machinery literally confiscated by the USSR. It seems like they were starting from a point where its hard to say that they just took advantage of any infrastructure/groundwork that had been laid down beforehand. </p>\n\n<p>So what&#39;s going on? Have they just had successive governments that have always happened to pursue more sensible policy than other similarly developed countries? Are there tonnes of natural resources that give them an edge? Is there some sort of cultural explanation (which I usually find pretty dubious in these discussions, but I&#39;m open-minded about this case) behind this? And in particular I&#39;m curious if these explanations carry across the border between East and West Germany, given that both of them seemed to excel in their own ways.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/p3gdmy/what_are_some_common_explanations_for_germanys/",
  "subreddit": "AskHistorians",
  "id": "p3gdmy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have quite a layman's understanding of events, but my understanding is that\nGermany somehow managed to become a huge economic power leading up to WW1, then\nsomehow managed to recover to the point that it was a threat to all of Europe\nagain in WW2, and then not only did Western Germany have an…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の理解はかなり素人的なものですが、私の理解は以下の通りです。\nドイツは、第一次世界大戦前に何とか巨大な経済大国になり、その後、何とか回復して\n第2次世界大戦では、ヨーロッパ全体にとって脅威となるまでに回復した。\nそして、第2次世界大戦では、西ドイツだけでなく...",
      "title": "両大戦後のドイツの驚異的な経済力と回復力の共通点とは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对事件的理解相当外行，但我的理解是\n德国在第一次世界大战前以某种方式设法成为一个巨大的经济强国，然后\n某种程度上设法恢复到对整个欧洲构成威胁的地步。\n在二战中，它再次成为整个欧洲的威胁，然后，西德不仅有了一个......",
      "title": "对于德国在两次世界大战后的可笑经济实力和复苏能力，有哪些共同的解释？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對事件的理解相當外行，但我的理解是\n德國在第一次世界大戰前以某種方式設法成爲一個巨大的經濟強國，然後\n某種程度上設法恢復到對整個歐洲構成威脅的地步。\n在二戰中，它再次成爲整個歐洲的威脅，然後，西德不僅有了一個......",
      "title": "對於德國在兩次世界大戰後的可笑經濟實力和復甦能力，有哪些共同的解釋？"
    }
  ]
}