{
  "author": "BigDaddySkye",
  "original_created_utc": 1630304738,
  "title": "Why do I receive such hate from people when they learn I dislike surgically enhanced breasts?",
  "created_utc": 1630316885,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I personally just don&#39;t like fake boobs. With very few exceptions (such as drastically misshapen or dramatically different sizes &amp; medically necessary after cancer or injury)\nI would prefer to see A cups or naturally sagging DD than boob jobs. I&#39;m not saying women (or men! No hate in me) shouldn&#39;t be free to get them for their own reasons, it&#39;s just me that doesn&#39;t enjoy them.\nThank you.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/pechsh/why_do_i_receive_such_hate_from_people_when_they/",
  "subreddit": "TooAfraidToAsk",
  "id": "pechsh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I personally just don't like fake boobs. With very few exceptions (such as\ndrastically misshapen or dramatically different sizes & medically necessary\nafter cancer or injury) I would prefer to see A cups or naturally sagging DD\nthan boob jobs. I'm not saying women (or men! No hate in me) shouldn't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "個人的には偽物のおっぱいは好きじゃないんだけどね。ごく一部の例外を除いて（例えば\n癌や怪我の後に医学的に必要とされる、極端に形の悪いものや劇的に異なるサイズなどの\n癌や怪我の後で医学的に必要な場合など）ごく少数の例外を除いて、私はAカップや自然に垂れ下がったDDを見たいと思います。\nの方がいいと思います。女性（または男性！私の中では嫌いではありません）がすべきではないと言っているわけではありませんが...。",
      "title": "なぜ私は、手術で作られた胸が嫌いだと知ると、人々から憎しみを受けるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我个人就是不喜欢假胸。除了极少数例外（如\n癌症或受伤后，急剧变形或急剧变化的尺寸和医学上必要的\n癌症或受伤后，我宁愿看到A罩杯或自然下垂的DD\n而不是隆胸手术。我并不是说女人（或男人！我不讨厌）不应该...",
      "title": "为什么当人们得知我不喜欢通过手术增大的乳房时，会对我产生这样的仇恨？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我個人就是不喜歡假胸。除了極少數例外（如\n癌症或受傷後，急劇變形或急劇變化的尺寸和醫學上必要的\n癌症或受傷後，我寧願看到A罩杯或自然下垂的DD\n而不是隆胸手術。我並不是說女人（或男人！我不討厭）不應該...",
      "title": "爲什麼當人們得知我不喜歡通過手術增大的乳房時，會對我產生這樣的仇恨？"
    }
  ]
}