{
  "author": "thorosaurus",
  "original_created_utc": 1625939276,
  "title": "Just sent 5k in BTC. Network fees were $0.21, and it took less than 24 hours for confirmation. What on earth are haters complaining about?",
  "created_utc": 1625952725,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let&#39;s contrast that with the 1k dollars I just had to bank wire to China. Cost me 40 dollars in fees, and the bank said it would take three days. Not to mention I had to have all this crazy information and numbers from the factory I was ordering from, I had to call my bank and spend like 30 minutes getting everything all set up. Vs. the 30 seconds it took to scan the QR code when I sent the BTC.</p>\n\n<p>And this was on chain, using the world&#39;s most secure network with its proof of work verification system. This wasn&#39;t even using Lightning or something like that. Which don&#39;t get me wrong, that&#39;s a great service, and I fully expect that or something like it to make BTC viable for retail shopping transactions.</p>\n\n<p>But seriously, what are the haters complaining about? Why would anyone possibly want to replace BTC with some new proof of stake system that&#39;s less secure? I just can&#39;t wrap my mind around that.</p>\n</div><!-- SC_ON -->",
  "score": 300,
  "permalink": "/r/Bitcoin/comments/ohnb75/just_sent_5k_in_btc_network_fees_were_021_and_it/",
  "subreddit": "Bitcoin",
  "id": "ohnb75",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Let's contrast that with the 1k dollars I just had to bank wire to China. Cost\nme 40 dollars in fees, and the bank said it would take three days. Not to\nmention I had to have all this crazy information and numbers from the factory I\nwas ordering from, I had to call my bank and spend like 30 minutes…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "中国に銀行送金したばかりの1,000ドルと比較してみよう。費用は\n手数料は40ドルで、銀行は3日かかると言っていた。言うまでもなく\nましてや、注文先の工場からのおかしな情報や数字をすべて入手しなければならなかった。\n銀行に電話して、30分くらいかけて...。",
      "title": "BTCで5k送ったところ。ネットワーク手数料は0.21ドルで、確認には24時間もかかりませんでした。嫌われ者は一体何に文句を言っているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我们把它与我刚从银行电汇到中国的1千美元进行对比。花了\n我花了40美元的费用，而且银行说需要三天时间。更不用说\n更不用说我必须要有所有这些疯狂的信息和数字，从我的工厂订购。\n我不得不给我的银行打电话，花了大约30分钟......",
      "title": "刚刚发送了5K的BTC。网络费用为0.21美元，而且确认时间不到24小时。讨厌的人到底在抱怨什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我們把它與我剛從銀行電匯到中國的1千美元進行對比。花了\n我花了40美元的費用，而且銀行說需要三天時間。更不用說\n更不用說我必須要有所有這些瘋狂的信息和數字，從我的工廠訂購。\n我不得不給我的銀行打電話，花了大約30分鐘......",
      "title": "剛剛發送了5K的BTC。網絡費用爲0.21美元，而且確認時間不到24小時。討厭的人到底在抱怨什麼？"
    }
  ]
}