{
  "author": "spacecowboy8008",
  "the_new_excerpt": "Alright this is my first DD ever, so rip into it the best you can and tell me\nwhere I can improve.\n\n\n\nCompany description\n\nHF Foods Group is the largest Asian restaurant supplier in the United States.\nThey focus on dry and frozen goods. From their website\n(https://hffoodsgroup.com/) they supply…",
  "original_created_utc": 1614781861,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，这是我的第一个DD有史以来，所以撕裂到它最好的，你可以告诉我。\n我可以改进的地方。\n\n\n\n公司介绍\n\nHF食品集团是美国最大的亚洲餐饮供应商。\n他们专注于干货和冷冻食品。从他们的网站上可以看到\n(https://hffoodsgroup.com/) 他们提供...",
      "title": "亚洲餐厅供应商恒丰食品集团(HFFG)--DD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，這是我的第一個DD有史以來，所以撕裂到它最好的，你可以告訴我。\n我可以改進的地方。\n\n\n\n公司介紹\n\nHF食品集團是美國最大的亞洲餐飲供應商。\n他們專注於乾貨和冷凍食品。從他們的網站上可以看到\n(https://hffoodsgroup.com/) 他們提供...",
      "title": "亞洲餐廳供應商恆豐食品集團(HFFG)--DD"
    }
  ],
  "title": "Asian Restaurant supplier HF Foods Groun (HFFG) - DD",
  "created_utc": 1614823992,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Alright this is my first DD ever, so rip into it the best you can and tell me where I can improve. </p>\n\n<p>&#x200B;</p>\n\n<p>Company description</p>\n\n<p>HF Foods Group is the largest Asian restaurant supplier in the United States. They focus on dry and frozen goods. From their website (<a href=\"https://hffoodsgroup.com/\">https://hffoodsgroup.com/</a>) they supply sauces, noodles, meat, seafood, fresh produce, commodities, packaging, and more. From what I can gather, this is where your local neighborhood Chinese restaurant gets all their operating supplies from. I think of them as the Sysco of the asian food market. They operate out of 14 different distribution centers focused in the west and southeast of the United States. </p>\n\n<p>&#x200B;</p>\n\n<p>History</p>\n\n<p>It looks like they went public in 2017. Since then, two big events have happened.</p>\n\n<p>They merged with B&amp;R in June of 2019. I can’t find anything about this except that the CEO of B&amp;R became the co-CEO of HFFG.</p>\n\n<p>They were investigated for misleading shareholders by multiple attorneys between July of 2019 and May of 2020. From what I can find, the SEC has not gotten involved with this. The claim is that they spent money on things like sports cars and stuff like that. I’m pretty new to investing, so I’m not sure how common attorney investigations are or how much of a red flag they are.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Competition</p>\n\n<p>It&#39;s hard to find direct competitors who do exactly what they do on a national scale.</p>\n\n<p>CTC Food international is an Asian supply company that looks to focus on grocery stores.</p>\n\n<p>Sysco also has an Asian food supply branch, but from what I can find, it doesn&#39;t look like they are the ones supplying your strip mall Chinese restaurant. If anyone knows somewhere else Asian restaurants are getting their supplies please let me know. Has anyone here working in a Chinese restaurant and know more about suppliers?</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Ownership/Leadership</p>\n\n<p>Xiao Mou Zhang aka Peter Zhang - CEO/Director</p>\n\n<p>Peter was the CEO of B &amp; R Global Holdings before they merged. He was recently promoted from co-CEO to CEO after the voluntary resignation of Zhou Min Ni (who was the other co-CEO. This all happened around 2/25/21. He’s been in the business for 20 years, but beyond that, it’s hard to find any additional info on him. But as Oscar once said </p>\n\n<p>“Look, it doesn&#39;t take a genius to know that every organization thrives when it has two leaders. Go ahead, name a country that doesn&#39;t have two presidents. A boat that sets sail without two captains. Where would Catholicism be without the popes?”</p>\n\n<p>Russell T. Libby - Chairman of the Board</p>\n\n<p>This guy was a Sysco vet of 12 years. Straight from Business Insider </p>\n\n<p>“Russell Libby has nearly 30 years of experience in mergers and acquisitions, strategy, business development, international business, corporate governance, and corporate social responsibility. From 2007 to 2019, he held numerous leadership positions at Sysco Corp. and most recently served as the company’s executive vice president and corporate secretary.”</p>\n\n<p>He was appointed to the board in March of 2020. February 25th, 2021 he was appointed the Chairman of the Board, unanimously, taking effect immediately. </p>\n\n<p>Dr. Hong Wang - Independent Director</p>\n\n<p>This guy is a lifelong professor of business. Not much to say other than that. </p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Asian community</p>\n\n<p>I have a friend who is a realtor. She says it is common practice for Chinese customers to go with a Chinese realtor. It&#39;s extremely rare for a Chinese customer to go with a non-Chinese realtor. Now, this is just a broad generalization, but I do think this carries over into the food market. I think these Asian restaurants are going to be more likely to buy from Asian owned companies. And HFFG is an Asian managed company. </p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Industry</p>\n\n<p>Asian restaurant industry looked to be $15.4billion in 2020, with 1% growth per year over the last 5 years. No reason to think that the industry should not hold steady going forward. </p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Covid</p>\n\n<p>Covid crushed the Asian food industry. Remember when Trump was calling it the Chinavirus? From their chart, we can see they took a huge hit around that time last year. They have not rebounded at all. But if we look at sysco, we see their rebound is complete. </p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Financials </p>\n\n<p>Market cap of $386.39M</p>\n\n<p>Price/Book  is 1.12  -  Sysco is 27.53 </p>\n\n<p>Revenue % change (TTM) +95%</p>\n\n<p>Revenue Growth (last 5 years) +5.93%</p>\n\n<p>Compared to sysco, which is a terrible comparison, this stock is cheap. Revenue is growing steady.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Gross Margin (most recent Quarter) 21.08%</p>\n\n<p>Gross Margin (TTM) 20%</p>\n\n<p>Operating Margin (most recent Quarter) .88%</p>\n\n<p>Operating Margin (TTM) .46%</p>\n\n<p>So the last quarter had slightly better margin then the trailing twelve months (TTM)</p>\n\n<p>&#x200B;</p>\n\n<p>Total Debt/Equity (TTM) 39%</p>\n\n<p>They don’t have a terrible amount of debt. </p>\n\n<p>&#x200B;</p>\n\n<p>And their balance sheet - </p>\n\n<p>The last four quarters on the balance sheet have looked healthy. Their current assets cover their current liabilities. Their liabilities have been holding steady since covid hit. This shows me they were able to find capital in the short term to cover any debt. They don’t look at risk of becoming insolvent any time soon. </p>\n\n<p>&#x200B;</p>\n\n<p>Follow up questions </p>\n\n<p>Has anyone here worked in a Chinese restaurant and know more about suppliers?</p>\n\n<p>How big of a red flag are those investigations by the attorneys?</p>\n\n<p>&#x200B;</p>\n\n<p>I&#39;m not a financial person/advisor. Just thinking that I might like the stock. I do own a few shares, thinking about buying more.</p>\n</div><!-- SC_ON -->",
  "score": 50,
  "permalink": "/r/investing/comments/lwv79e/asian_restaurant_supplier_hf_foods_groun_hffg_dd/",
  "subreddit": "investing",
  "id": "lwv79e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937740765
}