{
  "author": "Repulsive-Register67",
  "original_created_utc": 1645824822,
  "title": "Sometimes HODLing is not the answer. What if had actually sold back at 60k instead of HODLing to 35k?",
  "created_utc": 1645850511,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;You would have taken great profits and also been able to buy back at a lower price.&lt;/p&gt;\n\n&lt;p&gt;I know that no one can time the market or predict it, but you simply can’t expect for prices to keep going up infinitely. At some point you’re gonna have to make the decision of taking profits and reinvesting later on when prices are down.&lt;/p&gt;\n\n&lt;p&gt;If anything, this will give you the ability to change strategies. I actually sold around 55k and slowly started seeing that Bitcoin isnt the right investment for me.&lt;/p&gt;\n\n&lt;p&gt;I started staking and went heavy on DeFi projects like AAVE since they’re the best at lending (which gave me a lot of leverage)and new ones like BitDAO which have the largest treasury in the market so the governance power behind it was strong.&lt;/p&gt;\n\n&lt;p&gt;TAKING PROFITS IS NOT SHAMEFUL.\nI don’t know why this sub treats it as a sin. Its actually smart to sell if you make an educated decision as to when.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 379,
  "permalink": "/r/CryptoCurrency/comments/t1f5oi/sometimes_hodling_is_not_the_answer_what_if_had/",
  "subreddit": "CryptoCurrency",
  "id": "t1f5oi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "You would have taken great profits and also been able to buy back at a lower\nprice.\n\nI know that no one can time the market or predict it, but you simply can’t\nexpect for prices to keep going up infinitely. At some point you’re gonna have\nto make the decision of taking profits and reinvesting later…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "大きな利益を得ることができ、また、より低い価格で買い戻すことができたはずです。\nの価格です。\n\n市場のタイミングを計ったり、予測したりすることは誰にもできません。\n価格が無限に上がり続けることを期待する。いつかは\n利益確定と再投資の判断は後回しで...。",
      "title": "HODLingが答えにならないこともある。もし、35KまでHODLINGする代わりに、60Kで実際に売り戻していたらどうだったでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你会获得巨大的利润，也能以较低的价格买回\n价格买回来。\n\n我知道没有人能够掌握市场的时间或预测它，但你根本不能\n期望价格能无限地上涨。在某些时候，你将不得不\n做出获利和以后再投资的决定......",
      "title": "有时HODLing并不是答案。如果真的在6万时卖回，而不是HODLing到3.5万呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你會獲得巨大的利潤，也能以較低的價格買回\n價格買回來。\n\n我知道沒有人能夠掌握市場的時間或預測它，但你根本不能\n期望價格能無限地上漲。在某些時候，你將不得不\n做出獲利和以後再投資的決定......",
      "title": "有時HODLing並不是答案。如果真的在6萬時賣回，而不是HODLing到3.5萬呢？"
    }
  ]
}