{
  "author": "osrs1994ranger",
  "original_created_utc": 1645276254,
  "title": "Why can't we shut down the world for 2 weeks to end covid?",
  "created_utc": 1645280954,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Why can&amp;#39;t the world just blank out for 2 weeks and solve the covid pandemic? No bills, no production, no movement (except those in hospitals and have emergency services still available). &lt;/p&gt;\n\n&lt;p&gt;Would a world-wide pause destroy the entire world for that long? Is money a driving force that is keeping the pandemic around? Could it even be enforced? &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t consider myself to be an ignorant person, but I can&amp;#39;t seem to wrap my head around why we can&amp;#39;t just end it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 155,
  "permalink": "/r/TooAfraidToAsk/comments/sw9r1l/why_cant_we_shut_down_the_world_for_2_weeks_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "sw9r1l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Why can't the world just blank out for 2 weeks and solve the covid pandemic? No\nbills, no production, no movement (except those in hospitals and have emergency\nservices still available).\n\nWould a world-wide pause destroy the entire world for that long? Is money a\ndriving force that is keeping the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜ世界は2週間もブランクがあるのに、コビドパンデミックを解決できないのでしょうか？いいえ\n請求書も、生産も、移動も（病院にいる人、緊急事態に対応できる人を除いて）ありません。\nを利用することができます。）\n\n世界的な一時停止は、そんなに長い間、全世界を破壊してしまうのでしょうか？お金というのは\nを維持する原動力となっている。",
      "title": "コビドを終わらせるために、2週間ほど世界を遮断してはどうでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为什么世界上不能有两个星期的空白，解决猫科动物大流行的问题？没有\n没有账单，没有生产，没有行动（除了那些在医院和有紧急服务的人\n服务仍然可用）。\n\n世界范围内的暂停会破坏整个世界那么久吗？钱是否是一个\n驱动力，使其保持在",
      "title": "为什么我们不能关闭世界2周来结束covid？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲什麼世界上不能有兩個星期的空白，解決貓科動物大流行的問題？沒有\n沒有賬單，沒有生產，沒有行動（除了那些在醫院和有緊急服務的人\n服務仍然可用）。\n\n世界範圍內的暫停會破壞整個世界那麼久嗎？錢是否是一個\n驅動力，使其保持在",
      "title": "爲什麼我們不能關閉世界2周來結束covid？"
    }
  ]
}