{
  "author": "LukasRaynor",
  "original_created_utc": 1639459048,
  "title": "Do people really view Christians so poorly? And why?",
  "created_utc": 1639474585,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is something I am kinda only realizing now. I guess I ignored it and don&amp;#39;t tell people I am christian, but I, a roman catholic always try to be as good a person as I can be. I try to be nice to everyone else and I try to make sure everyone else is happy. And I can say the same for the other few Christian friends I have. So why do people seem to hate the concept of Christianity and Christians so much? Genuine question out of curiosity I don&amp;#39;t want to stir the pot with this or anything.&lt;/p&gt;\n\n&lt;p&gt;Please don&amp;#39;t attack anyone!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/rg01kh/do_people_really_view_christians_so_poorly_and_why/",
  "subreddit": "TooAfraidToAsk",
  "id": "rg01kh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is something I am kinda only realizing now. I guess I ignored it and don't\ntell people I am christian, but I, a roman catholic always try to be as good a\nperson as I can be. I try to be nice to everyone else and I try to make sure\neveryone else is happy. And I can say the same for the other…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、私が今になって気づいたことなんです。私はそれを無視し\nしかし、私はローマン・カトリック教徒であり、常に良い人間であろうと努めています。\nを、出来るだけ多くすることです。他の人たちにも親切にしようと思っていますし\nを、幸せにする。そして、他の人にも同じことが言える...。",
      "title": "人々は本当にクリスチャンをそんなに悪く見ているのでしょうか？その理由は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是我现在才意识到的事情。我想我忽略了这一点，也没有\n告诉人们我是基督徒，但我，一个罗马天主教徒，总是试图成为一个尽可能好的人。\n尽量做一个好的人。我试着对其他人好，我试着确保其他人快乐。\n其他人都很开心。我也可以说其他的人也是如此。",
      "title": "人们对基督徒的看法真的这么差吗？为什么呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是我現在才意識到的事情。我想我忽略了這一點，也沒有\n告訴人們我是基督徒，但我，一個羅馬天主教徒，總是試圖成爲一個儘可能好的人。\n儘量做一個好的人。我試着對其他人好，我試着確保其他人快樂。\n其他人都很開心。我也可以說其他的人也是如此。",
      "title": "人們對基督徒的看法真的這麼差嗎？爲什麼呢？"
    }
  ]
}