{
  "author": "dmiddy",
  "original_created_utc": 1625318990,
  "title": "A Summary of “Why Proof of Stake” by Vitalik Buterin",
  "created_utc": 1625373101,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is my attempt to summarize a recent blog post by Vitalik Buterin. This is a learning exercise for myself and critiques are welcome. If you feel something can be summarized better, please comment.</p>\n\n<p><a href=\"https://vitalik.ca/general/2020/11/06/pos2020.html\">Link to the article</a> - November 2020</p>\n\n<p>&#x200B;</p>\n\n<p>3 Reasons by Proof of Stake is better for blockchain security than Proof of Work</p>\n\n<p><strong>1)</strong> <strong>More Security for the same cost</strong></p>\n\n<ul>\n<li>Compare how much it costs to attack a network per $1 per day in block rewards</li>\n<li><em>GPU-based PoW</em>\n\n<ul>\n<li>GPUs can be rented or bought, so the cost of attacking a network is the cost of renting or buying enough GPUs to outrun existing miners. </li>\n<li>This is the cheapest network to attack.</li>\n</ul></li>\n<li><em>ASIC-based PoW</em>\n\n<ul>\n<li>Like GPUs, the cost of attacking the network is the cost of buying and running an ASIC. If a 51% attack occurs and the consensus is to change the mining algorithm, the ASICs are bricked. </li>\n<li>ASICs provide more security than GPUs, but at the cost of more centralization due to high cost/access of ASICs in general</li>\n<li>This is much more expensive to attack than GPU-based</li>\n</ul></li>\n<li><em>Proof of Stake</em>\n\n<ul>\n<li>The network is more secure as more coins are deposited</li>\n<li>Deposited coins do not depreciate like ASICs</li>\n<li>Participants should be willing to pay much higher capital costs(staking their coins) for the same reward</li>\n<li>The more coins staked, the harder it is for any one actor/group of actors to garner enough to attack the network</li>\n<li>This is much more expensive to attack than ASIC-based PoW</li>\n</ul></li>\n</ul>\n\n<p><strong>2) Attacks are easier to recover from in Proof of Stake</strong></p>\n\n<ul>\n<li>If a PoW chain gets 51% attacked, the response has historically been to wait until the attacker gets bored and stops</li>\n<li>In GPU-based PoW there is no real defense against 51% attacks and a persistent attacker could render the whole chain useless.</li>\n<li>For ASIC-based PoW, the response to a 51% attack is to change the PoW algorithm, which bricks <em>every ASIC on the network.</em> The good and the bad.\n\n<ul>\n<li>This can be done only once until the network becomes GPU-based. </li>\n<li>If the attacker is motivated enough, they could then attack the network freely</li>\n</ul></li>\n<li>Proof of Stake\n\n<ul>\n<li>There are built in “slashing” mechanisms\n\n<ul>\n<li>If a nefarious actor is detected by the network, their staked coins are cut by a significant portion</li>\n<li>The community can also coordinate a user-activated soft for (UASF)</li>\n<li>No hard-fork is required</li>\n<li>Attacking the chain once will cost a lot and will not come close to destroying the chain</li>\n<li>Two attacks would cost much more as the attacker would need to buy tokens enough to replace the tokens they lost.</li>\n<li>It is asymmetric in favor of the network</li>\n</ul></li>\n</ul></li>\n</ul>\n\n<p><strong>3) Proof of stake is more decentralized than ASICs</strong></p>\n\n<ul>\n<li>GPU-based PoW is pretty decentralized as it is not very hard to get a GPU</li>\n<li>It is hard(expensive) to get ASICs in the quantity needed to compete with other miners</li>\n<li>There is the argument that, in Proof of Stake, the richer get richer\n\n<ul>\n<li>The counter is that the alternative, ASIC-based PoW, is even more tilted in favor of the rich</li>\n<li>More people will be able to run an Eth validator than will be able to amass ASICs</li>\n<li>Proof of stake is more censorship resistant as it cannot be detected based on the amount of heat/electricity being produced by GPUs/ASICs</li>\n</ul></li>\n</ul>\n\n<p><strong>Possible advantages of Proof of Work</strong></p>\n\n<ul>\n<li>Two primary genuine advantages of PoW over PoS</li>\n<li><em>PoS is a closed system</em>, <em>leading to higher wealth concentration over the long term</em>\n\n<ul>\n<li>It is much easier to delegate validating responsibilities in PoS, as it doesn’t require effort on the individual other than deciding where to stake.</li>\n<li>The response is that running a validator in Eth2 will not be overly profitable and it becomes less profitable as more validators join</li>\n<li>It would take a long time for significant concentration(100 years to double) and other things like spending the money, donating to charity, giving to children, will likely take over.</li>\n</ul></li>\n<li><em>PoS requires “weak subjectivity” and PoW doesn’t</em>\n\n<ul>\n<li><em>Weak Subjectivity</em> - the first time a node comes online, the node has to find a third-party source to determine the correct head of the chain. This could be their friend, exchanges, bad actors, etc.</li>\n<li>The response is that this level of trust is needed anyway. In BTC, for example, we trust the developers to develop.</li>\n<li>The risks to this seem much less than the rewards that PoS offers in comparison to PoW</li>\n</ul></li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/ocy3fg/a_summary_of_why_proof_of_stake_by_vitalik_buterin/",
  "subreddit": "CryptoCurrency",
  "id": "ocy3fg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is my attempt to summarize a recent blog post by Vitalik Buterin. This is a\nlearning exercise for myself and critiques are welcome. If you feel something\ncan be summarized better, please comment.\n\nLink to the article [https://vitalik.ca/general/2020/11/06/pos2020.html] -\nNovember 2020\n\n\n\n3…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、Vitalik Buterin氏が最近投稿したブログ記事を私が要約したものです。これは、私自身の学習のための\n批評も歓迎します。もしあなたが何かを\n感じたら、ぜひコメントしてください。\n\n記事へのリンク [https://vitalik.ca/general/2020/11/06/pos2020.html] - 。\n2020年11月\n\n\n\n3...",
      "title": "Vitalik Buterin氏による「Why Proof of Stake」の要約"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是我对Vitalik Buterin最近一篇博文的总结。这是一个\n我自己的学习练习，欢迎大家批评指正。如果你觉得有些东西\n可以总结的更好，请评论。\n\n文章的链接[https://vitalik.ca/general/2020/11/06/pos2020.html] -\n2020年11月\n\n\n\n3...",
      "title": "维塔利克-布特林的《为什么要进行股权证明》摘要"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是我對Vitalik Buterin最近一篇博文的總結。這是一個\n我自己的學習練習，歡迎大家批評指正。如果你覺得有些東西\n可以總結的更好，請評論。\n\n文章的鏈接[https://vitalik.ca/general/2020/11/06/pos2020.html] -\n2020年11月\n\n\n\n3...",
      "title": "維塔利克-布特林的《爲什麼要進行股權證明》摘要"
    }
  ]
}