{
  "author": "CrabCommander",
  "the_new_excerpt": "I've seen a few people throwing around the idea of a Million dollar bitcoin at\nsome point in the future. Is such a thing possible? Is there enough wealth in\nthe world to make such a thing happen? What would that even look like?\n\nWell, let's run some quick math and take a look:\n\n---------------------…",
  "original_created_utc": 1615660565,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我见过一些人抛出百万美元比特币的想法，在\n在未来的某个时刻。这样的事情有可能吗？是否有足够的财富在\n世界上有这样的事情发生吗？那会是什么样子呢？\n\n好吧，让我们快速计算一下，看一看。\n\n---------------------…",
      "title": "那么比特币的理论最大值是多少呢？通过数学分析"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我見過一些人拋出百萬美元比特幣的想法，在\n在未來的某個時刻。這樣的事情有可能嗎？是否有足夠的財富在\n世界上有這樣的事情發生嗎？那會是什麼樣子呢？\n\n好吧，讓我們快速計算一下，看一看。\n\n---------------------…",
      "title": "那麼比特幣的理論最大值是多少呢？通過數學分析"
    }
  ],
  "title": "So what is the theoretical maximum value of Bitcoin? A mathematical analysis",
  "created_utc": 1615707295,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve seen a few people throwing around the idea of a <em>Million dollar</em> bitcoin at some point in the future.  Is such a thing possible? Is there enough wealth in the world to make such a thing happen?  What would that even look like?</p>\n\n<p>Well, let&#39;s run some quick math and take a look:</p>\n\n<hr/>\n\n<h1>The Million Dollar Bitcoin</h1>\n\n<ul>\n<li><p>A <em>million dollar</em> Bitcoin would make Bitcoin&#39;s market cap of 21 Million total Bitcoins worth $21,000,000,000,000, or 21 Trillion USD.</p></li>\n<li><p>If we assume a BTC Dominance which remains at about 60%, this would make the entire Crypto Market worth 35 Trillion Dollars.</p></li>\n<li><p>The Current US Stock market has a total value of about 51 Trillion Dollars, as of December 31st, 2020 (<a href=\"https://siblisresearch.com/data/us-stock-market-value/\">Source</a>).</p></li>\n<li><p>This would put the entire Cryptocurrency Market Space at approximately 69% the value of the 2020 US Stock Market; this would be an increase of roughly 17x from the Cryptocurrency market&#39;s almost 2 Trillion Dollar current value.</p></li>\n</ul>\n\n<p>So, turns out, a <em>one-million dollar Bitcoin</em> is actually numerically rather possible, and within the realm of reality given a long enough time frame.</p>\n\n<hr/>\n\n<h1>Theoretical Maximums?</h1>\n\n<p>But let&#39;s go farther.  What other <em>huge numbers</em> would be theoretically possible for Bitcoin.  What would it look like if Cryptocurrency actually became the currency/base of value in the 21st century?</p>\n\n<p>( The following examples keep the 60% BTC Dominance rate, for the purposes of math. )</p>\n\n<ul>\n<li><p>If Crypto grows to the size of the entire 2020 US Stock market, one Bitcoin would have a price of $1,451,671.67 ( Almost 1.5 Million Dollars )</p></li>\n<li><p>If Crypto grows to the size of all stock markets in the world of 2020 (~90 Trillion), one Bitcoin would be worth $2,571,428.57 ( About 2.5 Million Dollars )</p></li>\n<li><p>If Crypto grows to the size of all &quot;money&quot; assets in the world of 2020 (~215 Trillion), one Bitcoin would be worth $6,142,857.14 ( A little over 6 Million Dollars )</p></li>\n<li><p>If Crypto somehow subsumed all value of all assets in the world of 2020, at high end estimates ( 1.2 Quadrillion USD ), one Bitcoin would be worth $34,286,714.28  ( A little over 34 Million Dollars )</p></li>\n</ul>\n\n<p>( <a href=\"https://www.thesun.co.uk/money/13497643/how-much-money-in-the-world/\">Source on worldwide money valuations</a> )</p>\n\n<p>Oh, and one last fun one:</p>\n\n<ul>\n<li>Bitcoin &#39;only&#39; has to grow to ~300,000 USD per Bitcoin in order to be worth more in market cap than the entire global banking industry of 2020.</li>\n</ul>\n\n<hr/>\n\n<h1>Closing Thoughts</h1>\n\n<p>A Million Dollar BTC is honestly a lot more &quot;realistic&quot; than I expected, with the entire crypto space not even overtaking Wall Street in value unless BTC Dominance dropped immensely.</p>\n\n<p>However, on the other hand, once you reach closer to the magical One Million Dollar mark, there&#39;s really very little room for the Crypto Market cap to grow beyond that ( comparatively ), and it would very likely represent the last &#39;order of magnitude&#39; growth BTC would see, outside of fiat inflationary reasons.  In short, returns would likely look much more like traditional stocks at that point.</p>\n\n<p>In a slightly more grounded reality, however, it seems very likely that the current ~50-100K bracket for BTC will be the last &#39;jumping off point&#39; to still see any potential for 10x returns on BTC itself (and even that represents <em>massive</em> adoption for BTC as an asset overall).  Once the price starts climbing into the $100-200k+ range, there&#39;s just not enough money sloshing around in the world of investments to see insane gains anymore.</p>\n</div><!-- SC_ON -->",
  "score": 172,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/BSdR-DFmCT2mW_48CqPopPdFmT0E_F8kyBCp1XnmQHM.jpg?auto=webp&s=fbf6642e0bf4b339c3c05df9c29d4d0f4bae0274",
          "width": 250,
          "height": 250
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/BSdR-DFmCT2mW_48CqPopPdFmT0E_F8kyBCp1XnmQHM.jpg?width=108&crop=smart&auto=webp&s=cec7183a8cfd67e803503b0afe37848d1cde2d5c",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/BSdR-DFmCT2mW_48CqPopPdFmT0E_F8kyBCp1XnmQHM.jpg?width=216&crop=smart&auto=webp&s=e07d1ebd94a0d4b58718695b066fabc4a429b14e",
            "width": 216,
            "height": 216
          }
        ],
        "variants": {},
        "id": "kNHRSE226S-2usvHYBUk4rN8aa2dTIFXRJ6OVlbA2cE"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/m4cafj/so_what_is_the_theoretical_maximum_value_of/",
  "subreddit": "CryptoCurrency",
  "id": "m4cafj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147377070
}