{
  "author": "see-the-whole-board",
  "the_new_excerpt": "If I wanted to gamble, yes gamble, and buy and hold a single genomic stock for\nthe next 5 years, which would be the least stupid choice. If you had to pick\njust 1. Suppose you had to pick (play the game with me)\n\nNVTA\nEDIT\nCRSPR\n\n\nThe World Health Organization defines genomics as the study of genes…",
  "original_created_utc": 1615762202,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "如果我想赌博，是的赌博，买入并持有一只基因组股票，以获得\n未来5年，这将是最不愚蠢的选择。如果你必须选择\n只是1.假设你要选择（和我一起玩游戏）。\n\nNVTA\n编辑\nCRSPR\n\n\n世界卫生组织将基因组学定义为对基因的研究... ...",
      "title": "如果我想赌博，是的赌博，在未来5年内买入并持有一只基因组股票，哪个是最不愚蠢的选择？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我想賭博，是的賭博，買入並持有一隻基因組股票，以獲得\n未來5年，這將是最不愚蠢的選擇。如果你必須選擇\n只是1.假設你要選擇（和我一起玩遊戲）。\n\nNVTA\n編輯\nCRSPR\n\n\n世界衛生組織將基因組學定義爲對基因的研究... ...",
      "title": "如果我想賭博，是的賭博，在未來5年內買入並持有一隻基因組股票，哪個是最不愚蠢的選擇？"
    }
  ],
  "title": "If I wanted to gamble, yes gamble, and buy and hold a single genomic stock for the next 5 years, which would be the least stupid choice?",
  "created_utc": 1615783036,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If I wanted to gamble, yes gamble, and buy and hold a single genomic stock for the next 5 years, which would be the least stupid choice. If you had to pick just 1. Suppose you had to pick (play the game with me)</p>\n\n<pre><code>NVTA\nEDIT\nCRSPR\n</code></pre>\n\n<p>The World Health Organization defines genomics as the study of genes and their functions and related techniques. Some may confuse genomics with genetics, the main difference between the two is that genetics focuses on a single gene where as genomics addresses all genes and their relationship with each other.</p>\n</div><!-- SC_ON -->",
  "score": 96,
  "permalink": "/r/stocks/comments/m56g7s/if_i_wanted_to_gamble_yes_gamble_and_buy_and_hold/",
  "subreddit": "stocks",
  "id": "m56g7s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147382527
}