{
  "author": "Chicky_Nuggy",
  "original_created_utc": 1630922514,
  "title": "HEX is an obvious scam. You should definitely avoid this coin.",
  "created_utc": 1630938835,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Google HEX scam, they have paid for them to rank in the keywords &quot;is hex a scam&quot; and &quot;hex scam&quot; what genuine brand or company would do this? Very strange. </p>\n\n<p>There&#39;s more - if you scroll further down the page you can see they have made an entire website to let us all know that HEX isn&#39;t a scam and people are just mean to them and or jealous haha, wild - see <a href=\"https://www.hexscam.com/\">here</a></p>\n\n<p>Here&#39;s a <a href=\"https://news.bitcoin.com/andreas-antonopoulos-hex-team-offered-me-10-btc-to-speak-well-of-their-token/\">TWEET</a> from a journalist where he was offered 10 BTC to say it wasn&#39;t a scam.</p>\n\n<p>Hex is an obvious Ponzi scheme and really shouldn&#39;t be allowed to operate as they let the community down as a whole and decrease the reputation of genuine projects on the market. </p>\n\n<p>Literally the 2021 Bitconnect - for those who don&#39;t know what Bitconnect was the CEO is being sued 2 billion by USA law currently <a href=\"https://finance.yahoo.com/news/north-american-bitconnect-head-pleads-140527737.html?guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAAJwgFQDVLYXfYTi9x8zHauDrP8Q99J97oa3tVLeaWXIiDbEBBz1S3P-cISDJ8HOoF2zO2PX79ddEpqyUv0_ON4nSl-g-r9KhpF5ble0OxTAEsubfODUTb8qO2kqV9NB2f3xC-5JoO9nhRgA9Z-KhIXAAcLNmS_6HeVRSQqA7ku26\">more info </a></p>\n\n<p>Tldr, don&#39;t invest in HEX, it&#39;s about as secure as having your sayings in USDT.</p>\n\n<p>EDIT: All of a sudden there has been many many comments shilling and defending the &quot;definitely not a scam coin&quot; please do your own research, a simple Google will show you many articles from respected journalists proving my point.</p>\n\n<p>EDIT 2: furthermore someone sent me screenshots of various telegram groups asking them to &quot;drown out&quot; this post with downvotes and positive comments hahaha.</p>\n</div><!-- SC_ON -->",
  "score": 239,
  "permalink": "/r/CryptoCurrency/comments/piwi1u/hex_is_an_obvious_scam_you_should_definitely/",
  "subreddit": "CryptoCurrency",
  "id": "piwi1u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Google HEX scam, they have paid for them to rank in the keywords \"is hex a scam\"\nand \"hex scam\" what genuine brand or company would do this? Very strange.\n\nThere's more - if you scroll further down the page you can see they have made an\nentire website to let us all know that HEX isn't a scam and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Google HEX scam, 彼らは \"is hex a scam \"と \"hex scam \"のキーワードでランクインするためにお金を払った。\n本物のブランドや会社がこんなことをするでしょうか？とても不思議です。\n\nさらに、このページを下にスクロールすると、HEXが詐欺であることを知らせるために、ウェブサイト全体を作っていることがわかります。\nさらにページをスクロールすると、彼らはHEXが詐欺ではないことを皆に知らせるためにウェブサイト全体を作っています。",
      "title": "HEXは明らかな詐欺です。このコインは絶対に避けるべきです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "谷歌HEX骗局，他们花钱让他们在关键词 \"HEX是骗局吗 \"中排名。\n和 \"海克斯骗局\"，哪个真正的品牌或公司会这样做？非常奇怪。\n\n还有一点--如果你进一步向下滚动页面，你可以看到他们做了一个\n整个网站让我们知道HEX不是一个骗局，而且......",
      "title": "HEX是一个明显的骗局。你绝对应该避免这种硬币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "谷歌HEX騙局，他們花錢讓他們在關鍵詞 \"HEX是騙局嗎 \"中排名。\n和 \"海克斯騙局\"，哪個真正的品牌或公司會這樣做？非常奇怪。\n\n還有一點--如果你進一步向下滾動頁面，你可以看到他們做了一個\n整個網站讓我們知道HEX不是一個騙局，而且......",
      "title": "HEX是一個明顯的騙局。你絕對應該避免這種硬幣。"
    }
  ]
}