{
  "author": "jesusvsaquaman",
  "original_created_utc": 1646737105,
  "title": "Now is the best time to create the most money, later on",
  "created_utc": 1646772126,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If you spent any time online as I do, yes I understand I have a slight social media addiction problem, you are seeing masses of people in throngs panicking and losing their sh over the current state of the market, guess what lmao, markets don&amp;#39;t just go up.&lt;/p&gt;\n\n&lt;p&gt;Literally, on every site I use, just hordes of people just throwing FUD at it, and losing their stones in the situation trying to make the best of said situations and asking for their old fiat jobs back. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/icgw0gx025m81.png?width=443&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=2a165e8b8012e2023ba20855bd7ea41940f71fe8\"&gt;https://preview.redd.it/icgw0gx025m81.png?width=443&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=2a165e8b8012e2023ba20855bd7ea41940f71fe8&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This is just a meme, but it really shows what the market sentiment is all about right now. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/1jzu70z425m81.png?width=439&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=ecdac44307f488828101e3289e65750b349268e5\"&gt;https://preview.redd.it/1jzu70z425m81.png?width=439&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=ecdac44307f488828101e3289e65750b349268e5&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s a literal analysis, the bitcoin fear and greed index, and it just shows that the market is in extreme fear. &lt;/p&gt;\n\n&lt;p&gt;It seems like almost every &amp;#39;I&amp;#39;ll buy the next dip&amp;#39; guy I know is completely out of the game where we stand. &lt;/p&gt;\n\n&lt;p&gt;I think most people don&amp;#39;t understand the value of the bear market, and how necessary and crucial it is to making any kind of long-term profit. Some cryptocurrencies will break all-time highs, but some small projects might not make it. That&amp;#39;s why it&amp;#39;s vital to place yourself where it matters. &lt;/p&gt;\n\n&lt;p&gt;For the mean time, high-risk tokens might not be your best. Most people should right now focus on stablecoins and amassing a large portion of them as the major chunk of their portfolio. It&amp;#39;s important to have fallback. Even during a bull market, you want to take profits in stablecoins. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/5kk6wws635m81.png?width=845&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=4f8acb4a5018a8b69803fb7b1665e9bb038be474\"&gt;even 4chan is feeling the heat and getting a little spooked &lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Go ahead and buy the dip&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ve been literally beckoning it all bull market, so go ahead, do something about it, this is the bear market you have been waiting for. &lt;/p&gt;\n\n&lt;p&gt;But of course, there&amp;#39;s more way than one to &amp;#39;buy the dip&amp;#39;&lt;/p&gt;\n\n&lt;p&gt;The strategy I like to make, during a bear like this one is, 50% stablecoins, 25% sure-fire bets, 20% second-tier tokens, 5% memecoins, and for this special bear I&amp;#39;ve got, USDT and UST, ETH BTC and ADA of course, MATIC CHZ, and then for the memes I&amp;#39;ve got some DOGE ELON SHIB ALICE and maybe babydoge though I&amp;#39;m still iffy on that... &lt;/p&gt;\n\n&lt;p&gt;Another good strategy, that I would literally advise to anyone, either veteran or just starting in the market is &lt;strong&gt;Dollar Cost Averaging,&lt;/strong&gt; and for most of you reading this you already know how it goes: &lt;/p&gt;\n\n&lt;p&gt;You set parameters of time and buy amount, and every recurring date you buy the same amount in stable in your accumulated coin. &lt;/p&gt;\n\n&lt;p&gt;This strategy always works because there&amp;#39;s a lot of room for error. Even if you mistime the market or miss out, you can still make it next period. Every veteran trader I know would push for it, even the addicted day-traders who need instant actions. Because, it simply works. &lt;/p&gt;\n\n&lt;p&gt;Another good way you can run the market now, is by shorting the top performers, or in this case, the worst performers, and make gains off their losses. Shorting and longing is a game of leveraging and will put you in a tug-of-war between the bears and bulls and I would not advise it for anyone, especially for those just starting or those unable to attend to the market 24/7. The bear/bull war is nasty and violent, and it&amp;#39;s stock-full of bear traps and bull long squeezes, it&amp;#39;s not a game for those who want to trade retail or put their full pledged attention upon it. &lt;/p&gt;\n\n&lt;p&gt;In the meantime, the bear market blesses you with one precious gift, a time-off. Let the market recover itself in itself, as it has always down, as it always will. There&amp;#39;s little you can about it now, so you might as well just let it run its course and set to repair and ammend. Take this as a sign for vacation, and get some well-needed rest.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 334,
  "permalink": "/r/CryptoCurrency/comments/t9ec8v/now_is_the_best_time_to_create_the_most_money/",
  "subreddit": "CryptoCurrency",
  "id": "t9ec8v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If you spent any time online as I do, yes I understand I have a slight social\nmedia addiction problem, you are seeing masses of people in throngs panicking\nand losing their sh over the current state of the market, guess what lmao,\nmarkets don't just go up.\n\nLiterally, on every site I use, just…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私のようにオンラインで時間を過ごしている人は、そう、私は少しソーシャル\nメディア中毒の問題で、大勢の人がパニックになっているのを見ている。\n市場の現状に愕然としている。\n相場は、ただ上がるだけではありません。\n\n文字通り、私が使っているすべてのサイトで、ただ...",
      "title": "今が一番お金を生み出せる時期、あとからあとから"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你像我一样花时间上网，是的，我知道我有轻微的社交媒体成瘾问题。\n媒体上瘾的问题，你会看到大量的人成群结队地惊慌失措\n并为当前的市场状况而失落，你猜怎么着？\n市场并不只是上涨。\n\n从字面上看，在我使用的每个网站上，只是...",
      "title": "现在是创造最多资金的最佳时机，以后"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你像我一樣花時間上網，是的，我知道我有輕微的社交媒體成癮問題。\n媒體上癮的問題，你會看到大量的人成羣結隊地驚慌失措\n併爲當前的市場狀況而失落，你猜怎麼着？\n市場並不只是上漲。\n\n從字面上看，在我使用的每個網站上，只是...",
      "title": "現在是創造最多資金的最佳時機，以後"
    }
  ]
}