{
  "author": "Carpathia95",
  "original_created_utc": 1640390367,
  "title": "So far-right populists like Eric Zemmour in France have described themselves as Bonaprtists, and place that ideology within the context of far-right populism and radicalism. Would the Bonapartists of the 19th century understood themselves to be far-right?",
  "created_utc": 1640431243,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Is Eric Zemmour just appropriating a tradition for far-right propaganda. Was bonapartism always placed within the French far right tradition, cause I’ve also heard of bonapartism as being placed more towards the center of the French political spectrum in the 19th century?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/rnxz9l/so_farright_populists_like_eric_zemmour_in_france/",
  "subreddit": "AskHistorians",
  "id": "rnxz9l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Is Eric Zemmour just appropriating a tradition for far-right propaganda. Was\nbonapartism always placed within the French far right tradition, cause I’ve also\nheard of bonapartism as being placed more towards the center of the French\npolitical spectrum in the 19th century?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Eric Zemmourは極右のプロパガンダのために伝統を流用しただけなのか。以前は\nボナパルティズムは常にフランスの極右の伝統の中に位置づけられています。\nボナパルティズムは、フランスの中央寄りに位置していると聞いています。\n19世紀の政治スペクトルは？",
      "title": "だから、フランスのEric Zemmourのような極右ポピュリストは、自らをボナプラティストと表現し、そのイデオロギーを極右ポピュリズムとラディカリズムの文脈の中に位置づけているのだ。19世紀のボナパルティストたちは、自分たちを極右と理解していたのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "埃里克-泽莫尔是否只是挪用了一个传统，用于极右翼宣传。是否\n波拿巴主义是否总是被置于法国极右翼的传统之中？\n因为我也听说过波拿巴主义在法国的政治光谱中更偏向于中心。\n19世纪法国政治光谱的中心？",
      "title": "因此，法国的埃里克-泽穆尔等极右民粹主义者将自己描述为波拿巴主义者，并将这种意识形态置于极右民粹主义和激进主义的背景中。19世纪的波拿巴主义者会不会把自己理解为极右派？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "埃裏克-澤莫爾是否只是挪用了一個傳統，用於極右翼宣傳。是否\n波拿巴主義是否總是被置於法國極右翼的傳統之中？\n因爲我也聽說過波拿巴主義在法國的政治光譜中更偏向於中心。\n19世紀法國政治光譜的中心？",
      "title": "因此，法國的埃裏克-澤穆爾等極右民粹主義者將自己描述爲波拿巴主義者，並將這種意識形態置於極右民粹主義和激進主義的背景中。19世紀的波拿巴主義者會不會把自己理解爲極右派？"
    }
  ]
}