{
  "author": "nafizzaki",
  "the_new_excerpt": "THE BULL CASE\n\n 1.  WMT has partnered with Shopify. Thousands of sellers from that platform\n     would join in Walmart Marketplace, which would help increase traffic and\n     generate more revenue from fees and selling its own product.\n 2.  Walmart is speculated to open some forms of banking service…",
  "original_created_utc": 1615385198,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "牛市案例\n\n 1.  WMT已经与Shopify合作。该平台的数千名卖家\n     将加入沃尔玛市场，这将有助于增加流量和。\n     通过收费和销售自己的产品获得更多的收入。\n 2.  沃尔玛被猜测将开设一些形式的银行服务...",
      "title": "沃尔玛(WMT)。即将到来的1T市值的股票"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "牛市案例\n\n 1.  WMT已經與Shopify合作。該平臺的數千名賣家\n     將加入沃爾瑪市場，這將有助於增加流量和。\n     通過收費和銷售自己的產品獲得更多的收入。\n 2.  沃爾瑪被猜測將開設一些形式的銀行服務...",
      "title": "沃爾瑪(WMT)。即將到來的1T市值的股票"
    }
  ],
  "title": "Walmart(WMT): The upcoming $1T market cap stock",
  "created_utc": 1615396072,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>The bull case</h1>\n\n<ol>\n<li>WMT has partnered with Shopify. Thousands of sellers from that platform would join in Walmart Marketplace, which would help increase traffic and generate more revenue from fees and selling its own product.</li>\n<li>Walmart is speculated to open some forms of banking service which will help bank the millions of unbanked in USA.</li>\n<li>Walmart&#39;s partnership with Instacart and ThreadUp will help it create a dominating position in the online grocery market for the former partnership and a good positioning for high end clothes for the latter partnership.</li>\n<li>Walmart&#39;s positioning in India through Flipkart was a genius deal in hindsight. This is only the beginning for the Indian market so we can expect huge growth in Flipkart. There could be a time where Flipkart could become the most important part of Walmart.</li>\n<li>Walmart&#39;s expansion in Africa and China is also noticeable.</li>\n<li>My own DCF estimates point out that Walmart is at least 10% off from its fair value, without taking most of the growth factors out of the equation(mostly, due to them being incredibly hard to actually give a value) and using fairly conservative estimates.</li>\n<li>Walmart+(recently launched) and Sam&#39;s Club could have a further good impact on its bottom line.</li>\n<li>Recent venture by Walmart to launch a fintech startup shows that management is hungry for growth. They are also launching it just like a startup.</li>\n<li>Walmart&#39;s management has shown good competency unlike most of the companies at this stage as a business. They are integrating various services somewhat like Amazon and this is very bullish.</li>\n<li>There is the possibility of multiple expansion in Walmart.</li>\n<li>Walmart is also setting up for more automation in its supply chain. And this will ultimately reduce cost and increase its margin.</li>\n<li>Lotto ticket case. Walmart cancels its dividends and says they are focusing on growth and are a tech company.</li>\n</ol>\n\n<h1>Bear case</h1>\n\n<ol>\n<li>The various expansions and investments Walmart is making is very expensive in their very nature so one might say this is negative if they fail to succeed in their ventures.</li>\n<li>Raising of minimum wage will also impact its bottom line(although I tried to take that into account in my valuation).</li>\n<li>Redditors with huge disposable income may not like Walmart as a company because of moral relativism and herd mentality.</li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 187,
  "permalink": "/r/investing/comments/m1y7yy/walmartwmt_the_upcoming_1t_market_cap_stock/",
  "subreddit": "investing",
  "id": "m1y7yy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542575837
}