{
  "author": "digit_lol",
  "the_new_excerpt": "Hi all. This kind of goes against my better judgement, as I know there are lots\nof posts like this and it can come across as braggy, cringey etc.\n\nNone of my friends or family know much/anything about crypto, and I really\nwanted to share this with someone.\n\nThe start of the year has been really…",
  "original_created_utc": 1614686817,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。这有点违背我的判断，因为我知道有很多的\n这样的帖子，它可能会被视为吹嘘，畏缩等。\n\n我的朋友或家人都不了解加密技术，而我也不知道该怎么做。\n想和大家分享一下。\n\n今年的开年真的是... ...",
      "title": "用加密货币的钱给我的伴侣买了一枚订婚戒指。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。這有點違揹我的判斷，因爲我知道有很多的\n這樣的帖子，它可能會被視爲吹噓，畏縮等。\n\n我的朋友或家人都不瞭解加密技術，而我也不知道該怎麼做。\n想和大家分享一下。\n\n今年的開年真的是... ...",
      "title": "用加密貨幣的錢給我的伴侶買了一枚訂婚戒指。"
    }
  ],
  "title": "Bought my partner an engagement ring with money from crypto",
  "created_utc": 1614704444,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi all. This kind of goes against my better judgement, as I know there are lots of posts like this and it can come across as braggy, cringey etc.</p>\n\n<p>None of my friends or family know much/anything about crypto, and I really wanted to share this with someone.</p>\n\n<p>The start of the year has been really difficult, but being able to get the ring my partner deserves really helps.</p>\n\n<p>As a slight side-note – I know the thing around here is to HODL like your life depends on it, but it’s really rewarding to set a target and reach it (even if it’s relatively small).</p>\n\n<p>The crypto space is so volatile, you’re really not making the most of it constantly holding through spikes.</p>\n\n<p>Anyway, thanks for all the advice on here – I wouldn’t have felt comfortable investing without the support places like this provide.</p>\n\n<p>And sorry again for the cringey af post.</p>\n</div><!-- SC_ON -->",
  "score": 430,
  "permalink": "/r/CryptoCurrency/comments/lw0i5p/bought_my_partner_an_engagement_ring_with_money/",
  "subreddit": "CryptoCurrency",
  "id": "lw0i5p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937738016
}