{
  "author": "your_local_librarian",
  "the_new_excerpt": "Edit: Thank you to everyone who has posted. I have had an unhealthy obsession\nwith dying since I stood over my dad as he left us. I'm trying to work through\nthis with my therapist, but it is difficult.\n\nI am going to cut out the junk and begin walking. It's a start, right?\n\nI appreciate all of the…",
  "original_created_utc": 1613881893,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：谢谢各位发帖的朋友。我有一个不健康的困扰\n自从爸爸离开我们时我站在他身旁，我就知道了他的死。我试图通过工作\n这与我的治疗师，但它是困难的。\n\n我打算把这些垃圾扔掉，然后开始走路。这是一个开始，对吗？\n\n我很感激所有的...",
      "title": "对我来说是不是太晚了？我今年就40岁了 我爸爸53岁时死于心脏病。我的身体状况比他在我这个年纪时差多了。我肥胖，我一直久坐不动，我的饮食一直是最差的。如果我现在开始，我可以扭转伤害，活得更久吗？还是真的为时已晚？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：謝謝各位發帖的朋友。我有一個不健康的困擾\n自從爸爸離開我們時我站在他身旁，我就知道了他的死。我試圖通過工作\n這與我的治療師，但它是困難的。\n\n我打算把這些垃圾扔掉，然後開始走路。這是一個開始，對嗎？\n\n我很感激所有的...",
      "title": "對我來說是不是太晚了？我今年就40歲了 我爸爸53歲時死於心臟病。我的身體狀況比他在我這個年紀時差多了。我肥胖，我一直久坐不動，我的飲食一直是最差的。如果我現在開始，我可以扭轉傷害，活得更久嗎？還是真的爲時已晚？"
    }
  ],
  "title": "Is it too late for me? I will turn 40 this year. My dad died at 53 of a heart attack. I'm in much worse shape than he was at my age. I'm obese, I've been sedentary, my diet has been the worst. If I were to start now, can I reverse damage done, and live longer? Or is it truly too late?",
  "created_utc": 1613911237,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Edit: Thank you to everyone who has posted. I have had an unhealthy obsession with dying since I stood over my dad as he left us. I&#39;m trying to work through this with my therapist, but it is difficult.</p>\n\n<p>I am going to cut out the junk and begin walking. It&#39;s a start, right?</p>\n\n<p>I appreciate all of the helpful people here on reddit. Thank you.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/lop0bx/is_it_too_late_for_me_i_will_turn_40_this_year_my/",
  "subreddit": "NoStupidQuestions",
  "id": "lop0bx",
  "is_self": true,
  "media": null,
  "is_video": false
}