{
  "author": "Six_Blind_Men",
  "original_created_utc": 1630282253,
  "title": "What if you walked around with your net worth floating over your head?",
  "created_utc": 1630291224,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hear me out. I kind of feel like the moons display makes shit really awkward. I think it also detracts from conversation. It’s hard to create a community when the disparity is so obvious. Being human, my eyes are instantly drawn to the moon display, and to be honest, I don’t really want to think about moons when commenting, upvoting, or posting. This is to say that the moons display kind of sucks. I think the visual is making people too focused on the amount of moons they can make, and it makes people afraid to post unpopular thoughts. It’s also a security risk. Imagine if your net worth was posted over your head everywhere you went. It would be pretty fucking distracting to all involved. Can we propose some kind of amendment to get rid of this shiz? Does anyone actually like it? Thank you for your thoughts in advance.</p>\n</div><!-- SC_ON -->",
  "score": 269,
  "permalink": "/r/CryptoCurrency/comments/pe70f2/what_if_you_walked_around_with_your_net_worth/",
  "subreddit": "CryptoCurrency",
  "id": "pe70f2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hear me out. I kind of feel like the moons display makes shit really awkward. I\nthink it also detracts from conversation. It’s hard to create a community when\nthe disparity is so obvious. Being human, my eyes are instantly drawn to the\nmoon display, and to be honest, I don’t really want to think…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の話を聞いてください。月の表示があると、なんだかとても気まずい感じがします。I\n会話の妨げにもなっていると思います。格差が明らかな場合、コミュニティを作るのは難しいです。\nコミュニティを作るのは難しいと思います。人間である以上、私はすぐに月の表示に目がいきます。\n正直なところ、あまり考えたくはないのですが・・・。",
      "title": "もし、自分の純資産を頭の上に浮かべて歩いていたらどうでしょう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "听我说完。我有点觉得月亮的显示让事情变得非常尴尬。I\n我认为这也会影响到对话。当差距如此明显时，很难创造一个社区。\n差异是如此明显。作为人类，我的眼睛立刻被月亮显示所吸引。\n月亮显示，而且说实话，我真的不想去想...",
      "title": "如果你走在路上，你的净资产漂浮在你的头顶上，会怎么样？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "聽我說完。我有點覺得月亮的顯示讓事情變得非常尷尬。I\n我認爲這也會影響到對話。當差距如此明顯時，很難創造一個社區。\n差異是如此明顯。作爲人類，我的眼睛立刻被月亮顯示所吸引。\n月亮顯示，而且說實話，我真的不想去想...",
      "title": "如果你走在路上，你的淨資產漂浮在你的頭頂上，會怎麼樣？"
    }
  ]
}