{
  "author": "Bouby6Killer",
  "original_created_utc": 1629923971,
  "title": "NEVER tell ANYONE you're in Crypto...",
  "created_utc": 1629952243,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just a reminder. Crypto is your secret garden. Talking about it will bring you problems for sure.</p>\n\n<p>- Family / Parents : they&#39;ll consider you&#39;re wasting money, and maybe fear you&#39;ll end with financial difficulties. Furthermore, they won&#39;t give you money anymore so that you don&#39;t invest it in wind !</p>\n\n<p>- Girlfriend / Boyfriend : considering you can speculate with your money, you must be rich, so you can pay for everything = restaurants, shopping, bills...</p>\n\n<p>- Friends / Colleagues : they&#39;ll make fun of you each time market dumps, and will envy you if you make profits.</p>\n\n<p>- Internet &quot;friends&quot; / Social Medias : this is just the best place to trigger hacker&#39;s interest...</p>\n\n<p>Besides, don&#39;t incite your entourage to invest in crypto.<br/>\nYou&#39;ll be held responsible for any loss, and probably won&#39;t be thanked for gains.</p>\n\n<p>If someone asks you, ok, but first decline any responsibility !<br/>\nNewcomers can take bad decisions in a hurry and sell everything at loss...</p>\n</div><!-- SC_ON -->",
  "score": 177,
  "permalink": "/r/CryptoCurrency/comments/pbjwp6/never_tell_anyone_youre_in_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "pbjwp6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Just a reminder. Crypto is your secret garden. Talking about it will bring you\nproblems for sure.\n\n- Family / Parents : they'll consider you're wasting money, and maybe fear\nyou'll end with financial difficulties. Furthermore, they won't give you money\nanymore so that you don't invest it in wind !\n\n…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "念のため。Cryptoはあなたの秘密の花園です。その話をすると、必ず問題が\n間違いなく問題になります。\n\n- 家族 / 両親 : 彼らはあなたがお金を無駄にしていると考え、おそらくあなたが経済的に困難な状況に陥ることを恐れるでしょう。\n経済的に困ることになるのではないかと心配するでしょう。さらに、あなたが投資をしないように、もうお金を渡さないでしょう。\n風に投資しないようにと、お金をくれなくなるかもしれません。\n\n...",
      "title": "暗号をやっていることは誰にも言ってはいけない..."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "只是提醒一下。Crypto是你的秘密花园。谈论它将给你带来\n问题，这是肯定的。\n\n- 家庭/父母：他们会认为你在浪费钱，也许会担心\n你会以经济困难而告终。此外，他们不会再给你钱\n这样你就不会把钱投资在风上了。\n\n...",
      "title": "永远不要告诉任何人你在做加密货币..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "只是提醒一下。Crypto是你的祕密花園。談論它將給你帶來\n問題，這是肯定的。\n\n- 家庭/父母：他們會認爲你在浪費錢，也許會擔心\n你會以經濟困難而告終。此外，他們不會再給你錢\n這樣你就不會把錢投資在風上了。\n\n...",
      "title": "永遠不要告訴任何人你在做加密貨幣..."
    }
  ]
}