{
  "author": "hootmoney0",
  "the_new_excerpt": "Almost all “investing advice” are just get rich quick mania advice. Very few\ntiktoks explain compound interest or index fund investing. Most commonly\nrecommended stocks are all super high IV stocks like NIO, PLTR, QS etc. I may\nhave seen 50 tiktoks saying to invest in Dogecoin and that it’ll go to…",
  "original_created_utc": 1609737681,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "几乎所有的“投资建议”都是快速致富的狂热建议。很少\nTiktoks解释了复利或指数基金投资。最常见的\n推荐的股票都是超高IV股票，如nio，pltr，qs等。我可能\n我已经看到50个Tiktok说要投资于Dogecoin，它将捐给…",
      "title": "我刚刚下载了TikTok，哇，那些孩子们将在他们的投资之旅中学到一些艰难的教训"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾乎所有的“投資建議”都是快速致富的狂熱建議。很少\nTiktoks解釋了複利或指數基金投資。最常見的\n推薦的股票都是超高IV股票，如nio，pltr，qs等。我可能\n我已經看到50個Tiktok說要投資於Dogecoin，它將捐給…",
      "title": "我剛剛下載了TikTok，哇，那些孩子們將在他們的投資之旅中學到一些艱難的教訓"
    }
  ],
  "title": "I just downloaded TikTok and WOW those kids are going to learn some tough lessons on their investing journeys",
  "created_utc": 1609768367,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Almost all “investing advice” are just get rich quick mania advice. Very few tiktoks explain compound interest or index fund investing. Most commonly recommended stocks are all super high IV stocks like NIO, PLTR, QS etc. I may have seen 50 tiktoks saying to invest in Dogecoin and that it’ll go to $1 a coin. People think that Bitcoin is going to straight shot to $400k and replace gold without any corrections. Almost all the tips on real estate investing is solely wholesaling. No advice on how to secure an FHA loan on a rental property and refinancing etc. There were diamonds in a rough but very few. I hope kids aren’t going all in on Dogecoin thinking it’ll 100x. Times are changing though and maybe this is signaling a shift in investing overall in the future. Time will tell, I don’t want to sit here and say they’re dumb because that would be ignorant. What do you think we can learn from this?</p>\n</div><!-- SC_ON -->",
  "score": 90,
  "permalink": "/r/investing/comments/kq21ed/i_just_downloaded_tiktok_and_wow_those_kids_are/",
  "subreddit": "investing",
  "id": "kq21ed",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100747521
}