{
  "author": "NotRandyRandom",
  "the_new_excerpt": "this is in no way shape or form a good idea, just thought i'd post this here\nbecause it's 6am and im doing fucking math on reddit crypto lmao.\n\n\n\nAnyways, right now a moon is worth about 8 cents. If you wanted to replace your\nfull time job with raking in moons on reddit, it would take a lot of time…",
  "original_created_utc": 1619346641,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは決して良いアイデアではありませんが、ただここに投稿しようと思いました。\n朝の6時にRedditの暗号で計算しているところです。\n\n\n\nとにかく、現在、月の価値は約8セントです。もし、あなたがフルタイムの仕事を\nフルタイムの仕事をRedditで月を稼ぐことに置き換えるとしたら、かなりの時間がかかるでしょう...",
      "title": "フルタイムの仕事をReddit MOONsに置き換えるためのガイド"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这绝不是一个好主意，只是觉得我应该把它贴在这里\n因为现在是早上6点，我在reddit crypto上做该死的数学题，笑。\n\n\n\n总之，现在一个月亮的价值约为8美分。如果你想取代你的\n全职工作，在reddit上赚取月亮，这将需要大量的时间......",
      "title": "用Reddit MOON取代你的全职工作的指南"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這絕不是一個好主意，只是覺得我應該把它貼在這裏\n因爲現在是早上6點，我在reddit crypto上做該死的數學題，笑。\n\n\n\n總之，現在一個月亮的價值約爲8美分。如果你想取代你的\n全職工作，在reddit上賺取月亮，這將需要大量的時間......",
      "title": "用Reddit MOON取代你的全職工作的指南"
    }
  ],
  "title": "A guide to replacing your full time job with Reddit MOONs",
  "created_utc": 1619364711,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>this is in no way shape or form a good idea, just thought i&#39;d post this here because it&#39;s 6am and im doing fucking math on reddit crypto lmao.</p>\n\n<p>&#x200B;</p>\n\n<p>Anyways, right now a moon is worth about 8 cents. If you wanted to replace your full time job with raking in moons on reddit, it would take a lot of time and effort but here we go.</p>\n\n<p>The average hourly wage in the USA is ~$15. This means that at that wage you are making about 31,000 dollars a year. Now, going off of the math of 1 upvote = 0.48 moons (credit to <a href=\"/u/pkg322\">/u/pkg322</a> because i saw that on one of their comments.), this means that 1 upvote is just under 4 cents.</p>\n\n<p>Now, your yearly wage of 31,000 dollars divided by 8 cents (1 moon) means that you would need to acquire a total of 387,500 moons per year in order to sustainably replace your full time job. This is also equivalent to...</p>\n\n<p>- 32,291.67 moons per MONTH</p>\n\n<p>- 1061.64 moons per DAY</p>\n\n<p>- 44.24 moons per HOUR</p>\n\n<p>&#x200B;</p>\n\n<p>This also means that you need ~90 upvotes per hour to replace your full time job.</p>\n\n<p>have fun with this knowledge bois</p>\n\n<p>Update: haha, 30 upvotes in the past hour.. that&#39;s like a whole moon.. my ploy to become the greatest moon farmer is coming to fruition!</p>\n</div><!-- SC_ON -->",
  "score": 2742,
  "permalink": "/r/CryptoCurrency/comments/my5mdk/a_guide_to_replacing_your_full_time_job_with/",
  "subreddit": "CryptoCurrency",
  "id": "my5mdk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776210449
}