{
  "author": "Silas_Of_The_Lambs",
  "the_new_excerpt": "For more context, prior to his mission to interdict slavers off the coast of\nBenin, Aubrey had been sort of tepidly in favor of slavery. He often quoted his\nhero, Lord Nelson, to the effect that the abolition of slavery would be\ntantamount to the abolition of the Royal Navy (did Nelson actually say…",
  "original_created_utc": 1613194056,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "更多的背景是，在他执行任务拦截奴隶贩子之前，他的任务是在美国的沿海地区。\n贝宁，奥布里对奴隶制的支持算是淡淡的。他经常引用他的\n英雄纳尔逊勋爵，大意是，废除奴隶制将是一个很好的选择。\n等于废除皇家海军（纳尔逊真的说过......）。",
      "title": "小说中的杰克-奥布里上尉，RN，捕获了一艘奴隶船，并被他发现的条件所震惊，他把船长和军官锁在船上，然后让他的中队用它来进行炮击练习，直到它沉没。英国皇家海军对他们俘虏的奴隶贩子是否非常苛刻？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "更多的背景是，在他執行任務攔截奴隸販子之前，他的任務是在美國的沿海地區。\n貝寧，奧布里對奴隸制的支持算是淡淡的。他經常引用他的\n英雄納爾遜勳爵，大意是，廢除奴隸制將是一個很好的選擇。\n等於廢除皇家海軍（納爾遜真的說過......）。",
      "title": "小說中的傑克-奧布里上尉，RN，捕獲了一艘奴隸船，並被他發現的條件所震驚，他把船長和軍官鎖在船上，然後讓他的中隊用它來進行炮擊練習，直到它沉沒。英國皇家海軍對他們俘虜的奴隸販子是否非常苛刻？"
    }
  ],
  "title": "The fictional Captain Jack Aubrey, RN, captures a slave ship and is so appalled by the conditions he finds that he chains the captain and officers to the ship and then has his squadron use it for gunnery practice until it sinks. Were the Royal Navy very harsh with slave traders they captured?",
  "created_utc": 1613205596,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For more context, prior to his mission to interdict slavers off the coast of Benin, Aubrey had been sort of tepidly in favor of slavery. He often quoted his hero, Lord Nelson, to the effect that the abolition of slavery would be tantamount to the abolition of the Royal Navy (did Nelson actually say this?). However, after seeing it in person, he is sickened and furious and much more enthusiastic about his mission to hinder the slave trade, and to make his point he treats the captured vessel as described.   </p>\n\n<p>Many events in the Aubrey-Maturin series are at least loosely based on real-life events. How realistic is this one?</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/AskHistorians/comments/liu41i/the_fictional_captain_jack_aubrey_rn_captures_a/",
  "subreddit": "AskHistorians",
  "id": "liu41i",
  "is_self": true,
  "media": null,
  "is_video": false
}