{
  "author": "_sweetiebuns_",
  "original_created_utc": 1644526566,
  "title": "If gender isn't real, why have we created even more genders for it?",
  "created_utc": 1644536610,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Such as &amp;quot;demiboy/girl&amp;quot;, &amp;quot;neutrois&amp;quot;, &amp;quot;genderfluid&amp;quot;, &amp;quot;[noun]gender&amp;quot;. I thought gender was a concept we used back when our gender coincided with some sort of societal role (as well as the aesthetics that come with that role). &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going to be honest, I&amp;#39;ve never felt my gender before. I don&amp;#39;t even know what I should even look for in my mind to find my gender. I am biologically female but I have never FELT female. I only acknowledge my sex when its brought up.&lt;/p&gt;\n\n&lt;p&gt;And whenever I ask this question a lot of people say its a matter of feeling feminine or masculine, but that makes ZERO sense since I have seen people who identify as women be masculine, and people who identify as men be feminine. &lt;/p&gt;\n\n&lt;p&gt;What constitutes a gender? Why is any gender valid? Why shouldn&amp;#39;t we throw the whole thing out?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/spguco/if_gender_isnt_real_why_have_we_created_even_more/",
  "subreddit": "TooAfraidToAsk",
  "id": "spguco",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Such as \"demiboy/girl\", \"neutrois\", \"genderfluid\", \"[noun]gender\". I thought\ngender was a concept we used back when our gender coincided with some sort of\nsocietal role (as well as the aesthetics that come with that role).\n\nI'm going to be honest, I've never felt my gender before. I don't even know…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、「demiboy/girl」、「neutrois」、「genderfluid」、「[noun]gender」です。私は\nジェンダーは、自分の性別がある種のものと一致するときに使う概念です。\n社会的な役割（と、その役割に伴う美的感覚）。\n\n正直に言うと、私は今まで自分の性別を感じたことがないんです。わからないくらい・・・。",
      "title": "もし性別が実在しないのなら、なぜ私たちはさらに多くの性別を作り出してしまったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如 \"demiboy/girl\"、\"neutrois\"、\"genderfluid\"、\"[noun]gender\"。我以为\n性别是一个概念，当我们的性别与某种社会角色相吻合的时候，我们就会使用这个概念。\n社会角色（以及与该角色有关的美学）。\n\n老实说，我以前从未感觉到自己的性别。我甚至不知道...",
      "title": "如果性别不是真的，为什么我们还要为它创造更多的性别？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如 \"demiboy/girl\"、\"neutrois\"、\"genderfluid\"、\"[noun]gender\"。我以爲\n性別是一個概念，當我們的性別與某種社會角色相吻合的時候，我們就會使用這個概念。\n社會角色（以及與該角色有關的美學）。\n\n老實說，我以前從未感覺到自己的性別。我甚至不知道...",
      "title": "如果性別不是真的，爲什麼我們還要爲它創造更多的性別？"
    }
  ]
}