{
  "author": "daybreaker17",
  "the_new_excerpt": "This sincerely is a bit distressing because I put a fair bit of money some time\nago (hundreds of dollars each into diff stocks, not thousands or tens of\nthousands like some people on here so easily seem to toss).\n\nThese are companies I've believed in, and have felt they will do great\nlong-term, but…",
  "original_created_utc": 1613000233,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这真心有点让人苦恼，因为我花了不少钱，花了一些时间\n前（每只股票几百元，而不是几千或几十元）。\n数千人就像这里的一些人如此轻易地似乎折腾）。)\n\n这些公司我都相信，并且觉得他们会做得很好。\n长期以来，但",
      "title": "我的一些中长线股票现在已经变成了追忆股，这真的让我很纠结..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這真心有點讓人苦惱，因爲我花了不少錢，花了一些時間\n前（每隻股票幾百元，而不是幾千或幾十元）。\n數千人就像這裏的一些人如此輕易地似乎折騰）。)\n\n這些公司我都相信，並且覺得他們會做得很好。\n長期以來，但",
      "title": "我的一些中長線股票現在已經變成了追憶股，這真的讓我很糾結..."
    }
  ],
  "title": "Some of my mid-long stocks have now become meme stocks and it's really messing with me...",
  "created_utc": 1613050412,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This sincerely is a bit distressing because I put a fair bit of money some time ago (hundreds of dollars each into diff stocks, not thousands or tens of thousands like some people on here so easily seem to toss).</p>\n\n<p>These are companies I&#39;ve believed in, and have felt they will do great long-term, but now?  Some of them are now meme stonks, and they&#39;re getting to be pumped too much by everyone trying to make a quick buck.</p>\n\n<p>Yeah, I should be happy for the gains, but do you realize what that does to a company to skyrocket and then come crashing back down?  Especially once the media starts talking about X or Y company being the next big Reddit stock?  It makes regular investors grow leary of the stock afterwards, and the businesses are then lumped in with the /wsb stonks that were hyped.</p>\n\n<p>What should have been steady month-over-month climbs for some of these have now made me feel like I have to watch my holdings like a hawk for when everyone starts dumping so I don&#39;t just not only lose out on earnings, but end up with shares that are valued much less than what I paid for them.</p>\n\n<p>Is anyone else in the same boat?</p>\n\n<p>EDIT: just to share what ones in my portfolio I&#39;m speaking about: MARA, NIO, PLUG, TLRY, APHA, SSPK, BB, HEXO.  All purchased before this stuff with wsb memes - my buy-ins were based on actual solid DD here on <a href=\"/r/stocks\">r/stocks</a></p>\n</div><!-- SC_ON -->",
  "score": 51,
  "permalink": "/r/stocks/comments/lh7a2z/some_of_my_midlong_stocks_have_now_become_meme/",
  "subreddit": "stocks",
  "id": "lh7a2z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728622076
}