{
  "author": "Shadow_Lord_Nathan",
  "original_created_utc": 1640316114,
  "title": "Redditors with siblings, did your parents ever hold “Ugly Contests” with you and your brothers and sisters?",
  "created_utc": 1640337597,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;They’re something my parents would do every now and then when I was a kid, they would line me and my siblings up and pick which one of us was the ugliest. &lt;/p&gt;\n\n&lt;p&gt;Just wondering if anybody else went through something similar.&lt;/p&gt;\n\n&lt;p&gt;Thanks!&lt;/p&gt;\n\n&lt;p&gt;Edit: I’ve been informed by several comments that “Ugly Contests” are not only abnormal but borderline abusive and that I may benefit from seeing a therapist. What a day!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/NoStupidQuestions/comments/rncrqw/redditors_with_siblings_did_your_parents_ever/",
  "subreddit": "NoStupidQuestions",
  "id": "rncrqw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "They’re something my parents would do every now and then when I was a kid, they\nwould line me and my siblings up and pick which one of us was the ugliest.\n\nJust wondering if anybody else went through something similar.\n\nThanks!\n\nEdit: I’ve been informed by several comments that “Ugly Contests” are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が子供の頃、両親が時々やっていたことなんです。\n私と兄弟を並べて、誰が一番醜いか選ぶんです。\n\n同じような経験をした人がいたら教えてください。\n\nありがとうございます。\n\n編集：いくつかのコメントから、「醜いコンテスト」は...であることを知らされました。",
      "title": "兄弟姉妹がいるRedditorの皆さん、ご両親があなたと兄弟姉妹で「ブスコンテスト」を開催したことはありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我还是个孩子的时候，我的父母会时不时地做一些事情。\n他们会把我和我的兄弟姐妹排成一排，挑选我们中最丑的一个。\n\n只是想知道是否有人经历过类似的事情。\n\n谢谢\n\n编辑：我从一些评论中得知，\"丑陋竞赛 \"是...",
      "title": "有兄弟姐妹的网友，你的父母是否曾与你和你的兄弟姐妹举行过 \"丑陋竞赛\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我還是個孩子的時候，我的父母會時不時地做一些事情。\n他們會把我和我的兄弟姐妹排成一排，挑選我們中最醜的一個。\n\n只是想知道是否有人經歷過類似的事情。\n\n謝謝\n\n編輯：我從一些評論中得知，\"醜陋競賽 \"是...",
      "title": "有兄弟姐妹的網友，你的父母是否曾與你和你的兄弟姐妹舉行過 \"醜陋競賽\"？"
    }
  ]
}