{
  "author": "etariPone",
  "the_new_excerpt": "Obviously you would need super huge balls to do that, but it works. Some friends\nof mine are into stocks, I always tell them why they wait for their +10-40%\nwhich is very unlikely to happen within a year.\n\nThey legit miss out on history that repeats itself over and over. This bull run\nwill end at…",
  "original_created_utc": 1619604267,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もちろん、そのためには超巨大なボールが必要ですが、うまくいきます。私の友人で株をやっている人がいます。\n私の友人の何人かは株をやっていますが、私はいつも、なぜ彼らは1年以内に起こる可能性が非常に低い+10-40%を待つのかと言っています。\n1年以内に起こる可能性は非常に低いです。\n\n彼らは、何度も繰り返される歴史に乗り遅れてしまうのです。このブルランは\n終わるのは・・・。",
      "title": "時々、この市場はなんて愚かなんだろうと思う。イーロンのツイートをきっかけに、文字通りDOGEに人生の貯金を投資することができ、伝統的な投資の5年間をスキップするような意味で"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "显然，你需要超级大的球才能做到这一点，但它是有效的。我的一些朋友\n我的一些朋友是做股票的，我总是告诉他们为什么要等待他们的+10-40%的收益？\n这在一年内发生的可能性非常小。\n\n他们合法地错过了一次又一次重复的历史。这波牛市行情\n将结束于...",
      "title": "有时我觉得这个市场是多么愚蠢。从某种意义上说，在埃隆的一条推特之后，你真的可以将你一生的积蓄投资于DOGE，你将跳过5年的传统投资。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "顯然，你需要超級大的球才能做到這一點，但它是有效的。我的一些朋友\n我的一些朋友是做股票的，我總是告訴他們爲什麼要等待他們的+10-40%的收益？\n這在一年內發生的可能性非常小。\n\n他們合法地錯過了一次又一次重複的歷史。這波牛市行情\n將結束於...",
      "title": "有時我覺得這個市場是多麼愚蠢。從某種意義上說，在埃隆的一條推特之後，你真的可以將你一生的積蓄投資於DOGE，你將跳過5年的傳統投資。"
    }
  ],
  "title": "Sometimes I think how stupid this market is. In a sense where you could literally invest your life savings in DOGE after a tweet from Elon and you would skip 5 years of traditional investing",
  "created_utc": 1619629336,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Obviously you would need super huge balls to do that, but it works. Some friends of mine are into stocks, I always tell them why they wait for their +10-40% which is very unlikely to happen within a year.</p>\n\n<p>They legit miss out on history that repeats itself over and over. This bull run will end at some point, but until then you can almost blindely throw your money at it and it will outperform every stock.. </p>\n\n<p>Tldr: green candles and bullish patterns</p>\n</div><!-- SC_ON -->",
  "score": 616,
  "permalink": "/r/CryptoCurrency/comments/n0bgxd/sometimes_i_think_how_stupid_this_market_is_in_a/",
  "subreddit": "CryptoCurrency",
  "id": "n0bgxd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776213345
}