{
  "author": "partymsl",
  "original_created_utc": 1658005573,
  "title": "Why July the 28th is going to be one of the most important dates for Crypto.",
  "created_utc": 1658054613,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Right now everything seems good, we hit a way too high inflation data but we are still pumping just a few days later and to not forget the merger hype seems to be kicking in again. So are we set for a few weeks of relief and maybe even reversal? Don&amp;#39;t be foolish te real test of Crypto is yet to come.&lt;/p&gt;\n\n&lt;p&gt;On July 28th the US will release its Q2 GDP estimate, just for your memory the last Q1 report is at - 1.7% after it was predicted to be +1.1% by the walls street. And IF we get this quarter in the red too, then the US will officially be on a recession according to textbook rules. So we just have to not be in the minus can&amp;#39;t be that hard right? For comparison the Atlanta FED had predicted a - 1.1% quarter a few days ago and now even updated that to a - 2.7% quarter. So a recession in the US is HIGHLY HIGHLY LIKELY and to be announced on July 28th.&lt;/p&gt;\n\n&lt;p&gt;This would be a historic event for Crypto to be in such a completly new environment it has never been in before and also for stock markets that&amp;#39;s a recession for the first time since 2008, baring the flash-recession in 2020. It will be interesting to see how crypto adopts to this historic situation.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 308,
  "permalink": "/r/CryptoCurrency/comments/w0qfzw/why_july_the_28th_is_going_to_be_one_of_the_most/",
  "subreddit": "CryptoCurrency",
  "id": "w0qfzw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Right now everything seems good, we hit a way too high inflation data but we are\nstill pumping just a few days later and to not forget the merger hype seems to\nbe kicking in again. So are we set for a few weeks of relief and maybe even\nreversal? Don't be foolish te real test of Crypto is yet to…"
}