{
  "author": "johnma21",
  "the_new_excerpt": "We always said, “What if Robinhood started trading paper (fake) Bitcoin without\nholding the actual Bitcoin to back it up?”.\n\nThis is what happens when a unscrupulous company needs more money fast and the\nchances of your Robinhood crypto positions being non-collateralized (non backed\nup) have…",
  "original_created_utc": 1614338593,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们总是说：\"如果Robinhood开始交易纸质(假)比特币，而没有\n持有实际的比特币来支持？\"。\n\n这就是无良公司快速需要更多资金的情况，而该公司的\n您的Robinhood加密仓位没有抵押的机会（非支持）。\n了）有...",
      "title": "警告： 趁现在还来得及把你的硬币从Robinhood里拿出来!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們總是說：\"如果Robinhood開始交易紙質(假)比特幣，而沒有\n持有實際的比特幣來支持？\"。\n\n這就是無良公司快速需要更多資金的情況，而該公司的\n您的Robinhood加密倉位沒有抵押的機會（非支持）。\n了）有...",
      "title": "警告： 趁現在還來得及把你的硬幣從Robinhood裏拿出來!"
    }
  ],
  "title": "Warning: Get your Coins out of Robinhood while you still can!",
  "created_utc": 1614350165,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We always said, “What if Robinhood started trading paper (fake) Bitcoin without holding the actual Bitcoin to back it up?”. </p>\n\n<p>This is what happens when a unscrupulous company needs more money fast and the chances of your Robinhood crypto positions being non-collateralized (non backed up) have literally never been higher. Even more so, the chances of Robinhood failing as a company have never been higher.</p>\n\n<p>Look into the eyes of the young CEOs who made their money by deceiving retail investors and selling them to the hedge funds via order flow. Do you really want to let these guys hold your crypto?</p>\n\n<p>For the next day I will personally answer any questions that any of you may have about selling your Robinhood positions and getting into a real exchange.</p>\n\n<p>Do the right thing NOW because it’s also the smart thing and because you low-key always knew you should have been doing this.</p>\n</div><!-- SC_ON -->",
  "score": 678,
  "permalink": "/r/CryptoCurrency/comments/lsvqwc/warning_get_your_coins_out_of_robinhood_while_you/",
  "subreddit": "CryptoCurrency",
  "id": "lsvqwc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937735128
}