{
  "author": "thadiusb",
  "original_created_utc": 1648268026,
  "title": "I Took 1 Whole Coin off the Market: My One Week Journey Dealing w/ the Bank Just to Buy a Bitcoin.",
  "created_utc": 1648290699,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey guys. Ive been into BTC for nearly 2 years now. The longer time carries on, the farther down the rabbit hole I go.&lt;/p&gt;\n\n&lt;p&gt;Typically, I have been DCA&amp;#39;ing every pay day up until a week ago. I have always thrown whatever extra change and money I have laying around into it. I no longer buy stocks as it always feels too much like a gamble. I can never just be happy holding stocks. It was like chasing a high finding the next &amp;#39;money maker.&amp;#39; The banks must have loved me and all the stupid fee&amp;#39;s Id pay buying and selling as I carry on the chase.&lt;/p&gt;\n\n&lt;p&gt;But then Bitcoin entered my life. And life became easier. Stocks became meaningless. A Maxi I became. No more stocks. Savings being placed entirely into the soundest money of all time: Bitcoin.&lt;/p&gt;\n\n&lt;p&gt;Fast forward to January. My father has a fatal, and extremely rare stroke; a Cerebellar Stroke. You would never have seen it coming. Not your typical stroke symptoms. 2 weeks later after a battle in ICU he passed. He didn&amp;#39;t leave much. He was a free spirit. Retired early, and lived and travelled in a van. My step-mom, who he divorced a decade ago, kept paying his life insurance that he neglected to pay.&lt;/p&gt;\n\n&lt;p&gt;So with many thanks to my step-mother, I received inheritance.&lt;/p&gt;\n\n&lt;p&gt;First thing I did, I paid off debts. Helped the wife pay down a lot of debt. Upgraded the house.... slightly. Nothing too major.&lt;/p&gt;\n\n&lt;p&gt;Im keeping a bit of fiat in savings. Sadly, letting it get eaten away from inflation.&lt;/p&gt;\n\n&lt;p&gt;The rest, I dedicated to buying up the remainder of what I need of a whole BTC. Total cost roughly, $35,000 USD.&lt;/p&gt;\n\n&lt;p&gt;Enter: The Royal Bank of Canada. Canada&amp;#39;s biggest bank. A bank of which I have been with for many a year. I have savings accounts with them. I have a larger LOC with them. I used to use their investment services.&lt;/p&gt;\n\n&lt;p&gt;Banks are not your friends. I am aware of this.&lt;/p&gt;\n\n&lt;p&gt;But, honestly, its 2022. The banking system is stuck in the 1980&amp;#39;s.&lt;/p&gt;\n\n&lt;p&gt;This past Monday, March 21st, I went to the bank to wire the $35K to NDAX, a leading Canadian Crypto Exchange (0.2% buy fee, $15 transfer out fee). Did the paperwork, confirmed the info, and boom, done. Later, the advisor from the bank called to ask me some questions from the Anti-Money Laundering department. Cool, a couple verification questions. I answered honestly. Advisor said &amp;quot;great, expect to receive the wire tomorrow.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Tuesday, nothing received. This is a domestic wire transfer. Should take a day, tops.&lt;/p&gt;\n\n&lt;p&gt;Wednesday, March 23rd, Im in the bank again. Branch manager tells me the wire was flagged as &amp;quot;too risky.&amp;quot; You cannot imagine the disbelief in me. The bank was deeming what I was doing with my money as &amp;quot;too risky.&amp;quot; As if they had some control over what I choose to do with my money. Its sad enough its 2022, and there isn&amp;#39;t an easier way to send $35K, which honestly isn&amp;#39;t even that much damn money in todays age.&lt;/p&gt;\n\n&lt;p&gt;After raising a stink, and showing the branch manager my Bitcoin tattoo, I informed him I was &amp;quot;WELL AWARE OF THE RISKS.&amp;quot; I also had to mention that its risky leaving my savings in a bank that has a less than 1% interest rate in their savings accounts. I was asked to show proof that I have dealt with NDAX before. I was asked if anyone told me Id make a fortune buying BTC? Standard money-laundering questions. Check-Check-Check. Passed the test, AGAIN.&lt;/p&gt;\n\n&lt;p&gt;Manager put a word in with Wire Transfer department, and the money was finally taken from my account.&lt;/p&gt;\n\n&lt;p&gt;Thursday rolls around now. Still, nothing. Nothing at all. Money, stuck in limbo somewhere. In some sort of electronic bank cloud.&lt;/p&gt;\n\n&lt;p&gt;Today. Friday. Guess where I am again for a 3rd time? The fucking bank. More times in 1 week than in 2 years. Remember everyone... its 2022. Nope, sorry, I cannot call them because when it comes to wires I have to physically enter the branch I sent the wire from.&lt;/p&gt;\n\n&lt;p&gt;This time I get branch manager involved, a co-manager involved, and of course an advisor. All looking into this shit for me. Im livid. Its Friday. The original wire was supposed to be sent Monday. Tomorrow is a weekend. WTF?!?&lt;/p&gt;\n\n&lt;p&gt;Turns out, under money-laundering investigation, AGAIN. More questions asked. Anyone put you up to this? Have you used NDAX before? How did you hear about them? Are you going to do business with them again? Blah blah blah. I passed again. I was told then to await an email or a phone call when this has all been settled. 2 hours pass. I email the branch manager, livid. Nothing still.&lt;/p&gt;\n\n&lt;p&gt;Then, around 3PM, I was told the money was released.&lt;/p&gt;\n\n&lt;p&gt;Guess I have to wait the weekend to receive it on Monday. Those fuckers at the bank!&lt;/p&gt;\n\n&lt;p&gt;But no! As soon as NDAX received it into their processing, I received the wire transfer! 530PM Pacific time! Last minute.&lt;/p&gt;\n\n&lt;p&gt;Of course everyone will say &amp;#39;HEY! DCA that shit!&amp;quot; I get it. I DCA&amp;#39;d for so long that it was just nice to cop what I needed and throw it into Cold Storage. The few dollars Id save DCA&amp;#39;ing mean nothing to me in 10 years. Its nice to just have a solid 1/21,000,000, and to take it off the market.&lt;/p&gt;\n\n&lt;p&gt;But that&amp;#39;s not the total point of this at all. We need to all be happy for each other for any amount of BTC we have at any cost we got it. This is the future. This is the sound choice.&lt;/p&gt;\n\n&lt;p&gt;The point is this tho:&lt;/p&gt;\n\n&lt;p&gt;Banks are not your friends. Banks consider you GUILTY UNTIL PROVEN INNOCENT when wiring any sort of money.&lt;/p&gt;\n\n&lt;p&gt;And this my friends.... is why we Bitcoin.&lt;/p&gt;\n\n&lt;p&gt;Peace and Love Bitcoin Community.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 365,
  "permalink": "/r/Bitcoin/comments/togmnb/i_took_1_whole_coin_off_the_market_my_one_week/",
  "subreddit": "Bitcoin",
  "id": "togmnb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hey guys. Ive been into BTC for nearly 2 years now. The longer time carries on,\nthe farther down the rabbit hole I go.\n\nTypically, I have been DCA'ing every pay day up until a week ago. I have always\nthrown whatever extra change and money I have laying around into it. I no longer\nbuy stocks as it…"
}