{
  "author": "Thx4ThGoldKindStrngr",
  "the_new_excerpt": "Why did the market react so harshly to the lack of talk about clean energy? Was\nit an overreaction or the beginning of a larger term trend for the rest of the\nyear? Classic buy the rumor, sell the news?\n\nYesterday's stimulus plan is only the first of two major spending initiatives\nBiden will seek in…",
  "original_created_utc": 1610751433,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "为什么市场对清洁能源谈虎色变的反应如此激烈？是\n是反应过度，还是一个更大的长期趋势的开始？\n年？经典的买传闻、卖消息？\n\n昨日的经济刺激计划只是两大支出举措中的第一条\n拜登将寻求在...",
      "title": "拜登在他的1.9T经济刺激计划中没有谈及清洁能源。清洁能源股票跌幅较大（ICLN -5.39%，TAN -7.24%，QCLN -5.57%）。他们的牛市结束了吗？今年是要下跌还是横盘？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲什麼市場對清潔能源談虎色變的反應如此激烈？是\n是反應過度，還是一個更大的長期趨勢的開始？\n年？經典的買傳聞、賣消息？\n\n昨日的經濟刺激計劃只是兩大支出舉措中的第一條\n拜登將尋求在...",
      "title": "拜登在他的1.9T經濟刺激計劃中沒有談及清潔能源。清潔能源股票跌幅較大（ICLN -5.39%，TAN -7.24%，QCLN -5.57%）。他們的牛市結束了嗎？今年是要下跌還是橫盤？"
    }
  ],
  "title": "Biden didn't talk about clean energy in his 1.9T stimulus plan. Clean energy stocks down a lot (ICLN -5.39%, TAN -7.24%, QCLN -5.57%). Is the bull market for them over? Is it going to trade down or sideways this year?",
  "created_utc": 1610769733,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Why did the market react so harshly to the lack of talk about clean energy? Was it an overreaction or the beginning of a larger term trend for the rest of the year? Classic buy the rumor, sell the news?</p>\n\n<p>Yesterday&#39;s stimulus plan is only the first of two major spending initiatives Biden will seek in the first few months of his presidency.</p>\n\n<p>The second bill, expected in February, will tackle the president-elect’s longer-term goals of creating jobs, reforming infrastructure, combating climate change and advancing racial equity.</p>\n\n<p>Surely the hedge funds and very smart money must have known his other bill was going to be the one talking about clean energy. </p>\n\n<p>Was everyone just in it for the euphoria and trend and got out today? Is everyone anticipating the clean energy spending will go nowhere, similar to how not much happened with Obama&#39;s infrastructure plan? </p>\n\n<p>What caused the drop, was it hedge funds or retail investors bailing?</p>\n\n<p>Such a big decline the day after surely must signal something? </p>\n\n<p>Should holders of clean energy stocks get out now or ride it out? Do you seem it recovering to ATH this year, trading sideways from here, or trending down over the rest of 2021?</p>\n</div><!-- SC_ON -->",
  "score": 136,
  "permalink": "/r/stocks/comments/ky6462/biden_didnt_talk_about_clean_energy_in_his_19t/",
  "subreddit": "stocks",
  "id": "ky6462",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311218326
}