{
  "author": "graiz",
  "the_new_excerpt": "I've been trading about 20 years and while I'm \"not a financial advisor\" there\nare a lot of basics that people just aren't doing.\n\nThe influx of investors jumping into GameStop has been fun for some, painful for\nothers. I'm going to outline some best practices for making money in the market\nyear…",
  "original_created_utc": 1613785268,
  "title": "Stock Trading 101",
  "created_utc": 1613799827,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been trading about 20 years and while I&#39;m &quot;not a financial advisor&quot; there are a lot of basics that people just aren&#39;t doing.</p>\n\n<p>The influx of investors jumping into GameStop has been fun for some, painful for others.  I&#39;m going to outline some best practices for making money in the market year over year.</p>\n\n<p><strong>1.  Never invest in something that you don&#39;t understand.</strong><br/>\nGME was the latest example but I&#39;ve seen people do the same thing with Calls, Puts, Shorts and other more exotic trading mechanics. If you don&#39;t understand something don&#39;t invest in it... assume that there&#39;s someone who does understand it and will trade on their deeper knowledge.</p>\n\n<p><strong>2.  Trade in the long-term.</strong><br/>\nYour ideal positions will be in companies where you&#39;re betting on their 3-5 year trajectory.  The markets have a ton of daily/monthly volatility but if you&#39;re taking a longer-term view, you&#39;ll have many more wins than losses.  Long-term trading is also far more favorable in terms of taxes.  This can give you an instant 20-30% advantage over a swing/day-trader.   Translation...  You&#39;re not gaining or losing money every day... you only gain or lose when you sell. Your potential is going up or down but it&#39;s just potential.</p>\n\n<p><strong>3.  Care about the companies you&#39;re investing in.</strong><br/>\nInvesting is both a way to make money but it&#39;s also a way to support companies that you believe in.  It&#39;s more fun to own a stock of a company that&#39;s doing something great than simply a company you think is trending on reddit. It also incentivizes you to read their financials, their news releases and makes you knowledgable for when to sell if you start seeing long-term trends that don&#39;t look good.  I love talking about the products of the stocks I own because I tend to like them both.</p>\n\n<p><strong>4.  Do your research.</strong><br/>\nIf you&#39;re going to own an individual stocks then do your research.  Ideally in a field or area that&#39;s tied to something you already know a lot about.  Some people know a lot about sports, others know a lot about travel, or science, or cars.  Lean into the sectors that you&#39;re interested in and do your research.  Each sector has winners and if you&#39;re deeper in one sector, you&#39;ll be more capable of spotting winners.</p>\n\n<p><strong>5.  Zoom in and Out of the Chart</strong><br/>\nStocks tend to follow macro-trends.  If you&#39;re buying or selling you need to understand the last few years to get a sense of what is likely to happen.  Companies tend to have inertia. If they lift 10% yearly, they have some inertia to keep doing that.  If they stay flat or go down... they have inertia to continue. Look for changes that can alter that trajectory. If you can spot these inflection points, there&#39;s a lot of potential to outperform.   Sometimes these inflection points are external (COVID/Election) sometimes they are internal (new CEO, new product, new direction), your research of the sector (4) can often give you an advantage when thinking long-term (1) over people who are zoomed in. Remember to think long-term.</p>\n\n<p><strong>6.  Don&#39;t invest money that you can&#39;t afford to lose it.</strong><br/>\nIf you invest stocks long enough you&#39;ll have bad days... really bad days but that&#39;s part of the market. If it stresses you out... Don&#39;t do it. That being said, a disciplined and long term investing approach can give you a lot of financial freedom... and it can be a lot of fun.</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->",
  "score": 1033,
  "permalink": "/r/stocks/comments/lnw3w5/stock_trading_101/",
  "subreddit": "stocks",
  "id": "lnw3w5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332885064,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我已经做了大约20年的交易，虽然我 \"不是一个财务顾问\"，但有很多基本的东西人们没有做。\n有很多基础知识是人们没有做到的。\n\n大量的投资者涌入GameStop，对一些人来说是有趣的，对另一些人来说是痛苦的。\n痛苦。我将概述一些在市场上赚钱的最佳做法\n年...",
      "title": "股票交易101"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經做了大約20年的交易，雖然我 \"不是一個財務顧問\"，但有很多基本的東西人們沒有做。\n有很多基礎知識是人們沒有做到的。\n\n大量的投資者湧入GameStop，對一些人來說是有趣的，對另一些人來說是痛苦的。\n痛苦。我將概述一些在市場上賺錢的最佳做法\n年...",
      "title": "股票交易101"
    }
  ]
}