{
  "author": "maxbeerfun",
  "the_new_excerpt": "Back before this sub was ruined by the influx of 7 million people who think they\nare making wallstreetbets with the allowance their wife's boyfriend gives them,\nsome real DD used to be done. Now all I see if people asking who is still\nholding stocks that have been squozed and are running your…",
  "original_created_utc": 1613066493,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "早在这个子被700万自以为是的人的涌入毁掉之前。\n正在做华尔街网 与他们的妻子的男朋友给他们的津贴。\n一些真正的DD曾经做过。现在我所看到的，如果人们问谁是仍然\n持有的股票已经被挤兑，正在运行你的... ...",
      "title": "无限金钱的小插曲，又来了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "早在這個子被700萬自以爲是的人的湧入毀掉之前。\n正在做華爾街網 與他們的妻子的男朋友給他們的津貼。\n一些真正的DD曾經做過。現在我所看到的，如果人們問誰是仍然\n持有的股票已經被擠兌，正在運行你的... ...",
      "title": "無限金錢的小插曲，又來了"
    }
  ],
  "title": "Infinite Money Glitch, again",
  "created_utc": 1613098822,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Back before this sub was ruined by the influx of 7 million people who think they are making wallstreetbets with the allowance their wife&#39;s boyfriend gives them, some real DD used to be done. Now all I see if people asking who is still holding stocks that have been squozed and are running your leveraged accounts into the ground.</p>\n\n<p>Today I bring you an opportunity to make money once again. The $RBLX infinite money glitch. For those unaware Roblox is set to IPO soon. What does this mean? Unlimited money for your dick implants so you can finally satisfy your wife like her boyfriend does.</p>\n\n<p>Step 1) Open position on Roblox after IPO</p>\n\n<p>Step 2) Stock goes up, make money, and use money to purchase in-game currency in Roblox</p>\n\n<p>Step 3) Absolutely steez out your Roblox avatar, while simultaneously increasing revenue for Roblox</p>\n\n<p>Step 4) Roblox beats earnings estimates with increased guidance from new revenue and repeat steps 2-4 forever</p>\n\n<p>&#x200B;</p>\n\n<p>EDIT: It is a direct listing, not an IPO, however that has no impact on the glitch. Direct listing just removes underwriting from the process.</p>\n\n<p>&#x200B;</p>\n\n<p>For those too retarded to read</p>\n\n<p><a href=\"https://preview.redd.it/wxg2covnqwg61.png?width=969&amp;format=png&amp;auto=webp&amp;s=52791124c8772a89454ca0fdc4db153d63fb37db\">https://preview.redd.it/wxg2covnqwg61.png?width=969&amp;format=png&amp;auto=webp&amp;s=52791124c8772a89454ca0fdc4db153d63fb37db</a></p>\n</div><!-- SC_ON -->",
  "score": 5603,
  "permalink": "/r/wallstreetbets/comments/lhqgmq/infinite_money_glitch_again/",
  "subreddit": "wallstreetbets",
  "id": "lhqgmq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728627473
}