{
  "author": "operator139",
  "original_created_utc": 1629042099,
  "title": "Crypto is the only thing keeping me going at this point",
  "created_utc": 1629055835,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My life is okay. I don&#39;t think many people want to hear my life story, but I just want to be thankful to the Crypto community. I know there&#39;s plenty of us out there.</p>\n\n<p>I&#39;m a typical 30 year old guy. Some family, most of them are estranged. Single, no kids. I have a good friend or two I&#39;ve known for decades, one of them just got married, we barely see each other anymore.  You know how it goes.</p>\n\n<p>Lately I&#39;ve been struggling with what do with my life. I have a decent career in data analytics, but I didn&#39;t go to school for programming and constantly people belittle me in my industry for not understanding the fundamental concepts of SQL and just being a &quot;copycat&quot; </p>\n\n<p>Anyway, luckily I have the money for stupid fiat, and I found cryptocurrency a few months ago. This community has been so helpful and welcoming it&#39;s changed the game.</p>\n\n<p>That was right when BTC hit 29k. I bought, put my entire life savings in, and I&#39;m finally feeling like I have something to look forward to.  The idea of not having to work a job I hate, financial freedom, and becoming a life-time hodler is helping. I had around $20k saved to my name recently and was thinking about buying a house, but the idea of being the only one in it just seemed pointless?</p>\n\n<p>Now I have only around $2k to my name in fiat, but I feel more alive than ever. Seeing the charts go up and down, getting to know the ins and outs of proof-of-stake and proof-of-work protocols, reading white papers, being active in a community that believes in decentralized currency, some people might say I just love money but no, I love cryptocurrency.</p>\n</div><!-- SC_ON -->",
  "score": 260,
  "permalink": "/r/CryptoCurrency/comments/p4vst5/crypto_is_the_only_thing_keeping_me_going_at_this/",
  "subreddit": "CryptoCurrency",
  "id": "p4vst5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My life is okay. I don't think many people want to hear my life story, but I\njust want to be thankful to the Crypto community. I know there's plenty of us\nout there.\n\nI'm a typical 30 year old guy. Some family, most of them are estranged. Single,\nno kids. I have a good friend or two I've known for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の人生は大丈夫。多くの人が私の人生の話を聞きたいとは思わないでしょうが、私はただ\n私はただCryptoコミュニティに感謝したいのです。沢山の人がいることを知っています。\nいることを知っています\n\n私は典型的な30歳の男です。家族もいますが、ほとんどが疎遠です。独身。\n子供もいません。昔からの親友が1人か2人いて...",
      "title": "今、私を支えているのは暗号だけです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的生活还不错。我不认为很多人想听我的人生故事，但我\n我只想对加密货币社区表示感谢。我知道我们有很多人\n在那里。\n\n我是一个典型的30岁的人。有一些家庭，大部分是疏远的。单身。\n没有孩子。我有一两个好朋友，我已经认识...",
      "title": "在这一点上，加密货币是唯一让我坚持下去的东西"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的生活還不錯。我不認爲很多人想聽我的人生故事，但我\n我只想對加密貨幣社區表示感謝。我知道我們有很多人\n在那裏。\n\n我是一個典型的30歲的人。有一些家庭，大部分是疏遠的。單身。\n沒有孩子。我有一兩個好朋友，我已經認識...",
      "title": "在這一點上，加密貨幣是唯一讓我堅持下去的東西"
    }
  ]
}