{
  "author": "itachiwriting",
  "original_created_utc": 1626531896,
  "title": "Daily Breakdown, 17 July, 2021",
  "created_utc": 1626543272,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>*If you like these posts and want to get the latest daily/weekly breakdowns, don&#39;t be shy to drop me a follow. </p>\n\n<p>*Although I sometimes make minor adjustments where I see fit (to make for an easier read), the bullet points featured below are taken from article bodies and headlines. Adding too many links gets recorded as spam, so I will simply include the website and author name per bullet point. If you want any of the source links, feel free to pm me :)</p>\n\n<p>Bullish breakdown:</p>\n\n<ul>\n<li><p>Black Rock Petroleum Company has partnered with Optimum Mining Host Limited Liability to operate up to one million Bitcoin miners in Canada. (Ryan James, beincrypto) </p></li>\n<li><p>Bank of America (BoA) one of the largest banks in the United States, is now allowing clients to trade Bitcoin futures. This is one of the first institutions in the United States to make it possible for investors to get access to Bitcoin futures trading. (Jonathan Gibson, usethebitcoin) </p></li>\n<li><p>U.S. City Mayor Scott Conger recently posted on Twitter his belief that Bitcoin will fix inflation. His tweet which called out the U.S. federal government consisted of a couple of questions for the government regarding inflation. And then ended with there being only one fix for inflation: Bitcoin. (Best Owie, bitcoinist)  </p></li>\n<li><p>El Salvador’s government intends to establish a native cryptocurrency that the public will be able to use to pay for services, according to San Salvador-based media outlet El Faro on Friday night. (Jordan Major, finbold)</p></li>\n<li><p>Crypto analytics firm Santiment says Ethereum’s top 10 largest addresses went from owning as low as 18.46% of the total Ethereum supply after mid-May – when ETH achieved its all-time high – to 20.58% by July 13th. (Daily Hodl Staff, the daily hodl) </p></li>\n<li><p>Santiment company believes that despite the current negative BTC sentiment on Twitter, a price surge might follow that will take the community by surprise. (Yuri Molchan, u today) </p></li>\n</ul>\n\n<p>Bearish breakdown:</p>\n\n<ul>\n<li><p>The bears still have a tight grip on the market as bitcoin dropped to a three-week low of $31,000 while ETH is south of $1,900. (Jordan Lyanchev, cryptopotato) </p></li>\n<li><p>CEO of CryptoQuant, Ki Young Ju recently tweeted that “BTC selling pressure seems to be high.” According to Ju, the indicator shows that the exchange whale ratio is over 85%. “When this indicator constantly keeps above 85%, the market has usually been bearish.” (Ryan James, beincrypto)</p></li>\n<li><p>An anonymous crypto whale has moved a staggering 13,003 Bitcoins to Coinbase. Chinese crypto journalist Colin Wu has shared CryptoQuant charts which show that this transfer was made by Coinbase internally. (Yuri Molchan, u today) </p></li>\n<li><p>In a statement, U.S. Treasury Secretary Janet has said: &quot;In light of the rapid growth in digital assets, it is important for the agencies to collaborate on the regulation of this sector and the development of any recommendations for new authorities.&quot;  (Kollen Post, theblockcrypto) </p></li>\n<li><p>Japan is beefing up its diplomatic efforts to regulate digital currencies globally, three officials told Reuters, a sign of the government&#39;s growing alarm that a proliferation of new forms of private money could upend the financial system. (Leika Kihara, Takaya Yamaguchi, reuters) </p></li>\n<li><p>Anthony Di Iorio, a co-founder of the Ethereum network, says he’s done with the cryptocurrency world, partially because of personal safety concerns. Since 2017, he&#39;s had someone traveling with or meeting him wherever he goes. (Olga Kharif, Bloomberg) </p></li>\n<li><p>Authorities in Malaysia destroyed more than $1.2 million worth of Bitcoin mining rigs after they were confiscated for operating illegally. (Turner Wright, cointelegraph) </p></li>\n</ul>\n\n<p>As a crypto investor you must learn to take the good news with the bad. I&#39;m here to present both sides of the news to you, both sides of the coin. Long live the bulls!</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/om58g9/daily_breakdown_17_july_2021/",
  "subreddit": "CryptoCurrency",
  "id": "om58g9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "*If you like these posts and want to get the latest daily/weekly breakdowns,\ndon't be shy to drop me a follow.\n\n*Although I sometimes make minor adjustments where I see fit (to make for an\neasier read), the bullet points featured below are taken from article bodies and\nheadlines. Adding too many…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "*これらの記事が好きで、最新のデイリー/ウィークリーブレイクダウンを入手したい場合。\nこの記事が気に入ったら、ぜひフォローをお願いします。\n\n*この記事が好きで、最新のデイリー／ウィークリーブレイクダウンを知りたい方は、ぜひフォローしてください。\n以下の箇条書きの内容は、記事の本文や見出しから引用しています。\n見出しをつけています。あまりにも多くの...",
      "title": "デイリーブレイクダウン、2021年7月17日"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "*如果你喜欢这些帖子，并希望得到最新的每日/每周的分析。\n不要害羞，给我一个关注。\n\n*尽管我有时会在我认为合适的地方做一些小的调整（以使阅读更容易），但我还是会把这些文章放在我的网站上。\n虽然我有时会在我认为合适的地方做一些小的调整（以使阅读更容易），但下面的要点是取自文章的主体和标题。\n标题。添加太多的...",
      "title": "每日一题, 2021年7月17日"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "*如果你喜歡這些帖子，並希望得到最新的每日/每週的分析。\n不要害羞，給我一個關注。\n\n*儘管我有時會在我認爲合適的地方做一些小的調整（以使閱讀更容易），但我還是會把這些文章放在我的網站上。\n雖然我有時會在我認爲合適的地方做一些小的調整（以使閱讀更容易），但下面的要點是取自文章的主體和標題。\n標題。添加太多的...",
      "title": "每日一題, 2021年7月17日"
    }
  ]
}