{
  "author": "Mekayv",
  "original_created_utc": 1633198424,
  "title": "Dude gets kidnapped, robbed, and left for dead. He survived and now its trying to get Binance to freeze the funds that were taken from him by his perpetrators.",
  "created_utc": 1633210758,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Twitter user <em>mah_twitter</em> just posted a few hours ago the horrifying story of how he was kidnapped a few days ago, forced to transfer the funds to the kidnappers, and left for dead in the woods.</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p><em>Hello everyone. You won&#39;t believe how happy I am that I can tell this. I must be dead but born again!</em>  </p>\n\n<p><em>All of my life saving (I was all-in crypto) from binance was stupidly drained to bsc address by kidnappers (who wanted to take my life as well) with binance-pegged usdt ($523k) and I believe we can hit up the cz binance to freeze these funds after good attention. xx</em>  </p>\n\n<p><em>I live in Kaliningrad (offshore 300km part of russia inside eu zone) and it happened 27.09 22:00, pulled out from parked car right in front of windows of our governor, next to Belarussian embassy building. I still can&#39;t believe this can happen in 2k21.</em>  </p>\n\n<p><em>Held tied in mask for almost 24 hours in a unknown location (after I unlocked iphone with binance 2FA app codes to let them drain funds).</em>  </p>\n\n<p><em>The second night I was strangled to death and thrown out in the forest without clothes, hidden under a bunch of branches. Sorry for such creepy details, even I didn&#39;t expect that this can happen in mother&#39;s nature.</em>  </p>\n\n<p><em>Luckily because I was IV sedated with random drugs by kidnappers, they could not check my heartbeat and thought I was done. Brain needs not much oxygen in that condition which was still enough in blood, so my breath came back later and so I was given a second birth.</em>  </p>\n\n<p><em>I was lucky enough to get out of forest in complete darkness with 4°C to find nearest village and I was sent to ER and to fill later criminal case to police.</em>  </p>\n\n<p><em>still up and good  I believe crypto twitter has some deep heart inside of everyone and so we can pump this message until Binanze CZ confirms that this case can be closed in the luckiest outcome for human beings. Guys, love everyone, cheers</em> </p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p>Luckily for him, Crypto Twitter got to work and persuaded CZ and Binance to immediately look at this case, and it was a success.</p>\n\n<p><a href=\"https://preview.redd.it/sh6emkixt2r71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=7abc9551e8603f6c65c68aae630e2f65bf01415b\">We can only hope he can at least get his funds back, and even better if they catch the bastards who did it.</a></p>\n\n<p>Here&#39;s the <a href=\"https://twitter.com/mah_twittar/status/1444088042520723456?s=20\">link</a> to the full thread.</p>\n\n<p>So what can we learn from this story? I think the message is pretty straight forward:</p>\n\n<p>Don&#39;t tell anyone you own crypto. Maybe you trust the person you are telling this to, but it could easily slip out of his/her lips in any given conversation, and someone that you want to avoid could possibly catch this information. Remember that Crypto is still in the Wild West era. If this guy didn&#39;t came back to life, the perpetrators would be enjoying his money with blood in their hands and probably no regrets.</p>\n\n<p>This guy was left for dead. His kidnappers decided to end his life after stealing his money, proving that human life has zero value to some people (if we can even call them that). Stay safe guys, this story truly sent a shiver down my spine. I think I&#39;m just gonna tell the few friends that know that I made a bad trade and lost all my crypto.</p>\n</div><!-- SC_ON -->",
  "score": 261,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/AgxN7mUuoHx0G8nNsDoRIGuzbLmxxqH0FQMLsk0NE3g.jpg?auto=webp&s=da612ffd3e56353d1af14d269e4c232bba2a02a2",
          "width": 140,
          "height": 140
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/AgxN7mUuoHx0G8nNsDoRIGuzbLmxxqH0FQMLsk0NE3g.jpg?width=108&crop=smart&auto=webp&s=6f0d1a6dce531f17ba4fbc3ab5b0337be8bd372a",
            "width": 108,
            "height": 108
          }
        ],
        "variants": {},
        "id": "YZLi9ST17yj9u07itmHUpKNXRzF3LOmPbeIdqIhBAnw"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/q00c0o/dude_gets_kidnapped_robbed_and_left_for_dead_he/",
  "subreddit": "CryptoCurrency",
  "id": "q00c0o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Twitter user mah_twitter just posted a few hours ago the horrifying story of how\nhe was kidnapped a few days ago, forced to transfer the funds to the kidnappers,\nand left for dead in the woods.\n\n\n\n> Hello everyone. You won't believe how happy I am that I can tell this. I must\n> be dead but born…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Twitterユーザーのmah_twitterさんが数時間前に投稿してくれた、恐ろしい話があります。\n彼は数日前に誘拐され、誘拐犯に資金を送金するよう迫られました。\nそして、森の中に置き去りにされたのです。\n\n\n\n> 皆さんこんにちは。これを伝えられることがどれほど嬉しいことか、信じられないでしょう。私はきっと\n> 死んでいるようで、生まれているようで...。",
      "title": "Dudeは誘拐され、強盗に遭い、死んだように放置されました。生き残った彼は、犯人に奪われた資金をBinanceに凍結させようとしています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "推特用户mah_twitter几小时前刚刚发布了一个可怕的故事，即他如何在几天前被绑架。\n他几天前被绑架，被迫向绑匪转移资金。\n然后被丢在树林里等死。\n\n\n\n> 大家好。你不会相信我有多高兴，因为我可以告诉你这个消息。我必须\n> 死而复生...",
      "title": "老兄被绑架，被抢劫，被遗弃，死了。他活了下来，现在它试图让Binance冻结被肇事者从他那里拿走的资金。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "推特用戶mah_twitter幾小時前剛剛發佈了一個可怕的故事，即他如何在幾天前被綁架。\n他幾天前被綁架，被迫向綁匪轉移資金。\n然後被丟在樹林裏等死。\n\n\n\n> 大家好。你不會相信我有多高興，因爲我可以告訴你這個消息。我必須\n> 死而復生...",
      "title": "老兄被綁架，被搶劫，被遺棄，死了。他活了下來，現在它試圖讓Binance凍結被肇事者從他那裏拿走的資金。"
    }
  ]
}