{
  "author": "Mesngr",
  "original_created_utc": 1637143660,
  "title": "STOP LISTENING TO CONTENT CREATORS. They are selling you hopium and making a lot of money doing it. They are the pickaxe sellers of the Gold Rush.",
  "created_utc": 1637152395,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>During the Gold Rush, the people who made out the best were the companies selling pickaxes to people looking to mine gold and get rich. Most gold miners failed and earned very little and/or nothing while the pickaxe companies made millions. </p>\n\n<p>STOP BLINDLY LISTENING TO CONTENT CREATORS SELLING YOU HOPIUM, NO ONE KNOWS WHATS GOING TO HAPPEN. Posts that have &quot;hopium&quot; or positive outlooks garner way more views and interactions than bearish ones, thus making more money. While it&#39;s nice to have a positive outlook, these guys will be telling you everything is OK and to buy the dip all the way down to 0 because they will still be making TONS OF MONEY by saying that. If the market truly collapses and goes into a multiyear bear market, they will still be making money off hopium while everyone else loses a lot of money. They are in a win/win situation with their content and they do not care about you. They care about selling their hopium as views which makes them money. If the market tanks, goes sideways, or moons, they will be making money. You have ZERO evidence they believe in crypto as much as they say and you have ZERO evidence they even have their money where their mouth is. </p>\n\n<p>Everyone is a genius in a bull market and hopium is selling at an absolute premium right now. Always be careful listening to people who literally get paid to say certain things by people looking to hear those certain things. When things change, they will not change with the times.</p>\n\n<p>If YOU believe in Crypto, that&#39;s all that matters. Don&#39;t believe in Crypto because someone is making money telling you to believe in it. Form your own opinions. Crypto content is massive right now and people make A LOT more money posting hopium than they ever will telling you to be careful and pointing out the risks.</p>\n</div><!-- SC_ON -->",
  "score": 323,
  "permalink": "/r/CryptoCurrency/comments/qvw3js/stop_listening_to_content_creators_they_are/",
  "subreddit": "CryptoCurrency",
  "id": "qvw3js",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "During the Gold Rush, the people who made out the best were the companies\nselling pickaxes to people looking to mine gold and get rich. Most gold miners\nfailed and earned very little and/or nothing while the pickaxe companies made\nmillions.\n\nSTOP BLINDLY LISTENING TO CONTENT CREATORS SELLING YOU…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ゴールドラッシュで一番儲かったのは、金を採掘して一攫千金を狙っている人たちに\n金を採掘して一攫千金を狙っている人たちにつるはしを売っていた会社です。ほとんどの金鉱夫は失敗し\nほとんどの金鉱夫は失敗して、ほとんど何も得られなかったが、つるはし会社は何百万ドルも稼いだ。\n何百万ドルも稼いでいます。\n\n盲目的にコンテンツ・クリエーターの売り込みに耳を傾けるのはやめよう...",
      "title": "コンテンツ制作者の声に耳を傾けない 彼らはあなたに希望を与え、それによって大金を稼いでいるのです。彼らはゴールドラッシュのつるはし売りのようなものだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在淘金热期间，赚得最多的是那些公司\n向希望开采黄金并致富的人出售镐头。大多数淘金者\n失败，赚得很少和/或一无所有，而镐头公司却赚了\n数百万。\n\n不要再盲目地听从内容创作者向你推销...",
      "title": "停止听从内容创作者的意见。他们正在向你推销希望，并以此赚取大量的钱。他们是淘金热中的镐头卖家。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在淘金熱期間，賺得最多的是那些公司\n向希望開採黃金並致富的人出售鎬頭。大多數淘金者\n失敗，賺得很少和/或一無所有，而鎬頭公司卻賺了\n數百萬。\n\n不要再盲目地聽從內容創作者向你推銷...",
      "title": "停止聽從內容創作者的意見。他們正在向你推銷希望，並以此賺取大量的錢。他們是淘金熱中的鎬頭賣家。"
    }
  ]
}