{
  "author": "Tricky_Shit",
  "original_created_utc": 1645535430,
  "title": "How did French cuisine become the pinnacle of all cooking?",
  "created_utc": 1645555748,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So you know how if you want to be taken seriously as a chef, or you want to become a top, top chef, you have to have spent time in France learning from French chefs, the art of fine dining. Even job titles (sous chef and chef de partie as examples) and cooking techniques (confit, sous vide, sauté, etc) have French names, why is this the case? Why is it specifically French and not any other country, that became synonymous with fine dining and cooking at the highest level?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/AskHistorians/comments/syn97p/how_did_french_cuisine_become_the_pinnacle_of_all/",
  "subreddit": "AskHistorians",
  "id": "syn97p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So you know how if you want to be taken seriously as a chef, or you want to\nbecome a top, top chef, you have to have spent time in France learning from\nFrench chefs, the art of fine dining. Even job titles (sous chef and chef de\npartie as examples) and cooking techniques (confit, sous vide, sauté,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、もしあなたがシェフとして真剣に取り組みたいのなら、あるいはシェフになりたいのなら\n一流のシェフになるためには、フランスに滞在して、フランス人シェフから学ぶ必要があります。\nフランス人シェフ、高級料理の技術。職種も（スーシェフ、シェフドシェフなど）。\n調理法（コンフィ、スービッド、ソテーなど）やパルティの例など。",
      "title": "なぜ、フランス料理が料理の最高峰になったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以你知道，如果你想作为一名厨师被认真对待，或者你想成为顶级的顶级厨师，你必须花时间在法国学习，向他们学习。\n你必须花时间在法国向法国厨师学习高级餐饮艺术。\n法国厨师，学习高级餐饮的艺术。甚至连工作头衔（如副厨师长和厨师长）和烹饪技术也是如此。\npartie为例）和烹饪技术（煨、炖、炒......）。",
      "title": "法国菜是如何成为所有烹饪的顶峰的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以你知道，如果你想作爲一名廚師被認真對待，或者你想成爲頂級的頂級廚師，你必須花時間在法國學習，向他們學習。\n你必須花時間在法國向法國廚師學習高級餐飲藝術。\n法國廚師，學習高級餐飲的藝術。甚至連工作頭銜（如副廚師長和廚師長）和烹飪技術也是如此。\npartie爲例）和烹飪技術（煨、燉、炒......）。",
      "title": "法國菜是如何成爲所有烹飪的頂峯的？"
    }
  ]
}