{
  "author": "Derp_State_Agent",
  "original_created_utc": 1626014804,
  "title": "Closed my savings account, checking is next once a viable alternative is available. Fuck your banks.",
  "created_utc": 1626039253,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Fees, man. I pay to take out my own cash, i pay an overdraft fee instead of declining the purchase, i pay fees if i make too many transactions on my own account, i pay fees if my balance goes below a certain point and i get an interest rate that is offensively, insultingly low. </p>\n\n<p>It costs too much to be poor in America. I&#39;m literally charged by my bank for being too broke and I&#39;m fucking sick of it. Thank you for the pleasure and privilege of using your legacy (read: predatory) cefi financial system but I&#39;m fucking out.</p>\n\n<p>I&#39;ve had these accounts since i was literally a child, memorized my bank account numbers before i even knew what a SSN was. And it took me 35 years until cryptocurrency opened my eyes and showed me how badly we&#39;re being taken advantage of under this system.</p>\n\n<p>So I&#39;m moving on. My savings will be in stablecoins with generous APY because with crypto you do not need exorbitant amounts for your money to work for you. Normal people should have the same access to the same profit mechanisms that the wealthy have and i am of the perspective that crypto <strong>can potentially</strong> facilitate the greatest exchange of wealth this country has ever seen. So I&#39;m starting the process of migrating out of cefi as much as possible and assuming greater control over my own financial future. The bank is not looking out for us, that&#39;s for fucking certain, so we might as well start looking out for our own damn selves.</p>\n\n<p>Fuck your bank. Stop trickling our money upward and taking comfort in our financial serfdom, assuming anyone is looking out for our best interests. We have uniquely big opportunities in the labor market and the financial sector to change the landscape and move the balance more in our favor. If it hasn&#39;t been working for us then we can either force change or abandon the system, we can rug cefi and they know it and they are fucking terrified of crypto.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/oi5r0o/closed_my_savings_account_checking_is_next_once_a/",
  "subreddit": "CryptoCurrency",
  "id": "oi5r0o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Fees, man. I pay to take out my own cash, i pay an overdraft fee instead of\ndeclining the purchase, i pay fees if i make too many transactions on my own\naccount, i pay fees if my balance goes below a certain point and i get an\ninterest rate that is offensively, insultingly low.\n\nIt costs too much to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "料金だよ。自分で現金を引き出すのにもお金がかかるし、買い物を断る代わりに当座貸し越しの手数料を払う。\n自分の口座で多くの取引をすると手数料を払う。\n残高が一定以下になると手数料を払う。\n侮辱的なまでに低い金利。\n\nコストがかかりすぎるのです。",
      "title": "普通預金口座を解約しました。代替手段が利用可能になったら、次は当座預金口座を開設します。銀行なんてクソ食らえ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "费用，伙计。我花钱取出自己的现金，我支付透支费而不是拒绝购买。\n拒绝购买，如果我在自己的账户上做了太多的交易，我就得支付费用。\n如果我的余额低于某个点，我就要支付费用。\n如果我的余额低于某个点，我就要支付费用，而且我得到的利率低得令人讨厌，令人羞辱。\n\n它的成本太高了，以...",
      "title": "关闭了我的储蓄账户，一旦有可行的替代方案，下一步就是支票。去你的银行。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "費用，夥計。我花錢取出自己的現金，我支付透支費而不是拒絕購買。\n拒絕購買，如果我在自己的賬戶上做了太多的交易，我就得支付費用。\n如果我的餘額低於某個點，我就要支付費用。\n如果我的餘額低於某個點，我就要支付費用，而且我得到的利率低得令人討厭，令人羞辱。\n\n它的成本太高了，以...",
      "title": "關閉了我的儲蓄賬戶，一旦有可行的替代方案，下一步就是支票。去你的銀行。"
    }
  ]
}