{
  "author": "okletstrythisout3",
  "original_created_utc": 1656181272,
  "title": "Stop what you’re doing NOW and buy a cold wallet.",
  "created_utc": 1656210423,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Get your money off exchanges. &lt;/p&gt;\n\n&lt;p&gt;I had $100 on Celsius in a stable coin to see if the 8% APY was legit. I left it on there for a year and now I can’t access it. I can’t tell you how frustrating it is and that’s only 100 DOLLARS! Imagine if it was thousands...&lt;/p&gt;\n\n&lt;p&gt;I just got most of my crypto assets off of coinbase and it feels great.&lt;/p&gt;\n\n&lt;p&gt;These companies that seem too big to fail, can. Then they use everyday people like us to clean up their mess. &lt;/p&gt;\n\n&lt;p&gt;Learn from my mistake. Stop what you’re doing at this moment, buy cold wallet storage. It takes 30 minutes to set up and you have piece of mind about your crypto.&lt;/p&gt;\n\n&lt;p&gt;Much love &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 330,
  "permalink": "/r/CryptoCurrency/comments/vkl1ir/stop_what_youre_doing_now_and_buy_a_cold_wallet/",
  "subreddit": "CryptoCurrency",
  "id": "vkl1ir",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Get your money off exchanges.\n\nI had $100 on Celsius in a stable coin to see if the 8% APY was legit. I left it\non there for a year and now I can’t access it. I can’t tell you how frustrating\nit is and that’s only 100 DOLLARS! Imagine if it was thousands...\n\nI just got most of my crypto assets off…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "取引所から金を巻き上げる。\n\n私は、8%のAPYが正当であるかどうかを確認するために、安定したコインでセルシオに100ドルを持っていました。それを1年間放置して\nたままにしておいたのですが、今になってアクセスできなくなりました。どれだけ悔しいか分かりませんが\nたかが100ドル、されど100ドルです。それが数千ドルだったらと想像すると...。\n\n暗号資産もほとんど取れたし...",
      "title": "今やっていることをやめて、コールドウォレットを買いましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "把你的钱从交易所拿出来。\n\n我在Celsius上有100美元的稳定币，看看8%的APY是否合法。我把它\n我把它放在那里一年了，现在我不能访问它了。我无法告诉你这是多么令人沮丧的事情。\n这只是100美元！想象一下，如果是几千美元的话......。想象一下，如果是数千美元...\n\n我刚刚把我的大部分加密货币资产从...",
      "title": "现在停止你正在做的事情，买一个冷钱包。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "把你的錢從交易所拿出來。\n\n我在Celsius上有100美元的穩定幣，看看8%的APY是否合法。我把它\n我把它放在那裏一年了，現在我不能訪問它了。我無法告訴你這是多麼令人沮喪的事情。\n這只是100美元！想象一下，如果是幾千美元的話......。想象一下，如果是數千美元...\n\n我剛剛把我的大部分加密貨幣資產從...",
      "title": "現在停止你正在做的事情，買一個冷錢包。"
    }
  ]
}