{
  "author": "Lost-Guarantee229",
  "the_new_excerpt": "I am sure you all have heard of a Chinese Electric Vehicle manufacturer that\ngoes by the name $NIO – NIO Inc., [https://utradea.com/stocks/NIO] and I am sure\nthat you have heard them been called the “Tesla of China” but this title is very\ndeceiving and gives the impression that Nio perhaps copied…",
  "original_created_utc": 1623764045,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さんは、中国の電気自動車メーカーであるNIO Inc.をご存じでしょうか。\nNIO - NIO Inc. [https://utradea.com/stocks/NIO]という名前の中国の電気自動車メーカーをご存知でしょうか。\n中国のテスラ」と呼ばれているのを聞いたことがあると思います。\nしかし、このタイトルは非常に誤解を招きやすく、あたかもNIOがコピーしたかのような印象を与えてしまいます。",
      "title": "$NIOは注目に値する! (DD)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信你们都听说过一家中国的电动车制造商，它的名字叫NIO - NIO Inc.\nNIO - NIO Inc., [https://utradea.com/stocks/NIO]，我确信你们已经听到他们被称为 \"中国的特斯拉\"。\n我相信你们已经听说过他们被称为 \"中国的特斯拉\"，但这个标题非常\n但这个标题非常具有欺骗性，给人的印象是NIO也许抄袭了......",
      "title": "$NIO值得关注! (DD)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信你們都聽說過一家中國的電動車製造商，它的名字叫NIO - NIO Inc.\nNIO - NIO Inc., [https://utradea.com/stocks/NIO]，我確信你們已經聽到他們被稱爲 \"中國的特斯拉\"。\n我相信你們已經聽說過他們被稱爲 \"中國的特斯拉\"，但這個標題非常\n但這個標題非常具有欺騙性，給人的印象是NIO也許抄襲了......",
      "title": "$NIO值得關注! (DD)"
    }
  ],
  "title": "$NIO is worth looking in to!! (DD)",
  "created_utc": 1623767456,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am sure you all have heard of a Chinese Electric Vehicle manufacturer that goes by the name <a href=\"https://utradea.com/stocks/NIO\">$NIO – NIO Inc.,</a> and I am sure that you have heard them been called the “Tesla of China” but this title is very deceiving and gives the impression that Nio perhaps copied <a href=\"https://utradea.com/stocks/TSLA\">$TSLA - Tesla</a>. However, this is false because Nio has a completely different business model and very different technology (especially in their swappable batteries) than Tesla does. Nio is up nearly 1000% on the year, so I decided to do an analysis to find out what all the hype was about and if this hype can be justified.</p>\n\n<p><strong>Company Overview:</strong></p>\n\n<p>Nio is a leading manufacturer of premium, smart, electric vehicles. Nio designs, develops, manufactures, and sells their vehicles to their main customer base in China. Furthermore, Nio is constantly looking to improve upon their autonomous driving, digital technology, battery technology and their powertrains, in order to differentiate themselves from their competition.</p>\n\n<p>Nio has industry-leading battery swapping technology, which drives their battery as a service (BaaS) business. Additionally, Nio also has proprietary autonomous driving technology, which enables their Autonomous Driving as a Service (ADaaS) business.</p>\n\n<p>Nio currently sells their vehicles in China, however they are planning on expanding their business into international markets, to capitalize on the growing demand for EV’s. Nio has 4 vehicle models, their ES8, ES6, EC6, and their ET7.</p>\n\n<p><strong>Investment Information:</strong> </p>\n\n<p><em>Vehicle Offerings:</em></p>\n\n<p>· <strong>ES8</strong> is a 6-7 seat premium electric SUV that features 2 induction motors (240 kW). The ES8 accelerated from 0-100 kph in 4.4 seconds and is ranked 5 stars by the C-NCAP (Chinese New Car Assessment Program) for their safety standards. Lastly, the ES8 can go roughly 355 km on a single charge. IN 2020, Nio sold 10,861 of their ES8 models.</p>\n\n<p>· <strong>ES6</strong> is a 5-seat high-performance SUV that features one magnet motor (160 kW) and one induction motor (240 kW). The ES6 can accelerate from 0-100 kph in 4.7 seconds and can reach up to 430km on a single charge. In 2020, Nio sold 27,945 of their ES6 models.</p>\n\n<p>· <strong>EC6</strong> is a Coupe SUV that features one (160 kW) magnet motor, and a (240 kW) Induction motor. The EC6 is capable of accelerating from 0-100 kph in 4.5 seconds, and it can go 440 km (70 kWh battery) to 615 km (100 kWh battery) on a single charge. The EC6 also features a 2.1 square meter panoramic glass roof. In 2020, Nio sold a total of 4,922 of their EC6 models, basically just in Q4 alone (16 were sold in Q3 and none in Q1/Q2).</p>\n\n<p>· <strong>ET7</strong> is a Sedan that offers 1 front magnet motor (180 kW), and one back Induction motor (300 kW). The ET7 is very aerodynamic and can accelerate from 0-100 kph in a mere 3.9 seconds. The ET7 has 5-star safety ratings from both Chinese and European Assessment Programs. The ET7 also features their computing system (Adam) and super sensing system (Aquila). This vehicle is said to be able to reach distances of 1000 km on a single charge (with their 150-kWh battery).</p>\n\n<p><em>Battery Swapping (BaaS):</em></p>\n\n<p>Nio’s battery swapping technology is supported by over 1,200 patents and this technology is supported on all of Nio’s vehicles. This technology provides Nio customers with the convenience of quickly swapping their battery for another one to continue their journey quicker through a seamless recharge.</p>\n\n<p>Nio is releasing their Power Swap Station 2.0 in 2021, which will decrease their swap time to roughly 3 minutes and have the capacity for 13 rotational battery packs. In 2020, Nio had 172 Swapping Stations in 74 cities that swapped 1.4 million batteries.</p>\n\n<p>Nio’s Battery as a Service business generates revenue through “battery subscriptions”, in which users have flexible subscription options that they can choose to fit their battery swapping needs. Currently, Nio has several subscriptions for both their 70 kWh, and their 100 kWh batteries.</p>\n\n<p>If a customer were to select the 70-kWh subscription, they would enjoy approximately $11,000 (USD) off of the purchase price of their vehicle and pay a monthly subscription of approximately $150 (USD).</p>\n\n<p>If a customer selects the 100-kWh subscription plan, they will enjoy approximately $20,000 (USD) off of the purchase price of their vehicle and pay a monthly subscription of $231 (USD).</p>\n\n<p><em>Autonomous Driving (ADaaS):</em></p>\n\n<p>Nio has worked on their autonomous technology since day one and now delivers their products that come with “Nio Pilot”, their Advanced Driver-Assistance Systems (ADAS). Furthermore, Nio is about to roll out their Nio Autonomous driving (NAD).</p>\n\n<p>Consisting of 23 sensors, a front-facing tri-focal camera, 4 exterior cameras, 5 radars, 12 ultrasonic sensors and an interior driver-monitoring camera, <strong>Nio Pilot</strong> is Chinas only ADAS that is on the market. <a href=\"https://www.nio.com/news/new-nio-pilot-option-packs-and-navigation-pilot-2020\">Nio Pilot</a> has fleet learning and AI analysis capabilities that will be able to update their cars over the clous and improve their algorithms using their extensive backlog of driving data.</p>\n\n<p>In January 2021, Nio announced <a href=\"https://www.nio.com/nad\">their Autonomous Driving capabilities (NAD)</a>. The NAD system was developed in-house and features perception algorithms, localization, control strategy software, and platform software. The NAD technology uses their super computing platform “Adam”, and their super sensing system “Aquila”.</p>\n\n<p>Nio is planning to roll out their NAD to their customers, through a subscription model similar to their battery sapping service. This subscription is estimated to cost users $106 (USD) per month.</p>\n\n<p><em>Electric Powertrain:</em></p>\n\n<p>Nio has developed, designed, and manufactured their own proprietary electric powertrains in house since their inception. Nio makes powertrains that are specific to their vehicles, and through their Firmware over-the-air (FOTA) Nio is able to continually improve, update, and adjust their cars to fit the behaviour of their driver.</p>\n\n<p>Nio has greatly improved their motors moving from their 240-kW 2nd generation induction motor to their 300-kW 3rd generation induction motor. Additionally, Nio has improved their magnet motors from 160 kW (2nd gen.) to 180 kW (3rd gen.)</p>\n\n<p>It is this constant drive to keep improving their technology that will help separate Nio from their competitors and help Nio to become one of the best EV manufacturers.</p>\n\n<p><em>Battery:</em></p>\n\n<p>Nio is very committed to R&amp;D and innovating their battery technology. Currently, Nio offers two battery options: their 70-kWh battery, and their 100-kWh battery. </p>\n\n<p>Their 70-kWh battery is designed, developed and manufactured in-house, and combines Nickel-Cobalt-Manganese) NCM prismatic cells, liquid cooling systems and intelligent battery management systems.</p>\n\n<p>Their proprietary and patented 100-kWh battery features thermal propagation prevention, climate thermal management, and bi-directional cloud Building Management Systems (BMS).</p>\n\n<p>Nio has also <a href=\"https://insideevs.com/news/465188/nio-150-kwh-solid-state-batteries-2022/\">announced their 150-kWh battery</a> which is expected to release in Q4 2022, or Q1 2023, which is another large innovation to their existing technology and proves their determination to be the most innovative.</p>\n\n<p><em>Intellectual Property:</em></p>\n\n<p>Nio has developed a number of proprietary technologies throughout their business journey. Nio relies on their ability to protect their technologies and property through the use of patents, patent applications, NDA’s, copyrights, trademarks, and intellectual property licenses.</p>\n\n<p>Nio currently has 2,654 patents that have been approved, 1,397 patents that are in the application process, 3,373 registered trademarks, 804 trademark applications, 133 copyrights, and 686 registered domain names.</p>\n\n<p><em>Financial information:</em></p>\n\n<p>· <strong>Financial Performance (Good):</strong> Vehicle sales are up by 106.08% YoY, and their cost of sales is only up by 63.72%, which means that their margins are improving. This year was Nio’s first year having a gross profit, which equalled $287M (USD). Their SG&amp;A expenses decreased by 27.88% YoY, which is good and helps their margins. Lastly, Nio decreased their operating loss by 58.42% which shows that they are making their way towards profitability, which would be a huge milestone.</p>\n\n<p>· <strong>Financial Performance (Bad):</strong> R&amp;D expense decreased by 43.82% YoY. While this usually is a good sign, R&amp;D is important to Nio’s business model and future successes, so I would like this figure to be higher. Although Nio decreased their operating losses, they still reported a $706M operating loss (USD) and a $813M net loss, this is not favourable for investors and might scare away potential investors.</p>\n\n<p>· <strong>Stock Incentive Plan:</strong> Nio’s stock incentive plan was designed to attract and retain the best possible personnel to promote the success of Nio’s business. Under their 2015, 2016, 2017 and 2018 stock plans, there are currently 79.32M shares outstanding, that have yet to have been granted. If all of these outstanding shares were to be granted, it would cause dilutionary effects of roughly 6.45%.</p>\n\n<p>· <strong>Share Options:</strong> As of December 31st, 2020, there are 32.5M common shares available in options that are yet to be exercised (and converted into common shares). If these options were to be exercised, it would cause a dilutionary effect of 2.6%.</p>\n\n<p>· <strong>Restricted Shares Outstanding:</strong> Currently, there are 1,735,744 shares outstanding that are classified as “restricted”, these shares will be vested gradually over a period of time, these shares have a weighted-average period of 3.6 years. If these shares were put on the market today it would cause dilutionary effects of 0.14% over 3.6 years, which is essentially negligible.</p>\n\n<p><em>Management Team:</em></p>\n\n<p>One of the most important aspects of high-growth stocks is the management team that is heading the company. We have seen awful management teams destroy promising stocks over and over again, so it important to know the management team, their experience, and their track record(s). With that being said, lets dive into Nio’s management team.</p>\n\n<p>· <strong>Bin Li (CEO &amp; Chairman):</strong> Mr. Li founded and served as the director for Beijing Bitauto E-commerce Co. from 2000-2006. After that, Mr. Li served as the chairman of the board of Bitauto Holdings. (Formerly listed on the NYSE. Mr. Li has also been named as one of the top 10 most influential/distinguishable people in China’s automotive industry by CADA in 2008. As we can see Mr. Li has a history in the automotive space and is a distinguished person in the space as well, which can help vouch for his credibility.</p>\n\n<p>· <strong>Lihong Qin (President &amp; Director):</strong> Prior to Nio, Mr. Qin was the Chief Marketing Officer and Executive Director at Longfor Properties Co. from 2008-2014. Mr. Qin also served as a Senior Consultant and Deputy GM of Anhui Chery Automobile Sales and Service Company form 2005-2008. Mr. Qin has both a background in the Auto Industry (though Anhui Chery) and in the field of management (through Longfor Properties).</p>\n\n<p>· <strong>Feng Shen (Executive VP):</strong> Mr. Shen worked in several executive management roles prior to working at Nio. Mr. Shen was the President and CTO at Polestar China, President and VP at Volvo Cars China and Volvo Asia-Pacific, Chairman at China-Sweden Traffic Safety Research Center from 2010-2017. Prior to this he worked at Ford Motor Company as a Powertrain manager. Mr. Shen has extensive experience in both the management space (Polestar and China-Sweden Traffic), and the automotive industry (Ford, and Volvo).</p>\n\n<p>· <strong>Xin Zhou (Executive VP):</strong> Mr. Zhou served as the Executive Director at Qoros Automotive C. from 2009-2015, and prior to this was the Engagement Manager at McKinsey Co. from 2007-2009. Mr. Zhou has experience in both the Automotive Industry, as well as in management positions, and his experience will be an asset for Nio in the future.</p>\n\n<p>· <strong>Wei Feng (CFO):</strong> Mr. Feng was previously the Managing Director and Head of the auto/auto parts research team at China International Capital Corp. from 2013-2019. Prior to this he was an industry analyst at Everbright Securities from 2010-2013. Mr.Feng has great experience in the financial industry, and has focused on the auto industry and researching the industry. </p>\n\n<p>· <strong>Ganesh Iyer (Chief Information Officer):</strong> Mr.Iyer has over 32 years of experience In the autonomous technology, hi-tech, manufacturing, and telecom industries. Mr. Iyer was previously the VP of IT at Tesla from 2012-2016 and was the Senior IT roles at VMWare from 2010-2012. Mr. Iyer has plenty of experience that will help him to drive the future progression/growth at Nio.</p>\n\n<p><strong>Investment Valuation:</strong> </p>\n\n<p>The only way in which I could value Nio is through a set of comparable analyses. These analyses will compare some of Nio’s financial ratio’s/multiples to that of their competitors.</p>\n\n<p><em>Comparable Analysis #1:</em></p>\n\n<p>In this comparable I compared Nio’s financial ratios to that of <a href=\"https://utradea.com/stocks/TSLA\">$TSLA – Tesla</a>, <a href=\"https://utradea.com/stocks/XPEV\">$XPEV – Xpeng</a>, and <a href=\"https://utradea.com/stocks/LI\">$LI – Li Auto</a>.</p>\n\n<p><em>EV/Assets:</em></p>\n\n<p>When comparing Nio’s EV/Assets multiple to that of their competitors (as listed above), I found that Nio has a fair value of $257.66, which wouldimply a share price increase of 453.39%. This is very optimistic, so I decided to undergo more comparables to find out if this result was consistent.</p>\n\n<p><em>EV/Revenue:</em></p>\n\n<p>By Comparing Nio’s EV/Revenue multiple to that of their competitors (excluding Xpeng because their ratio was not positive), I found that Nio is $196.70, which implies an increase in value of 322.47%. This is quite similar and consistent with the results achieved in the EV/Assets comparable, so I decided to do one last comparable to gain more insight.</p>\n\n<p><em>P/B:</em></p>\n\n<p>By comparing Nio’s P/B ratio to that of their competitors, I arrived at a fair value of $45.19 per share, which would imply a downside risk of 2.94%. This is inconstant with the other 2 results, so I decided to average the results achieved by each comparable to reach an unbiased valuation.</p>\n\n<p><em>Average Comparable #1:</em></p>\n\n<p>By taking the average of all 3 comparable that I underwent in this analysis I arrived at a final all-encompassing price target of $166.51, which would imply a price increase of 257.62%.</p>\n\n<p><em>Comparable #2:</em></p>\n\n<p>I decided to undergo a second comparable to factor out the influence of Tesla on the results of my first comparable. I did this for a variety of reasons, which include Tesla being valued so much higher than the other EV comparable companies, Tesla being the only company located outside of China (this is because Chinese companies tend to be undervalued, so taking the comparable for these solely Chinese companies makes more sense), and these other companies pose more of a threat to Nio given their <strong><em>current</em></strong> geographical reach.</p>\n\n<p><em>EV/Assets:</em></p>\n\n<p>By comparing Nio’s EV/Assets multiple to XPeng and Li Auto, I found that Nio’s fair value is approximately $51.64, which would imply a share price increase of 10.91%. this is very reasonable, however I decided to undergo the other comparable to either validate or invalidate this result.</p>\n\n<p><em>EV/Revenue:</em></p>\n\n<p>By comparing Nio’s EV/Revenue multiple to Li Auto (because XPeng does not have a positive EV/Revenue multiple), I arrived at a fair value of Nio of $52.00, which would imply an upside of 11.68%. Once again, this is very reasonable and constant with the result from the EV/Assets comparable.</p>\n\n<p><em>P/B:</em></p>\n\n<p>By comparing Nio’s P/B multiple to their Chinese competitors, I arrived at a fair value of $37.46, which implies a downside risk of 19.54%. This is not consistent with the results achieved in the previous 2 analyses, and as a result of this I decided to average my results to achieve an unbiased fair value.</p>\n\n<p><em>Average Comparable #2:</em></p>\n\n<p>By taking the average of the fair values that I achieved in the 2nd comparable analysis (w/o Tesla), I achieved one all-encompassing fair value of $47.03, which implies an upside of 1.07%, meaning that Nio is approximately at fair value in comparison to their Chinese competitors.</p>\n\n<p><em>My Thoughts:</em></p>\n\n<p>I think the fact that Nio is undervalued when comparing them to their Chinese competitors is very good for the stock. I believe that Nio should be overvalued compared to them because Nio presents a larger upside. The fact that Nio is undervalued is very bullish, and when incorporating Tesla is extremely bullish. I think the comparable with Tesla will be more applicable when Nio starts to expand their operations internationally, as they will likely start to be valued as less of a “Chinese stock” and more of a legitimate EV company.</p>\n\n<p>I think that investors need to keep up to date with Nio’s financial reports to make sure that they are on the right track, since here is no way to do a proper DCF right now. But other than this, Nio is looking very bullish.</p>\n\n<p><strong>Risks:</strong> </p>\n\n<p>· <strong>Dilution:</strong> Nio has multiple different streams of possible dilution that will negatively affect their shares price, these streams consist of Nio’s Share Incentive Plan, Stock Options, and Restricted Stock Units. All of these streasm would combine to make a total dilutionary effect of roughly 9.19%, which is not bad. Typically, high growth stocks have large amounts of dilution, and some of Nio’s dilution is spread over 3 years, so I do not see this being a huge risk, although it is worth keeping in mind.</p>\n\n<p>· <strong>Financial Performance</strong>: Nio reported an operating loss and net loss of $706M and $813M respectively, this level of loss is not great to see as investors however they are making moves toward profitability which is good to see. Furthermore, Nio almost cut their R&amp;D spending by ½, which is not favourable in my eyes because I would rather Nio spend the extra money to further develop their technologies and be the most technologically advanced EV maker in China/the World.</p>\n\n<p><strong>Catalysts:</strong></p>\n\n<p>· <strong>Financial Performance:</strong> Nio exhibited great growth YOY, while keeping the cost of sales growth significantly lower than their revenue growth. Furthermore, Nio reported a gross profit for the first time and decreased their operating losses significantly. If Nio can continue to improve their financial reports/position, and become profitable in the near future, then this will serve as a huge catalyst for Nio.</p>\n\n<p>· <strong>Social Sentiment:</strong> According to <a href=\"https://utradea.com/feed\">Utradea’s Social Sentiment Tracker</a>, Nio is currently the 20th, 16th, and 18th most trending stock om Reddit in the past 4, 24, and 48 hours respectively, with an overall positive sentiment. As we know Reddit can have beneficial impacts on stocks that they target and is important to keep in mind as a current/future investor.</p>\n\n<p>· <strong>Technology:</strong> Nio has been consistently improving upon their technology, moving from their 1st to 2nd, and now to their 3rd generation of Electric Powertrains. Nio has consistently been improving their motors (both magnet and induction) to futher the technology of their EV’s and offer superior range. Furthermore, Nio is set to release their 150-kWh battery in late 2022, this battery is expected to have a range of 1000km, if this is true they will have the longest range of any EV by a long shot, which will help show Nio’s superior technology.</p>\n\n<p>As you can imagine, this analysis too a lot of time for me to put together, so I would greatly appreciate it if you <a href=\"https://utradea.com/member-portfolio/WallStreetWhale?utm_source=R&amp;utm_medium=B&amp;utm_campaign=NIO\">follow me</a> to read my previous posts nd stay up-to-date on my new posts!</p>\n</div><!-- SC_ON -->",
  "score": 94,
  "permalink": "/r/stocks/comments/o0ehbn/nio_is_worth_looking_in_to_dd/",
  "subreddit": "stocks",
  "id": "o0ehbn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009745204
}