{
  "author": "AzureBuzzSaw",
  "the_new_excerpt": "New to this so maybe a nonsensical question but: I was thinking about how a 4\ndollar stock needs to lose 75% of its value to reach one dollar, but a one\ndollar stock needs to grow by 400% of its value to reach 4 dollars.\n\nIs it easier for a stock or security to tank in price than to grow, or is…",
  "original_created_utc": 1622935454,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "初めてなので、無意味な質問かもしれませんが。4ドルの株が1ドルになるには75％の価値を失う必要があります。\n4ドルの株が1ドルになるにはその価値の75%を失う必要がありますが、1ドルの株が4ドルになるにはその価値の400%の成長が必要です。\n4ドルの株は1ドルになるために75％の価値を失う必要がありますが、1ドルの株は4ドルになるためにその価値の400％の成長が必要です。\n\n株式や証券は、成長するよりも価格が暴落する方が簡単なのでしょうか。それとも...",
      "title": "証券の価格を上げるよりも下げる方が、「エネルギー」が少なくて済むのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是一个新问题，所以可能是一个无意义的问题，但是。我在想，一只4美元的股票\n美元的股票需要损失其价值的75%才能达到1美元，但1美元的股票需要增长其价值的400%才能达到4美元。\n美元的股票需要增长其价值的400%才能达到4美元。\n\n对于一只股票或证券来说，价格下跌比增长更容易，还是...",
      "title": "降低证券价格所需的 \"能量 \"是否比提高价格要少？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是一個新問題，所以可能是一個無意義的問題，但是。我在想，一隻4美元的股票\n美元的股票需要損失其價值的75%才能達到1美元，但1美元的股票需要增長其價值的400%才能達到4美元。\n美元的股票需要增長其價值的400%才能達到4美元。\n\n對於一隻股票或證券來說，價格下跌比增長更容易，還是...",
      "title": "降低證券價格所需的 \"能量 \"是否比提高價格要少？"
    }
  ],
  "title": "Does it take less \"energy\" to lower the price of a security than to raise it?",
  "created_utc": 1622966946,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>New to this so maybe a nonsensical question but: I was thinking about how a 4 dollar stock needs to lose 75% of its value to reach one dollar, but a one dollar stock needs to grow by 400% of its value to reach 4 dollars.</p>\n\n<p>Is it easier for a stock or security to tank in price than to grow, or is this just some weird artifact of math that is confusing my brain?</p>\n</div><!-- SC_ON -->",
  "score": 46,
  "permalink": "/r/stocks/comments/nt87eg/does_it_take_less_energy_to_lower_the_price_of_a/",
  "subreddit": "stocks",
  "id": "nt87eg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404886633
}