{
  "author": "bidudeama",
  "original_created_utc": 1634549727,
  "title": "How do I navigate family who refuse to acknowledge my grandad was a child molester?",
  "created_utc": 1634556056,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My grandad raped all his male children. His eldest son killed himself at 19. </p>\n\n<p>He raped all of my male cousins as children. </p>\n\n<p>It is well known and undisputable. </p>\n\n<p>He died 5 years ago and people are still posting memorial bullshit praising the man and how great he was. Some of them are unaware, some of them were victims. </p>\n\n<p>Apparently me and my brother were the only boys in my family not to be abused by him because my mother refused to ever leave us near him. He was my fathers, father. My fathers mother was aware of the abuse and never did anything to help. She died 10 years before he did. </p>\n\n<p>He was an absolute monster and Im glad he&#39;s fucking dead. Im tempted to just type out the whole truth and copy paste it across every post they make, I&#39;m sick of people pretending it didn&#39;t happen, and anyone who doesn&#39;t know should know what he was really like.</p>\n\n<p>Edit - The main reason I havent already is I don&#39;t know how it may affect his victims.</p>\n</div><!-- SC_ON -->",
  "score": 141,
  "permalink": "/r/TooAfraidToAsk/comments/qaj948/how_do_i_navigate_family_who_refuse_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "qaj948",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My grandad raped all his male children. His eldest son killed himself at 19.\n\nHe raped all of my male cousins as children.\n\nIt is well known and undisputable.\n\nHe died 5 years ago and people are still posting memorial bullshit praising the\nman and how great he was. Some of them are unaware, some of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の祖父は、男の子供全員をレイプしました。長男は19歳で自殺してしまいました。\n\n彼は私のいとこの男性全員を子供の頃にレイプしました。\n\nこれはよく知られていることで、議論の余地はありません。\n\n彼は5年前に亡くなりましたが、人々はいまだにその人を賞賛し、彼がいかに偉大であったかを称えるような追悼文を投稿しています。\n彼がいかに偉大であったかを賞賛しています。何人かは無自覚で、何人かは...",
      "title": "私の祖父が児童虐待をしていたことを認めようとしない家族と、どのように付き合っていけばいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的祖父强奸了他所有的男孩子。他的长子在19岁时自杀了。\n\n他强奸了我所有小时候的男性表兄弟。\n\n这是众所周知、无可争议的。\n\n他5年前去世了，人们还在张贴纪念性的废话，赞扬这个人和他的伟大。\n和他有多么伟大。他们中的一些人不知道，一些...",
      "title": "我如何驾驭那些拒绝承认我祖父是娈童者的家人呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的祖父強姦了他所有的男孩子。他的長子在19歲時自殺了。\n\n他強姦了我所有小時候的男性表兄弟。\n\n這是衆所周知、無可爭議的。\n\n他5年前去世了，人們還在張貼紀念性的廢話，讚揚這個人和他的偉大。\n和他有多麼偉大。他們中的一些人不知道，一些...",
      "title": "我如何駕馭那些拒絕承認我祖父是孌童者的家人呢？"
    }
  ]
}