{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "Hi, all.\n\nI posted this earlier, but it's so deeply buried in a very long thread that no one will see it. In case it might prove helpful, here it is:\n\nThere's something that I call the POWcycle that has defined market conditions since mid-Feb 2021. The cycle is this:\n\n1. Each month, the CPI is released;\n2. Every six weeks, the two-day FOMC meeting is held; and\n3. Right afterward, the JPow holds a press conference.\n\n(Please note that FOMC meeting minutes are released three weeks after the FOMC meets; these can sometimes have a dangerous effect throughout the stock market, so you'll want to pay attention to the timing. Usually, no one cares, but in inflationary conditions like this, this can be an important catalyst, i.e. risk to try to avoid, depending on what's in them; you'll know based on the market reaction, which will occur within several minutes of the release of the meeting minutes.)\n\nOften, because market participants anticipate and react to the future preemptively, there is a mini-crash sometime within ten days leading up to 1, and about one week leading up to 3. It might happen ten days before, but it's not very likely. It might happen five days before. It might happen the day of. Think of atomic orbitals and probability clouds.\n\nWhat this creates is a situation where some periods are relatively less dangerous than others. To really try to figure out the most opportune buying and selling times, make a list of the companies that you're most interested in, and then research how they've behaved for the past year with respect to the POWcycle, and try not to get caught on the wrong side of it. Buy when the market is very red and others are afraid. Sell into strength, when the market is green and others think that the coast is clear.\n\nAlso note that sooner or later, the market will transition out of the POWcycle into another state. (At a macroscopic level, think of market conditions as a finite state machine. There are distinct states, but identifying the transitions isn't easy.) It will do this when what the Fed will do to combat inflation will truly have been priced in. Since the Fed doesn't know, and since we can't anticipate how the war against the Ukraine will unfold, never mind the virus and the disruptions to the supply chain that it'll cause in China and elsewhere, it's always better to be patient and try to err on the side of caution.\n\nThe JPow will hold his next press conference on Wed 4 May, which is eighteen days away. If the past fourteen months (with rare exceptions) replay themselves again, then we would expect another buying opportunity in the run-down to that event or during it. Again, we can't predict the future, but we can try to learn from the past and anticipate what might happen again, so that in case it does, we can be ready. That means knowing what we'd like to buy, and having a plan to buy it, including triggering conditions, the amount of capital to allocate to a full position in that security, a scaling strategy, and a risk management strategy.\n\nThere are three important things to keep in mind:\n\n1. Valuation always matters. Learn to perform a DCF and establish a multiplier for the resultant fair price per share of a stock based on how similar companies' theoretical fair values are being multiplied by the current market conditions. (Multiplier contraction and expansion occur over time as the result of various factors; for instance, with growth stocks, it's a function of interest rate changes and sentiment, among other factors.) Don't just buy shares in a company. Know what they're really worth, and make comparisons.\n2. As interest rates increase, the growth companies get hurt the most. This is because their cost of capital increases. (They have to pay more interest on loans. Even worse, they can get backed into a corner and be forced to issue new shares, which dilutes existing shareholders immediately and usually quite substantially.) Because they don't make a profit, they're forced to take out loans or issue new shares (there are other possibilities, but those are the main two) just to be able to keep paying employees. Unless they did this, they'd go bankrupt. This is why investors sell out of and avoid growth companies like the plague in inflationary conditions such as this. The reason that many of these companies have crashed by at least 60% is because they became drastically overvalued. When a company needs to operate for fifty years to make back its own market cap and it's simply not growing very much, it's important to not get trapped within it, because it might never recover, or it might flatline for a decade while other securities move way up. In the worst case, it could delete all of your money. Sometimes it makes sense to try to take advantage of others' fear. This is why I advocate buying MELI, PLTR, and SE while they're down. Within three years, the probability is very high that each of them will outperform QQQ.\n3. Inflation is the single most critical driver of stock market behavior right now. The primary cause of inflation is the doubling of the money supply caused by all of the Fed's money-printing. Some of that money has been burned up by retail panic-selling for a loss, and as the result of margin calls. Both of these delete capital, as if it had never existed. While tragic for the individual or institution that realized losses, this ironically helps to attenuate inflation. The only \"problem\" is that not enough of it happens to have a major impact, but it does help a bit. Right now, we're in a trader's market characterized by high and unpredictable volatility, overvaluation, and inflation.\n\nIt hasn't been a great time to be an investor, and no one really knows how bad conditions will get, whether there will be a recession, how the labor market and fiscal policy will be affected, whether there will emerge a crisis for US debt repayments, given higher interest rates, etc. It doesn't take a macroeconomist to see that there's a lot more bad news than good. Because of all of this, I recommend proceeding slowly and cautiously. Don't get fooled by \"relief rallies.\"\n\nIf you look at market dynamics, you find that for a long time now, there have been far more companies near their lows than highs. The winners are far and few between, and highly concentrated. This is why investors in index funds have outperformed growth stock investors by an incredible margin, for instance. This isn't healthy for the market. We've been looking very closely for signs that IWO (an ETF that's made up of the growth stock subset of the Russell 2000) has bottomed. No one is quite sure whether we might take out previous lows. This is why I'm personally being very cautious and waiting to see how the market will react to the JPow's upcoming press conference and the release of the subsequent CPI.\n\nMarket participants can ultimately only price in what they can reasonably anticipate. Anything unexpected hasn't been priced in, and no one has seen a downtrend in the CPI, among other factors, yet to be able to declare that the coast is clear. Proceed slowly. As we like to say, \"It's better to be late and safe rather than early and sorry.\" I know that your money is being eaten up by inflation, but on a single month basis, the decline in buying power isn't very much. Wait for the right opportunity.\n\nI hope that this helps a bit. Some of us run a free Discord server, but I don't think I can post it here. If anyone is interested, you're welcome to private message me.\n\nHang in there, and good luck,\n\nArtem",
  "author_fullname": "t2_4c1jbiau",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Beware the POWcycle",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_u521ic",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.86,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 41,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 41,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1650130894,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1650128275,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi, all.&lt;/p&gt;\n\n&lt;p&gt;I posted this earlier, but it&amp;#39;s so deeply buried in a very long thread that no one will see it. In case it might prove helpful, here it is:&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s something that I call the POWcycle that has defined market conditions since mid-Feb 2021. The cycle is this:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Each month, the CPI is released;&lt;/li&gt;\n&lt;li&gt;Every six weeks, the two-day FOMC meeting is held; and&lt;/li&gt;\n&lt;li&gt;Right afterward, the JPow holds a press conference.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;(Please note that FOMC meeting minutes are released three weeks after the FOMC meets; these can sometimes have a dangerous effect throughout the stock market, so you&amp;#39;ll want to pay attention to the timing. Usually, no one cares, but in inflationary conditions like this, this can be an important catalyst, i.e. risk to try to avoid, depending on what&amp;#39;s in them; you&amp;#39;ll know based on the market reaction, which will occur within several minutes of the release of the meeting minutes.)&lt;/p&gt;\n\n&lt;p&gt;Often, because market participants anticipate and react to the future preemptively, there is a mini-crash sometime within ten days leading up to 1, and about one week leading up to 3. It might happen ten days before, but it&amp;#39;s not very likely. It might happen five days before. It might happen the day of. Think of atomic orbitals and probability clouds.&lt;/p&gt;\n\n&lt;p&gt;What this creates is a situation where some periods are relatively less dangerous than others. To really try to figure out the most opportune buying and selling times, make a list of the companies that you&amp;#39;re most interested in, and then research how they&amp;#39;ve behaved for the past year with respect to the POWcycle, and try not to get caught on the wrong side of it. Buy when the market is very red and others are afraid. Sell into strength, when the market is green and others think that the coast is clear.&lt;/p&gt;\n\n&lt;p&gt;Also note that sooner or later, the market will transition out of the POWcycle into another state. (At a macroscopic level, think of market conditions as a finite state machine. There are distinct states, but identifying the transitions isn&amp;#39;t easy.) It will do this when what the Fed will do to combat inflation will truly have been priced in. Since the Fed doesn&amp;#39;t know, and since we can&amp;#39;t anticipate how the war against the Ukraine will unfold, never mind the virus and the disruptions to the supply chain that it&amp;#39;ll cause in China and elsewhere, it&amp;#39;s always better to be patient and try to err on the side of caution.&lt;/p&gt;\n\n&lt;p&gt;The JPow will hold his next press conference on Wed 4 May, which is eighteen days away. If the past fourteen months (with rare exceptions) replay themselves again, then we would expect another buying opportunity in the run-down to that event or during it. Again, we can&amp;#39;t predict the future, but we can try to learn from the past and anticipate what might happen again, so that in case it does, we can be ready. That means knowing what we&amp;#39;d like to buy, and having a plan to buy it, including triggering conditions, the amount of capital to allocate to a full position in that security, a scaling strategy, and a risk management strategy.&lt;/p&gt;\n\n&lt;p&gt;There are three important things to keep in mind:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Valuation always matters. Learn to perform a DCF and establish a multiplier for the resultant fair price per share of a stock based on how similar companies&amp;#39; theoretical fair values are being multiplied by the current market conditions. (Multiplier contraction and expansion occur over time as the result of various factors; for instance, with growth stocks, it&amp;#39;s a function of interest rate changes and sentiment, among other factors.) Don&amp;#39;t just buy shares in a company. Know what they&amp;#39;re really worth, and make comparisons.&lt;/li&gt;\n&lt;li&gt;As interest rates increase, the growth companies get hurt the most. This is because their cost of capital increases. (They have to pay more interest on loans. Even worse, they can get backed into a corner and be forced to issue new shares, which dilutes existing shareholders immediately and usually quite substantially.) Because they don&amp;#39;t make a profit, they&amp;#39;re forced to take out loans or issue new shares (there are other possibilities, but those are the main two) just to be able to keep paying employees. Unless they did this, they&amp;#39;d go bankrupt. This is why investors sell out of and avoid growth companies like the plague in inflationary conditions such as this. The reason that many of these companies have crashed by at least 60% is because they became drastically overvalued. When a company needs to operate for fifty years to make back its own market cap and it&amp;#39;s simply not growing very much, it&amp;#39;s important to not get trapped within it, because it might never recover, or it might flatline for a decade while other securities move way up. In the worst case, it could delete all of your money. Sometimes it makes sense to try to take advantage of others&amp;#39; fear. This is why I advocate buying MELI, PLTR, and SE while they&amp;#39;re down. Within three years, the probability is very high that each of them will outperform QQQ.&lt;/li&gt;\n&lt;li&gt;Inflation is the single most critical driver of stock market behavior right now. The primary cause of inflation is the doubling of the money supply caused by all of the Fed&amp;#39;s money-printing. Some of that money has been burned up by retail panic-selling for a loss, and as the result of margin calls. Both of these delete capital, as if it had never existed. While tragic for the individual or institution that realized losses, this ironically helps to attenuate inflation. The only &amp;quot;problem&amp;quot; is that not enough of it happens to have a major impact, but it does help a bit. Right now, we&amp;#39;re in a trader&amp;#39;s market characterized by high and unpredictable volatility, overvaluation, and inflation.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;It hasn&amp;#39;t been a great time to be an investor, and no one really knows how bad conditions will get, whether there will be a recession, how the labor market and fiscal policy will be affected, whether there will emerge a crisis for US debt repayments, given higher interest rates, etc. It doesn&amp;#39;t take a macroeconomist to see that there&amp;#39;s a lot more bad news than good. Because of all of this, I recommend proceeding slowly and cautiously. Don&amp;#39;t get fooled by &amp;quot;relief rallies.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;If you look at market dynamics, you find that for a long time now, there have been far more companies near their lows than highs. The winners are far and few between, and highly concentrated. This is why investors in index funds have outperformed growth stock investors by an incredible margin, for instance. This isn&amp;#39;t healthy for the market. We&amp;#39;ve been looking very closely for signs that IWO (an ETF that&amp;#39;s made up of the growth stock subset of the Russell 2000) has bottomed. No one is quite sure whether we might take out previous lows. This is why I&amp;#39;m personally being very cautious and waiting to see how the market will react to the JPow&amp;#39;s upcoming press conference and the release of the subsequent CPI.&lt;/p&gt;\n\n&lt;p&gt;Market participants can ultimately only price in what they can reasonably anticipate. Anything unexpected hasn&amp;#39;t been priced in, and no one has seen a downtrend in the CPI, among other factors, yet to be able to declare that the coast is clear. Proceed slowly. As we like to say, &amp;quot;It&amp;#39;s better to be late and safe rather than early and sorry.&amp;quot; I know that your money is being eaten up by inflation, but on a single month basis, the decline in buying power isn&amp;#39;t very much. Wait for the right opportunity.&lt;/p&gt;\n\n&lt;p&gt;I hope that this helps a bit. Some of us run a free Discord server, but I don&amp;#39;t think I can post it here. If anyone is interested, you&amp;#39;re welcome to private message me.&lt;/p&gt;\n\n&lt;p&gt;Hang in there, and good luck,&lt;/p&gt;\n\n&lt;p&gt;Artem&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "u521ic",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "4rt3m0rl0v",
  "discussion_type": null,
  "num_comments": 21,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/u521ic/beware_the_powcycle/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/u521ic/beware_the_powcycle/",
  "subreddit_subscribers": 3903686,
  "created_utc": 1650146423,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1650128275,
  "the_new_excerpt": "Hi, all.\n\nI posted this earlier, but it's so deeply buried in a very long thread that no\none will see it. In case it might prove helpful, here it is:\n\nThere's something that I call the POWcycle that has defined market conditions\nsince mid-Feb 2021. The cycle is this:\n\n 1. Each month, the CPI is…"
}