{
  "author": "1078Garage",
  "original_created_utc": 1625400489,
  "title": "The crypto Dead Man's Switch - utilising smart contracts to transfer wealth automatically at death",
  "created_utc": 1625427257,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s a movie trope you&#39;ve probably seen many times before: &quot;If I die, all that incriminating evidence is sent straight to the Feds!&quot;  Could the blockchain do this one day? The Apple Watch already has an automatic SOS feature where it will call emergency services with a latitude and longitude if the accelerometer registers a hard fall. Take this just a little bit further: the heartrate monitor detects asystolic cardiac arrest for 30 minutes. This triggers an oracle that tells a smart contract within your crypto on the blockchain to move it to a pre-determined wallet automatically. </p>\n\n<p>Seeing some posts here about making provisions for your loved ones after death got me thinking about the volume of crypto that must be lost forever on the blockchain. Maybe a Dead Man&#39;s Switch could help ensure this occurs just a little less. </p>\n\n<p>Last thought: Could smart contracts also fulfil the movie trope scenario? If you didn&#39;t interact with a blockchain asset within certain time parameters could it &quot;move itself&quot; to another wallet? Thanks for indulging my curiosity guys.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/odj6h0/the_crypto_dead_mans_switch_utilising_smart/",
  "subreddit": "CryptoCurrency",
  "id": "odj6h0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's a movie trope you've probably seen many times before: \"If I die, all that\nincriminating evidence is sent straight to the Feds!\" Could the blockchain do\nthis one day? The Apple Watch already has an automatic SOS feature where it will\ncall emergency services with a latitude and longitude if the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あなたも何度も目にしたことがあるであろう、映画のワンシーンです。\"「私が死ねば、その証拠はすべて\n私が死んだら、その証拠はすべて連邦政府に送られてしまう！」というものです。ブロックチェーンは、いつか\nブロックチェーンでもいつかは実現できるのでしょうか？Apple Watchにはすでに自動SOS機能があり、そこでは\nApple Watchにはすでに自動SOS機能が搭載されており、緊急事態が発生した場合、緯度と経度を指定して救急隊に連絡することができます。",
      "title": "暗号化されたDead Man's Switch - スマートコントラクトを活用して、死亡時に自動的に富を移転する。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是一个你可能已经看过很多次的电影套路。\"如果我死了，所有这些\n所有的罪证都会被直接送到联邦调查局！\" 区块链会不会有一天做到\n有一天能做到这一点吗？苹果手表已经有一个自动SOS功能，它将\n呼叫紧急服务，并提供经纬度，如果...",
      "title": "加密的 \"死人开关\"--利用智能合约在死亡时自动转移财富"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是一個你可能已經看過很多次的電影套路。\"如果我死了，所有這些\n所有的罪證都會被直接送到聯邦調查局！\" 區塊鏈會不會有一天做到\n有一天能做到這一點嗎？蘋果手錶已經有一個自動SOS功能，它將\n呼叫緊急服務，並提供經緯度，如果...",
      "title": "加密的 \"死人開關\"--利用智能合約在死亡時自動轉移財富"
    }
  ]
}