{
  "author": "ScottyStellar",
  "the_new_excerpt": "R/Stocks has surpassed 1 million subscribers, and we'd like to celebrate by\nkicking off a (potentially annual) fundraising event!\n\nMany of us have done well due to the insights, DD, and lessons learned on this\nsubreddit.\n\n * Did you make some money and lock some gains in during 2020?\n\n * Want to do…",
  "original_created_utc": 1611532613,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "R/Stocks的用户数已经超过了100万，我们想通过以下方式来庆祝。\n揭开了一个（可能是一年一度的）筹款活动的序幕!\n\n我们中的许多人都做得很好，这是因为在这次活动中的心得、丈量和教训。\nsubreddit。\n\n *在2020年期间，你是否赚了一些钱，锁定了一些收益？\n\n *想要做...",
      "title": "Stocks for Socks - 百万订阅者慈善活动"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "R/Stocks的用戶數已經超過了100萬，我們想通過以下方式來慶祝。\n揭開了一個（可能是一年一度的）籌款活動的序幕!\n\n我們中的許多人都做得很好，這是因爲在這次活動中的心得、丈量和教訓。\nsubreddit。\n\n *在2020年期間，你是否賺了一些錢，鎖定了一些收益？\n\n *想要做...",
      "title": "Stocks for Socks - 百萬訂閱者慈善活動"
    }
  ],
  "title": "Stocks for Socks - 1 Million Subscriber Charity Campaign",
  "created_utc": 1611569404,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>R/Stocks has surpassed <strong>1 million subscribers</strong>, and we&#39;d like to celebrate by kicking off a (potentially annual) fundraising event!</p>\n\n<p>Many of us have done well due to the insights, DD, and lessons learned on this subreddit.</p>\n\n<ul>\n<li><p>Did you make some money and lock some gains in during 2020? </p></li>\n<li><p>Want to do some good in the world, but can&#39;t take your eyes off your portfolio?</p></li>\n<li><p>Want to qualify for a <a href=\"https://www.investopedia.com/terms/c/charitable-contributions-deduction.asp#:%7E:text=The%20Charitable%20Contributions%20Deduction%20allows%20taxpayers%20who%20make%20substantial%20charitable,be%20complicated%20in%20certain%20instances.\">Charitable Contribution Deduction</a>?</p></li>\n</ul>\n\n<p><strong>Socks are the most needed items by people experiencing homelessness. They are also the least donated item.</strong></p>\n\n<p>Please consider joining the <a href=\"/r/stocks\">r/stocks</a> community to help those less fortunate through Delivering Good, a nonprofit organization that provides people impacted by poverty and tragedy with new merchandise donated by retailers and manufacturers. Since 1985, Delivering Good has distributed over $2 billion of new clothing, home goods, toys, furniture, books and other consumer products.</p>\n\n<p><strong>Every $10 donation helps Delivering Good provide $100 worth of new socks and other essential items to children and families in need.</strong> If just 1% of our 1 million subscribers each donate $10, Delivering Good could distribute $1,000,000 worth of new merchandise to people impacted by the pandemic, unemployment, homelessness and other hardships.</p>\n\n<p><a href=\"http://bit.ly/DGstocksforsocks\">DONATE HERE</a></p>\n\n<p>For more information about Delivering Good, please visit delivering-good.org or follow @DeliveringGood on Facebook, Instagram, Twitter and LinkedIn.</p>\n\n<p><a href=\"https://old.reddit.com/r/stocks/comments/k4jnqt/rate_my_portfolio_rstocks_quarterly_thread/\">Quarterly Rate My Portfolio Thread</a></p>\n</div><!-- SC_ON -->",
  "score": 91,
  "permalink": "/r/stocks/comments/l4b1hz/stocks_for_socks_1_million_subscriber_charity/",
  "subreddit": "stocks",
  "id": "l4b1hz",
  "is_self": true,
  "media": null,
  "is_video": false
}