{
  "author": "Remote-Boysenberry",
  "original_created_utc": 1635829766,
  "title": "Is the potential of streaming services completely wasted in this fragmented TV/Movie ecosystem?",
  "created_utc": 1635907913,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m an older guy who remembers the early internet. I remember Kazaa and Limewire, and getting to download video content and watch it all in one go. I remember downloading the entire series of Most Extreme Elimination challenge and things like that and binging before it was a term, already in the early or mid 2000s. After experiencing video like, that just being able to type what you want, search it and watch it, I felt like I couldn&#39;t go back to normal TV, channel surfing, and commercials. The simplicity of having a single place to search rather than choose with of the channel packages you wanted was so refreshing.</p>\n\n<p>And I stuck by that. Part of it was that most TV didn&#39;t appeal to me. But it also felt like by the late 2000s, forward thinking companies got it. I vividly remember watching Lost and South Park online on the official websites in the late 2000s, the day after it aired on TV. The websites held the complete official repository of episodes, all for free, with moderate advertising. </p>\n\n<p>I remember feeling good about myself because I didn&#39;t put an adblocker on and I wanted to support this benevolent style of streaming. There was a famous Gabe Newell quote going around, about how piracy is when people are frustrated with the official way of getting something, and his bet was to make Steam more user friendly than piracy, and he succeeded. I sincerely believed in that message.</p>\n\n<p>Fast forward to today, and the landscape just disappoints me. Gone is the simplicity of streaming or going to a direct website. Everyone has to have a subscription to Netflix, Hulu, Disney+, HBO Max, Paramount Plus, and whatever else. Certain shows and movies are hopping around different services and it&#39;s hard to expect or anticipate when you can watch something on what. Exclusivity wars are obviously going on in the background. Even if I have Hulu Gold or whatever, I want to go watch something that&#39;s advertised on there, and oh no, I actually need to ALSO subscribe to Discovery Channel Plus or whatever. Roku TVs come loaded with apps like the Hallmark channel and stuff, but each one is a pain. You either need to have a hundred different accounts, or the apps require you to sign in through your Optimum or Verizon or whatever cable provider to prove you deserve access to the app. And I swear they sign you out every couple of days and make you go through the whole verification thing again.</p>\n\n<p>The whole experience is miserable, cold, corporate, cash grabby, and a far cry from the vision of the future that I explicitly remember anticipating just over a decade ago. In my opinion, the suits and corporations have squandered the opportunity, and to hearken back to the Gabe Newell quote, I wouldn&#39;t think less of anyone if they decided to pirate rather than jump through all these nonsensical hoops. What do you all think?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TrueAskReddit/comments/qkx03j/is_the_potential_of_streaming_services_completely/",
  "subreddit": "TrueAskReddit",
  "id": "qkx03j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm an older guy who remembers the early internet. I remember Kazaa and\nLimewire, and getting to download video content and watch it all in one go. I\nremember downloading the entire series of Most Extreme Elimination challenge and\nthings like that and binging before it was a term, already in the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、初期のインターネットを覚えている年配者です。KazaaとLimewireを覚えています。\nビデオコンテンツをダウンロードして一度に見ることができました。I\nモスト・エクストリーム・エリミネーション・チャレンジの全シリーズをダウンロードしたことを覚えています。\nそのようなものをダウンロードして、「ビンギング」という言葉が生まれる前に、すでに...",
      "title": "テレビと映画のエコシステムが細分化されている中で、ストリーミングサービスの可能性は完全に無駄になっているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个记得早期互联网的老家伙。我记得Kazaa和\nLimewire，以及可以下载视频内容并一次性观看。I\n我记得下载了整个系列的《最极端的消除挑战》和类似的东西。\n诸如此类的事情，并且在它成为一个术语之前就开始狂欢，已经在......",
      "title": "在这个支离破碎的电视/电影生态系统中，流媒体服务的潜力是否被完全浪费？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個記得早期互聯網的老傢伙。我記得Kazaa和\nLimewire，以及可以下載視頻內容並一次性觀看。I\n我記得下載了整個系列的《最極端的消除挑戰》和類似的東西。\n諸如此類的事情，並且在它成爲一個術語之前就開始狂歡，已經在......",
      "title": "在這個支離破碎的電視/電影生態系統中，流媒體服務的潛力是否被完全浪費？"
    }
  ]
}