{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "Dropbox is a company that's been public for less than 4 years and the price today ($21.74) isn't that far from its IPO price of $21.\n\nThe goal of this post is to analyze the company's fundamentals, provide insights about the key topics and value the company as a whole. The purpose is purely for education.\n\n&amp;#x200B;\n\n**What is Dropbox?**\n\nIt is a cloud storage solution where content can be accessed from anywhere and shared with others. Today, with all the storage alternatives that we have and the progress that has been done in this field, well, it doesn't sound as revolutionary as it did 15 years ago.\n\n&amp;#x200B;\n\n**The key numbers**\n\nAs it is a subscription-based platform, the number of users plays a big role. This is what a lot of analysts pay attention to and although they look at the exact same numbers, they end up with different conclusions about the future of Dropbox.\n\n\\#1 - Registered users - Over 700m! - This is the first big number to focus on. This number is roughly 10% of the world population, so they are able to reach a lot of people.\n\n\\#2 - Paying users - 17m - Wait, is that a typo, that's only 2.5% of the total users. No, it is not a typo. Only 2.5% of the registered Dropbox users are actually paying users.\n\nThe question is, can they convert more users to become paying? Do you trust in their ability to do that? Here's when the analysts are clashing. On one side, the bulls are painting the picture of a future where the conversion is high, while the bears are asking the question where will this conversion start? This is a fair question as the users were there last year, the year before, and the year before...\n\n&amp;#x200B;\n\n**The financials**\n\nThe revenue formula is simple, **# of paying users** multiplied by the **average revenue per user**. Both of these numbers have been increasing and that reflects in the total revenue. The users, we already touched upon that earlier and it is clear that it depends on their ability to convert. The average revenue per user depends on their ability to either charge more for their existing service (which is tough, as their competitors are all giants - Apple, Google, Microsoft, Amazon) and their ability to create new product offerings (through R&amp;D or through acquisitions).\n\nHowever, the growth of the revenue has been declining. From **19%** growth in 2019 to **15%** growth in 2020, to **13%** growth in 2021...\n\nWhat about the pandemic? With the huge change from the traditional working environment to the remote/work-from-home, yet, surely the demand for this is surging. When I started analyzing Dropbox, I was expecting to see a surge in the revenue, so seeing that it isn't there, I was a bit disappointed.\n\nAs for the margins, they keep improving over time:\n\n\\- Gross margin improved from 72% in 2018 to 80% in 2021. The cost of service represents the expenses associated with the storage, delivery &amp; distribution of the platform/services, not only to the paying but also to the free users. so, free users burn some of Dropbox's cash.\n\nAll the operating expenses decreased as % of revenue between 2018 and 2021:\n\n\\- R&amp;D from 55% to 34%\n\n\\- Sales &amp; Marketing from 32% to 20%\n\n\\- G&amp;A from 20% to 20%\n\nSo the operating margin improved from -35% to 13%. Is there room to grow? Yes, absolutely. Based on the management's guidance, they can improve at least an additional 7% in the future, hence, the margin will be over 20%. On top of that, the investments that they make in the equipment cost them less than the historical amounts that they've paid, so the margin will increase even further over time.\n\n&amp;#x200B;\n\n**The key topic - the cash!**\n\nOne of the topics that you'll notice appearing most, especially around bull analysts is the free cash flow of the company and the expected increase in the coming years.\n\nThe free cash flow grew from $392m in 2019 to $491m in 2020, to $708m in 2021, and is expected to reach $1b in 2024!\n\nThe market cap today is roughly $8b. So, that's roughly 12.5% free cash flow yield (2024 is not that far, so I'm simplifying this). In theory, if Dropbox is not growing at all, and just pays the $1b out to the shareholders, that should bring a 12.5% return every single year, right? Well, not really.\n\nWe need to step back to better understand this. The free cash flow formula is quite simple:\n\nFree cash flow = Operating cash flow - Capital expenditures\n\nIt represents **the cash that is free for the management** to decide what to do with it, whether that is buying back shares, paying it out as a dividend, acquiring a new company, or, well, just nothing yet.\n\nAs this is looking through the prism of cash and it doesn't take share-based compensation (it is not a cash movement) and it doesn't take acquisitions (Dropbox had 2 of them in the last 3 years, totaling over $300m) because that depends on management's decisions.\n\nYou might be wondering, well, isn't acquisition capital expenditure? It definitely falls in the same category, but free cash flow doesn't represent what's free to distribute to the shareholders. Again, it is the free cash flow left **for the management** to decide what to do with it.\n\nIf you notice, the free cash flows mentioned above are quite far from their operating result. The main reason is stock-based compensation, which is huge! It is roughly $300m/year. What does this mean?\n\nPart of the employee compensation is not paid in cash, but in stock options/shares. This is not a cash expense, hence, looking through the cash lense, it just isn't there.\n\nIf Dropbox wants to maintain the number of shares outstanding, it would need to spend the $300m and buy back shares. Have they been doing that? Yes! The number of shares decreased by roughly 10% in the last 3 years. But it wasn't free, it cost them over $1.6b!\n\nThis is important to understand, so whenever we encounter free cash flow, we don't assume that's what is free for us as investors, because it isn't. The free cash flow for the investors is a lot lower.\n\n&amp;#x200B;\n\n**The valuation**\n\nI used a DCF model to estimate the value of Dropbox. Below are my assumptions:\n\n**- Revenue**: To increase 7% per year in the next 5 years, then slowly decline to 3%. - In line with the average analysts' expectation.\n\n**- Operating margin:** To increase to 24% over the next 5 years.\n\n**- Discount rate:** 6.7% to increase over time to 9.64% to reflect the environment that we're in today (with the FED increasing rates)\n\n\\- **Outcome:** $14.82/share\n\nThe DCF takes into account the $1.5b in cash and $2.4b debt that is on their balance sheet (As of Q1/2022) and the $650m equity options outstanding.\n\n&amp;#x200B;\n\n**What if my assumptions are significantly wrong?**\n\nBased on the assumptions above, the revenue will grow by 75% in 10 years and the operating margin will be 24%. I could significantly be wrong in my assessment.\n\nLet's take a look at how the valuation of the company (per share) will change based on different assumptions regarding the revenue 10 years from now and the operating margin:\n\n&amp;#x200B;\n\n|Revenue / Op. margin|22%|24%|26%|\n|:-|:-|:-|:-|\n|50% ($3.3b)|$11.4|$12.7|$14.0|\n|75% ($3.9b)|$13.3|$14.8|$16.3|\n|120% ($4.9b)|$16.6|$18.4|$20.3|\n|150% ($5.5b)|$18.2|$20.2|$22.2|\n\n**My thoughts**\n\nDropbox is operating in a fairly competitive field and the fact that it couldn't significantly grow during the pandemic shows that the alternatives are more appealing.\n\nThe # of registered users is definitely a huge number, but unless they are monetized, it doesn't add value.. Can they convert a significant portion? Based on the historical data, there's not enough proof, hence I do not feel comfortable including that wishful thinking in my forecast.\n\nI am looking forward to reading your views about the company and feel free to provide feedback regarding the analysis, that is always appreciated!",
  "author_fullname": "t2_5406jb4v",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Dropbox analysis and valuation - The free cash flow is not so free",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_w15mxb",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.92,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 45,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Company Analysis",
  "can_mod_post": false,
  "score": 45,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1658059142,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1658058419,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Dropbox is a company that&amp;#39;s been public for less than 4 years and the price today ($21.74) isn&amp;#39;t that far from its IPO price of $21.&lt;/p&gt;\n\n&lt;p&gt;The goal of this post is to analyze the company&amp;#39;s fundamentals, provide insights about the key topics and value the company as a whole. The purpose is purely for education.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What is Dropbox?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;It is a cloud storage solution where content can be accessed from anywhere and shared with others. Today, with all the storage alternatives that we have and the progress that has been done in this field, well, it doesn&amp;#39;t sound as revolutionary as it did 15 years ago.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The key numbers&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;As it is a subscription-based platform, the number of users plays a big role. This is what a lot of analysts pay attention to and although they look at the exact same numbers, they end up with different conclusions about the future of Dropbox.&lt;/p&gt;\n\n&lt;p&gt;#1 - Registered users - Over 700m! - This is the first big number to focus on. This number is roughly 10% of the world population, so they are able to reach a lot of people.&lt;/p&gt;\n\n&lt;p&gt;#2 - Paying users - 17m - Wait, is that a typo, that&amp;#39;s only 2.5% of the total users. No, it is not a typo. Only 2.5% of the registered Dropbox users are actually paying users.&lt;/p&gt;\n\n&lt;p&gt;The question is, can they convert more users to become paying? Do you trust in their ability to do that? Here&amp;#39;s when the analysts are clashing. On one side, the bulls are painting the picture of a future where the conversion is high, while the bears are asking the question where will this conversion start? This is a fair question as the users were there last year, the year before, and the year before...&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The financials&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The revenue formula is simple, &lt;strong&gt;# of paying users&lt;/strong&gt; multiplied by the &lt;strong&gt;average revenue per user&lt;/strong&gt;. Both of these numbers have been increasing and that reflects in the total revenue. The users, we already touched upon that earlier and it is clear that it depends on their ability to convert. The average revenue per user depends on their ability to either charge more for their existing service (which is tough, as their competitors are all giants - Apple, Google, Microsoft, Amazon) and their ability to create new product offerings (through R&amp;amp;D or through acquisitions).&lt;/p&gt;\n\n&lt;p&gt;However, the growth of the revenue has been declining. From &lt;strong&gt;19%&lt;/strong&gt; growth in 2019 to &lt;strong&gt;15%&lt;/strong&gt; growth in 2020, to &lt;strong&gt;13%&lt;/strong&gt; growth in 2021...&lt;/p&gt;\n\n&lt;p&gt;What about the pandemic? With the huge change from the traditional working environment to the remote/work-from-home, yet, surely the demand for this is surging. When I started analyzing Dropbox, I was expecting to see a surge in the revenue, so seeing that it isn&amp;#39;t there, I was a bit disappointed.&lt;/p&gt;\n\n&lt;p&gt;As for the margins, they keep improving over time:&lt;/p&gt;\n\n&lt;p&gt;- Gross margin improved from 72% in 2018 to 80% in 2021. The cost of service represents the expenses associated with the storage, delivery &amp;amp; distribution of the platform/services, not only to the paying but also to the free users. so, free users burn some of Dropbox&amp;#39;s cash.&lt;/p&gt;\n\n&lt;p&gt;All the operating expenses decreased as % of revenue between 2018 and 2021:&lt;/p&gt;\n\n&lt;p&gt;- R&amp;amp;D from 55% to 34%&lt;/p&gt;\n\n&lt;p&gt;- Sales &amp;amp; Marketing from 32% to 20%&lt;/p&gt;\n\n&lt;p&gt;- G&amp;amp;A from 20% to 20%&lt;/p&gt;\n\n&lt;p&gt;So the operating margin improved from -35% to 13%. Is there room to grow? Yes, absolutely. Based on the management&amp;#39;s guidance, they can improve at least an additional 7% in the future, hence, the margin will be over 20%. On top of that, the investments that they make in the equipment cost them less than the historical amounts that they&amp;#39;ve paid, so the margin will increase even further over time.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The key topic - the cash!&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;One of the topics that you&amp;#39;ll notice appearing most, especially around bull analysts is the free cash flow of the company and the expected increase in the coming years.&lt;/p&gt;\n\n&lt;p&gt;The free cash flow grew from $392m in 2019 to $491m in 2020, to $708m in 2021, and is expected to reach $1b in 2024!&lt;/p&gt;\n\n&lt;p&gt;The market cap today is roughly $8b. So, that&amp;#39;s roughly 12.5% free cash flow yield (2024 is not that far, so I&amp;#39;m simplifying this). In theory, if Dropbox is not growing at all, and just pays the $1b out to the shareholders, that should bring a 12.5% return every single year, right? Well, not really.&lt;/p&gt;\n\n&lt;p&gt;We need to step back to better understand this. The free cash flow formula is quite simple:&lt;/p&gt;\n\n&lt;p&gt;Free cash flow = Operating cash flow - Capital expenditures&lt;/p&gt;\n\n&lt;p&gt;It represents &lt;strong&gt;the cash that is free for the management&lt;/strong&gt; to decide what to do with it, whether that is buying back shares, paying it out as a dividend, acquiring a new company, or, well, just nothing yet.&lt;/p&gt;\n\n&lt;p&gt;As this is looking through the prism of cash and it doesn&amp;#39;t take share-based compensation (it is not a cash movement) and it doesn&amp;#39;t take acquisitions (Dropbox had 2 of them in the last 3 years, totaling over $300m) because that depends on management&amp;#39;s decisions.&lt;/p&gt;\n\n&lt;p&gt;You might be wondering, well, isn&amp;#39;t acquisition capital expenditure? It definitely falls in the same category, but free cash flow doesn&amp;#39;t represent what&amp;#39;s free to distribute to the shareholders. Again, it is the free cash flow left &lt;strong&gt;for the management&lt;/strong&gt; to decide what to do with it.&lt;/p&gt;\n\n&lt;p&gt;If you notice, the free cash flows mentioned above are quite far from their operating result. The main reason is stock-based compensation, which is huge! It is roughly $300m/year. What does this mean?&lt;/p&gt;\n\n&lt;p&gt;Part of the employee compensation is not paid in cash, but in stock options/shares. This is not a cash expense, hence, looking through the cash lense, it just isn&amp;#39;t there.&lt;/p&gt;\n\n&lt;p&gt;If Dropbox wants to maintain the number of shares outstanding, it would need to spend the $300m and buy back shares. Have they been doing that? Yes! The number of shares decreased by roughly 10% in the last 3 years. But it wasn&amp;#39;t free, it cost them over $1.6b!&lt;/p&gt;\n\n&lt;p&gt;This is important to understand, so whenever we encounter free cash flow, we don&amp;#39;t assume that&amp;#39;s what is free for us as investors, because it isn&amp;#39;t. The free cash flow for the investors is a lot lower.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The valuation&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I used a DCF model to estimate the value of Dropbox. Below are my assumptions:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;- Revenue&lt;/strong&gt;: To increase 7% per year in the next 5 years, then slowly decline to 3%. - In line with the average analysts&amp;#39; expectation.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;- Operating margin:&lt;/strong&gt; To increase to 24% over the next 5 years.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;- Discount rate:&lt;/strong&gt; 6.7% to increase over time to 9.64% to reflect the environment that we&amp;#39;re in today (with the FED increasing rates)&lt;/p&gt;\n\n&lt;p&gt;- &lt;strong&gt;Outcome:&lt;/strong&gt; $14.82/share&lt;/p&gt;\n\n&lt;p&gt;The DCF takes into account the $1.5b in cash and $2.4b debt that is on their balance sheet (As of Q1/2022) and the $650m equity options outstanding.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What if my assumptions are significantly wrong?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Based on the assumptions above, the revenue will grow by 75% in 10 years and the operating margin will be 24%. I could significantly be wrong in my assessment.&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s take a look at how the valuation of the company (per share) will change based on different assumptions regarding the revenue 10 years from now and the operating margin:&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;table&gt;&lt;thead&gt;\n&lt;tr&gt;\n&lt;th align=\"left\"&gt;Revenue / Op. margin&lt;/th&gt;\n&lt;th align=\"left\"&gt;22%&lt;/th&gt;\n&lt;th align=\"left\"&gt;24%&lt;/th&gt;\n&lt;th align=\"left\"&gt;26%&lt;/th&gt;\n&lt;/tr&gt;\n&lt;/thead&gt;&lt;tbody&gt;\n&lt;tr&gt;\n&lt;td align=\"left\"&gt;50% ($3.3b)&lt;/td&gt;\n&lt;td align=\"left\"&gt;$11.4&lt;/td&gt;\n&lt;td align=\"left\"&gt;$12.7&lt;/td&gt;\n&lt;td align=\"left\"&gt;$14.0&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"left\"&gt;75% ($3.9b)&lt;/td&gt;\n&lt;td align=\"left\"&gt;$13.3&lt;/td&gt;\n&lt;td align=\"left\"&gt;$14.8&lt;/td&gt;\n&lt;td align=\"left\"&gt;$16.3&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"left\"&gt;120% ($4.9b)&lt;/td&gt;\n&lt;td align=\"left\"&gt;$16.6&lt;/td&gt;\n&lt;td align=\"left\"&gt;$18.4&lt;/td&gt;\n&lt;td align=\"left\"&gt;$20.3&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"left\"&gt;150% ($5.5b)&lt;/td&gt;\n&lt;td align=\"left\"&gt;$18.2&lt;/td&gt;\n&lt;td align=\"left\"&gt;$20.2&lt;/td&gt;\n&lt;td align=\"left\"&gt;$22.2&lt;/td&gt;\n&lt;/tr&gt;\n&lt;/tbody&gt;&lt;/table&gt;\n\n&lt;p&gt;&lt;strong&gt;My thoughts&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Dropbox is operating in a fairly competitive field and the fact that it couldn&amp;#39;t significantly grow during the pandemic shows that the alternatives are more appealing.&lt;/p&gt;\n\n&lt;p&gt;The # of registered users is definitely a huge number, but unless they are monetized, it doesn&amp;#39;t add value.. Can they convert a significant portion? Based on the historical data, there&amp;#39;s not enough proof, hence I do not feel comfortable including that wishful thinking in my forecast.&lt;/p&gt;\n\n&lt;p&gt;I am looking forward to reading your views about the company and feel free to provide feedback regarding the analysis, that is always appreciated!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "1235582c-6848-11eb-96e8-0e132357f477",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#d6890a",
  "id": "w15mxb",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "k_ristovski",
  "discussion_type": null,
  "num_comments": 25,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/w15mxb/dropbox_analysis_and_valuation_the_free_cash_flow/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/w15mxb/dropbox_analysis_and_valuation_the_free_cash_flow/",
  "subreddit_subscribers": 4310220,
  "created_utc": 1658083466,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1658058419,
  "the_new_excerpt": "Dropbox is a company that's been public for less than 4 years and the price\ntoday ($21.74) isn't that far from its IPO price of $21.\n\nThe goal of this post is to analyze the company's fundamentals, provide insights\nabout the key topics and value the company as a whole. The purpose is purely…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Dropboxは上場して4年足らずの会社で、価格も\n今日（21.74ドル）は、IPO価格の21ドルからそれほど離れていない。\n\nこの記事の目的は、同社のファンダメンタルズを分析し、重要なトピックに関する洞察を提供し、同社を評価することです。\nこの記事の目的は、会社のファンダメンタルズを分析し、重要なトピックについての洞察を提供し、全体として会社を評価することです。目的は、純粋に...",
      "title": "Dropboxの分析とバリュエーション - フリーキャッシュフローはそれほど自由ではない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Dropbox是一家上市不到4年的公司，其价格\n今天的价格（21.74美元）与它的IPO价格21美元相差不大。\n\n这篇文章的目的是分析该公司的基本面，提供有关该公司的关键问题的洞察力。\n关于关键议题的见解，并对该公司进行整体估值。其目的纯粹是...",
      "title": "Dropbox的分析和估值 - 自由现金流并不那么自由"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Dropbox是一家上市不到4年的公司，其價格\n今天的價格（21.74美元）與它的IPO價格21美元相差不大。\n\n這篇文章的目的是分析該公司的基本面，提供有關該公司的關鍵問題的洞察力。\n關於關鍵議題的見解，並對該公司進行整體估值。其目的純粹是...",
      "title": "Dropbox的分析和估值 - 自由現金流並不那麼自由"
    }
  ]
}