{
  "author": "HealthWild",
  "original_created_utc": 1653986870,
  "title": "Why does everyone want to keep me in the hamster wheel?",
  "created_utc": 1654024932,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t understand the &amp;quot;you should get a nice job and settle down&amp;quot; and &amp;quot;you should study something with nice career prospects&amp;quot; stuff.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a music major in Denmark. After I&amp;#39;m done I&amp;#39;m going a year to Japan on a work-holiday to have fun (shitty pay as well). And after that I&amp;#39;ll do something else that&amp;#39;s fun.&lt;/p&gt;\n\n&lt;p&gt;Why do I need to settle down? Why do I need to make more money? I don&amp;#39;t even want kids in the first place, can&amp;#39;t I just enjoy life?&lt;/p&gt;\n\n&lt;p&gt;Can someone help me understand this perspective?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/v1lrr8/why_does_everyone_want_to_keep_me_in_the_hamster/",
  "subreddit": "TooAfraidToAsk",
  "id": "v1lrr8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don't understand the \"you should get a nice job and settle down\" and \"you\nshould study something with nice career prospects\" stuff.\n\nI'm a music major in Denmark. After I'm done I'm going a year to Japan on a\nwork-holiday to have fun (shitty pay as well). And after that I'll do something\nelse…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、「いい仕事に就いて落ち着くべきだ」「いいキャリアを積める勉強をするべきだ」というのは\nいい仕事に就いて落ち着くべきだ」とか「キャリアアップにつながる勉強をすべきだ」というのは理解できない。\n\n私はデンマークで音楽を専攻しています。卒業後はワーホリで1年間日本に行く予定です。\nワーホリで1年間日本に行って楽しんできます（給料も安い）。その後、他のことをするつもりです。\nをします。",
      "title": "どうしてみんな、私をハムスターの車輪の中に閉じ込めようとするんだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不明白 \"你应该找一份好工作并定居下来 \"和 \"你应该学习有好的职业前景的东西 \"的说法。\n你应该学习一些有良好职业前景的东西 \"的说法。\n\n我在丹麦学的是音乐专业。在我完成学业后，我将去日本工作一年。\n工作假期来玩玩（工资也很低）。在那之后，我会做一些\n其他事情...",
      "title": "为什么每个人都想把我留在仓鼠轮里？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不明白 \"你應該找一份好工作並定居下來 \"和 \"你應該學習有好的職業前景的東西 \"的說法。\n你應該學習一些有良好職業前景的東西 \"的說法。\n\n我在丹麥學的是音樂專業。在我完成學業後，我將去日本工作一年。\n工作假期來玩玩（工資也很低）。在那之後，我會做一些\n其他事情...",
      "title": "爲什麼每個人都想把我留在倉鼠輪裏？"
    }
  ]
}