{
  "author": "Guigamuck",
  "original_created_utc": 1635342860,
  "title": "Living under inflation or hyperinflation reality",
  "created_utc": 1635374176,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Greetings my Bitcoin friends. I don&#39;t know where most of you come from, so, please allow me to assume that most of you come from developed countries where inflation has not been a problem (at least for the last 50 years).  </p>\n\n<p>Since March 2020 the world is facing the Covid-19 pandemic and one of the most evident symptoms or consequences of it is the disruption of supply and production chains all around the world, the acceleration of quantitative easing and for last but not least - INFLATION.  </p>\n\n<p>Inflation is a direct consequence of the endless money printing frenzy from the governments, and, I have to tell you guys - living with it is hard!  </p>\n\n<p>I was born and raised in Brazil. Back in the 1980s, we suffered from hyperinflation and sometimes we had <a href=\"https://en.wikipedia.org/wiki/Hyperinflation_in_Brazil\">monthly inflation of </a><a href=\"https://en.wikipedia.org/wiki/Hyperinflation_in_Brazil\">over 80% in 1990</a>!  </p>\n\n<p>Believe me or not, I have serious problems with inflation and this is a childhood trauma I have. My parents have always been hard-working people and since I was born until the creation of the Brazilian Real (the current national currency) and the new economic plan that allegedly stabilized the economy (even though, since 1994 the <a href=\"https://en.wikipedia.org/wiki/Brazilian_real\">BRL</a> lost over 90% of its purchasing power due to, guess what, inflation! - and this year alone we lost 40% face value against the USD) I saw my parents lose our house, the cars and we literally became lower middle class because of inflation.  </p>\n\n<p>Of course, I know many people around the world faced and still face much worse living conditions, however, the main point here is to warn you of all the dangers inflation and hyperinflation bring!  </p>\n\n<p>Fortunately, we have Bitcoin and other cryptos to protect us from the government, from the depreciation of fiat currency, and to unshackle us from the monetary prison!  </p>\n\n<p>Here&#39;s to bitcoin!</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/mXXBIEWprf90OyhSiJtjO-pzBMj_wQBChXAsvV8wwfQ.jpg?auto=webp&s=006e51bc33afdd7b702f89955f3fae8d673c7d28",
          "width": 220,
          "height": 409
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/mXXBIEWprf90OyhSiJtjO-pzBMj_wQBChXAsvV8wwfQ.jpg?width=108&crop=smart&auto=webp&s=87c7a2408d0cb8c8cab8e09bfe79128878b5df5a",
            "width": 108,
            "height": 200
          },
          {
            "url": "https://external-preview.redd.it/mXXBIEWprf90OyhSiJtjO-pzBMj_wQBChXAsvV8wwfQ.jpg?width=216&crop=smart&auto=webp&s=fd6b33a12b2ace01dac5320a81b7c28e2f053ca2",
            "width": 216,
            "height": 401
          }
        ],
        "variants": {},
        "id": "CE_LepQG7c0OR8hrsqVGyZym4wnR4re9oEISCC9mXcQ"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/qgx7pw/living_under_inflation_or_hyperinflation_reality/",
  "subreddit": "Bitcoin",
  "id": "qgx7pw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Greetings my Bitcoin friends. I don't know where most of you come from, so,\nplease allow me to assume that most of you come from developed countries where\ninflation has not been a problem (at least for the last 50 years).\n\nSince March 2020 the world is facing the Covid-19 pandemic and one of the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "はじめまして、ビットコインの友人たちです。私は皆さんがどこから来たのか知りません。\nインフレが問題になっていない先進国から来ているのではないかと思っています。\nインフレは（少なくとも過去50年間は）問題になっていません。\n\n2020年3月以降、世界はCovid-19パンデミックに直面しており、その一つ...",
      "title": "インフレやハイパーインフレの現実の下での生活"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "问候我的比特币朋友。我不知道你们中的大多数人来自哪里，所以。\n请允许我假设你们中的大多数人来自发达国家，在那里\n通货膨胀不是一个问题（至少在过去50年里）。\n\n自2020年3月以来，世界正面临着Covid-19大流行病和其中的...",
      "title": "生活在通货膨胀或恶性通货膨胀的现实下"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "問候我的比特幣朋友。我不知道你們中的大多數人來自哪裏，所以。\n請允許我假設你們中的大多數人來自發達國家，在那裏\n通貨膨脹不是一個問題（至少在過去50年裏）。\n\n自2020年3月以來，世界正面臨着Covid-19大流行病和其中的...",
      "title": "生活在通貨膨脹或惡性通貨膨脹的現實下"
    }
  ]
}