{
  "author": "autoantinatalist",
  "original_created_utc": 1640475198,
  "title": "I heard there was a time in British/American history when women were considered the horny ones incapable of sexual control and men were the chaste moral gatekeepers, ie the reverse of current gender beliefs. Did this flip happen, when, why, and did it happen multiple times?",
  "created_utc": 1640495478,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was reading some other stuff and found this:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/y9ygc/comment/c5topxb/?utm_source=reddit&amp;amp;utm_medium=web2x&amp;amp;context=3\"&gt;I can answer a bit about traditions in Sweden during the [medieval] era. [...] Interestingly, the sex ideas of the Victorian era (which has extended into modern days) was reversed. Males were considered closer to God and thus would easier be able to resist sexual desire while women were considered more animal-like in their sexual desire and thus more excusable if they were unable to resist their desires to sin.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I thought the Victorian era was the time when these sex beliefs were reversed? That&amp;#39;s when Freud invented &amp;quot;hysteria&amp;quot;, claiming that women were so horny and obsessed with &amp;quot;penis envy&amp;quot; that they invented family sexual abuse to satisfy themselves.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/rok32v/i_heard_there_was_a_time_in_britishamerican/",
  "subreddit": "AskHistorians",
  "id": "rok32v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was reading some other stuff and found this:\n\nI can answer a bit about traditions in Sweden during the [medieval] era. [...]\nInterestingly, the sex ideas of the Victorian era (which has extended into\nmodern days) was reversed. Males were considered closer to God and thus would\neasier be able to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "他のものを読んでいたら、これを見つけました。\n\n中世]時代のスウェーデンの伝統について少し答えることができます。[...]\n興味深いことに、ヴィクトリア朝時代のセックスの考え方（それは、現在も続いています。\n現代）とは逆転していました。男性は神に近い存在とされ、そのため\nしやすくなる...",
      "title": "イギリスやアメリカの歴史では、女性は性的なコントロールができないムラムラした存在で、男性は貞淑なモラルの門番と考えられていた、つまり現在のジェンダー信仰とは逆の時代があったと聞きました。この逆転は、いつ、なぜ、そして何度も起こったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在看一些其他的东西，发现了这个。\n\n我可以回答一点关于瑞典在[中世纪]时代的传统。[...]\n有趣的是，维多利亚时代的性观念（已延伸至\n现代）被颠覆了。男性被认为更接近上帝，因此会\n更容易能够...",
      "title": "我听说在英国/美国历史上有一段时间，女性被认为是没有能力控制性行为的好色之徒，而男性则是贞洁的道德守门人，即与当前的性别观念相反。这种翻转是否发生过，何时发生，为何发生，是否多次发生？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在看一些其他的東西，發現了這個。\n\n我可以回答一點關於瑞典在[中世紀]時代的傳統。[...]\n有趣的是，維多利亞時代的性觀念（已延伸至\n現代）被顛覆了。男性被認爲更接近上帝，因此會\n更容易能夠...",
      "title": "我聽說在英國/美國曆史上有一段時間，女性被認爲是沒有能力控制性行爲的好色之徒，而男性則是貞潔的道德守門人，即與當前的性別觀念相反。這種翻轉是否發生過，何時發生，爲何發生，是否多次發生？"
    }
  ]
}