{
  "author": "Puppy_Coated_In_Beer",
  "original_created_utc": 1627942877,
  "title": "Ethereum's London Hard Fork is now 2 days away",
  "created_utc": 1627972247,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>EIP-1559 on Ethereum&#39;s network was a proposal to make Ethereum transactions more efficient.</p>\n\n<p>It aims to maintain the network and keep it more closer to a usage rate of around 50%. If the network usage falls below this, the fees (base fee) will decrease as well. It will also still allow you to increase the fee (called a tip fee) to decrease the transaction time. The base fee is set algorithmically.</p>\n\n<p>Wallet providers will no longer have to set their own gas fees as they will now be set automatically.</p>\n\n<p>The proposal will be implemented in 2 days, which is also referred to as the London Hard Fork</p>\n\n<p>This feature has been long waited for this year. I will not make any price predictions but it&#39;s a very, very large step towards the overall Ethereum 2.0 upgrade slated for next year.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/owpdtr/ethereums_london_hard_fork_is_now_2_days_away/",
  "subreddit": "CryptoCurrency",
  "id": "owpdtr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "EIP-1559 on Ethereum's network was a proposal to make Ethereum transactions more\nefficient.\n\nIt aims to maintain the network and keep it more closer to a usage rate of\naround 50%. If the network usage falls below this, the fees (base fee) will\ndecrease as well. It will also still allow you to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イーサリアムのネットワーク上のEIP-1559は、イーサリアムの取引をより効率的にするための提案でした。\n効率化を図るものです。\n\nネットワークを維持し、より使用率に近い状態にすることを目的としています。\n50％程度に近づけることを目的としています。ネットワークの使用率がこれを下回ると、手数料（基本料金）も減少する。\nも減っていきます。また、これまで通り、...",
      "title": "イーサリアムのロンドン・ハードフォークが2日後に迫った"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "以太坊网络上的EIP-1559是一个使以太坊交易更有效的建议。\n效率。\n\n它的目的是维护网络，使其更接近于使用率的\n50%左右。如果网络使用率低于这个水平，费用（基本费用）也会\n也会减少。它也将仍然允许你...",
      "title": "以太坊的伦敦硬分叉现在还有2天时间"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "以太坊網絡上的EIP-1559是一個使以太坊交易更有效的建議。\n效率。\n\n它的目的是維護網絡，使其更接近於使用率的\n50%左右。如果網絡使用率低於這個水平，費用（基本費用）也會\n也會減少。它也將仍然允許你...",
      "title": "以太坊的倫敦硬分叉現在還有2天時間"
    }
  ]
}