{
  "author": "EnthusiasmLeft8791",
  "original_created_utc": 1649684190,
  "title": "Are there support groups for partners of rape survivors?",
  "created_utc": 1649694903,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi,&lt;/p&gt;\n\n&lt;p&gt;My girlfriend was raped in her previous relationship and I dont know what to do. I feel exhausted. I feel like I have to constantly put my needs to the side because you can&amp;#39;t compromise with trauma. I know that none of this is her fault and thats what sucks, I feel like I can&amp;#39;t talk about this with anyone because if I talk to her I make her feel bad and I&amp;#39;m certainly not just going to out her to someone else. I love this girl and can honestly see spending my life with her... Its just hard I guess.&lt;/p&gt;\n\n&lt;p&gt;My question I guess is: are there support groups or anything for partners of sexual assault? I&amp;#39;ve been to therapy but idk it felt weird just talking about my relationship with her and I feel like talking with others in my situation could be helpful. Any advice or anything is super appreciated.&lt;/p&gt;\n\n&lt;p&gt;Thank you, hope you have a good day!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/u17xxr/are_there_support_groups_for_partners_of_rape/",
  "subreddit": "TooAfraidToAsk",
  "id": "u17xxr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi,\n\nMy girlfriend was raped in her previous relationship and I dont know what to do.\nI feel exhausted. I feel like I have to constantly put my needs to the side\nbecause you can't compromise with trauma. I know that none of this is her fault\nand thats what sucks, I feel like I can't talk about this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。\n\n私のガールフレンドは前の交際相手からレイプされたのですが、どうしたらいいのかわかりません。\n私は疲れ果てています。自分の欲求を常に横に置いておかなければならないような気がします。\nトラウマがあると妥協できないからです。これはどれも彼女のせいではないことは分かっています\nそれが嫌で、このことを話せないような気がします...。",
      "title": "レイプ被害者のパートナーのための支援団体はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好。\n\n我的女朋友在她以前的关系中被强奸了，我不知道该怎么做。\n我感到很疲惫。我觉得我必须不断地把我的需求放在一边\n因为你不能向创伤妥协。我知道这一切都不是她的错\n这就是糟糕的地方，我觉得我不能谈论这个......",
      "title": "是否有针对强奸幸存者伴侣的支持团体？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好。\n\n我的女朋友在她以前的關係中被強姦了，我不知道該怎麼做。\n我感到很疲憊。我覺得我必須不斷地把我的需求放在一邊\n因爲你不能向創傷妥協。我知道這一切都不是她的錯\n這就是糟糕的地方，我覺得我不能談論這個......",
      "title": "是否有針對強姦倖存者伴侶的支持團體？"
    }
  ]
}