{
  "author": "AskScienceModerator",
  "original_created_utc": 1630062005,
  "title": "AskScience AMA Series: We're marine scientists exploring the deep sea off Cabo Verde sailing on board the iMirabilis2 cruise. Ask us Anything!",
  "created_utc": 1630091613,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We are a team of scientists and technicians sailing on board the Spanish research vessel <em>Sarmiento de Gamboa</em> on a four-week cruise to explore Cabo Verde&#39;s deep sea ecosystems.</p>\n\n<p>On board we have the remotely operated vehicle (ROV), Luso, the autonomous underwater vehicle (AUV) Autosub6000, three benthic landers (a respirometer, baited camera, and baited trap), a multibeam bathymetry system, box corer, multicorer, a conductivity-temperature- depth (CTD) system, and the newly developed environmental DNA (eDNA) sampler named RoCSI (Robotic Cartridge Sampling Instrument). During the cruise we have used all this equipment to explore the deep sea through mapping, imaging, and sampling the seafloor and water column. We&#39;ve seen cold-water corals, sponges, fish, sea cucumbers, anemones, mud and rocky substrate!</p>\n\n<p>This cruise is part of the EU Horizon 2020 project <a href=\"https://www.iatlantic.eu/\">iAtlantic</a>. You can read all about the cruise on our <a href=\"https://www.iatlantic.eu/imirabilis2-expedition/\">expedition website</a> where you can <a href=\"https://www.iatlantic.eu/imirabilis2-expedition/team/\">meet the team</a>, learn about our <a href=\"https://www.iatlantic.eu/imirabilis2-expedition/science/\">scientific missions</a> and <a href=\"https://www.iatlantic.eu/imirabilis2-expedition/equipment/\">equipment on board</a> as well as catch up with the latest news at the <a href=\"https://www.iatlantic.eu/imirabilis2-expedition/blog/\">expedition blog</a>. You can also follow us on <a href=\"https://twitter.com/iAtlanticEU\">Twitter</a>, <a href=\"https://www.facebook.com/iAtlanticEU/\">Facebook</a>, and <a href=\"https://www.instagram.com/iatlanticeu/\">Instagram</a>.</p>\n\n<p>We will be here from 17:00-19:00 UTC (1-3 PM ET) to answer your questions about scientific cruises, the deep sea, and ocean exploration.</p>\n\n<p>Username: <a href=\"/u/iAtlanticEU\">/u/iAtlanticEU</a></p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askscience/comments/pcl2nr/askscience_ama_series_were_marine_scientists/",
  "subreddit": "askscience",
  "id": "pcl2nr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We are a team of scientists and technicians sailing on board the Spanish\nresearch vessel Sarmiento de Gamboa on a four-week cruise to explore Cabo\nVerde's deep sea ecosystems.\n\nOn board we have the remotely operated vehicle (ROV), Luso, the autonomous\nunderwater vehicle (AUV) Autosub6000, three…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちは、スペインの調査船「Sar」に乗船している科学者と技術者のチームです。\nスペインの調査船サルミエント・デ・ガンボア号に乗船し、カーボ・ベルデの深海生態系を探る4週間のクルーズを行っています。\nカーボベルデの深海生態系を探索する4週間のクルーズです。\n\n船上には、遠隔操作車両（ROV）「Luso」、自律型水中ロボット（AUV）「Autosse」があります。\nAUV（自律型水中ロボット）Autosub6000、3...",
      "title": "AskScience AMAシリーズ。私たちはカーボベルデ沖の深海を探索する海洋科学者で、iMirabilis2クルーズに乗船しています。何でも聞いてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们是一个由科学家和技术人员组成的团队，在西班牙的 \"Sarmiento de Gamboa \"号研究船上航行。\n的研究船Sarmiento de Gamboa号上，进行为期四周的巡航，探索佛得角的深海生态系统。\n佛得角的深海生态系统。\n\n在船上，我们有遥控潜水器（ROV）Luso，自主水下航行器（AUV）AUTO。\n在船上，我们有遥控潜水器（ROV）Luso，自主水下航行器（AUV）Autosub6000，以及三个自动驾驶汽车。",
      "title": "AskScience AMA系列。我们是在佛得角附近探索深海的海洋科学家，在iMirabilis2号巡航船上航行。向我们提出任何问题!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們是一個由科學家和技術人員組成的團隊，在西班牙的 \"Sarmiento de Gamboa \"號研究船上航行。\n的研究船Sarmiento de Gamboa號上，進行爲期四周的巡航，探索佛得角的深海生態系統。\n佛得角的深海生態系統。\n\n在船上，我們有遙控潛水器（ROV）Luso，自主水下航行器（AUV）AUTO。\n在船上，我們有遙控潛水器（ROV）Luso，自主水下航行器（AUV）Autosub6000，以及三個自動駕駛汽車。",
      "title": "AskScience AMA系列。我們是在佛得角附近探索深海的海洋科學家，在iMirabilis2號巡航船上航行。向我們提出任何問題!"
    }
  ]
}