{
  "author": "No_Dog_7969",
  "original_created_utc": 1642859372,
  "title": "Why do so many people hate pineapple on pizza while things like sweet chilli sauce, buttermilk chicken, onion jam, etc. are totally accepted??",
  "created_utc": 1642866724,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll be honest, I only ate pineapple pizza twice and although I can&amp;#39;t say that it&amp;#39;s my favorite, I did find it pretty enjoyable. And then I got onto the internet and I was somewhat scared of trying it ever again. I mean not actually scared, but because it was so stigmatized, I always decided to not risk it and go the safe route. &lt;/p&gt;\n\n&lt;p&gt;I had a talk with a friend a couple of days ago about pizza and we briefly touched the subject of pineapple pizza and he was completely against it, denying that there&amp;#39;s even a single chance that it tastes decent. To which I replied: &amp;quot; well I&amp;#39;ve only had it twice, long time ago, so I can&amp;#39;t really tell&amp;quot;. His reply made my jaw drop. He never in his life has even seen a pineapple pizza in front of his eyes, but he was 100% sure that a pineapple pizza is a disgrace to society.&lt;/p&gt;\n\n&lt;p&gt;And this got me thinking, how in the fuck can pizza, one of the most inclusive foods on the planet, that can be done with any ingredients you have in your pantry, taste bad when it has this one ingredient added to it? &lt;/p&gt;\n\n&lt;p&gt;So you know what I did? I JUST FUCKING ORDERED ONE. It&amp;#39;s on its way to me, in about 35 minutes I will taste a pineapple pizza and return here with the conclusion. I&amp;#39;m pretty sure that it&amp;#39;s gonna taste like any pizza though, but will see.&lt;/p&gt;\n\n&lt;p&gt;Later edit: I&amp;#39;ve had one with corn, pineapple, bacon, bell peper, tomatoes, and some other type of meat and it was really good. I think I&amp;#39;ll order it again some time&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/sa2wqu/why_do_so_many_people_hate_pineapple_on_pizza/",
  "subreddit": "TooAfraidToAsk",
  "id": "sa2wqu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'll be honest, I only ate pineapple pizza twice and although I can't say that\nit's my favorite, I did find it pretty enjoyable. And then I got onto the\ninternet and I was somewhat scared of trying it ever again. I mean not actually\nscared, but because it was so stigmatized, I always decided to not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正直なところ、パイナップルピザは2回しか食べたことがなく、とてもじゃないけど\n好きな食べ物ではありますが、結構楽しめました。そして、このサイトを見て\nネットで調べてみると、なんだか怖くてもう二度と試せない。というのは、実際に\nでも、あまりに胡散臭かったので、いつもやめておこうと...。",
      "title": "スイートチリソース、バターミルクチキン、オニオンジャムなどは受け入れられているのに、なぜピザのパイナップルは嫌がる人が多いのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "老实说，我只吃过两次菠萝比萨，虽然我不能说这是我的最爱。\n它是我的最爱，但我确实觉得它很令人愉快。然后我上了\n互联网，我有点害怕再次尝试它。我的意思是并不是真的\n害怕，但因为它是如此污名化，我总是决定不...",
      "title": "为什么这么多人讨厌披萨上的菠萝，而像甜辣椒酱、黄油鸡、洋葱酱等却完全被接受呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "老實說，我只喫過兩次菠蘿比薩，雖然我不能說這是我的最愛。\n它是我的最愛，但我確實覺得它很令人愉快。然後我上了\n互聯網，我有點害怕再次嘗試它。我的意思是並不是真的\n害怕，但因爲它是如此污名化，我總是決定不...",
      "title": "爲什麼這麼多人討厭披薩上的菠蘿，而像甜辣椒醬、黃油雞、洋蔥醬等卻完全被接受呢？"
    }
  ]
}