{
  "author": "No_Dog_7969",
  "original_created_utc": 1642859372,
  "title": "Why do so many people hate pineapple on pizza while things like sweet chilli sauce, buttermilk chicken, onion jam, etc. are totally accepted??",
  "created_utc": 1642866724,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll be honest, I only ate pineapple pizza twice and although I can&amp;#39;t say that it&amp;#39;s my favorite, I did find it pretty enjoyable. And then I got onto the internet and I was somewhat scared of trying it ever again. I mean not actually scared, but because it was so stigmatized, I always decided to not risk it and go the safe route. &lt;/p&gt;\n\n&lt;p&gt;I had a talk with a friend a couple of days ago about pizza and we briefly touched the subject of pineapple pizza and he was completely against it, denying that there&amp;#39;s even a single chance that it tastes decent. To which I replied: &amp;quot; well I&amp;#39;ve only had it twice, long time ago, so I can&amp;#39;t really tell&amp;quot;. His reply made my jaw drop. He never in his life has even seen a pineapple pizza in front of his eyes, but he was 100% sure that a pineapple pizza is a disgrace to society.&lt;/p&gt;\n\n&lt;p&gt;And this got me thinking, how in the fuck can pizza, one of the most inclusive foods on the planet, that can be done with any ingredients you have in your pantry, taste bad when it has this one ingredient added to it? &lt;/p&gt;\n\n&lt;p&gt;So you know what I did? I JUST FUCKING ORDERED ONE. It&amp;#39;s on its way to me, in about 35 minutes I will taste a pineapple pizza and return here with the conclusion. I&amp;#39;m pretty sure that it&amp;#39;s gonna taste like any pizza though, but will see.&lt;/p&gt;\n\n&lt;p&gt;Later edit: I&amp;#39;ve had one with corn, pineapple, bacon, bell peper, tomatoes, and some other type of meat and it was really good. I think I&amp;#39;ll order it again some time&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/sa2wqu/why_do_so_many_people_hate_pineapple_on_pizza/",
  "subreddit": "TooAfraidToAsk",
  "id": "sa2wqu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'll be honest, I only ate pineapple pizza twice and although I can't say that\nit's my favorite, I did find it pretty enjoyable. And then I got onto the\ninternet and I was somewhat scared of trying it ever again. I mean not actually\nscared, but because it was so stigmatized, I always decided to not…"
}