{
  "author": "LateAardvark2933",
  "original_created_utc": 1639937836,
  "title": "My Bitcoin allows me to live stress-free.",
  "created_utc": 1639953114,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Nothing scares me anymore, right now my financial future is secure. I have more money than I’ve ever had in my life. It can’t be confiscated, stolen, devalued, undermined, frozen, etc. I can take it to any country on earth and easily convert it to some form of usable currency there. When hyperinflation comes, the price of Bitcoin will hyperinflate as well and my financial status will be protected. Holding Bitcoin has shown me that the news is just a tool of control to spread fear, uncertainty, doubt so that you act out of emotion, so I don’t watch the news anymore. My life is tranquil, every day I just do what I need to do to acquire more Bitcoin and I execute my plan effortlessly knowing I am on the path to becoming my own sovereign person that nobody will be able to control without use of physical force, which I will be prepared for.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 227,
  "permalink": "/r/Bitcoin/comments/rk2c2j/my_bitcoin_allows_me_to_live_stressfree/",
  "subreddit": "Bitcoin",
  "id": "rk2c2j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Nothing scares me anymore, right now my financial future is secure. I have more\nmoney than I’ve ever had in my life. It can’t be confiscated, stolen, devalued,\nundermined, frozen, etc. I can take it to any country on earth and easily\nconvert it to some form of usable currency there. When…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もう何も怖くありません。今、私の経済的な未来は安全です。私はもっと\n今までの人生で一番お金を持っている。没収されたり、盗まれたり、価値を下げられたりすることはない。\n凍結など 地球上のどの国へも持っていけるし、簡単に\n現地で使える通貨に交換する。いつ...",
      "title": "ビットコインのおかげで、ストレスフリーに生活できています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "没有什么能让我感到害怕了，现在我的经济前景是安全的。我拥有的\n我的钱比我一生中拥有的都多。它不可能被没收、偷窃、贬值。\n削弱、冻结等等。我可以把它带到地球上的任何国家，并轻松地\n兑换成某种形式的可用货币。当...",
      "title": "我的比特币让我可以毫无压力地生活。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "沒有什麼能讓我感到害怕了，現在我的經濟前景是安全的。我擁有的\n我的錢比我一生中擁有的都多。它不可能被沒收、偷竊、貶值。\n削弱、凍結等等。我可以把它帶到地球上的任何國家，並輕鬆地\n兌換成某種形式的可用貨幣。當...",
      "title": "我的比特幣讓我可以毫無壓力地生活。"
    }
  ]
}