{
  "author": "Chooky47",
  "original_created_utc": 1635632062,
  "title": "When we’re at ATHs, the meme coin casino opens up. Be mindful that investing in them is gambling, and that if gambling has been a problem for you in the past be careful and self-aware of what you are doing. Because it’s not investing.",
  "created_utc": 1635642884,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Seems to be a recurring theme, which was last experienced in May, that once the <em>real</em> projects peak and top ATHs, the <strong>meme coin casino</strong> opens up. </p>\n\n<p>Some prominent stars of the club currently include our beloved Shiba, but thanks to this sub more than anything inadvertently pumping it, I’ve noticed Dogelon Mars Rover 5000 also has cracked the top 100 for some unknown reason (I might have the name slightly wrong, perhaps intentionally). </p>\n\n<p>There’s nothing wrong with entering the meme mania, but you have to acknowledge that these bets are purely gambling. You aren’t investing, and while it’s okay to gamble (I mean, I’ve been to casinos before), please check yourselves if you have a past history with gambling that could cause you issues - because this isn’t any different. </p>\n\n<p>For anyone keen to maintain investing strategies, don’t feel pressured to have to hit the cas. </p>\n\n<p>The solid tangible projects began this rush, and they’ll sustain it long after the thousands of baseless upstarts (e.g dogetesla galactic pumpkin) come and go - they are great places to have your money and you shouldn’t feel pressured to join that craze. </p>\n\n<p>TL:DR - Meme coins are a casino based on pure gambling mentality, be aware of this if gambling has been a problem for you in the past. Proper projects began this rush, will maintain it, and will endure after it.</p>\n</div><!-- SC_ON -->",
  "score": 203,
  "permalink": "/r/CryptoCurrency/comments/qjbw0z/when_were_at_aths_the_meme_coin_casino_opens_up/",
  "subreddit": "CryptoCurrency",
  "id": "qjbw0z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Seems to be a recurring theme, which was last experienced in May, that once the\nreal projects peak and top ATHs, the meme coin casino opens up.\n\nSome prominent stars of the club currently include our beloved Shiba, but thanks\nto this sub more than anything inadvertently pumping it, I’ve noticed…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "5月に経験したように、本物のプロジェクトがピークに達してATHを超えると、ミームコインのカジノがオープンするということが繰り返されているようだ。\n実質的なプロジェクトがピークに達してATHを超えると、ミームコインのカジノがオープンする。\n\n現在、このクラブの著名なスターには、我らが愛すべき柴ちゃんも含まれていますが、何よりもこのサブのおかげで\nこのサブのおかげで、何よりも気がついたことがあります。",
      "title": "ATHにいるときは、ミームコインカジノが開きます。それらに投資することはギャンブルであり、過去にギャンブルが問題になったことがある人は気をつけて自戒するように心掛けてください。なぜなら、それは投資ではないからです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这似乎是一个反复出现的主题，最后一次是在5月份，一旦真正的项目达到顶峰并达到ATH，回忆就会消失。\n一旦真正的项目达到顶峰和顶级的ATH，回忆币的赌场就会打开。\n\n目前俱乐部的一些突出的明星包括我们心爱的Shiba，但由于\n这个子比任何不经意间抽出的东西更重要，我注意到...",
      "title": "当我们在ATH时，回忆币的赌场就打开了。要注意的是，投资它们就是赌博，如果赌博在过去对你来说是个问题，要小心和自我意识到你在做什么。因为这不是投资。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這似乎是一個反覆出現的主題，最後一次是在5月份，一旦真正的項目達到頂峯並達到ATH，回憶就會消失。\n一旦真正的項目達到頂峯和頂級的ATH，回憶幣的賭場就會打開。\n\n目前俱樂部的一些突出的明星包括我們心愛的Shiba，但由於\n這個子比任何不經意間抽出的東西更重要，我注意到...",
      "title": "當我們在ATH時，回憶幣的賭場就打開了。要注意的是，投資它們就是賭博，如果賭博在過去對你來說是個問題，要小心和自我意識到你在做什麼。因爲這不是投資。"
    }
  ]
}