{
  "author": "Creeemi",
  "original_created_utc": 1627389297,
  "title": "In 1968 one of the worlds first successful heart transplants was performed on Philip Blaiberg a white South African who was given the heart of Clive Haupt - a young black man. In the era of \"Grand Apartheid\" what were the reaction to the ethics of this?",
  "created_utc": 1627416069,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Edit: Haupt was &quot;coloured&quot; not &quot;black&quot;, a very important difference explained in an answer by <a href=\"/u/khosikulu\">u/khosikulu</a> below</p>\n\n<p>I found very little information on the Clive Haupt, only that he was a 24 year old &quot;a coloured man who had collapsed on a Cape Town beach the day before&quot; according to <a href=\"https://en.wikipedia.org/wiki/Philip_Blaiberg\">Wikipedia</a>. According to this stub from the <a href=\"https://historyengine.richmond.edu/episodes/view/4878\">History Engine of University of Richmond</a> he Blaiberg was buried in an all white cementary and this was according to this site a &quot; cause of celebration because it was illegal for “coloreds” to be buried in the same cemeteries as whites &quot; The Wiki also says &quot;That the identity of the heart donor had been released led to much heated controversy in South Africa.&quot;</p>\n\n<p>This is understandable of course, but what I&#39;m wondering is if there wasn&#39;t much more controversy about the ethics of the obvious use of racial power at play here, where a black mans body was used without consent (I would assume so at least, considering it&#39;s Apartheid) to extend the life of a white man. So how did people react to this? Was it seen as &quot;noble&quot; or as a humiliation? Or as something else completely? Would it later &quot;normal&quot; for black peoples bodies to be used as organ donors for whites in South Africa? Was there awareness of this practice and was it really a &quot;cause of celebration&quot; or was there also (black) resistance to this?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/oslywf/in_1968_one_of_the_worlds_first_successful_heart/",
  "subreddit": "AskHistorians",
  "id": "oslywf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Edit: Haupt was \"coloured\" not \"black\", a very important difference explained in\nan answer by u/khosikulu [/u/khosikulu] below\n\nI found very little information on the Clive Haupt, only that he was a 24 year\nold \"a coloured man who had collapsed on a Cape Town beach the day before\"\naccording to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "編集：ハウプトは「黒」ではなく「色」だった。この重要な違いについては、以下のukhikulu[/ukhikulu]の回答で説明されている。\n以下のu/khosikulu [/u/khosikulu]さんの回答で説明されています。\n\nクライヴ・ハウプトについての情報はほとんどなく、24歳の「有色人種の男性で、土砂崩れで倒れた」という情報しかなかった。\n前日にケープタウンのビーチで倒れていた24歳の有色人種」ということくらいです。\nによると...",
      "title": "1968年、世界初の心臓移植は、南アフリカの白人男性フィリップ・ブライバーグに、黒人青年クライヴ・ハウプトの心臓を移植することで成功しました。大アパルトヘイト」の時代に、この倫理観にはどのような反応があったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：Haupt是 \"彩色 \"而不是 \"黑色\"，这个非常重要的区别在\n以下是u/khosikulu [/u/khosikulu]的答案\n\n我发现关于克莱夫-哈普特的信息很少，只知道他是一个24岁的\n他是一个24岁的 \"有色人种，前一天在开普敦的海滩上晕倒了\"\n根据...",
      "title": "1968年，世界上第一批成功的心脏移植手术之一是在南非白人菲利普-布莱伯格身上进行的，他得到了克莱夫-豪普特的心脏--一个年轻的黑人男子。在 \"大种族隔离 \"的时代，人们对这一伦理问题的反应是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：Haupt是 \"彩色 \"而不是 \"黑色\"，這個非常重要的區別在\n以下是u/khosikulu [/u/khosikulu]的答案\n\n我發現關於克萊夫-哈普特的信息很少，只知道他是一個24歲的\n他是一個24歲的 \"有色人種，前一天在開普敦的海灘上暈倒了\"\n根據...",
      "title": "1968年，世界上第一批成功的心臟移植手術之一是在南非白人菲利普-布萊伯格身上進行的，他得到了克萊夫-豪普特的心臟--一個年輕的黑人男子。在 \"大種族隔離 \"的時代，人們對這一倫理問題的反應是什麼？"
    }
  ]
}