{
  "author": "NobodyAsked0913",
  "original_created_utc": 1653012809,
  "title": "Does anyone feel grossed out over how many things they own?",
  "created_utc": 1653072120,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes I feel grossed out knowing that half the things I own no longer bring me any joy or satisfaction and will eventually end up in landfills. I know capitalism plays a big part in the way we mindlessly consume. Even people with collections weird be out. Why buy so many squish mellows when you can’t even enjoy or see your collection because they are falling off shelves? Why own hundreds of books when they start collecting dust after years of not being touched? I don’t think I’m at the point of minimalism yet, but something to think about.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/utj0gw/does_anyone_feel_grossed_out_over_how_many_things/",
  "subreddit": "NoStupidQuestions",
  "id": "utj0gw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Sometimes I feel grossed out knowing that half the things I own no longer bring\nme any joy or satisfaction and will eventually end up in landfills. I know\ncapitalism plays a big part in the way we mindlessly consume. Even people with\ncollections weird be out. Why buy so many squish mellows when you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "時々、私が持っている物の半分がもう持ってこないことを知り、気持ち悪いと思うことがあります\nを持ち、最終的には埋立地行きになることを考えると、ゾッとします。私は知っています。\n資本主義が、私たちの無頓着な消費の仕方に大きな影響を与えていることは知っています。コレクションしている人も\nコレクションしている人も、おかしいと思います。なぜ、こんなにたくさんメロンパンを買うのか？",
      "title": "自分の持っているモノの多さにキモチ悪さを感じる人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有时我知道我拥有的一半东西不再带来，感到很恶心。\n带来任何快乐或满足，最终将被丢弃在垃圾场。我知道\n资本主义在我们无意识的消费方式中起了很大作用。甚至有的人\n收藏品也会被淘汰。为什么要买那么多压扁的面包，当你...",
      "title": "有没有人因为自己拥有的东西太多而感到恶心？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有時我知道我擁有的一半東西不再帶來，感到很噁心。\n帶來任何快樂或滿足，最終將被丟棄在垃圾場。我知道\n資本主義在我們無意識的消費方式中起了很大作用。甚至有的人\n收藏品也會被淘汰。爲什麼要買那麼多壓扁的麪包，當你...",
      "title": "有沒有人因爲自己擁有的東西太多而感到噁心？"
    }
  ]
}