{
  "author": "harjeet_hellboy321",
  "original_created_utc": 1624790554,
  "title": "I will never recommend any family member or friends to crypto ...EVER.",
  "created_utc": 1624822528,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><ul>\n<li>I clearly highlighted to them the risks and rewards of investing and the best investment is to invest in the tech of the coin by doing the right research first, that doesn&#39;t matter though since all they are seeing is the price NOW and all coins are down now.</li>\n<li>I explicitly told them to avoid some scam coins  (and they did so that&#39;s good) but again it doesn&#39;t matter now since everything is down, the scam coins with the good coins.</li>\n<li>No I don&#39;t expect people to thank me for introducing them to crypto, I only mentioned this part to highlight how they only remembered me when the market dipped.</li>\n<li>I learned the lesson the hard way, so fuck me sideways if I ever try to talk about crypto to anyone else IRL again</li>\n<li>Yes, I believe the whole market will bounce back soon, do your own research on why crypto was created in the first place.</li>\n<li>I won&#39;t recommend any coins here in this post because the point of this post is not shilling, please do your own research and decide</li>\n<li>Remember, you only lose / profit when sell, all the numbers you see in your portfolio apps are just that, numbers.</li>\n</ul>\n\n<p>Original Post:</p>\n\n<p>In April I started talking about crypto with my family and friends and gave them a little &quot;push&quot; to start investing small amounts to experiment... I wanted them to make some money because I know they could really use it and I explained how volatile the market rn and the rewards and risk they would have to take and strongly advised them to never ever invest what they can&#39;t afford to lose</p>\n\n<p>Some of them got really invested and saw some big gains and started to show off their percentage gains on social media (which is stupid but whatever).</p>\n\n<p>Noone really thanked me for introducing them to crypto when they made some big gains, they all acted like they got into it because they were smart (before I introduced them to crypto they thought bitcoin was a physical golden coin and can&#39;t be bought in fraction), but again whatever I didn&#39;t do it for people to thank me I just wanted them to make some money because I know they needed some.</p>\n\n<p>Fast forward to today morning and FUCK.MY.LIFE I opened my phone and I find a barrage of messages from them accusing me of scamming them and tricking them into crypto because they lost money, I tried to explain to them that this is normal and it will bounce back soon and it&#39;s just a correction and don&#39;t sell but they aren&#39;t listening most of them sold and &quot;cut their loses&quot; before the &quot;bubble burst&quot;.</p>\n\n<p>I am never going to talk about crypto with anyone in real life again, fuck em I am not getting involved in this shitty situation ever again</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/CryptoCurrency/comments/o8uq1n/i_will_never_recommend_any_family_member_or/",
  "subreddit": "CryptoCurrency",
  "id": "o8uq1n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": " * I clearly highlighted to them the risks and rewards of investing and the best\n   investment is to invest in the tech of the coin by doing the right research\n   first, that doesn't matter though since all they are seeing is the price NOW\n   and all coins are down now.\n * I explicitly told them to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": " * 私は彼らに、投資のリスクとリターンを明確に説明しました。\n   コインの技術に投資することです。\n   しかし、彼らが見ているのは今の価格だけなので、それは重要ではありません。\n   全てのコインは今下がっています。\n * 私が彼らに明確に言ったことは...",
      "title": "私は、家族や友人にcryptoを勧めることは絶対にありません...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": " * 我向他们清楚地强调了投资的风险和回报，最好的投资是通过正确的研究投资于硬币的技术。\n   最好的投资是通过正确的研究投资于硬币的技术。\n   但这并不重要，因为他们看到的只是现在的价格。\n   而现在所有的硬币都在下跌。\n * 我明确地告诉他们...",
      "title": "我永远不会推荐任何家庭成员或朋友使用加密货币...永远不会。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " * 我向他們清楚地強調了投資的風險和回報，最好的投資是通過正確的研究投資於硬幣的技術。\n   最好的投資是通過正確的研究投資於硬幣的技術。\n   但這並不重要，因爲他們看到的只是現在的價格。\n   而現在所有的硬幣都在下跌。\n * 我明確地告訴他們...",
      "title": "我永遠不會推薦任何家庭成員或朋友使用加密貨幣...永遠不會。"
    }
  ]
}