{
  "author": "jdrukis",
  "the_new_excerpt": "AMC has more drama than your typical soap opera but rarely has a stock has such\na payout opportunity. No, they won’t hit $40 again... $15 sure, but even at $15\na lot of people will sell since it seems to be when most people bought in hoping\nto ride it, dropping it quickly there after.\n\nAMC may not…",
  "original_created_utc": 1612633789,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "AMC有更多的戏剧比你的典型的肥皂剧，但很少有一个股票有这样的。\n一个赔付的机会。不，他们不会再达到40美元... 15美元肯定，但即使在15美元的时候\n很多人将出售，因为它似乎是当大多数人买在希望\n来骑它，之后迅速把它丢在那里。\n\nAMC可能不...",
      "title": "$AMC买入并持有至推出"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "AMC有更多的戲劇比你的典型的肥皂劇，但很少有一個股票有這樣的。\n一個賠付的機會。不，他們不會再達到40美元... 15美元肯定，但即使在15美元的時候\n很多人將出售，因爲它似乎是當大多數人買在希望\n來騎它，之後迅速把它丟在那裏。\n\nAMC可能不...",
      "title": "$AMC買入並持有至推出"
    }
  ],
  "title": "$AMC buy and hold till launch",
  "created_utc": 1612673920,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>AMC has more drama than your typical soap opera but rarely has a stock has such a payout opportunity. No, they won’t hit $40 again... $15 sure, but even at $15 a lot of people will sell since it seems to be when most people bought in hoping to ride it, dropping it quickly there after. </p>\n\n<p>AMC may not launch this coming week (though it could). But if it doesn’t, it will then drop when people sell their losses. I’m F’in Buying if that happens, lowering my cost average. </p>\n\n<p>AMC stock will level out high within 3 months. They are open now which is minimizing their losses. They are renewing leases which is increasing confidence. They are controlling their debt (lots of positive this past week). Everyone wants to get back to normal and you better believe once they are back to full capacity they will be raking in the revenue and increasing their profits from this past weeks debt reductions. </p>\n\n<p>Thoughts?</p>\n</div><!-- SC_ON -->",
  "score": 73,
  "permalink": "/r/stocks/comments/le2o2r/amc_buy_and_hold_till_launch/",
  "subreddit": "stocks",
  "id": "le2o2r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123201984
}