{
  "author": "diasporajones",
  "original_created_utc": 1636738002,
  "title": "I'm beginning to think all price movements, at any time, can be attributed to whale manipulation",
  "created_utc": 1636781943,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There&#39;s no way my personal favourite Blockchain Algorand is going up 20% in value during a market wide correction organically. Not because of an adoption tipping point, or as the result of the news surrounding a crypto event or a major investment, or a new features update like the TPS increase coming. I mean those are all possible ways for a cryptocurrency to get exposure and they will affect the price but let&#39;s be realistic. It&#39;s simply impossible that across the entire crypto space, lots of retail investors simultaneously, hive-mind like, have chosen yesterday and today as the days to start going big in Algorand. That just isn&#39;t happening, so what&#39;s the explanation? No, it&#39;s a whale or group of whales mindfully shifting their bags around during a correction to avoid losses. Using my guy Algorand as their bagboy. And tomorrow or a week from now it&#39;ll be some other mid or low cap coin that has so far underperformed the market this most recent bullrun period. Feels kind of sus the entire thing tbh and leaves kind of a bad taste in my mouth, because if this is true once, it&#39;s true always. Whatever project you support, it&#39;s at the mercy of the whales at any given time and nothing you believe about its potential and quality really matter, unless the whales can use its market liquidity to preserve their gains.</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/CryptoCurrency/comments/qsg6ld/im_beginning_to_think_all_price_movements_at_any/",
  "subreddit": "CryptoCurrency",
  "id": "qsg6ld",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There's no way my personal favourite Blockchain Algorand is going up 20% in\nvalue during a market wide correction organically. Not because of an adoption\ntipping point, or as the result of the news surrounding a crypto event or a\nmajor investment, or a new features update like the TPS increase…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私のお気に入りのBlockchain Algorandが、市場全体の調整中に20％も値上がりするわけがありません。\n私のお気に入りのBlockchain Algorandが、市場が大きく調整されている最中に、有機的に20％の値上がりをすることはあり得ません。採用の転機が訪れたからではなく\n転換点のためでもなく、暗号化イベントや大規模な投資にまつわるニュースの結果でもなく\n大規模な投資、TPSの増加などの新機能のアップデートなどではありません...",
      "title": "いつの時代も、すべての値動きはクジラの操作によるものではないかと思い始めています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我个人最喜欢的区块链Algorand不可能在市场上上涨20%。\n价值在市场广泛调整期间有机地上升。不是因为采用\n不是因为一个采用的临界点，也不是因为围绕一个加密货币事件的新闻或一个\n或重大投资，或像TPS增加这样的新功能更新......",
      "title": "我开始认为，所有的价格波动，在任何时候，都可以归结为鲸鱼的操纵。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我個人最喜歡的區塊鏈Algorand不可能在市場上上漲20%。\n價值在市場廣泛調整期間有機地上升。不是因爲採用\n不是因爲一個採用的臨界點，也不是因爲圍繞一個加密貨幣事件的新聞或一個\n或重大投資，或像TPS增加這樣的新功能更新......",
      "title": "我開始認爲，所有的價格波動，在任何時候，都可以歸結爲鯨魚的操縱。"
    }
  ]
}