{
  "author": "t3hPoundcake",
  "original_created_utc": 1641337293,
  "title": "Why in the fucking hell do companies refuse to post the hourly rate or salary on their job ads?",
  "created_utc": 1641351806,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It makes no sense to me. I&amp;#39;m not talking about burger flipping jobs either, I mean jobs that require a degree or years of experience in a certain field. People who already have experience (i.e. already have a fucking job) aren&amp;#39;t going to apply to another job if they don&amp;#39;t know how much money they will be making. It doesn&amp;#39;t help anything. Every company complaining about how nobody wants to work, it&amp;#39;s because you&amp;#39;re too stupid to tell people the only relevant information about your position. Fucking morons.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/NoStupidQuestions/comments/rw7c2m/why_in_the_fucking_hell_do_companies_refuse_to/",
  "subreddit": "NoStupidQuestions",
  "id": "rw7c2m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It makes no sense to me. I'm not talking about burger flipping jobs either, I\nmean jobs that require a degree or years of experience in a certain field.\nPeople who already have experience (i.e. already have a fucking job) aren't\ngoing to apply to another job if they don't know how much money they…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "意味がないんです。ハンバーガーをひっくり返す仕事のことではありません。\nある分野での学位や長年の経験が必要な仕事のことです。\nすでに経験を持っている人（つまり、すでにクソみたいな仕事を持っている人）は\nを、「いくら稼げるかわからないから」といって応募するのは、ちょっと...。",
      "title": "なぜ企業は求人広告に時給や給料を載せることを拒むのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这对我来说毫无意义。我说的也不是炒汉堡的工作，我指的是需要学位或在某个领域有多年经验的工作。\n我指的是那些需要学位或在某一领域有多年经验的工作。\n已经有经验的人（也就是已经有一份该死的工作）不会\n如果他们不知道自己有多少钱，就不会去申请另一份工作。",
      "title": "为什么该死的公司拒绝在招聘广告上公布时薪或工资？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這對我來說毫無意義。我說的也不是炒漢堡的工作，我指的是需要學位或在某個領域有多年經驗的工作。\n我指的是那些需要學位或在某一領域有多年經驗的工作。\n已經有經驗的人（也就是已經有一份該死的工作）不會\n如果他們不知道自己有多少錢，就不會去申請另一份工作。",
      "title": "爲什麼該死的公司拒絕在招聘廣告上公佈時薪或工資？"
    }
  ]
}