{
  "author": "samparry131",
  "original_created_utc": 1653209070,
  "title": "Achieved my BTC goal of 0.1",
  "created_utc": 1653262419,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m so stoked to say I have finally achieved my goal of 0.1 BTC. It may not sound like much to some but I have hope that one day it might help me out to buy a house using this amount. &lt;/p&gt;\n\n&lt;p&gt;I have been stacking sats for the past year and a half and just putting bits in when ever I can. If you can take anything away from this, it’s not about how fast you can make your money. It’s all about the journey of making money and averaging into the market is the easiest, safest way IMO! &lt;/p&gt;\n\n&lt;p&gt;My next goal is now 0.25 it’s probably gonna take another year or 2 but I know I can do it. Until then✌️&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "permalink": "/r/Bitcoin/comments/uv6whu/achieved_my_btc_goal_of_01/",
  "subreddit": "Bitcoin",
  "id": "uv6whu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m so stoked to say I have finally achieved my goal of 0.1 BTC. It may not\nsound like much to some but I have hope that one day it might help me out to buy\na house using this amount.\n\nI have been stacking sats for the past year and a half and just putting bits in\nwhen ever I can. If you can take…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ついに目標の0.1BTCを達成することができ、感無量です。これは\nこの金額で家を買うことができるかもしれないという希望があります。\nこの金額で家を買うことができるかもしれないと思っています。\n\nこの1年半の間、SATを積み重ね、少しずつ入れてきました。\nこの1年半はサッツを積み重ね、できるときに少しずつ入れています。あなたが取ることができれば...",
      "title": "BTCの目標値0.1を達成"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我非常兴奋地说，我终于实现了0.1 BTC的目标。这可能\n但我希望有一天它能帮助我用这笔钱买房。\n用这笔钱买房子。\n\n在过去的一年半时间里，我一直在堆积比特，只要有机会，我就把比特放进去。\n时候。如果你能接受...",
      "title": "实现了我0.1的BTC目标"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我非常興奮地說，我終於實現了0.1 BTC的目標。這可能\n但我希望有一天它能幫助我用這筆錢買房。\n用這筆錢買房子。\n\n在過去的一年半時間裏，我一直在堆積比特，只要有機會，我就把比特放進去。\n時候。如果你能接受...",
      "title": "實現了我0.1的BTC目標"
    }
  ]
}