{
  "author": "Working_Class_Pride",
  "original_created_utc": 1626221378,
  "title": "LPT: There is nothing tacky or wrong about discussing your salary with coworkers. It is a federally protected action and the only thing that can stop discrepancies in pay. Do not let your boss convince you otherwise.",
  "created_utc": 1626281666,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just want to remind everyone that you should always discuss pay with coworkers. Do not let your managers or supervisors tell you it is tacky or against the rules.</p>\n\n<p>Discussing pay with co-workers is a federally protected action. You cannot face consequences for discussing pay with coworkers- it can&#39;t even be threatened. Discussing pay with coworkers is the only thing that prevents discrimination in pay. Managers will often discourage it- They may even say it is against the rules but it never is. </p>\n\n<p><a href=\"https://en.wikipedia.org/wiki/Lilly_Ledbetter_Fair_Pay_Act_of_2009\">https://en.wikipedia.org/wiki/Lilly_Ledbetter_Fair_Pay_Act_of_2009</a></p>\n</div><!-- SC_ON -->",
  "score": 75043,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/LhMD6_i7nMmd9HX_LOTr5n1RWhnYzQ88WnlgvugSdj4.jpg?auto=webp&s=7a1fb385beafb7896f2752124787ac7563ef28ac",
          "width": 140,
          "height": 140
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/LhMD6_i7nMmd9HX_LOTr5n1RWhnYzQ88WnlgvugSdj4.jpg?width=108&crop=smart&auto=webp&s=8f17013bb3267123b033095674114b74608b4c56",
            "width": 108,
            "height": 108
          }
        ],
        "variants": {},
        "id": "gg7z1CfLpxISEDQ-0Q4ijUJcSQku_bWOFG2CjghlN0g"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/LifeProTips/comments/ojsha1/lpt_there_is_nothing_tacky_or_wrong_about/",
  "subreddit": "LifeProTips",
  "id": "ojsha1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I just want to remind everyone that you should always discuss pay with\ncoworkers. Do not let your managers or supervisors tell you it is tacky or\nagainst the rules.\n\nDiscussing pay with co-workers is a federally protected action. You cannot face\nconsequences for discussing pay with coworkers- it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さんにお伝えしたいのは、給与については常に同僚と話し合うべきだということです。\n同僚と話し合うべきです。マネージャーや上司に、それは無粋だとかルール違反だとか言われないように。\nルール違反だと言われないように。\n\n同僚と給与について話し合うことは、連邦政府が保護する行為です。同僚と給与について話し合ったことで\n同僚と給与について話し合ったことで罰せられることはありません-それは...",
      "title": "LPT: 同僚と給料について話し合うことは、無味乾燥で間違ったことではありません。連邦政府によって保護されている行為であり、給与の不一致をなくすことができる唯一の手段です。上司にそうでないと説得されないようにしましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是想提醒大家，你应该经常与同事讨论薪酬问题。\n同事讨论。不要让你的经理或主管告诉你这是俗气的或\n违反规则。\n\n与同事讨论薪酬问题是受联邦保护的行为。你不会因为讨论薪酬而面临\n你不会因为与同事讨论薪资而面临后果--它是受保护的。",
      "title": "LPT。与同事讨论你的工资没有任何俗气或错误。这是一个受联邦保护的行动，也是唯一可以阻止薪酬差异的事情。不要让你的老板说服你。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是想提醒大家，你應該經常與同事討論薪酬問題。\n同事討論。不要讓你的經理或主管告訴你這是俗氣的或\n違反規則。\n\n與同事討論薪酬問題是受聯邦保護的行爲。你不會因爲討論薪酬而面臨\n你不會因爲與同事討論薪資而面臨後果--它是受保護的。",
      "title": "LPT。與同事討論你的工資沒有任何俗氣或錯誤。這是一個受聯邦保護的行動，也是唯一可以阻止薪酬差異的事情。不要讓你的老闆說服你。"
    }
  ]
}