{
  "author": "BoundariesAreFun",
  "the_new_excerpt": "I love Bitcoin and Ethereum as much as the next guy, and consider them\nincredible investments. However, I feel that Chainlink is at least as safe of an\ninvestment as these two, with just as much potential for growth\n\nFor one, Chainlink has incredible real-world applications that aren't going…",
  "original_created_utc": 1623792075,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は他の人と同様にビットコインとイーサリアムを愛しており、それらを信じられないほどの投資と考えています。\n驚異的な投資だと思っています。しかし、Chainlinkは少なくともこれらの2つと同じくらい安全な投資先だと感じています。\nしかし、Chainlinkはこれら2つの投資と同じくらい安全で、同じくらい成長する可能性があると感じています。\n\nまず、Chainlinkには現実世界での素晴らしいアプリケーションがあり、それは...",
      "title": "チェーンリンクは最も安全な暗号投資の一つです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和下一个人一样喜欢比特币和以太坊，并认为它们是\n难以置信的投资。然而，我觉得Chainlink至少是一种安全的投资。\n投资，也有同样大的发展潜力。\n\n首先，Chainlink有令人难以置信的现实世界的应用，不会...",
      "title": "链家是最安全的加密货币投资之一"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和下一個人一樣喜歡比特幣和以太坊，並認爲它們是\n難以置信的投資。然而，我覺得Chainlink至少是一種安全的投資。\n投資，也有同樣大的發展潛力。\n\n首先，Chainlink有令人難以置信的現實世界的應用，不會...",
      "title": "鏈家是最安全的加密貨幣投資之一"
    }
  ],
  "title": "Chainlink is one of the safest crypto investments",
  "created_utc": 1623814774,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I love Bitcoin and Ethereum as much as the next guy, and consider them incredible investments. However, I feel that Chainlink is <em>at least</em> as safe of an investment as these two, with just as much potential for growth</p>\n\n<p>For one, Chainlink has incredible real-world applications that aren&#39;t going away anytime soon. Yes, they have competition with what they&#39;re doing, but they are, at least in my opinion, far and away one of if not the best choice for what it does. This is evidenced by the fact that even during the bear market last year Chainlink was seeing prices as high as $18 (only 28% less than what it is now - and this was around the same time Bitcoin was over 80% less than what it is now).</p>\n\n<p>What makes this even more appealing is that despite seemingly having a floor that&#39;s higher than most cryptos even mid-bear market, it has incredible growth potential. Just last month the price topped $50, over double what it is now. This also makes the current price a great entry point.</p>\n\n<p>Anyway.... I don&#39;t normally shill coins on here (check my history if you don&#39;t believe me), but I have a lot of love and respect for LINK and wanted to share it with you all - ignore if you want!</p>\n</div><!-- SC_ON -->",
  "score": 325,
  "permalink": "/r/CryptoCurrency/comments/o0owzx/chainlink_is_one_of_the_safest_crypto_investments/",
  "subreddit": "CryptoCurrency",
  "id": "o0owzx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009740000
}