{
  "author": "GMEgotmehere",
  "the_new_excerpt": "I'll admit, I'm a pessimistic person by default. I also can become insanely\noptimistic to the point that my family would like to get me a room at the local\nhospital. As we all know the stock market is a game of emotions. I think we\nmistakenly believe that selling for a loss is a form of weakness or…",
  "original_created_utc": 1617155005,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我承认，我默认是个悲观的人。我也可以变得疯狂\n乐观到我的家人想给我在当地开个房\n医院。众所周知，股市是一场情绪的游戏。我想我们\n误以为卖出亏损是一种软弱或...",
      "title": "为什么看起来像卖在亏损 绝对不是一个选项在这里？我想授予你卖出... ...红利的权力！在红色的！"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我承認，我默認是個悲觀的人。我也可以變得瘋狂\n樂觀到我的家人想給我在當地開個房\n醫院。衆所周知，股市是一場情緒的遊戲。我想我們\n誤以爲賣出虧損是一種軟弱或...",
      "title": "爲什麼看起來像賣在虧損 絕對不是一個選項在這裏？我想授予你賣出... ...紅利的權力！在紅色的！"
    }
  ],
  "title": "Why does it seem like selling at a loss is absolutely not an option on here? I would like to grant you the power the sell... IN THE RED!",
  "created_utc": 1617162165,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ll admit, I&#39;m a pessimistic person by default. I also can become insanely optimistic to the point that my family would like to get me a room at the local hospital. As we all know the stock market is a game of emotions. I think we mistakenly believe that selling for a loss is a form of weakness or defeat. Or we might fear we can&#39;t live with ourselves if it goes up again without us owning it. I see new traders that get down double digit percentage points and start calculating how many months they will have to hold to get their money back. </p>\n\n<p>When my trade starts going sour I decide to cut my losses and move on. Sometimes I regret it and sometimes I&#39;m really happy I did.</p>\n\n<p>A few things to remember.</p>\n\n<ol>\n<li><p>&quot;Honest&quot; DD on a speculative company is extremely hard to come by. Usually you only see what they want you to see until the earnings report comes out. Just because your DD tells you hold forever doesn&#39;t mean it&#39;ll work out. Even if you read the whole internet.</p></li>\n<li><p>Even a great company can be purchased at the wrong time. Wait for a pull back. Be patient. Even as Amazon hits all time highs you still should wait for an entry point. It&#39;s not that you&#39;ll &quot;lose money&quot; over the long term, it&#39;s just that you can get stuck trading sideways for months. If you buy high you can get stuck in the red for months. Watch the RSI (relative strength index) for a value in the 30s or 40s before jumping in at least. </p></li>\n<li><p>Dollar cost averaging isn&#39;t just a fad. It makes a ton of sense. Buy half of your position so that you can buy another half later if the stock drops significantly (relative to you) below your purchase price. If it doesn&#39;t dip further then good for you. Buy your other half on a pullback above your cost basis or be content with the half position.</p></li>\n<li><p>Always have an exit strategy when you purchase the stock. Even if your exit strategy is &quot;hold it until I retire.&quot; Don&#39;t purchase a stock without an exit strategy. That exit strategy should include a maximum loss amount along with a potential gains amount. Stick a stop loss (or have a dca price target) at your max loss. Once the stock gets above your gain goal stick a stop loss at that level. Let it keep running if it will or sell if it doesn&#39;t. Minimizing losses is more important than people give it credit for in this sub. </p></li>\n<li><p>Did the reason that you purchased the stock change? If so, SELL IT. If you bought the stock because you believed something would happen and it doesn&#39;t, sell it. Whether it&#39;s a loss, or gain, or break even. Your emotions will get the best of you if the reason for buying the stock is no longer valid. You won&#39;t be able to hold through the dips or recognize if you should take profits when you should. </p></li>\n<li><p>Diversification. It&#39;s easier to hold red when you have green along side of it. Buy stocks in other sectors. As we&#39;ve all seen first hand this year, money moves around more than it comes out of the market. Rebalance your portfolio from time to time. Choose a sector you don&#39;t have money in and find a stock you like. Or choose an ETF.</p></li>\n<li><p>Easy money gained is easy money loss. The quicker your stock moved up the quicker your stock can go down. Don&#39;t be scared to take profits! You will NEVER time the top right. </p></li>\n<li><p>You can&#39;t win them all. Self explanatory. </p></li>\n</ol>\n\n<p>Even with all that in mind, luck is involved. Nobody knows what will happen with any given stock so expect the unexpected. Having money stuck on a trade moving sideways for 12 months is worse than taking the loss and putting it elsewhere in my opinion. </p>\n\n<p>I started this post with intentions of a quick reminder that it&#39;s ok to sell for a loss sometimes and it became some sort of &quot;tips&quot; to remember post from another amateur trader on the internet. Hopefully something was of value to you if you made it this far. If not, my sincere apologies to you Mr. Warren Buffett!</p>\n</div><!-- SC_ON -->",
  "score": 212,
  "permalink": "/r/stocks/comments/mgvaxl/why_does_it_seem_like_selling_at_a_loss_is/",
  "subreddit": "stocks",
  "id": "mgvaxl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357142679
}