{
  "author": "Trompdoy",
  "original_created_utc": 1655332630,
  "title": "There's a lot of people trying to time the bottom - 99% of you aren't going to. Here's what will happen instead.",
  "created_utc": 1655349882,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve seen a ton of sentiment around here that we&amp;#39;re not anywhere close to the bottom yet.  That maximum damage is still yet to come.  Nobody on this sub or anywhere else for that matter actually knows where the price will go.  If it&amp;#39;s so obvious that bitcoin is going below 10k, why aren&amp;#39;t you shorting it right now?  Why haven&amp;#39;t you sold everything you have?  Why aren&amp;#39;t the people who are far more knowledgeable, experienced and invested than you dumping since it&amp;#39;s so obvious that BTC is going to 10k?  Seems like an easy way to profit, since it&amp;#39;s so certain, right?&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not.  We could have already hit bottom.  Truth is, nobody knows.  Even if we aren&amp;#39;t at the bottom yet, here&amp;#39;s the fate of 99% of investors on this sub:&lt;/p&gt;\n\n&lt;p&gt;&amp;gt; BTC drops further.  &amp;quot;This isn&amp;#39;t maximum damage yet.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;gt; BTC drops further.  You don&amp;#39;t buy because you&amp;#39;re too afraid that if you do, it will dip more.  You&amp;#39;re afraid that it&amp;#39;s not the bottom yet.&lt;/p&gt;\n\n&lt;p&gt;&amp;gt; BTC drops to staggering lows, everyone is panicking, articles doomsaying the end of crypto are published, the suicide hotline is pinned.  Looks damn close to the bottom.&lt;/p&gt;\n\n&lt;p&gt;&amp;gt; You don&amp;#39;t buy, because now you&amp;#39;re afraid this is the end of crypto as we know it.  The rug has been pulled, everything is going to zero.&lt;/p&gt;\n\n&lt;p&gt;&amp;gt; Crypto rallies and begins surging in price.  It multiples in value several times before you can react.  &amp;quot;It&amp;#39;s just a dead cat bounce&amp;quot; you think, or some other stupid shit like that.  So you continue to be afraid, and you don&amp;#39;t buy.&lt;/p&gt;\n\n&lt;p&gt;&amp;gt; Crypto is up 5-10x from the bottom and you FOMO in on the way up.&lt;/p&gt;\n\n&lt;p&gt;&amp;gt; Institutions dump on you again.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 362,
  "permalink": "/r/CryptoCurrency/comments/vd6pep/theres_a_lot_of_people_trying_to_time_the_bottom/",
  "subreddit": "CryptoCurrency",
  "id": "vd6pep",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've seen a ton of sentiment around here that we're not anywhere close to the\nbottom yet. That maximum damage is still yet to come. Nobody on this sub or\nanywhere else for that matter actually knows where the price will go. If it's so\nobvious that bitcoin is going below 10k, why aren't you shorting…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この辺りでは、まだ底値にはほど遠いという意見が多く見受けられます。\nまだ底を打っていない。最大の被害はまだこれからだということです。このサブサイトでも、他のサイトでも\nこのサブサイトでも、他のどこのサイトでも、実際に価格がどこに行くかはわからない。もし、そうだとしたら\nビットコインが10kを下回るのが明らかなら、なぜショートしないのか...。",
      "title": "底値の時間を計ろうとしている人がたくさんいます。99％の人はそうではないでしょう。代わりに何が起こるかを説明します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在这里看到了大量的情绪，我们还没有接近于\n底了。最大的伤害还没有到来。本网站或其他地方没有人\n其他地方都不知道价格会涨到什么程度。如果它是如此\n很明显比特币会跌破1万，你为什么不做空...",
      "title": "有很多人试图为底部计时--99%的人是不会的。以下是将会发生的情况。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在這裏看到了大量的情緒，我們還沒有接近於\n底了。最大的傷害還沒有到來。本網站或其他地方沒有人\n其他地方都不知道價格會漲到什麼程度。如果它是如此\n很明顯比特幣會跌破1萬，你爲什麼不做空...",
      "title": "有很多人試圖爲底部計時--99%的人是不會的。以下是將會發生的情況。"
    }
  ]
}