{
  "author": "Lobster_Messiah",
  "original_created_utc": 1629052077,
  "title": "Can we all try to be a bit more helpful here on r/cryptocurrency?",
  "created_utc": 1629091838,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve seen this a few times a week, at least. I just saw a brand new redditor post here on <a href=\"/r/cryptocurrency\">r/cryptocurrency</a>.  They had no karma and their vault wasn’t set up. Essentially, the question was “What is cryptocurrency and which cryptocurrency should I buy? I’m 18”.</p>\n\n<p>Of course this is post was auto-deleted. But before it was, it received a couple comments.  Some of them were solid.  Some of them…not so much.  “Moons”, “The one you did research on” and “0 karma and the man still here, lol” aren’t necessarily incorrect, but they aren’t helpful either. </p>\n\n<p>This person is 18.  The fact they want to invest - in anything - is amazing. Imagine if you were 18 years old again and you received some great advice that motivated you to start your journey? How life changing would that be? I’d love to be 18 again and have some money to invest in something like cryptocurrency. </p>\n\n<p>If you’re going to comment on posts like these, let’s ditch the one word quips and the one liners. </p>\n\n<p>Tell them about the free <a href=\"https://youtu.be/EH6vE97qIP4\">Money and Blockchain</a> class at MIT taught by Gary Gensler (now US SEC chairman). Tell them about Bitcoin and Cryptocurrencies class by UC Berkeley. Or Smart Contracts by University of Buffalo and The state University of New York.  Or Introduction to Digital Currencies by University of Nicosia (UNIC).</p>\n\n<p>Direct them to CoinBureau <a href=\"https://youtu.be/fiw5rp3zoo0\">How to buy cryptocurrency step-by-step</a> or <a href=\"https://youtu.be/VYWc9dFqROI\">Explaining crypto to complete beginners</a> on YouTube, or 99 Bitcoin’s <a href=\"https://youtu.be/41JCpzvnn_0\">What is Bitcoin?</a> or <a href=\"https://youtu.be/jxLkbJozKbY\">What is Ethereum</a> videos. Benjamin Cowen also has a good <a href=\"https://youtu.be/_P_lxTknRE4\">What is Ethereum?</a> video. </p>\n\n<p>Direct them to Satoshi’s white paper at <a href=\"https://bitcoin.org/bitcoin.pdf\">Bitcoin.org</a>. Or whatever easy-to-understand factual resources you know.</p>\n\n<p>Explain what HODL, DYOR, and DCA is. It’s tedious for us, but likely brand new information for them.  Tell them about <a href=\"/r/cryptocurrency\">r/cryptocurrency</a> moons and encourage them to set up their vaults when they can.</p>\n\n<p>Helping the next generation of cryptocurrency investors now is essentially helping yourself in the future. This 18 year old will get a job and invest their hard earned money into various assets one day.  A positive initial experience here at <a href=\"/r/cryptocurrency\">r/cryptocurrency</a> will help grow the entire cryptocurrency industry, and your current and future cryptocurrency investments.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/gYs8dO33PnxnfHftbsubzz_pmL4wRJZSF-LGMqEHp3o.jpg?auto=webp&s=eb605cd25c952e8fb77b2e02ebf56e4af4b93180",
          "width": 480,
          "height": 360
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/gYs8dO33PnxnfHftbsubzz_pmL4wRJZSF-LGMqEHp3o.jpg?width=108&crop=smart&auto=webp&s=529987c5f8c02598867d640be0a847f2fd26f446",
            "width": 108,
            "height": 81
          },
          {
            "url": "https://external-preview.redd.it/gYs8dO33PnxnfHftbsubzz_pmL4wRJZSF-LGMqEHp3o.jpg?width=216&crop=smart&auto=webp&s=c4a0e5acf9bdfdfcaa7489550f80f309650e4884",
            "width": 216,
            "height": 162
          },
          {
            "url": "https://external-preview.redd.it/gYs8dO33PnxnfHftbsubzz_pmL4wRJZSF-LGMqEHp3o.jpg?width=320&crop=smart&auto=webp&s=8707ee18567f93c1bdc70871dd4e66bd042fc066",
            "width": 320,
            "height": 240
          }
        ],
        "variants": {},
        "id": "jr4QYvhEZCaQ_lS0qpQ6C84kEQ7rV0hJ_Oie9juP_sU"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/p4yw9d/can_we_all_try_to_be_a_bit_more_helpful_here_on/",
  "subreddit": "CryptoCurrency",
  "id": "p4yw9d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve seen this a few times a week, at least. I just saw a brand new redditor\npost here on r/cryptocurrency [/r/cryptocurrency]. They had no karma and their\nvault wasn’t set up. Essentially, the question was “What is cryptocurrency and\nwhich cryptocurrency should I buy? I’m 18”.\n\nOf course this is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "少なくても週に数回は見かけます。たった今、全く新しいredditorが\nr/cryptocurrency [/r/cryptocurrency]に投稿していました。彼らにはカルマがなく、彼らの\nvaultが設定されていませんでした。本質的には、質問は「暗号通貨とは何か？\nどの暗号通貨を買えばいいですか？私は18歳です」というものでした。\n\nもちろん、これは...",
      "title": "ここr/cryptocurrencyでは、みんなでもう少し親切にしてみませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我每周至少看到过几次这样的情况。我刚刚看到一个全新的redditor\n在r/cryptocurrency[/r/cryptocurrency]这里发帖。他们没有业力，他们的\n金库也没有设置。基本上，问题是 \"什么是加密货币以及\n我应该买哪种加密货币？我是18岁\"。\n\n当然，这是...",
      "title": "在r/cryptocurrency上，我们都能试着多帮助一些吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我每週至少看到過幾次這樣的情況。我剛剛看到一個全新的redditor\n在r/cryptocurrency[/r/cryptocurrency]這裏發帖。他們沒有業力，他們的\n金庫也沒有設置。基本上，問題是 \"什麼是加密貨幣以及\n我應該買哪種加密貨幣？我是18歲\"。\n\n當然，這是...",
      "title": "在r/cryptocurrency上，我們都能試着多幫助一些嗎？"
    }
  ]
}