{
  "author": "AskStuffBurnerAcct",
  "original_created_utc": 1655022135,
  "title": "Married men, how often do you really have sex (and get other sexual acts)?",
  "created_utc": 1655038259,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I suppose this question goes for women and all genders as well. &lt;/p&gt;\n\n&lt;p&gt;But the cliche/jokes I&amp;#39;ve always heard growing up are that once you get married, your (now) wife won&amp;#39;t want to have sex any more -- and forget about bj&amp;#39;s and hj&amp;#39;s! &lt;/p&gt;\n\n&lt;p&gt;Well, sure enough! After 7 years of great sex while dating, my wife&amp;#39;s sex drive fell off a cliff within the first year of marriage.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s been 4 years now, and we have sex maybe once every two months or so. And never, ever do I get a random bj or hj.&lt;/p&gt;\n\n&lt;p&gt;For the first couple years it really affected my self esteem. And my wife did seem upset that she no longer had the urge. But we&amp;#39;ve both kind of settled on the fact that that&amp;#39;s just how it is now.&lt;/p&gt;\n\n&lt;p&gt;It sucks that I&amp;#39;m only 34, and still have a high sex drive, yet am apparently going to go without it for the rest of my life, except maybe a handful of times a year. &lt;/p&gt;\n\n&lt;p&gt;And before it comes up: yes everything else is pretty darn good in our relationship. I care for her and our baby (the drop in sex happened years before pregnancy/baby).&lt;/p&gt;\n\n&lt;p&gt;I also give her special attention every single night (30-60 minute legs rubs while we lay in bed and watch tv/she plays on her phone). And maybe it&amp;#39;s wrong, but I do resent the fact that I do this every night for her happiness, yet I can&amp;#39;t get the occasional reciprocation to make me happy. &lt;/p&gt;\n\n&lt;p&gt;I hate feeling upset about not getting sex - it makes me feel shallow. But, here we are...&lt;/p&gt;\n\n&lt;p&gt;Is this just how it goes for the majority of married guys? Or do many married guys still get blowies regularly and have good sex lives? (Obviously every relationship is going to be different... I&amp;#39;m just curious if this is really how it is in the majority of cases, and I need to just get over it).&lt;/p&gt;\n\n&lt;p&gt;I suppose this may be more of a rant to get things off my chest, but damn. It sucks.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 138,
  "permalink": "/r/TooAfraidToAsk/comments/vahh9i/married_men_how_often_do_you_really_have_sex_and/",
  "subreddit": "TooAfraidToAsk",
  "id": "vahh9i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I suppose this question goes for women and all genders as well.\n\nBut the cliche/jokes I've always heard growing up are that once you get married,\nyour (now) wife won't want to have sex any more -- and forget about bj's and\nhj's!\n\nWell, sure enough! After 7 years of great sex while dating, my wife's…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この質問は、女性だけでなく、すべての性別にも当てはまるのではないでしょうか。\n\nでも、私が子供の頃に聞いたジョークでは、「結婚したら、（今の）奥さんはセックスをしたがらなくなる。\nあなたの（今の）奥さんは、もうセックスをしたがらないだろうし、BJやHJのことも忘れるだろう。\nというものです。\n\nまあ、確かにそうですね。7年間の交際を経て、妻は...",
      "title": "既婚男性の皆さん、果たしてどれくらいの頻度でセックス（その他の性行為を受ける）しているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想这个问题对女性和所有性别来说也是如此。\n\n但是我在成长过程中一直听到的陈词滥调/笑话是，一旦你结婚了，你（现在的）妻子就不会再想做爱了。\n你（现在）的妻子就不会再想做爱了 -- 忘掉BJ和HJ吧!\nhj's!\n\n好吧，果然如此! 在约会期间，经过7年的美好性爱，我妻子的...",
      "title": "已婚男人，你真正的性生活（和得到其他性行为）有多长时间？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想這個問題對女性和所有性別來說也是如此。\n\n但是我在成長過程中一直聽到的陳詞濫調/笑話是，一旦你結婚了，你（現在的）妻子就不會再想做愛了。\n你（現在）的妻子就不會再想做愛了 -- 忘掉BJ和HJ吧!\nhj's!\n\n好吧，果然如此! 在約會期間，經過7年的美好性愛，我妻子的...",
      "title": "已婚男人，你真正的性生活（和得到其他性行爲）有多長時間？"
    }
  ]
}