{
  "author": "Zestyclose_Ad_1566",
  "the_new_excerpt": "I have been doing a lot of research around inflation, and specifically holding\nBurry's position of TBT. It is a leveraged inverse fund of the 20 year US\nTreasury Bond. The thinking is if inflation is bad, interest rates will go up.\n\nMy thinking is no way interest rates go up, even with inflation.…",
  "original_created_utc": 1622751018,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はインフレについていろいろ調べていますが、特に保有している\nBurryのポジションはTBTです。これは、米国の20年物のレバレッジド・インバース・ファンドである\n国債のレバレッジド・インバース・ファンドです。インフレがひどくなれば、金利が上がるという考え方です。\n\n私の考えは、インフレになっても金利が上がることはないというものです....",
      "title": "Michael Burry氏のインフレーションポジション"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在围绕通货膨胀做大量的研究，特别是持有\nBurry的TBT的立场。这是一个20年美国国债的杠杆反向基金。\n国库债券的杠杆反向基金。他们的想法是，如果通货膨胀不好，利率就会上升。\n\n我的想法是利率不可能上升，即使有通货膨胀....。",
      "title": "迈克尔-伯里的通货膨胀立场"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在圍繞通貨膨脹做大量的研究，特別是持有\nBurry的TBT的立場。這是一個20年美國國債的槓桿反向基金。\n國庫債券的槓桿反向基金。他們的想法是，如果通貨膨脹不好，利率就會上升。\n\n我的想法是利率不可能上升，即使有通貨膨脹....。",
      "title": "邁克爾-伯裏的通貨膨脹立場"
    }
  ],
  "title": "Michael Burry's Inflation Positions",
  "created_utc": 1622775780,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have been doing a lot of research around inflation, and specifically holding Burry&#39;s position of TBT. It is a leveraged inverse fund of the 20 year US Treasury Bond. The thinking is if inflation is bad, interest rates will go up.</p>\n\n<p>My thinking is no way interest rates go up, even with inflation. The fed has no interest in raising rates because they know, and we all know, it will lead to a crash. Let&#39;s say inflation is way higher than they think it will be, something like 5%. I still say they wouldn&#39;t raise rates. </p>\n\n<p>What am I missing?</p>\n</div><!-- SC_ON -->",
  "score": 129,
  "permalink": "/r/investing/comments/nrmpqk/michael_burrys_inflation_positions/",
  "subreddit": "investing",
  "id": "nrmpqk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404885454
}