{
  "author": "bitcoinioctib",
  "the_new_excerpt": "Today I think I'm gonna call it for my participation here in this subreddit and\npotentially all of reddit. IMO between the spam posts by mods like \"What will\nthe price of X be in a week?\" to getting rid of memes, basically this bored and\nirritated the hell out of me enough that I really don't want…",
  "original_created_utc": 1620733282,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日は、このサブレディットへの参加、そして潜在的にはreddit全体への参加を呼びかけるつもりです。\n潜在的にはreddit全体への参加も考えています。IMOは、「Xの価格は1週間後にどうなる？\n一週間後にXの価格はどうなるか」のようなMODによるスパム投稿からミームの排除まで、基本的にこの退屈で\n飽きてしまったし、イライラしてしまったので、このままでは...。",
      "title": "r/cryptocurrency farewell moon giveawayに飽きた。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天，我想我要为我在这个子版块和可能是整个reddit的参与叫好了。\n可能是所有的reddit。我想，在mods的垃圾帖子之间，比如 \"X的价格在一周内会是多少？\n的价格是多少？\"到摆脱备忘录，基本上这个无聊和烦躁的\n刺激了我的地狱，我真的不想...",
      "title": "厌倦了r/cryptocurrency告别月球的赠品"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天，我想我要爲我在這個子版塊和可能是整個reddit的參與叫好了。\n可能是所有的reddit。我想，在mods的垃圾帖子之間，比如 \"X的價格在一週內會是多少？\n的價格是多少？\"到擺脫備忘錄，基本上這個無聊和煩躁的\n刺激了我的地獄，我真的不想...",
      "title": "厭倦了r/cryptocurrency告別月球的贈品"
    }
  ],
  "title": "Bored with r/cryptocurrency farewell moon giveaway",
  "created_utc": 1620751576,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Today I think I&#39;m gonna call it for my participation here in this subreddit and potentially all of reddit.  IMO between the spam posts by mods like &quot;What will the price of X be in a week?&quot; to getting rid of memes, basically this bored and irritated the hell out of me enough that I really don&#39;t want to be here anymore.   I find myself not coming back as much anyways since you got rid of the spirit of fun on the subreddit and replaced it with the spirit of greed, so I think I&#39;m going to finally quit most of reddit and get on with more real life.   </p>\n\n<p>I will be tipping replies here until my moons run out then leaving the subreddit.  L8r y&#39;all.</p>\n\n<p>EDIT: OUT OF MOONS, SORRY FOLKS.  See y&#39;all if we get memes again.</p>\n</div><!-- SC_ON -->",
  "score": 574,
  "permalink": "/r/CryptoCurrency/comments/n9v1yj/bored_with_rcryptocurrency_farewell_moon_giveaway/",
  "subreddit": "CryptoCurrency",
  "id": "n9v1yj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985992426
}