{
  "author": "SenatusSPQR",
  "original_created_utc": 1624286320,
  "title": "All PoW/PoS coins are screwed in the long term",
  "created_utc": 1624307839,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yes, a rather callous title, in the hopes that people will come in here to tell me why I&#39;m wrong. See the bottom of this post for a TL;DR. My thesis is that cryptocurrencies relying either on PoW or PoS, cryptocurrencies with inflation, fees &amp; staking, cryptocurrencies with block subsidies and reward schedules are all screwed in the long run. My reasoning for this is that cryptocurrencies using PoW, PoS, or anything like it, actively undermine their own goals by incentivizing centralization over time at their core. In doing so, these protocols encourage a loss in stall resistance and a loss in security. I also argue that at least 2 cryptocurrencies (IOTA and Nano) solve this issue through their feeless/inflation-free proposition.</p>\n\n<h1>Why Bitcoin is screwed</h1>\n\n<p>Bitcoin mining offers rewards. These rewards consist of a block subsidy (money supply increase, currently 6.25 BTC per block) and fees. These rewards (mostly) go to those with the highest hash power. </p>\n\n<p>Bitcoin mining is a business. It&#39;s a business focused on cost efficiency, because the revenue side is largely unchangeable by miners. Total costs consist of energy costs, ASIC purchases/writedowns, capital costs, rent of the location, maintenance, etc.</p>\n\n<p>Almost all these costs have economies of scale associated with them. If I&#39;m a large miner, I have a stronger negotiating position for ASICs. I have a stronger negotiating position for energy contracts. I have access to cheaper capital, I can more efficiently maintain my ASICs. </p>\n\n<p>Combine mining rewards with economies of scale for mining, and what you get is centralization over time. The largest miners have the lowest cost-base, making the most profit, being able to reinvest more in ASICs, increasing their share of consensus over time.</p>\n\n<p>This isn&#39;t some radical, unsupported take. The theory is quite clear, and is why we tend to have anti-trust legislation in most countries. Research also backs this up, I&#39;ll link to some papers on it at the bottom of this post.</p>\n\n<p><strong>FUD, China is banning mining so miners will disperse more broadly, we have Stratum V2 coming, miners will join different mining pools, nodes are the ones that matter not miners, we don&#39;t see 80% belonging to one miner now!</strong></p>\n\n<p>None of the above changes the centralization in consensus power over time. It doesn&#39;t change the economic rationale. China banning mining means there is <strong>less</strong> dispersion, as there are now fewer locations where mining is possible. Stratum doesn&#39;t fix the incentives. Miners can join different mining pools (<a href=\"https://en.wikipedia.org/wiki/GHash.io\">though history shows they don&#39;t</a>) but it&#39;s about the underlying miners, not the mining pools. Not to mention that mining pools themselves are far more centralized than most people think (see 3) in the links below). Nodes can check the chain all they want, those with the consensus power decide whether to include transactions. If I had a majority of mining power, I wouldn&#39;t outright show it. I would send in increasingly higher fee transactions, forcing people to pay a lot for me to process their transaction. Unbelievable? Check <a href=\"https://cowles.yale.edu/3a/parlour-miner-collusion-and-bitcoin-protocol.pdf\">Miner Collusion and the Bitcoin Protocol</a> to see that hundreds of millions in excess fees are already being paid.</p>\n\n<p><strong>Good thing I&#39;m not in Bitcoin but in -insert other PoW coin here-.</strong></p>\n\n<p>The incentives and trend aren&#39;t different for other PoW coins. It&#39;s just less visible as Bitcoin has a larger market cap, so the incentives are biggest here.</p>\n\n<p><strong>Mining is terrible for environment anyway. Good thing I&#39;m in PoS coins!</strong></p>\n\n<p>Right.</p>\n\n<p>Without economies of scale in consensus, PoS is immune from this centralisation over time, right? No, and this series of steps should be even easier to follow than that for Bitcoin.</p>\n\n<p>When you stake the most coins, you get the most rewards. Those that get the most rewards grow fastest. In many PoS cryptocurrencies you need a minimum amount to stake in the first place. As a regular user using the network, you might not want to lock up your stake but rather use your coins to transact, paying fees while doing so. Some cryptocurrencies try to make the network seem more decentralized through maximizing the size of a single pool, which is a bit like saying that we can increase Bitcoin&#39;s decentralization by splitting AntPool into Ant and Pool. Nothing has changed, if anything it&#39;s simply muddying the waters by obscuring how centralized the system really is.</p>\n\n<p>All this might not matter much to those in crypto for trading/short term gains. However, the literal defining property of cryptocurrency is being decentralized. It&#39;s the mechanism to ensure security, it&#39;s what provides the underlying value in the store of value narrative for Bitcoin. It&#39;s why we are okay with sacrificing some performance relative to centralized payment processors/apps. By becoming ever more centralized over time, cryptocurrencies&#39; security and underlying value is decreasing over time, rather than increasing.</p>\n\n<h1>Possible solutions</h1>\n\n<p>The common thread in both PoS and PoW is that there are mining rewards. These rewards are offered in compensation for investing in hash power, for locking up a stake, for securing the network. It&#39;s the incentive that&#39;s needed to make people spend money, render their coins less usable, or otherwise take some form of risk. </p>\n\n<p>The simplest solution then is to remove these mining rewards. Remove block subsidies, remove fees, and there is no centralization over time inherent in the protocol as the big do not get bigger. As far as I know, only two major cryptocurrencies are both feeless and inflation-free: Nano and IOTA. Both chains rely on other incentives for transaction validation. In Nano&#39;s case, the theory is that wanting trustless access to the network and deriving value from the network <a href=\"https://senatus.substack.com/p/how-nanos-lack-of-fees-provides-all-the-right-incentives-ee7be4d2b5e8\">incentivises people and businesses to run validators</a>. In IOTA&#39;s case, the incentive is that by validating others&#39; transactions, you give yourself the option to transact. <a href=\"https://luka99.medium.com/the-tech-behind-iota-part-1-introduction-b8f82775325a\">See here</a> for a longer take. </p>\n\n<p>Does this have trade-offs? In both IOTA and Nano&#39;s case, the feeless proposition meant needing to look for a different transaction prioritization and anti-spam mechanism. In both cases, a small (tiny, rather) PoW is needed to create a transaction. In IOTA, prioritization under congestion is done through <a href=\"https://blog.iota.org/explaining-mana-in-iota-6f636690b916/\">mana, which can be rented</a>. In Nano, since recently prioritization is done through a combination of <a href=\"https://senatus.substack.com/p/nanos-latest-innovation-feeless-spam\">account balance and time since last transaction</a>.</p>\n\n<p>It needs to be said that this IOTA implementation is still mostly theoretical on mainnet. They&#39;ve had trouble the past years actually getting IOTA working without a central coordinator (making IOTA&#39;s mainnet centralized for value transfers), because the Tangle that IOTA uses is notoriously complicated and difficult. The IOTA Foundation claims to have found the solution now. As someone who has been following IOTA for a while and gotten burned during that time by believing the timelines they announced, I take a wait and see approach here. That being said, the lack of centralization over time is clear.</p>\n\n<p>In Nano, a <a href=\"https://medium.com/nanocurrency/nano-digest-new-exchanges-development-updates-partnerships-team-updates-and-more-510d65e15f65\">recent spam attack</a> lead to issues following which the aforementioned prioritization by account balance and time since last transaction began to be implemented. However, Nano&#39;s proven to be able to handle <a href=\"https://www.publish0x.com/cryptowriting/the-spam-attack-on-the-nano-network-summarised-xykoqpz\">millions of transactions per day</a> on its mainnet. More importantly, having had a decentralized mainnet for years, Nano is proving more than any other cryptocurrency that it is possible to have a decentralized cryptocurrency without fees and without inflation with high security. Over the course of ~120 million transactions, Nano has never had a doublespend nor chain re-org, something many other cryptocurrencies can&#39;t say. Over the course of these years, there have consistently been many validators running, validating the theory that without fees and inflation, there is enough reason to run validators. Without mining and without staking in Nano, centralization over time is absent from Nano at a core level, leading me to believe that unlike 99% of cryptocurrencies it&#39;s not screwed in the long run. For more information on the design and consensus of Nano, <a href=\"https://senatus.substack.com/p/the-basics-of-nano-why-its-such-an\">see also this article</a>.</p>\n\n<h1>Making a long story short</h1>\n\n<p>Every cryptocurrency that has fees and/or inflation has a trend towards consensus centralization over time. This centralization degrades the security and underlying value of a decentralized network over time. This may not be obvious yet, but without countervailing forces there is no reason to believe this trend will reverse over time. Feeless cryptocurrencies like IOTA (theoretically) and Nano (in practice) solve this through a lack of mining rewards. I believe this is the best (only?) way to ensure true decentralization in the long term, and believe that true to the title of this post, cryptocurrencies that centralize over time are screwed in the long term.</p>\n\n<p>I&#39;d love to hear what PoS/PoW coin supporters think of this, and where the mistakes in my reasoning are. If there are other cryptocurrencies that are also feeless/inflation-free, I&#39;d love to hear so too.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li><a href=\"https://www.semanticscholar.org/paper/Trend-of-centralization-in-Bitcoin&#x27;s-distributed-Beikverdi-Song/469072daa94eff4a9ea88c7f828cbdf1269768dd\">Trend of centralization in Bitcoin&#39;s distributed network</a>.</li>\n<li><a href=\"https://arxiv.org/pdf/1801.03998.pdf\">Decentralization in Bitcoin and Ethereum Networks</a>.</li>\n<li><a href=\"https://weis2019.econinfosec.org/wp-content/uploads/sites/6/2019/05/WEIS_2019_paper_30.pdf\">A Deep Dive into Bitcoin Mining Pools</a>. </li>\n<li><a href=\"https://medium.com/tokenanalyst/centralisation-in-bitcoin-mining-a-data-driven-investigation-7fb0caa48157\">Centralisation in Bitcoin Mining: A Data-Driven Investigation</a>.</li>\n<li><a href=\"https://cowles.yale.edu/3a/parlour-miner-collusion-and-bitcoin-protocol.pdf\">Miner Collusion and the Bitcoin Protocol</a>.</li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 495,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/apkmo5zs_-YmFFDjmG62TyIS5jvdW18a790XKORnEu8.jpg?auto=webp&s=d430e4efd42baf58b4bc71c9549944b7bdf40715",
          "width": 50,
          "height": 39
        },
        "resolutions": [],
        "variants": {},
        "id": "K8Lxcv5aHkjcbujO-2N7cVXtdXkwYe8BHCOouTCCjb8"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/o4wl85/all_powpos_coins_are_screwed_in_the_long_term/",
  "subreddit": "CryptoCurrency",
  "id": "o4wl85",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Yes, a rather callous title, in the hopes that people will come in here to tell\nme why I'm wrong. See the bottom of this post for a TL;DR. My thesis is that\ncryptocurrencies relying either on PoW or PoS, cryptocurrencies with inflation,\nfees & staking, cryptocurrencies with block subsidies and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このタイトルは、私が間違っていると言ってくれる人が現れることを期待してつけたものです。\n私がなぜ間違っているのかを教えてくれる人がここに来ることを期待しています。TL;DRについては、この記事の下部を参照してください。私の論文は以下の通りです。\nPoWまたはPoSに依存する暗号通貨、インフレを伴う暗号通貨。\n手数料やステーキングがある暗号通貨、ブロック補助金がある暗号通貨、そして...。",
      "title": "すべてのPoW/PoSコインは、長期的には失敗する。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，一个相当冷酷的标题，希望人们会来这里告诉我为什么我错了。\n我为什么错了。请看本帖底部的TL;DR。我的论点是\n依靠PoW或PoS的加密货币，有通货膨胀的加密货币。\n费用和赌注的加密货币，有区块补贴的加密货币和...",
      "title": "从长远来看，所有的PoW/PoS币都被搞砸了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，一個相當冷酷的標題，希望人們會來這裏告訴我爲什麼我錯了。\n我爲什麼錯了。請看本帖底部的TL;DR。我的論點是\n依靠PoW或PoS的加密貨幣，有通貨膨脹的加密貨幣。\n費用和賭注的加密貨幣，有區塊補貼的加密貨幣和...",
      "title": "從長遠來看，所有的PoW/PoS幣都被搞砸了"
    }
  ]
}