{
  "author": "MauryIAmNotTheFather",
  "the_new_excerpt": "I've had too many people tell me im super white, I can't claim another ethnicity\nbecause people think I'm white, and that is what's dominant.\n\nI'm literally 50 percent Asian. I'm the spitting image of my Asian mom. She's\nFROM that Asian country, has a freaking accent, and we grew up with…",
  "original_created_utc": 1617253445,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我有太多的人告诉我，我是超级白人，我不能说是其他种族的人。\n因为人们认为我是白人， 而这是什么主导。\n\n我是字面上50％的亚洲。我的吐像 我的亚洲妈妈。她是\n从那个亚洲国家来的，有一个畸形的口音， 我们长大了... ...",
      "title": "为什么如果你看起来很白，当你告诉他们你只有50%或25%的白人时，人们就会否定你的其他种族？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有太多的人告訴我，我是超級白人，我不能說是其他種族的人。\n因爲人們認爲我是白人， 而這是什麼主導。\n\n我是字面上50％的亞洲。我的吐像 我的亞洲媽媽。她是\n從那個亞洲國家來的，有一個畸形的口音， 我們長大了... ...",
      "title": "爲什麼如果你看起來很白，當你告訴他們你只有50%或25%的白人時，人們就會否定你的其他種族？"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "私は多くの人に、私は超白人だから他の民族を主張することはできないと言われてきました。\nなぜなら、人々は私を白人だと思い、それが支配的であるからです。\n\n私は文字通り50パーセントがアジア人です。私はアジア人の母にそっくりなのです。彼女は\nアジアの国から来ていて、すごく訛っていて、私たちは一緒に育って...。",
      "title": "見た目が白人だと、白人の割合が50％や25％しかないと言うと、他の民族を否定する人がいるのはなぜ？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "私は多くの人に、私は超白人だから他の民族を主張することはできないと言われてきました。\nなぜなら、人々は私を白人だと思い、それが支配的であるからです。\n\n私は文字通り50パーセントがアジア人です。私はアジア人の母にそっくりなのです。彼女は\nアジアの国から来ていて、すごく訛っていて、私たちは一緒に育って...。",
      "title": "見た目が白人だと、白人の割合が50％や25％しかないと言うと、他の民族を否定する人がいるのはなぜ？"
    }
  ],
  "title": "How come if you look white, people negate the other ethnicities you are when you tell them you're only 50 or 25 percent white?",
  "created_utc": 1617287192,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve had too many people tell me im super white,  I can&#39;t claim another ethnicity because people think I&#39;m white,  and that is what&#39;s dominant.</p>\n\n<p>I&#39;m literally 50 percent Asian.  I&#39;m the spitting image of my Asian mom.  She&#39;s FROM that Asian country, has a freaking accent, and we grew up with said countries customs and food.  I can&#39;t freaking help I was born translucent <em>seriously, I&#39;m whiter than my IRISH husband</em></p>\n\n<p>It actually hurts me deeply because I love my mom.  Just cause I get my skin color from my ethnically polish dad doesn&#39;t make me any less what I was born as.</p>\n\n<p>Edit - thank you for those answering.  This is a serious question and I wanted to see if I was missing something.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/mho2os/how_come_if_you_look_white_people_negate_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "mho2os",
  "is_self": true,
  "media": null,
  "is_video": false
}