{
  "author": "BookkeeperCalm84",
  "original_created_utc": 1653926191,
  "title": "Do other people get extremely horny, enjoy lewd thoughts and naked bodies and the like, and marsturbate often, but find actual sex to be kind of offputting?",
  "created_utc": 1653959700,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I feel so weird saying this. I’m SUPER horny a lot of the time, to the point where it’s genuinely a problem sometimes with how much I devote to that side of life, but I don’t have any desire for actual sex. I just love the female form in addition to a few specific fetishes. I freak the fuck out over the slightest bit of midriff or ass or boobs showing or something, but when I actually see a vagina or see sex or whatever it’s somewhere between ‘this does nothing’ to ‘this is gross’. I know this is probably pretty common among kids but… im 20. Is there a name for this? Do other people usually have this kind of thing?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 123,
  "permalink": "/r/TooAfraidToAsk/comments/v13a9q/do_other_people_get_extremely_horny_enjoy_lewd/",
  "subreddit": "TooAfraidToAsk",
  "id": "v13a9q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I feel so weird saying this. I’m SUPER horny a lot of the time, to the point\nwhere it’s genuinely a problem sometimes with how much I devote to that side of\nlife, but I don’t have any desire for actual sex. I just love the female form in\naddition to a few specific fetishes. I freak the fuck out…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんなことを言うのは、とても変な感じです。私はいつも超ムラムラしています。\nその方面にどれだけ専念しているかが、時々純粋に問題になるくらいです。\nでも、実際のセックスに対する欲求はないんだ。ただ、女性の形が好きなんです。\nフェチなんだ 怖いよ...",
      "title": "他の人は、ものすごくムラムラして、淫らな考えや裸体などを楽しんで、よくマーストしているのに、実際のセックスはなんだか不快に感じるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得这么说很奇怪。我在很多时候都是超级饥渴的，甚至到了这样的程度。\n有时我在生活中投入了多少精力，这确实是个问题。\n但我对实际的性生活没有任何欲望。我只是喜欢女性的形态\n除了一些特定的恋物癖。我他妈的吓坏了...",
      "title": "其他人会不会非常饥渴，喜欢猥亵的想法和赤裸的身体之类的东西，并经常自慰，但发现实际的性行为有点令人反感？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得這麼說很奇怪。我在很多時候都是超級飢渴的，甚至到了這樣的程度。\n有時我在生活中投入了多少精力，這確實是個問題。\n但我對實際的性生活沒有任何慾望。我只是喜歡女性的形態\n除了一些特定的戀物癖。我他媽的嚇壞了...",
      "title": "其他人會不會非常飢渴，喜歡猥褻的想法和赤裸的身體之類的東西，並經常自慰，但發現實際的性行爲有點令人反感？"
    }
  ]
}