{
  "author": "I_aim_to_sneeze",
  "original_created_utc": 1642871102,
  "title": "Why don’t vegans encourage non-vegans to have “vegan days” in their diet?",
  "created_utc": 1642931887,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I always see articles about how the biggest environmental impact an individual can make is going vegan. My wife has been a vegetarian for a long time and just went vegan this year, so I’m exploring a lot of new recipes to accommodate. I’m not vegan nor vegetarian myself, but I like all food, including a lot of vegan food. There are several days of the week where I end up eating vegan just out of happenstance. &lt;/p&gt;\n\n&lt;p&gt;This seems like it probably also has a good impact on the environment. Not as much as if I went completely vegan, but limiting my consumption of meat an animal products has to at least be a step in the right direction. &lt;/p&gt;\n\n&lt;p&gt;However, I rarely see vegan organizations that are willing to make any sort of compromise with their mission statement. It’s either all or nothing, and that seems to actually have a detrimental impact on their cause. If the entire world just stopped eating animal products on tuesdays and Thursdays, wouldn’t that have the same impact as 2/7ths of the world going vegan?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/sa6wi5/why_dont_vegans_encourage_nonvegans_to_have_vegan/",
  "subreddit": "TooAfraidToAsk",
  "id": "sa6wi5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I always see articles about how the biggest environmental impact an individual\ncan make is going vegan. My wife has been a vegetarian for a long time and just\nwent vegan this year, so I’m exploring a lot of new recipes to accommodate. I’m\nnot vegan nor vegetarian myself, but I like all food,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はいつも、個人が環境に与える影響が最も大きいという記事を目にします。\nヴィーガンになることです。私の妻は長い間ベジタリアンで、最近になって\n今年からビーガンになったので、それに対応するために新しいレシピをいろいろと模索しています。私は\n私自身はビーガンでもベジタリアンでもありませんが、どんな食べ物も好きです。",
      "title": "ヴィーガンはなぜ、非ヴィーガンに「ヴィーガンの日」を設けることを勧めないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我总是看到一些文章说，一个人对环境最大的影响是什么？\n我总是看到一些文章说，一个人对环境的最大影响就是吃素。我的妻子长期以来一直是素食主义者，今年刚开始吃素。\n素食主义者，所以我正在探索很多新的食谱来适应。我是\n我自己不是素食主义者，但我喜欢所有的食物，...",
      "title": "为什么素食主义者不鼓励非素食主义者在他们的饮食中设立 \"素食日\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我總是看到一些文章說，一個人對環境最大的影響是什麼？\n我總是看到一些文章說，一個人對環境的最大影響就是喫素。我的妻子長期以來一直是素食主義者，今年剛開始喫素。\n素食主義者，所以我正在探索很多新的食譜來適應。我是\n我自己不是素食主義者，但我喜歡所有的食物，...",
      "title": "爲什麼素食主義者不鼓勵非素食主義者在他們的飲食中設立 \"素食日\"？"
    }
  ]
}