{
  "author": "ThatBitchDesiree",
  "original_created_utc": 1632650805,
  "title": "Why are engineers so arrogant?",
  "created_utc": 1632667482,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Obviously, not all engineers are arrogant, but in my experience there is a higher concentration of arrogant folks in that field than others. </p>\n\n<p>I have heard many arguments in the past, but the most common is that they have had to work so much harder than others to get where they are, and therefore feel superior. Personally, I think that&#39;s crap. Have you seen what math majors do in their upper level math classes? Have you seen the stuff that science majors do? Chem majors take just as much math as engineers, physics majors take more. Bio majors may not take the math, but they apply a lot of the chem to pretty complicated systems. </p>\n\n<p>Even non stem majors can be very labor intensive. A friend of mine was a global affairs major and he was always writing 30 page papers several times per semester. </p>\n\n<p>I don&#39;t get it.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/pvr09i/why_are_engineers_so_arrogant/",
  "subreddit": "NoStupidQuestions",
  "id": "pvr09i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Obviously, not all engineers are arrogant, but in my experience there is a\nhigher concentration of arrogant folks in that field than others.\n\nI have heard many arguments in the past, but the most common is that they have\nhad to work so much harder than others to get where they are, and therefore…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もちろん、すべてのエンジニアが傲慢なわけではありませんが、私の経験では、傲慢な人は\n私の経験では、この分野には他の分野よりも傲慢な人たちが集中しています。\n\n過去に多くの議論を聞いてきましたが、最も一般的なのは、「自分は他の人よりもずっと努力してきた。\n他の人よりもずっと苦労してきたのだから...というものです。",
      "title": "エンジニアはなぜこんなに傲慢なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "显然，并不是所有的工程师都是傲慢的，但根据我的经验，在这个领域，傲慢的人比其他领域更集中。\n在这个领域，傲慢的人比其他领域更集中。\n\n我在过去听到过很多论点，但最常见的是他们\n他们必须比其他人更努力地工作，才能达到他们的位置，因此......",
      "title": "为什么工程师们如此傲慢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "顯然，並不是所有的工程師都是傲慢的，但根據我的經驗，在這個領域，傲慢的人比其他領域更集中。\n在這個領域，傲慢的人比其他領域更集中。\n\n我在過去聽到過很多論點，但最常見的是他們\n他們必須比其他人更努力地工作，才能達到他們的位置，因此......",
      "title": "爲什麼工程師們如此傲慢？"
    }
  ]
}