{
  "author": "Present_Turn7021",
  "the_new_excerpt": "I haven’t been in crypto for very long. Started working at a crypto mining farm\nin Jan 2018 and it changed my life.\n\nMy employers asked if I was cool getting paid in bitcoin. At the time, my answer\nwas “As long as I can sell it into Ringgit Malaysia (fiat)”. Got paid around\n$1k+ monthly - remembered…",
  "original_created_utc": 1614755590,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我进入加密领域的时间不长。开始在一个加密矿场工作\n在2018年1月，它改变了我的生活。\n\n我的雇主问我是否酷爱用比特币获得报酬。当时，我的回答是\n是 \"只要我能把它卖成马来西亚林吉特（菲亚特）\"。得到的报酬大约是\n每月1千多元--记...",
      "title": "想到现在一个比特币已经超过了很多人的承受能力。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我進入加密領域的時間不長。開始在一個加密礦場工作\n在2018年1月，它改變了我的生活。\n\n我的僱主問我是否酷愛用比特幣獲得報酬。當時，我的回答是\n是 \"只要我能把它賣成馬來西亞林吉特（菲亞特）\"。得到的報酬大約是\n每月1千多元--記...",
      "title": "想到現在一個比特幣已經超過了很多人的承受能力。"
    }
  ],
  "title": "To think that one bitcoin is more than many people can afford now.",
  "created_utc": 1614771613,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I haven’t been in crypto for very long. Started working at a crypto mining farm in Jan 2018 and it changed my life. </p>\n\n<p>My employers asked if I was cool getting paid in bitcoin. At the time, my answer was “As long as I can sell it into Ringgit Malaysia (fiat)”. Got paid around $1k+ monthly - remembered receiving about 0.2 bitcoin monthly. One day, I didnt have to sell all of it because I already have more than enough fiat. So i figured meh Ill just save it for later. That’s when it happened. Bitcoin went up 20% from $3k+ to $4.2k and so did my salary. Kept going up and i kept hodling.</p>\n\n<p>Employers turned out to be greedy dicks and changed their minds towards the end - “we are not paying you in precious BTC anymore”. But my love for crypto remains. </p>\n\n<p>I was let go shortly after without any compensation and notice after I helped them move their operation to the US where the electricity is a lot lower. Struggled to make ends meet for a little while but doing odd jobs and investing in bitcoin mining got me going. Managed to feed my wife and kid. </p>\n\n<p>I reinvested mining profits into more machines all around the world with hosting, cloud contracts, and the returns kept compounding. </p>\n\n<p>Ive never told anyone I have bitcoin except for my wife. I am happily retired at 30 in a country where $200 is a family’s monthly grocery. For most of the time, I just spend time with my kid and wife who works from home. And to think I owe this lifestyle all to those tiny tiny bitcoins I saved up 3 years ago. HODL friends. To the moon we go!</p>\n</div><!-- SC_ON -->",
  "score": 957,
  "permalink": "/r/Bitcoin/comments/lwnujp/to_think_that_one_bitcoin_is_more_than_many/",
  "subreddit": "Bitcoin",
  "id": "lwnujp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937733623
}