{
  "author": "UnhappyWallaby2582",
  "original_created_utc": 1648231011,
  "title": "How much cheese could I eat in medieval Europe?",
  "created_utc": 1648250833,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Okay so me and my boyfriend are having this reoccurring fight about how often a “normal” person could’ve ate cheese during the Middle Ages. \nTo give you more details, we are talking about any time between the 10th til  the 13th century in Europe (northern Germany to be exact), average age (for medieval times), average income at the time (clergy and nobility excluded), average family size, average fixed cost etc. \nJust like the most “normal” person. &lt;/p&gt;\n\n&lt;p&gt;How often could that person buy/eat cheese?  (Like 250g/8,8oz)&lt;/p&gt;\n\n&lt;p&gt;Thanks! \nChristina &lt;/p&gt;\n\n&lt;p&gt;PS: Please don’t hate me if I fucked up my past tenses I’m not a native speaker&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/tntt2a/how_much_cheese_could_i_eat_in_medieval_europe/",
  "subreddit": "AskHistorians",
  "id": "tntt2a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Okay so me and my boyfriend are having this reoccurring fight about how often a\n“normal” person could’ve ate cheese during the Middle Ages. To give you more\ndetails, we are talking about any time between the 10th til the 13th century in\nEurope (northern Germany to be exact), average age (for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼氏と何度も喧嘩をしてるんだ。\n「中世に普通の人がチーズを食べることは可能だった。もっと詳しく説明すると\n詳しくは、10世紀から13世紀にかけての、日本における\nヨーロッパ（正確にはドイツ北部）、平均年齢（...",
      "title": "中世ヨーロッパでどれだけチーズを食べられたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，我和我的男朋友有这种经常性的争吵，关于多长时间一次？\n一个 \"正常 \"人在中世纪可以吃奶酪。为了给你更多\n为了给你更多的细节，我们谈论的是10世纪到13世纪之间的任何时间。\n欧洲（确切地说，是德国北部），平均年龄（对于...",
      "title": "在中世纪的欧洲，我可以吃多少奶酪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，我和我的男朋友有這種經常性的爭吵，關於多長時間一次？\n一個 \"正常 \"人在中世紀可以喫奶酪。爲了給你更多\n爲了給你更多的細節，我們談論的是10世紀到13世紀之間的任何時間。\n歐洲（確切地說，是德國北部），平均年齡（對於...",
      "title": "在中世紀的歐洲，我可以喫多少奶酪？"
    }
  ]
}