{
  "author": "Aurtach",
  "the_new_excerpt": "Hey bud.\n\nTake some deep breaths, nice and slow. Put your hands on something solid... Your\ndesk or table or something like that.\n\nBe right here for a minute. Just focus on your breathing.\n\nI know things are a lot right now and this dip is scary, but also right now\nyou're ok. Walk away from the…",
  "original_created_utc": 1619144337,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "やあ、相棒。\n\nゆっくりと深呼吸をしてみてください。何か固いものに手を置いて... あなたの\n机やテーブルのようなものに手を置いて\n\n少しの間、ここにいてください。呼吸に集中してください。\n\n今は色々なことがあって、この水浸しの状態が怖いのは分かりますが、でも今は\nあなたは大丈夫です。歩いて離れてください...",
      "title": "この時期に必要なマインドフルネス"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，伙计。\n\n做一些深呼吸，漂亮而缓慢。把你的手放在坚实的东西上... 你的\n办公桌或桌子或类似的东西。\n\n在这里待上一分钟。专注于你的呼吸。\n\n我知道现在事情很多，这种浸泡是可怕的，但也是现在\n你很好。走向远方...",
      "title": "在这次浸泡中非常需要的心态"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，夥計。\n\n做一些深呼吸，漂亮而緩慢。把你的手放在堅實的東西上... 你的\n辦公桌或桌子或類似的東西。\n\n在這裏待上一分鐘。專注於你的呼吸。\n\n我知道現在事情很多，這種浸泡是可怕的，但也是現在\n你很好。走向遠方...",
      "title": "在這次浸泡中非常需要的心態"
    }
  ],
  "title": "Much Needed Mindfulness During This Dip",
  "created_utc": 1619152655,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey bud.</p>\n\n<p>Take some deep breaths, nice and slow. Put your hands on something solid... Your desk or table or something like that.</p>\n\n<p>Be right here for a minute. Just focus on your breathing.</p>\n\n<p>I know things are a lot right now and this dip is scary, but also right now you&#39;re ok. Walk away from the charts for a while, enjoy your friends/family/pets and come back after a while. This shit happens all the time in crypto and we are still solidly in the midst of a bullrun. Give the whales time to shake out weak hands in order to scoop up more on discount. If you can buy the dip, if you can&#39;t buy the dip just hold and you&#39;ll be ok if you just have patience.</p>\n\n<p>If you&#39;re panicking right now, maybe reconsider how much you have invested or what coins your invested in. This is a volitile space and your mental health is more important than some quick gains. Take care of yourself, stay hydrated, check your posture, and keep a big picture perspective.</p>\n</div><!-- SC_ON -->",
  "score": 7371,
  "permalink": "/r/CryptoCurrency/comments/mwl056/much_needed_mindfulness_during_this_dip/",
  "subreddit": "CryptoCurrency",
  "id": "mwl056",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776207029
}