{
  "author": "arumi_kai",
  "original_created_utc": 1657047083,
  "title": "Are we just ignoring the decline of Reddit?",
  "created_utc": 1657056705,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Do most people just not care about top posts probably being fake ragebait (“look what my boss totally texted me”, “look at this totally legit letter from my racist neighbor”, etc)? Do we not care that content gets recycled and reposted by karma bots, a weird endless Groundhog Day of the same memes &amp;amp; gifs? Or that Buzzfeed/Newsweek seeds content from subs like AITA, antiwork, TIFU (which are often likely fake/embellished). Is this just… how things are now? And everyone’s cool with it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 120,
  "permalink": "/r/TooAfraidToAsk/comments/vs54wr/are_we_just_ignoring_the_decline_of_reddit/",
  "subreddit": "TooAfraidToAsk",
  "id": "vs54wr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Do most people just not care about top posts probably being fake ragebait (“look\nwhat my boss totally texted me”, “look at this totally legit letter from my\nracist neighbor”, etc)? Do we not care that content gets recycled and reposted\nby karma bots, a weird endless Groundhog Day of the same memes…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人は、トップ記事が偽物の暴言であることを気にしないだけなのか（「見ろよ\n上司が私に送ってきたもの\"、\"私の人種差別的な隣人からの合法的な手紙を見\n差別主義者の隣人から来た、まったく正当な手紙だ」など) を気にしないのでしょうか？コンテンツがリサイクルされ、カルマボットに再投稿されることを気にしないのでしょうか。\n同じミームが延々と続くグラウンドホッグデーのように、カルマ・ボットによってコンテンツが再利用されることを気にしないのだろうか...。",
      "title": "Redditの衰退を無視しているだけなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大多数人只是不关心顶级的帖子可能是假的流言蜚语（\"看\n看我的老板给我发了什么短信\"，\"看这封完全合法的信，来自我的\n种族主义的邻居\"，等等）？我们不关心内容被回收和转发的问题吗？\n我们不在乎这些内容被卡尔玛机器人回收和转发，这是一个奇怪的、无休止的相同备忘录的土拨鼠日......",
      "title": "我们只是忽略了Reddit的衰落吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大多數人只是不關心頂級的帖子可能是假的流言蜚語（\"看\n看我的老闆給我發了什麼短信\"，\"看這封完全合法的信，來自我的\n種族主義的鄰居\"，等等）？我們不關心內容被回收和轉發的問題嗎？\n我們不在乎這些內容被卡爾瑪機器人回收和轉發，這是一個奇怪的、無休止的相同備忘錄的土撥鼠日......",
      "title": "我們只是忽略了Reddit的衰落嗎？"
    }
  ]
}