{
  "author": "Tiltnes",
  "original_created_utc": 1630776608,
  "title": "“Ethereum is Useless and will Die because of Insanely High Gas Fees!” Is this you? Here is a Guide: How to Move your Ethereum/ERC-20 to Layer 2/Sidechain and do Transactions costing LESS <$0,01 taking 1-2 seconds!",
  "created_utc": 1630791499,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Understandably most people new to this space and Ethereum, are <strong>raging</strong> and fearful with the current gas fees (transaction fees), having sky-rocketed lately. Yes, we are frequently seeing 100 – 300 gwei resulting in <strong>50-150 dollar prices on Ethereum&#39;s Mainnet (Layer 1) at rush hour!</strong></p>\n\n<p><strong>This post will help you out!</strong></p>\n\n<ol>\n<li>Mainnet: <strong>Why are the gas fees high?</strong></li>\n<li>Mainnet: <strong>How can I pay the LEAST POSSIBLE on Ethereum Mainnet?</strong></li>\n<li>How solve this problem, by <strong>moving from Ethereum’s Mainnet</strong> to Layer 2’s (L2), Side Chains or Helper Chains that most “veterans” have been using for DeFI and transactions for months. Examples are: <strong>Polygon, Fantom, xDAI, Optimism and soon Arbitrum</strong>. (Polygon and Fantom not being &quot;true</li>\n<li> The <strong>Layer 2 Rollups</strong> will <strong>Scale Ethereum</strong> to new heights </li>\n</ol>\n\n<p><strong>REPOST FROM YESTERDAY:</strong> The previous <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/phcroe/ethereum_is_useless_and_will_die_because_of/\">Original Post</a> from yesterday and the repost was automatically removed by ModBot. Many msg me to repost, so here it is. Hopefully it stays up!</p>\n\n<h1>1) Why are the gas fees high?</h1>\n\n<ul>\n<li>Right now, Ethereum can handle about <strong>30 transactions per second (TPS</strong>) at best; Visa, by contrast, does about 1,700 transactions per second and claims it can handle up to 24,000.</li>\n<li>Currently, due to the massive usage (<strong>success/adoption</strong>) of Ethereum being used for DeFI, NTFs mints (crazy shit), transactions by retails, institutions and exchanges the gas fees are rocketing in periods.</li>\n<li>This is bad for us “small fish”, leading to fees higher than some of us have in our wallet! However, this proves that Ethereum still is working securely even under pressure without mistakes. For sure, Ethereum needs to continue to prove that blockchain and smart-contracts are secure and decentralized, in order for adoption, acknowledgment and success of the rest of the crypto space with so <strong>fantastic projects like ADA, ALGO, AVAX, Elrond, Tezos and ONE</strong> etc. can thrive.</li>\n<li>While we wait for the “Merge” of ETH 2.0’s Beacon Chain (live since December) with current Mainnet, that will lead to Proof of Stake and giving us higher Security, Sustainability and Scalability options, we have to look at other tricks and solutions. Besides, I suspect the completion/integration of Sharding to take longer than expected.</li>\n</ul>\n\n<h1>2) How can I pay the least possible gas on Ethereum Mainnet?</h1>\n\n<ul>\n<li>Use a <a href=\"https://etherscan.io/gastracker\">Gas Tracker</a> to see the current estimated gas price for a <strong>fast, average or slow transaction,</strong> BEFORE transacting. If you are using e.g. <a href=\"https://metamask.io/\">Metamask</a>, you can <strong>Edit Gas Price</strong> if it is set too high or if you believe it will drop. <strong>Careful:</strong> <em>If you set it too low</em>, there is a risk it wont go through, and you got to pay MORE to speed it up.</li>\n<li>In my experience the <strong>gas is LOWEST in the mornings at 6-10 UTC (US night time)</strong>, or especially in <strong>Weekends.</strong></li>\n<li>If your transaction is not urgent, <strong>WAIT</strong> for the time when it drops back to <strong>GOAL OF 15-35 gwei</strong>! Not many weeks ago it was consistently 7-15 gwei in low traffic hours.</li>\n</ul>\n\n<h1>3) Make the move from Ethereum Mainnet (Layer 1) to a Layer 2 or Sidechain:</h1>\n\n<p><strong>USEFUL INFO:</strong></p>\n\n<ul>\n<li><a href=\"https://ethereum.org/en/developers/docs/scaling/layer-2-rollups/\">Layer 2/Rollups</a><strong>:</strong> Is a collective term for solutions designed to help scale Ethereum by handling transactions off the Ethereum Mainnet (Layer 1), while taking advantage of the robust security of Mainnet.</li>\n<li><a href=\"https://ethereum.org/en/developers/docs/scaling/sidechains/\">Sidechains:</a> A sidechain is a separate blockchain which runs in parallel to Ethereum Mainnet and operates independently.</li>\n<li><strong>EDIT:</strong> Doing this primarily for those who wanna use DeFi/dApps! No reason to move if you have just wanna HODL your Eth or keep them in a &quot;earn&quot; wallet like Celcius, Blockfi, Nexo or crypto . com.</li>\n<li>Moving to the currently most used solution, <strong>Polygon (MATIC),</strong> will for many be like <strong>being born anew</strong> (seriously, <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/mxrw09/i_just_tried_maticpolygon_l2_for_ethereum_why_did/\">here is my reaction/post</a> 4 months ago). Transactions <strong>cost average $0.0007</strong> and <strong>takes 1-3 seconds</strong> (unless rush hour). Yes, this is already a lot cheaper than almost all L1 competitors.</li>\n<li>Polygon currently already has most big DeFi dApps like OpenSea (NTFs) Sushiswap, 1inch, AAVE, Curve, Beefy. And many more are integrating.</li>\n<li>Polygons biggest DEX is <a href=\"https://quickswap.exchange/#/swap\">Quickswap</a>, it&#39;s based on Uniswap V2. It has 1 Billion TVL and 24 h volume +/- 100 million. In other words: Great liquidity!</li>\n<li><a href=\"https://www.fxstreet.com/cryptocurrencies/news/coinbase-to-use-polygons-ethereum-scaling-solution-to-reduce-prices-settlement-times-202109010427\">Coinbase and other Exchanges are integrating Polygon</a>, so, you soon you can deposit DIRECTLY into e.g. Polygon, and Withdraw directly without having to touch L1&#39;s high fee baselayer!</li>\n<li>Another great choice is <strong>Fantom (FTM),</strong> while being it’s own blockchain is compatible with EVM and can be regarded as a helper chain.</li>\n</ul>\n\n<p><strong>HOW TO:</strong></p>\n\n<ul>\n<li>For simplicity, we will focus on Polygon. In order to move to or from Polygon, you need to use this <a href=\"https://wallet.matic.network/bridge/\">Bridge</a> (there are loads of other bridges too, e.g. between BSC or Fantom).</li>\n<li>I personally connect with <a href=\"https://metamask.io/\">Metamask</a> (signing all transactions with my hardware wallet <a href=\"https://www.ledger.com/\">Ledger</a>/<a href=\"https://trezor.io/\">Trezor</a>for security!) or Coinbase wallet to interact with Bridges and dApps. You can easily add different networks (<a href=\"https://chainlist.org/\">handy link to do it automatic</a>) supporting the Ethereum Virtual Machine (EVM) and seamlessly swap between them in your Metamask, after you’ve added them.</li>\n<li>If you use bridge when <strong>we&#39;re at 15-25 gwei,</strong> I recon moving e.g. Eth costs like <strong>$3-5 for permission</strong>, then <strong>$7-10 for Transfer.</strong> With current gas prices it&#39;s surely &gt;<strong>$</strong>100!</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/iijnvxf6uil71.png?width=1917&amp;format=png&amp;auto=webp&amp;s=4b8781401125348fd9808baee844b21b563c6f3f\">Pretty easy to use.</a></p>\n\n<ol>\n<li>Chose what and where you want to transfer, and... click transfer.</li>\n<li>From Ethereum L1 to Polygon, you <strong>first need to pay a 1 time &quot;permission to use&quot; transaction</strong> for <strong>each new coin</strong> (it gives permission to the bridge smart contract to use your selected token e.g. Eth, AAVE, LINK). This is cheaper than the actual transfer.</li>\n<li>When the first transaction is done, you will get prompted to do the <strong>actual Transfer</strong> (higher price). Again, wait until gas fees are low to start the Bride-process, but when it&#39;s done you&#39;re FREE.</li>\n<li>Once your crypto arrives at Polygon, <strong>you automatically get some free MATIC that lasts many transactions</strong> (Cant remember, it&#39;s 0.01?). You can also use a <a href=\"https://matic.supply/\">faucet</a> if you run out of gas. I typically just buy 1 MATIC for all my accounts, which will hold for probably 1000 transactions.</li>\n</ol>\n\n<h1>4) The Layer 2 Rollups will Scale Ethereum to new heights</h1>\n\n<ul>\n<li>Ethereum 2.0 will in the future have it’s <strong>sharding, however I believe the the current working and coming L2/Rollups</strong> will easily scale to &gt;100,000 TPS. Heck even 1 of the current Rollups alone has far better TPS than many of the current L1-competitors!</li>\n<li>There are 3 types of rollups. <strong>ZK-rollups</strong> (Zero Knowledge rollups), <strong>Optimistic rollups</strong> and <strong>Hybrids.</strong></li>\n<li><strong>ZK-rollups</strong> bundle or &quot;roll up&quot; hundreds of transfers off-chain and generates a cryptographic proof, known as a SNARK (succinct non-interactive argument of knowledge). This is known as a validity proof and is posted on layer 1. Examples of Rollups being built are: <strong>Loopring, Starkware, Matter Labs zkSync, Aztec 2.0, Hermez network</strong> (merged with Polygon), <strong>zkTube</strong></li>\n<li><strong>Optimistic rollups</strong> sit in parallel to the main Ethereum chain on layer 2. They can offer improvements in scalability because they don&#39;t do any computation by default. Instead, after a transaction they propose the new state to Mainnet, or &quot;notarise&quot; the transaction. With Optimistic rollups, transactions are written to the main Ethereum chain as calldata, optimising them further by reducing the gas cost. Examples are: <strong>Optimism</strong> (Live!), <strong>Arbitrum</strong> (Live!)<strong>, Fuel Network, Cartesi and OMGX.</strong></li>\n<li>In some years <strong>Ethereum will be a beast,</strong> a platform hosting the web3 as a base later, having multiple L2 rollups, sidechains, helper-chains working on top of it, in addition to <strong>Sharding</strong>, making it able to host the necessary thousands or millions of TPS needed for mass adoption.</li>\n</ul>\n\n<p><strong>If you enjoyed this post, feel free to check out 2 of my recent other educational posts:</strong></p>\n\n<ul>\n<li>Guide: <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/pf6qq7/how_to_start_compounding_crypto_by_staking\">How to start Compounding Crypto by Staking, Lending or Liquidity Providing</a></li>\n<li>Guide: <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/pdgsn5/lets_talk_about_exit_strategies_and_profit_taking\">How to Make Exit Strategies and Taking Profit if you dare</a></li>\n</ul>\n\n<p><strong>EDIT 1:</strong> Other than Coinbase integrating Polygon for direct deposit/withdrawal, <strong>Binance</strong> provides direct withdrawal of MATIC token to Polygon Network, and <strong>OKEX</strong> already supports Arbitrum. More exhancges are integrating the Rollups as we speak. Thanks to: Warlikeofthechaos and anor_wondo!</p>\n</div><!-- SC_ON -->",
  "score": 310,
  "permalink": "/r/CryptoCurrency/comments/phvtva/ethereum_is_useless_and_will_die_because_of/",
  "subreddit": "CryptoCurrency",
  "id": "phvtva",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Understandably most people new to this space and Ethereum, are raging and\nfearful with the current gas fees (transaction fees), having sky-rocketed\nlately. Yes, we are frequently seeing 100 – 300 gwei resulting in 50-150 dollar\nprices on Ethereum's Mainnet (Layer 1) at rush hour!\n\nThis post will…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "当然のことながら、この分野やイーサリアムに初めて触れる人の多くは、現在のガス料金（取引手数料）が急騰していることに怒りと恐怖を感じています。\n最近、ガス料金（取引手数料）が急上昇していることに恐れを抱いています。\n最近では そう、イーサリアムのメインネット（レイヤー）では、100～300グワイが50～150ドルの価格になることが頻繁にあります。\nイーサリアムのメインネット（レイヤー1）では、ラッシュアワーに100～300グワイが50～150ドルになることが頻繁にあります。\n\nこの記事では...",
      "title": "\"イーサリアムは役に立たず、非常に高いガス料金のために死ぬだろう！\" これはあなたですか？ここではガイドを紹介します。あなたのEthereum/ERC-20をLayer 2/Sidechainに移行し、1-2秒でコストが<$0,01以下の取引を行う方法をご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "可以理解的是，大多数刚进入这个领域和以太坊的人都很愤怒和恐惧。\n恐惧，因为目前的汽油费（交易费），最近已经暴涨了\n最近。是的，我们经常看到100-300克威导致50-150美元的\n以太坊主网（第1层）在高峰期的价格！这篇文章将为您介绍。\n\n这篇文章将...",
      "title": "\"以太坊毫无用处，将因疯狂的高额汽油费而死亡！\" 这是你吗？这里有一个指南。如何将你的以太坊/ERC-20转移到第二层/侧链，并在1-2秒内完成成本低于0.01美元的交易!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "可以理解的是，大多數剛進入這個領域和以太坊的人都很憤怒和恐懼。\n恐懼，因爲目前的汽油費（交易費），最近已經暴漲了\n最近。是的，我們經常看到100-300克威導致50-150美元的\n以太坊主網（第1層）在高峯期的價格！這篇文章將爲您介紹。\n\n這篇文章將...",
      "title": "\"以太坊毫無用處，將因瘋狂的高額汽油費而死亡！\" 這是你嗎？這裏有一個指南。如何將你的以太坊/ERC-20轉移到第二層/側鏈，並在1-2秒內完成成本低於0.01美元的交易!"
    }
  ]
}