{
  "author": "ObsoleteGentile",
  "the_new_excerpt": "EDIT: The two bullet points are your TL;DR, you fucking corn cobs. I didn’t\nwrite this for the crowd willing to refer to themselves as apes. No one has to\nread it. Also, it’s “speculation” from the perspective that I can’t prove what\nI’m saying. But it’s also based on the reality that has existed…",
  "original_created_utc": 1619158532,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "EDIT: 2つの箇条書きは、あなたのTL;DR、あなたはクソトウモロコシのコブです。私は\n自分を猿だと言いたい人たちのために書いたわけではありません。誰も読まなくていい\n読む必要はありません。また、私が言っていることを証明できないという観点からは「憶測」です。\n推測」です。しかし、これまでに存在した現実にも基づいています...。",
      "title": "暗号について知っておくべき2つの基本事項"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：这两个要点是你的TL;DR，你他妈的玉米棒子。我并不是\n我不是为那些愿意把自己称为猩猩的人写的。没有人需要\n读它。另外，从我不能证明我所说的这个角度来看，这也是 \"猜测\"。\n我所说的。但它也是基于已经存在的现实......",
      "title": "你应该知道的关于加密货币的两件基本事情"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：這兩個要點是你的TL;DR，你他媽的玉米棒子。我並不是\n我不是爲那些願意把自己稱爲猩猩的人寫的。沒有人需要\n讀它。另外，從我不能證明我所說的這個角度來看，這也是 \"猜測\"。\n我所說的。但它也是基於已經存在的現實......",
      "title": "你應該知道的關於加密貨幣的兩件基本事情"
    }
  ],
  "title": "Two fundamental things you should know about crypto",
  "created_utc": 1619242414,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>EDIT: The two bullet points are your TL;DR, you fucking corn cobs</strong>. I didn’t write this for the crowd willing to refer to themselves as apes. No one has to read it. Also, it’s “speculation” from the perspective that I can’t prove what I’m saying. But it’s also based on the reality that has existed forever, and literally never varied. It’s basically saying that tides will keep ebbing and flowing and the sun will keep going up and down. If you want to go on thinking you’ve found something genuinely new and different, so much so that it has dismantled fundamental truths of human history, that’s nice for you, your right, and your business. If you feel like thinking, discussing, learning, you might enjoy the read.</p>\n\n<ol>\n<li> Crypto markets are controlled by whales and institutions.</li>\n<li> The future will not be decentralized.</li>\n</ol>\n\n<p>If you fail to acknowledge these truths, then you are making investment decisions, whether trading or hodling, without seeing the big picture. You are what the smart money players call a “low information investor.”</p>\n\n<p>Before you read further, please know that this is not an overall fatalistic post, so stick with it. There is hope and positivity for the future, albeit tempered with acceptance of objective reality.</p>\n\n<p><strong>Control of the markets</strong></p>\n\n<p>We like to think of cryptocurrency as a new frontier, and tell ourselves “we’re still early, guys!” We envision ourselves as adventurers in a brave new world, making smart decisions on the basis of social justice and global financial equality. In truth, most of us are lining up to take arrows to our knees if we don’t face the evidence.</p>\n\n<p>This year, we’ve seen an influx of very public institutional investment in crypto, one gigantic buy story after another. We are smug about this, believing that <em>finally</em> the big money types are waking up to what WE have known for years. Don’t pat yourself on the back just yet, because it’s straight-up bullshit.</p>\n\n<p>Be honest with yourself: When’s the last time you really knew something ahead of the insiders, that allowed you to get a head start and reap huge rewards? For most of us, that’s never. We always end up feeling like if only we’d known about something a bit earlier, this or that opportunity could have been huge for us. That’s not random, it’s not accidental, and it’s part of the way the world works. Those with power, privilege, and money have an easy time acquiring more of it, while those without are left behind 99% of the time. That hasn’t changed.</p>\n\n<p>Barry Silbert, Michael Saylor, and many others like them know more about crypto than you do. The heavyweights are not the doofus boomers some of you think they are, and they’ve been privately and/or secretly invested in cryptocurrency since before you bought your first dogecoin. That’s because they are insiders, and insiders have seen this coming for a long time. They’re ready for it. It’s naive to think the recent glut of news stories about institutional investors truly represents their first foray into these markets. It’s just the first time they’ve been willing to let the world know, and they’ve only decided to go public because of the huge benefits they’ll reap.</p>\n\n<p>None of the biggest market moves in the world are random. They never have been. Maybe you imagine Michael Saylor browsing the internet, seeing more news about crypto, and finally one day it clicks and he thinks “ya know, maybe it’s time I dip a toe in the water.” That’s preposterous. It’s never been this way at this level of the game, and it isn’t now.</p>\n\n<p>Saylor’s “A-ha!” moment (and I’m only using him as a hypothetical example) was probably five or more years ago, and he probably casually dropped in a hundred thousand or so on a test run that quickly ballooned into multiple billion dollar wallets that we read news about, but which are only known by public addresses referenced by CryptoQuant or similar blockchain detectives. All these stories you hear about “a bitcoin wallet that hasn’t been active since 2015 just moved two billion dollars...” You really think that’s some goof-ball nerd miner who had a lucky early entry, and didn’t sell when he could have cashed out $100K or so and moved out of his parents’ basement? Not likely.</p>\n\n<p>If you do a Google News search for “crypto institutional buying,” you will see the stories are all recent, and ALL, every single one, something along the lines of “all evidence shows that institutional investors are buying the dips.” AS IF these fat cats are drinking lattes over crypto news sites on their laptops, wondering when it might be time to buy more. Haha, no.</p>\n\n<p>You know what none of those stories you dig up on Google News asks? They don’t ask whether said “institutional” investors (as well as independent whales with aligned interests) might be CAUSING the dips, so they can buy lower. That’s the right question to ask, and the compelling line of inquiry for real journalism. But real journalism barely exists anymore, and even where it does, it’s unlikely to find its way to the front page of Google. </p>\n\n<p>We all know that actual controversial opinions are something mainstream media steers well clear of. We know that news organizations dependent on advertising revenue and access to official sources will see both of those things dry up quickly should they decide to stick their noses past the boundaries of uncomfortable truths.</p>\n\n<p>We know that since the dawn of time, the wealthy and powerful have been more than willing to manipulate markets for the sole purpose of becoming more powerful, and more wealthy. Clearly, they are often willing to do illegal things to affect such manipulation, because they are unlikely to get caught, and if they DO get caught, even less likely to suffer real punishment.</p>\n\n<p>So take the natural greed that has always dominated the financial world, and the willingness to step outside the law, and add to it something VERY fucking special: the crypto market. It’s new, it’s exciting, it’s inevitable, it has a potential for boundless growth, and on top of all of that, its novelty means that it’s largely unregulated, so they might not even have to break any explicit laws. For a large portion of wealthy people who understand market dynamics, this is an impossible temptation to resist.</p>\n\n<p>We also know, if we do some trading and watch prices AND volumes, how easy it would be to manipulate price action if we happen to be sitting on whole number percentages of total float volume, whether it be crypto or equities.</p>\n\n<p>We generally think of crypto as a pursuit where “FINALLY, the little guy can play on the same field as the fat cats.” Don’t kid yourselves. The fix is in, and has been for a long time. I suspect most of us imagine, without thinking about it in too much detail, that our favorite coins are owned mostly by millions of individuals like us, a hundred, or a thousand, or ten thousand dollars at a time. Democratic as fuck, right? Not so fast, Holmes.</p>\n\n<p>There was a recent news post on here that some people found disturbing. I might get the numbers wrong, not gonna look it up, because it doesn’t change my point...I think the coin was LINK, and the headline was that 84% of all LINK was owned by 1% of the wallets. So people seemed to think this was scandalous. In truth, this is the case with most cryptocurrencies, to a greater or lesser extent. The biggest chunks (the <em>controlling</em> chunks) of almost everything humans have ever done have always been owned by the few, not the many.</p>\n\n<p>So, these whales and institutions own the media, they own market-controlling interest in every damn crypto that matters, and their primary motivation is often nothing more than piling up bigger and bigger piles of money.</p>\n\n<p>The good news about the whales finally going public (to some extent), is that while they DO generally have a lot of control over the market, crypto really IS a game that small investors can join. We don’t own it, we can’t make the power moves, but entry to the market is legitimately more distributed than it’s ever been before. So we can educate ourselves, play within our comparatively modest means, and might actually make some decent money at it. Even more good news, tracking what the big boys are buying can usually be a low-effort recipe for success. If GBTC is buying it, if Microstrategies is opening large positions, it’s probably also a safe bet for you and me.</p>\n\n<p><strong>The future will not be decentralized</strong></p>\n\n<p>Not the immediate future, anyway. Sorry, but if you want to enter the investment landscape with fully open eyes, you’re just going to have to accept this. </p>\n\n<p>Step one in your acceptance should be to stop criticizing ANY coin as “centralized garbage.” This does nothing more than reveal how oversimplified your conception of decentralization is. There are dozens of very centralized coins that are going to eat your “truly decentralized” project for lunch and shit it out into your open astonished mouths. Sorry.</p>\n\n<p>Step two will be to accept and deeply understand that your favorite project is indeed NOT “truly centralized,” because literally NO existing crypto project is. Did you and your fellow bagholders get a vote in the last decision made about impending changes to the project? No?? Centralized. Are many of the nodes in your project hosted on Amazon Web Services? Thought so. Centralized. Is mining hashrate (or PoS equivalent) spread over a fully diffused cloud, with no hotspots? Hahaha...no, it isn’t. </p>\n\n<p>Your coin is centralized garbage, son. So calling someone else’s coin that is quite literally meaningless as a comparison. </p>\n\n<p>True decentralization of financial concerns will never be a thing. We may get close, after a few decades, but never all the way. And it will be a slow, ponderous, tooth-pulling journey.</p>\n\n<p><strong>The good news</strong></p>\n\n<p>There is increasing widespread awareness of the importance of broad participation in the global economy. I’ve been reading deeply the consulting material publicly available for multiple impending CBDCs, as well as watching recent past seminars from the IMF, and I can tell you this: it’s no joke. The biggest players on the stage see that a critical mass is being reached where the ratio of the haves and have-nots will become untenable...so there is much serious discussion of inclusion of the unbanked into the economy, with a lot of focus on cross-border payments that don’t exploit the people making and receiving them. Most of the people at the top of the heap may not give two shits about those at the bottom...but they genuinely want to be able to enjoy their yachts and their fancy cars without fear of being ripped out of them by angry mobs and beheaded.</p>\n\n<p>So this is happening. All of the great things that crypto claims it can do, it really CAN do, and in some measure, <em>will</em> do. </p>\n\n<p>But historically speaking, it should be obvious that the rich and powerful aren’t just going to roll over for it. They’re going to get their piece, and you can count on that. The brilliance of so many crypto projects is that their piece is irrevocably tied to some real and tangible form of life quality improvement for large swaths of unbanked and otherwise oppressed humans.</p>\n\n<p>But if you can see how wonderful and utopian a crypto world can potentially be, that still doesn’t mean everyone else can, and it doesn’t mean it’s going to happen like in Charles Hoskinson’s wet dream (this isn’t a slam on Cardano, I like it well enough). The wealthy investors by and large can see the potential, and most of them don’t care one way or the other. Improving quality of life for the poor, or in ravaged economies, is a good thing to most of our minds. For them, it might just be a side effect of their profit scheme. I’ll take it. </p>\n\n<p>But total decentralization in your lifetime is a myth. Crypto is not going to end power abuse, market manipulation, and greed, no matter how much you want it to. Wise investment means awareness that sometimes, centralization is going to be a prerequisite for broad, efficient implementation, and that being a purist is equivalent to yearning for a fantasy you will never realize. And that will cause you pain and frustration the whole time you hang onto it.</p>\n\n<p>Open your mind. Accept that sometimes unwillingness to compromise is equivalent to death of a good idea. Take the bad with the good, particularly when the good might far outweigh the bad. You now have the chance to participate in a complete remaking of the world as we know it. If it doesn’t conform precisely to your vision, it can still be a massive improvement, AND you can make money along the way.</p>\n\n<p><strong>Bonus good news</strong></p>\n\n<p>Based on the first part of this post, it should be clear to you by now that the crypto market is safe from a major tanking. I can’t say how low it will go, or when it will come back, but there’s a pretty bulky interest from a lot of big betters. There will be no “crypto winter,” and you can be confident of that much. Don’t liquidate in panic, because you will regret it.</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/CryptoCurrency/comments/mwowpd/two_fundamental_things_you_should_know_about/",
  "subreddit": "CryptoCurrency",
  "id": "mwowpd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776207035
}