{
  "author": "jetmax25",
  "the_new_excerpt": "Before sending a large amount of money send a micro amount and verify the\nprocess worked. Most wallets will save addresses, no after that transaction you\ncan feel safe in avoiding human error. Yes there is a fee to transfer funds but\nconsider it like insurance. If you are going to transfer 10k in…",
  "original_created_utc": 1620327406,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "大金を送る前に少額を送り、そのプロセスがうまくいったかどうかを確認する。\nプロセスが機能したことを確認します。ほとんどのウォレットにはアドレスが保存されていますので、その取引の後には\nヒューマンエラーを避けることができて安心です。確かに送金には手数料がかかりますが\nしかし、それは保険のようなものだと思ってください。もしあなたが1万円を送金しようとしているならば...。",
      "title": "プロからのアドバイス：ウォレットのアドレスに大金を送る前に、まずテスト用の小額のお金を送ってみましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在发送大笔资金之前，先发送一笔小额资金并验证\n流程是否有效。大多数钱包会保存地址，在这笔交易之后，你可以放心地避免人为错误。\n可以放心地避免人为错误。是的，转移资金是有费用的，但\n考虑它就像保险。如果你要转移1万块钱，在...",
      "title": "专业提示：在向钱包地址发送大额款项之前，先发送一个测试的小额款项。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在發送大筆資金之前，先發送一筆小額資金並驗證\n流程是否有效。大多數錢包會保存地址，在這筆交易之後，你可以放心地避免人爲錯誤。\n可以放心地避免人爲錯誤。是的，轉移資金是有費用的，但\n考慮它就像保險。如果你要轉移1萬塊錢，在...",
      "title": "專業提示：在向錢包地址發送大額款項之前，先發送一個測試的小額款項。"
    }
  ],
  "title": "Pro Tip: Before Sending A Large Sum To A Wallet Address, Send A Test Micro Sum First",
  "created_utc": 1620365486,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Before sending a large amount of money send a micro amount and verify the process worked. Most wallets will save addresses, no after that transaction you can feel safe in avoiding human error. Yes there is a fee to transfer funds but consider it like insurance. If you are going to transfer 10k in Ethereum it might be worth an extra $30 to verify you don&#39;t lose it.</p>\n\n<p>&#x200B;</p>\n\n<p>I&#39;ve seen a few posts and comments of people panicking about messing up fund transfers. I don&#39;t have a solution to this and I feel for these people. Also do not fault them, it&#39;s easy to not be careful and make a mistake.</p>\n</div><!-- SC_ON -->",
  "score": 196,
  "permalink": "/r/CryptoCurrency/comments/n6eoti/pro_tip_before_sending_a_large_sum_to_a_wallet/",
  "subreddit": "CryptoCurrency",
  "id": "n6eoti",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985988839
}