{
  "author": "iamvsus",
  "original_created_utc": 1624802774,
  "title": "Any drawbacks if I liquidate my entire stock portfolio and fully transition to Bitcoin?",
  "created_utc": 1624833510,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi Everyone,</p>\n\n<p>Hoping to get your thoughts on something I&#39;ve been contemplating for some time now. </p>\n\n<p>I&#39;ve been DCAing into stocks and Bitcoin for a few years now but recently have been considering liquidating all my stocks and completely transitioning into Bitcoin. I would no longer invest in stocks and continue investing 5% of my income into Bitcoin, possibly increasing it to 15% or 20% of my income.</p>\n\n<p>Good or bad idea?</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/Bitcoin/comments/o8xqdy/any_drawbacks_if_i_liquidate_my_entire_stock/",
  "subreddit": "Bitcoin",
  "id": "o8xqdy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi Everyone,\n\nHoping to get your thoughts on something I've been contemplating for some time\nnow.\n\nI've been DCAing into stocks and Bitcoin for a few years now but recently have\nbeen considering liquidating all my stocks and completely transitioning into\nBitcoin. I would no longer invest in stocks…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n私が以前から考えていたことについて、皆さんのご意見を伺いたいと思います。\nしています。\n\n私は数年前から株式やビットコインにDCAを導入してきましたが、最近になって\n株式をすべて清算し、完全にビットコインに移行することを検討しています。\nビットコインに移行しようと考えています。私はもはや株式には投資しません。...",
      "title": "株式ポートフォリオをすべて清算して、ビットコインに完全移行した場合、何か問題はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n希望得到你们对我已经考虑了一段时间的事情的想法\n现在。\n\n我从事DCA投资股票和比特币已经有几年了，但是最近\n一直在考虑清算我所有的股票，完全过渡到\n比特币。我将不再投资于股票...",
      "title": "如果我清空我的整个股票投资组合并完全过渡到比特币，有什么缺点吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n希望得到你們對我已經考慮了一段時間的事情的想法\n現在。\n\n我從事DCA投資股票和比特幣已經有幾年了，但是最近\n一直在考慮清算我所有的股票，完全過渡到\n比特幣。我將不再投資於股票...",
      "title": "如果我清空我的整個股票投資組合並完全過渡到比特幣，有什麼缺點嗎？"
    }
  ]
}