{
  "author": "investstayhumble",
  "the_new_excerpt": "A new year gives us a new opportunity to enter the markets after tax loss\nharvesting comes to an end. It may also give us an opportunity to reflect on our\ninvesting journeys and consider a change in approach. So... for those interested\nin making the shift to investing, what does it mean to be a long…",
  "original_created_utc": 1609765015,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "新的一年给了我们税后进入市场的新机会。\n收割快要结束了。这也可能给我们一个机会来反思我们的\n投资旅行，并考虑改变方法。所以..。对于那些感兴趣的人\n在向投资转变的过程中，做多…意味着什么",
      "title": "那么，现在是新的一年，你想成为一个长期投资者"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "新的一年給了我們稅後進入市場的新機會。\n收割快要結束了。這也可能給我們一個機會來反思我們的\n投資旅行，並考慮改變方法。所以..。對於那些感興趣的人\n在向投資轉變的過程中，做多…意味着什麼",
      "title": "那麼，現在是新的一年，你想成爲一個長期投資者"
    }
  ],
  "title": "So, it's the new year and you want to become a long-term investor",
  "created_utc": 1609775546,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A new year gives us a new opportunity to enter the markets after tax loss harvesting comes to an end.  It may also give us an opportunity to reflect on our investing journeys and consider a change in approach.  So... for those interested in making the shift to investing, what does it mean to be a long-term investor?  To me it&#39;s about being prepared enough so that I don&#39;t have to worry about the day-to-day.</p>\n\n<p>To think of an analogy... It&#39;s like the student who studies and does his/her homework the night before and has nothing to worry about the next day.  Sometimes, you did all the work for nothing, especially when the teacher doesn&#39;t check your work (think of this as the red day after you making an investment decision).  Sometimes you are rewarded immediately.  However, at the end of the day, the student who does his/her homework every night will have less to worry about when it comes to the final exam.  Similarly, when it comes to long-term investing, by doing your research and coming up with a plan, you don&#39;t have to worry or stress out as much about your ultimate success.</p>\n\n<p>Note, that, at the end of the day, long-term investing is just one of many options to get involved in the market.  You can be just as successful, if not more, by day trading or swing trading, etc.  Just know that the path you choose requires a different mindset/approach to the market.  So how does it work?  I wanted to share with you some big themes to keep in mind as you being your long-term investing journey.</p>\n\n<ol>\n<li><p><strong>Find your WHY.</strong> First and foremost, it&#39;s important to figure out who you are and why you are investing.  What is your risk tolerance?  Do you consider yourself to be more aggressive?  How much time do you have?  How do you want to spend your time?  To dig deeper and get a sense of your risk tolerance:  What is your financial outlook?  Do you expect to need money now or expect an uptick in monthly expenses?  Do you have a stable income?  Who do your loved ones turn to when there is an emergency?  What are your investing goals?  When do you want to retire? When do you expect to get married?  When do you want to start a family?  etc.  All these questions, from the day-to-day to the big picture are important to consider when deciding to be a long-term investor.  This should inform how you approach the markets, and what weight you should give certain stocks.  Finding your WHY is an important first step in determining how to approach the markets.  </p></li>\n<li><p><strong>What are the MACROTRENDS?</strong> When deciding to pick a stock, I like to first think about macrotrends.  Where do you see the world heading?  How do you think consumer behavior will change?  How do you think industries will change?  What impact will politics, international relations, and global and domestic issues have on the economy and the markets?  This requires staying informed about the world to a certain degree, but it&#39;s generally a great way to start thinking proactively about the markets and, also, to just become a more well-rounded individual.  </p></li>\n<li><p><strong>Does the company have a MOAT?</strong>  So you thought of some macrotrends, and you identified an industry you want to invest in.  You pick out a stock.  Ask yourself, does the company have a moat.  A moat is essentially something that allows the company to standout from its competitors.  It can be anything.  It can be the brand name, it can be user experience, it can be expected market share, it can even be the leadership or CEO, or all of the above.  Essentially, does the company have something about it that convinces you that it will stick around, successfully so, 5+ years from now?  As a long-term investor, I always seek to identify moats.  It will take some of the stress out of my decision-making because I am confident that the company will last.  </p></li>\n<li><p><strong>Are you comfortable with the FINANCIALS?</strong> I don&#39;t necessarily find it super helpful to focus in on certain numbers over others, etc.  However, you should have SOME understanding of the company&#39;s financials.  For example, I don&#39;t think you necessarily have to look for profitability.  Some great companies with solid moats operate at a loss.  Why?  Because they are investing in their growth.  But some companies operate at a loss because, well, they&#39;re just losing companies, or the greater industry itself is just falling apart and investors are getting out (i.e. oil).  Or maybe, the company isn&#39;t operating efficiently and the company is taking on more debt than it is producing revenue.  Just have a general understanding of why the way things are and how they might be moving forward, that should be enough to get you started.  </p></li>\n<li><p><strong>Be STINGY:  Is the price right for you?</strong> At the end of the day, you have to make the ultimate, probably most important decision:  is the price right for you?  Understand the basics of the stock market:  essentially, it is a salesperson making a pitch to sell a piece of a company at a certain price.  &quot;Hey, you want to buy a piece of Apple for $130?&quot;  Granted, in real-time you are being approached by hundreds of salesman on any given hour:  &quot;Ok, what about $129?  Oh, lost your chance, now we can only sell it for 134.&quot;  When you go to the store looking for a particular product, you already have a price in mind.  Salespeople might come up to you and offer you a wide range of prices for that product, but there is a range that you will consider.  Anything too cheap will make you skeptical of its quality.  Anything too expensive will be considered a rip-off.  Humanizing the market in this way will help you become a steadier investor.  <strong>Is the stock worth X dollar amount to you?</strong> If so, great.  Pull the trigger and invest.  If it goes down the next day, you don&#39;t have to worry because based on your research, you believe that the stock will come up and reach whatever dollar amount you think it&#39;s worth.  If not, then wait or don&#39;t buy it.  There are thousands of companies reaching out to you to buy their company at a certain price--there are always other opportunities.  </p></li>\n<li><p><strong>Stay informed.</strong>  Once you choose your stocks, you need to stay informed.  This can be a lot of things and it can be done in a lot of ways.  But, at the end of the day, you need some pulse on what you invest in.  Keep in mind the identifying reasons for why you invested in certain things, and be prepared to reconsider or reflect on your choices as soon as those reasons change.  For some companies, it might be easy.  Perhaps the MOAT you identified for one company is the CEO.  Great.  That means, as soon as you see news about leadership changing in that company, you need to reconsider your position in the stock.  You don&#39;t have to freak out daily. Macrotrends and moats and financials don&#39;t change overnight.  You&#39;re really looking for a trend overtime.  A weekly / biweekly / monthly routine can suffice.  </p></li>\n<li><p><strong>Be as disciplined as possible</strong>.  All of the above factors above ultimately help you to do ONE thing as a long-term investor.  To stay disciplined.  You want to take the emotions out of investing because as a long-term investor your outlook is not next week, next month, or next year.  Your outlook is the next 5 years, the next 10 years, etc.  Don&#39;t FOMO into a stock; instead, think about why it&#39;s spiking and go through steps 1-5, especially step 5.  Don&#39;t sell right away just because the stock you chose dipped 10% based on a piece of bad news; instead, think about why it&#39;s dipping and go through steps 1-5.  You get the gist.  As long-term investors we should be thinking big picture.  If steps 1-5 haven&#39;t changed after 1 piece of bad news, a 10% dip can be a great buying opportunity.  Alternatively, if steps 1-5 haven&#39;t changed after a stock shoots up an insane amount, it may be an opportunity to lock in some profits.</p></li>\n</ol>\n\n<p>Keeping these points in mind should help you get started as a long-term investor.  Would be happy to chat with anyone about their own journeys or just to discuss!  Best of luck to all as we enter 2021!</p>\n</div><!-- SC_ON -->",
  "score": 249,
  "permalink": "/r/stocks/comments/kq88x0/so_its_the_new_year_and_you_want_to_become_a/",
  "subreddit": "stocks",
  "id": "kq88x0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100749664
}