{
  "author": "Neat_Comfortable",
  "original_created_utc": 1639085049,
  "title": "People with a vagina: while peeing do you sometimes press on your clitoral hood and pretend you're one of those soda dispensers at fast food restaurants and your pee is lemonade?",
  "created_utc": 1639090625,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I sometimes pretend while I&amp;#39;m peeing that my body is dispensing lemonade from one of those soda machines where you press the buttons to get your drink.&lt;/p&gt;\n\n&lt;p&gt;I know this is super specific but I have to know if I&amp;#39;m the only one  who made this weird mental connection. It&amp;#39;s not sexual, just a joke (I wasn&amp;#39;t sure what to tag it other than nsfw).&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 121,
  "permalink": "/r/TooAfraidToAsk/comments/rcrngj/people_with_a_vagina_while_peeing_do_you/",
  "subreddit": "TooAfraidToAsk",
  "id": "rcrngj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I sometimes pretend while I'm peeing that my body is dispensing lemonade from\none of those soda machines where you press the buttons to get your drink.\n\nI know this is super specific but I have to know if I'm the only one who made\nthis weird mental connection. It's not sexual, just a joke (I wasn't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は時々、おしっこをしているときに、自分の体がレモネードを出しているように見せかけます。\nボタンを押すと飲み物が出るようなソーダ水の自販機がありますよね。\n\nこれは超特殊なことなのですが、私だけがそうなのかどうか知りたいのです。\nこの奇妙な精神的な接続。性的な意味ではなく、単なるジョークです（私はそうではありませんでしたが...）。",
      "title": "アソコのある人：オシッコをしているときに、クリトリスを押して、ファーストフード店のソーダディスペンサーのようなふりをして、オシッコをレモネードにすることがありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有时会在小便时假装我的身体是在从那种你按下按钮就能得到饮料的苏打水机上发放柠檬水。\n我有时会假装在小便时，我的身体正在从那些按按钮的苏打水机上发放柠檬水。\n\n我知道这很特别，但我想知道是否只有我一个人产生了\n这种奇怪的心理联系。这不是性，只是一个笑话（我不是...",
      "title": "有阴道的人：在小便时，你是否有时会按下你的阴蒂罩，假装你是快餐店的那种汽水分配器，你的小便是柠檬水？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有時會在小便時假裝我的身體是在從那種你按下按鈕就能得到飲料的蘇打水機上發放檸檬水。\n我有時會假裝在小便時，我的身體正在從那些按按鈕的蘇打水機上發放檸檬水。\n\n我知道這很特別，但我想知道是否只有我一個人產生了\n這種奇怪的心理聯繫。這不是性，只是一個笑話（我不是...",
      "title": "有陰道的人：在小便時，你是否有時會按下你的陰蒂罩，假裝你是快餐店的那種汽水分配器，你的小便是檸檬水？"
    }
  ]
}