{
  "author": "unpersonanongrata",
  "original_created_utc": 1625810981,
  "title": "Did Allied powers make an effort to humiliate and/or intimidate the Japanese delegation during the surrender ceremony on the USS Missouri in 1945?",
  "created_utc": 1625833847,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently learned that efforts were made aboard the USS Missouri to essentially pour salt in the wounds of the Japanese delegation to make the surrender a humiliating experience. The example that was told to me involved height restrictions of all sailors on the main deck. I was told that sailors on the main deck had to be at least six feet tall so that the Japanese delegation would somehow feel small and inferior. How much of an effort did the Allied powers make to intimidate their recently defeated guests? Were the efforts approved by higher ups in the military? Did any such efforts actually increase tensions between the representatives of the Allied forces and the delegation from the Empire of Japan? Does the US have a history of similar behaviors at the conclusions of conflicts?</p>\n\n<p>The source I learned about the height expectation was a relative of a sailor that was on the USS Missouri during the surrender ceremony.</p>\n</div><!-- SC_ON -->",
  "score": 130,
  "permalink": "/r/AskHistorians/comments/ogpjg1/did_allied_powers_make_an_effort_to_humiliate/",
  "subreddit": "AskHistorians",
  "id": "ogpjg1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I recently learned that efforts were made aboard the USS Missouri to essentially\npour salt in the wounds of the Japanese delegation to make the surrender a\nhumiliating experience. The example that was told to me involved height\nrestrictions of all sailors on the main deck. I was told that sailors on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近知ったのですが、USSミズーリ艦内では、降伏を実現するために、日本の代表団の傷口に塩を塗るような努力がなされたそうです。\n日本の代表団の傷口に塩を塗り、降伏を屈辱的なものにするために\n屈辱的な経験をさせるために。私に教えてくれた例は、メインデッキにいるすべての水兵の身長\nメインデッキにいる水兵の身長制限です。私が言われたのは、メインデッキの水兵の身長制限でした。",
      "title": "1945年にUSSミズーリで行われた降伏式典で、連合国は日本の代表団を辱めたり、威嚇したりする努力をしたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近了解到，在美国海军密苏里号战舰上作出了努力，基本上是为了\n在日本代表团的伤口上撒盐，使投降成为一种\n羞辱性的经历。有人告诉我的例子是\n对主甲板上所有水手的身高限制。我被告知，水手们在...",
      "title": "1945年，在密苏里号战舰的投降仪式上，盟国是否努力羞辱和/或恐吓日本代表团？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近了解到，在美國海軍密蘇里號戰艦上作出了努力，基本上是爲了\n在日本代表團的傷口上撒鹽，使投降成爲一種\n羞辱性的經歷。有人告訴我的例子是\n對主甲板上所有水手的身高限制。我被告知，水手們在...",
      "title": "1945年，在密蘇里號戰艦的投降儀式上，盟國是否努力羞辱和/或恐嚇日本代表團？"
    }
  ]
}