{
  "author": "Mefilius",
  "original_created_utc": 1651422423,
  "title": "With CDC shooting themselves in the foot, what's the best place to go?",
  "created_utc": 1651477398,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been a pretty extensive user of Crypto.com, but with them slashing basically everything that made them competitive, I&amp;#39;ll probably be looking for the next best thing. &lt;/p&gt;\n\n&lt;p&gt;I never had a bad experience with their platform, and I appreciated their variety of services, maybe I am in the minority there.&lt;/p&gt;\n\n&lt;p&gt;My main thing is going to be finding a reputable platform with a large enough selection of coins. Bonus points if they have a powerful earn program, cards, or seamless DeFi integration. I don&amp;#39;t need a one stop shop, but I do want to avoid extensive gas fees.&lt;/p&gt;\n\n&lt;p&gt;What do you guys use, and what do you prefer?&lt;/p&gt;\n\n&lt;p&gt;Edit: Plutus looking very nice, but they only do EU, so that is very sad for a US person like me. I&amp;#39;ll be eagerly awaiting US support someday...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 303,
  "permalink": "/r/CryptoCurrency/comments/ug3im5/with_cdc_shooting_themselves_in_the_foot_whats/",
  "subreddit": "CryptoCurrency",
  "id": "ug3im5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been a pretty extensive user of Crypto.com, but with them slashing\nbasically everything that made them competitive, I'll probably be looking for\nthe next best thing.\n\nI never had a bad experience with their platform, and I appreciated their\nvariety of services, maybe I am in the minority…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はCrypto.comのかなり広範なユーザーでしたが、彼らは競争力のあるものを基本的にすべて切り捨てたので、私は多分、次のものを探します。\n基本的に競争力のあるものをすべて切り捨ててしまったので、私はおそらく次善の策を探すでしょう。\n次善の策を探すことになるでしょう。\n\n私は彼らのプラットフォームで悪い経験をしたことがない、と私は彼らの様々なサービスを高く評価しています。\n私は少数派かもしれませんが...。",
      "title": "CDCが自ら足元を撃っている中、何が最善なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直是Crypto.com的一个相当广泛的用户，但随着他们削减了\n基本上使他们具有竞争力的一切，我可能会寻找\n下一个最好的东西。\n\n我从未在他们的平台上有过糟糕的经历，而且我很欣赏他们的各种服务。\n他们的各种服务，也许我是少数......",
      "title": "在CDC自相残杀的情况下，什么是最好的去处？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直是Crypto.com的一個相當廣泛的用戶，但隨着他們削減了\n基本上使他們具有競爭力的一切，我可能會尋找\n下一個最好的東西。\n\n我從未在他們的平臺上有過糟糕的經歷，而且我很欣賞他們的各種服務。\n他們的各種服務，也許我是少數......",
      "title": "在CDC自相殘殺的情況下，什麼是最好的去處？"
    }
  ]
}