{
  "author": "MagicGlitterKitty",
  "original_created_utc": 1652713100,
  "title": "Is the Victorian \"cure\" for hysteria a myth? [NSFW]",
  "created_utc": 1652731198,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have heard it said a lot in the early 2010s that Victorian Doctors came up with the &amp;quot;pelvic massage&amp;quot; technique in order to cure women of hysteria. After a while the massage became so tiresome for doctors they invited the first electric vibrator. &lt;/p&gt;\n\n&lt;p&gt;This has always struck me as a myth, it plays too well into our idea of Victorians not understanding sex, and compliments our own modern sensibilities too well.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/uqxvgm/is_the_victorian_cure_for_hysteria_a_myth_nsfw/",
  "subreddit": "AskHistorians",
  "id": "uqxvgm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I have heard it said a lot in the early 2010s that Victorian Doctors came up\nwith the \"pelvic massage\" technique in order to cure women of hysteria. After a\nwhile the massage became so tiresome for doctors they invited the first electric\nvibrator.\n\nThis has always struck me as a myth, it plays too…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2010年代前半によく言われたのが、ヴィクトリアン・ドクターズが出てきたことです\nヴィクトリア朝の医師が、女性のヒステリーを治すために「骨盤マッサージ」という技術を思いついたという話を、2010年の初めによく聞きました。しかし、しばらくすると\nマッサージが面倒になった医師が、電気バイブレーターを開発したという話です。\nバイブレーターを導入した。\n\nこれは神話だと私は思っています。",
      "title": "ヴィクトリア朝のヒステリーの「治療法」は神話か？[NSFW]"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在2010年代初，我经常听到有人说，维多利亚时代的医生想出了\n盆腔按摩 \"技术，以治疗妇女的子宫炎。经过一个\n一段时间后，按摩对医生来说变得如此令人厌烦，他们邀请了第一个电动\n振动器。\n\n这一直让我觉得是个神话，它扮演的角色太...",
      "title": "维多利亚时代对歇斯底里的 \"治疗 \"是一个神话吗？[NSFW]"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在2010年代初，我經常聽到有人說，維多利亞時代的醫生想出了\n盆腔按摩 \"技術，以治療婦女的子宮炎。經過一個\n一段時間後，按摩對醫生來說變得如此令人厭煩，他們邀請了第一個電動\n振動器。\n\n這一直讓我覺得是個神話，它扮演的角色太...",
      "title": "維多利亞時代對歇斯底里的 \"治療 \"是一個神話嗎？[NSFW]"
    }
  ]
}