{
  "author": "arkinia-charlotte",
  "original_created_utc": 1648766257,
  "title": "Is it bad to orgasm in like 3 seconds as a woman?",
  "created_utc": 1648782624,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I always read about women needing like 20 minutes and that 5 mins is fast. I looked it up and apparently 2 mins is premature. Then what the hell am I?? It doesn’t matter if my bf is fingering me or if I use a vibrator. I need like 4 seconds and poof. Is there something wrong with me?&lt;/p&gt;\n\n&lt;p&gt;It kinda ruins the moment, afterwards I become really sensitive and it’s sometimes hard to keep going after that.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 153,
  "permalink": "/r/TooAfraidToAsk/comments/ttbpm2/is_it_bad_to_orgasm_in_like_3_seconds_as_a_woman/",
  "subreddit": "TooAfraidToAsk",
  "id": "ttbpm2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I always read about women needing like 20 minutes and that 5 mins is fast. I\nlooked it up and apparently 2 mins is premature. Then what the hell am I?? It\ndoesn’t matter if my bf is fingering me or if I use a vibrator. I need like 4\nseconds and poof. Is there something wrong with me?\n\nIt kinda…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いつも女性は20分くらい必要で、5分は早いと読んでいます。I\n調べてみると、どうやら2分では早すぎるようです。じゃあ、俺は一体何なんだ？それは\nバイブレーターを使おうが、彼氏に指を入れられようが、関係ないんです。4時間くらいで\n秒後にパッと。私、どこかおかしいんでしょうか？\n\nなんだか...",
      "title": "女性で3秒くらいでオーガズムを感じるのはまずいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我总是读到女性需要20分钟左右的时间，而5分钟是很快的。I\n我查了一下，显然2分钟是过早的。那我到底是什么呢？我到底是什么？\n如果我的男朋友用手指指着我，或者我用振动器，都没有关系。我需要像4\n秒，然后 \"噗 \"的一声。我是不是有什么毛病？\n\n这有点...",
      "title": "作为一个女人，在3秒内达到高潮不好吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我總是讀到女性需要20分鐘左右的時間，而5分鐘是很快的。I\n我查了一下，顯然2分鐘是過早的。那我到底是什麼呢？我到底是什麼？\n如果我的男朋友用手指指着我，或者我用振動器，都沒有關係。我需要像4\n秒，然後 \"噗 \"的一聲。我是不是有什麼毛病？\n\n這有點...",
      "title": "作爲一個女人，在3秒內達到高潮不好嗎？"
    }
  ]
}