{
  "author": "ApartRuin5962",
  "original_created_utc": 1659201897,
  "title": "Why did Magellan think there would be a southern passage between the Atlantic and Pacific?",
  "created_utc": 1659227947,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was watching &amp;quot;Boundless&amp;quot;/&amp;quot;Sin límites&amp;quot; on Amazon, and Magellan keeps saying that he knows a strait exists to the south of South America because of his &amp;quot;calculations&amp;quot; and studying the logbooks and maps in the Portuguese treasury. They never really elaborate on his reasoning, though, and I could imagine a screenwriter bending the history to make him seem more like a modern evidence-based scientist, rather than a zealot who risked a huge amount of money and the lives of 270 sailors on an optimistic guess.&lt;/p&gt;\n\n&lt;p&gt;I was wondering if there&amp;#39;s any record of how he came to this conclusion. I&amp;#39;ve also been reading &amp;quot;Farthest North&amp;quot; by Fritjof Nansen, and he carefully explains how the scientific theory behind his voyage (the Arctic ice cap steadily moves from Siberia to the Atlantic) is based on hard evidence (for example, Siberian plants, minerals, and flotsam from the Jeanette shipwreck arriving in Greenland). Did Magellan have evidence from previous voyages that the Pacific and Atlantic are connected? Was it just an optimistic guess? Or is his actual reasoning lost to posterity?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/wc2ncf/why_did_magellan_think_there_would_be_a_southern/",
  "subreddit": "AskHistorians",
  "id": "wc2ncf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was watching \"Boundless\"/\"Sin límites\" on Amazon, and Magellan keeps saying\nthat he knows a strait exists to the south of South America because of his\n\"calculations\" and studying the logbooks and maps in the Portuguese treasury.\nThey never really elaborate on his reasoning, though, and I could…"
}