{
  "author": "sushi_chobab",
  "the_new_excerpt": "I am 16F it's about time I should start learning about this stuff. I've heard\nthese terms thrown around pretty often but I don't exactly know what they're\nsupposed to mean? like I'm gay and I've heard that the right really don't like\nme so I should be left but idk what any of that means and I don't…",
  "original_created_utc": 1619707519,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は16歳......そろそろこのようなことを学び始めなければならない時期です。これまでに\nよく耳にする言葉ですが、どういう意味なのかよくわかりません。\n例えば、私はゲイですが、右派の人たちは私のことを本当に嫌っていると聞いたことがあります。\n私はゲイで、右派に嫌われているから左派になるべきだって聞いたことがあるんだけど、その意味がわからないし......。",
      "title": "政治とは何なのか、左派、右派、リベラル、保守、プロパガンダを読まずにこれらの用語を理解するにはどうしたらよいのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今年16岁，是时候该开始学习这些东西了。我听说\n我经常听到这些术语，但我不知道它们到底是什么意思？\n比如我是同性恋，我听说右派真的不喜欢我，所以我应该是左派。\n我是同性恋，我听说右派不喜欢我，所以我应该是左派，但我不知道这意味着什么，我不...",
      "title": "什么是政治？\"左 \"和 \"右\"？\"自由派 \"和 \"保守派\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今年16歲，是時候該開始學習這些東西了。我聽說\n我經常聽到這些術語，但我不知道它們到底是什麼意思？\n比如我是同性戀，我聽說右派真的不喜歡我，所以我應該是左派。\n我是同性戀，我聽說右派不喜歡我，所以我應該是左派，但我不知道這意味着什麼，我不...",
      "title": "什麼是政治？\"左 \"和 \"右\"？\"自由派 \"和 \"保守派\"？"
    }
  ],
  "title": "wtf is politics? left-right? liberal conservative? where do I even begin to understand these terms without reading propoganda",
  "created_utc": 1619721769,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am 16F it&#39;s about time I should start learning about this stuff. I&#39;ve heard these terms thrown around pretty often but I don&#39;t exactly know what they&#39;re supposed to mean? like I&#39;m gay and I&#39;ve heard that the right really don&#39;t like me so I should be left but idk what any of that means and I don&#39;t want to just pick a side completely ignorant.\nI&#39;m not asking for an explanation of those terms but just how do I begin learning about then myself? I want to spend the summer break to think about my political beliefs and figuring out what I should believe in. Sources would be appreciated. stories about how you educated yourself in this department would be absolutely splendid.</p>\n</div><!-- SC_ON -->",
  "score": 171,
  "permalink": "/r/NoStupidQuestions/comments/n15xa1/wtf_is_politics_leftright_liberal_conservative/",
  "subreddit": "NoStupidQuestions",
  "id": "n15xa1",
  "is_self": true,
  "media": null,
  "is_video": false
}