{
  "author": "prajwalwillrule",
  "original_created_utc": 1630548659,
  "title": "Hi fam, I'm back to help you folks to check your karma count. The CSV is out and should be pinned. Check the hot posts! For those who are not able to open on their phones or desktops, please leave a comment and I'll give you your KARMA COUNT.",
  "created_utc": 1630587665,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We may have a lot of new people here this time as well. Find the CSV file from the latest moon distribution post and search for your name and find your Karma count. If you can&#39;t, just leave a comment and I&#39;ll do it for you.</p>\n\n<p>The RATIO for this month is roughly 0.1885 as calculated by the smart guy on the post who I will definitely tag here in a bit. </p>\n\n<p>To get your moon count, just multiply your karma with 0.1885</p>\n\n<p>Example if your karma is 100, you get 100 x 0.1885 = 18 moons. </p>\n\n<p>So anyone who isn&#39;t able or is just too lazy to open the CSV, leave a comment. I&#39;ll give you your Karma Count.</p>\n\n<p>Cheers!</p>\n\n<p>EDIT thanks <a href=\"/u/mjrice\">u/mjrice</a> for your calculations!</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/pg8gie/hi_fam_im_back_to_help_you_folks_to_check_your/",
  "subreddit": "CryptoCurrency",
  "id": "pg8gie",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We may have a lot of new people here this time as well. Find the CSV file from\nthe latest moon distribution post and search for your name and find your Karma\ncount. If you can't, just leave a comment and I'll do it for you.\n\nThe RATIO for this month is roughly 0.1885 as calculated by the smart guy…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今回も新しい方がたくさんいらっしゃるかもしれませんね。のCSVファイルを探してください。\n自分の名前を検索して、自分のカルマ数を確認してみてください。\nカウントを表示します。もしできなければ、コメントを残してくれれば、私がやってあげますよ。\n\n今月のRATIOは、頭のいい人が計算するとだいたい0.1885になります...。",
      "title": "Hi fam, I'm back to help you folks to check your karma count. CSVが公開されているので、ピン留めしておきましょう。ホットな記事をチェックしましょう スマホやデスクトップで開けない方は、コメントを残していただければカルマカウントをお伝えします。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这次我们这里可能也有很多新人。找到CSV文件，从\n最新的月亮分布帖子中找到CSV文件，搜索你的名字并找到你的Karma\n数。如果你做不到，就留下评论，我会帮你做。\n\n这个月的RATIO大约是0.1885，由聪明人计算...",
      "title": "嗨，家人，我回来帮助你们这些人检查你们的业力计数。CSV已经出来了，应该被钉住了。检查热帖! 对于那些无法在手机或桌面上打开的人，请留下评论，我会给你的KARMA COUNT。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這次我們這裏可能也有很多新人。找到CSV文件，從\n最新的月亮分佈帖子中找到CSV文件，搜索你的名字並找到你的Karma\n數。如果你做不到，就留下評論，我會幫你做。\n\n這個月的RATIO大約是0.1885，由聰明人計算...",
      "title": "嗨，家人，我回來幫助你們這些人檢查你們的業力計數。CSV已經出來了，應該被釘住了。檢查熱帖! 對於那些無法在手機或桌面上打開的人，請留下評論，我會給你的KARMA COUNT。"
    }
  ]
}