{
  "author": "MaxThrustage",
  "the_new_excerpt": "From Capital, and other little bits and pieces I've seen here and there, I get\nthe impression that Marx thought a communist uprising was the inevitable outcome\nof capitalism, and that therefore it would happen in the most advanced\ncapitalist economies, namely England and Germany. However, the way…",
  "original_created_utc": 1621362288,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "資本論』をはじめ、あちこちで目にした小さな断片から、私は次のような印象を受けました。\nマルクスは、共産主義者の蜂起は資本主義の必然的な結果であると考えていたようです。\n資本主義の必然的な結果であると考えていて、それゆえ、最も進んだ資本主義経済である\nイギリスやドイツといった最先端の資本主義経済圏で起こるだろうと考えていました。しかし、その方法は...",
      "title": "現代のマルクス主義者は、共産主義革命が先進国の資本主義経済ではなく、主に第三世界や植民地国家で起こる傾向があるという事実をどう受け止めているのでしょうか。マルクス自身はどう答えただろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "从《资本论》以及我在这里和那里看到的其他小碎片中，我得到的印象是\n我的印象是，马克思认为共产主义起义是资本主义的不可避免的结果。\n资本主义的必然结果，因此，它将发生在最先进的\n因此，它将发生在最先进的资本主义经济体，即英国和德国。然而，方式...",
      "title": "现代马克思主义者如何回应共产主义革命往往不是发生在发达的资本主义经济体，而是主要发生在第三世界和殖民地国家这一事实？马克思本人会如何回应？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從《資本論》以及我在這裏和那裏看到的其他小碎片中，我得到的印象是\n我的印象是，馬克思認爲共產主義起義是資本主義的不可避免的結果。\n資本主義的必然結果，因此，它將發生在最先進的\n因此，它將發生在最先進的資本主義經濟體，即英國和德國。然而，方式...",
      "title": "現代馬克思主義者如何迴應共產主義革命往往不是發生在發達的資本主義經濟體，而是主要發生在第三世界和殖民地國家這一事實？馬克思本人會如何迴應？"
    }
  ],
  "title": "How do modern Marxists respond to the fact that communist revolutions have tended to happen not in developed capitalist economies, but rather mostly in the third world and colonial states? How would Marx himself have responded?",
  "created_utc": 1621383559,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>From Capital, and other little bits and pieces I&#39;ve seen here and there, I get the impression that Marx thought a communist uprising was the inevitable outcome of capitalism, and that therefore it would happen in the most advanced capitalist economies, namely England and Germany. However, the way things actually played out, we saw Marxist (or Marxist-Leninist) revolutions occurring and succeeding in places like Vietnam and Zimbabwe, but <em>not</em> in advanced capitalist societies such as Britain or the United States. (East Germany might be seen as an exception, but my impression was that they only became communist due to occupation by the Soviets, not due to an internal worker-lead revolution of the sort Marx might have predicted). Why do Marxists think this happened? Is this a limitation of Marx&#39;s original analysis (a failure to account for how the modern world would change, perhaps)? How would Marx himself have responded to knowledge that, say, Cuba would undergo a communist revolution while, say, Britain would remain firmly capitalistic for more than a century after Marx&#39;s death?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/nfi4w0/how_do_modern_marxists_respond_to_the_fact_that/",
  "subreddit": "askphilosophy",
  "id": "nfi4w0",
  "is_self": true,
  "media": null,
  "is_video": false
}