{
  "author": "JolynnRountree",
  "original_created_utc": 1627483395,
  "title": "Banks, decentralized finance and inflation rates. Is banking changing or should I stay traditional?",
  "created_utc": 1627497061,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Because prices are expected to rise in the future, inflation might diminish the value of your investments over time. This is especially evident when dealing with money. If you keep $10,000, it may not be enough to buy as much in 20 years. While you haven&#39;t really lost money, inflation has affected your purchasing power, resulting in a lower net worth. The average bank interest rate for interest checking accounts in the United States is 0.03%. Meanwhile, the average savings account rate is currently 0.06%, and the average money market account interest rate is 0.09%. (<a href=\"https://www.valuepenguin.com/banking/average-bank-interest-rates\">Source</a>). Meanwhile consumer prices have an inflation rate of 4.2% (<a href=\"https://www.cnbc.com/2021/05/12/consumer-price-index-april-2021.html\">Source</a>) So you might be thinking that your money is doing okay in the bank but in reality your savings aren’t growing fast enough to compete with inflation.</p>\n\n<p>With banks not giving out any solution for inflation; decentralized finance has opened up a solution to it by removing the middleman. Through defi anyone can lend their savings directly to others and can earn back all of the interest for themselves. The key technologies that allow decentralized finance are blockchain and cryptocurrencies.</p>\n\n<p>What are your thoughts on this? Is decentralization the future?</p>\n</div><!-- SC_ON -->",
  "score": 176,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/5X3nd3SMxNcirUAftSJoSONF_zhRDGCCeV4AD2swULs.jpg?auto=webp&s=6225cf57e2fc17f756728549ed8d8086acb437fd",
          "width": 800,
          "height": 592
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/5X3nd3SMxNcirUAftSJoSONF_zhRDGCCeV4AD2swULs.jpg?width=108&crop=smart&auto=webp&s=cf20636f75db49d4dc7b166a8f6eec11a703a7f3",
            "width": 108,
            "height": 79
          },
          {
            "url": "https://external-preview.redd.it/5X3nd3SMxNcirUAftSJoSONF_zhRDGCCeV4AD2swULs.jpg?width=216&crop=smart&auto=webp&s=1cd0da3d8d890ec8911932b98b9859275755c58d",
            "width": 216,
            "height": 159
          },
          {
            "url": "https://external-preview.redd.it/5X3nd3SMxNcirUAftSJoSONF_zhRDGCCeV4AD2swULs.jpg?width=320&crop=smart&auto=webp&s=2b95b0e66881c6c821511269e8acb7f38688ee05",
            "width": 320,
            "height": 236
          },
          {
            "url": "https://external-preview.redd.it/5X3nd3SMxNcirUAftSJoSONF_zhRDGCCeV4AD2swULs.jpg?width=640&crop=smart&auto=webp&s=7ff1f42abca7a9fea81aa2bace9d32eb65f090de",
            "width": 640,
            "height": 473
          }
        ],
        "variants": {},
        "id": "-0nHKXTdp7NG9s3uzakDme0id1ueuFZ_9ZCR8jgJ1fA"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/otbb2u/banks_decentralized_finance_and_inflation_rates/",
  "subreddit": "CryptoCurrency",
  "id": "otbb2u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Because prices are expected to rise in the future, inflation might diminish the\nvalue of your investments over time. This is especially evident when dealing\nwith money. If you keep $10,000, it may not be enough to buy as much in 20\nyears. While you haven't really lost money, inflation has affected…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "物価は将来的に上昇することが予想されるため、インフレは時間の経過とともに投資の価値を低下させる可能性があります。\n時間が経つにつれ、投資の価値が下がっていく可能性があります。これは特にお金を扱うときに顕著です。\n貨幣の場合は特に顕著です。1万ドル持っていても、20年後には同じ額を買えなくなるかもしれません。\n年後には同額の買い物ができなくなるかもしれません。実際にお金を失ったわけではありませんが、インフレの影響を受け...",
      "title": "銀行、分散型金融、インフレ率。銀行業は変化しているのか、それとも伝統を守るべきなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因为预计未来的价格会上升，通货膨胀可能会减少你的投资价值。\n随着时间的推移，你的投资价值会减少。这在处理货币时尤其明显。\n钱的时候尤其明显。如果你保留1万美元，它可能不足以在20年后购买同样多的东西。\n年后，它可能不足以购买同样多的东西。虽然你并没有真正失去金钱，但通货膨胀已经影响到...",
      "title": "银行、分散的金融和通货膨胀率。银行业正在发生变化还是应该保持传统？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因爲預計未來的價格會上升，通貨膨脹可能會減少你的投資價值。\n隨着時間的推移，你的投資價值會減少。這在處理貨幣時尤其明顯。\n錢的時候尤其明顯。如果你保留1萬美元，它可能不足以在20年後購買同樣多的東西。\n年後，它可能不足以購買同樣多的東西。雖然你並沒有真正失去金錢，但通貨膨脹已經影響到...",
      "title": "銀行、分散的金融和通貨膨脹率。銀行業正在發生變化還是應該保持傳統？"
    }
  ]
}