{
  "author": "savage-dragon",
  "original_created_utc": 1645279936,
  "title": "The white hat hacker who discovered a critical vulnerability in Coinbase, potentially saving Coinabse and the entire market from an ABSOLUTE CATASTROPHE was rewarded with a.... big fat check of $250k.",
  "created_utc": 1645288826,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://twitter.com/tree_of_alpha/status/1494951540339187714?s=21\"&gt;https://twitter.com/tree_of_alpha/status/1494951540339187714?s=21&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;For context this is the account of Mr. White Hat. The vulnerability in question could have allowed the white hat hacker to change the order prices of cryptocureencies listed on Coinbase (think he can out any price for any crypto he wants and buy or sell BTC ETH at any price he wants). Not wouldn&amp;#39;t have affected just Coinbase. Many DeFi projects also use Coinbase as a price oracle... so something like this happening could have triggered an extinction event to all crypto markets, possibly liquidating tens of billions, maybe a hundred billion dollars.&lt;/p&gt;\n\n&lt;p&gt;Mr. White hat wasn&amp;#39;t joking when he said this was potentiallytially market nuking. The person who fixed optimism critical vulnerability was awarded with a $2 million bounty. No matter where you stand, this vulnerability was much bigger and it&amp;#39;s impact could have been massive. &lt;/p&gt;\n\n&lt;p&gt;Coinbase being Coinbase, deemed fit to reward our hacker with $250k, and there wasn&amp;#39;t even any epic item to go with it. 3/10 would not do this quest again lmao.&lt;/p&gt;\n\n&lt;p&gt;This also shows a classic human behavior. You&amp;#39;d skim on $50 worth of protection all the time but when you suddenly smash your head on the pavement and be bed ridden for the rest of your life you&amp;#39;re gonna wish you didn&amp;#39;t forget your protective gear. But of course you only appreciate your protective gear when you&amp;#39;re bed ridden. When nothing happens you think even $50 is too expensive, maybe you could haggle it down to $9.69.&lt;/p&gt;\n\n&lt;p&gt;Kek.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 358,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/UXL6YkMJvrD-_8dVFqGZ-0mPq1hgWbyJ3LSVtHiUpXg.jpg?auto=webp&amp;s=fda89108fc285bf572d70c8544922e7d42b09fe3",
          "width": 140,
          "height": 140
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/UXL6YkMJvrD-_8dVFqGZ-0mPq1hgWbyJ3LSVtHiUpXg.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=31d6b84762588b21e9eead049ce0810e51d3a081",
            "width": 108,
            "height": 108
          }
        ],
        "variants": {},
        "id": "E6Id82w6BfAZJCK9mztVKyyg2Pa7eeDMx-yOmpI-cks"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/swaz33/the_white_hat_hacker_who_discovered_a_critical/",
  "subreddit": "CryptoCurrency",
  "id": "swaz33",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "https://twitter.com/tree_of_alpha/status/1494951540339187714?s=21\n\nFor context this is the account of Mr. White Hat. The vulnerability in question\ncould have allowed the white hat hacker to change the order prices of\ncryptocureencies listed on Coinbase (think he can out any price for any crypto\nhe…"
}