{
  "author": "Seekingaloha",
  "the_new_excerpt": "I’ve been a long time T owner and it’s really had a hard time holding above $30\nfor a year plus now. Consolidated around $28 though there was a serious new year\ndip. Suddenly in April it pushed past $30. Explanation was weak. Something about\nHBO, which seemed a little lame considering other stay at…",
  "original_created_utc": 1621255393,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は長年Tを所有していますが、1年以上前から30ドル以上を維持するのに苦労しています。\nこの1年以上、30ドル以上を維持するのは大変でした。新年に深刻な落ち込みがありましたが、28ドル前後で連結しました。\n落ち込みました。4月になって突然30ドルを超えました。説明が弱かったですね。何かというと\nHBOについての説明が弱かった。",
      "title": "先月のT社合併をどうやって知ったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是T的长期拥有者，它真的很难保持在30美元以上。\n已经有一年多了。虽然在28美元左右有一个严重的新年巩固\n下跌。突然在4月，它冲过了30美元。解释是弱的。一些关于\nHBO，这似乎有点蹩脚，考虑到其他停留在...",
      "title": "他们怎么会知道上个月T公司的合并？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是T的長期擁有者，它真的很難保持在30美元以上。\n已經有一年多了。雖然在28美元左右有一個嚴重的新年鞏固\n下跌。突然在4月，它衝過了30美元。解釋是弱的。一些關於\nHBO，這似乎有點蹩腳，考慮到其他停留在...",
      "title": "他們怎麼會知道上個月T公司的合併？"
    }
  ],
  "title": "How did they know about the T merger last month?",
  "created_utc": 1621261637,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been a long time T owner and it’s really had a hard time holding above $30 for a year plus now. Consolidated around $28 though there was a serious new year dip. Suddenly in April it pushed past $30. Explanation was weak. Something about HBO, which seemed a little lame considering other stay at home plays like Netflix tapered off and Disney competition. But then it blew past $31 and $32. It’s very apparent that many insiders knew about the merger and were trading on it. </p>\n\n<p>I don’t know how Martha Stewart was ever busted. Someone must have really hated her because by and large, insider trading goes unpunished.</p>\n</div><!-- SC_ON -->",
  "score": 1008,
  "permalink": "/r/stocks/comments/nef8qs/how_did_they_know_about_the_t_merger_last_month/",
  "subreddit": "stocks",
  "id": "nef8qs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590804457
}