{
  "author": "lab_penguin",
  "original_created_utc": 1645143526,
  "title": "How do you guys know SO MUCH about crypto?",
  "created_utc": 1645166627,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Okay so I&amp;#39;m just getting into crypto, and this sub has been AMAZING help! None of my girlfriends know anything about it, so I haven&amp;#39;t been able to talk to anyone about it. I&amp;#39;ve earned a little bit of money from modeling and other related gigs, so I&amp;#39;ve built up a very small but steadily growing portfolio. I still feel like I&amp;#39;m far away from any sort of large sum, but slowly DCA&amp;#39;ing into something meaningful. It&amp;#39;s about $20 a month (things are slow right now), but when I have the cash I make bigger deposits. Maybe in a few years I&amp;#39;ll be where a lot of you guys are :)&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve learned so much just from reading posts here, thanks to you guys and your advice. Staking, whale tracking, NFTs, Ethereum 2.0, smart contracts, dApps, remix, Solidity, all that stuff. I want to learn more because every day something new comes up and again I feel like I know NOTHING. I know a lot of people come on this sub and like to joke and troll, but just keep in mind there are people here who truly want to learn!! So please keep an open mind of that and keep on doing what you do.&lt;/p&gt;\n\n&lt;p&gt;Just wanted to say thanks :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 318,
  "permalink": "/r/CryptoCurrency/comments/sv3r8v/how_do_you_guys_know_so_much_about_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "sv3r8v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Okay so I'm just getting into crypto, and this sub has been AMAZING help! None\nof my girlfriends know anything about it, so I haven't been able to talk to\nanyone about it. I've earned a little bit of money from modeling and other\nrelated gigs, so I've built up a very small but steadily growing…"
}