{
  "author": "MinorcaPlays",
  "original_created_utc": 1631189842,
  "title": "If ADA smart contracts end up being a fiasco what is the best to do?",
  "created_utc": 1631213290,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was reading a bit today some discussions regarding the new smart contracts that ADA plans to launch.</p>\n\n<p>Good points from both supporters and oposition to the change that is being done.</p>\n\n<p>I for one, believe that they can make it work, but I am well aware that theres a good chance it wont go well in terms of price.</p>\n\n<p>So if the price does go down due to the smart contracts, what do you believe the best option is after the bet you&#39;ve done turned out to be a bad decision?</p>\n\n<p>I believe holding it should be fine, since the ADA project is still a solid project overall and with time we can regain value after they fix any mistakes that might happen.</p>\n\n<p>But well, I&#39;m all ears, what do you think the best option is for those who end up losing their bets on this 12th September?</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/pkwngc/if_ada_smart_contracts_end_up_being_a_fiasco_what/",
  "subreddit": "CryptoCurrency",
  "id": "pkwngc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was reading a bit today some discussions regarding the new smart contracts\nthat ADA plans to launch.\n\nGood points from both supporters and oposition to the change that is being done.\n\nI for one, believe that they can make it work, but I am well aware that theres a\ngood chance it wont go well in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日は、ADAが立ち上げる予定の新しいスマートコントラクトに関する議論を少し読んでいました。\nの議論を読んでいたのですが、ADAが立ち上げようとしている\n\n今回の変更について、賛成派と反対派の両方から良い指摘がありました。\n\n私は、ADAがそれを実現できると信じていますが、それがうまくいかない可能性があることも十分承知しています。\nうまくいかない可能性が高いことは十分に承知しています...",
      "title": "ADAスマートコントラクトが大失敗に終わったら......どうするのがベスト？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今天读了一些关于新的智能合约的讨论。\n的讨论。\n\n支持者和反对者都对正在进行的变革提出了很好的观点。\n\n我相信他们可以让它发挥作用，但我也清楚地知道，有一个很好的机会，它不会很顺利地进行。\n但我很清楚，它有很大的可能性不会顺利进行...",
      "title": "如果ADA智能合约最终成为一场惨败，那么最好的办法是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今天讀了一些關於新的智能合約的討論。\n的討論。\n\n支持者和反對者都對正在進行的變革提出了很好的觀點。\n\n我相信他們可以讓它發揮作用，但我也清楚地知道，有一個很好的機會，它不會很順利地進行。\n但我很清楚，它有很大的可能性不會順利進行...",
      "title": "如果ADA智能合約最終成爲一場慘敗，那麼最好的辦法是什麼？"
    }
  ]
}