{
  "author": "DrNancyReagin",
  "original_created_utc": 1642951455,
  "title": "I'm Dr. Nancy Reagin, author of \"Re-Living the American Frontier: Western Fandoms, Reenactment, and Historical Hobbyists in Germany since 1900.\" Ask me anything about the history of literary fandoms and historical hobbyists!",
  "created_utc": 1642954547,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello &lt;a href=\"https://www.reddit.com/r/AskHistorians/\"&gt;r/AskHistorians&lt;/a&gt;, I’m &lt;a href=\"https://dyson.pace.edu/sections/meet-the-faculty/faculty-profile/nreagin\"&gt;Nancy Reagin&lt;/a&gt;, a European historian of gender and popular culture, and my most recent book is &lt;a href=\"https://www.uipress.uiowa.edu/books/9781609387907/re-living-the-american-frontier\"&gt;&lt;em&gt;Re-living the American Frontier: Western Fandoms, Reenactment, and Historical Hobbyists in Germany and America Since 1900&lt;/em&gt;&lt;/a&gt;&lt;em&gt;.&lt;/em&gt; Related to that, I’ve also edited a series of historical readers’ companions for a variety of fantasy and science fiction series.&lt;/p&gt;\n\n&lt;p&gt;Fandoms emerged alongside the rise of pulp fiction and mass commercial entertainments during the late 19th and early twentieth centuries; the word “fandom” was first used in print in 1903. Although fan communities emerged around sports teams, film and music celebrities, and other commercial entertainments, I am most interested in the development of literary fandoms and (sometimes linked to or overlapping) historically-focused fandoms during the 20th century, and their transition to online communities after the 1980s.  Early literary fandoms grew around pulp fiction genres, including detective fiction (especially the Sherlock Holmes stories), science fiction, and Westerns. In these groups, fans participated in many ways; parsing and analyzing their “canon”; recreating scenes and artifacts from the stories; publishing essays and stories that reframed and retold the original stories; creating fan art in a wide variety of media. In each case, their communities used new media formats that emerged in later decades, but also altered and adapted in ways that reflected broader social and political changes. In writing my book, I narrowed my focus to the fandoms rooted in one type of genre literature (Westerns), but these communities show many parallels to other literary fandoms. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Re-Living the American Frontier&lt;/em&gt; asks: why have the historic and mythic elements of the Old West exerted a global fascination for more than 200 years; how have fans used, understood, and repurposed stories and artifacts set in that historic world; and how did their fandoms alter over time, reflecting political and social change? My book discusses the differences and similarities in how white Americans and Europeans saw the West and Indigenous cultures, and the fan communities that they built around Western stories, particularly those of best-selling German author Karl May and Laura Ingalls Wilder. In both Germany and the U.S., Western historical narratives based on what was seen as the “inevitability” of white colonial settlement were once seen as “apolitical,” and were central to most white Americans’ understanding of their nation’s history. But over time, the American West was reevaluated and politically repurposed, seen and used very differently by authorities during the Nazi period in Germany, and in East Germany after 1945. During the late twentieth century, academic and popular understandings of the West changed again, as the violence of white settlement and displacement of Indigenous peoples became a flashpoint in culture wars in the United States, while Indigenous resurgence and activism affected European fans as well. In both the United States and Europe, popular understandings of the history of the West changed yet again, as Western fans negotiated and responded to a shifting cultural terrain, and the gradual decline in Westerns’ popularity. &lt;/p&gt;\n\n&lt;p&gt;Things you might be interested to ask about:&lt;/p&gt;\n\n&lt;p&gt;- The history of Western entertainments in the 19th and 20th centuries; the ways in which Western entertainments shaped white Americans’ understanding of their national identity and history; differences in how Germans and Americans understood Indigenous cultures; the biographies and fictional worlds of Karl May and Laura Ingalls Wilder, and the fan communities that formed around each author; the growth of Western historical reenactment in Germany before 1939;  how Western fans and reenactors had to adapt to very different political environments in Nazi Germany and East Germany; how new media forms, like blockbuster films, affected Western fandoms; how Indigenous activists engaged with, and sometimes challenged, white Western fans in both Germany and America; how Western fans in both nations have responded to changes in how academic historians and popular culture understand white colonial settlement of the West and its impact on Indigenous peoples; and why many East German Western reenactors chose to switch to Civil War reenactment after Germany’s reunification.&lt;/p&gt;\n\n&lt;p&gt;Things I might be able to answer but are outside my primary area of expertise:&lt;/p&gt;\n\n&lt;p&gt;- the history of other fandoms of genre fiction, particularly science fiction and the Sherlock Holmes stories; the global growth of varied forms of historical reenactment before and after World War II; how public history has expanded since 1945 to include varying forms of reenactment, including “living history,” open air museums, and experimental archeology; hobbyist historical reenactment.&lt;/p&gt;\n\n&lt;p&gt;Finally, if you are interested in a copy of &lt;em&gt;Re-Living the American Frontier,&lt;/em&gt; academic press books are expensive, but I can offer a discount code for mine. If you’re interested, go &lt;a href=\"https://www.uipress.uiowa.edu/books/9781609387907/re-living-the-american-frontier\"&gt;here&lt;/a&gt; and use the code FANS40: &lt;/p&gt;\n\n&lt;p&gt;Ok, enough intro text. Ask away!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/AskHistorians/comments/savz63/im_dr_nancy_reagin_author_of_reliving_the/",
  "subreddit": "AskHistorians",
  "id": "savz63",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hello r/AskHistorians [https://www.reddit.com/r/AskHistorians/], I’m Nancy\nReagin\n[https://dyson.pace.edu/sections/meet-the-faculty/faculty-profile/nreagin], a\nEuropean historian of gender and popular culture, and my most recent book is\nRe-living the American Frontier: Western Fandoms, Reenactment,…"
}