{
  "author": "ramjaz",
  "the_new_excerpt": "I've been seeing some well-written posts like this\n[https://www.reddit.com/r/stocks/comments/li0rpg/blackberry_a_dormant_giant/]\none and this as well\n[https://www.reddit.com/r/stocks/comments/lfuoe9/bb_is_not_a_phone_company_heres_some_dd/],\nas I'm sure you have as well. It seems like people are…",
  "original_created_utc": 1613157002,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我一直看到一些写得很好的帖子，比如这个。\n[https://www.reddit.com/r/stocks/comments/li0rpg/blackberry_a_dormant_giant/]\n其一，还有这个\n[https://www.reddit.com/r/stocks/comments/lfuoe9/bb_is_not_a_phone_company_heres_some_dd/]。\n我相信你也一样。看来人们...",
      "title": "为什么黑莓手机不是一只Meme股票？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直看到一些寫得很好的帖子，比如這個。\n[https://www.reddit.com/r/stocks/comments/li0rpg/blackberry_a_dormant_giant/]\n其一，還有這個\n[https://www.reddit.com/r/stocks/comments/lfuoe9/bb_is_not_a_phone_company_heres_some_dd/]。\n我相信你也一樣。看來人們...",
      "title": "爲什麼黑莓手機不是一隻Meme股票？"
    }
  ],
  "title": "Why BlackBerry is NOT a Meme Stock",
  "created_utc": 1613161497,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been seeing some well-written posts like <a href=\"https://www.reddit.com/r/stocks/comments/li0rpg/blackberry_a_dormant_giant/\">this</a> one and <a href=\"https://www.reddit.com/r/stocks/comments/lfuoe9/bb_is_not_a_phone_company_heres_some_dd/\">this as well</a>, as I&#39;m sure you have as well. It seems like people are finally starting to realize that BlackBerry, in fact, <strong>is NOT a meme stock.</strong></p>\n\n<p>You might ask, why is that? Well, here are a few of their partnerships and products that they&#39;re developing (and have <em>already</em> developed):</p>\n\n<p>- Partnership with Amazon: On December 1st, <a href=\"https://www.blackberry.com/us/en/company/newsroom/press-releases/2020/aws-blackberry-join-forces-to-accelerate-innovation-with-new-intelligent-vehicle-data-platform#:%7E:text=OverviewContact%20Us-,AWS%20and%20BlackBerry%20Join%20Forces%20to%20Accelerate,New%20Intelligent%20Vehicle%20Data%20Platform&amp;text=SEATTLE%2C%20WA%20and%20WATERLOO%2C%20ON,%2C%20Amazon%20Web%20Services%2C%20Inc.\">BB announced a multi-year agreement </a>with AWS, which is Amazon’s cloud service business. The agreement plans to develop and market BlackBerry&#39;s Intelligent Vehicle Data Platform, IVY. BlackBerry IVY is a scalable, cloud-connected software platform that will allow automakers to provide a consistent and secure way to read vehicle sensor data, normalize it, and create actionable insights from that data both locally in the vehicle and in the cloud. Automakers can use this information to create responsive in-vehicle services that enhance driver and passenger experiences.</p>\n\n<ul>\n<li>Partnership with Baidu: On January 25, BB announced the <a href=\"https://www.blackberry.com/us/en/company/newsroom/press-releases/2021/blackberry-expands-partnership-with-baidu-to-power-next-generation-autonomous-driving-technology\">expansion</a> of its strategic partnership with <a href=\"http://iv.baidu.com/\">Baidu</a>, whose high-definition maps will run on the <a href=\"https://blackberry.qnx.com/en/software-solutions/embedded-software/qnx-neutrino-rtos\">QNX® Neutrino® Real-time</a> Operating System (RTOS) and will be mass-produced in the forthcoming GAC New Energy Aion models from the EV arm of <a href=\"https://www.gac-motor.com/\">GAC Group</a> (Guangzhou Automobile Group Co., Ltd.). The milestones build on the company’s <a href=\"https://www.blackberry.com/us/en/company/newsroom/press-releases/2018/blackberry-and-baidu-partnering-to-accelerate-connected-and-autonomous-vehicle-technology\">January 2018</a> agreement to make BlackBerry QNX&#39;s industry-leading operating system (OS) the foundation for Baidu&#39;s ‘Apollo’ autonomous driving open platform.</li>\n<li>BlackBerry QNX: BlackBerry is entering into the auto industry by using their QNX real-time operating system that is already built into over 175 million vehicles today and is already being used by automakers like Audi, BMW, Subaru, Volkswagen, GM, Toyota, and Honda. NVIDIA is even building its AI self-driving platform off of BlackBerry’s QNX technology.</li>\n<li>BlackBerry IVY: <a href=\"https://www.fool.com/investing/2020/12/07/investors-overreacting-blackberry-deal-with-amazon/\">In addition to the QNX</a> Operating System, their partnership with AWS allows them to store all of this vehicle data through BlackBerry Ivy, which is a cloud-based software platform that allows these automakers to view data and insights for their vehicles.</li>\n<li>BlackBerry Spark: Another major service that BlackBerry offers is its Unified Endpoint Security, which is a comprehensive security approach to endpoint security that is essential to protect against and remediate cyber threats while providing visibility across all endpoints. Through their UES, they plan on improving <strong>cross-platform visibility, cyber threat prevention, and remediation,</strong> while <strong>simplifying administration.</strong></li>\n</ul>\n\n<p><strong>Okay, so why is this important?</strong></p>\n\n<ol>\n<li>BlackBerry QNX was created to expand and improve autonomous driving vehicles and is currently being used in over 175 <em>million</em> vehicles.</li>\n<li>BlackBerry IVY helps these automakers (Audi, BMW, Ford, etc) view data and insights on their vehicles. This means that if there is a recall on a vehicle, even like a problem with the sensors, <strong>the automakers can find that issue much faster and quite possibly even fix it through a software update.</strong></li>\n<li>They are REVOLUTIONIZING the automobile industry because of these two products. **In the future, we could see a shift from hardware-driven vehicles to software-defined vehicles.**</li>\n<li>Not only are they focusing on this, but they also have successfully created cybersecurity software that received the <strong>HIGHEST score in the industry for the Enterprise</strong> <a href=\"https://blogs.blackberry.com/en/2020/09/blackberry-achieves-highest-score-in-gartner-critical-capabilities-report-for-unmanaged-byo-use-case\"><strong>Unmanaged/BYO use case</strong></a><strong>.</strong></li>\n</ol>\n\n<p>Gartner Research (who published the study) even placed BlackBerry higher than VMWare, IBM, and MSFT basically signaling that their products and services are better than their competitors. In fact, NONE of BlackBerry&#39;s customers that use BlackBerry Guard were affected by the SolarWinds hack. And the stock price is still $12.</p>\n\n<p><strong>The Sobering Part of this DD:</strong></p>\n\n<p>After taking a look at their balance sheet, I can agree with the skeptics that they’re not raking in a ton of money right now, but anyone can see that their current balance sheet makes the company appear to be undervalued, especially when compared to their competitors.</p>\n\n<p>I mean, based on this information ALONE, the price of the stock should be much higher than it is right now. BlackBerry&#39;s current market cap is around $7 billion, with its competitors like Palantir, a software company that I’m sure you’ve heard other YouTubers talk about, hovering at 60 billion. And funny enough, Palantir is also focusing their software on electric vehicles and cybersecurity, just like BlackBerry. <strong>If BlackBerry had the same market cap as Palantir, its stock price would be $110.</strong></p>\n\n<p><strong>Final Thoughts:</strong></p>\n\n<p>Here’s what the skeptics don’t realize though. They don’t realize that BB is still very focused on product development and customer acquisition, and that boomers probably still think it’s a phone company. Well, it’s not.</p>\n\n<p>With their partnership with Amazon, Baidu, their UES and UEM product known as BlackBerry Spark, BlackBerry IVY, and their QNX operating system for vehicles, it seems like the market is not correctly pricing in BlackBerry’s <strong>future growth</strong>.</p>\n\n<p>Maybe one day if BlackBerry receives the same amount of hype that Palantir is getting right now, maybe then it’ll be taken much more seriously. <strong>But only, once people realize that it’s not a meme stock.</strong></p>\n</div><!-- SC_ON -->",
  "score": 220,
  "permalink": "/r/stocks/comments/lii8qa/why_blackberry_is_not_a_meme_stock/",
  "subreddit": "stocks",
  "id": "lii8qa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728623035
}