{
  "author": "Halflifefan123",
  "original_created_utc": 1645279629,
  "title": "I memorized my seed phrase",
  "created_utc": 1645299062,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I currently have a chunk of ETH and BTC in a hardware wallet, and have memorized the seed phrase. All physical copies of the seed phrase are destroyed. This money is now mine and no one else&amp;#39;s. I could be stripped of all my possessions, thrown in jail, declared an enemy of the state etc... but as long as I still remember that seed phrase the money is MINE. If that&amp;#39;s not the coolest way to store value in history I don&amp;#39;t know what is. Its like magic.&lt;/p&gt;\n\n&lt;p&gt;If anyone is wondering how I did this, I used a memory castle. This is a great thing to learn and not that hard. The core principle is to attach whatever you want to memorize to something in your long term memory. I just used my childhood home growing up. I take each seed word, and create a silly image of that thing in relation to some part of the home I grew up in. Then I can just imagine myself moving around my childhood home, and I see each of the seed words in relation to something I could never forget (The table my parents did taxes on, the entryway to the kitchen, the fireplace I sat next to in the wintertime etc etc.).&lt;/p&gt;\n\n&lt;p&gt;Cryptocurrency isn&amp;#39;t just a way to get rich. Its an incredibly powerful new technology. &lt;/p&gt;\n\n&lt;p&gt;EDIT: Well guys you were right... I was putting on my pants this morning and fell over due to the weight of my massive balls. I struck my head and now my seed phrase is lost forever. At least they can never take away my massive cock and balls. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 342,
  "permalink": "/r/CryptoCurrency/comments/swavd3/i_memorized_my_seed_phrase/",
  "subreddit": "CryptoCurrency",
  "id": "swavd3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I currently have a chunk of ETH and BTC in a hardware wallet, and have memorized\nthe seed phrase. All physical copies of the seed phrase are destroyed. This\nmoney is now mine and no one else's. I could be stripped of all my possessions,\nthrown in jail, declared an enemy of the state etc... but as…"
}