{
  "author": "BigDaddyJ_Stocks",
  "the_new_excerpt": "If anyone bought RKT thinking it would moon like I did, I hope you bought shares\nand not calls. If you bought calls, you are not alone. I went all in on calls.\nWhen I say all in, I mean I have less than $100 left in my bank account... all\nin. I don’t have a lot of money, but I truly believed RKT had…",
  "original_created_utc": 1620252266,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私のようにRKTが上昇すると思って買った人は、コールではなく株を買ったことを願っています。\nコールではなく株を買ったことを願う。コールを買った人は、あなただけではありません。私はコールに全力で取り組みました。\n全額投資と言っても、私の銀行口座には100ドル以下しか残っていませんが...全部です。\nでした。私は大金を持っていませんが、RKTが持っていると心から信じていました...",
      "title": "私の巨大なRKTのミス。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果有人像我一样买了RKT，认为它将上涨，我希望你买的是股票而不是看涨期权。\n而不是看涨期权。如果你买了看涨期权，你并不孤单。我全额买入了看涨期权。\n当我说全押时，我的意思是我的银行账户里只剩下不到100美元......全押。\n入。我没有很多钱，但我真的相信RKT有...",
      "title": "我的巨大RKT错误。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果有人像我一樣買了RKT，認爲它將上漲，我希望你買的是股票而不是看漲期權。\n而不是看漲期權。如果你買了看漲期權，你並不孤單。我全額買入了看漲期權。\n當我說全押時，我的意思是我的銀行賬戶裏只剩下不到100美元......全押。\n入。我沒有很多錢，但我真的相信RKT有...",
      "title": "我的巨大RKT錯誤。"
    }
  ],
  "title": "My giant RKT mistake.",
  "created_utc": 1620271981,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If anyone bought RKT thinking it would moon like I did, I hope you bought shares and not calls. If you bought calls, you are not alone. I went all in on calls. When I say all in, I mean I have less than $100 left in my bank account... all in. I don’t have a lot of money, but I truly believed RKT had to go up. I had $17,000 (my entire savings + checking) in calls and I’m sure tomorrow they will be practically worthless. I have a baby coming in 3 weeks and now I have to tell my wife I lost all our money. After I had done fairly well the past few months on stocks, she was confident in me and allowed me to do this. I still believe RKT is a great company and their results are incredible. I still believe it’s hugely undervalued. But none of that matters now. I’ve learned a very hard lesson and will never buy calls again, and will probably leave the market alone for quite a while completely while I try to get back on my feet. I was so confident in RKT I didn’t see it as a gamble, but it was all along. And I lost it all. I realize for most of you on here $17,000 isn’t a lot. But for me it was. It was literally everything.  I know I made a mistake so please save the harsh words.  I feel terrible enough already.</p>\n\n<p>Edit: yes I recommended others buy shares and not calls. Because I realized I made a huge mistake and was trying to convince other people not to gamble like I did. I saw the price action and realized the calls were screwed</p>\n</div><!-- SC_ON -->",
  "score": 2043,
  "permalink": "/r/wallstreetbets/comments/n5rw9o/my_giant_rkt_mistake/",
  "subreddit": "wallstreetbets",
  "id": "n5rw9o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380972000
}