{
  "author": "jam-hay",
  "original_created_utc": 1658912988,
  "title": "Crypto/ blockchain is now in the phase where everyone has heard of it but no one realises that one day they'll wonder how they lived without it.",
  "created_utc": 1658961350,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sub seems to have been infiltrated way too much cynical Anti-Crypto sentiment these days.. so some positive for balance.&lt;/p&gt;\n\n&lt;p&gt;Good or bad crypto is now as big a part of the mainstream conversation as its ever been. These days it&amp;#39;s hard to find someone who hasn&amp;#39;t heard of cryptocurrency and blockchain technology. &lt;/p&gt;\n\n&lt;p&gt;Its a bit like the birth of the internet.. many just assumed it was only for the youth of society.. wasting their time on it playing games.These days if the WiFi drops out for 5mins people lose their shit.&lt;/p&gt;\n\n&lt;p&gt;When manufacturers dropped physical buttons from cellphones and replaced them with touch screens.. many rubbished the concept and clung on to any phone they with physical buttons they could press.. these days any form of of too many physical buttons seems to unstylish and an annoyance to many.&lt;/p&gt;\n\n&lt;p&gt;Crypto/ blockchain tech is currently in that same transitional phase where it&amp;#39;s now the labels tagged to it are now mainstream but many are still cynical and don&amp;#39;t fully realise that that it will become a another future technology that wasn&amp;#39;t fully understood and underrated that civilisations just won&amp;#39;t be able to live without.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/w99tw9/crypto_blockchain_is_now_in_the_phase_where/",
  "subreddit": "CryptoCurrency",
  "id": "w99tw9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Sub seems to have been infiltrated way too much cynical Anti-Crypto sentiment\nthese days.. so some positive for balance.\n\nGood or bad crypto is now as big a part of the mainstream conversation as its\never been. These days it's hard to find someone who hasn't heard of\ncryptocurrency and blockchain…"
}