{
  "author": "jam-hay",
  "original_created_utc": 1658912988,
  "title": "Crypto/ blockchain is now in the phase where everyone has heard of it but no one realises that one day they'll wonder how they lived without it.",
  "created_utc": 1658961350,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sub seems to have been infiltrated way too much cynical Anti-Crypto sentiment these days.. so some positive for balance.&lt;/p&gt;\n\n&lt;p&gt;Good or bad crypto is now as big a part of the mainstream conversation as its ever been. These days it&amp;#39;s hard to find someone who hasn&amp;#39;t heard of cryptocurrency and blockchain technology. &lt;/p&gt;\n\n&lt;p&gt;Its a bit like the birth of the internet.. many just assumed it was only for the youth of society.. wasting their time on it playing games.These days if the WiFi drops out for 5mins people lose their shit.&lt;/p&gt;\n\n&lt;p&gt;When manufacturers dropped physical buttons from cellphones and replaced them with touch screens.. many rubbished the concept and clung on to any phone they with physical buttons they could press.. these days any form of of too many physical buttons seems to unstylish and an annoyance to many.&lt;/p&gt;\n\n&lt;p&gt;Crypto/ blockchain tech is currently in that same transitional phase where it&amp;#39;s now the labels tagged to it are now mainstream but many are still cynical and don&amp;#39;t fully realise that that it will become a another future technology that wasn&amp;#39;t fully understood and underrated that civilisations just won&amp;#39;t be able to live without.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/w99tw9/crypto_blockchain_is_now_in_the_phase_where/",
  "subreddit": "CryptoCurrency",
  "id": "w99tw9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Sub seems to have been infiltrated way too much cynical Anti-Crypto sentiment\nthese days.. so some positive for balance.\n\nGood or bad crypto is now as big a part of the mainstream conversation as its\never been. These days it's hard to find someone who hasn't heard of\ncryptocurrency and blockchain…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Subは、あまりにも多くのシニカルなAnti-Cryptoの感情に浸透しているようです。\nので、バランスを取るためにいくつかの肯定的な。\n\n暗号の良し悪しは別として、暗号は今や主流の会話の一部になっています。\nになっています。最近では、暗号通貨やブロックチェーンを知らない人を見つけるのは難しいです。\n暗号通貨とブロックチェーンを知らない人はいないでしょう...",
      "title": "暗号／ブロックチェーンは、誰もが聞いたことがあるけれど、ある日突然、それがなかったらどうやって生きていたのだろう、と思うようなフェーズに誰も気づいていないのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "子似乎被渗透了太多愤世嫉俗的反Crypto情绪\n这些天来......所以一些积极的平衡。\n\n不管是好是坏，加密货币现在都是主流对话的一部分，因为它是\n的一部分。这些天来，很难找到一个没有听说过\n加密货币和区块链...",
      "title": "加密货币/区块链现在处于这样一个阶段：每个人都听说过它，但没有人意识到，有一天他们会怀疑没有它他们是如何生活的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "子似乎被滲透了太多憤世嫉俗的反Crypto情緒\n這些天來......所以一些積極的平衡。\n\n不管是好是壞，加密貨幣現在都是主流對話的一部分，因爲它是\n的一部分。這些天來，很難找到一個沒有聽說過\n加密貨幣和區塊鏈...",
      "title": "加密貨幣/區塊鏈現在處於這樣一個階段：每個人都聽說過它，但沒有人意識到，有一天他們會懷疑沒有它他們是如何生活的。"
    }
  ]
}