{
  "author": "pseudoHappyHippy",
  "the_new_excerpt": "Someone in the daily said they couldn't wrap their mind around stop limit\norders, so I replied to them with what ended up being a rather massive\nexplanation for the 3 types of orders in the post title. I think a lot of\nbeginners (both in the stock market and crypto) struggle with these concepts,…",
  "original_created_utc": 1613869186,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "有人在日报上说，他们无法理解涨停板限制的问题\n命令，所以我回复了他们一个相当庞大的。\n帖子标题中对3种订单的解释。我想很多\n初学者（无论是在股市还是加密技术）都在为这些概念而苦恼，...",
      "title": "限价单、止损单、止盈单的新手指南"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有人在日報上說，他們無法理解漲停板限制的問題\n命令，所以我回復了他們一個相當龐大的。\n帖子標題中對3種訂單的解釋。我想很多\n初學者（無論是在股市還是加密技術）都在爲這些概念而苦惱，...",
      "title": "限價單、止損單、止盈單的新手指南"
    }
  ],
  "title": "A beginner's guide to limit orders, stop orders, and stop limit orders",
  "created_utc": 1613889576,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Someone in the daily said they couldn&#39;t wrap their mind around stop limit orders, so I replied to them with what ended up being a rather massive explanation for the 3 types of orders in the post title. I think a lot of beginners (both in the stock market and crypto) struggle with these concepts, so I thought I would post the entire explanation as a guide. So, here it is!</p>\n\n<p>Ok, so there are <strong>limit orders</strong>, <strong>stop orders</strong>, and <strong>stop-limit orders</strong>. The third one combines the concepts of the first two.</p>\n\n<p>Let&#39;s start with a sell <strong>limit order.</strong> Perhaps you hold a bunch of some asset currently at $1. You decide that if it hits $1.50, you want to sell. So you make a limit sell order. This is simply an order that will be automatically triggered at the first opportunity to sell at or above the limit price you chose, $1.50. It will only fill if you can get a price equal to or better than the limit price. You&#39;re basically publishing an offer to the world, saying &quot;if ever anyone wants to buy at $1.50 or higher, I am down, and my computer will automatically do the trade with you&quot;.</p>\n\n<p>But imagine you also want to automatically sell if it gets to $0.50 or lower, because you believe that would indicate free fall and you&#39;d want to just cut your losses. A sell limit order wouldn&#39;t work here, because a limit order is triggered so long as it can be filled at the limit price or better. So, if you set a sell limit for $0.50 while the price is currently $1.00, it would be instantly triggered and your position would be sold at $1.00, because $1.00 satisfies the condition of being equal to or better than the $0.50 limit price. So, this doesn&#39;t do what you want. That&#39;s were stop orders (aka stop-losses) come in. A <strong>stop order</strong> will trigger a sell at the best available market price once the stop price has been reached. So, if you set the stop price to $0.50, then once the market price passes below that threshold, your position will be sold at the best available market price in that moment (which will usually be very very close to the stop price you set).</p>\n\n<p>So, here is the difference between a limit order and a stop order: in a limit order, the limit price is just a threshold above which you will accept a trade and below which you will not. It&#39;s basically like an open offer to sell at some price. With a stop order, the stop price is not a threshold below which you will accept a trade. Instead, it is a trigger: once the market price passes your stop price, then your position will be sold instantly to the highest bidder in that moment.</p>\n\n<p>Now, this means that usually your position will be sold basically right at the stop price (or very close, like $0.4998), because if your position is being sold to the highest bidder the moment the price touches your stop price, the highest bidder will basically be buying at the stop price. However, there are exceptions.</p>\n\n<p>For example, in the stock market, there is after-hours trading when you can&#39;t trade, but special people can. Now, imagine the day closes with the price at $0.55, and your stop price is $0.50. During after hours, a bunch of whales dump the stock, and by open tomorrow morning, it is at $0.20. Your stop loss will be instantly triggered and you will sell at $0.20, not $0.50 like you wanted. This is because the triggering event of the market price passing your stop price happened (during after hours), so the position was sold at the earliest possible time at the highest available price, which happened to be at market open the next day at $0.20.</p>\n\n<p>Another example is this: imagine a gigantic whale decides to sell an absurd amount of your crypto just a tiny bit above your stop loss price, at like $0.501. This triggers a massive selloff and the price drops off a cliff. It therefore drops past your stop price, so automatically you get in line to sell at the highest available price. But the demand to buy at $0.50 has already come and gone, and there aren&#39;t enough buyers to keep up with the sellers, so by the time your transaction actually gets filled, it ends up being at $0.45, not $0.50. This is called price slippage, by the way.</p>\n\n<p>A third example: imagine your exchange goes down for 10 minutes when the price is at $0.52, but once it comes back 10 minutes later, the price is at $0.25, since other exchanges were running during those 10 minutes. Now your stop order will be filled at $0.25. Not ideal.</p>\n\n<p>This finally brings us to the <strong>stop limit.</strong> The stop limit combines both limit orders and stop losses. They require that you specify two prices: the stop price, and the limit price. If the market price passes the stop price, that triggers the creation of a limit order with the limit price you specified. Let&#39;s consider a couple cases where you might want to use this.</p>\n\n<p>Let&#39;s say, like before, you believe if the price gets as low as $0.50, then that signals that you need to exit. However, you are definitely not willing to sell below $0.30. You would rather just hold and hope it recovers one day than sell that low. So, you make a stop limit order where the stop price is $0.50 and the limit price is $0.30. The moment the price gets as low as $0.50, the stop will be triggered, which will then create a limit order whose limit price is $0.30. So, the stop price is the trigger to decide you want to make a sell offer, and the limit price is the lowest you are willing to sell for once the stop trigger actually happens. 99% of the time, this stop limit order will mean you end up selling basically right at $0.50, just like the stop order we talked about earlier. Once the stop price is passed, your limit order will be created for $0.30, which will immediately be filled at like $0.499, because that is the current price, and it satisfies the condition of the limit order, which is to sell at or above the limit price of $0.30. However, in the off-chance that your stop price is triggered at $0.50, but the price then somehow teleports down to $0.25 (after hours trading, price slippage, or your exchange going down) then your position would not be sold, because the price is below the limit price you set. If the price eventually recovered to $0.30, your position would then be sold at that price, if you hadn&#39;t cancelled it by then.</p>\n\n<p>Another use case would be this. Say, once again, you believe that if the price drops below $0.50, that is a red flag that you should exit your position. However, you believe that if it does get that low, there is a very good chance that there will be a dead cat bounce (where something makes a short-lived partial recovery while it is in its death throes). You bet that, if this coin gets as low as $0.50, it will briefly make it back up to $0.70 before crashing fully and dying. So, you make a stop limit order with $0.50 stop price, and a $0.70 limit price. If ever the price gets as low as $0.50, you will now automatically publish an offer to sell at $0.70 (ie: a limit order with $0.70 limit price will be created). If the price now rebounds up to $0.70 like you thought it would, your order will be filled and you will sell at $0.70. If it doesn&#39;t end up rebounding that high, your order won&#39;t be filled, and you&#39;ll end up holding. It&#39;s like saying &quot;I believe if we go as low as $0.50, that&#39;s a good indication we are crashing hard, so I will try to exit at $0.70 shortly thereafter during a bounce, but if I can&#39;t get that good of a deal, I guess I&#39;ll just hold and hold and hope it recovers one day&quot;.</p>\n\n<p>So, in summary: A <strong>limit order</strong> is an open offer to sell at a certain price or better that you publish to the market. A <strong>stop order</strong> is a trigger threshold, which, if passed, means your position will be sold ASAP at current market price. A <strong>stop limit order</strong> is a trigger threshold, which, if passed, creates a limit order.</p>\n\n<p>Finally, I want to note that all these examples have to do with selling, but these types of orders exist for buying as well. It works the same way, but everything is flipped. For example, if you want to buy a coin, but only if it dips below $0.25 so that it&#39;s affordable to you, then you would make a limit buy order with $0.25 as the limit price, and you would automatically buy that position if ever someone is willing to sell at that price (ie: the market price dips that low). </p>\n\n<p>I hope this helps somebody!</p>\n</div><!-- SC_ON -->",
  "score": 3504,
  "permalink": "/r/CryptoCurrency/comments/lolbo6/a_beginners_guide_to_limit_orders_stop_orders_and/",
  "subreddit": "CryptoCurrency",
  "id": "lolbo6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332877496
}