{
  "author": "scrappy_and_sundry",
  "the_new_excerpt": "There are nearly 3 million members here. It's gotten to the point that people\nact like having been involved in crypto for a few weeks counts as proof of\nexperience. Truth is if you let yourself trust the advice of strangers with a\ncouple hundred invested in crypto you'd be just as well off trusting…",
  "original_created_utc": 1621200739,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここには300万人近い会員がいます。侵略されたかのように振る舞う人もいるほどです。\n数週間暗号に関わっただけで、経験の証明になるような行動をとる人もいます。\n経験していることの証明になるような行動をとる人もいるほどです。実際のところ、暗号に数百ドルしか投資していない見知らぬ人のアドバイスを信用してしまうと\n実際のところ、暗号に数百ドル投資しただけの他人のアドバイスを信用するなら、あなたは...",
      "title": "Redditorsの「ディップを買え」という言葉に耳を傾けるのは、マジック8ボールを使うのと同じくらい責任があります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这里有近300万名会员。它已经到了这样的地步，人们\n好像参与了几周的加密货币就能证明自己的能力。\n经验。事实是，如果你让自己相信陌生人的建议，并有一个\n如果你让自己相信那些只投资了几百块钱的陌生人的建议，你就会像相信...",
      "title": "听从Rdditors告诉你 \"买跌\"，就像使用神奇的8号球一样负责。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏有近300萬名會員。它已經到了這樣的地步，人們\n好像參與了幾周的加密貨幣就能證明自己的能力。\n經驗。事實是，如果你讓自己相信陌生人的建議，並有一個\n如果你讓自己相信那些只投資了幾百塊錢的陌生人的建議，你就會像相信...",
      "title": "聽從Rdditors告訴你 \"買跌\"，就像使用神奇的8號球一樣負責。"
    }
  ],
  "title": "Listening to redditors telling you to \"buy the dip\" is just as responsible as using a magic 8 ball",
  "created_utc": 1621216150,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There are nearly 3 million members here. It&#39;s gotten to the point that people act like having been involved in crypto for a few weeks counts as proof of experience. Truth is if you let yourself trust the advice of strangers with a couple hundred invested in crypto you&#39;d be just as well off trusting a coin toss. </p>\n\n<p>&#x200B;</p>\n\n<p>Everyone telling you that this &quot;dip&quot; is a money-making opportunity doesn&#39;t have any special knowledge. They told you to buy the tip a week ago too and guess what, it&#39;s even lower now. This isn&#39;t part of a normal market cycle that can be easily extrapolated. There is blatant manipulation by one of the richest people in the world. No one can say what will happen next. Maybe it&#39;ll rocket up this week. Maybe it&#39;ll crash down. The only real advice is to know your own risk tolerance and make your own decisions based on that. No one knows what comes next.</p>\n</div><!-- SC_ON -->",
  "score": 785,
  "permalink": "/r/CryptoCurrency/comments/ndyj6x/listening_to_redditors_telling_you_to_buy_the_dip/",
  "subreddit": "CryptoCurrency",
  "id": "ndyj6x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590799667
}