{
  "author": "Diatery",
  "original_created_utc": 1626990381,
  "title": "Does the Algo really have their crypto investors best interests?",
  "created_utc": 1627011363,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I see a lot of posts on here bullish about ALGO for cited reasons such as &quot;they&#39;re working on CDBCs&quot; as if thats going to cause a parabolic jump to Algo&#39;s price.  </p>\n\n<p>What I see this too often is this false correlation that you are investing in something that will surge as more countries launch their CDBCs with Algo:</p>\n\n<ol>\n<li>When Algo wins big government contracts, that doesnt necessarily affect their market cap. There is a separate &quot;non-profit&quot; Foundation corporation that puts that money off chain. The foundation has a history of closing deals without requiring the payment to be made by buying Algo.<br/></li>\n</ol>\n\n<p>I put non-profit in quotes because, like many other non-profits, that doesnt mean they dont pay themselves very well. The average salary at Algo is a respectable $130,000.  Yeah.</p>\n\n<ol>\n<li>When Algo created a CDBC for the Marshall Islands the price did not move for a) the above reason and b) because it didnt use the Algo mainnet. They instead deployed a fork and all the adoption benefits went off chain. (SOV).<br/></li>\n</ol>\n\n<p>Unless you work at the Foundation, youre not going to see a penny of that.  Those consulting fees will be paid with fiat off chain and the adoption is forked elsewhere.</p>\n\n<p>Algo&#39;s price seems to be driven entirely by the small transaction fees and speculative investors, half of which I have to question if they understand the above dynamics</p>\n\n<p>The maneuver that pissed me off is that Algo sold and trained the Marshall Islands how to install the &quot;SOV foundation&quot;, so not only does the alleged better future governance of Algo not impact the CDBC they installed but what they sold is a system of self sustaining cushy foundation jobs under the guise of digital currency progress</p>\n\n<p>None of the above is moving dollars into Algo. The foundation can sell all of this by making its clients pay for everything in Algo, but they choose not to.</p>\n\n<p>I&#39;m calling it like I see it</p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/opnw9v/does_the_algo_really_have_their_crypto_investors/",
  "subreddit": "CryptoCurrency",
  "id": "opnw9v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I see a lot of posts on here bullish about ALGO for cited reasons such as\n\"they're working on CDBCs\" as if thats going to cause a parabolic jump to Algo's\nprice.\n\nWhat I see this too often is this false correlation that you are investing in\nsomething that will surge as more countries launch their…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここでは、\"CDBCに取り組んでいる \"という理由でALGOを強気に評価する投稿が多く見られます。\n「CDBCに取り組んでいる」といった理由で、ALGOの価格がパラボリックに跳ね上がるかのような\n価格がパラボリックに跳ね上がるかのように。\n\n私が頻繁に目にするのは、自分が投資しているのは、将来的に何かになるという誤った相関関係です。\n投資しているという誤った相関関係です。",
      "title": "Algoは本当に暗号化された投資家に最善の利益をもたらすのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到这里有很多帖子都看好ALGO，所列举的理由包括\n\"他们正在开发CDBC\"，似乎这将导致Algo的价格出现抛物线式的跳跃。\n价格。\n\n我经常看到的是这种错误的关联性，即你正在投资于\n随着越来越多的国家推出他们的CDBC，你的投资将激增。",
      "title": "Algo是否真的为他们的加密货币投资者带来最大利益？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到這裏有很多帖子都看好ALGO，所列舉的理由包括\n\"他們正在開發CDBC\"，似乎這將導致Algo的價格出現拋物線式的跳躍。\n價格。\n\n我經常看到的是這種錯誤的關聯性，即你正在投資於\n隨着越來越多的國家推出他們的CDBC，你的投資將激增。",
      "title": "Algo是否真的爲他們的加密貨幣投資者帶來最大利益？"
    }
  ]
}