{
  "author": "driftylemon",
  "original_created_utc": 1637418462,
  "title": "How do you deal with friends that cancel plans last minute and don't come up with an alternative date?",
  "created_utc": 1637433275,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This isn&#39;t everyone I know. I have friends that stick to plans. If they have to cancel they will give a reason and then come up with a plan to meet up another time instead.</p>\n\n<p>However, I also have these other friends. They either cancel plans last minute (1h before meeting up) or they message back the next day saying &#39;oh so sorry, I was really busy&#39;.</p>\n\n<p>How do you deal with these friends? </p>\n\n<p>I used to say &#39;oh no worries&#39; when these types cancelled on me. My new thing is to straight up ignore them. </p>\n\n<p>Flakey friend: &#39;sorry can&#39;t make it tonight after all&#39;</p>\n\n<p>Me:</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/qy6o24/how_do_you_deal_with_friends_that_cancel_plans/",
  "subreddit": "TooAfraidToAsk",
  "id": "qy6o24",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This isn't everyone I know. I have friends that stick to plans. If they have to\ncancel they will give a reason and then come up with a plan to meet up another\ntime instead.\n\nHowever, I also have these other friends. They either cancel plans last minute\n(1h before meeting up) or they message back the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは私が知っている全員ではありません。私の友人には、計画に忠実な人がいます。もし、キャンセルしなければならないなら\n理由を言って、その代わりに別の日に会う計画を立ててくれます。\nしてくれます。\n\nしかし、私には他の友人もいます。彼らは直前になって予定をキャンセルするか\n(1時間前にキャンセルしたり、メッセージを返してきたりします。",
      "title": "直前になって予定をキャンセルし、代わりの日を用意してくれない友人にはどう対処しますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这并不是我认识的每个人。我有一些坚持计划的朋友。如果他们不得不\n他们会给出一个理由，然后想出一个计划，在另一个时间见面。\n时间来代替。\n\n然而，我也有其他朋友。他们要么在最后一分钟取消计划\n(见面前1小时)，或者他们给我发回信息，说我不在。",
      "title": "你如何处理那些在最后一分钟取消计划，又不提出替代日期的朋友？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這並不是我認識的每個人。我有一些堅持計劃的朋友。如果他們不得不\n他們會給出一個理由，然後想出一個計劃，在另一個時間見面。\n時間來代替。\n\n然而，我也有其他朋友。他們要麼在最後一分鐘取消計劃\n(見面前1小時)，或者他們給我發回信息，說我不在。",
      "title": "你如何處理那些在最後一分鐘取消計劃，又不提出替代日期的朋友？"
    }
  ]
}