{
  "author": "ElectricalElevator24",
  "original_created_utc": 1624809129,
  "title": "HELP",
  "created_utc": 1624826283,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ever since I saw the adoption of bitcoin in El Zonte (a small town in El Salvador) I&#39;ve thought about how great it would be if Bitcoin would get adopted in small towns all over the world. Small towns tend to have less money but with the adoption of bitcoin into their small towns, the small town&#39;s wealth would grow (assuming the price of Bitcoin goes up).</p>\n\n<p>Based on videos I&#39;ve seen on youtube on El Zontes citizens and bitcoin some people say they&#39;ve made money just from holding and others say they&#39;ve lost money, which is no surprise because of its volatility.</p>\n\n<p>I&#39;m very optimistic about Bitcoin, so I truly believe that any town with its own bitcoin economy will see substantial returns from just owning some bitcoin.</p>\n\n<p>My main point is, id like to introduce bitcoin to a small town in Mexico, I own a couple of acres of land in this town and own a couple of mini shops that people rent out to me every month.</p>\n\n<p>This place has a mix of both elderly and youth and they all have access to smartphones.</p>\n\n<p>If I were to put all my time and energy into introducing Bitcoin into this small town in Mexico, how would I do it?</p>\n\n<p>Where do I start?</p>\n</div><!-- SC_ON -->",
  "score": 171,
  "permalink": "/r/Bitcoin/comments/o8zpg4/help/",
  "subreddit": "Bitcoin",
  "id": "o8zpg4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Ever since I saw the adoption of bitcoin in El Zonte (a small town in El\nSalvador) I've thought about how great it would be if Bitcoin would get adopted\nin small towns all over the world. Small towns tend to have less money but with\nthe adoption of bitcoin into their small towns, the small town's…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "エル・ゾンテ（エルサルバドルの小さな町）でビットコインが採用されたのを見て以来、ビットコインが採用されたらどんなに素晴らしいだろうと考えていました。\nエルゾンテ（エルサルバドルの小さな町）でビットコインが採用されたのを見て以来、世界中の小さな町でビットコインが採用されたらどんなに素晴らしいだろうと考えていました。\n世界中の小さな町でビットコインが採用されたらどんなにいいだろうと思いました。小さな町はお金が少ない傾向にありますが\nその小さな町にビットコインが導入されることで、小さな町の...",
      "title": "HELP"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自从我看到比特币在El Zonte（萨尔瓦多的一个小镇）被采用后，我就一直在想，如果比特币能被采用，那该多好。\n我一直在想，如果比特币能在全世界的小镇上被采用，那该有多好。\n世界各地的小城镇都能采用比特币，那该有多好。小镇的钱往往比较少，但是随着\n比特币被采用到他们的小镇，小镇的...",
      "title": "帮助"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自從我看到比特幣在El Zonte（薩爾瓦多的一個小鎮）被採用後，我就一直在想，如果比特幣能被採用，那該多好。\n我一直在想，如果比特幣能在全世界的小鎮上被採用，那該有多好。\n世界各地的小城鎮都能採用比特幣，那該有多好。小鎮的錢往往比較少，但是隨着\n比特幣被採用到他們的小鎮，小鎮的...",
      "title": "幫助"
    }
  ]
}