{
  "author": "dado3",
  "original_created_utc": 1624381471,
  "title": "If you weren't checking the prices constantly, you completely missed today's \"crash.\" Take a walk.",
  "created_utc": 1624401448,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The title pretty much sums it up. We are currently at 0.0% change in the price of BTC over the last 24 hours. If you weren&#39;t currently obsessing over your portfolio, you wouldn&#39;t even know anything happened at all.</p>\n\n<p>Avoid the stress and headaches that come with the ups and downs of crypto. Do yourself a favor, take a deep breath and take a walk outside, engage with friends and family, etc.</p>\n\n<p>Enjoy the rest of your day.</p>\n</div><!-- SC_ON -->",
  "score": 198,
  "permalink": "/r/CryptoCurrency/comments/o5rxaa/if_you_werent_checking_the_prices_constantly_you/",
  "subreddit": "CryptoCurrency",
  "id": "o5rxaa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The title pretty much sums it up. We are currently at 0.0% change in the price\nof BTC over the last 24 hours. If you weren't currently obsessing over your\nportfolio, you wouldn't even know anything happened at all.\n\nAvoid the stress and headaches that come with the ups and downs of crypto.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルに集約されていますね。現在、過去24時間のBTC価格の変化は0.0%です。\n過去24時間のBTCの価格変化は0.0%です。もしあなたが現在、自分のポートフォリオに執着していなければ\nポートフォリオに執着していなければ、何が起こったのかさえ全く分からないでしょう。\n\ncryptoの浮き沈みに伴うストレスや頭痛を避けましょう....",
      "title": "常に価格をチェックしていなければ、今日の \"暴落 \"を完全に見逃してしまう。散歩しましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个标题几乎概括了一切。目前，我们的价格在过去24小时内的变化为0.0\n在过去24小时内，BTC的价格变化为0.0%。如果你目前不是在纠结于你的\n投资组合，你甚至都不知道发生了什么。\n\n避免因加密货币的起伏而带来的压力和头疼....",
      "title": "如果你没有不断查看价格，你完全错过了今天的 \"暴跌\"。走一走吧。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個標題幾乎概括了一切。目前，我們的價格在過去24小時內的變化爲0.0\n在過去24小時內，BTC的價格變化爲0.0%。如果你目前不是在糾結於你的\n投資組合，你甚至都不知道發生了什麼。\n\n避免因加密貨幣的起伏而帶來的壓力和頭疼....",
      "title": "如果你沒有不斷查看價格，你完全錯過了今天的 \"暴跌\"。走一走吧。"
    }
  ]
}