{
  "author": "Eastern_Bobcat8336",
  "original_created_utc": 1637879058,
  "title": "Which cryptocurrency will win the privacy race?",
  "created_utc": 1637926515,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I believe in a persons right to privacy. Even if you have nothing to hide, you still have the fundemental right of privacy as a human being when it comes to your finances for example.</p>\n\n<p>Multiple cryptocurrencies are privacy focused. Monero, Dash and Zcash being the most well known. A lesser known example is BEAM. </p>\n\n<p>The urge to ban privacy focused crypto will most likely only become stronger...so which cryptocurrency would be most resilient and able to stay operational when such a thing happens in the near future?</p>\n\n<p>Furthermore, key factors to succeed as a viable currency, besides privacy features, are practicallity, development roadmap and user adoption for example.</p>\n\n<p>Update: I see a lot of support for Monero so far. Also some newer projects are gaining support, namely PirateChain (ARRR) and Secret Network (SCRT).</p>\n\n<p>TLDR: Which platform will become the winner in the privacy race in the long run according to you...and why?</p>\n</div><!-- SC_ON -->",
  "score": 171,
  "permalink": "/r/CryptoCurrency/comments/r2839z/which_cryptocurrency_will_win_the_privacy_race/",
  "subreddit": "CryptoCurrency",
  "id": "r2839z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I believe in a persons right to privacy. Even if you have nothing to hide, you\nstill have the fundemental right of privacy as a human being when it comes to\nyour finances for example.\n\nMultiple cryptocurrencies are privacy focused. Monero, Dash and Zcash being the\nmost well known. A lesser known…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、人のプライバシーの権利を信じています。たとえ何も隠していなくても\n人としての基本的なプライバシーの権利があります。\n例えば、自分の財務については、人間としての基本的なプライバシー権があります。\n\n複数の暗号通貨がプライバシーを重視しています。Monero、Dash、Zcashなどがよく知られています。\nよく知られています。あまり知られていませんが...",
      "title": "どの暗号通貨がプライバシー競争に勝つのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信一个人的隐私权。即使你没有什么可隐藏的，你\n当涉及到你的财务问题时，你仍然有作为一个人的基本隐私权。\n例如，你的财务状况。\n\n多种加密货币都注重隐私。Monero、Dash和Zcash是\n最知名的。一个不太知名的...",
      "title": "哪种加密货币将赢得隐私竞赛？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信一個人的隱私權。即使你沒有什麼可隱藏的，你\n當涉及到你的財務問題時，你仍然有作爲一個人的基本隱私權。\n例如，你的財務狀況。\n\n多種加密貨幣都注重隱私。Monero、Dash和Zcash是\n最知名的。一個不太知名的...",
      "title": "哪種加密貨幣將贏得隱私競賽？"
    }
  ]
}