{
  "author": "user02615211",
  "original_created_utc": 1631712827,
  "title": "I’m steadily accumulating BTC",
  "created_utc": 1631730644,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After losing most of my money listening to you tubers and and other pumpers. I stopped putting my money into sh**coins. I was stupid, but I’m glad I broke out of that hopium cycle 3 months ago. Cause i realized I was getting too attached to these coins and they would eventually crash themselves to nothing leaving me with worthless coins. Now I am committed to the BTC. I DCA and accumulate once I get more funds available. And I don’t worry about the price. Just throw it into an interest account. This has been the best crypto decision I have made.</p>\n\n<p>Just hope other naive people step away from the sh**coins and focus on real projects.</p>\n</div><!-- SC_ON -->",
  "score": 188,
  "permalink": "/r/Bitcoin/comments/poq7vc/im_steadily_accumulating_btc/",
  "subreddit": "Bitcoin",
  "id": "poq7vc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "After losing most of my money listening to you tubers and and other pumpers. I\nstopped putting my money into sh**coins. I was stupid, but I’m glad I broke out\nof that hopium cycle 3 months ago. Cause i realized I was getting too attached\nto these coins and they would eventually crash themselves to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ユーチューバーや他のポンパーの話を聞いて、ほとんどのお金を失ってしまった。I\nお金をコインに入れるのをやめました。私は愚かでしたが、私は脱獄してよかったです。\n3ヶ月前にホップのサイクルから抜け出せてよかったです。なぜなら、私はこれらのコインに執着しすぎていて\nこのコインに執着しすぎていて、最終的には暴落して...",
      "title": "順調にBTCを貯めています"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在听了你的盆友和其他抽水机后，我失去了大部分的钱。I\n我不再把我的钱投入到sh**币中。我很愚蠢，但我很高兴我打破了\n3个月前的希望循环。因为我意识到我太重视\n这些硬币，它们最终会自己崩溃...",
      "title": "我正在稳定地积累BTC"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在聽了你的盆友和其他抽水機後，我失去了大部分的錢。I\n我不再把我的錢投入到sh**幣中。我很愚蠢，但我很高興我打破了\n3個月前的希望循環。因爲我意識到我太重視\n這些硬幣，它們最終會自己崩潰...",
      "title": "我正在穩定地積累BTC"
    }
  ]
}