{
  "author": "justainsel",
  "the_new_excerpt": "I currently own 15 stocks. One of those stocks is AMC. The 14 others are a\ncombination of tech, EV, and weed stocks. Most high risk/high reward but a few\n“safe” bets such as AAPL, AMD, and NVDA.\n\nI bought AMC at $15.85 a couple of days before it tanked. I’ve been holding it\nhoping that it recovers…",
  "original_created_utc": 1612804602,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我目前拥有15只股票。其中一只股票是AMC。其他14只股票是\n科技、电动车、杂草股的组合。大多数高风险/高回报，但少数\n\"安全 \"的赌注，如AAPL、AMD和NVDA。\n\n几天前，我以15.85美元的价格买入了AMC，然后它就跌停了。我一直持有它\n希望它恢复...",
      "title": "我们应该在什么时候达成AMC在很长一段时间内看不到15.00美元的条件？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我目前擁有15只股票。其中一隻股票是AMC。其他14只股票是\n科技、電動車、雜草股的組合。大多數高風險/高回報，但少數\n\"安全 \"的賭注，如AAPL、AMD和NVDA。\n\n幾天前，我以15.85美元的價格買入了AMC，然後它就跌停了。我一直持有它\n希望它恢復...",
      "title": "我們應該在什麼時候達成AMC在很長一段時間內看不到15.00美元的條件？"
    }
  ],
  "title": "At what point should we come to terms that AMC won’t see $15.00 for a long while?",
  "created_utc": 1612819257,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I currently own 15 stocks.  One of those stocks is AMC.  The 14 others are a combination of tech, EV, and weed stocks.  Most high risk/high reward but a few “safe” bets such as AAPL, AMD, and NVDA.  </p>\n\n<p>I bought AMC at $15.85 a couple of days before it tanked.  I’ve been holding it hoping that it recovers to just break even, but I’m not too optimistic about that now.  I’m currently down 62%.</p>\n\n<p>I do ok picking the rest of my stocks.  Even with that clunker AMC, I am running at about an 18.5% gain across my entire portfolio</p>\n\n<p>So my question is this, should I dump AMC and reinvest the remainder in a better stock if I can average an 18.5% gain on this new stock?  I know at that percentage it will take me a while to recover the 62% I was down, but at least that money will be working for me than just sitting there wallowing in its redness.</p>\n</div><!-- SC_ON -->",
  "score": 232,
  "permalink": "/r/stocks/comments/lfgl6k/at_what_point_should_we_come_to_terms_that_amc/",
  "subreddit": "stocks",
  "id": "lfgl6k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123203751
}