{
  "author": "bradbenji",
  "the_new_excerpt": "I'm gonna keep this in a TLDR format because I don't want to bore people with\ninfo and a pointless story;\n\nI work at a branch in one of the biggest tax companies in the US. I made a post\n5 months ago about how back then nobody was talking about crypto even though I\nworked in a tax office and I was…",
  "original_created_utc": 1620236852,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、情報や無意味な話で人々を退屈させたくないので、TLDR形式にしておきます。\n情報や無意味な話で人を退屈させたくないからです。\n\n私はアメリカで最大の税理士法人の支店で働いています。5ヶ月前に投稿しました。\n5ヶ月前に、当時は誰も暗号について話していなかったという投稿をしました。\n税務署で働いていて、私は...",
      "title": "私は米国最大の税務サービス会社で働いていますが、今週の質問は暗号通貨についてでした...人々は気付き始めています。大規模な導入が始まる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我将以TLDR的形式来写，因为我不想用信息和无意义的故事来烦扰人们。\n信息和一个无意义的故事来烦扰人们。\n\n我在美国最大的税务公司之一的分公司工作。我发了一个帖子\n5个月前，我发了一个帖子，说当时没有人谈论加密货币，即使我在税务局工作，也没有人谈论加密货币。\n我在税务局工作，我是...",
      "title": "我在美国最大的税务服务公司之一工作......我们一周的问题是关于加密货币......人们开始注意到了! 大规模采用即将到来!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我將以TLDR的形式來寫，因爲我不想用信息和無意義的故事來煩擾人們。\n信息和一個無意義的故事來煩擾人們。\n\n我在美國最大的稅務公司之一的分公司工作。我發了一個帖子\n5個月前，我發了一個帖子，說當時沒有人談論加密貨幣，即使我在稅務局工作，也沒有人談論加密貨幣。\n我在稅務局工作，我是...",
      "title": "我在美國最大的稅務服務公司之一工作......我們一週的問題是關於加密貨幣......人們開始注意到了! 大規模採用即將到來!"
    }
  ],
  "title": "I Work At One of the Biggest Tax Service Companies in the US..and Our Question of the Week Was About Cryptocurrency...People Are Starting to Notice! Mass Adoption is Coming!",
  "created_utc": 1620250349,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m gonna keep this in a TLDR format because I don&#39;t want to bore people with info and a pointless story;</p>\n\n<p>I work at a branch in one of the biggest tax companies in the US. I made a post 5 months ago about how back then nobody was talking about crypto even though I worked in a tax office and I was estranged for trying to bring it up. Well, now, people are starting to notice and talk about it. One of the 70 year old ladies I work with even bought the book <em>Bitcoin for Dummies.</em> Mass adoption isn&#39;t coming, it&#39;s already here happening in real time.</p>\n\n<p>I truly believe we&#39;re still early, and we&#39;re going to be looking back at the technology and today&#39;s prices with an archaic attitude, but get ready people. Whatever implications you want to take from this, bullish or bearish signals, 2017-18 ptsd, whatever: know that every day people are starting to take notice and it&#39;s happening fast.</p>\n</div><!-- SC_ON -->",
  "score": 563,
  "permalink": "/r/CryptoCurrency/comments/n5lxpp/i_work_at_one_of_the_biggest_tax_service/",
  "subreddit": "CryptoCurrency",
  "id": "n5lxpp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380965852
}