{
  "author": "Chasekt98",
  "original_created_utc": 1632147567,
  "title": "Friend dropped out of college to day trade because he believes he can predict the charts using astrology.",
  "created_utc": 1632152619,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ive been completing nursing school with a good buddy of mine for a while now. We have one year left. Last year I got into crypto around christmas time and I told him about it too. He has taken this so much further than I ever thought. I like to stick to my guns and just accumulate and hodl. </p>\n\n<p>He is convinced that he can use astrology to predict the charts down to the cent and day with the moon. Yes, Astrology. </p>\n\n<p>He has since dropped out of school, and is basically committing all his time to astrology and the markets. </p>\n\n<p>Does anyone else think like this? Am I the crazy one? Or is he?</p>\n</div><!-- SC_ON -->",
  "score": 225,
  "permalink": "/r/Bitcoin/comments/prvukv/friend_dropped_out_of_college_to_day_trade/",
  "subreddit": "Bitcoin",
  "id": "prvukv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Ive been completing nursing school with a good buddy of mine for a while now. We\nhave one year left. Last year I got into crypto around christmas time and I told\nhim about it too. He has taken this so much further than I ever thought. I like\nto stick to my guns and just accumulate and hodl.\n\nHe is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は以前から仲の良い仲間と一緒に看護学校を修了しました。私たちは\nあと1年です。去年のクリスマスの頃に暗号にハマって、彼にも話したんだ。\n彼にもその話をしました。彼は私が考えていたよりもはるかにこれを取っている。私は\n私は自分の考えに忠実で、ただ蓄積していくだけです。\n\n彼は...",
      "title": "友人は大学を中退してデイトレードをしているが、それは占星術でチャートを予測できると信じているからだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和我的一个好伙伴一起完成护理学校的学习已经有一段时间了。我们\n还剩下一年时间。去年圣诞节前后，我开始接触加密货币，我也告诉了他。\n我也告诉了他这件事。他在这方面做得比我想象的要好得多。我喜欢\n坚持自己的观点，只是积累和积累。\n\n他是...",
      "title": "朋友从大学辍学去做日间交易，因为他相信自己能用占星术预测图表。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和我的一個好夥伴一起完成護理學校的學習已經有一段時間了。我們\n還剩下一年時間。去年聖誕節前後，我開始接觸加密貨幣，我也告訴了他。\n我也告訴了他這件事。他在這方面做得比我想象的要好得多。我喜歡\n堅持自己的觀點，只是積累和積累。\n\n他是...",
      "title": "朋友從大學輟學去做日間交易，因爲他相信自己能用占星術預測圖表。"
    }
  ]
}