{
  "author": "10z20Luka",
  "original_created_utc": 1649511692,
  "title": "How extensive was the purposeful destruction of foodstuffs during the Great Depression? Steinbeck paints a very severe picture.",
  "created_utc": 1649519447,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;“The works of the roots of the vines, of the trees, must be destroyed to keep up the price, and this is the saddest, bitterest thing of all. Carloads of oranges dumped on the ground. The people came for miles to take the fruit, but this could not be. How would they buy oranges at twenty cents a dozen if they could drive out and pick them up? &lt;strong&gt;And men with hoses squirt kerosene on the oranges,&lt;/strong&gt; and they are angry at the crime, angry at the people who have come to take the fruit. A million people hungry, needing the fruit- and kerosene sprayed over the golden mountains. And the smell of rot fills the country. &lt;strong&gt;Burn coffee for fuel in the ships. Burn corn to keep warm, it makes a hot fire. Dump potatoes in the rivers and place guards along the banks to keep the hungry people from fishing them out. Slaughter the pigs and bury them, and let the putrescence drip down into the earth.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;There is a crime here that goes beyond denunciation. There is a sorrow here that weeping cannot symbolize. There is a failure here that topples all our success. The fertile earth, the straight tree rows, the sturdy trunks, and the ripe fruit. And children dying of pellagra must die because a profit cannot be taken from an orange. And coroners must fill in the certificate- died of malnutrition- because the food must rot, must be forced to rot. The people come with nets to fish for potatoes in the river, and the guards hold them back; they come in rattling cars to get the dumped oranges, but the kerosene is sprayed. And they stand still and watch the potatoes float by, listen to the screaming pigs being killed in a ditch and covered with quick-lime, watch the mountains of oranges slop down to a putrefying ooze; and in the eyes of the people there is the failure; and in the eyes of the hungry there is a growing wrath. In the souls of the people the grapes of wrath are filling and growing heavy, growing heavy for the vintage.”&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;ve highlighted the relevant examples in bold; is Steinbeck describing a relatively common phenomenon? How much of this is poetic license?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 181,
  "permalink": "/r/AskHistorians/comments/tztfqc/how_extensive_was_the_purposeful_destruction_of/",
  "subreddit": "AskHistorians",
  "id": "tztfqc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "> “The works of the roots of the vines, of the trees, must be destroyed to keep\n> up the price, and this is the saddest, bitterest thing of all. Carloads of\n> oranges dumped on the ground. The people came for miles to take the fruit, but\n> this could not be. How would they buy oranges at twenty…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "> 「ぶどうの木の根の働き、木の働きは、維持するために破壊されなければならない。\n> これは最も悲しく、最も辛いことです。車一台分の\n> みかんが地面に捨てられている 人々はその果実を手に入れようと何キロもかけてやってきたが\n> これはありえないことです。どうやって二十歳でオレンジを買うんだ...。",
      "title": "世界恐慌時の食糧の意図的な廃棄は、どの程度の規模だったのでしょうか？スタインベックは非常にシビアな絵を描いている。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "> \"葡萄树根部的作品，树木的作品，必须被摧毁，以保持\n> 价格，这是最可悲、最痛苦的事情。一车一车的\n> 倾倒在地上的橙子。人们不远万里来取水果，但\n>这是不可能的。他们怎么会以二十元的价格买到橙子...",
      "title": "在大萧条期间，对食品的有目的的破坏有多大？斯坦贝克描绘了一幅非常严峻的画面。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> \"葡萄樹根部的作品，樹木的作品，必須被摧毀，以保持\n> 價格，這是最可悲、最痛苦的事情。一車一車的\n> 傾倒在地上的橙子。人們不遠萬里來取水果，但\n>這是不可能的。他們怎麼會以二十元的價格買到橙子...",
      "title": "在大蕭條期間，對食品的有目的的破壞有多大？斯坦貝克描繪了一幅非常嚴峻的畫面。"
    }
  ]
}