{
  "author": "Loomyduck",
  "original_created_utc": 1650361864,
  "title": "What are you supposed to do when your roommate brings two girls home. One of which he's sleeping with the other is just sitting here awkwardly?",
  "created_utc": 1650410570,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi. So I&amp;#39;d like to avoid joke answers like make a move or shit like that because it&amp;#39;s a pretty awkward situation right now. I&amp;#39;ve just gone out to get takeout for dinner for us. &lt;/p&gt;\n\n&lt;p&gt;But my roommate brought this girl over last night from Sydney. Slept with her and they&amp;#39;re going to he staying here for a few nights. She has a friend who I&amp;#39;ve made the guest room up for. I didn&amp;#39;t speak to her last night because it was 1 am when they came home. I just made the bed for her and that was it. &lt;/p&gt;\n\n&lt;p&gt;But it&amp;#39;s just so akward trying to make conversation with her while my roommate and this other girl are all over each other. She feels uncomfortable because I&amp;#39;m essentially a stranger and she&amp;#39;s staying with people she doesn&amp;#39;t know. While her friend is on a autumn fling. And I&amp;#39;m a little uncomfortable with situation because we can hear them/see them making out with each other. &lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;m just sitting here in a Nando&amp;#39;s parking lot trying to make the situation a little more comfortable.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/u71d63/what_are_you_supposed_to_do_when_your_roommate/",
  "subreddit": "NoStupidQuestions",
  "id": "u71d63",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi. So I'd like to avoid joke answers like make a move or shit like that because\nit's a pretty awkward situation right now. I've just gone out to get takeout for\ndinner for us.\n\nBut my roommate brought this girl over last night from Sydney. Slept with her\nand they're going to he staying here for a…"
}