{
  "author": "AlreadyLiberated",
  "the_new_excerpt": "Watching Doge’s epic pump today, and over the last weeks, I feel sad and\njealous. I’ve made a little money trading doge, but almost all my holdings are\nin Bitcoin and Eth, Ada and Algo.\n\nHow do you get over the sadness of missing out and the bitterness that the coins\nyou think are much stronger are…",
  "original_created_utc": 1620132340,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、そしてこの数週間、Dogeの壮大なパンプスを見ていると、悲しくて、そして羨ましくなってきます。\n嫉妬しています。私はDogeのトレードで少し儲けましたが、私の持ち株はほとんどすべて\nビットコインとイーサ、エイダとアルゴである。\n\n逃した悲しみと、ずっと強いと思っていたコインが...という苦しさをどう乗り越えればいいのでしょうか？\nまた、自分が強いと思っているコインが...",
      "title": "泣きたくなる人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天观看Doge的史诗泵，以及在过去几周里，我感到悲伤和\n妒忌。我在Doge交易中赚了一点钱，但我几乎所有的持仓都是\n在比特币和Eth，Ada和Algo。\n\n你如何克服错过的悲伤和痛苦？\n你认为更强大的硬币是...",
      "title": "还有人想哭吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天觀看Doge的史詩泵，以及在過去幾周裏，我感到悲傷和\n妒忌。我在Doge交易中賺了一點錢，但我幾乎所有的持倉都是\n在比特幣和Eth，Ada和Algo。\n\n你如何克服錯過的悲傷和痛苦？\n你認爲更強大的硬幣是...",
      "title": "還有人想哭嗎？"
    }
  ],
  "title": "Does anyone else just want to cry?",
  "created_utc": 1620153954,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Watching Doge’s epic pump today, and over the last weeks, I feel sad and jealous. I’ve made a little money trading doge, but almost all my holdings are in Bitcoin and Eth, Ada and Algo. </p>\n\n<p>How do you get over the sadness of missing out and the bitterness that the coins you think are much stronger are now stable coins, while Doge takes over the world? </p>\n\n<p>I know, I know, doge will tank and millions of suckers will be left holding the bag. But will it? And will they? Or are we the suckers?</p>\n</div><!-- SC_ON -->",
  "score": 605,
  "permalink": "/r/CryptoCurrency/comments/n4nh8x/does_anyone_else_just_want_to_cry/",
  "subreddit": "CryptoCurrency",
  "id": "n4nh8x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380964323
}