{
  "author": "Lindseytehbaker",
  "original_created_utc": 1636234098,
  "title": "Why do parents put so much pressure on their kids to have babies?",
  "created_utc": 1636251049,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>(On mobile sorry for formatting)</p>\n\n<p>I just don’t understand why parents are so pushy about having grandkids. It’s none of their business but they act like their kids owe them a grandchild. For me personally I don’t want to because I have two chronic illnesses that one or both will be passed on and I could never knowingly have a child that’s someday gonna come to me and tell me how they don’t feel good and that spirals into the same diagnoses that I have. My parents are so pushy and think that I’m still going to have at least one because “they will give your life purpose”. I feel like I have a lot of purpose without a kid. Anyone else’s parents do this?</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/TooAfraidToAsk/comments/qo9pww/why_do_parents_put_so_much_pressure_on_their_kids/",
  "subreddit": "TooAfraidToAsk",
  "id": "qo9pww",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "(On mobile sorry for formatting)\n\nI just don’t understand why parents are so pushy about having grandkids. It’s\nnone of their business but they act like their kids owe them a grandchild. For\nme personally I don’t want to because I have two chronic illnesses that one or\nboth will be passed on and I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "(携帯電話では、フォーマットの関係で申し訳ありません)\n\n親が孫を持てとせがむのは理解できない。自分には関係のないことなのに\n自分には関係のないことなのに、子供が自分に孫を作る義務があるかのように振る舞う。私にとっては\n私個人としては、2つの持病を抱えていて、どちらか、もしくは両方が遺伝するので、孫は欲しくありません。\n私の場合は、2つの持病を抱えているので、どちらか一方、または両方が遺伝すると思うと、産みたくないですね。",
      "title": "なぜ親は子供に子供を産めとプレッシャーをかけるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "(在手机上，对不起，格式问题)\n\n我只是不明白为什么父母对生孙子如此推崇。这\n这不关他们的事，但他们表现得好像他们的孩子欠他们一个孙子。对我来说\n我个人不想生，因为我有两种慢性病，一种或两种都会传给我。\n两者都会被遗传，而我...",
      "title": "为什么父母对他们的孩子施加如此大的压力，让他们生孩子？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "(在手機上，對不起，格式問題)\n\n我只是不明白爲什麼父母對生孫子如此推崇。這\n這不關他們的事，但他們表現得好像他們的孩子欠他們一個孫子。對我來說\n我個人不想生，因爲我有兩種慢性病，一種或兩種都會傳給我。\n兩者都會被遺傳，而我...",
      "title": "爲什麼父母對他們的孩子施加如此大的壓力，讓他們生孩子？"
    }
  ]
}