{
  "author": "DanielAPO",
  "the_new_excerpt": "Hi guys,\n\nI have been digging into GEO and I am here to know your opinion about it.\nDespite the high debt/equity ratio I performed a fundamental analysis and I\nthink this stock could have tremendous upward potential and a short squeeze\nseems inevitable. Hence, these are my reasons:\n\n• GEO is a REIT…",
  "original_created_utc": 1623975622,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n私はGEOを調べていて、それについての皆さんの意見を知りたいと思っています。\n負債比率が高いにもかかわらず、私はファンダメンタルズ分析を行い、この株には非常に大きな上昇の可能性があると考えています。\nこの株は非常に大きな上昇の可能性を秘めており、ショートスクイーズは避けられないと思います。\nショートスクイーズは避けられないと考えています。したがって、これらが私の理由です。\n\n- GEOはREITである...",
      "title": "なぜ私はGEOに強気なのか"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n我一直在研究GEO，我在这里想知道你们对它的看法。\n尽管债务/股权比率很高，但我进行了基本面分析，我认为这只股票可能有巨大的上升潜力，并有空头挤压。\n我认为这只股票可能有巨大的上升潜力，而且空头挤压\n似乎是不可避免的。因此，这些是我的理由。\n\n- GEO是一个房地产投资信托基金...",
      "title": "为什么我看涨GEO美元"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n我一直在研究GEO，我在這裏想知道你們對它的看法。\n儘管債務/股權比率很高，但我進行了基本面分析，我認爲這隻股票可能有巨大的上升潛力，並有空頭擠壓。\n我認爲這隻股票可能有巨大的上升潛力，而且空頭擠壓\n似乎是不可避免的。因此，這些是我的理由。\n\n- GEO是一個房地產投資信託基金...",
      "title": "爲什麼我看漲GEO美元"
    }
  ],
  "title": "Why I am Bullish on $GEO",
  "created_utc": 1623984874,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi guys,</p>\n\n<p>I have been digging into GEO and I am here to know your opinion about it. Despite the high debt/equity ratio I performed a fundamental analysis and I think this stock could have tremendous upward potential and a short squeeze seems inevitable. Hence, these are my reasons:</p>\n\n<p>• GEO is a REIT that invests in private prisons, mental health facilities, electronic tracking devices, and secure transportation.</p>\n\n<p>• This stock has an extremely low P/E ratio (6.32).</p>\n\n<p>• The Price/Book is near 3/4.</p>\n\n<p>• In the last four years the company is not diluting any shares.</p>\n\n<p>• The EBT Margin remains constant for a long time.</p>\n\n<p>• The management changed recently, and the insiders have been buying a high number of shares.</p>\n\n<p>• Despite it is a REIT so it must pay dividends, these dividends got cut to pay some debt.</p>\n\n<p>And here is where the things get interesting: The market price of the stock decreases 74% of its value since 2017, and it has a short ratio of 55% of the float. Also, there are only 800k stocks available to short. So, all the conditions seem to be met to a huge, short squeeze.</p>\n\n<p>I’m not a financial adviser and this is not financial advice so you should do your own diligence.</p>\n\n<p>Current position: 1000 shares @ 6.17$</p>\n</div><!-- SC_ON -->",
  "score": 49,
  "permalink": "/r/stocks/comments/o2bzws/why_i_am_bullish_on_geo/",
  "subreddit": "stocks",
  "id": "o2bzws",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009745415
}