{
  "author": "BlueHorizon87",
  "the_new_excerpt": "I'm looking for an app to replace Yahoo Finance. I've used Yahoo Finance for a\ncouple of years now, and although i generally do love it, i feel as though the\napp is really subpar to the website. It's missing out on a stock screener. I'm\nalso not to keen on their portfolio manager, i can't see where…",
  "original_created_utc": 1623478775,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ヤフーファイナンスに代わるアプリを探しています。数年前からYahoo Financeを使用しています。\n使っていますが、アプリはウェブサイトに比べて劣っているように感じます。\nアプリはウェブサイトに比べて本当に劣っていると感じています。ストックスクリーナーがありません。私は\nまた、ポートフォリオマネージャーにも興味がありません。",
      "title": "株式スクリーニング機能とポートフォリオ・マネージャーを備えた、最高のAndroid金融アプリはどれですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在寻找一个应用程序来取代雅虎财经。我已经使用雅虎财经好几年了。\n几年了，虽然我一般都很喜欢它，但我觉得好像这个应用程序真的不如网站。\n应用真的比网站逊色。它缺少一个股票筛选器。我\n也不热衷于他们的投资组合经理，我看不出在哪里...",
      "title": "哪个是最好的安卓金融应用，包括股票筛选器和投资组合管理器？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在尋找一個應用程序來取代雅虎財經。我已經使用雅虎財經好幾年了。\n幾年了，雖然我一般都很喜歡它，但我覺得好像這個應用程序真的不如網站。\n應用真的比網站遜色。它缺少一個股票篩選器。我\n也不熱衷於他們的投資組合經理，我看不出在哪裏...",
      "title": "哪個是最好的安卓金融應用，包括股票篩選器和投資組合管理器？"
    }
  ],
  "title": "Which is the best Android Financial app, that includes a Stock Screener and Portfolio Manager?",
  "created_utc": 1623503313,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m looking for an app to replace Yahoo Finance. I&#39;ve used Yahoo Finance for a couple of years now, and although i generally do love it, i feel as though the app is really subpar to the website. It&#39;s missing out on a stock screener. I&#39;m also not to keen on their portfolio manager, i can&#39;t see where you can let it know you have sold any shares?</p>\n\n<p>These are the alternative apps i have found so far:</p>\n\n<ul>\n<li>Barchart (Excellent for Technical analysis, great Stock Screener, Porfolio needs to be inputted into their website)</li>\n<li>Finwiz (not to be confused with Finviz)  (Best stock screener, nicest UI, good Portfolio Manager)</li>\n<li>Investing (Excellent Stock Screener, good Portfolio Manager)</li>\n<li>TradingView (Excellent for Technical Analysis, Nice UI. I&#39;m not so sure if TradingView has a Portfolio Manager, i can&#39;t seem to see one on their app.)</li>\n</ul>\n\n<p>I&#39;d love to hear from anyone who has used these apps, and what your thoughts are on them. Also, are their any other apps on Android that has real-time stock prices, with a stock screener and portfolio manager? I&#39;m looking for an all-in-one app.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/investing/comments/ny07rz/which_is_the_best_android_financial_app_that/",
  "subreddit": "investing",
  "id": "ny07rz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009742340
}