{
  "author": "TankArchives",
  "original_created_utc": 1628601215,
  "title": "I am Peter Samsonov, author of Sherman Tanks of the Red Army. AMA about American and British armour in Soviet service.",
  "created_utc": 1628614300,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi <a href=\"/r/AskHistorians\">r/AskHistorians</a>! You&#39;ve probably seen me around answering a few tank-related questions over the years. While I mostly write about Soviet armour, the answer that earned my my flair had to do with Lend Lease tanks. I said you could write a whole book about it, and so I did!</p>\n\n<p>Sherman Tanks of the Red Army briefly recounts the history of the Medium Tank M4A2 and its service in the American, British, and Canadian armies before jumping into Soviet evaluations of the tank and its service history with the Red Army in several major battles starting from Kursk and ending with the Soviet-Japanese War of 1945. There is also a chapter on the Soviet evaluation of the Medium Tank M4A4. Like all of my work, the book is mostly based on primary sources from Russian archives.</p>\n\n<p>Sherman Tanks of the Red Army is available for purchase through <a href=\"https://www.amazon.co.uk/Sherman-Tanks-Red-Army-American/dp/1911658476/\">Amazon</a> or <a href=\"https://www.mortonsbooks.co.uk/product/view/productCode/15068\">directly from the publisher</a>.</p>\n\n<p>Ask me anything about these tanks or other foreign tanks in Soviet service!</p>\n</div><!-- SC_ON -->",
  "score": 134,
  "permalink": "/r/AskHistorians/comments/p1owx8/i_am_peter_samsonov_author_of_sherman_tanks_of/",
  "subreddit": "AskHistorians",
  "id": "p1owx8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi r/AskHistorians [/r/AskHistorians]! You've probably seen me around answering\na few tank-related questions over the years. While I mostly write about Soviet\narmour, the answer that earned my my flair had to do with Lend Lease tanks. I\nsaid you could write a whole book about it, and so I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、r/AskHistorians [/r/AskHistorians]! おそらく、私がいくつかの戦車関連の質問に答えているのを見たことがあると思います。\n戦車に関する質問に答えているのを見たことがあると思います。私は主にソ連の鎧について書いていますが\n私は主にソ連の装甲について書いていますが、私の気を引いた答えはレンドリース戦車に関するものでした。I\n本が一冊書けるくらいだと言っていたので...。",
      "title": "私は『赤軍のシャーマン戦車』の著者、ピーター・サムソノフです。ソ連で活躍したアメリカやイギリスの装甲についてのMAです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，r/AskHistorians [/r/AskHistorians]! 你可能已经看到我在周围回答了\n这些年来，你可能已经看到我在回答一些与坦克有关的问题。虽然我主要写的是苏军的\n虽然我主要写的是苏联的装甲，但为我赢得荣誉的答案是与租借坦克有关的。I\n我说你可以为它写一整本书，所以我......",
      "title": "我是彼得-萨姆索诺夫，《红军谢尔曼坦克》的作者。关于美国和英国装甲部队在苏联服役的AMA。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，r/AskHistorians [/r/AskHistorians]! 你可能已經看到我在周圍回答了\n這些年來，你可能已經看到我在回答一些與坦克有關的問題。雖然我主要寫的是蘇軍的\n雖然我主要寫的是蘇聯的裝甲，但爲我贏得榮譽的答案是與租借坦克有關的。I\n我說你可以爲它寫一整本書，所以我......",
      "title": "我是彼得-薩姆索諾夫，《紅軍謝爾曼坦克》的作者。關於美國和英國裝甲部隊在蘇聯服役的AMA。"
    }
  ]
}