{
  "author": "Reaster21",
  "original_created_utc": 1638814802,
  "title": "Bitcoin trial: Defendant wins, keeps Bitcoins worth $50B",
  "created_utc": 1638822780,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;NEW YORK (AP) — Craig Wright, a computer scientist who claims to be the inventor of Bitcoin, prevailed in a highly publicized trial Monday that will allow him to hold onto a hoard of Bitcoins worth tens of billions of dollars.&lt;/p&gt;\n\n&lt;p&gt;A Florida jury found that Wright did not owe half of 1.1 million Bitcoins to the family of David Kleiman, Wright’s one-time business partner.&lt;/p&gt;\n\n&lt;p&gt;The highly case was highly technical, with the jury listening to explanations of the intricate workings of cryptocurrencies as well as the murky origins of how Bitcoin came to be. Jurors took a full week to deliberate, repeatedly asking questions of lawyers on both sides as well as the judge on how cryptocurrencies work as well as the business relationship between the two men.&lt;/p&gt;\n\n&lt;p&gt;At the center of the trial are 1.1 million Bitcoins, worth approximately $50 billion based on Monday’s prices. These were among the first Bitcoins to be created through mining and could only be owned by a person or entity involved with the digital currency from its beginning.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 290,
  "permalink": "/r/CryptoCurrency/comments/radvb8/bitcoin_trial_defendant_wins_keeps_bitcoins_worth/",
  "subreddit": "CryptoCurrency",
  "id": "radvb8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "NEW YORK (AP) — Craig Wright, a computer scientist who claims to be the inventor\nof Bitcoin, prevailed in a highly publicized trial Monday that will allow him to\nhold onto a hoard of Bitcoins worth tens of billions of dollars.\n\nA Florida jury found that Wright did not owe half of 1.1 million…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ニューヨーク（AP） - クレイグ・ライトは、発明者を名乗るコンピュータ科学者である。\nビットコインは、月曜日に公開された裁判で勝訴しました。\n数百億円相当のビットコインを保有している。\n\nフロリダの陪審員は、ライトは110万ドルの半分も借りていないと判断した。",
      "title": "ビットコインの裁判 被告が勝訴し、500億ドル相当のビットコインを保有"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "纽约（美联社）--自称是比特币发明者的计算机科学家克雷格-赖特（Craig Wright）周一在备受关注的审判中胜诉，这将使他能够获得更多信息。\n声称是比特币发明者的计算机科学家克雷格-莱特周一在一场备受关注的审判中获胜，这将使他能够持有价值数百亿的比特币。\n价值数百亿美元的比特币囤积。\n\n佛罗里达州的一个陪审团发现，莱特并没有欠下110万比特币的一半。",
      "title": "比特币审判。被告获胜，保留价值500亿美元的比特币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "紐約（美聯社）--自稱是比特幣發明者的計算機科學家克雷格-賴特（Craig Wright）週一在備受關注的審判中勝訴，這將使他能夠獲得更多信息。\n聲稱是比特幣發明者的計算機科學家克雷格-萊特週一在一場備受關注的審判中獲勝，這將使他能夠持有價值數百億的比特幣。\n價值數百億美元的比特幣囤積。\n\n佛羅里達州的一個陪審團發現，萊特並沒有欠下110萬比特幣的一半。",
      "title": "比特幣審判。被告獲勝，保留價值500億美元的比特幣"
    }
  ]
}