{
  "author": "Esslemut",
  "the_new_excerpt": "Just a little anecdote about my relationship with crypto and what it has done\nfor me.\n\nI don't come from a wealthy background. enough to get by and to have some\nluxuries, but very much working class. I first heard about Bitcoin in 2012 and\npassed up on buying 10BTC at $10 each because the exchange…",
  "original_created_utc": 1614334678,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "关于我与加密技术的关系以及它所做的事情，只是一个小小的轶事。\n对我来说。\n\n我的背景并不富裕，够用就好，还能有一些。\n奢侈品，但很有工薪阶层的味道。我第一次听说比特币是在2012年，并且\n错过了买10BTC，每个10美元，因为交易所... ...",
      "title": "加密货币让我人生中第一次对自己的财务未来产生了真正的希望。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關於我與加密技術的關係以及它所做的事情，只是一個小小的軼事。\n對我來說。\n\n我的背景並不富裕，夠用就好，還能有一些。\n奢侈品，但很有工薪階層的味道。我第一次聽說比特幣是在2012年，並且\n錯過了買10BTC，每個10美元，因爲交易所... ...",
      "title": "加密貨幣讓我人生中第一次對自己的財務未來產生了真正的希望。"
    }
  ],
  "title": "Crypto has given me real hope for my financial future for the first time in my life.",
  "created_utc": 1614350165,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just a little anecdote about my relationship with crypto and what it has done for me.</p>\n\n<p>I don&#39;t come from a wealthy background. enough to get by and to have some luxuries, but very much working class. I first heard about Bitcoin in 2012 and passed up on buying 10BTC at $10 each because the exchange required ID and I couldn&#39;t be bothered. I&#39;ve lived with that regret ever since, and have foolishly kept to the sidelines observing crypto from a distance. recently I decided to invest for the first time, for the reason that I don&#39;t want to live with that regret for the rest of my life. I&#39;d rather lose money I can recover than wonder &quot;what if?&quot; for the rest of my life. </p>\n\n<p>anyway, after lots of research on crypto I settled on a split of Cardano, Nano, and Bitcoin. I&#39;ve been mining banano using at folding@home, lending out my processing power to help advance medicine and earning the banano cryptocurrency in doing so. I feel like I&#39;m a part of something much larger than myself. if you&#39;re not aware of banano or folding@home for crypto I highly recommend checking it out: <a href=\"/r/banano\">/r/banano</a>. It&#39;s a great concept with a strong community and it&#39;s a great way to get people into crypto, as banano (it&#39;s a fork of nano) transfers instantly, no fees, it&#39;s kid-friendly and laid-back. lots of fun. btw, if you&#39;re new to banano and are interested in it send me a message and I&#39;ll send you some banano :)</p>\n\n<p>anyway, what started as a small investment turned into a second savings account. the benefit crypto has had on me is twofold:</p>\n\n<ol>\n<li><p>If I had the money in my bank account, I would feel tempted to spend it if I had a higher than usual amount. By locking away crypto in a wallet and treating it as a long term investment, that money won&#39;t be spent on a whim. as a result, my crypto wallet after 3 weeks has more in it than my savings account did at its peak (profit aside)</p></li>\n<li><p>cryptocurrency in general gains value over time. instead of just having a savings account that I don&#39;t touch and whose value decreases over time due to inflation, my cryptocurrencies gain value. a 5-10x price increase over the next several years is not unreasonable. </p></li>\n</ol>\n\n<p>I&#39;ve never had hope for my future, financially. I resigned to living a poor, working class life a long time ago. I never thought I&#39;d have any money. with my increasing levels of chronic pain, I&#39;ve begun to worry that I may not be able to work for much longer.</p>\n\n<p>Crypto has changed all this. I now have so much hope. I have a savings account that is decentralised and isn&#39;t through a corrupt bank (always hated banks, so crypto makes sense). and that savings may well 10+x over the next however many years. if it did that, I may never have to work a job I don&#39;t want to ever again. I&#39;d be able to rest easy, not worrying about getting through each work week with chronic pain. </p>\n\n<p>crypto can change my life forever. but more importantly, it can change the world forever. it&#39;s exciting, and a privilege to be a part of this. it truly is a once in our species opportunity.</p>\n\n<p>thanks for reading this long, pretty self-centered post. feel free to share your own experiences/give any input, I&#39;d appreciate it.</p>\n\n<p>edit: thank you but please buy crypto instead of reddit awards! buy nano and set up a wenano faucet for others to use, buy banano and participate in the giveaways, buy cardano and stake it for 5% return, buy bitcoin and don&#39;t touch it for another decade. but don&#39;t buy reddit awards. thanks, though!</p>\n</div><!-- SC_ON -->",
  "score": 636,
  "permalink": "/r/CryptoCurrency/comments/lsusgb/crypto_has_given_me_real_hope_for_my_financial/",
  "subreddit": "CryptoCurrency",
  "id": "lsusgb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937735127
}