{
  "author": "latte_yen",
  "original_created_utc": 1635514710,
  "title": "Squidgame Token Warning",
  "created_utc": 1635579553,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Before anyone puts money into the new and unknown Squidgame token which is currently pumping, Coinmarketcap have issued the following warning:</p>\n\n<p>“We have received multiple reports that users are not able to sell this token in Pancakeswap. Please exercise caution while trading! This project, while inspired by the Netflix show of the same name, is unlikely to be affiliated with the official IP.”</p>\n\n<p>There are reports from users on Twitter showing they are unable to withdraw the token and one user has shared a statement showing a liquidity lock of 3 years.</p>\n\n<p>Edit- From the Squid token whitepaper:</p>\n\n<p>“Liquidity of Squid will be locked for THREE YEARS on DxSale which prevents any unseen or immediate changes to Squid liquidity pool. Unlock date is October 20th, 2024.”</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/qid0q7/squidgame_token_warning/",
  "subreddit": "CryptoCurrency",
  "id": "qid0q7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Before anyone puts money into the new and unknown Squidgame token which is\ncurrently pumping, Coinmarketcap have issued the following warning:\n\n“We have received multiple reports that users are not able to sell this token in\nPancakeswap. Please exercise caution while trading! This project, while…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "新しい未知のトークンであるSquidgameに資金を投入する前に\n現在、Coinmarketcapは以下のような警告を発しています。\n\n\"私たちは、ユーザーがこのトークンを\nPancakeswap. 取引中は注意してください! このプロジェクトは、一方で...",
      "title": "Squidgame トークンの警告"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在任何人将资金投入到新的和未知的Squidgame代币之前，它正在\n目前正在抽水，Coinmarketcap已经发出以下警告。\n\n\"我们已经收到了多份报告，称用户无法在网上出售这种代币\nPancakeswap。请在交易时谨慎行事! 这个项目，虽然...",
      "title": "Squidgame代币警告"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在任何人將資金投入到新的和未知的Squidgame代幣之前，它正在\n目前正在抽水，Coinmarketcap已經發出以下警告。\n\n\"我們已經收到了多份報告，稱用戶無法在網上出售這種代幣\nPancakeswap。請在交易時謹慎行事! 這個項目，雖然...",
      "title": "Squidgame代幣警告"
    }
  ]
}