{
  "author": "oldeenglishdry12345",
  "original_created_utc": 1628882954,
  "title": "Was Classical Music ever the \"pop music\" of the past? Was it widely popular? Did everyone know Beethoven, Brahms and Bach?",
  "created_utc": 1628912128,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m a pianist and a classical music lover, and I&#39;ve heard legends about Liszt as &quot;the first rock star&quot; that gave me the impression that his music, and maybe all classical music, was way more popular among the general public back in the day than it is today.  Is that true?  Were there regular people going to orchestras and operas back then?  If so, when and why did that start to change?  If not, what was the &quot;pop music&quot; of the 18th, 19th, and early 20th centuries in Europe? What music did most people listen to, if any?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/p3s9iy/was_classical_music_ever_the_pop_music_of_the/",
  "subreddit": "AskHistorians",
  "id": "p3s9iy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm a pianist and a classical music lover, and I've heard legends about Liszt as\n\"the first rock star\" that gave me the impression that his music, and maybe all\nclassical music, was way more popular among the general public back in the day\nthan it is today. Is that true? Were there regular people…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はピアニストであり、クラシック音楽を愛する者ですが、リストについての伝説を聞いたことがあります。\n「最初のロックスター」という伝説を聞いたことがありますが、それは彼の音楽、そしておそらくすべてのクラシック音楽が\n彼の音楽、そしてクラシック音楽は、昔は今よりもずっと一般の人々に人気があったという印象を受けました。\n印象を受けました。それは本当ですか？一般の人もいたのかな...。",
      "title": "クラシック音楽は過去の「ポップミュージック」だったのか？広く普及していたのでしょうか？誰もがベートーヴェンやブラームス、バッハを知っていたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一名钢琴家，也是一名古典音乐爱好者，我听说过关于李斯特是 \"第一个摇滚明星 \"的传说。\n我听说过关于李斯特是 \"第一个摇滚明星 \"的传说，给我的印象是他的音乐，也许还有所有的\n他的音乐，也许是所有的古典音乐，在过去的日子里，在普通大众中都是非常受欢迎的。\n比今天更受欢迎。这是真的吗？是否有普通人...",
      "title": "古典音乐曾是过去的 \"流行音乐 \"吗？它是否广泛流行？每个人都知道贝多芬、勃拉姆斯和巴赫吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一名鋼琴家，也是一名古典音樂愛好者，我聽說過關於李斯特是 \"第一個搖滾明星 \"的傳說。\n我聽說過關於李斯特是 \"第一個搖滾明星 \"的傳說，給我的印象是他的音樂，也許還有所有的\n他的音樂，也許是所有的古典音樂，在過去的日子裏，在普通大衆中都是非常受歡迎的。\n比今天更受歡迎。這是真的嗎？是否有普通人...",
      "title": "古典音樂曾是過去的 \"流行音樂 \"嗎？它是否廣泛流行？每個人都知道貝多芬、勃拉姆斯和巴赫嗎？"
    }
  ]
}