{
  "author": "alexb_090",
  "original_created_utc": 1630676062,
  "title": "Bitcoin going to 100k by November according to top analysts.",
  "created_utc": 1630690233,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I feel like no one even reads posts anymore. I recently wrote a short opinion post, not more than 200 words, and over half the comments only referenced the title. Wtf. I get that the sub is different now with moon farmers, but still, is there no effort here anymore? Maybe there needs to be an auto lock on every post for the first 5 minutes or something to prevent the people who comment after only reading the title. Or maybe I’ll just stop titling posts. Idk what the solution is, but it sucks and I for one can’t wait until moon farming becomes unprofitable. I’m willing to bet that more than a few people will comment something about the title here that’s totally unrelated to the body of the post.</p>\n\n<p>ETA: If you agree or disagree with the proposal, I posted a poll in the meta sub. Please vote and if there’s enough support, I’ll make an official proposal for next distribution.</p>\n</div><!-- SC_ON -->",
  "score": 201,
  "permalink": "/r/CryptoCurrency/comments/ph59lk/bitcoin_going_to_100k_by_november_according_to/",
  "subreddit": "CryptoCurrency",
  "id": "ph59lk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I feel like no one even reads posts anymore. I recently wrote a short opinion\npost, not more than 200 words, and over half the comments only referenced the\ntitle. Wtf. I get that the sub is different now with moon farmers, but still, is\nthere no effort here anymore? Maybe there needs to be an auto…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もう誰も投稿を読んでいないような気がします。私は最近、200文字以下の短い意見を書きました。\n書きましたが、半分以上のコメントがタイトルにしか言及していませんでした。\nタイトルを見ただけでした。驚きました。月の農家でサブが変わったのはわかりますが、それにしても\n努力が足りないのでは？オートが必要なのでは・・・？",
      "title": "トップアナリストによると、ビットコインは11月までに100kになるそうです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得现在甚至没有人看帖子了。我最近写了一篇简短的意见\n短文，不超过200字，而一半以上的评论只提到了标题\n标题。我不知道该怎么办。我明白，现在的月球农民的子是不同的，但仍然，这里不再有努力了吗？\n这里已经没有努力了吗？也许需要有一个自动...",
      "title": "据顶级分析师称，比特币将在11月达到10万。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得現在甚至沒有人看帖子了。我最近寫了一篇簡短的意見\n短文，不超過200字，而一半以上的評論只提到了標題\n標題。我不知道該怎麼辦。我明白，現在的月球農民的子是不同的，但仍然，這裏不再有努力了嗎？\n這裏已經沒有努力了嗎？也許需要有一個自動...",
      "title": "據頂級分析師稱，比特幣將在11月達到10萬。"
    }
  ]
}