{
  "author": "MadMeow",
  "the_new_excerpt": "I have been adulting for a long time now, but even as a teen I can't remember\nhaving anything I could actually work towards. I couldn't tell you what my dream\njob is, I just know I haven't worked it so far. I have no hobbies because\nnothing catches my and becomes a passion. Also the starting phase…",
  "original_created_utc": 1612286766,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我已经成年很久了，但即使是十几岁的我也不记得了\n有什么我可以实际工作的。我不能告诉你我的梦想是什么\n工作是，我只知道我至今还没有工作。我没有爱好，因为\n没有什么能抓住我的，成为一种激情。也是开始阶段...",
      "title": "还有人被困在一个没有任何目标、野心和激情的地方吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經成年很久了，但即使是十幾歲的我也不記得了\n有什麼我可以實際工作的。我不能告訴你我的夢想是什麼\n工作是，我只知道我至今還沒有工作。我沒有愛好，因爲\n沒有什麼能抓住我的，成爲一種激情。也是開始階段...",
      "title": "還有人被困在一個沒有任何目標、野心和激情的地方嗎？"
    }
  ],
  "title": "Is anyone else stuck in a place where you don't have any goals, ambitions and passions?",
  "created_utc": 1612315811,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have been adulting for a long time now, but even as a teen I can&#39;t remember having anything I could actually work towards. I couldn&#39;t tell you what my dream job is, I just know I haven&#39;t worked it so far. I have no hobbies because nothing catches my and becomes a passion. Also the starting phase of sucking just makes it even more discouraging.</p>\n\n<p>Every day is just working and then going home to find the thing that will consume my time the fastest so I can go to sleep, but then going to sleep feels bad because I haven&#39;t accomplished anything and don&#39;t have anything I can work towards.</p>\n\n<p>I haven&#39;t told anyone how I feel, because even hinting that you are kinda in the middle of nowhere makes people look at you like you belong in a psych ward.</p>\n\n<p>But at the same time everyone I talk to have this thing they love putting time into and/or have goals that they want to reach.</p>\n\n<p>It just feels like everyone figured their place out while I am standing in the middle of a never ending road.</p>\n\n<p>Does anyone else feel this way? How do you deal with it? Did anyone manage to overcome it?</p>\n</div><!-- SC_ON -->",
  "score": 121,
  "permalink": "/r/NoStupidQuestions/comments/lb15ax/is_anyone_else_stuck_in_a_place_where_you_dont/",
  "subreddit": "NoStupidQuestions",
  "id": "lb15ax",
  "is_self": true,
  "media": null,
  "is_video": false
}