{
  "author": "HorriblyGreat",
  "original_created_utc": 1660060648,
  "title": "Shopify app I'm helping develop that's seeing really interesting results…",
  "created_utc": 1660062593,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m helping a team develop a Shopify app called ShipSafe that lets store owners add shipping protection to their stores. It gets applied at checkout and the customer can toggle it off or on.  &lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;ve tested it in a few beta stores already and it&amp;#39;s led to higher order values without a drop in conversion (in fact it&amp;#39;s increased if anything).  &lt;/p&gt;\n\n&lt;p&gt;The biggest issue is that installation has to be manual since it varies from theme to theme.  &lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re giving out free trials and will walk you through every step of install. I&amp;#39;d love for more people to try it out!  &lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re interested, feel free to book time directly with our devs/team at &lt;a href=\"https://www.shipsafecommerce.com/\"&gt;https://www.shipsafecommerce.com&lt;/a&gt; (rather than install through the App Store)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 12,
  "permalink": "/r/SideProject/comments/wk6y32/shopify_app_im_helping_develop_thats_seeing/",
  "subreddit": "SideProject",
  "id": "wk6y32",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm helping a team develop a Shopify app called ShipSafe that lets store owners\nadd shipping protection to their stores. It gets applied at checkout and the\ncustomer can toggle it off or on.\n\nWe've tested it in a few beta stores already and it's led to higher order values\nwithout a drop in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、ShipSafeというShopifyアプリを開発するチームを手伝っています。\n配送保護を追加することができます。チェックアウト時に適用され\n顧客はそれをオフにしたりオンにしたりすることができます。\n\nすでにいくつかのベータ版店舗でテストしており、注文金額の上昇につながっています。\n注文数の減少を伴わずに",
      "title": "私が開発を手伝っているShopifyアプリが、実に興味深い結果を出しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在帮助一个团队开发一个名为ShipSafe的Shopify应用程序，它可以让店主\n在他们的商店中添加运输保护。它在结账时被应用，并且\n客户可以将其关闭或打开。\n\n我们已经在一些测试店中进行了测试，它导致了更高的订单价值\n而没有下降...",
      "title": "我正在帮助开发的Shopify应用程序，看到了非常有趣的结果..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在幫助一個團隊開發一個名爲ShipSafe的Shopify應用程序，它可以讓店主\n在他們的商店中添加運輸保護。它在結賬時被應用，並且\n客戶可以將其關閉或打開。\n\n我們已經在一些測試店中進行了測試，它導致了更高的訂單價值\n而沒有下降...",
      "title": "我正在幫助開發的Shopify應用程序，看到了非常有趣的結果..."
    }
  ]
}