{
  "author": "Mushrimps",
  "original_created_utc": 1639598566,
  "title": "Do people actually get excited about pictures of their friend's/co-worker's baby or is everybody faking it?",
  "created_utc": 1639618486,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a child-free woman (mid-30&amp;#39;s) so my viewpoint might be skewed.  Whenever a co-worker shows me pics or movies of their baby, I always go &amp;quot;awww!&amp;quot; because I know that&amp;#39;s the reaction they want.  In reality, I don&amp;#39;t give two shits about that baby and most babies aren&amp;#39;t even that cute to me.  I love my sister&amp;#39;s kids and that&amp;#39;s about it.  I confessed this to my other child-free friends and they all agreed that they&amp;#39;re faking it.  One of my friends WITH kids said they were faking it because they understand that high of becoming a new parent, but they don&amp;#39;t think their co-worker&amp;#39;s baby is all that cute.  I&amp;#39;ve seen co-workers who go &amp;quot;show me pictures!&amp;quot; and their reaction feels genuine... but now I can&amp;#39;t trust anybody because I&amp;#39;m a liar too!!! &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;So my question is--are we ALL faking it or are there people who genuinely enjoy seeing other people&amp;#39;s baby photos??&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/rh7y13/do_people_actually_get_excited_about_pictures_of/",
  "subreddit": "TooAfraidToAsk",
  "id": "rh7y13",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm a child-free woman (mid-30's) so my viewpoint might be skewed. Whenever a\nco-worker shows me pics or movies of their baby, I always go \"awww!\" because I\nknow that's the reaction they want. In reality, I don't give two shits about\nthat baby and most babies aren't even that cute to me. I love my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は子供のいない女性（30代半ば）なので、視点が偏っているかもしれません。私は子供のいない女性なので\n同僚が赤ちゃんの写真や動画を見せてくれると、いつも「キャー！」と叫んでしまいます。\nそれが彼らの望む反応だと知っているからです。現実には、私はそのようなことはどうでもいいのです。\nほとんどの赤ちゃんは、私にとってそれほどかわいいものではありません。私が愛しているのは...",
      "title": "友人や同僚の赤ちゃんの写真に興奮する人は本当にいるのか、それともみんなごまかしているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个没有孩子的女人（30多岁），所以我的观点可能有偏差。每当有\n同事给我看他们孩子的照片或电影时，我总是说 \"哇！\"因为我知道这是他们想要的反应。\n因为我知道那是他们想要的反应。在现实中，我并不关心那个孩子\n大多数婴儿对我来说甚至没有那么可爱。我爱我的...",
      "title": "人们是否真的对朋友/同事的孩子的照片感到兴奋，还是每个人都在假装兴奋？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個沒有孩子的女人（30多歲），所以我的觀點可能有偏差。每當有\n同事給我看他們孩子的照片或電影時，我總是說 \"哇！\"因爲我知道這是他們想要的反應。\n因爲我知道那是他們想要的反應。在現實中，我並不關心那個孩子\n大多數嬰兒對我來說甚至沒有那麼可愛。我愛我的...",
      "title": "人們是否真的對朋友/同事的孩子的照片感到興奮，還是每個人都在假裝興奮？"
    }
  ]
}