{
  "author": "TheCommonKoala",
  "the_new_excerpt": "I see a lot of people overlooking US cannabis these days so I just wanted to\nquickly set the record straight on the outlook of the industry in 2021. In just\nthis year alone, we are looking towards several key major catalysts such as:\n\n- the SAFE act for MSOs to get access to banking\n\n- uplisting to…",
  "original_created_utc": 1614139224,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我看到很多人忽略了美国的大麻，这些天，所以我只是想。\n很快就把2021年的行业前景说清楚了。在短短\n仅在今年，我们就期待着几个关键的主要催化剂，如。\n\n- SAFE法案让MSO获得银行业务的机会。\n\n- 上架到...",
      "title": "2021年美国大麻产业玩法比以往更有吸引力"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到很多人忽略了美國的大麻，這些天，所以我只是想。\n很快就把2021年的行業前景說清楚了。在短短\n僅在今年，我們就期待着幾個關鍵的主要催化劑，如。\n\n- SAFE法案讓MSO獲得銀行業務的機會。\n\n- 上架到...",
      "title": "2021年美國大麻產業玩法比以往更有吸引力"
    }
  ],
  "title": "The US cannabis industry play is more attractive than ever in 2021",
  "created_utc": 1614153459,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I see a lot of people overlooking US cannabis these days so I just wanted to quickly set the record straight on the outlook of the industry in 2021. In just this year alone, we are looking towards several key major catalysts such as: </p>\n\n<p>- the SAFE act for MSOs to get access to banking  </p>\n\n<p>- uplisting to NYSE (US MSOs are currently traded as OTC leaving the vast majority of institutional investors on the outside looking in for now)</p>\n\n<p>- more states legalizing independently </p>\n\n<p>Decriminalization even without full legalization would be a major boon for growth but is not even necessary for growth to continue with more states legalizing and/or relaxing restrictions on MSOs. The 4 major players (Green Thumb, Cresco, Trulieve, and Curaleaf) are all on top in this. They maintained solid financials, limited debt/losses, huge expansion across all medical/recreational states and are almost certainly going to remain the big 4 post-legalization. A play across these 4 covers the majority of gains we&#39;ll see leading up to and after legalization. </p>\n\n<p>So we know who to invest in, what to look out for and when to expect it. We&#39;re past speculation for the cannabis market at this point. The industry is matured and ready to go big in 2021.</p>\n</div><!-- SC_ON -->",
  "score": 2485,
  "permalink": "/r/investing/comments/lr34do/the_us_cannabis_industry_play_is_more_attractive/",
  "subreddit": "investing",
  "id": "lr34do",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332883605
}