{
  "author": "hanhan92",
  "original_created_utc": 1637323073,
  "title": "I absolutely do not sympathize with people who get rekttt by blindly following mainstream media and \"influencers\".",
  "created_utc": 1637332545,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My friend lost $2K in the whole squid game token fiasco and later was playing the victim card stating <em>&quot;I was sold by the main stream media and its their fault&quot;.</em></p>\n\n<p>Ironically he is pissed at me for blaming him for his misfortune.</p>\n\n<p>Another friend put on a long position (x10) with his entire savings of $2400 when bitcoin was at $65k as he said majority of the YouTubers were stating BTC would touch a new high of at least $75k. He was dumb enough to not put a stop loss as he thought &quot;setting up a losing trade is part of a looser mindset&quot; <em>(still can&#39;t get over how ironic it sounds now)</em>.</p>\n\n<p>His position has liquidated, and now he thinks Crypto is all gambling.</p>\n\n<p>I haven&#39;t made big in crypto either, I started off in august, went up to 2.2x my original investment and now I am back to a comfortable 1.7x  (which is more than what I ever expected). I am still leaning with every trade, I make my decisions based on evidence not emotions, losing is part of the learning process and it teaches you more than a winning trade.</p>\n\n<p>&#x200B;</p>\n\n<p>If you blindly follow the big names in IG, YT and twitter, you&#39;re setting yourself to fail. If you do not play wisely, the game is setup to screw over sheep retail investors. You have to take words of influencers with some subjectivity. I know it sounds obvious but people do not follow it at al. The funny part is that by playing the victim card they aren&#39;t even using the loss to learn a lesson.  </p>\n\n<p>Edit 1: We are still friends and they are just doing fine too, but not recognizing your own fault is further paving way for not taking accountability. If I agree with them then it wouldn&#39;t be very sincere from my end. </p>\n</div><!-- SC_ON -->",
  "score": 595,
  "permalink": "/r/CryptoCurrency/comments/qxepgd/i_absolutely_do_not_sympathize_with_people_who/",
  "subreddit": "CryptoCurrency",
  "id": "qxepgd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My friend lost $2K in the whole squid game token fiasco and later was playing\nthe victim card stating \"I was sold by the main stream media and its their\nfault\".\n\nIronically he is pissed at me for blaming him for his misfortune.\n\nAnother friend put on a long position (x10) with his entire savings of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の友人はイカゲームのトークン騒動で2Kドルを失いましたが、後になって被害者面して\n犠牲者のカードを使って、「私は主流メディアに売られ、彼らのせいだ」と言っていました。\nのせいだ」と被害者ぶっていました。\n\n皮肉なことに、彼は自分の不幸を非難した私に腹を立てています。\n\nもう一人の友人は、全財産を投じてロングポジション(10倍)を持ちましたが...",
      "title": "メインストリームのメディアや「インフルエンサー」に盲目的に従った結果、リクツを得てしまう人には絶対に共感しません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的朋友在整个乌贼游戏代币的惨败中损失了2千美元，后来又在玩\n说 \"我是被主流媒体出卖的，是他们的错。\n错\"。\n\n具有讽刺意味的是，他对我指责他的不幸而感到生气。\n\n另一个朋友用他的全部积蓄做了一个多头头寸（X10）。",
      "title": "我绝对不同情那些通过盲目跟随主流媒体和 \"影响者 \"而获得回报的人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的朋友在整個烏賊遊戲代幣的慘敗中損失了2千美元，後來又在玩\n說 \"我是被主流媒體出賣的，是他們的錯。\n錯\"。\n\n具有諷刺意味的是，他對我指責他的不幸而感到生氣。\n\n另一個朋友用他的全部積蓄做了一個多頭頭寸（X10）。",
      "title": "我絕對不同情那些通過盲目跟隨主流媒體和 \"影響者 \"而獲得回報的人。"
    }
  ]
}