{
  "author": "EmergencyAd4225",
  "original_created_utc": 1645022271,
  "title": "Is referring to Japanese people as Japs racist?",
  "created_utc": 1645028290,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I work as an engineer and we use a lot of Japanese parts. One of the older engineers will always say go to the Japs whenever we need parts. It got me thinking if this is something that would be offensive. I asked him and he doesn&amp;#39;t think so as people refer to  him (collectively) as Brits or Scots, so he doesn&amp;#39;t see any difference. He doesn&amp;#39;t use it derogatively or anything, so it got me thinking. What is everyone&amp;#39;s thoughts? I don&amp;#39;t say it, before anyone starts calling me out.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/NoStupidQuestions/comments/stxfo8/is_referring_to_japanese_people_as_japs_racist/",
  "subreddit": "NoStupidQuestions",
  "id": "stxfo8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I work as an engineer and we use a lot of Japanese parts. One of the older\nengineers will always say go to the Japs whenever we need parts. It got me\nthinking if this is something that would be offensive. I asked him and he\ndoesn't think so as people refer to him (collectively) as Brits or Scots,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はエンジニアとして働いており、日本の部品を多く使っています。ある先輩は\nエンジニアは、部品が必要なときはいつもジャップに行けと言っています。それで、私は\nこのようなことが不快に感じられるかどうかを考えてみました。彼に聞いてみたところ、彼は\nみんなは彼のことをイギリス人とかスコットランド人とか言うので、そんなことはないと思うのですが...。",
      "title": "日本人をジャップと呼ぶのは人種差別か？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一名工程师，我们使用大量的日本零件。其中一位年长的\n每当我们需要零件时，一个老工程师总是说去找日本人。这让我想到\n我在想，这是否是一件令人反感的事情。我问他，他\n他不这么认为，因为人们把他（集体）称为英国人或苏格兰人，......",
      "title": "把日本人称为小日本是种族主义吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一名工程師，我們使用大量的日本零件。其中一位年長的\n每當我們需要零件時，一個老工程師總是說去找日本人。這讓我想到\n我在想，這是否是一件令人反感的事情。我問他，他\n他不這麼認爲，因爲人們把他（集體）稱爲英國人或蘇格蘭人，......",
      "title": "把日本人稱爲小日本是種族主義嗎？"
    }
  ]
}