{
  "author": "IZZI2233",
  "the_new_excerpt": "have friends from all around the world and it never, and I mean never happened\nthat any one of them to say they are depressed or suicidal.\n\nBut with the majority of people is talk to from the US, they think their\nproblems ar so important and on a whole other level. For example I had 2 guys\nfrom…",
  "original_created_utc": 1618035104,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "世界中に友人がいますが、その中で誰かがうつ病や自殺をしたということは一度もありません。\n落ち込んでいる、自殺したいと言ったことは一度もありませんでした。\n\nしかし、私が話すアメリカ人の大半は、自分たちの問題をとても重要だと考えています。\n自分の問題はとても重要で、まったく別の次元の問題だと考えるのです。例えば、私は2人の男性\nの人がいました。",
      "title": "少なくとも私の経験では）アメリカの若年層のほとんどが、自分は何らかの精神的な問題を抱えていると考えているのはなぜでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有来自世界各地的朋友，但这从来没有，我的意思是从来没有发生过。\n他们中的任何一个人说他们是抑郁症或自杀。\n\n但是，与大多数人是谈 从美国，他们认为他们的。\n问题是如此重要，而且是在另一个层面上。例如，我有2个家伙\n从...",
      "title": "为什么在美国，大多数年轻人（至少从我的经验来看）认为他们有某种形式的心理健康问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有來自世界各地的朋友，但這從來沒有，我的意思是從來沒有發生過。\n他們中的任何一個人說他們是抑鬱症或自殺。\n\n但是，與大多數人是談 從美國，他們認爲他們的。\n問題是如此重要，而且是在另一個層面上。例如，我有2個傢伙\n從...",
      "title": "爲什麼在美國，大多數年輕人（至少從我的經驗來看）認爲他們有某種形式的心理健康問題？"
    }
  ],
  "title": "Why do most of young adults (at least from my experience) in the US believe they have some form of mental health problem?",
  "created_utc": 1618051868,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>have friends from all around the world and it never, and I mean never happened that any one of them to say they are depressed or suicidal. </p>\n\n<p>But with the majority of people is talk to from the US, they think their problems ar so important and on a whole other level. For example I had 2 guys from Syiria as roommates in college, not even one of them said they have any mental problems while their country was being torn in a war. I have friends from Turkey and they are trying to enjoy most of life. I know people all around Europe and not only do they know they have it good, they enjoy it too, but when speaking with people from the US it&#39;s like watching a drama...</p>\n\n<p>Most of the people from the US I talk to are from reddit or video games and a bunch of others (under 10) that I met as tourists. Almost all of them believe to have some kind of mental problem and when I asked one girl (21 yo) why is she depressed she told me that her sister got in another university in another state... </p>\n\n<p>Now, a problem is a problem, but my friend Ala from Syria lost his mother and little brother in the war, and tbh, you can&#39;t really compare those two. </p>\n\n<p>If this would&#39;ve happened just once or twice I wouldn&#39;t have noticed, but any time I start speaking with someone from the US I imediately think that he/she will tell me how depressed and hard their life is if we talk long enough and I want to know why is that? Is it some cultural stuff in the US to be categorized with a mental health problem? What are the reason for this mass thinking? </p>\n\n<p>As a disclamer, it never happened with older people as  near my home town there is a US military base and the guys there are all good, funny and full of life. Some of the most interesting guys I know.</p>\n</div><!-- SC_ON -->",
  "score": 118,
  "permalink": "/r/TooAfraidToAsk/comments/mnzcjm/why_do_most_of_young_adults_at_least_from_my/",
  "subreddit": "TooAfraidToAsk",
  "id": "mnzcjm",
  "is_self": true,
  "media": null,
  "is_video": false
}