{
  "author": "simplelifestyle",
  "original_created_utc": 1644039354,
  "title": "CNBC: \"Bitcoin miners are helping the Texas grid brace for winter storm impact\". Great article! ...why I don't see it in r/Technology?",
  "created_utc": 1644089452,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.cnbc.com/2022/02/03/winter-storm-descends-on-texas-bitcoin-miners-shut-off-to-protect-ercot.html\"&gt;https://www.cnbc.com/2022/02/03/winter-storm-descends-on-texas-bitcoin-miners-shut-off-to-protect-ercot.html&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;They only post FUD about Bitcoin/Crypto, articles full of lies and misinformation. But this great factual article is nowhere to be seen there:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;As a major winter storm descends on Texas, crypto miners are powering down operations to help ease the burden on the state’s already beleaguered power grid. &lt;/p&gt;\n\n&lt;p&gt;The chief concern is that we might see a repeat of February 2021, when a deep freeze devastated large swaths of the state, leaving 10 million Texans without electricity and resulted in a multisystem meltdown that “was within minutes of a much more serious and potentially complete blackout.” Hundreds of people died amid the multiday outage. &lt;/p&gt;\n\n&lt;p&gt;Riot Blockchain, one of the biggest publicly traded crypto mining companies in America, began shutting down power to its Rockdale mine on Tuesday, a process that occurs in phases.  &lt;/p&gt;\n\n&lt;p&gt;“As the storm has progressed, we have continued to decrease our power consumption by 98%-99%. So currently, we are only using 1%-2% of power,” said Trystine Payfer, Riot’s director of communications. Payfer told CNBC Riot will continue to manage its power usage as needed until there is “no extreme stress on the ERCOT grid.”&lt;/p&gt;\n\n&lt;p&gt;Riot’s stock closed nearly 7% lower on Wednesday, and it is down over 31% year-to-date. &lt;/p&gt;\n\n&lt;p&gt;Several other crypto miners across Texas have followed suit in voluntarily curtailing energy consumption in the run-up to the arctic blast.&lt;/p&gt;\n\n&lt;p&gt;The CEO of Rhodium Enterprises, a fully integrated bitcoin miner using liquid-cooled infrastructure, tweeted that Texas-based bitcoin miners were curtailing their load starting Wednesday, in order to “help provide excess power reserves” for the storm. &lt;/p&gt;\n\n&lt;p&gt;“We are proud to help stabilize the grid and help our fellow Texans stay warm,” wrote Rhodium CEO Nathan Nichols.&lt;/p&gt;\n\n&lt;p&gt;Other crypto miners said they will respond in real-time to the needs of the grid.&lt;/p&gt;\n\n&lt;p&gt;The grid is called ERCOT, which is short for the Electric Reliability Council of Texas, the organization tasked with operating it. To run smoothly, ERCOT requires a perfect balance between supply and demand. Having too much power and not enough buyers is just as bad as everyone wanting to fire up their air conditioning units on the same day in July.&lt;/p&gt;\n\n&lt;p&gt;Whinstone CEO Chad Harris takes CNBC on a tour of the largest bitcoin mine in North America.\nWhinstone CEO Chad Harris takes CNBC on a tour of the largest bitcoin mine in North America.\nFor years, ERCOT has struggled with fluctuating energy prices and sporadic service, which is why it strikes deals with flexible energy buyers, like crypto miners. Through established “demand response” programs, ERCOT will actually pay major industrial users to cut power.&lt;/p&gt;\n\n&lt;p&gt;“They’re expecting the same kind of grid load as you would have at peak summertime, so they’ll likely curtail miners at some point on Friday or Saturday,” explained Fred Thiel, CEO of Marathon Digital, another major player in the U.S. mining industry.&lt;/p&gt;\n\n&lt;p&gt;Bitcoin miners specifically, and demand response more generally, are a powerful tool in the toolbox for grid management, according to Lee Bratcher, president of the Texas Blockchain Council.&lt;/p&gt;\n\n&lt;p&gt;Marathon’s Thiel tells CNBC that miners have been coordinating with ERCOT since last week to get ahead of any potential problems with the grid.&lt;/p&gt;\n\n&lt;p&gt;“Everybody wants to collaborate, everybody wants to voluntarily do whatever it takes to support ERCOT,” he said.&lt;/p&gt;\n\n&lt;p&gt;The question now is when the baseload that miners use (the baked-in energy demand from miners as a collective) is shut down and transferred back to the grid, does that provide the grid with what it needs to keep functioning as normal?&lt;/p&gt;\n\n&lt;p&gt;“This is a key test moment for the industry,” continued Thiel.&lt;/p&gt;\n\n&lt;p&gt;Whether crypto miners going offline en masse in one of the biggest crypto mining jurisdictions in the world will move the price of bitcoin, the answer is probably no.&lt;/p&gt;\n\n&lt;p&gt;The supply delta from changing the pace of mining is typically minimal, and any price moves in bitcoin or other major proof-of-work cryptocurrencies would likely have more to do with macro factors and overall risk-off behavior.&lt;/p&gt;\n\n&lt;p&gt;WATCH NOW\nVIDEO02:51\nA war is brewing among states in the US to attract bitcoin miners\nBig test for bitcoin miners\nMany in the mining industry tell CNBC that the next few days are a high-stakes way of testing out whether the narrative of crypto miners being good for the grid bears out under pressure. The state’s growing crypto mining contingent ballooned after China banished all crypto miners last May.&lt;/p&gt;\n\n&lt;p&gt;“Bitcoin miners want to be good stewards of grid stability,” said Alex Brammer of Luxor Mining, a cryptocurrency pool built for advanced miners. &lt;/p&gt;\n\n&lt;p&gt;“We are incentivized financially but also from a political narrative, and therefore, regulatory perspective. We want to show the world we contribute to the health and resilience of the grid, and we know that all eyes will be on us throughout this first big test of the year,” continued Brammer.&lt;/p&gt;\n\n&lt;p&gt;That financial incentive is key. Miners are not altruistically opting to do the grid a solid by sometimes powering down some or all of its bitcoin miners to free up electricity for those in need. Instead, there are a lot of financial perks baked into its arrangement with the nonprofit organization that operates Texas’ grid. &lt;/p&gt;\n\n&lt;p&gt;“Imagine how much you would have to pay Amazon to say, ‘Hey, there’s too much demand for power. Please power down your data center,’” said bitcoin mining engineer Brandon Arvanaghi, who now runs Meow, a company that enables corporate treasury participation in crypto markets.&lt;/p&gt;\n\n&lt;p&gt;“But it can do that with bitcoin very easily, because all you have to do is pay the miners slightly more than what they would have made mining for bitcoin that hour,” continued Arvanaghi, who calls the setup a “a win-win.”&lt;/p&gt;\n\n&lt;p&gt;If the grid operators pay the miners a penny more than they would have made from mining in any given hour, then they’ll gladly power down. And from Thiel’s experience, they get curtailment requests less than 3% of the time in the course of a year, which he estimates comes to about five to ten hours a month.&lt;/p&gt;\n\n&lt;p&gt;Even bitcoin miners that haven’t cut a deal with ERCOT sometimes voluntarily power down at times of peak consumption when prices shoot higher.&lt;/p&gt;\n\n&lt;p&gt;The price of power per hour is all over the place, routinely going negative.&lt;/p&gt;\n\n&lt;p&gt;Shaun Connell, the EVP of power at Lancium, tells CNBC that in 2020, the price of energy in West Texas was negative between 10% and 20% of the time. The price dips below zero when supply outpaces demand.&lt;/p&gt;\n\n&lt;p&gt;In 2021, the price of power per hour was negatively priced 9% of the time, while 5% of all hours peaked above $100. Extreme tails like the ones shown in the chart below aren’t a good thing.&lt;/p&gt;\n\n&lt;p&gt;Scales\nIn 2021, had miners voluntarily cut back their uptime expectation from 100% to 95%, they would have slashed their per megawatt hour price from $178 to $25, according to data from Lancium, a Houston-based energy tech company that specializes in bitcoin mining. &lt;/p&gt;\n\n&lt;p&gt;Strategically timed energy curtailment proves especially vital for the Texas grid, which exists as its own little island. &lt;/p&gt;\n\n&lt;p&gt;Unlike the rest of the continental U.S. that belongs to either the Eastern or Western interconnection (the names of the two interconnected power grids linking states), 90% of Texas runs on ERCOT, a deregulated and independent network of energy providers that is not tethered to any other grid in the U.S. &lt;/p&gt;\n\n&lt;p&gt;While this competitive market often drives down the price of power as providers compete on cost to capture customers, it also means that there is less of a safety net baked into the grid. This presents problems in the face of calamitous events, such as a power shortage or a natural disaster, like the fatal winter storm in early 2021. &lt;/p&gt;\n\n&lt;p&gt;Adding a “controllable load resource” like bitcoin miners to the grid acts as a sort of life insurance policy. It’s almost like a hedge against disaster.&lt;/p&gt;\n\n&lt;p&gt;And it’s no skin off the back of bitcoin miners. Bitcoin has no uptime requirement, nor is the gear worn down by regularly powering off and on. It’s pretty much a win, win.&lt;/p&gt;\n\n&lt;p&gt;“That’s the beauty of bitcoin — it’s something no other industry can really do,” Arvanaghi told CNBC. “It’s very synergistic.”&lt;/p&gt;\n\n&lt;p&gt;Not everyone agrees\nNot all are convinced that bitcoin miners are the solution.&lt;/p&gt;\n\n&lt;p&gt;“Miners are a strain on the grid, not a help,” said Ben Hertz-Shargel of Wood Mackenzie, a provider of commercial intelligence for the world’s natural resources sector. Hertz-Shargel is concerned that bitcoin mining would only raise peak demand, ultimately adding stress to the system.&lt;/p&gt;\n\n&lt;p&gt;Hertz-Shargel predicts that bitcoin could more than double demand growth in ERCOT’s territory, but unlike pro-crypto Republican Sen. Ted Cruz, Hertz-Shargel doesn’t think that additional demand is a good thing.&lt;/p&gt;\n\n&lt;p&gt;″The analogy I like to use is that if you start smoking two packs a day and then cut back to one pack on holidays, that doesn’t make smoking good for your health,” he says.&lt;/p&gt;\n\n&lt;p&gt;Hertz-Shargel argues that ERCOT should be focused on grid improvements to make it easier to get power from solar and wind farms to big consumption centers, and that bitcoin miners aren’t the right way to deal with demand fluctuations. Instead, he argues, “the intermittency of renewables should be met with demand response from societally-beneficial loads, like industrial facilities, commercial buildings, and residential air conditioners — or energy storage.”&lt;/p&gt;\n\n&lt;p&gt;But ERCOT interim CEO Brad Jones thinks bitcoin miners can be helpful.&lt;/p&gt;\n\n&lt;p&gt;Jones has been touring the state and hosting public events to answer questions from Texans about the electric grid. Besides winter weather, the impact of cryptocurrency mining on the grid is a common question.&lt;/p&gt;\n\n&lt;p&gt;“I’m pro bitcoin...but I’m too risk averse to be an investor in bitcoin,” Jones told a crowd of residents in Frisco, Texas in December. The ERCOT chief went on to explain the mutually beneficial relationship between the grid and bitcoin miners.&lt;/p&gt;\n\n&lt;p&gt;“A lot of these solar and wind can produce power down to a negative power range, negative $23 per megawatt hour,” Jones said. “These bitcoins see that as a great opportunity. They can get paid to use power. And that’s why they’re coming to the state. But that’s not necessarily bad.”&lt;/p&gt;\n\n&lt;p&gt;Jones makes the point that negative power isn’t healthy for the market. Bitcoin miners “soak up” some of that negative power, and when the cost of electricity gets slightly higher than what they’re willing to pay for it (around $100, according to Jones), they shut off.&lt;/p&gt;\n\n&lt;p&gt;“So I think it’s really a valuable potential resource for us.”&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 315,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/AsvxPsbkzGAeTg8YIVo1S4MQW8fmCwMui1CAeEAbL4E.jpg?auto=webp&amp;s=252bede928eb00dacad3680b7035af649e92c34e",
          "width": 1234,
          "height": 924
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/AsvxPsbkzGAeTg8YIVo1S4MQW8fmCwMui1CAeEAbL4E.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=09b1b046c3ff27ba36de0de1652040cfd3588582",
            "width": 108,
            "height": 80
          },
          {
            "url": "https://external-preview.redd.it/AsvxPsbkzGAeTg8YIVo1S4MQW8fmCwMui1CAeEAbL4E.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=5d463f3815d16f4d15e7569abf748ef42082d79d",
            "width": 216,
            "height": 161
          },
          {
            "url": "https://external-preview.redd.it/AsvxPsbkzGAeTg8YIVo1S4MQW8fmCwMui1CAeEAbL4E.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=dd3d58345d4e0278ef38b2891b8dba79b10437f8",
            "width": 320,
            "height": 239
          },
          {
            "url": "https://external-preview.redd.it/AsvxPsbkzGAeTg8YIVo1S4MQW8fmCwMui1CAeEAbL4E.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=51ea2465d93ee682ed8ae1649414174aaef6ab63",
            "width": 640,
            "height": 479
          },
          {
            "url": "https://external-preview.redd.it/AsvxPsbkzGAeTg8YIVo1S4MQW8fmCwMui1CAeEAbL4E.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=4a45669cc1e981a6e7f5c47c67cc5d7f28959913",
            "width": 960,
            "height": 718
          },
          {
            "url": "https://external-preview.redd.it/AsvxPsbkzGAeTg8YIVo1S4MQW8fmCwMui1CAeEAbL4E.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=7c342f0388c4951b8fbe1be0f95a2879d99ac8f4",
            "width": 1080,
            "height": 808
          }
        ],
        "variants": {},
        "id": "LL7X8FiiS__rrCnjVL2WtRpL3D8xVsqF6MayKyDXzJE"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/skzb2s/cnbc_bitcoin_miners_are_helping_the_texas_grid/",
  "subreddit": "Bitcoin",
  "id": "skzb2s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "https://www.cnbc.com/2022/02/03/winter-storm-descends-on-texas-bitcoin-miners-shut-off-to-protect-ercot.html\n\nThey only post FUD about Bitcoin/Crypto, articles full of lies and\nmisinformation. But this great factual article is nowhere to be seen there:\n\n> As a major winter storm descends on Texas,…"
}