{
  "author": "CaptAndrew12",
  "original_created_utc": 1646760998,
  "title": "i might die in 7 hours, and I'm not afraid.",
  "created_utc": 1646795823,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I (14M) have a bone disease known as Multiple Hereditary Exostoses (MHE). It causes benign bone tumors to grow everywhere on my body. Although they aren&amp;#39;t cancerous, they are very painful when they are near a nerve. &lt;/p&gt;\n\n&lt;p&gt;A lot of these tumors have grown in my knees, fingers and ribs. You can probably guess there are a lot of nerves and muscles there that can be pinched and pierced. It hurts quite a lot. I am constantly at level 5 pain (scale of 1-10). I can only walk for up to 2 minutes, I can&amp;#39;t write (with a pen, if I couldnt type this post wouldnt exist lol) and I&amp;#39;m basically in agony.&lt;/p&gt;\n\n&lt;p&gt;We have decided I will go for surgery to saw off some of the most painful tumors in my knee. Hopefully this will restore my ability to walk. The doctors have also decided we should remove 2 of my ribs, which have cracked due to the tumors. They&amp;#39;ll be replaced with metal I think.&lt;/p&gt;\n\n&lt;p&gt;There is a 20% chance of death with all these very complicated procedures, and of course a chance this surgery doesn&amp;#39;t change anything, or even makes it worse. Rolling a less than 6 sided dice to determine if I live or die. But to be honest, I don&amp;#39;t really care what happens in this surgery.&lt;/p&gt;\n\n&lt;p&gt;If it works, great, I can walk again. If it fails and my condition stays the same/deteriorates, I&amp;#39;ve adapted to this disease enough. I can probably handle a few turns for the worst. And if I die, well, I suppose then there is no more pain.&lt;/p&gt;\n\n&lt;p&gt;My friends say it is wrong for me to feel okay about dying. I&amp;#39;m not suicidal, I wouldn&amp;#39;t kill myself if I had the chance. But I don&amp;#39;t exactly care if I die at this point. It&amp;#39;s in fate&amp;#39;s hands at this point.&lt;/p&gt;\n\n&lt;p&gt;Comment anything, in 7 hours, I&amp;#39;ll be on the operating table that&amp;#39;ll determine my destiny.&lt;/p&gt;\n\n&lt;p&gt;EDIT: Soon about to enter the operating room. Welp, this is it. Let&amp;#39;s see our fate.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 76543,
  "permalink": "/r/TrueOffMyChest/comments/t9m7fl/i_might_die_in_7_hours_and_im_not_afraid/",
  "subreddit": "TrueOffMyChest",
  "id": "t9m7fl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I (14M) have a bone disease known as Multiple Hereditary Exostoses (MHE). It\ncauses benign bone tumors to grow everywhere on my body. Although they aren't\ncancerous, they are very painful when they are near a nerve.\n\nA lot of these tumors have grown in my knees, fingers and ribs. You can…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私（14M）は多発性骨膜外膜症（MHE）という骨の病気を持っています。この病気は\n私の体のあちこちに良性の骨腫瘍ができるのです。これらは\nがんになるのですが、神経の近くにできるととても痛いのです。\n\n膝や指、肋骨にたくさんできています。あなたは...",
      "title": "7時間後に死ぬかもしれないのに、怖くもなんともない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（14M）有一种被称为多发性遗传性外骨症（MHE）的骨骼疾病。它\n导致良性骨肿瘤在我身上到处生长。虽然它们并不是\n癌，但当它们靠近神经时就会非常疼痛。\n\n这些肿瘤很多都长在我的膝盖、手指和肋骨上。你可以...",
      "title": "我可能会在7个小时内死亡，但我并不害怕。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（14M）有一種被稱爲多發性遺傳性外骨症（MHE）的骨骼疾病。它\n導致良性骨腫瘤在我身上到處生長。雖然它們並不是\n癌，但當它們靠近神經時就會非常疼痛。\n\n這些腫瘤很多都長在我的膝蓋、手指和肋骨上。你可以...",
      "title": "我可能會在7個小時內死亡，但我並不害怕。"
    }
  ]
}