{
  "author": "Think-Yesterday-9012",
  "original_created_utc": 1657036044,
  "title": "what to say when your schoolmates ask you for your credit card info ?",
  "created_utc": 1657049318,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A guy asked me for money, i didn&amp;#39;t have it. Then he immediately asked me for my credit card and told me he would pay the amount he will use.&lt;/p&gt;\n\n&lt;p&gt;i feel insecure about giving away my credit card details, but WTF can i say ?&lt;/p&gt;\n\n&lt;p&gt;he said don&amp;#39;t you trust me, i gave away my details but did not give my OTP yet. i know this feels stupid but i didn&amp;#39;t know what to do in the moment. the reason i gave away my details is because i went on a vacation with the guy who asked me money and his friends through my mutual friend with whom i hang out mostly.&lt;/p&gt;\n\n&lt;p&gt;edit :&lt;/p&gt;\n\n&lt;p&gt;i called my credit card company and they said to cancel my card it takes 24-36 hours&lt;/p&gt;\n\n&lt;p&gt;i blocked my card successfully and applied for new card, 10k was drawn hope he repays me back&lt;/p&gt;\n\n&lt;p&gt;edit : 2&lt;/p&gt;\n\n&lt;p&gt;i did it because i would be isolated from him and his friends and i rarely hangout with him and his friends. it all happened quickly and i couldn&amp;#39;t venmo him because processing fee would be less if paid as rent in my credit card. so he took my card info.&lt;/p&gt;\n\n&lt;p&gt;edit : 3&lt;/p&gt;\n\n&lt;p&gt;i have his address and call records&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 115,
  "permalink": "/r/NoStupidQuestions/comments/vs0y1l/what_to_say_when_your_schoolmates_ask_you_for/",
  "subreddit": "NoStupidQuestions",
  "id": "vs0y1l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A guy asked me for money, i didn't have it. Then he immediately asked me for my\ncredit card and told me he would pay the amount he will use.\n\ni feel insecure about giving away my credit card details, but WTF can i say ?\n\nhe said don't you trust me, i gave away my details but did not give my OTP…"
}