{
  "author": "No_Weather682",
  "original_created_utc": 1633956338,
  "title": "I did a school project about Bitcoin in 2015 and got a 5/10 for being “useless” and “irrelevant”. Yesterday, I met my teacher again.",
  "created_utc": 1633962993,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Basically, in 2015 I did this big project in which you spend the whole year studying and researching about a topic and it’s worth the same credits as 3 subjects. Back then, crypto wasn’t as popular as it is now, not even close. However, I decided to make the project about blockchain technology and Bitcoin. Which by the time I thought it was super interesting as well as innovative. I spent the whole year studying blockchain and crypto, talking with professionals and doing what I thought that was a really good project.</p>\n\n<p>Nevertheless, the day I presented my work, the teachers told me that it was cool, but not a good topic for a big project since it was “irrelevant” and “useless” I remember that they would keep asking “if it’s so good, why is it that nobody is using it?” and some other dumb questions that made it clear they didn’t understand what was its true goal. I got a 5/10 and got really mad since I spent so much time and I really needed a good mark.</p>\n\n<p>Anyway, yesterday I met one of the teachers that I haven’t seen in years in the grocery store. The first thing he told me was that everyday he wishes he bought bitcoin back in 2015 when I first introduced to him. Then, I told him that he can still buy bitcoin now since it still has a lot of potential, but he thought he missed the train already. This made me realize that a lot of people wish they had bought bitcoin in 2015 or before, but won’t realize that in 2030 or later the will wish they had bought bitcoin in 2021.</p>\n\n<p>Moral of the story: The next best time to buy bitcoin/crypto is now. If you wish you had bought bitcoin under 100$, you will wish you had bought bitcoin at 50.000$ when it reaches 500.000$ in 5-10 years.</p>\n</div><!-- SC_ON -->",
  "score": 1352,
  "permalink": "/r/CryptoCurrency/comments/q5v1k1/i_did_a_school_project_about_bitcoin_in_2015_and/",
  "subreddit": "CryptoCurrency",
  "id": "q5v1k1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Basically, in 2015 I did this big project in which you spend the whole year\nstudying and researching about a topic and it’s worth the same credits as 3\nsubjects. Back then, crypto wasn’t as popular as it is now, not even close.\nHowever, I decided to make the project about blockchain technology and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "基本的に、2015年に私はこの大きなプロジェクトに参加しました。\nあるテーマについて1年間勉強し、研究して、3科目分の単位を取得するというものです。\n科目に相当します。当時はまだ暗号が今ほど普及していませんでしたし、それどころではありませんでした。\nしかし、私はこのプロジェクトをブロックチェーン技術についてのものにしようと決めました...",
      "title": "2015年にビットコインについての学校のプロジェクトをしましたが、「役に立たない」「関係ない」ということで5/10の評価を受けました。昨日、私は先生に再会しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "基本上，在2015年，我做了一个大项目，你花了一整年的时间来学习和研究一个主题。\n学习和研究一个主题，它的价值与3个科目的学分相同\n科目。那时，加密货币还没有像现在这样流行，甚至没有。\n然而，我决定将这个项目定为关于区块链技术和...",
      "title": "我在2015年做了一个关于比特币的学校项目，因为 \"无用 \"和 \"不相关\"，得到了5/10分。昨天，我又见到了我的老师。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "基本上，在2015年，我做了一個大項目，你花了一整年的時間來學習和研究一個主題。\n學習和研究一個主題，它的價值與3個科目的學分相同\n科目。那時，加密貨幣還沒有像現在這樣流行，甚至沒有。\n然而，我決定將這個項目定爲關於區塊鏈技術和...",
      "title": "我在2015年做了一個關於比特幣的學校項目，因爲 \"無用 \"和 \"不相關\"，得到了5/10分。昨天，我又見到了我的老師。"
    }
  ]
}