{
  "author": "Okmanl",
  "the_new_excerpt": "It's like you can't even add ****ing question marks at the end of your topic\ntitle without it getting auto-modded and removed.\n\nAnd there seems to be a billion key words that they added to the auto mod policy\nthat removes your post. I made a topic that was getting some traction and then\nit gets…",
  "original_created_utc": 1614500469,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "就像你在题目的最后连****，都不能加问号一样。\n标题而不被自动修改和删除。\n\n而且他们在自动修改政策中似乎添加了十亿个关键词。\n移除你的帖子。我做了一个话题，得到了一些牵引力，然后。\n它得到...",
      "title": "还有人觉得这个子网的版规政策有点过了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就像你在題目的最後連****，都不能加問號一樣。\n標題而不被自動修改和刪除。\n\n而且他們在自動修改政策中似乎添加了十億個關鍵詞。\n移除你的帖子。我做了一個話題，得到了一些牽引力，然後。\n它得到...",
      "title": "還有人覺得這個子網的版規政策有點過了。"
    }
  ],
  "title": "Anybody else think that the moderation policy in this subreddit is a bit too much.",
  "created_utc": 1614523391,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s like you can&#39;t even add ****ing question marks at the end of your topic title without it getting auto-modded and removed.</p>\n\n<p>And there seems to be a billion key words that they added to the auto mod policy that removes your post. I made a topic that was getting some traction and then it gets deleted because I made a quick edit. I honestly don&#39;t know what it was. Y**Tu*e? S****ng **pha?</p>\n\n<p>At this point i&#39;m pretty annoyed am considering just moving to the other place (I guess s*br****it and r*s**ks are banned words? Jesus). The rules are more lax. The quality of posts are pretty much the same as here.</p>\n\n<p>I literally had to edit this post 5 different times, each time deleting different paragraphs and rewriting it because there seems to be key words that are banned that doesn&#39;t even make sense on why they&#39;re banned.</p>\n</div><!-- SC_ON -->",
  "score": 284,
  "permalink": "/r/investing/comments/luat92/anybody_else_think_that_the_moderation_policy_in/",
  "subreddit": "investing",
  "id": "luat92",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937740755
}