{
  "author": "thatboy_raz",
  "original_created_utc": 1654096141,
  "title": "A social media platform where individuals can work on planned goals/projects independently or collaboratively with friends or group members. I used TV and film characters for the examples of how it could be used.",
  "created_utc": 1654116650,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I wanted to create a social platform that revolves around productivity and self improvement through plans. There’ll be a feature called a “Plan” which will be used as a guide to help users accomplish what it is they wish to accomplish. It’ll consist of primary and secondary steps (clicking on a primary step to reveal all the other secondary steps they added to it), a progress tracker to indicate how close one is to achieving their goal or project, users will be able to select the estimated dates they want the steps in their objective to be completed by. “Plans” will also be a great way for people to help out other members of their groups by creating recommended plans that they can make for people who are seeking plans for certain objectives that they could follow, such as a type of diet or exercise routine. Plans can be sent to “posts” in a similar fashion to how a comment does, so that other members can upvote or “adopt” the plan for their own use. “Adopt plan” will be a way of duplicating a plan that users see or share around to friends into their own “Goals” or “Projects to work on, like a copy and paste method to which they can leave as is or customise to suit them. The design is a work in progress as of now and I am still thinking of ways I can add more value to this project. Feedback would be lovely. If this is something you would love to use, please add your email in the link below. Thanks.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://docs.google.com/forms/d/1reKptq_DLh09pepZDMCDiB95hCTVPggx9MvvJ9Rj0PQ/edit\"&gt;https://docs.google.com/forms/d/1reKptq_DLh09pepZDMCDiB95hCTVPggx9MvvJ9Rj0PQ/edit&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/7d53wecjz0391.png?width=918&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=2db249ea8c8f78c4d758108968bdb939ebff4f55\"&gt;https://preview.redd.it/7d53wecjz0391.png?width=918&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=2db249ea8c8f78c4d758108968bdb939ebff4f55&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/v2j5ku/a_social_media_platform_where_individuals_can/",
  "subreddit": "SideProject",
  "id": "v2j5ku",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I wanted to create a social platform that revolves around productivity and self\nimprovement through plans. There’ll be a feature called a “Plan” which will be\nused as a guide to help users accomplish what it is they wish to accomplish.\nIt’ll consist of primary and secondary steps (clicking on a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "生産性と自己を軸としたソーシャルプラットフォームを作りたかった。\nソーシャルプラットフォームを作りたかったんです。プランと呼ばれる機能があります。\nユーザーが達成したいことを実現するためのガイドとして使用します。\nプランは、一次ステップと二次ステップから構成され、一次ステップをクリックすると、二次ステップに移行します。",
      "title": "個人が独立して、または友人やグループメンバーと共同で、計画した目標/プロジェクトに取り組むことができるソーシャルメディアプラットフォーム。テレビや映画のキャラクターを例にして、その使い方を紹介しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想创建一个社会平台，围绕着生产力和自我改善\n通过计划进行自我改善。将会有一个叫做 \"计划 \"的功能，它将被用作指南，帮助用户完成他们希望完成的事情。\n作为一个指南，帮助用户完成他们希望完成的事情。\n它将由主要和次要步骤组成（点击 \"计划\"）。",
      "title": "一个社交媒体平台，个人可以独立或与朋友或小组成员合作完成计划的目标/项目。我用电视和电影中的人物来举例说明如何使用它。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想創建一個社會平臺，圍繞着生產力和自我改善\n通過計劃進行自我改善。將會有一個叫做 \"計劃 \"的功能，它將被用作指南，幫助用戶完成他們希望完成的事情。\n作爲一個指南，幫助用戶完成他們希望完成的事情。\n它將由主要和次要步驟組成（點擊 \"計劃\"）。",
      "title": "一個社交媒體平臺，個人可以獨立或與朋友或小組成員合作完成計劃的目標/項目。我用電視和電影中的人物來舉例說明如何使用它。"
    }
  ]
}