{
  "author": "Macintyre2021",
  "the_new_excerpt": "I wanted to see how reasonable this claim is made by a philosopher. I already\nasked r/academicbiblical [/r/academicbiblical]. I wanted to hear what other\nhistorians thought.\n\nI read an article\n[https://place.asburyseminary.edu/faithandphilosophy/vol28/iss2/1/] by a\nphilosophy professor named Stephen…",
  "original_created_utc": 1619486599,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "哲学者がこのような主張をすることがどれほど合理的なことなのかを知りたいと思いました。私はすでに\nr/academicbiblical [/r/academicbiblical]に聞いてみました。私は、他の\n歴史家の考えを聞きたかったのです。\n\nある記事を読みました。\n[https://place.asburyseminary.edu/faithandphilosophy/vol28/iss2/1/]という記事を読みました。\nStephenという哲学教授の記事を読んで...",
      "title": "物語の中に超自然的な出来事があると、物語全体の歴史性が疑われるのではないか？奇跡を伴う記述を信頼できるものとみなすことができるのか？これには、超自然的な記述のある物語を通してしかその存在を知らない人の存在を否定することも含まれますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想看看一个哲学家提出的这个主张有多大的合理性。我已经\n问过r/academicbiblical [/r/academicbiblical]。我想听听其他\n历史学家的想法。\n\n我读了一篇文章\n[https://place.asburyseminary.edu/faithandphilosophy/vol28/iss2/1/]，作者是\n哲学教授斯蒂芬...",
      "title": "叙事中出现的超自然事件是否让人怀疑整个叙事的历史性？我们能把有神迹的叙述看作是可靠的吗？这将包括否认任何我们只通过带有超自然的叙述来了解其存在的人的存在？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想看看一個哲學家提出的這個主張有多大的合理性。我已經\n問過r/academicbiblical [/r/academicbiblical]。我想聽聽其他\n歷史學家的想法。\n\n我讀了一篇文章\n[https://place.asburyseminary.edu/faithandphilosophy/vol28/iss2/1/]，作者是\n哲學教授斯蒂芬...",
      "title": "敘事中出現的超自然事件是否讓人懷疑整個敘事的歷史性？我們能把有神蹟的敘述看作是可靠的嗎？這將包括否認任何我們只通過帶有超自然的敘述來了解其存在的人的存在？"
    }
  ],
  "title": "Do the presence of supernatural events in narratives call into doubt the historicity of the entire narrative? Can we view an account with miracles as reliable? This would include denying the existence of anyone who we only know their existence through narratives with supernatural accounts?",
  "created_utc": 1619514875,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I wanted to see how reasonable this claim is made by a philosopher. I already asked <a href=\"/r/academicbiblical\">r/academicbiblical</a>. I wanted to hear what other historians thought.</p>\n\n<p>I read an <a href=\"https://place.asburyseminary.edu/faithandphilosophy/vol28/iss2/1/\">article</a> by a philosophy professor named Stephen Law; he argues that due to the amount of miracle stories in the NT we should be skeptical of other parts of the NT commonly regarded as historical. He is not a mythicist but he thinks the existence of Jesus is no better than a coin flip. He makes two arguments (1) that we cannot trust the testimony of the Gospels regarding the miracles attributed to Jesus due to Hume&#39;s arguments against miracles and (2) miracle accounts contaminates the entire narrative and should cause one to doubt the other parts of the narrative. If we only have the narrative which includes a miraculous account to prove the existence of someone then we dont have good evidence they exist. If this was applied throughout history, which other figures which we think exist would we no longer be able to say exist? Is this too high of a standard. </p>\n\n<p>Side note: Stephen Law also doubts the authenticity of Tacitus and Josephus&#39; works.  He view&#39;s the claims of Josephus as made by Christian editors, possibly whole cloth. Tacitus and Josephus only knew Jesus existed due to the claims of Christians so they aren&#39;t trustworthy sources for Jesus&#39; existence.</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/mzd9gz/do_the_presence_of_supernatural_events_in/",
  "subreddit": "AskHistorians",
  "id": "mzd9gz",
  "is_self": true,
  "media": null,
  "is_video": false
}