{
  "author": "tombomp",
  "the_new_excerpt": "This system seems so fascinating and bizarre that I'm not even sure what\nquestions to ask about it. I'm completely ignorant on the Spanish political\nclimate at the time too so I'm curious about any context to this.",
  "original_created_utc": 1622838663,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このシステムは、あまりにも魅力的で奇妙なので、何を質問していいのかわからない。\n質問していいのかわからないほどです。私は当時のスペインの政治情勢についてはまったく無知なので\n当時のスペインの政治情勢についても全く無知なので、どんな背景があるのか興味があります。",
      "title": "1876年から1916年まで、スペインの二大政党は、事前に選挙結果を合意することで、任期を交代していました。このシステムはどのようにして生まれ、安定していたのでしょうか？政党間の違いはあったのか？地元の有権者レベルではどのように実施されたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个系统看起来如此迷人和怪异，以至于我甚至不确定要问什么\n问题来问它。我对当时的西班牙政治气候也完全不了解，所以我很好奇这其中的背景。\n我对当时的西班牙政治气候也一无所知，所以我很好奇这其中的任何背景。",
      "title": "从1876年到1916年，西班牙的两个主要政党通过事先商定选举结果来轮流任职。这一制度是如何形成并保持稳定的？他们是否有任何党派分歧？在地方选民层面上是如何执行的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個系統看起來如此迷人和怪異，以至於我甚至不確定要問什麼\n問題來問它。我對當時的西班牙政治氣候也完全不瞭解，所以我很好奇這其中的背景。\n我對當時的西班牙政治氣候也一無所知，所以我很好奇這其中的任何背景。",
      "title": "從1876年到1916年，西班牙的兩個主要政黨通過事先商定選舉結果來輪流任職。這一制度是如何形成並保持穩定的？他們是否有任何黨派分歧？在地方選民層面上是如何執行的？"
    }
  ],
  "title": "From 1876 to 1916 the two main Spanish political parties alternated terms in offices by agreeing election results in advance. How did the system come about and stay stable? Were they any party differences? How was this enforced at a local voter level?",
  "created_utc": 1622848113,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This system seems so fascinating and bizarre that I&#39;m not even sure what questions to ask about it. I&#39;m completely ignorant on the Spanish political climate at the time too so I&#39;m curious about any context to this.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/nseqms/from_1876_to_1916_the_two_main_spanish_political/",
  "subreddit": "AskHistorians",
  "id": "nseqms",
  "is_self": true,
  "media": null,
  "is_video": false
}