{
  "author": "warrior2012",
  "the_new_excerpt": "I had a friend message me a few days ago saying he heard how doge blew up\novernight. He said he saw it went up over 500% but it was still sitting at only\n$0.06 a coin (down to $0.04 now). He asked me if I thought it was worth buying a\nbunch of dogecoin because, and I quote, \"it wouldn't take much to…",
  "original_created_utc": 1612163760,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "前几天有个朋友给我发信息，说他听到了狗子是怎么爆炸的。\n一夜之间。他说，他看到它涨了500%以上，但它仍然只停留在...\n0.06元一个硬币（现在降到0.04元）。他问我是否觉得值得买一个。\n一堆狗币，因为，我引用，\"它不会采取太多的... ...\"。",
      "title": "为什么理解市值如此重要。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "前幾天有個朋友給我發信息，說他聽到了狗子是怎麼爆炸的。\n一夜之間。他說，他看到它漲了500%以上，但它仍然只停留在...\n0.06元一個硬幣（現在降到0.04元）。他問我是否覺得值得買一個。\n一堆狗幣，因爲，我引用，\"它不會採取太多的... ...\"。",
      "title": "爲什麼理解市值如此重要。"
    }
  ],
  "title": "Why understanding market cap is so important.",
  "created_utc": 1612193972,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I had a friend message me a few days ago saying he heard how doge blew up overnight. He said he saw it went up over 500% but it was still sitting at only $0.06 a coin (down to $0.04 now). He asked me if I thought it was worth buying a bunch of dogecoin because, and I quote, &quot;it wouldn&#39;t take much to drive it from $0.06 up to $0.12&quot;. </p>\n\n<p>There seems to be a fundamental misunderstanding of how market cap actually work in cryptocurrencies. The equation is very simple! Number of coins in circulation multiplied by price per coin. </p>\n\n<p>The problem comes into play when you compare how many coins will be in circulation with a given crypto. With Bitcoin, you will have a total of 21 million coins in circulation when they are fully mined. With Litecoin, you will have a total of 84 million coins currently in circulation when full mined. So when you look at the total of these coins, you see that Litecoin has 4x the max coins that will be in circulation. So when you account this for price, you would have to compare 1 Bitcoin to 4 Litecoin to get a comparity value in price when looking for market cap.</p>\n\n<p>Now turning back to doge, they have a current supply of a 128 billion coins with a never ending supply. I have seen some discussion of adding a hard cap, but haven&#39;t read anything concrete yet. So using the current circulation at 128 billion coins at the now $0.04 a piece, this places the market cap at over $5 billion. For doge to reach $0.12, you would now need to triple that $5 billion. So to say that dogecoin could go from $0.04 to $0.12 is easy because it&#39;s only an $0.08 difference. To say $5 billion to $15 billion is a lot harder. </p>\n\n<p>As a side note, don&#39;t forget one of the major advantage that cryptocurrencies have over fiat currencies. A US dollar can only be divided to 2 decimal places. Bitcoin is divisible upto 8 decimal places. Some crypto currencies are divisible upto 30. I&#39;ve noticed people tend to buy coins they can hold a lot of because of the attitude &quot;when this coin reaches a dollar, I&#39;ll be a millionaire&quot;. If the coin is only currently worth half a cent, what is the true likelyhood that it is going to 200x its way to a $1? Be reasonable with your expectations and the way you invest your money. This means sometimes its worth it to buy a small fraction of a coin with a high price and fewer coins in circulation, rather than thousands of coins with a low price and more coins in circulation.</p>\n</div><!-- SC_ON -->",
  "score": 262,
  "permalink": "/r/CryptoCurrency/comments/l9xha6/why_understanding_market_cap_is_so_important/",
  "subreddit": "CryptoCurrency",
  "id": "l9xha6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518530862
}