{
  "author": "RunningJay",
  "the_new_excerpt": "Know the market, know the company, know the product\n\nPretty simple concept really. Here are some questions I commonly ask:\n\nMarket\n\n * What market does this company play in?\n * Do I understand this market?\n * If there are multiple, what is its focus, where is its R&D spend, what keeps\n   their…",
  "original_created_utc": 1613148796,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "了解市场、了解公司、了解产品。\n\n很简单的概念，真的。下面是我常问的一些问题。\n\n市场\n\n *这家公司在什么市场上打拼？\n * 我是否了解这个市场？\n * 如果有多个，它的重点是什么，它的研发经费在哪里，是什么让它的研发经费不断增加？\n   其",
      "title": "我如何选择一个我认为会爆炸的股票。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "瞭解市場、瞭解公司、瞭解產品。\n\n很簡單的概念，真的。下面是我常問的一些問題。\n\n市場\n\n *這家公司在什麼市場上打拼？\n * 我是否瞭解這個市場？\n * 如果有多個，它的重點是什麼，它的研發經費在哪裏，是什麼讓它的研發經費不斷增加？\n   其",
      "title": "我如何選擇一個我認爲會爆炸的股票。"
    }
  ],
  "title": "How I pick a stock that I think will explode",
  "created_utc": 1613153911,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Know the market, know the company, know the product</p>\n\n<p>Pretty simple concept really.  Here are some questions I commonly ask:</p>\n\n<p><strong>Market</strong> </p>\n\n<ul>\n<li>What market does this company play in? </li>\n<li>Do I understand this market? </li>\n<li>If there are multiple, what is its focus, where is its R&amp;D spend, what keeps their lights on? </li>\n<li>What is the size of the market?  Is it growing? </li>\n<li>What&#39;s going on with this market?  Is it in the news?  Is it legacy or the future? </li>\n<li>What are the challenges of the market? </li>\n<li>Are there economic cycles?</li>\n</ul>\n\n<p><strong>Competitors</strong> </p>\n\n<ul>\n<li>Who are the competitors? </li>\n<li>What are their products, their competitive advantage (or lack thereof), their management (see below), and their reputation? </li>\n<li>Where do they compete? </li>\n<li>Do they have a Moat? </li>\n<li>Are they growing or retracting? </li>\n<li>Know their financials (see below)</li>\n</ul>\n\n<p><strong>Company</strong> </p>\n\n<ul>\n<li>What do they do? </li>\n<li>Know their financials, are they making money?  YOY/QOQ growth, eps, market cap, NI, debt, cash flow, etc..  Know ALL the fundamentals.<br/></li>\n<li>How do they compare to their competitors?</li>\n<li>Who is the management team?  Where have they been?  What is their vision? Are they buying/selling stock. Read their letters and anything they&#39;ve released to shareholders.  Listen to their earning calls, watch them in the media, google them! </li>\n<li>Are their employees happy?  Check out Glassdoor, LinkedIn.  They can be candid and you can learn a lot about the company from what they&#39;re saying. </li>\n<li>How is the company perceived?  In the media, by their competitors, by analysts, etc. </li>\n<li>Do they have a Moat?</li>\n</ul>\n\n<p><strong>Product</strong> </p>\n\n<ul>\n<li>What does to company make? What are their products?</li>\n<li>Are they diversified or specialized?</li>\n<li>How is it perceived by customers, by analysts, and people who compare products (e.g. Gartner, etc.). </li>\n<li>Why are people buying it? </li>\n<li>What problems is this product solving?<br/></li>\n<li>Do these problems matter? </li>\n<li>How easy is it to replicate?  Can it be produced cheaper elsewhere or the IP has taken?</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>Now you have some data, you need to figure out what to do with it.</p>\n\n<p>Here are some ideas: </p>\n\n<p><strong>New company in a legacy market with a disruptive product</strong></p>\n\n<ul>\n<li>Can they can take market share and grow while taking revenue from competitors?</li>\n</ul>\n\n<p><strong>New market</strong></p>\n\n<ul>\n<li>Find the leaders, find those with the strongest balance sheets, those that can beat their competitors</li>\n</ul>\n\n<p><strong>Existential needs</strong></p>\n\n<ul>\n<li>Do their customers NEED to buy their products? Compliance requirements, etc. </li>\n<li>Can they solve a major, global problem?</li>\n</ul>\n\n<p><strong>Legacy company which has pivoted</strong></p>\n\n<ul>\n<li>New management?  New product?  Entered a new market?</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>There are many, many more questions and ideas.  I&#39;d love to hear your thoughts on the questions you ask and the ideas you have when looking at a company for growth.</p>\n</div><!-- SC_ON -->",
  "score": 3049,
  "permalink": "/r/stocks/comments/lif3cm/how_i_pick_a_stock_that_i_think_will_explode/",
  "subreddit": "stocks",
  "id": "lif3cm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728623031
}