{
  "author": "weinermcgee",
  "original_created_utc": 1651019759,
  "title": "Are people turning their cars off every time they stop for even a little bit or is this something new cars do on their own?",
  "created_utc": 1651028362,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been at stoplights and I&amp;#39;ll hear a vehicle cut off when it stops and then restart the engine when the light turns green. Today I was next to a crossing guard and heard a car on the road start up when he opened the road back up. Is this something people are doing to save gas or something new cars are doing on their own for some reason?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 135,
  "permalink": "/r/NoStupidQuestions/comments/ucr1nf/are_people_turning_their_cars_off_every_time_they/",
  "subreddit": "NoStupidQuestions",
  "id": "ucr1nf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been at stoplights and I'll hear a vehicle cut off when it stops and then\nrestart the engine when the light turns green. Today I was next to a crossing\nguard and heard a car on the road start up when he opened the road back up. Is\nthis something people are doing to save gas or something new…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "信号待ちで、停車時に車両が切れる音を聞いてから\n信号が青になるとエンジンを再始動させる。今日、私は横断歩道の警備員の隣にいたのですが\n道路を走っていた車が、道路を再開したときにエンジンがかかる音がしました。これは\nガソリンを節約するためにやっていることなのか、それとも新しいことなのか...。",
      "title": "少しでも停車するたびに電源を切っている人がいるのか、それとも新しいクルマが勝手にやっているのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我曾在红绿灯前，听到车辆在停车时切断电源，然后在灯亮时重新启动发动机。\n当绿灯亮起时重新启动引擎。今天我在一个十字路口的警卫旁边\n今天，我在一个十字路口的警卫旁边，听到当他把路重新打开时，路上的一辆车启动了。这是不是\n这是人们为了节省汽油而做的事情，还是什么新的事情...",
      "title": "人们是否在每次停车时都会关闭他们的汽车，哪怕是一点点，还是说这是新车自己的事情？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾在紅綠燈前，聽到車輛在停車時切斷電源，然後在燈亮時重新啓動發動機。\n當綠燈亮起時重新啓動引擎。今天我在一個十字路口的警衛旁邊\n今天，我在一個十字路口的警衛旁邊，聽到當他把路重新打開時，路上的一輛車啓動了。這是不是\n這是人們爲了節省汽油而做的事情，還是什麼新的事情...",
      "title": "人們是否在每次停車時都會關閉他們的汽車，哪怕是一點點，還是說這是新車自己的事情？"
    }
  ]
}