{
  "author": "cestabhi",
  "original_created_utc": 1635941560,
  "title": "Why did Western clothing become the norm in most non-Western countries?",
  "created_utc": 1635965418,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you walk down any street in most non-Western countries today, you&#39;ll notice that most people regardless of ethnicity, religion or occupation wear Western clothes. </p>\n\n<p>But less than a hundred years ago, it wasn&#39;t too uncommon to see most people in, say <a href=\"https://youtu.be/SamNTXQrkuk\">India</a> or <a href=\"https://youtu.be/w4fdhAz0VSw\">Korea</a> wear their own traditional clothing. </p>\n\n<p>So why did Western clothing become the norm in most non-Western countries, and why was it so thoroughly accepted by the native populations?</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/qlt3wn/why_did_western_clothing_become_the_norm_in_most/",
  "subreddit": "AskHistorians",
  "id": "qlt3wn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If you walk down any street in most non-Western countries today, you'll notice\nthat most people regardless of ethnicity, religion or occupation wear Western\nclothes.\n\nBut less than a hundred years ago, it wasn't too uncommon to see most people in,\nsay India [https://youtu.be/SamNTXQrkuk] or Korea…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在、欧米以外の国のほとんどの国では、街を歩けば、ほとんどの人が\n民族、宗教、職業を問わず、ほとんどの人が西洋の服を着ていることに気づくでしょう。\nの服を着ています。\n\nしかし、100年も前には、ほとんどの人が西洋の服を着ているのは、それほど珍しいことではありませんでした。\n例えばインド [https://youtu.be/SamNTXQrkuk] や韓国...。",
      "title": "なぜ西洋の服が非西洋のほとんどの国で普通になったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你走在今天大多数非西方国家的任何街道上，你会注意到\n大多数人，无论其种族、宗教或职业，都穿着西方的\n衣服。\n\n但在不到一百年前，看到大多数人在......并不是太罕见。\n比如印度[https://youtu.be/SamNTXQrkuk]或韩国...",
      "title": "为什么西方服装在大多数非西方国家成为标准？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你走在今天大多數非西方國家的任何街道上，你會注意到\n大多數人，無論其種族、宗教或職業，都穿着西方的\n衣服。\n\n但在不到一百年前，看到大多數人在......並不是太罕見。\n比如印度[https://youtu.be/SamNTXQrkuk]或韓國...",
      "title": "爲什麼西方服裝在大多數非西方國家成爲標準？"
    }
  ]
}