{
  "author": "dzee_1",
  "original_created_utc": 1628855105,
  "title": "Charles Hoskinson plus toilet roll.",
  "created_utc": 1628872723,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>During the Bitcoin conference in Miami back in april a maximilist threw a toilet roll at Charles Hoskinson with the word &quot;shitcoin&quot; written in coloured pen at him. \nHe referred to this in a YouTube video uploaded a couple days after the conference.</p>\n\n<p>On behalf of all Charles Hoskinson and Cardano fans  I would like to stick the proverbial middle finger up at the maximilists as ADA pumps and Smart Contracts are imminent.</p>\n\n<p>The anti this and anti that sentiment is pointless, it only hurts us as a community.\nThis space is big enough for all of us regardless of where our loyalties lie.</p>\n\n<p>Edit thanks for all the positive comments</p>\n</div><!-- SC_ON -->",
  "score": 214,
  "permalink": "/r/CryptoCurrency/comments/p3lq95/charles_hoskinson_plus_toilet_roll/",
  "subreddit": "CryptoCurrency",
  "id": "p3lq95",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "During the Bitcoin conference in Miami back in april a maximilist threw a toilet\nroll at Charles Hoskinson with the word \"shitcoin\" written in coloured pen at\nhim. He referred to this in a YouTube video uploaded a couple days after the\nconference.\n\nOn behalf of all Charles Hoskinson and Cardano fans…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "4月にマイアミで開催されたビットコインカンファレンスでは、あるマキシミリストがトイレットロールをChaChaに投げつけました。\nチャールズ・ホスキンソンにトイレットロールを投げつけ、カラーペンで「shitcoin」と書いた。\n投げつけました。彼はカンファレンスの数日後にアップロードされたYouTubeのビデオでこのことを言及しています。\nと述べています。\n\nすべてのチャールズ・ホスキンソンとカルダノファンを代表して...",
      "title": "チャールズ・ホスキンスンとトイレットロール"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "4月在迈阿密举行的比特币会议上，一位格言家向查尔斯-霍斯金森扔了一个马桶卷，上面写着 \"show\"。\n向查尔斯-霍斯金森扔了一个马桶卷，上面用彩色笔写着 \"shitcoin \"一词。\n他。他在会议结束后几天上传的YouTube视频中提到了这一点。\n会议。\n\n我代表所有查尔斯-霍斯金森和卡达诺粉丝...",
      "title": "查尔斯-霍斯金森加上卫生卷。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "4月在邁阿密舉行的比特幣會議上，一位格言家向查爾斯-霍斯金森扔了一個馬桶卷，上面寫着 \"show\"。\n向查爾斯-霍斯金森扔了一個馬桶卷，上面用彩色筆寫着 \"shitcoin \"一詞。\n他。他在會議結束後幾天上傳的YouTube視頻中提到了這一點。\n會議。\n\n我代表所有查爾斯-霍斯金森和卡達諾粉絲...",
      "title": "查爾斯-霍斯金森加上衛生卷。"
    }
  ]
}