{
  "author": "FractalImagination",
  "original_created_utc": 1634413274,
  "title": "If any of you make substantial money from crypto, keep it to yourself. Not everyone is your friend.",
  "created_utc": 1634423462,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I used to live in a shelter in Toronto. Met a lot of people and we were all broke. Broke people can be friends.. but when I started getting my life together and saving money, I told only some of my friends how much I had. I don&#39;t know if they told other people out of jealousy or what but people I barely knew came out the woodwork asking to borrow money. They and even my friends gave me the cold shoulder when I refused. </p>\n\n<p>I guarantee you it will be the same if you have a substantial amount of money. People get jealous and start acting entitled to your money because they have less.. and that&#39;s not ok. Don&#39;t let ANYONE make you feel bad or guilty if you don&#39;t want to share.. truth is, they have the same opportunities as any of us here and they don&#39;t take them. </p>\n\n<p>You are the ones who wake up everyday, earn your money and learn how to invest it. You don&#39;t owe anyone!\nEven your own family can turn on you.. matter of fact, I&#39;m 35 and I have found family to be the least dependable and the ones who will stab you in the back the most (Not going to apply to everyone obviously)</p>\n\n<p>Stay safe and focused my people!</p>\n</div><!-- SC_ON -->",
  "score": 183,
  "permalink": "/r/CryptoCurrency/comments/q9j14j/if_any_of_you_make_substantial_money_from_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "q9j14j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I used to live in a shelter in Toronto. Met a lot of people and we were all\nbroke. Broke people can be friends.. but when I started getting my life together\nand saving money, I told only some of my friends how much I had. I don't know if\nthey told other people out of jealousy or what but people I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は以前、トロントのシェルターに住んでいました。多くの人と出会い、みんな一文無しでした。\n破産していました。破産した人は友達になれる......でも、自分の生活を立て直してお金を貯め始めた時は\nお金を貯め始めた時に、何人かの友達にしか自分の所持金を教えなかったんだ。彼らが他の人に話したかどうかは分からない。\n嫉妬して他の人に話したのかどうかは分からないけど、私が...",
      "title": "もし皆さんの中で、暗号から相当なお金を稼いでいる人がいたら、それは自分の胸にしまっておいてください。誰もがあなたの友人ではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我曾经住在多伦多的一个收容所里。认识了很多人，我们都是\n破产。破产的人可以成为朋友......但当我开始整理我的生活时\n和存钱时，我只告诉了一些朋友我有多少钱。我不知道是否\n他们告诉其他人是出于嫉妒还是什么，但我的人...",
      "title": "如果你们中有人从加密货币中赚了大钱，请自己留着。不是每个人都是你的朋友。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾經住在多倫多的一個收容所裏。認識了很多人，我們都是\n破產。破產的人可以成爲朋友......但當我開始整理我的生活時\n和存錢時，我只告訴了一些朋友我有多少錢。我不知道是否\n他們告訴其他人是出於嫉妒還是什麼，但我的人...",
      "title": "如果你們中有人從加密貨幣中賺了大錢，請自己留着。不是每個人都是你的朋友。"
    }
  ]
}