{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": " \n\nI've been investing, trading, gambling for about 5 years now and I've done pretty much every rookie mistake there is. Sold winners from 2016 (Shop,Nvidia,AMD,Paypal) Lost fortunes on chasing that pennystock. Played and lost with trying to time the market, option trading.\n\nI've been very active during these years reading and learning and you be surprised how often people get sucked in to the same stuff you self did once.\n\nThese are 8 guidelines that really helps me and that I've learn to appreciate over the years.\n\n**1.Don't FOMO**\n\nYes we all heard it. You know that feeling when people are posting crazy gains on these new stocks, we all saw the EV hype. It's so so easy to get sucked in to thinking, if I just put in some money right now I can get 10-20-50% gains in a few days! It's already up 200% this month, surely it will keep going!?\n\nThis takes some real patience to keep your head cool and realize it could very well be overbought and the downside risk is just a lot higher than potential.\n\nI've seen several sector hypes. We all remember the crypto bubble, the weed bubble and now lately the EV bubble. They all come and go and the more of these you been in from the start the easier it is to realize what's going on.\n\n**2. Cut your losers and let your winners run**\n\nBuying the dip is great when the market is down but if the fundamentals of the business is bad then usually this will just result in greater loss. On the flipside, if you have a few great picks and nothing fundamentally has changed and it keeps moving in the right direction then don't be afarid to keep adding.\n\n**3. When the overall market is down, you buy**\n\nNo one can predict the market, don't waste time on it. When the overall market is down your stock is literally on sale. Usually every sector is down when the market is down, your stock and business has not changed one bit however, it's just a lower price now.\n\n**4. Don't be afraid of corrections.**\n\nYeah it sucks seeing your portfolio down 20-30-40% but realize that stocks always go up, they seriously always do. Just keep your head down, keep buying and play that long game.\n\n**5. Small amounts can turn into big profits down the line**\n\nWhen you get really into investing you seriously start rethinking your life. That new OLED 77 inch? Only 2k right? What do you think that 2000 could be in 10 years? You just want to put every damn penny you got in the stock market because compounding interests are just too good to pass up. So just rethink if really need that new thing now or if it could wait.\n\n**6. If the company keeps growing, why sell?**\n\nTaking profit is good however not always the best thing to do. If the stock you have keeps growing and keeps crushing earnings. Why should you sell? Why just not keep it for years, it sure can be tempting but are you sure that money could be spent better elsewhere when it's easily growing in your winning stock.\n\n**7, Never regret that you didn't buy more**\n\nWe all been here. Why the hell didn't I buy more of Amazon? Why didn't I just put my whole paycheck in this stock!?\n\nYou can never do this. It won't lead to anything, you can't fix it and you honestly did the best decisions at the time with the information you had. Realize that at the time this was the best decision, ofcourse hindsight it looks like you could have done a better decision.\n\n**8. Don't sell and buy in again to time a correction**\n\nThis is very hard and with the momentum some growth stocks have these days you might just end up loosing more of that profit even if there is a slight correction. Just keep the money in and stop worrying.",
  "author_fullname": "t2_8m6kj2f3",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "My 8 investing guidelines",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "advice",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_s7qni2",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.82,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 159,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Advice",
  "can_mod_post": false,
  "score": 159,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1642600574,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been investing, trading, gambling for about 5 years now and I&amp;#39;ve done pretty much every rookie mistake there is. Sold winners from 2016 (Shop,Nvidia,AMD,Paypal) Lost fortunes on chasing that pennystock. Played and lost with trying to time the market, option trading.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been very active during these years reading and learning and you be surprised how often people get sucked in to the same stuff you self did once.&lt;/p&gt;\n\n&lt;p&gt;These are 8 guidelines that really helps me and that I&amp;#39;ve learn to appreciate over the years.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;1.Don&amp;#39;t FOMO&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Yes we all heard it. You know that feeling when people are posting crazy gains on these new stocks, we all saw the EV hype. It&amp;#39;s so so easy to get sucked in to thinking, if I just put in some money right now I can get 10-20-50% gains in a few days! It&amp;#39;s already up 200% this month, surely it will keep going!?&lt;/p&gt;\n\n&lt;p&gt;This takes some real patience to keep your head cool and realize it could very well be overbought and the downside risk is just a lot higher than potential.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve seen several sector hypes. We all remember the crypto bubble, the weed bubble and now lately the EV bubble. They all come and go and the more of these you been in from the start the easier it is to realize what&amp;#39;s going on.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;2. Cut your losers and let your winners run&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Buying the dip is great when the market is down but if the fundamentals of the business is bad then usually this will just result in greater loss. On the flipside, if you have a few great picks and nothing fundamentally has changed and it keeps moving in the right direction then don&amp;#39;t be afarid to keep adding.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;3. When the overall market is down, you buy&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;No one can predict the market, don&amp;#39;t waste time on it. When the overall market is down your stock is literally on sale. Usually every sector is down when the market is down, your stock and business has not changed one bit however, it&amp;#39;s just a lower price now.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;4. Don&amp;#39;t be afraid of corrections.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Yeah it sucks seeing your portfolio down 20-30-40% but realize that stocks always go up, they seriously always do. Just keep your head down, keep buying and play that long game.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;5. Small amounts can turn into big profits down the line&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;When you get really into investing you seriously start rethinking your life. That new OLED 77 inch? Only 2k right? What do you think that 2000 could be in 10 years? You just want to put every damn penny you got in the stock market because compounding interests are just too good to pass up. So just rethink if really need that new thing now or if it could wait.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;6. If the company keeps growing, why sell?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Taking profit is good however not always the best thing to do. If the stock you have keeps growing and keeps crushing earnings. Why should you sell? Why just not keep it for years, it sure can be tempting but are you sure that money could be spent better elsewhere when it&amp;#39;s easily growing in your winning stock.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;7, Never regret that you didn&amp;#39;t buy more&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;We all been here. Why the hell didn&amp;#39;t I buy more of Amazon? Why didn&amp;#39;t I just put my whole paycheck in this stock!?&lt;/p&gt;\n\n&lt;p&gt;You can never do this. It won&amp;#39;t lead to anything, you can&amp;#39;t fix it and you honestly did the best decisions at the time with the information you had. Realize that at the time this was the best decision, ofcourse hindsight it looks like you could have done a better decision.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;8. Don&amp;#39;t sell and buy in again to time a correction&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This is very hard and with the momentum some growth stocks have these days you might just end up loosing more of that profit even if there is a slight correction. Just keep the money in and stop worrying.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "823be0a6-65e6-11e5-9784-125ee764bc01",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#646d73",
  "id": "s7qni2",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "similiarintrests",
  "discussion_type": null,
  "num_comments": 53,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/s7qni2/my_8_investing_guidelines/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/s7qni2/my_8_investing_guidelines/",
  "subreddit_subscribers": 3537772,
  "created_utc": 1642609129,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1642600574,
  "the_new_excerpt": "I've been investing, trading, gambling for about 5 years now and I've done\npretty much every rookie mistake there is. Sold winners from 2016\n(Shop,Nvidia,AMD,Paypal) Lost fortunes on chasing that pennystock. Played and\nlost with trying to time the market, option trading.\n\nI've been very active…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は投資、取引、ギャンブルを始めて5年ほどになりますが、これまでに\n多くの失敗がありました。2016年からの勝ち組を売却\n(Shop,Nvidia,AMD,Paypal) そのペニーストックを追いかけて財産を失いました。プレイして\nオプション取引で市場のタイミングを計ろうとして負けた。\n\n私は非常に積極的に...",
      "title": "私の8つの投資指針"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从事投资、交易和赌博已经有5年了，我已经做了\n几乎所有的菜鸟错误都犯过。卖出了2016年的赢家\n(Shop,Nvidia,AMD,Paypal)在追逐那只仙股上失去了财富。试图把握市场时机\n试图把握市场时机，进行期权交易，结果输了。\n\n我一直都很积极...",
      "title": "我的8条投资准则"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從事投資、交易和賭博已經有5年了，我已經做了\n幾乎所有的菜鳥錯誤都犯過。賣出了2016年的贏家\n(Shop,Nvidia,AMD,Paypal)在追逐那隻仙股上失去了財富。試圖把握市場時機\n試圖把握市場時機，進行期權交易，結果輸了。\n\n我一直都很積極...",
      "title": "我的8條投資準則"
    }
  ]
}