{
  "author": "Askili",
  "original_created_utc": 1640118014,
  "title": "Is there a phrase for people's tendency to ignore what you say and to instead respond to their own little conversation? Why do people do this?",
  "created_utc": 1640180851,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Not necessarily a Strawman argument, but where you&amp;#39;re essentially having two different (but similar) conversations. It&amp;#39;s like people just assume you have some hidden meaning or agenda, or something.&lt;/p&gt;\n\n&lt;p&gt;Like, random example, but if I say &amp;quot;I like pineapples&amp;quot; and someone responds with &amp;quot;You don&amp;#39;t like bacon? Why? What&amp;#39;s wrong with you??&amp;quot; or &amp;quot;Banana cream pie is disgusting tho&amp;quot; or something. Even though neither bacon, bananas, or pies were at all mentioned.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s exhausting to have so many conversations that go nowhere, just spinning out, because people hear what they want to hear rather than the words coming out of your mouth. I&amp;#39;d like to better understand this tendency (I know I&amp;#39;ve &lt;em&gt;probably&lt;/em&gt; done it at some point, myself, even if I can&amp;#39;t remember)&lt;/p&gt;\n\n&lt;p&gt;Is there a phrase describing this? Why do people do this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/askphilosophy/comments/rln8pa/is_there_a_phrase_for_peoples_tendency_to_ignore/",
  "subreddit": "askphilosophy",
  "id": "rln8pa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Not necessarily a Strawman argument, but where you're essentially having two\ndifferent (but similar) conversations. It's like people just assume you have\nsome hidden meaning or agenda, or something.\n\nLike, random example, but if I say \"I like pineapples\" and someone responds with\n\"You don't like…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "必ずしも藁人形論法ではなく、本質的に2つの論法がある。\n異なる（しかし似たような）会話をする。まるで、あなたが何か持っていると思い込んでいるようで\n何か隠された意味や意図があるのでしょう。\n\n例えば、ランダムな例ですが、私が「パイナップルが好きです」と言うと、誰かがこう返します。\n「嫌いなのか...",
      "title": "あなたが言うことを無視して、自分の小さな会話に反応する人の傾向を表す言葉はあるのでしょうか？なぜこのようなことをするのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不一定是稻草人的争论，但你本质上是在进行两个\n不同（但类似）的对话。这就像人们只是假设你有\n一些隐藏的意义或议程，或其他东西。\n\n比如，随便举个例子，但如果我说 \"我喜欢菠萝\"，有人回应说\n\"你不喜欢...",
      "title": "人们倾向于无视你所说的话，而是回应他们自己的小对话，这有什么说法吗？为什么人们会这样做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不一定是稻草人的爭論，但你本質上是在進行兩個\n不同（但類似）的對話。這就像人們只是假設你有\n一些隱藏的意義或議程，或其他東西。\n\n比如，隨便舉個例子，但如果我說 \"我喜歡菠蘿\"，有人回應說\n\"你不喜歡...",
      "title": "人們傾向於無視你所說的話，而是迴應他們自己的小對話，這有什麼說法嗎？爲什麼人們會這樣做？"
    }
  ]
}