{
  "author": "TODO_getLife",
  "the_new_excerpt": "> The G7 group of advanced economies has reached a \"historic\" deal on taxing\n> multi-national companies, the UK's Chancellor of the Exchequer, Rishi Sunak\n> says. Finance ministers meeting in London agreed to commit to the principle of\n> a minimum corporate tax rate of 15%.\n> \n> The deal - from the…",
  "original_created_utc": 1622894612,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "> 先進7カ国（G7）は、多国籍企業への課税について「歴史的」な合意に達した。\n> 英国のリシ・スナク財務大臣は、多国籍企業への課税について「歴史的な」合意に達したと発表しました。\n> 述べています。ロンドンで開催された財務大臣会合では、以下の原則を約束することに合意しました。\n> 法人税の最低税率を15％とする。\n> \n> 今回の合意は...",
      "title": "G7諸国、多国籍企業への課税に関する合意を支持"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "> 七国集团发达经济体已就征税问题达成了一项 \"历史性 \"协议。\n> 英国财政大臣瑞希-苏纳克说，跨国企业\n>说。在伦敦举行的财政部长会议同意承诺以下原则\n> 最低的公司税率为15%。\n> \n> 该协议--从...",
      "title": "七国集团支持对跨国企业征税的协议"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> 七國集團發達經濟體已就徵稅問題達成了一項 \"歷史性 \"協議。\n> 英國財政大臣瑞希-蘇納克說，跨國企業\n>說。在倫敦舉行的財政部長會議同意承諾以下原則\n> 最低的公司稅率爲15%。\n> \n> 該協議--從...",
      "title": "七國集團支持對跨國企業徵稅的協議"
    }
  ],
  "title": "G7 nations back deal to tax multinationals",
  "created_utc": 1622902559,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p>The G7 group of advanced economies has reached a &quot;historic&quot; deal on taxing multi-national companies, the UK&#39;s Chancellor of the Exchequer, Rishi Sunak says. Finance ministers meeting in London agreed to commit to the principle of a minimum corporate tax rate of 15%. </p>\n\n<p>The deal - from the US, UK, France, Germany, Canada, Italy and Japan - will put pressure on other countries to follow suit, including at a meeting of the G20 next month.</p>\n\n<p>At the moment companies can set up local branches in countries that have relatively low corporate tax rates and declare profits there.</p>\n\n<p>That means they only pay the local rate of tax, even if the profits mainly come from sales made elsewhere. This is legal and commonly done.</p>\n\n<p>The deal aims to stop this from happening in two ways.</p>\n\n<p>Firstly, the G7 want a global minimum tax rate so as to avoid a &quot;race to the bottom&quot; where countries can undercut each other with low tax rates.</p>\n\n<p>Secondly, the rules will aim to make companies pay tax in the countries where they are selling their products or services, rather than wherever they end up declaring their profits. </p>\n</blockquote>\n\n<p><a href=\"https://www.bbc.co.uk/news/world-57368247\">https://www.bbc.co.uk/news/world-57368247</a></p>\n\n<p>From what I understand this means companies like Amazon would have to pay taxes on the sales made in each country it operates in. 15% of all profit in UK, 15% of all profit in the US etc etc. Happy to be corrected.</p>\n</div><!-- SC_ON -->",
  "score": 2144,
  "permalink": "/r/stocks/comments/nsu9pz/g7_nations_back_deal_to_tax_multinationals/",
  "subreddit": "stocks",
  "id": "nsu9pz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404886632
}