{
  "author": "suhdanny",
  "the_new_excerpt": "Before I begin, I came across this article written by Jeremey Grantham, who is a\nBritish investor and co-founder and chief investment strategist of GMO, also\nregarded as a highly knowledgeable investor particularly due to his prediction\nof various historic stock market bubbles.\n\nIn his article…",
  "original_created_utc": 1610209892,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在我开始之前，我偶然看到了这篇由Jeremey Grantham写的文章，他是一位\n英国投资者、GMO联合创始人兼首席投资策略师，也是\n被认为是知识渊博的投资者，尤指由于他的预测\n各种历史性的股市泡沫。\n\n在他的文章…中",
      "title": "为什么我们会在主要的后期泡沫，可能是历史上最大的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我開始之前，我偶然看到了這篇由Jeremey Grantham寫的文章，他是一位\n英國投資者、GMO聯合創始人兼首席投資策略師，也是\n被認爲是知識淵博的投資者，尤指由於他的預測\n各種歷史性的股市泡沫。\n\n在他的文章…中",
      "title": "爲什麼我們會在主要的後期泡沫，可能是歷史上最大的"
    }
  ],
  "title": "Why We Are at the Major Late-Stage Bubble, Possibly the Biggest in History",
  "created_utc": 1610224877,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Before I begin, I came across this article written by Jeremey Grantham, who is a British investor and co-founder and chief investment strategist of GMO, also regarded as a highly knowledgeable investor particularly due to his prediction of various historic stock market bubbles.</p>\n\n<p>In his article titled &quot;Waiting for the Last Dance&quot;, he outlines multiple points why he thinks we are in a major late-stage bubble. I will summarize below the key points discussed, but will also leave a link to the article in case you want to read the full version.</p>\n\n<p><a href=\"https://www.gmo.com/americas/research-library/waiting-for-the-last-dance/\">https://www.gmo.com/americas/research-library/waiting-for-the-last-dance/</a></p>\n\n<p>- The long, long bull market since 2009 has finally matured into a fully-fledged epic bubble, and he believes this event will be recorded as one of the great bubbles of financial history along with the South Sea bubble, 1929, and 2000.</p>\n\n<p>- The single most dependable feature of the late stages of the great bubbles of history has been really crazy investor behaviour, especially on the part of individuals. For the first 10 years of this bull market, we lacked such wild speculation. But now we have it. (he provides examples such as Hertz, K*d*k, Nikola, and especially, Tesla)</p>\n\n<p>- The &quot;Buffett indicator,&quot; total stock market capitalization to GDP, broke through its all-time-high 2000 record. In 2020, there were 480 IPOs (including an incredible 248 SPACs) – more new listings than the 406 IPOs in 2000. There are 150 non-micro-cap companies (market cap of over $250 million) that have more than tripled in the year, which is over 3 times as many as any year in the previous decade. The volume of small retail purchases, of less than 10 contracts, of call options on U.S. equities has increased 8-fold compared to 2019, and 2019 was already well above long-run average.</p>\n\n<p>- This time, more than in any previous bubble, investors are relying on accommodative monetary conditions and zero real rates extrapolated indefinitely ... Now once again the high prices this time will hold because…interest rates will be kept around nil forever, in the ultimate statement of moral hazard – the asymmetrical market risk we have come to know and depend on. The mantra of late 2020 was that engineered low rates can prevent a decline in asset prices. Forever! But of course, it was a fallacy in 2000 and it is a fallacy now. In the end, moral hazard did not stop the Tech bubble decline, with the NASDAQ falling 82%. Yes, 82%!</p>\n\n<p>-Nothing in investing perfectly repeats. Certainly not investment bubbles. Each form of irrational exuberance is different; we are just looking for what you might call spiritual similarities. Even now, I know that this market can soar upwards for a few more weeks or even months – it feels like we could be anywhere between July 1999 and February 2000. Which is to say it is entitled to break any day, having checked all the boxes, but could keep roaring upwards for a few months longer.</p>\n\n<p>- My best guess as to the longest this bubble might survive is the late spring or early summer, coinciding with the broad rollout of the COVID vaccine. At that moment, the most pressing issue facing the world economy will have been solved. Market participants will breathe a sigh of relief, look around, and immediately realize that the economy is still in poor shape, stimulus will shortly be cut back with the end of the COVID crisis, and valuations are absurd. “Buy the rumor, sell the news.” But remember that timing the bursting of bubbles has a long history of disappointment.</p>\n\n<p>- Even with hindsight, it is seldom easy to point to the pin that burst the bubble. The main reason for this lack of clarity is that the great bull markets did not break when they were presented with a major unexpected negative. The great bull markets typically turn down when the market conditions are very favorable, just subtly less favorable than they were yesterday. And that is why they are always missed.</p>\n\n<p>-The combination of timing uncertainty and rapidly accelerating regret on the part of clients means that the career and business risk of fighting the bubble is too great for large commercial enterprises. So, don&#39;t wait for the Goldmans and Morgan Stanleys to become bearish: it can never happen. For them it is a horribly non-commercial bet. Perhaps it is for anyone. Profitable and risk-reducing for the clients, yes, but commercially impractical for advisors. Their best policy is clear and simple: always be extremely bullish. It is good for business and intellectually undemanding. It is appealing to most investors who much prefer optimism to realistic appraisal, as witnessed so vividly with COVID. And when it all ends, you will as a persistent bull have overwhelming company. This is why you have always had bullish advice in a bubble and always will.</p>\n\n<p>If you are interested to see more of his arguments, I strongly advise you to go and read the full article. I am currently 100% on equities, and very bullish for stocks as all of you probably are. But I think it&#39;s also important to have a balanced perspective, especially when everyone around you is extremely bullish. Ultimately, we are investing for the long run for our retirement. Everyone is a fucking genius in a bull market, and I think a lot of people in the sub, whether a newcomer or an experienced investor, should listen to bearish predictions and advices and not become a victim of confirmation bias.</p>\n</div><!-- SC_ON -->",
  "score": 191,
  "permalink": "/r/stocks/comments/ktu07v/why_we_are_at_the_major_latestage_bubble_possibly/",
  "subreddit": "stocks",
  "id": "ktu07v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706381127
}