{
  "author": "Set1Less",
  "original_created_utc": 1656583981,
  "title": "Yesterday European Commission agreed on a deal for stringent and invasive AML for all crypto services, including linking your onchain wallets to user's KYC details. This drastically destroys user's privacy",
  "created_utc": 1656599914,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Yesterday the EU framed new KYC and AML mandates that affect all crypto service providers including exchanges and wallets. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/kbya9kz9dq891.jpg?width=1372&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=b58c00d6aeb38b29f09c0615d2cbd77e75a18bcc\"&gt;EU Rep: After months of negotiations with the Council, we agreed the most ambitious travel rule for transfers of crypto-assets in the world. We are putting an end to the wild west of unregulated crypto, closing major loopholes in the European anti-money laundering rules. &lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;With this deal, they are now slapping travel rule requirements across europe for all crypto entities. They have to now track every wallet level information of users and allow withdrawals only to wallets that have been verified by users as belonging to them. This is known as travel rule, and is already in place in some countries but with this deal, it will apply to the whole of the EU. Presently, Swiss exchanges require you prove your wallet belongs to you. Now, the whole of EU is going into this standard.&lt;/p&gt;\n\n&lt;p&gt;If you are withdrawing funds or sending funds to an exchange, the onus now falls on the exchange to ensure the wallet is KYC&amp;#39;d to you. &lt;strong&gt;You will have to sign a message from the wallet to prove you are the owner of the wallet. Otherwise, the exchange may not be able to accept these funds.&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;According to these laws,&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The regulation will also apply o transfers from/to unhosted wallets. CASPs will be required to collect information and apply enhanced due diligence measures with respect to all transfers involving unhosted wallets, on a risk basis.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This means the exchanges and centralised services will have to collect information and do all kinds of due diligence on where the funds originated from, if you are sending funds from your personal on-chain wallets to these centralised entities. They may reject your funds arbitrarily, and even hold your funds hostage if you dont pass some of their automated checks. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Verification of the identity of the beneficial owner of the unhosted wallet will be mandatory for large transfers above 1000€ in case the transfer is made to or from the wallet belonging to the CASP’s own client.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This means if your transaction exceeds 1000€, the onchain wallets (termed as unhosted wallet in regulatory speak) identity has to be verified. Imagine this - doing a passport or drivers license verification on Jumio everytime you send a €1000 transaction from a new wallet....&lt;strong&gt;PS: Unhosted wallet terminology is total nonsense&lt;/strong&gt;, devised by unelected agencies like FATF to stigmatise onchain crypto users. Purely, from crypto&amp;#39;s technical perspective, the term &amp;quot;unhosted&amp;quot; doesnt mean anything. Its not hosted on their fiat system, so its unhosted? Lol.. these classifications have been created solely to limit access and differentiate onchain crypto users vs those using the fiat rails. &lt;/p&gt;\n\n&lt;p&gt;Some other policies that are part of this deal:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;New risk-mitigation measures will be in place: CASPs will be required to perform enhanced due diligence before establishing a business relationship with CASPs operating in third countries. Specific enhanced due diligence will apply to unregistered and unlicensed entities.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The whole &amp;quot;deal&amp;quot; originates from a position where anyone using crypto is being seen as an adversary, and they want the centralised entities to limit such users as much as possible. It also empowers centralised agencies even more to lock, seize and hold hostage user&amp;#39;s funds by now taking shelter under a host of new AML mandates. Lets say you made an onchain trade for a new coin on a new chain, and that mooned and now you want to cash out, but the exchange doesnt accept this, then they can hold your funds hostage &lt;/p&gt;\n\n&lt;p&gt;The EU is clearly focussed more on limiting people&amp;#39;s financial privacy than taking any kind of action on the massive wave of inflation that EU countries are currently facing. This EP member Ernest Urtasun&amp;#39;s country Spain is facing record inflation of over 10%.. and all they can think of is gutting people&amp;#39;s right to financial privacy. &lt;/p&gt;\n\n&lt;p&gt;These are draconian laws and restrictions on people using their own funds. Just to please a bunch of bureaucrats, you will have to sacrifice on your privacy. The need for P2P services rises even more now where you can continue to trade and exchange crypto without the need of centralised intermediaries. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Link to the EU deal: &lt;a href=\"https://www.europarl.europa.eu/news/en/press-room/20220627IPR33919/crypto-assets-deal-on-new-rules-to-stop-illicit-flows-in-the-eu\"&gt;https://www.europarl.europa.eu/news/en/press-room/20220627IPR33919/crypto-assets-deal-on-new-rules-to-stop-illicit-flows-in-the-eu&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 413,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/hYqwVkqaHXNoeigiv8rI2qrPCIds0GALrVm-QViLM0M.jpg?auto=webp&amp;s=fb409c3f18f1e12eb5b7523e51b3fb366b94e936",
          "width": 1372,
          "height": 1584
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/hYqwVkqaHXNoeigiv8rI2qrPCIds0GALrVm-QViLM0M.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=bf32739732e8a8ea8d58674e79192c6e0205e299",
            "width": 108,
            "height": 124
          },
          {
            "url": "https://external-preview.redd.it/hYqwVkqaHXNoeigiv8rI2qrPCIds0GALrVm-QViLM0M.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=445bef0bf7e4ba2b3180ba8417c7dc17404b5968",
            "width": 216,
            "height": 249
          },
          {
            "url": "https://external-preview.redd.it/hYqwVkqaHXNoeigiv8rI2qrPCIds0GALrVm-QViLM0M.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=c6676bc08692312f419ef17b0c7729bd7c3f1394",
            "width": 320,
            "height": 369
          },
          {
            "url": "https://external-preview.redd.it/hYqwVkqaHXNoeigiv8rI2qrPCIds0GALrVm-QViLM0M.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=c91c7eb67c452a6768450ddb8e9c6ddce12e477c",
            "width": 640,
            "height": 738
          },
          {
            "url": "https://external-preview.redd.it/hYqwVkqaHXNoeigiv8rI2qrPCIds0GALrVm-QViLM0M.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=8218abde5d11ab7f843025d9f1ca733494e9c3ea",
            "width": 960,
            "height": 1108
          },
          {
            "url": "https://external-preview.redd.it/hYqwVkqaHXNoeigiv8rI2qrPCIds0GALrVm-QViLM0M.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=4d8bc54da2b9739e6ebf1ccfc7fbae9a85fae0d5",
            "width": 1080,
            "height": 1246
          }
        ],
        "variants": {},
        "id": "wIJncmDdrwnMC1cJR_CAYv7SqgUBwgSKkQ-yjnlbzFU"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/vo4x02/yesterday_european_commission_agreed_on_a_deal/",
  "subreddit": "CryptoCurrency",
  "id": "vo4x02",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Yesterday the EU framed new KYC and AML mandates that affect all crypto service\nproviders including exchanges and wallets.\n\nEU Rep: After months of negotiations with the Council, we agreed the most\nambitious travel rule for transfers of crypto-assets in the world. We are\nputting an end to the wild…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日、EUはすべての暗号サービスに影響を与える新たなKYCおよびAMLの義務付けを設定しました。\n取引所やウォレットを含むすべての暗号サービスプロバイダに影響します。\n\nEUの担当者 理事会との数ヶ月の交渉の後、私たちは最も野心的な旅行ルールに合意しました。\n暗号資産の転送に関する世界で最も野心的な旅行ルールに合意しました。私たちは\n野放しに終止符を打つ...",
      "title": "昨日、欧州委員会は、ユーザーのKYC詳細へのあなたのオンチェーンウォレットのリンクを含む、すべての暗号サービスのための厳格かつ侵襲的なAMLのための取引に合意しました。これはユーザーのプライバシーを大幅に破壊するものです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨天，欧盟制定了新的KYC和AML任务，影响到所有加密货币服务提供商，包括交易所和钱包。\n包括交易所和钱包的供应商。\n\n欧盟代表。经过与理事会几个月的谈判，我们同意了最\n的加密资产转移旅行规则。我们正在\n终止了疯狂的...",
      "title": "昨天欧盟委员会就所有加密货币服务的严格和侵入性反洗钱协议达成一致，包括将你的链上钱包与用户的KYC细节联系起来。这极大地破坏了用户的隐私。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨天，歐盟制定了新的KYC和AML任務，影響到所有加密貨幣服務提供商，包括交易所和錢包。\n包括交易所和錢包的供應商。\n\n歐盟代表。經過與理事會幾個月的談判，我們同意了最\n的加密資產轉移旅行規則。我們正在\n終止了瘋狂的...",
      "title": "昨天歐盟委員會就所有加密貨幣服務的嚴格和侵入性反洗錢協議達成一致，包括將你的鏈上錢包與用戶的KYC細節聯繫起來。這極大地破壞了用戶的隱私。"
    }
  ]
}