{
  "author": "blu_horseshoe",
  "the_new_excerpt": "Nobody can take anything away from Cathie Woods and Ark Invest. Their success\nhas been amazing but at this point caveat emptor. Because of all of the new\nmoney (at one point more than Blackrock YTD) coming in, she now has to buy\nstocks at any valuation and cannot be as concentrated; the returns will…",
  "original_created_utc": 1613600944,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "没有人可以从Cathie Woods和Ark Invest身上拿走任何东西。他们的成功\n已经很神奇，但在这一点上告诫大家。因为所有的新\n的钱（一度超过黑石YTD）进来，她现在要买的是\n任何估值的股票，都不可能那么集中；收益会...",
      "title": "盲目追随Cathie Woods和ARK ETF要小心!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "沒有人可以從Cathie Woods和Ark Invest身上拿走任何東西。他們的成功\n已經很神奇，但在這一點上告誡大家。因爲所有的新\n的錢（一度超過黑石YTD）進來，她現在要買的是\n任何估值的股票，都不可能那麼集中；收益會...",
      "title": "盲目追隨Cathie Woods和ARK ETF要小心!"
    }
  ],
  "title": "Be careful following Cathie Woods and ARK ETF's blindly!",
  "created_utc": 1613608249,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Nobody can take anything away from Cathie Woods and Ark Invest.  Their success has been amazing but at this point caveat emptor.  Because of all of the new money (at one point more than Blackrock YTD) coming in, she now has to buy stocks at any valuation and cannot be as concentrated; the returns will suffer. I&#39;m not saying that she isn&#39;t a great stock picker or anything about her ability to pick up on trends. You need to make sure that your time frame matches hers. Her time frame is 5-10 years. What we are seeing is not anything new.  It has happened many times in history.  I know what you&#39;re thinking, this is different. Do some research on the Munder Net Net Fund. I&#39;m not saying that she can&#39;t get great returns or beat the S&amp;P 500 over time, but you need to manage your expectations and strap in for some serious volatility and drawdowns.</p>\n</div><!-- SC_ON -->",
  "score": 497,
  "permalink": "/r/investing/comments/lm6jhy/be_careful_following_cathie_woods_and_ark_etfs/",
  "subreddit": "investing",
  "id": "lm6jhy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728622070
}