{
  "author": "tanmay1010",
  "original_created_utc": 1639331968,
  "title": "You are most probably going to lose your money on JPEG NFTs.",
  "created_utc": 1639363751,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m all in when it comes to creator based NFTs (music, art, videos, etc) and that it will revolutionize the way we currently see it as money would go directly to the artists and not to the corporates who holds the right to the art.&lt;/p&gt;\n\n&lt;p&gt;But what are these JPEG NFTs which are currently making the rounds in every major blockchain? &lt;/p&gt;\n\n&lt;p&gt;They are being circulated like: &amp;quot;10,000 unique art pieces&amp;quot;. What they don&amp;#39;t tell you is that they use the same underlying photo and rebrand those 10,000 &amp;#39;art&amp;#39; pieces by adding accessories to it. Same ape- with sun glasses and without sun glasses, with armour and without armour, with this and without this, are being categorised as distinct NFTs.&lt;/p&gt;\n\n&lt;p&gt;To top that off, they don&amp;#39;t even build these &amp;#39;art pieces&amp;#39; themselves. Most of them use online softwares to assemble the body parts and give them a random rarity factor. And then they advertise it as the most rare &amp;#39;NFTs&amp;#39; would be a fortune in the future. &lt;/p&gt;\n\n&lt;p&gt;They sell all these &amp;#39;legitimate&amp;#39; art pieces for as much as $500/$600 each. And... people are buying all of these &amp;#39;NFTs&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;To all you folks, if you see a project which has done nothing but create these &amp;#39;distinct&amp;#39; NFTs and you put your money in it- you are probably going to lose money there. There won&amp;#39;t be any community left once the facade of uniqueness is exposed to the larger public.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/reud0e/you_are_most_probably_going_to_lose_your_money_on/",
  "subreddit": "CryptoCurrency",
  "id": "reud0e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm all in when it comes to creator based NFTs (music, art, videos, etc) and\nthat it will revolutionize the way we currently see it as money would go\ndirectly to the artists and not to the corporates who holds the right to the\nart.\n\nBut what are these JPEG NFTs which are currently making the rounds…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "クリエイターベースのNFT（音楽、アート、映像など）には全力投球ですし\nこの方法は、私たちが現在見ている方法に革命を起こすでしょう。\n権利者である企業ではなく、アーティストに直接支払われます。\nアート\n\nしかし、今話題のJPEG NFTとは...。",
      "title": "JPEG NFTでは、ほとんどの場合、損をすることになります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当涉及到基于创作者的NFT（音乐、艺术、视频等）时，我都会加入。\n它将彻底改变我们目前所看到的方式，因为钱将直接流向\n直接给艺术家，而不是给拥有权利的公司。\n艺术。\n\n但是，目前正在进行的JPEG NFTs是什么呢？",
      "title": "你很可能会在JPEG NFTs上损失你的钱。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當涉及到基於創作者的NFT（音樂、藝術、視頻等）時，我都會加入。\n它將徹底改變我們目前所看到的方式，因爲錢將直接流向\n直接給藝術家，而不是給擁有權利的公司。\n藝術。\n\n但是，目前正在進行的JPEG NFTs是什麼呢？",
      "title": "你很可能會在JPEG NFTs上損失你的錢。"
    }
  ]
}