{
  "author": "Ge0rgeBr0ughton",
  "original_created_utc": 1658085240,
  "title": "An episode of Star Trek from 1967 uses a storytelling contrivance that I recognise from more recent media. Captain Kirk is \"killed\". It is then revealed that an injection he had been given contained a drug which simulates death. Where did this trope originate and can we trace a \"lineage\" of its use?",
  "created_utc": 1658099582,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The episode is &amp;quot;Amok Time&amp;quot;, season 2 episode 1 (by release order, not production order).&lt;/p&gt;\n\n&lt;p&gt;Nowadays this is such a common contrivance that it&amp;#39;s been mostly dropped I think for being pretty cliché. It&amp;#39;s in the Marvel movies; it&amp;#39;s in the &lt;em&gt;Metal Gear&lt;/em&gt; franchise; it&amp;#39;s in &lt;em&gt;Chuck&lt;/em&gt;. I&amp;#39;ve always assumed it was a relatively recent (say, the last thirty years) development in Hollywood storytelling. It&amp;#39;s dramatic, it&amp;#39;s convenient, it&amp;#39;s fantastical. It &lt;em&gt;feels&lt;/em&gt; like a product of contemporary blockbuster writing.&lt;/p&gt;\n\n&lt;p&gt;And yet, here it is in 1967. Was this one of its debut uses in fictional writing? If not, what was the earliest identifiable use? And (most interestingly) can we trace a sort of lineage from an &amp;quot;original&amp;quot; use through copycats and copycats of copycats up to today? Or is it more likely that this is just a case of parallel thought?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 119,
  "permalink": "/r/AskHistorians/comments/w1ey3i/an_episode_of_star_trek_from_1967_uses_a/",
  "subreddit": "AskHistorians",
  "id": "w1ey3i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The episode is \"Amok Time\", season 2 episode 1 (by release order, not production\norder).\n\nNowadays this is such a common contrivance that it's been mostly dropped I think\nfor being pretty cliché. It's in the Marvel movies; it's in the Metal Gear\nfranchise; it's in Chuck. I've always assumed it was…"
}