{
  "author": "xavierwest888",
  "original_created_utc": 1644003106,
  "title": "You know the market's pumping when the exchanges all suddenly 'go down'",
  "created_utc": 1644023917,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Title says it all, tried to look at my portfolio on Coinbase just now and what a surprise:&lt;/p&gt;\n\n&lt;h1&gt;Investigating Latency&lt;/h1&gt;\n\n&lt;h1&gt;We&amp;#39;re investigating latency on Coinbase.com and the mobile app and difficulty with trades / payments. Our teams are working to restore full service ASAP.&lt;/h1&gt;\n\n&lt;p&gt;Interesting that the exchanges never go down when the market crashes. When that happens and everyone scrambles online to try and paperhand sell their crypto in a race to the bottom they seem to always work impeccably.&lt;/p&gt;\n\n&lt;p&gt;However, the markets suddenly surge over 10% and they suddenly just cannot handle the bandwidth. Almost as if they had significantly too little crypto in their reserves and a sudden price hike would mean they didn&amp;#39;t have the time to increase their reserves. Almost as if they were expecting the market to drop further and that gamble didn&amp;#39;t pay off so better bring out the ol &amp;#39;we&amp;#39;re experiencing technical difficulty please stand by.&amp;#39;&lt;/p&gt;\n\n&lt;p&gt;Of course perhaps it&amp;#39;s all a giant coincidence it happens every time....&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 348,
  "permalink": "/r/CryptoCurrency/comments/skm2km/you_know_the_markets_pumping_when_the_exchanges/",
  "subreddit": "CryptoCurrency",
  "id": "skm2km",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Title says it all, tried to look at my portfolio on Coinbase just now and what a\nsurprise:\n\n\nINVESTIGATING LATENCY\n\n\nWE'RE INVESTIGATING LATENCY ON COINBASE.COM AND THE MOBILE APP AND DIFFICULTY\nWITH TRADES / PAYMENTS. OUR TEAMS ARE WORKING TO RESTORE FULL SERVICE ASAP.\n\nInteresting that the…"
}