{
  "author": "Ornery_Maintenance_8",
  "original_created_utc": 1627719534,
  "title": "Privacy is the most undervalued human right",
  "created_utc": 1627753463,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If I we think about privacy the first thing that comes to mind is: Why would I need privacy ? I am not doing anything wrong.</p>\n\n<p>But this is a major misconception of privacy. To say it with the words of  Eric Hughes:</p>\n\n<p><em>&quot;Privacy is necessary for an open society in the electronic age. Privacy is not secrecy.  A private matter is something one doesn&#39;t want the whole world to know, but a secret matter is something one doesn&#39;t want anybody to know. Privacy is the power to selectively reveal oneself to the world.&quot;</em></p>\n\n<p>Privacy is a fundamental human right and a lack of it automatically results in the loss of personal freedom. If you cant act privately you cant act free !</p>\n\n<p>Just imagine your family, your friends, your boss, your neighbor, your landlord, the government and the scammer around the corner would always be aware of everything you do ... It opens yourself up for any kind of control, suppression and fraud.</p>\n\n<p>We see you have a porn account ... you are fired as a caretaker.</p>\n\n<p>You spend money on alcohol ... we cant give you health insurance.</p>\n\n<p>You have a lot of dept ... we cant rent you a apartment.</p>\n\n<p>You voted republican ... we cant hire you in our progressive business.</p>\n\n<p>the possibilities are endless.</p>\n\n<p>I would recommend to everybody in the crypto space to read the cypherpunk-manifesto by Eric Hughes. Thereby you should keep in mind, that the people which identify as cypherpunk invented the whole crypto space. They did this in an attempt to defend their privacy and other human rights against big corporations and governments in the electronic age.</p>\n\n<p><a href=\"https://nakamotoinstitute.org/static/docs/cypherpunk-manifesto.txt\">https://nakamotoinstitute.org/static/docs/cypherpunk-manifesto.txt</a></p>\n\n<p>Please be aware that you privacy is attacked by big corporations and governments. It is in their interest to limit your privacy as much as possible to have as much control over you as possible. It is on us to defend our privacy and the personal freedom related to it.</p>\n\n<p>If you think all of this is not on your business because you have nothing to hide, I would like you to read this poetic from the German Lutheran pastor Martin Niemöller and think about the implications. Keep in mind that the Weimarer republic was a free and constitutional society until the Nazis got elected:</p>\n\n<p><em>First they came for the socialists, and I did not speak out—</em>     <em>Because I was not a socialist.</em></p>\n\n<p><em>Then they came for the trade unionists, and I did not speak out—</em>     <em>Because I was not a trade unionist.</em></p>\n\n<p><em>Then they came for the Jews, and I did not speak out—</em>     <em>Because I was not a Jew.</em></p>\n\n<p><em>Then they came for me—and there was no one left to speak for me.</em></p>\n\n<p>Monero, Tor, <a href=\"https://www.privacyinternational.org/\">https://www.privacyinternational.org/</a> and many other projects already standing there in the trench and fighting for our freedom every day. As a result they get defamed and labeled criminal by the exact same entities that would like to erase our privacy. <strong>Dont let them down !</strong> Its on us today to shape the kind of future we want to have for us and our children.</p>\n\n<p>In the end I will leave you with the words of the probably most famous cypherpunk:</p>\n\n<p><em>&quot;If you don’t believe it or don’t get it, I don’t have the time to try to convince you, sorry.&quot;</em></p>\n\n<p><em>--Satoshi Nakamoto--</em></p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/ov3g8h/privacy_is_the_most_undervalued_human_right/",
  "subreddit": "CryptoCurrency",
  "id": "ov3g8h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If I we think about privacy the first thing that comes to mind is: Why would I\nneed privacy ? I am not doing anything wrong.\n\nBut this is a major misconception of privacy. To say it with the words of Eric\nHughes:\n\n\"Privacy is necessary for an open society in the electronic age. Privacy is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "プライバシーについて考えるとき、まず最初に思い浮かぶのは、「なぜプライバシーが必要なのか？\nプライバシーが必要なのか？自分は何も悪いことをしていない。\n\nしかし、これはプライバシーについての大きな誤解です。エリック・ヒューズの言葉を借りれば、次のようになります。\nヒューズ氏の言葉を借りれば\n\n\"電子時代の開かれた社会には、プライバシーが必要です。プライバシーは...",
      "title": "プライバシーは最も過小評価されている人権"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我想到隐私，首先想到的是：我为什么要\n需要隐私？我并没有做错什么。\n\n但这是对隐私的一个重大误解。用埃里克的话说就是\n休斯的话来说。\n\n\"在电子时代，隐私对于一个开放的社会是必要的。隐私是...",
      "title": "隐私是最被低估的人权"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我想到隱私，首先想到的是：我爲什麼要\n需要隱私？我並沒有做錯什麼。\n\n但這是對隱私的一個重大誤解。用埃裏克的話說就是\n休斯的話來說。\n\n\"在電子時代，隱私對於一個開放的社會是必要的。隱私是...",
      "title": "隱私是最被低估的人權"
    }
  ]
}