{
  "author": "isabellasu",
  "original_created_utc": 1656584678,
  "title": "Religious couples, what would you do if your spouse came to you questioning their faith/became atheist?",
  "created_utc": 1656595436,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m (24f) not religious in any way, however I watch a lot of christian youtubers. For those who are religious, what would happen in your relationship or marriage if your spouse became atheist or questioned your beliefs suddenly? I’m genuinely interested.&lt;/p&gt;\n\n&lt;p&gt;In no way is there any judgment I am just wondering what that has been like for those who have experienced this&lt;/p&gt;\n\n&lt;p&gt;Edit: I guess my question is more to those who are totally devoted to their religion more so than those who have beliefs that aren’t as strong as some&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/TooAfraidToAsk/comments/vo53hc/religious_couples_what_would_you_do_if_your/",
  "subreddit": "TooAfraidToAsk",
  "id": "vo53hc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m (24f) not religious in any way, however I watch a lot of christian\nyoutubers. For those who are religious, what would happen in your relationship\nor marriage if your spouse became atheist or questioned your beliefs suddenly?\nI’m genuinely interested.\n\nIn no way is there any judgment I am just…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は（24歳）無宗教ですが、キリスト教の番組はよく見ています。\nユーチューバーをよく見ます。宗教をお持ちの方、もし配偶者が無神論者になったり、突然あなたの信念に疑問を持ったりしたら、あなたの関係や結婚生活はどうなりますか？\nもしあなたの配偶者が突然無神論者になったり、あなたの信念に疑問を持ったりしたら、あなたの関係や結婚生活はどうなりますか？\n私は純粋に興味があります。\n\n決して批判するつもりはありません...私はただ...",
      "title": "宗教をお持ちのご夫婦、もしあなたの配偶者が信仰に疑問を持ち、無神論者になったとしたらどうしますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（24岁）没有任何宗教信仰，但是我看了很多基督教的节目。\n优酷网友。对于那些有宗教信仰的人来说，如果你的配偶突然变成无神论者或质疑你的信仰，在你的关系中会发生什么\n如果你的配偶变成无神论者或突然质疑你的信仰，你的关系或婚姻会怎样？\n我真的很感兴趣。\n\n在任何方面都没有任何判断，我只是...",
      "title": "有宗教信仰的夫妇，如果你的配偶来找你质疑他们的信仰/成为无神论者，你会怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（24歲）沒有任何宗教信仰，但是我看了很多基督教的節目。\n優酷網友。對於那些有宗教信仰的人來說，如果你的配偶突然變成無神論者或質疑你的信仰，在你的關係中會發生什麼\n如果你的配偶變成無神論者或突然質疑你的信仰，你的關係或婚姻會怎樣？\n我真的很感興趣。\n\n在任何方面都沒有任何判斷，我只是...",
      "title": "有宗教信仰的夫婦，如果你的配偶來找你質疑他們的信仰/成爲無神論者，你會怎麼做？"
    }
  ]
}