{
  "author": "BoundariesAreFun",
  "the_new_excerpt": "Recent reporting has shown that despite Bitcoin's dip, those with hundreds of\nthousands of dollars - or even millions of dollars - worth of Bitcoin continue\nto buy and accumulate. However, small-time buyers, those with a few hundred or a\nfew thousand dollars worth, are selling in at a much higher…",
  "original_created_utc": 1624145497,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近の報道によると、ビットコインが下落しているにもかかわらず、数十万ドル、あるいは数百万ドル分のビットコインを持っている人は\n何十万ドル、何百万ドルものビットコインを持っている人たちが、ビットコインを買い続け、蓄積していることが最近の報道で明らかになりました。\n買い溜めを続けています。しかし、数百ドル、数千ドルの小規模な購入者は、はるかに高い価格で販売しています。\nしかし、数百ドル、数千ドルの小口購入者は、より高い価格で売りに出されています。",
      "title": "下落時にパニック売りをすると、クジラに市場での優位性を与えてしまうことになる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近的报告显示，尽管比特币下跌，但那些拥有数十万美元--甚至数百万美元--的比特币的人仍在继续。\n价值数十万美元--甚至数百万美元--的比特币的人继续购买和积累。\n购买和积累。然而，小规模的买家，那些拥有几百或几千美元的\n价值几百或几千美元的人，正在以更高的价格出售。",
      "title": "如果你在下跌时恐慌性卖出，你只会让鲸鱼在市场上有更大的优势。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近的報告顯示，儘管比特幣下跌，但那些擁有數十萬美元--甚至數百萬美元--的比特幣的人仍在繼續。\n價值數十萬美元--甚至數百萬美元--的比特幣的人繼續購買和積累。\n購買和積累。然而，小規模的買家，那些擁有幾百或幾千美元的\n價值幾百或幾千美元的人，正在以更高的價格出售。",
      "title": "如果你在下跌時恐慌性賣出，你只會讓鯨魚在市場上有更大的優勢。"
    }
  ],
  "title": "If you panic sell during a dip, you're only giving whales a bigger advantage over the market",
  "created_utc": 1624178594,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Recent reporting has shown that despite Bitcoin&#39;s dip, those with hundreds of thousands of dollars - or even millions of dollars - worth of Bitcoin continue to buy and accumulate. However, small-time buyers, those with a few hundred or a few thousand dollars worth, are selling in at a much higher rate.</p>\n\n<p>This is EXACTLY what the whales want to happen, and why many are confident the whales are manipulating the market. The more small-time buyers who sell there Bitcoin at cheap, the more they can buy and the larger control they can have over Bitcoin&#39;s permanently-fixed supply of 21 million. Have no doubt, their goal is for institutions and billions to own the entire Bitcoin market. We should do our best to not let that happen. Bitcoin&#39;s future is incredibly bright. Unless you absolutely need the money, HODLing long-term is the best approach and the absolutely best way to gain profit and increase your wealth. Of course it&#39;s your money so you should do what&#39;s best for you, but if your goal is to make money selling this low probably isn&#39;t the best choice. </p>\n\n<p>And yes, this is (or will be in the future) true of other coins too, but it&#39;s especially true of Bitcoin given its small and fixed supply and the growing institutional interest.</p>\n</div><!-- SC_ON -->",
  "score": 262,
  "permalink": "/r/CryptoCurrency/comments/o3sl9e/if_you_panic_sell_during_a_dip_youre_only_giving/",
  "subreddit": "CryptoCurrency",
  "id": "o3sl9e",
  "is_self": true,
  "media": null,
  "is_video": false
}