{
  "author": "Future-Badass101",
  "the_new_excerpt": "So my friend and I are both 22 years old. We have been best friends since 2011.\nWe both still live at home. My friend has only ever had one job but got fired.\nSo she sits at home all the time and begs me to do stuff with her. I work full\ntime at a grocery store. She expects me on my weekends off to…",
  "original_created_utc": 1617306973,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "那么我和我的朋友都是22岁。我们从2011年开始就是最好的朋友。\n我们都还住在家里。我的朋友只做过一份工作，但是被解雇了。\n所以她一直坐在家里，求我和她一起做事情。我的工作是全职\n在杂货店的时间。她希望我周末休息的时候... ...",
      "title": "我离开10年的好朋友会不会有错？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "那麼我和我的朋友都是22歲。我們從2011年開始就是最好的朋友。\n我們都還住在家裏。我的朋友只做過一份工作，但是被解僱了。\n所以她一直坐在家裏，求我和她一起做事情。我的工作是全職\n在雜貨店的時間。她希望我週末休息的時候... ...",
      "title": "我離開10年的好朋友會不會有錯？"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "私の友人と私は共に22歳です。2011年から親友になりました。\n二人ともまだ実家に住んでいます。友達は仕事を1つしかしたことがありませんが、解雇されてしまいました。\nそのため、彼女はずっと家にいて、私に一緒に何かしてほしいと頼んできます。私は食料品店でフルタイムで働いています。\n私は食料品店でフルタイムで働いています。私は食料品店でフルタイムで働いていますが、彼女は週末の休みに私に...",
      "title": "10年来の親友と別れるのは間違っているだろうか？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "私の友人と私は共に22歳です。2011年から親友になりました。\n二人ともまだ実家に住んでいます。友達は仕事を1つしかしたことがありませんが、解雇されてしまいました。\nそのため、彼女はずっと家にいて、私に一緒に何かしてほしいと頼んできます。私は食料品店でフルタイムで働いています。\n私は食料品店でフルタイムで働いています。私は食料品店でフルタイムで働いていますが、彼女は週末の休みに私に...",
      "title": "10年来の親友と別れるのは間違っているだろうか？"
    }
  ],
  "title": "Would it be wrong of me to leave my best friend of 10 years?",
  "created_utc": 1617346090,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So my friend and I are both 22 years old. We have been best friends since 2011. We both still live at home. My friend has only ever had one job but got fired. So she sits at home all the time and begs me to do stuff with her. I work full time at a grocery store.  She expects me on my weekends off to hang out with her and goes apeshit when I don’t, I have a boyfriend and other priorities to cater too, which she doesn’t seem to understand. </p>\n\n<p>My friend has always been pretty spoiled by her parents. So for me, I pay my parents for monthly rent, phone bill, car insurance, etc. which my friend thinks is weird and makes fun of me for it. When my friend worked she didn’t have to pay her parents for any of that. My friend also likes to brag about blowing her stimulus checks on new clothes, childhood toys, or new electronics. None of which she needs. Her parents pay for everything, and they also don’t make her do chores either, which I find odd. But okay. But the thing is she brags about this, all the time. Like it’s some flex. </p>\n\n<p>When we hang out, there has been numerous times where she “forgot” her money, and I ended up having to pay for her. Because I didn’t want to listen to her scream and berate me. She never paid me back. I’ve gone to concerts of singers, she likes with her, but if it’s someone I like and she hates, she won’t go. We always have to do what she wants to do, or she ruins it if it’s something I want to do by acting moody and like a bitch. </p>\n\n<p>She flips like a light switch, if you say something she doesn’t like, or she takes it the wrong way, she gets all pissy and ends up blowing up or giving the silent treatment. She acts like a toddler. She gets jealous when I hang out with my boyfriend, or even text him when I’m hanging out with her, she yells at me for talking to him, however when she has a guy she nonstop talks about all the deets of when she got laid and how good he is. If I tell her I’m uncomfortable, she tells me to grow up and it’s normal. She also loves to self deprecate, but project that onto me and then say she was just joking when I get offended and that I’m being sensitive. </p>\n\n<p>On the last vacation I took with just her, it was a nightmare, it had to be her way and what she wanted to do the entire week or she yelled and walks away from me. Won’t answer calls or texts. In the hotel room, we went to bed when she wanted to go to bed or wake up when she wants to. I went along with it because I didn’t feel like getting into a fight but boy was I miserable and I was so happy when it was over. Although she made us miss our flights back, and my parents had to pay for new ones. Because hers couldn’t (I don’t think she even asked). </p>\n\n<p>My parents aren’t exactly fond of her and tell me she needs to grow up, and they can’t wait for the day her parents kick her out, although I don’t see that happening. They ask me why I am still friends with her, they think she is selfish and uses me. I think I feel bad for her because she has no other friends which I why I stay in this friendship but I’ve had it. She’s too exhausting to deal with anymore. She’s gotten worse. It’s not my fault she has nobody else except her parents. It’s her fault. I need to stop feeling bad for her. It’s like she’s uses me as a verbal punching bag and a personal chauffeur. My boyfriend thinks she’s toxic as hell. She also blames how she acts on her mental disorders. Saying she can’t help it and this is just how she is and I know this. Ugh, I can’t take it anymore.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/mi3k6c/would_it_be_wrong_of_me_to_leave_my_best_friend/",
  "subreddit": "TooAfraidToAsk",
  "id": "mi3k6c",
  "is_self": true,
  "media": null,
  "is_video": false
}