{
  "author": "ottolouis",
  "original_created_utc": 1653482303,
  "title": "Is there an historical reason as to why Catholic priests aren't allowed to marry?",
  "created_utc": 1653496738,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Clergy in Protestantism, Judaism and Islam are allowed allowed to marry, so the Catholic rule seems like an aberration. Given how intertwined the Catholic Church was with politics, it makes sense that there would be a secular reason as to why priests couldn&amp;#39;t marry. Didn&amp;#39;t it have something to do with preventing church positions from becoming hereditary? I feel like the Investiture Controversy rings a bell.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 145,
  "permalink": "/r/AskHistorians/comments/uxgg2a/is_there_an_historical_reason_as_to_why_catholic/",
  "subreddit": "AskHistorians",
  "id": "uxgg2a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Clergy in Protestantism, Judaism and Islam are allowed allowed to marry, so the\nCatholic rule seems like an aberration. Given how intertwined the Catholic\nChurch was with politics, it makes sense that there would be a secular reason as\nto why priests couldn't marry. Didn't it have something to do…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "プロテスタント、ユダヤ教、イスラム教の聖職者は結婚が許されているので\nカトリックのルールは異常としか思えません。カトリックがいかに政治と密接に関わっていたかを考えると\nカトリック教会が政治と密接な関係にあったことを考えると、司祭が結婚できないのは世俗的な理由があるのだろうと納得できる。\n神父が結婚できないのは、世俗的な理由があったのだと思います。それは何か関係があったのでは...？",
      "title": "カトリックの司祭が結婚を許されないのは、歴史的な理由があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "新教、犹太教和伊斯兰教的神职人员都被允许结婚，所以\n天主教的规定似乎是一种反常现象。鉴于天主教会与政治有多大的交集\n鉴于天主教会与政治的交织，有一个世俗的理由来解释为什么牧师不能结婚也是合理的。\n为什么牧师不能结婚。这不是与......有关吗？",
      "title": "为什么天主教神父不允许结婚，有什么历史原因吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "新教、猶太教和伊斯蘭教的神職人員都被允許結婚，所以\n天主教的規定似乎是一種反常現象。鑑於天主教會與政治有多大的交集\n鑑於天主教會與政治的交織，有一個世俗的理由來解釋爲什麼牧師不能結婚也是合理的。\n爲什麼牧師不能結婚。這不是與......有關嗎？",
      "title": "爲什麼天主教神父不允許結婚，有什麼歷史原因嗎？"
    }
  ]
}