{
  "author": "paulosdub",
  "the_new_excerpt": "I mean that’s the nature of memes isn’t it? They come then then they go. This is\nthe reason we don’t still say “whasssssup” when we meet someone and why you\nrarely see “charlie bit my finger” anymore. It’s also the reason you need to be\ncareful when you get in. Just like a real meme, if you get in…",
  "original_created_utc": 1622271656,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "つまり、それがミームの性質なのではないでしょうか？来ては消え、来ては消え。これが\n誰かに会ったときに \"whasssup \"と言わないのも、\"charlie bit my finger \"をめったに見ないのもそのためです。\nチャーリーが私の指を噛んだ」というのをめったに見なくなったのもこのためです。乗るときに気をつけなければならないのもそのためです。\n乗るときには注意が必要です。本当のミームのように、もしあなたが入ってしまったら...。",
      "title": "Dogeの取引が大幅に減少したことに驚く人がいるのはなぜですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的意思是这就是备忘录的本质，不是吗？他们来了，然后又走了。这就是\n这就是我们在遇到某人时不说 \"whasssssup \"的原因，也是为什么你很少看到 \"Charlie咬了我的鳍\"。\n很少看到 \"Charlie咬了我的手指 \"了。这也是你需要注意的原因\n当你进入的时候要小心。就像一个真正的备忘录，如果你进入...",
      "title": "为什么有些人对Doge交易量的大幅下降感到惊讶？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的意思是這就是備忘錄的本質，不是嗎？他們來了，然後又走了。這就是\n這就是我們在遇到某人時不說 \"whasssssup \"的原因，也是爲什麼你很少看到 \"Charlie咬了我的鰭\"。\n很少看到 \"Charlie咬了我的手指 \"了。這也是你需要注意的原因\n當你進入的時候要小心。就像一個真正的備忘錄，如果你進入...",
      "title": "爲什麼有些人對Doge交易量的大幅下降感到驚訝？"
    }
  ],
  "title": "Why are some people surprised that Doge transactions have dropped massively?",
  "created_utc": 1622303051,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I mean that’s the nature of memes isn’t it? They come then then they go. This is the reason we don’t still say “whasssssup” when we meet someone and why you rarely see “charlie bit my finger” anymore. It’s also the reason you need to be careful when you get in. Just like a real meme, if you get in early you’re quite funny and maybe a bit edgy, but sharing “this is bill” in 2021 is less likely to go down well. </p>\n\n<p>Don’t get me wrong, i’m pleased for the people who made money, i’m just not surprised interest has dwindled a bit.</p>\n</div><!-- SC_ON -->",
  "score": 246,
  "permalink": "/r/CryptoCurrency/comments/nnhqos/why_are_some_people_surprised_that_doge/",
  "subreddit": "CryptoCurrency",
  "id": "nnhqos",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804296490
}