{
  "author": "ibeatsmymeet",
  "original_created_utc": 1636281852,
  "title": "Is it weird to be unattracted to porn after having a daughter?",
  "created_utc": 1636290583,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Any time I see a naked girl, I think &quot;that&#39;s somebody&#39;s daughter.&quot; She was a baby and someone had to care for her. I would hate to see my daughter being taken advantage of or exploited for someone else&#39;s gain. I&#39;ve seriously condensed my interest for women to my wife (who I also started the same sentiment for). </p>\n\n<p>Idk, maybe I&#39;m just weird but after caring for my daughter and seeing how fragile children are, it&#39;s hard for me to not feel sorry for porn actress and think someone failed them. I know it&#39;s a new world and some women just enjoy that kind of work but I can&#39;t help but shake the feeling that somewhere early in their life, their parents failed them. </p>\n\n<p>Am I weird? Is that weird? Does this make sense?</p>\n</div><!-- SC_ON -->",
  "score": 114,
  "permalink": "/r/TooAfraidToAsk/comments/qom2au/is_it_weird_to_be_unattracted_to_porn_after/",
  "subreddit": "TooAfraidToAsk",
  "id": "qom2au",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Any time I see a naked girl, I think \"that's somebody's daughter.\" She was a\nbaby and someone had to care for her. I would hate to see my daughter being\ntaken advantage of or exploited for someone else's gain. I've seriously\ncondensed my interest for women to my wife (who I also started the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "裸の女の子を見ると、いつでも \"誰かの娘さんだな \"と思います。彼女は赤ちゃんで\n赤ん坊で、誰かが世話をしなければならなかった。自分の娘が誰かに利用されたり、搾取されたりするのは見たくない。\n自分の娘が誰かの利益のために利用されたり、搾取されたりするのを見たくありません。私は真剣に\n私の女性に対する興味は、妻（私も始めたのですが...）に凝縮されています。",
      "title": "娘を産んでAVに魅力を感じなくなるのはおかしい？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "任何时候我看到一个裸体女孩，我都会想 \"那是某人的女儿\"。她还是个\n她是个婴儿，必须有人来照顾她。我不愿意看到我的女儿被\n被人利用，或被人利用来谋取利益。我已经认真地\n将我对女性的兴趣浓缩到了我的妻子身上（我也开始了对她的...",
      "title": "有了女儿之后，对色情片没有兴趣，这很奇怪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "任何時候我看到一個裸體女孩，我都會想 \"那是某人的女兒\"。她還是個\n她是個嬰兒，必須有人來照顧她。我不願意看到我的女兒被\n被人利用，或被人利用來謀取利益。我已經認真地\n將我對女性的興趣濃縮到了我的妻子身上（我也開始了對她的...",
      "title": "有了女兒之後，對色情片沒有興趣，這很奇怪嗎？"
    }
  ]
}