{
  "author": "Crazy-Supermarket633",
  "original_created_utc": 1658589960,
  "title": "Was I S*xually Assaulted?",
  "created_utc": 1658598172,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A few days ago I (20M)  was at my sister&amp;#39;s friend&amp;#39;s party (21F) and I only know her on good terms and I had considered her a friend previously despite only talking on few occasions.&lt;br/&gt;\nI had been told by my twin sister that she was into me several times but I don&amp;#39;t feel the same way - I never has and she simply wasn&amp;#39;t my type in any way. &lt;/p&gt;\n\n&lt;p&gt;I was invited to the party with my sister to which I accepted because generally I&amp;#39;m quite extroverted and I was friendly with a few people going.&lt;br/&gt;\nOf course, there was drinks and drugs. I drank a lot, I can&amp;#39;t preface this enough. My sister&amp;#39;s friend was making moves on me before I was completely out of it, I remember completely turning her down throughout the night, it was almost overwhelming the way she was getting far too close to me.&lt;/p&gt;\n\n&lt;p&gt;I drink more as it gets later and this is when it gets hard to recall a lot because I had been told that I was completely pissed, I was so drunk I couldn&amp;#39;t walk - My sister had told me I could barely fathom a sentence that actually made any sense whatsoever. &lt;/p&gt;\n\n&lt;p&gt;Next thing I know I&amp;#39;m waking up in her bed, she is getting dressed into casual clothes, completely absent of a hangover. She tells me that she &amp;#39;knew&amp;#39; that I &amp;#39;liked&amp;#39; her. She also tells me that she was completely fine because she was trying to stay sober so stayed off the drink the previous night. &lt;/p&gt;\n\n&lt;p&gt;My head was thumping and I remember very little about the night before, I felt oddly intruded and grossed out. I haven&amp;#39;t spoken to her since or brought it up with my sister yet but it&amp;#39;s been a few days and I&amp;#39;m still really on edge about what happened. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if I ever did consent, but according to my sister and a couple friends at the party I couldn&amp;#39;t make a fluent sentence, and I know if I was sober this wouldn&amp;#39;t have happened. I need advice stat, thank you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 141,
  "permalink": "/r/TooAfraidToAsk/comments/w66kwy/was_i_sxually_assaulted/",
  "subreddit": "TooAfraidToAsk",
  "id": "w66kwy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "A few days ago I (20M) was at my sister's friend's party (21F) and I only know\nher on good terms and I had considered her a friend previously despite only\ntalking on few occasions.\nI had been told by my twin sister that she was into me several times but I don't\nfeel the same way - I never has and…"
}