{
  "author": "randfyld",
  "original_created_utc": 1630834567,
  "title": "No, leaving your crypto on an exchange is not the end of the world and you don't have to move your $100 woth of crypto to a cold wallet",
  "created_utc": 1630841935,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Maybe it is just me but I totally trust exchanges to take care of my crypto. Of course I am speaking of popular and trustworthy exchanges. Leaving your crypto on an exchange nobody has ever heard of is of course a dumb idea.</p>\n\n<p>But do you want to tell me that your crypto is not safe on Coinbase, Kraken, Gemini, Crypto.com or Voyager? It is 2021 and not 2014 and these exchanges can not be compared to Mt Gox.</p>\n\n<p>Also sometimes people get the whole &quot;not your keys, not your crypto&quot; thing too seriously. I have seen people here complainig that they lost a big amount of their ETH to move it to a cold wallet. Well, high gas fees are another topic but you definitely shouldn&#39;t move your crypto to a wallet if you have to lose like 1/4 of it to do that. If you just have 0.05 ETH or similar then just leave it on the exchange. Nothing will happen to it.</p>\n\n<p>Not to mention that if you are new in crypto then it is more likely for you to lose your piece of paper with your seed phrase than an exchange like Kraken or Coinbase to get hacked. If you ever accumulate a bigger amount of crypto then you could think about buying a cold wallet!</p>\n\n<p>PS I originally <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/phepj2/no_leaving_your_crypto_on_an_exchange_is_not_the/\">posted this</a> on friday but it got deleted for mentioning ETH in the title because there were already many posts about ETH. But my post was doing very well and most people seemed to agree so I decided to change the title and repost it today!</p>\n</div><!-- SC_ON -->",
  "score": 310,
  "permalink": "/r/CryptoCurrency/comments/pia31k/no_leaving_your_crypto_on_an_exchange_is_not_the/",
  "subreddit": "CryptoCurrency",
  "id": "pia31k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Maybe it is just me but I totally trust exchanges to take care of my crypto. Of\ncourse I am speaking of popular and trustworthy exchanges. Leaving your crypto\non an exchange nobody has ever heard of is of course a dumb idea.\n\nBut do you want to tell me that your crypto is not safe on Coinbase,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私だけかもしれませんが、取引所が自分の暗号の管理をしてくれることを全面的に信頼しています。もちろん\nもちろん、人気があって信頼できる取引所のことです。誰も聞いたことのない取引所に自分の暗号を\n誰も聞いたことがないような取引所に預けるのは、もちろん馬鹿げた考えです。\n\nしかし、あなたの暗号がCoinbaseや...では安全ではないと言いたいのですか？",
      "title": "100ドル分の暗号をコールドウォレットに移す必要はありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "也许这只是我，但我完全相信交易所会照顾好我的加密货币。当然\n当然，我说的是受欢迎和值得信赖的交易所。把你的加密货币\n在一个没有人听说过的交易所，当然是一个愚蠢的想法。\n\n但是，你想告诉我，你的加密货币在Coinbase上不安全，...",
      "title": "不，把你的加密货币留在交易所并不是世界末日，你不必把你的100美元的加密货币转移到一个冷钱包里。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "也許這只是我，但我完全相信交易所會照顧好我的加密貨幣。當然\n當然，我說的是受歡迎和值得信賴的交易所。把你的加密貨幣\n在一個沒有人聽說過的交易所，當然是一個愚蠢的想法。\n\n但是，你想告訴我，你的加密貨幣在Coinbase上不安全，...",
      "title": "不，把你的加密貨幣留在交易所並不是世界末日，你不必把你的100美元的加密貨幣轉移到一個冷錢包裏。"
    }
  ]
}