{
  "author": "mrwonderfull_",
  "original_created_utc": 1656203654,
  "title": "What happens to the body exactly if someone is given a transfusion of the wrong blood type?",
  "created_utc": 1656222535,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello! &lt;/p&gt;\n\n&lt;p&gt;I read a case recently where a young girl was given a lung and heart transplant, except the transplanted organs were of a completely wrong blood type then the patient. I was wondering what exactly happens if someone it given a pint (or more) of the wrong type of blood. &lt;/p&gt;\n\n&lt;p&gt;And to step it up a notch further, what would happen to the body if all the blood in the body were to become a different type? Would the affect change with one blood type over another? &lt;/p&gt;\n\n&lt;p&gt;Thanks for your responses in advance.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/askscience/comments/vksgta/what_happens_to_the_body_exactly_if_someone_is/",
  "subreddit": "askscience",
  "id": "vksgta",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hello!\n\nI read a case recently where a young girl was given a lung and heart transplant,\nexcept the transplanted organs were of a completely wrong blood type then the\npatient. I was wondering what exactly happens if someone it given a pint (or\nmore) of the wrong type of blood.\n\nAnd to step it up a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。\n\n最近、ある少女が肺と心臓の移植を受けたケースを読みました。\nしかし、移植された臓器は、その患者の血液型とは全く異なるものでした。\n臓器を移植されました。もし、誰かが1パイント（またはそれ以上）の間違った血液を投与されたらどうなるのでしょうか？\nもし、間違った血液型の血液を1パイント（あるいはそれ以上）投与されたらどうなるのだろうか。\n\nそして、さらに上を行くのが...",
      "title": "もし、間違った血液型の輸血を受けたら、体はいったいどうなるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好!\n\n我最近读到一个案例，一个年轻的女孩接受了肺部和心脏移植。\n但移植的器官与病人的血型完全不同。\n病人。我想知道，如果有人被注射了一品脱（或更多）的错误血型，到底会发生什么？\n更多）的错误血型，到底会发生什么？\n\n为了进一步了解情况...",
      "title": "如果有人输错了血型，身体到底会发生什么变化？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好!\n\n我最近讀到一個案例，一個年輕的女孩接受了肺部和心臟移植。\n但移植的器官與病人的血型完全不同。\n病人。我想知道，如果有人被注射了一品脫（或更多）的錯誤血型，到底會發生什麼？\n更多）的錯誤血型，到底會發生什麼？\n\n爲了進一步瞭解情況...",
      "title": "如果有人輸錯了血型，身體到底會發生什麼變化？"
    }
  ]
}