{
  "author": "jam-hay",
  "original_created_utc": 1624537819,
  "title": "Crypto is not a crime. Denying citizens the civil liberty and human right of peacefully owning and transacting in it, is the real crime",
  "created_utc": 1624548639,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>China has told banks and payments platforms to stop supporting digital currency transactions.</p>\n\n<p>Their central bank said it had recently summoned several major banks and payments companies to call on them to take tougher action over the trading of cryptocurrencies.</p>\n\n<p>Banks were told to not provide products or services such as trading, clearing and settlement for cryptocurrency transactions.</p>\n\n<p>Authorities have ordered the closure of 26 mines last week.</p>\n\n<p>Last month China&#39;s cabinet, the State Council, said it would crack down on cryptocurrency mining and trading as part of a campaign to control financial risks.</p>\n\n<p>The day will come when a united crypto community will publicly and peacefully stand against government&#39;s trying to restrict/block it&#39;s citizens from transacting in peaceful cryptographic code on decentralised and open networks.</p>\n\n<p>When that day comes, I for one will be more than willing to take my place on the frontline.</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/o6zwlv/crypto_is_not_a_crime_denying_citizens_the_civil/",
  "subreddit": "CryptoCurrency",
  "id": "o6zwlv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "China has told banks and payments platforms to stop supporting digital currency\ntransactions.\n\nTheir central bank said it had recently summoned several major banks and\npayments companies to call on them to take tougher action over the trading of\ncryptocurrencies.\n\nBanks were told to not provide…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "中国が銀行や決済プラットフォームにデジタル通貨のサポート停止を指示\nしました。\n\n中国の中央銀行によると、最近、複数の大手銀行と決済会社を召喚して\n中国の中央銀行によると、最近、複数の大手銀行と決済会社を召喚し、暗号通貨の取引に関してより厳しい対応を取るよう求めた。\n中国の中央銀行によると、最近、大手銀行と決済会社数社を召喚し、暗号通貨の取引を厳しく取り締まるよう求めました。\n\n銀行は、デジタル通貨の取引をサポートしないよう求められた。",
      "title": "暗号は犯罪ではありません。市民が平和的に暗号を所有して取引する市民的自由と人権を否定することが本当の犯罪なのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "中国已通知银行和支付平台停止支持数字货币\n交易。\n\n中国央行表示，它最近召集了几家主要银行和\n呼吁他们对加密货币的交易采取更严厉的行动。\n加密货币的交易。\n\n银行被告知不要提供...",
      "title": "低碳水化合物不是一种犯罪。剥夺公民和平拥有和进行交易的公民自由和人权，才是真正的犯罪。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "中國已通知銀行和支付平臺停止支持數字貨幣\n交易。\n\n中國央行表示，它最近召集了幾家主要銀行和\n呼籲他們對加密貨幣的交易採取更嚴厲的行動。\n加密貨幣的交易。\n\n銀行被告知不要提供...",
      "title": "低碳水化合物不是一種犯罪。剝奪公民和平擁有和進行交易的公民自由和人權，纔是真正的犯罪。"
    }
  ]
}