{
  "author": "davis_unoxx",
  "the_new_excerpt": "Hello all!\n\nI’m putting the vast majority of my portfolio into shares of cruises, oil, and\nairlines. Why? Because with the speed of vaccines now and the worry of other\nstrains being stronger than current vaccines is gone. Also Biden announced that\nwe’ll have enough vaccines to administer to 300…",
  "original_created_utc": 1613932467,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好!\n\n我把我的投资组合的绝大部分投入到邮轮、石油的股票中去。\n航空公司。为什么这么说呢？因为以现在疫苗的发展速度，以及对其它\n菌株比目前的疫苗更强的情况已经不复存在。另外拜登还宣布\n我们将有足够的疫苗来管理300... ...",
      "title": "为什么我看好航空、石油和邮轮航线？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好!\n\n我把我的投資組合的絕大部分投入到郵輪、石油的股票中去。\n航空公司。爲什麼這麼說呢？因爲以現在疫苗的發展速度，以及對其它\n菌株比目前的疫苗更強的情況已經不復存在。另外拜登還宣佈\n我們將有足夠的疫苗來管理300... ...",
      "title": "爲什麼我看好航空、石油和郵輪航線？"
    }
  ],
  "title": "Why I’m bullish on Airlines, Oil, and Cruise-lines",
  "created_utc": 1613955451,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello all! </p>\n\n<p>I’m putting the vast majority of my portfolio into shares of cruises, oil, and airlines. Why? Because with the speed of vaccines now and the worry of other strains being stronger than current vaccines is gone. Also Biden announced that we’ll have enough vaccines to administer to 300 million Americans by July 4</p>\n\n<p>But guess what? That doesn’t even include the Johnson and Johnson vaccine that should be approved in the near future, that’s only one dose and is much Easier to administer, transport, and since only one dose will make ending this pandemic much faster. I believe these stocks still have a while to run. And oil is going up in price if you notice while filling up your car because demand for it going up so much, and that will continue in the coming months. </p>\n\n<p>Godspeed, hope to see you guys on the Moon! </p>\n\n<p>Positions </p>\n\n<p>RCL 100 shares \nCCL 100 shares \nJBLU 200 shares \nXOM 100 shares \nAlso do some contracts for a few months out if you feeling ballsy</p>\n</div><!-- SC_ON -->",
  "score": 113,
  "permalink": "/r/stocks/comments/lp3dgq/why_im_bullish_on_airlines_oil_and_cruiselines/",
  "subreddit": "stocks",
  "id": "lp3dgq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332885070
}