{
  "author": "JambaJuice__",
  "the_new_excerpt": "Have we not learnt from the lessons of the past where Nazi Germany literally did\nthe same fucking thing to their minorities. Now at the moment from what we know\nChina isn't straight up murdering these minorities but \"educating\" them. Funny\nthing is that Nazi Germany always claimed that these…",
  "original_created_utc": 1613224712,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "难道我们没有从过去纳粹德国的教训中吸取教训吗？\n对他们的少数民族也是一样的。现在据我们所知\n中国不是直接谋杀这些少数民族，而是 \"教育 \"他们。有趣的是\n纳粹德国总是声称这些... ...",
      "title": "为什么似乎没有人关心中国有集中营的事实，他们把 \"不受欢迎的少数民族 \"关在里面，并对他们进行不断的折磨和宣传？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "難道我們沒有從過去納粹德國的教訓中吸取教訓嗎？\n對他們的少數民族也是一樣的。現在據我們所知\n中國不是直接謀殺這些少數民族，而是 \"教育 \"他們。有趣的是\n納粹德國總是聲稱這些... ...",
      "title": "爲什麼似乎沒有人關心中國有集中營的事實，他們把 \"不受歡迎的少數民族 \"關在裏面，並對他們進行不斷的折磨和宣傳？"
    }
  ],
  "title": "Why does nobody seem to care about the fact that China literally has concentration camps in which they put \"undesirable minorities\" and subject them to constant torture and propaganda?",
  "created_utc": 1613229314,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Have we not learnt from the lessons of the past where Nazi Germany literally did the same fucking thing to their minorities. Now at the moment from what we know China isn&#39;t straight up murdering these minorities but &quot;educating&quot; them. Funny thing is that Nazi Germany always claimed that these concentration camps were something else as well and that these minorities were simply just being &quot;resettled&quot;. It&#39;s quite frankly disturbing and countries are too afraid to denounce them because China has all got them by the balls by foreign investment and job building schemes.</p>\n</div><!-- SC_ON -->",
  "score": 444,
  "permalink": "/r/TooAfraidToAsk/comments/lj1079/why_does_nobody_seem_to_care_about_the_fact_that/",
  "subreddit": "TooAfraidToAsk",
  "id": "lj1079",
  "is_self": true,
  "media": null,
  "is_video": false
}