{
  "author": "slurpPeeee",
  "original_created_utc": 1643193427,
  "title": "Why everything (almost) is offensive nowadays?",
  "created_utc": 1643210283,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So this happened last week during our meeting. I am asian (filipino to be exact) and I have an american colleague, let&amp;#39;s call her S. We were talking about countries we have been to and wanting to in the future. I mentioned that I want to go to Japan -- on the country side of Japan. Also briefly mentioned that I want to wear an authentic japanese kimono...of course from Japan if I ever go to the country.&lt;/p&gt;\n\n&lt;p&gt;My coworker S interrupted and told me that &amp;lt;none verbatim&amp;gt; &lt;strong&gt;&amp;quot;Well too bad you cannot wear that, me either! We&amp;#39;re not Japanese!🥲&amp;quot;&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;I asked her why and told me that &lt;strong&gt;is it offensive to Japanese culture.&lt;/strong&gt; and she added that &lt;strong&gt;it&amp;#39;s a common knowledge that if you&amp;#39;re not a local, you cannot do such thing anywhere.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I was too stunned to speak..the meeting vibe went downhill and awkward AF. Well...I didn&amp;#39;t know that?&lt;/p&gt;\n\n&lt;p&gt;Is that a norm nowadays??? We Filipinos love to share our culture to anyone. Am I missing something???? Enlighten me please????&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/sd325m/why_everything_almost_is_offensive_nowadays/",
  "subreddit": "TooAfraidToAsk",
  "id": "sd325m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So this happened last week during our meeting. I am asian (filipino to be exact)\nand I have an american colleague, let's call her S. We were talking about\ncountries we have been to and wanting to in the future. I mentioned that I want\nto go to Japan -- on the country side of Japan. Also briefly…"
}