{
  "author": "TStaysHumble",
  "original_created_utc": 1657486229,
  "title": "Looks like Coinbase will be discontinuing the Coinbase Card rewards. Tis’ a sad day to crypto.",
  "created_utc": 1657506208,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Got a notification to select a new reward but it appears that there are no options to select from that don’t expire on the 17th of July, 2022. No more Amp at 2%, no more USDC at 1%, no more DAI at 1%, no more Ethereum at 1% and no more Bitcoin at 1.5%. From 4% rewards to 2% rewards to 0%. Honestly can say that the most enticing aspect of using Coinbase as an exchange and service was the reward program and ability to spend cryptocurrency easily. I’m quite disappointed but from a business perspective I understand not wanting to go under by simply trying to sustain their rewards program as this is probably one of their largest expenses. From 4% to 0% in a year. Was nice while it lasted.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 346,
  "permalink": "/r/CryptoCurrency/comments/vw0saw/looks_like_coinbase_will_be_discontinuing_the/",
  "subreddit": "CryptoCurrency",
  "id": "vw0saw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Got a notification to select a new reward but it appears that there are no\noptions to select from that don’t expire on the 17th of July, 2022. No more Amp\nat 2%, no more USDC at 1%, no more DAI at 1%, no more Ethereum at 1% and no more\nBitcoin at 1.5%. From 4% rewards to 2% rewards to 0%. Honestly…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "新しい報酬を選択するための通知が来たが、報酬がないようだ。\n2022年7月17日に有効期限を迎えないものを選択することはできないようです。Ampはもうない。\nは2％、USDCは1％、DAIは1％、イーサリアムは1％、そして\nビットコインは1.5%に。4%の報酬から2%の報酬へ、そして0%へ。正直なところ...",
      "title": "CoinbaseがCoinbase Cardの特典を廃止するようです。暗号には悲しい日だ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "收到了选择新奖励的通知，但似乎没有任何奖励。\n但似乎没有不在2022年7月17日到期的选项可供选择。不再有2%的Amp\n2%，USDC 1%，DAI 1%，以太坊1%，比特币1%。\n比特币的1.5%。从4%的奖励到2%的奖励到0%。说实话...",
      "title": "看来Coinbase将停止Coinbase卡的奖励。这对加密货币来说是个悲伤的日子。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "收到了選擇新獎勵的通知，但似乎沒有任何獎勵。\n但似乎沒有不在2022年7月17日到期的選項可供選擇。不再有2%的Amp\n2%，USDC 1%，DAI 1%，以太坊1%，比特幣1%。\n比特幣的1.5%。從4%的獎勵到2%的獎勵到0%。說實話...",
      "title": "看來Coinbase將停止Coinbase卡的獎勵。這對加密貨幣來說是個悲傷的日子。"
    }
  ]
}