{
  "author": "Leenixus",
  "the_new_excerpt": "I don't get what you guys are worried about with PLTR.\n\nHere's my personal DD on PLTR, you're welcome to read and do whatever you want.\nOther helpful info or pointing out mistakes in my DD is very welcome.\n\nFears preventing you from buying PLTR\n\n 1. Targeted ads on your phone from Yahoo Finance or…",
  "original_created_utc": 1610799485,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我不明白你们担心PLTR有什么用。\n\n这是我个人对PLTR的DD，欢迎你们阅读，想怎么做就怎么做。\n非常欢迎其他有用的信息或指出我DD中的错误。\n\n阻碍你购买PLTR的恐惧\n\n 1. 手机上的定向广告，来自雅虎财经或...",
      "title": "潘多拉媒LTR - The Big DDD."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不明白你們擔心PLTR有什麼用。\n\n這是我個人對PLTR的DD，歡迎你們閱讀，想怎麼做就怎麼做。\n非常歡迎其他有用的信息或指出我DD中的錯誤。\n\n阻礙你購買PLTR的恐懼\n\n 1. 手機上的定向廣告，來自雅虎財經或...",
      "title": "潘多拉媒LTR - The Big DDD."
    }
  ],
  "title": "$PLTR - The Big DDD",
  "created_utc": 1610822377,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t get what you guys are worried about with PLTR.</p>\n\n<p>Here&#39;s my <strong>personal</strong> DD on PLTR, you&#39;re welcome to read and do whatever you want. Other helpful info or pointing out mistakes in my DD is very welcome.</p>\n\n<p>Fears preventing you from buying PLTR</p>\n\n<ol>\n<li>Targeted ads on your phone from Yahoo Finance or Zacks telling you PLTR = BAD!!!1!eleven</li>\n<li>Shills spamming &quot;pLtR tO tHe MoOn&quot; and :rocket: on PLTR thread comments.</li>\n<li>Last quarter&#39;s seemingly bad financials/earnings.</li>\n<li>Financials Moving Forwards</li>\n<li>Soros who owns 21 million shares &quot;threatening&quot; to sell his shares upon DPO expiry.</li>\n<li>DPO expiry 3 days after February&#39;s earnings and possible insiders and DPO holders sale and dip.</li>\n<li>What does PLTR tldr.</li>\n<li>Other Information</li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p><strong><em>#1 Targeted Ads</em></strong></p>\n\n<p>Ads and articles are both paid for by someone.The fact that in the past 3 weeks i&#39;ve been getting multiple multiple targeted ads on my phone related to PLTR since i love PLTR so much.</p>\n\n<p>Ads are telling me that PLTR is bad, doesn&#39;t provide a dividend, they&#39;re telling me PLTR&#39;s fair price is 20 instead of 25 based on some financial model and have gone as far as to provide a list of alternative stocks to buy.</p>\n\n<p>To me, this all screams: <strong>SCARE TACTICS</strong></p>\n\n<p>Additionally, the last few weeks of ups and downs in PLTR&#39;s stock price is another indication of the attempts to short the stock to sh!t and drive investors out. (For what reason? I don&#39;t know.)</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>#2 Shilling PLTR</em></strong></p>\n\n<p>I myself love to shill PLTR to people whenever i can. I do this because i legitimately think this company will do great. I work as a product manager in a software development house and understand what PLTR does. PLTR is not cryptic.Regardless, i think when people shill PLTR to you, they are right to do so as you&#39;re probably missing out on a great opportunity to make money in the long run. If you&#39;re looking for big gains short term, maybe try something else.</p>\n\n<p>Shillery is OK, but at least give the facts.</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>#3 Last Quarter&#39;s Bad Financials</em></strong></p>\n\n<p>If you&#39;d done your DD not by searching reddit posts but by checking PLTR&#39;s actual quarterly report, you&#39;d know that PLTR&#39;s &quot;bad&quot; last financial quarter/earnings were due to the costs of listing themselves on the <em>New York Stock Exchange</em>.~855million were spent on listing and stock related compensations and this is the big reason.</p>\n\n<p><strong>Direct quote by PLTR here:</strong> <a href=\"https://investors.palantir.com/news-details/2020/Palantir-Reports-Revenue-Growth-of-52-in-the-Third-Quarter-Raises-Full-Year-2020-Guidance/default.aspx\">https://investors.palantir.com/news-details/2020/Palantir-Reports-Revenue-Growth-of-52-in-the-Third-Quarter-Raises-Full-Year-2020-Guidance/default.aspx</a></p>\n\n<blockquote>\n<p>We incurred a loss from operations of $847.8 million, which includes $847.0 million in stock-based compensation following our recent direct listing.</p>\n</blockquote>\n\n<p>I would like to remind everyone that this is a <strong>1 TIME THING.</strong> Put simply, this means that PLTR won&#39;t have as excessive losses next quarter as they did this last quarter.</p>\n\n<p><em>Additionally</em>, let me go into further detail on this and not just leave it to that.</p>\n\n<ul>\n<li><strong><em>PLTR&#39;s quarterly operating expenses for the past 3 quarters were at around ~260 million.</em></strong></li>\n<li><strong><em>PLTR&#39;s operating expenses this quarter were ~987 million.</em></strong></li>\n</ul>\n\n<p>ADDITIONALLY...</p>\n\n<p>PLTR also had a higher R&amp;D cost this quarter that just passed. Normally they&#39;d pay 80 million on R&amp;D, but somehow ended up paying ~300 million this quarter. No one knows why, but this is another thing that influenced PLTR&#39;s earnings.</p>\n\n<p><a href=\"https://investors.palantir.com/news-details/2020/Palantir-Reports-Revenue-Growth-of-52-in-the-Third-Quarter-Raises-Full-Year-2020-Guidance/default.aspx\">https://investors.palantir.com/news-details/2020/Palantir-Reports-Revenue-Growth-of-52-in-the-Third-Quarter-Raises-Full-Year-2020-Guidance/default.aspx</a></p>\n\n<blockquote>\n<p>On September 30, 2020, in connection with the Direct Listing, we incurred $769.5 million and $8.4 million of stock-based compensation using the accelerated attribution method related to the satisfaction of the performance-based vesting condition for RSUs and growth units, respectively, that had satisfied the service-based vesting condition as of such date.</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p><strong><em>#4 PLTR financials moving forwards</em></strong></p>\n\n<p>PLTR is deep in bed with the government and the Biden regime although may look like it would be against using PLTR is in fact secretly very pro-surveillance e.g pro Palantir.</p>\n\n<p>Here&#39;s some of the known organizations in the US Govt that use PLTR:</p>\n\n<ol>\n<li>CDC</li>\n<li>Office of the Secretary</li>\n<li>Food and Drug Administration</li>\n<li>Immigration and Customs Enforcements / ICE</li>\n<li>Internal Revenue Service / IRS</li>\n<li>National Institute on Drug Abuse</li>\n<li>DOD/ARMY - ACC Aberdeen Proving Ground</li>\n<li>Coast Guard / DHS</li>\n<li>DOD/NAVY - Naval Information Warfare Systems Command</li>\n<li>US Attorney&#39;s Offices / DOJ</li>\n<li>US Special Operations Command / SPEC OPS</li>\n</ol>\n\n<p>Boys. The big institutional people know these things. You just found this out. See how deep PLTR is already in bed with the Government?????? Palantir IS the next Raytheon/Lockheed of DATA aggregation and visualization.</p>\n\n<p><strong><em>UPCOMING EARNINGS</em></strong></p>\n\n<p>I&#39;ve done some quick maths and it looks like PLTR is more likely to be in positive earnings this quarter and with a 0.02 cent EPS target, we can easily assume that they&#39;ll destroy this with maybe 0.04 or 0.08 EPS. In the worst case scenario, PLTR&#39;s EPS this quarter could be somewhere around MINUS -0.05 ish due to interview costs and ad/campaigning costs that were not there before the company was listed.</p>\n\n<p><strong><em>WHAT CAN DESTROY PALANTIR</em></strong></p>\n\n<p>Now, there&#39;s big possible downsides and Palantir can fail IF contracts that expire are not renewed. That&#39;s biggest REAL reason for Palantir&#39;s balance sheet getting screwed.</p>\n\n<p>I&#39;ve seen a disturbing pattern with PLTR&#39;s financials and that&#39;s that every year, it&#39;s R&amp;D cost is rising by between 150 and 350 million dollars. This is quite a bit of negative revenue and if new contracts are not constantly coming in, PLTR&#39;s balance can start going into the negative.</p>\n\n<p><strong><em>WHAT WILL NOT DESTROY PALANTIR</em></strong></p>\n\n<p>Some people may have concerns over the new left leaning government dumping PLTR. An article was posted that is behind a paywall EVERYWHERE that goes something like this:</p>\n\n<p><a href=\"https://www.thedailybeast.com/cdc-officials-urge-biden-team-to-dump-palantirs-covid-tracker\">https://www.thedailybeast.com/cdc-officials-urge-biden-team-to-dump-palantirs-covid-tracker</a></p>\n\n<p>In my opinion, i believe this is inconsequential and that a few people crying to daddy Biden to kill a multimillion contract with PLTR is a stretch. Also we know the current new Biden team has his hands full and will have them full for at least the next 1 year with what&#39;s going on.</p>\n\n<p>There is no time to deal with a few crybabies and even if he did deal with it and did decide to kill the PLTR Tiberius Covid tracker contract with the CDC which he WONT, these things take months and years to deal with, and by then the contract/s will have already brought PLTR tons of money and revenue in.</p>\n\n<p><strong><em>HOW MUCH DOES KARP AND HIS GOONS GET PAID</em></strong></p>\n\n<p>Short answer is... A LOT. The amounts below are PER YEAR. That&#39;s a lot of money in the hole and contributes to annoying amount to why PLTR is always just at the edge of just barely being profitable.</p>\n\n<p><a href=\"https://preview.redd.it/ba58nqcurob61.png?width=2615&amp;format=png&amp;auto=webp&amp;s=55d45833faad4d60ea8dc142a9601c44b4cc7395\">https://preview.redd.it/ba58nqcurob61.png?width=2615&amp;format=png&amp;auto=webp&amp;s=55d45833faad4d60ea8dc142a9601c44b4cc7395</a></p>\n\n<p>Palantir&#39;s prospectus 311 page document&#39;s 130 last pages are almost all exclusively talking about extremely complicated options trading schemes that are made by Cohen and others to make sure they can squeeze out a LOT of money out of PLTR.</p>\n\n<p>Mithril Investments has existed from before and is not a new company. Owned by Thiel/Cohen/Karp as a way to launder and exchange options for more options and more money for all 3 of them. Also Shyam Sankar to me feels corrupt which scares me a bit, he&#39;s had some very shady dealings and has brought his wife in PLTR that gets paid 200k per year.</p>\n\n<p>Prospectus Document: <a href=\"https://www.sec.gov/Archives/edgar/data/1321655/000119312520230013/d904406ds1.htm\">https://www.sec.gov/Archives/edgar/data/1321655/000119312520230013/d904406ds1.htm</a></p>\n\n<p>I suggest you skim through it, it contains EVERYTHING about Palantir.</p>\n\n<p><strong>Palantir is going to need to have to be getting AT LEAST 500 million in NEW contracts per year to REMAIN BARELY profitable. It&#39;s doable in my opinion, but just barely and it&#39;s why they made the company public to try and get more people&#39;s attention and increase the inflow of contracts.</strong></p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>#5 Soros and his 21 million shares</em></strong></p>\n\n<p>First of all, i think we can all agree that Soros can suck it.</p>\n\n<p>If you&#39;ve read a few articles here and there, you&#39;ll know that Soros owns/owned 1% of Class A PLTR shares. No one knows whether he&#39;s sold them yet or if he&#39;s an DPO holder who&#39;ll sell 3 days after February&#39;s earnings.</p>\n\n<p>Whether he sells them or buys more will be mostly inconsequential in my opinion. We see dips and pumps every day. He legally cannot sell his shares all at once, he&#39;ll have to sell certain amounts daily and over time. This will create annoying sideways motion as shares exchange hands and consolidation starts for 2-3 weeks until his and insider shares exchange hands.</p>\n\n<p>Nothing special to see here, move along just a little draw down resulting in some consolidation.</p>\n\n<p>PLTR is exposed to OIL more than anything, so fluctuations in the general market and general market crashes affect PLTR much less than other stocks. Also PLTR does not track ANY benchmarks. NONE.</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>#6 DPO expiry 3 days after earnings in February</em></strong></p>\n\n<p>To my limited knowledge, this is how BIG plays who are holding DPO shares usually work:</p>\n\n<ul>\n<li>If a stock has performed well up to earnings and investors are more than happy with the returns, they&#39;re more likely to not sell their stock or just sell less than they normally would.</li>\n<li>If a stock hasn&#39;t performed as well as investors thought, these investors are more likely to sell stock or reduce their positions more than normal.</li>\n</ul>\n\n<p>There&#39;s a total of 1.16Billion Class A PLTR shares currently (Give or take don&#39;t flog me). We are currently trading with ~250 million shares while the rest are locked away in the DPO.</p>\n\n<p>When those shares are &quot;unlocked&quot; in February, the price of the stock won&#39;t be diluted. These shares already exist and are accounted for. They are simply locked. Also when they are unlocked, the share price won&#39;t simply multiply because all shares are now tradeable.</p>\n\n<blockquote>\n<p>According to <a href=\"https://www.sec.gov/Archives/edgar/data/1321655/000119312520257973/d89036dex991.htm\">Palantir’s after-hours filing with the SEC this afternoon</a>, the company has 1.16 billion Class A shares, 484 million Class B shares and 1 million Class F shares on its cap table outstanding today, or a total of roughly 1.64 billion. Only Class A shares will trade, and Class B and F shares are convertible to Class A shares on a one-to-one basis. On a fully diluted basis, which Palantir says represents 2.2 billion shares total according to its most recent S-1 filing, the company is valued at $16 billion. The difference between those two aggregate numbers comes from outstanding stock performance grants, warrants and other financial instruments.</p>\n</blockquote>\n\n<p>What <strong>WILL</strong> affect stock price:</p>\n\n<ul>\n<li>Employees exercising their non class A options into Class A shares. This IS dilution.</li>\n<li>The bigwigs e.g Alex Karp, Peter Thiel and a few other bigshots exercising their options and then selling them for a profit.</li>\n</ul>\n\n<p><em>To note, regular employees will barely affect the price of the stock with their miniscule share holdings. Alex Karp, Peter Thiel and a handful of other high ranked executives in PLTR are the ones that will create a tiny but manageable ripple in the stock price.</em></p>\n\n<p>What <strong>COULD</strong> affect the stock price a lot:</p>\n\n<ul>\n<li>Massive sell off by the big institutional holders.</li>\n<li>Not shorters. (Citron and Citi can suck it, we&#39;re in control here)</li>\n<li>People with weak spaghetti wet paper hands.</li>\n<li>Everyone fomoing the same weeklies e.g like when everyone bought Jan 15 calls on everything.</li>\n<li>Big but silent scare campaign (that&#39;s already going on) to scare off normies like us.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong><em>#7 What does PLTR do, tldr.</em></strong></p>\n\n<p>Imagine Facebook&#39;s database of everything about everyone &amp; Youtube&#39;s Database of everything &amp; Geolocation data in a database made by the US Army for known terrorist cells.</p>\n\n<p>Palantir allows you to select and match varied data TYPES from several different database, combine it in any way you want and visualize it so that it&#39;s human readable by even the dumbest person in the room so that even they can see patterns and come to conclusion on a subject matter.</p>\n\n<p>It&#39;s kind of like filling an excel sheet with data and then visualizing it with a bar chart, except the date you filled the sheet with can be anything and not just numbers or dates or countries and you can make various combinations using all the different rows of data to maybe come up with a pattern to something like how to best distribute the Covid vaccines in the counties in a very specific state in the US.</p>\n\n<p>Literally what you see in SciFi movies where people combine random data by smashing keys on a keyboard and somehow find the murderer, the location of a terrorist or the percentage that someone will commit a murder in the future based on a lot of random data about that person or the area, country, family, history... anything.</p>\n\n<p>While this all might sound super cool and amazing, it is. Maybe in 10 years time there will be a few more companies doing this, but for now, it&#39;s only Palantir, Circles, Alteryx and a few other private entities that do this type of thing. Many of them work with governments and are hush hush due to the kinds of things they use this type of software for (terrorist cells, warzones, etc) and the public backlash this could cause.</p>\n\n<p>tldr: Glorified data aggregator and visualization platform/software with different access levels for different people.</p>\n\n<p><strong>PLTR is superbly positioned to offer their software to SLOW and Boomer like organizations like Governments.</strong></p>\n\n<p>Governments are stupid and don&#39;t have neither the time, nor technical knowledge to develop this software themselves for internal use. This is what PLTR capitalizes on and why Governments use them so much.</p>\n\n<p>Governments could have spent the a fraction of the money they spend on PLTR contracts to make the software themselves but only for their own internal systems and use, but they can&#39;t and if they tried, they&#39;d fail because technocracy in governments is not a thing. By the time they&#39;d even complete a project like this, it&#39;d likely be out of spec, unusable and would require further development and money and we know how slow and bad governments are at doing even the basics. Again PLTR wins because of this.</p>\n\n<p><strong>PLTR is likely NOT</strong> to be adopted by giants like Google or FB or other modern tech organizations of any size because they are not stupid. They have their own purpose built internal systems that they use to do everything related to data aggregation and visualization because they have the technical knowledge and resources. Buying PLTR for their use is a joke.</p>\n\n<p>PLTR capitalizes on being general a general purpose tool and is set up manually by an engineer over the course of 4-10 days for each customer. The engineer customizes and configures the system for each company&#39;s custom use since the software allows you to do so. Regular aggregation and visualization software CAN do the same, but typically lacks data input types and features that PLTR has because PLTR has cultivated a special set of features over many years that were suggested by their existing clientele in battlefields and other places.</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>#8 Other Information</em></strong></p>\n\n<p><strong><em>\\</em>*Big known PLTR Holders*\\</strong>**</p>\n\n<p><a href=\"https://preview.redd.it/a404oalxrob61.png?width=1631&amp;format=png&amp;auto=webp&amp;s=8c2dbcfac5a7ca207127771ec4e3133f8d943359\">https://preview.redd.it/a404oalxrob61.png?width=1631&amp;format=png&amp;auto=webp&amp;s=8c2dbcfac5a7ca207127771ec4e3133f8d943359</a></p>\n\n<p><strong><em>\\</em>*PLTR&#39;s Price List (2019)*\\</strong>**</p>\n\n<p><a href=\"https://www.esi.mil/Download.aspx?id=7186\">https://www.esi.mil/Download.aspx?id=7186</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>\\</em>*Personal TA and Crayon Mania*\\</strong>**</p>\n\n<p><a href=\"https://www.tradingview.com/chart/PLTR/nrjqL4dw-PLTR-Risky-April-100-200-possibility/\">https://www.tradingview.com/chart/PLTR/nrjqL4dw-PLTR-Risky-April-100-200-possibility/</a></p>\n\n<p><a href=\"https://www.tradingview.com/chart/PLTR/5YcdCye0-PLTR-Schizzo-Technical-Analysis/\">https://www.tradingview.com/chart/PLTR/5YcdCye0-PLTR-Schizzo-Technical-Analysis/</a></p>\n\n<p><a href=\"https://www.tradingview.com/chart/PLTR/CkCTvtqM-PLTR-PLTR-train-leaving-the-station-get-ready/\">https://www.tradingview.com/chart/PLTR/CkCTvtqM-PLTR-PLTR-train-leaving-the-station-get-ready/</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>\\</em>*PLTR stock pumping events*\\</strong>**</p>\n\n<ul>\n<li>7&#39;th Jan - Interview</li>\n<li>26&#39;th Jan - Demonstration</li>\n<li>11&#39;th Feb - Earnings</li>\n<li>~15&#39;th Feb - DPO expiration - Havoc</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong><em>\\</em>*Similar Companies*\\</strong>**</p>\n\n<ul>\n<li>PLTR - Palantir - Stock Price ~$25 - Market Cap 48bln</li>\n<li>AYX - Alteryx - Stock Price ~$125 - Market Cap 8bln</li>\n<li>Semantic Research - Private</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong><em>\\</em>*Known Contract Info*\\</strong>**</p>\n\n<ul>\n<li>240 million Palantir Air Force contract expiring soon in 3 months. If it&#39;s re-signed, it&#39;ll be a big catalyst for a PLTR pump. If not, it&#39;ll be a sad dump day.</li>\n<li>Mithril, investment/financial company owned by Karp and Thiel buys a 3.15million share stake in Palantir. Somehow this makes them major stakeholders.</li>\n<li>Sompo holdings has 5% of all PLTR shares.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong><em>\\</em>*Past and new US KNOWN gov contracts. Source</strong>* <a href=\"https://govtribe.com/\"><strong><em>govtribe.com</em></strong></a><strong><em>\\</em>\\</strong>**</p>\n\n<p><a href=\"https://preview.redd.it/kbim7afrrob61.png?width=1392&amp;format=png&amp;auto=webp&amp;s=9abc99d9995c4972919e275f407e1bba6382dfdd\">https://preview.redd.it/kbim7afrrob61.png?width=1392&amp;format=png&amp;auto=webp&amp;s=9abc99d9995c4972919e275f407e1bba6382dfdd</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>\\</em>*Quotes from Won and LOST contracts from Federal Agencies*\\</strong>**</p>\n\n<p>National Institute on Drug Abuse (NIH) - <strong>WON</strong></p>\n\n<blockquote>\n<p>The National Institutes of Health (NIH) intends to award a contract without providing for full and open competition to Palantir Technologies, Inc., 100 Hamilton Ave., Suite 300, Palo Alto, CA 94301.</p>\n</blockquote>\n\n<p>Veteran Health Association - <strong>WON</strong></p>\n\n<blockquote>\n<p>The pandemic-related data management and operational decision-support requirements have led the program office to determine that the Palantir data management and analytics platform is the only viable solution that would maintain the current operational capability, without a degradation in VHA COVID-19 decision-support.</p>\n</blockquote>\n\n<p>AFLCMC Wright Patterson AFB (DOD - USAF - AFMC - AFLCMC) - <strong>LOST</strong></p>\n\n<blockquote>\n<p>Subject Matter Experts (SMEs) held meetings in January/February 2020 timeframe with potential vendors to determine their capabilities and their abilities to meet this mission requirement. They met with Palantir, Recorded Future, Altyrex, In-Q-tel and Semantic AI. From the information they gathered in those meetings it was determined that Semantic AI would be the only company that could fully meet the requirements of this effort without further delaying the project and incurring additional costs</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<h1></h1>\n\n<h1></h1>\n\n<p>&#x200B;</p>\n\n<p>Now friends, here&#39;s my position on PLTR. I&#39;ll be holding onto it for the next year. If it&#39;s not at least 300% by then, i&#39;m selling it and moving on to the next stock. App i&#39;m using is Revolut.</p>\n\n<p>Also yes, i&#39;m ALL-IN only on Palantir because i know my money will multiply itself in the short term. I&#39;m not holding this till 2025 as others are supposedly doing. I&#39;m selling in 2022 with 300% or more profit. PLTR is severely undervalued, underpriced because it&#39;s a DPO. Give it till EOY and we&#39;re going to be rich. If it was an IPO it&#39;d be trading at 180+ already imho.</p>\n\n<p>I&#39;ve spent the last month and a half holding PLTR. I&#39;ve gone full schizzo mode when it comes to PLTR. I lose sleep daily and i love it. I hadn&#39;t slept for 37 hours a few days ago because i spent so much time researching PLTR and scraping the internet for all possible information.</p>\n\n<p>I come from an IT/Development background, so i understand what PLTR does completely.</p>\n\n<p>My PT&#39;s for PLTR are:</p>\n\n<ul>\n<li>48-89 by March or April.</li>\n<li>75 - 125 by EOY.</li>\n<li>200+ 2022 IF they solve their income and constantly increasing R&amp;D cost issues.</li>\n</ul>\n\n<p><a href=\"https://preview.redd.it/4t0k1ujprob61.png?width=407&amp;format=png&amp;auto=webp&amp;s=0b3a16265edafa290432e6b79f9009e3df99f495\">https://preview.redd.it/4t0k1ujprob61.png?width=407&amp;format=png&amp;auto=webp&amp;s=0b3a16265edafa290432e6b79f9009e3df99f495</a></p>\n</div><!-- SC_ON -->",
  "score": 2469,
  "permalink": "/r/wallstreetbets/comments/kyhz9a/pltr_the_big_ddd/",
  "subreddit": "wallstreetbets",
  "id": "kyhz9a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311224123
}