{
  "author": "Excellent_Trouble125",
  "the_new_excerpt": "Stellar lumens is one of the cheapest and fastest ways to transfer money across\nthe world with no middleman, banks across the world are using xlm to transfer\nmillions cheaply and securely. Whilst this was previously expensive before\ncrypto existed, with crypto this has become much cheaper. Nano is…",
  "original_created_utc": 1619219278,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ステラルーメンは、世界中の銀行がxlmを利用して、中間業者を介さずに、最も安く、最も速く送金できる方法の一つです。\n世界中の銀行がxlmを使って安価で安全な送金を行っています。\n世界中の銀行がxlmを使って何百万ドルもの送金を安く安全に行っています。暗号が存在する前は、この方法は高価でしたが\n暗号が存在する前は高額でしたが、暗号を使えばはるかに安価になります。ナノは...",
      "title": "長期的な利益を得るためには、誇大広告ではなく、技術的なものを買いましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Stellar lumens是最便宜和最快速的汇款方式之一。\n世界各地的银行都在使用xlm转账，没有中间商。\n全世界的银行都在使用xlm，以廉价和安全的方式转移数百万美元。虽然这在以前是很昂贵的\n虽然这在加密货币出现之前是昂贵的，但随着加密货币的出现，这变得更加便宜了。纳米是...",
      "title": "为获得长期收益，购买技术而不是炒作"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Stellar lumens是最便宜和最快速的匯款方式之一。\n世界各地的銀行都在使用xlm轉賬，沒有中間商。\n全世界的銀行都在使用xlm，以廉價和安全的方式轉移數百萬美元。雖然這在以前是很昂貴的\n雖然這在加密貨幣出現之前是昂貴的，但隨着加密貨幣的出現，這變得更加便宜了。納米是...",
      "title": "爲獲得長期收益，購買技術而不是炒作"
    }
  ],
  "title": "For long term gains, buy for tech and not hype",
  "created_utc": 1619253109,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Stellar lumens is one of  the cheapest and fastest ways to transfer money across the world with no middleman, banks across the world are using xlm to transfer millions cheaply and securely. Whilst this was previously expensive before crypto existed, with  crypto this has become much cheaper. Nano is completely free and almost instant and thus the use case for future adoption is very promising, though as of now it lacks adoption </p>\n\n<p>Monero is completely untraceable providing anonymity to transactions which is hugely important for people living in repressive regimes across the world, people wary of government tyranny and many other valid reasons. Dash and zcash are also privacy coins though don&#39;t have the same level of adoption and thus aren&#39;t as good long term projects. </p>\n\n<p>These are examples of working products with real use cases that are proven to work and thus make excellent long term investments.</p>\n\n<p>Ethereum is the backbone of hundreds of different block chain services/products/ decentralised applications. Litecoin has stood the test of time as a cheap secure coin for transactions and will have added privacy soon.\nCardano is an &#39;Eth killer&#39; that&#39;s is faster, cheaper and doesn&#39;t need mining. It also has smart contracts coming soon and is basically eth on steroids and was built by one of the eth Co founders.</p>\n\n<p>Now compare this to dogecoin, safe moon, cum rocket  ( ͡° ͜ʖ ͡°) or whatever &#39;moon&#39; coin that was released today, what do any of them do? They are essentially a ponzi scheme and as they fulfill no purpose (or none that other coins can do better) they won&#39;t stand the test of time and people will be left holding bags.</p>\n\n<p>What&#39;s I&#39;m getting at is do your research and buy based on the tech and fundemantals, not hype, as this is what will grant you successful investments long term.</p>\n\n<p>If you want to buy doge or safe moon go ahead, just treat it as a bit of fun and don&#39;t yolo your life savings in lol</p>\n\n<p>P.s I don&#39;t own all the coins I have examples of and am not trying to shill, just taking a few examples to get the point across</p>\n</div><!-- SC_ON -->",
  "score": 293,
  "permalink": "/r/CryptoCurrency/comments/mx7gyo/for_long_term_gains_buy_for_tech_and_not_hype/",
  "subreddit": "CryptoCurrency",
  "id": "mx7gyo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776208808
}