{
  "author": "blackmoonxxx",
  "original_created_utc": 1648970068,
  "title": "Why is our society built in a way that we have to works ourselves to death to be able to afford food, housing, and healthcare?",
  "created_utc": 1648994773,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If life is so precious and we should take advantage of everyday we have, why is it that our “normal” is to have to work so hard for things we should already have. I think the way our society is built makes it too stressful to be able to take advantage of how lucky we are to be alive, and instead just struggle to get by.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/tv3i6d/why_is_our_society_built_in_a_way_that_we_have_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "tv3i6d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If life is so precious and we should take advantage of everyday we have, why is\nit that our “normal” is to have to work so hard for things we should already\nhave. I think the way our society is built makes it too stressful to be able to\ntake advantage of how lucky we are to be alive, and instead…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もし、人生がとても貴重で、毎日を大切にしなければならないのなら、どうして\n私たちの「普通」は、すでにあるはずのもののために一生懸命働かなければならないことなのです。\nを持っています。この社会の成り立ちからすると、ストレスが多すぎて、このままでは\n生きていることがいかに幸せか、その恩恵にあずかりたいと思います。",
      "title": "なぜ私たちの社会は、食料、住居、医療をまかなうために死ぬほど働かなければならないような仕組みになっているのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果生命如此宝贵，我们应该利用我们所拥有的每一天，为什么我们的 \"常态 \"是要为我们本该拥有的东西而努力工作呢？\n为什么我们的 \"常态 \"是必须为我们应该已经拥有的东西而努力工作？\n拥有的东西。我认为我们社会的构建方式使我们的压力太大，无法利用我们活着的幸运。\n利用我们活着是多么幸运，而不是......"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果生命如此寶貴，我們應該利用我們所擁有的每一天，爲什麼我們的 \"常態 \"是要爲我們本該擁有的東西而努力工作呢？\n爲什麼我們的 \"常態 \"是必須爲我們應該已經擁有的東西而努力工作？\n擁有的東西。我認爲我們社會的構建方式使我們的壓力太大，無法利用我們活着的幸運。\n利用我們活着是多麼幸運，而不是......",
      "title": "なぜ私たちの社會は、食料、住居、醫療をまかなうために死ぬほど働かなければならないような仕組みになっているのでしょうか。"
    }
  ]
}