{
  "author": "samcornwell",
  "the_new_excerpt": "Back in the early days of Bitcoin, around the time when alts started popping up,\nmany users spent time in the Bitcointalk forum, perhaps many still do. The value\nwas hovering around $100-300 and just as we are now, everyone was excited about\nthe future!\n\nOne comment reply that has always stuck with…",
  "original_created_utc": 1613054545,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "早在比特币的早期，大约在alts开始出现的时候。\n很多用户在Bitcointalk论坛上花时间，也许很多人现在还在这样做。价值\n是徘徊在100-300元左右，就像我们现在一样，每个人都对\n未来!\n\n有一条评论回复，一直让人记忆犹新... ...",
      "title": "\"记住，有一天一个比特币会值5万美元\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "早在比特幣的早期，大約在alts開始出現的時候。\n很多用戶在Bitcointalk論壇上花時間，也許很多人現在還在這樣做。價值\n是徘徊在100-300元左右，就像我們現在一樣，每個人都對\n未來!\n\n有一條評論回覆，一直讓人記憶猶新... ...",
      "title": "\"記住，有一天一個比特幣會值5萬美元\""
    }
  ],
  "title": "“Remember, one day a single Bitcoin will be worth $50,000”",
  "created_utc": 1613065193,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Back in the early days of Bitcoin, around the time when alts started popping up, many users spent time in the Bitcointalk forum, perhaps many still do. The value was hovering around $100-300 and just as we are now, everyone was excited about the future!</p>\n\n<p>One comment reply that has always stuck with me, and one I have used countless times in the 8 years since I first heard it, was “Remember, one day a Bitcoin will be worth $50,000.” It was said with such conviction and authority that I haven’t been able to forget it.</p>\n\n<p>Perhaps you’re reading this now? </p>\n\n<p>Today we are on the cusp of that prediction coming true, and though it felt like a certainty back then. I want to say thank you.</p>\n\n<p>Thank you to that person for giving me the ground work to build upon with my own Bitcoin journey. Thank you for instilling confidence in me that I could share with others. Thanks for being the first person to open the door for me and show me the true meaning, value and potential of Bitcoin. I won’t ever forget it and hope you’re doing very well in life.</p>\n</div><!-- SC_ON -->",
  "score": 1226,
  "permalink": "/r/Bitcoin/comments/lhm24v/remember_one_day_a_single_bitcoin_will_be_worth/",
  "subreddit": "Bitcoin",
  "id": "lhm24v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728612315
}