{
  "author": "WeAreWater_TieDye",
  "original_created_utc": 1636483060,
  "title": "Who remembers when Reddit ran a promotion to exchange Karma for Bitcoin 9 years ago?!",
  "created_utc": 1636497584,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>9 years ago, Reddit offered a conversion of karma to bitcoin! I wonder if the promotion is still in effect haha. Did anyone try this?! I know I submitted a request to convert, but probably did so incorrectly. Anywho pretty cool to look back on with the thought of reddit tokenizing karma - its not the first time they have done this!</p>\n\n<p>Would be curious if this still works, or if any redditors managed to pull it off! Reddit was a much different place 9 years ago, and karma was harder to accrue. Front page postings had like 300 karma rather than the hundreds of thousands we see today!</p>\n\n<p>So really... this is the second or third effort to tokenize karma!</p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/CryptoCurrency/comments/qqa60l/who_remembers_when_reddit_ran_a_promotion_to/",
  "subreddit": "CryptoCurrency",
  "id": "qqa60l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "9 years ago, Reddit offered a conversion of karma to bitcoin! I wonder if the\npromotion is still in effect haha. Did anyone try this?! I know I submitted a\nrequest to convert, but probably did so incorrectly. Anywho pretty cool to look\nback on with the thought of reddit tokenizing karma - its not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "9年前、Redditはカルマをビットコインに変換するサービスを提供していた! このプロモーションはまだ続いているのかな？\nこのプロモーションはまだ有効なのかな？誰か試してみましたか！？私は変換のリクエストをしました。\nしかし、おそらく間違っていたのでしょう。いずれにしても、振り返ってみるととてもクールです。\n振り返ってみると、redditがカルマをトークン化しているのではないかと思ってしまいます。",
      "title": "9年前にRedditがカルマをビットコインに交換するプロモーションを行ったことを覚えている人はいますか！？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "9年前，Reddit提供了将业力转换为比特币的服务! 我不知道这个\n促销仍然有效，哈哈。有谁试过这个吗! 我知道我提交了一个\n请求转换，但可能做得不对。不管怎么说，看一下很爽\n回想一下Reddit将因果关系代币化的想法 - 它不是...",
      "title": "谁还记得9年前Reddit开展的用Karma兑换比特币的促销活动？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "9年前，Reddit提供了將業力轉換爲比特幣的服務! 我不知道這個\n促銷仍然有效，哈哈。有誰試過這個嗎! 我知道我提交了一個\n請求轉換，但可能做得不對。不管怎麼說，看一下很爽\n回想一下Reddit將因果關係代幣化的想法 - 它不是...",
      "title": "誰還記得9年前Reddit開展的用Karma兌換比特幣的促銷活動？"
    }
  ]
}