{
  "author": "IllusionaryHaze",
  "original_created_utc": 1628711306,
  "title": "No, ADA will not reach $10 this year. Stop lying to new people in crypto",
  "created_utc": 1628721074,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Some of you need to learn about market caps and circulating supply of some coins.<br/>\nThis current pump is great, and I&#39;m happy for ADA holders, but the coin will not do 5x until the end of the year. Hell, not even by 2024 until the next halving of BTC.  </p>\n\n<p>If we want more adoption, and more people to join, we have to be honest with people and explain the various topics of crypto. Otherwise, we&#39;ll just push people away.</p>\n</div><!-- SC_ON -->",
  "score": 179,
  "permalink": "/r/CryptoCurrency/comments/p2kluy/no_ada_will_not_reach_10_this_year_stop_lying_to/",
  "subreddit": "CryptoCurrency",
  "id": "p2kluy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Some of you need to learn about market caps and circulating supply of some\ncoins.\nThis current pump is great, and I'm happy for ADA holders, but the coin will not\ndo 5x until the end of the year. Hell, not even by 2024 until the next halving\nof BTC.\n\nIf we want more adoption, and more people to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "一部のコインのマーケットキャップや流通量について学ぶ必要がある人もいるでしょう。\nコインの流通量を知る必要があります。\nしかし、このコインが5倍になるのは年末までです。\nしかし、コインが5倍になるのは今年の終わりまでです。BTCが次の半分になる2024年までも無理でしょう。\nBTCが半分になるまでです。\n\nもし私たちが、より多くの採用と、より多くの人々に...",
      "title": "今年はADAが10ドルに達することはありません。暗号の新規参入者に嘘をつくのはやめよう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你们中的一些人需要了解一些市场上限和流通供应量的情况\n币。\n目前的泵是伟大的，我为ADA持有人感到高兴，但该币不会\n但在今年年底之前不会达到5倍。见鬼，甚至到2024年也不会，直到下一次BTC减半的时候\nBTC的一半。\n\n如果我们想要更多的采用，更多的人去...",
      "title": "不，ADA今年将不会达到10美元。不要再对加密货币的新人们撒谎了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你們中的一些人需要了解一些市場上限和流通供應量的情況\n幣。\n目前的泵是偉大的，我爲ADA持有人感到高興，但該幣不會\n但在今年年底之前不會達到5倍。見鬼，甚至到2024年也不會，直到下一次BTC減半的時候\nBTC的一半。\n\n如果我們想要更多的採用，更多的人去...",
      "title": "不，ADA今年將不會達到10美元。不要再對加密貨幣的新人們撒謊了"
    }
  ]
}