{
  "author": "HOWDEHPARDNER",
  "original_created_utc": 1659174561,
  "title": "If almonds and walnuts are, botanically speaking, seeds instead of nuts, why do they still cause a reaction in tree nut allergies?",
  "created_utc": 1659184561,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Or put another way — if my nut allergy includes seeds, then why only certain types of seeds such as almonds and not poppy or sunflower seeds?&lt;/p&gt;\n\n&lt;p&gt;If allergens are similar in almonds, cashews, hazelnuts are they actually more similar than their different botanical catgories/nomenclature suggests?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/askscience/comments/wbttpu/if_almonds_and_walnuts_are_botanically_speaking/",
  "subreddit": "askscience",
  "id": "wbttpu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Or put another way — if my nut allergy includes seeds, then why only certain\ntypes of seeds such as almonds and not poppy or sunflower seeds?\n\nIf allergens are similar in almonds, cashews, hazelnuts are they actually more\nsimilar than their different botanical catgories/nomenclature suggests?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "別の言い方をすれば、もし私のナッツアレルギーが種も含むのであれば、なぜ特定の種だけなのか。\nケシやヒマワリの種ではなく、アーモンドのような特定の種類の種なのでしょうか？\n\nアーモンド、カシューナッツ、ヘーゼルナッツのアレルゲンが類似している場合、それらは植物学上の分類や名称が異なるだけで、実際にはもっと類似しているのでしょうか。\n植物学上の分類や命名法の違いから想像される以上に類似しているのでしょうか？",
      "title": "アーモンドやクルミは植物学的に言えば、ナッツではなく種子なのに、なぜ木の実アレルギーで反応が出るのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "或者换一种说法--如果我的坚果过敏症包括种子，那么为什么只有某些\n种类的种子，如杏仁，而不是罂粟或葵花籽？\n\n如果杏仁、腰果、榛子中的过敏原相似，那么它们是否比它们不同的植物蛋白更相似？\n杏仁、腰果、榛子的过敏原相似，它们是否比它们不同的植物分类/命名法所显示的更为相似？",
      "title": "如果从植物学上讲，杏仁和核桃是种子而不是坚果，为什么它们仍然会引起树坚果过敏的反应？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "或者換一種說法--如果我的堅果過敏症包括種子，那麼爲什麼只有某些\n種類的種子，如杏仁，而不是罌粟或葵花籽？\n\n如果杏仁、腰果、榛子中的過敏原相似，那麼它們是否比它們不同的植物蛋白更相似？\n杏仁、腰果、榛子的過敏原相似，它們是否比它們不同的植物分類/命名法所顯示的更爲相似？",
      "title": "如果從植物學上講，杏仁和核桃是種子而不是堅果，爲什麼它們仍然會引起樹堅果過敏的反應？"
    }
  ]
}