{
  "author": "dig000",
  "the_new_excerpt": "I've always loved Honda cars, and recently took a position in HMC after looking\nover their financials.\n\nWhen you look at their financials, and how that relates to their stock price,\nit's pretty amazing that they aren't trading way higher. I should disclose that\nthis is using the year data ending…",
  "original_created_utc": 1613601034,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我一直都很喜欢本田车，最近在HMC的岗位上，看了\n在他们的财务状况。\n\n当你看到他们的财务数据，以及如何与他们的股价相关。\n这是相当惊人的，他们不交易的方式更高。我应该透露一下\n这是用年底的数据... ...",
      "title": "HMC(本田)被严重忽视，上涨潜力巨大。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直都很喜歡本田車，最近在HMC的崗位上，看了\n在他們的財務狀況。\n\n當你看到他們的財務數據，以及如何與他們的股價相關。\n這是相當驚人的，他們不交易的方式更高。我應該透露一下\n這是用年底的數據... ...",
      "title": "HMC(本田)被嚴重忽視，上漲潛力巨大。"
    }
  ],
  "title": "HMC (Honda) is massively overlooked, with huge upside potential",
  "created_utc": 1613611407,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve always loved Honda cars, and recently took a position in HMC after looking over their financials.</p>\n\n<p>When you look at their financials, and how that relates to their stock price, it&#39;s pretty amazing that they aren&#39;t trading <em>way</em> higher. I should disclose that this is using the year data ending 3/31/20 for HMC (I know, a bit old, but you&#39;ll see why it doesn&#39;t really matter):</p>\n\n<p>Current Market Price: $29.17</p>\n\n<p>Book Value per Share: $43.19</p>\n\n<p>PE Ratio: 5.04</p>\n\n<p>Market Value divided by Book Value: 0.68</p>\n\n<p>2020 Estimated Shipped Cars: 4.5M</p>\n\n<p>Gross Profit: $29.1B</p>\n\n<p>Let&#39;s just stop for a second after those figures. The one metric that is truly astounding is HMC is trading <em>below</em> it&#39;s book value. Honda is one of the largest automotive and motorcycle manufacturers in the world, aside from other products, and yet it trades below its book value. Call me crazy, but even if all it did was reach its book value, you would see a 48% upside. That&#39;s already good enough for me.</p>\n\n<p>Now let&#39;s talk PE ratio. The current S&amp;P500 PE ratio is right around 40, give or take a bit on when you calculate it out. That&#39;s definitely high compared to historical numbers, and there are a whole host of reasons for that that I won&#39;t get into. The average S&amp;P500 PE ratio for the past twenty years is 24.9, and its just above 20.1 for the past ten years. With that in mind, HMC&#39;s PE ratio of 5 is laughably low. Even if it gets to the S&amp;P500 ten year average PE ratio, which wouldn&#39;t even be high by any standard, you&#39;re looking at a 298% increase in share price.</p>\n\n<p>Alright, so we&#39;re already looking at easy upside from those two metrics, let&#39;s slap on another one for good measure - market value/book value. As I mentioned before, you&#39;re looking at a 48% upside if the stock price just gets to it&#39;s book value. Here&#39;s the thing - many stocks these days, including HMC&#39;s competitors trade well above their book value. Toyota, for instance, trades at about a 2.6 market/book ratio. If Honda did that, it&#39;s share price would be $112.65 right now. Honestly, that seems far more reasonable than where it&#39;s at now.</p>\n\n<p>So, even with just those few metrics, it seems clear that Honda is massively undervalued, but it&#39;s fun to compare it to the all-scary monster of a stock, TSLA. Take a look at those same metrics and figures again:</p>\n\n<p>Current Market Price: $29.17 vs TSLA at $798.15</p>\n\n<p>Book Value per Share: $43.19 vs TSLA at $24.04</p>\n\n<p>PE Ratio: 5.04 vs TSLA at 1246.88</p>\n\n<p>Market Value divided by Book Value: 0.68 vs. TSLA at 33.19</p>\n\n<p>2020 Shipped Cars: 4.5M (est) vs. TSLA at 500k</p>\n\n<p>Gross Profit: $29.1B vs. TSLA at $6.6B</p>\n\n<p>That&#39;s right, HMC has a higher book value than TSLA, and not by some measly margin. TSLA&#39;s astounding PE ratio is just outright scary, and that&#39;s the type of information that makes Michael Burry&#39;s short of TSLA not so crazy, even if he does have a price target of $100 (nearly a 90% loss). That doesn&#39;t stop me from having TSLA shares though, which brings me to my next point.</p>\n\n<p>Investor sentiment seems to mean more than anything right now, and HMC has none. It only takes a quick look at trade volume in the last 6 weeks to see that:</p>\n\n<p>TSLA: 925M vs. HMC: 20.2M</p>\n\n<p>My view on sentiment is that it has a lot of power, and sentiment generally sticks for companies that are going places. In my mind it&#39;s partly what drove AMZN and TSLA share prices to such insane levels, and not to mention GME. If you look at the 5-year chart for HMC you don&#39;t see much sentiment at all. HMC is a safe haven, and seemingly forever a stock that you could sell Iron Condors on just picking up cash. That could all change if people start to catch on that HMC is primed and ready to do <em>whatever the f it wants</em> with the $25B it has in cash.</p>\n\n<p>So, here&#39;s where I stand. Getting to $43 (book value) would be a correction. Getting to $108 would make it on par with market and similar to Toyota, which I could also view as a correction. If it catches investor sentiment, well, buckle up.</p>\n\n<p><strong>TL;DR: HMC is massively undervalued by any metric. Upside of at least 50%-300% is more than reasonable, it would be a correction. Comparing it to TSLA is hilarious. Solid financials priming it ready to make moves and catch investor sentiment.</strong></p>\n\n<p>Positions: 150 shares HMC, 4 shares TSLA. Not financial advice, just providing my own personal view to get some feedback.</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/stocks/comments/lm6krs/hmc_honda_is_massively_overlooked_with_huge/",
  "subreddit": "stocks",
  "id": "lm6krs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728625113
}