{
  "author": "CostantlyLost",
  "the_new_excerpt": "Title says it all. Had a few too many drinks of liquid courage and bought 50\nshares of Cresco Labs Equity Warrants (CRLWF) instead of the ordinary shares\n(CRLBF). I used Fidelity to buy the shares resulting in a fee of $100 (bought 30\nand then 20 and didnt notice the $50 fee for each.) So my cost…",
  "original_created_utc": 1616818448,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "标题说明了一切。喝了几杯液体勇气，买了50个\n以Cresco Labs股权证的股份代替普通股。\nCRLBF）。我使用富达购买的股票，导致100美元的费用（买了 30\n然后20个，并没有注意到每一个50美元的费用）。) 所以我的成本...",
      "title": "喝酒和交易是不能混为一谈的 我不小心买了认股权证而不是普通股票。我怎样才能从这个错误中赚钱？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題說明了一切。喝了幾杯液體勇氣，買了50個\n以Cresco Labs股權證的股份代替普通股。\nCRLBF）。我使用富達購買的股票，導致100美元的費用（買了 30\n然後20個，並沒有注意到每一個50美元的費用）。) 所以我的成本...",
      "title": "喝酒和交易是不能混爲一談的 我不小心買了認股權證而不是普通股票。我怎樣才能從這個錯誤中賺錢？"
    }
  ],
  "title": "Drinking and Trading don’t mix. I accidentally bought equity warrants instead of ordinary stock. How do I make money of of this mistake?",
  "created_utc": 1616826564,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Title says it all. Had a few too many drinks of liquid courage and bought 50 shares of Cresco Labs Equity Warrants (CRLWF) instead of the ordinary shares (CRLBF). I used Fidelity to buy the shares resulting in a fee of $100 (bought 30 and then 20 and didnt notice the $50 fee for each.) So my cost basis is around $8 while the listing price for CRLWF is around $6. </p>\n\n<p>If I sell now, I get hit with another $50 transaction fee, plus lose the $100 and some change. The warrants expire in September of 2022. The strike price is around $9.90. </p>\n\n<p>Is there anyway I can come out of this by either breaking even or making a profit? I’m pretty confused about how to exercise warrants, and how people even make money of equity warrants. Any help would be greatly appreciated. </p>\n\n<p>And no need to call me a moron....i’m very well aware if that. Thank you again!</p>\n</div><!-- SC_ON -->",
  "score": 1990,
  "permalink": "/r/stocks/comments/me6ezj/drinking_and_trading_dont_mix_i_accidentally/",
  "subreddit": "stocks",
  "id": "me6ezj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357141533
}