{
  "author": "Yener07",
  "original_created_utc": 1639339272,
  "title": "Why would anyone buy a picture of a monkey drawn by a computer for thousands of dollars?",
  "created_utc": 1639348569,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Feel free to tell me to do my research better but this is what I dont understand about NFTs,obviously there are some great exceptions but my point stands for majority of them.&lt;/p&gt;\n\n&lt;p&gt;There are some really good and low risk coins that they can invest in,where they will have massive profits or at least, dont lose that much money. But instead, people rather buy some computer drawn cartoon monkeys or just simple pixel art for thousands of dollars.&lt;/p&gt;\n\n&lt;p&gt;I get that you technically &amp;quot;own&amp;quot; the picture but why would anyone want to buy it off you?It feels like people just dump all their money on these thinking it will be the next Bitcoin.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/rewygd/why_would_anyone_buy_a_picture_of_a_monkey_drawn/",
  "subreddit": "CryptoCurrency",
  "id": "rewygd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Feel free to tell me to do my research better but this is what I dont understand\nabout NFTs,obviously there are some great exceptions but my point stands for\nmajority of them.\n\nThere are some really good and low risk coins that they can invest in,where they\nwill have massive profits or at least,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もっとよく調べろと言うのは自由だが、これが私には理解できない。\nNFTについては、もちろん素晴らしい例外もありますが、私が言いたいのはそのことです。\nの大半を占めています。\n\n本当に良い、低リスクのコインがいくつかあり、そこに投資することができます。\n莫大な利益を得るか、少なくとも、、、。",
      "title": "コンピュータで描いた猿の絵を、なぜ数千円で買う人がいるのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "请告诉我，让我做更好的研究，但这就是我不明白的地方\n关于NFTs，显然有一些伟大的例外，但我的观点是\n他们中的大多数。\n\n有一些真正好的、低风险的硬币，他们可以投资，在那里他们会有大量的利润，或者至少...\n将会有大量的利润，或者至少，...",
      "title": "为什么有人会以数千美元的价格购买由电脑绘制的猴子图片？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "請告訴我，讓我做更好的研究，但這就是我不明白的地方\n關於NFTs，顯然有一些偉大的例外，但我的觀點是\n他們中的大多數。\n\n有一些真正好的、低風險的硬幣，他們可以投資，在那裏他們會有大量的利潤，或者至少...\n將會有大量的利潤，或者至少，...",
      "title": "爲什麼有人會以數千美元的價格購買由電腦繪製的猴子圖片？"
    }
  ]
}