{
  "author": "Dubs13151",
  "the_new_excerpt": "Leave the politics out of this discussion, we're just talking about the impact\non markets.\n\nThe narrative yesterday was that stocks fell on fears of substantially higher\ncapital gains tax on incomes over $1M annually. Certainly, that makes stocks a\nless attractive investment for high income…",
  "original_created_utc": 1619185962,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "政治的な話は抜きにして、市場への影響について話しています。\n市場への影響についてです。\n\n昨日のシナリオは、株価が大幅に上昇するとの懸念から下落したというものでした。\n年間100万ドル以上の所得に対するキャピタルゲイン税が大幅に引き上げられることを懸念して株が下落したというものです。確かに、高所得者にとっては株は\n確かに高所得者にとっては株は魅力的な投資対象ではありませんが...",
      "title": "キャピタルゲイン税への不安が買い場に"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "抛开政治不谈，我们只是在讨论对市场的影响。\n对市场的影响。\n\n昨天的说法是，由于担心每年收入超过100万美元的人的资本利得税会大幅提高，股票下跌。\n担心年收入超过100万美元的资本利得税会大幅提高。当然，这使股票成为\n对高收入者的投资吸引力降低。",
      "title": "对资本利得税的恐惧带来了购买机会"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "拋開政治不談，我們只是在討論對市場的影響。\n對市場的影響。\n\n昨天的說法是，由於擔心每年收入超過100萬美元的人的資本利得稅會大幅提高，股票下跌。\n擔心年收入超過100萬美元的資本利得稅會大幅提高。當然，這使股票成爲\n對高收入者的投資吸引力降低。",
      "title": "對資本利得稅的恐懼帶來了購買機會"
    }
  ],
  "title": "Fear of capital gains tax presents a buying opportunity",
  "created_utc": 1619201896,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Leave the politics out of this discussion, we&#39;re just talking about the impact on markets.</p>\n\n<p>The narrative yesterday was that stocks fell on fears of substantially higher capital gains tax on incomes over $1M annually. Certainly, that makes stocks a less attractive investment for high income investors because it hurts their risk/return profile. But, if they&#39;re selling stocks to move assets elsewhere, that creates an opportunity for the rest of us, right? </p>\n\n<p>After all, the expected future free cash flows of the underlying businesses haven&#39;t changed, right? So if valuations are unchanged, but prices are lower, that is a buying opportunity. Perhaps one could argue that the lower investment incentive (for high earners) could hurt the economy as a whole? And thus that mechanism is weighing on stocks and actually hurting business valuations? That&#39;s a little different narrative than the one we&#39;re hearing right now though.</p>\n\n<p>I realize a 1% drop is pretty trivial, but if the Biden plan moves forward and looks like it will pass (or does pass), we could see more price movement on the same fears. My theoretical question is, will that present a buying opportunity for everyone who WON&#39;T be subject to the higher capital gains rate?</p>\n</div><!-- SC_ON -->",
  "score": 1217,
  "permalink": "/r/investing/comments/mwvqvk/fear_of_capital_gains_tax_presents_a_buying/",
  "subreddit": "investing",
  "id": "mwvqvk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776214679
}