{
  "author": "HundredAcresWood",
  "original_created_utc": 1636473833,
  "title": "Does LRC have a lot of long term potential?",
  "created_utc": 1636486656,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>People on this sub have been talking about Loopring quite a lot and I decided to buy a couple of days ago. It has since more than tripled in value! I was wondering if LRC is a coin that also has more longterm potentiol to go even higher. I usually hold longterm, but woth the sudden hype for LRC I doubt whether this coin is good for that as well.</p>\n\n<p>What are your plans regarding loopring? Will you hold this coin long term? Or are you more likely to sell anytime soon if this trend continues?Or will you DCA into this coin long term? I&#39;d love to hear you guys&#39; strategies on this!</p>\n</div><!-- SC_ON -->",
  "score": 458,
  "permalink": "/r/CryptoCurrency/comments/qq6umc/does_lrc_have_a_lot_of_long_term_potential/",
  "subreddit": "CryptoCurrency",
  "id": "qq6umc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "People on this sub have been talking about Loopring quite a lot and I decided to\nbuy a couple of days ago. It has since more than tripled in value! I was\nwondering if LRC is a coin that also has more longterm potentiol to go even\nhigher. I usually hold longterm, but woth the sudden hype for LRC I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブの人たちがLoopringのことをよく話していたので、数日前に買うことにしました。\n数日前に購入しました。その後、3倍以上になりました! 私は\nLRCはもっと長期的に高くなる可能性のあるコインではないかと思っています。\nと思っています。私は通常、長期保有をしていますが、LRCが急に騒がれているので...。",
      "title": "LRCは長期的な可能性を秘めていますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个子网站上的人一直在谈论Loopring，我决定在几天前购买。\n几天前决定购买。此后，它的价值增长了两倍多 我在想\n我想知道LRC是否也是一种具有更多长期潜力的硬币，可以涨得更高。\n更高。我通常是长期持有，但由于LRC的突然炒作，我...",
      "title": "LRC是否有很大的长期潜力？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個子網站上的人一直在談論Loopring，我決定在幾天前購買。\n幾天前決定購買。此後，它的價值增長了兩倍多 我在想\n我想知道LRC是否也是一種具有更多長期潛力的硬幣，可以漲得更高。\n更高。我通常是長期持有，但由於LRC的突然炒作，我...",
      "title": "LRC是否有很大的長期潛力？"
    }
  ]
}