{
  "author": "fatuglyandgross",
  "original_created_utc": 1629349788,
  "title": "How was ”the future” depicted in science-fiction books, before the 1800s?",
  "created_utc": 1629384341,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For example, in 1950s/1960s fiction, when portraying what human life in “the future” looked like, people often wear tinfoil clothes and have robot servants or flying cars, etc.</p>\n\n<p>In more recent times, we have VR and other tech seen in i.e. Avatar (2009).</p>\n\n<p>These ideas are of course possible because knowledge of the technology developed thus far and estimations of what it could lead to.</p>\n\n<p>But before electricity, cars, airplanes, computers, Internet – back in the Middle Ages or earlier – how was the future depicted in fiction (books) that were set ahead of those times? How were people transported? How did they live (housing)? What were they wearing and eating? What did they look like? (Just to give a few examples of the aspects I’m asking about.)</p>\n\n<p>Edit: A now deleted comment pointed out that I use the term ”science-fiction” wrongly, because it is a fairly modern concept. Instead, it would be called ”fantasy” books. Besides from this correction, my questions about how life in the future was portrayed in those books remain.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/p78ess/how_was_the_future_depicted_in_sciencefiction/",
  "subreddit": "AskHistorians",
  "id": "p78ess",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For example, in 1950s/1960s fiction, when portraying what human life in “the\nfuture” looked like, people often wear tinfoil clothes and have robot servants\nor flying cars, etc.\n\nIn more recent times, we have VR and other tech seen in i.e. Avatar (2009).\n\nThese ideas are of course possible because…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、1950年代/1960年代の小説では、「the」の人間の生活を描く際には\n未来」の人間の生活を描く際には、アルミホイルの服を着たり、ロボットの召使や空飛ぶ車を持っていたりします。\n空飛ぶ車などが登場します。\n\n最近では、『アバター』（2009年）に見られるようなVRやその他の技術があります。\n\nこれらのアイデアが可能なのは、もちろん...",
      "title": "1800年代以前のSF作品では、「未来」はどのように描かれていたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "例如，在20世纪50年代/60年代的小说中，在描述人类在 \"未来 \"的生活时\n未来 \"的样子时，人们经常穿着锡纸衣服，拥有机器人仆人或飞行汽车等。\n或飞行汽车，等等。\n\n在更近的时代，我们有VR和其他技术，在即阿凡达（2009年）中看到。\n\n这些想法当然是可能的，因为...",
      "title": "在19世纪之前，科幻书中是如何描述 \"未来 \"的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "例如，在20世紀50年代/60年代的小說中，在描述人類在 \"未來 \"的生活時\n未來 \"的樣子時，人們經常穿着錫紙衣服，擁有機器人僕人或飛行汽車等。\n或飛行汽車，等等。\n\n在更近的時代，我們有VR和其他技術，在即阿凡達（2009年）中看到。\n\n這些想法當然是可能的，因爲...",
      "title": "在19世紀之前，科幻書中是如何描述 \"未來 \"的？"
    }
  ]
}