{
  "author": "JustDownInTheMines",
  "original_created_utc": 1631811823,
  "title": "ALGO: 2 Weeks Before Governance Hits - Make Sure To Stake On A Wallet, Off Of Exchanges!",
  "created_utc": 1631878234,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>On October 1st, Algorand will deploy its governance system. Participants will earn extra ALGO staking rewards guesstimated to be between 7-33% depending on users (we will not know until it&#39;s live).</p>\n\n<p>If you&#39;re not familiar and are a long term hodler of ALGO, make sure your coins are in a real wallet. You can use the official wallet or any wallet not associated with an exchange. If you stake your ALGO on Coinbase, which many here do, you will most likely not be eligible. Use the official mobile wallet (one of the simplest wallets I&#39;ve ever setup) or any ALGO wallet such as Ledger or MyALGO.</p>\n\n<p>You will have to lock your coins in for 3 months and participate in all of the governance polls in order to receive the extra rewards. If you&#39;re a long time hodler and not planning on selling for years, it&#39;s definitely worth it.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/pphe20/algo_2_weeks_before_governance_hits_make_sure_to/",
  "subreddit": "CryptoCurrency",
  "id": "pphe20",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "On October 1st, Algorand will deploy its governance system. Participants will\nearn extra ALGO staking rewards guesstimated to be between 7-33% depending on\nusers (we will not know until it's live).\n\nIf you're not familiar and are a long term hodler of ALGO, make sure your coins\nare in a real wallet.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "10月1日、アルゴランドはそのガバナンスシステムを展開します。参加者は\n参加者は、ユーザーに応じて7～33％と推定される余分なALGOステークスの報酬を得ることができます。\nユーザーによって異なります。\n\nもしあなたがALGOに慣れておらず、長期的なホドラーであるならば、あなたのコインが本物のウォレットにあることを確認してください。\nを本物の財布に入れてください。....",
      "title": "ALGO: ガバナンス発動の2週間前に、取引所ではなくウォレットでステークすることをお勧めします。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "10月1日，Algorand将部署其治理系统。参与者将\n赚取额外的ALGO赌注奖励，估计在7-33%之间，具体取决于\n用户（我们在上线之前不会知道）。\n\n如果你不熟悉，并且是ALGO的长期持有者，请确保你的钱币\n在一个真正的钱包里....",
      "title": "ALGO: 治理前2周--确保在钱包上入股，而不是在交易所入股!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "10月1日，Algorand將部署其治理系統。參與者將\n賺取額外的ALGO賭注獎勵，估計在7-33%之間，具體取決於\n用戶（我們在上線之前不會知道）。\n\n如果你不熟悉，並且是ALGO的長期持有者，請確保你的錢幣\n在一個真正的錢包裏....",
      "title": "ALGO: 治理前2周--確保在錢包上入股，而不是在交易所入股!"
    }
  ]
}