{
  "author": "Ok_Analysis_1304",
  "the_new_excerpt": "While on the surface it is easy to assume privacy coins like Monero are most\nuseful for people who do unlawful things, that is is only one very basic way of\nlooking at it.\n\nCompletely innocent \"squeaky clean\" people who use cryptos with transparent\nblockchains have often have no control or knowledge…",
  "original_created_utc": 1615677289,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "虽然从表面上看，人们很容易认为像Monero这样的隐私币是最\n对做违法事情的人有用，这只是一个很基本的方法。\n看着它。\n\n完全是无辜的 \"清白 \"的人，他们使用的密码器是透明的。\n区块链往往没有控制权或知识... ...",
      "title": "无辜、守法的人是最需要Monero（XMR）的人。而不是罪犯。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "雖然從表面上看，人們很容易認爲像Monero這樣的隱私幣是最\n對做違法事情的人有用，這只是一個很基本的方法。\n看着它。\n\n完全是無辜的 \"清白 \"的人，他們使用的密碼器是透明的。\n區塊鏈往往沒有控制權或知識... ...",
      "title": "無辜、守法的人是最需要Monero（XMR）的人。而不是罪犯。"
    }
  ],
  "title": "Innocent, law abiding people are the ones who need Monero (XMR) the most. Not criminals.",
  "created_utc": 1615696915,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>While on the surface it is easy to assume privacy coins like Monero are most useful for people who do unlawful things, that is is only one very basic way of looking at it.</p>\n\n<p>Completely innocent &quot;squeaky clean&quot; people who use cryptos with transparent blockchains have often have no control or knowledge of exactly who they are transacting with. They can easily trade or receive coins that are connected to &quot;shady&quot; people or deals. Any innocent people caught up in this may be forced to fight to prove and maintain their clean reputation. Why risk having to go through that? </p>\n\n<p>Using completely fungible privacy coins like Monero ensures that no matter who you transact with, you can not be &quot;guilty by association&quot;. You can transact fairly without ever unknowingly putting your reputation on the line. This feature protects innocent people and brings great value to the crypto space.</p>\n</div><!-- SC_ON -->",
  "score": 509,
  "permalink": "/r/CryptoCurrency/comments/m4i2pc/innocent_law_abiding_people_are_the_ones_who_need/",
  "subreddit": "CryptoCurrency",
  "id": "m4i2pc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147377075
}