{
  "author": "WitnessAppropriate",
  "original_created_utc": 1635892640,
  "title": "What is your goal with investing in crypto?",
  "created_utc": 1635906860,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know we all want to be picking Lamborghini colors in like a year, personally I’m prone to picking the orange one. But whats your realistic goal with investing in crypto?\nMy plan is to leave my country in 3,5 years (when I finish my PhD). I’m sick of having such a poor quality of life in a third world country, and to be honest I think I deserve more. For that to become reality, I need a lot of money and that’s why I’m investing in crypto. Hope that in 3,5 years I can tell yall I made it, but I’m interested in your reasons too.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/qlg6ho/what_is_your_goal_with_investing_in_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qlg6ho",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know we all want to be picking Lamborghini colors in like a year, personally\nI’m prone to picking the orange one. But whats your realistic goal with\ninvesting in crypto? My plan is to leave my country in 3,5 years (when I finish\nmy PhD). I’m sick of having such a poor quality of life in a third…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "みんな1年後くらいにはランボルギーニの色を選びたいと思っていると思いますが、個人的には\n私はオレンジを選ぶことが多いです。しかし、暗号投資の現実的な目標は何ですか？\n現実的な目標は何ですか？私の計画は、3,5年後（博士号を取得したとき）に国を離れることです。\n私の計画は、3,5年後（博士号を取得したとき）に国を離れることです。) 第三国での貧しい生活にうんざりしています。",
      "title": "暗号に投資する目的は何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道我们都想在一年内挑选兰博基尼的颜色，个人认为\n我倾向于选择橙色的。但你的现实目标是什么呢？\n投资加密货币的现实目标是什么？我的计划是在3.5年内离开我的国家（当我完成\n我的博士学位）。) 我已经厌倦了在第三世界国家过着如此糟糕的生活...",
      "title": "你投资加密货币的目的是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道我們都想在一年內挑選蘭博基尼的顏色，個人認爲\n我傾向於選擇橙色的。但你的現實目標是什麼呢？\n投資加密貨幣的現實目標是什麼？我的計劃是在3.5年內離開我的國家（當我完成\n我的博士學位）。) 我已經厭倦了在第三世界國家過着如此糟糕的生活...",
      "title": "你投資加密貨幣的目的是什麼？"
    }
  ]
}