{
  "author": "HiddenknifeX",
  "original_created_utc": 1643634342,
  "title": "99% of the crypto market has 0 real life utility. Change my mind.",
  "created_utc": 1643646860,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Other than a speculative asset with a glorious whitepaper and an impressive &amp;quot;ex workers&amp;quot; of big name companies all around the world, they all promise the Moon but underdeliver. I have yet to see something that has an actual use in realife that is using any of those tokens/coins technology. &lt;/p&gt;\n\n&lt;p&gt;I understand that there are companies looking into metaverse, NFTs or accepting Bitcoin as legal tender, but those are very niche and far\nfrom mass adoption.&lt;/p&gt;\n\n&lt;p&gt;Honestly talking the only projects i&amp;#39;ve seen of use are cost cutting protocols such as MATIC &amp;amp; LRC for transactions, and Brave Browser (BAT) which i actually find it awesome to use.&lt;/p&gt;\n\n&lt;p&gt;Do you have other opinion? Are we throwing money into the void?&lt;/p&gt;\n\n&lt;p&gt;Are we any different from gambling our money if the rate of uselessness is so high?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 390,
  "permalink": "/r/CryptoCurrency/comments/sh0tgg/99_of_the_crypto_market_has_0_real_life_utility/",
  "subreddit": "CryptoCurrency",
  "id": "sh0tgg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Other than a speculative asset with a glorious whitepaper and an impressive \"ex\nworkers\" of big name companies all around the world, they all promise the Moon\nbut underdeliver. I have yet to see something that has an actual use in realife\nthat is using any of those tokens/coins technology.\n\nI…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "華やかなホワイトペーパーと印象的な \"元 \"を持つ投機的な資産以外には。\n世界中の有名企業の社員が集まっているのですが、どれも月を約束するようなもので\nしかし、その成果は不十分でした。私はまだ現実で実際に使えるものを見たことがありません\nこれらのトークンやコインの技術を使用しています。\n\nI...",
      "title": "暗号市場の99%は実生活での実用性はゼロです。考えを改めましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "除了拥有辉煌的白皮书和令人印象深刻的 \"前雇员 \"的投机性资产之外。\n劳动者\"，他们都承诺了月球，但没有兑现。\n但交付不足。我还没有看到在现实生活中有实际用途的东西。\n使用任何这些代币/硬币技术。\n\nI...",
      "title": "99%的加密货币市场在现实生活中的效用为零。改变我的想法。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "除了擁有輝煌的白皮書和令人印象深刻的 \"前僱員 \"的投機性資產之外。\n勞動者\"，他們都承諾了月球，但沒有兌現。\n但交付不足。我還沒有看到在現實生活中有實際用途的東西。\n使用任何這些代幣/硬幣技術。\n\nI...",
      "title": "99%的加密貨幣市場在現實生活中的效用爲零。改變我的想法。"
    }
  ]
}