{
  "author": "ineedadviceplss1215",
  "original_created_utc": 1644769793,
  "title": "Do you think it's rude to go to a date (eating out in a restaurant) full?",
  "created_utc": 1644781128,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, basically I had this date set up to eat a nice dinner out. The other person came already &amp;quot;full&amp;quot; and was basically not hungry anymore. They didn&amp;#39;t eat anything, so I was the only one eating at the table. It was also me inviting them so I would&amp;#39;ve paid for everything, money can&amp;#39;t be an issue. I felt kinda awkward. I was wondering if I&amp;#39;m the only person who thinks this is incredibly rude behavior??&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/NoStupidQuestions/comments/srmioe/do_you_think_its_rude_to_go_to_a_date_eating_out/",
  "subreddit": "NoStupidQuestions",
  "id": "srmioe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So, basically I had this date set up to eat a nice dinner out. The other person\ncame already \"full\" and was basically not hungry anymore. They didn't eat\nanything, so I was the only one eating at the table. It was also me inviting\nthem so I would've paid for everything, money can't be an issue. I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "で、基本的には外食で美味しいものを食べようと思って設定したデートだったんです。相手は\nはすでに満腹で、基本的にもうお腹が空いていない状態でした。彼らは何も食べず\n何も食べないので、テーブルで食べているのは私一人。それも私が誘ったんです。\nお金に糸目はつけない。I...",
      "title": "デート（レストランでの食事）に満腹で行くのは失礼にあたると思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，基本上我安排了这个约会，在外面吃一顿好的晚餐。另一个人\n来的时候已经 \"吃饱 \"了，基本上不饿了。他们没有吃\n所以我是唯一一个在餐桌上吃饭的人。这也是我邀请的\n所以我为他们付了所有的钱，钱不能成为问题。I...",
      "title": "你认为饱餐一顿去约会（在餐厅吃饭）是不礼貌的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，基本上我安排了這個約會，在外面喫一頓好的晚餐。另一個人\n來的時候已經 \"喫飽 \"了，基本上不餓了。他們沒有喫\n所以我是唯一一個在餐桌上喫飯的人。這也是我邀請的\n所以我爲他們付了所有的錢，錢不能成爲問題。I...",
      "title": "你認爲飽餐一頓去約會（在餐廳喫飯）是不禮貌的嗎？"
    }
  ]
}