{
  "author": "Mental-Ad-8756",
  "original_created_utc": 1640887393,
  "title": "Why can’t people question their religion?",
  "created_utc": 1640911648,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don’t even mean as in questioning if they believe in it. I mean questioning it like “why doesn’t the Bible talk about Jesus as a kid?” or “Could anything of been lost in translation?” &lt;/p&gt;\n\n&lt;p&gt;Why does it make other followers so angry? Wondering about things shouldn’t be seen as “oh they’re a non believer” or anything wrong. Why is it so hard to then answer those kinds of questions? Why don’t religious practices include discourse about the religion itself? It would be more interesting and engaging to actually interpret the religious texts in different ways. Doesn’t have to mean that we doubt anything, we’re just trying to understand. There’s a lot of plot holes and such, especially when comparing and contrasting multiple religions.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/rs7xfb/why_cant_people_question_their_religion/",
  "subreddit": "TooAfraidToAsk",
  "id": "rs7xfb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don’t even mean as in questioning if they believe in it. I mean questioning it\nlike “why doesn’t the Bible talk about Jesus as a kid?” or “Could anything of\nbeen lost in translation?”\n\nWhy does it make other followers so angry? Wondering about things shouldn’t be\nseen as “oh they’re a non…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "信じているかどうかを問うという意味でもない。疑問視しているという意味です\nなぜ聖書には子供の頃のイエスのことが書かれていないのか」、「何かあるのでは？\n翻訳で失われたのか？\n\nなんで他の信者が怒るんだ？不思議に思うことは\nを、「ああ、彼らは非・・・」と見なす。",
      "title": "なぜ人は自分の宗教を疑ってはいけないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的意思甚至不是质疑他们是否相信它。我的意思是质疑它\n比如 \"为什么圣经中没有提到耶稣是个孩子？\"或者 \"会不会有什么东西\n在翻译中丢失了什么？\"\n\n为什么这让其他追随者如此愤怒？对事物的疑问不应该被视为\n被看作是 \"哦，他们是一个非...",
      "title": "为什么人们不能质疑他们的宗教？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的意思甚至不是質疑他們是否相信它。我的意思是質疑它\n比如 \"爲什麼聖經中沒有提到耶穌是個孩子？\"或者 \"會不會有什麼東西\n在翻譯中丟失了什麼？\"\n\n爲什麼這讓其他追隨者如此憤怒？對事物的疑問不應該被視爲\n被看作是 \"哦，他們是一個非...",
      "title": "爲什麼人們不能質疑他們的宗教？"
    }
  ]
}