{
  "author": "wontonforevuh",
  "the_new_excerpt": "This mantra is often used in stock news and events and that holds true for\ncrypto. Everyone bought doge thinking about Elon was going to talk about it on\nSNL and create another pump. Well he did talk about it, but doge dumped instead.\n\nWhy? Because the Elon being on SNL is priced in. It really…",
  "original_created_utc": 1620535239,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この言葉は、株式のニュースやイベントでよく使われますが、それは以下にも当てはまります。\nにも当てはまる。みんな、イーロンがSNLでこの話をすると思ってdogeを買った。\nエロンがSNLで話して、また新たなポンプを作るのではないかと思って、みんなdogeを買いました。実際、彼はその話をしましたが、dogeは代わりに暴落しました。\n\nなぜか？イーロンがSNLに出演することが織り込み済みだったからです。それは本当に...",
      "title": "Buy the Rumor, Sell the News（噂を買い、ニュースを売る"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这句话经常被用于股票新闻和事件中，这句话对\n隐性货币也是如此。每个人都买了Doge，以为Elon会在SNL上谈论它，并创造了另一个泵。\nSNL并创造另一个泵。他确实谈到了这一点，但Doge反而抛售了。\n\n为什么？因为埃隆上SNL的事是有价的。它真的...",
      "title": "买谣言，卖新闻"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這句話經常被用於股票新聞和事件中，這句話對\n隱性貨幣也是如此。每個人都買了Doge，以爲Elon會在SNL上談論它，並創造了另一個泵。\nSNL並創造另一個泵。他確實談到了這一點，但Doge反而拋售了。\n\n爲什麼？因爲埃隆上SNL的事是有價的。它真的...",
      "title": "買謠言，賣新聞"
    }
  ],
  "title": "Buy the Rumor, Sell the News",
  "created_utc": 1620560188,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This mantra is often used in stock news and events and that holds true for crypto. Everyone bought doge thinking about Elon was going to talk about it on SNL and create another pump. Well he did talk about it, but doge dumped instead. </p>\n\n<p>Why? Because the Elon being on SNL is priced in. It really doesn&#39;t matter what positives he says about doge because it was already expected. </p>\n\n<p>Now I might be talking prematurely and doge could continue going back up since the show isn&#39;t over yet but it doesn&#39;t seem like there&#39;s much momentum anymore.</p>\n\n<p>So anyways, the lessons is, if you think something is a sure thing, everyone else might be thinking the same thing. You need to stay one step ahead of the crowd. Buy the rumor, sell the news.</p>\n</div><!-- SC_ON -->",
  "score": 417,
  "permalink": "/r/CryptoCurrency/comments/n86of9/buy_the_rumor_sell_the_news/",
  "subreddit": "CryptoCurrency",
  "id": "n86of9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985990906
}