{
  "author": "Aiken_Drumn",
  "the_new_excerpt": "Hedge fund shills are spreading disinformation saying $800 is make-or-break for\n$GME. Call options expiring ITM on Friday will drive the price up if levels are\nmaintained, but may not trigger the short squeeze.\n\nIt may be Friday, but it could be next week the we see the real squeeze.\n\nDON'T PANIC IF…",
  "original_created_utc": 1614278075,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "对冲基金大佬散布虚假信息，称800美元对他们来说是生死攸关的。\n$GME。周五ITM到期的看涨期权将推动价格上涨，如果水平是\n维持，但可能不会触发空头挤压。\n\n这可能是周五，但它可能是下周，我们看到真正的挤压。\n\n不要惊慌，如果...",
      "title": "短线股没有到期日。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對沖基金大佬散佈虛假信息，稱800美元對他們來說是生死攸關的。\n$GME。週五ITM到期的看漲期權將推動價格上漲，如果水平是\n維持，但可能不會觸發空頭擠壓。\n\n這可能是週五，但它可能是下週，我們看到真正的擠壓。\n\n不要驚慌，如果...",
      "title": "短線股沒有到期日。"
    }
  ],
  "title": "SHORT STOCK DOESN'T HAVE AN EXPIRATION DATE",
  "created_utc": 1614347244,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hedge fund shills are spreading disinformation saying $800 is make-or-break for $GME. Call options expiring ITM on Friday will drive the price up if levels are maintained, but may not trigger the short squeeze.</p>\n\n<p>It may be Friday, but it could be next week the we see the real squeeze.</p>\n\n<p>DON&#39;T PANIC IF THE SQUEEZE DOESN&#39;T HAPPEN.</p>\n\n<p>It&#39;s not guaranteed to. The only thing that is guaranteed mathematically is that the shorts will have to cover at some point in the future. They are trying to get enough people hooked on the false expectation of Friday so that if/when it doesn&#39;t happen, enough will sell out of panic/despair. IMAGINE IF YOU HAD SOLD EARLIER THIS WEEK AT $40!</p>\n\n<p>WE CAN STAY RETARDED, LONGER THAN YOU CAN STAY SOLVENT!!</p>\n</div><!-- SC_ON -->",
  "score": 13309,
  "permalink": "/r/wallstreetbets/comments/lsdehv/short_stock_doesnt_have_an_expiration_date/",
  "subreddit": "wallstreetbets",
  "id": "lsdehv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937748162
}