{
  "author": "tiger_stripe",
  "the_new_excerpt": "Sorry for the dumb question. I am still very new to stocks and company stocks.\nThis is my first job that offers stocks. I feel like this is too good to be true\nif the company's goals do go through.\n\nI am hired at a startup company which is planning go public within 2 years. They\noffered 7000 ISO at…",
  "original_created_utc": 1623089998,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "くだらない質問ですみません。私はまだ株や自社株については初心者です。\n株を扱う仕事はこれが初めてです。もし会社の目標が達成されたら\nもし会社の目標が達成されるなら、これはあまりにも素晴らしいことだと思います。\n\n私が採用されたのは、2年以内に株式公開を予定している新興企業です。彼らは\nISO7000を提供してくれました...",
      "title": "起業した求人株で実際に100万円稼げるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对不起，我的问题很愚蠢。我对股票和公司股票仍然非常陌生。\n这是我第一份提供股票的工作。我觉得这太好了，不可能是真的\n如果公司的目标真的实现了。\n\n我受雇于一家初创公司，该公司计划在两年内上市。他们\n他们提供了7000个ISO值。",
      "title": "我真的能从我的创业工作股票中赚到一百万吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對不起，我的問題很愚蠢。我對股票和公司股票仍然非常陌生。\n這是我第一份提供股票的工作。我覺得這太好了，不可能是真的\n如果公司的目標真的實現了。\n\n我受僱於一家初創公司，該公司計劃在兩年內上市。他們\n他們提供了7000個ISO值。",
      "title": "我真的能從我的創業工作股票中賺到一百萬嗎？"
    }
  ],
  "title": "Can I actually make a million from my start up job stocks?",
  "created_utc": 1623116987,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sorry for the dumb question. I am still very new to stocks and company stocks. This is my first job that offers stocks. I feel like this is too good to be true if the company&#39;s goals do go through.</p>\n\n<p>I am hired at a startup company which is planning go public within 2 years. They offered 7000 ISO at $3.50. Within 3 years I&#39;ll have vested all 7000 (I understand I can&#39;t buy all of them if I quit early). My question is, assuming they do reach their goal of $200+ per share after going public in 5 years, does that mean I can sell my 7000 and make 1.4 million? Or is there a catch I am missing? I can&#39;t help but think for people working 8 years at Zoom for example can sell their shares and be very rich now. It just feels too good to be true.</p>\n\n<p>PS. I know most startups fail and I shouldn&#39;t have my hopes up. But I am asking hypothetically if it does succeed.</p>\n</div><!-- SC_ON -->",
  "score": 65,
  "permalink": "/r/stocks/comments/nujhbk/can_i_actually_make_a_million_from_my_start_up/",
  "subreddit": "stocks",
  "id": "nujhbk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404888028
}