{
  "author": "krisycoll",
  "original_created_utc": 1629653581,
  "title": "There will be no successor to Bitcoin like there will be no successor to Wikipedia.",
  "created_utc": 1629686408,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have been thinking about the relationship between Bitcoin and altcoins, and how people (including me) have a hard time convincing themselves that there is only one Bitcoin and there will never be a Bitcoin 2, and no altcoin will ever be able to surpass Bitcoin in terms of its fundamental properties (mainly decentralisation, scarcity and security).</p>\n\n<p>Bitcoin is like wikipedia. Wikipedia is the only one that is authentic and indisputable. </p>\n\n<p>Then there are many different wikis... you have the Pokemon wiki, the Starcraft wiki, travel wikis, and even a wiki about bitcoin. These Wikis, as you might have guessed, are the Altcoins. They fulfil a particular function, they satisfy specific needs that are not relevant from an encyclopaedic point of view (knowing all the items in a video game, the places to visit in Thailand or any technical knowledge). These altcoins do not have a monetary function as powerful as bitcoin, just as wikis are not as encyclopaedic as Wikipedia. </p>\n\n<p>Wikipedia&#39;s hegemony as a repository of online knowledge is undeniable, being (in a sense) a consensus-based p2p network. No private company hiring top experts from all over the world can make a better encyclopaedia than Wikipedia. They have not been able to overcome the ability of millions of people around the world to selflessly contribute information.  </p>\n\n<p>Moreover, if they succeeded, the content of this new encyclopaedia could become part of Wikipedia&#39;s content if it really adds value to what has already been written. </p>\n\n<p>Nobody believes that Wikipedia will disappear because of a better successor, as it is able to change and adapt. Just like Bitcoin.</p>\n\n<p>That&#39;s the way I see it.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/Bitcoin/comments/p9gtww/there_will_be_no_successor_to_bitcoin_like_there/",
  "subreddit": "Bitcoin",
  "id": "p9gtww",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have been thinking about the relationship between Bitcoin and altcoins, and\nhow people (including me) have a hard time convincing themselves that there is\nonly one Bitcoin and there will never be a Bitcoin 2, and no altcoin will ever\nbe able to surpass Bitcoin in terms of its fundamental…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインとアルトコインの関係について考えてみました、と\n私も含めて、人々は、ビットコインとアルトコインは1つしかないと自分を納得させるのに苦労しています。\nビットコインは1つだけで、ビットコイン2は存在しないし、アルトコインは基本的にビットコインを超えることはできない。\nそして、どのアルトコインも基本的にはビットコインを超えることはできないだろうと。",
      "title": "ウィキペディアの後継者がいないように、ビットコインの後継者もいないでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在思考比特币和另类币之间的关系，以及人们（包括我）如何难以说服自己相信比特币和另类币的关系。\n人们（包括我）很难说服自己，只有一个比特币，永远不会有第二个比特币，也不会有任何一个替代币。\n只有一个比特币，永远不会有比特币2，而且没有任何一个替代币能够在其基本面上超越比特币。\n能够超越比特币的根本......",
      "title": "不会有比特币的继承者，就像不会有维基百科的继承者一样。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在思考比特幣和另類幣之間的關係，以及人們（包括我）如何難以說服自己相信比特幣和另類幣的關係。\n人們（包括我）很難說服自己，只有一個比特幣，永遠不會有第二個比特幣，也不會有任何一個替代幣。\n只有一個比特幣，永遠不會有比特幣2，而且沒有任何一個替代幣能夠在其基本面上超越比特幣。\n能夠超越比特幣的根本......",
      "title": "不會有比特幣的繼承者，就像不會有維基百科的繼承者一樣。"
    }
  ]
}