{
  "author": "ColonelHerro",
  "original_created_utc": 1644221762,
  "title": "I've heard the poet Sappho was supposedly married to Kerkylas of Andros, but that this would translate to \"Dick Allcocks of Man Island\" - how much truth is there to this?",
  "created_utc": 1644242700,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is something I&amp;#39;ve seen on a couple of social media posts, saying that &amp;quot;historians think his name is a joke&amp;quot;, given its translation and Sappho essentially bring the origin of the term &amp;#39;lesbian&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;How accurate is this translation, and is there any evidence (beyond an absurd name) that this was a joke?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 115,
  "permalink": "/r/AskHistorians/comments/sml3ru/ive_heard_the_poet_sappho_was_supposedly_married/",
  "subreddit": "AskHistorians",
  "id": "sml3ru",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This is something I've seen on a couple of social media posts, saying that\n\"historians think his name is a joke\", given its translation and Sappho\nessentially bring the origin of the term 'lesbian'.\n\nHow accurate is this translation, and is there any evidence (beyond an absurd\nname) that this was a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、いくつかのSNSの投稿で見かけたもので、次のように言っています。\n「歴史家は彼の名前を冗談だと考えている」、その翻訳とサッフォーから考えると\nレズビアンの語源はここにある。\n\nこの翻訳がどの程度正確なのか、また、（不条理である以上に）何か証拠があるのでしょうか。\nという名前）であったことがわかりました。",
      "title": "詩人サッフォーはアンドロス島のケルキュラスと結婚したことになっているが、これを訳すと「マン島のディック・オールコックス」になると聞いたことがあるが、どこまで本当だろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是我在几个社交媒体的帖子上看到的，说是\n\"历史学家认为他的名字是一个笑话\"，鉴于其翻译和萨福\n基本上带来了'女同性恋'这个词的起源。\n\n这个翻译有多准确，是否有任何证据（除了一个荒谬的\n荒谬的名字之外），这是一个...",
      "title": "我听说诗人萨福据说嫁给了安德罗斯的凯基拉斯，但这可以翻译成 \"曼岛的迪克-阿尔科克斯\"--这有多少真实性？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是我在幾個社交媒體的帖子上看到的，說是\n\"歷史學家認爲他的名字是一個笑話\"，鑑於其翻譯和薩福\n基本上帶來了'女同性戀'這個詞的起源。\n\n這個翻譯有多準確，是否有任何證據（除了一個荒謬的\n荒謬的名字之外），這是一個...",
      "title": "我聽說詩人薩福據說嫁給了安德羅斯的凱基拉斯，但這可以翻譯成 \"曼島的迪克-阿爾科克斯\"--這有多少真實性？"
    }
  ]
}