{
  "author": "Rygot",
  "the_new_excerpt": "Hey folks.\n\nWith talks of looming inflation, and the rotation into value,\ninflation-protected, and \"reopening\" oriented stocks, I figure more than a few\npeople are looking to adjust their portfolios a bit, and may have some similar\nquestions.\n\nSomething I had not heavily considered before now are…",
  "original_created_utc": 1620182278,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n迫り来るインフレの話を受けて、バリュー、インフレ対策、「再開」志向の株への転換が進んでいます。\nバリュー株、インフレ防止株、「再開」志向の株への転換が進む中、少なからぬ人がポートフォリオの調整を考えていると思います。\n多くの人が自分のポートフォリオを少し調整しようとしていて、同じような疑問を持っていると思います。\n疑問を持っているかもしれません。\n\n今まであまり考えたことがなかったのは、...",
      "title": "コモディティ - 先物か生産者か？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，伙计们。\n\n随着通货膨胀迫在眉睫的讨论，以及对价值的轮换。\n通货膨胀保值和 \"重新开放 \"导向的股票，我想有更多的人正在寻求调整他们的投资组合。\n人正在寻找调整他们的投资组合，并可能有一些类似的\n问题。\n\n在这之前，我没有认真考虑过的问题是...",
      "title": "商品--期货还是生产者？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，夥計們。\n\n隨着通貨膨脹迫在眉睫的討論，以及對價值的輪換。\n通貨膨脹保值和 \"重新開放 \"導向的股票，我想有更多的人正在尋求調整他們的投資組合。\n人正在尋找調整他們的投資組合，並可能有一些類似的\n問題。\n\n在這之前，我沒有認真考慮過的問題是...",
      "title": "商品--期貨還是生產者？"
    }
  ],
  "title": "Commodities - Futures or Producers?",
  "created_utc": 1620215808,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey folks.</p>\n\n<p>With talks of looming inflation, and the rotation into value, inflation-protected, and &quot;reopening&quot; oriented stocks, I figure more than a few people are looking to adjust their portfolios a bit, and may have some similar questions.</p>\n\n<p>Something I had not heavily considered before now are the advantages of futures compared to equity in the producers of a commodity. Say ETNs / ETVs like JJC or CPER vs. an ETF like COPX.</p>\n\n<p>I&#39;m curious what advantages there are behind going either route, or for some insight behind why one might pick one over the other in the current economic landscape.</p>\n</div><!-- SC_ON -->",
  "score": 75,
  "permalink": "/r/investing/comments/n55982/commodities_futures_or_producers/",
  "subreddit": "investing",
  "id": "n55982",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380966989
}