{
  "author": "ipetgoat1984",
  "original_created_utc": 1646570637,
  "title": "If you got into crypto in the fall of 2021: how are you doing?",
  "created_utc": 1646614495,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;How is your mental state through all of this? I think about you guys. Getting into crypto during the euphoria of last Oct and Nov and then going through a pretty deep fire sale, bear, crash, whatever, it&amp;#39;s going to give you a real thick skin, especially if you&amp;#39;re young and new to investing in general or if you&amp;#39;re overleveraged. &lt;/p&gt;\n\n&lt;p&gt;I imagine it can be pretty daunting and disconcerting with all the FUD, rug-pulls, scams, and pump-and-dumps. But, don&amp;#39;t let that shit get to you, it&amp;#39;s just part of the crypto journey, and every failure is a lesson, albeit a sometimes painful and expensive one. &lt;/p&gt;\n\n&lt;p&gt;You can look at the bright side, though; you&amp;#39;re getting your first bear market out of the way. The next one will be a walk in the park for you. (they always suck, but they do get easier, and you learn how to make them work for you)&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re new to the space: what&amp;#39;s one lesson you&amp;#39;ve learned?&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re a seasoned veteran: what&amp;#39;s one bit of advice you can offer?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 322,
  "permalink": "/r/CryptoCurrency/comments/t7y015/if_you_got_into_crypto_in_the_fall_of_2021_how/",
  "subreddit": "CryptoCurrency",
  "id": "t7y015",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "How is your mental state through all of this? I think about you guys. Getting\ninto crypto during the euphoria of last Oct and Nov and then going through a\npretty deep fire sale, bear, crash, whatever, it's going to give you a real\nthick skin, especially if you're young and new to investing in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "その中で、精神状態はいかがでしょうか？皆さんのことを考えています。皆さんは\n昨年10月から11月にかけての幸福感の中で暗号に参入し、その後\nかなり深刻なファイヤーセール、ベア、クラッシュ、何であれ、それはあなたに本当の\n特に若くて投資初心者の場合、皮が厚い...",
      "title": "2021年秋に暗号に手を出した人：どうしてる？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "通过这一切，你的精神状态如何？我想到了你们。在去年10月和11月的兴奋期进入\n在去年10月和11月的兴奋期进入加密货币，然后经历了一个相当深的火灾销售。\n在去年10月和11月的兴奋期进入加密货币，然后经历了一个相当深的火灾销售、熊市、崩溃等，这将会给你一个真正的\n特别是如果你是年轻人，刚开始投资... ...",
      "title": "如果你在2021年秋天进入加密货币领域：你的情况如何？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "通過這一切，你的精神狀態如何？我想到了你們。在去年10月和11月的興奮期進入\n在去年10月和11月的興奮期進入加密貨幣，然後經歷了一個相當深的火災銷售。\n在去年10月和11月的興奮期進入加密貨幣，然後經歷了一個相當深的火災銷售、熊市、崩潰等，這將會給你一個真正的\n特別是如果你是年輕人，剛開始投資... ...",
      "title": "如果你在2021年秋天進入加密貨幣領域：你的情況如何？"
    }
  ]
}