{
  "author": "gigabyteIO",
  "original_created_utc": 1660530871,
  "title": "Did you know that Silvio Micali, the founder of Algorand, is indirectly referenced multiple times in the Bitcoin whitepaper? His foundational work is used throughout modern cryptography, including Probabilistic Encryption and Interactive Proof Systems(Zero-knowledge proofs).",
  "created_utc": 1660559575,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If you haven&amp;#39;t read the Bitcoin white paper I highly recommend even if you don&amp;#39;t understand it, it&amp;#39;s beneficial to read from the direct source and it&amp;#39;s surprisingly short:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://bitcoin.org/bitcoin.pdf\"&gt;https://bitcoin.org/bitcoin.pdf&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Reference 2 and Reference 4 both reference the 3rd:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;[2] H. Massias, X.S. Avila, and J.-J. Quisquater, &amp;quot;Design of a secure timestamping service with minimal trust requirements,&amp;quot; In 20th Symposium on Information Theory in the Benelux, May 1999.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;[4] D. Bayer, S. Haber, W.S. Stornetta, &amp;quot;Improving the efficiency and reliability of digital time-stamping,&amp;quot; In Sequences II: Methods in Communication, Security and Computer Science, pages 329-334, 1993.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Bitcoin white papers third reference is:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;[3] S. Haber, W.S. Stornetta, &amp;quot;How to time-stamp a digital document,&amp;quot; In Journal of Cryptology, vol 3, no 2, pages 99-111, 1991.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;link to paper: &lt;a href=\"https://link.springer.com/content/pdf/10.1007%2F3-540-38424-3_32.pdf\"&gt;&lt;strong&gt;https://link.springer.com/content/pdf/10.1007%2F3-540-38424-3_32.pdf&lt;/strong&gt;&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This references Micali&amp;#39;s work:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;[2] IT. Blum and S. Xiicali. How to generate cryptographically strong sequences of pseudo-random bits. SIAM Journal on Computing, 13(4):850-864, Nov. 1984.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;[9] S. Goldwasser and S. Micali. Probabilistic encryption. JCSS, 28:270-299, April 1984.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;[lo] S. Goldwasser, S. Micali, and R. Rivest. A secure digital signature scheme. SIAM Journal on Computing, 17(2):281-308, 1988.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Without Micalis foundational work in Probabilistic Encryption and Interactive Proof System, Bitcoin and Ethereum may not have been a thing.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Summary of Probabilistic Encryption and Interactive Proof Systems:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Probabilistic Encryption&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Shafi Goldwasser and Silvio Micali produced one of the most influential papers in computer science, “Probabilistic Encryption,” as graduate students in 1983, by introducing the question “What is a secret?”  Their standards were very high: an adversary (third party) should not be able to gain any partial information about a secret.  Their definition of the security of encryption as a “game” involving adversaries has become a trademark of modern cryptography.  Their approach, known as the simulation paradigm, bypassed the traditional enumeration of desired properties that marked the definition of security, and led to the construction of a secure encryption scheme. &lt;/p&gt;\n\n&lt;p&gt;This method provided a robust defense against malicious attempts to make these schemes deviate from their prescribed functionality. They introduced two notions of encryption security – semantic security and indistinguishability of encrypted messages from each other – thus capturing the important aspects of the subject. They argued that these measures must be met for schemes to provide security across the wide range of cryptography applications. In contrast with prevailing trends in the field, they observed that to satisfy their security definition, encryption schemes must be randomized rather than deterministic, with many possible encrypted texts corresponding to each message. This development revolutionized the study of cryptography and laid the foundation for the theory of cryptographic security that was developed throughout much of the 1980s.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Interactive Proof Systems&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;One of the most significant contributions of Goldwasser and Micali is their 1985 paper with Charles Rackoff, titled “The Knowledge Complexity of Interactive Proof Systems.” It introduced knowledge complexity, a concept that deals with hiding information from an adversary, and is a quantifiable measure of how much “useful information” could be extracted.  The paper initiated the idea of “zero-knowledge” proofs, in which interaction (the ability of provers and verifiers to send each other messages back and forth) and  probabilism (the ability to toss coins to decide which messages to send)  enable the establishment of a fact via a statistical argument without providing any additional information as to why it is true.&lt;/p&gt;\n\n&lt;p&gt;Zero-knowledge proofs were a striking new philosophical idea that provided the essential language for speaking about security of cryptographic protocols by controlling the leakage of knowledge.  Subsequent works by Oded Goldreich, Micali, and Avi Wigderson and by Michael Ben-Or, Goldwasser, and Wigderson showed that every multiparty computation can be carried out securely, revealing to the players no more knowledge than prescribed by the desired outcome. These papers exhibited the power and utility of zero-knowledge protocols, and demonstrated their ubiquitous and omnipotent character.&lt;/p&gt;\n\n&lt;p&gt;The paper identified interactive proofs as a new method to verify correctness in the exchange of information. Going beyond cryptography, interactive proofs can be much faster to verify than classical proofs, and can be used in practice to guarantee correctness in a variety of applications. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR: Silvio Micali is the god father of modern cryptography and even Satoshi Nakamoto used his foundational work.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 385,
  "permalink": "/r/CryptoCurrency/comments/wonwgn/did_you_know_that_silvio_micali_the_founder_of/",
  "subreddit": "CryptoCurrency",
  "id": "wonwgn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If you haven't read the Bitcoin white paper I highly recommend even if you don't\nunderstand it, it's beneficial to read from the direct source and it's\nsurprisingly short:\n\nhttps://bitcoin.org/bitcoin.pdf\n\n\n\nReference 2 and Reference 4 both reference the 3rd:\n\n[2] H. Massias, X.S. Avila, and J.-J.…"
}