{
  "author": "ilai_reddead",
  "the_new_excerpt": "so I posted this before and ill try again with a slightly different tone, but\nthe state of investing on Reddit has turned into some mass Qanon misinformation\nshit dump. I have reason to believe the hedge funds did not in fact instruct the\nbrokers to halt trading, but last time I posted this I got 60…",
  "original_created_utc": 1611999325,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以我以前发过这个，我再试一次，语气稍有不同，但。\nReddit上的投资状态已经变成了一些大规模的Qanon错误信息。\n狗屎堆。我有理由相信，对冲基金其实并没有指示的。\n经纪商停止交易，但最后一次 我发布了这一点，我得到了60... ...",
      "title": "我们能不能停止错误的信息"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我以前發過這個，我再試一次，語氣稍有不同，但。\nReddit上的投資狀態已經變成了一些大規模的Qanon錯誤信息。\n狗屎堆。我有理由相信，對沖基金其實並沒有指示的。\n經紀商停止交易，但最後一次 我發佈了這一點，我得到了60... ...",
      "title": "我們能不能停止錯誤的信息"
    }
  ],
  "title": "Can we please stop the misinformation",
  "created_utc": 1612013904,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>so I posted this before and ill try again with a slightly different tone, but the state of investing on Reddit has turned into some mass Qanon misinformation shit dump. I have reason to believe the hedge funds did not in fact instruct the brokers to halt trading, but last time I posted this I got 60 comments and one agreeing with me, so I think its better people hear it from wsb, and please read the damn post that I will link, here it is </p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/l7fw0x/i_used_to_work_merrill_heres_what_likely_happened/\">https://www.reddit.com/r/wallstreetbets/comments/l7fw0x/i_used_to_work_merrill_heres_what_likely_happened/</a></p>\n\n<p>Edit- also as a side note fuck musk, fuck chamath, fuck Dave portnoy, fuck the winklevoss twins, and fuck any celebrity or famous person who eggs on the misinformation, they know better and are using people</p>\n</div><!-- SC_ON -->",
  "score": 73,
  "permalink": "/r/stocks/comments/l8i72x/can_we_please_stop_the_misinformation/",
  "subreddit": "stocks",
  "id": "l8i72x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518537973
}