{
  "author": "Shesaidhello",
  "the_new_excerpt": "I'm seeing a lot of posts here with questions like How come coin X isnt mooning\n\nwhen i check out the mentioned coin i see the thing is up 100% in 2 weeks but\nonly up 5% today. People, for the love of satoshi, relax.\n\nFirstly, Don't invest more than you're willing to lose and invest in something\nyou…",
  "original_created_utc": 1612944130,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在这里看到很多帖子都有这样的问题，比如说X币怎么没有月光呢？\n\n当我检查出提到的硬币，我看到的东西是在2周内上升100％，但...。\n今天只涨了5% 大家看在聪哥的份上，放松点。\n\n首先，不要投资超过你愿意失去的东西，并投资于一些东西\n你...",
      "title": "缩小和冷却"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在這裏看到很多帖子都有這樣的問題，比如說X幣怎麼沒有月光呢？\n\n當我檢查出提到的硬幣，我看到的東西是在2周內上升100％，但...。\n今天只漲了5% 大家看在聰哥的份上，放鬆點。\n\n首先，不要投資超過你願意失去的東西，並投資於一些東西\n你...",
      "title": "縮小和冷卻"
    }
  ],
  "title": "Zoom out and chill",
  "created_utc": 1612967471,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m seeing a lot of posts here with questions like <em>How come coin X isnt mooning</em></p>\n\n<p>when i check out the mentioned coin i see the thing is up 100% in 2 weeks but only up 5% today. People, for the love of satoshi, relax.  </p>\n\n<p><strong>Firstly,</strong> Don&#39;t invest more than you&#39;re willing to lose and invest in something you believe in and have some faith.</p>\n\n<p><strong>Secondly,</strong> A rising tide lifts all boats, if your coin is not flying right now, just wait, its time will come.</p>\n\n<p><strong>Thirdly,</strong> the worse thing you can do right now is chase a coin that&#39;s pumping.  Trust me as a person whos been here for a long time, this ends badly more often than not.  </p>\n\n<p>And <strong>lastly</strong>, if you&#39;re feeling FOMO, go for a walk, go for a jog, get the blood flowing and stop staring at numbers on a screen.</p>\n</div><!-- SC_ON -->",
  "score": 313,
  "permalink": "/r/CryptoCurrency/comments/lgozcz/zoom_out_and_chill/",
  "subreddit": "CryptoCurrency",
  "id": "lgozcz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123197365
}