{
  "author": "Different_Rutabaga27",
  "the_new_excerpt": "So I'm a bisexual woman currently in a cis relationship. I'm an out and proud bi\nwoman just to be clear, everyone of significance knows my sexuality. I've never\nreally felt it was a big part of my personality though I've been with women and\nI've been with men I just happens to be in a committed…",
  "original_created_utc": 1622743385,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はバイセクシャルの女性で、現在シスの関係にあります。私はバイセクシャルであることを誇りに思っています。\n私のセクシュアリティを知っている人は多いと思います。私は今まで、自分の個性の大きな部分を占めているとは\n自分の性格の大部分を占めていると感じたことはありません。\n男性と付き合ったこともあります。私はたまたまコミットした...",
      "title": "誰かが自分のセクシュアリティを持ち出すことにイラッとするのは変ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一名双性恋女性，目前处于一种双性恋关系中。我是一个公开的、自豪的双性恋\n的女人，每个人都知道我的性取向。我从来没有\n我从来没有感觉到这是我性格中的一个重要部分，虽然我曾经和女人在一起，并且\n我曾经和男人在一起，只是恰好在一个承诺的...。",
      "title": "我被别人一直提起我的性行为而感到恼火，这很奇怪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一名雙性戀女性，目前處於一種雙性戀關係中。我是一個公開的、自豪的雙性戀\n的女人，每個人都知道我的性取向。我從來沒有\n我從來沒有感覺到這是我性格中的一個重要部分，雖然我曾經和女人在一起，並且\n我曾經和男人在一起，只是恰好在一個承諾的...。",
      "title": "我被別人一直提起我的性行爲而感到惱火，這很奇怪嗎？"
    }
  ],
  "title": "Is it weird that I'm irked by someone bringing up my sexuality all the time?",
  "created_utc": 1622755918,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I&#39;m a bisexual woman currently in a cis relationship. I&#39;m an out and proud bi woman just to be clear, everyone of significance knows my sexuality. I&#39;ve never really felt it was a big part of my personality though I&#39;ve been with women and I&#39;ve been with men I just happens to be in a committed relationship with a man. \nI have a friend though who I swear has brought up my bisexuality more than I feel I ever have. It&#39;s a new relationship and she&#39;s a few years younger than me and it&#39;s probably just a maturity thing. But when I asked her to stop bringing it up so much she accused me of lacking pride in my sexuality. \nAm I a bad gay for not wanting to discuss my bisexuality more?</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/TooAfraidToAsk/comments/nrjqxm/is_it_weird_that_im_irked_by_someone_bringing_up/",
  "subreddit": "TooAfraidToAsk",
  "id": "nrjqxm",
  "is_self": true,
  "media": null,
  "is_video": false
}