{
  "author": "Magos-Caomhainn",
  "the_new_excerpt": "I've scrolled past their posts before cause I'm a guy and it's obviously a sub\nmeant for women, but I got curious and took a look. Wow, what a rabbit hole that\nwas. First post I saw was a link to a podcast about penis size and how it\nmatters (I'm not crapping on people's personal tastes on the…",
  "original_created_utc": 1620488511,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は男ですし、明らかに女性向けのサブサイトなので、以前は彼らの投稿をスクロールして見過ごしていました。\nしかし、興味を持って見てみました。うわー、なんだこのウサギの穴は\nでした。最初に見た投稿は、ペニスのサイズとその重要性についてのポッドキャストへのリンクでした。\n(私は人々の個人的な好みを非難しているわけではありませんが...)",
      "title": "FDSは本気じゃないよね？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我以前翻过他们的帖子，因为我是个男人，而且这显然是一个为女性服务的子网站。\n是为女人准备的，但我很好奇，就看了一眼。哇，这真是一个兔子洞\n是个兔子洞。我看到的第一个帖子是一个播客的链接，内容是关于阴茎大小和它如何\n(我不是在嘲笑人们的个人品味。",
      "title": "FDS不可能是认真的吧？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我以前翻過他們的帖子，因爲我是個男人，而且這顯然是一個爲女性服務的子網站。\n是爲女人準備的，但我很好奇，就看了一眼。哇，這真是一個兔子洞\n是個兔子洞。我看到的第一個帖子是一個播客的鏈接，內容是關於陰莖大小和它如何\n(我不是在嘲笑人們的個人品味。",
      "title": "FDS不可能是認真的吧？"
    }
  ],
  "title": "FDS can't be serious right?",
  "created_utc": 1620502479,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve scrolled past their posts before cause I&#39;m a guy and it&#39;s obviously a sub meant for women, but I got curious and took a look. Wow, what a rabbit hole that was. First post I saw was a link to a podcast about penis size and how it matters (I&#39;m not crapping on people&#39;s personal tastes on the matter), and the comments were so damn toxic. I&#39;m pretty sure if I posted about &quot;Breast size matters and I&#39;m tired of pretending it doesn&#39;t&quot; I&#39;l would be crucified by them as a Low Value Male or whatever bull they call people. Is FDS honestly a troll sub or are they serious?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/n7ruue/fds_cant_be_serious_right/",
  "subreddit": "TooAfraidToAsk",
  "id": "n7ruue",
  "is_self": true,
  "media": null,
  "is_video": false
}