{
  "author": "xavierwest888",
  "original_created_utc": 1642023096,
  "title": "If you asked me to lose money investing in crypto it would be so ridiculously easy even though most casual investors do the EXACT same steps trying to gain money",
  "created_utc": 1642073838,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;See a coin has pumped 5-10% in a day, go all in on that bad boi before the inevitable dip that follows takes you back down to where the price started and you 5-10% lower.&lt;/li&gt;\n&lt;li&gt;Get a random bunch of coins in your wallet, DEFINETELY try and sell them because they are a scam and will steal a bunch of your coins from you.&lt;/li&gt;\n&lt;li&gt;Always be moving coins around, doesn&amp;#39;t matter where to or from just keep em moving into and out of wallets, onto exchanges, off exchanges.&lt;/li&gt;\n&lt;li&gt;Try and convert your coins into other coins at least once a day, that way you are still gambling that the price of a single coin is either gonna go up or down but this way you get to eat up a few extra conversion fees.&lt;/li&gt;\n&lt;li&gt;See a coin with an APR in the XXXXX% range, you buy that right up and just watch you money drain away.&lt;/li&gt;\n&lt;li&gt;Meme coins are a great way to lose money, just wait until they are mainstream and have shot up about 100 x in less than a month and are in the top 10s then you are guaranteed to be buying at the top.&lt;/li&gt;\n&lt;li&gt;See a new coin fresh on the market, that&amp;#39;s probably a rug pull so that&amp;#39;s an easy way to loose a chunk of cash without putting in any effort at all.&lt;/li&gt;\n&lt;li&gt;Market down about 50% from ATH&amp;#39;s, this is ALWAYS the best time to sell. You&amp;#39;re almost certainly at the bottom at this point and you gotta get out before the price returns and you make your money back!&lt;/li&gt;\n&lt;li&gt;Buy wallets for all the companies, even though you have coins with less value than the cost of the wallet. Gotta get that $50 off the exchanges after all!&lt;/li&gt;\n&lt;li&gt;DCA into projects but do it in that way where you DCA MORE when the market is going up and then kinda slack off of it when the markets are down with that &amp;#39;I&amp;#39;ll wait and see mentality&amp;#39; because the E in DCA stands for emotion and you need to always include that when you are making financial investment plans!&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 304,
  "permalink": "/r/CryptoCurrency/comments/s2hjmx/if_you_asked_me_to_lose_money_investing_in_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "s2hjmx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": " 1.  See a coin has pumped 5-10% in a day, go all in on that bad boi before the\n     inevitable dip that follows takes you back down to where the price started\n     and you 5-10% lower.\n 2.  Get a random bunch of coins in your wallet, DEFINETELY try and sell them\n     because they are a scam and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": " 1.  コインが1日で5-10%上昇したのを確認したら、そのコインに全力投球する。\n     その後に起こる必然的な下落によって、価格がスタート地点に戻ることになります。\n     5-10%下がる。\n 2.  2.財布の中のコインを適当に集めて、絶対に売ろうとする。\n     なぜなら、それらは詐欺であり、...",
      "title": "暗号に投資してお金を失うと言われたら、ほとんどのカジュアルな投資家がお金を得ようと全く同じステップを踏むにもかかわらず、それはとてもばかばかしいほど簡単なことです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": " 1.  看到一个硬币在一天内上涨了5-10%，在随后不可避免的下跌将你拉回到开始时的价格之前，全身心地投入到这个坏小子身上。\n     在接下来不可避免的下跌将你带回到价格开始的地方\n     而你的价格又降低了5-10%。\n 2.  2.在你的钱包里随机得到一堆硬币，一定要尝试卖掉它们\n     因为它们是一个骗局，而且...",
      "title": "如果你问我投资加密货币会不会赔钱，这将是非常可笑的，尽管大多数休闲投资者做了完全相同的步骤，试图获得资金。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " 1.  看到一個硬幣在一天內上漲了5-10%，在隨後不可避免的下跌將你拉回到開始時的價格之前，全身心地投入到這個壞小子身上。\n     在接下來不可避免的下跌將你帶回到價格開始的地方\n     而你的價格又降低了5-10%。\n 2.  2.在你的錢包裏隨機得到一堆硬幣，一定要嘗試賣掉它們\n     因爲它們是一個騙局，而且...",
      "title": "如果你問我投資加密貨幣會不會賠錢，這將是非常可笑的，儘管大多數休閒投資者做了完全相同的步驟，試圖獲得資金。"
    }
  ]
}