{
  "author": "DairyonBigs",
  "the_new_excerpt": "Position:194 shares at $19.28\n\nDisclaimer: I started trading this January and my views are purely informational\nand I do not condone anyone making financial/trading decisions based on this\npost. Do your DD before you trade. This is a bullish take on BB and may have\nsome holes in it.\n\nSo I have been…",
  "original_created_utc": 1611639971,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "持仓：194股，价格19.28元\n\n免责声明：本人于今年1月开始交易，观点纯属参考。\n我不容忍任何人基于此做出金融/交易决定。\n岗位。交易前先做丈量。这是对BB的看好，可能会有\n一些洞。\n\n所以我一直...",
      "title": "我对BB的长期看好"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "持倉：194股，價格19.28元\n\n免責聲明：本人於今年1月開始交易，觀點純屬參考。\n我不容忍任何人基於此做出金融/交易決定。\n崗位。交易前先做丈量。這是對BB的看好，可能會有\n一些洞。\n\n所以我一直...",
      "title": "我對BB的長期看好"
    }
  ],
  "title": "My Bullish take on BB long term",
  "created_utc": 1611673648,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Position:194 shares at $19.28</p>\n\n<p>Disclaimer: I started trading this January and my views are purely informational and I do not condone anyone making financial/trading decisions based on this post. Do your DD before you trade. This is a bullish take on BB and may have some holes in it.</p>\n\n<p>So I have been watching BB for a while now and feel the company is undervalued. Forgive me as I have not made a DD post before, I failed English in high school, and I am typing this up on my phone.</p>\n\n<p>BB originally caught my attention because it struck me that it survived being primarily a phone company and shifted its business to its cyber security and other software. I Put it on my watch list to swing it a little bit and recently sold 140 shares at $11.</p>\n\n<p>Seeing the price go up and the volume I decided I would jump back in since the trend analysis looked pretty good. Bought in at 19.28 and it almost immediately crashed, I suspect likely due to the pullback the whole market had this morning with stimulus talks being delayed.</p>\n\n<p>Canada Halts trading today due to the volatility followed by BB making a statement in response basically saying idk why investors are buying up the stock we haven’t made any announcements \nTrading resumes and the price rises back up beyond open in AH, closing at nearly 20 dollars.</p>\n\n<p>THEN as you have already probably seen, BB announces partnership with Baidu - coincidence? Probably not, investors probably coaxed that information out of them and they likely didn’t want to get caught in some insider trading schenangians. </p>\n\n<p>Speculation for tomorrow: BB Will open strong and meet or exceed the 40% growth of today since it just got that huge news. Baidu is Chinese google, and they partnered with BB since they need a operating system platform to mass produce their maps software in autonomous/ev vehicles with their partner GAC. Now this is a lot of China talk but BB is headquartered in CANADA which is much friendlier in regards to trade than the U.S.</p>\n\n<p>A little bit of information about GAC, they are a Chinese automotive giant that has came to the United States National Automobile Dealers association expos begging for investors, however has not had much success since the last 4 years have not been good for U.S. and China Trade.</p>\n\n<p>The LONG game: Once our new administration warms up to China after those in charge of trade take their cuts, (and they will because history repeats itself, but right now the bear case would be that Biden is not looking to change tariffs on China, playing tough until he gets some leverage is what I think is really going on) GAC will have lots of opportunity to start putting their vehicles on our roads. \nGAC is the highest rated car brand in China so it may have a chance in the United States if it plays its cards right, which means we could have Blackberry powered Autonomous EVs on our streets in the next 5 years. </p>\n\n<p>This company has a lot of value in our up and coming future of Electric and Autonomous vehicles.</p>\n\n<p>I am too new to this to speculate on where this stock should be valued at, but here are some resources where I got my information so you can decide for yourself:</p>\n\n<p><a href=\"https://www.reuters.com/article/us-blackberry-stocks-idUSKBN29U28L\">https://www.reuters.com/article/us-blackberry-stocks-idUSKBN29U28L</a></p>\n\n<p><a href=\"https://www.autodeal.com.ph/articles/car-features/10-things-you-need-know-about-gac-motor\">https://www.autodeal.com.ph/articles/car-features/10-things-you-need-know-about-gac-motor</a></p>\n\n<p><a href=\"https://www.google.com/amp/s/finance.yahoo.com/amphtml/news/blackberry-expands-partnership-baidu-power-020000067.html\">https://www.google.com/amp/s/finance.yahoo.com/amphtml/news/blackberry-expands-partnership-baidu-power-020000067.html</a></p>\n\n<p><a href=\"https://apnews.com/article/joe-biden-donald-trump-technology-beijing-global-trade-22f525e41676d4e6abf96f3ca9255d15\">https://apnews.com/article/joe-biden-donald-trump-technology-beijing-global-trade-22f525e41676d4e6abf96f3ca9255d15</a></p>\n</div><!-- SC_ON -->",
  "score": 90,
  "permalink": "/r/investing/comments/l57f23/my_bullish_take_on_bb_long_term/",
  "subreddit": "investing",
  "id": "l57f23",
  "is_self": true,
  "media": null,
  "is_video": false
}