{
  "author": "Jxntb733",
  "original_created_utc": 1644238768,
  "title": "I suggest not trying to 'learn' technical analysis, it's a fake science and a bad art.",
  "created_utc": 1644259117,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;TA tries to capture market psychology and sentiment by analyzing price trends and chart patterns for possible trading opportunities, but it&amp;#39;s misguided and lacks a theoretical basis.         &lt;/p&gt;\n\n&lt;p&gt;When put to scientific tests it doesn&amp;#39;t hold up against empirical evidence. Analysts consistently looking at different indicators and hedge their analysis. Often going BACK to data and drawing lines saying LOOK LOOK it broke the barrier line trend hill thing! SEE!           &lt;/p&gt;\n\n&lt;p&gt;Listen - if this stuff actually worked - we would have giant AI computers dedicated to learning how to do it - oh that&amp;#39;s right we do - and you know what happens when we plug them in to the system? The system figures it out and reacts differently. The global mood changes on a dime and all TA goes out the door with it.         &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;tldr; IT IS NOT OBJECTIVE.&lt;/strong&gt;         &lt;/p&gt;\n\n&lt;p&gt;Let me be clear, there ARE definite patterns within the stock market, and if they are recognized they can be successfully traded upon, but analyst cannot separate themselves from their beliefs and pre-dispositions, they selectively, and possibly sub-consciously, choose charts and TA indicators that confirm what they have already concluded.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 398,
  "permalink": "/r/CryptoCurrency/comments/smpnx1/i_suggest_not_trying_to_learn_technical_analysis/",
  "subreddit": "CryptoCurrency",
  "id": "smpnx1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "TA tries to capture market psychology and sentiment by analyzing price trends\nand chart patterns for possible trading opportunities, but it's misguided and\nlacks a theoretical basis.\n\nWhen put to scientific tests it doesn't hold up against empirical evidence.\nAnalysts consistently looking at…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TAは、価格動向を分析することで、市場心理やセンチメントを捉えようとするものです。\nというのは、取引機会を得るためのチャートパターンであり、見当違いのものである。\n理論的な根拠がない。\n\n科学的なテストを行っても、経験的な証拠に耐えることはできない。\nアナリストが一貫して見ているのは...",
      "title": "テクニカル分析を「学ぼう」としないことをお勧めします。それは偽りの科学であり、悪い芸術です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TA试图通过分析价格趋势和图表形态来捕捉市场心理和情绪，以寻找可能的交易机会。\n和图表模式来寻找可能的交易机会，但它被误导了，而且缺乏理论基础。\n缺乏理论基础。\n\n当被置于科学测试中时，它在经验证据面前是站不住脚的。\n分析师们一直在关注...",
      "title": "我建议不要试图 \"学习 \"技术分析，它是一门虚假的科学和一门糟糕的艺术。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TA試圖通過分析價格趨勢和圖表形態來捕捉市場心理和情緒，以尋找可能的交易機會。\n和圖表模式來尋找可能的交易機會，但它被誤導了，而且缺乏理論基礎。\n缺乏理論基礎。\n\n當被置於科學測試中時，它在經驗證據面前是站不住腳的。\n分析師們一直在關注...",
      "title": "我建議不要試圖 \"學習 \"技術分析，它是一門虛假的科學和一門糟糕的藝術。"
    }
  ]
}