{
  "author": "mfog35",
  "the_new_excerpt": "Childhood emotional neglect is a failure of parents or caregivers to respond to\na child’s emotional needs. It’s can be difficult to ascertain as it’s done\nunintentionally or very subtle and not in clearly neglectful or abusive\nhouseholds but those with two parents, high achievers/earners or families…",
  "original_created_utc": 1614776743,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "儿童情感忽视是指父母或照料者未能对以下情况作出反应：\n孩子的情感需求。这可能是很难确定的，因为它的完成。\n疏而不漏\n家庭，但有双亲的家庭、成绩优异者/收入者或家庭；",
      "title": "那些经历过童年情感忽视（CEN）的人；你是如何意识到你经历过它的，除了治疗之外，什么帮助你从它中恢复？你还表现出哪些迹象？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "兒童情感忽視是指父母或照料者未能對以下情況作出反應：\n孩子的情感需求。這可能是很難確定的，因爲它的完成。\n疏而不漏\n家庭，但有雙親的家庭、成績優異者/收入者或家庭；",
      "title": "那些經歷過童年情感忽視（CEN）的人；你是如何意識到你經歷過它的，除了治療之外，什麼幫助你從它中恢復？你還表現出哪些跡象？"
    }
  ],
  "title": "Those who experienced childhood emotional neglect (CEN); how did come to the realisation you experienced it and aside from therapy what has helped you recover from it? What signs do you still exhibit?",
  "created_utc": 1614788833,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Childhood emotional neglect is a failure of parents or caregivers to respond to a child’s emotional needs. It’s can be difficult to ascertain as it’s done unintentionally or very subtle and not in clearly neglectful or abusive households but those with two parents, high achievers/earners or families that provide children with fundamental needs (food clothing shelter).</p>\n\n<p>Some signs: \n* Feeling empty\n* Low self esteem or self worth\n* Fear of dependency on others\n* Not trusting kindness from others, believing they want something from you \n* Fearing emotional intimacy or emotionally unavailable \n* Needing constant reassurance \n* Unrealistic self image \n* No self compassion but shows high amounts for others \n* Feeling Guilty, anger and shame for reacting or feeling certain emotions \n* Difficulty feeling, expressing or managing emotions</p>\n</div><!-- SC_ON -->",
  "score": 139,
  "permalink": "/r/AskWomen/comments/lwtfff/those_who_experienced_childhood_emotional_neglect/",
  "subreddit": "AskWomen",
  "id": "lwtfff",
  "is_self": true,
  "media": null,
  "is_video": false
}