{
  "author": "curlyheadedfaack",
  "original_created_utc": 1641667393,
  "title": "My step makes up lies of physical abuse when disciplined.. what do we do?",
  "created_utc": 1641700586,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My 6 year old stepson has behavioral issues, the most concerning is the incessant lying. His lies have gotten increasingly serious. It seems to be a result of when myself or others put him in time out or take away his tablet when he is naughty. His dad and grandma raised him and they did not discipline him. The most they say when he’s being naughty is “no” or “stop”. This does nothing. &lt;/p&gt;\n\n&lt;p&gt;The first time it happened was when I noticed he was watching mindless stuff on YouTube, I switched it to something educational. He gave me this evil look then left to room. I heard him talking to his Dad and he told him I made him watch naughty stuff on YouTube. This is just the beginning. He then went to his grandmas house and his uncle was there. His uncle knows he has behavioral issues and took it upon himself to put him in time out while he was over there. When my stepson came home, he told my husband that he was whipped by a belt by his uncle on his face, hands and back. There were no marks or any sign of any injuries at all. About a month later I put him in time out and he told his grandma I left the house and left him alone for hours. Thank God for my bio kids, they called him out and said this wasn’t true. What the hell do we do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/rz6ppn/my_step_makes_up_lies_of_physical_abuse_when/",
  "subreddit": "TooAfraidToAsk",
  "id": "rz6ppn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My 6 year old stepson has behavioral issues, the most concerning is the\nincessant lying. His lies have gotten increasingly serious. It seems to be a\nresult of when myself or others put him in time out or take away his tablet when\nhe is naughty. His dad and grandma raised him and they did not…"
}