{
  "author": "Chief_Of_Operations",
  "original_created_utc": 1641268474,
  "title": "Wait...so people don't talk to themselves?",
  "created_utc": 1641288423,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Howdy, ever since I was a kid i would talk to myself, not in the I have an imaginary friend or split personalities sense but more of narration. I&amp;#39;ll say, &amp;quot;okay, got my phone, keys, wallet, oh and I can&amp;#39;t forget those papers for the doctor&amp;quot; or at work I&amp;#39;ll say &amp;quot;okay I need 16 packages of 11487 where are they....bay 15 ehh no I think its bay 4&amp;quot; or &amp;quot;man, that episode of the expanse was pretty cool I really liked x y z.&amp;quot; When I&amp;#39;m around people its internal but sometimes it slips out when I&amp;#39;m at work but as soon as I&amp;#39;m alone it comes out and is hard to keep it internal, I&amp;#39;ll try but I&amp;#39;ll catch myself doing it. I was doing it in the morning making breakfast, &amp;quot;okay what do we got, eggs, potatoes, cheese and some veggies, omelet with country potatoes sounds good.&amp;quot; A friend was on the couch and was horrified, they asked who I was talking to and in said no one, just out loud they let my other friends know and it was clear that this was not normal. Am I insane? I don&amp;#39;t have anything other than add&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/rvkwfr/waitso_people_dont_talk_to_themselves/",
  "subreddit": "TooAfraidToAsk",
  "id": "rvkwfr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Howdy, ever since I was a kid i would talk to myself, not in the I have an\nimaginary friend or split personalities sense but more of narration. I'll say,\n\"okay, got my phone, keys, wallet, oh and I can't forget those papers for the\ndoctor\" or at work I'll say \"okay I need 16 packages of 11487 where…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、私は子供の頃から独り言を言っていました。\nイマジナリーフレンドやスプリットパーソナリティという意味ではなく、ナレーションのようなものです。私はこう言います。\n「携帯電話、鍵、財布、それから、結婚式のための書類を忘れないようにしないとね。\n仕事では、「11487を16個、どこに置けばいいんだろう...」とか。",
      "title": "待てよ、人は独り言を言わないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，我从小就会自言自语，不是说我有一个想象中的朋友或人格分裂，而是更多的叙述。\n我有一个想象中的朋友或人格分裂的感觉，但更多的是叙述。我会说。\n\"好的，我拿到了我的手机、钥匙、钱包，哦，我不能忘记那些给医生的文件。\n或者在工作中我会说：\"好的，我需要16包11487，在哪里...？",
      "title": "等等......所以人们不会自言自语？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，我從小就會自言自語，不是說我有一個想象中的朋友或人格分裂，而是更多的敘述。\n我有一個想象中的朋友或人格分裂的感覺，但更多的是敘述。我會說。\n\"好的，我拿到了我的手機、鑰匙、錢包，哦，我不能忘記那些給醫生的文件。\n或者在工作中我會說：\"好的，我需要16包11487，在哪裏...？",
      "title": "等等......所以人們不會自言自語？"
    }
  ]
}