{
  "author": "hatetheproject",
  "the_new_excerpt": "Maxeon Solar Technologies split off from Sunpower a couple years ago, with\nMaxeon being the global producer and Sunpower being the US producer and\ndistributor.\n\nOnto the valuation: they have a market cap of about 1b with revenue of 1.2b in\n2019, about 900m TTM because of the pandemic (from now on im…",
  "original_created_utc": 1614902249,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "几年前，Maxeon太阳能技术公司从Sunpower公司分离出来，与。\nMaxeon是全球生产者，Sunpower是美国生产者。\n分销商。\n\n到了估值：他们的市值约为10亿，收入12亿，在。\n2019年，约900米的TTM，因为流行病（从现在开始im...",
      "title": "被低估的太阳能股票MAXN。过去几周已经下跌了50%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾年前，Maxeon太陽能技術公司從Sunpower公司分離出來，與。\nMaxeon是全球生產者，Sunpower是美國生產者。\n分銷商。\n\n到了估值：他們的市值約爲10億，收入12億，在。\n2019年，約900米的TTM，因爲流行病（從現在開始im...",
      "title": "被低估的太陽能股票MAXN。過去幾周已經下跌了50%。"
    }
  ],
  "title": "Undervalued solar power stock MAXN. Has fallen 50% the past few weeks.",
  "created_utc": 1614915603,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Maxeon Solar Technologies split off from Sunpower a couple years ago, with Maxeon being the global producer and Sunpower being the US producer and distributor. </p>\n\n<p>Onto the valuation: they have a market cap of about 1b with revenue of 1.2b in 2019, about 900m TTM because of the pandemic (from now on im primarily gonna reference 2019 stats since it seems unfair to use 2020). </p>\n\n<p>Gross profit improved from -104M to -8.4M 2018-19, net income improved from -603M to -183M. </p>\n\n<p>They have about 2.1 price to book value.</p>\n\n<p>The valuations are okay but what really makes the difference here is their products. They make the highest efficiency and lowest degrading solar panels in the world, and are looking to move into the microinverters, energy storage and even services industries in the next few years with a partnership with Enphase Energy. </p>\n\n<p>As well as this i believe their core panel production business will continue to expand rapidly as it has done, with a CAGR of 28.1% compared to industry’s 19.5%. </p>\n\n<p>Being in such a quickly growing industry, and the leader in quality, you’d expect them to have a much higher market cap. This is due to them making a loss the past few years, but i believe they’ll soon swing to profitability and see a massive increase in stock price when that happens. </p>\n\n<p>If you don’t like investing in currently unprofitable companies, try Canadian Solar $CSIQ and JinkoSolar JKS. Both down 45% ish and with low P/e ratios.</p>\n\n<p>Personally, i’ll be splitting my money relatively evenly between the three to hedge my bets and capitalise on the rapid growth of solar globally regardless.</p>\n</div><!-- SC_ON -->",
  "score": 219,
  "permalink": "/r/investing/comments/lxz09o/undervalued_solar_power_stock_maxn_has_fallen_50/",
  "subreddit": "investing",
  "id": "lxz09o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542574783
}