{
  "author": "MasterCookSwag",
  "the_new_excerpt": "Do me, and everyone else a favor and read the entire thing before commenting.\nThere's a significant trend on this sub of people just commenting bullshit based\non what they think a post might say before reading it. There's a lot of\nexplanation and context here so take your time if you're looking to…",
  "original_created_utc": 1611683774,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "帮我和大家一个忙，看完整个东西再评论。\n有一个显著的趋势，在这个子上的人只是评论废话根据\n在阅读之前，他们认为一个帖子可能会说什么。有很多\n这里的解释和背景，所以如果你想慢慢... ...",
      "title": "我想和大家分享Matt Levine关于市场操纵和GME的讨论，这是一个很好的外行解释证券法中的法律歧义的方法"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幫我和大家一個忙，看完整個東西再評論。\n有一個顯著的趨勢，在這個子上的人只是評論廢話根據\n在閱讀之前，他們認爲一個帖子可能會說什麼。有很多\n這裏的解釋和背景，所以如果你想慢慢... ...",
      "title": "我想和大家分享Matt Levine關於市場操縱和GME的討論，這是一個很好的外行解釋證券法中的法律歧義的方法"
    }
  ],
  "title": "I wanted to share Matt Levine's discussion on Market Manipulation and GME, it's a good laymen's explanation of the legal ambiguities in securities law",
  "created_utc": 1611693898,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Do me, and everyone else a favor and read the entire thing before commenting.  There&#39;s a significant trend on this sub of people just commenting bullshit based on what they think a post might say before reading it.  There&#39;s a lot of explanation and context here so take your time if you&#39;re looking to learn. </p>\n\n<p>Just a straight copy/paste from his newsletter today: </p>\n\n<p>If a lot of people on Reddit band together to drive the price of a stock higher, is that illegal? I have been asked that question a lot recently, and I want to be clear that:</p>\n\n<ol>\n<li><p>I don’t know, and</p></li>\n<li><p>If I did know, I wouldn’t tell you, because I do not give legal advice in this newsletter, and I particularly do not give legal advice that people on Reddit might read while pumping up stocks.</p></li>\n</ol>\n\n<p>That said I suppose we should talk about the question in general and extremely not-legal-advice terms. I guess my answer would be that it might be illegal in all sorts of ways, but it is not obviously illegal, and if the U.S. Securities and Exchange Commission were to go after WallStreetBets for this stuff they will be breaking new ground and going beyond their previous cases. I do not want to say “this stuff is all fine,” but I will say I am not all that bothered by it.</p>\n\n<p>There are two main things that are illegal. One is “securities fraud.” This basically means lying about a stock. The other is “market manipulation.” Nobody knows what this means. Legally, it means something like:</p>\n\n<blockquote>\n<p>To effect, alone or with 1 or more other persons, a series of transactions in any security … creating actual or apparent active trading in such security, or raising or depressing the price of such security, for the purpose of inducing the purchase or sale of such security by others.</p>\n</blockquote>\n\n<p>So if you buy stock with the purpose of pushing the price up so that other people will buy it, that’s market manipulation. If you buy stock hoping that the price will go up because other people buy it, that’s not market manipulation; that’s just normal. Those things are not so different. There is a “traditional four-part test for manipulation that has developed in case law”: </p>\n\n<ol>\n<li><p>I buy some GameStop stock.</p></li>\n<li><p>I put out rumors—in my subscription newsletter, on Reddit, in fake press releases, whatever—about some catalyst for the stock to go up. “Hey I hear from an inside source that GameStop just got an exclusive contract to supply downloadable video games in Tesla cars,” etc.</p></li>\n<li><p>People see these rumors, believe them and buy GameStop stock, pushing the price up.</p></li>\n<li><p>I sell the stock to them at the higher prices.</p></li>\n</ol>\n\n<p>So consider the general concept of a “pump-and-dump” scheme. The most classic pump-and-dump goes like this:</p>\n\n<p>1) I buy some GameStop stock.</p>\n\n<p>2) I put out rumors—in my subscription newsletter, on Reddit, in fake press releases, whatever—about some catalyst for the stock to go up. “Hey I hear from an inside source that GameStop just got an exclusive contract to supply downloadable video games in Tesla cars,” etc.</p>\n\n<p>3) People see these rumors, believe them and buy GameStop stock, pushing the price up.</p>\n\n<p>4) I sell the stock to them at the higher prices.</p>\n\n<p>This is very straightforwardly illegal and the SEC goes after this stuff all the time, alleging securities fraud. Lying about stocks. Here is the SEC’s “Investor Alert: Social Media and Investing -- Stock Rumors,” which pretty much defines a pump-and-dump this way:</p>\n\n<blockquote>\n<p>For example, in a “pump-and-dump” scheme, promoters “pump” up the stock price by spreading positive rumors that incite a buying frenzy and they quickly “dump” their own shares before the hype ends. Typically, after the promoters profit from their sales, the stock price drops and the remaining investors lose money.</p>\n</blockquote>\n\n<p>There are variations. The SEC has gone after forms of dishonesty that aren’t quite lying about the stock. For instance, if you are a widely followed stock promoter with a subscription tip newsletter, and you email tips to your subscribers and then sell your stock to them while saying that you’re buying, that seems dishonest, and the SEC will go after you. Or if you are a promoter or research firm and you put out positive research about a company, but you don’t disclose that the company paid you to put out the research, that is also bad. </p>\n\n<p>Now, I think you could do a pump-and-dump without any actual lying. For instance:</p>\n\n<ol>\n<li><p>I email subscribers to my expensive private newsletter saying “hey let’s pump GameStop.”</p></li>\n<li><p>We all buy GameStop, knowing that we’re just doing it for the pump, with no real or fake catalyst for the stock to go up.</p></li>\n<li><p>It goes up, because we bought a lot of it. </p></li>\n<li><p>Other people, innocents and high-frequency trading algorithms, see it go up on heavy volume and think “hey this is a good stock, we should buy it.” They buy it, pushing the price up.</p></li>\n<li><p>We sell the stock to them at the higher prices.</p></li>\n</ol>\n\n<p>In this version, I have not lied about a stock. On the other hand, I have effected transactions in the stock to create trading activity and raise the price, for the purpose of inducing people to buy it. Seems like market manipulation, “painting the tape” or something. The SEC goes after stuff like this occasionally.</p>\n\n<p>I think that in modern markets you could even do a bit better than that and have a completely honest pump-and-dump:</p>\n\n<ol>\n<li><p>I show up on Reddit and say “hey let’s pump GameStop.”</p></li>\n<li><p>We all buy GameStop, knowing that we’re just doing it for the pump, with no real or fake catalyst for the stock to go up.</p></li>\n<li><p>It goes up, because we bought a lot of it. </p></li>\n<li><p>Other people see us doing this, read my Reddit post, know we are pumping the stock, and also buy it, because we seem to be having fun, and they like fun too.</p></li>\n<li><p>Eventually some of us get bored and start selling and the price collapses.</p></li>\n</ol>\n\n<p>The point here is that it is at least theoretically possible that no one buys stock for any reason other than “hey it’s a fun pump.” That is, no one is deceived about the fundamentals (there’s no fake news about the company), and also no one is deceived about the technicals. No one says “huh this stock is up on a lot of good buying pressure, I should buy some”; everyone who buys says “hey this stock is up because it’s being pumped, and if I get in now I might still get out before it collapses, and that’ll be fun.” It is “respect the pump” as a quasi-mystical mantra.</p>\n\n<p>I bet the SEC would say that’s market manipulation, but I am not so sure. I suppose we did our trading “for the purpose of inducing the purchase or sale of such security by others,” but not by deceiving them about what’s going on. “Join us in a fun game of chicken,” was our basic message here. Did we try “to create or effect a price or price trend that does not reflect legitimate forces of supply and demand”? Who’s to say what’s “legitimate”? Surely the price did not reflect expectations about future cash flows, but just as surely the price reflected supply and demand: We all wanted to own it because we were having fun, so the price went up. </p>\n\n<p>Anyway, the actual GameStop situation. I suppose it’s possible that someone on Reddit has posted fake rumors about GameStop’s business, but I haven’t seen any. The posts I’ve seen about GameStop have been either (1) substance-free “GME to $1,000” stuff or (2) arguments based on publicly available information plus personal opinion and guesses about the future. They might be wrong or exaggerated or misstated, but it’s not, like, core fraud.</p>\n\n<p>Is it manipulation? Well, there is not a lot of deception here. No one is buying GameStop stock because they think to themselves “boy this stock is going up a lot on heavy volume, must be a bunch of big institutions who see fundamental value here.” There is absolutely wall-to-wall coverage of GameStop in financial media, and it pretty much all says “lol those crazy redditors, pushing up the stock for no reason.” So at worst this is a sort of honest pump, people banding together to do it for the lolz and hoping they can get out before it collapses. </p>\n\n<p>I’m not even convinced it’s that though. The stock closed Friday at its all-time high. Roaring Kitty was up $11 million. Everyone came back on Monday and did it again. My model here—and I should emphasize this is purely a guess—is that the people most identified with the GameStop trade on Reddit, at this point, are much more interested in securing their legendary status on Reddit than they are in taking profits at the expense of whoever came in later. </p>\n\n<p>You could have other miscellaneous theories about words like “collusion” and “short squeezes.” Is it illegal for people to band together to all buy stock at the same time? “If institutional investors had an internet site or chat where they arguably cajoled each other or coordinated to buy stock to move the price higher,” one reader asked me by email, “wouldn’t that be stock manipulation and wouldn’t the SEC get involved?” </p>\n\n<p>Well, a while back there were reports that the SEC was looking into hedge fund “idea dinners,” where hedge funds get together to pitch each other on their third-best ideas. 1  That sounds like institutional investors having a chat where they cajole each other to buy stock in a coordinated way. But the SEC wasn’t concerned about market manipulation. The SEC was concerned that the hedge funds might be a “group” under the securities laws, if they teamed up to own more than 5% of the stock, and that they hadn’t made the necessary group disclosures. This is less of a concern for small retail investors, just because they are less likely to get above 5% of the company. 2  Also it doesn’t seem like the idea-dinner probe went anywhere. Telling your friends that you like a stock and they should buy it is, more or less, fine.</p>\n\n<p>Or is a short squeeze illegal? One popular topic on WallStreetBets is recalling stock borrow. Kochkodin’s article describes one call to action in April 2020:</p>\n\n<blockquote>\n<p>The final all-caps sentence imploring GameStop owners to call their brokers and tell them to not lend them short opened a new theater to wage war against short-sellers.</p>\n\n<p>It’s a little known fact, and one that you wouldn’t expect to learn on a Reddit message board, that a stockholder can request that shares they own outright not be lent out to short-sellers.</p>\n</blockquote>\n\n<p>If everyone bands together to recall stock borrow, there will be fewer shares available for short sellers, and the short sellers will be forced to cover their bets by buying stock, pushing the price up more. Is that illegal? Is it illegal to make borrow impossible with the goal of messing with short sellers?</p>\n\n<p>The SEC might think so, actually. In 2012, it brought charges against Phil Falcone and Harbinger Capital Partners LLC for, among other things, having “conducted an illegal ‘short squeeze’ to manipulate bond prices.” I confess I do not understand why the SEC thought a short squeeze was illegal, or what they think the fraud was, but the Falcone short squeeze is one of my all-time favorite financial stories and I advise you to read the complaint for humor and inspiration. Quick summary: Falcone owned some bonds of a company called MAAX Holdings Inc. “After hearing rumors that a Wall Street financial services firm was shorting the MAAX bonds and also encouraging its customers to do the same, Falcone decided to seek revenge.” So he bought all the MAAX bonds. Then he bought more: Short sellers would borrow MAAX bonds (presumably from him), and then sell them to him, so that he ended up with “22 million more bonds than MAAX had ever issued.” Then he stopped lending them out, forcing the short sellers to buy bonds to cover their shorts. But there were no bonds to be bought, since he owned them all (and more). At some point an executive from the “Wall Street firm” called up Falcone to talk about the situation, and even in the SEC’s dry language you can tell that it was one of the greatest conversations in all of Wall Street history:</p>\n\n<blockquote>\n<p>At some point, the conversation turned to the trading in the MAAX bonds. The senior officer asked Falcone how the Wall Street firm might satisfy its obligation to Harbinger. Falcone stated that the Wall Street firm should just keep bidding for the bonds. Falcone acknowledged that the Wall Street firm would suffer some losses doing so, but told the senior officer and the others that sometimes you are just on the wrong side of a trade.</p>\n\n<p>In the course of this discussion, Falcone stated that he knew that the short position in the MAAX zips had created a “long” position in excess of the issue size. When the senior officer asked how he could possibly know this, Falcone stated that he was working the position himself and that he (i.e., Harbinger) had acquired approximately 190 million bonds. The senior officer and the other the Wall Street firm personnel were stunned.</p>\n</blockquote>\n\n<p>“Just keep bidding for the bonds,” “sometimes you are just on the wrong side of a trade,” I love it so much.</p>\n\n<p>Where were we? Oh, right, GameStop. I suppose a really coordinated successful effort to squeeze borrow might count as market manipulation, at least in the SEC’s view, but I’m not sure how serious this effort was. In any case it hasn’t worked. “Despite a punishing two weeks and relentless chat-room taunting, GameStop Corp. haters are showing no signs of surrender,” Bloomberg reported yesterday; short interest has barely budged, and there are still shares available to borrow.</p>\n\n<p>I don’t know. Taking a step back: Should the SEC care about all of this? On the one hand, I do not see a whole lot of deception in this GameStop situation. The SEC’s core concerns, about people lying about stocks and tricking the innocent, don’t seem especially implicated here; everyone is having reasonably informed and consensual fun. </p>\n\n<p>On the other hand it is all pretty dumb? Like if you are a securities regulator, you can think of your job narrowly as preventing people from lying about stocks, or more broadly as encouraging capital formation and fostering confidence in markets and moving markets toward efficiency and perfection. And, you know, this is the opposite of that. A popular conclusion from the GameStop story is “well I guess the stock market is nonsense now,” and I’m not sure that conclusion is wrong. Seems like the sort of thing the SEC wouldn’t like. But what can they do about it?</p>\n\n<p>Here&#39;s the full article, there&#39;s a bunch of linked sources where he adds resources on previous occurrences or other court cases/SEC actions, but I&#39;m way too lazy to edit all of those links in: <a href=\"https://www.bloomberg.com/opinion/articles/2021-01-26/will-wallstreetbets-face-sec-scrutiny-after-gamestop-rally\">https://www.bloomberg.com/opinion/articles/2021-01-26/will-wallstreetbets-face-sec-scrutiny-after-gamestop-rally</a></p>\n</div><!-- SC_ON -->",
  "score": 276,
  "permalink": "/r/investing/comments/l5jewj/i_wanted_to_share_matt_levines_discussion_on/",
  "subreddit": "investing",
  "id": "l5jewj",
  "is_self": true,
  "media": null,
  "is_video": false
}