{
  "author": "pixelman1",
  "original_created_utc": 1632416023,
  "title": "Regardless of what you're invested in, if you call people idiots and actively wish they lose all their money for investing poorly, you're an asshole.",
  "created_utc": 1632421857,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I got in because of Doge. I have since sold, studied, and replaced them with other coins. Some others might have not gotten the chance or capability to do their due diligence. Some people have been misinformed or been lied to. Don&#39;t call the unfortunate idiots. To these people, Safemoon (or Doge or whatever) is just as solid of a plan as you think Bitcoin is. Surely you know they&#39;re wrong, but they don&#39;t. They&#39;re not intentionally putting their money on a losing horse - they&#39;re just unaware that the horse has a broken leg.</p>\n\n<p>I hope everyone makes money off this, bitcoin or shitcoin. Although some people will lose money, you don&#39;t need to &quot;wish&quot; they lose it. Don&#39;t be a dick. We&#39;re all in Crypto vs Fiat. They&#39;re just in the 101 phase while you&#39;ve already moved on. </p>\n\n<p>We&#39;re all friends. Good luck to all.</p>\n</div><!-- SC_ON -->",
  "score": 214,
  "permalink": "/r/CryptoCurrency/comments/ptzh8f/regardless_of_what_youre_invested_in_if_you_call/",
  "subreddit": "CryptoCurrency",
  "id": "ptzh8f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I got in because of Doge. I have since sold, studied, and replaced them with\nother coins. Some others might have not gotten the chance or capability to do\ntheir due diligence. Some people have been misinformed or been lied to. Don't\ncall the unfortunate idiots. To these people, Safemoon (or Doge or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が入ったのはDOGEのおかげです。それ以来、売ったり、調べたり、他のコインに変えたりしています。\n他のコインに変えました。他の人たちは、十分な調査をする機会や能力を得られなかったかもしれません。\n機会や能力を得られなかった人もいるでしょう。誤った情報を得たり、嘘をつかれたりした人もいるでしょう。不幸な人を\n不幸な人たちをバカ呼ばわりしないでください。そんな人たちに、Safemoon（またはDoge or...",
      "title": "自分が何に投資しているかに関わらず、人をバカ呼ばわりしたり、投資がうまくいかずに全財産を失うことを積極的に願ったりするなら、あなたはアホです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是因为Doge而进入的。我后来卖掉了，研究了，并以其他硬币代替了它们。\n其他钱币。其他一些人可能没有机会或能力去做\n他们的尽职调查。有些人被误导了，或者被骗了。不要\n说这些不幸的人是白痴。对这些人来说，Safemoon（或Doge或...",
      "title": "不管你投资的是什么，如果你说别人是白痴，并积极希望他们因为投资不善而失去所有的钱，你就是一个混蛋。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是因爲Doge而進入的。我後來賣掉了，研究了，並以其他硬幣代替了它們。\n其他錢幣。其他一些人可能沒有機會或能力去做\n他們的盡職調查。有些人被誤導了，或者被騙了。不要\n說這些不幸的人是白癡。對這些人來說，Safemoon（或Doge或...",
      "title": "不管你投資的是什麼，如果你說別人是白癡，並積極希望他們因爲投資不善而失去所有的錢，你就是一個混蛋。"
    }
  ]
}