{
  "author": "chance_waters",
  "original_created_utc": 1625541180,
  "title": "A couple of lessons I learned from my many fuck ups over my 5 years as a retail investor in Crypto",
  "created_utc": 1625560719,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Going through this sideways movement it&#39;s probably a good time to take stock and make sure your ducks are in a row before any crazy swings in either direction, all of this advice is commonly available, but it&#39;s just really worth reiterating for newer investors, don&#39;t get owned the way I&#39;ve been owned so many times.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Not your keys, not your coins.</strong></li>\n</ul>\n\n<p>You hear this one everywhere, but I cannot stress how true it is. In 2019 I lost a personally significant amount of crypto in the largest oceanic crypto exchange Cryptopia, which was an established and respected exchange that was viewed as low risk. Despite owning a hardware wallet and having the capability to transfer my funds off, and despite not being a super active trader, I left them.</p>\n\n<p>While I may one day get some of those coins back, I lost my entire Ethereum holdings from that exchange, in an effort to save like $20 worth of fees.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Even if they are your keys, you better have your fucking seed</strong></li>\n</ul>\n\n<p>I think you will struggle to find a retail investor who came in before the 2017 run who hasn&#39;t at one point or another lost a seed code or mnemonic. If you&#39;re moving funds to your own wallet, please for the love of god make sure that seed code is written down in at least two places <strong>securely</strong>, ideally with some form of obfuscation that you practice consistently across all your codes, so that somebody who finds the paper can&#39;t steal your funds. This might mean swapping the position of a few words consistently across everything, but there should be some rule in place which adds an extra layer of security. Remember also, if you only have these codes in one place, then should anything ever go wrong you may lose everything.</p>\n\n<p>This goes for 2FA codes too, sure you can probably go through an arduous process to get into an account where you&#39;ve lost 2FA, but not necessarily, and it&#39;s completely avoidable if you just back up your seeds. At some point you will lose or break your phone.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Use 2FA everywhere possible.</strong></li>\n</ul>\n\n<p>Another life changingly dumb fuckup of mine. In 2016 I had a decent chunk of bitcoin on an Australian exchange. I had 2FA enabled for login, but I did not have 2FA enabled for transfers off of the exchange.</p>\n\n<p>I had been mining crypto casually and had used a github mining application to do so. You can probably see where this is going, I got R.A.T&#39;d, almost all my funds remained safe on the other exchanges, but I lost everything from that exchange since the hacker didn&#39;t require my 2FA to drain the account.</p>\n\n<p>If you can double 2FA then do it. Also, don&#39;t trust SMS codes, bad actors have ways of spoofing your number, and don&#39;t trust your email since if somebody gets access to your computer it&#39;s likely they can access your 2FA that way.</p>\n\n<p>It&#39;s also worth investing in good protection, something which can also scan for rootkits, I use Malwarebytes, but there&#39;s a lot of options.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Always double-check your transfer addresses and send a test transaction.</strong></li>\n</ul>\n\n<p>I haven&#39;t been burned this way, but I&#39;ve been close.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>You don&#39;t lose or make a dollar until you sell</strong></li>\n</ul>\n\n<p>I can&#39;t even imagine how many times during my journey through the first bull run and following alt coin seasons that I either didn&#39;t take profits, or sold during heavy crashes. There is nothing wrong with making inefficient trades, but there&#39;s a lot wrong with selling a long term project at the bottom, or greeding into losing what are already huge margins on some alt you aren&#39;t particularly attached to.</p>\n\n<p>It can be nice, or depressing, looking at the imaginary FIAT number next to your cryptos, but it&#39;s not real. It doesn&#39;t matter how high or how small that number is, one coin is one coin. Before deciding to sell or buy, take stock of your personal opinion on the project you&#39;re selling or buying.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>You don&#39;t need to close out your entire position when selling.</strong></li>\n</ul>\n\n<p>Not my fuckup, but my younger brothers. He and his friend sold what later became around a million dollars worth of doge, for a few hundred dollars. At the time if he had left just 10% of his doge there, he&#39;d now have a house deposit.</p>\n\n<p>There&#39;s nothing wrong with setting some insane multiple sell orders, after all it seemed ridiculous when BTC was at $1 to leave a dozen BTC in your wallet as a maybe one day, but even if you later sold these for $100, you&#39;d have drastically multiplied your exit, and if you&#39;d left a few more BTC when you exited at $100...</p>\n\n<p>As a mental exercise, it may be worth asking yourself &#39;what would happen to a sliver of this position if it ever reached the Ethereum market cap&#39; - if the answer to that is a new lambo, just leave your tiny pie in the pool.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/oemj7f/a_couple_of_lessons_i_learned_from_my_many_fuck/",
  "subreddit": "CryptoCurrency",
  "id": "oemj7f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Going through this sideways movement it's probably a good time to take stock and\nmake sure your ducks are in a row before any crazy swings in either direction,\nall of this advice is commonly available, but it's just really worth reiterating\nfor newer investors, don't get owned the way I've been…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このような横ばいの動きの中では、どちらかの方向に大きく変動する前に、自分の状況を把握して\nこのような横ばいの動きの中では、どちらかの方向に狂った動きをする前に、自分のカモを確認する良い機会だと思います。\nこれらのアドバイスはすべて一般的に入手可能なものですが、本当に再確認する価値があると思います。\n新しい投資家の方は、私のように所有されないように...。",
      "title": "暗号の個人投資家としての5年間の多くの失敗から学んだいくつかの教訓です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "经历了这种横向运动后，可能是一个很好的时间来进行评估并\n在任何方向的疯狂波动之前，确保你的鸭子都在一排。\n所有这些建议都是常见的，但真的值得重申一下\n对于新的投资者，不要像我一样被人拥有......",
      "title": "我从我5年来在加密货币零售投资者中的多次失败中吸取了一些教训"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "經歷了這種橫向運動後，可能是一個很好的時間來進行評估並\n在任何方向的瘋狂波動之前，確保你的鴨子都在一排。\n所有這些建議都是常見的，但真的值得重申一下\n對於新的投資者，不要像我一樣被人擁有......",
      "title": "我從我5年來在加密貨幣零售投資者中的多次失敗中吸取了一些教訓"
    }
  ]
}