{
  "author": "Mourtzopholous",
  "original_created_utc": 1636431595,
  "title": "How \"byzantine\" was Byzantine government?",
  "created_utc": 1636469299,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Wiktionary defines &quot;byzantine&quot; as meaning &quot;Overly complex or intricate&quot; or &quot;Of a devious, usually stealthy, manner or practice&quot;.</p>\n\n<p>Collins Dictionary specifically lists it as &quot;criticis[ing] a system because it seems complicated or secretive.&quot;</p>\n\n<p>I am aware that the administration of the Eastern Roman Empire was complex and can be difficult to understand, but is the negative connotation of the adjective &quot;byzantine&quot; deserved? Was Eastern Roman governance complex to the point of being cumbersome and self-defeating? If it was not as lethargic or corrupt as these definitions imply, where did this connotation come from?</p>\n\n<p>Edit: Apologies if this question is too broad or covers too much time, I would be happy to hear about the efficiency of the Byzantine government in specific seminal periods e.g. in the period of Justinian&#39;s legal reforms or in the years leading up to the Sack of Constantinople and the Latin Empire. Was there one particular dynasty or emperor that created this reputation for inefficiency?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/qpvlu4/how_byzantine_was_byzantine_government/",
  "subreddit": "AskHistorians",
  "id": "qpvlu4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Wiktionary defines \"byzantine\" as meaning \"Overly complex or intricate\" or \"Of a\ndevious, usually stealthy, manner or practice\".\n\nCollins Dictionary specifically lists it as \"criticis[ing] a system because it\nseems complicated or secretive.\"\n\nI am aware that the administration of the Eastern Roman…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ウィクショナリーの定義によると、\"ビザンチン \"とは、「過度に複雑な、または入り組んだ」または「巧妙な、通常はこっそりとした方法や習慣の」という意味です。\n巧妙な、通常はこっそりとした、方法や習慣」という意味です。\n\nまた、Collins Dictionaryでは、「複雑で秘密めいたシステムを批判する」とされています。\n批判すること \"とあります。\n\n私が知っているのは、東ローマ帝国の行政は...",
      "title": "ビザンチン政府はどのように「ビザンチン」だったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "维基词典将 \"拜占庭 \"定义为 \"过于复杂或错综复杂 \"或 \"狡猾的方式或做法 \"的意思。\n狡猾的，通常是隐蔽的，方式或做法\"。\n\n柯林斯字典特别将其列为 \"批评一个系统，因为它\n因为它看起来很复杂或很隐蔽\"。\n\n我知道，东罗马的行政...",
      "title": "拜占庭政府是如何 \"拜占庭 \"的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "維基詞典將 \"拜占庭 \"定義爲 \"過於複雜或錯綜複雜 \"或 \"狡猾的方式或做法 \"的意思。\n狡猾的，通常是隱蔽的，方式或做法\"。\n\n柯林斯字典特別將其列爲 \"批評一個系統，因爲它\n因爲它看起來很複雜或很隱蔽\"。\n\n我知道，東羅馬的行政...",
      "title": "拜占庭政府是如何 \"拜占庭 \"的？"
    }
  ]
}