{
  "author": "Weary-Technology6425",
  "original_created_utc": 1635750675,
  "title": "Why are black people allowed to be racist?",
  "created_utc": 1635767079,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Okay so before people go off and say “racism has to be systematic oppression” let me just say that’s not what I’m talking about I just don’t know another word for it. </p>\n\n<p>I mean like why is it ok that black people are always talking about and generalizing white people in media? “You look white” or “you sound white” or “only white people do that.” \nBut if white people said something like that in a movie or show about black people everyone would be offended. </p>\n\n<p>I’m white and I don’t really give a shit about what anyone says about white people, I’m just curious why no one seems offended by this since people seem offended by anything anymore? I’m really not trying to be an asshole or be insensitive I just actually don’t understand</p>\n</div><!-- SC_ON -->",
  "score": 121,
  "permalink": "/r/TooAfraidToAsk/comments/qk8mp7/why_are_black_people_allowed_to_be_racist/",
  "subreddit": "TooAfraidToAsk",
  "id": "qk8mp7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Okay so before people go off and say “racism has to be systematic oppression”\nlet me just say that’s not what I’m talking about I just don’t know another word\nfor it.\n\nI mean like why is it ok that black people are always talking about and\ngeneralizing white people in media? “You look white” or “you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人種差別は組織的な抑圧でなければならない」と言われる前に、私が言っておきたいことがあります。\n私が言っているのはそういうことではなくて、他の言葉を知らないだけなんです。\n他の言葉を知らないだけです。\n\nつまり、なぜ黒人がいつもメディアで白人のことを話題にしたり、一般化したりするのがいいのか、ということです。\nメディアの中で黒人が白人を話題にしたり、一般化したりするのはなぜいいのか？あなたは白人のようだ」とか「あなたは...」とか。",
      "title": "なぜ黒人は人種差別をしても許されるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，在人们说 \"种族主义必须是系统性压迫 \"之前\n我只想说，我不是在说这个，我只是不知道另一个词\n词。\n\n我的意思是，为什么黑人总是在媒体上谈论和概括白人就可以了呢？\n在媒体上对白人的概括？\"你看起来像白人 \"或 \"你...",
      "title": "为什么黑人可以成为种族主义者？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，在人們說 \"種族主義必須是系統性壓迫 \"之前\n我只想說，我不是在說這個，我只是不知道另一個詞\n詞。\n\n我的意思是，爲什麼黑人總是在媒體上談論和概括白人就可以了呢？\n在媒體上對白人的概括？\"你看起來像白人 \"或 \"你...",
      "title": "爲什麼黑人可以成爲種族主義者？"
    }
  ]
}