{
  "author": "DopestDopeHead",
  "the_new_excerpt": "Let me start by saying im not suicidal but contemplate death and it's endless\npossibilities on what comes after.\n\nHow insignificant all of our actions are in the grand scheme of things and it's\nasphyxia-like grip.\n\nI love my wife and kids without a shadow of a doubt.\n\nEverything I do is for them,…",
  "original_created_utc": 1619788089,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最初に言っておくと、私は自殺願望はありませんが、死とそれに伴う無限の可能性について考えています。\n可能性について考えています。\n\n物事の全体像の中で我々の行動がどれほど些細なものか、そしてそれは\n窒息死のようなものです。\n\n私は妻と子供たちを疑いもなく愛しています。\n\n私がすることはすべて彼らのためであり、...",
      "title": "死んだばかりでも「大丈夫」という人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我要说的是，我没有自杀倾向，但我在考虑死亡和它的无限可能性。\n后的可能性。\n\n我们所有的行为在事物的大计划中是多么的微不足道，以及它的\n窒息般的控制力。\n\n我爱我的妻子和孩子，没有任何疑问。\n\n我所做的一切都是为了他们，...",
      "title": "如果他们刚死了，还有人 \"没事 \"吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我要說的是，我沒有自殺傾向，但我在考慮死亡和它的無限可能性。\n後的可能性。\n\n我們所有的行爲在事物的大計劃中是多麼的微不足道，以及它的\n窒息般的控制力。\n\n我愛我的妻子和孩子，沒有任何疑問。\n\n我所做的一切都是爲了他們，...",
      "title": "如果他們剛死了，還有人 \"沒事 \"嗎？"
    }
  ],
  "title": "Is anyone else \"fine\" if they just died?",
  "created_utc": 1619807938,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let me start by saying im not suicidal but contemplate death and it&#39;s endless possibilities on what comes after.</p>\n\n<p>How insignificant all of our actions are in the grand scheme of things and it&#39;s asphyxia-like grip.</p>\n\n<p>I love my wife and kids without a shadow of a doubt.</p>\n\n<p>Everything I do is for them, but I don&#39;t want to be a battery in the machine just to run out and be replaced after a certain expiration date.</p>\n\n<p>Everything is bland, tasteless but also beautiful and vibrant. </p>\n\n<p>The more knowledge acquired, the clearer the world&#39;s issues become.</p>\n\n<p>I&#39;m alive when spectacular things happen to me but for the most part I&#39;m just coasting until the next cool thing happens.</p>\n\n<p>Then I have these moments where I think to myself\n&quot;Come on DDH, how can YOU complain about xyz when there are FAR worse off people than you?&quot;</p>\n\n<p>So if I go tomorrow, today, or 7 minutes from now.</p>\n\n<p>That&#39;s okay with me.</p>\n\n<p>Tl;dr Am I the only one in feeling this way?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/n1th2e/is_anyone_else_fine_if_they_just_died/",
  "subreddit": "TooAfraidToAsk",
  "id": "n1th2e",
  "is_self": true,
  "media": null,
  "is_video": false
}