{
  "author": "AnAbsoluteRetard",
  "original_created_utc": 1626610151,
  "title": "Is it inevitable to lose any joy in life? Does everyone stop enjoying things after turning 20 something years old?",
  "created_utc": 1626639769,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s a weekend and every 10 minutes I either force myself to watch another episode on Netflix which I don&#39;t really want to watch, but have nothing better to do, or start a video game and turn it off after another 10 minutes because I don&#39;t really feel like playing either.</p>\n\n<p>Every day feels like a chore, I am trying to fill it in with pointless activities but there is nothing that I could get hooked on. I remember when I was younger I could play literally the entire day and never had enough, and now 1 hour of video games feels exhausting</p>\n\n<p>Is this a hard barrier if you are in your mid twenties and having to work 7-8 hours per day sucks all life out of you, or is there a way to recover?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/NoStupidQuestions/comments/ompceh/is_it_inevitable_to_lose_any_joy_in_life_does/",
  "subreddit": "NoStupidQuestions",
  "id": "ompceh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's a weekend and every 10 minutes I either force myself to watch another\nepisode on Netflix which I don't really want to watch, but have nothing better\nto do, or start a video game and turn it off after another 10 minutes because I\ndon't really feel like playing either.\n\nEvery day feels like a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "週末になると、10分ごとに無理してNetflixで別のエピソードを見ることになります。\nNetflixの別のエピソードを無理やり見るか、ゲームを始めても10分後には消してしまう。\nゲームを始めても、10分後には消してしまう。\nビデオゲームを始めても、10分後にはゲームをする気にならないので消してしまう。\n\n毎日が、まるで...。",
      "title": "人生の喜びを失うことは避けられないのでしょうか？誰もが20歳を過ぎると物事を楽しめなくなるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是一个周末，每隔10分钟我就会强迫自己再看一集Netflix上的节目。\n我要么强迫自己再看一集Netflix上的节目，其实我并不想看，但没有更好的办法。\n或者开始玩一个视频游戏，然后在10分钟后关掉，因为我真的不想玩。\n因为我也不太喜欢玩。\n\n每一天都感觉像一个...",
      "title": "在生活中失去任何快乐是不可避免的吗？是否每个人在20多岁之后就不再享受事情了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是一個週末，每隔10分鐘我就會強迫自己再看一集Netflix上的節目。\n我要麼強迫自己再看一集Netflix上的節目，其實我並不想看，但沒有更好的辦法。\n或者開始玩一個視頻遊戲，然後在10分鐘後關掉，因爲我真的不想玩。\n因爲我也不太喜歡玩。\n\n每一天都感覺像一個...",
      "title": "在生活中失去任何快樂是不可避免的嗎？是否每個人在20多歲之後就不再享受事情了？"
    }
  ]
}