{
  "author": "vjeva",
  "original_created_utc": 1629282119,
  "title": "I have a investment cycle that works for me, and I'd like to share it with all of you.",
  "created_utc": 1629297136,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Investing isn&#39;t that hard but it is time consuming. If you follow a particular pattern, you should be fine. There is one important factor in all of this, I don&#39;t do short-term trading, I only do long-term or once I achieved my initial goals that are clearly defined. </p>\n\n<p>How does this process work? Here is my investing cycle: </p>\n\n<h1>STEP 1: DYOR </h1>\n\n<p>This is the starting point if you are just starting, but I love to use this also as a Quarterly task where I evaluate my existing positions. </p>\n\n<p>The main goal is to research projects and coins. I usually stick to the TOP 200 projects based on marketcap. The main goal is to create a shortlist of coins that have some long-term potential. I use several sites for this process such as coinmarketcap, coingecko, reddit communities, searching google by finding trusted news portals, coins website, charts on exchanges, verified reports online etc. </p>\n\n<p>I never ever join any Telegram groups in order to do my DYOR, it&#39;s seriously affecting your ability to objectively judge the potential of an individual coin. </p>\n\n<p>The end result of this step is to gather and collect between 10 - 25 projects that have potential. Diversifying your portfolio is a advantage. </p>\n\n<h1>STEP 2: MAIN LIST </h1>\n\n<p>This is the second part, and it takes most of my time. I usually spend a couple of hours per day to evaluate all the coins that have been picked in step 1. </p>\n\n<p>This step requires some in depth analysis as I am targeting my focus on some important metrics and ask some important questions such as: </p>\n\n<ul>\n<li>Tokenomics and coin allocation, is it decentralized or centralized? </li>\n<li>Technology and scalability of the network. Can you effectively scale it based on the volumes? </li>\n<li>Security layers within the network. How secure is the network?</li>\n<li>Main use case and what challenge does this coin try to solve? </li>\n<li>Existing Partnerships - how good are they? </li>\n<li>Price expectations based on macroeconomics, what are the chances of potential market manipulations and possible rug pulls? </li>\n</ul>\n\n<p>Once I get detailed answers to these above-mentioned questions, I do my shortlisting. Usually, it ends up by choosing 5-10 coins which have met the above criteria. </p>\n\n<h1>STEP 3: FUND ALLOCATION</h1>\n\n<p>Once I managed step 1 and 2, the next step is ranking each coin from the one with the biggest potential and value towards the lowest. Let&#39;s assume that I have chosen 10 coins, and in many cases, 50%-60% of my funds are allocated to the TOP 3 coins equally while the remaining 50% or 40% are equally allocated to the remaining 7 coins. </p>\n\n<p>In this step it&#39;s important to establish a clear guideline how to rank these coins, usually taking in consideration all the answers acquired during step 2. </p>\n\n<h1>STEP 4: SET YOUR GOALS</h1>\n\n<p>This is important. How will you measure your success? Define in the beginning the desired outcome. I usually ask myself the following two questions which define my goals: </p>\n\n<ul>\n<li>What is my target value?</li>\n<li>What is the timeline - at what point and price am I taking out profits? </li>\n</ul>\n\n<h1>STEP 5: ANALYZE THE MARKET - INVEST DURING A BEAR MARKET OR DURING DIPS. </h1>\n\n<p>I avoid investing once the market is in an upward trend, such as in the middle of a bull market. Take time to analyze the market by doing some simple technical analysis. Trading view is a great example, you can analyze it there as it&#39;s offering a lot of valuable tools to do so. <a href=\"https://coinmarketcap.com/alexandria/article/how-to-use-tradingview-the-best-crypto-trading-tool-for-investors\">HERE</a> is a great guide for trading view. </p>\n\n<p>If you can&#39;t time the market, it&#39;s not a worry, that is not easy to achieve, as it takes a lot of experience. I like to get into the market if the dip is more than 10% on a weekly basis or if the price is at least 20% below the last ATH. </p>\n\n<h1>STEP 6: DCA (DOLLAR COST AVEREGING) </h1>\n\n<p>This is a process of reinvesting into your existing portfolio during dips and bear markets. Define a strategy and a budget which you will invest into your portfolio during a defined period of time. </p>\n\n<p>For example in my case I am dedicating a fixed monthly amount which I will divert to my portfolio. I am waiting for a good timing within a month to enter the market and allocate my funds to a certain number of coins which I believe will perform better or which are undervalued based on the facts gathered from step 2 </p>\n\n<h1>STEP 7: TRACK PERFOMANCE AND EXCLUDE EMOTIONS</h1>\n\n<p>Track you coins on a daily and weekly basis. Don&#39;t spend too much time on it and try to avoid FUD and FOMO. The most important part in crypto is to exclude all emotions - always stick to your strategy and to the answers that you gathered during step 1 and 2. </p>\n\n<h1>STEP 8: EVALUATE AND UPDATE YOUR PORTFOLIO EACH QUARTER </h1>\n\n<p>A lot of things tend to change during a period of 3 months. I am usually having a Q session where I repeat step 1 and 2 based on new findings during that period. This may require some re-allocation within your account, or it may happen that you will exclude a certain coin in order to add a new one. </p>\n\n<p>This is my strategy, it is giving me good results and I hope this could help you all to build your own trading strategy.  </p>\n</div><!-- SC_ON -->",
  "score": 157,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/uhb_KRaHxJAhjhEDzf94IvsMC7BgMNPKPS4n2I77mwo.jpg?auto=webp&s=f05ac02536cb04516633e50439b8d6a0352ea711",
          "width": 900,
          "height": 900
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/uhb_KRaHxJAhjhEDzf94IvsMC7BgMNPKPS4n2I77mwo.jpg?width=108&crop=smart&auto=webp&s=43215a45d340388055fb9fe4a69118ee13e3f5c0",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/uhb_KRaHxJAhjhEDzf94IvsMC7BgMNPKPS4n2I77mwo.jpg?width=216&crop=smart&auto=webp&s=e5f488e0c774ba394f686b431e54de7648900e3b",
            "width": 216,
            "height": 216
          },
          {
            "url": "https://external-preview.redd.it/uhb_KRaHxJAhjhEDzf94IvsMC7BgMNPKPS4n2I77mwo.jpg?width=320&crop=smart&auto=webp&s=d007a8f4cdd604ad0dcd01fdddcc2f45dd04d59f",
            "width": 320,
            "height": 320
          },
          {
            "url": "https://external-preview.redd.it/uhb_KRaHxJAhjhEDzf94IvsMC7BgMNPKPS4n2I77mwo.jpg?width=640&crop=smart&auto=webp&s=77683b685c9998d6a0ea395910cde4eb24a7dc84",
            "width": 640,
            "height": 640
          }
        ],
        "variants": {},
        "id": "M15sP_ga2mm0N5KQqsG5WPUluq9Ujw7foVyD0V_ko-k"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/p6odna/i_have_a_investment_cycle_that_works_for_me_and/",
  "subreddit": "CryptoCurrency",
  "id": "p6odna",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Investing isn't that hard but it is time consuming. If you follow a particular\npattern, you should be fine. There is one important factor in all of this, I\ndon't do short-term trading, I only do long-term or once I achieved my initial\ngoals that are clearly defined. \n\nHow does this process work?…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "投資はそれほど難しいものではありませんが、時間がかかります。特定のパターンに従えば\nパターンに従えば問題ありません。この中で一つ重要な要素があります。\n私は短期的な取引はしません。長期的な取引か、明確に定義された初期の目標を達成した後にのみ行います。\n長期的な取引を行うだけです。 \n\nこのプロセスはどのように行われるのでしょうか...。",
      "title": "私には自分に合った投資サイクルがありますので、皆さんにもご紹介したいと思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "投资并不难，但很耗费时间。如果你遵循一个特定的\n模式，你应该会没事的。在这一切中，有一个重要的因素，我\n我不做短期交易，我只做长期交易，或者一旦我实现了我最初的\n清楚定义的目标。 \n\n这个过程是如何进行的呢...",
      "title": "我有一个适合我的投资周期，我想与你们所有人分享。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "投資並不難，但很耗費時間。如果你遵循一個特定的\n模式，你應該會沒事的。在這一切中，有一個重要的因素，我\n我不做短期交易，我只做長期交易，或者一旦我實現了我最初的\n清楚定義的目標。 \n\n這個過程是如何進行的呢...",
      "title": "我有一個適合我的投資週期，我想與你們所有人分享。"
    }
  ]
}