{
  "author": "anotherjohnishere",
  "original_created_utc": 1631147222,
  "title": "Our favorite stablecoin is popping off",
  "created_utc": 1631172649,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Algo gang stand up! </p>\n\n<p>We&#39;re on the move fellas and ladies and everyone in between, we all knew Algo would have it&#39;s time in the sun. </p>\n\n<p>Remember when we have large pumps like this that we can use part of our gains to help those who need it; your ETH, your ALGO, your moons can help a person more than you know. </p>\n\n<p>It&#39;s our obligation to help out fellow man, we&#39;re all god. We&#39;re all consciousness, we&#39;re all everything all at once. Your time in your vessel is finite, but your soul is infinite.</p>\n\n<p>Your don&#39;t get to take the money with you, so help a person less fortunate than you. </p>\n\n<p><strong>Treat everyone like god in drag</strong> </p>\n\n<p>You are love. </p>\n\n<p>The culture of crypto should be when we pump we help each other. We are greater than our gains, than our money, or than ourselves. </p>\n\n<p>Be here now.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/pkms6y/our_favorite_stablecoin_is_popping_off/",
  "subreddit": "CryptoCurrency",
  "id": "pkms6y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Algo gang stand up!\n\nWe're on the move fellas and ladies and everyone in between, we all knew Algo\nwould have it's time in the sun.\n\nRemember when we have large pumps like this that we can use part of our gains to\nhelp those who need it; your ETH, your ALGO, your moons can help a person more\nthan…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アルゴギャングが立ち上がる\n\n私たちは移動しています 男性も女性も、そしてその中間の人たちも、みんなAlgoが太陽の下で活躍することを知っていました。\n太陽の下で時間を過ごすことになるでしょう。\n\nこのような大規模なパンプスがあるときは、利益の一部を必要としている人たちのために使うことができることを忘れないでください。\nあなたのETH、あなたのALGO、あなたの月は、それを必要としている人々を助けることができます。\nよりも...",
      "title": "私たちのお気に入りの安定したコインが飛び出している"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "阿尔戈帮站起来了!\n\n我们在行动，伙计们和女士们以及介于两者之间的所有人，我们都知道Algo\n会有它在阳光下的时间。\n\n记住，当我们有这样的大泵时，我们可以用我们的部分收益来\n帮助那些需要帮助的人；你的ETH，你的ALGO，你的月亮可以帮助一个人比\n比...",
      "title": "我们最喜欢的稳定币正在爆仓"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "阿爾戈幫站起來了!\n\n我們在行動，夥計們和女士們以及介於兩者之間的所有人，我們都知道Algo\n會有它在陽光下的時間。\n\n記住，當我們有這樣的大泵時，我們可以用我們的部分收益來\n幫助那些需要幫助的人；你的ETH，你的ALGO，你的月亮可以幫助一個人比\n比...",
      "title": "我們最喜歡的穩定幣正在爆倉"
    }
  ]
}