{
  "author": "Kingswagyolo",
  "original_created_utc": 1659759130,
  "title": "[Possible TW] How is Chris Brown still active in the music industry?",
  "created_utc": 1659775418,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I used to love Chris Brown&amp;#39;s music, and would say I definitely used to be a fan. Then it all came out, and there is actual verified proof that he is a physical abuser. BUT, other artists still actively collaborate with him, and his music is still used in film and TV. &lt;/p&gt;\n\n&lt;p&gt;I get that he has a fan base, but I don&amp;#39;t understand how other artists collaborating with him aren&amp;#39;t seen as collaborating with an abuser and reviled for it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/whf4oz/possible_tw_how_is_chris_brown_still_active_in/",
  "subreddit": "TooAfraidToAsk",
  "id": "whf4oz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I used to love Chris Brown's music, and would say I definitely used to be a fan.\nThen it all came out, and there is actual verified proof that he is a physical\nabuser. BUT, other artists still actively collaborate with him, and his music is\nstill used in film and TV.\n\nI get that he has a fan base,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は以前、クリス・ブラウンの音楽が大好きで、間違いなくファンだったと言えるでしょう。\nそしてすべてが明らかになり、彼が身体的虐待者であることが実際に検証された証拠があるのです。\nをしたことが証明されました。しかし、他のアーティストたちは今でも彼と積極的にコラボレーションしているし、彼の音楽は映画やテレビで使われている。\n映画やテレビで使われています。\n\n彼にファンがいるのは分かるけど...。",
      "title": "[TWの可能性】クリス・ブラウンはなぜ今も音楽業界で活躍できるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我曾经喜欢克里斯-布朗的音乐，并会说我肯定曾经是他的粉丝。\n然后这一切都出来了，而且有实际的验证证据表明他是一个身体虐待者。\n虐待者。但是，其他艺术家仍然积极与他合作，而且他的音乐仍然被用于\n他的音乐仍然被用在电影和电视中。\n\n我知道他有一个粉丝群，...",
      "title": "[Possible TW]克里斯-布朗如何仍然活跃在音乐界？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾經喜歡克里斯-布朗的音樂，並會說我肯定曾經是他的粉絲。\n然後這一切都出來了，而且有實際的驗證證據表明他是一個身體虐待者。\n虐待者。但是，其他藝術家仍然積極與他合作，而且他的音樂仍然被用於\n他的音樂仍然被用在電影和電視中。\n\n我知道他有一個粉絲羣，...",
      "title": "[Possible TW]克里斯-布朗如何仍然活躍在音樂界？"
    }
  ]
}