{
  "author": "Geddy87",
  "original_created_utc": 1635738502,
  "title": "I took profits , it seems it’s scarier to sell than buy. Why is that",
  "created_utc": 1635791749,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I took some profits after being up a bit and it really came at an opportune time in my life , I’m a firm believer on that “things happen for a reason “ </p>\n\n<p>But I was more anxious and uptight at selling than I was buying. I mean it doesn’t make sense; I buy and money comes out of my account and I’m left with the unknown and the possibility of losing that money; selling I get money added to my account and know that I already succeeded.</p>\n\n<p>I guess the idea it could go a lot higher is always present but that’s basically living in greed. It could also dump and leave me with a loss.</p>\n\n<p>Can’t count your chickens before they haha hatch and one in the hand is worth two in the bush.  </p>\n\n<p>Going to pay off some bills and hope my other holdings grow as well,</p>\n\n<p>Hope everyone had a great Halloween</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/qk5qrc/i_took_profits_it_seems_its_scarier_to_sell_than/",
  "subreddit": "CryptoCurrency",
  "id": "qk5qrc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I took some profits after being up a bit and it really came at an opportune time\nin my life , I’m a firm believer on that “things happen for a reason “\n\nBut I was more anxious and uptight at selling than I was buying. I mean it\ndoesn’t make sense; I buy and money comes out of my account and I’m left…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "少し上昇した後に利益を得ましたが、それは本当に好都合なタイミングでした。\n私は人生において、「物事には理由がある」ということを信じています。\n\nしかし、買うときよりも売るときの方が不安で緊張していました。つまり\n買って、口座からお金が出て行って、残って......というのは意味がありません。",
      "title": "買うよりも売る方が怖いようなので、利益を出しました。なぜだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在涨了一点之后获利了结，这真的是一个很好的时机。\n在我的生活中，我坚信 \"事出有因\"。\n\n但我卖出时比买入时更焦虑和紧张。我的意思是这\n我的意思是，这说不通；我买了，钱就从我的账户里出来了，我就剩下......",
      "title": "我获利了结，看来卖出比买入更可怕。为什么会这样呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在漲了一點之後獲利了結，這真的是一個很好的時機。\n在我的生活中，我堅信 \"事出有因\"。\n\n但我賣出時比買入時更焦慮和緊張。我的意思是這\n我的意思是，這說不通；我買了，錢就從我的賬戶裏出來了，我就剩下......",
      "title": "我獲利了結，看來賣出比買入更可怕。爲什麼會這樣呢？"
    }
  ]
}