{
  "author": "guy___manderson",
  "original_created_utc": 1634907911,
  "title": "Maybe an actual unpopular opinion: Stop complaining about taxes",
  "created_utc": 1634917393,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Taxes suck. We get it. They always have, and they always will. But taxes are the price we pay to live in a functioning society. Yes, the definition of &quot;functioning society&quot; may seem debatable at times, but the alternative is so much worse. But stop being angry that you have to pay a tax when you turn a capital gain. We all do. Average Joe does, anyways.  </p>\n\n<p>Instead of being angry about having to pay taxes, be angry at the super-wealthy. Those that have access to the means to dodge taxes legally, and be angry at the politicians who write the loopholes that allow them to do so. The solution is not demanding that we shouldn&#39;t have to pay taxes, but instead demanding that the richest people in this world pay their fair share. Every dollar they don&#39;t pay in taxes is a dollar you or I have to make up for.</p>\n\n<p>If you hate that the rich get away with legal tax dodging, then vote. Get everyone you know to vote. Vote for the guy or gal that will keep the rich accountable. Stop voting for the ones that won&#39;t. Posting on this sub about how much you hate taxes isn&#39;t going to accomplish much. Most of us here agree with you already.</p>\n\n<p>Be the change you want to see. Peace and love to you all.</p>\n</div><!-- SC_ON -->",
  "score": 673,
  "permalink": "/r/CryptoCurrency/comments/qdgiqr/maybe_an_actual_unpopular_opinion_stop/",
  "subreddit": "CryptoCurrency",
  "id": "qdgiqr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Taxes suck. We get it. They always have, and they always will. But taxes are the\nprice we pay to live in a functioning society. Yes, the definition of\n\"functioning society\" may seem debatable at times, but the alternative is so\nmuch worse. But stop being angry that you have to pay a tax when you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "税金は最悪です。私たちはそれを理解しています。今までもそうだったし、これからもそうでしょう。しかし、税金は、社会が機能するために\n社会を機能させるための代償なのです。そう、「機能する社会」の定義は\n「機能している社会」の定義については議論の余地があるかもしれませんが、代替案はもっと悪いものです。\n悪くなります。しかし、税金を払わなければならないことに怒りを覚えるのはやめましょう・・・。",
      "title": "実際に不評な意見かもしれません。税金に文句を言うな"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "税收很糟糕。我们明白。他们总是这样，也总是会这样。但税收是\n我们为生活在一个正常运作的社会而付出的代价。是的，\"正常运转的社会 \"的定义是\n\"正常运转的社会 \"的定义有时似乎值得商榷，但另一种选择是如此糟糕。\n糟糕得多。但是，不要再为你必须缴税而生气了，当你...",
      "title": "也许是一个真正的不受欢迎的意见。不要再抱怨税收了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "稅收很糟糕。我們明白。他們總是這樣，也總是會這樣。但稅收是\n我們爲生活在一個正常運作的社會而付出的代價。是的，\"正常運轉的社會 \"的定義是\n\"正常運轉的社會 \"的定義有時似乎值得商榷，但另一種選擇是如此糟糕。\n糟糕得多。但是，不要再爲你必須繳稅而生氣了，當你...",
      "title": "也許是一個真正的不受歡迎的意見。不要再抱怨稅收了"
    }
  ]
}