{
  "author": "practice_spelling",
  "original_created_utc": 1632941964,
  "title": "Are there straight guys which enjoys “shoving ” things up there butt?",
  "created_utc": 1632946874,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Well, this is very embarrassing question but that’s why I’m posting it here.</p>\n\n<p>Whenever I hear about a guy shoving (in lack of a better word) something up his butt, the joke is always that he’s gay. But if there’s a g-spot in the butt wouldn’t there also be straight guys enjoying shoving up things there too?</p>\n\n<p>Of course I understand many straight guys perhaps have never tried or given it a thought, I’m a lesbian and have no desire to shove up anything there. However, I feel like someone perhaps have or maybe I’m misunderstanding something, that’s why I’m asking.</p>\n</div><!-- SC_ON -->",
  "score": 325,
  "permalink": "/r/TooAfraidToAsk/comments/py251m/are_there_straight_guys_which_enjoys_shoving/",
  "subreddit": "TooAfraidToAsk",
  "id": "py251m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Well, this is very embarrassing question but that’s why I’m posting it here.\n\nWhenever I hear about a guy shoving (in lack of a better word) something up his\nbutt, the joke is always that he’s gay. But if there’s a g-spot in the butt\nwouldn’t there also be straight guys enjoying shoving up things…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは非常に恥ずかしい質問ですが、だからこそここに投稿しています。\n\nお尻に何かを突っ込んでいる男の話を聞くと、必ずと言っていいほど、その男はゲイだというジョークを聞かされます。\nお尻に何かを突っ込んでいる男の話を聞くと、必ずと言っていいほど、その男がゲイだというジョークを聞きます。でも、もしお尻にGスポットがあるのなら\nお尻にGスポットがあるのなら、お尻に物を突っ込んで楽しんでいるノンケもいるのでは...？",
      "title": "お尻に物を突っ込むのが好きなノンケはいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，这是个非常尴尬的问题，但这也是我把它贴在这里的原因。\n\n每当我听到一个人把东西塞进他的屁股里（缺乏一个更好的词），笑话总是说他是同性恋。\n屁股的时候，笑话总是说他是同性恋。但是，如果屁股里有一个G点的话\n不是也有直男喜欢把东西塞进去吗？",
      "title": "是否有直男喜欢把东西 \"塞 \"进他们的屁股？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，這是個非常尷尬的問題，但這也是我把它貼在這裏的原因。\n\n每當我聽到一個人把東西塞進他的屁股裏（缺乏一個更好的詞），笑話總是說他是同性戀。\n屁股的時候，笑話總是說他是同性戀。但是，如果屁股裏有一個G點的話\n不是也有直男喜歡把東西塞進去嗎？",
      "title": "是否有直男喜歡把東西 \"塞 \"進他們的屁股？"
    }
  ]
}