{
  "author": "partymsl",
  "original_created_utc": 1645134482,
  "title": "The longer you are in crypto, the less you care about the prices.",
  "created_utc": 1645146299,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just about roughly a year ago I entered crypto. And to be honest as most I just went in for money, to get rich quick. Back then I did not knew shit about what crypto actually is. The most I knew was that crypto is a payment system that is kind of anti government (decentralized).&lt;/p&gt;\n\n&lt;p&gt;Over that one year I went from dumb to well still dumb but knowledge about crypto person. As there are not many who know much about crypto yet just as I one year ago, I&amp;#39;m finally good at something.&lt;/p&gt;\n\n&lt;p&gt;You will gather a lot of knowledge about crypto in just a very small time, eventhough it&amp;#39;s pretty complex all you will want to do it as it either actually interests you or you just think it should interest you.&lt;/p&gt;\n\n&lt;p&gt;With time going the knowledge is going to expand and you will know what crypto is about. And if you support that idea you won&amp;#39;t care about short term prices anymore. The only thing you would want is that crypto becomes even more successful, more known. &lt;/p&gt;\n\n&lt;p&gt;So it&amp;#39;s all going shift from money to knowledge, from short term to long term.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 394,
  "permalink": "/r/CryptoCurrency/comments/sv0b96/the_longer_you_are_in_crypto_the_less_you_care/",
  "subreddit": "CryptoCurrency",
  "id": "sv0b96",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Just about roughly a year ago I entered crypto. And to be honest as most I just\nwent in for money, to get rich quick. Back then I did not knew shit about what\ncrypto actually is. The most I knew was that crypto is a payment system that is\nkind of anti government (decentralized).\n\nOver that one year…"
}