{
  "author": "partymsl",
  "original_created_utc": 1645134482,
  "title": "The longer you are in crypto, the less you care about the prices.",
  "created_utc": 1645146299,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just about roughly a year ago I entered crypto. And to be honest as most I just went in for money, to get rich quick. Back then I did not knew shit about what crypto actually is. The most I knew was that crypto is a payment system that is kind of anti government (decentralized).&lt;/p&gt;\n\n&lt;p&gt;Over that one year I went from dumb to well still dumb but knowledge about crypto person. As there are not many who know much about crypto yet just as I one year ago, I&amp;#39;m finally good at something.&lt;/p&gt;\n\n&lt;p&gt;You will gather a lot of knowledge about crypto in just a very small time, eventhough it&amp;#39;s pretty complex all you will want to do it as it either actually interests you or you just think it should interest you.&lt;/p&gt;\n\n&lt;p&gt;With time going the knowledge is going to expand and you will know what crypto is about. And if you support that idea you won&amp;#39;t care about short term prices anymore. The only thing you would want is that crypto becomes even more successful, more known. &lt;/p&gt;\n\n&lt;p&gt;So it&amp;#39;s all going shift from money to knowledge, from short term to long term.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 394,
  "permalink": "/r/CryptoCurrency/comments/sv0b96/the_longer_you_are_in_crypto_the_less_you_care/",
  "subreddit": "CryptoCurrency",
  "id": "sv0b96",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Just about roughly a year ago I entered crypto. And to be honest as most I just\nwent in for money, to get rich quick. Back then I did not knew shit about what\ncrypto actually is. The most I knew was that crypto is a payment system that is\nkind of anti government (decentralized).\n\nOver that one year…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちょうど約1年前、私はクリプトに参入しました。正直なところ、ほとんどの人がそうであるように、私はただ\n一攫千金を狙ったものです。当時はまだ何も知りませんでした。\n暗号は実際何ですか？私が知っていたのは、暗号は決済システムであり、その決済システムは\n反政府的（非中央集権的）なものです。\n\nその1年間は...",
      "title": "暗号を長くやっていると、価格を気にしなくなる。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就在大约一年前，我进入加密货币。说实话，和大多数人一样，我只是\n为了钱，为了快速致富而进入。那时，我对什么是\n加密货币实际上是什么。我所知道的最多的是，加密货币是一种支付系统，是一种反政府的支付系统。\n是一种反政府（去中心化）的支付系统。\n\n在那一年里...",
      "title": "你在加密货币中的时间越长，你对价格的关心就越少。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就在大約一年前，我進入加密貨幣。說實話，和大多數人一樣，我只是\n爲了錢，爲了快速致富而進入。那時，我對什麼是\n加密貨幣實際上是什麼。我所知道的最多的是，加密貨幣是一種支付系統，是一種反政府的支付系統。\n是一種反政府（去中心化）的支付系統。\n\n在那一年裏...",
      "title": "你在加密貨幣中的時間越長，你對價格的關心就越少。"
    }
  ]
}