{
  "author": "wintersghost14",
  "the_new_excerpt": "So my dad is turning 65 this year. He runs is own business and is thinking about\nretiring in the near future with no set date as of yet. He is selling a property\nhe owns and will be receiving $1,000,000 as a result of the sale once all is\nsaid and done. He has a managed retirement account with Chase…",
  "original_created_utc": 1623296297,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ということで、私の父は今年65歳になります。自営業を営んでいますが、再就職を考えています。\n近い将来、引退しようと考えている。父は所有する不動産を売却して\nその結果、100万ドル（約1,000万円）を受け取ることになった。\n受け取る予定です。彼はチェースに管理された退職金口座を持っていますが...",
      "title": "65歳で100万円を投資するには？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我父亲今年就要满65岁了。他经营自己的生意，正在考虑\n在不久的将来退休，目前还没有确定的日期。他正在出售他拥有的一处房产\n他拥有的房产，一旦一切完成，他将获得100万美元的销售收入。\n说和做。他在大通银行有一个管理的退休账户...",
      "title": "如何在65岁时投资100万美元？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我父親今年就要滿65歲了。他經營自己的生意，正在考慮\n在不久的將來退休，目前還沒有確定的日期。他正在出售他擁有的一處房產\n他擁有的房產，一旦一切完成，他將獲得100萬美元的銷售收入。\n說和做。他在大通銀行有一個管理的退休賬戶...",
      "title": "如何在65歲時投資100萬美元？"
    }
  ],
  "title": "How to invest $1,000,000 at 65 years of age?",
  "created_utc": 1623310631,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So my dad is turning 65 this year. He runs is own business and is thinking about retiring in the near future with no set date as of yet. He is selling a property he owns and will be receiving $1,000,000 as a result of the sale once all is said and done. He has a managed retirement account with Chase Bank that is his SEP IRA. He is leery of financial advisors and has been the type to pull out of the market when it falls. I have been introducing him to the Boglehead way of investing and he’s been quite receptive. Being 32 and no professional I only have a general idea of what to encourage him to do with his money. I was hoping to gain the community’s insight to open dialogue with my dad and help him decide what would be best. </p>\n\n<p>Would opening an account with Vanguard splitting his funds into something like 30-40% VTSAX/VTIAX or VTWAX and 60-70% Bonds be best, perhaps VCADX (Vanguard California Intermediate-Term Tax-Exempt Fund Admiral Shares) to take advantage of the tax benefits in a taxable account? Would it be more worthwhile given his life stage to choose a more dividend oriented fund? </p>\n\n<p>Any and all advice would be greatly appreciated.</p>\n</div><!-- SC_ON -->",
  "score": 35,
  "permalink": "/r/Bogleheads/comments/nwe44j/how_to_invest_1000000_at_65_years_of_age/",
  "subreddit": "Bogleheads",
  "id": "nwe44j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404885451
}