{
  "author": "Rexile",
  "the_new_excerpt": "Our wages for honest hard working people are pretty low, we have a\nnear-dictatorship politics, we are supposed to work until we're 65-67 years old,\nour retirement funds won't be enough for a proper life.\n\nI'm only 19 but I want to start my adulthood being financially responsible and\ninvesting in my…",
  "original_created_utc": 1614691839,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们老老实实工作的人的工资是相当低的，我们有一个。\n近乎独裁的政治，我们应该工作到65-67岁。\n我们的退休资金不足以过上正常的生活。\n\n我只有19岁，但我想开始我的成年生活 在经济上的责任感和\n投资我的...",
      "title": "我来自第二世界国家，但我仍然在投资加密技术，我有能力的是"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們老老實實工作的人的工資是相當低的，我們有一個。\n近乎獨裁的政治，我們應該工作到65-67歲。\n我們的退休資金不足以過上正常的生活。\n\n我只有19歲，但我想開始我的成年生活 在經濟上的責任感和\n投資我的...",
      "title": "我來自第二世界國家，但我仍然在投資加密技術，我有能力的是"
    }
  ],
  "title": "I'm from a second world country, but I'm still investing in crypto what I'm able to",
  "created_utc": 1614704444,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Our wages for honest hard working people are pretty low, we have a near-dictatorship politics, we are supposed to work until we&#39;re 65-67 years old, our retirement funds won&#39;t be enough for a proper life.</p>\n\n<p>I&#39;m only 19 but I want to start my adulthood being financially responsible and investing in my future. I&#39;m no longer spending it on myself, I&#39;m spending it only on what is necessary and rest of it is put into stocks and crypto.</p>\n\n<p>I don&#39;t want to work hard until I get an heart attack, I want to spend my last decades travelling around the world and doing what I love.</p>\n\n<p>I don&#39;t want to trust government on keeping me alive and fed when I&#39;m old.</p>\n\n<p>I don&#39;t want to rely on banks and inflatable currencies.</p>\n\n<p>I want to escape the system and stop worrying about money, finances.</p>\n\n<p>All of this is possible thanks to the crypto world. It&#39;s our future, and even if I won&#39;t see coins being mass-adopted for everyday use when I&#39;m alive, I know I was one of the few enligthened ones who believed in a better financial system.</p>\n\n<p>Thank you.</p>\n</div><!-- SC_ON -->",
  "score": 542,
  "permalink": "/r/CryptoCurrency/comments/lw1zni/im_from_a_second_world_country_but_im_still/",
  "subreddit": "CryptoCurrency",
  "id": "lw1zni",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937738017
}