{
  "author": "civgarth",
  "original_created_utc": 1624358320,
  "title": "Have we swung too far the other way with the Karen label?",
  "created_utc": 1624371704,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Asking as my wife who had a legitimate complaint was afraid to complain because she didn&#39;t want to be seen as a Karen.</p>\n\n<p>Does the &quot;Karen wants to see the manager&quot; thing negatively affect socially anxious folks who have reason to actually see a manager or lodge a complaint?  We can&#39;t pretend there aren&#39;t shitty customer service employees out there as well.</p>\n\n<p>Edit: It was a nothing complaint nor did we care to see a manager.  She was overcharged about $30 on her grocery delivery bill.  So I said, just give them a call.  We&#39;ve been using the service for years.  She&#39;s said, no, we&#39;ll just pay it because she didn&#39;t want to look like a Karen and also how would we prove we didn&#39;t get the product as we are home already.</p>\n\n<p>Edit: My wife doesn&#39;t have social anxiety but she&#39;s also the type to say &quot;It is what it is and move on&quot;.  Ie. Got steak when fish was ordered. Will eat steak, tip and just move on with her life.  The worst she&#39;ll do is simply not go back.  In this case, she actually said &#39;Karen&#39; which made me chuckle and prompted this question.  She&#39;s in a very public role and deals with people all day. She often gets yelled at and challenged simply for asking people to put on a mask in her place of work.  She&#39;s a doctor.</p>\n</div><!-- SC_ON -->",
  "score": 2150,
  "permalink": "/r/TooAfraidToAsk/comments/o5k0p0/have_we_swung_too_far_the_other_way_with_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "o5k0p0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Asking as my wife who had a legitimate complaint was afraid to complain because\nshe didn't want to be seen as a Karen.\n\nDoes the \"Karen wants to see the manager\" thing negatively affect socially\nanxious folks who have reason to actually see a manager or lodge a complaint? We\ncan't pretend there…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正当な苦情を持っていた妻が、カレン族と思われたくないという理由で苦情を言うのを恐れていたので聞いた。\nカレンだと思われたくないからです。\n\nカレンがマネージャーに会いたがっている」というのは、実際にマネージャーに会ったり苦情を言ったりする理由がある社会的に不安な人々に悪影響を与えますか？\n実際にマネージャーに会ったり、苦情を言ったりする理由がある社会的に不安な人々に悪影響を与えるのでしょうか？私たちは\nそこを偽ることはできません...。",
      "title": "私たちは、Karenのラベルを反対に振りすぎたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的妻子有一个合理的投诉，但她不敢投诉，因为她不想被看作是卡伦。\n她不想被看作是卡伦的人。\n\n凯伦要见经理 \"这件事是否对那些有理由去见经理或提出投诉的社会焦虑者产生负面影响？\n对那些有理由去见经理或提出投诉的焦虑的人产生负面影响吗？我们\n我们不能假装有...",
      "title": "我们是否在凯伦标签的问题上走得太远了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的妻子有一個合理的投訴，但她不敢投訴，因爲她不想被看作是卡倫。\n她不想被看作是卡倫的人。\n\n凱倫要見經理 \"這件事是否對那些有理由去見經理或提出投訴的社會焦慮者產生負面影響？\n對那些有理由去見經理或提出投訴的焦慮的人產生負面影響嗎？我們\n我們不能假裝有...",
      "title": "我們是否在凱倫標籤的問題上走得太遠了？"
    }
  ]
}