{
  "author": "GadnukBreakerOfWrlds",
  "the_new_excerpt": "Electric-truck startup Lordstown Motors Corp. RIDE 4.25% disclosed in a new\nregulatory filing Tuesday that it doesn’t have sufficient cash to start\ncommercial production and has doubts about whether it can continue as a going\nconcern through the end of the year.\n\nThe company amended its annual…",
  "original_created_utc": 1623183623,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "電気トラックの新興企業であるLordstown Motors Corp. RIDE 4.25%は、新しい規制当局への申請書の中で\nは、商業生産を開始するための十分な資金がないこと、また\n商業生産を開始するための十分な資金がなく、年末まで継続企業として存続できるかどうか疑問であることを明らかにしました。\n疑わしいとしています。\n\n同社は、2012年3月31日に発表した年次報告書を修正しました。",
      "title": "ロードスタウン・モーターズ(RIDE)は、商業生産を開始するための十分な現金を持っていないという"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "电动卡车初创公司Lordstown Motors Corp. RIDE 4.25%周二在一份新的监管文件中披露\n周二在新的监管文件中披露，该公司没有足够的现金来启动商业生产，并对其能否继续作为一个持续经营的公司而存在疑问。\n该公司没有足够的现金来启动商业生产，并对其是否能作为一个持续经营的企业继续经营下去表示怀疑。\n该公司在周二提交的新的监管文件中披露，它没有足够的现金来启动商业生产，并对其是否能继续作为一个持续经营的企业存在疑问。\n\n该公司修正了其年度报告。",
      "title": "Lordstown Motors (RIDE)表示没有足够的现金开始商业生产"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "電動卡車初創公司Lordstown Motors Corp. RIDE 4.25%週二在一份新的監管文件中披露\n週二在新的監管文件中披露，該公司沒有足夠的現金來啓動商業生產，並對其能否繼續作爲一個持續經營的公司而存在疑問。\n該公司沒有足夠的現金來啓動商業生產，並對其是否能作爲一個持續經營的企業繼續經營下去表示懷疑。\n該公司在週二提交的新的監管文件中披露，它沒有足夠的現金來啓動商業生產，並對其是否能繼續作爲一個持續經營的企業存在疑問。\n\n該公司修正了其年度報告。",
      "title": "Lordstown Motors (RIDE)表示沒有足夠的現金開始商業生產"
    }
  ],
  "title": "Lordstown Motors (RIDE) says that it doesn’t have sufficient cash to start commercial production",
  "created_utc": 1623192639,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Electric-truck startup Lordstown Motors Corp. RIDE 4.25% disclosed in a new regulatory filing Tuesday that it doesn’t have sufficient cash to start commercial production and has doubts about whether it can continue as a going concern through the end of the year.</p>\n\n<p>The company amended its annual report to include the going-concern notice, which can flag survival problems for businesses within the next 12 months. The warning comes as new challenges emerge for the two-year-old firm that is trying to convert a former General Motors Co. plant in Ohio to produce electric pickup trucks. It has said its first model, the Endurance, will start production in September.</p>\n\n<p>Lordstown Motors Chief Executive Steve Burns said on a call with analysts in late May that the startup would need to raise more capital to hit its target of building 2,200 pickup trucks by year-end. The company said at the time that higher-than-expected costs were accelerating its cash burn and that it would finish the year with between $50 million and $75 million on hand.</p>\n\n<p>The company was among a number of new electric-vehicle startups that went public last year through reverse mergers with special-purpose acquisition companies, or SPACs. Lordstown raised $675 million from its reverse merger last fall, a deal that valued the aspiring truck maker at about $1.6 billion.</p>\n\n<p>The company didn’t immediately respond to requests for comment.</p>\n\n<p><a href=\"https://www.wsj.com/articles/lordstown-motors-amends-annual-filing-with-going-concern-notice-11623181411\">https://www.wsj.com/articles/lordstown-motors-amends-annual-filing-with-going-concern-notice-11623181411</a></p>\n</div><!-- SC_ON -->",
  "score": 1069,
  "permalink": "/r/investing/comments/nvddt9/lordstown_motors_ride_says_that_it_doesnt_have/",
  "subreddit": "investing",
  "id": "nvddt9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404886626
}