{
  "author": "ChikaChickaSlimShady",
  "original_created_utc": 1645197922,
  "title": "Men, do you ever get tired/bored of seeing sexual content on social media all the time?",
  "created_utc": 1645216961,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sure, we all appreciate seeing a person we find very attractive and we may all have indulged in some sort of self pleasure as a result, however, outside of these fleeting moments, do you ever find yourself getting bored/tired of seeing sexual content all the time in your every day browsing?&lt;/p&gt;\n\n&lt;p&gt;Of course, social media is what you make of it and algorithms are responsive to the content that you engage in most, but it isn&amp;#39;t entirely possible to steer clear as friends/contacts engage in this kind of content as well and also, ads and suggested content that bombards you after just 1 search, but I do find it got so old so quickly seeing sexual content on my feeds. Do you guys feel this way? What do you guys think? Is it ever too much?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/svkkba/men_do_you_ever_get_tiredbored_of_seeing_sexual/",
  "subreddit": "TooAfraidToAsk",
  "id": "svkkba",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Sure, we all appreciate seeing a person we find very attractive and we may all\nhave indulged in some sort of self pleasure as a result, however, outside of\nthese fleeting moments, do you ever find yourself getting bored/tired of seeing\nsexual content all the time in your every day browsing?\n\nOf…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "確かに、魅力的だと思う人を見ると嬉しくなりますし、誰しもがそう思うかもしれません。\nその結果、ある種の自己満足に浸ったことがある。\nこのような一瞬の出来事に対して、飽きたり疲れたりすることはありませんか？\n毎日の閲覧で、性的なコンテンツがいつもある？\n\nその...",
      "title": "男性の皆さん、SNSで性的な内容をいつも見ていて、疲れる・飽きることはありませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当然，我们都喜欢看到一个我们认为非常有吸引力的人，我们可能都会因此而沉溺于某种自我愉悦。\n我们都可能因此而沉溺于某种自我愉悦，然而，在这些转瞬即逝的时刻之外\n然而，在这些转瞬即逝的时刻，你是否发现自己已经厌倦了/厌倦了看到\n在你每天的浏览中一直看到性的内容，你会不会感到厌倦？\n\n是的...",
      "title": "男人们，你们是否曾因一直在社交媒体上看到性内容而感到厌倦/烦恼？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當然，我們都喜歡看到一個我們認爲非常有吸引力的人，我們可能都會因此而沉溺於某種自我愉悅。\n我們都可能因此而沉溺於某種自我愉悅，然而，在這些轉瞬即逝的時刻之外\n然而，在這些轉瞬即逝的時刻，你是否發現自己已經厭倦了/厭倦了看到\n在你每天的瀏覽中一直看到性的內容，你會不會感到厭倦？\n\n是的...",
      "title": "男人們，你們是否曾因一直在社交媒體上看到性內容而感到厭倦/煩惱？"
    }
  ]
}