{
  "author": "roberthonker",
  "original_created_utc": 1635536643,
  "title": "A 10k ETH is not unrealistic, it is inevitable.",
  "created_utc": 1635546668,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t think Ethereum get&#39;s enough love. Everyone&#39;s focused on chasing the next 100x play when there are amazing opportunities right in front of them. Ethereum is a blue chip crypto for a reason, it&#39;s stood the test of time.</p>\n\n<p>Ethereum may have high fees, but it&#39;s still the best smart contract platform <strong>in my opinion.</strong> Ethereum has a huge amount of smart contracts and dApps on it, the same cannot be said for any other platform. The fact that people are willing to pay exorbitant amounts of money for fees highlights how trusted and desirable the Ethereum network is.</p>\n\n<p>Next year, Ethereum will merge to Proof Of Stake. <strong>This is one of the most bullish events that I have ever seen.</strong> The reason for this is that the amount of ETH being created will be reduced by 90%, and ETH will become deflationary.</p>\n\n<p>A deflationary ETH will theoretically continue increasing in price provided that demand remains constant. I think we could see a supply shock where not enough ETH is on exchanges to meet demand which could propel the price very high.</p>\n\n<p><strong>TL;DR: ETH is very underrated. 10k ETH in the next few months is not an unrealistic prediction.</strong></p>\n</div><!-- SC_ON -->",
  "score": 550,
  "permalink": "/r/CryptoCurrency/comments/qikr7r/a_10k_eth_is_not_unrealistic_it_is_inevitable/",
  "subreddit": "CryptoCurrency",
  "id": "qikr7r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don't think Ethereum get's enough love. Everyone's focused on chasing the next\n100x play when there are amazing opportunities right in front of them. Ethereum\nis a blue chip crypto for a reason, it's stood the test of time.\n\nEthereum may have high fees, but it's still the best smart contract…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イーサリアムが十分に愛されているとは思えません。誰もが次の100倍のプレイを追いかけることに集中しています。\n目の前に素晴らしいチャンスがあるのに、誰もが次の100倍のプレーを追いかけることに集中しています。イーサリアム\nが優良な暗号であるのには理由があり、時の試練に耐えてきました。\n\nイーサリアムは手数料が高いかもしれませんが、それでも最高のスマートコントラクトです...",
      "title": "10k ETHは非現実的なものではなく、必然的なものです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为以太坊没有得到足够的爱。每个人都专注于追寻下一个\n100倍的游戏，而在他们面前却有惊人的机会。以太坊\n是一种蓝筹加密货币是有原因的，它经受住了时间的考验。\n\n以太坊可能有很高的费用，但它仍然是最好的智能合约...",
      "title": "10K的ETH不是不现实的，而是不可避免的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲以太坊沒有得到足夠的愛。每個人都專注於追尋下一個\n100倍的遊戲，而在他們面前卻有驚人的機會。以太坊\n是一種藍籌加密貨幣是有原因的，它經受住了時間的考驗。\n\n以太坊可能有很高的費用，但它仍然是最好的智能合約...",
      "title": "10K的ETH不是不現實的，而是不可避免的。"
    }
  ]
}