{
  "author": "z109620",
  "the_new_excerpt": "There's a lot of talk of a bubble or crash. Much of this conversation focuses on\nvaluation. While important, high valuations are a necessary but not sufficient\nconditions for a bubble. Said another way, high valuations are one side effect\nof a complex disease. We can't diagnosis or understand the…",
  "original_created_utc": 1613423765,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "有很多关于泡沫或崩溃的讨论。这种谈话的大部分集中在\n估值。虽然重要，但高估值是必要的，但不是充分的。\n泡沫的条件。换个角度说，高估值是副作用之一。\n的复杂疾病。我们无法诊断或理解...",
      "title": "更完整地了解崩溃/气泡的情况。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有很多關於泡沫或崩潰的討論。這種談話的大部分集中在\n估值。雖然重要，但高估值是必要的，但不是充分的。\n泡沫的條件。換個角度說，高估值是副作用之一。\n的複雜疾病。我們無法診斷或理解...",
      "title": "更完整地瞭解崩潰/氣泡的情況。"
    }
  ],
  "title": "A more complete look at crashes/bubbles",
  "created_utc": 1613431520,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There&#39;s a lot of talk of a bubble or crash. Much of this conversation focuses on valuation.  While important, high valuations are a necessary but not sufficient conditions for a bubble.  Said another way, high valuations are one side effect of a complex disease. We can&#39;t diagnosis or understand the severity of the disease without knowing more.  Here&#39;s a list of other important bubble related issues.  What do you think?  What did I miss?  Do you think we&#39;re in a bubble?</p>\n\n<ul>\n<li>Animal Spirits matter and they&#39;re the hardest to measure.  Especially since we&#39;re all biased.  I&#39;m a pessimist when it comes to the market ... I tacitlly believe people think like me. When I see these valuations, my first thought is BUBBLE ... Remember, there&#39;s alot of optimists out there thinking FREE MONEY.  Know which you are, correct your view and try to be objective. Also know that optimists will turn into pessimists (vice versa), but it takes time/data to change someone&#39;s mind.</li>\n<li>No binary thinking.  Nothing in the world is black or white; the market is not up or down.  I see a lot of comparison to the dot com bubble.  No one seems to bring up the fact that prices climbed and then hung at or around record highs for the better part of a year.  Yes we&#39;re probably in a bubble, but its reasonable to think we&#39;ll hang here for a while. The upcoming year has brighter prospects than the previous one.</li>\n<li>Most times there isn&#39;t a catalyst for a crash, even in hindsight.  Don&#39;t drive yourself crazy looking for one.</li>\n<li>Know the story. While it&#39;s true it&#39;s hard to find the catalyst, know the story of your potential bubble.  IMO, it&#39;s interest rates in our current case. COVID caused many people to look to the future and writeoff the present.  They were enabled by low interest rates.  Investors funneled into future looking companies which, by definition, were less harmed by COVID and relatively more attractive in a low rate environment.  We all must watch the rates and the yield curve.  This may not be the catalyst, i.e. not likely to have one large rate increase/yield curve steepening that will crash the market.  But inflation will grow, rates will grow slowly and then eventually, the story may unwind.</li>\n</ul>\n\n<p>A lot of my thoughts stem from Robert Shiller&#39;s work. He&#39;s got great short books on these subjects.  Recommend Animal Spirits to start.</p>\n\n<p>Finally, stay sane and solvent.  If you&#39;re going short, use options ... When you buy a put you at least have defined risk bounds ... Same is not automatically true for shorting.</p>\n</div><!-- SC_ON -->",
  "score": 333,
  "permalink": "/r/investing/comments/lkne0z/a_more_complete_look_at_crashesbubbles/",
  "subreddit": "investing",
  "id": "lkne0z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728621142
}