{
  "author": "Mithrilzeppelin117",
  "original_created_utc": 1636575263,
  "title": "Learned JavaScript coded my first project (a game)!",
  "created_utc": 1636583665,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m a founder of startup and had no technical experience. I wanted to learn some basics about coding to make communication with my CTO smoother so I bought a “JavaScript for Dummies for Kids” book and coded along with some of the projects in the book. Then, I came up with an idea for a game of my own. I know it’s nothing special but also keep in mind I could only code in my free time (I work as a 2nd grade teacher full time) and I had absolutely no coding or computer experience beyond what I’ve seen on the TV show Mr. Robot lol. It took me about 2 weeks to actually code everything and I let it sit for months before taking initiative to actually deploy it with AWS. Tell me what you think, and drop your high scores! It’s called Stroopsoup.com</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/qr338j/learned_javascript_coded_my_first_project_a_game/",
  "subreddit": "SideProject",
  "id": "qr338j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m a founder of startup and had no technical experience. I wanted to learn some\nbasics about coding to make communication with my CTO smoother so I bought a\n“JavaScript for Dummies for Kids” book and coded along with some of the projects\nin the book. Then, I came up with an idea for a game of my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はスタートアップの創業者ですが、技術的な経験はありませんでした。コミュニケーションをとるために\nCTOとのコミュニケーションを円滑にするために、コーディングの基礎を学びたいと思い、「KijiのJavaScript for Dummies」を購入しました。\n「JavaScript for Dummies for Kids」を購入し、本の中のプロジェクトに沿ってコーディングしました。\n本の中のいくつかのプロジェクトに沿ってコーディングしました。そして、ある時、私は自分のゲームのアイデアを思いつきました。",
      "title": "JavaScriptを学び、初めてのプロジェクト（ゲーム）をコーディングしました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个创业公司的创始人，没有技术经验。我想学习一些\n编码的基础知识，以便与我的CTO进行更顺畅的沟通，所以我买了一本\n我买了一本 \"JavaScript for Dummies for Kids \"的书，并在书中的一些项目中进行编码。\n书中的一些项目进行编码。然后，我想出了一个关于我的游戏的想法。",
      "title": "学会了JavaScript，编码了我的第一个项目（一个游戏）!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個創業公司的創始人，沒有技術經驗。我想學習一些\n編碼的基礎知識，以便與我的CTO進行更順暢的溝通，所以我買了一本\n我買了一本 \"JavaScript for Dummies for Kids \"的書，並在書中的一些項目中進行編碼。\n書中的一些項目進行編碼。然後，我想出了一個關於我的遊戲的想法。",
      "title": "學會了JavaScript，編碼了我的第一個項目（一個遊戲）!"
    }
  ]
}