{
  "author": "mybed54",
  "original_created_utc": 1656532392,
  "title": "Does \"Ethereum 2.0\" mean the end for alternate Layer 1 coins?",
  "created_utc": 1656585458,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We all hold some alternate L1 solutions to Ethereum (me included). But let&amp;#39;s be honest the only reason we do is because we missed the massive run-up for Ethereum through the years and think we can be early on another coin. But is this really the right thinking? &lt;/p&gt;\n\n&lt;p&gt;Say ETH 2.0 fully releases in a few years but when it does why would anyone hold other L1 solutions? ETH at that point would be by far the most decentralized, secure, largest network effect and it would have low fees and fast confirmation times as well. What does any other L1 have over ETH at that point? Why would anyone use a more risky, more centralized chain to develop anything when ETH at that point is almost &amp;quot;perfect&amp;quot;? &lt;/p&gt;\n\n&lt;p&gt;I know everyone wants to say &amp;quot;ETH 2 will never happen&amp;quot; or that it will be delayed for many years because they are bagholders of L1s but I&amp;#39;m wondering what happens when it releases.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 357,
  "permalink": "/r/CryptoCurrency/comments/vnok71/does_ethereum_20_mean_the_end_for_alternate_layer/",
  "subreddit": "CryptoCurrency",
  "id": "vnok71",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We all hold some alternate L1 solutions to Ethereum (me included). But let's be\nhonest the only reason we do is because we missed the massive run-up for\nEthereum through the years and think we can be early on another coin. But is\nthis really the right thinking?\n\nSay ETH 2.0 fully releases in a few…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちは皆、イーサリアムに代わるL1ソリューションをいくつか保有しています（私も含めて）。しかし、正直に言うと\n正直に言うと、私たちがそうする理由は、長年にわたるイーサリアムの大暴騰を見逃したからです。\nイーサリアムの大暴騰を見逃し、他のコインに早く乗れると思っているからです。しかし\nこれは本当に正しい考え方なのでしょうか？\n\n例えば、ETH 2.0があと数年で完全にリリースされるとしたら...。",
      "title": "イーサリアム2.0」は代替レイヤー1コインの終焉を意味するのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都持有一些替代以太坊的L1解决方案（包括我）。但让我们坦率地说\n说实话，我们这样做的唯一原因是，我们错过了以太坊多年来的大规模上涨。\n以太坊多年来的大规模上涨，并认为我们可以在另一个硬币上提前。但这是否\n这真的是正确的想法吗？\n\n假设ETH 2.0在几个月内完全发布...",
      "title": "以太坊2.0 \"是否意味着第1层备用币的结束？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都持有一些替代以太坊的L1解決方案（包括我）。但讓我們坦率地說\n說實話，我們這樣做的唯一原因是，我們錯過了以太坊多年來的大規模上漲。\n以太坊多年來的大規模上漲，並認爲我們可以在另一個硬幣上提前。但這是否\n這真的是正確的想法嗎？\n\n假設ETH 2.0在幾個月內完全發佈...",
      "title": "以太坊2.0 \"是否意味着第1層備用幣的結束？"
    }
  ]
}