{
  "author": "Skip143091",
  "original_created_utc": 1650248681,
  "title": "I'm doing my taxes last minute and am about to just say \"fuck it\", this shit is ridiculous",
  "created_utc": 1650264330,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t even fucking know where to begin, I am so god damned pissed off. I got lucky trading crypto last year and made a bit of money. I&amp;#39;m a full-time student and volunteer, so this was my only income - I made about as much as you would working a minimum wage job for a year. &lt;/p&gt;\n\n&lt;p&gt;So I am poor as fuck, living on my own, going to school, driving around a piece of fucking shit hoopty that barely works, and the government wants to steal my meager income, much of which went to expenses and emergencies. Fine, whatever. But of course I have to keep track of all of these hundreds of transactions myself in preparation for this tax nightmare. The exchanges are a pain in the ass to work with, and their documents are sub par. Now I attempt to file my taxes with shitty Turbotax, and they won&amp;#39;t even let me manually input my tax nightmare, they want me to pay some bullshit fee, the bastards.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m about to just say fuck it, this shit is too confusing, too annoying, and too much of a pain in the ass. These motherfuckers can just audit me and send me the fucking bill, like they should be doing to begin with. Their job, not mine. You can at least do me the favor of figuring out the paperwork and exact amounts before you FUCK ME.&lt;/p&gt;\n\n&lt;p&gt;FUCK&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 366,
  "permalink": "/r/CryptoCurrency/comments/u62h91/im_doing_my_taxes_last_minute_and_am_about_to/",
  "subreddit": "CryptoCurrency",
  "id": "u62h91",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don't even fucking know where to begin, I am so god damned pissed off. I got\nlucky trading crypto last year and made a bit of money. I'm a full-time student\nand volunteer, so this was my only income - I made about as much as you would\nworking a minimum wage job for a year.\n\nSo I am poor as fuck,…"
}