{
  "author": "Skip143091",
  "original_created_utc": 1650248681,
  "title": "I'm doing my taxes last minute and am about to just say \"fuck it\", this shit is ridiculous",
  "created_utc": 1650264330,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t even fucking know where to begin, I am so god damned pissed off. I got lucky trading crypto last year and made a bit of money. I&amp;#39;m a full-time student and volunteer, so this was my only income - I made about as much as you would working a minimum wage job for a year. &lt;/p&gt;\n\n&lt;p&gt;So I am poor as fuck, living on my own, going to school, driving around a piece of fucking shit hoopty that barely works, and the government wants to steal my meager income, much of which went to expenses and emergencies. Fine, whatever. But of course I have to keep track of all of these hundreds of transactions myself in preparation for this tax nightmare. The exchanges are a pain in the ass to work with, and their documents are sub par. Now I attempt to file my taxes with shitty Turbotax, and they won&amp;#39;t even let me manually input my tax nightmare, they want me to pay some bullshit fee, the bastards.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m about to just say fuck it, this shit is too confusing, too annoying, and too much of a pain in the ass. These motherfuckers can just audit me and send me the fucking bill, like they should be doing to begin with. Their job, not mine. You can at least do me the favor of figuring out the paperwork and exact amounts before you FUCK ME.&lt;/p&gt;\n\n&lt;p&gt;FUCK&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 366,
  "permalink": "/r/CryptoCurrency/comments/u62h91/im_doing_my_taxes_last_minute_and_am_about_to/",
  "subreddit": "CryptoCurrency",
  "id": "u62h91",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don't even fucking know where to begin, I am so god damned pissed off. I got\nlucky trading crypto last year and made a bit of money. I'm a full-time student\nand volunteer, so this was my only income - I made about as much as you would\nworking a minimum wage job for a year.\n\nSo I am poor as fuck,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "どこから手をつけていいかわからないくらい、ものすごく腹が立っているんです。私は\n昨年は暗号の取引で運良く少し儲けました。私はフルタイムの学生です。\nというくらいしか収入がありませんでした。\n最低賃金の仕事を1年間していました。\n\nだから、私はクソ貧乏なんだ、、、。",
      "title": "税金を払うのがギリギリになって、「もういいや」となりそうなんだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我甚至他妈的不知道该从何说起，我太他妈生气了。我在去年\n去年我很幸运地交易加密货币，赚了一点钱。我是一个全职学生\n和志愿者，所以这是我唯一的收入--我赚的钱和你做一年最低工资的工作差不多\n做一年最低工资的工作。\n\n所以我穷得要命，...",
      "title": "我正在做我的税收的最后一分钟，正要说 \"他妈的\"，这狗屎是荒谬的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我甚至他媽的不知道該從何說起，我太他媽生氣了。我在去年\n去年我很幸運地交易加密貨幣，賺了一點錢。我是一個全職學生\n和志願者，所以這是我唯一的收入--我賺的錢和你做一年最低工資的工作差不多\n做一年最低工資的工作。\n\n所以我窮得要命，...",
      "title": "我正在做我的稅收的最後一分鐘，正要說 \"他媽的\"，這狗屎是荒謬的。"
    }
  ]
}