{
  "author": "JarJarAwakens",
  "original_created_utc": 1649523094,
  "title": "Why do canaries show symptoms of poisonous gas before humans do, in the context of canaries in coal mines?",
  "created_utc": 1649555746,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In elementary school, I was told by the teacher that canaries have smaller lungs than humans, making them more susceptible to poisonous gas but that answer never sat well with me because smaller lungs should take in less total poison dose. Also birds are smaller than humans so the poison concentration should be fairly similar on a per weight basis. The only way I could see the bird showing symptoms first is if it has a disproportionately increased respiratory and metabolic demands compared to humans, resulting in faster accumulation of poisonous gas or that poisonous gas of equivalent dose is more potent towards canaries than to humans?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 142,
  "permalink": "/r/askscience/comments/tzx87t/why_do_canaries_show_symptoms_of_poisonous_gas/",
  "subreddit": "askscience",
  "id": "tzx87t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In elementary school, I was told by the teacher that canaries have smaller lungs\nthan humans, making them more susceptible to poisonous gas but that answer never\nsat well with me because smaller lungs should take in less total poison dose.\nAlso birds are smaller than humans so the poison…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "小学校のとき、先生から「カナリアは肺が小さい」と言われたことがあります。\nそのため、毒ガスの影響を受けやすいのですが、その答えは、決して正しいものではありません。\nなぜなら、肺が小さいと毒の総量が少なくなるはずだからです。\nまた、鳥は人間より小さいので、毒の量も...",
      "title": "炭鉱のカナリアということで、なぜ人間より先に毒ガスの症状が出るのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "小学时，老师告诉我，金丝雀的肺比较小。\n比人类小，使它们更容易受到有毒气体的影响，但这个答案从来没有让我满意。\n因为较小的肺应该吸收较少的总毒气剂量。\n此外，鸟类比人类小，所以毒气...",
      "title": "就煤矿中的金丝雀而言，为什么金丝雀会比人类更早出现毒气的症状？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "小學時，老師告訴我，金絲雀的肺比較小。\n比人類小，使它們更容易受到有毒氣體的影響，但這個答案從來沒有讓我滿意。\n因爲較小的肺應該吸收較少的總毒氣劑量。\n此外，鳥類比人類小，所以毒氣...",
      "title": "就煤礦中的金絲雀而言，爲什麼金絲雀會比人類更早出現毒氣的症狀？"
    }
  ]
}