{
  "author": "flobbley",
  "the_new_excerpt": "I've seen a lot of comments along the lines of \"tech stocks are down, but\nthey'll go back up, there's no reason not to buy them\" but that line of thinking\nis flawed. Of course tech stocks will go back up, but what's important to your\nreturns is if you think they will rise faster than whatever index…",
  "original_created_utc": 1616765668,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我看到很多评论都是这样的：\"科技股是跌了，但。\n他们会涨回去的，没有理由不买\"，但这种想法。\n是有缺陷的。当然，科技股会回升，但对你的\n回报是，如果你认为他们将上升速度比什么指数... ...",
      "title": "记住，一只股票涨多少并不重要，重要的是它比指数多涨了多少钱"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到很多評論都是這樣的：\"科技股是跌了，但。\n他們會漲回去的，沒有理由不買\"，但這種想法。\n是有缺陷的。當然，科技股會回升，但對你的\n回報是，如果你認爲他們將上升速度比什麼指數... ...",
      "title": "記住，一隻股票漲多少並不重要，重要的是它比指數多漲了多少錢"
    }
  ],
  "title": "Remember, it doesn't matter how much a stock goes up, what matters is how much more it goes up than the index",
  "created_utc": 1616770770,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve seen a lot of comments along the lines of &quot;tech stocks are down, but they&#39;ll go back up, there&#39;s no reason not to buy them&quot; but that line of thinking is flawed. Of course tech stocks will go back up, but what&#39;s important to your returns is if you think they will rise faster than whatever index you choose to compare them too. Because if they don&#39;t, you could have just bought that index fund, had less risk, less work, and better returns. You should always be thinking about your stock purchases in the context of &quot;Do I think this will beat the index?&quot; <em>not</em> &quot;Do I think this will go up in the future?&quot;</p>\n\n<p>Edit: this post is not to advocate for index funds, it is to educate about how to measure stocks returns. This is stocks 101,  how well a stock has performed is measured in reference to an index, the difference in returns between the two is called Alpha. Honestly if this concept is new to you then you need to do a lot more research before you try to start picking stocks.</p>\n</div><!-- SC_ON -->",
  "score": 547,
  "permalink": "/r/stocks/comments/mdorgy/remember_it_doesnt_matter_how_much_a_stock_goes/",
  "subreddit": "stocks",
  "id": "mdorgy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357141527
}