{
  "author": "helskorn",
  "original_created_utc": 1644520885,
  "title": "Why do stores not include the tax on the label or price tag? Wouldn't it be more customer friendly?",
  "created_utc": 1644527874,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I live in Canada, where the price displayed on the shelf is always without tax. Example- tag says 3.00$ but it would be 3.45$ with tax. I feel like it would be simpler for everyone to display exactly what the item costs when you go pay.&lt;/p&gt;\n\n&lt;p&gt;*Edit- To clarify, I mean the label or tag displayed on the shelf, typically below the item/product. Not a sticker on the product&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/spelqh/why_do_stores_not_include_the_tax_on_the_label_or/",
  "subreddit": "TooAfraidToAsk",
  "id": "spelqh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I live in Canada, where the price displayed on the shelf is always without tax.\nExample- tag says 3.00$ but it would be 3.45$ with tax. I feel like it would be\nsimpler for everyone to display exactly what the item costs when you go pay.\n\n*Edit- To clarify, I mean the label or tag displayed on the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はカナダに住んでいますが、棚に表示される価格は常に税抜き価格です。\n例）3.00$と表示されていても、税金を入れると3.45$になります。私は、その方が良いと思います。\nお金を払うときに、その商品がいくらなのかを正確に表示するほうが、誰にとってもシンプルです。\n\n*編集部：「商品についているラベルやタグのことなんですが......。",
      "title": "なぜ、お店はラベルや値札に税金を記載しないのですか？その方がお客様に親切ではないでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我住在加拿大，那里的货架上显示的价格总是不含税。\n例如，标签上写着3.00美元，但含税价格是3.45美元。我觉得在你购买商品时\n我觉得在付款时准确显示商品的价格对大家来说会更简单。\n\n*编辑：为了澄清，我指的是显示在货架上的标签或吊牌。",
      "title": "为什么商店不在标签或价格标签上注明税款？这不是对顾客更友好吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我住在加拿大，那裏的貨架上顯示的價格總是不含稅。\n例如，標籤上寫着3.00美元，但含稅價格是3.45美元。我覺得在你購買商品時\n我覺得在付款時準確顯示商品的價格對大家來說會更簡單。\n\n*編輯：爲了澄清，我指的是顯示在貨架上的標籤或吊牌。",
      "title": "爲什麼商店不在標籤或價格標籤上註明稅款？這不是對顧客更友好嗎？"
    }
  ]
}