{
  "author": "rootpl",
  "original_created_utc": 1634459077,
  "title": "People get very greedy on this sub sometimes, don't listen to them. As long as you made profit even if it's 10, 20, 50 or 100% you've won. Enjoy it!",
  "created_utc": 1634466633,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>People get too greedy here sometimes. I keep seeing posts about doing 2000x and never selling etc. but it&#39;s important to have realistic goals and sticking to them. If your plan is for example to buy a house &quot;hodling forever&quot; is just stupid. You need that house now, not in 20 years time. Plus having a house early will save you a ton of money on rent.</p>\n\n<p>I often compare my profit taking with traditional assets and I always feel good. I took some profits recently. Around 200+% on one of my coins and let me tell you at first I thought &quot;maybe I sold too early, maybe I should have hodled for longer? Everyone keeps telling me we are still early&quot; But then I compared it to my other investments and let me tell you, I&#39;ve never had any other investment return over 200% profit in my entire life. I&#39;ve made more with that single sale than I did in my entire life from investing. If I had to do this with my savings account or regular stocks it would take me years and I would probably never doubled my money.</p>\n\n<p>It&#39;s all about perspective. Have a goal. Realise gains once in a while. Maybe have some stablecoins waiting to buy the dip but don&#39;t feel bad if you&#39;ve sold earlier than everyone else as long as you are in a green, you&#39;ve won. </p>\n\n<p>Good luck everyone!</p>\n</div><!-- SC_ON -->",
  "score": 368,
  "permalink": "/r/CryptoCurrency/comments/q9uojk/people_get_very_greedy_on_this_sub_sometimes_dont/",
  "subreddit": "CryptoCurrency",
  "id": "q9uojk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "People get too greedy here sometimes. I keep seeing posts about doing 2000x and\nnever selling etc. but it's important to have realistic goals and sticking to\nthem. If your plan is for example to buy a house \"hodling forever\" is just\nstupid. You need that house now, not in 20 years time. Plus having…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここでは人々が欲張りすぎることがあります。2000倍やっても売れないなどの書き込みをよく目にしますが\nしかし、現実的な目標を持ち、それを維持することが重要です。\n続けることが大切です。もしあなたの計画が例えば家を買うことであれば、「永遠にホドリング」はただの馬鹿げたことです。\n愚かです。その家は20年後ではなく、今必要なのです。それに、家を持つことは...",
      "title": "このサブ機では、時々とても欲張りな人がいますが、そんな人には耳を貸さないでください。10、20、50、100%でも利益が出ていれば勝ちです。楽しんでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这里的人有时会变得太贪婪。我一直看到关于做2000倍的帖子，但\n但重要的是要有现实的目标并坚持下去。\n他们。如果你的计划是买房子，那么 \"永远做下去 \"就是\n愚蠢。你现在需要那个房子，而不是20年后。另外，有了...",
      "title": "人们有时在这个子上变得非常贪婪，不要听他们的。只要你赚了钱，即使是10、20、50或100%，你就赢了。好好享受吧!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏的人有時會變得太貪婪。我一直看到關於做2000倍的帖子，但\n但重要的是要有現實的目標並堅持下去。\n他們。如果你的計劃是買房子，那麼 \"永遠做下去 \"就是\n愚蠢。你現在需要那個房子，而不是20年後。另外，有了...",
      "title": "人們有時在這個子上變得非常貪婪，不要聽他們的。只要你賺了錢，即使是10、20、50或100%，你就贏了。好好享受吧!"
    }
  ]
}