{
  "author": "moistca",
  "original_created_utc": 1628092570,
  "title": "Men who are into woman, would boobs with big scars on them be a turn off?",
  "created_utc": 1628102268,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m not fishing for compliment or reafirmation, we all have physical turn of and I will understand if it was one of them.</p>\n\n<p>I had breast reduction and unfortunatly my skin didn&#39;t heal graciously from it (it&#39;s keloid if you are curious and brave to google it). got scars all around my nipples and from the down part of my breast to the end of it. They also are still big and not &quot;perky&quot; at all (could put things under them, they will hold it, it&#39;s less fun that it sound.), the skin between them is lose too and look like a fad pad.</p>\n\n<p>Would it be a turn off for you if you found your date has that kind of scars?</p>\n</div><!-- SC_ON -->",
  "score": 3846,
  "permalink": "/r/TooAfraidToAsk/comments/oxvoad/men_who_are_into_woman_would_boobs_with_big_scars/",
  "subreddit": "TooAfraidToAsk",
  "id": "oxvoad",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm not fishing for compliment or reafirmation, we all have physical turn of and\nI will understand if it was one of them.\n\nI had breast reduction and unfortunatly my skin didn't heal graciously from it\n(it's keloid if you are curious and brave to google it). got scars all around my\nnipples and from…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "褒めてもらいたいとか、再確認してもらいたいとか、そういうことではなくて、誰にでも体の向きがあって、それが\nそのうちの一つであったとしても理解できます。\n\n私は乳房縮小術を受けましたが、残念なことに、私の皮膚はそれから快く回復しませんでした。\n(私は乳房縮小術を受けましたが、残念なことに私の皮膚はそこからきれいに回復しませんでした（ケロイドです、興味のある方はグーグルで調べてみてください）。\n乳首の周りや",
      "title": "女性が好きな男性は、大きな傷がついたオッパイは嫌がりますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是在寻求赞美或确认，我们都有身体上的转折点。\n如果这是其中之一，我会理解。\n\n我做过乳房缩小术，不幸的是，我的皮肤并没有因此而得到很好的愈合。\n(这是瘢痕疙瘩，如果你好奇并有勇气去谷歌的话）。\n我的乳头周围都有疤痕，而且从...",
      "title": "喜欢女人的男人，胸部上有大疤痕会不会让人反感？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是在尋求讚美或確認，我們都有身體上的轉折點。\n如果這是其中之一，我會理解。\n\n我做過乳房縮小術，不幸的是，我的皮膚並沒有因此而得到很好的癒合。\n(這是瘢痕疙瘩，如果你好奇並有勇氣去谷歌的話）。\n我的乳頭周圍都有疤痕，而且從...",
      "title": "喜歡女人的男人，胸部上有大疤痕會不會讓人反感？"
    }
  ]
}