{
  "author": "nat20sfail",
  "the_new_excerpt": "Okay, to make it clear: Yes, WSB won't let me post, I wrote this whole thing up\nin emojis and now I'm salty because I can't just copy paste it, and yes, this is\nkind of just more GME DD.\n\nHowever, the thesis of my post is literally \"we should open up to everyone, so\nanyone can learn the basic facts…",
  "original_created_utc": 1611804830,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，说明一下：是的，WSB不让我发帖，我把这件事写出来了。\n在emojis和现在我很咸，因为我不能只是复制粘贴它， 是的，这是\n种只是更GME的DD。\n\n不过，我这篇文章的论点，从字面上看就是 \"我们应该向大家开放，所以......\"。\n谁都能学到基本的知识...",
      "title": "其他短线挤压DD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，說明一下：是的，WSB不讓我發帖，我把這件事寫出來了。\n在emojis和現在我很鹹，因爲我不能只是複製粘貼它， 是的，這是\n種只是更GME的DD。\n\n不過，我這篇文章的論點，從字面上看就是 \"我們應該向大家開放，所以......\"。\n誰都能學到基本的知識...",
      "title": "其他短線擠壓DD"
    }
  ],
  "title": "Other Short Squeezes DD",
  "created_utc": 1611832669,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Okay, to make it clear: Yes, WSB won&#39;t let me post, I wrote this whole thing up in emojis and now I&#39;m salty because I can&#39;t just copy paste it, and yes, this is kind of just more GME DD.</p>\n\n<p>However, the thesis of my post is literally &quot;we should open up to everyone, so anyone can learn the basic facts of investing, because then people can make more educated decisions&quot;, which is distinctly <em>not</em> WSB style apparently. So let me elaborate on why I think popularity is good, not bad, and how that makes <em>other</em> stocks squeezeable. </p>\n\n<h1>Fact 1: Many people don&#39;t know the basic facts</h1>\n\n<p>(How &quot;many&quot; is defined is unclear, but given the amount of complaining about questions on this, and the number of people who have exactly 0 investing experience, I think this is self-evident).</p>\n\n<p>People have been calling GME a bubble, or a pump and dump, since 1000% ago. Now, while it is a bubble in the sense that it&#39;s going to go up and then crash, it is <em>not</em> a pump and dump, but an entirely legal short squeeze.</p>\n\n<p>I&#39;m going to explain the basics, so <strong>feel free to skip ahead</strong> if you know them already, but here&#39;s the long and short of it. GME has had <a href=\"https://www.marketbeat.com/stocks/NYSE/GME/short-interest/\">well over 100% short:float ratio</a> for quite some time. We noticed, and due to general hype around Ryan Cohen (who successfully turned around Chewy, a pet food company) among other things, the stock price started going up.</p>\n\n<p>However, that was <em>not</em> the short squeeze. That was just good ol&#39; crowd behavior - as the stock goes up, people start buying, and when people start buying, the stock goes up. Normally this is pretty well controlled. However, around $40/share, people noticed something - Citron Research <a href=\"https://twitter.com/CitronResearch/status/1351544479547760642\">tweeted</a> that GME was going to crash back to $20/share, and then, within minutes, a massive sell went through in the market. The price began to drop.</p>\n\n<p>From WSB&#39;s perspective, this was two things: One, blatant and unfair market manipulation, and two, a perfect opportunity to &quot;buy the dip&quot;. After all, if they kept buying, the price would go back up, Citron would be shown wrong, and they could squeeze out the bad guys. And, enough people agreed (or at least saw the price go back up) that the price <em>did</em> go back up. And then some.</p>\n\n<p>Now here&#39;s what people got wrong, and still get wrong: The price started skyrocketing because of a squeeze, yes, but a gamma squeeze, not a short squeeze. The short explanation is basically, when calls expire in the money, you get stocks from whoever wrote the contract (who has to buy them if they haven&#39;t already), and when stocks are up, more calls expire in the money. More stocks have to be bought = stocks are up = more stocks have to be bought. Technically this doesn&#39;t <em>all</em> happen on Friday when the calls expire, but rather the effect gets diffused throughout the option chain, and the measurement of how fast it&#39;s going up is gamma, which is why it&#39;s called a gamma squeeze.</p>\n\n<p>I don&#39;t know <em>how</em> many times I&#39;ve seen people mislabel the various spikes as a short squeeze, or even ignore that aspect entirely and just call it mob mentality. The numbers on the shorts are mostly public knowledge, and yet, <em>even in this sub</em> you get tons of people asking &quot;has the short squeeze happened yet?&quot; or even asserting that it has.</p>\n\n<p>Furthermore, the basic squeeze tactics - exercising options at expiration, not buying then selling, stop-loss hunts, etc are similarly, horribly underrepresented.</p>\n\n<h1>Fact 2: The more the merrier</h1>\n\n<p>Now, here&#39;s a fact that everyone knows - the more people get in on a short squeeze, the higher it goes. As more people buy in and hold, the price skyrockets higher with less opportunity to exit short positions, so those holding short positions are forced further into the red. Notably this is <em>great</em> for everyone in on the squeeze, even those who get in relatively late - as long as it&#39;s not during the squeeze itself, which is driven by short sellers buying rather than normal buying, everyone makes more money.</p>\n\n<h1>Conclusion: Spread the info</h1>\n\n<p><em>This</em> is why I&#39;m so salty WSB went private. It&#39;s absolutely the worst possible move. With the momentum the movement in general has, we could easily make more and more people aware of these basic facts. If people watched <a href=\"/r/stocks\">r/stocks</a> anything like they watched <a href=\"/r/sports\">r/sports</a>, even half as much, there&#39;d be triple the number of people invested. At 1/2 the subs, that&#39;d still be quadruple the current sub count - even by a <a href=\"https://www.reddit.com/r/wallstreetbets/comments/k6jjm3/wsb_owns_58_of_gme_gme_survey_update/\">month old estimate</a> WSB had 6% of the stock, so even being conservative on every part of this back-of-the-envelope calculation this could easily be 20%. If you really believe in reddit swaying the market, imagine quadrupling that sway - even in less optimal conditions, is it crazy to believe it&#39;d reach a modest percentage of GME&#39;s success?</p>\n\n<h1>Actual Recommendations</h1>\n\n<p>Here&#39;s the thing - I&#39;m not that smart. But you can easily verify that a lot of the &quot;GME is a one-time opportunity&quot; people are full of it. A common claim is that there&#39;s not that much hedge fund investment in shorted stocks so you&#39;re just fighting other individuals, or that there&#39;s not enough shorting to squeeze, but that&#39;s easily checked: take a look at <a href=\"https://www.barrons.com/articles/another-gamestop-here-are-the-next-10-most-shorted-small-caps-51611688092\">this list of shorted stocks</a>, and see, for example, <a href=\"https://whalewisdom.com/stock/lgnd\">LGND</a>. At 40% hedge fund ownership it&#39;s similar to gamestop, and at 65% shorted float you can bet <em>some</em> of that spike is going to hit the funds. It&#39;s also got an incredibly high put-to-call ratio, which has similar effects. Similarly <a href=\"https://whalewisdom.com/stock/dds\">DDS</a> has 91% float shorting, and still 17% hedge fund ownership. </p>\n\n<p>TL;DR don&#39;t crack down too hard on newbies, get DD to the front page, and there could very well be another GME.</p>\n</div><!-- SC_ON -->",
  "score": 55,
  "permalink": "/r/stocks/comments/l6mx9x/other_short_squeezes_dd/",
  "subreddit": "stocks",
  "id": "l6mx9x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518536224
}