{
  "author": "Far-Scholar9028",
  "original_created_utc": 1637920415,
  "title": "Listen up Americans. Dont panic when you wake up. Buy the fucking dip. Thanks",
  "created_utc": 1637930348,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Pretty simple really. Buy the fucking dip. Black friday sale on any crypto of your choosing. Lets put our money where our mouths are and buy the dip. Perfect time to start dcaing, for anyone that doesnt currently do it and has extra income they wish to put into crypto. Just dca and chill innit. The last time we dumped hard was on the delta variant news. Paper hands hot fucked eventually, so i fully believe they will get fucked again this time. Thankyou for listening to my rant. Fuck covid and all these bs variants</p>\n</div><!-- SC_ON -->",
  "score": 299,
  "permalink": "/r/CryptoCurrency/comments/r2jsub/listen_up_americans_dont_panic_when_you_wake_up/",
  "subreddit": "CryptoCurrency",
  "id": "r2jsub",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Pretty simple really. Buy the fucking dip. Black friday sale on any crypto of\nyour choosing. Lets put our money where our mouths are and buy the dip. Perfect\ntime to start dcaing, for anyone that doesnt currently do it and has extra\nincome they wish to put into crypto. Just dca and chill innit. The…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "とてもシンプルです。ディップを買いましょう。ブラックフライデーのセールで、あらゆる暗号の\n選んでください。お金を出して、ディップを買おう。完璧\n今はまだやっていなくて、暗号に投入したい臨時収入がある人にとっては、dcaingを始める絶好の機会です。\n今はやっていなくて、暗号に投資したい臨時収入がある人にとっては、dcaを始める絶好の機会です。dcaをして落ち着きましょう。その...",
      "title": "アメリカ人に聞いてください。目覚めた時にパニックにならないように。買いに行きましょう。ありがとう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "真的很简单。买入该死的跌停板。黑色星期五对任何加密货币的销售\n你选择的任何加密货币。让我们把钱放在我们的嘴边，买下这块石头。完美\n对于任何目前没有做加密货币的人来说，现在是开始做加密货币的最佳时机，并且有额外的收入希望投入加密货币。\n他们希望将额外的收入投入加密货币。就在这时，你会发现，你在做什么呢？这是个好机会。",
      "title": "美国人听好了。当你醒来的时候不要惊慌。买下这该死的蘸水。谢谢"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "真的很簡單。買入該死的跌停板。黑色星期五對任何加密貨幣的銷售\n你選擇的任何加密貨幣。讓我們把錢放在我們的嘴邊，買下這塊石頭。完美\n對於任何目前沒有做加密貨幣的人來說，現在是開始做加密貨幣的最佳時機，並且有額外的收入希望投入加密貨幣。\n他們希望將額外的收入投入加密貨幣。就在這時，你會發現，你在做什麼呢？這是個好機會。",
      "title": "美國人聽好了。當你醒來的時候不要驚慌。買下這該死的蘸水。謝謝"
    }
  ]
}