{
  "author": "xCryptoPandax",
  "the_new_excerpt": "Background: I currently work for a fortune 100 company's Computer Security\nIncident Response Team, I work specifically on detect and response which\nincludes business email compromises, responding to phishing emails and malware\nwithin the organization, while documenting the process.\n\nMy last post on…",
  "original_created_utc": 1620345037,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "背景について 私は現在、フォーチュン100企業のコンピュータ・セキュリティ・インシデント・レスポンス・チームに所属しています。\nインシデント・レスポンス・チームに所属しています。\nビジネスメールの侵害、フィッシングメールや組織内のマルウェアへの対応などを\nまた、そのプロセスを文書化しています。\n\n私の最後の投稿は...",
      "title": "あなたとあなたのコンピュータとあなたの暗号を安全に保つための完全なセキュリティガイド"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "背景。我目前在一家财富100强公司的计算机安全部工作。\n事件响应团队，我的工作是专门负责检测和响应，包括商业电子邮件泄露、应对网络钓鱼邮件和恶意软件。\n我的工作主要是检测和响应，包括商业电子邮件的泄露，响应网络钓鱼邮件和恶意软件\n应对组织内的钓鱼邮件和恶意软件，同时记录这一过程。\n\n我的上一篇文章是关于...",
      "title": "保证你、你的电脑和你的加密货币安全的完整安全指南"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "背景。我目前在一家財富100強公司的計算機安全部工作。\n事件響應團隊，我的工作是專門負責檢測和響應，包括商業電子郵件泄露、應對網絡釣魚郵件和惡意軟件。\n我的工作主要是檢測和響應，包括商業電子郵件的泄露，響應網絡釣魚郵件和惡意軟件\n應對組織內的釣魚郵件和惡意軟件，同時記錄這一過程。\n\n我的上一篇文章是關於...",
      "title": "保證你、你的電腦和你的加密貨幣安全的完整安全指南"
    }
  ],
  "title": "The Complete Security Guide to keep you, your computer, and your crypto safe",
  "created_utc": 1620358733,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Background: I currently work for a fortune 100 company&#39;s Computer Security Incident Response Team, I work specifically on detect and response which includes business email compromises, responding to phishing emails and malware within the organization, while documenting the process.</p>\n\n<p>My last post on securing accounts got a lot of attention, and there was also a lot of feedback and recommendations to add and consider. After that post I set out to make the most complete guide yet on securing your account and listing the resources needed.</p>\n\n<p><strong>Email:</strong></p>\n\n<ul>\n<li>Email Providers\n\n<ul>\n<li>Any reputable email provider with 2FA will do</li>\n<li>If you want to get more into privacy and encrypting emails there is <a href=\"https://protonmail.com/\">Protonmail</a> or <a href=\"https://www.preveil.com/\">Preveil</a></li>\n<li>You can alternatively also hook up your current email with the <a href=\"https://www.thunderbird.net/en-US/\">Thunderbird</a> email client (use to be managed by Mozilla Firefox) it is overseen by a volunteer board of contributors.</li>\n</ul></li>\n<li>2FA - This is important, activating 2FA on your email is just as important as having it on exchanges. (Will cover more on 2FA further down)</li>\n<li>Create an email specifically for Crypto, but also avoid using crypto keywords / personal information in the email, treat your email address like its public information.</li>\n<li>Be on the lookout for Phishing emails, I made a post on how to identify phishing emails along with some useful tools here | <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/n0j8l0/tips_and_tricks_from_my_line_of_work_on_how_to/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">How to spot a phishing email</a> |\n\n<ul>\n<li><strong>Quick tips for emails:</strong>\n\n<ul>\n<li>Don&#39;t trust email links</li>\n<li>Double check the address bar of login pages</li>\n<li>Know the <a href=\"https://hover.blog/whats-a-domain-name-subdomain-top-level-domain/\">levels of a domain</a></li>\n<li>Check to see if your crypto sites allow a anti-phish banner that displays a code with their emails that you set.</li>\n</ul></li>\n</ul></li>\n<li><a href=\"https://www.nutshell.com/blog/email-tracking-pixels-101-how-do-tracking-pixels-work/\">Tracking pixels</a> are also a thing, there not malicious in themselves, but they can potentially let attackers know if you have open an email / let them know the email exist and is active.</li>\n<li>Furthermore You can check <a href=\"https://haveibeenpwned.com/\">haveibeenpwned</a> to see what data breaches your email has been apart of - If your email shows up and passwords are listed on the data that was compromised, ASSUME the worse and change the password and never use it again, along with any other accounts that use that password.</li>\n</ul>\n\n<p><strong>Passwords / PINs:</strong></p>\n\n<ul>\n<li>Don&#39;t reuse them EVER</li>\n<li>Use strong secure passwords, passwords managers make these easy to manage and generate passwords.</li>\n<li><strong>This includes your phone and 2FA app</strong>, if you have a weak pin (1234) for your phone and someone takes it, remember your 2FA app is then available (if same pin, or no pin/pass set), your email is automatically signed in (same for other accounts auto signed-in), and they can access your text messages.</li>\n<li>Don&#39;t use words relating to crypto or personal information in your passwords (or email), if they are compromised in a breach, assume they will search for these terms to target crypto users and try the same combo against crypto sites or figure who you based on the information (email &amp; password) and pivot to finding public information that could lead to them answering challenge questions for password resets. (Your first pet, is it posted on Facebook? How about your car? Your first girlfriend/boyfriend?)</li>\n<li>Password Managers: These work wonders when managing passwords securely. They generate random strong passwords which can be adjusted, and its all kept in an encrypted database file, so even if a attacker gets access to it, they won&#39;t be able to access it without the password.\n\n<ul>\n<li>Password Managers trusted by the community:\n\n<ul>\n<li><a href=\"https://keepass.info/\">KeePass</a></li>\n<li><a href=\"https://bitwarden.com/\">BitWarden</a></li>\n<li><a href=\"https://www.lastpass.com/\">LastPass</a></li>\n<li><a href=\"https://1password.com/\">1Password</a></li>\n</ul></li>\n</ul></li>\n<li>Don&#39;t save passwords in your browser\n\n<ul>\n<li>Does it require verification for you to use the password? Also I tend to find extensions being more buggy as they have to interact with more &#39;moving&#39; parts and changing configurations, and generally more people try to target and exploit browsers.</li>\n</ul></li>\n</ul>\n\n<p><strong>2 Factor Authentications (2FA):</strong></p>\n\n<ul>\n<li>Enable on everything possible (Email, Exchanges, Banks, Robinhood, even Reddit to protect your moons)</li>\n<li>Use 2FA Apps instead of SMS whenever possible, <a href=\"https://www.consumer.ftc.gov/blog/2019/10/sim-swap-scams-how-protect-yourself\">SIM Swap</a> attacks are real, and more common than you think.\n\n<ul>\n<li>2FA Apps\n\n<ul>\n<li><a href=\"https://authy.com/\">Authy</a> (Linux | Windows | macOS | Iphone | Android)</li>\n<li><a href=\"https://support.google.com/accounts/answer/1066447\">Google Authenticator</a> (iOS | Android)</li>\n<li><a href=\"https://www.microsoft.com/en-us/account/authenticator\">Microsoft Authenticator</a> ( iOS | Android)</li>\n<li><a href=\"https://www.lastpass.com/how-lastpass-works\">LastPass Authenticator</a> (Browser Extension | iOS | Android | Windows Phone)</li>\n</ul></li>\n</ul></li>\n<li>Hardware Keys\n\n<ul>\n<li>These are <a href=\"https://www.techradar.com/best/best-security-key\">physical 2FA device</a> (I chose this list as I think it does a good job explaining them with pros and cons, I did NOT vet the sellers that are listed on the amazon links. Always research and buy from a reliable source)</li>\n</ul></li>\n<li>Backup codes:\n\n<ul>\n<li>When you activate 2FA on any account you should have the ability to generate backup codes, these are used incase you lose access to your authenticator, TREAT these like your seed phrases. Use them by logging in with your user and pass, and use these backup codes in place of the 2FA code you usually enter.</li>\n</ul></li>\n<li>DO NOT take pictures of your QR codes, if you screenshot it, might end up syncing somewhere you don&#39;t want it to and if it ever gets compromised they have the ability to continually receive your 2FA code.</li>\n<li>Also, DO NOT sign up for your 2FA app or any crypto service for that matter using your work or school email address. You lose access to that email, then consider all accounts gone as you won&#39;t be able to access the codes if you switch devices.</li>\n</ul>\n\n<p><strong>Wallets</strong></p>\n\n<ul>\n<li>Learn the difference between the different wallets, I think this <a href=\"https://coinmarketcap.com/alexandria/article/hot-wallets-vs-cold-wallets-whats-the-difference\">article</a> is REALLY good at going in depth about the differences and pros vs cons of them at a beginner level.</li>\n<li>Cold wallets will always be more secure than any hot wallets as they aren&#39;t connected to the internet\n\n<ul>\n<li>Top trusted hardware wallets from the community:\n\n<ul>\n<li>Ledger</li>\n<li>Trezor</li>\n</ul></li>\n</ul></li>\n</ul>\n\n<p><strong>Seed Phrases: Treat these as they are the keys to the kingdom (Keep offline and out of your notes app)</strong></p>\n\n<p>Less Secure:</p>\n\n<ul>\n<li>Write down on paper and either break up the phrase and place in separate secure locations or hide them like the the FBI is going to come search your house</li>\n<li>Secure on USB</li>\n</ul>\n\n<ol>\n<li>Get a <a href=\"https://fileshredder.org/\">file shredder</a> (securely deletes data, and overwrites it)</li>\n<li>Download password manager (optional)</li>\n<li>Disconnect device from internet</li>\n<li>Enter seed phrase into password manager / create encrypted file</li>\n<li>Put on a freshly reformatted USB / datalocker (Worms like to spread by USB)</li>\n<li>Save to USB, and shred the original using the file shredder software</li>\n<li>Hide USB</li>\n</ol>\n\n<ul>\n<li>Another device / old phone</li>\n</ul>\n\n<ol>\n<li>Factory reset</li>\n<li>Set Pin / Pass</li>\n<li>Download 2FA app and password manager / file encryption tool</li>\n<li>Disconnect from internet FOR GOOD (Treat this like a cold wallet)</li>\n<li>Back up 2FA and seed phrases</li>\n<li>Hide device</li>\n</ol>\n\n<p>More secure (more expensive):</p>\n\n<ul>\n<li><a href=\"https://www.blockplate.com/pages/getting-started-blockplate\">BlockPlate</a></li>\n<li><a href=\"https://cryptosteel.com/how-it-works/?v=7516fd43adaa\">CryptoSteel</a></li>\n<li>Have a copy saved in a safety deposit box / split between two banks.</li>\n</ul>\n\n<p>NOTE: Each method is going to its pros and cons: Getting robbed, fading ink, the elements, data retention (USB ~10 years), ever being on a digital machine. Pick which ones benefits you the most, and correlates with your budget and what your willing to risk.</p>\n\n<p><strong>VPNs / TOR:</strong></p>\n\n<ul>\n<li>Privacy vs Anonymity\n\n<ul>\n<li>Privacy is the ability to keep your data and information about yourself exclusive to you (They know who you are, but not what you do).</li>\n<li>Anonymity is about hiding and concealing your identity, but not your actions. (They know what you do, but not who you are)</li>\n<li>Think about what your goal is, I commonly associate privacy with VPN and anonymity with TOR\n\n<ul>\n<li>Both encrypt your data before leaving your device, then routes it through proxy servers to mask your IP/Location. VPNs you have to trust the provider (ensure they state there is a no log policy) while TOR runs through servers ran by volunteers (don&#39;t think governments don&#39;t run their own) and lets you access the dark web. <a href=\"https://www.comparitech.com/blog/vpn-privacy/tor-vs-vpn/\">Here is a more in-depth comparison on VPN vs TOR</a>.</li>\n<li>Personally Its worth paying the few bucks a month for a paid tier of the VPN service.</li>\n</ul></li>\n</ul></li>\n<li>VPN Providers - Zero log VPN services:\n\n<ul>\n<li><a href=\"https://protonvpn.com/\">ProtonVPN</a></li>\n<li><a href=\"https://nordvpn.com/\">Nord</a></li>\n<li><a href=\"https://mullvad.net/en/\">Mullvad</a></li>\n</ul></li>\n<li>TOR\n\n<ul>\n<li>Brave offers TOR, but I would treat this more like a VPN</li>\n<li>If being anonymous is your goal the only real way to achieve this is running <a href=\"https://tails.boum.org/\">Tails off a USB</a>.</li>\n</ul></li>\n</ul>\n\n<p><strong>NOTE:</strong> Some exchanges and websites blacklist IP ranges associated with VPN and most commonly TOR for security reasons. Some people on this community stated that this can lead to them freezing your account.</p>\n\n<p><strong>Browsers (Excluding TOR):</strong></p>\n\n<ul>\n<li>Top 3 Browsers built for privacy\n\n<ul>\n<li>Firefox</li>\n<li>Epic</li>\n<li>Brave (I know Brave draws criticism but I made a technical <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/mzbfrd/security_analyst_here_again_on_why_its_important/\">post</a> showing how the trackers didn&#39;t show up within the metamask extension through brave compared to Google Chrome.)</li>\n<li><a href=\"https://us-cert.cisa.gov/publications/securing-your-web-browser\">Learn to harden your browser to make it even more secure</a></li>\n</ul></li>\n<li>Search Engine for privacy: DuckDuckGo</li>\n<li>Extensions\n\n<ul>\n<li>One of the most dangerous threats I think that aren&#39;t taken seriously are extensions. These can start out legitimate, then through an update turn malicious. These will then be removed from the webstore, but not your browser.\n\n<ul>\n<li>Some will be removed the store due to not being supported anymore which = no more updates, and no more updates = vulnerabilities that won&#39;t be fixed</li>\n<li>If you have Google Sync activated, these extensions will also sync to all those devices</li>\n</ul></li>\n<li>Remove any extensions you don&#39;t need, check to see there still available on the store, and even search them to see if some security <a href=\"https://duo.com/labs/research/crxcavator-malvertising-2020\">article like this pops up</a> about it.</li>\n<li>Check the privacy practice tab of the extension to see what data it collects.</li>\n</ul></li>\n</ul>\n\n<p><strong>Checking and verifying hashes of a download:</strong></p>\n\n<p>Hashes are the fingerprint of a file, even if you change the name of the file the hash will be the same. This is similar to how wallets work, its a string of characters and numbers, yet represents data (aka your holdings)</p>\n\n<ul>\n<li>How to get hash:\n\n<ul>\n<li>Go to the search bar in windows and enter ‘cmd’ this should bring up the command prompt (open terminal on Linux / MAC)\n\n<ul>\n<li>type “Certutil -hashfile Desktop\\example.txt sha256” for windows</li>\n<li>type &quot;Sha256sum Desktop\\example.txt&quot; for Linux</li>\n<li>type “shasum -a 256 Desktop\\example.txt” for MAC</li>\n<li>(Remove quotes, and replace &#39;Desktop\\example.txt&quot; with the path to the file you want to check)</li>\n</ul></li>\n</ul></li>\n<li>this should give you the sha256 hash you can copy and paste into <a href=\"https://www.virustotal.com/gui/file/72714927de74b97c524c5fa8bc1a0dec83f038dbbed80b93b5e6280ca1317f41/detection\">VirusTotal</a> to check to see if its known as malicious by many security vendors. Here is the hash and VirusTotal link for the shredder download I previously mentioned in the seed back up step. <a href=\"https://www.virustotal.com/gui/file/72714927de74b97c524c5fa8bc1a0dec83f038dbbed80b93b5e6280ca1317f41/detection\">72714927de74b97c524c5fa8bc1a0dec83f038dbbed80b93b5e6280ca1317f41/detection</a></li>\n</ul>\n\n<p><strong>NOTE:</strong> You can also just submit the file to VirusTotal, but if it potentially contains personal information, it will upload the file and allow other people to download it, searching the hash will not do this.</p>\n\n<p><strong>Other General Safety Tips:</strong></p>\n\n<ul>\n<li><a href=\"https://www.securicy.com/blog/security-best-practices-hardening-windows-10/\">Harden your PC</a> (Guide is for Windows 10, but can translate to other OS)\n\n<ul>\n<li>Update OS and any software // turn on automatic updates - Everything you download is an attack vector</li>\n<li>Set firewall rules - Default deny, open only p855orts you need, disable rules you don&#39;t need</li>\n<li>disable remote access</li>\n<li>Install AV // Malwarebytes for removing malware</li>\n<li>Turn on encryption</li>\n<li>Setup user accounts // privileges&#39;</li>\n<li>Strong password</li>\n</ul></li>\n<li>If you use a encrypted messaging service, I highly recommend <a href=\"https://www.signal.org/\">Signal</a>, if you haven&#39;t seen their <a href=\"https://signal.org/bigbrother/central-california-grand-jury/\">reply regarding a subpoena</a> you should</li>\n<li>Lock down your social media accounts (go to security settings, turn off being able to be found via search engine, ad related settings, change who can view your posts, etc)</li>\n<li>Don&#39;t disclose your holdings and earnings</li>\n<li>Don&#39;t access your crypto on your work computer</li>\n<li>Don&#39;t answer PMs about winning some contest or some amazing opportunity</li>\n</ul>\n\n<p><strong>Phone:</strong></p>\n\n<p>Many users asked about security regarding people who mainly use their phones. Many of these tips can translate to phones as well, but here&#39;s a quick rundown.</p>\n\n<ul>\n<li>Unique pin / password for the phone</li>\n<li>download a password manager</li>\n<li>email account purely for crypto</li>\n<li>pin / password (different than getting into your phone) for your 2FA app.</li>\n<li>Don&#39;t lend phone out</li>\n<li>Avoid apps you don&#39;t need, read the 3 star reviews as they are the most honest)</li>\n<li>Download VPN / be aware of the wifi your connecting to</li>\n<li>Be aware of phishing</li>\n<li>Call your service provider and see if they can lock your SIM card and prevent SIM swapping.</li>\n</ul>\n\n<p>NOTE: These are still just suggestions, these are methods that balance security and usability. One could use 2 password managers and split a password between both, but that would compromise usability / ease of use.</p>\n</div><!-- SC_ON -->",
  "score": 2844,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/7V0vBmSzTImanV8LhC3XApEcBvGi-WJbyp-FwSQUos4.jpg?auto=webp&s=5a10c0e8ade3993672fa9131f2729967d85d4216",
          "width": 1200,
          "height": 630
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/7V0vBmSzTImanV8LhC3XApEcBvGi-WJbyp-FwSQUos4.jpg?width=108&crop=smart&auto=webp&s=4f0818e99a22a011a96c05d24f36a955f896f38c",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/7V0vBmSzTImanV8LhC3XApEcBvGi-WJbyp-FwSQUos4.jpg?width=216&crop=smart&auto=webp&s=d6e3796e98ad9cf3093f3e58503c1daf76a63768",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/7V0vBmSzTImanV8LhC3XApEcBvGi-WJbyp-FwSQUos4.jpg?width=320&crop=smart&auto=webp&s=3e5c232421753974f74edbaacf02c31b523823f7",
            "width": 320,
            "height": 168
          },
          {
            "url": "https://external-preview.redd.it/7V0vBmSzTImanV8LhC3XApEcBvGi-WJbyp-FwSQUos4.jpg?width=640&crop=smart&auto=webp&s=592e1dd6d7001f1665b56b44a88e448da5b98182",
            "width": 640,
            "height": 336
          },
          {
            "url": "https://external-preview.redd.it/7V0vBmSzTImanV8LhC3XApEcBvGi-WJbyp-FwSQUos4.jpg?width=960&crop=smart&auto=webp&s=a12f633f9a2c97c3b1aa795e6f4cfe8e0a0119a5",
            "width": 960,
            "height": 504
          },
          {
            "url": "https://external-preview.redd.it/7V0vBmSzTImanV8LhC3XApEcBvGi-WJbyp-FwSQUos4.jpg?width=1080&crop=smart&auto=webp&s=d4dcd1e9c078fb4cdbc86cfd13b34fdb0c5a4db2",
            "width": 1080,
            "height": 567
          }
        ],
        "variants": {},
        "id": "MmpG6-xAf_Z62jBXe4mmw9NJF4cK-bvl2xTsMezlliE"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/n6l9zn/the_complete_security_guide_to_keep_you_your/",
  "subreddit": "CryptoCurrency",
  "id": "n6l9zn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985988841
}