{
  "author": "Dazzling_Pudding_848",
  "original_created_utc": 1659596715,
  "title": "is calling a colleague \"hot\" considered sexual harassment?",
  "created_utc": 1659606559,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As part of a sexual harassment prevention training in my work place we are required to go over some slides and at the end you answer yes/no questions regarding situations . One scene describes a man and a women waiting for an elevator at the office, the man taps his women co-worker on the shoulder and tells her &amp;quot;you look really hot in that dress&amp;quot;. I failed for clicking &amp;quot;Yes&amp;quot; to saying she was sexually harassed. Turns out the answer is no because this was a one time thing. Also I have to click the correct answer according to them to be able to finish this mandatory task to which I believe is wrong&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 151,
  "permalink": "/r/NoStupidQuestions/comments/wfugvh/is_calling_a_colleague_hot_considered_sexual/",
  "subreddit": "NoStupidQuestions",
  "id": "wfugvh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "As part of a sexual harassment prevention training in my work place we are\nrequired to go over some slides and at the end you answer yes/no questions\nregarding situations . One scene describes a man and a women waiting for an\nelevator at the office, the man taps his women co-worker on the shoulder…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の職場のセクハラ防止研修の一環として、私たちは\nをする必要があり、最後に状況についての「はい」「いいえ」の質問に答えます。\nを答えるというものです。ある場面では、職場でエレベーターを待つ男女が描かれています。\nエレベーターを待っている男女の間で、男性が同僚の女性の肩をたたくシーンがありました。",
      "title": "同僚を「イケメン」と呼ぶのはセクハラになるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我工作的地方，作为防止性骚扰培训的一部分，我们被要求看一些幻灯片，最后你要回答是/否问题。\n要求我们看一些幻灯片，最后回答是/否的问题\n有关情况。其中一个场景描述了一个男人和一个女人在办公室等待电梯的情景。\n一个场景描述了一个男人和一个女人在办公室里等电梯，这个男人拍了拍他的女同事的肩膀。",
      "title": "称呼同事为 \"辣妹 \"算是性骚扰吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我工作的地方，作爲防止性騷擾培訓的一部分，我們被要求看一些幻燈片，最後你要回答是/否問題。\n要求我們看一些幻燈片，最後回答是/否的問題\n有關情況。其中一個場景描述了一個男人和一個女人在辦公室等待電梯的情景。\n一個場景描述了一個男人和一個女人在辦公室裏等電梯，這個男人拍了拍他的女同事的肩膀。",
      "title": "稱呼同事爲 \"辣妹 \"算是性騷擾嗎？"
    }
  ]
}