{
  "approved_at_utc": null,
  "subreddit": "investing",
  "selftext": "Lately, there has been growing chatter around whether the current rally that we are experiencing over the past one and half years is mainly driven by speculation and if we are in one of the largest investment bubbles ever.\n\n&gt;Why the Stock Market is in a bubble? - [Business Insider](https://www.businessinsider.com/stock-market-bubble-when-will-it-pop-powell-fed-stifel-2021-11)Investors are overestimating earnings growth far more than they did during the dot-com bubble - [Bank of America](https://www.businessinsider.com/stock-market-crash-bank-of-america-warning-sign-shows-drop-2021-11)\n\nEven professional investors whom I consider level-headed and not indulging in sensationalization are calling the current rally unsustainable.\n\n&gt;This Will Not Last - [Nick Maggiulli](https://ofdollarsanddata.com/this-will-not-last/)\n\nAdding to all of this, we can see that the [Shiller PE Ratio is now climbing close to the 2000 dot-com bubble level.](https://preview.redd.it/095t1dtniq281.png?width=899&amp;format=png&amp;auto=webp&amp;s=7db181ad101f44183162eae205bcdb5fb857e01f)\n\nWhile it’s easy to say that it’s all a bubble and we should be liquidating all our investments based on the current trend, I feel that we might be missing the other side of the story. The 2020s are wildly different times compared to the 2000s and we should not be looking at both scenarios through the same lens. There is an immense difference in the available capital, interest rates, and ability of the retail crowd to invest in stocks now compared to 20 years back \\[1\\].\n\nSo what I wanted to analyze is: **Should we really be worried about the current trends or is this the ‘new normal’ given the drastically different situation we find ourselves in?** Finally, this would give us an insight into how to manage our current portfolio and future investments! \\[2\\]\n\n**The Warning Signs**\n\nLet’s first look at the dive into the various concerning trends that we are observing in the current market. (Spoiler alert — there are a lot of them!)\n\n**PE /Shiller PE (CAPE)**\n\nThe price to earnings ratio has been historically used to understand if the market/company is overvalued when compared to historical trends. Shiller PE is adjusted for the cyclical nature of earnings when compared to normal PE.\n\nThe current concern is that as of Nov’21, the Shiller PE for the S&amp;P 500 crossed 40, which is **the highest reading in the last two decades**. The last time the Shiller PE crossed 40 was during the 2000 dot com bubble (The value reached only a max of 27 before the 2007 financial crisis).\n\nThe red flag here is that those who invested when the CAPE was above 40 last time (1999-’00) had to wait another 7 years to break even for a brief period of time (just before the 2007 housing market crash) and then wait another 5 more years before the market consistently settled above their buy-in price.\n\n**Money Supply Growth (Aka ‘Money printer go brrr’)**\n\n[1/5th of all U.S Currency in circulation was printed in 2020.](https://preview.redd.it/fzax1ecriq281.png?width=600&amp;format=png&amp;auto=webp&amp;s=b59bc4f2bfde765ffab5deb3376ddae53b5fe4c3) While it might be argued that there are structural reasons why this was required, there is no denying that only a small portion went into the actual paychecks that people received and a vast majority was used for keeping companies afloat. One can argue that even the stimulus has been increasingly trapped within the financial markets and fueled speculation.\n\n**Increasing use of leverage**\n\nThere are two ways of using leverage while investing. The first method is borrowing money to invest in the markets and the other is using options. Both of these have seen a dramatic rise in the past 2 years.\n\n[This survey conducted by Magnifymoney](https://www.magnifymoney.com/blog/news/debt-to-invest-survey/) for almost 1,000 investors shows staggering results. 80% of Gen Z and 60% of Millennial investors have borrowed money to invest in the market. More than 50% of the surveyed population borrowed more than $5k or more for investing. While leverage works great in a bull market, it can destroy your portfolio during downturns. \\[3\\]\n\n[Research by Goldman Sachs](https://preview.redd.it/kkx1cfjtiq281.png?width=854&amp;format=png&amp;auto=webp&amp;s=b8af5f2398c5273fc770ba1f6a265ad3ffcf1a7b) shows an even more concerning trend. Retail brokers alone are now trading more options than ***the entire market used to do in 2019***. While this can be attributed to the democratization of complicated investment instruments by platforms such as Robinhood, Fidelity, E-Trade, etc., it’s highly unlikely that all the retail traders who are using options completely understand the instrument and the inherent risks while using it.\n\n**Rise of new issues and speculative assets**\n\nMore than $600 Billion have been raised by IPO’s this year. This is the highest number of deals in the last decade or so and has even left the 2007 record in the dust. The cherry on top was [the Rivian IPO](https://marketsentiment.substack.com/p/rivian-ipo) where the company is now valued at more than $100 Billion with zero revenue and less than $50 Million in pre-order deposits.\n\nSPACs \\[4\\] also witnessed incredible growth with the number of SPACs jumping from a mere 59 in 2019 to 248 in 2020 and then a massive 559 in 2021 (As of Nov ’21). The staggering rise in IPOs and SPACs showcases the availability of cheap capital and investors’ desire to hold assets. This is very similar to the dot-com bubble where there was a [large spike in IPO’s just before the crash.](https://www.statista.com/statistics/270290/number-of-ipos-in-the-us-since-1999/)\n\nThis is without even getting into the speculative world of Crypto where [NFTs are being sold](https://www.cnet.com/news/this-cryptopunk-nft-just-sold-for-530-million-kind-of/#:~:text=CryptoPunk%20%239998%2C%20part%20of%20a,for%20%24530%20million%20on%20Thursday.&amp;text=It's%20the%20most%20expensive%20NFT,ethereum%20%2D%2D%20about%20%24532%20million.) for more than half a billion dollars, a coin that started as a literal joke has a market cap of $27 Billion and there are now more ICOs than anyone can keep track of!\n\n**Investor expectations**\n\nMore than the P/E ratio, **i**[nvestor expectations seem to be the highest in recent history.](https://preview.redd.it/qnfuyiqwiq281.png?width=1125&amp;format=png&amp;auto=webp&amp;s=fb279b8dae3bd9803be4b8f7bf26c1984f7a87b8) The price-to-sales ratio shows how much the market values every dollar of the company's sales. As we can see on the chart below, more than double the companies are trading above 10x their sales when compared to the 2000 dot com bubble.\n\nIf you consider a [four-year time period](https://ofdollarsanddata.com/this-will-not-last/), stocks that had a very high P/S ratio have underperformed those having low P/S ratio since most companies don’t grow as per expectations.\n\nNow that’s a lot of bad news for anyone to digest! But,\n\n**Are we certain it’s a bubble?**\n\nThere are multiple factors that can be attributed to the current rally. Just because we are in an impressive rally, it does not mean the only eventual outcome is a bubble and subsequent crash. Let’s look at the key factors that are driving up the stock prices over the last few years.\n\n**Low-interest rates**\n\nThis is one of the key aspects that many miss while comparing the current rally to the 2000s dot-com bubble. Between 1997 and 2000, the fed rate varied from 5 - 6% compared to the [historically low 0.25% that we have now](https://preview.redd.it/x1408niziq281.png?width=700&amp;format=png&amp;auto=webp&amp;s=ee123520c9b2ea0d2f9b10b59d6b2fd181fac446). This means that the capital available now is much cheaper (to prop up the economy after Covid) than it ever was. This is bound to have a positive impact on the stock market with investors moving their money from bonds and other lower returning funds to the stock market in search of better returns.\n\n**New Investors**\n\nIt’s no secret that we all hate Robinhood. [But the data they put out during their IPO filing](https://preview.redd.it/lpojhko0jq281.png?width=935&amp;format=png&amp;auto=webp&amp;s=1ede81940da2355edc282ba1feca54bad415c4b0) shows that there has been a staggering growth in new investors/traders coming to the market. All of these new investors would bring fresh capital into the market triggering another bull run which we are experiencing now.\n\n**401(k) and Index funds**\n\nAs I have highlighted in [one of my previous article](https://www.reddit.com/r/wallstreetbets/comments/piyri4/the_index_fund_bubble_should_you_be_worried/)s, the amount of inflow US index funds receive is massive (more than $50 Billion fund inflow is expected to occur to just the Vanguard 500 index fund this year) and index funds are expected to make up [more than 50% of the fund market](https://www.theatlantic.com/ideas/archive/2021/04/the-autopilot-economy/618497/). According to [this report](https://www.cnbc.com/2021/08/19/401k-balances-hit-a-new-all-time-high-fidelity-says-.html) from Fidelity, the average 401(k) account now has a balance of $129K and 12% of workers increased their contribution.\n\nThe key point being: all this new capital that is being allocated into the index funds is expected to cause a rise in the overall valuation of the stock market \\[5\\].\n\n**What’s the implication?**\n\nAs long as the above factors remain as is (Fed maintaining its rate and a steady supply of fresh capital) we might see the party go on much longer than expected.\n\n**Conclusion**\n\nThe market of 2021 is significantly different when compared to the 2000s. As we can see there are more investors, cheaper capital, and even more passive funds that are flowing into the market than ever before. So I feel that looking at the current market and comparing it directly to the dot-com bubble is a tad wrong.\n\nBut, that’s not to say that all is well. Almost all the fundamental indicators are flashing red and even the experts are predicting a significant drawdown in the near future.\n\nThe expected annual return by investors [above inflation is a whopping 17.5%](https://preview.redd.it/b4vspq13jq281.png?width=928&amp;format=png&amp;auto=webp&amp;s=aa81e2478da9eb80ba1b001e0a2c6b29d9313b97)(which is 161% more than what is realistic) — This is a testament to the euphoria we are seeing in the market now where a yearly double-digit return is the norm.\n\nEven if we are in a dot-com bubble-like scenario, [this thread from Corry Wang](https://twitter.com/corry_wang/status/1345192541545766915) perfectly summarizes the issues with making money calling a bubble in the middle of the bubble.\n\nBasically, even though everyone knew it was a bubble back in 2000 (Investment firms did entire conferences comparing the internet companies to Tulip mania as early as ‘98), **making money using that information was hard!** There were a few investors such as Mark Cuban and John Templeton who successfully shorted the stocks at the peak of the bubble and made a killing when the market crashed, but there were many others who lost their entire investment shorting an overvalued market which went on for longer than anyone could have expected.\n\nIt makes perfect sense to be apprehensive about investing in the current market. But, pundits have been calling a [crash from as far back as 2017](https://fortune.com/2017/08/10/stock-market-crash-today-down-bubble-2017/). Right now based on fundamentals, the chances do look far higher. It does make sense to not make significant one-time investments in the market now. But, changing your portfolio significantly based on recent trends might not be the best long-term strategy!\n\nAs Peter Lynch quoted,\n\n&gt;Far more money has been lost by investors preparing for corrections, or trying to anticipate corrections, than has been lost in corrections themselves\n\nUntil next week…\n\n**Footnotes and Existing Research**\n\n\\[1\\] The amount of commission charged per trade before the rise of the zero-commission trading model was staggering. In the 1980s average commission per trade was $45.\n\n\\[2\\] As always, I am not a Financial Advisor. This is not investment advice. Please do your own research before investing.\n\n\\[3\\] Leverage only makes sense as long as the equity you are investing into would give better returns than the cost of capital at which you borrowed. Otherwise, your losses are magnified as you have to pay the interest for the borrowed money as well as take your losses on the underlying asset.\n\n\\[4\\] For those who don’t know, a [special purpose acquisition company (SPAC)](https://email.mg1.substack.com/c/eJxdUEGOwyAMfE05ogABkgOHvew3IgJuihpIBE6j_H7d9rbIYLAGe2aCR1i2ejmEhmzfGk547eAKnG0FRKjsaFCnFB2LrrMy2JmlNt0rQPZpdWw_5jUFj2krb5SyojOCPZwJMoo4Cun16Me7hiDuYMMsNS26fYf5IyYoARy8oF5bAba6B-LeburnJn8pzvPkqbyI3rZDTJ6HLVOZmOVG-bN3H7hvO0tOdlIIobpu7K1SXHIDQUejej9bqXsV-TBUa1aVb32XF8HbMTf04fluy6rLvj4BGxRMmQ6-phcQcnlr_UBI7kQ5HyXhNUHx8wrRYT2A4dfEjy_TAgUqmRsnj04YNUijje57M3yFk1X06IXVghGHuNGv8n_8H82YjVI) is a company that has no commercial operations and is formed strictly to raise capital through an initial public offering (IPO) for the purpose of acquiring or merging with an existing company. It’s generally considered riskier to invest in a SPAC as it has lower reporting/regulatory requirements when compared to traditional IPOs\n\n\\[5\\] And no, this is not going to cause an [index fund bubble](https://www.reddit.com/r/wallstreetbets/comments/piyri4/the_index_fund_bubble_should_you_be_worried/).",
  "author_fullname": "t2_q15pxyy",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Are we in a bubble? - Comparing the current stock market rally to the dot-com bubble!",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/investing",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_r6e0ep",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.8,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 964,
  "total_awards_received": 4,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 964,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 2
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1638362940,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.investing",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Lately, there has been growing chatter around whether the current rally that we are experiencing over the past one and half years is mainly driven by speculation and if we are in one of the largest investment bubbles ever.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Why the Stock Market is in a bubble? - &lt;a href=\"https://www.businessinsider.com/stock-market-bubble-when-will-it-pop-powell-fed-stifel-2021-11\"&gt;Business Insider&lt;/a&gt;Investors are overestimating earnings growth far more than they did during the dot-com bubble - &lt;a href=\"https://www.businessinsider.com/stock-market-crash-bank-of-america-warning-sign-shows-drop-2021-11\"&gt;Bank of America&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Even professional investors whom I consider level-headed and not indulging in sensationalization are calling the current rally unsustainable.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;This Will Not Last - &lt;a href=\"https://ofdollarsanddata.com/this-will-not-last/\"&gt;Nick Maggiulli&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Adding to all of this, we can see that the &lt;a href=\"https://preview.redd.it/095t1dtniq281.png?width=899&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=7db181ad101f44183162eae205bcdb5fb857e01f\"&gt;Shiller PE Ratio is now climbing close to the 2000 dot-com bubble level.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;While it’s easy to say that it’s all a bubble and we should be liquidating all our investments based on the current trend, I feel that we might be missing the other side of the story. The 2020s are wildly different times compared to the 2000s and we should not be looking at both scenarios through the same lens. There is an immense difference in the available capital, interest rates, and ability of the retail crowd to invest in stocks now compared to 20 years back [1].&lt;/p&gt;\n\n&lt;p&gt;So what I wanted to analyze is: &lt;strong&gt;Should we really be worried about the current trends or is this the ‘new normal’ given the drastically different situation we find ourselves in?&lt;/strong&gt; Finally, this would give us an insight into how to manage our current portfolio and future investments! [2]&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The Warning Signs&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Let’s first look at the dive into the various concerning trends that we are observing in the current market. (Spoiler alert — there are a lot of them!)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;PE /Shiller PE (CAPE)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The price to earnings ratio has been historically used to understand if the market/company is overvalued when compared to historical trends. Shiller PE is adjusted for the cyclical nature of earnings when compared to normal PE.&lt;/p&gt;\n\n&lt;p&gt;The current concern is that as of Nov’21, the Shiller PE for the S&amp;amp;P 500 crossed 40, which is &lt;strong&gt;the highest reading in the last two decades&lt;/strong&gt;. The last time the Shiller PE crossed 40 was during the 2000 dot com bubble (The value reached only a max of 27 before the 2007 financial crisis).&lt;/p&gt;\n\n&lt;p&gt;The red flag here is that those who invested when the CAPE was above 40 last time (1999-’00) had to wait another 7 years to break even for a brief period of time (just before the 2007 housing market crash) and then wait another 5 more years before the market consistently settled above their buy-in price.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Money Supply Growth (Aka ‘Money printer go brrr’)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/fzax1ecriq281.png?width=600&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=b59bc4f2bfde765ffab5deb3376ddae53b5fe4c3\"&gt;1/5th of all U.S Currency in circulation was printed in 2020.&lt;/a&gt; While it might be argued that there are structural reasons why this was required, there is no denying that only a small portion went into the actual paychecks that people received and a vast majority was used for keeping companies afloat. One can argue that even the stimulus has been increasingly trapped within the financial markets and fueled speculation.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Increasing use of leverage&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;There are two ways of using leverage while investing. The first method is borrowing money to invest in the markets and the other is using options. Both of these have seen a dramatic rise in the past 2 years.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.magnifymoney.com/blog/news/debt-to-invest-survey/\"&gt;This survey conducted by Magnifymoney&lt;/a&gt; for almost 1,000 investors shows staggering results. 80% of Gen Z and 60% of Millennial investors have borrowed money to invest in the market. More than 50% of the surveyed population borrowed more than $5k or more for investing. While leverage works great in a bull market, it can destroy your portfolio during downturns. [3]&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/kkx1cfjtiq281.png?width=854&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=b8af5f2398c5273fc770ba1f6a265ad3ffcf1a7b\"&gt;Research by Goldman Sachs&lt;/a&gt; shows an even more concerning trend. Retail brokers alone are now trading more options than &lt;strong&gt;&lt;em&gt;the entire market used to do in 2019&lt;/em&gt;&lt;/strong&gt;. While this can be attributed to the democratization of complicated investment instruments by platforms such as Robinhood, Fidelity, E-Trade, etc., it’s highly unlikely that all the retail traders who are using options completely understand the instrument and the inherent risks while using it.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Rise of new issues and speculative assets&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;More than $600 Billion have been raised by IPO’s this year. This is the highest number of deals in the last decade or so and has even left the 2007 record in the dust. The cherry on top was &lt;a href=\"https://marketsentiment.substack.com/p/rivian-ipo\"&gt;the Rivian IPO&lt;/a&gt; where the company is now valued at more than $100 Billion with zero revenue and less than $50 Million in pre-order deposits.&lt;/p&gt;\n\n&lt;p&gt;SPACs [4] also witnessed incredible growth with the number of SPACs jumping from a mere 59 in 2019 to 248 in 2020 and then a massive 559 in 2021 (As of Nov ’21). The staggering rise in IPOs and SPACs showcases the availability of cheap capital and investors’ desire to hold assets. This is very similar to the dot-com bubble where there was a &lt;a href=\"https://www.statista.com/statistics/270290/number-of-ipos-in-the-us-since-1999/\"&gt;large spike in IPO’s just before the crash.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This is without even getting into the speculative world of Crypto where &lt;a href=\"https://www.cnet.com/news/this-cryptopunk-nft-just-sold-for-530-million-kind-of/#:%7E:text=CryptoPunk%20%239998%2C%20part%20of%20a,for%20%24530%20million%20on%20Thursday.&amp;amp;text=It&amp;#x27;s%20the%20most%20expensive%20NFT,ethereum%20%2D%2D%20about%20%24532%20million.\"&gt;NFTs are being sold&lt;/a&gt; for more than half a billion dollars, a coin that started as a literal joke has a market cap of $27 Billion and there are now more ICOs than anyone can keep track of!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Investor expectations&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;More than the P/E ratio, &lt;strong&gt;i&lt;/strong&gt;&lt;a href=\"https://preview.redd.it/qnfuyiqwiq281.png?width=1125&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=fb279b8dae3bd9803be4b8f7bf26c1984f7a87b8\"&gt;nvestor expectations seem to be the highest in recent history.&lt;/a&gt; The price-to-sales ratio shows how much the market values every dollar of the company&amp;#39;s sales. As we can see on the chart below, more than double the companies are trading above 10x their sales when compared to the 2000 dot com bubble.&lt;/p&gt;\n\n&lt;p&gt;If you consider a &lt;a href=\"https://ofdollarsanddata.com/this-will-not-last/\"&gt;four-year time period&lt;/a&gt;, stocks that had a very high P/S ratio have underperformed those having low P/S ratio since most companies don’t grow as per expectations.&lt;/p&gt;\n\n&lt;p&gt;Now that’s a lot of bad news for anyone to digest! But,&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Are we certain it’s a bubble?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;There are multiple factors that can be attributed to the current rally. Just because we are in an impressive rally, it does not mean the only eventual outcome is a bubble and subsequent crash. Let’s look at the key factors that are driving up the stock prices over the last few years.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Low-interest rates&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This is one of the key aspects that many miss while comparing the current rally to the 2000s dot-com bubble. Between 1997 and 2000, the fed rate varied from 5 - 6% compared to the &lt;a href=\"https://preview.redd.it/x1408niziq281.png?width=700&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=ee123520c9b2ea0d2f9b10b59d6b2fd181fac446\"&gt;historically low 0.25% that we have now&lt;/a&gt;. This means that the capital available now is much cheaper (to prop up the economy after Covid) than it ever was. This is bound to have a positive impact on the stock market with investors moving their money from bonds and other lower returning funds to the stock market in search of better returns.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;New Investors&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;It’s no secret that we all hate Robinhood. &lt;a href=\"https://preview.redd.it/lpojhko0jq281.png?width=935&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=1ede81940da2355edc282ba1feca54bad415c4b0\"&gt;But the data they put out during their IPO filing&lt;/a&gt; shows that there has been a staggering growth in new investors/traders coming to the market. All of these new investors would bring fresh capital into the market triggering another bull run which we are experiencing now.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;401(k) and Index funds&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;As I have highlighted in &lt;a href=\"https://www.reddit.com/r/wallstreetbets/comments/piyri4/the_index_fund_bubble_should_you_be_worried/\"&gt;one of my previous article&lt;/a&gt;s, the amount of inflow US index funds receive is massive (more than $50 Billion fund inflow is expected to occur to just the Vanguard 500 index fund this year) and index funds are expected to make up &lt;a href=\"https://www.theatlantic.com/ideas/archive/2021/04/the-autopilot-economy/618497/\"&gt;more than 50% of the fund market&lt;/a&gt;. According to &lt;a href=\"https://www.cnbc.com/2021/08/19/401k-balances-hit-a-new-all-time-high-fidelity-says-.html\"&gt;this report&lt;/a&gt; from Fidelity, the average 401(k) account now has a balance of $129K and 12% of workers increased their contribution.&lt;/p&gt;\n\n&lt;p&gt;The key point being: all this new capital that is being allocated into the index funds is expected to cause a rise in the overall valuation of the stock market [5].&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What’s the implication?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;As long as the above factors remain as is (Fed maintaining its rate and a steady supply of fresh capital) we might see the party go on much longer than expected.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Conclusion&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The market of 2021 is significantly different when compared to the 2000s. As we can see there are more investors, cheaper capital, and even more passive funds that are flowing into the market than ever before. So I feel that looking at the current market and comparing it directly to the dot-com bubble is a tad wrong.&lt;/p&gt;\n\n&lt;p&gt;But, that’s not to say that all is well. Almost all the fundamental indicators are flashing red and even the experts are predicting a significant drawdown in the near future.&lt;/p&gt;\n\n&lt;p&gt;The expected annual return by investors &lt;a href=\"https://preview.redd.it/b4vspq13jq281.png?width=928&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=aa81e2478da9eb80ba1b001e0a2c6b29d9313b97\"&gt;above inflation is a whopping 17.5%&lt;/a&gt;(which is 161% more than what is realistic) — This is a testament to the euphoria we are seeing in the market now where a yearly double-digit return is the norm.&lt;/p&gt;\n\n&lt;p&gt;Even if we are in a dot-com bubble-like scenario, &lt;a href=\"https://twitter.com/corry_wang/status/1345192541545766915\"&gt;this thread from Corry Wang&lt;/a&gt; perfectly summarizes the issues with making money calling a bubble in the middle of the bubble.&lt;/p&gt;\n\n&lt;p&gt;Basically, even though everyone knew it was a bubble back in 2000 (Investment firms did entire conferences comparing the internet companies to Tulip mania as early as ‘98), &lt;strong&gt;making money using that information was hard!&lt;/strong&gt; There were a few investors such as Mark Cuban and John Templeton who successfully shorted the stocks at the peak of the bubble and made a killing when the market crashed, but there were many others who lost their entire investment shorting an overvalued market which went on for longer than anyone could have expected.&lt;/p&gt;\n\n&lt;p&gt;It makes perfect sense to be apprehensive about investing in the current market. But, pundits have been calling a &lt;a href=\"https://fortune.com/2017/08/10/stock-market-crash-today-down-bubble-2017/\"&gt;crash from as far back as 2017&lt;/a&gt;. Right now based on fundamentals, the chances do look far higher. It does make sense to not make significant one-time investments in the market now. But, changing your portfolio significantly based on recent trends might not be the best long-term strategy!&lt;/p&gt;\n\n&lt;p&gt;As Peter Lynch quoted,&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Far more money has been lost by investors preparing for corrections, or trying to anticipate corrections, than has been lost in corrections themselves&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Until next week…&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Footnotes and Existing Research&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;[1] The amount of commission charged per trade before the rise of the zero-commission trading model was staggering. In the 1980s average commission per trade was $45.&lt;/p&gt;\n\n&lt;p&gt;[2] As always, I am not a Financial Advisor. This is not investment advice. Please do your own research before investing.&lt;/p&gt;\n\n&lt;p&gt;[3] Leverage only makes sense as long as the equity you are investing into would give better returns than the cost of capital at which you borrowed. Otherwise, your losses are magnified as you have to pay the interest for the borrowed money as well as take your losses on the underlying asset.&lt;/p&gt;\n\n&lt;p&gt;[4] For those who don’t know, a &lt;a href=\"https://email.mg1.substack.com/c/eJxdUEGOwyAMfE05ogABkgOHvew3IgJuihpIBE6j_H7d9rbIYLAGe2aCR1i2ejmEhmzfGk547eAKnG0FRKjsaFCnFB2LrrMy2JmlNt0rQPZpdWw_5jUFj2krb5SyojOCPZwJMoo4Cun16Me7hiDuYMMsNS26fYf5IyYoARy8oF5bAba6B-LeburnJn8pzvPkqbyI3rZDTJ6HLVOZmOVG-bN3H7hvO0tOdlIIobpu7K1SXHIDQUejej9bqXsV-TBUa1aVb32XF8HbMTf04fluy6rLvj4BGxRMmQ6-phcQcnlr_UBI7kQ5HyXhNUHx8wrRYT2A4dfEjy_TAgUqmRsnj04YNUijje57M3yFk1X06IXVghGHuNGv8n_8H82YjVI\"&gt;special purpose acquisition company (SPAC)&lt;/a&gt; is a company that has no commercial operations and is formed strictly to raise capital through an initial public offering (IPO) for the purpose of acquiring or merging with an existing company. It’s generally considered riskier to invest in a SPAC as it has lower reporting/regulatory requirements when compared to traditional IPOs&lt;/p&gt;\n\n&lt;p&gt;[5] And no, this is not going to cause an &lt;a href=\"https://www.reddit.com/r/wallstreetbets/comments/piyri4/the_index_fund_bubble_should_you_be_worried/\"&gt;index fund bubble&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qhhq",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "r6e0ep",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "nobjos",
  "discussion_type": null,
  "num_comments": 129,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/investing/comments/r6e0ep/are_we_in_a_bubble_comparing_the_current_stock/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/investing/comments/r6e0ep/are_we_in_a_bubble_comparing_the_current_stock/",
  "subreddit_subscribers": 1957991,
  "created_utc": 1638394045,
  "num_crossposts": 1,
  "media": null,
  "is_video": false,
  "original_created_utc": 1638362940,
  "the_new_excerpt": "Lately, there has been growing chatter around whether the current rally that we\nare experiencing over the past one and half years is mainly driven by\nspeculation and if we are in one of the largest investment bubbles ever.\n\n> Why the Stock Market is in a bubble? - Business Insider\n>…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、現在のような上昇相場が続くのかどうかという議論が高まっています。\nこの1年半の間、私たちが経験したことは、主に、私たち自身によるものでした。\n投機であり、過去最大の投資バブルの一つである。\n\n> 株式市場はなぜバブルなのか？- ビジネスインサイダー\n>...",
      "title": "私たちはバブルの中にいるのか？- 現在の株価上昇をドットコムバブルと比較！？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，有越来越多的人在讨论，在过去一年半的时间里，我们所经历的这轮反弹是否主要是由 \"DOT \"引起的？\n越来越多的人在讨论，在过去一年半的时间里，我们正在经历的反弹是否主要是由投机驱动的？\n投机，以及我们是否处于有史以来最大的投资泡沫之一。\n\n> 为什么股市处于泡沫之中？- 商业内幕\n>...",
      "title": "我们是否处于泡沫之中？- 将目前的股市涨势与互联网泡沫相比较!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，有越來越多的人在討論，在過去一年半的時間裏，我們所經歷的這輪反彈是否主要是由 \"DOT \"引起的？\n越來越多的人在討論，在過去一年半的時間裏，我們正在經歷的反彈是否主要是由投機驅動的？\n投機，以及我們是否處於有史以來最大的投資泡沫之一。\n\n> 爲什麼股市處於泡沫之中？- 商業內幕\n>...",
      "title": "我們是否處於泡沫之中？- 將目前的股市漲勢與互聯網泡沫相比較!"
    }
  ],
  "source_updated_at": 1638524500934
}