{
  "author": "inminit",
  "original_created_utc": 1637782795,
  "title": "Is Algorand really that big of a deal?",
  "created_utc": 1637793401,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I ran into this coin earlier this year. Bought small amount and hold it. I didn&#39;t DCA further after finding out more coins will be released on the market over several years. </p>\n\n<p>I also experiment with DeFi first time using Algorand chain. Funny cos I honestly thought my first DeFi experience would be on Cardano&#39;s chain. I&#39;m too poor to use ETH chain.</p>\n\n<p>I must say, I&#39;m very impressed by how smooth and cheap the experience was. I haven&#39;t researched much on what&#39;s been going on with Algorand but I was surprised to see its dedicated ASA subreddit has 18k members. Memecoins and scam coins are booming in that sub. Almost every day there&#39;s an airdrop, either scam or not.</p>\n\n<p>Usually, if I&#39;m not mistake, this the sign the chain has good traction. Even when there are many scam coins running on it. I imagine like in Pancakeswap era.</p>\n\n<p>Is Algorand&#39;s future that bright? Could it reach Top 5 one day? Are you all start swapping and allocating more ALGOS or experimenting with their ASAs? What ASA you most excited about?</p>\n\n<p>I haven&#39;t seen any ASA hitting major exchanges so I&#39;m curious if it&#39;ll be a thing one day?</p>\n</div><!-- SC_ON -->",
  "score": 221,
  "permalink": "/r/CryptoCurrency/comments/r1dbyv/is_algorand_really_that_big_of_a_deal/",
  "subreddit": "CryptoCurrency",
  "id": "r1dbyv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I ran into this coin earlier this year. Bought small amount and hold it. I\ndidn't DCA further after finding out more coins will be released on the market\nover several years.\n\nI also experiment with DeFi first time using Algorand chain. Funny cos I\nhonestly thought my first DeFi experience would be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今年の初めにこのコインに遭遇しました。少額を購入して保有しています。I\n数年かけてもっと多くのコインが発売されることを知って、それ以上はDCAしませんでした。\nそれ以上はしませんでした。\n\nまた、アルゴランド・チェーンを使って初めてDeFiを試してみました。面白いことに\n最初のDeFiの経験は...と思っていたので面白いですね。",
      "title": "アルゴランドはそんなに大したものではない？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在今年早些时候遇到了这枚硬币。买了少量并持有它。I\n在发现有更多的硬币将在市场上发行后，我没有继续DCA。\n几年内会有更多的币上市。\n\n我也是第一次使用Algorand链做DeFi的实验。有趣的是，我\n说实话，我的第一次DeFi体验是...",
      "title": "Algorand真的有那么大的问题吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在今年早些時候遇到了這枚硬幣。買了少量並持有它。I\n在發現有更多的硬幣將在市場上發行後，我沒有繼續DCA。\n幾年內會有更多的幣上市。\n\n我也是第一次使用Algorand鏈做DeFi的實驗。有趣的是，我\n說實話，我的第一次DeFi體驗是...",
      "title": "Algorand真的有那麼大的問題嗎？"
    }
  ]
}