{
  "author": "Electrical_Seaweed46",
  "original_created_utc": 1629180962,
  "title": "Am I a failure as an Epidemiologist for not being able to convince my boyfriend to get the Covid -19 vaccine?",
  "created_utc": 1629199958,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am an epidemiologist that has been working on the Covid-19 response since the whole thing started. Myself and my entire family and all my friends are fully vaccinated. (Edited for clarity)</p>\n\n<p>However, my boyfriend refuses to get vaccinated. He throws out old statistics and says he does not know the “long term side effects” of the vaccine and won’t listen to anything I have so say that is backed up by science and data. He is actually considering quitting his profession if vaccines become mandatory for his profession. He says the mortality rate is too low and he doesn’t care if ICU beds are maxed out, he won’t take one up if he gets it etc (none of which I agree with of course)</p>\n\n<p>At the end of the day it is his body and I respect that but I can’t help but feel…</p>\n\n<p>Am I a failure in my profession because I can’t even convince the person I love to get vaccinated? One of my close friends has judged my very harshly for my boyfriend’s decision and I can’t help but feel this way.</p>\n\n<p>Edit: for additional context I’ve actually worked on studies related to vaccine adverse events (for 1.5 years) on top of working on Covid-19 and he is aware of this.</p>\n\n<p>Edit2: I have been with him for over 2 years and I respect and love him immensely. He is someone I want to spend the rest of my life with so I’ve been actively trying to tell myself that this is “not a big deal” or this is “my fault”. We didn’t discuss vaccines prior to covid-19.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/p5y516/am_i_a_failure_as_an_epidemiologist_for_not_being/",
  "subreddit": "TooAfraidToAsk",
  "id": "p5y516",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am an epidemiologist that has been working on the Covid-19 response since the\nwhole thing started. Myself and my entire family and all my friends are fully\nvaccinated. (Edited for clarity)\n\nHowever, my boyfriend refuses to get vaccinated. He throws out old statistics\nand says he does not know the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は疫学者で、Covid-19の対応に取り組んできました。\n私は疫学者です。私自身、家族全員、友人全員が完全に予防接種を受けています。\nワクチンを接種しています。(分かりやすいように編集しました)\n\nしかし、私のボーイフレンドはワクチン接種を拒否しています。彼は古い統計を投げ出し\n彼は古い統計を投げて、自分は知らないと言います。",
      "title": "彼氏にコビット-19のワクチンを打つように説得できなかった私は疫学者として失格でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一名流行病学家，自整个事件开始以来，一直从事Covid-19的应对工作。\n整个事件开始后，我一直在为Covid-19的应对工作而努力。我自己和我的整个家庭以及我所有的朋友都完全接种了\n接种了疫苗。(为清晰起见而编辑)\n\n然而，我的男朋友却拒绝接种疫苗。他抛出了旧的统计数据\n并说他不知道...",
      "title": "作为一名流行病学家，我没能说服我的男朋友接种Covid -19疫苗，是不是很失败？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一名流行病學家，自整個事件開始以來，一直從事Covid-19的應對工作。\n整個事件開始後，我一直在爲Covid-19的應對工作而努力。我自己和我的整個家庭以及我所有的朋友都完全接種了\n接種了疫苗。(爲清晰起見而編輯)\n\n然而，我的男朋友卻拒絕接種疫苗。他拋出了舊的統計數據\n並說他不知道...",
      "title": "作爲一名流行病學家，我沒能說服我的男朋友接種Covid -19疫苗，是不是很失敗？"
    }
  ]
}