{
  "author": "ismatash",
  "original_created_utc": 1646952135,
  "title": "Hi! I'm a Java developer and I want to develop your project for free, as long we can talk about it in english through voice chat",
  "created_utc": 1646956991,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My english is pretty bad, specially when I&amp;#39;m talking. I will some day try to improve it, but not any time soon. Meanwhile, I would like to try to use what I know of it to talk with someone about software development related things, as in the future my goal is to work for a foreign company and I&amp;#39;m curious to see how messy a conversation in english with me about it can get.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;I think I can manage to understand you well, which is enough for me to get what you want from the software.  I also have some knowledge on front end (javascript) and machine learning (not a big fan of python pandas and stuff), so I think I can handle a complete project if it isn&amp;#39;t very large. Even if I don&amp;#39;t manage to complete the project, I will make sure that the code is very clean so it&amp;#39;s easier for someone to finish it. Also, I would be able to work only 8 hours per week (more or less) since I already have 40 hours/week job here in my country.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Let me know if you are interested.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 6,
  "permalink": "/r/SideProject/comments/tbb3wg/hi_im_a_java_developer_and_i_want_to_develop_your/",
  "subreddit": "SideProject",
  "id": "tbb3wg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My english is pretty bad, specially when I'm talking. I will some day try to\nimprove it, but not any time soon. Meanwhile, I would like to try to use what I\nknow of it to talk with someone about software development related things, as in\nthe future my goal is to work for a foreign company and I'm…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の英語はかなり悪いです、特に話しているときは。私はいつか\nしかし、すぐには上達しないでしょう。しかし、すぐに上達するわけではありません。\nソフトウェア開発に関連することを誰かと話すために、その知識を持っています。\n将来は外資系企業に就職するのが目標で、そのために...",
      "title": "こんにちは！私はJava開発者と私は限り、我々はボイスチャットを通じて英語でそれについて話すことができるように、無料であなたのプロジェクトを開発したいと思います"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的英语很差，特别是在我说话的时候。我有一天会努力\n改善它，但不是很快的事。同时，我想试着用我所知道的\n来和别人谈论与软件开发有关的事情，因为在未来我的目标是在一家外国公司工作。\n未来我的目标是在一家外国公司工作，我...",
      "title": "你好！我是一名Java开发人员，我想免费开发你的项目，只要我们能通过语音聊天用英语讨论。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的英語很差，特別是在我說話的時候。我有一天會努力\n改善它，但不是很快的事。同時，我想試着用我所知道的\n來和別人談論與軟件開發有關的事情，因爲在未來我的目標是在一家外國公司工作。\n未來我的目標是在一家外國公司工作，我...",
      "title": "你好！我是一名Java開發人員，我想免費開發你的項目，只要我們能通過語音聊天用英語討論。"
    }
  ]
}