{
  "author": "backwoods-bigfoot",
  "original_created_utc": 1660446357,
  "title": "I'd really love to get a PhD in history and teach and research at the college level, but everything I'm reading about getting a history PhD just makes me more and more discouraged. Is it worth it or should I give up my dream?",
  "created_utc": 1660489005,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a senior undergrad working toward a BA in history. Ever since I got into college, I&amp;#39;ve wanted to teach history. I went into college wanting to do that and I still want to do that. I&amp;#39;ve been thinking increasingly about getting a PhD for a number of reasons. &lt;/p&gt;\n\n&lt;p&gt;First, I absolutely love to learn and share what I&amp;#39;ve learned with others. I would love to teach at the college level. I would love to teach on subjects that are more specialized than just World History or US History. Being a doctor of history would give me so much more opportunity to research, to learn, and to write. Being able to do that as a job would be my dream.&lt;/p&gt;\n\n&lt;p&gt;My family, friends, coworkers, fellow students, and even my profs have been incredibly supportive of me, telling me that they think I should go for it and that I would be a good professor. I think I would, too: I&amp;#39;m passionate about history, I know I&amp;#39;m good at explaining information and concepts in an engaging way, and I love to learn and write. Every historian I know tells me how much they love their job and it&amp;#39;s very inspiring to me.&lt;/p&gt;\n\n&lt;p&gt;But everything I&amp;#39;ve read, including similar advice on this subreddit, is really discouraging me. I keep reading how long it takes to get a history PhD, how few opportunities there are for people with them, and how unlikely it is for me to find a job in the field. I read about how stupid people think getting a history PhD is, and I find lists telling me all sorts of reasons why getting one is a bad idea. This subreddit especially has been vocal on how foolish pursuing a history PhD is.&lt;/p&gt;\n\n&lt;p&gt;Talk about crushing. I&amp;#39;m becoming afraid that everything I&amp;#39;ve been working towards is for nothing and that I&amp;#39;m going to have to give up what I really want to do. I&amp;#39;m afraid that what I want isn&amp;#39;t the right thing for me for to do. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll be talking to my advisor and academic advising about this, but I could really use some honest but gentle advice on what I should do. Thank you. &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/wnvxc2/id_really_love_to_get_a_phd_in_history_and_teach/",
  "subreddit": "AskHistorians",
  "id": "wnvxc2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm a senior undergrad working toward a BA in history. Ever since I got into\ncollege, I've wanted to teach history. I went into college wanting to do that\nand I still want to do that. I've been thinking increasingly about getting a PhD\nfor a number of reasons.\n\nFirst, I absolutely love to learn and…"
}