{
  "author": "McCann08091997",
  "original_created_utc": 1643204975,
  "title": "Why is it wrong to judge woman who smoke when they're pregnant?",
  "created_utc": 1643212638,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I work outside a hospital, and daily I see 5-10+ women smoking whilst pregnant. It angers me everytime I see it. I understand you shouldn&amp;#39;t judge people, and you never know everybody&amp;#39;s story, but why is it wrong to judge somebody harming an unborn baby and possibly adding medical difficulties into their lives with their decisions. At the beginning of a pregnancy I can be sympathetic, as going cold turkey can be worse for the baby if you&amp;#39;re addicted. But if you look ready to pop and you&amp;#39;re still smoking, I don&amp;#39;t understand why you didn&amp;#39;t wean yourself off for the rest of the pregnancy and just start back up when baby was born. &lt;/p&gt;\n\n&lt;p&gt;I was a smoker when I found out I was pregnant, and as soon as I knew I quit smoking. So why can&amp;#39;t everybody else do it? I genuinely don&amp;#39;t get it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 211,
  "permalink": "/r/TooAfraidToAsk/comments/sd6ebf/why_is_it_wrong_to_judge_woman_who_smoke_when/",
  "subreddit": "TooAfraidToAsk",
  "id": "sd6ebf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I work outside a hospital, and daily I see 5-10+ women smoking whilst pregnant.\nIt angers me everytime I see it. I understand you shouldn't judge people, and\nyou never know everybody's story, but why is it wrong to judge somebody harming\nan unborn baby and possibly adding medical difficulties into…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は病院の外で働いていますが、毎日5～10人以上の女性が妊娠中に喫煙しているのを見かけます。\n見るたびに腹が立ちます。人を批判してはいけないことは理解していますし、また\nしかし、なぜ、そのような人物を批判することがいけないのでしょうか。\n生まれてくる赤ちゃんが、医学的に困難な状況に追い込まれる可能性があるのですから...。",
      "title": "妊娠中にタバコを吸う女性を裁くのはなぜいけないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在一家医院外面工作，每天都看到5-10多名妇女在怀孕期间吸烟。\n每次看到这种情况，我都很生气。我知道你不应该评判别人，而且\n你永远不知道每个人的故事，但为什么判断一个人伤害未出生的婴儿并可能增加医疗困难是错误的呢？\n但为什么判断一个人伤害未出生的婴儿并可能增加医疗困难是错误的......",
      "title": "为什么评价怀孕时吸烟的妇女是错误的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在一家醫院外面工作，每天都看到5-10多名婦女在懷孕期間吸菸。\n每次看到這種情況，我都很生氣。我知道你不應該評判別人，而且\n你永遠不知道每個人的故事，但爲什麼判斷一個人傷害未出生的嬰兒並可能增加醫療困難是錯誤的呢？\n但爲什麼判斷一個人傷害未出生的嬰兒並可能增加醫療困難是錯誤的......",
      "title": "爲什麼評價懷孕時吸菸的婦女是錯誤的？"
    }
  ]
}