{
  "author": "omgcoin",
  "the_new_excerpt": "Every time there is a discussion about Nouriel Roubini, Paul Krugman, Janet\nYellen, Elizabeth Warren and others, I see terrible ageist/generational\narguments like \"this old man can't understand new technology\", \"this old woman\nstuck in the past\", \"these boomers\" etc.\n\nThese are not only…",
  "original_created_utc": 1623832815,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ヌリエル・ルービニ、ポール・クルーグマン、ジャネット・イエレン、エリザベス・ウォーレンなどの話題が出るたびに\nイエレン、エリザベス・ウォーレンなどについて議論するたびに、「この老人は新しい技術を理解できない」とか\nこの老人は新しい技術を理解できない」、「この老婆は過去に囚われている」、「この団塊世代は\n過去に囚われている」、「この団塊の世代」などのひどい年齢・世代論を目にします。\n\nこれらは、単に...",
      "title": "ルビーニ、クルーグマン、イエレンが暗号化に反対するのは、古いからではなく、ケインジアンだからである。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每当有关于Nouriel Roubini, Paul Krugman, Janet\n耶伦、伊丽莎白-沃伦等人的讨论，我都会看到可怕的年龄主义/代际论\n诸如 \"这个老人不能理解新技术\"、\"这个老女人\n困在过去\"，\"这些潮人 \"等等。\n\n这些不仅是...",
      "title": "鲁比尼、克鲁格曼、耶伦反对加密货币，不是因为他们老，而是因为他们是凯恩斯主义者"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每當有關於Nouriel Roubini, Paul Krugman, Janet\n耶倫、伊麗莎白-沃倫等人的討論，我都會看到可怕的年齡主義/代際論\n諸如 \"這個老人不能理解新技術\"、\"這個老女人\n困在過去\"，\"這些潮人 \"等等。\n\n這些不僅是...",
      "title": "魯比尼、克魯格曼、耶倫反對加密貨幣，不是因爲他們老，而是因爲他們是凱恩斯主義者"
    }
  ],
  "title": "Roubini, Krugman, Yellen oppose crypto, not because they are old, but because they are Keynesians",
  "created_utc": 1623861962,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Every time there is a discussion about Nouriel Roubini, Paul Krugman, Janet Yellen, Elizabeth Warren and others, I see terrible ageist/generational arguments like &quot;this old man can&#39;t understand new technology&quot;, &quot;this old woman stuck in the past&quot;, &quot;these boomers&quot; etc.</p>\n\n<p>These are not only counterproductive and naive arguments but also distracting from real reason why these people are so much against crypto. The real reason why all these people against crypto is not their age (or being part of previous generation). In short, these people are so against crypto because they are statists to the core.</p>\n\n<p>For example, Nouriel Roubini, Paul Krugman and Janet Yellen are followers of New Keynesian economics. It&#39;s even in their bio in Wikipedia (check &quot;School or tradition&quot; section). The only way for them to accept crypto is to completely throw away their Keynesianism because it&#39;s inherently statist. That&#39;s not going to happen and it has nothing to do with their age or generation but with their desire for state controlled economy.</p>\n\n<p>Furthermore, one of godfathers of crypto is actually Friedrich Hayek who wrote famous book called &quot;The Denationalization of Money&quot; in 1976:</p>\n\n<p><a href=\"https://en.wikipedia.org/wiki/The_Denationalization_of_Money\">https://en.wikipedia.org/wiki/The_Denationalization_of_Money</a></p>\n\n<p>Here is a short video with quotes from Hayek:</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=9-uo-KfnkhI\">https://www.youtube.com/watch?v=9-uo-KfnkhI</a></p>\n\n<p>By the time, he gave this interview (1984), he was 85 years old man and he was way ahead of his time!</p>\n\n<p>Cryptocurrencies are just modern embodiment of almost century old debate - Keynes vs. Hayek.</p>\n\n<p>Milton Friedman also predicted rise of cryptocurrencies (he called them - anonymous e-cash):</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=mlwxdyLnMXM#t=14m40s\">https://www.youtube.com/watch?v=mlwxdyLnMXM#t=14m40s</a></p>\n\n<p>He gave this interview (1999) when he was 87 years old.</p>\n\n<p>Timothy May wrote his famous essay called &quot;The Crypto Anarchist Manifesto&quot; in 1988. This essay had a big influence on Wei Dai:</p>\n\n<p><a href=\"http://www.weidai.com/bmoney.txt\">http://www.weidai.com/bmoney.txt</a></p>\n\n<p>By the way, this essay is the first link in original Bitcoin whitepaper. Timothy May would turn 70 this year. Unfortunately, he passed away in 2018.</p>\n\n<p>Even long before, Hayek and Friedman, Carl Menger wrote free market theory of money called &quot;On the Origins of Money&quot; (1892).</p>\n\n<p>In short, crypto can&#39;t be inherently generational thing because its philosophical/economical foundation created by 100+ year old men (if they were still alive today). The real reason why all these modern &quot;economists&quot; oppose crypto is because they are statist to the core and they will never accept the idea that something can exist outside of state control (especially money!).</p>\n\n<p>So real debate isn&#39;t between generations but between different schools of thought and free market theory of money is very old idea which found itself in cyberspace.</p>\n</div><!-- SC_ON -->",
  "score": 274,
  "permalink": "/r/CryptoCurrency/comments/o106mu/roubini_krugman_yellen_oppose_crypto_not_because/",
  "subreddit": "CryptoCurrency",
  "id": "o106mu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009740002
}