{
  "author": "Mr_N1ce",
  "the_new_excerpt": "My father is a boomer\n\nHe's not too technical, he uses his smartphone as needed and looks into his\nemail inbox once or twice a month. Bitcoin was always a mystery to him apart\nfrom the \"fact\" that it's a highly volatile investment. He prefers real estate\ninvestments.\n\nBut one of the Christmas…",
  "original_created_utc": 1609147265,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我父亲是婴儿潮一代\n\n他不太懂技术，他会根据需要使用他的智能手机，并查看他的\n每月一到两次的电子邮件收件箱。除他之外，比特币对他来说一直是个谜。\n从“事实”来看，这是一项高度不稳定的投资。他更喜欢房地产。\n投资。\n\n但是其中一个圣诞…",
      "title": "我出生在婴儿潮一代的父亲是如何突然理解密码(好的，比特币)的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我父親是嬰兒潮一代\n\n他不太懂技術，他會根據需要使用他的智能手機，並查看他的\n每月一到兩次的電子郵件收件箱。除他之外，比特幣對他來說一直是個謎。\n從“事實”來看，這是一項高度不穩定的投資。他更喜歡房地產。\n投資。\n\n但是其中一個聖誕…",
      "title": "我出生在嬰兒潮一代的父親是如何突然理解密碼(好的，比特幣)的。"
    }
  ],
  "title": "How my boomer father suddenly understood crypto (ok, bitcoin)",
  "created_utc": 1609166360,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My father is a boomer</p>\n\n<p>He&#39;s not too technical, he uses his smartphone as needed and looks into his email inbox once or twice a month. Bitcoin was always a mystery to him apart from the &quot;fact&quot; that it&#39;s a highly volatile investment. He prefers real estate investments. </p>\n\n<p>But one of the Christmas discussions suddenly made him understand crypto. I explained it as a way to stay liquid, independent from banks similar to what gold did for people after a war. Just that in this case, the scenario is not a war, but a financial crash such as in Greece, Argentinia, Venezuela, etc. where people suddenly discovered, that they either can&#39;t access their savings or that they were worthless. </p>\n\n<p>A week later he told me his investment software offers &quot;bitcoin&quot;. A closer look showed there was no way to withdraw it which made him say &quot;oh, so this is not real bitcoin then&quot;. That actually made me happier than him investing in this virtual bitcoin. </p>\n\n<p>TLDR: bitcoin is digital gold is a valid explanation for older people which doesn&#39;t need any technical details about Blockchain whatsoever</p>\n</div><!-- SC_ON -->",
  "score": 254,
  "permalink": "/r/CryptoCurrency/comments/kln90u/how_my_boomer_father_suddenly_understood_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "kln90u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495332514
}