{
  "author": "RobertM525",
  "original_created_utc": 1633714677,
  "title": "Prof Edward J. Watts argues that Eastern Roman Emperor Justinian destroyed the Western Roman Empire, not Odoacer. How well accepted is this interpretation?",
  "created_utc": 1633740711,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://time.com/6101964/fabricated-fall-rome-lessons-history/\">In this essay in <em>Time</em> magazine</a>, Edward J. Watts (professor of history at the University of California, San Diego) says,</p>\n\n<blockquote>\n<p>Although everyone from schoolchildren to scholars now learn that the Western Roman Empire fell in 476, 5th century Romans did not see anything particularly special about Odoacer’s coup.</p>\n</blockquote>\n\n<p>Instead, he says that Marcellinus invented the idea to help Eastern Roman Emperor Justinian justify invading Italy.</p>\n\n<blockquote>\n<p>Marcellinus’s manufactured fall of Rome helped create conditions that permitted Justinian to launch a war that killed hundreds of thousands and destroyed the prosperity that Roman rule had once created in the West.</p>\n</blockquote>\n\n<p>Thus, the actual fall of the Western Roman Empire is not in 476, but at some point in the 560s:</p>\n\n<blockquote>\n<p>The Eastern Roman Empire had recovered Italy—and destroyed much of it in the process.</p>\n\n<p>The Western Roman Empire had clearly fallen by the 560s.</p>\n</blockquote>\n\n<p>Is this interpretation of the events a popular one?</p>\n\n<p>As I recall, <em>How Rome Fell: Death of a Superpower</em> by Adrian Goldsworthy and <em>The Fall of the Roman Empire: A New History of Rome and the Barbarians</em> by Peter Heather (which I read some time ago) both more or less proceeded with the premise that the Western Roman Empire fell in 476.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/q42oyc/prof_edward_j_watts_argues_that_eastern_roman/",
  "subreddit": "AskHistorians",
  "id": "q42oyc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In this essay in Time magazine\n[https://time.com/6101964/fabricated-fall-rome-lessons-history/], Edward J.\nWatts (professor of history at the University of California, San Diego) says,\n\n> Although everyone from schoolchildren to scholars now learn that the Western\n> Roman Empire fell in 476, 5th…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイム誌に掲載されたこのエッセイでは\n[https://time.com/6101964/fabricated-fall-rome-lessons-history/], Edward J.\nWatts（カリフォルニア大学サンディエゴ校の歴史学教授）はこう言っています。\n\n> 今では小学生から学者まで、西ローマ帝国は476年に滅亡したと習っているが、5...\n> ローマ帝国は476年に滅亡したと小学生から学者までが知っているが、5...",
      "title": "エドワード・J・ワッツ教授は、東ローマ帝国の皇帝ユスティニアヌスが西ローマ帝国を滅ぼしたのであって、オドアセルを滅ぼしたのではないと主張している。この解釈はどの程度受け入れられているのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在《时代》杂志的这篇论文中\n[https://time.com/6101964/fabricated-fall-rome-lessons-history/]，Edward J．\nWatts（加州大学圣地亚哥分校的历史教授）说。\n\n> 尽管现在从小学生到学者都知道，西罗马帝国\n> 罗马帝国在476年灭亡，第五...",
      "title": "Edward J. Watts教授认为，东罗马皇帝查士丁尼摧毁了西罗马帝国，而不是奥多亚克。这种解释的接受程度如何？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在《時代》雜誌的這篇論文中\n[https://time.com/6101964/fabricated-fall-rome-lessons-history/]，Edward J．\nWatts（加州大學聖地亞哥分校的歷史教授）說。\n\n> 儘管現在從小學生到學者都知道，西羅馬帝國\n> 羅馬帝國在476年滅亡，第五...",
      "title": "Edward J. Watts教授認爲，東羅馬皇帝查士丁尼摧毀了西羅馬帝國，而不是奧多亞克。這種解釋的接受程度如何？"
    }
  ]
}