{
  "author": "joeroganthumbhead",
  "the_new_excerpt": "I hear all the time “you can’t beat the market in the long run”. I believe that\nthere are many simple reasons why most don’t.\n\nThe first reason I think is that people are greedy and once they see a stock\nmove up 100% in 6 months, they get fomo and hop on when really they should not\nhave done so.…",
  "original_created_utc": 1615151285,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我经常听到 \"长期来看，你无法战胜市场\"。我相信\n有很多简单的原因，为什么大多数人不这样做。\n\n第一个原因我认为是人都是贪婪的，一旦看到股票\n在6个月内上升100%，他们得到fomo和跳上，当他们真的不应该的时候。\n已经这样做....",
      "title": "长期战胜市场是不可能的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我經常聽到 \"長期來看，你無法戰勝市場\"。我相信\n有很多簡單的原因，爲什麼大多數人不這樣做。\n\n第一個原因我認爲是人都是貪婪的，一旦看到股票\n在6個月內上升100%，他們得到fomo和跳上，當他們真的不應該的時候。\n已經這樣做....",
      "title": "長期戰勝市場是不可能的？"
    }
  ],
  "title": "Beating the market in the long run impossible?",
  "created_utc": 1615170831,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I hear all the time “you can’t beat the market in the long run”. I believe that there are many simple reasons why most don’t. </p>\n\n<p>The first reason I think is that people are greedy and once they see a stock move up 100% in 6 months, they get fomo and hop on when really they should not have done so. Then they realize the hype has died and we see a correction where now they are down 15% from ATH, which brings me to my next point.</p>\n\n<p>The second reason is they PANIC. They see their investment loses 15% in a week and they realize they made a mistake. So they sell at a lost and move it to cash. Which brings me to my next point.</p>\n\n<p>Third reason I believe is that they don’t have PATIENCE! If you are convicted that a stock is a strong company, then you have to ride it out and be patient. Strong companies usually will pull through unless they are in a fraudulent situation.</p>\n\n<p>The biggest reasons, imo, are that people can just get greedy and get fomo then lose patience when their greed loses them money. </p>\n\n<p>Thoughts wanted. Thanks.</p>\n</div><!-- SC_ON -->",
  "score": 75,
  "permalink": "/r/stocks/comments/lzzqg9/beating_the_market_in_the_long_run_impossible/",
  "subreddit": "stocks",
  "id": "lzzqg9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542576982
}