{
  "author": "Nuclear_tit",
  "original_created_utc": 1641944039,
  "title": "Whenever the cryptocurrencies I held rose sharply, I would immediately sell and buy it so (I thought) that it will rise even higher the next time it rises. Today I learned that was a fucking stupid mistake of mine and totally stupid.",
  "created_utc": 1641980728,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I died of embarrassment today. Following conversation on Discord:&lt;/p&gt;\n\n&lt;p&gt;Me: I&amp;#39;ve been holding Ethereum since last January and I&amp;#39;m currently up 250%, but that&amp;#39;s also because I&amp;#39;ve sold it and bought it again many times when it was rising strongly.&lt;/p&gt;\n\n&lt;p&gt;My friend: Huh? Why is that?&lt;/p&gt;\n\n&lt;p&gt;Me (honorary math professor): Because I get more profit.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Silence&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Me: The following: Imagine investing 100€ in Ethereum. The price goes up by 20%. Now I have 120€. If I now sell and buy again - and disregard the transaction fees - and the price rises again by 20%, I am at 144€. If I had not sold, it would have risen by 40% and I would only have 140€. Understand?&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;LOUD SILENCE IN THE DISCORD CHAT&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Friend 1: Is it just me who thinks this is incredibly stupid?&lt;/p&gt;\n\n&lt;p&gt;Friend 2,3,4: No Nope Nah, that makes absolutely no sense &lt;/p&gt;\n\n&lt;p&gt;I (slowly despairing🥲), think to myself that I could have saved the transaction fees, which are astronomical with Coinbase anyway, for one thing, and that from now on the story will be held in front of me again and again if I don&amp;#39;t manage to clarify it now. So I try to explain the thing again and already during this I realize that it sounds really dumb.\nMy friends laugh at me and I cry (mentally).&lt;/p&gt;\n\n&lt;p&gt;Edit: That math professor thing is a joke&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 354,
  "permalink": "/r/CryptoCurrency/comments/s1r20v/whenever_the_cryptocurrencies_i_held_rose_sharply/",
  "subreddit": "CryptoCurrency",
  "id": "s1r20v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I died of embarrassment today. Following conversation on Discord:\n\nMe: I've been holding Ethereum since last January and I'm currently up 250%, but\nthat's also because I've sold it and bought it again many times when it was\nrising strongly.\n\nMy friend: Huh? Why is that?\n\nMe (honorary math…"
}