{
  "author": "MrHoovy17",
  "original_created_utc": 1644234835,
  "title": "Did Hitler want to eventually get rid of Christianity in Germany?",
  "created_utc": 1644247179,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello people of &lt;a href=\"/r/AskHistorians\"&gt;r/AskHistorians&lt;/a&gt;. Yesterday I was having an argument with a friend about whether or not the Third Reich was a Christian state. I was arguing that it wasn’t. Hitler just wanted to keep Christianity around for the time being to keep Germany stable during World War II and that had he succeeded he would’ve gotten rid of it later because a religion that preaches that you should be loyal to something other than the state (God) would not be great for an authoritarian like Hitler. My friend on the other hand was arguing that Nazi Germany was “super Christian” and he cited the fact that multiple German Churches and Christian organizations openly sided with Hitler and that most of the Wehrmacht’s uniforms had the phrase “Gott Mit Uns” on them. I argued that the Christian Churches and Organizations were only siding with Hitler so they would not face the same fate as the Jews. I also argued that the phrase “Gott Mit Uns” had been used by Prussia for 240 years at the point and that Hitler wasn’t going to just get rid of it. Anyway we both walked away frustrated because neither of us could convince the other that they were wrong. Can you guys help settle this by telling me who is correct? And please send evidence from credible sources because if I am right then my friend still won’t believe me unless I have credible sources to back up my claim. Thank You.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/smogms/did_hitler_want_to_eventually_get_rid_of/",
  "subreddit": "AskHistorians",
  "id": "smogms",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hello people of r/AskHistorians [/r/AskHistorians]. Yesterday I was having an\nargument with a friend about whether or not the Third Reich was a Christian\nstate. I was arguing that it wasn’t. Hitler just wanted to keep Christianity\naround for the time being to keep Germany stable during World War II…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/AskHistorians[/r/AskHistorians]の皆さん、こんにちは。昨日、私は\n第三帝国はキリスト教徒であったかどうかについて、友人と議論になりました。\n状態です。私は、そうではないと主張していました。ヒトラーはキリスト教を維持したかっただけで\n第二次世界大戦中、ドイツを安定させるために、当面は......。",
      "title": "ヒトラーは、最終的にドイツからキリスト教をなくしたかったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "r/AskHistorians[/r/AskHistorians]的人们，你们好。昨天我和一个朋友\n争论第三帝国是否是一个基督教国家的问题。\n国家。我争论说，它不是。希特勒只是想暂时保留基督教\n以保持德国在二战期间的稳定......",
      "title": "希特勒是否想最终在德国摆脱基督教？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "r/AskHistorians[/r/AskHistorians]的人們，你們好。昨天我和一個朋友\n爭論第三帝國是否是一個基督教國家的問題。\n國家。我爭論說，它不是。希特勒只是想暫時保留基督教\n以保持德國在二戰期間的穩定......",
      "title": "希特勒是否想最終在德國擺脫基督教？"
    }
  ]
}