{
  "author": "AnAccountForNews",
  "the_new_excerpt": "I had 45 of the unnamed ~~~ @ 40, and 220 BB @ 11. I quickly watched my 5k turn\ninto 20k. Was thrilled, this was almost approaching life changing money for me.\nUntil January 28th, when brokers systematically- and probably illegally- shut\noff the ability to buy ~~~ and BB (among others). I eventually…",
  "original_created_utc": 1614049664,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我的45个无名~~~@40，220个BB@11。我很快就看到了我的5公里转\n成2万。很激动，这对我来说几乎是接近改变生活的钱。\n直到1月28日，当经纪人系统地，而且可能是非法地关闭了\n关能买到~~~和BB（等）。我最终...",
      "title": "从1月28日开始就无法继续了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的45個無名~~~@40，220個BB@11。我很快就看到了我的5公里轉\n成2萬。很激動，這對我來說幾乎是接近改變生活的錢。\n直到1月28日，當經紀人系統地，而且可能是非法地關閉了\n關能買到~~~和BB（等）。我最終...",
      "title": "從1月28日開始就無法繼續了"
    }
  ],
  "title": "Can't move on from January 28th",
  "created_utc": 1614057275,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I had 45 of the unnamed ~~~ @ 40, and 220 BB @ 11. I quickly watched my 5k turn into 20k. Was thrilled, this was almost approaching life changing money for me. Until January 28th, when brokers systematically- and probably illegally- shut off the ability to buy ~~~ and BB (among others). I eventually sold ~~~ for a relatively small profit of 1.5k, and am currently bagholding BB, sitting just below my breakeven, absolutely drained of any momentum, however deserving or undeserving that momentum was.</p>\n\n<p>Now, every time I see it mentioned on reddit, everyone is acting like retail lost fair and square. Completely dismissive of the fact that WSB was right, and should&#39;ve won. I&#39;m not a diamond handed koolaid drinking ape anymore, but in a truly fair and open market, the squeeze would&#39;ve happened. But they cheated. <a href=\"https://www.reddit.com/r/wallstreetbets/comments/lmagzp/today_interactive_brokers_ceo_admits_that_without/\">Some of them are stupid enough to admit it on TV</a>. But now, reddit (and the world in general) is now completely dismissive of the fact that laws were almost certainly broken to absolutely rail retail investors just to save a few hedge funds.</p>\n\n<p>I consider myself lucky to escape with a profit, and I&#39;ve been told I &quot;shouldn&#39;t have gotten greedy.&quot; Bull shit. anyone who bought ~~~ before 10AM January 28th actually made a winning bet and were illegally fucked out of at least a 2 bagger. Not to mention the fact that they blocked buys on every popular ticker on reddit? What the fuck did BB have to do with anything? The amount of people who were fucked out of life changing money, just to save some hedge funds who would&#39;ve gotten bailed out one way or another. Some people who actually could&#39;ve used the money, some <a href=\"https://www.reddit.com/r/wallstreetbets/comments/l8c0u4/used_some_of_my_gme_tendies_to_buy_nintendo/\">who were donating winnings to charity</a>. Yes WSB is now a crazy cult, but we were once the good guys. </p>\n\n<p>I&#39;ve been told my whole life the game is rigged, but holy shit how is everyone ok with Jan 28th? It&#39;s keeping me up at night. Someone please convince me that all of this was perfectly fair and legal. Or help me accept the fact that it&#39;s all this rigged. What&#39;s the point in trying?</p>\n\n<p>Sincerely, a completely disillusioned new investor</p>\n</div><!-- SC_ON -->",
  "score": 268,
  "permalink": "/r/stocks/comments/lq7lo0/cant_move_on_from_january_28th/",
  "subreddit": "stocks",
  "id": "lq7lo0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332886308
}