{
  "author": "roberthonker",
  "the_new_excerpt": "Crypto is treated like a get rich quick scheme but many of the new users in this\nsub, which it is not. The only reliable way to make a life changing amount of\nmoney with crypto is consistent buying, and holding for the ultra-long term, no\nmatter what happens. I don't care what some kid made in their…",
  "original_created_utc": 1621565164,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号は一攫千金のように扱われていますが、新規ユーザーの多くは、このサブ\nていますが、決してそうではありません。人生を変えるほどの金額を稼ぐための唯一の確実な方法は\n暗号で人生を変えるほどの大金を稼ぐ唯一の確実な方法は、何が起きても一貫して購入し、超長期的に保有することです。\n何が起こっても、一貫して購入し、超長期的に保有することです。どこかの子供が自分で稼いだお金なんて気にしません。",
      "title": "あなたが聞いたことのある巨大な利益を知っていますか？それにはダイヤモンドの手と長年の努力が必要であり、短期的なクソコイン投資ではない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "加密货币被当作快速致富的计划，但许多新用户在这个\n子，但它并不是。赚取改变生活的金额的唯一可靠方法是\n唯一可靠的方法是持续购买加密货币，并长期持有，无论发生什么情况。\n不管发生什么事。我不关心一些孩子在他们的生活中赚了什么。",
      "title": "你知道那些你听说过的巨大收益吗？那些需要钻石般的双手和多年的奉献，而不是短期的狗屎币投资。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "加密貨幣被當作快速致富的計劃，但許多新用戶在這個\n子，但它並不是。賺取改變生活的金額的唯一可靠方法是\n唯一可靠的方法是持續購買加密貨幣，並長期持有，無論發生什麼情況。\n不管發生什麼事。我不關心一些孩子在他們的生活中賺了什麼。",
      "title": "你知道那些你聽說過的巨大收益嗎？那些需要鑽石般的雙手和多年的奉獻，而不是短期的狗屎幣投資。"
    }
  ],
  "title": "You know those massive gains you've heard about? Those require diamond hands and years of dedication, not short term shitcoin investments.",
  "created_utc": 1621578989,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Crypto is treated like a get rich quick scheme but many of the new users in this sub, which it is not. The only reliable way to make a life changing amount of money with crypto is consistent buying, and holding for the ultra-long term, no matter what happens. I don&#39;t care what some kid made in their Shiba coin, that is a fluke in my books.</p>\n\n<p><strong>If you truly want to be rich, you need to buy on a schedule, and develop a strong stomach for dips. YOU WILL NOT GET RICH IN A FEW MONTHS. This requires dedication and balls of steel.</strong></p>\n</div><!-- SC_ON -->",
  "score": 9784,
  "permalink": "/r/CryptoCurrency/comments/nhi8ki/you_know_those_massive_gains_youve_heard_about/",
  "subreddit": "CryptoCurrency",
  "id": "nhi8ki",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197381668
}