{
  "author": "aquatermain",
  "original_created_utc": 1631532765,
  "title": "Monday Methods: Revisiting Female Composers and their Contributions to Western Art Music",
  "created_utc": 1631603829,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For the vast majority of human history, women have been relegated to a supporting, secondary role. I’d love to be able to say that patriarchal heteronormativity is over and done with, but it ain’t. Femininity and womanhood continue to be minimized and associated with weakness and emotionality. History, both in its disciplinary and everyday interactions with society, has often chosen to diminish women’s role, deeming their contributions to every aspect of social life as insignificant, as a direct consequence of a tendency to underestimate their skills and capabilities.</p>\n\n<p>Music is, undoubtedly, one of the core cultural spaces in which women have remained almost entirely invisible. Don’t believe me? Brief recap then. During the early Middle Ages, both musical performance and composition were entirely dominated by men. It wasn’t until the motet showed up in the 12C that, out of sheer necessity, women started to be included in church choirs. A motet is a composition style based on biblical texts sung in Latin, designed to be performed during masses. Because these new compositions tended to require higher pitches in their vocal instrumentation, women became a necessary evil; but the overwhelming majority of compositions were still done by men, and those that were done by women were largely forgotten until contemporary scholarship showed up.</p>\n\n<p>Moving forward we come across the Renaissance and the Baroque periods, when European aristocrats started considering that it was necessary for the women in their families, i.e. their daughters or wards, to complement their traditional “female” education with singing, dancing and musical interpretation lessons - particularly playing the harpsichord and the violin -. However, the objective of such a musical education was purely to embellish social gatherings, or to provide entertainment for the family’s guests, which is yet another reason why the artistic expression of women ended up being relegated to the private sphere.</p>\n\n<p>This discrimination sticks around all the way to the 20C. At the beginning of the 1900s, English conductor Sir Thomas Beecham said “There are no women composers, never have been and possibly never will be”.</p>\n\n<p>And then, far closer to right about now, world famous Indian conductor Zubin Metha said in a 1970 interview with The New York Times “I just don&#39;t think women should be in an orchestra. They become men. Men treat them as equals; they even change their pants in front of them. I think it&#39;s terrible!”</p>\n\n<p>So today, let’s try to remediate some of that by looking at the fascinating contributions to art music done by three female composers throughout modern and recent history. Let’s prove these old men wrong.</p>\n\n<p><strong>Of siblings and brilliance</strong></p>\n\n<p>Fanny Mendelssohn was born in 1805 in Hamburg, the eldest of four siblings which included Felix Mendelssohn, who would become one of the most renowned composers of the Romantic period. She’s considered to be the most prolific of all female composers, and one of the most prolific composers of the 19C, period, with 465 compositions catalogued to date.</p>\n\n<p>Her family was Jewish, but as a result of the pointed antisemitic tendencies of the German states of their time, her father decided to add a second surname to the family name, Bartholdy, converting the family to Protestantism, baptizing all four children in 1816. It was around this time that Fanny started receiving her first piano lessons from her mother. After demonstrating undeniable technical skill, she received formal training alongside her younger brother Felix.</p>\n\n<p>Even though she was well known as an accomplished virtuoso pianist in her private life, she only performed in public once, in 1838, and her life as a composer was underscored by the extreme misogyny of her time. Her family, Felix included, was not keen on her compositions being published, and several of her works were actually published under Felix’s name, which led to one of the most famous anecdotes involving the two siblings. In 1842, Queen Victoria invited Felix, by then an extremely famous composer, to visit Buckingham Palace. During said visit, Victoria expressed her desire to sing her favorite lied (song) of his, called <a href=\"https://www.youtube.com/watch?v=OSA029AGsY8\">Italien</a>, to which Felix had no choice but to acknowledge that the song had actually been composed by Fanny.</p>\n\n<p>Fanny died five years after this incident, aged 41, after suffering a stroke while rehearsing one of her brother’s cantatas. Felix died only six months later, after a long period of illness and depression, thought to have been aggravated by the death of his beloved sister. Because make no mistake, Felix loved Fanny dearly. His views on the publishing of her works aside, he always credited her as his greatest inspiration, and always admired her as one of the finest composers he’d ever known. Here’s another one of her pieces, my favorite, the first movement of her <a href=\"https://www.youtube.com/watch?v=FI-ldlmqhSM\">Piano Trio in D Minor, opus 11</a>.</p>\n\n<p><strong>Across the ocean</strong></p>\n\n<p>Our next composer was from the US! Let’s get to know Amy Beach. Born Amy Cheney in 1867 in New Hampshire, she was a child prodigy and genius, being capable not only of speaking perfectly when she was just one year old, but also of reciting by heart over 40 different songs. Yes, seriously. By the time she was 2 she was already improvising counterpoints, and she wrote her first compositions when she was 4. Yes, seriously.</p>\n\n<p>Her work is particularly noteworthy because she didn’t receive a traditional European musical education; in fact, she only received a very rudimentary education in composition and harmony: she was an autodidact composer. She was also an extremely accomplished pianist, but her career was initially cut short by her marriage to a man 24 years older than her, Henry Beach. She was expected to abandon her musical life as an educator, one of her passions, in order to become a good wife and socialité, being allowed only 2 public performances a year. However, she continued composing regardless of her husband’s disapproval.</p>\n\n<p>Here’s her only <a href=\"https://www.youtube.com/watch?v=hcecDAy2RO8\">Piano Concerto</a>, composed between 1898 and 1899. It’s divided in four movements, with the second and third ones being based on songs composed by herself, ending with a fourth movement that starts with a somber and lethargic take on the third’s main theme, with a faster paced twist near the final coda. It was dedicated to world renowned Venezuelan pianist Teresa Carreño. Sadly, by the time it was premiered in 1900, the critics demolished it so badly, Carreño thanked Beach for the dedication, but refused to actually perform it in public. However, nowadays it’s considered to be a masterpiece of the Concerto genre, being one of the key pieces of the US piano repertoire.</p>\n\n<p>Here’s a piece of hers that solidified her position as a composer so much that the initial backlash the Concerto received didn’t actually affect her reputation: the first symphony composed by an American woman, her <a href=\"https://www.youtube.com/watch?v=ez5wd-Sa66Q\">Symphony in E Minor</a>, nicknamed the Gaelic. Of the over 200 hundred classical works and 150 popular songs Beach composed, the Gaelic is without a doubt her most famous piece. Published in 1897, two years before the Concerto, its composition demanded three years of her life.</p>\n\n<p>Beach credited Antonin Dvořák as her main influence for the symphony. Dvořák had lived in the US for several years, which he spent travelling and researching popular music from the US, with a particular interest in the music of the Indigenous Peoples of North América. Beach’s Gaelic symphony was nicknamed that because she thought, in her youth, that Gaelic folk styles had been one of the primary influences in the development of US musical styles. However, in her maturity as a composer, she shifted her focus, more interested in the indigenous music that had so fascinated Dvořák.</p>\n\n<p>Beach became a widow and an orphan in 1910. After a few years of travelling through Europe, grieving and slowly getting back into the musical scene, she was finally able to dedicate more and more time to music pedagogy and teaching. Her time in Europe had a reinvigorating effect on her interest for music, going as far as stating that in Europe, music was “put on a so much higher plane than in America, and universally recognized and respected by all classes and conditions as the great art which it is.”</p>\n\n<p>Upon her return to the US, Beach became an even fiercer advocate for the musical education of women, both in performance and in composition, using her considerable network of contacts to further the careers of individual performers such as operatic soprano Marcella Craft, and of many different clubs and organizations destined to provide women with the tools to develop and hone their musical skills and expertise. She died in 1944, after more than four decades of working towards bettering the working and educational conditions of women in the musical sphere, both in the US and the rest of the world.</p>\n\n<p><strong>Women should also be visible in the Global South</strong></p>\n\n<p>Jacqueline Nova was born in 1935 in Belgium. Her father, a Colombian citizen, took his family back to his homeland when she was still a child, where Nova took her first piano lessons, aged seven. She showed the technical skill for composition from a very young age, which led her to abandon her performance studies to focus on composition at the National University of Colombia’s Conservatoire, graduating in 1967. During her rather brief career, she composed over sixty pieces, focusing primarily on incidental music and film scoring. As a brief definition, incidental music is a type of art music that tends to have certain instrumentation similarities with classical music, but that is exclusively composed to accompany plays, television shows and movies. </p>\n\n<p>Aside from her work with incidental music, she composed most of her works as art music, utilizing two composition styles called dodecaphonism (or twelve-tone technique) and serialism that were all the rage at the time, taught to her by her teacher, Argentine composer Alberto Ginastera. </p>\n\n<p>Ginastera was, according to Nova, her greatest musical influence, because he showed her the beauty of these two styles, both of them derived from the principle of atonality. Dodecaphonism consists of considering the twelve notes in the chromatic scale as equal, without any form of hierarchy amongst them, which allows the composer to break away with the scale itself in order to rearrange notes in whichever way they wish.</p>\n\n<p>On the other hand, serialism was born as an evolution of twelve-tone. Just as dodecaphonism is based on the de-hierarchization of the chromatic scale, serialism takes atonal experimentation one step further, by establishing that, after a note has been used, the other eleven have to be used in some way before the original note can be used. However, this isn’t an absolute structure, because atonal styles are characterized by their inherent rejection of traditional compositional structures, so a composer may eliminate a note from the combination altogether if they so wish.</p>\n\n<p>Nova became enthralled by these new forms, applying them to the overwhelming majority of her pieces, creating a type of music that is eternally changing, shifting, full of its own personality, wth melodies that are almost anthropomorphic, temperamental.</p>\n\n<p>Soon after she returned to Colombia after studying with Ginastera in Buenos Aires, she was diagnosed with bone cancer, which she battled for years until her death in 1975. Out of all her works, I’m particularly fond of her <a href=\"https://www.youtube.com/watch?v=2wsQUMdZn-Q\">Metamorfosis III</a> for orchestra, published in 1966 and considered by Nova herself to be her favorite work. There is something viscerally powerful in this piece, composed by one of Latin América’s most accomplished composers, that I just can’t help but to share with everyone. To me, and this is an entirely subjective appreciation, this piece is about transformation as the beginning and the end of art, of human expression, it’s happy, aggressive, patient, mysterious, pulsating. </p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/pndkk5/monday_methods_revisiting_female_composers_and/",
  "subreddit": "AskHistorians",
  "id": "pndkk5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For the vast majority of human history, women have been relegated to a\nsupporting, secondary role. I’d love to be able to say that patriarchal\nheteronormativity is over and done with, but it ain’t. Femininity and womanhood\ncontinue to be minimized and associated with weakness and emotionality.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人類の歴史の大部分で、女性は脇役、二次的な役割に追いやられてきました。\n脇役、副次的な役割に追いやられてきました。家父長制や異性愛が終わったと言いたいところですが、そうではありません。\n異形性は終わったと言いたいところですが、そうではありません。女らしさ、女性らしさは\n女性性や女性らしさは、弱さや感情と結びつけられ、最小化され続けています....",
      "title": "月曜日のメソッド。女性作曲家とその西洋芸術音楽への貢献を再考する"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在人类历史的绝大部分时间里，妇女一直被贬为配角、次要角色。\n辅佐的、次要的角色。我很想说，父权制\n我很想说，父权制的异性恋已经结束了，但它并没有结束。女性气质和女性身份\n继续被最小化，并与软弱和情感联系在一起....。",
      "title": "星期一的方法。重新审视女性作曲家及其对西方艺术音乐的贡献"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在人類歷史的絕大部分時間裏，婦女一直被貶爲配角、次要角色。\n輔佐的、次要的角色。我很想說，父權制\n我很想說，父權制的異性戀已經結束了，但它並沒有結束。女性氣質和女性身份\n繼續被最小化，並與軟弱和情感聯繫在一起....。",
      "title": "星期一的方法。重新審視女性作曲家及其對西方藝術音樂的貢獻"
    }
  ]
}