{
  "author": "AskScienceModerator",
  "original_created_utc": 1627642821,
  "title": "AskScience AMA Series: We invented a better version of CRISPR. Ask us anything!",
  "created_utc": 1627650314,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We are CRISP-HR Therapeutics, Inc., an early stage biotech company which has developed a dramatically improved CRISPR-based genetic engineering platform, Cas9-HR. The improvements include increased editing efficiency enabling previously unfeasible large edits (1000s of base pairs) at a clinically viable level, in addition to lower cellular toxicity. Our Cas9-HR Platform represents an exciting step for gene editing.</p>\n\n<p>We plan to use our Cas9-HR Platform to develop therapeutics, specifically treatments for genetic diseases that are caused by a diverse number of mutations. Since existing high-efficiency CRISPR technologies are limited to small edits (1-50 base pairs), we believe this is an area where we can make a significant impact.</p>\n\n<p>Answering questions today are the two co-founders:</p>\n\n<ul>\n<li>Chris Hackley, PhD, CEO: <a href=\"/u/chris-hackley-chr\">/u/chris-hackley-chr</a>: Chris has 11+ years experience in a variety of biological areas, with particular expertise in protein and genetic engineering. Chris earned his BS in MCD Biology from UCSB, and PhD in protein engineering from NYU.</li>\n<li>Richard Gavan, MSc, CTO: <a href=\"/u/richard-gavan-chr\">/u/richard-gavan-chr</a>: Richard has 8+ years experience consulting in IT for the life sciences industry. Richard earned his BA in Philosophy and Psychology from UCSB, and MSc in Computer Science from Georgia Tech (OMSCS).</li>\n</ul>\n\n<p>We&#39;ll start answering questions at 19:00 UTC (8pm BST, 3pm EDT, 12pm PDT) on Friday, July 30th. We&#39;re looking forward to hearing from you!</p>\n</div><!-- SC_ON -->",
  "score": 121,
  "permalink": "/r/askscience/comments/ouifcb/askscience_ama_series_we_invented_a_better/",
  "subreddit": "askscience",
  "id": "ouifcb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We are CRISP-HR Therapeutics, Inc., an early stage biotech company which has\ndeveloped a dramatically improved CRISPR-based genetic engineering platform,\nCas9-HR. The improvements include increased editing efficiency enabling\npreviously unfeasible large edits (1000s of base pairs) at a clinically…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちは、CRISP-HRセラピューティクス・インクというアーリーステージのバイオテック企業で、以下のことを行っています。\nCRISP-HR Therapeutics Inc.は、劇的に改良されたCRISPRベースの遺伝子工学プラットフォームを開発したアーリーステージのバイオテクノロジー企業です。\nCas9-HRです。改良点としては、編集効率の向上により\nこれまで実現できなかった大規模な編集（数千塩基対）を、臨床的に問題のないレベルで行うことができます。",
      "title": "AskScience AMAシリーズ。私たちはCRISPRのより良いバージョンを発明しました。何でも聞いてください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们是CRISP-HR Therapeutics, Inc.，一家处于早期阶段的生物技术公司。\n该公司开发了一个显著改善的基于CRISPR的基因工程平台。\nCas9-HR。这些改进包括提高编辑效率，使\n以前不可行的大型编辑（1000个碱基对）在临床上的应用。",
      "title": "AskScience AMA系列。我们发明了一个更好的CRISPR版本。问我们任何问题!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們是CRISP-HR Therapeutics, Inc.，一家處於早期階段的生物技術公司。\n該公司開發了一個顯著改善的基於CRISPR的基因工程平臺。\nCas9-HR。這些改進包括提高編輯效率，使\n以前不可行的大型編輯（1000個鹼基對）在臨牀上的應用。",
      "title": "AskScience AMA系列。我們發明了一個更好的CRISPR版本。問我們任何問題!"
    }
  ]
}