{
  "author": "ghostof_IamBeepBeep2",
  "the_new_excerpt": "I think the traditional islamic narrative is that muhammed received the quran in\na cave from the angel gabriel, and the fact that muhammed was illiterate is used\nas evidence that it came from god since it couldn't have been written by him.\n\nI would expect there isn't much certainty on how the quran…",
  "original_created_utc": 1616202802,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我认为传统的伊斯兰教的说法是穆罕默德收到了《古兰经》。\n从天使加布里埃尔的洞穴，和穆罕默德是文盲的事实被利用。\n作为证据证明它来自上帝，因为它不可能是上帝写的。\n\n我希望没有太多的确定性 关于古兰经是如何... ...",
      "title": "世俗历史学家认为《古兰经》是怎么写的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲傳統的伊斯蘭教的說法是穆罕默德收到了《古蘭經》。\n從天使加布裏埃爾的洞穴，和穆罕默德是文盲的事實被利用。\n作爲證據證明它來自上帝，因爲它不可能是上帝寫的。\n\n我希望沒有太多的確定性 關於古蘭經是如何... ...",
      "title": "世俗歷史學家認爲《古蘭經》是怎麼寫的？"
    }
  ],
  "title": "How do secular historians think the quran was written?",
  "created_utc": 1616223536,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think the traditional islamic narrative is that muhammed received the quran in a cave from the angel gabriel, and the fact that muhammed was illiterate is used as evidence that it came from god since it couldn&#39;t have been written by him.</p>\n\n<p>I would expect there isn&#39;t much certainty on how the quran was written, but do historians have speculations on how it could&#39;ve been written? </p>\n\n<p>How plausible is it that a succesfull merchant in arabia such as muhammed was illiterate? is there reason to doubt his illiteracy?</p>\n\n<p>Are there any literate individuals that could&#39;ve helped/participated in the writing of the quran?</p>\n\n<p>I&#39;ve heard that the quran is a very impressive text in terms of its prose in the original arabic. Would it take a skilled writer to have written the quran? how hard were those to come by in arabia? I&#39;ve heard that there was a literary/poetic tradition in arabia, presumably that would provide for a decent supply to skilled writers to have written the quran?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/m8w4xp/how_do_secular_historians_think_the_quran_was/",
  "subreddit": "AskHistorians",
  "id": "m8w4xp",
  "is_self": true,
  "media": null,
  "is_video": false
}