{
  "author": "electrickeyez",
  "original_created_utc": 1649541328,
  "title": "Not to be a d***, but if the U.S. government decides to \"waive\" student loans, what do I get for actually paying mine?",
  "created_utc": 1649555746,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Grew up lower middle class in a Midwest rust belt town. Stayed close to my hometown. Went to a regional college, got my MBA. Worked hard (not in a preachy sense, it&amp;#39;s just true, I work very hard.) I paid off roughly $70k in student loans pretty much dead on schedule.  I have long considered myself a Progressive, but I now find myself asking... WHAT WILL I GET when these student loans are waived? This truly does not seem fair.&lt;/p&gt;\n\n&lt;p&gt;I have a lot friends in their twenties and thirties, with a big student debt load and they&amp;#39;re all rooting for this to happen. All they do is complain about how unfair their student debt burden is, as they constantly extend the payments.... but all I see is that they mostly moved away to expensive big cities chasing social lives, etc. They knew what they were getting into. We all did. I can&amp;#39;t help but see this all as a very unfair deal for those of who PAID. So I ask, legitimately, what will I get?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/TooAfraidToAsk/comments/u03a31/not_to_be_a_d_but_if_the_us_government_decides_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "u03a31",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Grew up lower middle class in a Midwest rust belt town. Stayed close to my\nhometown. Went to a regional college, got my MBA. Worked hard (not in a preachy\nsense, it's just true, I work very hard.) I paid off roughly $70k in student\nloans pretty much dead on schedule. I have long considered myself a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "中西部のさびれた町で、中流以下の階級に育ちました。中西部の田舎町で\n故郷です。地方の大学に進学し、MBAを取得しました。一生懸命に働いた（説教臭くなく\n私はとてもよく働きます。） 私は約7万ドルの学生を完済しました。\nローンはほぼ予定通り。私は長い間、自分自身を...",
      "title": "しかし、もしアメリカ政府が学生ローンを「免除」すると決めたら、私は何をもらえるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在中西部的一个铁锈地带的小镇上长大的中下阶层。靠近我的\n家乡。上了一所地区性大学，拿到了MBA。勤奋工作（不是说教的意思，而是说\n意思是说，这只是事实，我非常努力工作。） 我还清了大约7万美元的学生贷款。\n贷款，几乎是如期完成。长期以来，我一直认为自己是一个...",
      "title": "我不是想说什么，但如果美国政府决定 \"免除 \"学生贷款，我实际支付我的贷款能得到什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在中西部的一個鐵鏽地帶的小鎮上長大的中下階層。靠近我的\n家鄉。上了一所地區性大學，拿到了MBA。勤奮工作（不是說教的意思，而是說\n意思是說，這只是事實，我非常努力工作。） 我還清了大約7萬美元的學生貸款。\n貸款，幾乎是如期完成。長期以來，我一直認爲自己是一個...",
      "title": "我不是想說什麼，但如果美國政府決定 \"免除 \"學生貸款，我實際支付我的貸款能得到什麼？"
    }
  ]
}