{
  "author": "Pashahlis",
  "original_created_utc": 1635270209,
  "title": "How true is the common argument that the introduction of gunpowder weapons in medieval Europe slowly shifted the balance of power away from the nobility towards the non-noble classes, as now anyone with 2 weeks of training could defeat a heavily armoured knight?",
  "created_utc": 1635291982,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Whereas previously armies depended a lot on warriors from the nobility, which trained hard for years with the sword and lance and wore heavy armour, now any common peasant could defeat said armour, training and sword with just two weeks of training and a well placed shot. This in turn shifted the power balance slowly in favour of the non-noble classes.</p>\n\n<p>How true is that statement?</p>\n\n<p><strong>And did the crossbow have a similar effect?</strong></p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/qgbts1/how_true_is_the_common_argument_that_the/",
  "subreddit": "AskHistorians",
  "id": "qgbts1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Whereas previously armies depended a lot on warriors from the nobility, which\ntrained hard for years with the sword and lance and wore heavy armour, now any\ncommon peasant could defeat said armour, training and sword with just two weeks\nof training and a well placed shot. This in turn shifted the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "以前の軍隊は、貴族の戦士に多くを依存していた。\n何年も剣や槍の訓練を受け、重厚な鎧を身につけていましたが、今ではどんな庶民でも\n今では、どんな農民でも、たった2週間の訓練と的確な射撃で、その鎧や訓練、剣を打ち破ることができます。\n今では、どんな一般の農民でも、たった2週間の訓練と的確な射撃で、その鎧や訓練、剣を打ち破ることができるのです。これにより、貴族の間では...",
      "title": "中世ヨーロッパで火薬兵器が導入されたことにより、パワーバランスが貴族から非貴族へと徐々に変化し、2週間の訓練で誰でも重装甲の騎士を倒せるようになったという一般的な議論は、どの程度正しいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "以前，军队主要依靠来自贵族的战士，他们长年累月地接受剑和长矛的艰苦训练，并穿着沉重的盔甲。\n他们经过多年艰苦的剑术和长矛训练，并穿着厚重的盔甲，而现在任何一个\n现在，任何一个普通的农民都可以通过两个星期的训练和良好的布置，打败上述的盔甲、训练和剑。\n现在，任何一个普通的农民只需经过两周的训练和一个好的射击就能打败上述的盔甲、训练和剑。这反过来又改变了...",
      "title": "有一种常见的说法是，火药武器在中世纪欧洲的引入慢慢地将权力的平衡从贵族转移到了非贵族阶层，因为现在任何经过2周训练的人都可以击败全副武装的骑士，这种说法的真实性如何？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "以前，軍隊主要依靠來自貴族的戰士，他們長年累月地接受劍和長矛的艱苦訓練，並穿着沉重的盔甲。\n他們經過多年艱苦的劍術和長矛訓練，並穿着厚重的盔甲，而現在任何一個\n現在，任何一個普通的農民都可以通過兩個星期的訓練和良好的佈置，打敗上述的盔甲、訓練和劍。\n現在，任何一個普通的農民只需經過兩週的訓練和一個好的射擊就能打敗上述的盔甲、訓練和劍。這反過來又改變了...",
      "title": "有一種常見的說法是，火藥武器在中世紀歐洲的引入慢慢地將權力的平衡從貴族轉移到了非貴族階層，因爲現在任何經過2周訓練的人都可以擊敗全副武裝的騎士，這種說法的真實性如何？"
    }
  ]
}