{
  "author": "joereddington",
  "the_new_excerpt": "Alan Turing's Birthday is on the 23rd of June. We're going to make it special,\nand I think r/cryptoCurrency [https://www.reddit.com/r/cryptoCurrency/] might\nhave a special place in its heart for the most famous name in (breaking)\nencryption...\n\nEvery year, people from Reddit pledge bunches of…",
  "original_created_utc": 1623760649,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アラン・チューリングの誕生日は6月23日です。私たちはそれを特別なものにするつもりです。\nそして、r/cryptoCurrency [https://www.reddit.com/r/cryptoCurrency/]では\n暗号化で最も有名な人物のために、特別な場所を用意することになるでしょう。\nencryption...\n\n毎年、Redditの人々は束になって誓う...",
      "title": "毎年、マンチェスターにあるアラン・チューリングの誕生日には、彼の銅像に花を捧げています。あと一週間ほどです。誰か花を贈りませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "阿兰-图灵的生日是在6月23日。我们要让它变得特别。\n我认为r/cryptoCurrency[https://www.reddit.com/r/cryptoCurrency/]可能会\n在其心中有一个特殊的位置，以纪念这位在（破解）加密领域最著名的名字\n加密领域最著名的名字...\n\n每年，来自Reddit的人们都会认捐一捆...",
      "title": "每年，我们都会在阿兰-图灵在曼彻斯特的雕像前为他的生日献上鲜花。还有一个多星期就到了。谁想送一些？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "阿蘭-圖靈的生日是在6月23日。我們要讓它變得特別。\n我認爲r/cryptoCurrency[https://www.reddit.com/r/cryptoCurrency/]可能會\n在其心中有一個特殊的位置，以紀念這位在（破解）加密領域最著名的名字\n加密領域最著名的名字...\n\n每年，來自Reddit的人們都會認捐一捆...",
      "title": "每年，我們都會在阿蘭-圖靈在曼徹斯特的雕像前爲他的生日獻上鮮花。還有一個多星期就到了。誰想送一些？"
    }
  ],
  "title": "Every year, we lay flowers at Alan Turing's statue in Manchester for his Birthday. It's in just over a week. Who wants to send some?",
  "created_utc": 1623779687,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Alan Turing&#39;s Birthday is on the 23rd of June.  We&#39;re going to make it special, and I think <a href=\"https://www.reddit.com/r/cryptoCurrency/\">r/cryptoCurrency</a> might have a special place in its heart for the most famous name in (breaking) encryption...</p>\n\n<p>Every  year, people from Reddit pledge bunches of flowers to be placed at Alan  Turing&#39;s statue in Manchester, UK, for his  birthday. In the process we  raise money for the amazing charity <a href=\"https://www.specialeffect.org.uk/\">Special Effect</a>, which helps people with disabilities access computer games.</p>\n\n<p>Since  2013 we&#39;ve raised about £7600 doing this, and we&#39;d like 2021 to  be our  biggest year ever. Anyone who wants to get involved is welcome.   Donations are made up of £3.50 to cover the cost of your flowers and a   £14 charity contribution to Special Effect for a total of £17.50.</p>\n\n<p>Manchester  city council have confirmed they are fine with it, and we  have people  in Manchester who will help handle the set up and clean up.</p>\n\n<p>To find out more and to donate, click <a href=\"https://equalitytime.github.io/FlowersForTuring/?utm_source=Reddit&amp;utm_content=cryto\">here</a>.  unless you&#39;d like to donate in cypto, which you will have to dm me to  set up (and I&#39;ll have to write a policy for the charity about it, but  that will be fun, I don&#39;t know any other charities that have one of  those and I&#39;d like to bring it up in conversation with them)</p>\n\n<p>Joe</p>\n</div><!-- SC_ON -->",
  "score": 204,
  "permalink": "/r/CryptoCurrency/comments/o0dcvx/every_year_we_lay_flowers_at_alan_turings_statue/",
  "subreddit": "CryptoCurrency",
  "id": "o0dcvx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009739992
}