{
  "author": "Kingkong_smoldong",
  "original_created_utc": 1628616410,
  "title": "5 out of the 6 US Senators against Crypto are over 65 years old. Do you really think they know anything about crypto?",
  "created_utc": 1628635965,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Seriously now wtf is wrong with this picture. Some of these senators should be retired, yet they are trying to literally ruin future generations. I would love to ask any of them what a blockchain is or what a satoshi is. These “politicians” do not need to be messing with something they don’t know shit about. \nThank you for coming to my pissed off TED talk.</p>\n</div><!-- SC_ON -->",
  "score": 3178,
  "permalink": "/r/CryptoCurrency/comments/p1txxi/5_out_of_the_6_us_senators_against_crypto_are/",
  "subreddit": "CryptoCurrency",
  "id": "p1txxi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Seriously now wtf is wrong with this picture. Some of these senators should be\nretired, yet they are trying to literally ruin future generations. I would love\nto ask any of them what a blockchain is or what a satoshi is. These\n“politicians” do not need to be messing with something they don’t know…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "真面目な話、この写真には何か問題があるのでしょうか？この議員たちの何人かは引退しているはずなのに\n文字通り将来の世代を破滅させようとしているのです。私は彼らに\n彼らにブロックチェーンとは何か、サトシとは何かを聞いてみたいものです。これらの\nこれらの「政治家」は、知らないものに手を出す必要はありません...。",
      "title": "暗号に反対している米国上院議員6人のうち5人は65歳以上。彼らがCryptoについて何か知っていると本当に思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "说真的，现在这幅画有什么问题。这些参议员中有些人应该是\n退休了，但他们却试图真正地毁掉后代。我很想\n问他们中的任何一个人，什么是区块链，什么是聪聪。这些\n\"政客 \"不需要搞他们不知道的东西......",
      "title": "反对加密货币的6位美国参议员中，有5位超过65岁。你真的认为他们对加密货币有所了解吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說真的，現在這幅畫有什麼問題。這些參議員中有些人應該是\n退休了，但他們卻試圖真正地毀掉後代。我很想\n問他們中的任何一個人，什麼是區塊鏈，什麼是聰聰。這些\n\"政客 \"不需要搞他們不知道的東西......",
      "title": "反對加密貨幣的6位美國參議員中，有5位超過65歲。你真的認爲他們對加密貨幣有所瞭解嗎？"
    }
  ]
}