{
  "author": "myoco",
  "original_created_utc": 1656765163,
  "title": "Bitcoin was supposed to be a currency but has quickly become the Dow Jones of crypto and that scares the shit out of me.",
  "created_utc": 1656818831,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Currently on mobile so I’m unable to post graphs and charts with useless lines and maybe a red circle. With all of this “Security vs. Commodity” bullshit people are really getting away from the original aspect of Bitcoin. Venezuela just bought how much more in hopes of restoring their economy? I am huge in the FOREX market (full time job, actually) and I just can’t wrap my head around how people think BTC is ever going to make it unless we go back to our roots. It is a currency. It should not have this much volatility. It is a currency.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 347,
  "permalink": "/r/CryptoCurrency/comments/vpqthc/bitcoin_was_supposed_to_be_a_currency_but_has/",
  "subreddit": "CryptoCurrency",
  "id": "vpqthc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Currently on mobile so I’m unable to post graphs and charts with useless lines\nand maybe a red circle. With all of this “Security vs. Commodity” bullshit\npeople are really getting away from the original aspect of Bitcoin. Venezuela\njust bought how much more in hopes of restoring their economy? I am…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在モバイルのため、無駄な線が入ったグラフやチャートの投稿ができません\nグラフやチャートを掲載することができません。証券vsコモディティ」なんていう戯言を言っていると\nビットコインの本来の姿から遠ざかりつつあります。ベネズエラ\nは、経済回復のためにどれだけ買い増したのでしょうか？私は...",
      "title": "ビットコインは通貨であるはずなのに、あっという間に暗号のダウ・ジョーンズになってしまったので、私は怖くて仕方がありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "目前在手机上，所以我无法用无用的线条来发布图表。\n也许还有一个红圈。随着所有这些 \"安全与商品 \"的废话\n人们真的远离了比特币最初的一面。委内瑞拉\n刚买了多少，希望能恢复他们的经济？我是...",
      "title": "比特币本来是一种货币，但很快就变成了加密货币中的道琼斯，这让我很害怕。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "目前在手機上，所以我無法用無用的線條來發布圖表。\n也許還有一個紅圈。隨着所有這些 \"安全與商品 \"的廢話\n人們真的遠離了比特幣最初的一面。委內瑞拉\n剛買了多少，希望能恢復他們的經濟？我是...",
      "title": "比特幣本來是一種貨幣，但很快就變成了加密貨幣中的道瓊斯，這讓我很害怕。"
    }
  ]
}