{
  "author": "partymsl",
  "original_created_utc": 1660252330,
  "title": "Finally, Robinhood is facing claims of market manipulation during the 2021 \"meme-rally\" by US Judges. Very well deserved for them.",
  "created_utc": 1660265923,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A US judge just confirmed that Robinhood must face the claims of market manipulation by restricting trading during the 2021 meme-stock/crypto rally. After the many other problems including ever-decreasing users this is another one for Robinhood and actually a very well deserved one as they did indeed manipulate markets back then.&lt;/p&gt;\n\n&lt;p&gt;I still remember how we were having claims that trading is not processing on Robinhood servers etc just as the crypto or meme stock started to pump and then made it dumb as no one could actually trade it. That&amp;#39;s clear market manipulation. I&amp;#39;m happy that they are losing now and nobody cares about their Crypto wallet anymore because they would be the very last CEX you would want to buy crypto at.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 339,
  "permalink": "/r/CryptoCurrency/comments/wm2fcl/finally_robinhood_is_facing_claims_of_market/",
  "subreddit": "CryptoCurrency",
  "id": "wm2fcl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A US judge just confirmed that Robinhood must face the claims of market\nmanipulation by restricting trading during the 2021 meme-stock/crypto rally.\nAfter the many other problems including ever-decreasing users this is another\none for Robinhood and actually a very well deserved one as they did…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "米国の判事は、Robinhoodが市場からのクレームに直面しなければならないことを確認しました。\n2021年のミームストック/暗号ラリー中の取引を制限することで、市場操作の主張に直面しなければならないことを米国の判事が認めた。\nユーザー数の減少を含む多くの問題の後、これはRobinhoodにとってもう一つの問題である。\nRobinhoodにとって、これはまた別の問題であり、実際、彼らが行ったように、非常に正当なものである...",
      "title": "最後に、Robinhoodは、米国裁判官による2021年の「ミームラリー」において、市場操作の主張に直面しています。彼らにとっては非常に当然のことです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "美国法官刚刚确认，Robinhood必须面对市场的索赔。\n在2021年的记忆股票/加密货币涨势期间限制交易，从而面对操纵市场的指控。\n在包括不断减少的用户在内的许多其他问题之后，这是Robinhood的另一个问题。\n导致罗宾汉的另一个问题，实际上是当之无愧的问题，因为他们做了...",
      "title": "最后，Robinhood在2021年美国法官的 \"记忆集会 \"中面临市场操纵的指控。对他们来说，这是非常应得的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "美國法官剛剛確認，Robinhood必須面對市場的索賠。\n在2021年的記憶股票/加密貨幣漲勢期間限制交易，從而面對操縱市場的指控。\n在包括不斷減少的用戶在內的許多其他問題之後，這是Robinhood的另一個問題。\n導致羅賓漢的另一個問題，實際上是當之無愧的問題，因爲他們做了...",
      "title": "最後，Robinhood在2021年美國法官的 \"記憶集會 \"中面臨市場操縱的指控。對他們來說，這是非常應得的。"
    }
  ]
}