{
  "author": "SatOnMyBalls_",
  "the_new_excerpt": "And cryptocurrencies in general. Instead, I spent the last 10 years telling and\ngifting Bitcoin and other cryptocurrencies I saw promise in, to all those I\ncared about most. That one drug dealer-like trick has gotten everyone I cared\nabout most on board in the last 10 years. So for those who are…",
  "original_created_utc": 1619746979,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そして、暗号通貨全般です。その代わり、私はこの10年間、伝えたり\nビットコインや将来性のある他の暗号通貨を、私が最も大切に思っている人たちに伝えたり贈ったりしていました。\nプレゼントしていました。その麻薬商人のような一手で、この10年間で私が最も大切に思っていた人たち全員が\nこの10年間で、私が最も気にかけていた人たちを乗せることができました。だから、そのような人たちのために...",
      "title": "皆さんはどうかわかりませんが、私はゲットーで育ちました。私が大切に思っていた人たちが、死ぬまで働く運命にあったり、経済的に困窮して盗みや悪質なビジネスをして刑務所に入ることになったりすることを知って、私はビットコインについて黙っていられませんでした。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "以及一般的加密货币。相反，我在过去的10年中告诉并\n赠送比特币和其他我认为有希望的加密货币，给所有我\n最关心的人。这一个类似于毒贩的伎俩，让我关心的所有人都\n在过去的10年里，我最关心的人都加入了进来。因此，对于那些...",
      "title": "我不知道你们的情况，但我是在贫民区长大的。我知道那些我关心的人和在我身边长大的人注定要工作到死，或者因为经济上的绝望而锒铛入狱，导致他们偷窃或经营不正当的生意，这让我永远无法对比特币保持沉默。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "以及一般的加密貨幣。相反，我在過去的10年中告訴並\n贈送比特幣和其他我認爲有希望的加密貨幣，給所有我\n最關心的人。這一個類似於毒販的伎倆，讓我關心的所有人都\n在過去的10年裏，我最關心的人都加入了進來。因此，對於那些...",
      "title": "我不知道你們的情況，但我是在貧民區長大的。我知道那些我關心的人和在我身邊長大的人註定要工作到死，或者因爲經濟上的絕望而鋃鐺入獄，導致他們偷竊或經營不正當的生意，這讓我永遠無法對比特幣保持沉默。"
    }
  ],
  "title": "idk about you guys, but I grew up in the ghetto. Knowing those I cared about & grew up around were destined to work until their dying day or end up in jail out of financial desperation causing them to steal or run a nefarious business kept me from ever being able to keep my mouth shut about Bitcoin",
  "created_utc": 1619764378,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>And cryptocurrencies in general. Instead, I spent the last 10 years telling and gifting Bitcoin and other cryptocurrencies I saw promise in, to all those I cared about most. That one drug dealer-like trick has gotten everyone I cared about most on board in the last 10 years. So for those who are telling those they care about crypto for the same reasons, I say speak on, gift on; otherwise, those at the bottom we were born with will stay at the bottom if we don&#39;t give them a little push.</p>\n\n<p>&#x200B;</p>\n\n<p>For anyone who was going to ask: &quot;How can you gift Bitcoin or Cryptocurrencies to someone without a wallet?&quot; Well, I usually tell them to check their email for a cryptocurrency gift I sent them; on Coinbase, you can send it to someone&#39;s email. The owner of the email will receive an email letting them know they have some cryptocurrency waiting for them. Once they open an account, whatever you sent them will be propagated on it.</p>\n\n<p>If anyone knows of any other options like this to gift cryptocurrency to someone without a wallet, please let me know and I&#39;ll edit it into the post.</p>\n</div><!-- SC_ON -->",
  "score": 331,
  "permalink": "/r/CryptoCurrency/comments/n1jkty/idk_about_you_guys_but_i_grew_up_in_the_ghetto/",
  "subreddit": "CryptoCurrency",
  "id": "n1jkty",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380961452
}