{
  "author": "Wileyking409",
  "original_created_utc": 1636917980,
  "title": "What are your hobbies outside crypto?",
  "created_utc": 1636925458,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey y&#39;all, with today being Sunday Funday, it got me thinking. What are everyone&#39;s hobbies outside crypto? When you&#39;re not staring at the charts dreaming of your favorite coin mooning, what do you do with your free time? Do you go out, or do you stay in?</p>\n\n<p>I&#39;ll go: my wife and I LOVE watching horror/scary movies. We&#39;ve pretty much exhausted the list on every streaming service... our favorite recent watch was The Descent. Something about having our hearts beat fast from the perceived danger just really gets us going... while sitting in the safety of our couch haha</p>\n\n<p>EDIT: Loving all the responses! I can&#39;t reply to them all, but this gives me hope for the world :)</p>\n</div><!-- SC_ON -->",
  "score": 306,
  "permalink": "/r/CryptoCurrency/comments/qtxac3/what_are_your_hobbies_outside_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qtxac3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey y'all, with today being Sunday Funday, it got me thinking. What are\neveryone's hobbies outside crypto? When you're not staring at the charts\ndreaming of your favorite coin mooning, what do you do with your free time? Do\nyou go out, or do you stay in?\n\nI'll go: my wife and I LOVE watching…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、今日はSunday Fundayということで、考えてみました。みんなの\nみんなの趣味は暗号以外に何がある？チャートを見ていないときは\n自由な時間に何をしていますか？外出しますか？\n外出しますか、それとも家にいますか？\n\n私は、妻と一緒にテレビを見るのが大好きです。",
      "title": "暗号以外の趣味は何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，大家好，今天是周日基金日，这让我想到了。每个人在加密货币之外的爱好是什么？\n大家在加密货币之外的爱好是什么？当你不盯着图表的时候\n梦想着你最喜欢的硬币的时候，你的空闲时间都在做什么？你是否\n你是出去玩，还是呆在家里？\n\n我去：我和我的妻子喜欢看...",
      "title": "你在加密货币之外有什么爱好？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，大家好，今天是週日基金日，這讓我想到了。每個人在加密貨幣之外的愛好是什麼？\n大家在加密貨幣之外的愛好是什麼？當你不盯着圖表的時候\n夢想着你最喜歡的硬幣的時候，你的空閒時間都在做什麼？你是否\n你是出去玩，還是呆在家裏？\n\n我去：我和我的妻子喜歡看...",
      "title": "你在加密貨幣之外有什麼愛好？"
    }
  ]
}