{
  "author": "gnarley_quinn",
  "original_created_utc": 1655175510,
  "title": "Bitcoin just reached its lowest weekly RSI since 2011.",
  "created_utc": 1655188303,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Bitcoin just reached its lowest weekly RSI since 2011.&lt;/p&gt;\n\n&lt;p&gt;The relative strength index (RSI) is a momentum indicator used in technical analysis that measures the magnitude of recent price changes to evaluate overbought or oversold conditions in the price of a stock or other asset. An asset is usually considered overbought when the RSI is above 70% and oversold when it is below 30%.&lt;/p&gt;\n\n&lt;p&gt;The RSI will rise as the number and size of positive closes increase, and it will fall as the number and size of losses increase. The second part of the calculation smooths the result, so the RSI will only near 100 or 0 in a strongly trending market.&lt;/p&gt;\n\n&lt;p&gt;Going on the Weekly charts only, as this is a very long term outlook. Not even the Daily provides this broad of a perspective.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/7fibhwd15i591.png?width=1443&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=ce1699b5f5d0fe1d4545cf78942f03b722ba05d0\"&gt;BTC Weekly&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;In 2011, just two years after the birth of Bitcoin, the weekly RSI was at 21. The price of bitcoin was $2.&lt;/p&gt;\n\n&lt;p&gt;In January 2015, it hit 27. Price was $154.&lt;/p&gt;\n\n&lt;p&gt;In December 2019, it hit 29. Price was $3150.&lt;/p&gt;\n\n&lt;p&gt;These levels are all textbook oversold values. In the past, every single time it hit these condition levels, it went back to 50 points over the next ~6 months, and hovered around that price for most of that time. After that, it has never again returned to those prices.&lt;/p&gt;\n\n&lt;p&gt;Right now, it is at 26, and this is the most oversold it has been in 11 years. I am buying for the next six months. Merry Christmas.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 366,
  "permalink": "/r/CryptoCurrency/comments/vbtjws/bitcoin_just_reached_its_lowest_weekly_rsi_since/",
  "subreddit": "CryptoCurrency",
  "id": "vbtjws",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Bitcoin just reached its lowest weekly RSI since 2011.\n\nThe relative strength index (RSI) is a momentum indicator used in technical\nanalysis that measures the magnitude of recent price changes to evaluate\noverbought or oversold conditions in the price of a stock or other asset. An\nasset is usually…"
}