{
  "author": "kthebakerman",
  "the_new_excerpt": "Tons of people here are asking others to predict the future of the market so\nthey can make decisions about what to do with their money. This won’t work. And\nit’s downright financially irresponsible and dangerous.\n\nThis market is unpredictable. Even crypto pioneers - after living through…",
  "original_created_utc": 1621632289,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここでは多くの人が、自分のお金をどうするかを決めるために、市場の将来を予測することを他人に求めています。\n自分のお金で何をすべきかを決めるために。これではうまくいきません。そして\nまさに経済的に無責任で危険なことです。\n\nこの市場は予測できません。暗号の先駆者でさえ、このような状況を経験した後では...",
      "title": "いいえ、そのランダムなredditユーザーは、明日、1週間後、1年後に何が起こるのかを知りません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这里有很多人要求别人预测市场的未来，这样他们就可以决定如何处理自己的资金。\n他们可以决定如何使用他们的钱。这是不可能的。而且\n这是彻头彻尾的财务上的不负责任和危险。\n\n这个市场是不可预测的。即使是加密货币的先驱者--在经历了...",
      "title": "不，那个随机的reddit用户不知道明天、一周后或一年后会发生什么。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏有很多人要求別人預測市場的未來，這樣他們就可以決定如何處理自己的資金。\n他們可以決定如何使用他們的錢。這是不可能的。而且\n這是徹頭徹尾的財務上的不負責任和危險。\n\n這個市場是不可預測的。即使是加密貨幣的先驅者--在經歷了...",
      "title": "不，那個隨機的reddit用戶不知道明天、一週後或一年後會發生什麼。"
    }
  ],
  "title": "No, that random reddit user doesn’t know what’s going to happen tomorrow, a week from now, or in a year.",
  "created_utc": 1621661927,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Tons of people here are asking others to predict the future of the market so they can make decisions about what to do with their money. This won’t work. And it’s downright financially irresponsible and dangerous.</p>\n\n<p>This market is unpredictable. Even crypto pioneers - after living through past bull/bear markets, analyzing past trends, and doing their due diligence - have no idea what’s going to happen in the near or long term. </p>\n\n<p>Seeing tons of posts and comments asking “are we at the start of the bear market?” “Are prices going to drop further?” “How long until prices get back to xx?” </p>\n\n<p>Nobody. Knows. Every prediction you see/hear/read is speculation. Whether it’s educated speculation or not doesn’t change the fact that nobody knows. </p>\n\n<p>If you are looking for opinions then by all means, continue to ask. Just don’t base your financial decisions on someone else’s speculation/prediction. </p>\n\n<p>Best wishes.</p>\n</div><!-- SC_ON -->",
  "score": 358,
  "permalink": "/r/CryptoCurrency/comments/ni3afo/no_that_random_reddit_user_doesnt_know_whats/",
  "subreddit": "CryptoCurrency",
  "id": "ni3afo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197383345
}