{
  "author": "Stankoman",
  "original_created_utc": 1639567403,
  "title": "Shoot me but I don't want gaming and crypto to mix",
  "created_utc": 1639607495,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Quick backstory: I have been gaming since the 1990 (i.e. 30 years) and in crypto at least 3 years. &lt;/p&gt;\n\n&lt;p&gt;I recently listened to long podcast on Crypto and gaming and how wonderful everything will be. I support wholeheartedly development and exploration of block chain technology for whatever purpose it can have. HOWEVER: &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;I don&amp;#39;t want gaming and crypto to mix.&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;Because big brand companies will focus on useless shit like NFTs and attention will be drawn from quality game development (story lines, graphics, music or whatever). We will have Three arrows buying up rare items and hodling/reselling them for a profit. We will also have a lot shitty games with huge amounts of NFT&amp;#39;s. Like the stupid skins and other items that started shitting in games.&lt;/p&gt;\n\n&lt;p&gt;I am not talking about metaverses or whatever Zuck is up to... they can do whatever the f*ck they want. However I don&amp;#39;t want to see RPG&amp;#39;s, FPS and strategy games marketed for using &amp;quot;advance block chain&amp;quot; technology or whatever other marketing gimmick companies will try. &lt;/p&gt;\n\n&lt;p&gt;Remember micro payments and that whole ordeal? &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Long story short: Leave gaming alone.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 166,
  "permalink": "/r/CryptoCurrency/comments/rgwx3g/shoot_me_but_i_dont_want_gaming_and_crypto_to_mix/",
  "subreddit": "CryptoCurrency",
  "id": "rgwx3g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Quick backstory: I have been gaming since the 1990 (i.e. 30 years) and in crypto\nat least 3 years.\n\nI recently listened to long podcast on Crypto and gaming and how wonderful\neverything will be. I support wholeheartedly development and exploration of\nblock chain technology for whatever purpose it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "簡単な裏話を。私は1990年から（つまり30年）ゲームをしており、暗号の分野では\nは3年以上。\n\n最近、暗号とゲームに関する長いポッドキャストを聞き、いかに素晴らしいか\nということです。の開発と探求を心から応援しています。\nブロックチェーン技術がどのような目的であれ、...",
      "title": "ゲームと暗号を一緒にしないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "快速的背景故事。我从1990年开始玩游戏（即30年），在加密货币领域至少有3年时间。\n至少有3年了。\n\n我最近听了一个关于加密货币和游戏的长篇播客，感觉非常好。\n一切都会变得很美好。我全心全意地支持开发和探索\n区块链技术的发展和探索，无论其目的是什么。",
      "title": "开枪吧，但我不希望游戏和加密货币混在一起"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "快速的背景故事。我從1990年開始玩遊戲（即30年），在加密貨幣領域至少有3年時間。\n至少有3年了。\n\n我最近聽了一個關於加密貨幣和遊戲的長篇播客，感覺非常好。\n一切都會變得很美好。我全心全意地支持開發和探索\n區塊鏈技術的發展和探索，無論其目的是什麼。",
      "title": "開槍吧，但我不希望遊戲和加密貨幣混在一起"
    }
  ]
}