{
  "author": "Dwez1337",
  "original_created_utc": 1633051567,
  "title": "Robinhood Securities President Sold all His AMC Stock before Restricting People from Buying it: They will do the same thing to your Crypto",
  "created_utc": 1633063539,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A new lawsuit alleges that the chief operating officer and securities president of Robinhood James Swartwout has sold all his AMC stock just before Robinhood restricted people from buying it.</p>\n\n<p>This is literal insider trading, rethink about using them to hold your crypto. Do you really think they might not pull the same move again if they gain significant marketshare in the crypto space?</p>\n\n<p>Even the SEC chairman Gary Gensler has warned about Robinhoods shady businesses practices, they sell your crypto and stock trading data to hedge founds.</p>\n</div><!-- SC_ON -->",
  "score": 501,
  "permalink": "/r/CryptoCurrency/comments/pyxkum/robinhood_securities_president_sold_all_his_amc/",
  "subreddit": "CryptoCurrency",
  "id": "pyxkum",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A new lawsuit alleges that the chief operating officer and securities president\nof Robinhood James Swartwout has sold all his AMC stock just before Robinhood\nrestricted people from buying it.\n\nThis is literal insider trading, rethink about using them to hold your crypto.\nDo you really think they…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "新たな訴訟では、Robinhoodの最高執行責任者兼証券社長である\nロビンフッドの最高執行責任者兼証券社長のJames Swartwoutは、ロビンフッドが人々の購入を制限する直前に、自分のAMC株をすべて売却したと主張しています。\nが人々の購入を制限する直前に、自分のAMC株をすべて売却したというものです。\n\nこれは文字通りのインサイダー取引であり、暗号を保持するために彼らを使うことについて再考する必要がある。\nあなたは本当に彼らが...",
      "title": "ロビンフッド証券の社長がAMC株をすべて売却してから、人々の購入を制限しています。彼らはあなたの暗号にも同じことをするだろう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一项新的诉讼指控称，Robinhood的首席运营官和证券总裁\n的首席运营官兼证券总裁James Swartwout在Robinhood成立之前就已经卖掉了他所有的AMC股票。\n限制人们购买它。\n\n这是字面上的内幕交易，重新考虑用他们来持有你的加密货币。\n你真的认为他们...",
      "title": "Robinhood证券公司总裁在限制人们购买AMC股票之前就卖掉了他所有的AMC股票。他们将对你的加密货币做同样的事情"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一項新的訴訟指控稱，Robinhood的首席運營官和證券總裁\n的首席運營官兼證券總裁James Swartwout在Robinhood成立之前就已經賣掉了他所有的AMC股票。\n限制人們購買它。\n\n這是字面上的內幕交易，重新考慮用他們來持有你的加密貨幣。\n你真的認爲他們...",
      "title": "Robinhood證券公司總裁在限制人們購買AMC股票之前就賣掉了他所有的AMC股票。他們將對你的加密貨幣做同樣的事情"
    }
  ]
}