{
  "author": "gulasch_man",
  "original_created_utc": 1640250841,
  "title": "What was your worst trade in 2021? What did you learn from it?",
  "created_utc": 1640266384,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I sold $2.2k worth of BTC in March and traded it into VET at 19.3c....  &lt;/p&gt;\n\n&lt;p&gt;I think I don&amp;#39;t have to describe how I feel about it and what I learned is that speculative trading is a guaranteed way to lose everything you have. In the meantime one is looking for an exit point from the worst performing asset it has, TONS of other possibilities are passing by.&lt;/p&gt;\n\n&lt;p&gt;I wanted to reallocate into MATIC as soon as VET hits my AVG. to avoid losses. Guess what? It didn&amp;#39;t hit my AVG. ever and as it was going down again, I always found an excuse not to sell, because it will go up again and when I finally decided to DCA out, it has tanked back to February levels.&lt;/p&gt;\n\n&lt;p&gt;In the meantime MATIC had at least 3-4 dips and back from 1.8$ back to 2.2 which would have been perfect buying opportunities to DCA into the asset.&lt;/p&gt;\n\n&lt;p&gt;What ifs are the worst in this market and it will eat your soul...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 180,
  "permalink": "/r/CryptoCurrency/comments/rmrqr5/what_was_your_worst_trade_in_2021_what_did_you/",
  "subreddit": "CryptoCurrency",
  "id": "rmrqr5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I sold $2.2k worth of BTC in March and traded it into VET at 19.3c....\n\nI think I don't have to describe how I feel about it and what I learned is that\nspeculative trading is a guaranteed way to lose everything you have. In the\nmeantime one is looking for an exit point from the worst performing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "3月に2.2kドル分のBTCを売却し、19.3cでVETにトレードしたのですが・・・。\n\nその時の感想は説明するまでもないと思いますが、学んだことは\n投機的な取引は、持っているものすべてを失うことが確実な方法です。その間に\nその間に、最もパフォーマンスの悪いところから出口を探すことになる...。",
      "title": "2021年、あなたの最悪のトレードは？そこから何を学びましたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在3月份卖出了价值2.2千美元的BTC，以19.3c的价格交易到VET....。\n\n我想我不需要描述我的感受，我学到的是\n投机性交易是失去你所拥有的一切的保证方式。在此过程中\n同时，人们正在寻找一个退出点，从表现最差的...",
      "title": "2021年，你最糟糕的交易是什么？你从中学到了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在3月份賣出了價值2.2千美元的BTC，以19.3c的價格交易到VET....。\n\n我想我不需要描述我的感受，我學到的是\n投機性交易是失去你所擁有的一切的保證方式。在此過程中\n同時，人們正在尋找一個退出點，從表現最差的...",
      "title": "2021年，你最糟糕的交易是什麼？你從中學到了什麼？"
    }
  ]
}