{
  "author": "pabloseason",
  "the_new_excerpt": "So Tesla was caught in the eye of the storm today, dropping nearly 10% in the\nmidst of this market correction. May also have to do with the company stopping\norders for the Model Y. May also be a short term correction as people take\nprofits from the ATH.\n\nFor all those on the sidelines who watched…",
  "original_created_utc": 1614029865,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以特斯拉今天被卷入风暴眼，跌幅近10%，在。\n在这次市场调整中。可能也与公司停产有关。\nY型车的订单。\n从ATH获得的利润。\n\n对于所有围观的人来说，谁看了... ...",
      "title": "Tesla Dip - 讨论主题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以特斯拉今天被捲入風暴眼，跌幅近10%，在。\n在這次市場調整中。可能也與公司停產有關。\nY型車的訂單。\n從ATH獲得的利潤。\n\n對於所有圍觀的人來說，誰看了... ...",
      "title": "Tesla Dip - 討論主題"
    }
  ],
  "title": "Tesla Dip - discussion thread",
  "created_utc": 1614044620,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So Tesla was caught in the eye of the storm today, dropping nearly 10% in the midst of this market correction. May also have to do with the company stopping orders for the Model Y. May also be a short term correction as people take profits from the ATH.</p>\n\n<p>For all those on the sidelines who watched the price go up in the last few months and not get in - myself included - what do you say about it’s current price? Still overvalued in your opinion? Are you waiting until the price drops more? Are you buying small to average down if it goes further?</p>\n\n<p>I had been one of those sceptics who thought Tesla was in a bubble and would eventually return to around $500-600. However I must admit after lots of research Tesla does seem to be 5 years ahead of other EV makers and i’ve been waiting ever since to see a price drop.</p>\n\n<p>Does this drop in price justify buying a position in Tesla or are you expecting a bigger drop? I personally don’t believe the Model Y news is too shocking, Elon Musk has consistently acknowledged the challenge of mass-scale production.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/investing/comments/lq0p2b/tesla_dip_discussion_thread/",
  "subreddit": "investing",
  "id": "lq0p2b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332881994
}