{
  "author": "wee_d",
  "original_created_utc": 1641782999,
  "title": "Double-check all addresses before hitting send. Just saved a friend from a clipboard malware.",
  "created_utc": 1641804265,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So today, I wanted to introduce a friend to a certain cryptocurrency and asked him to copy-paste his metamask and send it to me via chat. Having this constant paranoia and fear of sending crypto to wrong addresses, I decide to look up the address he sent to me on etherscan, and I find quite a large balance with many transactions. I make a joke to my friend about how rich he was, but he tells me that he has a 0 balance. That was when the alarm bells started going off in my mind. I ask him to take note of the first two and last two characters in his ethereum address, copy it, and then paste it to me. He tells me the address changed when it was pasted from the windows clipboard. To be double sure, I ask him to make up a random set of numbers and letters of length 42, then copy and paste it in our chat.The fake addressthat was pasted changed.  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;My suspicions were right.&lt;/strong&gt;  &lt;/p&gt;\n\n&lt;p&gt;In short, his computer was infected by the colormania malware that targets the windows clipboard. This malware checks whether a copied text has a particular length that is common to some blockchains and replaces the text or address, in this case, with the attacker&amp;#39;s address. So when you hit paste and click the send button, the address changes and the funds are sent to the attacker instead. We found evidence of the malware at the task manager&amp;#39;s background processes. And lo and behold, we found colormania running in there. I had him download and install Malwarebytes, which found several threats on his system and cleared it. Now, the values of addressed copied onto the clipboard no longer changed when he pasted them. I guess the moral of this is to double check addresses whenever sending cryptocurrency.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Always stay paranoid&lt;/strong&gt;  &lt;/p&gt;\n\n&lt;p&gt;This is one of the attacker&amp;#39;s ethereum address: 0x51e199f1ec3030B4610007C29ab3D272af91Dfd6&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 344,
  "permalink": "/r/CryptoCurrency/comments/s091pn/doublecheck_all_addresses_before_hitting_send/",
  "subreddit": "CryptoCurrency",
  "id": "s091pn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So today, I wanted to introduce a friend to a certain cryptocurrency and asked\nhim to copy-paste his metamask and send it to me via chat. Having this constant\nparanoia and fear of sending crypto to wrong addresses, I decide to look up the\naddress he sent to me on etherscan, and I find quite a large…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで今日は、友人にある暗号通貨を紹介したいと思い、お願いしました。\nメタマスクをコピーペーストして、チャットで送ってもらう。このように常に\n暗号を間違ったアドレスに送ってしまうというパラノイアと恐怖に駆られ、私は\nイーサースキャンで彼が送ってきたアドレスを見ると、かなり大きな...",
      "title": "送信を押す前に、すべてのアドレスをダブルチェックする。クリップボードのマルウェアから友人を救いました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以今天，我想向一个朋友介绍某种加密货币，并要求他复制粘贴他的元数据并通过聊天发送给我。\n他复制粘贴他的元数据并通过聊天发送给我。由于一直有这种\n我决定在etherscan上查找他发给我的地址。\n我决定在Etherscan上查找他发给我的地址，结果我发现了一个相当大的...",
      "title": "在点击发送前仔细检查所有地址。刚刚把一个朋友从剪贴板的恶意软件中救出来。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以今天，我想向一個朋友介紹某種加密貨幣，並要求他複製粘貼他的元數據並通過聊天發送給我。\n他複製粘貼他的元數據並通過聊天發送給我。由於一直有這種\n我決定在etherscan上查找他發給我的地址。\n我決定在Etherscan上查找他發給我的地址，結果我發現了一個相當大的...",
      "title": "在點擊發送前仔細檢查所有地址。剛剛把一個朋友從剪貼板的惡意軟件中救出來。"
    }
  ]
}