{
  "author": "Accomplished-Design7",
  "original_created_utc": 1626752101,
  "title": "For those of you who bought near the ATH and are still holding during this crazy dip, kudus to you",
  "created_utc": 1626759039,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The market is just bleeding like there is no tomorrow and those of you who are holding strong. You have my salute! You the real diamond hands! Especially to the newcomers who bought during the ATH.</p>\n\n<p>This is crypto, like a crazy roller coaster. To truly taste the gains you have to endure the pain that brings froth from dips like this.</p>\n\n<p>What I do during these dips are simple. I buy the dip, HODL, DCA and STAKE. This has made my journey less painful and hopefully, it will ease your bleeding portfolio too.</p>\n\n<p>Stay strong my fellow diamond hands!</p>\n</div><!-- SC_ON -->",
  "score": 227,
  "permalink": "/r/CryptoCurrency/comments/onu284/for_those_of_you_who_bought_near_the_ath_and_are/",
  "subreddit": "CryptoCurrency",
  "id": "onu284",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The market is just bleeding like there is no tomorrow and those of you who are\nholding strong. You have my salute! You the real diamond hands! Especially to\nthe newcomers who bought during the ATH.\n\nThis is crypto, like a crazy roller coaster. To truly taste the gains you have\nto endure the pain…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "市場は明日がないように出血しているだけで、あなたのような人は\n強く持ち続けている人には 敬意を表したいと思います。あなたは本物のダイヤモンドハンドです。特に\nATH中に購入した新規参入者の皆さん。\n\nこれが暗号であり、狂ったジェットコースターのようなものです。本当に利益を味わうためには\n痛みに耐えなければなりません...",
      "title": "ATHの近くで買って、この狂ったディップの間も持ち続けている人たちには拍手を送ります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "市场就像没有明天一样在流血，而你们中的那些人正在\n坚守的人。我向你们致敬! 你们是真正的钻石之手! 特别是对\n那些在ATH期间买入的新人们。\n\n这就是加密货币，像一个疯狂的过山车。要真正品尝到收益，你必须\n忍受痛苦...",
      "title": "对于那些在ATH附近买入并在这次疯狂下跌中仍然持有的人，向你们致敬。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "市場就像沒有明天一樣在流血，而你們中的那些人正在\n堅守的人。我向你們致敬! 你們是真正的鑽石之手! 特別是對\n那些在ATH期間買入的新人們。\n\n這就是加密貨幣，像一個瘋狂的過山車。要真正品嚐到收益，你必須\n忍受痛苦...",
      "title": "對於那些在ATH附近買入並在這次瘋狂下跌中仍然持有的人，向你們致敬。"
    }
  ]
}