{
  "author": "ithinkiamtrex",
  "original_created_utc": 1628683036,
  "title": "Why don't governments/scientists/corporations try to find efficient methods to make sea/ocean water drinkable?",
  "created_utc": 1628727345,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I mean they have tech to pulverize entire cities, plant their flags on moon, scuba dive in mariana trench yet somehow they never created/perfected the tech to satisfy basic human need.</p>\n\n<p>It&#39;s not that it&#39;s impossible tech. Someone told me RO based water filter can somewhat make saltwater drinkable but it&#39;s components would bust before you could say &quot;reverse osmosis&quot;.</p>\n\n<p>I think making efficient seawater filtering plants would fix many problems, countries having water scarcity can get constant water via pipeline (like they transport oils and gases), food production, pisciculture etc will all be benefited. </p>\n\n<p>I do request not to give &quot;they greedy and hate poor&quot; reasons as that&#39;s already known.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/p2bls1/why_dont_governmentsscientistscorporations_try_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "p2bls1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I mean they have tech to pulverize entire cities, plant their flags on moon,\nscuba dive in mariana trench yet somehow they never created/perfected the tech\nto satisfy basic human need.\n\nIt's not that it's impossible tech. Someone told me RO based water filter can\nsomewhat make saltwater drinkable…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "つまり、彼らは都市全体を破壊する技術を持っていて、月に自国の旗を立てることができます。\nマリアナ海溝でスキューバダイビングをする技術を持っているのに、なぜか人間の基本的な欲求を満たす技術を作ったり完成させたりしていません。\n人間の基本的な欲求を満たす技術を作ったり、完成させたりしていません。\n\n不可能な技術というわけではありません。ある人は、RO水を使った浄水器で\n塩水を飲めるようになると言っていた人がいましたが...。",
      "title": "なぜ政府や科学者、企業は、海や海洋の水を飲めるようにする効率的な方法を見つけようとしないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的意思是，他们有技术可以摧毁整个城市，在月球上插上他们的旗帜。\n在马里亚纳海沟潜水，但不知为何，他们从未创造/完善过满足人类基本需求的技术\n以满足人类的基本需求。\n\n这并不是说这是不可能的技术。有人告诉我，基于RO的水过滤器可以\n某种程度上使盐水可以饮用......",
      "title": "为什么政府/科学家/公司不努力寻找有效的方法使海水/海洋水可以饮用？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的意思是，他們有技術可以摧毀整個城市，在月球上插上他們的旗幟。\n在馬裏亞納海溝潛水，但不知爲何，他們從未創造/完善過滿足人類基本需求的技術\n以滿足人類的基本需求。\n\n這並不是說這是不可能的技術。有人告訴我，基於RO的水過濾器可以\n某種程度上使鹽水可以飲用......",
      "title": "爲什麼政府/科學家/公司不努力尋找有效的方法使海水/海洋水可以飲用？"
    }
  ]
}