{
  "author": "UnexperiencedIT",
  "original_created_utc": 1647804214,
  "title": "I think that many people live in the delusion that they will live on passive income, and the truth is that only a few will succeed in that.",
  "created_utc": 1647829092,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry, but that&amp;#39;s my current opinion. &lt;/p&gt;\n\n&lt;p&gt;We all dream that we don&amp;#39;t have to go to work, but that we have enough money for a quality life and the costs of life when you have a family.&lt;/p&gt;\n\n&lt;p&gt;If you don&amp;#39;t already have a lot of money, if you are not already rich, then how can you live on passive income? &lt;/p&gt;\n\n&lt;p&gt;It takes a lot of luck, effort and work to reach a level where a person can say that he no longer has to work and that he can live freely from passive income. &lt;/p&gt;\n\n&lt;p&gt;The real question is how to get that passive income.&lt;/p&gt;\n\n&lt;p&gt;What exactly is passive income?&lt;/p&gt;\n\n&lt;p&gt;Mining is one of the ways of passive income, but even here you have to buy quality equipment, take care of it, be there if needed, if there is a power outage or something like that. &lt;/p&gt;\n\n&lt;p&gt;If you get crazy rich by trading cryptocurrencies, then you can stake that crypto, but only if you succeed in that, and that is not easy.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 352,
  "permalink": "/r/CryptoCurrency/comments/tisn7y/i_think_that_many_people_live_in_the_delusion/",
  "subreddit": "CryptoCurrency",
  "id": "tisn7y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm sorry, but that's my current opinion.\n\nWe all dream that we don't have to go to work, but that we have enough money for\na quality life and the costs of life when you have a family.\n\nIf you don't already have a lot of money, if you are not already rich, then how\ncan you live on passive…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "申し訳ないですが、これが私の今の意見です。\n\n私たちは皆、仕事に行かなくても、十分なお金を手に入れることを夢見ています。\n質の高い生活と、家庭を持った時の生活費。\n\nもし、あなたがすでに多くのお金を持っていないなら、すでに金持ちでないなら、どのようにして\n受動的な生活を送ることができるのか・・・。",
      "title": "多くの人が「パッシブインカムで生きていく」という妄想を抱いて生きていると思いますが、実はそれで成功するのはほんの一握りなんです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很抱歉，但这是我目前的看法。\n\n我们都梦想着我们不必去工作，但我们有足够的钱来满足\n有质量的生活和有家庭时的生活费用。\n\n如果你还没有很多钱，如果你还不富裕，那么你如何\n你怎么能靠被动的生活...",
      "title": "我认为许多人生活在妄想中，认为他们将靠被动收入生活，而事实是，只有少数人能够在这方面取得成功。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很抱歉，但這是我目前的看法。\n\n我們都夢想着我們不必去工作，但我們有足夠的錢來滿足\n有質量的生活和有家庭時的生活費用。\n\n如果你還沒有很多錢，如果你還不富裕，那麼你如何\n你怎麼能靠被動的生活...",
      "title": "我認爲許多人生活在妄想中，認爲他們將靠被動收入生活，而事實是，只有少數人能夠在這方面取得成功。"
    }
  ]
}