{
  "author": "makecashbiz",
  "the_new_excerpt": "I've noticed there seems to generally be two different attitudes towards\ninvesting. Possibly related to the amount of experience and how long people have\nbeen involved in the markets.\n\nI see the solid investors who stick to index funds, solid blue chip companies\nand looking to build wealth over…",
  "original_created_utc": 1622744237,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、一般的に2つの異なる考え方があることに気づきました。\n投資に対する考え方が2つに分かれるようです。おそらく、人々の経験の量や市場に関わってきた期間に関連しているのでしょう。\n関係しているのかもしれません。\n\n堅実な投資家は、インデックスファンドや堅実な優良企業に固執しています。\n堅実な投資家は、インデックスファンドや堅実な優良企業に固執し、長期的に富を築こうとします。",
      "title": "自分の純資産のうち、どのくらいをハイリスクな投資に回すか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我注意到，对投资似乎一般有两种不同的态度\n投资。这可能与人们的经验和参与市场的时间有关。\n参与市场的时间长短有关。\n\n我看到那些坚持使用指数基金、坚实的蓝筹股公司的坚实投资者\n并希望通过投资来积累财富...",
      "title": "你的净资产中有多少会投资于高风险投资？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我注意到，對投資似乎一般有兩種不同的態度\n投資。這可能與人們的經驗和參與市場的時間有關。\n參與市場的時間長短有關。\n\n我看到那些堅持使用指數基金、堅實的藍籌股公司的堅實投資者\n並希望通過投資來積累財富...",
      "title": "你的淨資產中有多少會投資於高風險投資？"
    }
  ],
  "title": "How much of your net worth would you invest in high risk investments?",
  "created_utc": 1622775780,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve noticed there seems to generally be two different attitudes towards investing. Possibly related to the amount of experience and how long people have been involved in the markets.  </p>\n\n<p>I see the solid investors who stick to index funds, solid blue chip companies and looking to build wealth over time. Warren Buffett being the classic example of this. </p>\n\n<p>Then there&#39;s the ones who are massive risk takers, borrowing money, trying to YOLO and make millions by the end of the year. Every now and again you hear of someone succeeding but far more fail. </p>\n\n<p>As I&#39;ve got older and more experienced I feel like I&#39;ve gone from the risk taker to the solid investor but now I&#39;m thinking why not have a hybrid strategy depending on your investment goals? </p>\n\n<p>After all emotion can mess up even the most solid investors. The dot com crash, 2008 and March 2020 when plenty of people who had been investing for years cashed out their shares at a huge loss.  </p>\n\n<p>I was aware of bitcoin from about 2011. I always knew it was massively volatile so I avoided it and stuck to investing in good old solid returns. But (and I&#39;m sure other people have thought this) why didn&#39;t I just put a few hundred dollars in and forget about it? That one 100 bagger can eclipse all the returns of my solid investments.</p>\n\n<p>Now there&#39;s NFT&#39;s, meme stocks and no doubt there will be plenty of other latest fads. </p>\n\n<p>It&#39;s not for everyone but I have decided to invest a minimum of 5% and never more than 10% of my net wealth into highly speculative, possibly go to zero investments. By always sticking to these percentages I figure if I do catch the next bitcoin ten years away then it&#39;s worth the risk. If not then I&#39;m not going to lose any sleep over it. </p>\n\n<p>But I am losing sleep over missing the next thing that I watch rise over the space of a decade. </p>\n\n<p>What amount do you invest in truly high risk, speculative plays?</p>\n</div><!-- SC_ON -->",
  "score": 89,
  "permalink": "/r/investing/comments/nrk2vk/how_much_of_your_net_worth_would_you_invest_in/",
  "subreddit": "investing",
  "id": "nrk2vk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404885454
}