{
  "author": "amandamichelle90",
  "original_created_utc": 1640707544,
  "title": "Reminder: Panic buying is the same disease as panic selling",
  "created_utc": 1640716360,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;With the regularly scheduled influx of &lt;strong&gt;buy the dip&lt;/strong&gt; comments, and their co-star &lt;strong&gt;I bought the dip but it keeps dipping&lt;/strong&gt;.. I just wanted to shoot out a reminder that the market doesn’t have to rule your life. &lt;/p&gt;\n\n&lt;p&gt;You can set your own schedule and your own budget and not have your investment practices be so chaotic. &lt;/p&gt;\n\n&lt;p&gt;There is something to be said about the mental toll obsessing about the market takes on people and their long-term plans. Not to mention over extending their budget in FOMO which puts your entire portfolio at risk in case of financial emergency. I’ve seen far more people mentally burn out and lose interest (and in turn lose out on possible profits) than I have of people financially ruin themselves.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/rqj4op/reminder_panic_buying_is_the_same_disease_as/",
  "subreddit": "CryptoCurrency",
  "id": "rqj4op",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "With the regularly scheduled influx of buy the dip comments, and their co-star I\nbought the dip but it keeps dipping.. I just wanted to shoot out a reminder that\nthe market doesn’t have to rule your life.\n\nYou can set your own schedule and your own budget and not have your investment\npractices be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "定期的に流入するbuy the dipのコメントと、その共演者であるIさん。\nディップを買ったのですが、どんどん落ちていきます。私はただ、次のことを思い出して欲しいのです。\nマーケットに人生を支配される必要はないのです。\n\n自分のスケジュールと予算を決めて、自分の投資をすることができます。\nを実践しています。",
      "title": "注意喚起 パニック買いはパニック売りと同じ病気である"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "伴随着定期涌入的购买蘸酱的评论，以及他们的联合明星我\n买了蘸酱，但它一直在下降。我只是想提醒一下大家\n市场不一定要支配你的生活。\n\n你可以设定自己的时间表和自己的预算，而不必让你的投资\n做法是...",
      "title": "提醒大家注意。恐慌性买入与恐慌性卖出是同一种疾病"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "伴隨着定期湧入的購買蘸醬的評論，以及他們的聯合明星我\n買了蘸醬，但它一直在下降。我只是想提醒一下大家\n市場不一定要支配你的生活。\n\n你可以設定自己的時間表和自己的預算，而不必讓你的投資\n做法是...",
      "title": "提醒大家注意。恐慌性買入與恐慌性賣出是同一種疾病"
    }
  ]
}