{
  "author": "Monster_Chief17",
  "the_new_excerpt": "Even though you probably won't admit it, you are secretly holding thousands of\nDoge hoping that one day it will hit $1 and make your dreams come true.\n\n\nWHAT IS DOGECOIN?\n\nDogecoin was co-founded by IBM software engineer Billy Markus and Adobe software\nengineer Jackson Palmer, who set out to create…",
  "original_created_utc": 1610624825,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "尽管你可能不会承认，但你暗地里有成千上万的。\n多格币希望有一天能达到1美元，让你梦想成真。\n\n\n什么是DOGECOIN？\n\n多格币是由IBM软件工程师Billy Markus和Adobe软件公司共同创立的。\n工程师杰克逊-帕尔默，他开始创造... ...",
      "title": "什么是Dogecoin？为什么是Dogecoin？如何使用Dogecoin？你需要在5分钟内知道的一切。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "儘管你可能不會承認，但你暗地裏有成千上萬的。\n多格幣希望有一天能達到1美元，讓你夢想成真。\n\n\n什麼是DOGECOIN？\n\n多格幣是由IBM軟件工程師Billy Markus和Adobe軟件公司共同創立的。\n工程師傑克遜-帕爾默，他開始創造... ...",
      "title": "什麼是Dogecoin？爲什麼是Dogecoin？如何使用Dogecoin？你需要在5分鐘內知道的一切。"
    }
  ],
  "title": "What is Dogecoin? Why is Dogecoin? How is Dogecoin? Everything you need to know in 5 minutes or less.",
  "created_utc": 1610644794,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Even though you probably won&#39;t admit it, you are secretly holding thousands of Doge hoping that one day it will hit $1 and make your dreams come true.</p>\n\n<h1><strong>What is Dogecoin?</strong></h1>\n\n<p>Dogecoin was co-founded by IBM software engineer Billy Markus and Adobe software engineer Jackson Palmer, who set out to create a peer-to-peer digital currency that could reach a broader demographic than Bitcoin.</p>\n\n<p><strong><em>Full story and a lot of interesting stuff can be found on the <a href=\"https://en.wikipedia.org/wiki/Dogecoin\">Wiki page</a></em>.</strong></p>\n\n<p>In the beginning, there were only 100 Billion Doge, and all of them were mined in just two years. After that, the code was updated and another 5 Billion Doge were to be created every year making Doge a currency with infinite supply somewhere in 2015. As documented by <a href=\"https://arstechnica.com/information-technology/2014/02/dogecoin-to-allow-annual-inflation-of-5-billion-coins-each-year-forever/\">mainstream media</a>, some community members disliked this decision and complained that their investment will go to zero while others supported the unlimited supply because true Doge believers don&#39;t care about USD value. With all those new digital assets emerging from nowhere the internet needed a currency and Doge filled that gap.</p>\n\n<h1><strong>Why is Dogecoin?</strong></h1>\n\n<p>If Bitcoin ever goes mainstream you probably won&#39;t be able to purchase a whole Bitcoin ever again. Sats would become the standard and value should (in theory) constantly keep going up because network usage will need to keep going up as well. Now imagine that you actually held through hell and back, waited for Bitcoin to hit millions just to lose your private keys however that may happen. No one would be able to recover that capital and you would find it hard to get a new reason to move on. With infinite inflation, things look a bit different.</p>\n\n<p>Scarcity rewards those that get in early and hold on to that currency until demand increases significantly. Doge, on the other hand, incentivizes spending and transacting making it an actual currency. 5 Billion coins per year do sound like a lot but it makes perfect sense in the long run. For example, if you have 100 coins and add 100 more the next year your inflation rate would be 100% but as time passes that percentage will decrease due to the increase in supply. In 100 years your inflation rate is only 1% and still decreasing. To put it simply, Bitcoin is an asset that is expected to have an increase in demand within the next few years or decades while Dogecoin is a currency that aims to provide fast, easy, and cheap value transfers in everyday transactions. If Bitcoin is used to store value, Dogecoin is a tool to quickly and cheaply transfer that value.</p>\n\n<h1><strong>How is Dogecoin?</strong></h1>\n\n<p>Dogecoin was created as a fork of Litecoin and is also <a href=\"https://www.coinwarz.com/mining/dogecoin/hashrate-chart\">secured by miners</a>. It has a much faster block time than LTC of just 1 minute, which made Dogecoin one of the fastest and cheapest currencies to transact with back in the &quot;old days&quot;. It recently spiked in popularity thanks to Elon Musk and TikTok but if you actually follow the <a href=\"https://np.reddit.com/r/dogecoin/\">Dogecoin subreddit</a> you will notice that they don&#39;t care much about your price speculation. As long as 1 Doge = 1 Doge no one is complaining. In terms of development, there hasn&#39;t been a single major update since 2015 but we did make it to <a href=\"https://www.theguardian.com/technology/2014/mar/27/nascar-dogecoin-sponsor-josh-wise-talladega-superspeedway\">NASCAR</a>. As far as network usage goes, Dogecoin <a href=\"https://bitinfocharts.com/dogecoin/\">averages</a> about 1.3k per hour compared to 14k on the Bitcoin network.</p>\n\n<p>So how is Dogecoin? Same as usual I guess.</p>\n</div><!-- SC_ON -->",
  "score": 804,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/R0L4E17sYsI9G3xX6NfowVmzitonvxh_ilA4F3Xeo6U.jpg?auto=webp&s=48be8261c4785fd7ad764803a5b6e35be7bef60f",
          "width": 220,
          "height": 220
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/R0L4E17sYsI9G3xX6NfowVmzitonvxh_ilA4F3Xeo6U.jpg?width=108&crop=smart&auto=webp&s=f0af3ed7e5247ad135c6fe3023c75f5b8c3dbb2f",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/R0L4E17sYsI9G3xX6NfowVmzitonvxh_ilA4F3Xeo6U.jpg?width=216&crop=smart&auto=webp&s=9bb8e88dde0bfdfaaf499468819fb9fde7b8d97c",
            "width": 216,
            "height": 216
          }
        ],
        "variants": {},
        "id": "BXTlM0W8XFmDdPvfrV_fpXmjQwMO_XLWfYJ43BEO8_Q"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/kx45hq/what_is_dogecoin_why_is_dogecoin_how_is_dogecoin/",
  "subreddit": "CryptoCurrency",
  "id": "kx45hq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311213788
}