{
  "author": "Asleep_Cup_1337",
  "the_new_excerpt": "Lululemon sales surged 88 per cent in the first quarter of 2021 to $1.2 billion\nas bricks and mortar stores reopened, prompting the athletic apparel company to\nraise its financial outlook for the year.\n\nThe Vancouver-based company, which reported earnings after markets closed on\nThursday, said net…",
  "original_created_utc": 1622780103,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ルルレモンの2021年第1四半期の売上高は、88％増の12億ドルに達しました。\nルルレモンの2021年第1四半期の売上高は、実店舗の再開により88％増の12億ドルに達し、アスレチック・アパレル企業の\nこれを受けて、同社は今年の業績見通しを上方修正しました。\n\nバンクーバーを拠点とする同社は、市場が閉まった後、次のように業績を発表しました。\n同社は、木曜日の市場終了後に決算報告を行い、純...",
      "title": "ルルレモンの決算。売上高は88％増"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "2021年第一季度，Lululemon的销售额激增88%，达到12亿美元。\n随着实体店的重新开张，促使这家运动服装公司提高了今年的财务前景。\n该公司提高了今年的财务展望。\n\n这家总部位于温哥华的公司在周四收市后公布了盈利情况。\n周四，该公司在市场收盘后公布了财报，称其净利润为10亿美元。",
      "title": "Lululemon公司盈利。营收猛增88"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2021年第一季度，Lululemon的銷售額激增88%，達到12億美元。\n隨着實體店的重新開張，促使這家運動服裝公司提高了今年的財務前景。\n該公司提高了今年的財務展望。\n\n這家總部位於溫哥華的公司在週四收市後公佈了盈利情況。\n週四，該公司在市場收盤後公佈了財報，稱其淨利潤爲10億美元。",
      "title": "Lululemon公司盈利。營收猛增88"
    }
  ],
  "title": "Lululemon earnings: Revenue jumps 88%",
  "created_utc": 1622820241,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Lululemon sales surged 88 per cent in the first quarter of 2021 to $1.2 billion as bricks and mortar stores reopened, prompting the athletic apparel company to raise its financial outlook for the year. </p>\n\n<p>The Vancouver-based company, which reported earnings after markets closed on Thursday, said net sales hit $1.2 billion in the first quarter, up from $651 million during the same time last year. Lululemon also reported a net income of $145 million, or $1.11 per diluted share, compared to $29 million last year, or 22 cents per diluted share. </p>\n\n<p>&quot;Our first quarter results reflected strength across all drivers of growth, fuelled by the continued expansion in our e-commerce business and a rebound in brick and mortar stores,&quot; chief executive Calvin McDonald said in a statement released after markets closed on Thursday. </p>\n\n<p>&quot;Our strong performance across categories, channels and geographies demonstrates the momentum and strength of Lululemon as we shift into the new normal.&quot;</p>\n\n<p>Lululemon said traffic to its bricks and mortar stores increased significantly in the first quarter of the year, with 93 per cent of the company&#39;s retail stores open by the end of the three month period. </p>\n\n<p>The company also saw growth in both its women&#39;s and men&#39;s categories. Sales of women&#39;s products increased 23 per cent when compared to 2019 sales, and men&#39;s sales jumped 27 per cent compared to 2019.</p>\n\n<p>McDonald expects that momentum to continue, even as economies reopen and customers begin to resume normal routines. He said sales growth has continued, even as consumers shift their daily habits. </p>\n\n<p>&quot;We have not seen a meaningful shift in our activewear categories through the first quarter,&quot; McDonald said. </p>\n\n<p>&quot;The big piece of our business and sales are in athletic activewear. I think with that, it has embedded strength to not be purely trend driven or fashion driven... Overall growth is across almost every category and is very balanced across geographies.&quot; </p>\n\n<p>The stronger-than-expected results pushed Lululemon to raise its sales targets for the full fiscal year. The company now expects net revenue to be between $5.83 billion and $5.91 billion in 2021, up from its prior range of $5.55 billion to $5.65 billion. Lululemon also expects adjusted earnings to be between $6.73 and $6.86 per share, compared to a prior range of $6.30 to $6.45. </p>\n\n<p>The projections surpass what analysts had anticipated. According to IBES data from Refinitiv, analysts had expected net revenue of $5.68 billion and earnings of $6.48 per share. </p>\n\n<p>With files from Reuters</p>\n\n<p>Alicja Siekierska is a senior reporter at Yahoo Finance Canada. Follow her on Twitter @alicjawithaj.</p>\n</div><!-- SC_ON -->",
  "score": 51,
  "permalink": "/r/investing/comments/nrwb5v/lululemon_earnings_revenue_jumps_88/",
  "subreddit": "investing",
  "id": "nrwb5v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404885455
}