{
  "author": "samuel19xd",
  "original_created_utc": 1637314042,
  "title": "How many times you panic sold and it came back to haunt you?",
  "created_utc": 1637328679,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It happened to me last dip. I panic sold BTC at 30k, why? Because the Technical gurus of multiple subs were predicting a 20k floor. I fucked up and took the wild astrological guess of these astrologers and sold all my stash, hoping to buy back at 20k. And we all know what happened afterwards. Well, first of all, repeat after me:</p>\n\n<h1>Nobody knows sh<em>t about f</em>*k!</h1>\n\n<p>Ok, feels much better now. So what&#39;s your panic sell story? How much convinced you were when you panic sold? Was it worth it? Or you fell for a astrologer too? </p>\n\n<p>I hope we could give some of our experiences to the newbies and help each other cope with the dip. One thing that is certain in crypto space is that blue chips always goes back up. Other than that Holding is not a bad idea if you invest in a solid project and are in it for long term. Many projects has shown astronomical returns after a crash or dip. Just remember that time in market beats timing the market. DCA, HODL and stake. Its not a get rich quick scheme, patience will pay in long term. You&#39;ll get there eventually.</p>\n\n<h1>Don&#39;t panic, and think rationally!</h1>\n</div><!-- SC_ON -->",
  "score": 202,
  "permalink": "/r/CryptoCurrency/comments/qxcluv/how_many_times_you_panic_sold_and_it_came_back_to/",
  "subreddit": "CryptoCurrency",
  "id": "qxcluv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It happened to me last dip. I panic sold BTC at 30k, why? Because the Technical\ngurus of multiple subs were predicting a 20k floor. I fucked up and took the\nwild astrological guess of these astrologers and sold all my stash, hoping to\nbuy back at 20k. And we all know what happened afterwards. Well,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは私の最後のディップで起こったことです。私は慌ててBTCを30kで売りましたが、なぜでしょう？なぜかというと、複数のサブサイトのテクニカル\n複数のサブサイトのテクニカルの達人が20kの底値を予測していたからです。私は失敗して\n占星術師たちの荒唐無稽な推測を鵜呑みにして、20kで買い戻そうと思って隠していたものを全部売ってしまった。\n20kで買い戻そうと思って。そして、その後どうなったかは皆さんご存知の通りです。さて...。",
      "title": "慌てて売ってしまったことが何度もありました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这事发生在我身上，上次的下跌。我在30K时恐慌性地卖出了BTC，为什么？因为技术\n多家子公司的技术大师们都在预测20K的底线。我搞砸了，接受了\n我搞砸了，接受了这些占星家的疯狂猜测，卖掉了我所有的藏品，希望能在20K时买回来。\n在20K时买回。我们都知道后来发生了什么。嗯，...",
      "title": "有多少次你惊慌失措地卖掉了东西，却又回来困扰着你？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這事發生在我身上，上次的下跌。我在30K時恐慌性地賣出了BTC，爲什麼？因爲技術\n多家子公司的技術大師們都在預測20K的底線。我搞砸了，接受了\n我搞砸了，接受了這些占星家的瘋狂猜測，賣掉了我所有的藏品，希望能在20K時買回來。\n在20K時買回。我們都知道後來發生了什麼。嗯，...",
      "title": "有多少次你驚慌失措地賣掉了東西，卻又回來困擾着你？"
    }
  ]
}