{
  "author": "cashobar",
  "the_new_excerpt": "Imagine that we somehow develop artificial intelligence strong enough to predict\nthe future with 100%, or near 100% accuracy. This is quite a common idea.\n\nBut what I’m more interested in is the question is whether a computer could\naccurately look into the past as well. If a computer hypothetically…",
  "original_created_utc": 1613997596,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "想象一下，我们以某种方式开发出了足以预测的人工智能\n100%或接近100%的准确率来预测未来。这是一个相当普遍的想法。\n\n但我更感兴趣的是，计算机是否能做到？\n也能准确地看清过去。如果一台电脑假设... ...",
      "title": "有没有可能，计算机会变得如此强大，不仅能100%准确地预测未来，还能回溯过去？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "想象一下，我們以某種方式開發出了足以預測的人工智能\n100%或接近100%的準確率來預測未來。這是一個相當普遍的想法。\n\n但我更感興趣的是，計算機是否能做到？\n也能準確地看清過去。如果一臺電腦假設... ...",
      "title": "有沒有可能，計算機會變得如此強大，不僅能100%準確地預測未來，還能回溯過去？"
    }
  ],
  "title": "Is it possible that a computer could become so powerful that it could not only predict the future with 100% accuracy, but also be able to look back into the past?",
  "created_utc": 1614041811,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Imagine that we somehow develop artificial intelligence strong enough to predict the future with 100%, or near 100% accuracy. This is quite a common idea. </p>\n\n<p>But what I’m more interested in is the question is whether a computer could accurately look into the past as well. If a computer hypothetically could become powerful enough to have access to all the information in the universe - and be able to pinpoint the exact coordinates of a particle on the other side of the galaxy - could it also be powerful enough to know where the particle has been in the past? Could a computer then, be able to sort of “time-travel” to the past (without actually physically going back in time) without altering it since it would know exactly where all particles were at any given time?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/lpn2jf/is_it_possible_that_a_computer_could_become_so/",
  "subreddit": "askphilosophy",
  "id": "lpn2jf",
  "is_self": true,
  "media": null,
  "is_video": false
}