{
  "author": "8300r",
  "original_created_utc": 1626507790,
  "title": "Do white supremacist Christians realize that Jesus was a brown man from the Middle East?",
  "created_utc": 1626522017,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If Jesus was from the Middle East and possibly a brown man, how would Christian white supremacists feel about that? If he showed up to them today, would he be the saviour or still be a immigrant?</p>\n\n<p>Edit:- Adding to my original question, because it&#39;s a little vague and the some comments are forking in all sort of directions opposite to the question.</p>\n</div><!-- SC_ON -->",
  "score": 193,
  "permalink": "/r/TooAfraidToAsk/comments/olzv5a/do_white_supremacist_christians_realize_that/",
  "subreddit": "TooAfraidToAsk",
  "id": "olzv5a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If Jesus was from the Middle East and possibly a brown man, how would Christian\nwhite supremacists feel about that? If he showed up to them today, would he be\nthe saviour or still be a immigrant?\n\nEdit:- Adding to my original question, because it's a little vague and the some\ncomments are forking in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もしイエスが中東出身で、もしかしたら褐色の男性だったとしたら、キリスト教の\n白人至上主義者はどう思うでしょうか？もし彼が今日、彼らの前に現れたとしたら、彼は救世主になるのでしょうか？\n彼は救世主になるのでしょうか、それともまだ移民のままなのでしょうか？\n\nEdit:- 私の最初の質問に付け加えて、それは少し曖昧で、いくつかのコメントは\nコメントが分岐しているので...。",
      "title": "白人至上主義のキリスト教徒は、イエスが中東の褐色の人であったことを理解しているのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果耶稣来自中东，而且可能是个棕色人种，那么基督教徒会怎么看？\n白人至上主义者对此有何感受？如果他今天出现在他们面前，他是否会\n救世主还是仍然是一个移民？\n\n编辑：-对我原来的问题进行补充，因为它有点含糊不清，而且一些\n评论是岔开的......",
      "title": "白人至上主义的基督徒是否意识到，耶稣是一个来自中东的棕色人种？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果耶穌來自中東，而且可能是個棕色人種，那麼基督教徒會怎麼看？\n白人至上主義者對此有何感受？如果他今天出現在他們面前，他是否會\n救世主還是仍然是一個移民？\n\n編輯：-對我原來的問題進行補充，因爲它有點含糊不清，而且一些\n評論是岔開的......",
      "title": "白人至上主義的基督徒是否意識到，耶穌是一個來自中東的棕色人種？"
    }
  ]
}