{
  "author": "krisolch",
  "the_new_excerpt": "This is going to be the ultimate guide on what you should learn first starting\nfrom knowing absolutely nothing about investing to becoming an investor who can\nbeat the market indexes. It doesn't matter if you invest in penny stocks or blue\nchips. The principles are all the same.\n\nThis is an…",
  "original_created_utc": 1608552884,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这将是关于你应该首先学习什么的终极指南。\n从对投资一无所知到成为一名有能力的投资者\n跑赢大盘指数。不管你是投资Penny股票还是Blue\n薯条。原则都是一样的。\n\n这是一台…",
      "title": "关于您首先需要了解的基本知识的终极指南-从新手到专业投资者"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這將是關於你應該首先學習什麼的終極指南。\n從對投資一無所知到成爲一名有能力的投資者\n跑贏大盤指數。不管你是投資Penny股票還是Blue\n薯條。原則都是一樣的。\n\n這是一臺…",
      "title": "關於您首先需要了解的基本知識的終極指南-從新手到專業投資者"
    }
  ],
  "title": "The Ultimate Fundamentals Guide on What You Need to Learn First - From Newbie to Pro Investor",
  "created_utc": 1608561337,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is going to be the ultimate guide on <strong><em>what</em></strong> you should learn first starting from knowing absolutely nothing about investing to becoming an investor who can beat the market indexes. It doesn&#39;t matter if you invest in penny stocks or blue chips. The principles are all the same.</p>\n\n<p>This is an opinionated guide. If you just want a resource unopinionated guide then check out this github:</p>\n\n<p><a href=\"https://github.com/ckz8780/market-toolkit\">https://github.com/ckz8780/market-toolkit</a> (made by <a href=\"/r/StockMarket\">r/StockMarket</a> &amp; <a href=\"/u/ghostofgbt\">u/ghostofgbt</a>).</p>\n\n<p>Check out the original post to keep updated on this guide as this subreddit does not allow cross-posting: <a href=\"https://www.reddit.com/r/UndervaluedStonks/comments/kheec2/the_ultimate_fundamentals_guide_on_what_you_need/\">https://www.reddit.com/r/UndervaluedStonks/comments/kheec2/the_ultimate_fundamentals_guide_on_what_you_need/</a></p>\n\n<p>I will update it constantly in the future.</p>\n\n<h1>Prerequisites</h1>\n\n<p>- There are no capital requirements to investing. In fact you should start learning as soon as possible because it takes time to become proficient at investing.</p>\n\n<p>- This guide is only for fundamentals as I specialize in fundamentals and not day trading, technical charting, cryptocurrencies or forex trading.</p>\n\n<p>- This guide is tailored towards people who want to individually pick stocks, if you solely do ETF&#39;s or index investing this guide is still useful to you but not aimed at you.</p>\n\n<p>- Investing should be done with disposable income. NOT with income you need such as rent money.</p>\n\n<p>- If you aren&#39;t willing to put in the time and effort that investing requires to beat the market indexes then you should stick to passive investing and just buy an index fund and forget about it for 20 years. This requires 0 effort but you will never beat 8% a year on average and you because you lack experience you may panic and sell at times when you shouldn&#39;t.</p>\n\n<h1>1. Getting Started</h1>\n\n<p>To start off I would recommend watching this overview video, it quickly goes over the main stuff by legend investor Bill Ackman:</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=WEDIj9JBTC8\">Bill Ackman: Everything You Need to Know About Stocks</a></p>\n\n<p>Then you should start reading, lots of reading and no big amounts of investing. You have to read books from other fundamental investors to have an idea of how they did it and the decades of accumulated experience of investing they have poured into that book. It&#39;s important to read the right books from authors who have a track record of beating the market, not just anybody. I have ordered this list in terms of ease of reading for newbie investors as well as priority:</p>\n\n<ol>\n<li><a href=\"https://www.amazon.co.uk/One-Up-Wall-Street-Fireside/dp/0743200403\">Peter Lynch - One Up On Wall Street</a></li>\n<li><a href=\"https://www.amazon.co.uk/Beating-Street-Peter-Lynch/dp/0671891634\">Peter Lynch - Beating the Street</a></li>\n<li><a href=\"https://www.amazon.co.uk/Little-Beats-Market-Books-Profits-ebook/dp/B000YIUWFQ\">Joel Greenblatt - The Little Book That Beats the Market</a></li>\n</ol>\n\n<p>These 3 are all easy books for a beginner to get their feet wet and start off with some solid fundamentals. The harder books will come later.</p>\n\n<h1>2. Relative Valuation Ratio&#39;s &amp; Technical Terms</h1>\n\n<p>There are <strong>a ton</strong> of financial terms and ratio&#39;s to learn such as PE, PEG, ROIC etc. The way to go about this is to learn these ratio&#39;s as you go when you encounter them in a book or your valuation and not just all at once. Investopedia usually has good explanations and videos of every term.</p>\n\n<p>- <a href=\"https://www.investopedia.com/\">Investopedia</a></p>\n\n<p>The most important ratio&#39;s and relative valuations in my opinion are:</p>\n\n<p>- <a href=\"https://www.investopedia.com/terms/r/revenue.asp\">Revenue</a></p>\n\n<p>- <a href=\"https://www.investopedia.com/terms/o/operatingmargin.asp\">Operating Margin</a></p>\n\n<p>- <a href=\"https://www.investopedia.com/terms/o/operatingincome.asp\">Operating Income</a></p>\n\n<p>- <a href=\"https://www.investopedia.com/terms/r/returnoninvestmentcapital.asp\">ROIC</a></p>\n\n<p>- <a href=\"https://www.investopedia.com/terms/w/wacc.asp\">WACC</a> (not the CAPM Version)</p>\n\n<p>- <a href=\"https://www.investopedia.com/terms/p/price-to-cash-flowratio.asp#:%7E:text=The%20price%2Dto%2Dcash%20flow%20(P%2FCF\">Price-to-operating Cash Flow</a>,and%20amortization%20to%20net%20income)</p>\n\n<p>- <a href=\"https://www.investopedia.com/terms/p/pricetofreecashflow.asp\">Price-to-free Cash Flow</a></p>\n\n<p>- <a href=\"https://www.gurufocus.com/term/p2Owner_Earnings/PLA/Price-to-Owner-Earnings/\">Price-to-owner-earnings</a></p>\n\n<p>- <a href=\"https://www.investopedia.com/terms/d/debtequityratio.asp\">Debt-to-Equity</a></p>\n\n<p>- <a href=\"https://www.investopedia.com/terms/i/interestcoverageratio.asp\">Interest Coverage</a></p>\n\n<p>- <a href=\"https://www.investopedia.com/terms/p/pegratio.asp\">PEG</a></p>\n\n<p>The most useless financial metric by far that way too many people use is the <a href=\"https://www.investopedia.com/terms/p/price-earningsratio.asp\">PE ratio</a>, it is easily manipulated by accounting shenanigans, fluctuations in short term reporting and reinvesting companies such as Amazon. The PEG ratio also suffers from this but is better as it factors in growth.</p>\n\n<p>Here&#39;s an intro to relative valuations by Aswath Damoradan:</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=WDZwqSierZ4\">Session 14: Relative Valuation - First Principles (Free)</a></p>\n\n<h1>3. Reading Financial Statements</h1>\n\n<p>Investing is all about reading financial statements and understanding how to read them such as the 10-k, 10-Q etc. Pick any company, it doesn&#39;t matter which one but I recommend that you pick a simple company that you already use and know.</p>\n\n<p><strong>Income Statement</strong></p>\n\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=Q8wKr1QDSwg\">Session 2: The Income Statement (Free)</a></li>\n</ul>\n\n<p><strong>Statement of Cash Flows</strong></p>\n\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=XobT12fvkXc&amp;t=1s\">Session 4: The Statement of Cash Flows (Free)</a></li>\n</ul>\n\n<p><strong>The Balance Sheet</strong></p>\n\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=cSuc2HHQpxc&amp;t=1s\">The Balance Sheet (Free)</a></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>Official RNS Reporting Sites</strong></p>\n\n<p>Companies are required to file official reports with their countries regulator, in the U.S this is the SEC (apart from small companies that trade Over The Counter).A list of the most popular official sites, you can search for your company on here:</p>\n\n<p>- <a href=\"https://www.sec.gov/edgar/searchedgar/companysearch.html\">SEC - United States Listed Stocks</a></p>\n\n<p>- <a href=\"https://www.otcmarkets.com/\">OTC - United States OTC (Penny) stocks</a></p>\n\n<p>- <a href=\"https://www.londonstockexchange.com/\">LSE - UK Stocks</a></p>\n\n<p>- <a href=\"https://www2.asx.com.au/\">ASX - Australian Stocks</a></p>\n\n<p>- <a href=\"https://www.nzx.com/\">NZX - New Zealand Stocks</a></p>\n\n<p>- <a href=\"https://www.tsx.com/\">TSX - Canadian Stocks</a></p>\n\n<p>- <a href=\"https://www.thecse.com/\">CSE - Canadian Alternative Stocks</a></p>\n\n<p>- <a href=\"https://www.euronext.com/en\">EURONEXT - France, Ireland, Netherlands, Belgium, Portugal, Norway, Alt UK</a></p>\n\n<p>- <a href=\"https://www.gpw.pl/en-home\">GPW - Polish Stocks</a></p>\n\n<p>- <a href=\"https://www.boerse-frankfurt.de/en\">BOERSE FRANKFURT - German Stocks</a></p>\n\n<p>Filings dump: <a href=\"https://github.com/ckz8780/market-toolkit#filings\">https://github.com/ckz8780/market-toolkit#filings</a></p>\n\n<p>It makes no sense to limit yourself to investing in one country only. A lot of bargains lay in other countries and you should expand your horizons to them and not just U.S stocks on Robinhood. So I added international links above too.</p>\n\n<p>A lot of the above sites also have email signups so you can be notified <strong>instantly</strong> when a companies publish a new report.</p>\n\n<h1>4. Screeners</h1>\n\n<p>You should learn how to use screeners to narrow down stocks within your circle of competence and to the ratio&#39;s that you learned about in section 2. You want to screen for stocks that have below a certain threshold in x ratio, for example `PEG &lt; 1` which will screen all stocks for you that have a PEG of less than 1 (A PEG of &lt; 1 is theoretically undervalued...sometimes). It&#39;s best to combine multiple ratio&#39;s together to really narrow down to a select few companies to look at. This saves a bunch of time in finding potentially good companies.</p>\n\n<p>The ratio&#39;s I like to use were all mentioned in section 2.</p>\n\n<p>Screeners dump:</p>\n\n<ul>\n<li><a href=\"https://github.com/ckz8780/market-toolkit#scanners\">https://github.com/ckz8780/market-toolkit#scanners</a></li>\n</ul>\n\n<p>Screeners I personally like best:</p>\n\n<ul>\n<li><a href=\"https://finviz.com/screener.ashx\">Finviz (Free)</a></li>\n<li><a href=\"https://www.gurufocus.com/screener\">GuruFocus (Paid)</a></li>\n</ul>\n\n<h1>5. Value Investing</h1>\n\n<p>The easiest way to make money long term in the stock market is to simple buy undervalued stocks, this ties into value investing. It&#39;s a simple concept where if you buy something undervalued then sooner or later the market will realize it&#39;s undervalued and correct accordingly (most times, sometimes it can stay undervalued forever). A lot of people mistake value investing for price to book ratio or some trash ratio like that, value investing is simply the concept of buying a stock for less than its intrinsic worth (i.e a margin of safety).</p>\n\n<p>To get started I recommend you take a look at the top posts of all time on our sister sub: <a href=\"https://www.reddit.com/r/ValueInvesting/top/?t=all\">https://www.reddit.com/r/ValueInvesting/top/?t=all</a></p>\n\n<p>Then you <strong>must</strong> read the following books as well:</p>\n\n<ol>\n<li><a href=\"https://www.amazon.co.uk/Intelligent-Investor-Definitive-Investing-Practical/dp/0060555661/ref=sr_1_3?dchild=1&amp;keywords=intelligent+investor+edition&amp;qid=1608384157&amp;sr=8-3\">Benjamin Graham - Intelligent Investor</a></li>\n<li><a href=\"https://www.amazon.co.uk/Security-Analysis-Foreword-Buffett-Editions/dp/0071592539\">Benjamin Graham - Security Analysis, Sixth Edition</a></li>\n</ol>\n\n<p>These are the staples of value investing and what Warren Buffet read multiple times. They are difficult and long books to understand at first which is why I have put them in the 4th section so don&#39;t worry if you don&#39;t understand everything at first.</p>\n\n<h1>6. Intrinsic Valuations</h1>\n\n<p>The most important part of this section in my opinion. If you understand how to intrinsically value a company then you understand when to buy and when to sell a company based on it&#39;s real value.</p>\n\n<p>These differ from relative valuations such as the ratio&#39;s I posted above (PEG, PE etc) because here we are trying to find the intrinsic value to a company and NOT the relative value compared to it&#39;s peers. This is an important difference, for example in the 2001 dot com bubble you could have valued an insanely overvalued internet stock with a relative ratio such as Price-Operating-Cash-Flow and you may have found it to be better than it&#39;s peers. Just because it&#39;s better relatively than it&#39;s peers in it&#39;s industry does not mean a company is fair value.</p>\n\n<p><strong>Discounted Cash Flows Models</strong></p>\n\n<p>The reason a lot of people do not like DCF&#39;s is because:</p>\n\n<ol>\n<li>They do not understand how to do them properly.</li>\n<li>The resources online are absolutely terrible for DCF&#39;s, most use CAPM (in my opinion, a completely flawed way to calculate your WACC).</li>\n<li>The templates are confusing.</li>\n</ol>\n\n<p>I felt the same way until I watched Aswath Damoradan&#39;s course on corporate finance.</p>\n\n<p>Here&#39;s the short course with 15 min long videos each:</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=znmQ7oMiQrM&amp;list=PLUkh9m2BorqnKWu0g5ZUps_CbQ-JGtbI9\">Short Course on Valuation (Free)</a></p>\n\n<p>However I highly recommend you do the entire university course (for free) because it&#39;s invaluable to understanding how to intrinsically value companies:</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=4IxSvyBEK7s&amp;list=PLUkh9m2Borqn0rW96St_MJchWcjbdfWxT\">2019 Full Undergraduate Valuation Course (Free)</a></p>\n\n<p><a href=\"https://www.youtube.com/watch?v=OiMw4AuMRlE&amp;list=PLUkh9m2Borqkr0lxe9WjH7cDBi4ZnZPOx\">2019 Full MBA Valuation Course (Free)</a></p>\n\n<p>There is a lot of cross-over between the above two playlists so once you do one course you can cherry pick videos from the other course.</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=F9GfXJ-IrSA&amp;list=PLUkh9m2Borqnk6tJUpGzN4RcDUBAjovqN&amp;index=4\">Covid DCF Template Excel Spreadsheet (Free)</a></p>\n\n<p><a href=\"http://pages.stern.nyu.edu/%7Eadamodar/\">NYU - All Valuation Spreadsheets (Free)</a></p>\n\n<p>I use the above first link for all my DCF&#39;s that you see me post here, if you see the description of the youtube video he links to the excel file template.The reason why I like it is because it&#39;s easy to use (he explains how to use it in his video) and it does not use the flawed CAPM model for calculating the WACC.</p>\n\n<p><strong>Dividend Discount Models</strong></p>\n\n<p>An alternative way of getting the intrinsic value of a company. I do these very rarely so I&#39;m no expert on them. I hope to up date this section in the future with more details.</p>\n\n<ul>\n<li><a href=\"http://pages.stern.nyu.edu/%7Eadamodar/pdfiles/valn2ed/ch14.pdf\">Aswath Damoradan - Ch 14: Dividend Discount Models</a></li>\n</ul>\n\n<h1>7. Accounting</h1>\n\n<p>To be able to read Financial Statement numbers you really need to know how accounting works, both for GAAP (U.S) and IFRS (Most of Rest of World).</p>\n\n<p>The reason why you should know accounting is not only to spot red flags in financial statements but also to understand the downsides of accounting. For example, only recently in 2018 were companies required to include Capital Leases in their balance sheets liabilities. Before then, companies could hide it in Off-Balance sheet statements that few people looked at, grossly inflating the viability of some businesses with heavy lease requirements.</p>\n\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=ZkZ6Q67Q15E&amp;list=PL301238C9BC6E0B83\">David Krug - Accounting 1 Full Course (Free)</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=2cC9SZ3RC8Y&amp;list=PLHhe-2tIHRqEw5JRX6trtsLLlwwbpdXJX\">David Krug - Accounting 2 Full Course (Free)</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=Jbp3-AU9v_g&amp;list=PLUkh9m2BorqmKaLrNBjKtFDhpdFdi8f7C\">Aswath Damoradan - Accounting 101 (Free)</a></li>\n<li><a href=\"https://www.amazon.co.uk/Financial-Shenanigans-Accounting-Gimmicks-Reports/dp/0071703071\">Howard Schilit - Financial Shenanigans, How to Detect Accounting Gimmicks &amp; Fraud in Financial Reports</a></li>\n</ul>\n\n<p>David Krug&#39;s courses are an in depth full courses on accounting. You may not have the time to learn accounting in full though so if you do not then I would recommend the Accounting 101 course which fast tracks you to learn only what you need for our purposes.</p>\n\n<p>Howard Schilit&#39;s book will give you a good overview into the most common financial accounting tricks that you can try and spot.</p>\n\n<h1>8. Psychology of Investing</h1>\n\n<p>I have put this at section 7 because it&#39;s had to quantify how much it can help you as it&#39;s different for each individual and also because psychology is a long term game with investing.</p>\n\n<p>This is perhaps the most overlooked section though, most investors never bother to get their psych in order which is a big mistake usually because of overconfidence of their own abilities.</p>\n\n<ul>\n<li><a href=\"https://www.amazon.co.uk/Little-Book-Behavioral-Investing-Profits/dp/0470686022\">The Little Book of Behavioral Investing: How not to be your own worst enemy</a></li>\n<li><a href=\"https://www.amazon.co.uk/Behavioral-Investor-Daniel-Crosby/dp/0857196863/ref=sr_1_1?dchild=1&amp;keywords=behavioural+investor&amp;qid=1608401405&amp;sr=8-1\">The Behavioral Investor</a></li>\n</ul>\n\n<h1>9. Monte Carlo Simulations &amp; Data/Statistics</h1>\n\n<p>This section is completely optional and not necessary but allows you to fine tune your assumptions.</p>\n\n<p>So monte-carlo simulations are simulations that run thousands of times on your valuation models (such as your DCF model) to simulate multiple cases in your models. So instead of just doing a bear case and a bull case in your DCF model you can run a monte-carlo simulation and give your boundaries for your inputs (e.g 25% with a std. deviation of +/- 5%) and you will get a range of different outputs, in our case estimated prices per share and then you can use the mean price as your estimated price per share.</p>\n\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=rFd_qEpYFBc\">Aswath Damoradan - A Monte Carlo Simulation Guide (Free)</a></li>\n<li><a href=\"https://www.simularsoft.com.ar/\">Simular Monte Carlo Simulation Excel Plugin (Free)</a></li>\n<li><a href=\"https://www.riskamp.com/\">RiskAMP Monte Carlo Simulation Excel</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Comparison_of_risk_analysis_Microsoft_Excel_add-ins\">Comparison of Monte Carlo Excel Plugins</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=uzkc-qNVoOk&amp;list=PLC58778F28211FA19\">Khan Academy - Probabilities and Statistics Full Course (Free)</a></li>\n</ul>\n\n<p>Well... if you&#39;ve made it this far then congratz. It&#39;s a lot to learn, basically a full time job to learn all of it. And that&#39;s the point, if it was easy everyone would be rich.</p>\n\n<p>A final point is that a lot of the above links are from prof. Aswath Damoradan. The reason is that I have found him to be the absolute best source of information in regards to valuation ever and everything he publishes is completely free.</p>\n\n<p>If you want similar good quality DD posts in the future you can follow me on reddit <a href=\"/u/krisolch\">u/krisolch</a> or go to <a href=\"/r/UndervaluedStonks\">r/UndervaluedStonks</a>.</p>\n\n<p>Thanks!</p>\n</div><!-- SC_ON -->",
  "score": 1900,
  "permalink": "/r/investing/comments/khg9sj/the_ultimate_fundamentals_guide_on_what_you_need/",
  "subreddit": "investing",
  "id": "khg9sj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609183318255
}