{
  "author": "GroundbreakingLack78",
  "the_new_excerpt": "Friedrich Hayek. Nobel prize winner in 1974 in Economics for his \"pioneering\nwork in the theory of money and economic fluctuations”\n\nIn 1976 Friedrich Hayek wrote\nThe Denationalization of Money.\nThe book argued for the end of the government’s monopoly on currency.\n\nIntroduction quote from the…",
  "original_created_utc": 1617196776,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "弗里德里希-哈耶克。1974年诺贝尔经济学奖获得者，因其 \"开创性的\n货币与经济波动理论著作\"\n\n1976年，弗里德里希-哈耶克写道\n货币的非国家化。\n该书主张结束政府对货币的垄断。\n\n导语引自《...",
      "title": "预测加密货币的经济学家"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "弗里德里希-哈耶克。1974年諾貝爾經濟學獎獲得者，因其 \"開創性的\n貨幣與經濟波動理論著作\"\n\n1976年，弗里德里希-哈耶克寫道\n貨幣的非國家化。\n該書主張結束政府對貨幣的壟斷。\n\n導語引自《...",
      "title": "預測加密貨幣的經濟學家"
    }
  ],
  "title": "The Economist Who Predicted Cryptocurrency",
  "created_utc": 1617233427,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Friedrich Hayek. Nobel prize winner in 1974 in Economics for his &quot;pioneering work in the theory of money and economic fluctuations”</p>\n\n<p>In 1976 Friedrich Hayek wrote<br/>\n<strong>The Denationalization of Money.</strong><br/>\nThe book argued for the end of the government’s monopoly on currency.</p>\n\n<p><strong>Introduction quote from the book</strong></p>\n\n<p><em>“In my despair about the hopelessness of finding a politically feasible solution to what is technically the simplest possible problem, namely to stop inflation, I threw out in a lecture delivered about a year ago a somewhat startling suggestion, the further pursuit of which has opened quite unexpected new horizons…<br/>\nThe further pursuit of the suggestion that government should be deprived of its monopoly of the issue of money opened the most fascinating theoretical vistas and showed the possibility of arrangements which have never been considered.”</em> - F.A.Hayek </p>\n\n<p>Thirty years later, the financial crisis of 2007 saw huge inflation, rising unemployment and sky-rocketing interest rates. It was considered the most serious financial crisis since the 1930s. Once again, the government’s monopoly on currency was questioned. On 3 January 2009, the first bitcoin was mined.</p>\n\n<p>It was Hayek’s theory made practical.</p>\n\n<p>Hayek’s theory in his book was that not only would the currency monopoly be taken away from the government, but that the monopoly on currency itself should end with multiple alternative currencies competing for acceptance by consumers. Cryptocurrencies continued to follow in the economist’s vision. Since the creation of the first bitcoin, 8,700~ crypto alternatives have been created.</p>\n\n<p>Another visionary quotes that got stuck in my head and they’re worth mentioning. </p>\n\n<p>“<em>I don’t believe we shall ever have a good money again before we take the thing out of the hands of government.<br/>\nWe can’t take it violently out of the hands of government, all we can do is by some sly roundabout way introduce something that</em> <strong>they can’t stop</strong>.”</p>\n\n<p><em>”The chief evil is unlimited government, and nobody is qualified to wield unlimited power.”</em></p>\n\n<p>I thought that you guys would like to hear this fact, that such a vision was written and told 40 years ago by someone that achieved something in his life. I know, that some of you don’t like, when we are sharing the quotes from the history figures because they said a good chunk of things that was false. In this case, I feel like, the vision that Mr.Hayek had, is becoming true, and everyday we’re closer to it. </p>\n\n<p>Hope you found this “legacy” somehow educating or inspiring.</p>\n\n<p>R.I.P Mr.Hayek - your vision is becoming reality :)</p>\n\n<p>Have a nice day ! DCA and HODL !</p>\n</div><!-- SC_ON -->",
  "score": 222,
  "permalink": "/r/CryptoCurrency/comments/mh5y7e/the_economist_who_predicted_cryptocurrency/",
  "subreddit": "CryptoCurrency",
  "id": "mh5y7e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357138676
}