{
  "author": "Forrandoqs",
  "the_new_excerpt": "If you're part of the 1% - what makes you think you can beat the market? Is it\npossible to acquire these advantages?\n\nThe arguments for passive investing seem REALLY damning for active investing\n(I'm sure you've all heard them - not a lot of funds actually beat the market\nbeing the single most…",
  "original_created_utc": 1623628154,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もしあなたが1％の一員であれば、なぜ市場に勝てると思うのでしょうか？それは\nこのような優位性を獲得することは可能でしょうか？\n\nパッシブ投資の議論は、アクティブ投資にとってはかなり不利なようです。\n皆さんも聞いたことがあると思いますが、実際に市場に勝っているファンドは多くありません。\n最も重要なのは...",
      "title": "ボーグル・スタイルのパッシブ投資は、99％の個人投資家にとって本当に良いのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你是那1%的人--是什么让你认为你能战胜市场？是否有可能\n有可能获得这些优势吗？\n\n被动投资的论点似乎对主动投资来说是非常不利的\n我相信你们都听过--没有多少基金能真正战胜市场\n是单一的最...",
      "title": "博格斯式的被动投资对99%的散户投资者来说真的更好吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你是那1%的人--是什麼讓你認爲你能戰勝市場？是否有可能\n有可能獲得這些優勢嗎？\n\n被動投資的論點似乎對主動投資來說是非常不利的\n我相信你們都聽過--沒有多少基金能真正戰勝市場\n是單一的最...",
      "title": "博格斯式的被動投資對99%的散戶投資者來說真的更好嗎？"
    }
  ],
  "title": "Is bogles style passive investing really better for 99% of retail investors?",
  "created_utc": 1623640366,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you&#39;re part of the 1% - what makes you think you can beat the market? Is it possible to acquire these advantages?</p>\n\n<p>The arguments for passive investing seem REALLY damning for active investing (I&#39;m sure you&#39;ve all heard them - not a lot of funds actually beat the market being the single most damning, IMO). I do think that wall street&#39;s being influenced by forces that don&#39;t affect retail investors, but obviously, we don&#39;t have access to the same kind of information they do. And while I think I&#39;m definitely in the upper half of stock pickers, I&#39;m not delusional as well and can&#39;t place if I&#39;m closer to the median, or the upper crust, so I&#39;m wondering if trying to build these advantages and taking advantage of any market inefficiencies is worth it. </p>\n\n<p>Thanks!</p>\n</div><!-- SC_ON -->",
  "score": 825,
  "permalink": "/r/investing/comments/nz9dxc/is_bogles_style_passive_investing_really_better/",
  "subreddit": "investing",
  "id": "nz9dxc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009742344
}