{
  "author": "basketball-lighting",
  "original_created_utc": 1640825441,
  "title": "I created a free website that pairs Philips Hue lights with NBA games",
  "created_utc": 1640835098,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I   just released a beta version of a site that allows you to connect your   hue lights to live basketball games.  Say the Miami Heat are playing  the  Los Angeles Lakers -- As the Heat start to take a big lead, the  room  will grow more and more red in real time.&lt;/p&gt;\n\n&lt;p&gt;I   originally made this app just for myself so that I  could ambiently  follow along with basketball games in the background while my partner   and I watch movies, but I started using it during games and it turned   out to really enhance the experience of watching.&lt;/p&gt;\n\n&lt;p&gt;Looking for anyone to try it out and give me some feedback!&lt;/p&gt;\n\n&lt;p&gt;Note:   This doesn&amp;#39;t play nicely on mobile currently unless you tell your   internet browser to allow pop-ups.  The first time you use this site,   you will be warned in a pop-up that there is an insecure connection and   you will have to click through that message and accept before returning   to the site. This is due to something on the Hue API side.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://basketball.lighting/\"&gt;https://basketball.lighting&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/rrnwwj/i_created_a_free_website_that_pairs_philips_hue/",
  "subreddit": "SideProject",
  "id": "rrnwwj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I just released a beta version of a site that allows you to connect your hue\nlights to live basketball games. Say the Miami Heat are playing the Los Angeles\nLakers -- As the Heat start to take a big lead, the room will grow more and more\nred in real time.\n\nI originally made this app just for myself…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "hueを接続できるサイトのベータ版をリリースしました。\nをバスケットボールの試合中継に使用します。例えば、マイアミ・ヒートがロサンゼルスと対戦しているとします。\nヒートが大きくリードし始めると、部屋はだんだん大きくなっていきます。\nをリアルタイムで赤くします。\n\n元々は自分のためだけに作ったアプリなんですけどね...。",
      "title": "Philips Hueの照明とNBAの試合をペアリングする無料のウェブサイトを作りました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚发布了一个网站的测试版，允许你将你的hue\n灯与现场篮球比赛相连接。假设迈阿密热火队正在对阵洛杉矶队\n当热火队开始大比分领先时，房间里的红色会越来越多。\n红色。\n\n我最初做这个应用程序只是为了自己...",
      "title": "我创建了一个免费网站，将飞利浦Hue灯与NBA比赛配对使用"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛發佈了一個網站的測試版，允許你將你的hue\n燈與現場籃球比賽相連接。假設邁阿密熱火隊正在對陣洛杉磯隊\n當熱火隊開始大比分領先時，房間裏的紅色會越來越多。\n紅色。\n\n我最初做這個應用程序只是爲了自己...",
      "title": "我創建了一個免費網站，將飛利浦Hue燈與NBA比賽配對使用"
    }
  ]
}