{
  "author": "amburgueso",
  "original_created_utc": 1651093687,
  "title": "Why is my boyfriend so much more handsome to me all of a sudden? He looks the exact same",
  "created_utc": 1651108201,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So the title basically says it all. Recently I&amp;#39;ve found that my boyfriend looks so much more handsome to me for no reason. Like I literally can&amp;#39;t stop staring at him every time I see him around. It&amp;#39;s interesting to me because when I first met him, I thought he was below average in looks. I know this sounds bad but it&amp;#39;s the truth. If I&amp;#39;d never gotten to know him and just saw him walking on the street, I honestly wouldn&amp;#39;t have given him a second glance.&lt;/p&gt;\n\n&lt;p&gt;I initially became interested in him because of his amazing personality. He&amp;#39;s extremely intelligent, caring, funny, and sweet. Plus we have a lot of the same interests. But now after knowing him for almost a year now, I find myself obsessed with how he looks. I don&amp;#39;t know why but the more I look at him, the more handsome he appears to be even though nothing about him has actually changed. I literally can&amp;#39;t stop daydreaming about him whenever we are apart. The way he walks, his handwriting, his smell, all these quirks about him that I was neutral towards before are suddenly all I can think about 24/7. Yesterday I was sitting on the couch when he walked up to me. All he did was approach me while I was seated and that alone was enough to get me aroused. I could literally feel the heat rushing to my face and private parts but I had to act like I was completely fine. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what is happening. I would appreciate if someone could give me an answer. Thanks!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 123,
  "permalink": "/r/TooAfraidToAsk/comments/uddyb7/why_is_my_boyfriend_so_much_more_handsome_to_me/",
  "subreddit": "TooAfraidToAsk",
  "id": "uddyb7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So the title basically says it all. Recently I've found that my boyfriend looks\nso much more handsome to me for no reason. Like I literally can't stop staring\nat him every time I see him around. It's interesting to me because when I first\nmet him, I thought he was below average in looks. I know…"
}