{
  "author": "fartingmoney",
  "the_new_excerpt": "All,\n\nI think a greatly undervalued stock is Rite Aid. Since the sale to Walgreens\nfell through (Walgreens decided to only purchase half of Rite Aid stores), the\nstock has taken a beating.\n\nSince then, Rite Aid has brought in a new CEO and changed up their management\nteam. They've implemented a new…",
  "original_created_utc": 1623342463,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "すべてです。\n\n大幅に割安な株はRite Aidだと思います。ウォルグリーン社への売却が失敗に終わったため\nへの売却が失敗して以来（ウォルグリーン社はライトエイドの店舗の半分しか購入しないことを決めた）、株価は打撃を受けている。\n株は打撃を受けました。\n\nそれ以来、Rite Aidは新しいCEOを迎え、経営陣を変更しました。\n経営陣を一新しました。彼らは、新しい...",
      "title": "Rite Aid $RAD - 割安感あり"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所有。\n\n我认为被大大低估的股票是Rite Aid。自从出售给沃尔格林公司的交易\n的交易失败后（沃尔格林决定只购买一半的Rite Aid门店），该股就受到了打击。\n股价就受到了打击。\n\n从那时起，Rite Aid已经带来了一位新的首席执行官，并改变了他们的管理团队。\n团队。他们已经实施了一个新的...",
      "title": "Rite Aid $RAD - 被低估的价值"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所有。\n\n我認爲被大大低估的股票是Rite Aid。自從出售給沃爾格林公司的交易\n的交易失敗後（沃爾格林決定只購買一半的Rite Aid門店），該股就受到了打擊。\n股價就受到了打擊。\n\n從那時起，Rite Aid已經帶來了一位新的首席執行官，並改變了他們的管理團隊。\n團隊。他們已經實施了一個新的...",
      "title": "Rite Aid $RAD - 被低估的價值"
    }
  ],
  "title": "Rite Aid $RAD - Undervalued",
  "created_utc": 1623382416,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>All,</p>\n\n<p>I think a greatly undervalued stock is Rite Aid. Since the sale to Walgreens fell through (Walgreens decided to only purchase half of Rite Aid stores), the stock has taken a beating. </p>\n\n<p>Since then, Rite Aid has brought in a new CEO and changed up their management team. They&#39;ve implemented a new strategy to modernize the store layout, focus on growing their PBM, acquired Bartell (Seattle&#39;s largest pharmacy) and creating a better experience for customers. </p>\n\n<p>Rite Aid is the 3rd largest pharmacy chain in the US (behind Walgreens and CVS). In FY21 they&#39;ve done $24B+ in Revenue. The issue is that they have not turned a profit. There&#39;s 2 outcomes: Rite Aid&#39;s turnaround plan implemented by the new management team is successful and Rite Aid becomes profitable resulting in significant rise in share price or Rite Aid gets acquired. I believe all signs point to Rite Aid eventually getting acquired.</p>\n\n<p>Good value play here.</p>\n</div><!-- SC_ON -->",
  "score": 63,
  "permalink": "/r/stocks/comments/nwruaj/rite_aid_rad_undervalued/",
  "subreddit": "stocks",
  "id": "nwruaj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009743442
}