{
  "author": "whorish_ooze",
  "the_new_excerpt": "The first to come to mind (and a personal favorite of mine as well) is\nPistachio, which I know is quite popular in current-day Iran, and seems like it\nhas quite a history in the region.\n\nAlso, I'm less sure on this, but I believe that Strawberry was used primarily\nmedicinally up until the cross…",
  "original_created_utc": 1620691555,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "真っ先に思い浮かぶのは（私も個人的に好きなのですが）、ピスタチオです。\nピスタチオは、現在のイランでも人気がありますし、この地域ではかなりの歴史があるようです。\nこの地域ではかなりの歴史があるようです。\n\nまた、あまり自信はありませんが、イチゴは十字架にかかるまでは主に薬として使われていたと思います。\nまた、あまり自信はありませんが、イチゴは十字架までは主に薬として使われていたと思います。",
      "title": "アイスクリームの歴史は古く、紀元前500年頃のペルシャ帝国にまで遡ると言われています。チョコレートもバニラも新大陸の植物なので、アイスクリームのフレーバーとして使われるようになるのは、少なくともあと2000年はかかると思われます。それまではどのようなフレーバーが人気だったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先映入眼帘的（也是我个人的最爱）是\n阿月浑子，我知道它在今天的伊朗很受欢迎，而且看起来它在该地区有相当长的历史。\n在该地区有相当长的历史。\n\n另外，我对这一点不太确定，但我相信草莓在十字架之前主要用于\n药用，直到十字架......",
      "title": "冰淇淋早在公元前500年的波斯帝国就已经出现了。巧克力和香草都来自新世界的植物，所以它们作为冰淇淋调味品的使用很可能至少在另外2000年才出现。在那之前，最受欢迎的口味是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先映入眼簾的（也是我個人的最愛）是\n阿月渾子，我知道它在今天的伊朗很受歡迎，而且看起來它在該地區有相當長的歷史。\n在該地區有相當長的歷史。\n\n另外，我對這一點不太確定，但我相信草莓在十字架之前主要用於\n藥用，直到十字架......",
      "title": "冰淇淋早在公元前500年的波斯帝國就已經出現了。巧克力和香草都來自新世界的植物，所以它們作爲冰淇淋調味品的使用很可能至少在另外2000年纔出現。在那之前，最受歡迎的口味是什麼？"
    }
  ],
  "title": "Ice Cream has been around as early as Persian Empire, circa 500 BCE. Both Chocolate and Vanilla come from New World plants, so their use as ice cream flavorings most likely didn't happen for at least another 2000 years. What were the most popular flavors up until that point?",
  "created_utc": 1620714807,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The first to come to mind (and a personal favorite of mine as well) is Pistachio, which I know is quite popular in current-day Iran, and seems like it has quite a history in the region. </p>\n\n<p>Also, I&#39;m less sure on this, but I believe that Strawberry was used primarily medicinally up until the cross-breeding with a New-World variety and didn&#39;t really take off until the 18th century. IF so, that&#39;d mean that the top 3 flavors of ice cream are quite new relative to its entire history. I&#39;m really curious what the OG top flavors were across the centuries!</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/n9jzw1/ice_cream_has_been_around_as_early_as_persian/",
  "subreddit": "AskHistorians",
  "id": "n9jzw1",
  "is_self": true,
  "media": null,
  "is_video": false
}