{
  "author": "dzee_1",
  "original_created_utc": 1628189374,
  "title": "I was wrong about ETH",
  "created_utc": 1628224494,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have been telling anybody that would listen to me once the EIP Hard fork comes live the price of ETH would dip, significantly.</p>\n\n<p>Buy the rumour, sell the news I thought.</p>\n\n<p>I made my first (and last) foray into leveraged trading by shorting ETH with 10x leverage, needless to say I have been liquidated.</p>\n\n<p>I think this proves perfectly you shouldn&#39;t listen to idiots on reddit who claim to be knowledgeable.</p>\n\n<p>Etherium is going to be unstoppable, long term it will flip BTC. But what do i know?</p>\n\n<p>Cheers</p>\n\n<p>Edit - Appreciate the replies, and no I will not be using leverage again. I probably won&#39;t even short again as it&#39;s all so unpredictable.</p>\n\n<p>Edit 2 - I have been at work and didn&#39;t check the markets all day. I never set a stop loss.\nI actually didn&#39;t even know the exact time of the Hard fork.\nChecking the charts I think I would&#39;ve been up for a few hours ironically.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/oyozsp/i_was_wrong_about_eth/",
  "subreddit": "CryptoCurrency",
  "id": "oyozsp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have been telling anybody that would listen to me once the EIP Hard fork comes\nlive the price of ETH would dip, significantly.\n\nBuy the rumour, sell the news I thought.\n\nI made my first (and last) foray into leveraged trading by shorting ETH with 10x\nleverage, needless to say I have been…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は誰にでも言ってきましたが、EIPのハードフォークが来ると\nETHの価格は大幅に下落するだろう。\n\n噂を買って、ニュースを売ればいいと思っていました。\n\n私はETHを10倍のレバレッジでショートすることで、レバレッジ取引に初めて（そして最後に）挑戦しました。\n言うまでもなく、私はずっと...。",
      "title": "ETHについては間違っていました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在告诉任何愿意听我说话的人，一旦EIP硬分叉出现\nETH的价格将大幅下降。\n\n我想，买入谣言，卖出新闻。\n\n我第一次（也是最后一次）涉足杠杆交易，用10倍杠杆做空ETH。\n杠杆，不用说，我已经...",
      "title": "我对ETH的看法是错误的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在告訴任何願意聽我說話的人，一旦EIP硬分叉出現\nETH的價格將大幅下降。\n\n我想，買入謠言，賣出新聞。\n\n我第一次（也是最後一次）涉足槓桿交易，用10倍槓桿做空ETH。\n槓桿，不用說，我已經...",
      "title": "我對ETH的看法是錯誤的"
    }
  ]
}