{
  "author": "baileyga",
  "the_new_excerpt": "So yesterday I looked out of my window and saw a seal outside my window on a\nsmall area of seaweed. It was laid there all day and only moved to get higher up\nwhen the tide was coming in.\n\nIt was there when it got dark but people were active outside so I assumed it was\nokay.\n\nThis morning I've woke…",
  "original_created_utc": 1616740764,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以昨天我从窗口看出去，看到我的窗外有一个封条，在一个。\n小面积的海草。它在那里躺了一整天，只有移动到更高的地方\n当潮水来临的时候。\n\n天黑的时候还在那里，但外面的人很活跃，所以我以为是...\n好吧。\n\n今天早上我醒来...",
      "title": "海豹24小时不在家怎么办？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以昨天我從窗口看出去，看到我的窗外有一個封條，在一個。\n小面積的海草。它在那裏躺了一整天，只有移動到更高的地方\n當潮水來臨的時候。\n\n天黑的時候還在那裏，但外面的人很活躍，所以我以爲是...\n好吧。\n\n今天早上我醒來...",
      "title": "海豹24小時不在家怎麼辦？"
    }
  ],
  "title": "What do I do about a seal being outside my home for 24 hours",
  "created_utc": 1616784741,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So yesterday I looked out of my window and saw a seal outside my window on a small area of seaweed. It was laid there all day and only moved to get higher up when the tide was coming in.</p>\n\n<p>It was there when it got dark but people were active outside so I assumed it was okay. </p>\n\n<p>This morning I&#39;ve woke up and the seal is still there. I can see it&#39;s flippers moving a little but other than that it&#39;s stationary. </p>\n\n<p>Is there anyone in the UK I should contact about this in case it&#39;s distressed or injured.</p>\n\n<p>Update: I have phoned the RSPCA who advised to keep checking on it and if it hasn&#39;t moved in 3 hours or so phone back</p>\n\n<p>Update 2: RSPCA came out to have a look to check if it was okay. As soon as they got into the sea to check on it it swam away. They said its just a pup likely having a rest cos the sea is rough atm. But to call back if it returns cos it has crust round its eyes they want to have a look at</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/mdiiik/what_do_i_do_about_a_seal_being_outside_my_home/",
  "subreddit": "NoStupidQuestions",
  "id": "mdiiik",
  "is_self": true,
  "media": null,
  "is_video": false
}