{
  "author": "TheStonksHub",
  "the_new_excerpt": "The video game industry has taken off since the pandemic and is expected to\nreach a value of ~$290 billion by 2026. How does this compare to the global box\noffice industry? From 2019 to 2020 we saw revenues shift in the following:\n\n2019 -> 2020\n\nGlobal Box Office\n\n~42 billion (all-time-record) ->…",
  "original_created_utc": 1622671522,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "パンデミック以降、ビデオゲーム業界は急成長しており、2026年までには\n2026年には約2,900億ドルに達すると予想されています。これは世界の興行産業と比べてどうでしょうか？\n興行業界と比べてどうでしょうか？2019年から2020年にかけて、以下のような収益の推移が見られました。\n\n2019 -> 2020\n\nグローバルボックスオフィス\n\n～420億円（過去最高）→...",
      "title": "The Weekly DD - Corsair Gaming (CRSR): ライズ・オブ・ザ・ゲーマーズ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自大流行病以来，视频游戏行业已经起飞，预计到2026年将达到2900亿美元。\n到2026年将达到约2900亿美元的价值。这与全球票房产业相比如何？\n戏行业相比如何？从2019年到2020年，我们看到收入在以下方面的转变。\n\n2019 -> 2020\n\n全球票房\n\n~420亿（历史记录）->...",
      "title": "每周DD - 海盗船游戏公司（CRSR）。游戏者的崛起"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自大流行病以來，視頻遊戲行業已經起飛，預計到2026年將達到2900億美元。\n到2026年將達到約2900億美元的價值。這與全球票房產業相比如何？\n戲行業相比如何？從2019年到2020年，我們看到收入在以下方面的轉變。\n\n2019 -> 2020\n\n全球票房\n\n~420億（歷史記錄）->...",
      "title": "每週DD - 海盜船遊戲公司（CRSR）。遊戲者的崛起"
    }
  ],
  "title": "The Weekly DD - Corsair Gaming (CRSR): Rise of The Gamers",
  "created_utc": 1622727508,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The video game industry has taken off since the pandemic and is expected to reach a value of ~<strong>$290 billion by 2026</strong>. How does this compare to the global box office industry? From 2019 to 2020 we saw revenues shift in the following:</p>\n\n<p><strong>2019 -&gt; 2020</strong></p>\n\n<p><em>Global Box Office</em></p>\n\n<p>~42 billion (all-time-record) -&gt; ~11.5 billion</p>\n\n<p><em>Gaming Industry</em></p>\n\n<p>~152 billion -&gt; ~164 billion</p>\n\n<p>That’s right, in 2019 (pre-pandemic) the gaming industry was already over 3.5x the size of the box office entertainment industry and over 14x in 2020*. Gaming’s 2020 growth outperformed the growth of both movies and sports combined.</p>\n\n<p>&#x200B;</p>\n\n<p>There is a shift in the ecosystem from gaming for fun to becoming more of a social event, ie: hanging with friends <em>while</em> playing video games for the hobbyist gamer, and streaming for the professionals. Gaming, once thought to be an activity for the young, has proliferated through all age groups and demographics. In 2020, 64% of all American adults (214.4 million people) played video games.</p>\n\n<p>&#x200B;</p>\n\n<p>Check out evolution of streaming platforms since the Pandemic. Out of the top 3 competitors (Twitch, Youtube, Facebook) Twitch was the clear winner here with users streaming and revenues jumping significantly. This massive expansion of total addressable market (TAM) is most likely a one time occurence, but the gaming industry is still expected to grow at a compound annual growth rate (CAGR) of roughly 11% moving forward.</p>\n\n<p><strong>eSports</strong></p>\n\n<p>Another beneficiary of the gaming industry boom, which is not talked about enough nor well-understood by many, are eSports. Essentially, eSports are gaming competitions that offer cash as prizes and draw YUGE crowds. The eSports industry alone is set to surpass ~1.1 billion in revenues in 2021, a 14% growth from 2020’s ~950 million. To put things in perspective some of the top eSports events compete with the US Open Tennis and US Open Golf tournaments where the winner takes home <em>millions</em> of dollars.</p>\n\n<p><strong>Enters Corsair Gaming (CRSR)</strong></p>\n\n<p>What is Corsair Gaming (CRSR)? They are a designer and manufacturer of high-end gear for all things PC gaming. They offer four different segments of products, almost all of which have 5-star ratings on Amazon.</p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>PC peripherals: keyboards, headsets, mice, mousepads, chais, etc.</li>\n<li>Streaming equipment: green screens, capture cards, microphones.</li>\n<li>PC components: almost anything outside the graphics card that can be found inside the PC tower (the big metal box that the computer is made of).</li>\n<li>Gaming PCs for those that don’t want to self-customize their own.</li>\n</ol>\n\n<p><strong>Corsair - Outlook</strong></p>\n\n<p>With the rise of gaming comes new opportunity for CRSR to expand its sales. In 2021, the PC gaming market was estimated to be $45.5B with ~50% of all gamers using a PC to play video games. This creates a very opportune market for those who can provide value to the PC gamer.</p>\n\n<p>The target market who purchases peripherals are a passionate, well-researched group with access to many other brands. Therefore, only a well-liked (and popular) brand can succeed in this market. Thus, the market advantages large incumbents over smaller up-and-comers. Their brand value is also obvious in the premiums that their brand allows them to charge. Their gaming components and systems products, which they are currently the market leader, demands an average of ~40% premiums compared to their competitors! This means their products cost 40% more, on average, than their competitors and they are still out-selling them.</p>\n\n<p><strong>Final Thoughts</strong></p>\n\n<p>Given the rapid growth of the gaming industry boosted by the COVID-19 pandemic, CRSR is on track to capture a large segment of this growth and expand its business as a result. However, CRSR is not expected to have any massive shifts in its business nor do their growth strategies include any drastic changes to their current strategy. Corsair is a premium brand with solid market penetration. Although they may not experience the same explosive from 2019 to 2020, they are in a great position to remain a market leader in a fast-growing industry.</p>\n\n<p><strong>Positions</strong>: None at this moment in time although I trade in an out of positions on this ticker frequently.</p>\n</div><!-- SC_ON -->",
  "score": 44,
  "permalink": "/r/stocks/comments/nqxp6i/the_weekly_dd_corsair_gaming_crsr_rise_of_the/",
  "subreddit": "stocks",
  "id": "nqxp6i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404886628
}