{
  "author": "Acceptable_Yam4795",
  "original_created_utc": 1625180248,
  "title": "Binance.US Is Stealing People's Money Quietly During Market Moves",
  "created_utc": 1625190221,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m making this post to help US citizens who have their money on <a href=\"https://Binance.US\">Binance.US</a>.</p>\n\n<p>Recently, I made a trade and sold off some crypto to keep some funds in USD for a move down I anticipated happening.  Everything was going according to plan and the next morning I got up to make my trade, only to find more than $1000 was missing from my USD funds.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ikvei79uho871.png?width=1044&amp;format=png&amp;auto=webp&amp;s=cdb7a73aebf9c8f9d99d08c7ee3eb8b3a0d2f495\">The $11 buy was with separate money</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/o9qb57q2io871.png?width=1044&amp;format=png&amp;auto=webp&amp;s=f5dbc5c56de1c1a24a54598b6d3e6167b46d21fb\">This is the amount I woke up to</a></p>\n\n<p>Confused, I tried to reach out to <a href=\"https://Binance.US\">Binance.US</a> to no avail.  I did some research and found out people have been waiting months for tickets to be resolved.  That was unacceptable to me, so I filed formal complaints with the BBB and the SEC, of which both cases are still open at the time of this writing.</p>\n\n<p>Today, <a href=\"https://Binance.US\">Binance.US</a> emailed me back and notified me they removed $1000 from my trade because &quot;their records&quot; show a deposit I made on the 25th of June never went through.  </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/x4y4wdp8jo871.png?width=701&amp;format=png&amp;auto=webp&amp;s=4f94935728d624b64c5456677d638fdcfe13320b\">This is the first indication I got of where the money went</a></p>\n\n<p>Confused, I logged into my bank account to check my account and sure enough, there was a transaction for $1000 on June 25th.</p>\n\n<p><a href=\"https://preview.redd.it/b7r6h0fkjo871.png?width=1028&amp;format=png&amp;auto=webp&amp;s=e3c42ed146079c84c70640419107325757db1a1d\">Bank Statement</a></p>\n\n<p>The most alarming thing about this is that <a href=\"https://Binance.US\">Binance.US</a> gave me ZERO indication that they were doing this, and if I wasn&#39;t the type of person who pays very close attention to his account, that money would have been gone forever with me being none the wiser.  There were no emails, no alerts, nothing on my account, zilch, to indicate what they did.  And to top it all off, it was done in the middle of the night, somewhere between 3-4am PST, as the market was falling.  So when I woke up, the PNL looked as if it was a normal red day.  To top it all off, they took MORE than $1000 when they removed the money from my account.</p>\n\n<p>If you guys are using <a href=\"https://Binance.US\">Binance.US</a>, get your money off of that exchange ASAP and watch your funds like a hawk.  There will likely be a lawsuit that stems from these types of practices, and it shows that <a href=\"https://Binance.US\">Binance.US</a> is being grossly incompetent with people&#39;s money to the point of negligence.  Please do not use them and use this message to protect yourself.</p>\n</div><!-- SC_ON -->",
  "score": 268,
  "permalink": "/r/CryptoCurrency/comments/obxe7y/binanceus_is_stealing_peoples_money_quietly/",
  "subreddit": "CryptoCurrency",
  "id": "obxe7y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm making this post to help US citizens who have their money on Binance.US\n[https://Binance.US].\n\nRecently, I made a trade and sold off some crypto to keep some funds in USD for\na move down I anticipated happening. Everything was going according to plan and\nthe next morning I got up to make my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この投稿は、Binance.USに資金を預けている米国市民を助けるために行っています。\n[https://Binance.US]をご覧ください。\n\n最近、私は取引を行い、予想していた下降に備えて米ドルで資金を確保するためにいくつかの暗号を売却しました。\n予測していた下落に備えて米ドルで資金を確保するために取引を行い、いくつかの暗号を売りました。すべてが計画通りに進んでいました。\n翌朝、私は起きて...",
      "title": "Binance.USは市場の動きの中で静かに人々のお金を盗んでいる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我发这个帖子是为了帮助那些把钱放在Binance.US上的美国公民。\n[https://Binance.US]。\n\n最近，我做了一笔交易，卖掉了一些加密货币，以保留一些美元资金，以应对我预期的下跌。\n我预计会发生下跌。一切都在按计划进行，而且\n第二天早上，我起来做我的...",
      "title": "Binance.US在市场波动中悄悄地窃取人们的钱财"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我發這個帖子是爲了幫助那些把錢放在Binance.US上的美國公民。\n[https://Binance.US]。\n\n最近，我做了一筆交易，賣掉了一些加密貨幣，以保留一些美元資金，以應對我預期的下跌。\n我預計會發生下跌。一切都在按計劃進行，而且\n第二天早上，我起來做我的...",
      "title": "Binance.US在市場波動中悄悄地竊取人們的錢財"
    }
  ]
}