{
  "author": "-ZimaBlue",
  "original_created_utc": 1627064183,
  "title": "I just can’t understand Compatibilism. How does it make sense ?",
  "created_utc": 1627135098,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just can’t wrap my hand around Compatibilism. I have read the definitions and articles and discussions, but I still don’t understand why this should make more sense than hard determinism.</p>\n\n<p>Im not ignorant, im really open minded and want to understand but I just don’t. </p>\n\n<p>If I build a simulation where everything is deterministic and I could restart the simulation and everything would always happed the exact same way I would say, the ppl inside the simulation have no free will, because in a cosmic sense, their actual choices (not just what they want) are the result of everything that has happened before. That makes sense for me. </p>\n\n<p>Compatibilism now says (at least I understand it that way)because you could have done otherwise, you have free will. </p>\n\n<p>Even if there is no external force, every atom of my brain would have been the same therefore I could not have done otherwise. Speaking as a simulation the code would be the same, therefore the result would be the same. </p>\n\n<p>How does Compatibilism makes more sense than hard determinism? I really want to understand</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/oq86l4/i_just_cant_understand_compatibilism_how_does_it/",
  "subreddit": "askphilosophy",
  "id": "oq86l4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I just can’t wrap my hand around Compatibilism. I have read the definitions and\narticles and discussions, but I still don’t understand why this should make more\nsense than hard determinism.\n\nIm not ignorant, im really open minded and want to understand but I just don’t.\n\nIf I build a simulation…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はどうしてもCompatibilismを理解できません。定義や記事、議論を読みましたが\n議論してきましたが、なぜこれが硬直した決定論よりも理にかなっているのかが\n理解できません。\n\n私は無知ではなく、本当に心が広く、理解したいと思っているのですが、どうしても理解できません。\n\nもし私がシミュレーションを作ったら...",
      "title": "Compatibilismがどうしても理解できない。どのように意味があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是无法理解 \"兼容主义\"。我已经读了定义和\n文章和讨论，但我仍然不明白为什么这应该比硬决定论更有意义\n比硬决定论更有意义。\n\n我不是无知，我真的很开明，想去理解，但我就是不明白。\n\n如果我建立一个模拟...",
      "title": "我只是不能理解兼容主义。它怎么会有意义？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是無法理解 \"兼容主義\"。我已經讀了定義和\n文章和討論，但我仍然不明白爲什麼這應該比硬決定論更有意義\n比硬決定論更有意義。\n\n我不是無知，我真的很開明，想去理解，但我就是不明白。\n\n如果我建立一個模擬...",
      "title": "我只是不能理解兼容主義。它怎麼會有意義？"
    }
  ]
}