{
  "author": "Iguana_The_Wise",
  "original_created_utc": 1641222210,
  "title": "We are at least 20 years away from Hyperbitcoinization. The vast majority of people simply don't care about Bitcoin. They don't give a shit.",
  "created_utc": 1641261282,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I spent most of the second half of 2021 trying to orange pill my social circle and I only managed to succeed with my very closest friends.&lt;/p&gt;\n\n&lt;p&gt;I noticed that most people either don&amp;#39;t care or cannot wrap their heads around it. It&amp;#39;s almost like you need to have certain genes or personality type to be a Bitcoiner.&lt;/p&gt;\n\n&lt;p&gt;I even visited El Salvador to see it for myself. Most businesses preferred to be paid in dollars than bitcoin. I talked with taxi drivers, small business owners, etc, and they didn&amp;#39;t understand Bitcoin. They were all afraid of the &amp;quot;volatility&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;I also noticed that some people would get a little interested, ask me a couple of questions here and there, and then said something along the lines of &amp;quot;&lt;em&gt;That sounds really great, I will definitely get into it&lt;/em&gt;&amp;quot; and then go on with their lives without getting into it lol.&lt;/p&gt;\n\n&lt;p&gt;For mass adoption to happen, I believe the dollar needs to actually collapse so that people look for Bitcoin as the exit. Similar to Argentinans and Venezuelans. They understand the value because they have seen their own governments destroy their currencies.&lt;/p&gt;\n\n&lt;p&gt;The US government will try to delay the collapse of the dollar as long as they can with all sorts of shenanigans. I think it will take at least 20 years before people in general lose complete faith in the US dollar.&lt;/p&gt;\n\n&lt;p&gt;In the meantime, Bitcoin will continue to behave as a very strong store of value, with a few small countries adopting it as legal tender.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s how I see it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 445,
  "permalink": "/r/Bitcoin/comments/rv3nji/we_are_at_least_20_years_away_from/",
  "subreddit": "Bitcoin",
  "id": "rv3nji",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I spent most of the second half of 2021 trying to orange pill my social circle\nand I only managed to succeed with my very closest friends.\n\nI noticed that most people either don't care or cannot wrap their heads around\nit. It's almost like you need to have certain genes or personality type to be…"
}