{
  "author": "FortniteRice",
  "original_created_utc": 1625877421,
  "title": "If you are reading this, there is a 50% chance you are missing out on free crypto.",
  "created_utc": 1625887971,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Recently I read a statistic that 50% of all users who earned karma this month do not have their vaults opened. To those who have not yet opened their vaults, please click this reddit link explaining what they are. (<a href=\"https://www.reddit.com/community-points/\">https://www.reddit.com/community-points/</a>) </p>\n\n<p>In my own words, vaults are reddit’s cryptocurrency wallets which store tokens you can earn by participating in this subreddit. In our case, these tokens would be MOONS. Moons are currently at $0.09 each and all it takes is 3 karma to earn one moon this distribution. If you haven’t opened your vault yet, you are literally missing out on FREE MONEY.</p>\n\n<p>And to those who do have their vaults open, congratulations! You are in the top 1% of all people in this subreddit of 3 million subscribers. That’s right, less than 100,000 members in total have opened their vaults and if you’re stacking moons then you’re ahead of the game!</p>\n</div><!-- SC_ON -->",
  "score": 453,
  "permalink": "/r/CryptoCurrency/comments/oh8e1g/if_you_are_reading_this_there_is_a_50_chance_you/",
  "subreddit": "CryptoCurrency",
  "id": "oh8e1g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Recently I read a statistic that 50% of all users who earned karma this month do\nnot have their vaults opened. To those who have not yet opened their vaults,\nplease click this reddit link explaining what they are.\n(https://www.reddit.com/community-points/)\n\nIn my own words, vaults are reddit’s…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近読んだ統計によると、今月カルマを獲得した全ユーザーの50％が\n金庫が開かれていないという統計がありました。まだ金庫を開けていない方へ。\n金庫とは何かを説明したredditのリンクをクリックしてください。\n(https://www.reddit.com/community-points/)\n\n私の言葉を借りれば、保管庫はredditの...",
      "title": "これを読んでいる方は、50％の確率で無料の暗号を見逃していることになります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近我读到一个统计数字，这个月赚取业力的所有用户中，有50%没有打开他们的金库。\n没有打开他们的金库。对于那些还没有打开金库的人。\n请点击这个reddit链接，解释它们是什么。\n(https://www.reddit.com/community-points/)\n\n用我自己的话说，金库是reddit的...",
      "title": "如果你正在读这篇文章，有50%的机会你正在错过免费的加密货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近我讀到一個統計數字，這個月賺取業力的所有用戶中，有50%沒有打開他們的金庫。\n沒有打開他們的金庫。對於那些還沒有打開金庫的人。\n請點擊這個reddit鏈接，解釋它們是什麼。\n(https://www.reddit.com/community-points/)\n\n用我自己的話說，金庫是reddit的...",
      "title": "如果你正在讀這篇文章，有50%的機會你正在錯過免費的加密貨幣。"
    }
  ]
}