{
  "author": "Faze-Cumshot",
  "original_created_utc": 1633258637,
  "title": "Most undervalued coin in the top 25?",
  "created_utc": 1633279219,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We keep hearing about the most undervalued coin in the top 50 MC or top 100 or top 200. But I want to know which one project in the top 25 is capable of flipping Ethereum or even Bitcoin in the future? It must have a solid team, working product, partnerships with well known companies, a detailed road map. At the same time, it&#39;s price action should be undervalued. So which exactly is that one coin, you think deserves that top 3 spot atleast. Please give some facts as to why do you think it deserves the top 3 spot or even flip BTC/ETH in the future.</p>\n</div><!-- SC_ON -->",
  "score": 200,
  "permalink": "/r/CryptoCurrency/comments/q0fkc1/most_undervalued_coin_in_the_top_25/",
  "subreddit": "CryptoCurrency",
  "id": "q0fkc1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We keep hearing about the most undervalued coin in the top 50 MC or top 100 or\ntop 200. But I want to know which one project in the top 25 is capable of\nflipping Ethereum or even Bitcoin in the future? It must have a solid team,\nworking product, partnerships with well known companies, a detailed…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "トップ50のMCやトップ100、トップ200の中で最も割安なコインがあるという話はよく聞きます。\n200の中で最も割安なコインがあると聞きます。しかし、私が知りたいのは、トップ25の中で、Ethereuを反転させることができるプロジェクトはどれかということです。\nイーサリアム、あるいはビットコインを将来的に反転させることができるプロジェクトはどこにあるのでしょうか？それは、しっかりとしたチームを持っていること。\nそのプロジェクトは、しっかりとしたチーム、実用的な製品、有名な企業とのパートナーシップ、詳細な...",
      "title": "トップ25の中で最も割安なコイン？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们不断听到关于前50名MC或前100名或前200名中最被低估的钱币。\n前200名。但我想知道，前25名中的哪一个项目能够\n在未来翻转以太坊甚至比特币？它必须有一个坚实的团队。\n工作的产品，与知名公司的伙伴关系，详细的...",
      "title": "前25名中最被低估的钱币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們不斷聽到關於前50名MC或前100名或前200名中最被低估的錢幣。\n前200名。但我想知道，前25名中的哪一個項目能夠\n在未來翻轉以太坊甚至比特幣？它必須有一個堅實的團隊。\n工作的產品，與知名公司的夥伴關係，詳細的...",
      "title": "前25名中最被低估的錢幣？"
    }
  ]
}