{
  "author": "Okmanl",
  "the_new_excerpt": "Found an interesting video which shows that Starbucks has the #1 restaurant app,\nbeating out Dominos Pizza. They have a compelling rewards program and 50% of\ntheir customers consistently use it. The restaurant app has 1.5 billion dollars\nin cash reserves at any given time.\n\nThey’ve convinced…",
  "original_created_utc": 1612199183,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "发现了一个有趣的视频，它显示星巴克有第一的餐厅应用。\n胜过多米诺比萨。他们有一个引人注目的奖励计划和50%的\n他们的客户持续使用它。餐厅应用有1．\n在任何时间的现金储备。\n\n他们已经相信...",
      "title": "星巴克的好处是可以作为一家不受监管的银行来经营？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "發現了一個有趣的視頻，它顯示星巴克有第一的餐廳應用。\n勝過多米諾比薩。他們有一個引人注目的獎勵計劃和50%的\n他們的客戶持續使用它。餐廳應用有1．\n在任何時間的現金儲備。\n\n他們已經相信...",
      "title": "星巴克的好處是可以作爲一家不受監管的銀行來經營？"
    }
  ],
  "title": "Starbucks has the benefit of being able to operate as an unregulated bank?",
  "created_utc": 1612228108,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Found an interesting video which shows that Starbucks has the #1 restaurant app, beating out Dominos Pizza. They have a compelling rewards program and 50% of their customers  consistently use it. The restaurant app has 1.5 billion dollars in cash reserves at any given time. </p>\n\n<p>They’ve convinced customers to loan them 1.5 billion dollars worth of cash. Interest free. And the icing on the cake is that 10% of that money ends up being completely forgotten and unused. </p>\n\n<p>They have more money than 85% of banks in the US with the added benefit of not having to be regulated as a bank. They don’t have to pay out interest, or keep extra cash reserves. </p>\n\n<p>A significant portion of that money can be reinvested into the market. Or be used to open up new stores. </p>\n\n<p>What are your thoughts? Is Starbucks secretly an undervalued company? Or do you think this fact is priced in already?</p>\n</div><!-- SC_ON -->",
  "score": 80,
  "permalink": "/r/stocks/comments/la84pk/starbucks_has_the_benefit_of_being_able_to/",
  "subreddit": "stocks",
  "id": "la84pk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518539384
}