{
  "author": "SerHiroProtaganist",
  "original_created_utc": 1630254355,
  "title": "Eth Gas Fees Suck",
  "created_utc": 1630272784,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just venting. </p>\n\n<p>Want to accept an offer for a nft on opensea, and it costs 140 dollar gas fee. I&#39;ve only got 60 dollars worth in my wallet. </p>\n\n<p>So I try to swap a couple hundred dollars worth of a token I have on uniswap and the gas fee is more than the 60 dollars eth I&#39;ve got in the wallet.</p>\n\n<p>So in order to accept my nft offer I&#39;m gonna have to pay over 200 dollars for the privilege, which I don&#39;t have in eth and am unable to obtain via my tokens. Ridiculous. All the excuses people give for it is bullshit, dealing with eth will be a rich man&#39;s game if it stays like this. </p>\n\n<p>I&#39;m effectively done trying to do anything actually useful on the eth blockchain. Will be trying out Solana, Algo, Tezos maybe Cardano when smart contracts are out. Anything would be better than eth at this point. </p>\n\n<p>And yeah yeah layer 2 solutions blah blah blah, sorry but naa, if I have to jump through hoops just to do anything, it&#39;s no good. Maybe I&#39;ll come back in 10 years when it&#39;s maybe usable and &quot;eth2.0&quot; is close to being done.</p>\n</div><!-- SC_ON -->",
  "score": 188,
  "permalink": "/r/CryptoCurrency/comments/pdyena/eth_gas_fees_suck/",
  "subreddit": "CryptoCurrency",
  "id": "pdyena",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Just venting.\n\nWant to accept an offer for a nft on opensea, and it costs 140 dollar gas fee.\nI've only got 60 dollars worth in my wallet.\n\nSo I try to swap a couple hundred dollars worth of a token I have on uniswap and\nthe gas fee is more than the 60 dollars eth I've got in the wallet.\n\nSo in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちょっとしたガス抜きです。\n\nopenseaでNFTのオファーを受けたいのですが、ガソリン代が140ドルもかかります。\n私の財布には60ドル分しかありません。\n\nそこで、数百ドル分のトークンをuniswapで交換しようとすると\nガソリン代は財布に入っている60ドル分の倫理よりも高いのです。\n\nそこで...",
      "title": "イーサーズガス料金の悪口"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "只是发泄一下。\n\n想接受opensea上的一个nft报价，但需要140美元的汽油费。\n我的钱包里只有60美元。\n\n所以我试着用我在uniswap上的几百美元的代币来交换，结果汽油费比我的60美元还多。\n汽油费比我钱包里的60美元还多。\n\n所以在...",
      "title": "燃气费很糟糕"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "只是發泄一下。\n\n想接受opensea上的一個nft報價，但需要140美元的汽油費。\n我的錢包裏只有60美元。\n\n所以我試着用我在uniswap上的幾百美元的代幣來交換，結果汽油費比我的60美元還多。\n汽油費比我錢包裏的60美元還多。\n\n所以在...",
      "title": "燃氣費很糟糕"
    }
  ]
}