{
  "author": "Nossa30",
  "the_new_excerpt": "I'm 27 years old. Savings account at local bank pays 0.0001% interest rate(or\nsome shit).\n\nWhy am I keeping thousands of dollars JUST SITTING? I just pulled a Michael\nSaylor and converted the entire thing to bitcoin. Somehow I feel a little bit of\nrelief knowing that my money is 100% safe from…",
  "original_created_utc": 1608823756,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我今年27岁。在当地银行的储蓄账户支付0.0001%的利率(或\n一些狗屎)。\n\n为什么我要留着几千美元呢？我刚拉了一辆迈克尔牌的车\n然后把整个东西转换成比特币。不知何故我觉得有点\n得知我的钱百分百安全不受…影响，我松了一口气",
      "title": "他妈的，比特币现在是我的储蓄账户了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今年27歲。在當地銀行的儲蓄賬戶支付0.0001%的利率(或\n一些狗屎)。\n\n爲什麼我要留着幾千美元呢？我剛拉了一輛邁克爾牌的車\n然後把整個東西轉換成比特幣。不知何故我覺得有點\n得知我的錢百分百安全不受…影響，我鬆了一口氣",
      "title": "他媽的，比特幣現在是我的儲蓄賬戶了"
    }
  ],
  "title": "Fuck it, Bitcoin is my savings account now",
  "created_utc": 1608832535,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m 27 years old. Savings account at local bank pays 0.0001% interest rate(or some shit). </p>\n\n<p>Why am I keeping thousands of dollars JUST SITTING? I just pulled a Michael Saylor and converted the entire thing to bitcoin. Somehow I feel a little bit of relief knowing that my money is 100% safe from identity theft or my physical wallet being stolen.</p>\n\n<p>Just sold my 401K of $4,000 into BTC. Over an entire 1 year period, that 401K only grew $1000. Bitcoin more than doubled that. </p>\n\n<p>I don&#39;t even care that some older folks I know thought it was stupid. I am young enough that even if this all goes to zero, I can still pay my bills, and have plenty of time to catch up to build retirement fund. </p>\n\n<p>Fuck it. I&#39;m all in.</p>\n\n<p>Literally.</p>\n</div><!-- SC_ON -->",
  "score": 3889,
  "permalink": "/r/Bitcoin/comments/kjh84f/fuck_it_bitcoin_is_my_savings_account_now/",
  "subreddit": "Bitcoin",
  "id": "kjh84f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495326849
}