{
  "author": "29ofakind",
  "original_created_utc": 1644608630,
  "title": "Is Russia bluffing about the potential invasion?",
  "created_utc": 1644619471,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Obviously nobody here knows and I personally know very little about the subject but would there be any reasons for them to bluff on this? &lt;/p&gt;\n\n&lt;p&gt;It just seems weird that the whole world has been watching their every move for months and they know everyone has been watching. In the age of satellites and other technology we can see exactly where they have troops stationed and approximately how many along with other important info. Are they not worried that everyone can see how they are set up? Don&amp;#39;t other countries have plenty of time to plan if they do invade? Or is what they are doing right now withe the build up the only realistic way to do it? Would Russia stand to benefit something by bluffing about this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/sq7s22/is_russia_bluffing_about_the_potential_invasion/",
  "subreddit": "TooAfraidToAsk",
  "id": "sq7s22",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Obviously nobody here knows and I personally know very little about the subject\nbut would there be any reasons for them to bluff on this?\n\nIt just seems weird that the whole world has been watching their every move for\nmonths and they know everyone has been watching. In the age of satellites…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もちろん、ここにいる誰も知らないし、私個人もこのテーマについてほとんど知らない。\nしかし、この件に関してハッタリをかます理由はあるのだろうか？\n\n世界中が彼らの一挙手一投足に注目しているのは奇妙な気がします。\n何ヶ月も前から、みんなが見ていることを知っている。人工衛星の時代に...",
      "title": "ロシアは侵略の可能性に対してハッタリをかますのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "显然，这里没有人知道，我个人也对这个问题知之甚少。\n但他们是否有任何理由在这个问题上虚张声势？\n\n这似乎很奇怪，全世界都在关注他们的一举一动，已经有几个月了。\n几个月来，他们知道每个人都在看。在卫星的时代...",
      "title": "俄罗斯是否在为潜在的入侵而虚张声势？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "顯然，這裏沒有人知道，我個人也對這個問題知之甚少。\n但他們是否有任何理由在這個問題上虛張聲勢？\n\n這似乎很奇怪，全世界都在關注他們的一舉一動，已經有幾個月了。\n幾個月來，他們知道每個人都在看。在衛星的時代...",
      "title": "俄羅斯是否在爲潛在的入侵而虛張聲勢？"
    }
  ]
}