{
  "author": "AnomanderRake42",
  "original_created_utc": 1652553017,
  "title": "PSA: Crypto is full of software engineers (with less than five years of experience) and VC investors (with more money than brains) pretending to be economists, and we are their guinea pigs. Our investments are their public beta tests.",
  "created_utc": 1652580614,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The title says it all. Crypto is dominated by software engineers who think they are more knowledgeable than they actually are, especially when it comes to fields like economics and finance that are FAAAAR out of their wheelhouse.&lt;/p&gt;\n\n&lt;p&gt;Terra&amp;#39;s failure was a failure of economics more than it was a failure of engineering. Even the best software engineers are only as good as their inputs, and they had shitty inputs. They thought they understood supply and demand. They didn&amp;#39;t. They thought they were coming up with something new. They didn&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;The whole Terra/Luna &amp;quot;mint and burn&amp;quot; mechanism is also known by another name in TradFi: the &lt;a href=\"https://www.investopedia.com/terms/d/deathspiral.asp\"&gt;Death Spiral Bond&lt;/a&gt;. It is such a bad idea that it is only employed by the most desperate of companies because of how easily it can get out of hand. For an industry where innovation and meritocracy are supposedly valued, you&amp;#39;d think someone with even a sliver of influence would have recognized it for what it was and raised warning bells. But describe Terra&amp;#39;s mechanism to a single TradFi financial advisor or analyst, and they will politely decline your business and laugh at you when you walk out the door.&lt;/p&gt;\n\n&lt;p&gt;But if you think Terra is the only major crypto project that is deluding itself with overly optimistic assumptions about how economics works, you&amp;#39;ve got another thing coming.&lt;/p&gt;\n\n&lt;p&gt;That should give you an idea of just how &lt;strong&gt;incredibly&lt;/strong&gt; immature this industry really is, how little actual expertise is working on these things, and how much all of it is still in the experimental stage, even so-called &amp;quot;blue chips&amp;quot; like Bitcoin and Ethereum.&lt;/p&gt;\n\n&lt;p&gt;Even Satoshi was a terrible economist. He thought Bitcoin would make for a good digital cash, and it ended up turning into something no one wants to spend (&amp;quot;HODL!&amp;quot;) because everyone&amp;#39;s too afraid it&amp;#39;ll moon the next day. That makes it an objectively bad currency. And Bitcoiners are not alone in this. If you&amp;#39;ve ever praised &amp;quot;deflationary tokenomics,&amp;quot; you&amp;#39;re guilty of it, too.&lt;/p&gt;\n\n&lt;p&gt;Compounding ALL of that is the fact that the crypto industry &lt;strong&gt;as a whole&lt;/strong&gt; is less than 15 years old. Ethereum is barely seven years old. And DeFi is less than two years old. Even the guys who invented Solidity don&amp;#39;t have a decade&amp;#39;s worth of experience in the language.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not being anti-crypto, I&amp;#39;m just being realistic. I&amp;#39;m still invested (~10% of my liquid net worth) and still DCAing. But fuuuuck, I can&amp;#39;t wait until this community gets its head out of its own ass about how &amp;quot;innovative&amp;quot; crypto is and how it will eat the TradFi industry, and just focus on building good and functional products instead of turning into moral philosophers about economics and politics.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 413,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/n_t58JjBdsBeItiZjIgq7lQbKBPO2D2EmPQCMvkhKvs.jpg?auto=webp&amp;s=a138c5c9fc5dd2337a3bbdf146670cda2d397691",
          "width": 205,
          "height": 136
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/n_t58JjBdsBeItiZjIgq7lQbKBPO2D2EmPQCMvkhKvs.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=3a69c5d85bfccfa4a2eb951d23a941f08255234e",
            "width": 108,
            "height": 71
          }
        ],
        "variants": {},
        "id": "ZAxlKr6mU8VSUMjDi9u08vxnkyGMK_eS7qGrDUrzlyk"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/upnbl9/psa_crypto_is_full_of_software_engineers_with/",
  "subreddit": "CryptoCurrency",
  "id": "upnbl9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The title says it all. Crypto is dominated by software engineers who think they\nare more knowledgeable than they actually are, especially when it comes to\nfields like economics and finance that are FAAAAR out of their wheelhouse.\n\nTerra's failure was a failure of economics more than it was a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルがすべてを物語っています。暗号は、実際よりも知識があると思っているソフトウェアエンジニアによって支配されています。\n特にエコのような分野に関しては、実際よりも知識があると思い込んでいるソフトウェア技術者が多い。\n特に経済や金融のような分野では、彼らの専門外である。\n\nTerraの失敗は経済学の失敗であり、それ以上に...",
      "title": "PSA: 暗号は、経済学者のふりをしたソフトウェアエンジニア（経験5年未満）とVC投資家（頭脳より金がある）だらけで、私たちは彼らのモルモットです。私たちの投資は、彼らのパブリックベータテストです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个标题说明了一切。密码学是由软件工程师主导的，他们认为自己比实际的知识更丰富。\n他们认为自己比实际情况更有知识，尤其是当涉及到\n像经济和金融这样的领域，是他们所不擅长的。\n\nTerra的失败是经济学的失败，而不是它的失败。",
      "title": "PSA：加密货币充满了软件工程师（不到五年的经验）和VC投资者（钱比脑子多），假装是经济学家，而我们是他们的小白鼠。我们的投资是他们的公开测试。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個標題說明了一切。密碼學是由軟件工程師主導的，他們認爲自己比實際的知識更豐富。\n他們認爲自己比實際情況更有知識，尤其是當涉及到\n像經濟和金融這樣的領域，是他們所不擅長的。\n\nTerra的失敗是經濟學的失敗，而不是它的失敗。",
      "title": "PSA：加密貨幣充滿了軟件工程師（不到五年的經驗）和VC投資者（錢比腦子多），假裝是經濟學家，而我們是他們的小白鼠。我們的投資是他們的公開測試。"
    }
  ]
}