{
  "author": "naughty_yorick",
  "original_created_utc": 1638528551,
  "title": "How strong was \"strong discipline\" towards children in a noble medieval household (1300s)?",
  "created_utc": 1638552816,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been researching child-rearing in the noble medieval English home (around the 1300s). By today&amp;#39;s standards, the level of physical discipline against children was very high - but what counted as &amp;quot;strong&amp;quot; or &amp;quot;severe&amp;quot; for the time? Was there a level of punishment which would be alarming to other people or a cause for concern - for example if a parent beating a child left long-term marks or permanent scarring, would be that considered &amp;quot;too much&amp;quot;?&lt;/p&gt;\n\n&lt;p&gt;Related, would it be unusual for physical punishments to continue into teenagerhood/adulthood? Would a lord beat  a squire, for example, or an older child (if they remained in the parental household?)&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve read varying sources that claim either it wasn&amp;#39;t as bad as popular history makes out, or that it really &lt;em&gt;was&lt;/em&gt; that bad, and children were beaten by parents and teachers rather mercilessly. Which is correct?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/r7whzd/how_strong_was_strong_discipline_towards_children/",
  "subreddit": "AskHistorians",
  "id": "r7whzd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been researching child-rearing in the noble medieval English home (around\nthe 1300s). By today's standards, the level of physical discipline against\nchildren was very high - but what counted as \"strong\" or \"severe\" for the time?\nWas there a level of punishment which would be alarming to other…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、中世イギリスの貴族階級の家庭における育児について研究しています。\n1300年代）。現代の基準からすると、身体的躾のレベルは\nしかし、当時は何をもって「強い」「厳しい」としたのでしょうか。\n他の人が心配するようなレベルの罰はあったのでしょうか？",
      "title": "中世の貴族の家庭（1300年代）では、子どもに対する「強いしつけ」はどれくらい強かったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在研究中世纪英国贵族家庭的育儿问题（大约在13世纪）。\n1300年代）。按照今天的标准，对孩子的体罚程度为\n但在当时怎样才算 \"强烈 \"或 \"严厉\"？\n是否有一种程度的惩罚会让其他人感到震惊？",
      "title": "在一个中世纪的贵族家庭（1300年代）中，对儿童的 \"强烈管教 \"有多强？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在研究中世紀英國貴族家庭的育兒問題（大約在13世紀）。\n1300年代）。按照今天的標準，對孩子的體罰程度爲\n但在當時怎樣纔算 \"強烈 \"或 \"嚴厲\"？\n是否有一種程度的懲罰會讓其他人感到震驚？",
      "title": "在一箇中世紀的貴族家庭（1300年代）中，對兒童的 \"強烈管教 \"有多強？"
    }
  ]
}