{
  "author": "OffrButtBaby",
  "original_created_utc": 1647527668,
  "title": "I’m white and will be checking into a women’s rehab mostly for Navajo patients. Anything I need to know culturally so I don’t say or do anything stupid?",
  "created_utc": 1647554676,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have an alcohol problem, and this place is the first one to accept me after trying for the last six months. &lt;/p&gt;\n\n&lt;p&gt;They accept patients of all ethnic and racial backgrounds, but most of the other women are Native American (I’m assuming Navajo based on where I live) as the rehab was created to assist the native population. &lt;/p&gt;\n\n&lt;p&gt;This is the first time in my life I’ll likely be the only white person, and I’m scared I won’t fit in with the other women and (I know this sounds immature, but it’s honest) that they won’t want to be friends with me. &lt;/p&gt;\n\n&lt;p&gt;Part of the treatment program is participating in traditional healing like sweat lodges, smudging, songs and drumming, Red Road teachings, gathering of Native Americans, etc., which I’m excited for, but I feel like they may feel like I’m intruding on something sacred. &lt;/p&gt;\n\n&lt;p&gt;Can I just be myself, or are there specific cultural norms within the Navajo community I need to observe so as not to be offensive? Am I allowed to ask questions, or is that rude?&lt;/p&gt;\n\n&lt;p&gt;Is there anything I need to know before going? &lt;/p&gt;\n\n&lt;p&gt;Thank you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/tgbmk8/im_white_and_will_be_checking_into_a_womens_rehab/",
  "subreddit": "TooAfraidToAsk",
  "id": "tgbmk8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have an alcohol problem, and this place is the first one to accept me after\ntrying for the last six months.\n\nThey accept patients of all ethnic and racial backgrounds, but most of the other\nwomen are Native American (I’m assuming Navajo based on where I live) as the\nrehab was created to assist…"
}