{
  "author": "Machiavelli127",
  "the_new_excerpt": "Like many of you, my stock portfolio is overweight on high growth stocks,\nespecially in tech. And like many of you, I've watched my portfolio bleed day\nafter day.\n\nA few weeks ago I was talking to my dad and he was saying how his portfolio has\nbeen killing it. Well, his portfolio has oil stocks,…",
  "original_created_utc": 1618986096,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの皆さんと同様、私の株式ポートフォリオは高成長株に偏っています。\n特に技術系です。そして、多くの皆さんと同じように、私も自分のポートフォリオが日々出血するのを見てきました。\nしてきました。\n\n数週間前、父と話をしていると、父は自分のポートフォリオが大成功していると言っていました。\nしていると言っていました。彼のポートフォリオには、石油株や...",
      "title": "この2、3ヶ月は分散投資の勉強になりました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "像你们中的许多人一样，我的股票投资组合中的高增长股票比重过大。\n特别是在科技领域。和你们中的许多人一样，我看着我的投资组合日复一日地失血。\n日复一日。\n\n几周前，我和我父亲聊天，他说他的投资组合如何\n一直在杀戮。嗯，他的投资组合有石油股，...",
      "title": "在过去的几个月里，是关于多样化的一课"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "像你們中的許多人一樣，我的股票投資組合中的高增長股票比重過大。\n特別是在科技領域。和你們中的許多人一樣，我看着我的投資組合日復一日地失血。\n日復一日。\n\n幾周前，我和我父親聊天，他說他的投資組合如何\n一直在殺戮。嗯，他的投資組合有石油股，...",
      "title": "在過去的幾個月裏，是關於多樣化的一課"
    }
  ],
  "title": "These last couple months have been a lesson on diversification",
  "created_utc": 1619033617,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like many of you, my stock portfolio is overweight on high growth stocks, especially in tech. And like many of you, I&#39;ve watched my portfolio bleed day after day. </p>\n\n<p>A few weeks ago I was talking to my dad and he was saying how his portfolio has been killing it. Well, his portfolio has oil stocks, Industrials, and other &quot;boring&quot; stocks. Much more old school than my portfolio. He had shifted his portfolio to be more focused on the traditional  high performers during economic booms. I didn&#39;t have the foresight to do that. </p>\n\n<p>I looked at the YTD performance of all the S&amp;P500 components and realized my portfolio has hardly any of the top performers. While my portfolio definitely has a higher weight in growth stocks, I still had a car manufacturer, a retail stock, an airline, some sector ETFs and some other reopening plays. I felt I was decently diversified. But the huge blind spot in my portfolio happened to be with the highest performers YTD.</p>\n\n<p>Can&#39;t make myself buy oil stocks, but I ended up putting some money into an industrial ETF (I don&#39;t know enough about the industry to feel confident in any single stocks) and a Financials ETF. I also averaged down my cost basis in several of my tech stocks I&#39;m confident will come back strong. This has all helped counterbalance my portfolio and the bleeding has been mitigated since shifting my portfolio.</p>\n\n<p>Gotta be agile! Been a good lesson in (real) diversification. Hope you guys are learning and evolving as well.</p>\n</div><!-- SC_ON -->",
  "score": 50,
  "permalink": "/r/stocks/comments/mv9orp/these_last_couple_months_have_been_a_lesson_on/",
  "subreddit": "stocks",
  "id": "mv9orp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171527443
}