{
  "author": "read-all-aboutit",
  "original_created_utc": 1634994786,
  "title": "I don’t feel sexually assaulted but I am consistently touched in my sleep by my S/O who is also sleeping. What can I do to make it stop?",
  "created_utc": 1635006340,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>By constantly touched I don’t mean cuddling or holding me. I mean the other night I woke up to being fingered but my bf was literally asleep. This didn’t always happen but is happening very frequently now. It makes it so hard for me to actually get a good nights sleep. Does this happen to anyone else? What’s causing it and what do you do about it? We’ve talked about it and he always feels really bad but truly has no idea he’s doing it until after I wake him up and make him stop.</p>\n</div><!-- SC_ON -->",
  "score": 127,
  "permalink": "/r/TooAfraidToAsk/comments/qe4p92/i_dont_feel_sexually_assaulted_but_i_am/",
  "subreddit": "TooAfraidToAsk",
  "id": "qe4p92",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "By constantly touched I don’t mean cuddling or holding me. I mean the other\nnight I woke up to being fingered but my bf was literally asleep. This didn’t\nalways happen but is happening very frequently now. It makes it so hard for me\nto actually get a good nights sleep. Does this happen to anyone…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "常に触れられているというのは、抱っこやおんぶのことではありません。つまり、先日\n私は指で触られているところで目が覚めたのですが、彼は文字通り眠っていました。これはいつもではなく\nいつもではなく、今はとても頻繁に起こっています。これでは、私にとって\n安眠できません。これは誰にでも起こることなのでしょうか...。",
      "title": "私は性的暴行を受けたとは感じていませんが、寝ている間にもS/Oに一貫して触られています。どうしたらやめてくれるでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我所说的不断抚摸并不是指拥抱或抱着我。我的意思是有一天\n我的意思是，有一天晚上，我醒来时被人用手摸了一下，但我的男朋友却真的睡着了。这并不是\n但现在发生得非常频繁。这让我很难\n我很难真正得到一个好的睡眠。这种情况是否发生在任何人身上...",
      "title": "我不觉得自己受到了性侵犯，但我在睡梦中一直被同样在睡觉的我的S/O触摸。我怎么做才能让它停止呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我所說的不斷撫摸並不是指擁抱或抱着我。我的意思是有一天\n我的意思是，有一天晚上，我醒來時被人用手摸了一下，但我的男朋友卻真的睡着了。這並不是\n但現在發生得非常頻繁。這讓我很難\n我很難真正得到一個好的睡眠。這種情況是否發生在任何人身上...",
      "title": "我不覺得自己受到了性侵犯，但我在睡夢中一直被同樣在睡覺的我的S/O觸摸。我怎麼做才能讓它停止呢？"
    }
  ]
}