{
  "author": "Queeragenda",
  "the_new_excerpt": "(I feel like I have to say it, I am a female lmfao) It seems like it would be so\nawkward. A girl is giving a guy a lap dance, he's into it and gets erect but the\ngirl is literally just doing her job and doesn't want to have sex with the man.\nDoes he just walk out of the club rock hard? Does he…",
  "original_created_utc": 1619199829,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "女性の私が言うのもなんですが、とても気まずい感じがします。\n気まずいですよね。女の子が男の人にラップダンスをしてあげて、男の人はそれに夢中になって勃起しますが、女の子は文字通り仕事をしているだけで\n女の子は文字通り自分の仕事をしているだけで、その男性とセックスしたいとは思っていません。\n彼は硬くなったままクラブを出て行くの？彼は...",
      "title": "ラップダンスをした後はどうすればいいの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得我必须说出来，我是一个女性，lmfao）这看起来会很\n尴尬。一个女孩给一个男人跳大腿舞，他很喜欢并勃起了，但女孩只是在做她的工作，并不想和男人做爱。\n但女孩实际上只是在做她的工作，并不想和这个男人发生关系。\n他就这样硬着头皮走出了俱乐部吗？他是否...",
      "title": "跳完大腿舞后，你应该做什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得我必須說出來，我是一個女性，lmfao）這看起來會很\n尷尬。一個女孩給一個男人跳大腿舞，他很喜歡並勃起了，但女孩只是在做她的工作，並不想和男人做愛。\n但女孩實際上只是在做她的工作，並不想和這個男人發生關係。\n他就這樣硬着頭皮走出了俱樂部嗎？他是否...",
      "title": "跳完大腿舞后，你應該做什麼？"
    }
  ],
  "title": "What are you supposed to do after getting a lap dance?",
  "created_utc": 1619231657,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>(I feel like I have to say it, I am a female lmfao) \nIt seems like it would be so awkward. A girl is giving a guy a lap dance, he&#39;s into it and gets erect but the girl is literally just doing her job and doesn&#39;t want to have sex with the man. Does he just walk out of the club rock hard? Does he masurbate in the bathroom? How does the lap dance just end? WHAT DO YOU DO????</p>\n\n<p>Source: never been to a strip club or got a lap dance.</p>\n</div><!-- SC_ON -->",
  "score": 113,
  "permalink": "/r/TooAfraidToAsk/comments/mx0t3w/what_are_you_supposed_to_do_after_getting_a_lap/",
  "subreddit": "TooAfraidToAsk",
  "id": "mx0t3w",
  "is_self": true,
  "media": null,
  "is_video": false
}