{
  "author": "The_Texidian",
  "the_new_excerpt": "First off. Lmao. Cant tell you how many times I’ve been called a “boomer” for\navoiding TSLA and NIO. For the people that are still holding on, good on\nyou.....but the people panicked and selling at a loss, yikes.\n\nIt’s times like this where we learn the most about ourselves.\n\n * Ask yourself what…",
  "original_created_utc": 1614801786,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先。Lmao. 不知道有多少次，我被称为 \"潮人\"，因为\n避免TSLA和NIO。对于还在坚持的人来说，很好的。\nyou.....，但人们却慌了手脚，亏本出售，呀。\n\n在这种时候，我们最了解自己。\n\n * 问问自己...",
      "title": "给所有正在抛售和恐慌的TSLA和NIO以及广大投资者一个信息。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先。Lmao. 不知道有多少次，我被稱爲 \"潮人\"，因爲\n避免TSLA和NIO。對於還在堅持的人來說，很好的。\nyou.....，但人們卻慌了手腳，虧本出售，呀。\n\n在這種時候，我們最瞭解自己。\n\n * 問問自己...",
      "title": "給所有正在拋售和恐慌的TSLA和NIO以及廣大投資者一個信息。"
    }
  ],
  "title": "A message to all the TSLA and NIO and general investors that are selling out and panicking.",
  "created_utc": 1614819444,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First off. Lmao. Cant tell you how many times I’ve been called a “boomer” for avoiding TSLA and NIO. For the people that are still holding on, good on you.....but the people panicked and selling at a loss, yikes. </p>\n\n<p>It’s times like this where we learn the most about ourselves. </p>\n\n<ul>\n<li><p>Ask yourself what you’ve learned about your risk tolerance. </p></li>\n<li><p>Ask yourself what lessons you’ve learned about the reason why you are investing and buying companies. </p></li>\n</ul>\n\n<p>When the market goes down or one of my holdings tank. I am often reminded of Peter Lynch. He says that when you buy a company because the returns are good, when the stock goes down people don’t know what to do and sell. I feel like this is a lot of y’all. Y’all bought TSLA and NIO in hopes of 7xing your money...but now that TSLA is down 25% from its ATH, and NIO is down 33%; y’all don’t know what to do, so you panic and then sell. </p>\n\n<p>About a month ago, I found this article by Financial Samurai </p>\n\n<p><a href=\"https://www.financialsamurai.com/risk-tolerance-is-difficult-to-measure/\">https://www.financialsamurai.com/risk-tolerance-is-difficult-to-measure/</a></p>\n\n<p>I think he shares an important lesson/warning about investing. Your perceived risk tolerance is an illusion. The truth is, most of y’all (including myself) have never experienced major crashes. I know a good chunk of y’all probably started in 2020 and only experienced 2020 style returns, let me tell you that isn’t normal. </p>\n\n<p>It’s easy to say “buy and hold forever!!!” And I assume most, if not all of you say that because it’s common advice and common sense, however we all have a plan until SHTF as the saying goes. </p>\n\n<p>It’s important to keep a level head when it comes to investing. Buffett always preaches that investing doesn’t take smarts, it takes guts. You can put all your money into VOO and have good returns, but if you can’t stomach crashes/corrections and sell, then you won’t make money. </p>\n\n<p>Personal way of dealing with this: </p>\n\n<p>When it comes to volatility, I’ve experienced some large 20% plus drops in prices and have held on. It’s hard but I’ve held on and bought more during those dips because I believe in what I’m buying and know why I am buying it. I’ve done my DD over the companies I’m in and that gives me the confidence I need to keep going. What helps me, is not looking. I’ll delete the app or turn off my computer and make myself busy. This helped me the most last spring, I used to watch it like a hawk when things would dip and I’d start to panic and think about selling. When I turn it off, that impulse goes away some. What also helped me was, before I buy anything I write down on a Word Doc, why I’m buying it; and before I sell, I write down and explain what factors changed that makes me need to sell the stock, if nothing changed, I know I’m being irrational and I need to buy the dip. </p>\n\n<p>So these are just my observations. Not professional financial advice but the tips are what I personally do.</p>\n</div><!-- SC_ON -->",
  "score": 259,
  "permalink": "/r/stocks/comments/lx2z3h/a_message_to_all_the_tsla_and_nio_and_general/",
  "subreddit": "stocks",
  "id": "lx2z3h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937744970
}