{
  "author": "XRedVelvett",
  "the_new_excerpt": "Interview with Mindmed CEO\n[https://finance.yahoo.com/video/mindmed-ceo-going-public-allocate-184100037.html]\n\nSome takeaway from the interview:\n\n“So big debut on the NASDAQ today, but I'm looking at the stock and it's down\n26%. So take us through what's going in your mind right now?”\n\nJR RAHN:…",
  "original_created_utc": 1619621367,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "マインドメッド社CEOインタビュー\n[https://finance.yahoo.com/video/mindmed-ceo-going-public-allocate-184100037.html]\n\nインタビューから得られたいくつかの収穫。\n\n\"今日、NASDAQで大きなデビューを果たしましたが、株を見てみると26％も下がっています。\n26%. 今、何を考えているのか教えてください」。\n\nJR RAHN:...",
      "title": "MindMed（$MNMD）のCEOが株式公開について。\"しかし、結局のところ、人が市場を作るのだ\""
    },
    {
      "locale": "zh",
      "the_new_excerpt": "采访明德公司CEO\n[https://finance.yahoo.com/video/mindmed-ceo-going-public-allocate-184100037.html]\n\n采访中的一些收获。\n\n\"今天在纳斯达克的首次亮相很重要，但我看了看股票，它下跌了\n26%. 那么，请告诉我们你现在的想法是什么？\"\n\nJR RAHN：...",
      "title": "MindMed ($MNMD)首席执行官谈上市。\"但在一天结束时，人们创造了市场。\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "採訪明德公司CEO\n[https://finance.yahoo.com/video/mindmed-ceo-going-public-allocate-184100037.html]\n\n採訪中的一些收穫。\n\n\"今天在納斯達克的首次亮相很重要，但我看了看股票，它下跌了\n26%. 那麼，請告訴我們你現在的想法是什麼？\"\n\nJR RAHN：...",
      "title": "MindMed ($MNMD)首席執行官談上市。\"但在一天結束時，人們創造了市場。\""
    }
  ],
  "title": "MindMed ($MNMD) CEO on going public: “But at the end of the day, people make markets.”",
  "created_utc": 1619636733,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://finance.yahoo.com/video/mindmed-ceo-going-public-allocate-184100037.html\">Interview with Mindmed CEO</a></p>\n\n<p>Some takeaway from the interview:</p>\n\n<p>“So big debut on the NASDAQ today, but I&#39;m looking at the stock and it&#39;s down 26%. So take us through what&#39;s going in your mind right now?”</p>\n\n<p>JR RAHN: Well, look, I think we had a massive run-up on Friday and also on Monday. This was a very hotly-anticipated listing by many of our shareholders. And so I think now that we are on NASDAQ, we&#39;re going to start to see a little bit of some stability here today. It seems to be re-tracing a bit. But you know, this isn&#39;t just about share price. This is really about-- NASDAQ is about, how do we allocate capital to mental health?</p>\n\n<p>And how do we build an entire new industry? These are still very early innings for us. And so we&#39;re not going to be dictated by the day-to-day fluctuations or hour-by-hout fluctuations of our stock. We have 180,000 shareholders last time I checked, and a lot of them are very mission-driven. I think, yes, they are interested in investing into us for gains, but I think, importantly, a lot of them share what 40% of the US currently shares, which is that they have a form of mental illness or addiction at the moment.</p>\n\n<p>And so this is not just about investing. This is about investing in a company that is going to have a large impact on society. And that really is our mission.</p>\n\n<p>“You mentioned your investor base-- you&#39;ve got some pretty passionate investors there. And I understand you&#39;re also trending on WallStreetBets today-- not quite sure if investors are seeing MindMed as one of those meme-type stocks like we saw with AMC and GameStop. But what&#39;s your take on what you&#39;re seeing happening sort of at the grassroots level with investors-- with individual investors and your company right now?”</p>\n\n<p>JR RAHN: Well, these are chaotic times. And when you have chaotic times, both in the markets and in society, mental health is a big component and a problem that needs to be looked at. I think our being mentioned in WallStreetBets and on our MindMed investors club-- this is just a natural outcry from normal people that want to see a change in mental health. And suddenly, they can identify with something.</p>\n\n<p>I think it&#39;s great. I love to have empowered and passionate shareholders. We&#39;re very, very receptive and supportive. And you know, I think there&#39;s been a lot of hype around WallStreetBets, and meme stocks, and all of these things. But at the end of the day, people make markets. And it&#39;s great to have the people behind us.</p>\n</div><!-- SC_ON -->",
  "score": 2654,
  "permalink": "/r/wallstreetbets/comments/n0ghph/mindmed_mnmd_ceo_on_going_public_but_at_the_end/",
  "subreddit": "wallstreetbets",
  "id": "n0ghph",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776220652
}