{
  "author": "thewizardofosmium",
  "original_created_utc": 1629492167,
  "title": "Nowadays, dogs get vaccinated for several different fatal diseases. In the past, did lots of dogs just die of them?",
  "created_utc": 1629509742,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the US at least, dogs get shots for rabies, distemper, and parvo, and pills for heartworm.  In the past, say 1900, did dogs just catch these diseases and die from them all the time?  Rabies is an exception I guess, since once symptoms were noticed, the animals were killed ASAP.  But what about the others?</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/askscience/comments/p8djsg/nowadays_dogs_get_vaccinated_for_several/",
  "subreddit": "askscience",
  "id": "p8djsg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In the US at least, dogs get shots for rabies, distemper, and parvo, and pills\nfor heartworm. In the past, say 1900, did dogs just catch these diseases and die\nfrom them all the time? Rabies is an exception I guess, since once symptoms were\nnoticed, the animals were killed ASAP. But what about the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "少なくともアメリカでは、犬は狂犬病、ジステンパー、パルボの予防接種を受け、心臓病の薬を飲みます。\n狂犬病、ジステンパー、パルボの予防接種、心臓病の薬を飲んでいます。1900年頃の昔は、犬はこれらの病気にかかって死んでいたのでしょうか？\n狂犬病は例外です。狂犬病は例外だと思いますが、症状が出た時点で\n狂犬病は例外で、症状が出た時点で早急に殺処分されていました。しかし...",
      "title": "現在、犬はいくつかの異なる致命的な病気のためにワクチンを接種しています。昔は、たくさんの犬がそれで死んでいたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "至少在美国，狗要注射狂犬病、犬瘟热和巴氏杆菌疫苗，还要吃药\n心丝虫的药。在过去，比如说1900年，狗是否只是感染这些疾病并死于\n而死？我想狂犬病是个例外，因为一旦出现症状\n因为一旦发现症状，这些动物就会被尽快杀死。但是......怎么办？",
      "title": "如今，狗被注射了几种不同的致命疾病的疫苗。在过去，很多狗只是死于这些疾病吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "至少在美國，狗要注射狂犬病、犬瘟熱和巴氏桿菌疫苗，還要吃藥\n心絲蟲的藥。在過去，比如說1900年，狗是否只是感染這些疾病並死於\n而死？我想狂犬病是個例外，因爲一旦出現症狀\n因爲一旦發現症狀，這些動物就會被儘快殺死。但是......怎麼辦？",
      "title": "如今，狗被注射了幾種不同的致命疾病的疫苗。在過去，很多狗只是死於這些疾病嗎？"
    }
  ]
}