{
  "author": "KeepImproving7",
  "the_new_excerpt": "Quick Background - I woke in private wealth management, focused on high net\nworth individuals in the United States. When BTC went parabolic in 2017, I would\nsay about 1% invested. Fast forward to today, that number is up to about 10%!\n\nI am absolutely amazed by this development. Most people I work…",
  "original_created_utc": 1617851195,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "背景 - 私は、米国の富裕層を対象としたプライベート・ウェルス・マネジメントに従事しています。\nの富裕層を対象としたプライベート・ウェルス・マネージメントを行っていました。2017年にBTCがパラボリックになったとき、私は\n投資額は約1％でした。それが今日になってみると、約10％になっています。\n\n私はこの展開に絶対的に驚いています。私が働くほとんどの人は...",
      "title": "私はプライベート・ウェルス・マネジメントの仕事をしています。2017年には、BTCに投資したいというお客様は1％でした。今日では、約10％になりました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "快速背景 - 我在私人财富管理领域醒来，专注于高净值人群。\n值的个人在美国。当BTC在2017年出现抛物线时，我会\n说大约1%的投资。快到今天，这个数字已经到了10%左右!\n\n我对这一发展绝对感到惊讶。我工作的大多数人...",
      "title": "我从事私人财富管理。2017年，有1%的客户想投资BTC。今天，大约是10%!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "快速背景 - 我在私人財富管理領域醒來，專注於高淨值人羣。\n值的個人在美國。當BTC在2017年出現拋物線時，我會\n說大約1%的投資。快到今天，這個數字已經到了10%左右!\n\n我對這一發展絕對感到驚訝。我工作的大多數人...",
      "title": "我從事私人財富管理。2017年，有1%的客戶想投資BTC。今天，大約是10%!"
    }
  ],
  "title": "I work in private wealth management. In 2017, 1% of the clients wanted to invest in BTC. Today, it’s about 10%!",
  "created_utc": 1617864986,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Quick Background - I woke in private wealth management, focused on high net worth individuals in the United States. When BTC went parabolic in 2017, I would say about 1% invested. Fast forward to today, that number is up to about 10%! </p>\n\n<p>I am absolutely amazed by this development. Most people I work with are conservative and baby boomers. Keep in mind, crypto in general is a really difficult concept for most, let alone older people who are not used to technology. </p>\n\n<p>I am pleasantly surprised by this development, and I point to irresponsible money printing by central banks as means to dip the toes into BTC. It’s been fun educating people, and let’s keep it up as a community!</p>\n</div><!-- SC_ON -->",
  "score": 2585,
  "permalink": "/r/Bitcoin/comments/mminc1/i_work_in_private_wealth_management_in_2017_1_of/",
  "subreddit": "Bitcoin",
  "id": "mminc1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961873800
}