{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "Good Friday evening to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning June 28th, 2021.\n\n# **The jobs report will move markets in the week ahead as stocks enter the second half riding high - [(Source)](https://www.cnbc.com/2021/06/25/the-jobs-report-will-move-markets-in-the-week-ahead-as-stocks-enter-the-second-half-riding-high.html)**\n*****\n> The monthly jobs report is the highlight in the coming week, as June winds down and markets start the second half of the year.\n*****\n> Economists are expecting about 700,000 jobs. That’s better than the 559,000 in May but below the forecasts of several months ago that payroll creation would be rolling along with monthly gains of at least 1 million.\n*****\n> The report is a key read on the labor market, which has replaced lost jobs more slowly than expected as companies complain about worker shortages and difficulty finding help. But it is also being watched as a gauge on how sticky the current jump in inflation might be. Rising wages are one thing to watch but also worker scarcity, since that can make goods and services more expensive.\n*****\n> Stocks have turned in a mixed performance for the month of June so far. The S&P 500 was up 1.8% as of Friday for the month, and up 7.7% in the second quarter for a 15.6% year-to-date gain. The Nasdaq was up 4.4% in June and up 8.4% for the quarter. The Dow, meanwhile, lagged in June with a modest 0.3% decline, but it is up 4.4% quarter-to-date.\n*****\n> The S&P 500, ending Friday at 4,280, has already edged slightly above 4,276 — the average year end forecast of Wall Street strategists surveyed by CNBC.\n*****\n> For the most part, strategists expect the market to continue its upward trajectory into the second half, although at a slower pace. Some have also said the second half could bring a pause in the rally before the market ends the year higher.\n*****\n> “I think it’s been very good for the stock market that long rates have stopped going up in the first quarter and are going down, taking the pressure off,” The Leuthold Group chief investment strategist Jim Paulsen said.\n*****\n> “Meanwhile earnings have continued to climb unabated, and if you think about it the vast majority of stocks didn’t go anywhere in the second quarter,” Paulsen said. “What we’ve got is a cheaper market than we had in March and we had one where rates are lower and we’re still getting unrestricted policy help from both monetary and fiscal authorities.”\n*****\n> Paulsen said he thinks the S&P 500 could hit 4,500 before pulling back later in the year to finish at about 4,100.\n*****\n> “My attitude now is it’s a very hard tape to fight, and it takes a lot of fortitude to do so, but you’re at a point where it’s a lot cheaper to hedge than it has been,” Interactive Brokers chief strategist Steve Sosnick said. “It’s a lot cheaper to hedge and a more opportune time to do so. It’s always cheaper to buy an umbrella when there are no rain clouds on the horizon.”\n*****\n> Stocks were higher in the past week, despite the turbulence the week earlier after the June Federal Reserve meeting. The Fed laid the groundwork for its ultimate step away from easy policies, with Fed Chairman Jerome Powell saying Fed officials were considering tapering their purchases of mortgages and Treasury securities.\n*****\n> “There seems to be a greater complacency,” Sosnick said, noting the market reaction to the Fed’s potential unwind of easy policy was calm.\n*****\n> If the Fed announces it will taper its bond purchases in the next several months, it would be expected to wait several months more before it starts the process. Then it could take many more months to take the $120 billion in monthly purchases to zero. The unwind of that policy is especially important since it could be a precursor to the Fed raising interest rates.\n*****\n> “Underlying everything, there’s a huge faith in the Fed, that they will do the right thing, and they’ll continue to do the right thing,” Sosnick said.\n*****\n> Sosnick said he’s watching the bond market going into quarter end this week, after the surge in yields last quarter end. The relatively tame behavior of bond yields, which move opposite price, has been a hallmark of the last part of the second quarter.\n*****\n> The benchmark 10-year Treasury was yielding 1.52% Friday, up from 1.45% a week prior.\n*****\n> Sosnick said if the 10-year yield does remains contained, that should be good for tech. “Right now, it appears there’s that kind of relationship between the 10-year and NDX. If 10-year yields are lower, people are using it as a buy signal for the Nasdaq 100. Is that fool proof? Far from it, but people are using it,” he said.\n*****\n> Tech stocks were up 2.4% for the week and 9.4% for the quarter so far, after being out of favor when yields were moving higher in March.\n*****\n> “The advice at the end of the first quarter was that [10-year] rates were going to 2%. Rather than going up, rates went down and as a result growth beat value and techs beat financials,” The Leuthold Group’s Paulsen said. “Now everyone thinks rates are going to stay low longer. I think value, cyclicals and small caps are going to win this quarter. I think we’re going to have a correction and end the year around 4,100.”\n*****\n> # Jobs, jobs, jobs\n> The payroll number Friday morning is by far the biggest economic event of the week.\n*****\n> “We expect next week’s June employment report to show that nonfarm payrolls expanded by 800k, pushing the unemployment rate down to 5.5% from 5.8%. Strong demand and weak supply should continue to put upward pressure on wages,” wrote Bank of America economists.\n*****\n> According to Dow Jones, economists expect 683,000 payrolls were created in June and the unemployment rate fell to 5.7% from 5.8%. But the market is also looking to see if the data reveals anything new about inflation and whether it could be transitory, or temporary, as the Fed has stated.\n*****\n> “The problem is because the markets have tended to surprise us, it’s tough to figure out what the trade is,” said Sosnick. “There’s two components of it. It is the unemployment rate, or the labor force participation, the stuff Powell is really looking for.”\n*****\n> Wage data could be hot with the Dow Jones estimate at a 3.7% year-over-year gain in average hourly wages, up from 1.98% in May.\n*****\n> “Are we approaching full employment? With non non-transitory inflationary affects?” Sosnick said. “You’re seeing companies giving signing bonuses. Those are transitory but if you have to raise wages and if wages are going to go up, that is non transitory.”\n*****\n> Besides the jobs data, there is ISM manufacturing data and monthly vehicle sales Thursday.\n*****\n> OPEC also meets on July 1, and market pros are watching to see if the OPEC and its alliance in OPEC plus will continue to add oil to the market.\n*****\n\n# **This past week saw the following moves in the S&P:**\n###### **([CLICK HERE FOR THE FULL S&P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/G46hT3f.png))**\n\n# **S&P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/Kxpa6Jo.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/ofY7VWE.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/qRUxZ9g.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/R1fYrG8.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/xLCNRjf.png))**\n\n# **S&P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/JgnbUaL.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/Y8RSgY9.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/79c4zA8.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!]())**\n(T.B.A. THIS WEEKEND.)\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/DqMt7Zc.png))**\n\n# **Friday's Stock Analyst Upgrades & Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/lTAWRVS.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/3b9wB33.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/IeEUD1D.png))**\n\n*****\n\n> # July has been Top Month of Post-Election Years\n\n> July historically is the best performing month of the third quarter however, the mostly negative results in August and September tend to make the comparison easy. Two “hot” Julys in 2009 and 2010 where DJIA and S&P 500 both gained greater than 6% and strong performances in 2013 and 2018 have boosted July’s average gains since 1950 to 1.3% and 1.1% respectively. Such strength inevitability stirs talk of a “summer rally”, but beware the hype, as it has historically been the weakest rally of all seasons (page 74, Stock Trader’s Almanac 2021).\n\n> July begins NASDAQ’s worst four months and is the fifth weakest performing NASDAQ month since 1971, posting a 0.6% average gain. Dynamic trading often accompanies the first full month of summer as the beginning of the second half of the year brings an inflow of new capital. This creates a bullish beginning, a soft week after options expiration and some strength towards the end.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/24425b5573f14df7e7f5039ac0dd34f4/01813a8e14a72b86-9a/s400x600/8951bac1faa8d0887549c23fc161e859a01787fd.jpg))**\n\n> Post-election year Julys rank at or near the top of all post-election year months. DJIA, S&P 500, and NASDAQ are ranked #1. Russell 2000 ranks #2. Delving deeper into this data revealed that many of these past “hot” Julys were preceded by a flat or down first half of the year so there is no guarantee that this July will live up to its historical post-election year record again this year.\n\n*****\n\n> # Bears in Hibernation\n\n> The S&P 500's dip below its 50-DMA and the corresponding rally to new all-time highs did little to dramatically change investor sentiment. This week's survey results from the AAII saw bullish sentiment fall slightly from 41.1% last week to 40.4%. That is once again within the past several weeks' range at the lowest level since only two weeks ago.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/06/062421-AAII-Bull.png))**\n\n> Bearish sentiment was also lower this week, falling by 2.9 percentage points to 23.3%. As with bullish sentiment, that is the lowest level in two weeks. From a longer-term perspective, bearish sentiment is more than 7 percentage points below its historical average of 30.5%. In other words, while sentiment is not exuberant, it continues to skew optimistic.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/06/062421-AAII-Bear.png))**\n\n> The historically muted level of bearish sentiment also shows up in the Investors Intelligence survey of newsletter writers. This week, that reading fell half of one percentage point to 15.8%. That is the lowest percentage of respondents reporting as bearish since March 14th, 2018. Over the past 30 years, there have been only a handful of other periods with lower levels of market pessimism.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/06/062421-II-Bear-2.png))**\n\n> Pivoting back to the AAII survey, with bearish sentiment historically muted, a larger share of investors are reporting as neutral. 36.6% of respondents reported as such this week, up 3.9 percentage points from the six-week low last week.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/06/062421-AAII-Neutral.png))**\n\n*****\n\n> # Manufacturing Activity Indices at Historic Levels\n\n> As recent economic data shows, the robust post-COVID recovery has brought about a historic rebound in U.S. manufacturing activity. Pent-up demand and low inventories of capital goods have caused companies to fire up their machines at record levels, and manufacturing supply management professionals have responded with relative delight in recent surveys. Both the IHS Markit and Institute for Supply Management (ISM) Manufacturing Indices have been robust across the board, as new order growth, hiring plans, and the backlog of orders point to better health in the sector. The downside…higher prices, as purchasing managers’ queried in the survey pinpointed high levels of input cost inflation brought about by a broad-based spike in raw materials prices. The latest survey results show the June IHS Markit U.S. Manufacturing PMI at a new all-time high of 62.6, which compares to the Bloomberg consensus estimate of 61.5 and May’s reading of 62.1.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/06/6.24.21-Blog-Chart-1.png?ssl=1)**\n\n> “The demand for goods and the rebound in manufacturing activity have been remarkable as folks seem determined to get on with their lives. We know that U.S. consumers like to spend, and it seems like they are more than willing to make up for lost time.” explained LPL Financial Director of Research Marc Zabicki.\n\n> We believe the latest IHS Markit manufacturing readout may foretell a good result for the ISM benchmark’s expected release on July 1. That index series has also been near record levels, although just below its all-time high. The long-term ISM chart paints a fairly good picture of past peaks and troughs and the roller-coaster of activity that can occur in the manufacturing sector. In fact, the recent highs in the two manufacturing indicators we have mentioned have us looking ahead to an eventual deceleration in activity, which could come later this year. This deceleration could be brought about by the ultimate slowing of demand for some of the hottest items of late: automobiles, appliances, and technology devices. This doesn’t mean we are souring on the prospect for economic growth in the U.S….only that peak activity, as we are witnessing now, which is usually followed by an eventual slowdown in demand. We should see some of this become visible via U.S. gross domestic product (GDP) growth that is expected to advance at a slower pace in late 2021 and early 2022.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/06/6.24.21-Blog-Chart-2.png?ssl=1)**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n> * **(T.B.A. THIS WEEKEND.)**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!]())**\n(T.B.A. THIS WEEKEND.)\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!]())**\n(T.B.A. THIS WEEKEND.)\n\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release & consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n> # ***Monday 6.28.21 Before Market Open:***\n> ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK!]())\n(NONE.)\n\n> # ***Monday 6.28.21 After Market Close:*** \n> ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK!](https://i.imgur.com/bSPfO8a.png))\n\n*****\n\n> # ***Tuesday  6.29.21 Before Market Open:***\n> ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/SePrjgs.png))\n\n> # ***Tuesday 6.29.21 After Market Close:*** \n> ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/MSOBqPc.png))\n\n*****\n\n> # ***Wednesday 6.30.21 Before Market Open:*** \n> ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/RkKoxGc.png))\n\n> # ***Wednesday 6.30.21 After Market Close:*** \n> ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/ZcLdS7e.png))\n\n*****\n\n> # ***Thursday 7.1.21 Before Market Open:*** \n> ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/c9F7s2i.png))\n\n> # ***Thursday 7.1.21 After Market Close:*** \n> ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK!]())\n(NONE.)\n\n*****\n\n> # ***Friday 7.2.21 Before Market Open:*** \n> ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK!]())\n(NONE.)\n\n*****\n\n> # ***Friday 7.2.21 After Market Close:***\n> ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!]())\n(NONE.)\n\n*****\n\n> # (T.B.A. THIS WEEKEND.)\n**(T.B.A. THIS WEEKEND.)** (T.B.A. THIS WEEKEND.).\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SPY&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.",
  "author_fullname": "t2_eaak0",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Wall Street Week Ahead for the trading week beginning June 28th, 2021",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_o7yfa5",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.86,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 72,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 72,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": 1624661402,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1624689920,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Good Friday evening to all of you here on <a href=\"/r/stocks\">r/stocks</a>. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.</p>\n\n<p>Here is everything you need to know to get you ready for the trading week beginning June 28th, 2021.</p>\n\n<h1><strong>The jobs report will move markets in the week ahead as stocks enter the second half riding high - <a href=\"https://www.cnbc.com/2021/06/25/the-jobs-report-will-move-markets-in-the-week-ahead-as-stocks-enter-the-second-half-riding-high.html\">(Source)</a></strong></h1>\n\n<hr/>\n\n<blockquote>\n<p>The monthly jobs report is the highlight in the coming week, as June winds down and markets start the second half of the year.</p>\n\n<hr/>\n\n<p>Economists are expecting about 700,000 jobs. That’s better than the 559,000 in May but below the forecasts of several months ago that payroll creation would be rolling along with monthly gains of at least 1 million.</p>\n\n<hr/>\n\n<p>The report is a key read on the labor market, which has replaced lost jobs more slowly than expected as companies complain about worker shortages and difficulty finding help. But it is also being watched as a gauge on how sticky the current jump in inflation might be. Rising wages are one thing to watch but also worker scarcity, since that can make goods and services more expensive.</p>\n\n<hr/>\n\n<p>Stocks have turned in a mixed performance for the month of June so far. The S&amp;P 500 was up 1.8% as of Friday for the month, and up 7.7% in the second quarter for a 15.6% year-to-date gain. The Nasdaq was up 4.4% in June and up 8.4% for the quarter. The Dow, meanwhile, lagged in June with a modest 0.3% decline, but it is up 4.4% quarter-to-date.</p>\n\n<hr/>\n\n<p>The S&amp;P 500, ending Friday at 4,280, has already edged slightly above 4,276 — the average year end forecast of Wall Street strategists surveyed by CNBC.</p>\n\n<hr/>\n\n<p>For the most part, strategists expect the market to continue its upward trajectory into the second half, although at a slower pace. Some have also said the second half could bring a pause in the rally before the market ends the year higher.</p>\n\n<hr/>\n\n<p>“I think it’s been very good for the stock market that long rates have stopped going up in the first quarter and are going down, taking the pressure off,” The Leuthold Group chief investment strategist Jim Paulsen said.</p>\n\n<hr/>\n\n<p>“Meanwhile earnings have continued to climb unabated, and if you think about it the vast majority of stocks didn’t go anywhere in the second quarter,” Paulsen said. “What we’ve got is a cheaper market than we had in March and we had one where rates are lower and we’re still getting unrestricted policy help from both monetary and fiscal authorities.”</p>\n\n<hr/>\n\n<p>Paulsen said he thinks the S&amp;P 500 could hit 4,500 before pulling back later in the year to finish at about 4,100.</p>\n\n<hr/>\n\n<p>“My attitude now is it’s a very hard tape to fight, and it takes a lot of fortitude to do so, but you’re at a point where it’s a lot cheaper to hedge than it has been,” Interactive Brokers chief strategist Steve Sosnick said. “It’s a lot cheaper to hedge and a more opportune time to do so. It’s always cheaper to buy an umbrella when there are no rain clouds on the horizon.”</p>\n\n<hr/>\n\n<p>Stocks were higher in the past week, despite the turbulence the week earlier after the June Federal Reserve meeting. The Fed laid the groundwork for its ultimate step away from easy policies, with Fed Chairman Jerome Powell saying Fed officials were considering tapering their purchases of mortgages and Treasury securities.</p>\n\n<hr/>\n\n<p>“There seems to be a greater complacency,” Sosnick said, noting the market reaction to the Fed’s potential unwind of easy policy was calm.</p>\n\n<hr/>\n\n<p>If the Fed announces it will taper its bond purchases in the next several months, it would be expected to wait several months more before it starts the process. Then it could take many more months to take the $120 billion in monthly purchases to zero. The unwind of that policy is especially important since it could be a precursor to the Fed raising interest rates.</p>\n\n<hr/>\n\n<p>“Underlying everything, there’s a huge faith in the Fed, that they will do the right thing, and they’ll continue to do the right thing,” Sosnick said.</p>\n\n<hr/>\n\n<p>Sosnick said he’s watching the bond market going into quarter end this week, after the surge in yields last quarter end. The relatively tame behavior of bond yields, which move opposite price, has been a hallmark of the last part of the second quarter.</p>\n\n<hr/>\n\n<p>The benchmark 10-year Treasury was yielding 1.52% Friday, up from 1.45% a week prior.</p>\n\n<hr/>\n\n<p>Sosnick said if the 10-year yield does remains contained, that should be good for tech. “Right now, it appears there’s that kind of relationship between the 10-year and NDX. If 10-year yields are lower, people are using it as a buy signal for the Nasdaq 100. Is that fool proof? Far from it, but people are using it,” he said.</p>\n\n<hr/>\n\n<p>Tech stocks were up 2.4% for the week and 9.4% for the quarter so far, after being out of favor when yields were moving higher in March.</p>\n\n<hr/>\n\n<p>“The advice at the end of the first quarter was that [10-year] rates were going to 2%. Rather than going up, rates went down and as a result growth beat value and techs beat financials,” The Leuthold Group’s Paulsen said. “Now everyone thinks rates are going to stay low longer. I think value, cyclicals and small caps are going to win this quarter. I think we’re going to have a correction and end the year around 4,100.”</p>\n\n<hr/>\n\n<h1>Jobs, jobs, jobs</h1>\n\n<p>The payroll number Friday morning is by far the biggest economic event of the week.</p>\n\n<hr/>\n\n<p>“We expect next week’s June employment report to show that nonfarm payrolls expanded by 800k, pushing the unemployment rate down to 5.5% from 5.8%. Strong demand and weak supply should continue to put upward pressure on wages,” wrote Bank of America economists.</p>\n\n<hr/>\n\n<p>According to Dow Jones, economists expect 683,000 payrolls were created in June and the unemployment rate fell to 5.7% from 5.8%. But the market is also looking to see if the data reveals anything new about inflation and whether it could be transitory, or temporary, as the Fed has stated.</p>\n\n<hr/>\n\n<p>“The problem is because the markets have tended to surprise us, it’s tough to figure out what the trade is,” said Sosnick. “There’s two components of it. It is the unemployment rate, or the labor force participation, the stuff Powell is really looking for.”</p>\n\n<hr/>\n\n<p>Wage data could be hot with the Dow Jones estimate at a 3.7% year-over-year gain in average hourly wages, up from 1.98% in May.</p>\n\n<hr/>\n\n<p>“Are we approaching full employment? With non non-transitory inflationary affects?” Sosnick said. “You’re seeing companies giving signing bonuses. Those are transitory but if you have to raise wages and if wages are going to go up, that is non transitory.”</p>\n\n<hr/>\n\n<p>Besides the jobs data, there is ISM manufacturing data and monthly vehicle sales Thursday.</p>\n\n<hr/>\n\n<p>OPEC also meets on July 1, and market pros are watching to see if the OPEC and its alliance in OPEC plus will continue to add oil to the market.</p>\n\n<hr/>\n</blockquote>\n\n<h1><strong>This past week saw the following moves in the S&amp;P:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/G46hT3f.png\">CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/Kxpa6Jo.png\">CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Indices for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/ofY7VWE.png\">CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Futures Markets as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/qRUxZ9g.png\">CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!</a>)</strong></h6>\n\n<h1><strong>Economic Calendar for the Week Ahead:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/R1fYrG8.png\">CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!</a>)</strong></h6>\n\n<h1><strong>Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/xLCNRjf.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for the Past Week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/JgnbUaL.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Pullback/Correction Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/Y8RSgY9.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Rally Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/79c4zA8.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Most Anticipated Earnings Releases for this week:</strong></h1>\n\n<h6><strong>([CLICK HERE FOR THE CHART!]())</strong></h6>\n\n<p>(T.B.A. THIS WEEKEND.)</p>\n\n<h1><strong>Here are the upcoming IPO&#39;s for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/DqMt7Zc.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Friday&#39;s Stock Analyst Upgrades &amp; Downgrades:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/lTAWRVS.png\">CLICK HERE FOR THE CHART LINK #1!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/3b9wB33.png\">CLICK HERE FOR THE CHART LINK #2!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/IeEUD1D.png\">CLICK HERE FOR THE CHART LINK #3!</a>)</strong></h6>\n\n<hr/>\n\n<blockquote>\n<h1>July has been Top Month of Post-Election Years</h1>\n\n<p>July historically is the best performing month of the third quarter however, the mostly negative results in August and September tend to make the comparison easy. Two “hot” Julys in 2009 and 2010 where DJIA and S&amp;P 500 both gained greater than 6% and strong performances in 2013 and 2018 have boosted July’s average gains since 1950 to 1.3% and 1.1% respectively. Such strength inevitability stirs talk of a “summer rally”, but beware the hype, as it has historically been the weakest rally of all seasons (page 74, Stock Trader’s Almanac 2021).</p>\n\n<p>July begins NASDAQ’s worst four months and is the fifth weakest performing NASDAQ month since 1971, posting a 0.6% average gain. Dynamic trading often accompanies the first full month of summer as the beginning of the second half of the year brings an inflow of new capital. This creates a bullish beginning, a soft week after options expiration and some strength towards the end.</p>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/24425b5573f14df7e7f5039ac0dd34f4/01813a8e14a72b86-9a/s400x600/8951bac1faa8d0887549c23fc161e859a01787fd.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Post-election year Julys rank at or near the top of all post-election year months. DJIA, S&amp;P 500, and NASDAQ are ranked #1. Russell 2000 ranks #2. Delving deeper into this data revealed that many of these past “hot” Julys were preceded by a flat or down first half of the year so there is no guarantee that this July will live up to its historical post-election year record again this year.</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Bears in Hibernation</h1>\n\n<p>The S&amp;P 500&#39;s dip below its 50-DMA and the corresponding rally to new all-time highs did little to dramatically change investor sentiment. This week&#39;s survey results from the AAII saw bullish sentiment fall slightly from 41.1% last week to 40.4%. That is once again within the past several weeks&#39; range at the lowest level since only two weeks ago.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/06/062421-AAII-Bull.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Bearish sentiment was also lower this week, falling by 2.9 percentage points to 23.3%. As with bullish sentiment, that is the lowest level in two weeks. From a longer-term perspective, bearish sentiment is more than 7 percentage points below its historical average of 30.5%. In other words, while sentiment is not exuberant, it continues to skew optimistic.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/06/062421-AAII-Bear.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>The historically muted level of bearish sentiment also shows up in the Investors Intelligence survey of newsletter writers. This week, that reading fell half of one percentage point to 15.8%. That is the lowest percentage of respondents reporting as bearish since March 14th, 2018. Over the past 30 years, there have been only a handful of other periods with lower levels of market pessimism.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/06/062421-II-Bear-2.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Pivoting back to the AAII survey, with bearish sentiment historically muted, a larger share of investors are reporting as neutral. 36.6% of respondents reported as such this week, up 3.9 percentage points from the six-week low last week.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/06/062421-AAII-Neutral.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Manufacturing Activity Indices at Historic Levels</h1>\n\n<p>As recent economic data shows, the robust post-COVID recovery has brought about a historic rebound in U.S. manufacturing activity. Pent-up demand and low inventories of capital goods have caused companies to fire up their machines at record levels, and manufacturing supply management professionals have responded with relative delight in recent surveys. Both the IHS Markit and Institute for Supply Management (ISM) Manufacturing Indices have been robust across the board, as new order growth, hiring plans, and the backlog of orders point to better health in the sector. The downside…higher prices, as purchasing managers’ queried in the survey pinpointed high levels of input cost inflation brought about by a broad-based spike in raw materials prices. The latest survey results show the June IHS Markit U.S. Manufacturing PMI at a new all-time high of 62.6, which compares to the Bloomberg consensus estimate of 61.5 and May’s reading of 62.1.</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/06/6.24.21-Blog-Chart-1.png?ssl=1\">CLICK HERE FOR THE CHART!</a></strong></h6>\n\n<p>“The demand for goods and the rebound in manufacturing activity have been remarkable as folks seem determined to get on with their lives. We know that U.S. consumers like to spend, and it seems like they are more than willing to make up for lost time.” explained LPL Financial Director of Research Marc Zabicki.</p>\n\n<p>We believe the latest IHS Markit manufacturing readout may foretell a good result for the ISM benchmark’s expected release on July 1. That index series has also been near record levels, although just below its all-time high. The long-term ISM chart paints a fairly good picture of past peaks and troughs and the roller-coaster of activity that can occur in the manufacturing sector. In fact, the recent highs in the two manufacturing indicators we have mentioned have us looking ahead to an eventual deceleration in activity, which could come later this year. This deceleration could be brought about by the ultimate slowing of demand for some of the hottest items of late: automobiles, appliances, and technology devices. This doesn’t mean we are souring on the prospect for economic growth in the U.S….only that peak activity, as we are witnessing now, which is usually followed by an eventual slowdown in demand. We should see some of this become visible via U.S. gross domestic product (GDP) growth that is expected to advance at a slower pace in late 2021 and early 2022.</p>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/06/6.24.21-Blog-Chart-2.png?ssl=1\">CLICK HERE FOR THE CHART!</a></strong></h6>\n</blockquote>\n\n<hr/>\n\n<p>Here are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-</p>\n\n<hr/>\n\n<blockquote>\n<ul>\n<li><strong>(T.B.A. THIS WEEKEND.)</strong></li>\n</ul>\n</blockquote>\n\n<hr/>\n\n<h6><strong>([CLICK HERE FOR NEXT WEEK&#39;S MOST NOTABLE EARNINGS RELEASES!]())</strong></h6>\n\n<p>(T.B.A. THIS WEEKEND.)</p>\n\n<h6><strong>([CLICK HERE FOR NEXT WEEK&#39;S HIGHEST VOLATILITY EARNINGS RELEASES!]())</strong></h6>\n\n<p>(T.B.A. THIS WEEKEND.)</p>\n\n<hr/>\n\n<p>Below are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:</p>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Monday 6.28.21 Before Market Open:</em></strong></h1>\n\n<h6>([CLICK HERE FOR MONDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!]())</h6>\n\n<p>(NONE.)</p>\n\n<h1><strong><em>Monday 6.28.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/bSPfO8a.png\">CLICK HERE FOR MONDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Tuesday  6.29.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/SePrjgs.png\">CLICK HERE FOR TUESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Tuesday 6.29.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/MSOBqPc.png\">CLICK HERE FOR TUESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Wednesday 6.30.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/RkKoxGc.png\">CLICK HERE FOR WEDNESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Wednesday 6.30.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/ZcLdS7e.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Thursday 7.1.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/c9F7s2i.png\">CLICK HERE FOR THURSDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Thursday 7.1.21 After Market Close:</em></strong></h1>\n\n<h6>([CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!]())</h6>\n\n<p>(NONE.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 7.2.21 Before Market Open:</em></strong></h1>\n\n<h6>([CLICK HERE FOR FRIDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!]())</h6>\n\n<p>(NONE.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 7.2.21 After Market Close:</em></strong></h1>\n\n<h6>([CLICK HERE FOR FRIDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())</h6>\n\n<p>(NONE.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>(T.B.A. THIS WEEKEND.)</h1>\n\n<p><strong>(T.B.A. THIS WEEKEND.)</strong> (T.B.A. THIS WEEKEND.).</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=SPY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<h1>DISCUSS!</h1>\n\n<p>What are you all watching for in this upcoming trading week?</p>\n\n<hr/>\n\n<p>I hope you all have a wonderful weekend and a great trading week ahead <a href=\"/r/stocks\">r/stocks</a>.</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "o7yfa5",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "bigbear0083",
  "discussion_type": null,
  "num_comments": 4,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/o7yfa5/wall_street_week_ahead_for_the_trading_week/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/o7yfa5/wall_street_week_ahead_for_the_trading_week/",
  "subreddit_subscribers": 2834572,
  "created_utc": 1624688984,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1624661120,
  "the_new_excerpt": "Good Friday evening to all of you here on r/stocks [/r/stocks]. I hope everyone\non this sub made out pretty nicely in the market this past week, and is ready\nfor the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week\nbeginning June 28th, 2021.\n\n\nTHE…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/stocks[/r/stocks]をご覧の皆様、金曜日の夜はいかがお過ごしでしょうか。このサブの皆さんは\nこのサブにいる皆さんは、先週の市場でうまく利益を得て、これから始まる新しい取引の準備ができていることと思います。\nこれから始まる新しい取引に向けて準備ができていることと思います。\n\nここでは、今週の取引の準備のために知っておくべきことをお伝えします。\n2021年6月28日からの取引に備えて、知っておくべきことをお伝えします。\n\n\nTHE...",
      "title": "2021年6月28日から始まる取引週のWall Street Week Ahead"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "祝各位在r/stocks [/r/stocks]的朋友们周五晚上好。我希望每个人\n在过去的一周里在市场上赚得盆满钵满，并为新的交易周做好准备。\n迎接新的交易周的到来。\n\n以下是你需要知道的一切，让你为本周的交易做好准备\n2021年6月28日开始。\n\n\n节目中的...",
      "title": "2021年6月28日开始的交易周，华尔街一周前瞻"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "祝各位在r/stocks [/r/stocks]的朋友們週五晚上好。我希望每個人\n在過去的一週裏在市場上賺得盆滿鉢滿，併爲新的交易周做好準備。\n迎接新的交易周的到來。\n\n以下是你需要知道的一切，讓你爲本週的交易做好準備\n2021年6月28日開始。\n\n\n節目中的...",
      "title": "2021年6月28日開始的交易周，華爾街一週前瞻"
    }
  ],
  "source_updated_at": 1625218969047
}