{
  "author": "RachFech",
  "original_created_utc": 1653101150,
  "title": "What was happening to the rest of the world during Great Depression?",
  "created_utc": 1653130605,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We mainly hear about how the US was impacted by the stock market crash of 1929 and the Great Depression that followed. We sometimes hear about Germany’s hyper inflation and economic downturn and how that led to Hitler’s claim to power. But what about the rest of the world? How was the rest of Europe doing during Great Depression era? How did Asian, African, and South American countries fair? Did any country or area actually prosper or do well during this time?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/uudy1r/what_was_happening_to_the_rest_of_the_world/",
  "subreddit": "AskHistorians",
  "id": "uudy1r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We mainly hear about how the US was impacted by the stock market crash of 1929\nand the Great Depression that followed. We sometimes hear about Germany’s hyper\ninflation and economic downturn and how that led to Hitler’s claim to power. But\nwhat about the rest of the world? How was the rest of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "主に1929年の株式市場の大暴落でアメリカがどのような影響を受けたかについて聞いています\nその後に起こった世界恐慌の話をよく耳にします。ドイツの超インフレと景気後退、そしてそれがヒトラーの政権奪取につながったという話は時々聞きます。\nドイツのハイパーインフレと景気後退、そしてそれがヒトラーの政権奪取につながったという話を聞くことがある。しかし\n他の国々はどうだったのでしょうか。他の国々はどうだったのだろうか。",
      "title": "世界恐慌のとき、世界では何が起こっていたのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们主要听到的是美国如何受到1929年股票市场崩溃的影响\n以及随后的大萧条。我们有时会听到德国的高通货膨胀和经济衰退，以及它是如何在经济上受到影响的。\n通货膨胀和经济衰退，以及这如何导致了希特勒的权力要求。但是\n世界其他地区呢？其他国家是如何...",
      "title": "在大萧条期间，世界其他地区发生了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們主要聽到的是美國如何受到1929年股票市場崩潰的影響\n以及隨後的大蕭條。我們有時會聽到德國的高通貨膨脹和經濟衰退，以及它是如何在經濟上受到影響的。\n通貨膨脹和經濟衰退，以及這如何導致了希特勒的權力要求。但是\n世界其他地區呢？其他國家是如何...",
      "title": "在大蕭條期間，世界其他地區發生了什麼？"
    }
  ]
}