{
  "author": "Ohighnoon",
  "original_created_utc": 1646673930,
  "title": "My GFs friend who happens to be in the LGBTQ keep making comments about me being a straight guy. I feel weird about it should I be?",
  "created_utc": 1646685857,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve been thinking about this a lot but I rarely see this person and they keep making small comments like “oh I dont hear straight guys sing much that’s weird to hear” as well as a big one last night when she said “straight men make me feel uncomfortable” after asking why she responded “what have they done to make me feel comfortable”. &lt;/p&gt;\n\n&lt;p&gt;This may be weird but is this what sexism/racism feels like. All I can think of is alternative situations where if she said that about any other group she would be a purse clutching Karen. Like if she said that about black men it would be crazy. &lt;/p&gt;\n\n&lt;p&gt;I’m not trying to equate it to racism directly or sexism but I feel like even if it’s not exactly sexism you shouldn’t make comments like that about people sex or gender. Yet I feel conflicted because I know how people feel about the idea that other genders can be sexist to guys.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 157,
  "permalink": "/r/TooAfraidToAsk/comments/t8udqk/my_gfs_friend_who_happens_to_be_in_the_lgbtq_keep/",
  "subreddit": "TooAfraidToAsk",
  "id": "t8udqk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve been thinking about this a lot but I rarely see this person and they keep\nmaking small comments like “oh I dont hear straight guys sing much that’s weird\nto hear” as well as a big one last night when she said “straight men make me\nfeel uncomfortable” after asking why she responded “what have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこのことをよく考えているのですが、その人とはほとんど会うことがなく、彼らはずっと\nとか、「ノンケの歌はあまり聞かないから変な感じ」とか、ちょっとしたコメントを\nとか、昨夜は「ノンケの男には参る」と言ったとか。\nという質問に対して、「何を持って...」と答えていました。",
      "title": "私のGFの友人でLGBTQの人は、私がノンケであることについてコメントし続けています。私は変な感じがするのですが、どうしたらいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在思考这个问题，但我很少见到这个人，他们一直在说一些小的评论，比如 \"哦，我不怎么听直男唱歌，这很奇怪。\n诸如 \"哦，我不常听直男唱歌，这很奇怪 \"之类的小评论。\n以及昨晚的一个大评论，她说 \"直男让我感到不舒服\"。\n她说 \"直男让我感到不舒服\"，我问她为什么，她回答说 \"有什么......\"。",
      "title": "我的GF的朋友恰好是LGBTQ的，他们一直在评论我是一个直男。我对此感到很奇怪，我应该这样吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在思考這個問題，但我很少見到這個人，他們一直在說一些小的評論，比如 \"哦，我不怎麼聽直男唱歌，這很奇怪。\n諸如 \"哦，我不常聽直男唱歌，這很奇怪 \"之類的小評論。\n以及昨晚的一個大評論，她說 \"直男讓我感到不舒服\"。\n她說 \"直男讓我感到不舒服\"，我問她爲什麼，她回答說 \"有什麼......\"。",
      "title": "我的GF的朋友恰好是LGBTQ的，他們一直在評論我是一個直男。我對此感到很奇怪，我應該這樣嗎？"
    }
  ]
}