{
  "author": "DetroitMotorShow",
  "original_created_utc": 1635107927,
  "title": "Hyperinflation: ATMs in Turkey are replacing the double zero '00' key with a triple zero '000'. Lira has lost 30% of its value in 2021 and 80% since 2012. Hits fresh all time low. But they have banned crypto as \"risks are too big\"",
  "created_utc": 1635124520,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Inflation in Turkey is through the roof, that the ATM operators are now replacing the 00 key with 000 key so that people can withdraw enough currency notes for their regular expenses. </p>\n\n<p><a href=\"https://preview.redd.it/2fvnz62qjgv71.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=ac669540b8330ce1aa5db2fb212626783fc2ef37\">000 key installed.</a></p>\n\n<p>The Turkish currency Lira continues to plummet in value, it has lost almost 30% of its value in 2021 alone, and 80% of its value since 2012. In simpler terms, for someone holding Lira since 2012, their money has lost almost 80% of its purchasing power. Such a scenario is unthinkable for most people in advanced industrial economies.</p>\n\n<p><a href=\"https://preview.redd.it/ui4b3d1sjgv71.png?width=2650&amp;format=png&amp;auto=webp&amp;s=c1859da8888470d5a9a2b81272708b6546f1d596\">Dollar vs Lira charts</a></p>\n\n<p>As per the latest central bank policy documents, inflation in Turkey is around 20%, while interest rates are around 18%. Turkey&#39;s  debt ratings all remain in junk grade. </p>\n\n<p>This is what flawed central bankers and terrible economic policy can do to your savings - all your money saved up in bonds and deposits can lose a huge % of value over time. </p>\n\n<p>Despite their failing currency, the Turkish central bank have ban crypto payments earlier in the year, terming the risks from crypto as &quot;too big&quot;. Specifically, they blamed risk of “non-recoverable&quot; losses arising out of the usage of crypto, and banned companies from offering crypto transactions. </p>\n\n<p>If anyone is facing non-recoverable losses, it is the people who have held on to their Lira.</p>\n</div><!-- SC_ON -->",
  "score": 275,
  "permalink": "/r/CryptoCurrency/comments/qf0nzr/hyperinflation_atms_in_turkey_are_replacing_the/",
  "subreddit": "CryptoCurrency",
  "id": "qf0nzr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Inflation in Turkey is through the roof, that the ATM operators are now\nreplacing the 00 key with 000 key so that people can withdraw enough currency\nnotes for their regular expenses.\n\n000 key…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "トルコのインフレは天井知らずで、ATMオペレーターは今、00キーを000キーに交換しています。\n00キーを000キーに変更して、普段の生活に必要な紙幣を引き出せるようにしています。\n紙幣を引き出せるようにしています。\n\n000キー...",
      "title": "ハイパーインフレーション。トルコのATMでは、ダブルゼロの「00」キーがトリプルゼロの「000」に置き換えられています。リラは2021年に30％、2012年以降80％の価値を失った。史上最安値を更新。しかし、\"リスクが大きすぎる \"として暗号化を禁止している。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "土耳其的通货膨胀率居高不下，以至于自动取款机运营商现在将00键改为000键，以便人们能够提取足够的货币。\n将00键改为000键，以便人们能够提取足够的货币。\n钞票来支付他们的正常开支。\n\n000键...",
      "title": "恶性通货膨胀。土耳其的自动取款机将双零 \"00 \"键改为三零 \"000\"。里拉在2021年已经贬值30%，自2012年以来贬值80%。创下历史新低。但他们已经禁止了加密货币，因为 \"风险太大\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "土耳其的通貨膨脹率居高不下，以至於自動取款機運營商現在將00鍵改爲000鍵，以便人們能夠提取足夠的貨幣。\n將00鍵改爲000鍵，以便人們能夠提取足夠的貨幣。\n鈔票來支付他們的正常開支。\n\n000鍵...",
      "title": "惡性通貨膨脹。土耳其的自動取款機將雙零 \"00 \"鍵改爲三零 \"000\"。里拉在2021年已經貶值30%，自2012年以來貶值80%。創下歷史新低。但他們已經禁止了加密貨幣，因爲 \"風險太大\""
    }
  ]
}