{
  "author": "Fruit_Louse",
  "the_new_excerpt": "According to Wikipedia, turnout in the 2020 election was around 66%, which was\nseen as a big deal if I remember correctly. It was obviously increased by\nfactors such as extreme partisanship and the prevalence of mail in votes.\n\nFrom 2004-2016 voter turnout was around 60%. The thing I find odd is…",
  "original_created_utc": 1619876140,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ウィキペディアによると、2020年の選挙の投票率は66％程度で、これは\n私の記憶が正しければ、これは大したものだと思われます。それは、明らかに増加した\n極端な党派性や郵便投票の普及などの要因によって増加したことは明らかです。\n\n2004年から2016年の投票率は60％前後でした。私がおかしいと思うのは...",
      "title": "アメリカの選挙では、なぜ投票率が低いのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "根据维基百科，2020年选举的投票率约为66%，如果我没有记错的话，这被认为是一件大事。\n如果我没记错的话，这被看作是一件大事。这显然是由以下因素增加的\n诸如极端党派主义和邮寄投票的盛行等因素而增加。\n\n2004-2016年，选民投票率约为60%。我觉得奇怪的是...",
      "title": "为什么美国选举中的选民投票率如此之低？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據維基百科，2020年選舉的投票率約爲66%，如果我沒有記錯的話，這被認爲是一件大事。\n如果我沒記錯的話，這被看作是一件大事。這顯然是由以下因素增加的\n諸如極端黨派主義和郵寄投票的盛行等因素而增加。\n\n2004-2016年，選民投票率約爲60%。我覺得奇怪的是...",
      "title": "爲什麼美國選舉中的選民投票率如此之低？"
    }
  ],
  "title": "Why is voter turnout so low in American elections?",
  "created_utc": 1619926985,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>According to Wikipedia, turnout in the 2020 election was around 66%, which was seen as a big deal if I remember correctly. It was obviously increased by factors such as extreme partisanship and the prevalence of mail in votes. </p>\n\n<p>From 2004-2016 voter turnout was around 60%. The thing I find odd is that in most other democracies, turnout numbers like that are seen as normal, not exceptional. For example, in the UK turnout on average higher than the American 2020 election, and was regularly above 70% in the late 20th century.</p>\n\n<p>In my country, India, 60% turnout happens about every election, and is usually higher. For example, we recently had elections for Chief Minister (governor equivalent) in 4 states and 1 union territory. The lowest turnout value was 74%, and it went above 80% in most of them. Here, turnout is high because a  majority of voters rely on government schemes and welfare, which motivates voting, but again American turnout lags behind most democracies, even other well-off ones (Germany, Italy etc.).</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/Ask_Politics/comments/n2igsf/why_is_voter_turnout_so_low_in_american_elections/",
  "subreddit": "Ask_Politics",
  "id": "n2igsf",
  "is_self": true,
  "media": null,
  "is_video": false
}