{
  "author": "subiers",
  "the_new_excerpt": "tbh, its a bit funny. But some of you guys are taking the discusions way to\nserious. So much top post are just trying start a argument of call\nsomeone/something out, just because they don't like it. I think we all know the\ncrypto community atracts alot of different people. Some people are here…",
  "original_created_utc": 1618595830,
  "localize": [
    {
      "locale": "ja",
      "title": "サブラーカーとしては、ドラマの女王のような人もいますが",
      "the_new_excerpt": "ちょっと面白いですね。でも、何人かは、この議論をあまりに\n深刻なのです。このように、多くのトップ投稿は、ただ呼びかけの議論を始めようとしているだけです。\nを、ただ気に入らないからというだけです。私たちは皆\n暗号コミュニティは様々な人を惹きつけます。一部の人々はここにいる..."
    },
    {
      "locale": "zh",
      "title": "作为一个潜伏者，你们中的一些人是戏剧女王",
      "the_new_excerpt": "说实话，这有点好笑。但你们中的一些人把讨论看得太严重了\n严肃。这么多的顶帖都是在试图开始一场争论。\n某人/某事，只是因为他们不喜欢它。我想我们都知道\n加密社区吸引了很多不同的人。有些人在这里..."
    },
    {
      "locale": "zh-Hant",
      "title": "作爲一個潛伏者，你們中的一些人是戲劇女王",
      "the_new_excerpt": "說實話，這有點好笑。但你們中的一些人把討論看得太嚴重了\n嚴肅。這麼多的頂帖都是在試圖開始一場爭論。\n某人/某事，只是因爲他們不喜歡它。我想我們都知道\n加密社區吸引了很多不同的人。有些人在這裏..."
    }
  ],
  "title": "As a sub lurker, some of you guys are drama queens",
  "created_utc": 1618625685,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>tbh, its a bit funny. But some of you guys are taking the discusions way to serious. So much top post are just trying start a argument of call someone/something out, just because they don&#39;t like it. I think we all know the crypto community atracts alot of different people. Some people are here for technology, to invest, moons or have a straight up gambling addiction but want to sound smart. Trying to start a argument is pure tribalism where mostly recycled arguments are used.</p>\n\n<p>Most people are fine. But the fact that some people invest their free time in trying to win a argument with random people is a bit boggeling to me.</p>\n</div><!-- SC_ON -->",
  "score": 277,
  "permalink": "/r/CryptoCurrency/comments/ms8pj9/as_a_sub_lurker_some_of_you_guys_are_drama_queens/",
  "subreddit": "CryptoCurrency",
  "id": "ms8pj9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171519535
}