{
  "author": "Set1Less",
  "original_created_utc": 1653311517,
  "title": "LUNAtic community member FatMan alleges insider deals and manipulation, says he has whistleblowers details on the corruption and shady deals that resulted in $40 bn wipeout. Apparently TFL was already bailed out once in May 2021 by Jump",
  "created_utc": 1653320658,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;FatMan is a popular account on the Lunatic community and governance groups, and since the debacle he has been extremely critical of what happened and the workings of the insiders in the collapsed scheme. &lt;/p&gt;\n\n&lt;p&gt;Just few hours ago, he has made startling revelations claiming he has been approached by whisttleblowers who are willing to go public on the entire chain of events. &lt;/p&gt;\n\n&lt;p&gt;In a series of tweets, he implicates DoKwon, Jump Capital, Kanav Kariya (president of Jump Capital), and SBF (founder of FTX) of shady insider deals that have resulted in the destruction of 40 BN worth assets. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/6g9m645g58191.jpg?width=1164&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=95074bdd5437f53b5117b8160901012f32fd04c4\"&gt;Says he was contacted by whistleblowers&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/ne8cjf8k58191.jpg?width=1182&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=40e23d41a35bc7c783a67ee6b2ab3d4861be662c\"&gt;Implicates some of the high profile names in the space including SBF. According to these allegations, TFL already had a bailout in May 2021.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;In May 2021, there was a similar depeg scare but which was quickly brought back to peg. At that time Kwon and TFL claimed it showed the stablecoin algorithm functioned as expected. &lt;/p&gt;\n\n&lt;p&gt;In further allegations, he says that Serum project has had deals with Jump that took retail investors for a ride. Jump capital apparently manipulated people into billions dollar losses. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/v0vm04x268191.jpg?width=1172&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=536d514e08d1f3d8314fde44cc3085b5af22916d\"&gt;FatMan says he will pursue justice in this matter as people have already lost their lives over it. &lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 346,
  "permalink": "/r/CryptoCurrency/comments/uvzw4f/lunatic_community_member_fatman_alleges_insider/",
  "subreddit": "CryptoCurrency",
  "id": "uvzw4f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "FatMan is a popular account on the Lunatic community and governance groups, and\nsince the debacle he has been extremely critical of what happened and the\nworkings of the insiders in the collapsed scheme.\n\nJust few hours ago, he has made startling revelations claiming he has been\napproached by…"
}