{
  "author": "Set1Less",
  "original_created_utc": 1653311517,
  "title": "LUNAtic community member FatMan alleges insider deals and manipulation, says he has whistleblowers details on the corruption and shady deals that resulted in $40 bn wipeout. Apparently TFL was already bailed out once in May 2021 by Jump",
  "created_utc": 1653320658,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;FatMan is a popular account on the Lunatic community and governance groups, and since the debacle he has been extremely critical of what happened and the workings of the insiders in the collapsed scheme. &lt;/p&gt;\n\n&lt;p&gt;Just few hours ago, he has made startling revelations claiming he has been approached by whisttleblowers who are willing to go public on the entire chain of events. &lt;/p&gt;\n\n&lt;p&gt;In a series of tweets, he implicates DoKwon, Jump Capital, Kanav Kariya (president of Jump Capital), and SBF (founder of FTX) of shady insider deals that have resulted in the destruction of 40 BN worth assets. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/6g9m645g58191.jpg?width=1164&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=95074bdd5437f53b5117b8160901012f32fd04c4\"&gt;Says he was contacted by whistleblowers&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/ne8cjf8k58191.jpg?width=1182&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=40e23d41a35bc7c783a67ee6b2ab3d4861be662c\"&gt;Implicates some of the high profile names in the space including SBF. According to these allegations, TFL already had a bailout in May 2021.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;In May 2021, there was a similar depeg scare but which was quickly brought back to peg. At that time Kwon and TFL claimed it showed the stablecoin algorithm functioned as expected. &lt;/p&gt;\n\n&lt;p&gt;In further allegations, he says that Serum project has had deals with Jump that took retail investors for a ride. Jump capital apparently manipulated people into billions dollar losses. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/v0vm04x268191.jpg?width=1172&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=536d514e08d1f3d8314fde44cc3085b5af22916d\"&gt;FatMan says he will pursue justice in this matter as people have already lost their lives over it. &lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 346,
  "permalink": "/r/CryptoCurrency/comments/uvzw4f/lunatic_community_member_fatman_alleges_insider/",
  "subreddit": "CryptoCurrency",
  "id": "uvzw4f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "FatMan is a popular account on the Lunatic community and governance groups, and\nsince the debacle he has been extremely critical of what happened and the\nworkings of the insiders in the collapsed scheme.\n\nJust few hours ago, he has made startling revelations claiming he has been\napproached by…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "FatManはLunaticコミュニティやガバナンスグループで人気のあるアカウントで、この騒動以来、彼は何が起きたのか、何が起きたのかを非常に批判しています。\nこの騒動以来、彼は何が起こったのか、そして崩壊したスキームのインサイダーの動きについて、非常に批判的になっています。\nを批判している。\n\nつい数時間前、彼は驚くべき事実を明らかにしました。\n接近してきたと",
      "title": "LUNAticコミュニティメンバーのFatManがインサイダー取引と不正操作を主張し、400億ドルの損失をもたらした汚職と怪しげな取引に関する内部告発の詳細を持っていると述べている。TFLはすでに2021年5月に一度ジャンプに救済されているらしい"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "胖子是疯子社区和治理小组的一个受欢迎的账户，自从溃败以来，他一直对所发生的事和所发生的事进行极度批评。\n自从失败以来，他一直对所发生的事情和倒闭计划中的内部人员的工作进行了极端批评。\n崩溃的计划中的内部人员的工作情况。\n\n就在几个小时前，他做出了惊人的披露，声称他已经被\n接触过...",
      "title": "LUNAtic社区成员FatMan指控内部交易和操纵，说他有举报人关于导致400亿美元损失的腐败和黑幕交易的细节。显然，TFL在2021年5月已经被Jump救助过一次。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "胖子是瘋子社區和治理小組的一個受歡迎的賬戶，自從潰敗以來，他一直對所發生的事和所發生的事進行極度批評。\n自從失敗以來，他一直對所發生的事情和倒閉計劃中的內部人員的工作進行了極端批評。\n崩潰的計劃中的內部人員的工作情況。\n\n就在幾個小時前，他做出了驚人的披露，聲稱他已經被\n接觸過...",
      "title": "LUNAtic社區成員FatMan指控內部交易和操縱，說他有舉報人關於導致400億美元損失的腐敗和黑幕交易的細節。顯然，TFL在2021年5月已經被Jump救助過一次。"
    }
  ]
}