{
  "author": "STINGthrowawaySTING",
  "original_created_utc": 1653911349,
  "title": "Some people unfortunately need to hear this: NO, you cannot predict how this bear market will go by looking at previous ones, and your model is not better than guessing",
  "created_utc": 1653925505,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A few hours ago, some dude on here made a post, predicting how low both BTC and ETH will go this market. He said, he had &amp;quot;a model that predicts the last 2 BTC bottom prices&amp;quot; and based on this model, predicted what the next bottom price will be. In the comments, he showed a lot of confidence in his complex model, because &amp;quot;There is a reasoning behind&amp;quot; it and &amp;quot;It&amp;#39;s gonna happen&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Okay, so I thought even though two data points is not really great (to be very euphemistic) and using data from those two data points to predict the same data points is, uh, not best practice, I&amp;#39;m curious what sort of factors they included in their model to get to their estimate. Had to be somewhat complex for them to be so convinced, right?&lt;/p&gt;\n\n&lt;p&gt;Yeah, no. After eyeballing the &amp;quot;data&amp;quot;, I immediately saw that the BTC &amp;quot;model&amp;quot; was:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;2013 bull run: bottom was roughly ATH divided by 6.5&lt;/li&gt;\n&lt;li&gt;2017 bull run: bottom was roughly ATH divided by 6&lt;/li&gt;\n&lt;li&gt;prediction: so this time it will be ATH divided by 5.5&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Seriously, that&amp;#39;s the whole &amp;quot;model&amp;quot;. His ETH model was even more complex: it&amp;#39;s only based on a single data point but hey, that&amp;#39;s more than zero I guess? There their prediction, which is calculated &amp;quot;applying a corrective factor (eth volatility)&amp;quot; is even more complex: &amp;quot;ETH bottom is always previous ATH divided by 12&amp;quot;. That&amp;#39;s maths for you!&lt;/p&gt;\n\n&lt;p&gt;Someone else said in the comments &amp;quot;If you want to see some real math possibilities, then check out the BTC/ETH rainbow charts.&amp;quot; - Jesus, people! It was literally created &lt;a href=\"https://twitter.com/ercwl/status/1341061789182791683\"&gt;as a joke&lt;/a&gt;, there&amp;#39;s no maths behind it and no, it doesn&amp;#39;t work!&lt;/p&gt;\n\n&lt;p&gt;Why am I making this post? Because if you&amp;#39;re new-ish to crypto (or just a bit naive) and are seeing a post like that, you might think that those people probably know more than you if they make those predictions, and you might think &amp;quot;even if they are not precise, how can those data-driven predictions be far off?&amp;quot;. The truth is pretty easy, however: &lt;strong&gt;predictions like that are complete garbage&lt;/strong&gt;. Not every prediction is on the level of &amp;quot;complete this series of numbers&amp;quot; like the one above, that could be an assignment for like a fourth grader, some include more numbers and complex model specifications. But they&amp;#39;re still complete nonsense. &lt;/p&gt;\n\n&lt;p&gt;We simply don&amp;#39;t know what will happen - maybe the economy will crash, maybe it will boom, maybe another LUNA-like fiasco will happen. Those things affect how BTC and ETH will behave. You can build a model that perfectly predicts previous ATHs or ATLs or whatever - honestly, it&amp;#39;s very, very easy - and it doesn&amp;#39;t help you even a bit predicting the future.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Long story short: all &amp;quot;technical analysis&amp;quot; is complete nonsense and you shouldn&amp;#39;t fall for it - no matter if it&amp;#39;s done by someone on the level of a 10-year old like the OP I am quoting or something more complex.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 504,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/5CnMW0Aa3aVloDUBZQTRTJMxhTHYs-QkIfZ9YuZJSfk.jpg?auto=webp&amp;s=1fb51420692e9f66bb47a3c1e6535ef445003db0",
          "width": 140,
          "height": 88
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/5CnMW0Aa3aVloDUBZQTRTJMxhTHYs-QkIfZ9YuZJSfk.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=0ba9a40229f75bc051c25f0cfe9ff50784221b5c",
            "width": 108,
            "height": 67
          }
        ],
        "variants": {},
        "id": "a9P3sTQw1LZGYUWZ3jmQX2Reob6o0JA89_9DSV_UOR0"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/v0yg9j/some_people_unfortunately_need_to_hear_this_no/",
  "subreddit": "CryptoCurrency",
  "id": "v0yg9j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A few hours ago, some dude on here made a post, predicting how low both BTC and\nETH will go this market. He said, he had \"a model that predicts the last 2 BTC\nbottom prices\" and based on this model, predicted what the next bottom price\nwill be. In the comments, he showed a lot of confidence in his…"
}