{
  "author": "lordshield900",
  "original_created_utc": 1651949702,
  "title": "In 1973, the Southern Baptist Convention's news service declared Roe v. Wade had, “advanced the cause of religious liberty, human equality and justice\". One of the lawyers for Roe was an SBC member. They passed pro-Choice resolutions in 1971, 1974 and 1976. How did the SBC become pro-Life?",
  "created_utc": 1651960731,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The SBC used to be very pro-Choice in its outlook (compared to now). According to polls conducted by baptist organziations, most baptist pastors were in favor of allowin abortions in certain circumstances.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In 1970, a poll conducted by the Baptist Sunday School Board found that 70 percent of Southern Baptist pastors supported abortion to protect the mental or physical health of the mother, 64 percent supported abortion in cases of fetal deformity and 71 percent in cases of rape.&lt;/p&gt;\n\n&lt;p&gt;Three years later, a poll conducted by the Baptist Standard newsjournal found that 90 percent of Texas Baptists believed their state’s abortion laws were too restrictive.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The 1971 resolution on abortions stated:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;“We call upon Southern Baptists to work for legislation that will allow the possibility of abortion under such conditions as rape, incest, clear evidence of fetal deformity, and carefully ascertained evidence of the likelihood of damage to the emotional, mental, and physical health of the mother.”&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I got this from the Baptist Press, which is the SBCs news service&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.baptistpress.com/resource-library/news/how-southern-baptists-became-pro-life/\"&gt;https://www.baptistpress.com/resource-library/news/how-southern-baptists-became-pro-life/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;So my question is what happened to prompt thsi shift? The article linked explains it was a grassroots movememnt within the SBC that eventually led it in more pro-Life direction. &lt;/p&gt;\n\n&lt;p&gt;Can any historians comment.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/ukju68/in_1973_the_southern_baptist_conventions_news/",
  "subreddit": "AskHistorians",
  "id": "ukju68",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "The SBC used to be very pro-Choice in its outlook (compared to now). According\nto polls conducted by baptist organziations, most baptist pastors were in favor\nof allowin abortions in certain circumstances.\n\n> In 1970, a poll conducted by the Baptist Sunday School Board found that 70\n> percent of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "かつてSBCは、（今と比べると）非常にプロチョイス的な考え方を持っていた。バプテストの団体が行った世論調査によると\nバプテスト団体が行った世論調査によると、ほとんどのバプテスト牧師は、ある状況下での中絶に賛成していました。\nバプテストの牧師は、ある状況下では中絶を許可することに賛成していました。\n\n> 1970年、バプテスト日曜学校委員会が実施した世論調査では、70\n> パーセントが...",
      "title": "1973年、南部バプテスト連盟のニュースサービスは、ロー対ウェイド裁判が「宗教の自由、人間の平等、正義の大義を推進した」と宣言した。ロー裁判の弁護士の一人は、SBCのメンバーであった。彼らは、1971年、1974年、1976年にプロチョイスの決議をしています。SBCは、どのようにして親ライフになったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "SBC过去在观念上是非常支持选择的（与现在相比）。根据\n根据浸信会组织进行的民意调查，大多数浸信会的牧师都赞成\n允许在某些情况下堕胎。\n\n> 1970年，浸信会主日学委员会进行的一项民意调查发现，70\n>%的...",
      "title": "1973年，南方浸信会的新闻处宣布罗伊诉韦德案 \"推动了宗教自由、人类平等和正义的事业\"。罗案的律师之一是南浸会的成员。他们在1971年、1974年和1976年通过了支持堕胎的决议。SBC如何成为支持生命的组织？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "SBC過去在觀念上是非常支持選擇的（與現在相比）。根據\n根據浸信會組織進行的民意調查，大多數浸信會的牧師都贊成\n允許在某些情況下墮胎。\n\n> 1970年，浸信會主日學委員會進行的一項民意調查發現，70\n>%的...",
      "title": "1973年，南方浸信會的新聞處宣佈羅伊訴韋德案 \"推動了宗教自由、人類平等和正義的事業\"。羅案的律師之一是南浸會的成員。他們在1971年、1974年和1976年通過了支持墮胎的決議。SBC如何成爲支持生命的組織？"
    }
  ]
}