{
  "author": "tyl6702",
  "the_new_excerpt": "I (26M) like horse riding and I go a riding school weekly. There're a lot of\nfriendly young girls and women who try to talk to me, but I always shut them\ndown by giving boring answers and not continuing the conversation on purpose.\n\nAs much as I want to befriend them, I'm doing this because I don't…",
  "original_created_utc": 1619438633,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私（26M）は乗馬が好きで、毎週乗馬学校に通っています。人懐っこい若い女性がたくさんいて\n気さくな若い女の子や女性がたくさん話しかけてきますが、私はいつもつまらない答えをして\nつまらない答えをしたり、わざと話を続けなかったりして、いつも打ち消してしまいます。\n\n仲良くなりたいのはやまやまなのですが、それができないのは...。",
      "title": "異性の未成年者/若年層と話すときに、緊張/不安を感じる人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（26岁）喜欢骑马，我每周都去骑马学校。有很多\n有很多友好的年轻女孩和妇女试图与我交谈，但我总是通过给出无聊的答案和故意不继续交谈来让他们闭嘴。\n我总是给他们无聊的答案，并故意不继续谈话。\n\n虽然我很想和他们交朋友，但我这样做是因为我不...",
      "title": "还有人在与未成年人/年轻的异性交谈时感到紧张/担心吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（26歲）喜歡騎馬，我每週都去騎馬學校。有很多\n有很多友好的年輕女孩和婦女試圖與我交談，但我總是通過給出無聊的答案和故意不繼續交談來讓他們閉嘴。\n我總是給他們無聊的答案，並故意不繼續談話。\n\n雖然我很想和他們交朋友，但我這樣做是因爲我不...",
      "title": "還有人在與未成年人/年輕的異性交談時感到緊張/擔心嗎？"
    }
  ],
  "title": "Does anyone else feel nervous/worried when talking to minors/young adults of the opposite sex?",
  "created_utc": 1619460525,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I (26M) like horse riding and I go a riding school weekly. There&#39;re a lot of friendly young girls and women who try to talk to me, but I always shut them down by giving boring answers and not continuing the conversation on purpose.</p>\n\n<p>As much as I want to befriend them, I&#39;m doing this because I don&#39;t want to be seen as being creepy talking to obliviously younger women, and become a subject of rumors and gossip. Anyone else?  </p>\n\n<p>EDIT: In social settings</p>\n</div><!-- SC_ON -->",
  "score": 125,
  "permalink": "/r/TooAfraidToAsk/comments/myw3gp/does_anyone_else_feel_nervousworried_when_talking/",
  "subreddit": "TooAfraidToAsk",
  "id": "myw3gp",
  "is_self": true,
  "media": null,
  "is_video": false
}