{
  "author": "WalkinTalkinPorkins",
  "the_new_excerpt": "I am not from the USA, and I always find this mind boggling. How can anyone live\noff the minimum wage in the USA? In any thread, there are always people chiming\nin saying \"oh, that's just Federal minimum\" or \"that doesn't include tips\" etc,\netc.\n\nSo my question is; are there actual adults in the USA…",
  "original_created_utc": 1621644451,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はアメリカ出身ではありませんが、いつもこれには驚かされます。アメリカの最低賃金で生活できる人は\n最低賃金で生活できるのでしょうか？どのスレッドでも、「ああ、それは連邦政府の最低賃金だよ」とか\nそれは連邦政府の最低賃金に過ぎない」とか「チップは含まれていない」などと言う人が必ずいます。\n等々。\n\nそこで質問ですが、アメリカには実際に大人がいるのでしょうか...。",
      "title": "アメリカの最低賃金：時給7.25ドルで生活している大人は実際にいるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是来自美国，但我总是觉得这令人费解。在美国，怎么会有人\n在美国靠最低工资生活？在任何一个话题中，总有一些人插话说\n在说 \"哦，这只是联邦最低工资 \"或 \"这不包括小费 \"等等。\n等等。\n\n所以我的问题是，在美国是否有真正的成年人...",
      "title": "美国最低工资标准：是否真的有成年人靠每小时7.25美元生活？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是來自美國，但我總是覺得這令人費解。在美國，怎麼會有人\n在美國靠最低工資生活？在任何一個話題中，總有一些人插話說\n在說 \"哦，這只是聯邦最低工資 \"或 \"這不包括小費 \"等等。\n等等。\n\n所以我的問題是，在美國是否有真正的成年人...",
      "title": "美國最低工資標準：是否真的有成年人靠每小時7.25美元生活？"
    }
  ],
  "title": "USA Minimum Wage: are there actually adults living off $7.25 per hour?",
  "created_utc": 1621663035,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am not from the USA, and I always find this mind boggling. How can anyone live off the minimum wage in the USA? In any thread, there are always people chiming in saying &quot;oh, that&#39;s just Federal minimum&quot; or &quot;that doesn&#39;t include tips&quot; etc, etc.</p>\n\n<p>So my question is; are there actual adults in the USA living off $7.25 an hour? OR, what is the actual minimum wage?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/ni73q8/usa_minimum_wage_are_there_actually_adults_living/",
  "subreddit": "NoStupidQuestions",
  "id": "ni73q8",
  "is_self": true,
  "media": null,
  "is_video": false
}