{
  "author": "cant_read_this",
  "original_created_utc": 1634769176,
  "title": "How my laziness and Reddit has lost me 300k. When people say DYOR they aren’t kidding.",
  "created_utc": 1634819582,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So when I first got into Crypto I took a lot of peoples advice on this sub thinking they where smarter than me and knew what they where doing. I thought this was a haven of good info and advice. See told you I was stupid and lazy.</p>\n\n<p>Turns out they where still smarter than me it’s just no one knows shit about fuck. Every crash and every bull run you’ll see advice and long write ups that are very good. But still none of it means dick. </p>\n\n<p>I’ve held millions of coins of different shit and like an idiot come on here and get convinced I’m the stupid one and should sell. Well yes I’m still the stupid one but so is everyone else. </p>\n\n<p>I sat down tonight and went through all my transactions from when I bought and sold and thought back why I sold. I’m approaching 300k of gains that I could’ve had if I just did one thing.</p>\n\n<p>Hodl</p>\n\n<p>So my advice for new comers and people still listening is don’t listen to anyone but yourself. DYOR and then throw it away because it doesn’t mean anything.</p>\n\n<p>The main thing is this sub is just filled with random thoughts from degenerate gambling assholes who don’t know wtf is going to happen. So treat it as a meme page basically. </p>\n\n<p>P.S. I love you all</p>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/CryptoCurrency/comments/qcctxe/how_my_laziness_and_reddit_has_lost_me_300k_when/",
  "subreddit": "CryptoCurrency",
  "id": "qcctxe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So when I first got into Crypto I took a lot of peoples advice on this sub\nthinking they where smarter than me and knew what they where doing. I thought\nthis was a haven of good info and advice. See told you I was stupid and lazy.\n\nTurns out they where still smarter than me it’s just no one knows…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が初めて暗号化を始めたとき、このサブサイトで多くの人のアドバイスを受けました。\n彼らは私よりも賢く、自分が何をしているか知っていると思っていました。私は\nここは良い情報とアドバイスの宝庫だと思っていました。私はバカで怠け者だと言いましたね。\n\n結局、彼らはまだ私よりも賢くて、誰も知らないだけだということがわかりました。",
      "title": "私の怠惰とRedditがいかにして30万円を失ったか。人が「DYOR」と言うとき、それは冗談ではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，当我第一次进入加密货币时，我接受了很多人在这个子上的建议\n认为他们比我更聪明，知道自己在做什么。我认为\n这是一个好信息和建议的天堂。我告诉你，我是个愚蠢和懒惰的人。\n\n结果发现他们仍然比我聪明，只是没有人知道......",
      "title": "我的懒惰和Reddit是如何让我失去30万的。当人们说DYOR时，他们并不是在开玩笑。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，當我第一次進入加密貨幣時，我接受了很多人在這個子上的建議\n認爲他們比我更聰明，知道自己在做什麼。我認爲\n這是一個好信息和建議的天堂。我告訴你，我是個愚蠢和懶惰的人。\n\n結果發現他們仍然比我聰明，只是沒有人知道......",
      "title": "我的懶惰和Reddit是如何讓我失去30萬的。當人們說DYOR時，他們並不是在開玩笑。"
    }
  ]
}