{
  "author": "oilers169",
  "the_new_excerpt": "Always read if you bought Apple 10 years ago at xxxx it would be worth xxxx\ntoday. People assume it was luck or smart to buy then and easy hold with how the\nsolid company is.\n\nI read thousands of articles over the years saying Apple peaked, Android has\ncaught up, techs dated, price to high, sales…",
  "original_created_utc": 1616389985,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "总是念叨着如果10年前以xxxx的价格买下苹果，那就值xxxx了。\n今天。人们以为当时买入是运气或聪明，轻松持有与如何。\n坚实的公司是。\n\n这些年我看了几千篇文章，说苹果达到了顶峰，安卓已经\n赶上了，技术过时了，价格高了，销售... ...",
      "title": "苹果持有者15年了，这就是为什么不容易。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "總是念叨着如果10年前以xxxx的價格買下蘋果，那就值xxxx了。\n今天。人們以爲當時買入是運氣或聰明，輕鬆持有與如何。\n堅實的公司是。\n\n這些年我看了幾千篇文章，說蘋果達到了頂峯，安卓已經\n趕上了，技術過時了，價格高了，銷售... ...",
      "title": "蘋果持有者15年了，這就是爲什麼不容易。"
    }
  ],
  "title": "Apple holder for 15 years now, here’s why it wasn’t easy.",
  "created_utc": 1616394779,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Always read if you bought Apple 10 years ago at xxxx it would be worth xxxx today. People assume it was luck or smart to buy then and easy hold with how the solid company is.</p>\n\n<p>I read thousands of articles over the years saying Apple peaked, Android has caught up, techs dated, price to high, sales down...you name it. Holding long is hard is the point, no matter the company. Whether it’s negative press, stock down or stagnant too.</p>\n\n<p>Apple brand is why I held, they withstood some bad years with making non innovative products due to loyalty and branding product so well.</p>\n\n<p>And that’s why I’m also long on Tesla, Netflix, peloton....over valued or not. The company to perfect a product first and build a following is tough to over throw, if they stay innovative.</p>\n</div><!-- SC_ON -->",
  "score": 7146,
  "permalink": "/r/stocks/comments/mafmmw/apple_holder_for_15_years_now_heres_why_it_wasnt/",
  "subreddit": "stocks",
  "id": "mafmmw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752821013
}