{
  "author": "quintol",
  "original_created_utc": 1625006746,
  "title": "Why is St. Louis not as culturally French as New Orleans?",
  "created_utc": 1625035750,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It seems that St. Louis was a major city in French Louisiana, but unlike New Orleans, it seems that St. Louis lost much of its French heritage. How come New Orleans has managed to stay more French than St. Louis? Did <a href=\"https://en.wikipedia.org/wiki/History_of_St._Louis_(1804%E2%80%931865\">substantial Irish and German immigration</a>#Immigration_and_nativism_in_St._Louis) to St. Louis during the 1830s play a part in diminishing French influence in the city, and if so, how come New Orleans retained its French influence despite also having <a href=\"https://en.wikipedia.org/wiki/History_of_New_Orleans#Antebellum_New_Orleans\">Irish and German immigration in the 1830s</a>?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/oajgd1/why_is_st_louis_not_as_culturally_french_as_new/",
  "subreddit": "AskHistorians",
  "id": "oajgd1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It seems that St. Louis was a major city in French Louisiana, but unlike New\nOrleans, it seems that St. Louis lost much of its French heritage. How come New\nOrleans has managed to stay more French than St. Louis? Did substantial Irish\nand German…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "セントルイスはフランス領ルイジアナの主要都市だったようですが、ニューオーリンズと違って\nオーリンズとは異なり、セントルイスはそのフランスの遺産の多くを失ってしまったようです。なぜ、ニュー\nなぜニューオリンズは、セントルイスよりもフランス的であり続けることができたのでしょうか？実質的なアイルランド人\nやドイツ系の...",
      "title": "なぜセントルイスはニューオーリンズほど文化的にフランス的ではないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "圣路易斯似乎是法属路易斯安那州的一个主要城市，但与新\n奥尔良不同，圣路易斯似乎失去了很多法国遗产。为什么新\n奥尔良为什么能保持比圣路易斯更多的法国人？是否有大量的爱尔兰人\n和德国人...",
      "title": "为什么圣路易斯没有新奥尔良那样的法国文化？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "聖路易斯似乎是法屬路易斯安那州的一個主要城市，但與新\n奧爾良不同，聖路易斯似乎失去了很多法國遺產。爲什麼新\n奧爾良爲什麼能保持比聖路易斯更多的法國人？是否有大量的愛爾蘭人\n和德國人...",
      "title": "爲什麼聖路易斯沒有新奧爾良那樣的法國文化？"
    }
  ]
}