{
  "author": "Similar-Draft4023",
  "original_created_utc": 1645215509,
  "title": "Wife wants me to stop DCA'ing and sell all my Bitcoin then start buying tangible gold and gold miner stocks again. She then showed me the Charlie Munger clip from a few days ago... What should I do?",
  "created_utc": 1645242158,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I had to pretend like I hadnt seen the Munger clip all over bitcoin twitter. She also then went on to say crypto is in a huge bubble and it will fizzle out and gold will last a 1000 years. I dunno all my instincts tell me otherwise. Any advice on how to deal with this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 333,
  "permalink": "/r/Bitcoin/comments/svrdlr/wife_wants_me_to_stop_dcaing_and_sell_all_my/",
  "subreddit": "Bitcoin",
  "id": "svrdlr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I had to pretend like I hadnt seen the Munger clip all over bitcoin twitter. She\nalso then went on to say crypto is in a huge bubble and it will fizzle out and\ngold will last a 1000 years. I dunno all my instincts tell me otherwise. Any\nadvice on how to deal with this?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインのツイッターでマンジャーのクリップを見なかったことにしなければならなかった。彼女は\nまた、暗号は巨大なバブルであり、それは消え失せると言い続けました。\nゴールドは1000年続く どうだろう、私の直感はそうではないと思うのだが。何か\nどうすればいいのか、アドバイスをお願いします。",
      "title": "妻は、DCAをやめてビットコインをすべて売り、有形金と金鉱石を買い戻すようにと言っています。そして、数日前のCharlie Mungerのクリップを見せられた。どうしたらいいんだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不得不假装我没有在比特币微博上看到芒格的片段。她\n她还接着说，加密货币正处于巨大的泡沫中，它将消逝，而黄金将持续1000年。\n黄金将持续1000年。我不知道，我的直觉告诉我不是这样。有什么\n如何处理这个问题的建议？",
      "title": "妻子希望我停止DCA，卖掉我所有的比特币，然后再次开始购买有形的黄金和黄金矿工股票。然后她给我看了几天前的查理-芒格的片段...... 我应该怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不得不假裝我沒有在比特幣微博上看到芒格的片段。她\n她還接着說，加密貨幣正處於巨大的泡沫中，它將消逝，而黃金將持續1000年。\n黃金將持續1000年。我不知道，我的直覺告訴我不是這樣。有什麼\n如何處理這個問題的建議？",
      "title": "妻子希望我停止DCA，賣掉我所有的比特幣，然後再次開始購買有形的黃金和黃金礦工股票。然後她給我看了幾天前的查理-芒格的片段...... 我應該怎麼做？"
    }
  ]
}