{
  "author": "Wabi-Sabibitch",
  "original_created_utc": 1649532507,
  "title": "Most People treat Bitcoin as an Investment and agree that they wouldn't spend it even if they could buy everyday stuff with it. Then what exactly are we expecting from a global adoption of Bitcoin?",
  "created_utc": 1649555759,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When ever there is a talk or rumors about adoption of Bitcoin by a company , I see it everywhere and might even agree with it sometimes. &amp;quot;Why would I spend my Bitcoin to buy stuff , when it can go much higher in value?&amp;quot; &amp;quot;Why would I spend my investment?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Most people might have come to this conclusion from the pizza story , where he bought 2 pizza&amp;#39;s worth 10,000 BTC (that transaction was necessary  to get us where we are. Because that transaction showed Bitcoin has value and can be traded , thank you Laszlo Hanyecz)&lt;/p&gt;\n\n&lt;p&gt;How about stable coins then?&lt;/p&gt;\n\n&lt;p&gt;Using stable coins instead of dollars makes no sense because there is (theoretically) real fiat currency being held in a bank account to back it up. So it&amp;#39;s like using dollars but with extra steps.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 311,
  "permalink": "/r/CryptoCurrency/comments/u00e5u/most_people_treat_bitcoin_as_an_investment_and/",
  "subreddit": "CryptoCurrency",
  "id": "u00e5u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "When ever there is a talk or rumors about adoption of Bitcoin by a company , I\nsee it everywhere and might even agree with it sometimes. \"Why would I spend my\nBitcoin to buy stuff , when it can go much higher in value?\" \"Why would I spend\nmy investment?\"\n\nMost people might have come to this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "企業でビットコインを採用するという話や噂があるとき、私は\nを見ることができますし、時にはそれに同意することもあります。「なぜ私が私の\nビットコインは、もっと高い価値があるのに、物を買うために使うのか？「なぜ私は\n私の投資？\n\nほとんどの人がこう思っているかもしれない...。",
      "title": "ほとんどの人はビットコインを投資として扱い、たとえそれで日常品が買えたとしても使わないという意見で一致しています。では、ビットコインの世界的な普及にはいったい何を期待すればいいのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当有关于某公司采用比特币的谈话或传言时，我\n我到处都能看到，有时甚至会同意它。\"我为什么要花我的\n比特币买东西，因为它可以升值很多？\"我为什么要花\n我的投资\"？\n\n大多数人可能会得出这样的结论...",
      "title": "大多数人把比特币当作一种投资，并同意即使他们可以用它来购买日常用品，他们也不会花费它。那么，我们对全球采用比特币到底有什么期待呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當有關於某公司採用比特幣的談話或傳言時，我\n我到處都能看到，有時甚至會同意它。\"我爲什麼要花我的\n比特幣買東西，因爲它可以升值很多？\"我爲什麼要花\n我的投資\"？\n\n大多數人可能會得出這樣的結論...",
      "title": "大多數人把比特幣當作一種投資，並同意即使他們可以用它來購買日常用品，他們也不會花費它。那麼，我們對全球採用比特幣到底有什麼期待呢？"
    }
  ]
}