{
  "author": "111ascendedmaster",
  "the_new_excerpt": "Sorry, I have never seen a newly minted billionaire donate a billion dollars to\na good cause. This donation outranks anything Bill Gayes, Steve Jokes, the\nWalton fuckers, mark fuckanerd, Jeff bizarrous, or any other eccentric\nbillionaire.\n\nPersonally I would have loved so see him donate it to well…",
  "original_created_utc": 1620969552,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "申し訳ありませんが、億万長者になったばかりの人が10億円を寄付したのを見たことがありません。\n見たことがありません。この寄付は、ビル・ゲイズ、スティーブ・ジョーク、ウォルトン・ファッカーズ、マーク・ファッカーナード、ジェフ・ビザロ、その他のエキセントリックな人々よりも優れている。\nウォルトン・ファッカーズ、マーク・ファカナード、ジェフ・ビザーラス、その他のエキセントリックな\n億万長者です。\n\n個人的には、彼が10億ドルを寄付するのを見たかったのですが...。",
      "title": "イーサリアムでオールイン"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对不起，我从来没有见过一个新晋的亿万富翁捐出10亿美元给\n一个良好的事业。这笔捐款超过了比尔-盖伊、史蒂夫-乔克斯、沃尔顿夫妇、马克-菲特纳德、杰夫-比格拉斯或其他任何古怪的人。\n沃尔顿的混蛋们，马克的混蛋们，杰夫的混蛋们，或任何其他古怪的\n亿万富翁。\n\n就个人而言，我希望看到他把钱捐给......。",
      "title": "全力投入以太坊"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對不起，我從來沒有見過一個新晉的億萬富翁捐出10億美元給\n一個良好的事業。這筆捐款超過了比爾-蓋伊、史蒂夫-喬克斯、沃爾頓夫婦、馬克-菲特納德、傑夫-比格拉斯或其他任何古怪的人。\n沃爾頓的混蛋們，馬克的混蛋們，傑夫的混蛋們，或任何其他古怪的\n億萬富翁。\n\n就個人而言，我希望看到他把錢捐給......。",
      "title": "全力投入以太坊"
    }
  ],
  "title": "All in on ethereum",
  "created_utc": 1620981342,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sorry, I have never seen a newly minted billionaire donate a billion dollars to a good cause.  This donation outranks anything Bill Gayes, Steve Jokes, the Walton fuckers,  mark fuckanerd, Jeff bizarrous, or any other eccentric billionaire.</p>\n\n<p>Personally I would have loved so see him donate it to well water missions in Africa, but there is nothing wrong with who he donated money to.  He is the first billionaire to have my respect.</p>\n\n<p>I believe in the vision...I believe in Vitalik, eth 2.0, and EIP-1559.</p>\n</div><!-- SC_ON -->",
  "score": 1424,
  "permalink": "/r/CryptoCurrency/comments/nc11ta/all_in_on_ethereum/",
  "subreddit": "CryptoCurrency",
  "id": "nc11ta",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590796944
}