{
  "author": "Equivalent-Sweet-559",
  "original_created_utc": 1627388002,
  "title": "Does anyone here have tried stoic before?",
  "created_utc": 1627405086,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Have any of you guys tried stoic before? I saw a post about it and i’m gathering more information about it. Well to put it simply, It’s a trading bot. Apparently, all you need to do is connect your api key to your binance account and it does everything for you?? Stoic also takes 5% of the account balance. Is that better than the other trading bots?. Their <strong>“</strong>hybrid intelligence” utilizes thousands of trader predictions as well as artificial intelligence which is cool if you ask me.<br/>\n I have never used trading bots before and I want to try this one but I need your thoughts about it and I want to know your experience on using it or any other similar trading bots.</p>\n</div><!-- SC_ON -->",
  "score": 205,
  "permalink": "/r/CryptoCurrency/comments/oslne2/does_anyone_here_have_tried_stoic_before/",
  "subreddit": "CryptoCurrency",
  "id": "oslne2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Have any of you guys tried stoic before? I saw a post about it and i’m gathering\nmore information about it. Well to put it simply, It’s a trading bot.\nApparently, all you need to do is connect your api key to your binance account\nand it does everything for you?? Stoic also takes 5% of the account…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さんの中で、ストイックを試したことがある人はいますか？私はそれについての記事を見て、より多くの情報を集めています。\nもっと情報を集めています。簡単に言うと、トレーディング・ボットですね。\nどうやら、APIキーをバイナンス口座に接続するだけで\n全てをやってくれるというものです。Stoicも口座の5％を取っていますが...。",
      "title": "ストイックを試したことのある方はいらっしゃいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你们中的任何一个人以前尝试过stoic吗？我看到一个关于它的帖子，我正在收集\n更多关于它的信息。简单地说，它是一个交易机器人。\n显然，你所需要做的就是把你的api密钥连接到你的binance账户上\n它就会为你做一切事情。斯多克还从账户中抽取5%的资金...",
      "title": "这里有谁曾经尝试过stoic吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你們中的任何一個人以前嘗試過stoic嗎？我看到一個關於它的帖子，我正在收集\n更多關於它的信息。簡單地說，它是一個交易機器人。\n顯然，你所需要做的就是把你的api密鑰連接到你的binance賬戶上\n它就會爲你做一切事情。斯多克還從賬戶中抽取5%的資金...",
      "title": "這裏有誰曾經嘗試過stoic嗎？"
    }
  ]
}