{
  "author": "SkyPuppy561",
  "the_new_excerpt": "I just find it ironic that people like Tess Holliday still get all sorts of\nsurgical work done to their face and Kim Kardashian changed her beautiful\nArmenian nose and chopped it off to become a button nose. Most people can lose\nweight without surgical intervention so it’s just ironic to me that we…",
  "original_created_utc": 1622303309,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "テス・ホリデイのような人たちがいまだに顔に様々な手術を受けているのは皮肉なことです。\nテス・ホリデイのような人がいまだに顔に様々な外科手術を受けていたり、キム・カーダシアンが美しいアルメニア人の鼻を変えて\nアルメニア人の美しい鼻を切り落としてボタン鼻にしてしまった。ほとんどの人は手術をしなくても\n殆どの人は外科手術をしなくても体重を減らすことができるので、私にとっては皮肉なことです。",
      "title": "ボディ・ポジティブはあっても、フェイス・ポジティブのムーブメントがないように見えるのはなぜ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是觉得讽刺的是，像苔丝-霍利迪这样的人仍然对自己的脸部进行各种\n在他们的脸上做各种手术，而金-卡戴珊改变了她美丽的\n亚美尼亚人的鼻子，并把它砍掉，变成一个纽扣鼻。大多数人可以在没有手术干预的情况下减轻\n所以对我来说，这只是一种讽刺，我们...",
      "title": "为什么有身体积极性，但似乎没有脸部积极性运动？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是覺得諷刺的是，像苔絲-霍利迪這樣的人仍然對自己的臉部進行各種\n在他們的臉上做各種手術，而金-卡戴珊改變了她美麗的\n亞美尼亞人的鼻子，並把它砍掉，變成一個鈕釦鼻。大多數人可以在沒有手術干預的情況下減輕\n所以對我來說，這只是一種諷刺，我們...",
      "title": "爲什麼有身體積極性，但似乎沒有臉部積極性運動？"
    }
  ],
  "title": "Why is there body positivity but seemingly no face positivity movement?",
  "created_utc": 1622330074,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just find it ironic that people like Tess Holliday still get all sorts of surgical work done to their face and Kim Kardashian changed her beautiful Armenian nose and chopped it off to become a button nose. Most people can lose weight without surgical intervention so it’s just ironic to me that we are holding so sacred and beyond reproach the things you can change (i.e., weight) but not making it more acceptable to have different facial features. I say this as a woman with a bit of a larger nose and as vapid as she is, Paris Hilton actually showed me that you don’t have to have a cute little button nose to be deemed attractive and I respect her for not chopping it off.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/nnq6jw/why_is_there_body_positivity_but_seemingly_no/",
  "subreddit": "TooAfraidToAsk",
  "id": "nnq6jw",
  "is_self": true,
  "media": null,
  "is_video": false
}