{
  "author": "2COLD2HOLD88",
  "original_created_utc": 1643604452,
  "title": "Who is just waiting for the market to crash already?",
  "created_utc": 1643633109,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t get me wrong. If I could go back in time to November ATHs and sell everything, I definitely would. But obviously that is impossible. &lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s frustrating is how the market has dropped quite a bit to the point where it&amp;#39;s not feasible to take profits, but the uncertainty also makes buying the dip foolish. If the market could just fully crash and get over with it, I would feel much better about buying. But currently, I think it&amp;#39;s very possible for BTC to tank down to 20k right after I get tired of waiting and buy this dip.&lt;/p&gt;\n\n&lt;p&gt;These types of highly unpredictable and abnormally volatile markets are throwing me off, and I&amp;#39;m waiting for some more predictability, whether it&amp;#39;s positive or negative price action.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 335,
  "permalink": "/r/CryptoCurrency/comments/sgsmvg/who_is_just_waiting_for_the_market_to_crash/",
  "subreddit": "CryptoCurrency",
  "id": "sgsmvg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Don't get me wrong. If I could go back in time to November ATHs and sell\neverything, I definitely would. But obviously that is impossible.\n\nWhat's frustrating is how the market has dropped quite a bit to the point where\nit's not feasible to take profits, but the uncertainty also makes buying the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誤解のないようにお願いします。もし私が11月のATHにタイムスリップして、売ることができたら\n全部、そうしますよ。しかし、明らかにそれは不可能です。\n\n悔しいのは、相場がかなり下がってしまっている点で\n利益確定は無理だけど、不安だから買いも...。",
      "title": "もう相場が暴落するのを待ってるだけの人？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不要误会我的意思。如果我能回到11月的ATHs，卖掉所有东西，我肯定会这样做。\n一切，我肯定会这么做。但显然这是不可能的。\n\n令人沮丧的是，市场已经下跌了不少，达到了以下的程度\n获利是不可行的，但这种不确定性也使得买入...",
      "title": "谁只是在等待市场已经崩溃？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不要誤會我的意思。如果我能回到11月的ATHs，賣掉所有東西，我肯定會這樣做。\n一切，我肯定會這麼做。但顯然這是不可能的。\n\n令人沮喪的是，市場已經下跌了不少，達到了以下的程度\n獲利是不可行的，但這種不確定性也使得買入...",
      "title": "誰只是在等待市場已經崩潰？"
    }
  ]
}