{
  "author": "ChatterBox222",
  "original_created_utc": 1655083362,
  "title": "I just found out my guy friend made a fake dating profile of my boyfriend to try to get us to break up. What should I do?",
  "created_utc": 1655102634,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;He was telling me I’m so pretty and can do better. The proof was all in his phone.  He has always been clingy and following me. We met through Bumble BFF and he claimed he was gay&lt;/p&gt;\n\n&lt;p&gt;I was shocked when he told me. I almost started crying and then noticed it was fake, he then started to try to reassure me and get me to hang with him. Why would he do this?&lt;/p&gt;\n\n&lt;p&gt;He was telling me my boyfriend won anyway because he got with me, and that if he is nice then I shouldn’t be with him. I feel like I was gonna die&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/TooAfraidToAsk/comments/vb0ixa/i_just_found_out_my_guy_friend_made_a_fake_dating/",
  "subreddit": "TooAfraidToAsk",
  "id": "vb0ixa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "He was telling me I’m so pretty and can do better. The proof was all in his\nphone. He has always been clingy and following me. We met through Bumble BFF and\nhe claimed he was gay\n\nI was shocked when he told me. I almost started crying and then noticed it was\nfake, he then started to try to reassure…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼は私に、こんなにかわいいんだから、もっとうまくやれるよ、と言ってくれたのです。その証拠に、彼の携帯電話にはすべて\n携帯電話です。彼はいつも粘着質で私についてきています。バンブルのBFFで知り合ったのですが\n彼は自分がゲイだと主張し\n\n彼に言われたときはショックでした。泣き出しそうになって、それが偽物だと気づいた。\n彼は安心させようとし始め...",
      "title": "男友達が私の彼氏の偽のプロフィールを作って、私たちを別れさせようとしてるのがわかったわ。私はどうしたらいいでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他告诉我，我是如此漂亮，可以做得更好。证据都在他的\n电话。他一直都很粘人，一直在跟踪我。我们是通过Bumble BFF认识的，并且\n他声称自己是同性恋\n\n当他告诉我时，我很震惊。我几乎要哭了，然后发现那是\n然后他开始试图安抚我...",
      "title": "我刚刚发现我的男性朋友做了一个假的我男朋友的约会资料，试图让我们分手。我应该怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他告訴我，我是如此漂亮，可以做得更好。證據都在他的\n電話。他一直都很粘人，一直在跟蹤我。我們是通過Bumble BFF認識的，並且\n他聲稱自己是同性戀\n\n當他告訴我時，我很震驚。我幾乎要哭了，然後發現那是\n然後他開始試圖安撫我...",
      "title": "我剛剛發現我的男性朋友做了一個假的我男朋友的約會資料，試圖讓我們分手。我應該怎麼做？"
    }
  ]
}