{
  "author": "DPP-nyaess",
  "original_created_utc": 1645215106,
  "title": "How did India as a highly literate and technologically advanced nation percieve their gradual subjugation by small and distant european countries, 1600-1880?",
  "created_utc": 1645249483,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been struggling to read about the colonization of india from outside of the european POV. unlike in America and Africa, India should have a ton of indigenous writers and intellectuals relating their perspective during colonization. I&amp;#39;m interested in how they saw the conflict, especially on an emotional or spiritual level, if there is a mismatch of perspectives (Like Europeans seeing as Crusades what Arabs saw as Frankish wars), if there was fear or optimism, how they perceived the differences of European and Indian strength, or if there was a comparison the Europeans to previous invaders like the Mughals.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/svr8aa/how_did_india_as_a_highly_literate_and/",
  "subreddit": "AskHistorians",
  "id": "svr8aa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been struggling to read about the colonization of india from outside of the\neuropean POV. unlike in America and Africa, India should have a ton of\nindigenous writers and intellectuals relating their perspective during\ncolonization. I'm interested in how they saw the conflict, especially on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、インドの植民地化について、外から読むことに苦労しています。\nアメリカやアフリカと違って、インドにはたくさんのヨーロッパ人の視点があるはずです。\n先住民の作家や知識人が、彼らの視点に立ちながら\nを、植民地化する。彼らがこの紛争をどう見ていたのか、特に...",
      "title": "1600年から1880年にかけて、インドは遠く離れたヨーロッパの小国に徐々に服従していったことを、高度な識字能力と技術を持つ国家としてどのように受け止めていたのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在努力从欧洲人的观点之外阅读印度的殖民化问题。\n与美国和非洲不同的是，印度应该有大量的本土作家和知识分子讲述他们在殖民时期的观点。\n与美国和非洲不同的是，印度应该有大量的土著作家和知识分子讲述他们在殖民时期的观点。\n与美国和非洲不同，印度应该有大量的土著作家和知识分子讲述他们在殖民化期间的观点。我对他们如何看待冲突很感兴趣，特别是对...",
      "title": "1600-1880年，印度作为一个识字率高、技术先进的国家，如何看待他们被遥远的欧洲小国逐渐征服的情况？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在努力從歐洲人的觀點之外閱讀印度的殖民化問題。\n與美國和非洲不同的是，印度應該有大量的本土作家和知識分子講述他們在殖民時期的觀點。\n與美國和非洲不同的是，印度應該有大量的土著作家和知識分子講述他們在殖民時期的觀點。\n與美國和非洲不同，印度應該有大量的土著作家和知識分子講述他們在殖民化期間的觀點。我對他們如何看待衝突很感興趣，特別是對...",
      "title": "1600-1880年，印度作爲一個識字率高、技術先進的國家，如何看待他們被遙遠的歐洲小國逐漸征服的情況？"
    }
  ]
}