{
  "author": "ProcedureNo5141",
  "the_new_excerpt": "The Ammo company has 180 million backlog order, it was uplisted two months ago,\nand currently has strong balance sheet, low debt to equity ratio, enough cash\nflow for next 2 years. Not even 1% insititution ownership.\n\nThe upcoming earning for Q4 2020 will be another 20% revenue increase. 317%…",
  "original_created_utc": 1612555592,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "安博公司有1.8亿的积压订单，它是两个月前上市的。\n且目前资产负债率较高，负债与权益比率较低，有足够的现金。\n未来2年的流量。连1%的机构所有权都没有。\n\n即将到来的赚得2020年第四的季度将再增收20%。317%…",
      "title": "$POWW弹药公司，具有上升趋势潜力。而值得一看的是"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "安博公司有1.8億的積壓訂單，它是兩個月前上市的。\n且目前資產負債率較高，負債與權益比率較低，有足夠的現金。\n未來2年的流量。連1%的機構所有權都沒有。\n\n即將到來的賺得2020年第四的季度將再增收20%。317%…",
      "title": "$POWW彈藥公司，具有上升趨勢潛力。而值得一看的是"
    }
  ],
  "title": "$POWW ammo company with uptrend potential. And worth to take a look",
  "created_utc": 1612571916,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The Ammo company has 180 million backlog order, it was uplisted two months ago, and currently has strong balance sheet, low debt to equity ratio, enough cash flow for next 2 years. Not even 1% insititution ownership. </p>\n\n<p>The upcoming earning for Q4 2020 will be another 20% revenue increase. 317% yoy revenue increase so far in 2020, and more revenue in 2021. According to the recent news, they have expanded their production line to meet up the demand of back log order due to the high ammo demand in USA. </p>\n\n<p>The ammunition has supplied the law enforcement, military and retail sellers. The potential of the ammunition can be widely adopted by the community also benefited for the long term investment .</p>\n\n<p>Expecting more growth in 2021, and two upcoming positive earning result will also cause price soars as well. </p>\n\n<p>However, the company is not yet being profitable, but less net loss in EPS and higher revenue at the end of 2020. Expect a positive EPS in the near future,  the demand is extremely high due to ammunition shortage and possible gun control law under current political situation.</p>\n\n<p>Disclaimer: No financial and investment advice, do you own DD. Feel free to share your thought or spread the words out. Some upvotes will be pleased.</p>\n</div><!-- SC_ON -->",
  "score": 126,
  "permalink": "/r/investing/comments/ldfz1w/poww_ammo_company_with_uptrend_potential_and/",
  "subreddit": "investing",
  "id": "ldfz1w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123198818
}