{
  "author": "Iiau_",
  "the_new_excerpt": "It's been said here before, and I'll say it again.\n\nCrypto is not a get rich quick scheme. Investing in shitcoins do not change\nthat.\n\nMeanwhile, investing in well supported and good coins have a high chance of\nmaking you good profits in the future. But this is the far future.\n\nThat being said, if…",
  "original_created_utc": 1621044434,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "以前にもここで言われたことがありますが、もう一度言います。\n\n暗号は一攫千金を狙うものではありません。クソコインに投資しても、それは変わらない\n変わらないのです。\n\n一方で、サポートの行き届いた優良なコインに投資すれば、将来的に大きな利益を得られる可能性が高いです。\n将来的に大きな利益を得ることができます。しかし、これは遠い未来の話です。\n\nそうは言っても、もし...",
      "title": "遠い未来にお金が欲しいなら、暗号を手に入れよう。今お金が欲しいなら、仕事をしなさい。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这句话以前在这里说过，我还要说一遍。\n\n加密货币不是一个快速致富的计划。投资狗屎币并不能改变\n这一点。\n\n同时，投资于得到良好支持的好币有很大机会\n让你在未来获得良好的利润。但这是遥远的未来。\n\n这就是说，如果...",
      "title": "如果你想在遥远的未来得到钱，就去买加密货币。如果你现在想要钱，就去找一份工作。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這句話以前在這裏說過，我還要說一遍。\n\n加密貨幣不是一個快速致富的計劃。投資狗屎幣並不能改變\n這一點。\n\n同時，投資於得到良好支持的好幣有很大機會\n讓你在未來獲得良好的利潤。但這是遙遠的未來。\n\n這就是說，如果...",
      "title": "如果你想在遙遠的未來得到錢，就去買加密貨幣。如果你現在想要錢，就去找一份工作。"
    }
  ],
  "title": "If you want money in the far future, get crypto. If you want money now, get a job.",
  "created_utc": 1621060378,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s been said here before, and I&#39;ll say it again.</p>\n\n<p>Crypto is not a get rich quick scheme. Investing in shitcoins do not change that.</p>\n\n<p>Meanwhile, investing in well supported and good coins have a high chance of making you good profits in the future. But this is the far future.</p>\n\n<p>That being said, if you invest to bet on earning money to aid you to live like you would be paycheck to paycheck, you&#39;re doing something wrong.</p>\n\n<p>That&#39;s where a job comes in. A job should never be replaced by crypto. Use the fiat from your job to sustain yourself. Use crypto to assist you in the future.</p>\n</div><!-- SC_ON -->",
  "score": 1332,
  "permalink": "/r/CryptoCurrency/comments/ncok28/if_you_want_money_in_the_far_future_get_crypto_if/",
  "subreddit": "CryptoCurrency",
  "id": "ncok28",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590798338
}