{
  "author": "PartTimeAnalyst",
  "original_created_utc": 1635590188,
  "title": "Why are you invested in crypto, in one sentence.",
  "created_utc": 1635604406,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Would like to have a general consensus of why you are invested in crypto. People who invested in 2010 might have a totally different perception of why they are invested now. This is also same for those that invested in 2016,17,20.</p>\n\n<p>So why are you actually in crypto? Is it because of the money? The revolutionary tech? Or just because you do not believe in the fiat anymore?</p>\n\n<p>Yes, the fiat has definitely been inflated because of the printing of money.</p>\n\n<p>On my own personal thought, I would say that I am investing in crypto because my friend told me to apply for the CRO card and that’s where I began to learn about crypto.</p>\n\n<p>TLDR;\nWhy did you invest in crypto in one sentence</p>\n</div><!-- SC_ON -->",
  "score": 199,
  "permalink": "/r/CryptoCurrency/comments/qiyus0/why_are_you_invested_in_crypto_in_one_sentence/",
  "subreddit": "CryptoCurrency",
  "id": "qiyus0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Would like to have a general consensus of why you are invested in crypto. People\nwho invested in 2010 might have a totally different perception of why they are\ninvested now. This is also same for those that invested in 2016,17,20.\n\nSo why are you actually in crypto? Is it because of the money? The…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜ暗号に投資しているのか、一般的なコンセンサスが欲しいところです。2010年に投資した人と\n2010年に投資した人は、今投資している理由について全く異なる認識を持っているかもしれません。\n投資している理由について全く異なる認識を持っているかもしれません。これは、2016年、17年、20年に投資した人も同じです。\n\nでは、なぜあなたは実際にcryptoに投資しているのでしょうか？それはお金のためですか？その...",
      "title": "なぜcryptoに投資しているのか、一文で説明してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "希望对你为什么投资于加密货币有一个普遍的共识。在2010年投资的人\n在2010年投资的人可能对他们为什么要投资的原因有完全不同的看法。\n现在投资。对于那些在2016,17,20年投资的人来说，这也是一样的。\n\n那么，你到底为什么要投资加密货币？是因为钱吗？是的。",
      "title": "你为什么投资于加密货币，用一句话来说。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "希望對你爲什麼投資於加密貨幣有一個普遍的共識。在2010年投資的人\n在2010年投資的人可能對他們爲什麼要投資的原因有完全不同的看法。\n現在投資。對於那些在2016,17,20年投資的人來說，這也是一樣的。\n\n那麼，你到底爲什麼要投資加密貨幣？是因爲錢嗎？是的。",
      "title": "你爲什麼投資於加密貨幣，用一句話來說。"
    }
  ]
}