{
  "author": "clever80username",
  "original_created_utc": 1657461396,
  "title": "When did we stop letting kids walk home from school?",
  "created_utc": 1657479478,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m 42, and in the past few years I’ve noticed more and more parents lining up an hour before school lets out to pick up their kids. Kindergartens to second I was taking the bus, and I was walking home by the time I was in third grade. Even had my own key. In middle school I lived about 4 miles away and had to ride my bike. That seems like it would be unthinkable now. &lt;/p&gt;\n\n&lt;p&gt;What happened? Stranger danger take over?  Even though that’s a myth and kids are usually kidnapped by a friend or family.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/NoStupidQuestions/comments/vvs0mg/when_did_we_stop_letting_kids_walk_home_from/",
  "subreddit": "NoStupidQuestions",
  "id": "vvs0mg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m 42, and in the past few years I’ve noticed more and more parents lining up\nan hour before school lets out to pick up their kids. Kindergartens to second I\nwas taking the bus, and I was walking home by the time I was in third grade.\nEven had my own key. In middle school I lived about 4 miles…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は42歳ですが、ここ数年、親が列をなすことが多くなってきました。\nをする親が増えていることに気づきました。幼稚園から第2\nはバスで、3年生になるころには歩いて帰っていました。\n自分の鍵も持っていました。中学生になると、約4キロのところに住んでいた...",
      "title": "いつから学校から歩いて帰らせなくなったんだ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今年42岁，在过去几年中，我注意到越来越多的家长在学校放学前一小时排队接孩子。\n越来越多的家长在学校放学前一小时来接他们的孩子。从幼儿园到二中，我\n幼儿园到二年级，我都是坐公交车，到了三年级，我是步行回家。\n我甚至有自己的钥匙。中学时，我住在离学校约4英里的地方......",
      "title": "我们什么时候不再让孩子们从学校步行回家了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今年42歲，在過去幾年中，我注意到越來越多的家長在學校放學前一小時排隊接孩子。\n越來越多的家長在學校放學前一小時來接他們的孩子。從幼兒園到二中，我\n幼兒園到二年級，我都是坐公交車，到了三年級，我是步行回家。\n我甚至有自己的鑰匙。中學時，我住在離學校約4英里的地方......",
      "title": "我們什麼時候不再讓孩子們從學校步行回家了？"
    }
  ]
}