{
  "author": "Mundane_Resort_9452",
  "the_new_excerpt": "Crypto Addiction as given me so much more then a receding hairline and sleepless\nnights. I can contribute the following to my \"interest\" in Crypto investing:\n\n-I gave up smoking cigarettes. I was spending close to $400 AUD a week on\nsmoking. When I caught the Crypto bug I wanted to invest more money…",
  "original_created_utc": 1622637239,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号中毒は、後退した髪の毛の生え際や眠れない夜など、多くのものを私に与えてくれました。\nを与えてくれました。暗号投資に興味を持ったのは、次のような理由があるからです。\n\n-たばこをやめました。タバコを吸うのをやめました - 週に400豪ドル近くをタバコに費やしていました。\n使っていました。暗号の虫にかかったとき、もっとお金を投資したいと思いました...",
      "title": "Crypto Addiction"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "隐性毒瘾给我带来的不仅仅是发际线的后退和不眠之夜\n夜。我对加密货币投资的 \"兴趣 \"可以归结为以下几点。\n\n-我戒了烟。我每周在吸烟上花费近400澳元。\n花了近400澳元。当我染上加密货币的时候，我想投资更多的钱...",
      "title": "隐性货币成瘾"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隱性毒癮給我帶來的不僅僅是髮際線的後退和不眠之夜\n夜。我對加密貨幣投資的 \"興趣 \"可以歸結爲以下幾點。\n\n-我戒了煙。我每週在吸菸上花費近400澳元。\n花了近400澳元。當我染上加密貨幣的時候，我想投資更多的錢...",
      "title": "隱性貨幣成癮"
    }
  ],
  "title": "Crypto Addiction",
  "created_utc": 1622667989,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Crypto Addiction as given me so much more then a receding hairline and sleepless nights. I can contribute the following to my &quot;interest&quot; in Crypto investing:</p>\n\n<p>-I gave up smoking cigarettes. I was spending close to $400 AUD a week on smoking. When I caught the Crypto bug I wanted to invest more money and giving up cigarettes gave me more money to play with.</p>\n\n<p>-I am in a better headspace financially. Everyone says to only invest what you can afford but I had no definitive idea what I could afford. I sat down and extracted 12 months of bank statements into excel and from that data I developed a pretty comprehensive budget which ultimately told me how much I could afford to invest in Crypto.</p>\n\n<p>-After developing the budget with the goal of finding out how much I could invest into crypto I realised there were areas of my life where I was just bleeding fiat. I actually stopped investing in Crypto for a bit while I focused on paying down high interest &#39;negative&#39; debt like credit cards and car loans. I vetted my utility and insurance providers and if they were unable to offer better prices I took my business to other companies. I negotiated with my bank and reduced the interest on my mortgage, I also changed my repayment schedule from monthly to weekly which significantly reduced the term of the loan. </p>\n\n<p>-I further offset my electricity bills with the installation of solar panels on my home. I haven&#39;t had to pay a bill in over 18 months.</p>\n\n<p>-Having reviewed and maxed out reduction on expenses and needless purchases I still wanted more money for my family and to invest in crypto so I decided to upskill and increase my income. While working shiftwork, 50 hours a week as an Electrical Fitter, i managed to complete further education in Leadership and Management. Im now in a management role earning considerably more money.</p>\n\n<p>-Through wanting to invest in Crypto I was able to identify and reduce alot of the financial pressures that the average family may have and it also drove me to invest in myself, upskill and make myself more valuable to prospective employers. I now stress less and never worry about money. I&#39;m a lot happier now, I spend more quality time with my kids and wife because I&#39;m not worrying about how we are going to pay the next bill.</p>\n\n<p>-Indirectly Crypto saved my marriage, kept a roof over my families head and drove me to be a better person in general.</p>\n</div><!-- SC_ON -->",
  "score": 376,
  "permalink": "/r/CryptoCurrency/comments/nqkqxm/crypto_addiction/",
  "subreddit": "CryptoCurrency",
  "id": "nqkqxm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804297955
}