{
  "author": "JammieJarJam",
  "original_created_utc": 1629535497,
  "title": "Unpopular Opinion: Moons are just as shit as Safemoon",
  "created_utc": 1629545480,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This sub is rather strange in that it will celebrate Internet Forum upvote points (moons) whilst lambasting Safemoon.</p>\n\n<p>I guess moons have a slight upper hand by the fact you can earn them for free*, but that doesn&#39;t make them valuable. All the questions you ask of safemoon, you don&#39;t believe apply to moons. Why? You goddamm cultists.</p>\n\n<p>Safemoon has mega whales! Oooops so do the mods.</p>\n\n<p>Safemoon has zero utility! Oooops neither do moons.</p>\n\n<p>And don&#39;t give me that crap about people in 3rd world counfries feeding their families with Internet upvotes. </p>\n\n<p>I&#39;m offering you my two cents because you&#39;ll inevitably need it when moons go to zero.</p>\n\n<p>(*free only if you place zero value on your own time. Shit posting isn&#39;t actually a meaningful way to spend your life)</p>\n</div><!-- SC_ON -->",
  "score": 266,
  "permalink": "/r/CryptoCurrency/comments/p8o137/unpopular_opinion_moons_are_just_as_shit_as/",
  "subreddit": "CryptoCurrency",
  "id": "p8o137",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This sub is rather strange in that it will celebrate Internet Forum upvote\npoints (moons) whilst lambasting Safemoon.\n\nI guess moons have a slight upper hand by the fact you can earn them for free*,\nbut that doesn't make them valuable. All the questions you ask of safemoon, you\ndon't believe apply…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブは、インターネットフォーラムのupvoteポイント（月）を祝う一方で、Safemoonを非難するという、ちょっと変わったサブです。\nポイント（月）を祝福する一方で、Safemoonを非難しているという点で、ちょっと不思議なサブです。\n\nムーンは、無料で獲得できるという点で、少し優位に立っていると思います*。\nしかし、だからといって価値があるわけではありません。あなたがsafemoonに質問していることは、すべて\nあなたはそれを信じていません。",
      "title": "人気のない意見 ムーンはセーフムーンと同じくらいクソです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个子项目相当奇怪，因为它将庆祝互联网论坛上的投票权\n点（月亮），同时抨击Safemoon。\n\n我想月球有一点优势，因为你可以免费获得它们*。\n但这并不意味着它们有价值。你对Safemoon提出的所有问题，你\n你不相信它适用...",
      "title": "不受欢迎的意见。月亮和Safemoon一样都是狗屎"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個子項目相當奇怪，因爲它將慶祝互聯網論壇上的投票權\n點（月亮），同時抨擊Safemoon。\n\n我想月球有一點優勢，因爲你可以免費獲得它們*。\n但這並不意味着它們有價值。你對Safemoon提出的所有問題，你\n你不相信它適用...",
      "title": "不受歡迎的意見。月亮和Safemoon一樣都是狗屎"
    }
  ]
}