{
  "author": "GodlordHerus",
  "original_created_utc": 1652681348,
  "title": "Explanation of how USDT could burn $8 billion with $0 redemptions",
  "created_utc": 1652718990,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Nearly 70% of all the USDT ever printed was given to just two companies Alameda ( FTX owners) and Cumberland ( Binance Market Makers). The remaining amounts to similar Market Makers and CEX associated entities &lt;/p&gt;\n\n&lt;p&gt;Let us be clear Tether and by extension Deltec ( bank for Tether) and Ifinex&amp;#39;s ( owners of Tether) customers arn&amp;#39;t the average joe on the street. It&amp;#39;s the CEX system! &lt;/p&gt;\n\n&lt;p&gt;Ifinex through their own exchange Bitfinex showed you could essentially pump liquidity into the market from thin air and benefit from the fees while inflating your valuation. By just &amp;quot;lending&amp;quot; out USDT to the CEX and leveraging to the  tits with the same USDT. Which based of the NY case documents was $600 million of the CEXs own money. They backed the USDT loan with the CEX&amp;#39;s own funds! &lt;/p&gt;\n\n&lt;p&gt;So if we are talking about $8 billion being &amp;quot;redeemed&amp;quot; we have to assume it was one of these market makers and or CEXs. Which based on some loans that had USD intrest payments we can then get a clear picture of what&amp;#39;s going on &lt;/p&gt;\n\n&lt;p&gt;Tether gives a loan to a Market Maker of $2 billion USDT. The Market Maker pays the intrest on this loan in USD to DELTEC. This is the source of the 3 -5% cash deposits they hold. The Market Makers then transfer these &amp;quot;loans&amp;quot; to CEXs ( those $1 - $2 billion weekly FTX and Binance transfers we saw)&lt;/p&gt;\n\n&lt;p&gt;But you are probably asking where the $2 billion initially came from. Easy it is commercial paper and shares in the CEX that just got the Transfer. The CEX&amp;#39;s value is inflated by the USDT injection that increases the value if its Balance sheet assets ( crypto/ shares) which means Tether has greater &amp;quot;reserves&amp;quot; so they can magically print more USDT &lt;/p&gt;\n\n&lt;p&gt;So logically speaking due to the recent drop in prices and  based off Coinbase&amp;#39;s valuation collapse. We can assume the Tether reserves are in the shit. So they can call in their loans. Which are paid in USDT not USD. Only intrest was in USD &lt;/p&gt;\n\n&lt;p&gt;Thus when they burn the loan there is no redemption! &lt;/p&gt;\n\n&lt;p&gt;There was never $8 billion&lt;/p&gt;\n\n&lt;p&gt;Note: For legal reasons this is for purely educational purposes and if any  person privides proof of redemptions of the $8 billion. I will delete this post&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/CryptoCurrency/comments/uqp4we/explanation_of_how_usdt_could_burn_8_billion_with/",
  "subreddit": "CryptoCurrency",
  "id": "uqp4we",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Nearly 70% of all the USDT ever printed was given to just two companies Alameda\n( FTX owners) and Cumberland ( Binance Market Makers). The remaining amounts to\nsimilar Market Makers and CEX associated entities\n\nLet us be clear Tether and by extension Deltec ( bank for Tether) and Ifinex's (\nowners…"
}