{
  "author": "Skiddok",
  "original_created_utc": 1633485379,
  "title": "How do I (gently) tell the girl I’ve been seeing about her odor issue?",
  "created_utc": 1633529604,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been seeing this girl for the past few weeks and I really like her. I feel like we match in a lot of ways (same sense of humor, similar interests, same college courses, etc), but she has an odor issue I can’t seem to get over. She came over today and after cuddling for a bit we made out for the first time, and I couldn’t get over how bad she smelled. She had some pretty bad breath and genuinely didn’t smell good (closest thing I can compare it to is the weird musty smell of my grandparents house). I have no idea of what to do here because I genuinely like her but was instantly put off the second I went to kiss her. I didn’t say anything at the time, but it’s not something I’m looking forwards to doing again. I don’t want it to seem like I have some obnoxiously high standard for personal hygiene, but from my point of view it doesn’t seem like she is putting in the baseline effort. Any thoughts on how I should approach it?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/q2aogi/how_do_i_gently_tell_the_girl_ive_been_seeing/",
  "subreddit": "TooAfraidToAsk",
  "id": "q2aogi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve been seeing this girl for the past few weeks and I really like her. I feel\nlike we match in a lot of ways (same sense of humor, similar interests, same\ncollege courses, etc), but she has an odor issue I can’t seem to get over. She\ncame over today and after cuddling for a bit we made out for the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここ数週間付き合っている女の子がいるんだけど、本当に好きなんだ。感じています。\n多くの点で一致していると感じています（同じユーモアのセンス、同じ趣味、同じ大学のコースなど）。\nしかし、彼女にはどうしても克服できない匂いの問題があります。彼女は\n今日、彼女が来て、少しの間抱き合った後、私たちはずっとイチャイチャしていました...",
      "title": "付き合っている女の子に、ニオイの問題を（優しく）伝えるには？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "过去几周我一直在和这个女孩交往，我真的很喜欢她。我觉得\n我觉得我们在很多方面都很匹配（相同的幽默感，相似的兴趣，相同的大学课程，等等）。\n但她有一个气味问题，我似乎无法克服。她今天过来\n今天她过来了，在拥抱了一会儿后，我们亲热了一会儿。",
      "title": "我如何（温和地）告诉我一直在交往的女孩关于她的气味问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "過去幾周我一直在和這個女孩交往，我真的很喜歡她。我覺得\n我覺得我們在很多方面都很匹配（相同的幽默感，相似的興趣，相同的大學課程，等等）。\n但她有一個氣味問題，我似乎無法克服。她今天過來\n今天她過來了，在擁抱了一會兒後，我們親熱了一會兒。",
      "title": "我如何（溫和地）告訴我一直在交往的女孩關於她的氣味問題？"
    }
  ]
}