{
  "author": "EthereumDream",
  "original_created_utc": 1626738051,
  "title": "Crypto Ended A Friendship",
  "created_utc": 1626763727,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Flashback to 2018, I am buying ETH whenever I can as this is officially the bear market. I’m working jobs and putting most of my money towards it.</p>\n\n<p>My friend always asked me why I was saving my money and being “cheap”, and I showed him ETH. He laughed in my face and told me I was crazy. I proceeded to buy for the next 2 years.</p>\n\n<p>Now it’s July 2020, the bull run is heating up and I tell my friend to buy in. He laughs at me again, and told me that I was tripping and would lose my money. </p>\n\n<p>At the peak, my life was changed financially. He came up to me and asked me why the hell I didn’t tell him about it… he yelled at me, called me names, and was outright jealous. He said I was lucky and I told him I wasn’t lucky, just patient. He has always avoided me ever since.</p>\n\n<p><strong>Lesson: You can give someone a plate and silverware, but you can’t eat for them.</strong></p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/onq626/crypto_ended_a_friendship/",
  "subreddit": "CryptoCurrency",
  "id": "onq626",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Flashback to 2018, I am buying ETH whenever I can as this is officially the bear\nmarket. I’m working jobs and putting most of my money towards it.\n\nMy friend always asked me why I was saving my money and being “cheap”, and I\nshowed him ETH. He laughed in my face and told me I was crazy. I proceeded…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2018年にフラッシュバックすると、これは公式にベア（弱気）市場であるため、私は可能な限りETHを購入しています。\n市場になっています。仕事をしながら、お金のほとんどをそちらに回しています。\n\n私の友人はいつも、なぜ私がお金を節約して「安い」のかと聞いてきました。\nETHを見せたんです。彼は私の顔を見て笑い、私はクレイジーだと言いました。私は進みました...",
      "title": "友情に終止符を打ったCrypto"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "回到2018年，我随时买入ETH，因为现在是正式的熊市。\n市场。我打着工，把大部分的钱都用在了这上面。\n\n我的朋友总是问我为什么要省钱和 \"便宜\"，我\n给他看ETH。他当着我的面大笑，说我是疯子。我接着...",
      "title": "Crypto结束了一段友谊"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "回到2018年，我隨時買入ETH，因爲現在是正式的熊市。\n市場。我打着工，把大部分的錢都用在了這上面。\n\n我的朋友總是問我爲什麼要省錢和 \"便宜\"，我\n給他看ETH。他當着我的面大笑，說我是瘋子。我接着...",
      "title": "Crypto結束了一段友誼"
    }
  ]
}