{
  "author": "rootpl",
  "original_created_utc": 1648284123,
  "title": "Yes I am in it for the money and I don't care what people think. Cryptocurrency from the perspective of a male in his 30s.",
  "created_utc": 1648294628,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve seen some discussion on this sub recently blaming some people that they are here only to make profit. To make quick money. &amp;quot;Why do you care about price going up or down if you are never selling?&amp;quot; and other silly arguments.&lt;/p&gt;\n\n&lt;p&gt;And let me tell you. Yes the majority here, is in it for the money. It&amp;#39;s because we are screwed. The society is still expecting an average male to earn a lot of money and provide for their family etc. but people in their 30s have been f**d in the arse for the last 15 years or more. &lt;/p&gt;\n\n&lt;p&gt;No wage growth, no prospects in many countries, constant financial crisis that keeps hitting and hitting us from all sides, and now inflation which will melt our savings, that is if we are lucky to have any savings in the first place, education system is a joke in most countries, crippling debts, high cost of living, rents going up and up, and so on and on, I could go on forever.&lt;/p&gt;\n\n&lt;p&gt;Crypto for a lot of us is the only way out, our only way to be able to afford a house or a flat in the future. So yeah, you bet I&amp;#39;m in it for the money and I don&amp;#39;t give a damn what people think. Priority number one for me is to provide for my family.&lt;/p&gt;\n\n&lt;p&gt;Edit: Thank you for the rewards, please but don&amp;#39;t spend money on me. Instead, please donate to Ukrainian charities: \n&lt;a href=\"https://np.reddit.com/r/ukraine/comments/tgc00n/want_to_support_ukraine_heres_a_list_of_charities/\"&gt;https://np.reddit.com/r/ukraine/comments/tgc00n/want_to_support_ukraine_heres_a_list_of_charities/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 575,
  "permalink": "/r/CryptoCurrency/comments/tokbqf/yes_i_am_in_it_for_the_money_and_i_dont_care_what/",
  "subreddit": "CryptoCurrency",
  "id": "tokbqf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've seen some discussion on this sub recently blaming some people that they are\nhere only to make profit. To make quick money. \"Why do you care about price\ngoing up or down if you are never selling?\" and other silly arguments.\n\nAnd let me tell you. Yes the majority here, is in it for the money.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、このサブで、一部の人を非難する議論を見かけましたが、その人たちは\n利益を得るためだけです。手っ取り早くお金を稼ぐために。「なぜ価格を気にするのですか？\nとか、「売らないなら上がるか下がるか」などと、くだらない議論をしています。\n\nそして、言わせてください。そうです、ここの大多数は、お金のためなのです......。",
      "title": "そう、私はお金のためにやっているのであって、人がどう思おうが関係ないのです。30代男性から見たクリプトカレンシー"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近在这个网站上看到一些讨论，指责一些人在这里只是为了赚钱。\n在这里只是为了赚钱。为了赚快钱。\"你为什么要关心价格\n如果你不卖，为什么要关心价格的涨跌？\"以及其他愚蠢的论点。\n\n让我告诉你。是的，这里的大多数人，都是为了钱....",
      "title": "是的，我是为了钱，我不在乎别人怎么想。从一个30多岁男性的角度看加密货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近在這個網站上看到一些討論，指責一些人在這裏只是爲了賺錢。\n在這裏只是爲了賺錢。爲了賺快錢。\"你爲什麼要關心價格\n如果你不賣，爲什麼要關心價格的漲跌？\"以及其他愚蠢的論點。\n\n讓我告訴你。是的，這裏的大多數人，都是爲了錢....",
      "title": "是的，我是爲了錢，我不在乎別人怎麼想。從一個30多歲男性的角度看加密貨幣。"
    }
  ]
}