{
  "author": "SpecialChain",
  "the_new_excerpt": "I don't mean \"being true to your self\" as an excuse to be an asshole. I mean for\nthings like how you express your views about things (or not express them at\nall), or the way you talk or joke (as long as it's not being a rude asshole), or\ncriticizing certain things you find less acceptable versus…",
  "original_created_utc": 1611550257,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我不是说 \"忠于自己 \"是成为混蛋的借口。我的意思是\n比如你如何表达你对事物的看法（或不表达）。\n所有），或者你说话或开玩笑的方式（只要不是做一个粗鲁的混蛋），或者。\n批评某些你认为不太能接受的东西与...",
      "title": "你是愿意因为不做真实的自己而拥有很多朋友，还是因为真实而拥有更少的朋友？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是說 \"忠於自己 \"是成爲混蛋的藉口。我的意思是\n比如你如何表達你對事物的看法（或不表達）。\n所有），或者你說話或開玩笑的方式（只要不是做一個粗魯的混蛋），或者。\n批評某些你認爲不太能接受的東西與...",
      "title": "你是願意因爲不做真實的自己而擁有很多朋友，還是因爲真實而擁有更少的朋友？"
    }
  ],
  "title": "Would you rather have a lot of friends by not being your true self, or have fewer by being true?",
  "created_utc": 1611603180,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I <em>don&#39;t</em> mean &quot;being true to your self&quot; as an excuse to be an asshole. I mean for things like how you express your views about things (or not express them at all), or the way you talk or joke (as long as it&#39;s not being a rude asshole), or criticizing certain things you find less acceptable versus turning a blind eye, things like that.</p>\n\n<p>Semi-relatedly, I once watched a video of a professional therapist who said the danger of putting a mask is that if the mask succeeds, the success itself is a danger because it won&#39;t fix your self-esteem because deep down you know that people likes the mask and not your true self. I think he has a point, but I also have doubts on how pragmatic this would be. </p>\n\n<p>What do you think about metaphorical masks?<br/>\nHow have you been living your life, and do you plan to change it or not, and why?</p>\n</div><!-- SC_ON -->",
  "score": 116,
  "permalink": "/r/TrueAskReddit/comments/l4gahp/would_you_rather_have_a_lot_of_friends_by_not/",
  "subreddit": "TrueAskReddit",
  "id": "l4gahp",
  "is_self": true,
  "media": null,
  "is_video": false
}