{
  "author": "paracordwhore69",
  "the_new_excerpt": "The past few weeks I've had this unshakable feeling of grief deep in my gut, and\nI feel like it's been grief for my self and for my own life. I didn't really get\nto have a childhood and especially didn't get to have a normal teenager\nexperience. My Dad died when I was 16 and I had to step up and be…",
  "original_created_utc": 1622906199,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この数週間、私は腹の底から揺るぎない悲しみを感じていました。\nそれは自分自身や自分の人生に対する悲しみだったような気がします。私は本当に子供時代を過ごすことができませんでした。\n私は子供時代を過ごせなかったし、特に普通の10代を過ごすことができませんでした。\nを経験しました。私が16歳のときに父が亡くなり、私は自分の役割を果たさなければなりませんでした...",
      "title": "自分の人生を逃してしまったという逃れられない気持ちになる人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "过去几周，我的内心深处有一种不可动摇的悲痛感，而且\n我觉得这是对我自己和我自己的生活的悲痛。我并没有真正得到\n有过童年，尤其是没有过正常的青少年生活。\n经验。我的父亲在我16岁时去世，我不得不站出来，成为...",
      "title": "是否有人会有一种不可避免的感觉，即你已经错过了自己的生活？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "過去幾周，我的內心深處有一種不可動搖的悲痛感，而且\n我覺得這是對我自己和我自己的生活的悲痛。我並沒有真正得到\n有過童年，尤其是沒有過正常的青少年生活。\n經驗。我的父親在我16歲時去世，我不得不站出來，成爲...",
      "title": "是否有人會有一種不可避免的感覺，即你已經錯過了自己的生活？"
    }
  ],
  "title": "Does anyone else get the inescapable feeling that you've missed out on your own life?",
  "created_utc": 1622922110,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The past few weeks I&#39;ve had this unshakable feeling of grief deep in my gut, and I feel like it&#39;s been grief for my self and for my own life. I didn&#39;t really get to have a childhood and especially didn&#39;t get to have a normal teenager experience. My Dad died when I was 16 and I had to step up and be the man of the house and even before that I was working a job since I was 13 to help pay the bills. Now I&#39;m 19 and moved out and I have a really good career that makes me about 50k a year (which is a lot where I live for my age), I&#39;ve got my own place, two cars, a motorcycle and I should be extremely proud of myself and all the hard work it took to get here but instead I feel grief. Grief for all the years of fun stupid teenager shit that I didn&#39;t get to experience.</p>\n\n<p>Sometimes, my friends will be talking about all the crazy fun stuff they did when they were in highschool and I just keep thinking to myself, &quot;while they were off doing that, I was working two jobs and going to school, was it really worth it?&quot;.</p>\n\n<p>The worst part is, is that now I&#39;m an adult with money and time and I want to catch up and go out and do all the crazy shit I missed out on, but all my friends are lagging behind so to speak, they&#39;re all in college or working minimum wage to pay expenses and don&#39;t have time now to do fun things because they didn&#39;t get ahead on their careers in highschool.</p>\n\n<p>All in all, I don&#39;t know really, I just can&#39;t escape this sinking feeling in my gut that I&#39;ve missed something great.</p>\n</div><!-- SC_ON -->",
  "score": 127,
  "permalink": "/r/TooAfraidToAsk/comments/nsxya5/does_anyone_else_get_the_inescapable_feeling_that/",
  "subreddit": "TooAfraidToAsk",
  "id": "nsxya5",
  "is_self": true,
  "media": null,
  "is_video": false
}