{
  "author": "RaBaTaJ_",
  "the_new_excerpt": "Hello everyone! I have only been on Reddit for a few months but I learned so\nmuch from it that I figured I should try and give back to the community. English\nis my second language and this is the first time I ever write a full-length\narticle, I hope you will enjoy reading it and I would be very…",
  "original_created_utc": 1612365582,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好！我上Reddit才几个月，但我学到了很多东西。我上Reddit只有几个月的时间，但我学到了很多东西。\n我想我应该试着回馈社会。英文\n是我的第二语言，这也是我第一次写长篇小说。\n文章，希望你能喜欢阅读，我会很...",
      "title": "为什么你应该学习扑克和游戏理论（长篇阅读"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好！我上Reddit才幾個月，但我學到了很多東西。我上Reddit只有幾個月的時間，但我學到了很多東西。\n我想我應該試着回饋社會。英文\n是我的第二語言，這也是我第一次寫長篇小說。\n文章，希望你能喜歡閱讀，我會很...",
      "title": "爲什麼你應該學習撲克和遊戲理論（長篇閱讀"
    }
  ],
  "title": "Why you should learn poker and game theory (LONG READ)",
  "created_utc": 1612384638,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>Hello everyone! I have only been on Reddit for a few months but I learned so much from it that I figured I should try and give back to the community. English is my second language and this is the first time I ever write a full-length article, I hope you will enjoy reading it and I would be very thankful if you could provide some feedback about my writing, about the topic, or about anything else really… So here goes!</em>  </p>\n\n<p><strong>Why you should learn poker and game theory:</strong></p>\n\n<p>My story is similar to that of many: I learned about the game 10 years ago (during the golden age of online poker) when some friends of mine invited me to play a home game. Although I initially thought of poker as just another game of chance akin to playing slots or roulette in a casino, I quickly came to realize that there is a lot more to it as my more experienced friends would repeatedly get the best of me during these home games, which led me to start watching videos and reading strategy books to improve my skill… Little did I know it’d be the start of a journey that would impact many different aspects of my life way beyond the game itself, as most of the fundamental principles learned through poker can be applied to your decision-making outside of the game, especially when it comes to money management and investing. Now, let’s dive into a few of these principles:</p>\n\n<p>&#x200B;</p>\n\n<p>- <strong>Risk management (i.e. Bankroll management)</strong></p>\n\n<p>When learning about how to be successful playing poker, the first big piece of advice most people come across is bankroll management or BRM. To understand BRM, you must first realize that poker has a lot of variance: you might be vastly ahead in a given hand but there is almost always a slim chance that you will lose in the end if one specific card hits. This implies that you will sometimes lose even though you were a 99% favorite, and that you will sometimes get unlucky and lose 2, 5 or maybe even 20 such encounters in a row. THIS is variance. It doesn’t mean that you played bad or that you made bad decisions, but rather that you got unlucky. Over time you will have lucky streaks and unlucky streaks, and these will average out in the long term… It’s just the way the game goes.</p>\n\n<p>Now that we understand variance, let’s get back to BRM. What is it exactly? Let’s say you are the best poker player in the world but you only have 1000$ that you can EVER use to play with. Taking your whole 1000$ on one table and multiplying your stack at an exponential rate might seem like a good idea. Surely nothing can go wrong since you’re the best player in the world right? But variance can be a bitch ;) Even if you’re the best you will lose regularly and you will sometimes get unlucky, it’s just part of the game. The correct move here is to apply BRM, which means only using a small % of your available capital for each game you play in order to reduce the risk of going broke. Using only 100$ per game would already be a lot safer, but you still run the risk of going under on a streak of bad luck. If you only allocate 10$ per game you play, then it becomes virtually impossible for you to ever go broke, even on a huge streak of bad luck. Sure it’s not as exciting and you won’t be making money quite as fast as you could, but this is the way to go to make sure you don’t go broke…</p>\n\n<p>This approach to risk management translates very well to investing:</p>\n\n<p>- <strong>Only invest what you can afford to lose.</strong> Once the money is on the table it’s as good as gone, which is why you should only use your “spare” cash and never invest with your living expenses or worse, borrow money to invest. </p>\n\n<p>- <strong>Diversify your investments.</strong> There is always a chance, however slim it might be, that you will lose most of your investment. This is why going all-in on a specific investment is generally a bad idea (this applies particularly well in the crypto space).</p>\n\n<p>Proper BRM allows you to make sure that you will come out ahead in the long run if you play well, which basically comes down to making more good decisions than bad ones. But that’s assuming you don’t let emotions come in the way of your decision-making, which brings us to our next point…</p>\n\n<p>&#x200B;</p>\n\n<p>- <strong>Emotional management (i.e. Handling tilt/Positive mindset)</strong></p>\n\n<p>Nobody likes losing… In the same way we enjoy winning because of the dopamine rush, we feel bad when we lose which is totally natural. Overcoming this and avoiding tilt (irrational decisions made out of anger/frustration) is an essential skill for any successful poker player. You might play a sound game of poker and apply good BRM, but you will still lose if you let your emotions get the best of you. </p>\n\n<p>After a loss, rather than being angry and frustrated, you should evaluate your decision-making. If your decision-making was good, you just got unlucky and you shouldn’t worry about it since you are playing for the long run (remember that variance teaches us that anything can happen in the short-term). If your decision-making was bad, you need to learn from your mistakes and move on. The key here is to always have a positive mindset: making mistakes is part of the learning process and should be seen as an occasion to improve. Being angry and ranting, on the other hand, rarely result in anything positive.</p>\n\n<p>Again, this translates very well to investing:</p>\n\n<p>- <strong>Don’t be impulsive, don’t let your emotions cloud your judgment.</strong> You should not FOMO because the price is pumping, nor should you sell because of FUD or price corrections. If you believe in a project, short-term price changes (did I hear someone say “variance”?) shouldn’t bother you.</p>\n\n<p>- <strong>Don’t get stuck up on losses.</strong> You bought the top and it crashed immediately after? You sold the bottom right before a huge rally? Don’t let this bother you: what’s done is done and you just need to move on and make the best of your current situation.</p>\n\n<p>- <strong>Have a positive mindset.</strong> Anger and frustration lead to nothing. Yes you could have bought in 2009 when you first heard about it, hindsight is always 20/20. Stay positive and keep learning/improving yourself.</p>\n\n<p>The good thing about all this is that it goes way beyond poker or investing. Being aware of your emotions and how they affect you, learning how to handle losing even when you were “supposed” to win, etc… All this can tremendously help you in all aspects of life by making you less impulsive and more rational in your decision-making. Now, this leaves us with our last fundamental principle of a sound poker strategy:</p>\n\n<p>&#x200B;</p>\n\n<p>- <strong>Basic stats and probabilities (i.e. Expected value/Odds)</strong></p>\n\n<p>To become an accomplished player, you will inevitably have to learn about these simple mathematical tools that poker players use all the time in their decision-making process, such as odds and expected value. To make it very simple, the expected value (EV) of any bet is <strong><em>(REWARD \\</em> WinRate - RISK)</strong><em>, meaning that if you can bet 1000$ with a chance to win 10k$ half of the time, your EV is *</em><em>(10000\\</em>0.5)-1000 = +4000$<em>**. Obviously these are great odds to take as long as you have enough capital to overcome variance. But things would be very different if the odds of winning were only 5% as your EV would then be negative *</em><em>(10000\\</em>0.05)-1000 = -500$.*** Now this is clearly a bet you should not take…</p>\n\n<p>Now that you know probabilities, statistics and game theory are useful decision-making tools in poker, guess what? They are also extremely useful in investing! Even better, the study of game theory with problems such as the “Byzantine generals” or the “Three prisoners” has been, along with cryptography, the foundation on which blockchain technology was built, enabling the trustless and decentralized services that are about to revolutionize our world… </p>\n\n<p>Assuming this was enough to pique your interest and make you want to dig deeper, I’ll just add that just like the other topics we discussed and as you might have guessed, this translates very well to investing and also to pretty much anything in your life:</p>\n\n<p>- <strong>Learn how to break down complex situations.</strong> Logical thinking paired with a statistical approach will help you break down any complex problem into several easier problems, making the whole thing a lot easier to approach/comprehend.</p>\n\n<p>- <strong>Base your decisions on a methodical and rational approach.</strong> List every possible outcome along with its associated upside/downside, estimate the probability of each outcome to occur and make the best decision based on the information available.</p>\n\n<p>My point here is that risk management, emotional management and statistics/game theory are all awesome tools that you should definitely add to your arsenal. Not only will it improve your money-management and investing, it will also be beneficial to your decision-making and to your life in general. Of course poker is not the only way to learn about these, but I personally found it to be the best practice ground to refine and improve them, which is why I strongly encourage you all to try it out and study the game. </p>\n\n<p>I hope you enjoyed the article, and I wish you all a happy 2021 bull run! May we all come closer to retirement and financial independence!</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>TL;DR:</em></strong> <em>more than a game, poker is a school of thought. It teaches you to be reasonable, to assess the risk of every single choice you make, to overcome you emotions, to play the long game rather than the short game, to make informed decisions, etc… This has made me a lot wiser in every aspect of my life, which is why I strongly encourage to try it out and read about poker strategy.</em></p>\n</div><!-- SC_ON -->",
  "score": 392,
  "permalink": "/r/CryptoCurrency/comments/lbpt5c/why_you_should_learn_poker_and_game_theory_long/",
  "subreddit": "CryptoCurrency",
  "id": "lbpt5c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518532603
}