{
  "author": "DangerActiveRobots",
  "the_new_excerpt": "I mean seriously. Anyone with eyes can see that there are two kinds of GME\nbears:\n\n * Old hands around here who are just sick of it, think the bubble\n   popped/squeeze squozed and want people to shut the fuck up already.\n\n * New accounts, coming out of nowhere just to talk shit about GME, and/or…",
  "original_created_utc": 1612908667,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我的意思是认真的。有眼睛的人都能看出来，GME有两种情况。\n熊。\n\n * 老手在这里谁只是生病了， 认为泡沫。\n   啪啪啪/挤挤挤，想让大家都他妈的闭嘴。\n\n * 新的帐户，出来的地方 只是为了谈论狗屎GME，和/或... ...",
      "title": "在其他什么情况下，你会看到：大规模的审查和删除某些主题，全新的账户在每条线程中都有相同的信息，在WSB中没有发帖记录的老账户突然变得活跃起来，只是为了淡化某些东西，而不认为这是非常非常奇怪的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的意思是認真的。有眼睛的人都能看出來，GME有兩種情況。\n熊。\n\n * 老手在這裏誰只是生病了， 認爲泡沫。\n   啪啪啪/擠擠擠，想讓大家都他媽的閉嘴。\n\n * 新的帳戶，出來的地方 只是爲了談論狗屎GME，和/或... ...",
      "title": "在其他什麼情況下，你會看到：大規模的審查和刪除某些主題，全新的賬戶在每條線程中都有相同的信息，在WSB中沒有發帖記錄的老賬戶突然變得活躍起來，只是爲了淡化某些東西，而不認爲這是非常非常奇怪的。"
    }
  ],
  "title": "In what other scenario would you see: massive censorship and removal of certain topics, brand new accounts with the same kind of message in every thread, and older accounts with no post history in WSB suddenly becoming active JUST to downplay something, and NOT think that it was very, very odd?",
  "created_utc": 1612920198,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I mean seriously. Anyone with eyes can see that there are two kinds of GME bears:</p>\n\n<ul>\n<li><p>Old hands around here who are just sick of it, think the bubble popped/squeeze squozed and want people to shut the fuck up already.</p></li>\n<li><p>New accounts, coming out of nowhere just to talk shit about GME, and/or old accounts with little to no history posting here who are suddenly spending hours every day just trying to convince people to sell GME.</p></li>\n</ul>\n\n<p>Now, of those two kinds of people, which seems out of place? Which seems like it sort of came out of nowhere, with an agenda, and is spending a lot of time pushing that agenda?</p>\n\n<p>Two weeks ago GME shoots to the fuckin moon, then crashes. I would <em>expect</em> people with years-old accounts who are irritated at the massive explosion of dumbass new traders coming in here to say bearish things. I would <em>not</em> expect a shitload of new accounts to come out of <em>nowhere</em> just to push an anti-GME agenda. Particularly AFTER it already crashed.</p>\n\n<p>This is <em>weird</em>. Google trends for &quot;how to buy a Reddit account&quot; skyrocketed on those critical days when RH was fucking all of us without lube.</p>\n\n<p>How hard do you think it would be for a hedge fund worth billions to put about 100 interns on &quot;buy accounts and bots duty&quot;? Not  very fucking hard. How many people would be willing to sell their account for $1,000 (or $100, whatever, I don&#39;t know) if contacted? Probably a lot. It&#39;s not hard to make a new reddit account. Karma isn&#39;t worth money, but money is worth money.</p>\n\n<p>Is this a conspiracy theory? Yes, absolutely. <strong>I want to clarify that I don&#39;t necessarily believe that the shorts haven&#39;t covered already. I just think there&#39;s some weird shit going on socially here on this subreddit and it really seems like there&#39;s a clear anti-GME agenda being pushed by a demographic OTHER than the one you would expect (old gay bears).</strong> You need to make up your own mind about this. I&#39;m just saying-- if GME were really over a whole ass week ago, WHY sit around here and make post after post about how people should sell and are so stupid for holding? What&#39;s the point? You&#39;re going to tell me all of those new accounts are just bored people coming here specifically to preach an anti-GME message? Seems very fishy.</p>\n</div><!-- SC_ON -->",
  "score": 4888,
  "permalink": "/r/wallstreetbets/comments/lgevvc/in_what_other_scenario_would_you_see_massive/",
  "subreddit": "wallstreetbets",
  "id": "lgevvc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123220422
}