{
  "author": "hotchilidamo",
  "original_created_utc": 1636441545,
  "title": "‘A lot of coins pumping now won’t survive a bear market’ what does this really mean?",
  "created_utc": 1636464739,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey everyone, I don’t want to ruin the moment we’re all having in the market right now, but I keep seeing comments in this sub saying something like… in the next bear market most of these coins pumping right now won’t exist any more.</p>\n\n<p>Can someone explain this to me in more depth please.</p>\n\n<p>Does this mean that people currently invested in a coin will sell and the coin will ultimately drop super low in value? If that’s the case it will surely still exist though right?</p>\n\n<p>If you believe the hype in subs for each coin it seems there are many loyal investors willing to Hodl through a bear cycle, in which case despite a drop in price, the project would surely survive wouldn’t it?</p>\n\n<p>Or is the comment mainly in reference to meme coins only, where people are purely invested for returns and not the validity of the project itself, so a dip will trigger rats from a sinking ship.</p>\n\n<p>Or are there legit projects we would see disappearing? If so how would this happen and which are more in danger of that happening than others? Lower market caps?</p>\n\n<p>I’m still learning here, so I may well have missed something obvious.</p>\n</div><!-- SC_ON -->",
  "score": 265,
  "permalink": "/r/CryptoCurrency/comments/qpy6eq/a_lot_of_coins_pumping_now_wont_survive_a_bear/",
  "subreddit": "CryptoCurrency",
  "id": "qpy6eq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey everyone, I don’t want to ruin the moment we’re all having in the market\nright now, but I keep seeing comments in this sub saying something like… in the\nnext bear market most of these coins pumping right now won’t exist any more.\n\nCan someone explain this to me in more depth please.\n\nDoes this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、今の市場の盛り上がりを壊したくはないのですが\nしかし、私はこのサブサイトで、次の弱気な市場では、今勢いのあるコインのほとんどはもう存在しない、というようなコメントを見続けています。\n次の弱気な市場では、今出回っているコインのほとんどはもう存在しないだろう。\n\n誰かこのことをもっと詳しく説明してくれませんか？\n\nこれは...",
      "title": "今、ポンピングされている多くのコインは、弱気な市場では生き残れない」これは本当にどういうことなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我不想破坏我们现在在市场上的美好时光\n但我一直看到在这个分论坛上有一些评论说......在下一次熊市中\n在下一个熊市中，大多数现在正在抽水的硬币将不复存在。\n\n谁能更深入地给我解释一下这个问题呢？\n\n这是否...",
      "title": "现在的很多硬币都无法在熊市中生存，这到底是什么意思？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我不想破壞我們現在在市場上的美好時光\n但我一直看到在這個分論壇上有一些評論說......在下一次熊市中\n在下一個熊市中，大多數現在正在抽水的硬幣將不復存在。\n\n誰能更深入地給我解釋一下這個問題呢？\n\n這是否...",
      "title": "現在的很多硬幣都無法在熊市中生存，這到底是什麼意思？"
    }
  ]
}