{
  "author": "Many_Scratch2269",
  "original_created_utc": 1639513850,
  "title": "A bunch of bankers threatening to sue any exchange that tries to give people a reasonable interest rate is as miserable as it gets.",
  "created_utc": 1639524687,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It baffles me how Coinbase, Binance, Kraken and almost most other exchanges have some sort of restriction SPECIFICALLY for users from the United States. The SEC threatening to sue any exchange that tries to give people a liveable interest rate is unacceptable. &lt;/p&gt;\n\n&lt;p&gt;Absolutely NO ONE should have their money in a deposit account giving them an interest rate of 0.025% while the inflation rate is nearly &lt;strong&gt;7%.&lt;/strong&gt; A 10% Stablecoin interest rate is already 400 times higher than what most banks are offering. Banks know they can&amp;#39;t compete for shit, so they choose to sue any competition for as long as possible.&lt;/p&gt;\n\n&lt;p&gt;Almost every other western country in the world allow their citizens the freedom to choose where to deposit their money. The SEC threatening to sue any competition just shows how miserable and desperate they are.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 220,
  "permalink": "/r/CryptoCurrency/comments/rggjm1/a_bunch_of_bankers_threatening_to_sue_any/",
  "subreddit": "CryptoCurrency",
  "id": "rggjm1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It baffles me how Coinbase, Binance, Kraken and almost most other exchanges have\nsome sort of restriction SPECIFICALLY for users from the United States. The SEC\nthreatening to sue any exchange that tries to give people a liveable interest\nrate is unacceptable.\n\nAbsolutely NO ONE should have their…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "コインベース、バイナンス、クラーケン、その他ほとんどの取引所が、どのように\n米国からのユーザーに対して、何らかの制限を設けている。SEC\n生活できる金利を提供しようとする取引所を訴えると脅している。\nは許せない。\n\n絶対に誰も自分の...",
      "title": "銀行家の一団は、人々に妥当な金利を与えようとする取引所を訴えると脅しているが、これほど惨めなことはない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "令我困惑的是，Coinbase、Binance、Kraken和几乎大多数其他交易所都对来自美国的用户有某种限制。\n对来自美国的用户有某种专门的限制。美国证券交易委员会\n威胁要起诉任何试图给人们提供可行利息的交易所\n是不可接受的。\n\n绝对没有人应该让他们的...",
      "title": "一群银行家威胁要起诉任何试图给人们提供合理利率的交易所，这是最悲惨的事情。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "令我困惑的是，Coinbase、Binance、Kraken和幾乎大多數其他交易所都對來自美國的用戶有某種限制。\n對來自美國的用戶有某種專門的限制。美國證券交易委員會\n威脅要起訴任何試圖給人們提供可行利息的交易所\n是不可接受的。\n\n絕對沒有人應該讓他們的...",
      "title": "一羣銀行家威脅要起訴任何試圖給人們提供合理利率的交易所，這是最悲慘的事情。"
    }
  ]
}