{
  "author": "eleanor_konik",
  "original_created_utc": 1652130007,
  "title": "Cornwall was a major source of tin for the ancient world, but which of their trade partners sent coral?",
  "created_utc": 1652163375,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was reading &lt;a href=\"https://www.mentalfloss.com/article/86338/8-trade-routes-shaped-world-history\"&gt;this mentalfloss article&lt;/a&gt; about ancient trade routes, and am stumped by this unsourced paragraph:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;One such tin route flourished in the 1st millennium BCE. It stretched from the tin mines in Cornwall in the far southwest of Britain, over the sea to France, and then down to Greece and beyond. Evidence for this route is provided by the many hillforts that sprung up along the way as trading posts. Historians believe trade passed both ways up and down this route, as the hillforts provide evidence of exotic artifacts, including coral and gold.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The only major source of coral I&amp;#39;m really aware of is the Swahili coast, but I&amp;#39;m not sure I&amp;#39;ve ever seen many references to coral when reading about trade in antiquity. Amber, yes. Coral, not really. So who was sending coral all the way to Britain? Was this common? What kinds of coral artifacts were found in the hillforts?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/um16rg/cornwall_was_a_major_source_of_tin_for_the/",
  "subreddit": "AskHistorians",
  "id": "um16rg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was reading this mentalfloss article\n[https://www.mentalfloss.com/article/86338/8-trade-routes-shaped-world-history]\nabout ancient trade routes, and am stumped by this unsourced paragraph:\n\n> One such tin route flourished in the 1st millennium BCE. It stretched from the\n> tin mines in Cornwall in…"
}