{
  "author": "marchdk2016",
  "the_new_excerpt": "I’ve been lurking around the sub a good amount today and everybody seems to be\nconvinced Ada is some magical coin that will change the world and rocket to the\nmoon. I am here to clarify some things about Ada.\n\nAda is actually a small town in Ohio where Ohio Northern University is located,\nhome of…",
  "original_created_utc": 1614372895,
  "title": "Wanted to clear up some misinformation going around about Ada",
  "created_utc": 1614387942,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been lurking around the sub a good amount today and everybody seems to be convinced Ada is some magical coin that will change the world and rocket to the moon. I am here to clarify some things about Ada.</p>\n\n<p>Ada is actually a small town in Ohio where Ohio Northern University is located, home of the Polar Bears. They’re most well known for studying engineering and pharmacy. It’s a small private university where a year probably costs close to 50k per year so be prepared to sell an arm, a leg, and your soul to attend there if you don’t have a good scholarship or a trust fund.</p>\n\n<p>Nearest major down is Lima. If you haven’t heard of Lima, you’re probably not familiar with Ohio. If you haven’t heard of Ohio, you probably aren’t from the states. Ohio is in the Midwest region. When I say Midwest I actually mean the mid-east when looking at the country as a whole on the map, but we call it the Midwest because geography is stupid. </p>\n\n<p>If you have any additional questions or confusion about what Ada is, please ask away in the comments and I’ll do my best to answer them.</p>\n</div><!-- SC_ON -->",
  "score": 267,
  "permalink": "/r/CryptoCurrency/comments/lt7l69/wanted_to_clear_up_some_misinformation_going/",
  "subreddit": "CryptoCurrency",
  "id": "lt7l69",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937735131,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我今天在子网站上潜伏了很久，每个人都似乎\n每个人似乎都相信艾达是某种神奇的硬币，它将改变世界并将火箭送上月球。\n月球。我在这里要澄清一些关于艾达的事情。\n\n阿达实际上是俄亥俄州的一个小镇，俄亥俄州北方大学就在那里。\n的故乡...",
      "title": "想澄清一些四处流传的关于Ada的错误信息"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今天在子網站上潛伏了很久，每個人都似乎\n每個人似乎都相信艾達是某種神奇的硬幣，它將改變世界並將火箭送上月球。\n月球。我在這裏要澄清一些關於艾達的事情。\n\n阿達實際上是俄亥俄州的一個小鎮，俄亥俄州北方大學就在那裏。\n的故鄉...",
      "title": "想澄清一些四處流傳的關於Ada的錯誤信息"
    }
  ]
}