{
  "author": "throwaway1a2b3cdf",
  "the_new_excerpt": "Hi, I have a tough topic to ask about today. My mother has been going down a\ndeep rabbit hole of fascism and anti-semitism for a few years, and is too far\ngone to have a reasonable debate with. Today she said that the Jews have been at\nwar with \"us\" for 3000 years, and that they are responsible for…",
  "original_created_utc": 1618067796,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、今日は難しいテーマでお聞きします。私の母は、数年前からファシズムと反ユダヤ主義の深いウサギの穴に入り込んでいます。\n数年前からファシズムと反ユダヤ主義の深いうさぎの穴に落ちていて、合理的な議論をするにはあまりにも遠すぎます。\n合理的な議論をするにはあまりにも遠すぎます。今日、彼女は、ユダヤ人がずっと\n今日、彼女は、ユダヤ人は3000年前から「私たち」と戦争をしていて、彼らのせいで...",
      "title": "反ユダヤ主義の母との討論"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，我今天有一个很难的话题要问。我的母亲一直在走下坡路\n法西斯主义和反犹太主义的兔子洞深，几年来，太远了。\n去和她进行合理的辩论。今天她说，犹太人一直在... ...\n和 \"我们 \"打了3000年的仗，他们要为... ...",
      "title": "辩论我的反犹太主义母亲。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，我今天有一個很難的話題要問。我的母親一直在走下坡路\n法西斯主義和反猶太主義的兔子洞深，幾年來，太遠了。\n去和她進行合理的辯論。今天她說，猶太人一直在... ...\n和 \"我們 \"打了3000年的仗，他們要爲... ...",
      "title": "辯論我的反猶太主義母親。"
    }
  ],
  "title": "Debating my anti-semitic mother.",
  "created_utc": 1618087526,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi, I have a tough topic to ask about today.\nMy mother has been going down a deep rabbit hole of fascism and anti-semitism for a few years, and is too far gone to have a reasonable debate with. Today she said that the Jews have been at war with &quot;us&quot; for 3000 years, and that they are responsible for the fall of Rome. I understand that this is completely absurd, but I am not knowledgeable of anything past Julius Caesar, which is my favourite period to study. Furthermore, I have only a modest understanding of the basic history of the middle east. </p>\n\n<p>I&#39;m sorry if this is a sensitive subject for you guys, but I just want someone with a deep understanding of Roman Judea to give an explanation of the relationship between the Romans and the judeic peoples, and if that region played any influential role in the wider Roman empire.</p>\n\n<p>Thanks.</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/mo6l63/debating_my_antisemitic_mother/",
  "subreddit": "AskHistorians",
  "id": "mo6l63",
  "is_self": true,
  "media": null,
  "is_video": false
}