{
  "author": "AngelusNovus420",
  "original_created_utc": 1630105848,
  "title": "What is the consensus regarding the CIA's alleged ties to the '80s crack epidemic?",
  "created_utc": 1630179688,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>American investigative journalist Gary Webb argued in a series of controversial 1996 articles that the CIA was partly responsible for fueling the crack epidemic that tore through inner cities during the second half of the &#39;80s. The story was eventually disavowed by the newspaper in which it was published following intense media and political scrutiny, including federal investigations which rejected its central claims. Webb subsequently resigned and struggled to find employment as a journalist until his 2004 death, which was ruled a suicide. Here&#39;s how the story goes.</p>\n\n<p>The CIA covertly supported right-wing paramilitaries in Nicaragua known as &quot;Contras&quot; as part of its Cold War foreign policy. Many of their operatives were known drug traffickers, and involved with smuggling the cheap but highly addictive crack form of cocaine abroad. The CIA willingly turned a blind eye; be it only because that drug money was a significant source of revenue for the Contras. Official investigations into crack trafficking were systematically disrupted by the DOJ, which was aware of the Contra connection and sought to keep that uncomfortable truth under wraps.</p>\n\n<p>Basically? The CIA and other government agencies allegedly gave the Contras <em>carte blanche</em> to smuggle as much crack as they wished for geopolitical gains, and that policy inevitably resulted in a domestic social crisis which disproportionately affected working-class African-Americans. <em>Allegedly.</em></p>\n\n<p>What is the consensus among historians — if any — regarding the role of crack smuggling in CIA-Contra relations back in the 80s?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/pcydbv/what_is_the_consensus_regarding_the_cias_alleged/",
  "subreddit": "AskHistorians",
  "id": "pcydbv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "American investigative journalist Gary Webb argued in a series of controversial\n1996 articles that the CIA was partly responsible for fueling the crack epidemic\nthat tore through inner cities during the second half of the '80s. The story was\neventually disavowed by the newspaper in which it was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アメリカの調査報道ジャーナリストであるゲイリー・ウェブは、1996年に発表した一連の記事の中で\nアメリカの調査ジャーナリスト、ゲイリー・ウェブは、1996年に発表した一連の記事の中で、80年代後半に都心部で流行したクラックの蔓延にCIAが一役買っていると論じ、物議を醸した。\nこの記事は1996年に発表され、物議を醸しました。この記事は\n最終的には、記事を掲載した新聞社によって否定された。",
      "title": "80年代のクラック流行にCIAが関係していたと言われていますが、それについての見解は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "美国调查记者加里-韦伯（Gary Webb）在一系列具有争议性的\n1996年的一系列有争议的文章中指出，中情局对80年代后半期肆虐城市的快克流行病负有部分责任。\n在80年代后半期，快克流行病在城市中肆虐。这篇报道\n最终被刊登该文章的报纸否认了。",
      "title": "关于中情局被指与80年代快克流行病的关系，人们的共识是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "美國調查記者加里-韋伯（Gary Webb）在一系列具有爭議性的\n1996年的一系列有爭議的文章中指出，中情局對80年代後半期肆虐城市的快克流行病負有部分責任。\n在80年代後半期，快克流行病在城市中肆虐。這篇報道\n最終被刊登該文章的報紙否認了。",
      "title": "關於中情局被指與80年代快克流行病的關係，人們的共識是什麼？"
    }
  ]
}