{
  "author": "Master-namer-",
  "original_created_utc": 1648343480,
  "title": "I am missing the Covid lockdown days, is it weird?",
  "created_utc": 1648361837,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;After more than 2 years, Covid has finally weared off in my country and life has pretty much returned to normalcy. Returned to college after such a long time and don&amp;#39;t get me wrong, I am overwhelmingly happy, finally seeing my significant other everyday, going out, doing outdoor activities, it is so much fun. But in all this a small part of me is missing those lockdown days, no college, no routine, complete freedom to do anything at anytime, not seeing loads of stranger faces everyday, empty roads, an overall aura of silence, doing things at our own pace and comfort, it was awesome. Sometimes I wish we can go back to those day, like it&amp;#39;s disheartening to imagine, that might never return (don&amp;#39;t get me wrong, Covid was hell, but i am talking about how I perceived this time) &lt;/p&gt;\n\n&lt;p&gt;So there&amp;#39;s that, anyone else feeling this way?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/TooAfraidToAsk/comments/tp981m/i_am_missing_the_covid_lockdown_days_is_it_weird/",
  "subreddit": "TooAfraidToAsk",
  "id": "tp981m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "After more than 2 years, Covid has finally weared off in my country and life has\npretty much returned to normalcy. Returned to college after such a long time and\ndon't get me wrong, I am overwhelmingly happy, finally seeing my significant\nother everyday, going out, doing outdoor activities, it is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2年以上経って、ようやく私の国でもコビドを消耗し、生活が\nは、ほぼ平常に戻りました。久しぶりに大学に復帰し\n誤解を恐れずに言えば、私は圧倒的に幸せです。\n毎日、外出し、野外活動をしています。",
      "title": "Covidのロックダウンの日が恋しいのですが、変でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "经过两年多的时间，Covid终于在我国消失了，生活已经\n基本上恢复了正常状态。在这么长的时间之后，我回到了大学，不要误会我的意思。\n不要误会我的意思，我非常高兴，终于可以每天看到我的重要朋友了。\n我终于每天都能见到我的另一半，出去玩，做户外活动，这是...",
      "title": "我很怀念Covid禁闭的日子，这很奇怪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "經過兩年多的時間，Covid終於在我國消失了，生活已經\n基本上恢復了正常狀態。在這麼長的時間之後，我回到了大學，不要誤會我的意思。\n不要誤會我的意思，我非常高興，終於可以每天看到我的重要朋友了。\n我終於每天都能見到我的另一半，出去玩，做戶外活動，這是...",
      "title": "我很懷念Covid禁閉的日子，這很奇怪嗎？"
    }
  ]
}