{
  "author": "eeeeeep",
  "original_created_utc": 1651611448,
  "title": "Why is the US Supreme Court overwhelmingly Catholic (66%+) when the American populace is only around 20% Catholic?",
  "created_utc": 1651629504,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A quick preface: I am not American, I am not seeking an argument, I am not debating the legality or morality of any individual topic. &lt;/p&gt;\n\n&lt;p&gt;I am interested in the recent history that led to this trend. Wikipedia says that as many as seven of the justices are Catholic; definitely six. Is there a root to this ‘over-representation’? &lt;/p&gt;\n\n&lt;p&gt;Thank you for your input.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 334,
  "permalink": "/r/NoStupidQuestions/comments/uhpsvw/why_is_the_us_supreme_court_overwhelmingly/",
  "subreddit": "NoStupidQuestions",
  "id": "uhpsvw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A quick preface: I am not American, I am not seeking an argument, I am not\ndebating the legality or morality of any individual topic.\n\nI am interested in the recent history that led to this trend. Wikipedia says\nthat as many as seven of the justices are Catholic; definitely six. Is there a\nroot to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "簡単に前置きを。私はアメリカ人ではないし、議論を求めているわけでもありません。\n個々のトピックの合法性や道徳性を議論しているわけではありません。\n\n私は、このような傾向に至った最近の歴史に興味があるのです。ウィキペディアによると\nウィキペディアによると、判事のうち7人がカトリックであり、6人は間違いなくカトリックである。そこにルーツがあるのでしょうか？\nの根源は...",
      "title": "アメリカの人口のうち、カトリック教徒は20％程度しかいないのに、なぜアメリカの最高裁は66％以上と圧倒的にカトリック教徒が多いのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "简单的前言。我不是美国人，我不是在寻求争论，我不是在\n辩论任何个别话题的合法性或道德性。\n\n我对导致这一趋势的近期历史感兴趣。维基百科说\n多达七名大法官是天主教徒；肯定是六名。是否有一个\n根基，以...",
      "title": "为什么美国最高法院绝大多数是天主教徒（66%以上），而美国人口中的天主教徒只有20%左右？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "簡單的前言。我不是美國人，我不是在尋求爭論，我不是在\n辯論任何個別話題的合法性或道德性。\n\n我對導致這一趨勢的近期歷史感興趣。維基百科說\n多達七名大法官是天主教徒；肯定是六名。是否有一個\n根基，以...",
      "title": "爲什麼美國最高法院絕大多數是天主教徒（66%以上），而美國人口中的天主教徒只有20%左右？"
    }
  ]
}