{
  "author": "GhoulStoic",
  "the_new_excerpt": "I was driving through my apartment complex parking lot and I heard my car run\nover something, seemed like both front and rear tires. I don't even remember\nseeing the little chihuahua type dog run out in front of my car, it ran out from\nbehind a parked car and it had no leash on and I think it…",
  "original_created_utc": 1620613390,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "マンションの駐車場を車で走っていたら、車が何かを轢く音がしました。\n何かを轢いたような音がした。フロントとリアの両方のタイヤのようだった。私の車の前に小さなチワワのような犬が飛び出してきたのを見たことはありません。\n小さなチワワのような犬が私の車の前に飛び出してきたのを見たことも覚えていません。\n駐車している車の後ろから飛び出してきて、鎖もつけていなかったし、たぶん...。",
      "title": "私の車で犬を轢き殺してしまった。飼い主である10代の女の子とその父親の目の前で起きた出来事でした。その後、私はどうすればよかったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我开车经过我的公寓大楼停车场，我听到我的车碾过什么东西。\n我听到我的车碾过什么东西，似乎是前后轮胎。我甚至不记得\n我甚至不记得看到那只小吉娃娃式的狗跑到我的车前，它从一辆停着的车后面跑出来，没有戴狗链。\n它从一辆停着的汽车后面跑出来，它没有戴狗链，我想它...",
      "title": "刚刚用我的车撞死了一只狗。事情发生在十几岁的女孩主人和她父亲面前。之后我应该怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我開車經過我的公寓大樓停車場，我聽到我的車碾過什麼東西。\n我聽到我的車碾過什麼東西，似乎是前後輪胎。我甚至不記得\n我甚至不記得看到那隻小吉娃娃式的狗跑到我的車前，它從一輛停着的車後面跑出來，沒有戴狗鏈。\n它從一輛停着的汽車後面跑出來，它沒有戴狗鏈，我想它...",
      "title": "剛剛用我的車撞死了一隻狗。事情發生在十幾歲的女孩主人和她父親面前。之後我應該怎麼做？"
    }
  ],
  "title": "Just hit and killed a dog with my car. It happened in front of the teenage girl owner and her father. What should I have done after?",
  "created_utc": 1620639091,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was driving through my apartment complex parking lot and I heard my car run over something, seemed like both front and rear tires. I don&#39;t even remember seeing the little chihuahua type dog run out in front of my car, it ran out from behind a parked car and it had no leash on and I think it basically ran right in front of my bumper because I really don&#39;t remember seeing it at all just hearing it. I stop my car and get out and I see a little dog dying behind my car and the teenager girl is crying. Her dad (I think) was there and said I was driving too fast, I don&#39;t think I was.</p>\n\n<p>I stuck around for 5 long minutes while the girl was crying and calling people. The dad walked up to the dog and it kinda twitched a few times but seemed to be dying. There was blood and poop and it seemed like the dog got rolled beneath my front right and rear right tire. I took a couple pictures. A lot of cars drove by while I was standing by so to me it&#39;s pretty obvious the little dog should not have been in the drive way without a leash on with all the traffic. The dad again said I was driving too fast, I said I was driving slow.</p>\n\n<p>What should I have done? I didn&#39;t even apologize profusely or anything, didn&#39;t want to assume liability, may have just said sorry once while I stood there. How are these things supposed to be handled? After 5 mins I just got in my car and drove away.</p>\n\n<p>100% sober BTW. I was just on my way to buy some groceries. Happened in NV.</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/NoStupidQuestions/comments/n8ti80/just_hit_and_killed_a_dog_with_my_car_it_happened/",
  "subreddit": "NoStupidQuestions",
  "id": "n8ti80",
  "is_self": true,
  "media": null,
  "is_video": false
}