{
  "author": "whosjess",
  "the_new_excerpt": "Every single month when I get my period my areolas grow and they’re so big ive\ngenuinely never seen anyone else with this big of areolas unless they have\nextremely large breasts. Mine are more like small to medium so the boob to\nnipple ratio is way off. This has been an ongoing cycle. I’d say they…",
  "original_created_utc": 1623928114,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "毎月、生理になると乳輪が大きくなり、とても大きくなります。\nこんなに乳輪が大きい人は、よほど胸が大きい人でない限り見たことがありません。\nこんなに乳輪が大きい人は、よほど胸が大きい人でない限り見たことがありません。私の胸はどちらかというと小～中くらいなので、おっぱいと乳首の比率が違います。\n乳首とおっぱいの比率が全然違います。これは現在も続いています。私が言うには、彼らは...",
      "title": "大きな乳首は魅力的ではなく、なぜ私の乳首は成長し続けるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每个月当我来月经的时候，我的乳晕都会增长，而且非常大。\n我真的没有见过其他人有这么大的乳晕，除非他们有非常大的乳房。\n除非他们的乳房非常大。我的乳房更像是中小型的，所以乳房和乳头的比例很不协调。\n乳头的比例有很大偏差。这一直是一个持续的周期。我想说他们...",
      "title": "大乳头是否不吸引人，为什么我的乳头一直在增长？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每個月當我來月經的時候，我的乳暈都會增長，而且非常大。\n我真的沒有見過其他人有這麼大的乳暈，除非他們有非常大的乳房。\n除非他們的乳房非常大。我的乳房更像是中小型的，所以乳房和乳頭的比例很不協調。\n乳頭的比例有很大偏差。這一直是一個持續的週期。我想說他們...",
      "title": "大乳頭是否不吸引人，爲什麼我的乳頭一直在增長？"
    }
  ],
  "title": "Are big nipples unattractive and why do mine keep growing?",
  "created_utc": 1623955364,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Every single month when I get my period my areolas grow and they’re so big ive genuinely never seen anyone else with this big of areolas unless they have extremely large breasts. Mine are more like small to medium so the boob to nipple ratio is way off. This has been an ongoing cycle. I’d say they take up 60% of my breast and I feel extremely insecure. I feel like it’s uncommon to have such big areolas and I fear that at this rate they’ll take over my entire boob. I’m not in a relationship but when I get in one I’m scared my partner is gonna look at me like I’m weird and I get kinda anxious thinking abt it. Do people care about nipple size? Has anyone else experienced this? Is there anything I can do to stop this? Is this something I should stop stressing about? Would Nipple piercings help?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/o1unkp/are_big_nipples_unattractive_and_why_do_mine_keep/",
  "subreddit": "TooAfraidToAsk",
  "id": "o1unkp",
  "is_self": true,
  "media": null,
  "is_video": false
}