{
  "author": "EcologySeminars",
  "original_created_utc": 1637178585,
  "title": "My First Side Project: The first jobs platform focusing on NatureTech",
  "created_utc": 1637191482,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I built this platform out of frustration that I couldn&#39;t find any tech job boards that featured jobs for biodiversity and nature tech. NatureTech is in the early stages with many recently formed startups that haven&#39;t received the publicity they deserve. Emerging companies include companies tackling deforestation through satellite monitoring, harnessing AI to drive carbon capture and protect global forests. <a href=\"https://naturetech.io/\">https://naturetech.io</a></p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/qw7dcp/my_first_side_project_the_first_jobs_platform/",
  "subreddit": "SideProject",
  "id": "qw7dcp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I built this platform out of frustration that I couldn't find any tech job\nboards that featured jobs for biodiversity and nature tech. NatureTech is in the\nearly stages with many recently formed startups that haven't received the\npublicity they deserve. Emerging companies include companies…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このプラットフォームは、生物多様性やネイチャーテックに特化した技術系の求人情報サイトが見当たらないことへの不満から構築しました。\n生物多様性や自然に関する技術者の求人情報を掲載している技術系の転職サイトがないことに不満を感じ、このプラットフォームを作りました。ネイチャーテックは初期段階にあります。\nネイチャーテックは初期段階にあり、最近設立された多くのスタートアップがありますが、それらは相応の宣伝を受けていません。\nネイチャーテックは初期段階にあります。新興企業には、...",
      "title": "初めてのサイドプロジェクト。ネイチャーテックに特化した初の求人プラットフォーム"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我建立这个平台的原因是，我找不到任何以生物多样性为特色的技术招聘网站。\n我建立了这个平台，因为我找不到任何以生物多样性和自然技术工作为特色的技术招聘网站。自然科技正处于\n处于早期阶段，许多最近成立的初创公司还没有得到\n他们应该得到的宣传。新兴的公司包括公司...",
      "title": "我的第一个副业项目。第一个专注于自然技术的工作平台"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我建立這個平臺的原因是，我找不到任何以生物多樣性爲特色的技術招聘網站。\n我建立了這個平臺，因爲我找不到任何以生物多樣性和自然技術工作爲特色的技術招聘網站。自然科技正處於\n處於早期階段，許多最近成立的初創公司還沒有得到\n他們應該得到的宣傳。新興的公司包括公司...",
      "title": "我的第一個副業項目。第一個專注於自然技術的工作平臺"
    }
  ]
}