{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Tuesday, March 2, 2021\n\nStocks retreated on Tuesday, pulling back after rallying yesterday, underscoring\nhow volatile the market is right now. Market participants continue to focus on\nthe Treasury yields, a new coronavirus vaccine from Johnson & Johnson (JNJ), and\nadditional…",
  "original_created_utc": 1614721491,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾--2021年3月2日星期二\n\n周二股市回落，在昨日反弹后回调，凸显了\n现在市场的波动性有多大。市场参与者继续关注\n国债收益率、强生公司（JNJ）的新型冠状病毒疫苗，以及。\n补充...",
      "title": "以下是2021年3月2日（星期二）今天的市场回顾。请大家欣赏!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧--2021年3月2日星期二\n\n週二股市回落，在昨日反彈後回調，凸顯了\n現在市場的波動性有多大。市場參與者繼續關注\n國債收益率、強生公司（JNJ）的新型冠狀病毒疫苗，以及。\n補充...",
      "title": "以下是2021年3月2日（星期二）今天的市場回顧。請大家欣賞!"
    }
  ],
  "title": "Here is a Market Recap for today Tuesday, March 2, 2021. Please enjoy!",
  "created_utc": 1614737364,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Tuesday, March 2, 2021</strong></p>\n\n<p>Stocks retreated on Tuesday, pulling back after rallying yesterday, underscoring how volatile the market is right now. Market participants continue to focus on the Treasury yields, a new coronavirus vaccine from Johnson &amp; Johnson (JNJ), and additional stimulus from Washington. </p>\n\n<p>The yield on the 10-year Treasury yield retreated to hover below 1.45% after spiking to a one-year high of 1.61% last week. The swift rise in interest rates last week spooked equity investors last week, with rates reflecting inflationary fears and impacting both corporate and consumer borrowing costs. Last week, during his testimony to Congress, Chair of the Federal Reserve Jerome Powell tried to temper fears over higher rates and inflationary pressures. He said,  rising Treasury yields are a statement of confidence on the part of markets that we’ll have a robust and ultimately complete [economic] recovery.” Central Bank officials from the United Kingdom and Australia echoed Powell’s sentiments and committed to maintaining accommodative fiscal policies. </p>\n\n<p>Over the weekend, the US Food and Drug Administration (FDA) granted emergency use authorization to Johnson &amp; Johnson’s (JNJ) single-dose coronavirus vaccine, making it the third vaccine approved in the US.  <a href=\"https://www.jnj.com/johnson-johnson-announces-u-s-cdc-advisory-committee-recommends-first-single-shot-covid-19-vaccine-for-adults-18-and-older-in-u-s\">The company has already begun shipping its COVID-19 vaccine </a>and expects to deliver more than 100 million doses of the single-shot vaccines during the first half of 2021, including more than 20 million by the end of March. </p>\n\n<p>In Washington D.C., Senate Majority Leader Chuck Schumer said the Senate is scheduled to begin debating the $1.9 trillion stimulus bill that the House of Representatives recently passed this week, though he did not specify when a vote would be held. </p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>Rocket Mortgage (RKT) soared over 70% today, sending the stock to record highs and continuing a dizzying rally in the last few days. Shares were even halted at one point today. In a note to clients, S3 Analytics said, “RKT’s stock price and short selling activity is reminiscent of another recent high flying meme stock – GameStop Inc (GME). Both stocks saw their share price spike due to high retail buying interest (predominantly due to significant social media activity) and an options based gamma squeeze. Both stocks also had/have relatively high short interest and high stock borrow rates which imply strong short-selling demand and limited stock borrow supply.&quot;</li>\n<li>After posting strong earnings and rising more than 8% after-hours yesterday, Zoom’s (ZM) stock price cratered today, with the stock going from 8% up to more than 9% down in today’s session.</li>\n<li>After posting disappointing earnings, NIO’s stock also cratered today, falling more than 12% in today’s session.</li>\n<li>After the recent controversies, Alibaba (BABA) co-founder Jack MA is now the fourth richest person in China, falling from first place. </li>\n<li>In a memo to employees, Ant Group’s executive chairman Eric Jing said an IPO was still in the cards.</li>\n<li>Vizio Holdings, a maker of smart TVs, has filed for an IPO. The company has sold 82.2 million televisions and 11.8 million sound bars since its founding in 2002, the prospectus said.</li>\n<li>*<strong>Please note current stock prices were written in the morning pre-market and do not reflect intraday volatility.</strong></li>\n<li>C3 AI (AI) target raised by Needham &amp; Co from $193 to $195 at Buy. Stock currently around $121</li>\n<li>Broadcom (AVGO) target raised by Credit Suisse from $480 to $580 at Outperform. Stock currently around $490</li>\n<li>Biohaven Pharma (BHVN) target raised by Mizuho from $93 to $103 at Buy. Stock currently around $86</li>\n<li>Catalent (CTLT) target raised by Argus from $130 to $140 at Buy. Stock currently around $116</li>\n<li>Intuit (INTU) with a host of target raises. Consensus price target around $450 at Buy. Stock currently around $406</li>\n<li>Jazz Pharma (JAZZ) target raised by Piper Sandler frm $175 to $205 at Overweight. Stock currently around $169</li>\n<li>Logitech (LOGI) target raised by Morgan Stanley from $116 to $122 at Overweight. Stock currently around $107.50</li>\n<li>Oshkosh (OSK) with two target raises. Stock currently around $110. \n\n<ul>\n<li>Citigroup from $100 to $130 at Buy</li>\n<li>Raymond James from $100 to $125 at Outperform</li>\n</ul></li>\n<li>Palo Alto Networks (PANW) with two target raises. Stock currently around $367\n\n<ul>\n<li>Mizuho from $450 to $475 at Buy</li>\n<li>Argus from $410 to $440 at Buy</li>\n</ul></li>\n<li>Snapchat (SNAP) with a host of target raises. Consensus price target around $80 at Buy. Stock currently around $67</li>\n<li>Square (SQ) with a host of target raises. Consensus price target around $300 at Buy. Stock currently around $241</li>\n<li>Sarepta Therapeutics (SRPT) target raised by SVB Leerink from $125 to $126 at Outperform. Stock currently around $87</li>\n<li>Workday (WDAY) target raised by Jefferies Financial from $280 to $325 at Buy. Stock currently around $252</li>\n</ul>\n\n<p>“The true investor welcomes volatility ... a wildly fluctuating market means that irrationally low prices will periodically be attached to solid businesses.” - Warren Buffet</p>\n</div><!-- SC_ON -->",
  "score": 86,
  "permalink": "/r/stocks/comments/lwdcn5/here_is_a_market_recap_for_today_tuesday_march_2/",
  "subreddit": "stocks",
  "id": "lwdcn5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937744917
}