{
  "author": "Shawn_666",
  "original_created_utc": 1642707298,
  "title": "Was Pearl Harbor in any way a good decision for the Japanese?",
  "created_utc": 1642726090,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Axis leaders making poor decisions during World War II is nothing strange, but Pearl Harbor seems to be such a comically bad decision, one that makes absolutely no sense to me. To me it seems like they attacked one of the most powerful nations in the world at the time and guaranteed the addition of another enemy into the war. Is this just the value of hindsight or is there anything I&amp;#39;m missing that makes this decision make sense at the time?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 133,
  "permalink": "/r/AskHistorians/comments/s8r0wm/was_pearl_harbor_in_any_way_a_good_decision_for/",
  "subreddit": "AskHistorians",
  "id": "s8r0wm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Axis leaders making poor decisions during World War II is nothing strange, but\nPearl Harbor seems to be such a comically bad decision, one that makes\nabsolutely no sense to me. To me it seems like they attacked one of the most\npowerful nations in the world at the time and guaranteed the addition of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "第二次世界大戦中、枢軸国の指導者が誤った判断をすることは何も不思議なことではありませんが\n真珠湾攻撃は滑稽なほど悪い決断であり、その決断は意味をなさない。\n私にはまったく意味がわかりません。私には、彼らは最も重要な国の一つを攻撃したように思えます。\n当時、世界で最も強力な国であったこの国に、さらに...",
      "title": "真珠湾攻撃は、日本にとって良い決断だったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "轴心国领导人在二战期间做出糟糕的决定并不奇怪，但是\n珍珠港事件似乎是一个滑稽的错误决定，一个完全没有任何意义的决定。\n对我来说完全没有意义。对我来说，他们似乎攻击了一个最\n对我来说，他们似乎攻击了当时世界上最强大的国家之一，并保证了加入...",
      "title": "珍珠港事件对日本人来说是否是一个好的决定？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "軸心國領導人在二戰期間做出糟糕的決定並不奇怪，但是\n珍珠港事件似乎是一個滑稽的錯誤決定，一個完全沒有任何意義的決定。\n對我來說完全沒有意義。對我來說，他們似乎攻擊了一個最\n對我來說，他們似乎攻擊了當時世界上最強大的國家之一，並保證了加入...",
      "title": "珍珠港事件對日本人來說是否是一個好的決定？"
    }
  ]
}