{
  "author": "KatagirisDog",
  "the_new_excerpt": "I am a 17yo male in high school. Throughout my life I have ALWAYS been a low\nscorer. I'm unsure why, but every single standardized test I take I score really\nreally low. While I am an all A student, most the time I can only pass\ntests/quizzes that consist of slightly modified problems from a…",
  "original_created_utc": 1617926328,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "高校生の17歳の男性です。これまでの人生で、私は常に低いスコアラーでした。\nスコアラーです。なぜかはわかりませんが、標準化されたテストを受けるたびに、本当に低い点数を取ってしまいます。\n本当に低いのです。私はオールAの生徒ですが、ほとんどの場合、私が合格できるのは\n私はオールAの生徒ですが、ほとんどの場合、テストや小テストでは、ある問題を少し変えただけのものしか合格できません。",
      "title": "私は生まれつきのバカなのか？(真面目な話、説明を読んでください)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一名17岁的高中男生。纵观我的一生，我一直是一个低调的\n计分器。我不知道为什么，但每一个标准化测试我参加，我的分数真的很。\n真的很低。虽然我是一个全A的学生，但大多数时候我只能通过。\n测试/测验，包括稍加修改的问题，从...",
      "title": "我是不是天生就很笨？(严重的，请看描述)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一名17歲的高中男生。縱觀我的一生，我一直是一個低調的\n計分器。我不知道爲什麼，但每一個標準化測試我參加，我的分數真的很。\n真的很低。雖然我是一個全A的學生，但大多數時候我只能通過。\n測試/測驗，包括稍加修改的問題，從...",
      "title": "我是不是天生就很笨？(嚴重的，請看描述)"
    }
  ],
  "title": "Was I just born stupid? (serious, please read description)",
  "created_utc": 1617960638,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am a 17yo male in high school. Throughout my life I have ALWAYS been a low scorer. I&#39;m unsure why, but every single standardized test I take I score really really low. While I am an all A student, most the time I can only pass tests/quizzes that consist of slightly modified problems from a practice worksheet/notes. I have a really hard time &quot;inferring&quot; what a best solution would be. For example, I have a really hard time with problems asking &quot;based on the text how does x feel about y&quot;? In other words, I cannot just think up of the best solution, or ever see a best solution out of a set of certain answers. </p>\n\n<p>A lot of my friends do so much better than me in school, jobs, relationships, etc and most the time they seem like they do is seamlessly. I work and study every night for school/SAT and some of my buddies do jack and still get all A&#39;s and 1400-1500+ scores first try. The only reason I have good grades is because I work almost endlessly and just barely grasp concepts (plus online school has come in clutch). </p>\n\n<p>My parents have told me that they noticed I was a fairly low scorer even in my youth. While I was never behind on it, I never read or showed intrest in educational things such as that. They have and still wonder if I am on the spectrum, though. It does not help that my brother (he is on the spectrum) is extremely talented and does almost everything better than me. Both him and I are piano players, but he was playing year 6 stuff on his 3rd year while I am pretty bad compared to the time ive played for (and I practice consistently). He is much better at grasping acedemics, and if he actually had a work ethic in school I wouldn&#39;t doubt he could&#39;ve gone to Harvard. In conclusion, I am very slow at picking things up. </p>\n\n<p>I also struggle at almost anything strategy related. Whenever I play games such as Risk, Catan, etc. that involves planning and problem solving I almost always lose/fall behind. I am so incredibly bad at these things it makes me look, well, STUPID.  </p>\n\n<p>I could go on a rant of a lot of other things I just can&#39;t grasp but these are just main problems I have. Are these just signs that I was born unintelligent? I mean I don&#39;t think its wrong that some people are smarter than me. While I am jealous of some peoples intelligence, I don&#39;t think it should be stripped away from them just because its unfair. This sounds like a whine post, but I am just genuinely wondering what others think.</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/NoStupidQuestions/comments/mn4xwx/was_i_just_born_stupid_serious_please_read/",
  "subreddit": "NoStupidQuestions",
  "id": "mn4xwx",
  "is_self": true,
  "media": null,
  "is_video": false
}