{
  "author": "123helpmefrommyself",
  "the_new_excerpt": "If I understand correctly, what made New York City -- all five boroughs -- as\nwealthy as they are today is the natural harbor.\n\nWhat I'm struggling to understand is why Manhattan was where people were drawn\nto. If the harbor is indeed the sell, why not Brooklyn or Staten Island,\nsomething closer to…",
  "original_created_utc": 1619714302,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の理解が正しければ、ニューヨークの5つの行政区を今日のように豊かにしたのは\n私が理解に苦しむのは、なぜマンハッタンに人が集まるのかということです。\n\n私が理解に苦しむのは、なぜマンハッタンが人々を惹きつけるのかということです。\nのかということです。港が売り物ならば、なぜブルックリンやスタテンアイランドではないのか。\nもっと近いところで...",
      "title": "なぜニューヨーク市（マンハッタン）は、ブルックリンやスタテンアイランドよりも早く、そして豊かに発展したのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我理解正确的话，是什么让纽约市--所有五个区--像今天这样富裕？\n今天的财富是天然的港口。\n\n我很难理解的是，为什么曼哈顿是人们被吸引到的地方？\n到的地方。如果港口确实是卖点，为什么不是布鲁克林或斯塔滕岛。\n一些更接近...",
      "title": "为什么纽约市（曼哈顿）比布鲁克林或斯塔滕岛发展得更快、更繁荣？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我理解正確的話，是什麼讓紐約市--所有五個區--像今天這樣富裕？\n今天的財富是天然的港口。\n\n我很難理解的是，爲什麼曼哈頓是人們被吸引到的地方？\n到的地方。如果港口確實是賣點，爲什麼不是布魯克林或斯塔滕島。\n一些更接近...",
      "title": "爲什麼紐約市（曼哈頓）比布魯克林或斯塔滕島發展得更快、更繁榮？"
    }
  ],
  "title": "Why did the City of New York (Manhattan) develop faster and more prosperously than Brooklyn or Staten Island?",
  "created_utc": 1619735842,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If I understand correctly, what made New York City -- all five boroughs -- as wealthy as they are today is the natural harbor. </p>\n\n<p>What I&#39;m struggling to understand is why Manhattan was where people were drawn to. If the harbor is indeed the sell, why not Brooklyn or Staten Island, something closer to the ocean? Why sail a ship all the way into the harbor to Manhattan when you could stop in Bay Ridge, Staten Island, or even Long Island more quickly?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/n18e7n/why_did_the_city_of_new_york_manhattan_develop/",
  "subreddit": "AskHistorians",
  "id": "n18e7n",
  "is_self": true,
  "media": null,
  "is_video": false
}