{
  "author": "lifeandtimes89",
  "the_new_excerpt": "With everything thats going on with wsb and GME, we are getting an influx of\nnewbies and day traders on the sub trying to pump coins (DOGE etc) in the vain\nhopes that it will emulate what happened there.\n\nTHAT CANNOT HAPPEN!!!!\n\nPump and Dumps have been riff in the crypto world for a long time due…",
  "original_created_utc": 1611865239,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "伴随着WSB和GME的一切，我们得到了大量的\n新手和日间交易员在子上试图徒劳地注入硬币（DOGE等）。\n希望它能效仿那里的情况。\n\n这不可能发生!!!!。\n\nPump和Dumps已经在加密世界里闹腾了很久，由于...",
      "title": "看在F**K的份上，能不能发个贴子告诉新手不要再尝试PnD币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "伴隨着WSB和GME的一切，我們得到了大量的\n新手和日間交易員在子上試圖徒勞地注入硬幣（DOGE等）。\n希望它能效仿那裏的情況。\n\n這不可能發生!!!!。\n\nPump和Dumps已經在加密世界裏鬧騰了很久，由於...",
      "title": "看在F**K的份上，能不能發個貼子告訴新手不要再嘗試PnD幣？"
    }
  ],
  "title": "For the love of F**K can we get a pinned post telling newbies to stop trying to PnD coins?",
  "created_utc": 1611891395,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>With everything thats going on with wsb and GME, we are getting an influx of newbies and day traders on the sub trying to pump coins (DOGE etc) in the vain hopes that it will emulate what happened there.</p>\n\n<p>THAT CANNOT HAPPEN!!!!</p>\n\n<p>Pump and Dumps have been riff in the crypto world for a long time due to the lack of regulation and the fact it is a wild west, these are seriously frowned upon by the crypto community, organic growth is the only way crypto should move.</p>\n\n<p>Look at the circulating supply of DOGE, to get to 1 dollar it needs to have a market cap of 120 billion, the whole crypto market is just under 1 trillion</p>\n\n<p>What happened in Wall Street was a calculated bet that paid off, hedge funds had left themselves open for a long time and  in fairness this was long over due.</p>\n\n<p>Do not equate what&#39;s going on there with what should happen in crypto.</p>\n\n<p>Crypto Market != Wall Street.</p>\n\n<p>Anyway what do I know, I&#39;m just some idiot on an internet forum</p>\n</div><!-- SC_ON -->",
  "score": 411,
  "permalink": "/r/CryptoCurrency/comments/l77l7k/for_the_love_of_fk_can_we_get_a_pinned_post/",
  "subreddit": "CryptoCurrency",
  "id": "l77l7k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518527075
}