{
  "author": "Giant2005",
  "the_new_excerpt": "People often gift newcomers with the sage advice of \"Never invest more than you\ncan afford to lose\" and that advice is still as important as it has ever been.\n\nHowever, I do not believe the advice goes far enough, because it doesn't account\nfor the highly addictive nature of crypto. Once you start…",
  "original_created_utc": 1620108196,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "初心者には「失ってもよい額以上の投資をしてはいけない」というアドバイスがよくあります。\nこのアドバイスは、今も昔も変わらず重要なものです。\n\nしかし、私はこのアドバイスが十分ではないと思っています。\nというのも、暗号の中毒性の高さを考慮していないからです。一度始めると...",
      "title": "I see your \"Never Invest More Than What You Can Lose\" and Raise it to \"Consider Your Investment Already Lost\"."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "人们经常向新来者提供 \"永远不要投资超过你能承受的损失 \"的圣人建议。\n这条建议仍然和以前一样重要。\n\n然而，我认为这个建议还远远不够，因为它没有说明\n因为它没有考虑到加密货币的高度成瘾性。一旦你开始...",
      "title": "我看到你的 \"永远不要投资超过你可能失去的东西\"，并把它提高到 \"考虑你的投资已经失去\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們經常向新來者提供 \"永遠不要投資超過你能承受的損失 \"的聖人建議。\n這條建議仍然和以前一樣重要。\n\n然而，我認爲這個建議還遠遠不夠，因爲它沒有說明\n因爲它沒有考慮到加密貨幣的高度成癮性。一旦你開始...",
      "title": "我看到你的 \"永遠不要投資超過你可能失去的東西\"，並把它提高到 \"考慮你的投資已經失去\"。"
    }
  ],
  "title": "I See Your “Never Invest More Than What You Can Lose” and Raise It to \"Consider Your Investment Already Lost\"",
  "created_utc": 1620139447,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>People often gift newcomers with the sage advice of &quot;Never invest more than you can afford to lose&quot; and that advice is still as important as it has ever been.</p>\n\n<p>However, I do not believe the advice goes far enough, because it doesn&#39;t account for the highly addictive nature of crypto. Once you start earning, you never want to stop, and although the value of our portfolios might rise to the heavens, most of us will probably die long before we beat the addiction and actually spend our gains.</p>\n\n<p>So personally, I think the most realistic outlook is that you will never actually see any of the money you invest in to crypto ever again, making it for all intents and purposes lost the minute you made the investment. Having said that, it is money I am more than happy to spend (and as an unemployed person without any form of welfare to rely upon, I certainly fail to take even the more modest advice of not investing more than I can afford), because watching those numbers rise brings me way more excitement than anything I have ever experienced.</p>\n</div><!-- SC_ON -->",
  "score": 578,
  "permalink": "/r/CryptoCurrency/comments/n4hbh3/i_see_your_never_invest_more_than_what_you_can/",
  "subreddit": "CryptoCurrency",
  "id": "n4hbh3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380964320
}