{
  "author": "Agile-Egg-5681",
  "original_created_utc": 1640525012,
  "title": "Do you become a lurker when opinions on thread are opposite to your own?",
  "created_utc": 1640544907,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve been on Reddit long enough to know that having an opposite opinion to the group is a sure way to get lots of notifications that I’m wrong and being downvoted. Even when the group opinion is just opinion and mine are facts. It’s better to just lurk out of curiosity than get chewed out publicly.&lt;/p&gt;\n\n&lt;p&gt;Are there other lurkers out there who keep their voices out of a thread once it’s hit critical mass of popular opinion?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/rowuyj/do_you_become_a_lurker_when_opinions_on_thread/",
  "subreddit": "TooAfraidToAsk",
  "id": "rowuyj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve been on Reddit long enough to know that having an opposite opinion to the\ngroup is a sure way to get lots of notifications that I’m wrong and being\ndownvoted. Even when the group opinion is just opinion and mine are facts. It’s\nbetter to just lurk out of curiosity than get chewed out…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Redditを長くやっていると、みんなと反対の意見を持つことは、とても大切なことだと思います。\nという通知がたくさん来る。\nダウンボートされる。グループの意見が単なる意見で、私の意見が事実であってもです。それは\n叱られるくらいなら、興味本位で潜伏していたほうが......。",
      "title": "スレッドで自分と反対の意見が出たときに潜伏員になるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在Reddit上呆得够久了，知道有一个与群体意见相反的观点，那就是\n我在Reddit上呆得够久了，知道如果我的观点与这个群体相反，肯定会得到很多通知，说我是错的，并被降级。\n被降权。即使这个群体的意见只是意见，而我的意见是事实。这\n最好只是出于好奇而潜伏，而不是被嚼碎......",
      "title": "当主题上的意见与你自己的意见相反时，你会成为一个潜伏者吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在Reddit上呆得夠久了，知道有一個與羣體意見相反的觀點，那就是\n我在Reddit上呆得夠久了，知道如果我的觀點與這個羣體相反，肯定會得到很多通知，說我是錯的，並被降級。\n被降權。即使這個羣體的意見只是意見，而我的意見是事實。這\n最好只是出於好奇而潛伏，而不是被嚼碎......",
      "title": "當主題上的意見與你自己的意見相反時，你會成爲一個潛伏者嗎？"
    }
  ]
}