{
  "author": "ProgrammerChance8844",
  "original_created_utc": 1631645876,
  "title": "I researched Stellar Lumens XLM, here's what I found!",
  "created_utc": 1631669519,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>edit: this is my research/opinion, you could indiffer. Yes, I am fond of this project but I&#39;m not invested into them as I am unable to atm.</em></p>\n\n<p>To me Stellar is one of the most promising payment-oriented blockchains right now. They&#39;ve formed quite a lot of partnerships &amp; have been upgrading their network diligently.</p>\n\n<p>This is why I wanted to do a deep dive into Stellar, decided some people might be interested in it here. This is my first post on here as I was mostly a lurker, I stole this format from some other posts<sup>please spare me.</sup></p>\n\n<h1>What is Stellar</h1>\n\n<p>Stellar is a distributed payments network, looking to provide a fast, secure &amp; inexpensive cross-border payments solution. You can also use Stellar to issue your own tokens, NFTs &amp; you can ICO your own tokens.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/q7indygnjin71.jpg?width=900&amp;format=pjpg&amp;auto=webp&amp;s=5e74edcf2daa2f32f9e706905877a8c1173255cf\">Stellar Project Overview, Image from Stellar.org</a></p>\n\n<p>The Stellar network &amp; Stellar Foundation (SDF) were both launched in 2014. The network is fuelled by Stellar Lumens (XLM). XLM are used for the near instantaneous transactions on the Stellar blockchain.</p>\n\n<p>The real power of Stellar is that it can connect individuals, enterprises, financial institutions and other payment systems to move value securely, fast and for a fraction of the cost of traditional payment gateways.</p>\n\n<p>Another big goal from the SDF is to recreate the concept &amp; systems of modern day banking &amp; money. By creating a fully interoperable ecocsystem which can satisfy the needs for every financial entity out there. They also offer a wide selection of SDK (Software Development Kits) and APIs for developers seeking to build on Stellar.</p>\n\n<p>This might not be very interesting to you, this might seem like the things normal banks have been doing for years. However, the Stellar network is fully decentralized and it is heaps faster than other Blockchains &amp; traditional banking systems</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/trrwy2m8lin71.jpg?width=900&amp;format=pjpg&amp;auto=webp&amp;s=4739c0385bd683172227ec9573016dc820f51338\">Stellar Protocol Comparison. Image from Stronghold</a></p>\n\n<p>Stellar has a transaction time of 3-5 seconds with fees that cost the fraction of a cent. Try sending money internationally through your bank<sup>note: It took me around 3 business days and 20 GBP to send an international transfer worth around 300 GBP from the UK to a european country.</sup></p>\n\n<p>Most banks know that they need to upgrade their systems, European banks have been trying to make their systems interoperable for years but it&#39;s still not there yet. Most people familiar with banking systems &amp; architecture know that most systems still run COBOL under the hood and that banking institutions are very reluctant to upgrade.</p>\n\n<p>This is where Stellar shines in my opinion, with their own consensus protocol (Stellar Consensus Protcol, SCP) they implement these 4 key properties simultaneously</p>\n\n<ul>\n<li>Decentralization - No central authority is in control</li>\n<li>Low latency - Nodes can reach consensus in seconds</li>\n<li>Flexibility - Users have the freedom to trust any combination of parties they see fit. For instance, a small non-profit may play a key role in keeping much larger institutions honest.</li>\n<li>Security - Through various security protocols Stellar&#39;s blockchain stays safe whilst relying on digital signatures that are resistant to distributed attacks.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<h1>The Team</h1>\n\n<ul>\n<li>Jed McCaleb [Co-founder &amp; CTO] - Prior to co-founding Stellar, McCaleb founded and served as the CTO of the company Ripple until 2013. McCaleb is also known for creating the Mt. Gox bitcoin exchange</li>\n<li>Denelle Dixon [Execute Director &amp; CEO] - Previously Mozilla COO</li>\n<li>David Mazières [Founder &amp; Chief-Scientist] - David Mazières is a professor of Computer Science at Stanford University, where he leads the Secure Computer Systems research group and co-directs the Center for Blockchain Research and Future of Digital Currency Initiative. His research interests include Operating Systems and Distributed Systems, with a particular focus on security. He is also a co-founder of the Stellar Development Foundation.</li>\n</ul>\n\n<p>They have many more interesting people, view at: <a href=\"https://www.stellar.org/foundation/team\">https://www.stellar.org/foundation/team</a></p>\n\n<p>They also got some interesting advisors</p>\n\n<ul>\n<li>Naval Ravikant</li>\n<li>Patrick Collison (CEO of Stripe)</li>\n<li>Sam Altman</li>\n<li>Matt Mullenweg (Wordpress Founder)</li>\n</ul>\n\n<h1>Partnerships</h1>\n\n<p>Stellar has a lot, and I mean a lot of partnerships. I can&#39;t write about all of them in great detail as it&#39;d take too long. Here&#39;s some of them with a small writeup</p>\n\n<ul>\n<li><a href=\"https://www.stellar.org/blog/why-ibm-built-world-wire-on-stellar\">IBM World Wire built on Stellar</a> - IBM announced the launch of World Wire, a real-time global payments system built on the Stellar network.</li>\n<li><a href=\"https://www.stellar.org/press-releases/bitt-and-stellar-development-foundation-selected-as-finalists-for-the-global-cbdc-challenge\">Global CBDC Challenge Finalists</a> - Global fintech company, Bitt, and the Stellar Development Foundation (SDF) have been announced as one of 15 finalists for the Monetary Authority of Singapore’s (MAS) Global CBDC Challenge to develop and showcase retail central bank digital currency (CBDC) solutions.</li>\n<li><a href=\"https://www.stellar.org/press-releases/ukrainian-ministry-of-digital-transformation-to-develop-virtual-assets-and-to-facilitate-cbdc-infrastructure-with-the-stellar-development-foundation\">The Ministry of Digital Transformation of Ukraine Partnership</a> - The Ministry of Digital Transformation of Ukraine and the Stellar Development Foundation (SDF) signed a Memorandum of Understanding and Cooperation, within which they will work on the development of a strategy for virtual assets in Ukraine. <a href=\"https://twitter.com/StellarOrg/status/1433551469114970117/photo/1\">Ukrainian president going to SF</a></li>\n<li><a href=\"https://stellar.org/press-releases/stellar-development-foundation-enterprise-fund-invests-15-million-in-airtm\">SDF $15M fund in AirTM</a> - The Stellar Development Foundation (SDF) announced a $15 million USD Enterprise Fund investment in Mexico City-based Airtm, a blockchain and bank-connected digital wallet and peer-to-peer exchange platform that provides globally-connected dollar accounts to consumers and businesses throughout Latin America, and other emerging markets. <sup>Side note: My Venezuelan friend actually uses this on a regular basis, pretty cool to see them being involved in something people use often</sup></li>\n<li><a href=\"https://stellar.org/press-releases/wyre-announces-new-savings-api-powered-by-the-stellar-network\">Wyre Announces New Savings API powered by the Stellar Network</a></li>\n<li><a href=\"https://stellar.org/press-releases/usdc-is-live-on-the-stellar-network\">USDC is Live on the Stellar Network</a></li>\n</ul>\n\n<p>aside from the official partnerships, Stellar also hosts community funds where the community can vote to give grants to community apps. <a href=\"https://communityfund.stellar.org/current\">https://communityfund.stellar.org/current</a></p>\n\n<p>Some previous winners were:</p>\n\n<ul>\n<li>LOBSTR - Very good Stellar wallet</li>\n<li>COINQVEST - Enterprise payment processing</li>\n<li>Option- &amp; Yieldblox - DeFi protocols for Financial Derivatives and Lending</li>\n<li>&amp; more</li>\n</ul>\n\n<h1>Competition</h1>\n\n<p>Stellar has quite some competition from other blockchains but I think there&#39;s only a couple actual competitors (<strong>XDC, XRP, CELO</strong>).</p>\n\n<p>The way Stellar markets themselves &amp; the way they describe themselves is</p>\n\n<blockquote>\n<p>Creating equitable access to the global financial system</p>\n</blockquote>\n\n<p>This is not too specific which puts Stellar in a good spot in my opinion. Stellar welcomes anyone to build on their network, whether that is the Ukrainian Government&#39;s CBDC or someone wanting to accept Stellar/Stellar USDC for their shop. Because Stellar has an appeal to such a broad demographic I think it will see more uses than their competitors.</p>\n\n<p>For example <strong>XRP</strong> and <strong>XDC</strong> are both chains focussed on enterprises, though both facilitate many different financial operations on their blockchain they&#39;re not as inclusive as Stellar ultimately is. Really the same goes for <strong>CELO</strong> but just the other way around as it is focused on individuals rather than enterprises.</p>\n\n<p>Also a pretty nifty feature on Stellar is the <a href=\"https://cointelegraph.com/explained/dex-explained\">Stellar DEX</a> built into the Ledger.</p>\n\n<h1>Stellar Events</h1>\n\n<p>Stellar hosts many events (see: <a href=\"https://www.stellar.org/events\">https://www.stellar.org/events</a>)</p>\n\n<p>I highly suggest joining one. They have many diverse topics such as:</p>\n\n<ul>\n<li>Talk on Closing the gap on Financial Inclusion</li>\n<li>Several blockchain events summaries &amp; keynotes</li>\n<li>NFTs on Stellar</li>\n<li>Fintech in Africa</li>\n<li>AMA&#39;s</li>\n</ul>\n\n<p>And to me the best one is <a href=\"https://meridian.stellar.org/\">Stellar Meridian</a>.</p>\n\n<blockquote>\n<p>Meridian 2021 will serve as a forum for experts in finance, policy, and technology from within and beyond the Stellar community to discuss exciting developments on the network and in the broader industry.</p>\n</blockquote>\n\n<p>They have some really interesting speakers such as</p>\n\n<ul>\n<li>Jed McCaleb</li>\n<li>Tori Samples</li>\n<li>Ioannis Giannaros</li>\n<li>Denelle Dixon</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 162,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/RstpwFa3xTeolkyk2CH2TDu3UeWjiLmv5TWaCu8kkOY.jpg?auto=webp&s=0c14c0857236487516d55a2d6e1735e637e10380",
          "width": 1200,
          "height": 650
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/RstpwFa3xTeolkyk2CH2TDu3UeWjiLmv5TWaCu8kkOY.jpg?width=108&crop=smart&auto=webp&s=52c7d250a98ac24d97a6526802bf4dd076b9eedd",
            "width": 108,
            "height": 58
          },
          {
            "url": "https://external-preview.redd.it/RstpwFa3xTeolkyk2CH2TDu3UeWjiLmv5TWaCu8kkOY.jpg?width=216&crop=smart&auto=webp&s=130051721d20889a033a5563ec65b6721e6f17c0",
            "width": 216,
            "height": 116
          },
          {
            "url": "https://external-preview.redd.it/RstpwFa3xTeolkyk2CH2TDu3UeWjiLmv5TWaCu8kkOY.jpg?width=320&crop=smart&auto=webp&s=4745f1fe54f10ac7667e5988e9ca0e8b4db0a5f6",
            "width": 320,
            "height": 173
          },
          {
            "url": "https://external-preview.redd.it/RstpwFa3xTeolkyk2CH2TDu3UeWjiLmv5TWaCu8kkOY.jpg?width=640&crop=smart&auto=webp&s=fc17f871232d794b449b7bf4cf174c295de22ea5",
            "width": 640,
            "height": 346
          },
          {
            "url": "https://external-preview.redd.it/RstpwFa3xTeolkyk2CH2TDu3UeWjiLmv5TWaCu8kkOY.jpg?width=960&crop=smart&auto=webp&s=afd43f480c234b04e03cbb88b42f0f0b5e7bde4f",
            "width": 960,
            "height": 520
          },
          {
            "url": "https://external-preview.redd.it/RstpwFa3xTeolkyk2CH2TDu3UeWjiLmv5TWaCu8kkOY.jpg?width=1080&crop=smart&auto=webp&s=10e08ae8ff950baff2079e80e72f728bc96c259c",
            "width": 1080,
            "height": 585
          }
        ],
        "variants": {},
        "id": "1r7HJpv7-UFbnxyYrK7O20qbIVgNsAPLtaBk4B9-PDY"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/po94kv/i_researched_stellar_lumens_xlm_heres_what_i_found/",
  "subreddit": "CryptoCurrency",
  "id": "po94kv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "edit: this is my research/opinion, you could indiffer. Yes, I am fond of this\nproject but I'm not invested into them as I am unable to atm.\n\nTo me Stellar is one of the most promising payment-oriented blockchains right\nnow. They've formed quite a lot of partnerships & have been upgrading…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "edit: これは私の研究/意見であり、あなたは関心を持つことができます。はい、私はこのプロジェクトが好きです。\n私はこのプロジェクトが好きですが、今はできないので投資はしていません。\n\n私にとってStellarは、今最も有望な決済向けブロックチェーンの一つです。\nの一つです。彼らはかなり多くのパートナーシップを結び、アップグレードしてきました...",
      "title": "ステラルーメンのXLMについて調べてみました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：这是我的研究/意见，你可以不同意。是的，我很喜欢这个\n但我并没有对他们进行投资，因为我现在无法投资。\n\n对我来说，Stellar是目前最有前途的支付型区块链之一。\n现在。他们已经形成了相当多的伙伴关系，并一直在升级...",
      "title": "我研究了Stellar Lumens XLM，这是我的发现!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：這是我的研究/意見，你可以不同意。是的，我很喜歡這個\n但我並沒有對他們進行投資，因爲我現在無法投資。\n\n對我來說，Stellar是目前最有前途的支付型區塊鏈之一。\n現在。他們已經形成了相當多的夥伴關係，並一直在升級...",
      "title": "我研究了Stellar Lumens XLM，這是我的發現!"
    }
  ]
}