{
  "author": "Steingar",
  "original_created_utc": 1635938536,
  "title": "Why are US state capitals often smaller towns?",
  "created_utc": 1635947967,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As a non-American, it&#39;s easy to make assumptions about what state capitals are in the US based off the largest and most famous cities there: surely, one might assume, NY is NYC, California is LA, Washington is Seattle, Florida is Miami, Oregan is Portland, Louisiana is New Orleans, Illinois is Chicago, etc.</p>\n\n<p>However I was shocked to discover that in almost every state the capital is often a much smaller town that I&#39;ve rarely, if ever, heard of (NY is actually Albany, California is Sacremento, Washington is Olympia, Florida is Tallahassee, etc.)</p>\n\n<p>Now, there are some rare exceptions (Phoenix, Arizona and Salt Lake City, Utah notably) and I&#39;m sure every state has their specific reasons for choosing their state capitals, but are there any <strong>general trends</strong> or overarching historical reasons why big, notable cities seem to be spurned for the capital status?</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/AskHistorians/comments/qlsb2w/why_are_us_state_capitals_often_smaller_towns/",
  "subreddit": "AskHistorians",
  "id": "qlsb2w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As a non-American, it's easy to make assumptions about what state capitals are\nin the US based off the largest and most famous cities there: surely, one might\nassume, NY is NYC, California is LA, Washington is Seattle, Florida is Miami,\nOregan is Portland, Louisiana is New Orleans, Illinois is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アメリカ人ではない私にとって、アメリカの州都は、その州の最大の都市や有名な都市から推測するのが簡単です。\nアメリカの州都は、そこにある最大かつ最も有名な都市から推測するのは簡単です。\nNYはNYC、カリフォルニアはLA、ワシントンはシアトル、フロリダはマイアミ。\nNYはNYC、カリフォルニアはLA、ワシントンはシアトル、フロリダはマイアミ、オレゴンはポートランド、ルイジアナはニューオーリンズ、イリノイは...。",
      "title": "なぜアメリカの州都は小さな町が多いのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个非美国人，很容易对各州首府的情况作出假设。\n根据美国最大和最著名的城市，很容易对美国的州首府做出假设：当然，人们可能会\n假设，纽约是纽约市，加利福尼亚是洛杉矶，华盛顿是西雅图，佛罗里达是迈阿密。\n俄勒冈州是波特兰，路易斯安那州是新奥尔良，伊利诺伊州是...。",
      "title": "为什么美国的州首府往往是小城镇？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個非美國人，很容易對各州首府的情況作出假設。\n根據美國最大和最著名的城市，很容易對美國的州首府做出假設：當然，人們可能會\n假設，紐約是紐約市，加利福尼亞是洛杉磯，華盛頓是西雅圖，佛羅里達是邁阿密。\n俄勒岡州是波特蘭，路易斯安那州是新奧爾良，伊利諾伊州是...。",
      "title": "爲什麼美國的州首府往往是小城鎮？"
    }
  ]
}