{
  "author": "ClimbNL",
  "original_created_utc": 1637108601,
  "title": "Unpopulair opinion: Crypto-veterans treat NFT's the same way anti-crypto-people treat crypto",
  "created_utc": 1637123537,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There are alot of similarities, but the main thing I&#39;ve noticed is that people and &#39;veterans&#39; can&#39;t see the value of NFT(art). They see it as a pumped up hype that has value because it has value. They call it a bubble. </p>\n\n<p>I know the recent rise of NFT&#39;s and the rise of crypto/blockchain isn&#39;t comparable, yet the way people people react to it is very equal. </p>\n\n<p>I personally don&#39;t understand real-world art prices and don&#39;t understand NFT-art prices either. \nI&#39;m more curious to why it is treated the same way as early-days crypto. \nWhy is that?</p>\n</div><!-- SC_ON -->",
  "score": 256,
  "permalink": "/r/CryptoCurrency/comments/qvmcfj/unpopulair_opinion_cryptoveterans_treat_nfts_the/",
  "subreddit": "CryptoCurrency",
  "id": "qvmcfj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There are alot of similarities, but the main thing I've noticed is that people\nand 'veterans' can't see the value of NFT(art). They see it as a pumped up hype\nthat has value because it has value. They call it a bubble.\n\nI know the recent rise of NFT's and the rise of crypto/blockchain…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの類似点がありますが、私が気づいた主な点は、人々が\nベテランの方々は、NFT(アート)の価値を理解していません。彼らは、NFT（アート）を「価値があるから価値がある」という\n価値があるから価値がある。それを「バブル」と呼ぶのです。\n\n最近のNFTの台頭や、暗号・ブロックチェーンの台頭は知っていますが...。",
      "title": "人気のない意見。アンチクリプトの人がクリプトを扱うのと同じように、クリプトベターの人がNFTを扱う"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有很多相似之处，但我注意到的主要一点是，人们\n和 \"老兵 \"无法看到NFT（艺术）的价值。他们把它看成是一种抽风式的炒作\n有价值，因为它有价值。他们称其为泡沫。\n\n我知道最近NFT的崛起和加密货币/区块链的崛起...",
      "title": "不平凡的意见。隐婚者对待NFT的方式与反隐婚者对待隐婚者的方式相同"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有很多相似之處，但我注意到的主要一點是，人們\n和 \"老兵 \"無法看到NFT（藝術）的價值。他們把它看成是一種抽風式的炒作\n有價值，因爲它有價值。他們稱其爲泡沫。\n\n我知道最近NFT的崛起和加密貨幣/區塊鏈的崛起...",
      "title": "不平凡的意見。隱婚者對待NFT的方式與反隱婚者對待隱婚者的方式相同"
    }
  ]
}