{
  "author": "Dr_Maw",
  "original_created_utc": 1652011549,
  "title": "Do you think Sex education should be an entire module at School?",
  "created_utc": 1652028169,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I ask this question as I feel like the education system did a poor job of teaching sex education in my primary and secondary education school.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to blame them. However, I remember the two instances where I learn about sex. Once in primary school, where it talked about puperty, and once in class in secondary school where we went over safe sex, STD&amp;#39;s and all of that lovely stuff.&lt;/p&gt;\n\n&lt;p&gt;However, when it came to understanding how the male and female body was, I was clueless. I know the biology side relating to how the sperm and egg fertilise, but that was it.&lt;/p&gt;\n\n&lt;p&gt;But with regards to mistakes/ does and don&amp;#39;ts. I was clueless, still am to be fair. Especially that you should never blow into the vagina as it can be real bad. It&amp;#39;s something I&amp;#39;ve never done or thought of doing, but I can genuinely say my dumb ass in the moment could of potentially done. &lt;/p&gt;\n\n&lt;p&gt;Did you have a more comprehensive Sex Ed education?&lt;/p&gt;\n\n&lt;p&gt;Also do you agree about making it a full blow module in school. That&amp;#39;s has quizes, tests?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/NoStupidQuestions/comments/ul0aou/do_you_think_sex_education_should_be_an_entire/",
  "subreddit": "NoStupidQuestions",
  "id": "ul0aou",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I ask this question as I feel like the education system did a poor job of\nteaching sex education in my primary and secondary education school.\n\nI don't want to blame them. However, I remember the two instances where I learn\nabout sex. Once in primary school, where it talked about puperty, and once…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "教育制度が悪いことをしたように感じるので、この質問をします。\n私が通っていた初等・中等教育学校では、性教育についてあまりよく教えてくれなかったように思うからです。\n\n彼らを非難したいわけではありません。しかし、私が性教育について学んだ2つの事例を覚えています。\nを学びました。一度は小学校で、思春期について話し、もう一度は...。",
      "title": "性教育は学校の授業の一環であるべきだと思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我问这个问题是因为我觉得教育系统在我的小学和中学的性教育方面做得不好。\n在我的小学和中学教育中，性教育做得很差。\n\n我并不想责怪他们。然而，我记得有两次我学到了\n关于性的情况。一次是在小学，那里谈到了生理期，还有一次是...",
      "title": "你认为性教育应该是学校的一个完整模块吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我問這個問題是因爲我覺得教育系統在我的小學和中學的性教育方面做得不好。\n在我的小學和中學教育中，性教育做得很差。\n\n我並不想責怪他們。然而，我記得有兩次我學到了\n關於性的情況。一次是在小學，那裏談到了生理期，還有一次是...",
      "title": "你認爲性教育應該是學校的一個完整模塊嗎？"
    }
  ]
}