{
  "author": "joelmartinez6",
  "the_new_excerpt": "I wanted to write a series of posts regarding different investment styles, the\nportfolio allocations suggested by the styles, and the assumptions and hidden\nfactors underlying each style. For my first post I will start with the most\nboomer, r/investing [/r/investing], bogleheads investing style…",
  "original_created_utc": 1618706696,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この連載では、さまざまな投資スタイルと、そのスタイルによって提案されるポートフォリオの配分や\nスタイルによって提案されるポートフォリオ・アロケーション、そして各スタイルの基礎となる仮定や隠れた要因を\n要因について書きたいと思います。最初の投稿では、まず、最も人気のある\nboomer, r/investing [/r/investing], bogleheadsの投資スタイル...",
      "title": "投資のスタイル 第1回 ジャック・ボーグルとコモンセンス・インベストメンツ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想写一个系列文章，关于不同的投资风格，的。\n风格所建议的投资组合配置，以及假设和隐藏的风险。\n每种风格背后的因素。在我的第一篇文章中，我将从最重要的\n潮人、r/investing[/r/investing]、bogleheads投资风格... ...",
      "title": "投资风格第一部分。杰克-博格尔和常识性投资"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想寫一個系列文章，關於不同的投資風格，的。\n風格所建議的投資組合配置，以及假設和隱藏的風險。\n每種風格背後的因素。在我的第一篇文章中，我將從最重要的\n潮人、r/investing[/r/investing]、bogleheads投資風格... ...",
      "title": "投資風格第一部分。傑克-博格爾和常識性投資"
    }
  ],
  "title": "Investing Styles Part 1: Jack Bogle and Common Sense Investing",
  "created_utc": 1618711083,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I wanted to write a series of posts regarding different investment styles, the portfolio allocations suggested by the styles, and the assumptions and hidden factors underlying each style. For my first post I will start with the most boomer, <a href=\"/r/investing\">r/investing</a>, bogleheads investing style originating from followers of Jack Bogle the founder of Vanguard.</p>\n\n<p>Jack Bogle, are savior, taught us all a sure-fire way to compounding wealth, retirement, and financial freedom: buy Vanguard stock and bond ETFs and then tell everyone you know about the dangers of paying 75bps to ARK funds because of compound interest.</p>\n\n<p>Who am I to question historical 6-7% inflation adjusted returns in the S&amp;P500? As countless threads on <a href=\"/r/personalfinance\">r/personalfinance</a>, <a href=\"/r/investing\">r/investing</a>, and any of the financial independence subreddits have explained, if you just buy VTSAX in your 401K and IRA you will be rich eventually because Einstein says the most powerful force in the universe is compound interest.</p>\n\n<p>The first bit of these threads that piss me off are the advocates for full portfolio allocation to US stocks. When you go “Fuck it, 100% stocks” you lose the only free lunch available which is diversification. Jack Bogle knew this and also recommended an allocation to bonds. The idea is that bonds and stocks are not correlated and so by combining the two assets you can achieve a return without as much variance. But when US stocks have been bull running for over a decade it’s hard to accept some historically lower variance return, so there’s a recency bias for advocating higher percentage allocations to stocks.</p>\n\n<p>The reason that two uncorrelated assets one with higher mean returns (stocks) and one with lower mean returns (bonds) make sense to hold in a portfolio is because you don’t just care about mean return of the portfolio you also want low variance because higher variance means larger drawdowns which reduce compounding growth. Thus we are striving to be both mean and variance optimizers with our portfolios. I will dive deeper into mean-variance optimization and Markowitz portfolio theory when I cover Ray Dalio and risk-parity investing, but for now just remember more variance bad.</p>\n\n<p>So if we realize there’s a recency bias among the gurus of <a href=\"/r/investing\">r/investing</a> and allocate to both VTSAX and VBTLX are we good? The answer is maybe, if we are in a falling rate environment and the uncorrelation of stocks and bonds holds then that is very likely a good steady compounding portfolio. If you allocate in this way you are making a bet on the correlations of stocks and bonds, and a bet on the macro environment. Recently stocks and bonds have had correlated moves and this is not a clear bet just because it has generally held to be true over the past several decades.</p>\n\n<p>If you don’t want to take a view on the correlations of stocks and bonds going forward then you need a more complex portfolio that works in a variety of macro environments. In the next installment I will cover Ray Dalio’s All-Weather portfolio as an overview of risk-parity strategies which will attempt to address some of the shortcomings of the Bogle strategy but will still have its own shortcomings.</p>\n\n<p>Hopefully this wasn’t too boring a post, I plan to cover more active investment styles like George Soros in future installments but wanted to start with the passive popular styles since I see it the most often.</p>\n</div><!-- SC_ON -->",
  "score": 1048,
  "permalink": "/r/investing/comments/mt2tfk/investing_styles_part_1_jack_bogle_and_common/",
  "subreddit": "investing",
  "id": "mt2tfk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171524768
}