{
  "author": "epicbird2140",
  "the_new_excerpt": "Anytime this is bought up, people have to point out that it’s not racist to have\na preference. But it’s weird how people’s preferences seem to discard entire\nethnicities. “I’m not attracted to black women” seems weird to me because “black\nwomen” isn’t a single homogenous group. Are these preferences…",
  "original_created_utc": 1617387418,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "每当这件事被买通的时候，人们都要指出，这并不是种族主义的有\n一种偏好。但很奇怪的是，人们的喜好似乎会抛弃整个\n族。\"我不喜欢黑人女性 \"在我看来很奇怪，因为 \"黑\n女人 \"不是一个单一的同质群体。这些喜好...",
      "title": "约会喜好有种族偏见吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每當這件事被買通的時候，人們都要指出，這並不是種族主義的有\n一種偏好。但很奇怪的是，人們的喜好似乎會拋棄整個\n族。\"我不喜歡黑人女性 \"在我看來很奇怪，因爲 \"黑\n女人 \"不是一個單一的同質羣體。這些喜好...",
      "title": "約會喜好有種族偏見嗎？"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "この件が話題になるたびに、人々は、持っていることが人種差別ではないことを指摘しなければなりません。\n差別ではありません。しかし、人々の好みが民族全体を無視しているように見えるのは奇妙なことです。\n民族全体を切り捨てるように見えるのは不思議です。\"私は黒人女性に惹かれない」というのは、「黒人女性」が単一の均質なものではないため、私にとっては奇妙なことです。\nなぜなら、「黒人女性」は単一の均質なグループではないからです。この好みは...",
      "title": "デートの好みは人種的に偏っている？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "この件が話題になるたびに、人々は、持っていることが人種差別ではないことを指摘しなければなりません。\n差別ではありません。しかし、人々の好みが民族全体を無視しているように見えるのは奇妙なことです。\n民族全体を切り捨てるように見えるのは不思議です。\"私は黒人女性に惹かれない」というのは、「黒人女性」が単一の均質なものではないため、私にとっては奇妙なことです。\nなぜなら、「黒人女性」は単一の均質なグループではないからです。この好みは...",
      "title": "デートの好みは人種的に偏っている？"
    }
  ],
  "title": "Are dating preferences racially biased?",
  "created_utc": 1617468875,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Anytime this is bought up, people have to point out that it’s not racist to have a preference. But it’s weird how people’s preferences seem to discard entire ethnicities. “I’m not attracted to black women” seems weird to me because “black women” isn’t a single homogenous group. Are these preferences really as innocent as most people think?</p>\n\n<p>For instance asian men have more <a href=\"https://journals.sagepub.com/doi/full/10.1177/1536504218812869\">problems</a> dating on dating sites. They are also stereotyped to have small peckers and not be masculine. Steve Harvey has an opinion about <a href=\"https://youtu.be/WwWNWadAEKI\">it</a>. It’s troubling to call it just a preference when there are obvious cultural (mostly racist) factors that play into it. You can browse Grindr for a minute and have a “no asian” /“whites only” bio pop out.</p>\n\n<p>Black men and black women are also unfairly shafted in dating. Black women are the least desired on dating sites. They have been a historically marginalized group. Black men and women are stereotyped to be too masculine. </p>\n\n<p>It’s disturbing because the “racial preferences” are accepted in society. It’s we were looking for a new friend saying “sorry my preferences don’t include black people.” It’ll raise huge flags. But if its dating we chalk it up to “can’t change who you like” Shouldn’t we be more introspective into this problem?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TrueAskReddit/comments/miq4at/are_dating_preferences_racially_biased/",
  "subreddit": "TrueAskReddit",
  "id": "miq4at",
  "is_self": true,
  "media": null,
  "is_video": false
}