{
  "author": "believeinapathy",
  "the_new_excerpt": "I need to understand now. I watched it rise from ~#30 to now knocking a personal\nfavorite project of mine (LINK) out of top ten. So I decide, let me head over to\ntheta.tv see what this hypes about, I'm a big time twitch user ex-streamer let\nme see what's going on. Upon entering it's apparent there…",
  "original_created_utc": 1616503629,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我现在需要了解。我看着它从~#30上升到现在敲了一个个人。\n我最喜欢的项目（链接）的前十名。所以我决定，让我去\nTheta.tv看什么这hypes左右，我是一个大的时间twitch用户前流媒体让。\n我看看是怎么回事。一进门就发现... ...",
      "title": "现在THETA是十大币，谁能给我解释一下，一个只有~100个内容创作者和~2000个观众的流媒体服务币是如何成为十大币的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我現在需要了解。我看着它從~#30上升到現在敲了一個個人。\n我最喜歡的項目（鏈接）的前十名。所以我決定，讓我去\nTheta.tv看什麼這hypes左右，我是一個大的時間twitch用戶前流媒體讓。\n我看看是怎麼回事。一進門就發現... ...",
      "title": "現在THETA是十大幣，誰能給我解釋一下，一個只有~100個內容創作者和~2000個觀衆的流媒體服務幣是如何成爲十大幣的？"
    }
  ],
  "title": "Now that THETA is a top 10 coin, can somebody explain to me HOW a streaming service coin with only ~100 content creators and ~2000 viewers is a top 10 cryptocurrency?",
  "created_utc": 1616517796,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I need to understand now. I watched it rise from ~#30 to now knocking a personal favorite project of mine (LINK) out of top ten. So I decide, let me head over to theta.tv see what this hypes about, I&#39;m a big time twitch user ex-streamer let me see what&#39;s going on. Upon entering it&#39;s apparent there are almost NO users. From what I can see, it&#39;s hard to count higher then maybe 1-2k viewers on the ENTIRE SITE, and how many of those are just farming whatever currency is generated by watching?</p>\n\n<p>So I&#39;m like, well there&#39;s not a lot of users, what do they have for content creators? Well, I can&#39;t seem to count much higher then 100 from what I can see through the site (since honestly the layout and design is so bad). With the most watched live creator having a few hundred viewers with a steep drop off to sub 100.</p>\n\n<p>So, project shills, or just anybody with knowledge of this project, explain to me what is going on? Do people really think this crypto streaming platform is going to legitimately take on Twitch and their viewership? How is this a top 10 crypto project? It pretty much has no users/creators and in general strikes me as some type of vaporware with a poorly designed website. Is this a sign of a peaking bull market? People buying into an idea and not what&#39;s actually happening with the platform? It just gives me very end of 2017/Jan 2018 feelings.</p>\n</div><!-- SC_ON -->",
  "score": 1317,
  "permalink": "/r/CryptoCurrency/comments/mbdy5y/now_that_theta_is_a_top_10_coin_can_somebody/",
  "subreddit": "CryptoCurrency",
  "id": "mbdy5y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752816920
}