{
  "author": "Odd_Meeting5216",
  "original_created_utc": 1645873975,
  "title": "If you’re looking for a 100x here then you’re searching in the wrong place. Once you’ve read about it here, your 100x is long gone.",
  "created_utc": 1645886336,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Almost all 100x picks are by complete luck. It doesn’t matter how good or technically advanced the project is (as we’ve seen with zero utility coins like Doge and Shib).&lt;/p&gt;\n\n&lt;p&gt;Once a project has already gained popularity on subreddits like this one, it’s almost certain that you already missed out on a 100x&lt;/p&gt;\n\n&lt;p&gt;This doesn’t mean you still can’t profit from popular coins on this sub. But don’t expect 4 digit % gains.&lt;/p&gt;\n\n&lt;p&gt;The problem is that investing in still unpopular startups could be very risky. You risk rug pulls or scams since this market is completely unregulated.\nAnd while there are exceptions with projects with insurance backing like Solanaprime and others that can mitigate such risks, for the most part it will be risky otherwise.&lt;/p&gt;\n\n&lt;p&gt;The important thing is to not get impulsive and let FOMO take control over you. Always make educated guesses and well thought out investments. This is the only reliable way to make profit long term.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 328,
  "permalink": "/r/CryptoCurrency/comments/t1us43/if_youre_looking_for_a_100x_here_then_youre/",
  "subreddit": "CryptoCurrency",
  "id": "t1us43",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Almost all 100x picks are by complete luck. It doesn’t matter how good or\ntechnically advanced the project is (as we’ve seen with zero utility coins like\nDoge and Shib).\n\nOnce a project has already gained popularity on subreddits like this one, it’s\nalmost certain that you already missed out on a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "100倍ピックのほとんどは、完全に運によるものです。どんなに良いものでも\nプロジェクトが技術的に高度なものであること（実用性ゼロのコインで見てきたように\nDogeやShib)。\n\nこのようなサブレディットですでに人気を博しているプロジェクトは\nすでに乗り遅れているのはほぼ確実で...。",
      "title": "もし、ここで100倍を求めるなら、それは間違った場所で検索していることになります。ここで読んだら、あなたの100倍はとっくに終わっています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几乎所有的100倍选票都是完全靠运气。不管项目有多好或\n项目有多好，技术有多先进，都无关紧要（正如我们所看到的零效用币如\nDoge和Shib）。\n\n一旦一个项目已经在像这样的分论坛上获得了人气，它就会\n几乎可以肯定，你已经错过了一个...",
      "title": "如果你在这里寻找100倍，那么你就找错地方了。一旦你在这里读到它，你的100倍早已消失。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾乎所有的100倍選票都是完全靠運氣。不管項目有多好或\n項目有多好，技術有多先進，都無關緊要（正如我們所看到的零效用幣如\nDoge和Shib）。\n\n一旦一個項目已經在像這樣的分論壇上獲得了人氣，它就會\n幾乎可以肯定，你已經錯過了一個...",
      "title": "如果你在這裏尋找100倍，那麼你就找錯地方了。一旦你在這裏讀到它，你的100倍早已消失。"
    }
  ]
}