{
  "author": "mynameiszx",
  "the_new_excerpt": "Started \"investing\" ~6 months back due to covid lockdowns and having nothing\nbetter to do, I have not invested prior to this. Spent the first 2 months losing\nmoney slowly in a local REIT while I refined my thoughts, then turned my 55k\ninto 1.2m after exiting the REIT\n\nIn no particular order of…",
  "original_created_utc": 1613373613,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "开始 \"投资\"〜6个月前，由于covid锁定和没有什么。\n比较好做，在这之前我没有投资过。前2个月的时间里，亏损了\n钱在当地的房地产信托基金中慢慢积累，同时我完善了自己的想法，然后把我的5.5万\n退出房地产信托基金后变成120万\n\n排名不分先后...",
      "title": "6万到120万，用了4个月。这一路走来，我学到了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "開始 \"投資\"〜6個月前，由於covid鎖定和沒有什麼。\n比較好做，在這之前我沒有投資過。前2個月的時間裏，虧損了\n錢在當地的房地產信託基金中慢慢積累，同時我完善了自己的想法，然後把我的5.5萬\n退出房地產信託基金後變成120萬\n\n排名不分先後...",
      "title": "6萬到120萬，用了4個月。這一路走來，我學到了什麼？"
    }
  ],
  "title": "60k to 1.2m in 4 months. What I learnt along the way",
  "created_utc": 1613378331,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Started &quot;investing&quot; ~6 months back due to covid lockdowns and having nothing better to do, I have not invested prior to this. Spent the first 2 months losing money slowly in a local REIT while I refined my thoughts, then turned my 55k into 1.2m after exiting the REIT</p>\n\n<p><strong>In no particular order of importance</strong></p>\n\n<ul>\n<li>Be very honest with yourself, see things for what they are. There should be no emotional attachment to stocks, do not make excuses for the stocks you hold or are planning to buy. I come out with a mental thesis and anti-thesis For &amp; Against for every move I make</li>\n<li>There are 4 main things that move stocks, Fundamentals, FOMO, Social Hype &amp; ARK Invest. Ideally, the stocks you pick should have as many of the above as possible with good catalysts in the pipeline.</li>\n<li>Diversification is for hedge fund, really rich people, or fools. Reason being your #2 pick will always have something weaker than your #1, and by the time you get down to #10, you might be simply buying a stock simply because you think you have the need to diversify</li>\n<li>Be very careful of WSB pumps on stocks with almost 0 fundamentals. Only play with money you can lose and if you think you&#39;re in early</li>\n<li>Know your strengths, I tried my hands at &quot;day-trading&quot;, and came to the conclusion that I&#39;m no day      trader. I stick purely to what works for me now.</li>\n<li>Social media (reddit, stock twits, youtube etc) is a good way to get info or tickets, but ALWAYS do your own DD. Never buy anything you are not confident in</li>\n<li>Buy on red days when people are fearful. There is nothing I love more than a red day when you are confident in your picks.</li>\n<li>Don&#39;t bother with dividend plays and mega caps, those are too slow.</li>\n</ul>\n\n<p>My goal? Turn my current $1.2m into $10m so I can buy my parents a nice home and car. Living very frugally meanwhile.</p>\n\n<p><strong>Current positions</strong></p>\n\n<ol>\n<li>75% Portfolio - Nano Dimensions</li>\n<li>25% Portfolio - Cinedigm</li>\n</ol>\n\n<p>Looking for 50:50 once NN-DM burst after their acquisitions. Lots of DD on those on the web, won&#39;t go  in-depth</p>\n</div><!-- SC_ON -->",
  "score": 63,
  "permalink": "/r/stocks/comments/lk8cu2/60k_to_12m_in_4_months_what_i_learnt_along_the_way/",
  "subreddit": "stocks",
  "id": "lk8cu2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728624073
}