{
  "author": "EmeraldAlchemist",
  "original_created_utc": 1654641667,
  "title": "Piggy banks: How did pigs become the standard/most widely recognized shape for personal coin banks?",
  "created_utc": 1654661955,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I haven’t posted here before, so I hope I have followed the rules. As the title indicates, I’m curious as to why piggy banks came to be pig-shaped, as I can’t think of an obvious explanation for it despite how common they are. This is mainly directed at historians of the United States and Western Europe, although for all I know there may be influences from elsewhere in the world. Googling didn’t help me much beyond telling me that piggy banks became popular around the 1940s-1950s in the US.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 124,
  "permalink": "/r/AskHistorians/comments/v7a0f0/piggy_banks_how_did_pigs_become_the_standardmost/",
  "subreddit": "AskHistorians",
  "id": "v7a0f0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I haven’t posted here before, so I hope I have followed the rules. As the title\nindicates, I’m curious as to why piggy banks came to be pig-shaped, as I can’t\nthink of an obvious explanation for it despite how common they are. This is\nmainly directed at historians of the United States and Western…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここに投稿するのは初めてなので、ルールに則っていればいいのですが。タイトルにあるように\nなぜ、貯金箱が豚の形になったのかが気になります。\nなぜ豚の形なのか？これは\n主にアメリカや西洋の歴史家の方に向けたものですが...。",
      "title": "貯金箱 ブタが個人用貯金箱の定番／最も広く認知されている形状になったのはなぜか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我以前没有在这里发过帖，所以我希望我遵守了规则。正如标题所显示的\n我很好奇为什么存钱罐会是猪的形状，因为我想不出一个明显的解释。\n因为我想不出一个明显的解释，尽管它们是如此普遍。这篇文章\n主要是针对美国和西方的历史学家。",
      "title": "储蓄罐。猪是如何成为个人存钱罐的标准/最广泛认可的形状的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我以前沒有在這裏發過帖，所以我希望我遵守了規則。正如標題所顯示的\n我很好奇爲什麼存錢罐會是豬的形狀，因爲我想不出一個明顯的解釋。\n因爲我想不出一個明顯的解釋，儘管它們是如此普遍。這篇文章\n主要是針對美國和西方的歷史學家。",
      "title": "儲蓄罐。豬是如何成爲個人存錢罐的標準/最廣泛認可的形狀的？"
    }
  ]
}