{
  "author": "rootpl",
  "original_created_utc": 1657435408,
  "title": "Crypto investing from a perspective of someone who doesn't care about crypto at all.",
  "created_utc": 1657506208,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s great how non-tech savvy people who don&amp;#39;t know anything about tech or crypto simply don&amp;#39;t care. They don&amp;#39;t spend time on reddit. They don&amp;#39;t follow any influencers. They don&amp;#39;t use Twitter, YT etc.&lt;/p&gt;\n\n&lt;p&gt;We always talk about how we shouldn&amp;#39;t be introducing family or friends inco crypto. And I always avoided it, the only person I&amp;#39;ve talked to about is my wife for obvious reasons. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never mentioned investing her own money. But my wife was very adamant to buy some crypto for her and she basically told me: &amp;quot;tell me when it doubled&amp;quot; uhm... OK honey. &lt;/p&gt;\n\n&lt;p&gt;So that&amp;#39;s what I did. She gave me cash, I bought some crypto for her and let it sit, she never talked about it again, she never asked, she never mentioned any news etc. and it was in the middle of the bull run. Anyway, it increased by 100% in few months and I told her about it. And she was like &amp;quot;great now sell it, sell it all&amp;quot; and I&amp;#39;m like whelp, OK. She took the money and we never spoke about it again, it was incredible. She had a plan to double the money and then cash out. She forgot about it for a long time. And because she only invested what she could afford to lose she was never woried. To her that money was basically burned and forgotten. She didn&amp;#39;t want 5x or 10x or 100x it, she simply doubled it and that&amp;#39;s it. She had a clear target. I think one of the reasons why she was so calm about it was simply because she never followed any news. &lt;/p&gt;\n\n&lt;p&gt;I think a lot of people here would benefit with similar approach to investing. As long as they invest only what they can really afford to lose in case if things go south.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 352,
  "permalink": "/r/CryptoCurrency/comments/vvlkz6/crypto_investing_from_a_perspective_of_someone/",
  "subreddit": "CryptoCurrency",
  "id": "vvlkz6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It's great how non-tech savvy people who don't know anything about tech or\ncrypto simply don't care. They don't spend time on reddit. They don't follow any\ninfluencers. They don't use Twitter, YT etc.\n\nWe always talk about how we shouldn't be introducing family or friends inco\ncrypto. And I always…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "技術に詳しくない人たちが、いかにして技術や\n技術や暗号について何も知らない人たちが、単に気にしないのは素晴らしいことです。彼らはredditで時間を費やすことはありません。どのような\nインフルエンサーをフォローしない。TwitterやYTなどを利用しない。\n\n私たちはいつも、家族や友人に暗号を紹介するべきではないと話しています。\n暗号化されています。そして私はいつも...",
      "title": "暗号に全く興味のない人から見た暗号投資。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不懂技术的人不懂技术，不懂技术的人不懂技术，这很好。\n币的人根本就不关心。他们不花时间上reddit。他们不关注任何\n影响者。他们不使用Twitter和YT等。\n\n我们总是谈论我们不应该向家人或朋友介绍加密货币。\n币。而我总是...",
      "title": "从一个完全不关心加密货币的人的角度来看加密货币投资。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不懂技術的人不懂技術，不懂技術的人不懂技術，這很好。\n幣的人根本就不關心。他們不花時間上reddit。他們不關注任何\n影響者。他們不使用Twitter和YT等。\n\n我們總是談論我們不應該向家人或朋友介紹加密貨幣。\n幣。而我總是...",
      "title": "從一個完全不關心加密貨幣的人的角度來看加密貨幣投資。"
    }
  ]
}