{
  "author": "yourmeanestfriend",
  "original_created_utc": 1639143400,
  "title": "What’s the deal with porn having so much incest/family sex?",
  "created_utc": 1639153650,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ll open a porn site and most of the videos have step mom, step daughter, dad, and other in the title. Sometimes I get horny looking at the trailers and then I realize they’re supposedly brother and sister and it turns me off, because that makes me think of sex with my family and it grosses me out like eww.\nWhat’s up with porn being obsessed with this topic? Does the audience ask for this? Is it really this common? I don’t get it&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 120,
  "permalink": "/r/TooAfraidToAsk/comments/rd8tfr/whats_the_deal_with_porn_having_so_much/",
  "subreddit": "TooAfraidToAsk",
  "id": "rd8tfr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ll open a porn site and most of the videos have step mom, step daughter, dad,\nand other in the title. Sometimes I get horny looking at the trailers and then I\nrealize they’re supposedly brother and sister and it turns me off, because that\nmakes me think of sex with my family and it grosses me out…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ポルノサイトを開くと、ほとんどの動画に義理の母、義理の娘、お父さんがいる。\nなどがタイトルに含まれています。時々、予告編を見てムラムラするんですが、その時は\n兄と妹と思われる人たちだとわかると、気分が悪くなるんです。\n家族とのセックスを想像してしまい、気持ち悪くなってしまう...。",
      "title": "AVは近親相姦・家族のセックスが多いのは何でだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我打开一个色情网站，大多数视频都有继母、继女、父亲。\n和其他的标题。有时我看着预告片就觉得很兴奋，然后我意识到他们应该是兄妹，这让我很反感。\n然后我意识到他们应该是兄妹，这让我很反感，因为这让我想到了与家人的性行为。\n因为这让我想到了与家人的性行为，这让我感到恶心......",
      "title": "色情片有这么多乱伦/家庭性行为是怎么回事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我打開一個色情網站，大多數視頻都有繼母、繼女、父親。\n和其他的標題。有時我看着預告片就覺得很興奮，然後我意識到他們應該是兄妹，這讓我很反感。\n然後我意識到他們應該是兄妹，這讓我很反感，因爲這讓我想到了與家人的性行爲。\n因爲這讓我想到了與家人的性行爲，這讓我感到噁心......",
      "title": "色情片有這麼多亂倫/家庭性行爲是怎麼回事？"
    }
  ]
}