{
  "author": "Chihuahuagoes2",
  "the_new_excerpt": "First, I want to express my gratitude to the team moderating this sub - we can\nall agree that your work and attitude makes r/askhistorians [/r/askhistorians]\nundoubtedly the best place on Reddit.\n\nThis being said, I have a “meta” concern that does not seem to have been\naddressed in the rules but…",
  "original_created_utc": 1621794518,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず、このサブのモデレーターチームに感謝の意を表したいと思います。\nあなた方の仕事と姿勢がr/askhistorians [/r/askhistorians]をRedditで最高の場所にしていることは誰もが認めるところです。\n間違いなくRedditで最高の場所だと思います。\n\nそうは言っても、私は「メタ」な懸念を持っていて、それはルールでは扱われていないようですが\nルールには書かれていないようですが...",
      "title": "[META] 正確にはソープボックスではなく、歴史家が検証できないような前提条件を持つ負荷の高い質問。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我想对这个分站的版主团队表示感谢。\n我们都同意，你们的工作和态度使r/askhistorians [/r/askhistorians]\n无疑是Reddit上最好的地方。\n\n既然如此，我有一个 \"元 \"问题，似乎没有在规则中得到解决\n规矩中，但...",
      "title": "[META]加载的问题，不完全是肥皂泡，但有不能被历史学家验证的前提。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我想對這個分站的版主團隊表示感謝。\n我們都同意，你們的工作和態度使r/askhistorians [/r/askhistorians]\n無疑是Reddit上最好的地方。\n\n既然如此，我有一個 \"元 \"問題，似乎沒有在規則中得到解決\n規矩中，但...",
      "title": "[META]加載的問題，不完全是肥皂泡，但有不能被歷史學家驗證的前提。"
    }
  ],
  "title": "[META] Loaded questions that are not exactly soapboxing but have premises that cannot be verified by a historian.",
  "created_utc": 1621802920,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First, I want to express my gratitude to the team moderating this sub - we can all agree that your work and attitude makes <a href=\"/r/askhistorians\">r/askhistorians</a> undoubtedly the best place on Reddit.</p>\n\n<p>This being said, I have a “meta” concern that does not seem to have been addressed in the rules but makes me feel uneasy. This post is my way to draw attention to this issue:</p>\n\n<p>Two of the most popular recent posts on the subreddit seem to have what I would call a dubious premise:</p>\n\n<p>Topic 1: <a href=\"https://www.reddit.com/r/AskHistorians/comments/ndpx06/how_did_tracksuits_especially_the_ones_with/\">How did tracksuits (especially the ones with stripes on their sides) become an inherent part of Russian/East Slavic culture?</a>\nTopic 2: <a href=\"https://www.reddit.com/r/AskHistorians/comments/nj60qb/why_didnt_most_people_in_muslimmajority_countries/\">Why didn&#39;t most people in Muslim-majority countries grow detached from religion like they often did in Christian-majority countries?</a></p>\n\n<p>While I understand that I am not a source, the premise of Topic 1 seems very difficult to substantiate. How does OP know that Adidas is “inherent part” of Slavic culture? This question seems to be based on a popular meme that pokes fun at stereotypes about Eastern Europeans. The question in practice fails to see the difference between stereotypes, culture and current social facts. Frankly, suggesting that this stereotype is anything but an internet joke making fun of an old fashion trend felt unpleasantly dismissive.</p>\n\n<p>Of course the very educated answers in the thread focused on why the Adidas apparel brand was popular in the 90s - which is a fair approach to the history of that brand in Eastern Europe. At first I expected answers to mention the fact that the stereotype stated by OP as the “truth” may be faulty, but then I realised that people who answer may not be qualified to comment on or even spot the dubious premise. </p>\n\n<p>The reason is that the premise is not historical but cultural or sociological. A historian is not expected to know the current cultural background of a country or a region, or a group of people. The question is historical but the premise is current. So historians, being focused on history, cannot say whether the premise is true or false. They just identify the topic and tell its history. </p>\n\n<p>To give a more sinister example: OP may have asked why rape is a part of the culture of nation X. A historian has no way to tell whether rape currently plays any role in the culture of nation X but can tell what is the history of rape in that country. A historian is rarely equipped (nor is he expected to) to discuss the harmful stereotype portrayed as true in current popular discourse.</p>\n\n<p>Of course, when discussing tracksuits, the topic is lighthearted and fun, so no harm done - just raised eyebrows. When religion is involved, however, the stereotypes pushed in the premises of questions may be more troublesome</p>\n\n<p>Topic 2 - which is currently this sub’s top post - is much more worrying, as it reinforces what seems to be a harmful stereotype that the Muslim world is more religious and - as a result - as certain orange politicians would have you believe, not as “advanced”. It suggests that OP has collected data on religious attitudes and various group affiliations in the immensely huge “Muslim” world and reached the conclusion that Tunisians, for example, are more religious than Chileans. It is a premise that cannot be verified and just reinforces a stereotype. I know, again, that I am not a source but I know quite a lot of people from Muslim communities all over the world. None of them is overtly “religious”, while most are unabashed atheists. So a question I would ask in the subreddit would be “What made Muslim communities so atheistic compared to Orthodox Christian communities, which in my subjective experience, are extremely religious?”. I have no way of knowing how rampant atheism is in Muslim-majority countries - so my hypothetical question is as valid as today’s top thread in the sub. </p>\n\n<p>As with the Adidas question, I do not expect actual historians to be in a position to refute the premise raised by OP. A historian is best equipped to identify the topic (development of religious attitudes in Muslim-majority countries through history) and write about this. A historian has no way of comparing current religious attitudes between, for example, Azerbaijan and Mongolia.</p>\n\n<p>My point here is that some questions can reinforce harmful stereotypes - even if the asker and the replying historians have the best of intentions. While this is not exactly soapboxing, as there is no malicious intent, it is still a troubling issue.</p>\n\n<p>I am not sure how it can be addressed but I feel that it may pose serious problems to the sub down the road.</p>\n\n<p>This is from me -hope this helps. </p>\n\n<p>To the mods - keep up the good work, thank you very much for your work! To everybody else - keep giving those great questions and answers!</p>\n</div><!-- SC_ON -->",
  "score": 121,
  "permalink": "/r/AskHistorians/comments/njdtfp/meta_loaded_questions_that_are_not_exactly/",
  "subreddit": "AskHistorians",
  "id": "njdtfp",
  "is_self": true,
  "media": null,
  "is_video": false
}