{
  "author": "lenadelray",
  "original_created_utc": 1632437216,
  "title": "Women of Reddit, what symptoms of mental illness did you experience for a long time, before realizing it was related to mental illness?",
  "created_utc": 1632451064,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Whether or not you knew you had a mental illness, what things happen to you that you didn&#39;t connect to mental illness for a very long time? Why didn&#39;t you realize it was mental illness, and what caused you to make the connection? Emotional, mental, physical, professional,  interpersonal... Anything.</p>\n</div><!-- SC_ON -->",
  "score": 122,
  "permalink": "/r/AskWomen/comments/pu6nnc/women_of_reddit_what_symptoms_of_mental_illness/",
  "subreddit": "AskWomen",
  "id": "pu6nnc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Whether or not you knew you had a mental illness, what things happen to you that\nyou didn't connect to mental illness for a very long time? Why didn't you\nrealize it was mental illness, and what caused you to make the connection?\nEmotional, mental, physical, professional, interpersonal... Anything.",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自分が心の病であることを知っていてもいなくても、長い間、心の病とは結びつかなかったことがあなたの身に起こります。\n長い間、心の病と結びつかなかったことはありますか？なぜ精神疾患だと気づかなかったのか？\nなぜそれが心の病だと気づかなかったのか、何が原因でそう思ったのか。\n感情的、精神的、身体的、職業的、対人的...。何でも結構です。",
      "title": "Redditの女性の皆さん、精神疾患と関係があると気づく前に、長い間、どのような症状が出ていましたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "无论你是否知道自己有精神疾病，在你身上发生的哪些事情\n你在很长时间内都没有把它与精神疾病联系起来？为什么你没有\n你为什么没有意识到这是精神疾病，又是什么原因使你产生了这种联系？\n情感的、精神的、身体的、专业的、人际的......。任何事情都可以。",
      "title": "红网的女网友们，在意识到与精神疾病有关之前，你们在很长一段时间内经历了哪些精神疾病的症状？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "無論你是否知道自己有精神疾病，在你身上發生的哪些事情\n你在很長時間內都沒有把它與精神疾病聯繫起來？爲什麼你沒有\n你爲什麼沒有意識到這是精神疾病，又是什麼原因使你產生了這種聯繫？\n情感的、精神的、身體的、專業的、人際的......。任何事情都可以。",
      "title": "紅網的女網友們，在意識到與精神疾病有關之前，你們在很長一段時間內經歷了哪些精神疾病的症狀？"
    }
  ]
}