{
  "author": "AskScienceModerator",
  "the_new_excerpt": "Hello! We are evolutionary biologists from the University of Tennessee with a\nwide variety of research backgrounds. We are here celebrating a belated Darwin\nDay, which commemorates the birthday of Charles Darwin each year on February 12.\nJoining us today are:\n\n * Krista De Cooke, PhD student…",
  "original_created_utc": 1613398449,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你好！我们是田纳西大学的进化生物学家。我们是来自田纳西大学的进化生物学家，我们的研究方向为\n广泛的研究背景。我们在这里庆祝迟到的达尔文诞辰。\n日，每年2月12日是纪念查尔斯-达尔文的生日。\n今天加入我们的是：\n\n * Krista De Cooke, 博士生... ...",
      "title": "AskScience AMA系列。我们是来自田纳西大学的进化生物学家 庆祝达尔文日。什么都可以问我们！我们是田纳西大学的进化生物学家，庆祝达尔文日。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好！我們是田納西大學的進化生物學家。我們是來自田納西大學的進化生物學家，我們的研究方向爲\n廣泛的研究背景。我們在這裏慶祝遲到的達爾文誕辰。\n日，每年2月12日是紀念查爾斯-達爾文的生日。\n今天加入我們的是：\n\n * Krista De Cooke, 博士生... ...",
      "title": "AskScience AMA系列。我們是來自田納西大學的進化生物學家 慶祝達爾文日。什麼都可以問我們！我們是田納西大學的進化生物學家，慶祝達爾文日。"
    }
  ],
  "title": "AskScience AMA Series: We are evolutionary biologists from the University of Tennessee celebrating Darwin Day. Ask Us Anything!",
  "created_utc": 1613412625,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello! We are evolutionary biologists from the University of Tennessee with a wide variety of research backgrounds. We are here celebrating a belated Darwin Day, which commemorates the birthday of Charles Darwin each year on February 12. Joining us today are: </p>\n\n<ul>\n<li><p><strong>Krista De Cooke, PhD student</strong> (<a href=\"/u/kdec940\">u/kdec940</a>) studies the spread of invasive plants and native plant alternatives. Her work aims to develop practical tools to help people select appropriate plants for their needs that also serve a positive ecological purpose.</p></li>\n<li><p><strong>Stephanie Drumheller, PhD</strong> (<a href=\"/u/uglyfossils\">/u/uglyfossils</a>) studies paleontology, especially taphonomy. Her research focuses on the processes of fossilization, evolution, and biology, of crocodiles and their relatives, including identifying bite marks on fossils. Find her on Twitter @UglyFossils.</p></li>\n<li><p><strong>Amy Luo, PhD student</strong> (<a href=\"/u/borb_watcher\">u/borb_watcher</a>) is a behavioral ecologist studying the cultural evolution of bird song dialects. She is interested in the geographic distribution of cultural traits and interaction between cultural evolution and genetic evolution.</p></li>\n<li><p><strong>Brian O&#39;Meara, PhD</strong> (<a href=\"/u/omearabrian\">/u/omearabrian</a>) is an evolutionary biologist at the University of Tennessee and President-Elect of the Society of Systematic Biologists. His research focuses on methods to study how traits have changed over time and their potential impact on other traits as well as speciation and extinction. Find him on Twitter @omearabrian and the web at <a href=\"http://brianomeara.info\">http://brianomeara.info</a>.</p></li>\n<li><p><strong>Dan Simberloff, PhD</strong> (<a href=\"/u/kdec940\">u/kdec940</a>) is a leader in the field of invasion biology and the Nancy Gore Hunger Professor of Environmental Studies at the University of Tennessee. He studies the patterns displayed by species introduced outside their geographic ranges, the impacts such species have on the communities they invade, and the means by which such invasions can be managed.</p></li>\n</ul>\n\n<p>Ask us anything!</p>\n\n<p>We will be answering questions starting around 5pm Eastern Time, 10 UTC.</p>\n</div><!-- SC_ON -->",
  "score": 122,
  "permalink": "/r/askscience/comments/lkeguh/askscience_ama_series_we_are_evolutionary/",
  "subreddit": "askscience",
  "id": "lkeguh",
  "is_self": true,
  "media": null,
  "is_video": false
}