{
  "author": "BASEbelt",
  "the_new_excerpt": "Last year, in 2020 MSFT had a strong rally of 43% to record highs for the year.\n\nThe earnings released on January 26th show MSFT beat earnings and revenue\nexpectations for the eighth straight quarter as reported on the last earnings\nreport about two weeks ago. Earnings of $2.03 per share easily…",
  "original_created_utc": 1612846538,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "去年，在2020年MSFT曾强势反弹43%，创下全年新高。\n\n1月26日发布的财报显示，MSFT的盈利和营收都超过了预期。\n连续第八个季度的预期，正如上期财报中所报告的那样。\n两周前的报告。每股收益2.03美元，轻松...",
      "title": "微软$MSFT股价看涨，可能很快就会有惊喜公告!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "去年，在2020年MSFT曾強勢反彈43%，創下全年新高。\n\n1月26日發佈的財報顯示，MSFT的盈利和營收都超過了預期。\n連續第八個季度的預期，正如上期財報中所報告的那樣。\n兩週前的報告。每股收益2.03美元，輕鬆...",
      "title": "微軟$MSFT股價看漲，可能很快就會有驚喜公告!"
    }
  ],
  "title": "Microsoft $MSFT stock looking bullish and may have a possible surprise announcement soon!",
  "created_utc": 1612853578,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Last year, in 2020 MSFT had a strong rally of 43% to record highs for the year.</p>\n\n<p>The earnings released on January 26th show MSFT beat earnings and revenue expectations for the eighth straight quarter as reported on the last earnings report about two weeks ago. Earnings of $2.03 per share easily topped expectations by 39 cents, while revenue of $43.08 billion grew almost 17% year over year and beat estimates by more than $2.8 billion.</p>\n\n<p>Since the release of this earnings report, the stock value has been uncharacteristically quiet and only hovering around the $242 range.</p>\n\n<p>This made me investigate what’s going on and I discovered over 12 Microsoft executives acquired common stocks as recently reported on February 1st with the SEC Form 4 filings. I calculated 1,348,758 common stock shares that were acquired by Microsoft leadership in the last month.</p>\n\n<p>This potentially means MSFT will be releasing some big news in the near future. Potentially even as early as the next couple of weeks and I believe it will be either an M&amp;A, a new technology product, or a large government contract to make all these executives acquire common stocks at the all-time high price.</p>\n\n<p>I picked up 500 call options as I’m conservatively estimating their stocks might increase over $250 in the next two weeks.</p>\n\n<p>Another thing to note is ARK Investment Management LLC reported a 30.67% increase in their ownership of MSFT / Microsoft Corp about three months ago. ARK does a lot better investigating potential disruptive technologies so they might have been previewed to some knowledge that helped them decide to increase their position that much.</p>\n\n<p>This is not financial advice and just my opinions. Please do your own DD before making any financial investments. Also please share your thoughts and insights on this as I am also thinking about buying some long-term shares tomorrow depending on what others mention or discovered.</p>\n\n<p>EDIT: I replaced the word &quot;bought&quot; with &quot;aquired&quot; to reflect the verbiage of the SEC Form 4 filings. Apparently acquired could mean they were awarded, exercised options, or other means. I also removed the word &quot;insider&quot;.</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/investing/comments/lfv01v/microsoft_msft_stock_looking_bullish_and_may_have/",
  "subreddit": "investing",
  "id": "lfv01v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123199875
}