{
  "author": "Aflycted",
  "the_new_excerpt": "I’ve been wanting to do a post like this for a long time now. Now that\nhealthcare has basically been the hottest thing for the last year (and somehow\nstill getting even hotter), I thought it would be a good time. Many people try\nto buy into pharmaceutical companies around FDA approval targets…",
  "original_created_utc": 1613009917,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我一直想做这样的文章，已经很久了。现在\n医疗保健基本上是去年最火爆的事情（也不知为什么\n依然变得更热），我想这是一个好时机。很多人都在尝试\n围绕FDA审批目标，买入药企...",
      "title": "看看FDA的审批过程及其对您的投资有何影响？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直想做這樣的文章，已經很久了。現在\n醫療保健基本上是去年最火爆的事情（也不知爲什麼\n依然變得更熱），我想這是一個好時機。很多人都在嘗試\n圍繞FDA審批目標，買入藥企...",
      "title": "看看FDA的審批過程及其對您的投資有何影響？"
    }
  ],
  "title": "A Look at the FDA Approval Process and How it Affects Your Investments",
  "created_utc": 1613083983,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been wanting to do a post like this for a long time now. Now that healthcare has basically been the hottest thing for the last year (and somehow still getting even hotter), I thought it would be a good time. Many people try to buy into pharmaceutical companies around FDA approval targets without truly understanding what they’re getting into. Full disclosure, I am a doctor, but I will try to write this in layman’s terms as much as possible. If I get anything wrong, I’ll be sure to edit the post. To the best of my knowledge, everything I am about to say is researched (and therefore correct).</p>\n\n<p>I’m going to go through the entire FDA approval process as a timeline, and then at the end, talk about other things to consider when investing in pharmaceuticals (i.e., more nuanced stuff that requires/applies healthcare understanding). One caveat here is people use “phases” in multiple ways. The way I will use it is the way I see most often being used in press releases and DD on reddit.</p>\n\n<p><strong>Preclinical</strong>: to begin, you must submit a proposal that basically states why you think a biologic compound will work. Without getting too technical, the preclinical is basically where you demonstrate a proof of concept. </p>\n\n<p>Here is a very generic example: Let’s say that HIV binds to GME receptor on cells. I have been doing petri dish experiments on a compound I created that prevents anything from binding to GME (this is <em>in vitro</em> if you ever see that term tossed around). I submit this evidence to the FDA and say that I think my compound will work in theory. TONS of things work <em>in vitro</em> and never progress beyond that. At this point, the FDA says, “okay we think your compound might work too, you can start human trials.”</p>\n\n<blockquote>\n<p>Investor takeaway: the results of this phase mean absolutely nothing. If a drug failed in this phase, that would truly mean the company is incompetent in both their ability to assess the science, and in their ability to provide meaningful news to generate investor buzz. </p>\n</blockquote>\n\n<p><strong>Phase 1</strong>: Anything that passes preclinical is ready for human trials. We are talking very small trials, like less than 100 people. For smaller companies, this is their chance to get some hype about their pharmaceutical. For anyone who understands the process, this is truly meaningless. Again, working in vitro does not (and likely will not) translate to working in humans. This phase typically lasts several months and is primarily designed to ensure that the drug is safe.</p>\n\n<p>Here is a real life example, one that has already garnered a lot of attention: Atossa Therapeutics (ATOS) and their new breast cancer drug. Here is where medical knowledge (or solid research) can really help you. Their new breast cancer drug is called endoxifen. There are already multiple analogues (drugs that work in exactly the same way with minor differences in their chemical structures) on the market. Given the number of safe analogues on the market, it is likely (but not certain) this drug will be safe for human use. It is important to note here that phase 1 trials may be done on healthy participants without any disease, solely to test for safety. Accordingly, passage through phase 1 still may not demonstrate proof of concept on humans who have a particular disease.</p>\n\n<p>Let’s say that ATOS had announced its intention to start testing breast cancer treatment and initiate phase 1 trials. Like I said, the likelihood of success is pretty high given the success of previous analogues. On the other hand the downside is huge. Companies can essentially go bankrupt at this stage if their “sure thing” drug or medical device fails. Always be sure to look at risk vs reward. A drug that enters phase 1 only has around a <strong>14% likelihood</strong> of making it all the way to FDA approval. Certain categories of drugs like those that treat cancer have even lower success rates (3.4%). While FDA drug approval does appear to be increasing <strong>more than 80% of drugs that enter this stage will never see market.</strong></p>\n\n<blockquote>\n<p>Investor takeaway: the road from here is super long and passing this phase really can’t tell you anything about its success in further stages. Many drugs are analogues and breeze through this phase, it is important not to get too hyped on them for that reason. </p>\n</blockquote>\n\n<p><strong>Phase 2</strong>: Unlike phase 1 that focuses on drug safety, phase 2 tests the efficacy of the drug you are studying. This phase will typically have less than 1,000 participants, but they will all have the disease of interest. In this phase, we are looking to ensure that the drug works (provides statistically significant improvement) and is relatively safe as far as side effects. To limit research bias, sometimes we will divide the participants and give some the drug and keep some as the control group (they may get a placebo or no drug at all).</p>\n\n<p>This is a pretty straightforward stage and lasts anywhere from months to years. It really depends on the drug being studied. I would never really expect a mainstream drug to get through this stage in under 6 months. The only conditions in which that would be logically feasible are either: </p>\n\n<ol>\n<li><p>COVID (solely because of the politicization of the process) or </p></li>\n<li><p>drugs treating conditions with extremely high mortality (because people won’t survive more than 6 months).</p></li>\n</ol>\n\n<p>Lots of companies like to start releasing press releases close to FDA review of phase 2 results. Always be wary of those results. If my breast cancer drug was successful in 600 people and failed in 300, then while the numbers look good, the data may not be there. There is a lot that goes into statistical analysis and it isn’t quite as simple as more people did well than did poorly. </p>\n\n<p>It’s also important to realize that side effect profile is really important. Let’s say the aforementioned breast cancer agent ends up prolonging life in 80% of the study participants that received the drug. However, there’s also this nasty little side effect of developing a pulmonary embolism in 15-20% of people. That’s not insignificant and it is up to the FDA to decide whether or not the risk outweighs the benefit. Sometimes the FDA will order companies to redo this phase if the data are inconclusive. With cancer agents, this is common because the drugs are so toxic to so many parts of the body, so it really is about risk/benefit analysis.</p>\n\n<p>The important thing to look at in this phase when comparing the results of the treatment group to the control group is what is called the p-value. For those of you who took stats, you should know what this is. For those that didn’t, just know that in healthcare, results with a p-value &gt;0.05 are considered insignificant. It’s also important to note that clinical and statistical significance are also key things to remember. Sometimes the benefit of the drug is so minimal that the side effect profile outweighs the benefits and the FDA will prevent the drug from moving forward. It’s also important to remember that if this is a drug entering a market where there are competitors, the FDA will look and see if this drug provides enough benefit over existing drugs before making a decision. </p>\n\n<p>One more nuance that pharmaceutical companies love to do is change the primary target. In the statistics world, that’s a pretty big no-no. If my initial proposal was that the breast cancer agent would prolong the life of my patients, and then suddenly I start talking about how it actually increases their pain-free time, this is a huge red flag. You can deduce that they likely didn’t meet their primary target and pivoted to something else they could meet. In any study you can find specific characteristic that makes you look good. </p>\n\n<blockquote>\n<p>Investor takeaway: this is the first phase that companies can really release “meaningful” information. Because of this, many companies try to raise funds at this time to capitalize on the hype, be wary of the words used in their press releases and marketing. </p>\n</blockquote>\n\n<p><strong>Phase 3</strong>: Phase 3 is basically a repeat of phase 2, but bigger. It’s used to determine real efficacy of a drug. In raw numbers, we are looking at about 300-3,000 participants and up to 4 years of data. Phase 3 looks at the exact same things as phase 2: efficacy and side effects observed among a treated group (and sometimes compared to a control group).</p>\n\n<p>Statistical significance, that is, the thing that tells you whether the drug worked, is based heavily upon power. If you want to increase power, you can increase the sample size. In phase 3, the FDA is giving the drug a chance to sink or swim. They are once again looking to make sure you don’t discover any new, obscure side effects and to ensure that the phase 2 results were not a statistical anomaly/the drug really does work.</p>\n\n<p>Beyond sample size, the biggest difference between phases 2 and 3 is that we are observing a longer period of time for adverse events. Note the maximum time differences: up to 2 years for phase 2, and up to 4 years for phase 3. There are side effects that don’t manifest within the first 2 years. \nA very simple example is, actually cancer agents that cause cardiac fibrosis or pulmonary fibrosis after years of use. These are things that may have been masked in the phase 2 study because the duration. </p>\n\n<p>The other thing is that we may discover rarer, more deadly side effects in this phase. Let’s say in phase 2, we found that 2 of our 1,000 participants developed brain cancer. The phase 2 data may show that this was statistically insignificant and cannot be attributed to the drug (remember, sample size is very important). Maybe the phase 3 study will suddenly show that another 8 people developed brain cancer and it was due to the drug. </p>\n\n<blockquote>\n<p>Investor takeaway: many drugs fail here, and not because they don’t work. They fail because they aren’t significantly better than what is available or the benefit is not enough to outweigh the risks. FDA approval isn’t simply contingent upon a drug working, there are many, many factors that come into play. </p>\n</blockquote>\n\n<p><strong>Phase 4</strong>: this is the big phase, thousands of participants, possibly multiple hospitals around the country/world. This phase further increases the power of the data and shows that the drug really, really does work and is actually safe. Getting to phase 4 is actually a pretty big deal.</p>\n\n<p>At this point, the company will apply for FDA approval including all of the information they have gathered at this point. In this stage, we are considering not only efficacy and safety, but also simplicity of use, and drug abuse potential. Drug abuse potential is a pretty hot topic right now because, well, opioid epidemic. Many opioids in the last few years have not received FDA approval solely because they are too easily abused. This entire application process takes 6-10 months for the FDA to review all the evidence and decide what happens.</p>\n\n<p>It is not uncommon for the FDA to request more data before approving a drug or further review. Many times they will request the company conduct a new study of x to determine y. This is normal but can seriously impede the approval timeline of a drug. This is where you have to remember opportunity cost. After approval it goes to market, yay!</p>\n\n<blockquote>\n<p>Investor takeaway: you may think once the drug receives FDA approval that you are out of the woods in terms of your investment. You would be wrong. </p>\n</blockquote>\n\n<p><strong>Making it to market</strong>: When a drug finally hits market, there are two major things for investors to consider. Let’s start with the scary one, removal from the market. Remember how many times I’ve mentioned power, and sample size above? That becomes super relevant here. Depending on the drug, when it finally reaches market we may have many-fold more “participants” with which we can study the side effects of the drug. </p>\n\n<p>Sometimes drugs are pulled from the market because certain side effects emerge that flew under the radar during clinical trial phases. Sometimes the FDA sticks a black box warning on the drug (which really makes doctors stop prescribing it unless they have to). In either care, share prices tend to drop. They will plummet, though, if the FDA removes it from market.</p>\n\n<p><strong>Market earnings</strong>: The last “opportunity” for investors in the approval process is the sales data after the first quarter of marketing. This is where the company shows their revenue from the sale of the drug. If you have medical knowledge, you can really thrive here. If you don’t, you are likely to get screwed because you probably won’t understand the nuances in what drives physicians to prescribe drugs and avoid others. </p>\n\n<p>Just because a drug works super well doesn’t mean it will ever be used. Examples of that are ACRX’s new sufentanil agents. Those will likely see poor sales data because from a clinical perspective, even though they are approved, and work, they will almost never be used. You would  not know that without understanding the specifics of post-operative pain management.</p>\n\n<p>And finally, a disclaimer. Anything I said here, I can be totally wrong. Sufentanil could become the most popular agent on the market for reasons I don’t understand or couldn’t fathom. Maybe ACRX will have an insanely good marketing team. I am simply talking about making the best decision based on the available knowledge. Stock prices are fickle beasts and they don’t always respond the way we expect.</p>\n\n<p><strong>A message to those who tend to hold on to their bags to gamble on FDA approval:</strong></p>\n\n<blockquote>\n<p>Yes, this really is gambling. Look at the statistics of how often drugs make it past each stage. You lost 40% on ATOS, you know what would be worse? Somehow their drug fails and now you have lost 80%. You see a drug running before FDA decision deadline, don’t buy it. No one knows how the FDA is going to respond and you are just as likely to lose your money than you are to make it.</p>\n\n<p>Honestly, you are more likely to lose money because there are three outcomes, and two cause you to lose money, one of which will potentially bankrupt your position. The FDA could either approve the drug (yay!), outright reject the drug (oof), or ask for more information. That last one is kind of misleading because it may not mean the drug has failed, but it definitely will destroy the hype built up and tank the share price. The extra information requested could take forever to get and you would, once again, have to consider opportunity cost.</p>\n</blockquote>\n\n<p>If there is anything else you think I should have discussed, just let me know and I will try to add it.</p>\n</div><!-- SC_ON -->",
  "score": 39,
  "permalink": "/r/stocks/comments/lhaidu/a_look_at_the_fda_approval_process_and_how_it/",
  "subreddit": "stocks",
  "id": "lhaidu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728622076
}