{
  "author": "cbarrister",
  "original_created_utc": 1627399811,
  "title": "Could Enigma code be broken today WITHOUT having access to any enigma machines?",
  "created_utc": 1627410594,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Obviously computing has come a long way since WWII. Having a captured enigma machine greatly narrows the possible combinations you are searching for and the possible combinations of encoding, even though there are still a lot of possible configurations. A modern computer could probably crack the code in a second, but what if they had no enigma machines at all?</p>\n\n<p>Could an intercepted encoded message be cracked today with random replacement of each character with no information about the mechanism of substitution for each character?</p>\n</div><!-- SC_ON -->",
  "score": 139,
  "permalink": "/r/askscience/comments/osp3q8/could_enigma_code_be_broken_today_without_having/",
  "subreddit": "askscience",
  "id": "osp3q8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Obviously computing has come a long way since WWII. Having a captured enigma\nmachine greatly narrows the possible combinations you are searching for and the\npossible combinations of encoding, even though there are still a lot of possible\nconfigurations. A modern computer could probably crack the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "第二次世界大戦後、コンピュータは大きく進歩しました。捕獲したエニグマ・マシンを持つことで\n捕獲したエニグマ・マシンを持っていると、検索する可能性のある組み合わせと、エンコードの可能性のある組み合わせが大幅に絞られます。\n符号化の可能な組み合わせを大幅に狭めることができます。\n設定があります。現代のコンピュータは、おそらくエニグマを解読できるでしょう。",
      "title": "今日、エニグマ・コードは、エニグマ・マシンを手に入れなくても解読できるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "显然，自二战以来，计算机已经有了长足的进步。拥有一台缴获的英格玛\n的机器，大大缩小了你所搜索的可能组合和\n编码的可能组合，尽管仍有许多可能的\n配置。一台现代的计算机可能会破解...",
      "title": "今天，在没有接触到任何英格玛机器的情况下，英格玛密码能否被破解？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "顯然，自二戰以來，計算機已經有了長足的進步。擁有一臺繳獲的英格瑪\n的機器，大大縮小了你所搜索的可能組合和\n編碼的可能組合，儘管仍有許多可能的\n配置。一臺現代的計算機可能會破解...",
      "title": "今天，在沒有接觸到任何英格瑪機器的情況下，英格瑪密碼能否被破解？"
    }
  ]
}