{
  "author": "JayJay516",
  "the_new_excerpt": "I'm in my late 20s and I started investing in March 2020. Since then, I've tried\nto invest a weekly portion of my paycheck into stocks. I've invested in both\ndividend and growth stocks, but I'm not sure which I should focus on more for\nthe long term. Everyone has their own personal preference based…",
  "original_created_utc": 1623943674,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "20代後半で2020年3月に投資を始めました。それ以来、私は努力\n給料のうち毎週一部を株式に投資するようにしています。私が投資したのは、両方の\n配当株と成長株の両方に投資していますが、長期的にはどちらを重視すべきか迷っています。\n長期的にはどちらを重視すべきか迷っています。誰もが自分の好みに基づいて...",
      "title": "成長株と配当株のどちらを重視すべきか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经20多岁了，我在2020年3月开始投资。从那时起，我就尝试\n每周将工资的一部分投资于股票。我既投资于\n红利型和成长型股票，但我不确定我应该更注重哪一种长期投资。\n长期的。每个人都有自己的个人偏好，基于...",
      "title": "我应该更关注增长型股票还是红利型股票？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經20多歲了，我在2020年3月開始投資。從那時起，我就嘗試\n每週將工資的一部分投資於股票。我既投資於\n紅利型和成長型股票，但我不確定我應該更注重哪一種長期投資。\n長期的。每個人都有自己的個人偏好，基於...",
      "title": "我應該更關注增長型股票還是紅利型股票？"
    }
  ],
  "title": "Should I focus more on Growth or Dividend stocks?",
  "created_utc": 1623950366,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m in my late 20s and I started investing in March 2020. Since then,  I&#39;ve tried to invest a weekly portion of my paycheck into stocks. I&#39;ve invested in both dividend and growth stocks, but I&#39;m not sure which I  should focus on more for the long term. Everyone has their own personal preference based on their goals and the risks their willing to take.  However, I&#39;m definitely focused on building wealth over the long term, and considering that I&#39;m still in my 20s, I don&#39;t mind a bit of risk. Do you guys have any suggestions/advice/tips?</p>\n</div><!-- SC_ON -->",
  "score": 595,
  "permalink": "/r/investing/comments/o1zxq4/should_i_focus_more_on_growth_or_dividend_stocks/",
  "subreddit": "investing",
  "id": "o1zxq4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009742352
}