{
  "author": "Chrononubz",
  "the_new_excerpt": "Karp's interview is being overblown. The headlines are clickbait. He talks\nAmerica needing software(pure software/AI) that is the best to AVOID conflict in\norder to stay ahead of America's adversaries. Basically he's claiming Palantir\nTechnologies to be S class disruptive Tech that can lead future…",
  "original_created_utc": 1615952902,
  "localize": [
    {
      "locale": "zh",
      "title": "$PLTR亚历克斯-卡普采访。完整的分解3/16",
      "the_new_excerpt": "卡普的采访被夸大了。头条新闻是点击率。他说\n美国需要最好的软件(纯软件/AI)来AVOID冲突中。\n以期领先于美国的对手。基本上他是在宣称帕兰提尔\n技术将成为S级颠覆性技术，可以引领未来..."
    },
    {
      "locale": "zh-Hant",
      "title": "$PLTR亞歷克斯-卡普採訪。完整的分解3/16",
      "the_new_excerpt": "卡普的採訪被誇大了。頭條新聞是點擊率。他說\n美國需要最好的軟件(純軟件/AI)來AVOID衝突中。\n以期領先於美國的對手。基本上他是在宣稱帕蘭提爾\n技術將成爲S級顛覆性技術，可以引領未來..."
    }
  ],
  "title": "$PLTR Alex Karp Interview: FULL BREAKDOWN 3/16",
  "created_utc": 1615962389,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Karp&#39;s interview is being overblown.  The headlines are clickbait.  He talks America needing software(pure software/AI) that is the best to AVOID conflict in order to stay ahead of America&#39;s adversaries. Basically he&#39;s claiming Palantir Technologies to be S class disruptive Tech that can lead future innovations for America.</p>\n\n<p>Karp would rather put his focus on having the company put its &quot;best foot forward&quot; for the sake of protecting America and its private and public interests.</p>\n\n<p>He was asked in the middle of the interview &quot;How would he entice new commercial customers?&quot;</p>\n\n<p>He then starts talking about the how Foundry and Gotham are unique technically speaking ( claims his tech is 5 years ahead of everyone else low key), and the way they do business is unique.  For example he explains that Palantir  in the commercial space, Foundry is a Finished product as opposed to other ERP systems that require you to do an entire IT installation that can take months.  Foundry can be installed as a whole stack in a few days!  That difference is how Karp and Palantir thinks Software companies will sell their products.  He mentions that typically ERP systems entice customers with Jargon that promises to deliver instead of providing a product that stands out from the rest.  He truly believes Palantir is in a class of its own.   He actually believes despite having Elite tech that he provides for the biggest companies in the word, he thinks that Palantir can provide a ton of value to smaller to medium companies by offering superior ERP Software transforming their business to save them millions of dollars.</p>\n\n<p>They talk little bit about PLTRs partnerships including 3M, BP, IBM, and AWS.  They talk about how IBM and AWS were thought to be rival companies to Palantir but instead decided to join forces because those companies understand how difficult it is to build what Palantir built with Foundry and Gotham.</p>\n\n<p>HE LIKES THE RETAIL INVESTORS, he HATES the &quot;INVESTORS&quot; who buy and sell the stock who don&#39;t have any clue about the company or its Tech.</p>\n\n<p>He can&#39;t on camera &quot;PUMP&quot; the stock, so he just talks about how he&#39;s more focused on building the Company for the long-term.</p>\n\n<p>TLDR</p>\n\n<p>So about an hour talking about how superior the tech( Foundry/Gotham) is compared to any other software company&#39;s tech and how Karps ideological view of supporting America and its western values by providing Superiority and Complexity in order to stay ahead of its adversaries.</p>\n\n<p>Foundry is 5 years ahead of any other ERP software in the market.  IBM and AWS bow down to PLTR.</p>\n\n<p>Intrigued yet?</p>\n\n<p>I plan to hold this 10 years plus.</p>\n\n<p>235 shares@ 24.68, 6x  PLTR 4/1 30c</p>\n\n<p>Edit: title is misleading, more a summary than a full breakdown sorry.</p>\n</div><!-- SC_ON -->",
  "score": 405,
  "permalink": "/r/stocks/comments/m6rgcr/pltr_alex_karp_interview_full_breakdown_316/",
  "subreddit": "stocks",
  "id": "m6rgcr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147384033
}