{
  "author": "AlreadyLiberated",
  "the_new_excerpt": "But I’ll tell you one thing: there are more of the second type of person than\nthe first. You’re probably not going to be the memecoin millionaire. Please\ndon’t be the FOMO buy high, sell low person either.\n\nMaybe the bull market is back and we will see Bitcoin and Eth and Ada at new\nATHs this…",
  "original_created_utc": 1623690945,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "しかし、一つだけ言えることは、第一のタイプの人よりも第二のタイプの人の方が多いということです。\nの方が多いのです。あなたはおそらく、メムコイン大富豪にはなれないでしょう。お願い\nFOMOの高値買い、安値売りの人にもならないでください。\n\nもしかしたら強気の相場が戻ってきて、ビットコインやイーサやエイダが新しい\nATHをこの...",
      "title": "3月から4月にかけて、メディアは父親の地下にいる子供たちが景気刺激策の小切手をmemecoinに投入して億万長者になったことを伝えていた。ATHに貯金をつぎ込み、5月と6月に40～60％の損失を出して売却した何万人もの人々についてはあまり書かれなかった。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "但我要告诉你一件事：第二类人比第三类人多。\n第一类人。你可能不会成为纪念币的百万富翁。请\n也不要成为FOMO的高买低卖者。\n\n也许牛市回来了，我们将看到比特币和Eth以及Ada在新的\nATHs这...",
      "title": "早在3月和4月，媒体告诉我们所有关于在他们父亲的地下室里的孩子们把他们的刺激性支票放入memecoins并成为百万富翁。他们没有写太多关于数以万计的人把他们的积蓄投入到ATHs，然后在5月和6月以40-60%的损失出售。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "但我要告訴你一件事：第二類人比第三類人多。\n第一類人。你可能不會成爲紀念幣的百萬富翁。請\n也不要成爲FOMO的高買低賣者。\n\n也許牛市回來了，我們將看到比特幣和Eth以及Ada在新的\nATHs這...",
      "title": "早在3月和4月，媒體告訴我們所有關於在他們父親的地下室裏的孩子們把他們的刺激性支票放入memecoins併成爲百萬富翁。他們沒有寫太多關於數以萬計的人把他們的積蓄投入到ATHs，然後在5月和6月以40-60%的損失出售。"
    }
  ],
  "title": "Back in March and April, the media told us all about the kids in their dad’s basement who put their stimulus checks into memecoins and became millionaires. They didn’t write much about the tens of thousands of people who threw in their savings at ATHs, then sold at 40-60% losses in May and June.",
  "created_utc": 1623719932,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>But I’ll tell you one thing: there are more of the second type of person than the first. You’re probably not going to be the memecoin millionaire. Please don’t be the FOMO buy high, sell low person either. </p>\n\n<p>Maybe the bull market is back and we will see Bitcoin and Eth and Ada at new ATHs this summer. That’s what I believe, but of course no one knows for sure. If so, I’ll bet we also see memecoins like Doge at new highs, and a ton of news stories about the kid in his dad’s basement holding through the May crash and becoming a 10 millionaire. </p>\n\n<p>Maybe things keep going sideways or even crash harder. But if I’m right and we see a massive run up this summer, it’ll make the first five months of 2021 look meek. This will cause FOMO. Don’t fall for it. Make a plan now for a crazy bull run summer. Stick to it.</p>\n</div><!-- SC_ON -->",
  "score": 207,
  "permalink": "/r/CryptoCurrency/comments/nzrsfd/back_in_march_and_april_the_media_told_us_all/",
  "subreddit": "CryptoCurrency",
  "id": "nzrsfd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009738594
}