{
  "author": "0toHeroInvesting",
  "the_new_excerpt": "What is the latest news in the stock market? Aphria is merging with Tilray while\nthe stimulus may be agreed on today after the latest developments. Also, the FED\nstarts its 2-day meeting, let’s talk about this and everything happening in the\nstock market\n\n~Very Long Post~\n\nHello everyone and Good…",
  "original_created_utc": 1608126048,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "股市的最新消息是什么？Aphria正在与Tilray合并，而\n在最新的事态发展之后，刺激计划可能会在今天达成一致。此外，美联储\n开始为期两天的会议，让我们谈谈这件事和发生在\n股票市场\n\n~很长的帖子~\n\n大家好，好…",
      "title": "今日股市新闻|APHA和TLRY合并|苹果崛起|刺激计划和美联储今日会议[12-16]"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "股市的最新消息是什麼？Aphria正在與Tilray合併，而\n在最新的事態發展之後，刺激計劃可能會在今天達成一致。此外，美聯儲\n開始爲期兩天的會議，讓我們談談這件事和發生在\n股票市場\n\n~很長的帖子~\n\n大家好，好…",
      "title": "今日股市新聞|APHA和TLRY合併|蘋果崛起|刺激計劃和美聯儲今日會議[12-16]"
    }
  ],
  "title": "Stock Market News Today | APHA & TLRY Merge | APPLE Rises | Stimulus & FED Meeting Today [12-16]",
  "created_utc": 1608137320,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>What is the latest news in the stock market? Aphria is merging with Tilray while the stimulus may be agreed on today after the latest developments. Also, the FED starts its 2-day meeting, let’s talk about this and everything happening in the stock market</strong></p>\n\n<p><strong>~Very Long Post~</strong> </p>\n\n<p>Hello everyone and Good Morning! So, let’s start with the recap of yesterday as we see a great day for the stock market, the best in December actually, as a one-two punch of stimulus and vaccine data helped the rally, with the broad market <a href=\"https://ibb.co/XkRWtZS\">SP500</a> finishing up 1.29%, the <a href=\"https://ibb.co/dPpXW1X\">Nasdaq Composite</a> 1.25% and the <a href=\"https://ibb.co/smC2WMp\">Dow Industrial</a> 1.13%. We also saw the <a href=\"https://ibb.co/F07KNd4\">VIX</a> dropping more than 7% from the recent highs, as it was nearing the 25 levels which would imply more volatility ahead for the stock market.</p>\n\n<p>We saw ¾ of the companies gaining <a href=\"https://ibb.co/PG7tysH\">yesterday</a> on decent volume, with 145 new highs, as all 11 sectors finished in the green, with Utilities and Energy leading the way up almost 2%, while just 2 <a href=\"https://ibb.co/1sqbPxT\">sectors</a> gained less than 1% for the day, the Communications sector and the consumer staples. This rally was pushed by almost every type of <a href=\"https://ibb.co/5xf4s1b\">company</a>, especially small and mid-caps, as large-caps lagged a bit and were pretty much flat for the day, with the exception of Apple as you can see in this <a href=\"https://ibb.co/TT2xp03\">HEAT MAP</a>, as I said in a previous post, I believe that Apple is ready for takeoff after more and more reports of great numbers in the new iPhone 12 lineup sales, and with the Fitness+ service launching this Monday this keeps increasing the number of services that Apple offers. I believe that the Apple One bundle will be a great revenue stream for them alongside the move to the 5G in the next years.</p>\n\n<p>So here is the economic <a href=\"https://ibb.co/dcbS2NG\">calendar</a> for today as we start off early in the morning with MBA mortgage applications, followed but retail sales, PMI, inventories and finish up with the last meeting and decisions from the FED in 2020.</p>\n\n<p>We also received news that as soon as the FDA &amp; CDC give approval, which could and probably will happen as soon as this weekend, <a href=\"https://ibb.co/B3q3Dkv\">Moderna</a> will be able to ship over 6M doses right away, more than double what Pfizer delivered in the initial shipment.</p>\n\n<p>This is happening while the stimulus appears closer than ever, but it should be noted that it does appear it will not include any stimulus checks for citizens. As the Congress seems to be targeting a $750B relief <a href=\"https://ibb.co/pvWY3bB\">package</a>. This is very needed as the savings, especially for low-income households, has been substantially on the <a href=\"https://ibb.co/SVwG1DD\">declin</a> since May, just like always, the rich get richer and the poor get poorer.</p>\n\n<p>This measures from the Government have been unexpectedly just been called upon from Warren <a href=\"https://ibb.co/cv0v8h9\">Buffett</a> also, as he emphasized that small businesses have become collateral damage, though he previously said he wouldn’t speak in public about this until May, the degrading situation probably made him change his mind. </p>\n\n<p>We will also have the FED starting its meetings <a href=\"https://ibb.co/jy1TDvh\">today</a>, and follow up tomorrow, with most analysts expecting the FED to lay out the plans for additional asset purchases to provide additional support for the economy. And even if this is a temporary measure, it would be great for the economy if they keep this program going until the vaccine is more widely available and the reopening can come back in full force.</p>\n\n<p>Yesterday we also got numbers on the Industrial <a href=\"https://ibb.co/xG9Rnsr\">Production</a>, which beat the consensus with a .4% increase M/M while capacity utilization also increased with the manufacturing output way better than expected. This was led especially by motor vehicle and parts sales which were up 5.3%.</p>\n\n<p>So, with some good news in the last period, a recent <a href=\"https://ibb.co/4dn08gY\">survey</a> showed that fewer respondents believe that stocks are overpriced or overvalued right now. I think this is a fair opinion, as we have gone through a period of consolidation since the beginning of <a href=\"https://ibb.co/zVZ3vQQ\">November</a>, stocks have become more stable, some have lost ground, some have gained. This is very healthy for the broad stock market and may eventually start a new bull run very soon.</p>\n\n<p>On some other stock market <a href=\"https://ibb.co/B22drnZ\">news</a>, we saw the whole green energy sector getting a big boost yesterday, as the US Congress seems to have agreed to a <a href=\"https://ibb.co/GxpqGB6\">package</a> of tax incentives and extensions for both wind and solar projects. Some of the biggest gainers yesterday were SunPower, Enphase, SolarEdge, with most of the companies from the INVESCO Solar ETF trading way higher. As we also saw <a href=\"https://ibb.co/7zrVQMG\">PENN</a> national gaining yesterday after giving great news again to investors, as they have acquired a new casino in Maryland as they keep expanding their nationwide footprint.</p>\n\n<p>Meanwhile, we will get <a href=\"https://ibb.co/8482vyk\">Lennar</a> Q4 earnings today after the close, and I expect them to have a great quarter, but this hasn’t helped many companies this quarter, as even great earnings results haven’t pushed most companies to have big gains, I think Lennar will post a terrific quarter as a result of the continuing strong housing market as more and <a href=\"https://ibb.co/QjbZsDz\">more</a> people flee big cities attracted by better tax implications while they also run from the growing poverty in states like California.</p>\n\n<p>Some good <a href=\"https://ibb.co/rHYtC04\">news</a> also came from the Eurozone this morning, as the PMI popped up to 49.8 which is still a contraction for the economy, but that is an improving view of the economy overseas, up from 45.3 in November.</p>\n\n<p>We also have to keep an eye on what <a href=\"https://ibb.co/WPQ214K\">ABNB</a> and Doordash will do, as investors are starting to get the chance to short this highly valued IPOs. So, this might hit the stocks even more after they have suffered in the last days as I expected.</p>\n\n<p>And one last bit of <a href=\"https://ibb.co/j6Fxdv5\">news</a>, Aphria is merging with Tilray, they will become an almost $4B market cap cannabis player, as they seek to also move to the US and grow its market share in the country, as the full legalizing of cannabis in the US seems to be approaching.  This will help both companies to be able to have low-cost, state of the art cultivations alongside improved processing and manufacturing facilities. This will also position them for a better footprint in the EU, with Aphria having a footprint in Germany, while Tilray has a low-cost production facility in Portugal.</p>\n\n<p>I think the pot and clean energy sectors alongside the EVs are the ones to watch in the next years.</p>\n\n<p>Let’s hope for another great day in the market as the <a href=\"https://ibb.co/HY1vfFP\">FUTURES</a> seem to be pointing at a good open, hopefully some green action continues after that.</p>\n\n<p>Thank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!</p>\n\n<p>Have a great day and see you next time!</p>\n</div><!-- SC_ON -->",
  "score": 461,
  "permalink": "/r/stocks/comments/ke9cw9/stock_market_news_today_apha_tlry_merge_apple/",
  "subreddit": "stocks",
  "id": "ke9cw9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260495587
}