{
  "author": "GetEmDaddy902",
  "original_created_utc": 1627303513,
  "title": "For the love of God get rid of your credit card debt first?",
  "created_utc": 1627318473,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>To anybody out there with a credit card debt please make sure you clear this up before you start investing into crypto. It&#39;s kind of counterproductive to invest in something when you already have an outstanding debt.</p>\n\n<p>I know it can be like pulling teeth trying to pay this down and pay it off but the sooner you do you&#39;ll have more money to invest into crypto and your gains will be that much more real. The gains that you make off your crypto will be overwhelmed by the interest you&#39;re paying on your credit card in most cases. </p>\n\n<p>Now I&#39;m not saying don&#39;t invest into crypto what I&#39;m trying to say is maybe put a bigger portion into paying off your debt while a small portion is going into your investment.</p>\n\n<p>The soon you do this, the closer you will be to financial freedom, this leaving you more money to invest.</p>\n\n<p>Edit: I am not a financial advisor and this is not financial advice do as you wish with your money.</p>\n</div><!-- SC_ON -->",
  "score": 350,
  "permalink": "/r/CryptoCurrency/comments/orxyb6/for_the_love_of_god_get_rid_of_your_credit_card/",
  "subreddit": "CryptoCurrency",
  "id": "orxyb6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "To anybody out there with a credit card debt please make sure you clear this up\nbefore you start investing into crypto. It's kind of counterproductive to invest\nin something when you already have an outstanding debt.\n\nI know it can be like pulling teeth trying to pay this down and pay it off but\nthe…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "クレジットカードで借金をしている人は、暗号化投資を始める前に必ずこの問題を解決してください。\n暗号への投資を始める前に 借金がある状態で投資するのは、逆効果です。\nるのは逆効果です。\n\n借金を返して完済するのは歯がゆい思いをすると思いますが\nその...",
      "title": "お願いだから、まずクレジットカードの借金をなくしてくれないか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于任何有信用卡债务的人，请确保在你开始投资加密货币之前，先把这个问题解决了。\n在你开始投资加密货币之前。投资加密货币是一种适得其反的做法。\n在你已经有一个未偿债务的情况下投资一些东西，会起到反作用。\n\n我知道要想还清这些钱，可能像拔牙一样，但\n但是，这...",
      "title": "看在上帝的份上，先甩掉你的信用卡债务？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於任何有信用卡債務的人，請確保在你開始投資加密貨幣之前，先把這個問題解決了。\n在你開始投資加密貨幣之前。投資加密貨幣是一種適得其反的做法。\n在你已經有一個未償債務的情況下投資一些東西，會起到反作用。\n\n我知道要想還清這些錢，可能像拔牙一樣，但\n但是，這...",
      "title": "看在上帝的份上，先甩掉你的信用卡債務？"
    }
  ]
}