{
  "author": "woottonp",
  "original_created_utc": 1637480770,
  "title": "Still early on CRO",
  "created_utc": 1637505048,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know it can be hard to buy in when a coin is near ATH</p>\n\n<p>But in my opinion CRO is one of the best options and I am still adding at this price.</p>\n\n<p>The rewards card is unmatched where I live. And the fact that it forces CRO to be locked in staking for 6 months makes you a great HODLER.</p>\n\n<p>This is a company who is marketing like no one else in the crypto space right now.</p>\n\n<p>The rename of the staples centre is a 20 year deal with a rumoured cost of $700m! And that&#39;s not the only marketing they are doing.</p>\n\n<p>As crypto expands further into the masses crypto.com are positioned like no other.</p>\n\n<p>Earn those sweet rewards and stake your way up the cards!</p>\n</div><!-- SC_ON -->",
  "score": 184,
  "permalink": "/r/CryptoCurrency/comments/qyq2av/still_early_on_cro/",
  "subreddit": "CryptoCurrency",
  "id": "qyq2av",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know it can be hard to buy in when a coin is near ATH\n\nBut in my opinion CRO is one of the best options and I am still adding at this\nprice.\n\nThe rewards card is unmatched where I live. And the fact that it forces CRO to\nbe locked in staking for 6 months makes you a great HODLER.\n\nThis is a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "コインがATHの近くにあるときに購入するのは難しいことだと思いますが\n\nしかし、私の意見ではCROは最良の選択肢の一つであり、この価格でも追加しています。\nの価格です。\n\n私が住んでいるところでは、リワードカードは他に類を見ません。そして、CROに強制的に\nは6ヶ月間ステークにロックされているので、素晴らしいHODLERになります。\n\nこれは...",
      "title": "まだCROの初期段階"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道当一个硬币接近ATH时，可能很难买入。\n\n但在我看来，CRO是最好的选择之一，我在这个价格上仍然在增加\n价格。\n\n奖励卡在我居住的地方是无可比拟的。而事实上，它迫使CRO\n锁定6个月的赌注，使你成为一个伟大的HODLER。\n\n这是个...",
      "title": "仍然是早期的CRO"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道當一個硬幣接近ATH時，可能很難買入。\n\n但在我看來，CRO是最好的選擇之一，我在這個價格上仍然在增加\n價格。\n\n獎勵卡在我居住的地方是無可比擬的。而事實上，它迫使CRO\n鎖定6個月的賭注，使你成爲一個偉大的HODLER。\n\n這是個...",
      "title": "仍然是早期的CRO"
    }
  ]
}