{
  "author": "Rboy1725",
  "original_created_utc": 1649919204,
  "title": "Fuck robinhood, should have never used them",
  "created_utc": 1649932801,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a pretty safe internet user(on my laptop), no porn on my laptop just my phone, no risky sites or apps etc. Never save passwords to any site...&lt;/p&gt;\n\n&lt;p&gt;Even as careful as I am it seems that my email I have been using for the last 15 years has been found on an auction block on the dark web.&lt;/p&gt;\n\n&lt;p&gt;Low and behold the culprit is &lt;a href=\"https://robinhood.com/\"&gt;r&lt;/a&gt;obinhood. I literally used them for 2 months, realized I did not like the platform, then the GME and AMC bullshit and the shady practices with the hedge fund, then the wallet bullshit where you couldn&amp;#39;t sell your crypto. After all that it just made me hate them.&lt;/p&gt;\n\n&lt;p&gt;Luckily before I got this heads up I had already began converting my accounts into a different email and I regularly update my passwords. This was by chance that i did the new email. Very happy I did&lt;/p&gt;\n\n&lt;p&gt;if I didn&amp;#39;t have enough reasons to not like RH this is the icing on the cake.&lt;/p&gt;\n\n&lt;p&gt;Fuck robinhood. Update your passwords, get a new email and stay away from this shit show.&lt;/p&gt;\n\n&lt;p&gt;Stay safe out there.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/aoga66kazft81.jpg?width=1908&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=30e8b8bcf3f566eccc43dedd738368f8d7d59784\"&gt;Here is the proof&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 390,
  "permalink": "/r/CryptoCurrency/comments/u3b7n7/fuck_robinhood_should_have_never_used_them/",
  "subreddit": "CryptoCurrency",
  "id": "u3b7n7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm a pretty safe internet user(on my laptop), no porn on my laptop just my\nphone, no risky sites or apps etc. Never save passwords to any site...\n\nEven as careful as I am it seems that my email I have been using for the last 15\nyears has been found on an auction block on the dark web.\n\nLow and…"
}