{
  "author": "nobjos",
  "original_created_utc": 1650970226,
  "title": "Moonshots - I analyzed 3,000+ crypto's over the last 8 years to see if and how you should try to find moonshots : Here are the results.",
  "created_utc": 1650978645,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;All of us have at least once wished we had made a similar play to the one that &lt;a href=\"https://www.benzinga.com/markets/cryptocurrency/21/05/21076574/he-invested-17-in-shiba-inu-now-he-has-almost-6m\"&gt;turned $17 into ~6M&lt;/a&gt; or had gotten into the &lt;a href=\"https://www.cnbc.com/2021/07/06/millennial-dogecoin-millionaire-on-being-paid-in-dogecoin.html\"&gt;right crypto at the right time.&lt;/a&gt; It’s not like we are alone in this thought process - there are more than 1.7 million people right now trying to find the &lt;a href=\"https://www.reddit.com/r/CryptoMoonShots/\"&gt;next crypto moonshot&lt;/a&gt;. For those who are out of the loop, a moonshot is something that has a low probability of becoming extremely successful [1].&lt;/p&gt;\n\n&lt;p&gt;While it’s definitely nice to be the guy who made the correct play, what I wanted to understand is, how likely are you to pick the next big coin? After all, there are more than &lt;a href=\"https://www.coinopsy.com/dead-coins/#other\"&gt;2,400 dead coins&lt;/a&gt; that were part of someone’s moonshot not that long back. When a coin is dead, we would end up losing almost 100% of the capital that we invested in it thereby breaking the cardinal rule of investing.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;Rule No. 1: Never lose money. Rule No. 2: Never forget rule No. 1 -&lt;/em&gt; &lt;strong&gt;&lt;em&gt;Warren Buffet&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;While Warren Buffet might not be the best example for the crypto world, his advice holds true just as well in all investing spaces - Once you lose your capital, it’s game over. So in this deep-dive, let&amp;#39;s see how the less popular cryptos have performed over the years, whether it makes sense to invest in them, and finally, would you have made better returns just by investing in the top cryptocurrencies like Bitcoin and Ethereum?!&lt;/p&gt;\n\n&lt;h3&gt;Data &amp;amp; Analysis Methodology&lt;/h3&gt;\n\n&lt;p&gt;All the data used in the analysis has been collected from coinmarketcap.com. Their data is available going as far back as 2014. I collected the price, market cap, and the symbol for all the coins listed in coinmarketcap on Jan 1st of every year from 2014 to 2022. There were only 67 listed coins in 2014. The list has grown to more than 3,000+ as of Jan 2022. All the data and my analysis are shared as a Rows sheet at the end.&lt;/p&gt;\n\n&lt;p&gt;The analysis is fairly simple and I have intentionally made the strategy straightforward so that it’s easy to replicate. We will be comparing the performance of the Top 10 Cryptocurrencies with the next 90 based on the total market cap of the coin.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/ie9owd9mylv81.png?width=895&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=4830cb8e014e559cb2754b8f514a90a7f1787ac1\"&gt;The end of 2017 was definitely some wild time to be in the Crypto space.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I have limited the analysis to the top 100 coins because of two reasons&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Even now, close to 95% of the combined market cap of the crypto market is contributed by just the top 100 coins. Adding to this, it becomes more and more difficult/riskier [2] to invest in coins having low market cap due to platform and liquidity issues.&lt;/li&gt;\n&lt;li&gt;There are hundreds of new coins that are being launched every day. It’s almost impossible to keep track of all the coins and realistically do proper due diligence before investing. So for practical feasibility, I am limiting it to the top 100.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;h3&gt;Results&lt;/h3&gt;\n\n&lt;p&gt;Before we jump straight into the return calculation, it’s interesting to see how the crypto market has changed over the years.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/m0fng8moylv81.png?width=649&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=98fb3edb350696ab03e9136c7b2eaf3ab9f46336\"&gt;https://preview.redd.it/m0fng8moylv81.png?width=649&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=98fb3edb350696ab03e9136c7b2eaf3ab9f46336&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;In the first few years where crypto was becoming mainstream (2014 to 2017), the top 10 currencies dominated the overall market cap contributing close to 99% [3]. Also, during crashes, we can observe a massive shift in capital allocation from Altcoin to Bitcoin → 2017 was one of the best bull runs (barring 2021) where we can see that Bitcoin only contributed to ~39% of the market cap. But once the bear market set in (2018-19), the allocation to bitcoin proportionally increased until the 2021 bull run.&lt;/p&gt;\n\n&lt;h4&gt;Creating a Crypto Index&lt;/h4&gt;\n\n&lt;p&gt;To answer our initial question → Whether it’s better to invest in the top 10 most popular cryptos or the other 90 relatively lesser-known ones, we will be creating an equal-weighted index [4].&lt;/p&gt;\n\n&lt;p&gt;We have two people Alan and Charlie who want to get into the crypto market in 2014, but both are following a slightly different approach.&lt;/p&gt;\n\n&lt;p&gt;Alan will invest only in the top 10 most popular currencies. Every new year, he will go and check the top 10 cryptos by Market Cap and then equally invest between the top 10 cryptocurrencies. Charlie, on the other hand, will do the exact same thing with the only difference being that instead of the top 10, he will invest in the 90 next biggest cryptocurrencies.&lt;/p&gt;\n\n&lt;p&gt;They continue to do this over the next 8 years and now it’s 2022 and it’s time to see who has performed better.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/5u10wctsylv81.png?width=628&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=aacb02399d50dbd1d1874aba631a97dc354dbaab\"&gt;Returns shown here are till Jan 1st, 2022&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Would you look at that! Alan who has invested in only the top-10 cryptos did vastly better than Charlie who went for the riskier play of investing in the not so well known currencies. The top 10 cryptos on average performed 5x better than the next 90 and 2x better than just investing in Bitcoin. What’s even more interesting is that Charlie would have done 2x better just putting his money in Bitcoin - Ouch!&lt;/p&gt;\n\n&lt;h4&gt;Survival&lt;/h4&gt;\n\n&lt;p&gt;If you are wondering why Charlie is getting the lowest return in spite of taking the most risk[5], it’s because you are forgetting Rule 1 of investing - To not lose your initial investment.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/mmntwr9vylv81.png?width=714&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=6c69754b5cbf65bc865d87a11ea5116baf9f5a70\"&gt;https://preview.redd.it/mmntwr9vylv81.png?width=714&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=6c69754b5cbf65bc865d87a11ea5116baf9f5a70&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The probability of survival of a coin is extremely skewed towards the top 10 currencies. As you can see, over 80% of the top 10 coins from 2014 are still in existence today compared to only 26% of the rest. This trend keeps repeating over the years and your capital would have been decimated. Once it goes to zero, there is no way for it to come back up as any gain on $0 is still 0!&lt;/p&gt;\n\n&lt;h4&gt;Moonshots&lt;/h4&gt;\n\n&lt;p&gt;Finally, we come to what we are all here for! What are our chances of actually hitting a moonshot following this strategy?&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/j8oiifewylv81.png?width=404&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=fec161da3968b773bb1f96eca3da9c114da48cd9\"&gt;I have defined a 100x return as a Moonshot&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Well, your chances of hitting a moonshot are also much higher following the top-10 strategy. Overall, you had a 1 in 10 chance of getting a 10,000% return compared to the 1 in 30 chance of the riskier next-90 strategy.&lt;/p&gt;\n\n&lt;p&gt;The above chart also shows another interesting stat → Out of the 500+ cryptos that we analyzed, less than 4% of them ended up becoming a moonshot. Think about that for a min - Of all the cryptos you are likely to hear about (&lt;em&gt;as there is very less coverage if it’s not in the top 100&lt;/em&gt;), only 3-4% of them end up giving you those insane returns. You have similar chances betting on a single number on the Roulette wheel.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/23hva9qyylv81.png?width=391&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=9bf4c72e5515d1c77faa01aa82b29eaf590c6289\"&gt;https://preview.redd.it/23hva9qyylv81.png?width=391&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=9bf4c72e5515d1c77faa01aa82b29eaf590c6289&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;As you can see, of all our moonshots, Ethereum investment in 2016 ended up returning the most at a whopping 397,548%!&lt;/p&gt;\n\n&lt;h3&gt;Limitations&lt;/h3&gt;\n\n&lt;p&gt;It’s important to understand the limitations of the current analysis before trying to replicate it.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;Data&lt;/strong&gt; - As I discussed earlier, all the data is from coinmarketcap and I have assumed a coin is dead if it’s not listed in the following year’s data. This analysis is only as strong as the quality of input data [6]. I have done extensive QCs but feel free to play around with the raw data to see if I missed something.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Base Effect&lt;/strong&gt; - The market is considerably different now than it was in 2015-17. There is more awareness as well as penetration. So the future growth might not be as explosive as the one that we observed in the past decade, so you should be realistic about your return potential&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Intra Year Returns&lt;/strong&gt; - The current analysis only considers returns based on Jan 1st of every year starting from 2014. If we pick another date within the year, we might get slightly different results as there might have been ATHs and ATLs within the year which we are not capturing.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;h3&gt;Conclusion&lt;/h3&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;It&amp;#39;s not whether you&amp;#39;re right or wrong that&amp;#39;s important, but how much money you make when you&amp;#39;re right and how much you lose when you&amp;#39;re wrong — George Soros&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I started the analysis thinking that investing in the not-so-popular currencies is bound to give better returns as it’s more likely they are undervalued due to lower publicity and hype associated with them.&lt;/p&gt;\n\n&lt;p&gt;But, as we saw from the data, in the case of crypto it’s much more profitable just to invest in the top currencies. It’s like the case where being in the game is much more important than trying to hit it big and striking out!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;If you liked this post, you might like my other analysis on Crytpo:&lt;/em&gt;&lt;/strong&gt; &lt;a href=\"https://marketsentiment.substack.com/p/crypto-dca?s=w\"&gt;How to consistently make returns from the Crypto market by using Dollar Cost Averaging&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Data:&lt;/strong&gt; All the data used in the analysis &lt;a href=\"https://rows.com/market-sentiment/my-spreadsheets/untitled-spreadsheet-3-7fuGkqeJVN8gkvISEezt43/live\"&gt;&lt;strong&gt;can be found here&lt;/strong&gt;&lt;/a&gt; &lt;em&gt;(it’s a treasure-trove of information IMO as you can filter based on the rank, price, market cap - however you like it. All I ask is that if you can find a better strategy based on this data, do let us all know!)&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Footnotes&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;[1] The &lt;a href=\"https://dictionary.cambridge.org/us/dictionary/english/moonshot\"&gt;word&lt;/a&gt; itself is derived from the Apollo 11 spaceflight project and is often used to classify something that seems almost impossible.&lt;/p&gt;\n\n&lt;p&gt;[2] Extremely small coins are more likely to face liquidity issues, consolidated ownerships, and rug pulls.&lt;/p&gt;\n\n&lt;p&gt;[3] For comparison, the top 10 companies in S&amp;amp;P 500 only contribute &amp;lt;30% of the index and that itself is considered to be extremely skewed by some analysts.&lt;/p&gt;\n\n&lt;p&gt;[4] An equal-weighted index is where we invest equally regardless of the market cap of the crypto. All the famous indices like S&amp;amp;P500 are market cap-weighted - i.e, bigger companies get a bigger chunk of your investment&lt;/p&gt;\n\n&lt;p&gt;[5] I mean the 2,000% return is no joke → S&amp;amp;P 500 barely gave a 100% return over the same period. It’s all relative, eh!&lt;/p&gt;\n\n&lt;p&gt;[6] &lt;a href=\"https://en.wikipedia.org/wiki/Garbage_in,_garbage_out\"&gt;Garbage in, garbage out&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 760,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/FrawaCHFLzoTuAg3McvK4qlxFBtW0PDwyRmyFrZviOw.jpg?auto=webp&amp;s=ba3dccec3577bbff364a4956f8e737c6d1868c89",
          "width": 1200,
          "height": 800
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/FrawaCHFLzoTuAg3McvK4qlxFBtW0PDwyRmyFrZviOw.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=7a2f0a0c0671f350546edb3718ca1d4167bd81fd",
            "width": 108,
            "height": 72
          },
          {
            "url": "https://external-preview.redd.it/FrawaCHFLzoTuAg3McvK4qlxFBtW0PDwyRmyFrZviOw.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=0dcccff1bb38efa21e1e9e78d816c716b9e5186d",
            "width": 216,
            "height": 144
          },
          {
            "url": "https://external-preview.redd.it/FrawaCHFLzoTuAg3McvK4qlxFBtW0PDwyRmyFrZviOw.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=6fd79f8ca02c275633eb6678523e107c7103c72f",
            "width": 320,
            "height": 213
          },
          {
            "url": "https://external-preview.redd.it/FrawaCHFLzoTuAg3McvK4qlxFBtW0PDwyRmyFrZviOw.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=6fe2e5cc86fe195b249786d58f490a9bebc7f78c",
            "width": 640,
            "height": 426
          },
          {
            "url": "https://external-preview.redd.it/FrawaCHFLzoTuAg3McvK4qlxFBtW0PDwyRmyFrZviOw.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=9cdabf9a50543c69cb6c61efb7cfe8735f41f526",
            "width": 960,
            "height": 640
          },
          {
            "url": "https://external-preview.redd.it/FrawaCHFLzoTuAg3McvK4qlxFBtW0PDwyRmyFrZviOw.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=6978cc6820a695a09381b5e81246d6311630daaf",
            "width": 1080,
            "height": 720
          }
        ],
        "variants": {},
        "id": "CHRz47_k9KaK7odxFnplouXGALlYxiUQ4iM7g2tRcbc"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/uc9qga/moonshots_i_analyzed_3000_cryptos_over_the_last_8/",
  "subreddit": "CryptoCurrency",
  "id": "uc9qga",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "All of us have at least once wished we had made a similar play to the one that\nturned $17 into ~6M\n[https://www.benzinga.com/markets/cryptocurrency/21/05/21076574/he-invested-17-in-shiba-inu-now-he-has-almost-6m]\nor had gotten into the right crypto at the right…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちは皆、少なくとも一度は、17ドルを〜6億ドルにしたのと同じようなプレーをしてみたいと思ったことがあるはずです。\n1,700万ドルを〜600万ドルにした\n[https://www.benzinga.com/markets/cryptocurrency/21/05/21076574/he-invested-17-in-shiba-inu-now-he-has-almost-6m]\nあるいは、適切なタイミングで適切な暗号に手を出していれば......。",
      "title": "ムーンショット - 過去8年間に3,000以上の暗号を分析し、ムーンショットを見つけるべきかどうか、またどのように見つけるべきかを調べました：その結果がこちらです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们所有人都至少有一次希望自己能做一个类似的游戏，即\n将17美元变成~600万美元\n[https://www.benzinga.com/markets/cryptocurrency/21/05/21076574/he-invested-17-in-shiba-inu-now-he-has-almost-6m]\n或者在正确的时间进入正确的加密货币。",
      "title": "月光 - 我在过去8年中分析了3,000多种加密货币，看看你是否应该尝试寻找月光：结果如下。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們所有人都至少有一次希望自己能做一個類似的遊戲，即\n將17美元變成~600萬美元\n[https://www.benzinga.com/markets/cryptocurrency/21/05/21076574/he-invested-17-in-shiba-inu-now-he-has-almost-6m]\n或者在正確的時間進入正確的加密貨幣。",
      "title": "月光 - 我在過去8年中分析了3,000多種加密貨幣，看看你是否應該嘗試尋找月光：結果如下。"
    }
  ]
}