{
  "author": "mathroyale",
  "original_created_utc": 1656329178,
  "title": "What happens if the Ethereum merge fails?",
  "created_utc": 1656344134,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I found a number of articles explaining that if the Merge fails it will affect tokens dependent on it but nothing detailed.&lt;br/&gt;\nDoes anyone have any extensive research or article or video or any other resource addressing this topic in detail and the possible scenarios? &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;It won&amp;#39;t allow me to post below 500 characters so here&amp;#39;s some info on the merge.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;The Merge represents the joining of the existing execution layer of Ethereum (the Mainnet we use today) with its new proof-of-stake consensus layer, the Beacon Chain. It eliminates the need for energy-intensive mining and instead secures the network using staked ETH. A truly exciting step in realizing the Ethereum vision – more scalability, security, and sustainability.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s important to remember that initially, the Beacon Chain shipped separately from Mainnet. Ethereum Mainnet - with all it&amp;#39;s accounts, balances, smart contracts, and blockchain state - continues to be secured by proof-of-work, even while the Beacon Chain runs in parallel using proof-of-stake. The approaching Merge is when these two systems finally come together, and proof-of-work is replaced permanently by proof-of-stake.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 355,
  "permalink": "/r/CryptoCurrency/comments/vltae6/what_happens_if_the_ethereum_merge_fails/",
  "subreddit": "CryptoCurrency",
  "id": "vltae6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I found a number of articles explaining that if the Merge fails it will affect\ntokens dependent on it but nothing detailed.\nDoes anyone have any extensive research or article or video or any other\nresource addressing this topic in detail and the possible scenarios?\n\n\n\nIt won't allow me to post…"
}