{
  "author": "bigbear0083",
  "the_new_excerpt": "Good Saturday morning to all of you here on r/stocks [/r/stocks]. I hope\neveryone on this sub made out pretty nicely in the market this past week, and is\nready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week\nbeginning March 22nd, 2021.\n\n\nTHE…",
  "original_created_utc": 1616246788,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在r/stocks[/r/stocks]上，大家周六早上好。我希望\n每个人都在这个子上做了相当不错的市场在过去的一周，和是\n为未来新的交易周做好准备。\n\n以下是你需要知道的一切，让你为本交易周做好准备。\n从2021年3月22日开始。\n\n\n该...",
      "title": "2021年3月22日开始的交易周华尔街一周前瞻"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在r/stocks[/r/stocks]上，大家週六早上好。我希望\n每個人都在這個子上做了相當不錯的市場在過去的一週，和是\n爲未來新的交易周做好準備。\n\n以下是你需要知道的一切，讓你爲本交易周做好準備。\n從2021年3月22日開始。\n\n\n該...",
      "title": "2021年3月22日開始的交易周華爾街一週前瞻"
    }
  ],
  "title": "Wall Street Week Ahead for the trading week beginning March 22nd, 2021",
  "created_utc": 1616260744,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Good Saturday morning to all of you here on <a href=\"/r/stocks\">r/stocks</a>. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.</p>\n\n<p>Here is everything you need to know to get you ready for the trading week beginning March 22nd, 2021.</p>\n\n<h1><strong>The Fed could be a source of market volatility as Powell and others speak in the week ahead - <a href=\"https://www.cnbc.com/2021/03/19/fed-could-be-source-of-volatility-as-powell-speaks-in-week-ahead.html\">(Source)</a></strong></h1>\n\n<hr/>\n\n<blockquote>\n<p>The Federal Reserve could remain a source of angst for markets in the week ahead, with chairman Jerome Powell scheduled to testify twice before Congress and more than a dozen other Fed speeches expected.</p>\n\n<hr/>\n\n<p>The bond market’s reaction to the central bank this past week was unusually volatile.</p>\n\n<hr/>\n\n<p>Though the market was initially steady after the two-day Fed meeting and Powell’s briefing Wednesday, Thursday came with a big selloff in bonds and spiking rates. Traders reacted to the fact that the central bank is willing to let inflation and the economy run hot while the job market recovers.</p>\n\n<hr/>\n\n<p>In the approaching week, bond market professionals will be watching Powell and other member of the Fed for further cues.</p>\n\n<hr/>\n\n<p>“This is bonds’ — I wouldn’t call it day in the sun — it’s more like day in the tornado,” said Michael Schumacher, head of rate strategy at Wells Fargo. “Clearly the bond market is the one the equity market is watching right now, and normally that’s not the case.”</p>\n\n<hr/>\n\n<p>Stocks were lower on the week, with the Dow off about 0.5% and the S&amp;P 500, down 0.7%. The Nasdaq Composite was off 0.8% for the week.</p>\n\n<hr/>\n\n<p>The Russell 2000, however, was hit the hardest, losing close to 3% for the week.</p>\n\n<hr/>\n\n<p>Yields ratcheted higher as the market sold off. Bond yields move inversely to price.</p>\n\n<hr/>\n\n<p>The benchmark 10-year Treasury yield, which impacts mortgages and other loans, rose as high as 1.75% Thursday, a move of more than 10 basis points in less than a day. It was at 1.72% Friday afternoon.</p>\n\n<hr/>\n\n<p>“The bond move has been huge, and it’s starting to scare people,” said Schumacher.</p>\n\n<hr/>\n\n<p>“There’s been this question hanging out there for awhile: How much of an increase in yield can some of the higher octane stocks take?” he asked. “There’s no magic number, but as we speak, the 10-year is up 80 basis points this year. It’s incredible.”</p>\n\n<hr/>\n\n<h1>Powell speaks</h1>\n\n<hr/>\n\n<p>Powell testifies Tuesday and Wednesday before Congressional committees along with Treasury Secretary Janet Yellen on Covid relief efforts and the economy.</p>\n\n<hr/>\n\n<p>He also speaks on central bank innovation at a Bank for International Settlements event Monday morning.</p>\n\n<hr/>\n\n<p>Other central bank speakers this week include Fed Vice Chairman Richard Clarida, Vice Chairman Randal Quarles, Fed Governor Lael Brainard, and New York Fed President John Williams.</p>\n\n<hr/>\n\n<h1>Inflation and the Fed</h1>\n\n<p>There is also some key data.</p>\n\n<hr/>\n\n<p>Important releases include the personal consumption and expenditure data on Friday, which includes the PCE deflator, the Fed’s preferred inflation measure. Core PCE inflation was running at an annual pace of 1.5% in January.</p>\n\n<hr/>\n\n<p>The Federal Reserve this past week took no action at its two-day meeting, but it did present new economic projections including a forecast of 6.5% for gross domestic product this year. The central bank’s forecast now shows PCE inflation going to 2.4% this year, but falling to 2% next year.</p>\n\n<hr/>\n\n<p>The majority of Fed officials did not see any interest rate hikes through 2023.</p>\n\n<hr/>\n\n<p>Powell reiterated that the Fed sees just a temporary pickup in inflation this year because of the base effects against last year’s numbers when prices fell.</p>\n\n<hr/>\n\n<p>The central bank will target an average range of inflation around 2%, so that number could exceed that threshold for some time. It’s a change to the Fed’s ground rules, which makes the bond market nervous.</p>\n\n<hr/>\n\n<p>Normally, the Fed would hike interest rates if inflation flared up to avoid an overheating economy and avert a bust cycle.</p>\n\n<hr/>\n\n<p>“For the bond market, and the Fed, there is a communications problem and there’s a consensus problem. There can’t not be tension,” said Diane Swonk, chief economist at Grant Thornton.</p>\n\n<hr/>\n\n<p>“They will be trying to clarify the Fed’s message, but without a consensus on what those numbers and guardrails mean, it will be hard,” she said. “They will be explaining themselves as economists, and they’ll be speaking a different language than the bond market speaks.”</p>\n\n<hr/>\n\n<p>Leo Grohowski, chief investment officer at BNY Mellon Wealth Management, expects the bond market could be more volatile than stocks, and inflation would be problematic for both.</p>\n\n<hr/>\n\n<p>At some point, he expects there could be a 10% stock market correction, and inflation or a sharp move in bond yields could be a trigger.</p>\n\n<hr/>\n\n<p>“The market is trying to make sense of what could be perceived as a disconnect, between their economic projections and the Fed’s dual mandate of unemployment and inflation,” said Grohowski.</p>\n\n<hr/>\n\n<p>“Yet, they’re committed to keep short rates on hold until the end of 2023,” he said. “That’s what the market is struggling with. I think it’s unsettling to me to hear words like ‘overshoot.’”</p>\n\n<hr/>\n\n<p>Grohowski expects what he calls the ‘great rotation’ from tech and growth stocks into cyclicals and value to continue. Growth and tech have been most sensitive to rising rates, and the Nasdaq has corrected more than 10%.</p>\n\n<hr/>\n\n<p>“I think we’re in the sixth or seventh inning of a nine-inning game. It’s not over, but I think we’ve seen the lion’s share of the great rotation out of growth, into value,” said Grohowski. He said that view depends on the 10-year not rising much above 1.75%.</p>\n\n<hr/>\n\n<p>Grohowski is concerned by the Fed’s willingness to let inflation overshoot because inflation is a negative for stocks.</p>\n\n<hr/>\n\n<p>Supply chain issues are a concern. He pointed to Nike’s comments Thursday that its sales were hurt by port congestion, and also the shortage of semiconductors, which is impacting automobile production.</p>\n\n<hr/>\n\n<p>“Inflation expectations are troublesome for P/E [price-earnings] ratios,” Grohowski said. The [stock] market is trading at 22 times our estimate for this year’s earnings.”</p>\n\n<hr/>\n\n<p>He said the market is having difficulty reconciling the lack of any forecasted interest rate hikes versus the strength of the Fed’s economic forecast.</p>\n\n<hr/>\n\n<p>“If you ask me what I lose sleep over? ...It’s too much of a good thing. Too much of a good thing is being too accommodative,” Grohowski said.</p>\n\n<hr/>\n\n<h1>Bond market direction</h1>\n\n<p>Schumacher said there’s a chance the bond market could steady in the next couple of weeks, even if yields tick up.</p>\n\n<hr/>\n\n<p>He said corporate pension funds appear likely to reallocate capital into bonds before the end of the quarter March 31, and that could be supportive. Also as the Japanese fiscal year is set to begin, there could also be new buying in U.S. Treasurys because on a currency adjusted basis U.S. debt looks very cheap, Schumacher said.</p>\n\n<hr/>\n\n<p>He is also watching Treasury auctions in the coming week.</p>\n\n<hr/>\n\n<p>The Treasury auctions $60 billion 2-year notes Tuesday; $61 billion 5-year notes Wednesday, and $62 billion 7-year notes Thursday.</p>\n\n<hr/>\n\n<p>In particular, Schumacher is watching the 7-year auction, which drew poor demand last month.</p>\n\n<hr/>\n</blockquote>\n\n<h1><strong>This past week saw the following moves in the S&amp;P:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/KK3MVBa.png\">CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/2awyTVp.png\">CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Indices for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/tMS9TlD.png\">CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Futures Markets as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/Bc06DhO.png\">CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!</a>)</strong></h6>\n\n<h1><strong>Economic Calendar for the Week Ahead:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/WXJX7nC.png\">CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!</a>)</strong></h6>\n\n<h1><strong>Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/9jNMiei.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for the Past Week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/s2AQHPw.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Pullback/Correction Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/NmtC2YY.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Rally Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/ZizMvzO.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Most Anticipated Earnings Releases for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/cMfCPvA.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Here are the upcoming IPO&#39;s for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/VVJr800.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Friday&#39;s Stock Analyst Upgrades &amp; Downgrades:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/Al5OSb6.png\">CLICK HERE FOR THE CHART LINK #1!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/Pll3tyz.png\">CLICK HERE FOR THE CHART LINK #2!</a>)</strong></h6>\n\n<hr/>\n\n<blockquote>\n<h1>The Bull Market Is About To Turn One</h1>\n\n<hr/>\n\n<p>“The stock market is a giant distraction to the business of investing.” Jack Bogle, founder of Vanguard</p>\n\n<hr/>\n\n<p>First off, we hope everyone has a happy and safe Saint Patrick’s Day! We’ve had a lot of green out there over the past year and here’s to some more today and over the rest of 2021.</p>\n\n<hr/>\n\n<p>One year ago yesterday was one of the worst days in the history of the stock market, with the Dow losing 12.9%, the fourth worst day ever. In fact, only the ’29 crash, the ’87 crash, and the day after trading starting (after being halted for multiple months) in the midst of World War I in December 1915 were worse.</p>\n\n<hr/>\n\n<p>As the great Jack Bogle explained above, sometimes stock market volatility distracts us from our long-term goals. Many investors panicked and sold this time a year ago, only to see stocks soar higher, while bonds struggled and cash didn’t do anything. One of the most important takeaways from 2020 for long-term investors: it is important to have a plan in place before the skies turn dark.</p>\n\n<hr/>\n\n<p>As this current bull market nears the one-year anniversary of the March 23, 2020 lows, there will be a lot of reflection on how far we’ve come and where we could be going. The bottom line is the economy is recovering at a record pace, stocks are at all-time highs, and we’ll have the NCAA Tournament this year. Those are three things to be very grateful for.</p>\n\n<hr/>\n\n<p>So what happens now is the logical question? “The good news is previous bull markets have never been lower during the second year of their existence,” explained LPL Chief Market Strategist Ryan Detrick. “Although it won’t be an easy ride, investors need to remember that history is on the bulls’ side, as this bull market is still just an infant and continued gains are quite likely.”</p>\n\n<hr/>\n\n<p>As shown in the LPL Chart of the Day, the previous six bull markets since World War II all saw gains during their second year. The average bull market was up 43% one year in and up to 61% two years off the lows. It is worth noting that the current bull market is up close to 75%, making it the strongest start to a new bull market ever, besting the start to the 2009 bull market. But be aware, that bull was up 68% one year off the lows, but up 94% two years off the lows. In other words, strong gains continued (the green line below).</p>\n\n<h6><strong>(<a href=\"https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/03/Blog-3.17.21.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Solid Global Growth Outlook but Multi-Speed</h1>\n\n<hr/>\n\n<p>Last week we reviewed updated global economic growth forecasts from the Organisation for Economic Co-operation and Development (OECD), highlighting the significant increase in their gross domestic product (GDP) forecast for the United States this year. Clearly the Federal Reserve (Fed) 2021 is reading from the same playbook because they did the same thing yesterday.</p>\n\n<hr/>\n\n<p>Here we look into another set of OECD data points but this time its global leading indicators. As we have noted with the US version from the Conference Board’s Leading Economic Index, we believe these indicators can provide useful insight into where economies may be headed in the near term.</p>\n\n<hr/>\n\n<p>As you can see in our LPL Chart of the Day, leading indicators in Asia and the United States are pointing to better growth than in Europe. The global growth outlook is no doubt improving, but the recovery is multi-speed.</p>\n\n<hr/>\n\n<p>“Global growth should continue to steadily rise as economies reopen and vaccines are deployed, consistent with the message from global leading indicators” according to LPL Financial Equity Strategist Jeffrey Buchbinder. “When we peel back the onion, we see a stronger picture in the United States and Asia, while Europe is more of a mixed bag. That reflects frustratingly slow vaccine distribution in the Eurozone.”</p>\n\n<hr/>\n\n<h6><strong>(<a href=\"https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/03/3.18.21-Blog-Chart-2.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<hr/>\n\n<p>“The level of these indicators provide a valuable comparison across countries and regions. We also like to look at the momentum of these indicators to identify areas where the picture is getting better. On the chart below, you can see that the strongest momentum is found in Asia, particularly India and China, and the United States. Meanwhile, Japan is holding its own.</p>\n\n<hr/>\n\n<p>On the flip side, the growth outlook in most European economies has stalled, particularly in the United Kingdom. While the paused rollout of the AstraZeneca vaccine is part of the problem across Europe, we expect a strong vaccine program in the UK to help turn its economy around soon despite the country’s below-average LEI level and deteriorating momentum.</p>\n\n<hr/>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/03/3.18.21-Blog-Chart-3.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<hr/>\n\n<p>We continue to recommend investors focus their regional allocations on the United States and the Asia-heavy emerging markets. Global LEI data and the pace of vaccine distribution reinforce that positioning, as the global but multi-speed economic recovery from the pandemic continues.</p>\n\n<hr/>\n\n<p>More risk tolerant investors may want to consider a tactical allocation to Japan, where appropriate, given the country’s relative success containing COVID-19 and bold stimulus efforts.</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Leading Indicators Remain Stubbornly Tepid</h1>\n\n<hr/>\n\n<p>In almost every direction we turn, we see optimism mounting over a mid-2021 economic reacceleration. Unfortunately, it seems we will have to wait at least another month for that optimism to make their way into leading economic indicators in a major way.</p>\n\n<hr/>\n\n<p>On Thursday, March 18, the Conference Board released its February 2021 report detailing the latest reading for its Leading Economic Index (LEI), a composite of ten data series that tend to lead changes in economic activity. Many economic data points are backward looking, but we pay special ettention to the LEI, as it has a forward looking tilt to it. The index grew for the tenth month in a row, up 0.2% month over month in February, a decrease from January’s 0.5% pace.</p>\n\n<hr/>\n\n<p>While this print still suggests future economic growth ahead, it fell short of expectations that had begun to price in an economic reacceleration on the back of improving vaccination trends. The Conference Board did make special note that factors which may prove to be transient, such as bad weather and related supply chain disruptions, did affect several component indexes. Moreover, it stated that the recently passed $1.9 trillion fiscal stimulus plan, a similarly large economic growth factor to vaccine progress, was likely not yet fully priced into the LEI’s value.</p>\n\n<hr/>\n\n<p>Six of the ten components grew in February, while three declined and one remained flat. Average weekly initial claims for unemployment insurance, the ISM New Orders Index, and the interest rate spread led the way among positive contributors. Building permits, average weekly manufacturing hours, and average consumer expectations for business conditions detracted from the composite’s growth, while manufacturers’ new orders for nondefense capital goods excluding aircraft held steady.</p>\n\n<hr/>\n\n<p>As seen in the LPL Chart of the Day, despite some small head fakes, the monthly change in the index has generally sloped downward since its initial bounce off of the 2020 lows. This signals the index has been increasing at a decreasing rate, as COVID-19 mitigation measures have prevented a full-fledged resurgence. We expect this trendline to turn meaningfully upward once a durable reopening begins to gain traction.</p>\n\n<hr/>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/03/Blog-picture-3.19.21.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<hr/>\n\n<p>“In recent months, financial markets have been agressively pricing in a strong second leg to this economic recovery,” said LPL Financial Chief Market Strategist Ryan Detrick. “We are still waiting for much of the economic data to confirm the move, but believe it should not be far off given the extremely promising vaccination trends and large fiscal package that was just recently passed. We think it is a matter of when there is a surge in US GDP growth, and not if there will be a surge.”</p>\n\n<hr/>\n\n<p>We continue to believe that vaccinations are the key to a sustained recovery and distribution trends have been truly remarkable recently. The most at-risk segment of the population is largely vaccinated already and at this point, more people in the United States have been vaccinated than have contracted the virus. We now have three vaccines approved for emergency use authorization, and President Biden projects that we will have enough vaccine supply for every adult American by late spring. Furthermore, we have increased confirmation that vaccines appear to be effective at preventing transmission as well as symptoms. While growth of variant strains does present a risk, we believe the overwhelming majority of evidence points toward a promising second leg of this economic recovery, which we believe justifies a tilt toward cyclical opportunities over defensive investments in portfolios.</p>\n</blockquote>\n\n<hr/>\n\n<h6><strong>(<a href=\"https://i.imgur.com/Cy92IOW.png\">CLICK HERE FOR NEXT WEEK&#39;S MOST NOTABLE EARNINGS RELEASES!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/VSgEkbz.png\">CLICK HERE FOR NEXT WEEK&#39;S HIGHEST VOLATILITY EARNINGS RELEASES!</a>)</strong></h6>\n\n<h6><strong>([CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE MONDAY&#39;S MARKET OPEN!]())</strong></h6>\n\n<p>(N/A.)</p>\n\n<hr/>\n\n<p>Below are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:</p>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Monday 3.22.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/n5EE1ue.png\">CLICK HERE FOR MONDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Monday 3.22.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/ZT2EoIo.png\">CLICK HERE FOR MONDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Tuesday  3.23.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/JDpv81w.png\">CLICK HERE FOR TUESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Tuesday 3.23.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/OSzkmYK.png\">CLICK HERE FOR TUESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Wednesday 3.24.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/VVVrvLD.png\">CLICK HERE FOR WEDNESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Wednesday 3.24.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/9KQp42F.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Thursday 3.25.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/pBlDIyW.png\">CLICK HERE FOR THURSDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Thursday 3.25.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/aZ1VNu6.png\">CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 3.26.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/C9OJgI9.png\">CLICK HERE FOR FRIDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 3.26.21 After Market Close:</em></strong></h1>\n\n<h6>([CLICK HERE FOR FRIDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())</h6>\n\n<p>(NONE.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>GameStop Corp. $200.27</h1>\n\n<p><strong>GameStop Corp. (GME)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, March 23, 2021. The consensus earnings estimate is $1.46 per share on revenue of $2.21 billion and the Earnings Whisper ® number is $1.53 per share. Investor sentiment going into the company&#39;s earnings release has 38% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 14.96% with revenue increasing by 0.72%. Short interest has decreased by 78.9% since the company&#39;s last earnings release while the stock has drifted higher by 1,338.7% from its open following the earnings release to be 465.2% above its 200 day moving average of $35.43. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Thursday, March 4, 2021 there was some notable buying of 171,975 contracts of the $5.00 put expiring on Friday, April 9, 2021. Option traders are pricing in a 34.6% move on earnings and the stock has averaged a 11.0% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=GME&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Blink Charging Co. $38.24</h1>\n\n<p><strong>Blink Charging Co. (BLNK)</strong> is confirmed to report earnings at approximately 7:15 PM ET on Thursday, March 25, 2021. The consensus estimate is for a loss of $0.11 per share on revenue of $1.63 million and the Earnings Whisper ® number is ($0.09) per share. Investor sentiment going into the company&#39;s earnings release has 66% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 0.00% with revenue increasing by 132.19%. Short interest has increased by 194.6% since the company&#39;s last earnings release while the stock has drifted higher by 282.4% from its open following the earnings release to be 82.4% above its 200 day moving average of $20.97. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Friday, March 12, 2021 there was some notable buying of 1,655 contracts of the $39.00 call expiring on Friday, March 26, 2021. Option traders are pricing in a 14.9% move on earnings and the stock has averaged a 9.5% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=BLNK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Adobe Inc. $441.50</h1>\n\n<p><strong>Adobe Inc. (ADBE)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, March 23, 2021. The consensus earnings estimate is $2.79 per share on revenue of $3.76 billion and the Earnings Whisper ® number is $2.85 per share. Investor sentiment going into the company&#39;s earnings release has 77% expecting an earnings beat The company&#39;s guidance was for earnings of approximately $2.78 per share. Consensus estimates are for year-over-year earnings growth of 19.74% with revenue increasing by 21.64%. Short interest has increased by 8.9% since the company&#39;s last earnings release while the stock has drifted lower by 8.7% from its open following the earnings release to be 5.0% below its 200 day moving average of $464.68. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Monday, March 8, 2021 there was some notable buying of 869 contracts of the $460.00 call expiring on Friday, March 26, 2021. Option traders are pricing in a 5.5% move on earnings and the stock has averaged a 5.7% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=ADBE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>GrowGeneration Corp. $54.78</h1>\n\n<p><strong>GrowGeneration Corp. (GRWG)</strong> is confirmed to report earnings at approximately 4:15 PM ET on Wednesday, March 24, 2021. The consensus earnings estimate is $0.06 per share on revenue of $60.89 million and the Earnings Whisper ® number is $0.07 per share. Investor sentiment going into the company&#39;s earnings release has 83% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 700.00% with revenue increasing by 139.87%. Short interest has decreased by 60.6% since the company&#39;s last earnings release while the stock has drifted higher by 143.3% from its open following the earnings release to be 105.8% above its 200 day moving average of $26.62. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Monday, March 15, 2021 there was some notable buying of 665 contracts of the $40.00 put expiring on Friday, July 16, 2021. Option traders are pricing in a 15.5% move on earnings and the stock has averaged a 17.4% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=GRWG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Co-Diagnostics, Inc. $14.05</h1>\n\n<p><strong>Co-Diagnostics, Inc. (CODX)</strong> is confirmed to report earnings at approximately 4:00 PM ET on Thursday, March 25, 2021. The consensus earnings estimate is $0.49 per share on revenue of $24.99 million. Investor sentiment going into the company&#39;s earnings release has 86% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 590.00% with revenue increasing by 22,826.61%. Short interest has decreased by 38.9% since the company&#39;s last earnings release while the stock has drifted higher by 18.4% from its open following the earnings release to be 4.3% below its 200 day moving average of $14.68. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Wednesday, February 10, 2021 there was some notable buying of 708 contracts of the $3.00 put expiring on Friday, August 20, 2021. Option traders are pricing in a 23.3% move on earnings and the stock has averaged a 13.5% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=CODX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Winnebago Industries, Inc. $81.45</h1>\n\n<p><strong>Winnebago Industries, Inc. (WGO)</strong> is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, March 24, 2021. The consensus earnings estimate is $1.37 per share on revenue of $805.36 million and the Earnings Whisper ® number is $1.66 per share. Investor sentiment going into the company&#39;s earnings release has 74% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 104.48% with revenue increasing by 28.49%. Short interest has decreased by 4.9% since the company&#39;s last earnings release while the stock has drifted higher by 33.5% from its open following the earnings release to be 33.7% above its 200 day moving average of $60.94. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. Option traders are pricing in a 9.1% move on earnings and the stock has averaged a 11.3% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=WGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Tencent Music Entertainment Group $30.42</h1>\n\n<p><strong>Tencent Music Entertainment Group (TME)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Monday, March 22, 2021. The consensus earnings estimate is $0.11 per share on revenue of $1.28 billion and the Earnings Whisper ® number is $0.14 per share. Investor sentiment going into the company&#39;s earnings release has 68% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 0.00% with revenue increasing by 22.14%. The stock has drifted higher by 100.8% from its open following the earnings release to be 67.0% above its 200 day moving average of $18.22. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Friday, March 19, 2021 there was some notable buying of 8,785 contracts of the $35.00 call expiring on Friday, April 16, 2021. Option traders are pricing in a 8.8% move on earnings and the stock has averaged a 3.7% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=TME&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Seanergy Maritime Holdings Corp $1.19</h1>\n\n<p><strong>Seanergy Maritime Holdings Corp (SHIP)</strong> is confirmed to report earnings at approximately 9:00 AM ET on Wednesday, March 24, 2021. The consensus estimate is for a loss of $0.01 per share on revenue of $21.92 million. Investor sentiment going into the company&#39;s earnings release has 63% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 108.33% with revenue decreasing by 21.06%. Short interest has decreased by 44.9% since the company&#39;s last earnings release while the stock has drifted higher by 164.4% from its open following the earnings release to be 44.7% above its 200 day moving average of $0.82. The stock has averaged a 6.7% move on earnings in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=SHIP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<h1>DISCUSS!</h1>\n\n<p>What are you all watching for in this upcoming trading week?</p>\n\n<hr/>\n\n<p>I hope you all have a wonderful weekend and a great week ahead <a href=\"/r/stocks\">r/stocks</a>.</p>\n</div><!-- SC_ON -->",
  "score": 217,
  "permalink": "/r/stocks/comments/m970mg/wall_street_week_ahead_for_the_trading_week/",
  "subreddit": "stocks",
  "id": "m970mg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752821007
}