{
  "author": "LexiQ25",
  "original_created_utc": 1651386463,
  "title": "How do you actually know if you are attractive or not?",
  "created_utc": 1651422667,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Simply put i either look great or terrible on photos because I know my angles. I&amp;#39;m usually the center of attention when it is a flirtatious situation. &lt;/p&gt;\n\n&lt;p&gt;Thing is I dont feel like I&amp;#39;m not attractive but I also don&amp;#39;t think im really attractive. I do feel like people tell me I&amp;#39;m beautiful out of pity and I honestly have no idea on how to go about having a clear answer on whether or not I am attractive based of off looks only.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/uftr4d/how_do_you_actually_know_if_you_are_attractive_or/",
  "subreddit": "TooAfraidToAsk",
  "id": "uftr4d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Simply put i either look great or terrible on photos because I know my angles.\nI'm usually the center of attention when it is a flirtatious situation.\n\nThing is I dont feel like I'm not attractive but I also don't think im really\nattractive. I do feel like people tell me I'm beautiful out of pity…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "簡単に言うと、私は自分のアングルを知っているので、写真に写るのが上手か下手かです。\n私は普段からチャラチャラした場面で注目されることが多いです。\n\nは、私は魅力的でないような気がしないが、私はまた、本当にイムとは思わないです。\n魅力的だとは思っていません。私は、人々が哀れみから私を美しいと言うように感じる...。",
      "title": "実際に自分が魅力的かどうかを知るにはどうしたらいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "简单地说，我在照片上要么看起来很棒，要么很糟糕，因为我知道我的角度。\n在调情的情况下，我通常会成为注意力的中心。\n\n问题是我不觉得我没有吸引力，但我也不认为我真的没有吸引力。\n吸引力。我确实觉得人们告诉我我很美是出于怜悯......",
      "title": "你如何真正知道自己是否有吸引力？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "簡單地說，我在照片上要麼看起來很棒，要麼很糟糕，因爲我知道我的角度。\n在調情的情況下，我通常會成爲注意力的中心。\n\n問題是我不覺得我沒有吸引力，但我也不認爲我真的沒有吸引力。\n吸引力。我確實覺得人們告訴我我很美是出於憐憫......",
      "title": "你如何真正知道自己是否有吸引力？"
    }
  ]
}