{
  "author": "flovidchan",
  "the_new_excerpt": "Quick breakdown on PLTR:\n\n-Multiple new partnership announcements. Both government and private sector\ncontracts.\n\n-Nutty looking CEO with crazy hair who literally lives in a tree house. All he\ndoes is think about PLTR mooning when he isn't having sex or doing Qi Gong. He\ntold us that, this is not…",
  "original_created_utc": 1613330584,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "关于PLTR的快速分析。\n\n-多项新的伙伴关系宣布。政府和私营部门都有。\n合同。 -Nutty looking CEO with crazy hair who literally lives in a trins.\n\n-头发疯疯癫癫的Nutty looking CEO who literally lives in a tree house. 头发疯疯癫癫的CEO住在树屋里。他的所有\n当他没有做爱或做气功的时候，就会想到PLTR的月子。他\n告诉我们，这不是... ...",
      "title": "帕朗奎尔人崛起：最后的前线。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關於PLTR的快速分析。\n\n-多項新的夥伴關係宣佈。政府和私營部門都有。\n合同。 -Nutty looking CEO with crazy hair who literally lives in a trins.\n\n-頭髮瘋瘋癲癲的Nutty looking CEO who literally lives in a tree house. 頭髮瘋瘋癲癲的CEO住在樹屋裏。他的所有\n當他沒有做愛或做氣功的時候，就會想到PLTR的月子。他\n告訴我們，這不是... ...",
      "title": "帕朗奎爾人崛起：最後的前線。"
    }
  ],
  "title": "PALANQUEERS RISE: THE FINAL FRONTIER",
  "created_utc": 1613400559,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Quick breakdown on PLTR:</p>\n\n<p>-Multiple new partnership announcements. Both government and private sector contracts.</p>\n\n<p>-Nutty looking CEO with crazy hair who literally lives in a tree house. All he does is think about PLTR mooning when he isn&#39;t having sex or doing Qi Gong. He told us that, this is not speculation.</p>\n\n<p>-Company is creating literal skynet that will enslave us in an AI guided techno-hell, but can also do useful stuff like map out vaccine distribution efficiency.</p>\n\n<p>-Jan 26th was their demo day, which helped investors see the value of the software they&#39;ve been working on. Their website looks like a futuristic disney ride with dots and cool stuff floating around in space.</p>\n\n<hr/>\n\n<p>Earnings report is coming up THIS Tuesday PRE MARKET. PLTR has beaten earnings projections in the past. They should be able to do it again, and we will be on a moon mission except we will miss the moon entirely and land on mars. </p>\n\n<p>People are worried about the lock up expiration. Don&#39;t worry about that though, what are you gay? The ONLY thing PLTR has going against it is that the CEO doesn&#39;t wear a black turtle neck.</p>\n\n<p>Balls deep 28c 3/19</p>\n\n<h1>THE FIRE RISES /Bane</h1>\n</div><!-- SC_ON -->",
  "score": 1227,
  "permalink": "/r/wallstreetbets/comments/ljv8ju/palanqueers_rise_the_final_frontier/",
  "subreddit": "wallstreetbets",
  "id": "ljv8ju",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728633149
}