{
  "author": "NineteenSixtySix",
  "the_new_excerpt": "https://www.benzinga.com/node/20754519\n\nEven when Palantir announced on April 5 it had secured a five-year,\n$89.9-million contract with the National Nuclear Security Administration, the\nstock failed to recover. The bottom may be in, however, because on Thursday\nPalantir’s stock made a bullish break…",
  "original_created_utc": 1619163710,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://www.benzinga.com/node/20754519\n\n4月5日にPalantir社が発表した、米国国家核安全保障局との5年契約8990万ドルの契約でも\n4月5日にPalantir社が米国国家核安全保障局と5年間で899万ドルの契約を結んだと発表しても、株価は\nしかし、株価は回復しませんでした。しかし、木曜日にPalantirの株価が強気のブレークをしたので、底を打ったのかもしれません。\nパランティアの株価は強気のブレークをした。",
      "title": "パランティアの株価が強気にブレイク。次はどうなる？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.benzinga.com/node/20754519\n\n甚至当帕兰蒂尔公司在4月5日宣布它已经获得了一份为期五年。\n价值8990万美元的合同时，股价也未能回升。\n股票也未能恢复。然而，底部可能已经出现了，因为在周四\nPalantir公司的股票出现了看涨的突破......",
      "title": "Palantir的股票取得了看涨的突破。下一步是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.benzinga.com/node/20754519\n\n甚至當帕蘭蒂爾公司在4月5日宣佈它已經獲得了一份爲期五年。\n價值8990萬美元的合同時，股價也未能回升。\n股票也未能恢復。然而，底部可能已經出現了，因爲在週四\nPalantir公司的股票出現了看漲的突破......",
      "title": "Palantir的股票取得了看漲的突破。下一步是什麼？"
    }
  ],
  "title": "Palantir's Stock Makes A Bullish Break. What's Next?",
  "created_utc": 1619192018,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.benzinga.com/node/20754519\">https://www.benzinga.com/node/20754519</a></p>\n\n<p>Even when Palantir announced on April 5 it had secured a five-year, $89.9-million contract with the National Nuclear Security Administration, the stock failed to recover. The bottom may be in, however, because on Thursday Palantir’s stock made a bullish break upwards.</p>\n\n<p>Some options traders agree and bet over $529,655 Palantir’s stock is headed higher.</p>\n\n<p>The Palantir Chart: Palantir’s stock gapped down on Feb. 16 and began trading in a bullish falling wedge pattern. On Thursday, the stock broke out of the pattern and recaptured the eight-day exponential moving average (EMA) and on Thursday afternoon retested the top sloping line of the falling wedge. Palantir has also created a triple bottom pattern near support at the $21 mark, which is bullish.</p>\n\n<p>Although Palantir’s stock is trading above the eight-day EMA, it&#39;s still trading below the 21-day EMA with the eight-day EMA trending below the 21-day EMA, which is bearish. The stock has a gap left behind at the $30 point, however, and because gaps are filled 90% of the time, it&#39;s most likely Palantir will fill the overhead gap eventually.</p>\n\n<p>Bulls want Palantir’s stock to hold above the sloping line of the falling wedge and for an increase in bullish volume to push the stock up to its next resistance level at $25.21. If it can regain that level as support, it has room to fill the gap which coincides with the stock&#39;s next resistance level near $30.</p>\n\n<p>Bulls want Palantir’s stock to fall back into the falling wedge and continue to trade down until it loses support at $21.04. Under the $21 area, there is no support until $17.54</p>\n\n<p>Why It’s Important: When a sweep order occurs, it indicates the trader wanted to get into a position quickly and is anticipating an imminent large move in stock price. A sweeper pays market price for the call option instead of placing a bid, which sweeps the order book of multiple exchanges to fill the order immediately.</p>\n\n<p>These types of call option orders are usually made by institutions, and retail investors can find watching for sweepers useful because it indicates “smart money” has entered into a position.</p>\n</div><!-- SC_ON -->",
  "score": 66,
  "permalink": "/r/stocks/comments/mwq2dx/palantirs_stock_makes_a_bullish_break_whats_next/",
  "subreddit": "stocks",
  "id": "mwq2dx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776214688
}