{
  "author": "fanzakh",
  "original_created_utc": 1637585253,
  "title": "Government issued cryptos will never be able to replace BTC",
  "created_utc": 1637600640,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Some may fear that a government-issued crypto, e.g. USDC, will kill BTC. This is nonsense. It simply replaces wire transfer of USD with a blockchain. It does not allow for a truly free exchange of value between any two random places in the globe without a meddling intermediary. A government issued crypto will have all the festering deficiencies of a fiat. It will only waste energy thanks to the endless inflation and regulation.</p>\n</div><!-- SC_ON -->",
  "score": 176,
  "permalink": "/r/Bitcoin/comments/qzknr8/government_issued_cryptos_will_never_be_able_to/",
  "subreddit": "Bitcoin",
  "id": "qzknr8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Some may fear that a government-issued crypto, e.g. USDC, will kill BTC. This is\nnonsense. It simply replaces wire transfer of USD with a blockchain. It does not\nallow for a truly free exchange of value between any two random places in the\nglobe without a meddling intermediary. A government issued…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "政府発行の暗号、例えばUSDCがBTCを殺すのではないかと心配する人もいるかもしれない。これは\nナンセンスです。USDCは、米ドルの電信送金をブロックチェーンに置き換えただけです。これでは\n地球上のランダムな2つの場所の間で、干渉を受けることなく、真に自由な価値の交換を可能にするものではありません。\n真に自由な価値交換を可能にするものではありません。政府が発行する...",
      "title": "政府発行の暗号はBTCに取って代わることはできない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有些人可能担心，政府发行的加密货币，如USDC，会扼杀BTC。这是\n无稽之谈。它只是用区块链取代了美元的电汇。它并不\n它不允许在全球任何两个随机地点之间进行真正的自由价值交换，而没有一个干涉的中介。\n它不允许在全球任何两个随机的地方之间进行真正自由的价值交换，而没有一个干涉的中间人。一个政府发行的...",
      "title": "政府发行的加密货币将永远无法取代BTC"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有些人可能擔心，政府發行的加密貨幣，如USDC，會扼殺BTC。這是\n無稽之談。它只是用區塊鏈取代了美元的電匯。它並不\n它不允許在全球任何兩個隨機地點之間進行真正的自由價值交換，而沒有一個干涉的中介。\n它不允許在全球任何兩個隨機的地方之間進行真正自由的價值交換，而沒有一個干涉的中間人。一個政府發行的...",
      "title": "政府發行的加密貨幣將永遠無法取代BTC"
    }
  ]
}