{
  "author": "ToesyToeNails",
  "original_created_utc": 1652662365,
  "title": "My friend is complaining they are ugly. What's the best way of explaining it's the way they present themselves?",
  "created_utc": 1652682700,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My friend isn&amp;#39;t ugly, he just has a haircut that doesn&amp;#39;t suit him. Puts no thought into how he dresses (no colour coordination and his clothes don&amp;#39;t fit him properly) and he slouches a lot, he has a patchy, bushy beard that looks like pubes. Like it isn&amp;#39;t &lt;strong&gt;him&lt;/strong&gt; that&amp;#39;s ugly, he just puts zero effort into his appearance and if he did, he&amp;#39;d be a lot more confident in his appearance because as I said, he isn&amp;#39;t unattractive. It&amp;#39;s just poor maintenance.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/uqjv3i/my_friend_is_complaining_they_are_ugly_whats_the/",
  "subreddit": "NoStupidQuestions",
  "id": "uqjv3i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "My friend isn't ugly, he just has a haircut that doesn't suit him. Puts no\nthought into how he dresses (no colour coordination and his clothes don't fit\nhim properly) and he slouches a lot, he has a patchy, bushy beard that looks\nlike pubes. Like it isn't him that's ugly, he just puts zero effort…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "友人は不細工ではなく、ただ髪型が似合わないだけです。服装に気を遣わない\n服装に気を遣わず（カラーコーディネートもしないし、服も似合わない）、よく猫背になる。\n服装に気を遣わず（カラーコーディネートもせず、服も似合わない）、よく猫背になるし、ヒゲはふさふさで、まるで陰毛のようだ。\n陰毛のようだ。醜いのは本人ではなく、努力ゼロのような...。",
      "title": "私の友人は、彼らが醜いと訴えています。自分の見せ方のせいだと説明するにはどうしたらいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的朋友并不难看，他只是有一个不适合他的发型。对自己的穿着没有\n他对自己的着装没有任何想法（颜色不协调，衣服不合适\n他的衣服不合适），而且他经常懒洋洋的，他的胡子又多又密，看起来像阴毛。\n像阴毛。好像不是他丑，而是他没有付出任何努力......",
      "title": "我的朋友在抱怨他们很丑陋。有什么好的办法可以解释是他们表现自己的方式？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的朋友並不難看，他只是有一個不適合他的髮型。對自己的穿着沒有\n他對自己的着裝沒有任何想法（顏色不協調，衣服不合適\n他的衣服不合適），而且他經常懶洋洋的，他的鬍子又多又密，看起來像陰毛。\n像陰毛。好像不是他醜，而是他沒有付出任何努力......",
      "title": "我的朋友在抱怨他們很醜陋。有什麼好的辦法可以解釋是他們表現自己的方式？"
    }
  ]
}