{
  "author": "Gucci_Bane_",
  "the_new_excerpt": "ARKG weightings\n\nHey I'm relatively new to these ARK funds. I currently hold ten percent ARKK and\nwanted to put another 5 percent in another ARK fund and was hoping for ARKG.\nHowever when I go through the weightings of ARKG's holdings it seems they are a\nlot of small and medium cap companies. My…",
  "original_created_utc": 1613353886,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "ARKG权重\n\n嘿，我对这些ARK基金比较陌生。我目前持有10%的ARKK和\n想再投5%到另一只ARK基金，并希望能投ARKG。\n然而当我翻看ARKG的持股比重时，似乎他们是一\n很多中小市值的公司。我的...",
      "title": "ARKG"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "ARKG權重\n\n嘿，我對這些ARK基金比較陌生。我目前持有10%的ARKK和\n想再投5%到另一隻ARK基金，並希望能投ARKG。\n然而當我翻看ARKG的持股比重時，似乎他們是一\n很多中小市值的公司。我的...",
      "title": "ARKG"
    }
  ],
  "title": "ARKG",
  "created_utc": 1613378331,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>ARKG weightings</p>\n\n<p>Hey I&#39;m relatively new to these ARK funds. I currently hold ten percent ARKK and wanted to put another 5 percent in another ARK fund and was hoping for ARKG. However when I go through the weightings of ARKG&#39;s holdings it seems they are a lot of small and medium cap companies. My worry is that ARK owns around ten percent of these companies and this is quite a risky play.</p>\n\n<p>Does ARKG manage too much money for them to achieve what they want to do in ARKG or is my logic flawed. I truly believe genomics is a great ten year strategy but is this fund too big to be nimble enough to navigate this volatile area? I notice recently they are buying into bigger pharma companies (Roche, Takeda, Nov) is this just to park cash or is there an actual genomics play here. A quick glance at their pipeline I couldn&#39;t find much.</p>\n\n<p>Thanks for clearing this up as I&#39;m quite new to this.</p>\n\n<p>I also used <a href=\"https://www.etfrc.com/funds/overlap.php\">https://www.etfrc.com/funds/overlap.php</a> to find out the fund overlaps</p>\n</div><!-- SC_ON -->",
  "score": 84,
  "permalink": "/r/stocks/comments/lk2v21/arkg/",
  "subreddit": "stocks",
  "id": "lk2v21",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728624070
}