{
  "author": "SomeAnonymous",
  "original_created_utc": 1653317447,
  "title": "Pacific Island settlers journeying between islands must surely have travelled hundreds to thousands of kilometres with few, if any, opportunities to restock on food and fresh water. How might one pack for such a journey? What would you bring, and how confidently could you expect success?",
  "created_utc": 1653341835,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m struck at just how geographically isolated, say, the archipelago of Hawai&amp;#39;i is, for how it was first settled ca. 1000-1200 CE. The Wikipedia article gives the origin points for the first settlers as the Marquesas islands, which are over 3000km away from Hawaii, citing a paper by Patrick Kirch from 2011. &lt;/p&gt;\n\n&lt;p&gt;The logistics involved in such a trip feel almost impossible to grasp, especially in the context of the myriad dangers of travelling at sea without accurate timekeeping devices and now GPS satellites. &lt;/p&gt;\n\n&lt;p&gt;So, how did they do it? And (partly) separate from that, what were the cultural ideas and beliefs surrounding such exploration? Was it a community-sponsored and (hopefully) well-planned excursion with perhaps an expansionist mindset like many European journeys, something grounded more in desperation, when crops failed or overcrowding became a problem, or something else entirely?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/AskHistorians/comments/uw1z0u/pacific_island_settlers_journeying_between/",
  "subreddit": "AskHistorians",
  "id": "uw1z0u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm struck at just how geographically isolated, say, the archipelago of Hawai'i\nis, for how it was first settled ca. 1000-1200 CE. The Wikipedia article gives\nthe origin points for the first settlers as the Marquesas islands, which are\nover 3000km away from Hawaii, citing a paper by Patrick Kirch…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ハワイ諸島のような地理的に孤立した地域があることに驚かされます。\nハワイ諸島は地理的に孤立しており、1000年から1200年頃に初めて人が住み着いたと言われています。ウィキペディアの記事には\n最初の移住者の出身地はマルケサス諸島で、そこから3000km以上離れたところにあります。\nパトリック・キルヒの論文を引用して、ハワイから3000km以上離れたマルケサス諸島を最初の入植地としている...",
      "title": "太平洋諸島の入植者たちは、島と島の間を何百キロ、何千キロと移動し、食料と水を補給する機会もほとんどなかったに違いない。そのような旅には、どのような荷物が必要だったのだろうか。何を持参し、どの程度、成功を確信できるだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我感到震惊的是，夏威夷群岛在地理上是多么的孤立，比如说，它是如何在公元1000-1200年左右开始定居的？\n它是如何在公元1000-1200年首次定居的。维基百科的文章给出了\n第一批定居者的来源地是马克萨斯群岛，该群岛距离夏威夷有3000多公里。\n离夏威夷3000多公里，引用了Patrick Kirch的一篇论文...",
      "title": "太平洋岛屿的定居者在岛屿之间旅行时，肯定要走几百到几千公里的路程，很少有机会补充食物和淡水。一个人如何为这样的旅程打包？你会带些什么，你有多大的信心可以期待成功？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我感到震驚的是，夏威夷羣島在地理上是多麼的孤立，比如說，它是如何在公元1000-1200年左右開始定居的？\n它是如何在公元1000-1200年首次定居的。維基百科的文章給出了\n第一批定居者的來源地是馬克薩斯羣島，該羣島距離夏威夷有3000多公里。\n離夏威夷3000多公里，引用了Patrick Kirch的一篇論文...",
      "title": "太平洋島嶼的定居者在島嶼之間旅行時，肯定要走幾百到幾千公里的路程，很少有機會補充食物和淡水。一個人如何爲這樣的旅程打包？你會帶些什麼，你有多大的信心可以期待成功？"
    }
  ]
}