{
  "author": "SomeAnonymous",
  "original_created_utc": 1653317447,
  "title": "Pacific Island settlers journeying between islands must surely have travelled hundreds to thousands of kilometres with few, if any, opportunities to restock on food and fresh water. How might one pack for such a journey? What would you bring, and how confidently could you expect success?",
  "created_utc": 1653341835,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m struck at just how geographically isolated, say, the archipelago of Hawai&amp;#39;i is, for how it was first settled ca. 1000-1200 CE. The Wikipedia article gives the origin points for the first settlers as the Marquesas islands, which are over 3000km away from Hawaii, citing a paper by Patrick Kirch from 2011. &lt;/p&gt;\n\n&lt;p&gt;The logistics involved in such a trip feel almost impossible to grasp, especially in the context of the myriad dangers of travelling at sea without accurate timekeeping devices and now GPS satellites. &lt;/p&gt;\n\n&lt;p&gt;So, how did they do it? And (partly) separate from that, what were the cultural ideas and beliefs surrounding such exploration? Was it a community-sponsored and (hopefully) well-planned excursion with perhaps an expansionist mindset like many European journeys, something grounded more in desperation, when crops failed or overcrowding became a problem, or something else entirely?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/AskHistorians/comments/uw1z0u/pacific_island_settlers_journeying_between/",
  "subreddit": "AskHistorians",
  "id": "uw1z0u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm struck at just how geographically isolated, say, the archipelago of Hawai'i\nis, for how it was first settled ca. 1000-1200 CE. The Wikipedia article gives\nthe origin points for the first settlers as the Marquesas islands, which are\nover 3000km away from Hawaii, citing a paper by Patrick Kirch…"
}