{
  "author": "myke_oxbig45",
  "the_new_excerpt": "Is there a resource they gather information for real-time quotes on any given\nsecurity? I would think the data has to come from a non-profit free-to-public\nresource?\n\nAre there official exchange websites where they can use the data and code it\ninto their own websites? Would these be government…",
  "original_created_utc": 1619375959,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "どのようなセキュリティに対しても、リアルタイムで情報を収集することができるリソースはありますか？\nあるのでしょうか？そのデータは非営利で無料公開されているものでなければならないと思うのですが。\nリソースですか？\n\nデータを使用して自分のウェブサイトにコード化できる公式の取引所ウェブサイトはありますか？\n公式な取引所のウェブサイトはありますか？それは政府の...",
      "title": "マーケットサイトはどこからリアルタイムの情報を得ているのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是否有一个资源可以让他们收集任何特定证券的实时报价信息？\n证券的实时报价？我认为这些数据必须来自于一个非营利性的免费公共资源。\n资源？\n\n是否有官方的交易所网站，他们可以使用这些数据并将其编入自己的网站？\n到他们自己的网站上？这些会不会是政府...",
      "title": "市场网站的实时报价/数据来自哪里？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是否有一個資源可以讓他們收集任何特定證券的實時報價信息？\n證券的實時報價？我認爲這些數據必須來自於一個非營利性的免費公共資源。\n資源？\n\n是否有官方的交易所網站，他們可以使用這些數據並將其編入自己的網站？\n到他們自己的網站上？這些會不會是政府...",
      "title": "市場網站的實時報價/數據來自哪裏？"
    }
  ],
  "title": "Where do market websites get their real-time quotes/data from?",
  "created_utc": 1619387690,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Is there a resource they gather information for real-time quotes on any given security? I would think the data has to come from a non-profit free-to-public resource?</p>\n\n<p>Are there official exchange websites where they can use the data and code it into their own websites? Would these be government websites? I&#39;m curious where they get their data from. Any information on this would be helpful.</p>\n\n<p>Example: Where does <a href=\"https://Nasdaq.com\">Nasdaq.com</a> get their real-time information from? This is a complex question and I don&#39;t know if anyone would have the answer to it but I figured I would ask. </p>\n\n<p>&#x200B;</p>\n\n<p>•••I do not want to get my post removed so I am writing this to fill the word count requirement. I do not want to get my post removed so I am writing this to fill the word count requirement. I do not want to get my post removed so I am writing this to fill the word count requirement. I do not want to get my post removed so I am writing this to fill the word count requirement. ••••</p>\n</div><!-- SC_ON -->",
  "score": 126,
  "permalink": "/r/stocks/comments/myeiqu/where_do_market_websites_get_their_realtime/",
  "subreddit": "stocks",
  "id": "myeiqu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776215988
}