{
  "author": "Far-Cry2124",
  "original_created_utc": 1635314032,
  "title": "(19M) Am I being forced to grow up too fast or am I tweakin?",
  "created_utc": 1635336808,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Today my dad was trying to see how much money I was saving up. It&#39;s not alot but it&#39;s not terrible either. I&#39;ve been working my new job for 2 months and I should have over 2k. But instead it was 1k and some extra. He told me I am working for nothing if I keep spending it.</p>\n\n<p>I told him all of this is just a process and I thought to myself I thought he knew this better than anyone. Bills of my own come up. Like I was forced to spend 229 for a new phone because my old one was losing support from boost mobile. And not to mention phone bill and unexpected shit. </p>\n\n<p>I just feel like shit is moving so fast and nothing is just gradual. I&#39;ve been working so much with 2 jobs that neglected cleaning my room. I was so fed up that I ended up rearranging all my furniture, mopping/sweeping the floor and throwing away all the built up trash and let me tell you, it was so liberating! I was listening to some good 80s music too. It&#39;s crazy how I miss this music and I didn&#39;t even grow up in that era lol.</p>\n\n<p>I felt super happy when I was done and now my room looks ten times better! I feel so much more relaxed. But anyway, I&#39;m just trying the best I can to make it in this modern society. We all are. Sometimes I just wanna escape that. And meaningful work, friendships, and music is doing for me right now. Any advice?</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/qgpro3/19m_am_i_being_forced_to_grow_up_too_fast_or_am_i/",
  "subreddit": "TooAfraidToAsk",
  "id": "qgpro3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Today my dad was trying to see how much money I was saving up. It's not alot but\nit's not terrible either. I've been working my new job for 2 months and I should\nhave over 2k. But instead it was 1k and some extra. He told me I am working for\nnothing if I keep spending it.\n\nI told him all of this is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、父は私がどれだけお金を貯めているかを確認していました。大した額じゃないけど\n大した額ではないが、ひどい額でもない。新しい仕事を始めて2ヶ月、2,000円以上はあるはずだ。\n2,000円以上になるはずだった。しかし、その代わりに1,000ドルと少し余分にありました。彼は私に、このままお金を使い続けるなら、何のために働いているのか\n使ってしまうと、無駄に働いていることになると言われました。\n\n私は彼に、これらのすべては...",
      "title": "(19M)私は早すぎる成長を強いられているのか、それともツッコミを入れているのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天我爸爸想看看我攒了多少钱。这不是很多，但\n但也不是很糟糕。我已经做了两个月的新工作，我应该有两千多美元。\n有2千多美元。但是却只有1千和一些额外的钱。他告诉我，如果我继续花钱，就等于白干了。\n如果我继续花钱的话，我就白干了。\n\n我告诉他这些都是...",
      "title": "(19M)我是被迫成长得太快了还是我在调教？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天我爸爸想看看我攢了多少錢。這不是很多，但\n但也不是很糟糕。我已經做了兩個月的新工作，我應該有兩千多美元。\n有2千多美元。但是卻只有1千和一些額外的錢。他告訴我，如果我繼續花錢，就等於白乾了。\n如果我繼續花錢的話，我就白乾了。\n\n我告訴他這些都是...",
      "title": "(19M)我是被迫成長得太快了還是我在調教？"
    }
  ]
}