{
  "author": "spike142",
  "the_new_excerpt": "Obligatory: This is for education and entertainment purposes only, and not\nfinancial advice.\n\nOkay, I first off want to say that I am stoked to see all the new degenerates\nthat have decide to join this channel and dump their life savings into whatever\none hot stock we are bursting at the seems with…",
  "original_created_utc": 1610936279,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "义务的。这只是为了教育和娱乐的目的，而不是...\n财务咨询。\n\n好吧，我首先想说的是，看到所有新的堕落者，我很激动。\n决定加入这个渠道，并把一生的积蓄倾注到任何\n一个热门股票，我们是爆裂的似乎... ...",
      "title": "PSA：请停止使用 \"市价单\"，改用 \"限价单\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "義務的。這只是爲了教育和娛樂的目的，而不是...\n財務諮詢。\n\n好吧，我首先想說的是，看到所有新的墮落者，我很激動。\n決定加入這個渠道，並把一生的積蓄傾注到任何\n一個熱門股票，我們是爆裂的似乎... ...",
      "title": "PSA：請停止使用 \"市價單\"，改用 \"限價單\""
    }
  ],
  "title": "PSA: Please stop using \"Market Orders\" and Instead Use \"Limit Orders\"",
  "created_utc": 1610979836,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Obligatory: This is for education and entertainment purposes only, and not financial advice.</p>\n\n<p>Okay, I first off want to say that I am stoked to see all the new degenerates that have decide to join this channel and dump their life savings into whatever one hot stock we are bursting at the seems with at the time. It&#39;s an absolute strength in numbers &quot;win&quot; for the sub, and it give me more hope for the momentum we build here. </p>\n\n<p>HOWEVER, I saw a lot of the new crayon casserole lovers, who&#39;ve taken a break from watching their morning cartoons out there to dump your money into GME this week. Then coming on here and asking, &quot;I bought &quot;X number of shares at &quot;Y&quot; price, am I going to get rich now?&quot; </p>\n\n<p>As someone that has been doing this now for some ten plus years, this is a complete fucking rookie move! You want control over the situation, then use &quot;Limit Orders&quot; and assign the price at the proper support levels. You know who uses &quot;Limit Orders&quot; the bull with the 10 inch cock that comes over to fuck your wife every night while you sit in the corner chair and watch. Why you might ask? Because he&#39;s in control of the situation. He uses limit orders to buy the stock at a specific price instead of just sending the order to the markets makers to be assigned the highest price on the book for the day. So while you are buying that stock at $38.50, he&#39;s buying at a cool even $35.00, allowing him to capture 10% more on the upside. </p>\n\n<p>Perfect example is with GME, where the entire sub is screaming &quot;hold the line&quot; blah blah blah &quot;SPARTA&quot;. You want to hold the line? Then place those future orders at support levels like 33 or 30. That way if and when the stock drops to these levels you get the price you want and you help the stock from dropping even further. So be fucking smart and be patient about this, this is your money so make it work for you and not against you.  </p>\n\n<p>TLDR: Use limit orders if you really want to help control the underlying stock and make a smart investment. Be patient and wait for the price to come to you and so some fucking reasearch.</p>\n</div><!-- SC_ON -->",
  "score": 1407,
  "permalink": "/r/wallstreetbets/comments/kzkug9/psa_please_stop_using_market_orders_and_instead/",
  "subreddit": "wallstreetbets",
  "id": "kzkug9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311224167
}