{
  "author": "KuriousKountess",
  "original_created_utc": 1639344656,
  "title": "My friend's husband came onto me as soon as she went away to see family. How do I tell her he did this?",
  "created_utc": 1639365126,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A woman I&amp;#39;m friends with, and have been helping recently with her career progression, went away to go see her parents earlier this week as they were ill. Her husband contacted me the day she left, saying that she left some paperwork for me to look over at her house and I should come collect it. &lt;/p&gt;\n\n&lt;p&gt;As I&amp;#39;d been to their house several times before, I thought nothing of it and went to collect it this weekend. When I got there, her husband was there and had a whole meal prepared for me, and I joked I just came for papers, not lunch, but he insisted I eat and stay so I gave in and said sure. Then he asked me if I wanted tea or coffee and I said I wanted strong coffee if he had any. He brought out the coffee, spiked with alcohol, and I called him out and he insisted there was no alcohol, it was almond flavouring. And he also brought out some wine and poured me a glass, and I said I really shouldn&amp;#39;t but he insisted and I started feeling awkward and took it and had one sip but something felt off. He then came and sat next to me and moved in to grab me and kiss me; I pushed him off, and he said sorry &amp;quot;I was feeling faint&amp;quot;, which was total BS. And then he tried it again. &lt;/p&gt;\n\n&lt;p&gt;Anyway, I left, crying, forgetting that paperwork, which I later found out didn&amp;#39;t exist. And I feel so awful about the situation.&lt;/p&gt;\n\n&lt;p&gt;How do I tell my friend, that her husband, didn&amp;#39;t even wait 2 days for her to be out of town, before making a pass at me? I don&amp;#39;t want to wreck their marriage by telling her, but I also wouldn&amp;#39;t want a guy like that trapping another woman like this so am really conflicted about what to do.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/reyta4/my_friends_husband_came_onto_me_as_soon_as_she/",
  "subreddit": "TooAfraidToAsk",
  "id": "reyta4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A woman I'm friends with, and have been helping recently with her career\nprogression, went away to go see her parents earlier this week as they were ill.\nHer husband contacted me the day she left, saying that she left some paperwork\nfor me to look over at her house and I should come collect it.\n\nAs…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が友人で、最近彼女のキャリアを助けている女性がいます。\n今週初め、両親が体調を崩したため、お見舞いに出かけました。\nその日、彼女のご主人から連絡があり、「書類を置いていったよ」と言われ\nというのも、彼女の家で私が目を通すので、それを受け取りに来るようにとのこと。\n\nとして...",
      "title": "私の友人の夫は、彼女が家族に会いに行くとすぐに私に迫ってきました。どうやって伝えればいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "与我是朋友的一位女士，最近一直在帮助她的职业发展\n进展，本周早些时候去看她的父母，因为他们生病了。\n她的丈夫在她离开的那天联系了我，说她留下了一些文件资料\n让我在她家看一下，我应该来取它。\n\n由于...",
      "title": "我朋友的丈夫在她去看望家人的时候就来找我。我如何告诉她他这样做了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "與我是朋友的一位女士，最近一直在幫助她的職業發展\n進展，本週早些時候去看她的父母，因爲他們生病了。\n她的丈夫在她離開的那天聯繫了我，說她留下了一些文件資料\n讓我在她家看一下，我應該來取它。\n\n由於...",
      "title": "我朋友的丈夫在她去看望家人的時候就來找我。我如何告訴她他這樣做了？"
    }
  ]
}