{
  "author": "gorays21",
  "the_new_excerpt": "Nio sprang in a surprise for its investors on April Fools' day by reporting\ndeliveries that exceeded the tempered forecast the EV maker issued last week.\n\nNio delivered 7,257 cars for the month of March, the Chinese EV start-up said in\na statement released Thursday. This represented a record monthly…",
  "original_created_utc": 1617271363,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "尼奥在愚人节当天给投资者带来了一个惊喜，报告称\nNio在3月份交付了7,257辆汽车，超过了该电动车制造商上周发布的温和预测。\n\nNio在3月份交付了7,257辆汽车，这家中国电动车初创公司表示，在3月份，Nio的交付量超过了上周的预测。\n周四发布的一份声明。这代表着创纪录的月...",
      "title": "尼奥一季度交货量大增的报告"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "尼奧在愚人節當天給投資者帶來了一個驚喜，報告稱\nNio在3月份交付了7,257輛汽車，超過了該電動車製造商上週發佈的溫和預測。\n\nNio在3月份交付了7,257輛汽車，這家中國電動車初創公司表示，在3月份，Nio的交付量超過了上週的預測。\n週四發佈的一份聲明。這代表着創紀錄的月...",
      "title": "尼奧一季度交貨量大增的報告"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "Nioはエイプリルフールに、投資家の皆様にサプライズを提供しました。\n先週、EVメーカーが発表した控えめな予測を上回る販売台数を報告し、投資家を驚かせました。\n\n中国のEVメーカーであるNioは、3月に7,257台の自動車を出荷したと、同社のウェブサイトで発表しました。\n中国のEVベンチャー企業が木曜日に発表した声明によると これは、過去最高の月産台数となりました。",
      "title": "Nio、第1四半期の販売台数が大幅に増加"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "Nioはエイプリルフールに、投資家の皆様にサプライズを提供しました。\n先週、EVメーカーが発表した控えめな予測を上回る販売台数を報告し、投資家を驚かせました。\n\n中国のEVメーカーであるNioは、3月に7,257台の自動車を出荷したと、同社のウェブサイトで発表しました。\n中国のEVベンチャー企業が木曜日に発表した声明によると これは、過去最高の月産台数となりました。",
      "title": "Nio、第1四半期の販売台数が大幅に増加"
    }
  ],
  "title": "Nio Report Big Gains In First-quarter Deliveries",
  "created_utc": 1617277831,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Nio sprang in a surprise for its investors on April Fools&#39; day by reporting deliveries that exceeded the tempered forecast the EV maker issued last week.</p>\n\n<p>Nio delivered 7,257 cars for the month of March, the Chinese EV start-up said in a statement released Thursday. This represented a record monthly total and a 373% increase year-over-year.</p>\n\n<p>The break-up of the monthly total is as follows: 1,529 ES8s, 3,152 ES6s, both of which are all-electric SUVs, and 2,576 EC6 premium smart electric coupe SUVs.</p>\n\n<p>The quarterly number was at a record 20,060 vehicles, up 423% from the first quarter of 2020.</p>\n\n<p>Nio has outperformed its domestic rival XPeng Inc. (NYSE: XPEV), which reported earlier Thursday monthly deliveries that could not beat its January total.</p>\n\n<p><a href=\"https://m.benzinga.com/article/20440474\">https://m.benzinga.com/article/20440474</a></p>\n</div><!-- SC_ON -->",
  "score": 260,
  "permalink": "/r/stocks/comments/mhs1bl/nio_report_big_gains_in_firstquarter_deliveries/",
  "subreddit": "stocks",
  "id": "mhs1bl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961877895
}