{
  "author": "StardustAtSea",
  "original_created_utc": 1644770038,
  "title": "Why the heck do so many asian women NOT wanna date asian guys?",
  "created_utc": 1644778610,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a white dude and I&amp;#39;ve talked online with quite a few asian girls from all around Asia and almost all of them have told me they don&amp;#39;t date asisn guys. One girl I chatted with from the Philippines kept telling me about how she want white kids with the &amp;quot;white genes&amp;quot; Also just posting tiktoks none-stop on her story about asian girls wanting a tall white bf. It was actually kinda disturbing and a huge turn off because not only did she speak ill of all asian men but it was just gross to hear somebody talk to you in a way where they just want you for what sounds like &amp;quot;physical&amp;quot; reasons. Now I know how asian girls must feel around neckbeards, but how come there is sooo much colorism around asians?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/srmm1a/why_the_heck_do_so_many_asian_women_not_wanna/",
  "subreddit": "TooAfraidToAsk",
  "id": "srmm1a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm a white dude and I've talked online with quite a few asian girls from all\naround Asia and almost all of them have told me they don't date asisn guys. One\ngirl I chatted with from the Philippines kept telling me about how she want\nwhite kids with the \"white genes\" Also just posting tiktoks none…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は白人の男ですが、オンラインでかなりの数のアジア人の女の子と話をしたことがあります。\nアジア諸国では、ほとんどすべての人が、アジア人とは付き合わないと言っています。ある\nフィリピンの女の子とチャットしたんですが、その子がいかに\nまた、「白人の遺伝子」を持つ白人の子供も、チクトクと投稿しているだけで、誰も...",
      "title": "なぜ多くのアジア人女性はアジア人男性と付き合いたがらないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个白种人，我在网上和一些来自亚洲各地的亚洲女孩交谈过。\n几乎所有的人都告诉我他们不和亚洲人约会。有一个\n与我聊天的一个来自菲律宾的女孩一直告诉我，她希望有一个具有 \"白人基因 \"的白人孩子。\n有 \"白人基因 \"的白种人 也只是在网上发帖，没有...",
      "title": "为什么这么多亚洲女性不愿意和亚洲人约会？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個白種人，我在網上和一些來自亞洲各地的亞洲女孩交談過。\n幾乎所有的人都告訴我他們不和亞洲人約會。有一個\n與我聊天的一個來自菲律賓的女孩一直告訴我，她希望有一個具有 \"白人基因 \"的白人孩子。\n有 \"白人基因 \"的白種人 也只是在網上發帖，沒有...",
      "title": "爲什麼這麼多亞洲女性不願意和亞洲人約會？"
    }
  ]
}