{
  "author": "MajorBonesLive",
  "the_new_excerpt": "What the title says - but a little more background:\n\n\n\nI initiated a portfolio transfer from my Fidelity account to consolidate my\nholdings in my TDA and RH accounts. My TDA portfolio transferred without issue.\nHowever, I had bought a couple of stocks on margin on RH prior to initiating…",
  "original_created_utc": 1612828598,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说--但更多的是背景。\n\n\n\n我发起了一个投资组合转移 从我的富达帐户合并我的。\n在我的TDA和RH账户中的持有量。我的TDA投资组合顺利转移。\n然而，在启动之前，我在RH账户上用保证金买了几只股票。",
      "title": "将RH投资组合转移到富达 - RH关闭了我的头寸，并停用了我的账户。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說--但更多的是背景。\n\n\n\n我發起了一個投資組合轉移 從我的富達帳戶合併我的。\n在我的TDA和RH賬戶中的持有量。我的TDA投資組合順利轉移。\n然而，在啓動之前，我在RH賬戶上用保證金買了幾隻股票。",
      "title": "將RH投資組合轉移到富達 - RH關閉了我的頭寸，並停用了我的賬戶。"
    }
  ],
  "title": "Transferred RH Portfolio to Fidelity - RH closed my positions and deactivated my account",
  "created_utc": 1612841048,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What the title says - but a little more background:</p>\n\n<p>&#x200B;</p>\n\n<p>I initiated a portfolio transfer from my Fidelity account to consolidate my holdings in my TDA and RH accounts. My TDA portfolio transferred without issue. However, I had bought a couple of stocks on margin on RH prior to initiating the portfolio transfer. 2 of my 4 stocks on RH transferred to Fidelity and two remained behind in my RH account. I have received a notification from Fidelity that I have a margin debt that needs to be settle or they&#39;ll liquidate my positions to satisfy the margin debt.   </p>\n\n<p>I initiated another transfer to get the remaining stocks and cash balance from RH this morning and within an hour or two, RH had closed my positions and deactivated my account. The closed positions were converted to cash and added to my cash balance. I can withdraw some of my cash balance in my RH account to my bank account. But there&#39;s still some money that is not available to withdraw for some reason.   </p>\n\n<p>What am I supposed to do? Has anyone here had experience with portfolio transfers where RH just decided, &quot;Nah fk that. Close his positions and shut down the account&quot;?</p>\n</div><!-- SC_ON -->",
  "score": 584,
  "permalink": "/r/investing/comments/lfpj1g/transferred_rh_portfolio_to_fidelity_rh_closed_my/",
  "subreddit": "investing",
  "id": "lfpj1g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123199873
}