{
  "author": "BeraldGevins",
  "original_created_utc": 1639356127,
  "title": "Was cunnilingus a common practice in the mid-1700s?",
  "created_utc": 1639365126,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m sure you’re reading that question and thinking “why would you ask that?” I have been watching the Hulu original show The Great. It is wildly historically inaccurate in almost every way (but still hilarious), so I feel like I already know the answer, but I figured I would ask anyways. In this show, cunnilingus (eating pussy, going down on a girl, whatever you want to call it) is a sexual act that is brought up surprisingly often, and even talked about and treated like a treat for both men and women. My question is: how common was it for a man to perform this act on a woman? Was it viewed as outrageous? Normal? Did people just pretend that women had no pleasure in sex? And if it did happen, how was it treated? Was it a source of pride, like in the show? Or was it treated as something sinful or shameful, like in the Sopranos (a completely unrelated show, but the only other one I can think of where they talk about this). Thank you in advance for your answer!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 116,
  "permalink": "/r/AskHistorians/comments/rf2pqp/was_cunnilingus_a_common_practice_in_the_mid1700s/",
  "subreddit": "AskHistorians",
  "id": "rf2pqp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m sure you’re reading that question and thinking “why would you ask that?” I\nhave been watching the Hulu original show The Great. It is wildly historically\ninaccurate in almost every way (but still hilarious), so I feel like I already\nknow the answer, but I figured I would ask anyways. In this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "その質問を読んで、\"なぜそんなことを聞くのか \"と思われたのではないでしょうか。I\nは、Huluオリジナル番組「ザ・グレート」を見ています。歴史的に見ても荒唐無稽な内容で\nほとんどすべての面で不正確（それでも面白い）なので、もうすでに\nその答えはわかっているのですが、とにかく聞いてみようと思いました。この中で...",
      "title": "1700年代半ばには、クンニリングスは一般的な行為だったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信你在看到这个问题时，会想 \"你为什么要这么问？\" I\n我一直在看Hulu的原创节目《伟大》。它几乎在所有方面都与历史不符\n它几乎在所有方面都不准确（但仍然很搞笑），所以我觉得我已经知道了答案。\n所以我觉得我已经知道答案了，但我想我还是要问一下。在这个...",
      "title": "阴部性交在17世纪中期是一种常见的做法吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信你在看到這個問題時，會想 \"你爲什麼要這麼問？\" I\n我一直在看Hulu的原創節目《偉大》。它幾乎在所有方面都與歷史不符\n它幾乎在所有方面都不準確（但仍然很搞笑），所以我覺得我已經知道了答案。\n所以我覺得我已經知道答案了，但我想我還是要問一下。在這個...",
      "title": "陰部性交在17世紀中期是一種常見的做法嗎？"
    }
  ]
}