{
  "author": "DoNotGiveEAmoneyPLS",
  "original_created_utc": 1641739501,
  "title": "Do not touch leverage unless you have money to throw away.",
  "created_utc": 1641793219,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;2021 was a great year for me. I 10x&amp;#39;d my money investing into ATOM, SYS, HOT, LUNA, LRC etc. and I was way over the moon. I thought I was fucking invincible... &lt;/p&gt;\n\n&lt;p&gt;I was going around suggesting people to set stop limits, do not invest more money than you can afford and of course, I shilled for coins that I held. I had this baseless stupid confidence that comes with the money that I never had before.&lt;/p&gt;\n\n&lt;p&gt;Then came 2022... I was talking with my friends about decent coins they can potentially invest in and the topic of leverage came up. We talked about the potential money I could earn, calculated the amount I&amp;#39;d have if the coin I invested in mooned and then after dreaming about what I can do with the money I can potentially earn, it got to me... why not try out leverage on Binance and went right into 3x leverage. &lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t even bother checking the interest rate, I forgot about all the principles I had with coin trading and borrowed the maximum amount and went all in. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t fucking know what got to me. Hype threads that talk about potential moon, people around me asking for advice, the money that I never had before... I&amp;#39;d have held through the drop if this was just normal trading because I believe that it will always bounce back and maybe even go even further but with leverage... I cannot afford to hold. If whatever coin I buy drops even for a little bit I am left with no money and no way of earning what I lost back.&lt;/p&gt;\n\n&lt;p&gt;Now, I sold all the coins I owned for BUSD and I am on the brink of liquidation at margin level of 1.14. The interest rate is piling up, I barely slept last few days and I am literally sweating due to anxiety. &lt;/p&gt;\n\n&lt;p&gt;I just wanted a place where I can vent about my stupidity. Thanks for reading... or not reading. &lt;/p&gt;\n\n&lt;p&gt;*&lt;em&gt;tl;dr i am confident. i touch leverage. coin market goes boom. i am broke and fucked beyond measure. *&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;** point: don&amp;#39;t touch leverage unless you have enough that you can use money as a toilet paper. **&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 310,
  "permalink": "/r/CryptoCurrency/comments/rzt5mo/do_not_touch_leverage_unless_you_have_money_to/",
  "subreddit": "CryptoCurrency",
  "id": "rzt5mo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "2021 was a great year for me. I 10x'd my money investing into ATOM, SYS, HOT,\nLUNA, LRC etc. and I was way over the moon. I thought I was fucking\ninvincible...\n\nI was going around suggesting people to set stop limits, do not invest more\nmoney than you can afford and of course, I shilled for coins…"
}