{
  "author": "Hats_Hats_Hats",
  "original_created_utc": 1629179427,
  "title": "Was it really once normal for people to \"fall insensible\" and need weeks of medical care to recover from sudden shocks (e.g. deaths in the family or business failures)? If so, what has changed since? And if not, why does this seem commonly-accepted in books like Frankenstein and Sherlock Holmes?",
  "created_utc": 1629209816,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m not surprised that things like grief, trauma, and depression were worse-understood before.  I&#39;m talking about the specific trope of someone having to convalesce in bed (sometimes even remaining comatose or catatonic) for weeks or even months following a seriously upsetting event.</p>\n\n<p>That sort of thing doesn&#39;t seem to happen anymore.  Did it ever?  And if it didn&#39;t, why do books of the time seem to take for granted that readers will accept it as normal?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/p5xtgp/was_it_really_once_normal_for_people_to_fall/",
  "subreddit": "AskHistorians",
  "id": "p5xtgp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm not surprised that things like grief, trauma, and depression were\nworse-understood before. I'm talking about the specific trope of someone having\nto convalesce in bed (sometimes even remaining comatose or catatonic) for weeks\nor even months following a seriously upsetting event.\n\nThat sort of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "悲しみ、トラウマ、うつなどが\n以前はもっと理解されていたのですから。私が言いたいのは\n何週間も、あるいは何ヶ月もベッドで療養しなければならない（時には昏睡状態や緊張状態が続くこともある）という具体的な話です。\n療養しなければならないというものです。\n\nそのような...",
      "title": "かつては、突然のショック（家族の死や事業の失敗など）から立ち直るために、何週間も医療を必要とする「失神」することが本当に普通だったのでしょうか？もしそうなら、その後何が変わったのでしょうか？また、そうでないとしたら、フランケンシュタインやシャーロック・ホームズのような本では、なぜこのようなことが一般的に受け入れられているように見えるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我并不感到惊讶，像悲伤、创伤和抑郁症这样的事情在以前是不被理解的。\n以前对这些事情的理解更糟糕。我说的是一个人必须在床上疗养（有时甚至保持昏迷）的具体套路。\n躺在床上疗养（有时甚至保持昏迷或紧张状态）数周\n甚至几个月的严重不安事件。\n\n这类...",
      "title": "人们 \"失去知觉 \"并需要数周的医疗护理才能从突如其来的冲击（如家庭死亡或商业失败）中恢复过来，这真的曾经很正常吗？如果是这样，后来有什么变化？如果不是，为什么这在《弗兰肯斯坦》和《福尔摩斯》等书中似乎被普遍接受了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我並不感到驚訝，像悲傷、創傷和抑鬱症這樣的事情在以前是不被理解的。\n以前對這些事情的理解更糟糕。我說的是一個人必須在牀上療養（有時甚至保持昏迷）的具體套路。\n躺在牀上療養（有時甚至保持昏迷或緊張狀態）數週\n甚至幾個月的嚴重不安事件。\n\n這類...",
      "title": "人們 \"失去知覺 \"並需要數週的醫療護理才能從突如其來的衝擊（如家庭死亡或商業失敗）中恢復過來，這真的曾經很正常嗎？如果是這樣，後來有什麼變化？如果不是，爲什麼這在《弗蘭肯斯坦》和《福爾摩斯》等書中似乎被普遍接受了？"
    }
  ]
}