{
  "author": "LilGrunties",
  "the_new_excerpt": "Someone recently told me they heard of this culture that lived in the mountains\nin China somewhere that was isolated from the world for a very, very long time.\nThey said that this culture was completely led by women and that in their\nvocabulary they had no words for \"war\", \"rape\", or \"father\".\n\nThey…",
  "original_created_utc": 1620999107,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ある人が最近、中国の山奥で、とてもとても長い間、世界から隔離されて暮らしていた文化があると聞きました。\n中国の山奥に住んでいて、とてもとても長い間、世界から孤立していた文化があると聞きました。\nその文化は完全に女性が主導していて、彼らの語彙には「戦争」「レイプ」「父親」という言葉がないそうです。\n戦争」「レイプ」「父親」などの言葉はなかったそうです。\n\n彼らは...",
      "title": "中国の孤立した文化で、戦争もレイプもなかったらしいということを誰か知っていますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近有人告诉我，他们听说过这样一种文化，它生活在中国某地的山里，与世隔绝了很长一段时间。\n在中国的某个地方，与世界隔绝的时间非常非常长。\n他们说，这种文化完全由妇女领导，在他们的词汇中\n他们的词汇中没有 \"战争\"、\"强奸 \"或 \"父亲 \"等词汇。\n\n他们...",
      "title": "有谁知道中国有这种与世隔绝的文化，显然没有发生过战争或强奸？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近有人告訴我，他們聽說過這樣一種文化，它生活在中國某地的山裏，與世隔絕了很長一段時間。\n在中國的某個地方，與世界隔絕的時間非常非常長。\n他們說，這種文化完全由婦女領導，在他們的詞彙中\n他們的詞彙中沒有 \"戰爭\"、\"強姦 \"或 \"父親 \"等詞彙。\n\n他們...",
      "title": "有誰知道中國有這種與世隔絕的文化，顯然沒有發生過戰爭或強姦？"
    }
  ],
  "title": "Does anyone know of this isolated culture in China that apparently had no war or rape ever?",
  "created_utc": 1621018704,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Someone recently told me they heard of this culture that lived in the mountains in China somewhere that was isolated from the world for a very, very long time. They said that this culture was completely led by women and that in their vocabulary they had no words for &quot;war&quot;, &quot;rape&quot;, or &quot;father&quot;. </p>\n\n<p>They said this culture, which apparently was a city of nearly 30,000 people, escaped war with the Han or the Ming dynasty (I dont recall which she said, I think it was Ming) because they were so isolated in the mountains that the Hans didnt even know they were there. </p>\n\n<p>I took all this with a large grain of salt because this person has a habit of just believing stupid memes they see on facebook. I am not able to find any articles referencing this culture anywhere, despite searching (thought it is hard to craft a good search term for this). </p>\n\n<p>Does anybody know of this culture? Can someone send me a legitimate article on this subject matter? Is this real or is it just somr made up crap someone is trying to spread on social media?</p>\n\n<p>Edit&quot; it seems that it is the Musuo people and that they are a matriarchal society but this painting of it as a feminist utopia is not true at all. They do have rape and murder, thought technically they dint have specific words for murder vs just to kill. Rape is punished by death. Women are also extremely pressured to have babies, women are not seen as &quot;complete&quot; unless they have kids, which is ridiculous. So the propaganda going around about this being the perfect utopia is simply false. Here is a good article about it <a href=\"https://www.theguardian.com/lifeandstyle/2017/apr/01/the-kingdom-of-women-the-tibetan-tribe-where-a-man-is-never-the-boss\">https://www.theguardian.com/lifeandstyle/2017/apr/01/the-kingdom-of-women-the-tibetan-tribe-where-a-man-is-never-the-boss</a></p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/nc8onk/does_anyone_know_of_this_isolated_culture_in/",
  "subreddit": "AskHistorians",
  "id": "nc8onk",
  "is_self": true,
  "media": null,
  "is_video": false
}