{
  "author": "lazy_phoenix",
  "original_created_utc": 1652372404,
  "title": "Were \"white people\" enslaved in the Antebellum South?",
  "created_utc": 1652405413,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not just trying to start a flame war, I promise. I recently found out that Plessy in the famous Plessy V Ferguson was seven eighths white. That Plessy looked looked Caucasian (I heard he basically looked Caucasian). However because one of his great grandparents was African, he was determined to be African. I also know that the children Thomas Jefferson had with Sally Heming were at least three quarters white. Despite being three quarters white, they were still enslaved and even sold. Does that mean you could look basically white and still be a slave in the Antebellum South? Could they say &amp;quot;Sorry, I know you have blond hair, blue eyes, and skin paler than the moon but one of your great, great grandparents was black so you&amp;#39;re a slave.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/AskHistorians/comments/uo4tzq/were_white_people_enslaved_in_the_antebellum_south/",
  "subreddit": "AskHistorians",
  "id": "uo4tzq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm not just trying to start a flame war, I promise. I recently found out that\nPlessy in the famous Plessy V Ferguson was seven eighths white. That Plessy\nlooked looked Caucasian (I heard he basically looked Caucasian). However because\none of his great grandparents was African, he was determined to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "炎上狙いじゃないですよ、絶対。最近知ったのですが\n有名なPlessy V FergusonのPlessyは8分の7が白人だったそうです。あのPlessy\nは白人に見えた（基本的に白人に見えたらしい）。しかし、その理由は\n曽祖父母の一人がアフリカ人であったため、...",
      "title": "前世紀南部で「白人」は奴隷になったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是想挑起一场火焰战争，我保证。我最近发现\n著名的普莱西诉弗格森案中的普莱西是八分之七的白人。那个普莱西\n看起来是高加索人（我听说他基本上是高加索人）。然而，由于\n他的曾祖父母之一是非洲人，所以他决心要...",
      "title": "\"白人 \"在安息日的南方被奴役吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是想挑起一場火焰戰爭，我保證。我最近發現\n著名的普萊西訴弗格森案中的普萊西是八分之七的白人。那個普萊西\n看起來是高加索人（我聽說他基本上是高加索人）。然而，由於\n他的曾祖父母之一是非洲人，所以他決心要...",
      "title": "\"白人 \"在安息日的南方被奴役嗎？"
    }
  ]
}