{
  "author": "joechss",
  "original_created_utc": 1626406923,
  "title": "If you could only go all in one one crypto, but couldn’t touch it for ten years, what would it be (and why)?",
  "created_utc": 1626417042,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think 99.9999% of us in the sub wish we could go back in time and load up on $5 BTC, but that ship has sailed.  You cannot go back in time, but you can change your future.  If you have the ability to throw a large sum of fiat into one crypto, what would it be? </p>\n\n<p>I know you should DCA and should not put all your eggs in one basket, but if you had to go long on just one crypto, what would it be (and why)?</p>\n</div><!-- SC_ON -->",
  "score": 218,
  "permalink": "/r/CryptoCurrency/comments/ol8stj/if_you_could_only_go_all_in_one_one_crypto_but/",
  "subreddit": "CryptoCurrency",
  "id": "ol8stj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I think 99.9999% of us in the sub wish we could go back in time and load up on\n$5 BTC, but that ship has sailed. You cannot go back in time, but you can change\nyour future. If you have the ability to throw a large sum of fiat into one\ncrypto, what would it be?\n\nI know you should DCA and should not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちの99.9999%は、過去に戻って5ドルのBTCを購入したいと思っていると思います。\nしかし、それはもう過去の話です。過去に戻ることはできませんが、未来を変えることはできます。\n自分の未来を変えることはできます。大金のフィアットを1つの暗号に投じることができるとしたら、それは何でしょう？\nある暗号に投じることができるとしたら、それは何ですか？\n\nDCAをすべきで、すべきでないことはわかっていますが...。",
      "title": "もし、1つの暗号に全力で取り組み、10年間その暗号に触れることができないとしたら、それは何ですか（そしてその理由は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想我们99.9999%的人都希望我们能回到过去，装上5美元的BTC。\n5美元的BTC，但这艘船已经开走了。你不能回到过去，但你可以改变\n你的未来。如果你有能力将一大笔法币投入一种\n币，那会是什么？\n\n我知道你应该DCA，不应该...",
      "title": "如果你只能全身心投入一种加密货币，但十年内不能碰它，那会是什么（以及为什么）？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想我們99.9999%的人都希望我們能回到過去，裝上5美元的BTC。\n5美元的BTC，但這艘船已經開走了。你不能回到過去，但你可以改變\n你的未來。如果你有能力將一大筆法幣投入一種\n幣，那會是什麼？\n\n我知道你應該DCA，不應該...",
      "title": "如果你只能全身心投入一種加密貨幣，但十年內不能碰它，那會是什麼（以及爲什麼）？"
    }
  ]
}