{
  "author": "a-tiberius",
  "original_created_utc": 1638669409,
  "title": "If Bitmart's hack didn't scare you, you should take note",
  "created_utc": 1638697000,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is why we always say &amp;quot;not your keys, not your crypto&amp;quot;. Exchanges are inherently prone to attacks and hacks. Unless it happens to you, everyone seems to think that it&amp;#39;s not real or it can&amp;#39;t happen.&lt;/p&gt;\n\n&lt;p&gt;It does.&lt;/p&gt;\n\n&lt;p&gt;For those holding on Bitmart, I seriously hope there&amp;#39;s some kind of remediation from all of this. For everyone else holding their coins on exchanges, let this be a lesson that you should move your coins to cold storage or another type of storage that is away from a centralized exchange. Until then your coins will be at risk. This means your money will be at risk.&lt;/p&gt;\n\n&lt;p&gt;TLDR:&lt;/p&gt;\n\n&lt;p&gt;DON&amp;#39;T LET IT HAPPEN TO YOU!! PROTECT YOUR COINS, PROTECT YOUR INVESTMENT AND GET OFF EXCHANGES.&lt;/p&gt;\n\n&lt;p&gt;Thanks for coming to my Ted Talk&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/r94rwx/if_bitmarts_hack_didnt_scare_you_you_should_take/",
  "subreddit": "CryptoCurrency",
  "id": "r94rwx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is why we always say \"not your keys, not your crypto\". Exchanges are\ninherently prone to attacks and hacks. Unless it happens to you, everyone seems\nto think that it's not real or it can't happen.\n\nIt does.\n\nFor those holding on Bitmart, I seriously hope there's some kind of remediation\nfrom…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これが、私たちがいつも「あなたの鍵ではなく、あなたの暗号」と言う理由です。取引所というのは\n本来は攻撃やハッキングを受けやすいものです。自分の身に降りかからない限り、誰もが\n現実にはありえないこと、起こりえないことだと思っている。\n\n実際にあるのです。\n\nビットマートを持ってる人は、本気で何らかの救済措置があることを祈ります\nから...",
      "title": "Bitmartのハッキングに怖さを感じない人は要注意"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这就是为什么我们总是说 \"不是你的钥匙，不是你的加密货币\"。交易所是\n本身就很容易受到攻击和黑客攻击。除非它发生在你身上，否则每个人似乎\n认为这不是真的，也不可能发生。\n\n它确实发生了。\n\n对于那些持有Bitmart的人，我真的希望有某种补救措施\n从...",
      "title": "如果Bitmart的黑客攻击没有吓到你，你应该注意了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這就是爲什麼我們總是說 \"不是你的鑰匙，不是你的加密貨幣\"。交易所是\n本身就很容易受到攻擊和黑客攻擊。除非它發生在你身上，否則每個人似乎\n認爲這不是真的，也不可能發生。\n\n它確實發生了。\n\n對於那些持有Bitmart的人，我真的希望有某種補救措施\n從...",
      "title": "如果Bitmart的黑客攻擊沒有嚇到你，你應該注意了"
    }
  ]
}