{
  "author": "Lemonmule69",
  "the_new_excerpt": "This is it for any doubters out there. For all the anti ripple people. The sec\nis using ripple to come after crypto. They literally told the court that the\nripple case will cause so much damage to them they will not be able to enforce\ncases. Just remember the sec never gave Eth and btc clearance.…",
  "original_created_utc": 1623191083,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "疑う人にはこれを。リップル反対派の皆さんへ SECは\n暗号を狙うためにリップルを利用しています。彼らは文字通り、裁判所に\nリップルの訴訟は彼らに大きなダメージを与え、訴訟を行うことができなくなります。\nケースを実施することができなくなります。証券取引委員会はEthとBtcのクリアランスを決して行わなかったことを思い出してください....",
      "title": "リップルに対する複数のディスカバリー紛争で敗訴したSECは、この訴訟で敗訴した場合、暗号通貨分野での将来の執行訴訟に関連してSECに回復不能な損害を与えることになり、裁判所は判決を下す前にそのような結果を考慮すべきであると裁判所に警告しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是给任何怀疑者的。对于所有反波纹的人来说。安全局\n正在利用瑞波币来对付加密货币。他们真的告诉法院\n涟漪案将对他们造成巨大的损害，他们将无法执行\n案件。请记住，证券局从来没有给Eth和btc清除....。",
      "title": "在输掉对瑞波公司的几起证据纠纷后，美国证券交易委员会警告法院，如果输掉此案，将对美国证券交易委员会在加密货币领域的未来执法行动造成不可弥补的损失，法院在裁决前应考虑这种后果。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是給任何懷疑者的。對於所有反波紋的人來說。安全局\n正在利用瑞波幣來對付加密貨幣。他們真的告訴法院\n漣漪案將對他們造成巨大的損害，他們將無法執行\n案件。請記住，證券局從來沒有給Eth和btc清除....。",
      "title": "在輸掉對瑞波公司的幾起證據糾紛後，美國證券交易委員會警告法院，如果輸掉此案，將對美國證券交易委員會在加密貨幣領域的未來執法行動造成不可彌補的損失，法院在裁決前應考慮這種後果。"
    }
  ],
  "title": "After losing several discovery disputes against ripple, the SEC warns the Court that if it loses the case it will cause irreparable damage to the SEC related to future enforcement actions in the cryptocurrency space and the Court should consider such consequences before ruling.",
  "created_utc": 1623206465,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is it for any doubters out there. For all the anti ripple people. The sec is using ripple to come after crypto. They literally told the court that the ripple case will cause so much damage to them they will not be able to enforce cases. Just remember the sec never gave Eth and btc clearance. They were only opinions from Jay Clayton and Bill Hinman. They will come after miners, vitalik....everyone.</p>\n</div><!-- SC_ON -->",
  "score": 2413,
  "permalink": "/r/CryptoCurrency/comments/nvgd4r/after_losing_several_discovery_disputes_against/",
  "subreddit": "CryptoCurrency",
  "id": "nvgd4r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404884253
}