{
  "author": "Psychological-Bill-8",
  "original_created_utc": 1657763820,
  "title": "What was Anarchosyndicist Catalonia like in practice?",
  "created_utc": 1657793249,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As someone who has recently started to read Homage To Catalonia, from a historical perspective was Orwell&amp;#39;s testimony of the POUM accurate or just rose tinted glasses? Was it democratic and could its economy/political system subsist without the war economy? How did Hitler react to the POUM having trotskyists embedded within it? Can Rojava and the Zapatistas be used as a modern analogue?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/vyk68k/what_was_anarchosyndicist_catalonia_like_in/",
  "subreddit": "AskHistorians",
  "id": "vyk68k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As someone who has recently started to read Homage To Catalonia, from a\nhistorical perspective was Orwell's testimony of the POUM accurate or just rose\ntinted glasses? Was it democratic and could its economy/political system subsist\nwithout the war economy? How did Hitler react to the POUM having…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "から、最近「カタルーニャへのオマージュ」を読み始めた者です。\n歴史的な観点から、オーウェルのPOUMの証言は正確だったのでしょうか、それともただのバラ色眼鏡だったのでしょうか？\nなのでしょうか？民主的で、経済的・政治的なシステムは維持できたのでしょうか？\n戦争経済がなければ成り立たないのか？ヒトラーは、POUMが戦争に巻き込まれたことにどう反応したのだろうか。",
      "title": "アナコシンジストのカタルーニャは、実際にはどのようなところだったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个最近开始阅读《向加泰罗尼亚致敬》的人，从一个\n从历史的角度来看，奥威尔对POUM的证词是准确的还是只是玫瑰色的？\n色的眼镜？它是否民主，它的经济/政治制度是否能在无政府状态下生存？\n没有战争经济，它的经济/政治体系能否生存？希特勒对POUM有什么反应？",
      "title": "无政府主义的加泰罗尼亚在实践中是怎样的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個最近開始閱讀《向加泰羅尼亞致敬》的人，從一個\n從歷史的角度來看，奧威爾對POUM的證詞是準確的還是隻是玫瑰色的？\n色的眼鏡？它是否民主，它的經濟/政治制度是否能在無政府狀態下生存？\n沒有戰爭經濟，它的經濟/政治體系能否生存？希特勒對POUM有什麼反應？",
      "title": "無政府主義的加泰羅尼亞在實踐中是怎樣的？"
    }
  ]
}