{
  "author": "OnlyFundamentals",
  "original_created_utc": 1635513164,
  "title": "Day 1 - Is Polygon (MATIC) undervalued?",
  "created_utc": 1635535844,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>\\</em>Today is Day 1 of me doing full-time in cryptocurrency as a publisher. Hope I can get support from the community. 6 months of reserve left for my family and I** </p>\n\n<p>I&#39;m a rather new publisher learning about crypto and I hope you can join in this adventure with me and understand my efforts. I appreciate if there is minimal hate and more on guidance :)</p>\n\n<h1>Who is Polygon?</h1>\n\n<p>Based on their website, Polygon is a protocol and framework for creating and linking Ethereum-compatible blockchain networks. Aggregating scalable Ethereum solutions to support a multi-chain Ethereum environment.</p>\n\n<p>Polygon addresses Blockchain-related issues such as expensive gas fees and poor performance without losing security. This multi-chain method is similar to others such as Polkadot, Cosmos, and Avalanche, but with at least three main advantages:</p>\n\n<ol>\n<li>It can reap the full benefits of Ethereum&#39;s network effects.</li>\n<li>It is more secure</li>\n<li>It is more accessible and powerful.</li>\n</ol>\n\n<p>However base on their website, there are potential challenges that may arise as well:</p>\n\n<ol>\n<li>Low throughput</li>\n<li>Poor gas, delayed PoW finality</li>\n<li>No sovereignty</li>\n</ol>\n\n<p>Even though there were challenges faced, their solution are unique:</p>\n\n<ol>\n<li>Adaptor modules for enabling interoperability for existing blockchain networks</li>\n<li>Growing set of modules for developing customer networks</li>\n<li>1 click deployment of preset blockchain networks.</li>\n</ol>\n\n<h1>Let&#39;s look at the fundamentals of it</h1>\n\n<p>It is not as easy to create fundamental basis in cryptocurrency but there are a few metrics we can use. Polygon&#39;s token, MATIC, is the basic resource that powers the Polygon ecosystem. In addition to being an asset, it is primarily utilized for staking tokens (proof-of-stake algorithm) to protect the Polygon network.</p>\n\n<p>The MATIC token has a maximum quantity of 10 billion, more than 67% of which is now in circulation. It is now ranked among the top 25 cryptocurrencies in the world.</p>\n\n<h1>Collaborations</h1>\n\n<p>Polygon established a collaboration with Infosys Ltd&#39;s consulting division. M-Setu is the name of this partnership. It intends to empower Infosys to give its clients with disruptive technology. M-Setu will serve as an open-source bridge that will allow businesses to collaborate utilizing the Ethereum blockchain.</p>\n\n<p>Another significant Polygon collaboration is the Trace Network. Trace is now employing it for NFT and DeFi, with the goal of becoming a go-to for shops to introduce NFTs to the public. For example, if a luxury business wanted to do NFTs on their items, the combination between trace and polygon would provide them with liquidity aggregation, comprehensive transparency, and supply chain traceability.</p>\n\n<p>Polygon made a tremendous announcement on May 29th, in addition to several other significant achievements. It announced the completion of a project to integrate the Polygon elements into Google Cloud&#39;s BigQuery. This connection allows BigQuery users to connect to Polygon, boosting its usability and positioning. Polygon has been added to Google Cloud&#39;s BigQuery&#39;s 1TB offering. This means that BigQuery users can utilize Polygon to execute queries and access various blockchain-related data sets on its network.</p>\n\n<h1>Billionaire Mark Cuban backs Polygon</h1>\n\n<p>On May 25, Mark Cuban threw his support behind this Indian Blockchain business. He disclosed that he has made an investment in Polygon, which can be seen in his company&#39;s portfolio on their website. Cuban is well-known for his support for cryptocurrency. Despite Elon Musk&#39;s temporary suspension of taking Bitcoin payments for Tesla, Cuban declared that the Mavericks (his basketball outfit brand) would continue to accept cryptos.</p>\n\n<p>He noted that having a high Transaction Per Second (TPS) as Polygon offers is critical to lowering consumers&#39; use costs. Furthermore, Polygon already has many blockchain initiatives, which adds to his motives for investing.</p>\n\n<p>Polygon&#39;s flawless growth has been aided by Cuban&#39;s funding. Polygon should expect higher adoption in the future as a cryptocurrency backed by the billionaire investor who backed Bitcoin, Ethereum, and other other cryptocurrencies.</p>\n\n<h1>Major Announcement</h1>\n\n<p>Another significant announcement that is going to be made is the launch of Indian Premier League fan tokens backed by Polygon. The IPL is by far the most popular sporting league, with millions of supporters not only in India but all around the world. The League&#39;s active embrace of these currencies would draw in a large number of fans to the network, as well as aid to bring crypto into the mainstream. This would be big for the Indian crypto business, but it remains to be seen how this would be structured, as crypto is not yet legal in India.</p>\n\n<p>&#x200B;</p>\n\n<p>Source:</p>\n\n<p><a href=\"https://economictimes.indiatimes.com/markets/cryptocurrency/heres-how-india-based-polygonmatic-outperformed-other-major-cryptos/articleshow/83329658.cms\">https://economictimes.indiatimes.com/markets/cryptocurrency/heres-how-india-based-polygonmatic-outperformed-other-major-cryptos/articleshow/83329658.cms</a></p>\n\n<p><a href=\"https://polygon.technology/\">https://polygon.technology/</a></p>\n\n<p><a href=\"https://financefeeds.com/polygon-matic-exciting-developments-planned-sports/\">https://financefeeds.com/polygon-matic-exciting-developments-planned-sports/</a></p>\n\n<p><a href=\"https://help.coinbase.com/en/coinbase/getting-started/crypto-education/polygon#:%7E:text=Polygon%20(MATIC\">https://help.coinbase.com/en/coinbase/getting-started/crypto-education/polygon#:~:text=Polygon%20(MATIC)%20is%20an%20Ethereum,and%20new%20classes%20of%20assets.%E2%80%9D</a>%20is%20an%20Ethereum,and%20new%20classes%20of%20assets.%E2%80%9D)</p>\n\n<p><a href=\"https://www.blockchain-council.org/ethereum/what-is-polygon-matic-how-does-polygon-work/\">https://www.blockchain-council.org/ethereum/what-is-polygon-matic-how-does-polygon-work/</a></p>\n\n<p><a href=\"https://marketrealist.com/p/matic-price-prediction-good-investment/\">https://marketrealist.com/p/matic-price-prediction-good-investment/</a></p>\n</div><!-- SC_ON -->",
  "score": 204,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/fDiOJvPaMHFRh5VVgkrx4341p9i1TJZTHg-KeUJgurE.jpg?auto=webp&s=0cf45a5350c00468a365722857753fdde3fbdf73",
          "width": 1070,
          "height": 580
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/fDiOJvPaMHFRh5VVgkrx4341p9i1TJZTHg-KeUJgurE.jpg?width=108&crop=smart&auto=webp&s=37f1d62987ded83c8db3d800729a8786a243f68e",
            "width": 108,
            "height": 58
          },
          {
            "url": "https://external-preview.redd.it/fDiOJvPaMHFRh5VVgkrx4341p9i1TJZTHg-KeUJgurE.jpg?width=216&crop=smart&auto=webp&s=a74425141f6013a46ee493659a0876046639f7b3",
            "width": 216,
            "height": 117
          },
          {
            "url": "https://external-preview.redd.it/fDiOJvPaMHFRh5VVgkrx4341p9i1TJZTHg-KeUJgurE.jpg?width=320&crop=smart&auto=webp&s=5cab22f87f7f407e03e4d4b1e79f0bb37cc270bc",
            "width": 320,
            "height": 173
          },
          {
            "url": "https://external-preview.redd.it/fDiOJvPaMHFRh5VVgkrx4341p9i1TJZTHg-KeUJgurE.jpg?width=640&crop=smart&auto=webp&s=ceef58661b63c8ace927ab08b5f524ed9ef25ae0",
            "width": 640,
            "height": 346
          },
          {
            "url": "https://external-preview.redd.it/fDiOJvPaMHFRh5VVgkrx4341p9i1TJZTHg-KeUJgurE.jpg?width=960&crop=smart&auto=webp&s=29e8b4e889d198c8a9298988ac4473c126419a32",
            "width": 960,
            "height": 520
          }
        ],
        "variants": {},
        "id": "xUP5JeGDSr020TsWs3jWVotXwCUN4xMs9Nzot4-LXGE"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/qicis0/day_1_is_polygon_matic_undervalued/",
  "subreddit": "CryptoCurrency",
  "id": "qicis0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "\\Today is Day 1 of me doing full-time in cryptocurrency as a publisher. Hope I\ncan get support from the community. 6 months of reserve left for my family and\nI**\n\nI'm a rather new publisher learning about crypto and I hope you can join in this\nadventure with me and understand my efforts. I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\\今日は、私がパブリッシャーとして暗号通貨でフルタイムでやっていく1日目です。コミュニティからの\nコミュニティからのサポートが得られることを願っています。家族のために6ヶ月分の蓄えが残っています。\nI**\n\n私は暗号について学んでいる新米のパブリッシャーですが、皆さんが私と一緒にこの冒険に参加し、私の努力を理解してくれることを願っています。\nこの冒険に一緒に参加して、私の努力を理解していただければ幸いです。I...",
      "title": "1日目】ポリゴン(MATIC)は割安なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\\Today is Day 1 of me doing full-time in cryptocurrency as a publisher. 希望我\n能得到社区的支持。6个月的储备留给我的家人和\nI**\n\n我是一个学习加密货币的新出版商，我希望你能加入这个\n冒险，并理解我的努力。I...",
      "title": "第一天 - Polygon (MATIC)的价值被低估了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\\Today is Day 1 of me doing full-time in cryptocurrency as a publisher. 希望我\n能得到社區的支持。6個月的儲備留給我的家人和\nI**\n\n我是一個學習加密貨幣的新出版商，我希望你能加入這個\n冒險，並理解我的努力。I...",
      "title": "第一天 - Polygon (MATIC)的價值被低估了嗎？"
    }
  ]
}