{
  "author": "ehh_what_evs",
  "the_new_excerpt": "One of their tips: \"Keep the majority of your crypto offline in a hardware\nwallet. Only keep the funds you need for trading and other activities on\nKraken.\"\n\nThe fact that they want people to get crypto off their platform is an indicator\nthat they are customer-centric. They'd benefit if people kept…",
  "original_created_utc": 1619194524,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼らのヒントの一つ。\"ハードウェアウォレットでオフラインの暗号の大部分を保持する。\nウォレットに入れておく。取引やその他の活動に必要な資金だけをKrakenに置いてください。\nKraken \"です。\n\n人々が自分たちのプラットフォームから暗号を手に入れることを望んでいるということは、彼らが顧客中心主義であることを示しています。\n彼らが顧客中心主義であることを示しています。彼らは、人々が...",
      "title": "Krakenがログインページでお客様に伝えていること。\"Not your keys, not your coins\"。このようなビジネスを私は支持します"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他们的提示之一。\"将你的大部分加密货币离线保存在一个硬件\n钱包里。只保留你在交易和其他活动中需要的资金在\nKraken\"。\n\n他们希望人们从他们的平台上获取加密货币的事实表明\n他们是以客户为中心的。如果人们保留......他们会受益。",
      "title": "Kraken在登录页面上告诉客户。\"不是你的钥匙，不是你的硬币\"。这就是我可以支持的业务类型"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他們的提示之一。\"將你的大部分加密貨幣離線保存在一個硬件\n錢包裏。只保留你在交易和其他活動中需要的資金在\nKraken\"。\n\n他們希望人們從他們的平臺上獲取加密貨幣的事實表明\n他們是以客戶爲中心的。如果人們保留......他們會受益。",
      "title": "Kraken在登錄頁面上告訴客戶。\"不是你的鑰匙，不是你的硬幣\"。這就是我可以支持的業務類型"
    }
  ],
  "title": "Kraken telling customers on the login page: \"Not your keys, not your coins\". This is the type of business I can support",
  "created_utc": 1619204170,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>One of their tips: &quot;Keep the majority of your crypto offline in a hardware wallet. Only keep the funds you need for trading and other activities on Kraken.&quot;</p>\n\n<p>The fact that they want people to get crypto off their platform is an indicator that they are customer-centric. They&#39;d benefit if people kept it there because they could use customer&#39;s crypto to stake it themselves and make a wagonload of money.</p>\n\n<p>It&#39;s good for the crypto space that we have exchanges that are doing their best for customers. We win, they win. I doubt Kraken is perfect, because who is? They are trying, and that&#39;s what matters to me.</p>\n\n<p>I&#39;m not sponsored by them, check my comment history, I&#39;m just a random customer. I am currently using Binance US, Coinbase Pro, Voyager as well, so if you have questions about them, I&#39;ll answer what I know. </p>\n\n<p>Side note if Kraken is reading this: Please allow us to do ACH deposit! :)</p>\n</div><!-- SC_ON -->",
  "score": 3632,
  "permalink": "/r/CryptoCurrency/comments/mwyupw/kraken_telling_customers_on_the_login_page_not/",
  "subreddit": "CryptoCurrency",
  "id": "mwyupw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776208804
}