{
  "author": "BruceAENZ",
  "original_created_utc": 1640310845,
  "title": "Help! My Fiat seems to be in a downtrend - should I sell?",
  "created_utc": 1640367507,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Up until now my Fiat seemed to be recovering, but suddenly it seems to be falling again and I’m doubting my HODL strategy.  Should I sell now and just get everything back to BTC, or will the bull market resume?&lt;/p&gt;\n\n&lt;p&gt;I know some of you doubt the Fiat tokenomics, but I really feel it’s centralised model and the ability to strictly control and restrict its usage in banking systems is the kind of feature lacking in BTC.&lt;/p&gt;\n\n&lt;p&gt;Still, I’m worried that my bags will be left worthless if I HODL much longer? I’ve already doubled down and leveraged my Fiat to get more Fiat, should I borrow even more?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 156,
  "permalink": "/r/Bitcoin/comments/rnb53z/help_my_fiat_seems_to_be_in_a_downtrend_should_i/",
  "subreddit": "Bitcoin",
  "id": "rnb53z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Up until now my Fiat seemed to be recovering, but suddenly it seems to be\nfalling again and I’m doubting my HODL strategy. Should I sell now and just get\neverything back to BTC, or will the bull market resume?\n\nI know some of you doubt the Fiat tokenomics, but I really feel it’s centralised\nmodel…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今までフィアットは回復しているように見えたのですが、突然のことです。\nまた落ちてきて、自分のHODL戦略を疑っている。今すぐ売却して\nそれとも強気相場が再開されるのでしょうか？\n\nフィアットのトークノミクスを疑っている人がいるのは知っていますが、私は本当に中央集権的だと感じています。\nモデル...",
      "title": "助けてください 私のFiatは下落傾向にあるようですが、売るべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "到现在为止，我的菲亚特似乎正在恢复，但突然间它似乎又在下降，我对我的HODL策略感到怀疑。\n我在怀疑我的HODL策略。我是否应该现在卖掉，然后把\n一切都回到BTC，还是会恢复牛市？\n\n我知道你们中的一些人怀疑菲亚特的代币，但我真的觉得它的中心化的\n模式...",
      "title": "帮助! 我的菲亚特似乎处于下降趋势中--我应该卖掉吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "到現在爲止，我的菲亞特似乎正在恢復，但突然間它似乎又在下降，我對我的HODL策略感到懷疑。\n我在懷疑我的HODL策略。我是否應該現在賣掉，然後把\n一切都回到BTC，還是會恢復牛市？\n\n我知道你們中的一些人懷疑菲亞特的代幣，但我真的覺得它的中心化的\n模式...",
      "title": "幫助! 我的菲亞特似乎處於下降趨勢中--我應該賣掉嗎？"
    }
  ]
}