{
  "author": "AlcoholicWombat",
  "the_new_excerpt": "So I've been trading for a month. I've thought about it for years, and started\nwith 500 dollars a month ago, and added 500, and will do more. I'm hooked.\n\nHere's what I've learned. Some of these points are pontifications and others are\nmeant to help fellow newbs.\n\n\n\n 1.  I don't know shit, but I…",
  "original_created_utc": 1614331013,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以我已经交易了一个月了。我想了很多年，开始了。\n一个月前用500块钱，又加了500块钱，还会做更多。我迷上了。\n\n这是我的心得。其中有些观点是庞杂的，有些是\n意在帮助新手朋友。\n\n\n\n 1.  我什么都不懂，但我...",
      "title": "一个月来，我学到了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我已經交易了一個月了。我想了很多年，開始了。\n一個月前用500塊錢，又加了500塊錢，還會做更多。我迷上了。\n\n這是我的心得。其中有些觀點是龐雜的，有些是\n意在幫助新手朋友。\n\n\n\n 1.  我什麼都不懂，但我...",
      "title": "一個月來，我學到了什麼？"
    }
  ],
  "title": "What I've learned in a month",
  "created_utc": 1614339237,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I&#39;ve been trading for a month. I&#39;ve thought about it for years, and started with 500 dollars a month ago, and added 500, and will do more. I&#39;m hooked. </p>\n\n<p>Here&#39;s what I&#39;ve learned. Some of these points are pontifications and others are meant to help fellow newbs. </p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>I don&#39;t know shit, but I came in recognizing that. I&#39;m like that with everything I start because if you think you&#39;re billy badass at something you&#39;ll never learn. My girl&#39;s dad is an trading freak and rambles on about resistance, and patterns and ex dividend dates and deep research into companies and I just sit there thinking ok, you&#39;re a master at this but I&#39;m banging your daughter.  But seriously, he&#39;s been a huge help. We&#39;ve bonded over it actually, he just throws out too much at once. Anyways, the point is, mouth shut, challenge everything you see online and pay attention to everything. </li>\n<li>I&#39;ve quickly learned to identify and stay away from hype and other manipulation. I dropped all my shares in a certain drone company when the stock dropped like a brick after some bozo posted a hit piece on it without stopping to check the ridiculously written sources or use common sense. That being said, I lucked out. I sold at a tiny profit, and got back in at a much lower price. </li>\n<li>I&#39;ve realized that if something causes a stock to explode, the prime time to get in on that train has already passed by the time I hear about it so there&#39;s no point in rushing to get in on it or putting everything on it. </li>\n<li>Quickly trying to turn around stocks within days for a quick buck rapidly lost its appeal and I&#39;ve drifted over to mid to long term holds </li>\n<li>There&#39;s a bunch of loudmouth assholes all over the yahoo message boards and I wish it&#39;d get moderated. I want to see useful posts, not spamming links and people telling other people how much money they have and how stupid everyone is. </li>\n<li>I do check my account all the damn time. It&#39;s addicting. </li>\n<li>Those of you who post well thought out posts backed by great DD and facts, I see you. Thanks. It&#39;s honorable to take the time to help out others when you get nothing in return. </li>\n<li>Those of you who spout off nonsense like you think you know what you&#39;re talking about but you don&#39;t, you just want to appear smarter than everyone else to make up for the fact your dad never thought much of you, I see right through you, and don&#39;t think much of you either. </li>\n<li>I get the sense that many new investors think they&#39;re special, the stocks they buy are special, they assume they&#39;re going to hit it big because they believe the loudmouths saying they made a million in a day and I suggest that you remove the egocentric view and look at it objectively. It&#39;s a VERY big lesson I learned in my long sports betting career. </li>\n<li>I&#39;ll say it again. There&#39;s much to learn. Last two weeks I&#39;ve learned what all the numbers and statistics on stocks were (yields, earnings, dividend, 52 week high/low etc). Now I&#39;m focusing on researching companies and comparing what i find to how the stock behaves. Next I&#39;ll move on to candlestick patterns and how to anticipate them. Trying to absorb everything at once you&#39;ll fail</li>\n<li>Options, calls, warrants - Nope. If I don&#39;t understand it, I don&#39;t do it. I feel a pang of pity when a new investor loses everything because they jumped into that stuff without understanding it. </li>\n</ol>\n\n<p>Edit: I don&#39;t mean I&#39;ll never use them. I just mean I need to understand how they work better before I start messing with them </p>\n\n<ol>\n<li>I don&#39;t like when the major blogs and news articles promote or bash a stock but only post one side. Makes me think they have an end game and that&#39;s not to altruistically help others make informed decisions.  In fact, I rarely take them seriously unless I see other sources that correlate with what they&#39;re talking about </li>\n<li>I got in when the market was skyrocketing and it took a day or two of all red for me to calm myself and realize it&#39;s the way it goes. I&#39;ve left everything I have (Though I should get rid of S.PCE, thats the position i have that I consider the biggest gamble) and will add more as I see reasonable</li>\n<li>I&#39;m focused more on good decisions rather than quick money. Maybe I&#39;ll get addicted to opiates in the future and start doing wild shit IDK, but I feel if I start treating this as a casino where I don&#39;t give a **** if I lose all my money as long as I&#39;m drunk when I leave then I will do exactly that. </li>\n<li>It&#39;s fun. I&#39;m glad I got into this. Not only is idle money making money, It&#39;s a whole new subject with a lot of financial potential for me to learn and perhaps master someday. This is a great subreddit with great people and I&#39;m looking forward to being part of it for many years. Good luck out there and thanks for all the informative posts</li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 228,
  "permalink": "/r/stocks/comments/lstyde/what_ive_learned_in_a_month/",
  "subreddit": "stocks",
  "id": "lstyde",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937742102
}