{
  "author": "PlacatedPlatypus",
  "original_created_utc": 1643223875,
  "title": "Historians used to believe the city of Troy was just a legend. However, the general consensus now is that it existed. What other examples are there of once-thought \"mythical\" phenomena being found to be historical?",
  "created_utc": 1643238222,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Why were these phenomena (and the city of Troy itself) thought of as only myths, and what evidence led to them being accepted into historical canon? Are there any mythological phenomena currently that have mounting evidence towards their historical existence?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/sddlk2/historians_used_to_believe_the_city_of_troy_was/",
  "subreddit": "AskHistorians",
  "id": "sddlk2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Why were these phenomena (and the city of Troy itself) thought of as only myths,\nand what evidence led to them being accepted into historical canon? Are there\nany mythological phenomena currently that have mounting evidence towards their\nhistorical existence?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜ、これらの現象は（トロイの町自体も）神話としか思われていなかったのか。\nそして、どのような根拠があって、歴史的な正典として受け入れられたのか？また\n現在、神話的な現象で、その証拠となるようなものがある。\n歴史的に存在するのか？",
      "title": "かつて歴史家たちは、トロイの町は単なる伝説に過ぎないと考えていた。しかし、現在では実在したというのが一般的な見方です。神話とされていた事象が歴史的なものであったという例は、他にどのようなものがあるのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为什么这些现象（以及特洛伊城本身）被认为只是神话。\n是什么证据导致它们被接受为历史典籍？是否有\n目前是否有任何神话现象有越来越多的证据证明其历史存在？\n历史的存在？",
      "title": "历史学家曾经认为特洛伊城只是一个传说。然而，现在的普遍共识是，它确实存在。还有哪些曾经被认为是 \"神话 \"的现象被发现是历史的例子？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲什麼這些現象（以及特洛伊城本身）被認爲只是神話。\n是什麼證據導致它們被接受爲歷史典籍？是否有\n目前是否有任何神話現象有越來越多的證據證明其歷史存在？\n歷史的存在？",
      "title": "歷史學家曾經認爲特洛伊城只是一個傳說。然而，現在的普遍共識是，它確實存在。還有哪些曾經被認爲是 \"神話 \"的現象被發現是歷史的例子？"
    }
  ]
}