{
  "author": "polloponzi",
  "the_new_excerpt": "Bloomberg article:\nhttps://www.bloomberg.com/news/articles/2021-02-25/fed-views-rising-yields-as-bullish-sign-reflecting-2021-optimism\n\n> Several Federal Reserve presidents argued Thursday that surging Treasury\n> yields reflect economic optimism for a solid recovery from the Covid-19 crisis\n> and…",
  "original_created_utc": 1614289654,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "彭博社文章。\nhttps://www.bloomberg.com/news/articles/2021-02-25/fed-views-rising-yields-as-bullish-sign-reflecting-2021-optimism\n\n>几位美联储主席周四认为，汹涌澎湃的国债\n>收益率反映了经济对从Covid-19危机中稳固复苏的乐观态度。\n> 还有...",
      "title": "美联储认为收益率上升是看涨信号，反映了2021年的乐观情绪。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "彭博社文章。\nhttps://www.bloomberg.com/news/articles/2021-02-25/fed-views-rising-yields-as-bullish-sign-reflecting-2021-optimism\n\n>幾位美聯儲主席週四認爲，洶湧澎湃的國債\n>收益率反映了經濟對從Covid-19危機中穩固復甦的樂觀態度。\n> 還有...",
      "title": "美聯儲認爲收益率上升是看漲信號，反映了2021年的樂觀情緒。"
    }
  ],
  "title": "Fed Views Rising Yields as Bullish Sign Reflecting 2021 Optimism",
  "created_utc": 1614298306,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bloomberg article: <a href=\"https://www.bloomberg.com/news/articles/2021-02-25/fed-views-rising-yields-as-bullish-sign-reflecting-2021-optimism\">https://www.bloomberg.com/news/articles/2021-02-25/fed-views-rising-yields-as-bullish-sign-reflecting-2021-optimism</a></p>\n\n<blockquote>\n<p>Several Federal Reserve presidents argued Thursday that surging Treasury yields reflect economic optimism for a solid recovery from the Covid-19 crisis and stressed that the central bank has no plans to tighten policy prematurely.  </p>\n\n<p>“I think the rise in yields is probably a good sign so far because it does reflect better outlook for U.S. economic growth and inflation expectations which are closer to the committee’s inflation target,” St. Louis Fed President James Bullard told reporters after a virtual speech.  </p>\n\n<p>Comments by Bullard and two other Fed leaders, Atlanta’s Raphael Bostic and Kansas City’s Esther George, showed that the central bank’s policy makers are solidly united behind Fed Chair Jerome Powell’s patience in making any adjustments to monetary policy.  </p>\n\n<p>Powell told lawmakers this week that the nation was still a “long way” from the Fed’s goals for full employment and price stability, signaling the central bank will maintain ultra-easy monetary policy for some time -- despite hopes for a strong economy later this year as vaccinations spread.  </p>\n\n<p>The Fed presidents agreed with Powell’s characterization of the rise in yields as “a statement of confidence” in the economic outlook. The 10-year Treasury yield reached 1.61% Thursday, the highest in more than a year, before trimming its gains.  </p>\n\n<p>Yields on U.S. 10-year notes have climbed to the highest in more than a year  </p>\n\n<p>“Much of this increase likely reflects growing optimism in the strength of the recovery and could be viewed as an encouraging sign of increasing growth expectations,” George said in a speech.  </p>\n\n<p>Bostic told reporters he was not expecting the Fed to respond to rising yields: “Yields have definitely moved at the longer end, but right now I am not worried about that.”  </p>\n\n<p>All three Fed presidents said it was premature to begin discussing tapering of the central bank’s massive bond-buying program, with Bullard noting that Powell would initiate the discussion when it’s appropriate. Strong Rebound  </p>\n\n<p>In separate remarks, a fourth Fed leader, New York’s John Williams, said the economy was poised for a strong rebound. “Indeed, with strong federal fiscal support and continued progress on vaccination, GDP growth this year could be the strongest we’ve seen in decades,” he said, though he added that underlying inflation is likely to remain “subdued for some time.”  </p>\n\n<p>Bullard echoed that optimism, noting the Atlanta Fed’s tracking model shows robust growth for gross domestic product in the first quarter. He predicted the U.S. unemployment rate will drop to 4.5% by year’s end, with pent-up demand and elevated savings boosting spending by Americans.  </p>\n\n<p>“I gave a rosy outlook today but it’s only an outlook,” Bullard said. As for a policy change, “the chair has wanted to start that conversation only when it’s appropriate and not get ahead of ourselves even though we do have high hopes the pandemic will come to an end.”  </p>\n\n<p>Bostic emphasized that the labor market still has considerable pain, especially for lower-income workers and minorities, and that it would take a long time to regain the 10 million jobs that have been lost.  </p>\n\n<p>“Just to remind you, our mandate is full employment,” Bostic said Thursday during a virtual speech to the Atlanta Fed’s banking-outlook conference. “It’s not full GDP. It is not the size of GDP. So this disparity is something that is important and something we are going to have to continue to watch closely.”</p>\n</blockquote>\n</div><!-- SC_ON -->",
  "score": 328,
  "permalink": "/r/investing/comments/lshtjn/fed_views_rising_yields_as_bullish_sign/",
  "subreddit": "investing",
  "id": "lshtjn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937739429
}