{
  "author": "r0ckit_man",
  "original_created_utc": 1628856738,
  "title": "A New Era",
  "created_utc": 1628869650,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Mark my words. </p>\n\n<p>&#x200B;</p>\n\n<p>The rebound that recently occurred is a solidification of Bitcoin and all of it&#39;s correlates in reality. We are not going to the moon, we are extending to infinity in an abstract sense. There will be a successor of Bitcoin, perhaps not in our lifetime, but there will be a successor just like cryptocurrency is a successor of Fiat currency. </p>\n\n<p>&#x200B;</p>\n\n<p>Buy strongly, yet buy in a calculated manner. Do not put in more than you can afford, yet make sacrifices for not only your future-self, but the generations that bloom as you offspring.</p>\n</div><!-- SC_ON -->",
  "score": 177,
  "permalink": "/r/Bitcoin/comments/p3m4ec/a_new_era/",
  "subreddit": "Bitcoin",
  "id": "p3m4ec",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Mark my words.\n\n\n\nThe rebound that recently occurred is a solidification of Bitcoin and all of\nit's correlates in reality. We are not going to the moon, we are extending to\ninfinity in an abstract sense. There will be a successor of Bitcoin, perhaps not\nin our lifetime, but there will be a successor…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Mark my words.\n\n\n\n最近起こったリバウンドは、ビットコインとその相関関係のすべてを現実に固めるものです。\n現実に関連しています。私たちは月に向かっているのではなく、抽象的な意味で無限大に向かっているのです。\n抽象的な意味での無限大への拡張です。ビットコインの後継者は出てくるでしょう。\n我々が生きている間ではないかもしれませんが、後継者はいるでしょう...。",
      "title": "新時代の到来"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "记住我的话。\n\n\n\n最近发生的反弹是对比特币和所有的\n它在现实中的关联性。我们不是要去月球，我们是要延伸到\n在一个抽象的意义上，我们正在扩展到无限大。比特币将会有一个继任者，也许不是\n在我们的有生之年，但会有一个继任者......",
      "title": "一个新的时代"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "記住我的話。\n\n\n\n最近發生的反彈是對比特幣和所有的\n它在現實中的關聯性。我們不是要去月球，我們是要延伸到\n在一個抽象的意義上，我們正在擴展到無限大。比特幣將會有一個繼任者，也許不是\n在我們的有生之年，但會有一個繼任者......",
      "title": "一個新的時代"
    }
  ]
}