{
  "author": "tip_the_turtles",
  "the_new_excerpt": "I’m super excited about this and just wanted to share! I sold my ADA position\ntoday for enough to cover my tuition in my last year of uni. I’m in school to be\na teacher and my next semester is a full time practicum meaning I’d have to stop\nworking. This sale is a huge stress reliever and will allow…",
  "original_created_utc": 1621097180,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "超興奮しているのでシェアしたいと思います 私はADAのポジションを売りました\n今日、ADAのポジションを売って、大学の最後の年の学費をまかなえるようにしました。私は教師になるために学校に通っています。\n私は教師になるために学校に通っていて、次の学期はフルタイムの実習なので、仕事をやめなければなりません。\n働かなくてはなりません。この売却は大きなストレス解消になりますし、これで...",
      "title": "1学期分の授業料で正式に販売開始"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对此超级兴奋，只想分享一下! 我卖掉了我的ADA头寸\n足够支付我大学最后一年的学费。我在学校要做\n我在学校是一名教师，下学期是全职实习，这意味着我必须停止工作。\n工作。这次出售是一个巨大的压力缓解，并将使我能够...",
      "title": "正式出售一学期的学费"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對此超級興奮，只想分享一下! 我賣掉了我的ADA頭寸\n足夠支付我大學最後一年的學費。我在學校要做\n我在學校是一名教師，下學期是全職實習，這意味着我必須停止工作。\n工作。這次出售是一個巨大的壓力緩解，並將使我能夠...",
      "title": "正式出售一學期的學費"
    }
  ],
  "title": "Officially Sold for a Semester’s Worth of Tuition",
  "created_utc": 1621107154,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m super excited about this and just wanted to share! I sold my ADA position today for enough to cover my tuition in my last year of uni. I’m in school to be a teacher and my next semester is a full time practicum meaning I’d have to stop working. This sale is a huge stress reliever and will allow me to focus fully focus on my school.</p>\n\n<p>I did not want to sell my ADA originally but this was a milestone too good to pass up, especially given the shaky market lately. I’ll be back in when the bear market eventually comes! </p>\n\n<p>Good luck to everyone still hodling their coins.</p>\n</div><!-- SC_ON -->",
  "score": 445,
  "permalink": "/r/CryptoCurrency/comments/nd32if/officially_sold_for_a_semesters_worth_of_tuition/",
  "subreddit": "CryptoCurrency",
  "id": "nd32if",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590798341
}