{
  "author": "youfucking_kiddingme",
  "the_new_excerpt": "Well, gotta start with the fact that i feel really bad mentally for awhile, i\ndon’t wanna self diagnose, but looks, from what i know, like depression and\nsuicidal thoughts.\n\nI can’t control it, but everytime i do anything out of my comfort zone (which is\nbasically - being alone, escaping, eating,…",
  "original_created_utc": 1612277333,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，得先说说我有段时间觉得自己的精神状态很不好，我...\n我不想自我诊断，但从我所知的情况来看，看起来像抑郁症和\n自杀的想法。\n\n我不能控制它，但每次我做任何事情，我的舒适区（这是\n基本上是--独自一人，逃避，吃饭，... ...",
      "title": "还有人只是逃避现实，尽可能地忽略自己的问题吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，得先說說我有段時間覺得自己的精神狀態很不好，我...\n我不想自我診斷，但從我所知的情況來看，看起來像抑鬱症和\n自殺的想法。\n\n我不能控制它，但每次我做任何事情，我的舒適區（這是\n基本上是--獨自一人，逃避，喫飯，... ...",
      "title": "還有人只是逃避現實，儘可能地忽略自己的問題嗎？"
    }
  ],
  "title": "Anybody else just escaping from reality and Ignoring their problems as long as they can?",
  "created_utc": 1612286386,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Well, gotta start with the fact that i feel really bad mentally for awhile, i don’t wanna self diagnose, but looks, from what i know, like depression and suicidal thoughts. </p>\n\n<p>I can’t control it, but everytime i do anything out of my comfort zone (which is basically - being alone, escaping, eating, sleeping and daydreaming), or anything that reminds me of my problems,I start feeling sick, sometimes angry and can’t stop crying. Feeling really disgusted of my past, of myself as a person, of my body (not only the looks), of anything that i have bad associations with. Does anybody else have it? Also I know I should go to therapist probably, but feeling uncomfortable with opening up to anybody, and also lack of money and pandemic.. I just ignore until it punches me in the face and i have to do something about it. Please, I need some advice.</p>\n\n<p>I just simply don’t know what to do. That’s it.</p>\n</div><!-- SC_ON -->",
  "score": 234,
  "permalink": "/r/TooAfraidToAsk/comments/lax636/anybody_else_just_escaping_from_reality_and/",
  "subreddit": "TooAfraidToAsk",
  "id": "lax636",
  "is_self": true,
  "media": null,
  "is_video": false
}