{
  "author": "Username-Not-A-Bot",
  "the_new_excerpt": "(Long but informative read. I gathered this information from several sites. It`s\npretty decent to get a basic understanding of Blockchain. As it`s not very\ndetailed and i`m still learning myself, please feel free to add any information\nI missed or isn`t really clear.)\n\nWhat is Blockchain?\n\nIn…",
  "original_created_utc": 1618739636,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "(長いですが、情報満載です。この情報はいくつかのサイトから集めました。これは\nブロックチェーンの基本的な理解を得るにはかなり良い内容だと思います。あまり詳しく書かれていないので\n私が見落としていた情報や、あまり役に立たない情報があれば、遠慮なく追加してください。\nご遠慮なく追加してください)\n\nブロックチェーンとは？\n\nで...",
      "title": "初心者のためのブロックチェーンの説明"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "(长但内容丰富的阅读。我从几个网站收集了这些信息。It`s\n相当不错，可以对区块链有一个基本的了解。由于它`s不是很\n详细的，我还在学习，请随时补充任何信息。\n我错过了或者不是很清楚）。)\n\n什么是区块链？\n\n在...",
      "title": "区块链初学者解读》正文"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "(長但內容豐富的閱讀。我從幾個網站收集了這些信息。It`s\n相當不錯，可以對區塊鏈有一個基本的瞭解。由於它`s不是很\n詳細的，我還在學習，請隨時補充任何信息。\n我錯過了或者不是很清楚）。)\n\n什麼是區塊鏈？\n\n在...",
      "title": "區塊鏈初學者解讀》正文"
    }
  ],
  "title": "Blockchain Explained for Beginners",
  "created_utc": 1618797699,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>(Long but informative read. I gathered this information from several sites. It`s pretty decent to get a basic understanding of Blockchain. As it`s not very detailed and i`m still learning myself, please feel free to add any information I missed or isn`t really clear.)</p>\n\n<p><strong>What is Blockchain?</strong></p>\n\n<p>In essence, a blockchain is a database where you can add information, but not remove it. The data stored on a blockchain can be anything, including money (such as bitcoin), insurance claims or even shares of physical property such as real estate. Instead of being stored on a single server, the database is spread out and stored on a vast network of computers known as nodes. This means that the system is distributed and that there is no central point of failure. </p>\n\n<p>These nodes work together to add new information to the blockchain. This information is added in bundles known as blocks, and each time a new block of information is added, it is chained to the previous one in a linear fashion resulting in the <strong>blockchain</strong>.  </p>\n\n<p>Because of the decentralised nature of a blockchain, it means that there is no one single entity with the power to change the state of the blockchain ledger and do things like shut down accounts or seize funds, unlike banks. </p>\n\n<p><strong>How does Blockchain work?</strong></p>\n\n<p>A blockchain works by keeping an unchangeable (immutable) record of transactions. It does this by reaching a consensus between all the computers, or nodes, on the network. Because blockchains consist of a distributed network of computers with no central authority, the majority of the nodes must agree to any addition to the blockchain (i.e. adding the next block). No one party can make any changes, which is what makes a blockchain a decentralised system. The more nodes that join the network, the more decentralised it becomes, which in turn improves security.</p>\n\n<p>Consensus refers to the agreement between the nodes on the blockchain&#39;s true state of affairs. If one node tries to lie, then its record of the blockchain won&#39;t match that of the other nodes, and it will be automatically ignored. This system of consensus is fundamental to the security of the blockchain.</p>\n\n<p>You control your personal data on a blockchain by using private keys. A private key is like a lengthy password that gives you access to a digital wallet where your personal data is stored. This data could be anything from money to details about your last medical check-up. The benefit of a private key is that it doesn&#39;t have to be stored on a central server, unlike passwords for regular websites like Google or Facebook, which are prone to hacks.</p>\n\n<p>U have different kind of consensus mechanisms:</p>\n\n<ul>\n<li><strong>Proof of Work Blockchain (PoW):</strong> is a decentralized consensus mechanism that requires members of a network to expend effort solving an arbitrary mathematical puzzle to prevent anybody from gaming the system. Proof of work is used widely in cryptocurrency mining, for validating transactions and mining new tokens. </li>\n<li><strong>Proof of Stake Blockchain (PoS):</strong> is a type of consensus mechanism by which a <em>cryptocurrency blockchain</em> network achieves distributed consensus. In PoS-based cryptocurrencies the creator of the next block is chosen via various combinations of random selection and wealth or age (i.e., the <em>stake</em>). </li>\n<li><strong>Proof of Authority BlockChain (PoA):</strong> is a consensus method that gives a small and designated number of blockchain actors the power to validate transactions or interactions with the network and to update its more or less distributed registry. </li>\n</ul>\n\n<p><strong>What problems does Blockchain solve?</strong></p>\n\n<p>On a trustless network like a blockchain, you can ask for payment from someone you have never met, and when the payment arrives, you can be sure that it is legitimate and verified, all within a matter of minutes. Existing systems such as the SWIFT banking network currently take two to three days to do this.</p>\n\n<p>Another issue blockchains solve is the double-spend problem. The double-spend problem basically centres around the idea that on a database, someone can make an entry and then go back and change it if they have the power or authority to do so. This would essentially allow someone to spend the same money twice.</p>\n\n<p>Blockchains solve this through a combination of factors that all prevent double spending:</p>\n\n<ul>\n<li>Each transaction is time-stamped and kept in the correct order. </li>\n<li>Every node must have a copy of the same ledger to reach consensus and to continue the blockchain.</li>\n<li>Any node with a copy of the ledger that doesn&#39;t match the majority of the other nodes will be ignored. That is, if someone tries to spend the same money twice by sending it to two different nodes, then only the node that matches the rest of the nodes on the network will be accepted in the next block of data.</li>\n<li>Any node with a copy of the ledger that doesn&#39;t match the majority of the other nodes will be ignored. That is, if someone tries to spend the same money twice by sending it to two different nodes, then only the node that matches the rest of the nodes on the network will be accepted in the next block of data.</li>\n</ul>\n\n<p><strong>What else can a blockchain do?</strong></p>\n\n<p>Blockchains belong to a group of technologies known as distributed ledger technologies (DLT). DLTs as we know them today have only been around for a decade or so, but are already receiving a lot of attention and development. Much like the Internet, additional protocols and technologies are being built on top of blockchains to further their abilities. </p>\n\n<ul>\n<li><strong>Cryptocurrencies:</strong> are digital &quot;coins&quot; that are native to their blockchain and can be used to reward node operators that help to secure the network and verify transactions. </li>\n<li><strong>Tokens:</strong> are also digital assets that are stored and traded on a blockchain. However, unlike cryptocurrencies, tokens are programmed &quot;on top&quot; of an existing blockchain, allowing them to piggyback the existing network infrastructure in the process. </li>\n<li><strong>Smart Conracts:</strong> are digital contracts that you can program to perform a specific set of functions. Like a physical contract, fulfilment of the contract requires that participants meet certain conditions, but unlike a physical contract, smart contracts can then execute the terms automatically once these conditions are met, such as paying out an insurance claim once you have paid the premium. Furthermore, smart contracts can do this without the need for middlemen, reducing cost while increasing speed and accuracy. </li>\n<li><strong>Supply Chain Management:</strong> Blockchains have the ability to add a level of authenticity and trust to supply chains that is sorely missed by legacy systems. </li>\n</ul>\n\n<p><strong>What are issues with Blockchain?</strong></p>\n\n<p>Identifying issues with blockchain technology really depens on where you sit and the particular blockchain. Critiques often revolve around speed, issues of centralisation  (or decentralisation), adoption complexity and privacy. </p>\n\n<p>Some of these issues have fairly simple solutions, such as choosing a private blockchain to increase privacy or creating a new interface to improve usability.</p>\n\n<p>However, the one major issue that several of these smaller issues contribute to is the issue of scalability.</p>\n\n<p>Scalability refers to the ability (or lack thereof) for blockchains to scale as more users join the network. As more users join, speed and size (bandwidth) needs to increase in order to process all the new data being added. Currently, blockchains struggle to do this without making a trade off in other areas, namely decentralisation and security.</p>\n\n<p>This three-way trade-off among scalability, decentralisation and security has become known as the Blockchain Trilemma.</p>\n</div><!-- SC_ON -->",
  "score": 176,
  "permalink": "/r/CryptoCurrency/comments/mt9wsa/blockchain_explained_for_beginners/",
  "subreddit": "CryptoCurrency",
  "id": "mt9wsa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171519559
}