{
  "author": "Supercharmeleon",
  "original_created_utc": 1635685654,
  "title": "What are your fears about crypto you often try to supress?",
  "created_utc": 1635705986,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s safe to say since we&#39;re all part of this sub we&#39;re bullish on crypto&#39;s future, and even if you don&#39;t think it&#39;ll be a major force in the world it&#39;ll at least continue to grow and become more widely adopted as time passes.</p>\n\n<p>Or will it? Do you ever doubt? Is there any specific fear regarding crypto&#39;s future that you don&#39;t tell anyone but it keeps nagging at the back of your mind?</p>\n\n<p>If so, this is the place to air it out.</p>\n\n<p>As for me, I fear crypto will grow big, but in the end it&#39;ll become only another tool for the powerful to control those beneath them, a world of whales in a way.</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/CryptoCurrency/comments/qjp592/what_are_your_fears_about_crypto_you_often_try_to/",
  "subreddit": "CryptoCurrency",
  "id": "qjp592",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's safe to say since we're all part of this sub we're bullish on crypto's\nfuture, and even if you don't think it'll be a major force in the world it'll at\nleast continue to grow and become more widely adopted as time passes.\n\nOr will it? Do you ever doubt? Is there any specific fear regarding…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブのメンバー全員が、暗号の未来に強気であることは間違いありません。\n世界の主要な勢力になるとは思わなくても、少なくとも時間の経過とともに成長を続け、より広く採用されるようになるでしょう。\n世界の主役になるとは思わなくても、少なくとも時間の経過とともに成長を続け、より広く採用されるようになるでしょう。\n\nそれとも、そうなるのでしょうか？疑問に思うことはありますか？何か具体的な不安が...",
      "title": "あなたがよく抑えようとしている暗号に対する恐怖心は何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "可以说，既然我们都是这个子的一部分，我们就看好加密货币的未来。\n即使你不认为它将成为世界上的主要力量，它至少会继续增长并被更广泛地采用。\n至少会继续增长，并随着时间的推移变得更加广泛地采用。\n\n或者会吗？你有怀疑过吗？是否有任何具体的恐惧关于...",
      "title": "你对加密货币的恐惧是什么，你经常试图压制？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "可以說，既然我們都是這個子的一部分，我們就看好加密貨幣的未來。\n即使你不認爲它將成爲世界上的主要力量，它至少會繼續增長並被更廣泛地採用。\n至少會繼續增長，並隨着時間的推移變得更加廣泛地採用。\n\n或者會嗎？你有懷疑過嗎？是否有任何具體的恐懼關於...",
      "title": "你對加密貨幣的恐懼是什麼，你經常試圖壓制？"
    }
  ]
}