{
  "author": "seansurvives",
  "original_created_utc": 1637249388,
  "title": "I Resent This Sub For Bad Advice On CRO",
  "created_utc": 1637260253,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When I was new to crypto I was deciding which exchange to use and had decided on crypto.com. At the time crypto.com and their CRO coin had a bit of a bad reputation but I did my own research and determined that the things people were concerned about were growing pains and that an exchange with the domain crypto.com had a very bright future.</p>\n\n<p>After getting my account approved I posted here asking for advice on if I should invest a substantial amount in CRO since I believed crypto.com was destined to become a major player like binance and that inevitably the CRO price would go up.</p>\n\n<p>My post was met with lots of fud and responses from people who had likely been burned or knew nothing about crypto.com and CRO. I should have gone with my gut and my own research however I was brand new to crypto and didn&#39;t trust myself.</p>\n\n<p>At this time CRO was about $0.06. Now CRO is $0.50+ and crypto.com has bought the naming rights to the arena where the Lakers play.</p>\n\n<p>Moral of the story is 90% of what&#39;s posted here is garbage that won&#39;t help you make good investing decisions. Go with your gut.</p>\n\n<p>EDIT: Wow. I knew this sub had some bad advice but I didn&#39;t realize how incredibly toxic it had become as well. Everyone was new at some point. There are tons of new people coming here everyday to try and learn more about crypto.</p>\n</div><!-- SC_ON -->",
  "score": 629,
  "permalink": "/r/CryptoCurrency/comments/qws7ax/i_resent_this_sub_for_bad_advice_on_cro/",
  "subreddit": "CryptoCurrency",
  "id": "qws7ax",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "When I was new to crypto I was deciding which exchange to use and had decided on\ncrypto.com. At the time crypto.com and their CRO coin had a bit of a bad\nreputation but I did my own research and determined that the things people were\nconcerned about were growing pains and that an exchange with the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私がcryptoを始めたばかりの頃、どの取引所を使うか決めていて、その時に決めたのが\ncrypto.comに決めていました。当時、crypto.comとそのCROコインは、少し評判が悪かったのですが\nしかし、自分なりに調べてみると、人々が心配していたのは成長の痛みであり\n私は自分で調査し、人々が心配していたことは成長の痛みであり、CROコインを持つ取引所は...",
      "title": "私はCROに関する悪いアドバイスのためにこのサブに憤慨しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我刚接触加密货币时，我正在决定使用哪个交易所，并决定使用\ncrypto.com。当时crypto.com和他们的CRO币有一点坏名声。\n但我做了自己的研究，并确定人们所担心的事情是成长的痛苦，而他们的CRO币有一点坏名声。\n担心的是成长中的痛苦，而一个具有良好信誉的交易所是不可能的。",
      "title": "我很反感这个关于CRO的坏建议的子。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我剛接觸加密貨幣時，我正在決定使用哪個交易所，並決定使用\ncrypto.com。當時crypto.com和他們的CRO幣有一點壞名聲。\n但我做了自己的研究，並確定人們所擔心的事情是成長的痛苦，而他們的CRO幣有一點壞名聲。\n擔心的是成長中的痛苦，而一個具有良好信譽的交易所是不可能的。",
      "title": "我很反感這個關於CRO的壞建議的子。"
    }
  ]
}