{
  "author": "eyeohu",
  "the_new_excerpt": "I wasn't sure how exactly to ask this or word it. I just started randomly\nthinking about this so please no hate. Okay here goes.\n\nOur skin complexions vary but ultimately we are all either some shade of white,\nbrown, yellow, black.\n\nWhy are White Americans only acknowledged by their skin color as if…",
  "original_created_utc": 1618706531,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "どのように質問したらよいのか、どのように表現したらよいのかわかりませんでした。ただランダムに考え始めただけなので\n適当に考えただけなので悪しからず。さて、ここからが本題です。\n\n私たちの肌の色は様々ですが、最終的には白、茶色、黄色、黒のいずれかの色をしています。\n茶色、黄色、黒。\n\nなぜアメリカの白人は肌の色でしか認識されないのか、まるで...",
      "title": "なぜアメリカ人は、アメリカの白人は人種や民族の背景を持たないただの白人だと思っているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道到底该怎么问这个问题，也不知道该怎么措辞。我只是随意地开始\n思考这个问题，所以请不要仇恨。好了，开始吧。\n\n我们的肤色各不相同，但最终我们都是一些白色的阴影。\n棕色，黄色，黑色。\n\n为什么美国白种人只能通过他们的肤色来确认，好像... ...",
      "title": "为什么美国人认为美国的白人就是没有种族和民族背景的普通白人？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道到底該怎麼問這個問題，也不知道該怎麼措辭。我只是隨意地開始\n思考這個問題，所以請不要仇恨。好了，開始吧。\n\n我們的膚色各不相同，但最終我們都是一些白色的陰影。\n棕色，黃色，黑色。\n\n爲什麼美國白種人只能通過他們的膚色來確認，好像... ...",
      "title": "爲什麼美國人認爲美國的白人就是沒有種族和民族背景的普通白人？"
    }
  ],
  "title": "Why do Americans think that white people in America are just plain white with no racial or ethnic background?",
  "created_utc": 1618720558,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I wasn&#39;t sure how exactly to ask this or word it. I just started randomly thinking about this so please no hate. Okay here goes.</p>\n\n<p>Our skin complexions vary but ultimately we are all either some shade of white, brown, yellow, black.  </p>\n\n<p>Why are White Americans only acknowledged by their skin color as if that is all they are? It seems like people forget that white people are more than just a skin color and forget that being white is not their race. I&#39;ve never met a single person in my life who was not made up of multiple ethnicities no matter their skin tone.</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/TooAfraidToAsk/comments/mt2rvw/why_do_americans_think_that_white_people_in/",
  "subreddit": "TooAfraidToAsk",
  "id": "mt2rvw",
  "is_self": true,
  "media": null,
  "is_video": false
}