{
  "author": "General_Urist",
  "original_created_utc": 1636979902,
  "title": "If the whole point of Sherman's March To The Sea was that he didn't bother to maintain supply lines, why do maps of the American Civil War usually show the Union occupying the land he passed through?",
  "created_utc": 1637003562,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My understanding is that the defining feature of Sherman&#39;s Savannah Campaign was that he didn&#39;t actually try to occupy all the land between Atlanta and Savannah. He just walked his army from one end to the other, smashing any important infrastructure he found along the way, without bothering to maintain lines of supply or communication with the north until he met the navy at the end of the march. I.E. it was essentially a giant raid rather than an occupation outside of Savannah itself.</p>\n\n<p>But whenever I see maps on the internet showing how territorial control changed over time in the Civil War (such as <a href=\"https://www.youtube.com/watch?v=pDEK4gJBKW0\">this popular one</a> ), they always show a solid band of Union control between the two cities at the end of 1864. (and inevitably spawn lots of jokes about sawing the rebellion in half, or people praising the Union for cutting Confederate lines). My question is, is there any truth to the idea of Union forces being present in central Georgia blocking the movement of CSA forces after Sherman passed through, or is that just embellishment by cartographers eager to make the Confederacy&#39;s situation look really bad?</p>\n</div><!-- SC_ON -->",
  "score": 114,
  "permalink": "/r/AskHistorians/comments/qufhxz/if_the_whole_point_of_shermans_march_to_the_sea/",
  "subreddit": "AskHistorians",
  "id": "qufhxz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My understanding is that the defining feature of Sherman's Savannah Campaign was\nthat he didn't actually try to occupy all the land between Atlanta and Savannah.\nHe just walked his army from one end to the other, smashing any important\ninfrastructure he found along the way, without bothering to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の理解では、シャーマンのサバンナキャンペーンの最大の特徴は\nアトランタとサバンナの間のすべての土地を実際に占領しようとしなかったことです。\n彼は軍隊を端から端まで歩かせて、途中で見つけた重要なインフラを破壊しました。\n途中で見つけた重要なインフラを破壊して、気にすることなく...",
      "title": "シャーマンの「海への行進」の要点が、補給線を維持する必要がなかったということであれば、なぜアメリカ南北戦争の地図では、シャーマンが通過した土地を北軍が占領しているように描かれているのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的理解是，谢尔曼的萨凡纳战役的决定性特点是\n他实际上并没有试图占领亚特兰大和萨凡纳之间的所有土地。\n他只是把他的军队从一端走到另一端，把沿途发现的任何重要的\n他沿途发现的任何重要的基础设施，而不去理会...",
      "title": "如果谢尔曼向海进军的全部意义在于他不屑于维持补给线，那么为什么美国内战的地图通常显示联盟占领了他所经过的土地？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的理解是，謝爾曼的薩凡納戰役的決定性特點是\n他實際上並沒有試圖佔領亞特蘭大和薩凡納之間的所有土地。\n他只是把他的軍隊從一端走到另一端，把沿途發現的任何重要的\n他沿途發現的任何重要的基礎設施，而不去理會...",
      "title": "如果謝爾曼向海進軍的全部意義在於他不屑於維持補給線，那麼爲什麼美國內戰的地圖通常顯示聯盟佔領了他所經過的土地？"
    }
  ]
}