{
  "author": "ypyt_cv",
  "original_created_utc": 1635214615,
  "title": "How do people just do stuff? Is life not incredibly hard for everyone?",
  "created_utc": 1635221968,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It takes so much motivation for me to just do simple stuff like shower or my laundry. Talking to other people, my minds racing 1000 miles per minute. Go to class and I just feel like I&#39;m disociating the whole time and counting the minutes till it ends. Is everything this hard for everyone? How do people have so much willpower? </p>\n\n<p>Only time I feel safe is when I&#39;m home, alone, and on my phone. I can&#39;t even be alone with my thoughts, I have to distract myself with my phone. Is life this hard for everyone and do I just have to suck it up?</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/qfwcvf/how_do_people_just_do_stuff_is_life_not/",
  "subreddit": "TooAfraidToAsk",
  "id": "qfwcvf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It takes so much motivation for me to just do simple stuff like shower or my\nlaundry. Talking to other people, my minds racing 1000 miles per minute. Go to\nclass and I just feel like I'm disociating the whole time and counting the\nminutes till it ends. Is everything this hard for everyone? How do…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "シャワーや洗濯などの簡単なことをするだけでも、かなりのモチベーションが必要です。\n洗濯をするだけでもやる気が出ます。他の人と話していると、頭の中が1分間に1000マイルも回転します。授業に出ても\n授業を受けている間は、自分でも解離しているような気がします。\n終わるまでの時間を数えているような感じです。みんなにとって、すべてのことがこんなに大変なのでしょうか？どうすれば...",
      "title": "人はどうやって物事を進めていくのか？みんなの人生はとてつもなく大変ではないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我需要很大的动力来做一些简单的事情，比如洗澡或洗衣服。\n洗衣服。与其他人交谈时，我的思维每分钟都要跑1000英里。去\n上课时，我就觉得自己一直在脱离现实，并在数着时间等着上课。\n分钟，直到它结束。对每个人来说，一切都这么难吗？如何...",
      "title": "人们是如何做事情的？对每个人来说，生活难道不是令人难以置信的困难吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我需要很大的動力來做一些簡單的事情，比如洗澡或洗衣服。\n洗衣服。與其他人交談時，我的思維每分鐘都要跑1000英里。去\n上課時，我就覺得自己一直在脫離現實，並在數着時間等着上課。\n分鐘，直到它結束。對每個人來說，一切都這麼難嗎？如何...",
      "title": "人們是如何做事情的？對每個人來說，生活難道不是令人難以置信的困難嗎？"
    }
  ]
}