{
  "author": "cinico",
  "the_new_excerpt": "I trust the results that show that the vaccinea are safe and effective. I was\ntalking to someone who is not an anti Vax, but didn't want to take any covid\nvaccine because he said it was rushed. I explained him that it did follow a\nthorough blind test, and did not skip any important step. And I also…",
  "original_created_utc": 1622666969,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ワクチンの安全性と有効性を示す結果を信頼しています。私は\n反ワクチン派ではない人と話していたのですが、コビドのワクチンは急がされていると言って受けたくないと言っていました。\nワクチンは急いで作られたものだと言っていました。私は、その人に、このワクチンはある一定の基準を満たしていると説明しました。\n徹底したブラインドテストを行い、重要なステップを省略していないことを説明しました。また、私は...",
      "title": "covid-19ワクチンが緊急時だけでなく、完全に承認されるためには、具体的に何が不足しているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信那些显示疫苗是安全和有效的结果。我在和一个不反对打疫苗的人谈话时\n我和一个不反对Vax的人谈话，但他不愿意接受任何covid\n疫苗，因为他说它是仓促的。我向他解释说，它确实经过了一个\n彻底的盲测，而且没有跳过任何重要步骤。而且我还...",
      "title": "究竟缺少什么才能使covid-19疫苗得到全面批准，而不仅仅是紧急批准？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信那些顯示疫苗是安全和有效的結果。我在和一個不反對打疫苗的人談話時\n我和一個不反對Vax的人談話，但他不願意接受任何covid\n疫苗，因爲他說它是倉促的。我向他解釋說，它確實經過了一個\n徹底的盲測，而且沒有跳過任何重要步驟。而且我還...",
      "title": "究竟缺少什麼才能使covid-19疫苗得到全面批准，而不僅僅是緊急批准？"
    }
  ],
  "title": "What exactly is missing for the covid-19 vaccines to be full approved, and not only emergency approved?",
  "created_utc": 1622692480,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I trust the results that show that the vaccinea are safe and effective. I was talking to someone who is not an anti Vax, but didn&#39;t want to take any covid vaccine because he said it was rushed. I explained him that it did follow a thorough blind test, and did not skip any important step. And I also explained that it was possible to make this fast because it was a priority to everyone and because we had many subjects who allowed the trials to run faster, which usually doesn&#39;t happen normally.\nBut then he questioned me about why were the vaccines not fully approved, by the FDA for example. I don&#39;t know the reason and I could not find an answer online.</p>\n\n<p>Can someone explain me what exactly is missing or was skipped to get a full approval?</p>\n</div><!-- SC_ON -->",
  "score": 1320,
  "permalink": "/r/askscience/comments/nqvz98/what_exactly_is_missing_for_the_covid19_vaccines/",
  "subreddit": "askscience",
  "id": "nqvz98",
  "is_self": true,
  "media": null,
  "is_video": false
}