{
  "author": "RefugeeDutch_Syrian",
  "original_created_utc": 1639564746,
  "title": "Banks calling crypto risky is the same as FAX companies calling Email risky",
  "created_utc": 1639578784,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It is funny an even ironic to see Banks warning about crypto. Just yesterday the bank of England warned that crypto could become &amp;#39;worthless&amp;#39;. Banks are freaking out seeing money goes from under their control to exchanges which they can&amp;#39;t manipulate. The less assets they have under control, the less power they have.&lt;/p&gt;\n\n&lt;p&gt;Crypto is a danger for their existence and they know it! It is the same thing when FAX companies would warn about emails and their dangers when they noticed that it is taking their market share.&lt;/p&gt;\n\n&lt;p&gt;Banks are not stupid, they have a lot of smart people working there. They know that their future is not certain anymore with so many people wanting decentralized finance and seeing the adoption grows massively. It has become quite clear, either join and adapt blockchain technology or get lost behind!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 241,
  "permalink": "/r/CryptoCurrency/comments/rgw91h/banks_calling_crypto_risky_is_the_same_as_fax/",
  "subreddit": "CryptoCurrency",
  "id": "rgw91h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It is funny an even ironic to see Banks warning about crypto. Just yesterday the\nbank of England warned that crypto could become 'worthless'. Banks are freaking\nout seeing money goes from under their control to exchanges which they can't\nmanipulate. The less assets they have under control, the less…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "銀行が暗号について警告しているのを見るのは面白いし、皮肉でもある。ちょうど昨日\nイングランド銀行は、暗号が「無価値」になる可能性があると警告しました。銀行が恐れているのは\n自分たちの管理下にあったお金が、自分たちの手に負えない取引所に流れていくのを見て\n操作することができます。支配下にある資産が減れば、それだけ...",
      "title": "銀行が暗号を危険と言うのは、FAX会社がEメールを危険と言うのと同じこと"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "看到银行对加密货币发出警告，这很有趣，甚至具有讽刺意味。就在昨天，英国银行\n英格兰银行警告说，加密货币可能变得 \"一文不值\"。银行在看到钱从他们的控制下转移到他们无法控制的交易所时，都会感到害怕。\n看到钱从他们的控制下转移到他们无法操纵的交易所，银行很害怕。\n操纵。他们控制的资产越少，就越不...",
      "title": "银行称加密货币有风险，与传真公司称电子邮件有风险是一样的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "看到銀行對加密貨幣發出警告，這很有趣，甚至具有諷刺意味。就在昨天，英國銀行\n英格蘭銀行警告說，加密貨幣可能變得 \"一文不值\"。銀行在看到錢從他們的控制下轉移到他們無法控制的交易所時，都會感到害怕。\n看到錢從他們的控制下轉移到他們無法操縱的交易所，銀行很害怕。\n操縱。他們控制的資產越少，就越不...",
      "title": "銀行稱加密貨幣有風險，與傳真公司稱電子郵件有風險是一樣的。"
    }
  ]
}