{
  "author": "jimmyjohnjohnjohn",
  "original_created_utc": 1626961833,
  "title": "Why are vacuum cleaners so much less powerful than they used to be?",
  "created_utc": 1626977055,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When I was a kid, you could pick up a basketball with a vacuum hose, put it on your skin for a few seconds and leave a gnarly purple bruise. Leave the brush in one spot too long and literally burn the carpet with friction. Suck up coins, keys, pen caps, can tabs. Actually get the carpet CLEAN.</p>\n\n<p>Now with a modern vacuum, I have to go over everything two or three times just to get pet hair up.</p>\n\n<p>What&#39;s the deal?</p>\n</div><!-- SC_ON -->",
  "score": 133,
  "permalink": "/r/NoStupidQuestions/comments/ope7s5/why_are_vacuum_cleaners_so_much_less_powerful/",
  "subreddit": "NoStupidQuestions",
  "id": "ope7s5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "When I was a kid, you could pick up a basketball with a vacuum hose, put it on\nyour skin for a few seconds and leave a gnarly purple bruise. Leave the brush in\none spot too long and literally burn the carpet with friction. Suck up coins,\nkeys, pen caps, can tabs. Actually get the carpet CLEAN.\n\nNow…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が子供の頃は、バスケットボールを掃除機のホースで拾って、それを数秒間肌に当てると\n数秒間肌に当てると、紫色のひどいアザができるんだ。ブラシを一箇所に長く置いておくと\nブラシを一箇所に長く置いておくと、摩擦で文字通りカーペットを焼いてしまいます。コインを吸う。\n小銭、鍵、ペンのキャップ、缶のタブなどを吸い取ります。実際にカーペットをきれいにしてみましょう。\n\nさて...",
      "title": "なぜ掃除機は昔に比べて性能が落ちたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我还是个孩子的时候，你可以用真空管捡起一个篮球，把它放在你的皮肤上几秒钟，留下可怕的紫色瘀伤。\n你的皮肤几秒钟，就会留下一个可怕的紫色瘀伤。把刷子放在\n把刷子放在一个地方太久，就会因摩擦而烧毁地毯。吸取硬币。\n钥匙、笔帽、罐头标签。真正把地毯弄干净。\n\n现在...",
      "title": "为什么吸尘器的功率比以前小得多？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我還是個孩子的時候，你可以用真空管撿起一個籃球，把它放在你的皮膚上幾秒鐘，留下可怕的紫色瘀傷。\n你的皮膚幾秒鐘，就會留下一個可怕的紫色瘀傷。把刷子放在\n把刷子放在一個地方太久，就會因摩擦而燒燬地毯。吸取硬幣。\n鑰匙、筆帽、罐頭標籤。真正把地毯弄乾淨。\n\n現在...",
      "title": "爲什麼吸塵器的功率比以前小得多？"
    }
  ]
}