{
  "author": "Ireysword",
  "original_created_utc": 1634911221,
  "title": "Why do filming productions not use entirely fake guns so that Noone can be shot even by accident?",
  "created_utc": 1634929671,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In light of what happened with Alec Baldwin (my thoughts go out to the victims and their families) I was wondering why they even use guns that could hurt anyone? Just use an entire fake and add the sound and everything in post. We live in a time with easy affordable CGI. Surely it can&#39;t be that hard? I understand how something like this can happen and everyone talks about blanks and whatnot, but in the end it is an actual gun. Why tho? </p>\n\n<p>I&#39;m from Europe so I don&#39;t know much about Hollywood productions.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/qdhkca/why_do_filming_productions_not_use_entirely_fake/",
  "subreddit": "NoStupidQuestions",
  "id": "qdhkca",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In light of what happened with Alec Baldwin (my thoughts go out to the victims\nand their families) I was wondering why they even use guns that could hurt\nanyone? Just use an entire fake and add the sound and everything in post. We\nlive in a time with easy affordable CGI. Surely it can't be that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アレック・ボールドウィンに起こったことを考えると、（私は被害者とその家族に同情します。\n人を傷つける可能性のある銃をなぜ使うのだろうか？\n使うのか？フェイクを全部使って、音とかも全部ポストで付ければいい。私たちは\n今はCGIが簡単に手に入る時代です。きっと、そんなことはないんだろうけど...。",
      "title": "なぜ撮影現場では、完全に偽物の銃を使って、偶然にも誰も撃たれないようにしないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "鉴于亚历克-鲍德温（Alec Baldwin）发生的事情（我对受害者及其家属表示同情\n和他们的家人），我在想他们为什么要使用可能伤害任何人的枪支？\n任何人？只要用一个完整的假货，并在后期添加声音和一切。我们\n我们生活在一个容易负担得起的CGI时代。当然，这不可能是...",
      "title": "为什么电影制作不使用完全的假枪，这样即使是意外也不会有人被射杀？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "鑑於亞歷克-鮑德溫（Alec Baldwin）發生的事情（我對受害者及其家屬表示同情\n和他們的家人），我在想他們爲什麼要使用可能傷害任何人的槍支？\n任何人？只要用一個完整的假貨，並在後期添加聲音和一切。我們\n我們生活在一個容易負擔得起的CGI時代。當然，這不可能是...",
      "title": "爲什麼電影製作不使用完全的假槍，這樣即使是意外也不會有人被射殺？"
    }
  ]
}