{
  "author": "Bagelman263",
  "original_created_utc": 1656972925,
  "title": "How was the Epic of Gilgamesh so well preserved?",
  "created_utc": 1657009458,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For being written 3-4 thousand years ago, we know a crazy amount about the Epic of Gilgamesh. We know most of the character’s names, their relationships, motivations, personalities, as well as many of the individual plot points fairly well.&lt;/p&gt;\n\n&lt;p&gt;How are we able to know so much about this story compared to others from that time or even significantly later? Does it just have to do with the amount of time and effort put into its study? The tablets it was written on being sturdier than paper? Being in a region that gave way to cultures that encouraged scholarship and study? Or something completely different?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/vritzy/how_was_the_epic_of_gilgamesh_so_well_preserved/",
  "subreddit": "AskHistorians",
  "id": "vritzy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For being written 3-4 thousand years ago, we know a crazy amount about the Epic\nof Gilgamesh. We know most of the character’s names, their relationships,\nmotivations, personalities, as well as many of the individual plot points fairly\nwell.\n\nHow are we able to know so much about this story compared…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "3～4千年前に書かれた割には、叙事詩についてめちゃめちゃたくさん知っている。\nギルガメッシュ叙事詩について、私たちは非常に多くのことを知っています。登場人物の名前、関係、動機、性格、個々のプロットなど、ほとんど知っています。\nまた、個々の筋書きもよく分かっています。\nなぜ、これほど多くのことを知ることができるのか。\n\nしかし、なぜ私たちはこの物語についてこれほど多くのことを知ることができるのでしょうか。",
      "title": "ギルガメッシュ叙事詩は、なぜこれほどまでに保存状態がよかったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为三四千年前的作品，我们对《史诗》的了解非常多。\n吉尔伽美什史诗。我们知道大多数人物的名字、他们的关系、动机、性格以及许多单独的情节。\n动机、个性，以及许多单独的情节点。\n清楚。\n\n与《吉尔伽美什史诗》相比，我们为什么能够对这个故事了解得如此之多？",
      "title": "吉尔伽美什史诗》为何保存得如此完好？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲三四千年前的作品，我們對《史詩》的瞭解非常多。\n吉爾伽美什史詩。我們知道大多數人物的名字、他們的關係、動機、性格以及許多單獨的情節。\n動機、個性，以及許多單獨的情節點。\n清楚。\n\n與《吉爾伽美什史詩》相比，我們爲什麼能夠對這個故事瞭解得如此之多？",
      "title": "吉爾伽美什史詩》爲何保存得如此完好？"
    }
  ]
}