{
  "author": "Pandemonium123",
  "the_new_excerpt": "It's easy to get wrapped up in the group mentality and think that you are\nholding for a greater good. However, the truth is that we are all investing for\nour own financial and living situations, so you have to do what's right for you.\n\nUsually the people yelling that you need to hodl are the ones…",
  "original_created_utc": 1620513888,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "集団心理に流されて、「自分はこのようなことをしている」と思ってしまいがちです。\nと思ってしまいがちです。しかし、実際には、私たちは皆、自分の経済的・生活的状況のために投資しているのです。\n自分に合った投資をしなければなりません。\n\n通常、Hodlが必要だと叫んでいる人たちは...",
      "title": "価格に満足したら売ってもいいんだということを思い出す"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们很容易被群体心态所迷惑，认为自己是在为大局着想。\n为更大的利益而持有。然而，事实是，我们都在为自己的财务和生活状况进行投资。\n我们自己的财务和生活状况，所以你必须做适合你的事情。\n\n通常情况下，那些嚷嚷着你需要霍德尔的人是那些...",
      "title": "提醒你，当你对价格感到满意时，可以出售。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們很容易被羣體心態所迷惑，認爲自己是在爲大局着想。\n爲更大的利益而持有。然而，事實是，我們都在爲自己的財務和生活狀況進行投資。\n我們自己的財務和生活狀況，所以你必須做適合你的事情。\n\n通常情況下，那些嚷嚷着你需要霍德爾的人是那些...",
      "title": "提醒你，當你對價格感到滿意時，可以出售。"
    }
  ],
  "title": "Reminder that it is okay to sell when you're happy with the price",
  "created_utc": 1620536046,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s easy to get wrapped up in the group mentality and think that you are holding for a greater good. However, the truth is that we are all investing for our own financial and living situations, so you have to do what&#39;s right for you.</p>\n\n<p>Usually the people yelling that you need to hodl are the ones with big bags that they&#39;d like to see go up. They don&#39;t exactly care about your situation, they care about their bag.</p>\n\n<p>So if you&#39;re comfortable with your gains and you&#39;re ready to get out, sell it and get out. Don&#39;t let all the screaming keep you down, especially if it starts dumping and everyone is still telling you to hodl.</p>\n\n<p>I&#39;m mainly posting this due to the ETH and especially DOGE rise as of late. I&#39;m personally hodling my coins for a long time, but I hate seeing people try to persuade others for their own benefit.</p>\n</div><!-- SC_ON -->",
  "score": 396,
  "permalink": "/r/CryptoCurrency/comments/n80f5h/reminder_that_it_is_okay_to_sell_when_youre_happy/",
  "subreddit": "CryptoCurrency",
  "id": "n80f5h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985990897
}