{
  "author": "Fivebag",
  "original_created_utc": 1626279636,
  "title": "Thanks to crypto, I’ve stopped wasting money.",
  "created_utc": 1626298838,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Crypto has finally made me realise how much money I’ve wasted on things I really haven’t needed. My whole life I’ve been an impulse buyer, as soon as I get in my head that I want something (I can afford) I buy it. I can’t really explain exactly what’s caused it but now a days I ask myself if the item I’m about to purchase is a necessity or if it’s a luxury. I’ve stopped myself buying so much shit that I would have otherwise not even disputed. Crypto is something that’s grounded me financially. I enjoy investing in my future and the future of crypto. I’m extremely grateful to be in the market at this time, despite some people saying we’re in a bear market.</p>\n</div><!-- SC_ON -->",
  "score": 291,
  "permalink": "/r/CryptoCurrency/comments/ok7smq/thanks_to_crypto_ive_stopped_wasting_money/",
  "subreddit": "CryptoCurrency",
  "id": "ok7smq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Crypto has finally made me realise how much money I’ve wasted on things I really\nhaven’t needed. My whole life I’ve been an impulse buyer, as soon as I get in my\nhead that I want something (I can afford) I buy it. I can’t really explain\nexactly what’s caused it but now a days I ask myself if the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号のおかげで、本当に必要のないものにどれだけのお金を無駄にしてきたか、ようやく気づくことができました。\n必要のないものにどれだけのお金を無駄にしてきたか、ようやく気づかせてくれました。私はこれまでずっと衝動買いをしてきましたが、頭の中で「欲しい（買える）」と思うとすぐに買ってしまいます。\n欲しいと思うとすぐに買ってしまいます。何が問題なのか、正確には説明できませんが\n原因を正確に説明することはできませんが、最近では、自分に問いかけるようにしています...",
      "title": "暗号のおかげで無駄遣いをしなくなりました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Crypto终于让我意识到我浪费了多少钱在我真的\n不需要的东西。我的一生都是一个冲动的买家，只要我脑子里一想到我想要的东西（我买得起），我就会去买。\n脑子里一想到我想要的东西（我买得起），我就会买下它。我真的无法解释\n但现在我问自己，如果这个东西是我想要的，我就买它。",
      "title": "感谢加密货币，我已经不再浪费钱了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Crypto終於讓我意識到我浪費了多少錢在我真的\n不需要的東西。我的一生都是一個衝動的買家，只要我腦子裏一想到我想要的東西（我買得起），我就會去買。\n腦子裏一想到我想要的東西（我買得起），我就會買下它。我真的無法解釋\n但現在我問自己，如果這個東西是我想要的，我就買它。",
      "title": "感謝加密貨幣，我已經不再浪費錢了。"
    }
  ]
}