{
  "author": "thinkB4WeSpeak",
  "the_new_excerpt": "Equities research analysts expect J.B. Hunt Transport Services, Inc.\n(NASDAQ:JBHT) to announce $2.47 billion in sales for the current quarter, Zacks\nInvestment Research reports. Five analysts have made estimates for J.B. Hunt\nTransport Services' earnings. The lowest sales estimate is $2.36 billion…",
  "original_created_utc": 1615304520,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "股票研究分析师预计，J.B. Hunt Transport Services, Inc.\n(NASDAQ:JBHT)将宣布本季度销售额为24.7亿美元，Zacks。\n投资研究报告。有五位分析师对J.B.Hunt进行了估算。\n运输服务的业绩。销售额最低预期为23.6亿元，...",
      "title": "预计J.B. Hunt Transport Services, Inc.的销售额为24.7亿美元。本季度销售额预计为24.7亿美元"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "股票研究分析師預計，J.B. Hunt Transport Services, Inc.\n(NASDAQ:JBHT)將宣佈本季度銷售額爲24.7億美元，Zacks。\n投資研究報告。有五位分析師對J.B.Hunt進行了估算。\n運輸服務的業績。銷售額最低預期爲23.6億元，...",
      "title": "預計J.B. Hunt Transport Services, Inc.的銷售額爲24.7億美元。本季度銷售額預計爲24.7億美元"
    }
  ],
  "title": "$2.47 Billion in Sales Expected for J.B. Hunt Transport Services, Inc. This Quarter",
  "created_utc": 1615316026,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Equities research analysts expect J.B. Hunt Transport Services, Inc. (NASDAQ:JBHT) to announce $2.47 billion in sales for the current quarter, Zacks Investment Research reports. Five analysts have made estimates for J.B. Hunt Transport Services&#39; earnings. The lowest sales estimate is $2.36 billion and the highest is $2.58 billion. J.B. Hunt Transport Services reported sales of $2.28 billion in the same quarter last year, which would suggest a positive year over year growth rate of 8.3%. The firm is scheduled to issue its next quarterly earnings results on Tuesday, April 13th.</p>\n\n<p>JB Hunt (NASDAQ:JBHT) Crashes After Mixed Quarter</p>\n\n<p>According to Zacks, analysts expect that J.B. Hunt Transport Services will report full year sales of $10.81 billion for the current fiscal year, with estimates ranging from $10.55 billion to $11.17 billion. For the next financial year, analysts anticipate that the business will post sales of $11.63 billion, with estimates ranging from $11.19 billion to $11.95 billion. Zacks Investment Research&#39;s sales calculations are a mean average based on a survey of sell-side research analysts that that provide coverage for J.B. Hunt Transport Services.</p>\n\n<p>J.B. Hunt Transport Services (NASDAQ:JBHT) last released its quarterly earnings results on Monday, January 18th. The transportation company reported $1.44 earnings per share for the quarter, beating analysts&#39; consensus estimates of $1.30 by $0.14. J.B. Hunt Transport Services had a net margin of 5.31% and a return on equity of 21.07%. The company had revenue of $2.74 billion during the quarter, compared to the consensus estimate of $2.57 billion. During the same period in the previous year, the business earned $1.35 earnings per share. The firm&#39;s quarterly revenue was up 11.7% on a year-over-year basis.</p>\n\n<p>A number of research firms have recently weighed in on JBHT. Cowen lifted their price target on shares of J.B. Hunt Transport Services from $131.00 to $145.00 and gave the company a &quot;market perform&quot; rating in a research report on Wednesday, January 20th. Citigroup Inc. 3% Minimum Coupon Principal Protected Based Upon Russell upgraded shares of J.B. Hunt Transport Services from a &quot;neutral&quot; rating to a &quot;buy&quot; rating and lifted their price target for the company from $150.00 to $165.00 in a research report on Wednesday, January 6th. Deutsche Bank Aktiengesellschaft lifted their price target on shares of J.B. Hunt Transport Services from $139.00 to $146.00 and gave the company a &quot;hold&quot; rating in a research report on Thursday, January 21st. Smith Barney Citigroup raised shares of J.B. Hunt Transport Services from a &quot;neutral&quot; rating to a &quot;buy&quot; rating and lifted their price objective for the company from $150.00 to $165.00 in a research note on Wednesday, January 6th. Finally, Stephens lifted their price objective on shares of J.B. Hunt Transport Services from $155.00 to $167.00 and gave the company an &quot;overweight&quot; rating in a research note on Tuesday, January 5th. Eleven analysts have rated the stock with a hold rating and eleven have given a buy rating to the stock. J.B. Hunt Transport Services currently has a consensus rating of &quot;Buy&quot; and a consensus price target of $148.67.</p>\n\n<p>In related news, EVP Eric Mcgee sold 1,500 shares of the business&#39;s stock in a transaction on Monday, February 22nd. The shares were sold at an average price of $146.79, for a total value of $220,185.00. Following the sale, the executive vice president now owns 952 shares of the company&#39;s stock, valued at $139,744.08. The sale was disclosed in a legal filing with the SEC, which is accessible through the SEC website. Also, Chairman James K. Thompson sold 5,000 shares of the business&#39;s stock in a transaction on Monday, March 1st. The stock was sold at an average price of $150.87, for a total transaction of $754,350.00. Following the completion of the sale, the chairman now directly owns 35,038 shares in the company, valued at approximately $5,286,183.06. The disclosure for this sale can be found here. Insiders own 3.51% of the company&#39;s stock.</p>\n\n<p>Several hedge funds and other institutional investors have recently made changes to their positions in JBHT. Daiwa Securities Group Inc. raised its holdings in shares of J.B. Hunt Transport Services by 13.6% during the third quarter. Daiwa Securities Group Inc. now owns 4,151 shares of the transportation company&#39;s stock valued at $525,000 after purchasing an additional 498 shares during the period. Teacher Retirement System of Texas raised its holdings in shares of J.B. Hunt Transport Services by 830.9% in the 3rd quarter. Teacher Retirement System of Texas now owns 25,841 shares of the transportation company&#39;s stock worth $3,266,000 after acquiring an additional 23,065 shares during the last quarter. Los Angeles Capital Management &amp; Equity Research Inc. acquired a new stake in shares of J.B. Hunt Transport Services in the 3rd quarter worth about $1,627,000. Sigma Planning Corp acquired a new stake in shares of J.B. Hunt Transport Services in the 3rd quarter worth about $1,690,000. Finally, Symmetry Partners LLC raised its holdings in shares of J.B. Hunt Transport Services by 52.0% in the 3rd quarter. Symmetry Partners LLC now owns 7,023 shares of the transportation company&#39;s stock worth $888,000 after acquiring an additional 2,402 shares during the last quarter. Hedge funds and other institutional investors own 69.25% of the company&#39;s stock.</p>\n\n<p>NASDAQ JBHT opened at $159.39 on Tuesday. The company has a current ratio of 1.58, a quick ratio of 1.58 and a debt-to-equity ratio of 0.52. J.B. Hunt Transport Services has a 1-year low of $75.29 and a 1-year high of $160.95. The company has a 50 day moving average of $145.95 and a 200-day moving average of $137.64. The company has a market cap of $16.85 billion, a price-to-earnings ratio of 34.28, a PEG ratio of 1.66 and a beta of 1.00.</p>\n\n<p>The firm also recently disclosed a quarterly dividend, which was paid on Friday, February 19th. Investors of record on Friday, February 5th were paid a $0.28 dividend. This is a boost from J.B. Hunt Transport Services&#39;s previous quarterly dividend of $0.27. The ex-dividend date of this dividend was Thursday, February 4th. This represents a $1.12 annualized dividend and a dividend yield of 0.70%. J.B. Hunt Transport Services&#39;s payout ratio is currently 22.90%.</p>\n\n<p>About J.B. Hunt Transport Services</p>\n\n<p>J.B. Hunt Transport Services, Inc provides surface transportation and delivery services in North America. It operates through five segments: Intermodal (JBI), Dedicated Contract Services (DCS), Integrated Capacity Solutions (ICS), Final Mile Services (FMS), and Truckload (JBT). The JBI segment offers intermodal freight solutions.</p>\n\n<p><a href=\"https://www.marketbeat.com/instant-alerts/nasdaq-jbht-consensus-analyst-rating-2021-03/\">https://www.marketbeat.com/instant-alerts/nasdaq-jbht-consensus-analyst-rating-2021-03/</a></p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/investing/comments/m1927f/247_billion_in_sales_expected_for_jb_hunt/",
  "subreddit": "investing",
  "id": "m1927f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542575829
}