{
  "author": "DaddySkates",
  "original_created_utc": 1638748412,
  "title": "New to crypto? Here is my long-ass-write-up of Top 10 cryptocurrencies with PROs and CONs for each of them so you can decide what to put your hard earned money in easier",
  "created_utc": 1638766113,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We have recently reached over 4 million users in the &lt;a href=\"/r/cryptocurrency\"&gt;r/cryptocurrency&lt;/a&gt; which is nothing short of amazing. There has been a big influx of new users to this sub and as such I wanted to contribute something that will help those who are new to cryptocurrencies to understand a bit more about top 10 cryptocurrencies by researching the PROs and CONs of each of the top 10 crypto coins. For obvious reasons I skipped the stablecoins. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Are you new to crypto? Welcome! Veteran trader with no emotions left? Welcome bud, have a seat and light up that cigar. &lt;/p&gt;\n\n&lt;p&gt;This took a long time to research and write-up everything so if you enjoy it, I appreciate your feedback.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Alright, bring your cocoa and get cozy, Papa is ready to tell you about these bad boys. Let&amp;#39;s start from the top;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;#1 Bitcoin - BTC&lt;/h1&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The grand-daddy of crypto. The biggest and the meanest. The all-father.&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;+It is the biggest and most stable crypto out there, everyone knows it and the community that supports it is the largest. Institutions, funds and companies hold BTC and the number of them is increasing every day.&lt;/p&gt;\n\n&lt;p&gt;+Safest bet in cryptoverse and only 21 million of BTC will ever exist. A lot of that BTC has been lost forever and as such illiquid.&lt;/p&gt;\n\n&lt;p&gt;+It&amp;#39;s a synonymous with the word crypto and digital gold for a good reason. It&amp;#39;s considered one if not the best store of value to hedge ever increasing inflation!&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;-Movement is sometimes slower than altcoins.&lt;/p&gt;\n\n&lt;p&gt;-Transactions are slow and can get pricey even though Lightning network updated is trying to fix the scalability issues at the cost of &lt;/p&gt;\n\n&lt;p&gt;-Smaller potential for high returns &lt;/p&gt;\n\n&lt;p&gt;---------------------------------------------------------------&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;#2 Ethereum - ETH&lt;/h1&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The original altcoin and second biggest crypto right after BTC.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;+Insane support for dapps, smart contracts, defi and so on&lt;/p&gt;\n\n&lt;p&gt;+Good support even in dips&lt;/p&gt;\n\n&lt;p&gt;+Very good support in community&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;-We are still waiting for full Ethereum 2.0 release&lt;/p&gt;\n\n&lt;p&gt;-Transaction fees can get outrageous, be vary when transferring to wallets&lt;/p&gt;\n\n&lt;p&gt;-Other altcoins are slowly gaining on ETH in terms of tech, smart contracts and other aspects&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;---------------------------------------------------------------&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;#3 Binance Coin - BNB&lt;/h1&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Utility token that wanted to become more&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;+Big popularity among Binance users and others&lt;/p&gt;\n\n&lt;p&gt;+Fast transactions, low fees and constantly getting burned which lowers supply cap&lt;/p&gt;\n\n&lt;p&gt;+Allows cross platform usage with Binance Smart Chain (BSC)&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;-Centralized AF&lt;/p&gt;\n\n&lt;p&gt;-Binance is a Chinese led company which is a concern on it&amp;#39;s own&lt;/p&gt;\n\n&lt;p&gt;-BNB is almost a complete copycat of Ethereum and has had very few new developments over the years. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;---------------------------------------------------------------&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;#4 Solana - SOL&lt;/h1&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Recently Solana has shoot up the charts and claimed the 4th spot. Good base with a solid ecosystem and a bright future. Pun intended.&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;+Solana Ecosystem is extremely fast and efficient&lt;/p&gt;\n\n&lt;p&gt;+The fees are extremely low, typically costing 0.000005 SOL, or about $0.001.&lt;/p&gt;\n\n&lt;p&gt;+It successfully hosts over 250 applications on its ecosystem and an unique Proof of History system.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;-Very centralized which showed nicely on Sep 14, when team took down the network due to technical issues. Also heard in &amp;quot;D in Solana stands for decentralized&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;-Proof of History consensus is still in early stage of development and hasn&amp;#39;t been tested as much. Number of validators is low and has some really BIG whales.&lt;/p&gt;\n\n&lt;p&gt;- Same as other PoS systems it&amp;#39;s typicalls prone to micro transaction attacks like Nano in 2021. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;---------------------------------------------------------------&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;#5 Cardano - ADA&lt;/h1&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Child of Charles Hoskinson which has been growing steadily despite recent dips. Recently implemented long awaited smart contracts.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;+Super easy to stake it and reap rewards with Yoroi and its DPos staking buit in right in the app! &lt;/p&gt;\n\n&lt;p&gt;+Cardano has support for native tokens without any need for smart contracts meaning that you don&amp;#39;t need to pay for gas fees on it&amp;#39;s network. &lt;/p&gt;\n\n&lt;p&gt;+Cardano has a massive support from the followers and Charles is a very likable face of ADA. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;-Recent smart contract upgrade didn&amp;#39;t live to the hype. &lt;/p&gt;\n\n&lt;p&gt;-Cardanos main thing was cheap and fast transactions which many of the other PoS coins now have and more. &lt;/p&gt;\n\n&lt;p&gt;-Staking on Cardano is great but competitors like DOT take it to a higher level.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;---------------------------------------------------------------&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;#6 XRP - XRP&lt;/h1&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The good ol XRP which SEC is still trying to take down and keeps failing at every step.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;+Close to 0 transaction fees (0.00001 XRP per transaction)) and super low environment impact with low energy consumption&lt;/p&gt;\n\n&lt;p&gt;+It still has a MASSIVE fanbase despite SEC fiasco and large organizations support it&lt;/p&gt;\n\n&lt;p&gt;+There is a lot of talk about XRP becoming a big gaming-oriented currency (unreliable sources)&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;-The lawsuit.&lt;/p&gt;\n\n&lt;p&gt;-Big market supply that was pre-mined by Ripple. &lt;/p&gt;\n\n&lt;p&gt;-There are many competitors that do most of what Ripple does with better tokenomics.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;---------------------------------------------------------------&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;#7 Polkadot - DOT&lt;/h1&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Let&amp;#39;s Polka! Very popular crypto nowadays with their recent release of crowdloans.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;+It&amp;#39;s already solving the scalability problem faster than ETH is! Excellent transaction speed and very low price.&lt;/p&gt;\n\n&lt;p&gt;+Amazing support by the developers and superb PoS consensus with crowdloans&lt;/p&gt;\n\n&lt;p&gt;+Amazing ecosystem that hosts over 490 projects that are built on Polkadot&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;-Crowdloans are locked for 2 years on DOT which is a LONG time in crypto&lt;/p&gt;\n\n&lt;p&gt;-Same as other PoS systems, there are WHALES and a lot of them. &lt;/p&gt;\n\n&lt;p&gt;-Absolutely foolish system of having to keep minimum 1 DOT in wallet to keep it alive . Also not very newbie friendly due to the massive amount of options that they give to users. (You can also count that as a PRO if you are experienced).&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;---------------------------------------------------------------&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;#8 Terra - LUNA&lt;/h1&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;A very hot L1 project that you probably heard about LUNA recently when it started it&amp;#39;s rocketing to the...LUNA?&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;+Fuels whole Terra network and supports Terra stablecoins and payments. And Terra has a really deep wallet and they are using it to support their project.&lt;/p&gt;\n\n&lt;p&gt;+Allows swapping of stablecoins which makes Terra awesome for cross border payements. The Mirror and Anchor protocols on Terra are impressive.&lt;/p&gt;\n\n&lt;p&gt;+LUNAtic community of supporters and some big names of the industry world&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;-Stablecoins are not backed by cash so it can crash the price of LUNA. Regulation on stablecoins can affect it.&lt;/p&gt;\n\n&lt;p&gt;-Regulators be eyeing Terra like  (≖ ͜ʖ≖) &lt;/p&gt;\n\n&lt;p&gt;-Tokenomics are sketchy and we still don&amp;#39;t know how exactly that went down back in the day&lt;/p&gt;\n\n&lt;p&gt;---------------------------------------------------------------&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;#9 Avalanche - AVAX&lt;/h1&gt;\n\n&lt;p&gt;&lt;strong&gt;The fastest smart contracts platform in the blockchain industry.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;+Easy porting of Ethereum Dapps or even other blockchain to AVAX &lt;/p&gt;\n\n&lt;p&gt;+Good decentralisation, low fees, superb customization &lt;/p&gt;\n\n&lt;p&gt;+Latency or &amp;quot;finality&amp;quot; of Bitcoin is 60minutes, Eth is 6 minutes but Avax claims sub 1 second finality that is completely irreversible and has ability to process 4500 TPS!&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;-Recently AVAX got overwhelmed by the sudden rise of users and the fees went almost ETH levels.&lt;/p&gt;\n\n&lt;p&gt;-Not as many projects built on AVAX compared to others on this list and staking options are odd and unflexible. Poor user experience and newbie unfriendly.&lt;/p&gt;\n\n&lt;p&gt;-Some people argue that AVAX security is poor since they dont enforce shared security across the network unlike Polkadot. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;---------------------------------------------------------------&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;#10 Polygon - MATIC&lt;/h1&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Polygon or formerly Matic is a L2 scaling solution on ETH network.&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;+Enhancing ETH network with its solutions = ETH with cheap gas fees!!!&lt;/p&gt;\n\n&lt;p&gt;+Good support of the fanbase and strong DeFi integration support &lt;/p&gt;\n\n&lt;p&gt;+Extremely low fees (you get enough MATIC from a faucet to perform 10 transactions!) and great TPS on sidechains &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;-There is a doubt that Eth 2.0 could make it obsolute (Vitalik denied that though)&lt;/p&gt;\n\n&lt;p&gt;-Long, long, loooong accumulation time which put off some people from investing in Matic&lt;/p&gt;\n\n&lt;p&gt;-Many L2 competitors such as Loopring, Arbitrum (which our moons run on), Optimism and so on&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;---------------------------------------------------------------&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;This is it guys, Top 10 cryptocurrencies summed up! I&amp;#39;ve been researching for a long time and it took a few hours to write this up and try to present the pros and cons in an understandable way. I very much hope this write-up helps you and if it did, I highly appreciate your feedback. It helps immensely with my motivation to keep writing posts like this. Any thoughts, recommendations or anything are more than welcome :)&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Have a superb start of the week my people! Let&amp;#39;s wake up into green.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 241,
  "permalink": "/r/CryptoCurrency/comments/r9t2l7/new_to_crypto_here_is_my_longasswriteup_of_top_10/",
  "subreddit": "CryptoCurrency",
  "id": "r9t2l7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We have recently reached over 4 million users in the r/cryptocurrency\n[/r/cryptocurrency] which is nothing short of amazing. There has been a big\ninflux of new users to this sub and as such I wanted to contribute something\nthat will help those who are new to cryptocurrencies to understand a bit…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このたび、r/cryptocurrencyのユーザー数が400万人を突破しました。\n[/r/cryptocurrency] これは驚き以外の何物でもありません。大きな\nこのサブに新しいユーザーが流入してきたので、私は何か貢献したいと思いました。\n暗号通貨に初めて触れる人が少しでも理解できるように...。",
      "title": "暗号は初めてですか？ここでは、私が書いたトップ10の暗号通貨のPROとCONをそれぞれ紹介しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们最近在r/cryptocurrency中的用户已经达到了400多万。\n[/r/cryptocurrency]，这不禁让人惊叹。有大量的\n新用户涌入这个子，因此我想贡献一些东西\n这将有助于那些刚接触加密货币的人了解一些...",
      "title": "初次接触加密货币？这里是我写的10大加密货币的长篇大论，其中包括每个货币的优点和缺点，这样你就可以更容易地决定把你辛苦赚来的钱放在什么地方。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們最近在r/cryptocurrency中的用戶已經達到了400多萬。\n[/r/cryptocurrency]，這不禁讓人驚歎。有大量的\n新用戶湧入這個子，因此我想貢獻一些東西\n這將有助於那些剛接觸加密貨幣的人瞭解一些...",
      "title": "初次接觸加密貨幣？這裏是我寫的10大加密貨幣的長篇大論，其中包括每個貨幣的優點和缺點，這樣你就可以更容易地決定把你辛苦賺來的錢放在什麼地方。"
    }
  ]
}