{
  "author": "IraqLobster89",
  "original_created_utc": 1629549760,
  "title": "I need help for my little brother, advice?",
  "created_utc": 1629556085,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, my brother is 14 ok? And he just came to me and told me that a few months ago he won a bet with his bigger sister (she&#39;s 16). And then I was like &quot;yeah that&#39;s awesome! What was the bet about?&quot; Then, he told me that she would give 5 bucks to him, if he could get a girl to send him personally a nude pic, so, he contacted (on reddit) a girl that posts nude on reddit and claimed to be an artist and asked her for a free nude pic to make an artwork, the girl accepted and she sent the nude by email on a secondary email address of my brother. So he won the bet. After he told me the full story i was like &quot;dude! Congrats!&quot; and we just laughed and joked for the rest of the day. But when I was about to sleep, the adult instinct kicked in and i thought &quot;shit, he shouldn&#39;t have done it, he&#39;s a minor after all, he&#39;s smart and all, but still a minor&quot; so i woke up this morning with the intention to tell him to not do that again, but I am trying to find the right way to tell him, i don&#39;t wanna be too harsh since he is in a bad moment right now, but i don&#39;t wanna be too soft either. What should I tell him? And second question, should I tell my mom? Shes gonna beat the shit outta me even if I&#39;m 26, i introduced him to reddit like a year ago. Are we in some kind of trouble? He and his sister are staying with me in this period so I&#39;m the adult of the situation.</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/TooAfraidToAsk/comments/p8qs4a/i_need_help_for_my_little_brother_advice/",
  "subreddit": "TooAfraidToAsk",
  "id": "p8qs4a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So, my brother is 14 ok? And he just came to me and told me that a few months\nago he won a bet with his bigger sister (she's 16). And then I was like \"yeah\nthat's awesome! What was the bet about?\" Then, he told me that she would give 5\nbucks to him, if he could get a girl to send him personally a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "弟は14歳で大丈夫なの？で、数ヶ月前にお姉ちゃん（16歳）との賭けに勝ったって\n数ヶ月前にお姉ちゃん（16歳）と賭けをして勝ったんだって。そして、私は「うん\nそれはすごい! 何の賭けだったの？\" そしたら、お姉ちゃんが5ドルをあげるって言うんです。\nそして、お姉さんが5ドルあげるから、もし、女の子から個人的に...",
      "title": "弟のために助けが必要です、アドバイスをお願いします。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "那么，我的弟弟14岁了吗？他刚来找我，告诉我几个月前\n几个月前，他赢得了与他姐姐（她16岁）的打赌。然后我就说 \"是啊\n那真是太棒了! 赌的是什么？\" 然后，他告诉我，她会给他5美元。\n块钱给他，如果他能让一个女孩亲自送他一个......",
      "title": "我需要帮助我的小兄弟，建议？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "那麼，我的弟弟14歲了嗎？他剛來找我，告訴我幾個月前\n幾個月前，他贏得了與他姐姐（她16歲）的打賭。然後我就說 \"是啊\n那真是太棒了! 賭的是什麼？\" 然後，他告訴我，她會給他5美元。\n塊錢給他，如果他能讓一個女孩親自送他一個......",
      "title": "我需要幫助我的小兄弟，建議？"
    }
  ]
}