{
  "author": "theflyingegyptian",
  "original_created_utc": 1628029675,
  "title": "Why do people make it feel weird to leave work as soon as your shift ends?",
  "created_utc": 1628077040,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I started a new job and today was the first day of my fourth week. This is my first job in an office setting. My hours are 8-5 with an hour for lunch. \nI usually arrive  5-10 minutes before 8 (except for one day when I missed my exit and was 15 minutes late), and only start working at 8:00 no matter how early I arrive. </p>\n\n<p>Also as soon as the clock ticks 5 I&#39;m out of there. On my way out I get some weird looks because almost everyone there is still working.</p>\n\n<p>Now I&#39;m salaried and don&#39;t get paid overtime so why should I stick around? </p>\n\n<p>That and I already spend almost an hour commuting each way so I want to get home ASAP to enjoy whatever time I have left before I have to sleep and repeat. </p>\n\n<p>It&#39;s just the looks that I keep getting that make me feel like I&#39;m doing something illegal. </p>\n\n<p>I&#39;m in the US if that makes any difference.</p>\n</div><!-- SC_ON -->",
  "score": 9408,
  "permalink": "/r/NoStupidQuestions/comments/oxel2n/why_do_people_make_it_feel_weird_to_leave_work_as/",
  "subreddit": "NoStupidQuestions",
  "id": "oxel2n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I started a new job and today was the first day of my fourth week. This is my\nfirst job in an office setting. My hours are 8-5 with an hour for lunch. I\nusually arrive 5-10 minutes before 8 (except for one day when I missed my exit\nand was 15 minutes late), and only start working at 8:00 no…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "というわけで、新しい仕事を始めて、今日は4週目の初日でした。これが私の\nオフィスでの仕事は初めてです。勤務時間は8時から5時、昼食は1時間です。I\n私は通常、8時の5～10分前には到着し、（ある日、出口を間違えて15分遅れたことを除いては\n8時になってから仕事を始めます。",
      "title": "なぜ人は、シフトが終わったらすぐに仕事を辞めることを変に感じさせるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我开始了一份新工作，今天是我第四个星期的第一天。这是我\n这是我在办公室的第一份工作。我的工作时间是8点到5点，有一个小时的午餐时间。I\n我通常在8点前5-10分钟到达（除了有一天我错过了我的出口，迟到了15分钟）。\n迟到了15分钟），并在8点开始工作，不...",
      "title": "为什么人们让你一下班就觉得奇怪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我開始了一份新工作，今天是我第四個星期的第一天。這是我\n這是我在辦公室的第一份工作。我的工作時間是8點到5點，有一個小時的午餐時間。I\n我通常在8點前5-10分鐘到達（除了有一天我錯過了我的出口，遲到了15分鐘）。\n遲到了15分鐘），並在8點開始工作，不...",
      "title": "爲什麼人們讓你一下班就覺得奇怪？"
    }
  ]
}