{
  "author": "1BitcoinIsMyLifeGoal",
  "original_created_utc": 1630258919,
  "title": "If 1 Bitcoin appeared in your wallet right now, what would you do?",
  "created_utc": 1630272784,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If 1 Bitcoin appeared in your wallet with no explanation from anyone, what would you do next? </p>\n\n<p>If it happened to me, I would immediately try to see if I was dreaming. Then I would cry. Then I would put it into a cold storage and add security. I wouldn&#39;t tell anyone but I would be acting as if life is magical and i would probably tip many friends and family some  maybe also strangers for fun. </p>\n\n<p>Has this ever happened to anyone and what did they do? I kept dreaming about it. Sometimes i just check my wallet for no reason. </p>\n\n<p>Just wondering what you all would do if it happened to you</p>\n</div><!-- SC_ON -->",
  "score": 222,
  "permalink": "/r/CryptoCurrency/comments/pdzv80/if_1_bitcoin_appeared_in_your_wallet_right_now/",
  "subreddit": "CryptoCurrency",
  "id": "pdzv80",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If 1 Bitcoin appeared in your wallet with no explanation from anyone, what would\nyou do next?\n\nIf it happened to me, I would immediately try to see if I was dreaming. Then I\nwould cry. Then I would put it into a cold storage and add security. I wouldn't\ntell anyone but I would be acting as if life…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もし、あなたの財布に誰からの説明もなく1ビットコインが入ってきたら、どうしますか？\nあなたは次に何をしますか？\n\nもし自分の身に起こったとしたら、すぐに夢でも見ているのではないかと考えます。そして、泣きます。\n涙を流します。そして、コールドストレージに入れてセキュリティを強化します。誰にも言いません。\n誰にも言わずに、あたかも人生が...という感じで行動します。",
      "title": "もし今、あなたの財布に1ビットコインが入ってきたら、あなたはどうしますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果1个比特币出现在你的钱包里，没有人解释，你会怎么做？\n你接下来会怎么做？\n\n如果这种情况发生在我身上，我会立即尝试看看我是否在做梦。然后我\n会哭。然后我会把它放到一个冷库里，并增加安全性。我不会\n我不会告诉任何人，但我会表现得好像生活...",
      "title": "如果1个比特币现在就出现在你的钱包里，你会怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果1個比特幣出現在你的錢包裏，沒有人解釋，你會怎麼做？\n你接下來會怎麼做？\n\n如果這種情況發生在我身上，我會立即嘗試看看我是否在做夢。然後我\n會哭。然後我會把它放到一個冷庫裏，並增加安全性。我不會\n我不會告訴任何人，但我會表現得好像生活...",
      "title": "如果1個比特幣現在就出現在你的錢包裏，你會怎麼做？"
    }
  ]
}