{
  "author": "ANAL-Inverter-2000",
  "original_created_utc": 1624960223,
  "title": "PSA Warning: Dear noobs, please remember, the sub /r/btc, bitcoin[dot]com (and their wallet), and blockchain[dot]info are malicious and are trying to trick newcomers into buying a fake BTC!",
  "created_utc": 1624991549,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Although this has been repeated a million times before, I think it&#39;s still appropriate to warn new users in this space. I&#39;ve seen a couple of noobs stumble upon the abovementioned sub / websites, thinking that these resources represent BTC. Indeed, they are trying very hard to conceil the fact that they are a miniscule and unimportant part of the space trying to gain significance. However, they failed doing so over the course of the last 3-4 years.</p>\n\n<p>In short, they are trying to push a fake Bitcoin clone called B.CH (I&#39;m writing the dot because auto-mod doesn&#39;t like talk about alt-coins). If you don&#39;t know about the history of how these sites came about, google &quot;the fork war&quot; during 2017. You&#39;ll see that a faction of people split up from Bitcoin (thank god) to roll out their own shitcoin. However, at this point, they are basically a bunch of bitter propagandists, defining their community as being &quot;against&quot; BTC, and trying to trick noobs into thinking that their fork is the &quot;real&quot; Bitcoin. </p>\n\n<p>You&#39;ll see that their main argument is that this sub is heavily cens.ored (which is true, look how ridiculous I am trying to avoid auto-deletions), but the reason for that is not to silence opposing views (we can discuss about opposing technical views here all day), but mostly to keep this sub clean (imagine what it would look like here, if moderation wasn&#39;t harsh. Ever been on Twitter?) </p>\n\n<p>In any case: STAY AWAY FROM THESE TOXIC PLACES. They operate through hate and fear and you&#39;ll learn things only from one single perspective. Do your own research. Do not trust but verify.</p>\n\n<hr/>\n\n<p>Edit: <strong>They have spotted this post!</strong> Shitcoin downvote army incoming, brace yourself! They will shill &quot;why not diversify&quot; or &quot;there are better crypto&#39;s out there&quot;, &quot;Lightning network doesn&#39;t work&quot; and the same shxt they&#39;ve been repeating over and over.</p>\n\n<p>Edit 2: This post has gone from 95% upvoted to 79% in an instant ;) Nice.</p>\n</div><!-- SC_ON -->",
  "score": 372,
  "permalink": "/r/Bitcoin/comments/oa52dx/psa_warning_dear_noobs_please_remember_the_sub/",
  "subreddit": "Bitcoin",
  "id": "oa52dx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Although this has been repeated a million times before, I think it's still\nappropriate to warn new users in this space. I've seen a couple of noobs stumble\nupon the abovementioned sub / websites, thinking that these resources represent\nBTC. Indeed, they are trying very hard to conceil the fact that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これまでに何度も繰り返されてきたことではありますが、それでも私は\nこの分野で新しいユーザーに警告することは適切だと思います。私は何人かの初心者が上記のサブ/ウェブサイトにつまずくのを見てきました。\nこれらのリソースがBTCを表していると考えて、上記のサブ/ウェブサイトにつまずく初心者を何人か見てきました。\nBTCだと思い込んでいる初心者を何人か見てきました。確かに、彼らはその事実を必死に隠そうとしていますが...。",
      "title": "PSA警告 親愛なるnoobの皆さん、サブの/r/btc、bitcoin[dot]com（とそのウォレット）、blockchain[dot]infoは悪意があり、新参者を騙して偽のBTCを買わせようとしていることを覚えておいてください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "虽然这句话以前已经重复过无数次了，但我认为在这个问题上警告新用户仍然是适当的。\n在这个空间里警告新用户是适当的。我已经看到一些新手偶然发现了\n偶然发现上述子/网站，认为这些资源代表了\nBTC。事实上，他们非常努力地掩盖了一个事实：...",
      "title": "PSA警告。亲爱的新手，请记住，子/r/btc，bitcoin[点]com（和他们的钱包），以及blockchain[点]info是恶意的，试图欺骗新人购买一个假的BTC!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "雖然這句話以前已經重複過無數次了，但我認爲在這個問題上警告新用戶仍然是適當的。\n在這個空間裏警告新用戶是適當的。我已經看到一些新手偶然發現了\n偶然發現上述子/網站，認爲這些資源代表了\nBTC。事實上，他們非常努力地掩蓋了一個事實：...",
      "title": "PSA警告。親愛的新手，請記住，子/r/btc，bitcoin[點]com（和他們的錢包），以及blockchain[點]info是惡意的，試圖欺騙新人購買一個假的BTC!"
    }
  ]
}