{
  "author": "Some1fromReddit",
  "the_new_excerpt": "I was with her for 2 years, and honestly, before crypto trading, my life was\nreally boring.\n\nI work a regular 9-5 barely making bills on time. I'm not saving anything ever,\nand my only hobbies is her, all she wants to do is watch movies, and I get that.\nThat's not the issue with her, I really don't…",
  "original_created_utc": 1617119118,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我和她在一起2年了，说实话，在加密交易之前，我的生活是\n真的很无聊。\n\n我的工作是朝九晚五的，勉强能按时结账。我没有储蓄任何东西永远。\n而我唯一的爱好就是她，她只想看电影，我明白。\n这不是她的问题，我真的不... ...",
      "title": "我女朋友说摆脱加密技术，所以我摆脱了她。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和她在一起2年了，說實話，在加密交易之前，我的生活是\n真的很無聊。\n\n我的工作是朝九晚五的，勉強能按時結賬。我沒有儲蓄任何東西永遠。\n而我唯一的愛好就是她，她只想看電影，我明白。\n這不是她的問題，我真的不... ...",
      "title": "我女朋友說擺脫加密技術，所以我擺脫了她。"
    }
  ],
  "title": "My Girlfriend said Get Rid of Crypto, so I Got Rid Of Her.",
  "created_utc": 1617140568,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was with her for 2 years, and honestly, before crypto trading, my life was really boring. </p>\n\n<p>I work a regular 9-5 barely making bills on time. I&#39;m not saving anything ever, and my only hobbies is her, all she wants to do is watch movies, and I get that.  That&#39;s not the issue with her, I really don&#39;t like judging people.</p>\n\n<p>About this time last year after talking with a friend, I decided to make an investment into crypto with only $1000.   I know that&#39;s small beans for most people but It was everything I saved in 4 months.  I told her about it, and she was a bit upset that I wasted my money but she got over it.  </p>\n\n<hr/>\n\n<p><strong>Now I have about $10,000 IN CRYPTO</strong></p>\n\n<ul>\n<li><p>it&#39;s very exciting.</p></li>\n<li><p>already cashed out my initial investment</p></li>\n<li><p>cashed out an additional $1000</p></li>\n<li><p>I put $2000 of my long term aside for day trading. </p></li>\n<li><p>I&#39;m on over 12 exchanges</p></li>\n<li><p>I&#39;m able to make an extra $300 a week playing lower cap coins. </p></li>\n</ul>\n\n<p>I&#39;ve honestly never had so much money in my life, and I&#39;m much happier! Crypto is a real hobby and investment at the same time.  </p>\n\n<p><strong>But for the past couple months since the Doge frenzy, My girlfriend is Super Paranoid about it, and doesn&#39;t understand anything.  She keeps telling me not to buy into the meme coin thing even though I told her I never have</strong>. </p>\n\n<p><strong>She keeps</strong>...</p>\n\n<ul>\n<li><p>telling me if I don&#39;t take out I&#39;m gonna lose all my money</p></li>\n<li><p>telling me to take it all out so we can go on a big vacation.</p></li>\n<li><p>telling me it&#39;s an addiction and maybe I should stop and see someone about it</p></li>\n</ul>\n\n<p>Now her latest thing is telling me what I&#39;m doing is hurting the environment.</p>\n\n<p>THIS IS SO AGGRAVATING! </p>\n\n<p>I must of told her at least 7 times I can&#39;t lose my money because I already cashed out a 100% profit, and I&#39;m starting to cash out an additional $200-300 a week swing trading ... and the rest doesn&#39;t matter as it&#39;s long term.</p>\n\n<p>Her response? <strong>That&#39;s not gonna last forever</strong></p>\n\n<p>Who cares if it lasts forever or not.  I&#39;m good, I never lost, so it doesn&#39;t even matter, and that extra wouldn&#39;t even be there if I listened to her to stop a few months ago .</p>\n\n<p>But anyway I just figured maybe she misses spending time with me at nights.   Woman are very hard to figure out.  </p>\n\n<p>So I decided to do something nice the other day. </p>\n\n<ul>\n<li><p>I bought her few orchids. \n(Not the crypto Orchid...the actually flowers).  </p></li>\n<li><p>I bought very expensive food to cook, and wine. (With my crypto earnings)</p></li>\n<li><p>I bought her a new bag for the gym\n(Here&#39;s was starting to rip on the side)\nI bought that to with my earnings. </p></li>\n</ul>\n\n<p><strong>I spent ALL DAY yesterday preparing and cooking a meal so I could have it ready by the time she gets home from work</strong></p>\n\n<p>We actually had a good time. She was smiling and so happy I did all that for her, we talking about nothing too. It was perfect. We were tipsy, and at the end just as the meal was finished I decided maybe this was a good time to make some moves on her later...  </p>\n\n<p>But before she finished...she just couldn&#39;t help her self?</p>\n\n<pre><code>She ended the whole thing with *I really wish you would stop playing on those crypto apps*\n</code></pre>\n\n<p>And then we got into a little picker over it. </p>\n\n<p>I was SOOOO PISSED!  I Felt like the entire mood was killed and everything I did to make a good mood was just nullified.</p>\n\n<p>So yesterday I simply gathered all my stuff up this morning, went to the bank and withdrew that $1000 profit, I left it on the table for her with a note that said &quot;you wanted to use my crypto earnings for vacation...now you can without me&quot; </p>\n\n<p>I also changed my number, and today I&#39;m driving to another state to look at a house to rent.. funny thing is, the rent is 1/3 of the price that we were paying here in the city.   </p>\n\n<ul>\n<li><p>Now I have the luxury of exploring other jobs without worrying about going broke for rent. </p></li>\n<li><p>Now I can enjoy trading crypto without hearing it from someone that wants to control my life.    FUCK THAT!</p></li>\n</ul>\n\n<p>NOTE: what my investment in alts go up another 12x?  That&#39;s over $100K that&#39;s enough for a down payment on a house and will cover 4 years of mortgage payments. It might not get there but what if it does? And if not , what&#39;s my loss? Doubled my initial investment? Back to working like I always do?\nThere&#39;s everything to win and nothing to lose for me. I&#39;m glad I left.</p>\n</div><!-- SC_ON -->",
  "score": 758,
  "permalink": "/r/CryptoCurrency/comments/mgixnu/my_girlfriend_said_get_rid_of_crypto_so_i_got_rid/",
  "subreddit": "CryptoCurrency",
  "id": "mgixnu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357138670
}