{
  "author": "Cheetahboy3000",
  "original_created_utc": 1654528503,
  "title": "Why is Johnny Depp getting SO MUCH praise when he was obviously giving tendencies of a toxic/abusive person too?",
  "created_utc": 1654537793,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Amber Heard definitely deserved to pay up but there&amp;#39;s a reason he had to throw in a nice chunk of money too. I&amp;#39;m glad that everyone is starting to see that men can be DV victims too but people are acting like he was a saint when they both clearly showed abusive tendencies in the trial?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 135,
  "permalink": "/r/NoStupidQuestions/comments/v65tst/why_is_johnny_depp_getting_so_much_praise_when_he/",
  "subreddit": "NoStupidQuestions",
  "id": "v65tst",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Amber Heard definitely deserved to pay up but there's a reason he had to throw\nin a nice chunk of money too. I'm glad that everyone is starting to see that men\ncan be DV victims too but people are acting like he was a saint when they both\nclearly showed abusive tendencies in the trial?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アンバー・ハードは間違いなく金を払うに値するが、彼が投げなければならなかった理由がある。\nにも理由があるんだ。男性もDVの被害者になりうるということを、みんなが理解し始めているのは嬉しい。\nが、まるで彼が聖人のように振舞う。\n裁判では明らかに虐待の傾向が見られたのに、みんなは彼を聖人君子みたいに言ってるの？",
      "title": "ジョニー・デップも明らかに毒親・虐待者の傾向を出していたのに、なぜこんなに賞賛されているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "安柏-赫德绝对值得付出代价，但他不得不扔下一大笔钱是有原因的。\n在一个漂亮的大块钱也。我很高兴每个人都开始看到，男人也可以成为家庭暴力的受害者。\n我很高兴每个人都开始看到男人也可以成为家庭暴力的受害者，但人们表现得好像他是一个圣人，而他们两个人\n在审判中明显表现出虐待倾向？",
      "title": "为什么约翰尼-德普得到如此多的赞美，而他显然也是在给一个有毒/虐待的人的倾向？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "安柏-赫德絕對值得付出代價，但他不得不扔下一大筆錢是有原因的。\n在一個漂亮的大塊錢也。我很高興每個人都開始看到，男人也可以成爲家庭暴力的受害者。\n我很高興每個人都開始看到男人也可以成爲家庭暴力的受害者，但人們表現得好像他是一個聖人，而他們兩個人\n在審判中明顯表現出虐待傾向？",
      "title": "爲什麼約翰尼-德普得到如此多的讚美，而他顯然也是在給一個有毒/虐待的人的傾向？"
    }
  ]
}