{
  "author": "gnarley_quinn",
  "original_created_utc": 1657083034,
  "title": "Against the odds, Celsius may be about to save itself.",
  "created_utc": 1657112217,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not involved in Celsius in any way. I had no funds nor did I particularly care about them either way. I thought perhaps some of the things they were doing may have been too good to be true, but my decision to stay away was more out of laziness than anything else. However, their presence across crypto was enormous, so I have been following their collapse over the last few weeks.  &lt;/p&gt;\n\n&lt;p&gt;Yet despite FTX walking away from a buyout, Three Arrows Capital filing for bankruptcy, the LUNA collapse, a massive FUD campaign with facts and false stories, they might be about to navigate an escape.&lt;/p&gt;\n\n&lt;p&gt;3AC seems to be the real perpetrator here - they borrowed heavily from Genesis, Voyager, Celsius, BlockFi, Babel and Deribit. They absolutely degened their way through the bull market and exposed the risk of the lenders.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m unsure where they are getting the funding from, but in the last day or two, Celsius has repaid more than $60m worth of their own Bitcoin loan. This has brought the liquidation price down to less than $5k. The liquidation price was $22k only a few weeks ago. To bring it down this much is an absolute massive effort, and I believe that is an effort worthy of respecting - even if you&amp;#39;re not involved in Celsius like me.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/vsx955f0pv991.jpg?width=922&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=486314a1b9d5ff9aacdb9678cca4546abd5387b9\"&gt; &lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not about to start trusting them, and storing my own coins for a small APY, but if they can get out of this, I hope they will have learned their lessons for the future.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 320,
  "permalink": "/r/CryptoCurrency/comments/vshqdx/against_the_odds_celsius_may_be_about_to_save/",
  "subreddit": "CryptoCurrency",
  "id": "vshqdx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm not involved in Celsius in any way. I had no funds nor did I particularly\ncare about them either way. I thought perhaps some of the things they were doing\nmay have been too good to be true, but my decision to stay away was more out of\nlaziness than anything else. However, their presence across…"
}