{
  "author": "caspertheasper",
  "the_new_excerpt": "TLDR: crypto will be the most important asset of the 21st century. (This post is\nabout long term Hodling and not intended to make anyone expect to get rich with\nYOLO investments).\n\nI post this because I want to live in a world where wealth is distributed and\ndecentralized. It may be inevitable that…",
  "original_created_utc": 1617766655,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TLDR：cryptoは21世紀の最も重要な資産になる。(この記事は\nこの投稿は長期的なホドリングについてのものであり、誰もがYOLO投資で一攫千金を期待することを意図したものではありません。\nYOLO投資で一攫千金を期待させるためのものではありません）。)\n\n私は富が分散され、分散化された世界に住みたいと思っているので、この投稿をしました。\n分権化された世界に住みたいからです。避けられないことかもしれませんが...",
      "title": "私はヒストリアンです。21世紀のCRYPTOは、19世紀のLANDのような存在になるだろう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TLDR：加密技术将成为21世纪最重要的资产。(这篇文章是\n关于长期的Hodling，并不打算让任何人期望通过发财\nYOLO投资）。)\n\n我发这个帖子是因为我希望生活在一个财富分配和\n分散化。可能不可避免的是，...",
      "title": "我是一个历史学家。CRYPTO在21世纪的地位 就像土地在19世纪的地位一样。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TLDR：加密技術將成爲21世紀最重要的資產。(這篇文章是\n關於長期的Hodling，並不打算讓任何人期望通過發財\nYOLO投資）。)\n\n我發這個帖子是因爲我希望生活在一個財富分配和\n分散化。可能不可避免的是，...",
      "title": "我是一個歷史學家。CRYPTO在21世紀的地位 就像土地在19世紀的地位一樣。"
    }
  ],
  "title": "I'm a Historian: CRYPTO will be to the 21st century, as LAND was to the nineteenth century",
  "created_utc": 1617784235,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TLDR: crypto will be the most important asset of the 21st century. (This post is about long term Hodling and not intended to make anyone expect to get rich with YOLO investments).</p>\n\n<p>I post this because I want to live in a world where wealth is distributed and decentralized. It may be inevitable that big hedge funds and whales end up scooping the largest swaths of crypto markets. But I&#39;d love to read posts in ten years of the 2 million <a href=\"/r/cryptocurrency\">r/cryptocurrency</a> users who held and accumulated and are financially independent. </p>\n\n<p><strong>Crypto is not stock or simply digital cash. sure, according to the SEC it&#39;s a commodity, but it&#39;s really so much more.</strong></p>\n\n<p><strong><em>It is land.</em></strong></p>\n\n<p><strong>...because certain crypto projects, like Ethereum, will be the foundation upon which the rest of the global economy is built.</strong></p>\n\n<p>As a metaphor, think of eighteenth century landholders in the United States. (The colonizers, yes. Fucked up, I acknowledge). They owned the economy&#39;s foundation: land. Not only could they reap cash from selling land for a profit, but because land had so much power, they could literally shape the map itself. They had the power to build towns, lease real estate, and even shape government (voting was restricted to landholders for the early part of the century).</p>\n\n<p>My thesis: Cryptocurrency will be no less powerful. And those who hold it early (because it&#39;s still early af) will be the ones who shape the century, <em>or will at least maintain enough financial independence to smoke bowls all day in your favorite sweat pants like I plan to.</em> </p>\n\n<p><strong>Much like land could, crypto can command resources, accumulate interest, host business development, and much more. Accumulate 32 Eth for your own node and you&#39;re the owner of the digital equivalent of investment real estate, earning a dependable ROI perpetually. Own Chainlink, and you control the toll road between phsyical/digital assets. And so forth...</strong></p>\n\n<p>This sort of wealth creation comes once in a century, and as big money enters the arena, crypto will become very scarce and very expensive.  Now is a person&#39;s chance to accumulate a form of capital that IMO will be comparable to land in it&#39;s significance to the global economy.  </p>\n\n<p>The big money has known this for years as they quietly accumulated. But it&#39;s still early.</p>\n\n<p>So DYOR, make up you&#39;re own mind. Just don&#39;t take this lightly, or in 50 years your grandkid&#39;s first words will be &quot;dumb fuck&quot;.</p>\n\n<p>[This is not financial advice: this post was typed by the ass of a very cute cat sitting upon the keyboard while the user lays drunk on the couch].</p>\n</div><!-- SC_ON -->",
  "score": 884,
  "permalink": "/r/CryptoCurrency/comments/mltd4e/im_a_historian_crypto_will_be_to_the_21st_century/",
  "subreddit": "CryptoCurrency",
  "id": "mltd4e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961876906
}