{
  "author": "downwithnarcy",
  "the_new_excerpt": "$CRSR is announcing their Q4 earnings tomorrow in Pre-Market. Yes, I know, its\ncoming off a bull run so must be ready for the 2021 IV crush right?\n\nI don't think so.\n\nAs someone said better than I last week TL;DR... Corsair has already teased\ntheir full 2020 earnings in a prospectus a couple of…",
  "original_created_utc": 1612861125,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "$CRSR明天将在盘前公布第四季度财报。是的，我知道，它的\n从牛市中走出来，所以一定是为2021年的四级粉碎做好准备吧？\n\n我不这么认为。\n\n就像上周有人说的比我好TL;DR...... Corsair已经预告了\n其2020年的全部收益在招股书中几...",
      "title": "下面是我认为$CRSR为什么还没有定价的盈利惊喜的原因。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "$CRSR明天將在盤前公佈第四季度財報。是的，我知道，它的\n從牛市中走出來，所以一定是爲2021年的四級粉碎做好準備吧？\n\n我不這麼認爲。\n\n就像上週有人說的比我好TL;DR...... Corsair已經預告了\n其2020年的全部收益在招股書中幾...",
      "title": "下面是我認爲$CRSR爲什麼還沒有定價的盈利驚喜的原因。"
    }
  ],
  "title": "Here's why I think $CRSR does not already have the earnings surprise priced in",
  "created_utc": 1612893059,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>$CRSR is announcing their Q4 earnings tomorrow in Pre-Market. Yes, I know, its coming off a bull run so must be ready for the 2021 IV crush right?</p>\n\n<p>I don&#39;t think so.</p>\n\n<p>As someone said better than I last week TL;DR... Corsair has already teased their full 2020 earnings in a prospectus a couple of weeks ago on 1/21. We already know they&#39;re ending with an incredible year. Better yet, the institutional traders have their heads in the sand on it. <a href=\"https://ir.corsair.com/static-files/22acfc88-2f42-4b16-8bbb-099323323f33\">https://ir.corsair.com/static-files/22acfc88-2f42-4b16-8bbb-099323323f33</a></p>\n\n<p>Since that announcement, the stock has increased <strong>27%</strong>. Earnings surprise must be priced in right? I doubt it</p>\n\n<p>Looking at LOGI, the closest competitor. We saw a big dip starting 1/15 (day before earnings announcement), and on 1/18, day of ER). Standard 2021 post-earnings IV crush.... Right before it ran to ATH 2 weeks later.</p>\n\n<p>Now looking at CRSR vs Logi movements <a href=\"https://imgur.com/Bf1gVZB\">https://imgur.com/Bf1gVZB</a> CRSR had a big drop around the same time too. But why? They didnt&#39; release earnings. No major news. No IV crush?</p>\n\n<p><strong>On 1/13/21, Corsair dropped from the sky, on the same day $G M E started its short squeeze and jumped 57% in a day.</strong></p>\n\n<p>Maybe a coincidence. Or maybe the 1/13 squeeze wasn&#39;t a price correction, it was direct a reaction to the squeeze and overall market pullback. Hedge funds moving money around.</p>\n\n<p>Oh yea, guess who owns 2% of the outstanding float of CRSR? The kings of Squeeze themselves, Citadel <a href=\"https://imgur.com/xlQNZyJ\">https://imgur.com/xlQNZy</a> </p>\n\n<p>Then price began to recover to normal, until 1/27 and they announced a secondary PO.... price drops again.</p>\n\n<p>And THEN we run to $46-$47...27% gain from the post-drop low of $36.</p>\n\n<p><strong>BUT, we are only 7% up from the recent high trading averages of $41, and still 9% below the ATH.</strong></p>\n\n<p>This doesn&#39;t sound like its overpriced at all. Sounds like the recent high IVs are result of the price normalization, not over-buying.</p>\n\n<p><strong>TL;DR:</strong> I think the IV crush or post-earnings selloff is going to be mild, and a precursor to a very fast bounce-back bull run to ATHs</p>\n</div><!-- SC_ON -->",
  "score": 69,
  "permalink": "/r/investing/comments/lfygo8/heres_why_i_think_crsr_does_not_already_have_the/",
  "subreddit": "investing",
  "id": "lfygo8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123199876
}