{
  "author": "1FlawedHumanBeing",
  "original_created_utc": 1655907455,
  "title": "Before a doctor can take blood (literally just put a needle in an arm) they have to practice with a fake arm then pass a test. Why is it so offensive to some Americans to want the same minimum for guns (using airsoft to practice or something)?",
  "created_utc": 1655915787,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I understand your 2a.  I love guns, personally. They&amp;#39;re fun to use at a range. Shooting an m82a1, mk.19 and ma deuce are all on my bucket list.&lt;/p&gt;\n\n&lt;p&gt;I am however glad I live in a country where guns are almost impossible to obtain, despite this meaning I have to book a holiday to America for said bucket list items.  &lt;/p&gt;\n\n&lt;p&gt;I understand that with literally half of the world&amp;#39;s civilian firearms, an extensive border with Mexico already prepped for smuggling and a number of gun-nuts who would never part with their firearms (queue boating accident meme), the ship for ridding America of firearms has sailed away with the English a couple of centuries ago.  &lt;/p&gt;\n\n&lt;p&gt;I also look at what happened in Ukraine and can see the argument for civilian arms.  To those who say &amp;quot;a poorly trained redneck with an AR15 is useless against an f35 or a nuclear armed B21&amp;quot; I point towards Afghanistan. (Also the ar15 vs nuke argument often crops up in discussions like these but the idea that, even in a civil war, a president would nuke their own country seems laughable) &lt;/p&gt;\n\n&lt;p&gt;Guerrilla wars are different to conventional ww3 style fights.  I still imagine said rednecks would do more damage than benefit but I at least see where they&amp;#39;re coming from.   &lt;/p&gt;\n\n&lt;p&gt;But I also notice 2a says &amp;quot;a &lt;strong&gt;well regulated&lt;/strong&gt; militia.  I guess (guess being the key word since, though many claim otherwise, none truly know the founding fathers&amp;#39; true intent) &amp;quot;shall not be infringed&amp;quot; speaks to WHAT weapons one is allowed to own.  But well regulated must mean that regulation is not totally unacceptable.  &lt;/p&gt;\n\n&lt;p&gt;So why is expecting a minimum standard of training so egregious?  All I would expect is the basics: proving you can rack, check, load, make safe and go a few hours of assessment without flagging anybody or putting your finger inside the trigger guard inappropriately.  &lt;/p&gt;\n\n&lt;p&gt;This isn&amp;#39;t meant to be a shot at gun nuts (get it? &amp;quot;shot&amp;quot;).  I simply want to understand why a short course using realistic plastic BB firing weapons, which meets the requirements laid out in the paragraph above, to then be allowed to purchase a firearm, is so unacceptable in the eyes of said gun-nuts&lt;/p&gt;\n\n&lt;p&gt;I know this is reddit so many people will take this as me asking a leading question or trying to make a point rather than seek an answer, but I genuinely can&amp;#39;t understand the opposing viewpoint and would like to grasp it before I form a concrete opinion on it for myself. &lt;/p&gt;\n\n&lt;p&gt;I figured since this is supposed to be a safe space for controversial questions, this was the place to ask.  I hope that is okay with you all.  &lt;/p&gt;\n\n&lt;p&gt;To anyone who wasted their time reading my ranting essay above, sorry that I struggle with concision and I hope you  have a nice day&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/TooAfraidToAsk/comments/vi6bpp/before_a_doctor_can_take_blood_literally_just_put/",
  "subreddit": "TooAfraidToAsk",
  "id": "vi6bpp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I understand your 2a. I love guns, personally. They're fun to use at a range.\nShooting an m82a1, mk.19 and ma deuce are all on my bucket list.\n\nI am however glad I live in a country where guns are almost impossible to\nobtain, despite this meaning I have to book a holiday to America for said…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2aの件、了解しました。個人的に銃は好きです。射撃場で使うのが楽しいんです。\nM82A1、MK.19、MA DEUCEを撃つのは私のバケットリストのすべてです。\n\nしかし、銃を手に入れることがほとんど不可能な国に住んでいてよかったと思います。\nそのためには、アメリカへの休暇を予約しなければならないのだが......。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我理解你的2a。我个人喜欢枪。在靶场使用它们很有趣。\n射击m82a1，mk.19和ma deuce都在我的遗愿清单上。\n\n然而，我很高兴我生活在一个几乎不可能获得枪支的国家。\n尽管这意味着我必须预订一个去美国的假期，以获得......"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我理解你的2a。我個人喜歡槍。在靶場使用它們很有趣。\n射擊m82a1，mk.19和ma deuce都在我的遺願清單上。\n\n然而，我很高興我生活在一個幾乎不可能獲得槍支的國家。\n儘管這意味着我必須預訂一個去美國的假期，以獲得......"
    }
  ]
}