{
  "author": "JBJGoat999",
  "original_created_utc": 1655820243,
  "title": "My grandfather, his mother, and his two sisters were Germans apparently in a German work camp in Ww2? Is this a thing?",
  "created_utc": 1655910195,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was asking about my family history yesterday because I know that my family on my moms side came over from Europe relatively recently. &lt;/p&gt;\n\n&lt;p&gt;My grandmothers parents were both Russian Jews that fled before WW2 started but my moms father / grandmothers husband was a German and not Jewish. Here’s the story I got and I was wondering if this makes sense because I haven’t heard of Germans being in work camps before.&lt;/p&gt;\n\n&lt;p&gt;He was young when WW2 was going on and apparently him, his mother and his two sisters ended up being in a work camp for like 4-5 years. They were Germans and not any of the groups that I associate with going to camps when I think of WW2. My mom told me that they had some parts of these camps where they would keep German families together and this would be like the public facing part of camps where much worse stuff was likely happening.&lt;/p&gt;\n\n&lt;p&gt;Does this sound right? Were Germans put into work camps as well?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/vhe3sb/my_grandfather_his_mother_and_his_two_sisters/",
  "subreddit": "AskHistorians",
  "id": "vhe3sb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was asking about my family history yesterday because I know that my family on\nmy moms side came over from Europe relatively recently.\n\nMy grandmothers parents were both Russian Jews that fled before WW2 started but\nmy moms father / grandmothers husband was a German and not Jewish. Here’s…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は昨日、私の家族の歴史について尋ねていました。\n私の母方の家族がヨーロッパから渡ってきたのは比較的最近のことです。\n\n祖母の両親はロシア系ユダヤ人で、第二次世界大戦が始まる前に逃亡してきたのですが\n母方の父／祖母の夫はドイツ人で、ユダヤ人ではないんです。これは...",
      "title": "私の祖父とその母、そして2人の妹は、Ww2のドイツ人労働キャンプにいたドイツ人らしいのですが？ こんなのあるんですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我昨天询问了我的家族历史，因为我知道我妈妈那边的家族是最近才从欧洲过来的。\n我妈妈那边是最近才从欧洲过来的。\n\n我的祖母的父母都是俄罗斯犹太人，他们在二战开始前就逃亡了，但是\n我妈妈的父亲/祖母的丈夫是德国人，不是犹太人。这里是...",
      "title": "我的祖父、他的母亲和他的两个姐妹都是德国人，显然是在二战期间的德国工作营里？ 这是一个事情吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我昨天詢問了我的家族歷史，因爲我知道我媽媽那邊的家族是最近才從歐洲過來的。\n我媽媽那邊是最近才從歐洲過來的。\n\n我的祖母的父母都是俄羅斯猶太人，他們在二戰開始前就逃亡了，但是\n我媽媽的父親/祖母的丈夫是德國人，不是猶太人。這裏是...",
      "title": "我的祖父、他的母親和他的兩個姐妹都是德國人，顯然是在二戰期間的德國工作營裏？ 這是一個事情嗎？"
    }
  ]
}