{
  "author": "AffectionateMind26",
  "original_created_utc": 1637987441,
  "title": "Would you be okay with your President buying Bitcoin dips regularly using taxpayers money?",
  "created_utc": 1638027513,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>El Salvador became the first country heading towards Crypto adoption. We all appreciated the move. </p>\n\n<p>El Salvador&#39;s president, keeps promoting crypto and the adoption even though so many El Salvador people are against it. \nEl Salvador just bought black Friday&#39;s dip with 100 more bitcoins. </p>\n\n<p>My question to you all is,\nWould you be okay with such investment of your country, using the money paid by you as tax?</p>\n\n<p>Would you be okay with that investment going down and then not being able to use that amount for emergencies? </p>\n\n<p>It is such a tricky question, to which I dont know the answer to.</p>\n\n<p>I want Crypto to be adopted quickly. But I am not sure if I would want my country to use my money in their Crypto investment.</p>\n\n<p>I would be willing to take the risk for myself. But wouldn&#39;t want my country to use the funds which are necessary in other development areas of my country.</p>\n\n<p>What are your thoughts?</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/CryptoCurrency/comments/r35c2h/would_you_be_okay_with_your_president_buying/",
  "subreddit": "CryptoCurrency",
  "id": "r35c2h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "El Salvador became the first country heading towards Crypto adoption. We all\nappreciated the move.\n\nEl Salvador's president, keeps promoting crypto and the adoption even though so\nmany El Salvador people are against it. El Salvador just bought black Friday's\ndip with 100 more bitcoins.\n\nMy question…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "エルサルバドルは、暗号の導入に向けた最初の国となりました。私たちは皆\nこの動きに感謝しています。\n\nエルサルバドルの大統領は、多くのエルサルバドル人が反対しているにもかかわらず、暗号化とその採用を推進し続けています。\n多くのエルサルバドル人が反対しているにもかかわらず、大統領は暗号と採用を推進しています。エルサルバドルはブラックフライデーの下げを100ビットコインで買いました。\n100ビットコインを追加して、ブラックフライデーの下げを買いました。\n\n質問ですが...",
      "title": "大統領が税金を使ってビットコインのディップを定期的に購入しても構わないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "萨尔瓦多成为第一个走向采用加密货币的国家。我们都\n对此举表示赞赏。\n\n萨尔瓦多总统一直在推动加密货币的采用，尽管这么多萨尔瓦多人反对它。\n许多萨尔瓦多人反对它。萨尔瓦多刚刚用100多个比特币买下了黑色星期五的\n用100多个比特币买下了黑色星期五的下跌。\n\n我的问题是...",
      "title": "你可以接受你的总统用纳税人的钱定期购买比特币的跌价吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "薩爾瓦多成爲第一個走向採用加密貨幣的國家。我們都\n對此舉表示讚賞。\n\n薩爾瓦多總統一直在推動加密貨幣的採用，儘管這麼多薩爾瓦多人反對它。\n許多薩爾瓦多人反對它。薩爾瓦多剛剛用100多個比特幣買下了黑色星期五的\n用100多個比特幣買下了黑色星期五的下跌。\n\n我的問題是...",
      "title": "你可以接受你的總統用納稅人的錢定期購買比特幣的跌價嗎？"
    }
  ]
}