{
  "author": "AverageStudent1",
  "original_created_utc": 1636117823,
  "title": "The CRO token has reached a new ATH and also has a upcoming Cronos Mainnet Launch. Why is a ecosystem with so much potential not getting any attention on this sub?",
  "created_utc": 1636140807,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Crypto com is at the top of their game when it comes to marketing. They literally have partnerships with MAJOR sports brands. To name a few: UFC, Formula 1, NBA, Serie A, Paris Saint German.. They are also to be found in the multibillion dollar gaming segment, partnering up with the streaming service Twitch (Twitch Rivals) and esports team Fnatic.</p>\n\n<p>They have insane exposure in all major categories but that&#39;s not all there is to it. Their Visa Cards are some of the most popular on the market, offering different rewards based on how much CRO you&#39;ve staked. You&#39;re basically staking CRO to get more CRO while also reaping the card benefits with no annual fees.</p>\n\n<p>Crypto com&#39;s APP is easy and simple to use. It offers 30 days 0 fee purchases for new users. This is such a smart way bring in even more people into the ecosystem.</p>\n\n<p>&#x200B;</p>\n\n<p>I suspect the reason we are pumping right now is because of the <strong>Coinbase listing and</strong> <strong>Cronos Mainnet Launch</strong> in less than a week. It allows developers to instantly port dapps from any Ethereum and EVM-compatible chains. It&#39;s designed to scale the DEFI ecosystem. Cronos is offering the developers a super easy to use platform and a huge global userbase.</p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/CryptoCurrency/comments/qnasii/the_cro_token_has_reached_a_new_ath_and_also_has/",
  "subreddit": "CryptoCurrency",
  "id": "qnasii",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Crypto com is at the top of their game when it comes to marketing. They\nliterally have partnerships with MAJOR sports brands. To name a few: UFC,\nFormula 1, NBA, Serie A, Paris Saint German.. They are also to be found in the\nmultibillion dollar gaming segment, partnering up with the streaming…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Crypto comは、マーケティングに関してはトップレベルの企業です。彼らは\n文字通り、メジャーなスポーツブランドとパートナーシップを結んでいます。いくつか例を挙げてみましょう。UFC。\nF1、NBA、セリエA、パリ・サンジェルマン...。また、数十億ドル規模のゲーム分野でも\nまた、数十億ドル規模のゲーム分野でも、ストリーミングサービスと提携しています...",
      "title": "CROトークンが新たなATHに到達し、さらにCronosメインネットの立ち上げが予定されています。これだけの可能性を秘めたエコシステムが、なぜこの国では注目されないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当涉及到营销时，Crypto com处于其游戏的顶端。他们\n他们与主要的体育品牌建立了伙伴关系。仅举几例。UFC。\n一级方程式赛车、NBA、意甲联赛、巴黎圣日尔曼...... 他们还在数十亿美元的游戏领域\n他们还在数十亿美元的游戏领域，与流媒体合作......",
      "title": "CRO代币已经达到了一个新的ATH，并且还有一个即将推出的Cronos主网。为什么一个具有如此大潜力的生态系统在这个子上没有得到任何关注？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當涉及到營銷時，Crypto com處於其遊戲的頂端。他們\n他們與主要的體育品牌建立了夥伴關係。僅舉幾例。UFC。\n一級方程式賽車、NBA、意甲聯賽、巴黎聖日爾曼...... 他們還在數十億美元的遊戲領域\n他們還在數十億美元的遊戲領域，與流媒體合作......",
      "title": "CRO代幣已經達到了一個新的ATH，並且還有一個即將推出的Cronos主網。爲什麼一個具有如此大潛力的生態系統在這個子上沒有得到任何關注？"
    }
  ]
}