{
  "author": "Raiwist",
  "original_created_utc": 1633895371,
  "title": "Criticism of a coin isn't 'FUD' if it's factual - this trend is so annoying",
  "created_utc": 1633948825,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s so irritating having people feel it&#39;s ok to dismiss anything they disagree with or just don&#39;t want to hear as &#39;FUD&#39;. The term has lost all meaning: now it just seems to be used to try to delegitimise a person&#39;s perspective.</p>\n\n<p>It just makes a community feel cultish when any kind of criticism/ potentially negative viewpoint, even if justified and logical, is shouted down without any reasonable counterpoint being made. </p>\n\n<p>This sub is actually fairly balanced (for the most part) compared to coin-specific subs where extreme patisanism rules, but you get the odd user who can&#39;t stand to see the project they support being questioned. This kind of behaviour does more harm than good because it&#39;s apt to deter potential investors when fair discussion is cut short.</p>\n\n<p>Anyway, sorry for the rant. What do you think of this kind of behaviour?</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/q5faqp/criticism_of_a_coin_isnt_fud_if_its_factual_this/",
  "subreddit": "CryptoCurrency",
  "id": "q5faqp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's so irritating having people feel it's ok to dismiss anything they disagree\nwith or just don't want to hear as 'FUD'. The term has lost all meaning: now it\njust seems to be used to try to delegitimise a person's perspective.\n\nIt just makes a community feel cultish when any kind of criticism/…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自分の意見が通らないもの、聞きたくないものを「FUD」と言って片付けてしまう人がいるのは、とても腹立たしいことです。\n自分の意見に反するもの、聞きたくないものを「FUD」と言って片付けてしまう人がいるのは、とても腹立たしいことです。この言葉にはもう意味がありません。\n今では、ある人の視点を否定するために使われているようにしか思えません。\n\nどんな種類の批判や意見があっても、それはコミュニティをカルト的にするだけです。",
      "title": "コインへの批判は、事実であれば「FUD」ではない - この傾向はとても迷惑です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "人们觉得可以把他们不同意的或不想听的东西当作 \"疑虑 \"来否定，这太让人生气了。\n他们不同意或只是不想听到的东西都被认为是 \"FUD\"。这个词已经失去了所有的意义：现在它\n似乎只是被用来试图否定一个人的观点。\n\n当任何形式的批评/意见都被认为是 \"邪教 \"的时候，它就会使一个社区感到邪教。",
      "title": "对硬币的批评如果是事实，就不是'FUD'--这种趋势太令人讨厌了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們覺得可以把他們不同意的或不想聽的東西當作 \"疑慮 \"來否定，這太讓人生氣了。\n他們不同意或只是不想聽到的東西都被認爲是 \"FUD\"。這個詞已經失去了所有的意義：現在它\n似乎只是被用來試圖否定一個人的觀點。\n\n當任何形式的批評/意見都被認爲是 \"邪教 \"的時候，它就會使一個社區感到邪教。",
      "title": "對硬幣的批評如果是事實，就不是'FUD'--這種趨勢太令人討厭了"
    }
  ]
}