{
  "author": "sith_happenss",
  "original_created_utc": 1656924363,
  "title": "Not your keys not your crypto, but scammers can steal from you easier - decided to get off exchanges and money gone",
  "created_utc": 1656960543,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have been using exchanges for a year now, but after all this craziness happening with the withdrawals, I decided to slowly start DCA-ing on Metamask, because I wanted to keep my crypto off exchanges.&lt;/p&gt;\n\n&lt;p&gt;I do not have my secret recovery phrase anywhere digitally, its in my house on paper and I live alone. No one could read it. I did not give away my phone to anyone not for a short amount of time when the scam happened. I was at home, no one could unlock with my Face ID.&lt;/p&gt;\n\n&lt;p&gt;My Metamask is connected to Plutus exchange on Brave Browser, it asks for my simple password, anytime I connect it. So that password may have been hacked, which is equivalent to my FaceID on my iPhone.&lt;/p&gt;\n\n&lt;p&gt;Today I logged in to see my eth, and poof its gone. It had been sent to an another address. I dont understand how this could happen? How can someone send my money to their address only with my browser login password. If someone logs in from an another device it should ask my 12 word phrase, no? I have sent the daily dca to my CDC address to see how easy it to send it. I added my CDC address just in case like in a month ago, so I dont know for new addresses is 24h required?&lt;/p&gt;\n\n&lt;p&gt;Thankfully &amp;quot;its only&amp;quot; a 100 euros, but thats like 2 weeks of food or my whole month&amp;#39;s bills where I live. I am obviously mad, how can something like this happen. Even CDC had more security with 2FA, 24h whitelisting address than the secret recovery key Metamask Wallet.&lt;/p&gt;\n\n&lt;p&gt;This is the scammer address btw: &lt;a href=\"https://etherscan.io/address/0xe34f6a76abc77b07158fa07d3069167dc62cdb6a\"&gt;https://etherscan.io/address/0xe34f6a76abc77b07158fa07d3069167dc62cdb6a&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I dont know what I did wrong, I am very cautious, I am simply infuriating that I could have been like 1000 or 10 000 euros too. And a scammer could get my money with only with my Metamask login password not even my recovery phrase. Maybe not my keys not my crypto but I am definitely going back to Crypto.com.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/vr2wqh/not_your_keys_not_your_crypto_but_scammers_can/",
  "subreddit": "CryptoCurrency",
  "id": "vr2wqh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have been using exchanges for a year now, but after all this craziness\nhappening with the withdrawals, I decided to slowly start DCA-ing on Metamask,\nbecause I wanted to keep my crypto off exchanges.\n\nI do not have my secret recovery phrase anywhere digitally, its in my house on\npaper and I live…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1年前からExchangeを使用していますが、このような騒ぎになった後\n出金してしまったので、MetamaskでゆっくりDCAを始めることにしました。\nというのも、自分の暗号を取引所から遠ざけておきたかったからです。\n\n私は秘密のリカバリーフレーズをデジタル上ではどこにも持っていません。\n紙で保管しています...",
      "title": "あなたの鍵ではなく、あなたの暗号でもなく、詐欺師はあなたから簡単に盗むことができます - 交換とお金がなくなってから取得することを決定しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经使用交易所一年了，但在所有这些疯狂的事情之后\n我决定慢慢开始在Metamask上使用DCA。\n因为我想让我的加密货币远离交易所。\n\n我没有把我的秘密恢复短语放在任何数字地方，它在我的房子里。\n纸上，我住在...",
      "title": "不是你的钥匙不是你的加密货币，但骗子可以更容易地从你那里偷东西--决定离开交易所，钱就没了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經使用交易所一年了，但在所有這些瘋狂的事情之後\n我決定慢慢開始在Metamask上使用DCA。\n因爲我想讓我的加密貨幣遠離交易所。\n\n我沒有把我的祕密恢復短語放在任何數字地方，它在我的房子裏。\n紙上，我住在...",
      "title": "不是你的鑰匙不是你的加密貨幣，但騙子可以更容易地從你那裏偷東西--決定離開交易所，錢就沒了"
    }
  ]
}