{
  "author": "Supercharmeleon",
  "original_created_utc": 1633786101,
  "title": "If you hear \"To the m**n!\" and \"Hold the line!\" regarding your coin: Sell. Run. Call your mom. Do ANYTHING except FOMO in.",
  "created_utc": 1633807992,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>EDIT: Had to change the word m**n in the title so the bot doesn&#39;t think it&#39;s a post about the coin moons and deletes it.</p>\n\n<p>This is a dance we&#39;ve danced many times before, but of course newbies might not be aware, since the meteoric start of the bull run was a while ago, and the previous one was even longer behind it.</p>\n\n<p>With coins like SHIB, Axies and GALA skyrocketing in price, a lot of people will be trying to make profits as close to the ATH as possible, leaving the greedy newbies holding their bags while they run off right before the price starts to drop.</p>\n\n<p>And even worse, there will be those who FOMO into the coin closest to the ATH, just because of all the &quot;to the moon!&quot; comments. And once it inevitably starts to drop, those wanting to sell will tell others to &quot;hold the line!&quot; so they can get out before you do.</p>\n\n<p>Don&#39;t fall for it. Trust me, it never ends well. I fell for it with Doge and the Gamestop stocks, and lost a lot of money in the process.</p>\n\n<p>Be smart. Stick to your plan. And sell before it goes to shit, for the love of god.</p>\n</div><!-- SC_ON -->",
  "score": 176,
  "permalink": "/r/CryptoCurrency/comments/q4lcn2/if_you_hear_to_the_mn_and_hold_the_line_regarding/",
  "subreddit": "CryptoCurrency",
  "id": "q4lcn2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "EDIT: Had to change the word m**n in the title so the bot doesn't think it's a\npost about the coin moons and deletes it.\n\nThis is a dance we've danced many times before, but of course newbies might not\nbe aware, since the meteoric start of the bull run was a while ago, and the\nprevious one was even…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "EDIT: タイトルのm**nという言葉を変えなければなりませんでした。\nボットがコインムーンについての投稿だと勘違いして削除してしまわないように。\n\nこれは今まで何度も踊ってきたダンスですが、もちろん初心者の方はご存知ないかもしれません。\nこれまで何度も踊ってきたダンスですが、ブルランの急激なスタートはしばらく前のことなので、もちろん初心者は気づかないかもしれません。\nその前のものはさらに...。",
      "title": "コインについて「To the m**n！」や「Hold the line！」と聞こえてきたら、「Sell. 逃げる。お母さんに電話しましょう。FOMO以外のことをしましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：不得不改变标题中的m**n一词，这样机器人就不会认为这是一个\n关于硬币月亮的帖子，并将其删除。\n\n这是我们以前跳过很多次的舞，当然，新手可能不知道。\n当然，新手可能不知道，因为牛市运行的流星型开始已经有一段时间了，而之前的\n前一个甚至是...",
      "title": "如果你听到关于你的硬币的 \"To the m**n!\"和 \"Hold line!\"：出售。逃跑。给你妈妈打电话。做任何事情，除了FOMO。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：不得不改變標題中的m**n一詞，這樣機器人就不會認爲這是一個\n關於硬幣月亮的帖子，並將其刪除。\n\n這是我們以前跳過很多次的舞，當然，新手可能不知道。\n當然，新手可能不知道，因爲牛市運行的流星型開始已經有一段時間了，而之前的\n前一個甚至是...",
      "title": "如果你聽到關於你的硬幣的 \"To the m**n!\"和 \"Hold line!\"：出售。逃跑。給你媽媽打電話。做任何事情，除了FOMO。"
    }
  ]
}