{
  "author": "Albino_Whale",
  "the_new_excerpt": "Just curious about what the apes think about the housing market? I work for a\nhigh end ($1m+) general contractor and I think you'd have to be brain dead to\nbuild or buy right now.\n\nHousing is through the roof because money is cheap, but if you think there were\nTP and gas shortages, try to buy land…",
  "original_created_utc": 1622514846,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "住宅市場について、猿たちはどう考えているのか興味があります。私は、ハイエンド（100万ドル以上）のゼネコンで働いています。\n私はハイエンド（100万ドル以上）のゼネコンで働いていますが、今、建設や購入をするには脳死状態にならなければならないと思います。\n建てたり買ったりするのは脳死状態だと思います。\n\nお金が安いから住宅が高騰しているのですが、もしも以前は\nTPやガスが不足していると思ったら、土地を買ってみたり...。",
      "title": "住宅（2007年再び？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "只是好奇猿猴们对住房市场的看法？我为一个\n我为一个高端（100万美元以上）的总承包商工作，我认为你必须是脑残才会在现在建造或购买。\n现在建造或购买。\n\n住房是通过屋顶的，因为钱很便宜，但如果你认为有\n但如果你认为有TP和天然气的短缺，请尝试购买土地......",
      "title": "住房（2007年再次？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "只是好奇猿猴們對住房市場的看法？我爲一個\n我爲一個高端（100萬美元以上）的總承包商工作，我認爲你必須是腦殘纔會在現在建造或購買。\n現在建造或購買。\n\n住房是通過屋頂的，因爲錢很便宜，但如果你認爲有\n但如果你認爲有TP和天然氣的短缺，請嘗試購買土地......",
      "title": "住房（2007年再次？"
    }
  ],
  "title": "Housing (2007 again?)",
  "created_utc": 1622540765,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just curious about what the apes think about the housing market? I work for a high end ($1m+) general contractor and I think you&#39;d have to be brain dead to build or buy right now.</p>\n\n<p>Housing is through the roof because money is cheap, but if you think there were TP and gas shortages, try to buy land right now. Then check insulation prices. Then check lumber. Then check literally everything else. You&#39;re 30% over the 10yr average for same home.</p>\n\n<p>Why are homes flying off the shelf when they shouldn&#39;t be? Talk to anyone you know in construction, we are over balls deep in work and we can&#39;t sustain demand. Housing is in a state of emergency and when this bitch corrects itself it&#39;ll reverberate like it&#39;s 2008.</p>\n\n<p>GME is/was cool and all, but US housing is about to remind the world what real movement looks like.</p>\n</div><!-- SC_ON -->",
  "score": 2647,
  "permalink": "/r/wallstreetbets/comments/npjoel/housing_2007_again/",
  "subreddit": "wallstreetbets",
  "id": "npjoel",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804304078
}