{
  "author": "Invest07723",
  "the_new_excerpt": "Hi! So, I'm new to crypto and I follow the \"don't invest money you can't afford\nto lose\" motto. The challenges of trying to get into crypto are numerous. A few\nexamples of the challenges for a newbie trying to figure this out:\n\n\n\n 1. You need to find an exchange or exchanges to buy crypto. Okay,…",
  "original_created_utc": 1619882854,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは！私は暗号化については初心者で、「失ってはいけないお金は投資しない」というモットーに従っています。\nをモットーにしています。暗号化に参入しようとすると、様々な課題があります。いくつかの\n初心者がこれを理解しようとするときの課題の例。\n\n\n\n 1. 1. 暗号を購入するための取引所を見つける必要があります。そうですね。",
      "title": "暗号は、初心者（特に投資額が少ない人）にとっては簡単ではありません。短期的には、今投資している人の利益が大きくなる可能性があります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨！所以，我是加密货币的新手，我遵循 \"不要投资你无法承受的金钱\n损失 \"的座右铭。试图进入加密货币的挑战是很多的。有几个\n新手尝试弄清楚的挑战的几个例子。\n\n\n\n 1. 你需要找到一个或多个交易所来购买加密货币。好吧，...",
      "title": "对于新手来说，加密货币并不容易（尤其是那些投资金额不大的人）--在短期内，这实际上可能会给现在投资的人带来更大的利润。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨！所以，我是加密貨幣的新手，我遵循 \"不要投資你無法承受的金錢\n損失 \"的座右銘。試圖進入加密貨幣的挑戰是很多的。有幾個\n新手嘗試弄清楚的挑戰的幾個例子。\n\n\n\n 1. 你需要找到一個或多個交易所來購買加密貨幣。好吧，...",
      "title": "對於新手來說，加密貨幣並不容易（尤其是那些投資金額不大的人）--在短期內，這實際上可能會給現在投資的人帶來更大的利潤。"
    }
  ],
  "title": "Crypto is NOT easy for newbies (especially those with modest sums to invest)---in the short-term this may actually result in greater profits for those invested now.",
  "created_utc": 1619897435,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi! So, I&#39;m new to crypto and I follow the &quot;don&#39;t invest money you can&#39;t afford to lose&quot; motto. The challenges of trying to get into crypto are numerous. A few examples of the challenges for a newbie trying to figure this out:</p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>You need to find an exchange or exchanges to buy crypto. Okay, I&#39;ll just sign-up. Sure, just fill out this information, provide your SS#, take a picture of your passport or driver&#39;s license, then upload a picture of your face, and all other personal info we want. Now wait. Maybe we&#39;ll approve you, maybe not. You just sit there and we&#39;ll let you know. Never mind we just took all this personal info from you.</li>\n<li>You are approved on 3 exchanges. Time to buy. Okay, as a new investor with limited funds I will buy $10 worth of coin X. Cool. You now own $9.01 of coin X. We took 99 cents as a fee (ya, that&#39;s ten percent....and wait until you try and transfer or sell). Also, we gave you 24.8574739 of coin X. We took your money for 24.8574739 coins, but we only allow you to sell or transfer whole coins for this particular coin. Welcome to &quot;crypto dust&quot;. Ugh! Okay let&#39;s try exchange number 2. This exchange doesn&#39;t take ACHs so go back to the first exchange and buy some ETH or BTC and then transfer those coins to us. Pay a fee to buy. Pay a fee to transfer (my favorite as a newbie was transferring about $20 of ETH and having it cost about $30 with gas). Then on the new exchange you need to exchange that to USDT because that is all you can use to buy the coin you want. Pay a fee for that. Then use USDT to buy the coin. Another fee. Then move the coin to your own wallet. Fee. Anyhow, in summary, buying coins when your investment money is limited is not easy for newbies. (It doesn&#39;t take long to learn to find places with much better fees and to use coins that are cheaper to transfer).</li>\n<li>Learn the lingo. What the heck is gas? Blockchain. Dust. Seed phrase. Decentralized. NFT. And a zillion others. </li>\n<li>Join reddit and see people talking about how coin Y is great and nobody can believe more people aren&#39;t going to buy coin Y since coin Y is about to do some great stuff and everyone who owns some now is going to make a great profit. This is before the newbie learns that people are constantly talking non-stop about how awesome their coin is to bump the price of their holdings up. Also, the newbie must learn that there are bots and old reddit profiles taken over that are just trying to pump and dump. </li>\n<li>Finally you learn you really need to do your own research. You research coin Z for 10 hours and ICO coin W for 20 hours. Go to buy coin Z. Sorry, we don&#39;t actually sell coin Z to people in your geographic location. Yes, it is on the exchange but when you finally try to buy it, you can&#39;t. Sign up for the ICO for coin W. Sorry, you aren&#39;t allowed to buy coin W because you live in one of the countries where we don&#39;t let people sign up for this ICO.</li>\n<li>Oh by the way, basically nothing is really insured and your crypto can be stolen off exchanges, you can lose your see phrase, your wallet app can be hacked, and there may be no way to get your money back after you lose it.</li>\n<li>Send a ticket to customer service for an issue impacting your money. Wait a week. Wait a month. Wait 2 months. Nothing. Ever.</li>\n<li>Etc. Etc. Etc. This post is long enough, you get the idea. </li>\n</ol>\n\n<p>WHY IS THIS POSSIBLY GOOD FOR US NOW, PROFIT-WISE?</p>\n\n<p>If crypto is going to be adopted by the masses (and there are indicators it will be with recent news from banks offering crypto custody services, PayPal letting you pay with crypto, more retail establishments accepting crypto, some people now being allowed to be paid in crypto, credit card companies getting involved, countries looking at digital currency, etc....) then good coins could potentially see great gains. Eventually, crypto buying for newbies will be way easier and more and more people will buy crypto and more and more people will use crypto for various things from payments to inventory identity and so on. Those of us who are putting up with the challenges listed above and buying crypto are still early to the game. Once it becomes as easy to buy crypto as it is stocks and crypto can be easily insured by exchanges, the real masses will be buying. So for other newbies with limited funds like me, if you were able to get through all the roadblocks you are early. IMO HODL and watch. Blah blah blah I am not a financial advisor and this is all just my opinion blah blah.</p>\n\n<p>tl;dr:  Buying crypto is extremely challenging for new people, especially those without a lot of money to invest. These challenges turn a lot of would be investors away. Soon it is likely it will be a lot LESS challenging for newbies to buy and at that time coin prices could go up a lot! For those putting up with the headaches now, we are in early and might have gotten in at prices we couldn&#39;t have if buying crypto was easier. More potential profit for those in crypto now!</p>\n</div><!-- SC_ON -->",
  "score": 475,
  "permalink": "/r/CryptoCurrency/comments/n2kkgl/crypto_is_not_easy_for_newbies_especially_those/",
  "subreddit": "CryptoCurrency",
  "id": "n2kkgl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380962677
}