{
  "author": "Xyz_8292036",
  "original_created_utc": 1660059680,
  "title": "Should teenagers be allowed to lock their doors?",
  "created_utc": 1660065769,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 14 and my parents are pretty against me locking my door and are convinced that I&amp;#39;m doing smtg bad when im just binging on some music and browsing through reddit. And i think locking doors is just smtg every teenager wants to do&lt;/p&gt;\n\n&lt;p&gt;Edit- to add a few details... My parents don&amp;#39;t knock and they never will... And okay... I&amp;#39;m a teenager and sometimes I feel the need to dance randomly in the room or some other cringey stuff that i cannot mention here... And my parents have walked in on me doing that and they make it even much more awkward by asking questions like\n&amp;quot;What was that?&amp;quot;\n&amp;quot;You okay?&amp;quot;\n&amp;quot;Lmao, this is what you do when you are alone?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Edit 2- yes I have mental health issues too... And yeah I think I have tried SH once or twice too...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 282,
  "permalink": "/r/TooAfraidToAsk/comments/wk6jif/should_teenagers_be_allowed_to_lock_their_doors/",
  "subreddit": "TooAfraidToAsk",
  "id": "wk6jif",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm 14 and my parents are pretty against me locking my door and are convinced\nthat I'm doing smtg bad when im just binging on some music and browsing through\nreddit. And i think locking doors is just smtg every teenager wants to do\n\nEdit- to add a few details... My parents don't knock and they…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は14歳ですが、両親は私がドアをロックすることにかなり反対しており、納得しています。\nを見たり、音楽を聴いたりしているだけなのに、悪いことをしていると思い込んでいます。\nを見たりしています。そして、鍵をかけることは、ティーンエイジャーなら誰でもやりたいと思うことだと思います。\n\n編集......少し詳細を追加すると......。私の両親はノックをしないし、彼らは...",
      "title": "ティーンエイジャーに戸締まりをさせるべきか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我14岁了，我的父母非常反对我锁门，他们认为\n当我只是沉迷于一些音乐和浏览网页时，我正在做一些坏事。\nreddit。我认为锁门是每个青少年都想做的事。\n\n编辑--补充一些细节...... 我的父母不敲门，他们...",
      "title": "是否应该允许青少年锁门？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我14歲了，我的父母非常反對我鎖門，他們認爲\n當我只是沉迷於一些音樂和瀏覽網頁時，我正在做一些壞事。\nreddit。我認爲鎖門是每個青少年都想做的事。\n\n編輯--補充一些細節...... 我的父母不敲門，他們...",
      "title": "是否應該允許青少年鎖門？"
    }
  ]
}