{
  "author": "drinkerx",
  "original_created_utc": 1624966284,
  "title": "I'm sick of being spammed by the same story 15 different ways in my feed",
  "created_utc": 1624995501,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know the mods can only pin 2 posts at a time but I think it would be worth pinning a &quot;Daily News&quot; thread that is pinned below the Daily discussion.</p>\n\n<p>This way we can see all 30 different sources talking about cdc sponsoring an F1 car or some billionaire Mexican banker wanting to accept BTC at his banks in one concise and easy to sort spot.  </p>\n\n<p>It&#39;ll also stop the incentive for folks to spam news that&#39;s already been posted multiple times per day if their post isn&#39;t automatically shot to the top of &quot;NEW&quot;.</p>\n\n<p>/rant</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/oa6elv/im_sick_of_being_spammed_by_the_same_story_15/",
  "subreddit": "CryptoCurrency",
  "id": "oa6elv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know the mods can only pin 2 posts at a time but I think it would be worth\npinning a \"Daily News\" thread that is pinned below the Daily discussion.\n\nThis way we can see all 30 different sources talking about cdc sponsoring an F1\ncar or some billionaire Mexican banker wanting to accept BTC at his…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "MODは一度に2つの記事しかピン留めできないことは知っていますが、私はそれが価値があると思います。\n毎日の議論の下に「毎日のニュース」のスレッドを固定します。\n\nそうすれば、CDCがF1カーのスポンサーになったとか、メキシコの億万長者の銀行家がBIGLOBEを受け入れようとしているとか、30の異なるソースの話を見ることができます。\nメキシコの億万長者の銀行家が自分の銀行でBTCを受け入れようとしているとか。",
      "title": "同じ内容の記事が15回も繰り返し表示されるのはうんざりです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道版主一次只能钉2个帖子，但我认为这值得\n钉一个 \"每日新闻 \"主题，钉在每日讨论的下面。\n\n这样，我们就可以看到30个不同的消息来源在谈论CDC赞助F1赛车或一些亿万富翁墨西哥人。\n或者某个亿万富翁的墨西哥银行家想在他的银行接受BTC。",
      "title": "我已经厌倦了在我的饲料中被同一个故事以15种不同的方式发送垃圾邮件。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道版主一次只能釘2個帖子，但我認爲這值得\n釘一個 \"每日新聞 \"主題，釘在每日討論的下面。\n\n這樣，我們就可以看到30個不同的消息來源在談論CDC贊助F1賽車或一些億萬富翁墨西哥人。\n或者某個億萬富翁的墨西哥銀行家想在他的銀行接受BTC。",
      "title": "我已經厭倦了在我的飼料中被同一個故事以15種不同的方式發送垃圾郵件。"
    }
  ]
}