{
  "author": "Shiller_Killer",
  "original_created_utc": 1648524997,
  "title": "1.2 Million Dollars Stolen From New Swap and Saitama Devs Are Covering it Up",
  "created_utc": 1648557610,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The team behind Saitama token recently released a swap, Saitamask, and have just launched a new token, SaitaRealty, exclusive to their swap. They launched the token this past Friday and were supposed to set a low max buy limit but somehow mess this up, allowing some investors to purchase more than almost 100x than they should have. Once the devs caught their mistake they reset the buy limit and announced that they would blacklist the wallets that were able to purchase the larger amounts.&lt;/p&gt;\n\n&lt;p&gt;One of the persons who got blacklisted found an exploit with Saitamask and drained all of the liquidity out of the SaitaRealty LP. He bragged about it on Twitter and got away with at least $1.2 million that investors put into the new project. He did so without touching the SaitaReality he bought with the blacklisted wallet. No one that bought SaitaRealty can cash out now as there is 0 liquidity left. &lt;/p&gt;\n\n&lt;p&gt;Somehow the thief was able to trick Saitamask into swapping ETH for 10x the amount of Saitama he should have received and then swap that for SaitaRealty all in one transaction. He then Swapped back the SaitaRealty for Saitama, cashed that out to ETH, and transferred the ETH to another wallet to tumble.&lt;/p&gt;\n\n&lt;p&gt;Here is a screenshot of the instant 10X he was able to trick the Saitamask router into doing:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/4svyvi2jq8q81.png?width=1798&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=d0d95aaa033bc2dd0a043f0fae9f36d442155c5d\"&gt;https://preview.redd.it/4svyvi2jq8q81.png?width=1798&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=d0d95aaa033bc2dd0a043f0fae9f36d442155c5d&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;You can see one of his transactions here:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://etherscan.io/tx/0x18bd50dc00ef034bcf28480e8744e8af4150155353846fb8fe36d7af56071139\"&gt;https://etherscan.io/tx/0x18bd50dc00ef034bcf28480e8744e8af4150155353846fb8fe36d7af56071139&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Here is the wallet he did the exploit with if you want to see how it all went down:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://etherscan.io/address/0xad0c834315abfa7a800bbbb5d776a0b07b672614\"&gt;https://etherscan.io/address/0xad0c834315abfa7a800bbbb5d776a0b07b672614&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Here is the wallet he used to tumble the stolen funds with.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://etherscan.io/address/0x63493e679155c2f0aad5bf96d65725ad6427fac4\"&gt;https://etherscan.io/address/0x63493e679155c2f0aad5bf96d65725ad6427fac4&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The thief deleted his Twitter account but here is a screenshot of a post he made about what he did. Note that PeckShield Inc. from his quote tweet is a crypto-security company that tried to alert the team about what was happening. The Saitama team did not realize what was happing until all the money was gone, even though security experts tried to warn them.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/k4gih0nar8q81.png?width=464&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=6b9c92d61d17f6ced8c898b7438fd7a2195dfb8d\"&gt;https://preview.redd.it/k4gih0nar8q81.png?width=464&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=6b9c92d61d17f6ced8c898b7438fd7a2195dfb8d&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The Saitama devs hosted a Twitter space the next day and claimed that the thief was running arbitrage through Uniswap. This is not what happed and anyone who can understand transactions on Ethescan can clearly see that their claim is false. The instant 10x exploit happed directly and fully through the Saitamask router.  All of these transactions happened fully within Saitamask contracts as you can see in the transaction above. &lt;/p&gt;\n\n&lt;p&gt;The devs know all of this and are covering it up. The fact that the devs are sweeping this under the rug and have kept the swap open seems criminal to me. &lt;/p&gt;\n\n&lt;p&gt;Here you can see the liquidity is completely gone and investors are currently unable cash out:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/lz1zfwpfr8q81.png?width=2830&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=73bc18e2d3c178f37950834f21d3de9f381c2d6b\"&gt;https://preview.redd.it/lz1zfwpfr8q81.png?width=2830&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=73bc18e2d3c178f37950834f21d3de9f381c2d6b&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;If you got this far how do you think the devs should have handled this? While all of this was going on the devs were actively encourage Saitama holders to take part in a listing competition with OKX, and they will now be listed there.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 339,
  "permalink": "/r/CryptoCurrency/comments/tqqto4/12_million_dollars_stolen_from_new_swap_and/",
  "subreddit": "CryptoCurrency",
  "id": "tqqto4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The team behind Saitama token recently released a swap, Saitamask, and have just\nlaunched a new token, SaitaRealty, exclusive to their swap. They launched the\ntoken this past Friday and were supposed to set a low max buy limit but somehow\nmess this up, allowing some investors to purchase more than…"
}