{
  "author": "Fakin_Bacon",
  "original_created_utc": 1637093694,
  "title": "People who left jobs this past year as part of “the great resignation”, how are you surviving?",
  "created_utc": 1637116158,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like, I keep hearing that people left their jobs and are no longer working. How are you paying bills? Are you on unemployment benefits? Participating in the gig economy (Uber, rover, door dash, etc.)? Like, I don’t like working but I need to keep my job or I will literally go hungry. I don’t mean to sound judgmental, Im just so curious how so many people can just quit their jobs and survive for months on end.</p>\n</div><!-- SC_ON -->",
  "score": 149,
  "permalink": "/r/TooAfraidToAsk/comments/qvgykk/people_who_left_jobs_this_past_year_as_part_of/",
  "subreddit": "TooAfraidToAsk",
  "id": "qvgykk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Like, I keep hearing that people left their jobs and are no longer working. How\nare you paying bills? Are you on unemployment benefits? Participating in the gig\neconomy (Uber, rover, door dash, etc.)? Like, I don’t like working but I need to\nkeep my job or I will literally go hungry. I don’t mean to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、仕事を辞めて働かなくなった人の話をよく聞きます。どのように\n支払いはどうしていますか？失業手当をもらっていますか？ギグ・エコノミーに参加している\nギグエコノミー（Uber、rover、door dashなど）に参加していますか？働きたくはないが、仕事を続けなければ\n仕事を続けないと文字通り飢えてしまう。そんなつもりはありませんが...。",
      "title": "この1年、「大辞泉」で仕事を辞めた人たちは、どうやって生き延びているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比如，我一直听说有人离开了工作岗位，不再工作了。你是如何\n你是如何支付账单的？你在领取失业救济金吗？参加了临时工\n经济（Uber, rover, door dash, etc.）？比如，我不喜欢工作，但我需要\n保住我的工作，否则我真的会饿死。我并不是说...",
      "title": "去年作为 \"伟大的辞职 \"的一部分而离开工作岗位的人们，你们是如何生存的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比如，我一直聽說有人離開了工作崗位，不再工作了。你是如何\n你是如何支付賬單的？你在領取失業救濟金嗎？參加了臨時工\n經濟（Uber, rover, door dash, etc.）？比如，我不喜歡工作，但我需要\n保住我的工作，否則我真的會餓死。我並不是說...",
      "title": "去年作爲 \"偉大的辭職 \"的一部分而離開工作崗位的人們，你們是如何生存的？"
    }
  ]
}