{
  "author": "WitnessAppropriate",
  "original_created_utc": 1639146410,
  "title": "We're in a bull market. Oh wait, bear market. Nevermind, bull market.",
  "created_utc": 1639158087,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This sentiment here has been so volatile that a day literally feels like this&lt;/p&gt;\n\n&lt;p&gt;08:00 AM - Hey guys, just wanted to let everyone know that due to the US Inflation number&amp;#39;s, we&amp;#39;re officially in the bull market.&lt;br/&gt;\n09:00 AM - Oh wait, Evergrande defaulted. Crypto and Stocks are skydiving. Clearly the start of a 3 year bear market.&lt;/p&gt;\n\n&lt;p&gt;10:00 AM - Nevermind! It&amp;#39;s all good now! BTC broke the *insert random parameter which no one actually knows which here, because let&amp;#39;s face it, no one knows sh-t about f-ck* resistance and now it&amp;#39;s on a clear run for 969.420k. Welcome bull market and may the alts season begin:&lt;/p&gt;\n\n&lt;p&gt;11:00 AM - Uh-oh. Did you hear the news? Apparently an exchange we haven&amp;#39;t even heard before is now hacked! Bad news for crypto. Crypto winter imminent.&lt;/p&gt;\n\n&lt;p&gt;12:00 PM - Time to invest in crypto - by buying lunch with my CRO card. Bullish on CRO.&lt;/p&gt;\n\n&lt;p&gt;1:00 PM - Oh my god can China and India please not ban crypto and drop the market literally every other week? Here comes the bear market again&lt;/p&gt;\n\n&lt;p&gt;2:00 PM - Okay, I&amp;#39;ll just buy the dip right? If we zoom out the charts, we&amp;#39;re in a bull run and the market will bounce back. This is the easiest money I&amp;#39;ve ever made&lt;/p&gt;\n\n&lt;p&gt;3:00 PM - Why is the dip dipping more&lt;/p&gt;\n\n&lt;p&gt;4:00 PM - WHY IS THIS EVEN HAPPENING&lt;/p&gt;\n\n&lt;p&gt;5:00 PM - Yeah I was stupid enough to buy that &amp;quot;dip&amp;quot;, but at least I wasn&amp;#39;t stupid enough to predict 98k BTC in November 2021 lol&lt;/p&gt;\n\n&lt;p&gt;6:00 PM - Time to do my weekly research and buy some more tokens... Ofc this research won&amp;#39;t even matter since I&amp;#39;ll end up losing money anyways, everything has just been red all week. But at least I can pretend I know what I&amp;#39;m doing.&lt;/p&gt;\n\n&lt;p&gt;7:00 PM - Ramen&amp;#39;s for dinners, boys! ...and the other four girls in this subreddit.&lt;/p&gt;\n\n&lt;p&gt;8:00 PM - I didn&amp;#39;t even knew Evergrande could default twice in a day, but apparently so. And the charts are down AGAIN.&lt;/p&gt;\n\n&lt;p&gt;9:00 PM - Look, grandpa BTC did a lil pump since El Salvador bought the dip and now everyone is having a great time. I mean, there has to be a reason why the country is literally called &amp;quot;the saviour&amp;quot; and I&amp;#39;m pretty sure it that they are always saving our crypto. Everything is green right now and damn, I wish I had bought more this afternoon. Bull mode on&lt;/p&gt;\n\n&lt;p&gt;10:00 PM - I really need to go to sleep but I&amp;#39;ll check the charts and Reddit one more time&lt;/p&gt;\n\n&lt;p&gt;11:00 PM - Another time&lt;/p&gt;\n\n&lt;p&gt;12:00 AM - And another time&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 355,
  "permalink": "/r/CryptoCurrency/comments/rd9t78/were_in_a_bull_market_oh_wait_bear_market/",
  "subreddit": "CryptoCurrency",
  "id": "rd9t78",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This sentiment here has been so volatile that a day literally feels like this\n\n08:00 AM - Hey guys, just wanted to let everyone know that due to the US\nInflation number's, we're officially in the bull market.\n09:00 AM - Oh wait, Evergrande defaulted. Crypto and Stocks are skydiving.\nClearly the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こちらの心情は、文字通り一日がこんな風に感じられるほど不安定なものでした。\n\n08:00 AM - 皆さんにお知らせしたいことがあります。\nインフレ率の数値は、私たちは正式に強気市場にいる。\n09:00 AM - 待ってくれ、Evergrandeがデフォルトしたんだ。暗号と株式は急降下している。\n明らかに...",
      "title": "ブル・マーケットの中にいます。待てよ、ベアマーケットだ。気にしないで、強気の市場。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这里的情绪一直很不稳定，一天下来简直就是这样的感觉\n\n08:00 AM - 嘿，伙计们，只是想让大家知道，由于美国的\n通货膨胀的数字，我们正式进入牛市。\n09:00 AM - 哦，等等，恒大违约了。加密货币和股票正在跳水。\n很明显，...",
      "title": "我们正处在一个牛市。哦，等等，熊市。算了吧，牛市。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏的情緒一直很不穩定，一天下來簡直就是這樣的感覺\n\n08:00 AM - 嘿，夥計們，只是想讓大家知道，由於美國的\n通貨膨脹的數字，我們正式進入牛市。\n09:00 AM - 哦，等等，恆大違約了。加密貨幣和股票正在跳水。\n很明顯，...",
      "title": "我們正處在一個牛市。哦，等等，熊市。算了吧，牛市。"
    }
  ]
}