{
  "author": "Rican2153",
  "original_created_utc": 1640294390,
  "title": "How exactly do you guys take profits?",
  "created_utc": 1640328387,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This isn’t satire I swear. Do you guys move your profits into a stablecoin or straight into your bank accounts? Do you move strictly profits and leave what you came in at, or do you take everything and wait to re enter? Do you move profits from smaller coins into ETH and BTC? Do you just hodl for long term despite profits? Or does it depend on the coin? Are you like me and haven’t been in any real profit to even think about it? I got in about 3 weeks ago and I am about even right now after the dip, right after I yeeted some of my savings into crypto.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 171,
  "permalink": "/r/CryptoCurrency/comments/rn5ngw/how_exactly_do_you_guys_take_profits/",
  "subreddit": "CryptoCurrency",
  "id": "rn5ngw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This isn’t satire I swear. Do you guys move your profits into a stablecoin or\nstraight into your bank accounts? Do you move strictly profits and leave what\nyou came in at, or do you take everything and wait to re enter? Do you move\nprofits from smaller coins into ETH and BTC? Do you just hodl for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは風刺ではない......本当だ 皆さんは利益を安定したコインに移しますか それとも\n銀行口座に直接入れますか？厳密に利益を移動して、何を残すか？\nそれとも全部持っていって再入力するのを待ちますか？それとも\n小さいコインからETHやBTCに利益を移しますか？あなたは、ただホドホドに...",
      "title": "皆さんは具体的にどのように利益を取っているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这不是讽刺，我发誓。你们是将利润转移到稳定币还是\n直接进入你们的银行账户？你们是严格地转移利润并留下\n你进来的时候，还是把所有的钱都拿走，然后等待重新进入？你是否将\n小币的利润转移到ETH和BTC中？你是否只是为自己的利益而工作？",
      "title": "你们到底是如何获利的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這不是諷刺，我發誓。你們是將利潤轉移到穩定幣還是\n直接進入你們的銀行賬戶？你們是嚴格地轉移利潤並留下\n你進來的時候，還是把所有的錢都拿走，然後等待重新進入？你是否將\n小幣的利潤轉移到ETH和BTC中？你是否只是爲自己的利益而工作？",
      "title": "你們到底是如何獲利的？"
    }
  ]
}