{
  "author": "SoonMoonn",
  "original_created_utc": 1637438061,
  "title": "Got a message from my Bank advising me to not buy crypto. WTF? Why are you concerned about me buying crypto but not concerned about people losing money gambling.",
  "created_utc": 1637455200,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve heard people getting there banks blocked / not allowing them to buy crypto anymore, so compared to that my situation is nothing but it’s still something.</p>\n\n<p>I’ve never heard banks advising people to not buy stocks, then what’s different with crypto?</p>\n\n<p>People are out there losing money gambling but they never bat an eye, now suddenly people are gaining profits buying crypto and they’re concerned? </p>\n\n<p>This makes me even more bullish on crypto, if banks are afraid, they’re scared they’ll lose their dominance soon. </p>\n\n<p>Have you ever gotten a message from your bank regarding crypto?</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/qydcdt/got_a_message_from_my_bank_advising_me_to_not_buy/",
  "subreddit": "CryptoCurrency",
  "id": "qydcdt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve heard people getting there banks blocked / not allowing them to buy crypto\nanymore, so compared to that my situation is nothing but it’s still something.\n\nI’ve never heard banks advising people to not buy stocks, then what’s different\nwith crypto?\n\nPeople are out there losing money gambling but…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "銀行がブロックされたり、暗号を買えなくなったりした人がいると聞きました。\nそれに比べれば、私の状況は大したことはありませんが、それでも何かしらの問題があります。\n\n銀行が株を買わないように忠告しているのを聞いたことがありませんが、では何が違うのでしょうか？\n暗号と何が違うのでしょうか？\n\n人々はギャンブルでお金を失っていますが...。",
      "title": "銀行から、暗号を買わないようにというメッセージが届きました。驚きました。なぜ、私が暗号を買うことには関心があるのに、ギャンブルでお金を失う人には関心がないのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我听说人们的银行被封锁/不允许他们购买加密货币\n因此，与此相比，我的情况不算什么，但还是有的。\n\n我从来没有听说过银行建议人们不要购买股票，那么加密货币有什么不同呢？\n那么加密货币有什么不同呢？\n\n人们在外面赌博输钱，但...",
      "title": "从我的银行收到一条信息，建议我不要购买加密货币。什么意思？为什么你关心我购买加密货币，却不关心人们赌博输钱。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我聽說人們的銀行被封鎖/不允許他們購買加密貨幣\n因此，與此相比，我的情況不算什麼，但還是有的。\n\n我從來沒有聽說過銀行建議人們不要購買股票，那麼加密貨幣有什麼不同呢？\n那麼加密貨幣有什麼不同呢？\n\n人們在外面賭博輸錢，但...",
      "title": "從我的銀行收到一條信息，建議我不要購買加密貨幣。什麼意思？爲什麼你關心我購買加密貨幣，卻不關心人們賭博輸錢。"
    }
  ]
}