{
  "author": "apooroldinvestor",
  "the_new_excerpt": "What makes me sort of chuckle is on red days when people sell off in say the\nNasdaq and move their money into cyclical stocks because of some bad news and\nthen on the next day move it back to the Nasdaq!\n\nI could never understand what's going on here. So today jobless claims were\nhigher than…",
  "original_created_utc": 1616100087,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "是什么让我有点笑的是在红色的日子里，当人们卖掉在说的。\n纳斯达克，并将他们的资金转移到周期性股票，因为一些坏消息和。\n然后在第二天把它搬回纳斯达克！\n\n我一直不明白这是怎么回事。所以今天的失业申请是\n高过",
      "title": "你在卖出，别人在买入--股市真傻"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是什麼讓我有點笑的是在紅色的日子裏，當人們賣掉在說的。\n納斯達克，並將他們的資金轉移到週期性股票，因爲一些壞消息和。\n然後在第二天把它搬回納斯達克！\n\n我一直不明白這是怎麼回事。所以今天的失業申請是\n高過",
      "title": "你在賣出，別人在買入--股市真傻"
    }
  ],
  "title": "You're selling and someone else is buying - The stock market is silly",
  "created_utc": 1616110546,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What makes me sort of chuckle is on red days when people sell off in say the Nasdaq and move their money into cyclical stocks because of some bad news and then on the next day move it back to the Nasdaq!</p>\n\n<p>I could never understand what&#39;s going on here.  So today jobless claims were higher than expected, so the Nasdaq sells off and people put their money in the &#39;re-opening&quot; stocks.  WHY?!  Then the next day or two or week everything reverses!</p>\n\n<p>It&#39;s like musical chairs or something.  What the hecks the point?!  Also what makes it really stupid is that when someone is selling because of bad news someone else is buying the same bad news!</p>\n\n<p>So people are selling because they think BECAUSE of bad news their stocks will go down and so consequently those same sellers are all driving the price down by selling!  Makes a lot of sense! </p>\n\n<p>So everyone panics and sells because they think everyone else is going to panic and sell and so everyone sells.  </p>\n\n<p>And the funniest part is that a few days later everyone buys right back in again!  Talk about dumb!</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/stocks/comments/m806na/youre_selling_and_someone_else_is_buying_the/",
  "subreddit": "stocks",
  "id": "m806na",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752819549
}