{
  "author": "prettyboyv",
  "the_new_excerpt": "First of all let's take a look at PLTR's Q1 financial performance.\n\n * Total revenue grew 49% year-over-year to $341 million\n * US commercial revenue grew 72% year-over-year\n * US government revenue grew 83% year-over-year\n * Cash flow from operations of $117 million, up $404 million year-over…",
  "original_created_utc": 1620743617,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず最初に、PLTRの第1四半期の財務状況を見てみましょう。\n\n * 総売上高は前年同期比49％増の3億4,100万ドル\n * 米国におけるコマーシャル収入は前年同期比72％増\n * 米国政府機関の収益は前年同期比83％増\n * 営業活動によるキャッシュ・フローは、前年同期比404百万ドル増の117百万ドルとなりました。",
      "title": "Palantir (PLTR)のファンダメンタルズはさらに良くなった（経営陣は「我々はスカイネットになるまであと数歩だ」と述べている）。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先让我们来看看PLTR第一季度的财务表现。\n\n *总收入同比增长49%，达到3.41亿美元\n * 美国商业收入同比增长72%。\n * 美国政府收入同比增长83%。\n * 来自运营的现金流为1.17亿美元，同比增长4.04亿美元...",
      "title": "Palantir（PLTR）的基本面刚刚变得更好（正如管理层所说：\"我们离成为天网只有几步之遥\"）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先讓我們來看看PLTR第一季度的財務表現。\n\n *總收入同比增長49%，達到3.41億美元\n * 美國商業收入同比增長72%。\n * 美國政府收入同比增長83%。\n * 來自運營的現金流爲1.17億美元，同比增長4.04億美元...",
      "title": "Palantir（PLTR）的基本面剛剛變得更好（正如管理層所說：\"我們離成爲天網只有幾步之遙\"）。"
    }
  ],
  "title": "Palantir's (PLTR) fundamentals just became even better ( As management said: \"We are a few steps away from becoming Skynet\")",
  "created_utc": 1620798853,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First of all let&#39;s take a look at PLTR&#39;s Q1 financial performance.</p>\n\n<ul>\n<li>Total revenue grew 49% year-over-year to $341 million</li>\n<li>US commercial revenue grew 72% year-over-year</li>\n<li>US government revenue grew 83% year-over-year</li>\n<li>Cash flow from operations of $117 million, up $404 million year-over-year, and representing a 34% margin</li>\n<li>Adjusted free cash flow of $151 million, up $441 million year-over-year, and representing a 44% margin</li>\n<li>GAAP net loss per share, diluted of $(0.07)</li>\n<li>Adjusted earnings per share, diluted of $0.04</li>\n<li>Cash and cash equivalents- 2.3 billion</li>\n<li>The company managed to pay almost all of its outstanding long-term debt</li>\n</ul>\n\n<p>These numbers look amazing,especially when you take into account the fact that as the management stated numerous times on the earnings call, the company is just starting to expand and acquire new customers. Many people think of Palantir as this old, mature company that is still unprofitable and with limited growth opportunities. The thing is that despite being 17 years old, Palantir is just starting to get recognition on the world stage. They spent years just developing their software and investing heavily into R and D( over 2 billion dollars). Foundry was launched in 2018 and already is experiencing very high-levels of adoption despite the fact that it is a very complex and expensive software( It is way easier to grow your revenue and acquire new customers on a quarter basis when you are selling cheap and rather simple software solutions, not a complete OS for businesses) . PLTR is also just starting to build a proper sales team ( more than 50 new salespeople hired in this quarter alone) and partnering with organizations like IBM that can pinch their soft. to potential customers. The only slightly negative thing is the fact that currently their european commercial business growth is lacking behind the U.S one, but it is mostly because european economic recovery from the Covid pandemic is way slower. They still managed to close some deals and on the earnings call announcead a new client in Peugeot. Also the Covid crisis definitely helped PLTR in a way, but this does not mean that we should expect a slower growth rate in the future, but qute the opposite. For example, video game manufacturers experienced huge growth during the pandemic, because people stayed at home and had nothing better to do, but that would not be the case in the future. On the other hand, the pandemic helped companies to realise how important is for them to be able to make sense of their large databases of unfiltered information and make better-informed decisions to protect their operations from future geopolitical or macro-economic events.</p>\n\n<p>Palantir is also well positioned to increase their revenue significantly in the government sector, due to the fact that their Gotham software proved its worth throughout the years and they just started their AI based Appolo software.( The Biden admin will apparently invest billions in AI technologies in the coming years).</p>\n\n<p>I would not dive deep into other financial metrics, cuz this DD will become too large, but their margins are insane, cost of revenue grew way,way less than actual revenue, adjusted free cash flow is now positive( insane growth also, wink, wink to all analyst who use DCF) and PLTR somehow managed to expand its business operations while at the same time increasing their cash at hand and having almost non-existent debt.</p>\n\n<p>Let&#39;s adress some retail investors worries now. WSB and r/ PLTR are constantly complaining about the high amounts of SBC the employees receive. They of course talked about this on the earnings call and the CFO said that the SBC will normalise in the future( very common for growth companies), but they will still give SBC to employess to align their personal interest with interest of the company ( also very common, especially for soft.companies) and to have more cash for expansion and future investments. Also, they said that Alex Karp is selling shares for tax purposes and he plans to continue being one of the biggest shareholders in the future.</p>\n\n<p>A lot of people also complain about the fact that &quot;the management does not believe in the company, Karp told me to sell my shares&quot;. The truth is that their believe is actually a bit cult-like. Management again stated that they are convinced of the fact that PLTR will become the most important software company in the future and they even literally said that they are a &quot; few steps away form becoming Skynet&quot;. Furthermore, they invested in Lillium and Sarcos robotics, cuz they think that it is an incredible opportunity for an innovative startup to use Foundry from ground-zero and not waste years of its development having to deal with data silos and so on. When talking specifically about Sarcos, they said that their are vision for Foundry is to become a digital &quot;IronMan suit&quot; and Sarcos is trying to build a physical &quot;IronMan&quot; suit and they want to combine their efforts. Yes, that is right. Management thinks that their software is so good, that instead of just selling it to other companies, they can just invest in startups, give their soft for free and reap even bigger rewards in the future.</p>\n\n<p>Another interesting thing we learned from the conference call is that PLTR accepts (the currency that rhymes with groin) as a form of payment. Investing in PLTR is giving you some indirect exposure to the &quot;forbidden word&quot; market.</p>\n\n<p>In conclusion, I want to say that my personal opinion is that PLTR&#39;s fundamentals actually became better and as Jeff Bezos said the stock price does not always reflect the state of the company correctly. If you did not FOMO into PLTR expecting it to moon immediatly it is probably better to just wait and stick to your conviction that the company&#39;s financials will justify its generous valuation in the coming years.</p>\n</div><!-- SC_ON -->",
  "score": 1171,
  "permalink": "/r/wallstreetbets/comments/n9ydod/palantirs_pltr_fundamentals_just_became_even/",
  "subreddit": "wallstreetbets",
  "id": "n9ydod",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620986000156
}