{
  "author": "fenderduosonic",
  "the_new_excerpt": "of course, Khrushchev was actually overthrown in a well-coordinated bloodless\ncoup that brought Leonid Brezhnev and Alexei Kosygin to power as First Secretary\nand Premier, respectively. but how widely was this power struggle and others\nlike it known to the public? was it more or less an open secret…",
  "original_created_utc": 1619459151,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もちろん、フルシチョフは実際には、よく調整された無血のクーデターによって倒された。\nその結果、レオニード・ブレジネフが第一書記に、アレクセイ・コシギンが首相に就任したのである。\nしかし、この権力闘争やその他の権力闘争は、一般にどの程度知られていたのでしょうか？\nしかし、この権力闘争などは一般にどの程度知られていたのだろうか？ 多少なりとも公然の秘密だったのだろうか？",
      "title": "私は1964年10月14日の朝、プラウダを読んでいるソビエトの労働者である。一面の見出しには、ニキータ・フルシチョフが老齢と健康上の理由で辞任したと書かれている。総書記の失脚の真相を知ることは、私にとってどれほど難しいことだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当然，赫鲁晓夫实际上是在一次精心协调的不流血政变中被推翻的。\n政变，使列昂尼德-勃列日涅夫和阿列克谢-柯西金上台，分别担任第一书记和总理。\n但这场权力斗争和其他类似的权力斗争在公众中的知晓率有多高？\n它是否是一个公开的秘密...？",
      "title": "我是一名苏联工人，在1964年10月14日上午阅读《真理报》。头版头条说，尼基塔-赫鲁晓夫由于年老和健康问题已经辞职。对我来说，要了解总书记下台的真实情况有多难？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當然，赫魯曉夫實際上是在一次精心協調的不流血政變中被推翻的。\n政變，使列昂尼德-勃列日涅夫和阿列克謝-柯西金上臺，分別擔任第一書記和總理。\n但這場權力鬥爭和其他類似的權力鬥爭在公衆中的知曉率有多高？\n它是否是一個公開的祕密...？",
      "title": "我是一名蘇聯工人，在1964年10月14日上午閱讀《真理報》。頭版頭條說，尼基塔-赫魯曉夫由於年老和健康問題已經辭職。對我來說，要了解總書記下臺的真實情況有多難？"
    }
  ],
  "title": "I’m a Soviet worker reading Pravda on the morning of October 14, 1964. The front page headline states that Nikita Khrushchev has resigned due to old age and health concerns. How hard would it be for me to learn the true nature of the General Secretary’s fall from power?",
  "created_utc": 1619486269,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>of course, Khrushchev was actually overthrown in a well-coordinated bloodless coup that brought Leonid Brezhnev and Alexei Kosygin to power as First Secretary and Premier, respectively. but how widely was this power struggle and others like it known to the public?  was it more or less an open secret that Khrushchev had been ousted? was it the type of thing that you could figure out by reading between the lines in certain publications? or was it a genuine secret that was kept from the public until the glasnost reforms? conversely, am I completely overestimating the level of secrecy at this time: was the plot to overthrow Khrushchev openly talked about in the press after its success?</p>\n</div><!-- SC_ON -->",
  "score": 145,
  "permalink": "/r/AskHistorians/comments/mz3f2r/im_a_soviet_worker_reading_pravda_on_the_morning/",
  "subreddit": "AskHistorians",
  "id": "mz3f2r",
  "is_self": true,
  "media": null,
  "is_video": false
}