{
  "author": "trowawa33",
  "original_created_utc": 1644242663,
  "title": "Why make historical movies about white ppl with black actors when there are African historical narratives yet to be explored?",
  "created_utc": 1644260130,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Im referring specifically to the Anne Boleyn program staring black actors. It doesn’t necessarily offend me but it seems kinda stupid and unnecessary if the goal is empowering black content. &lt;/p&gt;\n\n&lt;p&gt;From the empires of Ghana, Axum, Mali, Songhai, etc, there were so many Black medieval cultures and stories that it seems silly to rehash European history with black people just to make a statement. Moreover, i think it would do the world wonders to broadcast stories about black history; so many people are ignorant to all of these societies, why bother talking about yet another European monarch?&lt;/p&gt;\n\n&lt;p&gt;And finally, we all admit it would NOT be ok to have black history content played by white people, can you imagine if Nelson Mandela’s story was broadcast and Mandela was played by Willem Defoe? Or if MLK was played by Kevin James? It makes no sense.&lt;/p&gt;\n\n&lt;p&gt;TL;DR - why is it socially progressive to have black actors play in historical drama about white/ European society? Especially when there is a severe lack of content about ancient black/African history. Not trying to gatekeeper, i have no moral reservations, it just seems like a missed opportunity for needless controversy.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/smr0be/why_make_historical_movies_about_white_ppl_with/",
  "subreddit": "TooAfraidToAsk",
  "id": "smr0be",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Im referring specifically to the Anne Boleyn program staring black actors. It\ndoesn’t necessarily offend me but it seems kinda stupid and unnecessary if the\ngoal is empowering black content.\n\nFrom the empires of Ghana, Axum, Mali, Songhai, etc, there were so many Black\nmedieval cultures and stories…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "具体的には、黒人俳優を起用した「アン・ブーリン」プログラムについてです。これは\n私は必ずしも不快には感じないのですが、もしそうであるなら、それはちょっと愚かで不必要なことのように思えます。\n黒人のコンテンツに力を与えることが目的です。\n\nガーナ、アクスム、マリ、ソンガイなどの帝国には、多くの黒人が存在しました。\n中世の文化や物語を...",
      "title": "アフリカの歴史的な物語がまだ探求されていないのに、なぜ黒人の俳優を使って白人の歴史映画を作るのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我特别指的是由黑人演员主演的《安妮-波林》节目。它\n这不一定冒犯了我，但如果目的是增强黑人的能力，这似乎有点愚蠢，而且没有必要。\n目标是赋予黑人内容。\n\n从加纳、阿克苏姆、马里、桑海等帝国，有那么多的黑人\n中世纪的文化和故事...",
      "title": "为什么要用黑人演员拍摄关于白人的历史电影，而非洲的历史叙事还有待探索？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我特別指的是由黑人演員主演的《安妮-波林》節目。它\n這不一定冒犯了我，但如果目的是增強黑人的能力，這似乎有點愚蠢，而且沒有必要。\n目標是賦予黑人內容。\n\n從加納、阿克蘇姆、馬裏、桑海等帝國，有那麼多的黑人\n中世紀的文化和故事...",
      "title": "爲什麼要用黑人演員拍攝關於白人的歷史電影，而非洲的歷史敘事還有待探索？"
    }
  ]
}