{
  "author": "trowawa33",
  "original_created_utc": 1644242663,
  "title": "Why make historical movies about white ppl with black actors when there are African historical narratives yet to be explored?",
  "created_utc": 1644260130,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Im referring specifically to the Anne Boleyn program staring black actors. It doesn’t necessarily offend me but it seems kinda stupid and unnecessary if the goal is empowering black content. &lt;/p&gt;\n\n&lt;p&gt;From the empires of Ghana, Axum, Mali, Songhai, etc, there were so many Black medieval cultures and stories that it seems silly to rehash European history with black people just to make a statement. Moreover, i think it would do the world wonders to broadcast stories about black history; so many people are ignorant to all of these societies, why bother talking about yet another European monarch?&lt;/p&gt;\n\n&lt;p&gt;And finally, we all admit it would NOT be ok to have black history content played by white people, can you imagine if Nelson Mandela’s story was broadcast and Mandela was played by Willem Defoe? Or if MLK was played by Kevin James? It makes no sense.&lt;/p&gt;\n\n&lt;p&gt;TL;DR - why is it socially progressive to have black actors play in historical drama about white/ European society? Especially when there is a severe lack of content about ancient black/African history. Not trying to gatekeeper, i have no moral reservations, it just seems like a missed opportunity for needless controversy.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/smr0be/why_make_historical_movies_about_white_ppl_with/",
  "subreddit": "TooAfraidToAsk",
  "id": "smr0be",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Im referring specifically to the Anne Boleyn program staring black actors. It\ndoesn’t necessarily offend me but it seems kinda stupid and unnecessary if the\ngoal is empowering black content.\n\nFrom the empires of Ghana, Axum, Mali, Songhai, etc, there were so many Black\nmedieval cultures and stories…"
}