{
  "author": "historiagrephour",
  "original_created_utc": 1634637623,
  "title": "MEGATHREAD | Day One of the AskHistorians 2021 Digital Conference | \"[Deleted] & Missing History: Reconstructing the Past, Confronting Distortions\"",
  "created_utc": 1634650241,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After eight months of planning, recording, editing, and polishing, the AskHistorians 2021 Digital Conference is finally here! On behalf of its organizing committee, <a href=\"https://youtu.be/xA-ldDJPbWs\">welcome</a> to this year&#39;s event.</p>\n\n<p>In 2020, we hosted our first digital conference right here on reddit, and made history by doing so. This year, reddit is officially sponsoring the AskHistorians Digital Conference. Their generosity, as well as the generosity of our Fundrazr contributors has allowed us to make our entire conference free and accessible to anyone with an internet connection and a computer, tablet, or mobile device.</p>\n\n<p>We are thrilled to be able to share this conference with you all over the next three days.</p>\n\n<p>If you are interested in the history of the AskHistorians conference, its background, rationale, and the details of this year&#39;s event (including information about the participants, papers, and panels), please check out our <a href=\"https://www.yumpu.com/en/document/read/65910401/ahdc-2021-program\">conference program</a>, designed by yours truly.</p>\n\n<p>If you&#39;d like to check out some of last year&#39;s panels before diving into this year&#39;s offerings, you can find those on our <a href=\"https://www.youtube.com/watch?v=EBoeW5OoXmg&amp;list=PLgMy8FV2sLlWLVRdxil9pEleJDu7OlQD2\">YouTube channel</a>.</p>\n\n<p>Otherwise, keep reading to learn more about today&#39;s offerings!</p>\n\n<p>This thread contains an overview of today&#39;s events, with direct links added as soon as they go live, and an explanation of how to get involved. If you have any questions, leave them below and we&#39;ll address them as soon as possible.</p>\n\n<h1>Today&#39;s Schedule</h1>\n\n<p><strong>Keynote Address (11 AM EDT):</strong> <a href=\"https://www.askhistorians.com/2021-keynote\">&quot;Ned Christie and the Consequences of Fake News&quot;</a> by Dr. Devon Mihesuah of the University of Kansas</p>\n\n<ul>\n<li>Register for the live Zoom event <a href=\"https://us02web.zoom.us/webinar/register/6516340505394/WN_cNNfK79IQWeTqj5O9SnVAQ\">here</a></li>\n<li>Recording - (pending)</li>\n</ul>\n\n<p><strong>Networking Session One (12 PM EDT)</strong></p>\n\n<ul>\n<li>Register <a href=\"https://www.reddit.com/r/AskHistorians/comments/q6q88l/registration_is_open_for_askhistorians_digital/?utm_medium=android_app&amp;utm_source=share\">here</a></li>\n</ul>\n\n<p><strong>Panel One AMA (1 PM EDT):</strong> <a href=\"https://www.askhistorians.com/trans-narratives\">&quot;The Lie Became the Truth: Locating Trans Narratives in Queer History&quot;</a></p>\n\n<ul>\n<li><a href=\"https://youtu.be/SJBztisXzZc\">Panel Recording</a>- Watch now!</li>\n<li>AMA Thread - (pending)</li>\n</ul>\n\n<p><strong>Panel Two AMA (3 PM EDT):</strong> <a href=\"https://www.askhistorians.com/race-and-accuracy\">&quot;Racism Is So Universal, It&#39;s Become Normal: Race, Representation, and Accuracy in Works of Popular Media&quot;</a></p>\n\n<ul>\n<li><a href=\"https://youtu.be/yTFIbdYPwHw\">Panel Recording</a> - Watch now!</li>\n<li>AMA Thread - (pending)</li>\n</ul>\n\n<p><strong>Day Two Panel Livestreams (5 PM EDT)</strong></p>\n\n<ul>\n<li>Livestreams Thread - (pending)</li>\n</ul>\n\n<p><strong>Panel Three AMA (7 PM EDT):</strong> <a href=\"https://www.askhistorians.com/games\">&quot;Players Gonna Play, Play, Play, Play, Play: History in Games, Games in History&quot;</a></p>\n\n<ul>\n<li><a href=\"https://youtu.be/rKUPNGuVX94\">Panel Recording</a> - Watch now!</li>\n<li>AMA Thread - (pending)</li>\n</ul>\n\n<p><strong>Networking Session Two (9 PM EDT): Trivia with AskHistorians</strong></p>\n\n<ul>\n<li>Register <a href=\"https://www.reddit.com/r/AskHistorians/comments/q6q88l/registration_is_open_for_askhistorians_digital/?utm_medium=android_app&amp;utm_source=share\">here</a></li>\n</ul>\n\n<h1>How to Participate</h1>\n\n<p><strong>Watch talks:</strong> The central feature of the conference is its collection of recorded talks. These talks have been divided into nine panels of 2–3 speakers, each taking ten minutes to present on their own research before joining in a group discussion with their fellow panelists and an expert moderator. Today&#39;s panels were premiered as livestreams yesterday evening and can now be found on our <a href=\"https://www.youtube.com/channel/UCJudPwztZyg2BQjhetw_bww\">YouTube channel</a>. The recordings will be available indefinitely, so you can always go back and catch up on anything you may have missed!</p>\n\n<p><strong>Ask questions:</strong> Each panel will have its own AMA-style Q&amp;A thread where you can ask the speakers anything you&#39;d like to know about their work. These will go live according to the schedule posted above, and will continue as long as the participants feel like answering more questions!</p>\n\n<p><strong>Attend live events:</strong> Although our conference panels have all been pre-recorded, they will be premiered at 5 PM EDT as livestreamed talks on YouTube the evening before their associated AMA (hence, Panels One, Two, and Three were livestreamed yesterday evening, and Panels Four, Five, and Six will be livestreamed today at 5 PM EDT). Once they have been premiered, they will be made available indefinitely on the AskHistorians YouTube channel. Additionally, we have a number of live, synchronous events planned for the next three days.</p>\n\n<p>Today&#39;s keynote address by Dr. Devon Mihesuah will take place live on Zoom, and you can still register for it <a href=\"https://us02web.zoom.us/webinar/register/6516340505394/WN_cNNfK79IQWeTqj5O9SnVAQ\">here</a>. Don&#39;t worry if you&#39;re unable to grab tickets though! We&#39;ll be releasing a recording of the keynote as soon as possible once it concludes.</p>\n\n<p>Throughout the conference, we will also be hosting live networking sessions for participants and audience members to attend. There will be one networking session focused on talking shop about all things history and one social session focused on chatting and getting to know fellow guests each day.</p>\n\n<p>Today&#39;s social session will center around historical trivia! Ever wanted to test your general knowledge against AskHistorians&#39; finest? Come and join us at 9 PM EDT for the first-ever AskHistorians Trivia Night, hosted by <a href=\"/u/Starwarsnerd222\">u/Starwarsnerd222</a> and <a href=\"/u/Kugelfang52\">u/Kugelfang52</a>.</p>\n\n<p>Can&#39;t make it tonight? There&#39;s a rematch scheduled for 8am EDT on Day 2!</p>\n\n<p>You are welcome to register for and attend as many of our networking and social sessions as you like. A full list of these events, and information about registering, can bee found <a href=\"https://www.reddit.com/r/AskHistorians/comments/q6q88l/registration_is_open_for_askhistorians_digital/?utm_medium=android_app&amp;utm_source=share\">here</a>.</p>\n\n<p><strong>Be a part of the conversation:</strong> We&#39;ll be treating these daily conference megathreads like our Friday Free-for-Alls: you&#39;re welcome to use them to discuss the conference, leave questions or comments, or chat informally about today&#39;s papers in this thread. Keep in mind, though, that our rules about civility are still very much in force. You can also follow updates on Twitter via <a href=\"http://twitter.com/askhistorians\">@askhistorians</a> and #AHDC2021. We encourage you to tweet about our conference as well if you&#39;d like. Just remember to tag us and use the #AHDC2021 hashtag!</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/qb89zx/megathread_day_one_of_the_askhistorians_2021/",
  "subreddit": "AskHistorians",
  "id": "qb89zx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "After eight months of planning, recording, editing, and polishing, the\nAskHistorians 2021 Digital Conference is finally here! On behalf of its\norganizing committee, welcome [https://youtu.be/xA-ldDJPbWs] to this year's\nevent.\n\nIn 2020, we hosted our first digital conference right here on reddit, and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "8ヶ月に及ぶ企画、収録、編集、研磨を経て\nAskHistorians 2021 Digital Conferenceがいよいよ開催されます。組織委員会を代表して\n組織委員会を代表して、今年のイベントに[https://youtu.be/xA-ldDJPbWs]を歓迎します。\nイベントを開催します。\n\n2020年、私たちは最初のデジタルカンファレンスをここredditで開催しましたが、...",
      "title": "MEGATHREAD｜AskHistorians 2021 デジタルカンファレンス初日｜「【削除】＆【消えた歴史】。過去を再構築し、歪曲に立ち向かう\""
    },
    {
      "locale": "zh",
      "the_new_excerpt": "经过八个月的计划、录制、编辑和打磨，\"问史 \"2021年数字会议终于来了。\n问史2021年数字会议终于来了! 我谨代表会议组委会\n组委会，欢迎[https://youtu.be/xA-ldDJPbWs]参加今年的\n活动。\n\n2020年，我们在reddit上举办了第一次数字会议，并且...",
      "title": "访谈｜\"询问历史学家 \"2021年数字会议的第一天｜\"[删除]与失踪的历史。重构过去，对抗扭曲\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "經過八個月的計劃、錄製、編輯和打磨，\"問史 \"2021年數字會議終於來了。\n問史2021年數字會議終於來了! 我謹代表會議組委會\n組委會，歡迎[https://youtu.be/xA-ldDJPbWs]參加今年的\n活動。\n\n2020年，我們在reddit上舉辦了第一次數字會議，並且...",
      "title": "訪談｜\"詢問歷史學家 \"2021年數字會議的第一天｜\"[刪除]與失蹤的歷史。重構過去，對抗扭曲\""
    }
  ]
}