{
  "author": "uiuctodd",
  "original_created_utc": 1624588996,
  "title": "Do tides levels predict sinkhole formation in seaside areas?",
  "created_utc": 1624627920,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Apologies in advance if the question begs anti-science supposition about current events. </p>\n\n<p>The recent collapse of a condominium happened <del>after 3 days of the highest tides of the month in Miami. What&#39;s more, it happened 15 minutes prior the lowest tide.</del> after two days of tides in excess of 3 feet (highest of the month), about an hour before the low tide. Naturally, I&#39;m wondering if there has been any observed co-occurrence of tides and subsidence.</p>\n\n<p>Edit: And naturally I have misconjugated the question. <em>Do tide levels...</em>, <em>Does tide level...</em></p>\n\n<p>Second edit: facts corrected.</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/askscience/comments/o7er3l/do_tides_levels_predict_sinkhole_formation_in/",
  "subreddit": "askscience",
  "id": "o7er3l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Apologies in advance if the question begs anti-science supposition about current\nevents.\n\nThe recent collapse of a condominium happened after 3 days of the highest tides\nof the month in Miami. What's more, it happened 15 minutes prior the lowest\ntide. after two days of tides in excess of 3 feet…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この質問が時事問題についての反科学的な仮定を求めるものであれば、事前にお詫びします。\nイベントについての反科学的な推測になるかもしれません。\n\n最近起きたマンションの倒壊事故は、マイアミで今月最高の潮位が3日続いた後に起きました。\nマイアミでは今月の最高潮の3日後に起きました。さらに、それは最干潮の15分前に起こりました。\n3フィートを超える潮が2日間続いた後...",
      "title": "潮位は海辺のシンクホールの形成を予測するのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果这个问题涉及到对当前事件的反科学推测，请提前道歉。\n事件。\n\n最近一栋公寓的倒塌发生在迈阿密本月最高潮汐的3天之后\n的三天后发生的。更重要的是，它发生在最低潮前15分钟。\n在两天超过3英尺的潮汐之后......",
      "title": "潮汐水平是否预示着海滨地区的天坑形成？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果這個問題涉及到對當前事件的反科學推測，請提前道歉。\n事件。\n\n最近一棟公寓的倒塌發生在邁阿密本月最高潮汐的3天之後\n的三天後發生的。更重要的是，它發生在最低潮前15分鐘。\n在兩天超過3英尺的潮汐之後......",
      "title": "潮汐水平是否預示着海濱地區的天坑形成？"
    }
  ]
}