{
  "author": "GarnByte",
  "the_new_excerpt": "With the small spike in GME (and AMC to lesser extent), it's clear that people\nare anticipating short interest is still going to be high. Whether or not that\nwill be the truth (or even if the FINRA numbers will be reliable) is another\nstory.\n\nRegardless, the astroturfing and narrative control…",
  "original_created_utc": 1612906315,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "GME的小幅飙升（AMC的程度较低），显然人们\n正在预期的空头兴趣仍会很高。无论是否\n是否是真相（甚至如果金融业监管局的数字是可靠的）是另一个。\n故事。\n\n不管怎么说，天马行空和叙事控制... ...。",
      "title": "做好降权大队和帖子/评论删除的准备!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "GME的小幅飆升（AMC的程度較低），顯然人們\n正在預期的空頭興趣仍會很高。無論是否\n是否是真相（甚至如果金融業監管局的數字是可靠的）是另一個。\n故事。\n\n不管怎麼說，天馬行空和敘事控制... ...。",
      "title": "做好降權大隊和帖子/評論刪除的準備!"
    }
  ],
  "title": "Get prepared for a downvote brigade and post/comment removals!",
  "created_utc": 1612982055,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>With the small spike in GME (and AMC to lesser extent), it&#39;s clear that people are anticipating short interest is still going to be high. Whether or not that will be the truth (or even if the FINRA numbers will be reliable) is another story.</p>\n\n<p>Regardless, the astroturfing and narrative control efforts will be strong, especially if the SI numbers ARE high. For now, just wait, buy, and hold if you&#39;re confident in GME. Not financial advice.</p>\n\n<p>Position: 60@77 GME</p>\n\n<p>Edit: Also, SI numbers have NOT been updated yet, so just be patient. 6pm EST seems to be the &quot;expected&quot; time. Those people linking or saying 226.42 SI are wrong, those numbers are not updated and are old.</p>\n\n<p>Just be patient folks. As has always been since the beginning of the GME ventures, there&#39;s a lot of money to be gained or lost on either &quot;side&quot;, so just remain vigilant use your logic (not emotions) when deciding to buy/sell/hold.</p>\n</div><!-- SC_ON -->",
  "score": 2465,
  "permalink": "/r/wallstreetbets/comments/lge1fl/get_prepared_for_a_downvote_brigade_and/",
  "subreddit": "wallstreetbets",
  "id": "lge1fl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123220421
}