{
  "author": "Incorrect_passport",
  "original_created_utc": 1630871691,
  "title": "90% of all NFTs will become worthless in 10 years",
  "created_utc": 1630884637,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The current market of NFTs is completely floaded by shitty stuff and people that want to make a quick buck, making it hard to stand out for every other good artwork.</p>\n\n<p>I&#39;m a 3D artist so i see NFTs as a possibility not only to earn with my artworks but to reach a wider audience and i think it is the same for every other kind of artists but let&#39;s be real, NFTs are not currently selling for these reasons.</p>\n\n<p>At the moment NFTs are practically exclusively bought and sold for speculation OR are useless stuff sold by very famous people  who probably doesn&#39;t even know what an NFT is. Hey, I hid this sentence here to see if you are reading the post before commenting, if you have come this far by reading then comment with the word gorilla at the end of your comment and I will give you an upvote as a thank you for reading the post. I also agree that there may be a lot of money laundering involved, that&#39;s the first thing that crossed my mind when i first heard of NFTs and saw many 3d artists selling at incredible prices.</p>\n\n<p>At this rate, most of NFTs will be completely worthless in lets say 10 years leaving most of the people  with a handful of flies, tricked by a &quot;trend&quot; that has only favored those who already had the money.</p>\n</div><!-- SC_ON -->",
  "score": 188,
  "permalink": "/r/CryptoCurrency/comments/pik1u4/90_of_all_nfts_will_become_worthless_in_10_years/",
  "subreddit": "CryptoCurrency",
  "id": "pik1u4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The current market of NFTs is completely floaded by shitty stuff and people that\nwant to make a quick buck, making it hard to stand out for every other good\nartwork.\n\nI'm a 3D artist so i see NFTs as a possibility not only to earn with my artworks\nbut to reach a wider audience and i think it is the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今のNFTの市場は、完全に糞みたいなものと人で溢れかえっています。\n儲けようとする人たちで溢れかえっていて、他の優れた作品を目立たせることができません。\nアートワーク。\n\n私は3Dアーティストなので、NFTは自分の作品で稼ぐだけでなく、より多くの人にリーチできる可能性があると考えています。\n私は3Dアーティストなので、NFTは自分の作品で稼ぐだけでなく、より多くの人に届けることができる可能性があると考えています...",
      "title": "10年後には全NFTの90％が無価値になる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "目前的NFTs市场完全被低劣的东西和想赚快钱的人所充斥。\n想赚快钱的人，使其很难在其他好的作品中脱颖而出。\n艺术作品。\n\n我是一名3D艺术家，所以我认为NFT是一种可能性，不仅可以通过我的艺术作品来赚钱\n而且可以接触到更多的观众，我认为这是一个很好的机会。",
      "title": "90%的NFT将在10年内变得毫无价值"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "目前的NFTs市場完全被低劣的東西和想賺快錢的人所充斥。\n想賺快錢的人，使其很難在其他好的作品中脫穎而出。\n藝術作品。\n\n我是一名3D藝術家，所以我認爲NFT是一種可能性，不僅可以通過我的藝術作品來賺錢\n而且可以接觸到更多的觀衆，我認爲這是一個很好的機會。",
      "title": "90%的NFT將在10年內變得毫無價值"
    }
  ]
}