{
  "author": "LehmanParty",
  "the_new_excerpt": "The increasingly-depraved debuts of Oreos with more stuffing indicate unstable\namounts of greed and leverage in the system, serving as an immediate indicator\nof that the makings of a market crash are in place. Conversely, when the Oreo\nteam reduces the amount of icing in their treats, markets tend…",
  "original_created_utc": 1619516974,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "詰め物を増やしたOreosのますます堕落したデビューは、システムにおける不安定な量の欲とレバレッジを示しています。\n欲とレバレッジが不安定になっていることを示しており、市場の暴落の兆候を即座に示しています。\n市場の暴落の準備が整っていることを即座に示す指標となります。逆に、Oreoチームが\n逆にOreoチームがおやつのアイシングを減らすと、市場は...",
      "title": "Oreo社がより大きなサイズのクッキーを発売するたびに市場は暴落する"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "越来越多的奥利奥饼干的首次亮相，表明系统中不稳定的贪婪和杠杆。\n体系中的贪婪和杠杆数量，作为一个直接指标\n市场崩溃的征兆已经出现了。反之，当奥利奥\n团队减少他们食物中的糖衣量时，市场往往...",
      "title": "奥利奥每次发布更大块头的饼干，市场就会崩溃"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "越來越多的奧利奧餅乾的首次亮相，表明系統中不穩定的貪婪和槓桿。\n體系中的貪婪和槓桿數量，作爲一個直接指標\n市場崩潰的徵兆已經出現了。反之，當奧利奧\n團隊減少他們食物中的糖衣量時，市場往往...",
      "title": "奧利奧每次發佈更大塊頭的餅乾，市場就會崩潰"
    }
  ],
  "title": "Markets crash every time Oreo releases an even greater-stuffed cookie",
  "created_utc": 1619525633,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The increasingly-depraved debuts of Oreos with more stuffing indicate unstable amounts of greed and leverage in the system, serving as an immediate indicator of that the makings of a market crash are in place. Conversely, when the Oreo team reduces the amount of icing in their treats, markets tend to have great bull runs until once again society demands to push the boundaries of how much stuffing is possible.</p>\n\n<p><a href=\"https://en.wikipedia.org/wiki/List_of_Oreo_varieties\">https://en.wikipedia.org/wiki/List_of_Oreo_varieties</a> <a href=\"https://en.wikipedia.org/wiki/List_of_stock_market_crashes_and_bear_markets\">https://en.wikipedia.org/wiki/List_of_stock_market_crashes_and_bear_markets</a></p>\n\n<p>1974: Double Stuf Oreo released. Dow Jones crashes 45%. FTSE drops 73%.</p>\n\n<p>1987: Big Stuf Oreo released. Black Monday, a 20% single-day crash and a following bear market.</p>\n\n<p>1991: Mini Oreo introduced. Smaller icing ratios coincide with the 1991 Japanese asset price bubble, confirming the correlation works both ways and a reduction of Oreo icing may be a potential solution to preventing a future crash.</p>\n\n<p>2011: Triple Double Oreo introduced. S&amp;P drops 21% in a 5-month bear market</p>\n\n<p>2015: Oreo Thins introduced. A complete lack of icing causes an unprecedented bull run in the S&amp;P for years</p>\n\n<p>2019: The Most Stuf Oreo briefly introduced. Pulled off the shelf before any major market damage could occur.</p>\n\n<p>2021: The Most Stuf Oreo reintroduced. Market response: ???</p>\n</div><!-- SC_ON -->",
  "score": 52347,
  "permalink": "/r/wallstreetbets/comments/mzkumu/markets_crash_every_time_oreo_releases_an_even/",
  "subreddit": "wallstreetbets",
  "id": "mzkumu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776220639
}