{
  "author": "Squeaky-squash",
  "original_created_utc": 1652289834,
  "title": "Is it just me or have we become too comfortable with filming strangers for clout?",
  "created_utc": 1652304275,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I see so many videos online that are like “I gave this random stranger money and CHANGED THEIR LIVES” or “look how cute my elderly neighbour is” or “Look how much my neighbours play with my dog” etc you get the idea. But a lot of the videos seem to be taken without the consent of those being filmed. They’re commonly filmed out a window and whatnot or with a “hidden camera” so get someone’s “real reaction”. Ignoring the fact that this might be illegal, isn’t it just morally a little iffy? Like, I’d be pissed if someone filmed me without my knowledge and posted the video online. I don’t want a bunch of online strangers knowing my face or those of my family members. Seems risky somehow even though it probably isn’t. Have we become to accepting with this? It’s so normalised nowadays.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/NoStupidQuestions/comments/unf29r/is_it_just_me_or_have_we_become_too_comfortable/",
  "subreddit": "NoStupidQuestions",
  "id": "unf29r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I see so many videos online that are like “I gave this random stranger money and\nCHANGED THEIR LIVES” or “look how cute my elderly neighbour is” or “Look how\nmuch my neighbours play with my dog” etc you get the idea. But a lot of the\nvideos seem to be taken without the consent of those being…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ネットで「見ず知らずの人にお金をあげてしまった」というような動画をよく見かけますが\nをあげたら、彼らの人生が変わった」とか、「近所のお年寄りがどれだけかわいいか見てみ\n隣人は私の犬と遊ぶどのくらい見てください \"など、アイデアを得ることができます。しかし、多くの\nビデオに写っている人たちの同意がないように見える...。",
      "title": "見ず知らずの人を撮影して口説くことに抵抗がなくなったのは私だけでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在网上看到很多视频，就像 \"我给了这个随机的陌生人钱，然后改变了他们的生活\"，或者 \"看看我的老邻居有多可爱\"，或者 \"我是谁？\n改变了他们的生活 \"或 \"看我的老邻居多可爱 \"或 \"看我的邻居和我的狗玩得多开心 \"等等。\n看我的邻居和我的狗玩得多开心 \"等等，你明白了吧。但很多\n但很多视频似乎都是在未经当事人同意的情况下拍摄的...",
      "title": "仅仅是我，还是我们已经变得太喜欢拍摄陌生人的影响力了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在網上看到很多視頻，就像 \"我給了這個隨機的陌生人錢，然後改變了他們的生活\"，或者 \"看看我的老鄰居有多可愛\"，或者 \"我是誰？\n改變了他們的生活 \"或 \"看我的老鄰居多可愛 \"或 \"看我的鄰居和我的狗玩得多開心 \"等等。\n看我的鄰居和我的狗玩得多開心 \"等等，你明白了吧。但很多\n但很多視頻似乎都是在未經當事人同意的情況下拍攝的...",
      "title": "僅僅是我，還是我們已經變得太喜歡拍攝陌生人的影響力了？"
    }
  ]
}