{
  "author": "GMEgotmehere",
  "the_new_excerpt": "Ever since 2008 it seems to be a given that the Fed will fix the stock market\nwhenever it \"breaks.\" Will this be the norm in the decades ahead? If so we truly\nshouldn't worry about a correction beyond a few months time. Some could argue\nthe dead market following the dot com crash would not happen…",
  "original_created_utc": 1622937288,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2008年以来、FRBが「壊れた」時には必ず株式市場を修復するというのが当たり前のようになっている。\n株式市場が \"壊れる \"たびにFRBが修正するのは当然のことのようだ。今後数十年の間に、このようなことが当たり前になるのでしょうか？もしそうなら、私たちは本当に\n数ヶ月先の調整を心配すべきではありません。ある人は次のように言います。\nドットコム・クラッシュの後のデッド・マーケットは起こらなかった...と言う人もいる。",
      "title": "FRBが必要に応じて常に介入し、株式市場を活性化させるということを、今後数年間でどれだけ確信できるか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自2008年以来，美联储似乎已经注定要在股市 \"崩溃 \"时修复它。\n只要它 \"崩溃\"。这将是未来几十年的常态吗？如果是这样，我们真的\n不应该担心几个月后的修正。有些人可以说\n互联网崩溃后的死亡市场不会发生......",
      "title": "在未来的岁月里，我们应该有多大的信心，认为美联储会在需要时始终介入并提振股市？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自2008年以來，美聯儲似乎已經註定要在股市 \"崩潰 \"時修復它。\n只要它 \"崩潰\"。這將是未來幾十年的常態嗎？如果是這樣，我們真的\n不應該擔心幾個月後的修正。有些人可以說\n互聯網崩潰後的死亡市場不會發生......",
      "title": "在未來的歲月裏，我們應該有多大的信心，認爲美聯儲會在需要時始終介入並提振股市？"
    }
  ],
  "title": "How confident should we be in the years ahead that the Fed will ALWAYS step in and boost the stock market as needed?",
  "created_utc": 1623023511,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ever since 2008 it seems to be a given that the Fed will fix the stock market whenever it &quot;breaks.&quot; Will this be the norm in the decades ahead? If so we truly shouldn&#39;t worry about a correction beyond a few months time. Some could argue the dead market following the dot com crash would not happen again with today&#39;s QE measures. It is kind of crazy that this has become a normal thing nowadays. Or maybe I&#39;m just crazy for thinking they weren&#39;t in control all along.</p>\n</div><!-- SC_ON -->",
  "score": 38,
  "permalink": "/r/stocks/comments/nt8rls/how_confident_should_we_be_in_the_years_ahead/",
  "subreddit": "stocks",
  "id": "nt8rls",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404886633
}