{
  "author": "FullSendOrNullSend",
  "original_created_utc": 1635628407,
  "title": "An Interesting Mystery About a Bitcoin Whale",
  "created_utc": 1635690794,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I thought this reddit group would find this story interesting as it is still a mystery I am trying to solve.</p>\n\n<p>One of my moms good friends from high-school was an early bitcoin adopter in 2012. My mom and him talked on the phone frequently and in 2012 he told her that he had &quot;bought big&quot; into bitcoin. At the time, my mom had no idea what that meant and just shrugged it off. She isn&#39;t very tech savvy and had no interest in learning about the technology. He tried to explain it to her but she never understood it. My mom said he was always one who was big into tech and was very smart in the space. Another important piece of this mystery is that he had told my mom frequently he was in &quot;a group&quot; of early adopters and he started adding people on Facebook from around the world.</p>\n\n<p>A few years later (around 2014), he told her that he wanted to go live on an island (I believe Puerto Rico) and my mom always thought that was strange. About a year later, this early bitcoin adopter completely disappeared. He left his dad a note and no one has ever heard from him since. My mom talked with his dad a lot after his disappearance and he told her that he had found a burner phone box and that he had shaved his head before he disappeared. The police found his car in a parking lot near the mountains and the search dogs were never even able to pick up a scent after a month of searching the area near his vehicle. </p>\n\n<p>Another interesting piece of this story but I am not sure if it is related, about 6 months before he disappeared he sent my mom a Google Chromebook but it was not new in the box. We used that as our family computer for a few years. Now that I am older and understand crypto, hearing the story makes me think he disappeared to get out of the country to evade taxes on his new fortune because he knew he was going to be a WHALE. Also, after I got into crypto is when my mom told me about his early &quot;big investment&quot; into bitcoin and she is now convinced that he most likely disappeared because of it. After explaining bitcoin and crypto to her and how it&#39;s possible he disappeared because he knew he would be a whale, she told me that it would make a lot of sense because he always was two steps ahead and thought outside the box. She also said that with his knowledge of tech, it&#39;s very possible that he shaved his head and got a fake passport to leave the country without a trace.</p>\n\n<p>I have been trying to solve this mystery for a while now but I had the thought that he could&#39;ve left a note related to his disappearance on the laptop and thats why he sent it right before he disappeared... (also why it wasn&#39;t in the factory box when it came). </p>\n\n<p>This mystery has been impossible to solve but there are too many signs that he disappeared because of his fortune of bitcoin started to grow and he didn&#39;t want to be taxed on it (or some other reason related to his whale status). He was very close with my mom and everyone who knew him still believes he is alive. Wanted to share this interesting story and also wanted to see if anyone of this subreddit has ideas on if/how he could have put a hidden message on the Chromebook (or even better - gave my mom a couple BTC since he bought so much at a low price).</p>\n\n<p>Anyways, I hope you enjoy the read and I look forward to hearing other peoples thoughts on this story.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/qjaqvf/an_interesting_mystery_about_a_bitcoin_whale/",
  "subreddit": "CryptoCurrency",
  "id": "qjaqvf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I thought this reddit group would find this story interesting as it is still a\nmystery I am trying to solve.\n\nOne of my moms good friends from high-school was an early bitcoin adopter in\n2012. My mom and him talked on the phone frequently and in 2012 he told her that\nhe had \"bought big\" into…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこのredditグループがこの話を面白いと思うだろうと思いましたが、それは私がまだ解決しようとしている謎だからです。\n謎を解き明かそうとしています。\n\n私の母の高校時代の親友の一人は、2012年に初期のビットコインの採用者でした。\n2012. 母と彼は頻繁に電話で話していましたが、2012年に彼は母に、ビットコインを「大きく買った」と言いました。\n彼は2012年にビットコインに「大枚をはたいた」と言っていました。",
      "title": "ビットコイン・ホエールの興味深い謎"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想这个红点小组会发现这个故事很有趣，因为它仍然是一个\n我正在努力解开这个谜团。\n\n我妈妈的一个高中好朋友在2012年是一个早期的比特币采用者。\n2012. 我妈妈和他经常通电话，在2012年他告诉她\n他在2012年告诉她，他已经 \"大手笔 \"买入了...",
      "title": "关于比特币鲸鱼的一个有趣的谜团"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想這個紅點小組會發現這個故事很有趣，因爲它仍然是一個\n我正在努力解開這個謎團。\n\n我媽媽的一個高中好朋友在2012年是一個早期的比特幣採用者。\n2012. 我媽媽和他經常通電話，在2012年他告訴她\n他在2012年告訴她，他已經 \"大手筆 \"買入了...",
      "title": "關於比特幣鯨魚的一個有趣的謎團"
    }
  ]
}