{
  "author": "Bigdocks",
  "the_new_excerpt": "Back in 2017, when I was 14, my parents gave me three thousand dollars to invest\nin the stock market. Let me say, my family is not well off by any means and\nthree thousand dollars was a lot to us. My parents giving me that money showed\nme that they really believed in me and that I could turn a…",
  "original_created_utc": 1612932992,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "早在2017年，我14岁的时候，父母给了我三千元钱，让我去投资。\n在股票市场上。这么说吧，我的家境无论如何也不富裕，而且。\n三千块钱对我们来说是个大数目。我父母给我的钱表明\n我，他们真的相信我，我可以把一个... ...",
      "title": "我的巨额亏损终于得到了弥补!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "早在2017年，我14歲的時候，父母給了我三千元錢，讓我去投資。\n在股票市場上。這麼說吧，我的家境無論如何也不富裕，而且。\n三千塊錢對我們來說是個大數目。我父母給我的錢表明\n我，他們真的相信我，我可以把一個... ...",
      "title": "我的鉅額虧損終於得到了彌補!"
    }
  ],
  "title": "I finally broke even on my huge loss!",
  "created_utc": 1612935732,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Back in 2017, when I was 14, my parents gave me three thousand dollars to invest in the stock market. Let me say, my family is not well off by any means and three thousand dollars was a lot to us. My parents giving me that money showed me that they really believed in me and that I could turn a profit. I had no clue with what to do with the money and decided to throw it into a bunch of worthless penny stocks because I liked the idea of owning thousands of shares in a company. Within months, my account declined all the way to 300 dollars. At this point, I decided to give up and try my hardest to forget about it. Throughout the years, this loss has been dragging me down and ultimately made me have very negative feelings towards the stock market. Cut to Jan 11 2021. My account miraculously was worth 1300 dollars from one of the companies that actually performed well. I decided to actually do my DD and find good companies to invest in. After multiple years, I finally broke 3k and I don’t have any plans of stopping here.</p>\n</div><!-- SC_ON -->",
  "score": 876,
  "permalink": "/r/investing/comments/lgmb64/i_finally_broke_even_on_my_huge_loss/",
  "subreddit": "investing",
  "id": "lgmb64",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123200895
}