{
  "author": "R0B0C0P33",
  "original_created_utc": 1640285570,
  "title": "You doubters are going to look quite foolish when BTC actually DOES hit $100K by EOY",
  "created_utc": 1640295243,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Have none of you people seen a holiday movie? Of course it will seem unlikely that the thing everyone hopes will happen will come true. &lt;/p&gt;\n\n&lt;p&gt;We are in the final stretch now, so be prepared for some seasonal magic to hit, no matter how ridiculous and contrived. Perhaps it will happen when the Grinch character in your life (A douche brother - in - law perhaps?) will say something dismissive like &amp;quot;You should never have wasted your time and money with something as foolish as crypto&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Then you will see the numbers start to shoot up. His eyes will go wider and wider as he realizes his mistake. (You giggling when it hits $69K won&amp;#39;t help any). When it finally hits $100K, his heart will grow 3 sizes that day and you will be vindicated.&lt;/p&gt;\n\n&lt;p&gt;This happening is inevitable. The only chance of it not happening would be if our lives are not a work of fiction, and that seems very unlikely.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 220,
  "permalink": "/r/CryptoCurrency/comments/rn2hve/you_doubters_are_going_to_look_quite_foolish_when/",
  "subreddit": "CryptoCurrency",
  "id": "rn2hve",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Have none of you people seen a holiday movie? Of course it will seem unlikely\nthat the thing everyone hopes will happen will come true.\n\nWe are in the final stretch now, so be prepared for some seasonal magic to hit,\nno matter how ridiculous and contrived. Perhaps it will happen when the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "お前らホリデー映画見たことないのか？もちろん、それはありえないことだと思うでしょう。\n誰もが願っていることが実現する。\n\n今、最後の追い込みに入っているので、季節の魔法がかかることを覚悟しておいてください。\nどんなにバカバカしくても、どんなに仕組まれたものであっても。もしかしたら、その時に起こるかもしれない...",
      "title": "BTCが年末までに10万ドルを達成したら、疑心暗鬼になっている人はかなりバカを見るだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你们这些人都没有看过节日电影吗？当然，这看起来不太可能\n每个人都希望发生的事情会成真。\n\n我们现在处于最后阶段，所以要准备好迎接一些季节性魔法的冲击。\n无论多么荒谬和矫揉造作。也许它将发生在...",
      "title": "当BTC真正在EOY之前达到10万美元时，你们这些怀疑者会显得相当愚蠢。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你們這些人都沒有看過節日電影嗎？當然，這看起來不太可能\n每個人都希望發生的事情會成真。\n\n我們現在處於最後階段，所以要準備好迎接一些季節性魔法的衝擊。\n無論多麼荒謬和矯揉造作。也許它將發生在...",
      "title": "當BTC真正在EOY之前達到10萬美元時，你們這些懷疑者會顯得相當愚蠢。"
    }
  ]
}