{
  "author": "Maximum-Pie916",
  "original_created_utc": 1656558397,
  "title": "Is it wrong for my husband to train and discipline our future kids the “army” way?",
  "created_utc": 1656571540,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My husband is in the army. We do not have kids yet. &lt;/p&gt;\n\n&lt;p&gt;He says that if our kids never want to make their beds, or back talk or something, he wants them to make their beds the army way, like basically have the beds made to the standard that he had to make his bed in army basic training. This would be his way of punishing them for not making their beds. I guess he would take on drill sergeant mode or something like that. &lt;/p&gt;\n\n&lt;p&gt;I feel like this is not a good parenting style because our kids will just see my husband’s ego of how he was in the army. It also just seems a bit too strict to me, but I could be wrong though. &lt;/p&gt;\n\n&lt;p&gt;I don’t think he would use this method all the time.&lt;/p&gt;\n\n&lt;p&gt;What do you guys think? Is this a good way to discipline kids?&lt;/p&gt;\n\n&lt;p&gt;Update: He says he wouldn’t yell at them or flip their beds. He would just want their beds held to a higher standard. I can’t explain that well, but basically he would want their beds made perfectly like in the army, without the yelling or bed flipping.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/NoStupidQuestions/comments/vnxxzf/is_it_wrong_for_my_husband_to_train_and/",
  "subreddit": "NoStupidQuestions",
  "id": "vnxxzf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My husband is in the army. We do not have kids yet.\n\nHe says that if our kids never want to make their beds, or back talk or\nsomething, he wants them to make their beds the army way, like basically have\nthe beds made to the standard that he had to make his bed in army basic\ntraining. This would be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の夫は軍隊にいます。私たちにはまだ子供がいません。\n\n主人は、もし子供たちがベッドメーキングをしないとか、口答えをするとか、そういうことがあったら\nベッドメイキングは軍隊式にやってほしいそうです。\n基本的に、軍隊の基礎訓練でベッドメイキングをしたのと同じようにベッドメイキングをさせたいと言っています。\n軍隊の基礎訓練の時のようにね そうすると...",
      "title": "夫が将来の子供たちを「軍隊」式に訓練し、躾けることは間違っているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的丈夫在军队里。我们还没有孩子。\n\n他说，如果我们的孩子从来不愿意整理床铺，或者顶嘴什么的，他希望他们以军队的方式整理床铺。\n他想让他们以军队的方式整理床铺，比如说基本上是按照他整理床铺的标准来整理。\n铺床的标准是他在军队基本训练中必须铺床的标准。\n训练的标准。这将是...",
      "title": "我丈夫用 \"军队 \"的方式来训练和管教我们未来的孩子，这有错吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的丈夫在軍隊裏。我們還沒有孩子。\n\n他說，如果我們的孩子從來不願意整理牀鋪，或者頂嘴什麼的，他希望他們以軍隊的方式整理牀鋪。\n他想讓他們以軍隊的方式整理牀鋪，比如說基本上是按照他整理牀鋪的標準來整理。\n鋪牀的標準是他在軍隊基本訓練中必須鋪牀的標準。\n訓練的標準。這將是...",
      "title": "我丈夫用 \"軍隊 \"的方式來訓練和管教我們未來的孩子，這有錯嗎？"
    }
  ]
}