{
  "author": "babossa77",
  "original_created_utc": 1640025385,
  "title": "Nobody who bought Bitcoin and hodled for at least 3 years was in a loss",
  "created_utc": 1640032288,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There is not a single person in the entire history of Bitcoin who bought BTC and hodled for at least 3 years and was in a loss. At any point of time, Bitcoins price would always be higher than 3 years ago and would never fall beneath that value again.&lt;/p&gt;\n\n&lt;p&gt;So if you bought recently near the ATH, keep that in mind. All you have to do is wait and hodl. And it will probably not even be 3 years. The next halving will be in roughly 2.5 years, and we also do not know what the short term price action will look like, maybe the bullrun will go on and we will see new ATHs in the next few weeks or months, or maybe it won&amp;#39;t and we enter a bear market.&lt;/p&gt;\n\n&lt;p&gt;Whatever happens, the only thing you need to do is hodl.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/rktxos/nobody_who_bought_bitcoin_and_hodled_for_at_least/",
  "subreddit": "CryptoCurrency",
  "id": "rktxos",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There is not a single person in the entire history of Bitcoin who bought BTC and\nhodled for at least 3 years and was in a loss. At any point of time, Bitcoins\nprice would always be higher than 3 years ago and would never fall beneath that\nvalue again.\n\nSo if you bought recently near the ATH, keep…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインの全歴史の中で、BTCを購入し\n少なくとも3年間はホドホドにして、損切り状態でした。どの時点でも、ビットコインは\n3年前より高くなり、それ以下になることはないでしょう。\nまたその価値\n\nだから、最近ATHの近くで買った人は、そのまま...",
      "title": "ビットコインを買って少なくとも3年間ホドホドにした人は、誰も損をしていません"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在整个比特币的历史上，没有一个人买了BTC并且\n炒了至少3年，还处于亏损状态。在任何时间点，比特币\n的价格总是高于3年前的价格，并且永远不会低于这个价格。\n价值。\n\n因此，如果你最近在ATH附近买入，保持...",
      "title": "买了比特币并至少经营了3年的人都没有处于亏损状态"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在整個比特幣的歷史上，沒有一個人買了BTC並且\n炒了至少3年，還處於虧損狀態。在任何時間點，比特幣\n的價格總是高於3年前的價格，並且永遠不會低於這個價格。\n價值。\n\n因此，如果你最近在ATH附近買入，保持...",
      "title": "買了比特幣並至少經營了3年的人都沒有處於虧損狀態"
    }
  ]
}