{
  "author": "Johnnyinvests",
  "the_new_excerpt": "If your investing or plan on investing in the near future and your a young\nperson with little or no bills to pay my advice would be to throw as much extra\ncash you have into your investment account. Say your 18/19 with a part time job\n(assuming your in school) GROW YOUR MONEY. I am 100% not saying…",
  "original_created_utc": 1615768263,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "如果你的投资或计划在不久的将来投资，你的年轻的，你的投资。\n我的建议是，在没有账单的情况下，尽量多投点钱。\n现金到你的投资账户。比如你18/19岁，有一份兼职工作。\n(假设你在学校)种植你的钱。我100%不是说...",
      "title": "给年轻的投资人的建议，很少或没有账单!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你的投資或計劃在不久的將來投資，你的年輕的，你的投資。\n我的建議是，在沒有賬單的情況下，儘量多投點錢。\n現金到你的投資賬戶。比如你18/19歲，有一份兼職工作。\n(假設你在學校)種植你的錢。我100%不是說...",
      "title": "給年輕的投資人的建議，很少或沒有賬單!"
    }
  ],
  "title": "Advice for young investors with little or no bills to pay!",
  "created_utc": 1615783036,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If your investing or plan on investing in the near future and your a young person with little or no bills to pay my advice would be to throw as much extra cash you have into your investment account. Say your 18/19 with a part time job (assuming your in school) GROW YOUR MONEY. I am 100% not saying gamble in stocks like GME, AMC, etc. but really invest your money in strong fundamentally stable stocks, or ETF’s if you want to play it more safe, because in the next 3, 4, 5 years of your life your not going to have that money to play with. Bills will eventually start to pile up so get started sooner then later! If you are this audience you really have an amazing opportunity that most people don’t have, you have the ability to a leg up over the next person in regards to your finances, and to jump start the growth of your money substantially.</p>\n</div><!-- SC_ON -->",
  "score": 976,
  "permalink": "/r/stocks/comments/m58g39/advice_for_young_investors_with_little_or_no/",
  "subreddit": "stocks",
  "id": "m58g39",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147382528
}