{
  "author": "crxv20",
  "original_created_utc": 1627841722,
  "title": "Can someone explain MOON as if I was a 5 year old?",
  "created_utc": 1627860786,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I saw that some people have MOON written next to their profile name on comments and posts. I was wodnering how they got them. A friend told me that I should create a vault first, so I did. However, I have 0 clue on how to get MOON. </p>\n\n<p>Also, what can you use MOON for?</p>\n\n<p>Before you downvote me to the MOON, yes I did read the Reddit wiki on this and couldn&#39;t figure it out. Honest question here.</p>\n\n<p>Hope you can help a MOON noob out. Thank you!</p>\n\n<p>Edit: I saw a comment below saying I did this to farm MOON. And this just got me wondering. Are MOONs actually creating some sort of paranoia from upvoting posts/comments?</p>\n\n<p>I&#39;m saying this because the post has 120 comments but only 15 upvotes. I don&#39;t mind it at all since I got more answers than I even wished for (thank you all for that). But it just seems weird and got me wondering. Anyone has an opinion on this?</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/ovx8av/can_someone_explain_moon_as_if_i_was_a_5_year_old/",
  "subreddit": "CryptoCurrency",
  "id": "ovx8av",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I saw that some people have MOON written next to their profile name on comments\nand posts. I was wodnering how they got them. A friend told me that I should\ncreate a vault first, so I did. However, I have 0 clue on how to get MOON.\n\nAlso, what can you use MOON for?\n\nBefore you downvote me to the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "コメントや投稿のプロフィール名の横にMOONと書かれている人がいるのを見て\nと書いてある人がいました。どうやって手に入れたのだろうと不思議に思っていました。友人からは\nと言われたので、作ってみました。しかし、どうやってMOONを手に入れるのか、全くわかりません。\n\nまた、MOONは何に使えるのでしょうか？\n\nとか言われる前に・・・。",
      "title": "誰か私が5歳の時のようにMOONを説明してくれませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到有些人在评论和帖子中，在他们的个人资料名称旁边写上了MOON\n和帖子。我在想，他们是怎么得到这些的。一个朋友告诉我，我应该\n先创建一个金库，所以我就做了。然而，我对如何获得MOON毫无头绪。\n\n还有，你能用MOON做什么？\n\n在你给我投反对票之前......",
      "title": "谁能像我是一个5岁的孩子那样解释一下MOON？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到有些人在評論和帖子中，在他們的個人資料名稱旁邊寫上了MOON\n和帖子。我在想，他們是怎麼得到這些的。一個朋友告訴我，我應該\n先創建一個金庫，所以我就做了。然而，我對如何獲得MOON毫無頭緒。\n\n還有，你能用MOON做什麼？\n\n在你給我投反對票之前......",
      "title": "誰能像我是一個5歲的孩子那樣解釋一下MOON？"
    }
  ]
}