{
  "author": "Mr-com999",
  "original_created_utc": 1629329422,
  "title": "Does anyone ever have that fear that Crypto all of Crypto everything around us is just one super long game scam?",
  "created_utc": 1629351038,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ive been watching a few documentaries and movies lately about these criminal groups and people who just fall for their shit.  And you sit there going, that scam is so obvious.  And it shocks you that if some guy just a looked a little deeper or just you know read something boom all unraveled.  It never gets off the ground.  </p>\n\n<p>I worry someday that all of this is just some elaborate scam cooked up by some Japanese Neet named Satoshi Nakomoto.  Who couldn&#39;t get out of his house to get a job so he told his parents he&#39;s working on a &quot;digital currency&quot; project and got em to invest so he could buy more anime.  Then his otaku friend took his parents letter about the project and put in on the internet explaining bitcoin.  And he was like dudr I don&#39;t have a project.  And thats where the scam came about, just put randome code on the internet and people will like interpret it how they will.  And then Satoshi was like what if they find me and he friend was like,  no one will ever know cause you never go outside.</p>\n\n<p>Then it got popular and Hoskins and Vitalik found out who Satoshi was because they met his friend at an anime con and he was all like bragging about it.  So they flew to Japan and told Satoshi were making our own crypto called Etherium.  And they kidnapped him and are holding him hostage in Hoskins basement and Vitalik wants to save but Hoskins knows the secret.  And they need Satoshi never to appear or it will ruin the mystery of Crypto.  And were right now in the part of the movie where like Vitalik saves Satoshi and he is going to come forward in a press conference and reveal the truth.  It was all scam!!!!</p>\n\n<p>I have that fear sometimes.  I also have the fear that I&#39;m going to be one of the guys at the beginning of the movie being interviewed.</p>\n\n<p>Interviewer: So crypto is a digital currency?</p>\n\n<p>Me: Yes</p>\n\n<p>Interviewer: So you were told these numbers were money</p>\n\n<p>Me: Yes</p>\n\n<p>Interviewer:  You spent money on mining and buying coins from people on the internet for numbers in a &quot;wallet&quot;</p>\n\n<p>Me: Not your keys not your money.</p>\n\n<p>Interviewer: Thats not the point, you invested money on imaginary money.</p>\n\n<p>Me.  Fiat is imaginary.  My bank statement isn&#39;t real money.</p>\n\n<p>Interview But it can be turned into this. <em>Slams a 20 on the table.</em></p>\n\n<p>Me.  I could do that too?</p>\n\n<p>Interviewer: By converting the coin on exchange for this 20.</p>\n\n<p>Me: Yes</p>\n\n<p>Interviewer: When you already had this 20</p>\n\n<p>Me: Yes</p>\n\n<p>Interviewer: So you traded your money for magic beans?</p>\n\n<p>Me: Uhh </p>\n\n<p>Interviewer: Did anyone try to warn you this is a scam?  </p>\n\n<p>Me: Everyone</p>\n\n<p>Interviewer: And?</p>\n\n<p>Me: I was told I was early.</p>\n\n<p>Interviewer: After 10 years.</p>\n\n<p>Me:  Yeah</p>\n\n<p>Interviewer: Is there anyone else you want to say to Satoshi or Vitalik or Hoskins who are being sentenced today?</p>\n\n<p>Me: Yeah, where Lambo?</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/p72yta/does_anyone_ever_have_that_fear_that_crypto_all/",
  "subreddit": "CryptoCurrency",
  "id": "p72yta",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Ive been watching a few documentaries and movies lately about these criminal\ngroups and people who just fall for their shit. And you sit there going, that\nscam is so obvious. And it shocks you that if some guy just a looked a little\ndeeper or just you know read something boom all unraveled. It never…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は最近、このような犯罪者集団や、彼らに騙される人々についてのドキュメンタリーや映画をいくつか見てきました。\n最近、いくつかのドキュメンタリーや映画を見ましたが、これらの犯罪グループと、彼らに騙されてしまう人々についてのものでした。そして、あなたはそこに座ってこう思うのです。\n詐欺はとても明白です。そして、もし誰かがもう少し深く見たり、何かを読んだりしたら、全てが解明されるのではないかとショックを受けます。\n何かを読んだりするだけで、全てが解明されてしまうのです。それは決して...",
      "title": "私たちの周りにある暗号のすべてが、超長期的なゲームの詐欺ではないかという不安を感じたことはありませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近一直在看一些关于这些犯罪集团的纪录片和电影\n这些犯罪集团和人们只是上了他们的当。而你坐在那里，那\n骗局是如此明显。它让你感到震惊的是，如果有些人只是稍微看了一下\n深入了解一下，或者你知道阅读一些东西，就会揭开谜底。它从来没有...",
      "title": "是否有人曾有过这样的担心，即我们周围所有的加密货币都只是一个超级长的游戏骗局？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近一直在看一些關於這些犯罪集團的紀錄片和電影\n這些犯罪集團和人們只是上了他們的當。而你坐在那裏，那\n騙局是如此明顯。它讓你感到震驚的是，如果有些人只是稍微看了一下\n深入瞭解一下，或者你知道閱讀一些東西，就會揭開謎底。它從來沒有...",
      "title": "是否有人曾有過這樣的擔心，即我們周圍所有的加密貨幣都只是一個超級長的遊戲騙局？"
    }
  ]
}