{
  "author": "BatSwinger",
  "original_created_utc": 1639483919,
  "title": "Isn't categorizing races into people of color and white people a little bit racist?",
  "created_utc": 1639489966,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First of all I accept all races, and judge people by their personality.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been thinking a lot about the expression &amp;quot;People of color&amp;quot;, and I think it&amp;#39;s a weird expression. I have a few thoughts about it.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;It&amp;#39;s basically a mild form of racial segregation, separating white people from all other races.&lt;/li&gt;\n&lt;li&gt;It kinda implies without much context that &amp;quot;white people&amp;quot; are the default, and coloured people are just variations  (Like a white canvas, being painted on).&lt;/li&gt;\n&lt;li&gt;Apperantly its a old expression first used in the 18th century, to separate white people free people, from slaves. The difference today is, it separates coloured people from white people, while back then it separated white people from coloured people (If that even makes sense)&lt;/li&gt;\n&lt;li&gt;Having a people of color category implies that all ethnicities besides white goes through the same struggles and shares values in some form. In reality they all have different cultures, and are as different to each other, as white people and some other race. &lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;This expression originated in the US, where white people is the majority, so I can see why this expression can be useful in certain statistical situations. &lt;/p&gt;\n\n&lt;p&gt;The expression has spread out a lot around the world, especially in the west, and isn&amp;#39;t as relevant in a lot of countries. I just think it kinda amplifies what the expression is actually trying to combat. It&amp;#39;s pouring fuel on a fire that is already burning. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t like the expression, it doesn&amp;#39;t help any race. I think it&amp;#39;s discriminating towards POC, but also against white people, as it kinda implies White people VS POC.   It makes white people stand alone, and ignores the huge differences of other races.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t understand how this expression is so normalised and accepted? What good does it bring to the table?&lt;/p&gt;\n\n&lt;p&gt;Edit: Btw, I’m not from the US, so while we have our own problems, I haven’t experienced the US problems first hand!\nAlso made some corrections (race instead of ethnicity, ups)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/rg66lt/isnt_categorizing_races_into_people_of_color_and/",
  "subreddit": "TooAfraidToAsk",
  "id": "rg66lt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "First of all I accept all races, and judge people by their personality.\n\nI've been thinking a lot about the expression \"People of color\", and I think\nit's a weird expression. I have a few thoughts about it.\n\n 1. It's basically a mild form of racial segregation, separating white people\n    from all…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず、私はすべての人種を受け入れ、人を人格で判断しています。\n\nPeople of color \"という表現について、いろいろ考えてみました。\n変な表現ですね。いくつか思うところがあります。\n\n 1. 基本的に人種隔離の穏やかな形態で、白人を分離することです。\n    すべての...",
      "title": "人種を有色人種と白人に分類するのは、少し差別的ではありませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我接受所有的种族，并以他们的个性来判断人。\n\n我一直在思考 \"有色人种 \"这个说法，我觉得\n这是一个奇怪的表达。我对它有几个想法。\n\n 1. 这基本上是一种温和的种族隔离形式，将白人与所有的人分开。\n    与所有...",
      "title": "把种族分为有色人种和白人，是不是有点种族主义？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我接受所有的種族，並以他們的個性來判斷人。\n\n我一直在思考 \"有色人種 \"這個說法，我覺得\n這是一個奇怪的表達。我對它有幾個想法。\n\n 1. 這基本上是一種溫和的種族隔離形式，將白人與所有的人分開。\n    與所有...",
      "title": "把種族分爲有色人種和白人，是不是有點種族主義？"
    }
  ]
}