{
  "author": "NadxCee",
  "original_created_utc": 1653205930,
  "title": "So people really care what phone I have? My date asked me why I am still using an iPhone 8 Plus, a 4+ year old phone",
  "created_utc": 1653222129,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It works fine, I don’t use it other than to message, check email, YouTube etc. I’m not going to upgrade for another year or two as long as it’s working fine. To be fair I havnt seen another person with an iPhone 8 anymore. &lt;/p&gt;\n\n&lt;p&gt;She also added that “I see you’re not a spender”, I was shocked and didn’t know what to say or think. I’ve never thought someone cares if someone else has the newest phone or still using an old banger.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 125,
  "permalink": "/r/NoStupidQuestions/comments/uv68ox/so_people_really_care_what_phone_i_have_my_date/",
  "subreddit": "NoStupidQuestions",
  "id": "uv68ox",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It works fine, I don’t use it other than to message, check email, YouTube etc.\nI’m not going to upgrade for another year or two as long as it’s working fine.\nTo be fair I havnt seen another person with an iPhone 8 anymore.\n\nShe also added that “I see you’re not a spender”, I was shocked and didn’t…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "メッセージ、メールチェック、YouTubeなど以外には使っていませんが、問題なく使えています。\nこのまま1年か2年はアップグレードするつもりはありません。\n公平に見て、私はもうiPhone 8を持つ別の人を見たことがない。\n\nまた、「あなたはお金を使わない人なんですね」とも言われ、私はショックで何も言えませんでした。",
      "title": "じゃあ、みんな私がどんな携帯電話を持っているか、本当に気にしてるんだ？デートの相手に なぜ4年以上前のiPhone 8 Plusをまだ使っているのかと聞かれました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "它工作得很好，除了留言、查看电子邮件、YouTube等，我不使用它。\n只要它工作正常，我就不打算再升级一两年。\n公平地说，我还没有看到另一个人用iPhone 8了。\n\n她还补充说，\"我看你不是一个花钱的人\"，我很震惊，没有...",
      "title": "那么人们真的关心我有什么手机吗？我的约会对象问我，为什么我还在使用iPhone 8 Plus，一个4年多的旧手机。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "它工作得很好，除了留言、查看電子郵件、YouTube等，我不使用它。\n只要它工作正常，我就不打算再升級一兩年。\n公平地說，我還沒有看到另一個人用iPhone 8了。\n\n她還補充說，\"我看你不是一個花錢的人\"，我很震驚，沒有...",
      "title": "那麼人們真的關心我有什麼手機嗎？我的約會對象問我，爲什麼我還在使用iPhone 8 Plus，一個4年多的舊手機。"
    }
  ]
}