{
  "author": "mikeskeezer31",
  "the_new_excerpt": "I'm debating going all in on NVDA. I had something like 20 shares and I sold\nbefore the earnings announcement, which the stock dropped after, but now has\ncontinued on an uptrend. I'm debating on buying 50 shares before the split. I\nbelieve in the company, the CEO, and the revenue is excellent. They…",
  "original_created_utc": 1622688782,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "NVDAに全力で取り組もうと思っています。20株ほど持っていましたが、決算発表前に売りました。\n決算発表前に売りました。決算発表後、株価は下がりましたが、現在は上昇トレンドを続けています。\n上昇トレンドを続けています。分割前の50株を買おうか迷っています。I\n私はこの会社とCEOを信じていますし、収益も素晴らしいものです。彼らは...",
      "title": "NVDAについてのご意見は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在犹豫是否要全额买入NVDA。我有大约20股，我在财报公布前卖出\n在财报公布前卖出，财报公布后股价下跌，但现在已\n继续保持上升趋势。我正在考虑在分拆前买入50股。I\n我相信这个公司，相信首席执行官，而且收入很好。他们...",
      "title": "你对NVDA有什么看法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在猶豫是否要全額買入NVDA。我有大約20股，我在財報公佈前賣出\n在財報公佈前賣出，財報公佈後股價下跌，但現在已\n繼續保持上升趨勢。我正在考慮在分拆前買入50股。I\n我相信這個公司，相信首席執行官，而且收入很好。他們...",
      "title": "你對NVDA有什麼看法？"
    }
  ],
  "title": "What are your thoughts on NVDA?",
  "created_utc": 1622743444,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m debating going all in on NVDA.  I had something like 20 shares and I sold before the earnings announcement, which the stock dropped after, but now has continued on an uptrend.  I&#39;m debating on buying 50 shares before the split.  I believe in the company, the CEO, and the revenue is excellent.  They are up 83% from the 2020 quarter earnings.  They are the leader in GPUS (by far) and I really feel like this is a solid company, based on the technology and their earnings.  I am debating on investing 33k until the split to see how it goes.  The stock is at an all-time high, but is clearly in an uptrend, with the revenue to back it up.  What are your thoughts on NVDA? Is this a buy? Or is it too high?</p>\n</div><!-- SC_ON -->",
  "score": 45,
  "permalink": "/r/stocks/comments/nr36nr/what_are_your_thoughts_on_nvda/",
  "subreddit": "stocks",
  "id": "nr36nr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404886628
}