{
  "author": "Nostalg33k",
  "original_created_utc": 1632136270,
  "title": "Red Days are the real FOMO time",
  "created_utc": 1632148440,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know we all dream of green lands where red days don&#39;t exist and everyone makes money. Yet, I find that the hardest time as an investor is on red days such as today. I could be buying a lot more if I had my salary but I have to wait a week. In a week this dip will be long gone. </p>\n\n<p>&#x200B;</p>\n\n<p>My missing out feel is not about being late or early. It is about event I see displayed in front of my eyes but on which I have no power to interact.   </p>\n\n<p>Don&#39;t you feel like you miss opportunities when charts are going down ? :)</p>\n</div><!-- SC_ON -->",
  "score": 282,
  "permalink": "/r/CryptoCurrency/comments/prsnac/red_days_are_the_real_fomo_time/",
  "subreddit": "CryptoCurrency",
  "id": "prsnac",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know we all dream of green lands where red days don't exist and everyone makes\nmoney. Yet, I find that the hardest time as an investor is on red days such as\ntoday. I could be buying a lot more if I had my salary but I have to wait a\nweek. In a week this dip will be long gone.\n\n\n\nMy missing out…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちは皆、赤い日が存在せず、誰もがお金を稼げる緑の国を夢見ています。\nを夢見ていることでしょう。しかし、投資家として最も困難なのは、今日のような赤い日だと私は思います。\n今日のように。私の給料があればもっと買えるのですが、1週間待たなければなりません。\n一週間待たなければなりません。一週間後にはこの下げはとっくに終わっているだろう。\n\n\n\n逃してしまった...。",
      "title": "赤い日は本当のFOMOの時間"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道我们都梦想着绿色的土地，那里不存在红日，每个人都能赚钱。\n赚钱。然而，我发现，作为一个投资者，最困难的时候是在红日，比如说\n今天。如果我有工资，我可以买更多的东西，但我必须等待一个\n个星期。一个星期后，这种跌势就会消失很久了。\n\n\n\n我错过了...",
      "title": "红日是真正的FOMO时间"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道我們都夢想着綠色的土地，那裏不存在紅日，每個人都能賺錢。\n賺錢。然而，我發現，作爲一個投資者，最困難的時候是在紅日，比如說\n今天。如果我有工資，我可以買更多的東西，但我必須等待一個\n個星期。一個星期後，這種跌勢就會消失很久了。\n\n\n\n我錯過了...",
      "title": "紅日是真正的FOMO時間"
    }
  ]
}