{
  "author": "SenatusSPQR",
  "the_new_excerpt": "https://preview.redd.it/zkblvgdurs571.png?width=602&format=png&auto=webp&s=6d6af898034a2283f61e8a674b631c3bdec39bb5\n\nHey all. I originally wrote this intended as an article for those new to crypto\nand Nano, but figured you might enjoy it here as well. Comments welcome\n\nFirst off, to understand the…",
  "original_created_utc": 1623923441,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://preview.redd.it/zkblvgdurs571.png?width=602&format=png&auto=webp&s=6d6af898034a2283f61e8a674b631c3bdec39bb5\n\n皆さん、こんにちは。この記事はもともと、暗号やNanoの初心者向けの記事として書いたものです。\nとNanoの初心者向けの記事として書いたものですが、ここでも楽しんでいただけると思います。コメント歓迎\n\nまず最初に、この記事を理解するには...",
      "title": "ナノの基礎知識 - なぜナノはこんなにエキサイティングな暗号なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://preview.redd.it/zkblvgdurs571.png?width=602&format=png&auto=webp&s=6d6af898034a2283f61e8a674b631c3bdec39bb5\n\n大家好。我最初写这篇文章的目的是为那些刚接触加密货币\n和纳米技术的新手，但我想你们在这里也可能会喜欢它。欢迎评论\n\n首先，要了解...",
      "title": "纳米的基本知识--为什么它是如此令人兴奋的加密货币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://preview.redd.it/zkblvgdurs571.png?width=602&format=png&auto=webp&s=6d6af898034a2283f61e8a674b631c3bdec39bb5\n\n大家好。我最初寫這篇文章的目的是爲那些剛接觸加密貨幣\n和納米技術的新手，但我想你們在這裏也可能會喜歡它。歡迎評論\n\n首先，要了解...",
      "title": "納米的基本知識--爲什麼它是如此令人興奮的加密貨幣"
    }
  ],
  "title": "The basics of Nano — why it’s such an exciting crypto",
  "created_utc": 1623933413,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://preview.redd.it/zkblvgdurs571.png?width=602&amp;format=png&amp;auto=webp&amp;s=6d6af898034a2283f61e8a674b631c3bdec39bb5\">https://preview.redd.it/zkblvgdurs571.png?width=602&amp;format=png&amp;auto=webp&amp;s=6d6af898034a2283f61e8a674b631c3bdec39bb5</a></p>\n\n<p><em>Hey all. I originally wrote this intended as an article for those new to crypto and Nano, but figured you might enjoy it here as well. Comments welcome</em></p>\n\n<p>First off, to understand the excitement about Nano, all you need to do is <strong>try it out for yourself, within 2 minutes.</strong></p>\n\n<ol>\n<li>Install <a href=\"https://natrium.io/\">Natrium</a>.</li>\n<li>Visit a <a href=\"https://freenanofaucet.com/\">Nano Faucet</a>.</li>\n<li>Fill in your Nano_ address and hit send.</li>\n</ol>\n\n<p>To fully appreciate Nano’s speed and ease of use, it’s recommended to get a second wallet on the side, like <a href=\"http://www.nault.cc/\">www.nault.cc</a> in your browser, or <a href=\"https://nalli.app/\">Nalli</a> as a second app on your phone. Nano tends to transfer faster than you can switch screens. Try sending some from one wallet to the other and see for yourself. Sending to yourself like this doesn’t seem impressive, but the transfer you just did is possible from and to <strong>anyone, anywhere, anytime</strong>, with no one able to stop your transfer and not a cent paid in fees. It’s secure, borderless and uncensorable money, open to anyone.</p>\n\n<p><strong>A short history of cryptocurrency</strong></p>\n\n<p>Cryptocurrency started with <a href=\"https://www.wired.com/2011/11/mf-bitcoin/\">Bitcoin</a>. Created by <a href=\"https://www.investopedia.com/tech/three-people-who-were-supposedly-bitcoin-founder-satoshi-nakamoto/\">Satoshi Nakamoto</a>, Bitcoin solved the challenge of how to have digital money that could not be copied. It offered a form of money that no one party could print more of, or block transfers of. In doing so it offered a way to transact, internationally, without relying on (central) banks, accessible to anyone with an internet connection.</p>\n\n<p>This was an attractive proposition following 2008. At the time, many banks were being bailed out, while central banks printed a lot of extra currency to support these bailouts. <a href=\"https://www.reuters.com/article/us-ecb-policy-idUSKBN2B22TY\">This money printing hasn’t stopped since</a>, leading many people to conclude that as extra dollars and euros are being printed, the dollars and euros they hold are becoming worth less and less over time.</p>\n\n<p><a href=\"https://preview.redd.it/lmt8phlcss571.png?width=602&amp;format=png&amp;auto=webp&amp;s=e97d3e4b33118a194b057d159c9b38749cc2ed75\">Bitcoin transaction cost and speed</a></p>\n\n<p>However, Bitcoin comes with its own share of issues. Transfers take, on average, <a href=\"https://www.blockchain.com/charts/avg-confirmation-time\">over 2 hours,</a> while being incredibly expensive, and <a href=\"https://senatus.substack.com/p/swap-bitcoin-for-nano-save-the-planet\">Bitcoin uses more energy than some countries</a>. It doesn’t scale, with capacity maxing out at roughly 7 transactions per second, and due to the fees and waiting times is practically unusable as currency. While a beautiful idea, as a means of payment it has failed.</p>\n\n<p><strong>Enter Nano</strong></p>\n\n<p>Nano’s primary developer, Colin LeMahieu, was enthusiastic about the possibilities that a self-sovereign form of money like Bitcoin offered. However, he was frustrated with the inefficiencies in (then) current cryptocurrencies. In 2014, he began development on a new cryptocurrency. The goal was to create a cryptocurrency that could be used for daily payments by everyone, without the <a href=\"https://senatus.substack.com/p/swap-bitcoin-for-nano-save-the-planet\">carbon footprint that comes with Bitcoin</a>.</p>\n\n<blockquote>\n<p><a href=\"https://nano.org/\">Nano makes money efficient for a more equal world — simple to pay with, easy to accept and open to all.</a></p>\n</blockquote>\n\n<p>To accomplish this, Colin came up with a new architecture for Nano. Rather than having one big blockchain, <a href=\"https://www.youtube.com/watch?v=IDEQE8lmaqs\">where everyone competes for space</a> in the next “block” to be mined, Nano utilises something called the <a href=\"https://www.mycryptopedia.com/nano-block-lattice-explained/\">Block Lattice</a>. Instead of competing for space, users add blocks to their own chain and broadcast this addition to the network.</p>\n\n<p><a href=\"https://preview.redd.it/8w1h6l4ass571.png?width=602&amp;format=png&amp;auto=webp&amp;s=5117f85e3cdc8ee4b680525fdfdde07f0e267bc1\">Nano&#39;s block lattice graphic</a></p>\n\n<p>Nano combines the block lattice architecture with <a href=\"https://docs.nano.org/what-is-nano/overview/#representatives-and-voting\">Open Representative Voting</a> (ORV). Every Nano holder votes for a Representative using their Nano balance. Anyone can be a Representative, and anyone can change their vote at any time. These Representatives confirm transactions (67% consensus needed) as soon as they see a transaction, which means that Nano’s speed is mostly limited by internet connection latency (practically the speed of light). This is what allows the Nano network to confirm transactions within a second.</p>\n\n<p>In mining, energy is expended to be the first to mine a block. In Nano, there is no such competition. Because there are no mining rewards and no fees, the network is cooperative. In mining chains, hardware resources are used for competition. In Nano, every available resource is used to confirm transactions as securely and quickly as possible. If Representatives upgrade their hardware, the throughput of the Nano network increases. This focus on pure efficiency and lack of waste makes Nano a green option that uses very little energy.</p>\n\n<p><a href=\"https://preview.redd.it/93nctoe9ss571.png?width=602&amp;format=png&amp;auto=webp&amp;s=ff58d1985b54af130e82ded7707209ebeac742ca\">Nano&#39;s energy usage</a></p>\n\n<p>Summarising, Nano uses a block lattice where each person has their own chain, rather than one big chain. Anyone can add blocks to their own chain, at any time, and Representatives (validators) confirm these transactions as soon as they see them. Because of this, Nano manages to be instant, feeless, scalable, and incredibly energy efficient.</p>\n\n<p><strong>The goal of Nano</strong></p>\n\n<p>Nano is intended to be <a href=\"https://nano.org/\">digital money for the modern world</a>. It was freely given away to anyone willing to solve captchas. Because of this, <a href=\"https://medium.com/nanocurrency/the-nano-faucet-c99e18ae1202\">Nano was distributed</a> broadly and fairly, mostly to people in poorer countries. Because of its feeless nature, it’s well suited for lower-income countries. Because of being instant, it works as a medium of exchange, as money. Because there are no fees and there is no inflation, no money is lost when either <a href=\"https://senatusspqr.medium.com/why-nano-is-the-ultimate-store-of-value-and-reserve-currency-3b0318844bc8\">storing value in Nano</a>, or when using Nano.</p>\n\n<p><a href=\"https://senatus.substack.com/p/the-vision-of-nano-an-instant-feeless\">The vision of Nano</a> is broad. It allows for cheap remittances. Foreign workers pay <a href=\"https://migrationdataportal.org/themes/remittances\">an average of 6.8%</a> in fees to transfer money home. Nano can do this far more efficiently, both at lower cost and faster. It allows merchants to <a href=\"https://www.bitrequest.io/\">start accepting payments</a> anywhere in the world, instantly, without fees. It enables <a href=\"https://np.reddit.com/r/nanocurrency/comments/lrqhmu/i_made_a_twitch_bot_for_nano/\">streamers to receive feeless tips</a>, enables anyone <a href=\"https://npass.dev/npass\">creating art or self-publishing</a> to instantly take small (or large) payments for their works. It enables anyone suffering from hyperinflation to <a href=\"https://senatusspqr.medium.com/why-nano-is-the-ultimate-store-of-value-and-reserve-currency-3b0318844bc8\">securely store their money</a> in a currency whose supply can’t be increased. It allows charities to <a href=\"https://nowpayments.io/supported-coins/nano-payments/\">take donations</a> from all over the world. This means <a href=\"https://coindrop.to/\">less money going to middlemen</a>, and more money arriving directly where it’s needed. Nano makes money efficient, frictionless, secure and borderless.</p>\n\n<p><strong>So why hasn’t this taken off yet?</strong></p>\n\n<p>I’m speculating here, but I think that many people have heard of Bitcoin. If you’ve spoken to someone about cryptocurrency, there’s a good chance they mentioned Bitcoin. Most people see Bitcoin just as an investment. A fraction of those who invest in it actually try to use Bitcoin, and most that do conclude that Bitcoin is slow and clunky. To many people, Bitcoin = cryptocurrency, and therefore all cryptocurrency must be slow and clunky. Nano’s claims seem outlandish after having experienced Bitcoin, and it’s easy to dismiss Nano as too good to be true. Hence my instruction, at the start of this post, on how to try Nano out for free, within 2 minutes. Since you probably skipped over it the first time, I’d like to end this article by saying that you spent so long reading this, you might as well try it out, for free!</p>\n\n<ol>\n<li>Install <a href=\"https://natrium.io/\">Natrium</a>.</li>\n<li>Visit a <a href=\"https://freenanofaucet.com/\">Nano Faucet</a>.</li>\n<li>Fill in your Nano_ address and hit send.</li>\n</ol>\n\n<p>That’s all! To really try it out I’d recommend getting a second wallet such as <a href=\"https://nault.cc/\">Nault (web-based)</a> or <a href=\"https://nalli.app/\">Nalli</a>, then sending some Nano from your first wallet to the second.</p>\n\n<p>Most people that try Nano come into the <a href=\"https://np.reddit.com/r/nanocurrency/\">Nano subreddit</a> asking why Nano isn’t bigger yet. This is exactly why. Most don’t know about Nano yet, most haven’t tried it out yet. Nano has no marketing budget, no ads, no venture capital funding. Its marketing consists of Nano enthusiasts spreading the word, relying on word-of-mouth and organic growth. It relies on businesses starting to accept Nano payments because it saves on costs for them, on people using it because it’s the most efficient option. This tends to start off slower, but given the <a href=\"https://subredditstats.com/r/nanocurrency\">explosive growth in Reddit subscribers</a>, the rapid addition of <a href=\"https://wenano.medium.com/announcing-wenano-business-for-ios-and-android-80bf77b078b8\">businesses accepting Nano</a>, and the constant increase in projects built on Nano it seems faster growth is starting. All it takes to convince someone of Nano’s potential is to have them try it. That seems like a strong potential for growth to me.</p>\n\n<p><em>I hope this article helped answer some basic questions about Nano. We Nano enthusiasts welcome anyone who wants to talk about Nano on</em> <a href=\"http://np.reddit.com/r/nanocurrency\"><em>www.reddit.com/r/nanocurrency</em></a><em>.</em> </p>\n\n<p><em>Thanks for reading, comments and questions are always very welcome!</em></p>\n</div><!-- SC_ON -->",
  "score": 2940,
  "permalink": "/r/CryptoCurrency/comments/o1texp/the_basics_of_nano_why_its_such_an_exciting_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "o1texp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009741217
}