{
  "approved_at_utc": null,
  "subreddit": "Bogleheads",
  "selftext": "I see a growing number of Bogleheads on this sub and bogleheads forum taking too much risk with their portfolios. While there might be genuine reasons to do so, **let's not fool ourselves into believing that we are fundamentally different from folks who were investing 10, 20 or 30 years ago.**\n\nWhen we are building a ship and planning to keep afloat in storms, we don't say to ourselves that we will *just act differently* than others when the storm comes. We build a *better* ship that will improve our chances to withstand a storm when it comes. Your portfolio is that ship. Invest some time now to build a better balanced portfolio, rather than just relying on your guts to *do the right thing*.\n\nImagine this: When the stock market is crashing for 3-5 years, and everyone is saying that this time it is different, **it's extremely hard to stay the course**. You can tell yourself, \"Oh, I'm a long-term investor\". But, 2 years later, everyone around you who sold all their stocks is doing extremely well, and you are sitting on huge losses, it is hard to not start doubting yourself and everything you believe in. Experts and other bogleheads are saying for 2 years+ that you should not assume the previous lessons apply anymore, and they have been right for the last 3-5 years. It is extreme hard to ignore all that. **Many folks before you doubted themselves, and you are very likely to do so in the same circumstances**. \n\nAll the posts I'm seeing right now are typical and all this has happened before. Many of us **will** not stay the course when the next big crash comes - it is inevitable. When fund managers with their PhDs in finance who are investing \"someone else's money\" are not immune; we who are investing **our hard earned money** are definitely not immune. \n\nIf you are not convinced, try a thought experiment: We know that expected returns for Intl are higher than US. How many of us will have the nerves right now to increase Intl stock allocation (I don't). How about 100% Intl? I could make the same argument for SCV as well. 10-15years ago many folks were doing 100% SCV. Where are they now? (**To be clear, I am not suggesting anyone hold 100% Intl or 100% SCV).**  \n\nRight now is a great time to build a better \"ship\" rather than doing it when you are already in a \"storm\". Right now is a great time to re-read classic books on portfolio theory. Please, don't hold 100% US based on recent performance and reliance on your guts and knowledge. Add some Intl (at least 20%), add some bonds (at least 20-25%), **especially if you started investing after 2009**. Please don't just try to maximize return based on 10 years of history; please take a look at your portfolio's risk &amp; uncertainty, and try to control it as well.\n\nAnd, remember, all of us are average, on average :-).",
  "author_fullname": "t2_amogqwms",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "PSA: We are average, on average.",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/Bogleheads",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": true,
  "name": "t3_rhxbgu",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.95,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 365,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 365,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1639681645,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1639680705,
  "link_flair_type": "text",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.Bogleheads",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I see a growing number of Bogleheads on this sub and bogleheads forum taking too much risk with their portfolios. While there might be genuine reasons to do so, &lt;strong&gt;let&amp;#39;s not fool ourselves into believing that we are fundamentally different from folks who were investing 10, 20 or 30 years ago.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;When we are building a ship and planning to keep afloat in storms, we don&amp;#39;t say to ourselves that we will &lt;em&gt;just act differently&lt;/em&gt; than others when the storm comes. We build a &lt;em&gt;better&lt;/em&gt; ship that will improve our chances to withstand a storm when it comes. Your portfolio is that ship. Invest some time now to build a better balanced portfolio, rather than just relying on your guts to &lt;em&gt;do the right thing&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;Imagine this: When the stock market is crashing for 3-5 years, and everyone is saying that this time it is different, &lt;strong&gt;it&amp;#39;s extremely hard to stay the course&lt;/strong&gt;. You can tell yourself, &amp;quot;Oh, I&amp;#39;m a long-term investor&amp;quot;. But, 2 years later, everyone around you who sold all their stocks is doing extremely well, and you are sitting on huge losses, it is hard to not start doubting yourself and everything you believe in. Experts and other bogleheads are saying for 2 years+ that you should not assume the previous lessons apply anymore, and they have been right for the last 3-5 years. It is extreme hard to ignore all that. &lt;strong&gt;Many folks before you doubted themselves, and you are very likely to do so in the same circumstances&lt;/strong&gt;. &lt;/p&gt;\n\n&lt;p&gt;All the posts I&amp;#39;m seeing right now are typical and all this has happened before. Many of us &lt;strong&gt;will&lt;/strong&gt; not stay the course when the next big crash comes - it is inevitable. When fund managers with their PhDs in finance who are investing &amp;quot;someone else&amp;#39;s money&amp;quot; are not immune; we who are investing &lt;strong&gt;our hard earned money&lt;/strong&gt; are definitely not immune. &lt;/p&gt;\n\n&lt;p&gt;If you are not convinced, try a thought experiment: We know that expected returns for Intl are higher than US. How many of us will have the nerves right now to increase Intl stock allocation (I don&amp;#39;t). How about 100% Intl? I could make the same argument for SCV as well. 10-15years ago many folks were doing 100% SCV. Where are they now? (&lt;strong&gt;To be clear, I am not suggesting anyone hold 100% Intl or 100% SCV).&lt;/strong&gt;  &lt;/p&gt;\n\n&lt;p&gt;Right now is a great time to build a better &amp;quot;ship&amp;quot; rather than doing it when you are already in a &amp;quot;storm&amp;quot;. Right now is a great time to re-read classic books on portfolio theory. Please, don&amp;#39;t hold 100% US based on recent performance and reliance on your guts and knowledge. Add some Intl (at least 20%), add some bonds (at least 20-25%), &lt;strong&gt;especially if you started investing after 2009&lt;/strong&gt;. Please don&amp;#39;t just try to maximize return based on 10 years of history; please take a look at your portfolio&amp;#39;s risk &amp;amp; uncertainty, and try to control it as well.&lt;/p&gt;\n\n&lt;p&gt;And, remember, all of us are average, on average :-).&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2shb7",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "rhxbgu",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "Naive_Salary_2170",
  "discussion_type": null,
  "num_comments": 6,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/Bogleheads/comments/rhxbgu/psa_we_are_average_on_average/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/Bogleheads/comments/rhxbgu/psa_we_are_average_on_average/",
  "subreddit_subscribers": 120022,
  "created_utc": 1639685477,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1639680705,
  "the_new_excerpt": "I see a growing number of Bogleheads on this sub and bogleheads forum taking too\nmuch risk with their portfolios. While there might be genuine reasons to do so,\nlet's not fool ourselves into believing that we are fundamentally different from\nfolks who were investing 10, 20 or 30 years ago.\n\nWhen we…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブとボーグルヘッズフォーラムでは、ボーグルヘッズが増えすぎているように見受けられます。\nポートフォリオに大きなリスクを負っている。そうする正当な理由があるのかもしれない。\nとは根本的に違うのだと、自分を誤魔化さないようにしましょう。\n10年前、20年前、30年前に投資をしていた人たちです。\n\n私たちが...",
      "title": "PSA：私たちは平均的な、平均的な存在です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到越来越多的Bogleheads在这个分论坛和Bogleheads论坛上采取了太多的风险。\n在他们的投资组合中承担了太多的风险。虽然这样做可能有真正的原因。\n我们不要自欺欺人地认为我们与那些在10年、20年或20年后才开始投资的人有着本质上的区别。\n10年、20年或30年前投资的人根本不同。\n\n当我们...",
      "title": "PSA：我们是平均水平，平均而言。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到越來越多的Bogleheads在這個分論壇和Bogleheads論壇上採取了太多的風險。\n在他們的投資組合中承擔了太多的風險。雖然這樣做可能有真正的原因。\n我們不要自欺欺人地認爲我們與那些在10年、20年或20年後纔開始投資的人有着本質上的區別。\n10年、20年或30年前投資的人根本不同。\n\n當我們...",
      "title": "PSA：我們是平均水平，平均而言。"
    }
  ],
  "source_updated_at": 1640338930452
}