{
  "author": "rohitsanyal",
  "original_created_utc": 1628443892,
  "title": "All these karma limiting proposals are a bit unfair to new guys like me",
  "created_utc": 1628461837,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I get it. Spamming and moon farming is an issue but I have been seeing many proposals/pre proposals both here and in the meta sub reddit which seem very unfair to the new guys. </p>\n\n<p>If we keep finding new ways to limit karma then the rich stay rich while folks like me will find it increasingly hard to get even close to a whale status.</p>\n\n<p>The Karma to Moon conversion ratio is falling sharply and while that is acceptable as its because of increasing engagement. Proposals like 50% Daily thread karma, limiting karma to 5 posts etc are unfair.</p>\n\n<p>I know I am late to the party and pioneers always get the better deal but so many restrictions seems like just gatekeeping from the Whales.</p>\n\n<p>&lt;&lt;Plz don&#39;t remove/delete this post&gt;&gt;</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/p0iy7w/all_these_karma_limiting_proposals_are_a_bit/",
  "subreddit": "CryptoCurrency",
  "id": "p0iy7w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I get it. Spamming and moon farming is an issue but I have been seeing many\nproposals/pre proposals both here and in the meta sub reddit which seem very\nunfair to the new guys.\n\nIf we keep finding new ways to limit karma then the rich stay rich while folks\nlike me will find it increasingly hard to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "わかったよ。スパム行為やムーンファーミングは問題ですが、ここやmeta sub redditでは多くの\nこことmeta sub redditの両方で多くの提案/予備提案を見てきましたが、これらは新参者にとって非常に不公平に見えます。\n新人にはとても不公平に見えます。\n\nもしカルマを制限する新しい方法を見つけ続けるなら、金持ちは金持ちのままで、私のような人は\n私のような者はますます困難になるでしょう...",
      "title": "このようなカルマ制限の提案は、私のような新参者には少し不公平です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我明白了。垃圾邮件和月球耕作是一个问题，但我已经看到了许多\n建议/预建议，无论是在这里还是在meta sub reddit，这似乎对新人非常\n对新人不公平。\n\n如果我们继续寻找新的方法来限制因果报应，那么富人就会一直富下去，而像我这样的人就会发现越来越难。\n而像我这样的人则会发现越来越难...",
      "title": "所有这些限制业力的提议对像我这样的新人有点不公平。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我明白了。垃圾郵件和月球耕作是一個問題，但我已經看到了許多\n建議/預建議，無論是在這裏還是在meta sub reddit，這似乎對新人非常\n對新人不公平。\n\n如果我們繼續尋找新的方法來限制因果報應，那麼富人就會一直富下去，而像我這樣的人就會發現越來越難。\n而像我這樣的人則會發現越來越難...",
      "title": "所有這些限制業力的提議對像我這樣的新人有點不公平。"
    }
  ]
}