{
  "author": "satinkzo",
  "original_created_utc": 1636932453,
  "title": "Lost faith in Cardano. Looking for opinions",
  "created_utc": 1636947517,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As title says.  I was big on cardano for a while but the more I read the lower my mood goes on it.  If I&#39;m missing something that should keep me invested please let me know.   I&#39;m just not seeing anything that hasn&#39;t already been done by others and sometimes better by others.   I really wanted it to work, it&#39;s not me, it&#39;s ADA.</p>\n\n<p>What are some things to look into that aren&#39;t Algo, Dot, Lrc, Eth,Btc, cro, amp, atom (already in these).   I&#39;m looking at Long term hodl, not a flip or meme coin either.  I may just roll it into my existing projects but I&#39;ve been a bit disconnected on research lately.   </p>\n\n<p>Don&#39;t need shill posts.  Just want to see what others see as something for me to read into.</p>\n\n<p>Edit: \nthanks all.  Made my move.  Took my gains from Ada, went to another playground.  Need to see innovation not imitation.  </p>\n\n<p>No hard feeling Charles.  You insulted us all enough in public to even care anymore.    Wish Ada the best in Africa.</p>\n</div><!-- SC_ON -->",
  "score": 184,
  "permalink": "/r/CryptoCurrency/comments/qu2euh/lost_faith_in_cardano_looking_for_opinions/",
  "subreddit": "CryptoCurrency",
  "id": "qu2euh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As title says. I was big on cardano for a while but the more I read the lower my\nmood goes on it. If I'm missing something that should keep me invested please\nlet me know. I'm just not seeing anything that hasn't already been done by\nothers and sometimes better by others. I really wanted it to work,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルの通りです。私は一時期カルダノに注目していましたが、読めば読むほど気分が落ち込みます。\n気分が悪くなってきました。もし、私が投資を続けるべき何かを見逃しているのであれば\n教えてください。他の人がやっていないことは何も見当たらないのですが\n他の人がやっていないこと、時には他の人の方が優れていることが見当たりません。本当はうまくいってほしかったのですが・・・。",
      "title": "カルダノへの信頼を失った 意見を聞きたい"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说。我曾有一段时间很喜欢卡达诺，但我越看越不喜欢。\n我对它的情绪就越低落。如果我错过了一些应该让我投资的东西，请\n让我知道。我只是没有看到有什么东西是别人没有做过的。\n别人已经做了，而且有时做得更好。我真的希望它能发挥作用，...",
      "title": "对Cardano失去信心。征求意见"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說。我曾有一段時間很喜歡卡達諾，但我越看越不喜歡。\n我對它的情緒就越低落。如果我錯過了一些應該讓我投資的東西，請\n讓我知道。我只是沒有看到有什麼東西是別人沒有做過的。\n別人已經做了，而且有時做得更好。我真的希望它能發揮作用，...",
      "title": "對Cardano失去信心。徵求意見"
    }
  ]
}