{
  "author": "Holstynator",
  "the_new_excerpt": "It still feels so surreal to me. What do they care what I do with my money?\n\nObviously the clerk couldn't tell me what would happen, if I kept using my bank\naccount to shop on Binance. I also assume someone higher up the chain saw the\ndanger DeFi poses for the banking system.\n\nHonestly, fuck 'em.…",
  "original_created_utc": 1623859600,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今でもとてもシュールな感じがします。彼らは私が自分のお金をどうしようと気にしているのだろうか？\n\nもし私が銀行口座を使ってBinanceで買い物をし続けたらどうなるのか、店員は明らかに教えてくれませんでした。\n明らかに店員は、私が銀行口座を使ってBinanceで買い物をし続ければどうなるか、わからなかったでしょう。また、銀行の上層部の誰かが、DeFiが銀行に与える危険性を察知したのだと思います。\nDeFiが銀行システムにもたらす危険性を見抜いていたと思います。\n\n正直なところ、クソッタレです....",
      "title": "今日、私の銀行から電話があり、\"顧客がビットコインを購入することをサポートしていない \"と言われました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这对我来说仍然感觉很不真实。他们怎么会关心我的钱呢？\n\n很明显，那个职员不能告诉我，如果我继续用我的银行账户去买东西，会发生什么事？\n帐户在Binance上购物。我还假设有更高层次的人看到了\nDeFi给银行系统带来的危险。\n\n说实话，去他们的....",
      "title": "我的银行今天打电话给我，告诉我他们 \"不支持他们的客户购买比特币\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這對我來說仍然感覺很不真實。他們怎麼會關心我的錢呢？\n\n很明顯，那個職員不能告訴我，如果我繼續用我的銀行賬戶去買東西，會發生什麼事？\n帳戶在Binance上購物。我還假設有更高層次的人看到了\nDeFi給銀行系統帶來的危險。\n\n說實話，去他們的....",
      "title": "我的銀行今天打電話給我，告訴我他們 \"不支持他們的客戶購買比特幣\""
    }
  ],
  "title": "My bank called me today to tell me they \"don't support their clients buying Bitcoin\"",
  "created_utc": 1623875421,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It still feels so surreal to me. What do they care what I do with my money?</p>\n\n<p>Obviously the clerk couldn&#39;t tell me what would happen, if I kept using my bank account to shop on Binance. I also assume someone higher up the chain saw the danger DeFi poses for the banking system.</p>\n\n<p>Honestly, fuck &#39;em. I&#39;m still so irritated by the call, but it proves once again why we need Bitcoin. Sunk the rest of my fiat into Crypto right after the call ended.</p>\n\n<p>Anyone else with similar experience? I&#39;m from Europe, btw.</p>\n</div><!-- SC_ON -->",
  "score": 978,
  "permalink": "/r/Bitcoin/comments/o18dvc/my_bank_called_me_today_to_tell_me_they_dont/",
  "subreddit": "Bitcoin",
  "id": "o18dvc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009736003
}