{
  "author": "ihopemyfriendslikeme",
  "original_created_utc": 1637804244,
  "title": "Market Cap should be one of if not the biggest factor to consider when looking for new coins to invest in.",
  "created_utc": 1637815614,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m sure what I’m about to say is nothing new for most people here, but for people who are just joining the space I wanted to make a quick post to discuss market cap. </p>\n\n<p>Too many times I’ve spoken to people who have seen the potential investing in crypto provides. I think it’s very easy to get swept up in napkin math when investing in new coins and thinking “if I buy a hundred thousand coins at .005 and they go to one dollar I’ll have one hundred thousand dollars.”</p>\n\n<p>While the math adds up, you have to consider that in order for a coin to grow the market cap (coin amount outstanding x coin price) has to grow at the same rate. For a lot of these alt coins with hundreds of billions of coins in circulation this is a huge ask. Shiba was a great example of this: a lot of people thought shiba could reach $1 as doge did and plain and simply it could not. Total supply of shiba is 550 trillion coins so you would need a market cap of $550T to reach this price. </p>\n\n<p>Again, I’m sure none of this is new for most experienced investors here but newbies please take note. I like to look for coins with around $1-5B in market cap and a similarly sized total supply. This gives me a reasonable expectation of growth as well as a basic understanding of my price targets. This simple consideration has served me well on my crypto journey and I hope it can help you too!</p>\n</div><!-- SC_ON -->",
  "score": 184,
  "permalink": "/r/CryptoCurrency/comments/r1kpdy/market_cap_should_be_one_of_if_not_the_biggest/",
  "subreddit": "CryptoCurrency",
  "id": "r1kpdy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m sure what I’m about to say is nothing new for most people here, but for\npeople who are just joining the space I wanted to make a quick post to discuss\nmarket cap.\n\nToo many times I’ve spoken to people who have seen the potential investing in\ncrypto provides. I think it’s very easy to get swept…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今から言うことは、ここにいるほとんどの人にとって新しいことではないと思いますが、このスペースに参加したばかりの人のために\nしかし、この分野に参加したばかりの人のために、私はマーケットキャップについて簡単に説明したいと思います。\nマーケットキャップについて。\n\n暗号への投資に可能性を感じている人たちと何度も話をしてきました。\n可能性を感じている人たちと話したことがあります。私が思うに、非常に簡単に流されてしまう...",
      "title": "時価総額は、投資する新しいコインを探す際に、最大ではないにしても考慮すべき要素の一つであるはずです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信我要说的对这里的大多数人来说并不新鲜，但对于刚刚加入这个空间的人来说，我想说的是\n但对于刚刚加入这个领域的人来说，我想发一个简短的帖子来讨论一下\n市值。\n\n我曾多次与那些看到投资加密货币的潜力的人交谈。\n潜力的人交谈过很多次。我认为这很容易被卷进...",
      "title": "在寻找新的投资币时，市值应该是考虑的最大因素之一，如果不是的话。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信我要說的對這裏的大多數人來說並不新鮮，但對於剛剛加入這個空間的人來說，我想說的是\n但對於剛剛加入這個領域的人來說，我想發一個簡短的帖子來討論一下\n市值。\n\n我曾多次與那些看到投資加密貨幣的潛力的人交談。\n潛力的人交談過很多次。我認爲這很容易被捲進...",
      "title": "在尋找新的投資幣時，市值應該是考慮的最大因素之一，如果不是的話。"
    }
  ]
}