{
  "author": "unonameless",
  "original_created_utc": 1656956188,
  "title": "Does Kamala Khan's (Ms. Marvel) family speaking Hindi make sense?",
  "created_utc": 1656966298,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Kamala Khan&amp;#39;s family are Pakistani muslim immigrants living in New Jersey. When they talk to each other, their language is identified as Hindi. Big part of their characters background is their experience during the Partition.&lt;/p&gt;\n\n&lt;p&gt;How likely would any of this be in the real world? Were Hindu-speaking Muslims common in India and how would they end up in Pakistan during the Partition? Would they identify as Pakistani? Would it make more sense for these characters to speak Urdu?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/vrcsed/does_kamala_khans_ms_marvel_family_speaking_hindi/",
  "subreddit": "AskHistorians",
  "id": "vrcsed",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Kamala Khan's family are Pakistani muslim immigrants living in New Jersey. When\nthey talk to each other, their language is identified as Hindi. Big part of\ntheir characters background is their experience during the Partition.\n\nHow likely would any of this be in the real world? Were Hindu-speaking…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "カマラ・カーンの家族は、ニュージャージーに住むパキスタン系イスラム教徒の移民です。彼らが互いに話すとき\nヒンディー語であることがわかります。の大きな部分を占めています。\n彼らのキャラクターの背景には、分割統治時代の体験があります。\n\nこのようなことは、現実の世界ではどの程度あり得ることなのでしょうか？ヒンズー教を話す人たちは...。",
      "title": "カマラ・カーン（Ms.Marvel）の家族がヒンディー語を話すことは意味があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "卡马拉-汗的家人是居住在新泽西的巴基斯坦穆斯林移民。当\n他们互相交谈时，他们的语言被认定为印地语。他们的很大一部分\n他们的人物背景很大一部分是他们在分治期间的经历。\n\n在现实世界中，这一切有多大可能？如果讲印度语的人...",
      "title": "卡马拉-汗（Ms. Marvel）的家人说印地语有意义吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "卡馬拉-汗的家人是居住在新澤西的巴基斯坦穆斯林移民。當\n他們互相交談時，他們的語言被認定爲印地語。他們的很大一部分\n他們的人物背景很大一部分是他們在分治期間的經歷。\n\n在現實世界中，這一切有多大可能？如果講印度語的人...",
      "title": "卡馬拉-汗（Ms. Marvel）的家人說印地語有意義嗎？"
    }
  ]
}