{
  "author": "ruffneck007",
  "original_created_utc": 1631035850,
  "title": "If you sold during this \"crash\" BTC is not for you..",
  "created_utc": 1631072033,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>From a long time holder, this is perfectly normal. If you can&#39;t stomach these small dips you&#39;re better of with safer investments like apple or ms stocks. </p>\n\n<p>If you believe in BTC just hold and zoom out on the chart. There is and will always be a lot of noise and shakedowns that will try to steal your BTC away from your wallet. Don&#39;t let them.</p>\n\n<p>We&#39;re still in a bullrun and everything is fine but prepare yourself for a lot of small dips before we reach the top.</p>\n</div><!-- SC_ON -->",
  "score": 185,
  "permalink": "/r/Bitcoin/comments/pjrqsr/if_you_sold_during_this_crash_btc_is_not_for_you/",
  "subreddit": "Bitcoin",
  "id": "pjrqsr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "From a long time holder, this is perfectly normal. If you can't stomach these\nsmall dips you're better of with safer investments like apple or ms stocks.\n\nIf you believe in BTC just hold and zoom out on the chart. There is and will\nalways be a lot of noise and shakedowns that will try to steal your…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "長い間持っている人からすれば、これは至極当たり前のことです。このような小さなディップに耐えられないのであれば\nこのような小さなディップに耐えられないのであれば、アップルやマイクロソフトの株のような安全な投資をした方が良いでしょう。\n\nBTCを信じているのであれば、ホールドしてチャートを拡大してみてください。今もこれからも\nそしてこれからも、あなたのBTCを奪おうとする多くのノイズやシェイクダウンがあるでしょう。",
      "title": "この \"クラッシュ \"で売った人には、BTCは向いていないと思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "从一个长期持有者来看，这是很正常的。如果你不能忍受这些\n小幅下跌，你最好选择更安全的投资，如苹果或美联储股票。\n\n如果你相信BTC，就持有并放大图表。现在和将来\n总是会有很多噪音和洗牌，会试图偷走你的钱。",
      "title": "如果你在这次 \"崩溃 \"中卖出，BTC不适合你。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從一個長期持有者來看，這是很正常的。如果你不能忍受這些\n小幅下跌，你最好選擇更安全的投資，如蘋果或美聯儲股票。\n\n如果你相信BTC，就持有並放大圖表。現在和將來\n總是會有很多噪音和洗牌，會試圖偷走你的錢。",
      "title": "如果你在這次 \"崩潰 \"中賣出，BTC不適合你。"
    }
  ]
}