{
  "author": "ExcellentNoThankYou",
  "the_new_excerpt": "In a recent note to clients, strategists from JPMorgan (NYSE:JPM) suggested a\none percent portfolio allocation to Bitcoin and other cryptocurrencies.\n\nAs reported by Bloomberg, JPM strategists Joyce Chang and Amy Ho opined that\nBitcoin could serve as a hedge against fluctuations from traditional…",
  "original_created_utc": 1614373174,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "摩根大通(NYSE:JPM)的策略师在最近给客户的一份说明中建议。\n1%的投资组合分配给比特币和其他加密货币。\n\n据彭博社报道，JPM策略师Joyce Chang和Amy Ho认为。\n比特币可以作为对冲传统货币波动的...",
      "title": "摩根大通建议客户将其投资组合的1%暴露在比特币上。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "摩根大通(NYSE:JPM)的策略師在最近給客戶的一份說明中建議。\n1%的投資組合分配給比特幣和其他加密貨幣。\n\n據彭博社報道，JPM策略師Joyce Chang和Amy Ho認爲。\n比特幣可以作爲對沖傳統貨幣波動的...",
      "title": "摩根大通建議客戶將其投資組合的1%暴露在比特幣上。"
    }
  ],
  "title": "JPMorgan advises clients to expose 1% of their portfolio to Bitcoin",
  "created_utc": 1614378365,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In a recent note to clients, strategists from JPMorgan (NYSE:JPM) suggested a one percent portfolio allocation to Bitcoin and other cryptocurrencies.</p>\n\n<p>As reported by Bloomberg, JPM strategists Joyce Chang and Amy Ho opined that Bitcoin could serve as a hedge against fluctuations from traditional assets like bonds, stocks, and commodities. However, they advised clients to allocate a small percentage due to the risk of major downturns in Bitcoin’s value.</p>\n\n<p>After setting a new all-time high above $58,000, the value of the digital asset slumped to less than $45,000 and has been struggling to recover ever since.</p>\n\n<p>Chang and Ho told investors:</p>\n\n<blockquote>\n<p><em>In a multi-asset portfolio, investors can likely add up to 1% of their allocation to cryptocurrencies in order to achieve any efficiency gain in the overall risk-adjusted returns of the portfolio.</em></p>\n</blockquote>\n\n<p>Bitcoin has welcomed major investments from the likes of Paul Tudor Jones, Tesla (NASDAQ:TSLA), and MicroStrategy. The endorsement from JPM comes at a time when institutional players are rushing to accumulate the digital asset. As per Bloomberg’s report, America’s oldest bank BNY Mellon (NYSE:BK) has also announced plans to enable Bitcoin transactions for its clients.</p>\n\n<p>The strategists were quick to add that cryptocurrencies should be viewed as an investment vehicle and opposed to being funding currencies like the USD or EUR. This appears to be contrary to earlier statements from other JPM analysts that called cryptocurrencies the “poorest hedge for major drawdowns in equities.”</p>\n\n<p><a href=\"https://www.investing.com/news/cryptocurrency-news/jpmorgan-advises-clients-to-expose-1-of-their-portfolio-to-bitcoin-2431724\">https://www.investing.com/news/cryptocurrency-news/jpmorgan-advises-clients-to-expose-1-of-their-portfolio-to-bitcoin-2431724</a></p>\n</div><!-- SC_ON -->",
  "score": 4632,
  "permalink": "/r/investing/comments/lt7oop/jpmorgan_advises_clients_to_expose_1_of_their/",
  "subreddit": "investing",
  "id": "lt7oop",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937740748
}