{
  "author": "NineteenSixtySix",
  "the_new_excerpt": "https://twitter.com/PalantirTech/status/1387764219060293649?s=20\n\n7:42 AM - Apr 29, 2021\n\nBoston-based Syntropy will create a digital platform that allows cancer\nresearchers to share and analyze data from numerous different organizations.\n\nMerck KGaA, Darmstadt, and Silicon Valley-area big data…",
  "original_created_utc": 1619704360,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://twitter.com/PalantirTech/status/1387764219060293649?s=20\n\n午前7時42分 - 2021年4月29日\n\nボストンを拠点とするSyntropy社は、がん研究者が様々な組織のデータを共有し、分析するためのデジタルプラットフォームを構築します。\n癌研究者が多数の異なる組織からのデータを共有・分析できるデジタルプラットフォームを構築します。\n\nMerck KGaA（ダルムシュタット）とシリコンバレー地域のビッグデータ...",
      "title": "パランティアの新しいジョイントベンチャーは、がん研究のデータサイロを破壊することを目指しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://twitter.com/PalantirTech/status/1387764219060293649?s=20\n\n7:42 AM - 2021年4月29日\n\n总部位于波士顿的Syntropy公司将创建一个数字平台，使癌症研究人员能够分享和分析来自许多不同组织的数据。\n研究人员分享和分析来自许多不同组织的数据。\n\n位于达姆施塔特的默克公司和硅谷地区的大数据...",
      "title": "Palantir公司的新合资企业希望打破癌症研究的数据孤岛"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://twitter.com/PalantirTech/status/1387764219060293649?s=20\n\n7:42 AM - 2021年4月29日\n\n總部位於波士頓的Syntropy公司將創建一個數字平臺，使癌症研究人員能夠分享和分析來自許多不同組織的數據。\n研究人員分享和分析來自許多不同組織的數據。\n\n位於達姆施塔特的默克公司和硅谷地區的大數據...",
      "title": "Palantir公司的新合資企業希望打破癌症研究的數據孤島"
    }
  ],
  "title": "Palantir's new joint venture looks to tear down cancer research data silos",
  "created_utc": 1619710157,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://twitter.com/PalantirTech/status/1387764219060293649?s=20\">https://twitter.com/PalantirTech/status/1387764219060293649?s=20</a></p>\n\n<p>7:42 AM - Apr 29, 2021</p>\n\n<p>Boston-based Syntropy will create a digital platform that allows cancer researchers to share and analyze data from numerous different organizations.</p>\n\n<p>Merck KGaA, Darmstadt, and Silicon Valley-area big data company Palantir Technologies announced a joint venture that will focus on building an analytics and collaborative technology platform for cancer researchers.</p>\n\n<p>Called Syntropy, the Boston-based effort will rely on Palantir Foundry to power its data integration platform. Any research data shared across participating groups will be transparent and secure, according to the companies, with the participating institutions maintaining ownership of their data.</p>\n\n<p>&quot;Unlocking the power of scientific data is critical to advancing the fight against cancer,&quot; Alexander Karp, Palantir cofounder and CEO, said in a statement. &quot;Syntropy aims to help researchers collaborate securely to realize the value of this data, driving discoveries that will deliver better treatments to patients faster.”</p>\n\n<p>Why it matters</p>\n\n<p>Numerous hospitals and research institutions are actively conducting cancer research, but the data they are generating is often limited to their own organization. Syntropy’s collaborative platform would looks to be a collective ecosystem that houses these research data and facilitates cross-institution analyses to drive new breakthroughs in cancer research and care.</p>\n</div><!-- SC_ON -->",
  "score": 1967,
  "permalink": "/r/stocks/comments/n14tdv/palantirs_new_joint_venture_looks_to_tear_down/",
  "subreddit": "stocks",
  "id": "n14tdv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380966996
}