{
  "author": "drytendies",
  "original_created_utc": 1636853865,
  "title": "Everything you need to know about the Taproot Upgrade to Bitcoin in about 1 minute!",
  "created_utc": 1636885852,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Biggest upgrade to the Bitcoin network since 2017</p>\n\n<p>Unlike most Bitcoin upgrades, this one has had little to no strife; The community is excited!</p>\n\n<p>BIP 340- A cryptographic program that makes difficult transactions more safe and secure.</p>\n\n<p>BIP 341- improves the SegWit upgrade by making it more private and lowering transaction fees.</p>\n\n<p>BIP 342- reforms Bitcoin&#39;s scripting language and introduces &quot;Tapscript,&quot; which changes how signatures are evaluated. (not sure of the implications).</p>\n\n<p>In sum, cheaper transactions, more secure and private, and more scalable. Although, this upgrade isn’t massive, it’s laying the groundwork for future plans.</p>\n\n<p>Happy HODLing!</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/CryptoCurrency/comments/qtf3yy/everything_you_need_to_know_about_the_taproot/",
  "subreddit": "CryptoCurrency",
  "id": "qtf3yy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Biggest upgrade to the Bitcoin network since 2017\n\nUnlike most Bitcoin upgrades, this one has had little to no strife; The\ncommunity is excited!\n\nBIP 340- A cryptographic program that makes difficult transactions more safe and\nsecure.\n\nBIP 341- improves the SegWit upgrade by making it more private…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2017年以降、ビットコインネットワークに最大のアップグレードを実施\n\nほとんどのビットコインのアップグレードとは異なり、今回のアップグレードでは争いがほとんどなく、そのことに\nコミュニティは興奮しています\n\nBIP340- 難しい取引をより安全でセキュアなものにする暗号化プログラム。\n安全なものにします。\n\nBIP 341- SegWitのアップグレードを、よりプライベートなものにすることで改善する...",
      "title": "約1分でわかる！ タップルート・アップグレードでビットコインのすべてがわかる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "2017年以来比特币网络的最大升级\n\n与大多数的比特币升级不同，这次的升级几乎没有什么纷争；社区很兴奋。\n社区很兴奋!\n\nBIP 340- 一个加密程序，使困难的交易更加安全和有保障。\n安全。\n\nBIP 341- 改进了SegWit的升级，使其更加隐私...",
      "title": "关于Taproot升级到比特币，你需要知道的一切都在1分钟之内!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2017年以來比特幣網絡的最大升級\n\n與大多數的比特幣升級不同，這次的升級幾乎沒有什麼紛爭；社區很興奮。\n社區很興奮!\n\nBIP 340- 一個加密程序，使困難的交易更加安全和有保障。\n安全。\n\nBIP 341- 改進了SegWit的升級，使其更加隱私...",
      "title": "關於Taproot升級到比特幣，你需要知道的一切都在1分鐘之內!"
    }
  ]
}