{
  "author": "eskideji",
  "original_created_utc": 1643263679,
  "title": "I started to make something I needed to make a long time ago - Weekliner.com",
  "created_utc": 1643269313,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For years I&amp;#39;ve been printing out papers with a weekly table format, writing out my tasks for the week in a semi-structured manor. I tried using digital platforms, but they never gave me the exact layout I wanted (looking at you Google cal). I tried recreating things in editor type platforms like Notion, but I&amp;#39;d always find myself spending more time trying to set it up and manage its design than doing any actual planning.&lt;/p&gt;\n\n&lt;p&gt;After not finding any major alternatives to do what I wanted, I decided to just build it myself. I laid out some basic requirements, and used a ui framework to prototype quickly. Found a good name with a .com ending, and alas began the development of &lt;a href=\"https://www.weekliner.com\"&gt;www.weekliner.com&lt;/a&gt; (screenshot below)&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/1r0mmw5k66e81.png?width=2936&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=7ab0e628a5faa3f51bc845d7bf1e01d1709d5875\"&gt;Screenshot of weekliner&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The app is still quite limited in functionality (you can&amp;#39;t even sign up yet), but after asking some friends around I realized something like this could potentially help a lot of people get things organized.&lt;/p&gt;\n\n&lt;p&gt;My vision:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;a simple no frills weekly planner to get organized&lt;/li&gt;\n&lt;li&gt;an unstructured/time based view of tasks for each day (meaning you can plan out along a schedule from top to bottom, or create tasks that can later be sorted/filtered by whatever you want - priority, type, A-Z)&lt;/li&gt;\n&lt;li&gt;the ability to add weekly goals, monthly goals (maybe), and just high level goals&lt;/li&gt;\n&lt;li&gt;a day/week/month view - on a day view, for example, there&amp;#39;ll be another spot for just taking notes about the day (maybe I can make this a full blown weekly planner/diary - who knows?)&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;In any case, wanted to share and ask what you guys think. Always open for feedback, and if this is something that could help you let me know if there&amp;#39;s any feature you&amp;#39;d want on something like this!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/sdrjnz/i_started_to_make_something_i_needed_to_make_a/",
  "subreddit": "SideProject",
  "id": "sdrjnz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For years I've been printing out papers with a weekly table format, writing out\nmy tasks for the week in a semi-structured manor. I tried using digital\nplatforms, but they never gave me the exact layout I wanted (looking at you\nGoogle cal). I tried recreating things in editor type platforms like…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もう何年も前から、週間表形式の紙をプリントアウトして、書き込んでいます。\nその週のタスクを、半構造化された形で表現しています。デジタル\nしかし、私が望むようなレイアウトを実現することはできませんでした。\nGoogle cal)。などのエディタ系のプラットフォームで再現してみましたが...。",
      "title": "昔、作らなければならなかったものを作り始めた - Weekliner.com"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "多年来，我一直在打印每周表格格式的文件，以半结构化的方式写出我一周的任务。\n以半结构化的方式写出我一周的任务。我尝试过使用数字\n平台，但它们从来没有给我带来我想要的确切布局（看着你\nGoogle cal）。我试着在编辑器类型的平台上重新创建东西，如...",
      "title": "我开始做我很久之前就需要做的事情 - Weekliner.com"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "多年來，我一直在打印每週表格格式的文件，以半結構化的方式寫出我一週的任務。\n以半結構化的方式寫出我一週的任務。我嘗試過使用數字\n平臺，但它們從來沒有給我帶來我想要的確切佈局（看着你\nGoogle cal）。我試着在編輯器類型的平臺上重新創建東西，如...",
      "title": "我開始做我很久之前就需要做的事情 - Weekliner.com"
    }
  ]
}