{
  "author": "dazib",
  "the_new_excerpt": "\"Just google it\". How many times have you heard or seen that reply? Yeah I know\nI could google things, so what, is it now undesirable to ask questions to\npeople? Is there any reason why we should even talk to each other? Is going\ntowards a society where every individual can always do everything by…",
  "original_created_utc": 1613743258,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "\"谷歌一下就知道了\"。你听过或看过多少次这样的回答？是的，我知道\n我可以google东西，那又怎样，现在问问题不可取吗？\n人？我们有什么理由要互相交谈吗？是去\n朝着一个每个人都可以做任何事情的社会... ...",
      "title": "我是不是太担心了，我们总是可以随便google一切，基本上就是在向别人问东问西，不可取？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"谷歌一下就知道了\"。你聽過或看過多少次這樣的回答？是的，我知道\n我可以google東西，那又怎樣，現在問問題不可取嗎？\n人？我們有什麼理由要互相交談嗎？是去\n朝着一個每個人都可以做任何事情的社會... ...",
      "title": "我是不是太擔心了，我們總是可以隨便google一切，基本上就是在向別人問東問西，不可取？"
    }
  ],
  "title": "Am I worrying too much that the fact we can always just google everything is basically making asking things to people undesirable?",
  "created_utc": 1613754683,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;Just google it&quot;. How many times have you heard or seen that reply? Yeah I know I could google things, so what, is it now undesirable to ask questions to people? Is there any reason why we should even talk to each other? Is going towards a society where every individual can always do everything by themselves really what we want? Doesn&#39;t this just make it even harder to connect with others? Questions have always been some of the best excuses to talk to strangers for example and possibly create new connections. Do we really want to give up on that? And to be clear I&#39;m not against googling informations, it just worries me when not doing it is almost considered unacceptable.</p>\n\n<p>Does anyone else feel this way? Am I worrying over nothing?</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/TooAfraidToAsk/comments/lngj2o/am_i_worrying_too_much_that_the_fact_we_can/",
  "subreddit": "TooAfraidToAsk",
  "id": "lngj2o",
  "is_self": true,
  "media": null,
  "is_video": false
}