{
  "author": "WHATDAHELLYO",
  "original_created_utc": 1659357991,
  "title": "Thoughts on proposing to my girlfriend at 17-18 years old ?",
  "created_utc": 1659376012,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My girlfriend and I have been together for nearly 7 months now but we&amp;#39;ve known each other for 2+ years and we&amp;#39;ve been best friends for most of it. We both know everythkng about each pther and I love her to death. We&amp;#39;re incredibmy close. To me she IS the one. She has to go through some (kinda serious) mental health issues and I offer her my support in each and every way I can. I have to admit that sometimes it can be a little exhausting but I feel like I wanna keep going and care for her all my life.&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re planning on sharing a home after high school during our studies.&lt;/p&gt;\n\n&lt;p&gt;My idea was to propose to her next summer (she just celebrated her 17th birthday and i&amp;#39;m almsot 17 as well) so she&amp;#39;ll be around 18 and I&amp;#39;ll be 17.&lt;/p&gt;\n\n&lt;p&gt;Has anyone had a similar experience ? Would you have any piece of advice or do you think I should reconsider based on some other factors ? It would be amazing to hear from someone who proposed at around my age&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 152,
  "permalink": "/r/TooAfraidToAsk/comments/wdgmgx/thoughts_on_proposing_to_my_girlfriend_at_1718/",
  "subreddit": "TooAfraidToAsk",
  "id": "wdgmgx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My girlfriend and I have been together for nearly 7 months now but we've known\neach other for 2+ years and we've been best friends for most of it. We both know\neverythkng about each pther and I love her to death. We're incredibmy close. To\nme she IS the one. She has to go through some (kinda…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼女と付き合ってもうすぐ7ヶ月になるのですが、以前から知り合い\n2年以上前から知り合い、そのほとんどを親友として過ごしてきました。私たち二人はお互いのことを知り尽くして\n私たちはお互いのことを何でも知っていて、私は彼女を死ぬほど愛しています。私たちは信じられないほど仲が良いんだ。私たちに\n僕にとって、彼女は運命の人なんだ。彼女はいくつかの（ちょっと...）を通過する必要があります。",
      "title": "17-18歳で恋人にプロポーズする感想 ?"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和我的女朋友已经在一起近7个月了，但我们知道\n但我们已经认识2年多了，大部分时间我们都是最好的朋友。我们都知道\n我们都知道对方的一切，而且我爱她到死。我们的关系好得令人难以置信。对我来说\n对我来说，她就是那个人。她必须要经历一些（有点...",
      "title": "关于在17-18岁时向女友求婚的想法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和我的女朋友已經在一起近7個月了，但我們知道\n但我們已經認識2年多了，大部分時間我們都是最好的朋友。我們都知道\n我們都知道對方的一切，而且我愛她到死。我們的關係好得令人難以置信。對我來說\n對我來說，她就是那個人。她必須要經歷一些（有點...",
      "title": "關於在17-18歲時向女友求婚的想法？"
    }
  ]
}