{
  "author": "Elie0_0",
  "original_created_utc": 1648728946,
  "title": "There are more than 100 new coins created everyday, it's very unlikely that you will find the next 100x coin",
  "created_utc": 1648745754,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A lot of people invest in these coins that are new and low cap and obscure thinking that they can get rich quickly, when all that will actually happen is they&amp;#39;ll lose their money in these coins that either fail or get Rugpulled.&lt;/p&gt;\n\n&lt;p&gt;Seeing coins like SHIB, DOGE in the past has only encouraged these people in their thinking that they can make a lot of money off of these coins, when the reality is that those 2 were only 2 among thousands of coins that got lucky. &lt;/p&gt;\n\n&lt;p&gt;Investing should be done with a purpose, otherwise it becomes pure gambling and you&amp;#39;ll likely fail. &lt;/p&gt;\n\n&lt;p&gt;That purpose could be Bitcoin as a means of decentralization, as a means of inflation hedge, or just as a currency that&amp;#39;s easy to transfer. As long as you know what you support in your coin, you have a purpose in it that you believe. Which is what investing is, not closing your eyes and picking a coin. &lt;/p&gt;\n\n&lt;p&gt;Not only you won&amp;#39;t be rich, but you&amp;#39;ll also lose your money in these coins. Only people getting rich will be those controlling the coin with their bags that are ready to sell. &lt;/p&gt;\n\n&lt;p&gt;But of course, there still are those projects with purpose and that can change the market, but you&amp;#39;ll need a lot of time on your hands to find those new ones.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 396,
  "permalink": "/r/CryptoCurrency/comments/tsyfsu/there_are_more_than_100_new_coins_created/",
  "subreddit": "CryptoCurrency",
  "id": "tsyfsu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A lot of people invest in these coins that are new and low cap and obscure\nthinking that they can get rich quickly, when all that will actually happen is\nthey'll lose their money in these coins that either fail or get Rugpulled.\n\nSeeing coins like SHIB, DOGE in the past has only encouraged these…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人が、このような新しくてキャップが低く、無名なコインに投資しています。\nすぐに一攫千金を狙えると思っていても、実際に起こるのは\nこのようなコインでは、失敗するか、引き抜かれるかのどちらかで資金を失うことになります。\n\n過去にSHIBやDOGEのようなコインを見たことが、これらのコインを助長したのです。",
      "title": "毎日100枚以上の新しいコインが誕生しています、次の100倍コインに出会える可能性は非常に低いです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很多人投资于这些新的、低市值的、不起眼的硬币\n认为他们可以迅速致富，而实际上发生的一切是\n他们会在这些硬币中损失他们的钱，要么失败，要么被Rugpulled。\n\n过去看到像SHIB、DOGE这样的硬币，只会鼓励这些...",
      "title": "每天有超过100个新的硬币产生，你很难找到下一个100倍硬币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多人投資於這些新的、低市值的、不起眼的硬幣\n認爲他們可以迅速致富，而實際上發生的一切是\n他們會在這些硬幣中損失他們的錢，要麼失敗，要麼被Rugpulled。\n\n過去看到像SHIB、DOGE這樣的硬幣，只會鼓勵這些...",
      "title": "每天有超過100個新的硬幣產生，你很難找到下一個100倍硬幣。"
    }
  ]
}