{
  "author": "Wilmotac",
  "original_created_utc": 1636622564,
  "title": "Yes, crypto markets will crash, but I won't sell and neither should you",
  "created_utc": 1636641421,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s considered a foregone conclusion here that the bull market is going to end within a couple of months and there&#39;ll be a crash. I agree that this is probably what&#39;s going to happen, but I&#39;m not even considering trying to time it, despite the potential for big gains. Here&#39;s why.</p>\n\n<p><strong>Mistiming the Top is Costly</strong></p>\n\n<p>I&#39;m sure there&#39;ll be a crash soon, so why don&#39;t I sell now? Simple - I don&#39;t know if it&#39;ll crash from $70k to $30k, or from $200k to $70k, or even more. I don&#39;t expect this to be like the 2018 crash - apart from the massively expanded retail investor base, we have institutions, companies, and hell, even a country waiting to buy the dip - any dip won&#39;t be as sharp or as protracted.</p>\n\n<p>I also don&#39;t think we&#39;ve hit the euphoric peak of this bull run. Anecdotally, I and some friends who have been involved in crypto for a long while now refer to what we call the &quot;dad index&quot; - when all of our parents start asking for tips on crypto, or worse, telling us what crypto they think will do well, that&#39;s when we should sell. That hasn&#39;t happened yet.</p>\n\n<p>I personally have a terrible time timing the tops and bottoms. If you could time the tops and bottoms of crypto, you&#39;d already be too wealthy to mess around on reddit.</p>\n\n<p><strong>I&#39;m earning interest along the way</strong></p>\n\n<p>Between staking and lending, all of my crypto is put to use generating more crypto. Any potential profits from timing the top and bottom have to be considered against the loss of interest, which may not be significant for my BTC holdings, but for my some of my tokens with quite high staking interest? There&#39;s a good chance any profits I&#39;d take would be smaller than if I had just done nothing.</p>\n\n<p><strong>The Taxman</strong></p>\n\n<p>I hate tax. Regardless of philosophical discussions about whether taxation is theft, I do not want to pay a single penny more than I have to my government, but I also understand that <strong>you do not fuck with the taxman</strong>. I have an exit strategy to minimise my tax liability, and so taking profits and having it eaten by Capital Gains is not something I&#39;m interested in. </p>\n\n<p>With that in mind, good luck with whatever strategy you pick!</p>\n</div><!-- SC_ON -->",
  "score": 222,
  "permalink": "/r/CryptoCurrency/comments/qrhfj8/yes_crypto_markets_will_crash_but_i_wont_sell_and/",
  "subreddit": "CryptoCurrency",
  "id": "qrhfj8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's considered a foregone conclusion here that the bull market is going to end\nwithin a couple of months and there'll be a crash. I agree that this is probably\nwhat's going to happen, but I'm not even considering trying to time it, despite\nthe potential for big gains. Here's why.\n\nMistiming the Top…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここでは、強気の相場が数ヶ月以内に終わり、暴落することは当然のことと考えられています。\n数ヶ月以内に強気の相場が終わり、暴落すると考えられています。私は、おそらくそうなるだろうと思う。\nしかし、大きな利益を得られる可能性があるにもかかわらず、タイミングを計ろうとは考えていません。\n大きな利益を得られる可能性があるにもかかわらず、タイミングを計ろうとは思わない。その理由はこうだ。\n\nトップのタイミングを誤ると...",
      "title": "暗号市場は暴落するが、私は売らないし、あなたも売るべきではない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这里被认为是一个定论，即牛市将在几个月内结束，并将出现崩溃。\n几个月内将会出现崩溃。我同意，这可能是\n会发生什么，但我甚至不考虑尝试为它计时，尽管有可能获得巨大收益。\n尽管有可能获得巨大收益。这就是原因。\n\n错失顶部时机...",
      "title": "是的，加密货币市场将崩溃，但我不会卖，你也不应该卖"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這裏被認爲是一個定論，即牛市將在幾個月內結束，並將出現崩潰。\n幾個月內將會出現崩潰。我同意，這可能是\n會發生什麼，但我甚至不考慮嘗試爲它計時，儘管有可能獲得巨大收益。\n儘管有可能獲得巨大收益。這就是原因。\n\n錯失頂部時機...",
      "title": "是的，加密貨幣市場將崩潰，但我不會賣，你也不應該賣"
    }
  ]
}