{
  "author": "CaedustheBaedus",
  "original_created_utc": 1650033772,
  "title": "Girl matched on Tinder and wants to be \"bruised\". Never really done that and she's hoping to meet tomorrow night, but not wanting to have to \"educate me on it\". How should I do that or tips? More info in notes.",
  "created_utc": 1650042017,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a 28 M and she&amp;#39;s a 28 F. She said she&amp;#39;s a masochist and is hoping to be &amp;quot;bruised&amp;quot; but that might just be her kind of flirting/dirty talk. She said she wouldn&amp;#39;t care if a belt was used. I told her I&amp;#39;ve done light spanking and light choking, but never hit hard enough for bruises or used a belt.&lt;/p&gt;\n\n&lt;p&gt;I told her I&amp;#39;m willing to start lightly and move up if she gives me a little bit the night of to get her limits. She said she doesn&amp;#39;t want to have to educate me on it and is hoping I can just jump right in&lt;/p&gt;\n\n&lt;p&gt;What type of stuff should I be doing or any tips on how I could be aggressive or hard hitting enough in 24 hours w/o really learning the ropes (no pun intended) or limits of said partner?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;EDIT: Everyone seems to be very against it and saying &amp;quot;Run like the wind my friend&amp;quot;. Or saying to get evidence that she was asking for that so I could tell cops or someone? Based on this input I&amp;#39;m either gonna say &amp;quot;nope&amp;quot; or tell her I&amp;#39;m definitely gonna have to have a brief sit down w/ her before anything starts. I&amp;#39;m leaning more towards the &amp;quot;No&amp;quot; but we all know if she sends me a drunk text after midnight, I&amp;#39;m just a simple man w/ horny brain...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 162,
  "permalink": "/r/TooAfraidToAsk/comments/u49lii/girl_matched_on_tinder_and_wants_to_be_bruised/",
  "subreddit": "TooAfraidToAsk",
  "id": "u49lii",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I'm a 28 M and she's a 28 F. She said she's a masochist and is hoping to be\n\"bruised\" but that might just be her kind of flirting/dirty talk. She said she\nwouldn't care if a belt was used. I told her I've done light spanking and light\nchoking, but never hit hard enough for bruises or used a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は28のMで、彼女は28のFです。彼女はマゾヒストで、自分がされることを望んでいるそうです。\n「でも、それは彼女らしいイチャイチャ話かもしれませんね。彼女曰く\nベルトを使っても構わない。軽くスパンキングしたり、軽く\nしかし、痣ができるほど強く叩いたり、痣ができるような器具を使ったことはありません。",
      "title": "Tinderでマッチングした女の子が「あざとい」ことを希望しています。一度もしたことがなく、明日の夜に会うことを希望しているが、「教育してほしい」と言われるのは嫌だ。どうすればいいのか、コツはありますか？詳しくはノートに。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个28岁的男性，她是一个28岁的女性。\n\"伤\"，但这可能只是她的一种调情/肮脏的谈话。她说她\n如果使用皮带，她也不会在意。我告诉她，我曾做过轻微的打屁股和轻微的\n我告诉她，我做过轻度的打屁股和轻度的窒息，但从来没有打得足够重而造成瘀伤或使用皮带。",
      "title": "女孩在Tinder上配对，希望被 \"挫伤\"。从未真正做过，她希望明天晚上能见面，但不想让我 \"教育一下\"。我应该怎么做，或者说提示？更多信息请见注释。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個28歲的男性，她是一個28歲的女性。\n\"傷\"，但這可能只是她的一種調情/骯髒的談話。她說她\n如果使用皮帶，她也不會在意。我告訴她，我曾做過輕微的打屁股和輕微的\n我告訴她，我做過輕度的打屁股和輕度的窒息，但從來沒有打得足夠重而造成瘀傷或使用皮帶。",
      "title": "女孩在Tinder上配對，希望被 \"挫傷\"。從未真正做過，她希望明天晚上能見面，但不想讓我 \"教育一下\"。我應該怎麼做，或者說提示？更多信息請見註釋。"
    }
  ]
}