{
  "author": "CaedustheBaedus",
  "original_created_utc": 1650033772,
  "title": "Girl matched on Tinder and wants to be \"bruised\". Never really done that and she's hoping to meet tomorrow night, but not wanting to have to \"educate me on it\". How should I do that or tips? More info in notes.",
  "created_utc": 1650042017,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a 28 M and she&amp;#39;s a 28 F. She said she&amp;#39;s a masochist and is hoping to be &amp;quot;bruised&amp;quot; but that might just be her kind of flirting/dirty talk. She said she wouldn&amp;#39;t care if a belt was used. I told her I&amp;#39;ve done light spanking and light choking, but never hit hard enough for bruises or used a belt.&lt;/p&gt;\n\n&lt;p&gt;I told her I&amp;#39;m willing to start lightly and move up if she gives me a little bit the night of to get her limits. She said she doesn&amp;#39;t want to have to educate me on it and is hoping I can just jump right in&lt;/p&gt;\n\n&lt;p&gt;What type of stuff should I be doing or any tips on how I could be aggressive or hard hitting enough in 24 hours w/o really learning the ropes (no pun intended) or limits of said partner?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;EDIT: Everyone seems to be very against it and saying &amp;quot;Run like the wind my friend&amp;quot;. Or saying to get evidence that she was asking for that so I could tell cops or someone? Based on this input I&amp;#39;m either gonna say &amp;quot;nope&amp;quot; or tell her I&amp;#39;m definitely gonna have to have a brief sit down w/ her before anything starts. I&amp;#39;m leaning more towards the &amp;quot;No&amp;quot; but we all know if she sends me a drunk text after midnight, I&amp;#39;m just a simple man w/ horny brain...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 162,
  "permalink": "/r/TooAfraidToAsk/comments/u49lii/girl_matched_on_tinder_and_wants_to_be_bruised/",
  "subreddit": "TooAfraidToAsk",
  "id": "u49lii",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I'm a 28 M and she's a 28 F. She said she's a masochist and is hoping to be\n\"bruised\" but that might just be her kind of flirting/dirty talk. She said she\nwouldn't care if a belt was used. I told her I've done light spanking and light\nchoking, but never hit hard enough for bruises or used a…"
}