{
  "author": "ominous_anenome",
  "the_new_excerpt": "Around a year ago, I started using Brave as my primary browser. And today I\nnoticed on the homepage that I reached 1 million trackers and ads blocked, which\nis pretty shocking. Additionally, I was essentially PAID to browse as I normally\nwould -- with the recent run up in the price of BAT this…",
  "original_created_utc": 1616447606,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大约一年前，我开始使用Brave作为我的主要浏览器。而今天，我\n在主页上注意到我达到了100万个跟踪器和广告被屏蔽，这是\n是相当令人震惊的。此外，我基本上是花钱来浏览的，因为我平时\n会 -- 最近BAT价格上涨，这... ...",
      "title": "勇敢的浏览器。拦截100万个追踪者/广告+165元浏览费。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大約一年前，我開始使用Brave作爲我的主要瀏覽器。而今天，我\n在主頁上注意到我達到了100萬個跟蹤器和廣告被屏蔽，這是\n是相當令人震驚的。此外，我基本上是花錢來瀏覽的，因爲我平時\n會 -- 最近BAT價格上漲，這... ...",
      "title": "勇敢的瀏覽器。攔截100萬個追蹤者/廣告+165元瀏覽費。"
    }
  ],
  "title": "Brave Browser: 1M trackers/ads blocked + $165 just from browsing",
  "created_utc": 1616456676,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Around a year ago, I started using Brave as my primary browser. And today I noticed on the homepage that I reached 1 million trackers and ads blocked, which is pretty shocking. Additionally, I was essentially PAID to browse as I normally would -- with the recent run up in the price of BAT this amounts to ~$165. Obviously not a significant amount of money, but I think the concept is awesome regardless.</p>\n\n<p>The browser itself works well, and the only issues I have with it are:</p>\n\n<ul>\n<li>You can only &quot;cash out&quot; via an Uphold wallet, which is KYC and has high fees.</li>\n<li>Some issues with receiving BAT payments on time.</li>\n<li>Can&#39;t enable BAT rewards on my iPhone, due to Apple&#39;s policy.</li>\n</ul>\n\n<p>To those of you on the fence, I would suggest at least trying Brave. You can enable / disable BAT rewards (to earn BAT there are some pop-up ads that appear) as you please, so there&#39;s really no downside to giving it a shot. I think there are decent arguments on both sides about the value of the BAT token, so you can determine for yourself if enabling BAT ads are &quot;worth it&quot; for you.</p>\n\n<p><a href=\"https://preview.redd.it/p9owsa5d9no61.png?width=2082&amp;format=png&amp;auto=webp&amp;s=b6164b213a07c39ccd5915c247cd2972a26ea4e2\">Brave/BAT Summary</a></p>\n</div><!-- SC_ON -->",
  "score": 4202,
  "permalink": "/r/CryptoCurrency/comments/may5fp/brave_browser_1m_trackersads_blocked_165_just/",
  "subreddit": "CryptoCurrency",
  "id": "may5fp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752816915
}