{
  "author": "cbus20122",
  "the_new_excerpt": "We've heard countless times that there is going to be an immense wave of pent up\ndemand that is going to cause a boom in the economy once we are fully\nvaccinated. I try to keep an eye on economic data reports that come through\nbecause if you know how to read them, they can provide a lot of insight…",
  "original_created_utc": 1610303959,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们已经听过无数次了，说将会有一波巨大的被压抑的浪潮\n一旦我们完全满足，将会引起经济繁荣的需求\n接种了疫苗。我试着密切关注即将出炉的经济数据报告。\n因为如果你知道如何阅读它们，它们可以提供很多洞察力…",
      "title": "被压抑的需求：揭穿叙述(使用数据的长篇帖子)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們已經聽過無數次了，說將會有一波巨大的被壓抑的浪潮\n一旦我們完全滿足，將會引起經濟繁榮的需求\n接種了疫苗。我試着密切關注即將出爐的經濟數據報告。\n因爲如果你知道如何閱讀它們，它們可以提供很多洞察力…",
      "title": "被壓抑的需求：揭穿敘述(使用數據的長篇帖子)"
    }
  ],
  "title": "Pent Up Demand: Debunking the Narrative (long post using data)",
  "created_utc": 1610322683,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We&#39;ve heard countless times that there is going to be an immense wave of pent up demand that is going to cause a boom in the economy once we are fully vaccinated. I try to keep an eye on economic data reports that come through because if you know how to read them, they can provide a lot of insight that can cut through popular narratives.</p>\n\n<p>Recently, I&#39;ve been noticing more and more data points that lead me to doubt the idea that we are going to see an immense wave of consumer demand leading to a new surge in the economy. That is 100% subject to change, so I&#39;m just going off what I am seeing <strong><em>right now.</em></strong> These things are dynamic, and changes in policy and income (aka stimulus or mass-rehiring of workers) can completely affect consumer&#39;s ability to spend... at least for a period of time.</p>\n\n<p><a href=\"https://www.irs.gov/newsroom/treasury-irs-deliver-89-point-5-million-economic-impact-payments-in-first-three-weeks-release-state-by-state-economic-impact-payment-figures\">Courtesy of the IRS</a>, after the first stimulus check was sent, a total of $160.4 billion went to 89.5 million individuals. so how was this used? And what may this indicate for current and future demand?</p>\n\n<p><strong>So... Analyzing the Data...</strong></p>\n\n<h1>Personal Savings Rate Does Not Equate To Consumer Demand</h1>\n\n<p>To start, it&#39;s important to understand the savings rate at both a personal level and a macro level.</p>\n\n<p>Lets take a minute to understand how the savings rate is generally defined (on a personal level).</p>\n\n<blockquote>\n<p>A savings rate is the amount of money, expressed as a percentage or ratio, that a person deducts from his disposable personal income to set aside as a nest egg or for retirement.</p>\n</blockquote>\n\n<p>On an individual level, the most important thing to note here is that investing = savings. And in general, people don&#39;t tend to spend their investments in the near future, so savings that get allocated towards longer term investments typically will <strong><em>not</em></strong> count towards &quot;pent up demand&quot;. For the individuals who choose to invest their money, they typically do so with the understanding that they do not have any needs or demands they can anticipate in the near future, and instead choose to save for the future via investment. This goes counter to the idea that savings are a precursor to spending. </p>\n\n<p>On a macro level, when taken as a cross-section of a country as a whole, savings rates reflect aggregate savings, but this is highly skewed to the extremely wealthy. Savings rate naturally skews towards a wealthier subset of any society because lower income individuals need to spend $ on day-to-day items just to stay above water, whereas the wealthy have an excess of income relative to their individual demands, which means they tend to invest the excess $ since they only have so much they can spend it on (unless you&#39;re a baller who <em>needs</em> that 5th Yacht from their WSB calls).</p>\n\n<p>For example, read this excerpt from a study done on stimulus spending (<a href=\"https://insight.kellogg.northwestern.edu/article/stimulus-checks-spending-data-2020-coronavirus-covid\">https://insight.kellogg.northwestern.edu/article/stimulus-checks-spending-data-2020-coronavirus-covid</a>)</p>\n\n<blockquote>\n<p>Those in the lowest income group, who earned less than $1,000 per month, spent about 40 percent of the checks in the first ten days. That was twice as much as the highest income group (those making over $5,000 a month), who spent closer to 20 percent in that brief period. </p>\n</blockquote>\n\n<p><strong>**Key Takeaways on Savings Rate*\\</strong>*</p>\n\n<ol>\n<li>Savings rate tends to reflect investment more than cash saved for future discretionary needs.</li>\n<li>Savings rate skews towards wealthy individuals who generally do not account for a meaningful amount of consumer demand relative to their overall savings.</li>\n<li>In other words, higher savings is not by itself a good barometer for gauging pent-up demand.</li>\n</ol>\n\n<h1>Consumer Spending &amp; Income In the Pandemic</h1>\n\n<p>First off, <a href=\"https://fred.stlouisfed.org/graph/fredgraph.png?g=zGMK\"><strong>lets take a look at real personal spending and real personal income</strong></a> <em><sup>(please do click the link to see the chart</sup></em><em>)</em>. We can all see the gigantic surge in income (via stimulus) and drop in spending (via lockdowns) that occurred in April 2020. This is the primary item that lead most to believe the idea that we&#39;ll have a surge of consumer spending once we&#39;re away from the pandemic via pent-up demand. It makes total sense, especially with the context of lockdowns which literally prevented people from spending their money on what they were originally planning to.</p>\n\n<p>From the federal reserve, here is a breakdown of how stimulus money was spent (from October). Read more at <a href=\"https://libertystreeteconomics.newyorkfed.org/2020/10/how-have-households-used-their-stimulus-payments-and-how-would-they-spend-the-next.html\">https://libertystreeteconomics.newyorkfed.org/2020/10/how-have-households-used-their-stimulus-payments-and-how-would-they-spend-the-next.html</a></p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\"></th>\n<th align=\"left\">Average percent saved</th>\n<th align=\"left\">Average percent spent on essentials</th>\n<th align=\"left\">Average percent spent on non-essentials</th>\n<th align=\"left\">Average percent donated</th>\n<th align=\"left\">Average percent used to pay down debt</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">Percentage of total</td>\n<td align=\"left\">36.4%</td>\n<td align=\"left\">18.2%</td>\n<td align=\"left\">7.7%</td>\n<td align=\"left\">3.2%</td>\n<td align=\"left\">34.5%</td>\n</tr>\n<tr>\n<td align=\"left\">$ value based on IRS 160 billion sent</td>\n<td align=\"left\">58.24 billion</td>\n<td align=\"left\">29.1 billion</td>\n<td align=\"left\">12.3 billion</td>\n<td align=\"left\">5.1 billion</td>\n<td align=\"left\">55.2 billion</td>\n</tr>\n</tbody></table>\n\n<p>My general theory is that the majority of that pent up demand has already been worn off, or was simply allocated elsewhere, and this money is not likely to cause an excessive surge in consumer spending when we&#39;re all vaccinated.</p>\n\n<p>Looking at the above table, lets consider how much of this $ could potentially represent savings that are waiting to be used as pent up demand vs. savings as investments. In all likelihood, there is a fraction of that 58.24 billion waiting to be spent upon reopening. The majority of it is likely going to be stuck in investments or kept in savings.</p>\n\n<p>On investment - note the below data point relative to the 89.5 million stimulus checks sent out. A huge portion of new trading accounts were opened relative to the amount of stimulus accounts sent - and that only represents one month, ignores those who already had trading accounts, and ignores the people who were not able to save $ from their stimulus check.</p>\n\n<blockquote>\n<p>At E*Trade Financial Corp. , investors opened roughly 260,500 retail accounts just in March, more than any full year on record. Newer rival Robinhood Markets Inc., maker of a wildly popular trading app, logged a record three million new accounts in the first quarter.</p>\n</blockquote>\n\n<p>Unfortunately, I can&#39;t dig up more precise data on how much of people&#39;s savings went to buying stocks and other financial products vs. being stashed in bank accounts for later use. With that said, clearly a shit ton of &quot;savings&quot; is what propped up markets in 2020 and caused the wild disparities in valuation of the financial markets vs. the real economy. </p>\n\n<p><strong>**Key Takeaways On Consumer Spending From Stimulus*\\</strong>*</p>\n\n<ul>\n<li>Of the money from stimulus, the majority of excess savings was not saved for later use for when the pandemic is over.</li>\n<li>Most of the excess savings rotated into investments, paying down debts, and &quot;keeping the lights on&quot;. </li>\n<li>While there may be some excess $ saved for the pandemic being over, the wide majority of the excess money earned during covid lockdowns will not be used on pent up demand spending. </li>\n</ul>\n\n<p><strong>The Great Consumer Spending Rotation of 2020</strong></p>\n\n<p>When consumers realized they couldn&#39;t go on their vacations or meet up with their friends at the local pub, they decided to spend their income in other ways instead of just stashing it in a bank account and letting it sit there to be later use for 2021&#39;s vacation or restaurant trips.</p>\n\n<p>Just like a sector rotation in the stock market, I think we got a gigantic sector rotation in consumer spending habits that will likely reverse a bit when the pandemic is over. Here is the evidence.</p>\n\n<p>To be 100% clear, I DO think there <strong><em>was</em></strong> pent up demand after the big lockdown, but the portion of the savings glut that was <strong><em>not</em></strong> allocated towards investments for the most part did not get saved for later use in 2021. It just got repurposed and spent on other items. Lets take a look under the hood at some of the data of this rotation. To start - <a href=\"https://fred.stlouisfed.org/series/PCEC96\">take a look at real personal consumption expenditures</a> as a baseline.  </p>\n\n<ul>\n<li><a href=\"https://fred.stlouisfed.org/series/PCEDG\"><strong>Durable Goods Saw a Huge Surge in the Summer</strong></a><strong>:</strong> This is part of why I say that there 100% was a lot of pent-up demand, but it simply has already been utilized. Relative to overall personal expenditures, people spent a ton of money on goods. Notably, this was dominated by auto purchases and other big purchases of physical items.\n\n<ul>\n<li><a href=\"https://fred.stlouisfed.org/series/DFXARC1M027SBEA\"><strong>Purchases of Food are Way Up:</strong></a> I&#39;m assuming restaurant visits do not count under this statistic, so this would explain a rotation from $ spent at restaurants to $ spent buying groceries instead. Basically a simple rotation / distortion that should eventually revert towards the baseline.</li>\n<li><a href=\"https://fred.stlouisfed.org/series/DHLCRC1Q027SBEA\"><strong>Furniture &amp; Home Improvement Products Surged Enormously:</strong></a> Being in lockdown, people bought tons of new items for home-improvement due to spending more time in their homes. </li>\n<li><a href=\"https://fred.stlouisfed.org/series/DMOTRC1Q027SBEA\"><strong>Auto Purchases Went Through the Roof:</strong></a> As mentioned, a lot of people used their stimulus $ to buy big ticket goods (homes, autos, etc). This was also encouraged strongly by lower interest rates.</li>\n</ul></li>\n<li><a href=\"https://fred.stlouisfed.org/series/ND000350Q\"><strong>Meanwhile, Services Lagged</strong></a><strong>:</strong> This shouldn&#39;t be too surprising since a lot of services account for the leisure sector of the economy that was hit hardest by lockdowns and continues to be affected.\n\n<ul>\n<li><a href=\"https://fred.stlouisfed.org/series/DHLCRC1Q027SBEA\"><strong>Healthcare Services are Down Overall:</strong></a> Covid scared a lot of people away from getting medical care, so a lot of people stopped getting non-mandatory healthcare. Also, for a while, hospitals suspended non-essential services, preventing a lot of healthcare from being administered.</li>\n<li><a href=\"https://fred.stlouisfed.org/series/DRCARC1Q027SBEA\"><strong>Recreation Services Fell off a Cliff:</strong></a> Probably not a huge surprise here similar to restaurants.</li>\n<li><a href=\"https://fred.stlouisfed.org/series/DFSARC1Q027SBEA\"><strong>Food Service Got Hammered:</strong></a> This is probably the least surprising item on here for most people. Basically, restaurants got killed. </li>\n</ul></li>\n</ul>\n\n<p>To be honest, most of this is pretty obvious. Many people have been aware that there were these huge shifts in consumer behavior, but despite this, I still see a ton of linear extrapolation of these trends into the distant future. There are some strong implications and considerations that need to be taken from this rotation with regard to the pent up demand narrative. </p>\n\n<p><strong>**For all the items that we have been anticipating pent-up demand, we also need to consider the whiplash effects from the other types of goods that saw excess demand pulled forward.*\\</strong>*</p>\n\n<ul>\n<li>Most of the services that got killed during 2020 are not the type of goods that you would anticipate tons of excess demand coming out in 2021. \n\n<ul>\n<li>For example, if you didn&#39;t go on a vacation in 2020 due to Covid, that doesn&#39;t mean you&#39;re likely to take an extra vacation in 2021. </li>\n<li>The full-year of avoiding restaurants may have a modest impact in people wanting to get out in 2021, but I don&#39;t think the rebound will make up for all the $ lost by any means. </li>\n<li>People are not likely going to be going to <strong><em>excess</em></strong> sporting events, movies, or amusement parks in 2021 simply because they didn&#39;t go to these events in 2020. More likely, we&#39;ll just return close to the baseline of where we were previously.</li>\n<li>Healthcare services likely <strong><em>will</em></strong> see a surge in pent-up demand due to the necessity of healthcare overall. </li>\n</ul></li>\n<li><strong>Durable Goods Purchases Likely Brought Forward Future Demand.</strong>\n\n<ul>\n<li>If you&#39;re one of the many people who bought a car during 2020, odds are, you aren&#39;t going to purchase another car in 2021. This is a big deal to be honest - the amount of autos purchased far exceeded the well-discussed cash for clunkers program that was popular after the 08&#39; financial crisis.</li>\n<li>While it&#39;s harder to say where demand will or won&#39;t be on this, I would take a guess that home-improvement type items will drop back to the baseline level or perhaps go even lower. This will show up as a big drop due to base effects year over year.</li>\n<li>Groceries and food purchases will likely start to rotate back towards being spent on the food service category.</li>\n</ul></li>\n</ul>\n\n<p><strong>**Key Takeaways From the Great Consumer Rotation*\\</strong>*</p>\n\n<ul>\n<li>There will likely be a slight amount of pent-up demand that comes out upon opening up, but just like when lockdowns began, there will likely be quite a few losers as a result of this in addition to the winners.</li>\n<li>Pay attention to base effects and whether demand is likely to be carried forward. At least, if you&#39;re looking at earnings an profitability to determine the direction of a company, this is a good way to get a decent read on sector allocation. </li>\n<li>If you&#39;re staying super-long in one of the lockdown winner stocks that shot up 5x in the past year, I would take some serious consideration into at least rebalancing and not allowing your risk exposure to be stuck entirely in a sector that is going to have impossible earnings comps to beat.</li>\n</ul>\n\n<h1>Putting it All Together + Looking to The Future</h1>\n\n<p><strong>So what are the actionable takeaways here? (Just sharing some of my personal opinions - take them FWIW</strong></p>\n\n<ol>\n<li>I don&#39;t really think that the idea of pent-up demand is going to be nearly as strong as some think, and in some instances, it will be the opposite since we&#39;re looking at excess demand pulled forward via stimulus and consumer rotation. This is 100% subject to change via new stimulus measures however. Regardless, as an example, I wouldn&#39;t want to be invested in the auto sector as we come further into 2020, especially the legacy automakers who can&#39;t see their stock rise simply off of narrative. On the other hand, there may be value looking into things like healthcare services.</li>\n<li>We did have a shit ton of excess savings, especially in the spring and summer of 2020. But most of those savings were either used, or went into paying down debt or investing in the future. While these are all good, none of these things indicate the idea that consumers have a glut of $ they&#39;re waiting to spend on post-covid consumption. I think there will be some savings &amp; pent up demand, and people surely will want to spend money on the things they couldn&#39;t do in 2020. But I&#39;m not sure if it would exceed the long term baseline levels and I think it&#39;ll only occur in select sectors.</li>\n<li>We are looking at some of the biggest economic whiplashes we&#39;ve ever seen in markets as base effects come into play. The post-covid base-effect whiplashes likely won&#39;t be as big as the initial shocks, but I personally think they are going to catch many by surprise - especially because they aren&#39;t all going to be positive. Most of this likely won&#39;t start to become apparent until the 2nd half of 2021. The question is whether investors will care about these with such a stark detachment from having a care about present earnings right now.</li>\n<li>If people were hypothetically going to use a lot of that 36% chunk of savings from the past stimulus for consumption in 2021, they would likely have to liquidate a lot of $ from equity holdings. So any thought of the idea that making use of that big chunk of savings is going to be positive for equity markets may not be so sound. It all hinges on the misconceived notion that the savings rate is all just money people have sitting in bank accounts waiting to be spent. The reality is, most of that huge savings rate glut is the very thing that propped markets up throughout 2020. Remove that and markets probably start to deflate a bit.</li>\n<li>We are likely going to see more stimulus in the future with a dem majority now. While a lot of people don&#39;t like to talk politics on here (understandably), we&#39;re in a time where politics matter more than almost any other time to markets since ww2. More stimulus will possibly keep a lot of the effects going we&#39;ve seen this year, although there IS a limit to this. The question of how that $ goes to consumers matters a lot - especially for markets. For example, continuing stimulus check spending will affect markets and the economy far differently than investing in a major infrastructure renewal program. </li>\n<li>There still is no free lunch in markets, even if it may seem like it right now. Stimulus was 100% necessary, and will likely continue to be necessary to try to come out of the hole we&#39;re all in. With that said, if inflation rises and yields don&#39;t, inflation itself will cause a lot of problems in the economy. On the other hand, if yields rise higher than inflation itself, that will cause direct financial tightening. This is the main constraint on the ability to keep stimulating, and inflation doesn&#39;t necessarily need to go that high to cause problems in the economy. Remember that in 2018, interest rates at 3% forced the fed to lower their rates due to markets starting to throw fits and threatening recession, and that was a much less indebted and much healthier economy. The more indebted an economy is, the less it can tolerate increases in inflation before causing things to break (and subsequently reverting back to deflation). This is especially true when facing cost-push inflation which we are more likely to see vs. demand pull inflation.</li>\n<li>So long as stimulus and market support is on the table, I would expect volatile markets that can keep going up. There is a feedback loop in this belief structure that can keep markets going higher and provide a floor on selloffs. With that said, what I mention in point 6 is what will cause the clock to eventually strike midnight in my opinion, and markets <strong><em>may</em></strong> start to price this in somewhat in advance (whenever that is). With the new year just starting, I would suggest people take stock of their risk tolerance, goals, and time frame just to be aware of how they&#39;re positioned. Either way, I would personally expect intense periods of volatility both up and down followed by quiet grinding higher, frustrating people who are bearish.</li>\n<li>Looking through consumer spending data, we&#39;ve more or less come back to the base already, which makes sense when looking at income and savings levels also going back to the baseline. Some of this of course is a result of the winter Covid surge. With that said, I do not think $600 stimulus checks are going to be enough to make a huge dent in consumer spending unlike previous stimulus packages, but they should at least help keep some of the lights on. </li>\n</ol>\n\n<p>Thanks for reading if you made it this far - this took a while to put together, but I  at least had a good bit of the information in here already saved. I&#39;ll probably be slow to respond to this thread over the next day or two.</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/investing/comments/kujxvh/pent_up_demand_debunking_the_narrative_long_post/",
  "subreddit": "investing",
  "id": "kujxvh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706379512
}