{
  "author": "texasrecyclablebag",
  "original_created_utc": 1636579592,
  "title": "Why do people get mad at billionaires for evading taxes but no one is mad at the government for mismanaging trillions of dollars over the last 20 years",
  "created_utc": 1636585160,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Title. Tax evasion is definitely bad. It’s odd to me we’re not trying to coerce the government into better spending practices, which is something normal  people have perhaps more control over the outcome</p>\n\n<p>TLDR policy makers are focusing on taxing billionaires— which is great. But it seems nobody, not MSM not policy makers not Rogan not Q or whoever the heck you get your info from is addressing policy of our government seemingly mismanaging larger and larger sums of taxpayer money </p>\n\n<p>Edit: edited for clarity. Originally mentioned more about what people are talking about, but meant policy makers news etc having a deliberate focus on our government not devaluing the Dollar</p>\n</div><!-- SC_ON -->",
  "score": 150,
  "permalink": "/r/NoStupidQuestions/comments/qr4mv4/why_do_people_get_mad_at_billionaires_for_evading/",
  "subreddit": "NoStupidQuestions",
  "id": "qr4mv4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Title. Tax evasion is definitely bad. It’s odd to me we’re not trying to coerce\nthe government into better spending practices, which is something normal people\nhave perhaps more control over the outcome\n\nTLDR policy makers are focusing on taxing billionaires— which is great. But it\nseems nobody, not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトル 脱税は確かに悪い。私たちが強制的に改善しようとしないのはおかしい。\n政府にもっと良い支出をさせようとしないのは、普通の人なら\n結果をもっとコントロールできるはずです。\n\nTLDR 政策立案者は億万長者への課税に力を入れていますが、これは素晴らしいことです。しかし\nしかし、誰も、誰も...",
      "title": "億万長者の脱税には怒るのに、過去20年間で何兆円ものお金を誤って管理してきた政府には誰も怒らないのはなぜ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题。逃税肯定是不好的。对我来说，奇怪的是，我们没有试图胁迫政府采取更好的支出做法。\n迫使政府采取更好的支出方式，而这是正常人的事情\n可能对结果有更多的控制\n\nTLDR政策制定者正专注于对亿万富翁征税--这很好。但它\n似乎没有人，而不是...",
      "title": "为什么人们对亿万富翁的逃税行为感到愤怒，却没有人对政府在过去20年里对数万亿美元的管理不善感到愤怒？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題。逃稅肯定是不好的。對我來說，奇怪的是，我們沒有試圖脅迫政府採取更好的支出做法。\n迫使政府採取更好的支出方式，而這是正常人的事情\n可能對結果有更多的控制\n\nTLDR政策制定者正專注於對億萬富翁徵稅--這很好。但它\n似乎沒有人，而不是...",
      "title": "爲什麼人們對億萬富翁的逃稅行爲感到憤怒，卻沒有人對政府在過去20年裏對數萬億美元的管理不善感到憤怒？"
    }
  ]
}