{
  "author": "Remote_Winner_8192",
  "the_new_excerpt": "I just ran $3000 into GME this which is all I have in stocks, I tried making\nmoney the clean and fair way. Was up to $8,000 on Cciv from my initial\ninvestment of $2250 then these cuck scumbags announced after Robin Hood\nclosed(fuck Robin Hood btw.) and I woke up to $38/share and took my $2k…",
  "original_created_utc": 1614960030,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我只是跑了3000美元到GME这是我所有的股票，我试图使\n钱的干净和公平的方式。是在Cciv上高达8000美元，从我最初的。\n投资2250美元，然后这些王八蛋在罗宾汉之后宣布。\n收盘(去他妈的罗宾汉。)，我醒来时，38元/股，拿着我的2千块钱......",
      "title": "GME是死亡谷中的绿洲。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是跑了3000美元到GME這是我所有的股票，我試圖使\n錢的乾淨和公平的方式。是在Cciv上高達8000美元，從我最初的。\n投資2250美元，然後這些王八蛋在羅賓漢之後宣佈。\n收盤(去他媽的羅賓漢。)，我醒來時，38元/股，拿着我的2千塊錢......",
      "title": "GME是死亡谷中的綠洲。"
    }
  ],
  "title": "GME is the oasis in the valley of death",
  "created_utc": 1614976204,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just ran $3000 into GME this which is all I have in stocks, I tried making money the clean and fair way. Was up to $8,000 on Cciv from my initial investment of $2250 then these cuck scumbags announced after Robin Hood closed(fuck Robin Hood btw.) and I woke up to $38/share and took my $2k profit and jerked off with my said tears thinking about $8000. Then I picked myself up and told myself don’t worry about it, there’s more to be made. Now look at this fucking market it’s a red sand desert and GME is the fucking oasis. Here I am now. Either way, why play fair when the deck is stacked so high for the hedge funds and Wall Street. I’m holding, there are two outcomes here. We win and the world is right, we lose and this is not a market I want to invest in because I wasn’t born into a rich family so I’m not allowed to get rich. Fucking yolo, I apologize for my past transgressions GME it is the way. I won’t be drinking any piss, or getting any tattoos, not gonna suck any farts out of my wife’s boyfriends ass.....but I like the stock.</p>\n</div><!-- SC_ON -->",
  "score": 5518,
  "permalink": "/r/wallstreetbets/comments/lyez51/gme_is_the_oasis_in_the_valley_of_death/",
  "subreddit": "wallstreetbets",
  "id": "lyez51",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542581450
}