{
  "author": "Direct_Tourist_239",
  "original_created_utc": 1627624325,
  "title": "For men, do you flop your genitals on the toilet seat or do you tuck them in?",
  "created_utc": 1627642605,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I suppose this does not pertain to more ovular toilets with the cutout more commonly found in public restrooms. It would be for the more slightly more circular toilet seats found in homes. I think seat positioning is obviously important but just wondering what y&#39;all do with your junk. Also, for those who rest their genitals on the toilet seat, do you hold your penis as you urinate and return it when done?</p>\n\n<p>&#x200B;</p>\n\n<p>p.s. now is a good time to check your testicles for lumps</p>\n</div><!-- SC_ON -->",
  "score": 123,
  "permalink": "/r/TooAfraidToAsk/comments/oueu0m/for_men_do_you_flop_your_genitals_on_the_toilet/",
  "subreddit": "TooAfraidToAsk",
  "id": "oueu0m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I suppose this does not pertain to more ovular toilets with the cutout more\ncommonly found in public restrooms. It would be for the more slightly more\ncircular toilet seats found in homes. I think seat positioning is obviously\nimportant but just wondering what y'all do with your junk. Also, for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "公衆トイレでよく見かける、卵型の切り込みが入ったトイレには関係ないと思いますが\n公共のトイレでよく見かける 家庭で使われる、もう少し丸みを帯びた\n家庭用の丸い便座の場合です。シートの位置は当然重要だと思いますが\n重要だと思いますが、皆さんは自分の排泄物をどうしているのか気になります。また、...",
      "title": "男性の場合、性器を便座にペタッと乗せるのか、それともタックルするのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想这并不涉及更多的卵形马桶，这些马桶的切口在公共厕所中更为常见。\n我想这并不涉及公共厕所中比较常见的卵形马桶。它应该是针对家庭中更多的、稍微\n在家庭中发现的圆形马桶座。我认为座椅的位置显然是\n但只是想知道你们都是怎么处理自己的垃圾的。另外，对于...",
      "title": "对于男人来说，你是把生殖器翻在马桶盖上还是把它们塞进去？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想這並不涉及更多的卵形馬桶，這些馬桶的切口在公共廁所中更爲常見。\n我想這並不涉及公共廁所中比較常見的卵形馬桶。它應該是針對家庭中更多的、稍微\n在家庭中發現的圓形馬桶座。我認爲座椅的位置顯然是\n但只是想知道你們都是怎麼處理自己的垃圾的。另外，對於...",
      "title": "對於男人來說，你是把生殖器翻在馬桶蓋上還是把它們塞進去？"
    }
  ]
}