{
  "author": "Mattelambo",
  "original_created_utc": 1636535831,
  "title": "Favorite part of the bull market is seeing the happiness of ppl realizing enduring the bear market was 100% worth it ! Congratulations!!",
  "created_utc": 1636565889,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As the title says- one of my most favorite part of the bull market is seeing the happiness of ppl realizing enduring the bear market was 100% worth it ! </p>\n\n<p>Congratulations to everyone who kept their faith and patience ! It was a tough but extremely fruitful period which should make us appreciate even more the rewards! </p>\n\n<p>We are all blessed, so please let’s stay together as a community! Once again well done! And let’s keep going!</p>\n\n<p>Wish nothing but a lot of success, wealth and freedom to all of you! This is just the beginning!!</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/CryptoCurrency/comments/qqqezg/favorite_part_of_the_bull_market_is_seeing_the/",
  "subreddit": "CryptoCurrency",
  "id": "qqqezg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As the title says- one of my most favorite part of the bull market is seeing the\nhappiness of ppl realizing enduring the bear market was 100% worth it !\n\nCongratulations to everyone who kept their faith and patience ! It was a tough\nbut extremely fruitful period which should make us appreciate even…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルにあるように、私が強気の市場で最も好きなことの一つは、人々が耐え忍んでいることに気付いて喜んでいるのを見ることです。\n私が強気相場で最も好きなことは、人々が弱気相場に耐えることに100％の価値があったと実感して喜ぶ姿を見ることです。\n\n信念と忍耐を持ち続けた皆さん、おめでとうございます。厳しい時期でしたが\n厳しかったですが、非常に実りの多い期間であり、私たちに感謝しなければなりません。",
      "title": "強気の市場で好きなのは、弱気の市場に耐えることに100%の価値があったと気付いた人々の幸せを見ることです。おめでとうございます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说--我最喜欢的牛市部分之一是看到人们意识到忍受熊市是100%值得的幸福感!\n看到人们意识到忍受熊市是100%值得的，这就是幸福。\n\n祝贺每一个保持信心和耐心的人 这是一个艰难的\n这是一个艰难但极富成效的时期，它应该让我们更加珍惜......",
      "title": "牛市中最喜欢的部分是看到人们意识到忍受熊市是100%值得的幸福！\"。恭喜你！！！。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說--我最喜歡的牛市部分之一是看到人們意識到忍受熊市是100%值得的幸福感!\n看到人們意識到忍受熊市是100%值得的，這就是幸福。\n\n祝賀每一個保持信心和耐心的人 這是一個艱難的\n這是一個艱難但極富成效的時期，它應該讓我們更加珍惜......",
      "title": "牛市中最喜歡的部分是看到人們意識到忍受熊市是100%值得的幸福！\"。恭喜你！！！。"
    }
  ]
}