{
  "author": "bigbear0083",
  "the_new_excerpt": "Good Friday evening to all of you here on r/stocks [/r/stocks]. I hope everyone\non this sub made out pretty nicely in the market this past week, and is ready\nfor the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week\nbeginning June 14th,…",
  "original_created_utc": 1623452196,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/stocks[/r/stocks]をご覧の皆様、金曜日の夜はいかがお過ごしでしょうか。このサブの皆さんは\nこのサブにいる皆さんは、先週の市場でうまく利益を得て、これから始まる新しい取引の準備ができていることと思います。\n新しい週に向けて準備ができていることと思います。\n\nここでは、今週の取引の準備のために知っておくべきことをお伝えします。\n6月14日からの取引に備えて、知っておくべきことをまとめました...",
      "title": "2021年6月14日から始まる取引週のWall Street Week Ahead"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "祝各位在r/stocks [/r/stocks]的朋友们周五晚上好。我希望每个人\n在过去的一周里在市场上赚得盆满钵满，并准备好迎接新的一年。\n迎接新的交易周的到来。\n\n以下是你需要知道的一切，让你为本周的交易做好准备\n从6月14日开始，...",
      "title": "2021年6月14日开始的交易周，华尔街一周前瞻"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "祝各位在r/stocks [/r/stocks]的朋友們週五晚上好。我希望每個人\n在過去的一週裏在市場上賺得盆滿鉢滿，並準備好迎接新的一年。\n迎接新的交易周的到來。\n\n以下是你需要知道的一切，讓你爲本週的交易做好準備\n從6月14日開始，...",
      "title": "2021年6月14日開始的交易周，華爾街一週前瞻"
    }
  ],
  "title": "Wall Street Week Ahead for the trading week beginning June 14th, 2021",
  "created_utc": 1623527528,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Good Friday evening to all of you here on <a href=\"/r/stocks\">r/stocks</a>. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.</p>\n\n<p>Here is everything you need to know to get you ready for the trading week beginning June 14th, 2021.</p>\n\n<h1><strong>Markets await the Fed’s meeting before making the next big move in the week ahead - <a href=\"https://www.cnbc.com/2021/06/11/markets-await-the-feds-meeting-in-the-week-ahead.html\">(Source)</a></strong></h1>\n\n<hr/>\n\n<blockquote>\n<p>Stocks could trade sideways as investors await the outcome of the Federal Reserve’s June meeting next Wednesday afternoon.</p>\n\n<hr/>\n\n<p>The Fed’s two-day meeting is the big event for markets in the week ahead. Although the central bank is not expected to take any action, it could make tweaks to its forecasts for interest rates and inflation that market pros say could be market moving.</p>\n\n<hr/>\n\n<p>Stocks meandered Friday and the S&amp;P 500 finished at a new high, garnering a 0.4% gain for the week.</p>\n\n<hr/>\n\n<p>“Markets have to get past Wednesday before anyone makes huge bets,” said Scott Redler, chief strategic officer at T3Live.com. “It’s really that the Street’s looking at the next big obstacle — which is the Fed.”</p>\n\n<hr/>\n\n<p>The market is attuned to any discussion about the central bank’s bond-buying program. The program was initiated during the pandemic to provide liquidity to the markets and keep interest rates low. The Fed is widely expected to acknowledge it will start tapering back on that so-called quantitative easing program later this year.</p>\n\n<hr/>\n\n<p>Once the central bank signals it will cut back on its $120 billion monthly bond purchases, it is basically signaling a major shift in its policy from easing to tightening. The Fed is expected to signal a taper well before it takes any action, and its own forecast for interest rates does not show any increases through 2023.</p>\n\n<hr/>\n\n<p>Fed Chairman Jerome Powell briefs journalists after the central bank issues its statement at 2 p.m. ET on Wednesday. He is expected to sound dovish and assure markets the Fed’s policy will remain easy .</p>\n\n<hr/>\n\n<p>“Let’s say for some reason Powell intimates tapering could happen late this year, not just talk about it but do it,” said Mike Schumacher, head of rate strategy at Wells Fargo. “That would spook the market, or if we get a big increase in inflation projections that would get the markets a little spooked.”</p>\n\n<hr/>\n\n<h1>Economic calendar</h1>\n\n<p>There are a few economic reports worth watching, particularly Tuesday’s retail sales for May and the producer price index — a look at producer level inflation.</p>\n\n<hr/>\n\n<p>The Federal Reserve will also release its industrial production index data, which measures production and capacity in manufacturing, mining and other industries, on Tuesday.</p>\n\n<hr/>\n\n<p>“Essentially, I think nominal retail sales might be strong,” said Aneta Markowska, chief financial economist at Jefferies. “I just think the only thing that thing the market cares about right now is employment because that’s the only thing that can move the needle on the Fed.”</p>\n\n<hr/>\n\n<p>The markets this past week shrugged off a super hot consumer inflation reading for May, reported Thursday. Economists said the 5% jump in the consumer price index appears to be a temporary reaction to the reopening economy, supply chain disruptions and pent-up demand. But they also said it will take a few more reports to make sure it is not more persistent than the Fed currently expects.</p>\n\n<hr/>\n\n<p>The central bank has said it expects inflation to be high for a short period before falling back down, closer to 2%. The Fed will likely raise its forecast of 2.2% for this year, given the jump in recent inflation readings.</p>\n\n<hr/>\n\n<p>It also predicts that core inflation, as measured by the personal consumption expenditures price index, will be at 2% in 2022 and 2.1% in 2023.</p>\n\n<hr/>\n\n<p>Wells Fargo’s Schumacher said he is closely watching that inflation forecast, particularly for 2023. According to the Fed’s interest rate forecast, that is also the first time a group of central bank officials see the potential for an increase in the fed funds target rate.</p>\n\n<hr/>\n\n<p>So if inflation is higher in their view, the outlook for interest rates could be as well. That could move forward the forecast for the first rate hike, now forecast by a majority of the Fed in 2024.</p>\n\n<hr/>\n\n<p>“If that number goes up a tenth, that’s a non-event. If it goes up 0.3, it’s a lot in terms of the way the Fed looks at the world,” Schumacher said. The Fed has said it would tolerate inflation above its 2% target for a period of time before it acts.</p>\n\n<hr/>\n\n<p>Markowska of Jefferies doubts the Fed rate forecast will shift. The forecast is presented in a so-called “dot plot” with anonymous entries from central bank officials.</p>\n\n<hr/>\n\n<p>She noted in March, Federal Open Market Committee participants were split 11 to 7 against a 2023 hike, which means three officials would have to change their mind in order to move the median forecast.</p>\n\n<hr/>\n\n<p>“My base case is it won’t move,” she said. “I just feel like there hasn’t been enough definitive change in the data to really change the Fed’s forecast. Having said that, you just need three people to change their mind. Even if that median forecast goes up, Powell is just going to downplay it during the press conference.”</p>\n\n<hr/>\n\n<p>She pointed to the disappointing May employment report, which showed 559,000 jobs were added, 100,000 less than expected.</p>\n\n<hr/>\n\n<h1>Watch bonds</h1>\n\n<p>Stocks finished the past week mixed, with the Dow down 0.8% at 34,479, and the S&amp;P 500 eking out a gain of 0.4% to finish the week at a record 4,247. The Nasdaq, boosted by tech, gained nearly 1.9% to reach 14,069. Meanwhile the small-cap Russell 2000 outperformed the other indices, increasing by 2.2% for the week and landing at 2,335.</p>\n\n<hr/>\n\n<p>REITs were the best performing major sector for the week, up 2%, followed by the health care sector’s 1.9% gain. Consumer discretionary stocks rose 1.6%. Tech climbed 1.4%, helped by a decline in interest rates.</p>\n\n<hr/>\n\n<p>But the financial sector lost 2.4% as interest rates fell, and it was the worst performing sector this week. Financials fell with other cyclicals, like materials, off 2% for the week and industrials off 1.7%.</p>\n\n<hr/>\n\n<p>Meme stocks remained in the headlines and continued to trade with a high level of volatility. GameStop hit a high of $344.66 Tuesday and dropped as low as $206.13 Friday before closing at $233.34 per share.</p>\n\n<hr/>\n\n<p>Besides the wild ride by meme stocks in the past week, the market to watch was Treasurys, as yields took a surprising slide. There was a fairly dramatic move in the rate of the benchmark 10-year, watched most closely by investors, as it influences mortgages and other important lending rates.</p>\n\n<hr/>\n\n<p>The 10-year Treasury yield dipped under 1.43% on Friday. Yields move opposite price, so the move downward represented a buying surge.</p>\n\n<hr/>\n\n<p>“I feel like this entire move in Treasurys is technical and has nothing to do with fundamentals,” said Jefferies’ Markowska. She said institutions are finding super low yields in Treasury bills and the overnight rates markets. “There’s just an excess of cash that is spilling out to the longer maturities,” she said. “People are still very short.”</p>\n\n<hr/>\n\n<p>Markowska said the weaker than expected May jobs report spurred buying that forced some short investors, who bet on higher yields, to cover those positions as rates fell.</p>\n\n<hr/>\n\n<p>The fall in the 10-year yield, which hit a high of 1.75% in late March, has been a positive for stocks. It also has drawn some stock investors to tech and growth sectors, which had fallen out of favor.</p>\n\n<hr/>\n\n<p>“Most people in the market will tell you yields will rise significantly at some point. The question is when,” said Schumacher. Many forecasters expect the 10-year yield to reach 2% by the end of the year.</p>\n\n<hr/>\n\n<p>Finally, investors will also be watching headlines from President Joe Biden’s trip to the U.K. and Europe, where he is attending the G-7 and a meeting with NATO allies. He will hold a summit with Russian President Vladimir Putin on Wednesday in Geneva.</p>\n\n<hr/>\n</blockquote>\n\n<h1><strong>This past week saw the following moves in the S&amp;P:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/GueyyfO.png\">CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/NuXRM2t.png\">CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Indices for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/Ku39pLd.png\">CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Futures Markets as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/tZ7zbNp.png\">CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!</a>)</strong></h6>\n\n<h1><strong>Economic Calendar for the Week Ahead:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/PbxMWE9.png\">CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!</a>)</strong></h6>\n\n<h1><strong>Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/IsQMBjG.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for the Past Week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/8i4jyJJ.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Pullback/Correction Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/kq2tcNh.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Rally Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/8Odlhxi.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Most Anticipated Earnings Releases for this week:</strong></h1>\n\n<h6><strong>([CLICK HERE FOR THE CHART!]())</strong></h6>\n\n<p>(T.B.A. THIS WEEKEND.)</p>\n\n<h1><strong>Here are the upcoming IPO&#39;s for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/gFi9InA.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Friday&#39;s Stock Analyst Upgrades &amp; Downgrades:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/6yhS5DK.png\">CLICK HERE FOR THE CHART LINK #1!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/Ic5yEYB.png\">CLICK HERE FOR THE CHART LINK #2!</a>)</strong></h6>\n\n<hr/>\n\n<blockquote>\n<h1>Advance/Decline Lines Support New Highs</h1>\n\n<p>One of our favorite charts to get a quick read on the overall health of the market is a simple comparison of DJIA, S&amp;P 500, NASDAQ and Russell 2000 performance to cumulative advance/decline lines. From late October’s low through mid-February all four indexes moved nicely higher essentially in unison. Advance/decline lines were also all trending higher. It was in mid-February that NASDAQ turned briskly lower. Its advance/decline line also turned lower.</p>\n\n<p>When NASDAQ turned and its advance/decline began trending lower, DJIA, S&amp;P 500 and Russell 2000 essentially went nowhere and traded in a range. Bullishly, it appears NASDAQ’s advance/decline line appears to have bottomed in mid-May and is on the verge of eclipsing its peak from February. Broad participation across all the major indexes is a bullish sign and is generally indicative of a healthy move higher is underway. S&amp;P 500 closed at a new all-time high today. DJIA, NASDAQ and Russell 2000 are closing in on their respective all-time highs.</p>\n\n<p>In the near-term, new all-times are likely. However, June is the last month of NASDAQ’s “Best Eight Months” and historically soon after the start of the second half of the year, around mid-July, markets have stalled out and tended to slip into a sideways to lower trend. Inflation trends and the Fed are two possible catalysts that could clip the market’s wings this year. Inflation could prove to be more than just transitory and at some point, perhaps sooner than expected, the Fed will likely begin tapering asset purchases.</p>\n\n<h6><strong>(<a href=\"https://www.stocktradersalmanac.com/UploadedImage/AIN_0721_20210610_AD_Line_Chart.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Supply Chain Bottlenecks Push CPI Higher</h1>\n\n<p>Make that two consecutive months that CPI inflation has surprised meaningfully to the upside.</p>\n\n<p>The U.S. Bureau of Labor Statistics released its May inflation report this morning, June 10, revealing that the headline Consumer Price Index (CPI) rose 0.6% month over month and 5% year over year. The core CPI, which strips out food and energy, rose 0.7% month over month, and 3.8% year over year. Given strong base effects from rolling off weak data from a year ago, we find the month over month data more informative. With that context, more volatile components that are heavily tied to the economic reopening had the largest effects on the monthly increases, most notably prices for used vehicles, airfare, and rental cars.</p>\n\n<p>We continue to see strong evidence that supply chain bottlenecks paired with a rapid demand rebound are causing major price increases. The most visible example is in used car and truck prices, which surged 7.3% in May following a historic 10% rise in April. The supply of new vehicles is constrained in the near term because of semiconductor chip shortages, and as a result, used cars and trucks are being bid up in the secondary markets. The good news is that we expect these market imbalances to largely resolve themselves with time as supply, which has a longer ramp-up time than demand, recovers.</p>\n\n<p>“The inflation outlook has rightfully been top of mind since last month’s blowout report,” explained LPL Financial Chief Market Strategist Ryan Detrick. “Under the hood, though, we think the picture is a bit more sanguine than the headlines would suggest, and still believe inflation will be relatively well-contained over the intermediate-to-long term.”</p>\n\n<p>As seen in the LPL Chart of the Day, owners’ equivalent rent of primary residences, a measure of rents for non-rent-controlled residences in urban areas, has bounced off depressed levels. The move thus far, though, is likely best described as returning to the pre-pandemic trend rather than threatening to break away to new heights…for now. This measure is critical for future inflation prospects, as it is one of the largest components of CPI and is considered to be less volatile than other components. Movements observed in the series are, therefore, viewed as more structural in nature and thus have the potential to be “stickier.” At the moment, we do not believe that the rent component poses an imminent threat to the broader inflation picture, and is merely displaying an increasing willingness for consumers to rent following a massive shift in preference to own brought on by COVID-19.</p>\n\n<h6><strong>(<a href=\"https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/06/6.10.21-Blog-Chart.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Market-based measures of inflation expectations have also retreated from their fever pitch last month. 10-year breakeven inflation expectations, derived from the differences in nominal and real Treasury yields, have actually fallen since last month’s CPI report, not risen. And while we are hesitant to call that the peak in inflation expectations given ongoing bottlenecks in supply chains, there was a distinct air of a “buy the rumor, sell the news” dynamic to us.</p>\n\n<p>Taken altogether, we believe the Federal Reserve (Fed) will view today’s inflation data generally as confirmation of its preexisting stance that the majority of excess inflationary pressures will be transitory. In a vacuum, despite the headline inflation beat, this likely does little to change the Fed’s timetable for tapering asset purchases, and the market reaction for now looks to be confirming that view. The coming months will be telling, though, as we are now entering the “show me” phase of the inflation debate where market participants will be increasingly anxious for the Fed to prove its assertion that higher inflation will be transitory.</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>A Closer Look At New Highs</h1>\n\n<p>The S&amp;P 500 Index is flirting with new highs unlike nearly any time in history. In fact, it has now gone nine days in a row closing within 1% of an all-time high without breaking through. “There’s an old saying about not shorting a dull market. Well, lately it has been about as dull as it gets,” explained LPL Financial Chief Market Strategist Ryan Detrick. “The catch is other times that saw long streaks without a new high, yet very close to one, actually didn’t perform as well as one might expect.”</p>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/06/6.9.10-Blog-Chart-1.png?ssl=1\">CLICK HERE FOR THE CHART!</a></strong></h6>\n\n<p>Taking things a step further, the S&amp;P 500 has closed within 0.15% of an all-time high without closing at a new high for three straight days. In the history of the S&amp;P 500, that has only happened one other time, in September 1964. Stocks were flat three months later then and up only 2.6% six month later, so although this is only a sample size of one, a sharp move higher in the near term appears less likely.</p>\n\n<p>We’ve shared this next chart before, but given we are talking about new highs it is important to point it out again. New highs usually happen in clusters that can last for a decade or more. Given this market has been making new highs since 2013, despite the 2020 bear market, history would suggest there could be several more years before this strong run is done.</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/06/6.9.21-Blog-Chart-2.png?ssl=1\">CLICK HERE FOR THE CHART!</a></strong></h6>\n\n<p>Take another look above. This year has a good amount of new highs already and it isn’t even half way over. In fact, 26 new highs over the first five months of the year is the most for any year during the first five months since 32 new highs in 1998.</p>\n\n<p>Another angle on this: Should the S&amp;P 500 make a new high in June, it would make a new high every month for the first six months of the year. This rare feat last happened in 2014 and 1986 before that. The rest of the year those years added 5.0% and lost 3.5%, respectively.</p>\n\n<p>The S&amp;P 500 is only 0.13% away from the last all-time high set back on May 7. Odds do favor another new high will eventually take place, which means this bull market continues. In the LPL Chart of the Day we show that this new bull market is already up 89% in just over a year, giving it one of the best annualized returns ever for a bull market, although bull markets do tend to have strong annualized returns early.</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/06/6.9.21-Blog-Chart-3.png?ssl=1\">CLICK HERE FOR THE CHART!</a></strong></h6>\n\n<p>What happens after stocks make new highs? Here’s a chart we shared last August. The bottom line is investors shouldn’t be scared of new highs, even though many are scared of heights.</p>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/06/6.9.21-Blog-chart-4.png?ssl=1\">CLICK HERE FOR THE CHART!</a></strong></h6>\n\n<p>So there you have it, various looks at new all-time highs. Now we just have to make one!</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Big First 5 Months Gains Consolidate Over Worst Months</h1>\n\n<p>S&amp;P 500 is up an impressive 11.9% for the first five months of 2021. That is the 16th best gain for the first five months since 1950. As illustrated in the graph above, gains do beget gains and this bodes well for the year as a whole. But this does not diminish the seasonal pattern of consolidation and mostly sideways market action over the Worst Six Months May-October and even more so over the Worst Four Months July-October.</p>\n\n<p>We tabulated the gains for the top 20 first five month gains since 1950 and the gains for the last seven months of the year are still pretty solid averaging 9.4% vs. 14.7% for the top 20 first five months. But the bulk of those gains as you can see in the graph come from late-October to yearend.</p>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/3d76eb3a7ade3e0a5bd2c76e926e8097/1f542cabf408b99a-c5/s500x750/06643429565107777a36935f8f4e6edc3a652cc3.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/9003c5a181e5bd2fd37cd14041970feb/1f542cabf408b99a-a2/s500x750/cebaf4203ca34b95ce9bb792e8985e33109f2879.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Small Business Pulse Check</h1>\n\n<p>While U.S. economic conditions have certainly improved, and earnings momentum for S&amp;P 500 companies has been strong, U.S. small business conditions remain somewhat less stable. Notably, the NFIB Small Business Optimism Index has improved since last year (99.6 in May, up from the 90.9 low in April 2020), and according to the Federal Reserve, perhaps less than 200,000 U.S. small businesses failed due to the pandemic last year. Both figures are likely better than many had expected during the height of 2020’s economic stress. However, the aggregate economic foundation of small business in this country probably has a ways to go before it fully recovers. This may create more instability at this point in the recovery than is typically seen. The message here is that while most high-frequency economic data indeed looks good, we should remain mindful of still unstable areas of the economy that may not show up in many data sets.</p>\n\n<p>Fortunately, the National Federation of Independent Business (NFIB) provides economic and market participants with various survey results that deal with specific elements of small business operation. The NFIB not only surveys optimism, but they also compile data on hiring plans, compensation plans, capex plans, quality of labor, and sales expectations…among other items. Review of these data series indicates to us that there is still work left to do to get U.S. small businesses back on solid footing. As we can see from the LPL Chart of the Day below, business owners remain somewhat hesitant about their capital expenditure plans while hiring plans have trended more firmly with optimism. Still, other data tells us that NFIB survey respondents are cautious as to whether now is a good time to expand their business. Meanwhile, the surveys show that small business owners are indeed having a hard time finding quality labor and the cost of labor is rising, thus making job openings hard to fill.</p>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/06/6.11.21-Blog-Chart-1.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>“Recent NFIB data tells us that small businesses have gotten off the floor following the pandemic punch, but the black eye on a formidable part of the U.S. economy still lingers. With post-COVID economic re-openings in full swing, we remain hopeful that small businesses will soon recover enough to add that final boost to domestic conditions,” explained LPL Financial Director of Research Marc Zabicki.</p>\n\n<p>While small business conditions will be something to watch carefully through 2021 and into next year, we believe pent-up consumer demand could bode well for many establishments. We are expecting a robust summer traveling season that could have consumers readily opening their wallets. This may translate into further improvements in the NFIB optimism trend, provided that business owners find a solution to their current labor struggles.</p>\n</blockquote>\n\n<hr/>\n\n<p>Here are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-</p>\n\n<hr/>\n\n<blockquote>\n<ul>\n<li><strong>(T.B.A. THIS WEEKEND.)</strong></li>\n</ul>\n</blockquote>\n\n<hr/>\n\n<h6><strong>([CLICK HERE FOR NEXT WEEK&#39;S MOST NOTABLE EARNINGS RELEASES!]())</strong></h6>\n\n<p>(T.B.A. THIS WEEKEND.)</p>\n\n<h6><strong>([CLICK HERE FOR NEXT WEEK&#39;S HIGHEST VOLATILITY EARNINGS RELEASES!]())</strong></h6>\n\n<p>(T.B.A. THIS WEEKEND.)</p>\n\n<hr/>\n\n<p>Below are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:</p>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Monday 6.14.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/imGffK6.png\">CLICK HERE FOR MONDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!</a>)</h6>\n\n<h1><strong><em>Monday 6.14.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/iJd8X4R.png\">CLICK HERE FOR MONDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Tuesday  6.15.21 Before Market Open:</em></strong></h1>\n\n<h6>([CLICK HERE FOR TUESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())</h6>\n\n<p>(NONE.)</p>\n\n<h1><strong><em>Tuesday 6.15.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/n3lNi0a.png\">CLICK HERE FOR TUESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Wednesday 6.16.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/KpO6r7q.png\">CLICK HERE FOR WEDNESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Wednesday 6.16.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/wr0r664.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Thursday 6.17.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/9B6Atio.png\">CLICK HERE FOR THURSDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Thursday 6.17.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/2knlLsz.png\">CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 6.18.21 Before Market Open:</em></strong></h1>\n\n<h6>([CLICK HERE FOR FRIDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!]())</h6>\n\n<p>(NONE.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 6.18.21 After Market Close:</em></strong></h1>\n\n<h6>([CLICK HERE FOR FRIDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())</h6>\n\n<p>(NONE.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>(T.B.A. THIS WEEKEND.)</h1>\n\n<p><strong>(T.B.A. THIS WEEKEND.)</strong> (T.B.A. THIS WEEKEND.).</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=SPY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<h1>DISCUSS!</h1>\n\n<p>What are you all watching for in this upcoming trading week?</p>\n\n<hr/>\n\n<p>I hope you all have a wonderful weekend and a great trading week ahead <a href=\"/r/stocks\">r/stocks</a>.</p>\n</div><!-- SC_ON -->",
  "score": 46,
  "permalink": "/r/stocks/comments/nxskls/wall_street_week_ahead_for_the_trading_week/",
  "subreddit": "stocks",
  "id": "nxskls",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009743451
}