{
  "author": "FatherAzerun",
  "original_created_utc": 1640179868,
  "title": "How rich did one have to be in the US in 19th -20th centuries to still have live-in domestic servants / staff? Did the priority of which staff you had (Major Domo, Butler, Maid, Cook, Tutor, Nanny / Wetnurse) change over time? And when did full time (or live in) security become part of the mix?",
  "created_utc": 1640223527,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, I was listening to a podcast that was discussing the Hope Diamond and the MacLean family.  And in mentioning the death of their son Vinson, there had been a discussion of the expansion of household staff beforehand to include personal security to protect him from being kidnapped.&lt;/p&gt;\n\n&lt;p&gt;This led me to think about the changing role of free labor domestic servants in rich households in the United States.  How rich did you have to be from late industrialism on to still have domestic servants in the house?  I know there was a thread four years ago about the general decline of household staff in the United States (&lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/88emhp/why_were_livein_domestic_servants_so_much_more/\"&gt;https://www.reddit.com/r/AskHistorians/comments/88emhp/why_were_livein_domestic_servants_so_much_more/&lt;/a&gt;) but my interest is in the changes as to who &lt;strong&gt;&lt;em&gt;CONTINUES&lt;/em&gt;&lt;/strong&gt; to use domestic staff.  Was it the same general coterie of the extraordinarily wealthy, or did it narrow in numbers of households?    &lt;/p&gt;\n\n&lt;p&gt;And if (as the previous thread suggested) the changes in material culture suggested by Frank Trentmann (like dishwashers, etc.) changed the general interest in hiring domestic staff, did it also change the desirability of hiring certain &lt;em&gt;types&lt;/em&gt; of domestic staff? If you were rich, did you first hire a butler or cook or chauffer?   Was the rise of agencies of maids, au pairs, etc. making some types of servants less likely to be live in?  And when did personal security become a type of domestic servant in these households?  (I assume the Lindburg kidnapping may have had some cultural impact, but this is pretty far away from my own knowledge).&lt;/p&gt;\n\n&lt;p&gt;Just a weird random question that made be think of everything from Mitt Romney supposedly bringing his cook with him while he was on mission in the 1960s-70s to what it says about the creation of the fictional Batman that Wayne still has a single domestic servant in Alfred and it specifically is his butler.&lt;/p&gt;\n\n&lt;p&gt;I promise I am not trying to ask this as a present day question, because as an academic I have no expectation of ever being in the position of having to prioritize hiring domestic staff!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/rm5avm/how_rich_did_one_have_to_be_in_the_us_in_19th/",
  "subreddit": "AskHistorians",
  "id": "rm5avm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So, I was listening to a podcast that was discussing the Hope Diamond and the\nMacLean family. And in mentioning the death of their son Vinson, there had been\na discussion of the expansion of household staff beforehand to include personal\nsecurity to protect him from being kidnapped.\n\nThis led me to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで、あるポッドキャストを聴いていたら、ホープダイヤモンドと\nマクレーン家 息子のヴィンソンの死について触れている中で\n事前に家人の人数を増やし、個人的なことも含めて議論した。\n誘拐から彼を守るための警備です。\n\nその結果、私は...",
      "title": "19世紀から20世紀にかけてのアメリカで、住み込みの家政婦やスタッフを雇うには、どれくらいの金持ちでなければならなかったのだろうか？また、どのスタッフ（Major Domo, Butler, Maid, Cook, Tutor, Nanny / Wetnurse）を雇うかの優先順位は時代とともに変化していったのでしょうか？また、いつからフルタイム（または住み込み）の警備が加わったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我在听一个播客，它在讨论希望钻石和麦克林家族的问题。\n麦克莱恩家族。在提到他们的儿子文森的死亡时，曾有过以下讨论\n在提到他们的儿子文森之死时，曾讨论过事先扩大家庭工作人员，以包括个人安全\n以保护他不被绑架。\n\n这使我想到...",
      "title": "在19-20世纪的美国，一个人要多有钱才能有住家的仆人/工作人员？随着时间的推移，你所拥有的工作人员（主要仆人、管家、女仆、厨师、辅导员、保姆/奶妈）的优先次序是否发生了变化？全职（或住家）保安何时成为组合的一部分？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我在聽一個播客，它在討論希望鑽石和麥克林家族的問題。\n麥克萊恩家族。在提到他們的兒子文森的死亡時，曾有過以下討論\n在提到他們的兒子文森之死時，曾討論過事先擴大家庭工作人員，以包括個人安全\n以保護他不被綁架。\n\n這使我想到...",
      "title": "在19-20世紀的美國，一個人要多有錢纔能有住家的僕人/工作人員？隨着時間的推移，你所擁有的工作人員（主要僕人、管家、女僕、廚師、輔導員、保姆/奶媽）的優先次序是否發生了變化？全職（或住家）保安何時成爲組合的一部分？"
    }
  ]
}