{
  "author": "Kleecarim",
  "original_created_utc": 1630576551,
  "title": "Today I realized that we are, indeed, still early",
  "created_utc": 1630587665,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I currently work as a software developer, and most if not all people here work in IT as well. I am typing this on my phone and English is not my native language, so I apologize for any grammatical errors/typos</p>\n\n<p>Today, I went to get food with some colleagues, and because the cafeteria was pretty crowded we had to sit next to two people from another department (they were in their late 50s/early 60s). It wasn&#39;t a problem, our work environment is pretty casual, so my colleagues and I didn&#39;t talk with them at all, we just sat next to them and talked with each other</p>\n\n<p>Since, as I mentioned above, almost everyone here works in IT, I assume they did, too. This will get important later, since I was assuming most people working in IT had at least a slight understanding of cryptocurrencies.</p>\n\n<p>Anyways, while enjoying my meal, I overheard the two guys talking about stocks, finaces and got interested, so I started listening to them. It was a mistake. One of them was talking about his son, and how he decided to &quot;gamble his whole money away with BTC&quot;. After that, their while conversation was just circlejerking about how Bitcoin is only used by criminals, how it has no value and so on. It was really hard for me to stay quiet when one of them was talking about &quot;how the gouvernment will ban the bitcoin&quot; and go from house to house to &quot;collect peoples bitcoins&quot;.</p>\n\n<p>I get that not everyone has an idea about how cryptocurrencies work, but damn, I thought people working in IT would at least understand how blockchain technology works. I talked about crypto with some colleague before, and even though they didn&#39;t understand the details, at least they had a basic understanding of blockchain technology in general</p>\n\n<p>All in all, if people who work in IT still don&#39;t have an idea what btc really is and how it works, I don&#39;t even want to know what people who aren&#39;t tech savvy think btc is lol. I guess we really are early, even with all the adoption we are seeing lately</p>\n\n<p>Edit: I just remebered one hilarious thing. The guy that was talking about his son mentioned his son went almost all in in Tesla stocks and BTC, and kept refering to &quot;real money&quot; as &quot;shitcoin&quot; (actual quote). I really had a hard time trying not to laugh.</p>\n\n<p>I am sure that this was one of you degenerates. If anyone of you has a Father aged around 60 working in IT in Austria and told them fiat is a &quot;shitcoin&quot;, dm me lol</p>\n</div><!-- SC_ON -->",
  "score": 270,
  "permalink": "/r/CryptoCurrency/comments/pgepjb/today_i_realized_that_we_are_indeed_still_early/",
  "subreddit": "CryptoCurrency",
  "id": "pgepjb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I currently work as a software developer, and most if not all people here work\nin IT as well. I am typing this on my phone and English is not my native\nlanguage, so I apologize for any grammatical errors/typos\n\nToday, I went to get food with some colleagues, and because the cafeteria was\npretty…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は現在、ソフトウェア開発者として働いていますが、ここにいるほとんどの人は、同じようにIT分野で働いています。\nIT業界で働いている人が多いですね。私はこれを携帯電話で入力しており、英語は私の母国語ではありません。\n英語は母国語ではありませんので、文法的な間違いや誤字脱字があったら申し訳ありません。\n\n今日、私は何人かの同僚と一緒に食べ物を取りに行きました。\nかなり...",
      "title": "今日は、私たちは確かに、まだ早いと思いました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我目前是一名软件开发人员，这里的大多数人（如果不是全部的话）也都在从事IT工作。\n在IT行业工作的人也是如此。我是用手机打的，英语不是我的母语。\n语言，所以我对任何语法错误/错误表示歉意。\n\n今天，我和一些同事一起去吃东西，因为食堂很\n很...",
      "title": "今天我意识到，我们确实还在早期"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我目前是一名軟件開發人員，這裏的大多數人（如果不是全部的話）也都在從事IT工作。\n在IT行業工作的人也是如此。我是用手機打的，英語不是我的母語。\n語言，所以我對任何語法錯誤/錯誤表示歉意。\n\n今天，我和一些同事一起去喫東西，因爲食堂很\n很...",
      "title": "今天我意識到，我們確實還在早期"
    }
  ]
}