{
  "author": "fuzzyduck88",
  "original_created_utc": 1648198423,
  "title": "If you are never selling then why do you desperately want a bull run soon?",
  "created_utc": 1648214599,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Iv seen posts where people comment “I’m never selling” or “I’m hodling until crypto replaces the need for fiat”… and then the same user comments hours later being all excited for and wishing for a bull run. &lt;/p&gt;\n\n&lt;p&gt;Why?&lt;/p&gt;\n\n&lt;p&gt;Shouldn’t ye be hoping it stays low for a couple of years so you can accumulate if you plan on never selling? Is it not ironic to plan on accumulating and hodling as much as possible while also hoping the price rises in the short term? &lt;/p&gt;\n\n&lt;p&gt;Tldr: a lot of people don’t know what they want, they want to get rich, but don’t exactly know how yet.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 307,
  "permalink": "/r/CryptoCurrency/comments/tnhny6/if_you_are_never_selling_then_why_do_you/",
  "subreddit": "CryptoCurrency",
  "id": "tnhny6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Iv seen posts where people comment “I’m never selling” or “I’m hodling until\ncrypto replaces the need for fiat”… and then the same user comments hours later\nbeing all excited for and wishing for a bull run.\n\nWhy?\n\nShouldn’t ye be hoping it stays low for a couple of years so you can accumulate\nif…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "絶対に売らない」「売れるまで持っている」とコメントしている投稿を見たことがあります。\n暗号が不換紙幣の必要性を置き換える」...そして、その数時間後に同じユーザーがコメントする。\n強気になることを期待しています。\n\nなぜですか？\n\nあなた方は、数年間は低水準で推移することを望んでいるはずです。\nもし",
      "title": "もしあなたが決して売らないのなら、なぜすぐにでも強気でいられるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到一些帖子，人们评论说 \"我永远不会卖掉 \"或 \"我一直在保管，直到加密货币取代法币\"。\n而几个小时后，同一用户又发表评论说，\"我永远不会卖掉 \"或 \"我将一直持有加密货币，直到取代对法币的需求\"。\n对牛市的到来感到兴奋，并祝愿牛市的到来。\n\n为什么？\n\n你们难道不应该希望它在几年内保持低位，这样你们就可以积累\n如果...",
      "title": "如果你从不卖出，那么你为什么急切地希望很快出现牛市？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到一些帖子，人們評論說 \"我永遠不會賣掉 \"或 \"我一直在保管，直到加密貨幣取代法幣\"。\n而幾個小時後，同一用戶又發表評論說，\"我永遠不會賣掉 \"或 \"我將一直持有加密貨幣，直到取代對法幣的需求\"。\n對牛市的到來感到興奮，並祝願牛市的到來。\n\n爲什麼？\n\n你們難道不應該希望它在幾年內保持低位，這樣你們就可以積累\n如果...",
      "title": "如果你從不賣出，那麼你爲什麼急切地希望很快出現牛市？"
    }
  ]
}