{
  "author": "psychotrader00",
  "the_new_excerpt": "The stock market fell on Wednesday, with all three major indexes closing\nmodestly red as market participants continue to digest the corporate earnings\nseason and new commentary from the Federal Open Markets Committee.\n\nThe FOMC said the effective distribution of the vaccine in the US has…",
  "original_created_utc": 1619642247,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "水曜日の株式市場は下落し、主要3指数とも小幅な赤字で終了しました。\n市場参加者は、企業の決算期や連邦公開市場委員会の新たなコメントを消化するため、小幅な赤\n市場参加者は、企業の決算シーズンと連邦公開市場委員会の新しいコメントを消化し続けています。\n\nFOMCは、米国でのワクチンの有効な配布が...",
      "title": "本日2021年4月28日（水）のマーケット・リカップをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "周三股市下跌，所有三个主要指数均收盘上涨。\n小幅收红，因为市场参与者继续消化企业盈利季和联邦公开市场委员会的新评论。\n季和联邦公开市场委员会的新评论。\n\nFOMC表示，美国的疫苗的有效分布已经...",
      "title": "以下是今天（2021年4月28日，星期三）的市场回顾"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "週三股市下跌，所有三個主要指數均收盤上漲。\n小幅收紅，因爲市場參與者繼續消化企業盈利季和聯邦公開市場委員會的新評論。\n季和聯邦公開市場委員會的新評論。\n\nFOMC表示，美國的疫苗的有效分佈已經...",
      "title": "以下是今天（2021年4月28日，星期三）的市場回顧"
    }
  ],
  "title": "Here is a Market Recap for today Wednesday, April 28, 2021",
  "created_utc": 1619663122,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The stock market fell on Wednesday, with all three major indexes closing modestly red as market participants continue to digest the corporate earnings season and new commentary from the Federal Open Markets Committee. </p>\n\n<p>The FOMC said the effective distribution of the vaccine in the US has improved economic conditions but reiterated interest rates will remain near-zero and the asset purchasing program in place. The Fed said, “Amid progress and strong policy support, indicators of economic activity and employment have risen.” The committee remains optimistic about the rebound in economic activity, describing the most affected sectors as “having shown improvement”, but shows no signs of slowing quantitative easing or raising interest rates. With more than 8 million people still out of jobs compared to pre-pandemic levels, FOMC reiterated its commitment to supporting the economy.</p>\n\n<p>The Fed also said inflation has “risen” but attributed the higher readings to “transitory factors”, meaning they expect any rise in inflationary pressures to be short-lived. Central bank officials warn that higher inflation reading could be coming as a result of measuring year-over-year changes from a highly unusual 2020. In other words, The Fed looks at changes in prices in a year-over-year format. Data for March and April of this year could therefore reflect large price “increases” because they are being compared against March and April in 2020 that saw massive price drops. </p>\n\n<p>Economic data published since the Fed’s last meeting in March 17 have largely supported their brighter outlook. Consumer spending surged 9.8% in March and initial jobless claims dropped to pandemic-era lows as more states continue reopening measures. In other news, according to a report by the Conference Board, consumer confidence has surged to a 14-month high in April as effective distribution of the vaccine and easing of social distancing guidelines in the US allows for the economy to gradually reopen. The Conference Board&#39;s monthly consumer confidence index jumped to a reading of 121.7 in April, or well above the 113.0 expected. Lynn Franco, senior director of economic indicators at the Conference Board, said in a statement, “Consumers’ assessment of current conditions improved significantly in April, suggesting the economic recovery strengthened further in early Q2. Consumers’ optimism about the short-term outlook held steady this month. Consumers were more upbeat about their income prospects, perhaps due to the improving job market and the recent round of stimulus checks.”</p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>The US trade deficit rose to a new record high in March, according to data from the Department of Commerce. The deficit increased by 4% to $90.6 billion, higher than the $88 expected by economists</li>\n<li>Mortgage applications fell 2.5% week-on-week, according to the Mortgage Bankers Association. This follows a jump of 8.6% last week, which had marked the first rise in seven weeks. </li>\n<li>A deep-sea mining robot on a test mission to bring up rocks rich in cobalt and nickel from the floor of the Pacific Ocean has malfunctioned and is lost.</li>\n<li>According to multiple reports, Nio began development on more affordable SUV to cater for the mid to low price markets and is also working on an upgraded 70-kilowatt-hour battery pack using lithium-iron-phosphate batteries, which are cheaper than the ones the company uses now</li>\n<li>Nio said in a tweet from its official handle that its global vision is gaining steam and the company is making plans to expand to Norway as part of its plan to expand into Europe. Press Conference on May 6th at 1 am PDT </li>\n<li>The European Union fined Credit Suisse Group AG, Bank of America Corp. and Credit Agricole SA a small amount for illegally colluding on trades in government bond markets at the expense of their clients.</li>\n<li><strong>**Please note that current stock price was written premarket and does not reflect intraday changes*\\</strong>*</li>\n<li>Advanced Auto Parts (AAP) target raised by Wedbush from $210 to $230 at Outperform. Stock currently around $197</li>\n<li>AMD with two target raises. Stock currently around $85\n\n<ul>\n<li>- Raymond James from $100 to $110 at Outperform</li>\n<li>Susquehanna from $115 to $125 at Positive</li>\n</ul></li>\n<li>Boyd Gaming (BYD) with two target raises. Stock currently around $69\n\n<ul>\n<li>Deutsche Bank from $71 to $77 Buy</li>\n<li>Morgan Stanley (MS) from $66 to $78 at Overweight</li>\n</ul></li>\n<li>Capital One (COF) with a host of target raises. Consensus price target $165 at Outperform. Stock currently around $139</li>\n<li>Crocs (CROX) target raised by Robert W Baird from $100 to $135 at Outperform. Stock currently around $98</li>\n<li>EA target raised by KeyCorp from $165 to $170 at Overweight. Stock currently around $143</li>\n<li>F5 Networks (FFIV) target raised by Needham &amp; Co from $245 to $255 at Buy. Stock currently around $205</li>\n<li>Alphabet (GOOG, $GOOGL) with a host of target raises. Consensus price target $2850 at Buy. Stock currently around $2290</li>\n<li>Lam Research (LRCX) with a host of target raises. Consensus price target $730 at Buy. Stock currently around $645</li>\n<li>Microsoft (MSFT) with a host of target raises. Consensus price target $300 at Outperform. Stock currently around $262</li>\n<li>Signature Bank (SBNY) with two target raises. Stock currently around $252\n\n<ul>\n<li>Wedbush from $280 to $305 at Outperform</li>\n<li>Raymond James from $290 to $300 at Strong-Buy</li>\n</ul></li>\n<li>Tesla (TSLA) target raised by Morgan Stanley to $900 at Overweight. Stock currently around $704</li>\n<li>Visa (V) with a host of target raises. Consensus price target $265 at Outperform. Stock currently around $230</li>\n<li>NXP Semiconductors (NXPI) with a host of target raises. Consensus price target $230 at Outperform. Stock currently around $203</li>\n</ul>\n\n<p>“To bear trials with a calm mind robs misfortune of its strength and burden.&quot; - Seneca</p>\n</div><!-- SC_ON -->",
  "score": 75,
  "permalink": "/r/stocks/comments/n0o7ex/here_is_a_market_recap_for_today_wednesday_april/",
  "subreddit": "stocks",
  "id": "n0o7ex",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776217955
}