{
  "author": "CalgaryChris77",
  "original_created_utc": 1647448685,
  "title": "Do American parents not talk to their daughters about periods until they happen?",
  "created_utc": 1647465703,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This question comes from all the controversy about the new Disney movie turning Red.  Apparently many parents are very upset that this movie is marketed to kids, but discusses (very lightly) periods and pads. &lt;/p&gt;\n\n&lt;p&gt;I only have boys, but we&amp;#39;ve explained to them from a fairly young age what Mom&amp;#39;s pads are and why they are needed. I assumed if we had girls we would have talked a lot more about it, but it sounds like the opposite.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/NoStupidQuestions/comments/tfm7q4/do_american_parents_not_talk_to_their_daughters/",
  "subreddit": "NoStupidQuestions",
  "id": "tfm7q4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This question comes from all the controversy about the new Disney movie turning\nRed. Apparently many parents are very upset that this movie is marketed to kids,\nbut discusses (very lightly) periods and pads.\n\nI only have boys, but we've explained to them from a fairly young age what Mom's\npads are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この質問は、ディズニーの新しい映画「ターニング・オブ・ザ・イヤー」に関するすべての論争からきています。\n赤色です。どうやら多くの親が、この映画が子供向けに販売されていることに非常に怒っているようです。\n生理やナプキンについて（ごく軽く）触れています。\n\n私には男の子しかいませんが、かなり幼い頃から、お母さんの\nパッドは...",
      "title": "アメリカの親は、生理が来るまで娘に生理の話をしないのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个问题来自于所有关于迪士尼新电影转折的争议\n红色。显然，许多家长对这部电影面向儿童销售非常不满。\n但却讨论了（非常轻微的）月经和护垫。\n\n我只有男孩，但我们从小就向他们解释了妈妈的\n护垫是什么......",
      "title": "美国父母在月经来潮之前不和女儿谈及月经吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個問題來自於所有關於迪士尼新電影轉折的爭議\n紅色。顯然，許多家長對這部電影面向兒童銷售非常不滿。\n但卻討論了（非常輕微的）月經和護墊。\n\n我只有男孩，但我們從小就向他們解釋了媽媽的\n護墊是什麼......",
      "title": "美國父母在月經來潮之前不和女兒談及月經嗎？"
    }
  ]
}