{
  "author": "Confucius3000",
  "original_created_utc": 1645616126,
  "title": "Were Medieval Wild Men the equivalent of todays' Uncontacted Tribes?",
  "created_utc": 1645633614,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been reading &amp;quot;Dagobert, roi des Francs&amp;quot; by Maurice Bouvier-Ajam, and I&amp;#39;ve been pretty intrigued about his mentions of the medieval &amp;quot;Wild Men&amp;quot; communities, who lived in the Old Forests of Merovingian Francia, were barely evangelized and had &amp;quot;prehistoric&amp;quot; (author&amp;#39;s words) customs and technologies.&lt;/p&gt;\n\n&lt;p&gt;This made me think of the uncontacted indigenous tribes of the Amazon, who live away from westernized civilization and keep to their own customs.&lt;/p&gt;\n\n&lt;p&gt;Deforestation in Western Europe wasn&amp;#39;t as rampant in Late Antique times, and Wild Men were known to live in those Ancient Forests; this is not dissimilar to the pristine parts of the Amazon where uncontacted tribes do still live.&lt;/p&gt;\n\n&lt;p&gt;Am I too far off in thinking these Wild Men were Europe&amp;#39;s equivalent of Uncontacted Tribes? Or are they only a mythological concept? Are there any noteworthy books describing their cultures?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/AskHistorians/comments/szfd9q/were_medieval_wild_men_the_equivalent_of_todays/",
  "subreddit": "AskHistorians",
  "id": "szfd9q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been reading \"Dagobert, roi des Francs\" by Maurice Bouvier-Ajam, and I've\nbeen pretty intrigued about his mentions of the medieval \"Wild Men\" communities,\nwho lived in the Old Forests of Merovingian Francia, were barely evangelized and\nhad \"prehistoric\" (author's words) customs and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "モーリス・ブーヴィエ=アジャム著の「ダゴベール、ロイ・デ・フラン」を読んでいます。\n中世の「野人」の共同体についての言及に、かなり興味をそそられました。\nメロヴィング朝時代のフランシアの古い森に住んでいた人々は、ほとんど伝道されることなく\n前時代的」（著者の言葉）な風習があり、...",
      "title": "中世の野生人は、現代の「未接触部族」に相当するのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在读莫里斯-布维耶-阿贾姆的《达戈贝尔，法国国王》，我对他提到的中世纪 \"野人 \"社区非常感兴趣。\n我对他提到的中世纪的 \"野人 \"群体很感兴趣。\n他提到了中世纪的 \"野人 \"群体，他们生活在梅罗文尼亚的老森林里，几乎没有被传过福音，并且\n他们生活在默罗文尼亚的旧森林中，几乎没有被传教，并且有 \"史前的\"（作者的话）习俗和...",
      "title": "中世纪的野人是否相当于今天的未接触部落？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在讀莫里斯-布維耶-阿賈姆的《達戈貝爾，法國國王》，我對他提到的中世紀 \"野人 \"社區非常感興趣。\n我對他提到的中世紀的 \"野人 \"羣體很感興趣。\n他提到了中世紀的 \"野人 \"羣體，他們生活在梅羅文尼亞的老森林裏，幾乎沒有被傳過福音，並且\n他們生活在默羅文尼亞的舊森林中，幾乎沒有被傳教，並且有 \"史前的\"（作者的話）習俗和...",
      "title": "中世紀的野人是否相當於今天的未接觸部落？"
    }
  ]
}