{
  "author": "da_f3nix",
  "the_new_excerpt": "This is simple and self-explanatory. Everyone should be able to choose before\nposting whether their post is included or excluded from the moons distribution.\n\nAs suggested by u/jwinterm [/u/jwinterm] in the preliminary discussion, this is\nsomething that could be done just by tagging threads with a…",
  "original_created_utc": 1620937872,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これはシンプルでわかりやすいですね。誰もが投稿する前に選択できるようにすべきです。\n自分の投稿が月の配布に含まれるかどうかを、投稿前に選択できるようにすべきです。\n\n事前の議論でu/jwinterm [/u/jwinterm]が提案したように、これは\nスレッドに...のタグをつけるだけでできることです。",
      "title": "提案：MOONSを獲得するためにポストを自己除外するオプション"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这很简单，不言而喻。每个人都应该能够在发帖前选择\n他们的帖子是否被纳入或排除在月球分布之外。\n\n正如u/jwinterm [/u/jwinterm]在初步讨论中所建议的，这是\n这一点可以通过给线程加上标签来实现。",
      "title": "建议：可以选择自我排除一个帖子获得MOONS的权利"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這很簡單，不言而喻。每個人都應該能夠在發帖前選擇\n他們的帖子是否被納入或排除在月球分佈之外。\n\n正如u/jwinterm [/u/jwinterm]在初步討論中所建議的，這是\n這一點可以通過給線程加上標籤來實現。",
      "title": "建議：可以選擇自我排除一個帖子獲得MOONS的權利"
    }
  ],
  "title": "Proposal: option to self-exclude a post from gaining MOONS",
  "created_utc": 1620974125,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is simple and self-explanatory. Everyone should be able to choose before posting whether their post is included or excluded from the moons distribution.</p>\n\n<p>As suggested by <a href=\"/u/jwinterm\">u/jwinterm</a> in the preliminary discussion, this is something that could be done just by tagging threads with a specific flair, and then admins could not count karma from posts with that flair. </p>\n\n<p>Sometimes you just want to focus the community on something and don&#39;t want to be accused of moon farming. Sometimes you just want to say thanks or post with a light heart, without the drama of moons dynamics, or just don&#39;t care about gaining from the message you&#39;re leaving. In general, as the main principle, one should always be able to decide whether or not to receive something: it&#39;s true that you can choose to not create a vault and receive moons but you should receive them where you want and, at the same time, decide to selectively exclude the distribution mechanism in some of your content.</p>\n\n<p>Perhaps, this won&#39;t be an option that many will tick, but it could be interesting to have it and could help to create some spaces where discussion flows tranquil. In this sense, a second step could be that of applying the same optionality to comments.</p>\n\n<p><a href=\"https://www.reddit.com/poll/nbqmvv\">View Poll</a></p>\n</div><!-- SC_ON -->",
  "score": 467,
  "permalink": "/r/CryptoCurrency/comments/nbqmvv/proposal_option_to_selfexclude_a_post_from/",
  "subreddit": "CryptoCurrency",
  "id": "nbqmvv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590796941
}