{
  "author": "AptitudeSky",
  "original_created_utc": 1646105477,
  "title": "If 144 million people can move markets in an instant, what happens when mass adoption truly begins?",
  "created_utc": 1646124376,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Russia has about 144 million people within it&amp;#39;s territory (contested and non contested). After sanctions and severe economic restrictions placed on the nation and it&amp;#39;s inhabitants by the rest of the world due to the invasion of Ukraine, crypto is pumping, and BTC alone is up 13% or so. On top of that, it&amp;#39;s likely that a smaller percentage of that population are the ones buying given current worldwide so really the movement happened with a small percentage of that population amount. &lt;/p&gt;\n\n&lt;p&gt;If this event can cause this amount price of an increase, what happens when a global population of a little under 8 BILLION decides to adopt BTC as a hedge against uncertainty and war or simply as a means to transact with minimal fees in a transparent and decentralized way? &lt;/p&gt;\n\n&lt;p&gt;Here is a hopium induced thought, what if the change in BTC price today was true and held a similar linear relationship with each approximate 2% increase in adoption (measured by the corresponding increase in % of world population)? &lt;/p&gt;\n\n&lt;p&gt;Alright, so I gave this simple model a try. I increased world population at 2%. I then found a multiplication factor by dividing the increase in BTC price by the percentage of the population that adopted today presumably and just assumed that would hold true for each 2% adoption. I then carried that out through 2% intervals until we got close to full world adoption and found a value for BTC assuming a spot price of $43,000.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/0zoq5m72yok81.png?width=1500&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=a7075db314300dc435d6679ed7a64f6bf4373ef3\"&gt;https://preview.redd.it/0zoq5m72yok81.png?width=1500&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=a7075db314300dc435d6679ed7a64f6bf4373ef3&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d say there is a pretty bright future as seen above and this is with an extremely limited/rudimentary model with lot&amp;#39;s of assumptions. I think that answer is conservative because of halving, significant future inflation, and other factors of demand and BTC&amp;#39;s scarce supply. &lt;/p&gt;\n\n&lt;p&gt;What do you all think?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 359,
  "permalink": "/r/CryptoCurrency/comments/t3y5vb/if_144_million_people_can_move_markets_in_an/",
  "subreddit": "CryptoCurrency",
  "id": "t3y5vb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Russia has about 144 million people within it's territory (contested and non\ncontested). After sanctions and severe economic restrictions placed on the\nnation and it's inhabitants by the rest of the world due to the invasion of\nUkraine, crypto is pumping, and BTC alone is up 13% or so. On top of…"
}