{
  "author": "MaBrowser",
  "original_created_utc": 1627909383,
  "title": "Why are adverse reactions to vaccines more common in younger people than older people?",
  "created_utc": 1627930343,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was looking through the adverse reactions to the COVID vaccines, and I found it interesting that the CDC report that younger people are more likely to experience (or at the very least report) an adverse reaction to the COVID vaccines than if you were older. I would have thought it would be the opposite (due to older people having weaker immune systems)? Can someone explain this phenomenon? Is this something of all vaccines? What&#39;s the biological mechanism here?</p>\n\n<p>Refer to table 1 of <a href=\"https://www.cdc.gov/mmwr/volumes/70/wr/mm7008e3.htm\">https://www.cdc.gov/mmwr/volumes/70/wr/mm7008e3.htm</a>: 64.9% of 18 to 49 report an adverse reaction. I thought perhaps it was to do with unequal category sizes (18 to 49, versus say 50 to 64), but I don&#39;t think it is as this represents 2/3 of the total.</p>\n\n<p>P.S. I really don&#39;t want to get into a debate about whether or not people should take the vaccine or not (I think people at risk, definitely should). I simply want to understand why vaccines effect different age groups in different ways.</p>\n\n<p>(For some reason moderators removed this post... This is a legitimate medicinal question, but for some reason I&#39;m not even allowed to ask it)</p>\n</div><!-- SC_ON -->",
  "score": 232,
  "permalink": "/r/askscience/comments/owe2bp/why_are_adverse_reactions_to_vaccines_more_common/",
  "subreddit": "askscience",
  "id": "owe2bp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was looking through the adverse reactions to the COVID vaccines, and I found\nit interesting that the CDC report that younger people are more likely to\nexperience (or at the very least report) an adverse reaction to the COVID\nvaccines than if you were older. I would have thought it would be the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "COVIDワクチンの副反応に目を通していたのですが、興味深いことに\n興味深いのは、CDCの報告によると、若年層の方がより多くの副反応を経験していることです。\n興味深いのは、CDCの報告によると、若い人の方が年配の人よりもCOVIDワクチンの副反応を経験する（少なくとも報告する）可能性が高いということです。\n興味深いことに、CDCの報告によると、若い人の方が年配の人よりもCOVIDワクチンの副反応を経験する（あるいは少なくとも報告する）可能性が高いそうです。私はそれが...と思っていました。",
      "title": "ワクチンの副反応は、なぜ高齢者よりも若年層に多いのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在查看COVID疫苗的不良反应，我发现\n有趣的是，CDC报告说，年轻人更有可能出现（或至少报告）COVID疫苗的不良反应。\n遇到（或至少报告）COVID的不良反应\n疫苗的不良反应（或至少报告）的可能性比年龄大的人要大。我本以为会是这样的...",
      "title": "为什么疫苗的不良反应在年轻人中比老年人更常见？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在查看COVID疫苗的不良反應，我發現\n有趣的是，CDC報告說，年輕人更有可能出現（或至少報告）COVID疫苗的不良反應。\n遇到（或至少報告）COVID的不良反應\n疫苗的不良反應（或至少報告）的可能性比年齡大的人要大。我本以爲會是這樣的...",
      "title": "爲什麼疫苗的不良反應在年輕人中比老年人更常見？"
    }
  ]
}