{
  "author": "Stunning_Variation_1",
  "original_created_utc": 1632185526,
  "title": "Accidentally broke into someone’s car?",
  "created_utc": 1632216058,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was doing doordash tonight in an apartment complex. Mind you it’s already dark where I live, and there weren’t a lot of streetlights around. I drive a silver Nissan Altima. I get out to hand the customer their food, and I walk back to what I think is my car, and it wouldn’t unlock. I have Triple A Roadside Assistance so I called them to unlock the door, and when I got in it I realized that it wasn’t my car. This car was literally the EXACT same as my car, from the color, model, and year. My car was parked 2 spaces down but there was a big black truck in between the 2 cars so I couldn’t see my car. I didn’t take anything out of the other person’s car, and I called the police to let them know what happened. This was a complete accident. Do you think charges will be pressed against me?</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/NoStupidQuestions/comments/ps7wc0/accidentally_broke_into_someones_car/",
  "subreddit": "NoStupidQuestions",
  "id": "ps7wc0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was doing doordash tonight in an apartment complex. Mind you it’s already dark\nwhere I live, and there weren’t a lot of streetlights around. I drive a silver\nNissan Altima. I get out to hand the customer their food, and I walk back to\nwhat I think is my car, and it wouldn’t unlock. I have Triple A…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今夜は団地の中でdoordashをしていました。私の住んでいるところはもう暗いのですが\n周りには街灯があまりありませんでした。私の車はシルバーの\n日産アルティマです。お客さんに料理を渡すために車を降りて、自分の車と思われるところまで戻ってきて\n自分の車だと思って戻ると、ロックが解除されていませんでした。私はトリプルA...",
      "title": "誰かの車に誤って侵入してしまった？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今晚我在一个公寓楼里做斗地主。提醒你，我住的地方已经很黑了\n我住的地方已经很黑了，而且周围没有很多路灯。我开着一辆银色的\n尼桑Altima。我下车把食物递给顾客，然后我走回我认为是我的车的地方。\n我认为这是我的车，但它无法解锁。我有三重A...",
      "title": "不小心闯入别人的车？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今晚我在一個公寓樓裏做鬥地主。提醒你，我住的地方已經很黑了\n我住的地方已經很黑了，而且周圍沒有很多路燈。我開着一輛銀色的\n尼桑Altima。我下車把食物遞給顧客，然後我走回我認爲是我的車的地方。\n我認爲這是我的車，但它無法解鎖。我有三重A...",
      "title": "不小心闖入別人的車？"
    }
  ]
}