{
  "author": "xXx_Bunga_xXx",
  "the_new_excerpt": "Look, I get that some of you genuinely tried to transfer to another broker, but\nthat legitimate gambling addiction that you have to the stonk market prevented\nyou from closing out all your positions and letting your trades settle (even\nthough if you did you probably wouldn't have lost 80% by…",
  "original_created_utc": 1613623987,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你看，我得到，你们中的一些人真正试图转移到另一个经纪人，但。\n你对石器市场的合法赌瘾被阻止了。\n你不会平仓所有的头寸，并让你的交易结算（即使是你自己的交易）。\n虽然如果你这样做，你可能不会失去80％的... ...",
      "title": "如果你还在用罗宾汉的身份，你就会被讽刺为弱智了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你看，我得到，你們中的一些人真正試圖轉移到另一個經紀人，但。\n你對石器市場的合法賭癮被阻止了。\n你不會平倉所有的頭寸，並讓你的交易結算（即使是你自己的交易）。\n雖然如果你這樣做，你可能不會失去80％的... ...",
      "title": "如果你還在用羅賓漢的身份，你就會被諷刺爲弱智了"
    }
  ],
  "title": "You're unironically retarded if you're still using Robinhood",
  "created_utc": 1613658282,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Look, I get that some of you genuinely tried to transfer to another broker, but that legitimate gambling addiction that you have to the stonk market prevented you from closing out all your positions and letting your trades settle (even though if you did you probably wouldn&#39;t have lost 80% by FOMO&#39;ing into weed).</p>\n\n<p>But by staying in Robinhood, you scream &quot;Oh please daddy Vlad Tenev, please impale my asshole one more time like you did with Geee Emmm eeeEEEEE!!!&quot; </p>\n\n<h1>Why you should use a real broker and stop using Robinhood:</h1>\n\n<p><strong>Not being glued to a chart all day</strong></p>\n\n<p>How many of you have your eyes glued to a fucking chart all day long because Robinhood is mobile and looks cool? This seriously is not helping any of your positions. You&#39;re more likely to dump what might be a solid play too early because you&#39;re staring at the ticker and have TP hands and panic when SPY is down 1% for the day. Think about all the times where if you held a position for a little while longer you would&#39;ve printed. Robinhood looks amazing as an app and keeps your eyes glued to the screen. If the sell button is right in front of you at all times, you&#39;re gonna be more likely to dump when you shouldn&#39;t. Get a broker with a shitty looking UI so you aren&#39;t glued to a chart all day. Trust me, your relationships and work will thank you.</p>\n\n<p><strong>Access to penny stocks</strong></p>\n\n<p>Ever want to trade OTC penny stocks and make some real bank? It might be a good thing that some people don&#39;t have access to them given the inherent risk. But for some unknown reason, RH makes it easy to yolo your whole life savings into 0DTE so penny stocks are pretty safe compared to the options you can trade.</p>\n\n<p>I wrote a DD on a penny stock on another subreddit and I got DMs about how to buy it on RH. Bruh please stop. Use a real broker.</p>\n\n<p><strong>Actual customer support</strong></p>\n\n<p>I haven&#39;t used Robinhood customer support for anything, but I&#39;ve heard it&#39;s god awful. I&#39;m gonna sound like a shill, but I&#39;ve been using Schwab for the past six years and the customer support is amazing.</p>\n\n<p><strong>Instant transfers</strong></p>\n\n<p>Again, gonna sound like I work for Schwab or something (I wish). Schwab and many other big banks allow you to instant transfer from your checking/savings to your brokerage account with no limit. </p>\n\n<p><strong>Huge assets under management</strong></p>\n\n<p>Vanguard, Fidelity, and Schwab have 6.6, 3.3, and 3.23 trillion AUM. That&#39;s a lot of focken money. These brokers had no issues with the clearinghouses and did not limit trading on meme stocks. Gee Em Eeeeee would probably be 2000 if everyone used them.</p>\n\n<p><strong>Cool desktop/web apps</strong></p>\n\n<p>Wanna look like a cool badass trader to pickup bitches at your local library? Schwab has a FREE trading platform with many cool features like the dark pool block trades. Add fancy crayons and lines to your charts too! Not gonna lie this app probably makes it harder to stop looking at stonks all day thus defeating point number 1. </p>\n\n<p><a href=\"https://preview.redd.it/kco97ssy16i61.png?width=1920&amp;format=png&amp;auto=webp&amp;s=ccb7623017890bb5a0ea17d471ea54bec64c0f19\">Stolen from google images</a></p>\n\n<p><strong>Cons of not using Robinhood</strong>:</p>\n\n<p>I&#39;m not blind to the pros of Robinhood. </p>\n\n<p>- Looks cool</p>\n\n<p>- Options are free (Schwab charges $0.65 per option contract)</p>\n\n<p>- Easy to use</p>\n\n<p>&#x200B;</p>\n\n<p>So please, do yourself a favor and use a real broker :)</p>\n</div><!-- SC_ON -->",
  "score": 7013,
  "permalink": "/r/wallstreetbets/comments/lme4i6/youre_unironically_retarded_if_youre_still_using/",
  "subreddit": "wallstreetbets",
  "id": "lme4i6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332887616
}