{
  "author": "dannyboy1st",
  "original_created_utc": 1642623824,
  "title": "Why does no one talk about racism perpetrated by black people?",
  "created_utc": 1642633678,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s like an elephant in the room that I don&amp;#39;t know why doesnt get talked about. I hear white asian Hispanic people wrecked for saying racist shit (well deserved) but whenever I hear black people do the same thing it&amp;#39;s like no one wants to call it out or thinks its funny. Anecdotally majority of the racism I&amp;#39;ve dealt with is by black people and then whenever I hear others mention something similar it&amp;#39;s like &amp;quot; black people are oppressed and cannot therefore be racist&amp;quot; or some deflecting woke view point and just giving them a pass. I think a pretty decent example is the noticeable increase in black on Asian crime. Regardless, I want to know what you guys think, am I wrong and are black people who are racist called out equally or is their a difference in how we respond to certain racists on their color?&lt;/p&gt;\n\n&lt;p&gt;Edit: I just remembered this lack of accountability on the part of the black community can really sour other people and other minorities to the BLM movement and cause them to think &amp;quot; well, I&amp;#39;ve dealt with too much racism from you to actively advocate for your plight&amp;quot; just a thought&lt;/p&gt;\n\n&lt;p&gt;Edit×2: Everybody is saying &amp;quot; black people deal with systemic oppression&amp;quot; your not wrong but you&amp;#39;re inadvertently agreeing with me when that&amp;#39;s your only arguement and are seeing exactly what I&amp;#39;m seeing in the media&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 182,
  "permalink": "/r/TooAfraidToAsk/comments/s7zjqm/why_does_no_one_talk_about_racism_perpetrated_by/",
  "subreddit": "TooAfraidToAsk",
  "id": "s7zjqm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It's like an elephant in the room that I don't know why doesnt get talked about.\nI hear white asian Hispanic people wrecked for saying racist shit (well\ndeserved) but whenever I hear black people do the same thing it's like no one\nwants to call it out or thinks its funny. Anecdotally majority of…"
}