{
  "author": "dannyboy1st",
  "original_created_utc": 1642623824,
  "title": "Why does no one talk about racism perpetrated by black people?",
  "created_utc": 1642633678,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s like an elephant in the room that I don&amp;#39;t know why doesnt get talked about. I hear white asian Hispanic people wrecked for saying racist shit (well deserved) but whenever I hear black people do the same thing it&amp;#39;s like no one wants to call it out or thinks its funny. Anecdotally majority of the racism I&amp;#39;ve dealt with is by black people and then whenever I hear others mention something similar it&amp;#39;s like &amp;quot; black people are oppressed and cannot therefore be racist&amp;quot; or some deflecting woke view point and just giving them a pass. I think a pretty decent example is the noticeable increase in black on Asian crime. Regardless, I want to know what you guys think, am I wrong and are black people who are racist called out equally or is their a difference in how we respond to certain racists on their color?&lt;/p&gt;\n\n&lt;p&gt;Edit: I just remembered this lack of accountability on the part of the black community can really sour other people and other minorities to the BLM movement and cause them to think &amp;quot; well, I&amp;#39;ve dealt with too much racism from you to actively advocate for your plight&amp;quot; just a thought&lt;/p&gt;\n\n&lt;p&gt;Edit×2: Everybody is saying &amp;quot; black people deal with systemic oppression&amp;quot; your not wrong but you&amp;#39;re inadvertently agreeing with me when that&amp;#39;s your only arguement and are seeing exactly what I&amp;#39;m seeing in the media&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 182,
  "permalink": "/r/TooAfraidToAsk/comments/s7zjqm/why_does_no_one_talk_about_racism_perpetrated_by/",
  "subreddit": "TooAfraidToAsk",
  "id": "s7zjqm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It's like an elephant in the room that I don't know why doesnt get talked about.\nI hear white asian Hispanic people wrecked for saying racist shit (well\ndeserved) but whenever I hear black people do the same thing it's like no one\nwants to call it out or thinks its funny. Anecdotally majority of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "部屋の中の象のようなもので、なぜ話題にならないのかわからない。\n白人のアジア系ヒスパニック系が人種差別的なことを言ったとして、非難されるのはよく聞く話です（よくあることですが）。\nしかし、黒人が同じことをするのを聞くと、誰もそのようなことはしない。\nを呼びたいし、面白いと思っている。逸話的には、大多数が...",
      "title": "なぜ、黒人が行う人種差別について誰も語らないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这就像房间里的一头大象，我不知道为什么没有人谈论它。\n我听到白人、亚洲人和西班牙人因为说了种族主义的狗屁话而遭到破坏（当之无愧），但每当我听到黑人做了同样的事，就好像没有人知道。\n但每当我听到黑人做同样的事情时，好像没有人\n但每当我听到黑人做同样的事情时，就好像没有人想把它叫出来或认为它很有趣。从轶事来看，大多数人都...",
      "title": "为什么没有人谈及黑人犯下的种族主义？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這就像房間裏的一頭大象，我不知道爲什麼沒有人談論它。\n我聽到白人、亞洲人和西班牙人因爲說了種族主義的狗屁話而遭到破壞（當之無愧），但每當我聽到黑人做了同樣的事，就好像沒有人知道。\n但每當我聽到黑人做同樣的事情時，好像沒有人\n但每當我聽到黑人做同樣的事情時，就好像沒有人想把它叫出來或認爲它很有趣。從軼事來看，大多數人都...",
      "title": "爲什麼沒有人談及黑人犯下的種族主義？"
    }
  ]
}