{
  "author": "rightful_hello",
  "original_created_utc": 1635526817,
  "title": "Am I homophobic for thinking that non binary doesn’t make sense?",
  "created_utc": 1635560285,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve never had the balls to say it, but it’s been bothering me for a while and I think that Reddit would be the best place to ask since I don’t know any non binary people.</p>\n\n<p>What the hell is a non binary? I’ve been told  that it’s people that don’t identify as male or female. But now you’re explaining to me what they are not, not what they are.</p>\n\n<p>If you had to explain what a non binary is, without saying what it isn’t, what would you say?</p>\n\n<p>Cuz I feel like ,It’s the same as asking someone what is a banana, and you tell him that it’s not an apple and it’s not orange. Then what exactly is a banana?</p>\n\n<p>Am I just being stupid? Cuz I legit don’t understand.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/qihbya/am_i_homophobic_for_thinking_that_non_binary/",
  "subreddit": "TooAfraidToAsk",
  "id": "qihbya",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve never had the balls to say it, but it’s been bothering me for a while and I\nthink that Reddit would be the best place to ask since I don’t know any non\nbinary people.\n\nWhat the hell is a non binary? I’ve been told that it’s people that don’t\nidentify as male or female. But now you’re explaining…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今まで言う勇気がありませんでしたが、ずっと気になっていました。\nノンバイナリーの知り合いがいないので、Redditで聞くのが一番だと思います。\nバイナリの人を知らないので、Redditで聞くのが一番だと思います。\n\nノンバイナリーって一体何？男性とも女性ともつかない人たちのことだと聞いたことがあります。\n男性とも女性ともつかない人たちのことだと聞いています。でも今、あなたが説明しているのは...",
      "title": "ノンバイナリーが意味をなさないと考える私はホモフォビアなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从来没有胆量说出来，但它已经困扰了我一段时间，我认为Reddit是最好的地方。\n我认为Reddit是问这个问题的最好地方，因为我不认识任何非二进制人士。\n二元的人。\n\n非二进制到底是什么？有人告诉我，它是指那些不被识别为男性或女性的人。\n识别为男性或女性的人。但现在你在解释...",
      "title": "我认为非二进制没有意义，是恐同症吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從來沒有膽量說出來，但它已經困擾了我一段時間，我認爲Reddit是最好的地方。\n我認爲Reddit是問這個問題的最好地方，因爲我不認識任何非二進制人士。\n二元的人。\n\n非二進制到底是什麼？有人告訴我，它是指那些不被識別爲男性或女性的人。\n識別爲男性或女性的人。但現在你在解釋...",
      "title": "我認爲非二進制沒有意義，是恐同症嗎？"
    }
  ]
}