{
  "author": "bawdyanarchist",
  "original_created_utc": 1625762493,
  "title": "If They Want to Ban it, *THEN YOU SHOULD BUY IT*",
  "created_utc": 1625794527,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>Edit: Catchy title obviously references crypto ... not black tar heroin.</em><br/>\n<em>Some good lolz in comments tho - reducto ad absurdum style.</em></p>\n\n<p>There&#39;s a lot of reasons why many have avoided Monero. And although it has much respect from most of the community, people are still hesitant. They&#39;re afraid it&#39;ll get banned or regulated out of existence. Afraid they&#39;ll get put on the terror watch list (half /joke). Afraid it won&#39;t go up in price. </p>\n\n<p>I could give a dissertation on why these risks are fairly minor (elsewhere I have); but instead, for the sake of argument let&#39;s even concede those risks and go from there. So okay, pretend we see major exhanges delist XMR. Govts flag you as a person of interest. And the price stagnates. </p>\n\n<h4>This is all the more reason to own and support Monero</h4>\n\n<p>I don&#39;t know about you, but when the govt suppresses an idea who&#39;s time has come, I fight even harder. Obviously those ideas are a threat to their monopolistic ambitions; so if they ban or threaten to ban Monero, then obviously we&#39;re on to something important.</p>\n\n<p>Perhaps even more important than madgainz, is holding an asset the govt <em>can&#39;t</em> censor, at least not at the protocol level. The whole point is to build and use technology that makes their censorship irrelevant. And with atomic swaps just months away, we&#39;re closer than ever.</p>\n\n<p>I don&#39;t know about you, but I didn&#39;t get into crypto so that I can be a bitch to obeying what money the govt says I&#39;m allowed to own or use. They want to ban encryption?? Fuck them, I&#39;ll encrypt all my devices. They want to ban BitTorrent?? Fuck them, I&#39;ll use a VPN/Tor/I2P and download what I want. They want to tell me what kind of scientific/political opinions I&#39;m allowed to have on social media?? Fuck them I&#39;ll embrace their label as an &quot;extremist&quot; and join alternative platforms.</p>\n\n<p>You should allocate at some percenatage to XMR (held in your own wallet), <em>precisely because those risks are non-zero.</em> Because if freedom, censorship resistance, and challenging their monopoly on money are more than just talking points, then we ought to put our money where our mouth is.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/ogb1u6/if_they_want_to_ban_it_then_you_should_buy_it/",
  "subreddit": "CryptoCurrency",
  "id": "ogb1u6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Edit: Catchy title obviously references crypto ... not black tar heroin.\nSome good lolz in comments tho - reducto ad absurdum style.\n\nThere's a lot of reasons why many have avoided Monero. And although it has much\nrespect from most of the community, people are still hesitant. They're afraid\nit'll…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Edit: キャッチーなタイトルは明らかにcrypto（ブラックタールヘロインではなく）を指している。\nコメントの中にはいくつかの良い笑いがありました。\n\n多くの人がMoneroを避けてきた理由はたくさんあります。そして、Moneroは多くの\nコミュニティのほとんどから尊敬されていますが、人々はまだ躊躇しています。彼らが恐れているのは\nそれは...",
      "title": "もし彼らがそれを禁止したいのであれば、あなたはそれを買うべきです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：醒目的标题显然是指加密货币......而不是黑焦油海洛因。\n评论里有一些很好的笑料--归谬法的风格。\n\n许多人避开Monero有很多原因。虽然它有很多\n虽然它得到了社区大多数人的尊重，但人们仍然犹豫不决。他们担心\n它将...",
      "title": "如果他们想禁止它，*那么你就应该购买它*。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：醒目的標題顯然是指加密貨幣......而不是黑焦油海洛因。\n評論裏有一些很好的笑料--歸謬法的風格。\n\n許多人避開Monero有很多原因。雖然它有很多\n雖然它得到了社區大多數人的尊重，但人們仍然猶豫不決。他們擔心\n它將...",
      "title": "如果他們想禁止它，*那麼你就應該購買它*。"
    }
  ]
}