{
  "author": "Aardbeilove",
  "the_new_excerpt": "Some of my own examples:\n\nI loved anything social, but now I dread texting my friends or relatives. I want\nto be the thoughtful person I always was, but the idea of people replying to\ntexts and starting a conversation makes me not even reach out sometimes.\n\nWhen I go to work, it's almost feels…",
  "original_created_utc": 1617876100,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私自身の例をいくつか紹介します。\n\nソーシャルなものは何でも好きでしたが、今では友人や親戚にメールするのが怖くなりました。今までのように\n思慮深い人になりたいと思っていますが、メールに返信して会話を始める人がいると思うと、時々連絡を取るのも嫌になります。\n会話を始めることを考えると、連絡を取るのも億劫になります。\n\n仕事に行くと、ほとんどの場合は...。",
      "title": "以前は好きだったことができなくなるほど疲れている人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我自己的一些例子。\n\n我喜欢任何社交活动，但现在我害怕给我的朋友或亲戚发短信。我想\n我一直是个有思想的人，但人们对我的回复的想法是\n短信和开始对话，让我有时连联系都没有。\n\n当我上班时，几乎感觉... ...",
      "title": "还有人做以前喜欢的事情太累了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我自己的一些例子。\n\n我喜歡任何社交活動，但現在我害怕給我的朋友或親戚發短信。我想\n我一直是個有思想的人，但人們對我的回覆的想法是\n短信和開始對話，讓我有時連聯繫都沒有。\n\n當我上班時，幾乎感覺... ...",
      "title": "還有人做以前喜歡的事情太累了嗎？"
    }
  ],
  "title": "Is anyone else too tired to do things they used to like?",
  "created_utc": 1617887666,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Some of my own examples:</p>\n\n<p>I  loved anything social, but now I dread texting my friends or relatives.  I want to be the thoughtful person I always was, but the idea of people  replying to texts and starting a conversation makes me not even reach  out sometimes.</p>\n\n<p>When I go to work,  it&#39;s almost feels liking hiding and I sit quietly at my desk, when  before I&#39;d always look for colleagues to chat with. Sometimes I wonder  if I&#39;ve gotten more awkward.</p>\n\n<p>I  really like my job and even got some new chores I&#39;m really excited  about, yet when I have time to spare to do them, I&#39;m writing this post  on reddit.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/NoStupidQuestions/comments/mmogwy/is_anyone_else_too_tired_to_do_things_they_used/",
  "subreddit": "NoStupidQuestions",
  "id": "mmogwy",
  "is_self": true,
  "media": null,
  "is_video": false
}