{
  "author": "Azhz96",
  "original_created_utc": 1658313663,
  "title": "Why would anyone living in EU with 4 weeks of vacation and paid sickdays ever move to work in the US?",
  "created_utc": 1658326988,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The thought of not having 4-5 weeks of vacation where you still get paid, or getting sick and still not getting paid sounds like a nightmare to me.&lt;/p&gt;\n\n&lt;p&gt;If I moved to the US and started working there then I would probably end up on the streets due to lack of days off. I can barely keep it together despite having 4 weeks paid vacation each year and get paid when I&amp;#39;m sick.&lt;/p&gt;\n\n&lt;p&gt;My life would be miserable in the US, I would sooner or later just break and end up on the streets.&lt;/p&gt;\n\n&lt;p&gt;So how do people come to the conclusion that they want to move to the US and start working there? Personally I would never want to move and work there, it just sounds so damn miserable to live and especially work there.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/w3j6ld/why_would_anyone_living_in_eu_with_4_weeks_of/",
  "subreddit": "NoStupidQuestions",
  "id": "w3j6ld",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The thought of not having 4-5 weeks of vacation where you still get paid, or\ngetting sick and still not getting paid sounds like a nightmare to me.\n\nIf I moved to the US and started working there then I would probably end up on\nthe streets due to lack of days off. I can barely keep it together…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まだ給料がもらえる4〜5週間の休暇がないと思うと、あるいは\n病気になっても給料がもらえないなんて、悪夢のようだ。\n\nもし私がアメリカに移住して働き始めたら、休みがなくて路頭に迷うことになるでしょうね。\n休みがなくて路頭に迷うかもしれない。私は、かろうじて一緒にいることができる...",
      "title": "4週間の休暇と有給休暇のあるEUに住んでいる人が、なぜ米国で働くために移動することがあるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "想到没有4-5周的假期而你还能拿到工资，或\n生病后仍然没有工资，这对我来说是个噩梦。\n\n如果我搬到美国并开始在那里工作，那么我可能会因为没有假期而流落街头。\n由于缺乏休息日而流落街头。我只能勉强维持生计......",
      "title": "为什么住在欧盟的人有4周的假期和带薪病假，却要搬到美国去工作？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "想到沒有4-5周的假期而你還能拿到工資，或\n生病後仍然沒有工資，這對我來說是個噩夢。\n\n如果我搬到美國並開始在那裏工作，那麼我可能會因爲沒有假期而流落街頭。\n由於缺乏休息日而流落街頭。我只能勉強維持生計......",
      "title": "爲什麼住在歐盟的人有4周的假期和帶薪病假，卻要搬到美國去工作？"
    }
  ]
}