{
  "author": "TadpoleAngel",
  "original_created_utc": 1640561621,
  "title": "At the turn of the 20th century, my great, great grandfather - a butcher - moved his family of about 10 people from a small town in Galicia in Austria-Hungary - one of the poorest areas in Europe - all the way to New York City and then to Philadelphia. What would this journey have looked like?",
  "created_utc": 1640608939,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This sounds incredibly complicated to me, and stories like An American Tail (mice aside!) gloss over much of the minutia. Obviously, one could not simply ask google maps to take you from Buczacz to Philadelphia! So how did he (and hundreds of thousands like him) do it in and what would this trip look like in 1900? How much of the trip would have been overland, and by what means? How would he have figured out how to plan this epic undertaking, including presumably acquiring immigration documents and travel visas, plotting all the ports of entry and exit, and finding places for 8 children of all ages to sleep? Does a ticket for an infant on a train or a ship cost the same as for an adult? And how much would it have cost him and how on Earth does a butcher with perhaps only one adult son pay for it all?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/rp8vcu/at_the_turn_of_the_20th_century_my_great_great/",
  "subreddit": "AskHistorians",
  "id": "rp8vcu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This sounds incredibly complicated to me, and stories like An American Tail\n(mice aside!) gloss over much of the minutia. Obviously, one could not simply\nask google maps to take you from Buczacz to Philadelphia! So how did he (and\nhundreds of thousands like him) do it in and what would this trip…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは私には信じられないほど複雑に聞こえるし、「An American Tail」のような話は\n(ネズミはともかくとして！）細かいことはあまり気にしないでください。もちろん、単純に\nブシャーチからフィラデルフィアまで、google mapにお願いします。では、どうやって彼（と\n彼のような何十万人もの人々がそれをやり遂げ、この旅は何をもたらすのだろうか...。",
      "title": "20世紀初頭、肉屋を営んでいた私の曽祖父は、10人ほどの家族を、オーストリア・ハンガリーのガリシア地方というヨーロッパでも最も貧しい地域の小さな町から、ニューヨーク、そしてフィラデルフィアに移住させました。この旅はどのようなものだったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这对我来说听起来非常复杂，而像《美国的尾巴》这样的故事\n(撇开老鼠不谈！）掩盖了许多细枝末节。显然，人们不可能简单地\n要求谷歌地图把你从布扎茨带到费城！那么，他是如何（以及如何）把布扎茨带到费城的？那么他是如何（和\n那么，他（和成千上万像他一样的人）是如何做到的，这次旅行又会有什么...",
      "title": "在20世纪之交，我的曾曾祖父--一个屠夫--将他的10口之家从奥匈帝国加利西亚的一个小镇--欧洲最贫穷的地区之一--一路搬到纽约市，然后再搬到费城。这个旅程会是什么样子？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這對我來說聽起來非常複雜，而像《美國的尾巴》這樣的故事\n(撇開老鼠不談！）掩蓋了許多細枝末節。顯然，人們不可能簡單地\n要求谷歌地圖把你從布扎茨帶到費城！那麼，他是如何（以及如何）把布扎茨帶到費城的？那麼他是如何（和\n那麼，他（和成千上萬像他一樣的人）是如何做到的，這次旅行又會有什麼...",
      "title": "在20世紀之交，我的曾曾祖父--一個屠夫--將他的10口之家從奧匈帝國加利西亞的一個小鎮--歐洲最貧窮的地區之一--一路搬到紐約市，然後再搬到費城。這個旅程會是什麼樣子？"
    }
  ]
}