{
  "author": "MeoMix",
  "original_created_utc": 1639004813,
  "title": "The tech DOT brings to our ecosystem is the same vibes as ETH showing up when crypto was just BTC.",
  "created_utc": 1639031958,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I frequently see confusion regarding the technical details of Polkadot (DOT). Here is a really quick explanation. If you have questions - please ask and I&amp;#39;ll try to explain.&lt;/p&gt;\n\n&lt;p&gt;Okay, so, imagine the history of crypto as it relates to tech advancements in this space.&lt;/p&gt;\n\n&lt;p&gt;First, there was BTC. This represents mono-chain value transfers.&lt;/p&gt;\n\n&lt;p&gt;Then, there was ETH. This advanced our ecosystem to mono-chain computation where the most basic computation is value transfer, but then loans etc.&lt;/p&gt;\n\n&lt;p&gt;Then ETH became bloated and fees went up. Competitors appeared - also computation mono-chains, but lower fees and better technicals. First-mover network effects result in BTC and ETH maintaining their value.&lt;/p&gt;\n\n&lt;p&gt;Now, our ecosystem is at the point where we have cross-chain value-transfer bridges a la &amp;quot;wrapped tokens.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Next? Cross-chain computation-transfers. This goes beyond just moving value between chains - its having one chain tell another chain to compute something that it&amp;#39;s more specialized at computing than the first chain and having both chains trust the results.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;This&lt;/em&gt; is Polkadot. It provides not &lt;em&gt;just&lt;/em&gt; cross-chain value transfer but allows for cross-chain &lt;em&gt;computation.&lt;/em&gt;  This is why it is important. It unlocks the next step in crypto which is analogous to the introduction of ETH into a pre-ETH ecosystem. It introduces computation to an area that currently only has value transfer.  &lt;/p&gt;\n\n&lt;p&gt;p.s. parachains launch on DOT &lt;strong&gt;Dec 18&lt;/strong&gt;. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 185,
  "permalink": "/r/CryptoCurrency/comments/rc3i25/the_tech_dot_brings_to_our_ecosystem_is_the_same/",
  "subreddit": "CryptoCurrency",
  "id": "rc3i25",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I frequently see confusion regarding the technical details of Polkadot (DOT).\nHere is a really quick explanation. If you have questions - please ask and I'll\ntry to explain.\n\nOkay, so, imagine the history of crypto as it relates to tech advancements in\nthis space.\n\nFirst, there was BTC. This…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ポルカドット(DOT)の技術的な詳細について、よく混乱を見ることがあります。\nここでは、本当に簡単な説明をします。ご不明な点があれば、ご質問ください。\nを説明します。\n\nさて、では暗号の歴史と技術の進歩との関係を想像してみましょう。\nこの空間は\n\nまず、BTCがありました。これは...",
      "title": "DOTが私たちのエコシステムにもたらす技術は、暗号がBTCだけだった頃にETHが現れたのと同じような波動を持っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我经常看到关于Polkadot（DOT）的技术细节的困惑。\n这里有一个真正的快速解释。如果你有问题--请提出来，我将\n试着解释一下。\n\n好吧，那么，想象一下加密货币的历史，因为它与这个领域的技术进步有关。\n这个领域的技术进步。\n\n首先，有BTC。这...",
      "title": "DOT给我们的生态系统带来的技术，与加密货币只是BTC时ETH出现的氛围相同。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我經常看到關於Polkadot（DOT）的技術細節的困惑。\n這裏有一個真正的快速解釋。如果你有問題--請提出來，我將\n試着解釋一下。\n\n好吧，那麼，想象一下加密貨幣的歷史，因爲它與這個領域的技術進步有關。\n這個領域的技術進步。\n\n首先，有BTC。這...",
      "title": "DOT給我們的生態系統帶來的技術，與加密貨幣只是BTC時ETH出現的氛圍相同。"
    }
  ]
}