{
  "author": "qqwe22",
  "original_created_utc": 1650827416,
  "title": "What coin you own dropped in value the most during this bear market?",
  "created_utc": 1650868329,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey guys and gals from subreddit r slash cryptocurrency, the best &lt;del&gt;echo chamber&lt;/del&gt;  crypto related subreddit.&lt;/p&gt;\n\n&lt;p&gt;I have a question for you all, what coin you own dropped in value the most during this bear market?&lt;/p&gt;\n\n&lt;p&gt;I thought that this bear market reached its bottom like a week ago, but now my coins dipped even more. For example OSMOSIS is down almost 50% from its all time high, cosmos is going down too, I won&amp;#39;t even talk about how much value stargaze and desmos network have lost. I hope you guys are doing better than me right now, but I am still curious about your losses during this scary bear market.&lt;/p&gt;\n\n&lt;p&gt;Type your thoughts in the comment section down below &lt;del&gt;don&amp;#39;t forget to subscribe and ring a bell&lt;/del&gt; , I will read any and every comment you post here because I have nothing to do this evening lmao.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 303,
  "permalink": "/r/CryptoCurrency/comments/ub1w54/what_coin_you_own_dropped_in_value_the_most/",
  "subreddit": "CryptoCurrency",
  "id": "ub1w54",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hey guys and gals from subreddit r slash cryptocurrency, the best echo chamber\ncrypto related subreddit.\n\nI have a question for you all, what coin you own dropped in value the most\nduring this bear market?\n\nI thought that this bear market reached its bottom like a week ago, but now my\ncoins dipped…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "subreddit r slash cryptocurrencyからヘイ、みんな、最高のエコーチェンバー\n暗号関連のサブレディットです。\n\nこの弱気相場で最も値下がりしたコインを教えてください。\nこの弱気相場で最も値下がりしたコインは何ですか？\n\n私はこの弱気市場が1週間前に底を打ったと思ったのですが、今私の\nコインが下落した...",
      "title": "今回のベアマーケットで最も値下がりしたコインは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，来自subreddit r slash cryptocurrency的家伙和姑娘们，最好的回声室\n加密货币相关的subreddit。\n\n我有一个问题要问大家，在这个熊市中，你拥有的什么币的价值下降得最多？\n在这个熊市中？\n\n我以为这个熊市在一周前就已经见底了，但现在我的\n币跌了...",
      "title": "在这轮熊市中，你拥有的哪种硬币的价值下降得最多？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，來自subreddit r slash cryptocurrency的傢伙和姑娘們，最好的回聲室\n加密貨幣相關的subreddit。\n\n我有一個問題要問大家，在這個熊市中，你擁有的什麼幣的價值下降得最多？\n在這個熊市中？\n\n我以爲這個熊市在一週前就已經見底了，但現在我的\n幣跌了...",
      "title": "在這輪熊市中，你擁有的哪種硬幣的價值下降得最多？"
    }
  ]
}