{
  "author": "SLUT_STRANGLER",
  "the_new_excerpt": "You can look at their books, but I believe it’s difficult to make an informed\ndecision about $RBLX without some experience with the website and games\nthemselves. Here are some of my thoughts from being an active member since 2007.\nFeel free to ask me any questions you might have about the…",
  "original_created_utc": 1614192515,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你可以看看他们的书，但我相信很难做出一个明智的决定。\n在没有一些网站和游戏经验的情况下，决定$RBLX\n自己。下面是我从2007年开始成为活跃会员的一些想法。\n欢迎向我提出任何问题，你可能有关于...",
      "title": "我个人在过去15年中对Roblox的经验之谈。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你可以看看他們的書，但我相信很難做出一個明智的決定。\n在沒有一些網站和遊戲經驗的情況下，決定$RBLX\n自己。下面是我從2007年開始成爲活躍會員的一些想法。\n歡迎向我提出任何問題，你可能有關於...",
      "title": "我個人在過去15年中對Roblox的經驗之談。"
    }
  ],
  "title": "Thoughts from my personal experience with Roblox over the past 15 years",
  "created_utc": 1614201009,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You can look at their books, but I believe it’s difficult to make an informed decision about $RBLX without some experience with the website and games themselves. Here are some of my thoughts from being an active member since 2007. Feel free to ask me any questions you might have about the platform.</p>\n\n<p>Roblox has been available to the public since 2006; you’re not investing in a new up &amp; coming company. It’s been around for 16 years, which is very long for an online game. That in itself is a good sign, but its potential and success is pretty cemented as of now. The lack of worldwide reach (with the majority of users being from North America) is worrisome, but there may be room for growth.</p>\n\n<p>They recently reached over a billion users. The monthly active user count is somewhere around 150M. Thus, the vast majority of registered users are inactive users or bots who prey on dumb kids to steal their account info via cookies. Their security and captcha, to summarize, sucks. </p>\n\n<p>Roblox itself is a game client, but the website houses a variety of games made by users, of varying quality. There are some real gems but some real garbage as well. The front page cycles the same popular games and not a lot of up-and-coming ones. I can imagine it would be quite difficult to break into the algorithm if you’re not already a popular developer. Some people use/pay for bots to pump up their game’s likes and user count. This is obviously against the site&#39;s TOS, but it’s difficult to get ahead unless you pour hundreds into on-site ads.</p>\n\n<p>Years ago, they shut down the forum, which contributed to a lot of helpful and insightful on-site discussion. They did so because they believed it was becoming difficult to moderate. Hire more moderators? That on top of the fact that the chat filter (both on-site and in-game) is becoming increasingly overbearing, it’s difficult to hold a conversation on the website, let alone form a tight-knit community. I feel a community is <strong>essential</strong> to the success of a social game platform like this one; right now, it feels like a soulless, barren corporate wasteland, compared to what it was before. Take a look at their <a href=\"https://logos-world.net/wp-content/uploads/2020/10/Roblox-Logo-History.jpg\">logo change</a>, which summarizes the company’s new ethos well. There’s the argument that the chat filter needs to be overbearing because of the possibility of online predators - which is true - but there’s a difference between overbearing and broken. Sometimes, every second word is censored, even completely innocent ones.</p>\n\n<p>Their customer support is pretty dismal. Not much else to say here, but I’ve personally dealt with it, and unless you are asking something really basic that can be answered by looking at the FAQ, they’re not much help. Just your typical outsourced copy &amp; paste replies. When it comes to accidental moderation resulting in bans or account deletion, or account theft, they’re not very helpful. I’ve had an account made in 2010 deleted in 2016 for something I did not do (account theft; the account itself was stolen) and they were no help.</p>\n\n<p>Years ago as well, the “free” currency Tickets were removed, leaving the premium one, Robux. Tickets were awarded on daily login and could be used to purchase cosmetics and such. Now, join any game and almost every avatar you see is the default one because the vast majority of kids aren’t paying for the premium membership which gives you monthly Robux, nor are they paying for Robux itself. </p>\n\n<p>Thus, parent’s wallets are the limiting factor on how much Roblox can grow, because a lot of the older base such as myself shares the same sour sentiment regarding the website as a whole. Even newer users are seen calling for the “glory days” of Roblox to come back, which is odd since they themselves did not experience those “glory days”. That being said, the general community sentiment seems that not many people are happy with the site in its current state, which makes me wonder if it’s current young user base is sustainable or if Roblox depends on cycling generations of kids and isn’t really capable of building an older following in its current state.</p>\n\n<p>Moving on, there’s a thriving black market for Robux and limited cosmetic items because of the aforementioned poor on-site economy. The cosmetics catalog used to have sales for holidays like Black Friday and Memorial Day. These are no longer a thing as of the last few years, which seems like a simple enough thing to do to keep Robux flowing in the economy, but they refuse to do so. (??)</p>\n\n<p>Speaking of site-wide events, celebrations like a yearly Egg Hunt, events which were dear to many users, are no more. Instead, they are replaced with corporate promotional events. These don’t yield independent games made by Roblox themselves like the Egg Hunt; instead, independent developers are “contracted” to shimmy these elements into their games. Doesn’t make for a very memorable experience, and I don’t know if the microtransactions yielded are any higher than they were for the previous events. </p>\n\n<p>The search function on the website is pretty broken; for example, if you search the cosmetics catalog for “Adidas hoodie”, that can net you “ADIDAS ADIDAS ADIDAS ADIDAS” named items that may not be a hoodie or relevant to what you’re looking for at all, just something that’s spammed the tag you searched for. This has been the case for years and no attempt to remedy it is evident.</p>\n\n<p>Recently, user-generated content (UGC) has been introduced to the cosmetics catalog, in which approved users can upload hats and other cosmetics rather than just Roblox themselves as before. One of the only good features introduced in the last few years in my opinion, but as a result, Roblox itself has essentially stopped making any cosmetics themselves.</p>\n\n<p>Basically, with the content creation almost exclusively done by independent users and developers, the site now runs itself. As a result, it feels the platform has been stagnating creatively for years. Beyond updating the game client, it’s not really clear what (if anything) Roblox does behind the scenes to promote growth. There’s a lot of very simple improvements and features that could be introduced to satisfy the user base and maintain the appeal to kids and the older audience, but Roblox seems to be reluctant to do so for some reason. For instance, it’s weird that users are begging for on-site sales, which are such a cornerstone of almost any business, or site events, which should be essential as a social game platform. This makes me worry they are forgetting that their user base made them successful in the first place. In short, it doesn’t seem to have the exponential growth it saw from 2007 to the early/mid-2010s, which is worrisome as the platform as a whole is not doing a good job at creating a loyal user base.</p>\n\n<p>All that being said, this is my perspective of a player. I hope a developer can chime in with their thoughts on the pros and cons of developing on Roblox, what their Robux income looks like, and how that translates into real-world currency.</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/stocks/comments/lrk8uv/thoughts_from_my_personal_experience_with_roblox/",
  "subreddit": "stocks",
  "id": "lrk8uv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332887591
}