{
  "author": "bawse1",
  "the_new_excerpt": "Ok but not really but once again, our community held together and endured the\nface of corruption. Corporate juggernauts marginalized us, rampant profiteers\nsought forth to influence us in hopes to acquire us. The community rallied to\nsupport /u/zjz to defend us but circumstances aren't aligned at…",
  "original_created_utc": 1612530084,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，但不是真的... ...但我们的社会再次团结起来，忍受了。\n面对腐败。企业主宰者将我们边缘化，暴利者猖獗。\n试图影响我们，希望获得我们。社会各界团结起来\n支持/u/zjz为我们辩护，但情况并不一致... ...",
      "title": "芒果Juul荚回来了!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，但不是真的... ...但我們的社會再次團結起來，忍受了。\n面對腐敗。企業主宰者將我們邊緣化，暴利者猖獗。\n試圖影響我們，希望獲得我們。社會各界團結起來\n支持/u/zjz爲我們辯護，但情況並不一致... ...",
      "title": "芒果Juul莢回來了!"
    }
  ],
  "title": "Mango Juul Pods are Back!",
  "created_utc": 1612557950,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ok but not really but once again, our community held together and endured the face of corruption.  Corporate juggernauts marginalized us, rampant profiteers sought forth to influence us in hopes to acquire us. The community rallied to support <a href=\"/u/zjz\">/u/zjz</a> to defend us but circumstances aren&#39;t aligned at this time for him to fulfill his duty. He is not a martyr but one of many guardians that oversee now almost 9 million of you. People talk like his bots are what&#39;s important. Truth is that it is how much of his life he dedicates to this thankless task that makes him an asset.  How he spends the time getting to know as many of you on a personal level lets you know this sub isn&#39;t run by robots but people.   </p>\n\n<p>A repeat of history haunted us recently. Some of the mods took risks to make a stand against a repeat. I stood with them because our resolve is unwavering in protecting the integrity of the community. Our moderators are the biggest obstacle for those wanting to take advantage but this story isn&#39;t about us moderators. This is another story about you.  We are here for the community, not the other way around. The ones who didn&#39;t understand are finally gone. Those of us who remain are left to repair the tarnished culture of moderators past. While temptation became a challenge for them, there is no denying their past contributions. We wish them the very best.</p>\n\n<p>&#x200B;</p>\n\n<p>There have been many opportunists popping up everywhere pretending they <a href=\"/r/wallstreetbets\">/r/wallstreetbets</a>. From fake merch to fake discords, fake social media accounts, and subreddits. If it&#39;s not linked here, it does not officially represent the subreddit.  They say that imitation is a form of flattery. Clout chasing is for clowns.     </p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>So how are things different?  We hope to change the way we do things internally, getting rid of secretive groups within the ranks and commit to open communication where there was none previously. The mistrust lingers heavily but I&#39;m confident that our goals are aligned and hope this will the basis in which we will heal any wounds.  Any differences will be worked out, not just set aside so that we may remain one cohesive unit in support of the largest community of traders, investors of all ages, and experience. When we help each other, support one another we can all persevere through anything. That how we win.  Winners give off an aura that fuels phenomenal growth in our community as well as our wallets.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>This is your story to tell. Don&#39;t let them tell it for you.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>On behalf of the mod team.</p>\n\n<p>&#x200B;</p>\n\n<p>Don&#39;t come here to fuck around.  Be here to fuck.</p>\n</div><!-- SC_ON -->",
  "score": 13241,
  "permalink": "/r/wallstreetbets/comments/ld6nre/mango_juul_pods_are_back/",
  "subreddit": "wallstreetbets",
  "id": "ld6nre",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123211360
}