{
  "author": "ShubhamG77",
  "the_new_excerpt": "Netflix shares fell as much as 11% in after-hours trading after reporting a\nlarge miss in subscriber numbers in its first-quarter earnings report. The\ncompany also said it only expects to add about 1 million subscribers in the\ncurrent quarter.\n\n * Earnings per share (EPS): $3.75, vs $2.97 expected\n\n…",
  "original_created_utc": 1618958475,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Netflixの株価は、第1四半期の決算報告で加入者数が大幅に減少したことを受け、時間外取引で11％も下落しました。\nNetflixの株価は時間外取引で11％も下落しました。同社はまた\n同社はまた、今期の加入者数は100万人程度にとどまると予想しています。\n今期の加入者数は約100万人にとどまる見込みです。\n\n * 1株当たり利益（EPS）：予想2.97ドルに対し、3.75ドル\n\n...",
      "title": "Netflixの株価は、加入者数の大幅な減少を受けて11％下落"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Netflix的股价在盘后交易中下跌了11%，因为该公司在第一季度财报中公布的用户数量大幅减少。\n第一季度财报中的用户数量大幅减少。该公司还表示\n该公司还表示，它只预计在第一季度增加约100万用户。\n本季度增加约100万用户。\n\n *每股收益（EPS）：3.75美元，预期2.97美元\n\n...",
      "title": "Netflix股价下跌11%，此前报告的用户数量大幅减少"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Netflix的股價在盤後交易中下跌了11%，因爲該公司在第一季度財報中公佈的用戶數量大幅減少。\n第一季度財報中的用戶數量大幅減少。該公司還表示\n該公司還表示，它只預計在第一季度增加約100萬用戶。\n本季度增加約100萬用戶。\n\n *每股收益（EPS）：3.75美元，預期2.97美元\n\n...",
      "title": "Netflix股價下跌11%，此前報告的用戶數量大幅減少"
    }
  ],
  "title": "Netflix shares fall 11% after reporting a large miss in subscriber numbers",
  "created_utc": 1618964690,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Netflix shares fell as much as 11% in after-hours trading after reporting a large miss in subscriber numbers in its first-quarter earnings report. The company also said it only expects to add about 1 million subscribers in the current quarter.</p>\n\n<ul>\n<li><p>Earnings per share (EPS): $3.75, vs $2.97 expected </p></li>\n<li><p>Revenue: $7.16 billion, vs $7.13 billion expected  (up 24% YOY) </p></li>\n<li><p>Global paid net subscriber additions: 3.98 million vs 6.2 million expected</p></li>\n</ul>\n\n<p>“We believe paid membership growth slowed due to the big Covid-19 pull forward in 2020 and a lighter content slate in the first half of this year, due to Covid-19 production delays,” Netflix said in its letter to shareholders.</p>\n\n<p>When asked about their view on competition with the likes of Disney+, Netflix responded: “We don’t believe competitive intensity materially changed in the quarter or was a material factor in the variance as the over-forecast was across all of our regions,”</p>\n\n<p>“As we’ve noted previously, the production delays from Covid-19 in 2020 will lead to a 2021 slate that is more heavily second half weighted with a large number of returning franchises,” </p>\n\n<p>Netflix also approved a buyback program to repurchase up to $5 billion in common stock, beginning in 2021 with no fixed expiration date. That’s expected to begin the quarter, the company said.</p>\n\n<p>CNBC: <a href=\"https://www.google.com.au/amp/s/www.cnbc.com/amp/2021/04/20/netflix-nflx-q1-2021-earnings.html\">https://www.google.com.au/amp/s/www.cnbc.com/amp/2021/04/20/netflix-nflx-q1-2021-earnings.html</a></p>\n</div><!-- SC_ON -->",
  "score": 2059,
  "permalink": "/r/stocks/comments/mv2e02/netflix_shares_fall_11_after_reporting_a_large/",
  "subreddit": "stocks",
  "id": "mv2e02",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171527441
}