{
  "author": "bronwenmoon",
  "original_created_utc": 1647150972,
  "title": "If the USA is a secular country, why does the president always mention the Christian god during the inauguration?",
  "created_utc": 1647175646,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As a non-US person, and Not A Lawyer, I am confused about this, both from a legal and a social perspective. The USA is officially a secular country by law (establishment clause?). The USA is also very diverse as it is essentially built by immigrants from different cultures and backgrounds. Why is it that Biden and many other presidents mention God, and not in a general way (like Einstein did for instance), but very specifically to the Christian/Abrahamic God during their inauguration speeches? Biden even quoted the Christian Bible (the New Testament I believe). &lt;/p&gt;\n\n&lt;p&gt;Is this not insensitive at least and illegal at most? A large percentage of the audience right there at the inauguration were likely non-Christians, some were likely Muslim or Buddhist or believers of other religions or atheists, agnostics, etc. As an atheist I’d feel weird if I was listening to my president quote Jesus. I’d feel excluded, as if they weren’t including me or anyone else who isn’t Christian. &lt;/p&gt;\n\n&lt;p&gt;I understand the president are themselves an individual with a right to have their religion but to use in public address seems bizarre. Even if the law allows it, it just seems a little rude and pushy from a basic human perspective.&lt;/p&gt;\n\n&lt;p&gt;EDIT: thank you for the responses, to make it clear I am not against a president having a religion, that would make me a hypocrite. I am speaking rather specifically referring to the quoting of the Bible and using language like “the Bible tells us…”. Being neutral in a presidential address is just polite, and doesn’t deny the president’s personal right to practice their faith whatever that may be. &lt;/p&gt;\n\n&lt;p&gt;I’m not even going to talk about the shenanigans Trump was getting up to because I guess Trump isn’t an example of a “normal president”.&lt;/p&gt;\n\n&lt;p&gt;Secondly, I think there is a glaring double standard here. It seems people are ok with presidents making their religion a “point” in their official behaviour as long as it is Christianity. Imagine a Muslim president saying “the Quran tells us”. I don’t see how people would take that well. People would be super upset and suddenly remember that the government is meant to be secular. This contradicts the whole point of the secular government, which is so everyone (not just the majority) feel safe and included and free in their country.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/td0ca3/if_the_usa_is_a_secular_country_why_does_the/",
  "subreddit": "NoStupidQuestions",
  "id": "td0ca3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As a non-US person, and Not A Lawyer, I am confused about this, both from a\nlegal and a social perspective. The USA is officially a secular country by law\n(establishment clause?). The USA is also very diverse as it is essentially built\nby immigrants from different cultures and backgrounds. Why is…"
}