{
  "author": "Southdelhiboi",
  "original_created_utc": 1628430124,
  "title": "In Avatar, Firelord(King) Zuko lived as a wanderer/waiter before becoming Firelord. This was a contrast with his privileged childhood as a prince. Is there any real life e.g. of kings who were born into power spending years as peasants before taking the throne? Particularly Absolute or Feudal kings?",
  "created_utc": 1628447212,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If they did spend time as peasants and commoners how did their experience mark them and their rule?</p>\n\n<p>Im not asking for people who rose through the class structure or illegitimate children, but rather for people who were born into the line of succession.</p>\n\n<p>Similarly people who were banished to another court don&#39;t count</p>\n</div><!-- SC_ON -->",
  "score": 137,
  "permalink": "/r/AskHistorians/comments/p0eutz/in_avatar_firelordking_zuko_lived_as_a/",
  "subreddit": "AskHistorians",
  "id": "p0eutz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If they did spend time as peasants and commoners how did their experience mark\nthem and their rule?\n\nIm not asking for people who rose through the class structure or illegitimate\nchildren, but rather for people who were born into the line of succession.\n\nSimilarly people who were banished to another…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼らが農民や平民として過ごしたとしたら、その経験は彼らや彼らの支配にどのような影響を与えたのだろうか。\nその経験は、彼らや彼らの統治にどのような影響を与えたのでしょうか？\n\n階級制度を利用して出世した人や非嫡出子ではなく、生まれながらにして\n階級制度を利用して出世した人や非嫡出子のことではなく、世襲で生まれた人のことです。\n\n同様に、別の場所に追放された人...",
      "title": "アバター』では、ファイアーロード（王）のズーコは、ファイアーロードになる前、放浪者やウェイターとして生活していました。これは、王子としての恵まれた子供時代とは対照的なものでした。例えば、生まれながらにして権力を持った王が、王位に就く前に何年も農民として過ごしたというような実例はありますか？特に絶対王政や封建的な王様は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果他们确实作为农民和平民度过了一段时间，那么他们的经历是如何给他们和他们的统治留下痕迹的？\n他们和他们的统治？\n\n我不是问那些通过阶级结构上升的人或私生子，而是问那些生来就有继承权的人。\n我问的不是通过阶级结构上升的人或私生子，而是那些出生在继承线上的人。\n\n同样，那些被放逐到另一个地方的人也是如此。",
      "title": "在《阿凡达》中，火神（国王）祖克在成为火神之前，以流浪者/侍者的身份生活。这与他作为王子的特权童年形成了对比。在现实生活中，有没有出生在权力中心的国王在夺取王位前当过几年农民的例子？特别是绝对的或封建的国王？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果他們確實作爲農民和平民度過了一段時間，那麼他們的經歷是如何給他們和他們的統治留下痕跡的？\n他們和他們的統治？\n\n我不是問那些通過階級結構上升的人或私生子，而是問那些生來就有繼承權的人。\n我問的不是通過階級結構上升的人或私生子，而是那些出生在繼承線上的人。\n\n同樣，那些被放逐到另一個地方的人也是如此。",
      "title": "在《阿凡達》中，火神（國王）祖克在成爲火神之前，以流浪者/侍者的身份生活。這與他作爲王子的特權童年形成了對比。在現實生活中，有沒有出生在權力中心的國王在奪取王位前當過幾年農民的例子？特別是絕對的或封建的國王？"
    }
  ]
}