{
  "author": "Accomplished-Design7",
  "original_created_utc": 1624931156,
  "title": "Please don't take a loan to buy crypto",
  "created_utc": 1624963135,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I believe we will continue with the bull run soon enough (I may be wrong). During bull runs a lot of newcomers tend to join in the crypto space because of all the hype and FOMO like there is no tomorrow.</p>\n\n<p>Instances like this will show people at their greediest and often we let this emotion take the better of us. However, pleases <strong><em>DO NOT TAKE OUT LOANS TO BUY CRYPTO!</em></strong> You should only invest with money you afford to lose. If you lose it, it&#39;s okay no biggie. However, if you take a loan of any sort and the cryptos you bought drop then that is not a sight anyone wants to see.</p>\n\n<p>During any bull cycle, there will be an influx of people joining in. They want to make those sweet sweet gains too. If you have any friends or family who will do something like this <strong>please do tell them not to</strong>.</p>\n\n<p>Please educate the newcomers and tell them not to go FOMO when the market is skyrocketing, there will always be dips (I have learnt this the hard way).</p>\n\n<p><em>If you spend what you</em> <strong><em>CAN&#39;T</em></strong> <em>afford to lose, you are just gambling and you may be in for some bad news.</em></p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/o9ydsi/please_dont_take_a_loan_to_buy_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "o9ydsi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I believe we will continue with the bull run soon enough (I may be wrong).\nDuring bull runs a lot of newcomers tend to join in the crypto space because of\nall the hype and FOMO like there is no tomorrow.\n\nInstances like this will show people at their greediest and often we let this\nemotion take the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、すぐにブルランが続くと信じています（間違っているかもしれませんが）。\n強気の時期には、明日がないような誇大広告とFOMOのために、多くの新規参入者が暗号空間に参加する傾向があります。\n誇大広告と明日がないようなFOMOのために、多くの新規参入者が暗号空間に参加する傾向があります。\n\nこのような場合、人々は最も貪欲になり、しばしばこの感情に流されてしまいます。\n感情に流されてしまうことがよくあります...",
      "title": "暗号を買うためにローンを組まないでください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信我们很快就会继续牛市运行（我可能是错的）。\n在牛市运行期间，很多新人倾向于加入加密货币领域，因为所有的炒作和FOMO就像没有明天一样。\n所有的炒作和FOMO就像没有明天一样。\n\n像这样的情况会显示出人们最贪婪的一面，而我们常常让这种\n情绪所左右。",
      "title": "请不要贷款购买加密货币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信我們很快就會繼續牛市運行（我可能是錯的）。\n在牛市運行期間，很多新人傾向於加入加密貨幣領域，因爲所有的炒作和FOMO就像沒有明天一樣。\n所有的炒作和FOMO就像沒有明天一樣。\n\n像這樣的情況會顯示出人們最貪婪的一面，而我們常常讓這種\n情緒所左右。",
      "title": "請不要貸款購買加密貨幣"
    }
  ]
}