{
  "author": "ShrekHands",
  "original_created_utc": 1635876756,
  "title": "Whenever I tell my girlfriend about my crypto investments and how well they’re doing, she totally shits on my dreams",
  "created_utc": 1635888637,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been doing really well with my crypto investments lately and I’m pumped! </p>\n\n<p>But whenever I (excitedly) tell her about it, she’s like “you should sell it” or “have you sold it”. And I’m like well no, I’m a diamond handed ape and I’m hodling until I have enough to retire from the soul sucking monotony of 9-5 corporate life. And then she’s like “well then you haven’t really made anything then have you?” or “What if it all goes back down?”. Then I’m like damn, she’s got a good point there. Then I fall into a spiral of worry and self doubt lol</p>\n\n<p>Does anyone else have this problem with partners/friends/family?</p>\n</div><!-- SC_ON -->",
  "score": 489,
  "permalink": "/r/CryptoCurrency/comments/qlaedo/whenever_i_tell_my_girlfriend_about_my_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qlaedo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve been doing really well with my crypto investments lately and I’m pumped!\n\nBut whenever I (excitedly) tell her about it, she’s like “you should sell it” or\n“have you sold it”. And I’m like well no, I’m a diamond handed ape and I’m\nhodling until I have enough to retire from the soul sucking…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、私の暗号投資はとてもうまくいっていて、気分が高揚しています。\n\nしかし、私が（興奮して）そのことを彼女に話すたびに、彼女は「売ったほうがいいよ」とか\n「とか「売ったの？私はダイヤモンドを手にした猿のようなものです。\n魂を吸い取られるような仕事から引退するために、十分なお金を手に入れるまでホドホドにしています。",
      "title": "彼女に自分の暗号化投資とその成果について話すと、彼女は私の夢を完全に否定するんです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近的加密货币投资做得非常好，我很兴奋！但每当我（兴奋地）告诉她这件事时，她就会说：\"我不知道。\n\n但每当我（兴奋地）告诉她这件事时，她就说 \"你应该卖掉它 \"或\n\"你把它卖了吗\"。我就说，没有，我是一只钻石手猿，我正在\n直到我有足够的钱从吸食灵魂的工作中退休......",
      "title": "每当我告诉我的女朋友我的加密货币投资和他们做得有多好时，她都会对我的梦想嗤之以鼻。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近的加密貨幣投資做得非常好，我很興奮！但每當我（興奮地）告訴她這件事時，她就會說：\"我不知道。\n\n但每當我（興奮地）告訴她這件事時，她就說 \"你應該賣掉它 \"或\n\"你把它賣了嗎\"。我就說，沒有，我是一隻鑽石手猿，我正在\n直到我有足夠的錢從吸食靈魂的工作中退休......",
      "title": "每當我告訴我的女朋友我的加密貨幣投資和他們做得有多好時，她都會對我的夢想嗤之以鼻。"
    }
  ]
}