{
  "author": "Euphoric_Drawer_9430",
  "original_created_utc": 1642449766,
  "title": "What’s wrong with the MAIN causes of WWI?",
  "created_utc": 1642479120,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am a high school history teacher and we’re about to get into the causes of WWI. I normally stick to the script of militarism, alliances, imperialism, and nationalism as the tinder and the assassination of Franz Ferdinand and the “blank check” as the spark that sets it all off. &lt;/p&gt;\n\n&lt;p&gt;However, I’ve seen here and elsewhere some criticism of MAIN. Usually it’s part of a list of flawed or outdated ideas and there isn’t a specific explanation of what the flaws are. Could someone provide an explanation of why this is a flawed way of looking at things?&lt;/p&gt;\n\n&lt;p&gt;Also, would it be better to teach the same stuff then do a little critical thinking exercise looking at the potential flaws, or should I throw it out entirely and use a different framework. Remember this all has to be squeezed into about three 45 minute periods!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/s6dbz8/whats_wrong_with_the_main_causes_of_wwi/",
  "subreddit": "AskHistorians",
  "id": "s6dbz8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am a high school history teacher and we’re about to get into the causes of\nWWI. I normally stick to the script of militarism, alliances, imperialism, and\nnationalism as the tinder and the assassination of Franz Ferdinand and the\n“blank check” as the spark that sets it all off.\n\nHowever, I’ve seen…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は高校で歴史の教師をしていますが、そろそろ「原因」の話に入ります。\n第一次世界大戦 私は普段、軍国主義、同盟関係、帝国主義、そして、第一次世界大戦の歴史という台本に忠実です。\nナショナリズムが火種となり、フランツ・フェルディナンド暗殺と\n\"白紙委任状 \"がすべての火種となる。\n\nしかし、私は...",
      "title": "第一次世界大戦の主な原因の何が問題なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一名高中历史教师，我们即将讨论一战的原因。\n一战的原因。我通常坚持以军国主义、联盟、帝国主义和民族主义作为导火索。\n民族主义是火种，刺杀弗朗茨-斐迪南和 \"空白支票 \"是火种。\n\"空头支票 \"作为引爆一切的火花。\n\n然而，我已经看到...",
      "title": "一战的主要原因有什么问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一名高中歷史教師，我們即將討論一戰的原因。\n一戰的原因。我通常堅持以軍國主義、聯盟、帝國主義和民族主義作爲導火索。\n民族主義是火種，刺殺弗朗茨-斐迪南和 \"空白支票 \"是火種。\n\"空頭支票 \"作爲引爆一切的火花。\n\n然而，我已經看到...",
      "title": "一戰的主要原因有什麼問題？"
    }
  ]
}