{
  "author": "workinguntil65oridie",
  "the_new_excerpt": "I have shared my thoughts on UWMC in past. The company announced Q1 earnings and\nwhile they look like they are below expectations it was explained by the CEO\nthat because of the speed of their execution, their results are reflective of\nthe higher rate environment already while competitors are…",
  "original_created_utc": 1620880539,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "UWMCについては、過去に私の考えをお伝えしました。同社は第1四半期の収益を発表しました。\n予想を下回っているように見えますが、CEOの説明によると\n競合他社は.........と言っているのに、同社は実行の速さのために、彼らの結果はすでに高金利環境を反映していると\n競合他社が...と言っている間に、同社の業績はすでに高金利環境を反映しているとCEOは説明しています。",
      "title": "Mat Ishbiaは、2月の第4四半期決算で、株主に恩返しをしたいと訴えた。5月の第1四半期には、通常の配当と自社株買いを実施した。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我过去曾分享过我对华大基因的看法。该公司公布了第一季度的收益，虽然看起来低于预期，但首席执行官解释说\n虽然他们看起来低于预期，但CEO解释说\n首席执行官解释说，由于他们的执行速度，他们的结果是反映了\n他们的业绩已经反映了较高的利率环境，而竞争对手却在...",
      "title": "马特-伊什比亚在2月的第四季度财报中称，他想回报股东。5月1日，他兑现了常规股息和回购。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我過去曾分享過我對華大基因的看法。該公司公佈了第一季度的收益，雖然看起來低於預期，但首席執行官解釋說\n雖然他們看起來低於預期，但CEO解釋說\n首席執行官解釋說，由於他們的執行速度，他們的結果是反映了\n他們的業績已經反映了較高的利率環境，而競爭對手卻在...",
      "title": "馬特-伊什比亞在2月的第四季度財報中稱，他想回報股東。5月1日，他兌現了常規股息和回購。"
    }
  ],
  "title": "Mat Ishbia called out in Feb Q4 earnings that he wanted to payback shareholders. May Q1 he delivered on the regular div and buyback.",
  "created_utc": 1620934637,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have shared my thoughts on UWMC in past. The company announced Q1 earnings and while they look like they are below expectations it was explained by the CEO that because of the speed of their execution, their results are reflective of the higher rate environment already while competitors are lagged.</p>\n\n<p>During   the Q4 2020 earnings call he  had mused about options that would be on   the stable, special dividend,  buyback or raising the dividend.</p>\n\n<p>Feb Q4 Earnings Quote:</p>\n\n<p>The    Board did approve a dividend, a $0.10 quarterly dividend to be  paid   on  April 6 for all shareholders of record as of March 10. <strong>We expect  this to be a regular quarterly dividend</strong>.</p>\n\n<p>And    so you guys know how we&#39;re thinking about this. Our balance sheet  is  a   fortress. And our current liquidity position is very strong, and   we   have access to the capital markets as well. The way we think about   this   going forward is we&#39;re producing a lot of cash. We&#39;re going to   maybe   be more profitable than some expected and be very successful in   2021.   And <strong>if we have excess cash that I and the Board deem is too much,  we will be delivering that back</strong>. And whether we have to <strong>change    the  dividend in the future, as in raise it or a special dividend,    those  things are definitely on the table or even buying back shares</strong>.</p>\n\n<p>May Q1 Earnings Quote:</p>\n\n<p>As    you saw in our release, the Board approved our quarterly dividend of     $0.10 to consistently deliver money back to our shareholders for a     record date on June 10 and payable July 6. The Board and I always  <strong>explored increasing the dividend actually or looking at a special  dividend or a share buyback program</strong>. As you guys have seen, we <strong>concluded     share buyback was the best use of our capital to reward  shareholders.    We announced the authorization of $300 million share  buyback over the    next 24 months</strong>.  And <strong>quite honestly, with where the share price is, it&#39;s a great opportunity for us to continue to buy that</strong>.</p>\n\n<p>Then in answering a question from an analyst</p>\n\n<p>Doug   Harter -  Great. And then just in terms of capital return, you   mentioned sort of  the float. I  guess just how are you thinking about   kind of <strong>how much of  the float  you&#39;d be willing to take out and pacing around share  repurchase</strong>?</p>\n\n<p>Mat Ishbia -  Yes, Doug. So I&#39;m learning these rules as we go <strong>because at this stock  price, I&#39;m a buyer, right</strong>?   And so we&#39;ll buy shares as soon as tomorrow, I  think, as our legal   teams say we&#39;re allowed to do. And so I don&#39;t know  how many I can buy   and what I can do, but I&#39;m very conscientious of the  float.  If the   float was not a concern, <strong>we&#39;d be more aggressive</strong>. However,  <strong>we    have authorization from the Board to buy up to $300 million, and I&#39;m     going to take advantage of that opportunity while being conscientious     of our partners in the float.</strong></p>\n\n<p>TL/DR:    UWMC and their board have been looking at ways to give back to    shareholders. Instead of a short term cash out, they decided on a    buyback that they are planning to exercise immediately on so that they    can retire shares while the SP is low. They will NOT buy so much that  it   will ruin their float % for Russell. The CEO is aggressive, has    approval to spend $300 and he&#39;s going to take FULL advantage. At current    stock price levels the CEO has stated he is a BUYER! They are not   waiting, it&#39;s being deployed now.</p>\n\n<p>Disclosure I am still in long position with 23K shares of UWMC</p>\n</div><!-- SC_ON -->",
  "score": 40,
  "permalink": "/r/stocks/comments/nb8ht6/mat_ishbia_called_out_in_feb_q4_earnings_that_he/",
  "subreddit": "stocks",
  "id": "nb8ht6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590803279
}