{
  "author": "Cooper-N",
  "the_new_excerpt": "I made a post a while asking the question why do people like Palantir? The\nconsensus was that it’s an innovative company with huge growth potential and its\nproduct is like no other. I’ll leave the post below. I too have bought into\nPalantir because i to believe it has huge growth potential. Problem…",
  "original_created_utc": 1621008850,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は以前、「なぜ人々はPalantirを好きなのか？という投稿をしました。\n大きな成長の可能性を秘めた革新的な企業であり、その製品は他に類を見ないというのが総意でした。\n製品が他に類を見ない革新的な企業であるということでした。以下にその投稿を残しておきます。私もPalantirを買いました。\n私もPalantirを購入しました。問題...",
      "title": "PLTRではまだ高いのかな？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我发了一个帖子，问为什么人们喜欢Palantir？大家的共识是\n大家一致认为，这是一家具有巨大发展潜力的创新公司，其产品是独一无二的。\n产品是独一无二的。我把帖子留在下面。我也买入了\nPalantir，因为我相信它有巨大的增长潜力。问题是...",
      "title": "我们对PLTR的评价还高吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我發了一個帖子，問爲什麼人們喜歡Palantir？大家的共識是\n大家一致認爲，這是一傢俱有巨大發展潛力的創新公司，其產品是獨一無二的。\n產品是獨一無二的。我把帖子留在下面。我也買入了\nPalantir，因爲我相信它有巨大的增長潛力。問題是...",
      "title": "我們對PLTR的評價還高嗎？"
    }
  ],
  "title": "Are we still high on PLTR?",
  "created_utc": 1621029076,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I made a post a while asking the question why do people like Palantir? The consensus was that it’s an innovative company with huge growth potential and its product is like no other. I’ll leave the post below. I too have bought into Palantir because i to believe it has huge growth potential. Problem is the market does not agree with me. The stock is almost done 47% since February of this year and down 15% this month. Today it had a rebound but for people has the consensus changed for you. Cathie wood has had a field day loading up in shares. Their March quarter revenue was up 341 million but analysts are still questioning its growth potential. I will forever be a a holder because I still believe. But what are your guys thoughts.? Any doubts? Any concerns? Is it just a short term growth stock?</p>\n\n<p><a href=\"https://www.reddit.com/r/StockMarket/comments/kpozn9/why_are_people_so_high_on_palantir/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\">https://www.reddit.com/r/StockMarket/comments/kpozn9/why_are_people_so_high_on_palantir/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf</a></p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/stocks/comments/nccd8v/are_we_still_high_on_pltr/",
  "subreddit": "stocks",
  "id": "nccd8v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590803295
}