{
  "author": "uraniumguy",
  "the_new_excerpt": "Hi /r/investing,\n\nLong-time Uranium investor here and was hoping I could get a few more interested\nabout the sector. Please let me know your thoughts and if you have any\nquestions. I really think this is a market that is going to explode over the\nnext few years.\n\n#1 - What happened in the last…",
  "original_created_utc": 1610722574,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嗨/r/investing。\n\n长期在这里投资铀矿，希望能多找几个感兴趣的人。\n关于该部门。请告诉我你的想法，如果你有任何\n问题。我真的认为这是一个市场，将在未来爆发。\n未来几年\n\n#1--在过去的几年里发生了什么...",
      "title": "铀的宏观商业案例"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨/r/investing。\n\n長期在這裏投資鈾礦，希望能多找幾個感興趣的人。\n關於該部門。請告訴我你的想法，如果你有任何\n問題。我真的認爲這是一個市場，將在未來爆發。\n未來幾年\n\n#1--在過去的幾年裏發生了什麼...",
      "title": "鈾的宏觀商業案例"
    }
  ],
  "title": "The Macro Business Case for Uranium",
  "created_utc": 1610799917,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi <a href=\"/r/investing\">/r/investing</a>,</p>\n\n<p>Long-time Uranium investor here and was hoping I could get a few more interested about the sector. Please let me know your thoughts and if you have any questions. I really think this is a market that is going to explode over the next few years. </p>\n\n<p><strong>#1 - What happened in the last Uranium bull market?</strong></p>\n\n<p>The  last uranium bull market took place between 2004-2007. The price of  uranium is measured by a metric called the &quot;spot price&quot; and between that  time period it grew from a price of $20/lb to $135/lb. The  extraordinary climb was triggered by a flood at the mine one of the  world&#39;s largest producers (Cameco). In this bull market valuations  exploded. You have names such as Paladin which went up 200x. This bull  was followed by &quot;mini-bear&quot; and &quot;mini-bull&quot; market where the supply  situation started to stabilize and investment in new mines went through  the roof until 2011. In this time period, uranium stocks went crazy.  Investors were making 20x their money with their worst picks and hedge  funds started manipulating the market with crazy money coming in and out  to play the market. Unfortunately, the party was short-lived and in  March 2011, a tsunami &amp; earthquake struck Japan and triggered the  Fukushima nuclear disaster which obliterated the market overnight.</p>\n\n<p><strong>#2 - What happened after Fukushima?</strong></p>\n\n<p>After  the Fukushima disaster many countries around the world immediately  started the process of switching off their nuclear reactors and  diverting away from Nuclear energy. An industry that had experienced a  significant amount of investment had a lot of the demand dry up  overnight. Obviously in turn, equities plummeted, many companies went  bankrupt, and the sector was forever changed. After Fukushima, all the  miners were left with big supply gluts. They had predicted nuclear to  keep growing and instead they were struggling to find anyone to take  this excess material. As such, there has been virtually 0 investment in  new uranium mines since Fukushima and since 2011 the miners and the  utilities have been working through the existing inventory.</p>\n\n<p><strong>#3 - So what has changed to signal a bull market is coming?</strong></p>\n\n<p>This  is essentially a supply/demand story. I&#39;m sure some of you have seen  the market action with oil where countries manipulate the supply/demand  and it has a huge effect on the price. In uranium, the producers have  spent years working through excess inventory and since the spot price  has stayed low, there has been no investment. 2018 was the first year on  record where the Uranium industry produced LESS than the annual demand  and this has continued for the last three years. At the same time,  demand is growing and Nuclear reactors are going up across the world.  China and other countries have several plants under construction and  Japan is restarting a lot of the plants it shutdown after Fukushima.  Additionally, the carbon reduction benefits of Nuclear are getting more  and more support from both political parties. Both the democrats and  republicans worked together (its possible!) to pass a couple bills  recently that have been very positive for the Uranium industry. These  included restricting how much cheap Uranium comes into the US and  establishing a national reserve of Uranium in the US for security  purposes. Overall, the macro sentiment is overwhelmingly positive and  barring another nuclear disaster, this commodity is only headed up.</p>\n\n<p><strong>#4 - Black Swan/COVID</strong></p>\n\n<p>If  the above isn&#39;t enough to get you excited, COVID has made this story  even more convincing and has acted as a &quot;black swan&quot; for this industry.  Because of COVID, the #1 and #2 producer in the world (Kazatomprom and  Cameco respectively) both shut down production in order to keep their  employees safe. So not only do you have an industry with a huge  structural supply deficit, but the #1 and #2 producers essentially  turned off the tap and decided they are not producing anymore. What  could make this even more compelling? Well, these two producers still  have contracts they have to fill and they need Uranium so instead of  producing it they are actually buying it from other companies on the  spot market to fulfill their needs. Can you imagine another industry  where the #1 and #2 producers decide to stop producing and instead start  buying from other companies? This further constricts supply and there  is currently no end in sight to some of the mine shutdowns (Cameco  specifically) that happened initially back in March due to COVID. So you have an industry with a big supply deficit, 0 investment in new mines,  the top 2 producers are currently shut down, the top 2 producers have  actually become buyers essentially arbitraging their own market and  nuclear energy is growing. I&#39;ll let you make your own conclusions as to where this ends up.</p>\n\n<p><strong>#5 - How do I make money?</strong></p>\n\n<p>This  industry is an extremely small industry. There are 2 (maybe 3)  companies that are considered largecap and the rest are very small  companies typically &lt;$100M. Most of the companies would probably be  defined as penny stocks.  The good thing is that most of the companies  that are around today have managed to be prudent enough to survive the  bear market so only the best have really survived. Because this is such a  small industry, when money starts to actually come into this industry  it will move violently and quickly. To start off I would recommend any  of the big ETFs to get your feet wet such as URA or URNM. I can share my thoughts on specific companies if you are interested but most of them are quite small relative to other equities and require a fair bit of DD.</p>\n\n<p><strong>#6 - What could go wrong?</strong></p>\n\n<p>At  this point, the only catalyst that looks certain to kneecap the the industry overnight is a nuclear disaster and that is always a risk. From  a safety perspective, all countries have spent a significant amount of  money since Fukushima on upgrading their reactors to ensure they are as  safe as possible so this risk is somewhat mitigated but it is always a  possibility and one that you should be aware of.</p>\n\n<p>Thank you for reading and happy to answer any questions you might have.</p>\n</div><!-- SC_ON -->",
  "score": 51,
  "permalink": "/r/investing/comments/kxw3kd/the_macro_business_case_for_uranium/",
  "subreddit": "investing",
  "id": "kxw3kd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311216186
}