{
  "author": "gatoplanta",
  "the_new_excerpt": "Let's imagine a future where a company can create a perfect simulated reality\npowered by a strong AI; a person comes and asks to be the leader of a\ntotalitarian regime perpetrating a genocide, or a child abuser, or something of\nthe like.\n\nWould it be ethical to let them do this things inside the…",
  "original_created_utc": 1618976219,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ある企業が強力なAIを使って完璧なシミュレートされた現実を作り出すことができる未来を想像してみましょう。\nのリーダーになりたいと言ってくる人がいます。\n大虐殺を行う全体主義政権の指導者になりたい」「児童虐待をしている人になりたい」などと言ってくる人がいるとします。\nと言ってきたとします。\n\nこのようなことを内部で行わせることは倫理的に問題があるのでしょうか？",
      "title": "仮に、人々が合法的にお金を払って、現実世界と見分けがつかない、コンピュータに接続されてもシミュレーションであることに気づかない、カスタムメイドのシミュレーションされた現実の中で暮らすことができるとしたら、そのようなシミュレーションの中で恐ろしい犯罪を犯させることは倫理的に許されるでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我们想象一下，在未来，一家公司可以创造一个完美的模拟现实，由强大的人工智能驱动。\n由一个强大的人工智能驱动；一个人来到这里，要求成为一个极权主义国家的领导人。\n一个人来到这里，要求成为一个实施种族灭绝的极权主义政权的领导人，或者一个虐待儿童的人，或者类似的事情。\n诸如此类。\n\n让他们在这个世界上做这些事情是否符合道德？",
      "title": "在一个假设的场景中，人们可以合法地付费生活在一个定制的模拟现实中，与现实世界没有区别，而且一旦他们与电脑连接，就不知道这是一个模拟；让他们在这种模拟中犯下可怕的罪行是否符合道德？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我們想象一下，在未來，一家公司可以創造一個完美的模擬現實，由強大的人工智能驅動。\n由一個強大的人工智能驅動；一個人來到這裏，要求成爲一個極權主義國家的領導人。\n一個人來到這裏，要求成爲一個實施種族滅絕的極權主義政權的領導人，或者一個虐待兒童的人，或者類似的事情。\n諸如此類。\n\n讓他們在這個世界上做這些事情是否符合道德？",
      "title": "在一個假設的場景中，人們可以合法地付費生活在一個定製的模擬現實中，與現實世界沒有區別，而且一旦他們與電腦連接，就不知道這是一個模擬；讓他們在這種模擬中犯下可怕的罪行是否符合道德？"
    }
  ],
  "title": "In a hypothetical scenario where people could legally pay to live in a custom-made simulated reality, indistinguishable from the real world, and unaware of it being a simulation once they are connected to the computer; would it be ethical to let them commit horrible crimes within such simulation?",
  "created_utc": 1619020533,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let&#39;s imagine a future where a company can create a perfect simulated reality powered by a strong AI; a person comes and asks to be the leader of a totalitarian regime perpetrating a genocide, or a child abuser, or something of the like. </p>\n\n<p>Would it be ethical to let them do this things inside the computer, given that for them it&#39;s indistinguishable from real life? Most can argue that as it means no harm for others, and the rest of humanity won&#39;t even know what&#39;s going on within that personal, private simulation, it should be allowed due to individual liberty. But two main questions come to my mind:</p>\n\n<p>a) The people inside the simulation are in some way <em>real</em> because they are being simulated? Have an existence of their own? Can they just be abused without hesitation?</p>\n\n<p>b) If we accept that the &#39;NPC&#39; inside the simulation are just reflections of the connected person&#39;s mind, could we infer that they are harming themselves in some way by commiting such crimes, although just virtually? Should such <em>self-harm</em> be allowed?</p>\n\n<p>Looking forward to know your thoughts.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/mv7fri/in_a_hypothetical_scenario_where_people_could/",
  "subreddit": "askphilosophy",
  "id": "mv7fri",
  "is_self": true,
  "media": null,
  "is_video": false
}