{
  "author": "CakeDayOrDeath",
  "original_created_utc": 1651748646,
  "title": "I got a new deodorant recently that says that it has no aluminum or parabens. Is there research showing that aluminum and parabens are harmful in the quantities that they usually come in in deodorant?",
  "created_utc": 1651776360,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I.e. when you consider the concentration that they&amp;#39;re in in deodorant and when you consider that people use a tiny amount of deodorant once or twice a day, are those amounts of aluminum and parabens harmful to humans?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 115,
  "permalink": "/r/askscience/comments/uiuz92/i_got_a_new_deodorant_recently_that_says_that_it/",
  "subreddit": "askscience",
  "id": "uiuz92",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I.e. when you consider the concentration that they're in in deodorant and when\nyou consider that people use a tiny amount of deodorant once or twice a day, are\nthose amounts of aluminum and parabens harmful to humans?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "デオドラント剤に含まれる濃度を考慮すると、また、人々が1～2回、ごく少量のデオドラント剤を使うことを考慮すると\n1日に1〜2回、ごく少量のデオドラントを使用することを考えると、アルミニウムやパラベンは人体に有害なのでしょうか？\nアルミニウムとパラベンの量は人体に有害なのでしょうか？",
      "title": "最近、アルミニウムやパラベン不使用と書かれたデオドラント剤を手に入れました。アルミニウムやパラベンは、通常デオドラントに含まれる量では有害であるという研究結果はあるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "也就是说，当你考虑到它们在除臭剂中的浓度时，当你考虑到人们在除臭剂中使用一到两次的极少量的除臭剂时。\n当你考虑到人们每天使用一到两次少量的除臭剂时，这些数量的铝和对羟基苯甲酸酯是否对人体有害？\n这些数量的铝和对羟基苯甲酸酯对人体有害吗？",
      "title": "我最近买了一种新的除臭剂，说是不含铝和苯甲酸酯。是否有研究表明，铝和对羟基苯甲酸酯在除臭剂中通常出现的数量是有害的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "也就是說，當你考慮到它們在除臭劑中的濃度時，當你考慮到人們在除臭劑中使用一到兩次的極少量的除臭劑時。\n當你考慮到人們每天使用一到兩次少量的除臭劑時，這些數量的鋁和對羥基苯甲酸酯是否對人體有害？\n這些數量的鋁和對羥基苯甲酸酯對人體有害嗎？",
      "title": "我最近買了一種新的除臭劑，說是不含鋁和苯甲酸酯。是否有研究表明，鋁和對羥基苯甲酸酯在除臭劑中通常出現的數量是有害的？"
    }
  ]
}