{
  "author": "BenCaunce",
  "original_created_utc": 1632783869,
  "title": "Is the American attitude to drinking in modern days a hangover from the Prohibition era.",
  "created_utc": 1632798564,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As a British person, I have only known life through a British perspective, and an attitude to drinking came with that. I remember I was first allowed one bottle of beer on special occasions when I was 14, and by 16 I could pretty much share really whatever my Dad was having in an evening, with how much I could have depending of course on how strong it was and how much he wanted to drink it. But as an adult now, I have spend a considerable time in different parts of America, and the attitude to drinking is completely different. Of course, there’s the legal aspect of Americans needing to be 21 to publicly drink and buy alcohol and us 18, but also how fully grown adults treat it. I was stunned when I heard someone call another an alcoholic after 3 glasses of wine with dinner, when in England you’d still be driving home after that. And it’s made me wonder is this a direct result of Prohibition and alcohol being treated as something evil that has just stuck around through the generations?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/pwsx8o/is_the_american_attitude_to_drinking_in_modern/",
  "subreddit": "AskHistorians",
  "id": "pwsx8o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As a British person, I have only known life through a British perspective, and\nan attitude to drinking came with that. I remember I was first allowed one\nbottle of beer on special occasions when I was 14, and by 16 I could pretty much\nshare really whatever my Dad was having in an evening, with how…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イギリス人である私は、イギリス人の視点でしか人生を知らず、それに伴ってお酒に対する\nそれに伴い、お酒に対する考え方も変わってきました。私が子供の頃、特別な日に1本のビールが許されたのを覚えています。\n14歳のとき、特別な日にビールを1本飲ませてもらったのを覚えています。\n16歳になると、父が飲んでいるものは何でも一緒に飲んでいました。",
      "title": "現代のアメリカ人のお酒に対する考え方は、禁酒法時代の名残なのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个英国人，我只通过英国人的视角来了解生活，并且\n喝酒的态度也是如此。我记得我第一次被允许在特殊场合喝一瓶\n我记得我14岁时第一次被允许在特殊场合喝一瓶啤酒，而到了16岁，我几乎可以\n16岁时，我几乎可以分享我父亲在一个晚上所喝的任何东西，而我的父亲是如何...",
      "title": "美国人在现代的饮酒态度是否是禁酒令时代的遗留问题。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個英國人，我只通過英國人的視角來了解生活，並且\n喝酒的態度也是如此。我記得我第一次被允許在特殊場合喝一瓶\n我記得我14歲時第一次被允許在特殊場合喝一瓶啤酒，而到了16歲，我幾乎可以\n16歲時，我幾乎可以分享我父親在一個晚上所喝的任何東西，而我的父親是如何...",
      "title": "美國人在現代的飲酒態度是否是禁酒令時代的遺留問題。"
    }
  ]
}