{
  "author": "naji102",
  "original_created_utc": 1631339610,
  "title": "Market might be in red for now but Crypto has made me 6 Months of salary in 1 Month.",
  "created_utc": 1631370763,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I belong to a country where crypto is banned and probably half of the country have no idea about what crypto is. When I first started traded in Feb 2021 my dad told me not to, he told he heard this is a scam and people lose money everyday (Just like recent flashcrash)   </p>\n\n<p>I did my graduation in Software Engineering and knew about blockchain, so I still went ahead I somehow traded my CSGO skins with my friends and they bought me crypto on Binance, then later I found out I can buy from P2P trading little expensive but it is what is.  </p>\n\n<p>I was down 50% in May/June I still didn&#39;t lose hope it&#39;s not like I was born rich, so I kept DCA&#39;ing with the little bit money I got from my job.<br/>\nMy country doesn&#39;t pay well too 1 USD is like 167 in my country and Minimum wadge is $90/Month. I knew if anything is gonna get me out of this shithole is crypto.  </p>\n\n<p>Recent pump of August has made 6 months of my salary and I&#39;m still in profit. I wake up everyday with a smile on my face I know I&#39;m heading towards the financial freedom. One day when I have enough to support my family I will tell my dad I&#39;m buying all this from <strong>CRYPTO.</strong></p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/pm1r2w/market_might_be_in_red_for_now_but_crypto_has/",
  "subreddit": "CryptoCurrency",
  "id": "pm1r2w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I belong to a country where crypto is banned and probably half of the country\nhave no idea about what crypto is. When I first started traded in Feb 2021 my\ndad told me not to, he told he heard this is a scam and people lose money\neveryday (Just like recent flashcrash)\n\nI did my graduation in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は暗号が禁止されている国に住んでいるのですが、おそらく国の半分は\nは、暗号が何であるかを知らないでしょう。2021年2月に初めてトレードを始めたとき、私の父は\n詐欺だと聞いていたし、毎日のように人々がお金を失っていると聞いていたからだ。\n最近のフラッシュクラッシュのように）。\n\n私が卒業したのは...",
      "title": "市場は今のところ赤字かもしれませんが、暗号は1ヶ月で6ヶ月分の給料を稼いでくれました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我属于一个加密货币被禁止的国家，而这个国家可能有一半的人\n都不知道什么是加密货币。当我在2021年2月第一次开始交易时，我的父亲告诉我不要这样做。\n我父亲告诉我不要这样做，他说他听说这是一个骗局，人们失去了钱。\n(就像最近的Flashcrash)\n\n我毕业于...",
      "title": "市场目前可能处于红色状态，但加密货币在1个月内为我赚取了6个月的工资。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我屬於一個加密貨幣被禁止的國家，而這個國家可能有一半的人\n都不知道什麼是加密貨幣。當我在2021年2月第一次開始交易時，我的父親告訴我不要這樣做。\n我父親告訴我不要這樣做，他說他聽說這是一個騙局，人們失去了錢。\n(就像最近的Flashcrash)\n\n我畢業於...",
      "title": "市場目前可能處於紅色狀態，但加密貨幣在1個月內爲我賺取了6個月的工資。"
    }
  ]
}