{
  "author": "APRF2016",
  "the_new_excerpt": "Hi guys, I'm really new to Bitcoin. I'm from Honduras and I put up all my\nsavings to buy Bitcoin recently in Feb, 2nd. I really don't know why I did it\nbut I thought it was a good investment because here in my country keeping your\nmoney in the bank is useless (like 1% annual interest rate) and is…",
  "original_created_utc": 1613807769,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我真的是比特币的新手。我来自洪都拉斯，我把我所有的\n最近在2月2日的时候，用储蓄来购买比特币。我真的不知道我为什么要这么做\n但我认为这是一个很好的投资，因为在我的国家，保持你的。\n钱放在银行里是没有用的（比如1%的年利率），是...",
      "title": "比特币在第三世界国家"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我真的是比特幣的新手。我來自洪都拉斯，我把我所有的\n最近在2月2日的時候，用儲蓄來購買比特幣。我真的不知道我爲什麼要這麼做\n但我認爲這是一個很好的投資，因爲在我的國家，保持你的。\n錢放在銀行裏是沒有用的（比如1%的年利率），是...",
      "title": "比特幣在第三世界國家"
    }
  ],
  "title": "Bitcoin in a 3rd world country",
  "created_utc": 1613831424,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi guys, I&#39;m really new to Bitcoin. I&#39;m from Honduras and I put up all my savings to buy Bitcoin recently in Feb, 2nd. I really don&#39;t know why I did it but I thought it was a good investment because here in my country keeping your money in the bank is useless (like 1% annual interest rate) and is not convenient to keep large amounts of cash due to the high crime rates. So I put up all my savings, even convinced my mom and family to buy and they did it!!. And to my surprise in less than 1 month it went from 37K to 56K USD. This is mind boggling and a life changing experience for me and my family. Maybe I&#39;m dreaming but if it goes up even more I&#39;ll be able to buy a house or start some business here.</p>\n\n<p>I really see now that BTC is the future, sadly not every one I talk about BTC understands or trusts it. </p>\n\n<p>Thank you for this awesome community.</p>\n</div><!-- SC_ON -->",
  "score": 761,
  "permalink": "/r/Bitcoin/comments/lo2czt/bitcoin_in_a_3rd_world_country/",
  "subreddit": "Bitcoin",
  "id": "lo2czt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332871862
}