{
  "author": "CyberPunkMetalHead",
  "original_created_utc": 1626423088,
  "title": "My crypto trading algorithm that detects surges across all coins on Binance is getting its own app and it's made by redditors",
  "created_utc": 1626438975,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A couple months ago, I wrote a crypto trading algorithm that detects the the most volatile coins on Binance in real time across all of their 1500+ crypto assets. The idea is to detect the beginning of a surge trend in order to ride the trend as it develops.</p>\n\n<p>I has trailing stop loss and a couple of other pretty neat features to help maximise the profit and it&#39;s highly configurable. It&#39;s been tested by around 2000 people already with various degrees of profitability - based on the user&#39;s config.</p>\n\n<p>I am now working on creating a web app for it so that&#39;s more user friendly than running scrips. Many of you were really interested in the app so I&#39;m happy that some of you have joined in the development of this project!</p>\n\n<p>If you&#39;re interested to be updated on the project&#39;s development and to be part of our beta testing release, you can join the subreddit that I just created for it. Bear in mind it&#39;s all bearbones right now, but I will post more regular updates on this particular project on there :)</p>\n\n<p>We chose the name after the Norse God of Knowledge - the badass Mimir.</p>\n\n<p><a href=\"https://www.reddit.com/r/MimirTrading\">https://np.reddit.com/r/MimirTrading</a></p>\n\n<p>Or if you want to register your interest for beta testing, just go here:</p>\n\n<p><a href=\"https://mimirbot.com/\">https://mimirbot.com/</a></p>\n\n<p>Lastly, if you&#39;re good with code and would like to try out the alpha version check out the github repo:</p>\n\n<p><a href=\"https://github.com/CyberPunkMetalHead/Binance-volatility-trading-bot\">https://github.com/CyberPunkMetalHead/Binance-volatility-trading-bot</a></p>\n</div><!-- SC_ON -->",
  "score": 202,
  "permalink": "/r/CryptoCurrency/comments/olch4x/my_crypto_trading_algorithm_that_detects_surges/",
  "subreddit": "CryptoCurrency",
  "id": "olch4x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A couple months ago, I wrote a crypto trading algorithm that detects the the\nmost volatile coins on Binance in real time across all of their 1500+ crypto\nassets. The idea is to detect the beginning of a surge trend in order to ride\nthe trend as it develops.\n\nI has trailing stop loss and a couple of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数ヶ月前、私はBinanceの1500以上の暗号化されたコインの中から最も変動の激しいコインをリアルタイムで検出する暗号化取引アルゴリズムを書きました。\nBinanceの1500以上の暗号資産の中から最も変動の激しいコインをリアルタイムで検出する暗号取引アルゴリズムを書きました。\n資産を検出します。アイデアは、トレンドが発生したときに、そのトレンドに乗るために、急騰トレンドの始まりを検出することです。\nトレンドが発生したときにそのトレンドに乗ることです。\n\n私は、トレーリングストップロスといくつかの...",
      "title": "Binanceのすべてのコインの急騰を検出する私の暗号取引アルゴリズムに独自のアプリが登場し、それはredditorsによって作られています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几个月前，我写了一个加密货币交易算法，在Binance的1500多个加密货币中实时检测出\n实时检测Binance上所有1500多种加密货币中最不稳定的币种。\n资产。这个想法是为了检测一个激增趋势的开端，以便在趋势发展时驾驭它。\n随着趋势的发展。\n\n我有跟踪止损和一些其他的方法。",
      "title": "我的加密货币交易算法在Binance上检测所有币种的涨幅，现在有了自己的应用程序，而且是由redditors制作的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾個月前，我寫了一個加密貨幣交易算法，在Binance的1500多個加密貨幣中實時檢測出\n實時檢測Binance上所有1500多種加密貨幣中最不穩定的幣種。\n資產。這個想法是爲了檢測一個激增趨勢的開端，以便在趨勢發展時駕馭它。\n隨着趨勢的發展。\n\n我有跟蹤止損和一些其他的方法。",
      "title": "我的加密貨幣交易算法在Binance上檢測所有幣種的漲幅，現在有了自己的應用程序，而且是由redditors製作的。"
    }
  ]
}