{
  "author": "w_savage",
  "original_created_utc": 1632510643,
  "title": "We need to fight back for our privacy and freedoms.",
  "created_utc": 1632541175,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As I&#39;m sure most of you have heard by now the new bill hitting the senate floor will allow the government to monitor any bank account with $600 or more. This just isn&#39;t right! Even the normies of the world (crypto illiterates) are gonna be pissed about this! I can see people withdrawing all their money from banks looking for another solution rather than be spied on by big brother. Let alone all of us in the crypto space, we hate KYC as it is. This bill, if it passes will make it much harder for us to have the privacy we are entitled to. Mining crypto (thinking of BTC when it first started) was to be able to avoid the eyes of the system and not rely on it for transactions. Well mining has a huge upfront cost, and if we ever want to sell/buy something we need to exchange it to fiat. The only solutions I see to this privacy situation is either a crypto bank, getting paid in crypto, or mass adoption of crypto by vendors. Seems like a great start up/industry changing business if someone can figure this out. </p>\n\n<p>That leads me to ask this group, are there any other solutions for anonymity out there that don&#39;t result in becoming a criminal? I really want to stick it to &quot;the man&quot;. Thanks for reading my rant if you made it this far.</p>\n\n<p>EDIT: thanks for the awards! Glad this resonates with a few of you.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/puqgss/we_need_to_fight_back_for_our_privacy_and_freedoms/",
  "subreddit": "CryptoCurrency",
  "id": "puqgss",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As I'm sure most of you have heard by now the new bill hitting the senate floor\nwill allow the government to monitor any bank account with $600 or more. This\njust isn't right! Even the normies of the world (crypto illiterates) are gonna\nbe pissed about this! I can see people withdrawing all their…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もうほとんどの方がご存知だと思いますが、上院に提出された新しい法案は、600ドル以上の銀行口座を政府が監視するというものです。\n政府は600ドル以上の銀行口座を監視することができます。これは\nこれは間違っています。世界中のノーミー（暗号の知識がない人）でさえ、これには怒りを覚えるでしょう。\n世界中のノーミー（暗号の知識がない人）もこれには怒るでしょうね。人々がすべてのお金を引き出す姿が目に浮かびます。",
      "title": "私たちは、プライバシーと自由のために反撃しなければなりません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信你们中的大多数人现在都已经听说了，新的法案已经进入了参议院。\n将允许政府监控任何有600美元或以上的银行账户。这\n这是不对的! 即使是世界上的正常人（加密货币的文盲）也会\n也会对此感到愤怒! 我可以看到人们撤回他们所有的...",
      "title": "我们需要为我们的隐私和自由进行反击。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信你們中的大多數人現在都已經聽說了，新的法案已經進入了參議院。\n將允許政府監控任何有600美元或以上的銀行賬戶。這\n這是不對的! 即使是世界上的正常人（加密貨幣的文盲）也會\n也會對此感到憤怒! 我可以看到人們撤回他們所有的...",
      "title": "我們需要爲我們的隱私和自由進行反擊。"
    }
  ]
}