{
  "author": "Goat_im_Himmel",
  "original_created_utc": 1638758881,
  "title": "How did the erroneous association of Mary Magdalene with prostitution develop and come to have such a hold in the popular understanding of her place within the Bible?",
  "created_utc": 1638780617,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Mary Magdalene is one of the most prominent women in the New Testament, and while she is decidedly &lt;em&gt;not&lt;/em&gt; a sex worker in the actual text, she nevertheless is often described as such, a misreading of some passages which in fact refer to another, unnamed woman. How did this mistake come to be and why did it gain &lt;em&gt;such&lt;/em&gt; cultural traction that it continues to have such enduring power within popular lay understanding?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/r9wldr/how_did_the_erroneous_association_of_mary/",
  "subreddit": "AskHistorians",
  "id": "r9wldr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Mary Magdalene is one of the most prominent women in the New Testament, and\nwhile she is decidedly not a sex worker in the actual text, she nevertheless is\noften described as such, a misreading of some passages which in fact refer to\nanother, unnamed woman. How did this mistake come to be and why…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "マグダラのマリアは、新約聖書の中で最も著名な女性の一人であり、また\n実際のテキストでは風俗嬢ではないのですが、それにもかかわらず、彼女は\nこれは、いくつかの聖句の誤読であり、実際にはそのような聖句を指している。\n別の無名の女性です。この間違いはなぜ起きたのか、そしてなぜ...。",
      "title": "マグダラのマリアが売春をしていたという誤ったイメージは、どのようにして生まれ、聖書の中での彼女の位置づけに関する一般的な理解において、このような支配力を持つようになったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "抹大拉的马利亚是《新约》中最突出的女性之一。\n虽然她在实际文本中显然不是一个性工作者，但她经常被描述成这样。\n抹大拉的马利亚是《新约圣经》中最突出的女性之一，虽然她在实际文本中显然不是性工作者，但她经常被描述为性工作者，这是对一些段落的误读，这些段落实际上指的是另一个未命名的女人。\n这是对一些段落的误读，这些段落实际上指的是另一个未命名的女人。这个错误是如何产生的，以及为什么...",
      "title": "抹大拉的马利亚与卖淫的错误联系是如何形成的，并在人们对她在圣经中的地位的理解中占有如此大的比重？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "抹大拉的馬利亞是《新約》中最突出的女性之一。\n雖然她在實際文本中顯然不是一個性工作者，但她經常被描述成這樣。\n抹大拉的馬利亞是《新約聖經》中最突出的女性之一，雖然她在實際文本中顯然不是性工作者，但她經常被描述爲性工作者，這是對一些段落的誤讀，這些段落實際上指的是另一個未命名的女人。\n這是對一些段落的誤讀，這些段落實際上指的是另一個未命名的女人。這個錯誤是如何產生的，以及爲什麼...",
      "title": "抹大拉的馬利亞與賣淫的錯誤聯繫是如何形成的，並在人們對她在聖經中的地位的理解中佔有如此大的比重？"
    }
  ]
}