{
  "author": "idkwat2dowithmyhands",
  "original_created_utc": 1627782401,
  "title": "CPA - Tax Professional 12+ years here [USA]. Happy to answer any questions regarding tax on Crypto Gains & Losses, current reporting guidelines, laws and current increasing IRS efforts.",
  "created_utc": 1627857036,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The IRS added a new checkbox this year on Form 1040 p. 1 ‘Did you trade virtual currency?’. They’ve subpoenaed Coinbase and are forming entire divisions devoted to finding those not paying tax on crypto gains. That being said, there are still ways to properly report while also mitigating your liabilities. \nLuckily COVID has set them back quite a bit with regards to work in general - that being said, pandemic cost the US a lot and they’ll be coming after any easy targets for tax (usually billionaires-crypto traders will be at the top of the list in next couple years imho)</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/ovjf7o/cpa_tax_professional_12_years_here_usa_happy_to/",
  "subreddit": "CryptoCurrency",
  "id": "ovjf7o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The IRS added a new checkbox this year on Form 1040 p. 1 ‘Did you trade virtual\ncurrency?’. They’ve subpoenaed Coinbase and are forming entire divisions devoted\nto finding those not paying tax on crypto gains. That being said, there are\nstill ways to properly report while also mitigating your…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "IRSは今年、フォーム1040のp.1に新しいチェックボックスを追加しました「仮想通貨を取引しましたか？\n通貨を取引しましたか」と 彼らはCoinbaseを召喚し、暗号化された利益に税金を払っていない人を見つけるために専門の部署を設立しています。\n彼らはCoinbaseを召喚し、暗号化された利益に税金を払っていない人を見つけるための部署を設立しています。そうは言っても、以下のような方法があります。\nそうは言っても、適切に報告する方法はありますし、自分の税金を軽減することもできます...",
      "title": "CPA - 税務専門家 12年以上の実績があります（米国）。暗号の利益と損失に対する税金、現在の報告ガイドライン、法律、現在増加しているIRSの取り組みなど、あらゆる質問に喜んでお答えします。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "国税局今年在1040表第1页增加了一个新的复选框 \"你是否交易虚拟货币？\n币？\"。他们已经传唤了Coinbase，并且正在组建整个部门专门负责\n来寻找那些没有缴纳加密货币收益税的人。虽然如此，但仍有\n仍然有办法正确报告，同时也减轻你的负担。",
      "title": "注册会计师 - 税务专业人员，在此工作12年以上[美国]。乐于回答任何关于加密货币收益和损失的税收问题，目前的报告准则，法律和目前国税局不断增加的努力。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "國稅局今年在1040表第1頁增加了一個新的複選框 \"你是否交易虛擬貨幣？\n幣？\"。他們已經傳喚了Coinbase，並且正在組建整個部門專門負責\n來尋找那些沒有繳納加密貨幣收益稅的人。雖然如此，但仍有\n仍然有辦法正確報告，同時也減輕你的負擔。",
      "title": "註冊會計師 - 稅務專業人員，在此工作12年以上[美國]。樂於回答任何關於加密貨幣收益和損失的稅收問題，目前的報告準則，法律和目前國稅局不斷增加的努力。"
    }
  ]
}