{
  "author": "4rotorguy",
  "the_new_excerpt": "Mom died last July from suicide and insurance paid out 80k. I suffer from\nanxiety and have been keeping it in my savings. I knew I should invest it, but\nthe fear of losing my mom's gift to me was debilitating. Now I'm on wellbutrin\nand it's helped me alot.\n\nYesterday I woke up and opened a brokerage…",
  "original_created_utc": 1616697656,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "妈妈去年7月自杀身亡，保险赔了8万。我患有\n焦虑，一直把它放在我的储蓄里。我知道我应该投资它，但\n害怕失去我妈妈给我的礼物，这让我很沮丧。现在我在服用安非他命\n这对我帮助很大。\n\n昨天我醒来后开了一家经纪公司... ...",
      "title": "妈妈给我留了一些钱"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "媽媽去年7月自殺身亡，保險賠了8萬。我患有\n焦慮，一直把它放在我的儲蓄裏。我知道我應該投資它，但\n害怕失去我媽媽給我的禮物，這讓我很沮喪。現在我在服用安非他命\n這對我幫助很大。\n\n昨天我醒來後開了一家經紀公司... ...",
      "title": "媽媽給我留了一些錢"
    }
  ],
  "title": "Mom left me some money",
  "created_utc": 1616707516,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Mom died last July from suicide and insurance paid out 80k. I suffer from anxiety and have been keeping it in my savings. I knew I should invest it, but the fear of losing my mom&#39;s gift to me was debilitating. Now I&#39;m on wellbutrin and it&#39;s helped me alot. </p>\n\n<p>Yesterday I woke up and opened a brokerage account and shoved 500$ into AMD, INTEL, FORD, and some of that game store stock. (Hehehe)</p>\n\n<p>After breakfast I took 60k and parked it in a high interest savings account for now. .55%</p>\n\n<p>During lunch I took 10k and put in into a 10 year fidelity GO 60/40 account. (I have mixed feelings about bonds but it&#39;s better than letting it sit in savings.)</p>\n\n<p>Not sure what to do now. I&#39;d like to keep at least 20k available in case I decided to buy a house. But beyond that I&#39;m just not sure. Still worried there is a bubble In the economy and scared shitless I&#39;m going to lose this gift.</p>\n\n<p>Edit- about game stocks, I only have half a week&#39;s net wages in it. Nothing crazy.</p>\n\n<p>I really appreciate All the advice. I&#39;m going to be busy looking up dividends, indexes, fiduciaries and reference your comments in the future.</p>\n\n<p>As for that guy at the bottom, who said I&#39;m bragging... Id give everything I have and MORE to have my mom back and in good heath.</p>\n</div><!-- SC_ON -->",
  "score": 700,
  "permalink": "/r/stocks/comments/md57ak/mom_left_me_some_money/",
  "subreddit": "stocks",
  "id": "md57ak",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357141510
}