{
  "author": "CorvusAnguis",
  "original_created_utc": 1659793883,
  "title": "Do the notable socialist ‘regimes’ of the 20th century—the USSR, China, Cuba etc—owe their authoritativeness much to a survivorship bias or something inhered in their doctrine?",
  "created_utc": 1659841789,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;What is meant by ‘survivorship bias’ is that the socialist experiments that were likely to survive were ones that resisted imperial and capitalist suppression—a manifold of CIA/western interferences like Mosaddegh in Iran or Sankara in Burkina Faso—meaning that they would likely hinder dissent and act controlling as a means to an end (The end being a democratic one); thusly, their perceived penchant for being authoritarian is consequent of them passing the test, or is a western perspective that they were or are authoritarian due to something inhered in the doctrine of the liberation of the proletariat?&lt;/p&gt;\n\n&lt;p&gt;Of course, as this is a nuanced topic, transcendence of the either-or construction is encouraged.&lt;/p&gt;\n\n&lt;p&gt;Also, I mean socialist as in their purported goals, not their actual state of affairs, which could be referred to as state capitalist.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/whot84/do_the_notable_socialist_regimes_of_the_20th/",
  "subreddit": "AskHistorians",
  "id": "whot84",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "What is meant by ‘survivorship bias’ is that the socialist experiments that were\nlikely to survive were ones that resisted imperial and capitalist suppression—a\nmanifold of CIA/western interferences like Mosaddegh in Iran or Sankara in\nBurkina Faso—meaning that they would likely hinder dissent and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サバイバーシップ・バイアス」の意味は、社会主義者の実験が\n帝国と資本主義の弾圧に抵抗したものが生き残る可能性が高いということである。\nイランのモサデグやインドのサンカラのように、CIAや欧米のさまざまな干渉に抵抗したものである。\nブルキナファソのモサデグやサンカラのような、CIAや西欧の干渉の数々である。",
      "title": "20世紀の社会主義「政権」、ソ連、中国、キューバなどの権威は、生存者バイアスや教義に由来するものなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所谓 \"幸存者偏差 \"的意思是，在社会主义实验中被\n有可能存活下来的是那些抵制帝国和资本主义压制的实验--美国中央情报局/西方国家的一系列做法。\n在中央情报局/西方国家的干预下，像伊朗的摩萨台或布基纳法索的桑卡拉这样的社会主义实验有可能存活下来。\n布基纳法索的桑卡拉--这意味着它们可能会阻碍异议和。",
      "title": "20世纪著名的社会主义 \"政权\"--苏联、中国、古巴等--是否将其权威性更多地归功于幸存者的偏见或其学说中固有的东西？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所謂 \"倖存者偏差 \"的意思是，在社會主義實驗中被\n有可能存活下來的是那些抵制帝國和資本主義壓制的實驗--美國中央情報局/西方國家的一系列做法。\n在中央情報局/西方國家的干預下，像伊朗的摩薩臺或布基納法索的桑卡拉這樣的社會主義實驗有可能存活下來。\n布基納法索的桑卡拉--這意味着它們可能會阻礙異議和。",
      "title": "20世紀著名的社會主義 \"政權\"--蘇聯、中國、古巴等--是否將其權威性更多地歸功於倖存者的偏見或其學說中固有的東西？"
    }
  ]
}