{
  "author": "javasyntax",
  "original_created_utc": 1630617406,
  "title": "Please stop treating staking and getting interest as the same thing",
  "created_utc": 1630640081,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve seen many people share how high their “staking rewards” on their stablecoins are compared to interest from banks. This is actually not correct, stablecoins (and PoW coins) cannot be staked. What&#39;s being done is actually exactly the same as what banks do. Your coins are invested/loaned at an even higher APY and you get a part of the reward, the only difference being that you get a larger reward. This is not staking, your coins are not helping the network.</p>\n\n<p>Staking is done with PoS coins such as ADA and DOT. Here your coins are used as proof to verify transactions. And as a result of staking them, you get rewards every once in a while. The rewards you get are new coins that didn&#39;t exist before, unlike when you get interest (the service sends you their coins). By staking your coins, you help the coin remain decentralized.</p>\n\n<p>Why does it matter? Because these are fundamentally different things and mixing them up can become quite confusing to new people and experienced people alike. The end result might be same (getting more coins), but the benefit you&#39;ve done is far different.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/pgqz03/please_stop_treating_staking_and_getting_interest/",
  "subreddit": "CryptoCurrency",
  "id": "pgqz03",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've seen many people share how high their “staking rewards” on their\nstablecoins are compared to interest from banks. This is actually not correct,\nstablecoins (and PoW coins) cannot be staked. What's being done is actually\nexactly the same as what banks do. Your coins are invested/loaned at an…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人が、銀行の利息に比べて安定したコインの「ステーク報酬」がどれだけ高いかを共有しているのを見てきました。\n銀行の利息に比べて、安定したコインの「ステーク報酬」が高いことを紹介している人が多いですね。これは実は正しくありません。\n安定コイン（およびPoWコイン）はステークすることができません。行われていることは、実は\n行われていることは、銀行が行っていることと全く同じです。あなたのコインは、銀行からの利息で投資/融資されます。",
      "title": "ステイキングとインタレストを同じものとして扱うのはやめてほしい"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到很多人分享他们在稳定币上的 \"赌注奖励 \"有多高。\n与银行的利息相比，稳定币的 \"赌注奖励 \"很高。这实际上是不正确的。\n稳定币（和PoW币）不能被抵押。现在所做的事情实际上是\n与银行的做法完全一样。你的币被投资/借出的时候，是在银行里。",
      "title": "请不要再把押注和获得利息当作同一件事。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到很多人分享他們在穩定幣上的 \"賭注獎勵 \"有多高。\n與銀行的利息相比，穩定幣的 \"賭注獎勵 \"很高。這實際上是不正確的。\n穩定幣（和PoW幣）不能被抵押。現在所做的事情實際上是\n與銀行的做法完全一樣。你的幣被投資/借出的時候，是在銀行裏。",
      "title": "請不要再把押注和獲得利息當作同一件事。"
    }
  ]
}