{
  "author": "Greg_Jenner",
  "original_created_utc": 1646911498,
  "title": "AMA: DEAD FAMOUS - The Origins of Celebrity Culture, with Greg Jenner",
  "created_utc": 1646919447,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi! I&amp;#39;m Greg Jenner, I&amp;#39;m a British public historian and what makes me a little different is that I use humour and pop culture as a tool in my work. Mostly, I&amp;#39;m interested in social and cultural history, but I do a bit of everything in my various jobs. As a broadcaster I host the BBC comedy podcast &lt;em&gt;You&amp;#39;re Dead To Me,&lt;/em&gt; the BBC children&amp;#39;s podcast &lt;em&gt;Homeschool History&lt;/em&gt;, and the BBC Radio 4 series &lt;em&gt;Past Forward: A Century of Sound.&lt;/em&gt;  In TV &amp;amp; film, I am the Historical Consultant (and one of the writers) on all 9 series of the Emmy &amp;amp; BAFTA-winning BBC kids&amp;#39; comedy show &lt;em&gt;Horrible Histories&lt;/em&gt;, as well as the spin-off &lt;em&gt;HH movie&lt;/em&gt;. I&amp;#39;ve also recently advised on a new children&amp;#39;s animated comedy for YouTube. In terms of publishing, I&amp;#39;m  the author of four books (the latter is a new children&amp;#39;s book, out in November). &lt;/p&gt;\n\n&lt;p&gt;My latest book for adults is called &lt;em&gt;Ask A Historian&lt;/em&gt; (my publisher&amp;#39;s idea! I apologise unreservedly to the subreddit for the name similarity...), but my second book was just released in the USA last week in paperback, and is called &lt;em&gt;Dead Famous: An Unexpected History of Celebrity, From Bronze Age To Silver Screen&lt;/em&gt;. It explores the origins of celebrity culture between 1700-1950, and - while it&amp;#39;s hopefully entertaining to read - it was the hardest thing I ever did! It took me 4 years of full-time work to write it, and I ended up with 1.4 million words of notes. In case you&amp;#39;re interested, I&amp;#39;ve posted the full bibliography on my website - it&amp;#39;s a bit messy, sorry, but I&amp;#39;ve tried to pick out certain recommended reads in different thematic areas &lt;a href=\"https://www.gregjenner.com/dead-famous-full-references-bibliography/\"&gt;https://www.gregjenner.com/dead-famous-full-references-bibliography/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;So, if you want to ask me about the history of fame and celebrity, I&amp;#39;d be delighted to try and field your question as best I can. A quick caveat, though: this is a surprisingly massive subject, and I&amp;#39;m 100% sure you will be able to fire questions at me that I cannot answer. I wrote about 125 different celebrities in the book, but there are literally thousands of case studies I could have chosen from. Also, I&amp;#39;ve written half a million words on other subjects since doing this book, so I might need a bit of time to go through my old notes and remind myself of the primary and secondary sources when answering your questions! So, please be patient with me, but I&amp;#39;ll be online from 12pm until 6pm GMT, and then will check back in after 10pm GMT if you have anything else to ask. &lt;/p&gt;\n\n&lt;p&gt;So, without much further ado, thanks very much for welcoming me to your community -- please AMA!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/tawlmc/ama_dead_famous_the_origins_of_celebrity_culture/",
  "subreddit": "AskHistorians",
  "id": "tawlmc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi! I'm Greg Jenner, I'm a British public historian and what makes me a little\ndifferent is that I use humour and pop culture as a tool in my work. Mostly, I'm\ninterested in social and cultural history, but I do a bit of everything in my\nvarious jobs. As a broadcaster I host the BBC comedy podcast…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは！私はグレッグ・ジェンナー、英国の公文書史家です。\n私はユーモアやポップカルチャーをツールとして使っているのが特徴です。主に、私は\n社会史や文化史に興味がありますが、あらゆることを少しずつやっています。\n様々な仕事があります。放送局としては、BBCのコメディポッドキャストの司会をしています。",
      "title": "AMA: DEAD FAMOUS - セレブリティ文化の起源、グレッグ・ジェンナー氏との対話"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨！我是格雷格-詹纳，我是一名英国公共历史学家。\n不同的是，我在工作中使用幽默和流行文化作为一种工具。大多数情况下，我\n我对社会和文化历史感兴趣，但在我的各种工作中，我什么都做。\n各种各样的工作。作为一名广播员，我主持了BBC的喜剧播客...",
      "title": "AMA:《死神》--名人文化的起源，与格雷格-詹纳合作"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨！我是格雷格-詹納，我是一名英國公共歷史學家。\n不同的是，我在工作中使用幽默和流行文化作爲一種工具。大多數情況下，我\n我對社會和文化歷史感興趣，但在我的各種工作中，我什麼都做。\n各種各樣的工作。作爲一名廣播員，我主持了BBC的喜劇播客...",
      "title": "AMA:《死神》--名人文化的起源，與格雷格-詹納合作"
    }
  ]
}