{
  "author": "Tendieman_Awaiter",
  "the_new_excerpt": "I have positions in a few blue chip companies like MSFT, AMZN, DIS, etc., and\nwhile I’m sure they’ll be good investments for quite a long time, do you think\nthey’ll really still be good investments in 30-50 years? Even the best companies\nwill eventually die- surely it would be better to try and sell…",
  "original_created_utc": 1620547304,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はMSFT、AMZN、DISなどのいくつかのブルーチップ企業のポジションを持っています。\n私はMSFT、AMZN、DISなどのいくつかの優良企業のポジションを持っていますが、これらはかなり長い間、良い投資対象であると確信しています。\n30～50年後も良い投資先であると思いますか？どんなに優れた企業でも\n売ったほうがいいんじゃないの？",
      "title": "私たちは、ある銘柄を永遠に持ち続けるつもりだと言うことがありますが、今の優良銘柄が数十年後にも持ち続けることができると思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有一些蓝筹股公司的头寸，如MSFT、AMZN、DIS等。\n虽然我确信它们在相当长的时间内会是很好的投资，但你认为它们在30-50年后真的还是好的投资吗？\n它们在30-50年内真的还是好的投资吗？即使是最好的公司\n最终也会消亡--当然最好是尝试出售......",
      "title": "我们有时会说，我们打算永远持有某些股票，但你认为今天的蓝筹股在几十年后仍然适合持有吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一些藍籌股公司的頭寸，如MSFT、AMZN、DIS等。\n雖然我確信它們在相當長的時間內會是很好的投資，但你認爲它們在30-50年後真的還是好的投資嗎？\n它們在30-50年內真的還是好的投資嗎？即使是最好的公司\n最終也會消亡--當然最好是嘗試出售......",
      "title": "我們有時會說，我們打算永遠持有某些股票，但你認爲今天的藍籌股在幾十年後仍然適合持有嗎？"
    }
  ],
  "title": "We sometimes say that we plan to hold certain stocks forever, but do you think today’s blue chips will still be good to hold decades from now?",
  "created_utc": 1620577124,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have positions in a few blue chip companies like MSFT, AMZN, DIS, etc., and while I’m sure they’ll be good investments for quite a long time, do you think they’ll really still be good investments in 30-50 years? Even the best companies will eventually die- surely it would be better to try and sell even stocks like AMZN and AAPL at some point rather than trying to hold them all the way until retirement and betting that they won’t decline before then. The problem, obviously, is trying to time the top, and if obvious signs of decline start to kick in, the market will certainly react.</p>\n\n<p>I’m just trying to think about how I should play these blue chips over the course of multiple decades. I plan to hold things like VTI essentially forever, but MSFT and AMZN and etc.? Although I think they’re great stocks right now, what do I do in 20 years when they drop because new companies came along and started outdoing them? It’s not really worth stressing about, obviously, but I like to think about these things.</p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/investing/comments/n89kz5/we_sometimes_say_that_we_plan_to_hold_certain/",
  "subreddit": "investing",
  "id": "n89kz5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994597
}