{
  "author": "Nickanator8",
  "original_created_utc": 1629734486,
  "title": "Now is the time to practice shutting the fuck up.",
  "created_utc": 1629743477,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As the market surges and sentiment begins to turn bullish I would like to remind everyone in this sub to shut the fuck up. </p>\n\n<p>Now let me clarify, we should absolutely keep being active in this sub. Keep posting stories, asking questions, and helping each other. However, outside of Reddit please remember to not talk about your gains to anyone. Not your parents, not your partner, not your friends. Nobody.</p>\n\n<p>Why? Because it has zero potential for good and catastrophic potential for bad. If you&#39;re talking about your Crypto investments to people who are not also already interested you&#39;re going to sound like a crazy person gambling away your life savings. People will hear you talking about all the money you are making and either ask for advise, become jealous/envious, or dislike you because they think you are bragging. If they ask for advise they will probably get shaken out during a -3% day and resent you for it. If they become jealous or envious of you they will be waiting in the wings to hound you on down days, even if you are still in the green. If they think you are bragging they will probably stop talking to you. </p>\n\n<p>Shut the fuck up.</p>\n\n<p>Seriously practice silence. Get used to keeping your gains to yourself. Honestly I would even advise against talking about gains here as well because the internet is rife with scammers looking for a mark. The best way to avoid problems is to just stop talking. </p>\n\n<p>Shut the fuck up.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/pa2t6b/now_is_the_time_to_practice_shutting_the_fuck_up/",
  "subreddit": "CryptoCurrency",
  "id": "pa2t6b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As the market surges and sentiment begins to turn bullish I would like to remind\neveryone in this sub to shut the fuck up.\n\nNow let me clarify, we should absolutely keep being active in this sub. Keep\nposting stories, asking questions, and helping each other. However, outside of\nReddit please…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "市場が急上昇し、センチメントが強気になり始めたとき、このサブの皆さんには、黙っていてください。\nこのサブにいる皆さんは黙っていてください。\n\nここではっきりさせておきたいのは、このサブでは絶対に活動を続けるべきだということです。続ける\nストーリーを投稿したり、質問したり、お互いに助け合ったりしてください。しかし、このサブの外では\nRedditでは...",
      "title": "今こそ、黙る練習をしてみてはいかがでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "随着市场飙升，情绪开始转为看涨，我想提醒\n我想提醒本子里的每个人都他妈的闭嘴。\n\n现在让我澄清一下，我们绝对应该继续活跃在这个子里。继续\n发布故事，提出问题，并相互帮助。然而，除了在\nReddit请...",
      "title": "现在是练习他妈的闭嘴的时候了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着市場飆升，情緒開始轉爲看漲，我想提醒\n我想提醒本子裏的每個人都他媽的閉嘴。\n\n現在讓我澄清一下，我們絕對應該繼續活躍在這個子裏。繼續\n發佈故事，提出問題，並相互幫助。然而，除了在\nReddit請...",
      "title": "現在是練習他媽的閉嘴的時候了。"
    }
  ]
}