{
  "author": "Megalorye",
  "original_created_utc": 1656848667,
  "title": "It literally says in the Coinbase and Celsius Network's terms of service that the cryptocurrency you hold on their exchanges are not yours:",
  "created_utc": 1656866764,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I mean I always knew &amp;quot;not your keys, not your coins&amp;quot; was a fact, but after learning that anything you have on these exchanges is not yours, and in the unfortunate event that they go bankrupt your coins are gone forever is actually in their terms of service is fucking down right scary!&lt;/p&gt;\n\n&lt;p&gt;All of this crap has got me interested in a cold storage system, and I&amp;#39;ve been veering more towards a paper wallet system, but I am interested in learning more about hardware wallets as well, the only thing I freak out about is the battery dying in it, what happens then? Also, could I have multiple hardware wallets with the same keys on them as backups?&lt;/p&gt;\n\n&lt;p&gt;Please advise, because I&amp;#39;d rather take the chance of me fucking something up managing my own coins, then letting these cock suckers walk away untouched if they go tits up.&lt;/p&gt;\n\n&lt;p&gt;Also, if you are interested in watching the Wall Street Journal video I just watched that highlights the terms of service of Coinbase and Celsius, I will link it below in text form with a space in the https: part:&lt;/p&gt;\n\n&lt;p&gt;https: //youtu.be/OJMR-0AGiDA&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 332,
  "permalink": "/r/CryptoCurrency/comments/vqfsct/it_literally_says_in_the_coinbase_and_celsius/",
  "subreddit": "CryptoCurrency",
  "id": "vqfsct",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I mean I always knew \"not your keys, not your coins\" was a fact, but after\nlearning that anything you have on these exchanges is not yours, and in the\nunfortunate event that they go bankrupt your coins are gone forever is actually\nin their terms of service is fucking down right scary!\n\nAll of this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "鍵はダメ、硬貨はダメ」というのは知っていたけれど、今回\nしかし、これらの取引所にあるものはすべて自分のものではないことを知り、また、不幸にも取引所が\nコインは永遠になくなります。\n利用規約に書いてあるなんて、本当に恐ろしいです。\n\nこのすべてが...",
      "title": "CoinbaseやCelsius Networkの利用規約には、文字通り、彼らの取引所で保有している暗号通貨は自分のものではない、と書かれているのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的意思是，我一直知道 \"不是你的钥匙，不是你的硬币 \"是一个事实，但在了解到你在这些前台的任何东西都是你的。\n但在了解到你在这些交易所拥有的任何东西都不是你的之后，而且在\n不幸的是，如果他们破产了，你的硬币就永远消失了。\n在他们的服务条款中，这他妈的太可怕了!\n\n所有这些...",
      "title": "在Coinbase和Celsius Network的服务条款中，字面上说，你在他们交易所持有的加密货币不是你的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的意思是，我一直知道 \"不是你的鑰匙，不是你的硬幣 \"是一個事實，但在瞭解到你在這些前臺的任何東西都是你的。\n但在瞭解到你在這些交易所擁有的任何東西都不是你的之後，而且在\n不幸的是，如果他們破產了，你的硬幣就永遠消失了。\n在他們的服務條款中，這他媽的太可怕了!\n\n所有這些...",
      "title": "在Coinbase和Celsius Network的服務條款中，字面上說，你在他們交易所持有的加密貨幣不是你的。"
    }
  ]
}