{
  "author": "Megalorye",
  "original_created_utc": 1656848667,
  "title": "It literally says in the Coinbase and Celsius Network's terms of service that the cryptocurrency you hold on their exchanges are not yours:",
  "created_utc": 1656866764,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I mean I always knew &amp;quot;not your keys, not your coins&amp;quot; was a fact, but after learning that anything you have on these exchanges is not yours, and in the unfortunate event that they go bankrupt your coins are gone forever is actually in their terms of service is fucking down right scary!&lt;/p&gt;\n\n&lt;p&gt;All of this crap has got me interested in a cold storage system, and I&amp;#39;ve been veering more towards a paper wallet system, but I am interested in learning more about hardware wallets as well, the only thing I freak out about is the battery dying in it, what happens then? Also, could I have multiple hardware wallets with the same keys on them as backups?&lt;/p&gt;\n\n&lt;p&gt;Please advise, because I&amp;#39;d rather take the chance of me fucking something up managing my own coins, then letting these cock suckers walk away untouched if they go tits up.&lt;/p&gt;\n\n&lt;p&gt;Also, if you are interested in watching the Wall Street Journal video I just watched that highlights the terms of service of Coinbase and Celsius, I will link it below in text form with a space in the https: part:&lt;/p&gt;\n\n&lt;p&gt;https: //youtu.be/OJMR-0AGiDA&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 332,
  "permalink": "/r/CryptoCurrency/comments/vqfsct/it_literally_says_in_the_coinbase_and_celsius/",
  "subreddit": "CryptoCurrency",
  "id": "vqfsct",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I mean I always knew \"not your keys, not your coins\" was a fact, but after\nlearning that anything you have on these exchanges is not yours, and in the\nunfortunate event that they go bankrupt your coins are gone forever is actually\nin their terms of service is fucking down right scary!\n\nAll of this…"
}