{
  "author": "JuicySpark",
  "original_created_utc": 1629346231,
  "title": "A list of all the annoying shit I put up with since I invested in Crypto late 2016.",
  "created_utc": 1629362631,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><ul>\n<li><p>A few months ago, my brother-in-law stormed into my house, laid down $2000 in warm $100 bills freshly out if the ATM, and said , <em>Buy me doge!</em>. </p></li>\n<li><p>Whenever I would try to bring up moons to someone in RL, they would usually reply with, <em>You mean Safemoon?</em> </p></li>\n<li><p>Whenever there was a bullrun, my FB messenger would blow up...<em>Tell me how to get into cryptocurrency</em>!  From people I barely even spoken to. </p></li>\n<li><p>Whenever I heard <em>Crypto is ruining this planet</em> on Facebook news Feed, It was from someone who became an expert in mining after reading a 5 minute CNN + Wiki Combo </p></li>\n<li><p>Whenever I tried to give someone sound advice that was very upset about a loss like &quot;try not to invest more than you can afford&quot; I would hear &quot;You just got lucky buying early, stop trying to act like an expert&quot;. </p></li>\n<li><p>I stored a computer at my mom&#39;s house because I needed to put it somewhere safe as my wife, and I spent 2 months in a hotel before we bought our first home.  She told me &quot;don&#39;t worry, it&#39;s safe here&quot; after discussing how important it was.  It had keys to a shitcoin that took me from $200 to $10,000(unibright)\nWhen I went to go pick it up a 3 months later, I found that she through it away.  <em>I didn&#39;t think you needed it anymore</em>.   Turns out my step-father decided to refinish the basement, and he wanted to get rid of boxes of old junk. \nOne of those boxes was my desktop that was supposed to be *it&#39;s safe here&quot;.. </p></li>\n<li><p>I&#39;m 2016, I told my boss I&#39;d help him buy Bitcoin because he kept asking me how to do it.  When it came down to it, he backed out.\nIn 2017 when it peaked to $20,000, he asked me to help him buy it.  1 year later he told me, &quot;I should&#39;ve never listened to you&quot;, so he sold.\nThis year he told me he bought some Doge at $0.59&quot;. </p></li>\n<li><p>A friend called me a few months ago asking if he can buy some of my moons.  I sold him 1000 for double the price.  At his request because he said it was worth it not going through the test net.  1 weeks ago, he wanted to sell them back to me at $0.3.  when I said no, he got desperate and started knocking down the price to $0.2.  I agreed.  Today he asked if he can buy them back because he regretted selling them. </p></li>\n<li><p>Last year I dished our $10,000 for a mining equipment(Bitcoin).  My friend said he will manage it at his house.  I agreed he should get 35% profit for managing the miners for me.  This was a discussion 2 months in the making . 1 month later he showed up at my house with All the equipment.  Told me his wife didn&#39;t want him doing that in the house. \nNow I&#39;m stuck with mining equipment I can&#39;t use because they&#39;re no room in my house. </p></li>\n<li><p>My wife threw out a piece of paper in 2018 she though was garbage.   It was in my  computer desk.  She told me she was organizing and thought it was just some scribble.    It was my recovery phrase for  XLM wallet that was holding 22,000xlm.   This was literally 1 day after she told me she received a hospital bill for $3000. </p></li>\n<li><p>I had my wife&#39;s 15yr old niece over for dinner one night. 2017  It was a little family get together. Like 12 people.  She chimed into a convo about crypto with <em>all the boys in school are talking about..  it&#39;s stupid. It&#39;s for drug addicts</em> </p></li>\n</ul>\n\n<p>Now I&#39;m here trying to go against the downvote force so I can get some decent Karma of one for a change.</p>\n</div><!-- SC_ON -->",
  "score": 312,
  "permalink": "/r/CryptoCurrency/comments/p77l66/a_list_of_all_the_annoying_shit_i_put_up_with/",
  "subreddit": "CryptoCurrency",
  "id": "p77l66",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": " * A few months ago, my brother-in-law stormed into my house, laid down $2000 in\n   warm $100 bills freshly out if the ATM, and said , Buy me doge!.\n\n * Whenever I would try to bring up moons to someone in RL, they would usually\n   reply with, You mean Safemoon?\n\n * Whenever there was a bullrun, my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": " * 数ヶ月前、義理の兄が私の家に押しかけ、ATMから出てきたばかりの温かい100ドル札を2000ドル置いて、「ドゲを買ってくれ」と言いました。\n   ATMから出てきたばかりの温かい100ドル札を2000ドル並べて、「ドギーを買ってくれ！」と言いました。\n\n * RLで誰かに月の話をしようとすると、たいてい彼らは「Safemoonのことか」と答えます。\n   Safemoonのことか？\n\n * ブルランがあったときには、私の...",
      "title": "2016年末にCryptoに投資して以来、私が我慢しているすべての迷惑なクソのリストです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": " *几个月前，我的姐夫冲进我家，放下刚从自动取款机里取出来的2000美元温暖的百元大钞。\n   热乎乎的百元大钞，从自动取款机里拿出来，说：给我买个狗吧。\n\n * 每当我试图在现实生活中向别人提起月亮时，他们通常会回答说，你是说Safemoon？\n   他们通常会回答说，你是说Safemoon？\n\n * 每当有牛市的时候，我的...",
      "title": "自2016年底投资加密货币以来，我所忍受的所有恼人的狗屎清单。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " *幾個月前，我的姐夫衝進我家，放下剛從自動取款機裏取出來的2000美元溫暖的百元大鈔。\n   熱乎乎的百元大鈔，從自動取款機裏拿出來，說：給我買個狗吧。\n\n * 每當我試圖在現實生活中向別人提起月亮時，他們通常會回答說，你是說Safemoon？\n   他們通常會回答說，你是說Safemoon？\n\n * 每當有牛市的時候，我的...",
      "title": "自2016年底投資加密貨幣以來，我所忍受的所有惱人的狗屎清單。"
    }
  ]
}