{
  "author": "Redditor45643335",
  "the_new_excerpt": "Not sure if the title explains exactly what I mean but I'm always intrigued\nabout the psychology behind people who prefer to buy dead beat companies because\nthe price is low rather than the companies of tomorrow because the price is\nhigh.\n\nIt's a pretty simple decision when you think about it right?…",
  "original_created_utc": 1612787138,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "不知道标题是否能准确地解释我的意思，但我总是很好奇。\n关于人们喜欢购买死气沉沉的公司背后的心理，是因为\n价格低，而不是明天的公司，因为价格是。\n高。\n\n你想想看，这是个很简单的决定，对吧？...",
      "title": "因为价格低而买入死拍公司与因为价格高而买入明日公司的心理。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不知道標題是否能準確地解釋我的意思，但我總是很好奇。\n關於人們喜歡購買死氣沉沉的公司背後的心理，是因爲\n價格低，而不是明天的公司，因爲價格是。\n高。\n\n你想想看，這是個很簡單的決定，對吧？...",
      "title": "因爲價格低而買入死拍公司與因爲價格高而買入明日公司的心理。"
    }
  ],
  "title": "The psychology behind buying dead beat companies because the price is low vs the companies of tomorrow because the price is high.",
  "created_utc": 1612795408,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Not sure if the title explains exactly what I mean but I&#39;m always intrigued about the psychology behind people who prefer to buy dead beat companies because the price is low rather than the companies of tomorrow because the price is high. </p>\n\n<p>It&#39;s a pretty simple decision when you think about it right? Would you rather buy companies that are probably going to have incredible growth in the future but you&#39;re going to have to pay a lot now to get on the train, or you can buy companies that are probably going to have below average to average growth but you get to buy the shares at a low price?</p>\n\n<p>So high price for high growth, or low price for low growth? That&#39;s the question I&#39;m asking... And from many posts I see especially on <a href=\"/r/investing\">/r/investing</a> and <a href=\"/r/UKInvesting\">/r/UKInvesting</a> and sometimes on <a href=\"/r/stocks\">/r/stocks</a>, it seems like people overwhelmingly prefer buying average run of the mill companies just because the share price isn&#39;t high, over the companies of tomorrow because their price is high.</p>\n\n<p>But if there&#39;s one thing investing over the years has taught me it&#39;s that the share price of great companies is usually always high (or close to it), and with good reason. Why are so many people put off from buying a stock because the price is high? You shouldn&#39;t be investing in a company based off the share price anyway.</p>\n\n<p>Take the ARK funds for example, we all know <em>almost</em> every company in every fund has amazing potential and many will likely become multi hundred billion dollar companies that will revolutionise the world we live in, and yet people are scared to buy in because the price is high? </p>\n\n<p>Instead they&#39;d rather buy Exxon mobil, Carnival, Rolls Royce or some other beat down stock even though they <strong>KNOW</strong> these companies are nothing to write home about and their growth is very limited going forward. </p>\n\n<p>It&#39;s almost impossible to find a company of tomorrow whose share price isn&#39;t high, and even the few times when they do drop 50% or more it&#39;s usually still considered too high for many people to pull the trigger, so they keep waiting for it to go even cheaper and end up missing it completely. So does this mean you&#39;re never going to invest in tomorrow? </p>\n\n<p>It&#39;s such a fascinating thing to observe I just want to start a little conversation around it.</p>\n</div><!-- SC_ON -->",
  "score": 178,
  "permalink": "/r/stocks/comments/lfaqo3/the_psychology_behind_buying_dead_beat_companies/",
  "subreddit": "stocks",
  "id": "lfaqo3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123203699
}