{
  "author": "JLeeSaxon",
  "original_created_utc": 1631220726,
  "title": "Is moving out at 18 an artifact of World War II?",
  "created_utc": 1631239746,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Someone shared some social media posts from some Thai and Pakistani kids who were flummoxed by the independence expected of them while in America for grad school because it was &#39;normal in their cultures to live and help out at home in early adulthood, often until marriage.&#39;</p>\n\n<p>I&#39;m curious about the accuracy of the historical aspects of this reply someone posted (parts of it break the twenty year rule and get into politics, but I wasn&#39;t sure how readable it would be if I snipped them out):</p>\n\n<p>&quot;In Western culture, including America, it was normal for kids to live with their parents into adulthood and until marriage, sometimes longer. In America, that changed (for men) in the 40&#39;s and 50&#39;s when it became extremely easy for an 18 year old to get a job that paid more than enough to live comfortably on or even to afford college which would practically guarantee an even better job. [Edit: Was the GI Bill a major factor here?]</p>\n\n<p>And now those jobs don&#39;t exist, and guess what! People are living with their parents again! But that 70-year span was <em>just long enough</em> that it fell out of common memory, so now kids are &quot;failures&quot; because the economics have changed.</p>\n\n<p>In fact, a great deal of American culture is still based on the memory of the &#39;40s and &#39;50s as baseline normalcy despite them being a total fluke at the time. World War II and McCarthyism created a massive shift toward rabid patriotism, Christian fundamentalism, and the ideal of the &quot;nuclear family&quot; which resembled nothing before it and which [endures] because many of our most powerful politicians are just old enough that this period of sudden fanaticism is <em>their</em> &quot;nostalgic good &#39;ole days&quot; and &quot;the way things are <em>supposed</em> to be.&quot;</p>\n</div><!-- SC_ON -->",
  "score": 129,
  "permalink": "/r/AskHistorians/comments/pl6drg/is_moving_out_at_18_an_artifact_of_world_war_ii/",
  "subreddit": "AskHistorians",
  "id": "pl6drg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Someone shared some social media posts from some Thai and Pakistani kids who\nwere flummoxed by the independence expected of them while in America for grad\nschool because it was 'normal in their cultures to live and help out at home in\nearly adulthood, often until marriage.'\n\nI'm curious about the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ある人が、タイやパキスタンの子供たちのソーシャルメディアへの投稿を紹介してくれました。\nアメリカの大学院に進学する際に求められる自立心に戸惑っているタイやパキスタンの子供たちの投稿を紹介しました。\nなぜなら、彼らの文化では、成人してから結婚するまでの間、家に住み、家事を手伝うのが普通だからです。\n彼らの文化では、成人してから結婚するまでの間、家に住んで手伝いをするのが普通です」。\n\n私が興味を持ったのは...",
      "title": "18歳で引っ越すのは第二次世界大戦の影響か？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有人在社交媒体上分享了一些泰国和巴基斯坦孩子的帖子，他们对国际社会的做法感到困惑。\n在美国读研究生时，他们对自己的独立性感到困惑。\n因为在他们的文化中，成年后在家里生活和帮忙是 \"正常的\"。\n因为在他们的文化中，\"成年后在家里生活和帮助别人是正常的，通常是在结婚之前\"。\n\n我很好奇...",
      "title": "18岁时搬出去是二战的产物吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有人在社交媒體上分享了一些泰國和巴基斯坦孩子的帖子，他們對國際社會的做法感到困惑。\n在美國讀研究生時，他們對自己的獨立性感到困惑。\n因爲在他們的文化中，成年後在家裏生活和幫忙是 \"正常的\"。\n因爲在他們的文化中，\"成年後在家裏生活和幫助別人是正常的，通常是在結婚之前\"。\n\n我很好奇...",
      "title": "18歲時搬出去是二戰的產物嗎？"
    }
  ]
}