{
  "author": "TNGSystems",
  "original_created_utc": 1629113836,
  "title": "Total capitulation - Safemoon is now dead.",
  "created_utc": 1629125094,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>On one hand, I lament the obvious negative sentiment these new investors now have towards the Crypto industry. They were led down the path of hopes, ambitions and overnight riches and now they&#39;re left with millions or billions of virtually worthless tokens.  </p>\n\n<p>In one day, against the context of a surging Crypto Market, Safemoon stands alone in a sea of green as the sole red Crypto. <strong>In one day, the price has collapsed 36% - 22% in the last hour alone.</strong>  </p>\n\n<p>This stands as a sombre warning, which will be routinely ignored by the next wave of manic investors looking for an overnight 16,000%  </p>\n\n<p>And yet, on their subreddit, a queue is forming to dump yet more BNB and help the whales exit at a higher price. It&#39;s sickening.  </p>\n\n<p>So on the other hand, I don&#39;t feel bad for pointing it out. I don&#39;t feel bad for the &quot;I told you so&quot;. And I don&#39;t feel bad for the schadenfreude I am experiencing.  </p>\n\n<p>Myself and many other Crypto enthusiasts gave repeated, genuine and compassionate advice on the huge red flags, which were routinely ignored or thrown back in our faces.  </p>\n\n<p>Safemoon investors - you made your bed, lie in it.</p>\n</div><!-- SC_ON -->",
  "score": 190,
  "permalink": "/r/CryptoCurrency/comments/p5eapb/total_capitulation_safemoon_is_now_dead/",
  "subreddit": "CryptoCurrency",
  "id": "p5eapb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "On one hand, I lament the obvious negative sentiment these new investors now\nhave towards the Crypto industry. They were led down the path of hopes,\nambitions and overnight riches and now they're left with millions or billions of\nvirtually worthless tokens.\n\nIn one day, against the context of a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "一方で、このような新しい投資家が、Cry.Netに対して明らかにネガティブな感情を抱いていることを嘆いています。\n嘆いています。彼らは期待と野心、そして過剰な投資の道に導かれました。\n一夜にして大金持ちになったのに、何百万、何十億という事実上価値のないトークンを手にしてしまったのです。\n事実上価値のないトークンが残っています。\n\nたった一日で、このような状況になってしまいました。",
      "title": "完全な屈服 - Safemoonは今死んでいる。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一方面，我对这些新投资者现在明显的负面情绪感到遗憾\n对加密货币行业的负面情绪。他们被带入了希望之路。\n野心和一夜暴富的道路上，现在他们只剩下几百万或几十亿的\n几乎毫无价值的代币。\n\n在一天之内，在这样的背景下...",
      "title": "完全投降--Safemoon现在已经死了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一方面，我對這些新投資者現在明顯的負面情緒感到遺憾\n對加密貨幣行業的負面情緒。他們被帶入了希望之路。\n野心和一夜暴富的道路上，現在他們只剩下幾百萬或幾十億的\n幾乎毫無價值的代幣。\n\n在一天之內，在這樣的背景下...",
      "title": "完全投降--Safemoon現在已經死了。"
    }
  ]
}