{
  "author": "AMECP",
  "original_created_utc": 1631677225,
  "title": "Would it be illegal to rise up against a tyrannical local government in the US?",
  "created_utc": 1631690230,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Say for an second I live in a town that has major election fraud and the police are used as armed wing of the government that intimidates you to be quiet about the situation and if you try anything legally you’ll be stomped on. Would it be illegal federally to rise up with arms to put down a local tyrannical government. </p>\n\n<p>I think of Athens Tennessee when WW2 Vets basically forced out the mayor and sherif and had a shoot out at a courthouse to get the ballots.  Would this situation be illegal? It’s called the Battle of Athens</p>\n\n<p>Just fyi I disagree with this rout and don’t have the means to do it or want to do it, just courious.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/poibr3/would_it_be_illegal_to_rise_up_against_a/",
  "subreddit": "NoStupidQuestions",
  "id": "poibr3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Say for an second I live in a town that has major election fraud and the police\nare used as armed wing of the government that intimidates you to be quiet about\nthe situation and if you try anything legally you’ll be stomped on. Would it be\nillegal federally to rise up with arms to put down a local…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、私が大規模な不正選挙が行われた町に住んでいて、警察が政府の武装組織として使われているとします。\n警察は政府の武装組織として使われていて、この状況を黙認するように威嚇しています。\n合法的に何かをしようとすると、踏みつけられてしまうのです。それは\n連邦政府は、地方自治体を鎮圧するために武器を持って立ち上がることを違法としています。",
      "title": "アメリカでは、専制的な地方政府に対して立ち上がることは違法になるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "假设我住在一个有重大选举舞弊行为的城市，警察被用作政府的武装部门，恐吓你对此事保持沉默。\n警察被用作政府的武装部门，恐吓你对情况保持沉默。\n如果你尝试任何合法的方式，你会被踩在脚下。这是否是\n联邦政府用武器起来镇压一个地方，会不会是非法的？",
      "title": "在美国，起来反对一个暴虐的地方政府会不会是非法的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "假設我住在一個有重大選舉舞弊行爲的城市，警察被用作政府的武裝部門，恐嚇你對此事保持沉默。\n警察被用作政府的武裝部門，恐嚇你對情況保持沉默。\n如果你嘗試任何合法的方式，你會被踩在腳下。這是否是\n聯邦政府用武器起來鎮壓一個地方，會不會是非法的？",
      "title": "在美國，起來反對一個暴虐的地方政府會不會是非法的？"
    }
  ]
}