{
  "author": "Geek-Workshop",
  "original_created_utc": 1630685032,
  "title": "Do you feel like you’ve lost 2 years of your life?",
  "created_utc": 1630712224,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When the pandemic started I was 15, I’m now 17 but looking around I don’t feel it. So many experiences I’ve missed out on and it just feels so strange. </p>\n\n<p>I’ve been doing online school ever since the pandemic started (my high school had a horrible online program when it all started and going to an actual dedicated online school seemed the better choice). And I just feel like the world has passed me by. I’ve kept in touch with all my friends and still talk to them almost daily. I’m still dating a girl I used to to go school with and overall I feel I should be happy. I like my online school and I love all the extra free time but I still can’t help but feel like I’ve missed so much. </p>\n\n<p>I have to keep reminding myself that other people probably feel the same way and that everyone’s had to do virtual stuff for over a year now. Even now some people are still doing virtual school and not going back yet. And everyone’s had to get used to not getting to do outside things with other people. But that’s why I’m posting this to truly see if other people do feel this way. I feel like I’ve lost my high school experience and I still feel like I’m 15.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/ph84sk/do_you_feel_like_youve_lost_2_years_of_your_life/",
  "subreddit": "TooAfraidToAsk",
  "id": "ph84sk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "When the pandemic started I was 15, I’m now 17 but looking around I don’t feel\nit. So many experiences I’ve missed out on and it just feels so strange.\n\nI’ve been doing online school ever since the pandemic started (my high school\nhad a horrible online program when it all started and going to an…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "パンデミックが始まった時、私は15歳で、今は17歳ですが、周りを見ても実感がありません。\n感じない。逃してしまった多くの経験があり、それがとても不思議に感じられます。\n\nパンデミックが始まって以来、私はオンラインスクールを利用しています（私が通っていた高校では\n私の高校では、パンデミックが始まったときにひどいオンラインプログラムがありましたが、私はオンラインスクールに通っていました。",
      "title": "人生の2年分を失ったような気がしませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当大流行病开始时，我是15岁，现在我是17岁，但环顾四周，我没有感觉到\n它。我错过了这么多经历，感觉很奇怪。\n\n自从大流行病开始以来，我就一直在上网校（我的高中\n当这一切开始的时候，我的高中有一个可怕的在线课程，并且去了一所大学。",
      "title": "你是否觉得你已经失去了两年的生命？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當大流行病開始時，我是15歲，現在我是17歲，但環顧四周，我沒有感覺到\n它。我錯過了這麼多經歷，感覺很奇怪。\n\n自從大流行病開始以來，我就一直在上網校（我的高中\n當這一切開始的時候，我的高中有一個可怕的在線課程，並且去了一所大學。",
      "title": "你是否覺得你已經失去了兩年的生命？"
    }
  ]
}