{
  "author": "angrysatoshi",
  "original_created_utc": 1655329225,
  "title": "100$ in bitcoin for most upvoted comment",
  "created_utc": 1655364699,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Since my last post I’ve gotten over 70 chat requests, mostly people begging me for money giving me life story etc. &lt;/p&gt;\n\n&lt;p&gt;I will give $75 in bitcoin away 24 hours after this is posted to the most upvoted comment.25$ to the most downvoted. I’ll do this once a week as long as bitcoin is under 25k&lt;/p&gt;\n\n&lt;p&gt;Edit- if we have multiple ties, I will let the mods choose a winner in comment.&lt;/p&gt;\n\n&lt;p&gt;Edit- mod who was messaging me please DM I lost the chat.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 306,
  "permalink": "/r/Bitcoin/comments/vd5gjn/100_in_bitcoin_for_most_upvoted_comment/",
  "subreddit": "Bitcoin",
  "id": "vd5gjn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Since my last post I’ve gotten over 70 chat requests, mostly people begging me\nfor money giving me life story etc.\n\nI will give $75 in bitcoin away 24 hours after this is posted to the most\nupvoted comment.25$ to the most downvoted. I’ll do this once a week as long as\nbitcoin is under 25k\n\nEdit- if…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "前回の投稿以来、70件以上のチャット依頼があり、そのほとんどが私に依頼する人たちです。\nをもらった。\n\nこの投稿の24時間後に、最もアップボートされたコメントに75ドル、最もダウンボートされたコメントに25ドルのビットコインを進呈します。\nアップボートコメントに75ドル、ダウンボートコメントに25ドル。ビットコインが2万5千円以下であれば、週に一度、このキャンペーンを行います。\nビットコインが25k以下である限り。\n\n編集 - もし...",
      "title": "最も多くアップヴォートされたコメントには100ドル分のビットコインが贈られます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自从我上次发帖以来，我已经收到了70多个聊天请求，大多数人都在求我\n向我要钱，给我讲人生故事等等。\n\n在这个帖子发布后24小时内，我将把75美元的比特币赠送给最\n的评论赠送75美元的比特币，而反对者则赠送25美元。我每周都会这样做一次，只要\n比特币在25000以下\n\n编辑-如果...",
      "title": "100美元的比特币用于奖励最受欢迎的评论"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自從我上次發帖以來，我已經收到了70多個聊天請求，大多數人都在求我\n向我要錢，給我講人生故事等等。\n\n在這個帖子發佈後24小時內，我將把75美元的比特幣贈送給最\n的評論贈送75美元的比特幣，而反對者則贈送25美元。我每週都會這樣做一次，只要\n比特幣在25000以下\n\n編輯-如果...",
      "title": "100美元的比特幣用於獎勵最受歡迎的評論"
    }
  ]
}