{
  "author": "Away_Philosopher_484",
  "original_created_utc": 1655666740,
  "title": "Why is drag not considered as offensive as black face?",
  "created_utc": 1655680868,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am looking to be educated, and not sure what a better subreddit would be to ask such a question, so please hear me out before jumping to hating me.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve long wondered why black face and drag aren&amp;#39;t considered relatively equal. I&amp;#39;m not talking about trans folk that wear clothing that helps them feel more in line with the gender they identify with, I&amp;#39;m talking about cis men that dress up in drag for fun, or for parties, for twitch streams, etc.&lt;/p&gt;\n\n&lt;p&gt;My understanding of why blackface is offensive is that it incredibly exaggerates the features of a person of color, through literal pitch black face paint, giant lips, etc.&lt;/p&gt;\n\n&lt;p&gt;A lot of the instances of drag I&amp;#39;ve seen have done similar things, exaggerating feminine features/stereotypes; giant tits, pounds of makeup, etc.&lt;/p&gt;\n\n&lt;p&gt;Another related thing is voice. If a non-black person spoke in a style akin to black folk, it would be seen as offensive, but drag queens will often speak flamboyantly to sound more feminine.&lt;/p&gt;\n\n&lt;p&gt;Can someone please explain to me why a non-black person acting and dressing themselves up as a black person is offensive, but a non-woman acting and dressing themselves up as a woman isn&amp;#39;t?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 139,
  "permalink": "/r/NoStupidQuestions/comments/vg2kdn/why_is_drag_not_considered_as_offensive_as_black/",
  "subreddit": "NoStupidQuestions",
  "id": "vg2kdn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am looking to be educated, and not sure what a better subreddit would be to\nask such a question, so please hear me out before jumping to hating me.\n\nI've long wondered why black face and drag aren't considered relatively equal.\nI'm not talking about trans folk that wear clothing that helps them…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は教育されることを探しています、そして、より良いサブレディトは何であるかわかりません。\nこのような質問をするのに適したsubredditがわからないので、私を憎む前に聞いてください。\n\n私は長い間、なぜブラックフェイスとドラッグが比較的平等に考えられていないのか不思議に思っていました。\nトランスフォーマーが着る服のことではありません...",
      "title": "なぜドラッグはブラックフェイスほど不快に思われないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我希望得到教育，但不知道有什么更好的子版块可以问这样的问题。\n我想知道为什么黑脸和变装不被认为是相互关联的，所以请听我说，然后再恨我。\n\n我一直在想，为什么黑脸和变装不被认为是相对平等的。\n我不是在说那些穿衣服帮助他们的变性人...",
      "title": "为什么变装不被认为像黑脸一样具有攻击性？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我希望得到教育，但不知道有什麼更好的子版塊可以問這樣的問題。\n我想知道爲什麼黑臉和變裝不被認爲是相互關聯的，所以請聽我說，然後再恨我。\n\n我一直在想，爲什麼黑臉和變裝不被認爲是相對平等的。\n我不是在說那些穿衣服幫助他們的變性人...",
      "title": "爲什麼變裝不被認爲像黑臉一樣具有攻擊性？"
    }
  ]
}