{
  "author": "Away_Philosopher_484",
  "original_created_utc": 1655666740,
  "title": "Why is drag not considered as offensive as black face?",
  "created_utc": 1655680868,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am looking to be educated, and not sure what a better subreddit would be to ask such a question, so please hear me out before jumping to hating me.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve long wondered why black face and drag aren&amp;#39;t considered relatively equal. I&amp;#39;m not talking about trans folk that wear clothing that helps them feel more in line with the gender they identify with, I&amp;#39;m talking about cis men that dress up in drag for fun, or for parties, for twitch streams, etc.&lt;/p&gt;\n\n&lt;p&gt;My understanding of why blackface is offensive is that it incredibly exaggerates the features of a person of color, through literal pitch black face paint, giant lips, etc.&lt;/p&gt;\n\n&lt;p&gt;A lot of the instances of drag I&amp;#39;ve seen have done similar things, exaggerating feminine features/stereotypes; giant tits, pounds of makeup, etc.&lt;/p&gt;\n\n&lt;p&gt;Another related thing is voice. If a non-black person spoke in a style akin to black folk, it would be seen as offensive, but drag queens will often speak flamboyantly to sound more feminine.&lt;/p&gt;\n\n&lt;p&gt;Can someone please explain to me why a non-black person acting and dressing themselves up as a black person is offensive, but a non-woman acting and dressing themselves up as a woman isn&amp;#39;t?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 139,
  "permalink": "/r/NoStupidQuestions/comments/vg2kdn/why_is_drag_not_considered_as_offensive_as_black/",
  "subreddit": "NoStupidQuestions",
  "id": "vg2kdn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am looking to be educated, and not sure what a better subreddit would be to\nask such a question, so please hear me out before jumping to hating me.\n\nI've long wondered why black face and drag aren't considered relatively equal.\nI'm not talking about trans folk that wear clothing that helps them…"
}