{
  "author": "MorallyNeutralOk",
  "original_created_utc": 1634757087,
  "title": "Did the Nazis have any intention of telling the German population openly that they had murdered all the Jews in Europe, if they had completed the Holocaust?",
  "created_utc": 1634843212,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What were Hitler’s plans after a hypothetical completion of Generalplan Ost and the Holocaust, once Germans began settling the conquered territories of the USSR, the native population of which the Nazis tried to exterminate? What was he planning on telling the future German settlers if they started asking what had happened to the previous inhabitants, including the Jewish people on those territories?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/qc8gff/did_the_nazis_have_any_intention_of_telling_the/",
  "subreddit": "AskHistorians",
  "id": "qc8gff",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "What were Hitler’s plans after a hypothetical completion of Generalplan Ost and\nthe Holocaust, once Germans began settling the conquered territories of the\nUSSR, the native population of which the Nazis tried to exterminate? What was he\nplanning on telling the future German settlers if they started…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "オスト将軍計画とホロコースト計画が完了したと仮定した場合、ヒトラーはどのような計画を立てたのでしょうか。\nホロコーストが完了した後、ナチスが絶滅させようとしたソ連の征服地にドイツ人が入植し始めると、ヒトラーはどのような計画を立てたのでしょうか？\nナチスが絶滅させようとしたソビエト連邦の征服地にドイツ人が入植し始めたら、ヒトラーはどのような計画を立てたのでしょうか？彼は\nもし、将来のドイツ人入植者たちが...。",
      "title": "ナチスは、ホロコーストを完了した場合、ヨーロッパのユダヤ人をすべて殺害したことを、ドイツ国民に公然と伝えるつもりがあったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在假设完成《东方总计划》和大屠杀之后，希特勒的计划是什么？\n大屠杀后，一旦德国人开始在被征服的苏联领土上定居，纳粹试图消灭这些领土上的当地居民，希特勒的计划是什么？\n苏联的本土人口，纳粹试图消灭这些人口？他打算如何\n计划告诉未来的德国定居者，如果他们开始...",
      "title": "如果纳粹完成了大屠杀，他们有没有打算公开告诉德国民众，他们已经谋杀了欧洲所有的犹太人？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在假設完成《東方總計劃》和大屠殺之後，希特勒的計劃是什麼？\n大屠殺後，一旦德國人開始在被征服的蘇聯領土上定居，納粹試圖消滅這些領土上的當地居民，希特勒的計劃是什麼？\n蘇聯的本土人口，納粹試圖消滅這些人口？他打算如何\n計劃告訴未來的德國定居者，如果他們開始...",
      "title": "如果納粹完成了大屠殺，他們有沒有打算公開告訴德國民衆，他們已經謀殺了歐洲所有的猶太人？"
    }
  ]
}