{
  "author": "GamerTheGr8",
  "the_new_excerpt": "So to preface this, I want to reassure you that I'm not some gross neckbeard\nthat never showers or brushes his teeth. I just get annoyed sometimes with the\ngeneral maintenance the human body requires. For example, when I'm starting to\nfeel tired and it's getting late, I never actually want to go to…",
  "original_created_utc": 1618846530,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "前置きが長くなりましたが、私はシャワーも歯磨きもしないキモい首振り野郎ではありません。\nシャワーも歯磨きもしないキモい奴ではありません。ただ、時々、人間の体の一般的なメンテナンスに腹が立つことがあります。\n人間の体に必要な一般的なメンテナンスに、時々イラッとします。例えば、疲れがたまってきたときや\n例えば、疲れてきて遅くなってきた時に、実際には行きたくない...",
      "title": "一般的な人間の衛生やメンテナンスに煩わされることはありませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以在这之前，我想向你保证，我不是什么毛脖子胡子。\n从来不洗澡或刷牙。我只是有时候会觉得很烦\n人体所需的一般保养。例如，当我开始\n感觉累了，天色也晚了，我其实从来不想去... ...",
      "title": "还有人因为处理一般的人体卫生和保养而烦恼吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以在這之前，我想向你保證，我不是什麼毛脖子鬍子。\n從來不洗澡或刷牙。我只是有時候會覺得很煩\n人體所需的一般保養。例如，當我開始\n感覺累了，天色也晚了，我其實從來不想去... ...",
      "title": "還有人因爲處理一般的人體衛生和保養而煩惱嗎？"
    }
  ],
  "title": "Does anyone else get annoyed dealing with general human hygiene and maintenance?",
  "created_utc": 1618854740,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So to preface this, I want to reassure you that I&#39;m not some gross neckbeard that never showers or brushes his teeth.  I just get annoyed sometimes with the general maintenance the human body requires.  For example, when I&#39;m starting to feel tired and it&#39;s getting late, I never actually want to go to sleep, but I know that I have to because I need to sleep.  Sleep takes up a lot of time, and I want to use all of that time to do things, so whenever I go to sleep I&#39;m usually thinking to myself &quot;damn, I wish I was already awake tomorrow&quot;.  Same thing with simple hygiene like brushing my teeth or taking a shower.  It&#39;s time I want to be using to do other things, but instead I have to dedicate some part of my day solely to cleaning my body.  I still do it, but it&#39;s one of those things I just want to be over ASAP so I can get back to my life.  There are so many little things that take up time like shaving, clipping nails, brushing hair, etc., and I&#39;ve always felt like &quot;damn, I really gotta take up some time during my day just to make sure that I don&#39;t end up all gross and smelly&quot;.  And yes, I realize that these things (aside from sleep) take up very little time in the whole of a day, but it still makes me feel annoyed that I have to spend time on them instead of spending time on what I want.  Does anyone else feel this way, or am I just a little weird?</p>\n</div><!-- SC_ON -->",
  "score": 125,
  "permalink": "/r/TooAfraidToAsk/comments/mu399i/does_anyone_else_get_annoyed_dealing_with_general/",
  "subreddit": "TooAfraidToAsk",
  "id": "mu399i",
  "is_self": true,
  "media": null,
  "is_video": false
}