{
  "author": "wildinterior",
  "the_new_excerpt": "Copied text from Facebook\n\n“Twitter may ban me for this but I willingly accept that fate: Your decision to\npermanently ban President Trump is a serious mistake.\n\nThe Ayatollah can tweet, but Trump can’t! Says a lot about the people who run\nTwitter.\n\nI’m more determined than ever to strip Section 230…",
  "original_created_utc": 1610205001,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "从Facebook复制文本\n\n“推特可能会因此而禁止我，但我愿意接受这个命运：你决定\n永久禁止特朗普总统是一个严重的错误。\n\n阿亚图拉可以发推特，但特朗普不能！很能说明那些参选的人\n推特。\n\n我比以往任何时候都更坚定地要剥离第230条…",
      "title": "参议员林赛·格雷厄姆敦促国会废除第230条。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從Facebook複製文本\n\n“推特可能會因此而禁止我，但我願意接受這個命運：你決定\n永久禁止特朗普總統是一個嚴重的錯誤。\n\n阿亞圖拉可以發推特，但特朗普不能！很能說明那些參選的人\n推特。\n\n我比以往任何時候都更堅定地要剝離第230條…",
      "title": "參議員林賽·格雷厄姆敦促國會廢除第230條。"
    }
  ],
  "title": "Senator Lindsey Graham urges Congress to repeal Section 230.",
  "created_utc": 1610218950,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Copied text from Facebook</strong></p>\n\n<p>“Twitter may ban me for this but I willingly accept that fate: Your decision to permanently ban President Trump is a serious mistake. </p>\n\n<p>The Ayatollah can tweet, but Trump can’t! Says a lot about the people who run Twitter. </p>\n\n<p>I’m more determined than ever to strip Section 230 protections from Big Tech (Twitter) that let them be immune from lawsuits. Big Tech are the only companies in America that virtually have absolute immunity from being sued for their actions, and it’s only because Congress gave them that protection. </p>\n\n<p>It is now time for Congress to repeal Section 230 and put Big Tech on the same legal footing as every other company in America. Legal accountability.”</p>\n</div><!-- SC_ON -->",
  "score": 52,
  "permalink": "/r/stocks/comments/ktsiqg/senator_lindsey_graham_urges_congress_to_repeal/",
  "subreddit": "stocks",
  "id": "ktsiqg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706381126
}