{
  "author": "xavierwest888",
  "original_created_utc": 1642505462,
  "title": "As statistically most of you out there have portfolios in the red right now here's a list of less embarrassing reasons to tell people instead of saying you lost it on crypto",
  "created_utc": 1642516400,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;I have a drinking problem (made more convincing if you actually have one which if the market keeps dropping you probably will soon).&lt;/li&gt;\n&lt;li&gt;I have a drug problem but I&amp;#39;m getting help.&lt;/li&gt;\n&lt;li&gt;I have a drug problem and I&amp;#39;m never getting help.&lt;/li&gt;\n&lt;li&gt;I have a gambling problem (the best lies are the ones that are also true so this one is a good one!)&lt;/li&gt;\n&lt;li&gt;I&amp;#39;m having an affair with my much younger and hotter receptionist.&lt;/li&gt;\n&lt;li&gt;I used to have an affair with my receptionist and she now has my bastard child that I need to support.&lt;/li&gt;\n&lt;li&gt;I have very specific pornography tastes that require expensive donations to have carried out (you will NEVER receive follow up questions on this one!)&lt;/li&gt;\n&lt;li&gt;I purchased and then lost 11 wallets full of cash one after another.&lt;/li&gt;\n&lt;li&gt;I brought a new home to live in but I forgot the address of where it is.&lt;/li&gt;\n&lt;li&gt;I traded it all for magic beans in the hope of a beanstalk growing in my garden and allowing me to find the golden goose (this one is more of a retelling than a lie).&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 361,
  "permalink": "/r/CryptoCurrency/comments/s6vgdr/as_statistically_most_of_you_out_there_have/",
  "subreddit": "CryptoCurrency",
  "id": "s6vgdr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": " 1.  I have a drinking problem (made more convincing if you actually have one\n     which if the market keeps dropping you probably will soon).\n 2.  I have a drug problem but I'm getting help.\n 3.  I have a drug problem and I'm never getting help.\n 4.  I have a gambling problem (the best lies are…"
}