{
  "author": "xavierwest888",
  "original_created_utc": 1642505462,
  "title": "As statistically most of you out there have portfolios in the red right now here's a list of less embarrassing reasons to tell people instead of saying you lost it on crypto",
  "created_utc": 1642516400,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;I have a drinking problem (made more convincing if you actually have one which if the market keeps dropping you probably will soon).&lt;/li&gt;\n&lt;li&gt;I have a drug problem but I&amp;#39;m getting help.&lt;/li&gt;\n&lt;li&gt;I have a drug problem and I&amp;#39;m never getting help.&lt;/li&gt;\n&lt;li&gt;I have a gambling problem (the best lies are the ones that are also true so this one is a good one!)&lt;/li&gt;\n&lt;li&gt;I&amp;#39;m having an affair with my much younger and hotter receptionist.&lt;/li&gt;\n&lt;li&gt;I used to have an affair with my receptionist and she now has my bastard child that I need to support.&lt;/li&gt;\n&lt;li&gt;I have very specific pornography tastes that require expensive donations to have carried out (you will NEVER receive follow up questions on this one!)&lt;/li&gt;\n&lt;li&gt;I purchased and then lost 11 wallets full of cash one after another.&lt;/li&gt;\n&lt;li&gt;I brought a new home to live in but I forgot the address of where it is.&lt;/li&gt;\n&lt;li&gt;I traded it all for magic beans in the hope of a beanstalk growing in my garden and allowing me to find the golden goose (this one is more of a retelling than a lie).&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 361,
  "permalink": "/r/CryptoCurrency/comments/s6vgdr/as_statistically_most_of_you_out_there_have/",
  "subreddit": "CryptoCurrency",
  "id": "s6vgdr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": " 1.  I have a drinking problem (made more convincing if you actually have one\n     which if the market keeps dropping you probably will soon).\n 2.  I have a drug problem but I'm getting help.\n 3.  I have a drug problem and I'm never getting help.\n 4.  I have a gambling problem (the best lies are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": " 1.  飲酒の問題がある（実際にあればより説得力がある\n     相場が下がり続ければ、おそらくすぐにでもそうなるでしょうが）。\n 2.  私は薬物の問題を抱えているが、助けを求めている。\n 3.  私は薬物の問題を抱えているが、決して助けは求めていない。\n 4.  私はギャンブルの問題を抱えている（最高の嘘は...",
      "title": "統計的にほとんどの人が今赤字のポートフォリオを持っているので、暗号で失ったと言う代わりに、人々に伝えるべき恥ずかしくない理由のリストを以下に示します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": " 1.  我有酗酒问题（如果你真的有酗酒问题，就更有说服力了\n     如果市场持续下跌，你可能很快就会有）。\n 2.  我有毒品问题，但我正在接受帮助。\n 3.  我有毒品问题，但我从未得到过帮助。\n 4.  我有赌博问题（最好的谎言是......",
      "title": "据统计，你们中的大多数人的投资组合现在都处于亏损状态，这里列出了一些不那么尴尬的理由，可以告诉人们，而不是说你在加密货币上失去了它。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " 1.  我有酗酒問題（如果你真的有酗酒問題，就更有說服力了\n     如果市場持續下跌，你可能很快就會有）。\n 2.  我有毒品問題，但我正在接受幫助。\n 3.  我有毒品問題，但我從未得到過幫助。\n 4.  我有賭博問題（最好的謊言是......",
      "title": "據統計，你們中的大多數人的投資組合現在都處於虧損狀態，這裏列出了一些不那麼尷尬的理由，可以告訴人們，而不是說你在加密貨幣上失去了它。"
    }
  ]
}