{
  "author": "mycolll",
  "original_created_utc": 1636901073,
  "title": "Reputable Bitcoin Skeptics?",
  "created_utc": 1636918591,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi, guys.</p>\n\n<p>I&#39;m a bitcoin holder. I listen and read a lot about bitcoin but the information always comes from proponents of bitcoin. But because of that, I&#39;m worried that I&#39;m in a epistemic and filter bubble that might be distorting my judgement of the facts and risk. Therefore, I want to expose myself to reputable bitcoin skeptics to help develop a more comprehensive and nuanced understanding of bitcoin and its risk, as that seems like something that reasonable people should do. </p>\n\n<p>Does anyone have any suggestions?</p>\n</div><!-- SC_ON -->",
  "score": 189,
  "permalink": "/r/Bitcoin/comments/qtr86m/reputable_bitcoin_skeptics/",
  "subreddit": "Bitcoin",
  "id": "qtr86m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi, guys.\n\nI'm a bitcoin holder. I listen and read a lot about bitcoin but the information\nalways comes from proponents of bitcoin. But because of that, I'm worried that\nI'm in a epistemic and filter bubble that might be distorting my judgement of\nthe facts and risk. Therefore, I want to expose…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、皆さん。\n\n私はビットコインの保有者です。ビットコインについていろいろ聞いたり読んだりしていますが、情報はいつも\n情報はいつもビットコインの支持者からのものです。しかし、そのために、私は以下のことを心配しています。\n認識力とフィルターバブルの中にいて、事実とリスクの判断が歪んでいるのではないかと心配しています。\n事実とリスクの判断を歪めているのではないかと心配しています。そのため、私は、このような情報を公開したいと考えています。",
      "title": "評判の良いビットコイン・スケプティック？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，伙计们。\n\n我是一个比特币持有人。我听过也读过很多关于比特币的信息，但这些信息\n总是来自于比特币的支持者。但正因为如此，我担心\n我处在一个认识和过滤的泡沫中，可能会扭曲我对事实和风险的判断。\n事实和风险的判断。因此，我想揭开...",
      "title": "有信誉的比特币怀疑论者？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，夥計們。\n\n我是一個比特幣持有人。我聽過也讀過很多關於比特幣的信息，但這些信息\n總是來自於比特幣的支持者。但正因爲如此，我擔心\n我處在一個認識和過濾的泡沫中，可能會扭曲我對事實和風險的判斷。\n事實和風險的判斷。因此，我想揭開...",
      "title": "有信譽的比特幣懷疑論者？"
    }
  ]
}