{
  "author": "gohackthat",
  "the_new_excerpt": "Hello investors,\n\n(for pictures, please refer to the original post)\n\nhttps://www.reddit.com/r/Midasinvestors/comments/l3ugu7/market_commentary_how_about_that_gme_and_bb_craze/?utm_source=share&utm_medium=web2x&context=3\n\nWow... Like everyone else, I'm mesmerized by the stratospheric price action…",
  "original_created_utc": 1611471140,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "投资者朋友们，你们好。\n\n(图片请参考原帖)\n\nhttps://www.reddit.com/r/Midasinvestors/comments/l3ugu7/market_commentary_how_about_that_gme_and_bb_craze/?utm_source=share&utm_medium=web2x&context=3\n\n哗... 和其他人一样，我也被这平流层的价格行动所吸引... ...",
      "title": "市场评论（GME和BB的热潮如何？ 我们在市场周期中的位置？ ) - 1/23/2021"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "投資者朋友們，你們好。\n\n(圖片請參考原帖)\n\nhttps://www.reddit.com/r/Midasinvestors/comments/l3ugu7/market_commentary_how_about_that_gme_and_bb_craze/?utm_source=share&utm_medium=web2x&context=3\n\n譁... 和其他人一樣，我也被這平流層的價格行動所吸引... ...",
      "title": "市場評論（GME和BB的熱潮如何？ 我們在市場週期中的位置？ ) - 1/23/2021"
    }
  ],
  "title": "Market Commentary (How about that GME and BB craze? Where are we in the market cycle? ) - 1/23/2021",
  "created_utc": 1611522120,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello investors,</p>\n\n<p>(for pictures, please refer to the original post)</p>\n\n<p><a href=\"https://www.reddit.com/r/Midasinvestors/comments/l3ugu7/market_commentary_how_about_that_gme_and_bb_craze/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">https://www.reddit.com/r/Midasinvestors/comments/l3ugu7/market_commentary_how_about_that_gme_and_bb_craze/?utm_source=share&amp;utm_medium=web2x&amp;context=3</a></p>\n\n<p>Wow... Like everyone else, I&#39;m mesmerized by the stratospheric price action in the past few days. Look at the below numbers.</p>\n\n<p>&#x200B;</p>\n\n<p>GME (GameStop) made so many people happy and wealthy. Congratulations to everyone who participated in this amazing movement!!</p>\n\n<p>GME has been the topic of conversation for literally every single robinhooders and traders. </p>\n\n<p>I&#39;m sure by now that most of you are familiar with what happened to GME but for those who don&#39;t know, the short story is that the market markers and the short-sellers were &quot;squeezed&quot;, aka forced, to close/hedge their positions.</p>\n\n<p>These positions would have helped drive the stock price down in the past but since they closed them now, those downward pressures have evaporated. This basically lifted the ceiling and then the price skyrocketed.</p>\n\n<p>I know this phenomenon has created bipolar views on the stock markets right now. </p>\n\n<p>One group of people are advocating for the continued run-up in GME, BB, and PLTR (the folks on the next door) by squeezing the market makers and short-sellers, while the other group of people are talking down on those &quot;yoloers&quot; who are acting crazy and irrational.</p>\n\n<p>The reason why I&#39;m mentioning GME? For two reasons:</p>\n\n<p>1) I see an asymmetric opportunity in these crazy stocks. </p>\n\n<p>2) It serves as an important indicator for the overall market conditions.</p>\n\n<p><strong>1) In my view, there is a good risk/reward situation in GME, BB, and so on.</strong></p>\n\n<p>To preface my argument, I like to consider myself very conservative, risk-averse, and value-oriented investor. I emphasize on fundamentals, the stock price playing true to the company&#39;s earnings, and the actual cash flows.</p>\n\n<p>I&#39;m very like-minded with those group of people who think this GME run-up is crazy and irrational.</p>\n\n<p>However, many people forget that being a &quot;rational&quot; investor doesn&#39;t mean you should just ignore those hot tech stocks, crypto-mania, or GME price action.</p>\n\n<p>As a &quot;rational&quot; investor, you also don&#39;t need to feel jealous and anxious about those people who became wealthy from GME. I would like to go even a step further to compliment them for getting in at the right time.</p>\n\n<p>Afterall, we are playing a game of probability. </p>\n\n<p>If your friends or neighbors win lotteries in millions of dollars, should you feel jealous? Should you feel the FOMO? Absolutely not. No one could&#39;ve seen this coming and some people do get lucky. You can&#39;t blame a guy for winning a jackpot.</p>\n\n<p>Now, let&#39;s talk about what actions we can take to benefit from this situation.</p>\n\n<p>The way I look at it, we now have confirmed that lots of short-sellers in GME and BB have already realized their losses, aka covered their shorts. </p>\n\n<p>The market makers also have realized losses from their gamma squeeze, which is a more complicated concept but to simplify, it means that the downward pressure on the stock has weakened.</p>\n\n<p>It&#39;s rather a simple idea. We are looking at a situation where the stock can move further up due to the lifting of these ceilings. </p>\n\n<p>If I had to put numbers, it would certainly be more than 1:1 payout ratio but more like 3:1 ratio.</p>\n\n<p>Why wouldn&#39;t anyone participate in a game of blackjack that gives you 3x or 4x your money?</p>\n\n<p>To be extremely clear, I mention blackjack because buying these stocks is pure gambling, nothing more. It is not &quot;investing&quot;.</p>\n\n<p>Yet, it&#39;s gambling where the odds are tilted in our favor and thus, risk/reward is relatively high.</p>\n\n<p>Therefore, I have bought BB calls for 2% of my portfolio, specifically BB because the short interest is lower than GME.</p>\n\n<p>Furthermore, I&#39;m going to try to be cute and buy more GME call options come Monday. </p>\n\n<p>I would think that GME price would tank on Monday due to the excessive price run-up last Friday so that creates a buying opportunity.</p>\n\n<p>If I lose that 2% BB? I&#39;m totally okay with that. If it goes up 5x? Lucky me.</p>\n\n<p>ONLY BET AN AMOUNT OF MONEY YOU ARE OKAY LOSING!</p>\n\n<p>&#x200B;</p>\n\n<p><strong>2) What do all of these tell us about our current position in the market?</strong></p>\n\n<p>Typically, these types of manias are observed during market-tops. </p>\n\n<p>Howard Marks and David Einhorn list out the typical signs of market-tops.</p>\n\n<ol>\n<li>Initial public offering mania</li>\n<li>High valuations and new metrics for valuation</li>\n<li>Market concentration in a single sector and a few stocks</li>\n<li>S&amp;P 500-type market capitalizations for second-tier stocks that most people haven’t heard of</li>\n<li>A situation where the more fanciful and distant the narrative, the better the stock performs</li>\n<li>Outperformance of companies suspected of fraud based on the belief that there is no enforcement risk, without which “crime pays”</li>\n<li>Outsized reaction to economically irrelevant stock splits</li>\n<li>Increased participation of retail investors, who appear focused on the best-performing names</li>\n<li>Incredible trading volumes in speculative instruments, like weekly call options and worthless common stocks</li>\n<li><strong>A parabolic ascent toward a top.</strong></li>\n</ol>\n\n<p>(for those who don&#39;t know Howard Marks, I highly encourage to follow his &quot;memos&quot; on his website <a href=\"https://www.oaktreecapital.com/insights/howard-marks-memos\">https://www.oaktreecapital.com/insights/howard-marks-memos</a>. He is a legendary bond investor.)</p>\n\n<p>Of the above ten signs, roughly all of them describe the situation today very well.</p>\n\n<p>We are seeing IPO mania, high valuations, market concentration in a few stocks, outsized reaction to economically irrelevant stock splits, increased participation of retail investors, incredible trading volumes in speculative instruments, and parabolic ascent toward a top.</p>\n\n<p>It&#39;s no doubt we are &quot;near&quot; the market top. But how near? 3 months, 1 year, 5 years..?</p>\n\n<p>How can all of these happen in less than a year after the steepest GDP decline in history?</p>\n\n<p>The answer is monetary and fiscal responses. </p>\n\n<p>I mentioned in this commentary (<a href=\"https://www.reddit.com/r/Midasinvestors/comments/knxgex/market_commentary_2021_outlook_12312020/\">https://www.reddit.com/r/Midasinvestors/comments/knxgex/market_commentary_2021_outlook_12312020/</a> towards the bottom) that right now, the two biggest driving factors in the markets are the gov&#39;t and the JPow &amp; Co. </p>\n\n<p>The government is spending like there is no tomorrow, which makes total sense because it is much more dangerous for our economy to under-spend than over-spend.</p>\n\n<p>Jerome Powell is also providing massive purchases of Treasuries and zero rates policy, for the foreseeable future.</p>\n\n<p>As long as these two massive forces are in action, we will see even a greater hype and craze in the markets.</p>\n\n<p>We just started a bull-market run. Look at the below graphs.</p>\n\n<p>Given the fact that we just started a bull market and also observed lots of bubbles happening everywhere, I believe that we will see one of the greatest bubbles in history (if not already) until every last one of those the market bears are proven wrong. </p>\n\n<p>W<strong>hen every single person at the cocktail party is expecting a market rally, it is at that moment that the market is truly at the top and the bubble bursts.</strong>  </p>\n\n<p>That doesn&#39;t mean that market corrections of 10% or more can&#39;t happen in the meantime. In fact, I have been saying that there will be market corrections in the very near future and we should be ready for that as well.</p>\n\n<p>To summarize today&#39;s post, I would say there are opportunities in these maniac stocks and we should take advantage of them with limited risks. The manias also indicate that we are near the top of another market cycle and we should closely monitor the actions of the government and JPow &amp; Co.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Quick report card for 2020</strong></p>\n\n<p>Below post was my first market commentary one on Reddit, where I said I was bullish on tech names (BABA, PDD, STNE, FUTU, AMZN, FVRR, W, and SEDG).</p>\n\n<p><a href=\"https://www.reddit.com/r/Midasinvestors/comments/jtaze1/market_commentary_11122020/\">https://www.reddit.com/r/Midasinvestors/comments/jtaze1/market_commentary_11122020/</a> </p>\n\n<p>I&#39;ve gotten winners and losers, the losers being BABA and W. The winners were the rest. </p>\n\n<p>Obviously, I would&#39;ve never thought that FUTU would double in less than a month. I held call options on them but it was pure luck. </p>\n\n<p>I also called for rise in long-term treasury yield. Although I got the direction correct, the yield curve took way longer than I expected to steepen significantly. Now, I am even more bearish on the 30-year than before due to the rates breaking the technical levels.</p>\n\n<p>I was also long gold. I have unrealized losses on this one but I plan on getting back in as this is a 2-3 year play. </p>\n\n<p>&#x200B;</p>\n\n<p>Thanks for reading and if you would like to receive emails for the posts, please fill out this form. </p>\n\n<p><a href=\"https://docs.google.com/forms/d/e/1FAIpQLScZ6J9pFUq3At2yncsQ_L4XalvVEVa-BW2nbHR7-bJ9BRKplA/viewform?vc=0&amp;c=0&amp;w=1&amp;flr=0&amp;gxids=7628&amp;fbzx=4409293954243517011\">https://docs.google.com/forms/d/e/1FAIpQLScZ6J9pFUq3At2yncsQ_L4XalvVEVa-BW2nbHR7-bJ9BRKplA/viewform?vc=0&amp;c=0&amp;w=1&amp;flr=0&amp;gxids=7628&amp;fbzx=4409293954243517011</a></p>\n\n<p>As always, please feel free to share your ideas!</p>\n</div><!-- SC_ON -->",
  "score": 42,
  "permalink": "/r/investing/comments/l3uhgt/market_commentary_how_about_that_gme_and_bb_craze/",
  "subreddit": "investing",
  "id": "l3uhgt",
  "is_self": true,
  "media": null,
  "is_video": false
}