{
  "author": "Illustrious-Collar69",
  "original_created_utc": 1649501446,
  "title": "Is it possible to make a relationship between an asexual person and a sexual person work?",
  "created_utc": 1649572601,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I recently went out with someone I’m really interested in, we have a lot in common and they seem very genuine, funny, and intelligent. The only “issue” is that I’m sexual, and they’re ace and sexually repulsed.&lt;/p&gt;\n\n&lt;p&gt;I don’t really have a huge issue with this right now, as I can’t really be physical with someone I’m not extremely comfortable with anyway, but I would like to be with them physically. It’s not an absolute dealbreaker I suppose, but it does bum me out just a little.&lt;/p&gt;\n\n&lt;p&gt;How do other couples in this situation resolve this issue? Open relationship wouldn’t be an option because, as said, I can’t be with someone I’m not really close with romantically.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/tzqrc2/is_it_possible_to_make_a_relationship_between_an/",
  "subreddit": "TooAfraidToAsk",
  "id": "tzqrc2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I recently went out with someone I’m really interested in, we have a lot in\ncommon and they seem very genuine, funny, and intelligent. The only “issue” is\nthat I’m sexual, and they’re ace and sexually repulsed.\n\nI don’t really have a huge issue with this right now, as I can’t really be\nphysical…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、とても気になる人と付き合いました。\n彼らはとても純粋で、面白くて、知的です。唯一の「問題」は\n私は性的で、相手はエースで性的な反発があること。\n\n私は今、このことについて大きな問題意識を持っていません。\n物理的な...",
      "title": "アセクシャルの人とセクシャルの人の関係をうまくいかせることは可能ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近和一个我非常感兴趣的人约会，我们有很多共同点，他们看起来非常真诚、有趣、聪明。\n我们有很多共同点，他们看起来非常真诚、有趣和聪明。唯一的 \"问题 \"是\n我是有性欲的，而他们是王牌，在性方面很排斥。\n\n我现在对这个问题并没有很大的意见，因为我不能真正的\n肢体...",
      "title": "有可能使无性恋者和有性恋者之间的关系正常吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近和一個我非常感興趣的人約會，我們有很多共同點，他們看起來非常真誠、有趣、聰明。\n我們有很多共同點，他們看起來非常真誠、有趣和聰明。唯一的 \"問題 \"是\n我是有性慾的，而他們是王牌，在性方面很排斥。\n\n我現在對這個問題並沒有很大的意見，因爲我不能真正的\n肢體...",
      "title": "有可能使無性戀者和有性戀者之間的關係正常嗎？"
    }
  ]
}