{
  "author": "britoo",
  "the_new_excerpt": "i'm new into investing in crypto but i'm already seeing some gains ( Still\nlearning, bound to do some mistakes) , its just insane to me that some little\ngains have so much value here.\n\nI live in Brazil, things are REALLY rough here right now, alot of close people\ndying to covid, got a pay cut…",
  "original_created_utc": 1618314257,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は暗号への投資を始めたばかりですが、すでにいくつかの利益を得ています。\n勉強中なので、間違いもあるでしょうが）、ほんの少しの利益がここでは大きな価値を持つというのは、私にとっては非常識なことなのです。\n私はブラジルに住んでいます。\n\n私はブラジルに住んでいますが、ここでは今、非常に厳しい状況にあります。\n親しい人たちがコヴィドに殺されたり、給料を減らされたり...。",
      "title": "暗号は、ドルが高いところにとっては非常識なものです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个新的投资在加密，但我已经看到一些收益( 仍然\n学习，一定会犯一些错误），对我来说，它只是疯狂的一些小\n收益在这里有这么多的价值。\n\n我住在巴西，现在这里的情况真的很糟糕，很多亲近的人都在这里。\n奄奄一息的科维德，被降薪... ...",
      "title": "对于美元高涨的地方来说，加密货币是一件疯狂的事情。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個新的投資在加密，但我已經看到一些收益( 仍然\n學習，一定會犯一些錯誤），對我來說，它只是瘋狂的一些小\n收益在這裏有這麼多的價值。\n\n我住在巴西，現在這裏的情況真的很糟糕，很多親近的人都在這裏。\n奄奄一息的科維德，被降薪... ...",
      "title": "對於美元高漲的地方來說，加密貨幣是一件瘋狂的事情。"
    }
  ],
  "title": "Crypto is a insane thing for places where the dollar is high.",
  "created_utc": 1618321346,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>i&#39;m new into investing in crypto but i&#39;m already seeing some gains ( Still learning, bound to do some mistakes) , its just insane to me that some little gains have so much value here.</p>\n\n<p>I live in Brazil, things are REALLY rough here right now, alot of close people dying to covid, got a pay cut because of the quarantine ( Still, following it is the best course ) and the economy is getting worse everyday. </p>\n\n<p>Investing in crypto is the thing keeping me afloat, i had some gains ( 35 dollars ) from the BnB rise and it was already enough for my food supply of the month!! It felt so good to know that i can have this support.</p>\n\n<p>Thank you all that paved the way for this, and all that keep the market moving.</p>\n</div><!-- SC_ON -->",
  "score": 4104,
  "permalink": "/r/CryptoCurrency/comments/mq0ja5/crypto_is_a_insane_thing_for_places_where_the/",
  "subreddit": "CryptoCurrency",
  "id": "mq0ja5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566615661
}