{
  "author": "KosmosHD",
  "original_created_utc": 1632828802,
  "title": "IF THE RICH ARE NOT PAYING TAXES, NEITHER SHOULD YOU. This is how you can reduce your taxes with your crypto profits.",
  "created_utc": 1632847989,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>See if You Qualify for an Earned Income Tax Credit</p>\n\n<p>Even if you aren&#39;t required to pay federal income taxes, you could get a refund from the government. The earned income tax credit is a refundable tax credit of up to $6,660 for tax year 2020.</p>\n\n<p>The EITC is calculated with a formula that takes into consideration income and family size. The income limits for the credit range from $15,820 for single taxpayers with no children to $56,844 for married couples filing jointly who have three or more children.</p>\n\n<p>The current federal income tax brackets range from 10% to 37%, but you can get away with paying less in taxes if you&#39;re smart about claiming deductions and credits.</p>\n\n<p>However, there are still a number of ways for wage earners to lower their tax liability.</p>\n\n<p>Tax credits and deductions change regularly though, and the Tax Cuts and Jobs Act of 2017 eliminated some popular deductions and limited others.</p>\n\n<p>Use Your Side Hustle to Claim Business Deductions</p>\n\n<p>Self-employed individuals (full time or part time) are eligible for scores of tax deductions. That means your freelance projects or side gig as a ride-share driver could land you considerable tax savings.</p>\n\n<p>A few of the business deductions available include business-related vehicle mileage, shipping, advertising, website fees, percentage of home internet charges used for business, professional publications, dues, memberships, business-related travel, office supplies and any expenses incurred to run your business. If you pay for your own health, dental or long-term care insurance, those premiums may be deductible too.</p>\n\n<p>Claim a Home Office Deduction</p>\n\n<p>If you work for yourself or have a side business, don&#39;t be afraid to take the home office deduction.</p>\n\n<p>To qualify for the deduction, the space must be used regularly and exclusively for business purposes. For instance, if an extra bedroom is used exclusively as a home office and it constitutes one-fifth of your apartment&#39;s living space, you can deduct one-fifth of rent and utility fees.</p>\n\n<p>Write Off Business Travel Expenses, Even While on Vacation</p>\n\n<p>Combine a vacation with a business trip, and you could reduce vacation costs by deducting the percent of the expenses spent for business purposes. This could include airfare and part of your hotel bill, proportionate to the time spent on business activities. Talk to a tax professional about how to make this calculation correctly.</p>\n\n<p>Deduct Half of Your Self-Employment Taxes</p>\n\n<p>The government assesses a 15.3% Federal Insurance Contributions Act tax on all earnings to pay for the Social Security and Medicare programs.</p>\n\n<p>While employers split the cost with their workers, self-employed individuals are responsible for paying the entire amount themselves. To compensate for the extra expense, the government will let you deduct 50% of the amount paid from your income taxes. You don&#39;t even need to itemize to claim this tax deduction.</p>\n\n<p>Get a Credit for Higher Education</p>\n\n<p>The government offers valuable tax credits to offset the cost of higher education. The American opportunity tax credit can be claimed for the first four years of college and provides a maximum credit of $2,500 per student per year.</p>\n\n<p>Since it&#39;s a credit, that amount is deducted from whatever tax you might owe the government. If it exceeds the amount of taxes you owe, up to $1,000 may be refundable to you.</p>\n\n<p>Meanwhile, the lifetime learning credit is great for adults boosting their education and training. This credit is worth up to $2,000 per year and helps pay for college and educational expenses that improve your job skills.</p>\n\n<p>See if You Qualify for an Earned Income Tax Credit</p>\n\n<p>Even if you aren&#39;t required to pay federal income taxes, you could get a refund from the government. The earned income tax credit is a refundable tax credit of up to $6,660 for tax year 2020.</p>\n\n<p>The EITC is calculated with a formula that takes into consideration income and family size. The income limits for the credit range from $15,820 for single taxpayers with no children to $56,844 for married couples filing jointly who have three or more children.</p>\n\n<p>Itemize State Sales Tax</p>\n\n<p>Taxpayers who itemize their deductions can include either their state income tax or state sales tax on their Schedule A form. The state sales tax break is a great option if you live in a state without income taxes.</p>\n\n<p>The federal tax deduction for state and local taxes is capped at $10,000 from all sources.</p>\n\n<p>Deduct Private Mortgage Insurance Premiums</p>\n\n<p>If you have less than 20% equity in your home, chances are you pay private mortgage insurance. This coverage is required by lenders as a way to protect them in the event you stop making payments.</p>\n\n<p>Until 2017, taxpayers could deduct the cost of private mortgage insurance on their itemized deductions.</p>\n\n<p>While the Tax Cuts and Jobs Act eliminated the deduction, it was reinstated at the end of 2019 and is available for the 2020 tax year. It was made retroactive for 2018 as well. </p>\n\n<p>Make Charitable Donations</p>\n\n<p>Charitable contributions made with payroll deductions, checks, cash and donations of goods and clothing are all deductible. These deductions add up and are often overlooked.</p>\n\n<p>You generally need to itemize to claim a deduction, and since the 2017 tax reform nearly doubled the standard deduction, many people choose not to itemize. However, the Coronavirus Aid, Relief, and Economic Security Act, or CARES Act, allows taxpayers who don&#39;t itemize to deduct cash donations of up to $300 made before Dec. 31, 2020.</p>\n\n<p>Adjust Your Basis for Capital Gains Tax</p>\n\n<p>Investors: When calculating the cost basis after selling a financial asset, make sure to add in all of the reinvested dividends. That increases the cost basis and reduces your capital gain when you sell the investment.</p>\n\n<p>If you sell your house, you may end up paying capital gains tax as well, particularly if your property&#39;s value has risen significantly.</p>\n\n<p>Single taxpayers can exempt up to $250,000 of their home&#39;s appreciation from capital gains tax while married couples get a $500,000 exemption. The IRS only allows the exemption to be claimed once every two years.</p>\n\n<p>However, you can reduce how much you owe if you&#39;ve made home renovations or improvements.</p>\n\n<p>Avoid Capital Gains Tax by Donating Stock</p>\n\n<p>Another way to avoid capital gains is by using stocks to make charitable gifts.</p>\n\n<p>Money moved into a donor-advised fund is not only exempt from capital gains tax but can also be deducted by those who itemize. Donor-advised funds can be started with as little as $5,000.</p>\n\n<p>Share your tips on how you reduce your taxes.</p>\n</div><!-- SC_ON -->",
  "score": 180,
  "permalink": "/r/CryptoCurrency/comments/px4f1x/if_the_rich_are_not_paying_taxes_neither_should/",
  "subreddit": "CryptoCurrency",
  "id": "px4f1x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "See if You Qualify for an Earned Income Tax Credit\n\nEven if you aren't required to pay federal income taxes, you could get a refund\nfrom the government. The earned income tax credit is a refundable tax credit of\nup to $6,660 for tax year 2020.\n\nThe EITC is calculated with a formula that takes into…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "勤労所得税控除の資格があるかどうかの確認\n\n連邦所得税を支払う必要がない場合でも、政府から還付金を受け取ることができます。\n政府から還付金を受け取ることができます。勤労所得税控除は、2020年の課税年度に最大6,660ドルの還付を受けることができる税額控除です。\n還付される税額控除で、2020年の課税年度には最大で6,660ドルになります。\n\nEITCの計算方法は、以下のようになっています。",
      "title": "金持ちが税金を払っていないなら、あなたも払うべきではない。このように、暗号の利益で税金を減らすことができるのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "看看你是否有资格获得收入所得税抵免\n\n即使你不需要支付联邦所得税，你也可以得到政府的退款。\n从政府那里得到退款。劳动所得税抵免是一种可退还的税收抵免，在2020年的纳税年度，最高可达6,660美元。\n在2020年的税收年度，最高可达6,660美元。\n\nEITC的计算公式是考虑到...",
      "title": "如果富人不交税，你也不应该交。这就是你如何用你的加密货币利润减少你的税收。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "看看你是否有資格獲得收入所得稅抵免\n\n即使你不需要支付聯邦所得稅，你也可以得到政府的退款。\n從政府那裏得到退款。勞動所得稅抵免是一種可退還的稅收抵免，在2020年的納稅年度，最高可達6,660美元。\n在2020年的稅收年度，最高可達6,660美元。\n\nEITC的計算公式是考慮到...",
      "title": "如果富人不交稅，你也不應該交。這就是你如何用你的加密貨幣利潤減少你的稅收。"
    }
  ]
}