{
  "author": "Mattras7",
  "original_created_utc": 1642355876,
  "title": "Loopring has been steadily dumping with no bottom in sight and nobody is talking about it",
  "created_utc": 1642372517,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It seems pretty clear the exponential price action last year was all based on hype surrounding GME rumours, there was no actual substance to it therefore the price isn&amp;#39;t holding up. The market cap to TVL ratio is still high at 4.5 so I don&amp;#39;t see this downtrend ending anytime soon without any new catalysts. If you compare this to another hyped coin like CRO, which saw a meteoretic rise and who&amp;#39;s price has stabilized since then (especially if you look at the CRO/BTC pair), you can see that LRC is nowhere near a bottom. I could easily see Loopring dropping below $1 again, assuming no significant BTC movements happen.&lt;/p&gt;\n\n&lt;p&gt;And yet, all I see on this sub is more threads shilling the coin and doses of hopium about the long term potential? Nobody is seriously discussing price action over the last two months which is a huge concern to me. I&amp;#39;m not arguing that Loopring is a dead project, far from it, but the short term price prospects are very meagre. Everyone should decide what to do for themselves i.e. risk management, but I don&amp;#39;t see any value in bagholding it when there&amp;#39;s no end in sight for the downwards trend.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t get me wrong, I see huge potential in ZK roll ups and in particular LRC for the next five years eventhough I don&amp;#39;t own it myself. In fact, I&amp;#39;m looking for this downtrend to end so I can buy it when it eventually consolidates. Since Loopring is by far the most shilled coin on this sub , I feel bad for the ones that FOMO&amp;#39;d in after the price rise in early November. These people are seeing their gains evaporate like snow in the sun or are suffering big losses. Maybe an announcement by Gamestop at the end of this month or during the next earnings call will stop this downtrend, but I don&amp;#39;t see it stopping anytime soon before that.&lt;/p&gt;\n\n&lt;p&gt;EDIT: To anyone commenting that price doesn&amp;#39;t matter, well it does. Let me put it this way, if LRC is $1.35 and you feel like it will move below $1 in the short term: you should absolutely sell because you can increase your holdings for the long term with 35%&lt;/p&gt;\n\n&lt;p&gt;EDIT 2: Obviously DCA&amp;#39;ing is also an option when the price drops, I would wait until the price stabilizes though&lt;/p&gt;\n\n&lt;p&gt;EDIT 3: Since I received the suicide care message from Reddit and multiple threats in my inbox, I will no longer interact with this thread. What a shame that people can&amp;#39;t behave.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 484,
  "permalink": "/r/CryptoCurrency/comments/s5hd3q/loopring_has_been_steadily_dumping_with_no_bottom/",
  "subreddit": "CryptoCurrency",
  "id": "s5hd3q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It seems pretty clear the exponential price action last year was all based on\nhype surrounding GME rumours, there was no actual substance to it therefore the\nprice isn't holding up. The market cap to TVL ratio is still high at 4.5 so I\ndon't see this downtrend ending anytime soon without any new…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨年の指数関数的な値動きは、全ては、このような状況に基づいていたことは明らかである。\nGMEの噂にまつわる誇大広告で、実際には何もなかったからです。\n価格が保てない。時価総額対TVL比は4.5とまだ高いので、このままでは\nこの下降トレンドは、何か新しいことがない限り、すぐには終わらないだろう。",
      "title": "ループスプリングは底が見えないまま順調にダンピングしているのに誰も話題にしない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "似乎很清楚，去年的指数型价格走势都是基于\n围绕GME传言的炒作，没有实际内容，因此价格并不高。\n因此，价格并没有保持下去。市值与TVL的比率仍然很高，为4.5，所以我不认为这是个好消息。\n所以我不认为在没有任何新消息的情况下，这种下降趋势会很快结束。",
      "title": "Loopring一直在稳步下跌，看不到底部，没有人谈论它。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "似乎很清楚，去年的指數型價格走勢都是基於\n圍繞GME傳言的炒作，沒有實際內容，因此價格並不高。\n因此，價格並沒有保持下去。市值與TVL的比率仍然很高，爲4.5，所以我不認爲這是個好消息。\n所以我不認爲在沒有任何新消息的情況下，這種下降趨勢會很快結束。",
      "title": "Loopring一直在穩步下跌，看不到底部，沒有人談論它。"
    }
  ]
}