{
  "author": "SiliconeGiant",
  "original_created_utc": 1644492598,
  "title": "How come grown Christians can't see that they were simply indoctrinated as a small child, into one of many religions with almost the same story?",
  "created_utc": 1644499681,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Probably most religions I suppose but christians in particular seem to be uniquely unwilling to consider any alternative to their reality. I have extensive experience with this as my best friend through Jr high and high school was always trying to recruit me. Tricking me into going to christian sleepovers etc, I&amp;#39;ve seen a lot of it firsthand. &lt;/p&gt;\n\n&lt;p&gt;I mean many of these people are grown, intelligent people. Can&amp;#39;t they look at the dozens of other religions that have all the parallels between them, and recognize that this is one of many similar belief systems, and recognize why people create those stories to deal with our mortality. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s just amazing to me how powerful that early indoctrination is. What do you think thanks!&lt;/p&gt;\n\n&lt;p&gt;Edit: ok I should add: I am not an atheist, I am agnostic. I went to Unitarian church for about 8 years as a child, which was sort of a very light attempt at indoctrination. But mostly just coffee and a lot of togetherness. Then I got old enough to study different religions and saw the parallels.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 124,
  "permalink": "/r/TooAfraidToAsk/comments/sp4ijs/how_come_grown_christians_cant_see_that_they_were/",
  "subreddit": "TooAfraidToAsk",
  "id": "sp4ijs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Probably most religions I suppose but christians in particular seem to be\nuniquely unwilling to consider any alternative to their reality. I have\nextensive experience with this as my best friend through Jr high and high school\nwas always trying to recruit me. Tricking me into going to christian…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "おそらくほとんどの宗教がそうだと思いますが、特にキリスト教はそうだと思います。\n自分たちの現実に代わるものを考えようとしない。私は\n中学、高校と親友だったので、その経験は豊富です。\nいつも私を勧誘していました。私を騙してキリスト教に...",
      "title": "なぜ、成人したクリスチャンは、自分が小さい頃に、ほとんど同じストーリーを持つ多くの宗教の一つに洗脳されただけだとわからないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想可能是大多数宗教，但基督教徒似乎特别\n不愿意考虑他们现实的任何替代方案。我有\n我有丰富的经验，因为我最好的朋友在高中和初中时都是这样。\n总是试图招募我。诱使我去基督教学校。",
      "title": "为什么成年的基督徒看不到他们只是在很小的时候被灌输到许多故事几乎相同的宗教中的一个？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想可能是大多數宗教，但基督教徒似乎特別\n不願意考慮他們現實的任何替代方案。我有\n我有豐富的經驗，因爲我最好的朋友在高中和初中時都是這樣。\n總是試圖招募我。誘使我去基督教學校。",
      "title": "爲什麼成年的基督徒看不到他們只是在很小的時候被灌輸到許多故事幾乎相同的宗教中的一個？"
    }
  ]
}