{
  "author": "Gloomy_Vermicelli_62",
  "original_created_utc": 1631897224,
  "title": "I lose 100+ karma a day simply arguing with idiots. I know it sounds insane, but peep this in-depth, totally transcendental, technical analysis of the process...",
  "created_utc": 1631914476,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><ol>\n<li><p>Let me first say that, of course, I agree with the current sentiments floating in your head after reading such a preposterous heading... if “arguing with idiots” is one thing that we can agree on, it’s a really efficient way to expend important energy. However, in the next couple points, I want to try and make some meaning of it.</p></li>\n<li><p>The crypto space is filled with idiots. Any endeavor I ever began started as the literal folly of a fool. I had ideas, I had some support, but really, it was mistakes that channeled me towards success. Lots of fucking mistakes. Lots of losses. In truth, where there is more depth, there must be less span. Not everyone is Michael Saylor... haha but there are certainly LOTS of people who are going to represent the initial crypto trader, complete with all their tendency.</p></li>\n<li><p>We are the Shepards. Who will help the idiot in their journey? Are we to watch on while idiots support projects that are shit? It MUST be a “all for one and one for all” camaraderie that organized these blessed and sanctified halls of diamondry. We must start to realize that the public perception of any one crypto trader is the perception of all cryptocurrency traders. We must do our best to channel the young calf away from the forests edge, to starve out the wolves.</p></li>\n<li><p>Final thought - Id like you to consider desperately wasting most of your energy all day, arguing with idiots... so that we elevate the caliber of this divine profession. No longer can we afford to stand idly by, HODLing our well-audited projects and hoping that this new innovative space gets thorough it’s adolescence! We must see any shit coin supporter as a potentially ignorant person (some are just savage gamblers) and do our very best to aid in their ascension. </p></li>\n</ol>\n\n<p>Now, if you’re with me, SAYYYY AYYYYE!</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/pq3uq9/i_lose_100_karma_a_day_simply_arguing_with_idiots/",
  "subreddit": "CryptoCurrency",
  "id": "pq3uq9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": " 1. Let me first say that, of course, I agree with the current sentiments\n    floating in your head after reading such a preposterous heading... if\n    “arguing with idiots” is one thing that we can agree on, it’s a really\n    efficient way to expend important energy. However, in the next couple\n   …",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": " 1. 最初に言っておきますが、このような記事を読んで頭に浮かんだ現在の感情には、もちろん賛成です。\n    このようなとんでもない見出しを読んで、あなたの頭の中に浮かんだ現在の気持ちには、もちろん同意します...。\n    「バカと議論する」というのは、重要なエネルギーを費やす実に効率的な方法であることを\n    大切なエネルギーを効率的に使う方法だと思います。しかし、次のカップルでは\n   ...",
      "title": "私はバカと議論するだけで1日に100以上のカルマを失います。非常識に聞こえるかもしれませんが、このプロセスの詳細な、完全に超越した技術的な分析をご覧ください...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": " 1. 首先，我要说的是，我当然同意现在的情绪\n    读完这样一个荒谬的标题后，你脑子里浮现的情绪......如果\n    如果说 \"与白痴争论 \"是我们可以达成共识的一件事，那就是这是一种非常有效的消耗重要精力的方式。\n    如果说 \"与白痴争论 \"是我们可以达成共识的一件事，那么这确实是消耗重要精力的有效方式。然而，在接下来的几个\n   ...",
      "title": "我每天光是和白痴争论就会损失100多的业力。我知道这听起来很疯狂，但请看这个深入的、完全超验的、技术性的分析过程..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " 1. 首先，我要說的是，我當然同意現在的情緒\n    讀完這樣一個荒謬的標題後，你腦子裏浮現的情緒......如果\n    如果說 \"與白癡爭論 \"是我們可以達成共識的一件事，那就是這是一種非常有效的消耗重要精力的方式。\n    如果說 \"與白癡爭論 \"是我們可以達成共識的一件事，那麼這確實是消耗重要精力的有效方式。然而，在接下來的幾個\n   ...",
      "title": "我每天光是和白癡爭論就會損失100多的業力。我知道這聽起來很瘋狂，但請看這個深入的、完全超驗的、技術性的分析過程..."
    }
  ]
}