{
  "author": "SlappySpankBank",
  "original_created_utc": 1626789983,
  "title": "Don't be like me. Remember the importance of having an emergency fund and not over investing in crypto.",
  "created_utc": 1626816819,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m 27 years old and never had any health problems.   </p>\n\n<p>I got three stimulus checks from the US Gov and I spent it all on crypto. Then crypto jumped up and I took out just enough for Invisalign.  </p>\n\n<p>Fast forward a couple months, profits are all the way down on my crypto investment and, as fate would have it, I have appendicitis. I need to have an appendectomy now.   </p>\n\n<p>For all my fellow peeps outside the US, you really don&#39;t want to know how much this costs. I&#39;ll have to get a loan of some sort for this procedure. </p>\n\n<p>If I had kept a decent emergency fund instead of 100% crypto investing, I probably wouldn&#39;t be in a such a poor situation.   </p>\n\n<p>Don&#39;t get greedy like I did. </p>\n\n<p>No one needs an emergency fund, until they do. </p>\n\n<p>Stay safe out there people.</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/oo2ppi/dont_be_like_me_remember_the_importance_of_having/",
  "subreddit": "CryptoCurrency",
  "id": "oo2ppi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm 27 years old and never had any health problems.\n\nI got three stimulus checks from the US Gov and I spent it all on crypto. Then\ncrypto jumped up and I took out just enough for Invisalign.\n\nFast forward a couple months, profits are all the way down on my crypto\ninvestment and, as fate would have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は27歳で、健康上の問題は一度もありません。\n\n私はアメリカ政府から3回の景気刺激策を受けましたが、すべて暗号に使ってしまいました。その後\n暗号が急上昇したので、インビザラインのために十分な額を引き出しました。\n\n数ヶ月前、私の暗号投資では利益が大幅に減少しました。\n運命的なことに...",
      "title": "私のようにならないでください。緊急資金を持つことの重要性と、暗号への過剰投資をしないことを忘れないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今年27岁，从未有任何健康问题。\n\n我从美国政府那里得到了三张刺激性支票，我把它们都花在了加密货币上。然后\n我拿出的钱只够买隐适美牙膏。\n\n快进了几个月，我的加密货币的利润一路下滑。\n投资，而且，正如命运所安排的那样...",
      "title": "不要像我一样。记住拥有应急基金的重要性，不要过度投资于加密货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今年27歲，從未有任何健康問題。\n\n我從美國政府那裏得到了三張刺激性支票，我把它們都花在了加密貨幣上。然後\n我拿出的錢只夠買隱適美牙膏。\n\n快進了幾個月，我的加密貨幣的利潤一路下滑。\n投資，而且，正如命運所安排的那樣...",
      "title": "不要像我一樣。記住擁有應急基金的重要性，不要過度投資於加密貨幣。"
    }
  ]
}