{
  "author": "Set1Less",
  "original_created_utc": 1643306867,
  "title": "SEC repeatedly rejecting spot ETF while approving Futures is a blatant attempt to grab regulatory authority. The SEC is not acting in the interests of the people it is sworn to protect",
  "created_utc": 1643345134,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just now the SEC rejected the Fidelity spot ETF application, with the usual concerns about manipulation. &lt;/p&gt;\n\n&lt;p&gt;How can the spot ETF suffer from manipulation risk when the SEC themselves allowed the futures ETF which according to them doesnt suffer from manipulation? Both of them are the same market. &lt;/p&gt;\n\n&lt;p&gt;Lets say US retail and institutions, who the SEC wants to protect, have invested in BITO.. and over the weekend when BITO isn&amp;#39;t traded, someone unknown to the market borrows a ton of money and also dumps million BTC on Bitfinex and crashes the price. Manipulation.. probably? But it doesn&amp;#39;t make BITO free from manipulation, on Monday when it trades, BITO will just follow the spot price and dumps as well.&lt;/p&gt;\n\n&lt;p&gt;Even BITO would be manipulated.&lt;/p&gt;\n\n&lt;p&gt;So manipulation in spot - the SEC must protect, but manipulation in CME futures as a result of spot manipulation is fine? How does it even make sense?&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Manipulation&amp;quot; bs is just a big smokescreen to hide what the SEC really wants.. &lt;/p&gt;\n\n&lt;p&gt;The real reason is that the SEC wants to control and exert authority over spot exchanges. Thats what DADDY gensler wants, and this is all soft power play from a corrupt regulator acting in his own interest, not in the interest of the people. Spot exchanges unless they are trading securities are not under the purview of the SECURITIES exchange commission. Bitcoin is not a security, and does not fall under SEC&amp;quot;s purview under any stretch of mental gymnastics. Bitcoin futures have already been held as commodities. It literally makes zero sense that CFTC regulates Bitcoin futures, but SEC regulates spot. &lt;/p&gt;\n\n&lt;p&gt;Yet, the SEC is trying to arm twist both the people and Congress to give regulatory authority over spot exchanges to the SEC. &lt;/p&gt;\n\n&lt;p&gt;A regulator must act in the interests of the people, not in the interest of the office. A regulator cant make power play so that the regulator gets more authority from Congress.&lt;/p&gt;\n\n&lt;p&gt;Imagine if the last mile electricity supply company cut off power supply to the city because they dont have the authority to fix prices? Everyone would be up in arms.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 330,
  "permalink": "/r/Bitcoin/comments/se4lkw/sec_repeatedly_rejecting_spot_etf_while_approving/",
  "subreddit": "Bitcoin",
  "id": "se4lkw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Just now the SEC rejected the Fidelity spot ETF application, with the usual\nconcerns about manipulation.\n\nHow can the spot ETF suffer from manipulation risk when the SEC themselves\nallowed the futures ETF which according to them doesnt suffer from manipulation?\nBoth of them are the same…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、SECはフィデリティのスポットETFの申請を却下しました。\n操作に関する懸念がある。\n\nSEC自身は操作のリスクはないと言っているのに、どうしてスポットETFが操作のリスクに悩まされるのか。\n先物ETFは操作の心配がないというが？\nどちらも同じようなものだ...。",
      "title": "SECは、先物取引を認めながら、スポットETFを繰り返し拒否しているが、これは規制権限を奪おうとする露骨な試みである。SECは、保護することを誓った人々の利益のために行動していない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "刚才，美国证券交易委员会拒绝了富达现货ETF的申请，并提出了常见的\n对操纵行为的担忧。\n\n现货ETF怎么会有操纵风险呢？\n允许期货ETF，而据他们说，期货ETF并没有受到操纵？\n两者都是一样的...",
      "title": "证监会一再拒绝现货ETF而批准期货，是公然企图攫取监管权。美国证券交易委员会的行为不符合其宣誓保护的人民的利益。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "剛纔，美國證券交易委員會拒絕了富達現貨ETF的申請，並提出了常見的\n對操縱行爲的擔憂。\n\n現貨ETF怎麼會有操縱風險呢？\n允許期貨ETF，而據他們說，期貨ETF並沒有受到操縱？\n兩者都是一樣的...",
      "title": "證監會一再拒絕現貨ETF而批准期貨，是公然企圖攫取監管權。美國證券交易委員會的行爲不符合其宣誓保護的人民的利益。"
    }
  ]
}