{
  "author": "Amazing_Succotash677",
  "original_created_utc": 1637627191,
  "title": "This is a bull market",
  "created_utc": 1637642632,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Idk what the hell everyone has been putting in their cereal, but trying to claim &quot;we&#39;re not in a bull market&quot; is the silliest thing I&#39;ve ever heard. Because we saw a few dips, because ATH happened earlier this year? Seriously, that&#39;s not the definition of a bull market... The overall market has still increased even if bitcoin is a little lower. There can only be a bull or bear market, there is no in between. If it hits an ATH in a few weeks are we suddenly in a bull market again or...</p>\n\n<p>I&#39;m seeing this opinion way too much and it&#39;s just asinine. We are in a bull market, and it&#39;s pretty Damn simple. Lotta people trying to compete in mental gymnastics to say we&#39;re not in a bull market. Okay rant over.</p>\n\n<p>Edit This guy: <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/qzyid6/this_isnt_a_dip_this_isnt_a_bull_run_this_is_a/hlpjek5/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf&amp;context=3\">https://www.reddit.com/r/CryptoCurrency/comments/qzyid6/this_isnt_a_dip_this_isnt_a_bull_run_this_is_a/hlpjek5/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf&amp;context=3</a></p>\n</div><!-- SC_ON -->",
  "score": 176,
  "permalink": "/r/CryptoCurrency/comments/r009cv/this_is_a_bull_market/",
  "subreddit": "CryptoCurrency",
  "id": "r009cv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Idk what the hell everyone has been putting in their cereal, but trying to claim\n\"we're not in a bull market\" is the silliest thing I've ever heard. Because we\nsaw a few dips, because ATH happened earlier this year? Seriously, that's not\nthe definition of a bull market... The overall market has…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "みんながシリアルに何を入れているのかは知らないが、「強気相場ではない」と主張するのは\n\"今は強気の市場ではない \"と主張するのは、これまで聞いた中で最も愚かなことだ。なぜなら、我々は\nATHが今年の初めに起こったから？真面目な話、それは強気市場の定義ではありません。\n強気市場の定義ではありませんよね。市場全体では...",
      "title": "これはブルマーケットだ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道每个人都在他们的麦片里放了什么鬼东西，但试图要求\n\"我们不在牛市中 \"是我听过的最愚蠢的事情。因为我们\n就因为我们看到了一些下跌，因为今年早些时候发生了ATH？说真的，这不是\n牛市的定义...。整体市场已经...",
      "title": "这是个牛市"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道每個人都在他們的麥片裏放了什麼鬼東西，但試圖要求\n\"我們不在牛市中 \"是我聽過的最愚蠢的事情。因爲我們\n就因爲我們看到了一些下跌，因爲今年早些時候發生了ATH？說真的，這不是\n牛市的定義...。整體市場已經...",
      "title": "這是個牛市"
    }
  ]
}