{
  "author": "Pres_Cowboy",
  "original_created_utc": 1633236521,
  "title": "is it socially acceptable for me to dress up as ronald mcdonald and go to a mcdonalds and order a hamburger and act like nothing is strange and its just a regular order?",
  "created_utc": 1633254737,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I swear this isn’t a joke post, me and my friend are going to be hamburglar and ronald mcdonald for halloween. Our school won’t be open on halloween cause it’s on a sunday, but our principal is letting us dress up on the friday before it. Our plan is to walk to McDonalds afterschool that day and then order something. I think it’d be funny but I don’t want to make some minimum wage cashier die inside… Thoughts? I looked this up and got nothing, shocking I know.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/q0ay50/is_it_socially_acceptable_for_me_to_dress_up_as/",
  "subreddit": "NoStupidQuestions",
  "id": "q0ay50",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I swear this isn’t a joke post, me and my friend are going to be hamburglar and\nronald mcdonald for halloween. Our school won’t be open on halloween cause it’s\non a sunday, but our principal is letting us dress up on the friday before it.\nOur plan is to walk to McDonalds afterschool that day and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誓って、これは冗談の投稿ではありません。私と私の友人は、ハロウィンでハンバーガーとドナルド・マクドナルドになります。\nロナルド・マクドナルドになります。私たちの学校はハロウィンには営業していません、なぜなら日曜日だからです。\nしかし、校長先生は前日の金曜日に仮装することを許可してくれました。\n私たちの計画は、その日の放課後にマクドナルドまで歩いて行き、...",
      "title": "ロナルド・マクドナルドのコスプレをしてマクドナルドに行き、ハンバーガーを注文し、何事もなかったかのように振る舞い、普通に注文することは社会的に認められますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我发誓这不是一个玩笑帖子，我和我的朋友要做汉堡包和\n罗纳德-麦克唐纳的万圣节。我们的学校不会在万圣节开放，因为它是\n在星期日，但我们的校长让我们在万圣节前的星期五穿上衣服。\n我们的计划是那天放学后走到麦当劳，然后...",
      "title": "如果我打扮成罗纳德-麦当劳的样子，去麦当劳点一个汉堡包，并表现得像什么都不奇怪，只是一个普通的订单，这在社会上是否可以接受呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我發誓這不是一個玩笑帖子，我和我的朋友要做漢堡包和\n羅納德-麥克唐納的萬聖節。我們的學校不會在萬聖節開放，因爲它是\n在星期日，但我們的校長讓我們在萬聖節前的星期五穿上衣服。\n我們的計劃是那天放學後走到麥當勞，然後...",
      "title": "如果我打扮成羅納德-麥當勞的樣子，去麥當勞點一個漢堡包，並表現得像什麼都不奇怪，只是一個普通的訂單，這在社會上是否可以接受呢？"
    }
  ]
}