{
  "author": "sassysquatch11",
  "the_new_excerpt": "I started paper trading and thought that what I was doing was working (looking\nback at my trades makes me cringe now), so I decided to put $1000 in my account\nand try it for real. I was on a steady downtrend for the first 2 months (while\nthe general market is on a steady uptrend) and found my…",
  "original_created_utc": 1610645376,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我开始进行纸质交易，并认为我所做的工作是有效的（看\n回想我的交易，让我现在感到恶心），所以我决定把1000美元在我的账户中\n并尝试它的真实。前2个月，我一直处于稳定的下跌趋势中（而\n大盘呈稳步上升趋势），发现我的...",
      "title": "经过8个月的试错，在Youtube上看了几百个小时，赔了钱，差点放弃，我终于可以说我做了我的第一笔100美元的股票交易。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我開始進行紙質交易，並認爲我所做的工作是有效的（看\n回想我的交易，讓我現在感到噁心），所以我決定把1000美元在我的賬戶中\n並嘗試它的真實。前2個月，我一直處於穩定的下跌趨勢中（而\n大盤呈穩步上升趨勢），發現我的...",
      "title": "經過8個月的試錯，在Youtube上看了幾百個小時，賠了錢，差點放棄，我終於可以說我做了我的第一筆100美元的股票交易。"
    }
  ],
  "title": "After 8 months of trial and error, hundreds of hours of Youtube, losing money, almost giving up, I can finally say I made my first $100 trading stocks",
  "created_utc": 1610649395,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I started paper trading and thought that what I was doing was working (looking back at my trades makes me cringe now), so I decided to put $1000 in my account and try it for real.  I was on a steady downtrend for the first 2 months (while the general market is on a steady uptrend) and found my account balance to be below $850. I had to take a break at this point and had serious thoughts about giving up. I thought I wasn&#39;t cut out to be a trader; I must be a part of the 95% who fail.  I decided to give it one more shot. I took a deep analytical dive into my past trades. I reevaluated my strategy, and found what was working and what wasn&#39;t. I slowly started seeing results. I clawed my way back to the original $1000 investment and today have officially hit the $100 profit mark. </p>\n\n<p>&#x200B;</p>\n\n<p>If anyone is still reading this, I know what you&#39;re thinking: &quot;Wow, 100 bucks, big deal,&quot; and you&#39;re right. It&#39;s not much. However, If an average guy like myself can grow his account 10%, I strongly believe that anyone can; with enough dedication. I&#39;d be happy to talk more about my journey to anyone who&#39;s interested or just starting out.</p>\n</div><!-- SC_ON -->",
  "score": 6678,
  "permalink": "/r/stocks/comments/kxa9r4/after_8_months_of_trial_and_error_hundreds_of/",
  "subreddit": "stocks",
  "id": "kxa9r4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311217239
}