{
  "author": "ALooongWalk",
  "the_new_excerpt": "I've been an investor in Plug Power for over a year now and have obviously\nbenefitted greatly from the dramatic increase in price but I am riding this\ntrain all the way through 2021 and beyond.\n\nPLUG has had three major catalysts in the last month alone - a 1.5B partnership\nto expand the \"hydrogen…",
  "original_created_utc": 1611082506,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我成为Plug Power的投资人已经一年多了，很明显的是\n价格的大幅上涨，使我受益匪浅，但我正乘着这\n列车一直开到2021年及以后。\n\n仅在上个月，PLUG就有三大催化剂--15亿的合作项目\n以扩大 \"氢...",
      "title": "DD--绿色氢气和PLUG将为投资者的利润和所有人的可持续未来铺平道路。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我成爲Plug Power的投資人已經一年多了，很明顯的是\n價格的大幅上漲，使我受益匪淺，但我正乘着這\n列車一直開到2021年及以後。\n\n僅在上個月，PLUG就有三大催化劑--15億的合作項目\n以擴大 \"氫...",
      "title": "DD--綠色氫氣和PLUG將爲投資者的利潤和所有人的可持續未來鋪平道路。"
    }
  ],
  "title": "DD - Green Hydrogen and PLUG will pave the way to profits for investors and a sustainable future for all.",
  "created_utc": 1611107554,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been an investor in Plug Power for over a year now and have obviously benefitted greatly from the dramatic increase in price but I am riding this train all the way through 2021 and beyond.</p>\n\n<p>PLUG has had three major catalysts in the last month alone - a 1.5B partnership to expand the <strong>&quot;hydrogen economy&quot;</strong> into South Korea and other Asian Markets, a partnership with French automaker Renault to develop Fuel Cell powered vans &amp; provide the infrastructure to support that initiative, &amp; a newly announced Giga factory that is being built in Rochester, NY and will be operational mid-2021.</p>\n\n<p>All of these catalysts on top of a business meeting that is taking place at 10AM EST on 1/26 which I anticipate will announce a bump in their 2024 financial projections in addition to hyping up these announcements will only take this stock even further.</p>\n\n<p>AND let&#39;s not forget that soon to be president Joseph R. Biden Jr. is a believe in clean energy &amp; more specifically hydrogen. When he reveals his Build Back Better Plan in February you can darn well expect another bump in Plug Power. (Reminder Chuck Schumer, D-NY senator is close with Andy Marsh the CEO of Plug Power, is a believer in Hydrogen, and will make sure that Plug Power&#39;s mission gets pushed through legislation in any future clean energy plans)</p>\n\n<p>Here is Biden&#39;s stance on clean energy <a href=\"https://joebiden.com/clean-energy/\">https://joebiden.com/clean-energy/</a> . You can find Hydrogen mentioned 5 times in this webpage alone.</p>\n\n<p>Get it while its under $70. Once we get through these next two months - I can&#39;t see it going anywhere but up.</p>\n\n<p>Thank you.</p>\n\n<p>$PLUG</p>\n</div><!-- SC_ON -->",
  "score": 65,
  "permalink": "/r/stocks/comments/l0qg8p/dd_green_hydrogen_and_plug_will_pave_the_way_to/",
  "subreddit": "stocks",
  "id": "l0qg8p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311219652
}