{
  "author": "okletstrythisout3",
  "the_new_excerpt": "Yeah, I know that sounds confusing, but hear me out:\n\nThis is how I make extra money while I am at my job and invest that money into\ncoins that make money.\n\nI work a job that pretty much requires me to just be there. Every once in a\nwhile I have to deal with a customer, but for the most part I’m…",
  "original_created_utc": 1624130407,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "分かりにくいかもしれませんが、最後まで聞いてください。\n\nこれは、私が仕事をしている間に余分なお金を稼ぎ、そのお金を投資する方法です。\n儲かるコインに投資しているのです。\n\n私はただそこにいるだけでいい仕事をしています。たまには\nお客さんの対応をしなければならないこともありますが、ほとんどの場合、私は...",
      "title": "私はどうやってお金を稼ぎながらお金を稼ぐのか...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，我知道这听起来令人困惑，但请听我说完。\n\n这就是我如何在工作中赚取额外的钱，并将这些钱投资到\n赚钱的硬币。\n\n我的工作几乎要求我只在那里工作。每隔一段时间\n偶尔我也要和客户打交道，但大部分时间我都是...",
      "title": "我如何在赚钱的同时赚到钱..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，我知道這聽起來令人困惑，但請聽我說完。\n\n這就是我如何在工作中賺取額外的錢，並將這些錢投資到\n賺錢的硬幣。\n\n我的工作幾乎要求我只在那裏工作。每隔一段時間\n偶爾我也要和客戶打交道，但大部分時間我都是...",
      "title": "我如何在賺錢的同時賺到錢..."
    }
  ],
  "title": "How I make money that makes money while I’m making money…",
  "created_utc": 1624155886,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yeah, I know that sounds confusing, but hear me out:</p>\n\n<p>This is how I make extra money while I am at my job and invest that money into coins that make money.</p>\n\n<p>I work a job that pretty much requires me to just be there. Every once in a while I have to deal with a customer, but for the most part I’m just there on my phone making sure that people don’t steal and help customers out when I can.</p>\n\n<p>While I’m at work I usually participate in online surveys THAT PAY (prolific, Mturk, etc.). They don’t pay much, but I can usually earn around $10-15 per hour depending on the survey. I try to do at least 30 min to an hour a day.</p>\n\n<p>This can usually get me from $35-55 per week.</p>\n\n<p>I put all of that money into coins that earn interest… mostly staked ETH and ALGO, and sometimes I’ll put them in stable coins on Celcius.</p>\n\n<p>I’m sharing this because I believe it’s an easy way for literally ANYONE to earn a little money and store it in places that can earn you money over time.</p>\n\n<p>It may not seem like a ton of money, but imagine how much you can make if you consistently do something like this for a year or two. </p>\n\n<p>Remember: It’s a marathon, not a sprint. </p>\n\n<p>Anyhow, I know I’m gonna get some criticism (which is honestly great!) but I would love to hear other folks ways that they make a little extra money and where they put it. </p>\n\n<p>Looking forward to the comments!</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/o3npqp/how_i_make_money_that_makes_money_while_im_making/",
  "subreddit": "CryptoCurrency",
  "id": "o3npqp",
  "is_self": true,
  "media": null,
  "is_video": false
}