{
  "author": "ShotBot",
  "the_new_excerpt": "If Reddit Incorporated™ wanted to create a new way of allowing empowering users\nto govern the rules of subreddits, they would have created this system within\nthe parameters of reddit.com [https://reddit.com/] like they have with every\nother aspect of this website. An erc20 shitcoin wasn't…",
  "original_created_utc": 1611240318,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "如果Reddit Incorporated™想创造一种新的方式，让用户获得权力。\n来管理子reddits的规则，他们会在子reddits内创建这个系统。\nreddit.com[https://reddit.com/]的参数，就像他们对每一个\n这个网站的其他方面。erc20狗屎币不是... ...",
      "title": "月球完全是个骗局。改变我的想法。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果Reddit Incorporated™想創造一種新的方式，讓用戶獲得權力。\n來管理子reddits的規則，他們會在子reddits內創建這個系統。\nreddit.com[https://reddit.com/]的參數，就像他們對每一個\n這個網站的其他方面。erc20狗屎幣不是... ...",
      "title": "月球完全是個騙局。改變我的想法。"
    }
  ],
  "title": "Moons are a complete scam. Change my mind.",
  "created_utc": 1611254100,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If Reddit Incorporated<strong>™</strong> wanted to create a new way of allowing empowering users to govern the rules of subreddits, they would have created this system within the parameters of <a href=\"https://reddit.com/\">reddit.com</a> like they have with every other aspect of this website. An erc20 shitcoin wasn&#39;t necessary.</p>\n\n<p>Paying people to have social interactions creates a toxic environment. The social interactions become less natural and more forced, people are disincentivized of sharing opinions that goes against the grain, and overall a less engaging discussion. Even at food giveaways, you see people abuse the system by getting back in line thinking no one noticed to get more free stuff. </p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/\">r/CryptoCurrency</a> admins knew that they would be sacrificing the quality of the community, they just wanted to create a coin that could generate network effect and therefore real world value, to enrich themselves by printing themselves disproportionate supply. They name it &quot;Moon&quot; coin, but contradictory claim it&#39;s not meant to appreciate in value. That&#39;s just legal jargon so they don&#39;t get raided by the feds. It&#39;s just the same old scam ICO shit with a twist. </p>\n\n<p>&#x200B;</p>\n\n<p>Most of us are here to discuss crypto with strangers on the net, not to yield farm some erc20 shitcoins issued by reddit admins. This community is better without it.</p>\n</div><!-- SC_ON -->",
  "score": 1331,
  "permalink": "/r/CryptoCurrency/comments/l1zrv0/moons_are_a_complete_scam_change_my_mind/",
  "subreddit": "CryptoCurrency",
  "id": "l1zrv0",
  "is_self": true,
  "media": null,
  "is_video": false
}