{
  "author": "jcanotorr",
  "original_created_utc": 1637932058,
  "title": "My investing strategy is to DCA and HODL, not because I'm going to the moon, but because I'm too dumb and lazy for anything else",
  "created_utc": 1637962238,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As of today, I have officially been into crypto for one year, but I still feel like a noob. Normally, I&#39;d say I&#39;m decently smart or at least average, but when it comes to investing I&#39;m just plain dumb and I have a lot to learn.</p>\n\n<p>God knows I&#39;ve tried. Day trading trying to predict the prices never worked and I would spend 90% of the time glued to my phone after I sold to keep checking the price and beat myself up over missed opportunities (you know, because price go down when buy, up when sell). </p>\n\n<p>Recently, I figured I&#39;ll follow this sub&#39;s most popular advice and just DCA. Buying periodically in small amounts and HODL is less stressful and I&#39;m not glued to the charts like before. Granted, I still haven&#39;t figured out how to time the DCA out, but I&#39;m still feeling way better about my future.</p>\n</div><!-- SC_ON -->",
  "score": 176,
  "permalink": "/r/CryptoCurrency/comments/r2n1mf/my_investing_strategy_is_to_dca_and_hodl_not/",
  "subreddit": "CryptoCurrency",
  "id": "r2n1mf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As of today, I have officially been into crypto for one year, but I still feel\nlike a noob. Normally, I'd say I'm decently smart or at least average, but when\nit comes to investing I'm just plain dumb and I have a lot to learn.\n\nGod knows I've tried. Day trading trying to predict the prices never…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日の時点で、私は正式に暗号化に参加して1年になりますが、私はまだ感じています。\n初心者のようです。普段はそこそこ頭がいいというか、平均的だと思うのですが、投資に関しては\n投資に関してはただのバカで、まだまだ学ぶことがたくさんあります。\n\n努力はしてきました。価格を予測しようとするデイトレードは決して...",
      "title": "私の投資戦略は、DCAとHODLです。月に行くからではなく、他のことができないほど馬鹿で怠惰だからです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "到今天为止，我已经正式进入加密货币领域一年了，但我仍然感觉\n像个新手。通常情况下，我会说我很聪明，或者至少是平均水平，但当涉及到投资时，我就是一个普通的傻瓜，我有很多东西需要学习。\n在投资方面，我只是个普通的傻瓜，我有很多东西要学。\n\n上帝知道我已经试过了。试图预测价格的日间交易从未...",
      "title": "我的投资策略是DCA和HODL，不是因为我要去月球，而是因为我太笨了，懒得做其他事情。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "到今天爲止，我已經正式進入加密貨幣領域一年了，但我仍然感覺\n像個新手。通常情況下，我會說我很聰明，或者至少是平均水平，但當涉及到投資時，我就是一個普通的傻瓜，我有很多東西需要學習。\n在投資方面，我只是個普通的傻瓜，我有很多東西要學。\n\n上帝知道我已經試過了。試圖預測價格的日間交易從未...",
      "title": "我的投資策略是DCA和HODL，不是因爲我要去月球，而是因爲我太笨了，懶得做其他事情。"
    }
  ]
}