{
  "author": "galacticwyandotte",
  "original_created_utc": 1630854261,
  "title": "We’re now at the Floor Market Cap (2T) of the Next Bull Cycle: We’re Heading to 10T Market Cap This Bull Cycle",
  "created_utc": 1630863036,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Where are we in the current bull market? Not even close to the Peak. 200-300k btc and 20k ETH coming, so hang onto your hats.</p>\n\n<p>There’s a super interesting and useful article that was posted yesterday. I’ve been here about 7 years now, definitely haven’t made any real gains during that time, but just bided my time and paid attention to long term patterns. I got scammed and lost 20k back in 2015. Basically my entire life savings. Had to start over and dig out of a massive hole. I didn’t give up. I persisted and came back from my lowest point ever in life. Now I’m here and 2021 is the time to get rich! For all of us, friends.</p>\n\n<p>I especially pay attention to Charlie Lee, who sold all his Litecoin at $350. He basically called the last market top to a T. He says we have a LONG way to go in this current bull run. </p>\n\n<p>Usually, we see 15x-16x gains from peak to market peak. We’ve only hit 3x so far in this market cycle. That means we could be looking at 300k Bitcoin in the not too distant future. And 21k ETH.</p>\n\n<p>If we all follow this, we are going to make some serious coin. No matter when you bought, no matter how much or how little you have, if you wait and sell during the euphoria (blow off top) when there’s a 2x price increase in a 24 hour span, you are destined for massive gains. Then, buy back in a few months later when the market is crashing 80% all the way back to 2T (current levels).</p>\n\n<p>The article is on cointelegraph and it’s called “How to prepare for the end of the bull run, Part 1: Timing” I’m posting the actual link in the comments below so it doesn’t get deleted. </p>\n\n<p>Curious to hear your thoughts, and this article has me feeling so damn bullish. Good luck friends, may the riches ever be in your favor.</p>\n</div><!-- SC_ON -->",
  "score": 284,
  "permalink": "/r/CryptoCurrency/comments/piep4p/were_now_at_the_floor_market_cap_2t_of_the_next/",
  "subreddit": "CryptoCurrency",
  "id": "piep4p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Where are we in the current bull market? Not even close to the Peak. 200-300k\nbtc and 20k ETH coming, so hang onto your hats.\n\nThere’s a super interesting and useful article that was posted yesterday. I’ve\nbeen here about 7 years now, definitely haven’t made any real gains during that\ntime, but just…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在のブル・マーケットの状況は？ピークには程遠い。200-300k\nbtcと20k ETHが来るので、帽子にしがみついていてください。\n\n昨日投稿された超面白くて役に立つ記事があります。私は以前\n私はここに来て約7年になりますが、その間、実際には何の利益も得ていません。\nけど、ただ...。",
      "title": "次のブルサイクルのフロア・マーケットキャップ（2T）に入った。今回のブルサイクルでは、時価総額10Tに向かっている"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们在当前的牛市中处于什么位置？还没有达到峰值。200-300k\nbtc和20k ETH即将到来，所以请抓紧你的帽子。\n\n昨天有一篇超级有趣和有用的文章被发布。我已经\n我在这里已经7年了，在此期间肯定没有取得任何真正的收益。\n但只是...",
      "title": "我们现在处于下一个牛市周期的最低市值（2T）。本轮牛市周期我们正向10T市值迈进"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們在當前的牛市中處於什麼位置？還沒有達到峯值。200-300k\nbtc和20k ETH即將到來，所以請抓緊你的帽子。\n\n昨天有一篇超級有趣和有用的文章被髮布。我已經\n我在這裏已經7年了，在此期間肯定沒有取得任何真正的收益。\n但只是...",
      "title": "我們現在處於下一個牛市週期的最低市值（2T）。本輪牛市週期我們正向10T市值邁進"
    }
  ]
}