{
  "author": "anonymBird",
  "original_created_utc": 1641393151,
  "title": "Should I have sex with my friend ?",
  "created_utc": 1641409065,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Backstory: This girl and me, we are friends now for at least 15 years, probably longer. We met each other in an online chat game for kids. And since then, we kept staying in contact, it definetly got less year after year, but still. In all this time we never met each other irl tough. &lt;/p&gt;\n\n&lt;p&gt;Maybe it&amp;#39;s important to mention here we always had this sexual tension between us.&lt;/p&gt;\n\n&lt;p&gt;Three years ago I unknowingly moved very close to her, and we were so excited after figuring that out,, so we met of course. I tell you the sexual tension just grew stronger.&lt;/p&gt;\n\n&lt;p&gt;We always used to flirt (that&amp;#39;s probably my fault since I love to flirt, even without further intentions) but in the last three years it turned pretty serious, there is no coding anymore, at least from her side. It&amp;#39;s official, i just need to do the last step.&lt;/p&gt;\n\n&lt;p&gt;My problem is, the friendship to every girl I slept with is destroyed. Not right afterwards, but over time. I feel like it&amp;#39;s guaranteed that if I do this step, this story of our teenage online friendship which lived on until adulthood and carried over &lt;em&gt;irl&lt;/em&gt; will end. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want it to end, but I also want to pick the flower.&lt;/p&gt;\n\n&lt;p&gt;Any opinions and experiences?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/rwo9hh/should_i_have_sex_with_my_friend/",
  "subreddit": "TooAfraidToAsk",
  "id": "rwo9hh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Backstory: This girl and me, we are friends now for at least 15 years, probably\nlonger. We met each other in an online chat game for kids. And since then, we\nkept staying in contact, it definetly got less year after year, but still. In\nall this time we never met each other irl tough.\n\nMaybe it's…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "バックストーリー この少女と私は、少なくとも15年来の友人である。\nもっと長い。私たちは、子供向けのオンラインチャットゲームで出会いました。それ以来、私たちは\n年々少なくなってはいるが、それでも連絡を取り合っている。それでも\nこの間、私たちは一度もリアルに会ったことがありません。\n\nたぶん...",
      "title": "友達とセックスしたほうがいい？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "背景故事。这个女孩和我，我们现在是至少15年的朋友，可能更久。\n更久。我们是在一个儿童在线聊天游戏中认识对方的。从那时起，我们\n一直保持着联系，肯定是一年比一年少，但仍然如此。在\n在这些时间里，我们从来没有在现实中遇到过对方。\n\n也许这是...",
      "title": "我应该和我的朋友发生关系吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "背景故事。這個女孩和我，我們現在是至少15年的朋友，可能更久。\n更久。我們是在一個兒童在線聊天遊戲中認識對方的。從那時起，我們\n一直保持着聯繫，肯定是一年比一年少，但仍然如此。在\n在這些時間裏，我們從來沒有在現實中遇到過對方。\n\n也許這是...",
      "title": "我應該和我的朋友發生關係嗎？"
    }
  ]
}