{
  "author": "BuffettsBrokeBro",
  "the_new_excerpt": "I got into crypto for the potential profits on offer. I’m not talking\nnecessarily life changing money, but more consistently market beating returns.\nAnd I’ve not been in long enough or accrued enough of a stack to have made any\nprofit of any real note.\n\nAlthough I came for the profits, I’ve…",
  "original_created_utc": 1619280313,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が暗号化を始めたのは、潜在的な利益を得るためです。人生を変えるような大金とまでは言いませんが\n必ずしも人生を変えるようなお金ではありませんが、より一貫して市場を打ち負かすようなリターンです。\nそして、私は実際に利益を上げるのに十分な時間をかけていませんし、十分な量を積み上げてもいません。\n実際に利益を上げたことはありません。\n\n私は利益を得るために来ましたが、私は...",
      "title": "利益よりも蓄積を重視すると、かなり開放的になる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我进入加密货币是为了获得潜在的利润。我并不是说\n必然改变生活的钱，但更多的是持续击败市场的回报。\n而我进入的时间还不够长，也没有积累到足够的堆积物来赚取任何真正的\n任何真正意义上的利润。\n\n虽然我是为了利润而来，但我已经...",
      "title": "当你专注于积累而不是利润时，这是相当自由的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我進入加密貨幣是爲了獲得潛在的利潤。我並不是說\n必然改變生活的錢，但更多的是持續擊敗市場的回報。\n而我進入的時間還不夠長，也沒有積累到足夠的堆積物來賺取任何真正的\n任何真正意義上的利潤。\n\n雖然我是爲了利潤而來，但我已經...",
      "title": "當你專注於積累而不是利潤時，這是相當自由的。"
    }
  ],
  "title": "It’s pretty liberating when you focus on accumulation rather than profit",
  "created_utc": 1619290394,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I got into crypto for the potential profits on offer. I’m not talking necessarily life changing money, but more consistently market beating returns. And I’ve not been in long enough or accrued enough of a stack to have made any profit of any real note.</p>\n\n<p>Although I came for the profits, I’ve definitely stayed for the tech. In particular, DeFi use cases and potential future adoption are something I’m both very interested in, and bullish on.</p>\n\n<p>One thing that’s mentioned a lot on here is DCAing to just sit back and slowly accumulate, missing out on the ups and downs on the market. And that’s a great option. It’s definitely low stress. </p>\n\n<p>I’ve found it most helpful to view my crypto holdings in terms of accumulation. Building my stacks. Rather than in profit. Obviously, as someone interested in making money, I’d love for those stacks to be worth many times what they are today. With enough time and patience, they hopefully will be.</p>\n\n<p>Instead of focusing on how much your portfolio is <em>worth</em>, thinking in terms of how much you’ve accumulated can really help when we see dips / corrections / the bear market. Rather than your portfolio being worth X yesterday, and now Y percent less today; these are good opportunities to add to your stacks.</p>\n\n<p>The more hopeless it may seem, the lower the market and your coins sink, the better the buying opportunity in most cases (read: not with shitcoins and scam coins).</p>\n\n<p>Key to all this is putting in what you can afford to lose, and what you don’t need access to anytime soon. However much of a “sure thing” you think something is, stick to this mantra. I also like trying to make the most of my stacks with the money I’m putting in - by focusing on buying on dips that take my cost-per-coin lower than it previously is. I enjoy the element of competing against myself to get more of a coin for the same amount. It definitely helps me with focusing on accumulation, and taking the little victories along the way.</p>\n</div><!-- SC_ON -->",
  "score": 773,
  "permalink": "/r/CryptoCurrency/comments/mxmwsq/its_pretty_liberating_when_you_focus_on/",
  "subreddit": "CryptoCurrency",
  "id": "mxmwsq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776208819
}