{
  "author": "TrueSpins",
  "original_created_utc": 1635514757,
  "title": "Out of interest, does anyone here still actually believe in legitimate use cases for crypto, or are you all just out of control gamblers throwing money at anything in the hope it will pump?",
  "created_utc": 1635528656,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I mean, what people want to do with their money is their choice, so you can waste it on anything you fancy. Crypto is all about freedom after all.</p>\n\n<p>But this was originally a crypto sub and we used to talk about legitimate use cases and how crypto could change the world for the better.</p>\n\n<p>I could be wrong, but I get the sense that the majority of people here nowadays don&#39;t really care about crypto as an ecosystem. It&#39;s simply a mechanism for some sort of moonshot...</p>\n\n<p>The &#39;in it for the tech&#39; vs. &#39;in it for the money&#39; debate is as old as crypto itself. But in the past I&#39;d say the groups had a natural crossover, or the latter at least was looking at long-term profits. Now I sense that most here aren&#39;t really interested in the tech at all, nor have any faith or belief in crypto&#39;s long-term future. </p>\n\n<p>No moral judgement here. But would you say you&#39;re actually a crypto believer, or just in it for the short term returns?</p>\n</div><!-- SC_ON -->",
  "score": 308,
  "permalink": "/r/CryptoCurrency/comments/qid1dr/out_of_interest_does_anyone_here_still_actually/",
  "subreddit": "CryptoCurrency",
  "id": "qid1dr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I mean, what people want to do with their money is their choice, so you can\nwaste it on anything you fancy. Crypto is all about freedom after all.\n\nBut this was originally a crypto sub and we used to talk about legitimate use\ncases and how crypto could change the world for the better.\n\nI could be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "お金を何に使おうと人の勝手だから、好きなことに浪費すればいい。\n好きなことに浪費すればいい。暗号は結局、自由のためのものですから。\n\nでも、ここはもともと暗号のサブサイトで、合法的な使用例や、暗号が世界をより良く変える方法について話していました。\n合法的な使用例や暗号が世界をどう変えるかなどを話していました。\n\n私は...",
      "title": "興味があるのですが、ここにはまだ暗号の正当な使用例を信じている人がいるのでしょうか、それとも、制御不能のギャンブラーたちがポンプに期待して何かにお金を投じているだけなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的意思是，人们想用他们的钱做什么是他们的选择，所以你可以\n浪费在你喜欢的任何地方。毕竟，加密货币是关于自由的。\n\n但是，这原本是一个加密货币子，我们曾经谈论过合法的使用案例，以及加密货币如何改变世界。\n案，以及加密货币如何改变世界，使之更美好。\n\n我可能是...",
      "title": "出于兴趣，这里是否有人仍然真正相信加密货币的合法使用案例，或者你们都是失控的赌徒，把钱扔在任何东西上，希望它能抽水？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的意思是，人們想用他們的錢做什麼是他們的選擇，所以你可以\n浪費在你喜歡的任何地方。畢竟，加密貨幣是關於自由的。\n\n但是，這原本是一個加密貨幣子，我們曾經談論過合法的使用案例，以及加密貨幣如何改變世界。\n案，以及加密貨幣如何改變世界，使之更美好。\n\n我可能是...",
      "title": "出於興趣，這裏是否有人仍然真正相信加密貨幣的合法使用案例，或者你們都是失控的賭徒，把錢扔在任何東西上，希望它能抽水？"
    }
  ]
}