{
  "author": "Godfreee",
  "the_new_excerpt": "Lesson 1: Stop thinking it’s too late. We haven’t even seen the tip of the\niceberg. Even in 2013, people would say \"Those that bought in 2012 were so\nlucky, we are too late. We'll just get the scraps.\" Same for 2017. You wish you\nbought when it was cheap, but would you? Probably not. Why didn’t you…",
  "original_created_utc": 1618832460,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "レッスン1：「もう遅い」と思うのはやめよう 私たちはまだ氷山の一角も見ていません。\n氷山の一角も見ていません。2013年になっても、人々は「2012年に買った人はとてもラッキーだった。\n我々は遅すぎた。我々はスクラップを手に入れるだけだ」と言っていました。2017年も同じです。安いときに買っておけばよかったと思っても\n買っておけばよかったと思うでしょうが、そうしますか？おそらくしないでしょう。なぜそうしなかったのか・・・。",
      "title": "2013年からここにいる人が教えるビットコインの10の教訓"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "第一课：不要再想太晚了。我们甚至还没有看到这个世界的一角。\n冰山。即使到了2013年，人们也会说：\"2012年买入的人是如此的\n幸运的是，我们已经太晚了。我们就会得到残羹冷炙。\" 2017年也一样。你希望你\n便宜的时候买的，但你会吗？大概不会吧 你为什么不...",
      "title": "一个从2013年就在这里的人的十堂比特币课。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "第一課：不要再想太晚了。我們甚至還沒有看到這個世界的一角。\n冰山。即使到了2013年，人們也會說：\"2012年買入的人是如此的\n幸運的是，我們已經太晚了。我們就會得到殘羹冷炙。\" 2017年也一樣。你希望你\n便宜的時候買的，但你會嗎？大概不會吧 你爲什麼不...",
      "title": "一個從2013年就在這裏的人的十堂比特幣課。"
    }
  ],
  "title": "Ten Bitcoin lessons from someone who's been around here since 2013",
  "created_utc": 1618839424,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Lesson 1:</strong> Stop thinking it’s too late. We haven’t even seen the tip of the iceberg. Even in 2013, people would say &quot;Those that bought in 2012 were so lucky, we are too late.  We&#39;ll just get the scraps.&quot; Same for 2017. You wish you bought when it was cheap, but would you? Probably not. Why didn’t you buy more when it dropped to $4K last year? Would you have held if your money triple or quadrupled?</p>\n\n<p>Everyone has been telling me it is too late since 2013. 99% of my friend didn&#39;t buy at $200, or $2000, or $20,000 per BTC because it was &quot;too late&quot;. Don&#39;t make the same mistake. It&#39;s not too late, Bitcoin isn&#39;t even a teenager yet, it&#39;s only 12 years old.</p>\n\n<p><strong>Lesson 2:</strong> Stop thinking about the 50 BTC you lost on satoshi dice (yeah, coins were cheap back then), or the 5 BTC for that bag of herb that you smoked (or that acid you took). It’s gone. Stop thinking you should have sold at $20K and bought back in at $3K instead of hodling all the way down and capitulating “to buy at $1.8K”. Stop thinking you can time the dips, and sell the tops. Stop regretting not buying earlier.</p>\n\n<p>In short, stop fantasizing about what you could have done in the past and start thinking about today and the future. This is the mindset you should have:</p>\n\n<p><em>“What should I do today, so that tomorrow, I won’t regret yesterday?”</em></p>\n\n<p>&quot;Buy Bitcoin&quot; is the right answer, by the way.</p>\n\n<p><strong>Lesson 3:</strong> Building things will require a lot of sacrifice. I would have way more BTC if I didn&#39;t start a Bitcoin startup in the Philippines back in 2014. 7 years in this industry feels like 70! I grew many white hairs in the last 7 years. I know many people who have the same experience -- those who would be wealthier and more relaxed today had they just bought Bitcoin and Hodled instead of building stuff. But at the end of the day, you can still accumulate AND build. Again, it is not too late, even at this stage. Stack sats while building stuff! And always remember that the backbone of this industry are the tens of thousands of people out there, building stuff to make Bitcoin WORK, to make Bitcoin accessible. This isn&#39;t some vaporware with no backing - it is backed by human ingenuity and the blood, sweat, and tears of all the startups and companies out there making sure this thing survives and thrives.</p>\n\n<p><strong>Lesson 4:</strong> Bitcoin will keep surprising us. Don’t believe people who tell you they know what will happen. When you think it is time to sell because you’ll be able to buy cheaper later, it will break out and up. When you think we will “never see X price again” we&#39;ll see it again. When people say this is is, this is the peak, it won&#39;t be the peak. Be prepared for faces to melt and minds to crumble into madness from disbelief at what Bitcoin will achieve. </p>\n\n<p><em>There is not army in the world that can stop an idea whose time has come.</em></p>\n\n<p><strong>Lesson 5:</strong> Bitcoin is a remarkable phenomenon, a once in a generation opportunity to participate in the evolution of how we move value around the world. Anyone that tells you otherwise is either ignorant or trying to deceive you. This network has gone through the most crucial tests of pressure and time that make it anti-fragile. Pressure and time, that’s really all it takes. Everything else will be built around this bedrock foundation.</p>\n\n<p><strong>Lesson 6:</strong> Mass adoption is a myth. Bitcoin doesn’t need &quot;mass adoption&quot;. More like, mass adoption needs Bitcoin. It only needs a small % of the world’s wealth to “get there”. Bitcoin makes no promises other than to reliably and consistently create new publicly verifiable blocks of immutable transactions every ten minutes. This is all it needs to keep doing consistently and securely for its value to increase exponentially over time. Everything else is gravy.</p>\n\n<p><strong>Lesson 7:</strong> We still have at least another decade of this crazy rollercoaster ride before Bitcoin starts to get even slightly boring. Just strap in and enjoy it.</p>\n\n<p><strong>Lesson 8:</strong> Make some friends along the way. Make enemies if need be. I’ve made lifelong connections and relationships in the last 8 years in this industry. I have had a dedicated Buttcoiner hate group that created fake accounts similar to my name to try and embarrass me. Fake accounts, phishing, hacks, personal attacks. I don&#39;t give a fuck. And like I keep saying, we’ve only just begun.</p>\n\n<p>A lot of the people you meet today will be playing huge roles in this industry in the near future. You’ll be in good company when the time comes. At the end of the day, life is all about the relationships you make along the way. Make sure they&#39;re meaningful ones.</p>\n\n<p>Most of the friends I made since 2013 who have stuck around are already wealthy beyond their wildest dreams, and they&#39;re still sticking around, giving back, helping others, helping their communities, doing awesome shit.</p>\n\n<p><strong>Lesson 9:</strong> Do watch out for snakes and wolves disguised as people. Been scammed, lied to, stolen from, used, abused, harassed, you name it. There are a lot of bad actors out there, hiding behind smiling faces. They want what&#39;s yours and will go through great lengths to get it. Don&#39;t let anyone tell you different. These people will stab you in the back, slit your throat, take everything, and leave you out in the alley talking to yourself about what the fuck just happened. If you don&#39;t believe me, then you&#39;re the lamb that&#39;s going off to the slaughter.</p>\n\n<p><strong>Lesson 10:</strong> Take it easy. It’s easy to get caught up in all the hype, to want all that attention. It’s easy to get lost in the confidence of a bull market and the despair of a bear market. Step back and try to gain the peace of a lofty perspective. </p>\n\n<p>When you’ve been in the Bitcoin game for a while, you gain a certain peace. A relaxed comfort. Eyes open, ears open, radar up. Absorbing every message. Taking everything as it comes. Not mixing what they really are with what you want them to be. It&#39;s like an aerial view.</p>\n\n<p>A view from above the myriad luck-dependent reactions of those who never gain such a peace. And when you gain that view, that peace - when you&#39;d rather have the truth, no matter how disappointing, over a false hope, no matter how desirable - then you will finally understand the true meaning of hodling Bitcoin.</p>\n\n<p>See you guys in another 8 years.</p>\n\n<hr/>\n\n<p>Edit: <em>Wrote this two years ago, edited it a bit to reflect certain recent developments. Back then, Bitcoin price had just broken out of the deep recesses of the 2018 bear market and rose from about $3500 to $10000 in a couple of months. Thought it was worth a re-share today.</em></p>\n</div><!-- SC_ON -->",
  "score": 5570,
  "permalink": "/r/Bitcoin/comments/mtyqyw/ten_bitcoin_lessons_from_someone_whos_been_around/",
  "subreddit": "Bitcoin",
  "id": "mtyqyw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171516353
}