{
  "author": "pichonn15",
  "the_new_excerpt": "Yeah I know all the ineficiencies that they have and in an \"objective\" view\ngiving dividend is irrational because for the shareholder is better a buyback or\nreinvesting the money in the company. But the thing is, they are a great way to\nmaterialize your returns without actually having to sell…",
  "original_created_utc": 1624141095,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ええ、私は彼らが持っているすべての不備を知っていますし、「客観的」な見方をすれば\n株主にとっては自社株買いや会社への再投資の方が良いので、配当をすることは非合理的です。\n会社に再投資したほうがいいからです。しかし、重要なのは、配当金はあなたの利益を実現するための素晴らしい方法だということです。\n実際に売却することなく、リターンを実現するための素晴らしい方法です。",
      "title": "配当は過小評価されていると思う"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，我知道他们的所有缺陷，从 \"客观 \"的角度来看\n给予股息是不理性的，因为对股东来说，回购或\n将钱再投资于公司。但问题是，他们是一个伟大的方式来\n但问题是，它们是实现你的回报的一个很好的方法，而不需要实际出售......",
      "title": "我认为红利被低估了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，我知道他們的所有缺陷，從 \"客觀 \"的角度來看\n給予股息是不理性的，因爲對股東來說，回購或\n將錢再投資於公司。但問題是，他們是一個偉大的方式來\n但問題是，它們是實現你的回報的一個很好的方法，而不需要實際出售......",
      "title": "我認爲紅利被低估了"
    }
  ],
  "title": "I think dividends are underrated",
  "created_utc": 1624151795,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yeah I know all the ineficiencies that they have and in an &quot;objective&quot; view giving dividend is irrational because for the shareholder is better a buyback or reinvesting the money in the company.\n But the thing is, they are a great way to materialize your returns without actually having to sell anything. I do not like selling. A lot of blue chips pay 1-3% and some stocks like reits a bit more so you basically have a bond and if the economy goes well, sweet capital gains, a big company doesn t have to be a boring company (I made more gains this year with VW than with PTLR). Also it is a great signal that the company is doing well. To finish, you have to be really naive or live under a rock to believe in the Efficient Market Hipotesis, trusting the market to price exacly the company is almost an unreal expectation, the dividend is a tangible that you have while riding the waves.</p>\n</div><!-- SC_ON -->",
  "score": 146,
  "permalink": "/r/investing/comments/o3r8iu/i_think_dividends_are_underrated/",
  "subreddit": "investing",
  "id": "o3r8iu",
  "is_self": true,
  "media": null,
  "is_video": false
}