{
  "author": "TheBigLT77",
  "the_new_excerpt": "Morning everyone.\n\nYou may recall I wrote a post on here not too long ago on how GMO food plays\ncould be the next hot sector.\n\nFor those who didn’t and would like to find out more, have a read and read the\ncomments. It was a great/informative discussion that didn’t revolve around “BUY\nPLTR OR BUY…",
  "original_created_utc": 1610620546,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "早晨大家。\n\n你可能记得我在这里写了一篇文章 不久前在 GMO 食品如何扮演\n可能是下一个热门行业。\n\n对于那些没有和想了解更多的人来说，可以读一读，看一看。\n评论。这是一个伟大的/信息性的讨论，没有围绕 \"买 \"的问题。\nPLTR或购买...",
      "title": "食物基因编辑 股票更新!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "早晨大家。\n\n你可能記得我在這裏寫了一篇文章 不久前在 GMO 食品如何扮演\n可能是下一個熱門行業。\n\n對於那些沒有和想了解更多的人來說，可以讀一讀，看一看。\n評論。這是一個偉大的/信息性的討論，沒有圍繞 \"買 \"的問題。\nPLTR或購買...",
      "title": "食物基因編輯 股票更新!"
    }
  ],
  "title": "FOOD gene editing stocks UPDATE!",
  "created_utc": 1610644798,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Morning everyone.</p>\n\n<p>You may recall I wrote a post on here not too long ago on how GMO food plays could be the next hot sector.</p>\n\n<p>For those who didn’t and would like to find out more, have a read and read the comments. It was a great/informative discussion that didn’t revolve around “BUY PLTR OR BUY DKNG”</p>\n\n<p>Good DD and suggested plays, enjoy;</p>\n\n<p><a href=\"https://www.reddit.com/r/stocks/comments/jbc4v7/the_next_hot_sector_food_gene_editing_stocks/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\">https://www.reddit.com/r/stocks/comments/jbc4v7/the_next_hot_sector_food_gene_editing_stocks/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf</a></p>\n\n<p>For those who did read or had an interest in it, I just thought I would provide an update on how they are going. I think this sector is going to have a huge year.</p>\n\n<p>My post was 91 days ago  and my suggested plays were;</p>\n\n<p>Corteva (CTVA)</p>\n\n<p>$33.82 Now: $44.13</p>\n\n<p>Precision Bioscience (DTIL)</p>\n\n<p>$6.52 Now: $9.80</p>\n\n<p>Calyxt (CLXT)</p>\n\n<p>$5.07 Now: $4.76\n(offering/dilution occurred soon after, not ideal but has been steadily climbing)</p>\n\n<p>Yield 10 Bioscience (YTEN)</p>\n\n<p>$6.49 Now: $7.61</p>\n\n<p>Origin Argitech (SEED)</p>\n\n<p>$9.63 Now: $16.51</p>\n\n<p>I was getting a lot of DMs about the original post so said it would be easier to do an update.</p>\n\n<p>To answer a few questions, I am still very, very bullish on this sector. I think it is only the beginning.</p>\n\n<p>My recommendation and largest holding from the above is SEED.</p>\n\n<p>SEED have been working for 10 years to get their GMO right and approved by government, finally they are in and the government is ready to roll out GMO in China. SEED will dominate this space.</p>\n\n<p>It has had a huge run so far but there are way more catalysts ahead and with a 3 million share float, this going to go parabolic soon. Shorts covering the higher it inevitably goes, think GameStop, Nio, XPEV type of runs , the ones that just look outrageous on your watch list.</p>\n\n<p>Read more about the opportunity for SEED here</p>\n\n<p><a href=\"https://www.sec.gov/Archives/edgar/data/1321851/000110465920094375/tm2027521d1_ex99-1.htm\">https://www.sec.gov/Archives/edgar/data/1321851/000110465920094375/tm2027521d1_ex99-1.htm</a></p>\n\n<p>SEED turned down $24 a share in 2014.\nThe CFO commented “I tell people the value of this company is Monsanto multiplied by Baidu divided by Google,” Talk about being bullish and keeping the faith. He was right.</p>\n\n<p>Again, before commenting mindless comments, “BUY PLTR” “PUMP IT” , just read the original post where I dived deep or do a quick google on GMO or the stocks above.</p>\n\n<p>There are a lot of newbies, so many pump and dumpers but genuine, informative posts about companies still exist on here. I still love this sub!</p>\n\n<p>I’m a long term investor so I’m not to bothered by short term volatility. SEEDs all time high was around $170 15 years ago. In a few months, SEED can be up at 30-40 and I think in a year , it can be at $100, no problem.</p>\n\n<p>Hope you enjoyed and hope everyone has a great year investing!</p>\n</div><!-- SC_ON -->",
  "score": 88,
  "permalink": "/r/stocks/comments/kx38a3/food_gene_editing_stocks_update/",
  "subreddit": "stocks",
  "id": "kx38a3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311217238
}