{
  "author": "wpeironnet",
  "original_created_utc": 1659163007,
  "title": "How I Coped With Losing My Entire Portfolio to Celsius Network Bankruptcy",
  "created_utc": 1659184573,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A lot of people lost everything. My whole portfolio was in a Celsius earn account and one day they froze withdrawals and that was that. &lt;/p&gt;\n\n&lt;p&gt;The portfolio I had built up for years was swept away from me more or less. Thousands of people lost thousands of dollars. I have pretty much given up hope on those coins returning and yet I feel ok.&lt;/p&gt;\n\n&lt;p&gt;Since it happened a lot of people fall into this depression, psychosis, rage, and despair. I never thought it was that deep. I lost a lot of money. But I can’t do anything to change the outcome.&lt;/p&gt;\n\n&lt;p&gt;Why should I lose sleep over something I literally cannot fix. When it happened I was frustrated for about and day and then realized ok fine, time to start new.&lt;/p&gt;\n\n&lt;p&gt;I am young and I have time let’s start from scratch. And so here I am rebuilding my portfolio piece by piece. DCA by DCA.&lt;/p&gt;\n\n&lt;p&gt;I think always taking up hobbies can distract you from trying times as well. Much like beating drug addiction the best way is to replace the thoughts with a hobby. I hang with friends or workout or rock climb to distract myself from constant bad news which is easy to find nowadays.&lt;/p&gt;\n\n&lt;p&gt;It’s not the end of the world it’s just money and it can be rebuilt. It’s unfortunate but not the end of the line.\nTo anyone else who lost it all take it from me losing your mind over it won’t help you get your money up.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 536,
  "permalink": "/r/CryptoCurrency/comments/wbqz78/how_i_coped_with_losing_my_entire_portfolio_to/",
  "subreddit": "CryptoCurrency",
  "id": "wbqz78",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A lot of people lost everything. My whole portfolio was in a Celsius earn\naccount and one day they froze withdrawals and that was that.\n\nThe portfolio I had built up for years was swept away from me more or less.\nThousands of people lost thousands of dollars. I have pretty much given up hope\non…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人がすべてを失った。私の全ポートフォリオはセルシオの口座にありました。\nの口座にあったのですが、ある日突然、出金が凍結され、それきりです。\n\n何年もかけて築き上げたポートフォリオが、多かれ少なかれ私の手元から流されてしまったのです。\n何千人もの人が何千ドルも失いました。私はかなり希望を捨てました\nで...",
      "title": "セルシオ・ネットワークの倒産で全財産を失った私の対処法"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很多人失去了一切。我的整个投资组合是在一个Celsius赚取的\n有一天，他们冻结了提款，就是这样。\n\n我多年来建立的投资组合或多或少地被扫地出门了。\n成千上万的人失去了成千上万的美元。我几乎已经放弃了希望\n在...",
      "title": "我如何应对因Celsius网络破产而失去整个投资组合的情况"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多人失去了一切。我的整個投資組合是在一個Celsius賺取的\n有一天，他們凍結了提款，就是這樣。\n\n我多年來建立的投資組合或多或少地被掃地出門了。\n成千上萬的人失去了成千上萬的美元。我幾乎已經放棄了希望\n在...",
      "title": "我如何應對因Celsius網絡破產而失去整個投資組合的情況"
    }
  ]
}