{
  "author": "Jumpman707",
  "original_created_utc": 1629706382,
  "title": "To those who are thinking ”I should have bought more during the last dip\"",
  "created_utc": 1629725409,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>”I should have bought more during the last dip&quot;</p>\n\n<p>Stop this state of mind now, otherwise, you’ll never be happy. There was a reason you didn&#39;t buy more, you did not have the money you&#39;re willing to risk or you&#39;re probably thinking it could get lower still or this is the end of your particular crypto. Whatever it was, it was the best decision back then. Don&#39;t beat yourself up and more importantly don&#39;t FOMO now with money you can&#39;t afford to lose. </p>\n\n<p>DCA, take profits, hold forget about it, whatever is best for you as of this moment. </p>\n\n<p>Stay focused, take every article here about the next bull run with a grain of bull testicle salt and just keep on doing what&#39;s best for your current situation. Like someone said before, &quot;the boat hasn&#39;t even left the port yet.&quot;</p>\n</div><!-- SC_ON -->",
  "score": 201,
  "permalink": "/r/CryptoCurrency/comments/p9vc4f/to_those_who_are_thinking_i_should_have_bought/",
  "subreddit": "CryptoCurrency",
  "id": "p9vc4f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "”I should have bought more during the last dip\"\n\nStop this state of mind now, otherwise, you’ll never be happy. There was a\nreason you didn't buy more, you did not have the money you're willing to risk or\nyou're probably thinking it could get lower still or this is the end of your\nparticular crypto.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"前回のディップ時にもっと買っておけばよかった\"\n\nこの心理状態を今すぐ止めないと、いつまでたっても幸せになれません。これには理由があります。\nもっと買わなかったのは、リスクを負うだけの資金がなかったか、あるいは\nまだまだ下がると思っていたり、特定の暗号がこれで終わりだと思っていたりするでしょう。\n特定のcrypto....",
      "title": "\"前回のディップ時にもっと買っておけばよかった \"と思っている方へ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"我应该在上次下跌时多买一些\"\n\n现在就停止这种心态，否则，你将永远不会快乐。有一个\n你没有买更多的原因，你没有你愿意冒险的钱，或者\n你可能认为它还会更低，或者这是你的特定加密货币的终点。\n特定的加密货币....",
      "title": "对于那些认为 \"我应该在上次下跌时多买一些 \"的人来说"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"我應該在上次下跌時多買一些\"\n\n現在就停止這種心態，否則，你將永遠不會快樂。有一個\n你沒有買更多的原因，你沒有你願意冒險的錢，或者\n你可能認爲它還會更低，或者這是你的特定加密貨幣的終點。\n特定的加密貨幣....",
      "title": "對於那些認爲 \"我應該在上次下跌時多買一些 \"的人來說"
    }
  ]
}