{
  "author": "AliensAreDope",
  "original_created_utc": 1633734930,
  "title": "Malcolm X was in Norfolk Prison Colony where a man named “Parkhurst” had filled the prison with thousands of books. Any idea on who this Parkhurst guy was? Can’t find anything on him.",
  "created_utc": 1633808739,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Excerpt from Malcolm X’s autobiography: “Norfolk Prison Colony’s library was one of its outstanding features. A millionaire named Parkhurst had willed his library there; he had probably been interested in the rehabilitation program. History and religions were his special interests. Thousands of his books were on the shelves”</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/q499gm/malcolm_x_was_in_norfolk_prison_colony_where_a/",
  "subreddit": "AskHistorians",
  "id": "q499gm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Excerpt from Malcolm X’s autobiography: “Norfolk Prison Colony’s library was one\nof its outstanding features. A millionaire named Parkhurst had willed his\nlibrary there; he had probably been interested in the rehabilitation program.\nHistory and religions were his special interests. Thousands of his…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "マルコムXの自叙伝からの抜粋。\"ノーフォーク・プリズン・コロニーの図書館は、その優れた特徴のひとつだった。\n卓越した特徴のひとつである。パークハーストという大富豪が自分の図書館をそこに遺した。\n彼はおそらく更生プログラムに興味を持っていたのだろう。\n彼は歴史と宗教に興味があった。何千冊もの彼の...",
      "title": "マルコムXは、ノーフォークの監獄コロニーで、「パークハースト」という男が何千冊もの本で刑務所を埋め尽くしていた。このパークハーストという男が誰なのか知っていますか？彼について何も見つかりません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "摘自马尔科姆-X的自传。\"诺福克监狱殖民地的图书馆是一个\n它的一个突出特点。一位名叫帕克赫斯特的百万富翁将他的\n的图书馆；他可能对改造计划感兴趣。\n历史和宗教是他的特殊兴趣。他的数以千计的...",
      "title": "马尔科姆-X曾在诺福克监狱殖民地，一个名叫 \"帕克赫斯特 \"的人在监狱里堆满了成千上万的书。知道这个叫帕克赫斯特的人是谁吗？找不到任何关于他的资料。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "摘自馬爾科姆-X的自傳。\"諾福克監獄殖民地的圖書館是一個\n它的一個突出特點。一位名叫帕克赫斯特的百萬富翁將他的\n的圖書館；他可能對改造計劃感興趣。\n歷史和宗教是他的特殊興趣。他的數以千計的...",
      "title": "馬爾科姆-X曾在諾福克監獄殖民地，一個名叫 \"帕克赫斯特 \"的人在監獄裏堆滿了成千上萬的書。知道這個叫帕克赫斯特的人是誰嗎？找不到任何關於他的資料。"
    }
  ]
}