{
  "author": "marvelogs",
  "original_created_utc": 1626869761,
  "title": "Domainy - Monitor and get alerted when domain names you want are about to expire",
  "created_utc": 1626904475,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I created Domainy as a simple tool to get alerted on when the domain names I like and want are about to expire and also become available.</p>\n\n<p><a href=\"https://www.domainy.io\">https://www.domainy.io</a></p>\n\n<p>A few use cases</p>\n\n<ol>\n<li>I&#39;m monitoring all the other TLD domain names for which I would like to eventually acquire to protect brand names for the domain names that I already have (e.g. I have <a href=\"https://google.com\">google.com</a> and I want to make sure that I have google.abcde, google.edfg etc etc)</li>\n<li>I also want to know when some of the domains that I would like will expire and possibly become available, so I can quickly buy them if I can. Just because a domain is expired, it doesn&#39;t mean it&#39;s available right away. But still, I&#39;d like to keep my eye on them.</li>\n<li>Sometimes, it&#39;s just super interesting to see when some high profile names are available through obsecure TLDs (e.g. <a href=\"https://twitter.beauty\">twitter.beauty</a>, <a href=\"https://twitter.accountant\">twitter.accountant</a>, <a href=\"https://twitter.dealer\">twitter.dealer</a> domain names are available. What would happen if I buy them and do something with it. Twitter will probably come after me, but hey, it&#39;s an interesting thought. Maybe they&#39;ll buy them off? I don&#39;t know. What other high profile names are available through other TLDs?</li>\n</ol>\n\n<p>I&#39;m a domainer and I&#39;ve been using Domainy to monitor and get alerted on domain names for above use cases.</p>\n\n<p>Cheers!</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/ooookt/domainy_monitor_and_get_alerted_when_domain_names/",
  "subreddit": "SideProject",
  "id": "ooookt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I created Domainy as a simple tool to get alerted on when the domain names I\nlike and want are about to expire and also become available.\n\nhttps://www.domainy.io\n\nA few use cases\n\n 1. I'm monitoring all the other TLD domain names for which I would like to\n    eventually acquire to protect brand…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Domainyは、私が好きなドメイン名や欲しいドメイン名が期限切れになったり、利用できるようになったりしたときに、アラートを受け取るためのシンプルなツールとして作りました。\n欲しいドメイン名が期限切れになったり、利用可能になったりしたときにアラートを受け取るためのシンプルなツールとしてDomainyを作りました。\n\nhttps://www.domainy.io\n\nいくつかの使用例\n\n 1. ブランド保護のために最終的に取得したい他のTLDドメイン名をすべて監視している。\n    ブランドを守るために最終的に取得したい他のTLDドメイン名を監視している。",
      "title": "Domainy - 欲しいドメイン名が期限切れになるのを監視し、アラートを受け取ることができます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我创建了Domainy，作为一个简单的工具来提醒我喜欢和想要的域名何时到期，以及何时可以使用。\n喜欢和想要的域名即将过期和可用。\n\nhttps://www.domainy.io\n\n几个使用案例\n\n 1. 我正在监测所有我想要的其他TLD域名。\n    最终收购以保护品牌...",
      "title": "Domainy - 监测并在你想要的域名即将到期时得到提醒"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我創建了Domainy，作爲一個簡單的工具來提醒我喜歡和想要的域名何時到期，以及何時可以使用。\n喜歡和想要的域名即將過期和可用。\n\nhttps://www.domainy.io\n\n幾個使用案例\n\n 1. 我正在監測所有我想要的其他TLD域名。\n    最終收購以保護品牌...",
      "title": "Domainy - 監測並在你想要的域名即將到期時得到提醒"
    }
  ]
}