{
  "author": "OnlyFundamentals",
  "original_created_utc": 1638625983,
  "title": "Using one sentence, what have you learned from this dip/crash?",
  "created_utc": 1638641949,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I believe many people got a shock of their life when they woke up and saw the price of crypto plummet. Many leverage investors have been hit really hard.&lt;/p&gt;\n\n&lt;p&gt;I was also on leverage and lost over 5 digits but I still have some crypto that is not in leverage. Even someone who is bullish can also be destroyed in this type of environment.&lt;/p&gt;\n\n&lt;p&gt;Personally, I have learn to reduce my leverage trading and focus more on holding it for the long term. &lt;/p&gt;\n\n&lt;p&gt;Stay strong folks, we are going to be there for each other in this dips. I’ll be honest, this dip is making me panic inside and a slide PTSD from 2017 crash. If you ever need help, do not be afraid to talk to your love ones or even call the hotline for help!&lt;/p&gt;\n\n&lt;p&gt;TLDR - stay strong folks, we will get there together.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 340,
  "permalink": "/r/CryptoCurrency/comments/r8q40x/using_one_sentence_what_have_you_learned_from/",
  "subreddit": "CryptoCurrency",
  "id": "r8q40x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I believe many people got a shock of their life when they woke up and saw the\nprice of crypto plummet. Many leverage investors have been hit really hard.\n\nI was also on leverage and lost over 5 digits but I still have some crypto that\nis not in leverage. Even someone who is bullish can also be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "目が覚めたとき、多くの人が衝撃を受けたと思います。\n暗号の価格が急落した。多くのレバレッジ投資家は、本当に大きな打撃を受けました。\n\n私もレバレッジをかけ、5桁以上の損失を出しましたが、まだ暗号をいくつか持っています。\nはレバレッジを掛けていない。強気な人も、また...。",
      "title": "このディップ／クラッシュから学んだことを一文で表現してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信很多人一觉醒来，看到加密货币的价格暴跌时，都受到了人生的冲击。\n加密货币的价格暴跌。许多杠杆投资者受到了很大的冲击。\n\n我也使用了杠杆，损失超过5位数，但我仍然有一些没有使用杠杆的加密货币。\n不在杠杆中。即使是看涨的人也会被...",
      "title": "用一句话来说，你从这次跌倒/撞倒中学到了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信很多人一覺醒來，看到加密貨幣的價格暴跌時，都受到了人生的衝擊。\n加密貨幣的價格暴跌。許多槓桿投資者受到了很大的衝擊。\n\n我也使用了槓桿，損失超過5位數，但我仍然有一些沒有使用槓桿的加密貨幣。\n不在槓桿中。即使是看漲的人也會被...",
      "title": "用一句話來說，你從這次跌倒/撞倒中學到了什麼？"
    }
  ]
}