{
  "author": "OrganicDroid",
  "original_created_utc": 1634050001,
  "title": "Why I’m so bullish this cycle, and why this time is different: Staking. There isn’t as much pressure to sell. Get ready for the pump of a lifetime.",
  "created_utc": 1634067033,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think it’s fair to say at this point most of us think this bull cycle has some room to run.</p>\n\n<p>Some say it will follow the trends of the past - 2013, 2017 - but this time, it’ll be longer and more drawn out.</p>\n\n<p>I’m optimistic because I don’t know if we will be able to recognise a bear market similar to the past after this run is over. People can keep their funds locked up and continue collecting dividends - if we can do that, a lot of us who wouldn’t otherwise hold will be more inclined to.</p>\n\n<p>Big players are getting in. Credit/debit card rewards require staking. People are hodling their damn Moons!</p>\n\n<p>This year is the first time I have experienced staking (at least staking wasn’t holding NEO to collect GAS back in 2017) and you can be sure, the fact that it’s here means this bull run will run a while - or never necessarily truly “end” in some of our previous views of volatility who have been in crypto for a while.</p>\n\n<p>You don’t have to tell me to hodl twice because of staking. Since that is likely true for many of you, get ready for 5x+ gains.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/q6nt72/why_im_so_bullish_this_cycle_and_why_this_time_is/",
  "subreddit": "CryptoCurrency",
  "id": "q6nt72",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I think it’s fair to say at this point most of us think this bull cycle has some\nroom to run.\n\nSome say it will follow the trends of the past - 2013, 2017 - but this time,\nit’ll be longer and more drawn out.\n\nI’m optimistic because I don’t know if we will be able to recognise a bear\nmarket similar…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現時点では、ほとんどの人がこのブルサイクルにはまだ余地があると考えていると言っていいでしょう。\nこの強気のサイクルにはまだ余地があると考えています。\n\n2013年、2017年と過去のトレンドを踏襲すると言う人もいますが、今回はもっと長く、もっと長くなるでしょう。\n今回はより長く、より長くなるだろうと言う人もいます。\n\n私が楽観的なのは、今回のような弱気の市場を認識できるかどうかがわからないからです。\n似たような市場...",
      "title": "今回のサイクルで強気な理由、そして今回は違う理由： ステイキング。売りのプレッシャーはそれほどない。一生に一度のパンプに備えよう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为可以说，在这一点上，我们大多数人认为这个牛市周期还有一些\n运转的空间。\n\n有些人说，它将遵循过去的趋势--2013年、2017年--但这一次。\n它将会更长、更久。\n\n我很乐观，因为我不知道我们是否能够认识到类似于熊市的\n熊市类似...",
      "title": "为什么我对这个周期如此看好，以及为什么这次不同：赌注。卖出的压力没有那么大。准备好迎接一生中最重要的一次抽奖吧。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲可以說，在這一點上，我們大多數人認爲這個牛市週期還有一些\n運轉的空間。\n\n有些人說，它將遵循過去的趨勢--2013年、2017年--但這一次。\n它將會更長、更久。\n\n我很樂觀，因爲我不知道我們是否能夠認識到類似於熊市的\n熊市類似...",
      "title": "爲什麼我對這個週期如此看好，以及爲什麼這次不同：賭注。賣出的壓力沒有那麼大。準備好迎接一生中最重要的一次抽獎吧。"
    }
  ]
}