{
  "author": "w00tangel",
  "original_created_utc": 1659628375,
  "title": "CCIP-036 - Remove link posts to paywalled articles",
  "created_utc": 1659714168,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Summary&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Moderators should remove link posts to paywalled articles unless a paywall features an easy to notice and use cryptocurrency payment option.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Problem Statement&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;You all know the feeling, you see an interesting title of a link post you open it up only to find out the article is behind a paywall.&lt;/p&gt;\n\n&lt;p&gt;Some of us will agree that it is OK, as quality content has its costs, but as a cryptocurrency community we should encourage usage of cryptocurrencies.&lt;/p&gt;\n\n&lt;p&gt;These are some benefits to this proposal:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;There will be fewer link posts as link posts to paywalled articles will be removed and there have been several proposals lately in &lt;a href=\"/r/CryptoCurrencyMeta\"&gt;r/CryptoCurrencyMeta&lt;/a&gt; to limit or reduce the amount of link posts&lt;/li&gt;\n&lt;li&gt;We as a crypto community will encourage implementation of cryptocurrency payment methods. If they want the traffic from our community, they shouldn&amp;#39;t expect us to pay it with fiat.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&lt;strong&gt;Solution&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Remove link posts to paywalled articles unless a paywall features an easy to notice and use cryptocurrency payment option.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Concerns&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Some of the quality paywalled content will not be able to reach the hot section of this sub and people will miss out on the opportunity to read it.&lt;/p&gt;\n\n&lt;p&gt;Some of the articles might have paywalls that offer crypto payment options but they might not be obvious from the first look (think hidden in a 3rd step of the checkout process after you enter a lot of data). We can not expect our moderators to spend way too much time exploring if the paywall on a specific site someone linked can be paid with crypto or not. The option needs to be easy to spot.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/poll/wg4pa3\"&gt;View Poll&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/wg4pa3/ccip036_remove_link_posts_to_paywalled_articles/",
  "subreddit": "CryptoCurrency",
  "id": "wg4pa3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Summary\n\nModerators should remove link posts to paywalled articles unless a paywall\nfeatures an easy to notice and use cryptocurrency payment option.\n\nProblem Statement\n\nYou all know the feeling, you see an interesting title of a link post you open\nit up only to find out the article is behind a…"
}