{
  "author": "zeroboundss",
  "original_created_utc": 1624413344,
  "title": "The FULL picture: Why I believe the crypto bull market isn't over yet",
  "created_utc": 1624422638,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve seen a lot of posts today about whether we have entered a bear market or not, so I wanted to share with you why I&#39;m convinced at least for now that we are still in a bull market and this is just a corrective phase before at least another push to a new ATH. I&#39;ll break down my argument into 2 parts, macroeconomic landscape (wider economic landscape) and onchain data (data specific to bitcoin/crypto).</p>\n\n<h1>Macro indicators</h1>\n\n<p>Macro risk appetite affects crypto. In a <em>risk off</em> environment all players tend to seek refuge in cash or liquidity. In a <em>risk on</em> environment players perceive an infusion of fresh liquidity in the markets and as result resort to speculation to make sure they capture as much as possible of this new liquidity entering markets.</p>\n\n<p>An analogy I like in this sense is that of an oasis in the middle of the desert. In every oasis there is a water pool and life flourishes around it. You can imagine how important this pool is, without it life in the desert would be impossible. Financial markets are organized in a similar fashion when it comes to liquidity. No matter how much an economy grows, liquidity will always be limited and it&#39;s something all players keep an eye on, just like the inhabitants of an oasis. Let&#39;s say now there is a huge block of buildings in the oasis inhabited by wealthy individuals who also happen to be the only ones to have an internet connection or access to geothermic data on the predicted inflows of water. So what happens when this group of people learns that inflows of water are about to stop for whatever reason? Automatically they will start pulling more water from the main pool than they actually need (without having access to the information the rich people have), as they prepare for a dry season. The others around them will start noticing this, maybe they will notice the water pumps, and as result of this slowly everyone will start pulling more water from the pool than they actually need until dry season eventually comes. When it comes to liquidity in markets, something similar happens at the end of a bull cycle. The biggest players such as pension funds or huge hedge funds that have access to very good information, are the first ones to start pulling liquidity out of circulation. Once big players start pulling money out, considering the amount of assets they sell (the equivalent of water pumps in the desert, are assets being dumped at markets), they initiate a rush to liquidity that slowly propagates to the rest of the economy. Important here that most other players do not have access to any of the information of these big funds, however they react just like people in the desert react when they see a big block of flats is suddenly pulling water out to build up water reserves.</p>\n\n<p>So what indicators can we look at to determine whether big players anticipate tightening market conditions or not? US treasuries and corporate bonds are the gold standard in this sense. So when we want to see whether anything is changing in the attitude of <em>whales</em> (not crypto whales, real market whales) we go looking for the yields of US treasuries. In fact when whales foresee a liquidity crunch they expect much higher returns on their capital, therefore the interest rate of treasuries goes up. When whales foresee that there will be plenty of liquidity in the markets then dynamics change, there is competition over who lends the money at the lowest interest rates and therefore treasuries go down.</p>\n\n<p><a href=\"https://www.cnbc.com/quotes/US10Y\"><strong>If we look at 10YUS treasuries</strong></a><strong>, after spiking to 1.7% in May, yields have kept going down and are currently at a 2 month low of 1.46%. Therefore treasuries suggest the markets are risk on (which is good for crypto).</strong></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/tge40c9f4x671.png?width=1635&amp;format=png&amp;auto=webp&amp;s=5cf8773cbb09802fbf18a0a90d40f42f782e7b6b\">Low risk corporate bond prices</a></p>\n\n<p>The next thing I look at are low risk corporate bonds, similar to treasuries where people lend money to the US Government, with low risk Corporate bonds people lend money to big, blue chip corporations that have a solid track record and are perceived as being in low risk of default. For them we can check the above price chart, as we can <strong>see prices of low risk corporate bond ETFs have been moving in a rising channel since March 2021</strong>. Beware that here we are checking the price chart, which moves in the opposite direction of the interest rate of the underlying bonds. Here too we have a confirmation that markets are still in risk on mode, meaning there is no shortage of liquidity.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/jopu87ti4x671.png?width=1677&amp;format=png&amp;auto=webp&amp;s=57d85e9cd0fe8198e6f7df9fd976442e7c01091a\">High risk corporate bond prices</a></p>\n\n<p>The third indicator is the price of high risk corporate bonds, these are inversely proportional with the interest rates at which the market is willing to lend money to corporates that are perceived as being at high risk of default. In other words this is a direct measure of the risk appetite of smart market or legacy market whales. By looking at the above chart here too we see that prices are in strong uptrend, meaning that markets are lending money to these high risk borrower at increasingly lower rates. <strong>This is our third indicator that confirms how smart money, which isn&#39;t influenced by short term news cycles and media narratives, is risk on.</strong></p>\n\n<p>To conclude, in this first part of the analysis, we can see how in our desert nobody is pulling water out of the desert pool, therefore the wider market gradient favors a bullish crypto market as there is no liquidity shortage. Now let&#39;s look at crypto indicators.</p>\n\n<h1>Crypto indicators</h1>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/0eh9rwxu4x671.jpg?width=1239&amp;format=pjpg&amp;auto=webp&amp;s=085551774d3cc5ba779f88ab94f8660348eb5246\">https://preview.redd.it/0eh9rwxu4x671.jpg?width=1239&amp;format=pjpg&amp;auto=webp&amp;s=085551774d3cc5ba779f88ab94f8660348eb5246</a></p>\n\n<p>For this I rely main on Glassnode onchain data analysis. The most interesting chart in this sense is the following, that shows how the amount of coins bought at the beginning of this bull cycle is still <em>maturing.</em> In other words, this shows how holders did sell something at the peak area, but they have kept most of their assets with unflinching conviction regardless of volatility. This implies that these investors do not consider the current cycle closed, and therefore are waiting for even higher highs to sell.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/jbazfp6c6x671.png?width=1603&amp;format=png&amp;auto=webp&amp;s=5f21abd0d072372213af53ec84caef1d372bdd18\">https://preview.redd.it/jbazfp6c6x671.png?width=1603&amp;format=png&amp;auto=webp&amp;s=5f21abd0d072372213af53ec84caef1d372bdd18</a></p>\n\n<p>The second indicator has a somewhat mixed meaning. In fact, if look at long term holders, we see that they are accumulating again. This is bearish short term, because when long term holder accumulate they create downward pressure on price since they patiently wait for retail or short term holder to sell at market. However, something else is going on in the hidden OTC markets, where big amounts of coins are traded, because miners probably affected by the recent clampdown in mining in China, are fueling distribution. We&#39;re therefore in a distribution phase in the OTC markets. Below is a glassnode chart illustrating this. This distribution however does not affect market prices because it is <em>hidden,</em> being OTC*.*</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/jnj5un3q7x671.jpg?width=1235&amp;format=pjpg&amp;auto=webp&amp;s=f9bbae31fa844e583786832e3ead38aff992b345\">Distribution OTC</a></p>\n\n<p>Finally the recent China ban of bitcoin mining has brought the hashrate to the level of June-September 2020. Negative hashrate momentum means less coins mined and also less selling pressure. While the effects of this are limited in the short term, it is likely that if this trend continues the amount of minted coins may reach an all time low which may then trigger the next cycle to the upside. Again here the timing seems to be around fall 2021.</p>\n\n<p>To summarize, I believe that after almost a year of <em>up only</em> what we are going through now is a healthy market correction. Considering the wider market context, the pieces are in place for this crypto bullish cycle to resume/continue later this year once the stars re-align. These include accumulation by whales (which is already at Jan 2021 levels), as well as other catalysts such as decreasing hashrate due to the China ban.</p>\n</div><!-- SC_ON -->",
  "score": 276,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/rsKY2-HonRSPO8H9VvfEYWbZ_YOqC5FH8clxWIQLcrw.jpg?auto=webp&s=506115da478280241bb7cdb5203f5037ec2e8386",
          "width": 1200,
          "height": 630
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/rsKY2-HonRSPO8H9VvfEYWbZ_YOqC5FH8clxWIQLcrw.jpg?width=108&crop=smart&auto=webp&s=8eee18be2590c653e3535b076a7f7f4e0bfa5ebb",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/rsKY2-HonRSPO8H9VvfEYWbZ_YOqC5FH8clxWIQLcrw.jpg?width=216&crop=smart&auto=webp&s=6a256bc9f2d18383f6cb7e1ae6122b91b72a11d0",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/rsKY2-HonRSPO8H9VvfEYWbZ_YOqC5FH8clxWIQLcrw.jpg?width=320&crop=smart&auto=webp&s=ba89f2ccb05c6caa5a3949de866fd967a5384d85",
            "width": 320,
            "height": 168
          },
          {
            "url": "https://external-preview.redd.it/rsKY2-HonRSPO8H9VvfEYWbZ_YOqC5FH8clxWIQLcrw.jpg?width=640&crop=smart&auto=webp&s=c22814da2717ae34a55fb7a90f24e580adf188b6",
            "width": 640,
            "height": 336
          },
          {
            "url": "https://external-preview.redd.it/rsKY2-HonRSPO8H9VvfEYWbZ_YOqC5FH8clxWIQLcrw.jpg?width=960&crop=smart&auto=webp&s=40181fe4c5595d9544cb7ccbf5e04d2ae02ecea8",
            "width": 960,
            "height": 504
          },
          {
            "url": "https://external-preview.redd.it/rsKY2-HonRSPO8H9VvfEYWbZ_YOqC5FH8clxWIQLcrw.jpg?width=1080&crop=smart&auto=webp&s=7d4662a8c43895c4afa9958ef70979edabae3935",
            "width": 1080,
            "height": 567
          }
        ],
        "variants": {},
        "id": "9nKFCVgRZbQ-p2poBvlzn5MnilAQd__e7g8CyMSwG4g"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/o62yg9/the_full_picture_why_i_believe_the_crypto_bull/",
  "subreddit": "CryptoCurrency",
  "id": "o62yg9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've seen a lot of posts today about whether we have entered a bear market or\nnot, so I wanted to share with you why I'm convinced at least for now that we\nare still in a bull market and this is just a corrective phase before at least\nanother push to a new ATH. I'll break down my argument into 2…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日は、弱気市場に入ったかどうかについての多くの記事を目にしました。\nそこで、私が少なくとも今のところ、まだ弱気になっていないと確信している理由をお話ししたいと思います。\n私は、少なくとも今はまだ強気の市場であり、これは少なくとも新たなATHを目指す前の修正段階であると確信しています。\nこれは単なる修正局面であり、少なくとも新たなATHを目指す前のものであると確信しています。その理由を2つに分けて説明すると...。",
      "title": "The FULL picture: 暗号の強気相場はまだ終わっていないと思う理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今天看到很多关于我们是否已经进入熊市的帖子\n所以我想和大家分享一下，为什么我相信至少现在我们仍然处于牛市，而现在只是在牛市之前的修正阶段。\n我们仍然处于牛市，而这只是一个修正阶段，至少在再次推高到新的ATH之前\n再一次推到新的ATH前的修正阶段。我将把我的论点分成2个部分...",
      "title": "完整的图片。为什么我相信加密货币的牛市还没有结束？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今天看到很多關於我們是否已經進入熊市的帖子\n所以我想和大家分享一下，爲什麼我相信至少現在我們仍然處於牛市，而現在只是在牛市之前的修正階段。\n我們仍然處於牛市，而這只是一個修正階段，至少在再次推高到新的ATH之前\n再一次推到新的ATH前的修正階段。我將把我的論點分成2個部分...",
      "title": "完整的圖片。爲什麼我相信加密貨幣的牛市還沒有結束？"
    }
  ]
}