{
  "author": "terriblelad",
  "the_new_excerpt": "Now, bare with me here as it’s not as straight-forward as the question you think\nit sounds. I was born and raised in a region of England that’s known as the\nblack country and we have a pretty strong dialect of the english accent.\n\nI’m not sure how many of you are familiar with what a ‘black country’…",
  "original_created_utc": 1612038498,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "现在，请原谅我，因为这并不像你认为的问题那样直白。\n这听起来。我出生和成长在英格兰的一个地区，这是著名的。\n黑人国家，我们有一个相当强的方言 英语口音。\n\n我不知道你们有多少人熟悉什么是 \"黑国\"... ...",
      "title": "当你在电话里拼写一些东西的时候，你到底怎么念 \"R\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在，請原諒我，因爲這並不像你認爲的問題那樣直白。\n這聽起來。我出生和成長在英格蘭的一個地區，這是著名的。\n黑人國家，我們有一個相當強的方言 英語口音。\n\n我不知道你們有多少人熟悉什麼是 \"黑國\"... ...",
      "title": "當你在電話裏拼寫一些東西的時候，你到底怎麼念 \"R\"？"
    }
  ],
  "title": "How the hell do you pronounce your ‘R’s over the phone when spelling something out?",
  "created_utc": 1612056919,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Now, bare with me here as it’s not as straight-forward as the question you think it sounds. I was born and raised in a region of England that’s known as the black country and we have a pretty strong dialect of the english accent.</p>\n\n<p>I’m not sure how many of you are familiar with what a ‘black country’ accent is but if you’ve watched Peaky Blinders, that’s pretty much it. Now onto the pronunciation problem itself, whenever I get to the letter ‘R’ whilst spelling something, it sounds like I’m vocalising the letter ‘A’ in a posh manner.</p>\n\n<p>As a result, I have to add a bit of emphasis to the letter which makes me sound like a daft pirate. I really fucking hate this letter, does my head in. How the hell do you lads pronounce it without trying too hard?</p>\n</div><!-- SC_ON -->",
  "score": 130,
  "permalink": "/r/AskMen/comments/l8uw5u/how_the_hell_do_you_pronounce_your_rs_over_the/",
  "subreddit": "AskMen",
  "id": "l8uw5u",
  "is_self": true,
  "media": null,
  "is_video": false
}