{
  "author": "bthemonarch",
  "original_created_utc": 1653334505,
  "title": "Loopring and GME have a chance to trigger something huge (and crypto will benefit)",
  "created_utc": 1653406884,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I get it GME and Loopring are both memes yada yada yada, but there is a perfect storm brewing:  &lt;/p&gt;\n\n&lt;p&gt;Inflation is running rampant, markets are collapsing, banks have super high interest rates, and in general, there seems to be a general distrust in the established authority, who time and time we have watched bail out the big guys and watched as they make promises only to come up with excuses and more funding of wars.   &lt;/p&gt;\n\n&lt;p&gt;Point is the loopring and gme has a major following, and are loyal to these projects, and what are these projects trying to do?   &lt;/p&gt;\n\n&lt;p&gt;Well, they are trying to get rid of the status quo, with banks and exchanges, and even though their base may not be the most mature group, they are willing to take that plunge and &amp;#39;buy into&amp;#39; what the ceo of GME is selling, and often times its that blind faith in something that can yield amazing results. There is a vision, there is a substantial user base of younger individuals poised to bring newer people into he fold. The infrastructure has been released and is getting immediate adoption. Regulation has been making its rounds through government. You can pay in crypto. The groundwork is set...  &lt;/p&gt;\n\n&lt;p&gt;So as the overall financial markets tumble and faith in their eco systems deteriorate, they are fertilizing the grounds of decentralized finance.  As people pull  their money of out of these institutions, fearful of collapse, it only makes sense that a new system will rise in it&amp;#39;s place. All major corporations are going to be watching GME and see what they are able to do, and if it even remotely begins to succeed, I think we&amp;#39;ll see a huge ramp of decentralized finance. It will no longer be speculative, it will live, in the wild as an example of the promise of crypto on the center stage.   &lt;/p&gt;\n\n&lt;p&gt;We could even be in a bear market, but if these funds that were reserved for banks start flowing into defi, simply for self custodial reasons, the market cap in crypto will balloon. We&amp;#39;re talking about scale we&amp;#39;ve been hypothesizing for years. Who knows, but this could be the catalyst we&amp;#39;ve been waiting for.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 329,
  "permalink": "/r/CryptoCurrency/comments/uw8cta/loopring_and_gme_have_a_chance_to_trigger/",
  "subreddit": "CryptoCurrency",
  "id": "uw8cta",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I get it GME and Loopring are both memes yada yada yada, but there is a perfect\nstorm brewing:\n\nInflation is running rampant, markets are collapsing, banks have super high\ninterest rates, and in general, there seems to be a general distrust in the\nestablished authority, who time and time we have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "GMEもLoopringもミームなのはわかるけど、完璧な嵐が来てるんだよ。\n完璧な嵐が吹き荒れている。\n\nインフレが蔓延し、市場が崩壊し、銀行が超高金利になり、そして一般的に銀行に対する不信感が高まっている。\nインフレ、市場の崩壊、銀行の超高金利、そして一般的に、既存の権威に対する不信感が生まれているようです。\nそして一般的に、既成の権威に対する不信感があるようです。",
      "title": "LoopringとGMEには、何か大きなことを引き起こすチャンスがある（そして暗号はその恩恵を受けることになる）。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我明白，GME和Loopring都是回忆录，但有一个完美的风暴正在酝酿。\n酝酿着一场完美的风暴。\n\n通货膨胀正在肆虐，市场正在崩溃，银行有超高的利率。\n而总的来说，人们似乎普遍不信任既定的权威。\n既定的权威，我们一次又一次地...",
      "title": "Loopring和GME有机会触发一些巨大的事情（而加密货币将受益）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我明白，GME和Loopring都是回憶錄，但有一個完美的風暴正在醞釀。\n醞釀着一場完美的風暴。\n\n通貨膨脹正在肆虐，市場正在崩潰，銀行有超高的利率。\n而總的來說，人們似乎普遍不信任既定的權威。\n既定的權威，我們一次又一次地...",
      "title": "Loopring和GME有機會觸發一些巨大的事情（而加密貨幣將受益）。"
    }
  ]
}