{
  "author": "Nuewim",
  "original_created_utc": 1632675251,
  "title": "Most people on this sub don't have their own opinions. They just repeat what is popular at the moment. Don't be like them.",
  "created_utc": 1632684751,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>People&#39;s opinions on this sub change like wind. One day they love something other day they hate it or other way around. Problem is that most of them have no idea what they even talk about. They just like sheeps follow trends, cause they see people praise them for it. And all trends are temporary. One day on this sub everyone love some coin cause it is growing, even if they never heard about this coin before,  or hated it. Next day when coin stop growing  or we have some bad news everyone will hate coin with full passion. Mindless hypocrisy at the finest.</p>\n\n<p>Of course not all people here are like that. Some  are loyal to their coins and do not FOMO in everything that is shilled at the moment and do not spread FUD just because some ignorants  panic without a reason.  Having your own believes  is always  better strategy. If you  believe in your coins you don&#39;t need to be like mindless mirror that repeat every news. Jost HODL, most infos do not concern you, let other people  sell or buy at the heat of the moment. Have long term strategy, if you want to buy or sell just do it. If market is not the best, simply  wait. Don&#39;t do things you don&#39;t want just because some randoms at reddit advice you.</p>\n\n<p>Most  people here are panickers and FOMOers. They panic if market is just -5% red or they dream about lambos if it is +5% green. It was always like that and probably always  will be. This subreddit and most crypto investors work like that. You need to accept it. Some people grow up, many don&#39;t. They will always  panic, and do whatever other people here tell them. Buy this, sell that, crypto is ending, or maybe not. Just ignore it.</p>\n</div><!-- SC_ON -->",
  "score": 176,
  "permalink": "/r/CryptoCurrency/comments/pvxn0e/most_people_on_this_sub_dont_have_their_own/",
  "subreddit": "CryptoCurrency",
  "id": "pvxn0e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "People's opinions on this sub change like wind. One day they love something\nother day they hate it or other way around. Problem is that most of them have no\nidea what they even talk about. They just like sheeps follow trends, cause they\nsee people praise them for it. And all trends are temporary.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブ機に対する人々の意見は風のように変わる。ある日、彼らは何かを愛し\nある日は何かを好きになり、ある日はそれを嫌いになり、その逆もある。問題は、ほとんどの人が自分が何について話しているのか\n自分が何を話しているのか分からない。人々が賞賛しているのを見て、ヒツジのように流行を追っているだけです。\n褒められているのを見て、ヒツジのように流行に従うだけです。そして、すべてのトレンドは一時的なものです....",
      "title": "このサブのほとんどの人は自分の意見を持っていません。その時々で流行っていることを繰り返すだけです。彼らのようにならないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "人们对这个子的意见像风一样变化。有一天，他们喜欢的东西\n另一天，他们讨厌它，或者相反。问题是，他们中的大多数人都不知道自己在说什么。\n他们甚至不知道自己在谈论什么。他们只是像绵羊一样跟随潮流，因为他们\n因为他们看到人们对他们的赞美。而所有的趋势都是暂时的....",
      "title": "这个子上的大多数人都没有自己的意见。他们只是重复当下流行的东西。不要像他们一样。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們對這個子的意見像風一樣變化。有一天，他們喜歡的東西\n另一天，他們討厭它，或者相反。問題是，他們中的大多數人都不知道自己在說什麼。\n他們甚至不知道自己在談論什麼。他們只是像綿羊一樣跟隨潮流，因爲他們\n因爲他們看到人們對他們的讚美。而所有的趨勢都是暫時的....",
      "title": "這個子上的大多數人都沒有自己的意見。他們只是重複當下流行的東西。不要像他們一樣。"
    }
  ]
}