{
  "author": "Nuewim",
  "original_created_utc": 1651495285,
  "title": "Warren Buffet is very old (91 years old) and very rich ($124 billion). We are neither, so his opinions about crypto shouldn't concern us too much.",
  "created_utc": 1651520291,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Warren Buffet was probably greatest investor in second half of XX century,  a legend of investing. He is still very rich, but most of his investments were made decades ago. He have his Coca Cola stock since 1980&amp;#39;s. He can do nothing at this point and he still become richer, simply cause companies he invest into grow whole time. If he would start from 0 today, his investing style wouldn&amp;#39;t be so successful. He would never become rich, cause he invest in safest, most traditional investments. Nothing fancy, cause he believe investments should be least risky ones he can find. Something that will always be necessary and won&amp;#39;t change in long term like fast foods or finances.&lt;/p&gt;\n\n&lt;p&gt;Many of us forget his main rule is to never invest in things he doesn&amp;#39;t understand. That is why he missed internet  boom in 1990&amp;#39;s. Later he admitted it was his biggest mistake. Why we treat people like  him as some infalliable prophets in everything? Just cause they are rich and great stock investors doesn&amp;#39;t mean they know everything. Buffet at this point  is  just very old man, born in different era. Before crypto, before internet, and even before mass popularity of TV and planes. He bought his first stock in 1941, during wwII, it was 80 years ago... His past success doesn&amp;#39;t mean he understand modern world anymore.&lt;/p&gt;\n\n&lt;p&gt;And come one, would you even bother to try understanding some new technology being bilionaire in his age? I wouldn&amp;#39;t even work, probably would spend my last years on some tropical island doing nothing. Defintely nothing would concern me at this point. It wouldn&amp;#39;t be my problem if crypto will be successful, what wars currently  happen somewhere far away etc.&lt;/p&gt;\n\n&lt;p&gt;Crypto is new technology, people that are now 80 or 90 years old: bankers, investors or politicians will die of old age in next maybe 10 years. But we will be left to live with all their mistakes they made. They should have enough dignity  to leave world in hand of young generations. They had their own time, very long time to change world. They failed and they want us to fail too. What they do against crypto won&amp;#39;t harm them today, it will harm us tomorrow. &lt;/p&gt;\n\n&lt;p&gt;Did someone already old and filthy rich like Buffet even need to care about crypto? Nope. Crypto succceed or crypto fail he won&amp;#39;t see it anyway. But all those young or middle class aged people that trust and believe him will lose their future thanks to those stupid anti crypto and anti Bitcoins rants of another old, rich man.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 319,
  "permalink": "/r/CryptoCurrency/comments/ugorfc/warren_buffet_is_very_old_91_years_old_and_very/",
  "subreddit": "CryptoCurrency",
  "id": "ugorfc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Warren Buffet was probably greatest investor in second half of XX century, a\nlegend of investing. He is still very rich, but most of his investments were\nmade decades ago. He have his Coca Cola stock since 1980's. He can do nothing at\nthis point and he still become richer, simply cause companies he…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ウォーレン・バフェットは、おそらく20世紀後半における最も偉大な投資家である。\n投資界の伝説的存在です。彼は今でも大金持ちですが、彼の投資のほとんどは数十年前に行われたものです。\n数十年前に行われたものです。彼は1980年代からコカ・コーラの株を持っている。彼はこの時点で何もしなくても\nこの時点では何もしなくても、彼はまだ金持ちになることができる。",
      "title": "ウォーレン・バフェットは非常に高齢（91歳）で、非常に金持ち（1240億ドル）です。私たちはどちらでもないので、暗号についての彼の意見はあまり気にする必要はないでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "沃伦-巴菲特可能是二十世纪下半叶最伟大的投资者，是投资界的一个传奇。\n投资界的传奇人物。他现在仍然非常富有，但他的大部分投资都是\n几十年前做的。他从1980年代就拥有可口可乐的股票。他现在什么也做不了\n而他仍然变得更加富有，只是因为他的公司...",
      "title": "沃伦-巴菲特非常老（91岁），非常富有（1240亿美元）。我们都不是，所以他对加密货币的意见不应该让我们太在意。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "沃倫-巴菲特可能是二十世紀下半葉最偉大的投資者，是投資界的一個傳奇。\n投資界的傳奇人物。他現在仍然非常富有，但他的大部分投資都是\n幾十年前做的。他從1980年代就擁有可口可樂的股票。他現在什麼也做不了\n而他仍然變得更加富有，只是因爲他的公司...",
      "title": "沃倫-巴菲特非常老（91歲），非常富有（1240億美元）。我們都不是，所以他對加密貨幣的意見不應該讓我們太在意。"
    }
  ]
}