{
  "author": "alfred_27",
  "original_created_utc": 1629454752,
  "title": "You could be that guy that loses his $100 in today's money in 10 years that could be worth $100,000, don't be that guy.",
  "created_utc": 1629491925,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Saw a lot of posts about how people who have invested many years ago after returning from hibernation or prison are unable to access their wallet by just losing their password or seed phrase or forgetting it.</p>\n\n<p>Even if it&#39;s a small amount now <strong>Just Secure it,</strong> over the years we will eventually move on with life, you will get married, get kids and Crypto  would take second stage you wouldn&#39;t care about it much with other commitments going on. In 10 years a lot can change, you could shift houses, change around 3 laptops, shift through 3 or more phones. Somewhere in between all this things are bound to get lost no matter how careful you think you are.</p>\n\n<p>Never store password or phrases online, if you use multiple exchanges get a small notebook and write them down and keep them safe, you may think <em>ahhh it&#39;s only 100 or so no one would even steal it</em> you&#39;re wrong. Treat even your small investments like big investments.</p>\n\n<p>Just wanted to bring this to all the newcomers to keep yourself and your money safe</p>\n</div><!-- SC_ON -->",
  "score": 342,
  "permalink": "/r/CryptoCurrency/comments/p82etf/you_could_be_that_guy_that_loses_his_100_in/",
  "subreddit": "CryptoCurrency",
  "id": "p82etf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Saw a lot of posts about how people who have invested many years ago after\nreturning from hibernation or prison are unable to access their wallet by just\nlosing their password or seed phrase or forgetting it.\n\nEven if it's a small amount now Just Secure it, over the years we will\neventually move on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "何年も前に投資をした人が、冬眠中や刑務所から戻ってきたときには\nパスワードやシードフレーズをなくしたり、忘れたりすることで\nパスワードやシードフレーズをなくしたり、忘れたりするだけで、自分の財布にアクセスできなくなってしまうという書き込みを多く見かけました。\n\n今は少額でも 確保しておけば、何年経っても\n何年か後には...",
      "title": "10年後には10万円の価値になるかもしれない今のお金で100ドルを失う、そんな男にならないように。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "看到很多关于多年前投资的人在休眠或入狱后如何\n从休眠状态或监狱回来后，无法进入他们的钱包，只是\n丢失他们的密码或种子短语或忘记它。\n\n即使现在是一个小数额，也要确保它，随着时间的推移，我们将\n最终会继续前进...",
      "title": "你可能会成为那个在10年内失去他今天的100美元的人，而这100美元可能价值10万美元，不要成为那个人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "看到很多關於多年前投資的人在休眠或入獄後如何\n從休眠狀態或監獄回來後，無法進入他們的錢包，只是\n丟失他們的密碼或種子短語或忘記它。\n\n即使現在是一個小數額，也要確保它，隨着時間的推移，我們將\n最終會繼續前進...",
      "title": "你可能會成爲那個在10年內失去他今天的100美元的人，而這100美元可能價值10萬美元，不要成爲那個人。"
    }
  ]
}