{
  "author": "Srdtrk",
  "original_created_utc": 1632469712,
  "title": "“cryptoasset” is a better word for cryptocurrencies",
  "created_utc": 1632493840,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Whenever I ask no-coiners how they feel about cryptocurrencies, they always mention that they don’t like them because they don’t think most people would adopt them as currencies. (It’s too volatile to be a currency and etc.)</p>\n\n<p>I really think best and most useful applications of cryptocurrencies are not as currencies. I think currently the most useful projects are projects such as Mirror Protocol, Terra, privacy coins (Monero and Secret Network or any other privacy project with private smart contracts), Ethereum and etc. because all of these projects currently can be used to solve difficult real world problems. Such as owning foreign stocks (Mirror), or having a trustless stablecoin (Terra), financial privacy, money laundering (which I’m not endorsing), trustless asset swaps, and innovative financial apps (Ethereum).</p>\n\n<p>I think all of these use cases can be summarized by the word “cryptoassets”. And I think most people and companies  think of bitcoin as an asset anyway.</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/CryptoCurrency/comments/puf0kv/cryptoasset_is_a_better_word_for_cryptocurrencies/",
  "subreddit": "CryptoCurrency",
  "id": "puf0kv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Whenever I ask no-coiners how they feel about cryptocurrencies, they always\nmention that they don’t like them because they don’t think most people would\nadopt them as currencies. (It’s too volatile to be a currency and etc.)\n\nI really think best and most useful applications of cryptocurrencies are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ノーコイナーに暗号通貨についての感想を聞くと、必ずと言っていいほど\n多くの人が通貨として採用するとは思えないから好きではない」と答えます。\n通貨として採用しないと思うから嫌だ」と言います。(通貨にするにはボラティリティが高すぎる、など)\n\n私が思うに、暗号通貨の最善かつ最も有用なアプリケーションは...。",
      "title": "\"cryptoasset \"は、暗号通貨のより良い言葉です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每当我问无币者他们对加密货币的感受时，他们总是\n他们总是提到，他们不喜欢它们，因为他们认为大多数人不会把它们当作\n采用它们作为货币。(它的波动性太大，不能成为货币等等)\n\n我真的认为加密货币最好和最有用的应用是...",
      "title": "\"cryptoasset \"是加密货币的一个更好的词"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每當我問無幣者他們對加密貨幣的感受時，他們總是\n他們總是提到，他們不喜歡它們，因爲他們認爲大多數人不會把它們當作\n採用它們作爲貨幣。(它的波動性太大，不能成爲貨幣等等)\n\n我真的認爲加密貨幣最好和最有用的應用是...",
      "title": "\"cryptoasset \"是加密貨幣的一個更好的詞"
    }
  ]
}