{
  "author": "Equal_Ad1687",
  "original_created_utc": 1658923632,
  "title": "When did musical theater become “gay” in public opinion?",
  "created_utc": 1658947825,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey, I hope I worded this question ok. I don’t mean any shame towards any LGBT people, I was just curious. A lot of folks these days will automatically assume a man is gay because he is into musical theater, why is that? It seemed like the male musical stars of the 20th century such as Dick Van Dyke and Gene Kelly weren’t harassed about their sexualities. I’m a straight man who loves musical theater, yet I’ve had a dozen people assume I’m gay or something because of that. Why is that? Like I said, no shame to those who are gay, I just wanna know why people are so quick to assume that about men like myself.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/w9d16j/when_did_musical_theater_become_gay_in_public/",
  "subreddit": "NoStupidQuestions",
  "id": "w9d16j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hey, I hope I worded this question ok. I don’t mean any shame towards any LGBT\npeople, I was just curious. A lot of folks these days will automatically assume\na man is gay because he is into musical theater, why is that? It seemed like the\nmale musical stars of the 20th century such as Dick Van…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ヘイ、この質問をうまく表現できたかな？LGBTの方々を辱めるつもりはありません。\nただ気になっただけなんだ。最近、多くの人々が、自動的に\nなぜなのでしょうか？それはなぜですか？\n20世紀の男性ミュージカルスター、例えばディック・ヴァン...",
      "title": "ミュージカル劇場が世間で「ゲイ」と言われるようになったのは、いつ頃からでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，我希望我对这个问题的措辞是正确的。我没有任何羞辱任何LGBT\n人，我只是感到好奇。现在很多人都会自动假定\n一个男人是同性恋，因为他喜欢音乐剧，这是为什么？这似乎是\n20世纪的男性音乐剧明星，如迪克-范-哈特（Dick Van...",
      "title": "音乐剧何时在公众舆论中成为 \"同性恋\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，我希望我對這個問題的措辭是正確的。我沒有任何羞辱任何LGBT\n人，我只是感到好奇。現在很多人都會自動假定\n一個男人是同性戀，因爲他喜歡音樂劇，這是爲什麼？這似乎是\n20世紀的男性音樂劇明星，如迪克-範-哈特（Dick Van...",
      "title": "音樂劇何時在公衆輿論中成爲 \"同性戀\"？"
    }
  ]
}