{
  "author": "SpeedoMeter21",
  "original_created_utc": 1624441984,
  "title": "I asked my interviewer what was her proudest moment in this company?",
  "created_utc": 1624453164,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The interview went very well and she was satisfied with most of my answers and was laughing as well on some of my replies as she thought that I am funny, but when she asked me whether I have any questions I asked her what was her proudest moment in this company? </p>\n\n<p>She replied, it&#39;s like I am giving an interview and then laughed and thought for a second and give me the answer.</p>\n\n<p>After that she asked if I had another interview questions, I told her I am sorry if it was too lengthy to ask. </p>\n\n<p>Do you think what I have asked is appropriate  or  should I haven&#39;t asked that?</p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/NoStupidQuestions/comments/o69nu8/i_asked_my_interviewer_what_was_her_proudest/",
  "subreddit": "NoStupidQuestions",
  "id": "o69nu8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The interview went very well and she was satisfied with most of my answers and\nwas laughing as well on some of my replies as she thought that I am funny, but\nwhen she asked me whether I have any questions I asked her what was her proudest\nmoment in this company?\n\nShe replied, it's like I am giving…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "インタビューは非常にうまくいき、彼女は私の回答のほとんどに満足してくれました。\n私が面白いと思ってくれたのか、いくつかの回答では笑っていました。\n何か質問があるかと聞かれたので、「この会社で一番誇れることは何ですか？\nこの会社で一番誇れる瞬間は？\n\nと聞くと、彼女は「私が与えているような...」と答えた。",
      "title": "私は面接官に「この会社で一番誇れることは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "面试进行得非常顺利，她对我的大部分回答都很满意，而且对我的一些回答还笑了，因为她认为我很幽默。\n她对我的一些回答很满意，因为她认为我很幽默。\n当她问我是否有任何问题时，我问她，她在这家公司最自豪的时刻是什么？\n的时刻？\n\n她回答说，这就像我在给...",
      "title": "我问我的面试官，她在这家公司最自豪的时刻是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "面試進行得非常順利，她對我的大部分回答都很滿意，而且對我的一些回答還笑了，因爲她認爲我很幽默。\n她對我的一些回答很滿意，因爲她認爲我很幽默。\n當她問我是否有任何問題時，我問她，她在這家公司最自豪的時刻是什麼？\n的時刻？\n\n她回答說，這就像我在給...",
      "title": "我問我的面試官，她在這家公司最自豪的時刻是什麼？"
    }
  ]
}