{
  "author": "Putrid_Ambition3128",
  "original_created_utc": 1628797671,
  "title": "PSA:-If you have any Tether get rid of it ASAP",
  "created_utc": 1628832636,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A paper published by Tether itself reports that only 10% of its stablecoin assets are backed by cash. And even though this is an improvement from 3%in May, this is still highly concerning. And this leaving aside the immense legal challenges it faces in the days to come ahead</p>\n\n<p>There are a lot of extremely good stablecoins out there backed by solid projects.Invest in them</p>\n\n<p>If you still hold Tether please remove it from your portfolio before its too late.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/p37bul/psaif_you_have_any_tether_get_rid_of_it_asap/",
  "subreddit": "CryptoCurrency",
  "id": "p37bul",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A paper published by Tether itself reports that only 10% of its stablecoin\nassets are backed by cash. And even though this is an improvement from 3%in May,\nthis is still highly concerning. And this leaving aside the immense legal\nchallenges it faces in the days to come ahead\n\nThere are a lot of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "テザー社が発表した論文によると、同社のステーブルコインの10％しか\nの資産のうち、現金の裏付けがあるのは10％にすぎないと報告しています。そして、これは5月の3％から改善されているにもかかわらず。\nこれは5月の3％から改善されたとはいえ、非常に気になるところです。また、テザー社が今後直面する膨大な法的課題はさておき\nこの先、同社が直面する膨大な法的課題はさておき\n\nたくさんの...",
      "title": "PSA:-もしもテザーを持っていたら、すぐにそれを取り除くこと。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Tether自己发表的一篇论文报告说，其稳定币中只有10%的\n资产是由现金支持的。尽管这比5月份的3%有所提高。\n但这仍然是非常令人担忧的。而且，撇开它在未来几天面临的巨大法律挑战不谈\n它在未来的日子里所面临的挑战\n\n有很多...",
      "title": "PSA:-如果你有任何Tether，请尽快摆脱它。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Tether自己發表的一篇論文報告說，其穩定幣中只有10%的\n資產是由現金支持的。儘管這比5月份的3%有所提高。\n但這仍然是非常令人擔憂的。而且，撇開它在未來幾天面臨的巨大法律挑戰不談\n它在未來的日子裏所面臨的挑戰\n\n有很多...",
      "title": "PSA:-如果你有任何Tether，請儘快擺脫它。"
    }
  ]
}