{
  "author": "tac0b3lld3bat3",
  "the_new_excerpt": "A few months ago, there was a meme about how all of the COVID virus in the world\nwould be able to fit into a tablespoon, and the meme was about someone eating it\n(very silly, yes). But that got me thinking about what would happen if that was\npossible. Does more exposure to a virus cause you to get…",
  "original_created_utc": 1617325043,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "几个月前，有一个备忘录，关于世界上所有的COVID病毒如何？\n将能够装入一汤匙，和备忘录是关于有人吃它。\n(很傻，是的)。但是，这让我想到了会发生什么，如果那是。\n可能的。多接触病毒会不会导致你得...",
      "title": "多接触病毒会不会生病？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾個月前，有一個備忘錄，關於世界上所有的COVID病毒如何？\n將能夠裝入一湯匙，和備忘錄是關於有人喫它。\n(很傻，是的)。但是，這讓我想到了會發生什麼，如果那是。\n可能的。多接觸病毒會不會導致你得...",
      "title": "多接觸病毒會不會生病？"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "数ヶ月前、「世界中のCOVIDウイルスは\n大さじ1杯に収まり、それを誰かが食べるというミームがありました。\nとても馬鹿げていますね）。しかし、もしそれが可能であれば、何が起こるのかを考えました。\nと考えるようになりました。ウイルスに触れる機会が増えると、ウイルスに感染してしまうのでしょうか？",
      "title": "ウィルスにたくさん感染すると病気になるのか？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "数ヶ月前、「世界中のCOVIDウイルスは\n大さじ1杯に収まり、それを誰かが食べるというミームがありました。\nとても馬鹿げていますね）。しかし、もしそれが可能であれば、何が起こるのかを考えました。\nと考えるようになりました。ウイルスに触れる機会が増えると、ウイルスに感染してしまうのでしょうか？",
      "title": "ウィルスにたくさん感染すると病気になるのか？"
    }
  ],
  "title": "Does more exposure to a virus make you sicker?",
  "created_utc": 1617335248,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A few months ago, there was a meme about how all of the COVID virus in the world would be able to fit into a tablespoon, and the meme was about someone eating it (very silly, yes). But that got me thinking about what would happen if that was possible. Does more exposure to a virus cause you to get sicker, or would the immune response be the same? Maybe as a side question, would the person from the meme (assuming they were healthy and wouldn&#39;t have died from COVID normally) have died from that much exposure?</p>\n</div><!-- SC_ON -->",
  "score": 121,
  "permalink": "/r/askscience/comments/mi9ffy/does_more_exposure_to_a_virus_make_you_sicker/",
  "subreddit": "askscience",
  "id": "mi9ffy",
  "is_self": true,
  "media": null,
  "is_video": false
}