{
  "author": "Longjumping_Tax_3660",
  "original_created_utc": 1632574985,
  "title": "Do other men feel jealous/uncomfortable when their girlfriends check other men out ?",
  "created_utc": 1632588921,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am a man and feel that way. I wanted to know if other men were like me because if I can find plenty of women complaining about their man looking at other women, I don&#39;t find much of the opposite.</p>\n\n<p>Edit : Do you think the time, place and who it is make a difference (in media, stranger in the street, shop clerk, stranger in a pub/ club, athlete in an event, friend, colleague, stripper in a club, etc.) ?</p>\n</div><!-- SC_ON -->",
  "score": 116,
  "permalink": "/r/TooAfraidToAsk/comments/pv6ct3/do_other_men_feel_jealousuncomfortable_when_their/",
  "subreddit": "TooAfraidToAsk",
  "id": "pv6ct3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am a man and feel that way. I wanted to know if other men were like me because\nif I can find plenty of women complaining about their man looking at other\nwomen, I don't find much of the opposite.\n\nEdit : Do you think the time, place and who it is make a difference (in media,\nstranger in the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は男性であり、そのように感じています。他の男性も私と同じようなことをしているのか知りたかったのです。\n男性が他の女性を見ていることに不満を持っている女性はたくさんいますが\n私は他の男性が私と同じように感じているのか知りたかったのです。\n\n編集部：時と場所と相手によって違いがあると思いますか（メディアの場合。\n知らない人が...。",
      "title": "他の男性は、自分のガールフレンドが他の男性をチェックしているときに、嫉妬や不快感を感じますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个男人，有这样的感觉。我想知道其他男人是否和我一样，因为\n如果我可以找到很多女人抱怨她们的男人在看别的女人\n我并没有发现很多相反的情况。\n\n编辑：你认为时间、地点和对象有区别吗（在媒体。\n陌生人在...",
      "title": "当他们的女朋友检查其他男人的时候，其他男人是否感到嫉妒/不舒服？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個男人，有這樣的感覺。我想知道其他男人是否和我一樣，因爲\n如果我可以找到很多女人抱怨她們的男人在看別的女人\n我並沒有發現很多相反的情況。\n\n編輯：你認爲時間、地點和對象有區別嗎（在媒體。\n陌生人在...",
      "title": "當他們的女朋友檢查其他男人的時候，其他男人是否感到嫉妒/不舒服？"
    }
  ]
}