{
  "author": "Big-Pear-15",
  "original_created_utc": 1654145117,
  "title": "Do you ever feel like picking a fight with rude commenters because you’re just so fucking done?",
  "created_utc": 1654199642,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes I post because I’m desperate and need advice on something or need to talk to someone or whatever the fuck and there’s always someone that come with arrogance ready to ruin your already bad day. &lt;/p&gt;\n\n&lt;p&gt;I had made a post about having just feeling anxious about a new dog we got and just figure out how to cope with my emotions and I was told that my emotional turmoils have nothing to do with the dog and I was a bad owner. I want to drag this person through the mud and make them eat shit and I know it’s an exaggeration but I’m so fucking tired.&lt;/p&gt;\n\n&lt;p&gt;I don’t have anyone to fucking talk to and coming here or other subs to vent or get advice eus just begging a lot of assholes to insult you for no reason. It’s just tiring…especially when you’re so separate for advice and instead are met with rude people \nIt’s 1 in the morning and I’m very tired and frustrated and angry and just sick of people&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/v30ycm/do_you_ever_feel_like_picking_a_fight_with_rude/",
  "subreddit": "TooAfraidToAsk",
  "id": "v30ycm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Sometimes I post because I’m desperate and need advice on something or need to\ntalk to someone or whatever the fuck and there’s always someone that come with\narrogance ready to ruin your already bad day.\n\nI had made a post about having just feeling anxious about a new dog we got and\njust figure out…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "時々、必死になって何かアドバイスが必要なときや、必要なときに投稿しています。\nという時に、いつも横柄な態度の人がいて、せっかくの嫌な日を台無しにされる。\n傲慢な人がいて、せっかくの悪い日を台無しにされる。\n\n私は、新しく飼い始めた犬について不安を感じているという投稿をしたことがあります。\nただ、わかったのは...",
      "title": "無礼なコメンテーターに喧嘩を売りたくなるのは、自分があまりにクソだから？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有时我发帖是因为我很绝望，需要一些建议或者需要\n谈话或什么的，但总有一些人带着傲慢的态度来\n傲慢的态度准备毁掉你已经糟糕的一天。\n\n我曾发过一个帖子，说是对我们新买的狗感到焦虑，然后就发现......。\n就想出了...",
      "title": "你是否曾经觉得要和无礼的评论者挑衅，因为你就是这么他妈的完了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有時我發帖是因爲我很絕望，需要一些建議或者需要\n談話或什麼的，但總有一些人帶着傲慢的態度來\n傲慢的態度準備毀掉你已經糟糕的一天。\n\n我曾發過一個帖子，說是對我們新買的狗感到焦慮，然後就發現......。\n就想出了...",
      "title": "你是否曾經覺得要和無禮的評論者挑釁，因爲你就是這麼他媽的完了？"
    }
  ]
}