{
  "author": "No-Masterpiece-397",
  "original_created_utc": 1660788704,
  "title": "What to do when you’re a hopeless romantic but today’s society isn’t?",
  "created_utc": 1660812625,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m a 23F and I have yet to experience love - the last time I “dated” was when I was 19 years old. I turn 24 in a month.&lt;/p&gt;\n\n&lt;p&gt;Now let me explain. I really love the idea of writing love letters and going on dates, writing love poems, etc. You get the point. The problem is I honestly do not like hookup culture - it’s not my cup of tea and I’d rather refrain from partaking in it. I’m not judging anyone who enjoys it - it’s just not for me.&lt;/p&gt;\n\n&lt;p&gt;I feel like a bit immature with these thoughts as everyone else I speak to about these things generally say things along the lines of  “that’s not the world we live in today” or “stop day dreaming and get real”. &lt;/p&gt;\n\n&lt;p&gt;This makes me a bit sad. I enjoy hearing stories how other people met their significant others but for me …. I feel like I’ll never get to experience that. I know life is unpredictable but still….&lt;/p&gt;\n\n&lt;p&gt;My apologies, I guess this was more or less me venting haha.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/TooAfraidToAsk/comments/wr74ei/what_to_do_when_youre_a_hopeless_romantic_but/",
  "subreddit": "TooAfraidToAsk",
  "id": "wr74ei",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m a 23F and I have yet to experience love - the last time I “dated” was when I\nwas 19 years old. I turn 24 in a month.\n\nNow let me explain. I really love the idea of writing love letters and going on\ndates, writing love poems, etc. You get the point. The problem is I honestly do\nnot like hookup…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は23Fですが、まだ恋愛経験がありません。最後に「デート」したのは、この時です。\n19歳の時です。あと1ヶ月で24歳になります。\n\nさて、説明しましょう。私はラブレターを書いたり、デートをしたり、愛の詩を書いたりするのがとても好きです。\nデートをしたり、愛の詩を書いたり。要点はお分かりでしょう。問題は、私は正直言って\nフックアップは好きではありません...",
      "title": "あなたが絶望的なロマンチストでも、現代社会がそうでないときはどうすればいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个23岁的女性，我还没有经历过爱情--我最后一次 \"约会 \"是在我\n19岁时。再过一个月我就24岁了。\n\n现在让我解释一下。我真的很喜欢写情书和约会的想法\n日期，写情诗，等等。你明白我的意思。问题是我真的不\n不喜欢勾搭...",
      "title": "当你是一个无可救药的浪漫主义者，但今天的社会却不是这样，该怎么办呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個23歲的女性，我還沒有經歷過愛情--我最後一次 \"約會 \"是在我\n19歲時。再過一個月我就24歲了。\n\n現在讓我解釋一下。我真的很喜歡寫情書和約會的想法\n日期，寫情詩，等等。你明白我的意思。問題是我真的不\n不喜歡勾搭...",
      "title": "當你是一個無可救藥的浪漫主義者，但今天的社會卻不是這樣，該怎麼辦呢？"
    }
  ]
}