{
  "author": "Diatery",
  "original_created_utc": 1624746680,
  "title": "Why are we allowing governments an opinion in crypto?",
  "created_utc": 1624811800,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You read about it everyday. This region banned this exchange. This region made this illegal. And so on.</p>\n\n<p>Where the fuck is the cypherpunk leadership to stop this?  Here&#39;s wht I am waiting for:</p>\n\n<ol>\n<li><p>A DAO starts registering citizenship on a random piece of space debris. Anyone holding crypto gets a passport.</p></li>\n<li><p>All CEXs are granted business licenses there with fiat onramps. </p></li>\n</ol>\n\n<p>What, is it illegal now to trade with aliens? Eat a gray whigged dick</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/o8kl2f/why_are_we_allowing_governments_an_opinion_in/",
  "subreddit": "CryptoCurrency",
  "id": "o8kl2f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "You read about it everyday. This region banned this exchange. This region made\nthis illegal. And so on.\n\nWhere the fuck is the cypherpunk leadership to stop this? Here's wht I am\nwaiting for:\n\n 1. A DAO starts registering citizenship on a random piece of space debris.\n    Anyone holding crypto gets…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "毎日のように読んでいますね。この地域はこの交換を禁止した。この地域では\nこれは違法だ。などなど。\n\nこれを止めるサイファーパンクのリーダーシップは一体どこにあるのでしょうか？私が待っているのはここからです。\n待っていることがあります。\n\n 1. DAOが市民権を登録し始めるランダムなスペースデブリの破片に。\n    暗号を持っている人は誰でも...",
      "title": "なぜ、政府が暗号に意見を述べることを認めるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你每天都能看到这样的消息。这个地区禁止了这种交流。这个地区把\n这是不合法的。等等。\n\n他妈的赛博朋克的领导层在哪里阻止这一切？这就是我所期待的\n等待的。\n\n 1. 一个DAO开始在一块随机的空间碎片上登记公民身份。\n    任何持有加密货币的人都可以...",
      "title": "为什么我们允许政府在加密货币方面有意见？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你每天都能看到這樣的消息。這個地區禁止了這種交流。這個地區把\n這是不合法的。等等。\n\n他媽的賽博朋克的領導層在哪裏阻止這一切？這就是我所期待的\n等待的。\n\n 1. 一個DAO開始在一塊隨機的空間碎片上登記公民身份。\n    任何持有加密貨幣的人都可以...",
      "title": "爲什麼我們允許政府在加密貨幣方面有意見？"
    }
  ]
}