{
  "author": "zebdebleblol",
  "original_created_utc": 1626970831,
  "title": "Bought ETH at $4200 and BTC at $56,000.",
  "created_utc": 1627015322,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m the only expert you need to take advice from. I bought these two coins at their peak so I obviously am the guru you need to follow. I didn&#39;t buy these two coins because of FOMO but because I believe in them (yes, 100% copium).  </p>\n\n<p>The moment I placed my order, the entire market went tumbling down and hasn&#39;t recovered since. So the new investors, you know whom to be grateful too. Long time investors, please forgive me.</p>\n\n<p>Jokes apart...it has been painful to see the market fall the way it has. Yes, I still hold the coins and plan to HODL for 5 years. The more I read about the these coins l, the more it feels like it&#39;s mass acceptance is inevitable.</p>\n\n<p>Anyone reading this who hasn&#39;t invested in crypto but plans to ..please take the time to do your research. You might not be able to predict if the price is going to go up or down, but you will be confident in your investment and hodling and be able to make a profit out of it.</p>\n\n<p>Edit: appreciate all the upliftment and friendly banter. I wasn&#39;t feeling or anything. Just wanted to share my experience for a few laughs. Thank you everyone</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/oph8a1/bought_eth_at_4200_and_btc_at_56000/",
  "subreddit": "CryptoCurrency",
  "id": "oph8a1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm the only expert you need to take advice from. I bought these two coins at\ntheir peak so I obviously am the guru you need to follow. I didn't buy these two\ncoins because of FOMO but because I believe in them (yes, 100% copium).\n\nThe moment I placed my order, the entire market went tumbling down…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あなたがアドバイスを受けなければならない唯一の専門家は私です。私はこの2枚のコインを\n私はこの2つのコインをピーク時に買ったので、あなたが従うべきグルであることは明らかです。私がこの2つのコインを買ったのは\n私がこの2つのコインを買ったのは、FOMOのためではなく、それらを信じているからです（はい、100％コピペです）。\n\n私が注文を出した瞬間、市場全体が暴落しました...。",
      "title": "ETHを4200ドルで、BTCを56000ドルで購入。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是你唯一需要听取建议的专家。我在这两枚硬币的高峰期买入\n所以我显然是你需要遵循的大师。我没有买这两个\n币，而是因为我相信它们（是的，100%相信）。\n\n在我下单的那一刻，整个市场跌宕起伏......",
      "title": "在4200美元买入ETH，在56000美元买入BTC。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是你唯一需要聽取建議的專家。我在這兩枚硬幣的高峯期買入\n所以我顯然是你需要遵循的大師。我沒有買這兩個\n幣，而是因爲我相信它們（是的，100%相信）。\n\n在我下單的那一刻，整個市場跌宕起伏......",
      "title": "在4200美元買入ETH，在56000美元買入BTC。"
    }
  ]
}