{
  "author": "UnexperiencedIT",
  "original_created_utc": 1638959898,
  "title": "Earlier this year this sub was filled with shitcoins shill. I was always against it but I am curious. So, people who got in shitcoins earlier this year, how did it work out for you?",
  "created_utc": 1638977642,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Disclaimer: I am not supporter of shitcoins, I need to repeat this multiple times because I think that people won&amp;#39;t believe me. So, no I don&amp;#39;t plan to buy, hold or own any memecoin and shitcoin. I think I hold good projects that I won&amp;#39;t mention here because people will think that I am shilling them. I am bullish, well I am at loss on some, but bullish on most of them.&lt;/p&gt;\n\n&lt;p&gt;So basically I am just curious. How did it work out for you? &lt;/p&gt;\n\n&lt;p&gt;Do you regret for getting into it?&lt;/p&gt;\n\n&lt;p&gt;You own your money, it is your decision where do you want to invest, not mine, and I won&amp;#39;t preach if that is good or bad, I am staying out of it for multiple reasons.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/rbojo3/earlier_this_year_this_sub_was_filled_with/",
  "subreddit": "CryptoCurrency",
  "id": "rbojo3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Disclaimer: I am not supporter of shitcoins, I need to repeat this multiple\ntimes because I think that people won't believe me. So, no I don't plan to buy,\nhold or own any memecoin and shitcoin. I think I hold good projects that I won't\nmention here because people will think that I am shilling…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "免責事項：私は糞コインの支持者ではありません、私はこれを何度も繰り返す必要があります。\nというのは、みんな信じてくれないと思うからです。だから、私は買うつもりはない。\nミームコインやシットコインを保有したり、所有したりすることはありません。私は良いプロジェクトを持っていると思います。\nここで紹介するとシラケてると思われそうなので...。",
      "title": "今年の初め、このサブはシットコイン・シルで埋め尽くされていた。私はずっと反対していましたが、気になりますね。今年の初めにshitcoinsに入った人たち、どうだった？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "免责声明：我不是狗屎币的支持者，我需要多次重复这一点，因为我认为人们不会相信我。\n因为我认为人们不会相信我。所以，不，我不打算购买。\n持有或拥有任何美墨币和屎币。我认为我持有好的项目，我不会\n因为人们会认为我在骗人......",
      "title": "今年早些时候，这个子里充满了狗屎币的虚假。我一直反对这样做，但我很好奇。那么，今年早些时候进了狗屎币的人，对你来说效果如何？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "免責聲明：我不是狗屎幣的支持者，我需要多次重複這一點，因爲我認爲人們不會相信我。\n因爲我認爲人們不會相信我。所以，不，我不打算購買。\n持有或擁有任何美墨幣和屎幣。我認爲我持有好的項目，我不會\n因爲人們會認爲我在騙人......",
      "title": "今年早些時候，這個子裏充滿了狗屎幣的虛假。我一直反對這樣做，但我很好奇。那麼，今年早些時候進了狗屎幣的人，對你來說效果如何？"
    }
  ]
}