{
  "author": "tidddyfricker",
  "the_new_excerpt": "The number of ordinary people I know who in the past month who've opened a\nbrokerage account is ridiculous. Stock tips have inundated Tik Tok, Snap Chat,\nand instagram. There are literal fitness influencers on YouTube who are now\nmaking videos showcasing their 4-figure portfolios and trying to teach…",
  "original_created_utc": 1612414612,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我认识的普通人中，在过去的一个月里，有多少人开过\n经纪人账户是荒谬的。股票技巧已经充斥在Tik Tok、Snap Chat中。\n和instagram。YouTube上有字面意思的健身影响者，他们现在是\n制作视频展示他们4位数的投资组合，并试图教... ...",
      "title": "下一次的崩盘将被归咎于散户/傻钱。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認識的普通人中，在過去的一個月裏，有多少人開過\n經紀人賬戶是荒謬的。股票技巧已經充斥在Tik Tok、Snap Chat中。\n和instagram。YouTube上有字面意思的健身影響者，他們現在是\n製作視頻展示他們4位數的投資組合，並試圖教... ...",
      "title": "下一次的崩盤將被歸咎於散戶/傻錢。"
    }
  ],
  "title": "The next crash will be blamed on retail investors/dumb money",
  "created_utc": 1612438838,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The number of ordinary people I know who in the past month who&#39;ve opened a brokerage account is ridiculous. Stock tips have inundated Tik Tok, Snap Chat, and instagram. There are literal fitness influencers on YouTube who are now making videos showcasing their 4-figure portfolios and trying to teach people how to invest. Enthusiasm surrounding the market has never been this high or accessible. This is literally a re-hash of the Kennedy shoe shine boy indicator.</p>\n\n<p>Once institutional money moves out of the market/ interest rates return to normal, these people are going to sell fast, and it will be ugly. Morning shows will blame non-commission brokerages and amateur retail investors.</p>\n</div><!-- SC_ON -->",
  "score": 638,
  "permalink": "/r/stocks/comments/lc7znl/the_next_crash_will_be_blamed_on_retail/",
  "subreddit": "stocks",
  "id": "lc7znl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123200910
}