{
  "author": "Chicano_Ducky",
  "the_new_excerpt": "I find these rules to be really strange, especially when compared to other\nempires like it like the Roman Empire.\n\nWhat exactly was the reasoning behind these rules? Why step on shit? Why would\nthe owner and his family be the only ones allowed to chase the escapee and\neveryone else were to be…",
  "original_created_utc": 1614664057,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我发现这些规则真的很奇怪，尤其是与其他的\n像罗马帝国这样的帝国。\n\n这些规则背后的理由到底是什么？为什么要踩到狗屎？为什么要\n只有主人和他的家人才可以追捕逃犯，并且；\n其他人都要...",
      "title": "我读到，如果阿兹特克奴隶从主人那里逃脱，踩到排泄物，就会获得自由。在逃跑的过程中，除了主人和他的亲属之外，没有人可以追逐奴隶，否则他们会受到惩罚。这些都是真的吗，如果是的话，这些奇怪的规则是否有宗教原因？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我發現這些規則真的很奇怪，尤其是與其他的\n像羅馬帝國這樣的帝國。\n\n這些規則背後的理由到底是什麼？爲什麼要踩到狗屎？爲什麼要\n只有主人和他的家人才可以追捕逃犯，並且；\n其他人都要...",
      "title": "我讀到，如果阿茲特克奴隸從主人那裏逃脫，踩到排泄物，就會獲得自由。在逃跑的過程中，除了主人和他的親屬之外，沒有人可以追逐奴隸，否則他們會受到懲罰。這些都是真的嗎，如果是的話，這些奇怪的規則是否有宗教原因？"
    }
  ],
  "title": "I read that if Aztec slaves escaped from the master and stepped on excrement, it would grant freedom. During the escape, no one but the owner and his kin was allowed to chase the slave else they would be punished. Is any of this true and if so, was it a religious reason for these strange rules?",
  "created_utc": 1614678641,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I find these rules to be really strange, especially when compared to other empires like it like the Roman Empire.</p>\n\n<p>What exactly was the reasoning behind these rules? Why step on shit? Why would the owner and his family be the only ones allowed to chase the escapee and everyone else were to be punished?</p>\n\n<p>Similarly, if the slaves were mostly indentured servants meant to pay off debts as ordered by a court of law, would that also wipe the debt as well?</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/lvv2f4/i_read_that_if_aztec_slaves_escaped_from_the/",
  "subreddit": "AskHistorians",
  "id": "lvv2f4",
  "is_self": true,
  "media": null,
  "is_video": false
}