{
  "author": "navi_911",
  "original_created_utc": 1657844941,
  "title": "A professor of mine claimed that oil was the root cause of WWI due to the railroad between Baghdad and Berlin. Also they claimed that Franz Ferdinand was a pawn in that plan to get the railroad completed. Is there any truth to this claim?",
  "created_utc": 1657867553,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;To go more in detail, my professor stated that Germany wanted oil in Mesopotamia, and the Ottoman&amp;#39;s had the best avenue for that control. So a proposed railroad was the way for Germany (plus Austria-Hungary) to get the oil. However, Serbia did not wish for Austria-Hungary to gain even more influence over them and fought against the railroad being built. To suppress Serbia, Franz Ferdinand would be sent there (unbeknownst to him) and killed, sparking a &amp;quot;regional war&amp;quot; where Serbia would lose and the railroad could be built. &lt;/p&gt;\n\n&lt;p&gt;How factual is this claim? I always saw it as a complex web of nationalistic attitudes rather a resource grab. Am I wrong?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/AskHistorians/comments/vzaw1g/a_professor_of_mine_claimed_that_oil_was_the_root/",
  "subreddit": "AskHistorians",
  "id": "vzaw1g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "To go more in detail, my professor stated that Germany wanted oil in\nMesopotamia, and the Ottoman's had the best avenue for that control. So a\nproposed railroad was the way for Germany (plus Austria-Hungary) to get the oil.\nHowever, Serbia did not wish for Austria-Hungary to gain even more…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もっと詳しく言うと、教授は「ドイツは石油を欲しがっている」と述べた。\nオスマントルコはその支配のための最良の道であった。だから\nドイツ（＋オーストリア・ハンガリー）が石油を手に入れる方法として提案されたのが鉄道だったのです。\nしかし、セルビアはオーストリア・ハンガリーがさらに利益を得ることを望まなかった...。",
      "title": "私の教授が、バグダッドとベルリンを結ぶ鉄道のために、石油が第一次世界大戦の根本原因だと主張しました。また、フランツ・フェルディナンドはその鉄道を完成させる計画の手先であったと主張しています。この主張には真実味があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "更详细地说，我的教授说，德国想要的石油在\n美索不达米亚的石油，而奥斯曼帝国拥有控制石油的最佳途径。因此，一条\n建议的铁路是德国（加上奥匈帝国）获得石油的途径。\n然而，塞尔维亚并不希望奥匈帝国获得更多的石油。",
      "title": "我的一位教授声称，由于巴格达和柏林之间的铁路，石油是一战的根本原因。他们还声称，弗兰兹-斐迪南是该计划中的一颗棋子，以使铁路完工。这种说法有道理吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "更詳細地說，我的教授說，德國想要的石油在\n美索不達米亞的石油，而奧斯曼帝國擁有控制石油的最佳途徑。因此，一條\n建議的鐵路是德國（加上奧匈帝國）獲得石油的途徑。\n然而，塞爾維亞並不希望奧匈帝國獲得更多的石油。",
      "title": "我的一位教授聲稱，由於巴格達和柏林之間的鐵路，石油是一戰的根本原因。他們還聲稱，弗蘭茲-斐迪南是該計劃中的一顆棋子，以使鐵路完工。這種說法有道理嗎？"
    }
  ]
}