{
  "author": "ride_me_like_u_care",
  "the_new_excerpt": "I don’t have a “career” mentality. I work as a manager in a small firm and I do\nthe bare minimum amount of work, I show up late, I have no desire to “advance”,\nI don’t do any of the things the other colleagues do to kiss ass.\n\nI have developed a new mental trick where I don’t take my coat off at…",
  "original_created_utc": 1615918680,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我没有 \"事业 \"的心态。我在一家小公司做经理，我做的是\n最起码的工作，我迟到了，我没有 \"进步 \"的欲望。\n我不做任何事情 其他同事做拍马屁。\n\n我开发了一个新的心理技巧，我不脱外套，在...",
      "title": "加密技术让我不再关心我的事业"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我沒有 \"事業 \"的心態。我在一家小公司做經理，我做的是\n最起碼的工作，我遲到了，我沒有 \"進步 \"的慾望。\n我不做任何事情 其他同事做拍馬屁。\n\n我開發了一個新的心理技巧，我不脫外套，在...",
      "title": "加密技術讓我不再關心我的事業"
    }
  ],
  "title": "Crypto made me stop caring about my career",
  "created_utc": 1615930521,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don’t have a “career” mentality. I work as a manager in a small firm and I do the bare minimum amount of work, I show up late, I have no desire to “advance”, I don’t do any of the things the other colleagues do to kiss ass.</p>\n\n<p>I have developed a new mental trick where I don’t take my coat off at work all day, it helps me mentally frame my job as something I have to do real quick before my real day starts, it just feels like I’m running an errand or something. I don’t view it as the focal point of my day, it’s just an annoyance I have to put up with for now.</p>\n\n<p>I don’t understand the “career” mentality. I see people getting their masters in an attempt to work their way up, I see them trying to pad their resumes to fit the next level on the wager totem pole, I just can’t fathom why this is so important to them. They spend their hard earned money on expensive nice clothes and haircuts and other flashy things to signal their wagie status. Don’t they want out? What’s the point of all of this nonsense?    </p>\n\n<p>Crypto is literally taking me out of this wage slaving hell and I just wish all of you guys get out of this hell one day too! </p>\n\n<p><strong>Rant over</strong></p>\n</div><!-- SC_ON -->",
  "score": 1187,
  "permalink": "/r/CryptoCurrency/comments/m6fk2z/crypto_made_me_stop_caring_about_my_career/",
  "subreddit": "CryptoCurrency",
  "id": "m6fk2z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147378433
}