{
  "author": "jeremytm",
  "original_created_utc": 1633016726,
  "title": "Cosmo Kramer never \"slipped one past the goalie\" much to Jerry Seinfeld's surprise. Were pregnancies as the result of casual dating really that common - expected, even - in the mid 1990s?",
  "created_utc": 1633040665,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>On October 13, 1994, the Seinfeld episode &quot;The Chinese Woman&quot; first aired.  In that episode, one of the plot points is Kramer&#39;s supposed low sperm count.  The characters Jerry and Kramer have a discussion:</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>KRAMER: You ever get a woman pregnant?  </p>\n\n<p>JERRY: I&#39;m sorry, Kramer. Those records are permanently sealed.  </p>\n\n<p>KRAMER: What would you say if I told you I&#39;ve never impregnated a woman?  </p>\n\n<p>JERRY: Really? You never slipped one past the goalie in all these years?</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p>The conversation seems to imply that when dating, a man getting a woman pregnant was not a big deal. In fact, the characters make it seem like this was common, perhaps even expected.  My question is: was this in fact the common mindset in the mid 1990s in a metropolitan area like New York City?  What were the expected outcomes of these pregnancies?  Abortions?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/pymhas/cosmo_kramer_never_slipped_one_past_the_goalie/",
  "subreddit": "AskHistorians",
  "id": "pymhas",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "On October 13, 1994, the Seinfeld episode \"The Chinese Woman\" first aired. In\nthat episode, one of the plot points is Kramer's supposed low sperm count. The\ncharacters Jerry and Kramer have a discussion:\n\n\n\n> KRAMER: You ever get a woman pregnant?\n> \n> JERRY: I'm sorry, Kramer. Those records are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1994年10月13日、Seinfeldのエピソード「The Chinese Woman」が初放送されました。このエピソードでは\nこのエピソードでは、Kramerの精子の数が少ないということが一つのポイントになっています。登場人物のジェリーとクレイマーは\n登場人物のジェリーとクレイマーが議論しています。\n\n\n\n> KRAMER: You ever get a woman pregnant?\n> \n> JERRY: すまない、クレイマー。その記録は...",
      "title": "ジェリー・サインフェルドが驚いたように、コスモ・クレイマーは「ゴールキーパーの前をすり抜けた」ことはありませんでした。1990年代半ばには、カジュアルなデートの結果としての妊娠は、それほど一般的であり、期待されていたのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "1994年10月13日，《宋飞》剧集 \"中国女人 \"首次播出。在\n那一集的情节之一是克莱默的所谓低精子数。剧中人物\n杰瑞和克莱默进行了一次讨论。\n\n\n\n> 克拉默：你曾经让一个女人怀孕吗？\n> \n> 杰瑞：对不起，克莱默。这些记录是...",
      "title": "科斯莫-克雷默从未 \"滑过守门员\"，这让杰里-宋飞很惊讶。在20世纪90年代中期，随意约会导致的怀孕真的那么普遍--甚至是预期的--吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "1994年10月13日，《宋飛》劇集 \"中國女人 \"首次播出。在\n那一集的情節之一是克萊默的所謂低精子數。劇中人物\n傑瑞和克萊默進行了一次討論。\n\n\n\n> 克拉默：你曾經讓一個女人懷孕嗎？\n> \n> 傑瑞：對不起，克萊默。這些記錄是...",
      "title": "科斯莫-克雷默從未 \"滑過守門員\"，這讓傑裏-宋飛很驚訝。在20世紀90年代中期，隨意約會導致的懷孕真的那麼普遍--甚至是預期的--嗎？"
    }
  ]
}