{
  "author": "Bibelwissenschaftler",
  "original_created_utc": 1648685363,
  "title": "During the 1920s, the Soviet Union was the most sexually liberated society on earth, decriminalizing homosexuality and abortion, promoting free love and encouraging sexual experimentation. A decade later, Soviet society became one of the world's most socially conservative. What happened and why?",
  "created_utc": 1648692822,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Did Soviet society ever try to recover the free love and sex ideals prevalent during the early years of Bolshevik rule? Or did it remain a first wave feminist society for the rest of its existence after the 1920s?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 118,
  "permalink": "/r/AskHistorians/comments/tsn1uv/during_the_1920s_the_soviet_union_was_the_most/",
  "subreddit": "AskHistorians",
  "id": "tsn1uv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Did Soviet society ever try to recover the free love and sex ideals prevalent\nduring the early years of Bolshevik rule? Or did it remain a first wave feminist\nsociety for the rest of its existence after the 1920s?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ソ連社会は、自由な愛と性の理想を取り戻そうとしたのだろうか。\nボルシェビキの支配の初期には、どうだったのだろうか。それとも、第一波フェミニストのままだったのでしょうか。\n1920年代以降、社会はどうなっていったのでしょうか。",
      "title": "1920年代、ソ連は地球上で最も性的に自由な社会であり、同性愛や中絶を非犯罪化し、自由恋愛を推進し、性的実験を奨励した。その10年後、ソ連社会は世界で最も社会的に保守的な社会のひとつとなった。何が起きたのか、なぜなのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "苏联社会是否曾试图恢复自由恋爱和性的理想？\n在布尔什维克统治的早期，苏联社会是否曾试图恢复自由恋爱和性爱的理想？还是它仍然是一个第一波女权主义的\n还是在1920年代后的余下时间里一直是第一波女权主义社会？",
      "title": "在20世纪20年代，苏联是地球上性解放程度最高的社会，它将同性恋和堕胎非刑罪化，提倡自由恋爱，鼓励性实验。十年后，苏联社会成为世界上最保守的社会之一。发生了什么，为什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "蘇聯社會是否曾試圖恢復自由戀愛和性的理想？\n在布爾什維克統治的早期，蘇聯社會是否曾試圖恢復自由戀愛和性愛的理想？還是它仍然是一個第一波女權主義的\n還是在1920年代後的餘下時間裏一直是第一波女權主義社會？",
      "title": "在20世紀20年代，蘇聯是地球上性解放程度最高的社會，它將同性戀和墮胎非刑罪化，提倡自由戀愛，鼓勵性實驗。十年後，蘇聯社會成爲世界上最保守的社會之一。發生了什麼，爲什麼？"
    }
  ]
}