{
  "author": "mrbobbilly2",
  "original_created_utc": 1650762757,
  "title": "Does Anyone Else Think Of People They Haven't Talked To In Years And Wonder If They Ever Think About You?",
  "created_utc": 1650809015,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes when I&amp;#39;m bored I would have weird thoughts about people I use to be close friends with in middle school and high school, and I would think about them and wonder how they are doing in life. &lt;/p&gt;\n\n&lt;p&gt;I look them up on Google occasionally to see what they&amp;#39;re up to and most of them are doing alright in life, but I don&amp;#39;t have the guts to message then to reconnect because I don&amp;#39;t know if they ever thought about me after middle school or even remember me. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to message them in case they don&amp;#39;t want to be reminded of me due to however I behaved when we were kids which is the main reason why I haven&amp;#39;t talked to them.&lt;/p&gt;\n\n&lt;p&gt;Does anyone else feel this way? I want to know if anyone else experienced this and if you ever contacted an old friend or someone who had an impact on your life such as a teacher and what the outcome was.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/uajgix/does_anyone_else_think_of_people_they_havent/",
  "subreddit": "NoStupidQuestions",
  "id": "uajgix",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Sometimes when I'm bored I would have weird thoughts about people I use to be\nclose friends with in middle school and high school, and I would think about\nthem and wonder how they are doing in life.\n\nI look them up on Google occasionally to see what they're up to and most of them\nare doing alright…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "退屈しているとき、昔の人のことを変に考えてしまうことがある\n中学・高校時代に仲良かった人たちのことを思い出しては、「あの人たちは今どうしているんだろう？\nその人たちは今どうしているのだろう？\n\nたまにGoogleで近況を調べてみると、ほとんどの人がちゃんとしてるんですよね。\nはちゃんとやっているんだなぁ...と。",
      "title": "何年も話していない人たちが、自分のことを思ってくれているかどうか、気になりませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有时，当我感到无聊时，我会对我在初中和高中时曾经是亲密朋友的人产生奇怪的想法。\n在初中和高中时与我关系密切的人，我会想到他们，想知道他们的生活如何。\n他们，想知道他们在生活中怎么样。\n\n我偶尔会在谷歌上查找他们，看看他们在做什么，他们中的大多数人\n都做得很好...",
      "title": "是否有人会想到多年未曾交谈的人，想知道他们是否曾想到你？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有時，當我感到無聊時，我會對我在初中和高中時曾經是親密朋友的人產生奇怪的想法。\n在初中和高中時與我關係密切的人，我會想到他們，想知道他們的生活如何。\n他們，想知道他們在生活中怎麼樣。\n\n我偶爾會在谷歌上查找他們，看看他們在做什麼，他們中的大多數人\n都做得很好...",
      "title": "是否有人會想到多年未曾交談的人，想知道他們是否曾想到你？"
    }
  ]
}