{
  "author": "FutureSailors",
  "the_new_excerpt": "EDIT: I have put together my list of stock picks for now. This includes: ET,\nCOST, FSR, NVDA (hold until Mkt Cap reaches $1T, VICR (hold until december), and\nINO. If I see anything else interesting, I'll probably nab it.\n\n\n\n\n\nI am a simple man. I see a stock, I buy it. I've bought into some of the…",
  "original_created_utc": 1618969749,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "EDIT：とりあえず、私の銘柄リストをまとめてみました。これには ET。\nCOST、FSR、NVDA（時価総額が1Tドルに達するまで保有）、VICR（12月まで保有）、そして\nINO。他に何か面白いものがあれば、それを手に入れるでしょう。\n\n\n\n\n\n私は単純な人間です。株を見たら、買うのです。私はいくつかの銘柄を買いました。",
      "title": "wallstreetbets: 私がスーパーパワーを持っていることを証明するのに、あなたの助けが必要です。(実験中)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：我已经把我的选股清单暂时放在一起。这包括。ET。\nCOST、FSR、NVDA（持有至市值达到1T）、VICR（持有至12月）和\nINO。如果我看到其他有趣的东西，我可能会把它拿下。\n\n\n\n\n\n我是一个简单的人。我看到一只股票，我就买它。我已经买入了一些...",
      "title": "华尔街赌局。我需要你帮助证明我有超能力。(内部实验)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：我已經把我的選股清單暫時放在一起。這包括。ET。\nCOST、FSR、NVDA（持有至市值達到1T）、VICR（持有至12月）和\nINO。如果我看到其他有趣的東西，我可能會把它拿下。\n\n\n\n\n\n我是一個簡單的人。我看到一隻股票，我就買它。我已經買入了一些...",
      "title": "華爾街賭局。我需要你幫助證明我有超能力。(內部實驗)"
    }
  ],
  "title": "WALLSTREETBETS: I Need Your Help Proving that I have Super-Powers. (Experiment inside)",
  "created_utc": 1618983144,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>EDIT: I have put together my list of stock picks for now. This includes: ET, COST, FSR, NVDA (hold until Mkt Cap reaches $1T, VICR (hold until december), and INO. If I see anything else interesting, I&#39;ll probably nab it.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>I am a simple man. I see a stock, I buy it. I&#39;ve bought into some of the most valuable stocks in my time, and I&#39;ve noticed I have a certain special ability that might be of use here at <a href=\"/r/wallstreetbets\">r/wallstreetbets</a>. It doesn&#39;t matter what it is, or what it&#39;s actually worth, I can make any stock go down just by buying/showing interest in it.</p>\n\n<p>Just as a sample, here are all of the stocks I have currently been sequestering. You might find this explains the unusually bearish behavior you&#39;ve been seeing in the market:</p>\n\n<p>Vism: 1000 shares, cost .049, price is now .011</p>\n\n<p>HCMC: 20000 shares, cost .00269, price is now .0014</p>\n\n<p>GME: 60 shares, cost 207.49, price is now 159.00</p>\n\n<p>AMC: 100 shares, cost 11.93, price is now 9.23</p>\n\n<p>TAN: 8 shares, cost 103.61, price is now 82.29</p>\n\n<p>OGI: 325 shares, cost 2.90, price is now 2.34</p>\n\n<p>APHA: 210 shares, cost 16.17, price is now 13.14</p>\n\n<p>OCGN: 10 shares, cost 6.47, price is now 5.38</p>\n\n<p>SNDL: 325 shares, cost .97, price is now .84</p>\n\n<p>ACB: 25 shares, cost 7.83, price is now 7.66</p>\n\n<p>TSLA: 1 share, cost 723.12, price is now 712.39</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>That&#39;s not all! Some of the other bullish stocks I&#39;ve managed to chop off at the knee are:</p>\n\n<p>PLTR , VOO, VT, SPY, SSY, TELL, UAVS, UBER, RKT, SDGR, QQQ, MSFT, AAPL, XRT, and YOLO. As a secondary power, I&#39;ve noticed that each one has seen at least a little spike in price since my selling. It&#39;s only cheap for as long as I own it.</p>\n\n<p>&#x200B;</p>\n\n<p>If I&#39;d failed at an investment in just a few of these stocks, I&#39;d call it a fluke, but my investment history has a loss rate sitting at somewhere around 95%. That&#39;s not chance, that&#39;s certainty. That&#39;s fate. I&#39;d bet my life on those kinds of odds. That&#39;s not bad luck, that&#39;s a goddamn super-power.</p>\n\n<p>I understand that some of you may be skeptical, so I&#39;ve decided to take this opportunity to run a real-life, superb experiment to see if I&#39;m incompetent, or have reverse-control over reality. Recommend any stock of reasonable price, and I will buy in first thing tomorrow morning (I&#39;ll try to give y&#39;all time to liquidate your own shares first, but sometimes just my intention to buy something will make the price start to plummet). If my powers are correct, we should see a massive dip in that stock within a week. After a week, I will sell, and the stock should return to normal.</p>\n\n<p>&#x200B;</p>\n\n<p>If this does turn out to be a predictable trend, I would be happy to render my services. The way I see it, here&#39;s the plan:</p>\n\n<ol>\n<li>Pick Stock</li>\n<li>Pick Entry Time</li>\n<li>I will buy a MASSIVE amount of stock 1 week prior. This guarantees a daily loss in value. The bear attack will likely lose 50% of its momentum each day, so a 5 day run will be most effective before value is dropping too slowly to be worth it.</li>\n<li>Everyone buys in at market open the following day. 1hr into market open, I will liquidate shares, ensuring a bull run so strong that each and every one of you will see green numbers. This bull-ish sentiment lasts as long as the stock holds my attention, likely another 5 days.</li>\n<li>Each of you contributes 1% of your earnings to a kickstarter, which will then be used to rescue me from the excruciating losses I am bound to continue suffering.</li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p>Let me know what you think, apes.</p>\n\n<p>&#x200B;</p>\n\n<p>tl;dr Pick a stock, I&#39;ll buy it and we&#39;ll see if it shits the bed within a week.</p>\n</div><!-- SC_ON -->",
  "score": 1238,
  "permalink": "/r/wallstreetbets/comments/mv5ps6/wallstreetbets_i_need_your_help_proving_that_i/",
  "subreddit": "wallstreetbets",
  "id": "mv5ps6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171532815
}