{
  "author": "No_Weather682",
  "original_created_utc": 1634943031,
  "title": "Would you rather 10x your portfolio by the end of the year or 100x your portfolio in 10 years?",
  "created_utc": 1634963505,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Everyday I see that a lot of people invest in crypto for the &quot;quick and easy&quot; money and don&#39;t care about the long term. A lot of people would rather leave the crypto space at the peak of this bull run than having to hodl for +5 years. I respect this decision since everyone has different goals in the crypto space. Maybe you are young and would rather hodl for the long term or maybe you just don&#39;t want to wait for years. What do you think, would you rather 10x your portfolio by the end of the year or 100x your portfolio in 10 years? And why? (DCA or taking profits in between is not an option).</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/CryptoCurrency/comments/qdsc13/would_you_rather_10x_your_portfolio_by_the_end_of/",
  "subreddit": "CryptoCurrency",
  "id": "qdsc13",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Everyday I see that a lot of people invest in crypto for the \"quick and easy\"\nmoney and don't care about the long term. A lot of people would rather leave the\ncrypto space at the peak of this bull run than having to hodl for +5 years. I\nrespect this decision since everyone has different goals in the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "毎日のように、多くの人が \"手っ取り早く簡単に \"お金を得るために暗号に投資しています。\nのお金のために投資し、長期的なことは気にしていません。多くの人は、この強気のピーク時に暗号空間から撤退する方が\n多くの人は、この強気のピーク時に暗号の世界から抜け出したいと思っていますが、5年以上も苦労することになります。I\nの目標は人それぞれなので、私はこの決断を尊重します。",
      "title": "年内にポートフォリオを10倍にするのと、10年後に100倍にするのと、どちらがいいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我每天都看到很多人为了 \"快速和容易 \"而投资于加密货币，而不关心长期发展。\n赚钱，而不关心长期的发展。很多人宁愿在这轮牛市高峰期离开\n很多人宁愿在这轮牛市的高峰期离开加密货币领域，也不愿意在5年后再离开。I\n我尊重这个决定，因为每个人都有不同的目标。",
      "title": "你愿意在年底前将你的投资组合翻10倍，还是在10年内将你的投资组合翻100倍？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我每天都看到很多人爲了 \"快速和容易 \"而投資於加密貨幣，而不關心長期發展。\n賺錢，而不關心長期的發展。很多人寧願在這輪牛市高峯期離開\n很多人寧願在這輪牛市的高峯期離開加密貨幣領域，也不願意在5年後再離開。I\n我尊重這個決定，因爲每個人都有不同的目標。",
      "title": "你願意在年底前將你的投資組合翻10倍，還是在10年內將你的投資組合翻100倍？"
    }
  ]
}