{
  "author": "Aurtach",
  "the_new_excerpt": "Zoom out, chill out, and buy the dip if you have extra funds. These massive\nswings are just part of the normal movement of things in the crypto world.\n\nIf you can take the 30% losses, you don't deserve the 1000% gains. Even after\nthis dip I am still up higher than I ever was during the 2017/18 peak.…",
  "original_created_utc": 1614068778,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "放大招，冷静下来，如果你有多余的资金，可以买沾。这些大规模\n波动只是加密世界中事物正常运动的一部分。\n\n如果你能承受30%的损失，你就不配获得1000%的收益。即使在\n这次下挫，我的涨幅还是比2017/18年高峰期要高....。",
      "title": "我的投资组合在过去的24小时内下降了2.5万，但我仍然很冷静。放松雅'll，这一切只是乐趣的一部分。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "放大招，冷靜下來，如果你有多餘的資金，可以買沾。這些大規模\n波動只是加密世界中事物正常運動的一部分。\n\n如果你能承受30%的損失，你就不配獲得1000%的收益。即使在\n這次下挫，我的漲幅還是比2017/18年高峯期要高....。",
      "title": "我的投資組合在過去的24小時內下降了2.5萬，但我仍然很冷靜。放鬆雅'll，這一切只是樂趣的一部分。"
    }
  ],
  "title": "My portfolio is down 25k over the last 24 hours, and I'm still chill af. Relax ya'll, this is all just part of the fun.",
  "created_utc": 1614087307,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Zoom out, chill out, and buy the dip if you have extra funds. These massive swings are just part of the normal movement of things in the crypto world.</p>\n\n<p>If you can take the 30% losses, you don&#39;t deserve the 1000% gains. Even after this dip I am still up higher than I ever was during the 2017/18 peak. The key in the crypto world is to just DCA into your positions, always keep some funds handy to buy up on big swings down (20% dips are pretty normal and if your patient you can take advantage of them), never chase pumps, think long term, and just enjoy the ride. </p>\n\n<p>tldr: chill out, hold, and BTFD</p>\n</div><!-- SC_ON -->",
  "score": 1416,
  "permalink": "/r/CryptoCurrency/comments/lqdcil/my_portfolio_is_down_25k_over_the_last_24_hours/",
  "subreddit": "CryptoCurrency",
  "id": "lqdcil",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332880676
}