{
  "author": "MasterCommit",
  "original_created_utc": 1625930829,
  "title": "I don't get the point of r/WhitePeopleTwitter and r/BlackPeopleTwitter. Can someone please explain me?",
  "created_utc": 1625947595,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The posts there are nothing specific to white people or black people. The tweets are just regular-ass tweets. I don&#39;t see how the inherent existence and popularity of these subs is not unnecessary segregation and borderline racist. \nP.S. I am neither black nor white. I am a south-east Asian that has never been to America or Europe so I might be missing some content.</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/ohkqxp/i_dont_get_the_point_of_rwhitepeopletwitter_and/",
  "subreddit": "TooAfraidToAsk",
  "id": "ohkqxp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The posts there are nothing specific to white people or black people. The tweets\nare just regular-ass tweets. I don't see how the inherent existence and\npopularity of these subs is not unnecessary segregation and borderline racist.\nP.S. I am neither black nor white. I am a south-east Asian that has…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこでの書き込みは、白人や黒人に特化したものではありません。つぶやきは\n普通のつぶやきでしかありません。このようなサブカルチャーの存在と人気が、不必要な隔離と境界線上の人種差別ではないとは思えません。\n不必要な隔離であり、人種差別ではないかと思います。\nP.S. 私は黒人でも白人でもありません。私は東南アジア人で、...",
      "title": "r/WhitePeopleTwitterとr/BlackPeopleTwitterの意味がわかりません。誰か説明してくれませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "那里的帖子没有任何专门针对白人或黑人的内容。这些推文\n只是普通的推文。我不明白这些子的固有存在和受欢迎程度如何\n我不明白这些子的内在存在和流行如何不是不必要的隔离和边缘的种族主义者。\nP.S. 我既不是黑人也不是白人。我是一个东南亚人，有...",
      "title": "我不明白r/WhitePeopleTwitter和r/BlackPeopleTwitter有什么意义。谁能给我解释一下？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "那裏的帖子沒有任何專門針對白人或黑人的內容。這些推文\n只是普通的推文。我不明白這些子的固有存在和受歡迎程度如何\n我不明白這些子的內在存在和流行如何不是不必要的隔離和邊緣的種族主義者。\nP.S. 我既不是黑人也不是白人。我是一個東南亞人，有...",
      "title": "我不明白r/WhitePeopleTwitter和r/BlackPeopleTwitter有什麼意義。誰能給我解釋一下？"
    }
  ]
}