{
  "author": "Next_Foundation_3892",
  "original_created_utc": 1638072076,
  "title": "Bitcoin total Supply estimated to shrink upto 10-12 Million in 10 Years just due to people losing their crypto Wallets,sending crypto to wrong addresses , losing seed phrase, etc.What's the best way to way to avoid this? Looking for an updated guide \"How to Store your Bitcoin assets the safest way?\"",
  "created_utc": 1638148124,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We’ve all lost money. It’s a hard pill to swallow. And we know there is absolutely no way of getting our money back. However, with Bitcoin or crypto, it’s so much worse because you know the money is there, but completely irretrievable because you’ve forgotten a simple password. Ouch!!</p>\n\n<p>Programmer, Stefan Thomas has been locked out of his Bitcoin wallet. Thomas had 7,002 bitcoins stored on a secure hard drive and he can’t access them because he forgot the password.</p>\n\n<p>The value of the inaccessible Bitcoin is said to be around $220 million. The coins were stored safely with an IronKey device that gives you 10 chances to enter your password correctly. Thomas had tried several times, with no luck and the last update in January 2021, was that he had 2 attempts left.</p>\n\n<p>He’s made peace with the potential loss, but we’re not sure we have. It’s a shame there is no prompting question, like what is the name of your first pet? Or what was your favourite toy as a child?</p>\n\n<p>We all Heard &quot;Not your keys, Not your Coins&quot;. Well let&#39;s break it down what&#39;s the best way to Store your Bitcoin. Exchanges, Hot, cold Wallets etc.. What&#39;s the best?</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/Bitcoin/comments/r3vav0/bitcoin_total_supply_estimated_to_shrink_upto/",
  "subreddit": "Bitcoin",
  "id": "r3vav0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We’ve all lost money. It’s a hard pill to swallow. And we know there is\nabsolutely no way of getting our money back. However, with Bitcoin or crypto,\nit’s so much worse because you know the money is there, but completely\nirretrievable because you’ve forgotten a simple password. Ouch!!\n\nProgrammer,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆、損をしたことがある。それは飲み込むのが難しい問題です。そして、私たちはそこに\nお金を取り戻すことはできません。しかし、ビットコインや暗号については\nお金はそこにあるが、完全に取り戻せないことを知っているので、それは非常に悪いことです。\nしかし、簡単なパスワードを忘れてしまったために、完全に取り返しのつかないことになってしまうのです。痛いですね。\n\nプログラマー、...",
      "title": "ビットコインの総供給量は、人々が暗号財布を失ったり、間違ったアドレスに暗号を送ったり、シードフレーズを失ったりすることで、10年後には1,000～1,200万個にまで減少すると推定されていますが、これを回避する最善の方法は何でしょうか？最新のガイド \"How to Store your Bitcoin Assets the Safeest Way?\" をお探しですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都损失过钱。这是一个难以吞咽的药丸。而且我们知道有\n绝对没有办法把我们的钱拿回来。然而，对于比特币或加密货币，它是如此糟糕。\n它是如此糟糕，因为你知道钱在那里，但完全\n因为你忘记了一个简单的密码而无法挽回。哎哟！！！。\n\n程序员，...",
      "title": "比特币的总供应量估计会在10年内缩减到1000-1200万，这只是因为人们丢失了他们的加密钱包，将加密货币发送到错误的地址，丢失了种子短语，等等。寻找一个最新的指南 \"如何以最安全的方式存储你的比特币资产？\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都損失過錢。這是一個難以吞嚥的藥丸。而且我們知道有\n絕對沒有辦法把我們的錢拿回來。然而，對於比特幣或加密貨幣，它是如此糟糕。\n它是如此糟糕，因爲你知道錢在那裏，但完全\n因爲你忘記了一個簡單的密碼而無法挽回。哎喲！！！。\n\n程序員，...",
      "title": "比特幣的總供應量估計會在10年內縮減到1000-1200萬，這只是因爲人們丟失了他們的加密錢包，將加密貨幣發送到錯誤的地址，丟失了種子短語，等等。尋找一個最新的指南 \"如何以最安全的方式存儲你的比特幣資產？\""
    }
  ]
}