{
  "author": "gorillamutila",
  "original_created_utc": 1636076619,
  "title": "Yes, you should rant about the government taxing you. It is one of the reasons crypto exists in the first place.",
  "created_utc": 1636094544,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I feel like <a href=\"/u/Yeetasaurus1979\">u/Yeetasaurus1979</a> meant well but missed an important point with his popular <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/qmrys0/this_isnt_the_space_for_your_libertarian_rants/\">This isn’t the space for your libertarian rants about how the government isn’t allowed to tax you.</a> </p>\n\n<p>&#x200B;</p>\n\n<p>The very first block mined by Satoshi back in 2009 had the following heading:</p>\n\n<blockquote>\n<p>&quot;The Times 03/Jan/2009 Chancellor on brink of second bailout for banks.”</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p>In the wake of the 2008 financial, the message that the government was doing the people dirty was somewhat clear. Banks responsible for selling subprime mortgages, sold the risk to Wall Street who, in turn, dumped the risk back on the people through shit Mortgage backed securities. When things went south, people with adjustable rate mortgages lost their homes, pension funds lost money because they used to buy &quot;low risk&quot; MBS sold by wall street and the economy tanked, along with millions of blue-collar jobs. Meanwhile, the government injected huge amounts of money to save the very institutions that caused the entire debacle, and it did so with money of the average taxpayer; the very people that suffered the most.</p>\n\n<p>Though, contrary to popular belief, Bitcoin was <em>not</em> a response to the financial 2008 crisis (Satoshi had been working on it before the crash), it is pretty much well accepted that it the crisis helped to drive the point home, and the header on BTC&#39;s genesis block illustrates just that.</p>\n\n<p>It is also telling that, during BTC&#39;s early days, that strange new technology was a hot topic among two main communities: the cryptography community and the libertarian community. Libertarians were some of those who saw the potential of having a currency that could escape mismanagement by politicians and central banks and, yes, evade the IRS. I was a libertarian back then (my views have changed since) and I remember vividly the discussions about bitcoin as early as 2010 (unfortunately, I didn&#39;t buy any). It was adoption by libertarians ranting about how taxes are theft that helped give BTC its very first baby steps.</p>\n\n<p>The point is. I agree with <a href=\"/u/Yeetasaurus1979\">u/Yeetasaurus1979</a>: pay your taxes, keep track of your transactions and don&#39;t risk going to jail because of it and all of that. But don&#39;t forget that the government often takes your hard-earned money and spends in ways that are completely against your interests and well-being. So rant about it, pressure your representatives about it and always involve yourself in the fight against abusive and immoral government practices. Remember that this is one of the reasons crypto exists in the first place.</p>\n</div><!-- SC_ON -->",
  "score": 183,
  "permalink": "/r/CryptoCurrency/comments/qn0d1d/yes_you_should_rant_about_the_government_taxing/",
  "subreddit": "CryptoCurrency",
  "id": "qn0d1d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I feel like u/Yeetasaurus1979 [/u/Yeetasaurus1979] meant well but missed an\nimportant point with his popular This isn’t the space for your libertarian rants\nabout how the government isn’t allowed to tax…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、u/Yeetasaurus1979 [/u/Yeetasaurus1979]が、人気のある彼の作品について、良かれと思ってしたことが、重要な点を見逃していたように感じます。\nここは、政府がどうのこうのというリバタリアン的な主張をする場ではありません。\nここは、政府が課税することを許されていないというリバタリアンの主張をする場所ではありません。",
      "title": "そうですね、政府に課税されていることをわびるべきですね。そもそも暗号が存在する理由のひとつですからね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得u/Yeetasaurus1979 [/u/Yeetasaurus1979]的本意是好的，但却忽略了一个重要的问题。\n这不是你的自由主义咆哮的空间。\n关于政府如何不被允许征税......",
      "title": "是的，你应该咆哮政府对你征税。这也是加密货币存在的首要原因之一。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得u/Yeetasaurus1979 [/u/Yeetasaurus1979]的本意是好的，但卻忽略了一個重要的問題。\n這不是你的自由主義咆哮的空間。\n關於政府如何不被允許徵稅......",
      "title": "是的，你應該咆哮政府對你徵稅。這也是加密貨幣存在的首要原因之一。"
    }
  ]
}