{
  "author": "No_Weather682",
  "original_created_utc": 1634845441,
  "title": "We all know that Bitcoin and Ethereum are number 1 and 2. What coin should be in 3rd spot?",
  "created_utc": 1634851853,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We can’t deny the fact that Bitcoin and Ethereum have been number 1&amp;2 for a VERY long time. And looks like it will continue to be like that for years. (Unless Ethereum flips Bitcoin). But what coin deserves to be in 3rd position? I know that BNB is the 3rd largest by market cap. However, it is like that because Binance is “forcing” its use. Moreover, I don’t like the fact that BNB is “centralized”, so for me it doesn’t deserve the 3rd spot. Does ADA or Solana deserve it? By being in 3rd spot I mean in the long term, not a coin that pumps this bull run and then we never see it again.</p>\n</div><!-- SC_ON -->",
  "score": 203,
  "permalink": "/r/CryptoCurrency/comments/qczra9/we_all_know_that_bitcoin_and_ethereum_are_number/",
  "subreddit": "CryptoCurrency",
  "id": "qczra9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We can’t deny the fact that Bitcoin and Ethereum have been number 1&2 for a VERY\nlong time. And looks like it will continue to be like that for years. (Unless\nEthereum flips Bitcoin). But what coin deserves to be in 3rd position? I know\nthat BNB is the 3rd largest by market cap. However, it is like…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインとイーサリアムがVERYの1位＆2位になったことは否定できません。\n否定できません。そして、今後もずっとその状態が続くように見えます。(ただし\nイーサリアムがビットコインを裏切らない限り）。) しかし、どのコインが3位に相応しいのでしょうか？私は知っています。\nBNBが時価総額で3位であることは知っています。しかし、それはまるで...",
      "title": "ビットコインとイーサリアムが1位と2位であることは誰もが知っています。3位のコインは何でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们不能否认的是，比特币和以太坊在很长一段时间内一直是第一和第二名。\n长的时间。而且看起来它将继续保持这种状态多年。(除非\n以太坊翻转了比特币）。) 但什么币值得排在第三位？我知道\n按市值计算，BNB是第三大币种。然而，它就像...",
      "title": "我们都知道，比特币和以太坊是第一和第二。什么币应该排在第三位？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們不能否認的是，比特幣和以太坊在很長一段時間內一直是第一和第二名。\n長的時間。而且看起來它將繼續保持這種狀態多年。(除非\n以太坊翻轉了比特幣）。) 但什麼幣值得排在第三位？我知道\n按市值計算，BNB是第三大幣種。然而，它就像...",
      "title": "我們都知道，比特幣和以太坊是第一和第二。什麼幣應該排在第三位？"
    }
  ]
}