{
  "author": "Voldemoron",
  "original_created_utc": 1636318834,
  "title": "Why can't I talk properly without sounding like a dumbass?",
  "created_utc": 1636341625,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Is it a disability, or am I just too fucking smart that I can&#39;t keep up with my own brain because of how fast it works /s. </p>\n\n<p>Basically, I can&#39;t put together a sentence without sounding like a complete dumbass. It&#39;s like, I know what I want to say but I just can&#39;t really say it without fucking up. </p>\n\n<p>Example: &quot;Today I was walking down the street and saw an old lady walking an alligator&quot;</p>\n\n<p>&quot;Today....I was, uh, i was walking......down the street and, um, uh, I ah.....saw an old lady w-walking an......alligator&quot;</p>\n</div><!-- SC_ON -->",
  "score": 129,
  "permalink": "/r/TooAfraidToAsk/comments/qoxpqb/why_cant_i_talk_properly_without_sounding_like_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "qoxpqb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Is it a disability, or am I just too fucking smart that I can't keep up with my\nown brain because of how fast it works /s.\n\nBasically, I can't put together a sentence without sounding like a complete\ndumbass. It's like, I know what I want to say but I just can't really say it\nwithout fucking…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それは障害なのか、それとも私があまりにも頭が良すぎて、自分の脳の働きの速さについていけないのか。\n自分の脳の働きの速さについていけないのでしょうか。\n\n基本的に、私は完全な馬鹿のように聞こえることなく文章をまとめることができません。\n馬鹿にしています。言いたいことはわかっているんだけど、実際には言えないという感じです。\n言えないんです。",
      "title": "なぜ、私は馬鹿にしたような言い方をせずにきちんとした話ができないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是残疾，还是我太他妈聪明了，以至于我无法跟上我的\n因为我自己的大脑工作得太快了/s。\n\n基本上，我不能把一个句子放在一起，否则听起来就像一个完整的\n傻子。这就像，我知道我想说什么，但我就是不能真的说出来\n不他妈的...",
      "title": "为什么我不能在不听起来像个傻子的情况下正常说话？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是殘疾，還是我太他媽聰明瞭，以至於我無法跟上我的\n因爲我自己的大腦工作得太快了/s。\n\n基本上，我不能把一個句子放在一起，否則聽起來就像一個完整的\n傻子。這就像，我知道我想說什麼，但我就是不能真的說出來\n不他媽的...",
      "title": "爲什麼我不能在不聽起來像個傻子的情況下正常說話？"
    }
  ]
}