{
  "author": "kristov_lerad",
  "original_created_utc": 1641338238,
  "title": "I'm Canadian visiting USA for the first time. I've noticed Americans are mostly polite but are really lost on the subtleties. Is this common? (example inside)",
  "created_utc": 1641389854,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m visiting Alaska to meet my girlfriend&amp;#39;s family and there was this big family gathering. I made blueberry cheesecake from scratch, even boiled down blueberries to make a syrup. It was nice. Maybe a couple people had a piece. I ended up picking at it over the next few days but ended up throwing away half of it.&lt;/p&gt;\n\n&lt;p&gt;In my circles in Canada, this would be a humongous fuck you. If someone makes food for an event, you either try some of the food, or at the very least, compliment them for their efforts and provide some sort of excuse why you&amp;#39;re not gonna have some. (on a diet, lactose intolerant, too full from dinner, etc)&lt;/p&gt;\n\n&lt;p&gt;The only reason I would not try someones food (or excuse why I couldn&amp;#39;t) would be to signal that I did NOT like that person.&lt;/p&gt;\n\n&lt;p&gt;The only solution I could come to is that the insult was entirely unintentional and that its just cultural difference. I really hope that I&amp;#39;m right on that one. What do you think?&lt;/p&gt;\n\n&lt;p&gt;EDIT: Regardless of how the comments thought of this as some cultural war crime of me to ask such a generalized question about our countries, I did manage to come to the conclusion that it is indeed likely just a cultural difference. Solved.&lt;/p&gt;\n\n&lt;p&gt;Y&amp;#39;all need to relax, damn.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/NoStupidQuestions/comments/rw7obw/im_canadian_visiting_usa_for_the_first_time_ive/",
  "subreddit": "NoStupidQuestions",
  "id": "rw7obw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm visiting Alaska to meet my girlfriend's family and there was this big family\ngathering. I made blueberry cheesecake from scratch, even boiled down\nblueberries to make a syrup. It was nice. Maybe a couple people had a piece. I\nended up picking at it over the next few days but ended up throwing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "恋人の家族に会うためにアラスカを訪れているのですが、その時、家族の大イベントがありました。\nが集まっています。ブルーベリーチーズケーキを一から作り、煮詰めたりもしました。\nブルーベリーのシロップを作りました。いい感じでしたよ。多分、2、3人が食べたと思います。I\n結局、数日かけてつまみ食いしましたが、結局捨ててしまいました...。",
      "title": "私はカナダ人で、初めてアメリカを訪れました。アメリカ人はほとんど礼儀正しいのですが、微妙なニュアンスには疎いような気がします。これは一般的なことなのでしょうか？(内部の例)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我到阿拉斯加去见我女朋友的家人，那里有一个很大的家庭聚会。\n聚会。我从头开始做蓝莓芝士蛋糕，甚至把蓝莓熬成了糖浆。\n蓝莓做成糖浆。这很好。也许有几个人吃了一块。I\n结果在接下来的几天里，我一直在挑剔它，但最后还是扔了...",
      "title": "我是第一次访问美国的加拿大人。我注意到美国人大部分都很有礼貌，但对一些细微的问题却很迷茫。这很常见吗？(里面的例子)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我到阿拉斯加去見我女朋友的家人，那裏有一個很大的家庭聚會。\n聚會。我從頭開始做藍莓芝士蛋糕，甚至把藍莓熬成了糖漿。\n藍莓做成糖漿。這很好。也許有幾個人吃了一塊。I\n結果在接下來的幾天裏，我一直在挑剔它，但最後還是扔了...",
      "title": "我是第一次訪問美國的加拿大人。我注意到美國人大部分都很有禮貌，但對一些細微的問題卻很迷茫。這很常見嗎？(裏面的例子)"
    }
  ]
}