{
  "author": "Affectionate_Hawk275",
  "original_created_utc": 1660800536,
  "title": "Is there any actual evidence that anti-gay sentiment in Islamic countries is because of the British Empire?",
  "created_utc": 1660811107,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m Egyptian and was raised Muslim, and recently saw Tom Daley, a gay British athlete, making the claim that the reason for homophobia in former British colonies like Pakistan is because of the British Empire essentially making them this way.&lt;/p&gt;\n\n&lt;p&gt;I myself think this argument is pretty silly, very paternalistic, quite western-centric and ultimately shifts blame to where it doesn&amp;#39;t belong. However, Egypt is also a former British territory so I&amp;#39;m interested enough to ask: is there anything to back it up?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/wrb2fj/is_there_any_actual_evidence_that_antigay/",
  "subreddit": "AskHistorians",
  "id": "wrb2fj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm Egyptian and was raised Muslim, and recently saw Tom Daley, a gay British\nathlete, making the claim that the reason for homophobia in former British\ncolonies like Pakistan is because of the British Empire essentially making them\nthis way.\n\nI myself think this argument is pretty silly, very…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はエジプト人で、イスラム教徒として育ちましたが、最近、ゲイのイギリス人、トム・デイリーを見かけました。\nパキスタンなど旧英国植民地での同性愛嫌悪の原因は、英国帝国のせいだ」という主張を\nパキスタンのような旧英国植民地での同性愛嫌悪は、大英帝国が本質的に彼らをそうさせたからだと\nという主張を見ました。\n\n私自身は、この主張はかなり馬鹿げていると思いますし、とても...",
      "title": "イスラム圏の反ゲイ感情が大英帝国のせいだという実際の根拠はあるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是埃及人，从小接受穆斯林教育，最近看到了英国同性恋者汤姆-戴利（Tom Daley）。\n最近，我看到英国同性恋运动员汤姆-戴利（Tom Daley）声称，像巴基斯坦这样的前英国殖民地之所以存在对同性恋的恐惧，是因为大英帝国在本质上使英国人对同性恋的态度发生了变化。\n最近看到英国同性恋运动员汤姆-戴利声称，巴基斯坦等前英国殖民地之所以对同性恋有恐惧感，是因为大英帝国在本质上使他们成为\n这种方式。\n\n我自己认为这种说法很傻，很...",
      "title": "是否有任何实际证据表明伊斯兰国家的反同性恋情绪是因为大英帝国的原因？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是埃及人，從小接受穆斯林教育，最近看到了英國同性戀者湯姆-戴利（Tom Daley）。\n最近，我看到英國同性戀運動員湯姆-戴利（Tom Daley）聲稱，像巴基斯坦這樣的前英國殖民地之所以存在對同性戀的恐懼，是因爲大英帝國在本質上使英國人對同性戀的態度發生了變化。\n最近看到英國同性戀運動員湯姆-戴利聲稱，巴基斯坦等前英國殖民地之所以對同性戀有恐懼感，是因爲大英帝國在本質上使他們成爲\n這種方式。\n\n我自己認爲這種說法很傻，很...",
      "title": "是否有任何實際證據表明伊斯蘭國家的反同性戀情緒是因爲大英帝國的原因？"
    }
  ]
}