{
  "author": "BikesandBitcoin",
  "original_created_utc": 1632784179,
  "title": "I am a time traveler from the future, here to tell you to please keep going.",
  "created_utc": 1632825696,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am sending this message from the year 2089. Things have never been so good in all of human history, and some of you will still be here to see it.</p>\n\n<p>If you don’t believe me, I don’t have the time to try to convince you, sorry.</p>\n\n<p>I know you are all busy building, and I don’t want to waste your time, so I’ll simply explain what happened.</p>\n\n<p>On average, every year, the value of a bitcoin continued to grow at an over 250% annualized return, that is, of course, until hyperbitcoinization began in earnest. Arguably, hyperbitcoinization began with the genesis block, but when the US government started printing trillions of dollars during the old pandemic of 2019, the world, en masse, began to lose faith in their unit of account, the US dollar.</p>\n\n<p>The largest demographic in the US, the Baby Boomers, began retiring. They held most of their wealth in their homes and retirement accounts (mostly equities), and as they watched the financial markets and real estate pump and dump continuously, due to money printing and government handouts, tempered by schizophrenic fiscal policy, they realized there would eventually be no demand for their overpriced homes and Amazon stock (I’m not sure what this company did, but I’ve read about it being very large), and started to cash out.</p>\n\n<p>This, coupled with small countries beginning to adopt Bitcoin as currency, led the way to broader de-dollarization. China, for a few years, attempted a digital Yuan, but a civil war ended their dream by destabilizing CBDC rollout, all the while debtor countries in the Chinese Belt and Road initiative realized they could simply convert their treasuries to Bitcoin, and clear their debts in the weakened Yuan currency after a year or two, thus securing their financial freedom.</p>\n\n<p>Back in the US, all hell broke loose when Vanguard, Fidelity and Schwab  started metering retirement account redemptions. I don’t want to oversimplify those years, but scams abounded and confusion was the norm. Many lost their life savings while others 500x-ed what they had by buying Bitcoin as soon as possible. In all, it became clear when the dust had settled, that the digital scarcity of Bitcoin was the enforceable unit of account.</p>\n\n<p>One famous couple, whose son had been telling them to buy Bitcoin since 2020, lost everything in their retirement accounts. That is, until one Thanksgiving when he logged into the long forgotten Swan website and realized their auto DCA of $50 a week had been running continuously for the last 10 years. They quickly bought a plane ticket and moved to a Bitcoin Citadel community for their remaining years.</p>\n\n<p>“What is a Citadel?” you might wonder.</p>\n\n<p>The concept started as a term of art to describe a hard money response to the fiat world pre-BItcoin. Today you probably think of the ‘fiat world’ when you see over-processed foods, low quality imported products designed with planned obsolescence, or hyper bureaucratic organizations that seem to produce little. Those things are alien to us in my time, I’ve only read about them, but I believe you’ll understand what I mean when I mention them. The Citadel concept has become a cornerstone of Bitcoin and most people in my era see the concept of a Citadel as one of the following:</p>\n\n<ol>\n<li>The Personal Bitcoin Citadel: This is the high standard of personal care and sovereignty that Bitcoiners (everyone nowadays) hold themselves to. It includes working out, eating clean foods, maintaining healthy relationships, and working on emotional and spiritual betterment. With Bitcoin as a standard, people started to realize that they were extremely capable of taking care of themselves and dove in headfirst. The Personal Citadel movement extended outside of the self to the immediate family, one’s home, and one’s work/schooling environment. People became empowered by the responsibility of earning and holding their own wealth and developed a culture of protecting it while respecting what others had.</li>\n<li>The Bitcoin Citadel Community: These developed as both free and paid communities dedicated to both member improvement and extending the social mission of Bitcoin. Some organizations operated like what you would, in your time, call a ‘meetup group’, focused on particular skill development, self refinement or community issues, other organizations developed like what you would call ‘investment clubs’. After hyperbitcoinization many Bitcoiners, now extremely wealthy, dedicated their lives to allocating capital to the building of a refined hard money world. These groups operated on principles of non-aggression, decentralization, permissionless-ness and opting-in. Sometimes they were meant to generate income and other times they were pure donations. The best example I can use is when I once read about the great capitalists of the 20th century, who often spent the latter halves of their lives giving away what they had earned. You may know Max Keiser and Michael Saylor, these two men, upon becoming some of the wealthiest individuals to have ever existed, spent their later years in campaigns to bring self sovereignty, energy independence and universal education to the world. They are the reason every country on Earth now has both fully funded trade, liberal arts, and research institutions.</li>\n<li>The Physical Citadel Community: During and immediately after hyperbitcoinization, the building of physical citadels became extremely popular for early adopters seeking to ‘ride out’ the volatility and confusion that abounded. Some individuals lived in mountain homes with abundant security, some on tropical islands they purchased, and others simply bought entire city blocks and retrofitted them to become entirely self-sufficient. Many of the later adopters of Bitcoin initially hated these citadel builders, seeing them as elitists or isolationists, but as hyperbitcoinization completed, most came to understand that physical citadels were meant as protective and self-sustaining structures, and were never used to offensively harm or attack anyone. What’s more, many of these citadels, post hyperbitcoinization began operating on an ‘open door’ policy to provide shelter, food and health care to both average citizens looking for something to eat for lunch or somewhere to stay on a road trip, as well as the few impoverished who still struggle in our day and age.</li>\n</ol>\n\n<p>Initially governments tried to fight hyperbitcoinization by ostracizing early Bitcoiners and maligning them as dissidents or radicals. The Federal Reserve printed tens of trillions of dollars and distributed them widely, thinking that they could turn the average person away from Bitcoin. This provoked serious inflation and this plan backfired egregiously when the federal government shot and killed 25 peaceful protesters who had assembled in front of the White House to advocate for banking the underbanked in America’s major cities with Bitcoin. After this event, it became clear to nearly everyone that they could not stand for a government that enacted violence on those trying to improve the lives of others.</p>\n\n<p>As more and more individuals opted out, government receipts faltered. The US, flush with cash but lacking any purchasing power, capitulated and announced they were buying Bitcoin. This announcement, combined with the flood of Baby Boomers retiring and smaller countries opting for a Bitcoin Standard is still seen today as the moment Bitcoin had won a peaceful revolution.</p>\n\n<p>After governments realized they could not defeat Bitcoin as a network, they became obsessed with energy production and chip manufacturing as a way to participate in the network. Geopolitical advantage went to the country who was able to produce massive amounts of energy at a low cost and with low environmental impact. Natural gas and oil consumption are non-existent in my day and age. Some people still drive around in vintage internal combustion vehicles, but that is seen as an expensive hobby because oil is so difficult to find. Today we use various forms of fission and fusion reactors to power everything from our homes and devices, to our cities, planes and ships . Our chips are 100,000 times faster than your fastest quantum computers and fit in handheld devices that never require charging.</p>\n\n<p>What you might call my ‘cellphone’, the device I keep with me most often for communication, work and play, is running a full bitcoin node and mining bitcoin! It only generates three to six Sats a month. I chose this model, one of the most expensive in the market, because of the more powerful 350 tera-hash mining computer inside of it. It won’t pay for itself and is nowhere near as advanced as the 100,000 tera-hash units some of the larger energy companies have, but it is nice to have a few Sats a month to get lunch or go on a coffee date with.</p>\n\n<p>Even the most staunch talking heads against Bitcoin capitulated when they saw what was happening in Africa, South America, and Southeast Asia. With the introduction of a hard money standard and near limitless energy and computing power available to all, slavery and government tyranny disappeared entirely as the demand for goods produced on these continents for ‘fiat’ products dried up. These locations in particular flourished immensely as their people were able to utilize their skills and resources at home, own their own wealth and labor, and keep the rewards nearby. Service markets that used to rely on geo-arbitrage like design, programming, marketing strategy or website building, became more equitable when everyone was transacting in a shared currency and governments around the world had to compete for citizens. Some later scholars interpreted this as a global redistribution of wealth, while others saw it as the major social turning, when governments across the world started to think of their citizens as customers to be served and not taxpayers to be audited.</p>\n\n<p>You might wonder, what is our plan now? To say we live in a utopia is incomplete. Some individuals have attempted to use their newfound wealth to create militias, take over lands, or attack and rule over others. But, these types of attacks work less and less as the years go on and Bitcoin becomes more and more decentralized.  As countries themselves fight mainly to innovate, they fight less and less to dominate. They focus more on serving their citizens and protecting fundamental rights. This has led to a mass de-radicalization of politics and media as businesses and governments insist on maintaining peace, otherwise their citizens will simply leave for a better country.</p>\n\n<p>Of course, in some sense hyper-bitcoinization is not yet complete, but we are living in a far more just and peaceful world because of what you created in the early 2000s.</p>\n\n<p>This is also the reason I contacted you.</p>\n\n<p>Keep going. What you see now as a vision becomes a reality. I don’t know how to explain to you that it was all worth it, you won, and the human race itself has become something better for your work. I can’t imagine the difficulties that you have gone through, and the ones you are about to go through.</p>\n\n<p>However, I have seen where it leads.</p>\n\n<p>          - RW</p>\n\n<p>&#x200B;</p>\n\n<p>NOTE: This is an homage to the original Citadel Reddit post <a href=\"https://www.reddit.com/r/Bitcoin/comments/1lfobc/i_am_a_timetraveler_from_the_future_here_to_beg/\">HERE</a>.</p>\n\n<p>You can find a version of this same post at Bitcoin Magazine <a href=\"https://bitcoinmagazine.com/culture/bitcoin-time-traveler-future-reddit\">HERE</a>.</p>\n\n<p>Thanks so much for reading!</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/9MwFXlbtadL72c6O-ynhHtuuEON9wlX2E5sR-Z7BV1Y.jpg?auto=webp&s=fc3ea6114559397a4901bf475888a58ee763e7a2",
          "width": 1200,
          "height": 675
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/9MwFXlbtadL72c6O-ynhHtuuEON9wlX2E5sR-Z7BV1Y.jpg?width=108&crop=smart&auto=webp&s=502d30610ea91c7a4426cb8c172050c71b763228",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/9MwFXlbtadL72c6O-ynhHtuuEON9wlX2E5sR-Z7BV1Y.jpg?width=216&crop=smart&auto=webp&s=b9726cf3ee5087fb84bccae71b79f08235b495ad",
            "width": 216,
            "height": 121
          },
          {
            "url": "https://external-preview.redd.it/9MwFXlbtadL72c6O-ynhHtuuEON9wlX2E5sR-Z7BV1Y.jpg?width=320&crop=smart&auto=webp&s=c0cd62148f1edfcbcea94eec54e5f5ed291424e5",
            "width": 320,
            "height": 180
          },
          {
            "url": "https://external-preview.redd.it/9MwFXlbtadL72c6O-ynhHtuuEON9wlX2E5sR-Z7BV1Y.jpg?width=640&crop=smart&auto=webp&s=4d1bdaf64b043213c9174da0f0d9a7734f042e83",
            "width": 640,
            "height": 360
          },
          {
            "url": "https://external-preview.redd.it/9MwFXlbtadL72c6O-ynhHtuuEON9wlX2E5sR-Z7BV1Y.jpg?width=960&crop=smart&auto=webp&s=69dd3c445ab32ab19224eb3d7d4144d88dcfe2cf",
            "width": 960,
            "height": 540
          },
          {
            "url": "https://external-preview.redd.it/9MwFXlbtadL72c6O-ynhHtuuEON9wlX2E5sR-Z7BV1Y.jpg?width=1080&crop=smart&auto=webp&s=92d4c332310ce655de92c771776dee258e91c330",
            "width": 1080,
            "height": 607
          }
        ],
        "variants": {},
        "id": "Sn6Py-8y0570PaYTvUH3g3HDFW3TVnc4cj0dX36Pujo"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/pwt0kf/i_am_a_time_traveler_from_the_future_here_to_tell/",
  "subreddit": "Bitcoin",
  "id": "pwt0kf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am sending this message from the year 2089. Things have never been so good in\nall of human history, and some of you will still be here to see it.\n\nIf you don’t believe me, I don’t have the time to try to convince you, sorry.\n\nI know you are all busy building, and I don’t want to waste your time,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2089年からこのメッセージを送っています。人類の歴史の中で、こんなに良いことはありませんでした。\n人類の歴史の中で、これほど良いことはありませんでした。\n\nもし私を信じないのであれば、私にはあなたを説得する時間がありません、ごめんなさい。\n\n皆さんが建築で忙しいのは知っていますし、その時間を無駄にしたくはないのですが...。",
      "title": "私は未来から来たタイムトラベラーで、あなたに「どうぞ続けてください」と言うために来ました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从2089年发出这个消息。事情从来没有这么好过，在\n而你们中的一些人还会在这里看到它。\n\n如果你不相信我，我没有时间来试图说服你，对不起。\n\n我知道你们都在忙于建设，我不想浪费你们的时间，...",
      "title": "我是一个来自未来的时间旅行者，在这里告诉你，请继续前进。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從2089年發出這個消息。事情從來沒有這麼好過，在\n而你們中的一些人還會在這裏看到它。\n\n如果你不相信我，我沒有時間來試圖說服你，對不起。\n\n我知道你們都在忙於建設，我不想浪費你們的時間，...",
      "title": "我是一個來自未來的時間旅行者，在這裏告訴你，請繼續前進。"
    }
  ]
}