{
  "author": "lanceauloin_",
  "the_new_excerpt": "Okay so you've read the shitload of bullish god-tiered DD\n[https://www.reddit.com/r/wallstreetbets/comments/mzxtz5/mnmd_starter_due_diligence/]\nabout Mindmed, you like getting high to forget all the red in your portfolio and\nyou feel the urge to bust what's left of your retirement into a meme…",
  "original_created_utc": 1619604733,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、あなたは強気の神格化されたDDのクソみたいな量を読みましたか？\n[https://www.reddit.com/r/wallstreetbets/comments/mzxtz5/mnmd_starter_due_diligence/]\nMindmedについての強気の神格化されたDD[]をクソほど読んで、あなたは自分のポートフォリオの赤をすべて忘れるためにハイになりたいと思っている。\n退職金の残りをミームにぶち込みたいという衝動に駆られている...。",
      "title": "マインドメッド社の弱気なケース"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，所以你已经读了狗屎一样的看涨的神级DD\n[https://www.reddit.com/r/wallstreetbets/comments/mzxtz5/mnmd_starter_due_diligence/]\n关于Mindmed的文章，你喜欢嗑药来忘记你的投资组合中所有的红色，并且\n你觉得有种冲动，想把你剩下的退休生活变成一个备忘录......",
      "title": "看跌MindMed的案例"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，所以你已經讀了狗屎一樣的看漲的神級DD\n[https://www.reddit.com/r/wallstreetbets/comments/mzxtz5/mnmd_starter_due_diligence/]\n關於Mindmed的文章，你喜歡嗑藥來忘記你的投資組合中所有的紅色，並且\n你覺得有種衝動，想把你剩下的退休生活變成一個備忘錄......",
      "title": "看跌MindMed的案例"
    }
  ],
  "title": "A bearish-ish case for MindMed",
  "created_utc": 1619632500,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Okay  so you&#39;ve read the shitload of <a href=\"https://www.reddit.com/r/wallstreetbets/comments/mzxtz5/mnmd_starter_due_diligence/\">bullish god-tiered DD</a> about Mindmed, you  like getting high to forget all the red in your portfolio and you feel  the urge to bust what&#39;s left of your retirement into a meme biotech  stock. Yet your weak ass paperhanded reptilian brain is scared. Here&#39;s  why.</p>\n\n<p><strong>The product</strong>  : So basically like almost all its competitors (<a href=\"https://www.atai.life/programs/\">atai-linked</a>, <a href=\"https://numinus.ca/clinics\">numinus</a>, <a href=\"https://www.cybin.com/\">cybin</a>, etc) this company decided not  to invest in any meaningful drug discovery. Instead they bought  pipelines for well known compounds. Bonus, you can say on your website  you already passed the &quot;pre discovery&quot; stage. No shit. It&#39;s done since  the &#39;50s. Candy-flipping is not &quot;next-gen&quot;, sorry. Ibogain derivatives  are not that good.</p>\n\n<p><strong>The market :</strong> Psychedelics work, right? Yeah.</p>\n\n<ul>\n<li>For  MDD (depression), they are only slightly more efficient than first  intent antidepressants. And how efficient are antidepressants? Well not much.  They have NNT ranging between 7 and 20. What&#39;s a NNT? Wait you were  going to invest in a FUCKING BIOTECH without knowing what a NNT is? NNT  (number needed to treat) indicate how good something is relative to a  control. With a NNT of 7, an antidepressant will beat doing nothing 1  time out of 7. Yup. <strong>That&#39;s shit</strong>.  Why? Because we know jackshit about how depression really works, and  however smooth our brains are, it appears they still remain very  complicated thing (I guess that&#39;s a good thing?).What does it mean? It  means LSD, Shrooms, or whatever shitty therapy you can imagine with  psychedelics will work for some and won&#39;t for the others. Which means  MNMD will have to share the MDD market with the approx. <strong>50</strong> other fucking antidepressants. Also J&amp;J&#39;s Spravato is less invasive and has better results.</li>\n<li>For  anxiety. Is it gonna be the same? NO. MNMD is right on that one. The  NNT of benzos is approx. 3 depending on the study. LSD is estimated to  be around 2. That&#39;s nice.  But don&#39;t pre-order your lambo yet. Benzos  are fucking easy to use, and they are addictive. Many people won&#39;t  tolerate psychedelics, won&#39;t have the time for it, or are afraid of the  compound to begin with (thx war on drugs). The pharma industry won&#39;t let  a hipster&#39;s biotech ruin its profits. So they&#39;ll either lobby against  (if you are a physician it&#39;s good news, more free cruises in the coming  years) or bring their own psychedelic drugs on the table (and they&#39;ll be  better than acid). Acid antagonists will just compound problems. All their pipeline is based on the premise that they can safely stop a trip with this antagonist. Else the patient will be tripping balls for too long, making the treatement unpractical compared to other psychedelics and state-of-the-art anxiolytics. That mean pushing 2 pipelines plus a combined drug pipeline to reach market.</li>\n<li>For addiction. Didn&#39;t find anything bearish about it except that it might not get approved, like for any other biotech.</li>\n<li>ADHD. There&#39;s no exclusive market in selling microdosed lsd, but it might just work. The data isn&#39;t here to predict the success of the therapy yet.</li>\n</ul>\n\n<p><strong>The IP :</strong>  It&#39;s gonna be a fucking bloodbath. Almost all the psychedelic biotech  decided to work with the same exact compounds because they are inept at  innovation (more below). There gonna be a lot of overlap, and many  lawsuits. Even better, almost all the IP I found related to the  psychedelics applications is very badly written, and, put mildly, trash.  Bullish on IP law firms.</p>\n\n<p><strong>The people :</strong>   In biotech, the idea isn&#39;t worth anything. Execution is the only thing  that matter (and luck). So who&#39;s behind MNMD? They have anywhere between 25 and 40 employees depending on how you count,  good thing if you <a href=\"https://www.linkedin.com/company/mindmedco/people/\">work there</a>, you&#39;ll have a nice title for your resume as  you&#39;re either a C-suite or a director or at least a lead. And most of  them don&#39;t work-work for MNMD, they are just consultants, or also work  on some other stuff on the side, because well, you don&#39;t need that much  businessmen in such a young biotech.They outsourced all of their  innovation capacities to their academic collaborators. Which is smart.  Or not. It will make scaling up extremely tedious without acquiring  everybody else. They don&#39;t have the chemical know-how, and neither the  patents, to produce. They&#39;ll need to partner with a big pharma or  buy/merge someone, which will considerably reduce the profits. They also  don&#39;t have much expertise in regulatory affairs either so that&#39;s 1 more  (costly) outsourcing. Their current philosophy is &quot;throw money at it&quot;.  Which has been proven to fail in the biotech/pharma world, see eroom&#39;s  law. What about the AI guys (the whole handful of them)? They come from the famous  HealthMode (and also related Merlon) company. Never heard of them?  Because they never put a product on the market.Basically the company is a  weird employee merger between weed company veterans, an obscure 2 California based Czechoslovak AI companies and some expensive-ass  consultant-executives.</p>\n\n<p>TL;DR : Mindmed is  trying hard to appear as the next big thing but all they have is a  highly contested pipeline of low-innovation drugs. They are stretched  thin between Drug Development and AI and lack the proper verticality to  achieve success, but are too high-level to succeed as an horizontal  growth company. Ride the hype while it lasts i guess.</p>\n\n<p>Obviously just a rant, not financial advice.</p>\n</div><!-- SC_ON -->",
  "score": 1574,
  "permalink": "/r/wallstreetbets/comments/n0bkvn/a_bearishish_case_for_mindmed/",
  "subreddit": "wallstreetbets",
  "id": "n0bkvn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776220649
}