{
  "author": "3STmotivation",
  "the_new_excerpt": "The recent run up in equities has people questioning if they missed the top, if\nthey are too late and if this was already the end of a young bull market in\nuranium. This couldn’t be further from the truth, as a long term price per pound\nof uranium is still in need of between 50 and 60 dollars. If it…",
  "original_created_utc": 1620222811,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近の株式の上昇は、人々に「頂点を逃したのではないか」「遅すぎたのでは？\n遅すぎたのではないか、これはすでにウランの若い強気の市場の終わりだったのではないか、などと考えています。\nとの声が聞かれます。しかし、これは全くの誤りで、長期的に見た場合、ウランの1ポンドあたりの価格は\nウランの長期的な1ポンドあたりの価格は、まだ50～60ドルが必要です。もしそれが...",
      "title": "ウラン強気相場の6つのフェーズモデル"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近的股票上涨让人们质疑他们是否错过了顶部，是否太晚了？\n他们是否为时已晚，以及这是否已经是年轻的牛市的结束？\n铀的年轻牛市的结束。这与事实相差甚远，因为每磅铀的长期价格\n铀的长期价格仍然需要在50至60美元之间。如果它...",
      "title": "这个铀牛市可能展开的6个阶段模型"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近的股票上漲讓人們質疑他們是否錯過了頂部，是否太晚了？\n他們是否爲時已晚，以及這是否已經是年輕的牛市的結束？\n鈾的年輕牛市的結束。這與事實相差甚遠，因爲每磅鈾的長期價格\n鈾的長期價格仍然需要在50至60美元之間。如果它...",
      "title": "這個鈾牛市可能展開的6個階段模型"
    }
  ],
  "title": "The 6 phase model of how this uranium bull market might unfold",
  "created_utc": 1620235601,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The recent run up in equities has people questioning if they missed the top, if they are too late and if this was already the end of a young bull market in uranium. This couldn’t be further from the truth, as a long term price per pound of uranium is still in need of between 50 and 60 dollars. If it doesn’t reach this target within the next three years, we are in for much bigger issues and this will not be allowed to happen in my view. As part of the research document I wrote on uranium investing, I constructed a phase model that walks us through every part of what I think will be a generational bull market. We are very much still in phase 2 of my 6 phase model, but with phase 3 slowly emerging on the horizon. What are these 6 phases you might think? They can be categorized as follows in a stadium like model:</p>\n\n<p>Phase 1, constructing the stadium (2016-2020):</p>\n\n<p>- The early/smart money, the first time we come out of a prolonged bear market. Equities may not have really moved yet, but it is finally starting to look brighter. After the price of uranium bottomed several years ago, it has crept up slowly but surely, but without proper reaction of the underlying equities. Catalysts are building and around the end of this phase (between July and October of last year) is when I first started sharing my due diligence on here. This phase ended at the start of the first big run up we have seen.</p>\n\n<p>Phase 2, getting on the bus (2020-2021):</p>\n\n<p>- Once share prices finally move (as we have seen between November and February of this year), it is time for more of the smart money to come in. Those who see that we have finally come out of a bear market and that the busses are slowly being loaded. Price movement will justify the narrative and sharp minds accounting for both retail capital as well as institutional capital will start to position themselves for what is to come. This is the point where we are currently at, waiting for the next move up and for this bus to get going.</p>\n\n<p>Phase 3, arriving at the stadium:</p>\n\n<p>- Word is spreading of a new investment opportunity and this will likely be marked by the price per pound of uranium going over the 40 dollar mark. As was mentioned above, price movement justifies the narrative and 40 dollar is the first ‘line in the sand’ where we will see increased interest from institutional capital wanting to position themselves for this bull market. This phase can be the shortest or the longest of all of the 6 phases depending on a number of key factors that need to be paid close attention to.</p>\n\n<p>Phase 4, the game begins:</p>\n\n<p>- This is where the bulk of investors will come in. While we are not early anymore, we are well into this bull market and it still has some legs left. Some people might start taking profits here and leave before the game ends. This can be a smart plan, as scaling out into strength will save you from being hit by phase 6 once it rolls around. In this phase it is clear we are in a full-fledged bull market and it will become more and more regularly discussed by investment communities. Institutional money will be well positioned at this point and will look for a possible exit. I am currently writing an exit strategy on it, based both on history, market psychology and asset valuations. I am not able to share this, as it wouldn’t be fair to my platform, so I apologize for that. This phase will likely be the most volatile as a whole.</p>\n\n<p>Phase 5, the final minutes:</p>\n\n<p>- As with every highly cyclical bull market, all good things most come to an end. Just like with a game that is all tied a few minutes before the final whistle, emotions are running high and you will see people scrambling to get a glance at the game. This is when general media such as CNBC and investors on social media will be talking about uranium as being “the next big thing”. This is a massive red flag. Yes, you might want to watch this game till the end, but it is much better to try and get out before the mass euphoria reaches its peak. When you see that uranium is as broadly discussed as things like digital meme dogs or EV&#39;s for example are right now and spot price severely overshooting the long term price, there is no reason to not take out most of your profits and watch this game go into phase 6.</p>\n\n<p>Phase 6, the game ends (2025):</p>\n\n<p>- As I said before, all cyclical bull markets must eventually come to an end and this one will be no different. While the timing of this, which I think will be somewhere around 2025, is nothing more than a calculated bet (it could be longer, but also shorter, depending on prevailing market specific but also broad equity market circumstances), fact remains that the final blow off peak we saw in phase 5 in the final minutes of the game will be just as steep to the downside. This will leave a lot of people holding the bag and it will be a rough wake up call, don’t be left standing when the doors close and the lights go out.</p>\n\n<p>Conclusion:</p>\n\n<p>When a game is exciting, you want to stay till the end to make sure you don’t miss anything, this is very understandable as it is human nature to want to get the most out of something. However, the risk associated with trying to time the whistle to the minute is not worth it in my opinion. This doesn’t mean you should sell before the bus even arrives at the stadium, but perhaps it is smart to consider scaling out every few minutes and leave only a very small position (or nothing at all of course) to watch the final minutes of this game. Phases and associated timelines can shift very quickly, so make sure you are adaptive, patient and disciplined, because this will be quite the game and no one will know how long it will last. It could be 4 years, but it could also only be 1 or 2. You have to be adaptive and make sure you have the right information and strategy to make the most of this opportunity. Thank you for reading and as always I wish you all a great day.</p>\n</div><!-- SC_ON -->",
  "score": 72,
  "permalink": "/r/stocks/comments/n5gg3f/the_6_phase_model_of_how_this_uranium_bull_market/",
  "subreddit": "stocks",
  "id": "n5gg3f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380968358
}