{
  "author": "Raven2303",
  "original_created_utc": 1635187805,
  "title": "Why isn't it wrong for people in extreme poverty to have kids?",
  "created_utc": 1635198878,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I genuinely don&#39;t get it. I&#39;m not talking about people in regular situations of poverty (for lack of a better term) who can still feed, clothe and educate their kids - I mean people in what seems to be inescapable poverty, who can&#39;t even feed themselves.</p>\n\n<p>Why do we defend these situations, when these parents sadly can&#39;t even care for themselves? Having a child will only bring another person into suffering and poverty, as well as make it worse for the parents as they have to divide already infinitesimal resources.</p>\n\n<p>Edit: Sorry, poor wording on my part. I don&#39;t mean to say these people shouldn&#39;t procreate. I don&#39;t mean to say that they&#39;re wrong for having kids. I just don&#39;t get why they&#39;d want kids in those circumstances, and why it&#39;s bad to question why they would (that&#39;s me sucking at explaining the defending part). Why would someone want kids when they&#39;re suffering significantly themself?</p>\n</div><!-- SC_ON -->",
  "score": 121,
  "permalink": "/r/TooAfraidToAsk/comments/qfnja3/why_isnt_it_wrong_for_people_in_extreme_poverty/",
  "subreddit": "TooAfraidToAsk",
  "id": "qfnja3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I genuinely don't get it. I'm not talking about people in regular situations of\npoverty (for lack of a better term) who can still feed, clothe and educate their\nkids - I mean people in what seems to be inescapable poverty, who can't even\nfeed themselves.\n\nWhy do we defend these situations, when…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は純粋に理解できません。私が言っているのは、通常の貧困状態にある人々のことではありません。\n私が言っているのは、子供を食べさせ、着せ、教育することができる通常の貧困状態にある人々のことではありません。\n私が言っているのは、通常の貧困状態にあり、子供を養い、服を着せ、教育を受けさせることができる人々のことではありません。\nつまり、逃れられないような貧困の中にいて、自分自身を養うことさえできない人々です。\n\nなぜ私たちは、このような状況を擁護するのでしょうか...",
      "title": "極貧の人が子供を産むのはなぜ悪いことではないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我真的不明白。我不是在说那些处于正常情况下的人\n的人（因为缺乏更好的术语），他们仍然可以给自己的孩子提供食物、衣服和教育。\n我指的是那些似乎是不可避免的贫困的人，他们甚至不能\n自己吃饱。\n\n为什么我们要为这些情况辩护，当...",
      "title": "为什么极端贫困的人生孩子不是错？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我真的不明白。我不是在說那些處於正常情況下的人\n的人（因爲缺乏更好的術語），他們仍然可以給自己的孩子提供食物、衣服和教育。\n我指的是那些似乎是不可避免的貧困的人，他們甚至不能\n自己喫飽。\n\n爲什麼我們要爲這些情況辯護，當...",
      "title": "爲什麼極端貧困的人生孩子不是錯？"
    }
  ]
}