{
  "author": "NullDonut",
  "the_new_excerpt": "TLDR; Decentralization allows blockchains to provide transparency, immutability,\nsecurity, scarcity, and trustless transacting. Without decentralization any one\nof these aspects can be compromised, completely defeating the purpose of using\nthe blockchain in the first place.\n\nI have been seeing a lot…",
  "original_created_utc": 1617699112,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TLDR; 非中央集権化により、ブロックチェーンは透明性、不変性。\nセキュリティ、希少性、そして信頼性の高い取引を実現します。分散化がなければ、これらの側面のどれか一つでも\nこれらの側面のどれかが損なわれる可能性があり、そもそもブロックチェーンを使用する目的が完全に失われます。\nそもそもブロックチェーンを使う意味がなくなってしまいます。\n\n私は、多くの...",
      "title": "非中央集権 - 暗号化において最も重要な概念"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TLDR;去中心化让区块链提供透明性、不可变性。\n安全性、稀缺性和无信任交易。没有权力下放，任何一个\n这些方面都会受到影响，完全失去了使用这些产品的目的。\n的区块链在第一时间。\n\n我已经看到很多...",
      "title": "去中心化--加密技术中最重要的一个概念"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TLDR;去中心化讓區塊鏈提供透明性、不可變性。\n安全性、稀缺性和無信任交易。沒有權力下放，任何一個\n這些方面都會受到影響，完全失去了使用這些產品的目的。\n的區塊鏈在第一時間。\n\n我已經看到很多...",
      "title": "去中心化--加密技術中最重要的一個概念"
    }
  ],
  "title": "Decentralization - The single most important concept in crypto",
  "created_utc": 1617719816,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TLDR; Decentralization allows blockchains to provide transparency, immutability, security, scarcity, and trustless transacting. Without decentralization any one of these aspects can be compromised, completely defeating the purpose of using the blockchain in the first place. </p>\n\n<p>I have been seeing a lot of misconceptions from people new to the space, largely concerning decentralization and why it is important for crypto as a whole. To some of you I&#39;m sure it seems like it&#39;s just a libertarian buzzword, only of concern to conspiracy theorists and people with something to hide. Others may simply not care, and are only in it for the gains (no judgement here, as this is what initially drew me to the space a few years ago). But the truth is that it is the single most important concept in all of crypto. Understanding that will give you a greater idea of what you&#39;re really investing in (and why you should be confident in that investment). </p>\n\n<p>I apologize in advance to anyone who is already a seasoned member of the space, but with the large influx of new investors it is important to reaffirm these concepts to prevent crypto from becoming a digital copy/paste of the current financial system. Not recognizing the importance of decentralization is something I fear will become a significant issue as adoption increases, so the more people we can educate now, the better.</p>\n\n<p>I&#39;m assuming if you&#39;re reading this you have at least a basic understanding of what decentralization is, but the short version is that it is a system with no central authority or means of control by an individual entity. So why is this important for crypto? To answer that you need to stop and think about what exactly is being gained by using crypto in the first place. </p>\n\n<p>Let&#39;s just use the obvious example here and go with Bitcoin. You get transparency, both in the codebase (which is open source, another *extremely* important concept), and in the ledger that is publicly viewable by anybody with an internet connection. You get immutability in the sense that your transactions and the records of them cannot be altered. You get security, implicitly able to trust that no matter who comes knocking at your door (greedy family members/criminals/LEAs in countries with corrupt governments), nobody can seize your assets without your private keys. You could even argue that scarcity is of benefit in Bitcoin&#39;s case, since this inherently makes it useful as a store of value. And of course, you gain the ability to transact in a *trustless* manner, meaning that there is no middle man required to send from A to B.</p>\n\n<p>The only reason you can have confidence that this system will work as intended every time you use it is due to decentralization. With central control of a blockchain, every single one of these aspects can and most likely will be compromised by someone acting in bad faith. </p>\n\n<p>In a centralized system transparency goes out the window. There&#39;s no guarantee that the ledger or codebase would be publicly viewable (and they likely wouldn&#39;t be). Immutability is also gone, because records of transactions can be easily altered by the entity controlling the blockchain. Even if the ledger is public, you can&#39;t guarantee that it hasn&#39;t been manipulated because it&#39;s under central control, which defeats the entire purpose.</p>\n\n<p>Security also gets tossed aside. A closed-source blockchain could easily have backdoor code intended to give the centralized entity access your wallet. This would allow individuals to steal your funds, or your wallet could be frozen; it could even be turned over to law enforcement. Whether or not they would actually do this is another story, but that ties nicely into the fact that &quot;trustless&quot; also gets thrown by the wayside when you have to *trust* a centralized entity not to fuck you over.</p>\n\n<p>Things get even worse when the centralized entity happens to be a corrupt government. Crypto is a great hedge for those living in third world countries with hyperinflated currencies, but leadership in these countries is often questionable at best. Say that a CBDC (central bank digital currency) is created and all citizens are forced to transact with it. The government now has the means to account for every single dollar spent by every single one of their citizens, and conveniently also has full access to each and every one of their wallets. Sounds like a great time to invent some new taxes!</p>\n\n<p>Scarcity is also important to consider when talking about CBDCs, because a central bank controlled cryptocurrency can be manipulated just as easily as fiat. There is no hedge against inflation when the entity controlling the blockchain can just decide to mint a trillion new tokens one day and tank the value of your savings. At best it just becomes a digital replacement for fiat without any of the benefits offered by a multitude of decentralized systems which already exist.  </p>\n\n<p>With all of these considerations in mind, there is really no reason to use a blockchain that is not decentralized. Systems already exist which are more efficient in terms of speed and ease of use, but they also come at the cost of centralized control (which I think I&#39;ve managed to successfully argue is not good thing). The reason blockchain tech is so important is that it *provides benefits these existing systems are incapable of.* Decentralization is the entire reason that it works, and without it all you  have is a digital version of the same shitty financial system we&#39;re all trying to escape from.</p>\n</div><!-- SC_ON -->",
  "score": 530,
  "permalink": "/r/CryptoCurrency/comments/ml79fk/decentralization_the_single_most_important/",
  "subreddit": "CryptoCurrency",
  "id": "ml79fk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961876902
}