{
  "author": "Apex_Starshine",
  "the_new_excerpt": "As the Fed caused a bit of a ripple in the market today and I considered\nvacating a position (but ultimately didn't). I thought a little bit about my\njourney over the years and thought I'd share a story and a few things I've\nlearned.\n\nBack in 2003, I made my first move in the stock market by taking…",
  "original_created_utc": 1623888980,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日はFRBが市場にちょっとした波風を立てたので、私はポジションを空けることを考えました。\nポジションを空けることを検討しました（最終的にはしませんでしたが）。この間の私の旅について少し考えてみました。\n私のこれまでの道のりについて少し考えてみたので、その話と私が学んだことを紹介したいと思います。\n学びました。\n\n2003年、私は初めて株式市場に参入しました...",
      "title": "若い投資家（または新しい投資家）への注意点"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "由于美联储今天在市场上引起了一些涟漪，我考虑过\n腾出了一个位置（但最终没有）。我想了一下我的\n我想了一下我这些年的历程，并认为我应该分享一个故事和一些我学到的东西。\n学到的东西。\n\n早在2003年，我在股票市场上的第一个动作是采取了...",
      "title": "给年轻投资者（或新投资者）的说明"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "由於美聯儲今天在市場上引起了一些漣漪，我考慮過\n騰出了一個位置（但最終沒有）。我想了一下我的\n我想了一下我這些年的歷程，並認爲我應該分享一個故事和一些我學到的東西。\n學到的東西。\n\n早在2003年，我在股票市場上的第一個動作是採取了...",
      "title": "給年輕投資者（或新投資者）的說明"
    }
  ],
  "title": "A note to young investors (or new investors)",
  "created_utc": 1623893545,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As the Fed caused a bit of a ripple in the market today and I considered vacating a position (but ultimately didn&#39;t).  I thought a little bit about my journey over the years and thought I&#39;d share a story and a few things I&#39;ve learned.</p>\n\n<p>Back in 2003, I made my first move in the stock market by taking an $1800 tax return and buying 200 shares of a coal company called Consol.  At the time it traded under the symbol CNX.  I bought it with almost no DD simply because it paid a pretty good dividend.  (Around .50/share if I recall correctly.)  This is back when internet trading really wasn&#39;t a thing.  I bought it through my bank and the trade cost me <strong>$40</strong>!  (I actually had to call a broker at my bank and place the trade over the phone.  Ancient times, right?)  lol  I figured, win lose or draw, eventually this stock will pay for itself with the dividend.  I didn&#39;t follow the market much after that because I was really holding for the dividend, but realized a couple of years later, it had climbed into the 30s.  Around 2007 it had hit 55 and I decided to sell.  Still with my bank, the trade cost me another forty bucks!  I took the money and put it in a basic savings account where it basically sat doing nothing until 2016.  (I missed the crash of 08, by being liquid at the time, but this was pure luck.  Nobody saw that coming.)</p>\n\n<p>In 2016, after some reading I decided I had more confidence in trading so I took the money and opened an investor&#39;s checking/trading account with Charles Schwab.  <em>I was amazed at trades costing $4.99 and done on my laptop</em>!  lol  After quite a bit of DD I decided to buy 300 shares of NVIDIA.  At around $24 a share, it cost me about $7200.  (I took the rest and made a down payment on a new (<em>used</em>) car and an AK-47.)  lol...</p>\n\n<p>After that, I just held the stock.  Diamond handed it as the kids say.  I&#39;ve bought and sold quite a few other stocks over the years, but those two trades are where I started.  Two trades over the course of 17 years turned an $1800 tax return into a nice safety net worth over $200,000 with almost no effort on my part.</p>\n\n<p>What have I learned?</p>\n\n<p>Even a small amount of money in the stock market can lead to a big return.  But don&#39;t invest more than you can afford.  For me, a tax return one year was about all I could throw at it in my 20s.  &quot;YOLOing&quot; your rent check is never a good idea.</p>\n\n<p>Be PATIENT.  You&#39;re not going to get rich overnight.  That type of thing is rare and risky.  Do your DD and hold onto what you&#39;re confident in.</p>\n\n<p>When the market takes a downturn, <strong>BUY!</strong>  One of my biggest regrets is not investing heavily in 2008 when I was very liquid and the market had taken a nose dive.  I did not repeat this mistake last April/May when the pandemic caused another crash.  I bought everything I could.  Particularly old giants like Ford, and GE which were no brainer bargains at &gt;$5.  The worst thing you can do is panic sell.  The market will come back.  Hold on and accumulate.  (I actually figured it might take 2 years for a comeback this time, but we bounced back much earlier.)  This thinking is what got me to hold the position I was thinking of bailing on today, when I realized I would just be panic selling in advance of some Fed news.  Regardless of the news, the market would bounce back.</p>\n\n<p>Never let savings sit in a traditional savings account. (<em>like I did for 8 years from 2007-2016...lol)</em>  Even if compound interest is all you&#39;re after, there are much better rates with other financial products.</p>\n\n<p>Be patient, <em>but don&#39;t be afraid to take profits</em>.  Don&#39;t fall in love.  Have an exit plan.  I sold Consol around 55 with a 9 entry.  Pretty good...  Later that same year, it climbed into the 90s.  Made me wince, but I didn&#39;t regret it.  <em>Unless you have a crystal ball, you&#39;re never going to enter at a historic low and exit at an all time high and that&#39;s ok.</em>  I realized at the time that coal was cyclical and was most likely going to decline in value in the coming years.  I stuck to the plan.  When I saw a spike, I sold.  For perspective, that high in the 90s in 08 hasn&#39;t been repeated since.  Consol trades in the high teens now and offers no dividend. (New ticker CEIX)  So in hindight I exited on a bubble that could have been better, but if I waited too long, it could have been much worse.</p>\n\n<p>It&#39;s never too late to start.  If you look at those two simple trades over the span of 17 years, you could potentially do the same thing in your late 40s with a small amount of money (<em>remember nothing you can&#39;t afford to lose)</em> and have a decent nest egg by the time you hit 100% retirement in your 60s.</p>\n\n<p>I hope to have given a little insight here.  I thought it was worth sharing.  If you disagree, don&#39;t be too hard on me.  I&#39;m not a financial professional...  :D</p>\n\n<p>Have a good&#39;un!</p>\n</div><!-- SC_ON -->",
  "score": 5950,
  "permalink": "/r/stocks/comments/o1jm8m/a_note_to_young_investors_or_new_investors/",
  "subreddit": "stocks",
  "id": "o1jm8m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009745278
}