{
  "author": "Laffingglassop",
  "original_created_utc": 1635810096,
  "title": "My fiances dad has less than 48 hours to live due to kidney/liver/heart failure from alcoholism, how can I help the next 48 hours, and the days after that",
  "created_utc": 1635838112,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My fiances dad has less than 48 hours to live due to kidney/liver/heart failure from alcoholism, how can I help the next 48 hours, and the days after that.</p>\n\n<p>This is a situation where 2 weeks ago litteraly nothing was wrong other than knowing he drinks too much. He was found passed out with low sodium levels, ive never heard of him being in the hospitable before. This quickly turned to liver and now kidney and heart failure. So basically no one could see this coming on this timeline. </p>\n\n<p>Im litteraly the most emotionally inept person ever, and my own crazy medical history that i obviously survived  made me fail to realize how bad his situation was as she described details to me over the last few days as his health spiraled downhill out of seemingly nowhere. </p>\n\n<p>Shes at her dads house now because hospital visitation ends in 20 minutes and her little (17) year old sister is there so shes beimg there with her.</p>\n\n<p>What can I do to help.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/qkr2mz/my_fiances_dad_has_less_than_48_hours_to_live_due/",
  "subreddit": "NoStupidQuestions",
  "id": "qkr2mz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My fiances dad has less than 48 hours to live due to kidney/liver/heart failure\nfrom alcoholism, how can I help the next 48 hours, and the days after that.\n\nThis is a situation where 2 weeks ago litteraly nothing was wrong other than\nknowing he drinks too much. He was found passed out with low…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の婚約者の父は、アルコール依存症からくる腎不全・肝不全・心不全で余命48時間を切っています。\nアルコール依存症からくる腎不全、肝不全、心不全です。\n\nこれは、2週間前には何も問題がなかったという状況です。\n2週間前には何の問題もなく、彼が飲み過ぎであることを知っていました。倒れているところを発見され、低血圧で...",
      "title": "私の婚約者である父は、アルコール依存症からくる腎不全、肝不全、心不全により、余命48時間を切っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的未婚夫的父亲由于肾脏/肝脏/心脏衰竭，只剩下不到48小时的生命。\n酗酒造成的，我怎样才能在接下来的48小时和之后的日子里帮助他。\n\n在这种情况下，2个星期前，除了知道他喝多了，几乎没有任何问题。\n他知道自己喝得太多了。他被发现昏倒在地，并有低血压。",
      "title": "我的未婚夫的父亲由于酗酒导致肾脏/肝脏/心脏衰竭，只剩下不到48小时的生命，我怎样才能在接下来的48小时内，以及之后的日子里帮助他？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的未婚夫的父親由於腎臟/肝臟/心臟衰竭，只剩下不到48小時的生命。\n酗酒造成的，我怎樣才能在接下來的48小時和之後的日子裏幫助他。\n\n在這種情況下，2個星期前，除了知道他喝多了，幾乎沒有任何問題。\n他知道自己喝得太多了。他被發現昏倒在地，並有低血壓。",
      "title": "我的未婚夫的父親由於酗酒導致腎臟/肝臟/心臟衰竭，只剩下不到48小時的生命，我怎樣才能在接下來的48小時內，以及之後的日子裏幫助他？"
    }
  ]
}