{
  "author": "ShapardZ",
  "the_new_excerpt": "There are a lot of metrics people rely on. What things do you weigh most heavily\nand what sort of things are you looking for? When you are doing due diligence,\nwhat metrics are most important to you?\n\nI’m fairly new to investing, and have mainly invested in companies that would be\nconsidered…",
  "original_created_utc": 1615597456,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "人们依赖的指标有很多。你最看重的是什么东西\n以及你在寻找什么样的东西？当你在做尽职调查时。\n哪些指标对你来说最重要？\n\n我对投资相当陌生，主要投资的公司会是\n考虑到...",
      "title": "如何做好尽职调查？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們依賴的指標有很多。你最看重的是什麼東西\n以及你在尋找什麼樣的東西？當你在做盡職調查時。\n哪些指標對你來說最重要？\n\n我對投資相當陌生，主要投資的公司會是\n考慮到...",
      "title": "如何做好盡職調查？"
    }
  ],
  "title": "How do you do your Due Diligence?",
  "created_utc": 1615607740,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There are a lot of metrics people rely on. What things do you weigh most heavily and what sort of things are you looking for? When you are doing due diligence, what metrics are most important to you?</p>\n\n<p>I’m fairly new to investing, and have mainly invested in companies that would be considered household names. These are stocks that a lot of other people have probably done due diligence on and determined that they were safe. Most of my time investigating stocks has been reading articles about other people’s opinions on the stock, and I’ve spent no time at all reading any sort of data out out by the companies, mainly because I don’t know how to read this sort of thing. I realize this isn’t an ideal strategy. If I knew what sort of things to look for, I might be more inclined to do so. So, what metrics do you use when you are doing your due diligence?</p>\n</div><!-- SC_ON -->",
  "score": 250,
  "permalink": "/r/stocks/comments/m3vr11/how_do_you_do_your_due_diligence/",
  "subreddit": "stocks",
  "id": "m3vr11",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147381390
}