{
  "author": "Public_Ingenuity_966",
  "the_new_excerpt": "So awhile back I met someone that had their significant other reading their\nmessages whenever they felt like it.\nI thought it was quite a red flag knowing that their partner doesn't respect the\nprivacy of the conversation we had that did not include their SO.\nAfter knowing their partner reads our…",
  "original_created_utc": 1620595792,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "しばらく前に、大切な人に好きな時にメッセージを読んでもらっている人に出会いました。\nメッセージを読ませている人に出会いました。\n私は、相手が自分のパートナーを含まない会話のプライバシーを尊重していないことを知って、それはかなりの赤信号だと思いました。\n私は、相手が自分のパートナーを含まない会話のプライバシーを尊重していないことを知って、かなり危険だと思いました。\n彼らのパートナーが私たちのメッセージを読んでいることを知った後は...",
      "title": "あなたのSOが、最初に許可を求めずに、あなたの友人とのメッセージを自由に読み、気が向いたときにあなたのアカウント/携帯電話にログインすることは大丈夫ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以前段时间我遇到了一个人，他让他们的另一半随时阅读他们的信息。\n只要他们想，就会读他们的信息。\n我认为这是一个相当大的红旗，因为我知道他们的伴侣并不尊重我们的谈话隐私。\n他们的伴侣不尊重我们谈话的隐私，不包括他们的SO。\n在知道他们的伴侣阅读了我们的信息后，我觉得这是很危险的。",
      "title": "你的SO可以不先征求你的同意就随意阅读你和朋友的信息，并随时登录你的账户/手机，这样做可以吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以前段時間我遇到了一個人，他讓他們的另一半隨時閱讀他們的信息。\n只要他們想，就會讀他們的信息。\n我認爲這是一個相當大的紅旗，因爲我知道他們的伴侶並不尊重我們的談話隱私。\n他們的伴侶不尊重我們談話的隱私，不包括他們的SO。\n在知道他們的伴侶閱讀了我們的信息後，我覺得這是很危險的。",
      "title": "你的SO可以不先徵求你的同意就隨意閱讀你和朋友的信息，並隨時登錄你的賬戶/手機，這樣做可以嗎？"
    }
  ],
  "title": "Is it okay for your SO to freely read your messages with your friends without asking for permission first and just log into your account/phone whenever they feel like it?",
  "created_utc": 1620646926,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So awhile back I met someone that had their significant other reading their messages whenever they felt like it.<br/>\nI thought it was quite a red flag knowing that their partner doesn&#39;t respect the privacy of the conversation we had that did not include their SO.<br/>\nAfter knowing their partner reads our chats whenever they felt like it, without first telling me about it and asking if it&#39;s okay with me, I felt really uncomfortable knowing that anything can be exposed to their partner whenever they felt like reading our chats.</p>\n\n<p>Ever since, I was kind of curious whether it&#39;s considered fine to have your partner simply have access to your accounts whenever they feel like reading your messages, simply because they don&#39;t want someone flirting with their partner?</p>\n\n<p>Even tho, doesn&#39;t that technically means they simply don&#39;t trust their partner to turn down anyone who does flirt?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TrueAskReddit/comments/n8o3h0/is_it_okay_for_your_so_to_freely_read_your/",
  "subreddit": "TrueAskReddit",
  "id": "n8o3h0",
  "is_self": true,
  "media": null,
  "is_video": false
}