{
  "author": "AffectionateMind26",
  "original_created_utc": 1645762829,
  "title": "If you hate Crypto because Putin might use it, you should also hate the internet, GPS, cars, airplanes, and oxygen.",
  "created_utc": 1645778661,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In recent comments and opinions from people involved with crypto and also from people not so involved in crypto about how Cryptocurrency&amp;#39;s image will be tainted if Putin uses it in future. &lt;/p&gt;\n\n&lt;p&gt;Putin will likely use Crypto to help circumvent sanctions and ensure he has other financial avenues.&lt;/p&gt;\n\n&lt;p&gt;But If you hate Crypto because Putin might use it, you should also hate the internet, cars, oxygen, water &amp;amp; earth. &lt;/p&gt;\n\n&lt;p&gt;Crypto isn’t just a safe haven asset. It’s also the perfect tool for refugees who seek to protect their wealth as they flee a war torn nation. &lt;/p&gt;\n\n&lt;p&gt;Cryptocurrencies have been neutral and always will be!&lt;/p&gt;\n\n&lt;p&gt;Stay safe everyone!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 372,
  "permalink": "/r/CryptoCurrency/comments/t0upoc/if_you_hate_crypto_because_putin_might_use_it_you/",
  "subreddit": "CryptoCurrency",
  "id": "t0upoc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In recent comments and opinions from people involved with crypto and also from\npeople not so involved in crypto about how Cryptocurrency's image will be\ntainted if Putin uses it in future.\n\nPutin will likely use Crypto to help circumvent sanctions and ensure he has\nother financial avenues.\n\nBut If…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近の暗号関係者のコメントや意見、また、暗号関係者のコメントや意見で\n暗号にあまり関係のない人たちが、暗号のイメージが悪くなることを話しています。\nプーチンが将来的に使用する場合、それを汚染する。\n\nプーチンはおそらく制裁を回避するために暗号を使い、確実に\n他の資金調達の手段\n\nしかし、もし...",
      "title": "プーチンが使うかもしれないから暗号を嫌うというのなら、インターネットもGPSも車も飛行機も酸素も嫌うべきだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在最近的评论和意见中，来自参与加密货币的人以及来自\n的评论中，有的人认为，如果普京在未来使用加密货币，加密货币的形象将被玷污。\n如果普京在未来使用它，加密货币的形象将被玷污。\n\n普京可能会使用加密货币来帮助规避制裁，确保他有\n其他金融渠道。\n\n但是，如果...",
      "title": "如果你因为普京可能使用加密货币而讨厌它，你也应该讨厌互联网、GPS、汽车、飞机和氧气。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在最近的評論和意見中，來自參與加密貨幣的人以及來自\n的評論中，有的人認爲，如果普京在未來使用加密貨幣，加密貨幣的形象將被玷污。\n如果普京在未來使用它，加密貨幣的形象將被玷污。\n\n普京可能會使用加密貨幣來幫助規避制裁，確保他有\n其他金融渠道。\n\n但是，如果...",
      "title": "如果你因爲普京可能使用加密貨幣而討厭它，你也應該討厭互聯網、GPS、汽車、飛機和氧氣。"
    }
  ]
}