{
  "author": "Jxntb733",
  "original_created_utc": 1638822713,
  "title": "I spent 5 hours researching what a DAO is so you didn’t have to.",
  "created_utc": 1638830202,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;What is a DAO?&lt;/strong&gt;  Standing for Decentralized Autonomous Organization, a DAO is an internet-native blockchain-derived investor-directed venture capital fund organization managed by all members. At its core they have an objective to provide a decentralized business model for all future enterprises. Mark Cuban called them “the ultimate combination of capitalism and progressivism.”&lt;/p&gt;\n\n&lt;p&gt;One important aspect is that all code is open-source. This is done with the aim to eliminate human error, manipulation, and third parties, by having an automated crowdsourced process of decision-making. Unlike a company, DAOs have democratized organizations allowing all members to vote for any implemented change. The DA organization is represented by transparent computational rules, secured on the digital ledger across the internet, hardened against forgery by timestamping, and disseminated as a distributed database. The DAO is controlled by the members; no managers or basses are needed.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Bitcoin in essence is the first fully functional DAO with programmed rules and functional autonomy through consensual protocol; the miners and nodes signal voting through support.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;strong&gt;DAOs need four things really;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;A set of rules,&lt;/li&gt;\n&lt;li&gt;A funding token,&lt;/li&gt;\n&lt;li&gt;Voting right provisions,&lt;/li&gt;\n&lt;li&gt;A clear structure &amp;amp; roadmap&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;table&gt;&lt;thead&gt;\n&lt;tr&gt;\n&lt;th align=\"left\"&gt;&lt;strong&gt;DAOs&lt;/strong&gt;&lt;/th&gt;\n&lt;th align=\"left\"&gt;&lt;strong&gt;A traditional corporation&lt;/strong&gt;&lt;/th&gt;\n&lt;/tr&gt;\n&lt;/thead&gt;&lt;tbody&gt;\n&lt;tr&gt;\n&lt;td align=\"left\"&gt;Flat hierarchy.&lt;/td&gt;\n&lt;td align=\"left\"&gt;Hierarchical.&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"left\"&gt;Voting required for any changes.&lt;/td&gt;\n&lt;td align=\"left\"&gt;Changes demanded from sole party, voting   may be offered.&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"left\"&gt;Voting outcome implemented automatically.&lt;/td&gt;\n&lt;td align=\"left\"&gt;Tallied internally and outcome handled   manually.&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"left\"&gt;Services handled automatically in a decentralized manner.&lt;/td&gt;\n&lt;td align=\"left\"&gt;Human handling, centrally controlled automation, prone to error and manipulation.&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"left\"&gt;All activity transparent and public.&lt;/td&gt;\n&lt;td align=\"left\"&gt;Activity private.&lt;/td&gt;\n&lt;/tr&gt;\n&lt;/tbody&gt;&lt;/table&gt;\n\n&lt;p&gt;&lt;strong&gt;Creation of a DAO:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Step one; create a smart contract that once launched the rules can only be changed by coded governance system.&lt;/li&gt;\n&lt;li&gt;Step two; sources of funding must be determined and governance must be engaged, typically funded via token sale that come with voting rights.&lt;/li&gt;\n&lt;li&gt;Step three; deploy smart contract on the blockchain from which point onward stallholders will decide future organization. The dev(s) have no more influence than any other stakeholder.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;How can I join a DAO?:&lt;/strong&gt;  Just invest in their token, and boom, you’ve joined. The smart contract token you just bought establishes the DAO’s rules, most likely you have to stake the token or another in the DAO to get voting rights and influence operations. This is typically done by deciding on and creating governance proposals. The fact that you need to stake to create proposals is to prevent spam proposals, and only (typically) proposals will pass if a majority of stakeholders approve (different percentage majority per DAO; specified in the smart contract).&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What’s the point? Where is the need?&lt;/strong&gt;  Are we all not internet native, or soon will be? DAOs are internet-native organizations with technological advantages compared to traditional companies. They have and establish a higher level of trust then say, the classical corporate hierarchy. Only the open source code needs to be trusted which is transparent thus auditable and verifiable at any time. This solves the economic principle-agent-dilemma where there may be a conflict of priorities between a group and those making the decisions for the group. The answer is community governance where incentives are aligned. There are charity DAOs, ones for NFT investments, for funding projects by Black women and non-binary artists, for funding women and non-binary crypto founders, some are exclusive social clubs, and others are for-profit business applications. I’ve even seen freelance DAO networks of contractor.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;strong&gt;Examples of DAOs:&lt;/strong&gt;  Aragon, MakerDAO (MKR), DAOstack, DASH, JennyDAO, Jelurida, SharkDAO, DAOhaus, RaidGuild, Proof Of Humanity, Opolis, BanklessDAO, MolochDAO,&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;strong&gt;Downsides of DAOs:&lt;/strong&gt; No organization is perfect, decentralized or autonomous or not. This is extremely new technology that continues to attract criticisms over legality, security, and structural issues. As a DAO can be distributed across multiple jurisdictions, there is no legal framework. One may have heard about ‘The DAO’ crashing, as back in 2016. ‘The DAO’ was launched on Ethereum and raised $150 million in ETH (largest crowdfunding effort at the time) but a few days later developers expressed concern about a bug that would allow malicious actors to drain funds, and while a proposal was set forth to fix it an attacker took $60 million worth of ETH. At the time, 14% of all circulating ETH was invested in ‘The DAO’. Chaos ensued and a hardfork was implemented on ETH. Those who disagreed moved to support an earlier version of the ETH network, which became known as Ethereum Classic, or ETC. Point being if any gaps in the contract framework aren’t closed before launch, it can lead to potential theft and money loss. &lt;em&gt;There is no such thing as a fully D &amp;amp; A organization.&lt;/em&gt;  Depending on governance, there are only various levels of decentralization. While the network may have independent but equal network actors, the smart contract rules themselves will always be a centralized loss of direct autonomy; architecturally and geographically decentralized yes but logically centralized on the protocol. Upgrading of code is often delegated to experts who understand techno-legal intricacies of code and are therefore a point of centralization.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Future of DAOs:&lt;/strong&gt;  Despite the potential for DAOs to revolutionize the industry, and be a disruptive force to corporate structuring as a whole, they face security and legality issues.  As we all know the SEC claims some blockchain based companies might have made illegal offers of unregistered securities. There is also a lack of understanding about cryptocurrencies from new investors, not to mention the technical competence one needs to understand the computational infrastructure and consensus mechanisms within the smart contract to feel good about investing in it. It’s not all bad though, Wyoming just became the first state to recognize DAOs as legal entities. DeepDAO says there are about 181 DAOs, with an ecosystem’s total assets under management (AUM) of $13.4 billion.&lt;/p&gt;\n\n&lt;p&gt;Somewhere, in some business boardroom, people are trying to figure out how to integrate self-driving cars into DAOs of autonomous taxi drivers. You order an Uber and it comes, no company, just code.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 514,
  "permalink": "/r/CryptoCurrency/comments/ragxwq/i_spent_5_hours_researching_what_a_dao_is_so_you/",
  "subreddit": "CryptoCurrency",
  "id": "ragxwq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "What is a DAO? Standing for Decentralized Autonomous Organization, a DAO is an\ninternet-native blockchain-derived investor-directed venture capital fund\norganization managed by all members. At its core they have an objective to\nprovide a decentralized business model for all future enterprises. Mark…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "DAOとは？Decentralized Autonomous Organization（分散型自律組織）の略で、DAOとは\nインターネットネイティブなブロックチェーン由来の投資家主導型ベンチャーキャピタルファンドです。\nメンバー全員で運営する組織です。その中核は、以下の目的を持っています。\n将来のすべての企業に分散型ビジネスモデルを提供します。マーク...",
      "title": "私は5時間かけてDAOとは何かを調べたので、あなたはその必要はありませんでした。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "什么是DAO？DAO是去中心化自治组织的意思，它是一种以互联网为基础的区块链衍生投资。\n互联网原生区块链衍生的投资者指导的风险投资基金\n组织，由所有成员管理。其核心是，他们的目标是\n为所有未来的企业提供一个去中心化的商业模式。马克...",
      "title": "我花了5个小时研究什么是DAO，这样你就不必了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "什麼是DAO？DAO是去中心化自治組織的意思，它是一種以互聯網爲基礎的區塊鏈衍生投資。\n互聯網原生區塊鏈衍生的投資者指導的風險投資基金\n組織，由所有成員管理。其核心是，他們的目標是\n爲所有未來的企業提供一個去中心化的商業模式。馬克...",
      "title": "我花了5個小時研究什麼是DAO，這樣你就不必了。"
    }
  ]
}