{
  "author": "mrginopalacca",
  "the_new_excerpt": "TIME IS THE MOST VALUABLE ASSET IN THE WORLD. YOUR TIME IS LIMITED, AND YOU CAN\nNOT DO ANYTHING ABOUT THIS.\n\nDays are passing, and they are gone forever. Becoming a parent 7 years ago\ntaught me this lesson. Kids are growing fast, and you can not go back, just\nforward.\n\nThis week I liquidated a…",
  "original_created_utc": 1612893640,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "时间是世界上最有价值的资产。你的时间是有限的，而你可以\n不要做任何事情。\n\n日子在流逝，他们永远地离开了。七年前成为父母\n给我上了这一课。孩子们的成长速度很快，你不能回头，只是\n前进。\n\n这周我清算了一...",
      "title": "比特币是一个时间机器. 它是一台时间机器。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "時間是世界上最有價值的資產。你的時間是有限的，而你可以\n不要做任何事情。\n\n日子在流逝，他們永遠地離開了。七年前成爲父母\n給我上了這一課。孩子們的成長速度很快，你不能回頭，只是\n前進。\n\n這周我清算了一...",
      "title": "比特幣是一個時間機器. 它是一臺時間機器。"
    }
  ],
  "title": "Bitcoin is a time machine. It is a time machine.",
  "created_utc": 1612906432,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>Time is the most valuable asset in the world. Your time is limited, and you can not do anything about this.</h1>\n\n<p>Days are passing, and they are gone forever. Becoming a parent 7 years ago taught me this lesson. Kids are growing fast, and you can not go back, just forward.</p>\n\n<p>This week I liquidated a reasonable part of my Bitcoin investments. I have been carefully stacking the sats for 5 years now, lived through ups and downs, holding all along solidly. My liquidated profits add up now to 10 years of my normal salary. Well, 10 years of my previously normal salary.</p>\n\n<h1>Because today I left my job. For good. At least for 10 years.</h1>\n\n<p>I want to spend the next 10 years being there for my kids, watching them grow, and being there for them completely. <strong>I will not be the occupied and preoccupied dad sitting at the dining table responding to work emails. I will not be the distant dad always thinking about something very important. Not any more.</strong> I want to be the dad who has always <strong>time</strong>, at least for the next ten years, while my kids will still be children.</p>\n\n<h1>Time is important, and Bitcoin bought me time. Time to live freely and fully, without the daily stress of earning for the next ten years.</h1>\n\n<p><strong>Bitcoin is a miracle. For some, it creates Lambos and Teslas, for some it means yachts and airplanes. To me, it is a time machine.</strong> Nothing ever in my life gave me back my time, nothing until Bitcoin came along.</p>\n\n<p>A wonderful thing is happening around us, Bitcoin is turning the traditional wealth distribution of the world upside down. It is democratic, it is unconfiscatable, and it is there for everyone.</p>\n\n<p>I will hold to the rest of my sats until at least the next 10 years. Hope they will provide me with some further relaxing time.</p>\n\n<p>----</p>\n\n<p>PS: seeing the comments, okay okay, it is not just about the kids, time will be used for self-development and also for doing some good in the world as well, I did not say I will do nothing now :)</p>\n</div><!-- SC_ON -->",
  "score": 1092,
  "permalink": "/r/Bitcoin/comments/lg96r9/bitcoin_is_a_time_machine_it_is_a_time_machine/",
  "subreddit": "Bitcoin",
  "id": "lg96r9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123191937
}