{
  "author": "Uberguuy",
  "the_new_excerpt": "Gloop (if you didn't know) is a fat and greedy little German boy who always\nwants more to eat. In my life, I've seen plenty of other works use this idea of\na jolly plump German boy who loves to eat sweets. Did Dahl first bring the idea\nof this stock character to prominence, or did the idea already…",
  "original_created_utc": 1620570914,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Gloop（ご存知ないかもしれませんが）は、太っていて欲張りなドイツ人の男の子で、いつももっと食べたいと思っています。\nもっと食べたいと思っています。お菓子を食べるのが大好きな、陽気でふくよかなドイツ人の男の子という設定は、私の人生の中で他の作品でもよく見てきました。\nお菓子を食べるのが大好きな、陽気でふくよかなドイツ人の少年。ダールが最初にこのアイデアを持ち込んだのは\nそれとも、すでにあったものなのでしょうか？",
      "title": "Roald Dahlが1964年に『Charlie and the Chocolate Factory』を書いたとき、Augustus Gloopというキャラクターは彼自身が考え出したものなのか、それとも既存のパターンを参考にしたものなのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "格鲁普（如果你不知道）是一个肥胖和贪婪的德国小男孩，他总是\n想吃更多的东西。在我的生活中，我已经看到很多其他作品使用了这种想法，即\n一个喜欢吃甜食的快乐的丰满的德国男孩。达尔是否首先将这个想法\n这个人物的想法，还是说这个想法已经...",
      "title": "当罗尔德-达尔在1964年写《查理和巧克力工厂》时，他是自己想出了奥古斯都-格洛普这个人物，还是参考了一个现有的特例？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "格魯普（如果你不知道）是一個肥胖和貪婪的德國小男孩，他總是\n想喫更多的東西。在我的生活中，我已經看到很多其他作品使用了這種想法，即\n一個喜歡喫甜食的快樂的豐滿的德國男孩。達爾是否首先將這個想法\n這個人物的想法，還是說這個想法已經...",
      "title": "當羅爾德-達爾在1964年寫《查理和巧克力工廠》時，他是自己想出了奧古斯都-格洛普這個人物，還是參考了一個現有的特例？"
    }
  ],
  "title": "When Roald Dahl wrote Charlie and the Chocolate Factory in 1964, did he come up with the character Augustus Gloop himself, or was he referencing an existing trope?",
  "created_utc": 1620593243,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Gloop (if you didn&#39;t know) is a fat and greedy little German boy who always wants more to eat. In my life, I&#39;ve seen plenty of other works use this idea of a jolly plump German boy who loves to eat sweets. Did Dahl first bring the idea of this stock character to prominence, or did the idea already exist, and did Dahl just borrow it from cultural memory?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/n8fg0y/when_roald_dahl_wrote_charlie_and_the_chocolate/",
  "subreddit": "AskHistorians",
  "id": "n8fg0y",
  "is_self": true,
  "media": null,
  "is_video": false
}