{
  "author": "ImBatman_No_really",
  "original_created_utc": 1655612862,
  "title": "Is it possible to develop a romantic interest in somebody when you already have a Boyfriend you love ?",
  "created_utc": 1655657591,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My girlfriend of three years recently had gotten into a romantic relationship with her married co-worker; At first she used to say it was just an overly caring friend, but the other dude&amp;#39;s wife had a looksie at his messages and seemed to have called out my gf at work. Apparently they were flirting and he was buying her expensive stuff; &lt;/p&gt;\n\n&lt;p&gt;I did know about the expensive gifts and the long calls, but she&amp;#39;d normally brush it off saying he&amp;#39;s just a caring guy, he&amp;#39;s like that with everyone. &lt;/p&gt;\n\n&lt;p&gt;Anyways she claims to love me still, this was just a slip-up since it never went physical, and she didn&amp;#39;t realise herself.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve come to terms that whatever the rationalisation, the real problem here was with my own relationship and broke up. &lt;/p&gt;\n\n&lt;p&gt;She hasn&amp;#39;t accepted that she didn&amp;#39;t love me even after the break-up and I guess I never am able to believe that someone would do this intentionally to someone they love; &lt;/p&gt;\n\n&lt;p&gt;Sorry if my story seems incoherent, I&amp;#39;d be happy to fill in a few more details if needed, but i thought the situation wasn&amp;#39;t anything anybody has not heard about before.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/vfn79l/is_it_possible_to_develop_a_romantic_interest_in/",
  "subreddit": "TooAfraidToAsk",
  "id": "vfn79l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My girlfriend of three years recently had gotten into a romantic relationship\nwith her married co-worker; At first she used to say it was just an overly\ncaring friend, but the other dude's wife had a looksie at his messages and\nseemed to have called out my gf at work. Apparently they were flirting…"
}