{
  "author": "ImBatman_No_really",
  "original_created_utc": 1655612862,
  "title": "Is it possible to develop a romantic interest in somebody when you already have a Boyfriend you love ?",
  "created_utc": 1655657591,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My girlfriend of three years recently had gotten into a romantic relationship with her married co-worker; At first she used to say it was just an overly caring friend, but the other dude&amp;#39;s wife had a looksie at his messages and seemed to have called out my gf at work. Apparently they were flirting and he was buying her expensive stuff; &lt;/p&gt;\n\n&lt;p&gt;I did know about the expensive gifts and the long calls, but she&amp;#39;d normally brush it off saying he&amp;#39;s just a caring guy, he&amp;#39;s like that with everyone. &lt;/p&gt;\n\n&lt;p&gt;Anyways she claims to love me still, this was just a slip-up since it never went physical, and she didn&amp;#39;t realise herself.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve come to terms that whatever the rationalisation, the real problem here was with my own relationship and broke up. &lt;/p&gt;\n\n&lt;p&gt;She hasn&amp;#39;t accepted that she didn&amp;#39;t love me even after the break-up and I guess I never am able to believe that someone would do this intentionally to someone they love; &lt;/p&gt;\n\n&lt;p&gt;Sorry if my story seems incoherent, I&amp;#39;d be happy to fill in a few more details if needed, but i thought the situation wasn&amp;#39;t anything anybody has not heard about before.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/vfn79l/is_it_possible_to_develop_a_romantic_interest_in/",
  "subreddit": "TooAfraidToAsk",
  "id": "vfn79l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My girlfriend of three years recently had gotten into a romantic relationship\nwith her married co-worker; At first she used to say it was just an overly\ncaring friend, but the other dude's wife had a looksie at his messages and\nseemed to have called out my gf at work. Apparently they were flirting…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、3年付き合っている彼女が恋愛関係に発展していました\n最初は「ただの気の置けない友達」といっていたのですが、相手の奥さんが\nっていたのですが、相手の奥さんが彼のメッセージをみて\n職場で私の奥さんを呼び出したようです。どうやら二人はイチャイチャしていたらしい...。",
      "title": "すでに好きな人がいるのに、その人に恋心を抱くことは可能なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我结婚三年的女友最近陷入了一段浪漫的关系中\n与她的已婚同事建立了恋爱关系；起初她曾说这只是一个过分关心的朋友。\n关心的朋友，但对方的妻子看了看他的信息，似乎并不满意。\n似乎已经在工作中叫出了我的女朋友。显然，他们在调情......",
      "title": "当你已经有一个你喜欢的男朋友时，是否有可能对某人产生浪漫的兴趣？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我結婚三年的女友最近陷入了一段浪漫的關係中\n與她的已婚同事建立了戀愛關係；起初她曾說這只是一個過分關心的朋友。\n關心的朋友，但對方的妻子看了看他的信息，似乎並不滿意。\n似乎已經在工作中叫出了我的女朋友。顯然，他們在調情......",
      "title": "當你已經有一個你喜歡的男朋友時，是否有可能對某人產生浪漫的興趣？"
    }
  ]
}