{
  "author": "huge_dingus",
  "original_created_utc": 1637149848,
  "title": "Bitcoin is keeping my family together",
  "created_utc": 1637170241,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I live abroad with my wife and child. I can&#39;t travel back to my home country because I&#39;d be unable to leave due to travel restrictions. My wife and child have different passports than me so they wouldn&#39;t be able to join me if I went back.</p>\n\n<p>If my bank ever closes my account or requires me to be in-person I may have to choose between losing banking access &amp; not seeing my family for a long time. My young child would have to grow up without a dad.</p>\n\n<p>Governments and banks won&#39;t give a shit if my family gets torn apart. I don&#39;t trust them to do the right thing with my money or look out for my family.</p>\n\n<p>I work remotely and get paid in Bitcoin. It provides my family with tremendous financial security despite the price volatility.</p>\n\n<p>People who say Bitcoin doesn&#39;t solve any real-world problems don&#39;t understand that there are people in situations similar to, or even worse than mine. If you look past your first-world traditional-lifestyle bubble, Bitcoin absolutely solves problems for many.</p>\n</div><!-- SC_ON -->",
  "score": 214,
  "permalink": "/r/Bitcoin/comments/qvxls6/bitcoin_is_keeping_my_family_together/",
  "subreddit": "Bitcoin",
  "id": "qvxls6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I live abroad with my wife and child. I can't travel back to my home country\nbecause I'd be unable to leave due to travel restrictions. My wife and child\nhave different passports than me so they wouldn't be able to join me if I went\nback.\n\nIf my bank ever closes my account or requires me to be in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は妻と子供と一緒に海外で暮らしています。海外で妻子と暮らしています。\n帰ることができません。妻と子どもは\n私と異なるパスポートを持っているので、帰国しても一緒に行くことができません。\n帰ることができない。\n\nもし、銀行が私の口座を閉鎖したり、私に入国を要求したりしたら...。",
      "title": "ビットコインが私の家族を支えている"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我与我的妻子和孩子住在国外。我不能回国旅行\n因为由于旅行限制，我无法离开。我的妻子和孩子\n有不同的护照，所以如果我回国，他们就不能和我一起去。\n回国。\n\n如果我的银行有一天关闭了我的账户或要求我在...",
      "title": "比特币让我的家人在一起"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我與我的妻子和孩子住在國外。我不能回國旅行\n因爲由於旅行限制，我無法離開。我的妻子和孩子\n有不同的護照，所以如果我回國，他們就不能和我一起去。\n回國。\n\n如果我的銀行有一天關閉了我的賬戶或要求我在...",
      "title": "比特幣讓我的家人在一起"
    }
  ]
}