{
  "author": "roberthonker",
  "original_created_utc": 1633910427,
  "title": "It doesn’t matter how fast, cheap or secure your blockchain is if no one wants to use it.",
  "created_utc": 1633927640,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know this is a blasphemous post to most of this sub, but give me a read before you downvote. </p>\n\n<p>I think the most underrated aspect of a crypto project is the network effect. The network effect refers to the adoption that a network has, in cryptos case it would be decentralized applications.</p>\n\n<p>A lot of people get caught up in finding the fastest or cheapest smart contract platform, but they don’t care about a platform that is actually being used. </p>\n\n<p>To put things into perspective, the average Ethereum fee has been 28$ for the last few months. That means that people want to use Ethereum so much that they are willing to pay a fucking ridiculous amount to use it.</p>\n\n<p>You’re probably thinking: “what an asshole, he’s justifying gas fees”. That is definitely not what I’m doing. Gas fees suck. But you have to admit that it really says something when people are willing to pay exorbitant amounts of money just for the privilege to use a platform. </p>\n\n<p><strong>TL;DR: Fast and cheap blockchains are great, but what matters most for a blockchain is that people want to use it.</strong></p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/q5jv01/it_doesnt_matter_how_fast_cheap_or_secure_your/",
  "subreddit": "CryptoCurrency",
  "id": "q5jv01",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know this is a blasphemous post to most of this sub, but give me a read before\nyou downvote.\n\nI think the most underrated aspect of a crypto project is the network effect.\nThe network effect refers to the adoption that a network has, in cryptos case it\nwould be decentralized applications.\n\nA lot…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、このサブのほとんどの人にとって、神を冒涜するような投稿であることはわかっていますが、ダウンボットする前に読んでみてください。\n批判する前に読んでください。\n\n暗号プロジェクトで最も過小評価されている側面は、ネットワーク効果だと思います。\nネットワーク効果とは、ネットワークが持つ採用率のことで、暗号の場合は分散型アプリケーションになります。\n暗号の場合は分散型アプリケーションになります。\n\n多くの...",
      "title": "どんなに速くても、安くても、安全なブロックチェーンでも、誰も使いたがらなければ意味がありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道这对这个子的大多数人来说是个亵渎性的帖子，但在你降权之前，请给我读一下\n你可以先读一读。\n\n我认为加密项目中最被低估的方面是网络效应。\n网络效应指的是一个网络的采用，在加密货币的情况下，它是指\n将是去中心化的应用。\n\n很多...",
      "title": "如果没有人愿意使用你的区块链，那么它有多快、多便宜、多安全都不重要。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道這對這個子的大多數人來說是個褻瀆性的帖子，但在你降權之前，請給我讀一下\n你可以先讀一讀。\n\n我認爲加密項目中最被低估的方面是網絡效應。\n網絡效應指的是一個網絡的採用，在加密貨幣的情況下，它是指\n將是去中心化的應用。\n\n很多...",
      "title": "如果沒有人願意使用你的區塊鏈，那麼它有多快、多便宜、多安全都不重要。"
    }
  ]
}