{
  "author": "ilikethetech_100",
  "original_created_utc": 1625323512,
  "title": "Yesterday I tipped 100 moons to the moonless and 2 things became apparent...",
  "created_utc": 1625333632,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was tipped my first moon a couple of months ago and it felt awesome! So yesterday I figured I would tip out moons to people that didn&#39;t have any. Two things became apparent #1 about half the people commenting did not know what a moon even was #2 a lot of the people commenting did not know they had to unlock their vault. If you just comment &quot;what are moons&quot; a bot will give you a link to a detailed description of what a moon is and how to set up your vault (which is an eth wallet). I will actually comment below and spawn the bot for those who want to learn about moons/vault. A few people activated their vault just to discover they already had some moons. I hope this helps a few people.</p>\n</div><!-- SC_ON -->",
  "score": 315,
  "permalink": "/r/CryptoCurrency/comments/ocze71/yesterday_i_tipped_100_moons_to_the_moonless_and/",
  "subreddit": "CryptoCurrency",
  "id": "ocze71",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was tipped my first moon a couple of months ago and it felt awesome! So\nyesterday I figured I would tip out moons to people that didn't have any. Two\nthings became apparent #1 about half the people commenting did not know what a\nmoon even was #2 a lot of the people commenting did not know they had…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2ヶ月前に初めて月を傾けられましたが、最高に気持ちよかったです。だから\n昨日、ムーンを持っていない人にムーンをチップしてあげようと思ったんだ。その結果、2つのことが明らかになりました。\n1 コメントしてくれた人の約半分は、月が何なのか知らなかった。\n2 多くの人が、自分が月を持っていることを知らなかった。",
      "title": "昨日、100ムーンをムーンレスに傾けてみて、2つのことがわかりました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几个月前，我的第一个月亮被翻了出来，感觉棒极了! 所以\n昨天，我想我应该给那些没有月亮的人提供小费。有两件事\n事情变得很明显 #1 大约一半的人在评论中不知道月亮是什么。\n月亮甚至是什么 #2 很多人评论时不知道他们有...",
      "title": "昨天，我把100个月亮倾斜给无月，有两件事变得很明显......"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾個月前，我的第一個月亮被翻了出來，感覺棒極了! 所以\n昨天，我想我應該給那些沒有月亮的人提供小費。有兩件事\n事情變得很明顯 #1 大約一半的人在評論中不知道月亮是什麼。\n月亮甚至是什麼 #2 很多人評論時不知道他們有...",
      "title": "昨天，我把100個月亮傾斜給無月，有兩件事變得很明顯......"
    }
  ]
}