{
  "author": "RusticBohemian",
  "original_created_utc": 1646155637,
  "title": "The Roman Emperor Marcus Aurelius was annoyed by the bad BO of some of his courtiers and subjects and decided to inform them of their stinky state. Was intolerance to BO common before modern deodorants? Did people have a way to address it besides washing with water?",
  "created_utc": 1646208327,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;“Are you angry when someone’s armpits stink or when their breath is bad? What would be the point? Having such a mouth and such armpits, there’s going to be a smell emanating. You say, they must have sense, can’t they tell how they are offending others? Well, you have sense too, congratulations! So, use your natural reason to awaken theirs, show them, call it out. If the person will listen, you will have cured them without useless anger. No drama nor unseemly show required.”&lt;/em&gt;  &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;MARCUS AURELIUS,&lt;/em&gt; &lt;em&gt;MEDITATIONS&lt;/em&gt;, 5.28&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m aware that Marcus was a Stoic, and the reframing of his annoyance above was a way of coming to terms with things he couldn&amp;#39;t control and refocusing on what he could — either telling people they stank so they could address it, or shutting up and accepting that sometimes armpits just stink.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m friends with a few people who are all about natural living. That means no deodorant, and perhaps questionable bathing habits. They often have a notably unpleasant reek. I&amp;#39;ve heard the au naturel crowd claim that people have always had BO, and it&amp;#39;s only modern people who are perturbed by it and try to reign it in through bathing and deodorants, etc.&lt;/p&gt;\n\n&lt;p&gt;But is that true? How common was dislike of BO? Did people just get used to it, or was it always annoying?&lt;/p&gt;\n\n&lt;p&gt;In the premodern era, did people bath to address BO? Did they have any other remedies? Is dislike of BO really a mostly modern thing, with outliers like the rich Marcus Aurelius representing a snobbish view?&lt;/p&gt;\n\n&lt;p&gt;Just what did Marcus expect his subjects to do once informed of their stinkiness? Just take a bath? Something else?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/t4d874/the_roman_emperor_marcus_aurelius_was_annoyed_by/",
  "subreddit": "AskHistorians",
  "id": "t4d874",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "> “Are you angry when someone’s armpits stink or when their breath is bad? What\n> would be the point? Having such a mouth and such armpits, there’s going to be\n> a smell emanating. You say, they must have sense, can’t they tell how they are\n> offending others? Well, you have sense too,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "> 「人のワキが臭かったり、息が臭かったりすると怒るのか？なんて\n> ということでしょうか？こんな口とこんな脇の下じゃ、そりゃあもう\n> 臭いを発散している。彼らは感覚があるはずだ、自分がどうなっているのかわからないのか、と。\n> 他人を不快にさせる？まあ、あなたにもセンスはありますから......。",
      "title": "ローマ皇帝マルクス・アウレリウスは、一部の廷臣や臣下の悪しきBOに腹を立て、自分たちの臭い状態を知らせようと考えた。現代のデオドラント剤以前に、BOに対する不寛容さは一般的だったのだろうか？人々は、水で洗う以外に対処する方法があったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "> \"当某人的腋窝发臭或口臭时，你会生气吗？什么\n> 有什么意义呢？有这样的嘴和这样的腋窝，肯定会有\n> 味道散发出来。你说，他们一定有感觉，难道他们不能知道自己是如何\n> 冒犯了别人？好吧，你也有感觉，...",
      "title": "罗马皇帝马库斯-奥勒留（Marcus Aurelius）对他的一些朝臣和臣民的不良BO感到恼火，决定告知他们的臭味。在现代除臭剂之前，对BO的不耐受是否很普遍？除了用水清洗之外，人们是否有办法解决这个问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> \"當某人的腋窩發臭或口臭時，你會生氣嗎？什麼\n> 有什麼意義呢？有這樣的嘴和這樣的腋窩，肯定會有\n> 味道散發出來。你說，他們一定有感覺，難道他們不能知道自己是如何\n> 冒犯了別人？好吧，你也有感覺，...",
      "title": "羅馬皇帝馬庫斯-奧勒留（Marcus Aurelius）對他的一些朝臣和臣民的不良BO感到惱火，決定告知他們的臭味。在現代除臭劑之前，對BO的不耐受是否很普遍？除了用水清洗之外，人們是否有辦法解決這個問題？"
    }
  ]
}