{
  "author": "thickcruise6",
  "the_new_excerpt": "I predict the fed will raise rates this year and I plan on moving money out of\nequity funds and into somethibg else. What are good funds or other investments\nto move money into if interest rates increase and equity markets decline,\nbesides inverse sp500 type etfs?\n\nI am concerned about housing price…",
  "original_created_utc": 1623740044,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はFRBが今年中に利上げすると予測しており、株式ファンドから他のファンドに資金を移すことを計画しています。\n株式ファンドから他のものに資金を移そうと思っています。その場合、資金を移すのに適したファンドやその他の投資先は何でしょうか？\n金利が上昇し、株式市場が下落した場合、資金を移すのに良いファンドや他の投資先はありますか？\ninverse sp500タイプのETF以外で。\n\n私は住宅価格を心配しています...",
      "title": "金利が上昇した場合の動きは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我预测美联储将在今年加息，我计划将资金从股票基金中转出，转入其他基金。\n我打算把钱从股票基金中移出来，转到其他地方。如果利率上升，股票价格上涨，有什么好的基金或其他投资\n如果利率上升，股票市场下跌，除了SP500反向ETF外，还有什么好的基金或其他投资可供转移资金？\n除了反向SP500类型的ETF之外，还有什么好的基金或其他投资可以转移资金？\n\n我关注的是住房价格...",
      "title": "如果利率上升，你有什么举措"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我預測美聯儲將在今年加息，我計劃將資金從股票基金中轉出，轉入其他基金。\n我打算把錢從股票基金中移出來，轉到其他地方。如果利率上升，股票價格上漲，有什麼好的基金或其他投資\n如果利率上升，股票市場下跌，除了SP500反向ETF外，還有什麼好的基金或其他投資可供轉移資金？\n除了反向SP500類型的ETF之外，還有什麼好的基金或其他投資可以轉移資金？\n\n我關注的是住房價格...",
      "title": "如果利率上升，你有什麼舉措"
    }
  ],
  "title": "What are your moves if interest rates increase",
  "created_utc": 1623764528,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I predict the fed will raise rates this year and I plan on moving money out of equity funds and into somethibg else. What are good funds or other investments to move money into if interest rates increase and equity markets decline, besides inverse sp500 type etfs? </p>\n\n<p>I am concerned about housing price inflation. Housing prices , especially real estate has been increasing steadily for a decade, but it recently went into hyper mode. This is unsustainable. I predict the fed will have to act before single wide mobile homes in Indiana cost $2MM. I really dont see how interest rates can continue to stay this low much longer.</p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/investing/comments/o0814b/what_are_your_moves_if_interest_rates_increase/",
  "subreddit": "investing",
  "id": "o0814b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009742347
}