{
  "author": "spacpro",
  "the_new_excerpt": "We have seen about a dozen EV companies this year to go public, but this one is\ndifferent. Most of this companies like Fisker entirely base their valuation on\nprojected revenue estimates and have not a single unit sold and driving out on\nthe streets.\n\nLightning eMotors has delivered more commercial…",
  "original_created_utc": 1607799130,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们今年已经看到大约12家电动汽车公司上市，但这一家是\n不一样的。像Fisker这样的大多数公司的估值完全基于\n预计收入估计，并且没有一个单位售出和驱赶出去\n街道上。\n\nLightning eMotors提供了更多商业…",
      "title": "新电动汽车股票$GIK-在美国交付的商用电动汽车比福特和戴姆勒加起来还多"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們今年已經看到大約12家電動汽車公司上市，但這一家是\n不一樣的。像Fisker這樣的大多數公司的估值完全基於\n預計收入估計，並且沒有一個單位售出和驅趕出去\n街道上。\n\nLightning eMotors提供了更多商業…",
      "title": "新電動汽車股票$GIK-在美國交付的商用電動汽車比福特和戴姆勒加起來還多"
    }
  ],
  "title": "New EV stock $GIK - The company that delivered more commercial electric vehicles in the US than Ford and Daimler combined",
  "created_utc": 1607945298,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We have seen about a dozen EV companies this year to go public, but this one is different. Most of this companies like Fisker entirely base their valuation on projected revenue estimates and have not a single unit sold and driving out on the streets.</p>\n\n<p>Lightning eMotors has delivered more commercial electric vehicles this year in the US than <a href=\"https://twitter.com/LightningeMtrs/status/1332377396192837632\">Ford and Daimler combined</a>.</p>\n\n<p><strong>Lightnings customers are Amazon, DHL, Ikea, Keurig/Dr.Pepper</strong> and many more who buy their electric delivery vans as you can see in the <a href=\"https://www.gigcapitalglobal.com/wp-content/uploads/Project-Power-Announcement-Deck_vF.pdf\">investor presentation</a>. This might not seem like a big deal, but it is. Lightning eMotors actually already does today what many other companies claim to be able to do in a couple years if everything goes by plan. They have many large orders lined up as well and sold over 1,500 units in the last few months alone. Lightning said in October that it had more than doubled its manufacturing space, ramped up production and that it had doubled its workforce.</p>\n\n<p>Additionally to the delivery vans they are also making <a href=\"https://lightningemotors.com/lightningelectric-chevrolet-6500xd/\">larger trucks</a> as well as <a href=\"https://lightningemotors.com/buses/\">buses</a>. With Biden as a president we will see a heavy demand for this type of electrified vehicles and a lot of states will roll out their own programs to subsidize companies which invest into electric vehicles. And they also develop and distribute their own charging infrastructure like Chargepoint: <a href=\"https://lightningenergy.biz/dc-charging-stations\">https://lightningenergy.biz/dc-charging-stations</a></p>\n\n<p>This is the only company which provides everything for commercial customers to quickly electrify large fleets and to run them cost efficient and reliable. They are backed by big oil, BP invested $40 million in them. In the US alone there were <a href=\"https://www.statista.com/statistics/265914/commercial-vehicle-sales-in-the-united-states/\">12.4 million commercial vehicles sold in 2019</a>.</p>\n\n<p>This is a HUGE untapped market which isn&#39;t addressed by Tesla yet, and there already is more demand for electric delivery vans <a href=\"https://www.autoblog.com/2020/09/09/electric-delivery-vans-high-demand\">than can be fulfilled</a>.</p>\n\n<p>Don&#39;t make the mistake to think that all of these EV companies are garbage because some like NKxx are. This seems to be one of the few like Chargepoint which actually have their shit together.</p>\n\n<p><strong>The best thing about GIK/Lightning:</strong></p>\n\n<p>The valuation of Lightning eMotors is just 0.8 billion.</p>\n\n<p>NK** currently trades at 7 billion.</p>\n\n<p>PIC/XLfleet currently trading at 2.4 billion.</p>\n\n<p>Hyliion at 2.7 billion.</p>\n\n<p>CIIC/Arrival at 15 billion.</p>\n\n<p>I posted about SBE/Chargepoint when it was trading at $12 and I was right: <a href=\"https://www.reddit.com/r/wallstreetbets/comments/iyu629/sbe_could_be_the_next_spi_biggest_ev_charging/\">proof</a>. This is my next big EV play and I am confident it will work out just as great as my last one did.</p>\n\n<p>GIK already traded at $16 in pre-market but lost a little of its gains on Friday as all EV stocks had a slight sell off. I am confident this will go back to $16 by Monday and might even see $20 next week.</p>\n\n<p><strong>Position:</strong></p>\n\n<p>5,000 shares, 1,000 warrants</p>\n</div><!-- SC_ON -->",
  "score": 569,
  "permalink": "/r/stocks/comments/kbui6l/new_ev_stock_gik_the_company_that_delivered_more/",
  "subreddit": "stocks",
  "id": "kbui6l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260493106
}