{
  "author": "ForsakenKappa",
  "the_new_excerpt": "It's 11 pm right now. I'm sleepy. But my mind goes \"NO SLEEP, GO LEARN CODING\".\nI can try to learn a bit or just straight head to bed, either way on the morning\nI wake up with such empty head, no words could describe it. And when the next\nevening kicks mind goes \"YOU ALWAYS WANTED TO MOD THIS GAME,…",
  "original_created_utc": 1622377298,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、午後11時です。私は眠い。でも、心の中では「寝ないで、コーディングの勉強をしよう」と思っています。\n少し勉強してみるか、そのまま寝てしまうか、どちらにしても朝になると\n目が覚めると、言葉では言い表せないほど頭が空っぽになっています。そして次の日の夕方になると\n次の日の夕方になると、心の中では「ずっとこのゲームを改造したかったのに...」と思っています。",
      "title": "寝ようとすると、技術や知識を追求したいという衝動に駆られますが、目が覚めると次の日の夕方まで消えているのはなぜですか？もう少し早く（朝や昼間）にこのモチベーションを得ることはできませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在是晚上11点。我很困了。但我的想法是：\"不睡觉，去学习编码\"。\n我可以试着学一点，或者直接上床睡觉，无论如何，到了早上\n我醒来时，脑袋里空空如也，无法用语言来形容。而当第二天\n晚上，我的脑海里浮现出 \"你一直想修改这个游戏，...\"。",
      "title": "为什么当我要睡觉的时候会有追求技能和知识的冲动，但当我醒来的时候，这些冲动都消失了，直到第二天晚上？我可以在更早的时候（早上或白天）获得这种动力吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在是晚上11點。我很困了。但我的想法是：\"不睡覺，去學習編碼\"。\n我可以試着學一點，或者直接上牀睡覺，無論如何，到了早上\n我醒來時，腦袋裏空空如也，無法用語言來形容。而當第二天\n晚上，我的腦海裏浮現出 \"你一直想修改這個遊戲，...\"。",
      "title": "爲什麼當我要睡覺的時候會有追求技能和知識的衝動，但當我醒來的時候，這些衝動都消失了，直到第二天晚上？我可以在更早的時候（早上或白天）獲得這種動力嗎？"
    }
  ],
  "title": "Why when I'm about to go to sleep I get urges to pursue skills and knowledge, but when I wake up it's all gone until next evening? Can I get this motivation some time earlier (during morning or day)?",
  "created_utc": 1622384760,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s 11 pm right now. I&#39;m sleepy. But my mind goes &quot;NO SLEEP, GO LEARN CODING&quot;. I can try to learn a bit or just straight head to bed, either way on the morning I wake up with such empty head, no words could describe it. And when the next evening kicks mind goes &quot;YOU ALWAYS WANTED TO MOD THIS GAME, NOW IS THE TIME&quot; Can I, like, switch time when this occurs? Motivation is cool and stuff, but not when the simple math becomes PHD level calculus for my mind.</p>\n</div><!-- SC_ON -->",
  "score": 204,
  "permalink": "/r/TooAfraidToAsk/comments/noa2jb/why_when_im_about_to_go_to_sleep_i_get_urges_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "noa2jb",
  "is_self": true,
  "media": null,
  "is_video": false
}