{
  "author": "Alex_Kimchi",
  "original_created_utc": 1646364837,
  "title": "How can you determine the most efficient gear ratio for an electric motor?",
  "created_utc": 1646428945,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am part of a robotics team and thought that it would be useful to find the relationship between gear ratio and the efficiency of a DC motor. When I looked it up I found plenty of graphs that represent the efficiency as a parabola, increasing as RPM increases and torque decreases, then dropping after a &amp;#39;peak&amp;#39; efficiency is reached. &lt;/p&gt;\n\n&lt;p&gt;However, I couldn&amp;#39;t find any explanations of why it takes this shape, or what determines the location of this peak. &lt;/p&gt;\n\n&lt;p&gt;My understanding was that speed is, well, speed, while torque is the ability of a motor to start moving in the first place. So I thought that the efficiency would continuously increase with speed, until the torque is too low to move the load and the motor stalls, dropping efficiency straight to 0 rather than a gradual decrease. Is there something that I am missing?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/askscience/comments/t69jth/how_can_you_determine_the_most_efficient_gear/",
  "subreddit": "askscience",
  "id": "t69jth",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am part of a robotics team and thought that it would be useful to find the\nrelationship between gear ratio and the efficiency of a DC motor. When I looked\nit up I found plenty of graphs that represent the efficiency as a parabola,\nincreasing as RPM increases and torque decreases, then dropping…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はロボット工学のチームに所属しており、このような情報を得ることは有用だと考えています。\nギア比とDCモータの効率の関係。調べてみると\n調べると、効率を放物線状に表したグラフがたくさん出てきました。\n回転数が上がり、トルクが低下すると上昇し、その後下降する。",
      "title": "電気モーターの最も効率の良いギア比は、どのように決めればよいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个机器人团队的成员，我认为找到齿轮比和直流电动机效率之间的关系会很有用。\n我是机器人团队的一员，我认为找到齿轮比和直流电动机的效率之间的关系会很有用。当我查阅\n时，我发现了很多表示效率为抛物线的图表。\n随着转速的增加和扭矩的减少，效率也在增加，然后下降......",
      "title": "如何确定电动马达的最有效齿轮比？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個機器人團隊的成員，我認爲找到齒輪比和直流電動機效率之間的關係會很有用。\n我是機器人團隊的一員，我認爲找到齒輪比和直流電動機的效率之間的關係會很有用。當我查閱\n時，我發現了很多表示效率爲拋物線的圖表。\n隨着轉速的增加和扭矩的減少，效率也在增加，然後下降......",
      "title": "如何確定電動馬達的最有效齒輪比？"
    }
  ]
}