{
  "author": "cascading_disruption",
  "the_new_excerpt": "The vision is to enable a more democratic, equitable society so that all people\nhave economic inclusion. 1.7 billion people in the world are unbanked and many\nare being denied the financial services because their identities cannot be\nverified.\n\nApproach and offerings are underpinned by fundamental…",
  "original_created_utc": 1618316290,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビジョンは、より民主的で公平な社会を実現し、すべての人が経済的に包摂されるようにすることです。\n経済的に包摂された社会を実現することです。世界には銀行口座を持たない人が17億人います。\n多くの人々が、本人確認ができないために金融サービスを受けることができません。\nを確認することができません。\n\n私たちのアプローチとサービスは、基本的には...",
      "title": "カルダノとは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "愿景是建立一个更民主、更公平的社会，使所有人都能够\n有经济包容性。世界上有17亿人没有银行账户，许多人没有银行账户。\n因为无法确定其身份而被拒绝提供金融服务。\n经过验证的。\n\n办法和供职的根本支撑是...",
      "title": "什么是卡达诺？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "願景是建立一個更民主、更公平的社會，使所有人都能夠\n有經濟包容性。世界上有17億人沒有銀行賬戶，許多人沒有銀行賬戶。\n因爲無法確定其身份而被拒絕提供金融服務。\n經過驗證的。\n\n辦法和供職的根本支撐是...",
      "title": "什麼是卡達諾？"
    }
  ],
  "title": "What is Cardano?",
  "created_utc": 1618335137,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The vision is to <strong>enable a more democratic, equitable society so that all people have economic inclusion</strong>.  1.7 billion people in the world are unbanked and many are being denied  the financial services because their identities cannot be verified.</p>\n\n<p>Approach and offerings are underpinned by fundamental science and research:</p>\n\n<ul>\n<li><strong>first  to solve the proof-of-stake problem and consequently the development of  a blockchain protocol that&#39;s 4 million times more efficient than  Bitcoin</strong> (Bitcoin&#39;s energy consumption is like Belgium while Cardano equals 1 household)</li>\n<li><strong>a global scale financial system that is</strong> 100x more decentralized <strong>than Bitcoin</strong></li>\n<li><strong>first provably secure blockchain protocol for a high secure financial network</strong></li>\n<li>first research to apply the <strong>rigor of functional programming languages</strong> to the design of smart contracts</li>\n</ul>\n\n<p><strong>Cardano&#39;s a third generation blockchain for the age of real-life application</strong> and it has more advance features than previous blockchain generations:</p>\n\n<ul>\n<li><strong>scalable</strong>: the ability to underpin all global commerce</li>\n<li><strong>interoperable</strong>: compatible with legacy financial systems as well as current and future blockchain networks</li>\n<li><strong>sustainable</strong>: maintains itself and enables participants to govern it to ensure its sustainability</li>\n</ul>\n\n<p><strong>What else makes Cardano special</strong>:</p>\n\n<ul>\n<li><a href=\"https://adapools.org/groups\">50-100x more decentralized than Bitcoin/Ethereum</a></li>\n<li>underpinned by scientific rigor</li>\n<li>world&#39;s first provably secure network</li>\n<li>globally (geographically) diverse blockchain</li>\n<li>top 10 crypto</li>\n<li>interoperable with legacy systems and other blockchains</li>\n<li>world&#39;s most environmentally sustainable blockchain solution</li>\n<li>home to ADA, leading proof-of-stake crypto by market cap</li>\n<li>world&#39;s first PoS blockchain</li>\n</ul>\n\n<p>Cardano engineers/devs deploy formal methods to ensure faithful traslation fo science into performant code .</p>\n\n<p><strong>Staking, the dual role of ADA:</strong></p>\n\n<ul>\n<li><strong>payment</strong>: store of value or pay for good and services</li>\n<li><strong>staking</strong>: participation in &quot;virtual lottery&quot; -&gt; can be delegated to a stake pool</li>\n</ul>\n\n<p><strong>Decentralization</strong>:</p>\n\n<ul>\n<li>Cardano incentives achieve a level of decentralization that is orders of magnitude higher than that of Bitcoin (<a href=\"https://www.blockchain.com/pools\">3 large mining groups control the network</a> -&gt; over 50% of hashing power, <a href=\"https://etherchain.org/miner\">Ethereum&#39;s in similar situation</a>)</li>\n<li><strong>true decentralization in Cardano via incentives mechanism prevents pool from growing too large</strong> (e.g. in the future Bitcoin miners could converge into one single gigantic pool that controls the entire network, see above)</li>\n</ul>\n\n<p><strong>Cardano is currently targeting 500 and soon 1000 (k-parameter) stake pools</strong> but in theory the sky&#39;s the limit.</p>\n\n<p><strong>Cardano has several development stages (all done in parallel -&gt;</strong>  not waiting for one phase to finish to start another one) each focused  on a set of functionalities that together make it more advance than  previous blockchain generations:</p>\n\n<ul>\n<li><strong>Foundation</strong> (Byron (done)): laying the <strong>groundwork for the most advance blockchain</strong>  generation. This stage was focused on building a community to support  the creation of Cardano. It allowed the users to buy&amp;sell ADA on the  Ouroboros protocol which is the first PoS protocol underpinned by  academic research and a mathematically proven level of security.</li>\n<li><strong>Decentralization</strong>  (Shelley (done)): ensuring greater security and robustness. In this  stage, nodes/serves/stake-pools (blocks of data) are hosted by more and  more network participants leading it to become decentralized. <strong>The  more decentralized the less risk of compromise by malicious behaviour.  Cardano will be 50-100x more decentralized than other major blockchain  networks and thus more secure.</strong></li>\n<li><strong>Smart contracts</strong>  (Goguen (Q2/Q3 2021) ft. Alonzo (last hardfork) ft. Mary (done) ft.  Allegra(done)): enterprise ready smart contract creation and management.  This stage adds the ability to build decentralized applications (DApps)  on Cardano&#39;s solid foundation of peer-reviewed research and  high-assurance development. Critically, it <strong>enables  users from technical and non-technical background to create and execute  functional smart contract. This supports the development of  enterprise-level smart contracts for mission-critical applications.</strong></li>\n<li><strong>Scalability</strong>  (Basho(2021)): establishing unrivalled high-performance resilience.  This stage focuses on optimization and the underlying performance of  Cardano network, improving scalability and interoperability. This  includes the <strong>introduction of  side chains (new blockchains interoperable with the main Cardano chain)  increasing the capacity of the network and enabling experimental  features without impacting security. This means secure and reliable  scalability and thus maintainability.</strong></li>\n<li><strong>Governance</strong>  (Voltaire (2021) ft. Project Catalyst): establishing  self-sustainability to secure the future. This stages ensures that  Cardano can be maintained and improved over time. It sees the addition  of a <a href=\"https://docs.google.com/spreadsheets/d/1xny1W7HhHANLNeQcnbr8El5rakJ80VIM7fgDwJ-uqys/edit#gid=0\">treasury system</a> (400 million ADA or 0.5 billion $ at present time and growing each epoch(=5 days)) <strong>whereby  a fraction of all transaction fees are pooled to provide funds for  development activities undertaken following the voting process. this  stage makes Cardano truly decentralized and future-proof and transfers  management (</strong><strong><em>power to the edges</em></strong><strong>) to the community.</strong></li>\n</ul>\n\n<p>Source: <a href=\"https://www.youtube.com/watch?v=hM3BeuencIs\">https://www.youtube.com/watch?v=hM3BeuencIs</a></p>\n</div><!-- SC_ON -->",
  "score": 461,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/Y0jx7Bx_ywxfnGTN3p5wysG_hG9djUS7AaOSFVwdh2E.jpg?auto=webp&s=3b69677a31dec29fbb4df8e9223912508bdc2916",
          "width": 1895,
          "height": 994
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/Y0jx7Bx_ywxfnGTN3p5wysG_hG9djUS7AaOSFVwdh2E.jpg?width=108&crop=smart&auto=webp&s=c266a0d82ed4444a51472a8cb428037ef19bf687",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/Y0jx7Bx_ywxfnGTN3p5wysG_hG9djUS7AaOSFVwdh2E.jpg?width=216&crop=smart&auto=webp&s=f53f16624513e0a4bf770612f7ddd684d5c0f0c9",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/Y0jx7Bx_ywxfnGTN3p5wysG_hG9djUS7AaOSFVwdh2E.jpg?width=320&crop=smart&auto=webp&s=3e4e7c25e4f3a6b96445883bbd99de2ad8421827",
            "width": 320,
            "height": 167
          },
          {
            "url": "https://external-preview.redd.it/Y0jx7Bx_ywxfnGTN3p5wysG_hG9djUS7AaOSFVwdh2E.jpg?width=640&crop=smart&auto=webp&s=2fff362c79e4c838dab009d52016315de9595021",
            "width": 640,
            "height": 335
          },
          {
            "url": "https://external-preview.redd.it/Y0jx7Bx_ywxfnGTN3p5wysG_hG9djUS7AaOSFVwdh2E.jpg?width=960&crop=smart&auto=webp&s=8587f9715f17a25387bef5d025725090aa3464ad",
            "width": 960,
            "height": 503
          },
          {
            "url": "https://external-preview.redd.it/Y0jx7Bx_ywxfnGTN3p5wysG_hG9djUS7AaOSFVwdh2E.jpg?width=1080&crop=smart&auto=webp&s=ad8d97253b5f8e32e719079eecd344b30fd8013c",
            "width": 1080,
            "height": 566
          }
        ],
        "variants": {},
        "id": "iah9x0my8Xg9FvKpEtLtxkYe1URvEKC424itJ5weGBM"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/mq1274/what_is_cardano/",
  "subreddit": "CryptoCurrency",
  "id": "mq1274",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566615663
}