{
  "author": "chillydownfiregang",
  "original_created_utc": 1633080917,
  "title": "After a totally normal interaction with coworkers or friends, I sometimes replay the interaction in my head and worry if I said or did anything weird. Is that normal?",
  "created_utc": 1633089513,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Not often. I actually tend to think I&#39;m an okay conversationalist. Not a huge fan of small talk but I can do it if I need to, and I&#39;m happy to talk away if someone is chatty, and I am not nervous or worried during the social moment.</p>\n\n<p>However towards the end of the day, sometimes I&#39;ll think back to a conversation and think... hmm, was it weird when I said that? Or did they think I was weird for saying this? Was I rude here? Should I have talked more here? Listened more there? </p>\n\n<p>Again, sometimes... not all the time. I&#39;ll let it occupy my mind a little, worry a little, and then ultimately move one and not think about it again. Any one else?? And how can I stop worrying after the fact, when I don&#39;t think I should even worry too much?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/pz4i1t/after_a_totally_normal_interaction_with_coworkers/",
  "subreddit": "TooAfraidToAsk",
  "id": "pz4i1t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Not often. I actually tend to think I'm an okay conversationalist. Not a huge\nfan of small talk but I can do it if I need to, and I'm happy to talk away if\nsomeone is chatty, and I am not nervous or worried during the social moment.\n\nHowever towards the end of the day, sometimes I'll think back to a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あまりないですね。私は実際、自分はまあまあの会話力があると思っています。世間話はあまり好きではありませんが\n世間話はあまり好きではありませんが、必要であればできますし、誰かがおしゃべりをしていれば、喜んで話しかけます。\n誰かが話しかけてくれれば喜んで話しますし、社交の場で緊張したり心配したりすることもありません。\n\nしかし、一日の終わりになると、時々、私はある日のことを思い出します。",
      "title": "同僚や友人とのまったく普通のやりとりの後、そのやりとりを頭の中で再現して、何か変なことを言ったか、やったかと心配になることがあります。それって普通なの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不经常。实际上，我倾向于认为我是一个不错的谈话者。不是一个巨大的\n我不太喜欢闲聊，但如果我需要的话，我可以做到，而且如果有人喜欢聊天，我也很乐意谈下去。\n如果有人喜欢聊天，我也很乐意谈下去，而且在社交的时候我不会紧张或担心。\n\n然而，在一天即将结束的时候，有时我会回想一下...。",
      "title": "在与同事或朋友进行完全正常的互动后，我有时会在脑子里回放这次互动，并担心我是否说了或做了什么奇怪的事。这正常吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不經常。實際上，我傾向於認爲我是一個不錯的談話者。不是一個巨大的\n我不太喜歡閒聊，但如果我需要的話，我可以做到，而且如果有人喜歡聊天，我也很樂意談下去。\n如果有人喜歡聊天，我也很樂意談下去，而且在社交的時候我不會緊張或擔心。\n\n然而，在一天即將結束的時候，有時我會回想一下...。",
      "title": "在與同事或朋友進行完全正常的互動後，我有時會在腦子裏回放這次互動，並擔心我是否說了或做了什麼奇怪的事。這正常嗎？"
    }
  ]
}