{
  "author": "ta239191",
  "original_created_utc": 1634187233,
  "title": "When a black man called me a sl*t, a ho, etc, why did it only get mild reactions from the people around us but they blew up when I called him the N word in response?",
  "created_utc": 1634193702,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>27F. Today I got into a bit of an altercation at the grocery store. A man wouldn&#39;t leave me alone and kept trying to flirt with me, despite me completely ignoring him he followed me around and eventually started making ruder and ruder comments. He took some vegetables out of my trolley and I eventually snapped at him to please leave me alone.</p>\n\n<p>That was when he really got riled up. He asked what I was looking so good for if I couldn&#39;t handle attention, asked why I was wearing so much makeup, asked if I enjoyed looking like a slut and being a tease. At that point people started looking at us, but nobody said anything. Not the women, not the men, not the store employees (two teenagers).</p>\n\n<p>He continued to level abuse at me, calling me a slut, a ho, a tease, a bitch.</p>\n\n<p>Besides the rough past few days I&#39;ve been having, his behaviour and everyone else&#39;s passiveness enraged me. My blood was boiling and I couldn&#39;t control myself, all I wanted to do was to hurt him. So I said to him, &quot;Shut the fuck up, n****r.&quot;</p>\n\n<p>Suddenly, at that point, there were some LOUD protests from the people watching. Some people gasped and others just went like &quot;oh hell no&quot; and &quot;what did you just say?&quot; and just a lot of comments like that. I immediately wondered, where was this energy when this man was following me around, harassing me, and then publicly verbally abusing me with very misogynistic comments?</p>\n\n<p>I just threw the bag of onions at him and left the store and cried in my car for about 15 minutes. I don&#39;t think anyone was recording, so I&#39;m not too worried about being the subject of a witch hunt.</p>\n\n<p>But that is my question, basically. Why was everyone so fine with how he was acting towards me? And I know what I did in response was fucked up and unpardonable too, but why did they think it was that much worse?</p>\n\n<p>Hope you guys can be constructive.</p>\n\n<p>EDIT: I&#39;m already getting chat requests calling me &quot;slut&quot; and &quot;white trash&quot; lol. Please note that I&#39;m not white. Thank you!</p>\n</div><!-- SC_ON -->",
  "score": 205,
  "permalink": "/r/TooAfraidToAsk/comments/q7sqgp/when_a_black_man_called_me_a_slt_a_ho_etc_why_did/",
  "subreddit": "TooAfraidToAsk",
  "id": "q7sqgp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "27F. Today I got into a bit of an altercation at the grocery store. A man\nwouldn't leave me alone and kept trying to flirt with me, despite me completely\nignoring him he followed me around and eventually started making ruder and ruder\ncomments. He took some vegetables out of my trolley and I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "27F. 今日、私は食料品店でちょっとした口論になった。ある男性が\n私を放っておかず、ずっといちゃついていましたが、私は完全に\n完全に無視していたにもかかわらず、彼は私に付きまとい、最終的にはますます失礼な発言をし始めました。\nコメントをし始めました。彼は私のトロリーからいくつかの野菜を取り出し、私は...",
      "title": "黒人が私のことをsl*tやhoなどと呼んだとき、周りの人たちの反応は穏やかだったのに、私が彼のことをNワードと呼んだら爆発してしまったのはなぜだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "27F. 今天我在杂货店遇到了一点争执。一个男人\n不肯放过我，一直试图与我调情，尽管我完全不理会他\n尽管我完全不理会他，但他还是跟着我，最后开始越来越粗鲁地发表评论。\n评论。他从我的手推车上拿了一些蔬菜，我...",
      "title": "当一个黑人叫我荡妇、妓女等时，为什么只引起我们周围人的轻微反应，而当我叫他N字时，他们就炸了锅？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "27F. 今天我在雜貨店遇到了一點爭執。一個男人\n不肯放過我，一直試圖與我調情，儘管我完全不理會他\n儘管我完全不理會他，但他還是跟着我，最後開始越來越粗魯地發表評論。\n評論。他從我的手推車上拿了一些蔬菜，我...",
      "title": "當一個黑人叫我蕩婦、妓女等時，爲什麼只引起我們周圍人的輕微反應，而當我叫他N字時，他們就炸了鍋？"
    }
  ]
}