{
  "author": "brbcripwalking",
  "the_new_excerpt": "As we go into tech earnings, some of you bears will be homeless or in prison\nsoon. Here is a ranking guide to the different flavors of ramen to keep you\nuntil the next round of commissary or eviction notice comes in.\n\nThese ranks are subjective and personal opinion.\n\nNot FINRA certified.\n\n----------…",
  "original_created_utc": 1611553568,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在我们进入科技财报的时候，你们中的一些熊人将无家可归或入狱\n很快。以下是不同口味拉面的排名指南，让你\n直到下一轮小卖部或拆迁通知到来。\n\n这些排名是主观的，个人意见。\n\n未经FINRA认证。\n\n----------…",
      "title": "丸山拉面口味的熊出没指南。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我們進入科技財報的時候，你們中的一些熊人將無家可歸或入獄\n很快。以下是不同口味拉麪的排名指南，讓你\n直到下一輪小賣部或拆遷通知到來。\n\n這些排名是主觀的，個人意見。\n\n未經FINRA認證。\n\n----------…",
      "title": "丸山拉麪口味的熊出沒指南。"
    }
  ],
  "title": "A bear's guide to Maruchan Ramen Flavors.",
  "created_utc": 1611572982,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As we go into tech earnings, some of you bears will be homeless or in prison soon. Here is a ranking guide to the different flavors of ramen to keep you until the next round of commissary or eviction notice comes in.</p>\n\n<p>These ranks are subjective and personal opinion.</p>\n\n<p>Not FINRA certified.</p>\n\n<hr/>\n\n<p>Last Place (Tie): Less Sodium Variety.</p>\n\n<p><a href=\"https://imgur.com/a/02XF5uo\">https://imgur.com/a/02XF5uo</a></p>\n\n<p>Better off just adding less sauce packet to your noodle soup. You want that MSG to trick your brain into thinking that <strong>I ate a filling meal and I&#39;m satisfied</strong>. You don&#39;t go to the White Castle and order a chicken salad. You&#39;re eating ramen for dinner for the 6th time this week after blowing up your Robinhood account are you really worried about heart disease?</p>\n\n<hr/>\n\n<p>Last Place (Tie): Chili</p>\n\n<p><a href=\"https://imgur.com/a/0FAbyEs\">https://imgur.com/a/0FAbyEs</a></p>\n\n<p>If you find this noodle soup spicy, stay away from Honey Nut Cheerios. If you go in expecting Hot Cheetos levels of addictive goodness, prepare to be sorely disappointed. The only thing burning will be your butthole after repeated abuse. What the fuck are they smoking in Irvine? Paprika doesn&#39;t make stuff spicy.</p>\n\n<hr/>\n\n<p>10: Roast Beef</p>\n\n<p><a href=\"https://imgur.com/a/bOPwlvJ\">https://imgur.com/a/bOPwlvJ</a></p>\n\n<p>Nothing yells degenerate fuck like throwing some hotdogs into the roast beef ramen pretending that it&#39;s pieces of beef. It&#39;s as bland as it gets. The Monosodium Glutamate twerks on your taste buds like a Tik Tok Thot trying to make it on Onlyfans but somehow underperforms the classic regular beef flavor. Hard to find in a shelf because of Corona shortages but it&#39;s a far cry from a grail for ramenheads.</p>\n\n<hr/>\n\n<p>9: Creamy Chicken</p>\n\n<p><a href=\"https://imgur.com/a/ZkC9Ogf\">https://imgur.com/a/ZkC9Ogf</a></p>\n\n<p>If you enjoy alfredo and macaroni in cheese, this ramen comes in with a sledge hammer and says fuck your dreams. It tastes like Cheesasaurus Rex jizzed in your easy mac. Truly great if you&#39;re into that stuff. Your wife always knew in the back of her mind that Jason wasn&#39;t really your friend from College. Get back in there soldier.</p>\n\n<hr/>\n\n<p>8: Shrimp</p>\n\n<p><a href=\"https://imgur.com/a/LaMxxna\">https://imgur.com/a/LaMxxna</a></p>\n\n<p>It tastes like your poor Japanese mom&#39;s coochie after a long shift at the swap meet. Artificial and yeasty, it&#39;s letting you know that you hit rock bottom. The minute you get a hint of depth with sesame oil, it drags you back in to remind that you&#39;re a crab in a bucket. Cup variety overperforms the package because it has real shrimp and vegetables.</p>\n\n<hr/>\n\n<p>7: Pork</p>\n\n<p><a href=\"https://imgur.com/a/SildaAK\">https://imgur.com/a/SildaAK</a></p>\n\n<p>This Ramen tastes nothing like the real Tonkotsu ramen. It actually doesn&#39;t contain any pork or pork fat either. I don&#39;t know what you were expecting when you bought those TSLA 600 weekly puts. Did you think you&#39;ll be touring the rolling hills of Roppongi with your gains? Welcome to Gary, Indiana. Fuck you and enjoy your stay.</p>\n\n<hr/>\n\n<p>6: Picante Chicken</p>\n\n<p><a href=\"https://imgur.com/a/WgafcN6\">https://imgur.com/a/WgafcN6</a></p>\n\n<p>Taste comes close to the classic chicken flavor. Throw some taco seasoning and a hint of hot sauce on the original chicken and you have your picante chicken ramen. This isn&#39;t too bad. When the margin calls come in, maybe you can live in Mexico. Can be quite nice with Tapatio and leftover rotisserie chicken if you weren&#39;t so poor.</p>\n\n<hr/>\n\n<p>5: Beef</p>\n\n<p><a href=\"https://imgur.com/a/YYURI4f\">https://imgur.com/a/YYURI4f</a></p>\n\n<p>A flavor so widespread that it&#39;s sold at Office Depot. The packaging taunts you with a piece of grilled sirloin and parsley leaves. You may get pieces of parsley depending on which region it was purchased. Not all ramen are created equal. What do you know, it actually tastes like beef broth. Solid option to last the nuclear winter.</p>\n\n<hr/>\n\n<p>4: Soy Sauce</p>\n\n<p><a href=\"https://imgur.com/a/QnVq7AA\">https://imgur.com/a/QnVq7AA</a></p>\n\n<p>Originally known as oriental before the name change, it is a workhorse ramen. It tastes like flavored soy sauce and some noodles. Throw in some fragrant vegetables like green onions and chives to take it to the next level. Being on welfare isn&#39;t so bad after all.</p>\n\n<hr/>\n\n<p>3: Chicken</p>\n\n<p><a href=\"https://imgur.com/a/AXHzrj0\">https://imgur.com/a/AXHzrj0</a></p>\n\n<p>Classic taste of College. How can you forget standing at the stove top smelling these cook at 3 in the morning. Salty chicken broth with savory undertones to help keep those Jaegerbombs down. Good times until you were kicked out for gambling your student loans. Turns out you can&#39;t declare bankruptcy on those. Papa Biden save me.</p>\n\n<hr/>\n\n<p>2: Lime Chili Shrimp</p>\n\n<p><a href=\"https://imgur.com/a/05UOEPq\">https://imgur.com/a/05UOEPq</a></p>\n\n<p>Guarantee your Mexican partners love these. You would too if you would expand your horizons. You invest in the same 125 tickers and look where they got you. Eating ramen noodles for breakfast, lunch, and dinner. If this is the case, try this one. Made in the San Antonio, TX factory for Maruchan, this thing delivers a kick with real habanero peppers. Slightly sour undertones of lime delivers a superb experience. You could even throw some grilled shrimps on top if those puts print. Maybe next tax year.</p>\n\n<hr/>\n\n<p>1: Roasted Chicken</p>\n\n<p><a href=\"https://imgur.com/a/LMRtrUO\">https://imgur.com/a/LMRtrUO</a></p>\n\n<p>You always wondered what tendies tastes like. Take that classic chicken flavor and add more depth. It is hard to find because of the pandemic but if your grocery store has these in stock, give this a go. This ramen is the grail. The soup is chicken broth mixed with, powdered cooked chicken, and chicken fat. Powdered turmeric, garlic, onions, and chives. It&#39;s an excellent snack even if you&#39;re not a bear struggling to make ends meet.</p>\n</div><!-- SC_ON -->",
  "score": 6394,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/G6nBvfOGn0jVB1h7NCDX54UFDc5WK-nHLgcnP92F9yw.jpg?auto=webp&s=c15ed90bc44988642a64ea56fcee9a96c8cc2b43",
          "width": 600,
          "height": 600
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/G6nBvfOGn0jVB1h7NCDX54UFDc5WK-nHLgcnP92F9yw.jpg?width=108&crop=smart&auto=webp&s=a423de63eb3e0de4a7525f175328f729bb44231a",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/G6nBvfOGn0jVB1h7NCDX54UFDc5WK-nHLgcnP92F9yw.jpg?width=216&crop=smart&auto=webp&s=69cd7288cf60792fec25979b055afd4299040f02",
            "width": 216,
            "height": 216
          },
          {
            "url": "https://external-preview.redd.it/G6nBvfOGn0jVB1h7NCDX54UFDc5WK-nHLgcnP92F9yw.jpg?width=320&crop=smart&auto=webp&s=f22a5621562abfb1e2db4e9c27c9a678680103b1",
            "width": 320,
            "height": 320
          }
        ],
        "variants": {},
        "id": "QbpA6tnh1gPe3Yn7R_feCdGvtnhT8tStAuolWQBhl7Q"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/wallstreetbets/comments/l4h64p/a_bears_guide_to_maruchan_ramen_flavors/",
  "subreddit": "wallstreetbets",
  "id": "l4h64p",
  "is_self": true,
  "media": null,
  "is_video": false
}