{
  "author": "GordonGekkoVienna",
  "the_new_excerpt": "A few days ago I wrote a post questioning Tesla's practices. Tesla offered\ncustomers in Germany to buy back their recently purchased vehicle (half a year\nold) at a very high price if they bought the new model. In one example, this\nwent so far that the customer received €3000 net for buying a new car…",
  "original_created_utc": 1615969938,
  "localize": [
    {
      "locale": "zh",
      "title": "特斯拉如何利用德国纳税人的钱？",
      "the_new_excerpt": "几天前，我写了一篇文章，质疑特斯拉的做法。特斯拉提出\n德国的客户可以回购他们最近购买的车辆（半年）。\n旧款），如果他们买了新款，价格就会非常高。在一个例子中，这\n竟然让客户收到了3000欧元的净买新车......。"
    },
    {
      "locale": "zh-Hant",
      "title": "特斯拉如何利用德國納稅人的錢？",
      "the_new_excerpt": "幾天前，我寫了一篇文章，質疑特斯拉的做法。特斯拉提出\n德國的客戶可以回購他們最近購買的車輛（半年）。\n舊款），如果他們買了新款，價格就會非常高。在一個例子中，這\n竟然讓客戶收到了3000歐元的淨買新車......。"
    }
  ],
  "title": "How Tesla takes advantage of German taxpayers' money",
  "created_utc": 1615979661,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A few days ago I wrote a post questioning Tesla&#39;s practices. Tesla offered customers in Germany to buy back their recently purchased vehicle (half a year old) at a very high price if they bought the new model. In one example, this went so far that the <strong>customer received €3000 net for buying a new car</strong> (because of the high environmental bonus). (<a href=\"https://teslamag.de/news/verkaufsoffensive-tesla-deutschland-hohe-restwert-angebote-lieferung-nach-hause-34929\">https://teslamag.de/news/verkaufsoffensive-tesla-deutschland-hohe-restwert-angebote-lieferung-nach-hause-34929</a>)</p>\n\n<p>After several investigations and further articles published on this topic, the following is now clear: Tesla takes the car in part-exchange and sells it used (often abroad) at a good price, while the new car bought brings again 6000€ in environmental bonuses. So the <strong>German taxpayer has paid 12000€ tax money for a used Model 3 and a new Model 3, one of which will probably end up in Denmark</strong> or something, and Tesla has increased its official sales figure. (<a href=\"https://teslamag.de/news/super-angebot-tesla-tausch-model-3-sr-neues-long-range-34942\">https://teslamag.de/news/super-angebot-tesla-tausch-model-3-sr-neues-long-range-34942</a>)</p>\n\n<p>We should limit these environmental subsidies somehow, maybe you should only get them per person every 3 years. You can call it smart what Tesla is doing here, helping itself to German taxpayers&#39; money through these tricks <strong>after billions of euros in funding for the factory</strong> in Germany. However, it&#39;s not the decent thing to do, and that says enough about Tesla for me.</p>\n</div><!-- SC_ON -->",
  "score": 1397,
  "permalink": "/r/stocks/comments/m6vqeo/how_tesla_takes_advantage_of_german_taxpayers/",
  "subreddit": "stocks",
  "id": "m6vqeo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147384034
}