{
  "author": "Hhhpuu",
  "the_new_excerpt": "I don’t understand the end goal of saying “damn girl you look fine” to a women,\nyou only make them uncomfortable and they’re not gonna instantly wanna have sex\nwith you for saying something like that. It’s just creepy as fuck.\n\nGo to literally any post with a women on it and there will be comments…",
  "original_created_utc": 1622351899,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "女性に「いい女だね」と言うことの最終目的がわからない。\n相手を不愉快にさせるだけで、そんなことを言ってもすぐにセックスしたいとは思わないでしょう。\nそんなことを言ったからといって、すぐにセックスしたいとは思わないだろう。気持ち悪いだけだ。\n\n女性が写っている記事には必ずと言っていいほどコメントがついています...",
      "title": "一部の男性が性的な補完やキャットコールをするとき、脳内では何が起こっているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不明白对一个女人说 \"该死的女孩，你看起来很好 \"的最终目的。\n你只会让她们感到不舒服，她们不会因为你说了这样的话而立即想和你做爱。\n他们不会因为你说这样的话而立即想和你做爱。这只是令人毛骨悚然的事。\n\n去看任何有女人的帖子，都会有评论......",
      "title": "当某些人给予性方面的赞美或猫叫时，他们的大脑中会发生什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不明白對一個女人說 \"該死的女孩，你看起來很好 \"的最終目的。\n你只會讓她們感到不舒服，她們不會因爲你說了這樣的話而立即想和你做愛。\n他們不會因爲你說這樣的話而立即想和你做愛。這只是令人毛骨悚然的事。\n\n去看任何有女人的帖子，都會有評論......",
      "title": "當某些人給予性方面的讚美或貓叫時，他們的大腦中會發生什麼？"
    }
  ],
  "title": "What goes on in SOME guys brains when they give sexual complements or catcall?",
  "created_utc": 1622404574,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don’t understand the end goal of saying “damn girl you look fine” to a women, you only make them uncomfortable and they’re not gonna instantly wanna have sex with you for saying something like that. It’s just creepy as fuck.</p>\n\n<p>Go to literally any post with a women on it and there will be comments about how hot she is</p>\n\n<p>Go walk down a busy street as a women and there will be guys catcalling them</p>\n\n<p>What is going on in these people’s brains?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/no44wt/what_goes_on_in_some_guys_brains_when_they_give/",
  "subreddit": "TooAfraidToAsk",
  "id": "no44wt",
  "is_self": true,
  "media": null,
  "is_video": false
}