{
  "author": "megacurl",
  "the_new_excerpt": "https://www.cnbc.com/2021/03/17/bitcoin-morgan-stanley-is-the-first-big-us-bank-to-offer-wealthy-clients-access-to-bitcoin-funds.html\n\nMorgan Stanley is the first big U.S. bank to offer its wealth management clients\naccess to bitcoin funds, CNBC has learned exclusively.\n\nThe investment bank, a giant…",
  "original_created_utc": 1616006664,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.cnbc.com/2021/03/17/bitcoin-morgan-stanley-is-the-first-big-us-bank-to-offer-wealthy-clients-access-to-bitcoin-funds.html\n\n摩根士丹利是第一家为其财富管理客户提供服务的美国大银行。\n获得比特币资金，CNBC独家获悉。\n\n该投行是一家巨...",
      "title": "摩根士丹利成为第一家为其富裕客户提供比特币基金的美国大银行。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.cnbc.com/2021/03/17/bitcoin-morgan-stanley-is-the-first-big-us-bank-to-offer-wealthy-clients-access-to-bitcoin-funds.html\n\n摩根士丹利是第一家爲其財富管理客戶提供服務的美國大銀行。\n獲得比特幣資金，CNBC獨家獲悉。\n\n該投行是一家巨...",
      "title": "摩根士丹利成爲第一家爲其富裕客戶提供比特幣基金的美國大銀行。"
    }
  ],
  "title": "Morgan Stanley becomes the first big U.S. bank to offer its wealthy clients access to bitcoin funds",
  "created_utc": 1616010075,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.cnbc.com/2021/03/17/bitcoin-morgan-stanley-is-the-first-big-us-bank-to-offer-wealthy-clients-access-to-bitcoin-funds.html\">https://www.cnbc.com/2021/03/17/bitcoin-morgan-stanley-is-the-first-big-us-bank-to-offer-wealthy-clients-access-to-bitcoin-funds.html</a></p>\n\n<p>Morgan Stanley is the first big U.S. bank to offer its wealth management clients access to bitcoin funds, CNBC has learned exclusively.</p>\n\n<p>The investment bank, a giant in wealth management with $4 trillion in client assets, told its financial advisors Wednesday in an internal memo that it is launching access to three funds that enable ownership of bitcoin, according to people with direct knowledge of the matter.</p>\n\n<p>The move, a significant step for the acceptance of bitcoin as an asset class, was made by Morgan Stanley after clients demanded exposure to the cryptocurrency, said the people, who declined to be identified sharing details about the bank’s internal communications. Bitcoin’s rally in the past year has put Wall Street firms under pressure to consider getting involved in the nascent asset class.</p>\n\n<p>But, at least for now, the bank is only allowing its wealthier clients access to the volatile asset: The bank considers it suitable for people with “an aggressive risk tolerance” who have at least $2 million in assets held by the firm.</p>\n\n<p>Two of the funds on offer are from Galaxy Digital, a crypto firm founded by Mike Novogratz, while the third is a joint effort from asset manager FS Investments and bitcoin company NYDIG.</p>\n</div><!-- SC_ON -->",
  "score": 2793,
  "permalink": "/r/investing/comments/m77ggf/morgan_stanley_becomes_the_first_big_us_bank_to/",
  "subreddit": "investing",
  "id": "m77ggf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147381373
}