{
  "author": "gweeha45",
  "the_new_excerpt": "Many of us joined crypto in 2017/18 and got rekt hard. -90% down in a few weeks\nand carrying heavy bags for 3 years made most of us somehow wary of daydreaming\nabout becoming filthy rich over night.\n\nAt least this is my perceived sentiment of this subreddit these days, as we see\nthe crypto-sphere…",
  "original_created_utc": 1618316641,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちの多くは、2017/18年に暗号化に参加し、大きな打撃を受けました。-数週間で90%の下落\n数週間で90%下落し、3年間重い荷物を持っていたことで、多くの人が一夜にして大金持ちになることを夢見ることに何となく慎重になりました。\n一夜にして大金持ちになることを夢見てはいけないと思うようになりました。\n\n少なくとも、これが最近のこのサブレディットの私の認識で、私たちは以下のように見ています。\n暗号化された領域...",
      "title": "2017年のPTSDはこのサブの中ではリアルです。多くの人が、このブルランを極端に警戒しているようだ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们很多人在2017/18年加入了加密技术，并被狠狠地宰了一顿。-几周内跌了90%\n扛着沉重的行李走了3年，让我们大多数人对白日梦产生了某种程度的恐惧感\n关于一夜之间变得肮脏富有。\n\n至少这是我最近对这个次元的感知，因为我们看到了\n加密世界...",
      "title": "2017年的PTSD在这个子里是真实存在的。很多人似乎对这次牛市极为谨慎"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們很多人在2017/18年加入了加密技術，並被狠狠地宰了一頓。-幾周內跌了90%\n扛着沉重的行李走了3年，讓我們大多數人對白日夢產生了某種程度的恐懼感\n關於一夜之間變得骯髒富有。\n\n至少這是我最近對這個次元的感知，因爲我們看到了\n加密世界...",
      "title": "2017年的PTSD在這個子裏是真實存在的。很多人似乎對這次牛市極爲謹慎"
    }
  ],
  "title": "The 2017 PTSD is real in this sub. Lots of people seem to be extremely cautious this bull-run",
  "created_utc": 1618339655,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Many of us joined crypto in 2017/18 and got rekt hard. -90% down in a few weeks and carrying heavy bags for 3 years made most of us somehow wary of daydreaming about becoming filthy rich over night.</p>\n\n<p>At least this is my perceived sentiment of this subreddit these days, as we see the crypto-sphere reach new heights.</p>\n\n<p>This leads to the question if we just learned from our mistakes, or are we up for an even greater peak with all the mindless euphoria and fomo kicking in again?</p>\n\n<p>I guess time will tell. I hope you guys all broke even and enjoy the fabulous ride from here!</p>\n</div><!-- SC_ON -->",
  "score": 401,
  "permalink": "/r/CryptoCurrency/comments/mq15nv/the_2017_ptsd_is_real_in_this_sub_lots_of_people/",
  "subreddit": "CryptoCurrency",
  "id": "mq15nv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566615664
}