{
  "author": "Shandowarden",
  "the_new_excerpt": "TLDR: as you can see, based on what is happening now within this subreddit and\npublicly, sadly we are already being recognized as a single notion - radio\nsilence for a couple of days, diamond handing/ignoring outside noise, removing\nyour voices from youtube, twitter, other news portals is HIGHLY…",
  "original_created_utc": 1611273968,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "TLDR：正如你所看到的，基于现在这个子reddit内发生的事情和\n公开，可悲的是，我们已经被公认为是一个单一的概念--广播\n沉默几天，钻石手/不理会外界噪音，去除\n你的声音从YouTube，Twitter，其他新闻门户网站是高度... ...",
      "title": "扮演沉默刺客的角色是WSB拥有的最好的战术，不应该被否定。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TLDR：正如你所看到的，基於現在這個子reddit內發生的事情和\n公開，可悲的是，我們已經被公認爲是一個單一的概念--廣播\n沉默幾天，鑽石手/不理會外界噪音，去除\n你的聲音從YouTube，Twitter，其他新聞門戶網站是高度... ...",
      "title": "扮演沉默刺客的角色是WSB擁有的最好的戰術，不應該被否定。"
    }
  ],
  "title": "Playing a role of silent assassin is the best tactic that WSB possesses and it should not be dismissed",
  "created_utc": 1611303839,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>TLDR</strong>: as you can see, based on what is happening now within this subreddit and publicly, sadly we are already being recognized as a single notion - radio silence for a couple of days, diamond handing/ignoring outside noise, removing your voices from youtube, twitter, other news portals is HIGHLY advised - <strong>STOP mentioning WSB outside this subreddit - you and I, we are falling into a coordinated trap.</strong></p>\n\n<p>To begin with, I am truly impressed with all the hard-work you guys put in whilst creating quality memes, due diligence posts, twitter messages and online presence.</p>\n\n<p>But all being said, in the past couple of days we can notice the mentioning of <a href=\"/r/wallstreetbets\">/r/wallstreetbets</a> come up in various ways within the social media - like twitter and benzinga, CNBC, youtube. The fact that we created a twitter account and collectively try and display our voice as an individual plays a huge downside to us. Now we are one, now we are acting as an institution, as a fund, as a united society - keep in mind guys that these notions are easily manipulated in the social media and it is way easier to target a single unified voice than it is to target a bunch of random individuals. When it comes to our beloved stocks like $BB, $PLTR, $GME it is important to highlight the fact of our <strong>individual purchases</strong>, <strong>individual subscriptions</strong> to their services, individual DDs and so much more. By silently increasing our positions as separate human beings, by silently promoting companies we are able to dish out more fire power which cannot be harassed online as we are under a cloak of shadow.</p>\n\n<p>Pardon my broken English, but I hope you get the notch - WSB should not be a team or a gang - it should be all different individuals just sharing the same vision. <strong>We must not respond to online media callouts</strong>, we must not pay too much attention to news portals and videos calling us out. It only gives a negative outcome and makes us more vulnerable, thus allowing bears and other dipshit analysts to use WSB against their own stocks - detract other individuals/entities that may be interested in the stock by displaying us as a gang of monkeys.</p>\n\n<p>I hope this message reaches some of you out, I have seen similar messages already hanging, but wanted to share my voice and remind you all - <strong>we achieved such astounding results by acting separately</strong> and based on a solid DD, <strong>not by acting as a single unit</strong>. Thank you and god bless this community.</p>\n\n<p><strong>EDIT</strong>: a very nice way to put it is to compare us to a beehive. It is way easier to eliminate a whole group of bees when they are in a single unit, however it is way more difficult to act against bees that are roaming free within the nature and may sting from various angles. <strong>The unseen weapon is the deadliest.</strong></p>\n</div><!-- SC_ON -->",
  "score": 3135,
  "permalink": "/r/wallstreetbets/comments/l2bcx0/playing_a_role_of_silent_assassin_is_the_best/",
  "subreddit": "wallstreetbets",
  "id": "l2bcx0",
  "is_self": true,
  "media": null,
  "is_video": false
}