{
  "author": "Drummingbird216",
  "original_created_utc": 1637480524,
  "title": "My girlfriend is insistent on getting a job at a brothel for more money, and I'm not comfortable with it. What can I tell her to change her mind?",
  "created_utc": 1637513697,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My girlfriend and I (both 20 years old) have been dating for about 6 months now, and I thought it was going really well. We have our differences but we both love each other a lot and want to get a place together, mostly to get away from our families for personal reasons. We don&#39;t have jobs that allow us to save up money quickly enough to get a place for ourselves as soon as we want though. Originally we talked about this and agreed we would be patient and hopefully find better paying jobs in the near future.\nWell, last night she admits to me that she had been talking to one her old school friends whom I am unfamiliar with. This friend offered her a job at the brothel she works at a few suburbs away, telling her she&#39;ll get $300 - $400 a night there, and my girlfriend starts telling me she&#39;s going to take it. She&#39;s instant that the money will be worth it, and that she feels that it will be money she is &#39;proud&#39; to earn herself. She also tells me that I shouldn&#39;t be worried because it&#39;s a legal brothel (which, to be fair, is at least better than the illegal ones in the city), that she can choose her own nights and customers, and that it&#39;ll help us out financially.\nObviously, I&#39;m quite uncomfortable and distressed by her choice, because the job literally her letting other men have sex with her. If she was single that would be different, but we&#39;ve been in a relationship together for a solid amount of time and to her it seems these two things don&#39;t connect at all, other than the money. But I would gladly wait to save up money for us rather than her getting a lot of it doing this job. In response she seemed offended I wasn&#39;t appreciative of her choice. Long story short, we had a fight, and she ended it with a nasty remark about my sexual performance, something she knows I&#39;m insecure about. So that&#39;s probably a factor too. We haven&#39;t seen each other since then, and she starts her &#39;new job&#39; in 2 days.\nIs there anything I could tell her to change her mind or dissuade her? I do still love her, but I don&#39;t know if I can stay in this relationship with her if she continues with this. Thanks.</p>\n</div><!-- SC_ON -->",
  "score": 139,
  "permalink": "/r/TooAfraidToAsk/comments/qyq08g/my_girlfriend_is_insistent_on_getting_a_job_at_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "qyq08g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My girlfriend and I (both 20 years old) have been dating for about 6 months now,\nand I thought it was going really well. We have our differences but we both love\neach other a lot and want to get a place together, mostly to get away from our\nfamilies for personal reasons. We don't have jobs that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の彼女と私（ともに20歳）は、付き合い始めて半年ほどになります。\nとてもうまくいっていると思っていました。違いはありますが、お互いに愛し合っています。\n互いのことをとても愛していて、一緒に家を持ちたいと思っている。\n個人的な理由で家族から離れるためです。私たちは仕事を持っていないので、...",
      "title": "僕の彼女は、より多くのお金を得るために風俗店に就職することにこだわっていて、僕はそれに抵抗があります。彼女の気持ちを変えるにはどうしたらいいでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的女朋友和我（都是20岁）已经约会了大约6个月了。\n我认为它进展得非常好。我们有分歧，但我们都很爱对方\n我们有分歧，但我们都很爱对方，并想一起找一个地方，主要是为了远离我们的家庭。\n主要是为了远离我们的家庭，因为个人原因。我们没有工作，没有...",
      "title": "我的女朋友坚持要在妓院找一份工作以获得更多的钱，而我对此感到不舒服。我怎么跟她说才能改变她的想法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的女朋友和我（都是20歲）已經約會了大約6個月了。\n我認爲它進展得非常好。我們有分歧，但我們都很愛對方\n我們有分歧，但我們都很愛對方，並想一起找一個地方，主要是爲了遠離我們的家庭。\n主要是爲了遠離我們的家庭，因爲個人原因。我們沒有工作，沒有...",
      "title": "我的女朋友堅持要在妓院找一份工作以獲得更多的錢，而我對此感到不舒服。我怎麼跟她說才能改變她的想法？"
    }
  ]
}