{
  "author": "jn_ku",
  "the_new_excerpt": "Disclaimer: I am not a financial advisor. This entire post represents my\npersonal views and opinions, and should not be taken as financial advice (or\nadvice of any kind whatsoever). I encourage you to do your own research, take\nanything I write with a grain of salt, and hold me accountable for any…",
  "original_created_utc": 1612006605,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "免责声明：我不是财务顾问。整篇文章仅代表我\n个人观点和意见，不应视为财务建议（或）。\n任何形式的建议）。) 我鼓励你做自己的研究，采取必要的措施。\n我写的任何东西都要小心翼翼，并让我对任何... ...",
      "title": "Gamestop大图片。技术回顾 - 1/25 - 1/29"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "免責聲明：我不是財務顧問。整篇文章僅代表我\n個人觀點和意見，不應視爲財務建議（或）。\n任何形式的建議）。) 我鼓勵你做自己的研究，採取必要的措施。\n我寫的任何東西都要小心翼翼，並讓我對任何... ...",
      "title": "Gamestop大圖片。技術回顧 - 1/25 - 1/29"
    }
  ],
  "title": "Gamestop Big Picture: Technical Recap - 1/25 - 1/29",
  "created_utc": 1612018046,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>Disclaimer: I am not a financial advisor. This entire post represents my personal views and opinions, and should not be taken as financial advice (or advice of any kind whatsoever). I encourage you to do your own research, take anything I write with a grain of salt, and hold me accountable for any mistakes you may catch. Also, full disclosure, I hold a net long position in GME, but my cost basis is very low, and I&#39;m using money I can absolutely lose. My capital at risk and tolerance for risk generally is likely substantially different than yours.</em> </p>\n\n<p>Wow, what a week.  All I&#39;ll say on that for now.  I&#39;ll maybe do a recap of Friday at some point this weekend if I can.</p>\n\n<p>For this post, rather than a narrative recap, I&#39;ll go into some very light technical analysis on a couple of screenshots from TD Ameritrade Thinkorswim and Ortex.  I don&#39;t have a lot of time to go very deep into everything I normally do, but I wanted to give the newer traders an example of how I go about coming to some of my conclusions.</p>\n\n<p>Some of the conclusions I came to in the heat of the moment in my previous posts may also not stand up to more rigorous scrutiny of the data.  In my opinion, at least, it&#39;s very important to ensure that you go back and review any of your high conviction trades from time to time.  Please feel free to use the charts I&#39;ll show to challenge some of the assumptions I may have made and written about while watching the live ticker tape action, social media, and other high-frequency sentiment indicators (things I might rely on for a hyper-realtime momentum monster trade like GME has been this past week).  Maybe use them to challenge your own thoughts and assumptions as well.</p>\n\n<p>I realized while doing this that writing those prior articles probably cost me ~$300k in momentum trade opportunity LOL, since I used all of my free non-trading hour time to write instead of do an even more in-depth version of what I&#39;m going to show you now.  That being said, if that writing helped any of you understand what was going on, and ultimately progress on your way to becoming better traders and investors, that to me is well worth it--maybe one day you too can pay it forward!</p>\n\n<p>If any of you reading this are chart jockeys, please share some tips if you have them.</p>\n\n<p>First, the charts (links since pics aren&#39;t allowed on this sub)</p>\n\n<ol>\n<li><a href=\"https://u.teknik.io/oSTxt.png\">Ortex Short Interest Data</a></li>\n<li><a href=\"https://u.teknik.io/7lF58.PNG\">Daily Summary of the Week</a></li>\n<li><a href=\"https://u.teknik.io/QHqt2.PNG\">1/26/2021 Mini Squeeze Hourly</a></li>\n<li><a href=\"https://u.teknik.io/VoiPc.PNG\">1/28/2021 to 1/29/2021 Fibonacci Retracement</a></li>\n</ol>\n\n<h1>Fundamentals - Ortex Short Interest</h1>\n\n<p>First, lots of questions on the prior post about Short Interest remaining on GME so I&#39;ll start with this one.  Looks good to me.  I think Ortex will update end of trading Friday data just before/around Monday market open.  I consider this chart to convey mostly fundamental data, as the underlying value thesis behind the recent push by retail traders has at least recently been about the squeeze.  This is the type of data you&#39;d use to try to analyze data about the security being traded.  Note that most pro traders would not consider short interest to be a &#39;fundamental &#39; attribute, and normally I&#39;d agree, but I think GME and maybe some of the other high SI plays are an exception to that.</p>\n\n<p>If any of you are inclined to feel jumpy about the diving lines on the chart, make sure to look at the axis values on the left.  The chart is calibrated to capture the movement over the period, so the bottom of the axes are not 0.</p>\n\n<p>A few things to note:</p>\n\n<ol>\n<li>Short interest drops substantially from 1/26 into 1/27</li>\n<li>Volume is shrinking</li>\n<li>Remaining free float on loan has gone down, but at 66% as of Thursday, is still quite high</li>\n</ol>\n\n<h1>Overview - Daily Chart &amp; Summary of the Week</h1>\n\n<p>A few things going on here</p>\n\n<ol>\n<li>The big volume days on Friday, Monday, and Tuesday are when it seems to me that the greatest retail momentum would have occurred.  The battles were pretty intense at key price points if you take a closer look at those intra-day charts.</li>\n<li>Big picture here, what it tells me is that many if not most of the retail share volume was acquired at or below $148 on huge volume.  That means the core of your retail support, and the majority of shares in WSB diamond hands would have been bought probably between the $30 and $148 price range.  My guess is that Only DFV the DFV early acolytes, Dr. Burry, and the institutional holders have meaningful volume below $30.</li>\n<li>Given points 1 and 2, I&#39;d consider the $148 price level as the critical defense level of your earliest, hardest retail support.  You can dive deeper into the 1/26 trading day and possibly make a case for other levels as well, but I&#39;ll roll with that for now.</li>\n<li>Ok, so maybe the Melvin guys weren&#39;t really lying.  The Ortex data showing short interest drop from 1/26 to 1/27 coinciding with the massive and sudden price dislocation upward on 1/27.</li>\n<li>If new shorts entered the game it would have been near the highs, possibly selling into the forced buying of what I&#39;ll just assume was the overnight Melvin squeeze and into the early market  hours on 1/28.  Possibly aggressive momentum shorting on top of the Robin Hood BS, the bots, and the networking issues came together in a perfect storm with that HFT ladder attack on the vertical dive.  Wow--no wonder that thing was so intense.</li>\n<li>As you can see on that downside wick on 1/28, the huge momentum briefly pierced the Retail line before being slammed back up.  We&#39;ll take a closer look in the fibonacci chart.</li>\n</ol>\n\n<h1>Analysis - Mini Squeeze Hourly</h1>\n\n<p>Just a few notes. I checked and the after hours volume here was sudden, quite unusual, and pretty consistent with a forced liquidation of a substantial position.  Rather than slamming it all out at once, the broker spread it out quite a bit.  Some takeaways:</p>\n\n<ol>\n<li>If you wanted to take money from Melvin, this was the chance, and a lot of people (or a few whales) certainly did.  The numbers in my summary were very quick mental math of the hourly volumes in overnight trading</li>\n<li>The price didn&#39;t break away as aggressively as it probably could have, which means there was some carefully calibrated pre-planning to unload a bunch of shares, laddering up to the $350 level.</li>\n<li>I am genuinely sorry to have to conclude, therefore, that the WSB bros with the $420.00 limit got scooped. Something on the order of 17 million shares worth of Melvin dollars got cashed out under them by a HFT whale with access to firehose shares at Melvin&#39;s broker all the way through overnight trading.  few retail even have the ability to trade for that entire window, and certainly not on the order of 17 million shares anyway.</li>\n<li>Another important takeaway: 17 million shares is a lot, but it&#39;s nowhere near the entire original SI in GME.  The Game hasn&#39;t necessarily Stopped yet (heh).</li>\n</ol>\n\n<h1>Technical Analysis - 1/28 to 1/29 Fibonacci Retracement</h1>\n\n<p>For those of you who are unfamiliar with what traders call &quot;technical analysis&quot;, it&#39;s really just a fancy set of words to say looking at squiggly lines, bars, etc. on charts to try to figure out what&#39;s going on.</p>\n\n<p>One particularly popular tool is called a fibonacci retracement.  It sounds a lot fancier than it is, but it is extremely useful, and extremely commonly used by momentum traders (which is partly why it&#39;s useful--if everyone is trading off of the same thing, it&#39;s a self-reinforcing bias in the market).  There is a lot of background reading you can do on the topic--I recommend it.  You&#39;ll be a better trader and even investor for it, as it tends to be useful even on longer timeframe charts.  Kind of uncanny really.</p>\n\n<p>Looking at this chart I realize I probably should have plotted the &#39;retail line of defense&#39; here too.  Oh well, maybe next time.</p>\n\n<p>Takeaways:</p>\n\n<ol>\n<li>I figured the relevant trading range going forward was peak euphoria to peak despair in regular trading on relatively good volume.  That happened to be the top to bottom move on the Robin Hood news.</li>\n<li>Using that for the fibonacci retracement, you can see how much of the trading action bounces around between the various levels before settling in scarily accurately into the 50% - 61.8% channel in after hours trading.</li>\n<li>it&#39;s quite possible that short-term equilibrium on this battleground stock is $300 to $350 until either side makes a strong push.  Price was trapped in that range toward the end of normal trading on relatively good volume.</li>\n<li>Probably a bunch of momentum traders drew exactly this retracement (or something very similar) for their rest of day trading after the floor got put in near the retail line of defense.  In all honesty it&#39;s hard to say if the tool works because of some fundamental reason or because everyone uses it so everyone times their momentum plays off the same playbook, making it self-reinforcing.  All that matters in the end is that it works pretty consistently once you get used to working with it.</li>\n<li>Below the price graph, pay attention to the volume bars below.  It&#39;s especially critical when trading momentum to understand the relationship between share volume and price, as there are patterns that are more likely to play out depending on the relationship.  For example, when price is moving around a lot, is it doing so on high volume or not much volume?</li>\n<li>Traders tend to overshoot a little on each push, so even if price ultimately drops lower after an upside spike, if the volume on that drop is low compared to the upward push, that actually tells you that it&#39;s likely to go higher a little later on.  There are many sites that go more in depth into this kind of thing (patterns, volume and price analysis, etc.), and it is incredibly useful to try to understand what to take away from price and volume movement as you watch it unfold live.</li>\n</ol>\n\n<p>Lots more going on here, but this post is getting pretty long already.</p>\n\n<h1>Other Takeaways</h1>\n\n<ul>\n<li>The whales in the pond obviously do their homework (that&#39;s how they got to be that big, after all), and they were therefore prepared to act decisively to unload 17 million shares at the upper end of the trading range when Melvin got blown up.  That&#39;s how you make big bank on big volume--do your homework.</li>\n<li>My thesis in the <a href=\"https://www.reddit.com/r/investing/comments/l6xc8l/gamestop_big_picture_the_short_singularity_pt_2/\">part 2 article</a> that the big early drop before retail pre-market was a short-side scare tactic could very well be totally wrong.  You could make a case either way that it was a new short-side player diving in at a higher price point, a  long-side whale making bank, or a combo of both.  if you check the Ortex data against the numbers here you can probably come up with an order of magnitude educated estimate.  If so, apologies to the CNBC Squawk Box crew--probably no factual inaccuracies in your reporting (though the tone did make a lot of retail panic)</li>\n<li>Ironically, it might very well have been the continued unwinding of Melvin&#39;s short position that intercepted the panic drop into premarket rather than a long-side heavy hitter.  LOL.</li>\n<li>Thursday afternoon and Friday were low volume, low-conviction momentum sloshing around.  Dueling HFT algos and momentum traders trying to scalp alpha from each other is my guess.</li>\n<li>Contract expiration may cause a price dislocation into the new trading week, so I&#39;m not sure the fibonacci retracement chart is still useful.</li>\n<li>I&#39;m sure if I go back over my previous articles and compare to the chart data more carefully I&#39;ll find all kinds of other inconsistencies with my realtime thoughts.  It&#39;s key when trading, at least in my opinion, that you are willing, able, and indeed eager to go back and rethink your assumptions, no matter how much you liked them. Challenge and verify with data whenever possible.  Not doing that is how Melvin got blown up, after all.</li>\n<li>My worst case scenario thesis in the <a href=\"https://www.reddit.com/r/investing/comments/l7qlfh/gamestop_big_picture_the_short_singularity_pt_3/\">part 3 article</a> may still be valid depending on the total amount of short interest loading up into GME at these newer highs.  I remember hearing some fund manager talking about shorting GME at the $400 as a stabilization mechanism.  Wow.. short something with the most hyper volatility of any $1bn+ stock I&#39;ve ever heard of... for stability.  That&#39;s not a word I&#39;d ever associate with a WSB meme momentum rollercoaster stock.</li>\n<li>An infinity squeeze is still totally on the table, as long as sufficient short interest remains.  The strategy and tactics you&#39;d use to get there may have to be different though, as price ratchets up into higher bands. I&#39;ll keep those thoughts to myself--for sure those WSB guys have a plan.  They&#39;ve proven to be scary effective so far after all.</li>\n</ul>\n\n<p>There are other things you can take away, or theses you can come up with from these and other charts you may have access to.  Hopefully, for you newer traders I&#39;ve given you a useful glimpse into how I might try to use readily available data to improve/challenge/refine a working thesis to ensure I&#39;m better prepared for the days ahead.  You should find the tools that seem to work best for you.</p>\n\n<p>Hope you all have a good weekend.  See you on the field on Monday.</p>\n</div><!-- SC_ON -->",
  "score": 4846,
  "permalink": "/r/investing/comments/l8jwsl/gamestop_big_picture_technical_recap_125_129/",
  "subreddit": "investing",
  "id": "l8jwsl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518534768
}