{
  "author": "KristaMilliman",
  "original_created_utc": 1638884974,
  "title": "Crypto gaming sucks, so let's make them good!",
  "created_utc": 1638909128,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi friends!  &lt;/p&gt;\n\n&lt;p&gt;Saw a post just now and thought it&amp;#39;d be good to tell the community a little about what&amp;#39;s going on under the hood, instead of just swarming around the problem (which is real, validated, and generally acknowledged; though, you will find a few gems if you look hard enough). &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also running on like very little sleep so apologies if I don&amp;#39;t sound coherent in advance :)&lt;/p&gt;\n\n&lt;p&gt;Web3 games is a topic that I&amp;#39;ve researched a lot with my close group of friends! For purposes of showing that I&amp;#39;m not talking out of my butt hole, I&amp;#39;m a management consultant that&amp;#39;s worked with an Eth cofounder on some stuff at a globally known firm, and my friends looking into this space with me are from the valley. We also have gaming backgrounds!&lt;/p&gt;\n\n&lt;p&gt;There are some insanely street smart individuals that not only did their research, but started executing just this year. They understood that players will generally prioritize playing fun games in the long-run, but once you throw in the ability to earn significant wealth, the tactical short-term decisions made by players start to differ person by person. Due to this, devs in this space end up making a semi-mutually exclusive choice: quick win vs long win. This is why you are seeing such a large disparity in the quality of games, from AAA like all the way down to crappy flash clones haha... Nonetheless, the big winners will be the ones currently designing great games first, and then considering blockchain applications second.&lt;/p&gt;\n\n&lt;p&gt;In our opinion, it&amp;#39;s only a matter of time before web3 games become mainstream. Although the models being implemented today don&amp;#39;t seem sustainable in the long-term, the core principle is there. The agency (alignment of interests) is just too much better than the current system for both players and game devs. You can argue that there has been a tactical failure on proper economic design/application, but to say the overall strategy/paradigm shift is bad would probably be incorrect (just based on Axie data ttm alone). Keep in mind that I&amp;#39;m not even diving into interoperability of games/IP yet, or how on-chain systems are better from a psychology and ops perspective (some really revolutionary things have yet to be discovered!).&lt;/p&gt;\n\n&lt;p&gt;So what&amp;#39;s the optimal play here? We were personally working on a deadass simple platform that would allow any game dev to create an open economy (whether on or off-chain, with choice of token, NFT, or both) in less than 5 minutes. Our hypothesis was that great games already exist, so it&amp;#39;s a matter of creating a bridge and trying to deepen current player experiences, instead of having to spend a year creating a new one.&lt;/p&gt;\n\n&lt;p&gt;Of course, before we started building this, we tried to sell to a few game devs (as players will follow).&lt;/p&gt;\n\n&lt;p&gt;The main problem? Education.&lt;/p&gt;\n\n&lt;p&gt;The amount of time spent having to teach them about how open economics would help their game didn&amp;#39;t feel presently scalable. There&amp;#39;s too much they haven&amp;#39;t been exposed to, so the timing isn&amp;#39;t quite there yet (4 years too early). This is why we believe the (really bad) current platforms that try to do this will fail or be useless until properly implemented blockchain games start blowing the traditional models out of market.&lt;/p&gt;\n\n&lt;p&gt;So now we&amp;#39;re starting up a blockchain game shop and aiming to build said properly implemented blockchain games that will beat traditional games! Along the way, we&amp;#39;re going to be abstracting our infrastructure to offer easy bridging for existing games (for when the time comes).&lt;/p&gt;\n\n&lt;p&gt;Shameless promo - we&amp;#39;re going to be raising a few $ so if you&amp;#39;re a whale/VC reading this, ping me!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/razlzv/crypto_gaming_sucks_so_lets_make_them_good/",
  "subreddit": "CryptoCurrency",
  "id": "razlzv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi friends!\n\nSaw a post just now and thought it'd be good to tell the community a little\nabout what's going on under the hood, instead of just swarming around the\nproblem (which is real, validated, and generally acknowledged; though, you will\nfind a few gems if you look hard enough).\n\nI'm also…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。\n\n先ほど、ある投稿を見て、コミュニティの皆さんに少しお伝えした方が良いのではと思いました。\nの周りに群がるのではなく、ボンネットの下で何が起こっているのか？\nこの問題は、実際に存在し、検証され、一般に認められています。\nよく探せば逸品もある)。\n\nまた、私は...",
      "title": "クリプトゲーミングは最悪だから、良いものにしよう!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "朋友们好!\n\n刚才看到一个帖子，觉得应该向社区介绍一下\n关于引擎盖下发生的事情，而不是一窝蜂地围着这个问题转。\n这个问题是真实的，经过验证的，并且被普遍承认的；不过，如果你足够努力，你会\n如果你足够努力地寻找，你会发现几颗宝石）。\n\n我还...",
      "title": "低成本游戏很糟糕，所以让我们把它们变成好的！\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "朋友們好!\n\n剛纔看到一個帖子，覺得應該向社區介紹一下\n關於引擎蓋下發生的事情，而不是一窩蜂地圍着這個問題轉。\n這個問題是真實的，經過驗證的，並且被普遍承認的；不過，如果你足夠努力，你會\n如果你足夠努力地尋找，你會發現幾顆寶石）。\n\n我還...",
      "title": "低成本遊戲很糟糕，所以讓我們把它們變成好的！\"。"
    }
  ]
}