{
  "author": "Upper-Lawfulness1899",
  "original_created_utc": 1625462041,
  "title": "The US has been known as the \"world police\" but has the US ever actually engaged in an invasion of a foreign nation on a strictly humanitarian rights effort and not to secure its own business interests?",
  "created_utc": 1625502816,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For example, I&#39;ve read one of the reasons South Africa pursued a nuclear weapons program was to stave off an invasion from other countries for upholding apartheid, so when they ended apartheid, they likewise gave up nuclear weapons, the only nation known to have done that.</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/oe0d6u/the_us_has_been_known_as_the_world_police_but_has/",
  "subreddit": "AskHistorians",
  "id": "oe0d6u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For example, I've read one of the reasons South Africa pursued a nuclear weapons\nprogram was to stave off an invasion from other countries for upholding\napartheid, so when they ended apartheid, they likewise gave up nuclear weapons,\nthe only nation known to have done that.",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、南アフリカが核兵器を開発した理由の一つは、他国からの侵略を防ぐためだと読んだことがあります。\nアパルトヘイトを維持することで他国からの侵略を防ぐために核兵器を開発した。\nだから、アパルトヘイトを終わらせたときに、核兵器も放棄したのです。\nこのようなことをした唯一の国である。",
      "title": "アメリカは「世界の警察」と呼ばれていますが、実際にアメリカが自国のビジネスの利益を確保するためではなく、厳密に人道的な権利のために外国への侵攻を行ったことがあるでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "例如，我读到南非推行核武器计划的原因之一是为了避免其他国家的入侵。\n是为了避免其他国家因维护种族隔离而入侵。\n因此，当他们结束种族隔离制度时，他们也同样放弃了核武器。\n这是已知的唯一一个这样做的国家。",
      "title": "美国一直被称为 \"世界警察\"，但美国是否曾真正参与过对一个外国的入侵，完全是出于人道主义权利的努力，而不是为了确保自己的商业利益？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "例如，我讀到南非推行核武器計劃的原因之一是爲了避免其他國家的入侵。\n是爲了避免其他國家因維護種族隔離而入侵。\n因此，當他們結束種族隔離制度時，他們也同樣放棄了核武器。\n這是已知的唯一一個這樣做的國家。",
      "title": "美國一直被稱爲 \"世界警察\"，但美國是否曾真正參與過對一個外國的入侵，完全是出於人道主義權利的努力，而不是爲了確保自己的商業利益？"
    }
  ]
}