{
  "author": "Bripbropdroptop",
  "original_created_utc": 1653661573,
  "title": "Forget Columbus, forget Lief Erikson. Why does nobody talk about Polynesians discovering the Americas?",
  "created_utc": 1653675886,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m reading the book &lt;em&gt;Who ate the First Oyster&lt;/em&gt; right now (highly recommend). Each chapter goes into historical &amp;amp; scientific detail of an important “first” in history. The last chapter is on the first person to set foot in Hawaii, but it talks about Polynesian exploration in general really.&lt;/p&gt;\n\n&lt;p&gt;It absolutely blew my mind.&lt;/p&gt;\n\n&lt;p&gt;The author just offhandedly mentioned how sweet potatoes from Chile have been found in New Zealand, indicating there were trade routes covering thousands of miles traversed in essentially Catamarans. A quick google search afterwards revealed there’s a lot of DNA &amp;amp; Linguistic evidence backing up that this ain’t just speculation at this point — the word for root vegetable is earilly similar between Chileans and distant Pacific Islanders, for example. From a Nat Geo article:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And the Polynesian name for the root vegetable—&amp;quot;kuumala&amp;quot;—resembles its names in the Andean Quechua language: &amp;quot;kumara&amp;quot; and &amp;quot;cumal.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;How the hell is nobody talking about this?? It’s bad enough that we still talk about Columbus as much as we do, and only fairly recently does it feel like American classrooms have added Lief Erikson as an asterisk next his name. What’s been keeping the Polynesians out of the narrative?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 891,
  "permalink": "/r/AskHistorians/comments/uyze2i/forget_columbus_forget_lief_erikson_why_does/",
  "subreddit": "AskHistorians",
  "id": "uyze2i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m reading the book Who ate the First Oyster right now (highly recommend). Each\nchapter goes into historical & scientific detail of an important “first” in\nhistory. The last chapter is on the first person to set foot in Hawaii, but it\ntalks about Polynesian exploration in general really.\n\nIt…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、「Who ate the First Oyster」という本を読んでいます（お薦めです）。各\n各章では、歴史上重要な「最初」について、歴史的・科学的な詳細が述べられています。\n歴史的、科学的に詳しく書かれています。最後の章は、ハワイに初めて足を踏み入れた人についてですが、ポリネシアの探検全般について書かれています。\nポリネシアの探検について書かれています。\n\nこれは...",
      "title": "コロンブスを忘れ、リーフ・エリクソンを忘れる。なぜ誰もポリネシア人がアメリカ大陸を発見したことを語らないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我现在正在读《谁吃了第一只牡蛎》这本书（强烈推荐）。每一章\n每一章都对历史上一个重要的 \"第一 \"进行了历史和科学方面的详细介绍。\n历史上一个重要的 \"第一\"。最后一章是关于第一个踏上夏威夷的人，但它讲的是\n谈到了波利尼西亚人的探索。\n\n这本书的内容很丰富。",
      "title": "忘记哥伦布，忘记莱夫-埃里克森。为什么没有人谈论波利尼西亚人发现美洲的事情？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我現在正在讀《誰吃了第一隻牡蠣》這本書（強烈推薦）。每一章\n每一章都對歷史上一個重要的 \"第一 \"進行了歷史和科學方面的詳細介紹。\n歷史上一個重要的 \"第一\"。最後一章是關於第一個踏上夏威夷的人，但它講的是\n談到了波利尼西亞人的探索。\n\n這本書的內容很豐富。",
      "title": "忘記哥倫布，忘記萊夫-埃裏克森。爲什麼沒有人談論波利尼西亞人發現美洲的事情？"
    }
  ]
}