{
  "author": "Bripbropdroptop",
  "original_created_utc": 1653661573,
  "title": "Forget Columbus, forget Lief Erikson. Why does nobody talk about Polynesians discovering the Americas?",
  "created_utc": 1653675886,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m reading the book &lt;em&gt;Who ate the First Oyster&lt;/em&gt; right now (highly recommend). Each chapter goes into historical &amp;amp; scientific detail of an important “first” in history. The last chapter is on the first person to set foot in Hawaii, but it talks about Polynesian exploration in general really.&lt;/p&gt;\n\n&lt;p&gt;It absolutely blew my mind.&lt;/p&gt;\n\n&lt;p&gt;The author just offhandedly mentioned how sweet potatoes from Chile have been found in New Zealand, indicating there were trade routes covering thousands of miles traversed in essentially Catamarans. A quick google search afterwards revealed there’s a lot of DNA &amp;amp; Linguistic evidence backing up that this ain’t just speculation at this point — the word for root vegetable is earilly similar between Chileans and distant Pacific Islanders, for example. From a Nat Geo article:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And the Polynesian name for the root vegetable—&amp;quot;kuumala&amp;quot;—resembles its names in the Andean Quechua language: &amp;quot;kumara&amp;quot; and &amp;quot;cumal.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;How the hell is nobody talking about this?? It’s bad enough that we still talk about Columbus as much as we do, and only fairly recently does it feel like American classrooms have added Lief Erikson as an asterisk next his name. What’s been keeping the Polynesians out of the narrative?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 891,
  "permalink": "/r/AskHistorians/comments/uyze2i/forget_columbus_forget_lief_erikson_why_does/",
  "subreddit": "AskHistorians",
  "id": "uyze2i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m reading the book Who ate the First Oyster right now (highly recommend). Each\nchapter goes into historical & scientific detail of an important “first” in\nhistory. The last chapter is on the first person to set foot in Hawaii, but it\ntalks about Polynesian exploration in general really.\n\nIt…"
}