{
  "author": "WhoAmIEven2",
  "original_created_utc": 1627104477,
  "title": "Why do conspiracy theorists not believe scientists, but gladly believe youtubers and discredited former scientists?",
  "created_utc": 1627134346,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>They choose not to believe actual scientists, but they gladly link &quot;research&quot; by  infamous Astrology-Anna, who sells orgone rocks and anti-5G protection for your mobile phone. Discredited former scientist Crazy Crazysson, who once was an actual scientist but was kicked out for his batshit insane claims, is also a pretty good source and definitely knows what&#39;s up. </p>\n\n<p>Why are they like this?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/oqjspq/why_do_conspiracy_theorists_not_believe/",
  "subreddit": "NoStupidQuestions",
  "id": "oqjspq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "They choose not to believe actual scientists, but they gladly link \"research\" by\ninfamous Astrology-Anna, who sells orgone rocks and anti-5G protection for your\nmobile phone. Discredited former scientist Crazy Crazysson, who once was an\nactual scientist but was kicked out for his batshit insane…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼らは実際の科学者を信じようとしませんが、オルゴン・ロックやアンチ・Gプロテクションを販売している悪名高い占星術アナの「研究」は喜んでリンクします。\nオルゴン石や携帯電話の5G対策を販売している悪名高い占星術アンナの「研究」を喜んでリンクしている。\nの研究を喜んでリンクしています。信用されていない元科学者のクレージー・クレージーソンは、かつて実際の科学者でしたが\n狂気の沙汰で追い出されてしまった。",
      "title": "なぜ陰謀論者は科学者を信じず、ユーチューバーや信用できない元科学者を喜んで信じるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他们选择不相信真正的科学家，但他们很乐意将臭名昭著的占星学-安娜的 \"研究 \"联系起来。\n恶名昭彰的Astrology-Anna的 \"研究\"，她卖的是orgone岩石和为你的手机提供的抗5G保护。\n手机的反5G保护。声名狼藉的前科学家Crazy Crazysson，曾经是一名真正的科学家，但被踢出局。\n他曾经是一名真正的科学家，但因为他的疯狂行为而被踢出局......",
      "title": "为什么阴谋论者不相信科学家，却欣然相信优酷网友和名誉扫地的前科学家？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他們選擇不相信真正的科學家，但他們很樂意將臭名昭著的占星學-安娜的 \"研究 \"聯繫起來。\n惡名昭彰的Astrology-Anna的 \"研究\"，她賣的是orgone岩石和爲你的手機提供的抗5G保護。\n手機的反5G保護。聲名狼藉的前科學家Crazy Crazysson，曾經是一名真正的科學家，但被踢出局。\n他曾經是一名真正的科學家，但因爲他的瘋狂行爲而被踢出局......",
      "title": "爲什麼陰謀論者不相信科學家，卻欣然相信優酷網友和名譽掃地的前科學家？"
    }
  ]
}