{
  "author": "thunderousqueef",
  "the_new_excerpt": "Hyundai Motor and Apple Inc plan to sign a partnership deal on autonomous\nelectric cars by March and start production around 2024 in the United States.\n\nThe report follows a statement on Friday from Hyundai Motor that it was in early\ntalks with Apple after another local media outlet said the…",
  "original_created_utc": 1610324207,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "现代汽车和苹果公司计划签署自动驾驶合作协议\n电动汽车将于明年3月之前在美国开始生产，并于2024年左右开始生产。\n\n在这份报告发布之前，现代汽车(Hyundai Motor)周五发表声明称，它正处于早期\n在另一家当地媒体表示…与苹果谈判后",
      "title": "苹果和现代汽车计划签署电动汽车合作协议"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現代汽車和蘋果公司計劃簽署自動駕駛合作協議\n電動汽車將於明年3月之前在美國開始生產，並於2024年左右開始生產。\n\n在這份報告發布之前，現代汽車(Hyundai Motor)週五發表聲明稱，它正處於早期\n在另一家當地媒體表示…與蘋果談判後",
      "title": "蘋果和現代汽車計劃簽署電動汽車合作協議"
    }
  ],
  "title": "Apple and Hyundai Motor plan to sign an EV partnership deal",
  "created_utc": 1610348450,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hyundai Motor and Apple Inc plan to sign a partnership deal on autonomous electric cars by March and start production around 2024 in the United States.</p>\n\n<p>The report follows a statement on Friday from Hyundai Motor that it was in early talks with Apple after another local media outlet said the companies aimed to launch a self-driving electric car in 2027, sending Hyundai shares up nearly 20%. (OTCMKTS: HYMTF)</p>\n\n<p>Hyundai Motor declined to comment on the report on Sunday, and reiterated Friday’s comments that it has received requests for potential cooperation from various companies on developing autonomous EVs.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://www.reuters.com/article/uk-hyundai-motor-apple/apple-hyundai-set-to-agree-electric-car-tie-up-says-korea-it-news-idUSKBN29F0C1\">Source</a></p>\n</div><!-- SC_ON -->",
  "score": 79,
  "permalink": "/r/stocks/comments/kuqssm/apple_and_hyundai_motor_plan_to_sign_an_ev/",
  "subreddit": "stocks",
  "id": "kuqssm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706381134
}