{
  "author": "Fantastic-Cucumber-1",
  "the_new_excerpt": "Yield farming is becoming increasingly popular among crypto investors. Of\ncourse, this is not illogical: DeFi platforms offer much higher interest rates\ncompared to traditional banks. To understand yield farming, you first need to\nknow what the interest-on-interest effect (or compound interest)…",
  "original_created_utc": 1619678862,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イールドファーミングは、暗号化された投資家の間で人気が高まっています。もちろん\nもちろん、これは非論理的なことではありません。DeFiプラットフォームは、従来の銀行に比べてはるかに高い金利を\n従来の銀行に比べてはるかに高い金利を提供しています。イールドファーミングを理解するには、まず以下のことが必要です。\n利子対利子効果（または複利）とは何か？",
      "title": "DeFiの説明。イールド・ファーミング"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "产量养殖在加密货币投资者中变得越来越流行。当然\n当然，这并不是不合逻辑的。DeFi平台提供更高的利率\n与传统银行相比要高得多。要了解收益率耕作，你首先需要\n知道什么是利滚利效应（或复利）...",
      "title": "DeFi的解释。产量耕作"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "產量養殖在加密貨幣投資者中變得越來越流行。當然\n當然，這並不是不合邏輯的。DeFi平臺提供更高的利率\n與傳統銀行相比要高得多。要了解收益率耕作，你首先需要\n知道什麼是利滾利效應（或複利）...",
      "title": "DeFi的解釋。產量耕作"
    }
  ],
  "title": "DeFi Explained: Yield farming",
  "created_utc": 1619703680,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yield farming is becoming increasingly popular among crypto investors. Of course, this is not illogical: DeFi platforms offer much higher interest rates compared to traditional banks. To understand yield farming, you first need to know what the interest-on-interest effect (or compound interest) is.</p>\n\n<h1>Compound interest</h1>\n\n<p>When you are saving money at a bank, you receive an interest payment for this: the so-called savings interest. Depending on the chosen type of savings, the interest is paid into the savings account or another (checking) account. If the interest payment is added to the savings account, you also accrue interest over that interest amount. This is called the interest-on-interest effect (compound interest).</p>\n\n<h1>Factors for success</h1>\n\n<p>The effect of compound interest depends on three factors:</p>\n\n<ul>\n<li>Time. How long do you leave the money? You can see in the graph that the effect increases as more time passes.</li>\n<li>The percentage of interest or return that you make. Nowadays you hardly get any interest on a savings account, this affects your return. As a result, the effect of interest-on-interest is limited. The higher your return, the greater the impact of what Einstein called the eighth wonder of the world.</li>\n<li>The starting amount. The larger your starting amount, the greater the effect. After all, that starting amount grows every year.</li>\n</ul>\n\n<p>One of the richest investors on the planet, Warren Buffet, has been taking advantage of compound interest for years. He bought his first stock when he was 11 years old. He made above-average returns and stayed off his money for decades. You can imagine how big the effect of interest-on-interest is.</p>\n\n<h2>Example:</h2>\n\n<p>Let’s say you want to deposit $20,000. There are 2 banks who both offer interest. One pays 4% per year and the other one pays 1% per quarter. Let’s put $10,000 in both banks and see what happens:</p>\n\n<ul>\n<li>Bank A: interest payment: 4% (per year)</li>\n<li>Bank B: interest payment: 1% (per quarter)</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Bank A: 4% of $10,000 = $400 in interest per year</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Bank B: 1% of $10,000 = $100 in the first quarter</li>\n<li>1% of $10,100 = $101 in the second quarter</li>\n<li>1% of $10,201 = $102.10 in the third quarter</li>\n<li>1% of $10,303.10 = $103.03 in the fourth quarter</li>\n<li>Bank B: total amount of interest on an annual basis: $406.13.</li>\n</ul>\n\n<p>The effective return of bank B is higher than bank A: 4.06 percent on an annual basis.</p>\n\n<h1>Example of yield farming</h1>\n\n<p>Because yield farming is often combined with liquidity pools, I suggest that you read my post about liquidity pools first. You can do so by <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/mfk2oi/defi_explained_liquidity_pools/\">clicking this link</a>.</p>\n\n<p>In my previous post about liquidity pools I provided a good example of yield farming with liquidity pool tokens (LP tokens):</p>\n\n<p><em>Like any other tokens, LP (liquidity providers) can stake their tokens from the liquidity pool during the period of the smart contract. A LP can therefore deposit this token on another platform that accepts the liquidity pool token to get additional yield to maximize returns. Therefore, the user can compound two or three interest rates using yield farming, and maximize returns.</em></p>\n\n<p><em>An example of such a DeFi platform is harvest.finance. Harvest.finance allows the LP to stake their tokens and rewards them with additional rewards</em> <strong><em>on top</em></strong> <em>of their fees rewards from the liquidity pool. In harvest.finance’s case, they reward the user with FARM tokens.</em></p>\n\n<p><em>So as an example: Let’s say you have deposited $100 in a USDC/ETH liquidity pool on Uniswap with an annual percentage yield (APY) of 50%. The received UNI LP tokens can then be staked at havest.finance for additional rewards, which in this case would be 70% FARM APY.</em></p>\n\n<p><em>You can see that, by staking your LP tokens, rewards can be highly lucrative. By utilizing these techniques, APY’s of over 200% can be achieved. Of course, you need to remember that the price of tokens such as FARM are quite volatile and thus there is a risk to turn your $ in FARM into way less amount of $ in a matter of days.</em></p>\n\n<p><em>If you are interested in yield farming, I would recommend to use DeFi dashboard zapper.fi, which gives a great overview of all current liquidity pools and farms.</em></p>\n\n<h1>Yield farming platforms in DeFi</h1>\n\n<h2>Harvest.finance</h2>\n\n<p>Harvest Finance is an automated revenue farming protocol developed for users who want to put their assets to work in high-yielding farming opportunities. Harvest will appeal most to those who cannot manage their decentralized financial positions (DeFi) 24/7 – which is most of us.</p>\n\n<p>If you&#39;ve ever spent time in DeFi, you already know that manually moving money between the different protocols takes time. Developing strategies and control positions takes time as well and gas fees on the Ethereum network are, at the time of writing, pretty high.</p>\n\n<p>Harvest Finance tries to help by automatically searching for the latest DeFi platforms with the highest return. It then optimizes the yield with the latest farming techniques. In addition to your optimized return, you often receive extra interest in the form of harvest.finance’s own token: Farm.</p>\n\n<p>Harvest works best for those looking for an easy way to harvest the yield from the latest projects in DeFi. Hence the name &quot;harvest&quot;. To put money to work in these high yield farming opportunities, users only have to deposit supported tokens to get started.</p>\n\n<h2>Sushi swap</h2>\n\n<p>As a liquidity provider you receive an extra fee on top of almost all liquidity pools on Sushiswap in addition to transaction fees: a daily payout is Sushi tokens. SUSHI is Sushiswap&#39;s own token.</p>\n\n<p>When you have earned some SUSHI, you can take your SUSHI to the SushiBar. Here you can convert your SUSHI into the xSUSHI token. With this token you will earn about 5% interest per year on your amount in SUSHI:</p>\n\n<p>xSUSHI automatically earns fees (0.05% of all swaps, including multichain swaps) proportional to your share in the SushiBar.</p>\n\n<p>You can earn even more by depositing your xSushi on lending platforms such as Aave, to receive a small interest on top of your other interest.</p>\n\n<h2>Curve.fi</h2>\n\n<p>Curve.fi is a decentralized exchange that mainly focuses on exchanging stablecoins (dollar, euro or gold tokens).</p>\n\n<p>Curve pays the liquidity providers from transaction fees made in their pool. This is approximately between 0-10% interest per year, depending on the liquidity pool.</p>\n\n<p>Like Sushiswap, Curve pays interest on top of this transaction fee in its own token: CRV. These interest payments can get pretty high (&gt; 30%!).</p>\n\n<p>Curve also allows you to lock CRV coins into their vault for a set amount of time. Based on how long you lock your tokens and the amount of tokens you’re locking, you can expect even higher interest rates (up to 80%).</p>\n\n<h1>Conclusion</h1>\n\n<p>Because of the interest-on-interest effect, you can let your savings grow faster, without depositing extra money into the account yourself. The higher the savings interest and / or the savings balance, the greater the effect. So, The longer you leave the money, the greater the yield. Thanks to DeFi (and its platforms of course), high interest rates are accessible for every crypto investor.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Do you know <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/mysxvz/defi_explained_stablecoins/\">what stable coins are</a>?</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 297,
  "permalink": "/r/CryptoCurrency/comments/n0yng2/defi_explained_yield_farming/",
  "subreddit": "CryptoCurrency",
  "id": "n0yng2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380959893
}