{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Wednesday, May 26, 2021\n\nStocks mostly consolidated today, finishing modestly higher led by a 0.34% gain\nin the Nasdaq (QQQ). After the volatility experienced in the first weeks of May\nit is very encouraging to see market volatility calming down and holding on to\nrecent gains.…",
  "original_created_utc": 1622062371,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "PsychoMarket Recap - 2021年5月26日（水\n\n今日の株式市場は、ナスダック(QQQ)の0.34%の上昇を筆頭に小幅な上昇で終了した。\nナスダック(QQQ)は0.34%上昇しました。5月の最初の週に経験したボラティリティーの後では\n5月の最初の週に経験したボラティリティの後、市場のボラティリティが落ち着き、最近の上昇を維持していることは非常に心強いです。\n最近の上昇率....",
      "title": "本日、2021年5月26日（水）のマーケット・リカップをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾 - 2021年5月26日，星期三\n\n今天股市大部分时间都在盘整，在纳斯达克（QQQ）0.34%的涨幅带动下小幅收高。\n纳斯达克指数（QQQ）。在经历了5月前几周的动荡之后\n看到市场波动趋于平静，并坚守在\n最近的收益....",
      "title": "以下是今天的市场回顾，2021年5月26日，星期三"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧 - 2021年5月26日，星期三\n\n今天股市大部分時間都在盤整，在納斯達克（QQQ）0.34%的漲幅帶動下小幅收高。\n納斯達克指數（QQQ）。在經歷了5月前幾周的動盪之後\n看到市場波動趨於平靜，並堅守在\n最近的收益....",
      "title": "以下是今天的市場回顧，2021年5月26日，星期三"
    }
  ],
  "title": "Here is a Market Recap for today Wednesday, May 26, 2021",
  "created_utc": 1622088061,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Wednesday, May 26, 2021</strong></p>\n\n<p>Stocks mostly consolidated today, finishing modestly higher led by a 0.34% gain in the Nasdaq (QQQ). After the volatility experienced in the first weeks of May it is very encouraging to see market volatility calming down and holding on to recent gains. Market participants continue to closely monitor incoming inflation data, though it seems fears that the Federal Reserve will be forced to tighten monetary policy have tempered.</p>\n\n<p>New economic data released yesterday shows consumer confidence dipped in April, compared to March, even as more social distancing restrictions were lifted across the US. The Conference Board (a non-profit research organization), released their April Consumer Confidence index which showed sentiment falling steeper than expected. The report showed the consumer confidence index dipped to 117.2 in May from 117.5 in April. However, on the positive side, April&#39;s reading was the highest since February 2020, before the start of Covid-19 lockdowns. Economists expected consumer confidence to rise to 119.5. </p>\n\n<p>Yesterday, members of the Federal Open Market Committee (FOMC), reiterated their stance that they were not yet concerned that new inflation data would force the Fed to tighten monetary policy sooner than expected. St. Louis Federal Reserve President James Bullard said he believed increases in inflation would be “mostly temporary” and that the Fed was “not quite there yet” when it came to discussing tapering its asset purchase program. In separate comments, Kansas City Federal Reserve President Esther George said she did not want the Fed to be “overly reliant on historical relationships and dynamics in judging the outlook for inflation.” </p>\n\n<p>Richard Clarida, Vice Chairman of the Federal Reserve, also said “there will come a time in upcoming meetings” when the Fed would consider tapering the asset purchase program but that “it is going to depend on the flow of data”. The Fed is currently buying $120 billion a month in government-issued and government-backed securities, and has pledged to continue doing that until the economy is more fully recovered.</p>\n\n<p>This reaffirms the market that the Fed is not on a set timeline when it comes to rolling back current accommodative policies and will, as they have said time and again, wait for concrete data before any considerations are made. This follows a similar statement from Jerome Powell back in April 14, which proves market participants shouldn’t worry about quantitative easing tapering, in my opinion. Powell said, “We will reach the time at which we will taper asset purchases when we have made substantial further progress towards our goals from last December. That would in all likelihood be before, well before, the time we would consider raising interest rates. We have not voted on that order but that is the sense of the guidance.”</p>\n\n<p><strong>Highlights</strong> </p>\n\n<ul>\n<li>Great vaccination numbers coming out in the US. According to the Center for Disease Control and Prevention (CDC), the United States has administered 289,212,304 doses of COVID-19 vaccines in the country as of Wednesday morning and distributed 359,849,035 doses. 165,074,907 people had received at least one dose, while 131,850,089 people are fully vaccinated as of Wednesday morning. For context, the entire US population is roughly 328.2 million.</li>\n<li>Amazon (AMZN) announced that former CEO of Amazon Web Services Andy Jassy will formally take over as CEO of the e-commerce giant on July 5. A few months ago, Jeff Bezos, current CEO and founder, announced he was stepping down and transitioning to a role as the Executive Chairman.</li>\n<li>Shares of Ford (F) jumped more than 8% after the company said it was raising it’s investment on electric vehicles from $22 to $30 billion. The company recently announced the all-electric F-150.</li>\n<li>Amazon announced it was purchasing Hollywood movie studio MGM Holdings for $8.45 billion, bolstering Amazon’s streaming service. Mike Hopkins, senior vice president of Prime Video and Amazon Studios said, “The real financial value behind this deal is the treasure trove of IP in the deep catalog that we plan to reimagine and develop together with MGM’s talented team. It’s very exciting and provides so many opportunities for high-quality storytelling &quot;</li>\n<li>Mortgage applications slid by the most since early April last week, with a decline in refinances dragging down overall loan volumes even as purchases ticked up for another week. The Mortgage Bankers Association&#39;s (MBA) weekly market composite index for mortgage applications fell 4.2% during the week ended May 21. This followed a 1.2% rise during the prior week.</li>\n<li>Volkswagen sold more than 206,000 electric vehicles over the past 12 months in Western Europe, more than double the 102,500 made by Tesla over the same time period, according to Schmidt Automotive Research. </li>\n<li><strong>** Please note that the current stock price was written during the session and may not reflect closing price.*\\</strong>*</li>\n<li>Agilent Technologies (A) with a host of target raises. Average price target $155 at Outperform. Stock currently around $133</li>\n<li>Fedex (FDX) with two target raises. Stock currently around $311\n\n<ul>\n<li>KeyCorp from $350 to $370 at Overweight.</li>\n<li>Wells Fargo from $336 to $351</li>\n</ul></li>\n<li>Intuit (INTU) with a host of target raises. Average price target $500 at Buy. Stock currently around $441</li>\n<li>L Brands (LB) target raised by Wells Fargo from $84 to $90 at Overweight. Stock currently around $68</li>\n<li>Lowe’s (LOW) target raised by Royal Bank of Canada from $234 to $240 at Outperform. Stock currently around $194</li>\n<li>Seagate Technology (STX) target raised by Bank of America from $107 to $120 at Buy. Stock currently around $97</li>\n<li>Target (TGT) with four price target raises. Stock currently around $227\n\n<ul>\n<li>Deutsche Bank from $225 to $258 at Buy</li>\n<li>Barclays from $225 to $258 at Buy</li>\n<li>Telsey Advisory Group from $235 to $265 at Outperform</li>\n<li>Raymond James from $215 to $252 at Strong-Buy</li>\n</ul></li>\n<li>TJX with two target raises. Stock currently around $68\n\n<ul>\n<li>Deutsche Bank from $80 to $84 at Buy</li>\n<li>Barclays from $82 to $87</li>\n</ul></li>\n<li>UPS target raised by KeyCorp from $225 to $235 at Overweight. Stock currently around $214</li>\n<li>Western Digital (WDC) target raised by Bank of America from $80 to $90 at Buy. Stock currently around $75</li>\n</ul>\n\n<p>““The secret of change is to focus all of your energy not on fighting the old, but on building the new” -Socrates</p>\n</div><!-- SC_ON -->",
  "score": 69,
  "permalink": "/r/stocks/comments/nlr7pv/here_is_a_market_recap_for_today_wednesday_may_26/",
  "subreddit": "stocks",
  "id": "nlr7pv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197389741
}