{
  "author": "everythingscost",
  "original_created_utc": 1629392204,
  "title": "How many steps are we from \"Apple will scan your icloud for the goverment for pictures\" to \"All phones will automatically scan for seed phrases and uploaded to the IRS for your protection\"",
  "created_utc": 1629397841,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The egregious overstepping of power these companies are taking on behalf of the government to override personal anatomy is quite shocking.</p>\n\n<p>what would i have to do to get a phone set up that isn&#39;t at risk to this sort of thing? how much power is enough for them?</p>\n\n<p>does apple already have the ability and they&#39;re just looking for permission?</p>\n\n<p>is google already doing this?</p>\n\n<p>&#x200B;</p>\n\n<p>edit: i don&#39;t mean from a picture i mean from them stealing your screen when you&#39;re writing down the phrase from the phone.</p>\n\n<p>the solution is to create the seed from a device that will never go online again i&#39;ve found</p>\n\n<p>but how do you get the money out in that case?</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/p7it4d/how_many_steps_are_we_from_apple_will_scan_your/",
  "subreddit": "CryptoCurrency",
  "id": "p7it4d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The egregious overstepping of power these companies are taking on behalf of the\ngovernment to override personal anatomy is quite shocking.\n\nwhat would i have to do to get a phone set up that isn't at risk to this sort of\nthing? how much power is enough for them?\n\ndoes apple already have the ability…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これらの企業が政府に代わって行っている、個人の身体的特徴を無視したひどい越権行為は非常に衝撃的です。\n政府に代わって個人の意思を無視していることには驚かされます。\n\nこのような危険性のない電話機を手に入れるためには、どうすればいいのでしょうか？\n彼らにとってどのくらいの力があれば十分なのでしょうか？\n\nアップルはすでにその能力を...",
      "title": "Appleがあなたのicloudをスキャンして写真を政府に提供する」から「すべての携帯電話が自動的にシードフレーズをスキャンしてIRSにアップロードしてあなたを保護する」まで、あと何段階あるでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这些公司代表政府采取了令人震惊的越权行为。\n政府凌驾于个人解剖学之上，令人震惊。\n\n我需要做什么才能得到一个不受这种风险影响的电话？\n对他们来说，多少权力才够？\n\n苹果是否已经有能力...",
      "title": "从 \"苹果将为政府扫描你的icloud图片 \"到 \"所有手机将自动扫描种子短语并上传到国税局以保护你\"，我们还有多少步？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這些公司代表政府採取了令人震驚的越權行爲。\n政府凌駕於個人解剖學之上，令人震驚。\n\n我需要做什麼才能得到一個不受這種風險影響的電話？\n對他們來說，多少權力纔夠？\n\n蘋果是否已經有能力...",
      "title": "從 \"蘋果將爲政府掃描你的icloud圖片 \"到 \"所有手機將自動掃描種子短語並上傳到國稅局以保護你\"，我們還有多少步？"
    }
  ]
}