{
  "author": "buddhist-truth",
  "the_new_excerpt": "Purpose fund traded $80 million worth of shares in first hour Volume is well\nabove typical first day for ETF in the U.S.\n\nThe Purpose Bitcoin ETF (ticker BTCC), which debuted in Toronto on Thursday,\ninvests directly in “physical/digital Bitcoin,” issuer Purpose Investments Inc.\nsaid in a statement.…",
  "original_created_utc": 1613665503,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "目的基金首小时成交价值8000万元的股票 成交量很好\n高于ETF在美国的典型首日表现。\n\n目的比特币ETF（代码BTCC），周四在多伦多首发。\n直接投资于 \"实物/数字比特币\"，发行人Purpose Investments Inc.\n在一份声明中表示....。",
      "title": "比特币ETF首秀狂飙，首小时交易额达8000万美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "目的基金首小時成交價值8000萬元的股票 成交量很好\n高於ETF在美國的典型首日表現。\n\n目的比特幣ETF（代碼BTCC），週四在多倫多首發。\n直接投資於 \"實物/數字比特幣\"，發行人Purpose Investments Inc.\n在一份聲明中表示....。",
      "title": "比特幣ETF首秀狂飆，首小時交易額達8000萬美元。"
    }
  ],
  "title": "Bitcoin ETF Roars in Debut With $80 Million of First-Hour Trades",
  "created_utc": 1613672983,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Purpose fund traded $80 million worth of shares in first hour Volume is well above typical first day for ETF in the U.S.</p>\n\n<p>The Purpose Bitcoin ETF (ticker BTCC), which debuted in Toronto on Thursday, invests directly in “physical/digital Bitcoin,” issuer Purpose Investments Inc. said in a statement. Its the first product ever for Bitcoin that’s officially labeled an exchange-traded fund, although Europe has several “physically backed” Bitcoin products that function like an ETF.</p>\n\n<p>While it’s unclear how much of the activity in BTCC will result in inflows for the fund, the trading volumes are well above an ETF’s typical first day, even in the much bigger U.S. market.</p>\n\n<p>Although too early to tell, ETF proponents argue that such a fund will trade without the massive premiums plaguing many current Bitcoin trusts in the U.S.</p>\n\n<p>The U.S. currently has several active filings for Bitcoin ETFs including ones from VanEck Associates Corp. and Bitwise Asset Management, but the price swings notorious in cryptocurrenies and allegations of industry manipulation remain hurdles to regulator approval.</p>\n</div><!-- SC_ON -->",
  "score": 599,
  "permalink": "/r/investing/comments/lmqjx4/bitcoin_etf_roars_in_debut_with_80_million_of/",
  "subreddit": "investing",
  "id": "lmqjx4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332881978
}