{
  "author": "Veridiyus",
  "original_created_utc": 1630146282,
  "title": "Solana flips Polkadot and claims nineth spot, also hits a new ATH of $90,03",
  "created_utc": 1630194023,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Solana has now flipped Polkadot to claim ninth spot on the Coin Marketcap crypto rankings and currently sits around $90 a coin. This is an increase of about 218% or more in the past six weeks. With the SEC getting involved and Pyth going live on Solanas network, it&#39;s not difficult to understand why the SOL/USD exchange rate has been going up.</p>\n\n<p>To be honest, I am glad it didn&#39;t shoot up over night and is instead building solid support over time. This is pretty exciting to watch and I personally feel like it&#39;s a good time to see new coins in the top 10. It&#39;s only a matter of time before Solana hits $100. </p>\n\n<p>Cheers to everyone who got in at $1 - $40, enjoy your profits. Cheers to everyone who realizes that it&#39;s still not too late and that there&#39;s more money to be made even at $90. Last but not least, cheers to everyone believing in its technology.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/pd7dgi/solana_flips_polkadot_and_claims_nineth_spot_also/",
  "subreddit": "CryptoCurrency",
  "id": "pd7dgi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Solana has now flipped Polkadot to claim ninth spot on the Coin Marketcap crypto\nrankings and currently sits around $90 a coin. This is an increase of about 218%\nor more in the past six weeks. With the SEC getting involved and Pyth going live\non Solanas network, it's not difficult to understand why…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ソラナは現在、Polkadotを反転させ、Coin Marketcapの暗号ランキングで9位を主張しています。\nランキングで9位となり、現在1コイン90ドル前後で推移しています。これは、過去6週間で約218％の増加\n以上も上昇しています。SECが関与し、PythがSolanasネットワークでライブを開始したことで\nソラナス・ネットワークでPythが稼働していることからも、その理由を理解するのは難しくありません。",
      "title": "SolanaはPolkadotをフリップして9位に入賞し、新たに$90,03のATHを獲得した。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Solana现在已经取代Polkadot，在Coin Marketcap加密货币排名中占据第九位。\n排名，目前位于每枚硬币90美元左右。这是在过去六周内增加了约218%的\n或在过去六周内更多。随着美国证券交易委员会的介入和Pyth在Solanas网络上的上线\n在Solanas网络上，这就不难理解为什么...",
      "title": "索拉纳翻转波尔卡多，获得第九名，同时还创下了90,03美元的新的最高价。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Solana現在已經取代Polkadot，在Coin Marketcap加密貨幣排名中佔據第九位。\n排名，目前位於每枚硬幣90美元左右。這是在過去六週內增加了約218%的\n或在過去六週內更多。隨着美國證券交易委員會的介入和Pyth在Solanas網絡上的上線\n在Solanas網絡上，這就不難理解爲什麼...",
      "title": "索拉納翻轉波爾卡多，獲得第九名，同時還創下了90,03美元的新的最高價。"
    }
  ]
}