{
  "author": "SweetPie123",
  "the_new_excerpt": "Just scrolling through CryptoMoonshots or SSB shows the scale the craze has\ntaken. New coins who are 1/1 copies of other meme shitcoins manage to raise\nmillions in just a matter of days, before everyone cashes out and moves to the\nnext one. Some get rugpulled (liquidity drained) or just seem to fade…",
  "original_created_utc": 1619011399,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "CryptoMoonshotsやSSBを見てみると、このブームの規模がよくわかります。\nとなっています。他のミームシットコインの1/1コピーである新しいコインは、わずか数日で数百万ドルを調達することができます。\nわずか数日で数百万ドルを集め、皆が現金化して次のコインに移る。\n次のコインに移る。あるものは、ラグプル（流動性の流出）されたり、ただ消えていくように見えたり...。",
      "title": "ICOブームよりもMemecoinブームの方が悪いと思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "只要滚动浏览一下CryptoMoonshots或SSB，就可以看到这一热潮的规模。\n的规模。新的硬币是其他纪念品狗屎硬币的1/1副本，在短短几天内就能筹集到数百万美元。\n在短短几天内筹集到数百万美元，然后每个人都兑现并转移到下一个\n下一个。有些人被拉走（流动性耗尽），或者似乎只是淡出......",
      "title": "Memecoin的热潮比ICO的热潮更糟糕，IMO。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "只要滾動瀏覽一下CryptoMoonshots或SSB，就可以看到這一熱潮的規模。\n的規模。新的硬幣是其他紀念品狗屎硬幣的1/1副本，在短短几天內就能籌集到數百萬美元。\n在短短几天內籌集到數百萬美元，然後每個人都兌現並轉移到下一個\n下一個。有些人被拉走（流動性耗盡），或者似乎只是淡出......",
      "title": "Memecoin的熱潮比ICO的熱潮更糟糕，IMO。"
    }
  ],
  "title": "The Memecoin Craze is worse than the ICO Craze IMO.",
  "created_utc": 1619030828,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just scrolling through CryptoMoonshots or SSB shows the scale the craze has taken. New coins who are 1/1 copies of other meme shitcoins manage to raise millions in just a matter of days, before everyone cashes out and moves to the next one. Some get rugpulled (liquidity drained) or just seem to fade into oblivion. </p>\n\n<p><strong>How it all works.</strong></p>\n\n<p>Some are stealing copyrighted content like PIKA (Pokemon) or Marvelcoin without even trying to hide this scummy behaviour. These devs will likely face a lawsuit, especially Nintendo &amp; Marvel hate the abuse of their brand names. Almost all these tokens are facilitated by the Binance Smart Chain, mostly because the low fees and the relative anonymity. On BSC coins can&#39;t be censored due to its decentralised nature (up to debate of course), meaning Binance can&#39;t stop it. What bothers me even more is these subreddits both facilitating the obvious PnD schemes, it&#39;s morally wrong imo. A lot of people will lose money, but they can&#39;t be bothered with proper moderation. </p>\n\n<p><strong>Greed.</strong></p>\n\n<p>These coins expose the worst aspect of human nature, greed. They shill these shitcoins everywhere because the earlier investors want to dump it on the next fool. Morals don&#39;t seem to matter anymore, they all want the next &#39;&#39;100x&#39;&#39; and they&#39;ll do anything to make it happen.</p>\n</div><!-- SC_ON -->",
  "score": 441,
  "permalink": "/r/CryptoCurrency/comments/mvfl2a/the_memecoin_craze_is_worse_than_the_ico_craze_imo/",
  "subreddit": "CryptoCurrency",
  "id": "mvfl2a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171523342
}