{
  "author": "hypocrite_deer",
  "the_new_excerpt": "I'm reading Mary Beard's The Fires of Vesuvius (my first Mary Beard book and I'm\nutterly captivated) and was interested to learn that most ordinary folks ate out\nat street shops. I'm sure we all saw those beautiful \"fast food\" shops that were\nrecently excavated at Pompeii! How did this wider…",
  "original_created_utc": 1619625674,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Mary BeardのThe Fires of Vesuviusを読んでいます（Mary Beardの本は初めてですが、すっかり魅了されました）。\n読んでいるのですが、一般庶民の食事は街角の店で食べていたことに興味を持ちました。\n露店で食事をしていたことを知りました。最近ポンペイで発掘された、あの美しい「ファーストフード」のお店を見たことがあります。\n最近ポンペイで発掘された美しいファストフード店を見たことがあります。どうしてこのような広い...",
      "title": "ローマの都市では、食事、入浴、髭剃りなど、私たちが個人的な家庭生活と考えていることの多くが公共の場で行われていました。このことは、文化的な共同体意識、家庭生活、個人のプライバシーなどにどのような影響を与えたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在读玛丽-比尔德的《维苏威火山》（我的第一本玛丽-比尔德的书，我被完全吸引了）。\n彻底被吸引住了），并有兴趣了解到大多数普通人都是在街边商店吃饭的。\n在街边小店。我相信我们都看到了最近在庞贝发掘的那些漂亮的 \"快餐店\"。\n最近在庞贝古城出土的那些美丽的 \"快餐 \"店! 这怎么会有这么广泛的...",
      "title": "在罗马城市，我们所认为的私人家庭生活的许多方面--吃饭、洗澡、刮胡子--都是在公共场合进行的。这对社区、家庭生活和个人隐私的文化感受有何影响？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在讀瑪麗-比爾德的《維蘇威火山》（我的第一本瑪麗-比爾德的書，我被完全吸引了）。\n徹底被吸引住了），並有興趣瞭解到大多數普通人都是在街邊商店喫飯的。\n在街邊小店。我相信我們都看到了最近在龐貝發掘的那些漂亮的 \"快餐店\"。\n最近在龐貝古城出土的那些美麗的 \"快餐 \"店! 這怎麼會有這麼廣泛的...",
      "title": "在羅馬城市，我們所認爲的私人家庭生活的許多方面--喫飯、洗澡、刮鬍子--都是在公共場合進行的。這對社區、家庭生活和個人隱私的文化感受有何影響？"
    }
  ],
  "title": "In Roman cities, so many aspects of what we think of as private home life - eating, bathing, shaving - were done in public. How did this impact cultural feelings of community, home life, and personal privacy?",
  "created_utc": 1619648793,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m reading Mary Beard&#39;s <em>The Fires of Vesuvius</em> (my first Mary Beard book and I&#39;m utterly captivated) and was interested to learn that most ordinary folks ate out at street shops. I&#39;m sure we all saw those beautiful &quot;fast food&quot; shops that were recently excavated at Pompeii! How did this wider phenomenon of doing things that we would take for granted as happening inside the home (cooking, bathing, eating) change cultural ideas of privacy? As modern people, would Roman notions of privacy vs public life seem strange to us?</p>\n</div><!-- SC_ON -->",
  "score": 113,
  "permalink": "/r/AskHistorians/comments/n0i3ci/in_roman_cities_so_many_aspects_of_what_we_think/",
  "subreddit": "AskHistorians",
  "id": "n0i3ci",
  "is_self": true,
  "media": null,
  "is_video": false
}