{
  "author": "YesterShill",
  "original_created_utc": 1642986962,
  "title": "For those who do not want the COVID vaccine - Would you accept a card giving you access to all facilities as the vaccinated if that card also was an attestation that you would not seek professional medical care if you become ill with COVID?",
  "created_utc": 1643002056,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The title kind of says it  all, but.&lt;/p&gt;\n\n&lt;p&gt;Right now certain facilities require proof of vaccination.   Would those who refuse the vaccine agree to be registered as &amp;quot;refusing the vaccine&amp;quot; if that meant they had the same access and privileges to locations and events as the vaccinated, if in exchange they agreed that they would not seek (and could be refused) professional medical services if they become ill with COVID-19?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 121,
  "permalink": "/r/TooAfraidToAsk/comments/sb9gf9/for_those_who_do_not_want_the_covid_vaccine_would/",
  "subreddit": "TooAfraidToAsk",
  "id": "sb9gf9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The title kind of says it all, but.\n\nRight now certain facilities require proof of vaccination. Would those who\nrefuse the vaccine agree to be registered as \"refusing the vaccine\" if that\nmeant they had the same access and privileges to locations and events as the\nvaccinated, if in exchange they…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルが全てを物語っているようなものですが。\n\n今現在、特定の施設ではワクチン接種の証明が必要です。という方はいらっしゃいますか？\nワクチンを拒否した場合、「ワクチン拒否者」として登録されることに同意する。\nと同じように、場所やイベントへのアクセスや特権を持つことを意味します。\nもし、その代わりに...",
      "title": "COVIDワクチンを希望しない方へ - COVIDに感染しても専門医の治療を受けないことを証明するカードがあれば、被接種者としてすべての施設を利用できるようになりますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题有点说明了一切，但是。\n\n现在，某些机构要求提供疫苗接种证明。那些拒绝接种疫苗的人是否同意被登记为\n拒绝接种疫苗的人是否同意被登记为 \"拒绝接种疫苗\"，如果这意味着他们可以获得与其他人一样的机会。\n意味着他们可以和接种疫苗的人一样，享有进入相关场所和参加相关活动的特权。\n如果作为交换，他们...",
      "title": "对于那些不愿意接种COVID疫苗的人来说--如果一张允许你作为接种者进入所有设施的卡片同时证明你在感染COVID后不会寻求专业医疗服务，你会接受吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題有點說明了一切，但是。\n\n現在，某些機構要求提供疫苗接種證明。那些拒絕接種疫苗的人是否同意被登記爲\n拒絕接種疫苗的人是否同意被登記爲 \"拒絕接種疫苗\"，如果這意味着他們可以獲得與其他人一樣的機會。\n意味着他們可以和接種疫苗的人一樣，享有進入相關場所和參加相關活動的特權。\n如果作爲交換，他們...",
      "title": "對於那些不願意接種COVID疫苗的人來說--如果一張允許你作爲接種者進入所有設施的卡片同時證明你在感染COVID後不會尋求專業醫療服務，你會接受嗎？"
    }
  ]
}