{
  "author": "soggypoopsock",
  "the_new_excerpt": "I get it, a famous person doing memes in our favor is fun. We all love the wolf\nof Wall Street movie. But let’s be real here.\n\nBelfort is the epitome of what we’re up against as retail. He’s a convicted con\nartist who actually did so much fucked up shit he didn’t just get a slap on\nwrist from the…",
  "original_created_utc": 1612224052,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我明白了，一个名人做对我们有利的备忘录很有趣。我们都喜欢狼\n的华尔街电影。但我们还是实事求是吧\n\n贝尔福特是我们零售业的缩影 Belfort is the epitome of what we're up against as retail. 他是个被定罪的骗子\n谁真正做了这么多的艺术家 性交了狗屎，他不只是一个巴掌上的\n腕部从...",
      "title": "请不要再宣传贝尔福特了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我明白了，一個名人做對我們有利的備忘錄很有趣。我們都喜歡狼\n的華爾街電影。但我們還是實事求是吧\n\n貝爾福特是我們零售業的縮影 Belfort is the epitome of what we're up against as retail. 他是個被定罪的騙子\n誰真正做了這麼多的藝術家 性交了狗屎，他不只是一個巴掌上的\n腕部從...",
      "title": "請不要再宣傳貝爾福特了"
    }
  ],
  "title": "Please stop promoting Belfort",
  "created_utc": 1612305204,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I get it, a famous person doing memes in our favor is fun. We all love the wolf of Wall Street movie. But let’s be real here. </p>\n\n<p>Belfort is the epitome of what we’re up against as retail. He’s a convicted con artist who actually did so much fucked up shit he didn’t just get a slap on wrist from the SEC, he actually went to prison. </p>\n\n<p>He was just anti-GME a few days ago, and now he’s meme-ing in its favor? A meme repeating the sentiments being echoed in this sub? </p>\n\n<p>It’s pretty clear to me. Belfort came to the realization that this is the next generation of decentralized hedge fund. There’s power when a bunch of apes all like the same stonk. He sees the popularity and realizes the potential and impact that crowd sourced DD will do. He knows communities like this will grow. And he wants to use you. </p>\n\n<p>this is nothing more than seedy opportunist bullshit because Belfort realizes you’re the exact type of person who makes him rich- a retard who yolos into risky investments at the idea of massive % gains. he wants to capitalize on the popularity of GME and this sub. He wants to sell you his shitty motivational book and the idea that he can teach you how you can be rich and famous with his “miNdSeT” when really he got rich by scamming people, and famous for being caught. </p>\n\n<p>Please. Stop. He is not your friend. I wouldn’t be surprised to see him try to leverage popularity gained here to a “trading community” of his own: </p>\n\n<blockquote>\n<p>“Belfort will share his favourite market sector in “Wolf Report” and give 10 lessons in “Wolf Mentality”, which includes tips on “what it takes to be a trader, how to handle emotions, the intangibles of success, how to take advantage of opportunities, and how to learn from your mistakes”.”</p>\n</blockquote>\n\n<p><a href=\"https://www.fnlondon.com/articles/wolf-of-wall-street-jordan-belfort-to-teach-tips-to-armchair-traders-in-new-tie-up-20200819\">https://www.fnlondon.com/articles/wolf-of-wall-street-jordan-belfort-to-teach-tips-to-armchair-traders-in-new-tie-up-20200819</a></p>\n\n<p>Yeah, how about you eat my stinky dick instead. I want nothing to do with this shit and this sub should not be strengthening any kind of association with criminals of the finance world.</p>\n</div><!-- SC_ON -->",
  "score": 44190,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/k898takB7px0418vIuNiA9vDmoUGC4wk7BT22Wp9zy4.jpg?auto=webp&s=460f931279fff8ab05d3351b01e1c6241ea216b7",
          "width": 749,
          "height": 499
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/k898takB7px0418vIuNiA9vDmoUGC4wk7BT22Wp9zy4.jpg?width=108&crop=smart&auto=webp&s=34b630b510b739e890002ef937e8b881850c9936",
            "width": 108,
            "height": 71
          },
          {
            "url": "https://external-preview.redd.it/k898takB7px0418vIuNiA9vDmoUGC4wk7BT22Wp9zy4.jpg?width=216&crop=smart&auto=webp&s=5eb49d0d2f93ae694c03b90e4d28a5d24fd54e46",
            "width": 216,
            "height": 143
          },
          {
            "url": "https://external-preview.redd.it/k898takB7px0418vIuNiA9vDmoUGC4wk7BT22Wp9zy4.jpg?width=320&crop=smart&auto=webp&s=2f754f5c5dcc6ae7a3f131fcf160f0da3444562a",
            "width": 320,
            "height": 213
          },
          {
            "url": "https://external-preview.redd.it/k898takB7px0418vIuNiA9vDmoUGC4wk7BT22Wp9zy4.jpg?width=640&crop=smart&auto=webp&s=e8b4b03f81c7042e1fd72f20c1c4c6c55826c1cc",
            "width": 640,
            "height": 426
          }
        ],
        "variants": {},
        "id": "Sq_pSX3kv-SQUo2M3a4gd-9SZy93-XdZctMUe2bBrkQ"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/wallstreetbets/comments/lai796/please_stop_promoting_belfort/",
  "subreddit": "wallstreetbets",
  "id": "lai796",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518561499
}