{
  "author": "Miamime",
  "the_new_excerpt": "> Paul Morina, the principal of Paulsboro, New Jersey, High School, is listed in\n> financial records as the president, CEO, CFO and more at a Nevada-incorporated\n> company whose stock is trading at levels that give it a valuation more than\n> $100 million.\n> \n> That’s an oddly high valuation because…",
  "original_created_utc": 1618601082,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "> ニュージャージー州ポールスボロ高校の校長であるポール・モリナは、ネバダ州の法人の社長、CEO、CFOなどとして財務記録に記載されています。\n> ポール・モリナは、ネバダ州で法人化された会社の社長、CEO、CFOなどとして財務記録に記載されています。\n> その会社の株式は、1億ドル以上の評価額で取引されている。\n> 億ドル\n> \n> 妙に高い評価なのは...",
      "title": "ニュージャージー州の高校レスリング部のコーチが、1つのデリを所有する1億ドル規模の会社のCEOを務める"
    },
    {
      "locale": "zh",
      "the_new_excerpt": ">保罗-莫里纳，新泽西州保尔斯伯勒高中的校长，被列入了《新泽西州保尔斯伯勒高中》。\n> 在内华达州的一家公司担任总裁、CEO、CFO等财务记录。\n>公司的股票交易水平，使其估值超过了预期。\n> 1亿美元。\n> \n> 这个估值奇高，因为... ...",
      "title": "新泽西州一名高中摔跤教练是1亿美元公司的CEO，拥有一家熟食店。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": ">保羅-莫里納，新澤西州保爾斯伯勒高中的校長，被列入了《新澤西州保爾斯伯勒高中》。\n> 在內華達州的一家公司擔任總裁、CEO、CFO等財務記錄。\n>公司的股票交易水平，使其估值超過了預期。\n> 1億美元。\n> \n> 這個估值奇高，因爲... ...",
      "title": "新澤西州一名高中摔跤教練是1億美元公司的CEO，擁有一家熟食店。"
    }
  ],
  "title": "A New Jersey high school wrestling coach is CEO of $100 million firm that owns one deli",
  "created_utc": 1618604781,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p>Paul Morina, the principal of Paulsboro, New Jersey, High School, is listed in financial records as the president, CEO, CFO and more at a Nevada-incorporated company whose stock is trading at levels that give it a valuation more than $100 million.</p>\n\n<p>That’s an oddly high valuation because the company, Hometown International, owns a delicatessen — and only one small delicatessen — in Paulsboro, where the Morina-coached high school wrestling team frequently wins state championships. The company has disclosed that it has shareholders based in China’s Macau territory.</p>\n\n<p>The shop, Your Hometown Deli, did just $35,000 in sales — combined — over the past two years, according to Hometown International’s annual report, filed March 26 with the Securities and Exchange Commission.</p>\n</blockquote>\n\n<p><a href=\"https://www.cnbc.com/2021/04/15/hometown-international-nj-deli-owner-worth-millions-in-stock.html\">https://www.cnbc.com/2021/04/15/hometown-international-nj-deli-owner-worth-millions-in-stock.html</a></p>\n</div><!-- SC_ON -->",
  "score": 3723,
  "permalink": "/r/investing/comments/msahly/a_new_jersey_high_school_wrestling_coach_is_ceo/",
  "subreddit": "investing",
  "id": "msahly",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171524768
}