{
  "author": "Brinothedino",
  "original_created_utc": 1628955761,
  "title": "I thought I was \"too late\" when I first bought Crypto THIS YEAR. I got ADA for $0.18, XLM for $0.135, and ETH for $750. That seems insane now.",
  "created_utc": 1628969436,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It can be daunting to buy Crypto when it seems like it&#39;s already surged, I was looking at charts back in January that had months of growth and I was so nervous I was buying the top. TBH this sub is what convinced me there was still a way to go and once I saw green I started to FOMO a bit more.</p>\n\n<p>But my point is, look at us now! Don&#39;t let anyone tell you it&#39;s &quot;too late&quot; to start investing in your future. At least not this early in the game.</p>\n</div><!-- SC_ON -->",
  "score": 229,
  "permalink": "/r/CryptoCurrency/comments/p4abwa/i_thought_i_was_too_late_when_i_first_bought/",
  "subreddit": "CryptoCurrency",
  "id": "p4abwa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It can be daunting to buy Crypto when it seems like it's already surged, I was\nlooking at charts back in January that had months of growth and I was so nervous\nI was buying the top. TBH this sub is what convinced me there was still a way to\ngo and once I saw green I started to FOMO a bit more.\n\nBut…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号がすでに高騰しているようなときに購入するのは大変なことです。\n私は1月に、何ヶ月も成長しているチャートを見て、トップを買っているのではないかと不安になりました。\n頂点を買っていました。正直なところ、今回の下落でまだ先があると確信しました。\n緑を見たときには、もうちょっと気になりました。\n\nでも・・・。",
      "title": "今年初めてCryptoを買ったときは「遅すぎた」と思った。ADAを0.18ドル、XLMを0.135ドル、ETHを750ドルで購入しました。今となっては正気の沙汰とは思えません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当加密货币似乎已经飙升时，购买它可能是令人生畏的。\n我在一月份看了有几个月增长的图表，我非常紧张\n我在买入顶部。这一次是让我相信仍有一段路要走的原因。\n一旦我看到绿色，我就开始有点担心了。\n\n但是...",
      "title": "当我今年第一次购买加密货币时，我认为我 \"太晚了\"。我以0.18美元买了ADA，0.135美元买了XLM，750美元买了ETH。这在现在看来是很疯狂的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當加密貨幣似乎已經飆升時，購買它可能是令人生畏的。\n我在一月份看了有幾個月增長的圖表，我非常緊張\n我在買入頂部。這一次是讓我相信仍有一段路要走的原因。\n一旦我看到綠色，我就開始有點擔心了。\n\n但是...",
      "title": "當我今年第一次購買加密貨幣時，我認爲我 \"太晚了\"。我以0.18美元買了ADA，0.135美元買了XLM，750美元買了ETH。這在現在看來是很瘋狂的。"
    }
  ]
}