{
  "author": "gnomeweb",
  "original_created_utc": 1640779295,
  "title": "How does my brain understand where pain is spatially located?",
  "created_utc": 1640797303,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi,&lt;/p&gt;\n\n&lt;p&gt;I understand the basics of how pain and nervous system work: when something bad happens, our nerves fire pain signals. However, the thing that eludes me is: how does brain know where the pain is &lt;strong&gt;spatially located&lt;/strong&gt;? For example, when my stomach hurts, I usually can point at the location of the pain, I can feel in what part of stomach the pain is localized. As far as I understand and my basic logic tells me, the brain needs to know where certain nerve endings are located spatially, the mapping of nerves and organs and the mapping of organs and their locations in my body. Does the brain learn the mapping when we grow up? Or is there another way of localizing of pain? How does the brain know where, e.g., my stomach is located spatially in my body?&lt;/p&gt;\n\n&lt;p&gt;I honestly tried googling, but can&amp;#39;t seem to find anything remotely helpful. Maybe someone can point me in the right direction what I can read about to understand the answer to my question (e.g., how is this phenomena called)?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 115,
  "permalink": "/r/askscience/comments/rr6mt4/how_does_my_brain_understand_where_pain_is/",
  "subreddit": "askscience",
  "id": "rr6mt4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi,\n\nI understand the basics of how pain and nervous system work: when something bad\nhappens, our nerves fire pain signals. However, the thing that eludes me is: how\ndoes brain know where the pain is spatially located? For example, when my\nstomach hurts, I usually can point at the location of the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。\n\n痛みと神経系の基本的な仕組みは理解している：何か悪いことがあったとき\n神経は痛みのシグナルを発しています。しかし、私が理解できないのは、どのようにして\n脳は、痛みの空間的な位置を把握しているのでしょうか？例えば、私の場合\nお腹が痛いとき、私はたいていその場所を指差すことができます。",
      "title": "私の脳は、痛みの空間的な位置をどのように理解しているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好。\n\n我了解疼痛和神经系统工作的基本原理：当一些不好的事情\n发生时，我们的神经会发出疼痛信号。然而，我不明白的是：大脑如何知道疼痛的空间位置？\n大脑是如何知道疼痛的空间位置的？比如说，当我的\n肚子疼的时候，我通常可以指出疼痛的位置。",
      "title": "我的大脑如何理解疼痛在空间上的位置？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好。\n\n我瞭解疼痛和神經系統工作的基本原理：當一些不好的事情\n發生時，我們的神經會發出疼痛信號。然而，我不明白的是：大腦如何知道疼痛的空間位置？\n大腦是如何知道疼痛的空間位置的？比如說，當我的\n肚子疼的時候，我通常可以指出疼痛的位置。",
      "title": "我的大腦如何理解疼痛在空間上的位置？"
    }
  ]
}