{
  "author": "Blairvvitchproject",
  "original_created_utc": 1634418279,
  "title": "Is there a support group for daughters with hot moms?",
  "created_utc": 1634453324,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As much as I think my own title is hilarious, I’m genuinely curious if there is a Reddit group dedicated to this that isn’t just MILF porn.</p>\n\n<p>All my life I’ve been relegated as “the ugly sister” or an unfortunate experiment of genetics, especially dictated by peers of my own age. People can’t seem to wrap their heads around how THAT (my mom) could produce THAT (me). </p>\n\n<p>Now that I’m older it doesn’t affect me as negatively as it did when I was a kid but I’ve recently moved to the same town as my mother and all this comparison bullshit is hitting me in waves from the small town locals who’s standards of beauty is vastly different to what I’ve become accustomed to in other places. It’s honestly tiring and there’s no one here that can relate to me on this subject.</p>\n\n<p>So, is there a Reddit support group dedicated to the unfortunate daughters of hot moms?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/q9kl78/is_there_a_support_group_for_daughters_with_hot/",
  "subreddit": "NoStupidQuestions",
  "id": "q9kl78",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As much as I think my own title is hilarious, I’m genuinely curious if there is\na Reddit group dedicated to this that isn’t just MILF porn.\n\nAll my life I’ve been relegated as “the ugly sister” or an unfortunate\nexperiment of genetics, especially dictated by peers of my own age. People can’t\nseem to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自分のタイトルが面白いと思うのはもちろんですが、純粋に興味があるのは、MILFポルノだけでなく、これに特化したRedditグループがあるかどうかです。\nこれに特化したRedditのグループがあるかどうか、純粋に興味があります。\n\n私はこれまでずっと、「醜い妹」や「不幸な遺伝の実験台」として追いやられてきました。\n遺伝の実験台にされてきましたが、特に同年代の仲間からは 人々は\n思わず...",
      "title": "ホットなママを持つ娘たちのサポートグループはありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "虽然我认为我自己的标题很搞笑，但我真的很好奇是否有\n一个专门讨论这个问题的Reddit小组，而不仅仅是MILF色情。\n\n在我的一生中，我一直被贬为 \"丑陋的妹妹 \"或不幸的\n特别是在我的同龄人中。人们不能\n似乎...",
      "title": "有没有为有辣妈的女儿设立的支持小组？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "雖然我認爲我自己的標題很搞笑，但我真的很好奇是否有\n一個專門討論這個問題的Reddit小組，而不僅僅是MILF色情。\n\n在我的一生中，我一直被貶爲 \"醜陋的妹妹 \"或不幸的\n特別是在我的同齡人中。人們不能\n似乎...",
      "title": "有沒有爲有辣媽的女兒設立的支持小組？"
    }
  ]
}