{
  "author": "northwesternsamurai",
  "original_created_utc": 1629215581,
  "title": "I think we will be the last to say “we got in early”.",
  "created_utc": 1629248265,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think we are the last of the early adopters. Honestly with the amount of institutional investment and mainstream adoption happening it feels like we are on the cusp of crypto becoming the norm in the next 5-10 years. What I believe this means is that the next group of adopters after us will experience mellower gains and a more stable market. This means that we may be the last to witness the Wild West of crypto. </p>\n\n<p>We are in the good old days. </p>\n\n<p>HODL like crazy folks.</p>\n\n<p>Congratulations.</p>\n\n<p>EDIT: <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/p66422/we_are_in_the_tail_end_of_the_early_adopter/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\">Some actual stats</a></p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/p66kt6/i_think_we_will_be_the_last_to_say_we_got_in_early/",
  "subreddit": "CryptoCurrency",
  "id": "p66kt6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I think we are the last of the early adopters. Honestly with the amount of\ninstitutional investment and mainstream adoption happening it feels like we are\non the cusp of crypto becoming the norm in the next 5-10 years. What I believe\nthis means is that the next group of adopters after us will…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちはアーリーアダプターの最後の一人だと思います。正直なところ、このような大量の\n機関投資や主流の採用が行われていることから、私たちは、暗号が一般的なものになるための\n今後5年から10年の間に、暗号が一般的なものになるのではないかと考えています。私が思うに\nこれが意味するところは、我々の次の採用者グループは...",
      "title": "早めに入った」と言うのは、私たちが最後になると思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为我们是早期采用者中的最后一批。坦率地说，随着机构投资和主流采用的数量的增加，感觉我们是最后一个早期采用者。\n机构投资和主流采用的数量，感觉我们正处于未来5-10年加密货币成为常态的边缘。\n在未来5-10年内，加密货币将成为常态的风口浪尖。我相信\n这意味着，在我们之后的下一批采用者将...",
      "title": "我想我们将是最后一个说 \"我们提前进入了 \"的人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲我們是早期採用者中的最後一批。坦率地說，隨着機構投資和主流採用的數量的增加，感覺我們是最後一個早期採用者。\n機構投資和主流採用的數量，感覺我們正處於未來5-10年加密貨幣成爲常態的邊緣。\n在未來5-10年內，加密貨幣將成爲常態的風口浪尖。我相信\n這意味着，在我們之後的下一批採用者將...",
      "title": "我想我們將是最後一個說 \"我們提前進入了 \"的人。"
    }
  ]
}