{
  "author": "bookman63",
  "the_new_excerpt": "Seriously I know you guys are retarded but as has been stated before countless\ntimes there is no “WE”, “US”, “UNITE”, “ORGANIZE” ....... etc. WE JUST LIKE THE\nSTOCK. I know you probably only have two brain cells in that smooth brain but\nrub then together and imagine the possibility this may be a…",
  "original_created_utc": 1615114150,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "说真的，我知道你们是弱智，但正如之前无数次说过的那样。\n时代没有 \"我们\"、\"美国\"、\"团结\"、\"组织\"....... 等。我们就像\n库存。我知道你可能只有两个脑细胞 在那光滑的大脑，但。\n揉在一起，想象这可能是一个... ...",
      "title": "請願禁止任何暗示集體意識的帖子"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說真的，我知道你們是弱智，但正如之前無數次說過的那樣。\n時代沒有 \"我們\"、\"美國\"、\"團結\"、\"組織\"....... 等。我們就像\n庫存。我知道你可能只有兩個腦細胞 在那光滑的大腦，但。\n揉在一起，想象這可能是一個... ...",
      "title": "請願禁止任何暗示集體意識的帖子"
    }
  ],
  "title": "Petition to ban any post hinting at a collective hive mind",
  "created_utc": 1615130826,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Seriously I know you guys are retarded but as has been stated before countless times there is no “WE”, “US”, “UNITE”, “ORGANIZE” ....... etc. WE JUST LIKE THE STOCK. I know you probably only have two brain cells in that smooth brain but rub then together and imagine the possibility this may be a setup by the fuckers we’re fucking to not only nuke this sub, but also place serious restrictions on trading. My gut feeling? The commies from <a href=\"/r/all\">r/all</a> got bored of arguing over their little gangs and brought that garbage horseshit propaganda to the sub. We are here to make MONIES and squeeze Melvin’s nuts so tight their cum evaporates in our palms. We are not here to destroy the financial system that WE benefit from. In conclusion, stfu.</p>\n\n<p>edit: mods if and wen u wake up and decide to delete me post pls don’t ban me. this sub is me only sustenance and source of entertainment.</p>\n\n<p>edit2: looks like the commies found the post. almost guaranteed mods taking this down soon.</p>\n\n<p>edit3: is the royal we, not the collective we. therefore i like the stock.</p>\n\n<p>edit4: maybe am retarded</p>\n</div><!-- SC_ON -->",
  "score": 7668,
  "permalink": "/r/wallstreetbets/comments/lzobms/petition_to_ban_any_post_hinting_at_a_collective/",
  "subreddit": "wallstreetbets",
  "id": "lzobms",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542583501
}