{
  "author": "PossessionOne4444",
  "original_created_utc": 1654543918,
  "title": "Why do people get so triggered by a person asking their significant other to lose weight ?",
  "created_utc": 1654570574,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I see so many posts where someone talks about how their significant other asked them to lose weight  because they do not find their partner attractive with the extra weight on and all the comments are like &amp;quot;lose him/her&amp;quot; or &amp;quot;dump that piece of shit&amp;quot; &amp;quot;go find a person who will love you no matter what&amp;quot; etc&lt;/p&gt;\n\n&lt;p&gt;My parents have been married for 26 years, and they routinely tell each other to lose weight and make sure they hold each other accountable when one gets out of shape. At 60 they are both very healthy and fit and able to enjoy so much, and it is because of how they have cared for each other and held each other accountable. &lt;/p&gt;\n\n&lt;p&gt;I feel like a partner who says &amp;quot;no matter what you eat and no matter how much weight you gain, no problem, i will always support you and love you&amp;quot; is an enabler. Someone who cares will tell you the bitter and uncomfortable truth and will make sure you remain healthy. Plus, being in good shape is important for a good sex life and to remain attractive for your partner for as long as possible, on top of health.  &lt;/p&gt;\n\n&lt;p&gt;I really do not understand why so many people get so triggered by this and why it is considered terrible to ask your spouse to lose weight and stay in shape.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 207,
  "permalink": "/r/TooAfraidToAsk/comments/v6bk8f/why_do_people_get_so_triggered_by_a_person_asking/",
  "subreddit": "TooAfraidToAsk",
  "id": "v6bk8f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I see so many posts where someone talks about how their significant other asked\nthem to lose weight because they do not find their partner attractive with the\nextra weight on and all the comments are like \"lose him/her\" or \"dump that piece\nof shit\" \"go find a person who will love you no matter…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、誰かが彼らの重要な他が尋ねた方法について話すので、多くの記事を参照してください。\nという投稿をよく見かけますが、その理由は、余分な体重があると相手に魅力を感じないからです。\nという投稿をよく見かけますが、そのコメント欄には、「相手を捨てろ」、「そのクズを捨て\nというようなコメントばかりで、「そんなの捨てちまえ」「愛してくれる人を見つけに行け...",
      "title": "なぜ人は、自分の大切な人にダイエットを勧めることに、そんなに心を動かされるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到很多帖子，其中有人谈到他们的重要伴侣如何要求\n他们要减肥，因为他们不认为他们的伴侣有吸引力的额外的重量。\n所有的评论都像 \"失去他/她 \"或 \"甩掉那块\n所有的评论都是 \"甩掉他/她 \"或 \"甩掉那块狗屎\"\"去找一个无论如何都会爱你的人\"。",
      "title": "为什么人们会因为一个人要求其重要的另一半减肥而变得如此激动？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到很多帖子，其中有人談到他們的重要伴侶如何要求\n他們要減肥，因爲他們不認爲他們的伴侶有吸引力的額外的重量。\n所有的評論都像 \"失去他/她 \"或 \"甩掉那塊\n所有的評論都是 \"甩掉他/她 \"或 \"甩掉那塊狗屎\"\"去找一個無論如何都會愛你的人\"。",
      "title": "爲什麼人們會因爲一個人要求其重要的另一半減肥而變得如此激動？"
    }
  ]
}