{
  "author": "zombiehog",
  "original_created_utc": 1639340741,
  "title": "Without naming the crypto, describe a coin and we will take a guess.",
  "created_utc": 1639370763,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I figure that we needed a positive post here amidst the sea of red, Christmas should be a joyous time of happy red and green, not this near bear market of solid red.&lt;/p&gt;\n\n&lt;p&gt;This can be a fun game to test our collective crypto knowledge, and a welcome distraction from all the negativity surrounding this sub in the recent past. &lt;/p&gt;\n\n&lt;p&gt;Post a comment that contains a description of a coin, but don&amp;#39;t name the coin, and we all have to guess. &lt;/p&gt;\n\n&lt;p&gt;Dig past the top 10 coins so we can really get some obscure crypto, really will be a test of our collective knowledge!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/rexgp7/without_naming_the_crypto_describe_a_coin_and_we/",
  "subreddit": "CryptoCurrency",
  "id": "rexgp7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I figure that we needed a positive post here amidst the sea of red, Christmas\nshould be a joyous time of happy red and green, not this near bear market of\nsolid red.\n\nThis can be a fun game to test our collective crypto knowledge, and a welcome\ndistraction from all the negativity surrounding this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "赤の海の中で、ポジティブな投稿が必要だと思いました。\n赤と緑の楽しい時間であるべきで、この弱気相場に近い状態ではない。\n赤一色。\n\nこれは、暗号の知識を試す楽しいゲームになりますし、歓迎すべきことです。\nこのネガティブな状況からの気晴らしに...。",
      "title": "クリプトの名前を挙げずに、コインの説明をしてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想，在红色的海洋中，我们需要一个积极的帖子，圣诞\n圣诞节应该是一个充满红色和绿色的欢乐时光，而不是这个接近熊市的\n坚实的红色。\n\n这可能是一个有趣的游戏，以测试我们的集体加密货币知识，也是一个受欢迎的\n从所有围绕这个问题的负面情绪中转移注意力......",
      "title": "在不指明加密货币的情况下，描述一个硬币，我们将进行猜测。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想，在紅色的海洋中，我們需要一個積極的帖子，聖誕\n聖誕節應該是一個充滿紅色和綠色的歡樂時光，而不是這個接近熊市的\n堅實的紅色。\n\n這可能是一個有趣的遊戲，以測試我們的集體加密貨幣知識，也是一個受歡迎的\n從所有圍繞這個問題的負面情緒中轉移注意力......",
      "title": "在不指明加密貨幣的情況下，描述一個硬幣，我們將進行猜測。"
    }
  ]
}