{
  "author": "Deadalive26",
  "original_created_utc": 1625973837,
  "title": "I have been secretly sending my best friend $15 a week in bitcoin.",
  "created_utc": 1625985802,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My best friend is the one that turned me on to crypto several months ago but he gave up on crypto after he sold all of his doge at .08 because he needed the money to pay his bills and just survive. I have this irrational fear that one day I will feel shitty if by some miracle I make a decent amount  of money off crypto and he doesn’t make anything. Also he’s been struggling a lot so hopefully one day this will become a worthwhile amount of money that he can find helpful. It’s not a difficult amount of money for me to dismiss so I just send it to his wallet knowing he doesn’t check it. I don’t know why I’m sharing this, maybe it’s a stupid idea. Anyway, that’s what I’m doing and will continue to do.</p>\n\n<p>Edit: changed .8 to .08 because that’s what I meant to say.</p>\n\n<p>Edit 2: I know he still has his keys because he had $50 in btc he planned to never sell. As far as fees go, I send $30-60 at a time and it’s really not that bad especially right now. I am falling asleep but thank you for everyone’s kind words.</p>\n</div><!-- SC_ON -->",
  "score": 938,
  "permalink": "/r/CryptoCurrency/comments/ohww76/i_have_been_secretly_sending_my_best_friend_15_a/",
  "subreddit": "CryptoCurrency",
  "id": "ohww76",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My best friend is the one that turned me on to crypto several months ago but he\ngave up on crypto after he sold all of his doge at .08 because he needed the\nmoney to pay his bills and just survive. I have this irrational fear that one\nday I will feel shitty if by some miracle I make a decent amount…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数ヶ月前に私にcryptoを教えてくれたのは私の親友ですが、彼はcryptoを諦めました。\nのお金が必要だったので、0.08ですべてのdogeを売った後、暗号化をあきらめました。\n生きていくためのお金が必要だったからです。私には、ある日突然、自分が\n奇跡的にまともな金額を稼げたとしても、自分が嫌な気分になるのではないかと...。",
      "title": "親友に週に15ドルをビットコインで密かに送っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几个月前，是我最好的朋友让我接触到了加密货币，但他在0.0的价格卖掉了他所有的Doge之后，就放弃了加密货币。\n在他以0.08美元的价格卖掉了他所有的Doge之后，他放弃了加密货币，因为他需要这些钱来支付账单和生存。\n因为他需要钱来支付他的账单，只是为了生存。我有这种非理性的恐惧，如果有一天\n如果有一天我奇迹般地赚了一笔钱，我就会觉得很糟糕......",
      "title": "我一直在秘密地给我最好的朋友每周发送15美元的比特币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾個月前，是我最好的朋友讓我接觸到了加密貨幣，但他在0.0的價格賣掉了他所有的Doge之後，就放棄了加密貨幣。\n在他以0.08美元的價格賣掉了他所有的Doge之後，他放棄了加密貨幣，因爲他需要這些錢來支付賬單和生存。\n因爲他需要錢來支付他的賬單，只是爲了生存。我有這種非理性的恐懼，如果有一天\n如果有一天我奇蹟般地賺了一筆錢，我就會覺得很糟糕......",
      "title": "我一直在祕密地給我最好的朋友每週發送15美元的比特幣。"
    }
  ]
}