{
  "author": "VogMicro",
  "the_new_excerpt": "Hello,\n\nLong story short, 25 male, I had an autoimmune disease which basically\ncompletely fucked up 6 years of my life which I've lost. I have spent an almost\ninifinite amount of hours in my bed struggling with pain, systemic infections,\nand depression. My only escape was listening music thinking…",
  "original_created_utc": 1610903403,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你好啊\n\n长话短说，25岁的男性，我得了一种自身免疫性疾病，基本上是\n完全搞砸了6年的生活，我已经失去了。我已经花了几乎\n在我的床上挣扎了无限的时间 疼痛，全身感染，\n和抑郁症。我唯一的逃避就是听着音乐想着... ...",
      "title": "25岁如何白手起家？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好啊\n\n長話短說，25歲的男性，我得了一種自身免疫性疾病，基本上是\n完全搞砸了6年的生活，我已經失去了。我已經花了幾乎\n在我的牀上掙扎了無限的時間 疼痛，全身感染，\n和抑鬱症。我唯一的逃避就是聽着音樂想着... ...",
      "title": "25歲如何白手起家？"
    }
  ],
  "title": "How to start from nothing at all at 25?",
  "created_utc": 1610912054,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello,</p>\n\n<p>Long story short, 25 male, I had an autoimmune disease which basically completely fucked up 6 years of my life which I&#39;ve lost. I have spent an almost inifinite amount of hours in my bed struggling with pain, systemic infections, and depression. My only escape was listening music thinking &quot;this too shall pass&quot;.</p>\n\n<p>I&#39;m finally about cured now at 25 (haven&#39;t had issues in 4 months for the first time) but I can&#39;t get disability help here because I&#39;m cured.</p>\n\n<p>I never never had any job, I don&#39;t have skills nor experience, nor friends, nor driver&#39;s license. I have completed one year of college in engineering (chemical) with satisfying results before I got ill. I had good grades in high school. I failed 3 times my 2nd year of engineering school because I was too fucking sick (and I really was, was in hospital for 6 months on the first year) so in my country they won&#39;t allow me to apply again even though I have proofs I was seriously sick.</p>\n\n<p>I have a bit of inheritance money (20k$) on which I&#39;m living at the moment. I can&#39;t get governmental help anymore because of being too old.</p>\n\n<p>I wished to become an engineer but it feels like it&#39;s too late and when I am at the schools won&#39;t take me anymore because of age limit at 25 so maybe I could consider moving abroad if I spoke the language. Ageism is known to be strong here and I can&#39;t find success story of anyone entering a job at more than 30 which would be the age I could complete a degree by.</p>\n\n<p>I have applied to some entry level jobs (50+ resume sent) but I&#39;m getting discarded every time. Never got an interview. Basically here the government will fund entry level jobs for people under 25 so you needed to start before that.</p>\n\n<p>I&#39;d like to do something interesting with my life and not be stuck with entry level jobs forever.</p>\n\n<p>I can learn a language if needed. I speak Spanish and English.</p>\n\n<p>Where do I start ? Do you know any country that would be welcoming and without massive ageism ? Any job or sector which would be welcoming?</p>\n\n<p>&#x200B;</p>\n\n<p>Note : I hate anything IT, I tried to get into it some months ago as I was getting better, but I really hate that.</p>\n</div><!-- SC_ON -->",
  "score": 130,
  "permalink": "/r/NoStupidQuestions/comments/kza9k6/how_to_start_from_nothing_at_all_at_25/",
  "subreddit": "NoStupidQuestions",
  "id": "kza9k6",
  "is_self": true,
  "media": null,
  "is_video": false
}