{
  "author": "Georgy_K_Zhukov",
  "original_created_utc": 1633540464,
  "title": "Want to be the height of fashion? AskHistorians is participating in a swag store pilot program for reddit, so here is your chance.",
  "created_utc": 1633575246,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>TL;DR: <a href=\"https://www.teepublic.com/stores/shopraskhistorians\">Click Here to Check It Out</a></h1>\n\n<p><strong>What&#39;s Happening</strong></p>\n\n<p>We agreed to assist the admins in piloting a new program which would allow users to get their hands on community themed swag. We&#39;ve provided AskHistorians swag as prizes for year-end awards for many years now, as well as offered swag as part of fundraising efforts for our digital conference (<a href=\"https://www.askhistorians.com/2021-digital-conference\">less than two weeks away</a>!!), so we were in a good position to help with this endeavor, both having a fair bit of experience with designing such things and knowing that there is interest within the community for AskHistorians swag.</p>\n\n<p><strong>Where Do I Get the Stuff?</strong></p>\n\n<p>The trial program is being done through the site Teepublic. <a href=\"https://www.teepublic.com/stores/shopraskhistorians\"><strong>CLICK HERE TO GO TO THE STOREFRONT</strong></a></p>\n\n<p><strong>What Can I Get?</strong></p>\n\n<p><a href=\"https://www.teepublic.com/stores/shopraskhistorians/t-shirts?ref_id=24610\">T-shirts</a>, <a href=\"https://www.teepublic.com/stores/shopraskhistorians/stickers?ref_id=24610\">stickers</a>, <a href=\"https://www.teepublic.com/stores/shopraskhistorians/mug?ref_id=24610\">mugs</a>, <a href=\"https://www.teepublic.com/stores/shopraskhistorians/totes?ref_id=24610\">totes</a>, <a href=\"https://www.teepublic.com/stores/shopraskhistorians/pins?ref_id=24610\">buttons</a>, <a href=\"https://www.teepublic.com/stores/shopraskhistorians/notebook?ref_id=24610\">notebooks</a>, and <a href=\"https://www.teepublic.com/stores/shopraskhistorians/hoodie?ref_id=24610\">hoodies</a> are what there is. Each is available in the five Historical Snoo designs that we are using for this project.</p>\n\n<p><strong>Why Did You Choose Those Snoos For This?</strong></p>\n\n<p>We have twenty different &#39;New&#39; styled Snoos in our collection, not to mention over thirty in the &#39;old&#39; style! But for the pilot program, we&#39;re limited to five designs. <em>If</em> the feedback on this is positive and we&#39;re happy with the results <em>and</em> the program expands and continues, we&#39;d like to be able to offer all of the Snoos, since we know everyone has their favorites. But for now, we chose five Snoos intended to a decent variety of places and interests, although it of course pretty hard to have anything <em>close</em> to broad coverage with that number (and also, Snoopata is my favorite, so....).</p>\n\n<p>If you want to learn more about the Snoos currently featured, check out the Snoographies we wrote up when debuting them!</p>\n\n<ul>\n<li><a href=\"https://www.reddit.com/r/AskHistorians/comments/odjzx0/new_snoo_sunday_introducing_pauli_snoorray_the/h40pyo3/\">Emiliano Snoopata</a></li>\n<li><a href=\"https://www.reddit.com/r/AskHistorians/comments/o452qh/new_snoo_sunday_introducing_viola_snoomond_snoose/h2fbqun/\">Jane Snoosten</a></li>\n<li><a href=\"https://www.reddit.com/r/AskHistorians/comments/o8wjrh/new_snoo_sunday_introducing_snoorodotus_snoo/h3813ot/\">Frederick Snoouglass</a></li>\n<li><a href=\"https://www.reddit.com/r/AskHistorians/comments/oi3tvr/new_snoo_sunday_introducing_salote_tupsnoo_iii/h4u3t4r/\">Señor de Snoopán</a></li>\n<li><a href=\"https://www.reddit.com/r/AskHistorians/comments/oi3tvr/new_snoo_sunday_introducing_salote_tupsnoo_iii/h4t3vz5/\">Empress Snooditu</a></li>\n</ul>\n\n<p><strong>So... the Money...?</strong></p>\n\n<p>Much as we wish we could offer them as such, we can&#39;t hand them out for free. The point of sale is all handled by Teepublic, and the profits generated go through reddit. From there, the funds are made available to the mod team to distribute <em>specifically</em> in ways to support the community. We aren&#39;t the only subreddit piloting this, so I don&#39;t know how other communities intend to use those funds, but as in past years, we&#39;d be using funds raised for prizes to send to the winners of the year end awards, send &quot;Thank You&quot; gifts to AMA and Podcast guests and fund promotion of the subreddit (We had a super cool plan in the beginning of 2019 to promote participation in AskHistorians at history conferences which.... yeah. That didn&#39;t happen. But we hope to be able to restart that in 2022! Stay tuned!)</p>\n\n<p><strong>Hey, What About the Conference Fundrazr?</strong></p>\n\n<p>The astute among you will remember we already have been offering swag through the <a href=\"https://fundrazr.com/91nni4\">2021 Conference Fundrazr</a>, but don&#39;t worry, these aren&#39;t in direct conflict with each other. Aside from the fact that the Fundrazr has some supercool, exclusive things you can&#39;t get here, between the turnout so far, and the sponsorship that we have secured for the Conference, we feel confident at hitting our funding goals there, so by choosing <em>this</em> swag instead of <em>that</em> swag, you aren&#39;t bleeding the conference of funding (Related: Wondering where your conference swag is? Pins are supposed to arrive this week, and then we&#39;ll start shipping!)</p>\n\n<p><strong>OMG, I Can&#39;t Believe You Sold Out Like This!!!!</strong></p>\n\n<p>We really do value your feedback on this as a community! The pilot runs for one month, after which our continued participation (assuming they expand the program) is entirely up in the air, and very dependent on what you, the AskHistorians community, would want to see! Based on past years when we&#39;ve done fundraisers, or simply shared some of the swag we send out for awards, its been pretty clear that many folks would be interested in AskHistorians swag, so we&#39;re giving this a try.</p>\n\n<p>If you think this is super cool and want us to expand it, <em>let us know</em>. If you think this is stupid as hell and we never should have participated in the first place, <em>let us know</em>. We take all of that feedback seriously, and as this is very much a project <em>for the community</em>, the response of the community - <em>you folks</em> - is super important for us in evaluating its success or failure. We&#39;ll be providing feedback to reddit at the end of this, and what you all have to say about it will be front and center is whatever we end up reporting.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/q2oxhc/want_to_be_the_height_of_fashion_askhistorians_is/",
  "subreddit": "AskHistorians",
  "id": "q2oxhc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "TL;DR: CLICK HERE TO CHECK IT OUT\n[https://www.teepublic.com/stores/shopraskhistorians]\n\nWhat's Happening\n\nWe agreed to assist the admins in piloting a new program which would allow users\nto get their hands on community themed swag. We've provided AskHistorians swag\nas prizes for year-end awards for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "tl;dr: ここをクリックしてチェックしてください。\n[https://www.teepublic.com/stores/shopraskhistorians]\n\n何が起こっているのか\n\n私たちは、ユーザーがコミュニティのテーマに沿ったグッズを手に入れることができる新しいプログラムを試験的に開始するために、管理者を支援することに同意しました。\nコミュニティをテーマにしたグッズを手に入れることができるようにする新しいプログラムの試験運用を管理者が支援することに合意しました。私たちはAskHistoriansのグッズを提供しました。\nの年末賞の賞品として提供してきました。",
      "title": "ファッションの頂点に立ちたい？AskHistoriansはredditのスワッグストアのパイロットプログラムに参加していますので、あなたのチャンスです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "简而言之：点击这里查看\n[https://www.teepublic.com/stores/shopraskhistorians]\n\n正在发生的事情\n\n我们同意协助管理员试行一项新计划，让用户能够\n让他们获得以社区为主题的赠品。我们已经提供了AskHistorians的礼品\n作为年终奖的奖品，为...",
      "title": "想成为时尚的高度吗？AskHistorians正在参与reddit的swag store试点项目，所以你的机会来了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "簡而言之：點擊這裏查看\n[https://www.teepublic.com/stores/shopraskhistorians]\n\n正在發生的事情\n\n我們同意協助管理員試行一項新計劃，讓用戶能夠\n讓他們獲得以社區爲主題的贈品。我們已經提供了AskHistorians的禮品\n作爲年終獎的獎品，爲...",
      "title": "想成爲時尚的高度嗎？AskHistorians正在參與reddit的swag store試點項目，所以你的機會來了。"
    }
  ]
}