{
  "author": "vonhovan",
  "original_created_utc": 1637672236,
  "title": "My crypto journey - from newbie daytrader to DeFI farmer - full disclosure",
  "created_utc": 1637706885,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m pretty new here, entered the market at the end of April this year. Feels pretty distant already, a lot of stuff happened in between (ups and downs). My start was rough, for the first 3 months I was bleeding, always in red. Seemed like odds are against me.</p>\n\n<p>As I was just getting started, it was super slow and seemed complex. Everything felt scary, I had 0 confidence in what I am doing, but I had a gut feeling, a desire slowly becoming obsession. I went through different phases on this journey, and I want to share my experience so far with you guys, with a hope that it can be useful for anyone reading it.</p>\n\n<p>I will go through all my phases in the article below, good and bad, without any restraint, with a conclusion and tips at the end!</p>\n\n<p>&#x200B;</p>\n\n<p><strong>PHASE 1 - THE BEGINNING - NEWBIE DAY TRADER</strong></p>\n\n<p>&#x200B;</p>\n\n<p>This might be the most common way everyone started/will start. I have heard on social media/chit chats/news about a crypto currency called DOGE (bare in mind that I have heard about BTC long ago, but in my country Montenegro, there is only a dozen of investors in crypto). I got interested, and after a few days I found myself looking for a way to purchase it.</p>\n\n<p>After some research I found that I can download Binance app on my phone (I tried Coinbase first, but it is not supported in my country), did the KYC and I could start depositing. That&#39;s how I put 15 euros, and bought my first crypto ever. Over the next few days it started rising and I was getting euphoric, as my investment doubled. I had no idea how market works, what&#39;s market cap/supply/cycles etc. Luckily,   I was here, on this thread since start and started picking up quite a few useful informations. I found about CoinBureau&#39;s youtube channel (among many other trading/shilling ones) at that time also, so that&#39;s quite a headstart, when I look back.</p>\n\n<p>As I was learning about spot trading, first thing that crossed my mind was short term swings (lol). I have noticed that the market is very volatile, and tought that I can get the advantage of it.</p>\n\n<p>Fast forward a month I have put a couple of hundreads, finding myself day trading on Ada/Matic (after many other everyday going back and forth from one coin to another, without any knowledge on projects, just based on what I hear from diferent sources). At the end of May, the bleeding started, panic selling after 5% dips, rebuying after 5% ups, chasing trades, basic buy high/sell low meme newbie trader. I was down 20-30% on my initial investment.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>PHASE 2 - LEARNING/STRATEGIC INVESTING - DCA&#39;ing and STAKING (off-chain), MOON FARMING</strong></p>\n\n<p>&#x200B;</p>\n\n<p>I understood that I am not capable of day trading, competing against automated bots/experienced traders is HARD. Browsing around here I saw &quot;DCA, DCA, DCA&quot; on every and each post. Started wondering what&#39;s that, and the rest is history. I picked a few coins (ETH/ADA), and decided to put regularly (every few days/week) smaller ammounts, whenever I can, not so concerned about the price of coins at the moment.</p>\n\n<p>I started accumulating, patiently, even though my portfolio was in red, never saw green pastures since my first 15 dollars DOGE investment. I have learned about Binance staking mechanisms. I started to stake my ADA/ETH, and felt super nice. I was too noob to stake on-chain, but the locked stake mechanism kept me from panicking at the very least (pretty useful for newbies, when I look back). I found out about BETH/ETH trading pair, where I could trade my ETH for staked version (Binance Ethereum BETH) while immidiately getting 3-8% more of my ETH bag, and staking it for 5-6% interest. Felt great.</p>\n\n<p>All this time I have never stopped researching, reading about everything, started to open whitepappers, found out about - &quot;Rainbow chart&quot;, &quot;Greed index&quot;, &quot;Alt Coin season index&quot; etc.</p>\n\n<p>Over time getting deeper and deeper into this rabbit hole. At this point, I knew I will never sell on loss, as you really never loose anything unless you sell. I was in a state of peace, slowly building my position and portfolio.</p>\n\n<p>This went for a few months (June-July-August).</p>\n\n<p><em>I have learned about moon farming in this phase, and I did it for a couple of months. I got hooked up. Was sorting posts on this sub by &quot;New&quot;, and just commenting, lol! Open you vault, guys. It is super easy!</em></p>\n\n<p>&#x200B;</p>\n\n<p><strong>PHASE 3 - CONFIDENCE RISING - first use of smart contracts, riskier investments, on-chain interactions</strong></p>\n\n<p>&#x200B;</p>\n\n<p>Durring my accumulation period I have started gaining interest on smart contracts. I found out that my ETH is of no use there, since for the ammount I had was not worth using it on-chain. Naturally, as I use Binance, I begun looking around Binance Smart Chain possibilites. Everything was new, exciting, many coins, tokens, etc. There I have learned about swaps, dex&#39;es, smart contract&#39;s use, and for the first time heard of DeFI.</p>\n\n<p>I started using on-chain staking for my Ada (Yoroi wallet, Chrome extension). Found my first delegators, super exciting.</p>\n\n<p>Than, my first smart contracts touch in practice. CryptoBlades, Binance Smart Chain&#39;s, game. Installed my MetaMask wallet chrome extension, went on their website, and connected it. Transfered BNB from Binance to metamask, swapped on some DEX my BNB for native token and boom, I was doing it! Unreal at the start, play to earn game, entered with 150 Euros, bought some heroes, weapons, and puff - I was making 20-30 dollars each day before you say it. My grand plans came due to the state of euphoria, greed kicked in. But some inner gut feeling made me not reinvest everything, because I wanted to get my principal investment back out. No need to say, this turned out to be really too good to be true, massive dillution of native token, and massive cheap/free minting ruined game economy, and after a month of my enter price completely crashed, without any rewards liquidity. Atleast, I was not on big loss, maybe 10% ( but it&#39;s positive zero, gained experience and exposure to on-chain mechanisms). Big step for me!</p>\n\n<p>All this time my Ada/Eth was patiently HODL&#39;ed. Mid August is the time when market started gaining some traction. Confidence returned, FUD around BTC stopped, Ethereum started getting upgrades, Ada was on fire cuz of smart contract hype. My portfolio stopped bleeding, and for the first time about lucky first DOGE investment my position was in green! No need to say, I was feeling great! Momentum was on my side.</p>\n\n<p>I was starting to be experimental, looking for new coins with &quot;fundamentals&quot;, looking for coins that, in my opinion, would be in demand. Naturally for me, as I was into Cardano&#39;s ecosystem, I understood that because of smart contracts about to be implemented new projects will start to show up. That&#39;s where I did my first x8 (at the end I cashed out on x5). I have found a future DEX token - ADAX, where i put around 30% of my portfolio at the time.</p>\n\n<p>I have never invested in a shit/meme coin! Might not be the wisest from the return on investment point when I look back now, but I stay away from them.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>PHASE 4 - my first gather of profits - very important!</strong></p>\n\n<p>&#x200B;</p>\n\n<p>Don&#39;t get overly attached, be ready to move, act like a nomad!</p>\n\n<p>&#x200B;</p>\n\n<p>I understood that the market is pretty speculative (I was super attached to Cardano/Eth), and as I was going more and more on the green side, other type of panic took place. I was nervous on not realising my profits patiently earned. I have understood that a good time (and hardest) to take the profit is at all time highs. We have to be humble! At this time I already knew about opportunity cost, and didn&#39;t want to ride a wave down. I wanted to reinvest somewhere else. After smart contract &quot;release&quot; hype I started Dca&#39;ing out of Cardano, and sold most between 3-2$ dollars, in profit. I did the same with Eth, sold 4k+ (all of it). I kept some ADA for staking in MELD pools (future lending/borrowing platform on Cardano), as I will get rewards at the start of December in their token.</p>\n\n<p>This might not be the best for everyone, that&#39;s was just my gut feeling, that turned out to be the right move, as my reinvestment did much better.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>PHASE 5 - entering DeFi space (Decentralized Finance) - farming</strong></p>\n\n<p>&#x200B;</p>\n\n<p>This is where I am at now. This is a world full of possibilites, but not many utilize it. Some say it&#39;s riskier, but I know for certain it&#39;s scary for unexperienced investors. A lot of new terminology and strategies.</p>\n\n<p>DeFi, in my opinion, will lead our beloved crypto market (if it is not already, lol). It gives even more trust in crypto. Traditional finance are past. Try some DeFi, and see for yourself.</p>\n\n<p>To position yourself as a house/bank, and gather those juicy interests feel great. Liquidity porviding/lending/borrowing is a great mechanism to use, to upgrade your potential of coins you HODL anyway.</p>\n\n<p>After you enter this space, and discover all the protocols on many chains that use smart contracts, you will understand demmand/supply much better!</p>\n\n<p>For example - you might saw AVAX run up, but don&#39;t understand why it&#39;s happening. It is not random! You need that AVAX to enter on-chain DeFi. There are numerous great protocols, with competent developers, doing wonders. Litreally, when you provide liquidity, that protocol (each has their own setup) utilize your money to make more money, while giving you back as a reward usually great interest. You can also get a percentage from swaps/trades happening on that DEX, depends on the smart contracts you interact with.</p>\n\n<p>There are many more great chains: Luna, Harmony, Fantom, besides  AVAX, have the most to offer. I didn&#39;t include Eth&#39;s Layer 2 solutions, as I don&#39;t find them as attractive atm. Ethereum main chain is great, but you need tens of thousands worth to utilize it properly (gas fees are enormous, as we all know). Solana have some badass DEFI protocols aswell, but didn&#39;t use it yet.</p>\n\n<p>Some new chains with DeFi that I am looking forward to use are: Algorand, Cardano (soon, I hope) and Elrond.</p>\n\n<p>Currently, I am on AVAX and Harmony ecosystem. Reaping some nice yields there. Unimaginable for me before, 3 digits APR&#39;s, and with compounding that APY becomes unreal. But I am careful. I take care of my profits.</p>\n\n<p>I&#39;m pretty vigilant, as 35-40% of my portfolio is in stable coins. Some are paired providing liquidity, and some are lended, and borrowed back to stack APR.</p>\n\n<p>I actually make around 66% APR currently on 1USDC (on Harmony chain). You can do it by stacking, wich is a great strategy on this chain, since transaction fees are super low (0.001 cents) and fast.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>CONCLUSION:</strong></p>\n\n<p>&#x200B;</p>\n\n<p>- You can start without any knowledge about crypto, and with passion and love you can find your way around, in this world.</p>\n\n<p>- Patience is the name of the game. The least emotions you have, the better is for you.</p>\n\n<p>- Experimentation will lead you to greatness. You need practice if you want to go advanced! Find a cheap and fast chain, and use that crypto for you. Money makes money. If you don&#39;t use it, you are not doing it properly.</p>\n\n<p>-  Try to go on-chain. Make a wallet, Metamask or something, write your seed phrases, that&#39;s you crypto now! Hell, just begin with on-chain staking, it secures the chain you believe in and hold!</p>\n\n<p>- If there is no DeFi on the chain - price action will suffer, at least currently. But that might be a good time to enter, since after protocols start to arise demmand will follow. Follow your reasearch!</p>\n\n<p>- Be careful out there, if you are on DeFi side, there are protocols rising like mushrooms everywhere!</p>\n\n<p>- Protect your profits, DCA out the same as you DCA in. It adds up!</p>\n\n<p>- Before putting money somewhere you need to check the pulse! Join discord, read their twitter, check market cap/supply, vesting period, team/develpores, whitepapper, utility of native coin/token.</p>\n\n<p>- Community is a great factor of every project!</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>These are general things I use to check general state of market every day!</em></strong></p>\n\n<p><a href=\"https://www.blockchaincenter.net/bitcoin-rainbow-chart/\">https://www.blockchaincenter.net/bitcoin-rainbow-chart/</a> - Bit Coin rainbow chart</p>\n\n<p><a href=\"https://alternative.me/crypto/fear-and-greed-index/\">https://alternative.me/crypto/fear-and-greed-index/</a> - Fear and Greed index</p>\n\n<p><a href=\"https://www.blockchaincenter.net/altcoin-season-index/\">https://www.blockchaincenter.net/altcoin-season-index/</a> - Alt/Bitcoin season index</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>My suggestions for Youtube channels:</em></strong></p>\n\n<p>&#x200B;</p>\n\n<p>1.)  General knowledge and news - CoinBureau</p>\n\n<p>2.) Technical analysis of major chains - Benjamin Cowen</p>\n\n<p>3.) DeFi world - Taiki Maeda</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>I, sincerely, hope that someone will read this and find this article useful. If I helped one person, I would be proud.</p>\n\n<p>This is the future, crypto is getting started!</p>\n\n<p>&#x200B;</p>\n\n<p>If you have questions about my portfolio, or what protocols I currently use, ask in comments. I will answer gladly!</p>\n</div><!-- SC_ON -->",
  "score": 216,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/SewGpYdYjd6-lqf-MFD30wS-07DnvHk7GLgVFN9tTT4.jpg?auto=webp&s=23971b688713d31a95c93ec423afda3d614d4a5e",
          "width": 896,
          "height": 597
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/SewGpYdYjd6-lqf-MFD30wS-07DnvHk7GLgVFN9tTT4.jpg?width=108&crop=smart&auto=webp&s=ce0c98faa0cee7c03fbdaccf74a3d096d6e45f53",
            "width": 108,
            "height": 71
          },
          {
            "url": "https://external-preview.redd.it/SewGpYdYjd6-lqf-MFD30wS-07DnvHk7GLgVFN9tTT4.jpg?width=216&crop=smart&auto=webp&s=8a13ae08a273e91157d4fc44157346aa7c7c59c5",
            "width": 216,
            "height": 143
          },
          {
            "url": "https://external-preview.redd.it/SewGpYdYjd6-lqf-MFD30wS-07DnvHk7GLgVFN9tTT4.jpg?width=320&crop=smart&auto=webp&s=73df69ec262017daa1c9b067837a2b0c21c4047f",
            "width": 320,
            "height": 213
          },
          {
            "url": "https://external-preview.redd.it/SewGpYdYjd6-lqf-MFD30wS-07DnvHk7GLgVFN9tTT4.jpg?width=640&crop=smart&auto=webp&s=0234068ed1312f1cf8c0fee09279b3a4ac34e4e3",
            "width": 640,
            "height": 426
          }
        ],
        "variants": {},
        "id": "PHBK3wl6pSDGIOV55LeJEjuaVGRNdfns-wkQMyLImV4"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/r0cn5e/my_crypto_journey_from_newbie_daytrader_to_defi/",
  "subreddit": "CryptoCurrency",
  "id": "r0cn5e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm pretty new here, entered the market at the end of April this year. Feels\npretty distant already, a lot of stuff happened in between (ups and downs). My\nstart was rough, for the first 3 months I was bleeding, always in red. Seemed\nlike odds are against me.\n\nAs I was just getting started, it was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は今年の4月末に市場に参入した、かなりの新参者です。かなり遠い存在に感じます。\nこの間にいろいろなことがありました（浮き沈みがありました）。私の\n最初の3ヶ月間は出血がひどく、常に赤字でした。まるで\n私にとっては不利な状況でした。\n\n始まったばかりの頃、それは...。",
      "title": "私の暗号化の旅 - 初心者デイトレーダーからDeFIファーマーまで - 完全公開"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是这里的新人，今年4月底进入市场。感觉\n已经很遥远了，中间发生了很多事情（起起伏伏）。我的\n开始的时候很艰难，头三个月我一直在流血，一直是红色的。似乎\n好像有很多机会对我不利。\n\n当我刚开始的时候，它是...",
      "title": "我的加密货币之旅--从新手日间交易员到DeFI农夫--完全披露"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是這裏的新人，今年4月底進入市場。感覺\n已經很遙遠了，中間發生了很多事情（起起伏伏）。我的\n開始的時候很艱難，頭三個月我一直在流血，一直是紅色的。似乎\n好像有很多機會對我不利。\n\n當我剛開始的時候，它是...",
      "title": "我的加密貨幣之旅--從新手日間交易員到DeFI農夫--完全披露"
    }
  ]
}