{
  "author": "Charmycole",
  "original_created_utc": 1634417407,
  "title": "Thanks to crypto I’d be reuniting with my family soon",
  "created_utc": 1634434665,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Here’s my testimony: </p>\n\n<p>I’m originally from Zimbabwe (now living in the U.S. for over a decade) and come from a humble background. I never grew up with money but I was never hungry. Nonetheless, my parents did everything to get me to the U.S. for a chance of a better life. Sadly, when I got to the states I realized it wasn’t all sunshine and rainbows that had been depicted on TV. I migrated here thinking I’d be able to achieve the “American dream” and move my family here quickly. Of course, it wasn’t like that. Things were a lot tougher than I thought and I wasn’t able to get my family here because of the lengthy immigration process and it costs thousands of dollars. Also, I had to pay off student loans after nursing school and other debts</p>\n\n<p>Anyway, thanks to crypto  I have made enough to finally start the immigration process for my family to move here after a decade of not seeing them. Life has gotten in the way so many times and I’ve been unable to visit home due to financial reasons. I’m just so grateful and I’m in tears as I am typing this because I truly believe I can start providing for my family (it has always been my greatest goal) and live comfortably. Crypto is truly life changing and i hope all of you reach your crypto goals and achieve everything you’ve ever dreamed of!</p>\n</div><!-- SC_ON -->",
  "score": 274,
  "permalink": "/r/CryptoCurrency/comments/q9kb4q/thanks_to_crypto_id_be_reuniting_with_my_family/",
  "subreddit": "CryptoCurrency",
  "id": "q9kb4q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Here’s my testimony:\n\nI’m originally from Zimbabwe (now living in the U.S. for over a decade) and come\nfrom a humble background. I never grew up with money but I was never hungry.\nNonetheless, my parents did everything to get me to the U.S. for a chance of a\nbetter life. Sadly, when I got to the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここに私の証言があります。\n\n私はジンバブエ出身で、現在はアメリカに10年以上住んでいます。\n私はジンバブエ出身で（現在は10年前からアメリカに住んでいます）、謙虚な家庭に生まれました。お金があって育ったわけではありませんが、お腹が空いたことはありませんでした。\nそれにもかかわらず、私の両親は、私がより良い生活を送るチャンスを得るために、あらゆる手段を講じて私をアメリカに連れてきました。\nしかし、両親は私がより良い生活を送れるようにと、あらゆる努力をしてくれました。残念なことに、私がアメリカに着いたときには...。",
      "title": "暗号のおかげで、もうすぐ家族と再会できる。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "以下是我的见证。\n\n我来自津巴布韦（现在在美国生活了十多年），来自卑微的背景。\n我来自一个卑微的背景。我从来没有在金钱中长大，但我从未挨过饿。\n尽管如此，我的父母还是想尽一切办法把我送到美国，以便有机会过上更好的生活。\n更好的生活。可悲的是，当我到了美国后，我的父母却不知道该怎么办。",
      "title": "多亏了加密货币，我很快就能和我的家人团聚了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "以下是我的見證。\n\n我來自津巴布韋（現在在美國生活了十多年），來自卑微的背景。\n我來自一個卑微的背景。我從來沒有在金錢中長大，但我從未捱過餓。\n儘管如此，我的父母還是想盡一切辦法把我送到美國，以便有機會過上更好的生活。\n更好的生活。可悲的是，當我到了美國後，我的父母卻不知道該怎麼辦。",
      "title": "多虧了加密貨幣，我很快就能和我的家人團聚了。"
    }
  ]
}