{
  "author": "AskScienceModerator",
  "the_new_excerpt": "I'm a professor of health policy at the Yale School of Public Health. I focus on\nvaccines and vaccination programs, and since last summer, I've been working\nexclusively on supporting efforts to accelerate the development, authorization,\nand distribution of safe and effective COVID-19 vaccines. I…",
  "original_created_utc": 1613044842,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我是耶鲁大学公共卫生学院的卫生政策教授。我的工作重点是\n疫苗和疫苗接种计划，从去年夏天开始，我就一直在工作。\n专门用于支持加快发展的努力，授权。\n和分发安全有效的COVID-19疫苗。I…",
      "title": "AskScience AMA系列。我是Jason Schwartz, 疫苗政策和COVID疫苗接种的专家, 也是耶鲁大学公共卫生学院的教授. AMA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是耶魯大學公共衛生學院的衛生政策教授。我的工作重點是\n疫苗和疫苗接種計劃，從去年夏天開始，我就一直在工作。\n專門用於支持加快發展的努力，授權。\n和分發安全有效的COVID-19疫苗。I…",
      "title": "AskScience AMA系列。我是Jason Schwartz, 疫苗政策和COVID疫苗接種的專家, 也是耶魯大學公共衛生學院的教授. AMA!"
    }
  ],
  "title": "AskScience AMA Series: I'm Jason Schwartz, an expert on vaccine policy and COVID vaccination rollout, and a professor at the Yale School of Public Health. AMA!",
  "created_utc": 1613048414,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m a professor of health policy at the Yale School of Public Health. I focus on vaccines and vaccination programs, and since last summer, I&#39;ve been working exclusively on supporting efforts to accelerate the development, authorization, and distribution of safe and effective COVID-19 vaccines. I serve on <a href=\"https://portal.ct.gov/DPH/Communications/Disease-Preparedness/COVID-19-Vaccine-Advisory-Group\">Connecticut&#39;s COVID-19 Vaccine Advisory Group</a>, I <a href=\"https://www.c-span.org/video/?473850-1/house-hearing-ensuring-safe-covid-19-vaccine\">testified before Congress</a> on the FDA regulation of these vaccines, and I&#39;ve published my research and perspectives on COVID vaccination policy in the <a href=\"https://www.nejm.org/doi/full/10.1056/NEJMp2026393\">New England Journal of Medicine</a> and elsewhere.</p>\n\n<p>Last fall, my colleagues and I - including Dr. Rochelle Walensky, now the director of the CDC - published a <a href=\"https://www.healthaffairs.org/doi/full/10.1377/hlthaff.2020.02054?utm_medium=press&amp;utm_source=mediaadvisory&amp;utm_campaign=Covidfasttrack&amp;utm_content=Schwartz\">modeling study</a> that demonstrated the importance of rapid, wide-reaching vaccine implementation and rollout activities to the success of vaccination programs and the eventual end of the pandemic, even more so than the precise efficacy of a particular vaccine. We also <a href=\"https://www.usatoday.com/story/opinion/2020/11/19/covid-19-vaccine-distribution-not-just-development-necessary-column/6333001002/\">wrote an op-ed</a> summarizing our findings and key messages.</p>\n\n<p>Ask me about how the vaccines have been tested and evaluated, what we know about them and what we&#39;re still learning, how guidelines for vaccine prioritization have been developed and implemented, how the U.S. federal government and state governments are working to administer vaccines quickly and equitably, and anything else about COVID vaccines and vaccination programs.</p>\n\n<p>More info about me <a href=\"https://medicine.yale.edu/lab/jschwartz/\">here</a>, and I&#39;m on Twitter at <a href=\"https://twitter.com/jasonlschwartz\">@jasonlschwartz</a>. I&#39;ll be on at 1 pm ET (18 UT), AMA!</p>\n\n<p>Username: <a href=\"/u/jasonlschwartz\">/u/jasonlschwartz</a></p>\n</div><!-- SC_ON -->",
  "score": 136,
  "permalink": "/r/askscience/comments/lhja9h/askscience_ama_series_im_jason_schwartz_an_expert/",
  "subreddit": "askscience",
  "id": "lhja9h",
  "is_self": true,
  "media": null,
  "is_video": false
}