{
  "author": "SparkEthos",
  "the_new_excerpt": "Reuters released this exclusive story:\n\nhttps://www.reuters.com/article/us-amazon-engines-natural-gas-exclusive/exclusive-amazon-orders-hundreds-of-trucks-that-run-on-natural-gas-idUSKBN2A52ML?il=0\n\nThis development could bode well for energy majors such Royal Dutch Shell\n(RDS-A/B)…",
  "original_created_utc": 1612650214,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "路透社发布了这一独家报道。\n\nhttps://www.reuters.com/article/us-amazon-engines-natural-gas-exclusive/exclusive-amazon-orders-hundreds-of-trucks-that-run-on-natural-gas-idUSKBN2A52ML?il=0\n\n这一发展对荷兰皇家壳牌公司等能源大公司来说是个好兆头。\n(RDS-A/B)...",
      "title": "亚马逊订购700辆使用天然气的卡车--对RDS来说是个好消息？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "路透社發佈了這一獨家報道。\n\nhttps://www.reuters.com/article/us-amazon-engines-natural-gas-exclusive/exclusive-amazon-orders-hundreds-of-trucks-that-run-on-natural-gas-idUSKBN2A52ML?il=0\n\n這一發展對荷蘭皇家殼牌公司等能源大公司來說是個好兆頭。\n(RDS-A/B)...",
      "title": "亞馬遜訂購700輛使用天然氣的卡車--對RDS來說是個好消息？"
    }
  ],
  "title": "Amazon orders 700 trucks that run on natural gas - Good news for RDS?",
  "created_utc": 1612666415,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Reuters released this exclusive story:</p>\n\n<p><a href=\"https://www.reuters.com/article/us-amazon-engines-natural-gas-exclusive/exclusive-amazon-orders-hundreds-of-trucks-that-run-on-natural-gas-idUSKBN2A52ML?il=0\">https://www.reuters.com/article/us-amazon-engines-natural-gas-exclusive/exclusive-amazon-orders-hundreds-of-trucks-that-run-on-natural-gas-idUSKBN2A52ML?il=0</a></p>\n\n<p>This development could bode well for energy majors such <a href=\"https://finance.yahoo.com/quote/RDS-B?p=RDS-B&amp;.tsrc=fin-srch\">Royal Dutch Shell (RDS-A/B)</a> that have invested heavily in Liquified Natural Gas (LNG) and have yet to see major returns on it. Now, just Amazon ordering a few hundred trucks would not swing the sector significantly by itself, but this could set a precedent for other companies to follow suit. As more and more companies set low carbon targets I wouldn&#39;t be surprised to see more stories about this. LNG is a less carbon intensive fuel than gasoline and diesel.</p>\n\n<p>A bit more on RDS: I&#39;ve been long RDS through the COVID epidemic and its shares have been (in my opinion) very discounted over the last year primarily because it took an early, drastic step in re-basing (lowering) its dividend. Shell is taking some noteworthy steps in restructuring the business model, with plans to only have SIX refineries in its portfolio by 2025 all of which are integrated with chemicals, biofuels, lubricants, or provide strong footing for its trading business. It&#39;s trimming its upstream assets to only a handful of cost advantaged fields and is planning on using cash generation there to bolster investments in what it has clearly outlined as its growth sectors (IE renewables). </p>\n\n<p>RDS has taken a different approach compared to a lot of energy majors in that it is investing in what it views as intermediate fuels versus full on electric: LNG, Hydrogen, Biofuels, etc and its plan is to leverage its large retail arm to deliver these products efficiently to customers. I see this as a decent moat as these are sectors that are harder to break into versus electricity (everyone and their mother has invested in solar and wind farms lately). Shell is <a href=\"https://www.shell.com/media/news-and-media-releases/2021/advance-notice-strategy-day-2021.html\">hosting a strategy day</a> to outline its plans going forward in which it is expected to discuss its business streamlining and plans for renewables. It may be worth a watch.</p>\n\n<p>RDS has certainly taken a beating during COVID, as have all energy companies, but with Shell&#39;s unique portfolio and real steps towards preparing for the energy transition I wouldn&#39;t be surprised if it comes out as a very strong player over the next decade. It has plans to raise its dividend soon and has kept its balance sheet in nice tidy order through the stresses of COVID.</p>\n\n<p>Risks I see:</p>\n\n<ul>\n<li>Can energy majors shake off the stigma of being &quot;oil and gas&quot; companies and receive due attention for investors?</li>\n<li>Will advancements in electric vehicles be significant enough to leap frog intermediate renewable fuels?</li>\n<li>Will divesting significant portions of its traditional oil and gas business leave it more cash strapped than expected?</li>\n<li>What is the actual timeline for seeing significant returns on its renewable investments?</li>\n</ul>\n\n<p>What are your own thoughts on RDS? Or other oil majors making serious steps towards an energy transition? </p>\n\n<p>This post is not investment advice, its for entertainment only. I&#39;m not a financial advisor.</p>\n</div><!-- SC_ON -->",
  "score": 143,
  "permalink": "/r/investing/comments/le8f3e/amazon_orders_700_trucks_that_run_on_natural_gas/",
  "subreddit": "investing",
  "id": "le8f3e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123199860
}