{
  "author": "notoriousbsr",
  "the_new_excerpt": "Stocks and investments never interested my wife. She's legally blind and\nresearch is hard, tons of metrics and financials, etc. - so it has always been\nmy hobby. She liked that I'd talk to her about it but participation was\ndifficult. It never really grabbed her.\n\nThen came crypto. There's so much…",
  "original_created_utc": 1617917949,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の妻は、株や投資には全く興味がありませんでした。彼女は全盲なので\n調べるのは大変で、膨大な量の指標や財務情報などを - ですから、これまでずっと\n私の趣味でした。妻は私がその話をすることを好んでいましたが、参加することは困難でした。\n困難でした。彼女の心をつかむことはできませんでした。\n\nその後、暗号が登場しました。とても多くの...",
      "title": "暗号、盲目、そして結婚の物語"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "股票和投资从来没有让我妻子感兴趣。她在法律上是个盲人，而且\n研究是很难的，大量的指标和财务等。- 所以一直以来\n我的爱好。她喜欢我跟她谈起这个，但参与是\n困难。它从来没有真正抓住她。\n\n然后是加密技术 Then came crypto. 有这么多...",
      "title": "一个关于加密、失明和婚姻的故事。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "股票和投資從來沒有讓我妻子感興趣。她在法律上是個盲人，而且\n研究是很難的，大量的指標和財務等。- 所以一直以來\n我的愛好。她喜歡我跟她談起這個，但參與是\n困難。它從來沒有真正抓住她。\n\n然後是加密技術 Then came crypto. 有這麼多...",
      "title": "一個關於加密、失明和婚姻的故事。"
    }
  ],
  "title": "A Tale of Crypto, Blindness, and Marriage",
  "created_utc": 1617960647,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Stocks and investments never interested my wife.  She&#39;s legally blind and research is hard, tons of metrics and financials, etc. - so it has always been my hobby.  She liked that I&#39;d talk to her about it but participation was difficult.  It never really grabbed her.</p>\n\n<p>Then came crypto.  There&#39;s so much education in the written format - her screen reader can teach her.  There&#39;s so much (good and bad) on YouTube that she&#39;s able to find good info on specific technologies, coins/tokens, partnerships, etc. and learn.  Annnnnnd now she&#39;s discovered that <a href=\"/r/CryptoCurrency\">r/CryptoCurrency</a> is very unlike many others - it has &lt;gasp&gt; actual, useful information.  She&#39;s now having her screen reader go through posts.</p>\n\n<p>She still relies on me for the tickers, wallet-y things, and purchases - but crypto has opened a new world for her - and for us.  22 years into our marriage we&#39;re having lively discussions about the future of crypto, what the future holds.  Instead of grabbing a sandwich or something from amazon, I hear &quot;what if we put more of this into &lt;COIN&gt; and staked it, what would that be in a year?&quot;</p>\n\n<p>I wanted to tell you that while, yes, crypto is about profit - there&#39;s much more happening.  A mostly blind woman has had new doors opened for her, new interests. A marriage is even better because of a new, shared interest.  We were by no means stale - but damn - it&#39;s fun to see her digging through whitepapers - via screenreader.</p>\n\n<p>Noobs, take note that a blind lady can be bothered to read the learn to understand the whitepaper and use of the coin - you should too. :)</p>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/CryptoCurrency/comments/mn27mq/a_tale_of_crypto_blindness_and_marriage/",
  "subreddit": "CryptoCurrency",
  "id": "mn27mq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566612883
}