{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "House Speaker Nancy Pelosi on Wednesday rejected the idea of banning members of Congress and their spouses from holding and trading individual stocks while in office.\n\n\"This is a free market, and people — we are a free market economy. They should be able to participate in that,\" Pelosi said when asked by Insider at her weekly press conference.\n\nInsider also asked Pelosi about \"Conflicted Congress,\" a 5-month-long investigation by Insider that found 49 members of Congress and 182 senior congressional staffers have violated the STOCK Act, a law to prevent Insider trading.\n\nThe Speaker said she had not yet seen the project, but said that it's important that members are complying with the law.\n\n\"If people aren't reporting, they should be,\" she said.\n\nPelosi's position puts her at odds with the likes of progressives like Sen. Elizabeth Warren and Rep. Alexandria Ocasio-Cortez, both of whom have called for banning members of congress from trading stocks while in office.\n\n\"It is absolutely ludicrous that members of Congress can hold and trade individual stock while in office,\" Ocasio-Cortez recently wrote on Twitter. \"The access and influence we have should be exercised for the public interest, not our profit. It shouldn't be legal for us to trade individual stock with the info we have.\"\n\nAnd on Tuesday, Sen. Warren told Insider that she had seen Insider's investigation, calling out the \"brazenness\" of members and staffers trading stocks even while having access to privileged knowledge.\n\n\"We need both tougher laws and enforcement of those laws,\" the Massachusetts Democrat told Insider. \"The American people should never have to guess whether or not an elected official is advancing an issue or voting on a bill based on what's good for the country or what's good for their own personal financial interests.\" \n\nAsked about progressives' position on the issue, a spokesman for Pelosi signaled that the speaker prefers a transparency-focused approach to insider trading.\n\n\"The STOCK Act exists to shine a bright light on trades by members of Congress,\" said spokesman Drew Hammill. \"Sunlight is the best disinfectant.\"\n\n\"The speaker does not own any stocks,\" he continued. \"As you can see from the required disclosures, with which the speaker fully cooperates, these transactions are marked 'SP' for spouse. The Speaker has no prior knowledge or subsequent involvement in any transactions.\"\n\nPelosi's husband, investor Paul Pelosi, frequently trades significant numbers of stocks. With her husband's assets considered, Pelosi ranks among the wealthiest members of Congress, according to an Insider analysis.\n\nInsider has identified numerous examples of federal lawmakers trading stocks in industries they oversee as part of their congressional committee assignments, including within the defense, healthcare, and energy industries.\n\nbus inessinsider.com/we-are-free-market-economy-pelosi-rejects-stock-ban-congress-2021-12",
  "author_fullname": "t2_a1fdck05",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Pelosi rejects stock-trading ban for members of Congress: 'We are free market economy. They should be able to participate in that'",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": true,
  "name": "t3_rh65q3",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.97,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 25319,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 25319,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1639593907,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;House Speaker Nancy Pelosi on Wednesday rejected the idea of banning members of Congress and their spouses from holding and trading individual stocks while in office.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;This is a free market, and people — we are a free market economy. They should be able to participate in that,&amp;quot; Pelosi said when asked by Insider at her weekly press conference.&lt;/p&gt;\n\n&lt;p&gt;Insider also asked Pelosi about &amp;quot;Conflicted Congress,&amp;quot; a 5-month-long investigation by Insider that found 49 members of Congress and 182 senior congressional staffers have violated the STOCK Act, a law to prevent Insider trading.&lt;/p&gt;\n\n&lt;p&gt;The Speaker said she had not yet seen the project, but said that it&amp;#39;s important that members are complying with the law.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;If people aren&amp;#39;t reporting, they should be,&amp;quot; she said.&lt;/p&gt;\n\n&lt;p&gt;Pelosi&amp;#39;s position puts her at odds with the likes of progressives like Sen. Elizabeth Warren and Rep. Alexandria Ocasio-Cortez, both of whom have called for banning members of congress from trading stocks while in office.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It is absolutely ludicrous that members of Congress can hold and trade individual stock while in office,&amp;quot; Ocasio-Cortez recently wrote on Twitter. &amp;quot;The access and influence we have should be exercised for the public interest, not our profit. It shouldn&amp;#39;t be legal for us to trade individual stock with the info we have.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;And on Tuesday, Sen. Warren told Insider that she had seen Insider&amp;#39;s investigation, calling out the &amp;quot;brazenness&amp;quot; of members and staffers trading stocks even while having access to privileged knowledge.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;We need both tougher laws and enforcement of those laws,&amp;quot; the Massachusetts Democrat told Insider. &amp;quot;The American people should never have to guess whether or not an elected official is advancing an issue or voting on a bill based on what&amp;#39;s good for the country or what&amp;#39;s good for their own personal financial interests.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Asked about progressives&amp;#39; position on the issue, a spokesman for Pelosi signaled that the speaker prefers a transparency-focused approach to insider trading.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The STOCK Act exists to shine a bright light on trades by members of Congress,&amp;quot; said spokesman Drew Hammill. &amp;quot;Sunlight is the best disinfectant.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The speaker does not own any stocks,&amp;quot; he continued. &amp;quot;As you can see from the required disclosures, with which the speaker fully cooperates, these transactions are marked &amp;#39;SP&amp;#39; for spouse. The Speaker has no prior knowledge or subsequent involvement in any transactions.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Pelosi&amp;#39;s husband, investor Paul Pelosi, frequently trades significant numbers of stocks. With her husband&amp;#39;s assets considered, Pelosi ranks among the wealthiest members of Congress, according to an Insider analysis.&lt;/p&gt;\n\n&lt;p&gt;Insider has identified numerous examples of federal lawmakers trading stocks in industries they oversee as part of their congressional committee assignments, including within the defense, healthcare, and energy industries.&lt;/p&gt;\n\n&lt;p&gt;bus inessinsider.com/we-are-free-market-economy-pelosi-rejects-stock-ban-congress-2021-12&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": true,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "rh65q3",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "rockinoutwith2",
  "discussion_type": null,
  "num_comments": 22,
  "send_replies": false,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/rh65q3/pelosi_rejects_stocktrading_ban_for_members_of/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/rh65q3/pelosi_rejects_stocktrading_ban_for_members_of/",
  "subreddit_subscribers": 3384676,
  "created_utc": 1639595354,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1639593907,
  "the_new_excerpt": "House Speaker Nancy Pelosi on Wednesday rejected the idea of banning members of\nCongress and their spouses from holding and trading individual stocks while in\noffice.\n\n\"This is a free market, and people — we are a free market economy. They should\nbe able to participate in that,\" Pelosi said when…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ナンシー・ペロシ下院議長は19日、国会議員を禁止する考えを否定した。\n議員やその配偶者が在職中に個別銘柄を保有し、取引することは禁止されている。\nを使用します。\n\n「これは自由市場であり、人々は - 私たちは自由市場経済である。自由な市場であり、人々は\nペロシは、「私は、それに参加することができる」と述べた。",
      "title": "ペロシ議員、議員の株取引禁止を拒否。私たちは自由市場経済だ。彼らはそれに参加することができるはずだ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "众议院议长南希-佩洛西(Nancy Pelosi)周三拒绝了禁止国会议员和他们的配偶举行传统婚礼的想法。\n国会议员及其配偶在任职期间持有和交易个人股票。\n职务。\n\n\"这是一个自由市场，而人们--我们是一个自由市场经济。他们应该\n他们应该能够参与其中，\"佩洛西说，当...",
      "title": "佩洛西拒绝对国会议员的股票交易禁令。我们是自由市场经济。他们应该能够参与其中"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "衆議院議長南希-佩洛西(Nancy Pelosi)週三拒絕了禁止國會議員和他們的配偶舉行傳統婚禮的想法。\n國會議員及其配偶在任職期間持有和交易個人股票。\n職務。\n\n\"這是一個自由市場，而人們--我們是一個自由市場經濟。他們應該\n他們應該能夠參與其中，\"佩洛西說，當...",
      "title": "佩洛西拒絕對國會議員的股票交易禁令。我們是自由市場經濟。他們應該能夠參與其中"
    }
  ],
  "source_updated_at": 1639734121822
}