{
  "author": "moteosnaka",
  "the_new_excerpt": "My wife and I started investing a few years ago in mutual funds. Over the past\ntwo years I choose an ETF on the Wednesday before payday, and buy as many shares\nas possible in Vanguard on Friday, with the remainder into VFIAX.\n\nHere's how it's worked out so…",
  "original_created_utc": 1621126791,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私と妻は、数年前に投資信託への投資を始めました。この2年間で\n給料日前の水曜日にETFを選び、金曜日にVanguardでできるだけ多くの株を買い、残りはVFIAXに入れます。\n金曜日にバンガードでできるだけ多くの株を購入し、残りはVFIAXに入れています。\n\nこれまでの結果は以下の通りです...。",
      "title": "給料の20％をETFに"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和妻子几年前开始投资于共同基金。在过去的\n两年来，我在发薪日之前的周三选择一个ETF，并在周五买入尽可能多的Vanguard股票。\n尽可能多地在周五买入Vanguard，其余的买入VFIAX。\n\n下面是它是如何运作的，所以...",
      "title": "每份工资的20%存入ETF"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和妻子幾年前開始投資於共同基金。在過去的\n兩年來，我在發薪日之前的週三選擇一個ETF，並在週五買入儘可能多的Vanguard股票。\n儘可能多地在週五買入Vanguard，其餘的買入VFIAX。\n\n下面是它是如何運作的，所以...",
      "title": "每份工資的20%存入ETF"
    }
  ],
  "title": "20% of every paycheck into an ETF",
  "created_utc": 1621151380,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My wife and I started investing a few years ago in mutual funds. Over the past two years I choose an ETF on the Wednesday before payday, and buy as many shares as possible in Vanguard on Friday, with the remainder into VFIAX.</p>\n\n<p>Here&#39;s how it&#39;s worked out so far:</p>\n\n<p><a href=\"https://preview.redd.it/zfzx122urdz61.png?width=225&amp;format=png&amp;auto=webp&amp;s=687879867cf60ec56d5c81395e3d6f30dd0a3460\">https://preview.redd.it/zfzx122urdz61.png?width=225&amp;format=png&amp;auto=webp&amp;s=687879867cf60ec56d5c81395e3d6f30dd0a3460</a></p>\n\n<p>Certainly a lot of overlap, but low fees overall. I started out with a 10-fund portfolio strategy I did research on, but I am averse to REITS and some other selections in it. Curious anyone&#39;s thoughts on what I&#39;ve got here. Moving forward I think I will just look at what&#39;s &quot;down&quot; and buy more shares of that.</p>\n\n<p>It&#39;s been performing fairly well for how messy it is. I also think I am international heavy and considering paring back on that at the end of the year, but it could also be a good hedge against the expensive US P/E.</p>\n\n<p>Lastly, VFTAX was my wife&#39;s selection. I told her to pick a fund and she chose that one. Might pick up some of the ETF as well. Hasn&#39;t varied too far from SP500 regular, and has a .1% higher expense ratio. Not too concerned about it.. good karma I suppose.</p>\n\n<p>This is a taxable account separate from our retirements and savings... goal is to buy a sweet house and car(s) in 10-15 years. We are both 30 years old.</p>\n\n<p>Thanks for reading</p>\n</div><!-- SC_ON -->",
  "score": 38,
  "permalink": "/r/Bogleheads/comments/ndcyy2/20_of_every_paycheck_into_an_etf/",
  "subreddit": "Bogleheads",
  "id": "ndcyy2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590802224
}