{
  "author": "Ok_Substance_1560",
  "the_new_excerpt": "I feel like this is partly the reason why my career is just starting at 33 years\nold. I can't ask for promotions at a place that I can't be passionate about. I\nalso can't be one of the ONLY people busting ass. It's too exhausting, and it\nrarely pays off. Am I the only feeling this way?",
  "original_created_utc": 1619646337,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "33歳でキャリアが始まったばかりなのは、そのせいもあるような気がします。\n歳。情熱を持てない場所では、昇進を求めることはできません。I\nまた、自分だけが頑張っているということもありません。疲れるし、報われることはほとんどありません。\n疲れるし、報われることも少ない。このように感じているのは私だけでしょうか？",
      "title": "ベストを尽くそうと期待して新しい仕事を始めても、有害な職場、ひどい人々、プロ意識のなさを目の当たりにして、「もういいや」となってしまうのは私だけでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得这就是为什么我的事业在33岁时才开始的部分原因\n岁。我不能要求在一个我不能热衷的地方获得晋升。I\n我也不能成为唯一的人，在那里拼命工作。这太累了，而且\n很少能得到回报。我是唯一有这种感觉的人吗？",
      "title": "难道只有我一个人在开始一份新工作时，满怀希望地想尽我所能，看到有毒的工作场所、糟糕的人和不专业的行为，然后说 \"见鬼去吧\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得這就是爲什麼我的事業在33歲時纔開始的部分原因\n歲。我不能要求在一個我不能熱衷的地方獲得晉升。I\n我也不能成爲唯一的人，在那裏拼命工作。這太累了，而且\n很少能得到回報。我是唯一有這種感覺的人嗎？",
      "title": "難道只有我一個人在開始一份新工作時，滿懷希望地想盡我所能，看到有毒的工作場所、糟糕的人和不專業的行爲，然後說 \"見鬼去吧\"？"
    }
  ],
  "title": "Am I the only one that starts a new job with high hopes of doing my best, sees the toxic workplace, terrible people, and unprofessionalism, and says \"the hell with it?\"",
  "created_utc": 1619654458,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I feel like this is partly the reason why my career is just starting at 33 years old. I can&#39;t ask for promotions at a place that I can&#39;t be passionate about. I also can&#39;t be one of the ONLY people busting ass. It&#39;s too exhausting, and it rarely pays off. Am I the only feeling this way?</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/NoStupidQuestions/comments/n0pn7f/am_i_the_only_one_that_starts_a_new_job_with_high/",
  "subreddit": "NoStupidQuestions",
  "id": "n0pn7f",
  "is_self": true,
  "media": null,
  "is_video": false
}