{
  "author": "sgtslaughterTV",
  "original_created_utc": 1640334980,
  "title": "Anyone else have the same journey as me with bitcoin? Leaving bitcoin thinking alts are \"superior technology\", then coming back to bitcoin?",
  "created_utc": 1640377930,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Let me preface this by saying I tell new people, &amp;quot;If you want to make money the only strategy that has held up is buying and holding bitcoin for 4 years.&amp;quot; and, &amp;quot;The only coin that has managed to stay at the top of the charts is Bitcoin. When bitcoin drops 5%, altcoins drop anywhere from 10-50%. Just buy bitcoin and hold it a long time. Use money you don&amp;#39;t need to buy it, and you will be pleasantly surprised a few years from today.&amp;quot;               &lt;/p&gt;\n\n&lt;p&gt;However, I too also fell in to the &amp;quot;superior technology fallacy&amp;quot; that a lot of altcoins promised but either A) failed to deliver on or B) delivered with an unacceptable level of centralization. I went with altcoins over the years thinking, &amp;quot;It&amp;#39;s just a matter of time until they surpass bitcoin.&amp;quot; But that never happened for various reasons.                  &lt;/p&gt;\n\n&lt;p&gt;The one thing that bothers me now is the amount of new people we have saying dumb shit with regards to altcoins being &amp;quot;superior&amp;quot; to bitcoin without any well-formulated research on the topic at hand - and yes, that includes people like Elon Musk influencing people to buy new shitcoins or shitcoins that have higher inflation than what is considered a &amp;quot;healthy&amp;quot; amount of inflation in a growing economy.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 161,
  "permalink": "/r/Bitcoin/comments/rni07p/anyone_else_have_the_same_journey_as_me_with/",
  "subreddit": "Bitcoin",
  "id": "rni07p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Let me preface this by saying I tell new people, \"If you want to make money the\nonly strategy that has held up is buying and holding bitcoin for 4 years.\" and,\n\"The only coin that has managed to stay at the top of the charts is Bitcoin.\nWhen bitcoin drops 5%, altcoins drop anywhere from 10-50%.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "前置きが長くなりましたが、私は初対面の人に「お金を儲けたいなら\n唯一持ちこたえた戦略は、ビットコインを4年間買い続けることだ」と。\n\"チャートで上位を維持できているコインはビットコインだけです。\nビットコインが5％下がると、アルトコインは10～50％下がる......。",
      "title": "私と同じようにビットコインで旅をしている方はいらっしゃいますか？アルトが「優れた技術」だと考えてビットコインを離れ、その後、ビットコインに戻ってきた人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我先说一下，我告诉新人们，\"如果你想赚钱，唯一的策略就是购买和持有比特币。\n唯一坚持下来的策略就是购买并持有比特币4年\"。\n\"唯一能够保持在榜首的币种是比特币。\n当比特币下跌5%时，另类币的跌幅在10-50%之间....",
      "title": "有谁和我一样有比特币的历程？离开了比特币，认为alts是 \"高级技术\"，然后又回到了比特币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我先說一下，我告訴新人們，\"如果你想賺錢，唯一的策略就是購買和持有比特幣。\n唯一堅持下來的策略就是購買並持有比特幣4年\"。\n\"唯一能夠保持在榜首的幣種是比特幣。\n當比特幣下跌5%時，另類幣的跌幅在10-50%之間....",
      "title": "有誰和我一樣有比特幣的歷程？離開了比特幣，認爲alts是 \"高級技術\"，然後又回到了比特幣？"
    }
  ]
}