{
  "author": "Devilheart",
  "original_created_utc": 1626132957,
  "title": "It was not a 'hacker' who stole coins from the guy's Metamask",
  "created_utc": 1626144173,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is regarding the recent post about the guy who lost some 130k worth of savings from his Metamask waller because some &quot;hacker&quot; took it. This seems to be creating a lot of FUD because it could happen to anyone, right?</p>\n\n<p>Except there was no &#39;hack&#39; that got someone into his wallet. He gave away his passphrase on a random site. </p>\n\n<p>That&#39;s like leaving your physical wallet at the bar and then saying a &#39;pickpocket&#39; got it.</p>\n\n<p>Not going to give an opinion on whether it actually happened or OP made the story up, but it was worded to make it look like he was the victim of a hack. Which is not the case.</p>\n\n<p>This is just an obligatory FUD removal post.</p>\n</div><!-- SC_ON -->",
  "score": 290,
  "permalink": "/r/CryptoCurrency/comments/oj3cfo/it_was_not_a_hacker_who_stole_coins_from_the_guys/",
  "subreddit": "CryptoCurrency",
  "id": "oj3cfo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is regarding the recent post about the guy who lost some 130k worth of\nsavings from his Metamask waller because some \"hacker\" took it. This seems to be\ncreating a lot of FUD because it could happen to anyone, right?\n\nExcept there was no 'hack' that got someone into his wallet. He gave away…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、最近の投稿にある、メタマスクのウォーラーで130k相当の貯金を失った人の話です。\nハッカー」に取られてしまったために、メタマスクのウォーラーから13万円分の貯金を失った人についての最近の投稿についてです。これは\n誰にでも起こりうることなので、多くのFUDを生み出しているようですね。\n\nただし、彼の財布を誰かに盗られるような「ハッキング」はありませんでした。彼は...",
      "title": "男のメタマスクからコインを盗んだのは「ハッカー」ではない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是关于最近的一个帖子，说的是一个人从他的Metamask壁挂炉中失去了价值约13万的储蓄。\n因为一些 \"黑客 \"拿走了他的Metamask waller中的储蓄。这似乎是在\n因为这可能发生在任何人身上，对吗？\n\n除了没有 \"黑客 \"让人进入他的钱包。他给了...",
      "title": "不是 \"黑客 \"从这家伙的Metamask中偷了钱币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是關於最近的一個帖子，說的是一個人從他的Metamask壁掛爐中失去了價值約13萬的儲蓄。\n因爲一些 \"黑客 \"拿走了他的Metamask waller中的儲蓄。這似乎是在\n因爲這可能發生在任何人身上，對嗎？\n\n除了沒有 \"黑客 \"讓人進入他的錢包。他給了...",
      "title": "不是 \"黑客 \"從這傢伙的Metamask中偷了錢幣"
    }
  ]
}