{
  "author": "Nervous_Sky_5167",
  "the_new_excerpt": "ABSTRACT\n\nBitcoin will consolidate and sit relatively even at its newfound support lines\n(37.5k USD - 40.5k USD) from a few days to 1.5 weeks at most, before blasting\noff to reclaim the bull-market support band at around 43k USD - 48k USD.\n\nFUNDAMENTAL REASONS\n\nBitcoin is post-Wyckoff distribution,…",
  "original_created_utc": 1623712675,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ABSTRACT\n\nビットコインは、新たに発見されたサポートライン（37.5k USD～40.5k USD）で、数日から1.5週間程度、比較的安定して推移するだろう。\n(37.5k USD - 40.5k USD)で数日から長くても1.5週間程度固まって、その後に\n数日から1.5週間程度、比較的安定した状態で推移した後、43kドル～48kドル付近の強気相場のサポートバンドを取り戻すために爆発するだろう。\n\nファンダメンタルズ\n\nビットコインはポスト・ウィックオフ・ディストリビューション、...",
      "title": "ビットコインの短期テクニカル分析"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "ABSTRACT\n\n比特币将在其新发现的支撑线上进行盘整并保持相对平衡\n(37.5千美元-40.5千美元)，最多几天到1.5周的时间，然后就会爆出\n的牛市支撑带，大约在43000美元-48000美元。\n\n基本原因\n\n比特币是Wyckoff分布后，...",
      "title": "比特币的短期技术分析"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "ABSTRACT\n\n比特幣將在其新發現的支撐線上進行盤整並保持相對平衡\n(37.5千美元-40.5千美元)，最多幾天到1.5周的時間，然後就會爆出\n的牛市支撐帶，大約在43000美元-48000美元。\n\n基本原因\n\n比特幣是Wyckoff分佈後，...",
      "title": "比特幣的短期技術分析"
    }
  ],
  "title": "Short-term Technical Analysis on Bitcoin",
  "created_utc": 1623756789,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>ABSTRACT</strong></p>\n\n<p>Bitcoin will consolidate and sit relatively even at its newfound support lines (37.5k USD - 40.5k USD) from a few days to 1.5 weeks at most, before blasting off to reclaim the bull-market support band at around 43k USD - 48k USD.</p>\n\n<p><strong>FUNDAMENTAL REASONS</strong></p>\n\n<p>Bitcoin is post-Wyckoff distribution, and that is certain from its historical trend (Fig. 1) and textbook reference (Fig. 2). To a great degree of certainty, most distribution patterns of the sort often proceed with an accumulation phase, of which Bitcoin so far as demonstrated (Fig. 3) when compared to a textbook model chart (Fig. 4). If current markers are demonstrated to such a precise degree, there is nothing fundamentally wrong with Bitcoin continuing and completing the trend, which would be to consolidate (meaning stagnant) preceding a major pump.</p>\n\n<p>&#x200B;</p>\n\n<p>As for why these fundamentals exist in Bitcoin&#39;s current market, you must think back to why Wyckoff patterns exist. These hallmark patterns exist due to the presence of market manipulation, where massive institutions and organizations attempt to maximize profits to the detriment of most HODLers and traders because in their capitalistic nature, they aren&#39;t here to play charity. Everyone keeps hoping for institutionalized interest, and well, ya got it now.</p>\n\n<p>&#x200B;</p>\n\n<p>Now think of Elon Musk&#39;s tweets, the FUD from WSJ and the alarming block chain analysis of major Bitcoin movements and correlate them to specific timelines of the Wyckoff model. Of course, it makes sense now! These patterns exist because this distribution phase is designed by the path of least resistance to shake off as many traders and bag holders in the profit of institutions.</p>\n\n<p>&#x200B;</p>\n\n<p>Now onto why an accumulation phase often happens right after a distribution phase. The institutions are simply not done with Bitcoin yet. In a post-distributive phase, these organizations now attempt to keep prices in a channel and repress any major volatility in order to slowly stack up and fill more bags of Bitcoin unbeknownst to the public. This phase is almost always done preceding a major move to the upside.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/faep51lp2b571.png?width=1488&amp;format=png&amp;auto=webp&amp;s=0a3448fcdd364d375c084c8a32b2af6649174d0f\">Fig. 1, a  representation of Bitcoin&#39;s previous trends with Wyckoff distribution markers.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/c5zt8jq23b571.jpg?width=975&amp;format=pjpg&amp;auto=webp&amp;s=ee76accfd82cc71d344d2a9fc8813afe78744bc2\">Fig. 2, a textbook derivative of Wyckoff distribution (StockCharts, n.d.).</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/fsigw3qz3b571.png?width=1486&amp;format=png&amp;auto=webp&amp;s=c4d2e6c1b5b6b2a39c37d987c03d2a0ddbee8283\">Fig. 3, a representation of Bitcoin&#39;s recent trend&#39;s with Wyckoff accumulation markers.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/kkb2o2d94b571.png?width=975&amp;format=png&amp;auto=webp&amp;s=61cc8d6933ccb3d4cf51687f97c7e68d9af40141\">Fig. 4, a textbook model derivative of Wyckoff accumulation (StockCharts, n.d.).</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>TECHNICAL REASONS</strong></p>\n\n<p>As of June 14th, 2021, Bitcoin has extremely undersold RSI and stochastic trends, indicative of a imminent market correction that lasts at max a week (Fig. 5). However, our newfound resistance/support level of 38.5k USD and an important psychological barrier of 40k should, with a little bit of luck, keep Bitcoin&#39;s price stable enough at 39-40k in order to ramp up buying strength again (Fig. 5).</p>\n\n<p>&#x200B;</p>\n\n<p>Fig. 5 is also a graph showing specific Fibonacci market resistance lines and time scale lines, showing the immense pocket of support (and resistance) we are currently in. This is further evidence to keep prices stable in the short-term for RSI valuations to get up to speed and top off the accumulation trend with a relief rally.</p>\n\n<p>&#x200B;</p>\n\n<p>Another reason for a bullish relief rally is due to a specific stock trading pattern (Fig. 6). As shown by the graph, there has been considerable resistance causing consistent lower high&#39;s in Bitcoin&#39;s recent charts. To have this bit of resistance broken certainly spells good fortune.</p>\n\n<p>&#x200B;</p>\n\n<p>Just for some quality assurance that I&#39;m not some kind of shill jumping on random trends, I saw this pump coming a long, long way. Fig. 7 was a graph I had drawn on the 3rd of June for a proof of concept idea in order to prove that I saw this coming the long way. Was just busy back testing certain algorithms and barely had time to really work on it until now.</p>\n\n<p>&#x200B;</p>\n\n<p>Now onto the meat and potatoes. Historical emulations from the 2013 double peak cycle hints on a heavy resurgence or relief rally too before a double peak (Fig. 8), extrapolated from well, <em>the 2013 cycle.</em> As for what fundamental reasons matched the current cycle and what had happened 8 years ago, institutionalized investment and a price advantage variable had caused Bitcoin to hit a logarithmic regression peak, causing an imminent correction. More of this will be explained in further posts.</p>\n\n<p>As well, the presence of Wyckoff theorems in both cycles provides the final glue to the notable similarities of these two timelines. The only difference is the accumulation time, where 2013&#39;s lasted a few days while our current cycle is sitting at around a couple of weeks. This is the only unexplainable reason, which can be due to an unlucky stochastic RSI shift that made Bitcoin lose a lot of momentum in the current cycle. Again, more of this will be explained in future posts.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/py928zoi7b571.png?width=1497&amp;format=png&amp;auto=webp&amp;s=ed5e90adf014707f013413dec5fc972f0e0d34e1\">Fig. 5, a graph of which the first row of indicators listing the high or &#39;undersold&#39; weekly stochastic and individual RSI. The &#39;rainbow spread chart&#39; or Fibonacci speed fan lists the various levels. The upper two white lines of resistance show the psychological support of 40k. </a></p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/pld8pbwdcb571.png?width=1484&amp;format=png&amp;auto=webp&amp;s=a6d700431c23b5723ab1e7ec7fcc356b9aaa0236\">Fig. 6, a graph showing the recent resistance breakout of a bearish trend that lasted nearly a month.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/62044gky8b571.png?width=1488&amp;format=png&amp;auto=webp&amp;s=a9dee84fe398ca72eb67f65ebc31fc5582a1dd8c\">Fig. 7, a proof of concept Wyckoff accumulation graph drawn weeks prior to our current situation for a foundation of proof. The yellow trend line was an experimental emulation of what was expected to happen based on historical information. </a></p>\n\n<p><a href=\"https://preview.redd.it/mm0a4ce3ab571.png?width=1486&amp;format=png&amp;auto=webp&amp;s=e78fe843e79c7753db8dc7389debbfa402a6aeb2\">Fig. 8, experimental emulations of the 2013 cycle extrapolated on the current timeline. Should only be taken for it&#39;s generalized idea, not specific market movements.</a></p>\n\n<p><strong>TO CONCLUDE</strong></p>\n\n<p>Heavy market manipulation, strong bullish indicators, and overall a bullish sentiment shown! Institutions are in the game now, and your now in their sandbox! If you like this content and want more of it, I&#39;ll be happy to provide! In this space, we all have the right to good content. Happy trading folks!</p>\n\n<p><em>Disclaimer: I am not a licensed financial advisor nor does this content attempt to replicate any of the sort. This content is listed strictly for entertainment and educational purposes. When in doubt, contact a professional. Your money, your problem.</em></p>\n\n<p><strong>References or pictures unoriginal to me</strong></p>\n\n<p>StockCharts. (n.d.). <em>The Wyckoff Method: A Tutorial</em>. StockCharts. Retrieved from <a href=\"https://school.stockcharts.com/doku.php?id=market_analysis:the_wyckoff_method\">https://school.stockcharts.com/doku.php?id=market_analysis:the_wyckoff_method</a></p>\n\n<p>Edit: Typo on figure numbers</p>\n</div><!-- SC_ON -->",
  "score": 192,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/2GchqXVw2ZlWMQG_9IwoGcYkrwn90a5xV9H8O7OPkGE.jpg?auto=webp&s=5509dd0a0499ca678760506e54425f817096be79",
          "width": 975,
          "height": 857
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/2GchqXVw2ZlWMQG_9IwoGcYkrwn90a5xV9H8O7OPkGE.jpg?width=108&crop=smart&auto=webp&s=9ec60faf7bbc02f087701efc72cd642c45b16b1e",
            "width": 108,
            "height": 94
          },
          {
            "url": "https://external-preview.redd.it/2GchqXVw2ZlWMQG_9IwoGcYkrwn90a5xV9H8O7OPkGE.jpg?width=216&crop=smart&auto=webp&s=c41270d9d5fd415364e85904d0005542b7c8123e",
            "width": 216,
            "height": 189
          },
          {
            "url": "https://external-preview.redd.it/2GchqXVw2ZlWMQG_9IwoGcYkrwn90a5xV9H8O7OPkGE.jpg?width=320&crop=smart&auto=webp&s=6e0f070360a643e94ff5ad765d28f8a033f269c1",
            "width": 320,
            "height": 281
          },
          {
            "url": "https://external-preview.redd.it/2GchqXVw2ZlWMQG_9IwoGcYkrwn90a5xV9H8O7OPkGE.jpg?width=640&crop=smart&auto=webp&s=47edc4caa731cbf75d1b803d4650941c05a1c156",
            "width": 640,
            "height": 562
          },
          {
            "url": "https://external-preview.redd.it/2GchqXVw2ZlWMQG_9IwoGcYkrwn90a5xV9H8O7OPkGE.jpg?width=960&crop=smart&auto=webp&s=2979c8937d42a9ae8e0a6df4b6442b4aa9393aba",
            "width": 960,
            "height": 843
          }
        ],
        "variants": {},
        "id": "ajZNWBsVks0mTqZqNwcx42a49I_8UnZLPbQinFZPyJs"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/nzzuhk/shortterm_technical_analysis_on_bitcoin/",
  "subreddit": "CryptoCurrency",
  "id": "nzzuhk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009738597
}