{
  "author": "benji9t3",
  "the_new_excerpt": "I used to think personalised ads were a bit icky and invasive. And I guess they\nare as they're keeping records of your habits. But after a while I got used to\nthem and started to think do I really care? If the worst they are going to do is\nadvertise things I like, I can live with that. To be honest…",
  "original_created_utc": 1623052328,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "以前は、パーソナライズド広告はちょっと不愉快で侵略的なものだと思っていました。思うに、それは\nあなたの習慣を記録しているのですから。しかし、しばらくすると、私はそれらに慣れて\nでも、しばらくすると慣れてきて、本当に気にする必要があるのかと考えるようになりました。最悪の場合、私が好きなものを宣伝してくれるのであれば\n私が好きなものを宣伝してくれるなら、それでいいと思う。正直言って...。",
      "title": "企業が私たちのデータを盗むことは、本当に悪いことなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我曾经认为个性化的广告有点恶心和侵入性。我想它们\n是的，因为他们在记录你的习惯。但过了一段时间，我就习惯了\n并开始思考我是否真的在乎？如果他们要做的最坏的事情是\n宣传我喜欢的东西，我可以接受。说实话...",
      "title": "公司窃取我们的数据真的那么糟糕吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾經認爲個性化的廣告有點噁心和侵入性。我想它們\n是的，因爲他們在記錄你的習慣。但過了一段時間，我就習慣了\n並開始思考我是否真的在乎？如果他們要做的最壞的事情是\n宣傳我喜歡的東西，我可以接受。說實話...",
      "title": "公司竊取我們的數據真的那麼糟糕嗎？"
    }
  ],
  "title": "Is companies stealing our data really that bad?",
  "created_utc": 1623102290,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I used to think personalised ads were a bit icky and invasive. And I guess they are as they&#39;re keeping records of your habits. But after a while I got used to them and started to think do I really care? If the worst they are going to do is advertise things I like, I can live with that. To be honest I&#39;ve rarely found it a bad thing. A little annoying seeing repetitive ads, but there&#39;s been times I&#39;ve actually found stuff I want because of this type of advertising. As long as you keep your wits about you as a consumer and shop around for a reputable vendor and a reasonable price you&#39;ll be fine. Generally if I see something advertised on Facebook, I can find it elsewhere from a bigger retailer for cheaper.</p>\n\n<p>I know there&#39;s a number of slippery slope arguments you can make about normalising the collecting of data on you but that&#39;s really all speculation and conspiracy theory territory. Personally I think there&#39;s a level of anonymity in complete transparency. If someone&#39;s got data on a billion people&#39;s browsing habits why would they care about mine. It&#39;s like how there&#39;s thousands of cameras running 24/7 in every city now, I feel like it actually lowers the chances of anyone singling you out in the crowds. Imagine you walk down the street and do something illegal; buy some drugs or steal something. What&#39;s the chances that someone is gonna notice that among the thousands of hours of footage recorded of that street that day? I kinda feel like it&#39;s the same with browsing. Do I really care if Google knows I searched for something kinda embarrassing when millions of people have likely searched for worse?</p>\n\n<p>I might be completely off here. Maybe I didn&#39;t consider some possibilities. But I&#39;d be interested to see how other people feel about it. Does it scare you? Or are you indifferent?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/TrueAskReddit/comments/nu6yrp/is_companies_stealing_our_data_really_that_bad/",
  "subreddit": "TrueAskReddit",
  "id": "nu6yrp",
  "is_self": true,
  "media": null,
  "is_video": false
}