{
  "author": "chinmakes5",
  "original_created_utc": 1652709048,
  "title": "Why are both sides blaming the baby formula shortage on the government and not on the manufacturer?",
  "created_utc": 1652755800,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I hear both sides saying this is on the government. Why?  They manufacture a very expensive product for what it is, BECAUSE they have to have a lot of QC as they are feeding infants. &lt;/p&gt;\n\n&lt;p&gt;I keep hearing how the government didn&amp;#39;t come down on them hard enough earlier, but why TF when they got caught, were accused earlier and didn&amp;#39;t fix it is that on the government and not the manufacturer?  Especially when so much of the nation&amp;#39;s supply is coming out of that one plant? &lt;/p&gt;\n\n&lt;p&gt;Are we so far gone that we will find it acceptable to sicken or kill a few babies if it means a company can hit it&amp;#39;s quarterly goals, the only reason to not do that is if government regulators come down on them?  Yet so many people are complaining about government getting in the way.&lt;/p&gt;\n\n&lt;p&gt;And I&amp;#39;ll get on my soapbox and say that other than the cost of the downtime and cleaning, it won&amp;#39;t harm the company.   They have like 60% of the market, no one is coming in and competing with them even though lots of people will be yelling capitalism will take care of this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/Ask_Politics/comments/uqwg2d/why_are_both_sides_blaming_the_baby_formula/",
  "subreddit": "Ask_Politics",
  "id": "uqwg2d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I hear both sides saying this is on the government. Why? They manufacture a very\nexpensive product for what it is, BECAUSE they have to have a lot of QC as they\nare feeding infants.\n\nI keep hearing how the government didn't come down on them hard enough earlier,\nbut why TF when they got caught,…"
}