{
  "author": "simplelifestyle",
  "the_new_excerpt": "FIRST NATION EVER TO ADOPT BITCOIN AS LEGAL TENDER!\n\nA few years back these news would have broken the front page.\n\nThese are great news for the WHOLE WORLD. It shows that we can achieve unity,\nhonesty, integrity, that we can change things for good and get rid of the old\ncorruption.\n\nAlso in the…",
  "original_created_utc": 1622950358,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "世界で初めて、ビットコインを法定通貨として採用\n\n数年前であれば、このニュースは一面を飾っていたでしょう。\n\nこれらは全世界にとって素晴らしいニュースです。このニュースは、私たちが団結できることを示しています。\nこれは、私たちが団結し、正直で、誠実で、物事を良い方向に変え、古い腐敗を取り除くことができることを示しています。\n腐敗をなくすことができるということです。\n\nまた、このニュースは...",
      "title": "この大規模なニュースは、300万人の会員を持つサブサイトではほとんど反応がないのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "第一个将比特币作为法定货币的国家!\n\n几年前，这些新闻会打破头版。\n\n这些对整个世界来说是个好消息。它表明，我们可以实现团结。\n诚实，正直，我们可以改变事情，摆脱旧的\n腐败。\n\n此外，在...",
      "title": "WTF, 这个巨大的新闻在300万会员的子网站上几乎没有得到反应？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "第一個將比特幣作爲法定貨幣的國家!\n\n幾年前，這些新聞會打破頭版。\n\n這些對整個世界來說是個好消息。它表明，我們可以實現團結。\n誠實，正直，我們可以改變事情，擺脫舊的\n腐敗。\n\n此外，在...",
      "title": "WTF, 這個巨大的新聞在300萬會員的子網站上幾乎沒有得到反應？"
    }
  ],
  "title": "WTF, This MASSIVE news barely get a reaction on a 3 million members sub?",
  "created_utc": 1622973663,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>FIRST NATION EVER TO ADOPT BITCOIN AS LEGAL TENDER!</p>\n\n<p>A few years back these news would have broken the front page.</p>\n\n<p>These are great news for the WHOLE WORLD. It shows that we can achieve unity, honesty, integrity, that we can change things for good and get rid of the old corruption.</p>\n\n<p>Also in the cryptocurrency sub these posts are getting downvoted (BTW that sub just surpassed <a href=\"/r/bitcoin\">r/bitcoin</a> for the very first time ever in members).</p>\n\n<p>I&#39;m thinking somebody powerful is paying por a massive cybercampaign against bitcoin?</p>\n\n<p>Edit---&gt; Also go read this if you haven&#39;t or you think these are not huge news:</p>\n\n<p><a href=\"https://old.reddit.com/r/Bitcoin/comments/nt8hi6/im_from_el_salvador_and_im_here_to_clarify_some/\">https://old.reddit.com/r/Bitcoin/comments/nt8hi6/im_from_el_salvador_and_im_here_to_clarify_some/</a></p>\n\n<blockquote>\n<p>Hello, I&#39;m from El Salvador so I&#39;d like to give you all some information that might help you clarify things. I posted this in another thread and made some slight edits.</p>\n\n<p>First some info of the current zeitgeist in El Salvador:</p>\n\n<p>The president&#39;s party, Nuevas Ideas (New Ideas), was formed in 2018-2019 as a new alternative to the old bipartisan, marxist-left (FMLN) and ultranationalist right (ARENA) system that had controlled the government since the end of the Civil War in 1992. He won the presidential elections in 2019 with 52% of the vote (overwhelming majority) and just recently won the legislative elections in 2021 by a landslide (73% of the vote). That means that his party controls the Congress with 2/3 of the legislators, which are enough to pass any bill that they want, and in fact that&#39;s what they&#39;ve been doing.</p>\n\n<p>His party is made up of mostly young professionals tired of the corrupt system that has kept the country poor and underdeveloped for the past 30 years. In just their first day in office they fired the Attorney General (who had been protecting other corrupt politicians) and 5 other magistrates, accused of being bought by the oligarchy to protect their economic interests. In just a month, the new Congress has approved unprecedented financing for education and infrastructure and has passed bills that make sure that the predatory economic elites that used to buy politicians in the past are kept in check. Many big infrastructure projects are expected to be approved by Congress soon, including the construction of a high-speed railway and a new international airport.</p>\n\n<p>One of the biggest projects that the government is building is called Surf City, which is basically road, electricity and communications infrastructure along the coastline to help small businesses. In fact, for this very reason, the ISA decided to hold the World Surfing Games (which are happening until tomorrow) to qualify for the Tokyo 2021 Olympics in El Salvador. Bitcoin is already used by small businesses in this area, especially in El Zonte, which is one of the more popular beaches that gets a lot of international tourists.</p>\n\n<p>I know most people used to have the notion that El Salvador was a dumpster fire, because we were. However, the country is going through huge change. Just yesterday the ex-mayor of San Salvador (the capital) was captured by the police and is awaiting trial for corruption and gang financing and also the ex-first lady was sentenced to 10 years in prison for money laundering. El Salvador is no longer on the top 10 list of most violent countries in the world (the murder rate used to be 12-15 homicides daily and has decreased to nearly 3-4 daily since Bukele took office) and our economy is expected to grow steadily too.</p>\n\n<p>Bukele (39 years old) is extremely popular, with an approval rating of over 90% during his second year in office. Mostly due to this forward thinking. You can see this with the data related to the pandemic. El Salvador is the Central American country with the lowest mortality rate (due to a massive revamp of our healthcare system), the lowest number of COVID-19 cases and the fastest rate of vaccine applications, having just surpassed the 2 million mark. The government also just launched a project to give laptops to 100% of the students of the public school system. The country still has massive challenges to overcome but I&#39;m confident we are on a very good path.</p>\n\n<p>The adoption of Bitcoin as legal tender is HUGE news for this country. I assure you that Congress will pass this bill. I couldn&#39;t give you an exact date, but the economics commission will probably receive all the papers this week.</p>\n\n<p>I&#39;ll try to answer any questions that you guys might have.</p>\n\n<p>UPDATE: Most legislators have come forward saying they will back the bill. </p>\n\n<p>Some useful links:</p>\n\n<p>Bitcoin in El Salvador as of today:<a href=\"https://www.youtube.com/watch?v=-G9cmff81fc\">https://www.youtube.com/watch?v=-G9cmff81fc</a> (Spanish)</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=7VV0A_favrk\">https://www.youtube.com/watch?v=7VV0A_favrk</a> (Spanish)</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=95tNWXADX14\">https://www.youtube.com/watch?v=95tNWXADX14</a> (English)</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=W4XcHi_NXl8\">https://www.youtube.com/watch?v=W4XcHi_NXl8</a> (Spanish)</p>\n\n<p>The Surf City project (which is where Bitcoin will most likely flourish):</p>\n\n<p><a href=\"https://www.latimes.com/sports/olympics/story/2021-06-04/el-salvador-is-riding-the-waves-as-global-surfings-newest-mecca\">https://www.latimes.com/sports/olympics/story/2021-06-04/el-salvador-is-riding-the-waves-as-global-surfings-newest-mecca</a></p>\n\n<p><a href=\"https://www.youtube.com/watch?v=Wna7x7O25lA\">https://www.youtube.com/watch?v=Wna7x7O25lA</a> (English)</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=aznk1VSpqHA\">https://www.youtube.com/watch?v=aznk1VSpqHA</a> (English)</p>\n</blockquote>\n\n<p>Also watch this video of Jack Mallers and the President of El Salvador:</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=-Vcgy1wli9k\">https://www.youtube.com/watch?v=-Vcgy1wli9k</a></p>\n\n<p>Edit 2: Maybe we need a Mega-Thread for these news. </p>\n\n<p>Also, please report the numerous anti-bitcoin trolls that are popping up in all the posts. If you check their comment history you&#39;ll see they are working full-time bashing bitcoin and spreading lies and misinformation.</p>\n</div><!-- SC_ON -->",
  "score": 530,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/dcg8xD-rl3DSVM2y3iNvfSUA1f_IxJ-QpFLEazXfzvc.jpg?auto=webp&s=ae7b458c88d7544b01fe482e4bd4eeab7f0995c8",
          "width": 480,
          "height": 360
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/dcg8xD-rl3DSVM2y3iNvfSUA1f_IxJ-QpFLEazXfzvc.jpg?width=108&crop=smart&auto=webp&s=fd2ea47bf132f574cddfff49fc40d323decb4ed1",
            "width": 108,
            "height": 81
          },
          {
            "url": "https://external-preview.redd.it/dcg8xD-rl3DSVM2y3iNvfSUA1f_IxJ-QpFLEazXfzvc.jpg?width=216&crop=smart&auto=webp&s=aeb51784f389bd00e401e7675307dbca7adf4a72",
            "width": 216,
            "height": 162
          },
          {
            "url": "https://external-preview.redd.it/dcg8xD-rl3DSVM2y3iNvfSUA1f_IxJ-QpFLEazXfzvc.jpg?width=320&crop=smart&auto=webp&s=37826f51a25071474d0bd274ce7bcfbec0895a16",
            "width": 320,
            "height": 240
          }
        ],
        "variants": {},
        "id": "Bw_TTxKgfLubCyAiu48qX24eglpIkxiMS-QFcVDMNaw"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/ntcl1x/wtf_this_massive_news_barely_get_a_reaction_on_a/",
  "subreddit": "Bitcoin",
  "id": "ntcl1x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404878612
}