{
  "author": "Aggressive_Ferret",
  "original_created_utc": 1638168647,
  "title": "Is what this girl does creepy?",
  "created_utc": 1638183454,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>OP here, extra info</p>\n\n<p>Theres this girl and shes a junior in college (16) and im a freshman in college (18) and shes liked me for a long time. And shes super obsessive over everything and controlling even though we aren&#39;t dating. I talked to her about her actions and I told her they were creepy which she said they weren&#39;t. Some of these actions include screenshotting my parents instagram stories (whenever I am in one of the stories), she somehow has a picture of my closet with my clothes (she has never been to my house), etc. I feel as if because she is younger than me and a female and I am a male, most people will view this as fine. But if the roles were reversed and I was doing this I think I would likely be classified as a pedophile/perv. Do you guys think her behavior is creepy/obsessive.</p>\n</div><!-- SC_ON -->",
  "score": 118,
  "permalink": "/r/TooAfraidToAsk/comments/r4ptaj/is_what_this_girl_does_creepy/",
  "subreddit": "TooAfraidToAsk",
  "id": "r4ptaj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "OP here, extra info\n\nTheres this girl and shes a junior in college (16) and im a freshman in college\n(18) and shes liked me for a long time. And shes super obsessive over everything\nand controlling even though we aren't dating. I talked to her about her actions\nand I told her they were creepy which…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "OPここで、余分な情報\n\nこの子は大学3年生(16歳)で、私は大学1年生なんです。\n(18)で、彼女はずっと前から僕のことが好きだった。そして、彼女は何事にもすごく執着していて\n付き合っているわけでもないのに支配的です。私は彼女の行動について話しました。\n気持ち悪いって言ったんだけど...。",
      "title": "この子のやっていることは、気持ち悪いですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这里，OP，额外的信息\n\n有一个女孩，她是大三学生（16岁），我是大一学生。\n(18岁)，她喜欢我很久了。她对所有的事情都非常着迷\n和控制欲，尽管我们并没有约会。我跟她谈过她的行为\n我告诉她这些行为令人毛骨悚然......",
      "title": "这个女孩所做的事令人毛骨悚然吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這裏，OP，額外的信息\n\n有一個女孩，她是大三學生（16歲），我是大一學生。\n(18歲)，她喜歡我很久了。她對所有的事情都非常着迷\n和控制慾，儘管我們並沒有約會。我跟她談過她的行爲\n我告訴她這些行爲令人毛骨悚然......",
      "title": "這個女孩所做的事令人毛骨悚然嗎？"
    }
  ]
}