{
  "author": "dragondude4",
  "original_created_utc": 1658417085,
  "title": "A Coinbase Product Manager was Just Charged With Insider Trading and Arrested While Trying to Flee the Country",
  "created_utc": 1658428584,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;From the Justice Department:&lt;/p&gt;\n\n&lt;p&gt;Beginning in approximately October 2020, ISHAN WAHI worked at Coinbase as a product manager assigned to a Coinbase asset listing team. In that role, ISHAN WAHI was involved in the highly confidential process of listing crypto assets on Coinbase’s exchanges and had detailed and advanced knowledge of which crypto assets Coinbase was planning to list and the timing of public announcements about those crypto asset listings.  Beginning at least in August 2021 and continuing through May 2022, ISHAN WAHI was a member of a private Coinbase messaging channel reserved for a small number of Coinbase employees with direct involvement in the Coinbase asset listing process.  The private channel was used to discuss, among other things, “exact announcement / launch dates + timelines” that Coinbase did not wish to share with all of its employees.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;The Insider Trading Scheme:&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;On at least 14 occasions beginning at least in June 2021 and continuing through April 2022, ISHAN WAHI knew in advance both that Coinbase planned to list particular crypto assets and the timing of Coinbase’s public announcements of those asset listings and misappropriated that Coinbase confidential information by tipping either his brother, NIKHIL WAHI, or ISHAN WAHI’s friend and associate, SAMEER RAMANI, so that they could place profitable trades in those crypto assets in advance of Coinbase’s public listing announcements.&lt;/p&gt;\n\n&lt;p&gt;After getting tips from ISHAN WAHI, NIKHIL WAHI and RAMANI used anonymous Ethereum blockchain wallets to acquire crypto assets shortly before Coinbase publicly announced that it was listing or considering listing these crypto assets on its exchanges.  Following Coinbase public listing announcements, NIKHIL WAHI and RAMANI sold the crypto assets for a profit.  Based on confidential information provided by ISHAN WAHI, NIKHIL WAHI and RAMANI collectively traded shortly in advance of at least 14 separate Coinbase public listing announcements concerning at least 25 different crypto assets.  As a result of the insider trading scheme, NIKHIL WAHI and RAMANI collectively generated realized and unrealized gains totaling at least approximately $1.5 million.&lt;/p&gt;\n\n&lt;p&gt;To conceal their purchases of crypto assets in advance of Coinbase listing announcements, NIKHIL WAHI and RAMANI used accounts at centralized exchanges held in the names of others, and transferred funds, crypto assets, and proceeds of their scheme through multiple anonymous Ethereum blockchain wallets.  NIKHIL WAHI and RAMANI also regularly created and used new Ethereum blockchain wallets without any prior transaction history in order to further conceal their involvement in the scheme.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;ISHAN WAHI’s Attempt to Flee the United States:&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;On April 11, 2022, Coinbase announced that it was considering potentially listing dozens of crypto assets on its exchanges. Based on Coinbase confidential information provided by ISHAN WAHI, RAMANI caused multiple anonymous Ethereum blockchain wallets to purchase large quantities of at least six of the crypto assets that were to be included in Coinbase’s April 11, 2022 listing announcement.&lt;/p&gt;\n\n&lt;p&gt;Shortly after RAMANI traded in advance of Coinbase’s April 11 listing announcement, on April 12, 2022, a Twitter account that is well known in the crypto community tweeted regarding an Ethereum blockchain wallet “that bought hundreds of thousands of dollars of tokens exclusively featured in the Coinbase Asset Listing post about 24 hours before it was published.”  The trading activity referenced in the April 12 tweet was the trading caused by RAMANI.  Coinbase thereafter publicly replied on Twitter noting that it had already begun investigating the matter and a few weeks later stated in a public blog post that any Coinbase employee who leaked confidential company information would be “immediately terminated and referred to relevant authorities (potentially for criminal prosecution).”&lt;/p&gt;\n\n&lt;p&gt;On May 11, 2022, Coinbase’s director of security operations emailed ISHAN WAHI to inform him that he should appear for an in-person meeting relating to Coinbase’s asset listing process at Coinbase’s Seattle, Washington office on Monday, May 16, 2022. ISHAN WAHI confirmed he would attend the meeting.&lt;/p&gt;\n\n&lt;p&gt;On the evening of Sunday, May 15, 2022, ISHAN WAHI purchased a one-way flight to India that was scheduled to depart the next day shortly before ISHAN WAHI was supposed to be interviewed by Coinbase.  Prior to boarding the flight, ISHAN WAHI falsely told Coinbase employees that he had already departed for India when he had not.  In the hours between booking the flight and his scheduled departure, ISHAN WAHI called and texted NIKHIL WAHI and RAMANI about Coinbase’s investigation, and sent both of them a photograph of the messages he had received on May 11, 2022, from Coinbase’s director of security operations.  Prior to boarding the May 16, 2022 flight to India, ISHAN WAHI was stopped by law enforcement and prevented from leaving the country.&lt;/p&gt;\n\n&lt;p&gt;You can read the entire transcript here:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.justice.gov/usao-sdny/pr/three-charged-first-ever-cryptocurrency-insider-trading-tipping-scheme\"&gt;https://www.justice.gov/usao-sdny/pr/three-charged-first-ever-cryptocurrency-insider-trading-tipping-scheme&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 1265,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/w93zRzaRJxd5t8UZ0qmwxNnQ42WUkGACAVu4F6kYt5s.jpg?auto=webp&amp;s=b79b5e4c727a2a33f42a03386f69f7f956238969",
          "width": 200,
          "height": 200
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/w93zRzaRJxd5t8UZ0qmwxNnQ42WUkGACAVu4F6kYt5s.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=fc20e1aec4443077677bd4c317ecb1150b621862",
            "width": 108,
            "height": 108
          }
        ],
        "variants": {},
        "id": "Xl1_YVzU4YW2LwbKsSkm5qq8NUF5LNfXk_KIiT4bR6w"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/w4jflp/a_coinbase_product_manager_was_just_charged_with/",
  "subreddit": "CryptoCurrency",
  "id": "w4jflp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "From the Justice Department:\n\nBeginning in approximately October 2020, ISHAN WAHI worked at Coinbase as a\nproduct manager assigned to a Coinbase asset listing team. In that role, ISHAN\nWAHI was involved in the highly confidential process of listing crypto assets on\nCoinbase’s exchanges and had…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "司法省より\n\n2020年10月頃から、ISHAN WAHIはCoinbaseでプロダクトマネージャーとして勤務していました。\nCoinbaseの資産上場チームに配属されたプロダクトマネージャーとして勤務していました。その役割において、ISHAN\nWAHIは、暗号資産をCoinbaseのeコマースサイトに掲載する極秘プロセスに携わっていました。\nコインベースの取引所への暗号資産の上場という極秘のプロセスに関与し、...",
      "title": "コインベースのプロダクトマネージャーがインサイダー取引で起訴され、国外逃亡しようとして逮捕されたところです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "来自司法部的消息。\n\n大约从2020年10月开始，ISHAN WAHI在Coinbase担任\n被分配到Coinbase资产列表团队的产品经理。在这个职位上，ISHAN\nWAHI参与了在Coinbase的交易所上市加密货币资产的高度机密过程。\n在该职位上，ISHAN WAHI参与了在Coinbase的交易所列出加密货币资产的高度机密过程，并有",
      "title": "一名Coinbase产品经理刚刚被指控进行内幕交易，并在试图逃离该国时被逮捕。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "來自司法部的消息。\n\n大約從2020年10月開始，ISHAN WAHI在Coinbase擔任\n被分配到Coinbase資產列表團隊的產品經理。在這個職位上，ISHAN\nWAHI參與了在Coinbase的交易所上市加密貨幣資產的高度機密過程。\n在該職位上，ISHAN WAHI參與了在Coinbase的交易所列出加密貨幣資產的高度機密過程，並有",
      "title": "一名Coinbase產品經理剛剛被指控進行內幕交易，並在試圖逃離該國時被逮捕。"
    }
  ]
}