{
  "author": "valkener1",
  "the_new_excerpt": "Posts showing how much you would have made had you only invested early are\ndwelling on the past. We cannot go back in time and cast our lottery numbers\nbased on what we know today.\n\nInstead, come up with a longterm strategy. Many assets appreciate over time.\nPick a strategy and then stick to it.…",
  "original_created_utc": 1619987795,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "早期投資をしていればいくらになっていたか、という記事は\n過去にこだわることはできません。過去にさかのぼって、今の情報をもとに宝くじの番号を決めることはできません。\n過去にさかのぼって宝くじの番号を決めることはできませんし、現在の知識に基づいて\n\nそうではなく、長期的な戦略を立てましょう。多くの資産は時間の経過とともに評価されます。\n戦略を立てて、それを守りましょう。....",
      "title": "2009年に暗号を買っていたらどれだけ儲かっていたかを考えるのはやめよう。買い時は昨日でした。次善の策は今日です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "显示如果你只是早期投资你会赚多少钱的帖子是\n纠缠于过去。我们不能回到过去，根据我们今天所了解的情况来决定我们的彩票号码。\n基于我们今天所知道的。\n\n相反，要想出一个长期的战略。许多资产随着时间的推移而升值。\n选择一个策略，然后坚持下去....",
      "title": "不要再想你在2009年购买加密货币会赚多少钱。购买的最佳时机是昨天。第二好的是今天。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "顯示如果你只是早期投資你會賺多少錢的帖子是\n糾纏於過去。我們不能回到過去，根據我們今天所瞭解的情況來決定我們的彩票號碼。\n基於我們今天所知道的。\n\n相反，要想出一個長期的戰略。許多資產隨着時間的推移而升值。\n選擇一個策略，然後堅持下去....",
      "title": "不要再想你在2009年購買加密貨幣會賺多少錢。購買的最佳時機是昨天。第二好的是今天。"
    }
  ],
  "title": "Stop thinking about how much you would have made buying crypto in 2009. The best time to buy was yesterday. The second best is today.",
  "created_utc": 1620013133,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Posts showing how much you would have made had you only invested early are dwelling on the past. We cannot go back in time and cast our lottery numbers based on what we know today.</p>\n\n<p>Instead, come up with a longterm strategy. Many assets appreciate over time. Pick a strategy and then stick to it. Evaluate after a year. And most importantly, don’t invest more than what you can afford to lose.</p>\n</div><!-- SC_ON -->",
  "score": 379,
  "permalink": "/r/CryptoCurrency/comments/n3fc9k/stop_thinking_about_how_much_you_would_have_made/",
  "subreddit": "CryptoCurrency",
  "id": "n3fc9k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380962701
}