{
  "author": "rootpl",
  "original_created_utc": 1639940933,
  "title": "You wanted everything to be decentralised? That's what decentralised means. Deal with it.",
  "created_utc": 1639953114,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Why there&amp;#39;s so many people crying and complaining about stuff being stolen, NFTs of artist&amp;#39;s work being sold to make profits without even giving them a credit, rug pulls, scams, dodgy coins of doubtful origin, convoluted and overly complicated processes for IDOs to take part in, high fees and complex smart contacts that drain your wallets. I can probably go on and on and on. I thought this sub wanted full decentralisation, no?&lt;/p&gt;\n\n&lt;p&gt;You wanted things to be decentralised. That&amp;#39;s what decentralised means. And that&amp;#39;s what you get. You&amp;#39;ve sent your coins to a wrong wallet? Well, it&amp;#39;s gone now. It&amp;#39;s your fault. Your not getting it back. Shouldn&amp;#39;t have clicked on those random links. You just got rug pulled? Should have done your research more carefully instead of trusting some random YTbers.&lt;/p&gt;\n\n&lt;p&gt;This is just a simple reminder that crypto is still operating largely in decentralised manner. Yes, regulators are coming after us. When? Who knows. In some countries sooner, in other countries maybe little later. But right now it&amp;#39;s pretty much a wild west. Accept it. Or you know, go and save money with your bank at 0,05%&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 268,
  "permalink": "/r/CryptoCurrency/comments/rk3dde/you_wanted_everything_to_be_decentralised_thats/",
  "subreddit": "CryptoCurrency",
  "id": "rk3dde",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Why there's so many people crying and complaining about stuff being stolen, NFTs\nof artist's work being sold to make profits without even giving them a credit,\nrug pulls, scams, dodgy coins of doubtful origin, convoluted and overly\ncomplicated processes for IDOs to take part in, high fees and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "物を盗まれて泣いたり文句を言う人が多い理由、NFTのこと\nアーティストにクレジットも与えず、利益を上げるために販売されているアーティストの作品の\nラグ・プル、詐欺、出所の怪しいコイン、複雑で過度の\nIDOが参加するための複雑なプロセス、高い手数料、そして...。",
      "title": "すべてを分散化させたかったのですか？それが分散型というものです。対処してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为什么有那么多人哭着抱怨东西被偷，NFTs\n艺术家的作品被卖掉以赚取利润，甚至不给他们一个信用。\n扯皮、诈骗、来源可疑的钱币、曲折和过于复杂的程序\nIDO参与的复杂过程，高额费用和......",
      "title": "你想让所有的东西都去中心化？这就是去中心化的意思。处理一下吧。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲什麼有那麼多人哭着抱怨東西被偷，NFTs\n藝術家的作品被賣掉以賺取利潤，甚至不給他們一個信用。\n扯皮、詐騙、來源可疑的錢幣、曲折和過於複雜的程序\nIDO參與的複雜過程，高額費用和......",
      "title": "你想讓所有的東西都去中心化？這就是去中心化的意思。處理一下吧。"
    }
  ]
}