{
  "author": "Braewing",
  "original_created_utc": 1638161666,
  "title": "How were the Great Lakes formed?",
  "created_utc": 1638198284,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This one has been bouncing around my head for a long time.  I&#39;ve lived within an hour of a Great Lake for 20/24yrs of my life, and I still don&#39;t understand how they came to be.  I&#39;ve googled it, and all the sites say is &quot;the Great Lakes were formed by the melting of the Laurentide Ice Sheet during the last ice age&quot;.  I just can&#39;t seem to wrap my head around how it all fits together - why is Erie so shallow?  Why is Superior so deep?  Why the disparity between the two, and how did the melting ice sheet cause it?</p>\n\n<p>Thank you in advance, I really apprecite it!</p>\n</div><!-- SC_ON -->",
  "score": 249,
  "permalink": "/r/askscience/comments/r4nv3g/how_were_the_great_lakes_formed/",
  "subreddit": "askscience",
  "id": "r4nv3g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This one has been bouncing around my head for a long time. I've lived within an\nhour of a Great Lake for 20/24yrs of my life, and I still don't understand how\nthey came to be. I've googled it, and all the sites say is \"the Great Lakes were\nformed by the melting of the Laurentide Ice Sheet during the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これはずっと頭の中をグルグル回っていました。私は、グレートレークから1時間以内の場所に住んだことがあります。\n私は人生の20/24年間、グレートレイクの1時間以内に住んでいますが、いまだにグレートレイクがどのようにして生まれたのか理解できません。\nどうやってできたのか、いまだにわかりません。ググってみても、「五大湖はローレンティド川の融解によって形成された」というサイトばかりです。\n五大湖は、ローレンタイド氷床の融解によって形成された。",
      "title": "五大湖はどのようにしてできたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个问题在我脑子里蹦跶了很久了。在我生命中的20/24年里，我一直住在离大湖一小时车程的地方。\n在我生命中的20/24年里，我一直生活在离大湖一小时的范围内，但我仍然不明白大湖是如何形成的。\n它们是如何形成的。我在谷歌上搜索了一下，所有的网站都说 \"五大湖是由劳埃德山脉融化形成的。\n大湖是由洛伦蒂德冰原融化形成的。",
      "title": "大湖区是如何形成的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個問題在我腦子裏蹦躂了很久了。在我生命中的20/24年裏，我一直住在離大湖一小時車程的地方。\n在我生命中的20/24年裏，我一直生活在離大湖一小時的範圍內，但我仍然不明白大湖是如何形成的。\n它們是如何形成的。我在谷歌上搜索了一下，所有的網站都說 \"五大湖是由勞埃德山脈融化形成的。\n大湖是由洛倫蒂德冰原融化形成的。",
      "title": "大湖區是如何形成的？"
    }
  ]
}