{
  "author": "Key_Patience86",
  "original_created_utc": 1640878312,
  "title": "Why is minimum wage not a ratio based on cost of living rather than a set number?",
  "created_utc": 1640887893,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is something I’ve never understood. The reason behind the federal minimum wage existing is to provide a livable wage (as stated by FDR); however, the wage needed varies by state and even by city. &lt;/p&gt;\n\n&lt;p&gt;So my question is: why isn’t this a ratio based on cost of living? If it was, when cost of living is raised due to inflation, then the minimum wage would also increase (assuming it was assessed yearly).&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/NoStupidQuestions/comments/rs4f9r/why_is_minimum_wage_not_a_ratio_based_on_cost_of/",
  "subreddit": "NoStupidQuestions",
  "id": "rs4f9r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is something I’ve never understood. The reason behind the federal minimum\nwage existing is to provide a livable wage (as stated by FDR); however, the wage\nneeded varies by state and even by city.\n\nSo my question is: why isn’t this a ratio based on cost of living? If it was,\nwhen cost of living…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、私には理解できないことです。連邦最低賃金制度があるのは\n賃金は、生活できる賃金を提供するために存在する（FDRによって述べられたように）。\n州や都市によって必要なものが違う。\n\nそこで質問ですが、なぜ生活費に基づいた比率ではないのでしょうか？もしそうなら\n生活費が...",
      "title": "なぜ最低賃金は決められた数字ではなく、生活費に基づいた比率なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是我一直无法理解的事情。联邦最低工资背后的原因\n是为了提供一个宜居的工资（正如FDR所言）；然而，所需的工资因州甚至城市而异。\n所需的工资因州甚至因城市而异。\n\n所以我的问题是：为什么这不是一个基于生活成本的比率？如果是这样的话。\n当生活成本...",
      "title": "为什么最低工资不是一个基于生活成本的比例，而不是一个固定的数字？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是我一直無法理解的事情。聯邦最低工資背後的原因\n是爲了提供一個宜居的工資（正如FDR所言）；然而，所需的工資因州甚至城市而異。\n所需的工資因州甚至因城市而異。\n\n所以我的問題是：爲什麼這不是一個基於生活成本的比率？如果是這樣的話。\n當生活成本...",
      "title": "爲什麼最低工資不是一個基於生活成本的比例，而不是一個固定的數字？"
    }
  ]
}