{
  "author": "ballsofstyle",
  "original_created_utc": 1655996229,
  "title": "Why is America not investing in a bullet train infrastructure between major cities?",
  "created_utc": 1656006597,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It would provide so many jobs, the trains can almost match airplanes in terms of how long it takes to get somewhere (especially in the shorter to middle-distance range), you can transport more people with little effort as well&lt;/p&gt;\n\n&lt;p&gt;Edit - well thanks people. Many interesting answers, many very defensive. Still got a lot of interesting insights. Cheers!&lt;/p&gt;\n\n&lt;p&gt;Edit - realizing that I come off as a twat here and there. My bad. I get into that devil&amp;#39;s advocate role sometimes and get carried away. Fair point for calling that out. Enjoy your day people&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/NoStupidQuestions/comments/viyugo/why_is_america_not_investing_in_a_bullet_train/",
  "subreddit": "NoStupidQuestions",
  "id": "viyugo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It would provide so many jobs, the trains can almost match airplanes in terms of\nhow long it takes to get somewhere (especially in the shorter to middle-distance\nrange), you can transport more people with little effort as well\n\nEdit - well thanks people. Many interesting answers, many very…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの雇用を創出し、電車はほとんど飛行機に匹敵するほどの\n特に短・中距離の移動では、飛行機とほぼ同等の時間がかかります。\n特に短・中距離では）、少ない労力でより多くの人を運ぶことができます。\n\n編集部 - ありがとうございます。多くの興味深い回答、多くの非常に...",
      "title": "アメリカはなぜ、大都市間の新幹線インフラに投資しないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "它将提供如此多的工作机会，火车几乎可以与飞机媲美。\n到某地所需的时间（特别是在中短途的范围内\n范围内），你也可以不费吹灰之力地运送更多的人。\n\n编辑--好吧，谢谢大家。许多有趣的答案，许多非常...",
      "title": "为什么美国不在主要城市之间投资建设子弹头列车基础设施？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "它將提供如此多的工作機會，火車幾乎可以與飛機媲美。\n到某地所需的時間（特別是在中短途的範圍內\n範圍內），你也可以不費吹灰之力地運送更多的人。\n\n編輯--好吧，謝謝大家。許多有趣的答案，許多非常...",
      "title": "爲什麼美國不在主要城市之間投資建設子彈頭列車基礎設施？"
    }
  ]
}