{
  "author": "Snowbattt",
  "original_created_utc": 1660216466,
  "title": "The importance of sending a small test-amount first when moving your assets around",
  "created_utc": 1660232349,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I a few weeks ago I finally decided to move all my ETH to my cold storage wallet. Being a paranoid fuck, I decided to test with a small test-amount first.&lt;/p&gt;\n\n&lt;p&gt;Turns out I had accidentally copy/pasted the wrong address. The test amount never arrived. Thankfully, I only lost about what was then €15. Otherwise I&amp;#39;d have lost all my ETH that I&amp;#39;ve been accumulating since 2017 which would have made me very angry.&lt;/p&gt;\n\n&lt;p&gt;Just goes to show you how it&amp;#39;s really good practice to first do it with a test amount. This technology is still young and you have no protection against these kind of dumb typos.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 646,
  "permalink": "/r/CryptoCurrency/comments/wlougr/the_importance_of_sending_a_small_testamount/",
  "subreddit": "CryptoCurrency",
  "id": "wlougr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So I a few weeks ago I finally decided to move all my ETH to my cold storage\nwallet. Being a paranoid fuck, I decided to test with a small test-amount first.\n\nTurns out I had accidentally copy/pasted the wrong address. The test amount\nnever arrived. Thankfully, I only lost about what was then €15.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで私は数週間前、ついに自分のETHをすべてコールドストレージに移すことにしました。\nウォレットに移すことにしました。妄想癖のある私は、まず少額のテストアカウントでテストすることにしました。\n\n私は誤って間違ったアドレスをコピー/ペーストしていたことが判明した。テスト金額は\nは届かなかった。ありがたいことに、当時15ユーロほどを失っただけだった......。",
      "title": "資産を移動する際には、まず少額のテスト金額を送ることの重要性"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我在几周前终于决定将我所有的ETH转移到我的冷库中。\n钱包。作为一个偏执狂，我决定先用一个小的测试金额进行测试。\n\n结果发现我不小心复制/粘贴了错误的地址。测试金额\n从未到达。值得庆幸的是，我只损失了当时的15欧元....。",
      "title": "在移动你的资产时，首先发送一个小的测试金额的重要性"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我在幾周前終於決定將我所有的ETH轉移到我的冷庫中。\n錢包。作爲一個偏執狂，我決定先用一個小的測試金額進行測試。\n\n結果發現我不小心複製/粘貼了錯誤的地址。測試金額\n從未到達。值得慶幸的是，我只損失了當時的15歐元....。",
      "title": "在移動你的資產時，首先發送一個小的測試金額的重要性"
    }
  ]
}