{
  "author": "mapboyy",
  "original_created_utc": 1650586473,
  "title": "Officially hit .05 BTC today",
  "created_utc": 1650648971,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It took some time in a few alts, but I’m beginning to understand that Bitcoin is king. Not sure why it took me so long, and I had my doubts about scalability, but now everything seems so clear.&lt;/p&gt;\n\n&lt;p&gt;The lightning network has improved the speed of transactions by using off-network wallets signed by 2 separate parties. &lt;/p&gt;\n\n&lt;p&gt;El Salvador has accepted BTC as legal tender, and other countries will undoubtedly follow as inflation destroys their currencies.&lt;/p&gt;\n\n&lt;p&gt;Proof-of-work was created with decentralization and fairness in mind, using math and cryptography. Bitcoin has the largest volume of miners, and was launched in a completely fair way. &lt;/p&gt;\n\n&lt;p&gt;Apps like Strike are making Bitcoin payments easy, and cash app and venmo are supporting Bitcoin payments. &lt;/p&gt;\n\n&lt;p&gt;Widespread adoption seems inevitable.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 312,
  "permalink": "/r/Bitcoin/comments/u91ga8/officially_hit_05_btc_today/",
  "subreddit": "Bitcoin",
  "id": "u91ga8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It took some time in a few alts, but I’m beginning to understand that Bitcoin is\nking. Not sure why it took me so long, and I had my doubts about scalability,\nbut now everything seems so clear.\n\nThe lightning network has improved the speed of transactions by using\noff-network wallets signed by 2…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いくつかのアルトで時間がかかりましたが、Bitcoinが王様であることを理解し始めています。\n王です。なぜそんなに時間がかかったのか、スケーラビリティに疑問を持っていました。\nしかし、今はすべてがクリアに見えます。\n\nライトニングネットワークは、取引速度を向上させるために、ネットワーク外で署名されたウォレットを使用しています。\nオフネットワークウォレットを使用することで 取引の速度を向上させました 2...",
      "title": "本日、公式に.05BTCを達成"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在几个代理中花了一些时间，但我开始明白，比特币是\n王者。不知道为什么我花了这么长时间，而且我对可扩展性也有怀疑。\n但现在一切都显得那么清晰。\n\n闪电网络通过使用以下方式提高了交易速度\n网络外的钱包，由2个签名的...",
      "title": "今天正式达到0.05BTC"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在幾個代理中花了一些時間，但我開始明白，比特幣是\n王者。不知道爲什麼我花了這麼長時間，而且我對可擴展性也有懷疑。\n但現在一切都顯得那麼清晰。\n\n閃電網絡通過使用以下方式提高了交易速度\n網絡外的錢包，由2個簽名的...",
      "title": "今天正式達到0.05BTC"
    }
  ]
}