{
  "author": "wallstreetballer",
  "the_new_excerpt": "All of reddit/ social media is basically a trash can. Too much political talk\nand plain toxic. I love coming here cause we all here for one thing, no\npolitics, no bullshit. If we can print money off it, we in, we don’t care which\nside. Bull gang, bear gang , whatever gang.\n\n\n\nIt’s impossible for us…",
  "original_created_utc": 1610914566,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所有的reddit/社交媒体基本上都是垃圾桶。太多的政治话题\n和普通的有毒。我喜欢来这里，因为我们都是为了一件事而来，没有...\n政治，不废话。如果我们能把钱印出来，我们在，我们不管是哪种\n侧面。牛帮，熊帮，什么帮派。\n\n\n\n我们不可能...",
      "title": "WSB是有史以来最好的网络社区。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所有的reddit/社交媒體基本上都是垃圾桶。太多的政治話題\n和普通的有毒。我喜歡來這裏，因爲我們都是爲了一件事而來，沒有...\n政治，不廢話。如果我們能把錢印出來，我們在，我們不管是哪種\n側面。牛幫，熊幫，什麼幫派。\n\n\n\n我們不可能...",
      "title": "WSB是有史以來最好的網絡社區。"
    }
  ],
  "title": "WSB is hands down the best internet community ever.",
  "created_utc": 1610927234,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>All of reddit/ social media is basically a trash can. Too much political talk and plain toxic. I love coming here cause we all here for one thing, no politics, no bullshit. If we can print money off it, we in, we don’t care which side. Bull gang, bear gang , whatever gang.</p>\n\n<p>&#x200B;</p>\n\n<p>It’s impossible for us to be a cult, at the end of the day, this is the Wild West where everyone for themselves. If you don’t like the way some people are betting or don’t like one of the gangs , you’re always free bet against them. Unlike other online forms, I love how most don&#39;t care about arguing or proving our point to others, cause the proof is in the pudding. Either you can make money or you can’t.</p>\n\n<p>I fucking love you all, props to the mods, never change WSB</p>\n</div><!-- SC_ON -->",
  "score": 19443,
  "permalink": "/r/wallstreetbets/comments/kze078/wsb_is_hands_down_the_best_internet_community_ever/",
  "subreddit": "wallstreetbets",
  "id": "kze078",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311224166
}