{
  "author": "CaligulaNeptuneBane",
  "original_created_utc": 1648243849,
  "title": "How does anyone afford anything?",
  "created_utc": 1648299072,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m 26. I make 70k my wife makes 30k. &lt;/p&gt;\n\n&lt;p&gt;How do people have homes? How do people have cars? I’m so fucking confused. Between student loans rent car payments and car insurance we get pretty close to tapped out each month. &lt;/p&gt;\n\n&lt;p&gt;How is is possible that people are buying new cars and new houses? Like we make we’ll more than the median income but the idea of buying a new car or a house is out of the question. I’m just confused as to how anyone can have a down payment for a house. A cheap cheap cheap house in my area is like 200k how the fuck are people getting 40k saved up for a down payment? Is everyone around me a millionaire and I’m the only asshole making this little money? Or is everyone in the US right now taking out loans that they can’t afford for these homes and cars? &lt;/p&gt;\n\n&lt;p&gt;I just feel like I’m either crazy because I’m the only one not comfortable taking on debt that size or I’m crazy because I’m the only asshole that’s not making money hand over fist to be able to afford this stuff. &lt;/p&gt;\n\n&lt;p&gt;I’m just so confused.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/to06t2/how_does_anyone_afford_anything/",
  "subreddit": "NoStupidQuestions",
  "id": "to06t2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m 26. I make 70k my wife makes 30k.\n\nHow do people have homes? How do people have cars? I’m so fucking confused.\nBetween student loans rent car payments and car insurance we get pretty close to\ntapped out each month.\n\nHow is is possible that people are buying new cars and new houses? Like we…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は26歳です。私は7万円、妻は3万円です。\n\nみんなどうやって家を持っているんだ？どうやって車を持ってるんだ？すごく混乱してるんだ。\n学生ローン、家賃、車の支払い、自動車保険の間に、我々はかなり近づいています。\n毎月の支払いに追われる。\n\nどうしてみんな新しい車や新しい家を買っているのでしょうか？私たちのように...",
      "title": "誰がどうやって何かを買っているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今年26岁。我赚7万，我妻子赚3万。\n\n人们怎么会有房子？人们怎么会有车？我真他妈的糊涂了。\n在学生贷款、租金、汽车付款和汽车保险之间，我们每个月都非常接近于\n每个月都会被耗尽。\n\n人们怎么可能买新车和新房？就像我们...",
      "title": "人们如何负担得起任何东西？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今年26歲。我賺7萬，我妻子賺3萬。\n\n人們怎麼會有房子？人們怎麼會有車？我真他媽的糊塗了。\n在學生貸款、租金、汽車付款和汽車保險之間，我們每個月都非常接近於\n每個月都會被耗盡。\n\n人們怎麼可能買新車和新房？就像我們...",
      "title": "人們如何負擔得起任何東西？"
    }
  ]
}