{
  "author": "Wargizmo",
  "original_created_utc": 1631179651,
  "title": "SEC moves to shut down latest moon distribution.",
  "created_utc": 1631192291,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The U.S. Securities and Exchange Commission has moved to shut down the latest Moon distribution, claiming the official token of the cryptocurrency subreddit is, in fact, a security.</p>\n\n<p>The SEC has threatened Reddit with legal action should the latest distribution go ahead. </p>\n\n<p>Frustrated and confused redditors, some of whom had stayed up all night waiting for their Moons, were left in the dark following an initial announcement on Reddit that Moons would be distributed.</p>\n\n<p>A statement released by the SEC cited comments from irate Redditors who were angry at the SEC for their stance on cryptocurrencies and their proceedings against Coinbase and Ripple.</p>\n\n<p>&quot;One Redditor even told us to suck his big fat hairy balls.&quot; the statement read, &quot;here at the SEC we take statements like that very seriously, we&#39;ll see how they like it when they can&#39;t get their precious Moons!&quot;</p>\n\n<p>We have reached out to Reddit for a statement.</p>\n\n<p>Stay tuned for more on this development</p>\n</div><!-- SC_ON -->",
  "score": 363,
  "permalink": "/r/CryptoCurrency/comments/pkuea6/sec_moves_to_shut_down_latest_moon_distribution/",
  "subreddit": "CryptoCurrency",
  "id": "pkuea6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The U.S. Securities and Exchange Commission has moved to shut down the latest\nMoon distribution, claiming the official token of the cryptocurrency subreddit\nis, in fact, a security.\n\nThe SEC has threatened Reddit with legal action should the latest distribution\ngo ahead.\n\nFrustrated and confused…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "米国証券取引委員会（SEC）は、米国内での最新の\n米国証券取引委員会は、暗号通貨サブレディットの公式トークンが実際には証券であると主張して、最新のMoonの配布を停止しました。\nの公式トークンは、実際には証券であると主張しています。\n\nSECはRedditに対して、最新の配布が行われた場合には法的措置を取ると脅しています。\n進めようとしています。\n\nイライラして、混乱して...",
      "title": "SECが最新の月の配信を停止する動き"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "美国证券交易委员会已经采取行动，关闭了最新的\n月球分布，声称加密货币子网站的官方代币\n实际上是一种证券。\n\n美国证券交易委员会已经威胁Reddit，如果最新的发行活动继续进行，将采取法律行动。\n继续进行。\n\n感到沮丧和困惑的...",
      "title": "美国证券交易委员会采取行动，关闭最新的月球分布。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "美國證券交易委員會已經採取行動，關閉了最新的\n月球分佈，聲稱加密貨幣子網站的官方代幣\n實際上是一種證券。\n\n美國證券交易委員會已經威脅Reddit，如果最新的發行活動繼續進行，將採取法律行動。\n繼續進行。\n\n感到沮喪和困惑的...",
      "title": "美國證券交易委員會採取行動，關閉最新的月球分佈。"
    }
  ]
}