{
  "author": "FineLeg",
  "the_new_excerpt": "There is an unfortunate abundance of hate and jealousy from people presumably\n\"missing out\" on significant price increases and frankly I don't understand that\nmentality.\n\nWe should be congratulating our Brothers and Sisters in crypto and not\ncriticising their choice of coin.\n\nCrypto isn't a race to…",
  "original_created_utc": 1618672114,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "残念なことに、大幅な値上げを \"見逃した \"と推定される人々からの憎しみや嫉妬が溢れています。\n大幅な値上げを \"逃す \"ことになった人たちの憎しみや嫉妬が残念ながら溢れていますが、正直言って私には理解できません。\nメンタリティを感じます。\n\n私たちは、暗号化された兄弟姉妹を祝福すべきであり、彼らのコインの選択を批判すべきではありません。\nコインの選択を批判してはいけません。\n\n暗号は競争ではありません...",
      "title": "コインが何であれ、まともな利益を上げている人はおめでとうございます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一个不幸的丰富的仇恨和嫉妒的人大概\n\"错过 \"大幅涨价的机会，坦率地说，我不理解这一点。\n心态。\n\n我们应该祝贺我们的兄弟姐妹在加密领域，而不是\n批评他们选择的币种。\n\n加密不是一场竞赛... ...",
      "title": "祝贺任何人从任何硬币中赚取体面的利润。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一個不幸的豐富的仇恨和嫉妒的人大概\n\"錯過 \"大幅漲價的機會，坦率地說，我不理解這一點。\n心態。\n\n我們應該祝賀我們的兄弟姐妹在加密領域，而不是\n批評他們選擇的幣種。\n\n加密不是一場競賽... ...",
      "title": "祝賀任何人從任何硬幣中賺取體面的利潤。"
    }
  ],
  "title": "Congratulations to anyone making decent profit from whatever coin",
  "created_utc": 1618679463,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There is an unfortunate abundance of hate and jealousy from people presumably &quot;missing out&quot; on significant price increases and frankly I don&#39;t understand that mentality.</p>\n\n<p>We should be congratulating our Brothers and Sisters in crypto and not criticising their choice of coin.</p>\n\n<p>Crypto isn&#39;t a race to become rich so just congratulate others recent successes and if you believe in your portfolio then your time will come too.</p>\n</div><!-- SC_ON -->",
  "score": 10148,
  "permalink": "/r/CryptoCurrency/comments/mssfjm/congratulations_to_anyone_making_decent_profit/",
  "subreddit": "CryptoCurrency",
  "id": "mssfjm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171519544
}