{
  "author": "Red-HawkEye",
  "original_created_utc": 1653240566,
  "title": "Bitcoin was priced at 5000$ in march 2020, why is everyone in this subreddit so pessimistic?",
  "created_utc": 1653287915,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;You guys are really out of your fucking mind. Around 2 years ago in march 2020, Bitcoin&amp;#39;s price was around 5000$ and now its around 29000-30,000$&lt;/p&gt;\n\n&lt;p&gt;Thats literally x6 in two fucking years. The people who were against bitcoin back then should be underneath our fucking feet begging for their regret. They should be wishing every single day of their night for not getting into crypto in 2020.&lt;/p&gt;\n\n&lt;p&gt;So how did this subreddit turn this into favoring bears when clearly bitcoin dominated throughout these two years?&lt;/p&gt;\n\n&lt;p&gt;This is literally insanity, its blowing my mind how people have forgotten that bitcoin was priced at 5000$ and have JUMPED ALL THE WAY TO 69,000$ throughout both 2020-2021, and are fucking COMPLAINING WHEN IT DROPS TO MATCH NOT X14 INCREASE FROM 2020 BUT X6.&lt;/p&gt;\n\n&lt;p&gt;HOW MUCH INTEREST RATES HAVE YOU GOTTEN FROM YOUR BANKS? 0.1%?&lt;/p&gt;\n\n&lt;p&gt;If bitcoin goes 20,000$, it would still be pretty mind blowing with respect to 2020 being 5000$, 400% INCREASE is still what the fuck&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/uvfpeq/bitcoin_was_priced_at_5000_in_march_2020_why_is/",
  "subreddit": "CryptoCurrency",
  "id": "uvfpeq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "You guys are really out of your fucking mind. Around 2 years ago in march 2020,\nBitcoin's price was around 5000$ and now its around 29000-30,000$\n\nThats literally x6 in two fucking years. The people who were against bitcoin\nback then should be underneath our fucking feet begging for their regret.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "お前ら本当にどうかしてるぜ。2年前の2020年3月頃。\nビットコインの価格は5000ドル前後でしたが、現在は29000～30000ドル前後です。\n\n文字通り2年で6倍になってる。ビットコインに反対していた人たちは\n私たちの足元で悔しがっているはずです...。",
      "title": "ビットコインは2020年3月に5000＄の価格となりましたが、なぜこのサブレディットの皆さんはそんなに悲観的なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你们这些人真的是他妈的疯了。大约在两年前的2020年3月。\n比特币的价格是5000美元左右，现在是29000-30000美元左右\n\n这简直是两年内的六倍。那些反对比特币的人\n应该在我们的脚下乞求他们的遗憾....。",
      "title": "比特币在2020年3月的价格是5000美元，为什么这个分论坛的人都这么悲观？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你們這些人真的是他媽的瘋了。大約在兩年前的2020年3月。\n比特幣的價格是5000美元左右，現在是29000-30000美元左右\n\n這簡直是兩年內的六倍。那些反對比特幣的人\n應該在我們的腳下乞求他們的遺憾....。",
      "title": "比特幣在2020年3月的價格是5000美元，爲什麼這個分論壇的人都這麼悲觀？"
    }
  ]
}