{
  "author": "Nuewim",
  "original_created_utc": 1632351457,
  "title": "Crypto is not temporary thing, it will not dissapear or fall in few years. If you think it will, you haven't been paying attention to lessons should learn from introduction of internet or mobile phones.",
  "created_utc": 1632397091,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t like this bullshit that crypto is terribly risky, that it can dissapear in any moment and even coins like Bitcoin and Ethereum can go to 0.</p>\n\n<p>Yes, crypto is risky, but not riskier that crossing road or cooking dinner. Risk involved in crypto is acceptable. It is 2,2 trillion $ business, it  not gonna fall just because someone will sneeze. Yes, some coins can go down, especially shitcoins, but not whole crypto. That is why you should always diversify and DYOR to be fine, even if one or two your coins will be failures. Bitcoin was declared dead  over 430 times ( around 40 times just this year). Suprise, suprise nothing happened.</p>\n\n<p>The same shit people talked about internet \nand mobile phones. I am just 22 years old and from europe, but even I remember it. </p>\n\n<p>&quot;Why would I need mobile phone? (my dad asked uncle when I was 5/6 years old), it is stupid gadget, we have already phone at home.&quot; My uncle had mobile phone because he worked in New York, in some american company, after 3/4 years he get new one, so he give old one to my dad. Dad wasn&#39;t happy but started to use it, cause it was free. Phones weren&#39;t too popular then. Most neighbours told this was waste of money. My first phone I had when I was 10/11. I used it rarely, calls were expensive, internet even more. I also thought it is useless gadget, that can be used only to call parents or do photos.</p>\n\n<p>&quot;Internet is  temporary toy and will have no impact  for the world&quot;, most people liked to tell. For most people it was  another useless thing for teenagers that sat whole  days in front of the computer. When I had computer lessons in primary school we used internet only to play famous then internet games. Even economy nobel prize winner in 1998 Paul Kruegman believed internet will end like fax machines and slowly die until 2005.  </p>\n\n<p>Don&#39;t you see simillarities of those situations with crypto today? History is repeating. Many people smashed internet 20 years ago, and instead of learning a lesson they repeat the same mistake again. A lot of people, even many of us still can&#39;t see full potential of crypto. You behave exactly like those that were unable to see potential of mobile phones and internet, if you believe crypto can at this stage just come to the end.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/pthyv4/crypto_is_not_temporary_thing_it_will_not/",
  "subreddit": "CryptoCurrency",
  "id": "pthyv4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don't like this bullshit that crypto is terribly risky, that it can dissapear\nin any moment and even coins like Bitcoin and Ethereum can go to 0.\n\nYes, crypto is risky, but not riskier that crossing road or cooking dinner. Risk\ninvolved in crypto is acceptable. It is 2,2 trillion $ business, it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号は非常にリスクが高く、いつでも消滅する可能性があり、ビットコインやイーサリアムのようなコインでも0になる可能性があるというデタラメな話は好きではありません。\nBitcoinやEthereumのようなコインでさえゼロになってしまう可能性がある。\n\n確かに暗号はリスクを伴いますが、道路を横断することや夕食を作ることよりもリスクが高いわけではありません。リスク\nは許容範囲内です。2兆2千億ドル規模のビジネスであり、...",
      "title": "暗号は一時的なものではなく、数年で消滅したり下落したりすることはありません。もしそう思うのであれば、インターネットや携帯電話の導入から学ぶべきことに注意を払っていないのではないでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不喜欢这种胡说八道，说加密货币有很大的风险，它随时可能消失。\n在任何时候，甚至像比特币和以太坊这样的硬币都可以归于零。\n\n是的，加密货币是有风险的，但不比过马路或做晚饭的风险更大。在加密货币中涉及的风险\n所涉及的风险是可以接受的。它是2.2万亿美元的业务，它...",
      "title": "加密货币不是暂时的东西，它不会在几年内消失或下降。如果你认为它会，你还没有注意到应该从互联网或移动电话的引进中吸取的教训。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不喜歡這種胡說八道，說加密貨幣有很大的風險，它隨時可能消失。\n在任何時候，甚至像比特幣和以太坊這樣的硬幣都可以歸於零。\n\n是的，加密貨幣是有風險的，但不比過馬路或做晚飯的風險更大。在加密貨幣中涉及的風險\n所涉及的風險是可以接受的。它是2.2萬億美元的業務，它...",
      "title": "加密貨幣不是暫時的東西，它不會在幾年內消失或下降。如果你認爲它會，你還沒有注意到應該從互聯網或移動電話的引進中吸取的教訓。"
    }
  ]
}