{
  "author": "waughandy",
  "original_created_utc": 1629708167,
  "title": "Why Harmony ONE is underrated ?",
  "created_utc": 1629740154,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi guys, I found about ONE few months ago and immediately liked it, I wanted to make this post because not really a lot of people speak about it here and I think it deserves better !</p>\n\n<ul>\n<li>Harmony ONE is a blockchain-based platform, built to solve the riddle of delivering both scalability and decentralization at no expense of one another.</li>\n<li>Harmony’s bridges can connect any Proof-of-Work and Proof-of-Stake chains. They aim to bridge all chains.</li>\n<li>Right now it has 2 seconds finality on its chain and even on Ethereum.</li>\n<li>Tx fees are extremely cheap like $0.000·001.</li>\n<li>Harmony’s MC is 1.2B and the price is at $0.12 at the moment.</li>\n<li>The team behind the project is a great team with big names of the tech (look on their website, you will be surprised).</li>\n<li>There is more and more projects built on Harmony (NFT : DaVinci Gallery, Game : Freyala, and you can search there is a lot more).</li>\n<li>Staking, it’s 10-12% APY at the moment. Better than a lot of others.</li>\n<li>A lot of updates are coming in 2022, this is the beginning.</li>\n<li>The only defect is the lack of marketing, I think with a big marketing, this coin can become one of the big next coin. If you want more informations, feel free to ask me anything, go on their subreddit and their website ! The even did an AMA here on this subreddit if you want to learn more.</li>\n<li>EDIT : I forgot about Crypto Royale ! A good game to start to earn few cryptos ! (Thanks to <a href=\"/u/ProcastinateIsLife\">u/ProcastinateIsLife</a> to remember me)</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/p9vom9/why_harmony_one_is_underrated/",
  "subreddit": "CryptoCurrency",
  "id": "p9vom9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi guys, I found about ONE few months ago and immediately liked it, I wanted to\nmake this post because not really a lot of people speak about it here and I\nthink it deserves better !\n\n * Harmony ONE is a blockchain-based platform, built to solve the riddle of\n   delivering both scalability and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。数ヶ月前にONEを見つけて、すぐに気に入りました。\nこの記事を書いたのは、ここではあまり多くの人がONEについて語っていないからです。\nこの記事を書こうと思いました。\n\n * Harmony ONEはブロックチェーンをベースにしたプラットフォームで、以下のような問題を解決するために構築されました。\n   スケーラビリティと...",
      "title": "なぜHarmony ONEは過小評価されているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我在几个月前发现了ONE，并立即喜欢上了它。\n我想发这个帖子，因为这里没有很多人谈论它，我认为它应该得到更好的发展!\n我认为它应该得到更好的评价!\n\n * Harmony ONE是一个基于区块链的平台，旨在解决以下问题\n   提供可扩展性和...",
      "title": "为什么和谐一号被低估了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我在幾個月前發現了ONE，並立即喜歡上了它。\n我想發這個帖子，因爲這裏沒有很多人談論它，我認爲它應該得到更好的發展!\n我認爲它應該得到更好的評價!\n\n * Harmony ONE是一個基於區塊鏈的平臺，旨在解決以下問題\n   提供可擴展性和...",
      "title": "爲什麼和諧一號被低估了？"
    }
  ]
}