{
  "author": "Jxntb733",
  "original_created_utc": 1647783568,
  "title": "Bitcoin has never failed - EVER - it may be volatile in USD price but that’s not the point!",
  "created_utc": 1647804791,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Bitcoin has never failed - NEVER - the protocol has remain sound and unhacked for over a decade - usd volatility sure, the price fluctuates, but the nodes and wallets and network continues to grow and strengthen.       &lt;/p&gt;\n\n&lt;p&gt;Let me repeat myself - Satoshi’s creation of a digital peer to peer electronic monetary network was created and has run soundly for 12+ years - anyone can buy it - anyone can send any amount they have to others without external influence or control.        &lt;/p&gt;\n\n&lt;p&gt;One can send anyone money anywhere in the world - takes just under 10minutes to settle - no bank wire fee - no fiat conversion fee - it’s amazing that this system was invented.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 353,
  "permalink": "/r/CryptoCurrency/comments/til9z8/bitcoin_has_never_failed_ever_it_may_be_volatile/",
  "subreddit": "CryptoCurrency",
  "id": "til9z8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Bitcoin has never failed - NEVER - the protocol has remain sound and unhacked\nfor over a decade - usd volatility sure, the price fluctuates, but the nodes and\nwallets and network continues to grow and strengthen.\n\nLet me repeat myself - Satoshi’s creation of a digital peer to peer…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインは一度も失敗したことがない - NEVER - プロトコルは健全でハッキングされないままだ\n確かに米ドルのボラティリティはありますが、ノードと\nネットワークは成長し、強化され続けています。\n\n繰り返しになりますが、サトシはデジタル・ピアツーピアを創り出しました...",
      "title": "ビットコインは失敗したことがありません - EVER - それはドルの価格が不安定かもしれませんが、それはポイントではありません！ビットコインは、そのようなことはありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比特币从来没有失败过--从来没有--该协议一直保持健全，没有被黑客攻击过\n十多年来，美元的波动是肯定的，价格波动，但节点和\n但节点和钱包以及网络继续增长和加强。\n\n让我重复一遍--中本聪创造的数字点对点...",
      "title": "比特币从来没有失败过--从来没有--它的美元价格可能会有波动，但这不是问题的关键!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣從來沒有失敗過--從來沒有--該協議一直保持健全，沒有被黑客攻擊過\n十多年來，美元的波動是肯定的，價格波動，但節點和\n但節點和錢包以及網絡繼續增長和加強。\n\n讓我重複一遍--中本聰創造的數字點對點...",
      "title": "比特幣從來沒有失敗過--從來沒有--它的美元價格可能會有波動，但這不是問題的關鍵!"
    }
  ]
}