{
  "author": "HappyBus8759",
  "the_new_excerpt": "I posted this on another subreddit, and its gotten a lot of response. Just\nthought I'd share it here so newcomers can see how I used DCA strategy to invest\nin Bitcoin monthly over the last 8 years.\n\n\n\nI'm a taxi driver in a European city and in December 2012 I picked up an\nAmerican customer who…",
  "original_created_utc": 1613695077,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我把这个贴在了另一个subreddit上，它得到了很多回应。只是\n我想在这里分享一下，让新人看看我是如何运用DCA策略进行投资的。\n在过去的8年里，每月都有比特币的收入。\n\n\n\n我是欧洲一个城市的出租车司机，2012年12月，我拿了一个\n美国客户谁...",
      "title": "比特币如何救了我的命."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我把這個貼在了另一個subreddit上，它得到了很多回應。只是\n我想在這裏分享一下，讓新人看看我是如何運用DCA策略進行投資的。\n在過去的8年裏，每月都有比特幣的收入。\n\n\n\n我是歐洲一個城市的出租車司機，2012年12月，我拿了一個\n美國客戶誰...",
      "title": "比特幣如何救了我的命."
    }
  ],
  "title": "How Bitcoin saved my life.",
  "created_utc": 1613709566,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p>I posted this on another subreddit, and its gotten a lot of response. Just thought I&#39;d share it here so newcomers can see how I used DCA strategy to invest in Bitcoin monthly  over the last 8 years.</p>\n\n<p>&#x200B;</p>\n\n<p>I&#39;m a taxi driver in a European city and in December 2012 I picked up an American customer who wanted to go to the airport. The traffic was chaotic and what would usually be a 30 min journey, took approx 90 min. He was cool with it though, as he had plenty of time for his flight.</p>\n\n<p>We had a really good chat, he told me about BTC and how even if I didn&#39;t want to put money into it, it was important to know what it was. Needless to say, I was intrigued, and a bit confused. Over the next ten days or so, I read as much online as I could and decided there and then that I would quit my 15 cigarettes a day habit and put the money I would have spent otherwise into BTC. I made my first purchase of BTC on Jan 1st, 2013.</p>\n\n<p>Every month for the last 8 years, I have bought €250 of BTC. I was DCAing without even realising it was an actual strategy. I am still buying at today&#39;s price, and have bought at every price range since 2013. I have never sold any of it.</p>\n\n<p>Needless to say, my financial and physical health have drastically changed since then and I truly believe that BTC has saved my life. My initial plan was to DCA for 10 years, and if I have enough to retire, then I will, that&#39;s less than 2 years away now and will be 1 month before my 40th birthday.</p>\n\n<p>I have well over 7 figures in BTC, yet still drive my taxi everyday. Life is good.</p>\n\n<p>&#x200B;</p>\n\n<p>Edit: Just wanted to add in that Bitcoin gave me an incentive to quit smoking, and that&#39;s as valuable to me as the gains I&#39;ve made. That&#39;s why I feel it saved my life.</p>\n</div><!-- SC_ON -->",
  "score": 702,
  "permalink": "/r/Bitcoin/comments/ln21zu/how_bitcoin_saved_my_life/",
  "subreddit": "Bitcoin",
  "id": "ln21zu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332870758
}