{
  "author": "_martinshkreli_",
  "the_new_excerpt": "Yesterday I made a post about why coin price does not matter (on its own) and\nthat you should look at the market cap instead\n[https://old.reddit.com/r/CryptoCurrency/comments/nd0yx2/dear_newbies_are_you_looking_for_a_promising_coin/].\nI was really surprised how it turned out:\n\n * it got really,…",
  "original_created_utc": 1621170999,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日、私は「コインの価格は（それだけでは）重要ではない」という記事を書きました。\n代わりに時価総額を見るべきだということを\n[https://old.reddit.com/r/CryptoCurrency/comments/nd0yx2/dear_newbies_are_you_looking_for_a_promising_coin/]をご覧ください。\nその結果には本当に驚きました。\n\n * それは本当に、...",
      "title": "1ドル以下の \"安い \"コインを買うのは構わないし、良いものもある。ミームコインでギャンブルをするのは、ギャンブルをしていることがわかっていれば問題ありません。コインの価格はまだ重要ではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨天我发了一篇文章，讲述了为什么币价并不重要（本身），而是应该看市值。\n你应该看一下市值，而不是\n[https://old.reddit.com/r/CryptoCurrency/comments/nd0yx2/dear_newbies_are_you_looking_for_a_promising_coin/]。\n我真的很惊讶它的结果。\n\n *它得到了真的，...",
      "title": "购买低于1美元的 \"廉价 \"硬币是可以的，有些是好的。在纪念币上赌博是可以的，只要你知道你在赌博。硬币价格仍然不重要。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨天我發了一篇文章，講述了爲什麼幣價並不重要（本身），而是應該看市值。\n你應該看一下市值，而不是\n[https://old.reddit.com/r/CryptoCurrency/comments/nd0yx2/dear_newbies_are_you_looking_for_a_promising_coin/]。\n我真的很驚訝它的結果。\n\n *它得到了真的，...",
      "title": "購買低於1美元的 \"廉價 \"硬幣是可以的，有些是好的。在紀念幣上賭博是可以的，只要你知道你在賭博。硬幣價格仍然不重要。"
    }
  ],
  "title": "Buying \"cheap\" coins below $1 is fine, some are good. Gambling on meme coins is fine as long as you know that you're gambling. Coin price still does not matter.",
  "created_utc": 1621191433,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yesterday I made a post about why <a href=\"https://old.reddit.com/r/CryptoCurrency/comments/nd0yx2/dear_newbies_are_you_looking_for_a_promising_coin/\">coin price does not matter (on its own) and that you should look at the market cap instead</a>. I was really surprised how it turned out:</p>\n\n<ul>\n<li>it got really, really popular (currently over 8k upvotes and it even reached the front page of reddit)</li>\n<li>at the same time, nobody read it?</li>\n</ul>\n\n<p>I&#39;ve never seen something like that, more than 90% of people who replied obviously just read the title (it was not just me, some people commented that they were confused about the lack of reading comprehension or sent me DMs or chats - thanks for that, I thought I was going crazy). People were telling me that I shouldn&#39;t judge people for buying shitcoins or that they &quot;agreed with me&quot; that people should not buy shitcoins (not what the post was about), that they bought something like ADA or MATIC when it was below $1 and made a ton of profits (not what the post was about) and of course, most of them just shilled their coins, either saying that they are good, even though they are below $1 or agreeing with what they think was my poiont and shilling stuff like NANO which costs more than that.</p>\n\n<p>As people seemingly only read the title, I will try again with this one. I bought ADA at $0.25, I have LTO, there are great coins below $1 (because coin price doesn&#39;t matter). Even if your coin is bad, it&#39;s totally fine if you buy it and want to make profits, it can work out perfectly, look at how Doge did! The real message was that, for example:</p>\n\n<ul>\n<li>Doge: coin price $0.52, market cap 67.5 billion USD: <strong>NOT CHEAP</strong></li>\n<li>Safemoon: price $0.000009, market cap 5.2 billion USD: <strong>NOT CHEAP</strong></li>\n</ul>\n\n<p>But on the other hand, a coin with a high price might be cheap (and please don&#39;t buy this one, I have no idea what it does, just picked random coin with a high coin price and relatively low market cap):</p>\n\n<ul>\n<li>Xiotri: coin price $1,390, market cap about 5 million USD: <strong>CHEAP</strong></li>\n</ul>\n\n<p>Xiotri is 1,000 times cheaper than Safemoon and more than 10,000 times cheaper than DOGE. It&#39;s about market cap. Please, feel free to buy your coins worth $0.00000000001 with 1,000,000,000,000,000,000 tokens in circulation, maybe some of them are good! But know what is &quot;cheap&quot; and what isn&#39;t!</p>\n</div><!-- SC_ON -->",
  "score": 1156,
  "permalink": "/r/CryptoCurrency/comments/ndo4sf/buying_cheap_coins_below_1_is_fine_some_are_good/",
  "subreddit": "CryptoCurrency",
  "id": "ndo4sf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590799662
}