{
  "author": "insertusernamehere51",
  "original_created_utc": 1644362772,
  "title": "Was Sun Wukong a character created for Journey to the West, or was he an existing legendary character that was simply used for the novel, like Odysseus and the Odyssey?",
  "created_utc": 1644393399,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I ask this because everywhere I look him up people are pretty careful to say stuff like &amp;quot;a legendary character best known for appearing in Journey to the West&amp;quot; instead of &amp;quot;a character from Journey to the West&amp;quot;. Yet, every info on him seems to be taken specifically from Journey to the West, I haven&amp;#39;t found any story about him that predates the book.&lt;/p&gt;\n\n&lt;p&gt;Is this a situation like with some greek characters like Odysseus, where, Homer didn&amp;#39;t invent the character, the Odyssey is simply recounting already existing myths about him? (At least, that&amp;#39;s what I understand about the Odyssey, If I&amp;#39;m wrong about this, please let me know)&lt;/p&gt;\n\n&lt;p&gt;Mind you, I&amp;#39;m not asking whether Sun Wukong has similar textual predecessors, like other legendary monkeys that Wu Cheng&amp;#39;en might have drawn from.&lt;/p&gt;\n\n&lt;p&gt;i&amp;#39;m asking whether a Chinese man in 1592 would pick up the hot new NYT bestseller and think &amp;quot;Oh, Sun Wukong, yes I know that guy.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;And if he did, what would he know of him?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/sny4xx/was_sun_wukong_a_character_created_for_journey_to/",
  "subreddit": "AskHistorians",
  "id": "sny4xx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I ask this because everywhere I look him up people are pretty careful to say\nstuff like \"a legendary character best known for appearing in Journey to the\nWest\" instead of \"a character from Journey to the West\". Yet, every info on him\nseems to be taken specifically from Journey to the West, I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "というのも、彼のことを調べるたびに、人々はかなり注意深くこう言うのです。\n旅順に登場することで有名な伝説のキャラクター」みたいな感じで\n西遊記のキャラクター」ではなく、「西遊記のキャラクター」。しかし、彼に関するすべての情報\n西遊記から引用しているようですが、私は...。",
      "title": "孫悟空は『西遊記』のために作られたキャラクターなのか、それとも既存の伝説上のキャラクターを『オデュッセイア』と同じように小説のために使っただけなのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我问这个问题是因为我在任何地方查找他的资料时，人们都很小心地说到\n诸如 \"因出现在《西游记》中而闻名于世的传奇人物\"，而不是 \"他是一个传奇人物\"。\n而不是\"《西游记》中的人物\"。然而，所有关于他的信息\n似乎都是专门从《西游记》中提取的，我...",
      "title": "孙悟空是为《西游记》创造的人物，还是一个已有的传奇人物，只是被用于小说，就像奥德修斯和《奥德赛》一样？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我問這個問題是因爲我在任何地方查找他的資料時，人們都很小心地說到\n諸如 \"因出現在《西遊記》中而聞名於世的傳奇人物\"，而不是 \"他是一個傳奇人物\"。\n而不是\"《西遊記》中的人物\"。然而，所有關於他的信息\n似乎都是專門從《西遊記》中提取的，我...",
      "title": "孫悟空是爲《西遊記》創造的人物，還是一個已有的傳奇人物，只是被用於小說，就像奧德修斯和《奧德賽》一樣？"
    }
  ]
}