{
  "author": "insertusernamehere51",
  "original_created_utc": 1644362772,
  "title": "Was Sun Wukong a character created for Journey to the West, or was he an existing legendary character that was simply used for the novel, like Odysseus and the Odyssey?",
  "created_utc": 1644393399,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I ask this because everywhere I look him up people are pretty careful to say stuff like &amp;quot;a legendary character best known for appearing in Journey to the West&amp;quot; instead of &amp;quot;a character from Journey to the West&amp;quot;. Yet, every info on him seems to be taken specifically from Journey to the West, I haven&amp;#39;t found any story about him that predates the book.&lt;/p&gt;\n\n&lt;p&gt;Is this a situation like with some greek characters like Odysseus, where, Homer didn&amp;#39;t invent the character, the Odyssey is simply recounting already existing myths about him? (At least, that&amp;#39;s what I understand about the Odyssey, If I&amp;#39;m wrong about this, please let me know)&lt;/p&gt;\n\n&lt;p&gt;Mind you, I&amp;#39;m not asking whether Sun Wukong has similar textual predecessors, like other legendary monkeys that Wu Cheng&amp;#39;en might have drawn from.&lt;/p&gt;\n\n&lt;p&gt;i&amp;#39;m asking whether a Chinese man in 1592 would pick up the hot new NYT bestseller and think &amp;quot;Oh, Sun Wukong, yes I know that guy.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;And if he did, what would he know of him?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/sny4xx/was_sun_wukong_a_character_created_for_journey_to/",
  "subreddit": "AskHistorians",
  "id": "sny4xx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I ask this because everywhere I look him up people are pretty careful to say\nstuff like \"a legendary character best known for appearing in Journey to the\nWest\" instead of \"a character from Journey to the West\". Yet, every info on him\nseems to be taken specifically from Journey to the West, I…"
}