{
  "author": "reyrey1332",
  "original_created_utc": 1633974106,
  "title": "Bitcoin is King",
  "created_utc": 1633980613,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For all of you who have said Bitcoin doesn&#39;t have much left in it or that you&#39;d rather invest 100% in alts...just look at the charts and prices.  This is why you always need a large chunk of your portfolio in BTC.</p>\n\n<p>It&#39;s king, and will remain king for the foreseeable future.  </p>\n\n<p>The reason most people suggest investing in Bitcoin is because for the most part it outperforms the entire market year in and year out.  And it won&#39;t disappear like most alts will.</p>\n\n<p>50% of my portfolio is in BTC and ETH.  I take my profits from all other alts and pour them into Bitcoin.</p>\n\n<p>BTC is King.  You can&#39;t convince me otherwise.</p>\n</div><!-- SC_ON -->",
  "score": 282,
  "permalink": "/r/CryptoCurrency/comments/q619oa/bitcoin_is_king/",
  "subreddit": "CryptoCurrency",
  "id": "q619oa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For all of you who have said Bitcoin doesn't have much left in it or that you'd\nrather invest 100% in alts...just look at the charts and prices. This is why you\nalways need a large chunk of your portfolio in BTC.\n\nIt's king, and will remain king for the foreseeable future.\n\nThe reason most people…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインはもうあまり残っていないとか、アルトに100％投資したほうがいいと言っていた人たちへ。\nアルトに100％投資したほうがいい」と言っていた皆さん、チャートと価格を見てください。これが理由です。\nポートフォリオの大部分をBTCにする必要があります。\n\nBTCは王者であり、近い将来も王者であり続けるでしょう。\n\n多くの人がBTCに投資する理由は...",
      "title": "Bitcoin is King"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于所有说比特币已经所剩无几的人，或者说你宁愿100%地投资于替代品的人来说\n宁可100%投资于代理人......看看图表和价格就知道了。这就是为什么你\n这就是为什么你总是需要将你的投资组合中的一大部分放在BTC上。\n\n它是国王，并且在可预见的未来仍将是国王。\n\n大多数人的原因是...",
      "title": "比特币为王"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於所有說比特幣已經所剩無幾的人，或者說你寧願100%地投資於替代品的人來說\n寧可100%投資於代理人......看看圖表和價格就知道了。這就是爲什麼你\n這就是爲什麼你總是需要將你的投資組合中的一大部分放在BTC上。\n\n它是國王，並且在可預見的未來仍將是國王。\n\n大多數人的原因是...",
      "title": "比特幣爲王"
    }
  ]
}