{
  "author": "Count_Archon",
  "the_new_excerpt": "During the 90s, North Korea was a country on the verge of breaking due to the\nfamine, Russia was effectively reduced to a status of a minor power due to the\ncollapse of the USSR and incompetent Yeltsin administration, China was nowhere\nnear as strong as today and the US public was reinvigorated by…",
  "original_created_utc": 1624009414,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "90年代は、北朝鮮が飢饉で崩壊寸前の国になり、ロシアが事実上の小国になった。\nロシアはソビエト連邦の崩壊と無能なエリツィン政権により、事実上の小国に成り下がっていました。\nロシアはソビエト連邦の崩壊と無能なエリツィン政権により事実上の小国になり、中国は今ほど強くなく、米国の世論は\n中国は今ほど強くはなく、アメリカの国民は...で元気を取り戻していた。",
      "title": "90年代の飢饉の際、韓国や欧米は、北朝鮮を解体したり、韓国との合流を迫るのではなく、なぜ食料を寄付して助けたのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在90年代，由于饥荒，朝鲜是一个濒临崩溃的国家。\n饥荒，俄罗斯由于苏联解体和叶利钦政府的无能，实际上已经沦为一个小国。\n苏联解体和无能的叶利钦政府，中国远没有今天这么强大。\n中国远没有今天这么强大，而美国公众则因......而重新振作起来。",
      "title": "为什么韩国和西方在90年代的饥荒中通过捐赠食物来帮助朝鲜，而不是试图拆解这个残缺的国家或迫使它与韩国重新结合？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在90年代，由於饑荒，朝鮮是一個瀕臨崩潰的國家。\n饑荒，俄羅斯由於蘇聯解體和葉利欽政府的無能，實際上已經淪爲一個小國。\n蘇聯解體和無能的葉利欽政府，中國遠沒有今天這麼強大。\n中國遠沒有今天這麼強大，而美國公衆則因......而重新振作起來。",
      "title": "爲什麼韓國和西方在90年代的饑荒中通過捐贈食物來幫助朝鮮，而不是試圖拆解這個殘缺的國家或迫使它與韓國重新結合？"
    }
  ],
  "title": "Why did the South Korea and the West help North Korea during the 90s famine by donating food instead of trying to dismantle the crippled country or forcing it to rejoin with the South Korea?",
  "created_utc": 1624067253,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>During the 90s, North Korea was a country on the verge of breaking due to the famine, Russia was effectively reduced to a status of a minor power due to the collapse of the USSR and incompetent  Yeltsin administration, China was nowhere near as strong as today and the US public was reinvigorated by the decisive victory in the Gulf War in 1991 after a period of mild defeatism following the Vietnam War failure. Why didn&#39;t the US and South Korea attempt to pressure (or invade) North Korea to rejoin it the the South at the time they were weak and the US was the sole global superpower?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/o2lbf8/why_did_the_south_korea_and_the_west_help_north/",
  "subreddit": "AskHistorians",
  "id": "o2lbf8",
  "is_self": true,
  "media": null,
  "is_video": false
}