{
  "author": "TheSukis",
  "the_new_excerpt": "As far as I know, it isn't a common experience for someone to feel hunger pangs\nafter looking at, say, a living cow or pig. Instead, we feel hungry when we look\nat food that has been prepared for consumption (such as a steak or bacon). Even\nuncooked meat probably doesn't elicit that reaction in many…",
  "original_created_utc": 1618179164,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の知る限り、生きている牛や豚を見て空腹を感じるということは\n生きている牛や豚を見て空腹を感じるというのは、私の知る限りでは一般的ではありません。むしろ、生きている牛や豚を見て空腹を感じるのは\nステーキやベーコンなど、調理されたものを見て空腹を感じます。たとえ\n食べるために調理されたもの（ステーキやベーコンなど）を見て空腹を感じる。",
      "title": "生きている動物を見て食欲をそそられるようになったのは、進化の過程でどのくらいの時期だったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "据我所知，它不是一个常见的经验 有人感到饥饿的恐慌。\n比如说，看了一头活生生的牛或猪之后，我们就会感到饥饿。相反，当我们看到\n在已经准备好食用的食物（如牛排或培根）。甚至\n未煮熟的肉可能不会引起许多人的反应... ...",
      "title": "在我们的进化史上，我们的食欲是在多晚的时候被看到活生生的动物所引发的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據我所知，它不是一個常見的經驗 有人感到飢餓的恐慌。\n比如說，看了一頭活生生的牛或豬之後，我們就會感到飢餓。相反，當我們看到\n在已經準備好食用的食物（如牛排或培根）。甚至\n未煮熟的肉可能不會引起許多人的反應... ...",
      "title": "在我們的進化史上，我們的食慾是在多晚的時候被看到活生生的動物所引發的？"
    }
  ],
  "title": "How recently in our evolutionary history was our appetite triggered by the sight of living animals?",
  "created_utc": 1618187460,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As far as I know, it isn&#39;t a common experience for someone to feel hunger pangs after looking at, say, a living cow or pig.  Instead, we feel hungry when we look at food that has been prepared for consumption (such as a steak or bacon).  Even uncooked meat probably doesn&#39;t elicit that reaction in many of us, nor would a field of corn (versus buttered corn on the cobb).</p>\n\n<p>In comparison, I imagine that for other carnivorous animals, the sight of a living prey species would actually activate the &quot;yummy food&quot; areas of their brain and make them want to eat.  I imagine that an owl, for instance, would see a mouse running across a field and feel an urge to put it in its mouth.</p>\n\n<p>My question: how far back would we have to go to find that most humans would look at a wildebeest or bird and feel hunger pangs?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/askscience/comments/mp0oqf/how_recently_in_our_evolutionary_history_was_our/",
  "subreddit": "askscience",
  "id": "mp0oqf",
  "is_self": true,
  "media": null,
  "is_video": false
}