{
  "author": "kdeeneyzz",
  "the_new_excerpt": "I am a young investor, been investing since Summer 2020. I would say this was\nthe first major market correction for my positions. It has been a tough month,\nbut this sub helped me keep my calm. There were numerous occasions, where I was\nsure I should close my positions, but the excessive amount of…",
  "original_created_utc": 1615312838,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个年轻的投资者，从2020年夏天开始投资。我想说这是\n我的仓位第一次出现大的市场调整。这是一个艰难的月份。\n但这个子帮我保持了冷静。有许多场合，我是\n我当然应该平仓，但过多的... ...",
      "title": "谢谢大家帮我度过了二月的血雨腥风。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個年輕的投資者，從2020年夏天開始投資。我想說這是\n我的倉位第一次出現大的市場調整。這是一個艱難的月份。\n但這個子幫我保持了冷靜。有許多場合，我是\n我當然應該平倉，但過多的... ...",
      "title": "謝謝大家幫我度過了二月的血雨腥風。"
    }
  ],
  "title": "Thank you all for helping me go through the bloodbath of February",
  "created_utc": 1615321296,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am a young investor, been investing since Summer 2020. I would say this was the first major market correction for my positions. It has been a tough month, but this sub helped me keep my calm. There were numerous occasions, where I was sure I should close my positions, but the excessive amount of posts here on &quot;Sell high, buy low&quot; topic kept me going.</p>\n\n<p>I know the correction might not be over, I just went up 7% and wanted to share my appreciation to the people of this sub. These days, it is super easy to be baited by the madness on wall street bets. But it is good enough that we have this community, where we can invest safely and wisely instead of gambling.</p>\n\n<p>Thank y&#39;all and let this spring bring constant and healthy growth to all of our portfolios!</p>\n</div><!-- SC_ON -->",
  "score": 442,
  "permalink": "/r/stocks/comments/m1c7ag/thank_you_all_for_helping_me_go_through_the/",
  "subreddit": "stocks",
  "id": "m1c7ag",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542577963
}