{
  "author": "Fun_Scallion2687",
  "original_created_utc": 1658475330,
  "title": "I have noticed that some Americans on Reddit seem to assume everyone else is American, why do you think that is?",
  "created_utc": 1658491191,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve noticed in discussions on here that some people based in the US will say things like ‘this country’ or ‘our education system’ etc and just assume people know where they are talking about.  Is this specific to Americans or do I just notice them more  because there are a lot of Americans on Reddit? Or is it, maybe, because Reddit is an American website? Or something else entirely?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/w54fu1/i_have_noticed_that_some_americans_on_reddit_seem/",
  "subreddit": "NoStupidQuestions",
  "id": "w54fu1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve noticed in discussions on here that some people based in the US will say\nthings like ‘this country’ or ‘our education system’ etc and just assume people\nknow where they are talking about. Is this specific to Americans or do I just\nnotice them more because there are a lot of Americans on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここでの議論で気づいたのですが、アメリカを拠点とする人たちの中には\nこの国」「教育システム」などと言って、その人がどこの国のことを言っているのかを\nを言う人がいます。これはアメリカ人特有のものなのでしょうか？\nこれはアメリカ人特有のものなのでしょうか、それともアメリカ人が多いので私が気づくだけなのでしょうか...。",
      "title": "Redditでは、一部のアメリカ人が、他の人はみんなアメリカ人だと思い込んでいるようですが、なぜだと思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我注意到在这里的讨论中，一些在美国的人说\n诸如 \"这个国家 \"或 \"我们的教育系统 \"等，并认为人们知道他们在哪里。\n他们知道自己在说什么。这是美国人特有的现象吗，还是我只是\n我更多地注意到他们，因为有很多美国人在...",
      "title": "我注意到，Reddit上的一些美国人似乎认为其他人都是美国人，你认为这是为什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我注意到在這裏的討論中，一些在美國的人說\n諸如 \"這個國家 \"或 \"我們的教育系統 \"等，並認爲人們知道他們在哪裏。\n他們知道自己在說什麼。這是美國人特有的現象嗎，還是我只是\n我更多地注意到他們，因爲有很多美國人在...",
      "title": "我注意到，Reddit上的一些美國人似乎認爲其他人都是美國人，你認爲這是爲什麼？"
    }
  ]
}