{
  "author": "throwaway2721111usbz",
  "original_created_utc": 1638407323,
  "title": "Does anyone else buy Bitcoin when there black out drunk?",
  "created_utc": 1638451940,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This may seem like a weird one but it’s 100% true. So I’m a college student (I drink all the time) and whenever I get super wasted I end up buying WAY too much Bitcoin, more than I can afford.&lt;/p&gt;\n\n&lt;p&gt;I get super cocky and confident when I’m drunk, and think about living on the edge and taking risks, and end up making huge purchases of bitcoin once I’m home.&lt;/p&gt;\n\n&lt;p&gt;I used to buy little amounts of Bitcoin and gamble on roobet or sometning (no more  than 50$) but I’ve already came back from 2 parties this month and have spent 3000$ each time on Bitcoin &lt;/p&gt;\n\n&lt;p&gt;Didn’t even gamble it. One of the purchases I completely forgot I did so and had to do some investigation on why I received a ton of Bitcoin after a night of partying.&lt;/p&gt;\n\n&lt;p&gt;Any tips on how to stop or what I should do&lt;/p&gt;\n\n&lt;p&gt;Edit: thanks guys for the advice. I’ve decided to call my bank tommorow morning and black list my card from Binance. I have also deleted my account.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 160,
  "permalink": "/r/Bitcoin/comments/r6uqcw/does_anyone_else_buy_bitcoin_when_there_black_out/",
  "subreddit": "Bitcoin",
  "id": "r6uqcw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This may seem like a weird one but it’s 100% true. So I’m a college student (I\ndrink all the time) and whenever I get super wasted I end up buying WAY too much\nBitcoin, more than I can afford.\n\nI get super cocky and confident when I’m drunk, and think about living on the\nedge and taking risks, and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは奇妙なことのように思えるかもしれませんが、100％真実なのです。私は大学生です。\nいつも飲んでいるのですが、超酔っぱらうと、ついつい買いすぎてしまうんです。\nビットコイン、買える量より多いんです。\n\n酔っぱらうと超生意気で自信満々になるんです。\nそして、リスクを取る。",
      "title": "ブラックアウトした酔っ払いがビットコインを買っている人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这可能看起来像一个奇怪的问题，但它是100%真实的。所以我是一个大学生（我\n我一直在喝酒），每当我喝得酩酊大醉时，我就会买太多的\n比特币，超过了我的承受能力。\n\n当我喝醉的时候，我就会变得非常狂妄和自信，并考虑到生活在\n和冒险，然后...",
      "title": "还有人在醉酒后买比特币吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這可能看起來像一個奇怪的問題，但它是100%真實的。所以我是一個大學生（我\n我一直在喝酒），每當我喝得酩酊大醉時，我就會買太多的\n比特幣，超過了我的承受能力。\n\n當我喝醉的時候，我就會變得非常狂妄和自信，並考慮到生活在\n和冒險，然後...",
      "title": "還有人在醉酒後買比特幣嗎？"
    }
  ]
}