{
  "author": "jn_ku",
  "the_new_excerpt": "Disclaimer: I am not a financial advisor. This entire post represents my\npersonal views and opinions, and should not be taken as financial advice (or\nadvice of any kind whatsoever). I encourage you to do your own research, take\nanything I write with a grain of salt, and hold me accountable for any…",
  "original_created_utc": 1611688297,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "免责声明：我不是财务顾问。整篇文章仅代表我\n个人观点和意见，不应视为财务建议（或）。\n任何形式的建议）。) 我鼓励你做自己的研究，采取必要的措施。\n我写的任何东西都要小心翼翼，并让我对任何... ...",
      "title": "Gamestop大图片。短暂的奇点"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "免責聲明：我不是財務顧問。整篇文章僅代表我\n個人觀點和意見，不應視爲財務建議（或）。\n任何形式的建議）。) 我鼓勵你做自己的研究，採取必要的措施。\n我寫的任何東西都要小心翼翼，並讓我對任何... ...",
      "title": "Gamestop大圖片。短暫的奇點"
    }
  ],
  "title": "Gamestop Big Picture: The Short Singularity",
  "created_utc": 1611693898,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>Disclaimer: I am not a financial advisor. This entire post represents my personal views and opinions, and should not be taken as financial advice (or advice of any kind whatsoever). I encourage you to do your own research, take anything I write with a grain of salt, and hold me accountable for any mistakes you may catch.</em></p>\n\n<p>There are numerous posts on this sub and others diving into the technical guts behind some of the recent moves behind GME, so I will keep it high level for everyone scratching their heads wondering what&#39;s going on.</p>\n\n<p>There has been much talk on CNBC and in other financial media calling what&#39;s happening in GME a distortion of the market and an unjustifiable departure from the fundamentals. That is undeniably true. That being said, the distortion is not what&#39;s playing out now, but rather what happened about 1.5 years ago when short interest in GME first began to approach (and later exceed) 100% of the available float.</p>\n\n<p>Short selling is usually a tool that aids in price discovery, but like most market mechanisms, at the extremes things get more complicated.</p>\n\n<p>Short sellers, having borrowed shares, are guaranteed (indeed obligated) future buyers of the stock. They put themselves in that position on the thesis that there are reasons to expect the stock price to go down, such that when they buy the shares back they can return what they borrowed at a lower price and pocket the difference. As such, as short interest grows, there is a short term downard push on the price (the initial sale of the borrowed shares), but also future upside pull on the stock price as a natural result, kind of like gravity, but pulling the price upward. Normally that pressure is so slight and subtle that short interest in and of itself should not be a mover of the stock price.</p>\n\n<p>That being said, a common rule of thumb is that you should start to concern yourself with that pressure when short interest crosses the threshold of between 20% and 25% of the effective float (shares actually available to trade). At that level and above, the pressure starts to become noticeable, kind of like the moon causing currents and tides.</p>\n\n<p>GME short interest was recently <strong>140%</strong> of the float. In recent days, short interest has actually continued to accumulate (I&#39;ll explain why later).</p>\n\n<p>There is, in effect, a critical mass of short interest hanging over GME&#39;s price exerting not subtle pull, but face-ripping force like the gravity of a black hole. A short singularity, if you will.</p>\n\n<p>Previous short squeeze case studies such as VW or KBIO were all about someone engineering a way for effective float to evaporate, suddenly leaving what was previously a relatively reasonable aggregate short interest position in a world of hurt. This is the first time where we&#39;re seeing a situation play out where it wasn&#39;t someone engineering a shrinkage of effective float, but large market-moving players simply blowing up the short interest to the point where it simply overtook effective float by a large margin. Why would they do that? Because they expected GME to declare bankruptcy in the very near term so that returning borrowed shares costs $0, as the shares are worthless at that point. Also, an arguably intentional side-effect of this massive artificial sell-side pressure on the stock is that it becomes more difficult for GME to obtain any kind of financing to avoid bankruptcy, making it, in theory, a self-fulfilling prophecy. GME, however, did not go bankrupt for reasons that are well explained by other posters.</p>\n\n<p>In order to close their positions and limit their exposure (which remains theoretically infinite otherwise), short interest holders need to collectively buy back more shares than are available on the market, and especially since GME is no longer at risk of imminent bankruptcy, that buying action would push the price into a parabolic upward move, likely forcing brokers to liquidate short interest-holding accounts across the board on the way to buy shares at any price to cover their otherwise infinite liability exposure (and that forced covering will push the price further upward into a feedback loop--like crossing the event horizon of the black hole in our analogy).</p>\n\n<p>So what is happening now, and where do we go from here?</p>\n\n<p>Right now, short-side interests are desperately trying to drive the price down. There has been an across-the-board media blitz to try to scare investors away from GME. But there is really only one way to drive price down directly, and that is selling. In fact, given that most of the large holders of GME long positions are simply sitting on their shares, it means selling. even. more. shares. short.</p>\n\n<p>Even as price has been grinding upward, and liquidity has been evaporating, short sellers, who have lost billions mark-to-market currently (my guess is on the order of $10bn by the end of trading today), can only keep selling, piling on even more exposure and losses, staving off oblivion hour by hour, minute by minute.</p>\n\n<p>GME might also decide to issue more shares to recapitalize its business on the back of the elevated share price, but it is unlikely they could issue enough shares to change the overall trajectory of the stock at this point (especially not given their fiduciary responsibility to current stock holders). It might, however, run the clock out a little while longer.</p>\n\n<p>At this point it looks like there will either be some type of external market intervention by regulators (though I can&#39;t see any reason for them to step in myself), or we will soon see what happens when short positions representing ~$8bn in current mark-to-market liability goes parabolic.</p>\n\n<p>*edited for grammar*</p>\n\n<p><em>edit</em>\nPlease keep discussion to helping everyone understand what’s happening, which is the point of this post, not giving advice or telling people to take actions!</p>\n</div><!-- SC_ON -->",
  "score": 3701,
  "permalink": "/r/investing/comments/l5l413/gamestop_big_picture_the_short_singularity/",
  "subreddit": "investing",
  "id": "l5l413",
  "is_self": true,
  "media": null,
  "is_video": false
}