{
  "author": "TrueSpins",
  "the_new_excerpt": "I get it.\n\nWhen you're in the middle of a bull market and prices continue to rise, it's\neasy to think that other, more traditional methods of income are a waste of\ntime. Your salary suddenly seems inconsequential and other investments are\nboring as hell.\n\nWe often talk about not putting all your…",
  "original_created_utc": 1615974876,
  "localize": [
    {
      "locale": "zh",
      "title": "如果加密技术已经让你不再关心生活中的其他元素，你急需重新考虑事情......",
      "the_new_excerpt": "我明白了。\n\n当你在一个牛市的中间，价格继续上升，它是。\n容易认为其他更传统的收入方式是一种浪费。\n的时间。你的工资突然显得无足轻重，而其他的投资则是\n无聊至极。\n\n我们常说不要把你所有的..."
    },
    {
      "locale": "zh-Hant",
      "title": "如果加密技術已經讓你不再關心生活中的其他元素，你急需重新考慮事情......",
      "the_new_excerpt": "我明白了。\n\n當你在一個牛市的中間，價格繼續上升，它是。\n容易認爲其他更傳統的收入方式是一種浪費。\n的時間。你的工資突然顯得無足輕重，而其他的投資則是\n無聊至極。\n\n我們常說不要把你所有的..."
    }
  ],
  "title": "If crypto has stopped you caring about other elements of your life, you need to urgently reconsider things...",
  "created_utc": 1615988506,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I get it.</p>\n\n<p>When you&#39;re in the middle of a bull market and prices continue to rise, it&#39;s easy to think that other, more traditional methods of income are a waste of time. Your salary suddenly seems inconsequential and other investments are boring as hell.</p>\n\n<p>We often talk about not putting all your money into crypto, but there&#39;s another element to this too - you shouldn&#39;t dedicate all your mental energy to crypto either.</p>\n\n<p>When the next bear market comes, and it will come at some point, having nothing in your life except crypto and your portfolio app is going to make for a very depressing period.</p>\n\n<p>Even if you&#39;re making paper profits of 10k a day, you still need to develop other areas of your life - whether that&#39;s career, relationships, new business ventures etc - because everyone needs something to fall back on, both financially AND mentally.</p>\n\n<p>I run a small SaaS platform in my spare time, and it generates very little money in the grand scheme of things. But it&#39;s mine and I enjoy developing it and getting new customers. If the crypto market was to tank tomorrow, I&#39;d still have this, and that would mean a lot to me. </p>\n\n<p>Equally, I also have my normal job, and whilst it can be a bit dull at times (and in recent months almost a bit pointless!) it is still something I have continued to strive at, and it&#39;s another form of personal development that can open future financial doors.</p>\n\n<p>This is essentially a post about eggs and baskets, but just wanted to point out that the metaphor is more than just financial - it&#39;s also about your wider mindset and not letting other areas of your life slide.</p>\n</div><!-- SC_ON -->",
  "score": 5224,
  "permalink": "/r/CryptoCurrency/comments/m6wvqo/if_crypto_has_stopped_you_caring_about_other/",
  "subreddit": "CryptoCurrency",
  "id": "m6wvqo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147378438
}