{
  "author": "Fair-Reception3763",
  "original_created_utc": 1660491758,
  "title": "How did Trump manage to convince Conservative voters that he was their man?",
  "created_utc": 1660514526,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I fully understand that he managed to convince them he was their guy, but I can&amp;#39;t for life of me understand how these people believed him or why they&amp;#39;re willing to storm the capital for him.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t mean just general assholes who look for any other general asshole to agree with them and get loud about it. I mean particularly, the disenfranchised white voters who have been suffering after the loss of industry in many rural parts of the country, who are relatively poor, likely undereducated, and probably had no interest in Trump before, who would have in all likelihood considered him a silver-spoon outsider who couldn&amp;#39;t possibly understand their struggles.&lt;/p&gt;\n\n&lt;p&gt;How did this slimy, wealthy businessman convince these people he was for them? These are the people he would have ignored his entire life except to call them peeons. These are the people he would have happily taken jobs from if it meant he could save money elsewhere.&lt;/p&gt;\n\n&lt;p&gt;How did Trump convince these people he was one of them? It makes no sense to see Donald Trump, away from his Trump Tower, publicly mocking a disabled person in front of millions of people, standing amongst the ex-coal miners saying he&amp;#39;s one of them and them actually believing him. Or was it just desperation on their part? Why did they grasp for him when he&amp;#39;s so obviously not one of them?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/wo9bxo/how_did_trump_manage_to_convince_conservative/",
  "subreddit": "TooAfraidToAsk",
  "id": "wo9bxo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I fully understand that he managed to convince them he was their guy, but I\ncan't for life of me understand how these people believed him or why they're\nwilling to storm the capital for him.\n\nI don't mean just general assholes who look for any other general asshole to\nagree with them and get loud…"
}