{
  "author": "CryptoMaximalist",
  "original_created_utc": 1630600095,
  "title": "Moon Week 17 - A New Moons Feature, New Governance Polls, and the Latest Distribution Proposal",
  "created_utc": 1630675837,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone and welcome to Moon Week for round 17 of Moons!  </p>\n\n<p>Moon Week began yesterday with <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/pg1eqh/new_moons_distribution_round_17_proposal/\">the snapshot post by the admins</a>.  Check out the post and comments to see how many moons you&#39;ll be getting next Wednesday at the end of Moon Week.  </p>\n\n<p>A special thank you to the admins for implementing the highly requested &quot;I Voted&quot; badges!  These are visible next to usernames on new.reddit and the reddit mobile app.  If you have voted and yours is not showing, you may need to enable it manually by clicking your badges and looking at the Achievements tab.</p>\n\n<p>To give exposure to our governance polls for the month, this Moon Week post will remain pinned to the top of the subreddit until the distribution post next Wednesday.  Please review the following important information and frequently asked questions first:</p>\n\n<ul>\n<li><strong>You can&#39;t change your vote</strong> so make sure you read the full post and discussions, and ask any questions you have before you vote.  There are people wishing they voted differently every month and you have several days to vote so there is no need to rush it.</li>\n<li>If you can&#39;t see or vote in polls, or have any other issue, try again later or from a different platform.  These glitches usually resolve themselves, but let us know if it hasn&#39;t after a day or two.</li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/pff5w7/moon_week_17_begins_tomorrow_see_rule_reminders/\">Do not harass poll authors, tell people to cast a certain vote, brigade polls, or derail discussions</a>.</li>\n<li><a href=\"https://np.reddit.com/r/CryptoCurrency/comments/m7ehzz/proposal_5_bonus_moons_for_anyone_who_votes_on/\">You get a 5% moon bonus for voting in at least 1 poll</a>.</li>\n<li>There are 2 similar anti-spam polls this month that were created independently and happened to be posted within minutes of each other. We do not see any way in which these conflict, so they could both be implemented as far as we know. However, if they both pass and the admins feel they conflict, the one with more votes in favor will be considered the winner.</li>\n</ul>\n\n<p>With all that aside, here are your polls for round 17 of Moons:</p>\n\n<ul>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/pffoe7/incentivize_voting_in_multiple_polls/\">Incentivize Voting in Multiple Polls</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/pfxa4t/offer_custom_flairs_to_users_with_an_active/\">Offer Custom Flairs to Users with an Active Special Membership</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/pftw5l/disincentivize_extreme_moon_farming_spam/\">Disincentivize Extreme Moon Farming Spam</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/pfsgwd/countering_the_spam_in_comments_less_karma_for/\">Countering the spam in comments: less karma for extreme number of comments</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/pfxh47/should_all_formal_governance_polls_be_posted_by_a/\">Should all formal governance polls be posted by a shared moderator account?</a></li>\n</ul>\n\n<p>For more information about Moons, please <a href=\"https://www.reddit.com/r/CryptoCurrency/wiki/moons_wiki\">see our wiki page here</a>.</p>\n\n<p>Happy voting!</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/pglb6g/moon_week_17_a_new_moons_feature_new_governance/",
  "subreddit": "CryptoCurrency",
  "id": "pglb6g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello everyone and welcome to Moon Week for round 17 of Moons!\n\nMoon Week began yesterday with the snapshot post by the admins\n[https://www.reddit.com/r/CryptoCurrency/comments/pg1eqh/new_moons_distribution_round_17_proposal/].\nCheck out the post and comments to see how many moons you'll be getting…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは！第17戦ムーンのムーンウィークにようこそ\n\n昨日、管理人のスナップショット投稿により、ムーンウィークが始まりました。\n[https://www.reddit.com/r/CryptoCurrency/comments/pg1eqh/new_moons_distribution_round_17_proposal/]をご覧ください。\n投稿とコメントをチェックして、何個のムーンがもらえるか確認してみてくださいね。",
      "title": "Moon Week 17 - 新しい月の特集、新しいガバナンスの投票、そして最新の分配案"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，欢迎来到月亮周的第17轮月亮!\n\n月亮周从昨天开始，管理员发布了快照。\n[https://www.reddit.com/r/CryptoCurrency/comments/pg1eqh/new_moons_distribution_round_17_proposal/]。\n请看帖子和评论，看看你会得到多少个月亮...",
      "title": "月亮周17--新的月亮专题、新的治理民意调查和最新的分配建议"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，歡迎來到月亮周的第17輪月亮!\n\n月亮周從昨天開始，管理員發佈了快照。\n[https://www.reddit.com/r/CryptoCurrency/comments/pg1eqh/new_moons_distribution_round_17_proposal/]。\n請看帖子和評論，看看你會得到多少個月亮...",
      "title": "月亮周17--新的月亮專題、新的治理民意調查和最新的分配建議"
    }
  ]
}