{
  "author": "ADhomin_em",
  "original_created_utc": 1626423819,
  "title": "Welp...I'm a dumb-ass but I got lucky. If you are panicking about restoring a wallet, calm down. Breath. Be aware of scams.",
  "created_utc": 1626450317,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m sure there are plenty who are already shaking their heads at me. It&#39;s such an obvious rookie mistake.</p>\n\n<p>So I&#39;m not totally new to the cryptosphere. I&#39;m starting to get involved more in the world and was allowed in on a testnet. I went through the process of adding the network and when I did, I couldn&#39;t figure out how to get back to the mainnet. Metamask wasn&#39;t switching back. I thought I must have fucked myself. On little sleep and in the wee hours of the morning, I started to panic. Restore metamask. Gotta do it. </p>\n\n<p>I get on my browser and type in metamask. First result is &quot;restore-metamask.com&quot; I&#39;m still screaming &quot;FUCKING MORON!&quot; at myself for this, but I clicked it. </p>\n\n<p>Looks official. I mean they have the metamask fox logo. Not just anyone can have a fuck-damn fox on their homepage. Real nice site. I don&#39;t even register what I&#39;ve done. It asks for a seed phrase. I oblige. The whole damn thing I type out, without a second thought. </p>\n\n<p>I get into my wallet. My funds are...there. but I can&#39;t click anything. No other options. Right then, a wave of gut wrenching realization came over me, a minute late. </p>\n\n<p>I grab my phone and uninstall metamask, then reinstall it, as I had read this is another way to get back to the mainnet. I go through the proper process to restore and I get into my wallet. Everything is still there. Quickly, I transfer all I can, except a little eth for gas fees. After cleaning out into a new wallet, I left $13 of ETH in the metamask. A fine bit of bait to see if my suspicions (well founded) were accurate (they were). Minutes later, I check and it&#39;s gone. They got in. They took all they could. I&#39;m lucky I had a very brief window of opportunity to move my bags to a different wallet.</p>\n\n<p>All this is really embarrassing to throw down on the table for y&#39;all, but I figured if I can share my $13 dollar lesson with just one more sleep deprived newbie, it&#39;ll not be a total waste. Be safe.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/olcmfi/welpim_a_dumbass_but_i_got_lucky_if_you_are/",
  "subreddit": "CryptoCurrency",
  "id": "olcmfi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm sure there are plenty who are already shaking their heads at me. It's such\nan obvious rookie mistake.\n\nSo I'm not totally new to the cryptosphere. I'm starting to get involved more in\nthe world and was allowed in on a testnet. I went through the process of adding\nthe network and when I did, I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "すでに首をかしげている人もたくさんいると思います。それは、明らかに\n明らかな初歩的なミスです。\n\nですから、私は暗号の世界では全くの初心者ではありません。私は暗号の世界では全くの初心者ではありませんが、少しずつ世の中に関わり始めて\nテストネットに参加させてもらいました。ネットワークを追加するプロセスを経て\nネットワークを追加するプロセスを行ったところ、私は...",
      "title": "ウェルプ...私はおバカだけど、運が良かった。財布の復元でパニックになっている人は、落ち着いてください。息です。詐欺には気をつけましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信有很多人已经在对我摇头了。这是个\n一个明显的新秀错误。\n\n所以我对加密圈并不完全陌生。我开始更多地参与到\n我开始更多地参与这个世界，并被允许加入一个测试网。我经历了添加网络的过程\n网络，当我这样做时，我...",
      "title": "好吧......我是个蠢货，但我很幸运。如果你对恢复钱包感到恐慌，请冷静下来。呼吸。要注意诈骗。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信有很多人已經在對我搖頭了。這是個\n一個明顯的新秀錯誤。\n\n所以我對加密圈並不完全陌生。我開始更多地參與到\n我開始更多地參與這個世界，並被允許加入一個測試網。我經歷了添加網絡的過程\n網絡，當我這樣做時，我...",
      "title": "好吧......我是個蠢貨，但我很幸運。如果你對恢復錢包感到恐慌，請冷靜下來。呼吸。要注意詐騙。"
    }
  ]
}