{
  "author": "sandygws",
  "original_created_utc": 1642435360,
  "title": "Crypto.com’s immediate suspension of withdrawals, fast communication across all social media and typically clear, concise and unambiguous CDC Customer Service: THAT is why Crypto.com will emerge even stronger and safer after the 2FA ‘Hack’.",
  "created_utc": 1642441471,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve been a customer of CDC since just after the MCO days and I’ve always been bullish on their token and wrote as much on this sub more than once. Also have an Icy White and a LOT of crypto staked on The Exchange, in Crypto.com Earn and (due to my CRO entry price being well under $0.10) a six-figure sum of CRO staked for the CDC Icy.&lt;/p&gt;\n\n&lt;p&gt;To wake up today and see Reddit plastered with info about the ‘Hack’ was concerning, but not as concerning as what might happen to the price of CRO. Then I remembered several important factors:&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Security&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;100% of user cryptocurrencies are held offline in cold storage.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;‘Crypto.com has a strategic partnership with Ledger, integrating its institutional-grade custody solution, Ledger Vault. We also leverage hardware security modules (HSM) and multi-signature technologies. Crypto.com has secured a total of USD 750M in cold storage insurance against physical damage or destruction, and third-party theft.’&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Users’ fiat currencies are held in regulated custodian bank accounts.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If you are a U.S. resident, your USD balances are held at Metropolitan Commercial Bank, an FDIC member and insured depository institution. Your USD balances held at Metropolitan Commercial Bank are insured up to USD $250,000. You retain ownership of those funds in Metropolitan Commercial Bank accounts, meaning your fiat funds cannot be claimed by Crypto.com or its creditors.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Crypto.com Becomes the First FinTech Company to achieve the coveted Data Protection Trust Mark (DPTM) awarded by Singapore’s Infocomm Media Development Authority (IMDA)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://blog.crypto.com/crypto-com-first-fintech-company-to-achieve-singapores-data-protection-trust-mark-dptm/\"&gt;https://blog.crypto.com/crypto-com-first-fintech-company-to-achieve-singapores-data-protection-trust-mark-dptm/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Communication&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;As soon as the hack had been confirmed, CDC did what they have always done best: swiftly recognised that there was an ongoing issue and communicated not only what had happened (2FA compromised on user accounts), but also reassured users that all withdrawals would be suspended until they rolled out an app update which would enable 2FA to be re-enabled and accounts once again secured:&lt;/p&gt;\n\n&lt;p&gt;CDC Customer Support on Reddit:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://np.reddit.com/r/Crypto_com/comments/s63105/earlier_today_a_small_number_of_users_experienced/\"&gt;https://np.reddit.com/r/Crypto_com/comments/s63105/earlier_today_a_small_number_of_users_experienced/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Crypto.com CEO Kris Marszalek on Twitter: &lt;a href=\"https://twitter.com/kris_hk/status/1483052762568921088\"&gt;https://twitter.com/kris_hk/status/1483052762568921088&lt;/a&gt; &lt;/p&gt;\n\n&lt;p&gt;Crypto.com Customer Support on Twitter: &lt;a href=\"https://twitter.com/cryptocom/status/1483050866894868484\"&gt;https://twitter.com/cryptocom/status/1483050866894868484&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;CRO and Staking&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;One main reason that a lot of people prefer CDC is the high rates paid on Earn when you stake your coins for a fixed period. Staking is also available on the CDC Exchange and on the CDC DeFi Wallet. That seems to have been a HUGE positive as neither The Exchange nor the DeFi Wallet were affected and remained fully functional while the app was locked for an enforced 2FA reset for all users.&lt;/p&gt;\n\n&lt;p&gt;Moreover, as a large percentage of the supply of CRO is staked, a run on the price of CRO was prevented (at least so far).&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The Crypto.com VISA Cards&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The Wallet for the CDC VISA card has always remained entirely separate from the Fiat Wallet and the Crypto Wallet. You can only transfer -FROM- the Fiat or Crypto Wallets to your VISA Card to top up the balance. There is no option to transfer FROM your CDC VISA back to the Fiat or Crypto Wallets. I now see that as a huge positive as the CDC VISA cards were completely unaffected during the hack and continued to function as normal.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The significance of this hack to the reputation of CDC&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;We’ve been before. Back in 2019 Binance was hacked when 2FA was compromised and some $40 million of crypto was stolen (&lt;a href=\"https://www.plugandplaytechcenter.com/resources/binance-hack-three-lessons-you-can-learn-it/\"&gt;https://www.plugandplaytechcenter.com/resources/binance-hack-three-lessons-you-can-learn-it/&lt;/a&gt;). Binance were also swift to act, admit what had happened and keep users informed of how they would address the breach – that was why trust with users was retained and Binance is today, three years on, the largest exchange in the world.&lt;/p&gt;\n\n&lt;p&gt;At this point, it appears a similar exploit was used by the hackers to gain access to some CDC accounts and some users have reported funds being transferred from their crypto wallets. Given that this has happened less than a month after the renaming of the Staples Center to the Crypto.com Arena – and just a month before the Crypto.com SuperBowl ad is due to air, I’d say the timing of this hack was ideal. Let me explain why …&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Conclusion&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;We all know that CDC have spent an absolute fortune on two things: Regulatory Compliance and Advertising/Sponsorships. They also have official partnerships with VISA and LEDGER. Given just how large their budgets clearly are, securing customer accounts and ensuring this NEVER happens again will almost certainly be their top priority at this point.&lt;/p&gt;\n\n&lt;p&gt;Bad as this is, CDC’s response has so far been textbook and for that they deserve credit. But what will really matter is how they keep us all updated, how they propose to tighten security and -most importantly of all – that CDC fully reimburse any customer who lost funds as a result of this attack.&lt;/p&gt;\n\n&lt;p&gt;Fortune may Favour the Brave, but we crypto holders are unforgiving. CDC, this is your moment to retain our trust and show the sceptics that hiring Jason Bourne was FAR from your best move yet.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 447,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/fFFpRrdpdMZ02e9hzsXWeIoTigDGkeZ12KDQkY7K_D4.jpg?auto=webp&amp;s=cef0b07f2ffc5d1ace3372d5e3c24d1f78374255",
          "width": 1201,
          "height": 601
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/fFFpRrdpdMZ02e9hzsXWeIoTigDGkeZ12KDQkY7K_D4.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=3aed8958c1f650366a8d5c8d5246e55a1e30f825",
            "width": 108,
            "height": 54
          },
          {
            "url": "https://external-preview.redd.it/fFFpRrdpdMZ02e9hzsXWeIoTigDGkeZ12KDQkY7K_D4.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=5ea344aa4ab8311bbbd4b11e9cef8daa0ee38ce4",
            "width": 216,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/fFFpRrdpdMZ02e9hzsXWeIoTigDGkeZ12KDQkY7K_D4.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=40327f7a265e5d0905693a0b3498a502eb73fc59",
            "width": 320,
            "height": 160
          },
          {
            "url": "https://external-preview.redd.it/fFFpRrdpdMZ02e9hzsXWeIoTigDGkeZ12KDQkY7K_D4.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=47cb40b4a056c945b9bba180e7a30287484677af",
            "width": 640,
            "height": 320
          },
          {
            "url": "https://external-preview.redd.it/fFFpRrdpdMZ02e9hzsXWeIoTigDGkeZ12KDQkY7K_D4.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=b393fbc52bd710cbfe31d1b34da9c3d484f4ef06",
            "width": 960,
            "height": 480
          },
          {
            "url": "https://external-preview.redd.it/fFFpRrdpdMZ02e9hzsXWeIoTigDGkeZ12KDQkY7K_D4.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=0ea1373576cfeb69674009b341f116cca5062a90",
            "width": 1080,
            "height": 540
          }
        ],
        "variants": {},
        "id": "fjKwM9CXZYvNWD6gko4Ldjs9kmXF5UMOm787lMcXDo8"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/s67do4/cryptocoms_immediate_suspension_of_withdrawals/",
  "subreddit": "CryptoCurrency",
  "id": "s67do4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve been a customer of CDC since just after the MCO days and I’ve always been\nbullish on their token and wrote as much on this sub more than once. Also have\nan Icy White and a LOT of crypto staked on The Exchange, in Crypto.com Earn and\n(due to my CRO entry price being well under $0.10) a six…"
}