{
  "author": "ChrisKemps",
  "original_created_utc": 1645628402,
  "title": "I’m Chris Kempshall: a historian of First World War allied relations, historical computer games, and Star Wars - AMA!",
  "created_utc": 1645636517,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello &lt;a href=\"https://www.reddit.com/r/AskHistorians/\"&gt;r/AskHistorians&lt;/a&gt;!&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m Dr Chris Kempshall and am extremely excited to be doing this! I&amp;#39;ve got a bit of an eclectic background in historical research.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m predominantly a historian of the First World War with a particular focus on allied relations, a topic that I covered in my 2018 book &lt;a href=\"https://link.springer.com/book/10.1007/978-3-319-89465-2\"&gt;&lt;em&gt;British, French, and American Relations on the Western Front, 1914-1918&lt;/em&gt;&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Alongside this I also have an ongoing research interest in the portrayal of war, conflict, and history in computer games. This was the topic of my 2015 book &lt;a href=\"https://link.springer.com/book/10.1057/9781137491763\"&gt;&lt;em&gt;The First World War in Computer Games&lt;/em&gt;&lt;/a&gt;&lt;em&gt;.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Both my &amp;#39;normal&amp;#39; First World War history background and my interest in modern media portrayals of warfare led to my other research area which focuses on the &lt;em&gt;Star Wars&lt;/em&gt; franchise. Later this year my new book &lt;a href=\"https://www.routledge.com/The-History-and-Politics-of-Star-Wars-Death-Stars-and-Democracy/Kempshall/p/book/9781032318875?fbclid=IwAR1l89sqMugnIjbVPeEJKZixK50CkWVBKV0b38aq9GeWoguoP-Du0wV2xfo\"&gt;&lt;em&gt;The History and Politics of Star Wars: Death Stars and Democracy&lt;/em&gt;&lt;/a&gt; will be published by Routledge and is now available for pre-order (the cover will change)! It examines the real-world events and inspirations behind plot lines in the films, books, comics, and computer games of the franchise.&lt;/p&gt;\n\n&lt;p&gt;My work on &lt;em&gt;Star Wars&lt;/em&gt; also granted me the opportunity to contribute directly to material in the franchise when I helped co-write the DK book &lt;a href=\"https://www.dk.com/uk/book/9780241418703-star-wars-battles-that-changed-the-galaxy/\"&gt;&lt;em&gt;Star Wars: Battles that Changed the Galaxy&lt;/em&gt;&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;If anyone wants to check out a bit more of my work on either the First World War or computer games then I&amp;#39;ve arranged to have the following academic articles made freely accessible for the next week or so, meaning anyone can download and read them for free!&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.tandfonline.com/doi/full/10.1080/01439685.2015.1096665\"&gt;Pixel Lions – the image of the soldier in First World War computer games&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.tandfonline.com/doi/full/10.1080/07292473.2019.1643494\"&gt;Beyond ‘Parade Ground Soldiers’: French Army Assessments of the British in 1918&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.tandfonline.com/doi/full/10.1080/19475020.2020.1774914\"&gt;War collaborators: documentary and historical sources in First World War computer games&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve also contributed various articles to the &lt;a href=\"https://encyclopedia.1914-1918-online.net/contributors/Chris_Kempshall\"&gt;&lt;em&gt;1914-1918 Online - International Encyclopedia of the First World War&lt;/em&gt;&lt;/a&gt; (which is an amazing and free source of academic expertise on the war).&lt;/p&gt;\n\n&lt;p&gt;For the podcast fans in the audience I&amp;#39;m also a co-presenter on &lt;a href=\"http://ohwhatalovelypodcast.co.uk/\"&gt;&lt;em&gt;Oh! What a Lovely Podcast&lt;/em&gt;&lt;/a&gt; which examines the pop culture portrayals of the First World War.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also an editor on the &amp;#39;&lt;a href=\"https://www.degruyter.com/view/serial/VGH-B\"&gt;Video Games and the Humanities&lt;/a&gt;&amp;#39; book series published by De Gruyter, so take a look there for some other amazing work on games!&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m currently working at the University of Exeter on a research project called &amp;#39;&lt;a href=\"https://research.northumbria.ac.uk/warephemera/\"&gt;War Ephemera&lt;/a&gt;&amp;#39; to highlight ephemera and material relating to the First World War owned by marginalised communities.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also helping to advise the Imperial War Museum on a &lt;a href=\"https://www.iwm.org.uk/corporate/IWM2022\"&gt;forthcoming exhibition&lt;/a&gt; relating to the portrayal of war in computer games.&lt;/p&gt;\n\n&lt;p&gt;So if any of the above topics have taken your fancy: Ask Me Anything! &lt;strong&gt;I&amp;#39;ll start answering questions at about 4pm GMT (1 hour after this post has gone live)!&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;As a final additional point, the reason this AMA is taking place on Wednesday 23rd February, is to fit it in around ongoing strike action within UK universities. I suspect a good number of the residents and contributors on &lt;a href=\"/r/AskHistorians\"&gt;r/AskHistorians&lt;/a&gt; reside within these universities and, like myself, are clinging on with our fingernails to jobs we love that are rapidly becoming untenable. If you enjoy this AMA today please also read up on what&amp;#39;s happening regarding the strike action &lt;a href=\"https://www.ucu.org.uk/article/11896/Why-were-taking-action\"&gt;here&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/szjgl9/im_chris_kempshall_a_historian_of_first_world_war/",
  "subreddit": "AskHistorians",
  "id": "szjgl9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hello r/AskHistorians [https://www.reddit.com/r/AskHistorians/]!\n\nI'm Dr Chris Kempshall and am extremely excited to be doing this! I've got a bit\nof an eclectic background in historical research.\n\nI'm predominantly a historian of the First World War with a particular focus on\nallied relations, a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/AskHistorians [https://www.reddit.com/r/AskHistorians/]こんにちは!\n\n私はクリス・ケンプシャル博士で、この活動にとても興奮しています。私は少し\n歴史研究において、様々なバックグラウンドを持っています。\n\n私は主に第一次世界大戦の歴史家であり、特に次のことに重点を置いています。\n連合国との関係、...",
      "title": "第一次世界大戦の連合国との関係、歴史的コンピューターゲーム、そしてスターウォーズの歴史家、クリス・ケンプシャルです - AMA!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，r/AskHistorians [https://www.reddit.com/r/AskHistorians/]!\n\n我是克里斯-肯普肖尔博士，对能做这个工作感到非常兴奋！我有一些想法。我有一点\n我在历史研究方面有一些折衷的背景。\n\n我主要是一个第一次世界大战的历史学家，特别关注于\n盟国关系，以及其他方面。",
      "title": "我是克里斯-肯普肖尔：第一次世界大战盟国关系的历史学家，历史电脑游戏，以及《星球大战》--AMA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，r/AskHistorians [https://www.reddit.com/r/AskHistorians/]!\n\n我是克里斯-肯普肖爾博士，對能做這個工作感到非常興奮！我有一些想法。我有一點\n我在歷史研究方面有一些折衷的背景。\n\n我主要是一個第一次世界大戰的歷史學家，特別關注於\n盟國關係，以及其他方面。",
      "title": "我是克里斯-肯普肖爾：第一次世界大戰盟國關係的歷史學家，歷史電腦遊戲，以及《星球大戰》--AMA!"
    }
  ]
}