{
  "author": "coolcomfort123",
  "the_new_excerpt": "https://markets.businessinsider.com/news/stocks/tesla-stock-price-target-rally-fundraising-street-high-tsla-bofa-2021-1-1029956205\n\nBank of America cited Tesla's fundraising potential for their more bullish\noutlook. The company announced in December that it will sell up to $5 billion in\nstock to…",
  "original_created_utc": 1610387529,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "https://markets.businessinsider.com/news/stocks/tesla-stock-price-target-rally-fundraising-street-high-tsla-bofa-2021-1-1029956205\n\n美国银行提到了特斯拉的筹资潜力，因为他们更看好\n展望。该公司去年12月宣布，将出售高达50亿美元的\n库存到…",
      "title": "美国银行表示，随着股市上涨提振融资，特斯拉将攀升8%，至900美元的街头最高目标价"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://markets.businessinsider.com/news/stocks/tesla-stock-price-target-rally-fundraising-street-high-tsla-bofa-2021-1-1029956205\n\n美國銀行提到了特斯拉的籌資潛力，因爲他們更看好\n展望。該公司去年12月宣佈，將出售高達50億美元的\n庫存到…",
      "title": "美國銀行表示，隨着股市上漲提振融資，特斯拉將攀升8%，至900美元的街頭最高目標價"
    }
  ],
  "title": "Tesla will climb 8% to street-high price target of $900 as stock rally boosts fundraising, Bank of America says",
  "created_utc": 1610409544,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://markets.businessinsider.com/news/stocks/tesla-stock-price-target-rally-fundraising-street-high-tsla-bofa-2021-1-1029956205\">https://markets.businessinsider.com/news/stocks/tesla-stock-price-target-rally-fundraising-street-high-tsla-bofa-2021-1-1029956205</a></p>\n\n<p>Bank of America cited Tesla&#39;s fundraising potential for their more bullish outlook. The company announced in December that it will sell up to $5 billion in stock to raise additional cash for factory expansions. The offering drives a growth cycle that allows Tesla to more efficiently build out production capacity while retaining healthy cash reserves, the bank said.</p>\n\n<p>&quot;It is important to recognize that the higher the upward spiral of Tesla&#39;s stock goes, the cheaper capital becomes to fund growth, which is then rewarded by investors with a higher stock price,&quot; the analysts said.</p>\n\n<p>For the time being, the bank expects the bulls&#39; winning streak to rage on. Tesla&#39;s ability to aggressively build new factories to meet strong demand will lift deliveries and improve its ability to raise cash through stock offerings. While production woes and cash shortages plagued the company just years ago, Tesla&#39;s soaring valuation alleviates those concerns and cements the automaker&#39;s position as the world&#39;s dominant electric-vehicle producer, Bank of America said.</p>\n</div><!-- SC_ON -->",
  "score": 89,
  "permalink": "/r/stocks/comments/kv7v6h/tesla_will_climb_8_to_streethigh_price_target_of/",
  "subreddit": "stocks",
  "id": "kv7v6h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706381333
}