{
  "author": "PancakeMan0841",
  "original_created_utc": 1633534930,
  "title": "I am being a very good boy right now",
  "created_utc": 1633545805,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am sitting in my english class and my professor is taking with some students about what a great concept crypto is.  When I heard crypto I immediately started paying attention but when he said that I made sure to catch every word of their conversation.  Then someone mentioned they had a brother who bought ethereum last christmas and made tons of money.  From that point on it went downhill.  The girl next to him said she heard everyone should buy Shiba because it was doing good.  Then someone else brought up Elon and Doge and typing this out is my way of stopping myself from butting in and being annoying.</p>\n</div><!-- SC_ON -->",
  "score": 249,
  "permalink": "/r/CryptoCurrency/comments/q2n2hn/i_am_being_a_very_good_boy_right_now/",
  "subreddit": "CryptoCurrency",
  "id": "q2n2hn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am sitting in my english class and my professor is taking with some students\nabout what a great concept crypto is. When I heard crypto I immediately started\npaying attention but when he said that I made sure to catch every word of their\nconversation. Then someone mentioned they had a brother who…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は英語の授業を受けているのですが、教授は何人かの学生と一緒に\n教授が何人かの学生にcryptoという概念がいかに素晴らしいかについて話していました。私はcryptoと聞いてすぐに注目し始めました。\n私はcryptoと聞いてすぐに注意を払い始めましたが、教授がそう言ったとき、私は彼らの会話の一語一語を確実にキャッチしました。\nと言っていました。そして誰かが、自分には兄弟がいて...と言った。",
      "title": "今はとてもいい子にしています"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我坐在英语课上，我的教授正在和一些学生讨论\n关于加密货币是一个多么伟大的概念。当我听到crypto时，我立即开始注意\n但当他说这句话时，我一定要抓住他们谈话的每一个字。\n谈话。然后有人提到他们有一个兄弟，他...",
      "title": "我现在是一个非常好的孩子"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我坐在英語課上，我的教授正在和一些學生討論\n關於加密貨幣是一個多麼偉大的概念。當我聽到crypto時，我立即開始注意\n但當他說這句話時，我一定要抓住他們談話的每一個字。\n談話。然後有人提到他們有一個兄弟，他...",
      "title": "我現在是一個非常好的孩子"
    }
  ]
}