{
  "author": "VictisHonor7",
  "the_new_excerpt": "Like many of you I don't like being that 'crypto guy' around coworkers/friends\nand don't bring it up unless people ask about it. Reason: if they buy crypto\nafter you talked about it and it 'goes up' they think they are geniuses. If it's\ngoing down however, chances are you take the blame for…",
  "original_created_utc": 1617741535,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの皆さんと同じように、私も同僚や友人の間で「暗号の人」になるのは好きではありません。\n人に聞かれない限り、暗号の話はしないようにしています。理由：あなたが暗号の話をした後、彼らが暗号を買って「上がった」場合\n話題にした後に暗号を買って「上がった」となると、自分は天才だと思われます。下がっていれば\nしかし、下がっている場合は、あなたが責任を負う可能性があります...",
      "title": "Braveブラウザは、暗号化への完璧な入り口です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "和你们很多人一样，我不喜欢在同事/朋友面前做那个 \"加密人\"。\n并且除非别人问起，否则不要提出来。原因：如果他们购买加密\n你说了之后，它'涨'了，他们就觉得自己是天才。如果是\n然而，你有可能会受到指责... ...",
      "title": "勇敢的浏览器是进入加密技术的完美通道"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "和你們很多人一樣，我不喜歡在同事/朋友面前做那個 \"加密人\"。\n並且除非別人問起，否則不要提出來。原因：如果他們購買加密\n你說了之後，它'漲'了，他們就覺得自己是天才。如果是\n然而，你有可能會受到指責... ...",
      "title": "勇敢的瀏覽器是進入加密技術的完美通道"
    }
  ],
  "title": "Brave browser is the perfect gateway into crypto",
  "created_utc": 1617777090,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like many of you I don&#39;t like being that &#39;crypto guy&#39; around coworkers/friends and don&#39;t bring it up unless people ask about it. Reason: if they buy crypto after you talked about it and it &#39;goes up&#39; they think they are geniuses. If it&#39;s going down however, chances are you take the blame for it.</p>\n\n<p>Enter Brave: a product that you can recommend to your non-techy colleague. If you have ever used a browser, you can use Brave. If you don&#39;t know what Brave is: a chromium based browser that blocks ads and instead has it&#39;s own non targeting ads that you get paid for and can tip to content creators you like.</p>\n\n<p>The browser has built-in crypto wallets but accumulating ad revenue in them and contributing to content creators is an automatic process: you only need to use them to withdraw. Chances are that at this point people have become interested in the underlying blockchain tech powering it. For many of us our crypto journey started like this, because everyone has to start somewhere. This is contrary to many other tech in crypto that may not be that easy to use initially for no-coiners. </p>\n\n<p>I have recommended the browser to about 10 friends and many of them liked it, mainly for its speed, looks and privacy focus. Maybe only one of those 10 will eventually become interested in crypto because of Brave but I think that&#39;s already great. So in a sense it&#39;s the perfect gateway into crypto (at least better than doge). </p>\n\n<p>Thanks for reading and hope you have a nice day, cheers.</p>\n</div><!-- SC_ON -->",
  "score": 260,
  "permalink": "/r/CryptoCurrency/comments/mll5x1/brave_browser_is_the_perfect_gateway_into_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "mll5x1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961876906
}