{
  "author": "TwistedFluke",
  "the_new_excerpt": "For example, when Musk revealed that his company, Tesla, had bought $1.5 billion\nof bitcoin, the crypto’s price surged 17%.\n\nWhen Musk pumped Dogecoin, it popped 50%.\n\nOn the flip side, last week, when Musk announced that Tesla would no longer\naccept bitcoin as payment for its electric vehicles, the…",
  "original_created_utc": 1623640190,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、マスク氏が、自分の会社であるテスラが15億ドルのビットコインを購入したことを明らかにしたときには\nビットコインを購入したことを明らかにすると、ビットコインの価格は17％上昇しました。\n\nまた、マスク氏がDogecoinをポンピングしたときには、50％も急上昇しました。\n\nその一方で、先週、マスク氏がTesla社の支払いにビットコインを受け付けないことを発表したときには\nその一方で、先週、マスクがTeslaが電気自動車の支払いにビットコインを受け付けないと発表したときには、...",
      "title": "芸能人は無視してください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "例如，当马斯克透露他的公司，特斯拉，已经购买了15亿美元的\n比特币时，该加密货币的价格飙升了17%。\n\n当马斯克抽走Dogecoin时，它爆涨了50%。\n\n反过来说，上周，当马斯克宣布特斯拉将不再\n接受比特币作为其电动车的支付方式时，...",
      "title": "请无视名人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "例如，當馬斯克透露他的公司，特斯拉，已經購買了15億美元的\n比特幣時，該加密貨幣的價格飆升了17%。\n\n當馬斯克抽走Dogecoin時，它爆漲了50%。\n\n反過來說，上週，當馬斯克宣佈特斯拉將不再\n接受比特幣作爲其電動車的支付方式時，...",
      "title": "請無視名人"
    }
  ],
  "title": "Please ignore celebrities",
  "created_utc": 1623663155,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For example, when Musk revealed that his company, Tesla, had bought $1.5 billion of bitcoin, the crypto’s price surged 17%.</p>\n\n<p>When Musk pumped Dogecoin, it popped 50%.</p>\n\n<p>On the flip side, last week, when Musk announced that Tesla would no longer accept bitcoin as payment for its electric vehicles, the crypto fell almost 10%.</p>\n\n<p>Now we have people like Floyd Mayweather marketing Ethereum Max which is clearly a rug pull. We have to remember that there&#39;s a good chance that manipulation is occurring but since I&#39;m not a financial advisor, I will stick to my guts and say this is becoming a rich man&#39;s game similar to stonks.</p>\n\n<p>Its clear that Elon Musk is into the idea of BTC after todays tweets about allowing btc again as a form of payment towards Tesla if it hits his goal of environmentally friendly regulations, but why as investors does this matter to us?</p>\n\n<p>Elon and Tesla aren&#39;t the single factors to the success of crypto and its not even his space. Elon specializes solely on Tesla. We need to begin focusing on the leaders of the projects who are calling the shots and constantly finding improvements on their goals.</p>\n</div><!-- SC_ON -->",
  "score": 603,
  "permalink": "/r/CryptoCurrency/comments/nzd66t/please_ignore_celebrities/",
  "subreddit": "CryptoCurrency",
  "id": "nzd66t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009738588
}