{
  "author": "ShangT",
  "original_created_utc": 1637154510,
  "title": "Sorry, I will get downvoted to hell for this comment, but... if you see a coin shilled in here is too late, and if you shill anything under the top 100~200 coins you will get downvoted for shilling and it will prevent you to know about it.",
  "created_utc": 1637181656,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sorry guys but in my short stay in here I just spotted a pattern.... if you see everyone shilling some coins (right now for example, ALGO, DOT, CRO...) is because those coins are in a bullrun and are in their ATH. It&#39;s a fact... I mean, it&#39;s great, the coin is pumped and everyone want to get in because the green candles, nice, I get that. But you know, I hate to tell you this, you are late. The coin (short term) is already pumped and if you get all in now on those coins you most likely get burned in the correction or in the next bear market if you don&#39;t have the diamond hands to hold and wait for the next cycle.</p>\n\n<p>The opposite happens with rising unknown coins that have strong fundamentals but with not mass adoption yet. If you make a post about those hidden gems you will be downvoted and accused as shilling the coin. If the coin is not in the top 100~200 in gecko or mcap and is not on mayor CEXs you will be silenced by the community.</p>\n\n<p>I mean, don&#39;t get me wrong, investing (long term) in those top coins is a good way to make money, yeah, but long term and you have the risk to get caugh on the ATH. Some of the popular coins hyped in here are already pumped this year beyond 500%... the true way to get most of the crypto gains is to invest BEFORE that 500% pump... but I assure you, is hard to find those hidden gems in here because in here those coins will be ignored until the massive pump happens.</p>\n\n<p>Sorry for this, but I had to say it.</p>\n</div><!-- SC_ON -->",
  "score": 206,
  "permalink": "/r/CryptoCurrency/comments/qvywnp/sorry_i_will_get_downvoted_to_hell_for_this/",
  "subreddit": "CryptoCurrency",
  "id": "qvywnp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Sorry guys but in my short stay in here I just spotted a pattern.... if you see\neveryone shilling some coins (right now for example, ALGO, DOT, CRO...) is\nbecause those coins are in a bullrun and are in their ATH. It's a fact... I\nmean, it's great, the coin is pumped and everyone want to get in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "申し訳ありませんが、私はここでの短い滞在でパターンを見つけました.... もしあなたが見るならば\n誰もがいくつかのコイン（今は例えばALGO、DOT、CRO...）をシリングしているとします。\nそれらのコインはブルランであり、上限に達しているからです。それは事実です...。I\nつまり、そのコインが盛り上がっていて、みんなが参加したがっているのは素晴らしいことなんだけど...。",
      "title": "申し訳ありませんが、このコメントで地獄にダウンブレートされるでしょうが...ここでシリングされたコインを見ても手遅れですし、トップ100~200コイン以下のものをシリングすると、シリングとしてダウンブレートされ、それを知ることができなくなります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对不起，伙计们，但在我短暂的逗留中，我刚刚发现了一个模式....，如果你看到了\n每个人都在兜售一些硬币（比如现在的ALGO、DOT、CRO......）是\n因为这些钱币正处于牛市，并在其ATH中。这是一个事实... I\n我的意思是，这很好，该币被抽走了，每个人都想加入...",
      "title": "对不起，我的这个评论会被降权到地狱，但是......如果你在这里看到一个硬币被盗用就太晚了，如果你盗用任何在前100~200名的硬币，你会因为盗用而被降权，这将阻止你知道它。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對不起，夥計們，但在我短暫的逗留中，我剛剛發現了一個模式....，如果你看到了\n每個人都在兜售一些硬幣（比如現在的ALGO、DOT、CRO......）是\n因爲這些錢幣正處於牛市，並在其ATH中。這是一個事實... I\n我的意思是，這很好，該幣被抽走了，每個人都想加入...",
      "title": "對不起，我的這個評論會被降權到地獄，但是......如果你在這裏看到一個硬幣被盜用就太晚了，如果你盜用任何在前100~200名的硬幣，你會因爲盜用而被降權，這將阻止你知道它。"
    }
  ]
}