{
  "author": "step11234",
  "original_created_utc": 1633376737,
  "title": "Algorand does not have bad tokenomics and here's why.",
  "created_utc": 1633411842,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>How often on a post or comment about Algorand do you see someone say: &quot;I like Algo but the bad tokenomics put me off&quot; or &quot;the tokenomics are the only thing stopping me investing?&quot;. It&#39;s become one of those repeated buzzwords which people saw somewhere and now repeat without fully understanding it.</p>\n\n<p><strong><em>Algorand is a great long term investment &amp; you should not be investing in this coin for a short term pump in my opinion. NFA.</em></strong></p>\n\n<p>Tokenomics for those who don&#39;t know means the ecosystem of the crypto coin or token and how it distributed to the community, foundation, early backers, private sale etc. Proof of work coins like Bitcoin &amp; Ethereum distribute the coins based on how much &quot;work&quot; or mining you do, so only miners can get more bitcoin.</p>\n\n<p>Proof of Stake coins can go a few routes but the route that Algorand took was mint all their tokens at once (10 billion ALGO) and set up the distribution cycle from there. Let&#39;s look first how it was distributed initially and the original plan.</p>\n\n<p><strong>Initial Distribution</strong></p>\n\n<p>The plan for Algorand&#39;s distribution was on a 4 year cycle (by 2024) to have all ALGOs distributed by after listening to the community before the coin was fully released, the extended this to be predicted fully released in <strong>10 years</strong> (by 2030). The reason from this (from here: <a href=\"https://algorand.foundation/governance/algo-dynamics\">https://algorand.foundation/governance/algo-dynamics</a>) is that they want to reward the long term holders &amp; participants in the governance program:</p>\n\n<p><em>&quot;A new reward system benefiting the participants, existing and future, who commit to participate in the governance of the ecosystem and prove their commitment by locking their Algos for a potentially long term&quot;</em></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/2fugee10mhr71.png?width=613&amp;format=png&amp;auto=webp&amp;s=d23aa62df05b45736c97494e9633f6750c37f5c6\"> This shows the proposed allocation of the 10B ALGO over the 10 year scale. </a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/51t16be1mhr71.jpg?width=2100&amp;format=pjpg&amp;auto=webp&amp;s=b48e764abdabb9dc28d166df780cb3d193145a13\"> This is from November 2020 I believe so it quite outdated but it shows the proposed timescale of distribution over 10 years. </a></p>\n\n<p>As you can see from the above graph, by 2021 we should be at about 4B ALGO distributed, we are actually at about 6.1B ALGO distributed. I&#39;ll go into why this is a big plus for us investors &amp; why it has happened shortly</p>\n\n<p><strong>Accelerated vesting</strong></p>\n\n<p>The biggest concern I see is about Accelerated vesting (the 2.5B for Early Backer incentives) which was scheduled to be fully released by 2024. Basically what happens is that every time the 30 day average price of Algorand hits a new 30 day average high, more coins are released to the early backers as reward for running the relay and this can have the effect of pushing the price down, <em>if</em> and it&#39;s a BIG if, they decide to sell. The coins are NOT just released into the ecosystem contrary to popular belief on this subreddit, they are distributed to these backers who can choose what to do with them. <strong>To clarify, the accelerated vesting does not give them &quot;more&quot; coins, just they that will receive them faster.</strong></p>\n\n<p>Accelerated vesting is almost over. There are approximately 247m ALGOs still to be distributed via this method according to <a href=\"https://np.reddit.com/r/algorand/comments/pu5ynh/accelerated_vesting_is_not_over_yet/\">this post</a> in the official subreddit, that&#39;s only 10% and I imagine it will be gone next time we hit a 30 day high.</p>\n\n<p>The vesting is the reason for us being at 6.1B already and the reason this is good (in my opinion) is that the price is still holding steady at around $2 up from $1 earlier in the year even with all these extra ALGO in the ecosystem and it does not look like there has been that much selling from the early backers. Any extra ALGO put into the system will now have diminishing effects on the price.</p>\n\n<p>We now have 3.9B coins to be distributed in the next 9 years and will likely end sooner than that, but I&#39;m not fully sure on the schedule and how much it will be impacted by the accelerated vesting.</p>\n\n<p>You can read in detail here about the accelerated vesting: <a href=\"https://algorand.foundation/news/algorand-foundation-early-backer\">https://algorand.foundation/news/algorand-foundation-early-backer</a></p>\n\n<p><strong>Early backers/Algo Foundations holdings</strong></p>\n\n<p>Another big concern I see is that the Early Backers &amp; Algo foundation hold too much power &amp; % of coins compared to the community. This is definitely true for the moment, by the end of the distribution it will be max 25% to the early backers (assuming no sales/purchases) and about 25% for the Algorand foundation (see below for the tables with this info). Obviously 50% is a huge percentage of the governance and honestly is worrying for a decentralized ecosystem and I don&#39;t blame people being put off by this info. Plus the % of power is larger than 50% right now due to not being at 10B algo, but we have to remember that the early backers are not one homogenous blob and will have different votes &amp; ideas.</p>\n\n<p>But for me it&#39;s fine because it seems to me that the Algorand foundation <em>should</em> have a big stake in the game, so 25% of the governance power is completely fine by me and I&#39;m not worried about this part of it.</p>\n\n<p>The Early Backer&#39;s portion is more concerning although I think it is fine in the long run, but definitely something to consider!</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/4gvjah63mhr71.png?width=583&amp;format=png&amp;auto=webp&amp;s=a637c4993d17dcf4e50bac0dac9ba078ebead1ae\"> The distribution once all 10B Algo are released. </a></p>\n\n<p>Here&#39;s some more information about their tokenomics: <a href=\"https://algorand.foundation/governance/algo-dynamics\">https://algorand.foundation/governance/algo-dynamics</a></p>\n\n<p>TL;DR: Algo&#39;s tokenomics are not bad, they are just built for a long term scale (10 years) and while there are a couple of concerns (early backers). I think this is a phenomenal opportunity to get in on a project by a <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/pzyue3/in_celebration_of_algorands_governance_program/\">great team</a> (post i made a few days ago about their team if you&#39;re interested).</p>\n</div><!-- SC_ON -->",
  "score": 178,
  "permalink": "/r/CryptoCurrency/comments/q1dd1s/algorand_does_not_have_bad_tokenomics_and_heres/",
  "subreddit": "CryptoCurrency",
  "id": "q1dd1s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "How often on a post or comment about Algorand do you see someone say: \"I like\nAlgo but the bad tokenomics put me off\" or \"the tokenomics are the only thing\nstopping me investing?\". It's become one of those repeated buzzwords which\npeople saw somewhere and now repeat without fully understanding…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アルゴランドに関する記事やコメントの中で、誰かがこう言っているのをよく見かけます。\"I like\nアルゴは好きだけど、トケノミクスが悪いからやめた」とか「トケノミクスだけが投資の妨げになっている\n私が投資するのを止めるのは、トケノミクスだけですか？この言葉は、人々がどこかで目にして、よくわからないままに繰り返し使うバズワードのひとつになっています。\nどこかで目にして、よくわからないまま繰り返している言葉のひとつです。",
      "title": "アルゴランドには悪いトコ取りがない、その理由とは。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在关于Algorand的帖子或评论中，你有多少次看到有人说。\"我喜欢\n我喜欢Algo，但糟糕的tokenomics让我望而却步 \"或 \"tokenomics是阻止我投资的唯一原因？\n阻止我投资？\"。这已经成为那些重复的流行语之一。\n人们在某个地方看到了，现在又重复着，却没有完全理解......",
      "title": "Algorand没有坏的tokenomics，原因就在这里。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在關於Algorand的帖子或評論中，你有多少次看到有人說。\"我喜歡\n我喜歡Algo，但糟糕的tokenomics讓我望而卻步 \"或 \"tokenomics是阻止我投資的唯一原因？\n阻止我投資？\"。這已經成爲那些重複的流行語之一。\n人們在某個地方看到了，現在又重複着，卻沒有完全理解......",
      "title": "Algorand沒有壞的tokenomics，原因就在這裏。"
    }
  ]
}