{
  "author": "Notmiefault",
  "original_created_utc": 1635453529,
  "title": "The famous horror Theater of Grand Guignol in Paris supposedly had boxes in the back that theater-goers could rent if they became too \"aroused\" by the production and needed \"privacy\". How much truth is there to this legend? Were people really having sex in the theater mid-performance?",
  "created_utc": 1635495785,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After listening to the Imaginary Worlds episode on the famous theater, I looked it up on wikipedia and it says</p>\n\n<blockquote>\n<p>Many attended the shows to get a feeling of arousal.[2] Underneath the balcony were boxes (originally built for nuns to watch church services) that were available for theatre-goers to rent during performances because they would get so aroused by the action happening on stage. It has been said that audience members would get so boisterous in the boxes, that actors would sometimes break character and yell something such as &quot;Keep it down in there!&quot;</p>\n</blockquote>\n\n<p>The source of the above then says:</p>\n\n<blockquote>\n<p>Some witnesses reported that the iron-grilled boxes in the back of the theater encouraged a certain &#39;extremism,&#39; especially during Monday matinees when women often prepared themselves for adultery by throwing themselves, half-dead with terror, into their neighbors&#39; arms: flirtation, Grand-Guignol-style. The cleaning staff would often find the seats stained.</p>\n</blockquote>\n\n<p>How much do we actually know about these? Were couples coming here? Was it a merely a marketing tool used by local prostitutes to drum up business? An unsubstantiated legend? Or was the culture of the time such that this was deemed acceptable in the institution?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/qhw1lu/the_famous_horror_theater_of_grand_guignol_in/",
  "subreddit": "AskHistorians",
  "id": "qhw1lu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "After listening to the Imaginary Worlds episode on the famous theater, I looked\nit up on wikipedia and it says\n\n> Many attended the shows to get a feeling of arousal.[2] Underneath the balcony\n> were boxes (originally built for nuns to watch church services) that were\n> available for theatre-goers…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この有名な劇場に関するImaginary Worldsのエピソードを聞いた後、wikipediaで調べてみると\nウィキペディアで調べてみると、次のように書かれています。\n\n> 興奮を得るために多くの人がショーに参加した[2] バルコニーの下には\n> 尼僧が教会の礼拝を見るために作られた）箱があって\n> 演劇を見る人のために用意されていた...。",
      "title": "パリの有名なホラー劇場「グランギニョル」では、作品に「興奮」して「プライバシー」を必要とする観客のために、劇場の後ろにボックスを貸し出していたという。果たして、この伝説はどこまで真実なのか？本当に公演中に劇場でセックスをしていた人たちがいたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在听了关于著名剧院的《想象的世界》节目后，我在维基百科上查了一下\n在维基百科上查了一下，上面说\n\n> 许多人参加演出是为了获得一种兴奋的感觉。[2] 在阳台的下面\n> 有一些包厢（最初是为修女观看教堂服务而建），供\n>供看戏的人使用......",
      "title": "据称，巴黎著名的Grand Guignol恐怖剧院的后面有一些包厢，如果观众在观看演出时过于 \"兴奋 \"而需要 \"隐私\"，可以租用这些包厢。这个传说的真实性有多大？人们是否真的在演出中途在剧院里做爱？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在聽了關於著名劇院的《想象的世界》節目後，我在維基百科上查了一下\n在維基百科上查了一下，上面說\n\n> 許多人蔘加演出是爲了獲得一種興奮的感覺。[2] 在陽臺的下面\n> 有一些包廂（最初是爲修女觀看教堂服務而建），供\n>供看戲的人使用......",
      "title": "據稱，巴黎著名的Grand Guignol恐怖劇院的後面有一些包廂，如果觀衆在觀看演出時過於 \"興奮 \"而需要 \"隱私\"，可以租用這些包廂。這個傳說的真實性有多大？人們是否真的在演出中途在劇院裏做愛？"
    }
  ]
}