{
  "author": "ominousomanytes",
  "the_new_excerpt": "This is more aimed at the newer crypto investors, especially the ones who use\nTikTok, Twitter, and Instagram for crypto news/advice.\n\nI am studying computer science at uni, but I am by no means an expert on\nanything to do with cryptocurrency creation. Nevertheless, in around 20 minutes.\nI made my…",
  "original_created_utc": 1617439747,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这更多的是针对新的加密投资者，尤其是那些使用了\nTikTok，Twitter和Instagram的加密新闻/建议。\n\n我在大学学习计算机科学，但我绝不是一个关于\n与加密货币创造有关的任何事情。然而，在20分钟左右，\n我做了我的...",
      "title": "制作自己的信物非常容易。要出去兜售它是非常容易的。你要小心点"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這更多的是針對新的加密投資者，尤其是那些使用了\nTikTok，Twitter和Instagram的加密新聞/建議。\n\n我在大學學習計算機科學，但我絕不是一個關於\n與加密貨幣創造有關的任何事情。然而，在20分鐘左右，\n我做了我的...",
      "title": "製作自己的信物非常容易。要出去兜售它是非常容易的。你要小心點"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "これは、より新しい暗号投資家を対象としたもので、特に、以下のようなものを使用しています。\n特に、TikTok、Twitter、Instagramを使って暗号ニュースやアドバイスを求めている人向けです。\n\n私は大学でコンピュータサイエンスを学んでいますが、暗号通貨の作成に関する専門家ではありません。\n私は大学でコンピュータサイエンスを学んでいますが、暗号通貨の作成に関する専門家ではありません。とはいえ、20分ほどで\n私が作ったのは...",
      "title": "自分のトークンを作るのはとても簡単です。外に出てシャッフルするのは信じられないほど簡単です。気をつけてください。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "これは、より新しい暗号投資家を対象としたもので、特に、以下のようなものを使用しています。\n特に、TikTok、Twitter、Instagramを使って暗号ニュースやアドバイスを求めている人向けです。\n\n私は大学でコンピュータサイエンスを学んでいますが、暗号通貨の作成に関する専門家ではありません。\n私は大学でコンピュータサイエンスを学んでいますが、暗号通貨の作成に関する専門家ではありません。とはいえ、20分ほどで\n私が作ったのは...",
      "title": "自分のトークンを作るのはとても簡単です。外に出てシャッフルするのは信じられないほど簡単です。気をつけてください。"
    }
  ],
  "title": "It is very easy to make your own token. It is incredibly easy to go out and shill it. Be careful.",
  "created_utc": 1617460930,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is more aimed at the newer crypto investors, especially the ones who use TikTok, Twitter, and Instagram for crypto news/advice.</p>\n\n<p>I am studying computer science at uni, but I am by no means an expert on anything to do with cryptocurrency creation. \nNevertheless, in around 20 minutes. I made my own token, launched it on the Ethereum testnet, and started sending it between wallets etc.\nIt would not have any true functionality, but it wouldn&#39;t need any.\nAnyone can do this with very basic programming skills.</p>\n\n<p>If I wanted to, I could now very easily do this on the mainnet -  just pay some ETH fees,  set up an ICO, and pay some crypto influencers a relatively small fee to claim my coin as the next big 1000x investment.</p>\n\n<p>I could even make my own tiktok account promoting it, and due to the nature of the algorithm it would not be too hard to reach at least some crypto newbies.</p>\n\n<p>Then of course, I get rich, and dump my 50+% of the supply.</p>\n\n<p>I am not saying that it is this easy to pump a brand new coin, just that with some marketing luck or even just marketing budget, it&#39;s very possible.</p>\n\n<p>All this to say, a coin&#39;s existence is not proof of technological innovation, usefulness, or even legitimacy as a project. Anyone can make a coin. Anyone can make a quick website for it with some buzzwords.</p>\n\n<p>If a coin can&#39;t show a specific use case, industry, or new technology, it is probably a shitcoin.</p>\n\n<p>Take SAFEMOON as an example, it was pumped heavily on social media, and the price rocketed. Now, there&#39;s SAFEMARS, SAFESTAR being churned out, with absolutely no unique uses or functionality.</p>\n\n<p>Hope this deters at least one person from buying a total shitcoin they found on social media.</p>\n</div><!-- SC_ON -->",
  "score": 417,
  "permalink": "/r/CryptoCurrency/comments/mj4r0q/it_is_very_easy_to_make_your_own_token_it_is/",
  "subreddit": "CryptoCurrency",
  "id": "mj4r0q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961875622
}