{
  "author": "hello-jacob",
  "the_new_excerpt": "Hi all,\n\nI just wanted to bring to everyone's attention of a possible fraudulent finance\nyoutuber.\n\nHis claim is that he was a senior financial analyst in New York, working for one\nof the biggest asset managers. He supposedly worked in the financial industry\nfor close to a decade. After which, he…",
  "original_created_utc": 1611346787,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好\n\n我只是想提请大家注意一个可能存在的金融诈骗问题\nyoutuber。以防你从他那里得到选股，不要相信他的。\n盲目地观看视频。\n\n他的说法是，他是纽约的一名高级金融分析师，为一家公司工作。\n的最大资产管理公司。他...",
      "title": "涉嫌诈骗。汤姆-纳什 (金融界人士)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好\n\n我只是想提請大家注意一個可能存在的金融詐騙問題\nyoutuber。以防你從他那裏得到選股，不要相信他的。\n盲目地觀看視頻。\n\n他的說法是，他是紐約的一名高級金融分析師，爲一家公司工作。\n的最大資產管理公司。他...",
      "title": "涉嫌詐騙。湯姆-納什 (金融界人士)"
    }
  ],
  "title": "Suspected Fraud: Tom Nash (Finance youtuber)",
  "created_utc": 1611381582,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi all,</p>\n\n<p>I just wanted to bring to everyone&#39;s attention of a possible fraudulent finance youtuber. </p>\n\n<p>His claim is that he was a senior financial analyst in New York, working for one of the biggest asset managers. He supposedly worked in the financial industry for close to a decade. After which, he changed jobs to work as a professional consultant with one of the Big 4s. So far, I don&#39;t have any issues with his career path. This is all well and good, however, I started to research more on his background/credentials over various social media platforms, after I watched one of his &quot;stock advice&quot; videos which did not make much sense. </p>\n\n<p>Suspicion 1:</p>\n\n<ol>\n<li><p>I went to look up all his social media platforms. Initially, I wanted to see if he had a linkedin profile, so I could see where he worked at previously. However there was nothing much about his former jobs, but many certificates relating to Youtube skills.</p></li>\n<li><p>I chanced across his reddit and found that he has been trying his hand at becoming a youtube content creator as far as 2 years back. He started as a <em>youtube content creator guru</em>, where he posted many videos like &quot;how to improve your sound and voice quality&quot; or &quot;how to make money from a small youtube channel without ads&quot;. The videos are all deleted from youtube, but you can still see the posts that he made on reddit if you scroll down. (refer to <a href=\"/u/TomNash_Youtube\">u/TomNash_Youtube</a>)</p></li>\n<li><p>He created a second and third youtube account called GearlyReviews where he reviews electronics (he is still relatively active, last post was 2 months ago) and EuroBall where he only posted 2 videos.</p></li>\n<li><p>He then moved on to doing videos on exposing fake gurus. He moved to making videos on stock picks afterwards.</p></li>\n</ol>\n\n<p>My take: From his history of reddit posts, he seemed to be an average guy trying to break into the youtube scene. It&#39;s hard to explain what I mean, so I think it&#39;s best to read his reddit account and his historic posts. Some examples are posts like &quot;What&#39;s a good click through rate&quot; or &quot;do you use your face in your thumbnails&quot; etc. The fact that over two years, he went through so much effort to become a youtuber and even tested and jumped across various youtube scenes, suggests that he was trying to become a professional content creator and earn money through youtube. </p>\n\n<p>Suspicion 2:</p>\n\n<ol>\n<li>His stock picks are basically videos on stocks that were already hyped up. In his videos, his projections on the industry are often very superficial or are just completely garbage. Basically, some of the stuff he mentions are definitely not what a former financial analyst would say. For example, his video on $CHEK, he mentioned of proprietary technology that would push the stock price up if it was approved and goes through mass adoption. But the problem is, this technology already exists and while I could go into greater details, the point is, he seems to be making inadequate research and uninformed projections. To the new guys on youtube, they wouldn&#39;t know better and would blindly follow his advice.</li>\n</ol>\n\n<p>Overall conclusion: </p>\n\n<p>I think there are many things that are fishy about him. I doubt he was ever a professional financial analyst because he definitely does not seem to have the knowledge I would expect of one. Apart from that, his life on social media seems to revolve around youtube only. If he was a retired analyst, I would expect that there would still be some trace of that in his social media, whether it is a casual mention in his videos like &quot;back in the firms, we used to do this&quot; or some posts on finance subreddits/twitter/facebook or some photos of him in his firms etc. Another big red flag is that he used to sell courses on his facebook even though he claims to never have done so. If you guys want to verify what I&#39;m talking about, just have a search on google and find his reddit/facebook etc. </p>\n\n<p><strong>Remember, in a bull market, everyone is a genius.</strong> </p>\n\n<p>Thanks all. Invest safely.</p>\n</div><!-- SC_ON -->",
  "score": 87,
  "permalink": "/r/investing/comments/l2w3ii/suspected_fraud_tom_nash_finance_youtuber/",
  "subreddit": "investing",
  "id": "l2w3ii",
  "is_self": true,
  "media": null,
  "is_video": false
}