{
  "author": "EricaMcQueen",
  "original_created_utc": 1646314869,
  "title": "I like leaving my origami figurines in public places (school, busses, trains, shops, etc.) Is this littering? Should I stop?",
  "created_utc": 1646323745,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m really into origami and I love giving them to people. One time I&amp;#39;ve accidentally left a pink crane on a bench. When I realized I wanted to go back and pick it up, but then I saw a woman who picked it up and put it into her bag.&lt;/p&gt;\n\n&lt;p&gt;Ever since then I started leaving little animals (cranes, crabs, butterflies, elephants, dinosaurs, dragons, etc.) around the places I visit often. I usually leave only 2 at one place because I don&amp;#39;t want them to be alone. They usually dissappear pretty quickly and I always assumed that people pick them up and keep them. But one of my classmates noticed that I left some cranes on a desk this morning and he said that I&amp;#39;m littering. &lt;/p&gt;\n\n&lt;p&gt;I really don&amp;#39;t want to bother people. Am I annoying? Should I stop?&lt;/p&gt;\n\n&lt;p&gt;Edit: thank you for the very kind responses! I&amp;#39;ll keep making origami then! It really makes me happy that other people appreciate them haha&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/t5rttp/i_like_leaving_my_origami_figurines_in_public/",
  "subreddit": "NoStupidQuestions",
  "id": "t5rttp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm really into origami and I love giving them to people. One time I've\naccidentally left a pink crane on a bench. When I realized I wanted to go back\nand pick it up, but then I saw a woman who picked it up and put it into her bag.\n\nEver since then I started leaving little animals (cranes, crabs,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は折り紙がとても好きで、人にあげるのが大好きなんです。ある時、私は\nうっかりベンチにピンクの鶴を置き忘れた。気がつくと、また行きたくなっていました。\nその時、それを拾って自分のバッグに入れた女性がいました。\n\nそれ以来、小さな動物（鶴、蟹、...）を置くようになったんです。",
      "title": "私は折り紙のフィギュアを公共の場所（学校、バス、電車、お店など）に置いておくのが好きなのですが、これはポイ捨てですか？やめるべきですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我真的很喜欢折纸，我喜欢把它们送给别人。有一次我\n不小心把一只粉红色的仙鹤留在了长椅上。当我意识到我想回去\n捡起来，但后来我看到一个女人把它捡起来，放进她的包里。\n\n从那时起，我开始把小动物（仙鹤、螃蟹、......",
      "title": "我喜欢把我的折纸小人留在公共场所（学校、公共汽车、火车、商店等），这算不算乱丢垃圾？我应该停止吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我真的很喜歡摺紙，我喜歡把它們送給別人。有一次我\n不小心把一隻粉紅色的仙鶴留在了長椅上。當我意識到我想回去\n撿起來，但後來我看到一個女人把它撿起來，放進她的包裏。\n\n從那時起，我開始把小動物（仙鶴、螃蟹、......",
      "title": "我喜歡把我的摺紙小人留在公共場所（學校、公共汽車、火車、商店等），這算不算亂丟垃圾？我應該停止嗎？"
    }
  ]
}