{
  "author": "Sweet-Zookeepergame",
  "original_created_utc": 1642761686,
  "title": "Bitcoin was supposed to be the solution to BIG MONEY. Now it instantly dips everytime when the stock market dips.",
  "created_utc": 1642772370,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;To be honest, this makes me sad.&lt;/p&gt;\n\n&lt;p&gt;As far as I remember, Bitcoin was thought to be the solution of the fact that institutions, wall street and big money control the financial world and the pennies of the simple people from the normal population. And it was more or less like this, in the first several years after the inception of Bitcoin. We saw so much price discovery, Bitcoin being volatile, because mere mortals like us were buying, hodling, selling, wondering how much the &lt;em&gt;real&lt;/em&gt; price of this asset is. It was literally supply and demand, controlled only by the psychology and the individual decisions of every single one of us.&lt;/p&gt;\n\n&lt;p&gt;What do we see nowadays? We go to bed, we wake up and we see that Bitcoin is at -10% for no reason. Literally for no reason. Neither me or you have sold. We were just sleeping. What happens? Bitcoin is strongly tied to the trading algorithms of insitutions and they handle it the same way they handle stocks. If the stock market is supposed to move down, bitcoin and crypto in general follows instantly in a nanosecond. We are not in control anymore. It doesn&amp;#39;t matter if we buy or sell.&lt;/p&gt;\n\n&lt;p&gt;During the last few years, we welcomed institutional interest and we cheered. Now I realize that they have much more power than us and the situation is the same as it has ever been - big money controls the pennies, or in this case the satoshis, of us - the simple people.&lt;/p&gt;\n\n&lt;p&gt;It makes me sad, but in the end, this is an open and free market. Everybody has the right to buy, sell or hold as much as he or she wants. In this case, it just happens so that the big players choose to be massively invested in crypto, which gives us the spot on the sidelines - sit and observe how the price fluctuates, without being able to react on our own.&lt;/p&gt;\n\n&lt;p&gt;EDIT: I agree with a lot of you guys and girls. The same way sometimes we go to bed, wake up and see that Bitcoin is +15%. In those green days, nobody complains about it. What concerns me in overall is how tied the price movement of crypto assets to the price movement traditional assets is. I am not sure if this is an issue to be concerned about. However, it&amp;#39;s a fact and I feel the necessity to talk about it and discuss it&amp;#39;s impact.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 511,
  "permalink": "/r/CryptoCurrency/comments/s97zb8/bitcoin_was_supposed_to_be_the_solution_to_big/",
  "subreddit": "CryptoCurrency",
  "id": "s97zb8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "To be honest, this makes me sad.\n\nAs far as I remember, Bitcoin was thought to be the solution of the fact that\ninstitutions, wall street and big money control the financial world and the\npennies of the simple people from the normal population. And it was more or less\nlike this, in the first…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正直なところ、これは悲しいことです。\n\n私の記憶では、ビットコインは、以下の事実の解決策だと考えられていました。\n金融機関、ウォール街、ビッグマネーが金融界を支配している。\n普通の人たちの小銭。そして、それは多かれ少なかれ\nこのように、最初は...",
      "title": "ビットコインはBIG MONEYの解決策になるはずだった。今は株式市場が落ち込むと 毎回即座に落ち込んでしまいますが"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "说实话，这让我很难过。\n\n在我的印象中，比特币被认为是解决以下事实的方法\n机构、华尔街和大资金控制着金融世界和普通人的\n币的解决方案。而这或多或少是\n像这样，在第一...",
      "title": "比特币本应是解决大额资金的办法。现在，每当股市下跌时，它就会立即下挫。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說實話，這讓我很難過。\n\n在我的印象中，比特幣被認爲是解決以下事實的方法\n機構、華爾街和大資金控制着金融世界和普通人的\n幣的解決方案。而這或多或少是\n像這樣，在第一...",
      "title": "比特幣本應是解決大額資金的辦法。現在，每當股市下跌時，它就會立即下挫。"
    }
  ]
}