{
  "author": "PeterQuin",
  "the_new_excerpt": "A coworker and myself recently got to talking at work after avoiding each other\nfor months thinking we didn't like each other. Sh e complemented me saying i\nhave a nice smile and should smile more. Now this was because i generally am a\nreserved, keep to myself type. I never smile for photos and…",
  "original_created_utc": 1611853991,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "最近我和一个同事在工作中互相躲避后，聊了起来\n几个月来，我们都以为彼此不喜欢对方。她还夸我说\n有一个漂亮的笑容，应该多笑。现在，这是因为我一般是一个\n矜持，保持自己的类型。我从来没有微笑的照片和...",
      "title": "女人的赞美有没有让你改变过对自己的看法？如果有，是如何改变的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近我和一個同事在工作中互相躲避後，聊了起來\n幾個月來，我們都以爲彼此不喜歡對方。她還誇我說\n有一個漂亮的笑容，應該多笑。現在，這是因爲我一般是一個\n矜持，保持自己的類型。我從來沒有微笑的照片和...",
      "title": "女人的讚美有沒有讓你改變過對自己的看法？如果有，是如何改變的？"
    }
  ],
  "title": "Has a compliment from a woman ever made you change the way you see yourselves? If so how?",
  "created_utc": 1611874084,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A coworker and myself recently got to talking at work after avoiding each other for months thinking we didn&#39;t like each other. Sh e complemented me saying i have a nice smile and should smile more. Now this was because i generally am a reserved, keep to myself type. I never smile for photos and generally don&#39;t smile much. I&#39;ve never liked my look when i smile. And i realize she really meant it because she&#39;s a sweet person and we&#39;ve been talking now and then and it feels genuine. What matters more to me is that i&#39;ve really took to smiling more and it honestly makes me feel so in peace with myself and express my emotions truly instead of keeping a straight face all the time.</p>\n\n<p>I really learnt to love smiling at people because of her and i thing that&#39;s quite an effect for someone to have on me.</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/AskMen/comments/l72pd4/has_a_compliment_from_a_woman_ever_made_you/",
  "subreddit": "AskMen",
  "id": "l72pd4",
  "is_self": true,
  "media": null,
  "is_video": false
}