{
  "author": "HopelessCineromantic",
  "the_new_excerpt": "Hello\n\nI recently got Ian Toll's trilogy about the Pacific Theater of World War II, and\nsaw that during Japan's War with Russia, the Japanese military was praised for\nits treatment of prisoners of war. Prisoners were properly fed and given reading\nmaterial, very few died, and those that did were…",
  "original_created_utc": 1619035275,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは\n\n最近、イアン・トールの第二次世界大戦の太平洋戦域に関する3部作を手に入れました。\n日本がロシアと戦争している間、日本軍は捕虜の扱いで賞賛されていたことを知りました。\n日本軍は捕虜の扱いについて賞賛されていました。捕虜は適切に食事を与えられ、読み物も与えられ\n捕虜は適切に食事を与えられ、読み物を与えられ、死ぬ者はほとんどなく、死んだ者は...",
      "title": "日露戦争（1904-1905）と第二次世界大戦（1939-1945）で、日本が捕虜の扱いを大きく変えた原因は何だったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好\n\n我最近得到了伊恩-托尔关于二战太平洋战场的三部曲，并看到在日本与俄罗斯的战争中，日本军队受到了赞扬。\n看到在日本与俄罗斯的战争中，日本军队因其对战俘的待遇而受到赞扬。\n它对战俘的待遇。囚犯们得到了适当的食物，并得到了阅读\n囚犯得到了适当的食物和阅读材料，很少有人死亡，而那些死亡的人则被...",
      "title": "是什么导致日本帝国在日俄战争（1904-1905）和第二次世界大战（1939-1945）之间对待战俘的方式如此不同？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好\n\n我最近得到了伊恩-托爾關於二戰太平洋戰場的三部曲，並看到在日本與俄羅斯的戰爭中，日本軍隊受到了讚揚。\n看到在日本與俄羅斯的戰爭中，日本軍隊因其對戰俘的待遇而受到讚揚。\n它對戰俘的待遇。囚犯們得到了適當的食物，並得到了閱讀\n囚犯得到了適當的食物和閱讀材料，很少有人死亡，而那些死亡的人則被...",
      "title": "是什麼導致日本帝國在日俄戰爭（1904-1905）和第二次世界大戰（1939-1945）之間對待戰俘的方式如此不同？"
    }
  ],
  "title": "What caused Imperial Japan to treat prisoners of war so differently between the Russo-Japanese War (1904-1905) and World War II (1939-1945)?",
  "created_utc": 1619070705,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello</p>\n\n<p>I recently got Ian Toll&#39;s trilogy about the Pacific Theater of World War II, and saw that during Japan&#39;s War with Russia, the Japanese military was praised for its treatment of prisoners of war. Prisoners were properly fed and given reading material, very few died, and those that did were buried with military honors.</p>\n\n<p>This was striking to me because it is in stark contrast to how Japan treated prisoners of war in the Second World War. Beatings, slave labor, starvation, murder, etc are all details I&#39;ve heard about those who surrendered to the IJA or IJN.</p>\n\n<p>What prompted this drastic change in the treatment of PoWs?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/mvo2qj/what_caused_imperial_japan_to_treat_prisoners_of/",
  "subreddit": "AskHistorians",
  "id": "mvo2qj",
  "is_self": true,
  "media": null,
  "is_video": false
}