{
  "author": "PickleRick1001",
  "original_created_utc": 1634388519,
  "title": "What's different about America specifically that led it to have such strong opposition to gun control? Whereas Australia, Canada, and more recently New Zealand all restricted access to guns after mass shootings, there was no such reaction in America after the Columbine massacre. Why?",
  "created_utc": 1634399617,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Australia: Port Arthur massacre; National Firearms Agreement.</p>\n\n<p>Canada: École Polytechnique massacre; gun control legislation after a few years.</p>\n\n<p>New Zealand is outside of the twenty years rule, but the Christchurch massacre led to a similar effort.</p>\n\n<p>All of these countries are Anglophone, majority white, historically Protestant, and generally similar to America in a lot of ways; politically, socially, historically, etc. </p>\n\n<p>So why was there no similar effort after the Columbine massacre?</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/q9bce6/whats_different_about_america_specifically_that/",
  "subreddit": "AskHistorians",
  "id": "q9bce6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Australia: Port Arthur massacre; National Firearms Agreement.\n\nCanada: École Polytechnique massacre; gun control legislation after a few years.\n\nNew Zealand is outside of the twenty years rule, but the Christchurch massacre\nled to a similar effort.\n\nAll of these countries are Anglophone, majority…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "オーストラリア ポートアーサーの虐殺、全国銃器協定。\n\nカナダ École Polytechniqueでの大虐殺；数年後に銃規制法を制定。\n\nニュージーランドは20年ルールの対象外だが、クライストチャーチの大虐殺をきっかけに\nは同様の取り組みを行った。\n\nこれらの国はすべて英語圏で、多数派は...",
      "title": "アメリカが銃規制に強く反対している理由はどこにあるのでしょうか？オーストラリア、カナダ、そして最近ではニュージーランドでも、銃乱射事件の後には銃の使用を制限していますが、コロンバイン事件の後、アメリカではそのような反応はありませんでした。なぜだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "澳大利亚。亚瑟港大屠杀；国家火器协议。\n\n加拿大。理工学院大屠杀；几年后枪支管制立法。\n\n新西兰不在二十年规则范围内，但基督城大屠杀导致了类似的努力。\n导致了类似的努力。\n\n所有这些国家都是讲英语的，多数是...",
      "title": "美国具体有什么不同，导致它对枪支管制有如此强烈的反对？澳大利亚、加拿大和最近的新西兰都在大规模枪击事件后限制枪支的使用，而美国在柯伦拜大屠杀后却没有这样的反应。为什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "澳大利亞。亞瑟港大屠殺；國家火器協議。\n\n加拿大。理工學院大屠殺；幾年後槍支管制立法。\n\n新西蘭不在二十年規則範圍內，但基督城大屠殺導致了類似的努力。\n導致了類似的努力。\n\n所有這些國家都是講英語的，多數是...",
      "title": "美國具體有什麼不同，導致它對槍支管制有如此強烈的反對？澳大利亞、加拿大和最近的新西蘭都在大規模槍擊事件後限制槍支的使用，而美國在柯倫拜大屠殺後卻沒有這樣的反應。爲什麼？"
    }
  ]
}