{
  "author": "chinciusan",
  "the_new_excerpt": "Here's what happened: there was a STORM token swap that I did not know about and\nmissed it. Now, I was left with about 70k old STORM tokens and wanted to swap\nthem. I got into the STORMX telegram chat, and this guy, who took the name and\nprofile picture of one of the admins offered to help. He asked…",
  "original_created_utc": 1608727519,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "事情是这样的：有一场我不知道的暴风雨代币交换，\n错过了。现在，我剩下了大约7万张旧的风暴代币，我想换一下。\n他们。我进入了STORMX的电报聊天，这个人，他取了这个名字，\n其中一名提供帮助的管理员的个人资料照片。他问…",
      "title": "被一个假装是STORMX团队的人骗了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "事情是這樣的：有一場我不知道的暴風雨代幣交換，\n錯過了。現在，我剩下了大約7萬張舊的風暴代幣，我想換一下。\n他們。我進入了STORMX的電報聊天，這個人，他取了這個名字，\n其中一名提供幫助的管理員的個人資料照片。他問…",
      "title": "被一個假裝是STORMX團隊的人騙了"
    }
  ],
  "title": "Got scammed by a guy pretending to be with the STORMX team",
  "created_utc": 1608795274,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Here&#39;s what happened: there was a STORM token swap that I did not know about and missed it. Now, I was left with about 70k old STORM tokens and wanted to swap them. I got into the STORMX telegram chat, and this guy, who took the name and profile picture of one of the admins offered to help. He asked for my ETH address, pretended to send it to their Swap TEAM, then sent me a link to a website, where I was going to offer him access to the ETH address. So I started to be suspicious about it, and I moved my ETH to a different address, then logged into that website (I know it is STUPID).</p>\n\n<p>He saw I moved the money, so he said I should fund some, to be able to swap the STORM. So I added 0.02 ETH to see what&#39;s next. He said to add more, so it can be faster :)</p>\n\n<p>Sadly I have forgotten about the 200$ worth of FirstBlood tokens that are now gone.</p>\n\n<p>He also promotes this stuff here on reddit here: <a href=\"https://np.reddit.com/r/stormxio/comments/k308d8/where_to_exchange/\">https://np.reddit.com/r/stormxio/comments/k308d8/where_to_exchange/</a> I believe he is the same guy</p>\n\n<p>This is the website he asked me to use: <a href=\"https://www.verifyaccounts.io/\">https://www.verifyaccounts.io</a></p>\n\n<p>Maybe someone can track him down or something, I don&#39;t know.</p>\n\n<p>Here is the compromised address: <a href=\"https://etherscan.io/address/0x1bBec401438fFaa1A15eCE0d0528FB9A8B0d5261\">https://etherscan.io/address/0x1bBec401438fFaa1A15eCE0d0528FB9A8B0d5261</a></p>\n\n<p>I just don&#39;t want anyone else to fall into this. This limited time for swapping (I did not keep an eye on the project, but also didn&#39;t get any email or anything) that led to this thing makes me wanna stay away from crypto unfortunately. 5 months to swap is not that long, whatever they say.</p>\n</div><!-- SC_ON -->",
  "score": 121,
  "permalink": "/r/CryptoCurrency/comments/kisfou/got_scammed_by_a_guy_pretending_to_be_with_the/",
  "subreddit": "CryptoCurrency",
  "id": "kisfou",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609271713206
}