{
  "author": "poiytrewq1066",
  "original_created_utc": 1628475559,
  "title": "The crypto amendments are in YOUR hands now. There will be NO vote on the amendments unless EVERY Senator votes to consider them. This is ALL HANDS ON DECK to call your senators.",
  "created_utc": 1628498626,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>tl;dr:</strong> A single senator can block all consideration of crypto amendments, altogether. PLEASE call your senators to let them know that you want a vote on the crypto amendments, even if they won&#39;t vote for them.</p>\n\n<p>The U.S. Senate <a href=\"https://thehill.com/homenews/senate/566928-senate-votes-to-shut-down-debate-on-1t-infrastructure-bill\">just voted to end debate on the Infrastructure Bill</a>. This means that all further debate on the Infrastructure Bill will be limited to 30 hours. A final vote on the Infrastructure Bill must occur by ~3:00 AM Eastern Time on Tuesday morning. However, some of this 30-hour period may be allocated to debate and voting on the crypto amendments.</p>\n\n<p>Neither the Warner/Portman/Sinema amendment, nor the Wyden/Toomy/Lummis amendment will even be voted on unless every senator votes to be allowed to vote on the amendment and Senate Majority Leader Chuck Schumer permits a vote. <a href=\"https://www.bloomberg.com/news/articles/2021-08-09/senators-near-deal-on-crypto-oversight-but-may-be-too-late\"><strong>This means that just 1 out of the 100 senators can block consideration of the crypto amendments altogether.</strong></a> If neither of the amendments is considered, the disastrous language in the original bill (which does NOT exempt miners, validators, software/protocol developers, or wallet manufacturers) will go through. This is really bad and would mean that Janet Yellen would win. The reporting requirements would possibly mean that Americans would have to provide their name, address and verify their ID every time they purchase a Ledger cold wallet or download a new software wallet. It would also drive many miners, who just relocated to the US from China, out of business. There is a good chance that other countries would follow the U.S.&#39;s actions and create similar laws.</p>\n\n<p>If you live in the U.S., PLEASE call your senators and ask them to &quot;Support consideration of, and taking a vote on, BOTH the Warner/Portman/Sinema crypto amendment AND the Toomey/Wyden/Lummis.&quot; Please also ask them to &quot;Vote YES on the Toomey/Wyden/Lummis amendment and NO on the Warner/Portman/Sinema amendment.&quot; It will suck if the Warner/Portman/Sinema amendment passes, but it will be far, far worse if neither amendment is even brought to a vote.</p>\n\n<p><a href=\"https://www.fightforthefuture.org/actions/stop-the-senate-from-sneaking-through-total-surveillance-of-the-crypto-economy/\">This site makes it easy to call your senators.</a> The time for us Americans to act is NOW-- the whole world is watching.</p>\n\n<p>---------------------------------------------</p>\n\n<p>Relevant text from the Bloomberg article, because fuck paywalls:</p>\n\n<p>&quot;The last minute frenzy to reach a deal may prove to  be fruitless if the senators are unable to get the amendment called up for a vote. The Senate has been deadlocked for days over addressing more  changes to the bill because of disputes between lawmakers about which  amendments to consider and how long to continue debating. Any single senator can block an amendment from getting a vote.</p>\n\n<p>&#39;I don’t know if they will allow, the floor managers and the leadership, will allow us to offer our amendment in the second 30 hours, but we’re going to find out,&#39; Lummis told reporters Sunday, referring to a 30-hour debate time period beginning Sunday night before the lawmakers will vote on final passage of the infrastructure bill.&quot;</p>\n\n<p>---------------------------------------------</p>\n\n<p>EDIT: You can leave a voicemail for your Senators since it is currently after business hours. Given the time-sensitive nature of the amendments, it may be more effective to speak to a staffer in the morning during business hours (After 9:00 AM Eastern Time).</p>\n</div><!-- SC_ON -->",
  "score": 182,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/tmu4JmrRfTSUnt20CFpLhT_hPLrjohTKjENd1prPY84.jpg?auto=webp&s=e46591de00af98284b62228b5dab27f8e42043cc",
          "width": 960,
          "height": 540
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/tmu4JmrRfTSUnt20CFpLhT_hPLrjohTKjENd1prPY84.jpg?width=108&crop=smart&auto=webp&s=768018799e1d9ea64b757bc7d1eed3ce5f1bdb11",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/tmu4JmrRfTSUnt20CFpLhT_hPLrjohTKjENd1prPY84.jpg?width=216&crop=smart&auto=webp&s=49da6c461290a54ee50c7d2ef0732528caf763ad",
            "width": 216,
            "height": 121
          },
          {
            "url": "https://external-preview.redd.it/tmu4JmrRfTSUnt20CFpLhT_hPLrjohTKjENd1prPY84.jpg?width=320&crop=smart&auto=webp&s=2060ed3146fda0416536001d9056bc568c4fe90b",
            "width": 320,
            "height": 180
          },
          {
            "url": "https://external-preview.redd.it/tmu4JmrRfTSUnt20CFpLhT_hPLrjohTKjENd1prPY84.jpg?width=640&crop=smart&auto=webp&s=415993804c05d6cc13c1ce6972864e1031f9d435",
            "width": 640,
            "height": 360
          },
          {
            "url": "https://external-preview.redd.it/tmu4JmrRfTSUnt20CFpLhT_hPLrjohTKjENd1prPY84.jpg?width=960&crop=smart&auto=webp&s=48c788dafc95dbfe2c22dd5a910e964e0621e3ba",
            "width": 960,
            "height": 540
          }
        ],
        "variants": {},
        "id": "P6S3dTCvRQBCX9LZj0TyZYyvF239q7Z0NOmm1b1Zbw0"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/p0s9pw/the_crypto_amendments_are_in_your_hands_now_there/",
  "subreddit": "CryptoCurrency",
  "id": "p0s9pw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "tl;dr: A single senator can block all consideration of crypto amendments,\naltogether. PLEASE call your senators to let them know that you want a vote on\nthe crypto amendments, even if they won't vote for them.\n\nThe U.S. Senate just voted to end debate on the Infrastructure…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "tl;dr: 一人の上院議員が、暗号の修正案の検討をすべてブロックできる。\nを完全に阻止することができます。上院議員に電話をして、暗号修正案の投票を希望していることを伝えてください。\n上院議員に電話して、暗号修正案に投票してほしいと伝えてください。\n\n米国上院は、インフラストラクチャーに関する議論を終了することを決議しました。",
      "title": "暗号の改正は、今、あなたの手の中にあります。すべての上院議員が修正案を検討するために投票しない限り、修正案の投票は行われません。上院議員に電話をかけるために、すべての人が手を挙げなければなりません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "tl;dr: 一位参议员可以阻止所有对加密货币修正案的审议。\n完全是这样。请给你的参议员打电话，让他们知道你想对加密货币修正案进行投票。\n即使他们不会投票给他们。\n\n美国参议院刚刚投票结束对基础设施的辩论...",
      "title": "现在加密货币修正案在你手中。除非每个参议员都投票考虑这些修正案，否则不会对这些修正案进行投票。现在，所有的人都要给你的参议员打电话。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "tl;dr: 一位參議員可以阻止所有對加密貨幣修正案的審議。\n完全是這樣。請給你的參議員打電話，讓他們知道你想對加密貨幣修正案進行投票。\n即使他們不會投票給他們。\n\n美國參議院剛剛投票結束對基礎設施的辯論...",
      "title": "現在加密貨幣修正案在你手中。除非每個參議員都投票考慮這些修正案，否則不會對這些修正案進行投票。現在，所有的人都要給你的參議員打電話。"
    }
  ]
}