{
  "author": "mic_droo",
  "original_created_utc": 1645973486,
  "title": "Most disgusting scam yet: dude comments on all posts pretending to post the official crypto address for helping the Ukrainian government. Please report u/substantialsummer634 to Reddit",
  "created_utc": 1645979587,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s pretty much all there is to say to it. &lt;a href=\"/u/substantialsummer634\"&gt;u/substantialsummer634&lt;/a&gt; is mass replying to posts, saying &amp;quot;Ukraine’s official Twitter account tweeted out a call for donations through bitcoin, Ethereum, and stablecoin tether on Saturday.&amp;quot; and then adds an Ethereum address for donations. The first part is true, you can find the real addresses in &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/t26b00/im_uvladimirputin_and_im_asking_you_to_donate/\"&gt;this very popular post&lt;/a&gt;. The address is fake though. &lt;/p&gt;\n\n&lt;p&gt;Fortunately nobody fell for it yet, the last transfer to that address was 47 days ago, but please report the scammer to Reddit - I have done that already. Thanks!&lt;/p&gt;\n\n&lt;p&gt;Edit: just in case their account indeed gets suspended, their posts look like this: &amp;quot;&lt;em&gt;Ukraine Update: Ukraine’s official Twitter account tweeted out a call for donations through bitcoin, Ethereum, and stablecoin tether on Saturday. I just sent what I could, wish I could do more . Have a. Heart Stand with Ukraine . Here’s the wallet address if you guys wanna donate anything to help. [Wallet address]&lt;/em&gt;&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;If you see something like that, check if it&amp;#39;s the real address and if not, report the account&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 612,
  "permalink": "/r/CryptoCurrency/comments/t2pttl/most_disgusting_scam_yet_dude_comments_on_all/",
  "subreddit": "CryptoCurrency",
  "id": "t2pttl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "That's pretty much all there is to say to it. u/substantialsummer634\n[/u/substantialsummer634] is mass replying to posts, saying \"Ukraine’s official\nTwitter account tweeted out a call for donations through bitcoin, Ethereum, and\nstablecoin tether on Saturday.\" and then adds an Ethereum address for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それに対して、u/substantialsummer634は、かなりあります。\n[/u/substantialsummer634】は、「ウクライナの公式」という書き込みに大量返信しています。\nツイッターアカウントは、ビットコイン、イーサリアム、そして、ビットコインによる寄付の呼びかけをツイートしています。\nstablecoin tether on Saturday.\" と言って、Ethereumのアドレスを追加しています。",
      "title": "ウクライナ政府を支援するための公式暗号アドレスを掲示するふりをして、すべての投稿にコメントする男という、これまでで最も嫌な詐欺です。u/substantialsummer634をRedditに報告してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "u/substantialsummer634]对此几乎无话可说。\n[/u/substantialsummer634]正在大量回帖，说 \"乌克兰的官方\n推特账户在推特上呼吁通过比特币、以太坊和\nstablecoin tether on Saturday.\"，然后添加了一个Ethereum地址，用于...",
      "title": "最令人厌恶的骗局：花花公子在所有帖子上发表评论，假装发布帮助乌克兰政府的官方加密货币地址。请向Reddit举报u/substantialsummer634"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "u/substantialsummer634]對此幾乎無話可說。\n[/u/substantialsummer634]正在大量回帖，說 \"烏克蘭的官方\n推特賬戶在推特上呼籲通過比特幣、以太坊和\nstablecoin tether on Saturday.\"，然後添加了一個Ethereum地址，用於...",
      "title": "最令人厭惡的騙局：花花公子在所有帖子上發表評論，假裝發佈幫助烏克蘭政府的官方加密貨幣地址。請向Reddit舉報u/substantialsummer634"
    }
  ]
}