{
  "author": "PhenomenalPancake",
  "original_created_utc": 1642177178,
  "title": "Women who have been to prison, how are female sex offenders treated?",
  "created_utc": 1642192513,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In the news we sometimes see female sex offenders get prison time, much of it being female teachers who had inappropriate relationships with male students, but we don&amp;#39;t get much about what they experience when being incarcerated. Male sex offenders, especially pedophiles, are universally reviled in prisons and are treated as the lowest of the low. Are they nearly as reviled in women&amp;#39;s prisons? Do you have any stories or experiences seeing such women in prison and how they&amp;#39;re treated there?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 124,
  "permalink": "/r/AskWomen/comments/s3w6mv/women_who_have_been_to_prison_how_are_female_sex/",
  "subreddit": "AskWomen",
  "id": "s3w6mv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "In the news we sometimes see female sex offenders get prison time, much of it\nbeing female teachers who had inappropriate relationships with male students,\nbut we don't get much about what they experience when being incarcerated. Male\nsex offenders, especially pedophiles, are universally reviled in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ニュースでは、女性の性犯罪者が服役しているのを目にすることがありますが、その多くは\n男子生徒と不適切な関係を持った女性教師。\nしかし、彼らが投獄されたときにどのような経験をしたかは、あまり知られていません。男性\n性犯罪者、特に小児性愛者は、普遍的に悪者扱いされています。",
      "title": "刑務所に入ったことのある女性、女性の性犯罪者はどのように扱われているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在新闻中，我们有时会看到女性性犯罪者被判入狱，其中很多是\n是那些与男学生有不正当关系的女教师。\n但我们并不了解她们被监禁时的经历。男性\n性犯罪者，特别是恋童癖者，被普遍谩骂，在...",
      "title": "坐过牢的女人，女性性犯罪者是如何被对待的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在新聞中，我們有時會看到女性性犯罪者被判入獄，其中很多是\n是那些與男學生有不正當關係的女教師。\n但我們並不瞭解她們被監禁時的經歷。男性\n性犯罪者，特別是戀童癖者，被普遍謾罵，在...",
      "title": "坐過牢的女人，女性性犯罪者是如何被對待的？"
    }
  ]
}