{
  "author": "notaselfdrivingcar",
  "the_new_excerpt": "Why does it feel like there's some lesson to be learned here, it's like Tesla\nand Elon specifically wanted to send a message here.\n\nBitcoin's energy usage, high fees have been making headlines for years now,\nTesla and Elon aren't new to the crypto scene, and they surely aren't new to\ntechnology, and…",
  "original_created_utc": 1620864718,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜかというと、ここには何か教訓があるように感じられるからで、まるでTesla\nとイーロンは、特にここでメッセージを送りたかったようです。\n\nビットコインのエネルギー使用量や手数料の高さは、何年も前から話題になっています。\nTeslaとElonは、暗号の分野では新参者ではありませんし、テクノロジーの分野でも新参者ではありません。\nテクノロジー、そして...",
      "title": "では、テスラが最初に投資したとき、ビットコインのエネルギー使用量を知らなかったということですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为什么感觉这里有一些教训，就像特斯拉\n和埃隆特别想在这里发出一个信息。\n\n比特币的能源使用、高额费用已经成为多年来的头条新闻。\n特斯拉和埃隆对加密货币领域并不陌生，他们对技术也肯定不陌生，而且......\n技术，而且...",
      "title": "所以你的意思是告诉我，当特斯拉第一次投资比特币时，他们并不清楚比特币的能源使用情况？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲什麼感覺這裏有一些教訓，就像特斯拉\n和埃隆特別想在這裏發出一個信息。\n\n比特幣的能源使用、高額費用已經成爲多年來的頭條新聞。\n特斯拉和埃隆對加密貨幣領域並不陌生，他們對技術也肯定不陌生，而且......\n技術，而且...",
      "title": "所以你的意思是告訴我，當特斯拉第一次投資比特幣時，他們並不清楚比特幣的能源使用情況？"
    }
  ],
  "title": "So you mean to tell me Tesla wasn't aware of Bitcoin's Energy usage when they first invested in it?",
  "created_utc": 1620877697,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Why does it feel like there&#39;s some lesson to be learned here, it&#39;s like Tesla and Elon specifically wanted to send a message here.</p>\n\n<p>Bitcoin&#39;s energy usage, high fees have been making headlines for years now, Tesla and Elon aren&#39;t new to the crypto scene, and they surely aren&#39;t new to technology, and renewable energy.</p>\n\n<p>So what is Tesla trying to do here? Aren&#39;t they hurting their own investment by sharing that tweet?</p>\n</div><!-- SC_ON -->",
  "score": 1034,
  "permalink": "/r/CryptoCurrency/comments/nb3i6o/so_you_mean_to_tell_me_tesla_wasnt_aware_of/",
  "subreddit": "CryptoCurrency",
  "id": "nb3i6o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985993633
}