{
  "author": "historiagrephour",
  "original_created_utc": 1634810417,
  "title": "MEGATHREAD | Day Three (FINAL DAY) of the AskHistorians 2021 Digital Conference | \"[Deleted] & Missing History: Reconstructing the Past, Confronting Distortions\"",
  "created_utc": 1634833605,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Time really does fly when you&#39;re having fun.</p>\n\n<p>It&#39;s hard to believe that today is the final day of the AHDC 2021, but we&#39;re so incredibly pleased with how the conference has been going. Our first six panels have featured some truly exciting research by incredible historians, and have racked up thousands of views while inspiring a number of interesting discussions across AMAs and networking sessions alike.</p>\n\n<p>That said, there is still more to see. We premiered the final three panels yesterday evening whose Q&amp;A AMAs will go live over the course of the day. We also have two more networking sessions scheduled for this morning and evening as well, and our AHDC 2021 Roundtable. You can still register to be a part of the live Q&amp;A for this <a href=\"https://www.eventbrite.com/e/all-women-have-a-past-ahdc-2021-live-roundtable-qa-tickets-190561593857\">here</a>.</p>\n\n<p>Again, check out our <a href=\"https://www.yumpu.com/en/document/read/65910401/ahdc-2021-program\">conference program</a>  if you are interested in the history of the AskHistorians conference, its background, rationale, and the details of this year&#39;s event (including information about the participants, papers, and panels), please check out.</p>\n\n<p>We hope that you&#39;ve enjoyed our offerings from Days One and Two. You can catch up on any panels you may have missed via our <a href=\"https://www.youtube.com/channel/UCJudPwztZyg2BQjhetw_bww\">YouTube channel</a>, while the questions and answers from our first six panel AMA threads (<a href=\"https://www.reddit.com/r/AskHistorians/comments/qbdy27/the_lie_became_the_truth_locating_trans/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">1</a>, <a href=\"https://www.reddit.com/r/AskHistorians/comments/qbgj7f/racism_is_so_universal_its_become_normal_race/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">2</a>, <a href=\"https://www.reddit.com/r/AskHistorians/comments/qbls5e/players_gonna_play_play_play_play_play_history_in/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">3</a>, <a href=\"https://www.reddit.com/r/AskHistorians/comments/qbyxe4/all_aboard_the_orients_expression_reclaiming/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">4</a>, <a href=\"https://www.reddit.com/r/AskHistorians/comments/qc6c6i/i_make_the_governor_call_me_governor_rewriting/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">5</a>, and <a href=\"https://www.reddit.com/r/AskHistorians/comments/qcbhsp/never_forgotten_never_again_recentering/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">6</a>) are sure to provide some fantastic reading material.</p>\n\n<p>This thread contains an overview of today&#39;s events, with direct links added as soon as they go live, and an explanation of how to get involved. If you have any questions, leave them below and we&#39;ll address them as soon as possible.</p>\n\n<p>Thank you to everyone for joining us for the AskHistorians 2021 Digital Conference, for watching panels, asking questions, popping into our networking sessions, and discussing the conference in our daily megathreads. Your support and participation have once more validated our subreddit&#39;s central premise as articulated last year by <a href=\"/u/crrpit\">/u/crrpit</a>:  &quot;good historical scholarship has a public, that opening up these conversations is important and worthwhile&quot;. Thank you all for proving this to be true.</p>\n\n<h1>Today&#39;s Schedule</h1>\n\n<p><strong>Networking Session Five (8 AM EDT): Casual Networking</strong></p>\n\n<ul>\n<li>Register <a href=\"https://www.reddit.com/r/AskHistorians/comments/q6q88l/registration_is_open_for_askhistorians_digital/?utm_medium=android_app&amp;utm_source=share\">here</a></li>\n</ul>\n\n<p><strong>Panel Seven AMA (9 AM EDT):</strong> <a href=\"https://www.askhistorians.com/deleted-history\">&quot;Names You&#39;ve Never Heard: [Deleted] Figures in the Annals of History&quot;</a></p>\n\n<ul>\n<li><a href=\"https://youtu.be/YtRA0K2FYq8\">Panel Recording</a>- Watch now!</li>\n<li><a href=\"https://www.reddit.com/r/AskHistorians/comments/qcpolb/names_youve_never_heard_deleted_figures_from_the/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">AMA Thread</a> - Go ask a question!</li>\n</ul>\n\n<p><strong>Panel Eight AMA (3 PM EDT):</strong> <a href=\"https://www.askhistorians.com/indigenous-trauma\">&quot;Forbidden to Remember, Terrified to Forget: Truth, Trauma, and Narratives of Indigenous History&quot;</a></p>\n\n<ul>\n<li><a href=\"https://youtu.be/VuzBq9HEP6Q\">Panel Recording</a> - Watch now!</li>\n<li>AMA Thread - (pending)</li>\n</ul>\n\n<p><strong>2021 Roundtable:</strong> <a href=\"https://www.askhistorians.com/2021-roundtable\">&quot;All Women Have a Past: Reconstructing Women in the Historical Imagination&quot;</a> <strong>(5 PM EDT)</strong></p>\n\n<ul>\n<li>Register <a href=\"https://www.eventbrite.com/e/all-women-have-a-past-ahdc-2021-live-roundtable-qa-tickets-190561593857\">here</a></li>\n<li>Roundtable Recording (pending)</li>\n</ul>\n\n<p><strong>Panel Nine AMA (7 PM EDT):</strong> <a href=\"https://www.askhistorians.com/fiction\">&quot;Who Tells Your Story?: (Mis)Representing the Past in Works of Historical Fiction&quot;</a></p>\n\n<ul>\n<li><a href=\"https://youtu.be/tv56FU6Fl1o\">Panel Recording</a> - Watch now!</li>\n<li>AMA Thread - (pending)</li>\n</ul>\n\n<p><strong>Networking Session Six (1 PM EDT): AskHistorians Scavenger Hunt!</strong></p>\n\n<ul>\n<li>Register <a href=\"https://www.reddit.com/r/AskHistorians/comments/q6q88l/registration_is_open_for_askhistorians_digital/?utm_medium=android_app&amp;utm_source=share\">here</a></li>\n</ul>\n\n<h1>How to Participate</h1>\n\n<p><strong>Watch talks:</strong> The central feature of the conference is its collection of recorded talks. These talks have been divided into nine panels of 2–3 speakers, each taking ten minutes to present on their own research before joining in a group discussion with their fellow panelists and an expert moderator. Today&#39;s panels were premiered as livestreams yesterday evening and can now be found on our <a href=\"https://www.youtube.com/channel/UCJudPwztZyg2BQjhetw_bww\">YouTube channel</a>. The recordings will be available indefinitely, so you can always go back and catch up on anything you may have missed!</p>\n\n<p><strong>Ask questions:</strong> Each panel will have its own AMA-style Q&amp;A thread where you can ask the speakers anything you&#39;d like to know about their work. These will go live according to the schedule posted above, and will continue as long as the participants feel like answering more questions!</p>\n\n<p><strong>Attend live events:</strong> Although our conference panels have all been pre-recorded, they will be premiered at 5 PM EDT as livestreamed talks on YouTube the evening before their associated AMA. Once they have been premiered, they will be made available indefinitely on the AskHistorians YouTube channel.</p>\n\n<p>As today is the final day of the conference, we won&#39;t be livestreaming any panels for tomorrow; however, we will be hosting a live Q&amp;A on YouTube with the speakers of our 2021 Roundtable. If you haven&#39;t already registered, you can do so <a href=\"https://www.eventbrite.com/e/all-women-have-a-past-ahdc-2021-live-roundtable-qa-tickets-190561593857\">here</a>.</p>\n\n<p>Throughout the conference, we will also be hosting live networking sessions for participants and audience members to attend. There will be one networking session focused on talking shop about all things history and one social session focused on chatting and getting to know fellow guests each day.</p>\n\n<p>Yesterday morning, we hosted AskHistorians Trivia. This afternoon, we&#39;ll wrap things up with an AskHistorians Scavenger Hunt across secret rooms in Gather.</p>\n\n<p>You are welcome to register for and attend as many of our networking and social sessions as you like. A full list of these events, and information about registering, can bee found <a href=\"https://www.reddit.com/r/AskHistorians/comments/q6q88l/registration_is_open_for_askhistorians_digital/?utm_medium=android_app&amp;utm_source=share\">here</a>.</p>\n\n<p><strong>Be a part of the conversation:</strong> We&#39;ll be treating these daily conference megathreads like our Friday Free-for-Alls: you&#39;re welcome to use them to discuss the conference, leave questions or comments, or chat informally about today&#39;s papers in this thread. Keep in mind, though, that our rules about civility are still very much in force. You can also follow updates on Twitter via <a href=\"http://twitter.com/askhistorians\">@askhistorians</a> and #AHDC2021. We encourage you to tweet about our conference as well if you&#39;d like. Just remember to tag us and use the #AHDC2021 hashtag!</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/qcod0w/megathread_day_three_final_day_of_the/",
  "subreddit": "AskHistorians",
  "id": "qcod0w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Time really does fly when you're having fun.\n\nIt's hard to believe that today is the final day of the AHDC 2021, but we're so\nincredibly pleased with how the conference has been going. Our first six panels\nhave featured some truly exciting research by incredible historians, and have\nracked up…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "楽しい時間は本当にあっという間ですね。\n\n今日がAHDC2021の最終日とは信じられませんが、私たちはカンファレンスがどのように行われたか、信じられないほど満足しています。\nカンファレンスの進行状況には大変満足しています。最初の6つのパネルは\n最初の6つのパネルでは、素晴らしい歴史家の方々による本当にエキサイティングな研究が紹介されました。\n積み上げてきたのは...",
      "title": "MEGATHREAD｜AskHistorians 2021 Digital Conferenceの3日目（FINAL DAY）｜「【削除】＆【消えた歴史】。過去を再構築し、歪曲に立ち向かう\""
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当你玩得开心时，时间真的会飞逝。\n\n很难相信今天是AHDC 2021年的最后一天，但我们非常满意\n但我们对会议的进展非常满意。我们的前六个小组\n呈现了一些由令人难以置信的历史学家进行的真正令人兴奋的研究，并且已经\n积累了...",
      "title": "访谈｜\"AskHistorians 2021 \"数字会议第三天（最后一天）｜\"[删除的]和缺失的历史。重构过去，对抗扭曲\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當你玩得開心時，時間真的會飛逝。\n\n很難相信今天是AHDC 2021年的最後一天，但我們非常滿意\n但我們對會議的進展非常滿意。我們的前六個小組\n呈現了一些由令人難以置信的歷史學家進行的真正令人興奮的研究，並且已經\n積累了...",
      "title": "訪談｜\"AskHistorians 2021 \"數字會議第三天（最後一天）｜\"[刪除的]和缺失的歷史。重構過去，對抗扭曲\""
    }
  ]
}