{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "Last week I actually lost sleep due to frustration and anger at the current self-regulatory structure in markets. While this is kind of silly and a bit absurd (though it did happen!), I think it’s worth examining and explaining how the incentives for a self-regulatory, for-profit company lead to extreme complexity and subsidization in US markets. It’s easy to say “self-regulatory BAD!” but harder to understand the web of complexity that such perverse structures create.\n\nThis is a long post. By the end, I hope you understand what the self-regulatory structure is, why it exists, why it creates perverse incentives, and how I think it should be fixed. I’ll do my best to explain the context of these archaic structure, why it leads to unnecessary complexity, and reduces competitive forces. Most importantly, throughout the piece think about how such perverse incentives leads to lax enforcement and wrist slaps, and a cozy relationship with the industry being regulated.\n\nThe financial services industry is the only industry in America (that I am aware of) in which for-profit, publicly traded firms are “self-regulatory.” What does “self-regulatory” mean and where did it come from? The structure came about from the member-owned stock exchanges that existed prior to 1934. In 1934 these exchanges were brought into partnership with federal regulators in the Exchange Act of 1934. This actually made a lot of sense. There was nobody better positioned to monitor and enforce the rules of a stock exchange (where trading happened in a physical location, on the floor of the exchange) than the exchange itself. There were conflicts-of-interest, of course, but there were also practical considerations of what technology and communication systems looked like in the early 1900s.\n\nSo what does “self-regulatory” mean? Now of course, I’m no lawyer, so take everything I say with that in mind. Essentially the self-regulatory structure gives the regulation arm of the exchange quasi-governmental powers (it’s been explained to me that this structure means the exchange is supposed to act as an extension of the SEC) – and gives the exchange itself immunity from prosecution when carrying out regulatory functions. It basically means that US exchanges set the rules for trading in US markets, and for interacting with their business, are then in charge of enforcing those rules and have no legal liability in the operation of that business. Those rules include things like fee structure, order types, matching priority model, co-location and data feed costs, and many other things.\n\nThat means each for-profit exchange is setting its own rules, and responsible for enforcing those rules. Each exchange is responsible for monitoring its own market for manipulation (called “market surveillance”). In reality, the responsibility for market surveillance is outsourced to FINRA. FINRA is another SRO – they are not a for-profit exchange, but they are responsible for setting the rules and policing broker/dealers. You may have heard of some of the other SROs – the DTCC, the OCC, the NSCC and others listed [here](https://www.sec.gov/rules/sro.shtml).\n\nFINRA, DTCC, OCC and NSCC are not for-profit, of course, but they are deeply conflicted. They operate on the fees generated by their members, who they police and regulate; stock exchanges do too – their best customers are high-speed speculators (aka HFT), who submit 95% of all orders, and are a party to \\~90% of all trades. These speculators also pay for expensive, proprietary data feeds, high-speed connections and cross-connects, and other exchange services. SROs are supposed to police these customers, and are charged with ensuring that their best customers follow the rules.\n\n*Gee Dave, that sounds like a conflict-of-interest! At least it’s not for anything important, like the foundation of the US economy, right?*\n\nIt is generally the SROs that have made breaking the rules a cost of doing business (naturally following the lead of the SEC, of course). While they don’t have the authority to press criminal charges (again, not a lawyer) they could easily make referrals and work with the DOJ, who does have that authority. Instead, nearly all of Wall St has decided that breaking the rules is nearly always only worth a fine, very rarely an industry ban, and practically never a perp walk and prison.\n\nJust like nobody lost their banking license for fraud following the Great Financial Crisis, can you remember a time when a major broker/dealer had their license revoked? Robinhood has been fined well over $100M by FINRA and the SEC for lying to their customers, failing to provide best execution, and underinvesting in compliance, technology and any system for protecting their customers. For some reason, none of this was enough to lose their license to operate. Those guys are laughing all the way to the bank. Fine after fine is charged to every broker on Wall St, paid by the shareholders, and everyone keeps collecting their bonuses.\n\n**First SRO Problem: Reluctance to exact severe consequences because the fees being collected from the perps are paying for SRO operations and bonuses.**\n\nHowever, there’s another side to all of this. Let’s take a concrete example to start. In 2014, BATS and DirectEdge merged. Together, they represented approximately 20% of trading in the US. Each of them operated 2 copycat exchanges – a maker/taker exchange (BZX and EDGX) and an inverted exchange (BYX and EDGA). In any other industry, such a merger would result in the consolidation of these exchanges so that the resulting company would only operate 2 exchanges. But that didn’t happen here. They continued to run 4 exchanges and do to this day. Why would they do that when it costs way more to run 4 exchanges rather than 2? The answer is actually quite simple and obvious – money. To understand why, we have to take a quick step back, and reference another law.\n\nThe 1975 Amendments to the 1934 Exchange Act established the need (and gave the SEC the authority) to create the Securities Information Processor (SIP). It was groundbreaking at the time. The SIP is the “ticker” – a record of quotes and trades on all national securities exchanges. Ultimately the SEC did NOT create such a system though, it delegated the authority to the exchanges. The exchanges created the NMS Committees, which are responsible for managing the SIP and setting fees. From last year’s SEC press release announcing changes to the SIP:\n\n>In  1975, one of Congress’s principal objectives for the national  market  system was to assure the availability of information with respect  to  quotations for, and transactions in, securities.  The national   securities exchanges and the Financial Industry Regulatory Authority   (“FINRA” and collectively, the “SROs”) have acted jointly to collect,   consolidate, and disseminate information for NMS stocks.  For each NMS   stock, the SROs were required to provide specified NMS market data to   exclusive securities information processors (“SIPs”).  The SIPs then   consolidated that information and made it available to the public.  The   rules adopted today are designed to modernize and improve upon that   historical infrastructure, by expanding the content of NMS market data   and replacing the historical “exclusive SIP” model with a decentralized   model of “competing consolidators.” \n\n**ALRIGHT ENOUGH HISTORY DAVE, WTF IS THE SIP??**\n\nSorry, it’s hard to talk about this stuff without getting deep in the weeds. The SIP is generally referred to as the “public data feed” – at the moment (though this is changing), it provides top-of-book quotes across all US exchanges, calculates the NBBO and publishes it, communicates regulatory halts and other information, and publishes all trades both on- and off-exchange.\n\n**And guess what? You pay for it.**\n\nThat’s right – you are paying for the SIP. Nearly every retail broker subscribes to the SIP, and generally speaking when you see the prices that a stock is being quoted at, or trading for, you’re seeing SIP data. This public data feed costs $4 per user, per month, for non-professional, display-only users – if you’re not a financial professional, and you’re only seeing the data with your eyes (rather than programming a trading system that will automatically look at the data), then you are a non-professional, display-only user.\n\nWhat are all of those user fees worth? Something on the order of > $300M per year. That money is collected by the operators of the SIP (NYSE and Nasdaq), and distributed according to a very complicated formula to each of the exchanges. On the whole, it gets divided up based on quoting and trading market share, and means that approximately $100M every year goes to CBOE, NYSE and Nasdaq (with much less going to the smaller exchanges). That’s why BATS/DirectEdge (and now CBOE, which acquired them in 2016) was incentivized to continue to operate 4 exchanges, because it meant that more of this public subsidy would go to them. Talk about perverse – it’s the exact opposite of what the 1934 Exchange Act was established to do:\n\n>(5)  The rules of the [exchange](https://www.law.cornell.edu/definitions/uscode.php?width=840&height=800&iframe=true&def_id=15-USC-1989774883-482320172&term_occur=999&term_src=title:15:chapter:2B:section:78f)   are designed to prevent fraudulent and manipulative acts and  practices,  to promote just and equitable principles of trade, to foster   cooperation and coordination with[ persons ](https://www.law.cornell.edu/definitions/uscode.php?width=840&height=800&iframe=true&def_id=15-USC-991716523-482320180&term_occur=999&term_src=)engaged   in regulating, clearing, settling, processing information with respect   to, and facilitating transactions in securities, to remove impediments   to and perfect the mechanism of a free and open market and a national   market system, and, in general, to protect investors and the public   interest; and are not designed to permit unfair discrimination between   customers,[ issuers,](https://www.law.cornell.edu/definitions/uscode.php?width=840&height=800&iframe=true&def_id=15-USC-1179159879-482320179&term_occur=999&term_src=title:15:chapter:2B:section:78f)[ brokers,](https://www.law.cornell.edu/definitions/uscode.php?width=840&height=800&iframe=true&def_id=15-USC-1380616231-482320175&term_occur=999&term_src=title:15:chapter:2B:section:78f) or[ dealers,](https://www.law.cornell.edu/definitions/uscode.php?width=840&height=800&iframe=true&def_id=15-USC-1335779815-482320176&term_occur=999&term_src=title:15:chapter:2B:section:78f)   or to regulate by virtue of any authority conferred by this chapter   matters not related to the purposes of this chapter or the   administration of the [exchange](https://www.law.cornell.edu/definitions/uscode.php?width=840&height=800&iframe=true&def_id=15-USC-1989774883-482320172&term_occur=999&term_src=title:15:chapter:2B:section:78f).\n\nIt gets even worse (No way Dave! How can it be worse than this??). Each exchange sells private data feeds that are faster and contain more information than the SIP. So the exchanges are incentivized to ensure that the SIP remains slow, and has less data, so they can make more money selling their private feeds. Pretty sweet gig if you can get it, right?\n\nNow, I’ve simplified the issue, of course. It gets even more complex with Reg NMS and order protection, which requires all exchanges to connect and route to one another, and brokers to manage that complexity as well. It means that CBOE gets double the revenue for private market data, and other connectivity fees, all of which ensures that CBOE earnings per share are robust and growing, and which accomplishes the opposite of the intention of the 1934 Act.\n\n**Second SRO Problem: SRO structure is a classic example of regulation and subsidy creating inefficient and costly complexity.**\n\nThe BATS/DirectEdge example is only one of so many that highlight the unnecessary complexity at the heart of US markets. I’ve talked many times about the need for regulators to understand complex systems and systems theory, to understand evolving regulatory structures in that context, and to focus on simplifying markets rather than making them more complex. Unnecessary complexity leads to several problems:\n\n1. Opacity – it becomes very difficult to understand these complex systems. That leads to mistrust, and potentially loss of confidence. We are seeing that play out right now in the retail community, and for good reason. Nobody trusts Wall St.\n2. Fragility – unnecessary complexity can lead to fragility. For example, the segmentation in US markets that diverts retail order flow to the duopoly of Citadel and Virtu leaves exchanges as toxic cesspools that discourage market making. This both widens spreads and reduces market making diversity, leading to behavior that can result in illiquidity contagions (mini flash crashes).\n3. Rent Seeking and Concentration – unnecessary complexity incentivizes a select few firms to master the complexity. This puts them in a privileged position, and creates economies of scale where the more of the market they master and control, the more information they have that others don’t, and the more they’re able to master and control. They push SROs to create ever more complexity to maintain their incumbent position, and are able to extract rents as a result. The SROs listen to these firms because they are responsible for more and more trading activity, which means they are the SROs’ best customers. Instead of SROs following their duties under the 1934 Act, they act in the interests of their shareholders to maximize revenue. This cycle continues unabated.\n\n**Third SRO Problem: Unnecessary complexity makes markets opaque, fragile and leads to a feedback loop of rent seeking and concentration of power. The for-profit motive overrides the SRO’s duty to create fair and efficient markets.**\n\nI mentioned before that SROs have legal immunity. This means many things, but primarily it means that the brokers who are members of the exchange don’t have legal recourse when something goes wrong. It is for this reason that retail brokers who don’t accept PFOF still route to the off-exchange duopoly of Citadel and Virtu, because they want someone’s neck to wring when something goes wrong. The legal immunity that exchanges enjoy is one of the reasons that we have dramatically segmented markets.\n\n**Fourth SRO Problem: Legal immunity for for-profit, publicly traded companies leads to perverse incentives and terrible outcomes.**\n\nSo what’s the result? A huge amount of unnecessary complexity, enforcement becoming a cost of doing business, and ultimately fragile markets with low participant diversity delivering poor outcomes for investors as the for-profit SROs focus on creating churn and volume to increase earnings per share.\n\nMore complexity means more fragmentation. More fragmentation means more complex order types. More fragmentation and complex order types means more unnecessary trading and churn. More unnecessary trading and churn means more earnings for publicly traded SROs. Rinse and repeat. It ultimately means that we end up with so much complexity that it’s impossible to keep track of. Take a look at the results of this 2018 RBC study on exchange fee structure (the picture is awesome, but I can't seem to add pictures to a post in this sub-reddit):\n\n* Exchanges have at least 1,023 pricing “paths”\n* 3,762  separate pricing variables across the exchanges – “strongly suggest  that exchange prices are tailored and offered on a bespoke basis”\n* Extreme complexity, customized for specific firms\n* Extreme routing distortion (TD’s “virtually all” limit orders routed to EDGX)\n* Fee-agnostic brokers had 7x better VWAP performance (Clearpool)\n\nIf someone can explain how this fee structure “promotes just and equitable principles of trade,” “protects investors and the public interest,” and is “not designed to permit unfair discrimination between customers, issuers, brokers or dealers” I’m all ears. Go ahead, give it a try!\n\nNow, let’s take this convoluted, inefficient structure, add in a regulatory revolving door, corrupt campaign contribution system and corrupt politicians, mix it all together, and out comes the US crony capitalist system.\n\n**GET OFF THE SOAP BOX DAVE, WHAT DO WE DO?**\n\nSo glad you asked. I’ve been asked a bunch of times what I think should change about US market structure, what I would do if I was SEC Chair (imagine that), etc. My answer is nearly always the same – reduce complexity. When I say reduce complexity, this post is what I’m talking about:\n\n· End the self-regulatory structure.\n\n· Build a proper regulator (complete overhaul of the SEC) with experts who are compensated appropriately.\n\n· Prioritize handcuffs, not wrist slaps and fines. Make the industry fearful of regulatory and enforcement consequences.\n\n· Reduce the number of exchanges, end public subsidy through SIP fees, get rid of every copycat exchange.\n\n· Create a burden for off-exchange trading to compensate for the damage that segmenting and diverting flow does to the price discovery mechanism.\n\n· Simplify, Simplify, SIMPLIFY!\n\n**Tldr;** Wall St cannot regulate itself. It leads to unnecessary complexity, and lax enforcement and fines instead of perp walks. It’s time to overhaul the regulatory structure, send people to jail, and simplify market structure dramatically.",
  "author_fullname": "t2_85qlq",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "SROs, Complexity and Market Structure",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "discussion",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_qww9zu",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.91,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 281,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Industry Discussion",
  "can_mod_post": false,
  "score": 281,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": 1637260656,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1637260376,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Last week I actually lost sleep due to frustration and anger at the current self-regulatory structure in markets. While this is kind of silly and a bit absurd (though it did happen!), I think it’s worth examining and explaining how the incentives for a self-regulatory, for-profit company lead to extreme complexity and subsidization in US markets. It’s easy to say “self-regulatory BAD!” but harder to understand the web of complexity that such perverse structures create.</p>\n\n<p>This is a long post. By the end, I hope you understand what the self-regulatory structure is, why it exists, why it creates perverse incentives, and how I think it should be fixed. I’ll do my best to explain the context of these archaic structure, why it leads to unnecessary complexity, and reduces competitive forces. Most importantly, throughout the piece think about how such perverse incentives leads to lax enforcement and wrist slaps, and a cozy relationship with the industry being regulated.</p>\n\n<p>The financial services industry is the only industry in America (that I am aware of) in which for-profit, publicly traded firms are “self-regulatory.” What does “self-regulatory” mean and where did it come from? The structure came about from the member-owned stock exchanges that existed prior to 1934. In 1934 these exchanges were brought into partnership with federal regulators in the Exchange Act of 1934. This actually made a lot of sense. There was nobody better positioned to monitor and enforce the rules of a stock exchange (where trading happened in a physical location, on the floor of the exchange) than the exchange itself. There were conflicts-of-interest, of course, but there were also practical considerations of what technology and communication systems looked like in the early 1900s.</p>\n\n<p>So what does “self-regulatory” mean? Now of course, I’m no lawyer, so take everything I say with that in mind. Essentially the self-regulatory structure gives the regulation arm of the exchange quasi-governmental powers (it’s been explained to me that this structure means the exchange is supposed to act as an extension of the SEC) – and gives the exchange itself immunity from prosecution when carrying out regulatory functions. It basically means that US exchanges set the rules for trading in US markets, and for interacting with their business, are then in charge of enforcing those rules and have no legal liability in the operation of that business. Those rules include things like fee structure, order types, matching priority model, co-location and data feed costs, and many other things.</p>\n\n<p>That means each for-profit exchange is setting its own rules, and responsible for enforcing those rules. Each exchange is responsible for monitoring its own market for manipulation (called “market surveillance”). In reality, the responsibility for market surveillance is outsourced to FINRA. FINRA is another SRO – they are not a for-profit exchange, but they are responsible for setting the rules and policing broker/dealers. You may have heard of some of the other SROs – the DTCC, the OCC, the NSCC and others listed <a href=\"https://www.sec.gov/rules/sro.shtml\">here</a>.</p>\n\n<p>FINRA, DTCC, OCC and NSCC are not for-profit, of course, but they are deeply conflicted. They operate on the fees generated by their members, who they police and regulate; stock exchanges do too – their best customers are high-speed speculators (aka HFT), who submit 95% of all orders, and are a party to ~90% of all trades. These speculators also pay for expensive, proprietary data feeds, high-speed connections and cross-connects, and other exchange services. SROs are supposed to police these customers, and are charged with ensuring that their best customers follow the rules.</p>\n\n<p><em>Gee Dave, that sounds like a conflict-of-interest! At least it’s not for anything important, like the foundation of the US economy, right?</em></p>\n\n<p>It is generally the SROs that have made breaking the rules a cost of doing business (naturally following the lead of the SEC, of course). While they don’t have the authority to press criminal charges (again, not a lawyer) they could easily make referrals and work with the DOJ, who does have that authority. Instead, nearly all of Wall St has decided that breaking the rules is nearly always only worth a fine, very rarely an industry ban, and practically never a perp walk and prison.</p>\n\n<p>Just like nobody lost their banking license for fraud following the Great Financial Crisis, can you remember a time when a major broker/dealer had their license revoked? Robinhood has been fined well over $100M by FINRA and the SEC for lying to their customers, failing to provide best execution, and underinvesting in compliance, technology and any system for protecting their customers. For some reason, none of this was enough to lose their license to operate. Those guys are laughing all the way to the bank. Fine after fine is charged to every broker on Wall St, paid by the shareholders, and everyone keeps collecting their bonuses.</p>\n\n<p><strong>First SRO Problem: Reluctance to exact severe consequences because the fees being collected from the perps are paying for SRO operations and bonuses.</strong></p>\n\n<p>However, there’s another side to all of this. Let’s take a concrete example to start. In 2014, BATS and DirectEdge merged. Together, they represented approximately 20% of trading in the US. Each of them operated 2 copycat exchanges – a maker/taker exchange (BZX and EDGX) and an inverted exchange (BYX and EDGA). In any other industry, such a merger would result in the consolidation of these exchanges so that the resulting company would only operate 2 exchanges. But that didn’t happen here. They continued to run 4 exchanges and do to this day. Why would they do that when it costs way more to run 4 exchanges rather than 2? The answer is actually quite simple and obvious – money. To understand why, we have to take a quick step back, and reference another law.</p>\n\n<p>The 1975 Amendments to the 1934 Exchange Act established the need (and gave the SEC the authority) to create the Securities Information Processor (SIP). It was groundbreaking at the time. The SIP is the “ticker” – a record of quotes and trades on all national securities exchanges. Ultimately the SEC did NOT create such a system though, it delegated the authority to the exchanges. The exchanges created the NMS Committees, which are responsible for managing the SIP and setting fees. From last year’s SEC press release announcing changes to the SIP:</p>\n\n<blockquote>\n<p>In  1975, one of Congress’s principal objectives for the national  market  system was to assure the availability of information with respect  to  quotations for, and transactions in, securities.  The national   securities exchanges and the Financial Industry Regulatory Authority   (“FINRA” and collectively, the “SROs”) have acted jointly to collect,   consolidate, and disseminate information for NMS stocks.  For each NMS   stock, the SROs were required to provide specified NMS market data to   exclusive securities information processors (“SIPs”).  The SIPs then   consolidated that information and made it available to the public.  The   rules adopted today are designed to modernize and improve upon that   historical infrastructure, by expanding the content of NMS market data   and replacing the historical “exclusive SIP” model with a decentralized   model of “competing consolidators.” </p>\n</blockquote>\n\n<p><strong>ALRIGHT ENOUGH HISTORY DAVE, WTF IS THE SIP??</strong></p>\n\n<p>Sorry, it’s hard to talk about this stuff without getting deep in the weeds. The SIP is generally referred to as the “public data feed” – at the moment (though this is changing), it provides top-of-book quotes across all US exchanges, calculates the NBBO and publishes it, communicates regulatory halts and other information, and publishes all trades both on- and off-exchange.</p>\n\n<p><strong>And guess what? You pay for it.</strong></p>\n\n<p>That’s right – you are paying for the SIP. Nearly every retail broker subscribes to the SIP, and generally speaking when you see the prices that a stock is being quoted at, or trading for, you’re seeing SIP data. This public data feed costs $4 per user, per month, for non-professional, display-only users – if you’re not a financial professional, and you’re only seeing the data with your eyes (rather than programming a trading system that will automatically look at the data), then you are a non-professional, display-only user.</p>\n\n<p>What are all of those user fees worth? Something on the order of &gt; $300M per year. That money is collected by the operators of the SIP (NYSE and Nasdaq), and distributed according to a very complicated formula to each of the exchanges. On the whole, it gets divided up based on quoting and trading market share, and means that approximately $100M every year goes to CBOE, NYSE and Nasdaq (with much less going to the smaller exchanges). That’s why BATS/DirectEdge (and now CBOE, which acquired them in 2016) was incentivized to continue to operate 4 exchanges, because it meant that more of this public subsidy would go to them. Talk about perverse – it’s the exact opposite of what the 1934 Exchange Act was established to do:</p>\n\n<blockquote>\n<p>(5)  The rules of the <a href=\"https://www.law.cornell.edu/definitions/uscode.php?width=840&amp;height=800&amp;iframe=true&amp;def_id=15-USC-1989774883-482320172&amp;term_occur=999&amp;term_src=title:15:chapter:2B:section:78f\">exchange</a>   are designed to prevent fraudulent and manipulative acts and  practices,  to promote just and equitable principles of trade, to foster   cooperation and coordination with<a href=\"https://www.law.cornell.edu/definitions/uscode.php?width=840&amp;height=800&amp;iframe=true&amp;def_id=15-USC-991716523-482320180&amp;term_occur=999&amp;term_src=\"> persons </a>engaged   in regulating, clearing, settling, processing information with respect   to, and facilitating transactions in securities, to remove impediments   to and perfect the mechanism of a free and open market and a national   market system, and, in general, to protect investors and the public   interest; and are not designed to permit unfair discrimination between   customers,<a href=\"https://www.law.cornell.edu/definitions/uscode.php?width=840&amp;height=800&amp;iframe=true&amp;def_id=15-USC-1179159879-482320179&amp;term_occur=999&amp;term_src=title:15:chapter:2B:section:78f\"> issuers,</a><a href=\"https://www.law.cornell.edu/definitions/uscode.php?width=840&amp;height=800&amp;iframe=true&amp;def_id=15-USC-1380616231-482320175&amp;term_occur=999&amp;term_src=title:15:chapter:2B:section:78f\"> brokers,</a> or<a href=\"https://www.law.cornell.edu/definitions/uscode.php?width=840&amp;height=800&amp;iframe=true&amp;def_id=15-USC-1335779815-482320176&amp;term_occur=999&amp;term_src=title:15:chapter:2B:section:78f\"> dealers,</a>   or to regulate by virtue of any authority conferred by this chapter   matters not related to the purposes of this chapter or the   administration of the <a href=\"https://www.law.cornell.edu/definitions/uscode.php?width=840&amp;height=800&amp;iframe=true&amp;def_id=15-USC-1989774883-482320172&amp;term_occur=999&amp;term_src=title:15:chapter:2B:section:78f\">exchange</a>.</p>\n</blockquote>\n\n<p>It gets even worse (No way Dave! How can it be worse than this??). Each exchange sells private data feeds that are faster and contain more information than the SIP. So the exchanges are incentivized to ensure that the SIP remains slow, and has less data, so they can make more money selling their private feeds. Pretty sweet gig if you can get it, right?</p>\n\n<p>Now, I’ve simplified the issue, of course. It gets even more complex with Reg NMS and order protection, which requires all exchanges to connect and route to one another, and brokers to manage that complexity as well. It means that CBOE gets double the revenue for private market data, and other connectivity fees, all of which ensures that CBOE earnings per share are robust and growing, and which accomplishes the opposite of the intention of the 1934 Act.</p>\n\n<p><strong>Second SRO Problem: SRO structure is a classic example of regulation and subsidy creating inefficient and costly complexity.</strong></p>\n\n<p>The BATS/DirectEdge example is only one of so many that highlight the unnecessary complexity at the heart of US markets. I’ve talked many times about the need for regulators to understand complex systems and systems theory, to understand evolving regulatory structures in that context, and to focus on simplifying markets rather than making them more complex. Unnecessary complexity leads to several problems:</p>\n\n<ol>\n<li>Opacity – it becomes very difficult to understand these complex systems. That leads to mistrust, and potentially loss of confidence. We are seeing that play out right now in the retail community, and for good reason. Nobody trusts Wall St.</li>\n<li>Fragility – unnecessary complexity can lead to fragility. For example, the segmentation in US markets that diverts retail order flow to the duopoly of Citadel and Virtu leaves exchanges as toxic cesspools that discourage market making. This both widens spreads and reduces market making diversity, leading to behavior that can result in illiquidity contagions (mini flash crashes).</li>\n<li>Rent Seeking and Concentration – unnecessary complexity incentivizes a select few firms to master the complexity. This puts them in a privileged position, and creates economies of scale where the more of the market they master and control, the more information they have that others don’t, and the more they’re able to master and control. They push SROs to create ever more complexity to maintain their incumbent position, and are able to extract rents as a result. The SROs listen to these firms because they are responsible for more and more trading activity, which means they are the SROs’ best customers. Instead of SROs following their duties under the 1934 Act, they act in the interests of their shareholders to maximize revenue. This cycle continues unabated.</li>\n</ol>\n\n<p><strong>Third SRO Problem: Unnecessary complexity makes markets opaque, fragile and leads to a feedback loop of rent seeking and concentration of power. The for-profit motive overrides the SRO’s duty to create fair and efficient markets.</strong></p>\n\n<p>I mentioned before that SROs have legal immunity. This means many things, but primarily it means that the brokers who are members of the exchange don’t have legal recourse when something goes wrong. It is for this reason that retail brokers who don’t accept PFOF still route to the off-exchange duopoly of Citadel and Virtu, because they want someone’s neck to wring when something goes wrong. The legal immunity that exchanges enjoy is one of the reasons that we have dramatically segmented markets.</p>\n\n<p><strong>Fourth SRO Problem: Legal immunity for for-profit, publicly traded companies leads to perverse incentives and terrible outcomes.</strong></p>\n\n<p>So what’s the result? A huge amount of unnecessary complexity, enforcement becoming a cost of doing business, and ultimately fragile markets with low participant diversity delivering poor outcomes for investors as the for-profit SROs focus on creating churn and volume to increase earnings per share.</p>\n\n<p>More complexity means more fragmentation. More fragmentation means more complex order types. More fragmentation and complex order types means more unnecessary trading and churn. More unnecessary trading and churn means more earnings for publicly traded SROs. Rinse and repeat. It ultimately means that we end up with so much complexity that it’s impossible to keep track of. Take a look at the results of this 2018 RBC study on exchange fee structure (the picture is awesome, but I can&#39;t seem to add pictures to a post in this sub-reddit):</p>\n\n<ul>\n<li>Exchanges have at least 1,023 pricing “paths”</li>\n<li>3,762  separate pricing variables across the exchanges – “strongly suggest  that exchange prices are tailored and offered on a bespoke basis”</li>\n<li>Extreme complexity, customized for specific firms</li>\n<li>Extreme routing distortion (TD’s “virtually all” limit orders routed to EDGX)</li>\n<li>Fee-agnostic brokers had 7x better VWAP performance (Clearpool)</li>\n</ul>\n\n<p>If someone can explain how this fee structure “promotes just and equitable principles of trade,” “protects investors and the public interest,” and is “not designed to permit unfair discrimination between customers, issuers, brokers or dealers” I’m all ears. Go ahead, give it a try!</p>\n\n<p>Now, let’s take this convoluted, inefficient structure, add in a regulatory revolving door, corrupt campaign contribution system and corrupt politicians, mix it all together, and out comes the US crony capitalist system.</p>\n\n<p><strong>GET OFF THE SOAP BOX DAVE, WHAT DO WE DO?</strong></p>\n\n<p>So glad you asked. I’ve been asked a bunch of times what I think should change about US market structure, what I would do if I was SEC Chair (imagine that), etc. My answer is nearly always the same – reduce complexity. When I say reduce complexity, this post is what I’m talking about:</p>\n\n<p>· End the self-regulatory structure.</p>\n\n<p>· Build a proper regulator (complete overhaul of the SEC) with experts who are compensated appropriately.</p>\n\n<p>· Prioritize handcuffs, not wrist slaps and fines. Make the industry fearful of regulatory and enforcement consequences.</p>\n\n<p>· Reduce the number of exchanges, end public subsidy through SIP fees, get rid of every copycat exchange.</p>\n\n<p>· Create a burden for off-exchange trading to compensate for the damage that segmenting and diverting flow does to the price discovery mechanism.</p>\n\n<p>· Simplify, Simplify, SIMPLIFY!</p>\n\n<p><strong>Tldr;</strong> Wall St cannot regulate itself. It leads to unnecessary complexity, and lax enforcement and fines instead of perp walks. It’s time to overhaul the regulatory structure, send people to jail, and simplify market structure dramatically.</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "8acd2324-65e6-11e5-a263-122ab0778f8b",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#4f8ef7",
  "id": "qww9zu",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "dlauer",
  "discussion_type": null,
  "num_comments": 2,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/qww9zu/sros_complexity_and_market_structure/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/qww9zu/sros_complexity_and_market_structure/",
  "subreddit_subscribers": 3280807,
  "created_utc": 1637287707,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1637260376,
  "the_new_excerpt": "Last week I actually lost sleep due to frustration and anger at the current\nself-regulatory structure in markets. While this is kind of silly and a bit\nabsurd (though it did happen!), I think it’s worth examining and explaining how\nthe incentives for a self-regulatory, for-profit company lead to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先週、私は現在の市場の自主規制構造に対する不満と怒りで、実際に眠れなくなりました。\n市場の自主規制構造に対する不満と怒りで、先週は実際に眠れませんでした。これはちょっと馬鹿げていて、ちょっと不条理なことですが\nしかし、自主規制のインセンティブがどのようなものかを検証し、説明する価値はあると思います。\n営利を目的とした自主規制企業のインセンティブが、どのように...",
      "title": "SRO、複雑さと市場構造"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "上周，由于对目前的市场自律结构感到沮丧和愤怒，我实际上失眠了。\n市场的自我监管结构而感到沮丧和愤怒。虽然这有点傻，有点\n虽然这有点傻，有点荒唐（尽管它确实发生了！），但我认为这是值得研究和解释的。\n一个自我监管的营利性公司的激励机制如何导致...",
      "title": "SROs、复杂性和市场结构"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "上週，由於對目前的市場自律結構感到沮喪和憤怒，我實際上失眠了。\n市場的自我監管結構而感到沮喪和憤怒。雖然這有點傻，有點\n雖然這有點傻，有點荒唐（儘管它確實發生了！），但我認爲這是值得研究和解釋的。\n一個自我監管的營利性公司的激勵機制如何導致...",
      "title": "SROs、複雜性和市場結構"
    }
  ],
  "source_updated_at": 1637919676550
}