{
  "author": "waterinabottle",
  "the_new_excerpt": "Most other vaccine types, especially the inactivated virus/bacteria or subunit\nvaccines require the co-administration of an adjuvant to elicit a good immune\nresponse leading to immunity. Vector vaccines, to my knowledge, also contain an\n\"adjuvant\" in the form of the actual virus used to deliver the…",
  "original_created_utc": 1624034051,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "他のほとんどの種類のワクチン、特に不活化されたウイルス／細菌やサブユニット\nワクチンは、良好な免疫反応を引き出すために、アジュバントを併用する必要があります。\n免疫につながる良好な免疫反応を誘発するために、アジュバントを併用する必要があります。私の知る限り、ベクターワクチンもまた、アジュバントを含んでいます。\n\"私の知る限りでは、ベクターワクチンにも「アジュバント」が含まれていて、それはワクチンを投与するために使用される実際のウイルスの形をしています。",
      "title": "なぜmRNAワクチンはアジュバントを必要としないのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大多数其他类型的疫苗，特别是灭活的病毒/细菌或亚单位疫苗，都需要同时使用佐剂才能引起良好的免疫。\n疫苗需要与佐剂共同使用，以引起良好的免疫反应。\n导致免疫力的反应。据我所知，病媒疫苗也含有一种\n\"佐剂\"，其形式是用于传递疫苗的实际病毒。",
      "title": "为什么mRNA疫苗不需要佐剂？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大多數其他類型的疫苗，特別是滅活的病毒/細菌或亞單位疫苗，都需要同時使用佐劑才能引起良好的免疫。\n疫苗需要與佐劑共同使用，以引起良好的免疫反應。\n導致免疫力的反應。據我所知，病媒疫苗也含有一種\n\"佐劑\"，其形式是用於傳遞疫苗的實際病毒。",
      "title": "爲什麼mRNA疫苗不需要佐劑？"
    }
  ],
  "title": "Why don't mRNA vaccines require an adjuvant?",
  "created_utc": 1624080436,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Most other vaccine types, especially the inactivated virus/bacteria or subunit vaccines require the co-administration of an adjuvant to elicit a good immune response leading to immunity. Vector vaccines, to my knowledge, also contain an &quot;adjuvant&quot; in the form of the actual virus used to deliver the DNA to cells. mRNA vaccines do not seem to require an adjuvant, and in fact the most successful mRNA vaccines have modifications on the RNA portion to <em>reduce</em> immunogenicity. Why is this? Do the RNA and lipids used in the vaccine have properties that somehow allow the immune system to decisively react to them, or their translation products, as &quot;foreign&quot; antigens?</p>\n\n<p>ETA: I understand how general immunology and innate immunity works (I have been an MSc. structural biologist for ~10 years) with regards to MHC and TLR pathways, but I don&#39;t understand the molecular mechanism of <em>why</em> our immune systems seem to respond so effectively to &#39;intercellular&#39; pathogens (eg. extracellularly expressed antigen subunits) as opposed to &#39;intracellular&#39; antigens like protein/ protein subunits from vaccines without an adjuvant (although we do not seem to have this &#39;problem&#39; during natural bacterial or fungal infections, presumably due to the abundance of immunogenic molecules present in bacterial cell membrane lipids etc)</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/askscience/comments/o2tj79/why_dont_mrna_vaccines_require_an_adjuvant/",
  "subreddit": "askscience",
  "id": "o2tj79",
  "is_self": true,
  "media": null,
  "is_video": false
}