{
  "author": "MaterialCarrot",
  "the_new_excerpt": "Just curious if this was seen as a cataclysmic event, or perhaps by the end of\nthe Revolutionary War more of good riddance? Of course we know today that the\nloss of the colonies was not a fatal blow to the British Empire, its zenith was\narguably 100 years into the future, and trade between the UK…",
  "original_created_utc": 1621347809,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これが激変と見られていたのかどうか、あるいは、ひょっとしたら、この時期の終わりまでに、このような出来事があったのかどうか、興味があります。\nそれとも、独立戦争が終わる頃には、「厄介払いができた」と考えられていたのだろうか？もちろん、今日では、植民地を失ったことが\n植民地を失ったことは大英帝国にとって致命的な打撃ではなく、大英帝国の頂点は間違いなく100年後だった。\nその頂点は間違いなく100年後の未来であり、イギリスとの貿易は...",
      "title": "13コロニーを失い、アメリカを認めたことに対するイギリスの世論の反応は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是好奇，这是否被看作是一个灾难性的事件，或者说在革命战争结束时，更多的是一种摆脱。\n革命战争结束时，更多的人认为是好的结局？当然，我们今天知道\n殖民地的丧失对大英帝国来说并不是致命的打击，它的顶峰可以说是在100年后。\n可以说是100年后的事了，而英国与其他国家的贸易...",
      "title": "英国公众对失去13个殖民地和承认美国的反应是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是好奇，這是否被看作是一個災難性的事件，或者說在革命戰爭結束時，更多的是一種擺脫。\n革命戰爭結束時，更多的人認爲是好的結局？當然，我們今天知道\n殖民地的喪失對大英帝國來說並不是致命的打擊，它的頂峯可以說是在100年後。\n可以說是100年後的事了，而英國與其他國家的貿易...",
      "title": "英國公衆對失去13個殖民地和承認美國的反應是什麼？"
    }
  ],
  "title": "What was the public reaction in the UK to losing the 13 colonies and acknowledging the US?",
  "created_utc": 1621388729,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just curious if this was seen as a cataclysmic event, or perhaps by the end of the Revolutionary War more of good riddance? Of course we know today that the loss of the colonies was not a fatal blow to the British Empire, its zenith was arguably 100 years into the future, and trade between the UK and US boomed not long after the Treaty of Paris. But in the moment, how did the British public react in general?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/nfbzxe/what_was_the_public_reaction_in_the_uk_to_losing/",
  "subreddit": "AskHistorians",
  "id": "nfbzxe",
  "is_self": true,
  "media": null,
  "is_video": false
}