{
  "author": "mrhuggables",
  "original_created_utc": 1634692886,
  "title": "Why did grappling martial arts seem to predominate in West, South, and Central Asia; while striking martial arts seem to predominate in East and Southeast Asia?",
  "created_utc": 1634705586,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello all,</p>\n\n<p>I noticed that wrestling (of all variations) is the &quot;primary&quot; traditional martial art practiced in the Turco-Persian sphere of influence in Western and Central Asia as well as South Asia with literally countless styles of &quot;native&quot; wrestling in addition to modern greco-roman or freestyle; however there appear to be no &quot;native&quot; striking martial arts with your only choices being European-style boxing or some form of a striking martial art from East Asia. </p>\n\n<p>It also appears to me that the opposite is true for East Asia, where there does not seem to be the same native grappling tradition with the focus instead being on striking martial arts like Muay Thai, Sanda, Lethwei, Tae Kwon Do, etc.</p>\n\n<p>Is there any known historical cause or famous text that may explain this &quot;schism&quot; this that we know of? Or is it down to &quot;that&#39;s just how it is&quot;? </p>\n\n<p>Thanks in advance !</p>\n</div><!-- SC_ON -->",
  "score": 139,
  "permalink": "/r/AskHistorians/comments/qbprvl/why_did_grappling_martial_arts_seem_to/",
  "subreddit": "AskHistorians",
  "id": "qbprvl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello all,\n\nI noticed that wrestling (of all variations) is the \"primary\" traditional\nmartial art practiced in the Turco-Persian sphere of influence in Western and\nCentral Asia as well as South Asia with literally countless styles of \"native\"\nwrestling in addition to modern greco-roman or freestyle;…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\nレスリング（あらゆるバリエーション）は、トルコ・ペルシャの勢力圏で行われている「主要な」伝統的武術であることに気づきました。\n西アジア、中央アジア、南アジアのトルコ・ペルシャの勢力圏で行われている「主要な」伝統武術です。\nレスリングは、西アジア、中央アジア、南アジアのトルコ・ペルシャ勢力圏で行われていた「主要な」伝統武術であり\n現代のグレコローマンやフリースタイルに加えて、文字通り無数の「ネイティブ」なレスリングがあります。",
      "title": "なぜ、西・南・中央アジアでは格闘技が主流で、東・東南アジアでは打撃系の格闘技が主流だったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n我注意到，摔跤（各种变化）是土耳其-波斯影响范围内的 \"主要 \"传统武术。\n我注意到，在西方和中亚的土耳其-波斯势力范围内，摔跤（各种变化）是 \"主要 \"的传统武术。\n在西亚和中亚以及南亚，除了现代的希腊-罗马摔跤外，还有数不清的 \"本土 \"风格。\n除了现代希腊罗马式或自由式摔跤之外，还有无数种 \"本土 \"摔跤；...",
      "title": "为什么擒拿术似乎在西亚、南亚和中亚占主导地位；而击打术似乎在东亚和东南亚占主导地位？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n我注意到，摔跤（各種變化）是土耳其-波斯影響範圍內的 \"主要 \"傳統武術。\n我注意到，在西方和中亞的土耳其-波斯勢力範圍內，摔跤（各種變化）是 \"主要 \"的傳統武術。\n在西亞和中亞以及南亞，除了現代的希臘-羅馬摔跤外，還有數不清的 \"本土 \"風格。\n除了現代希臘羅馬式或自由式摔跤之外，還有無數種 \"本土 \"摔跤；...",
      "title": "爲什麼擒拿術似乎在西亞、南亞和中亞占主導地位；而擊打術似乎在東亞和東南亞占主導地位？"
    }
  ]
}