{
  "author": "TrickBeginning2871",
  "the_new_excerpt": "Technical Analysis on BB for anyone interested. Total float 565m shares. Shares\nheld by institutions (not actively traded=roughly 50%, insiders own 1.5%)..\n48.5% of 565m shares is 275m shares that are frequently traded. I updated\noriginal post as original was made rather quickly and there's been…",
  "original_created_utc": 1622925101,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "興味のある方はBBのテクニカル分析をどうぞ。総浮動株数は565万株。株式数\n機関投資家が保有する株式（活発に取引されていない＝約50％、インサイダーが1.5％）。\n565m株の48.5%は、頻繁に取引されている275m株です。元の記事を更新しました。\n元の記事はかなり早く作成されたため、更新しました。",
      "title": "ブラックベリーのテクニカル分析"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对有兴趣的人来说，BB上的技术分析。总流通量为5.65亿股。股票\n机构持有的股份（不积极交易=大约50%，内部人士拥有1.5%）。\n5.65亿股中的48.5%是经常交易的2.75亿股。我更新了\n我更新了原来的帖子，因为原来的帖子做得相当快，而且已经有...",
      "title": "黑莓技术分析"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對有興趣的人來說，BB上的技術分析。總流通量爲5.65億股。股票\n機構持有的股份（不積極交易=大約50%，內部人士擁有1.5%）。\n5.65億股中的48.5%是經常交易的2.75億股。我更新了\n我更新了原來的帖子，因爲原來的帖子做得相當快，而且已經有...",
      "title": "黑莓技術分析"
    }
  ],
  "title": "BlackBerry Technical Analysis",
  "created_utc": 1622966946,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Technical Analysis on BB for anyone interested. Total float 565m shares. Shares held by institutions (not actively traded=<strong>roughly 50%</strong>, insiders own <strong>1.5%</strong>).. 48.5% of 565m shares is <strong>275m</strong> shares that are frequently traded. I updated original post as original was made rather quickly and there&#39;s been some questions. Also, do your own DD, these are just my thoughts and not advice.</p>\n\n<p>Intro:</p>\n\n<p><strong>*** MY CHARTS KEEP GETTING DELETED..***LMK when this occurs plz</strong></p>\n\n<p>June 2nd saw a nice jump in SP with a close outside of the Bollinger Bands on <strong>346m</strong> share volume.  Mean reversion is typically expected following strong closes that finish outside or near the edge of the bands.</p>\n\n<p>June 3 + 4-There were <strong>700m</strong> shares traded on US exchange alone. <strong>Important point:</strong> June 3rd and 4th were sell offs with attempts to revert to the mean...Likely a fair bit of profit taking as well but shares were being dumped all day. The mean currently sits at 9.78USD (middle red line in Bollinger Bands). They didn&#39;t even come close.. the stock still sits outside of the bands **extremely bullish signal. This is a massive game of hot potato right now as we&#39;ve churned through the entire float twice since June 2 (4x if you disregard shares that aren&#39;t actively traded). That much volume occurring outside of the bands relative to the float is unbelievably bullish IMO.</p>\n\n<p><strong>Technical analysis set up:</strong></p>\n\n<p>Image 1 (below): Bollinger bands revert to mean but failed</p>\n\n<p><a href=\"https://preview.redd.it/5vtm741j5k371.png?width=1970&amp;format=png&amp;auto=webp&amp;s=5e6591af1d86e5f80f9ab8590bf4a861b91e284d\">https://preview.redd.it/5vtm741j5k371.png?width=1970&amp;format=png&amp;auto=webp&amp;s=5e6591af1d86e5f80f9ab8590bf4a861b91e284d</a></p>\n\n<p>***SELL OFF HAS LIKELY FAILED***</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Image 2 (below): shows an symmetrical triangle or wedge with declining volume as we move towards apex AKA volatility contraction. This occurs prior to volatility expansion (prior to a large move).</p>\n\n<p><a href=\"https://preview.redd.it/rrbs3ddl5k371.png?width=1478&amp;format=png&amp;auto=webp&amp;s=9fc08d5e46b288b308fb9c3d71bff5095fa5e826\">https://preview.redd.it/rrbs3ddl5k371.png?width=1478&amp;format=png&amp;auto=webp&amp;s=9fc08d5e46b288b308fb9c3d71bff5095fa5e826</a></p>\n\n<p>Image 3 (below): image shows strong buying pressure @ 14 dollars as evidenced by multiple attempts to drive the price down that immediately bounced off that area. Last 1.5 days has been an attempt to slowly bleed it down to just above the buying pressure in hopes you&#39;ll sell them back your shares and help cover. Notice the Friday close stopped immediately above buying pressure.</p>\n\n<p><a href=\"https://preview.redd.it/tcqeuojw5k371.png?width=1962&amp;format=png&amp;auto=webp&amp;s=29b44a910817556862abb1479becc8abd59d80b9\">https://preview.redd.it/tcqeuojw5k371.png?width=1962&amp;format=png&amp;auto=webp&amp;s=29b44a910817556862abb1479becc8abd59d80b9</a></p>\n\n<p><strong>Price target--&gt;</strong> IMO could easily end up within 25-40 dollar range or higher next week based on where shorts are reapplied. Shorts were reapplied around 25 to 30 USD in January so that&#39;s probably the next stop.</p>\n\n<p><strong>Things to consider:</strong></p>\n\n<ol>\n<li>Potential exists that this scenario doesn&#39;t play out on Monday and we head lower. More selling= more synthetic shares. More fake shares= more of a problem in the future for whoever is short. Just means the larger this squeeze is going to become overtime. So good for whoever&#39;s accumulating at the right price and holding on. Remember that there is great buying pressure below us!</li>\n<li>It&#39;s uncommon for trends to reverse without some sort of ranging period where shares are either accumulated or distributed. Remember, we are in an uptrend in the intermediate and long term. We have not reached distribution phase yet. Short term there may be some more pain if we continue lower but this will result in an even bigger squeeze in the long term as more shares must be fabricated so dumping can continue.</li>\n<li>At this point, BB is a better set up in comparison to AMC. AMC has done multiple stock sales to help out those that are short. Blackberry has yet to issue any shares. Also, if we do continue downward, BB is more favorable as it&#39;s a popular stock that would be purchased at this price by retail investors who are planning to hold long term. Based on warnings given by AMC management, their stock is extremely overpriced.14 USD and below begins to have nice support!!</li>\n<li>If BB management has any idea what they are doing, they&#39;ll act on this with some big news:).</li>\n<li>Proof I am holding for those questioning the validity of the account.</li>\n</ol>\n\n<p><a href=\"https://preview.redd.it/qa4kj8ytnj371.png?width=827&amp;format=png&amp;auto=webp&amp;s=76f376d3bd03406b773bcf5f82409bab7c59582c\">https://preview.redd.it/qa4kj8ytnj371.png?width=827&amp;format=png&amp;auto=webp&amp;s=76f376d3bd03406b773bcf5f82409bab7c59582c</a></p>\n\n<p><strong>MONDAY GONNA BE ZOPPITY!!!!LFG!!!</strong></p>\n</div><!-- SC_ON -->",
  "score": 1391,
  "permalink": "/r/wallstreetbets/comments/nt4o6b/blackberry_technical_analysis/",
  "subreddit": "wallstreetbets",
  "id": "nt4o6b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404892696
}