{
  "author": "piaPika",
  "original_created_utc": 1637978046,
  "title": "Why are we ok with euthanasia when it comes to sparing our pets from pain and disease, but we don't extend the same kindness to fellow human beings?",
  "created_utc": 1637996850,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As the title says. I was reading in <a href=\"/r/askvets\">r/askvets</a> about someone who has a very old cat that has a clearly very poor quality of life, and they were asking if it&#39;s ok to talk to the vet about putting the pet down. This got me thinking, why don&#39;t we extend the same courtesy to people? Why is euthanasing incurrably sick people not a thing?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/r32eby/why_are_we_ok_with_euthanasia_when_it_comes_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "r32eby",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As the title says. I was reading in r/askvets [/r/askvets] about someone who has\na very old cat that has a clearly very poor quality of life, and they were\nasking if it's ok to talk to the vet about putting the pet down. This got me\nthinking, why don't we extend the same courtesy to people? Why is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルの通りです。r/askvets [/r/askvets]で、ある人の話を読んでいました。\n明らかに生活の質が落ちている老猫を飼っている人の話を読んでいました。\n獣医さんにペットの処分を相談してもいいかどうかを聞いていました。これを見て私は\n同じ礼儀を人間にも適用してはどうかと考えました。なぜ...",
      "title": "ペットの痛みや病気を避けるための安楽死はOKなのに、なぜ人間には同じ優しさがないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说。我在r/askvets [/r/askvets]上读到有人有一只非常老的猫，它的生活质量明显很差。\n一只非常老的猫，它的生活质量明显很差，他们在问\n他们问是否可以和兽医讨论把宠物放下的问题。这让我想到\n这让我想到，为什么我们不对人们给予同样的礼遇？为什么...",
      "title": "为什么当涉及到让我们的宠物免于痛苦和疾病时，我们可以接受安乐死，但我们却不对人类同胞给予同样的善意？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說。我在r/askvets [/r/askvets]上讀到有人有一隻非常老的貓，它的生活質量明顯很差。\n一隻非常老的貓，它的生活質量明顯很差，他們在問\n他們問是否可以和獸醫討論把寵物放下的問題。這讓我想到\n這讓我想到，爲什麼我們不對人們給予同樣的禮遇？爲什麼...",
      "title": "爲什麼當涉及到讓我們的寵物免於痛苦和疾病時，我們可以接受安樂死，但我們卻不對人類同胞給予同樣的善意？"
    }
  ]
}