{
  "author": "IllusionaryHaze",
  "original_created_utc": 1630701990,
  "title": "Unpopular opinion: DOT or SOL are much better than ADA and they're going to overtake it eventually",
  "created_utc": 1630719185,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Someone has to explain to me why everyone is so bullish on ADA. So they&#39;re bringing out smart contracts. Alright? DOT and SOL already have that. So what is exactly is ADA bringing to the table that makes it the number 3 spot? Speculation?   </p>\n\n<p>Let&#39;s be real here. Even with smart contracts, it will take YEARS for their environment to fully develop, and their dApps to be fully functional.  </p>\n\n<p>Nevermind the fact that it&#39;s market cap is already huge, so the chance to even double in price is low.   </p>\n\n<p>My 2 cents, not trying to hate on this. Just trying to spark a conversation</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/CryptoCurrency/comments/phdio2/unpopular_opinion_dot_or_sol_are_much_better_than/",
  "subreddit": "CryptoCurrency",
  "id": "phdio2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Someone has to explain to me why everyone is so bullish on ADA. So they're\nbringing out smart contracts. Alright? DOT and SOL already have that. So what is\nexactly is ADA bringing to the table that makes it the number 3 spot?\nSpeculation?\n\nLet's be real here. Even with smart contracts, it will take…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜ皆がADAに強気なのか、誰か説明してください。そこで彼らは\nスマートコントラクトを出してきた。いいですか？DOTとSOLはすでにそれを持っている。では、何が\nADAは何を持って3位になったのでしょうか？\n憶測ですか？\n\n現実的に考えてみよう。スマートコントラクトがあっても、それは...",
      "title": "不評な意見 DOTやSOLはADAよりはるかに優れており、いずれADAを追い越すだろう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有人必须向我解释为什么每个人都如此看好ADA。所以他们\n带来了智能合约。好吗？DOT和SOL已经有了。那么，什么是\nADA到底带来了什么，使其成为第三名？\n猜测？\n\n让我们在这里说实话。即使有了智能合约，它也需要...",
      "title": "不受欢迎的意见。DOT或SOL比ADA好得多，它们最终会超越ADA。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有人必須向我解釋爲什麼每個人都如此看好ADA。所以他們\n帶來了智能合約。好嗎？DOT和SOL已經有了。那麼，什麼是\nADA到底帶來了什麼，使其成爲第三名？\n猜測？\n\n讓我們在這裏說實話。即使有了智能合約，它也需要...",
      "title": "不受歡迎的意見。DOT或SOL比ADA好得多，它們最終會超越ADA。"
    }
  ]
}