{
  "author": "undevy",
  "original_created_utc": 1635166941,
  "title": "Crypto won’t make you happy. It never could. Use your profit to care for yourself. Use crypto profits to get a better life for you and the people around you.",
  "created_utc": 1635186652,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p><strong>TL;DR</strong>: It’s really fun to make money. But, you know what’s even more fun? Using crypto profits to take care of your mental health and well-being. Doing this will make you a better person for yourself, your family, and everyone you meet.</p>\n</blockquote>\n\n<p>Since so many all-time highs have been reached lately, and a lot of our portfolios are in green, it is important to recognize that we are in a bull market at this point. <strong>It won&#39;t last forever</strong>, and it may not even last till the end of the year, so it is an interesting exercise to think about where all this is going.</p>\n\n<p>Putting this post together is about how to step back from crypto psychologically. There isn&#39;t the best moment to do so, but <strong>exiting with profits could be the most important step of your life</strong>. Speaking from my own experience, by no means do I intend to give financial advice.</p>\n\n<p>If you&#39;ve been in this sub for a long time now, you can feel the greed and euphoria of every single market rise. The topic of taking your profits and DCA out has been discussed a lot recently. However, <strong>we don&#39;t tackle enough the subject of what we should do next</strong> when the profits aren&#39;t on paper but in our bank accounts.</p>\n\n<p>Because the crypto market can go up and down in an instant, when you&#39;re in the green, it is important to appreciate that you reach your goals on time. We all know the HODL mantra, and having a lot of crypto in your portfolio is still a smart move, but you should also take advantage of bull markets to do good in the world.</p>\n\n<p><strong>Are you really going to look at the charts every day until you die?</strong> Cryptocurrencies should not become a source of dopamine for you. The world is a beautiful place, and you no doubt have a place in it. Remember that crypto is not our ultimate goal, and if we haven&#39;t learned by now, crypto won&#39;t make us happy. <strong>If you look at your life after you&#39;ve made a lot of money, it&#39;s easy to see that you&#39;re still the same person.</strong> If you&#39;re happy, you&#39;re happy; if you&#39;re unhappy, you&#39;re unhappy. If you&#39;re only in it for the money, likely, you won&#39;t find any meaning or fulfillment.</p>\n\n<p>Think about what you want in life, and do not focus on &quot;getting rich fast&quot;, <strong>focus on your deepest desires</strong>. Use your profit as a tool to improve your life, by traveling, buying a new house, starting a business, paying off debt, or just enjoying life. The list of things that will bring genuine happiness is endless. Having never been happy in my life, I always assumed the reason was lack of money, but I realized that good profits could solve my money problems, but they definitely don&#39;t solve all my problems.</p>\n\n<p>To be genuinely happy, I had to take responsibility for my mental health. I used some of my profits to focus on it and started feeling exponentially better. To be genuinely happy used to seem impossible to me, but boy, I have never been so wrong in my life! I am now happier than ever, and it feels incredible.</p>\n\n<p><strong>Self-improvement is the most effective way to make the world a better place.</strong> You don&#39;t have to be a narcissistic asshole, all you need to do is practice self-care and care for the people around you. You should never forget that the profits from selling parts of your crypto portfolio may help you live the life you really want.</p>\n</div><!-- SC_ON -->",
  "score": 195,
  "permalink": "/r/CryptoCurrency/comments/qfg8sr/crypto_wont_make_you_happy_it_never_could_use/",
  "subreddit": "CryptoCurrency",
  "id": "qfg8sr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "> TL;DR: It’s really fun to make money. But, you know what’s even more fun?\n> Using crypto profits to take care of your mental health and well-being. Doing\n> this will make you a better person for yourself, your family, and everyone you\n> meet.\n\nSince so many all-time highs have been reached lately,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "> TL;DR: お金を稼ぐのは本当に楽しいことです。でも、もっと楽しいことを知っていますか？\n> 暗号の利益を使って、精神的な健康と幸福のケアをすること。することです。\n> これは、あなた自身、あなたの家族、そしてあなたが出会うすべての人のために、あなたをより良い人にするでしょう。\n> るようになります。\n\n最近は史上最高値を更新することが多く、...",
      "title": "暗号では幸せになれない。決してできないことです。自分の利益を自分のために使いましょう。暗号の利益を使って、あなたとあなたの周りの人々のために、より良い生活を手に入れてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "> TL;DR: 赚钱真的很有趣。但是，你知道什么更有趣吗？\n> 用加密货币的利润来照顾你的心理健康和幸福。这样做\n> 这将使你成为一个更好的人，为你自己、你的家人和你遇到的每个人服务。\n>遇见的人。\n\n由于最近达到了这么多的历史高点，...",
      "title": "Crypto不会让你快乐。它永远不会。用你的利润来关心你自己。用加密货币的利润来为你和你周围的人获得更好的生活。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> TL;DR: 賺錢真的很有趣。但是，你知道什麼更有趣嗎？\n> 用加密貨幣的利潤來照顧你的心理健康和幸福。這樣做\n> 這將使你成爲一個更好的人，爲你自己、你的家人和你遇到的每個人服務。\n>遇見的人。\n\n由於最近達到了這麼多的歷史高點，...",
      "title": "Crypto不會讓你快樂。它永遠不會。用你的利潤來關心你自己。用加密貨幣的利潤來爲你和你周圍的人獲得更好的生活。"
    }
  ]
}