{
  "author": "undevy",
  "original_created_utc": 1633957490,
  "title": "While understanding the underlying blockchain technology is anything but sexy, building a \"grandma-friendly\" cryptocurrency app is crucial for the adoption",
  "created_utc": 1633970237,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s quite a popular belief that user experience and a lot of technical terminologies are in a lot of cases the reason that is stopping crypto from further adoption. For example, take a look at the DeFi sector, which you might want to consider only if you have a decent amount of money, technical know-how about the blockchain, and the time to keep up with things.</p>\n\n<p>If you want to convince the average person that they should use cryptocurrency, you’re going to have to do more than just tell people it’s better than credit cards or cash. Sending fiat money via an app can be as easy as ordering a pizza, but sending tokens is a punch in the guts. Gas fees, selecting the network, waiting for hours with the thought that you would send a considerable amount of money into oblivion is too much to bear.</p>\n\n<p>Imagine a wallet that just works. Instant transactions, no gas fees, no network problems. I’ve discovered that there are a few apps like this (i.e. Natrium) that are built on top of the Nano blockchain, but they are limited by their reliance on that blockchain, so there are no Doge-For-Apes and no smart contracts, neither are there DApps. Keep your Google tab open in front of your eyes if you want to do something more than pay for a coffee (Chivo App, I&#39;m looking at you, buddy).</p>\n\n<p>Even though I am personally fond of centralized wallets from Coinbase, Crypto.com, etc., they are not available in my country (and looking where everything is headed, I&#39;m sure they will never be). The politics game is always pressuring centralized solutions, which is why players like me are always looking into DeFi, but the user experience there leaves much to be desired. Read this hilarious <a href=\"https://twitter.com/larry0x/status/1414847115801632768\">thread</a> about the user experience of Solana blockchain and try not to feel the pain.</p>\n\n<p>I&#39;ve tried many crypto apps, but I&#39;ve yet to find one that&#39;s an all-in-one solution, a crypto-app that has all the required features, can work with a variety of blockchains, and is simple enough to be used by the average Joe. Even if my grandma was interested in crypto, I could not show her an app that would make her comfortable enough to use it because there is no app like this.</p>\n\n<p>Until crypto’s user base consists of tech-savvy grandmothers and grandfathers, it will remain mainly an enigma to the majority of the population. For example, look at how &quot;quickly&quot; the internet became ingrained in our life, it only took 30 years to become a part of every generation. Having so little education and developers who focus more on tech than user experience, a widespread of crypto in its present form would be achievable only when we are these tech-savvy grandmothers and grandfathers.</p>\n</div><!-- SC_ON -->",
  "score": 199,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/UVzjCIHBY-BMrHAUVcJ_zzgoWr0BQWBMcKal0qJyx30.jpg?auto=webp&s=839bf1493d8a0174ed7b9ec287e682526fddfbd0",
          "width": 140,
          "height": 127
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/UVzjCIHBY-BMrHAUVcJ_zzgoWr0BQWBMcKal0qJyx30.jpg?width=108&crop=smart&auto=webp&s=059873ff397b0edc25846121c494f738ea64e270",
            "width": 108,
            "height": 97
          }
        ],
        "variants": {},
        "id": "VwAoX6nPCLVI9m6bt0dO4fDudd1X2cDCDZwte1Ui85U"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/q5vei9/while_understanding_the_underlying_blockchain/",
  "subreddit": "CryptoCurrency",
  "id": "q5vei9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's quite a popular belief that user experience and a lot of technical\nterminologies are in a lot of cases the reason that is stopping crypto from\nfurther adoption. For example, take a look at the DeFi sector, which you might\nwant to consider only if you have a decent amount of money, technical…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "一般的には、ユーザーエクスペリエンスと多くの技術的な\n多くの場合、ユーザーエクスペリエンスと多くの技術的な用語が、暗号の普及を妨げている原因であると考えられています。\n普及の妨げになっています。例えば、DeFiの分野を見てみましょう。\n例えば、DeFi部門を見てみましょう。そこそこの資金と技術力がある場合にのみ、検討してみてください。",
      "title": "根本的なブロックチェーン技術を理解することは、決してセクシーなことではありませんが、「おばあちゃんに優しい」暗号通貨アプリを構築することは、普及のために非常に重要です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "人们普遍认为，用户体验和大量的技术术语在很多情况下都是影响用户体验的原因。\n在很多情况下，用户体验和许多技术术语是阻止加密货币被进一步采用的原因。\n进一步采用的原因。例如，看一下DeFi部门，你可能会想\n只有当你有相当数量的资金时，才会考虑这个行业。",
      "title": "虽然了解底层区块链技术并不性感，但建立一个 \"对祖母友好 \"的加密货币应用程序对采用该技术至关重要。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們普遍認爲，用戶體驗和大量的技術術語在很多情況下都是影響用戶體驗的原因。\n在很多情況下，用戶體驗和許多技術術語是阻止加密貨幣被進一步採用的原因。\n進一步採用的原因。例如，看一下DeFi部門，你可能會想\n只有當你有相當數量的資金時，纔會考慮這個行業。",
      "title": "雖然瞭解底層區塊鏈技術並不性感，但建立一個 \"對祖母友好 \"的加密貨幣應用程序對採用該技術至關重要。"
    }
  ]
}