{
  "author": "leMartinx",
  "original_created_utc": 1638361314,
  "title": "In 2013 Wired magazine called Bitcoin daydreaming, erased their wallet keys, and are now unable to access 13.34 BTC.",
  "created_utc": 1638394026,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is just to show how we have come a long way from 2013. Or have we?&lt;/p&gt;\n\n&lt;p&gt;Not all of those who were &amp;quot;early&amp;quot; knew what the future would bring and there has always been a huge amount of uncertainty around. I wouldn&amp;#39;t even dare to amount the people who have lost their keys during this time. It seems that even when you are uncertain of things you should never burn all of the bridges.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But in the end, the answer was obvious. The world&amp;#39;s most popular digital currency really is nothing more than an abstraction. So we&amp;#39;re destroying the private key used by our Bitcon wallet. That leaves our growing pile of Bitcoin lucre locked away in a digital vault for all eternity – or at least until someone cracks the SHA-256 encryption that secures it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Source: &lt;a href=\"https://www.wired.com/2013/05/butterfly-live/\"&gt;Link&lt;/a&gt;&lt;br/&gt;\nWallet:  &lt;a href=\"https://www.blockchain.com/btc/address/1BYsmmrrfTQ1qm7KcrSLxnX7SaKQREPYFP\"&gt;1BYsmmrrfTQ1qm7KcrSLxnX7SaKQREPYFP&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5381,
  "permalink": "/r/CryptoCurrency/comments/r6djn0/in_2013_wired_magazine_called_bitcoin_daydreaming/",
  "subreddit": "CryptoCurrency",
  "id": "r6djn0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is just to show how we have come a long way from 2013. Or have we?\n\nNot all of those who were \"early\" knew what the future would bring and there has\nalways been a huge amount of uncertainty around. I wouldn't even dare to amount\nthe people who have lost their keys during this time. It seems…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、2013年から大きく前進したことを示すものです。それとも、そうでしょうか？\n\n早い者勝ちの時代には、未来がどうなるかを知っている人ばかりではありませんでした。\n常に大きな不確実性がつきまとっていました。あえて言うなら\nこの間、鍵をなくしてしまった人たち。どうやら...",
      "title": "2013年、Wired誌はBitcoinをdaydreamingと呼び、ウォレットキーを消去し、現在は13.34BTCにアクセスできない状態になっています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这只是为了表明，与2013年相比，我们已经走过了漫长的道路。或者说我们有吗？\n\n并非所有那些 \"早期 \"的人都知道未来会带来什么，而且一直存在着巨大的不确定性。\n总是有大量的不确定性。我甚至不敢说\n在这段时间里失去钥匙的人。这似乎...",
      "title": "2013年《连线》杂志称比特币在做白日梦，删除了他们的钱包钥匙，现在无法访问13.34 BTC。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這只是爲了表明，與2013年相比，我們已經走過了漫長的道路。或者說我們有嗎？\n\n並非所有那些 \"早期 \"的人都知道未來會帶來什麼，而且一直存在着巨大的不確定性。\n總是有大量的不確定性。我甚至不敢說\n在這段時間裏失去鑰匙的人。這似乎...",
      "title": "2013年《連線》雜誌稱比特幣在做白日夢，刪除了他們的錢包鑰匙，現在無法訪問13.34 BTC。"
    }
  ]
}