{
  "author": "Thehellishsinger",
  "the_new_excerpt": "I just checked my wallet and I found out it has some five figure amount worth of\nBTC. I know it's not mine, I've already talked to my friends and family and none\nof them have sent me any BTC. I'm a newbie so I'm sure some user must've made a\nmistake when transferring their coins. How can I trace the…",
  "original_created_utc": 1621641132,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、自分の財布を確認したところ、5桁の価値があるBTCが入っていました。\nBTCです。私のものではないことはわかっています。友人や家族に相談しましたが、誰もBTCを送ってきませんでした。\nBTCを送ってきた人はいませんでした。私は初心者なので、誰かがコインを送金する際にミスをしたに違いありません。\n私は初心者なので、誰かがコインを送金する際にミスをしたのだと思います。どうやって追跡すればいいのでしょうか...。",
      "title": "BTCを正当な所有者に返すのを手伝ってください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚检查了我的钱包，我发现它有一些价值五位数的\nBTC。我知道这不是我的，我已经和我的朋友和家人谈过了，他们都没有给我寄过任何BTC。\n他们都没有给我发送任何BTC。我是一个新手，所以我相信一定是有的用户做了一个\n错了。我怎样才能追踪到...",
      "title": "帮助我把BTC归还给它的合法主人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛檢查了我的錢包，我發現它有一些價值五位數的\nBTC。我知道這不是我的，我已經和我的朋友和家人談過了，他們都沒有給我寄過任何BTC。\n他們都沒有給我發送任何BTC。我是一個新手，所以我相信一定是有的用戶做了一個\n錯了。我怎樣才能追蹤到...",
      "title": "幫助我把BTC歸還給它的合法主人。"
    }
  ],
  "title": "Help me return BTC to its rightful owner.",
  "created_utc": 1621668837,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just checked my wallet and I found out it has some five figure amount worth of BTC. I know it&#39;s not mine, I&#39;ve already talked to my friends and family and none of them have sent me any BTC. I&#39;m a newbie so I&#39;m sure some user must&#39;ve made a mistake when transferring their coins.  How can I trace the transference and return the BTC to them?</p>\n\n<p>Edit: Some people say I should be able to see the sender&#39;s address. But unfortunately that info is nowhere to be found on my app.</p>\n\n<p>The only thing that&#39;s different is that now I have some BTC that I didn&#39;t have an hour ago. So if you could be more specific or provide another tool to trace the transference that&#39;d be helpful.</p>\n\n<p>Edit2: I won&#39;t accept any PM guys. You know why.</p>\n\n<p>Edit 3: No. I don&#39;t feel like an idiot for trying to return the money. It might be some change belonging to some rich person or it could be the life savings of a family, so fuck off, I&#39;m giving it back to the owner.</p>\n\n<p>Edit 4: I&#39;ve checked and the address that sent me the BTC is actually an exchange. However you&#39;ve told me not to send it to an exchange. What should I do then?</p>\n\n<p>Edit 5: Ok so you people are telling me, that if the address is from an exchange they will keep the money. That won&#39;t do. I guess I&#39;ll just donate the money, cuz I won&#39;t keep it. Thanks to all of you who&#39;ve been kind and tried helping me to return the BTC.</p>\n</div><!-- SC_ON -->",
  "score": 278,
  "permalink": "/r/CryptoCurrency/comments/ni66ic/help_me_return_btc_to_its_rightful_owner/",
  "subreddit": "CryptoCurrency",
  "id": "ni66ic",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197383346
}