{
  "author": "JuicyTooshie",
  "original_created_utc": 1647376664,
  "title": "Why is it that a woman owning a dildo is seen as hot and intriguing, but a man owning a fleshlight is seen as desperate?",
  "created_utc": 1647402723,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I think, sex toy wise, people really should embrace what enhances their sex lives, whether that&amp;#39;s solo or in a couple, or whether you&amp;#39;re a guy or girl (regardless of sexuality).&lt;/p&gt;\n\n&lt;p&gt;If a woman owns a dildo or a vibrator, it&amp;#39;s seen as kinky and hot, along with that it&amp;#39;s attractive that she has a seemingly high sex drive.&lt;/p&gt;\n\n&lt;p&gt;If a man owns a fleshlight, it&amp;#39;s seen as he&amp;#39;s desperate for oral and something to screw, perhaps that he can&amp;#39;t get the real thing.&lt;/p&gt;\n\n&lt;p&gt;These aren&amp;#39;t my opinions. People should do what they wish to ignite their bedroom fun. These are, however, opinions of many people I speak to and perhaps are a common trend in societal double standards? IDK.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 144,
  "permalink": "/r/TooAfraidToAsk/comments/tezpng/why_is_it_that_a_woman_owning_a_dildo_is_seen_as/",
  "subreddit": "TooAfraidToAsk",
  "id": "tezpng",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I think, sex toy wise, people really should embrace what enhances their sex\nlives, whether that's solo or in a couple, or whether you're a guy or girl\n(regardless of sexuality).\n\nIf a woman owns a dildo or a vibrator, it's seen as kinky and hot, along with\nthat it's attractive that she has a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "セックスグッズは、自分のセックスをより豊かにしてくれるものを選ぶべきだと思います。\n一人でもカップルでも、男でも女でも。\n(セクシャリティに関係なく)です。\n\n女性がディルドやバイブレーターを持っていると、変態的でセクシーだと思われるし、同時に\nを持っていることが魅力的だということです。",
      "title": "ディルドを持つ女性はセクシーで魅力的だと思われるのに、肉球を持つ男性は絶望的だと思われるのはなぜか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为，从性玩具的角度来看，人们真的应该接受能够提高他们性生活的东西。\n无论你是独自一人还是一对夫妇，也无论你是男人还是女人\n(不论性取向如何)。\n\n如果一个女人拥有假阳具或振动器，就会被认为是淫荡和热辣的，同时也会被认为她有吸引力。\n她拥有一个假阳具或振动器是很有吸引力的。",
      "title": "为什么一个拥有假阳具的女人被看作是性感和耐人寻味的，而一个拥有肉棒的男人却被看作是绝望的呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲，從性玩具的角度來看，人們真的應該接受能夠提高他們性生活的東西。\n無論你是獨自一人還是一對夫婦，也無論你是男人還是女人\n(不論性取向如何)。\n\n如果一個女人擁有假陽具或振動器，就會被認爲是淫蕩和熱辣的，同時也會被認爲她有吸引力。\n她擁有一個假陽具或振動器是很有吸引力的。",
      "title": "爲什麼一個擁有假陽具的女人被看作是性感和耐人尋味的，而一個擁有肉棒的男人卻被看作是絕望的呢？"
    }
  ]
}