{
  "author": "Carl_Corey",
  "original_created_utc": 1635429808,
  "title": "Why the crypto market seems like it \"makes no sense\".",
  "created_utc": 1635489040,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>BTC and ETH, the top two cryptos have been declining for the past week.</p>\n\n<p>A dog token has increased by 177%, and breached the top 10.</p>\n\n<p>Your alts aren&#39;t pumping, and you can&#39;t understand why. They are such good projects, with the infrastructure, white paper, and fan base to prove it. So you are left with frustration, jealousy, confusion, and the inevitable &quot;crypto makes no sense&quot;. </p>\n\n<p>The problem isn&#39;t the projects you invest in, it&#39;s a misunderstanding of where we are in the phase of crypto existence.</p>\n\n<p>Is BTC old and outdated? Yes. Are there better projects out there? Yes. Are these projects continuously developing new technology and acquiring funding? Yes.</p>\n\n<p>Does any of this matter at all in the current moment? Not at all. The only thing that matters right now is real world use and recognition. No matter how great your Altcoin is going to be someday, or what new innovations it brings to the table, they don&#39;t count for diddly-squat until they are ACTUALLY put to use for their purpose. </p>\n\n<p>This subreddit, as great as it may be, has confused many people into believing that crypto is more mainstream than it really is. We are absolutely still in the development stage, and will end when all of the failed, obsolete, or meme projects fade away. Once we are left with the proud and the few, we will begin to see a shift towards the projects that matter.</p>\n\n<p>Now don&#39;t confuse what I&#39;ve said above, for me saying that you shouldn&#39;t invest in the projects you believe in. Now is definitely the time to invest in those projects. If your project ends up taking off, congratulations! But we will see a lot more SHIB scenarios happen before then, so buckle up, enjoy the ride, and maybe throw your extra cash at some gambly-wamby meme animals. If they take off, throw it back into the projects you believe in.</p>\n\n<p>Anyways. Have a good day everyone.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/qhnru5/why_the_crypto_market_seems_like_it_makes_no_sense/",
  "subreddit": "CryptoCurrency",
  "id": "qhnru5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "BTC and ETH, the top two cryptos have been declining for the past week.\n\nA dog token has increased by 177%, and breached the top 10.\n\nYour alts aren't pumping, and you can't understand why. They are such good\nprojects, with the infrastructure, white paper, and fan base to prove it. So you\nare left…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "上位2つの暗号であるBTCとETHが先週から下落している。\n\n犬のトークンが177％増加し、トップ10を突破しました。\n\nあなたのアルトはパンプしていませんが、あなたはその理由を理解できません。それらはとても良いプロジェクトです。\nインフラ、ホワイトペーパー、ファンベースが証明するような優れたプロジェクトなのに。だからあなたは\n残るのは...",
      "title": "なぜ、暗号市場は「意味がない」と思えるのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "BTC和ETH这两个顶级加密货币在过去一周一直在下跌。\n\n一个狗类代币增长了177%，并突破了前10名。\n\n你的代理机构没有抽水，而你却不明白为什么。它们是如此优秀的\n项目，有基础设施、白皮书和粉丝基础来证明。所以你\n就剩下...",
      "title": "为什么加密货币市场看起来 \"毫无意义\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "BTC和ETH這兩個頂級加密貨幣在過去一週一直在下跌。\n\n一個狗類代幣增長了177%，並突破了前10名。\n\n你的代理機構沒有抽水，而你卻不明白爲什麼。它們是如此優秀的\n項目，有基礎設施、白皮書和粉絲基礎來證明。所以你\n就剩下...",
      "title": "爲什麼加密貨幣市場看起來 \"毫無意義\"。"
    }
  ]
}