{
  "author": "RiseGroundbreaking17",
  "original_created_utc": 1643926020,
  "title": "Do you ever wish something horrible would happen to you so that everyone realizes how much they took you for granted?",
  "created_utc": 1643930304,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m not talking full on suicide, although those intrusive thoughts have weaseled their way into my head. I mean a car accident, terminal illness, or a freak accident. My life is going down the shitter and I just don’t know how I’m supposed to keep up. I’m too bitch to actually take my own life. But sometimes it feels like the only way to escape&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 491,
  "permalink": "/r/TooAfraidToAsk/comments/sjvtwu/do_you_ever_wish_something_horrible_would_happen/",
  "subreddit": "TooAfraidToAsk",
  "id": "sjvtwu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I’m not talking full on suicide, although those intrusive thoughts have weaseled\ntheir way into my head. I mean a car accident, terminal illness, or a freak\naccident. My life is going down the shitter and I just don’t know how I’m\nsupposed to keep up. I’m too bitch to actually take my own life. But…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "本格的な自殺の話ではないのですが、そのような考えが頭をよぎったことはあります。\n頭の中に入ってくる。交通事故、末期的な病気、あるいは不慮の事故という意味です。\n事故です。私の人生はどん底で、どうすればいいのかわからない。\nこのままではいけないと思いました。実際に自分で命を絶つには、私はあまりにビッチです。でも...",
      "title": "あなたは、何か恐ろしいことが自分に起これば、誰もがあなたをどれだけ当然視していたか気づくだろうと思ったことはありませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是在说完全的自杀，尽管这些侵入性的想法已经在我的脑海中出现。\n他们的方式进入我的头脑。我指的是一场车祸、绝症或一场怪异的\n意外。我的生活正变得一团糟，我只是不知道我该如何\n我不知道该如何保持下去。我太贱了，不可能真的去自杀。但是...",
      "title": "你是否曾经希望有什么可怕的事情发生在你身上，以便每个人都意识到他们对你有多么的不以为然？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是在說完全的自殺，儘管這些侵入性的想法已經在我的腦海中出現。\n他們的方式進入我的頭腦。我指的是一場車禍、絕症或一場怪異的\n意外。我的生活正變得一團糟，我只是不知道我該如何\n我不知道該如何保持下去。我太賤了，不可能真的去自殺。但是...",
      "title": "你是否曾經希望有什麼可怕的事情發生在你身上，以便每個人都意識到他們對你有多麼的不以爲然？"
    }
  ]
}