{
  "author": "gnarley_quinn",
  "original_created_utc": 1652139294,
  "title": "UST (a stable coin) is currently down 14%. This is a bigger drop than BTC and most other the top altcoins. A warning about echo chambers.",
  "created_utc": 1652149134,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I posted only a couple of &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/ukv56a/terra_luna_has_dropped_almost_three_times_as_much/\"&gt;days ago&lt;/a&gt; warning everyone this was pretty much on the cards. I obviously don’t want to see anyone or anything fail, but it really is important to read everything with an open heart. &lt;/p&gt;\n\n&lt;p&gt;If you straight up ignore all advice that is contrary to what you want to hear, you are setting yourself up for failure. The Safemoon sub is the prime example of the echo chamber that just won’t listen. &lt;/p&gt;\n\n&lt;p&gt;Please. If someone warns you against something, try to find reason in it. Is it possible they are correct? Challenge it, and ask or clarify your misunderstandings. &lt;/p&gt;\n\n&lt;p&gt;I don’t want this post to come across as a “told you so” at all. Although I’m sure many commenters will say exactly that. The point I’m trying to make is to please listen to both sides at all times. It is usually quite easy to discern between someone just spreading FUD and someone who is trying to challenge the merits of a project. &lt;/p&gt;\n\n&lt;p&gt;One thing I do to help me understand all issues is to join the subs or projects I’m not involved in, as well as those I am involved in. I need to hear all sides.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 329,
  "permalink": "/r/CryptoCurrency/comments/um4k8s/ust_a_stable_coin_is_currently_down_14_this_is_a/",
  "subreddit": "CryptoCurrency",
  "id": "um4k8s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I posted only a couple of days ago\n[https://np.reddit.com/r/CryptoCurrency/comments/ukv56a/terra_luna_has_dropped_almost_three_times_as_much/]\nwarning everyone this was pretty much on the cards. I obviously don’t want to\nsee anyone or anything fail, but it really is important to read everything…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ほんの数日前に投稿したものです\n[https://np.reddit.com/r/CryptoCurrency/comments/ukv56a/terra_luna_has_dropped_almost_three_times_as_much/]\nを投稿し、みんなに警告したのですが、これはほとんど予定通りでした。私は明らかに、誰かや何かが失敗するのを見たくありません。\nしかし、本当にすべてを読むことが重要なのです...。",
      "title": "UST（安定コイン）は現在14％ダウンしている。これはBTCや他の上位アルトコインのほとんどよりも大きな下げ幅です。エコーチェンバーについての警告です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我几天前才发过帖子\n[https://np.reddit.com/r/CryptoCurrency/comments/ukv56a/terra_luna_has_dropped_almost_three_times_as_much/]\n警告大家这几乎是板上钉钉的事。我显然不希望\n看到任何人或任何东西失败，但是阅读所有的东西真的很重要......",
      "title": "UST（一种稳定的硬币）目前下跌了14%。这比BTC和其他大多数顶级altcoins的跌幅更大。关于回声室的警告。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我幾天前才發過帖子\n[https://np.reddit.com/r/CryptoCurrency/comments/ukv56a/terra_luna_has_dropped_almost_three_times_as_much/]\n警告大家這幾乎是板上釘釘的事。我顯然不希望\n看到任何人或任何東西失敗，但是閱讀所有的東西真的很重要......",
      "title": "UST（一種穩定的硬幣）目前下跌了14%。這比BTC和其他大多數頂級altcoins的跌幅更大。關於回聲室的警告。"
    }
  ]
}