{
  "author": "CryptoRookieX",
  "the_new_excerpt": "I got into crypto a few months ago with the intent of making gains long term. I\nknew it wouldn't happen over night. Sure, I have made some gains since I got\nin... but not enough to make a difference in my life. That kind of thing takes\ntime.\n\nNow comes along Safemoon and it's many MANY knockoffs.…",
  "original_created_utc": 1619429905,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は数ヶ月前に、長期的に利益を上げるつもりで暗号化を始めました。I\n一朝一夕にはいかないことはわかっていました。確かに、参入してからいくつかの利益を得ました。\nしかし、自分の人生を変えるほどではありませんでした。このようなことには\n時間がかかります。\n\n今、Safemoonとその多くのコピー商品が登場しました....",
      "title": "SafemoonのようなSh*tcoinsは、Cryptoの世界で非現実的な期待を生み出している"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几个月前，我进入加密货币领域，打算长期赚取收益。I\n我知道这不可能在一夜之间发生。当然，自从我进入以来，我已经取得了一些收益......但还不足以改变我的生活。\n但还不足以对我的生活产生影响。这类事情需要\n时间。\n\n现在，Safemoon和它的许多山寨品出现了....。",
      "title": "像Safemoon这样的垃圾币正在为加密货币世界创造不切实际的预期"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾個月前，我進入加密貨幣領域，打算長期賺取收益。I\n我知道這不可能在一夜之間發生。當然，自從我進入以來，我已經取得了一些收益......但還不足以改變我的生活。\n但還不足以對我的生活產生影響。這類事情需要\n時間。\n\n現在，Safemoon和它的許多山寨品出現了....。",
      "title": "像Safemoon這樣的垃圾幣正在爲加密貨幣世界創造不切實際的預期"
    }
  ],
  "title": "Sh*tcoins like Safemoon are creating unrealistic expectations in the Crypto world",
  "created_utc": 1619444739,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I got into crypto a few months ago with the intent of making gains long term. I knew it wouldn&#39;t happen over night. Sure, I have made some gains since I got in... but not enough to make a difference in my life. That kind of thing takes time.</p>\n\n<p>Now comes along Safemoon and it&#39;s many MANY knockoffs. Everybody is now looking for the next get-rich-quick coin. It has created an impatient mentality in the space that is not good at all. People are dropping money they can&#39;t afford to lose on shitty coins that are just Safemoon clones... and they are losing. </p>\n\n<p>People need to understand that, while there are outliers, earning on an investment takes time. If you&#39;re the type person seriously asking &#39;When moon?&#39; or &#39;When Lambo?&#39;... then you need to rethink your view of cryptocurrency. Life changing wealth does not happen in an instant.</p>\n</div><!-- SC_ON -->",
  "score": 1541,
  "permalink": "/r/CryptoCurrency/comments/mytvup/shtcoins_like_safemoon_are_creating_unrealistic/",
  "subreddit": "CryptoCurrency",
  "id": "mytvup",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776210468
}