{
  "author": "SlavojZizesh",
  "original_created_utc": 1659948446,
  "title": "I got a girl pregnant and she doesn't want to keep it",
  "created_utc": 1659960241,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am dating this girl who just got 2 positive pregnancy tests. Neither of us are interested in keeping it. She will take a pill that will &amp;#39;kill&amp;#39; the fetus. I will be staying with her for 48 hours due to the risks of her becoming sick from the pill.   &lt;/p&gt;\n\n&lt;p&gt;What can I do for her? Do I apologize? Do I buy her a cake? A get well soon card?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/NoStupidQuestions/comments/wj3tce/i_got_a_girl_pregnant_and_she_doesnt_want_to_keep/",
  "subreddit": "NoStupidQuestions",
  "id": "wj3tce",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am dating this girl who just got 2 positive pregnancy tests. Neither of us are\ninterested in keeping it. She will take a pill that will 'kill' the fetus. I\nwill be staying with her for 48 hours due to the risks of her becoming sick from\nthe pill.\n\nWhat can I do for her? Do I apologize? Do I buy…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、妊娠検査薬で2回陽性反応が出たばかりの女の子と付き合っています。私たちはどちらも\nこのままではいけないと思いました。彼女は胎児を'殺す'ピルを飲むそうです。I\nピルによって彼女が病気になる危険性があるため、48時間一緒にいることになります。\n私は48時間付き添うつもりです。\n\n私は彼女のために何ができるのでしょうか？謝ればいいのか？買うか...",
      "title": "女の子を妊娠させたが、彼女はそれを維持することを望んでいない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在和这个女孩约会，她刚刚得到2个阳性的怀孕测试结果。我们两人都没有\n对保留它感兴趣。她会吃一种能'杀死'胎儿的药。I\n我将和她呆在一起48小时，因为她有可能因为怀孕而生病。\n药的风险。\n\n我可以为她做什么？我可以道歉吗？我是否要买...",
      "title": "我让一个女孩怀孕了，她却不想保留它"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在和這個女孩約會，她剛剛得到2個陽性的懷孕測試結果。我們兩人都沒有\n對保留它感興趣。她會喫一種能'殺死'胎兒的藥。I\n我將和她呆在一起48小時，因爲她有可能因爲懷孕而生病。\n藥的風險。\n\n我可以爲她做什麼？我可以道歉嗎？我是否要買...",
      "title": "我讓一個女孩懷孕了，她卻不想保留它"
    }
  ]
}