{
  "author": "Hichek2",
  "the_new_excerpt": "Article from Bloomberg.\n\nYou don’t need to feel too sorry for Jamie Dimon, the chief executive officer of\nJPMorgan Chase & Co., the largest bank in the U.S. by assets and the largest in\nthe world by trading and fee revenue. But it’s easy to see why he might be\nmiffed at the Federal Reserve at the…",
  "original_created_utc": 1616427887,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "文章来自彭博社。\n\n你不需要为杰米-戴蒙感到太遗憾，他是一家公司的首席执行官。\n摩根大通公司，按资产计算是美国最大的银行，也是美国最大的银行。\n通过交易和费用收入来实现世界。但很容易理解为什么他可能是\n恼怒于美联储在...",
      "title": "摩根大通可能很快就会拒绝机构的存款。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "文章來自彭博社。\n\n你不需要爲傑米-戴蒙感到太遺憾，他是一家公司的首席執行官。\n摩根大通公司，按資產計算是美國最大的銀行，也是美國最大的銀行。\n通過交易和費用收入來實現世界。但很容易理解爲什麼他可能是\n惱怒於美聯儲在...",
      "title": "摩根大通可能很快就會拒絕機構的存款。"
    }
  ],
  "title": "JP MORGAN May Soon Turn Away Deposits from Institutions",
  "created_utc": 1616431209,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Article from Bloomberg.  </p>\n\n<p>You don’t need to feel too sorry for Jamie Dimon, the chief executive officer of JPMorgan Chase &amp; Co., the largest bank in the U.S. by assets and the largest in the world by trading and fee revenue. But it’s easy to see why he might be miffed at the Federal Reserve at the moment. </p>\n\n<p>On March 19, the Fed <a href=\"https://www.federalreserve.gov/newsevents/pressreleases/bcreg20210319b.htm\">announced</a> that a temporary regulatory break for banks will expire as scheduled on March 31. Dimon had told investment analysts in January that if the break went away, his bank would have a financial incentive to turn away deposits, as it has done in the past (for large institutional deposits, that is; the bank still likes retail deposits, which tend to be sticky and produce other banking business).</p>\n\n<p>Here’s a snippet from the Jan. 15 earnings call as I transcribed it from Bloomberg’s recording:</p>\n\n<p><em>Dimon</em><br/>\n<em>Remember, we were able to reduce deposits $200 billion within like months last time.</em></p>\n\n<p><em>Jennifer Piepszak, chief financial officer</em><br/>\n<em>Yeah.</em></p>\n\n<p><em>Dimon</em><br/>\n<em>But we don&#39;t want to do it. It’s very customer unfriendly to say, “Please take your deposits elsewhere ….”</em></p>\n\n<p>It’s common for Jamie Dimon to complain about “gold-plated” banking regulation, but in this case he seems to have a point. A Fed regulation that makes it unprofitable for banks to take in deposits—when taking in deposits has always been a key function of banks—is a bit hard to justify.</p>\n\n<p>How we got to this point is complicated but interesting. The old style of bank regulation was to limit the leverage of banks. It was analogous to how banks themselves require homebuyers to have some skin in the game. Homebuyers have to put in some of their own money so the mortgage loan  they get is smaller than the value of the house they’re purchasing. That way if the homeowner stops making payments, the bank can seize the house, sell it, and get back what it lent. Similarly, under simple leverage regulation, banks had to show that the value of their assets (such as the loans they make and cash in the vault) was substantially greater than their liabilities (such as the deposits they take in, which is money they owe to the depositors). Roughly speaking, the excess of assets over liabilities was called capital.</p>\n\n<p>But that simple system failed. Banks can make more money by going big on risky assets like high-interest loans than by investing in safe, low-yielding stuff like Treasury securities. And as long as regulators treated all assets alike, it made sense to load up on risky ones. But risky assets are more likely to go bust, so regulators wisely started taking the safety of different assets into account. It was a big improvement but not perfect: Some banks understated the riskiness of their assets, which became a problem in the global financial crisis of 2008-09. For instance, some banks loaded up on the debt of their national governments because it was given a zero risk-weighting, when in fact it was highly risky.</p>\n\n<p>The new system is belt and suspenders. The belt is risk-weighted capital regulation, under which riskier assets require a bank to have more capital against them, while very safe assets require little or none. There’s also a backup system—the suspenders—where all assets are treated alike, just as in the old days. This is called the supplementary leverage ratio. It was agreed to by a wide range of nations under the auspices of the Bank for International Settlements and took effect in 2018. The SLR is meant to deal with situations where a bank has loads of assets that aren’t as safe as they’re said to be.</p>\n\n<p>The suspenders are supposed to hang loose most of the time while the belt does the real work of holding up the pants, so to speak. In last year’s Covid-19 recession, though, banks suddenly got flooded with more assets than they could handle. The Fed bought Treasuries to drive down interest rates and paid for them by creating reserves, which show up as assets on banks’ balance sheets. Businesses drew down lines of credit and deposited the proceeds in banks. Consumers’ bank accounts were swollen by government relief checks. Demand for consumer and business loans was weak so banks stashed most of the incoming money in Treasury securities or left it in cash. (Funds from customers are both an asset to the bank, because they can invest the money, and a liability, because they have to return it some day.) </p>\n\n<p>Suddenly the suspenders weren’t so loose anymore. Without even trying, banks had acquired a lot more assets on their balance sheet. Most were super-safe, but the supplementary leverage ratio applied equally to every dollar of them, regardless of their safety.   </p>\n\n<p>Realizing there was a problem, the Federal Reserve and other federal bank regulators in May 2020 exempted Treasuries and reserves at the Fed from the calculation of the supplementary leverage ratio. Not permanently, but through March 31, 2021. It said the exemption “will provide flexibility to certain depository institutions to expand their balance sheets in order to provide credit to households and businesses in light of the challenges arising from the coronavirus response.”</p>\n\n<p>This year banks lobbied vigorously for the exemption to be extended or even made permanent but, as mentioned above, on March 19 the Fed said without explanation that the exemption would end at the end of this month.</p>\n\n<p>What happens now? Nothing right away. Banks have more capital than they need so they won’t have to shed assets starting April 1. Zoltan Pozsar, an analyst at Credit Suisse Group AG, wrote in a <a href=\"https://plus.credit-suisse.com/rpc4/ravDocView?docid=V7qjPE2AN-VHSK\">note</a> to clients on March 16, ahead of the Fed announcement, that “Neither the Fed nor the market should fear mayhem if the exemption expires.” One key reason, he said, is that the major banks won’t be affected by the expiring exemption because they never opted into it in the first place for their operating subsidiaries. And, he wrote, 90% of the currently exempt Treasuries and Fed reserves are being held at the operating subsidiary level. </p>\n\n<p>In the longer run, though, there could be problems. Pozsar wasn’t quite as blithe when he discussed the supplementary leverage ratio on the Odd Lots podcast <a href=\"https://www.bloomberg.com/news/audio/2021-03-03/zoltan-pozsar-on-what-just-happened-in-treasuries-podcast?sref=AMvrlaMu\">aired</a> by Bloomberg on March 3. If banks like JPMorgan Chase push away institutional deposits by charging fees or putting on negative interest rates, the money will spill into money market funds, he predicted. But money market funds won’t have any good place to put the money either, he said. If they pour into Treasury bills, they could push the bill yields negative. But money market funds can’t afford to earn negative returns because they promise to pay back investors 100 cents on the dollar.</p>\n\n<p>Pozsar said the Fed system could assist by allowing money market funds to stash more money with it through overnight reverse repurchase agreements. The Federal Reserve Bank of New York did just that two weeks later, <a href=\"https://www.newyorkfed.org/markets/opolicy/operating_policy_210317\">announcing</a> on March 17 that it would allow each of its counterparties to do overnight reverse repos of $80 billion a day, up from $30 billion previously. Pozsar, who used to work for the New York Fed, <a href=\"https://www.bloomberg.com/news/articles/2021-03-17/powell-stays-silent-on-extending-fed-s-capital-relief-for-banks?sref=AMvrlaMu\">called</a> that “foaming the runway” for the March 31 expiration of the supplementary leverage ratio exemption.</p>\n\n<p>In 2014, when the supplementary leverage ratio was under discussion, Fed staff predicted [<a href=\"https://www.federalreserve.gov/mediacenter/files/open-board-meeting-transcript-20140409.pdf\">PDF</a>] that the impact of the enhanced version of the ratio on the biggest banks would be modest because, after all, the Fed was about to start shrinking its balance sheet. In reality the balance sheet is bigger than ever now and still growing. As the Fed continues to buy Treasuries and mortgage bonds and pays for them with reserves, banks’ assets will continue to swell and eventually the supplementary leverage ratio could become the “binding constraint” on the banks’ behavior; the suspenders will become tight. That would be a return to the bad old days. </p>\n\n<p>Some of the resistance to keeping the leverage exemption in place past March 31 is based on concerns that banks need bigger safety buffers. That’s a legitimate concern. But the question of how much capital banks need is separate from the question of how those capital levels should be determined. There area actually four ways of setting capital—risk-weighted capital, supplementary leverage ratio, post-stress estimate of risk-weighted capital, and post-stress estimate of supplementary leverage ratio. That ends up causing confusion and treating banks differently when they’re engaged in the same activities.</p>\n\n<p>It’s “not clear you can fix the gaming of one rule by adding more rules,” says a 2017 presentation [<a href=\"https://www.brookings.edu/wp-content/uploads/2017/09/6a_stein.pdf\">PDF</a>] by Robin Greenwood, Sam Hanson, Jeremy Stein, and Adi Sunderam of Harvard University and the National Bureau of Economic Research for a <em>Brookings Papers on Economic Activity</em> conference. Their preference: A single standard that takes into account stressful scenarios and is “generally more sensitive to the kinds of data that you wouldn’t want to bake into a hard rule.”</p>\n\n<p>The Fed may end up having more to say about this.</p>\n</div><!-- SC_ON -->",
  "score": 1288,
  "permalink": "/r/investing/comments/maqmx6/jp_morgan_may_soon_turn_away_deposits_from/",
  "subreddit": "investing",
  "id": "maqmx6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752819535
}