{
  "author": "cake_spaghetti101",
  "the_new_excerpt": "I mean, most of the time, these scenes add nothing at all to the plot of the\nmovie and takes up a lot of time. The time occupied by these scenes could be\nused to solidify and improve the plot and climax of the movie or even to focus\non character development. Watching movies on Netflix with my brown…",
  "original_created_utc": 1621787021,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "つまり、ほとんどの場合、これらのシーンは映画のプロットに何の役にも立たないし\n多くの時間を費やしています。これらのシーンで占められている時間は、映画のプロットやクライマックスをより強固なものにしたり\n映画のプロットやクライマックスをより良くするために、あるいはキャラクター開発のために\nキャラクターの開発に集中することもできたはずです。ブラウンと一緒にNetflixで映画を見る...",
      "title": "ハリウッド映画では、必要以上にセックスやキスのシーンが多いと思うのは私だけでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的意思是，在大多数情况下，这些场景对电影的情节没有任何帮助。\n占用了大量的时间。这些场景所占用的时间可以\n用来巩固和改善电影的情节和高潮，甚至用来关注人物发展。\n角色的发展。在Netflix上和我的布朗一起看电影...",
      "title": "是我的问题，还是好莱坞电影中存在不必要的性和吻戏，甚至比需要的还要多？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的意思是，在大多數情況下，這些場景對電影的情節沒有任何幫助。\n佔用了大量的時間。這些場景所佔用的時間可以\n用來鞏固和改善電影的情節和高潮，甚至用來關注人物發展。\n角色的發展。在Netflix上和我的布朗一起看電影...",
      "title": "是我的問題，還是好萊塢電影中存在不必要的性和吻戲，甚至比需要的還要多？"
    }
  ],
  "title": "Is it just me or is there an unnecessary amount of sex and kissing scenes in Hollywood movies, much more than is even needed?",
  "created_utc": 1621821505,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I mean, most of the time, these scenes add nothing at all to the plot of the movie and takes up a lot of time. The time occupied by these scenes could be used to solidify and improve the plot and climax of the movie or even to focus on character development. Watching movies on Netflix with my brown family gets very unnecessarily awkward 100% of the time, like, we get it, you guys have a better sex life than most of us losers! No need to shove it down our throats smh.</p>\n</div><!-- SC_ON -->",
  "score": 174,
  "permalink": "/r/TooAfraidToAsk/comments/njb5mh/is_it_just_me_or_is_there_an_unnecessary_amount/",
  "subreddit": "TooAfraidToAsk",
  "id": "njb5mh",
  "is_self": true,
  "media": null,
  "is_video": false
}