{
  "author": "ScubaRacer",
  "original_created_utc": 1638060292,
  "title": "Are black people more inclined to be racist towards Asians?",
  "created_utc": 1638070879,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let me start with this is a question of curiosity and I want a civil discussion. From my experience as an Asian in NYC, I have only ever experienced racism from black people. My family and friends have also had this experience. Now this may be anecdotal, but I wanted to know why I&#39;ve never had this experience with white people. I would imagine there would be solidarity with people of color but unfortunately that has never been my experience.</p>\n\n<p>Again anecdotal, but I feel like Asian hate in NYC are all perpetuated by black. Maybe it&#39;s the news idk. But I can for a fact say I&#39;ve never been called a chink by a white person. I&#39;ve never been called ching chong by a white person. I don&#39;t understand.</p>\n\n<p>Edit: I want to say thank you everyone for your input. I can only hope we continue to ask questions and understand each other so that we can be empathetic towards each other. I hope one day racism disappears.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/r3rhwg/are_black_people_more_inclined_to_be_racist/",
  "subreddit": "TooAfraidToAsk",
  "id": "r3rhwg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Let me start with this is a question of curiosity and I want a civil discussion.\nFrom my experience as an Asian in NYC, I have only ever experienced racism from\nblack people. My family and friends have also had this experience. Now this may\nbe anecdotal, but I wanted to know why I've never had this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最初に、これは好奇心からの質問であり、市民的な議論をしたいと思います。\nニューヨークでのアジア人としての経験から、私はこれまで黒人からの人種差別しか経験したことがありません。\n黒人からの人種差別しか経験したことがありません。私の家族や友人もこのような経験をしています。これは逸話かもしれませんが\n逸話かもしれませんが、なぜ私はこのような経験をしたことがないのかを知りたかったのです...",
      "title": "黒人はアジア人に対して差別的な傾向があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我想说这是一个好奇心的问题，我希望进行文明的讨论。\n根据我在纽约市作为一个亚洲人的经验，我只经历过来自黑人的种族主义。\n黑人。我的家人和朋友也有这样的经历。现在这可能\n这可能是传闻，但我想知道为什么我从来没有过这种......",
      "title": "黑人是否更倾向于对亚洲人持种族主义态度？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我想說這是一個好奇心的問題，我希望進行文明的討論。\n根據我在紐約市作爲一個亞洲人的經驗，我只經歷過來自黑人的種族主義。\n黑人。我的家人和朋友也有這樣的經歷。現在這可能\n這可能是傳聞，但我想知道爲什麼我從來沒有過這種......",
      "title": "黑人是否更傾向於對亞洲人持種族主義態度？"
    }
  ]
}