{
  "author": "ANAL-Inverter-2000",
  "the_new_excerpt": "This is a rant and I apologize beforehand for hurting feelings and not choosing\nthe best words. I'm drunk and I need to have a word with you noobs. I've seen\npeople discussing the possibility that governments could ban Bitcoin and omg how\nbad the big gov controls everything! What if they outlaw it?…",
  "original_created_utc": 1616926525,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这是在发牢骚，我事先为伤害感情和不选择道歉\n最好的词。我喝醉了，我需要和你们这些无名小卒说几句话。我已经看到了\n人们讨论政府可能会禁止比特币的可能性和OMG如何\n糟糕的是，大政府控制了一切！如果他们把它定为非法呢？",
      "title": "你们这些noobs认为你们的政府可以禁止加密。再想想吧"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是在發牢騷，我事先爲傷害感情和不選擇道歉\n最好的詞。我喝醉了，我需要和你們這些無名小卒說幾句話。我已經看到了\n人們討論政府可能會禁止比特幣的可能性和OMG如何\n糟糕的是，大政府控制了一切！如果他們把它定爲非法呢？",
      "title": "你們這些noobs認爲你們的政府可以禁止加密。再想想吧"
    }
  ],
  "title": "Yall noobs think your gov can ban crypto. Think again.",
  "created_utc": 1616945429,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is a rant and I apologize beforehand for hurting feelings and not choosing the best words. I&#39;m drunk and I need to have a word with you noobs. I&#39;ve seen people discussing the possibility that governments could ban Bitcoin and <em>omg how bad the big gov controls everything! What if they outlaw it? Or tax it? Or regulate it? Or kill the exchanges???</em></p>\n\n<p>Let me say it clear: most of you cyber noobs have no effing idea what cryptography, decentralized networks like the torrent network, and ultimately crypto currency are capable of.</p>\n\n<p>You&#39;re thinking in legacy system terms. You&#39;re thinking, &quot;Oh no the economic value of my coins can go down because they control the exchanges&quot;. You don&#39;t get it. Maybe you don&#39;t even realize what your crypto actually is. For many of you, crypto is a vehicle to attain more power in legacy meat space. I get it, it&#39;s hard to think outside of the box and think beyond your own cognitive barriers. But it&#39;s way bigger than what your frightened, conditioned, slave mentality brain can even start to grasp.</p>\n\n<p>What crypto doesn&#39;t do, among other things:</p>\n\n<ul>\n<li>it doesn&#39;t care what your exchange rate is</li>\n<li>it doesn&#39;t care how good your on and off ramps are</li>\n<li>it doesn&#39;t care about your local law</li>\n<li>it doesn&#39;t care about censorship</li>\n<li>it even doesn&#39;t care about any of your meat space physical boundary conditions, other than the hash rate, connectivity, and the network topology of the network</li>\n</ul>\n\n<p>It&#39;s a fucking cyber honey badger but most of you guys are stuck with their mind in the &quot;but but but what if the big guys take it away from us&quot; mindset. I&#39;m so happy that the success of this project does not depend on whether people&#39;s feelings are aligned with the cryptographic reality of it. </p>\n\n<p>Let me add only this: if it were possible to turn this thing off, It would be turned off already. None of your govs would have let it become what it is now. If they could have. They have tried to kill the torrent network for ages. Guess what, I&#39;ve just seeded another terabyte this month. And I&#39;m going to keep doing it, even if it means that I need to get a freaking satellite internet connection for doing so. </p>\n\n<p>Vires in numeris.</p>\n</div><!-- SC_ON -->",
  "score": 574,
  "permalink": "/r/Bitcoin/comments/meyr8s/yall_noobs_think_your_gov_can_ban_crypto_think/",
  "subreddit": "Bitcoin",
  "id": "meyr8s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357133938
}