{
  "author": "profesh_2_death",
  "original_created_utc": 1648135110,
  "title": "Why did Cyrus surrender Alexandria in 641?",
  "created_utc": 1648202005,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m reading a book about the crusades and it&amp;#39;s very interesting so far. I have never really learned about the 7th century before, so all of this is new to me.&lt;/p&gt;\n\n&lt;p&gt;One section that stuck out was the fall of Egypt to the caliphate. The pretext is that the muslim armies have entered Egypt and are locked outside the walls of Alexandria. Their goal is to draw the Byzantines into battle outside the defenses of the city, but it&amp;#39;s not working - so they attempt a siege.&lt;/p&gt;\n\n&lt;p&gt;Here is the passage from the book (highlighting is from me):&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What followed ought to have been a hopeless siege, since Alexandria was a port and the Byzantine navy, which then had complete control of the seas, could easily supply and reinforce the city for as long as necessary. Being the second largest city in the whole Christian world, Alexandria “was surrounded by massive walls and towers, against which such missiles as the Arabs possessed were utterly ineffectual…Such a city could have held out for years.” But, &lt;strong&gt;for reasons that will never be known&lt;/strong&gt;, in 641, a month after he had arrived by sea to become the new governor of Egypt, Cyrus went out to meet the Muslim commander and surrendered Alexandria and all of Egypt.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This made me very curious and I tried to google why this event happened, but to no avail. Does anyone have any expertise here on theories for why Cyrus did it? Or maybe if you know of a good youtube or article about this event?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/tmgg37/why_did_cyrus_surrender_alexandria_in_641/",
  "subreddit": "AskHistorians",
  "id": "tmgg37",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm reading a book about the crusades and it's very interesting so far. I have\nnever really learned about the 7th century before, so all of this is new to me.\n\nOne section that stuck out was the fall of Egypt to the caliphate. The pretext\nis that the muslim armies have entered Egypt and are locked…"
}