{
  "author": "marvelogs",
  "original_created_utc": 1627019790,
  "title": "Get latest news from over 100 countries in the world in one single place",
  "created_utc": 1627049845,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What&#39;s happening in all the countries right now? Do I need to know? Yes. Do I want to know? Yes! So I created this.</p>\n\n<p><a href=\"https://www.tello.app\"><strong>https://www.tello.app</strong></a></p>\n\n<p>Collected a large number of RSS feeds on latest news of more than 100 countries (All in English for now by the way).</p>\n\n<p>Some of the things I learned..</p>\n\n<ul>\n<li>I still love RSS feeds</li>\n<li>All news sites should have RSS feeds</li>\n<li>I never knew some of the countries that existed - Saint Vincent and the Grenadines? Grenada? Guadeloupe? Montserrat? (until yesterday Montserrat was Google Font I use)</li>\n<li>I added each country&#39;s flag emoji as part of the name - really like some countries&#39; flags!!</li>\n<li>And obiviously, got to read a lots of news articles - and.. a lot of articles are about COVID</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/opw4nh/get_latest_news_from_over_100_countries_in_the/",
  "subreddit": "SideProject",
  "id": "opw4nh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "What's happening in all the countries right now? Do I need to know? Yes. Do I\nwant to know? Yes! So I created this.\n\nhttps://www.tello.app\n\nCollected a large number of RSS feeds on latest news of more than 100 countries\n(All in English for now by the way).\n\nSome of the things I learned..\n\n * I still…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、各国で何が起きているのか？知る必要がありますか？はい。私は\n知りたいですか？そうです。だから、私はこれを作りました。\n\nhttps://www.tello.app\n\n100カ国以上の最新ニュースのRSSを大量に集めました\n(集めました（今のところ全て英語です）。)\n\n私が学んだことのいくつかは...\n\n * 私はまだ...",
      "title": "世界100カ国以上の最新ニュースを一度に入手することができます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在所有的国家都在发生什么？我需要知道吗？是的。我是否\n想知道吗？是的！我想知道。所以我创建了这个。\n\nhttps://www.tello.app\n\n收集了大量关于100多个国家的最新新闻的RSS提要\n(顺便说一下，目前都是英文的)。\n\n我学到的一些东西...\n\n * 我仍然...",
      "title": "在一个地方获得来自世界上100多个国家的最新新闻"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在所有的國家都在發生什麼？我需要知道嗎？是的。我是否\n想知道嗎？是的！我想知道。所以我創建了這個。\n\nhttps://www.tello.app\n\n收集了大量關於100多個國家的最新新聞的RSS提要\n(順便說一下，目前都是英文的)。\n\n我學到的一些東西...\n\n * 我仍然...",
      "title": "在一個地方獲得來自世界上100多個國家的最新新聞"
    }
  ]
}