{
  "author": "21_Adulting",
  "original_created_utc": 1648052644,
  "title": "Is it wrong tell my girlfriend to get back in shape and lose weight?",
  "created_utc": 1648060819,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hear me out.&lt;/p&gt;\n\n&lt;p&gt;We’ve been together for just over a year now. This has cone up over and over again.&lt;/p&gt;\n\n&lt;p&gt;She texts me around every 2 weeks telling me. “I gained weight.”&lt;/p&gt;\n\n&lt;p&gt;From when we started dating to now her diet is pretty awful. She drinks like 24 to 32 oz of coffee full of half and half, creamer, caramel syrup, and almond milk.&lt;/p&gt;\n\n&lt;p&gt;She generally has a poor diet growing up. Doesn’t eat fruits except avocados and bananas. Doesn’t eat veggies much at all except for things like potatoes, mushrooms, and onions. She dumps a lot of Parmesan cheese on all of her food. She eats bologna and turkey bacon all the time.&lt;/p&gt;\n\n&lt;p&gt;When I first dated her, she was a bit over weight, but it was fine. She still looked great.&lt;/p&gt;\n\n&lt;p&gt;After another 15 to 20 pounds, I’m very concerned at the direction she is taking her health. She is getting to a point where if something doesn’t change, I don’t know what to do.&lt;/p&gt;\n\n&lt;p&gt;I’ve been encouraging her time after time. I help her with cooking good healthy meals for the majority of her meals now. I encourage her to go to the gym. She walks on the treadmill around 15 minutes and maybe another 15 minutes doing weight machines. She cheats on dieting every single day. It’s coffee, or powerade, or i’m really craving a mango smoothie, i’m just gonna get this one snack, it’s not like I get it very often.&lt;/p&gt;\n\n&lt;p&gt;She says she isn’t feeling well and feeling sick almost every week. Which is honestly true. She isn’t faking it. She has real insecurities about her body. I can’t even tell her honestly that she needs to lose weight because I know she is gonna be in tears about it.&lt;/p&gt;\n\n&lt;p&gt;I’m not saying she needs to have a perfect body. She is an amazing person who I really care about. But I can’t keep taking care of her and being her nurse rather than her partner.&lt;/p&gt;\n\n&lt;p&gt;Also I’m not a hypocritical cause I regularly diet and have been getting to a point where i’ve been really proud of my body. I’ve been doing to show her that she can do it too and I wanted her to do the same with me.&lt;/p&gt;\n\n&lt;p&gt;At this point, if she doesn’t make any changes to her lifestyle and health, I don’t think I can keep going. Is that ok or is that unfair? What are your thoughts?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/TooAfraidToAsk/comments/tkz6ac/is_it_wrong_tell_my_girlfriend_to_get_back_in/",
  "subreddit": "TooAfraidToAsk",
  "id": "tkz6ac",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hear me out.\n\nWe’ve been together for just over a year now. This has cone up over and over\nagain.\n\nShe texts me around every 2 weeks telling me. “I gained weight.”\n\nFrom when we started dating to now her diet is pretty awful. She drinks like 24\nto 32 oz of coffee full of half and half, creamer,…"
}