{
  "author": "petanibulan",
  "original_created_utc": 1638493088,
  "title": "Terra (LUNA) for beginners. Terra is an ecosystem of stablecoins and this is why it matters for all of crypto.",
  "created_utc": 1638531043,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Source: &lt;a href=\"https://np.reddit.com/r/terraluna/comments/p8m4s1/terra_is_an_ecosystem_of_stablecoins_and_this_is/\"&gt;terraluna subreddit&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The thesis of this post is: &lt;strong&gt;Decentralized finance deserves decentralized stablecoin&lt;/strong&gt;. And why Terra has solved this problem. Terra stablecoins are a service that meets the needs of all blockchains for stablecoins.&lt;/p&gt;\n\n&lt;h1&gt;The Problem With Stablecoins&lt;/h1&gt;\n\n&lt;p&gt;Millions of people have lost their money for taking their money out of shady greedy banks and trusting even shadier greedier banks: &lt;strong&gt;Centralized exchanges&lt;/strong&gt;. The community of devs rallied and have given us DEX (Decentralized Exchange) and DeFi to solve these problems. They are truly beautiful&lt;/p&gt;\n\n&lt;p&gt;But there is even shadier bank in this community: &lt;strong&gt;stablecoin issuer&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;A lot of conversations center around, which of the stablecoin issuers is the safest and the answer is none of them. We all know Tether is extremely shady in their backing. USDC also caught lying with their 1:1 backing. But there is one bad thing they have in common: they can &lt;strong&gt;freeze your stablecoin&lt;/strong&gt; anytime. Even in your own wallet.&lt;/p&gt;\n\n&lt;p&gt;But nevertheless, we need stablecoins, they allow placeholder value for trading in and out of crypto without needing to interface with legacy banking systems.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;DAI and MIM is amazing&lt;/strong&gt; and I love it. However, it will always be limited by scalability. for every $1 in existence there needs to be &amp;gt;$1 locked. This is the fundamental limitation of all commodity backed currencies, they cannot expand to satisfy real market demand for them. By that virtue there will never be enough of it to go around and facilitate commerce. Not to mention DAI are currently 50% backed by USDC, nulling the decentralized story, but I heard they are fixing this.&lt;/p&gt;\n\n&lt;h1&gt;How Terra the centralization and scalability:&lt;/h1&gt;\n\n&lt;p&gt;Terra stablecoins are native assets of the blockchain. They can even be used to pay gas fees on the blockchain (think of it as paying for Ethereum gas fees with stablecoins instead of ETH). These stablecoins are &lt;strong&gt;fully decentralized, trustless, and censorship resistant&lt;/strong&gt;. They are native assets of Terra and thus are fully protected by the decentralization of the terra blockchain.&lt;/p&gt;\n\n&lt;p&gt;Terra stablecoins are also not limited to one blockchain. They can easily be sent to other blockchains so users can enjoy decentralized stability in whatever blockchain they desire. Right now you can use UST (Terra USD stablecoin) on Solana, Ethereum, Harmony, BSC and soon all of the cosmos blockchains.&lt;/p&gt;\n\n&lt;p&gt;Terra is a SERVICE blockchain ready to serve the entire cryptocurrency world.&lt;/p&gt;\n\n&lt;p&gt;Finally, Terra stablecoins can expand rapidly and without bounds to meet the needs of the economy. If there is a lot of demand for dollars, more stablecoins can be minted, if not they are burned to meet demand.&lt;/p&gt;\n\n&lt;p&gt;Thus Terra fixes the centralization issue of stablecoins and the scalability issue of DAI.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;An algorithmic stablecoin that works.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;h1&gt;How TerraStables keep their peg, how your funds are safe. Terra vs Iron/Titan:&lt;/h1&gt;\n\n&lt;p&gt;Luna is the native token of the terra blockchain. $1 worth of Luna can be burned to mint $1 UST. $1 UST is burned to mint $1 worth of Luna. Since the blockchain will always gives you the equivalent amount of Luna for a stablecoin arbitrageurs maintain the price of Stablecoins if the deviate from its peg.&lt;/p&gt;\n\n&lt;p&gt;Example:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;UST is valued at $1.05 on Binance: You buy $1 worth of Luna and then burn that Luna for 1UST. Then you can go sell that UST on Binance and receive $1.05. You earned 5% and by creating sell pressure on UST it goes back down to be worth $1.&lt;/li&gt;\n&lt;li&gt;UST is valued at $0.95 on Binance. You buy 1UST for $0.95. You burn that UST for $1 worth of Luna. You sell that Luna for $1. You just made $0.05. Creating buy pressure on UST taking it up to its $1 peg.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;The astute among you would note that the second scenario puts sell pressure on Luna and only works if there is demand for LUNA. That&amp;#39;s true. Without buy pressure on Luna you cannot sell $1 worth of Luna. And if Luna is valued too low more and more is minted infinitely and you end up like Titan.&lt;/p&gt;\n\n&lt;p&gt;These are why there will always be demand for LUNA:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Unlike most proof of stake blockchains, &lt;strong&gt;validator rewards on terra do not come from inflation&lt;/strong&gt;, rather they are 100% from transaction fees. These fees can be pain in either Luna or Terra. So regardless of the price of Luna, validators are getting paid a constant stream of Luna/or stablecoins depending in whatever users decide to pay fees with.&lt;/li&gt;\n&lt;li&gt;These transaction fees alone make it so that purchasing Luna and staking is a profitable endeavor. If Luna price collapses, there will be buy pressure from all the people that understand Luna and buy Luna to stake and makes huge amounts of money from transaction fees. Assume the worst case scenario, like Titan everyone apes out of the Terra applications and the price of Luna collapses. In that case Luna price can still not drop since validators will take that opportunity to buy Luna to get dividends from transaction fees.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;In conclusion the most important thing to allow Terra stablecoins to keep their peg is activity on the terra blockchain.&lt;/p&gt;\n\n&lt;h1&gt;UST Lost Its Peg During May Crash?&lt;/h1&gt;\n\n&lt;p&gt;When I get to this point in the explanation, DYOR users will point out that UST &lt;strong&gt;lost it&amp;#39;s peg for 5 days dipping down to $0.93&lt;/strong&gt; when all cryptos crashed in May. For security reasons the amount of Luna that can be minted/burned per day should be less than liquidity off-chain (binance, kucoin, ethereum, etc).&lt;/p&gt;\n\n&lt;p&gt;From January to May, UST went from a few millions to $2b market cap. The liquidity off chain was thus $2B but the amount of Luna that can be burned/minted was not adjusted for this. So when UST went bellow $1 not enough UST could be burned per day to arbitrage the price difference. This value has since been increased to reflect the fact that UST is now $10b market cap.&lt;/p&gt;\n\n&lt;h1&gt;What&amp;#39;s in Terra Ecosystem?&lt;/h1&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Anchor Protocol:&lt;/strong&gt; Stable 19.5% YIELD for stablecoin deposits. This beats Aave, Celsius, Blockfi, and yes, your bank.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;But how?! Anchor only allows staking assets as collateral. Interest from borrowers + Staking collateral yield = 20% +- (some range). When the financial gain is &amp;gt;20% the protocol gives out 20% to depositors and saves the rest in the reserve rainy day fund. When people arent borrowing it taps from reserve to pay out 20%. Currently reserve is $66M and growing.&lt;/p&gt;\n\n&lt;p&gt;You can buy insurance from 3 companies for smart contract risk. and 1 company offers bundle smart contract+peg insurance.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/5r0q7iahz7381.png?width=846&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=7534deb960ace7178cf43645e8eea12b7b1bc7ea\"&gt;https://preview.redd.it/5r0q7iahz7381.png?width=846&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=7534deb960ace7178cf43645e8eea12b7b1bc7ea&lt;/a&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Mirror Protocol:&lt;/strong&gt; Invest on real world stocks like Amazon, S&amp;amp;P500, Netflix, Apple, Gamestop... You can buy these stocks to invest, or short them to make wallstreetbets proud. You can also join the safest Liquidity Pools on Crypto. With LP you always risk on of the two assets&amp;#39; price dropping, but here you are betting on world class company stock which won&amp;#39;t be going to zero anytime soon.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/54kj1dn678381.png?width=833&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=66eb5fe2a10a5f55ba6889197257067058095531\"&gt;https://preview.redd.it/54kj1dn678381.png?width=833&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=66eb5fe2a10a5f55ba6889197257067058095531&lt;/a&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Pylon Protocol:&lt;/strong&gt; So you enjoy aping your money into new projects? Well Pylon let&amp;#39;s you do lossless investments. Instead of paying $100 for a new coin, it lets you deposit money into Anchor Protocol and use the gains to buy new project coins. It will also allow you to pay for subscriptions (thing Netflix membership) by paying with yield instead of your principal. Imagine renting a car and getting all your money back at the end of the rental.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/cvxtfsx878381.png?width=846&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=e8d6082d91b28538bb6bf9f97773de6d83a4d83c\"&gt;https://preview.redd.it/cvxtfsx878381.png?width=846&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=e8d6082d91b28538bb6bf9f97773de6d83a4d83c&lt;/a&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Upcoming you should look into: Astroport and Mars protocol&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Terra achieved 5B total value locked with just 10 dApps. That says a lot of the quality of each of them.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/r7m6s1/terra_luna_for_beginners_terra_is_an_ecosystem_of/",
  "subreddit": "CryptoCurrency",
  "id": "r7m6s1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Source: terraluna subreddit\n[https://np.reddit.com/r/terraluna/comments/p8m4s1/terra_is_an_ecosystem_of_stablecoins_and_this_is/]\n\nThe thesis of this post is: Decentralized finance deserves decentralized\nstablecoin. And why Terra has solved this problem. Terra stablecoins are a\nservice that meets…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "出典：テラルーナサブレディット\n[https://np.reddit.com/r/terraluna/comments/p8m4s1/terra_is_an_ecosystem_of_stablecoins_and_this_is/]\n\nこの投稿のテーゼは 分散型金融は分散型に値する。\n安定したコインです。そして、なぜTerraがこの問題を解決したのか。Terraのステーブルコインは\n満たすサービス...",
      "title": "初心者のためのテラ（LUNA）。Terraは安定したコインのエコシステムであり、これがすべての暗号にとって重要な理由です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "来源：terraluna subreddit\n[https://np.reddit.com/r/terraluna/comments/p8m4s1/terra_is_an_ecosystem_of_stablecoins_and_this_is/]\n\n这个帖子的论题是。去中心化的金融需要去中心化的\n稳定币。以及为什么Terra已经解决了这个问题。Terra稳定币是一种\n服务，可以满足...",
      "title": "面向初学者的Terra（LUNA）。Terra是一个稳定币的生态系统，这就是为什么它对所有的加密货币都很重要。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "來源：terraluna subreddit\n[https://np.reddit.com/r/terraluna/comments/p8m4s1/terra_is_an_ecosystem_of_stablecoins_and_this_is/]\n\n這個帖子的論題是。去中心化的金融需要去中心化的\n穩定幣。以及爲什麼Terra已經解決了這個問題。Terra穩定幣是一種\n服務，可以滿足...",
      "title": "面向初學者的Terra（LUNA）。Terra是一個穩定幣的生態系統，這就是爲什麼它對所有的加密貨幣都很重要。"
    }
  ]
}