{
  "author": "StickyGrenade",
  "original_created_utc": 1632547172,
  "title": "Hey fellas, so, I'm from China, and I was wondering ,will I get into trouble for buying bitcoins on localbitcoin.com?",
  "created_utc": 1632594728,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The thing is, I have verified my identity and they have my ID information. With this China thing going on, I&#39;m starting to worry , will localbitcoin  sell out my information and get me in trouble? Are there any security measures I should take and is it ok I buy from there? Am I looking for trouble just with this post?</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/Bitcoin/comments/pv0cko/hey_fellas_so_im_from_china_and_i_was_wondering/",
  "subreddit": "Bitcoin",
  "id": "pv0cko",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The thing is, I have verified my identity and they have my ID information. With\nthis China thing going on, I'm starting to worry , will localbitcoin sell out my\ninformation and get me in trouble? Are there any security measures I should take\nand is it ok I buy from there? Am I looking for trouble…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は本人確認をしており、彼らは私のID情報を持っているということです。このような\nlocalbitcoinが私の情報を売って、私に迷惑をかけるのではないかと心配になってきました。\n私の情報が売られてトラブルになるのではないかと心配になってきました。何かセキュリティ対策が必要なのでしょうか？\nまた、そこから購入しても大丈夫なのでしょうか？私はトラブルを探しているのでしょうか...。",
      "title": "私は中国から来たのですが、localbitcoin.comでビットコインを購入するとトラブルになるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "问题是，我已经验证了我的身份，他们有我的身份证信息。随着\n中国的事情，我开始担心，localbitcoin会不会出卖我的\n信息并让我陷入麻烦？有什么安全措施是我应该采取的吗？\n我从那里买东西可以吗？我是不是在找麻烦...",
      "title": "嘿，伙计们，我来自中国，我想知道，我在localbitcoin.com上购买比特币会不会惹上麻烦？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "問題是，我已經驗證了我的身份，他們有我的身份證信息。隨着\n中國的事情，我開始擔心，localbitcoin會不會出賣我的\n信息並讓我陷入麻煩？有什麼安全措施是我應該採取的嗎？\n我從那裏買東西可以嗎？我是不是在找麻煩...",
      "title": "嘿，夥計們，我來自中國，我想知道，我在localbitcoin.com上購買比特幣會不會惹上麻煩？"
    }
  ]
}