{
  "author": "cuervo_gris",
  "the_new_excerpt": "Yesterday, there was a post on r/cryptocurrency [/r/cryptocurrency] about\nsomeone that killed himself after being liquidated in the big dip. Please guys,\ndon't worry and don't be hard on yourself, you just made a mistake, use it to\nlearn from it. Try to learn about the technology and the history of…",
  "original_created_utc": 1621521854,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日、r/cryptocurrency [/r/cryptocurrency]に、以下のような投稿がありました。\n大きなディップで清算された後に自殺した人がいました。頼むよ、みんな。\n皆さん、心配しないで、自分を責めないで、ただミスをしただけだから、それを使って\nそこから学びましょう。そのためには、技術や歴史を学ぶ必要があります...",
      "title": "パニックに陥ってしまった人、清算されてしまった人たちへ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨天，在r/cryptocurrency[/r/cryptocurrency]上有一个帖子，关于\n有人在大跌中被清算后自杀了。请大家注意。\n不要担心，也不要为难自己，你只是犯了一个错误，用它来\n从中学习。试着了解一下技术和历史。",
      "title": "致所有恐慌性出售或被清算的人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨天，在r/cryptocurrency[/r/cryptocurrency]上有一個帖子，關於\n有人在大跌中被清算後自殺了。請大家注意。\n不要擔心，也不要爲難自己，你只是犯了一個錯誤，用它來\n從中學習。試着瞭解一下技術和歷史。",
      "title": "致所有恐慌性出售或被清算的人"
    }
  ],
  "title": "To all those who panic sold or got liquidated",
  "created_utc": 1621564582,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yesterday, there was a post on <a href=\"/r/cryptocurrency\">r/cryptocurrency</a> about someone that killed himself after being liquidated in the big dip. Please guys, don&#39;t worry and don&#39;t be hard on yourself, you just made a mistake, use it to learn from it. Try to learn about the technology and the history of bitcoin and why it is better than the current system. Yes, most of us are here because of the money, not because we want to be rich as soon as possible (not gonna lie, it would be amazing), but because we believe that the current financial system is screwed and it&#39;s just a matter of time before it collapses, at least to me this belief is what makes me HODL.</p>\n\n<p>So once again, don&#39;t be hard on yourself, money comes and go but your life is precious and unique. If you are having problems please reach to someone, hell even I can talk with you if you need it.</p>\n\n<p>Be careful with your investment and don&#39;t invest more than what you can afford to lose, and please don&#39;t use leverage!</p>\n</div><!-- SC_ON -->",
  "score": 266,
  "permalink": "/r/Bitcoin/comments/nh22km/to_all_those_who_panic_sold_or_got_liquidated/",
  "subreddit": "Bitcoin",
  "id": "nh22km",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197378396
}