{
  "author": "adamdmn",
  "original_created_utc": 1635259017,
  "title": "Moon distribution is soon and Reddit is giving us Moon Mainnet release hopium, so don’t forget to Hodl your Moons for a +20% bonus in the next distribution",
  "created_utc": 1635273052,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone,</p>\n\n<p>I know OGs already know that tip but many new people don’t know yet that every month, you got +20% on the distributed moons if you hodled and didn’t touch your moons during the previous month!</p>\n\n<p>And for the ones who don’t know how to get moons, you have to open your vault on the reddit app and you’ll get moons by receiving upvotes on your posts and comments in <a href=\"/r/cryptocurrency\">r/cryptocurrency</a>, it’s as simple as that!</p>\n\n<p>Hoping you’ll all get lots of moons and a great moon’s price rise! </p>\n\n<p>And remember, every day, Mainnet is closer than it’s ever been\nGod bless :)</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/qg7sdu/moon_distribution_is_soon_and_reddit_is_giving_us/",
  "subreddit": "CryptoCurrency",
  "id": "qg7sdu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello everyone,\n\nI know OGs already know that tip but many new people don’t know yet that every\nmonth, you got +20% on the distributed moons if you hodled and didn’t touch your\nmoons during the previous month!\n\nAnd for the ones who don’t know how to get moons, you have to open your vault on\nthe…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\nOGの皆さんは既にご存知だと思いますが、新規の方はまだご存じない方も多いと思います。\n毎月、前月に自分のムーンに触れずにホーディングした場合、配布されたムーンに+20%されます。\n配布された月のうち、前月に自分の月を触らずにホーディングしていた人は、その月に配布された月に+20%されます\n\nムーンの入手方法を知らない人のために説明しますと、前月に金庫を開けて\nのですが",
      "title": "ムーンの配布はもうすぐで、Redditではムーンのメインネットのリリースに期待しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n我知道OG已经知道这个提示，但许多新人还不知道，每个月\n月，如果你在上个月没有碰过你的月球，你就可以在分发的月球上得到+20%的奖励。\n月亮！如果你在上个月没有碰过你的月亮，你就可以在分发的月亮上得到20%的奖励。\n\n对于那些不知道如何获得月亮的人来说，你必须打开你的金库在\n在......\"。",
      "title": "月球发行即将到来，Reddit给了我们月球主网发行的希望，所以不要忘记Hodl你的月球，以便在下一次发行中获得+20%的奖励。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n我知道OG已經知道這個提示，但許多新人還不知道，每個月\n月，如果你在上個月沒有碰過你的月球，你就可以在分發的月球上得到+20%的獎勵。\n月亮！如果你在上個月沒有碰過你的月亮，你就可以在分發的月亮上得到20%的獎勵。\n\n對於那些不知道如何獲得月亮的人來說，你必須打開你的金庫在\n在......\"。",
      "title": "月球發行即將到來，Reddit給了我們月球主網發行的希望，所以不要忘記Hodl你的月球，以便在下一次發行中獲得+20%的獎勵。"
    }
  ]
}