{
  "author": "NegotiationKindly348",
  "original_created_utc": 1654543338,
  "title": "was what happened to me rape?",
  "created_utc": 1654556806,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Please tell me i&amp;#39;m not crazy and that what happened is fucked up, i was always upfront to my ex that i did not want to have sex and will remain a virgin till marriage. I don&amp;#39;t judge people for that but its just my personal choice. I just turned 20 and during the entire rs he would constantly ask me to do it with him and i always said no and explained to him the reasons why so it was a pretty well known fact in our rs and he knew damn well that i never wanted to have sex. One night we got pretty drunk and it just happened, i was so so drunk and we were in bed and he tried to put it in, i told him it hurts and briefly remember saying stop. But he still continued! All i remember from that night was the pain and just saying ouch the whole time and him saying shhh And thats the worst part that i barely even remembered us having sex. The next morning he acted like nothing happened. He blamed it on him being drunk as well but like even when i was sober he knew i would 100% say no and he knew how important this decision is for me. Looking back it should have been a red flag that he constantly asked me to have sex when he should have respected my decision and stopped trying. When i confronted him he made me feel crazy and i just feel taken advantage of in my most vulnerable state. Any advice would be helpful i feel so sad.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/TooAfraidToAsk/comments/v6bcja/was_what_happened_to_me_rape/",
  "subreddit": "TooAfraidToAsk",
  "id": "v6bcja",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Please tell me i'm not crazy and that what happened is fucked up, i was always\nupfront to my ex that i did not want to have sex and will remain a virgin till\nmarriage. I don't judge people for that but its just my personal choice. I just\nturned 20 and during the entire rs he would constantly ask me…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は狂っていないと言ってください、そして、起こったことはめちゃくちゃです、私はいつも\n元彼には、セックスはしたくないし、結婚するまで処女でいるつもりだと率直に言っていました。\n結婚するまで処女でいるつもりです。私はそのことで人を批判したりはしませんが、それはあくまで私の個人的な選択です。私はちょうど\n20歳になったばかりで、その間ずっと彼は私に...",
      "title": "は、私に起きたことはレイプなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "请告诉我，我没有疯，所发生的一切都很糟糕，我总是\n我一直对我的前夫说我不想做爱，并且在结婚前都会保持处女身份。\n姻。我不会因此评判别人，但这只是我的个人选择。我刚刚\n我刚满20岁，在这段时间里，他不断问我......",
      "title": "发生在我身上的事情是强奸吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "請告訴我，我沒有瘋，所發生的一切都很糟糕，我總是\n我一直對我的前夫說我不想做愛，並且在結婚前都會保持處女身份。\n姻。我不會因此評判別人，但這只是我的個人選擇。我剛剛\n我剛滿20歲，在這段時間裏，他不斷問我......",
      "title": "發生在我身上的事情是強姦嗎？"
    }
  ]
}