{
  "author": "Dhugaill",
  "original_created_utc": 1624477498,
  "title": "Are we still looking for “lost” literature from Antiquity?",
  "created_utc": 1624509523,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was listening to a podcast today and the host was talking about how much literature from the past just doesn&#39;t exist anymore (Sulla wrote a memoir!), and I began to wonder if historians are still looking for this stuff? What are the chances that historians will find something like more of Polybius’ history, or the Cypria? Is this something that scholars are still actively looking into, or is it more of a case deeming these things “lost” until proven otherwise? Are there recent examples of something we thought was lost turning up?</p>\n</div><!-- SC_ON -->",
  "score": 140,
  "permalink": "/r/AskHistorians/comments/o6kdzs/are_we_still_looking_for_lost_literature_from/",
  "subreddit": "AskHistorians",
  "id": "o6kdzs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was listening to a podcast today and the host was talking about how much\nliterature from the past just doesn't exist anymore (Sulla wrote a memoir!), and\nI began to wonder if historians are still looking for this stuff? What are the\nchances that historians will find something like more of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、あるポッドキャストを聴いていたら、司会者が、過去の文学はもう存在しないという話をしていました。\n過去の文学はもう存在しない（スッラが回想録を書いた！）という話をしていました。\n私は、歴史家はまだこのようなものを探しているのだろうかと考え始めました。歴史家が\n歴史家がもっと...のようなものを見つけるチャンスはあるのでしょうか？",
      "title": "私たちはまだ古代の「失われた」文学を探しているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今天在听一个播客，主持人谈到了很多\n过去的文学作品已经不存在了（苏拉写了一本回忆录！），我开始怀疑历史学家是否还在寻找这些东西？\n我开始想，历史学家是否还在寻找这些东西？历史学家有多少机会\n历史学家找到更多类似......的东西的可能性有多大？",
      "title": "我们还在寻找古代的 \"失落 \"文学吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今天在聽一個播客，主持人談到了很多\n過去的文學作品已經不存在了（蘇拉寫了一本回憶錄！），我開始懷疑歷史學家是否還在尋找這些東西？\n我開始想，歷史學家是否還在尋找這些東西？歷史學家有多少機會\n歷史學家找到更多類似......的東西的可能性有多大？",
      "title": "我們還在尋找古代的 \"失落 \"文學嗎？"
    }
  ]
}