{
  "author": "Chicano_Ducky",
  "the_new_excerpt": "I realized that in reading this info about Aztec dream magic and how assassins\nused it to hurt others, I had no idea where exactly these Naguals existed in\nterms of their religious ideas. Was this dream world one of the 13 heavens or\nthe 9 hells? If not that, was it an entirely different plane of…",
  "original_created_utc": 1610591525,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我意识到，在阅读这些信息关于阿兹特克梦境魔法和刺客如何。\n用它来伤害别人，我不知道这些长老们到底存在于哪里，在。\n在他们的宗教观念方面。这个梦境是十三重天中的一个还是\n九重地狱？如果不是这样，那是不是一个完全不同层面的... ...",
      "title": "阿兹特克人相信，当你睡觉的时候，你的一部分灵魂离开了你的身体，作为一个Nagual存在于梦境中，如果这个Nagual受到了伤害，你就会在现实生活中受到伤害。这个灵魂在睡眠中到底去了哪里？在他们的宗教中，这个梦境世界存在于哪里？十三重天之一？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我意識到，在閱讀這些信息關於阿茲特克夢境魔法和刺客如何。\n用它來傷害別人，我不知道這些長老們到底存在於哪裏，在。\n在他們的宗教觀念方面。這個夢境是十三重天中的一個還是\n九重地獄？如果不是這樣，那是不是一個完全不同層面的... ...",
      "title": "阿茲特克人相信，當你睡覺的時候，你的一部分靈魂離開了你的身體，作爲一個Nagual存在於夢境中，如果這個Nagual受到了傷害，你就會在現實生活中受到傷害。這個靈魂在睡眠中到底去了哪裏？在他們的宗教中，這個夢境世界存在於哪裏？十三重天之一？"
    }
  ],
  "title": "The Aztecs believed that part of your soul left your body when you slept, and existed in the dream world as a Nagual, if that Nagual got hurt you would be hurt in real life. Where exactly did this soul go during sleep? Where did this dream world exist within their religion? One of the 13 heavens?",
  "created_utc": 1610644790,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I realized that in reading this info about Aztec dream magic and how assassins used it to hurt others, I had no idea where exactly these Naguals existed in terms of their religious ideas. Was this dream world one of the 13 heavens or the 9 hells? If not that, was it an entirely different plane of existence?</p>\n\n<p>To make things more confusing, the mind-soul that went to the dream world was supposedly given to humanity by itself during birth rituals to welcome it into the world (since Ometeotl giving out souls in batches apparently isn&#39;t an Aztec thing), which makes the concept of a dream world even more confusing because it implies this portion of the soul doesn&#39;t come from the gods.</p>\n\n<p>Can anyone explain this part?</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/kwwa5g/the_aztecs_believed_that_part_of_your_soul_left/",
  "subreddit": "AskHistorians",
  "id": "kwwa5g",
  "is_self": true,
  "media": null,
  "is_video": false
}