{
  "author": "Soggy_Pin8799",
  "original_created_utc": 1645640190,
  "title": "Some people still don’t realize that these NFT that cost millions are being sold by the same person back to himself.",
  "created_utc": 1645727599,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;People seriously don’t realize that the vast majority of these NFTs are artificially overpriced by the owners himself who goes ahead and sells it to, you guess it, himself again.&lt;/p&gt;\n\n&lt;p&gt;The reason is simply to raise more hype around the NFT making it more desirable to attain.&lt;/p&gt;\n\n&lt;p&gt;It’s such a shame how the NFT market got this bad reputation cause of people like these.&lt;/p&gt;\n\n&lt;p&gt;That money would have been much better off invested into DeFi based projects like Curve or even bitDAO considering how much its improving the DeFi and Web3 scene.&lt;/p&gt;\n\n&lt;p&gt;I wish people saw NFTs for the useful and utilitarian technology that it actually is instead of million dollars JPEGs.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 304,
  "permalink": "/r/CryptoCurrency/comments/szo0b6/some_people_still_dont_realize_that_these_nft/",
  "subreddit": "CryptoCurrency",
  "id": "szo0b6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "People seriously don’t realize that the vast majority of these NFTs are\nartificially overpriced by the owners himself who goes ahead and sells it to,\nyou guess it, himself again.\n\nThe reason is simply to raise more hype around the NFT making it more desirable\nto attain.\n\nIt’s such a shame how the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この手のNFTの大半は、マジで気づいてないんだろうな。\nオーナー自身が人為的に高値をつけ、それを売りつける。\nまた自分自身か。\n\nその理由は、NFTをより誇大宣伝して、より魅力的なものにするためです。\nを獲得することができます。\n\nとても残念なことですが...。",
      "title": "この何百万もするNFTが、同一人物によって自分に売り戻されていることにまだ気づいていない人がいるのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "人们真的没有意识到，这些NFT的绝大多数都是\n业主自己人为地抬高价格，然后再把它卖给。\n你猜对了，又是他自己。\n\n原因很简单，就是要围绕国家信托基金进行更多的炒作，使其更有吸引力\n以达到目的。\n\n这真是一个耻辱，因为...",
      "title": "有些人仍然没有意识到，这些花费数百万的NFT被同一个人卖回给自己。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們真的沒有意識到，這些NFT的絕大多數都是\n業主自己人爲地抬高價格，然後再把它賣給。\n你猜對了，又是他自己。\n\n原因很簡單，就是要圍繞國家信託基金進行更多的炒作，使其更有吸引力\n以達到目的。\n\n這真是一個恥辱，因爲...",
      "title": "有些人仍然沒有意識到，這些花費數百萬的NFT被同一個人賣回給自己。"
    }
  ]
}