{
  "author": "pineappleprincess92",
  "original_created_utc": 1655258687,
  "title": "Will shortages and super high prices ever end? What happens when prices just get too high?",
  "created_utc": 1655267244,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Mostly questions are in the title. I have major anxiety (and also feel silly asking but this seems like the place to do it) and lately it looks like everything is either on a shortage or triple the price and everyone says it’ll only get worse. How bad can it realistically get and what can people do to make sure we can still get by? Budgeting only gets so far if gas ends up costing $15 a gallon and eggs cost $600 or something. Is there ever going to be an end to the price gouging?&lt;/p&gt;\n\n&lt;p&gt;I’d be happy with resources to read too, to get a more realistic picture that isn’t sensationalized and gives tips on how to prepare. I’m guilty of seeing headlines and panicking :(&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 173,
  "permalink": "/r/TooAfraidToAsk/comments/vcjja5/will_shortages_and_super_high_prices_ever_end/",
  "subreddit": "TooAfraidToAsk",
  "id": "vcjja5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Mostly questions are in the title. I have major anxiety (and also feel silly\nasking but this seems like the place to do it) and lately it looks like\neverything is either on a shortage or triple the price and everyone says it’ll\nonly get worse. How bad can it realistically get and what can people do…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "質問はほとんどタイトルにあります。私は大きな不安を抱えており（また、聞くのも馬鹿らしいのですが\nのですが、このような場で質問するのもどうかと思います。\nっているように見えます。\n悪くなる一方だと言っています。現実的にどのくらい悪くなるのか、みんなどうしたらいいのか...。",
      "title": "品薄と超高価格は解消されるのか？価格が高くなりすぎるとどうなるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大部分问题都在标题中。我有严重的焦虑症（也觉得自己很傻\n但这似乎是做这个的地方），而最近看起来\n最近，似乎所有的东西要么短缺，要么价格翻了三倍，而且大家都说情况只会越来越糟。\n只会变得更糟。现实中情况会有多糟，人们可以做什么？",
      "title": "短缺和超高的价格是否会结束？当价格太高时会发生什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大部分問題都在標題中。我有嚴重的焦慮症（也覺得自己很傻\n但這似乎是做這個的地方），而最近看起來\n最近，似乎所有的東西要麼短缺，要麼價格翻了三倍，而且大家都說情況只會越來越糟。\n只會變得更糟。現實中情況會有多糟，人們可以做什麼？",
      "title": "短缺和超高的價格是否會結束？當價格太高時會發生什麼？"
    }
  ]
}