{
  "author": "KAX1107",
  "original_created_utc": 1647702671,
  "title": "9 years ago today, Hal Finney made one of his last ever posts: “Bitcoin and me (Hal Finney)”. It's a must read.",
  "created_utc": 1647725930,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hal Finney shared the following post on March 19, 2013. Every time I read it, I end up crying. Hal was paralyzed by this time and he was typing this message using an eye-tracking device.&lt;/p&gt;\n\n&lt;p&gt;“I thought I&amp;#39;d write about the last four years, an eventful time for Bitcoin and me.  &lt;/p&gt;\n\n&lt;p&gt;For those who don&amp;#39;t know me, I&amp;#39;m Hal Finney. I got my start in crypto working on an early version of PGP, working closely with Phil Zimmermann. When Phil decided to start PGP Corporation, I was one of the first hires. I would work on PGP until my retirement. At the same time, I got involved with the Cypherpunks. I ran the first cryptographically based anonymous remailer, among other activities.  &lt;/p&gt;\n\n&lt;p&gt;Fast forward to late 2008 and the announcement of Bitcoin. I&amp;#39;ve noticed that cryptographic graybeards (I was in my mid 50&amp;#39;s) tend to get cynical. I was more idealistic; I have always loved crypto, the mystery and the paradox of it.  &lt;/p&gt;\n\n&lt;p&gt;When Satoshi announced Bitcoin on the cryptography mailing list, he got a skeptical reception at best. Cryptographers have seen too many grand schemes by clueless noobs. They tend to have a knee jerk reaction.  &lt;/p&gt;\n\n&lt;p&gt;I was more positive. I had long been interested in cryptographic payment schemes. Plus I was lucky enough to meet and extensively correspond with both Wei Dai and Nick Szabo, generally acknowledged to have created ideas that would be realized with Bitcoin. I had made an attempt to create my own proof of work based currency, called RPOW. So I found Bitcoin facinating.  &lt;/p&gt;\n\n&lt;p&gt;When Satoshi announced the first release of the software, I grabbed it right away. I think I was the first person besides Satoshi to run bitcoin. I mined block 70-something, and I was the recipient of the first bitcoin transaction, when Satoshi sent ten coins to me as a test. I carried on an email conversation with Satoshi over the next few days, mostly me reporting bugs and him fixing them.  &lt;/p&gt;\n\n&lt;p&gt;Today, Satoshi&amp;#39;s true identity has become a mystery. But at the time, I thought I was dealing with a young man of Japanese ancestry who was very smart and sincere. I&amp;#39;ve had the good fortune to know many brilliant people over the course of my life, so I recognize the signs.  &lt;/p&gt;\n\n&lt;p&gt;After a few days, bitcoin was running pretty stably, so I left it running. Those were the days when difficulty was 1, and you could find blocks with a CPU, not even a GPU. I mined several blocks over the next days. But I turned it off because it made my computer run hot, and the fan noise bothered me. In retrospect, I wish I had kept it up longer, but on the other hand I was extraordinarily lucky to be there at the beginning. It&amp;#39;s one of those glass half full half empty things.  &lt;/p&gt;\n\n&lt;p&gt;The next I heard of Bitcoin was late 2010, when I was surprised to find that it was not only still going, bitcoins actually had monetary value. I dusted off my old wallet, and was relieved to discover that my bitcoins were still there. As the price climbed up to real money, I transferred the coins into an offline wallet, where hopefully they&amp;#39;ll be worth something to my heirs.  &lt;/p&gt;\n\n&lt;p&gt;Speaking of heirs, I got a surprise in 2009, when I was suddenly diagnosed with a fatal disease. I was in the best shape of my life at the start of that year, I&amp;#39;d lost a lot of weight and taken up distance running. I&amp;#39;d run several half marathons, and I was starting to train for a full marathon. I worked my way up to 20+ mile runs, and I thought I was all set. That&amp;#39;s when everything went wrong.  &lt;/p&gt;\n\n&lt;p&gt;My body began to fail. I slurred my speech, lost strength in my hands, and my legs were slow to recover. In August, 2009, I was given the diagnosis of ALS, also called Lou Gehrig&amp;#39;s disease, after the famous baseball player who got it.  &lt;/p&gt;\n\n&lt;p&gt;ALS is a disease that kills moter neurons, which carry signals from the brain to the muscles. It causes first weakness, then gradually increasing paralysis. It is usually fatal in 2 to 5 years. My symptoms were mild at first and I continued to work, but fatigue and voice problems forced me to retire in early 2011. Since then the disease has continued its inexorable progression.  &lt;/p&gt;\n\n&lt;p&gt;Today, I am essentially paralyzed. I am fed through a tube, and my breathing is assisted through another tube. I operate the computer using a commercial eyetracker system. It also has a speech synthesizer, so this is my voice now. I spend all day in my power wheelchair. I worked up an interface using an arduino so that I can adjust my wheelchair&amp;#39;s position using my eyes.  &lt;/p&gt;\n\n&lt;p&gt;It has been an adjustment, but my life is not too bad. I can still read, listen to music, and watch TV and movies. I recently discovered that I can even write code. It&amp;#39;s very slow, probably 50 times slower than I was before. But I still love programming and it gives me goals. Currently I&amp;#39;m working on something Mike Hearn suggested, using the security features of modern processors, designed to support &amp;quot;Trusted Computing&amp;quot;, to harden Bitcoin wallets. It&amp;#39;s almost ready to release. I just have to do the documentation.  &lt;/p&gt;\n\n&lt;p&gt;And of course the price gyrations of bitcoins are entertaining to me. I have skin in the game. But I came by my bitcoins through luck, with little credit to me. I lived through the crash of 2011. So I&amp;#39;ve seen it before. Easy come, easy go.  &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s my story. I&amp;#39;m pretty lucky overall. Even with the ALS, my life is very satisfying. But my life expectancy is limited. Those discussions about inheriting your bitcoins are of more than academic interest. My bitcoins are stored in our safe deposit box, and my son and daughter are tech savvy. I think they&amp;#39;re safe enough. I&amp;#39;m comfortable with my legacy.”&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 344,
  "permalink": "/r/CryptoCurrency/comments/thx7x3/9_years_ago_today_hal_finney_made_one_of_his_last/",
  "subreddit": "CryptoCurrency",
  "id": "thx7x3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hal Finney shared the following post on March 19, 2013. Every time I read it, I\nend up crying. Hal was paralyzed by this time and he was typing this message\nusing an eye-tracking device.\n\n“I thought I'd write about the last four years, an eventful time for Bitcoin and\nme.\n\nFor those who don't know…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ハル・フィニー氏は、2013年3月19日に以下の投稿をシェアしました。これを読むたびに、私は\n泣いてしまう。ハルはこの時、半身不随でこのメッセージを打っていました。\n視線追跡装置を使って\n\n\"この4年間、ビットコインにとって波乱万丈だったことを書こうと思い\n私です。\n\nご存じない方のために・・・。",
      "title": "9年前の今日、ハル・フィニーは彼の最後の投稿を行った。「ビットコインと私（Hal Finney）」。これは必読の記事です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "哈尔-芬尼在2013年3月19日分享了以下帖子。每当我读到这篇文章时，我\n最后都会哭起来。哈尔这时已经瘫痪了，他在打这个消息的时候\n使用一个眼球追踪设备。\n\n\"我想我应该写一写过去的四年，对比特币和我来说是一个多事之秋。\n我。\n\n对于那些不知道的人来说...",
      "title": "9年前的今天，哈尔-芬尼发表了他最后的一篇文章。\"比特币和我（Hal Finney）\"。这是一篇必须阅读的文章。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "哈爾-芬尼在2013年3月19日分享了以下帖子。每當我讀到這篇文章時，我\n最後都會哭起來。哈爾這時已經癱瘓了，他在打這個消息的時候\n使用一個眼球追蹤設備。\n\n\"我想我應該寫一寫過去的四年，對比特幣和我來說是一個多事之秋。\n我。\n\n對於那些不知道的人來說...",
      "title": "9年前的今天，哈爾-芬尼發表了他最後的一篇文章。\"比特幣和我（Hal Finney）\"。這是一篇必須閱讀的文章。"
    }
  ]
}