{
  "author": "whomp1970",
  "original_created_utc": 1645032980,
  "title": "Where's the AskReddit for grown-ups? I can't be the only one sick and tired of all the 12-year old maturity level sex questions.",
  "created_utc": 1645041477,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m tired of all the joke questions, like:&lt;br/&gt;\n&amp;quot;People who don&amp;#39;t use your blinkers, why are you evil?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m tired of all the absolutely stupid ones, like:&lt;br/&gt;\n&amp;quot;You&amp;#39;ve been transported six feet to your left, how fucked are you?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m tired of all the sex-related questions that you &lt;em&gt;just know&lt;/em&gt; came from some tween boy who&amp;#39;s hoping to get off on some of the answers.  Or some adult who&amp;#39;s never matured beyond middle school.&lt;/p&gt;\n\n&lt;p&gt;So WHERE IS THE ASKREDDIT FOR GROWNUPS?&lt;/p&gt;\n\n&lt;p&gt;Where&amp;#39;s the sub that operates like AskReddit but has a higher maturity level, with a community that really does have genuine curiosity about interesting topics?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 144,
  "permalink": "/r/NoStupidQuestions/comments/su1n5j/wheres_the_askreddit_for_grownups_i_cant_be_the/",
  "subreddit": "NoStupidQuestions",
  "id": "su1n5j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm tired of all the joke questions, like:\n\"People who don't use your blinkers, why are you evil?\"\n\nI'm tired of all the absolutely stupid ones, like:\n\"You've been transported six feet to your left, how fucked are you?\"\n\nI'm tired of all the sex-related questions that you just know came from…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "みたいなふざけた質問ばかりでウンザリです。\n「ウインカーを出さない人は、なぜ悪者なのですか？」\n\nバカな質問にはうんざりだ\n\"あなたは6フィート左に移動しました\"\"あなたはどのようにファックしていますか？\"\n\nセックスに関連した質問もうんざりだ...",
      "title": "大人のためのAskRedditはどこにある？12歳の成熟度レベルのセックスの質問にうんざりしているのは僕だけではないはずだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经厌倦了所有的笑话问题，比如：\n\"不使用闪光灯的人，你为什么是坏人？\"\n\n我厌倦了所有绝对愚蠢的问题，例如：\n\"你被传送到了左边六英尺的地方，你有多惨？\"\n\n我厌倦了所有与性有关的问题，你只知道它们来自...",
      "title": "成年人的AskReddit在哪里？我不可能是唯一一个对所有12岁成熟度的性问题感到厌恶和厌倦的人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經厭倦了所有的笑話問題，比如：\n\"不使用閃光燈的人，你爲什麼是壞人？\"\n\n我厭倦了所有絕對愚蠢的問題，例如：\n\"你被傳送到了左邊六英尺的地方，你有多慘？\"\n\n我厭倦了所有與性有關的問題，你只知道它們來自...",
      "title": "成年人的AskReddit在哪裏？我不可能是唯一一個對所有12歲成熟度的性問題感到厭惡和厭倦的人。"
    }
  ]
}