{
  "author": "CryptoKeeper808",
  "original_created_utc": 1634319463,
  "title": "We Are Going To Witness The Biggest Movement In Crypto History During The 4th Quarter Of 2021",
  "created_utc": 1634351439,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The fact that BTC is about to reach a new ATH is very impressive to witness after all the FUD since May.  Kudos to those who held and bought more bags.  I&#39;m in that club, not one crypto coin sold and loaded my bags and damn proud of it!  </p>\n\n<p>Why I&#39;m bullish on the market for the remainder of the year and beyond?  Easy, BTC can hold its own and then some and is proven time and time again.  This is how mainstream adoption continues and crypto in general becomes more widely accepted.  I keep seeing crypto.com advertising for UFC, college football, car racing, it&#39;s everywhere!</p>\n\n<p>More and more businesses will adopt and encourage crypto.  Can you imagine the day an employer will ask if you want to get paid in crypto...that day will come.  We are just at the tip of the iceberg with so much more to come.  We will hit a new ATH tonight!!!</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/q8tekl/we_are_going_to_witness_the_biggest_movement_in/",
  "subreddit": "CryptoCurrency",
  "id": "q8tekl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The fact that BTC is about to reach a new ATH is very impressive to witness\nafter all the FUD since May. Kudos to those who held and bought more bags. I'm\nin that club, not one crypto coin sold and loaded my bags and damn proud of it!\n\nWhy I'm bullish on the market for the remainder of the year and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BTCが新たなATHに到達しようとしているという事実は、5月以降のFUDの後では非常に印象的です。\n5月以降のFUDの後では、非常に印象的です。ホールドして、さらにバッグを買った人たちに拍手を送ります。私は\n私もこのクラブに入っていますが、1つの暗号化コインも売らず、私のバッグを積んだことを誇りに思っています。\n\n私が今年の残りの市場に強気である理由と...",
      "title": "2021年第4四半期に暗号史上最大の動きを目撃することになるだろう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "BTC即将达到一个新的ATH的事实是非常令人印象深刻的见证\n在经历了5月以来所有的疑虑之后。为那些持有和购买更多袋子的人点赞。我是\n在这个俱乐部里，没有卖出一个加密货币，并装上了我的袋子，我为之感到自豪\n\n为什么我看好今年剩余时间的市场和...",
      "title": "我们将在2021年第四季度见证加密货币历史上最大的一次运动"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "BTC即將達到一個新的ATH的事實是非常令人印象深刻的見證\n在經歷了5月以來所有的疑慮之後。爲那些持有和購買更多袋子的人點贊。我是\n在這個俱樂部裏，沒有賣出一個加密貨幣，並裝上了我的袋子，我爲之感到自豪\n\n爲什麼我看好今年剩餘時間的市場和...",
      "title": "我們將在2021年第四季度見證加密貨幣歷史上最大的一次運動"
    }
  ]
}