{
  "author": "conspiracyshittank",
  "the_new_excerpt": "I wanted to create a post to document the market events/forces surrounding GME\nand why the buy restriction imposed by American Retail Brokers is disgusting\nmarket manipulation, not just affecting investors on their platforms but world\nwide. This is for educational purposes, so that we can have…",
  "original_created_utc": 1611884739,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我想创建一个帖子来记录围绕着GME的市场事件/力量。\n以及为什么美国散户经纪人实施的限购令令人厌恶？\n市场操纵，不仅影响到其平台上的投资者，而且影响到全球\n广。这是为了教育的目的，所以我们可以有... ...",
      "title": "ELI5：GameStop散户限购[教育]"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想創建一個帖子來記錄圍繞着GME的市場事件/力量。\n以及爲什麼美國散戶經紀人實施的限購令令人厭惡？\n市場操縱，不僅影響到其平臺上的投資者，而且影響到全球\n廣。這是爲了教育的目的，所以我們可以有... ...",
      "title": "ELI5：GameStop散戶限購[教育]"
    }
  ],
  "title": "ELI5: GameStop retail investor buy restriction [Educational]",
  "created_utc": 1611894994,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I wanted to create a post to document the market events/forces surrounding GME and why the buy restriction imposed by American Retail Brokers is disgusting market manipulation, not just affecting investors on their platforms but world wide. This is for educational purposes, so that we can have something to point to when explaining to others what transpired. Please add relevant information and post links to news articles as sources if you&#39;d like to contribute.</p>\n\n<p>GameStop is well known video game retailer that was suffering losses over the past several years, reducing its stock price as it was considered to have a failed business model. Several hedge funds want to profit on the company’s failure started shorting the stock.</p>\n\n<p>Short Selling ELI5: You think to yourself hey this stock is overvalued, so you borrow it from someone who owns it and sell it getting money today in the hope of buying it back at a later date at a cheaper price pocketing the difference (minus borrowing fees). Hedge funds are greedy, they will hold out until it goes to zero because why leave money on table.</p>\n\n<p>GME stock was heavily shorted, over 100% of the shares available. This means that the shares that were shorted, were shorted again. Everything is finite in this world, and hedge funds thought they had a sure thing that GameStop could not recover. The stock price stayed low and flat for a long time, but some investors saw value in the company, notably Ryan Cohen who started accumulating shares to develop a minority stake in the company. This also happened at the same time that GameStop signed a deal with Microsoft which included a cut of digital sales. When the media/analysts report that the price rise has nothing to do with fundamentals they are half right. First the media is looking at what the company is today not what it can be tomorrow. Secondly, they are ignoring other market forces that can drive stock prices.</p>\n\n<p>Cohen and MSFT are not enough to drive the price up in the short term, what is driving the price up was an amplifying feedback loop of an over shorted stock and retail investors learning a new trick. The year 2020 saw many things, including a rise in option trading among retail investors.</p>\n\n<p>Options ELI5: A Call option specifically is a contract that gives you the option to buy shares at a predetermined price (strike) at a future date (expiry). Options are not a new thing, been around for decades along with futures (do a quick read how many big investors hit home runs on futures back in the day). They serve a legit purpose in portfolio planning and risk management, but also have a way to supercharge returns because the initial investment can be small relative to large payoffs if the stock rises. However, options are risky as they will expire worthless if the stock is below the strike at expiry. Each option contract is for 100 shares. For example, if a stock is trading at $5 dollars, and you buy a call option with $10 strike prices which was trading at $0.50. Your investment will be $0.5 * 100 * 1 option = $50. Now if the stock goes up because of some market forces to $12, you basically made ($12-$10) * 100 = $200 - $50 for the initial investment = $150 profit. There are some time value effects but not important for the ELI5.</p>\n\n<p>Why do the options matter, and how does this create a feedback loop? The best way to protect yourself as the person who sold the option is to buy the stock. So, let&#39;s game play this out a bit, you don&#39;t think the stock is going to up so you sell an uncovered call (you don&#39;t already own the stock) laughing to yourself that the option is going to expire worthless and you just pocketed the premiums. However, the small up ticks from retail investors buying up stocks makes other retail investors think &quot;Hey theses options are cheap, and I think the stock is going to go up&quot; so they buy up options. Now enough of these &quot;worthless&quot; options are out in the market that just the sheer volume requires some stock purchases to hedge the risk. Which causes and uptick in the stock price. Which then drives up the hedging requirements. Rinse. Repeat. This is what was labelled on WSB as a Gamma Squeeze, as the stock price rose, more options became valuable, which increased stock buying, which increased the price making more options valuable. Limited Supply for increasing Demand.</p>\n\n<p>The Gamma Squeeze was one market force that drove up the price, the other is the the hedge funds that shorted the stock. As the price goes up, they are losing money, remember they were hoping to buy the stock back at a lower price, but now it is higher. As the loses start to increase, they will be hit with a margin call, basically saying &quot;you are in the red a bit too much ante up&quot;. Working through a simple example, you short $1m of stock. Now the value of the stock has gone up to $2m, so the people who you borrowed the stock from are going to say, &quot;how about you put up 50% of that just incase you go bankrupt&quot; (margin call) which now the hedge fund has to find that money by either selling other stocks or borrowing that money. The other option they have is to close out their short position by buying shares in the open market solidifying their losses. This large scale buying will further cause the stock price to rise, increasing the losses for other hedge funds. Limited Supply for increasing Demand.</p>\n\n<p>The price rise was just beautiful efficient supply and demand of a finite commodity in a free market, retail investors were saying no to hedge funds &quot;This company is not going zero, you were wrong, now you have to pay me for your mistake&quot;. This created fear of a &quot;short squeeze&quot; that hedge funds would have to franticly buy back shares (from retail investors) at high prices to close of their positions, losing billions in the process. This happened with VW stock in 2008.</p>\n\n<p>Jan 28th 2021 the market wasn&#39;t free. By brokers restricting the buying ability of retail investors, the market was no longer operating efficiently. Market prices are determined by a bunch of random people saying, &quot;Hey I&#39;m willing to pay X for this because I think it&#39;s worth Y&quot;, and when two people agree on price X a transaction is made. Another transaction will be made when two people agree on Y. The buying restriction took out the ability for retail investors to have their say what the price should be, having the price now dictated by the funds who were still allowed to trade and had the most to lose. Any investor who had stop loss set would have been doubly screwed. The stop loss would have forced shares to be sold, while not having the ability to buy back as the prices was falling. When investors set stop losses, they expect the market to be operating efficiently, meaning the price reflects the true market sentiment of all participants.</p>\n\n<p>Stop Loss ELI5: When you buy a stock, you can tell your broker that if the prices fall below a certain threshold sell, limiting your losses. Good practice so you do not get wiped out because you are not sitting at a trading desk all day. That is if the market price is efficient.</p>\n\n<p>I do not want to put my tinfoil hat on, but the ones who had the most to gain from the restriction were the hedge funds. This has nothing to do with protecting the average retail investor from market volatility, if anything it did more harm than good. We make our own decision to risk our money.</p>\n\n<p>Wall Street created this beast, trading apps made it easy to trade commission free but with some sketchy filling practices (not always at the best price for the investor). The rise of option trading by retail investors was due to people having more time on their hands due to the pandemic, and to be honest, people who are down and out looking at it as a lottery ticket.</p>\n\n<p>I fear that these events today will dissuade working class from investing, they have been shown that the game is rigged.</p>\n\n<p>That is all I have right now, if this post gains traction I will do my best to incorporate feedback.</p>\n</div><!-- SC_ON -->",
  "score": 239,
  "permalink": "/r/stocks/comments/l7fmk6/eli5_gamestop_retail_investor_buy_restriction/",
  "subreddit": "stocks",
  "id": "l7fmk6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518537958
}