{
  "author": "mygallows",
  "original_created_utc": 1632183453,
  "title": "Don’t panic sell; stick to the plan. You’ll be okay!",
  "created_utc": 1632223815,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey, everyone! </p>\n\n<p>Just wanted to make this quick post, in light of what’s going on with the market. </p>\n\n<p>(<strong>Take nothing I say in this discussion seriously, this is my all my own personal opinion. Do not assume this as any form of advice, DYOR</strong>)</p>\n\n<p>So unless you live in a pineapple under the sea, you’ll notice that the crypto market is a <em>little</em> red. Well, maybe that’s an understatement. But I don’t believe this is as low as we’ll go. Let me explain:</p>\n\n<p>I’ve read <strong>a lot</strong> of comments over the past 24 hours, (give a little), that we’re nothing but panic selling, and loosely saying that crypto is done for the year… here come the bears, etc…</p>\n\n<p>Now, this could be true. I’m not here to say it isn’t, although, <strong>I am</strong> here to tell you that this is where <em>real</em> money can be made. Wednesday 9:30pm EST, the Chinese markets will open here in Canada. I’m suspicious of an even bigger drop; unless Evergrande figures something out, but I highly doubt this will happen. </p>\n\n<p>Remember this: “<strong>Bull markets make you money; bear markets make you rich</strong>”.</p>\n\n<p>This is the perfect time to accumulate your bags. And if you’re unsure about buying right now, and you’re patiently waiting for the Chinese markets to open, (like me), just wait. We could see a sell off, or we could see a slow climb back to where we were before this dip. </p>\n\n<p>If you don’t have any available fiat, don’t sell your positions. You can’t lose if you don’t sell. Crypto and the technology behind it is going <strong>nowhere</strong>. We <strong>will</strong> see crypto make life changing moves again. Play the game long term, patience will bring virtue. This I can promise you, this is the one thing in this <strong>entire</strong> discussion I want you to take seriously.</p>\n\n<p>Stick to the plan.</p>\n\n<p>God bless you all,</p>\n\n<p>Gallows</p>\n\n<p>(<strong>Again, take nothing I say in this discussion seriously; this is my all my own personal opinion. Do not assume this as any form of advice, DYOR</strong>)</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/ps7axc/dont_panic_sell_stick_to_the_plan_youll_be_okay/",
  "subreddit": "CryptoCurrency",
  "id": "ps7axc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey, everyone!\n\nJust wanted to make this quick post, in light of what’s going on with the\nmarket.\n\n(Take nothing I say in this discussion seriously, this is my all my own personal\nopinion. Do not assume this as any form of advice, DYOR)\n\nSo unless you live in a pineapple under the sea, you’ll notice…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n市場の動向を踏まえて、ちょっとした投稿をしたいと思います。\n市場で起こっていることを考慮して、ちょっとした投稿をしてみました。\n\n(この議論で私が言うことは何も真剣に受け止めてはいけません、これはすべて私の個人的な\nの意見です。アドバイスだとは思わないでください。)\n\nあなたが海底のパイナップルに住んでいない限り、あなたは気づくでしょう...。",
      "title": "慌てて売るのではなく、計画通りに進めましょう。あなたは大丈夫です!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，大家好!\n\n鉴于目前市场上发生的情况，我只想发这个简短的帖子\n市场的情况。\n\n(我在讨论中所说的一切都不是认真的，这都是我的个人意见。\n观点。不要认为这是任何形式的建议，DYOR)\n\n因此，除非你住在海底的菠萝里，否则你会发现...",
      "title": "不要恐慌性销售；坚持计划。你会好起来的!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，大家好!\n\n鑑於目前市場上發生的情況，我只想發這個簡短的帖子\n市場的情況。\n\n(我在討論中所說的一切都不是認真的，這都是我的個人意見。\n觀點。不要認爲這是任何形式的建議，DYOR)\n\n因此，除非你住在海底的菠蘿裏，否則你會發現...",
      "title": "不要恐慌性銷售；堅持計劃。你會好起來的!"
    }
  ]
}