{
  "author": "JH0190",
  "original_created_utc": 1639653000,
  "title": "Meta question: why do so many questions here have a ‘role play’ element?",
  "created_utc": 1639669581,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve noticed that there are a large number of questions asked on this subreddit that start with a ‘role play’ premise, e.g. ‘I am a farmer in C18th rural Virginia’. Is there a reason for this? &lt;/p&gt;\n\n&lt;p&gt;I have never come across historical questions being framed in this way before joining this subreddit, but see it all the time here. I’m in the UK and wonder if it’s a common way of asking questions in the US or elsewhere?&lt;/p&gt;\n\n&lt;p&gt;Edit: for anyone who frames questions in this way, I just want to make it clear that there is no criticism behind this question, so please accept my apologies if it came across in that way.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/rhokx5/meta_question_why_do_so_many_questions_here_have/",
  "subreddit": "AskHistorians",
  "id": "rhokx5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve noticed that there are a large number of questions asked on this subreddit\nthat start with a ‘role play’ premise, e.g. ‘I am a farmer in C18th rural\nVirginia’. Is there a reason for this?\n\nI have never come across historical questions being framed in this way before\njoining this subreddit, but…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブレディットで質問される数が多いことに気がつきました。\nロールプレイを前提にしたもの、例えば「私は18世紀の農村で農夫をしている。\nバージニア州 これには何か理由があるのでしょうか？\n\n歴史的な質問がこのような枠組みで行われるのは、これまで見たことがありません。\nこのサブレディットへの参加ですが、、、。",
      "title": "メタな質問ですが、なぜここでの質問には「ロールプレイ」の要素が多いのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我注意到，在这个分论坛上有大量的问题是以 \"角色扮演 \"为前提的。\n的问题都是以 \"角色扮演 \"为前提的，例如 \"我是18世纪弗吉尼亚农村的一个农民\"。\n弗吉尼亚州\"。这有什么原因吗？\n\n在加入这个分论坛之前，我从未遇到过以这种方式提出的历史问题。\n加入这个分论坛，但是......",
      "title": "元问题：为什么这里的很多问题都有 \"角色扮演 \"的成分？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我注意到，在這個分論壇上有大量的問題是以 \"角色扮演 \"爲前提的。\n的問題都是以 \"角色扮演 \"爲前提的，例如 \"我是18世紀弗吉尼亞農村的一個農民\"。\n弗吉尼亞州\"。這有什麼原因嗎？\n\n在加入這個分論壇之前，我從未遇到過以這種方式提出的歷史問題。\n加入這個分論壇，但是......",
      "title": "元問題：爲什麼這裏的很多問題都有 \"角色扮演 \"的成分？"
    }
  ]
}