{
  "author": "Autumus_Prime",
  "the_new_excerpt": "For those who missed the drama WSB just went private over some drama around the\nTwitter feed and the possibility of institutions hanging up with SEC to take\naction against retail.\n\nSo a question for the more financially literate traders: what is shadier, a\nbunch of jackasses finding a short squeeze…",
  "original_created_utc": 1611291746,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "对于那些错过了戏剧的人，WSB刚刚私下里对一些戏剧周围的。\n微博，以及机构挂靠证监会的可能性，以取\n对零售的行动。\n\n那么，请问一下比较有金融知识的操盘手：什么是比较阴暗的，是一个。\n一群傻瓜在找短裤...",
      "title": "这个结局如何？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於那些錯過了戲劇的人，WSB剛剛私下裏對一些戲劇周圍的。\n微博，以及機構掛靠證監會的可能性，以取\n對零售的行動。\n\n那麼，請問一下比較有金融知識的操盤手：什麼是比較陰暗的，是一個。\n一羣傻瓜在找短褲...",
      "title": "這個結局如何？"
    }
  ],
  "title": "How does this end?",
  "created_utc": 1611295337,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For those who missed the drama WSB just went private over some drama around the Twitter feed and the possibility of institutions hanging up with SEC to take action against retail.</p>\n\n<p>So a question for the more financially literate traders: what is shadier, a bunch of jackasses finding a short squeeze opportunity and laughing about it online while making fun of each other or institutions short selling stock they don’t actually own and suppressing the price to ensure they profit?</p>\n\n<p>The question of regulation came up. Obviously the lobbyists are with the institutions but what if we retailers start writing to our senators and congressmen now asking for an end to short selling? If there’s no short selling there’s no short squeezing. </p>\n\n<p>I dunno, just thought I’d post something to talk about here other than whether the market is overvalued.</p>\n\n<p>Edit: I know a bunch of WSBers are going to flock here without WSB up for a few hours. The intention of this post wasn’t just to talk about WSB going down or I would have put it in <a href=\"/r/subredditdrama\">r/subredditdrama</a> . Im genuinely looking for a conversation about short selling in general. IMO it’s unethical and it’s only purpose is to drain money from retail investors by suppressing prices. Since the spotlight is on the GME squeeze why not focus the attention there?</p>\n</div><!-- SC_ON -->",
  "score": 140,
  "permalink": "/r/investing/comments/l2gkd1/how_does_this_end/",
  "subreddit": "investing",
  "id": "l2gkd1",
  "is_self": true,
  "media": null,
  "is_video": false
}