{
  "author": "Pixeth_",
  "original_created_utc": 1644264678,
  "title": "If you're kicking yourself for not buying more during the crash, stop. This is how FOMO begins.",
  "created_utc": 1644281406,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Stick to your original plan. And if you don&amp;#39;t have one, try to establish one - even if it&amp;#39;s a simple DCA system without much more of an end goal than eventually having more money. Don&amp;#39;t get caught up in the hype which is very rapidly flooding into every person&amp;#39;s social media feed. The success of broader crypto and the individual projects themselves is not going to be decided in a few days; and if a project&amp;#39;s success is solely confined to a small number of green candles, then it&amp;#39;s probably not going to last long; look at its user base, its pipeline, its developers. Of course if the plan is to trade in the short term, look for trends to capitalise of off; but if you are simply looking for a longer term investment, look beyond a bull market (if this is one). There&amp;#39;ll be plenty more green periods to look forward to if crypto truly comes to be adopted at the rate and to the extent it seems it will.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 377,
  "permalink": "/r/CryptoCurrency/comments/smzlb7/if_youre_kicking_yourself_for_not_buying_more/",
  "subreddit": "CryptoCurrency",
  "id": "smzlb7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Stick to your original plan. And if you don't have one, try to establish one -\neven if it's a simple DCA system without much more of an end goal than\neventually having more money. Don't get caught up in the hype which is very\nrapidly flooding into every person's social media feed. The success of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "当初の計画を忠実に実行する。そして、もし計画がないのであれば、立てるようにしましょう。\nたとえそれが、最終的な目標がなく、単純なDCAシステムであっても\n最終的にはお金を増やす。このような誇大広告に踊らされないでください。\nソーシャルメディアに溢れかえる。成功は...",
      "title": "暴落時にもっと買っておけばよかったと後悔している人は、もうやめましょう。これがFOMOの始まりです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "坚持你的原始计划。如果你没有计划，试着建立一个 --\n即使它是一个简单的DCA系统，除了最终拥有更多的钱之外，没有更多的最终目标。\n最终拥有更多的钱。不要被炒作所迷惑，这些炒作正迅速涌入每个人的邮箱。\n迅速涌入每个人的社交媒体饲料。成功",
      "title": "如果你正在为没有在暴跌期间买入更多东西而自责，那就停下来吧。这就是FOMO的开始。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "堅持你的原始計劃。如果你沒有計劃，試着建立一個 --\n即使它是一個簡單的DCA系統，除了最終擁有更多的錢之外，沒有更多的最終目標。\n最終擁有更多的錢。不要被炒作所迷惑，這些炒作正迅速湧入每個人的郵箱。\n迅速湧入每個人的社交媒體飼料。成功",
      "title": "如果你正在爲沒有在暴跌期間買入更多東西而自責，那就停下來吧。這就是FOMO的開始。"
    }
  ]
}