{
  "author": "Media_Offline",
  "original_created_utc": 1638643452,
  "title": "Is the three polarized filter experiment really a demonstration of quantum uncertainty or is there a much more simple explanation?",
  "created_utc": 1638650187,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just watched &lt;a href=\"https://www.youtube.com/watch?v=zcqZHYo7ONs&amp;amp;ab_channel=minutephysics\"&gt;this video&lt;/a&gt; where I&amp;#39;ve just now learned of the polarizing filter experiment demonstrating Bell&amp;#39;s theorem. But it&amp;#39;s done my head in a bit because my immediate thought was simply that the experiment is flawed and the light is just in a reflection loop. &lt;/p&gt;\n\n&lt;p&gt;Light passes through filter A, half of it continues through filter B toward C. The other half is reflected back toward filter A where half of it passes through in the opposite direction and the remaining half of the bounced light again reflects back toward filter B where half of it continues through toward filter C making it brighter. Upon each reflection, the light is slightly scattered and its directionality will be altered allowing it to pass. Add to that that a large amount of light was bounced off of C initially which will have gone through the same reflection paths. This goes in a decreasing loop adding brightness to C until you get the significant boost their experiments observed.&lt;/p&gt;\n\n&lt;p&gt;To me, this doesn&amp;#39;t appear to be a great demonstration of quantum uncertainty because it is explainable through a more certain physical process. &lt;/p&gt;\n\n&lt;p&gt;My question is this: what am I missing? Why do scientists go so far down the quantum rabbit hole to explain this &amp;quot;strange&amp;quot; phenomenon that seems perfectly reasonable to me and why is my explanation not reasonable. Thank you!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/askscience/comments/r8w492/is_the_three_polarized_filter_experiment_really_a/",
  "subreddit": "askscience",
  "id": "r8w492",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I just watched this video\n[https://www.youtube.com/watch?v=zcqZHYo7ONs&ab_channel=minutephysics] where\nI've just now learned of the polarizing filter experiment demonstrating Bell's\ntheorem. But it's done my head in a bit because my immediate thought was simply\nthat the experiment is flawed and the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この動画を見たところ\n[https://www.youtube.com/watch?v=zcqZHYo7ONs&ab_channel=minutephysics]ここで\n偏光フィルターの実験がベルの法則を実証していることを今更ながら知りました。\nという定理があります。というのも、私がすぐに思ったのは、単純に\nこの実験には欠陥があり、...",
      "title": "3枚の偏光フィルターを使った実験は、本当に量子の不確定性を示すものなのか、それとももっと単純な説明があるのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚看了这个视频\n[https://www.youtube.com/watch?v=zcqZHYo7ONs&ab_channel=minutephysics] 其中\n我现在才知道偏振滤光片实验证明了贝尔定理。\n定理。但这让我有点头大了，因为我的第一反应就是\n这个实验是有缺陷的，而...",
      "title": "三个偏振滤光片实验真的是量子不确定性的证明，还是有一个更简单的解释？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛看了這個視頻\n[https://www.youtube.com/watch?v=zcqZHYo7ONs&ab_channel=minutephysics] 其中\n我現在才知道偏振濾光片實驗證明了貝爾定理。\n定理。但這讓我有點頭大了，因爲我的第一反應就是\n這個實驗是有缺陷的，而...",
      "title": "三個偏振濾光片實驗真的是量子不確定性的證明，還是有一個更簡單的解釋？"
    }
  ]
}