{
  "author": "RusticBohemian",
  "original_created_utc": 1637855811,
  "title": "The Inca were famous for their qullqas storehouses filled with enough food to see their subjects through years of famine. Were such vast food reserves particularly notable in the premodern world? Did European or Asian civilizations manage a similarly effective famine-fighting strategy?",
  "created_utc": 1637868032,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the Mantaro Valley, one of the largest fertile growing regions of the Inca Empire, archeologists have found 2,573 qullqas (storehouses).  These could hold 170,000 square meters of goods. Some of this was for non-food storage, but a ton of it was dried potatoes, quinoa, etc. When the Spanish showed up, the Inca equipped and fed a 35,000 man army from the storehouses around the Mantaro Valley.</p>\n\n<p>But these qullqas were spread around the empire, and other areas stored corn, seaweed, dried fish, etc. </p>\n\n<p>I can&#39;t think of another civilization that had such huge reserves on hand to deal with emergencies. When I think of medieval Europe, famine and starvation seem to pop up every few years. </p>\n\n<p>So was this unique? Did anyone else prepare for famines on this scale?</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/r1zmtx/the_inca_were_famous_for_their_qullqas/",
  "subreddit": "AskHistorians",
  "id": "r1zmtx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In the Mantaro Valley, one of the largest fertile growing regions of the Inca\nEmpire, archeologists have found 2,573 qullqas (storehouses). These could hold\n170,000 square meters of goods. Some of this was for non-food storage, but a ton\nof it was dried potatoes, quinoa, etc. When the Spanish showed…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "インカ帝国最大の肥沃な生産地のひとつであるマンタロ渓谷では\n考古学者たちは、2,573棟のクルカス（貯蔵庫）を発見しました。これらの倉庫には\n170,000平方メートルの品物を収納することができました。この中には非食料品も含まれていますが、1トンの\n干しイモやキヌアなどがありました。スペイン人が見せてくれたのは...。",
      "title": "インカの人々は、飢饉を乗り越えるための食料を蓄えた「クルカス」と呼ばれる貯蔵庫を持っていました。前近代の世界では、このような莫大な食料の蓄えが特に注目されていたのでしょうか。また、ヨーロッパやアジアの文明では、同じような飢餓対策が行われていたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在曼塔罗山谷，印加帝国最大的肥沃种植区之一\n帝国，考古学家发现了2,573个qullqas（仓库）。这些仓库可以容纳\n170,000平方米的货物。其中一些是用于储存非食品，但有一吨\n其中有一吨是马铃薯干、藜麦等。当西班牙人展示...",
      "title": "印加人以其qullqas仓库而闻名，里面装满了足够的食物，可以让他们的臣民度过多年的饥荒。在前现代世界，这样庞大的食物储备是否特别值得注意？欧洲或亚洲文明是否采取了类似的有效抗饥策略？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在曼塔羅山谷，印加帝國最大的肥沃種植區之一\n帝國，考古學家發現了2,573個qullqas（倉庫）。這些倉庫可以容納\n170,000平方米的貨物。其中一些是用於儲存非食品，但有一噸\n其中有一噸是馬鈴薯幹、藜麥等。當西班牙人展示...",
      "title": "印加人以其qullqas倉庫而聞名，裏面裝滿了足夠的食物，可以讓他們的臣民度過多年的饑荒。在前現代世界，這樣龐大的食物儲備是否特別值得注意？歐洲或亞洲文明是否採取了類似的有效抗飢策略？"
    }
  ]
}