{
  "author": "AlexvonTunzelmann",
  "original_created_utc": 1654604111,
  "title": "I’m Alex von Tunzelmann, author of five books, most recently ‘Fallen Idols: Twelve Statues That Made History' -- shortlisted for the Wolfson History Prize 2022. AMA about statues, empire and historical storytelling!",
  "created_utc": 1654613384,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m a historian with specialisms in international Cold War politics, imperialism and post-imperialism, and forms of historical storytelling: including film and TV, and of course statues. I’m also a screenwriter working mostly on historical drama – so I am extremely interested in both the making and busting of historical myths. &lt;/p&gt;\n\n&lt;p&gt;Here’s the book cover copy from my most recent book, Fallen Idols:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;In 2020, statues across the world were pulled down in an extraordinary wave of global iconoclasm inspired by Black Lives Matter protests. From the United States and United Kingdom to Canada, South Africa, the Caribbean, India, Bangladesh and New Zealand, protesters defaced and hauled down statues of slaveholders, Confederates and imperialists. Edward Colston was hurled into the harbour in Bristol, England. Robert E. Lee was covered in graffiti in Richmond, Virginia. Christopher Columbus was toppled in Minnesota, beheaded in Massachusetts, and thrown into a lake in Virginia. King Leopold II of the Belgians was set on fire in Antwerp and doused in red paint in Ghent. Winston Churchill was daubed with the word “racist” in London.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Statues are one of the most visible – and controversial – forms of historical storytelling. The stories we tell about history are vital to how we, as societies, understand our past and create our future.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;So whose stories do we tell? Who or what defines us? What if we don’t all agree? How is history made, and why?&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Fallen Idols takes twelve statues in modern history. It looks at why they were put up; the stories they were supposed to tell; why those stories were challenged; and how they came down.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;My previous books are:&lt;/p&gt;\n\n&lt;p&gt;‘Indian Summer: The Secret History of the End of an Empire’; ‘Red Heat: Conspiracy, Murder and the Cold War in the Caribbean’; ‘Blood and Sand: Suez, Hungary and the Crisis that Shook the World’; ‘Reel History: The World According to the Movies.’&lt;/p&gt;\n\n&lt;p&gt;You can buy my books at any good bookshop, real or online, and at Amazon globally. &lt;a href=\"http://www.linktr.ee/alexvt\"&gt;http://www.linktr.ee/alexvt&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Meanwhile -- fire away!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 158,
  "permalink": "/r/AskHistorians/comments/v6twwv/im_alex_von_tunzelmann_author_of_five_books_most/",
  "subreddit": "AskHistorians",
  "id": "v6twwv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m a historian with specialisms in international Cold War politics, imperialism\nand post-imperialism, and forms of historical storytelling: including film and\nTV, and of course statues. I’m also a screenwriter working mostly on historical\ndrama – so I am extremely interested in both the making and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は歴史学者で、専門は国際冷戦政治、帝国主義、ポスト帝国主義です。\nとポスト帝国主義、そして映画やテレビなどの歴史物語の形式を専門としている。\nそしてもちろん、銅像も。また、脚本家として、主に歴史ドラマを手がけています。\nそのため、映画やテレビなどの歴史ドラマの製作と、そのドラマを取り巻く環境の変化に大きな関心を寄せています。",
      "title": "私はアレックス・フォン・トゥンゼルマンです。5冊の本の著者で、最近では「Fallen Idols: Twelve Statues That Made History」が2022年のウォルフソン歴史賞の最終選考に残っています。像、帝国、歴史の語り部について、AMAが語ります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一名历史学家，专长于国际冷战政治、帝国主义和后帝国主义。\n帝国主义和后帝国主义，以及历史故事的形式：包括电影和电视。\n电视，当然还有雕像。我也是一名编剧，主要从事历史剧创作。\n所以我对历史剧的制作和制作过程都非常感兴趣。",
      "title": "我是亚历克斯-冯-通策曼，五本书的作者，最近的作品是《堕落的偶像：创造历史的十二座雕像》--入围2022年沃尔夫森历史奖。关于雕像、帝国和历史故事的AMA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一名歷史學家，專長於國際冷戰政治、帝國主義和后帝國主義。\n帝國主義和后帝國主義，以及歷史故事的形式：包括電影和電視。\n電視，當然還有雕像。我也是一名編劇，主要從事歷史劇創作。\n所以我對歷史劇的製作和製作過程都非常感興趣。",
      "title": "我是亞歷克斯-馮-通策曼，五本書的作者，最近的作品是《墮落的偶像：創造歷史的十二座雕像》--入圍2022年沃爾夫森歷史獎。關於雕像、帝國和歷史故事的AMA!"
    }
  ]
}