{
  "author": "ZekOssian",
  "original_created_utc": 1648486479,
  "title": "Of all the given names in the Iliad, only Hector and Helen are still commonly used in modern English. Why have these names stuck while other haven't?",
  "created_utc": 1648502201,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I may have forgotten another name or two, but, generally, those are the only two Homeric names commonly used in English. While I understand that they are two major characters, we would almost never hear of an Achilles, Odysseus, or Agamemnon as a given name in the Anglophone world. What made these two names stay in common usage while others have not?&lt;/p&gt;\n\n&lt;p&gt;Again, only asking with regards to their use as English given names. I would assume that in other languages different names may still be used.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/tqdrjw/of_all_the_given_names_in_the_iliad_only_hector/",
  "subreddit": "AskHistorians",
  "id": "tqdrjw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I may have forgotten another name or two, but, generally, those are the only two\nHomeric names commonly used in English. While I understand that they are two\nmajor characters, we would almost never hear of an Achilles, Odysseus, or\nAgamemnon as a given name in the Anglophone world. What made these…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もう一人、二人、名前を忘れているかもしれませんが、だいたい、この二人しかいません。\n英語で一般的に使われているホメロス語の名前。この2人が\n主要な登場人物であっても、アキレスやオデュッセウス、あるいは、ヴォルデモートが登場することはほとんどないでしょう。\nアガメムノンは、英語圏では名字として使われています。なぜ、このような...",
      "title": "イーリアス』に登場する名前のうち、現代英語でも一般的に使われているのはヘクトルとヘレンだけである。なぜ、これらの名前が他の名前と違って定着しているのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我可能还忘了一两个名字，但是，一般来说，这就是仅有的两个\n荷马史诗中常用的英文名字。虽然我知道他们是两个\n主要人物，但我们几乎从未听说过阿基里斯、奥德修斯或\n阿伽门农作为英语世界中的名字。是什么让这些...",
      "title": "在《伊利亚特》中所有的名字中，只有赫克托尔和海伦在现代英语中仍被普遍使用。为什么这些名字能坚持下来，而其他的却没有？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我可能還忘了一兩個名字，但是，一般來說，這就是僅有的兩個\n荷馬史詩中常用的英文名字。雖然我知道他們是兩個\n主要人物，但我們幾乎從未聽說過阿基里斯、奧德修斯或\n阿伽門農作爲英語世界中的名字。是什麼讓這些...",
      "title": "在《伊利亞特》中所有的名字中，只有赫克托爾和海倫在現代英語中仍被普遍使用。爲什麼這些名字能堅持下來，而其他的卻沒有？"
    }
  ]
}