{
  "author": "HamsterInFlipflops",
  "the_new_excerpt": "I am all about being inclusive and think everyone should do their thing unless\nit's hurting someone but this is just ridiculous. I have seen several post's now\non Instagram, Twitter, Tumblr etc. about people saying that Trans Woman also can\nhave their period. No they can't. They biologically cannot…",
  "original_created_utc": 1614083310,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个包容的人，认为每个人都应该做自己的事情，除非是\n它的伤害别人，但这只是荒谬的。我已经看到了几个帖子的现在\n在Instagram，Twitter，Tumblr等关于人们说，跨性别女性也可以。\n有他们的时期。不，他们不能。他们在生物学上不能...",
      "title": "为什么变性女人说她们可以像普通女人一样来月经呢，其实她们不能。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個包容的人，認爲每個人都應該做自己的事情，除非是\n它的傷害別人，但這只是荒謬的。我已經看到了幾個帖子的現在\n在Instagram，Twitter，Tumblr等關於人們說，跨性別女性也可以。\n有他們的時期。不，他們不能。他們在生物學上不能...",
      "title": "爲什麼變性女人說她們可以像普通女人一樣來月經呢，其實她們不能。"
    }
  ],
  "title": "Why are Trans Woman saying that they can have their period just like a regular woman? when in fact they can't.",
  "created_utc": 1614100535,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am all about being inclusive and think everyone  should do their thing unless it&#39;s hurting someone but this is just ridiculous. I have seen several post&#39;s now on Instagram, Twitter, Tumblr etc. about people saying that Trans Woman also can have their period. No they can&#39;t. They biologically cannot have their Period. It even went so far where i saw posts where Trans Woman took pictures of themselves with fake blood (?) on their underwear saying they had a &quot;accident&quot; and it&#39;s hard being a Woman. I have seen posts from people demanding off time from work once a month because they need that time to feel like a real woman. I&#39;m sorry I but this is straight up mental illness. It would be like a Trans Man can&#39;t come to work because he &quot;Squeezed his balls to hard&quot;. I don&#39;t have aby problems with trans people or  or anyone. I think it&#39;s great that people can express themselves like this but this? please someone explain to me.</p>\n\n<p>Edit : I don&#39;t know what happened but they post duplicate itself??? i fixed it now but that was weird</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/lqhap7/why_are_trans_woman_saying_that_they_can_have/",
  "subreddit": "TooAfraidToAsk",
  "id": "lqhap7",
  "is_self": true,
  "media": null,
  "is_video": false
}