{
  "author": "crrpit",
  "original_created_utc": 1634654872,
  "title": "CONFERENCE ANNOUNCEMENT: Due to a widespread internet outage, the AHDC2021 Keynote has been postponed until tomorrow.",
  "created_utc": 1634674968,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Unfortunately, the title says it all: a widespread internet outage affecting our keynote speaker, Dr Devon Mihesuah, means that we have had to postpone the talk until tomorrow. </p>\n\n<h1>The keynote will now take place at the same time (11 am, EDT) tomorrow, Wednesday October 20.</h1>\n\n<p>If you are already signed up for the keynote, you should shortly receive an email confirming the rescheduled time and you do not need to reregister. If you would like to come along at the new time tomorrow and haven&#39;t yet registered, you can still do so <a href=\"https://us02web.zoom.us/webinar/register/6516340505394/WN_cNNfK79IQWeTqj5O9SnVAQ\">here</a>.</p>\n\n<p>We understand that not all attendees will be able to make the new time tomorrow, and we share your disappointment. We will be doing our best to get a recording live as soon as possible, so that you can catch up on what promises to be a fantastic, timely talk.</p>\n\n<p><a href=\"https://www.reddit.com/r/AskHistorians/comments/qb89zx/megathread_day_one_of_the_askhistorians_2021/\">Other conference events</a> - panel AMAs, video releases and networking and social sessions - will continue as scheduled.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/qbd1ky/conference_announcement_due_to_a_widespread/",
  "subreddit": "AskHistorians",
  "id": "qbd1ky",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Unfortunately, the title says it all: a widespread internet outage affecting our\nkeynote speaker, Dr Devon Mihesuah, means that we have had to postpone the talk\nuntil tomorrow.\n\n\nTHE KEYNOTE WILL NOW TAKE PLACE AT THE SAME TIME (11 AM, EDT) TOMORROW,\nWEDNESDAY OCTOBER 20.\n\nIf you are already signed…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "残念ながら、このタイトルがすべてを物語っています。\n基調講演者であるDevon Mihesuah博士の講演は明日に延期しなければなりませんでした。\n明日に延期せざるを得なくなりました。\n\n\n基調講演は、明日、同じ時間（米国東部時間午前11時）に行われます。\n10月20日（水）です。\n\nすでに登録されている方は、こちらをご覧ください。",
      "title": "カンファレンス・アナウンス 広範囲にわたるインターネットの障害のため、AHDC2021キーノートは明日に延期されました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不幸的是，这个标题说明了一切：一个大范围的互联网故障影响了我们的\n我们的主讲人德文-米赫苏阿博士，意味着我们不得不将讲座推迟到明天进行。\n到明天。\n\n\n主题演讲将在明天同一时间（上午11点）举行。\n10月20日星期三。\n\n如果你已经签署了...",
      "title": "会议公告。由于大范围的网络中断，AHDC2021的主题演讲已被推迟到明天。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不幸的是，這個標題說明了一切：一個大範圍的互聯網故障影響了我們的\n我們的主講人德文-米赫蘇阿博士，意味着我們不得不將講座推遲到明天進行。\n到明天。\n\n\n主題演講將在明天同一時間（上午11點）舉行。\n10月20日星期三。\n\n如果你已經簽署了...",
      "title": "會議公告。由於大範圍的網絡中斷，AHDC2021的主題演講已被推遲到明天。"
    }
  ]
}