{
  "author": "The-Crazed-Crusader",
  "the_new_excerpt": "I assure you, this ISN'T going to get political. Because by all accounts South\nAfrica is screwed. My planned position is bottom paragraph.\n\nUnder the current ANC government there has been a general degeneration of all\naspects of South Africa. Due to systemic nepotism, there are math teachers…",
  "original_created_utc": 1613465649,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我向你保证，这不会成为政治问题。因为从各方面来看，南\n非洲完蛋了。我计划的立场是底段。\n\n在目前的非洲人国民大会政府下，所有的人都普遍堕落了。\n南非的各个方面。由于制度上的裙带关系，有的数学老师...",
      "title": "我要做空整个南非国家。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我向你保證，這不會成爲政治問題。因爲從各方面來看，南\n非洲完蛋了。我計劃的立場是底段。\n\n在目前的非洲人國民大會政府下，所有的人都普遍墮落了。\n南非的各個方面。由於制度上的裙帶關係，有的數學老師...",
      "title": "我要做空整個南非國家。"
    }
  ],
  "title": "I am going to short the whole country of South Africa.",
  "created_utc": 1613478868,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I assure you, this ISN&#39;T going to get political. Because by all accounts South Africa is screwed. My planned position is bottom paragraph.</p>\n\n<p>Under the current ANC government there has been a general degeneration of all aspects of South Africa. Due to systemic nepotism, there are math teachers that don&#39;t know what square roots are, army officers that can&#39;t read, and cops that have never fired a gun. The practice of fictitious employees that take checks but don&#39;t work there is widespread enough that the government has drove itself into insolvency already. Estimates are that some 80% of government funds are misused in some way, ranging from government subsidies given to businesses owned by government officials to simply going missing from accounts. The ANC solved this, against advise of wiser people, with quantitative easing. Which is a fancy term for printing money, and since they could never possibly reverse that printer they&#39;re inflating the South African Rand which is why they&#39;ve had two bouts of inflation near 9% twice in the past 20 years.</p>\n\n<p>That is all besides how the largely defunct government doesn&#39;t prevent anything on the ground. Roaming bands of pirates (many affiliates of the Marxist Economic Freedom Fighter party) will poison guard dogs and torture and murder residents often for as little as car keys and groceries. Many communities are functionally independent and take the law in their own hands, and in many areas utilities are defunct (untreated sewage goes in the river, untreated tap water comes out and it smells as disgusting as it sounds). South Africans are more likely to have their asylum applications accepted than any other nation as there are so many tales of rape and murder and threats of ethnic cleansing. This equates to the most educated citizens leaving SA and most SA based businesses diversifying out of the country as literacy rates have been falling. These disillusioned departures are not new, as they include the most famous Afrikaner in history Elon Musk who is now a naturalized American.</p>\n\n<p>Edit: The Economic Freedom Fighter&#39;s usual acronym isn&#39;t used because it&#39;s also the ticker for a penny stock.</p>\n\n<p>I first thought about shorting South Africa over a year ago when I was researching the country (I&#39;m a historian, I read much on the country for fun). I found the only index tracking SA (<a href=\"https://www.bing.com/search?q=eza+stock&amp;cvid=0d411debffed4d50b06fa54733b0bb0a&amp;FORM=ANAB01&amp;PC=DCTS\">EZA</a>) wasn&#39;t an accurate representation of SA economy and buying puts on it was useless. It tracked only the largest cap firms, which are the aforementioned companies diversifying out of SA (mostly to other parts of Africa). Which is why it&#39;s a volatile ETF that overall trades sideways. Buying puts on it wouldn&#39;t really capitalize on SA going full Rhodesia/Zimbabwe. Zimbabwe having experienced the general breakup of modern institutions and hyperinflation due to similar problems.</p>\n\n<p>My new broker, IBKR, allows negative currency positions as long you post 10% as collateral. Now my native currency are US dollars, where inflation in 2020 was 1.4% while the <a href=\"https://www.inflationtool.com/south-african-rand\">South African Rand&#39;s inflation</a> was 4.12% in 2020. That equals a 26.8% return on investment per year from that simple short position. But I&#39;m expecting US Dollar inflation to stay between 1-2% a year while the Rand (ticker ZAR) stays north of 4% with inflation spikes inevitable over the next decade. This position also reduces my market beta, much needed for me as I&#39;ve got hugely leveraged positions on American ETFs. This isn&#39;t a short term swing trade, I&#39;m waiting for SA to implode.</p>\n</div><!-- SC_ON -->",
  "score": 40510,
  "permalink": "/r/wallstreetbets/comments/lkzviy/i_am_going_to_short_the_whole_country_of_south/",
  "subreddit": "wallstreetbets",
  "id": "lkzviy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728633170
}