{
  "author": "CalculatedLuck",
  "original_created_utc": 1628700297,
  "title": "WARNING: Do not ruin your life because of taxes like so many in 2018!",
  "created_utc": 1628710231,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h3>PREFACE</h3>\n\n<p>Obviously this is dependent on tax laws in your specific country. This post is primarily about the US and other countries with similar taxation laws.</p>\n\n<h3>WHAT HAPPENED</h3>\n\n<p>In the 2017 bull run, people saw crazy gains (10x-100x) and then traded without considering the taxable events and liabilities being created.</p>\n\n<p>Then when the 2018 crash happened they did not have money to pay their HUGE tax bill that was owed and ruined their financial life!</p>\n\n<h3>HOW IT WORKS</h3>\n\n<p>If you bought $10k worth of a coin and it 20x to $200k in 2021, and then you trade it for any other coins, you have a realized gain of $190k.</p>\n\n<p>Assuming a 20% effective tax rate, you would owe $38,000 in taxes!</p>\n\n<p>Now if your portfolio dropped 80% back down to $40k and you did not harvest the tax loss before the end of the year… you would STILL owe $38k in taxes for that year, which is your entire stack!!!</p>\n\n<h3>WHAT TO DO</h3>\n\n<p>If you had substantial gains this year and traded during the peak earlier this year, the smart thing to do is to:</p>\n\n<ol>\n<li><p>Use a crypto tax reporting software to calculate how much in realized gains and tax liability you may have.</p></li>\n<li><p>Cash out a portion of your stack and set it aside for paying taxes when they’re due OR if you&#39;re okay with the risk, you can even convert to a stable coin and hold on a lending platform to still earn some interest. (keep in mind this trade creates another taxable event so you&#39;ll want to factor that in)</p></li>\n</ol>\n\n<h3>CONCLUSION</h3>\n\n<p>There were many stories of people in 2018 who owed HUGE sums in taxes that were near their entire stack or even more because they didn’t consider taxes and didn’t plan ahead. </p>\n\n<p>Learn from their mistake so you don’t repeat it!</p>\n\n<p>Hopefully we see a 2nd leg of the bull run but don’t risk being in this position if we&#39;re in a dead cat bounce and the market goes bearish again.</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "permalink": "/r/CryptoCurrency/comments/p2gvch/warning_do_not_ruin_your_life_because_of_taxes/",
  "subreddit": "CryptoCurrency",
  "id": "p2gvch",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "PREFACE\n\nObviously this is dependent on tax laws in your specific country. This post is\nprimarily about the US and other countries with similar taxation laws.\n\n\nWHAT HAPPENED\n\nIn the 2017 bull run, people saw crazy gains (10x-100x) and then traded without\nconsidering the taxable events and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "序文\n\nこれは明らかに、あなたの国の税法に依存しています。この記事は\nこの記事は主にアメリカと同様の税法を持つ他の国についてです。\n\n\n出来事\n\n2017年のブルランでは、人々は狂ったような利益（10倍～100倍）を見て、その後、課税対象となる出来事を考慮せずに取引をしました。\n課税対象となるイベントを考慮せずに取引してしまいました。",
      "title": "警告：2018年の多くの人たちのように、税金のために人生を台無しにしないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "前言\n\n很明显，这取决于你的具体国家的税法。这篇文章是\n主要针对美国和其他有类似税法的国家。\n\n\n发生了什么事\n\n在2017年的牛市中，人们看到了疯狂的收益（10倍-100倍），然后在没有考虑到应税事件的情况下进行交易。\n考虑到应税事件和...",
      "title": "警告：不要像2018年的许多人一样因为税收而毁掉你的生活！。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "前言\n\n很明顯，這取決於你的具體國家的稅法。這篇文章是\n主要針對美國和其他有類似稅法的國家。\n\n\n發生了什麼事\n\n在2017年的牛市中，人們看到了瘋狂的收益（10倍-100倍），然後在沒有考慮到應稅事件的情況下進行交易。\n考慮到應稅事件和...",
      "title": "警告：不要像2018年的許多人一樣因爲稅收而毀掉你的生活！。"
    }
  ]
}