{
  "author": "Barack_Aubameyang",
  "original_created_utc": 1636396989,
  "title": "The complexity of self-custody is a bigger barrier to adoption than we give it credit for",
  "created_utc": 1636423639,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We really need to eliminate the trade off between security and ease when it comes to crypto custody. Setting up a wallet might not seem that complex to The space right now is entirely made up of crypto enthusiasts that are way way way more hardcore about it than the way the average user will be once we hit true ubiquitous adoption. Take any one of your friends that don’t know anything about crypto and explain the process of setting up a wallet and what the risks are if you do it wrong. Many more people will find this off putting than some of you realize. </p>\n\n<p>People who use the internet are not “internet enthusiasts” they don’t care about learning about the tech, they just want to use the internet in a seamless and easy way. When crypto goes mainstream it’ll be exactly the same as that for 99.9% of all users.  </p>\n\n<p>I think this is a large barrier to adoption unless we either a) make the exchanges trustably secure or b) make self-custody as easy as using an exchange. </p>\n\n<p>The perfect idealistic version of crypto is not going to be the one that gets adopted.</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/Bitcoin/comments/qpk4hg/the_complexity_of_selfcustody_is_a_bigger_barrier/",
  "subreddit": "Bitcoin",
  "id": "qpk4hg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We really need to eliminate the trade off between security and ease when it\ncomes to crypto custody. Setting up a wallet might not seem that complex to The\nspace right now is entirely made up of crypto enthusiasts that are way way way\nmore hardcore about it than the way the average user will be once…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "安全性と手軽さのトレードオフをなくす必要があります。\nなくす必要があります。ウォレットの設定は、私たちにとってはそれほど複雑ではないかもしれません。\n現在のスペースは、他の人よりもはるかにハードコアな暗号愛好家で占められています。\n今の空間は、平均的なユーザーよりもはるかにハードコアな暗号愛好家で構成されています...",
      "title": "セルフ・カストディの複雑さは、私たちが評価している以上に、採用の大きな障壁となっています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们真的需要消除安全和便利之间的权衡，当它涉及加密货币保管时。\n谈到加密货币监管，我们真的需要消除安全和便利之间的交易。建立一个钱包可能看起来并不复杂。\n现在的空间完全是由加密货币爱好者组成的，他们的方式方式方式\n比普通用户的方式更硬核，一旦...",
      "title": "自我监护的复杂性是采用的一个更大的障碍，而不是我们所认为的那样。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們真的需要消除安全和便利之間的權衡，當它涉及加密貨幣保管時。\n談到加密貨幣監管，我們真的需要消除安全和便利之間的交易。建立一個錢包可能看起來並不複雜。\n現在的空間完全是由加密貨幣愛好者組成的，他們的方式方式方式\n比普通用戶的方式更硬核，一旦...",
      "title": "自我監護的複雜性是採用的一個更大的障礙，而不是我們所認爲的那樣。"
    }
  ]
}