{
  "author": "oachkatzele",
  "original_created_utc": 1634541469,
  "title": "you want actually unpopular opinions? here we go",
  "created_utc": 1634553316,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><ol>\n<li>crypto is a big bubble that is competing with the fiat bubble in a game of chicken who bursts first.</li>\n<li>burning supply to artificially pump the price is a giga red flag and will make ETH lose market share to its competitors which will ultimately REDUCE its price (compared to what it could have been) instead of increasing it.</li>\n<li>if a coin with the codebase of bitcoin would release today it would be labeled a shitcoin and forgotten faster than the average time it would take to make a block, which to be fair, takes a while.</li>\n<li>crypto will not make everybody &quot;financially free&quot;. if everybody is rich, nobody is. you just want to ride on the back of the people that missed the crypto train that then have to work for you if crypto really flips fiat at some point.</li>\n<li>its not enough for crypto to be &quot;not as bad&quot; as the traditional banking system.<br/>\nwant to be the future? behave like it. be efficient. don&#39;t waste a fuckton of energy. don&#39;t have fees that make it impossible to buy a fucking ice cream without paying double.</li>\n<li>every coin/token was at some point centralized. decentralization is a process. judge a crypto by the effort it makes to get there.</li>\n<li>the average crypto investor has such a limited knowledge of cryptography and/or economics it SCARES ME.</li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 542,
  "permalink": "/r/CryptoCurrency/comments/qahn0h/you_want_actually_unpopular_opinions_here_we_go/",
  "subreddit": "CryptoCurrency",
  "id": "qahn0h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": " 1. crypto is a big bubble that is competing with the fiat bubble in a game of\n    chicken who bursts first.\n 2. burning supply to artificially pump the price is a giga red flag and will\n    make ETH lose market share to its competitors which will ultimately REDUCE\n    its price (compared to what it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": " 1.暗号は大きなバブルであり、フィアットバブルと競合している。\n    最初に破裂するのは誰かというチキンゲームです。\n 2. 人為的に価格を吊り上げるために供給を増やすことは、重大な赤旗であり、ETHの市場シェアを競合他社に奪われることになる。\n    ETHは競合他社にシェアを奪われ、最終的に価格が下がることになります。\n    競合他社にシェアを奪われ、最終的に価格が下がることになります（...",
      "title": "人気のない意見を聞きたいのなら、ここに来なさい。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": " 1.加密货币是一个大泡沫，正在与法币泡沫竞争，进行一场 \"鸡 \"的游戏。\n    谁先破灭的鸡肋游戏。\n 2.通过燃烧供应量来人为地抬高价格是一个巨大的红旗，并将导致\n    燃烧供应量以人为地抬高价格是一个巨大的红旗，并将使ETH的市场份额被其竞争对手夺走，这将最终降低其价格（与之相比。\n    它的价格（与它的价格相比......",
      "title": "你想要真正的不受欢迎的意见吗？ 我们开始吧"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " 1.加密貨幣是一個大泡沫，正在與法幣泡沫競爭，進行一場 \"雞 \"的遊戲。\n    誰先破滅的雞肋遊戲。\n 2.通過燃燒供應量來人爲地擡高價格是一個巨大的紅旗，並將導致\n    燃燒供應量以人爲地擡高價格是一個巨大的紅旗，並將使ETH的市場份額被其競爭對手奪走，這將最終降低其價格（與之相比。\n    它的價格（與它的價格相比......",
      "title": "你想要真正的不受歡迎的意見嗎？ 我們開始吧"
    }
  ]
}