{
  "author": "Meme_Pope",
  "original_created_utc": 1643418861,
  "title": "People who say “don’t keep your coins on exchanges” are like old people who lived through the Great Depression not trusting banks",
  "created_utc": 1643431453,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In the early days of crypto, it made perfect sense not to trust exchanges. Most exchanges were run by weebs out of their parents basements. Mt. Goxx wiped out a whole generation of potential crypto millionaires. There were no adults in the room.&lt;/p&gt;\n\n&lt;p&gt;These days, there are reputable exchanges available. Coinbase isn’t going to exit scam when they’re publicly traded on the NASDAQ. You might get into trouble if you’re trading with 1000X leverage on Bitmex or buying AssCoin on Cryptopia2, but you can assess your own level of risk.&lt;/p&gt;\n\n&lt;p&gt;We’re at the point where you hear way more stories about people getting robbed holding their own keys than you do losing their coins on exchanges. How much of this is user error? Probably most of it, but most people aren’t experts. Telling crypto beginners to get their coins off of exchanges ASAP is a great way to get them to lose it all and swear of crypto forever. &lt;/p&gt;\n\n&lt;p&gt;I know crypto folks like to gatekeep and clown on people losing their coins in stupid ways, but if the dream is mass adoption, it’s not going to happen if it’s inaccessible to normies and hazardous to use. Reputable exchanges are the best case scenario for 90% of the population owning crypto.&lt;/p&gt;\n\n&lt;p&gt;In 2021, there’s nothing wrong with keeping your coins on an exchange if it’s a reputable one. I get the whole freedom angle, but freedom comes with risks that most people aren’t ready for.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 559,
  "permalink": "/r/CryptoCurrency/comments/sf65jl/people_who_say_dont_keep_your_coins_on_exchanges/",
  "subreddit": "CryptoCurrency",
  "id": "sf65jl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In the early days of crypto, it made perfect sense not to trust exchanges. Most\nexchanges were run by weebs out of their parents basements. Mt. Goxx wiped out a\nwhole generation of potential crypto millionaires. There were no adults in the\nroom.\n\nThese days, there are reputable exchanges available.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号の初期には、取引所を信用しないことは完璧に理にかなっていました。ほとんどの\n取引所は、両親の地下室から小人が運営していた。ゴックス山は\n暗号の億万長者候補の全世代。そこには大人がいなかったのです。\nの部屋です。\n\n最近は評判の良い取引所もありますが...。",
      "title": "コインを取引所に預けるな」という人は、世界恐慌を経験したお年寄りが銀行を信用しないのと同じだ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在加密货币的早期，不信任交易所是非常合理的。大多数\n交易所都是由父母地下室里的小白脸经营的。Goxx山消灭了一\n整整一代的潜在加密货币百万富翁。在这个房间里，没有成年人\n房间里没有成年人。\n\n如今，有信誉良好的交易所，....。",
      "title": "说 \"不要把钱币放在交易所 \"的人，就像经历过大萧条的老人不相信银行一样。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在加密貨幣的早期，不信任交易所是非常合理的。大多數\n交易所都是由父母地下室裏的小白臉經營的。Goxx山消滅了一\n整整一代的潛在加密貨幣百萬富翁。在這個房間裏，沒有成年人\n房間裏沒有成年人。\n\n如今，有信譽良好的交易所，....。",
      "title": "說 \"不要把錢幣放在交易所 \"的人，就像經歷過大蕭條的老人不相信銀行一樣。"
    }
  ]
}