{
  "author": "Yajne",
  "original_created_utc": 1645660999,
  "title": "Did middle/upper class English people in the first half of the 20th century socialise later at night than is common now?",
  "created_utc": 1645674220,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been reading a lot of novels, especially Agatha Christie, written between the 1920s and 1960s and set contemporarily with when they were written. Something I have noticed is that characters will often call on each other at home, go out for dinner, etc at 9 or 10pm. To me this seems later in the evening than would be common now - many restaurants wouldn&amp;#39;t even be open past 10pm, and going round to see someone after 9pm seems strange to me unless it&amp;#39;s an emergency. The characters are generally upper or at least upper middle class people and aren&amp;#39;t portrayed as wild partiers at all. Is this something that was culturally different at this time? Is it as simple as these people not having to get up early for jobs?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/AskHistorians/comments/szw52h/did_middleupper_class_english_people_in_the_first/",
  "subreddit": "AskHistorians",
  "id": "szw52h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been reading a lot of novels, especially Agatha Christie, written between\nthe 1920s and 1960s and set contemporarily with when they were written.\nSomething I have noticed is that characters will often call on each other at\nhome, go out for dinner, etc at 9 or 10pm. To me this seems later in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "特にアガサ・クリスティーの小説をよく読んでいます。\n1920年代から1960年代まで、書かれた時代と同時代を舞台にしています。\n私が気づいたことは、登場人物たちがしばしばお互いを\n夜9時、10時に家に帰る、食事に行くなど。私にとっては、この時間帯は...",
      "title": "20世紀前半のイギリスの中流・上流階級の人々は、今よりも夜遅くまで社交をしていたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在阅读大量的小说，特别是阿加莎-克里斯蒂的作品，这些作品写于20世纪20年代和60年代之间，其背景与写作时间一致。\n我一直在读很多小说，特别是阿加莎-克里斯蒂的作品，这些作品写于20世纪20年代和60年代之间，背景是与他们的写作时间相一致的。\n我注意到的一点是，小说中的人物经常会在晚上9点或10点在家里互相拜访，出去吃饭等等。\n晚上9点或10点，人物会在家里打电话给对方，出去吃饭，等等。对我来说，这似乎是在晚些时候。",
      "title": "20世纪上半叶的英国中/上层人士在晚上的社交活动是否比现在普遍？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在閱讀大量的小說，特別是阿加莎-克里斯蒂的作品，這些作品寫於20世紀20年代和60年代之間，其背景與寫作時間一致。\n我一直在讀很多小說，特別是阿加莎-克里斯蒂的作品，這些作品寫於20世紀20年代和60年代之間，背景是與他們的寫作時間相一致的。\n我注意到的一點是，小說中的人物經常會在晚上9點或10點在家裏互相拜訪，出去喫飯等等。\n晚上9點或10點，人物會在家裏打電話給對方，出去喫飯，等等。對我來說，這似乎是在晚些時候。",
      "title": "20世紀上半葉的英國中/上層人士在晚上的社交活動是否比現在普遍？"
    }
  ]
}