{
  "author": "windydoughnut42069",
  "the_new_excerpt": "So my \"friend\" has a small penis and was wondering what exactly is the cut-off\npoint for having a micro-penis? My friend is far too terrified to Google image\nsearch this and I can't either for entirely different reasons. I feel bad for\nhim because my penis is extremely large and very satisfying to…",
  "original_created_utc": 1617553864,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我的 \"朋友 \"的阴茎很小，想知道到底什么是截止的\n有微阴茎的点？我的朋友太害怕了，谷歌图像。\n搜索这个，我也不能，原因完全不同。我觉得不好\n因为我的阴茎非常大，非常满足... ...",
      "title": "微阴茎阈值？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我的 \"朋友 \"的陰莖很小，想知道到底什麼是截止的\n有微陰莖的點？我的朋友太害怕了，谷歌圖像。\n搜索這個，我也不能，原因完全不同。我覺得不好\n因爲我的陰莖非常大，非常滿足... ...",
      "title": "微陰莖閾值？"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "私の \"友人 \"は小さなペニスを持っていますが、これは一体何を基準にしているのでしょうか？\n疑問に思っていたのですが、マイクロペニスであることの基準はどこにあるのでしょうか？友人はグーグルで画像検索するのが怖くてできません。\n私も全く別の理由で検索できません。私のペニスは非常に大きいので、彼には悪いことをしたと思っています。\n私のペニスは非常に大きく、とても満足しているので、彼には悪いことをしたと思っています。",
      "title": "マイクロペニスの閾値？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "私の \"友人 \"は小さなペニスを持っていますが、これは一体何を基準にしているのでしょうか？\n疑問に思っていたのですが、マイクロペニスであることの基準はどこにあるのでしょうか？友人はグーグルで画像検索するのが怖くてできません。\n私も全く別の理由で検索できません。私のペニスは非常に大きいので、彼には悪いことをしたと思っています。\n私のペニスは非常に大きく、とても満足しているので、彼には悪いことをしたと思っています。",
      "title": "マイクロペニスの閾値？"
    }
  ],
  "title": "Micro-penis threshold?",
  "created_utc": 1617560582,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So my &quot;friend&quot; has a small penis and was wondering what exactly is the cut-off point for having a micro-penis? My friend is far too terrified to Google image search this and I can&#39;t either for entirely different reasons. I feel bad for him because my penis is extremely large and very satisfying to women and definitely works perfectly all the time, so I wanted to help him answer this question. He says that if he&#39;s at least a little above the threshold it might make him feel better.</p>\n\n<p>Also, who is the piece of shit Doctor that coined the term &quot;micro-penis&quot; and why is it even considered a medical issue? Under what circumstances would a doctor even diagnose this issue? What does that conversation sound like? Is the doctor held responsible when the patient immediately jumps out of the nearest window upon receiving this diagnosis? These are all things my friend is curious about.</p>\n\n<p>Thank you for reading, and again, just to be clear,<em>my</em> penis is huge and wonderful and I definitely am not asking this question to regain at least a shred of confidence and self-esteem. And I absolutely do not need just this one small victory to continue getting out of bed in the morning.</p>\n\n<p>P. S. - obviously I&#39;m asking this for myself and despite the tone of the post it is a serious concern of mine.</p>\n</div><!-- SC_ON -->",
  "score": 289,
  "permalink": "/r/TooAfraidToAsk/comments/mjzkec/micropenis_threshold/",
  "subreddit": "TooAfraidToAsk",
  "id": "mjzkec",
  "is_self": true,
  "media": null,
  "is_video": false
}