{
  "author": "Guru899",
  "the_new_excerpt": "The company is working on a vaccine for the novel coronavirus that works via\ntablets instead of injection.\n\nIf Vaxart reports positive results from this clinical trial, investors will\nlikely see shares of VXRT stock soar higher.\n\nThe stock is up 48% and climbing. The stock price is Still in the low…",
  "original_created_utc": 1612300296,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "该公司正在研究一种新型冠状病毒的疫苗，该疫苗通过\n片剂而不是注射。\n\n如果Vaxart报告了这项临床试验的积极结果，投资者将\n很可能看到VXRT股价飙升。\n\n该股上涨48%，并不断攀升。股价仍然在低...",
      "title": "Vaxart(NASDAQ:VXRT)股价周二走高，关于这家生物技术公司，投资者要记住几件事。VXRT股价上涨与临床试验结果有关。Vaxart预计将在本周某个时候公布1期试验的结果。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "該公司正在研究一種新型冠狀病毒的疫苗，該疫苗通過\n片劑而不是注射。\n\n如果Vaxart報告了這項臨牀試驗的積極結果，投資者將\n很可能看到VXRT股價飆升。\n\n該股上漲48%，並不斷攀升。股價仍然在低...",
      "title": "Vaxart(NASDAQ:VXRT)股價週二走高，關於這家生物技術公司，投資者要記住幾件事。VXRT股價上漲與臨牀試驗結果有關。Vaxart預計將在本週某個時候公佈1期試驗的結果。"
    }
  ],
  "title": "Vaxart (NASDAQ:VXRT) stock is heading higher on Tuesday and there are a couple of things investors will want to keep in mind about the biotechnology company. VXRT stock gaining has to do with clinical trial results. Vaxart is expected to announce results from a Phase 1 trial sometime this week.",
  "created_utc": 1612335172,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The company is working on a vaccine for the novel coronavirus that works via tablets instead of injection.</p>\n\n<p>If Vaxart reports positive results from this clinical trial, investors will likely see shares of VXRT stock soar higher.</p>\n\n<p>The stock is up 48% and climbing.  The stock price is Still in the low $20s but has a huge upside as the article suggests.  Be first to capitalize on, in my opinion the best alternative for Covid 19, a oral pill solution that is easily adminstered and transported.  This will undoubtedly be the ultimate Coronavirus  solution going forward as the different strains continue.</p>\n</div><!-- SC_ON -->",
  "score": 84,
  "permalink": "/r/investing/comments/lb6jg4/vaxart_nasdaqvxrt_stock_is_heading_higher_on/",
  "subreddit": "investing",
  "id": "lb6jg4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518534791
}