{
  "author": "bultodepapas",
  "original_created_utc": 1624389625,
  "title": "Miners Welcome to Colombia",
  "created_utc": 1624437564,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I represent a small mining company in Colombia with over 5 years of experience in GPU and ASIC systems. We have good connections with the hydroelectric and solar power companies that can provide cheap and reliable power to mining operations. We are looking to expand our business and look forward to working hand in hand with companies looking to set up shop in Latin America. We would also be interested in buying used machines </p>\n\n<p><a href=\"https://preview.redd.it/kpbf2aypav671.png?width=890&amp;format=png&amp;auto=webp&amp;s=d74c11e0d7558d668aaedcb3ac9d6f09187088fa\">https://preview.redd.it/kpbf2aypav671.png?width=890&amp;format=png&amp;auto=webp&amp;s=d74c11e0d7558d668aaedcb3ac9d6f09187088fa</a></p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/Bitcoin/comments/o5uydw/miners_welcome_to_colombia/",
  "subreddit": "Bitcoin",
  "id": "o5uydw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I represent a small mining company in Colombia with over 5 years of experience\nin GPU and ASIC systems. We have good connections with the hydroelectric and\nsolar power companies that can provide cheap and reliable power to mining\noperations. We are looking to expand our business and look forward to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はコロンビアの小さな鉱山会社の代表で、5年以上の経験があります。\nGPUとASICシステムで5年以上の経験があります。私たちは、水力発電や太陽光発電の会社と良好な関係にあります。\n鉱山事業に安価で信頼性の高い電力を提供できる水力発電や太陽光発電の会社と良い関係にあります。\nオペレーションに安価で信頼性の高い電力を提供することができます。私たちは、ビジネスの拡大を目指しており、期待しています。",
      "title": "鉱山労働者、コロンビアへようこそ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我代表哥伦比亚的一家小型矿业公司，在GPU和ASIC系统方面有超过5年的经验。\n在GPU和ASIC系统方面有超过5年的经验。我们与水电和太阳能公司有良好的联系，可以为采矿业提供廉价和可靠的电力。\n我们与水电和太阳能公司有着良好的联系，这些公司可以为采矿作业提供廉价和可靠的电力。\n业务提供廉价和可靠的电力。我们正在寻求扩大我们的业务，并期待着...",
      "title": "欢迎来到哥伦比亚的矿工"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我代表哥倫比亞的一家小型礦業公司，在GPU和ASIC系統方面有超過5年的經驗。\n在GPU和ASIC系統方面有超過5年的經驗。我們與水電和太陽能公司有良好的聯繫，可以爲採礦業提供廉價和可靠的電力。\n我們與水電和太陽能公司有着良好的聯繫，這些公司可以爲採礦作業提供廉價和可靠的電力。\n業務提供廉價和可靠的電力。我們正在尋求擴大我們的業務，並期待着...",
      "title": "歡迎來到哥倫比亞的礦工"
    }
  ]
}