{
  "author": "Ill_Scallion_9134",
  "original_created_utc": 1631186062,
  "title": "Are spiral galaxies on their last leg of life?",
  "created_utc": 1631201037,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi folks,</p>\n\n<p>Is this the final stage of a galaxies life as the black hole has grown large enough that it is pulling every star i to the centre of the the galxay creating a vortex of light?</p>\n\n<p>If so, would galaxies that have an even disc/belt shape be mid aged as the black hole has enough force to keep the stars close but not on a tragectory inwards?</p>\n\n<p>Would young galaxies be clusters of stars where the black hole does not have enough force and time to shape it into a disc?</p>\n\n<p>Do all galaxies spin in the same direction? I only ask because if half of visible galaxies spinned one direction and the other half another direction would this indicate that the universe has hemispheres.</p>\n</div><!-- SC_ON -->",
  "score": 127,
  "permalink": "/r/askscience/comments/pkvrdg/are_spiral_galaxies_on_their_last_leg_of_life/",
  "subreddit": "askscience",
  "id": "pkvrdg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi folks,\n\nIs this the final stage of a galaxies life as the black hole has grown large\nenough that it is pulling every star i to the centre of the the galxay creating\na vortex of light?\n\nIf so, would galaxies that have an even disc/belt shape be mid aged as the black\nhole has enough force to keep…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\nこれは、ブラックホールが大きくなって、すべての星iを引っ張っているような、銀河の人生の最終段階なのでしょうか？\nブラックホールが大きくなって、すべての星が銀河の中心に引き寄せられて、光の渦を作っているのです。\n光の渦を作っているのでしょうか？\n\nそうだとすると、円盤状やベルト状の形をしている銀河は、ブラックホールの力で...続きを読む\nブラックホールが十分な力を持っているからです。",
      "title": "渦巻き銀河は人生の最後の一歩を踏み出したのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "各位朋友，你们好。\n\n这是一个星系生命的最后阶段，因为黑洞已经变得足够大了\n足够大，以至于它把所有的恒星都拉到星系的中心，形成一个光的漩涡？\n一个光的漩涡？\n\n如果是这样的话，那些具有均匀的圆盘/带状的星系会不会是中年的，因为黑洞有足够的力量保持\n黑洞有足够的力量来保持...",
      "title": "螺旋星系是否处于生命的最后阶段？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "各位朋友，你們好。\n\n這是一個星系生命的最後階段，因爲黑洞已經變得足夠大了\n足夠大，以至於它把所有的恆星都拉到星系的中心，形成一個光的漩渦？\n一個光的漩渦？\n\n如果是這樣的話，那些具有均勻的圓盤/帶狀的星系會不會是中年的，因爲黑洞有足夠的力量保持\n黑洞有足夠的力量來保持...",
      "title": "螺旋星系是否處於生命的最後階段？"
    }
  ]
}