{
  "author": "ducks_09",
  "original_created_utc": 1641757198,
  "title": "Comment Something Negative About a Cryptocurrency and Have People Guess Which One It Is",
  "created_utc": 1641785867,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As the title says, comment something negative about any cryptocurrency and see if people can guess which cryptocurrency you are talking about. &lt;/p&gt;\n\n&lt;p&gt;I see so many of the same types of posts right now so thought I would change it up and see if people are on the same page of the negatives of specific cryptocurrencies. &lt;/p&gt;\n\n&lt;p&gt;I plan on taking the results of the most upvoted comments and making a top X out of it and creating another poll to get more results of how the community feels on certain cryptocurrencies.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/rzzlnb/comment_something_negative_about_a_cryptocurrency/",
  "subreddit": "CryptoCurrency",
  "id": "rzzlnb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As the title says, comment something negative about any cryptocurrency and see\nif people can guess which cryptocurrency you are talking about.\n\nI see so many of the same types of posts right now so thought I would change it\nup and see if people are on the same page of the negatives of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルにあるように、任意の暗号通貨について否定的なコメントをし\nどの暗号通貨について話しているのかがわかるかどうか。\n\n同じような投稿をたくさん見かけるので、ちょっと変えてみようと思います。\nを否定する意見が同じかどうか見てみたい。",
      "title": "暗号通貨について否定的なコメントをし、人々にそれがどれであるかを推測してもらう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说，评论一些关于任何加密货币的负面信息，并看看\n如果人们能猜到你说的是哪种加密货币。\n\n我现在看到很多相同类型的帖子，所以我想我会改变它\n并看看人们是否在同一页上看到了关于加密货币的负面信息。",
      "title": "对一种加密货币发表负面评论，让人们猜测它是哪种货币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說，評論一些關於任何加密貨幣的負面信息，並看看\n如果人們能猜到你說的是哪種加密貨幣。\n\n我現在看到很多相同類型的帖子，所以我想我會改變它\n並看看人們是否在同一頁上看到了關於加密貨幣的負面信息。",
      "title": "對一種加密貨幣發表負面評論，讓人們猜測它是哪種貨幣"
    }
  ]
}