{
  "author": "OE4000",
  "the_new_excerpt": "OK this is not meant to be a pump post, but rather a timeline of events and some\nspeculation that there is a good chance GOEV's skateboard platform could\nactually end up being the base for the Apple car. I think Canoo is an awesome\ncompany in it's own right, but just presenting some potentially…",
  "original_created_utc": 1612399522,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，这并不是要做一个打气贴，而是一个事件的时间轴和一些。\n猜测，GOEV的滑板平台很有可能会\n实际上最终成为苹果汽车的基础。我觉得Canoo是一个很棒的\n公司的权利，但只是提出一些潜在的... ...",
      "title": "苹果-现代-卡努（GOEV）猜想"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，這並不是要做一個打氣貼，而是一個事件的時間軸和一些。\n猜測，GOEV的滑板平臺很有可能會\n實際上最終成爲蘋果汽車的基礎。我覺得Canoo是一個很棒的\n公司的權利，但只是提出一些潛在的... ...",
      "title": "蘋果-現代-卡努（GOEV）猜想"
    }
  ],
  "title": "Apple - Hyundai - Canoo (GOEV) speculation",
  "created_utc": 1612409060,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>OK this is not meant to be a pump post, but rather a timeline of events and some speculation that there is a good chance GOEV&#39;s skateboard platform could actually end up being the base for the Apple car. I think Canoo is an awesome company in it&#39;s own right, but just presenting some potentially interesting info for folks here.</p>\n\n<p><strong>Timeline:</strong></p>\n\n<ul>\n<li><strong>July 2019</strong> –Hyundai is developing an electric vehicle platform called E-GMP (<a href=\"https://www.electrive.com/2019/06/25/hyundai-is-developing-an-ev-platform/\">https://www.electrive.com/2019/06/25/hyundai-is-developing-an-ev-platform/</a>)</li>\n<li><strong>Feb 2020</strong> – Canoo and Hyundai co-developing skateboard for Hyundai&#39;s and Kia&#39;s future EVs / PBVs (<a href=\"https://www.hyundainews.com/en-us/releases/2982\">https://www.hyundainews.com/en-us/releases/2982</a>)</li>\n<li><strong>Aug 2020</strong> - Investor presentation restates Hyundai/Canoo partnership and also mentions a tech company using Canoo as base platform for it&#39;s smart car / AV (potentially Apple?)</li>\n<li><strong>Dec 2020</strong> – Canoo executive chairman says Apple entering market is a “very good thing” (<a href=\"https://finance.yahoo.com/news/why-apple-entering-the-ev-market-is-a-good-thing-113808559.html\">https://finance.yahoo.com/news/why-apple-entering-the-ev-market-is-a-good-thing-113808559.html</a>)</li>\n<li><strong>Dec 2020</strong> – Hyundai presents e-gmp at a digital event, which does not look like Canoo tech (<a href=\"https://www.electrive.com/2020/12/02/hyundai-presents-e-gmp-electric-car-platform/\">https://www.electrive.com/2020/12/02/hyundai-presents-e-gmp-electric-car-platform/</a>)</li>\n<li><strong>Jan 2021</strong> – Hyundai and Apple confirmed to be working on Apple car; Kia to manufacture (<a href=\"https://www.cnet.com/roadshow/news/apple-car-kia-hyundai-work/\">https://www.cnet.com/roadshow/news/apple-car-kia-hyundai-work/</a>)</li>\n<li><strong>Jan 2021</strong> – Several sources reveal Apple attempted to buy Canoo and was turned down; when asked to comment on it the exec chairman says “Canoo doesn’t openly comment on strategic discussions, relationships or partnerships unless deemed appropriate,” (potentially nothing but interesting choice of verbiage) (<a href=\"https://www.theverge.com/2021/1/12/22225026/apple-canoo-acquisition-investment-electric-car-goev\">https://www.theverge.com/2021/1/12/22225026/apple-canoo-acquisition-investment-electric-car-goev</a>)</li>\n<li><strong>Feb 2021</strong> – Analyst says “initial” Apple car will be based on e-gmp platform; car won’t be released until 2024/2025 (<a href=\"https://seekingalpha.com/news/3657363-apple-will-team-with-hyundai-for-first-apple-car-model-says-noted-analyst\">https://seekingalpha.com/news/3657363-apple-will-team-with-hyundai-for-first-apple-car-model-says-noted-analyst</a>)</li>\n<li><strong>Feb 2021</strong> – Apple to invest 3.6B in Kia for EV partnership (likely manufacturing capacity) and partnership confirmed through multiple sources (<a href=\"https://www.bloomberg.com/news/articles/2021-02-03/apple-to-invest-3-6-billion-in-kia-to-make-evs-donga-says\">https://www.bloomberg.com/news/articles/2021-02-03/apple-to-invest-3-6-billion-in-kia-to-make-evs-donga-says</a>)</li>\n</ul>\n\n<p><strong>My</strong> <strong>rationale:</strong></p>\n\n<p>Hyundai was already building the E-GMP platform in 2019 and was still actively seeking partners to develop future tech for skateboard and formed a partnership with Canoo to do exactly that. They indicated that this co-developed platform would be used in future vehicles. The E-GMP platform they eventually released seems way less advanced than Canoo&#39;s platform in the photos (e.g. it has struts vs Canoo&#39;s with leaf spring suspension), so the E-GMP platform could be the intermediate step until the co-developed platform is ready.</p>\n\n<p>Apple tried to buy Canoo for it’s skateboard platform in 2020 and was turned down by Canoo. This makes a lot of sense for Apple because Canoo platform is really advanced (steer-by-wire, leaf spring suspension, crash test incorporated into skateboard, batteries incorporated into structure, very modular and fast development times/costs) and lets Apple focus on what they excel at, which is tech and quick development cycles.</p>\n\n<p>Apple eventually forms a manufacturing partnership with Hyundai and it&#39;s rumored they&#39;re using Hyundai skateboard in the &quot;initial&quot; version, which is important because it signals they still want to use 3P skateboard. It seems that while they are likely using the E-GMP platform for the first iteration, the 2024 timeline easily puts them in line to use the new Canoo/Hyundai platform when it is done, which is consistent with the fact that Apple has already tried to purchase Canoo specifically for it&#39;s skateboard platform.</p>\n\n<p><strong>tl;dr -</strong> seems very possible that the Apple car will use the Canoo skateboard as the foundation</p>\n</div><!-- SC_ON -->",
  "score": 257,
  "permalink": "/r/investing/comments/lc34o6/apple_hyundai_canoo_goev_speculation/",
  "subreddit": "investing",
  "id": "lc34o6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518536213
}