{
  "author": "Dendi",
  "original_created_utc": 1639840955,
  "title": "Why don't we have different leaders names for capitalism, but we have Maoist, Marxist, and Lenninist communists?",
  "created_utc": 1639888695,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;From my understanding of history, capitalism has had thought leaders as well. Why don&amp;#39;t we have Lockian capitalism or FDR capitalism? I know we have Keynesian economics, but that doesn&amp;#39;t feel like it has the same heft. &lt;/p&gt;\n\n&lt;p&gt;I know this is probably a much bigger question than I am making it, but I was just curious.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/rj9mus/why_dont_we_have_different_leaders_names_for/",
  "subreddit": "AskHistorians",
  "id": "rj9mus",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "From my understanding of history, capitalism has had thought leaders as well.\nWhy don't we have Lockian capitalism or FDR capitalism? I know we have Keynesian\neconomics, but that doesn't feel like it has the same heft.\n\nI know this is probably a much bigger question than I am making it, but I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の歴史認識では、資本主義にも思想家がいた。\nなぜロック資本主義やFDR資本主義がないのでしょうか？ケインズ主義があるのは知っています。\n経済学ですが、これには重厚感がないように感じます。\n\nこれはおそらく私が作っているよりもずっと大きな問題だと思いますが、私は......",
      "title": "資本主義の指導者名は違っても、毛沢東主義、マルクス主義、レニン主義の共産主義者はいるのはなぜか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "根据我对历史的理解，资本主义也有思想领袖。\n为什么我们没有洛克式资本主义或FDR式资本主义？我知道我们有凯恩斯主义\n经济学，但这并不像它有同样的影响力。\n\n我知道这可能是一个比我说的要大得多的问题，但我...",
      "title": "为什么我们的资本主义没有不同的领导人名称，而我们却有毛泽东主义、马克思主义和列宁主义的共产主义者？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據我對歷史的理解，資本主義也有思想領袖。\n爲什麼我們沒有洛克式資本主義或FDR式資本主義？我知道我們有凱恩斯主義\n經濟學，但這並不像它有同樣的影響力。\n\n我知道這可能是一個比我說的要大得多的問題，但我...",
      "title": "爲什麼我們的資本主義沒有不同的領導人名稱，而我們卻有毛澤東主義、馬克思主義和列寧主義的共產主義者？"
    }
  ]
}