{
  "author": "ltogirl",
  "original_created_utc": 1636545292,
  "title": "Women who consider their partnership \"modern\" and \"equal\", how does it look like? How is your everyday life?",
  "created_utc": 1636582469,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The purpose of this post is that I am interested in how others live their lives in an equal and modern relationship where for example both go to work or chores equally. I want to collect ideas on how a modern/postmodern partnership could look like with your own experiences, \nthank you!</p>\n\n<p>edit: thanks for all of your answers so far!</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskWomen/comments/qqsqyo/women_who_consider_their_partnership_modern_and/",
  "subreddit": "AskWomen",
  "id": "qqsqyo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The purpose of this post is that I am interested in how others live their lives\nin an equal and modern relationship where for example both go to work or chores\nequally. I want to collect ideas on how a modern/postmodern partnership could\nlook like with your own experiences, thank you!\n\nedit: thanks…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この投稿の目的は、例えば仕事や家事を共にするような対等で現代的な関係の中で\n対等で現代的な関係の中で、他の人がどのように生活しているのか興味があります。\n均等に。モダン/ポストモダンのパートナーシップがどのようなものか、アイデアを集めたいのです。\n皆さんの経験と合わせて、どのように見えるかアイデアを集めたいと思います。\n\nedit: ありがとうございました...。",
      "title": "自分のパートナーシップを「モダン」「イコール」と考える女性たち、それはどのようなものでしょうか？また、日常生活はどうですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这篇文章的目的是，我对其他人是如何生活的感兴趣\n在一个平等和现代的关系中，例如双方都去工作或做家务\n平等。我想收集关于现代/后现代伙伴关系的想法。\n谢谢你的经验。\n\n编辑：谢谢...",
      "title": "认为自己的伙伴关系是 \"现代 \"和 \"平等 \"的女性，它是怎样的？你们的日常生活是怎样的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這篇文章的目的是，我對其他人是如何生活的感興趣\n在一個平等和現代的關係中，例如雙方都去工作或做家務\n平等。我想收集關於現代/後現代夥伴關係的想法。\n謝謝你的經驗。\n\n編輯：謝謝...",
      "title": "認爲自己的夥伴關係是 \"現代 \"和 \"平等 \"的女性，它是怎樣的？你們的日常生活是怎樣的？"
    }
  ]
}