{
  "author": "mikitacurve",
  "the_new_excerpt": "I mentioned offhand in one of my own comments\n[https://old.reddit.com/r/AskHistorians/comments/meeyhu/how_was_the_legacy_of_the_decemberist_revolt/gsjqyg4/]\nthat I would die happy if I could find a book exploring how Kropotkin was\nmemorialized by the Soviets, and then I thought, well, why do I have…",
  "original_created_utc": 1618413173,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自分のコメントの中でオフレコで触れたのは\n[https://old.reddit.com/r/AskHistorians/comments/meeyhu/how_was_the_legacy_of_the_decemberist_revolt/gsjqyg4/]\nソビエトでクロポトキンがどのように追悼されたかを探る本を見つけられたら幸せに死ねる」と自分のコメントに書いたところ\nソビエトに追悼されたクロポトキンを探究する本があれば幸せに死ねる」と言っていたのですが、そういえばなぜか...と思いました。",
      "title": "なぜソ連はクロポトキンを称え、彼の名を冠したものまで作る一方で、他のロシアのアナキストを弾圧したのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在自己的一篇评论中不经意地提到了。\n[https://old.reddit.com/r/AskHistorians/comments/meeyhu/how_was_the_legacy_of_the_decemberist_revolt/gsjqyg4/]\n如果能找到一本探讨克鲁泡特金的书，我会高兴死的。\n纪念苏联，然后我想， 好了，为什么我有... ...",
      "title": "苏联人为什么要尊敬克鲁泡特金，甚至不惜以他的名字命名事物，同时又要镇压其他俄国无政府主义者？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在自己的一篇評論中不經意地提到了。\n[https://old.reddit.com/r/AskHistorians/comments/meeyhu/how_was_the_legacy_of_the_decemberist_revolt/gsjqyg4/]\n如果能找到一本探討克魯泡特金的書，我會高興死的。\n紀念蘇聯，然後我想， 好了，爲什麼我有... ...",
      "title": "蘇聯人爲什麼要尊敬克魯泡特金，甚至不惜以他的名字命名事物，同時又要鎮壓其他俄國無政府主義者？"
    }
  ],
  "title": "Why did the Soviets honor Kropotkin, even going so far as to name things after him, while at the same time suppressing other Russian Anarchists?",
  "created_utc": 1618484349,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I mentioned offhand in <a href=\"https://old.reddit.com/r/AskHistorians/comments/meeyhu/how_was_the_legacy_of_the_decemberist_revolt/gsjqyg4/\">one of my own comments</a> that I would die happy if I could find a book exploring how Kropotkin was memorialized by the Soviets, and then I thought, well, why do I have to know everything? Just because I&#39;m striving for experthood doesn&#39;t mean I can&#39;t ask for help along the way! So I&#39;m turning to you, community. Why did the Soviets memorialize Kropotkin like they did? For that matter, how exactly <em>did</em> they memorialize him, and how did that change over time?</p>\n\n<p>Also, <a href=\"https://old.reddit.com/r/AskHistorians/comments/975e3q/why_did_the_soviets_honor_kropotkin_even_going_so/\">this question was previously asked</a> by <a href=\"/u/heeet\">u/heeet</a>. To add onto his question, I&#39;m also particularly curious what the thought process was when the Palace of the Soviets Metro station was renamed to Kropotkinskaya in 1957. The simple answer is that it was named after the Kropotkin Gate neighborhood, which was named after Kropotkin because he was born there, but it can&#39;t have been that simple. Why that local name out of all the others? Why not Prechistenskaya, which is also a local name for the neighborhood? Someone had to have had a reason for Kropotkin in particular.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/mqsmsk/why_did_the_soviets_honor_kropotkin_even_going_so/",
  "subreddit": "AskHistorians",
  "id": "mqsmsk",
  "is_self": true,
  "media": null,
  "is_video": false
}