{
  "author": "RADIO02118",
  "the_new_excerpt": "Before you spend another day hosting your shill hedge fund buddies to come on\nthe air and demonize r/wallstreetbets [/r/wallstreetbets] I hope you read this.\n\nYour contempt for the retail investor (your audience) is palpable and if you\ndon’t get it together, you’ll lose an entire new generation of…",
  "original_created_utc": 1611629918,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在你再花一天时间接待你的骗子对冲基金朋友来之前\n的空气和妖魔化r/wallstreetbets [/r/wallstreetbets]我希望你能读到这个。\n\n我一直在想，这些做空GME的基金，就像你在Melvin的孩子们一样。\n首都/你对这个分论坛的报道，我越来越... ...",
      "title": "致CNBC的一封公开信"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在你再花一天時間接待你的騙子對沖基金朋友來之前\n的空氣和妖魔化r/wallstreetbets [/r/wallstreetbets]我希望你能讀到這個。\n\n我一直在想，這些做空GME的基金，就像你在Melvin的孩子們一樣。\n首都/你對這個分論壇的報道，我越來越... ...",
      "title": "致CNBC的一封公開信"
    }
  ],
  "title": "An open letter to CNBC",
  "created_utc": 1611655278,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Before you spend another day hosting your shill hedge fund buddies to come on the air and demonize <a href=\"/r/wallstreetbets\">r/wallstreetbets</a> I hope you read this. </p>\n\n<p>Your contempt for the retail investor (your audience) is palpable and if you don’t get it together, you’ll lose an entire new generation of investors. </p>\n\n<p>I keep thinking about these funds that are short GME like your boys at Melvin Capital / your coverage of this subreddit and I’m getting madder and madder. </p>\n\n<p>These funds can manipulate the market via your network and if they screw up big because they don’t even know the basics of portfolio risk 101 and using position sizing, they just get a bailout from their billionaire friends at Citadel. Then they have the nerve to turn us into public enemy #1 just because we believe in an underdog company getting a second chance. </p>\n\n<p>We don’t have billionaires to bail us out when we mess up our portfolio risk and a position goes against us. We can’t go on TV and make attempts to manipulate millions to take our side of the trade. If we mess up as bad as they did, we’re wiped out, have to start from scratch and are back to giving handjobs behind the dumpster at Wendy’s. </p>\n\n<p>Seriously. Motherfuck these people. I sincerely hope they suffer. <strong>We want to see the loss porn.</strong></p>\n</div><!-- SC_ON -->",
  "score": 19551,
  "permalink": "/r/wallstreetbets/comments/l54ky3/an_open_letter_to_cnbc/",
  "subreddit": "wallstreetbets",
  "id": "l54ky3",
  "is_self": true,
  "media": null,
  "is_video": false
}