{
  "author": "dementatron21",
  "the_new_excerpt": "Space agencies, like NASA, who have done research on growing crops on the moon\nusually say hydroponics and other similar systems would be ideal for growing\ncrops to be consumed by lunar colonists but as far as I am aware this method is\nonly applicable to crops with shallow roots. This got me…",
  "original_created_utc": 1612959501,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "像美国航天局这样的空间机构，已经对在月球上种植作物进行了研究。\n通常说，水培和其他类似的系统将是理想的种植。\n但据我所知，这种方法是由月球殖民者食用的。\n只适用于根系较浅的农作物。这让我...",
      "title": "能否在月球雷公石上种植农作物？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "像美國航天局這樣的空間機構，已經對在月球上種植作物進行了研究。\n通常說，水培和其他類似的系統將是理想的種植。\n但據我所知，這種方法是由月球殖民者食用的。\n只適用於根系較淺的農作物。這讓我...",
      "title": "能否在月球雷公石上種植農作物？"
    }
  ],
  "title": "Would it be possible to cultivate crops in Lunar regolith?",
  "created_utc": 1613000849,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Space agencies, like NASA, who have done research on growing crops on the moon usually say hydroponics and other similar systems would be ideal for growing crops to be consumed by lunar colonists but as far as I am aware this method is only applicable to crops with shallow roots. This got me wondering if it would be possible to grow root crops, e.g potatoes, carrots and other similar things, using lunar regolith as a growth medium.</p>\n\n<p>So if the colonists were able to set up an area with adequate external needs for the plants such as optimal light, carbon dioxide concentration and enough room to grow would it be possible for plants to properly grow in these conditions if they were to be rooted in Lunar regolith?</p>\n\n<p>If this is possible would these crops be safe for human consumption or would there be issues regarding radiation and the jaggedness of regolith that would make these crops unsafe for consumption? And if so would there be feasible ways to &quot;convert&quot; the regolith so the crops grown in it would be healthy and safe for human consumption?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/askscience/comments/lgsgc1/would_it_be_possible_to_cultivate_crops_in_lunar/",
  "subreddit": "askscience",
  "id": "lgsgc1",
  "is_self": true,
  "media": null,
  "is_video": false
}