{
  "author": "ZhangtheGreat",
  "the_new_excerpt": "What do I mean by “best”? I’ll let you set your own criteria.\n\nFor me, as a very new investor (I’m only a little over a month in, so take my\nword with a grain of salt), “best” are the stocks that have shown consistent,\nsteady growth and have been minimally affected by losses. At this time, my…",
  "original_created_utc": 1621016981,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最高」というのはどういうことか。あなたが自分で基準を決めるのに任せます。\n\nまだ投資を始めて1ヶ月ほどの新米投資家である私にとって、「ベスト」とは、安定した収益を上げている銘柄のことです。\n私にとっての「ベスト」は、一貫した安定した成長を示し、その影響を最小限に抑えた銘柄です。\n損失の影響を最小限に抑え、安定した成長を遂げている銘柄が「ベスト」です。今のところ、私の...",
      "title": "あなたのポートフォリオのベスト銘柄"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我说的 \"最好 \"是什么意思？我将让你自己设定标准。\n\n对我来说，作为一个非常新的投资者（我只做了一个多月，所以请相信我的话。\n对我来说，作为一个非常新的投资者（我才加入一个多月，所以请相信我的话），\"最佳 \"是指那些表现出持续、稳定增长的股票。\n稳定的增长，并且受损失的影响最小。在这个时候，我...",
      "title": "你的投资组合中的最佳股票"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我說的 \"最好 \"是什麼意思？我將讓你自己設定標準。\n\n對我來說，作爲一個非常新的投資者（我只做了一個多月，所以請相信我的話。\n對我來說，作爲一個非常新的投資者（我才加入一個多月，所以請相信我的話），\"最佳 \"是指那些表現出持續、穩定增長的股票。\n穩定的增長，並且受損失的影響最小。在這個時候，我...",
      "title": "你的投資組合中的最佳股票"
    }
  ],
  "title": "Best stocks in your portfolio",
  "created_utc": 1621050549,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What do I mean by “best”? I’ll let you set your own criteria.</p>\n\n<p>For me, as a very new investor (I’m only a little over a month in, so take my word with a grain of salt), “best” are the stocks that have shown consistent, steady growth and have been minimally affected by losses. At this time, my four “best” stocks are…</p>\n\n<p>4) Costco (COST) - It’s had a few swings in its price, but it’s never dipped into the red. As of this post, it’s gained 6.25% in a little over a month, and it’s already paid a dividend.</p>\n\n<p>3) Goldman Sachs (GS) - I’ve only held this stock for about two-three weeks, but its growth has been spectacular. In researching, I found out it was still undervalued, and man, has it shown. Even when it tumbled, it hasn’t been a nightmarish fall. 6.5% growth already.</p>\n\n<p>2) AbbVie (ABBV) - I knew nothing about this company and spent three days researching it before I bought its stock, and it’s been one of the best purchased ever. It doesn’t grow as fast, but it hardly ever falls, even when the whole market is tanking. Also, its dividend is huge (4.46%). It’s grown 8.35% in almost four weeks.</p>\n\n<p>1) Berkshire Hathaway (BRK.B) - First stock I ever bought. Outstanding, steady growth. Hardly has a down day. 10.8% growth in over a month. The only drawback? No dividends.</p>\n</div><!-- SC_ON -->",
  "score": 54,
  "permalink": "/r/stocks/comments/ncfhmv/best_stocks_in_your_portfolio/",
  "subreddit": "stocks",
  "id": "ncfhmv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590803295
}