{
  "author": "glcorso",
  "the_new_excerpt": "Something I would never ever do with the stock market is borrow $300,000 from\nthe brokerage and invest it in a single stock.\n\nBuying a property as an investment and not a home seams like an extremely high\nrisk play. The money i could get for rent here would probably only break me even\non taxes in my…",
  "original_created_utc": 1617670392,
  "localize": [
    {
      "locale": "ja-JA",
      "the_new_excerpt": "私が株式市場で絶対にしないことは、証券会社から30万円を借りて、一つの銘柄に投資することです。\n証券会社から30万ドルを借りて、1つの銘柄に投資する。\n\n家ではなく、投資用の不動産を買うというのは、非常にハイリスクな行為に思えます。\n家ではなく、投資用の不動産を買うのは、非常にリスクの高い遊びのように思えます。ここで家賃を払っても、税金を払っても収支は変わらないでしょう。\n私の場合は税金が...",
      "title": "不動産は危険だ、気持ちを切り替えよう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在股市上绝对不会做的事情，就是向你借30万。\n的经纪公司，并将其投资于一只股票。\n\n购买物业作为投资，而不是一个家似乎像一个极高的\n风险游戏。我在这里能拿到的租金大概只能让我收支平衡。\n在我...",
      "title": "房地产很危险，改变我的想法。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在股市上絕對不會做的事情，就是向你借30萬。\n的經紀公司，並將其投資於一只股票。\n\n購買物業作爲投資，而不是一個家似乎像一個極高的\n風險遊戲。我在這裏能拿到的租金大概只能讓我收支平衡。\n在我...",
      "title": "房地產很危險，改變我的想法。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "私が株式市場で絶対にしないことは、証券会社から30万円を借りて、一つの銘柄に投資することです。\n証券会社から30万ドルを借りて、1つの銘柄に投資する。\n\n家ではなく、投資用の不動産を買うというのは、非常にハイリスクな行為に思えます。\n家ではなく、投資用の不動産を買うのは、非常にリスクの高い遊びのように思えます。ここで家賃を払っても、税金を払っても収支は変わらないでしょう。\n私の場合は税金が...",
      "title": "不動産は危険だ、気持ちを切り替えよう"
    }
  ],
  "title": "Real estate is dangerous, change my mind.",
  "created_utc": 1617696373,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Something I would never ever do with the stock market is borrow $300,000 from the brokerage and invest it in a single stock. </p>\n\n<p>Buying a property as an investment and not a home seams like an extremely high risk play. The money i could get for rent here would probably only break me even on taxes in my state, let alone the other expenses that go into being a land lord. What I&#39;ve been told here is that you&#39;re looking to levarage the money you borrow from the bank and make money on the appreciation of the property. </p>\n\n<p>What if the neighborhood turns to shit?? What if you buy at the peak moments of the sellers market and the value of the home drops drastically. Isn&#39;t that leverage going to be equally as bad to the downside? If i put down $100,000 for a $500,000 home and the value drops to $400,000 by years end... I lost the entire value of my initial investment in the blink if an eye! </p>\n\n<p>Am I wrong to be so cautious about leveraging money?</p>\n</div><!-- SC_ON -->",
  "score": 550,
  "permalink": "/r/investing/comments/mkzjy4/real_estate_is_dangerous_change_my_mind/",
  "subreddit": "investing",
  "id": "mkzjy4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961877887
}