{
  "author": "Tersiv",
  "the_new_excerpt": "Because looking at the price action, it's $14,564 a share now and 2022 was a\ntough year for me. I had to build this time machine and it wasn't cheap so I\nhave to cover my costs, I'm sorry.\n\nI will take some of the proceeds and and donate it to the WallStreetBets Museum\nof Autism on 5th Avenue in…",
  "original_created_utc": 1615314281,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "因为从价格走势上看，现在是14564元/股，2022年是一个\n对我来说是艰难的一年。我必须建造这台时光机，而且它不便宜，所以我...\n必须支付我的成本，我很抱歉。\n\n我将采取一些收益和 并捐赠给华尔街赌注博物馆。\n在第五大道上的自闭症...",
      "title": "我为什么要卖GME"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因爲從價格走勢上看，現在是14564元/股，2022年是一個\n對我來說是艱難的一年。我必須建造這臺時光機，而且它不便宜，所以我...\n必須支付我的成本，我很抱歉。\n\n我將採取一些收益和 並捐贈給華爾街賭注博物館。\n在第五大道上的自閉症...",
      "title": "我爲什麼要賣GME"
    }
  ],
  "title": "Why I'm selling GME",
  "created_utc": 1615328263,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Because looking at the price action, it&#39;s $14,564 a share now and 2022 was a tough year for me. I had to build this time machine and it wasn&#39;t cheap so I have to cover my costs, I&#39;m sorry.</p>\n\n<p>I will take some of the proceeds and and donate it to the WallStreetBets Museum of Autism on 5th Avenue in Manhattan that opened last week; the original piss-drinking martini glass was amazing to see in person as was DFV&#39;s headband.</p>\n\n<p>It&#39;s a bit lonely on earth now that the population has dropped by 9.4m but I will hopefully catch you on the next $TSLA moon flight next week. Can go to the MilkBar at Promontorium Archerusia and catchup on good old times when we used to live on earth?</p>\n\n<p>&#x200B;</p>\n\n<p>EDIT: FUCK I ACCIDENTALLY POSTED THIS TOO EARLY - this is a glitch in my faulty time machine and I don&#39;t know how to amend, was scheduled to post this for July 2023. FUCK.</p>\n</div><!-- SC_ON -->",
  "score": 46937,
  "permalink": "/r/wallstreetbets/comments/m1cqod/why_im_selling_gme/",
  "subreddit": "wallstreetbets",
  "id": "m1cqod",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542589291
}