{
  "author": "gilgamesh_20",
  "original_created_utc": 1632207838,
  "title": "If you have the habit of checking charts mid sleep, or just after waking up or ruining your sleep schedule, please don't. It's not healthy and it's not worth it. Your health comes first.",
  "created_utc": 1632252670,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is a very common habit among newbies and alot of veterans too. You could be sleeping and suddenly you will wake up and look at charts or some even ruin their whole sleeping schedule to look at charts.</p>\n\n<p>Some people could be living in Asia but living in American timezone lol. This is really bad habit.</p>\n\n<p>It&#39;s not healthy. You need rest. Once you wake up do your normal chores, drink lot of water, do exercise and then look at charts. </p>\n\n<p>Dips are depressing. No matter how many people claim that dips are nothing but sale, it&#39;s still depressing.  Waking upto it is not a good way to start your day.</p>\n\n<p>That&#39;s all I have to say! Just your internet homie looking out for you. Hope you and your family are doing great!</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/psdlaf/if_you_have_the_habit_of_checking_charts_mid/",
  "subreddit": "CryptoCurrency",
  "id": "psdlaf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is a very common habit among newbies and alot of veterans too. You could be\nsleeping and suddenly you will wake up and look at charts or some even ruin\ntheir whole sleeping schedule to look at charts.\n\nSome people could be living in Asia but living in American timezone lol. This is\nreally bad…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、初心者はもちろんのこと、ベテランにもよく見られる癖です。睡眠中に\n睡眠中に突然目が覚めて、チャートを見たり、中には睡眠時間を削ってまで\nチャートを見るために睡眠時間を削る人もいます。\n\nアジアに住んでいても、アメリカのタイムゾーンに住んでいる人もいるでしょう(笑)。これは\n本当にひどい...。",
      "title": "もしあなたが、睡眠中や起床直後にチャートをチェックする癖があったり、睡眠スケジュールを崩しているなら、やめてください。健康に良くないし、そんなことをする価値もありません。あなたの健康が第一です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是新手和很多老手的一个非常普遍的习惯。你可能正在\n你可能正在睡觉，突然间你就会醒来，看看图表，或者有些人甚至毁掉你的图表。\n有些人甚至为了看图表而毁掉自己的整个睡眠计划。\n\n有些人可能生活在亚洲，但生活在美国的时区，笑。这真是\n真的很糟糕...",
      "title": "如果你有在睡眠中查看图表的习惯，或刚睡醒或破坏你的睡眠计划，请不要这样做。这是不健康的，也不值得。你的健康是第一位的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是新手和很多老手的一個非常普遍的習慣。你可能正在\n你可能正在睡覺，突然間你就會醒來，看看圖表，或者有些人甚至毀掉你的圖表。\n有些人甚至爲了看圖表而毀掉自己的整個睡眠計劃。\n\n有些人可能生活在亞洲，但生活在美國的時區，笑。這真是\n真的很糟糕...",
      "title": "如果你有在睡眠中查看圖表的習慣，或剛睡醒或破壞你的睡眠計劃，請不要這樣做。這是不健康的，也不值得。你的健康是第一位的。"
    }
  ]
}