{
  "author": "AskScienceModerator",
  "original_created_utc": 1630580422,
  "title": "AskScience AMA Series: I'm Jon Schwantes from Pacific Northwest National Laboratory, and my team is working to uncover the origin of uranium \"Heisenberg\" cubes that resulted from Nazi Germany's failed nuclear program. Ask me anything!",
  "created_utc": 1630590884,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi Reddit, this is Jon Schwantes from PNNL. My team and I are working to uncover one of history&#39;s great mysteries. During WWII, the United States and Nazi Germany were competing to develop nuclear technology. The Allies thwarted Germany&#39;s program and confiscated 2 inch-by-2 inch uranium cubes that were at the center of this research. Where these cubes went after being smuggled out of Germany is the subject of much debate. Our research aims to resolve this question by using nuclear forensic techniques on samples that have been provided to us by other researchers, as well as on a uranium cube of unknown origin that has been located at our lab in Washington for years. I&#39;ll be on at 10:30am Pacific (1:30 PM ET, 17:30 UT) to answer your questions!</p>\n\n<p>Read more here:</p>\n\n<ul>\n<li><a href=\"https://www.pnnl.gov/news-media/world-war-ii-nazi-artifact-work-pnnl\">PNNL: World War II Nazi Artifact at Work at PNNL</a></li>\n<li><a href=\"https://physicstoday.scitation.org/do/10.1063/PT.6.4.20190501a/full/\">Physics Today: Where in the world are Nazi Germany&#39;s uranium cubes?</a></li>\n<li><a href=\"https://www.vice.com/en/article/93yvxa/this-may-be-a-heisenberg-cube-from-the-nazis-failed-nuke-program-scientists-say\">Vice: This May Be a &#39;Heisenberg Cube&#39; From the Nazis&#39; Failed Nuke Program, Scientists Say</a></li>\n</ul>\n\n<p>Username: <a href=\"/u/PNNL\">/u/PNNL</a></p>\n</div><!-- SC_ON -->",
  "score": 122,
  "permalink": "/r/askscience/comments/pgfkcn/askscience_ama_series_im_jon_schwantes_from/",
  "subreddit": "askscience",
  "id": "pgfkcn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi Reddit, this is Jon Schwantes from PNNL. My team and I are working to uncover\none of history's great mysteries. During WWII, the United States and Nazi\nGermany were competing to develop nuclear technology. The Allies thwarted\nGermany's program and confiscated 2 inch-by-2 inch uranium cubes that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、Reddit。PNNLのJon Schwantesです。私と私のチームは、歴史上の大きな謎の一つを解明するために\n歴史上の大きな謎の一つを解明しようとしています。第二次世界大戦中、アメリカとナチス・ドイツは核技術の開発を競っていました。\nドイツは核技術の開発を競っていました。連合国はそれを阻止しました。\n連合国はドイツの計画を阻止して 2インチ×2インチのウラン・キューブを没収しました...",
      "title": "AskScience AMAシリーズ。私はパシフィック・ノースウエスト国立研究所のジョン・シュワンテスです。私のチームは、ナチス・ドイツの失敗した核開発計画から生まれたウランの「ハイゼンベルグ」キューブの起源を明らかにしようとしています。何でも聞いてください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，Reddit，我是PNNL的Jon Schwantes。我和我的团队正在努力揭开\n历史上的一个大谜团。二战期间，美国和纳粹\n德国竞相开发核技术。盟军挫败了\n德国的计划，并没收了2英寸乘2英寸的铀方块。",
      "title": "AskScience AMA系列。我是来自太平洋西北国家实验室的乔恩-施万提斯，我的团队正在努力揭开纳粹德国核计划失败后产生的铀 \"海森堡 \"立方体的来源。问我任何问题!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，Reddit，我是PNNL的Jon Schwantes。我和我的團隊正在努力揭開\n歷史上的一個大謎團。二戰期間，美國和納粹\n德國競相開發核技術。盟軍挫敗了\n德國的計劃，並沒收了2英寸乘2英寸的鈾方塊。",
      "title": "AskScience AMA系列。我是來自太平洋西北國家實驗室的喬恩-施萬提斯，我的團隊正在努力揭開納粹德國核計劃失敗後產生的鈾 \"海森堡 \"立方體的來源。問我任何問題!"
    }
  ]
}