{
  "author": "myendlessbattle",
  "original_created_utc": 1650119783,
  "title": "Does hair actually absorb vitamins, proteins... from shampoo?",
  "created_utc": 1650133671,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A lot of shampoos contain biotin, vitamin E, Q10, wheat protein, zinc,  panthenol, coffein, different kinds of oils and all kinds of stuff. But does hair actually absorb this stuff? Will it make my hair better or it is just a marketing trick? I&amp;#39;m not a expert but I think that hair is basically dead keratin and it can&amp;#39;t and won&amp;#39;t absorb anything. But I could be wrong of course. Vitamin E and Q10 could improve the condition of my scalp skin if applied on the skin surface but that&amp;#39;s probably it.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s better for me to continue to take vitamins in form of tablets or should I buy one of these magic shampoos to improve to quality of my hair?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/askscience/comments/u4z4du/does_hair_actually_absorb_vitamins_proteins_from/",
  "subreddit": "askscience",
  "id": "u4z4du",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A lot of shampoos contain biotin, vitamin E, Q10, wheat protein, zinc,\npanthenol, coffein, different kinds of oils and all kinds of stuff. But does\nhair actually absorb this stuff? Will it make my hair better or it is just a\nmarketing trick? I'm not a expert but I think that hair is basically…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くのシャンプーには、ビオチン、ビタミンE、Q10、小麦プロテイン、亜鉛が含まれています。\nパンテノール、コーヒー、さまざまな種類のオイルなど、いろいろなものがあります。でも\n髪は実際にこれらを吸収するのでしょうか？髪が良くなるのでしょうか、それともただの\nマーケティングトリック？私は専門家ではありませんが、髪の毛というのは基本的に...",
      "title": "シャンプーに含まれるビタミンやタンパク質は、髪に吸収されるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很多洗发水含有生物素、维生素E、Q10、小麦蛋白、锌。\n泛醇、咖啡因、不同种类的油和各种东西。但是\n头发真的能吸收这些东西吗？它能使我的头发变得更好，还是只是一种\n营销技巧？我不是专家，但我认为，头发基本上是...",
      "title": "头发是否真的能从洗发水中吸收维生素、蛋白质...？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多洗髮水含有生物素、維生素E、Q10、小麥蛋白、鋅。\n泛醇、咖啡因、不同種類的油和各種東西。但是\n頭髮真的能吸收這些東西嗎？它能使我的頭髮變得更好，還是隻是一種\n營銷技巧？我不是專家，但我認爲，頭髮基本上是...",
      "title": "頭髮是否真的能從洗髮水中吸收維生素、蛋白質...？"
    }
  ]
}