{
  "author": "buddhist-truth",
  "the_new_excerpt": "TORONTO — Bitcoin-based exchange traded funds are getting the go-ahead from\nCanadian regulators, creating a path for a fund structure that investment\nmanagers say is unique in the industry.\n\nToronto-based Purpose Investments says its Bitcoin ETF will likely start trading\nthis week under the symbol…",
  "original_created_utc": 1613427715,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "多伦多--基于比特币的交易所交易基金正在得到多伦多市政府的批准。\n加拿大监管机构，为基金结构创造了一条道路，投\n经理们说是行业内独一无二的。\n\n总部位于多伦多的Purpose Investments表示，其比特币ETF将可能开始交易。\n本周，在符号...",
      "title": "监管层角力后，加拿大基金推进比特币ETF--最新消息"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "多倫多--基於比特幣的交易所交易基金正在得到多倫多市政府的批准。\n加拿大監管機構，爲基金結構創造了一條道路，投\n經理們說是行業內獨一無二的。\n\n總部位於多倫多的Purpose Investments表示，其比特幣ETF將可能開始交易。\n本週，在符號...",
      "title": "監管層角力後，加拿大基金推進比特幣ETF--最新消息"
    }
  ],
  "title": "Canadian funds move forward with Bitcoin ETFs after regulatory jockeying- update",
  "created_utc": 1613441064,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TORONTO — Bitcoin-based exchange traded funds are getting the go-ahead from Canadian regulators, creating a path for a fund structure that investment managers say is unique in the industry.</p>\n\n<p>Toronto-based Purpose Investments says its Bitcoin ETF will likely start trading this week under the symbol &quot;BTCC,&quot; after the fund worked with regulators to make sure it could create something that follows the rules for both the ETF market and the digital asset industry.</p>\n\n<p>An Ontario Securities Commission spokesperson says the regulator finished reviewing Purpose Investments&#39; final plan to offer securities last Thursday and gave the fund a receipt that makes it a reporting issuer in Ontario.</p>\n\n<p>After Purpose Investments announced the milestone, another Canadian fund, 3iQ, said it also received preliminary receipts for a Bitcoin ETF in all of the Canadian provinces and territories except for Quebec.</p>\n\n<p>Both funds claim to be &quot;physical&quot; Bitcoin ETFs, setting them apart from some of the other cryptocurrency investments out there, such as the Bitcoin futures that trade on the Chicago Mercantile Exchange.</p>\n\n<p>Purpose Investments Chief Investment Officer Greg Taylor says the fund is different from a derivative or futures contract, as Purpose Investments will buy Bitcoin every time someone puts money into the ETF.</p>\n\n<p>Taylor says Purpose Investments will also store the Bitcoin codes themselves, not on the internet, using a process called “cold storage.” OSC has described cold storage as &quot;a computer with no access to a network” that is less vulnerable to hacking.</p>\n\n<p>Purpose Investments says the end result of these Bitcoin ETFs is that investors will hold actual Bitcoin in their portfolios but can buy and sell it similarly to buying or selling a stock.</p>\n\n<p>&quot;The risk is for traditional investors that you have to open up a trading account to buy Bitcoin and you’re in self-custody — meaning you’re going to get the code and password for that coin. And you’re responsible for doing that,&quot; says Taylor. &quot;With the ETF structure, it’s going to be easier as we’ll do that with our custodian.&quot;</p>\n\n<p>CIBC Mellon is working as a fund administrator for Purpose Investments&#39; Bitcoin ETF, as the firm looks for ways to meet rising demand for cryptocurrencies.</p>\n\n<p>Ronald Landry, who runs Canadian ETF services for CIBC Mellon, says it is working on getting more cryptocurrency services up and running in Canada.</p>\n\n<p>3iQ chief executive Fred Pye says a physical Bitcoin ETF is the natural progression from its other investment vehicles, which include a publicly listed Bitcoin investment fund and a fund based on cryptocurrency Ether.</p>\n\n<p>Launching those past funds was not an easy feat.</p>\n\n<p>3iQ had to argue before the Ontario Securities Commission to get approval several years ago for its trust that would &quot;invest substantially all of its assets in Bitcoin.&quot; But that 2019 decision stopped short of signing off on an ETF structure, which the OSC decision said would have to undergo separate analysis since ETFs “require continuous purchases and sales to balance and rebalance the portfolio frequently and daily.”</p>\n\n<p>At that time, the OSC said, there were two ways to hold Bitcoin, either by directly purchasing it in a digital wallet or investing in securities of companies or other entities that held Bitcoin, such as Grayscale Bitcoin Trust, available to &quot;accredited investors” through a small number of Canadian institutions.</p>\n\n<p>While regulators initially tried to deny 3iQ a receipt for its earlier Bitcoin trust over concerns about the ability to value and safeguard Bitcoin and file audited financial statements, a 2019 &quot;foundational&quot; decision allowed it to move forward.</p>\n\n<p>&quot;Some novel asset classes and securities products fail. They become tulip bulbs or dot.com&#39;s. Others succeed and become gold or the next great technology. Securities regulators are not mandated to try to pick winners and losers,&quot; that decision said.</p>\n\n<p>Pye said in a statement that 3iQ considered their closed-end fund to be a &quot;success” as the company moves into the ETF space.</p>\n\n<p>Digital currency brokerage Coinbase says the price of Bitcoin has surged 368 per cent in the past year and 23 per cent in the past month, and at midday Monday sat at $61,443.79.</p>\n</div><!-- SC_ON -->",
  "score": 96,
  "permalink": "/r/investing/comments/lkosfu/canadian_funds_move_forward_with_bitcoin_etfs/",
  "subreddit": "investing",
  "id": "lkosfu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728621143
}