{
  "author": "Confucius3000",
  "original_created_utc": 1631099142,
  "title": "The issue of Collective Memory of the Spanish Flu",
  "created_utc": 1631127717,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For context, I am the son of a Peruvian father and a French-German mother. In the early 20th century, my Peruvian family were upper-middle class landowners of the Amazonian side of the Cusco region, my German family were businessmen in Frankfurt, while my French family were farmers and woodcutters in the Nantes region.</p>\n\n<p>Ever since the COVID-19 Pandemic started, I&#39;ve been curious to see if there were any family tales about what my great-grand-parents lived through the Spanish Flu Pandemic.</p>\n\n<p>I was surprised to discover, that there were no memories at all (a lot of memories from Malaria Epidemics in the Amazon from the Peruvian side, tho!)</p>\n\n<p>Scouring through the internet, I seem to notice that most of the people who tell tales from the Spanish Flu are of USA or Western-European decent.</p>\n\n<p>&#x200B;</p>\n\n<p>Has there been any research on the collective memory of the Spanish Flu, and if it was &quot;unequally remembered&quot; depending on the region?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/pk8brf/the_issue_of_collective_memory_of_the_spanish_flu/",
  "subreddit": "AskHistorians",
  "id": "pk8brf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For context, I am the son of a Peruvian father and a French-German mother. In\nthe early 20th century, my Peruvian family were upper-middle class landowners of\nthe Amazonian side of the Cusco region, my German family were businessmen in\nFrankfurt, while my French family were farmers and woodcutters…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、ペルー人の父とフランス系ドイツ人の母を持つ息子です。20世紀初頭の\n20世紀初頭、私のペルー人家族は、クスコ地方のアマゾン側の上層中産階級の土地所有者で、ドイツ人家族は、クスコ地方のビジネスマンでした。\n20世紀初頭、私のペルー人家族はクスコ地域のアマゾン側の中流階級の土地所有者で、私のドイツ人家族はフランクフルトのビジネスマンでした。\n私のドイツ人家族はフランクフルトのビジネスマンで、フランス人家族は農民と木工職人でした。",
      "title": "スペイン風邪の集合的記憶の問題"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为了说明情况，我的父亲是秘鲁人，母亲是法籍德国人。在\n在20世纪初，我的秘鲁家庭是库斯科地区亚马逊一侧的中上阶层地主。\n我的德国家庭是法兰克福的商人。\n我的德国家庭是法兰克福的商人，而我的法国家庭是农民和樵夫......",
      "title": "西班牙流感的集体记忆问题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲了說明情況，我的父親是祕魯人，母親是法籍德國人。在\n在20世紀初，我的祕魯家庭是庫斯科地區亞馬遜一側的中上階層地主。\n我的德國家庭是法蘭克福的商人。\n我的德國家庭是法蘭克福的商人，而我的法國家庭是農民和樵夫......",
      "title": "西班牙流感的集體記憶問題"
    }
  ]
}