{
  "author": "Troggolicious",
  "original_created_utc": 1634028510,
  "title": "Isn't CO2 emission reduction without carbon capture somewhat pointless?",
  "created_utc": 1634059678,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So as far as I understand it the CO2 content of the air simply determines the rate of change of the earth&#39;s temperature. Right now the energy surplus from solar radiation on the earth is somewhere around 1 W/m², which leads to warming. If we hypothetically reduced our CO2 output to zero instantly, we&#39;d still maintain the same CO2 atmosphere content and thus radioation surplus and the same rate of change, so the earth would still heat up at the current pace, right? Am I missing something? And if I&#39;m not, isn&#39;t it then mandatory to also look into ways of reducing the rate of change of temperature, rather than only trying to reduce the pace at which the rate of change rises (=reducing emissions)?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/askscience/comments/q6ht1t/isnt_co2_emission_reduction_without_carbon/",
  "subreddit": "askscience",
  "id": "q6ht1t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So as far as I understand it the CO2 content of the air simply determines the\nrate of change of the earth's temperature. Right now the energy surplus from\nsolar radiation on the earth is somewhere around 1 W/m², which leads to warming.\nIf we hypothetically reduced our CO2 output to zero instantly,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "つまり、私の理解では、空気中のCO2含有量が地球の温度の変化率を決定するだけです。\n地球の温度の変化率を決定するだけです。現在、地球上の太陽放射によるエネルギー余剰は\n現在、地球上の太陽放射によるエネルギーの余剰は約1W/m²であり、これが温暖化につながります。\n仮にCO2の排出量を瞬時にゼロにすると...。",
      "title": "炭素回収をしないでCO2排出量を削減することは、あまり意味がないのでは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以就我的理解，空气中的二氧化碳含量只是决定了\n地球温度的变化率。现在，地球上来自太阳辐射的能量盈余\n太阳辐射在地球上的能量过剩约为1瓦/平方米，这导致了变暖。\n如果我们假设将我们的二氧化碳输出量立即减少到零，...",
      "title": "没有碳捕获的二氧化碳减排不是有些毫无意义吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以就我的理解，空氣中的二氧化碳含量只是決定了\n地球溫度的變化率。現在，地球上來自太陽輻射的能量盈餘\n太陽輻射在地球上的能量過剩約爲1瓦/平方米，這導致了變暖。\n如果我們假設將我們的二氧化碳輸出量立即減少到零，...",
      "title": "沒有碳捕獲的二氧化碳減排不是有些毫無意義嗎？"
    }
  ]
}