{
  "author": "anonbitcoinperson",
  "the_new_excerpt": "In 2013 I started to get involved in BTC. I started realizing that I wanted\nfinancial sovereignty and freedom from the banks and my government. I figured\nout that the only way to do this was to take the fiat exit. So I exited from all\neuro and USD based investments and/or holdings. I transferred my…",
  "original_created_utc": 1622412074,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2013年、私はBTCに関わるようになりました。私は、以下のことを実現したいと考えていました。\n金融主権と銀行や政府からの自由を求めていました。そのためには\nそのためには、不換紙幣から撤退するしかないと思いました。そこで私は、ユーロや米ドルをベースにしたすべての\nユーロや米ドルベースの投資や保有から撤退しました。私は自分の...",
      "title": "2013年の暗号化のベテランからのアドバイス。出口計画にこだわること ;)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "2013年，我开始参与BTC的工作。我开始意识到，我想要\n金融主权，摆脱银行和政府的束缚。我想\n我发现做到这一点的唯一途径是退出法币。所以我退出了所有\n欧元和美元的投资和/或持股。我把我的钱转给了银行。",
      "title": "一位2013年加密货币老兵的提示。坚持你的退出计划;)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2013年，我開始參與BTC的工作。我開始意識到，我想要\n金融主權，擺脫銀行和政府的束縛。我想\n我發現做到這一點的唯一途徑是退出法幣。所以我退出了所有\n歐元和美元的投資和/或持股。我把我的錢轉給了銀行。",
      "title": "一位2013年加密貨幣老兵的提示。堅持你的退出計劃;)"
    }
  ],
  "title": "A tip from a 2013 crypto veteran: Stick to your exit plan ;)",
  "created_utc": 1622444727,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In 2013 I started to get involved in BTC.   I started realizing that I wanted financial sovereignty and freedom from the banks and my government.  I figured out that the only way to do this was to take the fiat exit.  So I exited from all euro and USD based investments and/or holdings.  I transferred my entire net worth into BTC and then into other cryptos.  While 2015 was a wild ride down into a deep bear market <strong>I knew that I should stick to my exit plan no matter what and not buy back any fiat</strong>.   When you make an exit plan, and you stick to, you will be rewarded.  Not only with crypto riches, but you will be rewarded with the satisfaction that you exited a horribly rigged surveillance heavy system of financial oppression.  <strong>No more fiat for me and I&#39;m sticking to this exit plan no matter what</strong>.<br/>\nFor those curious, yes I have my 99,9% of my net worth all in crypto and have had it that way since 2015.  I do keep a tiny sum of fiat in a bank account to be able to pay for things like visas to other countries, or to pay for things I can&#39;t buy with crypto (which these days isnt that much).  I never transfer large sums of money through this legagy system.   Also since I bought all my BTC and other cryptos off exchanges and with no KYC, and I sell it for cash when I need to in face to face anonymous transactions...  Well you get the idea.  </p>\n\n<p>.</p>\n\n<p>EDIT1  to the down-voting bank bois:  if you don&#39;t like my exit strategy tell me why instead of just mechanistically down-voting any post that isnt pro-FIAT, pro government or pro banks.  I&#39;m living the dream that crypto promises, not the nightmare that fiat guarantees.   </p>\n\n<p>.</p>\n\n<p>Edit2:  For those that think I&#39;m living some life in the shadows I say this :  <strong>I live a life of leisure, I follow my passions and spend a lot of time volunteering for the betterment of humanity and nature.</strong> Do I have a a huge mansion with lambos ? While I could afford them, I wouldn&#39;t sacrifice my freedoms to be a slave of the FIAT regime and a slave to my possessions.\nI have interests in art and I have hobbies that I have as much time for as I want and basically unlimited resources to make them happen.  I can get my friends and loved ones gifts and help them out with cash when they need it. When I do have a partner I can spend as much time with them as I want and there is no money constraints as far as travel or entertainments goes.  I wouldn&#39;t say I am in the shadows, I&#39;m more trying to stay off the radar. Crypto helps me do all of that. So yea there are things that I can&#39;t do, but there is so much more that I can.</p>\n</div><!-- SC_ON -->",
  "score": 307,
  "permalink": "/r/CryptoCurrency/comments/nolq6p/a_tip_from_a_2013_crypto_veteran_stick_to_your/",
  "subreddit": "CryptoCurrency",
  "id": "nolq6p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804297917
}