{
  "author": "FreshWoodJohnson",
  "original_created_utc": 1636181526,
  "title": "Am I a coward for not speaking up?",
  "created_utc": 1636238474,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was on a train home tonight and a man started yelling and making these three girls very uncomfortable. He was talking about “impregnating and shooting white girls,” so it was a tense situation. I was worried that saying anything would result in violence, but I was keeping a close eye on things in case they got physical.</p>\n\n<p>After about 3 minutes of yelling, another man on the train ended up saying “why don’t you just sit down?” and the guy who was yelling threw a golf ball at him and started asking if he wanted to die. I got off at the next stop with the girls to make sure they were alright because the other man on the train was brave enough to speak up. Am I a coward for not saying something?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TrueAskReddit/comments/qnusgv/am_i_a_coward_for_not_speaking_up/",
  "subreddit": "TrueAskReddit",
  "id": "qnusgv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was on a train home tonight and a man started yelling and making these three\ngirls very uncomfortable. He was talking about “impregnating and shooting white\ngirls,” so it was a tense situation. I was worried that saying anything would\nresult in violence, but I was keeping a close eye on things in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "帰りの電車の中で、男の人が大声で叫び始めて、3人の女の子をとても不快にさせていました。\n女の子3人がとても不愉快な思いをしました。彼は「白人女性を妊娠させて撃ち殺す」という話をしていました。\n白人女性を妊娠させて撃つ」という話をしていて、緊迫した状況でした。私は、何か言うと暴力を振るわれるのではないかと心配しましたが\n暴力にならないか心配でしたが、私はこの状況を注視していました...",
      "title": "声を上げない私は臆病者か？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今晚我在回家的火车上，一个男人开始大喊大叫，让这三个女孩非常不舒服。\n女孩非常不舒服。他说到 \"让白人女孩怀孕和开枪\"。\n所以这是一个紧张的局面。我担心说任何话都会\n我担心说任何话都会导致暴力，但我一直在密切关注事情的进展。",
      "title": "我不说出来是个懦夫吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今晚我在回家的火車上，一個男人開始大喊大叫，讓這三個女孩非常不舒服。\n女孩非常不舒服。他說到 \"讓白人女孩懷孕和開槍\"。\n所以這是一個緊張的局面。我擔心說任何話都會\n我擔心說任何話都會導致暴力，但我一直在密切關注事情的進展。",
      "title": "我不說出來是個懦夫嗎？"
    }
  ]
}