{
  "author": "benkaiser",
  "the_new_excerpt": "Out of curiousity I wanted to understand how certain stocks moved around\nprevious earnings, however most of the websites with this functionality require\nyou to pay for a subscription. This tool allows you to browse the data for free.\n\nI added a few tickers in there to start with, but you can request…",
  "original_created_utc": 1619592999,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "好奇心から、ある銘柄が前回の決算時にどのような動きをしたのかを知りたいと思いました。\nしかし、このような機能を持つサイトはほとんどが有料です。\nしかし、このような機能を持つウェブサイトの多くは、購読料を支払わなければなりません。このツールでは、無料でデータを閲覧することができます。\n\n私は最初にいくつかのティッカーを追加しましたが、あなたはリクエストすることができます...",
      "title": "過去の決算で株価がどう動くかを見るためのオープンソースのサイトを作りました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "出于好奇，我想了解某些股票在以前的收益中是如何变动的。\n然而，大多数具有这种功能的网站都要求你付费订阅。\n你需要付费订阅。这个工具允许你免费浏览数据。\n\n我先在里面添加了几个股票，但你可以要求...",
      "title": "我创建了一个开源网站，以查看股票价格如何围绕过去的盈利情况进行变动。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "出於好奇，我想了解某些股票在以前的收益中是如何變動的。\n然而，大多數具有這種功能的網站都要求你付費訂閱。\n你需要付費訂閱。這個工具允許你免費瀏覽數據。\n\n我先在裏面添加了幾個股票，但你可以要求...",
      "title": "我創建了一個開源網站，以查看股票價格如何圍繞過去的盈利情況進行變動。"
    }
  ],
  "title": "I created an open source website to see how stock prices move around past earnings",
  "created_utc": 1619601326,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Out of curiousity I wanted to understand how certain stocks moved around previous earnings, however most of the websites with this functionality require you to pay for a subscription. This tool allows you to browse the data for free.</p>\n\n<p>I added a few tickers in there to start with, but you can request another ticker through <a href=\"https://benkaiser.github.io/earnings/#/addticker\">this page</a>. There is no approval process, it automatically gets added but can take a few minutes.</p>\n\n<p>Website here: <a href=\"https://benkaiser.github.io/earnings/\">https://benkaiser.github.io/earnings/</a></p>\n\n<p>Source code here: <a href=\"https://github.com/benkaiser/earnings\">https://github.com/benkaiser/earnings</a></p>\n\n<p>Feel free to let me know what you think and how I could improve the tool! PRs are always welcome too from any devs out there.</p>\n</div><!-- SC_ON -->",
  "score": 202,
  "permalink": "/r/stocks/comments/n090kx/i_created_an_open_source_website_to_see_how_stock/",
  "subreddit": "stocks",
  "id": "n090kx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776216019
}