{
  "author": "ThePrestigeVIII",
  "original_created_utc": 1634645320,
  "title": "I don’t understand how unemployment is low but everyone is facing a worker shortage?",
  "created_utc": 1634675875,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I can’t conceptually wrap my head around this. I’m a CPA so I speak to people in all sorts of industries and everyone is hurting for staff (especially skilled professionals). Driving down my cities downtown area, every single chain store or restaurant has a now hiring sign, with wages 2x minimum wage. </p>\n\n<p>However when I look at the unemployment numbers they aren’t bad at all. So what’s going on? Where are these 16 year olds working if they aren’t getting $17 at McDonald’s when just a year ago that McDonald’s was paying $8? Where did all the skilled professionals go? Some company had to hire them. Is there a brand new off the grid company hiring all the engineers, accountants, etc.?</p>\n\n<p>Then I thought well maybe demand for everything is up which means more workers are needed. But then I can’t understand where all the money is coming from to raise demand through the roof everywhere. It’s not like everyone got massive raises and the price of goods stayed the same. We actually have less buying power today than we did before the pandemic. </p>\n\n<p>The only other option is there are tons of people who are sitting at home not even collecting unemployment? I find that hard to believe especially for professionals.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/qba541/i_dont_understand_how_unemployment_is_low_but/",
  "subreddit": "NoStupidQuestions",
  "id": "qba541",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I can’t conceptually wrap my head around this. I’m a CPA so I speak to people in\nall sorts of industries and everyone is hurting for staff (especially skilled\nprofessionals). Driving down my cities downtown area, every single chain store\nor restaurant has a now hiring sign, with wages 2x minimum…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "概念的に頭に入ってきません。私は公認会計士なので、さまざまな業界の人と話をします。\n私はCPAなので、あらゆる業界の人と話をしますが、誰もが人手不足に悩んでいます（特に熟練したプロ\n専門家）。) 私の街のダウンタウンを車で走っていると、どのチェーン店やレストランも\n私の街のダウンタウンを車で走ると、どのチェーン店やレストランでも、最低賃金の2倍の賃金で募集中の看板を掲げています。",
      "title": "失業率が低いのに、皆が労働者不足に直面しているというのは理解できません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在概念上无法理解这一点。我是一名注册会计师，所以我与各种行业的人交谈。\n我是一名注册会计师，所以我和各行各业的人交谈过，每个人都在为员工（尤其是熟练的\n专业人员）。) 在我所在城市的市中心开车，每一家连锁店\n或餐馆都有一个现在招聘的标志，工资是最低的2倍......",
      "title": "我不明白为什么失业率很低，但每个人都面临着工人短缺的问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在概念上無法理解這一點。我是一名註冊會計師，所以我與各種行業的人交談。\n我是一名註冊會計師，所以我和各行各業的人交談過，每個人都在爲員工（尤其是熟練的\n專業人員）。) 在我所在城市的市中心開車，每一家連鎖店\n或餐館都有一個現在招聘的標誌，工資是最低的2倍......",
      "title": "我不明白爲什麼失業率很低，但每個人都面臨着工人短缺的問題？"
    }
  ]
}