{
  "author": "Lejitz",
  "the_new_excerpt": "On its face, it’s obviously great for Bitcoin if El Salvador adopts it as its\nlegal tender. There are, however, nuances in the internal revenue code that make\nthis news much bigger than most realize.\n\nMost know that when trading foreign currencies gains must be reported and are\ntaxed. But Section…",
  "original_created_utc": 1622989784,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "表面的には、エルサルバドルがビットコインを法的に採用すれば、ビットコインにとっては明らかに素晴らしいことです。\nが法定通貨として採用されれば、ビットコインにとって素晴らしいことです。しかし、内国歳入法には、このニュースをより大きなものにするニュアンスがあります。\nこのニュースは、一般に知られているよりもはるかに大きなものです。\n\n多くの人は、外国通貨を取引する際には利益を報告し、課税されることを知っています。\n課税されます。しかし、セクション...",
      "title": "エルサルバドルがビットコインを法定通貨にした場合、米国の税金や報告に大きな影響を与える可能性があります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "从表面上看，如果萨尔瓦多采用比特币作为其法定货币，这显然对比特币很有利。\n法定货币。然而，国内税收法中的细微差别使\n这个消息比大多数人意识到的要大得多。\n\n大多数人都知道，当交易外国货币时，必须报告收益并被征税。\n被征税。但是，第...",
      "title": "如果萨尔瓦多让比特币成为合法货币，可能会对美国的税收和报告产生巨大影响"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從表面上看，如果薩爾瓦多采用比特幣作爲其法定貨幣，這顯然對比特幣很有利。\n法定貨幣。然而，國內稅收法中的細微差別使\n這個消息比大多數人意識到的要大得多。\n\n大多數人都知道，當交易外國貨幣時，必須報告收益並被徵稅。\n被徵稅。但是，第...",
      "title": "如果薩爾瓦多讓比特幣成爲合法貨幣，可能會對美國的稅收和報告產生巨大影響"
    }
  ],
  "title": "There are potentially huge US tax and reporting implications if El Salvador makes Bitcoin legal tender",
  "created_utc": 1623002149,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>On its face, it’s obviously great for Bitcoin if El Salvador adopts it as its legal tender. There are, however, nuances in the internal revenue code that make this news much bigger than most realize.</p>\n\n<p>Most know that when trading foreign currencies gains must be reported and are taxed.  But Section 988(e) carves out a <em>de minimis</em> exception for “personal transactions” where the gains do not exceed $200.</p>\n\n<p>This is intended to allow travelers to transact in foreign currencies without all of the burdensome reporting requirements.</p>\n\n<p>So far, Bitcoin has not qualified for this exception.  Under IRS Notice 2014-21, the IRS opines that Bitcoin is “property” and not a “currency” because “<strong>it does not have legal tender status in any jurisdiction</strong>.”  There is a good argument, though, that once Bitcoin is “legal tender” in El Salvador, it will qualify for US individuals as a “nonfunctional currency” (under Section 988), allowing individuals to forgo reporting gains on small, daily transactions—“personal transactions.”</p>\n\n<p>In other words (<strong>tldr</strong>), if Bitcoin is legal tender in El Salvador, US citizens could possibly freely transact in Bitcoin, as a “nonfunctional currency,” without a need to report gains of less than $200.</p>\n\n<p>That’s potentially huge news for retail US citizens, but <strong>there is also huge news for US Bitcoin businesses.</strong></p>\n\n<p>Most US businesses use the US dollar as their unit of account for bookkeeping and reporting.  However, there are cases where businesses operating primarily in foreign jurisdictions use a foreign currency—the unit of account does not have to be USD.  The unit of account used by the business is the “<strong>functional currency</strong>” of the business and, perhaps, even an individual (see Sec. 985 IRC).  If a business’s “functional currency” is a foreign currency, it does not have to bother with gains/losses related to USD fluctuations.</p>\n\n<p>Again, under Notice 2014-21, Bitcoin cannot qualify as a functional currency.  And, again, this could change if El Salvador adopts Bitcoin as legal tender.</p>\n\n<p><strong>Final tldr</strong> If Bitcoin becomes legal tender in El Salvador, IRS Notice 2014-21 may become partially null, relieving US individuals and business of huge tax and reporting burdens, paving the way for Bitcoin to legally and easily be used as a currency in the US.</p>\n\n<p><em>Disclaimer: I am not a tax lawyer.  The discussion and analysis on this should be much more detailed before financial decisions are made.  I’ve written this to be used as a starting point for discussion with a tax lawyer.</em></p>\n\n<p><strong>Edit</strong>: Many have pointed out that Japan recognized Bitcoin as “legal tender” in 2017.  They did not.  A lot of misinformed authors incorrectly wrote that, but there is a distinction between Japan’s legal recognition of Bitcoin as a form of payment and what the Code/Regs/precedent considers “legal tender.”  I think (and hope) that El Salvador will truly recognize Bitcoin as legal tender.</p>\n</div><!-- SC_ON -->",
  "score": 4638,
  "permalink": "/r/Bitcoin/comments/ntmzwu/there_are_potentially_huge_us_tax_and_reporting/",
  "subreddit": "Bitcoin",
  "id": "ntmzwu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404878614
}