{
  "author": "rohilaltro",
  "original_created_utc": 1654517707,
  "title": "Wtf is happening with prices around us?",
  "created_utc": 1654551328,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just returned from grocery shopping just few minutes ago after a gap of 2-3 weeks. I found that the same shop is now selling everything at almost double the price now compared to last few weeks. &lt;/p&gt;\n\n&lt;p&gt;I have been hearing about inflation and was aware of price increases (since I don&amp;#39;t have a car, living in a big metro I was not directly impacted) but today was my real experience with these price increases in such a short span of time. &lt;/p&gt;\n\n&lt;p&gt;I have exposed and hedged myself from this with BTC but I feel it is not enough now.&lt;/p&gt;\n\n&lt;p&gt;I know I can still afford and be able to pay these prices. But I am so worried and sad that the poor sections of the society will basically find themselves not being able to buy anything if this continues like this. &lt;/p&gt;\n\n&lt;p&gt;It is just sad. Very sad. &lt;/p&gt;\n\n&lt;p&gt;I try to bring awareness around me to why this is happening but all the people seems to not understand basic finance and there anger is directed towards government to provide help, give them more money as aid. This is the very problem &amp;#39;more money&amp;#39; which is equivalent to &amp;#39;printer going brrrr&amp;#39; -root cause of all problems. It almost seems we are in this death spiral and our generation will see worst of worst times in coming years. &lt;/p&gt;\n\n&lt;p&gt;I try to find optimism in pessimistic times in life but for the first time I feel there is only pessimism ahead of us. &lt;/p&gt;\n\n&lt;p&gt;My only hope is this project &amp;quot;BTC&amp;quot;. Only hope!!&lt;/p&gt;\n\n&lt;p&gt;Edit: Nothing against any country or continent, but I am not from North America. Inflation is a global problem but when I read comments it is becoming too focused on US politics and to be honest I don&amp;#39;t get the local references in your comments!!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 326,
  "permalink": "/r/Bitcoin/comments/v625h3/wtf_is_happening_with_prices_around_us/",
  "subreddit": "Bitcoin",
  "id": "v625h3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I just returned from grocery shopping just few minutes ago after a gap of 2-3\nweeks. I found that the same shop is now selling everything at almost double the\nprice now compared to last few weeks.\n\nI have been hearing about inflation and was aware of price increases (since I\ndon't have a car,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ついさっき、2～3日ぶりに買い物から帰ってきたところです。\n週間ぶりに帰ってきました。同じ店で、数週間前に比べ、ほぼ2倍の値段で売られていることに気がつきました。\n同じ店でも数週間前に比べれば倍近い値段で売られている。\n\nインフレの話は聞いていて、物価が上がっていることは認識していたのですが（私は車を持っていないので\n車を持っていないので...）。",
      "title": "私たちの周りの物価はどうなっているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几分钟前，我刚从杂货店购物回来，在间隔了2-3周之后\n周后，我刚刚从杂货店回来。我发现同一家商店现在出售的所有东西的价格几乎是前几周的两倍。\n价格，与前几周相比。\n\n我一直听说通货膨胀，也知道价格上涨（因为我没有车，...\n因为我没有车，...",
      "title": "我们周围的价格到底发生了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾分鐘前，我剛從雜貨店購物回來，在間隔了2-3周之後\n周後，我剛剛從雜貨店回來。我發現同一家商店現在出售的所有東西的價格幾乎是前幾周的兩倍。\n價格，與前幾周相比。\n\n我一直聽說通貨膨脹，也知道價格上漲（因爲我沒有車，...\n因爲我沒有車，...",
      "title": "我們周圍的價格到底發生了什麼？"
    }
  ]
}