{
  "author": "Thrusrwht",
  "original_created_utc": 1647700821,
  "title": "What’s the point of having kids?",
  "created_utc": 1647706444,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I see people around me complaining about their kids. They don’t listen, they cost a lot of money, they don’t make us sleep, I lost myself since I had kids, I wish I had some time for me, etc. So they suffer with kids from childhood to their teenage years. Then their kids just leave. What’s the point of having kids then? What do parents expect when they bring humans to the world? Parents suffer with kids and their “suffering” (that most of the time be abuse) reflects on the kids and possibly traumatize them for life. I personally wish my parents never had me because of how much they tell they suffered because of me. I don’t think I’ll have kids either because I don’t think I’m a good fit to be a parent. I realize I don’t have the patience for that. Why people have kids because they simply want them, without thinking if those kids actually would want them back or not? Why bother and have kids? Why do you do that to yourself? If they’ll change your life negatively why you insist on having them?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 146,
  "permalink": "/r/TooAfraidToAsk/comments/thwkwt/whats_the_point_of_having_kids/",
  "subreddit": "TooAfraidToAsk",
  "id": "thwkwt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I see people around me complaining about their kids. They don’t listen, they\ncost a lot of money, they don’t make us sleep, I lost myself since I had kids, I\nwish I had some time for me, etc. So they suffer with kids from childhood to\ntheir teenage years. Then their kids just leave. What’s the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の周りでも、子供のことで文句を言っている人を見かけます。子供が言うことを聞かない、子供が\nお金がかかる、寝かせてくれない、子供ができてから自分を見失ってしまった、などなど。\n自分の時間があればいいのに、などなど。だから、彼らは子供の頃から、子供と一緒に苦しんでいるのです。\n10代は そして、その子供たちは去っていくのです。何なんだ...",
      "title": "子供を持つ意味はあるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到我周围的人在抱怨他们的孩子。他们不听话，他们\n他们花了很多钱，他们不让我们睡觉，自从我有了孩子，我就失去了自我，我希望我有了孩子。\n我希望能有一些时间留给自己，等等。因此，他们与孩子们一起从童年到\n他们的青少年时期。然后他们的孩子就离开了。什么是...",
      "title": "生孩子的意义何在？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到我周圍的人在抱怨他們的孩子。他們不聽話，他們\n他們花了很多錢，他們不讓我們睡覺，自從我有了孩子，我就失去了自我，我希望我有了孩子。\n我希望能有一些時間留給自己，等等。因此，他們與孩子們一起從童年到\n他們的青少年時期。然後他們的孩子就離開了。什麼是...",
      "title": "生孩子的意義何在？"
    }
  ]
}