{
  "author": "brad__staple721",
  "the_new_excerpt": "In the former film, Churchill is seen as a respected advisor to the royal who\nseems to oppose Edward’s marriage to Wallis Simpson, and is the one who suggests\nBertie use King George VI as his name.\n\nIn the latter, King George seems to despise Churchill and they certainly don’t\nseem to have the…",
  "original_created_utc": 1623163714,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "前者では、チャーチルは、エドワードとウォリス・シンプソンの結婚に反対するような、王室の尊敬すべきアドバイザーとして登場します。\nエドワードとウォリス・シンプソンとの結婚に反対し、バーティにキング・ジョージ6世という名前を勧める人物として登場しています。\nバーティはキング・ジョージ6世を自分の名前として使うように提案した人物です。\n\n後者では、ジョージ王はチャーチルを軽蔑しているように見えますし、二人は確かに......。\nしているようです。",
      "title": "私の好きな映画である『英国王のスピーチ』と『ダーケスト・アワー』は、ウィンストン・チャーチルとジョージ6世の関係について、まったく異なる絵を描いています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在前一部影片中，丘吉尔被视为皇室的一位受人尊敬的顾问，他似乎反对爱德华与华莉丝-辛普森的婚姻，并且是建议爱德华与辛普森结婚的人。\n他似乎反对爱德华与沃利斯-辛普森的婚姻，并且是那个建议\n伯蒂用国王乔治六世作为他的名字。\n\n在后者中，乔治国王似乎看不起丘吉尔，他们当然没有\n他们似乎没有...",
      "title": "我最喜欢的两部电影，《国王的演讲》和《至暗时刻》，对温斯顿-丘吉尔和国王乔治六世之间的关系描绘得非常不同。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在前一部影片中，丘吉爾被視爲皇室的一位受人尊敬的顧問，他似乎反對愛德華與華莉絲-辛普森的婚姻，並且是建議愛德華與辛普森結婚的人。\n他似乎反對愛德華與沃利斯-辛普森的婚姻，並且是那個建議\n伯蒂用國王喬治六世作爲他的名字。\n\n在後者中，喬治國王似乎看不起丘吉爾，他們當然沒有\n他們似乎沒有...",
      "title": "我最喜歡的兩部電影，《國王的演講》和《至暗時刻》，對溫斯頓-丘吉爾和國王喬治六世之間的關係描繪得非常不同。"
    }
  ],
  "title": "Two of my favorite movies, “The King’s Speech” and “Darkest Hour”, paint very different pictures of the relationship between Winston Churchill and King George VI",
  "created_utc": 1623175371,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the former film, Churchill is seen as a respected advisor to the royal who seems to oppose Edward’s marriage to Wallis Simpson, and is the one who suggests Bertie use King George VI as his name. </p>\n\n<p>In the latter, King George seems to despise Churchill and they certainly don’t seem to have the relationship that they had in “The King’s Speech” (though they do develop one later). Churchill also states in that movie that King George “never forgave him for supporting his brother’s marriage to Wallis Simpson”.</p>\n\n<p>Which of these portrayals more accurately represents the relationship of the two? Also, where did Churchill stand on Edward’s marriage to Simpson?</p>\n</div><!-- SC_ON -->",
  "score": 1231,
  "permalink": "/r/AskHistorians/comments/nv5rcr/two_of_my_favorite_movies_the_kings_speech_and/",
  "subreddit": "AskHistorians",
  "id": "nv5rcr",
  "is_self": true,
  "media": null,
  "is_video": false
}