{
  "author": "antonito901",
  "original_created_utc": 1634730962,
  "title": "What are your biggest mistakes as a Crypto Investor?",
  "created_utc": 1634747786,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Curious to know what are your biggest regrets when it comes to crypto investment.</p>\n\n<p>Personally, I believe my top 2 so far will go to:</p>\n\n<ul>\n<li>1# - Selling BTC at $8.5k. I was new to crypto but still convinced myself to buy during the big dip in Feb/Mar 2020. At the moment I was super proud then came the pump in Sep 2020. I was too stupid      to see it has long term potential. Bought later at twice the price and now hodl in peace.</li>\n<li>2# - Selling some Chilliz (CHZ) tokens I got for free from Binance. I got them for 1¢, did not know what it was, then converted them to ETH when they were at 7¢ but it went up to 60¢ (60x)!</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 179,
  "permalink": "/r/CryptoCurrency/comments/qbz48f/what_are_your_biggest_mistakes_as_a_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qbz48f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Curious to know what are your biggest regrets when it comes to crypto\ninvestment.\n\nPersonally, I believe my top 2 so far will go to:\n\n * 1# - Selling BTC at $8.5k. I was new to crypto but still convinced myself to\n   buy during the big dip in Feb/Mar 2020. At the moment I was super proud then\n  …",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号投資に関して、あなたが一番後悔していることは何でしょうか？\n投資をしています。\n\n個人的には、これまでのトップ2は次のようなものだと思っています。\n\n * 1# - BTCを8.5kドルで売却。私は暗号に慣れていませんでしたが、それでも自分を納得させて購入しました。\n   私は暗号の初心者でしたが、2020年2月/3月の大暴落の際に自分を説得して買いました。その時はとても誇らしかったのですが\n  ...",
      "title": "暗号投資家としての最大の失敗は何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很想知道，当涉及到加密货币时，你最大的遗憾是什么？\n投资。\n\n就我个人而言，我相信到目前为止，我的前2名将归于。\n\n * 1# - 在8.5千美元时卖掉BTC。我对加密货币是个新手，但还是说服了自己\n   在2020年2月/3月的大跌中购买。那一刻，我超级自豪，然后\n  ...",
      "title": "作为一名加密货币投资者，你最大的错误是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很想知道，當涉及到加密貨幣時，你最大的遺憾是什麼？\n投資。\n\n就我個人而言，我相信到目前爲止，我的前2名將歸於。\n\n * 1# - 在8.5千美元時賣掉BTC。我對加密貨幣是個新手，但還是說服了自己\n   在2020年2月/3月的大跌中購買。那一刻，我超級自豪，然後\n  ...",
      "title": "作爲一名加密貨幣投資者，你最大的錯誤是什麼？"
    }
  ]
}