{
  "author": "Deathbysnusnu42069",
  "original_created_utc": 1625887647,
  "title": "Coinbase pro",
  "created_utc": 1625920239,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m just gonna toss this out there because I’ve been anti Coinbase for a very long time. Today I used Coinbase pro to make 4 different 5$ purchases to test out fees. For each transaction it cost me exactly 2 cents and I could transfer it to Coinbase instantly for free. If I want to sell, I can then transfer coins from Coinbase back to Coinbase pro instantly for free and the fees are generally exactly the same. I can then transfer the cash to my Coinbase account instantly and cash out instantly to my bank account with fast pay to my debit card, it literally loaded the money back in about 30 seconds. They list a majority of all the coins on Coinbase pro and it’s super easy to use and understand once you mess around with it for a day. This is the cheapest fees by far I’ve ever seen across any exchanges including Binance. Coinbase pro doesn’t get the glory that is deserves!!!</p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/CryptoCurrency/comments/ohb1j5/coinbase_pro/",
  "subreddit": "CryptoCurrency",
  "id": "ohb1j5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m just gonna toss this out there because I’ve been anti Coinbase for a very\nlong time. Today I used Coinbase pro to make 4 different 5$ purchases to test\nout fees. For each transaction it cost me exactly 2 cents and I could transfer\nit to Coinbase instantly for free. If I want to sell, I can then…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は長い間、Coinbaseのアンチだったので、これを投げておきます。\nてきたからです。今日、Coinbase proを使って5ドルの買い物を4回して、手数料を試してみました。\n手数料を試してみました。それぞれの取引にかかった費用はちょうど2セントで、次のように送金できました。\n瞬時にCoinbaseに無料で送金することができました。もし売りたいと思ったら...",
      "title": "コインベース・プロ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是想把这个问题抛出来，因为我已经反对Coinbase很久了。\n很长时间了。今天我用Coinbase pro进行了4次不同的5美元购买，以测试\n了费用。每笔交易我都只花了2美分，而且我可以立即把钱转到Coinbase。\n瞬间免费转到Coinbase。如果我想出售，我就可以...",
      "title": "币安亲王"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是想把這個問題拋出來，因爲我已經反對Coinbase很久了。\n很長時間了。今天我用Coinbase pro進行了4次不同的5美元購買，以測試\n了費用。每筆交易我都只花了2美分，而且我可以立即把錢轉到Coinbase。\n瞬間免費轉到Coinbase。如果我想出售，我就可以...",
      "title": "幣安親王"
    }
  ]
}