{
  "author": "unshadedgarrison",
  "the_new_excerpt": "PPE is becoming much more of a B2B industry, with businesses in need of face\nmasks and other gear to keep operations running smoothly while restrictions are\nlifted for the general public. This is especially true in states like NY where\nrestrictions are tighter than Miami.\n\nAs the CDC loosens fask…",
  "original_created_utc": 1621610442,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "PPEはB2Bの産業になってきており、企業は規制の中で業務を円滑に進めるためにフェイスマスクなどを必要としています。\nの規制が解除されるまでの間、業務を円滑に遂行するために、フェイスマスクやその他の装備を必要としています。\n企業が業務を円滑に進めるためにフェイスマスクなどを必要としています。特にニューヨーク州では、マイアミよりも厳しい規制があります。\nのような州では、マイアミよりも厳しい規制があります。\n\nCDCがマスクの使用を制限しているため、このような状況になっています。",
      "title": "米国やEUのPPEプロバイダーにとって、PPEを直接企業に供給することは望ましいことなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "个人防护设备正逐渐成为一个B2B行业，企业需要口罩和其他装备，以保持业务的顺利进行，同时也需要限制。\n企业需要口罩和其他装备，以保持业务的顺利进行，同时对公众的限制也被取消。\n撤消对普通公众的限制。这在纽约等州尤其如此，那里的限制比迈阿密更严格。\n限制比迈阿密更严格。\n\n随着疾病预防控制中心放松了对口罩的限制...",
      "title": "直接向企业供应PPE是美国、欧盟PPE供应商的发展方向吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "個人防護設備正逐漸成爲一個B2B行業，企業需要口罩和其他裝備，以保持業務的順利進行，同時也需要限制。\n企業需要口罩和其他裝備，以保持業務的順利進行，同時對公衆的限制也被取消。\n撤消對普通公衆的限制。這在紐約等州尤其如此，那裏的限制比邁阿密更嚴格。\n限制比邁阿密更嚴格。\n\n隨着疾病預防控制中心放鬆了對口罩的限制...",
      "title": "直接向企業供應PPE是美國、歐盟PPE供應商的發展方向嗎？"
    }
  ],
  "title": "Is supplying PPE directly to business the way forward for PPE providers in the US, EU?",
  "created_utc": 1621617110,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>PPE is becoming much more of a B2B industry, with businesses in need of face masks and other gear to keep operations running smoothly while restrictions are lifted for the general public. This is especially true in states like NY where restrictions are tighter than Miami. </p>\n\n<p>As the CDC loosens fask mask restrictions for vaccinated people, I’m seeing a ton of young people outside (maskless) in strict areas like NYC. The streets look like a Miami Spring Break - a whole gathering of young people in the streets in large numbers and no masks to be found. </p>\n\n<p>The big takeaway, however, is that masks are strictly enforced inside all establishments. Using restaurants as an example, customers must wear masks when they enter/exit and move around, but they are not required to wear masks when they eat. Most importantly, business employees MUST wear masks at all times, and will therefore go through masks at a much quicker pace. The business itself will have to provide PPE for their employees, leading me to conclude the future of COVID era PPE is B2B (in the US / EU and countries with access to vaccinations). </p>\n\n<p>What company is best situated to provide business with direct PPE supply? OPTEC International (OPTI) acquired WeShield - a B2B PPE supplier, with clients from Old Navy to Carl’s Jr. What led me to OPTEC and WeShield however, is an <a href=\"https://www.bkreader.com/2021/04/14/nyc-restaurants-gifted-free-ppe-through-new-partnership/\">article </a>I found about their PPE donations to NYC restaurants through a partnership with the NYC Hospitality Alliance. It turns out the WeShield is run by fellow restaurant owners turned medical suppliers. In the article, a WeShield spokesperson said that the PPE cost of a restaurant is about $5-10 per employee, per day. </p>\n\n<p>The article also acknowledged that alleviating PPE costs for independent restaurants is what sparked their donation campaign. But without donations, $5-10 per employee per day really adds up and leaves us with a still emerging market of PPE buyers. Not just restaurants but all brick and mortar businesses are new customers in a space that was mostly used by healthcare organizations.</p>\n\n<p>It will be interesting to see how the divide for public vs commercial PPE restrictions grows and which sectors maintain their status as large quantity PPE purchasers. For now, restaurants and retail locations have no plans on changing their PPE policies which leaves a niche market for suppliers like OPTEC.</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/investing/comments/nhv1rp/is_supplying_ppe_directly_to_business_the_way/",
  "subreddit": "investing",
  "id": "nhv1rp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197388310
}