{
  "author": "UnexperiencedIT",
  "original_created_utc": 1640484589,
  "title": "No one blames fiat when criminals use it for money laundering or other activities, but when cryptocurrencies are used it must be highlighted as a cryptocurrency problem",
  "created_utc": 1640532643,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When politicians and the media talk about crime using cryptocurrencies, you will see that they will talk about money laundering, drug trafficking, cybercrime, etc.  &lt;/p&gt;\n\n&lt;p&gt;So literally all those things that existed even before cryptocurrencies existed.&lt;/p&gt;\n\n&lt;p&gt;Suddenly all these problems that exist are attributed to cryptocurrencies, but nowhere can I read how it was done with money while criticizing fiat and the traditional system.  &lt;/p&gt;\n\n&lt;p&gt;So if we used that logic then we could freely say that it is not the value of the currency that matters but the currency? So it&amp;#39;s not a problem when criminals are using euro, dollar, pound, but if  they used Bitcoin, or let&amp;#39;s say Monero, then it&amp;#39;s a cryptocurrency problem?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/romury/no_one_blames_fiat_when_criminals_use_it_for/",
  "subreddit": "CryptoCurrency",
  "id": "romury",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "When politicians and the media talk about crime using cryptocurrencies, you will\nsee that they will talk about money laundering, drug trafficking, cybercrime,\netc.\n\nSo literally all those things that existed even before cryptocurrencies existed.\n\nSuddenly all these problems that exist are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "政治家やメディアが暗号通貨を使った犯罪について語るとき、あなたは\nマネーロンダリング、麻薬取引、サイバー犯罪について語られることが予想されます。\nなどです。\n\n文字通り暗号通貨が存在する以前からあったものばかりなのですね。\n\n突然、存在するこれらすべての問題は...",
      "title": "犯罪者がマネーロンダリングなどにフィアットを利用しても誰も非難しませんが、暗号通貨が利用された場合は、暗号通貨の問題としてクローズアップされる必要があります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当政治家和媒体谈论使用加密货币的犯罪行为时，你会看到他们会将其称为 \"犯罪\"。\n你会看到，他们会谈论洗钱、贩毒、网络犯罪。\n等等。\n\n因此，从字面上看，所有这些东西甚至在加密货币存在之前就存在了。\n\n突然间，所有这些存在的问题都...",
      "title": "当犯罪分子利用法币进行洗钱或其他活动时，没有人指责法币，但当加密货币被使用时，必须强调是加密货币问题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當政治家和媒體談論使用加密貨幣的犯罪行爲時，你會看到他們會將其稱爲 \"犯罪\"。\n你會看到，他們會談論洗錢、販毒、網絡犯罪。\n等等。\n\n因此，從字面上看，所有這些東西甚至在加密貨幣存在之前就存在了。\n\n突然間，所有這些存在的問題都...",
      "title": "當犯罪分子利用法幣進行洗錢或其他活動時，沒有人指責法幣，但當加密貨幣被使用時，必須強調是加密貨幣問題"
    }
  ]
}