{
  "author": "Ecksist",
  "original_created_utc": 1632138871,
  "title": "All things worth less because one Chinese real estate company?",
  "created_utc": 1632186837,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been reading about Evergrande and I really don&#39;t get it. Can anyone explain this to me like I&#39;m 5?</p>\n\n<p>I&#39;m guessing all rich people are selling everything because something bad <strong><em>might</em></strong> happen? Or <strong><em>will</em></strong> happen? <del>Should I be selling all my shit?</del></p>\n\n<p>Edit: Not gonna sell all my shit lol. I was in a kind of a hyperbolic mood. Just feeling impatient with how people at the top fucking up means we all lose value, even if temporary.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/Bitcoin/comments/prtajf/all_things_worth_less_because_one_chinese_real/",
  "subreddit": "Bitcoin",
  "id": "prtajf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been reading about Evergrande and I really don't get it. Can anyone explain\nthis to me like I'm 5?\n\nI'm guessing all rich people are selling everything because something bad might\nhappen? Or will happen? Should I be selling all my shit?\n\nEdit: Not gonna sell all my shit lol. I was in a kind of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "エバーグランデの記事を読んでいて、本当にわからないことがあります。どなたか\n説明してくれませんか？\n\nお金持ちの人はみんな、何か悪いことが起こるかもしれないから、すべてを売っているんじゃないかな？\n何か悪いことが起こるから？それともこれから起こるの？僕は自分の物を全部売るべきなのかな？\n\n編集：全部は売らないよ(笑)。私は、ある種の...",
      "title": "中国のある不動産会社のせいで、すべてのものの価値が下がる？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在阅读关于恒大的文章，我真的不明白。有谁能像我5岁时那样解释一下\n解释给我听吗？\n\n我猜想所有的富人都在卖掉所有东西，因为可能会有坏事发生？\n发生？或将会发生？我应该卖掉我所有的东西吗？\n\n编辑：不打算卖掉我所有的东西，笑。我是在一种...",
      "title": "所有的东西都不值钱了，因为一个中国的房地产公司？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在閱讀關於恆大的文章，我真的不明白。有誰能像我5歲時那樣解釋一下\n解釋給我聽嗎？\n\n我猜想所有的富人都在賣掉所有東西，因爲可能會有壞事發生？\n發生？或將會發生？我應該賣掉我所有的東西嗎？\n\n編輯：不打算賣掉我所有的東西，笑。我是在一種...",
      "title": "所有的東西都不值錢了，因爲一箇中國的房地產公司？"
    }
  ]
}