{
  "author": "Paco_Libre",
  "the_new_excerpt": "While we continue to hear more and more bearish sentiment from the media and\ngovernment alike, what do you believe is the best avenue to hedge against\ninflation or the inevitable bear market?\n\nIt is ignorant to say anyone knows when we’ll see the consequences of the\npandemic. It may be a drastic…",
  "original_created_utc": 1624204125,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "メディアや政府から弱気な意見が多く聞かれるようになってきました。\nメディアや政府から弱気な意見が聞かれるようになってきましたが、あなたは、インフレや不景気に備えるための最良の手段は何だと思いますか？\nインフレや避けられない弱気の市場に対して、どのような手段が最適だと思いますか？\n\nパンデミックの影響がいつ出るかは誰にもわからない、というのは無知な話です。\nパンデミックの影響がいつ出るかわからないというのは無知です。パンデミックの影響がいつ出るかは誰にもわからないと言っても過言ではありません。",
      "title": "インフレ/ベアマーケットの恐怖を乗り越えるための最良の手段"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我们继续从媒体和政府那里听到越来越多的看空情绪时\n你认为什么是对冲通货膨胀或不可避免的熊市的最佳途径？\n通货膨胀或不可避免的熊市？\n\n如果说有人知道我们何时会看到大流行病的后果，那是无知的。\n大流行的后果。它可能是一个剧烈的...",
      "title": "抵御通货膨胀/熊市恐慌的最佳途径"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我們繼續從媒體和政府那裏聽到越來越多的看空情緒時\n你認爲什麼是對沖通貨膨脹或不可避免的熊市的最佳途徑？\n通貨膨脹或不可避免的熊市？\n\n如果說有人知道我們何時會看到大流行病的後果，那是無知的。\n大流行的後果。它可能是一個劇烈的...",
      "title": "抵禦通貨膨脹/熊市恐慌的最佳途徑"
    }
  ],
  "title": "Best avenues to weather the inflation/bear market scare",
  "created_utc": 1624249879,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>While we continue to hear more and more bearish sentiment from the media and government alike, what do you believe is the best avenue to hedge against inflation or the inevitable bear market?</p>\n\n<p>It is ignorant to say anyone knows when we’ll see the consequences of the pandemic. It may be a drastic occurrence or a slow growing hit. Regardless of when it may or may not happen what are your plans to protect yourself for a bearish future?</p>\n</div><!-- SC_ON -->",
  "score": 43,
  "permalink": "/r/stocks/comments/o48imx/best_avenues_to_weather_the_inflationbear_market/",
  "subreddit": "stocks",
  "id": "o48imx",
  "is_self": true,
  "media": null,
  "is_video": false
}