{
  "author": "chrisnsalem",
  "the_new_excerpt": "Hear me out for a second: has any fiat currency from any point in history ever\nstood the test of time? Assyria and Babylon once ruled the world, but nobody\nuses their currency anymore. Same with Rome. Same with Greece. Same with every\nempire that ever ruled the world that had an economy based on…",
  "original_created_utc": 1619476613,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちょっと聞いてください。歴史上のどの時点の不換紙幣も、時の試練に耐えたことがありますか？\n時の試練に耐えたことがありますか？アッシリアやバビロンはかつて世界を支配していましたが、今では誰も彼らの通貨を使っていません。\n誰も彼らの通貨を使っていません。ローマもそうだ。ギリシャもそうです。過去に支配したすべての\n世界を支配したすべての帝国は、経済的には...",
      "title": "キャピタルゲイン税を回避するための最良の方法は、IRSが崩壊するまでホドホドにすることだ。本当に単純なことです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "请听我说一句：历史上任何时候的任何法定货币都曾经\n经得起时间的考验？亚述和巴比伦曾经统治过世界，但没有人\n使用他们的货币了。罗马也一样。希腊也一样。每一个\n每个曾经统治过世界的帝国都是如此，它们的经济基础是......",
      "title": "避免资本利得税的最好方法是躲避，直到IRS崩溃。这真的很简单。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "請聽我說一句：歷史上任何時候的任何法定貨幣都曾經\n經得起時間的考驗？亞述和巴比倫曾經統治過世界，但沒有人\n使用他們的貨幣了。羅馬也一樣。希臘也一樣。每一個\n每個曾經統治過世界的帝國都是如此，它們的經濟基礎是......",
      "title": "避免資本利得稅的最好方法是躲避，直到IRS崩潰。這真的很簡單。"
    }
  ],
  "title": "The best way to avoid capital gains taxes is to hodl until the IRS collapses. It really is that simple.",
  "created_utc": 1619501489,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hear me out for a second: has any fiat currency from any point in history ever stood the test of time? Assyria and Babylon once ruled the world, but nobody uses their currency anymore. Same with Rome. Same with Greece. Same with every empire that ever ruled the world that had an economy based on fiat and tax collectors. Therefore, I shall HODL until the IRS collapses because my history book said this is the way. Not financial advice.</p>\n\n<p>“I may be early, but I’m not wrong.”</p>\n</div><!-- SC_ON -->",
  "score": 696,
  "permalink": "/r/CryptoCurrency/comments/mza0y9/the_best_way_to_avoid_capital_gains_taxes_is_to/",
  "subreddit": "CryptoCurrency",
  "id": "mza0y9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776212018
}