{
  "author": "prettyboyv",
  "the_new_excerpt": "First of all, I would like to say that in this analysys I did not want to dwell\ntoo much into the technical aspects of the PLTR's software product or the\nfinancial performance of the company. I am well aware that those are one of the\nmost important fundamental elements when valuing a business and I…",
  "original_created_utc": 1617322503,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我想说的是，在这个分析中，我并不想纠缠于以下问题\n过多地研究PLTR软件产品的技术问题，或者说是对PLTR软件产品的研究。\n公司的财务业绩。我很清楚，这些是其中之一。\n企业估值时最重要的基本要素和我...",
      "title": "PLTR是一个低底的公司，已经变得太重要了，不能失败。这是我看好的论点。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我想說的是，在這個分析中，我並不想糾纏於以下問題\n過多地研究PLTR軟件產品的技術問題，或者說是對PLTR軟件產品的研究。\n公司的財務業績。我很清楚，這些是其中之一。\n企業估值時最重要的基本要素和我...",
      "title": "PLTR是一個低底的公司，已經變得太重要了，不能失敗。這是我看好的論點。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "まず最初に言いたいのは、今回の分析では、私はあまり多くのことを考えたくなかったということです。\n今回の分析では、PLTRのソフトウェア製品の技術的な側面や、会社の財務状況にはあまり触れたくありませんでした。\n会社の財務状況にはあまり触れたくありませんでした。私は、これらが価値を評価する上で最も重要な基本的要素の一つであることをよく理解しています。\n今回の分析では、PLTRのソフトウェア製品の技術的な側面や企業の財務的なパフォーマンスにはあまり触れたくありませんでした。",
      "title": "PLTRはボトムの低い会社で、失敗するにはあまりにも重要な存在になっています。これが私の強気のテーゼです。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "まず最初に言いたいのは、今回の分析では、私はあまり多くのことを考えたくなかったということです。\n今回の分析では、PLTRのソフトウェア製品の技術的な側面や、会社の財務状況にはあまり触れたくありませんでした。\n会社の財務状況にはあまり触れたくありませんでした。私は、これらが価値を評価する上で最も重要な基本的要素の一つであることをよく理解しています。\n今回の分析では、PLTRのソフトウェア製品の技術的な側面や企業の財務的なパフォーマンスにはあまり触れたくありませんでした。",
      "title": "PLTRはボトムの低い会社で、失敗するにはあまりにも重要な存在になっています。これが私の強気のテーゼです。"
    }
  ],
  "title": "PLTR is a low bottom company and has become too important to fail. Here is my bullish thesis.",
  "created_utc": 1617335258,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First of all, I would like to say that in this analysys I did not want to dwell too much into the technical aspects of the PLTR&#39;s software product or the financial performance of the company.  I am well aware that those are one of the most important fundamental elements when valuing a business and I did spend a lot of time on them while doing my research, before ultimately deciding to invest in the company. However I believe that most of the redditors on this forum , especially those that are already investors, already have at least basic understanding of PLTR&#39;s financial situation and the specifications of its software. In this thesis I will try to give my perspective about why I think PLTR is a low bottom company with significant potential for growth, based on more &quot;abstract&quot; and less known factors.</p>\n\n<p>&#x200B;</p>\n\n<p>First of all, let&#39;s take a look at the commercial side of its business. Currently BP and Airbus contracts are responsible for 20 percent of the PLTR&#39;s revenue and some analyst think that such high-concentration is bad. However, they said the same think about PLTR&#39;s government work when the stock debuted. In short, they said that it is very worrying that PLTR generates such a high-percentage of its revenue from the U.S government and tried to convince investors to value PLTR not as a soft company, but as a defence contractor. I am glad that I did not listen to them at that time and bought the stock at 10 dollars, cuz my thinking was that if the U.S government values the PLTR&#39;s software so highly it is extremely likely that commercial businesess will do the same. Do you get where I am going? If Airbus and BP are paying the company more than 100 million dollars combined per year, then that means that PLTR&#39;s software is extremely efficient and if used right, could potentially safe customers hundreds of millions dollars of expenses or lost revenue. If you want more confirmation about how important the software could be for the business, have in mind that when partnering with the U.S Agency for Disease Control and Prevention, there are rumours that as early as January 2020 Palantir was able to build confidential models that showed the potential for a rapidly rising outbreak. Palantir then rushed in mid-February to recall staff from abroad and order them into a four-week quarantine. Now imagine if you knew about this as early as PLTR. March puts for the win.</p>\n\n<p>Even forgetting about the software and PLTR&#39;s growing revenue, let&#39;s take a look at some other factors that can&#39;t be measured by financial modelling. Currently PLTR is the only SaasS company in the world that is in talks to receive Impact Level 6 certification from the DoD. That means that PLTR will have access to classified information. Yeah, that is the kind of information that if you share with unauthorised personnel you go to prison for commiting treason against the state. Furthermore, the marine that participated in the operation of killing Bin Laden said in his book that PLTR soft. was instrumental in the sucess of the mission. To top it off , PLTR&#39;s lobbyist include figures like retired Marine Corps Brig. Gen. Terry Pau and ex- US State Secretary Condoleezza Rais and the new Director of National Intelligence in the Biden admin- Avril Haines is a former employee. Well, I think that we can say with great certainty that PLTR has become extremely important for the U.S government operations. If history has taught us anything, it is that if  the U.S government values something , it will not shy away from spending millions of taxpayers dollars to keep it afloat. But it as not only the U.S government. PLTR has won numerous contracts with government agencies of other countries like the British NHS and PLTR&#39;s head of operation in Israel- Hamutal Meridor, served as senior director of Verint, with deep ties to Unit 8200. Unit 8200  is an Israeli Intelligence Corps <em>unit</em> of the Israel Defense Forces responsible for collecting signal intelligence (SIGINT) and code decryption.</p>\n\n<p>If you are still not sure about PLTR&#39;s importance maybe you would like to know more about who is behind the company. Peter Thiel is a cofounder and the current largest shareholder. Yeah, that is right-Peter fucking Thiel. This guy was a business associate with Elon Musk in Paypal, he was the first investor in Facebook and a mentor of Zuckerberg and is a close friend of Chamath. He also bankrupted Gawker, cuz they had the audacity to leak the news that he is homosexual. Many people believe that he is one of the most well-connected men in the world and it comes at no surprise that he is a member of The Bilderberg group ( conspiracy theorists believe that these guys control the world) . I forgot to mention that his nickname is King Midas, cuz everything that he touches turns to gold.</p>\n\n<p>Palantir&#39;s other cofounder and current Ceo- Alex Karp is also a pretty interesting guy to say the least. He is a juris doctor from Stanford University, and a doctorate in neoclassical social theory from Goethe-Universität, Frankfurt, Germany. He is also a regular participant in the Davos economic forum. Oh, he also actively practices Tai Chi and Quidong. Yes, this guy actually studied the blade, how could you not trust him?</p>\n\n<p>To sum it up, I will use Alex Karp&#39;s own words: “We are going to deliver the world’s best software with the world’s most efficient way of delivering it. Investors will decide what that’s worth to them. And I think you’ll find in a number of years that there will be a consensus: Palantir is a truly special software company that is arguably the most important software company in the world.” -Karp the day they went public</p>\n\n<p>PS: English is not my mother tongue and I wrote this piece in a rush, so please excuse me if there are any grammatical or spelling errors.</p>\n</div><!-- SC_ON -->",
  "score": 375,
  "permalink": "/r/stocks/comments/mi8p2x/pltr_is_a_low_bottom_company_and_has_become_too/",
  "subreddit": "stocks",
  "id": "mi8p2x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961878973
}