{
  "author": "ConflictTerrible",
  "the_new_excerpt": "I turned 40 not long ago, so this might be why I'm thinking a lot more about\nthis.\n\nA bit about me, I struggled with dating and love for a long time. When I say for\na long time, I never had someone at all. So instead, I put the time spent\nbrowsing dating apps and checking dating advice into doing…",
  "original_created_utc": 1611413751,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我不久前才满40岁，所以这可能是我为什么会想得更多。\n这个。\n\n关于我的一些情况，我在交友和爱情中挣扎了很久。当我说为\n很长一段时间，我根本就没有人。所以，我反而把时间花在\n浏览约会的应用程序和检查约会的建议到做...",
      "title": "如何处理自己可能会孤独终老的想法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不久前才滿40歲，所以這可能是我爲什麼會想得更多。\n這個。\n\n關於我的一些情況，我在交友和愛情中掙扎了很久。當我說爲\n很長一段時間，我根本就沒有人。所以，我反而把時間花在\n瀏覽約會的應用程序和檢查約會的建議到做...",
      "title": "如何處理自己可能會孤獨終老的想法？"
    }
  ],
  "title": "How to handle the thoughts that you might live the rest of your life alone?",
  "created_utc": 1611433056,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I turned 40 not long ago, so this might be why I&#39;m thinking a lot more about this.</p>\n\n<p>A bit about me, I struggled with dating and love for a long time. When I  say for a long time, I never had someone at all. So instead, I put the  time spent browsing dating apps and checking dating advice into doing  something good for other people, I thought that if I couldn&#39;t find  someone to share life with, at least I could make a stranger&#39;s life  better.</p>\n\n<p>Now I&#39;m working with  disabled kids/adults and it&#39;s pretty damn great. I volunteer for the  homeless too and, again, I really like it.</p>\n\n<p>But when I see friends longing for a SO or listen to radio songs, I just  have to wonder how it feels to be wanted, and how this life is going to  end. I don&#39;t know the future, but with my streak I&#39;d like to have a  correct life even if it&#39;s spent alone. And so far, I think I managed  that.</p>\n\n<p>To be honest, I&#39;m really  scared for when I will be older. I&#39;m fit and healthy now, but as I age  that&#39;s going to change. I  don&#39;t want to be the old guy all alone at the end of a retirement home that never has any visit and looks out of the window hoping for a meteor crash. I don&#39;t want a SO just to have her take care of me mind you, it&#39;s just that growing old together sounds better than alone.</p>\n\n<p>So, guys that dealt with similar thoughts, how did you handle it?</p>\n\n<p>EDIT: To the dating coaches pouncing on the occasion of a thread with loners, kindly go be carrion eaters somewhere else.</p>\n</div><!-- SC_ON -->",
  "score": 8088,
  "permalink": "/r/AskMen/comments/l3dgjs/how_to_handle_the_thoughts_that_you_might_live/",
  "subreddit": "AskMen",
  "id": "l3dgjs",
  "is_self": true,
  "media": null,
  "is_video": false
}