{
  "author": "homrqt",
  "original_created_utc": 1633364734,
  "title": "Want to know how early we still are? Want some premium hopium? The ENTIRE cryptocurrency market currently still has a smaller market cap than Apple Corp.",
  "created_utc": 1633390316,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Per Coinmarketcap and Coingecko, the ENTIRE crypto market, including bitcoin, ethereum, and everyone else on the way down has a total combined market cap of approximately  $2.2 Trillion. The Apple Corporation is currently sitting at a market cap value of $2.358 Trillion. Think of what crypto still has ahead of it. Think of all the different use cases crypto has in the coming decades. The technological industry, financial industry, political, educational, medical, and practically every other aspect of society is going to be impacted by crypto one way or another. Apple themselves will be utilizing crypto in a variety of ways. The banks are lining up to become a part of the movement. We are still VERY early in this budding industry. And there are countless ways crypto will impact society that we haven&#39;t even thought of.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/q18wed/want_to_know_how_early_we_still_are_want_some/",
  "subreddit": "CryptoCurrency",
  "id": "q18wed",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Per Coinmarketcap and Coingecko, the ENTIRE crypto market, including bitcoin,\nethereum, and everyone else on the way down has a total combined market cap of\napproximately $2.2 Trillion. The Apple Corporation is currently sitting at a\nmarket cap value of $2.358 Trillion. Think of what crypto still…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "CoinmarketcapとCoingeckoによると、ビットコイン、イーサリアム、その他の下降しているものを含めたENTIRE crypto marketは、合計の時価総額があります。\nビットコイン、イーサリアム、そして下降線上にある他のすべてのものを含め、合計の時価総額は\n約2.2兆ドルです。Apple Corporationは現在、時価総額2.358ドルとなっています。\nApple Corporationの時価総額は、現在2.358兆ドルです。まだまだ続く暗号の世界を考えると...。",
      "title": "まだまだ早さを知りたい？プレミアム・ホピウムが欲しいですか？現在、暗号通貨市場全体の時価総額は、Apple Corp.よりもまだ小さい。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "根据Coinmarketcap和Coingecko，整个加密货币市场，包括比特币。\n以太坊，以及其他所有正在下跌的人，其总市值为\n约2.2万亿美元。苹果公司目前的市值是\n市值为2.358万亿美元。想想看，加密货币还有什么...",
      "title": "想知道我们还有多早吗？想要一些高级的希望吗？整个加密货币市场目前的市值仍比苹果公司小。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據Coinmarketcap和Coingecko，整個加密貨幣市場，包括比特幣。\n以太坊，以及其他所有正在下跌的人，其總市值爲\n約2.2萬億美元。蘋果公司目前的市值是\n市值爲2.358萬億美元。想想看，加密貨幣還有什麼...",
      "title": "想知道我們還有多早嗎？想要一些高級的希望嗎？整個加密貨幣市場目前的市值仍比蘋果公司小。"
    }
  ]
}