{
  "author": "DavasiaN",
  "the_new_excerpt": "TLDR: The gamma squeeze we previously saw in $GME is starting to happen in\n$TLRY. The price of TLRY has skyrocketed so high that all the call options the\nMarket Makers wrote are forcing them to buy and hold shares to hedge against\nuncapped losses. Between the Market Makers and the Shorts, there are…",
  "original_created_utc": 1612934392,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "TLDR：我们之前在$GME中看到的伽马压榨开始发生在我们的生活中。\n$TLRY。TLRY的价格已经飙升到如此之高，所有的看涨期权的。\n做市商写道，正迫使他们买入并持有股票以对冲。\n亏损不封顶。在做市商和空头之间，有...",
      "title": "$TLRY Gamma Squeeze在这里! 数字加$APHA讨论"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TLDR：我們之前在$GME中看到的伽馬壓榨開始發生在我們的生活中。\n$TLRY。TLRY的價格已經飆升到如此之高，所有的看漲期權的。\n做市商寫道，正迫使他們買入並持有股票以對沖。\n虧損不封頂。在做市商和空頭之間，有...",
      "title": "$TLRY Gamma Squeeze在這裏! 數字加$APHA討論"
    }
  ],
  "title": "The $TLRY Gamma Squeeze is HERE! Numbers plus $APHA discussion",
  "created_utc": 1612943018,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TLDR: The gamma squeeze we previously saw in $GME is starting to happen in $TLRY. The price of TLRY has skyrocketed so high that all the call options the Market Makers wrote are forcing them to buy and hold shares to hedge against uncapped losses. Between the Market Makers and the Shorts, there are less and less shares available. My guess is that the price of TLRY will continue to skyrocket until next week, at a minimum.</p>\n\n<p>CONGRATS fellow TLRY/APHA holders! I strongly believe we are witnessing a huge gamma squeeze underway. Today, the price of TLRY rose above the highest strike prices on the options chain ($42), which means all the available call options are in-the-money. Market Makers released new strike prices from $45 to $65. FYI: some brokers do not show the new strike prices ($45/50/55/60/65) right away because they are scumbags.</p>\n\n<p><em>How can we tell this is a gamma squeeze?</em></p>\n\n<p>Take a look at the TODAY&#39;s call options volume for Feb 12 expiration (this Friday):</p>\n\n<ul>\n<li>30,633 at the $40 strike calls</li>\n<li>6,810 at the $41 strike calls</li>\n<li>62,786 at he $42 strike calls</li>\n</ul>\n\n<p>That is nearly 100,000 call options. If you add up the call volume from $30 to $42 strikes, you get over 150,000 call options traded today! Open interest was much lower than volume, which tells me these are new call positions being opened.</p>\n\n<p>150,000 call options x 100 shares per call option = 15 MILLION TLRY shares that Market Makers have to buy on the open market and hold until all the contracts are resolved next week. This is only for today&#39;s volume, WE STILL HAVE 2 MORE TRADING DAYS TO GO!</p>\n\n<p>To add fuel to the fire, TLRY has a significant amount of short interest and low shares float (shares that are available for trading, not locked up with institutions or insiders):</p>\n\n<ul>\n<li>TLRY shares float: <strong>~95M</strong> / short interest: <strong>~32M</strong> / today&#39;s MM hedge: ~<strong>15M</strong></li>\n</ul>\n\n<p>Let&#39;s get this straight, what we are seeing today is <strong>not 100% a short squeeze.</strong> This is <em>mostly</em> a gamma squeeze. However, the gamma squeeze and high short interest has an amplifying effect on each other. Market makers and shorts both have to bid against each other to buy shares on the open market, causing the price to skyrocket even higher!</p>\n\n<p>For APHA holders, we should see new strike prices released tomorrow, because APHA is trading at $27 afterhours which is above the highest $25 strike. Theoretically, we could see a gamma squeeze on APHA, but I think the chance of that happening is very very low. <em>Why?</em></p>\n\n<p>APHA has a LOT more shares float (shares available to trade) and much lower short interest:</p>\n\n<ul>\n<li>APHA shares float: <strong>~312M</strong> / short interest: <strong>~16M /</strong> today&#39;s MM hedge: <strong>maybe 5M</strong></li>\n</ul>\n\n<p>That is a ton of shares available for the Market Makers to tap into, and far less shorts to fight against. You would need something like 500k or more call option volume to apply enough pressure on MM to cause a gamma squeeze. I think a true <strong>APHA gamma squeeze is very unlikely</strong>.</p>\n\n<p>The good news for my APHA holders is that you will probably see APHA trade up with TLRY due to the pending merger, but at a steep discount (40% or more). Lots of posts/comments are raving about the huge arbitrage opportunity, but that is not realistic until a merger date is set and we get close to that date. Plus, you will need to hold your shares until the merger, which nobody really knows how long that could take.</p>\n\n<p>Lastly, This is a gamma squeeze play in the short term. Realize that once the gamma squeeze is over, the trade is over and you need to get out! I will add that I love the TLRY+APHA merger, and love the fundamentals of the company. I believe they are a long term winner with multiple tailwinds in the US and Europe. I might do another FA post with DD, but right now my priority is this gamma squeeze.</p>\n\n<p>Best of luck to you all!</p>\n\n<p><em>Disclaimer: I own TLRY call options.</em></p>\n\n<p>EDIT: some users are asking for sources to these numbers:</p>\n\n<p>I used ThinkorSwim (TD Ameritrade) to see the options chain info. They allowed buying/selling of the new $45 to $65 strikes in TLRY. Here is a screenshot of the Weekly Feb 12 expiration mentioned above: <a href=\"https://i.imgur.com/V9MQReL.png\">Link</a></p>\n\n<p><a href=\"https://finance.yahoo.com/quote/TLRY/key-statistics/\">TLRY Shares Float (95M) and Short Interest (34M) (Yahoo Finance)</a></p>\n\n<p><em>I subscribe to other data sources of short interest, which all report between 32 and 34M short interest as of today.</em></p>\n\n<p><a href=\"https://finance.yahoo.com/quote/APHA/key-statistics/\">APHA Shares Float (312M) and SI (21M) (Yahoo Finance)</a></p>\n\n<p><em>My other data sources show Short Interest in APHA dropped recently to ~16M. Yahoo Finance SI data is old, from Jan 15.</em></p>\n</div><!-- SC_ON -->",
  "score": 246,
  "permalink": "/r/stocks/comments/lgmozr/the_tlry_gamma_squeeze_is_here_numbers_plus_apha/",
  "subreddit": "stocks",
  "id": "lgmozr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123204959
}