{
  "author": "Osiak",
  "the_new_excerpt": "Hey everyone. I wanted to preface this post by saying this is my first DD, so\nany critiques or feedback is appreciated! I currently own 0 shares in this\nstock, but it is something that I am purchasing tomorrow morning.\n\nWhat is Daré Bio?\n\nDaré Bioscience is a clinical-stage biopharmaceutical company…",
  "original_created_utc": 1615556581,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，大家好。我想在这个帖子前说，这是我的第一个DD，所以。\n任何批评或反馈都将被感激! 我目前在此拥有0股\n股票，但这是我明天早上要购买的东西。\n\n达瑞生物是什么？\n\n达瑞生物是一家临床阶段的生物制药公司...",
      "title": "$DARE生物科学与3月"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，大家好。我想在這個帖子前說，這是我的第一個DD，所以。\n任何批評或反饋都將被感激! 我目前在此擁有0股\n股票，但這是我明天早上要購買的東西。\n\n達瑞生物是什麼？\n\n達瑞生物是一家臨牀階段的生物製藥公司...",
      "title": "$DARE生物科學與3月"
    }
  ],
  "title": "$DARE Biosciences and the Month of March",
  "created_utc": 1615581759,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey everyone. I wanted to preface this post by saying this is my first DD, so any critiques or feedback is appreciated! I currently own 0 shares in this stock, but it is something that I am purchasing tomorrow morning.</p>\n\n<p><strong>What is</strong> <strong>Daré</strong> <strong>Bio?</strong></p>\n\n<p>Daré Bioscience is a clinical-stage biopharmaceutical company committed to the advancement of innovative products for women’s health. The company’s mission is to identify, develop and bring to market a diverse portfolio of differentiated therapies that expand treatment options, improve outcomes and facilitate convenience for women, primarily in the areas of contraception, vaginal health, sexual health, and fertility.</p>\n\n<p><strong>Why this stock hit my radar/why you should care:</strong></p>\n\n<p>Daré just recently announced positive results from its Phase 3 clinical trial of a one-time treatment for bacterial vaginosis. The treatment, DARE-BV1, received Fast Track designation from the U.S. Food and Drug Administration earlier this year and, based on the topline results of the trial, Daré said it planned to file a new drug application in the first half of 2021. This has further attracted analysts and larger investors to keep their eyes on Daré in the upcoming months as it could be used massively later in 2021.</p>\n\n<p>The condition affects approximately 21 million women in the United States, usually in their reproductive years, <a href=\"https://www.mayoclinic.org/diseases-conditions/bacterial-vaginosis/symptoms-causes/syc-20352279\">according to the Mayo Clinic</a>. The condition, which generally doesn’t cause complications, can, however, lead to preterm birth or increase the risk of infertility due to infection of the uterus and the fallopian tubes.</p>\n\n<p><strong>Products in the Pipeline: (Information here is quoted directly from the company&#39;s website)</strong></p>\n\n<p><strong><em>Ovaprene</em></strong> <strong>(CURRENTLY OBSERVING DATA FROM PHASE 3)</strong></p>\n\n<p>Ovaprene is a hormone-free, monthly vaginal contraceptive designed to provide contraception over multiple weeks by releasing a locally acting agent which impedes sperm motility, coupled with a unique knitted polymer barrier that physically blocks sperm from entering the cervical canal. The novel combination of these complementary approaches has the potential to produce efficacy consistent with existing short-acting hormone birth control options (pills, patches, vaginal ring), without the use of hormones.</p>\n\n<p>In a postcoital test (PCT) study, Ovaprene successfully immobilized sperm and prevented their progression into the cervical canal. We intend to prepare and file an Investigational Device Exemption (IDE) with the FDA to commence a pivotal clinical trial. If approved, Ovaprene will be a first-in-category therapy for women seeking a hormone-free, self-administered and non-invasive birth control method.</p>\n\n<p><strong>NOTES FOR THIS ONE:</strong></p>\n\n<p>THIS PRODUCT IS HUGE IF IT IS SUCCESSFUL. I cannot express how many women struggle due to contraceptives altering their hormones. Birth control medications ranging from pills to IUDS alter women&#39;s hormones causing a laundry list of issues such as weight gain, health complications, and mental illness (depression, anxiety, etc.). If this product is successful, it will be the FIRST in women&#39;s contraception to create a product like this that can be administered monthly for women. There is only one other product that really exists that women can use for hormone-free contraception, and that is a specific type of an IUD. HOWEVER, IUDs are EXTREMELY painful, and I am sure many women will prefer Ovaprene as it is additionally self-administered.</p>\n\n<p><strong><em>SILDENAFIL CREAM</em></strong> <strong>(CURRENTLY IN PHASE 2b CLINICAL TRIALS)</strong></p>\n\n<p>Female sexual arousal disorder (FSAD) is the inability to reach or maintain a sufficient physical response to sexual stimulation. An estimated 16% of women ages 21 to 60, or approximately 10 million women in the U.S., are distressed from experiencing symptoms of low or no sexual arousal and are seeking a solution to improve their condition. To put the market opportunity for an FDA-approved FSAD treatment in context, the prevalence of complete erectile dysfunction (ED) in men is estimated to be about 5% of men at age 40, increasing to about 15% at age 70.</p>\n\n<p>Still, there are currently no FDA-approved therapies for FSAD. Orally administered sildenafil received FDA approval in 1998 for the treatment of erectile dysfunction in men and is marketed under the brand name Viagra®. Given the underlying pathophysiologic similarities of ED and FSAD, using sildenafil to direct blood to the genitals before sexual activity could provide a potential improvement in genital arousal response and overall sexual experience for women as it does in men.</p>\n\n<p>Our localized, proprietary formulation of sildenafil cream, 3.6% (topical cream, sildenafil), has been designed specifically for women. The targeted application of this cream to the genital tissue is designed to increase local blood flow without the associated systemic exposure and side effects, leading to an improvement in overall sexual experience and response.</p>\n\n<p><strong><em>DARE-BV1</em></strong> <strong>(SUCCESSFULLY COMPLETED PHASE 3 TRIALS WITH POSITIVE RESULTS)</strong></p>\n\n<p>Bacterial vaginosis is the most common type of vaginal infection in women of reproductive age. In the U.S. alone, bacterial vaginosis is estimated to affect approximately 21 million women. While there are several orally and vaginally delivered therapeutic interventions indicated for the treatment of bacterial vaginosis, currently approved options in the U.S. have relatively insufficient clinical cure rates, require sequential daily administrations or can be otherwise inconvenient for women to use.</p>\n\n<p>DARE-BV1 is a thermosetting vaginal gel formulated with clindamycin phosphate 2% designed for prolonged, localized release of the antibiotic.</p>\n\n<p><strong>Upcoming Products:</strong></p>\n\n<p>I&#39;m going to be quite honest here, there are a TON of diverse products that this company is currently working on to counter sexual disorders and health complications involving sexual activity. They are additionally looking into contraceptives for Males as well. This company currently has many of these products in the pre-trials stage, but they are committed to continuing research for the benefit of people&#39;s health.</p>\n\n<p><strong>Previous Drop in Price:</strong></p>\n\n<p>One thing I think many people will look at and question is the 5-year chart for Daré; this stock used to trade at $33/share back in 2017. However, after the acquisition of another company known as Cerulean, Daré conducted a 10 to 1 reverse split which I think additionally scared off investors. Not to mention, COVID additionally further spiked the price down along with other stocks in 2020 as well.</p>\n\n<p><strong>Upcoming Catalysts:</strong></p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>On March 25th, Dare will announce their Q4 earnings (pre-market). Based on their positive phrase 3 clinical results, this is predicted to be a positive earnings call with further products hopefully entering phase 3 trials soon.</li>\n<li>Dare is further participating in two upcoming conferences to debut their products to large investors.</li>\n</ol>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Conference #1: <strong>33rd Annual Roth Conference (March 15th)</strong> [This is the same conference that companies like <em>Assertio</em> will be presenting at.]</li>\n<li>Conference #2: <strong>M Vest and Maxim Group Inaugural Emerging Growth Virtual Conference (March 17 &amp; 18)</strong></li>\n<li>Conference #3: <strong>BIO-Europe Spring Digital (March 22 - 25)</strong></li>\n</ul>\n\n<ol>\n<li><strong>Results for clinical trials on Ovaprene.</strong></li>\n</ol>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>**Ovaprene is currently in the process to enter clinical trials which are already looking successful. The following is quoted from the DARE website: &quot;**In a postcoital test (PCT) study, Ovaprene successfully immobilized sperm and prevented their progression into the cervical canal. We intend to prepare and file an Investigational Device Exemption (IDE) with the FDA to commence a pivotal clinical trial. If approved, Ovaprene will be a first-in-category therapy for women seeking a hormone-free, self-administered and non-invasive birth control method.&quot;</li>\n</ul>\n\n<p>Something to pull away from this is that they are spreading awareness continuously during this month about their successful trials and upcoming products. Partners and investors are their major concern at the moment, and this is a great opportunity for them to pull in potential partners/investors based on previous successes.</p>\n\n<p><strong>My Take</strong></p>\n\n<p>Dare is not only a short term investment for the month of March, but a long term investment under a Biden administration. Biden has stated multiple times that women&#39;s health is a priority with his focus on health care during his presidency. This backed by other democrats could be a major upside for women&#39;s health companies such as Dare. Obviously I recommend you all do your own DD, but this company has the potential to blow up over the course of 2021 with its price target being moved to the $5 - 9 range.</p>\n\n<p><a href=\"https://ir.darebioscience.com/financial-information\">Financial Information</a></p>\n\n<p><a href=\"https://darebioscience.com/pipeline/\">Pipeline Overview</a></p>\n\n<p><a href=\"https://ir.darebioscience.com/press-releases\">Press Releases</a></p>\n\n<p>Edit: I now own 100 shares @ 2.25</p>\n</div><!-- SC_ON -->",
  "score": 65,
  "permalink": "/r/investing/comments/m3hspu/dare_biosciences_and_the_month_of_march/",
  "subreddit": "investing",
  "id": "m3hspu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147379957
}