{
  "author": "chuckecheezitz",
  "original_created_utc": 1625334451,
  "title": "Why is it not considered racism if white?",
  "created_utc": 1625381014,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sorry if this is a stupid question or the wrong subreddit. For background, I am 100% Asian. My boyfriend however is 100% white. We live in a place where white people are by far the minority. People here really don’t like white people to the point that we have wondered if my boyfriend should instead take my last name when we get married to avoid discrimination for our kids. I’ve even heard my bosses say they won’t hire a white person before. </p>\n\n<p>Last night while he was working, a POC came in and ignored my boyfriend to his face while he was trying to help him in the store he works. He told his son in front my boyfriend that he “don’t speak to white boys” and that “white boys can go shut the hell up.” Then somehow continued to ignore him for the rest of the transaction. </p>\n\n<p>It made my blood boil to hear my boyfriend was treated like this, but everyone says white racism isn’t real. We see things like this happen all the time where I’ll get treated better than my boyfriend. Why is it that when something clear as this happens is it not considered racism because he’s white? </p>\n\n<p>Sorry Im seriously not trying to stir the shit pot on this, I’m genuinely confused and questioning. Please educate me if I’m misunderstanding.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/od2sl1/why_is_it_not_considered_racism_if_white/",
  "subreddit": "TooAfraidToAsk",
  "id": "od2sl1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Sorry if this is a stupid question or the wrong subreddit. For background, I am\n100% Asian. My boyfriend however is 100% white. We live in a place where white\npeople are by far the minority. People here really don’t like white people to\nthe point that we have wondered if my boyfriend should instead…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "くだらない質問であったり、間違ったsubredditであったりしたらごめんなさい。背景として、私は\n100%アジア人です。しかし、私の彼氏は100％白人です。私たちは白人が圧倒的に少ない場所に住んでいます。\n白人は圧倒的に少数派です。ここの人たちは本当に白人を嫌っています。\n私の彼氏も白人の方がいいのではないかと思うほどです。",
      "title": "なぜ白人だと人種差別にならないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果这是一个愚蠢的问题或错误的子目录，请原谅。关于背景，我是\n100%的亚洲人。但我的男朋友是100%的白人。我们生活的地方，白人\n人是迄今为止的少数。这里的人真的不喜欢白人\n我们曾想过我的男朋友是否应该改成...",
      "title": "为什么如果是白人就不被认为是种族主义？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果這是一個愚蠢的問題或錯誤的子目錄，請原諒。關於背景，我是\n100%的亞洲人。但我的男朋友是100%的白人。我們生活的地方，白人\n人是迄今爲止的少數。這裏的人真的不喜歡白人\n我們曾想過我的男朋友是否應該改成...",
      "title": "爲什麼如果是白人就不被認爲是種族主義？"
    }
  ]
}