{
  "author": "NineteenSixtySix",
  "the_new_excerpt": "Article\n[https://markets.businessinsider.com/news/stocks/palantir-stock-price-goldman-sachs-q4-earnings-analysis-2021-2-1030092816]\n\nPalantir Technologies received a fresh \"buy\" rating and a $34 price target from\nGoldman Sachs on Wednesday. While the big data analytics firm's stock took a\ntumble on…",
  "original_created_utc": 1613574938,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "文章\n[https://markets.businessinsider.com/news/stocks/palantir-stock-price-goldman-sachs-q4-earnings-analysis-2021-2-1030092816]\n\nPalantir Technologies获得了新的 \"买入 \"评级，目标价为34美元。\n高盛周三。虽然这家大数据分析公司的股价以\n跌跌撞撞",
      "title": "Palantir在最新财报中透露 \"可持续增长 \"后，高盛将Palantir上调至 \"买入\"，新目标价为34美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "文章\n[https://markets.businessinsider.com/news/stocks/palantir-stock-price-goldman-sachs-q4-earnings-analysis-2021-2-1030092816]\n\nPalantir Technologies獲得了新的 \"買入 \"評級，目標價爲34美元。\n高盛週三。雖然這家大數據分析公司的股價以\n跌跌撞撞",
      "title": "Palantir在最新財報中透露 \"可持續增長 \"後，高盛將Palantir上調至 \"買入\"，新目標價爲34美元。"
    }
  ],
  "title": "Palantir upgraded to 'buy' with a fresh $34 price target from Goldman Sachs after revealing 'sustainable growth' in latest earnings",
  "created_utc": 1613578846,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://markets.businessinsider.com/news/stocks/palantir-stock-price-goldman-sachs-q4-earnings-analysis-2021-2-1030092816\"><strong><em>Article</em></strong></a></p>\n\n<p>Palantir Technologies received a fresh &quot;buy&quot; rating and a $34 price target from Goldman Sachs on Wednesday.\nWhile the big data analytics firm&#39;s stock took a tumble on Tuesday after earnings revealed a surprise loss, analysts at Goldman were pleased with the quarterly results, saying the company now has a path to &quot;sustainable growth&quot;.\nThe analysts, led by Christopher D. Merwin, CFA, said Palantir posted &quot;strong FQ4 results&quot; that beat their revenue and EBITDA expectations by 6% and 115% respectively.\nThey also noted Palantir&#39;s robust revenue guidance and backlog of orders going into 2021.</p>\n\n<p>&quot;We were encouraged to see management guide to $4bn of revenue in FY25, implying a 30% 5-year CAGR from FY20,&quot; Merwin said. &quot;With a growing backlog of $2.8bn in deal value (+31% y/y), we believe there is increasing visibility into the achievability of that long-term target.&quot;\nGovernment revenue was another bright spot for Palantir in its most recent earnings report, rising 85% year-over-year to $190 million. The company signed 21 deals worth over $5 million with contractors during the quarter compared to just 15 a year ago.\nGoldman analysts also said they expect the margin expansion of 63 points seen in the quarter to continue going forward, leading the group to model 23% non-GAAP EBIT, up from 17%.\nFurthermore, Goldman said Palantir&#39;s deal with IBM to &quot;should help to grow what is a relatively small commercial customer count today.&quot;\nPalantir&#39;s quarterly results were enough for Goldman to more than double its price target from $13 per share to $34. The company should now &quot;trade more in line with 30%+ growth businesses, which are trading at 44x CY21 sales&quot; according to Merwin and his team.</p>\n\n<p>Goldman&#39;s price target implies a 22% potential return from Tuesday&#39;s closing price.\nPalantir&#39;s stock has risen nearly 200% in the last six months amid a bull market for equities. However, the company saw its shares fall from all-time-highs of over $39 per share on Jan. 27.</p>\n</div><!-- SC_ON -->",
  "score": 4696,
  "permalink": "/r/stocks/comments/llwpbc/palantir_upgraded_to_buy_with_a_fresh_34_price/",
  "subreddit": "stocks",
  "id": "llwpbc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728625107
}