{
  "author": "perchero",
  "the_new_excerpt": "In the last days we have seen a MASSIVE influx of low effort low quality content\nin the sub. We went from memes to per personal nonsense stories about how:\n\n\"im from brazil and crypto saved my life bc my 30usd are now 35\"\n\n\"my mom doesnt understand crypto but she said she supports me bc i am…",
  "original_created_utc": 1615374092,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的日子里，我们看到了大量的低努力低质量的内容涌入。\n中的子。我们从备忘录到每个人的胡说八道故事，关于如何。\n\n\"我来自巴西，加密技术救了我的命 因为我的30美元现在变成了35美元\"\n\n\"我妈妈不懂加密，但她说她支持我，因为我... ...",
      "title": "月亮养殖是疯狂的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的日子裏，我們看到了大量的低努力低質量的內容湧入。\n中的子。我們從備忘錄到每個人的胡說八道故事，關於如何。\n\n\"我來自巴西，加密技術救了我的命 因爲我的30美元現在變成了35美元\"\n\n\"我媽媽不懂加密，但她說她支持我，因爲我... ...",
      "title": "月亮養殖是瘋狂的"
    }
  ],
  "title": "Moonfarming is INSANE",
  "created_utc": 1615386936,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the last days we have seen a MASSIVE influx of low effort low quality content in the sub. We went from memes to per personal nonsense stories about how:</p>\n\n<p>&quot;im from brazil and crypto saved my life bc my 30usd are now 35&quot; </p>\n\n<p>&quot;my mom doesnt understand crypto but she said she supports me bc i am obssesed and she loves me&quot; </p>\n\n<p>&quot;venezuela bad, crypto good&quot;</p>\n\n<p>&quot;crypto saved my life bc i now buy btc instead of drugs&quot;</p>\n\n<p>and the countless BLAND, LAZY responses of the ppl here saying &quot;hey there you go&quot; &quot;you are strong and wonderful&quot; &quot;keep on champ!&quot; and what not</p>\n\n<p>I feel Im living in the minimum power my-man Rick and Morty simulation and all for what? To get 10usd in moons? are you guys fucking insane?? are you so desperate?</p>\n\n<p>BAN MEMES, BAN JUNK, CC FOR INFO</p>\n</div><!-- SC_ON -->",
  "score": 5118,
  "permalink": "/r/CryptoCurrency/comments/m1v26g/moonfarming_is_insane/",
  "subreddit": "CryptoCurrency",
  "id": "m1v26g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542573528
}