{
  "author": "just---here",
  "original_created_utc": 1637418731,
  "title": "I think Solana is the most over rated crypto and does not deserve a top 5 spot",
  "created_utc": 1637422589,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Maybe it&#39;s just me but I dont see how Solana is so high up the rankings when theres so much controversy around it. The technology is good but aside from that it&#39;s an absolute shit coin, another &quot;ethereum killer&quot; that will probably die out once the biggest investors sell their bags. </p>\n\n<p>For starters how can the devs shut down the blockchain because of a glitch then call the platform decentralised? Do you think crypto could of ever come this far if satoshi shut down btc for repairs? Absolute nonsense.</p>\n\n<p>Then there was the discovery of a hidden 12 million coins which wasint disclosed to any investor. 12,000,000× £160 (roughly at the moment)= £1,920,000,000 is a lot of money to hide for no specific reason.</p>\n\n<p>And dont forget the announcement of bringing tether  to their blockchain like that&#39;s something to be proud of, everyone in the crypto space knows tether is a liability and could put everyone&#39;s investment at risk.</p>\n\n<p>I know theres things I&#39;ve missed out but I cant buy force myself to buy into this scammy sounding project, too many things wrong with it.</p>\n</div><!-- SC_ON -->",
  "score": 575,
  "permalink": "/r/CryptoCurrency/comments/qy6r4o/i_think_solana_is_the_most_over_rated_crypto_and/",
  "subreddit": "CryptoCurrency",
  "id": "qy6r4o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Maybe it's just me but I dont see how Solana is so high up the rankings when\ntheres so much controversy around it. The technology is good but aside from that\nit's an absolute shit coin, another \"ethereum killer\" that will probably die out\nonce the biggest investors sell their bags.\n\nFor starters how…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私だけかもしれませんが、これだけ話題になっているのに、ソラナがこんなに上位にいるのは不思議です。\n賛否両論があるのに、なぜソラナが上位にあるのかわかりません。技術的には優れていますが、それはさておき\nイーサリアムキラー」と呼ばれるほどの絶対的なクソコインで、大口の投資家が売ってしまえば、おそらく消滅するでしょう。\n大口の投資家がバッグを売ってしまえば、おそらく消滅するだろう。\n\nまず第一に、どのように...",
      "title": "ソラナは最も過大評価されている暗号であり、トップ5に入る資格はないと思う。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "也许这只是我的看法，但我不明白为什么索拉纳的排名如此之高？\n它周围有那么多的争议。技术是好的，但除了这个以外\n这是一个绝对的狗屎币，另一个 \"以太坊杀手\"，一旦最大的投资者卖掉他们的包，它可能就会消亡。\n一旦最大的投资者卖掉他们的包。\n\n对于初学者来说，如何...",
      "title": "我认为索拉纳是最被高估的加密货币，不配获得前五名的位置。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "也許這只是我的看法，但我不明白爲什麼索拉納的排名如此之高？\n它周圍有那麼多的爭議。技術是好的，但除了這個以外\n這是一個絕對的狗屎幣，另一個 \"以太坊殺手\"，一旦最大的投資者賣掉他們的包，它可能就會消亡。\n一旦最大的投資者賣掉他們的包。\n\n對於初學者來說，如何...",
      "title": "我認爲索拉納是最被高估的加密貨幣，不配獲得前五名的位置。"
    }
  ]
}