{
  "author": "tekloin",
  "original_created_utc": 1654880100,
  "title": "Am I an incel",
  "created_utc": 1654957664,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been single my entire live but I&amp;#39;d like to have a girlfriend, so definitionally I&amp;#39;m incel, but I feel like most of the time when people get called incels they feel entitled towards women and are angry at them when they reject them. I don&amp;#39;t feel entitled, rather the opposite, I don&amp;#39;t think I deserve a girlfriend at the moment because I made a mess out of my life, I&amp;#39;m currently trying to improve myself and hopefully I&amp;#39;ll be able to woo a woman at some point.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/v9c6f9/am_i_an_incel/",
  "subreddit": "NoStupidQuestions",
  "id": "v9c6f9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been single my entire live but I'd like to have a girlfriend, so\ndefinitionally I'm incel, but I feel like most of the time when people get\ncalled incels they feel entitled towards women and are angry at them when they\nreject them. I don't feel entitled, rather the opposite, I don't think I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ずっと独身だけど、彼女は欲しいと思っている。\n定義的にはインセルなんだけど、でも、ほとんどの人が、「インセルって何？\nインセルと呼ばれる人たちは、女性に対して権利を感じていて、女性に拒絶されると怒ることが多いような気がします。\nと怒ります。私は権利を感じないし、むしろその逆で、自分が...",
      "title": "私はインセルか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直都是单身，但我想有个女朋友，所以\n从定义上讲，我是不伦恋，但我觉得大多数时候，当人们被称为\n但我觉得大多数时候，当人们被称为 \"不伦恋 \"时，他们觉得自己对女性有权利，当女性拒绝他们时，他们会对女性感到愤怒。\n拒绝他们。我不觉得自己有权利，恰恰相反，我不认为我...",
      "title": "我是一个不道德的人吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直都是單身，但我想有個女朋友，所以\n從定義上講，我是不倫戀，但我覺得大多數時候，當人們被稱爲\n但我覺得大多數時候，當人們被稱爲 \"不倫戀 \"時，他們覺得自己對女性有權利，當女性拒絕他們時，他們會對女性感到憤怒。\n拒絕他們。我不覺得自己有權利，恰恰相反，我不認爲我...",
      "title": "我是一個不道德的人嗎？"
    }
  ]
}