{
  "author": "Somnialis",
  "the_new_excerpt": "Hi everyone,\n\nI recently finished The Myth Of Sisyphus by Camus and found it to be an\ninteresting, yet difficult read. I am scratching my head a bit when reflecting\non whether Camus truly avoids committing his self-termed \"Leap of Faith\".\n\nCamus explains that existentialists who ascribe their own…",
  "original_created_utc": 1621852294,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n最近、カミュの「シジフォスの神話」を読み終えたのですが、面白いけど難しい本でした。\n興味深い、しかし難しい本でした。私は、カミュが自分で言うところの「信仰の飛躍」を本当に避けることができたのか\nカミュは自分で言うところの「信仰の飛躍」を本当に避けることができたのだろうかと考えると、少し頭を抱えてしまいます。\n\nカミュは、実存主義者が自分自身のことを「信仰の跳躍」と呼んでいると説明しています。",
      "title": "カミュは本当に『信仰の跳躍』を避けているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n我最近读完了加缪的《西西弗斯的神话》，发现它是一部\n有趣，但也很难读懂。我在思考以下问题时有点挠头\n加缪是否真的避免了他自称的 \"信仰的飞跃\"。\n\n加缪解释说，存在主义者如果把自己的观点归结为 \"信仰的飞跃\"，那么他们就会把自己的观点归结为 \"信仰的飞跃\"。",
      "title": "加缪真的避免采取信仰的飞跃吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n我最近讀完了加繆的《西西弗斯的神話》，發現它是一部\n有趣，但也很難讀懂。我在思考以下問題時有點撓頭\n加繆是否真的避免了他自稱的 \"信仰的飛躍\"。\n\n加繆解釋說，存在主義者如果把自己的觀點歸結爲 \"信仰的飛躍\"，那麼他們就會把自己的觀點歸結爲 \"信仰的飛躍\"。",
      "title": "加繆真的避免採取信仰的飛躍嗎？"
    }
  ],
  "title": "Does Camus really avoid taking the Leap of Faith?",
  "created_utc": 1621886404,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone,</p>\n\n<p>I recently finished <em>The Myth Of Sisyphus</em> by Camus and found it to be an interesting, yet difficult read. I am scratching my head a bit when reflecting on whether Camus truly avoids committing his self-termed &quot;Leap of Faith&quot;.</p>\n\n<p>Camus explains that existentialists who ascribe their own subjective meanings to life do so to assuage the distress arising from the absurd condition, and are therefore taking the Leap. </p>\n\n<p>To the contrary, a true absurd man will continually revolt against this lack of meaning by pursuing (quantitatively) what he values in life.  In other words, live a life rich in as much experience as possible.</p>\n\n<p>What is glaring to me, is that Camus seems to be smuggling in a subjective meaning of life here. The implied argument seems to be: <em>the meaning of life is to revolt against its meaninglessness</em>. I&#39;m having trouble seeing how he differs from other existentialists he criticizes as taking the Leap of Faith. Perhaps I am missing something? I would appreciate you folks&#39; input on this. </p>\n\n<p>Thanks!</p>\n\n<p>edit: spelling</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/askphilosophy/comments/njutjx/does_camus_really_avoid_taking_the_leap_of_faith/",
  "subreddit": "askphilosophy",
  "id": "njutjx",
  "is_self": true,
  "media": null,
  "is_video": false
}