{
  "author": "MrNuttyJoe",
  "original_created_utc": 1626604496,
  "title": "You wake up tomorrow and you've become a Crypto millionaire. What do you do with your new-found wealth?",
  "created_utc": 1626644542,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What are your immediate plans? How much profit do you take out, and what do you spend on first?</p>\n\n<p>I personally would take out enough to buy a house (nothing too expensive) and keep a significant chunk in Crypto. I know everyone has different plans for what they would do, so tell me! Do you start a business? Give back to your community?</p>\n\n<p>Also....... do you tell your family and friends that you&#39;re now a millionaire?!?</p>\n\n<p>Edit: thanks everyone for the awards! Very much appreciated</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/omo4fx/you_wake_up_tomorrow_and_youve_become_a_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "omo4fx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "What are your immediate plans? How much profit do you take out, and what do you\nspend on first?\n\nI personally would take out enough to buy a house (nothing too expensive) and\nkeep a significant chunk in Crypto. I know everyone has different plans for what\nthey would do, so tell me! Do you start a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "当面の予定はどうでしょうか？どのくらいの利益を出して、何をするのですか？\nまず何に使いますか？\n\n個人的には、家を買うのに十分な額（あまり高価なものではない）を引き出し、かなりの額を暗号に残しておきます。\nかなりの額を暗号化しておきます。人によってプランは様々だと思いますが\n私に教えてください。あなたは...",
      "title": "明日目を覚ますと、あなたはCrypto millionaireになっています。新たに手に入れた富で何をしますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你的近期计划是什么？你会拿出多少利润？\n首先花在什么地方？\n\n我个人会拿出足够的钱来买房子（不要太贵），然后\n在加密货币中保留相当大的一块。我知道每个人都有不同的计划\n他们会做什么，请告诉我! 你是否开始了一个...",
      "title": "你明天醒来，你已经成为一个加密货币百万富翁。你会用你新发现的财富做什么呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你的近期計劃是什麼？你會拿出多少利潤？\n首先花在什麼地方？\n\n我個人會拿出足夠的錢來買房子（不要太貴），然後\n在加密貨幣中保留相當大的一塊。我知道每個人都有不同的計劃\n他們會做什麼，請告訴我! 你是否開始了一個...",
      "title": "你明天醒來，你已經成爲一個加密貨幣百萬富翁。你會用你新發現的財富做什麼呢？"
    }
  ]
}