{
  "author": "OutlandishnessFancy8",
  "original_created_utc": 1635918712,
  "title": "Is it ok to not invite my boyfriend to all of my outings with friends?",
  "created_utc": 1635945182,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First, if you&#39;re wondering why this is on too afraid to ask, I&#39;ve gotten some nasty comments about how i should kill myself on other subreddits for some simple questions like talking about how I don&#39;t want a dog because of PTSD, so I feel more comfortable here. (Throwaway btw)</p>\n\n<p>But anyway on to context. My boyfriend and I have pretty much been spending time almost exclusively with each other since the start of the pandemic with very little time socializing outside the house as his family is local and very high risk. Now that we&#39;re all vaccinated and feeling safer, I&#39;ve been starting to have a much more active social life with my childhood friends who have moved to the area. However, my boyfriend only knows a few people in the area and hasn&#39;t kept in touch, nor is he trying to meet new friends or start a social life. This is likely because he&#39;s very stressed and busy, but he is also quite lonely and craving a circle of friends again.</p>\n\n<p>I&#39;ve been inviting him to some of my plans with my friends, but not all of them. While we&#39;ve had friend groups in common before, my group of childhood friends is kinda more of &quot;my&quot; group. He gets along with them, but he doesn&#39;t quite click with them on a deeper level like I do and is more casual friends with them. Tbh, I&#39;ve been finding it really refreshing to hang out with my friends just as myself rather than as a couple thats glued to the hip and operates as one person, and its nice to not feel like I need to be a buffer for my boyfriend to make sure he&#39;s entertained or finding people to talk to.</p>\n\n<p>I&#39;d like to think that its normal and even healthy to be able to go out and socialize without always having and inviting your SO to everything you do or every group of friends you make, but I&#39;ve also seen a lot of people say the contrary that as a couple, you become a unit and are expected to be invited together to any event or gathering. Is it wrong of me to be hanging out with friends without my boyfriend? Even if they&#39;re not really friends in common and are mostly friends with me?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/qlnysj/is_it_ok_to_not_invite_my_boyfriend_to_all_of_my/",
  "subreddit": "TooAfraidToAsk",
  "id": "qlnysj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "First, if you're wondering why this is on too afraid to ask, I've gotten some\nnasty comments about how i should kill myself on other subreddits for some\nsimple questions like talking about how I don't want a dog because of PTSD, so I\nfeel more comfortable here. (Throwaway btw)\n\nBut anyway on to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず、なぜこれが怖くて聞けないのかというと、いくつかの意地悪なコメントをもらったからです。\n他のサブレディットでは、PTSDで犬を飼わないというような単純な質問に対して、自殺したほうがいいというような嫌なコメントを受けたことがあります。\n他のサブレディットでは、PTSDのために犬を飼いたくないというような簡単な質問に対して、自殺すべきだというような嫌なコメントを受けたことがあります。\nここの方が安心です。(投げやりな言い方ですが)\n\nでも、とにかく...次へ",
      "title": "友達とのお出かけに、彼氏をすべて誘わないのはOK？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，如果你想知道为什么这是一个不敢问的问题，我已经得到了一些\n我在其他子网站上收到了一些关于我应该自杀的讨厌的评论。\n简单的问题，如谈论我如何不想要一只狗，因为PTSD，所以我\n所以我觉得在这里更舒服。(扔掉了）。)\n\n但无论如何，在...",
      "title": "不邀请我的男朋友参加我和朋友的所有外出活动可以吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，如果你想知道爲什麼這是一個不敢問的問題，我已經得到了一些\n我在其他子網站上收到了一些關於我應該自殺的討厭的評論。\n簡單的問題，如談論我如何不想要一隻狗，因爲PTSD，所以我\n所以我覺得在這裏更舒服。(扔掉了）。)\n\n但無論如何，在...",
      "title": "不邀請我的男朋友參加我和朋友的所有外出活動可以嗎？"
    }
  ]
}