{
  "author": "Affectionate_Table61",
  "original_created_utc": 1639578694,
  "title": "Why the fuck are the media calling Caroline Kayll STATUTORILY RAPING an underage boy an \"affair\" or a \"relationship\"?",
  "created_utc": 1639587608,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;More of a rant post but curious about people&amp;#39;s thoughts - this story has put me in an overall wrathful state and it&amp;#39;s hard not to think that perhaps within the next 25 years, I may be telling a son of mine &amp;quot;if ANY teacher of yours&amp;#39; is trying to be more than that, get the hell away from them&amp;quot;:&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m of the opinion it&amp;#39;s absolutely fucking pathetic how the media are insinuating with their headlines that a 15 year old boy is actually capable of willingly being in a legitimate relationship with a 47 year old woman. Give. Me. A. Fucking. Break. God. Damnit! I was 15 five years ago, and let me tell you, I see things very differently to how I did back then. I&amp;#39;m sure that&amp;#39;s the case for virtually anyone (for example, I wasn&amp;#39;t constantly thinking about landing a good career, how I&amp;#39;m going to achieve home ownership, etc., you get the idea). &lt;/p&gt;\n\n&lt;p&gt;Why the fuck does a basic concept known as &amp;quot;regardless of your gender, molesting a minor is wrong&amp;quot; go over these tossers&amp;#39; heads? I could not give a damn in the slightest about notions about women being less harmless: it does not mean that they are not capable of being in a position of authority and taking advantage of that.&lt;/p&gt;\n\n&lt;p&gt;People seem to be focusing on the cage fighter man&amp;#39;s actions. I vehemently disapprove of how the boy got attacked by the old bastard for obvious reasons. However, I genuinely struggle to have sympathy for the wench who got murdered. Can&amp;#39;t help but think she bears some responsibility for the boy having to go through being attacked by a thug - if she simply stuck with professional boundaries, then surely the boy would not have had all this harm coming his way. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll also add: it grinds my gears how it&amp;#39;s common for parents to think they only need to be concerned about their girls being preyed on. Many different things, the way I perceive it, make a teenage boy easy prey precisely because of certain things being pushed as normal.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/TooAfraidToAsk/comments/rh0e26/why_the_fuck_are_the_media_calling_caroline_kayll/",
  "subreddit": "TooAfraidToAsk",
  "id": "rh0e26",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "More of a rant post but curious about people's thoughts - this story has put me\nin an overall wrathful state and it's hard not to think that perhaps within the\nnext 25 years, I may be telling a son of mine \"if ANY teacher of yours' is\ntrying to be more than that, get the hell away from them\":\n\nI'm…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この物語が、私を虜にしました。\n全体的に怒りがこみ上げてきて、もしかしたら、このままでは\n今後25年間、私は自分の息子に「もしお前の教師が\nそれ以上になろうとしているのだから、さっさと離れろ」。\n\n私は...",
      "title": "なぜメディアはキャロライン・ケイルが未成年の少年を強姦したことを「不倫」や「交際」と呼ぶのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "更多的是咆哮的帖子，但对人们的想法感到好奇--这个故事让我陷入了整体的愤怒状态。\n这个故事使我处于整体愤怒的状态，很难不想到，也许在未来的25年内，我可能会成为一个不受欢迎的人。\n未来25年内，我可能会对我的儿子说：\"如果你的任何一个老师想做得更多，请离开这个鬼地方。\n如果你的任何老师想做得更多，请离他们远一点\"。\n\n我是...",
      "title": "为什么媒体把卡洛琳-凯尔在法律上强奸一个未成年男孩称为 \"外遇 \"或 \"关系\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "更多的是咆哮的帖子，但對人們的想法感到好奇--這個故事讓我陷入了整體的憤怒狀態。\n這個故事使我處於整體憤怒的狀態，很難不想到，也許在未來的25年內，我可能會成爲一個不受歡迎的人。\n未來25年內，我可能會對我的兒子說：\"如果你的任何一個老師想做得更多，請離開這個鬼地方。\n如果你的任何老師想做得更多，請離他們遠一點\"。\n\n我是...",
      "title": "爲什麼媒體把卡洛琳-凱爾在法律上強姦一個未成年男孩稱爲 \"外遇 \"或 \"關係\"？"
    }
  ]
}