{
  "author": "1078Garage",
  "original_created_utc": 1627434169,
  "title": "What happened to the Bitcoin investors from 2011? Are any still lurking on this sub like elder gods?",
  "created_utc": 1627450460,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>OK 2011 seems a bit arbitrary, but it&#39;s the low-hanging fruit of being 10 years ago. Going back through the Bitcointalk forums of around that time, I&#39;m struck (as anyone would be) by what would be BTC in the amounts of many millions of dollars today mundanely being presented as trade for real life objects or rewards for online tasks.</p>\n\n<p>The &quot;Class of 2011&quot; don&#39;t owe us and certainly not me as a curious Redditor anything at all; I&#39;m sure many are living quiet and very secure lives, I&#39;m genuinely glad. Nor am I hunting for failure porn, although I know there&#39;s a lot of genuine &quot;None of us knew&quot; stories. We know Pizza Guy but perhaps it&#39;s difficult to fully comprehend how many people don&#39;t possess access to their Bitcoin from that time.</p>\n\n<p>I guess I&#39;m interested in knowing if there&#39;s people who were into BTC back then and perhaps kept some coins but aren&#39;t multi-millionaires still on the sub. I know it can&#39;t be a binary proposition from that time, lambo or rekt, as always with life there&#39;ll be a mid-zone of people&#39;s experience. </p>\n\n<p>Or maybe not? Was BTC sucees then to now more of a zero-sum game than I suspect? I have no idea. As always guys thanks for indulging my curiosity, cheers.</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/oszi0c/what_happened_to_the_bitcoin_investors_from_2011/",
  "subreddit": "CryptoCurrency",
  "id": "oszi0c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "OK 2011 seems a bit arbitrary, but it's the low-hanging fruit of being 10 years\nago. Going back through the Bitcointalk forums of around that time, I'm struck\n(as anyone would be) by what would be BTC in the amounts of many millions of\ndollars today mundanely being presented as trade for real life…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "OK 2011は少し恣意的な感じがしますが、10年前という低空飛行の果実です。\n前です。その頃のBitcointalkのフォーラムを見返してみると、（誰もがそう思うように）何百万ドルものBTCがあることに驚きました。\n(今日では何百万ドルもするBTCが、ありふれた形で紹介されていることに（誰もがそう思うでしょうが）驚きました。\n今日では何百万ドルにもなるBTCが、現実の生活のためのトレードとして平凡に提示されていることに（誰もがそう思うでしょうが）驚かされます。",
      "title": "2011年のビットコイン投資家に何が起こったのか？今でもこのサブサイトに長老神のように潜んでいる人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，2011年似乎有点武断，但它是10年前的低悬果。\n前。回想一下当时的Bitcointalk论坛，我很震惊\n(任何人都会这样)，今天的BTC数额为几百万美元，但却被平凡地呈现在人们面前。\n今天的BTC被当作现实生活中的交易来介绍......",
      "title": "2011年的比特币投资者怎么了？是否还有人像老神仙一样潜伏在这个子上？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，2011年似乎有點武斷，但它是10年前的低懸果。\n前。回想一下當時的Bitcointalk論壇，我很震驚\n(任何人都會這樣)，今天的BTC數額爲幾百萬美元，但卻被平凡地呈現在人們面前。\n今天的BTC被當作現實生活中的交易來介紹......",
      "title": "2011年的比特幣投資者怎麼了？是否還有人像老神仙一樣潛伏在這個子上？"
    }
  ]
}