{
  "author": "Many_Scratch2269",
  "original_created_utc": 1631317085,
  "title": "El Salvador making Bitcoin legal is already having ripple effects. It is bigger than most people think.",
  "created_utc": 1631349826,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just a month after El Salvador announced they were making Bitcoin legal tender, the central bank of my country announced that they will be legalizing Bitcoin since it was now a currency of another country. </p>\n\n<p>What&#39;s more is that now you have Panama, Ukraine, Belarus and a few other countries looking into adopting crypto. A sovereign country making Bitcoin legal tender is huge for global adoption. No matter how small El Salvador is, it still holds the same weight in the UN as let&#39;s say the US in terms of voting power. </p>\n\n<p>Not only that, countries that rely heavily on remittances or have high inflation will be benefiting a lot from Bitcoin. In just 11 years of existence, Bitcoin has already become legal tender of a nation. It just proves that the cryptocurrency community has been right all along.</p>\n</div><!-- SC_ON -->",
  "score": 193,
  "permalink": "/r/CryptoCurrency/comments/plwb5w/el_salvador_making_bitcoin_legal_is_already/",
  "subreddit": "CryptoCurrency",
  "id": "plwb5w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Just a month after El Salvador announced they were making Bitcoin legal tender,\nthe central bank of my country announced that they will be legalizing Bitcoin\nsince it was now a currency of another country.\n\nWhat's more is that now you have Panama, Ukraine, Belarus and a few other\ncountries looking…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "エルサルバドルがビットコインの法定通貨化を発表してからわずか1ヶ月。\n私の国の中央銀行は、ビットコインが他国の通貨となったため、ビットコインを合法化すると発表しました。\n我が国の中央銀行は、ビットコインが他国の通貨となったため、合法化すると発表しました。\n\nさらに言えば、パナマ、ウクライナ、ベラルーシ、その他いくつかの国が\nさらに、パナマ、ウクライナ、ベラルーシなどの国々が...",
      "title": "エルサルバドルがビットコインを合法化したことで、すでに波及効果が出ています。多くの人が思っているよりも大きいのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就在萨尔瓦多宣布他们将比特币作为法定货币的一个月后。\n我国的中央银行宣布，他们将使比特币合法化\n因为它现在是另一个国家的货币。\n\n更重要的是，现在你有巴拿马、乌克兰、白俄罗斯和其他一些\n国家在寻找...",
      "title": "萨尔瓦多将比特币合法化，已经产生了连锁反应。它比大多数人想象的要大。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就在薩爾瓦多宣佈他們將比特幣作爲法定貨幣的一個月後。\n我國的中央銀行宣佈，他們將使比特幣合法化\n因爲它現在是另一個國家的貨幣。\n\n更重要的是，現在你有巴拿馬、烏克蘭、白俄羅斯和其他一些\n國家在尋找...",
      "title": "薩爾瓦多將比特幣合法化，已經產生了連鎖反應。它比大多數人想象的要大。"
    }
  ]
}