{
  "author": "AlwaysHaveCasablanca",
  "the_new_excerpt": "I don't think that anyone expected Casablanca to become as popular as it did-\neven when it was released it did well, but not that well, and maybe it was the\ngreat timing with Operation Torch and the Allies taking Casablanca that led it\nto explode and do so well at the Oscars. It is an excellent…",
  "original_created_utc": 1617293424,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我想没有人想到《卡萨布兰卡》会像它一样受欢迎\n即使上映的时候也做得很好，但并没有那么好，也许是由于\n火炬行动和盟军攻占卡萨布兰卡的绝佳时机，导致了它的发生\n在奥斯卡颁奖典礼上爆发并取得如此好的成绩。这是一部优秀的...",
      "title": "[评论]我很震惊，震惊的是，这部电影里竟然没有犹太人！或者说，《卡萨布兰卡》怎么会是最多、最少犹太人的电影？或者说，《卡萨布兰卡》是有史以来最不像犹太人的电影（我应该知道）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想沒有人想到《卡薩布蘭卡》會像它一樣受歡迎\n即使上映的時候也做得很好，但並沒有那麼好，也許是由於\n火炬行動和盟軍攻佔卡薩布蘭卡的絕佳時機，導致了它的發生\n在奧斯卡頒獎典禮上爆發並取得如此好的成績。這是一部優秀的...",
      "title": "[評論]我很震驚，震驚的是，這部電影裏竟然沒有猶太人！或者說，《卡薩布蘭卡》怎麼會是最多、最少猶太人的電影？或者說，《卡薩布蘭卡》是有史以來最不像猶太人的電影（我應該知道）。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "カサブランカがここまで人気になるとは、誰も予想していなかったのではないでしょうか。\n公開されたときも、うまくいったが、それほどうまくはいかなかった。\nトーチ作戦と連合国軍のカサブランカ奪取という素晴らしいタイミングが、この作品を爆発的にヒットさせた。\nこの映画が爆発的にヒットし、アカデミー賞でも好成績を収めたのは、トーチ作戦と連合軍によるカサブランカ奪取という素晴らしいタイミングがあったからかもしれない。それは、優れた...",
      "title": "レビュー】この映画にユダヤ人が出てこないことに衝撃を受けました。この映画にユダヤ人が出てこないことに衝撃を受けました！あるいは、カサブランカが史上最もユダヤ人の多い映画であり、最もユダヤ人の少ない映画であることにも衝撃を受けました。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "カサブランカがここまで人気になるとは、誰も予想していなかったのではないでしょうか。\n公開されたときも、うまくいったが、それほどうまくはいかなかった。\nトーチ作戦と連合国軍のカサブランカ奪取という素晴らしいタイミングが、この作品を爆発的にヒットさせた。\nこの映画が爆発的にヒットし、アカデミー賞でも好成績を収めたのは、トーチ作戦と連合軍によるカサブランカ奪取という素晴らしいタイミングがあったからかもしれない。それは、優れた...",
      "title": "レビュー】この映画にユダヤ人が出てこないことに衝撃を受けました。この映画にユダヤ人が出てこないことに衝撃を受けました！あるいは、カサブランカが史上最もユダヤ人の多い映画であり、最もユダヤ人の少ない映画であることにも衝撃を受けました。"
    }
  ],
  "title": "[Review] I am shocked, SHOCKED, to find no Jews in this movie! Or, how Casablanca is somehow the most and least Jewish movie ever (and I should know)",
  "created_utc": 1617316924,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t think that anyone expected Casablanca to become as popular as it did- even when it was released it did well, but not <em>that</em> well, and maybe it was the great timing with Operation Torch and the Allies taking Casablanca that led it to explode and do so well at the Oscars. It is an excellent movie, though, but I&#39;m confused about one thing- where are the Jews? </p>\n\n<p>As a Jew who, myself, came to the United States only a year ago in 1942 against all the incredible odds, and after a long and difficult journey which included time in Casablanca, I found the film to be resonant, but it did get some details wrong. A few smaller things, to begin with- a cafe like Rick&#39;s wouldn&#39;t have been in a neighborhood near the airport- the airfield was five miles outside of town- and it would have mostly catered to Europeans, as there wasn&#39;t as much social mixing with native Moroccans as was shown in the film. There were also almost no Americans left in Casablanca once Vichy took it over, as one of the first things the consulate did was help get them (and other Americans throughout Morocco) out of the country, but interestingly enough, the only African-American in Casablanca was in fact named Sam! (He was a night watchman at the consulate, somewhere where I and my fellow refugees spent many a long day waiting in the hopes of getting a visa.) And speaking of visas, while visas signed by General Weygand (then part of the Vichy army) existed, a visa that was signed by General De Gaulle would have been useless or worse. A blank letter of transit or visa from someone like General Weygand, though... that would have been incredible for someone in our situation, and the intrigue surrounding them in the film, as well as the desperation to have them, rang very true. </p>\n\n<p>But what was strange to me was that there were no Jews mentioned in the film. Of course, there were many refugees in Casablanca from all over Europe, but many of them were Jews due to the tremendous persecutions- and now we&#39;re hearing, ever more clearly, the murders- by Hitler&#39;s Germany. Perhaps the characters who seemed most likely to be Jewish were the German-speaking couple at the beginning of the film, practicing their broken English with the waiter. That reminded me greatly of myself. I came from Vienna, originally, and left after the Anschluss to Paris, after I saw and experienced the great humiliations and restrictions heaped upon our community by the invading Nazis. Things were difficult in Paris, but I was able to join a refugee community there- and we were doing well until Paris fell to the Nazis in 1940. Then we were set on a long and difficult trip to Casablanca. I was lucky and was able to take a boat from Marseilles; others had to sneak over the border into Spain, something which was incredibly difficult.</p>\n\n<p>The boat from Marseilles was crowded and filthy, and we had to wait days before we were allowed to disembark- and then we were stuck. At first, we were in an internment camp at Ain Chok, where we were helped greatly by the local Moroccan Jewish community, though they themselves were quite poor. They deserve a great deal of praise for their assistance, especially as they themselves were dealing with antisemitic professional and educational restrictions by Vichy France. One of the most important figures for us was Hélène Cazès-Bénatar, who not only was the first female lawyer in Morocco but was the founder of a refugee aid organization that helped us with registering with the authorities, finding housing (including in the homes of local Jewish families!), and even some financial assistance, and they worked alongside the American consulate in terms of helping us with even such seemingly minor things as selling our jewelry and valuables to reputable dealers rather than scammers. Money was important in Casablanca- if you had enough of it, you could keep up your existence for a while, though you had few opportunities (in fact, the number of refugees working at Rick&#39;s would have been unusual- the authorities preferred that locals be employed, and we needed hard-to-get work permits to get jobs). Still, it was far better to be in that situation than to be stuck in one of the internment camps, which often included labor, such as building railroad tracks. There were thirty of these camps, twelve of which were specifically for Jews (many of the others were Spanish Republicans). </p>\n\n<p>It was incredibly difficult to get a visa out of Casablanca, and in that regard, as I&#39;ve said, the movie got it exactly right. People were desperate. The lines outside the US Consulate were everpresent and they did their best to help people not only get US visas (extremely difficult to do given immigration quotas) but even visas for other countries. People were so desperate that I saw them threatening to commit suicide if they couldn&#39;t get a visa- and I&#39;m told that one man really did slit his throat after being denied. But even for those who could get that coveted visa (a tortuous process), it was difficult enough to get from Casablanca to Lisbon as the first leg of the trip, with some ship captains double- or even triple-booking spots on their boats and extorting women for sex in exchange for passage. It could cost almost twice as much to get a spot on a boat from Casablanca to Lisbon, sleeping on the deck or in a lifeboat, as it did to sail with a berth in a shared cabin and meals from Lisbon to New York. </p>\n\n<p>While things were very difficult for refugees and those who helped us (Hélène Cazès-Bénatar had her organization officially dissolved by the Vichy government and had to continue it on her own, and was nearly interned), there was often sympathy for us among the local police, even as many did what they could to conform and keep their jobs. In fact, Renault is depicted as much less altruistic than his real life counterpart, Maurice Heviot, who was one of Hélène Cazès-Bénatar&#39;s staunchest supporters who worked tirelessly in various ways to undermine the Vichy regime. And, of course, this reminds me of  the scene in which Victor Laszlo led everyone in a chorus of La Marseillaise. It was deeply resonant, though technically speaking it wasn&#39;t illegal to sing it in Vichy France (though it was in occupied France)- however, the lyrics were changed, and it was obligatory to sing a song in honor of General Petain immediately afterward. But indeed, the scene expressed many of the hopes of not only refugees but also many of the French in Morocco. </p>\n\n<p>I was one of relatively few fortunate enough to be able to obtain an exit visa through the consulate and to leave Morocco even before the Allies invaded. I left Casablanca to Lisbon by boat and then sailed to New York, where I arrived just in time to see the new film. And I was confused- where were all the Jews? There were so many of us! And I&#39;ve been told by people here that the people who made the movie were Jewish (the Warner Brothers), the people who wrote the screenplay were Jewish (the Epsteins), and a lot of the actors playing refugees were actually refugees themselves, and mostly even Jewish refugees! It is just so strange to me.</p>\n</div><!-- SC_ON -->",
  "score": 143,
  "permalink": "/r/AskHistorians/comments/mhyn6r/review_i_am_shocked_shocked_to_find_no_jews_in/",
  "subreddit": "AskHistorians",
  "id": "mhyn6r",
  "is_self": true,
  "media": null,
  "is_video": false
}