{
  "author": "Spreizbacken",
  "original_created_utc": 1636115250,
  "title": "This sub feels less like group of investors debating over tech and more like drunk gamblers throwing money on horse races.",
  "created_utc": 1636119238,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s not a rant, Im just really confused how things change so quickly.<br/>\nThere was a time when people here focused more on the King, on the fundamentals, people discussed serious projects, innovations and different use cases of crypto and adoption.<br/>\nPeople used to form their own opinions from reading up on projects, not braindead parroting what they glanced over scrolling through an article or read in a one-liner here.  </p>\n\n<p>Nowadays everybody&#39;s got their focus on that one overhyped coin that&#39;s going to a 100x by the end of the year. Nobody&#39;s even read the whitepaper on it, but hey, so much hype, it&#39;s gotta be the next moonshot!<br/>\nAnd when it &#39;&#39;does a Squid&#39;&#39; newcomers get burned hard and leave the market for good.<br/>\nI get it&#39;s survival of the fittest, but this shilling doesn&#39;t help with Adoption, does it?  </p>\n\n<p>When was the last time you saw a discussion on the King?2-3x by the end of market cycle? Heell no, that&#39;s not enough, we want 10x in a month!<br/>\nNobody is happy with 3-5x in 6 months, people want quick gains over night and that&#39;s it.<br/>\nRight now, stop any pedestrian on the street and ask them if they want 2x on their money in 3 months. About 95% would think that&#39;s too good to be true and in the normal world it is too good to be true.</p>\n\n<p>It really feels like a group of drunks walked in a Vegas casino trying to choose the one winning slot machine out of a thousand slot machines.<br/>\nCrypto does change things, sadly not always in a positive way.</p>\n</div><!-- SC_ON -->",
  "score": 440,
  "permalink": "/r/CryptoCurrency/comments/qna0oh/this_sub_feels_less_like_group_of_investors/",
  "subreddit": "CryptoCurrency",
  "id": "qna0oh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's not a rant, Im just really confused how things change so quickly.\nThere was a time when people here focused more on the King, on the fundamentals,\npeople discussed serious projects, innovations and different use cases of crypto\nand adoption.\nPeople used to form their own opinions from reading…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暴言ではありません。ただ、物事がこんなにも早く変化することにとても困惑しています。\nかつてここでは、人々が王様や基本的なことにもっと集中していた時代がありました。\n重大なプロジェクトや革新的な技術、暗号のさまざまな使用例や採用について議論していました。\nと採用について議論していました。\n人々はかつて、自分の意見を...",
      "title": "このサブは、投資家グループが技術について議論しているというよりも、酔っ払ったギャンブラーが競馬にお金をつぎ込んでいるような感じがします。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这不是一个咆哮，我只是真的很困惑，事情怎么变化得这么快。\n曾几何时，这里的人更关注国王，关注基本面。\n人们讨论严肃的项目、创新和加密货币的不同用例\n和采用。\n人们习惯于从阅读中形成自己的观点。",
      "title": "这个小组感觉不像是一群投资者在辩论技术问题，而更像是喝醉酒的赌徒在赛马上扔钱。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這不是一個咆哮，我只是真的很困惑，事情怎麼變化得這麼快。\n曾幾何時，這裏的人更關注國王，關注基本面。\n人們討論嚴肅的項目、創新和加密貨幣的不同用例\n和採用。\n人們習慣於從閱讀中形成自己的觀點。",
      "title": "這個小組感覺不像是一羣投資者在辯論技術問題，而更像是喝醉酒的賭徒在賽馬上扔錢。"
    }
  ]
}