{
  "author": "Substantial-Review55",
  "the_new_excerpt": "I've spent the last few months learning about investing and the finance world\nand here's my due diligence on Palantir.\n\nhttps://docs.google.com/document/d/1ieh7-xYxn0B_5d7xYB_VfoQC4r5aT8n7B_b6BvmKl6c/edit?usp=sharing\n\nSome key highlights:\n\n\" Future of Palantir\n\nPalantir estimates that the total TAM…",
  "original_created_utc": 1616907887,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的几个月里，我花了几个月的时间来学习投资和金融世界的知识。\n这是我对Palantir的尽职调查。\n\nhttps://docs.google.com/document/d/1ieh7-xYxn0B_5d7xYB_VfoQC4r5aT8n7B_b6BvmKl6c/edit?usp=sharing\n\n一些关键的亮点。\n\n\" Palantir的未来\n\nPalantir估计，TAM的总...",
      "title": "Palantir Technologies (PLTR) DD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的幾個月裏，我花了幾個月的時間來學習投資和金融世界的知識。\n這是我對Palantir的盡職調查。\n\nhttps://docs.google.com/document/d/1ieh7-xYxn0B_5d7xYB_VfoQC4r5aT8n7B_b6BvmKl6c/edit?usp=sharing\n\n一些關鍵的亮點。\n\n\" Palantir的未來\n\nPalantir估計，TAM的總...",
      "title": "Palantir Technologies (PLTR) DD"
    }
  ],
  "title": "Palantir Technologies (PLTR) DD",
  "created_utc": 1616917187,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve spent the last few months learning about investing and the finance world and here&#39;s my due diligence on Palantir.</p>\n\n<p><a href=\"https://docs.google.com/document/d/1ieh7-xYxn0B_5d7xYB_VfoQC4r5aT8n7B_b6BvmKl6c/edit?usp=sharing\">https://docs.google.com/document/d/1ieh7-xYxn0B_5d7xYB_VfoQC4r5aT8n7B_b6BvmKl6c/edit?usp=sharing</a></p>\n\n<p>Some key highlights: </p>\n\n<p>&quot; <strong>Future of Palantir</strong></p>\n\n<p>Palantir estimates that the total TAM in the consulting space is $119 billion with the commercial space worth $56 billion with over 6000 and the government space at $63 billion.  In the commercial space, the TAM is calculated by the total number of customers with 6,000 companies with over $500 million revenue and multiplied by the annual contract size (around $10 million a year). The government sector TAM includes government agencies that align with liberal democracies in which the U.S government accounts for $26 billion and international agencies for $37 billion and the federal and state expenditure.</p>\n\n<p>We expect that in the next 10 years for Palantir to:</p>\n\n<ol>\n<li>Expand their reach (currently 125 customers) more customers in varying spaces and industries, more users, and to continue to innovate with developments in AI and how AI is applied to operations.</li>\n<li>Palantir’s 5 year outlook projects $4 billion in revenue by 2025 and will be creating positive annual cash flows starting in 2022.</li>\n<li>The Covid-19 pandemic has illustrated the potential for Palantir software especially within the healthcare industry,  signing a two-year, $31 million contract with NHS England and assisting the UK Vaccine Program in the ordering, distributing, and tracking of all vaccines through Foundry. Furthermore, during COVID-19, Palantir partnered with hospitals and government organizations to help manage medical supply chains, analyze efficient medical practices, and maximize hospital efficiency in operations.</li>\n<li>By utilizing Palantir, organizations are able to adapt to changing environments and the operating systems for the modern enterprise give insights into decisions into alpha, pathing into a future leader of the data analytics consulting space. </li>\n<li>The building and enabling of the software with connected institutions and companies allows for business software integration along with the vertical integration nature of Palantir’s infrastructure.</li>\n<li>In addition, Palantir’s software creates organic growth and value for companies that allows for individual expansion with individual organizations to accommodate new users, workflows, and can rapidly scale to that of an institution.</li>\n<li>Palantir to become the default operating system for data across the U.S government following the court ruling in <a href=\"https://www.defensenews.com/land/2019/03/29/palantir-who-successfully-sued-the-army-just-won-a-major-army-contract/\">Palantir vs. U.S Army (2016)</a>, where the court ruled that the Army violated the 1994 Federal Acquisition Streamlining Act and that the Army not conducted research into commercial products, Palantir’s Gotham technology, that was more efficient and cheaper than DCGS-A. Palantir was eventually awarded a ten year contract worth over $876 million over competitor Raytheon Technologies. The controversy was brought to Capitol Hill by Rep. (Republican) Duncan Hunter who voiced the desires of thousands of soldiers in the battlefield.</li>\n<li>Become a leader in the commercial consulting space, following the increase in the sales force and spending in marketing which plays a major role in an expanding customer base.</li>\n<li>In both Gotham and Foundry, the “Digital Twin” is effective in upgrading the product such as improving the weapons system and connecting its infrastructure with the company which not only make the company more efficient but better and more competitive. &quot;</li>\n</ol>\n\n<p>*The Content here is purely for educational and entertainment purposes. I am not a financial advisor. Do your own due diligence and research first. </p>\n\n<p>I&#39;m open to any feedback or questions. Thanks!</p>\n</div><!-- SC_ON -->",
  "score": 232,
  "permalink": "/r/investing/comments/meuz0x/palantir_technologies_pltr_dd/",
  "subreddit": "investing",
  "id": "meuz0x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357140060
}