{
  "author": "Reddituser8018",
  "the_new_excerpt": "I decided to get into trading stocks, I am pretty new so I didn't put in\nanything I can't for sure lose.\n\nI put in 2,000 into novavax a few days ago and I have already made 480 dollars!\nI'm not exactly rich, and was using some of the savings I had that didn't really\nmatter if I lost (although it…",
  "original_created_utc": 1612813925,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我决定进入股票交易，我是相当新的，所以我没有把在\n任何东西我都不能肯定失去。\n\n前几天我把2000块钱投到novavax里，已经赚了480块钱了!\n我并不是很有钱，是用我的一些积蓄，并没有真的\n输了也无所谓",
      "title": "谢谢你让我进入交易！"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我決定進入股票交易，我是相當新的，所以我沒有把在\n任何東西我都不能肯定失去。\n\n前幾天我把2000塊錢投到novavax裏，已經賺了480塊錢了!\n我並不是很有錢，是用我的一些積蓄，並沒有真的\n輸了也無所謂",
      "title": "謝謝你讓我進入交易！"
    }
  ],
  "title": "Thanks for getting me into trading!",
  "created_utc": 1612822875,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I decided to get into trading stocks, I am pretty new so I didn&#39;t put in anything I can&#39;t for sure lose.</p>\n\n<p>I put in 2,000 into novavax a few days ago and I have already made 480 dollars! I&#39;m not exactly rich, and was using some of the savings I had that didn&#39;t really matter if I lost (although it would still suck to lose it)</p>\n\n<p>480 dollars is a pretty big amount for me, its more then I get paid in five days of working. I&#39;m not planning on selling anytime soon because I believe in the stock, but man its a good feeling to make even this amount.</p>\n\n<p>Whether I lose it or I don&#39;t I feel like I have found a new hobby and once I become more experienced a way to make some side money and help pay for my retirement.</p>\n\n<p>Anyways I just wanted to say thanks a ton guys, I have been riding a high all day from this and I am a bit disappointed I didn&#39;t get into it sooner.</p>\n</div><!-- SC_ON -->",
  "score": 300,
  "permalink": "/r/stocks/comments/lfk50s/thanks_for_getting_me_into_trading/",
  "subreddit": "stocks",
  "id": "lfk50s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123203789
}