{
  "author": "QuentinTarancheetoh",
  "the_new_excerpt": "LMT Lockheed Martin. if you want guaranteed easy money. Their current fair value\nis $415 and the sit at $350 they pay some of the highest dividends on the market\nas well at 3%. Not to mention Biden will keep dropping bombs and the company is\nessentially the research and development arm of our…",
  "original_created_utc": 1616472183,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "LMT洛克希德-马丁公司，如果你想保证轻松赚钱。他们目前的公平价值\n是415美元，坐庄350美元，他们支付一些市场上最高的股息。\n以及3%。更何况拜登会不断扔炸弹，公司是\n本质上是我们的研发部门...。",
      "title": "一些DD成洛克希德马丁LMT或如何成为战争暴利者。同样的道理也适用于HII和RTX btw。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "LMT洛克希德-馬丁公司，如果你想保證輕鬆賺錢。他們目前的公平價值\n是415美元，坐莊350美元，他們支付一些市場上最高的股息。\n以及3%。更何況拜登會不斷扔炸彈，公司是\n本質上是我們的研發部門...。",
      "title": "一些DD成洛克希德馬丁LMT或如何成爲戰爭暴利者。同樣的道理也適用於HII和RTX btw。"
    }
  ],
  "title": "Some DD into Lockheed Martin LMT or how to become a war profiteer. Much of same applies to HII and RTX btw.",
  "created_utc": 1616505048,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>LMT Lockheed Martin. if you want guaranteed easy money. Their current fair value is $415 and the sit at $350 they pay some of the highest dividends on the market as well at 3%. Not to mention Biden will keep dropping bombs and the company is essentially the research and development arm of our military and the very definition of too big to fail (74% of business is US) not only due to their size but because of the extremely sensitive national security secrets they possess (if aliens are real these are the people reverse engineering their craft). They build the F35 which will bring in 406 billion dollars in sales as well as 1.1 TRILLION dollars in operations and Maintennace. They have embedded options in space which is another trillion dollar market. Oh and they are merging with Aerojet Rocketdyne one of the biggest missile manufacturers. They will make the bombs as well as the planes that drop them. The have not recovered their pre COVID price because they are so fucking big and expensive and had nothing to do with pandemic. Q4 2020 saw record shattering sales across all 4 business sectors (aeronautics +11%, rotary and mission systems +9%, missiles and fire control +11%, space +9%. They shave also substantially reduced debt as well as shares outstanding. Did I mention a 147 billion dollar backlog (up 3B from last year)?</p>\n\n<p>TLDR: this is the very definition of a value play. Buy and hold as much as reasonably possible below $350 ideally, but anywhere below $400 will do. Hold. Hold. Hold. Until the US decides to go a year without increasing the defense budget, the country goes bankrupt, or world peace suddenly breaks out. I&#39;d take this over a savings accnt anyday. </p>\n\n<p>I am not a financial advisor and this is totally not financial advice. The stocks listed in this text are fictional and this post should not be viewed by anyone.</p>\n</div><!-- SC_ON -->",
  "score": 68,
  "permalink": "/r/stocks/comments/mb645c/some_dd_into_lockheed_martin_lmt_or_how_to_become/",
  "subreddit": "stocks",
  "id": "mb645c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752822094
}