{
  "author": "Itstooeasydude",
  "the_new_excerpt": "I’ve been a stock market guy for years. Like most people it’s what I was taught\nand it’s what I knew. Invest in stocks and some day you might be able to retire.\n\nThat all completely changed this past year when most of the world was inevitably\nstuck at home. Now I had heard about Bitcoin but I never…",
  "original_created_utc": 1616679105,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我做了多年的股市人。和大多数人一样，我也是这样被教导的\n而这是我所知道的。投资股票，有朝一日你也许可以退休。\n\n这一切都完全改变了过去的一年 当世界上大多数人都不可避免地是\n卡在家里。现在我听说过比特币，但我从未...",
      "title": "我是个股民。现在我爱上了加密技术。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我做了多年的股市人。和大多數人一樣，我也是這樣被教導的\n而這是我所知道的。投資股票，有朝一日你也許可以退休。\n\n這一切都完全改變了過去的一年 當世界上大多數人都不可避免地是\n卡在家裏。現在我聽說過比特幣，但我從未...",
      "title": "我是個股民。現在我愛上了加密技術。"
    }
  ],
  "title": "I was a stock guy. Now I love crypto.",
  "created_utc": 1616689843,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been a stock market guy for years. Like most people it’s what I was taught and it’s what I knew. Invest in stocks and some day you might be able to retire. </p>\n\n<p>That all completely changed this past year when most of the world was inevitably stuck at home. Now I had heard about Bitcoin but I never really read into it or really even gave it that much thought.</p>\n\n<p>Living alone I had a whole lot of time on my hands and to pass that time I like to get high sometimes. Well one night I decided to toke up and found myself reading some article on cryptocurrency, the technology and uses  surrounding it.</p>\n\n<p>At the time I wasn’t sure if it was the weed making me think this was the coolest thing ever or if the technology actual was this incredible.</p>\n\n<p>Woke up the next day and started reading more and more. Turns out it’s pretty damn incredible. It’s been a few months now and I’m still learning more every day. </p>\n\n<p>To be able to invest in something like this at what looks like it’s beginning stages, something that can truly change the world, I’m in. I’m all in. </p>\n\n<p>I’ll leave my stock portfolios as they are but any money going forward will be invested in projects I like long term. </p>\n\n<p>My goal is to retire by the age of 40, that gives me 9 years to make it happen. </p>\n\n<p>This is all because I decided to smoke one night and stumbled upon a great article. Thanks weed!!</p>\n\n<p>TLDR: Crypto and weed are tight.</p>\n</div><!-- SC_ON -->",
  "score": 1098,
  "permalink": "/r/CryptoCurrency/comments/mcyasb/i_was_a_stock_guy_now_i_love_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "mcyasb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357135573
}