{
  "author": "Berningforchange",
  "the_new_excerpt": "There will be an Annual Shareholder Meeting in June 2021. That's where votes on\ndecisions about GME will happen. It might all go exactly as RC wants. If the\nBoard agrees to decisions then big changes can happen then. If the Board does\nnot agree then the changes Ryan Cohen wants can still happen but…",
  "original_created_utc": 1616586403,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "2021年6月将召开年度股东大会。届时将对\n关于GME的决定将发生。这一切可能会完全按照RC的意愿进行。如果\n董事会同意决定，那么就可以发生大的变化。如果董事会\n不同意，那么瑞恩-科恩想要的变化仍然可以发生，但... ...",
      "title": "莱恩-科恩要改造GameStop，但目前他能做的事情有限。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2021年6月將召開年度股東大會。屆時將對\n關於GME的決定將發生。這一切可能會完全按照RC的意願進行。如果\n董事會同意決定，那麼就可以發生大的變化。如果董事會\n不同意，那麼瑞恩-科恩想要的變化仍然可以發生，但... ...",
      "title": "萊恩-科恩要改造GameStop，但目前他能做的事情有限。"
    }
  ],
  "title": "Ryan Cohen is going to transform GameStop but for now he's limited in what he can do",
  "created_utc": 1616619096,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There will be an Annual Shareholder Meeting in June 2021.  That&#39;s where votes on decisions about GME will happen. It might all go exactly as RC wants. If the Board agrees to decisions then big changes can happen then.  If the Board does not agree then the changes Ryan Cohen wants can still happen but not until after the Standstill period ends which would be around March 1, 2022.</p>\n\n<p><a href=\"https://news.gamestop.com/node/18396/html#a101-gamestopxsettlementag.htm\">Agreement between GameStop and Ryan Cohen - January 11, 2021 8-K </a></p>\n\n<p><strong>Shares</strong></p>\n\n<p>As of January 11, 2021  Ryan Cohen owned 9,001,000 shares, or approximately 12.9% of the Common Stock issued.</p>\n\n<p>This percentage matters because when someone owns 15% of GME then they are an &quot;interested stockholder&quot; and there are burdensome legal requirements and restrictions on activities between the large shareholder and the company. <a href=\"https://news.gamestop.com/node/18396/html#a101-gamestopxsettlementag.htm\">The agreement</a> expands the percentage to 20% without triggering this.  In exchange RC is agreeing to not do a hostile takeover.</p>\n\n<p>Note the difference of 12.9% - 9,001,000 shares and 19.9% shares - ~13,930,000 We don&#39;t know if or when RC will purchase shares up to this limit.</p>\n\n<p><strong>Composition of the Board of Directors</strong></p>\n\n<ul>\n<li><p>The Board temporarily increased from 10 to 13 directors, This created three vacancies filled by Alain (Alan) Attal, Ryan Cohen and James (Jim) Grube.  The terms expire at the 2021 Annual Meeting probably in June 2021</p></li>\n<li><p>Mr. Attal was appointed to the Compensation Committee of the Board, Mr. Cohen was appointed to the Nominating and Corporate Governance Committee of the Board and Mr. Grube was appointed to the Audit Committee of the Board,</p></li>\n<li><p>Current Board members Lizabeth Dunn, Raul Fernandez, James K. Symancyk and Kathy Vrabeck will not stand for reelection at the Annual Meeting.</p></li>\n<li><p>The planned slate of director nominees for the Annual Meeting are: Alan Attal, Ryan Cohen, Paul Evans, Reginald Fils-Aimé, Jim Grube, George Sherman, William Simon, Carrie Teffner, and Kurt Wolf.</p></li>\n<li><p>If a Board member must be replaced during the Standstill Period and RC owns at least 4.0% of the Company’s then-outstanding Common Stock and (y) 2,789,878 shares of Common Stock RC can recommend a person to be on the board (clairfication: to replace RC, Attal, Grube or other Replacement Board members - if needed.  Thanks <a href=\"/u/OG_Kushions\">u/OG_Kushions</a>)</p></li>\n<li><p>Ryan Cohen is not accepting any compensation as a Board member</p></li>\n<li><p>RC cannot seek, alone or in concert with others, representation on the Board, except as specifically permitted</p></li>\n</ul>\n\n<p>From <a href=\"/u/YouAreAPyrate\">u/YouAreAPyrate</a></p>\n\n<ul>\n<li>The Slate of Board Members is not definitive. <a href=\"https://news.gamestop.com/node/18661/html#i3ad65c8584a445ee94e4314f67ce616c_109\">From the 3/23/21 ER</a></li>\n</ul>\n\n<blockquote>\n<p>As of the date of this Form 10-K, the Board has not determined the definitive slate of nominees but currently expects that the following incumbent directors will retire from the Board at the 2021 Annual Meeting: Lizabeth Dunn, Paul Evans, Raul J. Fernandez, Reginald Fils-Aimé, William Simon, James K. Symancyk, Carrie W. Teffner and Kathy P. Vrabeck. The contemplated retirements are not because of a disagreement with us on any matter relating to our operations, policies or practices.  </p>\n</blockquote>\n\n<p><strong>Ryan Cohen agreed to a Standstill Period.</strong></p>\n\n<p>Standstill Provision</p>\n\n<p>From January 11, 2021 until either 30 days before the deadline for the submission of director nominations by stockholders for the Company’s 2022 annual meeting OR 120 days before the first anniversary of the 2021 Annual Meeting whichever is first.  So around March 1, 2022</p>\n\n<p><em>Calculation of time</em> \nIf the meeting is June 1, 2022 and the nominations must be submitted 60 days before that April 1 then the 30 days prior to that would mean March 1, 2022\nor </p>\n\n<p>If the meeting is June 1, 2022 the 120 days before that is March 1.</p>\n\n<p><strong>Limits on what Ryan Cohen can do during the Standstill Period</strong></p>\n\n<p>During the Standstill Period, Ryan Cohen cannot:</p>\n\n<ul>\n<li><p>nominate or recommend for nomination any person for election at any annual or special meeting of the Company’s stockholders or otherwise seek representation on the Board</p></li>\n<li><p>submit, participate in or be the proponent of any proposal for consideration at, or bring any other business before, any annual or special meeting of the Company’s stockholders </p></li>\n<li><p>seek the removal of any member of the Board</p></li>\n<li><p>initiate, encourage or participate in any “vote no,” “withhold” or similar campaign with respect to any annual or special meeting of the Company’s stockholders or encourage anyone to do so.</p></li>\n<li><p>vote against directors nominated by the Board or recommendations of the Board UNLESS both <a href=\"https://www.issgovernance.com/\">Institutional Shareholder Services Inc.</a> and <a href=\"https://www.glasslewis.com/\">Glass Lewis &amp; Co., LLC</a> recommend otherwise, then RC can vote in accordance with the ISS and Glass Lewis recommendations; and RC can vote in its sole discretion as to publicly announced proposals relating to a merger, acquisition, disposition of all or substantially all of the assets of the Company that requires a stockholder vote.</p></li>\n<li><p>Take over or buy out GME  to own or control more than 19.9% of the outstanding shares of Common Stock without prior board approval. He also cannot encourage a third party to join in a merger, tender (or exchange) offer, acquisition, recapitalization, restructuring, disposition, business combination or other extraordinary transaction involving the Company.  </p></li>\n<li><p>If Ryan Cohen buys more than 20.0% or more of the outstanding shares without prior Board approval, he will be an “interested stockholder” of the Company (normally its 15% ) and be subject to restrictions on any business combination for the next three years </p></li>\n<li><p>cannot form a group or solicit proxies to consent or to vote for the election of individuals to the Board or to approve stockholder proposals, or become a “participant” in any contested “solicitation” for the election of directors</p></li>\n<li><p>cannot call a special meeting of Stockholders or make any proposal for consideration by stockholders at any annual or special meeting of stockholders of the Company, </p></li>\n<li><p>make a request for any stockholder list or other Company books and records</p></li>\n</ul>\n\n<p>Of course none of this is financial or legal advice. I can read and had some extra time so I wrote this up. Use it however you wish. And if I got anything wrong, let me know.</p>\n\n<p>edits. formatting/grammar</p>\n</div><!-- SC_ON -->",
  "score": 3440,
  "permalink": "/r/wallstreetbets/comments/mc3o14/ryan_cohen_is_going_to_transform_gamestop_but_for/",
  "subreddit": "wallstreetbets",
  "id": "mc3o14",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752832271
}