{
  "author": "johnnydorko",
  "the_new_excerpt": "I mean let’s be real, someone is selling. And they’re doing it in a way that has\ntaken over 50% of the ATH of most of the crypto market and that is totally cool.\nMy question is this: who is selling and why? Everyone has their endgame. I don’t\ncare if you are HODL, anti-HODL, or anything in between!…",
  "original_created_utc": 1624161057,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "つまり、現実的には誰かが売っているのです。そして、彼らはその方法でそれを行っています。\n暗号市場の大半の ATH の 50% を占めており、それはとても素晴らしいことです。\n私が聞きたいのは、誰が、なぜ売っているのかということです。誰にでも最終目的があります。私は\nあなたがHODLだろうが、アンチHODLだろうが、その中間だろうが気にしません！...。",
      "title": "何でもかんでも買ってしまうのは、私だけでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的意思是，让我们现实一点，有人在卖东西。他们正在做的方式是\n他们以一种方式进行销售，占据了大部分加密货币市场50%以上的资产净值，这完全是很酷。\n我的问题是：谁在卖，为什么？每个人都有自己的最终目标。我不\n我不在乎你是HODL，反HODL，还是介于两者之间的任何东西！...",
      "title": "我是唯一一个买下所有东西的人吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的意思是，讓我們現實一點，有人在賣東西。他們正在做的方式是\n他們以一種方式進行銷售，佔據了大部分加密貨幣市場50%以上的資產淨值，這完全是很酷。\n我的問題是：誰在賣，爲什麼？每個人都有自己的最終目標。我不\n我不在乎你是HODL，反HODL，還是介於兩者之間的任何東西！...",
      "title": "我是唯一一個買下所有東西的人嗎？"
    }
  ],
  "title": "Am I the only one buying the shit out of everything?",
  "created_utc": 1624188638,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I mean let’s be real, someone is selling. And they’re doing it in a way that has taken over 50% of the ATH of most of the crypto market and that is totally cool. My question is this: who is selling and why? Everyone has their endgame. I don’t care if you are HODL, anti-HODL, or anything in between! I’m just curious cause I have been buying since the 2018 crash and for some crazy ass reason I am still buying and haven’t cashed out shit. So tell me your plans and nobody throw shade cause in the end we all want the same thing: OPPORTUNITY!!!!!!</p>\n</div><!-- SC_ON -->",
  "score": 176,
  "permalink": "/r/CryptoCurrency/comments/o3wy5t/am_i_the_only_one_buying_the_shit_out_of/",
  "subreddit": "CryptoCurrency",
  "id": "o3wy5t",
  "is_self": true,
  "media": null,
  "is_video": false
}