{
  "author": "__notanisland__",
  "original_created_utc": 1652061808,
  "title": "Why not have sleepovers as adults?",
  "created_utc": 1652068843,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Remember when you were a kid? How fun sleep overs were? Staying up all night, playing games with your friends? Talking until the sun came up and then falling asleep in the living room mid conversation…At what age did you stop doing that? Why? Why does being an adult have to mean losing fun? Specifically innocent fun? Throwing popcorn at each other and laughing till it hurts.  Playing board games or card games until you can’t keep your eyes open anymore.   &lt;/p&gt;\n\n&lt;p&gt;I don’t have kids so I do recognize that I have more flexibility in my personal life then others but having connections and good relationships with your friends should still be important, no?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 173,
  "permalink": "/r/TooAfraidToAsk/comments/ulgqiu/why_not_have_sleepovers_as_adults/",
  "subreddit": "TooAfraidToAsk",
  "id": "ulgqiu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Remember when you were a kid? How fun sleep overs were? Staying up all night,\nplaying games with your friends? Talking until the sun came up and then falling\nasleep in the living room mid conversation…At what age did you stop doing that?\nWhy? Why does being an adult have to mean losing fun?…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "子供の頃を覚えていますか？お泊りがどんなに楽しかったか？一晩中起きていて\n友達とゲームをしたり 太陽が昇るまでおしゃべりして、おしゃべりの途中でリビングで寝てしまう。\n夜が明けるまでおしゃべりをして、おしゃべりの途中でリビングで寝てしまう......そんなことをしなくなったのは何歳のときですか？\nなぜ？なぜ、大人になると楽しみがなくなるのでしょうか？",
      "title": "大人になってからお泊まり会をしてみてはいかがでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "还记得你还是个孩子的时候吗？过夜是多么有趣？整晚不睡觉。\n和你的朋友玩游戏？聊到太阳升起，然后在客厅里睡着。\n你从什么时候开始不再这样做了？\n为什么？为什么作为一个成年人就意味着失去乐趣？",
      "title": "为什么不作为成年人过夜呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "還記得你還是個孩子的時候嗎？過夜是多麼有趣？整晚不睡覺。\n和你的朋友玩遊戲？聊到太陽昇起，然後在客廳裏睡着。\n你從什麼時候開始不再這樣做了？\n爲什麼？爲什麼作爲一個成年人就意味着失去樂趣？",
      "title": "爲什麼不作爲成年人過夜呢？"
    }
  ]
}