{
  "author": "MrOaiki",
  "original_created_utc": 1640725801,
  "title": "How many American citizens fought on nazi Germany’s side, why and what happened to them?",
  "created_utc": 1640746244,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In the show Band of Brothers when US soldiers are dropped over France, one of the enemy soldiers is an American born young man with perfect American English. He says he moved to Germany because the fatherland called his family and they went.&lt;/p&gt;\n\n&lt;p&gt;How common was this? And what happened to the prisoners of war who were American but fought for the nazis? Were they charged with treason?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/rqpshc/how_many_american_citizens_fought_on_nazi/",
  "subreddit": "AskHistorians",
  "id": "rqpshc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In the show Band of Brothers when US soldiers are dropped over France, one of\nthe enemy soldiers is an American born young man with perfect American English.\nHe says he moved to Germany because the fatherland called his family and they\nwent.\n\nHow common was this? And what happened to the prisoners…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "バンド・オブ・ブラザーズ」の中で、アメリカ兵がフランス上空に降下したとき、その中の一人が\n敵兵はアメリカ生まれの青年で、完璧なアメリカ英語を話す。\n彼は、祖国が家族を呼び寄せたのでドイツに移り住んだという。\nが行った。\n\nこれはどれくらい一般的なことだったのでしょうか。そして、捕虜はどうなったのか...。",
      "title": "ナチス・ドイツ側で戦ったアメリカ国民は何人いたのか、なぜ、そしてどうなったのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在《兄弟连》节目中，当美国士兵在法国上空被投下时，其中一名敌军士兵\n敌方士兵是一个出生在美国的年轻人，有着完美的美国英语。\n他说他搬到了德国，因为祖国召唤他的家人，他们就去了。\n去了。\n\n这有多普遍？俘虏们的情况如何呢？",
      "title": "有多少美国公民在纳粹德国方面作战，为什么，他们的情况如何？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在《兄弟連》節目中，當美國士兵在法國上空被投下時，其中一名敵軍士兵\n敵方士兵是一個出生在美國的年輕人，有着完美的美國英語。\n他說他搬到了德國，因爲祖國召喚他的家人，他們就去了。\n去了。\n\n這有多普遍？俘虜們的情況如何呢？",
      "title": "有多少美國公民在納粹德國方面作戰，爲什麼，他們的情況如何？"
    }
  ]
}