{
  "author": "Low_Cheesecake_1428",
  "original_created_utc": 1636455532,
  "title": "My Japanese grandmother is labeled as white on my mother's birth certificate. Was this a common practice in states with anti-miscegenation laws?",
  "created_utc": 1636514455,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, context: My grandmother and grandfather met in Japan after ww2, got married, eventually moved to USA (Georgia) around 1960 with my uncle, and had several more kids. My mother and all her siblings were born before Loving vs. Virginia (1967) and were raised in Georgia. </p>\n\n<p>I recently looked at my mother&#39;s birth certificate and was dumbfounded they put my grandmother as white, I asked my mother about it and she didn&#39;t know why it said that. I would ask my grandmother about this but, she died a while back.</p>\n\n<p>From google, I found out in GA only white people could marry white people due to the laws at the time. So I assume that&#39;s why they put my grandmother down as white. I tried finding out more about this (were they protected by the War Brides Act (1945),was this illegal or legal- did it depend on the state, etc.) but I was unsuccessful.</p>\n\n<p>So I thought maybe a historian may know something about all this. I don&#39;t know if this was a military protocol, something my grandparents set up on the downlow with a hospital, something else entirely, or if this was just a common thing to do.</p>\n\n<p>Any help with this would be appreciated, thank you for your time.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/qq192b/my_japanese_grandmother_is_labeled_as_white_on_my/",
  "subreddit": "AskHistorians",
  "id": "qq192b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So, context: My grandmother and grandfather met in Japan after ww2, got married,\neventually moved to USA (Georgia) around 1960 with my uncle, and had several\nmore kids. My mother and all her siblings were born before Loving vs. Virginia\n(1967) and were raised in Georgia.\n\nI recently looked at my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "その背景を説明します。私の祖母と祖父は、第二次世界大戦後に日本で出会い、結婚しました。\n最終的には1960年頃に叔父と一緒にアメリカ（ジョージア州）に移住し、何人かの子供を持ちました。\n子供をもうけました。私の母とその兄弟は、Loving vs. Virginia（1967年）の前に生まれ、ジョージア州で育ちました。\n(1967年）の前に生まれ、ジョージア州で育ちました。\n\n私は最近、自分の...",
      "title": "私の日本人の祖母は、母の出生証明書に白人と記載されています。これは二世禁止法のある州では一般的なことだったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，背景。我的祖母和祖父在二战后在日本相遇，结婚。\n最终在1960年左右和我叔叔一起搬到了美国（乔治亚州），并有了几个\n生了几个孩子。我的母亲和她所有的兄弟姐妹都是在 \"洛芬诉弗吉尼亚 \"案之前出生的。\n(1967)之前出生，在乔治亚州长大。\n\n我最近看了我的...",
      "title": "我的日本祖母在我母亲的出生证上被标为白人。这在有反混血法的州是一种常见的做法吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，背景。我的祖母和祖父在二戰後在日本相遇，結婚。\n最終在1960年左右和我叔叔一起搬到了美國（喬治亞州），並有了幾個\n生了幾個孩子。我的母親和她所有的兄弟姐妹都是在 \"洛芬訴弗吉尼亞 \"案之前出生的。\n(1967)之前出生，在喬治亞州長大。\n\n我最近看了我的...",
      "title": "我的日本祖母在我母親的出生證上被標爲白人。這在有反混血法的州是一種常見的做法嗎？"
    }
  ]
}