{
  "author": "whatusernaym",
  "original_created_utc": 1658081456,
  "title": "Please understand what \"1 btc = 1 btc\" really means",
  "created_utc": 1658125949,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Often a bitcoiner will say &amp;quot;1 btc = 1 btc&amp;quot; and then someone, thinking they are clever, will respond with &amp;quot;well 1 usd = 1 usd&amp;quot; - so I&amp;#39;d like to explain the flaw in this response, and I&amp;#39;ll use a simple example to do so.&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s take some constant, like &amp;quot;1 meter.&amp;quot; The &amp;quot;meter&amp;quot; is defined as the length of the path travelled by light in a vacuum during a time interval of 1/299,792,458 of a second.&lt;/p&gt;\n\n&lt;p&gt;Since the speed of light does not change, the length light travels in that time in a vacuum does not change. Therefore, the meter is an unchanging and permanently fixed constant backed by physics and mathematics, i.e. &amp;quot;1 meter = 1 meter.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;If the speed of light were somehow centrally planned and constantly changing (read: inflating), then 1 meter would not be a reliable and we could not measure length effectively. Buildings could not be built and no one would be able to communicate distance. You can substitute the meter with any other mathematical constant to illustrate the same concept.&lt;/p&gt;\n\n&lt;p&gt;Similarly, a &amp;quot;bitcoin&amp;quot; can be defined as a single token out of 21 million. Since the cap cannot change, a bitcoin is also a permanently fixed constant backed by physics and cryptography, i.e. &amp;quot;1 btc = 1 btc.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The same cannot be said of the dollar, as it is one unit out of a forever increasing total, centrally planned supply. This is similar to the speed of light always changing, messing with the &amp;quot;meter&amp;quot; definition and our ability to measure. The changing inconsistency of the dollar leads to distortion in &amp;quot;measurements&amp;quot; (read: prices) that is destructive to society - which bitcoin remedies.&lt;/p&gt;\n\n&lt;p&gt;It is the first constant in the field of economics. The importance of this can hardly be overstated.&lt;/p&gt;\n\n&lt;p&gt;tl;dr: The &amp;quot;1 btc = 1 btc&amp;quot; does NOT mean how much a btc is valued in fiat, nor does it indicate how much a bitcoin can buy, nor is it a tongue-in-cheek tautology. It&amp;#39;s a phrase indicating the fixed, mathematical, physically-tethered nature of bitcoin.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 303,
  "permalink": "/r/Bitcoin/comments/w1di0k/please_understand_what_1_btc_1_btc_really_means/",
  "subreddit": "Bitcoin",
  "id": "w1di0k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Often a bitcoiner will say \"1 btc = 1 btc\" and then someone, thinking they are\nclever, will respond with \"well 1 usd = 1 usd\" - so I'd like to explain the flaw\nin this response, and I'll use a simple example to do so.\n\nLet's take some constant, like \"1 meter.\" The \"meter\" is defined as the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "よく、ビットコイナーが「1btc＝1btc」と言うと、誰かが、自分は賢いと思って、「1btc＝1btc」と答えることがある。\nと言って、「1usd = 1usd」と答える人がいます。\nそこで、この反応の欠点について、簡単な例を使って説明したいと思います。\n\n例えば、\"1m \"のような定数を考えてみましょう。この \"meter \"の定義は...",
      "title": "1btc=1btc」の本当の意味を理解してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "通常一个比特币持有者会说 \"1 BTC = 1 BTC\"，然后有人认为自己很聪明，就会说 \"好吧，1美元 = 1美元\" --\n然后有人自以为聪明，就会回答说 \"好吧，1美元=1美元\" - 所以我想解释一下这个回答的缺陷\n所以我想解释一下这种反应的缺陷，我将用一个简单的例子来解释。\n\n让我们采取一些常数，如 \"1米\"。米 \"被定义为...",
      "title": "请理解 \"1BTC = 1BTC \"的真正含义"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "通常一個比特幣持有者會說 \"1 BTC = 1 BTC\"，然後有人認爲自己很聰明，就會說 \"好吧，1美元 = 1美元\" --\n然後有人自以爲聰明，就會回答說 \"好吧，1美元=1美元\" - 所以我想解釋一下這個回答的缺陷\n所以我想解釋一下這種反應的缺陷，我將用一個簡單的例子來解釋。\n\n讓我們採取一些常數，如 \"1米\"。米 \"被定義爲...",
      "title": "請理解 \"1BTC = 1BTC \"的真正含義"
    }
  ]
}