{
  "author": "drhuehue",
  "original_created_utc": 1652308085,
  "title": "If your coin can go to 0 due to \"an attack\", then that coin is worth 0 to begin with.",
  "created_utc": 1652326647,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Crypto exists in a space that is largely a completely unregulated free market. If your crypto project can be made worthless due to some economic actors performing a free market action, then that coin never had any worth to begin with. Complaining about &amp;quot;attacks&amp;quot; post hoc is a useless activity that tries to absolve the individual of making a bad trade.&lt;/p&gt;\n\n&lt;p&gt;If your algorithmic stablecoin project was so flawed to the point where a bunch of people selling its stablecoin could send the entire LUNA/UST ecosystem to 0, then that coin was so flawed to be worthless from the word go.&lt;/p&gt;\n\n&lt;p&gt;Take responsibility for bad trades and stop trying to absolve yourself of all responsibility by inventing charades and conspiracies about how the man made you broke.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 322,
  "permalink": "/r/CryptoCurrency/comments/unls6e/if_your_coin_can_go_to_0_due_to_an_attack_then/",
  "subreddit": "CryptoCurrency",
  "id": "unls6e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Crypto exists in a space that is largely a completely unregulated free market.\nIf your crypto project can be made worthless due to some economic actors\nperforming a free market action, then that coin never had any worth to begin\nwith. Complaining about \"attacks\" post hoc is a useless activity that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号は、ほとんど完全に無規制の自由市場である空間に存在します。\nもし、あなたの暗号プロジェクトが、ある経済主体の自由市場行動によって無価値になる可能性がある場合\nそのコインにはもともと何の価値もありません。\nということになります。攻撃」に対して事後的に文句を言うことは、無駄な活動です。",
      "title": "もし、あなたのコインが「ある攻撃」によって0になる可能性があるなら、そのコインの価値はそもそも0です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "加密货币存在的空间，基本上是一个完全不受监管的自由市场。\n如果你的加密货币项目由于一些经济行为人的自由市场行为而变得毫无价值\n导致你的加密货币项目变得一文不值，那么这个硬币一开始就没有任何价值。\n价值。抱怨事后的 \"攻击 \"是一种无用的活动，...",
      "title": "如果你的硬币可以因为 \"攻击 \"而变成0，那么这个硬币一开始就值0。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "加密貨幣存在的空間，基本上是一個完全不受監管的自由市場。\n如果你的加密貨幣項目由於一些經濟行爲人的自由市場行爲而變得毫無價值\n導致你的加密貨幣項目變得一文不值，那麼這個硬幣一開始就沒有任何價值。\n價值。抱怨事後的 \"攻擊 \"是一種無用的活動，...",
      "title": "如果你的硬幣可以因爲 \"攻擊 \"而變成0，那麼這個硬幣一開始就值0。"
    }
  ]
}