{
  "author": "Lammiroo",
  "original_created_utc": 1627518297,
  "title": "Do you feel strangely thankful for America?",
  "created_utc": 1627563012,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Aussie here. Of course I can see the grand hypocrisy that the USA is as well as many of the social issues over there.... but is anyone else in the rest of the world thankful they exist?</p>\n\n<p>I mean they saved the vast majority of the Western World in WW2, they provided a counter to the Soviet Union&#39;s power post it, and they&#39;re largely preventing China from taking over Asia Pacific.</p>\n\n<p>As much as it&#39;s easy to criticise America... I&#39;m sitting here thinking I wouldn&#39;t be enjoying the quality of life and freedoms I have if America hadn&#39;t intervened in the past and continue to do so.</p>\n\n<p>Their continued massive military spend keeps the rest of us safe to a certain regard and I feel a little guilty for this view!</p>\n\n<p>I guess thank you to our crazy brothers in the USA for helping us enjoy our quality of life?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/otmnc5/do_you_feel_strangely_thankful_for_america/",
  "subreddit": "TooAfraidToAsk",
  "id": "otmnc5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Aussie here. Of course I can see the grand hypocrisy that the USA is as well as\nmany of the social issues over there.... but is anyone else in the rest of the\nworld thankful they exist?\n\nI mean they saved the vast majority of the Western World in WW2, they provided a\ncounter to the Soviet Union's…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "オージーです。もちろん、私はアメリカの壮大な偽善と、そこでの多くの社会問題を見ることができます。\n.... でも、他の国の人たちは彼らの存在に感謝しているのでしょうか？\n世界の他の地域では、彼らの存在に感謝していますか？\n\nつまり、彼らは第二次世界大戦で西欧諸国の大部分を救い、ソ連に対抗する手段を提供したのです。\nソビエト連邦の...に対抗する手段を提供しました。",
      "title": "妙にアメリカへの感謝の気持ちが湧いてきませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是澳大利亚人。当然，我可以看到美国的巨大虚伪性，以及那里的许多社会问题。\n那里的许多社会问题....，但世界上其他地方的人有谁感谢他们的存在吗？\n世界上还有人感谢他们的存在吗？\n\n我的意思是，他们在二战中拯救了西方世界的绝大多数人，他们为苏联提供了一个\n对抗苏联的......",
      "title": "你是否对美国有一种奇怪的感激之情？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是澳大利亞人。當然，我可以看到美國的巨大虛僞性，以及那裏的許多社會問題。\n那裏的許多社會問題....，但世界上其他地方的人有誰感謝他們的存在嗎？\n世界上還有人感謝他們的存在嗎？\n\n我的意思是，他們在二戰中拯救了西方世界的絕大多數人，他們爲蘇聯提供了一個\n對抗蘇聯的......",
      "title": "你是否對美國有一種奇怪的感激之情？"
    }
  ]
}