{
  "author": "excalilbug",
  "original_created_utc": 1628973600,
  "title": "WARNING! PETA (animal activists organization) is going after Bitcoin!",
  "created_utc": 1628988916,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>PETA (People for Ethical Treatment of Animals) has just issued a statement in which they criticize Bitcoin and demand it to be shut down:</p>\n\n<p>&quot;It has come to our attention that Bitcoin has been massacring bears for weeks. This has to stop! Bears are now on the brink of extinction. We will not tolerate this and we demand Bitcoin to either immediately stop massacring bears or to be shut down&quot;.</p>\n\n<p>The statement was issued by a shirtless member of PETA this afternoon.</p>\n</div><!-- SC_ON -->",
  "score": 315,
  "permalink": "/r/CryptoCurrency/comments/p4foge/warning_peta_animal_activists_organization_is/",
  "subreddit": "CryptoCurrency",
  "id": "p4foge",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "PETA (People for Ethical Treatment of Animals) has just issued a statement in\nwhich they criticize Bitcoin and demand it to be shut down:\n\n\"It has come to our attention that Bitcoin has been massacring bears for weeks.\nThis has to stop! Bears are now on the brink of extinction. We will not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "PETA（動物の倫理的扱いを求める人々の会）が、ビットコインを批判する声明を発表しました。\nビットコインを批判し、その停止を要求しています。\n\n「ビットコインが何週間も熊を虐殺していることがわかりました。\nこれは止めなければなりません。クマは今、絶滅の危機に瀕しています。私たちは...",
      "title": "WARNING! PETA（動物活動家団体）がビットコインを狙っている！？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "PETA (People for Ethical Treatment of Animals)刚刚发表了一份声明。\n他们批评比特币并要求关闭它。\n\n\"我们注意到，比特币已经连续几周在屠杀黑熊了。\n这必须停止! 熊现在正处于灭绝的边缘。我们不会...",
      "title": "警告! PETA（动物活动家组织）要对比特币下手了!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "PETA (People for Ethical Treatment of Animals)剛剛發表了一份聲明。\n他們批評比特幣並要求關閉它。\n\n\"我們注意到，比特幣已經連續幾周在屠殺黑熊了。\n這必須停止! 熊現在正處於滅絕的邊緣。我們不會...",
      "title": "警告! PETA（動物活動家組織）要對比特幣下手了!"
    }
  ]
}