{
  "author": "Min_kast",
  "the_new_excerpt": "Recently I’ve been reading a lot about the terrible side effects hormonal birth\ncontrol can have, physically but especially mentally. It just seems risky. I\nknow my own mother had a bad reaction to it (a different generation of pills,\nbut still).\n\nBut then again I’ve also heard descriptions from cis…",
  "original_created_utc": 1617137902,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "最近我看了很多关于激素生育的可怕副作用的文章\n控制可以有，身体上，但特别是精神上。它只是看起来很危险。I\n知道我自己的母亲对它有不好的反应（不同年代的药丸。\n但还是）。)\n\n不过话说回来，我也听过异性恋者的描述...",
      "title": "我不想给长期男友做避孕措施，却希望他一辈子都用避孕套，这是不是很 \"残忍\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近我看了很多關於激素生育的可怕副作用的文章\n控制可以有，身體上，但特別是精神上。它只是看起來很危險。I\n知道我自己的母親對它有不好的反應（不同年代的藥丸。\n但還是）。)\n\n不過話說回來，我也聽過異性戀者的描述...",
      "title": "我不想給長期男友做避孕措施，卻希望他一輩子都用避孕套，這是不是很 \"殘忍\"？"
    }
  ],
  "title": "Is it “cruel” that I don’t want to get on birth control for a long term boyfriend, and expect him to use condoms for the rest of his life?",
  "created_utc": 1617152836,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Recently I’ve been reading a lot about the terrible side effects hormonal birth control can have, physically but especially mentally. It just seems risky. I know my own mother had a bad reaction to it (a different generation of pills, but still).</p>\n\n<p>But then again I’ve also heard descriptions from cis dudes about sex with condoms vs without them. How it’s just way worse in every imaginable aspect. </p>\n\n<p>And I dunno, I feel bad. My boyfriend has not mentioned it once and he has used only condoms ever since the beginning of his sex life, same as me, so I don’t feel external pressure. We’ve both never tried sex without a condom before, so I mean neither of us know what we’re missing. But internal pressure, yeah.</p>\n</div><!-- SC_ON -->",
  "score": 494,
  "permalink": "/r/TooAfraidToAsk/comments/mgpumu/is_it_cruel_that_i_dont_want_to_get_on_birth/",
  "subreddit": "TooAfraidToAsk",
  "id": "mgpumu",
  "is_self": true,
  "media": null,
  "is_video": false
}