{
  "author": "twin_number_one",
  "original_created_utc": 1642958887,
  "title": "Just before the fall of Constantinople in 1453 \"The dome of the Hagia Sophia was lit up by a strange and mysterious light phenomenon\" is there any historical conclusion on what this was?",
  "created_utc": 1642988455,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The wikapedia page for Constantine XI states that a few days before the city fell a mysterious light phenomenon was observed both by the defending Byzantines and the attacking Ottomans. Can anyone give more details on whether this happened and what it might have been?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/AskHistorians/comments/sayrbi/just_before_the_fall_of_constantinople_in_1453/",
  "subreddit": "AskHistorians",
  "id": "sayrbi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The wikapedia page for Constantine XI states that a few days before the city\nfell a mysterious light phenomenon was observed both by the defending Byzantines\nand the attacking Ottomans. Can anyone give more details on whether this\nhappened and what it might have been?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ウィキペディアのコンスタンティヌス11世のページには、この都市の数日前に、次のように書かれている。\n守っていたビザンチン軍が不思議な光現象を観測した。\nと攻撃してきたオスマントルコの どなたか、このようなことがあったかどうか、詳しく教えてください。\nまた、それは何だったのでしょうか？",
      "title": "1453年のコンスタンティノープル陥落の直前、「アヤソフィアのドームが奇妙で不思議な光現象に照らされた」とありますが、これが何だったのか、歴史的な結論はあるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "关于君士坦丁十一世的维基百科页面指出，在该城陷落的前几天\n防守的拜占庭人和进攻的奥斯曼人都观察到了一种神秘的光现象。\n和进攻的奥斯曼人都观察到了一个神秘的光线现象。谁能提供更多的细节，说明这是否发生过？\n是否发生过以及它可能是什么？",
      "title": "就在1453年君士坦丁堡陷落之前，\"圣索菲亚大教堂的圆顶被一种奇怪而神秘的光线现象照亮\"，关于这一点，是否有任何历史结论？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關於君士坦丁十一世的維基百科頁面指出，在該城陷落的前幾天\n防守的拜占庭人和進攻的奧斯曼人都觀察到了一種神祕的光現象。\n和進攻的奧斯曼人都觀察到了一個神祕的光線現象。誰能提供更多的細節，說明這是否發生過？\n是否發生過以及它可能是什麼？",
      "title": "就在1453年君士坦丁堡陷落之前，\"聖索菲亞大教堂的圓頂被一種奇怪而神祕的光線現象照亮\"，關於這一點，是否有任何歷史結論？"
    }
  ]
}