{
  "author": "Correct-Complex-8769",
  "original_created_utc": 1644132634,
  "title": "Why are children aware of what suicide is?",
  "created_utc": 1644141705,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I always wondered this since hearing kids were committing suicide because they were getting bullied. &lt;/p&gt;\n\n&lt;p&gt;When I was in elementary school (I’m a 30yo woman for reference) and even high school, I would get bullied everyday, I’d get beat up, stuff thrown at me etc. I’d cry myself to sleep most nights.&lt;/p&gt;\n\n&lt;p&gt;But, suicide never crossed my mind because from what I can remember as a child I didn’t even know that was a thing? That you could kill yourself?&lt;/p&gt;\n\n&lt;p&gt;Also I don’t feel like it’s because of the web since I had access to it in those years.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 120,
  "permalink": "/r/TooAfraidToAsk/comments/slr0rk/why_are_children_aware_of_what_suicide_is/",
  "subreddit": "TooAfraidToAsk",
  "id": "slr0rk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So I always wondered this since hearing kids were committing suicide because\nthey were getting bullied.\n\nWhen I was in elementary school (I’m a 30yo woman for reference) and even high\nschool, I would get bullied everyday, I’d get beat up, stuff thrown at me etc.\nI’d cry myself to sleep most…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、子供たちが自殺するのを聞いてから、いつも不思議に思っていたんだ。\nいじめられていたんです。\n\n私が小学生の頃（参考までに30代女性です）、そして高校生の頃も、いじめに遭っていました。\n私は毎日いじめられ、殴られ、物を投げつけられたりしたものです。\n泣き寝入りすることがほとんどでした...。",
      "title": "なぜ、子どもたちは「自殺とは何か」を意識するのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我一直想知道，自从听到孩子们因为被欺负而自杀后\n他们被欺负了。\n\n当我在小学时（我是一个30岁的女人，供参考），甚至在高中时\n我每天都会被欺负，被打，被扔东西等等。\n我大部分时间都是哭着入睡。",
      "title": "为什么儿童会知道什么是自杀？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我一直想知道，自從聽到孩子們因爲被欺負而自殺後\n他們被欺負了。\n\n當我在小學時（我是一個30歲的女人，供參考），甚至在高中時\n我每天都會被欺負，被打，被扔東西等等。\n我大部分時間都是哭着入睡。",
      "title": "爲什麼兒童會知道什麼是自殺？"
    }
  ]
}