{
  "author": "pearlysoames",
  "the_new_excerpt": "When you're reading the page, it has everyone from allies to Iran showing\nsupport, and then this is how the section ends:\n\n\"In September 2001, shortly after the attacks, Greek soccer fans burned\nan Israeli flag and unsuccessfully tried to burn an American flag. Though the\nAmerican flag did not catch…",
  "original_created_utc": 1615190799,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "当你读到这一页的时候，从盟友到伊朗的每个人都在显示。\n支持，然后这一节是这样结束的。\n\n\"2001年9月，在袭击事件发生后不久，希腊足球迷烧毁了\n以色列国旗，并试图烧毁一面美国国旗，但未成功。虽然\n美国国旗没有赶上...",
      "title": "在维基百科关于9/11的页面上，它列出了各种国际反应，其中大部分是支持的呼声。然而，该部分的最后，一些希腊足球迷试图烧毁美国国旗。这是流氓行为，还是当时希腊人对美国的一些更广泛的反感的迹象？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當你讀到這一頁的時候，從盟友到伊朗的每個人都在顯示。\n支持，然後這一節是這樣結束的。\n\n\"2001年9月，在襲擊事件發生後不久，希臘足球迷燒燬了\n以色列國旗，並試圖燒燬一面美國國旗，但未成功。雖然\n美國國旗沒有趕上...",
      "title": "在維基百科關於9/11的頁面上，它列出了各種國際反應，其中大部分是支持的呼聲。然而，該部分的最後，一些希臘足球迷試圖燒燬美國國旗。這是流氓行爲，還是當時希臘人對美國的一些更廣泛的反感的跡象？"
    }
  ],
  "title": "On the Wikipedia page for 9/11 where it lists various international responses, it is mostly an outpouring of support. However the section ends with some Greek soccer fans trying to burn an American flag. Was this hooliganism, or a sign of some broader antipathy toward the US in Greece at the time?",
  "created_utc": 1615246003,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When you&#39;re reading the page, it has everyone from allies to Iran showing support, and then this is how the section ends:</p>\n\n<p>&quot;In September 2001, shortly after the attacks, Greek soccer fans burned an Israeli flag and unsuccessfully tried to burn an American flag. Though the American flag did not catch fire, the fans booed during a moment of silence for victims of the attacks.&quot;</p>\n\n<p>What&#39;s the story here? Or is there a story here?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/m0b0ad/on_the_wikipedia_page_for_911_where_it_lists/",
  "subreddit": "AskHistorians",
  "id": "m0b0ad",
  "is_self": true,
  "media": null,
  "is_video": false
}