{
  "author": "SCWthrowaway1095",
  "original_created_utc": 1637520950,
  "title": "Why makes Endometriosis so hard to diagnose?",
  "created_utc": 1637548894,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>According to Wikipedia, “Women suffering from endometriosis see an average of seven physicians before receiving a correct diagnosis, with an average delay of 6.7 years between the onset of symptoms and surgically-obtained biopsies, the gold standard for diagnosing the condition. This average delay places endometriosis at the extreme end of diagnostic inefficiency.” <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3679489/\">(source)</a> </p>\n\n<p>What makes Endometriosis so hard to diagnose? Is it purely social factors (“periods are supposed to hurt a little, get over it” etc.) or are there other factors involved that complicate diagnosis?</p>\n</div><!-- SC_ON -->",
  "score": 114,
  "permalink": "/r/askscience/comments/qz1ojz/why_makes_endometriosis_so_hard_to_diagnose/",
  "subreddit": "askscience",
  "id": "qz1ojz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "According to Wikipedia, “Women suffering from endometriosis see an average of\nseven physicians before receiving a correct diagnosis, with an average delay of\n6.7 years between the onset of symptoms and surgically-obtained biopsies, the\ngold standard for diagnosing the condition. This average delay…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ウィキペディアによると、「子宮内膜症を患っている女性は、平均して\n正しい診断を受けるまでに、平均で7人の医師の診察を受け、平均で6人の医師の診察を受けることになります。\n症状が出てから、診断の基準となる外科的に採取した生検を受けるまでに平均6.7年かかる。\n症状が出てから、診断の基準となる外科的な生検を受けるまでには、平均6.7年の時間がかかります。この平均的な遅れは...",
      "title": "なぜ子宮内膜症の診断は難しいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "根据维基百科，\"患有子宫内膜异位症的妇女平均要看7个医生才能得到正确的诊断。\n七位医生，才得到正确的诊断，平均延误时间为\n6.7年，从出现症状到通过手术获得活检，这是诊断该疾病的黄金标准。\n诊断这种疾病的黄金标准。这种平均延迟...",
      "title": "为什么子宫内膜异位症如此难以诊断？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據維基百科，\"患有子宮內膜異位症的婦女平均要看7個醫生才能得到正確的診斷。\n七位醫生，纔得到正確的診斷，平均延誤時間爲\n6.7年，從出現症狀到通過手術獲得活檢，這是診斷該疾病的黃金標準。\n診斷這種疾病的黃金標準。這種平均延遲...",
      "title": "爲什麼子宮內膜異位症如此難以診斷？"
    }
  ]
}