{
  "author": "King_Vercingetorix",
  "original_created_utc": 1627651539,
  "title": "A popular perception of Baby Boomers is that they suddenly went from being socially liberal 'hippies' to Reagan supporters. How true or accurate is this perception?",
  "created_utc": 1627669854,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After all, despite occupying a prominent place in American history books talking about the 1920s, flappers were not a majority. Was this the case with hippies as well? Were most Baby Boomers who voted for Reagan in 1980, already socially conservative to begin with? How much did this differ by race and income?</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/oukjw3/a_popular_perception_of_baby_boomers_is_that_they/",
  "subreddit": "AskHistorians",
  "id": "oukjw3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "After all, despite occupying a prominent place in American history books talking\nabout the 1920s, flappers were not a majority. Was this the case with hippies as\nwell? Were most Baby Boomers who voted for Reagan in 1980, already socially\nconservative to begin with? How much did this differ by race…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "結局のところ、1920年代を語るアメリカの歴史書では重要な位置を占めているにもかかわらず\n1920年代を語るアメリカの歴史書の中でも、フラッパーは多数派ではありませんでした。ヒッピーもそうなのか？\nヒッピーもそうなのか？1980年にレーガンに投票したベビーブーマーは、もともと社会的に保守的な人が多かったのでしょうか。\n1980年にレーガンに投票したベビーブーマーの多くは、もともと社会的に保守的だったのでしょうか？人種による違いはどのくらいあったのでしょうか...。",
      "title": "ベビーブーマーに対する一般的なイメージは、社会的にリベラルな「ヒッピー」から突然レーガン支持者になったというものです。この認識はどの程度正しいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "毕竟，尽管在谈论1920年代的美国历史书中占据了重要位置\n谈到20世纪20年代，耀武扬威的人并不占多数。嬉皮士的情况也是如此吗？\n也是如此吗？1980年投票给里根的大多数婴儿潮时期的人，是否已经在社会上\n保守派？这在种族上有多大差异？",
      "title": "对婴儿潮一代的一个流行看法是，他们突然从社会自由主义的 \"嬉皮士 \"变成了里根的支持者。这种看法的真实性或准确性如何？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "畢竟，儘管在談論1920年代的美國曆史書中佔據了重要位置\n談到20世紀20年代，耀武揚威的人並不佔多數。嬉皮士的情況也是如此嗎？\n也是如此嗎？1980年投票給里根的大多數嬰兒潮時期的人，是否已經在社會上\n保守派？這在種族上有多大差異？",
      "title": "對嬰兒潮一代的一個流行看法是，他們突然從社會自由主義的 \"嬉皮士 \"變成了里根的支持者。這種看法的真實性或準確性如何？"
    }
  ]
}