{
  "author": "nugnugs",
  "the_new_excerpt": "Hi guys,\n\nI have about 70k invested right now in various stocks. Some are winning, some\nare losing. About 20k of those are long term, and the rest are still under short\nterm capital gains.\n\nI'm about to sell some stocks to pay for a down payment on a home. I'd probably\nneed to liquidate about 30k.…",
  "original_created_utc": 1623016053,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n私は今、約7万円を様々な銘柄に投資しています。勝っているものもあれば、負けているものも\n負けています。そのうち約2万円は長期投資で、残りはまだ短期のキャピタルゲインです。\nキャピタルゲインを得ています。\n\n家の頭金を払うために、いくつかの株を売ろうとしています。私はおそらく\n約30,000円を清算する必要があります....",
      "title": "ポートフォリオの一部をどのようにリクイデーションすべきか"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n我现在有大约7万投资在各种股票上。有些是赢的，有些\n正在亏损。其中大约2万是长期投资，其余的仍是短期资本收益。\n短期资本收益。\n\n我准备卖掉一些股票来支付房屋的首付款。我可能\n需要变现约3万....",
      "title": "我应该如何清算我的投资组合中的一部分"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n我現在有大約7萬投資在各種股票上。有些是贏的，有些\n正在虧損。其中大約2萬是長期投資，其餘的仍是短期資本收益。\n短期資本收益。\n\n我準備賣掉一些股票來支付房屋的首付款。我可能\n需要變現約3萬....",
      "title": "我應該如何清算我的投資組合中的一部分"
    }
  ],
  "title": "How should I liquidate a part of my portfolio",
  "created_utc": 1623046978,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi guys,</p>\n\n<p>I have about 70k invested right now in various stocks. Some are winning, some are losing. About 20k of those are long term, and the rest are still under short term capital gains.</p>\n\n<p>I&#39;m about to sell some stocks to pay for a down payment on a home. I&#39;d probably need to liquidate about 30k. I&#39;m wondering if there are any rule of thumbs to consider.</p>\n\n<p>Which of these make sense?</p>\n\n<ol>\n<li>Prioritize selling the stocks that are currently losing so I can take advantage of tax write offs.</li>\n<li>Prioritize selling the stocks that won big, because I can say I made a profit on those investments.</li>\n<li>Prioritize selling the stocks that I think don&#39;t have much growth in the future, to maximize the returns of my existing portfolio.</li>\n<li>If selling at a loss, prioritize the short term stocks first. If selling at a gain, prioritize the long term stocks first.</li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 66,
  "permalink": "/r/stocks/comments/ntwjge/how_should_i_liquidate_a_part_of_my_portfolio/",
  "subreddit": "stocks",
  "id": "ntwjge",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404886634
}