{
  "author": "LetsGoToTheMars",
  "original_created_utc": 1631599140,
  "title": "My boss makes a dollar, I make a dime that's why I buy cryptos on company time",
  "created_utc": 1631616132,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Fuck the system.</p>\n\n<p>Woking 9 to 5 sucks but if you get a low profile job that gives you enough time to trade cryptos during office hours, you are on a winner!</p>\n\n<p>I don&#39;t want a &#39;rewarding career&#39; that asks me to be available 24/7 and sacrifice my private time for work only to earn some more money (been there, done that). I want freedom of all that shit, maybe work part time just for fun and beer money but that&#39;s it. </p>\n\n<p>Mid to long term plan, early retirement somewhere at the beach living a relaxed life. </p>\n\n<p>Cryptos will help me to get that freedom! Staking rewards are awesome and will help me to keep building up wealth.</p>\n\n<p>Let&#39;s go!</p>\n</div><!-- SC_ON -->",
  "score": 205,
  "permalink": "/r/CryptoCurrency/comments/pnx0ci/my_boss_makes_a_dollar_i_make_a_dime_thats_why_i/",
  "subreddit": "CryptoCurrency",
  "id": "pnx0ci",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Fuck the system.\n\nWoking 9 to 5 sucks but if you get a low profile job that gives you enough time\nto trade cryptos during office hours, you are on a winner!\n\nI don't want a 'rewarding career' that asks me to be available 24/7 and\nsacrifice my private time for work only to earn some more money (been…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "制度なんてどうでもいい。\n\n9時から5時までの仕事は最悪だが、目立たない仕事に就いて、勤務時間中にクリプトを取引する十分な時間を得られれば\nクリプトをトレードする時間を得られるような目立たない仕事に就けたら、あなたは勝ち組だよ\n\n私は、24時間365日対応し、プライベートな時間を仕事のために犠牲にすることを求めるような「やりがいのある仕事」はしたくない。\n仕事のためにプライベートな時間を犠牲にして、さらにお金を稼ぐことを求められるような「やりがいのある仕事」はしたくないんだ（これまでは...）。",
      "title": "上司は1ドル、私は10セント、だから会社の時間にクリプトを買うんだ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "去他妈的制度。\n\n朝九晚五的工作很糟糕，但如果你找到一份低调的工作，让你有足够的时间\n在办公时间内进行加密货币交易，你就是赢家了\n\n我不想要一个 \"有价值的职业\"，要求我24小时不间断地工作，并为工作牺牲我的私人时间。\n牺牲我的私人时间来工作，只是为了赚更多的钱（已经...",
      "title": "我的老板赚一美元，我赚一毛钱，这就是为什么我在公司时间购买加密货币的原因。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "去他媽的制度。\n\n朝九晚五的工作很糟糕，但如果你找到一份低調的工作，讓你有足夠的時間\n在辦公時間內進行加密貨幣交易，你就是贏家了\n\n我不想要一個 \"有價值的職業\"，要求我24小時不間斷地工作，併爲工作犧牲我的私人時間。\n犧牲我的私人時間來工作，只是爲了賺更多的錢（已經...",
      "title": "我的老闆賺一美元，我賺一毛錢，這就是爲什麼我在公司時間購買加密貨幣的原因。"
    }
  ]
}