{
  "author": "MugShadow",
  "original_created_utc": 1625227287,
  "title": "Just took all my Crypto out of Robinhood. Best decision I’ve ever made.",
  "created_utc": 1625236236,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When I first got into crypto trading and investing back in January, I used RH for its simplicity and Economics (free). It wasn’t until I had several thousand $ worth of crypto in it when I learned of its crummy business practices and the fact I don’t actually own the crypto. The problem I faced was that the only way to get it out was to liquidate it into USD, and transfer it to my bank, and rebuy the crypto on an exchange. I knew this process would take up to 6 business days. I was worried that in that time crypto would spike and I would lose potential gains. But I said screw it and did it anyway. Now I’m reinvested and have my ETH and BTC on Coinbase and I couldn’t be more relieved.</p>\n</div><!-- SC_ON -->",
  "score": 210,
  "permalink": "/r/CryptoCurrency/comments/oc8mjk/just_took_all_my_crypto_out_of_robinhood_best/",
  "subreddit": "CryptoCurrency",
  "id": "oc8mjk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "When I first got into crypto trading and investing back in January, I used RH\nfor its simplicity and Economics (free). It wasn’t until I had several thousand\n$ worth of crypto in it when I learned of its crummy business practices and the\nfact I don’t actually own the crypto. The problem I faced was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が1月に初めて暗号取引と投資を始めたとき、私はRH\nを使っていましたが、そのシンプルさと経済性（無料）から 数千ドル分の暗号が入っていた時に、その粗悪なビジネス慣行と\n数千ドル分の暗号が入っていたときに、その粗悪なビジネス慣行と\n実際には暗号を所有していないという事実を知ったのは、数千ドル相当の暗号を入れてからでした。私が直面した問題は...",
      "title": "ロビンフッドからすべての暗号を取り出しました。今までで最高の決断でした。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我在一月份第一次接触加密货币交易和投资时，我使用RH\n因为它的简单性和经济性（免费）。直到我有了几千\n价值几千美元的加密货币的时候，我才知道它糟糕的商业行为和\n事实上，我并不真正拥有这些加密货币。我面临的问题是...",
      "title": "刚刚把我的所有加密货币从Robinhood中取出。这是我做过的最好的决定。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我在一月份第一次接觸加密貨幣交易和投資時，我使用RH\n因爲它的簡單性和經濟性（免費）。直到我有了幾千\n價值幾千美元的加密貨幣的時候，我才知道它糟糕的商業行爲和\n事實上，我並不真正擁有這些加密貨幣。我面臨的問題是...",
      "title": "剛剛把我的所有加密貨幣從Robinhood中取出。這是我做過的最好的決定。"
    }
  ]
}