{
  "author": "Ass-Kickin_Chicken",
  "original_created_utc": 1637769732,
  "title": "The whole \"Cryptocurrency mining is bad for the environment\" is just one of many giant gaslighting techniques by the government to blame the average Joe for being detrimental to the environment rather than mega corporations and their factories.",
  "created_utc": 1637778644,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You always here about how corporations and the media condescendingly lecture about how we&#39;re supposed to change our lifestyles in order to be greener all while they continue to spew toxic waste materials from their factories and manufacturing plants. What adds to the hypocrisy is that all these &quot;environmentally progressive&quot; leaders use their private jets to go to environment summits to barely pay attention to what&#39;s going on. Also, add to that the active fear-mongering towards nuclear energy, one of the greenest energy sources known to man, and twisting it into a nuclear apocalypse ticking time bomb.</p>\n\n<p>But let&#39;s talk about mining, how it&#39;s detrimental to the environment. No, I&#39;m not talking about cryptocurrency mining, I&#39;m talking about coal mining, which, long before the birth of Cryptocurrency, has been the black stain of the environment and contributed to climate change before crypto mining even existed. What&#39;s worse is that these mining companies use cheap labor in third world countries to mine for coal, which is one of the most dangerous and health hazardous jobs in the world, all for the sake of being as profitable as possible.</p>\n\n<p>All this is happening, yet these pretentious fucks want to lecture us cryptocurrency miners about how we&#39;re a bane to the environment? FUCK off. It wasn&#39;t my fault that oil and natural gas was used as the main power source of nations years before I was born. Countries had to literally invade and destroy nations and other peoples&#39; lives for oil, yet the same politicians want to point their fingers on miners.</p>\n\n<p>You fucks wanna talk about the environment? Change your main power sources to green energy, and then we&#39;ll talk. But for now, I&#39;m just gonna sit back and mute your voices over the sound of my 80 decibel miner.</p>\n\n<p>Edit: Removed a word</p>\n\n<p>Edit 2: I&#39;m seeing numerous replies about Whataboutism. Your very own homes, with your plugged in electronics and appliances, are consuming a lot of energy (even when these electronics and appliances are not in use). These glamorous Christmas lights that people put up from November until Valentine&#39;s day, huge energy consumers. Main point is that as long as nations are using energy sources that generate pollution and greenhouse gases, every single necessity that we use (lights, cars, houses, computers) will negatively impact the environment.\nIn addition to that, and this specifically applies to Americans, I keep hearing about HOAs that prohibit homeowners from installing solar roof panels on their homes just because they look ugly or ruin the aesthetics, and add to that people not liking wind turbines because they either look hideous or kill birds, or nuclear energy because people think that another Chernobyl is bound to happen. As long as this mentality is prevalent, expect nothing to change.</p>\n</div><!-- SC_ON -->",
  "score": 187,
  "permalink": "/r/CryptoCurrency/comments/r18gnb/the_whole_cryptocurrency_mining_is_bad_for_the/",
  "subreddit": "CryptoCurrency",
  "id": "r18gnb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "You always here about how corporations and the media condescendingly lecture\nabout how we're supposed to change our lifestyles in order to be greener all\nwhile they continue to spew toxic waste materials from their factories and\nmanufacturing plants. What adds to the hypocrisy is that all…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あなたはいつも、企業やメディアが、環境に配慮してライフスタイルを変えるべきだと、恩着せがましく説いていることを知っています。\n環境に配慮してライフスタイルを変えるべきだと説いています。\nその一方で、企業やメディアは工場や製造所から有毒な廃棄物を排出し続けています。\n工場や製造所から有毒な廃棄物を排出し続けています。さらに偽善的であるのは、すべての...",
      "title": "暗号通貨の採掘は環境に悪い」というのは、メガ企業やその工場ではなく、一般のジョーが環境に悪影響を与えていることを非難するための、政府による巨大なガスライティング技術のひとつに過ぎません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你总是听到公司和媒体如何居高临下地说教\n关于我们应该如何改变我们的生活方式，以便更环保\n而他们却继续从他们的工厂和制造厂喷出有毒的废料。\n制造厂的有毒废料。更加虚伪的是，所有的人都在为自己的行为负责。",
      "title": "整个 \"加密货币挖矿对环境有害 \"只是政府众多巨大的气化技术之一，它指责普通人对环境有害，而不是指责大型企业和他们的工厂。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你總是聽到公司和媒體如何居高臨下地說教\n關於我們應該如何改變我們的生活方式，以便更環保\n而他們卻繼續從他們的工廠和製造廠噴出有毒的廢料。\n製造廠的有毒廢料。更加虛僞的是，所有的人都在爲自己的行爲負責。",
      "title": "整個 \"加密貨幣挖礦對環境有害 \"只是政府衆多巨大的氣化技術之一，它指責普通人對環境有害，而不是指責大型企業和他們的工廠。"
    }
  ]
}