{
  "author": "MeepFromPhineasFerb",
  "original_created_utc": 1630632625,
  "title": "How the hell is Krispy Kreme making a profit???",
  "created_utc": 1630660916,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Okay, so first Krispy Kreme gives out free donuts to vaccinated people, which I personally think is pretty cool. But instead of making this a one-time deal for a week like some shitty virtue-signalling to get the medias attention, they have this last for over FIVE MONTHS and counting. Okay, really cool! But NOW they&#39;re giving away TWO FREE DONUTS to the vaccinated. How are they doing all of this without crashing their business? I ate there once when I was eleven, and now I go there every day to get the free donuts and nothing else, and I can&#39;t be the only one like that. At first I thought this was started as a drug-dealer-esque &quot;first hit&#39;s free&quot; but I&#39;ve gotten more than enough hits to let me know that Krispy Kreme donuts taste good. How are they not bankrupt?</p>\n\n<p>Sorry if the language I used made this sound like a rant. I&#39;m not angry, I&#39;m genuinely confused.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/pgv88e/how_the_hell_is_krispy_kreme_making_a_profit/",
  "subreddit": "NoStupidQuestions",
  "id": "pgv88e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Okay, so first Krispy Kreme gives out free donuts to vaccinated people, which I\npersonally think is pretty cool. But instead of making this a one-time deal for\na week like some shitty virtue-signalling to get the medias attention, they have\nthis last for over FIVE MONTHS and counting. Okay, really…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、まずクリスピークリームは、ワクチンを接種した人に無料でドーナツを配っています。\n個人的にはとても素晴らしいことだと思っています。しかし、これを1回限りの取引にするのではなく\nしかし、メディアの注目を集めるための美徳主義のような1週間の一回限りの取引ではなく、彼らはこれを5ヶ月以上続けています。\nこれを5ヶ月以上も続けています。さて、本当に...。",
      "title": "クリスピークリームは一体どうやって利益を出しているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，首先，Krispy Kreme向接种疫苗的人免费发放甜甜圈，我个人认为这很酷。\n我个人认为这是非常酷的。但不是像某些国家那样，在一周内进行一次性交易。\n但他们并没有像一些低劣的美德信号一样，在一周内进行一次性交易，以引起媒体的注意。\n这将持续超过五个月，而且还在继续。好吧，真的...",
      "title": "Krispy Kreme到底是如何盈利的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，首先，Krispy Kreme向接種疫苗的人免費發放甜甜圈，我個人認爲這很酷。\n我個人認爲這是非常酷的。但不是像某些國家那樣，在一週內進行一次性交易。\n但他們並沒有像一些低劣的美德信號一樣，在一週內進行一次性交易，以引起媒體的注意。\n這將持續超過五個月，而且還在繼續。好吧，真的...",
      "title": "Krispy Kreme到底是如何盈利的？"
    }
  ]
}