{
  "author": "Lekantekue",
  "original_created_utc": 1649242061,
  "title": "Ticketmaster is scum. I hope they get destroyed by blockchain tech",
  "created_utc": 1649248798,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;After missing out on concerts for 2 years due to COVID-restrictions. I was recently reminded again why Ticketmaster is one of the most hated company in the world. I wish them a quick bankruptcy. I bought tickets for a concert and the tickets fees were more than 75% of the original ticket price. Which is absurd. &lt;/p&gt;\n\n&lt;p&gt;The internet is full of people complaining about Ticketmaster and their fees. For instance this hilariours woman:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Why are Badbunny tickets so expensive? Y’all making me want to sell pictures of my husbands feet on only fans – frustrated Ticketmaster customer&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.tiktok.com/@_j_e_n_n_/video/6950782961763601670?is_copy_url=1&amp;amp;is_from_webapp=v1\"&gt;https://www.tiktok.com/@_j_e_n_n_/video/6950782961763601670?is_copy_url=1&amp;amp;is_from_webapp=v1&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;In the “Last Week Tonight” show, John Oliver explained the shady behavior of Ticketmaster in an entertaining way, including clips of frustrated Ticketmaster customers (like the one above). &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;A short recap:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;- Average prices of tickets have more than tripled, since the 1990s (even before tickets hit the resale market)&lt;/p&gt;\n\n&lt;p&gt;- Ticket fees are determined in collaboration with Ticketmaster’s clients (Venues, Promoters, sometimes the artists)&lt;/p&gt;\n\n&lt;p&gt;- These other parties that share in the tickets fees are mostly owned by… Ticketmaster&lt;/p&gt;\n\n&lt;p&gt;- Ticketmaster facilitates professional scalpers and multiple account use&lt;/p&gt;\n\n&lt;p&gt;- In some cases less than 8% of all tickets for shows of major artists gets sold directly to the public. Where do the rest of the tickets go? To professional ticket scalpers&lt;/p&gt;\n\n&lt;p&gt;- Professional scalpers represent the overwhelming majority of sellers on secondary market places&lt;/p&gt;\n\n&lt;p&gt;- Scalpers mark-up the price  on average with 49%, but sometimes even hike up the price more than 10x&lt;/p&gt;\n\n&lt;p&gt;- Secondary markets charge exorbitant fees&lt;/p&gt;\n\n&lt;p&gt;The result of this is that the ticketing industry is very inefficient. Parties that do not create any value for fans and artists receive a big cut of the revenue &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=-_Y7uqqEFnY\"&gt;https://www.youtube.com/watch?v=-_Y7uqqEFnY&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;How can blockchain technology improve the ticketing industry?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;- Blockchains are transparent and immutable. Scammy practices such as direct selling on secondary markets or selling huge amounts of tickets to professional scalpers will be visible to fans&lt;/p&gt;\n\n&lt;p&gt;- Smart contracts can be programmed with a maximum resale price or maximum mark-up from the original price &lt;/p&gt;\n\n&lt;p&gt;- Blockchain cut out the middle men allowing artist to sell more directly to fans&lt;/p&gt;\n\n&lt;p&gt;- Tickets can include a royalty fee for artists, when tickets are sold resold (similar to royalty fees on NFT art). &lt;/p&gt;\n\n&lt;p&gt;- NFT tickets become tradeable digital collectibles, allowing artists to interact with their fans even after the event&lt;/p&gt;\n\n&lt;p&gt;R.I.P. Ticketsmaster. I hope we will soon be able to buy tickets for our favourite artists without ridiculous ticket fees.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 733,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/NL7kIwd8CeR-zZcwUliZBaofmEapFQNaYK0lr9ZZ1sw.jpg?auto=webp&amp;s=3aa05975421859b7125f3b2917f6c997620071cc",
          "width": 540,
          "height": 1014
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/NL7kIwd8CeR-zZcwUliZBaofmEapFQNaYK0lr9ZZ1sw.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=26f5a72413db79ed750cf7043a15bd5c88b8eefb",
            "width": 108,
            "height": 202
          },
          {
            "url": "https://external-preview.redd.it/NL7kIwd8CeR-zZcwUliZBaofmEapFQNaYK0lr9ZZ1sw.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=5cc30c115b198f73fd66b7d19cf339e523e404f3",
            "width": 216,
            "height": 405
          },
          {
            "url": "https://external-preview.redd.it/NL7kIwd8CeR-zZcwUliZBaofmEapFQNaYK0lr9ZZ1sw.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=52f82fd67766773294473946849033e81da984e0",
            "width": 320,
            "height": 600
          }
        ],
        "variants": {},
        "id": "tD2lL1BVoQZ31kwlxPzEw9zINMTD3kEtGPrhoe9XecU"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/txjbsr/ticketmaster_is_scum_i_hope_they_get_destroyed_by/",
  "subreddit": "CryptoCurrency",
  "id": "txjbsr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "After missing out on concerts for 2 years due to COVID-restrictions. I was\nrecently reminded again why Ticketmaster is one of the most hated company in the\nworld. I wish them a quick bankruptcy. I bought tickets for a concert and the\ntickets fees were more than 75% of the original ticket price.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "COVID制限で2年間コンサートに行けなかったので。私は\nチケットマスターがなぜ最も嫌われている会社の一つなのか、最近改めて思い知らされました。\n世界。早く倒産してほしい。コンサートのチケットを購入したら\nチケットの手数料が元のチケット価格の75％以上だった...。",
      "title": "チケットマスターはクズ ブロックチェーン技術で滅びればいいのに"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在由于COVID-限制而错过了两年的音乐会之后。我\n最近再次提醒我为什么Ticketmaster是世界上最令人讨厌的公司之一。\n世界上最讨厌的公司之一。我希望他们能尽快破产。我买了一场音乐会的票，但\n门票费超过了原票价的75%....",
      "title": "Ticketmaster是人渣。我希望他们被区块链技术摧毁。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在由於COVID-限制而錯過了兩年的音樂會之後。我\n最近再次提醒我爲什麼Ticketmaster是世界上最令人討厭的公司之一。\n世界上最討厭的公司之一。我希望他們能儘快破產。我買了一場音樂會的票，但\n門票費超過了原票價的75%....",
      "title": "Ticketmaster是人渣。我希望他們被區塊鏈技術摧毀。"
    }
  ]
}