{
  "author": "chemistrynerd1994",
  "original_created_utc": 1640370850,
  "title": "How can the US govt place so much importance on its military, and at the same time allows a high percentage of its veteran population to be homeless? Isn't that contradictory?",
  "created_utc": 1640385170,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Join the military of the greatest military power in the world, you will probably end up homeless afterwards!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;How does this even make sense? Shouldn&amp;#39;t a nation, which puts so much emphasis on the might of its military, be pouring billions into ensuring that none of its military vets end up like that?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 130,
  "permalink": "/r/NoStupidQuestions/comments/rns272/how_can_the_us_govt_place_so_much_importance_on/",
  "subreddit": "NoStupidQuestions",
  "id": "rns272",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "\"Join the military of the greatest military power in the world, you will\nprobably end up homeless afterwards!\"\n\nHow does this even make sense? Shouldn't a nation, which puts so much emphasis\non the might of its military, be pouring billions into ensuring that none of its\nmilitary vets end up like…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"世界一の軍事大国の軍隊に入れば、あなたは\nその後ホームレスになるかもしれない！\"\n\nこれってどうしたらいいんだろう？これほどまでに重視される国家は\nそのために、何十億ドルも注ぎ込んでいるのです。\n退役軍人の末路は...",
      "title": "アメリカ政府は、どうしてこれほどまでに軍隊を重視しながら、同時に退役軍人の高い割合をホームレスにすることができるのでしょうか？矛盾していませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"加入世界上最伟大的军事强国的军队，你将会\n之后可能会无家可归！\"\n\n这怎么能说得通呢？一个如此强调军事力量的国家难道不应该\n一个如此强调其军事力量的国家，难道不应该投入数十亿资金，以确保其退伍军人没有一个人落得像\n退伍军人最终会像...",
      "title": "美国政府怎么能如此重视其军队，同时又允许其退伍军人中的高比例人无家可归？这不是自相矛盾吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"加入世界上最偉大的軍事強國的軍隊，你將會\n之後可能會無家可歸！\"\n\n這怎麼能說得通呢？一個如此強調軍事力量的國家難道不應該\n一個如此強調其軍事力量的國家，難道不應該投入數十億資金，以確保其退伍軍人沒有一個人落得像\n退伍軍人最終會像...",
      "title": "美國政府怎麼能如此重視其軍隊，同時又允許其退伍軍人中的高比例人無家可歸？這不是自相矛盾嗎？"
    }
  ]
}