{
  "author": "hotsteamingpho",
  "the_new_excerpt": "I've always loved OKTA as an investor as well as end user. There was an amazing\nbuying opportunity a few weeks back when people thought they overpaid for auth0.\nOkta hits on 3 main pain points in their products that I foresee being a problem\nin the future:\n\n1.) subscription management. Without Okta…",
  "original_created_utc": 1618336843,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、投資家として、またエンドユーザーとして、OKTAをずっと愛してきました。数週間前には素晴らしい買い場がありました。\n数週間前には、人々がauth0を買いすぎたと考えたときに、素晴らしい買い場がありました。\nOKTAの製品は、私が将来的に問題になると予測している3つの主な痛みのポイントを突いています。\n将来的に問題になると思われる3つの主なペインポイントを挙げています。\n\n1.) サブスクリプション管理。Oktaがなければ...",
      "title": "Okta社は、アドレス可能な市場への予測が150億ドルに増加したことを確認しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为投资者以及终端用户，我一直很喜欢OKTA。有一个惊人的\n几周前，当人们认为他们为auth0支付了过多的费用时，就有了购买机会。\nOkta在他们的产品中击中了3个主要的痛点，我预见这是一个问题。\n在今后的工作中。\n\n1）订阅管理。如果没有Okta...",
      "title": "Okta确认将可寻址市场预测值提高150亿美元"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲投資者以及終端用戶，我一直很喜歡OKTA。有一個驚人的\n幾周前，當人們認爲他們爲auth0支付了過多的費用時，就有了購買機會。\nOkta在他們的產品中擊中了3個主要的痛點，我預見這是一個問題。\n在今後的工作中。\n\n1）訂閱管理。如果沒有Okta...",
      "title": "Okta確認將可尋址市場預測值提高150億美元"
    }
  ],
  "title": "Okta confirms increased forecast to addressable market by $15b",
  "created_utc": 1618366642,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve always loved OKTA as an investor as well as end user. There was an amazing buying opportunity a few weeks back when people thought they overpaid for auth0. Okta hits on 3 main pain points in their products that I foresee being a problem in the future:</p>\n\n<p>1.) subscription management. Without Okta managing over 48 (YES, not a mistake) subscription applications on my corporate account, I would be totally lost. This is exacerbated by the fucking annoying &quot;you need to change your password&quot; requirements IT administrators are implementing. UI is clean, and easy to use.</p>\n\n<p>2.) Identity management. Hackers/phishers are getting increasingly clever. I was expecting a package, and got a very legit looking from UPS saying that it was delayed and to confirm recipient info. Luckily I caught it but I can see this being a huge problem down the road. </p>\n\n<p>3.) WFH / Hybrid policy. Okta got it&#39;s initial explosion from ~$100 to now because of COVID. With more increasingly emphasis on remote work, the more need for identity and access management. </p>\n\n<p>positions: ~100 shares @ 200 avg</p>\n</div><!-- SC_ON -->",
  "score": 56,
  "permalink": "/r/investing/comments/mq7skn/okta_confirms_increased_forecast_to_addressable/",
  "subreddit": "investing",
  "id": "mq7skn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566617807
}