{
  "author": "Set1Less",
  "original_created_utc": 1645434335,
  "title": "Vitalik Buterin confirms Bear market by showing up to conference dressed as a grizzly.",
  "created_utc": 1645443218,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Vitalik had earlier hinted that the crypto community would welcome a long winter. He said that crypto could benefit from a crash as short term speculative attention is not good in the long run, while builders could benefit from less attention from speculators. &lt;/p&gt;\n\n&lt;p&gt;Now he has made his strongest statement yet confirming the bear market, as he showed up to the EthDenver conference dressed as a bear. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/hmnqu19nc5j81.jpg?width=623&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=0ed400f123b11ec14e6c91039a6c9e26fe8bdc36\"&gt;Lord Saviour bear. &lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Few other shots of the bear spotted in the wild:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/isukgm8rc5j81.jpg?width=555&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=728ca572bf3ca15f32bcc7bbf4904edf482aaf2f\"&gt;The menacing bear&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/farksdfvc5j81.jpg?width=1200&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=d94260c21c8e5fd42bf36141e8da81fe3b4f61b9\"&gt;Fashion speaks louder than words. &lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Crypto markets have corrected steeply from their highs made in 2021 and the weak price action looks set to continue as geopolitical risks and fed tightening cycle are set to play out throughout 2022. &lt;/p&gt;\n\n&lt;p&gt;However, there is a debate among crypto market participants as to what actually constitutes a bear market. In stocks, a bear market is typically said to occur when stock prices crash by 20%. However given the volatile nature of crypto markets, 20% is a rather low threshold, and it is debatable whether 50% would also constitute a bear market or if it is just a down trend in an historically up only market. &lt;/p&gt;\n\n&lt;p&gt;In this context, Vitalik Buterin - one of the prominent leaders of the space laying it down is a rather strong statement that we are indeed in a bear market.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 457,
  "permalink": "/r/CryptoCurrency/comments/sxp4n2/vitalik_buterin_confirms_bear_market_by_showing/",
  "subreddit": "CryptoCurrency",
  "id": "sxp4n2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Vitalik had earlier hinted that the crypto community would welcome a long\nwinter. He said that crypto could benefit from a crash as short term speculative\nattention is not good in the long run, while builders could benefit from less\nattention from speculators.\n\nNow he has made his strongest…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Vitalikは以前、暗号コミュニティが長い期間を歓迎することをほのめかしていました。\n冬 彼は、暗号は短期的な投機のために暴落から利益を得ることができると述べました。\nの注目度は長期的には良くないが、ビルダーは注目度が下がることで利益を得ることができる。\n投機筋からの注目度\n\n今、彼は最強の...",
      "title": "Vitalik Buterin、グリズリーの格好でカンファレンスに登場し、ベアマーケットを確認。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "维塔利克早些时候曾暗示，加密货币社区将欢迎一个漫长的\n冬天。他说，加密货币可以从崩溃中受益，因为短期的投机性\n从长远来看是不利的，而建筑商可以从较少的\n而建筑商可以从投机者的关注中受益。\n\n现在他提出了他最强烈的...",
      "title": "维塔利克-布特林确认熊市，打扮成灰熊出现在会议上。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "維塔利克早些時候曾暗示，加密貨幣社區將歡迎一個漫長的\n冬天。他說，加密貨幣可以從崩潰中受益，因爲短期的投機性\n從長遠來看是不利的，而建築商可以從較少的\n而建築商可以從投機者的關注中受益。\n\n現在他提出了他最強烈的...",
      "title": "維塔利克-布特林確認熊市，打扮成灰熊出現在會議上。"
    }
  ]
}