{
  "author": "Napalm4Kidz",
  "original_created_utc": 1625723277,
  "title": "Why does the American Revolution seem so much less characterized by infighting than other Revolutions (e.g., French, Russian, or Mexican)?",
  "created_utc": 1625736963,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m working my way through Mike Duncan’s Revolutions podcast series, and I’m struck by the amount of infighting, purges, coups, countercoups and insurrections that seem to characterize almost every revolution covered in the series, except for the American Revolution, which seems to have gone off relatively smoothly and resulted in a stable civilian government pretty much immediately. </p>\n\n<p>Obviously the American Revolutionaries had their disagreements, but they don’t seem to have been willing to kill each other over idealogical differences. Compare this to say, the Girondins and the Jacobins in the French Revolution, or the Constitutionalists and Conventionists in the Mexican Revolution. The American Revolutionaries seem so much less prone to violent infighting. Why is that?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/og11fn/why_does_the_american_revolution_seem_so_much/",
  "subreddit": "AskHistorians",
  "id": "og11fn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m working my way through Mike Duncan’s Revolutions podcast series, and I’m\nstruck by the amount of infighting, purges, coups, countercoups and\ninsurrections that seem to characterize almost every revolution covered in the\nseries, except for the American Revolution, which seems to have gone…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はMike DuncanのRevolutionsポッドキャストシリーズを読み進めています。\n内紛、粛清、クーデター、反乱などが、このシリーズで取り上げられているほとんどの革命を特徴づけているように思えてならないのです。\nこのシリーズで取り上げられているほとんどすべての革命を特徴づけているように思えます。\nアメリカ革命を除いて、このシリーズで取り上げられたほとんどの革命で特徴的に見られる内紛、粛清、クーデター、反乱の多さに驚かされました。",
      "title": "アメリカ革命は、他の革命（フランス革命、ロシア革命、メキシコ革命など）に比べて、なぜ内輪もめが少ないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在努力学习迈克-邓肯的革命系列播客，我被大量的内讧、清算、政变、反动和反叛所震惊。\n我被大量的内讧、清洗、政变、反叛和叛乱所震惊。\n令我印象深刻的是，内讧、清洗、政变、反叛和叛乱似乎是该系列所涉及的几乎每场革命的特点，但美国革命除外。\n系列中所涉及的几乎每场革命的特点，除了美国革命，它似乎已经...",
      "title": "为什么美国革命看起来比其他革命（如法国、俄罗斯或墨西哥）的内讧要少得多？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在努力學習邁克-鄧肯的革命系列播客，我被大量的內訌、清算、政變、反動和反叛所震驚。\n我被大量的內訌、清洗、政變、反叛和叛亂所震驚。\n令我印象深刻的是，內訌、清洗、政變、反叛和叛亂似乎是該系列所涉及的幾乎每場革命的特點，但美國革命除外。\n系列中所涉及的幾乎每場革命的特點，除了美國革命，它似乎已經...",
      "title": "爲什麼美國革命看起來比其他革命（如法國、俄羅斯或墨西哥）的內訌要少得多？"
    }
  ]
}