{
  "author": "Sairof",
  "original_created_utc": 1652696403,
  "title": "Few questions about my first time. How does it work?",
  "created_utc": 1652707677,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I m a 19 (M) and I ll be probably having sex soon with a girl I ve been meeting few weeks ago.&lt;/p&gt;\n\n&lt;p&gt;I m quite nervous and I have a few questions:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;In foreplay, when she masturbates me, what should I do if i cum? Should i get up and go to the toilet or maybe just cum while we keep on with foreplay?&lt;/li&gt;\n&lt;li&gt;When we get ready for penetration, I put on my condom... What do I do with it when I finish? Probably she won&amp;#39;t have finished, so where do I put the condom?&lt;/li&gt;\n&lt;li&gt;What happens if I cum too son during penetration?&lt;/li&gt;\n&lt;li&gt;How can I be goo at oral?&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Thank you very much ^^ it s really hard for me, i feel insecure about cumming so fast :c&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 144,
  "permalink": "/r/TooAfraidToAsk/comments/uqsmvp/few_questions_about_my_first_time_how_does_it_work/",
  "subreddit": "TooAfraidToAsk",
  "id": "uqsmvp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I m a 19 (M) and I ll be probably having sex soon with a girl I ve been meeting\nfew weeks ago.\n\nI m quite nervous and I have a few questions:\n\n 1. In foreplay, when she masturbates me, what should I do if i cum? Should i\n    get up and go to the toilet or maybe just cum while we keep on with\n   …",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は19歳（M）です。私はおそらく私が会ってきた女の子とすぐにセックスするつもりです。\nをする予定です。\n\n私はかなり緊張しており、いくつかの質問があります。\n\n 1. 前戯で、彼女がオナニーしているとき、イクときはどうすればいいのでしょうか？私は\n    をしながら、そのままイッてしまうのでしょうか？\n   ...",
      "title": "初めてのことでいくつか質問があります。H"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个19岁的男人，我可能很快就会和一个我已经认识的女孩发生关系。\n几周前。\n\n我很紧张，我有几个问题。\n\n 1. 在前戏中，当她为我手淫时，如果我射了，我应该怎么办？我应该\n    我应该站起来去厕所，还是在我们继续进行的时候射精？\n   ...",
      "title": "关于我的第一次的几个问题。它是如何工作的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個19歲的男人，我可能很快就會和一個我已經認識的女孩發生關係。\n幾周前。\n\n我很緊張，我有幾個問題。\n\n 1. 在前戲中，當她爲我手淫時，如果我射了，我應該怎麼辦？我應該\n    我應該站起來去廁所，還是在我們繼續進行的時候射精？\n   ...",
      "title": "關於我的第一次的幾個問題。它是如何工作的？"
    }
  ]
}