{
  "author": "Many_Scratch2269",
  "original_created_utc": 1632394546,
  "title": "If the SEC is suing Crypto exchanges citing ponzi schemes and scams, why not sue all banks?",
  "created_utc": 1632404420,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think it&#39;s a no brainier. The SEC is using a horrible excuse to go after Crypto. They are constantly waging a propaganda campaign against Crypto. To state their own concerns, they call Crypto a &quot;flavor of the year for fraudsters&quot;. Yet despite them trying to look like saints, they continue to lobby for banks.</p>\n\n<p>They call Crypto a ponzi scheme while completely ignoring the shit banks do. The entire purpose of banks is to take your money and scam you by giving you a horrible interest rate while using the same money to loan to others and saddle them with debt using high interest rates. If this doesn&#39;t sound like a scam or a ponzi scheme, then I don&#39;t know what is.</p>\n\n<p>Moreover, their entire motive for going after Crypto is to save banks. Imagine if everyone knew about Crypto. Who the fuck on earth would deposit their money into banks for a 0.01% interest rate while they could put that money into any Crypto exchange for an interest rate hundeds or even thousands of times more? Their entire pursuit is to stop Crypto from giving banks a run for their money.</p>\n\n<p>These people have a mindset from the 19th century and are funded by banks. They keep trying to convince people that banks are superior and that <a href=\"https://www.wsj.com/articles/secs-gensler-doesnt-see-cryptocurrencies-lasting-long-11632246355\">Crypto won&#39;t last long</a>. They can&#39;t cope with the fact that Crypto is already becoming legal tender of some countries in just 10 years of existence, while banks are failing due to their shady policies.</p>\n\n<p>But alas, Crypto is used for scams right? I mean, even if you look at some of the most high level Crypto scams, it is nothing considered to the scams you can fall for using banks and fiat. Banks themselves are scamming people at an institutional level. Yet these people ignore banks because their paycheck relies on them.</p>\n\n<p>TLDR: Fuck the SEC. Their only way to cope is to spread a bad PR campaign against Crypto while shielding banks from anything that comes towards them. Fortunately, these 80 year old corrupt politicians and billionaires can only live for so long.</p>\n</div><!-- SC_ON -->",
  "score": 249,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/irRKWQGMqUFqSYAJJ-rTV2hviETo_1mdb_OzELgIZi8.jpg?auto=webp&s=ca108998378560d8e8d28bd74be919592917bd73",
          "width": 1280,
          "height": 640
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/irRKWQGMqUFqSYAJJ-rTV2hviETo_1mdb_OzELgIZi8.jpg?width=108&crop=smart&auto=webp&s=f2cf47ea5dc39affe180baf0858c2d6a2807f1e7",
            "width": 108,
            "height": 54
          },
          {
            "url": "https://external-preview.redd.it/irRKWQGMqUFqSYAJJ-rTV2hviETo_1mdb_OzELgIZi8.jpg?width=216&crop=smart&auto=webp&s=6b8f1c36133b24fbc36989caf1bfc120249bd707",
            "width": 216,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/irRKWQGMqUFqSYAJJ-rTV2hviETo_1mdb_OzELgIZi8.jpg?width=320&crop=smart&auto=webp&s=05007465df8f04ea3c3a5825c1487c381e4fcf00",
            "width": 320,
            "height": 160
          },
          {
            "url": "https://external-preview.redd.it/irRKWQGMqUFqSYAJJ-rTV2hviETo_1mdb_OzELgIZi8.jpg?width=640&crop=smart&auto=webp&s=fff46fcacbbf865b8ce65b7e3ef11d4b348520c4",
            "width": 640,
            "height": 320
          },
          {
            "url": "https://external-preview.redd.it/irRKWQGMqUFqSYAJJ-rTV2hviETo_1mdb_OzELgIZi8.jpg?width=960&crop=smart&auto=webp&s=8ea67a59200b92e9d68fc236ef4c8f714361ad78",
            "width": 960,
            "height": 480
          },
          {
            "url": "https://external-preview.redd.it/irRKWQGMqUFqSYAJJ-rTV2hviETo_1mdb_OzELgIZi8.jpg?width=1080&crop=smart&auto=webp&s=33caf2886a08c730a2dd716ff170bb4f79ac567c",
            "width": 1080,
            "height": 540
          }
        ],
        "variants": {},
        "id": "5KaVXZURP5v6CUra7mH8eVvVQvIAl1PeP3UfFqYJMf8"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/ptsoeq/if_the_sec_is_suing_crypto_exchanges_citing_ponzi/",
  "subreddit": "CryptoCurrency",
  "id": "ptsoeq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I think it's a no brainier. The SEC is using a horrible excuse to go after\nCrypto. They are constantly waging a propaganda campaign against Crypto. To\nstate their own concerns, they call Crypto a \"flavor of the year for\nfraudsters\". Yet despite them trying to look like saints, they continue to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、それは間違いないと思います。SECはひどい言い訳を使って、後追いで\n狙っています。彼らは常にCryptoに対するプロパガンダキャンペーンを展開しています。自分たちの懸念を表明するために\n自分たちの懸念を述べるために、彼らはCryptoを「詐欺師のための今年の味」と呼んでいます。\n詐欺師」と呼んでいます。しかし、聖人のように見せようとしているにもかかわらず、彼らは引き続き...",
      "title": "SECがネズミ講や詐欺を理由に暗号取引所を訴えているなら、なぜすべての銀行を訴えないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为这是一个不费脑子的问题。美国证券交易委员会正在使用一个可怕的借口来对付\n隐性货币。他们不断地对加密货币展开宣传攻势。为了\n为了说明他们自己的担忧，他们称加密货币是 \"欺诈者的年度口味\"。\n骗子\"。然而，尽管他们试图看起来像圣人，他们继续...",
      "title": "如果美国证券交易委员会以庞氏骗局和骗局为由起诉加密货币交易所，为什么不起诉所有银行呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲這是一個不費腦子的問題。美國證券交易委員會正在使用一個可怕的藉口來對付\n隱性貨幣。他們不斷地對加密貨幣展開宣傳攻勢。爲了\n爲了說明他們自己的擔憂，他們稱加密貨幣是 \"欺詐者的年度口味\"。\n騙子\"。然而，儘管他們試圖看起來像聖人，他們繼續...",
      "title": "如果美國證券交易委員會以龐氏騙局和騙局爲由起訴加密貨幣交易所，爲什麼不起訴所有銀行呢？"
    }
  ]
}