{
  "author": "infinity884422",
  "the_new_excerpt": "\"Palantir USG Inc., Palo Alto, California, has been awarded a $32,500,000\nfirm-fixed-price contract that provides data-as-a-service platform for two\nseparate mission areas. The first is the Project Brown Heron effort that has the\nPalantir Gotham platform configured to automatically ingest data from…",
  "original_created_utc": 1619818975,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"Palantir USG Inc.\"（カリフォルニア州パロアルト）は、32,500,000ドルの確定固定価格契約を獲得しました。\nデータ・アズ・ア・サービス・プラットフォームを提供する固定価格の契約を獲得しました。\nこの契約は、2つの独立したミッション分野にデータ・アズ・ア・サービス・プラットフォームを提供するものです。1つ目は、Project Brown Heronの取り組みで、Palantir Gothamプラットフォームを使用します。\nPalantir Gothamプラットフォームは...からデータを自動的に取り込むように設定されています。",
      "title": "$PLTR 米国空軍の新規契約"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"加利福尼亚州帕洛阿尔托的Palantir USG Inc.获得了一份价值32,500,000美元的固定价格合同。\n的固定价格合同，为两个独立的任务领域提供数据即服务平台。\n额外的任务领域提供数据即服务平台。第一个是 \"棕鹭项目\"，该项目拥有\nPalantir Gotham平台被配置为自动摄取来自...",
      "title": "$PLTR 美国空军新合同"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"加利福尼亞州帕洛阿爾託的Palantir USG Inc.獲得了一份價值32,500,000美元的固定價格合同。\n的固定價格合同，爲兩個獨立的任務領域提供數據即服務平臺。\n額外的任務領域提供數據即服務平臺。第一個是 \"棕鷺項目\"，該項目擁有\nPalantir Gotham平臺被配置爲自動攝取來自...",
      "title": "$PLTR 美國空軍新合同"
    }
  ],
  "title": "$PLTR New US Air Force Contract",
  "created_utc": 1619825192,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;Palantir USG Inc., Palo Alto, California, has been awarded a $32,500,000 firm-fixed-price contract that provides data-as-a-service platform for two separate mission areas. The first is the Project Brown Heron effort that has the Palantir Gotham platform configured to automatically ingest data from across the Department of the Air Force (DAF) that continually push personnel, equipment, planning, health, and other readiness data sources into their common data foundation. This readiness information is a critical component to DAF-wide COVID-19 analysis and decision making. The second is to provide mission-critical space situational awareness and command and control capabilities to operational users at the National Space Defense Center and the Combined Space Operations Center. Work will be performed in Palo Alto, California, and is expected to be completed Nov. 30, 2021. This award is the result of a sole-source acquisition. Fiscal 2021 operation and maintenance funds in the amount of $12,857,144; and fiscal 2021 research, development, test and evaluation funds in the amount of $4,000,000 are being obligated at the time of award. Space and Missile Systems Center, Los Angeles Air Force Base, California, is the contracting activity (FA8806-21-C-0010).&quot;</p>\n\n<p><a href=\"https://www.defense.gov/Newsroom/Contracts/Contract/Article/2591938/\">Link</a></p>\n</div><!-- SC_ON -->",
  "score": 1856,
  "permalink": "/r/stocks/comments/n2468b/pltr_new_us_air_force_contract/",
  "subreddit": "stocks",
  "id": "n2468b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380967000
}