{
  "author": "Ass-Kickin_Chicken",
  "original_created_utc": 1633753606,
  "title": "My crypto portfolio has surpassed the $1 million mark",
  "created_utc": 1633764911,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ll admit it, it wasn&#39;t easy at all. I endured many nail-biting bear markets, a constant fear of flash crashes, numerous urges to FOMO into different coins, and many other stressful scenarios.</p>\n\n<p>But, at once point during my time investing with crypto, I decided that I need to be patient and smart with me assets: Hold some and stake others for compounded returns. It wasn&#39;t a exciting as day trading, but it was a safer route to take. I eventually learned to forget about my portfolio and wait a couple of years until I could check again.</p>\n\n<p>Years later, I am more than happy to say that my crypto portfolio has passed the million dollar mark, making me a crypto millionaire. It was a HUGE accomplishment for me as it will allow me to pursue my interests of playing video games all day and, maybe, start a streaming channel since I always thought of showing off my gaming skills to an audience. It would also give me an opportunity to help out those in need and improve the lives of so many others.</p>\n\n<p>I never thought that I would become a millionaire, especially in Crypto; but here I am. Years of patience and hodling has given me a crypto portfolio that is now worth more than 1 million Zimbabwean Dollars.</p>\n</div><!-- SC_ON -->",
  "score": 580,
  "permalink": "/r/CryptoCurrency/comments/q4e40i/my_crypto_portfolio_has_surpassed_the_1_million/",
  "subreddit": "CryptoCurrency",
  "id": "q4e40i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'll admit it, it wasn't easy at all. I endured many nail-biting bear markets, a\nconstant fear of flash crashes, numerous urges to FOMO into different coins, and\nmany other stressful scenarios.\n\nBut, at once point during my time investing with crypto, I decided that I need\nto be patient and smart…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正直に言うと、まったく簡単ではありませんでした。私は何度も釘付けになるような弱気な市場に耐え、フラッシュクラッシュへの絶え間ない恐怖にさらされました。\nフラッシュ・クラッシュへの絶え間ない恐怖、様々なコインにFOMOしたいという衝動、その他多くのストレスを感じました。\n他にも多くのストレスを感じる場面がありました。\n\nしかし、暗号を使った投資を行っている間に、ある時、私は必要だと判断しました。\n忍耐強く、そして賢くなる必要があると思いました...。",
      "title": "私の暗号化ポートフォリオは100万ドルを突破しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我承认，这一点都不容易。我经受了许多钉子般的熊市，对闪电式崩溃的持续恐惧，对不同币种的无数次FOMO冲动，以及我在这一过程中所经历的一切。\n对闪电式崩溃的持续恐惧，无数次对不同币种的FOMO冲动，还有\n还有许多其他的压力情况。\n\n但是，在我投资加密货币的过程中，有一次我决定，我需要\n要有耐心和智慧...",
      "title": "我的加密货币投资组合已超过100万美元大关"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我承認，這一點都不容易。我經受了許多釘子般的熊市，對閃電式崩潰的持續恐懼，對不同幣種的無數次FOMO衝動，以及我在這一過程中所經歷的一切。\n對閃電式崩潰的持續恐懼，無數次對不同幣種的FOMO衝動，還有\n還有許多其他的壓力情況。\n\n但是，在我投資加密貨幣的過程中，有一次我決定，我需要\n要有耐心和智慧...",
      "title": "我的加密貨幣投資組合已超過100萬美元大關"
    }
  ]
}