{
  "author": "only1parkjisung",
  "the_new_excerpt": "My fellow GME-stans,\n\nFor far too long the world has dismissed us as degenerates, gamblers, and\nuninformed retail scum, and while we are some or perhaps all of those things, we\nare also now a powerful force to be taken seriously. Our culture is now the\nculture of the entire finance industry. Our…",
  "original_created_utc": 1611103582,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我的GME同胞们，\n\n长久以来，世界一直把我们当作堕落者、赌徒和\n不知情的零售人渣，虽然我们是一些或也许是所有这些东西，但我们。\n现在也是一股值得重视的强大力量。我们的文化现在是\n整个金融行业的文化。我们的...",
      "title": "公告。官方版主微博账号@WSBMOD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的GME同胞們，\n\n長久以來，世界一直把我們當作墮落者、賭徒和\n不知情的零售人渣，雖然我們是一些或也許是所有這些東西，但我們。\n現在也是一股值得重視的強大力量。我們的文化現在是\n整個金融行業的文化。我們的...",
      "title": "公告。官方版主微博賬號@WSBMOD"
    }
  ],
  "title": "Announcement: Official Moderator Twitter Account @WSBMOD",
  "created_utc": 1611122685,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My fellow GME-stans,</p>\n\n<p>For far too long the world has dismissed us as degenerates, gamblers, and uninformed retail scum, and while we are some or perhaps all of those things, we are also now a powerful force to be taken seriously. Our culture is now the culture of the entire finance industry. Our memes are now viral across every social platform. Our shitty DD now moves entire markets.</p>\n\n<p>The world is already talking about us, but it is time for us to have a voice and talk back. Moving forward, the moderators will be managing the Twitter account <a href=\"https://twitter.com/wsbmod\">@wsbmod</a> as our main form of communication with the outside world. This account will be used to coordinate AMAs and other interactions with important people, share dank memes while giving due credit to our creators here, and generally shitposting to the best of our abilities. Not to mention being able to reply to Shitron&#39;s tweets.</p>\n\n<p>tl;dr <a href=\"https://twitter.com/wsbmod\">@wsbmod</a> is the only official Twitter account of the sub and we need your help to ensure our voice is heard loud and far.</p>\n\n<p>Thank you.</p>\n</div><!-- SC_ON -->",
  "score": 3447,
  "permalink": "/r/wallstreetbets/comments/l0xphu/announcement_official_moderator_twitter_account/",
  "subreddit": "wallstreetbets",
  "id": "l0xphu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311228537
}