{
  "author": "IronicSonic_",
  "the_new_excerpt": "Now, I don't consider myself close minded and I'm not out to rile people up or\noffend anyone. However it becomes kind of confusing when people are upset when I\nsay Her/She to someone who's trans. I'm sorry, really, but I didn't know. I'm in\na discord server where someone changes their pfp depending…",
  "original_created_utc": 1614035798,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "现在，我不认为自己的心胸狭隘，我也不是要激怒别人或\n冒犯了任何人。然而，当人们不高兴时，就会变得有点困惑，当我\n对变性人说 \"她/她\"。对不起，真的，但我不知道。我在\n一个discord服务器，有人改变他们的pfp取决于... ...",
      "title": "只有我一个人认为所有不同类型的性别和代词什么的，都有点过了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在，我不認爲自己的心胸狹隘，我也不是要激怒別人或\n冒犯了任何人。然而，當人們不高興時，就會變得有點困惑，當我\n對變性人說 \"她/她\"。對不起，真的，但我不知道。我在\n一個discord服務器，有人改變他們的pfp取決於... ...",
      "title": "只有我一個人認爲所有不同類型的性別和代詞什麼的，都有點過了？"
    }
  ],
  "title": "Am I the only who thinks that all the different types of genders and pronouns and what not, are a little bit too much?",
  "created_utc": 1614041811,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Now, I don&#39;t consider myself close minded and I&#39;m not out to rile people up or offend anyone. However it becomes kind of confusing when people are upset when I say Her/She to someone who&#39;s trans. I&#39;m sorry, really, but I didn&#39;t know. I&#39;m in a discord server where someone changes their pfp depending on what gender and sexuality they are feeling. And no, I&#39;m lot some 40 year old guy who thinks everything should be &quot;normal&quot; but I guess I just don&#39;t get it. It&#39;s just confusing to me.</p>\n\n<p>EDIT: So I haven&#39;t explained my thoughts very well so I&#39;m here to explain. I understand that to some people, it is very important to them. I don&#39;t think it&#39;s a lot for me to call you what you want to be called and I will oblige and do that. &quot;it becomes kind of confusing when people are upset when I say Her/She to someone who&#39;s trans&quot; This was from personal experience where my friend introduced me to him and I was under the impression that he was female. More so I don&#39;t understand like Ve/Vem Xe/Xem. The more &quot;unknown&quot; side if you will. But with the way people are reacting I&#39;m going to try a better job at finding peoples pronouns and not assuming genders. Sorry if it sounded sarcastic at all. Anyways, unless there&#39;s something else I think of I&#39;m not gonna edit again. Sorry if I offended but it&#39;s kind of hard to talk about a sensitive topic like this without being an ass about it. I don&#39;t know how to word things. but yea. Sorry.</p>\n\n<p>TL;DR I think gender can be a weird and wacky world and I don&#39;t get how people except me to automatically know what they identify as.</p>\n</div><!-- SC_ON -->",
  "score": 179,
  "permalink": "/r/TooAfraidToAsk/comments/lq2yj9/am_i_the_only_who_thinks_that_all_the_different/",
  "subreddit": "TooAfraidToAsk",
  "id": "lq2yj9",
  "is_self": true,
  "media": null,
  "is_video": false
}