{
  "author": "002timmy",
  "original_created_utc": 1648146435,
  "title": "I Made A Guide For My Family To Access My Crypto After I Die, So You Don't Have To",
  "created_utc": 1648173626,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello, &lt;/p&gt;\n\n&lt;p&gt;As my crypto holdings have grown, I am becoming increasing afraid of my family not having access to these assets should I have an untimely death.  I search for a guide to give me family but could not find one, so I decided to make one.  This is a very long post and the coins and wallets are specific to me, but hopefully it will give others a good starting point.&lt;/p&gt;\n\n&lt;p&gt;If you have any feedback, please share it so we can make the guide better and better.  I also posted the guide on my &lt;a href=\"https://greghamalian.substack.com/p/a-guide-to-accessing-crypto-after?s=w\"&gt;substack&lt;/a&gt; and made it accessible to everyone.  I will be updating periodically with guides I receive from other people for their specific coins and holdings.&lt;/p&gt;\n\n&lt;p&gt;I know that so many of us have dreams of giving our family a better financial future, and our investments in crypto will not come to fruition if our keys die with us.  Please let me know what you think as I want to constantly improve this for others!&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Hello,&lt;/p&gt;\n\n&lt;p&gt;At this point, I have been incapacitated to the point where I am unable to access my financial accounts.  At the time of writing, I have typical account with [banks, investments, etc].  I believe these accounts you will be access with proper documentation. &lt;/p&gt;\n\n&lt;p&gt;However, I also have funds in Cryptocurrencies.  These are a little more difficult to access, especially because some of the funds are stored on the blockchain.  This means there is no single entity holding the currencies and no department to call to get access to the account.  This presents an obvious challenge to getting funds I hold, which I will hopefully be able to describe how to access below.&lt;/p&gt;\n\n&lt;p&gt;The first thing you will need to know is that the coins/tokens are stored on the internet in a structure called the blockchain.  There is a public address (or public key) that is visible to everyone.  This is how the funds are verified as belonging to the address.  Think of this like as view-only permissions on a google document. &lt;/p&gt;\n\n&lt;p&gt;However, to move/send the funds and interact with the blockchain, one also needs to have the private key.  The private key is like having the email and password associated with the account that created the google document, so you can edit it.  A private key is generated from a set of words, called a seed phrase, and a key index.  If this is confusing, do not worry.  You will not need to understand all of it to access my tokens.&lt;/p&gt;\n\n&lt;p&gt;With all that said, the way you will get access to my tokens is through my seed phrase.  This is a set of words, either 12-, 15-, or 24- words long, which brings up my funds through a “wallet” on the blockchain. &lt;/p&gt;\n\n&lt;p&gt;Not to try to add too much complexity, but one token can have multiple wallets to access the chain.  However, for you, they will all work the same way.&lt;/p&gt;\n\n&lt;p&gt;Roughly speaking, my money is in a wallet on the blockchain.  To get access to the money, you need my seed phrase.  The seed phrase is critical. &lt;strong&gt;NEVER&lt;/strong&gt; give anyone the seed phrase to my accounts.  These seed phrases are kept in a secure location.  You will be able to find them when needed. &lt;/p&gt;\n\n&lt;p&gt;Under each coin I hold in a wallet, I will let you know exactly how to import the seed.  However, I first want to give you a general overview.  You will start by going to the foundation or company’s website.  See what wallet they recommend (unless I explicitly state a wallet I use for the coin).  You will download that wallet application.  When creating the wallet, you will select “Import from seed” or some similar phrase.  Do not create a new wallet.  You will enter the seed and see my wallet and funds. It will likely ask you to enter a spending password as well, or a PIN.  Do one you won’t forget.&lt;/p&gt;\n\n&lt;p&gt;Once you have access to the coins, you will need to transfer them to an exchange, then sell them on the exchange for dollars.  You can then transfer the dollars to whatever bank account you choose.&lt;/p&gt;\n\n&lt;p&gt;For the exchange, I recommend using primarily Coinbase.  This exchange is the simplest to understand and most user-friendly from an interface perspective.  I trust you will be able to create an account and connect the bank account.  I have funds on different exchanges as well.  The funds kept on exchanges will be easily accessible to you through my email and passwords.  You will know how to access this when the time comes. &lt;/p&gt;\n\n&lt;p&gt;Now, while on Coinbase, you will need to click the “manage profile” button.  Under contact info, there will be a button that says “crypto addresses.”  Clicking this will allow you to create a wallet on Coinbase to send the money to. You will need to create an address for every coin I have for the transfer.  I will lay out each coin and the seed phrases for you to access, before describing how to do the transfer.&lt;/p&gt;\n\n&lt;p&gt;There are 3 different types of wallets that I have-&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;There is a custodial wallet.&lt;/strong&gt;  This means another entity holds access to the keys/seed phrases. This is a wallet on an exchange (like Coinbase).  You will not need to do anything special here.  There are no special seed phrases to enter.  Simply my email, password, and 2FA will allow you to transfer.  The exchange will also have support for you to contact if I am incapacitated to help you get the money.  You can simply sell the through the exchange and transfer the funds to the bank.  The exchanges I have an account on are Coinbase, Binance.US, Gemini, and Crypto.com.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;There is a non-custodial, hot wallet.&lt;/strong&gt;  This is a wallet online that you can access through the internet.  To access the tokens, you will have to go to a website and launch the application.  This often requires a download.  There are many scams out there, so please be careful.  The best way to access these wallets is to go to the official website of the foundation that launched the coin.  For example, the Algorand Token was launched by the Algorand Foundation.  One the foundation’s website, the recommend the Pera Wallet and MyAlgo Wallet.  Download these through the hyperlinks.  If you need any help, questions on the coins subreddit, and follow the recommendations of the people who answer publicly (do not respond to any direct messaging).  For this type of wallet, you’ll need to download the application, and then import my seed phrase for the wallet.  By entering the seed phrase, it will load the wallet that I created and stored value in.  It will ask you to create a spending password.  Pick whatever password you will remember as you will need to enter it to send the money out. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;There is a non-custodial, cold wallet.&lt;/strong&gt;  This is a wallet where access to the funds are kept offline, but can be restored online whenever the wallet is actively being used.  The cold wallet I use is called a Ledger (made by a company called Ledger). For coins stored on my Ledger, you will need to download the Ledger Live App.  My ledger seed phrase is written on a metal plate and stored in my safety deposit box.  You will also be able to access my coins through the Ledger device.  This looks like a USB stick.  Through the Ledger Live App, you will have to send the coins to the exchange, while having the device nearby.  When the device is asks, you will need to confirm the transaction (push both buttons). &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I understand this may be a little confusing.  Read through a couple times, ask questions on Reddit, and watch YouTube videos.  It is a lot to take in initially, but it becomes easy once you try to figure it out.&lt;/p&gt;\n\n&lt;p&gt;At the time of writing, I own the following coins.  Bitcoin (BTC), Ethereum (ETH), Cardano (ADA), Algorand (ALGO), Harmony (ONE), Nervos (CKB), Chainlink (LINK), and Stellar (XLM).  I will now tell you how to access each of these.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Bitcoin (BTC)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This is stored through my cold-wallet Ledger.  You will use my Ledger Nano X and Ledger Live app to send to Coinbase (or whatever exchange you pick). The transfer usually takes 10-30 minutes.  Please do 2 separate transactions.  The first is a “test” transaction where you will send $5-$10 worth of BTC to the exchange.  Wait until it arrives before sending the remaining amount.  You will be charged a fee twice, but knowing it will arrive is worth it instead of sending all the money and not seeing it go through.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Ethereum (ETH)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This is currently stored on custodial wallet, Coinbase.  I locked it up to earn interest.  I regret this decision currently.  Once the funds become available after they unlock, I will move my ETH to the Ledger.  Follow the steps for BTC to get it on an exchange.&lt;/p&gt;\n\n&lt;p&gt;ETH swaps are anywhere from 5-30 minutes.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Cardano (ADA)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;My Cardano is currently stored through a Cardano hot-wallet.  The wallet I use is called Eternl.  You can access my tokens by importing my seed phrase on wallets such as Nami and Yoroi.  When you gain access to this account, the first thing you will need to do is claim my “staking” rewards and “undelegate” the ADA I am staking.  Staking is basically the interest I earned from having the tokens, and unstaking/undelegating is withdrawing that money. &lt;/p&gt;\n\n&lt;p&gt;You will also need to sell off additional tokens called “Cardano Native Assets.”  These are tokens that run on the Cardano system and have a value in ADA, but are not available on exchanges to cash out.  I will likely have tokens by the name of SUNDAE, DRIP, and FLICK.  To sell these tokens, search for a site called SundaeSwap.  You will need to connect the wallet, and on SundaeSwap you can exchange these assets for ADA.   Now, with that being said, you will likely pay a fee for each swap.  That is to be expected.  Just make sure the amount of ADA you receive is greater than the fee you will pay.&lt;/p&gt;\n\n&lt;p&gt;Once the native assets are swaps, send the ADA to the exchange.  Again, please do a test transaction first.  ADA transactions typically take 5-10 minutes to show up in the account. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Algorand (ALGO)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;My Algorand is either kept in my Ledger cold wallet or in a MyAlgo hot wallet.  This is because some of the Algorand I use I lock up to earn interest (think like a bank-bond) and the other I use to participate in an activity called Decentralized Finance (DeFi).  The Algorand on the Ledger can be sent through the Ledger Live app exactly like Bitcoin. &lt;/p&gt;\n\n&lt;p&gt;The Algorand I use in DeFi will be kept in a few places.  The first is right in the wallet.  This will be rare and there likely won’t be a lot of Algorand here.  There will be in what is called Liquidity Pools on a website called Tinyman.  To access Tinyman, you will first need to create a MyAlgo wallet and import my seed phrase.  You will go to app.tinyman.org and connect to the wallet.  Go to the tab that says “Pools” and with the LP Tokens.  You will then swap the assets that are not ALGO for ALGO using the same Tinyman site.  This is a similar process like you would have done for Cardano, it is just a different website but the same concept.  There are other areas of DeFi I participated in, but nothing at the moment.  If I start something new, I will update this sheet. &lt;/p&gt;\n\n&lt;p&gt;ALGO swap are typically near-instant.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Harmony (ONE)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I keep my Harmony in a hot-wallet called MetaMask.  You will need to download the MetaMask Wallet application and import my seed phrase.  However, like with Cardano and Algorand, most of my ONE is used in DeFi.  The website I use is called OpenSwap.  You can find it at app.openswap.one.  To access my ONE, you will first need to “unstake” my ONE.  With ADA, when you unstake/undelegated, the ADA will be available immediately.  On Harmony, you will need to wait ~7 days for the money to unlock.&lt;/p&gt;\n\n&lt;p&gt;To unstake on openswap, click the “Farm” tab on the top of the page.  You will see my stake and many pairings.  There will be a line to that says “OpenSwap AutoCompound” and you can drop down details.  Do that, select unstake, and unstake the tokens.&lt;/p&gt;\n\n&lt;p&gt;To claim everything for the LPs, on the same page click the button that says “Only Show Staked Pools.” Select the details and unstake.  Like with ADA and ALGO, swap everything that isn’t ONE for ONE, and send to an exchange.&lt;/p&gt;\n\n&lt;p&gt;Please note that Coinbase does not have Harmony (ONE) available for trade.  The exchange Binance.US is probably the best site for this.  Another work around is to swap ONE for BTC and send the BTC to Coinbase.  However, this may be riskier is you cannot figure out how to send.  Definitely send a small test transaction first!&lt;/p&gt;\n\n&lt;p&gt;Harmony swaps are typically near instant.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Nervos (CKB)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This is currently stored through the custodial wallet on Crypto.com.  I am hoping to move the CKB to my Ledger soon.  However, CKB is not traded on many exchanges, so a Crypto.com account might be the best way to get the money back.&lt;/p&gt;\n\n&lt;p&gt;I’ve yet to move CKB, and online I saw it could be anywhere from 5 minutes to hours.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Chainlink (LINK)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;My Chainlink is stored on Coinbase.  However, I plan to move my LINK to a DeFi site soon.  I will update this once the move is made.&lt;/p&gt;\n\n&lt;p&gt;LINK transaction time is ~5-10 minutes typically.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Stellar (XLM)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;My Stellar is on Coinbase.  I likely will not have much Stellar.  I have a pre-loaded Coinbase Debit Card.  Basically, I frontload USD, and I get 4% XLM rewards back.  I frequently swap the XLM I earn for another cryptocurrency I own.&lt;/p&gt;\n\n&lt;p&gt;This will never be kept in a non-custodial wallet, but transaction times are near-instant.&lt;/p&gt;\n\n&lt;p&gt;Hopefully that covers the entire process to get the funds I’ve been into crypto.  If you have questions, again, please go reddit and ask for help either in &lt;a href=\"/r/cryptocurrency\"&gt;r/cryptocurrency&lt;/a&gt; or coin specific subreddits. NEVER share seed phrase and only follow advice people give publicly, not personal messages.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 331,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/FQAdfL75JQ5LdzoohQJWQxPYj36_QZhrA9UviCnlhwk.jpg?auto=webp&amp;s=b3da591f4e414021b472bdf890a86fe23b194b46",
          "width": 90,
          "height": 90
        },
        "resolutions": [],
        "variants": {},
        "id": "qFpbfi1UKxoTFCfhRHaeIKoOyIpxhiu-snqaVjT1NIg"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/tmtrn3/i_made_a_guide_for_my_family_to_access_my_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "tmtrn3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hello,\n\nAs my crypto holdings have grown, I am becoming increasing afraid of my family\nnot having access to these assets should I have an untimely death. I search for\na guide to give me family but could not find one, so I decided to make one. This\nis a very long post and the coins and wallets are…"
}