{
  "author": "A-Delonix-Regia",
  "original_created_utc": 1657356562,
  "title": "How did Christianity (especially in the USA) develop a significant and vocal demographic that doesn't believe in many commonly accepted scientific theories?",
  "created_utc": 1657371391,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So going by the internet, the USA has a lot of Christian private schools, and some of those Christian schools teach the 6000-year-old-earth theory and other scientifically disproven claims. The fact that these claims are still taught in modern schools and believed by a significant portion of the US population is quite surprising considering that the USA is viewed as a developed country and has many leading universities.&lt;/p&gt;\n\n&lt;p&gt;For comparison, in India (which is more religious than the USA), all schools that are recognised by the government have to use a scientifically sound non-religious educational curriculum created by either a state-level or a national-level authority (or the curriculum has to be an international one that is recognised by other Indian educational institutions, like IGCSE or the International Baccalaureate). If an Indian school is run by a religious organisation (most such schools are run by Catholic organisations or Hindu organisations), they can hold daily prayers and other religious activities, but they don&amp;#39;t usually try to guilt people using their religion and they almost never teach anything that contradicts science. Plus, &lt;a href=\"https://www.weforum.org/agenda/2020/10/trust-science-india-pew-research-center/\"&gt;Indians in general have more trust in scientists compared to Americans&lt;/a&gt; though of course &lt;a href=\"https://en.wikipedia.org/wiki/Ganesha_drinking_milk_miracle\"&gt;we have out fair share of religious people who believe in miracles&lt;/a&gt;. So I don&amp;#39;t see why being more religious should make someone not believe in scientific theories.&lt;/p&gt;\n\n&lt;p&gt;So, how did America get a significant Christian population that doesn&amp;#39;t believe in many commonly accepted scientific theories?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 166,
  "permalink": "/r/AskHistorians/comments/vuxgrx/how_did_christianity_especially_in_the_usa/",
  "subreddit": "AskHistorians",
  "id": "vuxgrx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So going by the internet, the USA has a lot of Christian private schools, and\nsome of those Christian schools teach the 6000-year-old-earth theory and other\nscientifically disproven claims. The fact that these claims are still taught in\nmodern schools and believed by a significant portion of the US…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だからネットで調べると、アメリカはキリスト教系の私立学校が多く、そ\nその中には、地球6000年説やその他の科学的根拠を教える学校もあります。\n科学的に否定された主張を教える学校もあります。このような主張が今でも教えられているということは\n現代の学校でも教えられており、アメリカのかなりの部分で信じられている...",
      "title": "キリスト教（特に米国）は、一般に受け入れられている多くの科学的理論を信じない、重要で声の大きい層をどのようにして作り上げたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以从互联网上看，美国有很多基督教私立学校，而\n其中一些基督教学校教授6000年地球理论和其他\n科学上被推翻的说法。事实上，这些说法仍然在现代学校中被教授\n这些说法仍然在现代学校中教授，并被美国相当一部分人所相信...",
      "title": "基督教（尤其是在美国）是如何发展出一个重要的、有发言权的人口群体，不相信许多普遍接受的科学理论？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以從互聯網上看，美國有很多基督教私立學校，而\n其中一些基督教學校教授6000年地球理論和其他\n科學上被推翻的說法。事實上，這些說法仍然在現代學校中被教授\n這些說法仍然在現代學校中教授，並被美國相當一部分人所相信...",
      "title": "基督教（尤其是在美國）是如何發展出一個重要的、有發言權的人口羣體，不相信許多普遍接受的科學理論？"
    }
  ]
}