{
  "author": "markalanray00",
  "original_created_utc": 1652204531,
  "title": "Have you been in the Safemoon sub?",
  "created_utc": 1652231944,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It’s wild. I can’t believe how many people are, lack of a better word, brainwashed. I feel like it has been proven that the developers are engaging in shady practices and not ethical. I am thinking they will take that money and run at some point. Why do you think people are so adamant that it’s a legitimate project? The “CEO” reeks of charlatan. Also, I believe they incorporated a 90% claim tax or something like that to where it’s hard to take money out (not sure if that’s accurate). I am not a skeptical person but my God I just don’t get it. I truly feel bad for the investors because from the outside it seems crazy that someone would fall for some of the explanations heard from the Safemoon team regarding certain accusations. Anyway,  was curious to hear everyone’s thoughts. I’m obviously not an investor in the project and just trying to understand peoples mentality when it comes to projects like this. Appreciate some insight. Fascinating stuff. Cheers.&lt;/p&gt;\n\n&lt;p&gt;Edit: first of all I want to say that I appreciate all of the comments. I have learned several things so far. &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt; I am wrong about the 90% claim tax and I guess it is 100% transfer tax which seems much better. (Please someone clean me up on this if I’m still wrong)&lt;/li&gt;\n&lt;li&gt; I am apparently a karma whore. &lt;/li&gt;\n&lt;li&gt;The Safemoon army is a passionate bunch. I can appreciate that. &lt;/li&gt;\n&lt;li&gt;People that post about Safemoon just want the moons. I was not aware of this. &lt;/li&gt;\n&lt;li&gt;There are people that have invested who understood that it was a longshot and invested only what they were willing to lose or made a little money early and got out. &lt;/li&gt;\n&lt;li&gt;Lots of bots in the Safemoon subreddit.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 348,
  "permalink": "/r/CryptoCurrency/comments/umoaj9/have_you_been_in_the_safemoon_sub/",
  "subreddit": "CryptoCurrency",
  "id": "umoaj9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It’s wild. I can’t believe how many people are, lack of a better word,\nbrainwashed. I feel like it has been proven that the developers are engaging in\nshady practices and not ethical. I am thinking they will take that money and run\nat some point. Why do you think people are so adamant that it’s a…"
}