{
  "author": "partymsl",
  "original_created_utc": 1658845264,
  "title": "US Senators propose bill to exclude crypto transactions under $50 from taxes. Another step in the right direction.",
  "created_utc": 1658850964,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just now two US Senators have proposed a bill to congress that would exempt crypto transactions under $50 from crypto taxes. Good to see some people pushing for the right regulation of Crypto while keeping crypto adoption and government protection equally on sight.&lt;/p&gt;\n\n&lt;p&gt;Some may say that no crypto taxes at all would have been better but I disagree here, there should be no problem in giving some money to the government for public services (whether they actually do that is the other question) I mean we are protesting so that rich people should pay taxes so we should pay too. And under $50 seems like a very reasonable mark depending on how high the tax would be over that.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 304,
  "permalink": "/r/CryptoCurrency/comments/w8l21i/us_senators_propose_bill_to_exclude_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "w8l21i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Just now two US Senators have proposed a bill to congress that would exempt\ncrypto transactions under $50 from crypto taxes. Good to see some people pushing\nfor the right regulation of Crypto while keeping crypto adoption and government\nprotection equally on sight.\n\nSome may say that no crypto…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちょうど今、2人の米国上院議員が、以下を免除する法案を議会に提出しました。\n50ドル以下の暗号取引は暗号税が免除されるという法案を議会に提出しました。暗号の採用を維持しながら、暗号の適切な規制を推進する人たちが\n暗号の導入と政府の保護を平等に維持しながら、暗号の正しい規制を推進する人々がいるのは良いことです。\nを平等に保護しながら、Cryptoの正しい規制を推進する人たちがいるのは良いことです。\n\n暗号はダメだと言う人もいるかもしれませんが...",
      "title": "米国上院議員、50ドル以下の暗号取引は課税対象外とする法案を提出。正しい方向へのもう一つのステップ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就在刚才，两位美国参议员向国会提出了一项法案，将豁免\n50美元以下的加密货币交易免于征收加密货币税。很高兴看到一些人推动\n对加密货币的正确监管，同时保持加密货币的采用和政府\n保护同样受到关注。\n\n有些人可能会说，没有加密货币...",
      "title": "美国参议员提出法案，将50美元以下的加密货币交易排除在税收之外。朝着正确方向迈出的又一步。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就在剛纔，兩位美國參議員向國會提出了一項法案，將豁免\n50美元以下的加密貨幣交易免於徵收加密貨幣稅。很高興看到一些人推動\n對加密貨幣的正確監管，同時保持加密貨幣的採用和政府\n保護同樣受到關注。\n\n有些人可能會說，沒有加密貨幣...",
      "title": "美國參議員提出法案，將50美元以下的加密貨幣交易排除在稅收之外。朝着正確方向邁出的又一步。"
    }
  ]
}