{
  "author": "winterchillz",
  "the_new_excerpt": "And an optional follow-up question - we have days when we feel focused and\nenergetic and can take on a variety of different tasks, both physical and\nmental, throughout the day but we also have days when we feel like we can't get\nout of bed. What causes this and why do we sometimes \"wake up\" after a…",
  "original_created_utc": 1610715816,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "还有一个可选的后续问题--我们有的时候会觉得自己很专心，而且会觉得自己是个好孩子。\n精力充沛，可以承担各种不同的任务，包括体力和精力。\n精神，一整天，但我们也有几天，当我们觉得我们不能得到的。\n下床。是什么原因造成的，为什么我们有时会在 \"醒来 \"后...",
      "title": "人体中的能量储存在哪里，如何储存？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "還有一個可選的後續問題--我們有的時候會覺得自己很專心，而且會覺得自己是個好孩子。\n精力充沛，可以承擔各種不同的任務，包括體力和精力。\n精神，一整天，但我們也有幾天，當我們覺得我們不能得到的。\n下牀。是什麼原因造成的，爲什麼我們有時會在 \"醒來 \"後...",
      "title": "人體中的能量儲存在哪裏，如何儲存？"
    }
  ],
  "title": "Where and how is energy stored in the body?",
  "created_utc": 1610773240,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>And an optional follow-up question - we have days when we feel focused and energetic and can take on a variety of different tasks, both physical and mental, throughout the day but we also have days when we feel like we can&#39;t get out of bed. What causes this and why do we sometimes &quot;wake up&quot; after a cup of coffee or an energy drink? Is energy something specifically definable and do we expend the same energy capacity for both physical and mental tasks?</p>\n\n<p>Edit: Since the sub rules disallow off-topic comments, I just wanted to express my gratitude to everyone who hopped on and explained how the whole thing works! Even if I can&#39;t quite understand all the terms and processes, it&#39;s extremely interesting to learn how our body works. :)</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/askscience/comments/kxu48p/where_and_how_is_energy_stored_in_the_body/",
  "subreddit": "askscience",
  "id": "kxu48p",
  "is_self": true,
  "media": null,
  "is_video": false
}