{
  "author": "throwmyselfaway53",
  "the_new_excerpt": "There's been an influx of successes and high returns posted in this recent\nmarket, and whenever I look at these posts, I tend to get upset about missing\nthese opportunities. My heart sinks whenever I see another post about how\nsomeone retired early due to an early TSLA stock or how they paid off…",
  "original_created_utc": 1610164852,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在最近的这段时间里，有大量的成功和高额回报涌入\n市场，每当我看到这些帖子时，我往往会因为错过了而感到不安\n这些机会。每当我看到另一篇关于如何\n有人因为早期的特斯拉股票或他们如何偿还…而提前退休",
      "title": "我该如何处理嫉妒和错失的机会？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在最近的這段時間裏，有大量的成功和高額回報湧入\n市場，每當我看到這些帖子時，我往往會因爲錯過了而感到不安\n這些機會。每當我看到另一篇關於如何\n有人因爲早期的特斯拉股票或他們如何償還…而提前退休",
      "title": "我該如何處理嫉妒和錯失的機會？"
    }
  ],
  "title": "How do I handle jealousy and missed opportunities?",
  "created_utc": 1610178980,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There&#39;s been an influx of successes and high returns posted in this recent market, and whenever I look at these posts, I tend to get upset about missing these opportunities. My heart sinks whenever I see another post about how someone retired early due to an early TSLA stock or how they paid off their mortgage because of BTC or AMZN or whatever. I want to desperately have an opportunity like that.</p>\n\n<p>I&#39;ve been mildly interested in investing for a while, but I&#39;m a poor 19-year-old university student so I have pretty much no stable income and a severe lack of knowledge in investing. I want to invest now because of these posts, but I know I reasonably shouldn&#39;t because I&#39;d be investing with my emotions, I only have around $5,000 in my bank account and no stable income is coming in.</p>\n\n<p>How do I handle this FOMO and this jealousy?</p>\n</div><!-- SC_ON -->",
  "score": 808,
  "permalink": "/r/investing/comments/ktjf6b/how_do_i_handle_jealousy_and_missed_opportunities/",
  "subreddit": "investing",
  "id": "ktjf6b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706378033
}