{
  "author": "tafor83",
  "original_created_utc": 1645462032,
  "title": "Crypto Is Not Decentralized",
  "created_utc": 1645483217,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is really aimed specifically at the BTC maxis, but holds true for pretty much every project out there. Decentralization was the point, right? Well, it didn&amp;#39;t work.&lt;/p&gt;\n\n&lt;p&gt;Using BTC as the example: the proof of work concept points it towards a decentralized concept - but in actual practice, it&amp;#39;s not. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/baqvw45sq7j81.png?width=1172&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=c367e68a3056e16d53b28ddd3ff8add662fddf58\"&gt; Pool Distribution &lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;FOUR MINERS CONTROL 53% OF BITCOIN&amp;#39;S HASHING POWER.&lt;/p&gt;\n\n&lt;p&gt;What this shows is that there is a preferred nature to progression - and it&amp;#39;s actively at odds with the concept of decentralization. BTC set an incredibly high bar for hashing while holding appeal for people to try it. The issue is that the for the common person, BTC mining is cost prohibitive. So, what do people naturally do when something is cost prohibitive? &lt;em&gt;They pool their resources&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;Which, normally, works out great! Except that&amp;#39;s the exact &lt;em&gt;opposite&lt;/em&gt; of what the mission was: decentralization. Pooling resources is literally &lt;em&gt;centralization&lt;/em&gt;. By removing the individual autonomy of participants - the original targeted democratic governance is reduced to an oligopoly.&lt;/p&gt;\n\n&lt;p&gt;Almost every single thing people love about crypto - the exploding value, the decentralization, etc., is all fundamentally undercut by the processes you use to exploit it. &lt;/p&gt;\n\n&lt;p&gt;How do you buy BTC? We used to buy it P2P. Now, the most common outlet is a CEX. From decentralized - to centralized. CEXs are nothing but &lt;em&gt;pooled resources&lt;/em&gt;. &lt;/p&gt;\n\n&lt;p&gt;So, when people claim BTC is &amp;#39;decentralized&amp;#39; all I can do is laugh. It&amp;#39;s a network dominated by four entities and entirely reliant on centralized exchanges. That&amp;#39;s why it is what it is today. BTC doesn&amp;#39;t hit $30k, 40k+ without massive money coming in - and that money is, surprise... pooled. &lt;em&gt;That&amp;#39;s what institutional investments are&lt;/em&gt;: &lt;em&gt;pooled resources&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;BTC had an incredible vision - but the reality is, it has been entirely usurped - and largely by the same people that still sing it&amp;#39;s original vision as if that&amp;#39;s somehow what made it what it is today. Which is simple not true.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 347,
  "permalink": "/r/CryptoCurrency/comments/sxy32g/crypto_is_not_decentralized/",
  "subreddit": "CryptoCurrency",
  "id": "sxy32g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This is really aimed specifically at the BTC maxis, but holds true for pretty\nmuch every project out there. Decentralization was the point, right? Well, it\ndidn't work.\n\nUsing BTC as the example: the proof of work concept points it towards a\ndecentralized concept - but in actual practice, it's…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは特にBTCのマキシを対象にしていますが、かなりの確率で当てはまります。\nあらゆるプロジェクトで 分散化がポイントでしたよね？しかし、それは\nうまくいかなかった。\n\nBTCを例にとると：プルーフ・オブ・ワークのコンセプトが指し示すのは\n分散型のコンセプトですが、実際には......。",
      "title": "暗号は非中央集権的ではない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这实际上是专门针对BTC maxis的，但对几乎所有的项目都是如此。\n但几乎所有的项目都是如此。去中心化是重点，对吗？嗯，它\n它没有发挥作用。\n\n以BTC为例：工作证明的概念将其指向一个\n去中心化的概念 - 但在实际操作中，它...",
      "title": "加密货币不是去中心化的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這實際上是專門針對BTC maxis的，但對幾乎所有的項目都是如此。\n但幾乎所有的項目都是如此。去中心化是重點，對嗎？嗯，它\n它沒有發揮作用。\n\n以BTC爲例：工作證明的概念將其指向一個\n去中心化的概念 - 但在實際操作中，它...",
      "title": "加密貨幣不是去中心化的"
    }
  ]
}