{
  "author": "FeatheryGale",
  "original_created_utc": 1651395974,
  "title": "How do I politely tell the owner of the gym I go to that his pet fish is dying?",
  "created_utc": 1651411035,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I go to a gym. In said gym, there&amp;#39;s a VERY small tank that houses a very sick Betta fish. The tank is filthy and has no filtration whatsoever. It doesn&amp;#39;t take a fish expert to see that this fish is dying. I have a tank at home and whenever I go to the gym and see the Betta, all I want to do is save it. &lt;/p&gt;\n\n&lt;p&gt;How do I politely tell the gym owner that his fish is dying and offer to take it?&lt;/p&gt;\n\n&lt;p&gt;P.s before you tell me, no I am not going to just steal the fish.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/ufvz6i/how_do_i_politely_tell_the_owner_of_the_gym_i_go/",
  "subreddit": "TooAfraidToAsk",
  "id": "ufvz6i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So I go to a gym. In said gym, there's a VERY small tank that houses a very sick\nBetta fish. The tank is filthy and has no filtration whatsoever. It doesn't take\na fish expert to see that this fish is dying. I have a tank at home and whenever\nI go to the gym and see the Betta, all I want to do is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで、あるスポーツジムに通っています。そのジムにはとても小さな水槽があり、そこにはとても病気の\nベタフィッシュがいる。水槽は不潔で、何の濾過もされていない。魚の専門家でなくとも\n魚の専門家でなくても、この魚が死んでいくのがわかる。私は家に水槽があるのですが、ジムに行くたびに\nジムに行ってベタを見るたびに、やりたいことは......。",
      "title": "通っているジムのオーナーに、ペットの魚が死んでしまったと丁寧に伝えるにはどうしたらいいでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我去了一个健身房。在这个健身房里，有一个非常小的鱼缸，里面有一条病得很重的\n贝塔鱼。这个鱼缸很脏，没有任何过滤功能。不需要\n鱼类专家也能看出这条鱼正在死亡。我在家里有一个鱼缸，每当\n我去健身房看到贝塔鱼，我想做的就是...",
      "title": "我如何礼貌地告诉我去的健身房的老板，他的宠物鱼快死了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我去了一個健身房。在這個健身房裏，有一個非常小的魚缸，裏面有一條病得很重的\n貝塔魚。這個魚缸很髒，沒有任何過濾功能。不需要\n魚類專家也能看出這條魚正在死亡。我在家裏有一個魚缸，每當\n我去健身房看到貝塔魚，我想做的就是...",
      "title": "我如何禮貌地告訴我去的健身房的老闆，他的寵物魚快死了？"
    }
  ]
}