{
  "author": "chadtr5",
  "the_new_excerpt": "Over the course of US history, the majority\n[https://www.pewresearch.org/fact-tank/2017/03/20/what-backgrounds-do-u-s-supreme-court-justices-have/]\nof Supreme Court justices have held elected office and few (less than a quarter)\nhave previously been federal appellate judges. Many SCOTUS justices in…",
  "original_created_utc": 1620058103,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アメリカの歴史を振り返ると、大多数の\n[https://www.pewresearch.org/fact-tank/2017/03/20/what-backgrounds-do-u-s-supreme-court-justices-have/]\n最高裁判事の大半は選挙で選ばれた職に就いており、連邦控訴裁判所の判事を務めたことのある人はほとんどいません（4分の1以下）。\n連邦控訴裁判事を務めたことのある者は4分の1以下である。多くのSCOTUS判事は...",
      "title": "サンドラ・デイ・オコナー（1981年）までに任命された最高裁判事の大半は、公職に就いていました。連邦判事の経験者はほとんどいませんでした。1981年以降は、選挙で選ばれた元議員は一人も任命されておらず、ほぼ全員が連邦判事となっている。何が変わったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在美国历史上，大多数人\n[https://www.pewresearch.org/fact-tank/2017/03/20/what-backgrounds-do-u-s-supreme-court-justices-have/]\n最高法院的大多数法官都担任过民选职务，很少有人（不到四分之一）曾经担任过联邦上诉法官。\n以前曾是联邦上诉法官。许多上海合作组织的法官在...",
      "title": "在桑德拉-戴-奥康纳（Sandra Day O'Connor，1981年）之前，大多数被任命的最高法院法官都曾担任过选举职务。很少有人曾担任过联邦法官。自1981年以来，没有前民选官员被任命为法院法官，几乎所有被任命者都是联邦法官。是什么改变了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在美國曆史上，大多數人\n[https://www.pewresearch.org/fact-tank/2017/03/20/what-backgrounds-do-u-s-supreme-court-justices-have/]\n最高法院的大多數法官都擔任過民選職務，很少有人（不到四分之一）曾經擔任過聯邦上訴法官。\n以前曾是聯邦上訴法官。許多上海合作組織的法官在...",
      "title": "在桑德拉-戴-奧康納（Sandra Day O'Connor，1981年）之前，大多數被任命的最高法院法官都曾擔任過選舉職務。很少有人曾擔任過聯邦法官。自1981年以來，沒有前民選官員被任命爲法院法官，幾乎所有被任命者都是聯邦法官。是什麼改變了？"
    }
  ],
  "title": "The majority of Supreme Court justices appointed up to Sandra Day O'Connor (1981) had held elected office. Few had been federal judges. Since 1981, no former elected officials have been appointed to the court and nearly all appointees have been federal judges. What changed?",
  "created_utc": 1620114233,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Over the course of US history, the <a href=\"https://www.pewresearch.org/fact-tank/2017/03/20/what-backgrounds-do-u-s-supreme-court-justices-have/\">majority</a> of Supreme Court justices have held elected office and few (less than a quarter) have previously been federal appellate judges. Many SCOTUS justices in the past had also held significant positions elsewhere in the government.  Since Sandra Day O&#39;Connor in 1981, however, no person with elected experience has been appointed to the court.  And today 8 out of 9 justices were previously federal appellate judges.</p>\n\n<p>If you look at the biographies of the 17 Chief Justices, the difference is really striking. The most recent three justices (Burger, Rehnquist, Roberts) all came from prior judicial positions. Before that, a judicial background was quite rare and most chief justices had previously held high office (of the 14, you have 3 secretaries of state, 3 secretaries of the Treasury, a President, a Senator, a Governor, and only three with judicial backgrounds). The pattern seems to be generally the same with associate justices.</p>\n\n<p>So far as I can tell, the shift happened around the time of the Nixon administration. Since Nixon, presidents have nominated 17 justices of whom 13 were previously federal appellate judges. Of the 17 justices nominated immediately prior to Nixon, only 5 were previously federal appellate judges and the experience is very diverse and more likely past history (Cabinet Secretaries, Senators, etc.). So what happened?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/n3zy5o/the_majority_of_supreme_court_justices_appointed/",
  "subreddit": "AskHistorians",
  "id": "n3zy5o",
  "is_self": true,
  "media": null,
  "is_video": false
}