{
  "author": "tim_a_st",
  "original_created_utc": 1624946839,
  "title": "If you had 1k to invest today in crypto, what would you buy? What would you steer clear of?",
  "created_utc": 1624991549,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know this is a rather paltry amount for some, but am curious to hear what the community has to say. I am rather new to crypto, and have been investing small amounts on a weekly basis. My plan is to reach 1k of extra savings over the next 2 months and then invest that larger sum. I have currently been buying ETH, ATOM and ADA. I look forward to hearing your choices!</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/oa2dat/if_you_had_1k_to_invest_today_in_crypto_what/",
  "subreddit": "CryptoCurrency",
  "id": "oa2dat",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know this is a rather paltry amount for some, but am curious to hear what the\ncommunity has to say. I am rather new to crypto, and have been investing small\namounts on a weekly basis. My plan is to reach 1k of extra savings over the next\n2 months and then invest that larger sum. I have currently…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、ある人にとってはかなり少ない金額だと思いますが、コミュニティの意見を聞いてみたいと思います。\nコミュニティの意見を聞いてみたいです。私は暗号化にはあまり馴染みがなく、毎週少額ずつ投資しています。\n少額を週単位で投資しています。私の計画は、今後2年間で1,000ドルの追加貯蓄を達成することです。\n私の計画は、今後2ヶ月間で1,000ドルの余分な貯蓄を達成してから、その大金を投資することです。現在、私は...",
      "title": "もし今日、暗号に投資するために1kを持っていたら、何を買いますか？また、何を避けますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道这对一些人来说是一个相当微不足道的数额，但我很想听听社区的人怎么说。\n社区有什么意见。我是加密货币的新手，每周都有少量的投资。\n每周投资少量资金。我的计划是在未来2个月内达到1千美元的额外储蓄，然后将这些钱用于投资。\n2个月，然后投资这笔大额资金。我目前已经...",
      "title": "如果你今天有1千美元投资于加密货币，你会买什么？你会避开什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道這對一些人來說是一個相當微不足道的數額，但我很想聽聽社區的人怎麼說。\n社區有什麼意見。我是加密貨幣的新手，每週都有少量的投資。\n每週投資少量資金。我的計劃是在未來2個月內達到1千美元的額外儲蓄，然後將這些錢用於投資。\n2個月，然後投資這筆大額資金。我目前已經...",
      "title": "如果你今天有1千美元投資於加密貨幣，你會買什麼？你會避開什麼？"
    }
  ]
}