{
  "author": "Pupulikjan",
  "original_created_utc": 1637279442,
  "title": "If you are the Bitcoin guy at work.",
  "created_utc": 1637314645,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I’m sure I’m not the only “Bitcoin guy” at work who been telling their coworkers to buy since freaking 2017. Anyway here’s a tip for  dip days like today. </p>\n\n<p>There will almost always be that person at work who will approach you during days Bitcoin is down and say some shut like “ How’s Bitcoin doing today? I heard it was dropping” or something in that context. Always reply in a excited/jolly tone with “I know! How awesome is that right? Now I can buy more!” </p>\n\n<p>This will show people who are doubtful how confident you are in Bitcoin. Might even get them more interested in it as well. Idk I did that today and a couple of other coworkers overheard and started asking questions about Bitcoin. Good way to make those Bitcoin lurkers who try to talk shit on red days feel powerless and spread knowledge, lmk what y’all think.</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/Bitcoin/comments/qx31cy/if_you_are_the_bitcoin_guy_at_work/",
  "subreddit": "Bitcoin",
  "id": "qx31cy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I’m sure I’m not the only “Bitcoin guy” at work who been telling their\ncoworkers to buy since freaking 2017. Anyway here’s a tip for dip days like\ntoday.\n\nThere will almost always be that person at work who will approach you during\ndays Bitcoin is down and say some shut like “ How’s Bitcoin doing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "職場の「ビットコイン野郎」で、同僚に「F1から買いましょう」と言っているのは私だけではないと思います。\n同僚に2017年の初めから買えと言っていたのは私だけではないはずです。とにかく、今日のようなディップの日のためのヒントです。\n今日のようなディップの日のためのヒントです。\n\n職場には、ビットコインが下がっているときにあなたに近づいてきて\nビットコインが下がっている時にあなたに近づいてきて、「ビットコインはどうしているんだろう...」みたいなことを言う人が職場には必ずいます。",
      "title": "職場のビットコイン担当者の場合"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我相信我不是工作中唯一的 \"比特币人\"，他们从该死的2017年开始就告诉他们的同事要购买比特币。\n同事们从2017年就开始买入。总之，这里有一个小贴士，比如在下跌的日子里\n今天的提示。\n\n在工作中，几乎总是会有那么一个人在比特币下跌的日子里接近你，并说\n在比特币下跌的日子里接近你，说一些类似 \"比特币怎么样了...... \"的话。",
      "title": "如果你是工作中的Bitcoin人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我相信我不是工作中唯一的 \"比特幣人\"，他們從該死的2017年開始就告訴他們的同事要購買比特幣。\n同事們從2017年就開始買入。總之，這裏有一個小貼士，比如在下跌的日子裏\n今天的提示。\n\n在工作中，幾乎總是會有那麼一個人在比特幣下跌的日子裏接近你，並說\n在比特幣下跌的日子裏接近你，說一些類似 \"比特幣怎麼樣了...... \"的話。",
      "title": "如果你是工作中的Bitcoin人。"
    }
  ]
}