{
  "author": "Snoo65810",
  "original_created_utc": 1634463172,
  "title": "People are making Millions in Crypto because they already have several thousands to start with!",
  "created_utc": 1634474003,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You may see and hear the stories of these Crypto millionaires, and how they came upon their riches time and time again in the media. </p>\n\n<p>I am sorry to say but to make serious money in Crypto, you need to have a lot of money invested and not just a $100…</p>\n\n<p>I see plenty of retail investors get discouraged seeing Crypto money being flaunted by kids and celebrities online. </p>\n\n<p>They don’t understand the principle of “money makes money”</p>\n\n<p>This goes for miners too as there were these 14 year old kids in the news recently for making 30k a month. </p>\n\n<p>What most don’t know is the fact that their already wealthy families purchased the required equipment for them which costs thousands of dollars. The fact that the media will leave out critical details like this is very worrying.</p>\n</div><!-- SC_ON -->",
  "score": 615,
  "permalink": "/r/CryptoCurrency/comments/q9vhv4/people_are_making_millions_in_crypto_because_they/",
  "subreddit": "CryptoCurrency",
  "id": "q9vhv4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "You may see and hear the stories of these Crypto millionaires, and how they came\nupon their riches time and time again in the media.\n\nI am sorry to say but to make serious money in Crypto, you need to have a lot of\nmoney invested and not just a $100…\n\nI see plenty of retail investors get discouraged…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号の大富豪たちの話や、彼らがどのようにして金持ちになったのかという話は、メディアで何度も見聞きしていることでしょう。\nメディアで何度も何度もその富を手に入れた話を見聞きすることがあります。\n\n申し訳ありませんが、Cryptoで本格的に儲けるには、10ドルではなく、多額の資金を投資する必要があります。\n100ドルではなく、大金を投資する必要があります。\n\n多くの個人投資家が落胆しているのを目の当たりにします...。",
      "title": "人々がCryptoで何百万ドルも稼いでいるのは、最初に数千ドルをすでに持っているからです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你可能会看到和听到这些加密货币百万富翁的故事，以及他们是如何一次又一次地获得财富的。\n他们是如何在媒体上一次又一次地获得财富的。\n\n我很抱歉地说，但要在加密货币中赚大钱，你需要有大量的投资，而不仅仅是100美元。\n投资，而不仅仅是100美元......\n\n我看到很多散户投资者感到气馁...",
      "title": "人们在加密货币中赚取数百万美元，因为他们已经有了几千美元的启动资金!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你可能會看到和聽到這些加密貨幣百萬富翁的故事，以及他們是如何一次又一次地獲得財富的。\n他們是如何在媒體上一次又一次地獲得財富的。\n\n我很抱歉地說，但要在加密貨幣中賺大錢，你需要有大量的投資，而不僅僅是100美元。\n投資，而不僅僅是100美元......\n\n我看到很多散戶投資者感到氣餒...",
      "title": "人們在加密貨幣中賺取數百萬美元，因爲他們已經有了幾千美元的啓動資金!"
    }
  ]
}