{
  "author": "SkepticalCryptoDude",
  "original_created_utc": 1646780888,
  "title": "Getting rich can’t be this easy can it?",
  "created_utc": 1646830243,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Everyone says that bear markets make millionaires. Simply buy the dip, keep buying when it dips lower, and when it completely flatlines buy more. Then, hold until the bull market comes and reap massive gains. &lt;/p&gt;\n\n&lt;p&gt;It can’t be this easy can it?… can it? \nI’m pretty happy with the projects I’m invested in, and my average buy ins are pretty far from all time highs. If I keep accumulating when it dips, will I just be rich if I hold? Seems way too good to be true. &lt;/p&gt;\n\n&lt;p&gt;I’m hoping it is this easy though. Knowing my luck crypto will never recover, but of course most likely it will one day. &lt;/p&gt;\n\n&lt;p&gt;What do you think? Is it really that easy as buying low, and holding?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 322,
  "permalink": "/r/CryptoCurrency/comments/t9thxs/getting_rich_cant_be_this_easy_can_it/",
  "subreddit": "CryptoCurrency",
  "id": "t9thxs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Everyone says that bear markets make millionaires. Simply buy the dip, keep\nbuying when it dips lower, and when it completely flatlines buy more. Then, hold\nuntil the bull market comes and reap massive gains.\n\nIt can’t be this easy can it?… can it? I’m pretty happy with the projects I’m\ninvested…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "弱気相場は大富豪を生むと誰もが言う。単に急落を買い、そのまま\n下がったら買い、完全に横ばいになったら買い増し。そして、そのまま\n強気相場が来るまでの間、大きな利益を得ることができます。\n\nこんなに簡単なことはないだろう......そうだろう？私は、自分のプロジェクトにかなり満足しています。\n投資している...",
      "title": "金持ちになるのは、こんなに簡単なことではないはずだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家都说，熊市能造就百万富翁。只需在下跌时买入，继续\n当它下跌时继续买入，当它完全持平时买入更多。然后，持有\n直到牛市来临，获得巨大收益。\n\n不可能这么容易吧？......是吗？我对我投资的项目非常满意\n投资的项目很满意......。",
      "title": "致富不可能这么容易吧？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家都說，熊市能造就百萬富翁。只需在下跌時買入，繼續\n當它下跌時繼續買入，當它完全持平時買入更多。然後，持有\n直到牛市來臨，獲得巨大收益。\n\n不可能這麼容易吧？......是嗎？我對我投資的項目非常滿意\n投資的項目很滿意......。",
      "title": "致富不可能這麼容易吧？"
    }
  ]
}