{
  "author": "Many_Scratch2269",
  "original_created_utc": 1638366894,
  "title": "The government should not tax and profit from Crypto while claiming it is worthless.",
  "created_utc": 1638394026,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Not whining, just an honest question since I live in a country with no Crypto taxes. Considering what the Politicians, the SEC and the bankers say about Cryptocurrencies,  it should be pretty clear that Cryptocurrencies hold NO value whatsoever. They consider it to be a worthless and useless asset.&lt;/p&gt;\n\n&lt;p&gt;If that&amp;#39;s true, then why do people have to pay taxes on Crypto? People should not be paying any taxes for holding a useless asset. The same politicians and government bankers who call Crypto worthless receive a part of their paycheck from taxes collected from Crypto. It is clearly hypocritical to tax Cryptocurrencies and profit from it while calling it worthless at the same time.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 2223,
  "permalink": "/r/CryptoCurrency/comments/r6f9qh/the_government_should_not_tax_and_profit_from/",
  "subreddit": "CryptoCurrency",
  "id": "r6f9qh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Not whining, just an honest question since I live in a country with no Crypto\ntaxes. Considering what the Politicians, the SEC and the bankers say about\nCryptocurrencies, it should be pretty clear that Cryptocurrencies hold NO value\nwhatsoever. They consider it to be a worthless and useless…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は暗号のない国に住んでいるので、泣き言ではなく、ただ正直な質問です。\n税金 政治家、SEC、銀行家が言うことを考慮すると\n暗号通貨は何の価値もないことは明らかです。\nということです。彼らはそれを無価値で無駄なものだと考えています...",
      "title": "政府は、Cryptoに価値がないと主張しながら、Cryptoに課税して利益を得るべきではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不是抱怨，只是一个诚实的问题，因为我生活在一个没有加密货币的国家。\n税。考虑到政客、美国证券交易委员会和银行家们对加密货币的看法\n加密货币，应该很清楚，加密货币不具备任何价值\n什么都没有。他们认为这是一个没有价值和无用的...",
      "title": "政府不应该对加密货币征税并从中获利，同时声称它毫无价值。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不是抱怨，只是一個誠實的問題，因爲我生活在一個沒有加密貨幣的國家。\n稅。考慮到政客、美國證券交易委員會和銀行家們對加密貨幣的看法\n加密貨幣，應該很清楚，加密貨幣不具備任何價值\n什麼都沒有。他們認爲這是一個沒有價值和無用的...",
      "title": "政府不應該對加密貨幣徵稅並從中獲利，同時聲稱它毫無價值。"
    }
  ]
}