{
  "author": "Antarctic_Banana",
  "original_created_utc": 1642769197,
  "title": "We can officially stop looking at 5 minute charts or 1 hour charts or 1 day charts cause it will take weeks or months to recover",
  "created_utc": 1642793635,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am trying to see a positive thing in whats happening now, and my experience with stocks in the past showed me. Bear markets at least are good for getting your life back and stop being agitated or excited about your money, cause its down anyway lol.&lt;/p&gt;\n\n&lt;p&gt;With bitcoin going down to 30k we wont see any all time high soon, so we wont miss lifechanging money or crazy altcoin pumps, cause they wont happen.&lt;/p&gt;\n\n&lt;p&gt;So just make some coin alerts, for example i set btc for 30k and 50k and also for the other two coins i own, ETH and TRAC, and try to enjoy life, forget about your crypto and just stop looking at charts. nothing now will happen within 5 minutes or 1 hours that changes the sentiment.&lt;/p&gt;\n\n&lt;p&gt;Cause overally, its a market problem, not a crypto problem. Crypto is doing fine, but there are so many red flags rooming, that the market is worried, and the market is an old beast, it moves slowly, so enjoy the spring and the summer, try to read up about crypto, follow the news once or twice a day but stop looking at charts. Your wife and kids will say thank you and you will have a better sleep.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 307,
  "permalink": "/r/CryptoCurrency/comments/s99yer/we_can_officially_stop_looking_at_5_minute_charts/",
  "subreddit": "CryptoCurrency",
  "id": "s99yer",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am trying to see a positive thing in whats happening now, and my experience\nwith stocks in the past showed me. Bear markets at least are good for getting\nyour life back and stop being agitated or excited about your money, cause its\ndown anyway lol.\n\nWith bitcoin going down to 30k we wont see any…"
}