{
  "author": "Antarctic_Banana",
  "original_created_utc": 1642769197,
  "title": "We can officially stop looking at 5 minute charts or 1 hour charts or 1 day charts cause it will take weeks or months to recover",
  "created_utc": 1642793635,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am trying to see a positive thing in whats happening now, and my experience with stocks in the past showed me. Bear markets at least are good for getting your life back and stop being agitated or excited about your money, cause its down anyway lol.&lt;/p&gt;\n\n&lt;p&gt;With bitcoin going down to 30k we wont see any all time high soon, so we wont miss lifechanging money or crazy altcoin pumps, cause they wont happen.&lt;/p&gt;\n\n&lt;p&gt;So just make some coin alerts, for example i set btc for 30k and 50k and also for the other two coins i own, ETH and TRAC, and try to enjoy life, forget about your crypto and just stop looking at charts. nothing now will happen within 5 minutes or 1 hours that changes the sentiment.&lt;/p&gt;\n\n&lt;p&gt;Cause overally, its a market problem, not a crypto problem. Crypto is doing fine, but there are so many red flags rooming, that the market is worried, and the market is an old beast, it moves slowly, so enjoy the spring and the summer, try to read up about crypto, follow the news once or twice a day but stop looking at charts. Your wife and kids will say thank you and you will have a better sleep.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 307,
  "permalink": "/r/CryptoCurrency/comments/s99yer/we_can_officially_stop_looking_at_5_minute_charts/",
  "subreddit": "CryptoCurrency",
  "id": "s99yer",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am trying to see a positive thing in whats happening now, and my experience\nwith stocks in the past showed me. Bear markets at least are good for getting\nyour life back and stop being agitated or excited about your money, cause its\ndown anyway lol.\n\nWith bitcoin going down to 30k we wont see any…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は今起きていることをポジティブに捉えようと思っています。\n過去の株でわかったこと。少なくとも弱気相場は\nを、煽ったり、興奮したりするのは止めましょう。\nどうせダウンだし(笑)。\n\nビットコインが30kまで下がるので、何も見られませんが...。",
      "title": "5分足や1時間足、1日足などのチャートを見るのはやめて、数週間から数ヶ月で回復させる必要がある。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我试图从现在发生的事情中看到一个积极的东西，我过去的股票经验告诉我\n过去的股票经验告诉我。熊市至少对恢复你的生活有好处\n你的生活，并停止对你的钱感到激动或兴奋，因为它的\n因为它反正也在下跌。\n\n随着比特币下跌到30K，我们不会看到任何...",
      "title": "我们可以正式停止查看5分钟图或1小时图或1天图，因为这需要几周或几个月的时间来恢复。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我試圖從現在發生的事情中看到一個積極的東西，我過去的股票經驗告訴我\n過去的股票經驗告訴我。熊市至少對恢復你的生活有好處\n你的生活，並停止對你的錢感到激動或興奮，因爲它的\n因爲它反正也在下跌。\n\n隨着比特幣下跌到30K，我們不會看到任何...",
      "title": "我們可以正式停止查看5分鐘圖或1小時圖或1天圖，因爲這需要幾周或幾個月的時間來恢復。"
    }
  ]
}