{
  "author": "nams0",
  "the_new_excerpt": "> GameStop disclosed on April 5, 2021 that it had filed a prospectus supplement\n> with the U.S. Securities and Exchange Commission to offer and sell up to a\n> maximum of 3,500,000 shares of its common stock from time to time through the\n> ATM Offering. The Company ultimately sold 3,500,000 shares of…",
  "original_created_utc": 1619471654,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "> GameStop社は、2021年4月5日に目論見書補完書を米国証券取引委員会に提出したことを開示しました。\n> を米国証券取引委員会に提出しました。\n> 米国証券取引委員会に目論見書を提出したことを公表しました。\n> ATM募集。当社は、最終的に3,500,000株の...",
      "title": "GameStop社、市場での株式公開プログラムを完了"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "> GameStop于2021年4月5日披露，它已经向美国证券交易委员会提交了一份招股说明书补充文件。\n> 向美国证券交易委员会提交了一份招股说明书补充文件，以便不时地发行和出售最多\n> 通过 \"ATM发行 \"不时地发行和出售最多350万股普通股。\n> ATM发行。该公司最终出售了3,500,000股...",
      "title": "GameStop完成了市场上的股票发行计划"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> GameStop於2021年4月5日披露，它已經向美國證券交易委員會提交了一份招股說明書補充文件。\n> 向美國證券交易委員會提交了一份招股說明書補充文件，以便不時地發行和出售最多\n> 通過 \"ATM發行 \"不時地發行和出售最多350萬股普通股。\n> ATM發行。該公司最終出售了3,500,000股...",
      "title": "GameStop完成了市場上的股票發行計劃"
    }
  ],
  "title": "GameStop Completes At-The-Market Equity Offering Program",
  "created_utc": 1619479398,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p>GameStop disclosed on April 5, 2021 that it had filed a prospectus supplement with the U.S. Securities and Exchange Commission to offer and sell up to a maximum of 3,500,000 shares of its common stock from time to time through the ATM Offering. The Company ultimately sold 3,500,000 shares of common stock and generated aggregate gross proceeds before commissions and offering expenses of approximately $551,000,000. Net proceeds will be used to continue accelerating GameStop’s transformation as well as for general corporate purposes and further strengthening the Company’s balance sheet.</p>\n</blockquote>\n\n<p>This is amazing news. GME sold 3.5 mil shares at ~$157 to raise 550 mil. The company has zero debt and now has signicant money to fund their transformation moving forward. Stock is currently up 12% in AH, reaching $190. GME is now primed for another run and the highly anticipated short squeeze is that much closer to reality. </p>\n\n<p><a href=\"https://gamestop.gcs-web.com/news-releases/news-release-details/gamestop-completes-market-equity-offering-program\">https://gamestop.gcs-web.com/news-releases/news-release-details/gamestop-completes-market-equity-offering-program</a></p>\n</div><!-- SC_ON -->",
  "score": 5563,
  "permalink": "/r/stocks/comments/mz87ma/gamestop_completes_atthemarket_equity_offering/",
  "subreddit": "stocks",
  "id": "mz87ma",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776216005
}