{
  "author": "partymsl",
  "original_created_utc": 1660135347,
  "title": "US-Inflation comes in at 8.5%, finally below estimates. Here is why that's really good for Crypto.",
  "created_utc": 1660150389,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just now, US CPI has offically been released and comes in at 8.5%. That&amp;#39;s a good margin below the estimates of 8.7% and massively below last month&amp;#39;s CPI of 9.1%. Markets will now probably start to rally. And that lower inflation was crucial for Crypto to continue its rally and expand it further on.&lt;/p&gt;\n\n&lt;p&gt;Also in my yesterday&amp;#39;s post about inflation numbers I layed out the scenario of a lower than 8.7% inflation and that will mostly happen now. &lt;/p&gt;\n\n&lt;p&gt;It has especially been important as the FED will have no arguement at all now to do a 100bps hike and weay be looking at a 50bps hike next month that could make markets pump even more as the FED is looking to pivot now. Who knows whether inflation has peaked now bit the US government will definitely make it market like that as we are going into Midterm elections. Crypto will have less moving forward from the FED and a reversal, at least for now, is actually possible.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 409,
  "permalink": "/r/CryptoCurrency/comments/wkwgmg/usinflation_comes_in_at_85_finally_below/",
  "subreddit": "CryptoCurrency",
  "id": "wkwgmg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Just now, US CPI has offically been released and comes in at 8.5%. That's a good\nmargin below the estimates of 8.7% and massively below last month's CPI of 9.1%.\nMarkets will now probably start to rally. And that lower inflation was crucial\nfor Crypto to continue its rally and expand it further…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちょうど今、アメリカの消費者物価指数が正式に発表され、8.5%となりました。これは予想値8.7%を大きく下回り\n予想値8.7％を大きく下回り、先月の9.1％を大きく下回りました。\n市場はおそらく、これから上昇に転じるだろう。そして、その低いインフレは、Cryptoが共同するために重要であった\nCryptoがラリーを続け、さらに拡大するために...。",
      "title": "米国のインフレ率は8.5％で、ついに予測を下回った。これがなぜCryptoにとって本当に良いことなのかを説明します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "刚才，美国CPI已经正式公布，为8.5%。这是一个很好的\n低于预期的8.7%，并大大低于上个月的9.1%的CPI。\n市场现在可能会开始反弹。而较低的通货膨胀率是关键\n对于加密货币继续其反弹并进一步扩大其范围至关重要...",
      "title": "美国通货膨胀率为8.5%，最终低于预期。以下是为什么这对加密货币来说真的很好。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "剛纔，美國CPI已經正式公佈，爲8.5%。這是一個很好的\n低於預期的8.7%，並大大低於上個月的9.1%的CPI。\n市場現在可能會開始反彈。而較低的通貨膨脹率是關鍵\n對於加密貨幣繼續其反彈並進一步擴大其範圍至關重要...",
      "title": "美國通貨膨脹率爲8.5%，最終低於預期。以下是爲什麼這對加密貨幣來說真的很好。"
    }
  ]
}