{
  "author": "Weaver96",
  "the_new_excerpt": "Didn't think that today would be the day of \"Don't panic\", \"This is just a minor\ndip\" and suicide hotline posts, but here we are. And what we see is a lot of\npeople panicking in the comments, or attempting to calm their own nerves by\ntelling you guys not to panic and waiting for reassurance in the…",
  "original_created_utc": 1614007301,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "没想到今天会是 \"不要慌\"、\"这只是一个小事 \"的日子。\n泡 \"和自杀热线的帖子，但我们在这里。而我们看到的是很多的\n人们在评论中惊慌失措，或试图通过平息自己的紧张情绪\n告诉你们不要惊慌，等待保证... ...",
      "title": "如果这次修正让你感到恐慌，那么你的投资已经超过了你能承受的损失。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "沒想到今天會是 \"不要慌\"、\"這只是一個小事 \"的日子。\n泡 \"和自殺熱線的帖子，但我們在這裏。而我們看到的是很多的\n人們在評論中驚慌失措，或試圖通過平息自己的緊張情緒\n告訴你們不要驚慌，等待保證... ...",
      "title": "如果這次修正讓你感到恐慌，那麼你的投資已經超過了你能承受的損失。"
    }
  ],
  "title": "If this correction made you panic, you've invested more than you can afford to lose.",
  "created_utc": 1614018722,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Didn&#39;t think that today would be the day of &quot;<em>Don&#39;t panic</em>&quot;, &quot;<em>This is just a minor dip</em>&quot; and suicide hotline posts, but here we are. And what we see is a lot of people panicking in the comments, or attempting to calm their own nerves by telling you guys not to panic and waiting for reassurance in the comments.</p>\n\n<p>This is why we always say to invest only what you can afford to lose. It&#39;s boring, but it&#39;s true. </p>\n\n<p>What I&#39;ve noticed is that many people here:</p>\n\n<ul>\n<li>Don&#39;t do their own research, don&#39;t care about tech,</li>\n<li>buy cryptos based on Youtuber&#39;s shilling videos,</li>\n<li>or based on shilling comments on Reddit, Discord, etc.,</li>\n<li>or even worse, pick coins based on names and logos,</li>\n<li>and expect to become millionares overnight. </li>\n</ul>\n\n<p>These people are here to gamble with, and not to invest in cryptocurrencies that one day might disrupt the global financial system.</p>\n\n<p>They must&#39;ve thought they are really smart and lucky with their gains these past few weeks. But in reality, if I asked my dog to pick 5 random coins from the 4th page of CoinMarketCap, I would&#39;ve made the same gains probably. </p>\n\n<p><strong>If today&#39;s price movement scared you, or made you panic, you&#39;re in deeper than you should be!</strong></p>\n</div><!-- SC_ON -->",
  "score": 1644,
  "permalink": "/r/CryptoCurrency/comments/lpqn3x/if_this_correction_made_you_panic_youve_invested/",
  "subreddit": "CryptoCurrency",
  "id": "lpqn3x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332879176
}