{
  "author": "SweetPie123",
  "the_new_excerpt": "Have people already forgotten what happened in the USA 2007-2008 and in the EU\nin 2009-2012 because of them? These banks screwed us willingly over causing the\nglobal economy almost to collapse in a matter of weeks if it wasn't for taxpayer\n(our) money to save them. Bitcoin was created so normal…",
  "original_created_utc": 1617199484,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "难道人们已经忘记了2007-2008年在美国和2009-2012年在欧盟发生的事情？\n在2009-2012年发生的事情？这些银行心甘情愿地坑害我们，造成了\n全球经济几乎在几周内就崩溃了，如果不是纳税人的\n(我们)的钱来拯救他们。比特币的创造是如此正常...",
      "title": "说真的，不要再为这些投资银行，如高盛和摩根大通，而感到困惑了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "難道人們已經忘記了2007-2008年在美國和2009-2012年在歐盟發生的事情？\n在2009-2012年發生的事情？這些銀行心甘情願地坑害我們，造成了\n全球經濟幾乎在幾周內就崩潰了，如果不是納稅人的\n(我們)的錢來拯救他們。比特幣的創造是如此正常...",
      "title": "說真的，不要再爲這些投資銀行，如高盛和摩根大通，而感到困惑了。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "2007年から2008年にかけて米国で、そしてEUで起こったことを、人々はもう忘れてしまったのでしょうか。\n2009年から2012年の間に、彼らのために？これらの銀行は私たちを進んで騙したのです。\nもし税金がなければ、世界経済は数週間で崩壊するところでした。\n(私たちの）お金で救われたのです。ビットコインは普通に作られたのに・・・。",
      "title": "ゴールドマン・サックスやJPモルガンのような投資銀行を甘く見るのはやめよう。"
    }
  ],
  "title": "Seriously, stop simping over these Investment Banks like Goldman Sachs and JPMorgan",
  "created_utc": 1617265924,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Have people already forgotten what happened in the USA 2007-2008 and in the EU in 2009-2012 because of them? These banks screwed us willingly over causing the global economy almost to collapse in a matter of weeks if it wasn&#39;t for taxpayer (our) money to save them. Bitcoin was created so normal citizens could protect themselves against these scummy people. Did they learn anything or was anything changed because of what happened? Of course not. Please stop cheering for them, they&#39;re 10x worse than Elon Musk having fun with Dogecoin or any Youtuber people hate in here.</p>\n\n<p><strong>Short summary:</strong></p>\n\n<p>These banks created one of the worst financial crisis since the Great Depression in the 30s. Banks gave money to anyone wanting to buy a house, even if their financial position was horrible to begin with. This of course created a bubble on the housing market with thousands and thousands of subprime loans. Refinancing your home at that time was no problem of course, add an adjustable-rate mortgage (interest rate cheap at the beginning expensive later) to the mix and you have recipe for disaster.  The housing market of course looked attractive for European and US based companies gobbling up these subprime loans, number only go up right? They bundled these trash loans in a CDO (Collateralized Debt Obligations ) and sold them off, of course knowing it was trash. </p>\n\n<p>Suddenly on one day the housing market started to collapse, too many houses were built and investors found out these AAA loans were actually trash. Who was betting against the housing market? Goldman Sachs of course, our little crypto friend. Other (investment) banks went broke as they had a shit ton of these financial products. Crisis flew over to Europe, creating the Eurocrisis. Lots of European countries still hold these subprime loans and are still getting bailed out by the European Central bank because they&#39;re otherwise bankrupt. </p>\n\n<p><strong>Aftermath :</strong> </p>\n\n<p><strong>-</strong> Jobless rate USA hitting 10%.</p>\n\n<p>- 170.000 families homeless in 2009 (USA).</p>\n\n<p>-Central banks purchased US$2.5 trillion of government debt and troubled private assets from banks</p>\n\n<p>- ultimately purchasing $1.5 trillion newly issued preferred stock in major banks</p>\n\n<p>- The U.S. lost $3.4 trillion in real estate wealth from July 2008 to March 2009 according to the Federal Reserve. </p>\n\n<p><strong>Goldman Sachs:</strong> Lost $2.1B in 2008, $1.7B profit in 2009. $20B profit in just 10 years after the crisis.</p>\n\n<p>- Most bank paid a fine, almost nobody on Wallstreet went to jail. </p>\n\n<p>TL;DR: Investment banks screwed us over and will likely do it again. Bitcoin isn&#39;t their toy to play around with, it was created to protect us from these people.</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/CryptoCurrency/comments/mh6tek/seriously_stop_simping_over_these_investment/",
  "subreddit": "CryptoCurrency",
  "id": "mh6tek",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357138677
}