{
  "author": "Nervous_Sky_5167",
  "original_created_utc": 1635017247,
  "title": "Nobody went to jail for the 2008 recession: This is why crypto exists, this is why we are here.",
  "created_utc": 1635024641,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TL;DR: A rant about banks and how ridiculously corrupt financial services are today.   </p>\n\n<p>In the early 2008s, a bunch of wealthy banks decided it was a good idea to sell unbacked, sub-prime mortgages. This was the practice of giving mortgages to individuals that had so bad credit scores/ low income, it was nearly impossible for them to pay it back. To compensate for this &#39;risk&#39;, these <em>subprime</em> <em>mortgages</em> charged higher interest rates, which were FAR more profitable than the <em>prime mortgages</em> they were used to selling. As more and more banks piled on this train and the subprime bubble grew, it only would take a few defaults to set off an explosion. And that it did.</p>\n\n<p>After the US banks bailed out these banks, Goldman Sachs, JP Morgan Chase, Citigroup, just to name a few, were fined <strong>fractions</strong> of their profits. Only 54.4 billion dollars were fined from the largest banks involved, their crimes which had cost the global economy <strong>30 trillion dollars of wealth</strong>. Over 9 million Americans alone lost their jobs, or 6 % of the total workforce, but that wasn&#39;t even the worst of it. </p>\n\n<p>After these banks screwed up subprime mortgages, they used the bail-out money to robot foreclose MOST mortgages, which ended up in one of the worst real-estate dumps, and as a result, 13 trillion dollars worth of homeowner net worth was wiped clean. Robo-foreclosure is the extremely lazy, indiscriminate practice of EVICTING a homeowner and then LIQUIDATING their home to cover the bank&#39;s portion of the mortgage, without even considering the mortgage&#39;s quality or status. </p>\n\n<p><strong>And the crazy part of this all? NOBODY, NOT A SINGLE BANKER WENT TO JAIL FOR THIS.</strong> </p>\n\n<p>All the youngster&#39;s still reading, you think this was bad? Research fractional reserve banking, the practice where banks routinely credit lend your deposited money for interest farming and then pay you a small surplus of what they earn. That&#39;s how banks earn most of their money, through lending. And oh my god, does it reak havoc. </p>\n\n<p>When your deposit of 100$ is blended to another bank at an interest rate, the credit present in the world nearly doubles. Banks are required to secure at least 10% of the original deposit, but the other 90% are lent out, creating 100$ of ghost money in your account, and another 90$ of real money in a loan borrower&#39;s account. And this happens successfully, 90$ gets loaned into 81$, and that gets loaned into 73$... Suddenly, an additional 144$ was created out of thin air from your deposit! </p>\n\n<p>Now when you withdraw your 100$, in a linear world, the 144$ of loan ghost money is suddenly wiped. Now think what would happen if more than just a few people took out their money. Does anyone here still remember the Greece Euro financial crisis? Everyone withdrew their money until all that was left was ghost money. BILLIONS of the inflated economy LOST in seconds. </p>\n\n<p>And here&#39;s just a list of atrocities banks have:</p>\n\n<p>- The fact that, by policy, your deposited money is not owned by you, but becomes the property of the bank, and that you have ZERO right to that money. </p>\n\n<p>- The fact that over 35% of the US dollar&#39;s entire existence was printed from February 2020 to 2021. Don&#39;t believe me? Look below:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/3evwka6k29v71.png?width=811&amp;format=png&amp;auto=webp&amp;s=dd314097651155dfad934098835c05ebe333b2ab\">A 35&#37; recent rise in TOTAL MONEY SUPPLY (M2) of the US dollar. Look at how small of a blimp the 2008 Recession was compared to how bad things are now.</a></p>\n\n<p>- The fact that just like any other &#39;speculative asset&#39;, does the US dollar also have restricted liquidity. You probably wondering, if 35% inflation is backed up in a single year, why isn&#39;t everything on fire? Due to low distribution since the Pandemic has lowered spending, money doesn&#39;t exchange hands fast enough as of right now to fully distribute 35% inflation. Check this post for more info: <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/osfxr5/the_postpandemics_upcoming_economic_fallout_on/\">https://www.reddit.com/r/CryptoCurrency/comments/osfxr5/the_postpandemics_upcoming_economic_fallout_on/</a></p>\n\n<p>&#x200B;</p>\n\n<p>Ok, ok, I suppose that&#39;s enough for a single post. To any newbies out there, this is why crypto was initially created. The very first, decentralized blockchain crypto that started it all was Bitcoin. </p>\n\n<p>I don&#39;t care whether your crypto achieves zero transaction fees, or whether is environmentally sustainable because of Proof Of Stake (PoS), <strong>we must all look back at our roots and realize why we are here in the first place, and what we inevitably fight for.</strong> </p>\n\n<p>Thank you for listening this far. Please do enjoy the rest of your fine afternoon.</p>\n</div><!-- SC_ON -->",
  "score": 218,
  "permalink": "/r/CryptoCurrency/comments/qebnxy/nobody_went_to_jail_for_the_2008_recession_this/",
  "subreddit": "CryptoCurrency",
  "id": "qebnxy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "TL;DR: A rant about banks and how ridiculously corrupt financial services are\ntoday.\n\nIn the early 2008s, a bunch of wealthy banks decided it was a good idea to sell\nunbacked, sub-prime mortgages. This was the practice of giving mortgages to\nindividuals that had so bad credit scores/ low income, it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TL;DR: 銀行と、今日の金融サービスがいかに馬鹿げて腐敗しているかについての暴言です。\n今日の話\n\n2008年代初頭、裕福な銀行の一団は、金融商品を売るのは良いアイデアだと考えました。\n無担保のサブプライム住宅ローンを販売することを決定しました。これは、信用度が非常に低い、あるいは、信用度の高い個人に住宅ローンを提供するというものでした。\nこれは、信用度が非常に低く、低収入の個人に住宅ローンを提供するというもので...",
      "title": "2008年の不況で刑務所に入った人はいない。これが、暗号が存在する理由であり、私たちがここにいる理由なのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TL;DR: 关于银行和金融服务如何荒谬地腐败的咆哮\n今天。\n\n在2008年代初，一群富有的银行决定出售\n无担保的次级抵押贷款。这种做法是将抵押贷款提供给\n这是将抵押贷款给那些信用分数很差/收入很低的人，这是很好的做法。",
      "title": "没有人因为2008年的经济衰退而入狱。这就是加密货币存在的原因，这就是我们存在的原因。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TL;DR: 關於銀行和金融服務如何荒謬地腐敗的咆哮\n今天。\n\n在2008年代初，一羣富有的銀行決定出售\n無擔保的次級抵押貸款。這種做法是將抵押貸款提供給\n這是將抵押貸款給那些信用分數很差/收入很低的人，這是很好的做法。",
      "title": "沒有人因爲2008年的經濟衰退而入獄。這就是加密貨幣存在的原因，這就是我們存在的原因。"
    }
  ]
}