{
  "author": "Tulevaisuusajattelu",
  "the_new_excerpt": "Hi all,\n\nToday it was one of the first days since I started investing in which I saw the\nmarket fell by a significant amount. I know that I am investing for a long time\nperiod (>10 years) and that I should not worry about those short term\nfluctuations.\n\nHowever today because of that fall, I started…",
  "original_created_utc": 1620760869,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n今日は、私が投資を始めてから初めて、相場が大きく下落した日でした。\n今日は投資を始めてから初めて、市場が大きく下落した日でした。私は長期（10年以上）の投資をしています。\n私は長期（10年以上）の投資をしているので、短期的な変動は気にしないようにしています。\nしています。\n\nしかし、今日はその下落のために、私は...",
      "title": "皆さんは、マーケットが下がっているときに、どのようにして感情をコントロールしていますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n今天是我开始投资以来的第一天，我看到市场大幅下跌。\n市场下跌了很多。我知道我的投资是一个长期的\n阶段（>10年），我不应该担心那些短期的\n波动。\n\n然而，今天因为这次下跌，我开始...",
      "title": "当市场下跌时，你们是如何管理自己的情绪的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n今天是我開始投資以來的第一天，我看到市場大幅下跌。\n市場下跌了很多。我知道我的投資是一個長期的\n階段（>10年），我不應該擔心那些短期的\n波動。\n\n然而，今天因爲這次下跌，我開始...",
      "title": "當市場下跌時，你們是如何管理自己的情緒的？"
    }
  ],
  "title": "How do you guys manage your emotions when the market is down?",
  "created_utc": 1620798853,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi all,  </p>\n\n<p>Today it was one of the first days since I started investing in which I saw the market fell by a significant amount. I know that I am investing for a long time period (&gt;10 years) and that I should not worry about those short term fluctuations.</p>\n\n<p>However today because of that fall, I started to think irrationally and to be driven by emotions. I started overchecking how the market was doing and I started thinking that maybe I should sell, since the market could go even lower (we are in all time highs, in the middle of a pandemic, etc. all what is said by stock crash doomsayers). I know that during my &quot;investor&quot; journey I will see even greater market declines. I am therefore concerned that I have already been tempted to act irrationally today, so when there are stronger downturns that may be a real problem.</p>\n\n<p>For this reason, I wanted to ask you how do you manage your emotions and not let yourselves be influenced by what happens in the short term? How do you rationalize the situation and don&#39;t let your emotions be an obstacle?  </p>\n\n<p>I know that it may be a silly question. However, as someone new to investing I am sure that there is a lot that I can learn from you regarding those points!  </p>\n\n<p>Thanks in advance :)</p>\n</div><!-- SC_ON -->",
  "score": 14,
  "permalink": "/r/Bogleheads/comments/na5721/how_do_you_guys_manage_your_emotions_when_the/",
  "subreddit": "Bogleheads",
  "id": "na5721",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994590
}