{
  "author": "GoHealthYourself",
  "original_created_utc": 1632326093,
  "title": "1/3rd of all Norwegians moved from Norway to Canada and the USA. How much did this damage Norway's economy? How did they take the hit?",
  "created_utc": 1632342096,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Britain losing Irish folks seems like a lot of MPs chalked it up as an acceptable loss, the proportion of Germans and Italians that came here as a portion of the population were much lower. Germany lost a few million people to emigration but had tens of millions to absorb the hit, similar with Italy.</p>\n\n<p>Losing a full third of your population seems like something a government would be desperately trying to stop. Were they just unable to stop it?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/ptahc5/13rd_of_all_norwegians_moved_from_norway_to/",
  "subreddit": "AskHistorians",
  "id": "ptahc5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Britain losing Irish folks seems like a lot of MPs chalked it up as an\nacceptable loss, the proportion of Germans and Italians that came here as a\nportion of the population were much lower. Germany lost a few million people to\nemigration but had tens of millions to absorb the hit, similar with…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アイルランド人を失った英国は、多くの国会議員がそれを許容範囲内の損失と考えたようです。\nドイツ人やイタリア人の割合は、イギリスの中でも最も多いと言われています。\n人口に占めるドイツ人やイタリア人の割合はもっと低かったのです。ドイツは移民によって数百万人を失いましたが\nドイツは移民によって数百万人を失いましたが、その打撃を吸収するために数千万人を抱えていました、同様に...",
      "title": "全ノルウェー人の1/3がノルウェーからカナダやアメリカに移住。これはノルウェーの経済にどれほどの打撃を与えたのでしょうか？彼らはどのようにその打撃を受けたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "英国失去了爱尔兰人，似乎很多国会议员都把它当作是一种\n损失是可以接受的，来到这里的德国人和意大利人在人口中的比例\n抵达这里的德国人和意大利人在人口中的比例要低得多。德国因移民而损失了几百万人\n但有几千万人可以吸收这一损失，这与......类似。",
      "title": "1/3的挪威人从挪威迁往加拿大和美国。这对挪威的经济有多大损害？他们是如何承受这一打击的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "英國失去了愛爾蘭人，似乎很多國會議員都把它當作是一種\n損失是可以接受的，來到這裏的德國人和意大利人在人口中的比例\n抵達這裏的德國人和意大利人在人口中的比例要低得多。德國因移民而損失了幾百萬人\n但有幾千萬人可以吸收這一損失，這與......類似。",
      "title": "1/3的挪威人從挪威遷往加拿大和美國。這對挪威的經濟有多大損害？他們是如何承受這一打擊的？"
    }
  ]
}