{
  "author": "AdamMcSmith",
  "original_created_utc": 1644498993,
  "title": "This is why everyone else hates crypto people",
  "created_utc": 1644518149,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;From time to time I&amp;#39;ll see people around here post thread or message in the daily chat complaining about the fact that &amp;quot;people are so hostile to us in other subreddits&amp;quot;.  &lt;/p&gt;\n\n&lt;p&gt;Well, I have spent the last few months hanging out around here, and I believe I have found why that is : delusion and collective hysteria. &lt;/p&gt;\n\n&lt;p&gt;Seriously, I love this sub, but it has to be one of the biggest echochamber out there, its even worse than wallstreetbets. Every bullish comment gets upvoted, and every even so slightly bearish comment gets downvoted, thats the &lt;a href=\"/r/cryptocurrency\"&gt;r/cryptocurrency&lt;/a&gt; way! People get told to buy when the coin is up, when its down, when it rug pull, before the update, after the update, after the news, if you&amp;#39;d listen to people here you&amp;#39;d always buy! Not only that, but you&amp;#39;d buy the shitcoins that get promoted over and over again. If you even dare suggesting that an altcoin in particular might not be of much value long term, you get the army of shitcoin bagholders to silence you.  &lt;/p&gt;\n\n&lt;p&gt;The result, is people are scared to say what they think, they dont wanna go against the &lt;a href=\"/r/cryptocurrency\"&gt;r/cryptocurrency&lt;/a&gt; party line.What makes things worst is the moon system, which litteraly provide rewards for participating in the echochamber. The more bullish the comment, the higher the upvote! This cycle fuels a machine which slowly makes all of us more and more delusional, until we inevitably fall into collective hysteria. Problem is when you leave this sub, you sometimes don&amp;#39;t realize you&amp;#39;re also leaving the dogma, and everyone else that wasnt exposed to it perceive your opinion as absurdly bullish, leaving them thinking that you&amp;#39;re either crazy or full of shit.  &lt;/p&gt;\n\n&lt;p&gt;I dont have a solution to offer, I just wanted to point it out.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 373,
  "permalink": "/r/CryptoCurrency/comments/sp6f6u/this_is_why_everyone_else_hates_crypto_people/",
  "subreddit": "CryptoCurrency",
  "id": "sp6f6u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "From time to time I'll see people around here post thread or message in the\ndaily chat complaining about the fact that \"people are so hostile to us in other\nsubreddits\".\n\nWell, I have spent the last few months hanging out around here, and I believe I\nhave found why that is : delusion and collective…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "時々、この辺りの人がスレッドやメッセージに書き込んでいるのを見かけます。\n日替わりチャットで「他の人は私たちに敵意を持っている」と文句を言っている。\nsubreddits」です。\n\nこの数ヶ月間、この辺りをうろうろしていたのですが、私はこう思います。\nそれはなぜかというと、妄想と集団...",
      "title": "これだからクリプト族は嫌われるんだ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不时地看到这里的人们在日常聊天中发布线程或信息\n抱怨 \"人们在其他子版块对我们很有敌意 \"这一事实。\n分区的人对我们很有敌意\"。\n\n好吧，我在过去的几个月里在这里闲逛，我相信我\n我已经找到了这是为什么：妄想和集体...",
      "title": "这就是为什么其他人都讨厌加密货币的人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不時地看到這裏的人們在日常聊天中發佈線程或信息\n抱怨 \"人們在其他子版塊對我們很有敵意 \"這一事實。\n分區的人對我們很有敵意\"。\n\n好吧，我在過去的幾個月裏在這裏閒逛，我相信我\n我已經找到了這是爲什麼：妄想和集體...",
      "title": "這就是爲什麼其他人都討厭加密貨幣的人"
    }
  ]
}