{
  "author": "Wishyouamerry",
  "original_created_utc": 1633045211,
  "title": "In 1960 Ruby Bridges was one of six children who passed a test determining whether they could go to an all white school. What was the test, and what was considered “passing” vs “failing”?",
  "created_utc": 1633085283,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://en.m.wikipedia.org/wiki/Ruby_Bridges\">This Wikipedia article</a> states that Ruby passed a test and because of that, she was allowed to enroll in an all-white school. She was only 6 years old. What kinds of questions were on the test, who administered it, and who determined if the answers were right or wrong?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/pyvqx4/in_1960_ruby_bridges_was_one_of_six_children_who/",
  "subreddit": "AskHistorians",
  "id": "pyvqx4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This Wikipedia article [https://en.m.wikipedia.org/wiki/Ruby_Bridges] states\nthat Ruby passed a test and because of that, she was allowed to enroll in an\nall-white school. She was only 6 years old. What kinds of questions were on the\ntest, who administered it, and who determined if the answers were…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このWikipediaの記事[https://en.m.wikipedia.org/wiki/Ruby_Bridges]には、次のように書かれています。\nルビーはテストに合格し、そのおかげで入学を許可された。\n白人だけの学校。彼女はまだ6歳でした。どのような問題が出題されたのでしょうか。\nテストは誰が行い、その答えが正しいかどうか誰が判断したのか...。",
      "title": "1960年、ルビー・ブリッジズは、白人学校への進学を決めるテストに合格した6人の子どものうちの1人だった。そのテストとはどのようなもので、何をもって「合格」とし、何をもって「不合格」としたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "维基百科的这篇文章[https://en.m.wikipedia.org/wiki/Ruby_Bridges]指出\n鲁比通过了一项测试，因此，她被允许进入一所全是白人的学校。\n全是白人的学校。她当时只有6岁。测试中的问题有哪些？\n是谁进行的测试，以及谁决定答案是否...",
      "title": "1960年，鲁比-布里奇斯是通过测试的六个孩子之一，该测试决定了他们是否能进入一所全白人学校。该测试是什么，什么被认为是 \"通过 \"与 \"不合格\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "維基百科的這篇文章[https://en.m.wikipedia.org/wiki/Ruby_Bridges]指出\n魯比通過了一項測試，因此，她被允許進入一所全是白人的學校。\n全是白人的學校。她當時只有6歲。測試中的問題有哪些？\n是誰進行的測試，以及誰決定答案是否...",
      "title": "1960年，魯比-布里奇斯是通過測試的六個孩子之一，該測試決定了他們是否能進入一所全白人學校。該測試是什麼，什麼被認爲是 \"通過 \"與 \"不合格\"？"
    }
  ]
}