{
  "author": "BigBoyManBoyMan",
  "original_created_utc": 1654615062,
  "title": "In all these gun threads about the US, defending from a “tyrannical government” pops up all the time. However, the US military is so powerful, how exactly are you or your tiny militia of bumfucks supposed to defeat the military with your AR-15?",
  "created_utc": 1654649554,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Even if you had a small militia of gun owners, or even a large one, the US military has superior man power and tech. They could outnumber your militia or simply bomb it with drones. I am not trying to make a statement about gun ownership, I am simply trying to know why so many gun owners think they have a chance against the government. It isn’t 1786 anymore, citizens can’t keep up the power of the US military at all. You all sound like fools, is there a legitimate argument I am missing? Or is everyone in over their heads?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/v6yib0/in_all_these_gun_threads_about_the_us_defending/",
  "subreddit": "TooAfraidToAsk",
  "id": "v6yib0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Even if you had a small militia of gun owners, or even a large one, the US\nmilitary has superior man power and tech. They could outnumber your militia or\nsimply bomb it with drones. I am not trying to make a statement about gun\nownership, I am simply trying to know why so many gun owners think they…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "銃所有者の小さな民兵がいたとしても、あるいは大きな民兵がいたとしても、アメリカは\n米軍は優れたマンパワーと技術を持っています。民兵を数で圧倒することも、無人機で爆撃することも可能です。\nドローンで爆撃することもできます。私は、銃の所有について主張したいのではありません。\nなぜ多くの銃所有者が自分たちを...",
      "title": "アメリカに関する銃のスレッドでは、「専制的な政府」から身を守ることがいつも話題にのぼります。しかし、米軍は非常に強力で、あなたやあなたの小さな民兵は、AR-15でどうやって軍に勝つつもりなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "即使你有一个由枪支所有者组成的小型民兵组织，甚至是一个大型的民兵组织，美国\n美国军队拥有优越的人力和技术。他们可以在数量上超过你的民兵，或者\n简单地用无人机轰炸它。我并不是要对枪支所有权做出声明，我只是想知道\n我只是想知道为什么这么多枪支所有者认为他们...",
      "title": "在所有这些关于美国的枪支主题中，抵御 \"暴政 \"的话题一直都在出现。然而，美国军队是如此强大，你或你的小混混民兵到底如何用你的AR-15打败军队？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "即使你有一個由槍支所有者組成的小型民兵組織，甚至是一個大型的民兵組織，美國\n美國軍隊擁有優越的人力和技術。他們可以在數量上超過你的民兵，或者\n簡單地用無人機轟炸它。我並不是要對槍支所有權做出聲明，我只是想知道\n我只是想知道爲什麼這麼多槍支所有者認爲他們...",
      "title": "在所有這些關於美國的槍支主題中，抵禦 \"暴政 \"的話題一直都在出現。然而，美國軍隊是如此強大，你或你的小混混民兵到底如何用你的AR-15打敗軍隊？"
    }
  ]
}