{
  "author": "NegativeNelly-",
  "original_created_utc": 1650614784,
  "title": "Why does everyone on Reddit sound like the same person?",
  "created_utc": 1650623905,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve been on Reddit for a few months and it’s the absolute most bizarre experience I’ve ever encountered. &lt;/p&gt;\n\n&lt;p&gt;I read through comment threads and posts etc etc a lot and it’s mind boggling to me how everyone appears to be the same. Sometimes I feel like I’m in some bizarre “place” where everyone has morphed into being the same person? &lt;/p&gt;\n\n&lt;p&gt;I don’t know any other way to articulate what I’m trying to ask but I’m just wondering if I am alone in feeling this way? &lt;/p&gt;\n\n&lt;p&gt;I do not utilize any other “social media” platforms so I do not have anything to compare it too.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 149,
  "permalink": "/r/NoStupidQuestions/comments/u99fas/why_does_everyone_on_reddit_sound_like_the_same/",
  "subreddit": "NoStupidQuestions",
  "id": "u99fas",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve been on Reddit for a few months and it’s the absolute most bizarre\nexperience I’ve ever encountered.\n\nI read through comment threads and posts etc etc a lot and it’s mind boggling to\nme how everyone appears to be the same. Sometimes I feel like I’m in some\nbizarre “place” where everyone has…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数ヶ月前からRedditを利用していますが、絶対的に異様です\nな体験でした。\n\nコメントスレッドや投稿などを何度も読み返しましたが、みんなが同じに見えることに唖然としました。\nみんな同じに見えるんです。時々、誰もが持っている奇妙な「場所」にいるような気がします。\nって思うことがあります。",
      "title": "なぜRedditにいる人はみんな同じように聞こえるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在Reddit上呆了几个月，这绝对是我遇到的最奇怪的\n的经历。\n\n我经常阅读评论线程和帖子，等等，这让我感到不可思议。\n我觉得每个人看起来都是一样的。有时我觉得我在某个\n诡异的 \"地方\"，每个人都有...",
      "title": "为什么Reddit上的每个人听起来都像同一个人？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在Reddit上呆了幾個月，這絕對是我遇到的最奇怪的\n的經歷。\n\n我經常閱讀評論線程和帖子，等等，這讓我感到不可思議。\n我覺得每個人看起來都是一樣的。有時我覺得我在某個\n詭異的 \"地方\"，每個人都有...",
      "title": "爲什麼Reddit上的每個人聽起來都像同一個人？"
    }
  ]
}