{
  "author": "Randomized_Emptiness",
  "the_new_excerpt": "Looking at the world people really don't care what goes on in the background.\nOur phones and trainers are made by exploited child workers. We buy en mass from\nunethical companies like Nestle, Shell etc. I know exactly how Amazon treats it\nworkers yet I buy things from there every week.\n\nI hear it…",
  "original_created_utc": 1624186771,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "世界に目を向けると、人々はその背後で起こっていることに関心がありません。\n私たちの携帯電話やトレーナーは、搾取された児童労働者によって作られています。ネスレやシェルなどの非倫理的な企業から大量に購入しています。\nネスレやシェルなどの非倫理的な企業から大量に購入しています。アマゾンが労働者をどのように扱っているかはよく知っています。\n私は毎週のようにアマゾンから物を買っています。\n\n私はそれを聞いて...",
      "title": "人気のない意見 消費者が中央集権的な暗号通貨を拒絶すると考えている人は、自分自身をからかっているのではないだろうか"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "看看这个世界，人们真的不关心背景是什么。\n我们的手机和培训师是由被剥削的童工制造的。我们大量购买来自\n雀巢、壳牌等不道德的公司。我很清楚亚马逊是如何对待它的\n工人，但我每周都从那里买东西。\n\n我听说...",
      "title": "不受欢迎的意见。认为消费者会拒绝中心化加密货币的人在自欺欺人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "看看這個世界，人們真的不關心背景是什麼。\n我們的手機和培訓師是由被剝削的童工製造的。我們大量購買來自\n雀巢、殼牌等不道德的公司。我很清楚亞馬遜是如何對待它的\n工人，但我每週都從那裏買東西。\n\n我聽說...",
      "title": "不受歡迎的意見。認爲消費者會拒絕中心化加密貨幣的人在自欺欺人"
    }
  ],
  "title": "Unpopular opinion: People who think consumers will reject centralised cryptocurrencies are kidding themselves",
  "created_utc": 1624196232,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Looking at the world people really don&#39;t care what goes on in the background. Our phones and trainers are made by exploited child workers. We buy en mass from unethical companies like Nestle, Shell etc. I know exactly how Amazon treats it workers yet I buy things from there every week.</p>\n\n<p>I hear it echoed on here quite often that x crypto is no good because it&#39;s too centralised. The reality is that most consumers don&#39;t really know what that means or why it&#39;s good or bad. Even if they do most people will still happily choose a cheaper product without caring about that too much. In an ideal world the decentralised cryptos would win but we need to face the fact that in the future some of the most popular cryptocurrencies will likely be centralised.</p>\n</div><!-- SC_ON -->",
  "score": 294,
  "permalink": "/r/CryptoCurrency/comments/o4373o/unpopular_opinion_people_who_think_consumers_will/",
  "subreddit": "CryptoCurrency",
  "id": "o4373o",
  "is_self": true,
  "media": null,
  "is_video": false
}