{
  "author": "RusticBohemian",
  "original_created_utc": 1648521250,
  "title": "The Lincoln-Douglas debates feature nuanced, in-depth policy discussions lasting as long as seven hours. Their audiences were primarily without much formal education. How were these civic superheroes equipped to understand the debates? Was it common for people to be so well informed and devoted?",
  "created_utc": 1648541654,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When Lincoln and Douglas were debating, they weren&amp;#39;t even presidential candidates! They were just trying for the senate. &lt;/p&gt;\n\n&lt;p&gt;Can you imagine anyone sticking around for a seven-hour senate debate today? Or even a 7-hour presidential one? Granted, most were only three or four hours, but that&amp;#39;s still longer than anything we have today. &lt;/p&gt;\n\n&lt;p&gt;Reading through the debates, it&amp;#39;s clear that the candidates weren&amp;#39;t just policy wonks talking over the heads of their audiences. &lt;/p&gt;\n\n&lt;p&gt;The audience regularly cheered minor points and policy minutia. &amp;quot;You tell &amp;#39;em, Abe!&amp;quot;...&amp;quot;Try to answer that one, if you can!&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;The audience members must have had good average ability to aurally comprehend compound, complex sentences. I counted seven commas and a semicolon in one of Lincoln&amp;#39;s sentences. &lt;/p&gt;\n\n&lt;p&gt;So what sort of political culture brought this incredible mix of both talented speakers/writers and politically well-versed, civically engaged, and devoted audiences together? Was this very common in the US at this time?&lt;/p&gt;\n\n&lt;p&gt;If these farmers, tradespeople, and factory workers had little formal education, how were they even able to follow the debates? Were newspapers covering nuances of policy to this extent, with people actually reading their analyses? Were long-winded books readying them to follow these long, meandering sentences?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/tqpq64/the_lincolndouglas_debates_feature_nuanced/",
  "subreddit": "AskHistorians",
  "id": "tqpq64",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "When Lincoln and Douglas were debating, they weren't even presidential\ncandidates! They were just trying for the senate.\n\nCan you imagine anyone sticking around for a seven-hour senate debate today? Or\neven a 7-hour presidential one? Granted, most were only three or four hours, but\nthat's still…"
}