{
  "author": "chinkeeyong",
  "the_new_excerpt": "I got curious about the history of pregnancy tests while doing research for some\nhistorical fiction I'm writing. This article\n[https://history.nih.gov/display/history/Pregnancy+Test+Timeline] from the U.S.\nbased Office of NIH History states:\n\n> Using visual aspects of urine to detect pregnancy…",
  "original_created_utc": 1614076146,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在做一些研究的时候，对验孕的历史产生了好奇。\n我正在写的历史小说 这篇文章\n[https://history.nih.gov/display/history/Pregnancy+测试+时间线]来自美国的\n总部的美国国立卫生研究院历史办公室指出。\n\n>利用尿液的视觉方面来检测怀孕... ...",
      "title": "我是16世纪贵族的女儿，我担心婚外情可能导致怀孕。我可以获得 \"怀孕测试 \"吗？在它变得明显（而且有可能造成损害）之前，我有什么民间方法可以确定我是否怀孕？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在做一些研究的時候，對驗孕的歷史產生了好奇。\n我正在寫的歷史小說 這篇文章\n[https://history.nih.gov/display/history/Pregnancy+測試+時間線]來自美國的\n總部的美國國立衛生研究院歷史辦公室指出。\n\n>利用尿液的視覺方面來檢測懷孕... ...",
      "title": "我是16世紀貴族的女兒，我擔心婚外情可能導致懷孕。我可以獲得 \"懷孕測試 \"嗎？在它變得明顯（而且有可能造成損害）之前，我有什麼民間方法可以確定我是否懷孕？"
    }
  ],
  "title": "I'm the daughter of a 16th-century noble and I'm concerned that an extramarital tryst may have resulted in pregnancy. Do I have access to a \"pregnancy test\"? Before it became obvious (and potentially damning), what folk methods would I have to determine whether I was pregnant?",
  "created_utc": 1614110497,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I got curious about the history of pregnancy tests while doing research for some historical fiction I&#39;m writing. <a href=\"https://history.nih.gov/display/history/Pregnancy+Test+Timeline\">This article</a> from the U.S. based Office of NIH History states:</p>\n\n<blockquote>\n<p>Using visual aspects of urine to detect pregnancy became a popular  method. In Europe, so-called “piss prophets” claimed to be able to  diagnose many different conditions and diseases by the color of urine.  In a 1552 text, pregnancy urine was described as: “clear pale lemon  color leaning toward off-white, having a cloud on its surface.” Other  tests included mixing wine with urine and observing the results. Indeed,  alcohol reacts with certain proteins in urine, so this may have had a  moderate success rate.</p>\n</blockquote>\n\n<p>This claim is repeated across various popular history websites, but I can&#39;t find its original source. I was wondering if any experts in women&#39;s history could shed light on the subject. I understand that &quot;16th-century noble&quot; is rather vague but I would be interested in responses regarding any relevant geographic location or time period.</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/lqfahw/im_the_daughter_of_a_16thcentury_noble_and_im/",
  "subreddit": "AskHistorians",
  "id": "lqfahw",
  "is_self": true,
  "media": null,
  "is_video": false
}