{
  "author": "Netteka",
  "original_created_utc": 1632502019,
  "title": "Scooby Doo has an episode where Scooby wins 1 million dollars except it turns out it’s old “worthless” confederate cash. Kids and I are curious now about its worth and history",
  "created_utc": 1632510077,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>1) Would 1 million in confederate cash be worth anything today whether as a collectors item or anything? </p>\n\n<p>2) Was confederate cash really used much? Was it used in banks at the time?</p>\n\n<p>3) and would anyone have been even close to hoarding a million confederate dollars? </p>\n\n<p>Just curious all around about it. Thank you.</p>\n</div><!-- SC_ON -->",
  "score": 137,
  "permalink": "/r/AskHistorians/comments/punqi1/scooby_doo_has_an_episode_where_scooby_wins_1/",
  "subreddit": "AskHistorians",
  "id": "punqi1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "1) Would 1 million in confederate cash be worth anything today whether as a\ncollectors item or anything?\n\n2) Was confederate cash really used much? Was it used in banks at the time?\n\n3) and would anyone have been even close to hoarding a million confederate\ndollars?\n\nJust curious all around about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1) 100万ドルの連邦政府の現金は、今日では何の価値もないでしょう。\nコレクターズアイテムでも何でも。\n\n2）連合軍の現金は本当に使われていたのか？当時の銀行では使われていたのか？\n\n3）100万ドルの連邦政府の現金をため込むような人はいたのでしょうか？\nそして、100万ドルもの連邦政府のお金をためる人がいたでしょうか？\n\nただの興味本位ですが...。",
      "title": "スクービー・ドゥー」では、スクービーが100万ドルを獲得するエピソードがありますが、それは昔の「価値のない」連邦軍の現金だったのです。子供も私も、その価値や歴史に興味津々です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "1）一百万美元的邦联现金在今天是否有价值？\n收藏品还是什么？\n\n2）邦联的现金真的用得多吗？它在当时的银行中使用吗？\n\n3）是否有人会囤积一百万美元的邦联现金？\n美元？\n\n只是好奇地问一下...",
      "title": "出乎意料的是，有一集史酷比赢得了一百万美元，但结果却是 \"一文不值 \"的旧邦联现金。孩子们和我现在都对它的价值和历史感到好奇。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "1）一百萬美元的邦聯現金在今天是否有價值？\n收藏品還是什麼？\n\n2）邦聯的現金真的用得多嗎？它在當時的銀行中使用嗎？\n\n3）是否有人會囤積一百萬美元的邦聯現金？\n美元？\n\n只是好奇地問一下...",
      "title": "出乎意料的是，有一集史酷比贏得了一百萬美元，但結果卻是 \"一文不值 \"的舊邦聯現金。孩子們和我現在都對它的價值和歷史感到好奇。"
    }
  ]
}