{
  "author": "Old__Mate",
  "the_new_excerpt": "I began investing in Bitcoin in September 2019. When COVID-19 had its impact on\nthe market in March 2020, i went against my emotions, which were telling me that\nI had been foolish to invest as my investment had halved within hours, and\ninstead followed my head, which told me of course that it was a…",
  "original_created_utc": 1619554584,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2019年9月にビットコイン投資を始めました。COVID-19が市場に影響を与えたとき\n2020年3月にCOVID-19が市場に影響を与えたとき、私は自分の感情に逆らいました。\n数時間で投資額が半分になってしまったので、投資したのは愚かだった」という自分の感情に反して\n頭で考えた結果、「これは...」となりました。",
      "title": "ビットコインのおかげで2人の息子の環境が整いました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在2019年9月开始投资比特币。当COVID-19对\n2020年3月，当COVID-19对市场产生影响时，我违背了我的情绪，因为我的情绪告诉我\n我的投资在几小时内就减半了，我的投资是愚蠢的，而\n而是跟随我的头脑，它当然告诉我这是一个。",
      "title": "比特币帮助我为我的两个儿子安排了工作"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在2019年9月開始投資比特幣。當COVID-19對\n2020年3月，當COVID-19對市場產生影響時，我違背了我的情緒，因爲我的情緒告訴我\n我的投資在幾小時內就減半了，我的投資是愚蠢的，而\n而是跟隨我的頭腦，它當然告訴我這是一個。",
      "title": "比特幣幫助我爲我的兩個兒子安排了工作"
    }
  ],
  "title": "Bitcoin helped me set my two sons up",
  "created_utc": 1619562770,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I began investing in Bitcoin in September 2019. When COVID-19 had its impact on the market in March 2020, i went against my emotions, which were telling me that I had been foolish to invest as my investment had halved within hours, and instead followed my head, which told me of course that it was a buying opportunity unlike any that I&#39;d possibly ever see again.\nLast week the contract settled on a duplex for my 2 sons, 17 and 18, to own and live in a their first property investment. I am supporting 1/3 of their mortgage repayments for the first 2 years as they are both apprentice tradesmen. \nI&#39;m not wealthy and have had plenty of bad luck along the way but Bitcoin made it possible for me to help start my sons from a far more favourable economic position than i was able to</p>\n</div><!-- SC_ON -->",
  "score": 4167,
  "permalink": "/r/Bitcoin/comments/mzxj9n/bitcoin_helped_me_set_my_two_sons_up/",
  "subreddit": "Bitcoin",
  "id": "mzxj9n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776205696
}