{
  "author": "y2krispy",
  "the_new_excerpt": "Everything is a conspiracy about hedge funds, some tangential relation to GME\nand AMC shares they got burnt on. Diamond hands, rockets, buy the dip etc...it’s\nsad to see people so unhinged in a sub that used to have intelligent discourse.\nSubreddits have always been an echo chamber but I’m seeing…",
  "original_created_utc": 1621817397,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "すべてはヘッジファンドの陰謀であり、GMEやAMCの株に関連するものである。\nとAMC株に関連する陰謀です。ダイヤモンドハンド、ロケット、バイ・ザ・ディップなどなど...。\nかつては知的な議論が行われていたサブリットで、人々がこんなにも動揺しているのを見るのは悲しいことです。\nサブレディットは常にエコーチェンバーですが、私が見ているのは...",
      "title": "感想：この2ヶ月間でこのサブにあふれたWSBのアバターがコミュニティを破壊しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一切都是关于对冲基金的阴谋，与GME有一些切身的关系\n和他们被烧毁的AMC股票。钻石手、火箭、买入跌停板等等。\n看到人们在一个曾经有智能讨论的子网站上如此不正常，真是令人难过。\n子版块一直是一个回声室，但我看到...",
      "title": "热议：在过去的2个月里，充斥在这个分区的WSB头像已经毁了这个社区。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一切都是關於對沖基金的陰謀，與GME有一些切身的關係\n和他們被燒燬的AMC股票。鑽石手、火箭、買入跌停板等等。\n看到人們在一個曾經有智能討論的子網站上如此不正常，真是令人難過。\n子版塊一直是一個回聲室，但我看到...",
      "title": "熱議：在過去的2個月裏，充斥在這個分區的WSB頭像已經毀了這個社區。"
    }
  ],
  "title": "Hot take: the WSB avatars that have flooded this sub in the last ~2 months have ruined the community.",
  "created_utc": 1621834807,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Everything is a conspiracy about hedge funds, some tangential relation to GME and AMC shares they got burnt on. Diamond hands, rockets, buy the dip etc...it’s sad to see people so unhinged in a sub that used to have intelligent discourse. Subreddits have always been an echo chamber but I’m seeing some Qanon level conspiracy posts in here and it’s just disappointing.</p>\n</div><!-- SC_ON -->",
  "score": 2484,
  "permalink": "/r/CryptoCurrency/comments/njloc5/hot_take_the_wsb_avatars_that_have_flooded_this/",
  "subreddit": "CryptoCurrency",
  "id": "njloc5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197385277
}