{
  "author": "BCHcain",
  "original_created_utc": 1637640126,
  "title": "If you support crypto, please read.",
  "created_utc": 1637649014,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know many of us disagree on many things. We all have our favorite pet projects and argue about everything from proof of work versus proof of stake, to store of value versus medium of exchange. Some of us are into defi, for others its NFTs; maybe it&#39;s meme tokens that float your boat, or just plain old electronic cash.</p>\n\n<p>But I like to believe we also all share something in common. We believe in the power of crypto. We believe in what it represents and what it can one day make possible. But it&#39;s not just going to happen on its own. The future isn&#39;t going to be handed to us on a silver platter and it&#39;s going to take as many of us as possible to fight the powers that be and make our voices heard.</p>\n\n<p>I&#39;m not proposing we take down the fed tomorrow, but what I am talking about is something much smaller, something I&#39;m hoping you can help me set right.</p>\n\n<p>The other day I posted <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/qyb6zt/an_open_letter_to_johnny_lyu_and_kucoin_exchange/\">here</a> about the exchange Kucoin. I explained how they&#39;ve been holding ~$50K of my BCHA (aka XEC on every other exchange) for over six months without letting me withdraw. I shared emails showing how they&#39;ve given me nothing but the runaround since May, and how Kucoin themselves had <a href=\"https://www.kucoin.com/news/en-kucoin-will-support-bcha-upgrade-0820\">announced</a> their support of this project 3 months ago, causing me and others to buy even more.</p>\n\n<p><a href=\"https://preview.redd.it/qwcsz21p09181.png?width=1370&amp;format=png&amp;auto=webp&amp;s=85286d659c2edec9267f65c9b0496e13e328e285\">People&#39;s exchange my ass.</a></p>\n\n<p>But they&#39;ve failed to live up to their word.</p>\n\n<p>While I was thankful to see so many kind and supportive comments, giving me hope for the crypto community at large, I&#39;m sorry to say Kucoin still has yet to tell me when I&#39;ll be able to withdraw my coins.</p>\n\n<p>To those who suggested I just sell my BCHA and withdraw in USDT, the fact is I can&#39;t because there is no liquidity left. Who wants to buy a coin on an exchange if you can&#39;t withdraw, and I hold enough coins that I would have to sell for cents on the dollar if I did. Not to mention I&#39;d just be passing off the problem to some other poor soul.</p>\n\n<p>But what&#39;s most important is that I shouldn&#39;t have to do any of that. And giving up would just be letting Kucoin off the hook, which I&#39;m not about to do.</p>\n\n<p>So I&#39;m asking for help from the wider cryptocurrency community. I want to believe that people in this community, more than any other, understand the difference between right and wrong and believe in a sense of justice in this world.</p>\n\n<p>I&#39;m asking you to help me right this wrong, and share this post with as many people as possible. My goal is to reach the top of this subreddit and send a loud message to <a href=\"/u/Johnny_Kucoin\">u/Johnny_Kucoin</a> (Johnny Lyu, CEO of Kucoin) that his exchange can&#39;t get away with this.</p>\n\n<p>At this point I know that ~$50K of my money is probably gone, but I want everyone in crypto to hear about this so they understand the type of exchange Kucoin is. Because if they can steal my money, there&#39;s nothing stopping them from doing the same to you.</p>\n\n<p>I for one am tired of industry players who give crypto a bad name. It&#39;s time to call out bad actors and send a message to these companies that they must treat their customers right or we&#39;ll simply move our business elsewhere.</p>\n\n<p>I know this is a longshot, but I&#39;m asking you to spread the word, because I am confident that this space is full of amazing people who believe in supporting each other and holding bad actors accountable.</p>\n\n<p>I&#39;m not a vindictive person. I don&#39;t want Kucoin to go out of business. I just want them to do the right thing and make sure others aren&#39;t cheated out of their money like I was.</p>\n\n<p>Thank you for reading and best of luck to everyone.</p>\n</div><!-- SC_ON -->",
  "score": 318,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/HXvVHSJXrtBFNPIn3tq-56qT-EEh09QvfBjEgaUOyLQ.jpg?auto=webp&s=7fc41216e28cc96ed6340cfd2c76676b7a912121",
          "width": 1200,
          "height": 630
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/HXvVHSJXrtBFNPIn3tq-56qT-EEh09QvfBjEgaUOyLQ.jpg?width=108&crop=smart&auto=webp&s=2ab4e50d010d246deac7aec4b081373d88114726",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/HXvVHSJXrtBFNPIn3tq-56qT-EEh09QvfBjEgaUOyLQ.jpg?width=216&crop=smart&auto=webp&s=ad2658a9fecf44d08442963e24efde946f0b3c2c",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/HXvVHSJXrtBFNPIn3tq-56qT-EEh09QvfBjEgaUOyLQ.jpg?width=320&crop=smart&auto=webp&s=a8227825d485f64cf9af289785e1395fee944836",
            "width": 320,
            "height": 168
          },
          {
            "url": "https://external-preview.redd.it/HXvVHSJXrtBFNPIn3tq-56qT-EEh09QvfBjEgaUOyLQ.jpg?width=640&crop=smart&auto=webp&s=7ca3a1517915680632ea5a2f36e1b678507f4462",
            "width": 640,
            "height": 336
          },
          {
            "url": "https://external-preview.redd.it/HXvVHSJXrtBFNPIn3tq-56qT-EEh09QvfBjEgaUOyLQ.jpg?width=960&crop=smart&auto=webp&s=3a4419c48b9826c0a6beaef07ccc76be514b069c",
            "width": 960,
            "height": 504
          },
          {
            "url": "https://external-preview.redd.it/HXvVHSJXrtBFNPIn3tq-56qT-EEh09QvfBjEgaUOyLQ.jpg?width=1080&crop=smart&auto=webp&s=0d2b890f722bcb527306e3e4ee0973a2a0271d2e",
            "width": 1080,
            "height": 567
          }
        ],
        "variants": {},
        "id": "ZZ9FZ3XvFt-zan_OGP-sIMlbU2wqJva20ndCH15nvbM"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/r04d7l/if_you_support_crypto_please_read/",
  "subreddit": "CryptoCurrency",
  "id": "r04d7l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know many of us disagree on many things. We all have our favorite pet projects\nand argue about everything from proof of work versus proof of stake, to store of\nvalue versus medium of exchange. Some of us are into defi, for others its NFTs;\nmaybe it's meme tokens that float your boat, or just plain…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちの多くが、多くのことについて意見を異にしていることを知っています。私たちは皆、自分の好きなプロジェクトを持っていて\nプルーフ・オブ・ワークとプルーフ・オブ・ステーク、ストア・オブ・バリューとミディアム・オブ・エクスチェンジなど、あらゆることについて議論しています。\n価値の貯蔵庫と交換手段の間で議論しています。defiに夢中になっている人もいれば、NFTに夢中になっている人もいます。\nまた、ミームトークンが好きな人もいるでしょうし、単に...",
      "title": "暗号を支持する方はぜひお読みください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道我们中的许多人在许多事情上有不同意见。我们都有自己最喜爱的宠物项目\n我们都有自己喜欢的项目，并就工作证明与股权证明、价值存储与交换媒介等一切问题进行争论。\n价值存储与交换媒介。我们中的一些人喜欢Defi，另一些人则喜欢NFTs。\n也许你喜欢的是记忆代币，或者只是单纯的......",
      "title": "如果你支持加密货币，请阅读。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道我們中的許多人在許多事情上有不同意見。我們都有自己最喜愛的寵物項目\n我們都有自己喜歡的項目，並就工作證明與股權證明、價值存儲與交換媒介等一切問題進行爭論。\n價值存儲與交換媒介。我們中的一些人喜歡Defi，另一些人則喜歡NFTs。\n也許你喜歡的是記憶代幣，或者只是單純的......",
      "title": "如果你支持加密貨幣，請閱讀。"
    }
  ]
}