{
  "author": "Mr-Pink_",
  "the_new_excerpt": " 1.  Avoid Emotions - Investing requires fact/fundamentals based logical and\n     rational thinking, detached from emotions.\n     \"If you cant control your emotions, you cant control your money\" - Warren\n     Buffet\n\n 2.  Circle of competence - Focus on areas you are passionate about and is\n    …",
  "original_created_utc": 1611048828,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": " 1.  避免情绪化--投资需要基于事实/基本面的逻辑和。\n     理性思维，脱离情绪。\n     \"如果你不能控制你的情绪，你就不能控制你的钱\" - 沃伦\n     自助餐\n\n 2.  能力圈--专注于你所热衷的领域，并且是\n    …",
      "title": "初学者的10条投资原则。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " 1.  避免情緒化--投資需要基於事實/基本面的邏輯和。\n     理性思維，脫離情緒。\n     \"如果你不能控制你的情緒，你就不能控制你的錢\" - 沃倫\n     自助餐\n\n 2.  能力圈--專注於你所熱衷的領域，並且是\n    …",
      "title": "初學者的10條投資原則。"
    }
  ],
  "title": "10 Investing Principles for beginners:",
  "created_utc": 1611076177,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><ol>\n<li><p>Avoid Emotions - Investing requires fact/fundamentals based logical and rational thinking, detached from emotions.<br/>\n&quot;If you cant control your emotions, you cant control your money&quot; - Warren Buffet</p></li>\n<li><p>Circle of competence - Focus on areas you are passionate about and is within your domain of expertise, where you will have an advantage over the average person.</p></li>\n<li><p>Have a checklist/plan - One of the most important aspects of investing is to have some sort of strategy/checklist/plan whereby one can compare the investment prospects of various assets.<br/>\n&quot;No wise pilot, no matter how great his talent &amp; experience, fails to use a checklist&quot; - Charlie Munger</p></li>\n<li><p>Margin of Safety - Only buy things on discount to value due to temporary distress, giving an adequate margin of safety which can protect us from the uncertainty of the future and possibility of error in our calculation.</p></li>\n<li><p>Probabilities - Learn to think in probabilities and how to get the odds on your side.<br/>\n&quot;Heads I win, tails I don&#39;t lose&quot; - Mohnish Pabrai</p></li>\n<li><p>Diversify appropriately - Diversify your funds across the appropriate investments within your circle of competence.</p></li>\n<li><p>Manage/Minimize Risk - Practice risk aversion and avoid taking dangerous, unnecessary risks in an attempt to maximize gains. Minimizing risk, is maximizing gains, because if you are protected from loss then making a gain is the only option (this is the true way of maximizing gains).<br/>\n&quot;Rule No. 1 of investing is to never lose money and Rule No. 2 is to never forget Rule No. 1&quot; - Warren Buffet</p></li>\n<li><p>Ignore/Block Noise - Don&#39;t pay too much attention to social media influencers, forecasters, retail investors, hype and the regular fluctuations of the market.</p></li>\n<li><p>Mother Hawk - Monitor, sustain and maintain your portfolio like a mother hawk protecting her nest. Be diligent.</p></li>\n<li><p>Patience &amp; Long-term Thinking - Be patient in your investment activities, it takes time. Also, think long-term and maintain a long-term vision to take the best advantage out of compound interest.</p></li>\n</ol>\n\n<p>Note: These are just 10 principles of the many principles in investing, they are not the only 10 principles to be followed.</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/stocks/comments/l0gj1k/10_investing_principles_for_beginners/",
  "subreddit": "stocks",
  "id": "l0gj1k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311218345
}