{
  "author": "LarryTheLobster710",
  "the_new_excerpt": "Hi- I know it's a really busy time but I've been trying to get this issue\nresolved for 4+ months with no luck. Here's my last shot.\n\nIn early 2017 I created a binance account and bought some ADA/BNB and never\nreally checked it until Jan 2021. I can still log into the binance account\nbecause I have…",
  "original_created_utc": 1618834078,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、お忙しいところ恐縮ですが、この問題を解決しようと\n4ヶ月以上も解決しようとしてきましたが、うまくいきませんでした。ここに私の最後のショットがあります。\n\n2017年初頭にバイナンスアカウントを作成し、ADA/BNBを購入しました。\n2021年1月まで一度もチェックしていませんでした。私はまだbinanceアカウントにログインできます\nなぜなら、私は...",
      "title": "Binanceがこれを認めようとしないので、私はここに投稿しています-12k以上の米ドルがBinanceに滞留し、利用可能なサポートはゼロです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，我知道现在很忙，但我一直在努力解决这个问题。\n解决了4个多月，毫无进展。这是我最后的机会。\n\n2017年初，我创建了一个binance账户，买了一些ADA/BNB，一直没有\n真的查到2021年1月。我仍然可以登录到binance账户\n因为我有...",
      "title": "由于Binance不想承认这一点，我在这里发帖--1.2万多美元卡在Binance，零支持。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，我知道現在很忙，但我一直在努力解決這個問題。\n解決了4個多月，毫無進展。這是我最後的機會。\n\n2017年初，我創建了一個binance賬戶，買了一些ADA/BNB，一直沒有\n真的查到2021年1月。我仍然可以登錄到binance賬戶\n因爲我有...",
      "title": "由於Binance不想承認這一點，我在這裏發帖--1.2萬多美元卡在Binance，零支持。"
    }
  ],
  "title": "Since Binance doesn't want to acknowledge this I'm posting here- $12k+ USD stuck in Binance with zero support available",
  "created_utc": 1618852203,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi-  I know it&#39;s a really busy time but I&#39;ve been trying to get this issue  resolved for 4+ months with no luck. Here&#39;s my last shot.</p>\n\n<p>In  early 2017 I created a binance account and bought some ADA/BNB and  never really checked it until Jan 2021. I can still log into the binance  account because I have my orig logon info, google 2fa set up, and a sms  number registered with the account.</p>\n\n<p>Apparently  after 6months of inactivity the email address I registered with Binance  had expired. This was the email I used to get my withdraw pins.   Because I can&#39;t get withdraw pins, I cannot make withdraws.</p>\n\n<p>To set up a new email I need to be verified. Binance will not verify me since I am a US citizen.</p>\n\n<p>All  I would like to do is get my coins moved from Binance to BinanceUS so I  can withdraw them. I have tried to contact both Binance and BinanceUS  but neither are able to assist apparently.  I was told my coins were  &quot;safe&quot; but I literally can&#39;t withdraw them.</p>\n\n<p>I&#39;m  not here to bash binance or to bring them negative attention but I do  need help with this and I do not feel like I was getting the required  level of support in my emails to resolve this. Is anyone here familiar  with the process or able to share their experience? Thank you</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>edit--Thank you so much to everyone who is commenting/upvoting for visibility!! I really appreciate the attention people are showing this post. I&#39;ll go through the comments and try some of the methods after work. This really is a great community.</p>\n\n<p>update- A binance mod commented on my post in /binance and I have since provided them with my username. Awaiting a response. </p>\n</div><!-- SC_ON -->",
  "score": 1927,
  "permalink": "/r/CryptoCurrency/comments/mtz68x/since_binance_doesnt_want_to_acknowledge_this_im/",
  "subreddit": "CryptoCurrency",
  "id": "mtz68x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171521482
}