{
  "author": "omrip34",
  "original_created_utc": 1639467623,
  "title": "Cardano is very much in the spirit of bitcoin",
  "created_utc": 1639492407,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If you put aside your tribalism towards this certain coin and negative feelings towards Charles Hoskinson (and I agree, he is a controversial figure) and just delve into the tech you will see that Cardano is very much in the spirit of bitcoin.&lt;/p&gt;\n\n&lt;p&gt;Some examples:&lt;strong&gt;The eUTXO model:&lt;/strong&gt; Bitcoin uses the utxo model (instead of the global state/accounting model Ethereum and many other blockchain&amp;#39;s use).This model was adopted by Cardano and extended (eUTXO) to add a turing complete scripting language. In bitcoin there is also a scripting language but it&amp;#39;s not turing complete (curious fact, it is harder to create a non turing compete language. For example, turing complete languages were sometimes created by mistake when some tech was created!).It is true that this scripting language in bitcoin was non turing complete by design but I see Cardano&amp;#39;s extension as the next logical step.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Consensus mechanism:&lt;/strong&gt; The most important thing about the consensus algorithm is that it&amp;#39;s secure and decentralised. Cardano&amp;#39;s Proof of stake algorithm is proven to be at least as secure as Bitcoin&amp;#39;s proof of work algorithm. Also, It can even be said that Cardano is &lt;strong&gt;more&lt;/strong&gt; decentralised due to it&amp;#39;s many pools/evolving governance/etc...&lt;/p&gt;\n\n&lt;p&gt;All in all, I really think that there is a lot of merit to Cardano if you look objectively into the tech.&lt;/p&gt;\n\n&lt;p&gt;Cheers :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/rg2ayh/cardano_is_very_much_in_the_spirit_of_bitcoin/",
  "subreddit": "CryptoCurrency",
  "id": "rg2ayh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If you put aside your tribalism towards this certain coin and negative feelings\ntowards Charles Hoskinson (and I agree, he is a controversial figure) and just\ndelve into the tech you will see that Cardano is very much in the spirit of\nbitcoin.\n\nSome examples:The eUTXO model: Bitcoin uses the utxo…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もし、この特定のコインに対する部族主義やネガティブな感情を捨てれば\nチャールズ・ホスキンソン（私もそう思いますが、彼は物議を醸す人物です）に対して、ただただ\n技術について掘り下げると、カルダノが非常に優れた精神を持っていることが分かるでしょう。\nビットコイン\n\nその一例として、eUTXOモデルが挙げられます。ビットコインはユークソを使用しています...",
      "title": "カルダノはビットコインの精神を色濃く受け継いでいる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你把你对这枚硬币的部落主义和对查尔斯-霍斯金森的负面情绪放在一边\n我同意，他是一个有争议的人物。\n深入研究技术，你会发现Cardano非常符合\n比特币的精神。\n\n一些例子：eUTXO模型。比特币使用utxo...",
      "title": "Cardano非常符合比特币的精神"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你把你對這枚硬幣的部落主義和對查爾斯-霍斯金森的負面情緒放在一邊\n我同意，他是一個有爭議的人物。\n深入研究技術，你會發現Cardano非常符合\n比特幣的精神。\n\n一些例子：eUTXO模型。比特幣使用utxo...",
      "title": "Cardano非常符合比特幣的精神"
    }
  ]
}