{
  "author": "Nuewim",
  "original_created_utc": 1657470603,
  "title": "One of most important crypto rules: Never tell anyone how much crypto you own.",
  "created_utc": 1657536534,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is rule many people forgot about especially in bear market. In bull market most people protect their profits, but during bear market a lot of people like to share their losses. Problem is when bull market will come back you will have target on your back.&lt;/p&gt;\n\n&lt;p&gt;If you need share loses or gains use %,  just tell my portfolio is 70% down or 30% up, not how much  it is  worth. People can do math. Also not tell how much you made, just tell your coin did x10, let people guess if you invested $10 or $20k.&lt;/p&gt;\n\n&lt;p&gt;Never share any financial details of your portfolio outside reddit too. You think messenger, SMS, e-mails or some other social media are safe? Do not even write notes on phone&amp;#39;s notebook with exact details. If anyone will hack your phone they will have access to all those things.&lt;/p&gt;\n\n&lt;p&gt;The same rule applies in real life. A lot of people like to  brag about their crypto profits, later they are often find dead with hole in the head... And I am not even joking, there were many articles about those situations, especially in bad neighbourhoods, everyone who is here long enough remember them. Even if you won&amp;#39;t be  dead, your family &amp;amp; friends and strangers may ask you for money, become jealous or angry. Someone you know or person that overhead may also broke into your home and then nothing will help if they will find your seed phrases or stole your device with access to wallets.&lt;/p&gt;\n\n&lt;p&gt;Never tell % if people can check even single of your coins to guesss value. It is especially  important in case of moons. If you tell how much % of your portfolio moons are...suprise... suprise everyone can calculate value of your whole portfolio. Simmilar situation if anyone know your wallet adress.&lt;/p&gt;\n\n&lt;p&gt;If you blur $ value of coins on photo you share most often it is still possible to restore it by playing with contrast. You either need to cut part of photo entirely or not share it at all. Some exchanges give you also option to hide $balance which may also help if you really need it.&lt;/p&gt;\n\n&lt;p&gt;I am in crypto long enough, I saw people that shared details of huge portfolios, I also saw countless cases of people losing huge porftolios for whatever reasons. Maybe some of them wouldn&amp;#39;t lose their crypto if they would be quiet. Don&amp;#39;t be like them, even if risk is minimal or your portfolio is small do not worth to took unnecessary risk by  sharing any financial details.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 304,
  "permalink": "/r/CryptoCurrency/comments/vvv67f/one_of_most_important_crypto_rules_never_tell/",
  "subreddit": "CryptoCurrency",
  "id": "vvv67f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This is rule many people forgot about especially in bear market. In bull market\nmost people protect their profits, but during bear market a lot of people like\nto share their losses. Problem is when bull market will come back you will have\ntarget on your back.\n\nIf you need share loses or gains use…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、特にベアマーケットにおいて、多くの人が忘れているルールです。強気相場では\n多くの人は自分の利益を守るが、弱気相場では多くの人が損失を共有したがる。\nを共有したがる。問題は、強気相場が戻ってきたときに、自分の資産をターゲットとする\nを背負うことになります。\n\nあなたが失うか、または利益を共有する必要がある場合は使用...",
      "title": "最も重要な暗号のルールの1つ。暗号をどれだけ持っているかは、決して誰にも言わないこと。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是许多人忘记的规则，特别是在熊市。在牛市中\n大多数人保护自己的利润，但在熊市中，很多人喜欢\n分担他们的损失。问题是，当牛市回来的时候，你会有\n目标在你的背上。\n\n如果你需要分享损失或收益，请使用...",
      "title": "最重要的加密货币规则之一。永远不要告诉别人你拥有多少加密货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是許多人忘記的規則，特別是在熊市。在牛市中\n大多數人保護自己的利潤，但在熊市中，很多人喜歡\n分擔他們的損失。問題是，當牛市回來的時候，你會有\n目標在你的背上。\n\n如果你需要分享損失或收益，請使用...",
      "title": "最重要的加密貨幣規則之一。永遠不要告訴別人你擁有多少加密貨幣。"
    }
  ]
}