{
  "author": "Accomplished-Design7",
  "original_created_utc": 1642325373,
  "title": "What would you do if the bear market hits?",
  "created_utc": 1642393847,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I for one don’t think it’s here yet but all those bearish posts got me thinking. What would the majority do during it? We all say we will buy the dip like madmen but do we all really have the balls to do that when we see our portfolio going -90%? &lt;/p&gt;\n\n&lt;p&gt;I have been in 2 crashes and been DCAing in the dips and thus I am still sitting in gains territory. But most people will sell especially new retail investors. I have heard people saying that they will HODL and just wait. While some optimist believe they can time the market. &lt;/p&gt;\n\n&lt;p&gt;I will just continue with my DCAs, staking and HODL. &lt;/p&gt;\n\n&lt;p&gt;And whenever we see some nice green gains I might take out my initially investments. &lt;/p&gt;\n\n&lt;p&gt;What would you do when it happens?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "permalink": "/r/CryptoCurrency/comments/s588se/what_would_you_do_if_the_bear_market_hits/",
  "subreddit": "CryptoCurrency",
  "id": "s588se",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I for one don’t think it’s here yet but all those bearish posts got me thinking.\nWhat would the majority do during it? We all say we will buy the dip like madmen\nbut do we all really have the balls to do that when we see our portfolio going\n-90%?\n\nI have been in 2 crashes and been DCAing in the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はまだその時期が来ているとは思っていませんが、弱気な書き込みを見て考えさせられました。\nその時、大多数の人はどうするのだろう？私たちは皆、狂ったようにディップを買うと言います。\nしかし、私たちのポートフォリオが大きく変化しているのを見たとき、本当にそんなことをする勇気があるのだろうか？\n-90%?\n\n私はこれまで2回の暴落を経験し、その中でDCAを行ってきました...",
      "title": "ベアマーケットが来たらどうする？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为它还没有到来，但所有这些看跌的帖子让我思考。\n大多数人在这期间会做什么？我们都说我们会像疯子一样买入下跌的股票\n但当我们看到自己的投资组合在下跌时，我们真的有勇气这样做吗？\n-90%?\n\n我已经经历了两次崩盘，并且一直在进行DCA。",
      "title": "如果熊市来临，你会怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲它還沒有到來，但所有這些看跌的帖子讓我思考。\n大多數人在這期間會做什麼？我們都說我們會像瘋子一樣買入下跌的股票\n但當我們看到自己的投資組合在下跌時，我們真的有勇氣這樣做嗎？\n-90%?\n\n我已經經歷了兩次崩盤，並且一直在進行DCA。",
      "title": "如果熊市來臨，你會怎麼做？"
    }
  ]
}