{
  "author": "broken_shoelace_jw",
  "original_created_utc": 1655311640,
  "title": "I’m so excited about this crash that i can’t stand it.",
  "created_utc": 1655325379,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am a working college student. I grew up extremely poor and still struggle. &lt;/p&gt;\n\n&lt;p&gt;I first invested in some stock during the Covid crash in 2020 and ended up making a few hundred dollars. &lt;/p&gt;\n\n&lt;p&gt;Shortly after, crypto caught my interest. I bought Ethereum starting around the 800 mark and some on the way up. I made a few thousand on that.&lt;/p&gt;\n\n&lt;p&gt;While that isn’t much to most people, it was a lot to me. Ever since, i’ve said the next big crash i will be loading up. Everyone is panicking and worrying and i am just foaming to buy. &lt;/p&gt;\n\n&lt;p&gt;I will be putting every extra penny i have into btc/eth as i already have been. Mostly Ethereum. &lt;/p&gt;\n\n&lt;p&gt;This is what everyone always waits for and now people are scared to buy????&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 349,
  "permalink": "/r/CryptoCurrency/comments/vcywe0/im_so_excited_about_this_crash_that_i_cant_stand/",
  "subreddit": "CryptoCurrency",
  "id": "vcywe0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am a working college student. I grew up extremely poor and still struggle.\n\nI first invested in some stock during the Covid crash in 2020 and ended up\nmaking a few hundred dollars.\n\nShortly after, crypto caught my interest. I bought Ethereum starting around the\n800 mark and some on the way up. I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は社会人の大学生です。極貧で育ち、今も苦労しています。\n\n2020年のコビド暴落の時に初めて株に投資して、結局数百ドル\n数百ドル儲けました。\n\nその直後、暗号に興味を持ちました。私はイーサリアムを800円台から買い始め\nイーサリアムは800円台から買い始め、その後、上昇に転じました。I...",
      "title": "このクラッシュが楽しみで仕方がない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一名工作的大学生。我从小就非常贫穷，现在仍然在挣扎。\n\n我在2020年Covid股灾期间第一次投资了一些股票，最终\n赚了几百美元。\n\n不久之后，加密货币引起了我的兴趣。我从800元左右开始买入以太坊\n800大关，还有一些在上涨的路上。I...",
      "title": "我对这次坠机如此兴奋，以至于我无法忍受。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一名工作的大學生。我從小就非常貧窮，現在仍然在掙扎。\n\n我在2020年Covid股災期間第一次投資了一些股票，最終\n賺了幾百美元。\n\n不久之後，加密貨幣引起了我的興趣。我從800元左右開始買入以太坊\n800大關，還有一些在上漲的路上。I...",
      "title": "我對這次墜機如此興奮，以至於我無法忍受。"
    }
  ]
}