{
  "author": "throwawaybloggertest",
  "original_created_utc": 1625384742,
  "title": "Is the disdain towards analytic philosophy from continental philosophers today warranted?",
  "created_utc": 1625448476,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been on a continental read now (due to Bentley Hart lol) and have had some interactions with continental philosophers. It seems to me that almost all of them have a certain disdain for analytic philosophy, maybe more than vice versa from contemporary analytic philosophers who are more charitable. The criticisms usually are analytic philosophy does not understand the human condition, trivialises important things as games, doesn&#39;t understand the history and the language required, inadequately approaches complex topics etc. (An example my friend gives is the Moorean shift; it&#39;s just a language game that doesn&#39;t convince anyone who don&#39;t already accept the conclusion).</p>\n\n<p>Now I do recognise that this is probably a reaction to analytic philosophy championing itself as superior towards most of the 20th century, but analytic philosophy has changed a lot from the 20th century to today (especially after the downfall of positivism).  Are continental philosophers not aware of the progress made in analytic tradition? Is there more to this than just posturing?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/odfr04/is_the_disdain_towards_analytic_philosophy_from/",
  "subreddit": "askphilosophy",
  "id": "odfr04",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been on a continental read now (due to Bentley Hart lol) and have had some\ninteractions with continental philosophers. It seems to me that almost all of\nthem have a certain disdain for analytic philosophy, maybe more than vice versa\nfrom contemporary analytic philosophers who are more…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は今、大陸的な読み方をしていて（ベントレー・ハートの影響です(笑)）、いくつかの\n大陸の哲学者との交流もあります。彼らのほとんど全員が分析哲学を軽蔑しているように思えます。\n彼らは分析哲学に対してある種の嫌悪感を抱いているように思えます。おそらくその逆もまた然りです。\n現代の分析哲学者の中には、もっと...",
      "title": "今日、大陸の哲学者が分析哲学を軽蔑しているのは正当なことなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我现在一直在进行大陆式阅读（由于本特利-哈特的缘故），并且有一些\n与欧洲大陆的哲学家进行了一些交流。在我看来，几乎所有的\n他们几乎都对分析哲学有某种轻蔑，也许比反之更多。\n从当代分析哲学家中，他们更...",
      "title": "今天大陆哲学家对分析哲学的轻视是否有道理？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我現在一直在進行大陸式閱讀（由於本特利-哈特的緣故），並且有一些\n與歐洲大陸的哲學家進行了一些交流。在我看來，幾乎所有的\n他們幾乎都對分析哲學有某種輕蔑，也許比反之更多。\n從當代分析哲學家中，他們更...",
      "title": "今天大陸哲學家對分析哲學的輕視是否有道理？"
    }
  ]
}