{
  "author": "gesmasjien",
  "original_created_utc": 1639662524,
  "title": "What is actually ‘ok’ during a thai massage?",
  "created_utc": 1639671800,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Since september, instead of going to a therapist like recommended I decided to spend my money on thai massages. &lt;/p&gt;\n\n&lt;p&gt;I am NOT searching for happy endings; I just want the kind of painful massages since I’m struggling with my shoulders because of climbing and I think that could be the cause of being constantly stressed out. Well, one of the causes.&lt;/p&gt;\n\n&lt;p&gt;But during my last visit, some things happened. First of all, I want to be open minded and prepared for a difference in culture. Me, being a white man grown up in Belgium, we are very closed off. Our personal bubbles are tiny. I want to expand mine.&lt;/p&gt;\n\n&lt;p&gt;Anyway here we go: when my hand was hanging a bit from the table, she pushed her crotch against it, pretty obviously.&lt;/p&gt;\n\n&lt;p&gt;When she was standing behind me massaging my torso her breasts were pushed against my face a lot. I’m ok with that but I can figure that some people will either make a problem of it, or expect more.&lt;/p&gt;\n\n&lt;p&gt;We started talking near the end and because I was ticklish at my feet she started to tease me by testing out other parts of my body. Again, no problem, no boundaries were crossed.&lt;/p&gt;\n\n&lt;p&gt;During my leg massages her hand/arm repeatingly touched my balls/penis, this is something that I think just happens. &lt;/p&gt;\n\n&lt;p&gt;So; is this all sketchy? I wonder because I don’t want to give the impression I’m coming for more than a massage. I also don’t wanna be lured into stuff. Well I won’t, but it could make things awkward and I kinda like this place.&lt;/p&gt;\n\n&lt;p&gt;As a Belgian I’m afraid to ask them openly.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 124,
  "permalink": "/r/NoStupidQuestions/comments/rhr3z4/what_is_actually_ok_during_a_thai_massage/",
  "subreddit": "NoStupidQuestions",
  "id": "rhr3z4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Since september, instead of going to a therapist like recommended I decided to\nspend my money on thai massages.\n\nI am NOT searching for happy endings; I just want the kind of painful massages\nsince I’m struggling with my shoulders because of climbing and I think that\ncould be the cause of being…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "9月からは、薦められるままにセラピストに行く代わりに\nタイ式マッサージにお金をかけています。\n\n私はハッピーエンドを求めているわけではなく、ただただ痛いマッサージを望んでいるのです。\n登山で肩こりに悩まされていて、それが原因だと思うので。\nが原因かもしれませんね...。",
      "title": "タイ古式マッサージでは、実際に何が「OK」なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自9月以来，我没有像建议的那样去找治疗师，而是决定\n把钱花在泰式按摩上。\n\n我不是在寻找快乐的结局，我只是想要那种痛苦的按摩。\n因为我因为爬山而与我的肩膀作斗争，我认为这可能是导致我的...\n我认为这可能是导致我的肩膀疼痛的原因。",
      "title": "在泰式按摩中，什么是真正的 \"可以\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自9月以來，我沒有像建議的那樣去找治療師，而是決定\n把錢花在泰式按摩上。\n\n我不是在尋找快樂的結局，我只是想要那種痛苦的按摩。\n因爲我因爲爬山而與我的肩膀作鬥爭，我認爲這可能是導致我的...\n我認爲這可能是導致我的肩膀疼痛的原因。",
      "title": "在泰式按摩中，什麼是真正的 \"可以\"？"
    }
  ]
}