{
  "author": "velvetblunder",
  "original_created_utc": 1635161963,
  "title": "What are your worst performing crypto? Lets start the anti-shillings",
  "created_utc": 1635176146,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello Guys!!!</p>\n\n<p>People usually share their best performing cryptocurrency or some gamble that went their way.\nBut ignore the worst performing cryptocurrency in their portfolio.<br/>\nSo what are the cryptocurrency that you regret buying and see no future scope for them now.  </p>\n\n<p>Start the anti shillings.  </p>\n\n<p>Here&#39;s mine  </p>\n\n<p>I bought WINK at average price of $0.0014 and today&#39;s price is $0.00064.<br/>\nIts down by 56% and I dont even feel like DCAing into it.\nIf it does not recover in this bull run I would definitely sell it.</p>\n\n<p>So all the newbie dont FOMO in and Do Your Own Research(DYOR)</p>\n</div><!-- SC_ON -->",
  "score": 247,
  "permalink": "/r/CryptoCurrency/comments/qfethx/what_are_your_worst_performing_crypto_lets_start/",
  "subreddit": "CryptoCurrency",
  "id": "qfethx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello Guys!!!\n\nPeople usually share their best performing cryptocurrency or some gamble that\nwent their way. But ignore the worst performing cryptocurrency in their\nportfolio.\nSo what are the cryptocurrency that you regret buying and see no future scope\nfor them now.\n\nStart the anti…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "みんな、こんにちは！！。\n\n人々は通常、最高のパフォーマンスをした暗号通貨や、自分の思い通りになったギャンブルを共有します。\n自分の思い通りになった しかし、彼らのポートフォリオの中で最もパフォーマンスの悪い暗号通貨は無視します。\nポートフォリオの中で最も成績の悪い暗号通貨は無視します。\nでは、あなたが買ったことを後悔している暗号通貨は何ですか？\n今、あなたが買って後悔している暗号通貨は何ですか？\n\nアンチを始めよう。",
      "title": "最もパフォーマンスの低い暗号は何ですか？アンチ・シリングを始めよう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好！！！。\n\n人们通常会分享他们表现最好的加密货币或一些赌博的情况\n他们的方式。但忽略了他们投资组合中表现最差的加密货币。\n投资组合。\n那么，有哪些加密货币是你后悔买入的，并且看不到未来的空间\n为他们现在。\n\n开始反...",
      "title": "你表现最差的加密货币是什么？让我们开始反先令"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好！！！。\n\n人們通常會分享他們表現最好的加密貨幣或一些賭博的情況\n他們的方式。但忽略了他們投資組合中表現最差的加密貨幣。\n投資組合。\n那麼，有哪些加密貨幣是你後悔買入的，並且看不到未來的空間\n爲他們現在。\n\n開始反...",
      "title": "你表現最差的加密貨幣是什麼？讓我們開始反先令"
    }
  ]
}