{
  "author": "-acidlean-",
  "original_created_utc": 1636209867,
  "title": "Why don't we put toys and playgrounds in \"adult\" places?",
  "created_utc": 1636225152,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t know how to word it better. I mean, a lot of adults LOVE to play. You just don&#39;t stop loving Lego or electric toy trains as you turn 18. You don&#39;t stop enjoying playing on a slide or swing. As adults we have to go to &quot;adult&quot; places to do &quot;adult&quot; things, fill documents and wait in lines and as I see, many adults don&#39;t enjoy just sitting on a chair or standing in a line. We make play rooms for kids so they don&#39;t get bored when we go shopping or something, and they swim in pools filled with plastic balls, they jump on trampolines, they build houses from lego, they play with hot wheels cars... Why don&#39;t we do that for adults? It would make us calmer and enjoy life a bit more I think. We wouldn&#39;t get dirty because plastic balls can&#39;t stain your white collar and you will slide down the slide perfectly in your pencil skirt. Is there a reason or did people just not think about that before?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/qo1pao/why_dont_we_put_toys_and_playgrounds_in_adult/",
  "subreddit": "TooAfraidToAsk",
  "id": "qo1pao",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don't know how to word it better. I mean, a lot of adults LOVE to play. You\njust don't stop loving Lego or electric toy trains as you turn 18. You don't\nstop enjoying playing on a slide or swing. As adults we have to go to \"adult\"\nplaces to do \"adult\" things, fill documents and wait in lines and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "どう言えばいいのかわからない。つまり、多くの大人たちは遊びが大好きなのです。あなたが\n18歳になっても、レゴや電車のおもちゃが好きなのは変わりません。滑り台やブランコで\n滑り台やブランコで遊ぶのが楽しくなくなることはありません。大人になると、「大人の」場所に行って「大人の」ことをしなければなりません。\n大人の場所に行って大人のことをしたり、書類を書いたり、行列に並んだり...。",
      "title": "おもちゃや遊び場を「大人」の場所に置くのはいかがなものか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道怎么说才好。我的意思是，很多成年人都喜欢玩。你\n你不会在18岁时停止对乐高或电动玩具火车的喜爱。你不会\n停止喜欢玩滑梯或秋千。作为成年人，我们必须去 \"成年人 \"的地方做 \"成年人 \"的事。\n去做 \"成人 \"的事情，填写文件，排队等候......",
      "title": "为什么我们不把玩具和游乐场放在 \"成人 \"地方？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道怎麼說纔好。我的意思是，很多成年人都喜歡玩。你\n你不會在18歲時停止對樂高或電動玩具火車的喜愛。你不會\n停止喜歡玩滑梯或鞦韆。作爲成年人，我們必須去 \"成年人 \"的地方做 \"成年人 \"的事。\n去做 \"成人 \"的事情，填寫文件，排隊等候......",
      "title": "爲什麼我們不把玩具和遊樂場放在 \"成人 \"地方？"
    }
  ]
}