{
  "author": "Chicky_Nuggy",
  "original_created_utc": 1630798937,
  "title": "Post a coin and I will tell you why it's a smart investment.",
  "created_utc": 1630838621,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Way too much fud in here lately and quite frankly, some people on here are just rude. </p>\n\n<p>Not in this thread! This is good vibes only. </p>\n\n<p>Post your coin and I (Chicky Nuggy - expert in pretty much everything besides skiing) will tell you why it&#39;s a great choice and the benefits of owning such a noble coin.</p>\n\n<p>Please feel free to chime in if you see a coin and you would also like to compliment it too, I&#39;ll throw awards and tips out like you&#39;re a cheap Ukrainian hooker. (expensive Ukrainian hookers are also available) </p>\n\n<p>Love Chicky Nuggy, CCE (certified crypto expert)</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/CryptoCurrency/comments/pi28y5/post_a_coin_and_i_will_tell_you_why_its_a_smart/",
  "subreddit": "CryptoCurrency",
  "id": "pi28y5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Way too much fud in here lately and quite frankly, some people on here are just\nrude.\n\nNot in this thread! This is good vibes only.\n\nPost your coin and I (Chicky Nuggy - expert in pretty much everything besides\nskiing) will tell you why it's a great choice and the benefits of owning such a\nnoble…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、このサイトでは、あまりにも多くのフンドシが使われていて、率直に言って、ここの一部の人々は、ただ単に失礼なだけです。\n失礼な人もいます。\n\nこのスレッドではやめておきましょう。ここは良い雰囲気の場所です。\n\nあなたのコインを投稿すれば、私（Chicky Nuggy - スキー以外のすべてのことに精通しています）が、それが素晴らしい選択である理由を教えます。\n私（Chicky Nuggy - スキー以外のすべてのことに精通しています）が、そのコインがなぜ素晴らしい選択なのか、そしてそのような高貴なものを所有することの利点を教えます。\n高貴なもの",
      "title": "コインを投稿すれば、なぜそれが賢い投資なのかを教えてくれるでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近这里有太多的假货，坦率地说，这里的一些人只是\n粗鲁。\n\n不要在这个线程中! 这里只有好的氛围。\n\n发布你的硬币，我（Chicky Nuggy--除了滑雪以外几乎所有事情的专家\n滑雪的专家）会告诉你为什么它是一个伟大的选择，以及拥有这样一个\n崇高的...",
      "title": "发布一个硬币，我会告诉你为什么它是一个聪明的投资。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近這裏有太多的假貨，坦率地說，這裏的一些人只是\n粗魯。\n\n不要在這個線程中! 這裏只有好的氛圍。\n\n發佈你的硬幣，我（Chicky Nuggy--除了滑雪以外幾乎所有事情的專家\n滑雪的專家）會告訴你爲什麼它是一個偉大的選擇，以及擁有這樣一個\n崇高的...",
      "title": "發佈一個硬幣，我會告訴你爲什麼它是一個聰明的投資。"
    }
  ]
}