{
  "author": "KajinMitan",
  "original_created_utc": 1629922871,
  "title": "I have been with Coinbase for nearly 8 years. Recently, Coinbase decided to \"review\" my account for the 100th time, without cause or explanation. They have restricted me from trading for 3 months during a volatile bullmarket. Coinbase is now CENSORING my posts. More info in comments.",
  "created_utc": 1629930869,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Copy-pasted from my recent <a href=\"/r/Coinbase\">/r/Coinbase</a> submission, which was deliberately removed (censored) by <a href=\"/u/coinbasesupport\">/u/coinbasesupport</a>. </p>\n\n<p><a href=\"https://i.imgur.com/wC3SPI6.png\">Screenshot of Coinbase&#39;s censorship</a></p>\n\n<p>The original content:</p>\n\n<p>---</p>\n\n<p>I am posting this to warn other long-time and fully verified Coinbase customers. You should know your loyalty means nothing to Coinbase. I have been with Coinbase almost from the start of their exchange, but Coinbase is treating me like I just arrived. My account has been fully verified and fully KYC-compliant from the beginning, but Coinbase just blocked me from trading and funding my account for no reason at all.</p>\n\n<p>Approximately four weeks, I created several threads on Reddit about a notice I received from Coinbase. The notice stated an upcoming (yet unexplained) account review during which I won&#39;t be able to trade or fund my account. Withdrawals wouldn&#39;t be affected. Naturally, I have withdrawn everything from Coinbase.</p>\n\n<p>On Reddit, <a href=\"/u/coinbasesupport\">/u/coinbasesupport</a> publicly promised to expedite my case and get back to me within five business days. That was nearly four weeks ago. They never resolved my case and instead just close my original case (case ---).</p>\n\n<p>I created another ticket and a thread on Reddit in response. Same thing happened: public promises–but no action.</p>\n\n<p>Several days ago, I received an auto-generated email from Coinbase requesting information and supporting documentation in order to, for the 100th time, verify my account. I sent all the required information within one day of receiving that request. No problem because, like previously stated, I have been fully KYC compliant since day one. </p>\n\n<p>I just received another Coinbase email where they state that, despite having received all the information and documentation they requested from me, the account review still may take up to 3 months! So I basically wasted the past month communicating with Coinbase and creating threads on Reddit. I highly doubt a real person has read a single of my emails in full. This is beyond frustrating and is borderline criminal behaviour.</p>\n\n<p>There is nothing I did that could have triggered this &quot;review&quot;, so all I can do is speculate. For example, is Coinbase trying to manipulate the market by disabling certain accounts from trading? Coinbase&#39;s behaviour is negatively affecting the entire crypto industry; it&#39;s causing people to lose trust and confidence in so-called regulated exchanges. What point is there in giving up all my personal information when you decide to ignore it anyway?</p>\n\n<p>In before <a href=\"/u/coinbasesupport\">/u/coinbasesupport</a> asks for a ticket ID: there is no ticket ID for the account review because it was initiated by Coinbase. I already replied to that email with all the requested information. I uploaded the requested documentation via SendSafely. You can use the SendSafely ID to link it to my case, which is: </p>\n\n<p>(---)</p>\n\n<p>I also created a fresh ticket where I ask my case to be expedited (because you promised four weeks ago). The new ticket ID is (---).</p>\n\n<p>It&#39;s a shame that this is how Coinbase treats its long-time and loyal customers. It shows that &quot;loyalty&quot; to Coinbase isn&#39;t worth anything to the company. </p>\n\n<p>Looking forward to hearing from you. But just to be on the safe side, I don&#39;t expect to be hearing from you at all.</p>\n</div><!-- SC_ON -->",
  "score": 203,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/lQ-PK1BkqXYFK2eu8FWGxQtdZkcz_A2JTKtsa00hwAA.png?auto=webp&s=83053653d539fb4a2f38d4ef3b3b843fd035912a",
          "width": 4352,
          "height": 292
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/lQ-PK1BkqXYFK2eu8FWGxQtdZkcz_A2JTKtsa00hwAA.png?width=108&crop=smart&auto=webp&s=ceb5185e2a38ad7276042647e7b1d85ce62fb9d7",
            "width": 108,
            "height": 7
          },
          {
            "url": "https://external-preview.redd.it/lQ-PK1BkqXYFK2eu8FWGxQtdZkcz_A2JTKtsa00hwAA.png?width=216&crop=smart&auto=webp&s=ca2b503ec90196174195603ff6ab0f8d9de8ef06",
            "width": 216,
            "height": 14
          },
          {
            "url": "https://external-preview.redd.it/lQ-PK1BkqXYFK2eu8FWGxQtdZkcz_A2JTKtsa00hwAA.png?width=320&crop=smart&auto=webp&s=eb6c00d03cf8aeeb5ef845997d751a16f7a3c7b3",
            "width": 320,
            "height": 21
          },
          {
            "url": "https://external-preview.redd.it/lQ-PK1BkqXYFK2eu8FWGxQtdZkcz_A2JTKtsa00hwAA.png?width=640&crop=smart&auto=webp&s=c3eb530b20dfae3e4894c74a704d7728a3ff1e0f",
            "width": 640,
            "height": 42
          },
          {
            "url": "https://external-preview.redd.it/lQ-PK1BkqXYFK2eu8FWGxQtdZkcz_A2JTKtsa00hwAA.png?width=960&crop=smart&auto=webp&s=e1628c2ea6af6d021b92a4df3d041d5e982af6fa",
            "width": 960,
            "height": 64
          },
          {
            "url": "https://external-preview.redd.it/lQ-PK1BkqXYFK2eu8FWGxQtdZkcz_A2JTKtsa00hwAA.png?width=1080&crop=smart&auto=webp&s=09c17edd11b9e358f2a0b9b5f56fc62971aa305a",
            "width": 1080,
            "height": 72
          }
        ],
        "variants": {},
        "id": "AJKJ9ZLI8J26_f9_lq4ZbH9WUujUUULYKIh601R3qSE"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/pbjj28/i_have_been_with_coinbase_for_nearly_8_years/",
  "subreddit": "Bitcoin",
  "id": "pbjj28",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Copy-pasted from my recent /r/Coinbase submission, which was deliberately\nremoved (censored) by /u/coinbasesupport.\n\nScreenshot of Coinbase's censorship [https://i.imgur.com/wC3SPI6.png]\n\nThe original content:\n\n---\n\nI am posting this to warn other long-time and fully verified Coinbase customers.\nYou…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が最近投稿した /r/Coinbase からコピーペーストしたものです。\nこの投稿は、/u/coinbasesupportによって意図的に削除（検閲）されました。\n\nコインベースの検閲のスクリーンショット[https://i.imgur.com/wC3SPI6.png]\n\nオリジナルの内容です。\n\n---\n\n私は、他の長年の、そして完全に検証されたCoinbaseの顧客に警告するためにこれを投稿しています。\nあなた...",
      "title": "コインベースには8年近くお世話になっています。最近、Coinbaseは理由も説明もなく、100回目となる私のアカウントの「見直し」を決定しました。彼らは、変動の激しいブルマーケットの間、3ヶ月間私の取引を制限しました。コインベースは現在、私の投稿を制限しています。詳細はコメントでどうぞ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "从我最近提交的/r/Coinbase文件中复制的，该文件被/u/Coinbase故意删除（审查）。\n被/u/coinbasesupport删除（审查）。\n\nCoinbase的审查截图[https://i.imgur.com/wC3SPI6.png]\n\n原来的内容。\n\n---\n\n我发这个帖子是为了警告其他长期的、经过充分验证的Coinbase客户。\n你...",
      "title": "我在Coinbase已经工作了近8年。最近，Coinbase决定对我的账户进行第100次 \"审查\"，没有任何理由和解释。他们在动荡的牛市中限制了我3个月的交易。Coinbase现在正在对我的帖子进行审查。更多信息请见评论。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從我最近提交的/r/Coinbase文件中複製的，該文件被/u/Coinbase故意刪除（審查）。\n被/u/coinbasesupport刪除（審查）。\n\nCoinbase的審查截圖[https://i.imgur.com/wC3SPI6.png]\n\n原來的內容。\n\n---\n\n我發這個帖子是爲了警告其他長期的、經過充分驗證的Coinbase客戶。\n你...",
      "title": "我在Coinbase已經工作了近8年。最近，Coinbase決定對我的賬戶進行第100次 \"審查\"，沒有任何理由和解釋。他們在動盪的牛市中限制了我3個月的交易。Coinbase現在正在對我的帖子進行審查。更多信息請見評論。"
    }
  ]
}