{
  "author": "annakasporova",
  "original_created_utc": 1654283131,
  "title": "Does (late) Wittgenstein pose problems for the project of an AI that is as intelligent as a human?",
  "created_utc": 1654353649,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve begun reading some &lt;em&gt;Philosophical Investigations&lt;/em&gt;, and it strikes me that Wittgenstein&amp;#39;s critique of the strict rules of meaning, in terms of use as meaning in a language-game and furthermore family resemblance of word definitions poses some problems for a super intelligent AI that works according following rules. I don&amp;#39;t have the background in Wittgenstein or computer science to begin to answer this, but I&amp;#39;m curious if anyone knows any writing which covers this explicitly.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/v46haa/does_late_wittgenstein_pose_problems_for_the/",
  "subreddit": "askphilosophy",
  "id": "v46haa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've begun reading some Philosophical Investigations, and it strikes me that\nWittgenstein's critique of the strict rules of meaning, in terms of use as\nmeaning in a language-game and furthermore family resemblance of word\ndefinitions poses some problems for a super intelligent AI that works…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "哲学的考察」を読み始めて、印象に残っていることがあります。\nウィトゲンシュタインの厳密な意味規則に対する批判は、言語ゲームにおける意味としての使用、さらには\n言語ゲームにおける意味としての使用、さらに単語の定義の家族的類似性という点で、ウィトゲンシュタインが意味の厳格な規則を批判していることが印象的でした。\n超知的なAIが機能するためには、いくつかの問題があるようです...",
      "title": "後期）ウィトゲンシュタインは、人間と同等の知能を持つAIのプロジェクトに問題を投げかけているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我开始读一些《哲学研究》，我觉得\n维特根斯坦对意义的严格规则的批判，从作为语言游戏的使用角度来看\n在语言游戏中的意义，以及进一步的词的家族相似性方面，维特根斯坦对意义的严格规则的批判\n定义的严格规则提出了一些问题，对于一个超级智能的人工智能来说，它的工作...",
      "title": "晚期）维特根斯坦是否给像人类一样聪明的人工智能项目带来了问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我開始讀一些《哲學研究》，我覺得\n維特根斯坦對意義的嚴格規則的批判，從作爲語言遊戲的使用角度來看\n在語言遊戲中的意義，以及進一步的詞的家族相似性方面，維特根斯坦對意義的嚴格規則的批判\n定義的嚴格規則提出了一些問題，對於一個超級智能的人工智能來說，它的工作...",
      "title": "晚期）維特根斯坦是否給像人類一樣聰明的人工智能項目帶來了問題？"
    }
  ]
}