{
  "author": "AskScienceModerator",
  "original_created_utc": 1642766482,
  "title": "AskScience AMA Series: I'm the Director of the Addiction Institute at Mount Sinai who studies the neurobiological effects of cannabis and opioids. AMA!",
  "created_utc": 1642771375,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi Reddit! I&amp;#39;m Dr. Yasmin Hurd, the Director of the Addiction Institute within the Mount Sinai Behavioral Health System, and the Ward Coleman Chair of Translational Neuroscience and Professor of Psychiatry and Neuroscience at the Icahn School of Medicine at Mount Sinai in New York. I&amp;#39;m an internationally renowned neuroscientist whose translational research examines the neurobiology of drug abuse and related psychiatric disorders. My research exploring the neurobiological effects of cannabis and heroin has significantly shaped the field. Using multidisciplinary research approaches, my research has provided unique insights into the impact of developmental cannabis exposure and epigenetic mechanisms underlying the drug&amp;#39;s protracted effects into adulthood and even across generations. My basic science research is complemented by clinical laboratory investigations evaluating the therapeutic potential of novel science-based strategies for the treatment of opioid addiction and related psychiatric disorders. Based on these high-impact accomplishments and my advocacy of drug addiction education and health, I was inducted into the National Academy of Medicine, complementing other honors I have received in the field. Recently, I was featured in the NOVA PBS film &amp;quot;&lt;a href=\"https://www.youtube.com/watch?v=w-dxMTDzMLY\"&gt;The Cannabis Question&lt;/a&gt;,&amp;quot; which premiered in September and explores the little-known risks and benefits of cannabis use. I&amp;#39;ll be on at 3 p.m. (ET, 20 UT), ask me anything!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 138,
  "permalink": "/r/askscience/comments/s997hz/askscience_ama_series_im_the_director_of_the/",
  "subreddit": "askscience",
  "id": "s997hz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi Reddit! I'm Dr. Yasmin Hurd, the Director of the Addiction Institute within\nthe Mount Sinai Behavioral Health System, and the Ward Coleman Chair of\nTranslational Neuroscience and Professor of Psychiatry and Neuroscience at the\nIcahn School of Medicine at Mount Sinai in New York. I'm an…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Redditの皆さん、こんにちは。私はヤスミン・ハード博士、アディクション研究所の所長です。\nマウントサイナイ行動医療システム、およびワードコールマンチェアの\nトランスレーショナル・ニューロサイエンス、精神医学・神経科学の教授。\nニューヨークのマウントサイナイ医科大学アイカーン校。私は...",
      "title": "AskScienceのAMAシリーズ。私はマウントサイナイの中毒研究所の所長で、大麻とオピオイドの神経生物学的効果を研究しています。AMA!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，Reddit! 我是雅斯敏-赫德博士，西奈山行为健康系统中的成瘾研究所主任。\n西奈山行为健康系统的成瘾研究所主任，也是Ward Coleman翻译协会主席。\n转化神经科学主席，以及西奈山医学院精神病学和神经科学教授。\n纽约西奈山伊坎医学院教授。我是一个...",
      "title": "AskScience AMA系列。我是西奈山成瘾研究所的主任，研究大麻和阿片类药物的神经生物学影响。AMA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，Reddit! 我是雅斯敏-赫德博士，西奈山行爲健康系統中的成癮研究所主任。\n西奈山行爲健康系統的成癮研究所主任，也是Ward Coleman翻譯協會主席。\n轉化神經科學主席，以及西奈山醫學院精神病學和神經科學教授。\n紐約西奈山伊坎醫學院教授。我是一個...",
      "title": "AskScience AMA系列。我是西奈山成癮研究所的主任，研究大麻和阿片類藥物的神經生物學影響。AMA!"
    }
  ]
}