{
  "author": "reduxrealism",
  "original_created_utc": 1635167071,
  "title": "Did Roy Cohn rise to political power by blackmailing his superiors?",
  "created_utc": 1635220411,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Roy Cohn&#39;s meteoric career intrigues me. He had a lot of things going against him and is popularly described as an &quot;anti-Semitic Jew&quot; and a &quot;gay homophobe.&quot; He is perhaps best known as Trump&#39;s mentor. But who were Cohn&#39;s mentors? </p>\n\n<p>He allegedly first met FBI Director J Edgar Hoover during the Rosenberg trial, and later remarked in his autobiography that he had always been able to work “<em>well and closely with older, powerful men —Joe McCarthy, Cardinal Spellman, J. Edgar Hoover, Lewis Rosensteil, to name a significant few.&quot;</em> These older, powerful men had two things in common:</p>\n\n<ul>\n<li>They were rabid anti-Communists.</li>\n<li>They were, just like Cohn, strongly rumored to be gay while anti-gay in public.</li>\n</ul>\n\n<p>According to the memoirs of Bonanno, one of Cohn&#39;s notorious mob clients, Cohn was blackmailing Hoover for being a gay crossdresser. (True or not, they evidently remained &quot;friends&quot; and partners in crime.)  Roy also had ties of a still-unknown nature to the equally closeted archbishop of New York, Francis Cardinal Spellman. And what about Senator Joe Mccarthy? Their relationship was every kind of twisted. It certainly sounds like he may have had &quot;dirt&quot; on McCarthy too:</p>\n\n<blockquote>\n<p>The original report went into much more detail on the unusual relationship between Cohn and McCarthy.  </p>\n\n<p>When alone with Adams, McCarthy had denigrated Cohn and insisted that he sought no special treatment for Schine. But the senator remained silent when Cohn would berate Adams on the matter in McCarthy’s presence, and sometimes even added his voice to Cohn’s complaints.  </p>\n\n<p>The implication, said the brothers, was that Cohn possessed a peculiar power over McCarthy.  </p>\n\n<p>The original document, they reported, quoted McCarthy as telling Adams that he would like to get rid of Cohn but couldn’t for <em>unspecified</em> reasons.  </p>\n\n<p>- Robert W. Merry, &quot;Taking on the World: Joseph and Stewart Alsop—Guardians of the American Century&quot;, p. 275</p>\n</blockquote>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/qfgad7/did_roy_cohn_rise_to_political_power_by/",
  "subreddit": "AskHistorians",
  "id": "qfgad7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Roy Cohn's meteoric career intrigues me. He had a lot of things going against\nhim and is popularly described as an \"anti-Semitic Jew\" and a \"gay homophobe.\"\nHe is perhaps best known as Trump's mentor. But who were Cohn's mentors?\n\nHe allegedly first met FBI Director J Edgar Hoover during the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ロイ・コーンの急成長には興味がある。彼には多くの困難がありました。\n反ユダヤ主義のユダヤ人」や「ゲイのホモフォビア」と言われています。\n彼はおそらく、トランプ氏のメンターとして知られています。しかし、コーンのメンターは誰だったのでしょうか？\n\n彼が初めてFBI長官のJ・エドガー・フーバーに会ったとされるのは、その頃...",
      "title": "ロイ・コーンは上司を脅して政治的権力を得たのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "罗伊-科恩流星般的职业生涯让我感到好奇。他有很多不利于他的事情\n他有很多不利于他的事情，被人们描述为 \"反犹太的犹太人 \"和 \"同性恋恐惧症患者\"。\n他最出名的也许是特朗普的导师。但科恩的导师是谁？\n\n据称，他第一次见到联邦调查局局长J-埃德加-胡佛是在...",
      "title": "罗伊-科恩是通过敲诈他的上级而获得政治权力的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "羅伊-科恩流星般的職業生涯讓我感到好奇。他有很多不利於他的事情\n他有很多不利於他的事情，被人們描述爲 \"反猶太的猶太人 \"和 \"同性戀恐懼症患者\"。\n他最出名的也許是特朗普的導師。但科恩的導師是誰？\n\n據稱，他第一次見到聯邦調查局局長J-埃德加-胡佛是在...",
      "title": "羅伊-科恩是通過敲詐他的上級而獲得政治權力的嗎？"
    }
  ]
}