{
  "author": "Dominatee",
  "the_new_excerpt": "A user posted his 'extensive' research about how he found an account that's 2\nmonths old and how NOK is an inside job. I found this untrue as I looked at the\nother 10 people who did research on NOK and they were all old…",
  "original_created_utc": 1611700402,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "有用户发布了他的 \"广泛 \"研究，他如何找到一个账号，这个账号是2。\n个月大，NOK如何是内幕。我发现这并不真实，因为我看了一下\n其他10个做NOK研究的人，他们都是老...",
      "title": ""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有用戶發佈了他的 \"廣泛 \"研究，他如何找到一個賬號，這個賬號是2。\n個月大，NOK如何是內幕。我發現這並不真實，因爲我看了一下\n其他10個做NOK研究的人，他們都是老...",
      "title": ""
    }
  ],
  "title": "Coordinated attacks - NOK shillers today",
  "created_utc": 1611756272,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A user posted his &#39;extensive&#39; research about how he found an account that&#39;s 2 months old and how NOK is an inside job. I found this untrue as I looked at the other 10 people who did research on NOK and they were all old accounts. <a href=\"https://www.reddit.com/r/stocks/comments/l53bbw/todays_posts_about_nok_and_amc_on_this_sub/\">https://www.reddit.com/r/stocks/comments/l53bbw/todays_posts_about_nok_and_amc_on_this_sub/</a> I and saw similar post in WSB getting 1k karma to the lowest quality reserach ever: <a href=\"https://www.reddit.com/r/wallstreetbets/comments/l59loj/is_nok_being_promoted_by_outsiders_multiple/\">https://www.reddit.com/r/wallstreetbets/comments/l59loj/is_nok_being_promoted_by_outsiders_multiple/</a></p>\n\n<p>In the 2nd link, the user talked about post history in the wild accusations as a determining factor whether to trust someone, so I decided to look at his to see if he was reputable by his own standards. All his comment history had was 1000x shills of people who don&#39;t hold their pumped-up stock. People here upvoted their posts as if you agreed there was manipulation by hedge funds and bots, ironically being manipulated by people holding a certain stock that&#39;s being pumped and trying to bring down all other posts.</p>\n\n<p>Just be wary of where you get your information from. If someone is shilling or pumping a stock with not proper evidence apart from one link maybe have a peek at their previous comment&#39;s extremism.</p>\n</div><!-- SC_ON -->",
  "score": 48,
  "permalink": "/r/stocks/comments/l5pjym/coordinated_attacks_nok_shillers_today/",
  "subreddit": "stocks",
  "id": "l5pjym",
  "is_self": true,
  "media": null,
  "is_video": false
}