{
  "author": "Chicky_Nuggy",
  "original_created_utc": 1638206970,
  "title": "This is why crypto is more fun than stocks: I'm up 145% compared to 24 hours ago.",
  "created_utc": 1638237492,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just this time yesterday I was wondering what coins I&#39;m going to be buying during the dip and if this was the end of the bull run (this happens 7 times a week)</p>\n\n<p>Just checked my portfolio and it turns out I&#39;m now up 145% across all of my coins and tokens. </p>\n\n<p>I checked my stocks and I&#39;m down by like 6% which in stocks terms may aswell be a rug pull. </p>\n\n<p>Shout out to bitcoin for dragging them all back up again. I might sell some profit to buy some more CSPR  (allow me for shilling) but that coins been in a massive run all week. </p>\n\n<p>How&#39;s your coins doing thanks to the bounce back?</p>\n</div><!-- SC_ON -->",
  "score": 198,
  "permalink": "/r/CryptoCurrency/comments/r50vgj/this_is_why_crypto_is_more_fun_than_stocks_im_up/",
  "subreddit": "CryptoCurrency",
  "id": "r50vgj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Just this time yesterday I was wondering what coins I'm going to be buying\nduring the dip and if this was the end of the bull run (this happens 7 times a\nweek)\n\nJust checked my portfolio and it turns out I'm now up 145% across all of my\ncoins and tokens.\n\nI checked my stocks and I'm down by like 6%…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちょうど昨日の今頃、私はどのコインを買おうかと考えていました。\nこれがブルランの終わりではないかと考えていました（これは週に7回\n週に7回）。\n\n自分のポートフォリオをチェックしたところ、すべてのコインとトークンで145％上昇していることがわかりました。\nコインとトークンのすべてで145%上昇しました。\n\n株をチェックしたところ、6％ほど下がっていました...。",
      "title": "だからこそ、株よりも暗号の方が楽しいのです。24時間前に比べて145％も上昇しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就在昨天这个时候，我还在想我要在下跌期间购买什么硬币？\n如果这是牛市的结束（这在一周内发生7次）。\n一周发生7次）。\n\n我刚刚检查了我的投资组合，结果发现我现在在所有的\n币和代币。\n\n我检查了我的股票，我下降了大约6%......",
      "title": "这就是为什么加密货币比股票更有趣。与24小时前相比，我已经上涨了145%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就在昨天這個時候，我還在想我要在下跌期間購買什麼硬幣？\n如果這是牛市的結束（這在一週內發生7次）。\n一週發生7次）。\n\n我剛剛檢查了我的投資組合，結果發現我現在在所有的\n幣和代幣。\n\n我檢查了我的股票，我下降了大約6%......",
      "title": "這就是爲什麼加密貨幣比股票更有趣。與24小時前相比，我已經上漲了145%。"
    }
  ]
}