{
  "author": "TheMedernShairluck",
  "original_created_utc": 1626692530,
  "title": "Criticism of philosophy as such?",
  "created_utc": 1626747683,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just wanted to know if there&#39;s any good critiques of philosophy as a field of study. I&#39;m only speaking from gut-feeling, but sometimes I feel like philosophy, and hypotheticals like the trolley problem, detaches us from actual existing problems we face in the material world.</p>\n\n<p>I noticed this sentiment with recent interviews/debates with Noam Chomsky, especially in the context of the 2020 elections. And when presented with scenarios and theoretical arguments, his basic reply was essentially: &quot;let&#39;s look at this world, rather than a dream world&quot;.</p>\n\n<p>This echoes my feelings when philosophical arguments become too abstract/hypothetical/theoretical/detached from the physical conditions we face. I hope this doesn&#39;t sound too anti-intellectual. Are there any good critiques that are well thought out and aren&#39;t just anti-intellectual ranting? Thanks!</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/askphilosophy/comments/onbt1s/criticism_of_philosophy_as_such/",
  "subreddit": "askphilosophy",
  "id": "onbt1s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I just wanted to know if there's any good critiques of philosophy as a field of\nstudy. I'm only speaking from gut-feeling, but sometimes I feel like philosophy,\nand hypotheticals like the trolley problem, detaches us from actual existing\nproblems we face in the material world.\n\nI noticed this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "研究分野としての哲学に何か良い批判があるかどうかを知りたかったのです。\n研究分野としての哲学に良い批評があるかどうかを知りたいのです。あくまでも直感的な話ですが、時々、哲学を感じます。\nトロッコ問題のような仮説は、私たちが実際に直面している問題から離れているように感じます。\n哲学やトロッコ問題のような仮説は、私たちが物質的な世界で直面している実際の問題から離れているように感じることがあります。\n\n私はこのことに気づきました。",
      "title": "哲学に対する批判ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是想知道是否有任何关于哲学作为一个研究领域的好的批评。\n研究领域。我只是凭直觉说话，但有时我觉得哲学。\n和像电车问题这样的假设，使我们脱离了我们在物质世界中面临的实际存在的\n我们在物质世界中面临的问题。\n\n我注意到这一点...",
      "title": "对哲学本身的批评？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是想知道是否有任何關於哲學作爲一個研究領域的好的批評。\n研究領域。我只是憑直覺說話，但有時我覺得哲學。\n和像電車問題這樣的假設，使我們脫離了我們在物質世界中面臨的實際存在的\n我們在物質世界中面臨的問題。\n\n我注意到這一點...",
      "title": "對哲學本身的批評？"
    }
  ]
}