{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "**So the intention of this post is to talk about which companies will never reach their All-Time High stock prices**\n\n&amp;#x200B;\n\nFor me personally, I think that Peloton is a good shout. Peloton's all-time high stock price was $172, which gave the company a Market Cap of over $60 Billion at their peak. I believe that this was an absolutely insane valuation for a company that makes overpriced Exercise Bikes &amp; Treadmills. To buy one of their standard Exercise Bikes, you will need around USD $1700 which is a lot of money considering that $1700 can get you a solid Gym Membership for around 6 Years, and in a gym you have access to much more equipment than just an Exercise Bike or a Treadmill. \n\nPeloton's sales Skyrocketed during the COVID Pandemic as obviously you couldn't go to the Gym so people ordered Peloton equipment in order to still be able to keep fit whilst staying at home. This was probably the catalyst that helped Peloton to reach their ATH stock price back in Jan 2021. \n\nHowever since then, lockdown measures around the world have eased and people have started to return to the Gyms, which has naturally meant that demand for Peloton equipment has sharply declined. The decreased demand has caused Peloton's earnings reports to become gradually worse and the market has not reacted well to the sharp decline in demand for Peloton products as their stock price has declined over 80% from it's Jan 2021 peak. \n\nPeloton now trades at $26.63/Share, which gives Peloton a Market Cap of around $8.9 Billion, which is just 1/8th of what their Market Cap was 13 Months ago. This rapid fall from grace is best summed up by Peloton having to (allegedly) halt new production of their equipment in Jan 2022. This decision was taken as many of Peloton's exercise bikes were left standing in their factories unsold due to the very low demand for Peloton's products. This situation was very embarrassing for Peloton and for many (former) investors, this situation was a point of no return.\n\nHaving said this, Peloton recently got rid of their CEO John Foley, who has been widely blamed by many investors for Peloton's demise. I believe that this was a step in the right direction for Peloton, as bringing in a fresh, young CEO with innovative ideas would've been a great boost to Peloton going forward. However, Peloton's Board took the decision to replace Foley with Barry McCarthy. Whilst McCarthy can bring vast experience &amp; knowledge to stabilize Peloton in the Short-Term, you cannot ignore the fact that he is turning 70 Years Old this year, and he came out of Retirement to take on the role of Peloton CEO. Appointing a CEO like McCarthy clearly signals the intention to focus on getting Peloton sold as opposed to turning Peloton's long-term fortuned around.\n\nSo in conclusion, I think that with the right management and a clear long term vision, I think that Peloton can turn their fortunes around and could potentially become a $50-75 stock in the long-term future. However, it is also clear that the COVID Pandemic provided an unprecedented and insane boost to their sales, which caused their stock price to spike. This means that reaching a $60 Billion Market cap  (Share price of $172/Share) will be virtually impossible regardless of what any new management plans to do with Peloton.\n\n&amp;#x200B;\n\n**Feel free to share the stocks that you think will NEVER see their All-Time Highs again and also provide a thesis of why you think the company won't reach their ATHs again should you wish to do so**\n\n&amp;#x200B;\n\nThanks for reading this post and I hope you have a great day!",
  "author_fullname": "t2_2shsixew",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Which Stocks do you think will NEVER see their All-Time Highs ever again?",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "tickerdiscussion",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_t5c0ro",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.85,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 420,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Company Discussion",
  "can_mod_post": false,
  "score": 420,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1646260224,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;So the intention of this post is to talk about which companies will never reach their All-Time High stock prices&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;For me personally, I think that Peloton is a good shout. Peloton&amp;#39;s all-time high stock price was $172, which gave the company a Market Cap of over $60 Billion at their peak. I believe that this was an absolutely insane valuation for a company that makes overpriced Exercise Bikes &amp;amp; Treadmills. To buy one of their standard Exercise Bikes, you will need around USD $1700 which is a lot of money considering that $1700 can get you a solid Gym Membership for around 6 Years, and in a gym you have access to much more equipment than just an Exercise Bike or a Treadmill. &lt;/p&gt;\n\n&lt;p&gt;Peloton&amp;#39;s sales Skyrocketed during the COVID Pandemic as obviously you couldn&amp;#39;t go to the Gym so people ordered Peloton equipment in order to still be able to keep fit whilst staying at home. This was probably the catalyst that helped Peloton to reach their ATH stock price back in Jan 2021. &lt;/p&gt;\n\n&lt;p&gt;However since then, lockdown measures around the world have eased and people have started to return to the Gyms, which has naturally meant that demand for Peloton equipment has sharply declined. The decreased demand has caused Peloton&amp;#39;s earnings reports to become gradually worse and the market has not reacted well to the sharp decline in demand for Peloton products as their stock price has declined over 80% from it&amp;#39;s Jan 2021 peak. &lt;/p&gt;\n\n&lt;p&gt;Peloton now trades at $26.63/Share, which gives Peloton a Market Cap of around $8.9 Billion, which is just 1/8th of what their Market Cap was 13 Months ago. This rapid fall from grace is best summed up by Peloton having to (allegedly) halt new production of their equipment in Jan 2022. This decision was taken as many of Peloton&amp;#39;s exercise bikes were left standing in their factories unsold due to the very low demand for Peloton&amp;#39;s products. This situation was very embarrassing for Peloton and for many (former) investors, this situation was a point of no return.&lt;/p&gt;\n\n&lt;p&gt;Having said this, Peloton recently got rid of their CEO John Foley, who has been widely blamed by many investors for Peloton&amp;#39;s demise. I believe that this was a step in the right direction for Peloton, as bringing in a fresh, young CEO with innovative ideas would&amp;#39;ve been a great boost to Peloton going forward. However, Peloton&amp;#39;s Board took the decision to replace Foley with Barry McCarthy. Whilst McCarthy can bring vast experience &amp;amp; knowledge to stabilize Peloton in the Short-Term, you cannot ignore the fact that he is turning 70 Years Old this year, and he came out of Retirement to take on the role of Peloton CEO. Appointing a CEO like McCarthy clearly signals the intention to focus on getting Peloton sold as opposed to turning Peloton&amp;#39;s long-term fortuned around.&lt;/p&gt;\n\n&lt;p&gt;So in conclusion, I think that with the right management and a clear long term vision, I think that Peloton can turn their fortunes around and could potentially become a $50-75 stock in the long-term future. However, it is also clear that the COVID Pandemic provided an unprecedented and insane boost to their sales, which caused their stock price to spike. This means that reaching a $60 Billion Market cap  (Share price of $172/Share) will be virtually impossible regardless of what any new management plans to do with Peloton.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Feel free to share the stocks that you think will NEVER see their All-Time Highs again and also provide a thesis of why you think the company won&amp;#39;t reach their ATHs again should you wish to do so&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Thanks for reading this post and I hope you have a great day!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "612ee368-65e6-11e5-b53f-129e4297eb59",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#f7b84f",
  "id": "t5c0ro",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "GJohannes37",
  "discussion_type": null,
  "num_comments": 170,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/t5c0ro/which_stocks_do_you_think_will_never_see_their/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/t5c0ro/which_stocks_do_you_think_will_never_see_their/",
  "subreddit_subscribers": 3703176,
  "created_utc": 1646276204,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1646260224,
  "the_new_excerpt": "So the intention of this post is to talk about which companies will never reach\ntheir All-Time High stock prices\n\n\n\nFor me personally, I think that Peloton is a good shout. Peloton's all-time high\nstock price was $172, which gave the company a Market Cap of over $60 Billion at\ntheir peak. I believe…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで、この記事の意図は、どの企業が決して到達しないかについて話すことです。\n史上最高値の株価\n\n\n\n私個人としては、Pelotonが狙い目だと思います。Pelotonの史上最高値は\n株価は172ドルで、時価総額は600億ドル以上となりました。\nピーク時 私は...",
      "title": "今後、史上最高値を更新することはないと思う銘柄は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，这篇文章的目的是谈论哪些公司将永远不会达到其历史最高股价。\n他们的历史最高股价\n\n\n\n就我个人而言，我认为Peloton是一个不错的选择。Peloton的历史最高价\n股价为172美元，这使该公司的市值超过了600亿美元。\n他们的峰值。我相信...",
      "title": "你认为哪些股票将永远不会再看到其历史最高点？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，這篇文章的目的是談論哪些公司將永遠不會達到其歷史最高股價。\n他們的歷史最高股價\n\n\n\n就我個人而言，我認爲Peloton是一個不錯的選擇。Peloton的歷史最高價\n股價爲172美元，這使該公司的市值超過了600億美元。\n他們的峯值。我相信...",
      "title": "你認爲哪些股票將永遠不會再看到其歷史最高點？"
    }
  ],
  "source_updated_at": 1646386895557
}