{
  "author": "rather_be_hiking",
  "the_new_excerpt": "Why are we ok with the moderators earning huge amounts of MOONs each\ndistribution cycle while we continue to have less available to earn? For those\nnot aware, we have 7 mods with 2.7 million MOONs now between them. All of us\ngetting excited about our few MOON tokens just makes their huge shares…",
  "original_created_utc": 1620714315,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜ、モデレーターが毎回大量のMOONを稼いでいるのに\n稼げる量が少なくなっているのに、なぜモデレーターが配信サイクルごとに大量のMOONを稼ぐことができるのでしょうか？ご存知ない方もいるかもしれませんが\n7人のモデレーターが270万個のMOONを持っていることを知らない人もいるでしょう。私たち全員が\n私たちが少ない MOON トークンに興奮していると、彼らの莫大な株が増えるだけです。",
      "title": "Controversial Question"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为什么我们可以接受版主在每个分配周期赚取大量的月亮\n分发周期，而我们可以赚到的钱却越来越少？对于那些\n不知道的人，我们有7个版主，现在他们之间有270万个MOONs。我们所有的人\n对我们为数不多的MOON代币感到兴奋，只是让他们的巨大份额......",
      "title": "有争议的问题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲什麼我們可以接受版主在每個分配週期賺取大量的月亮\n分發週期，而我們可以賺到的錢卻越來越少？對於那些\n不知道的人，我們有7個版主，現在他們之間有270萬個MOONs。我們所有的人\n對我們爲數不多的MOON代幣感到興奮，只是讓他們的巨大份額......",
      "title": "有爭議的問題"
    }
  ],
  "title": "Controversial Question",
  "created_utc": 1620722665,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Why are we ok with the moderators earning huge amounts of MOONs each distribution cycle while we continue to have less available to earn?  For those not aware,  we have 7 mods with 2.7 million MOONs now between them.  All of us getting excited about our few MOON tokens just makes their huge shares earn value more quickly.  Centralization and control is not what crypto is about.  It will be a miracle if this post lasts one minute.</p>\n\n<p>UPDATE: The aggressive downvoting in this thread is interesting.  Mod-like superpowers.</p>\n</div><!-- SC_ON -->",
  "score": 5963,
  "permalink": "/r/CryptoCurrency/comments/n9qilp/controversial_question/",
  "subreddit": "CryptoCurrency",
  "id": "n9qilp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985992425
}