{
  "author": "fan_of_hakiksexydays",
  "original_created_utc": 1651075966,
  "title": "Your seed phrase: Some of the worst mistakes you can make when storing your seed. And some tricks to help you store it better.",
  "created_utc": 1651095714,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;edit: try not to give clues on where you seed is stored, in your comments.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Once you get a decent amount in your bags, and it becomes more than what you want to leave on an exchange, you may have to start dealing with managing your own wallet and your backup seed phrase, which you have to store securely.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s those 12-24 random words that serves as a way to recover your wallet.&lt;/p&gt;\n\n&lt;h1&gt;The don&amp;#39;ts:&lt;/h1&gt;\n\n&lt;h1&gt;1- Settling for just paper.&lt;/h1&gt;\n\n&lt;p&gt;We have a lot of papers, mail, cards, etc, passing through our daily lives. Another piece of paper can get lost in the mix. It&amp;#39;s crazy how pieces of papers we think we&amp;#39;ve stored securely, sometimes just vanish.&lt;/p&gt;\n\n&lt;p&gt;Worse....paper is not durable. If your house is flooded, burns down, that paper could get easily destroyed.&lt;/p&gt;\n\n&lt;p&gt;If you have thousands of dollars, do you want it to be backed up on something that can easily burn away?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/ifaefshzc3w81.jpg?width=600&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=5574f661de71ca9b3de3cb4e8df2633ce50f1058\"&gt;https://preview.redd.it/ifaefshzc3w81.jpg?width=600&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=5574f661de71ca9b3de3cb4e8df2633ce50f1058&lt;/a&gt;&lt;/p&gt;\n\n&lt;h1&gt;2- Printing your seed.&lt;/h1&gt;\n\n&lt;p&gt;Most people know better not to store their seed online, on their computer, phone, or any device with an online connection. But many don&amp;#39;t realize that printers have a network connection to their computer.&lt;/p&gt;\n\n&lt;p&gt;Printers are a weak point of entry for an attack. It&amp;#39;s typically one of the weakest point in a network.&lt;/p&gt;\n\n&lt;p&gt;On top of that, everything you print gets temporarily stored on your printer, long after you&amp;#39;ve finished and turned off your printer.&lt;/p&gt;\n\n&lt;p&gt;The last thing you want stored on your printer is your seed phrase.&lt;/p&gt;\n\n&lt;h1&gt;3- Putting your seed in a portable safe.&lt;/h1&gt;\n\n&lt;p&gt;Safe make it obvious where you store your most valuable stuff. But that&amp;#39;s OK, as long as no one can break in, or worse just pick it up. There&amp;#39;s nothing worse than a safe that someone can just lift and carry, even if it may take two people.&lt;/p&gt;\n\n&lt;p&gt;The only case where you would do this. Is if where you live, there is very little risk of burglary, and greater risk of fire, but the funds are too small to be worth investing into a proper safe.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/3fk5x637d3w81.jpg?width=306&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=165a674f026de429fea9562ac1d7ceded074c247\"&gt;https://preview.redd.it/3fk5x637d3w81.jpg?width=306&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=165a674f026de429fea9562ac1d7ceded074c247&lt;/a&gt;&lt;/p&gt;\n\n&lt;h1&gt;4- Creating too much mental gymnastics.&lt;/h1&gt;\n\n&lt;p&gt;It&amp;#39;s not just the flimsy security that can turn against you, too much security can be your biggest enemy.&lt;/p&gt;\n\n&lt;p&gt;You still need to be able to access it, and figure it out easily. That means a year from now, you still need to be able to figure out how to find it, access it, decode it.&lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t want to have so much security that it locks you out, and you can&amp;#39;t recover your key.&lt;/p&gt;\n\n&lt;p&gt;Only have the level of security you need, and accessible enough for you.&lt;/p&gt;\n\n&lt;p&gt;You aren&amp;#39;t guarding the nuclear codes. So you don&amp;#39;t need to give yourself insane mental gymnastics to access your funds.&lt;/p&gt;\n\n&lt;h1&gt;5- Sharing your seed phrase.&lt;/h1&gt;\n\n&lt;p&gt;A seed phrase is not something you&amp;#39;ll ever need to share with anyone.&lt;/p&gt;\n\n&lt;p&gt;A seed phrase is not something people need to send you funds, or send you a prize, or reward.&lt;/p&gt;\n\n&lt;p&gt;Much less is Ledger, Trezor, or any company you&amp;#39;ve dealt with for crypto ever need your seed phrase.&lt;/p&gt;\n\n&lt;p&gt;Same when you store it. You don&amp;#39;t want to share it with the entire internet. So don&amp;#39;t leave it in the cloud. Even if it&amp;#39;s password protected, you are still leaving on someone else&amp;#39;s server. There&amp;#39;s no way to ever be sure if those servers have a backdoor vulnerability.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;5 good tricks:&lt;/h1&gt;\n\n&lt;h1&gt;1- Engraving your seed.&lt;/h1&gt;\n\n&lt;p&gt;There&amp;#39;s 3 ways to store your seed in a fire/flood proof way. Engrave it with a stamp, engrave it with a pen, or use pre-made letters.&lt;/p&gt;\n\n&lt;p&gt;From my experience, pre-made letters is the worst. It&amp;#39;s still costly, and if the trap door gets loose, you lose your seed. And the letters don&amp;#39;t seem to be impressed too well.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/omnvkpjwe3w81.jpg?width=1200&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=375b8af9c26badb465c26c4715a878ecacfb7e04\"&gt;https://preview.redd.it/omnvkpjwe3w81.jpg?width=1200&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=375b8af9c26badb465c26c4715a878ecacfb7e04&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Stamps are fine, but it&amp;#39;s more time consuming, I sometimes don&amp;#39;t get a good impression, and it&amp;#39;s not even much cheaper.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/ngtx76sxe3w81.jpg?width=1280&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=5658c6b34ddd5734f33fc6e272e2858cc1d92e01\"&gt;https://preview.redd.it/ngtx76sxe3w81.jpg?width=1280&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=5658c6b34ddd5734f33fc6e272e2858cc1d92e01&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Engraving pens are actually not expensive. You can get good ones on Amazon for $30. And you can engrave it on anything. You can control better how deep the impression will be.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/vii08iqye3w81.jpg?width=600&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=b728c3ead5928f511676140156cb08afce7daf3a\"&gt;https://preview.redd.it/vii08iqye3w81.jpg?width=600&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=b728c3ead5928f511676140156cb08afce7daf3a&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;2- A proper safe.&lt;/h1&gt;\n\n&lt;p&gt;Obviously, this is a bigger investment, so it&amp;#39;s only gonna be worth it if there&amp;#39;s big funds to safeguard behind those private keys.&lt;/p&gt;\n\n&lt;p&gt;No need to buy a $1,500 safe to protect $1,000 worth of crypto.&lt;/p&gt;\n\n&lt;p&gt;While a safe will let a burglar know where all your valuable stuff is, knowing won&amp;#39;t help much if they can&amp;#39;t break in.&lt;/p&gt;\n\n&lt;p&gt;Or at least, take too long. Every safe can be broken into. Some just take muuuch longer.&lt;/p&gt;\n\n&lt;p&gt;Make sure you have a safe that&amp;#39;s hard to break into. Don&amp;#39;t get a cheap SentrySafe. Get a good brand. Locks using keys are the easiest to break into. Get one with a keypad.&lt;/p&gt;\n\n&lt;p&gt;As I said before, don&amp;#39;t get one that a burglar can just carry off. Nor a wall safe that&amp;#39;s easy to pull off from your drywall.&lt;/p&gt;\n\n&lt;p&gt;More importantly, get a safe with a strong fire delay rating.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;3- Getting creative with your storage.&lt;/h1&gt;\n\n&lt;p&gt;If you can&amp;#39;t afford a proper safe, or don&amp;#39;t have enough funds to make it worthwhile, or are renting a place and can&amp;#39;t bolt anything to the ground, then you can always get creative at storing hiding your seed.&lt;/p&gt;\n\n&lt;p&gt;Hiding a seed phrase in accessible places, requires the help of tip #5 on my list: encryption.&lt;/p&gt;\n\n&lt;p&gt;A good rule of thumb, a good hiding place usually involves having to unscrew something.&lt;/p&gt;\n\n&lt;p&gt;But you don&amp;#39;t necessarily have to hide your plate. You can also engrave parts of your seed on things.&lt;/p&gt;\n\n&lt;p&gt;That could be any metal part in your house, or anything with any chance of resisting a fire.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/2fi89rwfy3w81.jpg?width=1600&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=4d402296017db2ef0a9676e2953127115ad1edc8\"&gt;https://preview.redd.it/2fi89rwfy3w81.jpg?width=1600&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=4d402296017db2ef0a9676e2953127115ad1edc8&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;But not all metals have the same degree of fire resistance.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ll likely lose a lot of fire resistance doing this.&lt;/p&gt;\n\n&lt;p&gt;If you are worried about fires, you&amp;#39;ll sill want to stick with a more fire resistant plate.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/nqz9kdx3h3w81.jpg?width=1200&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=aa7c5b99f926d677e4ee69031d033dde0510ddc2\"&gt;https://preview.redd.it/nqz9kdx3h3w81.jpg?width=1200&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=aa7c5b99f926d677e4ee69031d033dde0510ddc2&lt;/a&gt;&lt;/p&gt;\n\n&lt;h1&gt;4- Consider using multiple locations.&lt;/h1&gt;\n\n&lt;p&gt;You can have parts of the seed phrase in multiple places in your house, or at entirely different locations. But if you do that, losing one portion means you lose it all, so be careful.&lt;/p&gt;\n\n&lt;p&gt;You can also use multiple locations if you want multiple backups. You could give an encrypted version with a family member to put in their safe.&lt;/p&gt;\n\n&lt;h1&gt;5- Encrypt or cypher your seed.&lt;/h1&gt;\n\n&lt;p&gt;You don&amp;#39;t necessarily have to write your 24 words in order from 1 to 24, nor even write the actual words.&lt;/p&gt;\n\n&lt;p&gt;This is getting into a little bit of mental gymnastics, so be careful. But if you can keep it simple and have a method of recovering the process, it&amp;#39;s fine. Don&amp;#39;t rely on your memory to decode it a year later.&lt;/p&gt;\n\n&lt;p&gt;Basically, it&amp;#39;s scrambling or coding your seed. So even if someone finds your seed phrase, it will be jumbled.&lt;/p&gt;\n\n&lt;p&gt;With encryption, you don&amp;#39;t even need to split your seed phrase into multiple locations in your house. You can keep it all on one plate, with probably still a lot more security.&lt;/p&gt;\n\n&lt;p&gt;Just be careful where you store the decoder, or the method of decoding.&lt;/p&gt;\n\n&lt;p&gt;If all it takes is for someone to have the decoder to get your seed, then your seed is only as secure as your decoder.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a ton of methods around this. Look into different cyphers, different types of encryptions. Find one that suits you.&lt;/p&gt;\n\n&lt;p&gt;Encrypting your seed opens up the door to how you can more easily and safely store your seed phrase.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 306,
  "permalink": "/r/CryptoCurrency/comments/ud78ne/your_seed_phrase_some_of_the_worst_mistakes_you/",
  "subreddit": "CryptoCurrency",
  "id": "ud78ne",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "edit: try not to give clues on where you seed is stored, in your comments.\n\nOnce you get a decent amount in your bags, and it becomes more than what you\nwant to leave on an exchange, you may have to start dealing with managing your\nown wallet and your backup seed phrase, which you have to store…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "edit: コメントの中で、種がどこに保存されているかのヒントを与えないようにしてください。\n\nある程度の量がバッグに入っていて、交換に出したい量より多くなってきたら\n取引所に預けたい金額以上になると、自分の財布とバックアップのシードフレーズを管理する必要が出てくるかもしれません。\n自分のウォレットとバックアップのシードフレーズを管理しなければならないかもしれません。",
      "title": "Your seed phrase: 種を保存するときにやってしまいがちな失敗例。そして、より上手に保存するためのコツも紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：在你的评论中，尽量不要提供关于你的种子存放地点的线索。\n\n一旦你的袋子里有了相当数量的种子，而且它超过了你想留在交易所的数量，你可能不得不开始处理管理你的种子。\n交易所，你可能不得不开始处理管理你的\n自己的钱包和你的备份种子短语，你必须存储......"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：在你的評論中，儘量不要提供關於你的種子存放地點的線索。\n\n一旦你的袋子裏有了相當數量的種子，而且它超過了你想留在交易所的數量，你可能不得不開始處理管理你的種子。\n交易所，你可能不得不開始處理管理你的\n自己的錢包和你的備份種子短語，你必須存儲......",
      "title": "Your seed phrase: 種を保存するときにやってしまいがちな失敗例。そして、より上手に保存するためのコツも紹介します。"
    }
  ]
}