{
  "author": "Kind-Objective-7445",
  "original_created_utc": 1634913796,
  "title": "Do we really need to represent every race in every big movie?",
  "created_utc": 1634937179,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Recently I&#39;ve seen article &quot; &#39;Harry Potter&#39; had a chance to represent Indian kids like me... &quot;. Does everybody need representation in any sort of media? I watch American movies, British movies, hell even Netflix shows like maybe squid games and I really couldn&#39;t care less if they include someone from my country, my region, me ethnic group, or my skin colour. Yes there are white people in the movie but assuming that I&#39;d identify with that just cuz of skin colour is actually pretty small minded. Mention of my country is always cool, but I don&#39;t care in the slightest. What do you think? Do we really need to represent every race / ethinc group / whatever in every big movie / series?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/qdieu8/do_we_really_need_to_represent_every_race_in/",
  "subreddit": "TooAfraidToAsk",
  "id": "qdieu8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Recently I've seen article \" 'Harry Potter' had a chance to represent Indian\nkids like me... \". Does everybody need representation in any sort of media? I\nwatch American movies, British movies, hell even Netflix shows like maybe squid\ngames and I really couldn't care less if they include someone…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、「『ハリー・ポッター』は私のようなインド人の子供を代表するチャンスがあった」という記事を見ました。\n私のようなインドの子供たちを表現するチャンスがあったのに...。\". どんな種類のメディアでも、誰もが表現を必要としているのでしょうか？I\n私はアメリカの映画やイギリスの映画を見ますし、Netflixの番組では「イカのゲーム」を見ます。\n私はアメリカの映画もイギリスの映画も、Netflixのゲームも見ますが、その中に誰かが含まれていても気になりません...",
      "title": "すべての大作映画ですべての人種を表現する必要があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近我看到一篇文章：\"《哈利-波特》有机会代表印度的\n像我这样的孩子... \". 是否每个人都需要在任何类型的媒体中得到代表？I\n我看美国电影，英国电影，甚至是Netflix的节目，比如也许鱿鱼\n游戏，我真的不能关心他们是否包括某人......",
      "title": "我们真的需要在每部大电影中代表每个种族吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近我看到一篇文章：\"《哈利-波特》有機會代表印度的\n像我這樣的孩子... \". 是否每個人都需要在任何類型的媒體中得到代表？I\n我看美國電影，英國電影，甚至是Netflix的節目，比如也許魷魚\n遊戲，我真的不能關心他們是否包括某人......",
      "title": "我們真的需要在每部大電影中代表每個種族嗎？"
    }
  ]
}