{
  "author": "Warhammer100K",
  "the_new_excerpt": "The /r/wallstreetbets [https://www.reddit.com/r/wallstreetbets/] GME retail\ninvestors vs the 0.1% situation has lead me to a place of clarity. The game is\nrigged, and the owners of the system will react with haste and break any laws\nthey must to protect their cartel. For those not following the…",
  "original_created_utc": 1611905101,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "/r/wallstreetbets [https://www.reddit.com/r/wallstreetbets/] GME零售业\n投资者对0.1%的情况，让我豁然开朗。游戏是\n操纵，系统的所有者会仓促反应，违反任何法律。\n他们必须保护他们的卡特尔。对于那些没有跟随...",
      "title": "GME之后，我终于明白了比特币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "/r/wallstreetbets [https://www.reddit.com/r/wallstreetbets/] GME零售業\n投資者對0.1%的情況，讓我豁然開朗。遊戲是\n操縱，系統的所有者會倉促反應，違反任何法律。\n他們必須保護他們的卡特爾。對於那些沒有跟隨...",
      "title": "GME之後，我終於明白了比特幣"
    }
  ],
  "title": "After GME I finally understand Bitcoin",
  "created_utc": 1611912633,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The <a href=\"https://www.reddit.com/r/wallstreetbets/\">/r/wallstreetbets</a> GME retail investors vs the 0.1% situation has lead me to a place of clarity. The game is rigged, and the owners of the system will react with haste and break any laws they must to protect their cartel. For those not following the event</p>\n\n<p>- Retail investors, realised the shares of GME and some other companies were heavily shorted and in short supply, so they started buying in the hope of forcing a short squeeze (whereby the holder of the shorts will then have to buy more stock to cover their shorts, sending the price through the roof, an example is Volkswagen [VW] in the 2000&#39;s). This is perfectly legal.</p>\n\n<p>- the plan worked, GME went from $2 to $470 in a short space of time.</p>\n\n<p>- Melvin Capital, a Hedge fund took a massive (likely $6 billion) short position in GME and faced closure if the bet went against them, they were losing money at a fast rate and got a bail out last week by other wall street Hedge funds.</p>\n\n<p>- Melvin Capital then went on CNBC and other networks to reveal they had closed their short positions, it&#39;s highly unlikely as the options volume did not back up their claim, they were simply spreading disinformation, again this is perfectly legal</p>\n\n<p>- the retail investors at <a href=\"https://www.reddit.com/r/wallstreetbets/\">/r/wallstreetbets</a> simply would not give up, they kept buying, the end goal could have seen the stock reach $5K based on the VW scenario.</p>\n\n<p>- the 0.1% moved to then protect the 0.1% from losing money by using the stock brokerages they own or control(Robinhood, TD, IB and all the other big players) to firstly prevent the retail investors buying more stock, you could simply not buy these stocks, you could only sell, some companies even forcibly closed down open options positons even in the absense of margin calls, so your account is in good standing with enough liquidity and they decide which stock you can have and which you can not, in this time big institutions are allowed to buy as much of this stock as they desire, just the retail traders are locked out of the casino. This is highly illegal and known as market manipulation, it also flies in the face of the idea that we have a free market.</p>\n\n<p>- people like AOC, Elon Musk, Chamath have all come out on the site of the retail traders at <a href=\"https://www.reddit.com/r/wallstreetbets/\">/r/wallstreetbets</a> </p>\n\n<p>- Interactive Brokers chairman and founder Thomas Peterffy goes on CNBC’s “Closing Bell” an is literally weeping, explaining he feels hurt that his large, moneyed 0.1% friends are losing money due to the retail investors, oh the horror, how can these small investors make my friends lose money? Don&#39;t they know the implications of their actions? The horror.</p>\n\n<p>The guys at <a href=\"https://www.reddit.com/r/wallstreetbets/\">/r/wallstreetbets</a> simply did not understand that in our world only old money gets to make real money, the little guy must be shut down and should never have a slice of the action, all he gets is inflation and a 9 to 5 job, plus side hustle if he/she&#39;s lucky. If the little guy ever finds a way to gain an advantage the loophole is quickly closed.</p>\n\n<p>- the SEC Chair then threatens to investigate the redditors on <a href=\"https://www.reddit.com/r/wallstreetbets/\">/r/wallstreetbets</a> by tracking down their IP numbers with the help of reddit</p>\n\n<p>- The <a href=\"https://www.reddit.com/r/wallstreetbets/\">/r/wallstreetbets</a> discord server is banned.</p>\n\n<p>All the years I talked trash about bitcoin, I apologise, now I genuinely understand the value of having a system not controlled by the government, where they can not on a whim decide to inflate the money supply and bail out their friends, while you carry the load in the form of additional taxes and inflation.</p>\n</div><!-- SC_ON -->",
  "score": 3741,
  "permalink": "/r/Bitcoin/comments/l7mfd5/after_gme_i_finally_understand_bitcoin/",
  "subreddit": "Bitcoin",
  "id": "l7mfd5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518523376
}