{
  "author": "CyberPunkMetalHead",
  "original_created_utc": 1649495494,
  "title": "We're about a month away from releasing our own algorithmic crypto trading platform",
  "created_utc": 1649523228,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Myself and 6 other redditors who met on this sub have been working on an algorithmic crypto trading platform for about 8 months now and we&amp;#39;re finally getting close to releasing this application in closed beta.&lt;/p&gt;\n\n&lt;p&gt;So we started building an algorithmic crypto trading platform that allows you to automate your trading strategy whether that&amp;#39;s Daytrading, DCA, anything based on Technical Analysis and even social copy-trading.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll tell you working alongside other redditors was much easier than I expected haha, so if you find some people willing to build stuff with you on this sub, take the leap.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s some early footage of how the application will look like (might change a bit going forward):&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/s7hy5l07zgs81.jpg?width=1181&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=9834be925bb1cf4e7a3794cb6ef188e6692d5054\"&gt;Trades dashboard&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;And here is how you can give the trading bot the logic you want in terms of TA:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/hcvwfq2dzgs81.png?width=486&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=55b50d411519782e0c0d6b9af90dd956913d93bd\"&gt;TA customisation&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re going to internally test the hell out of this app for the next month or so and then finally release it in closed beta. Just so the app doesn&amp;#39;t crash in the first few minutes of the launch we&amp;#39;re going to restrict the number of closed beta testers to about 50 or so.&lt;/p&gt;\n\n&lt;p&gt;Once we&amp;#39;re confident it runs fine (and will have inevitably fixed the bugs that&amp;#39;ll come out of the closed beta) we&amp;#39;ll do an Open Beta followed by a full release.&lt;/p&gt;\n\n&lt;p&gt;Join us at &lt;a href=\"https://www.np.reddit.com/r/aesirofficial/\"&gt;r/aesirofficial&lt;/a&gt; for more updates or simply apply for closed beta access here: &lt;a href=\"https://aesircrypto.com/signup.html\"&gt;https://aesircrypto.com/signup.html&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 364,
  "permalink": "/r/CryptoCurrency/comments/tzpg2e/were_about_a_month_away_from_releasing_our_own/",
  "subreddit": "CryptoCurrency",
  "id": "tzpg2e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Myself and 6 other redditors who met on this sub have been working on an\nalgorithmic crypto trading platform for about 8 months now and we're finally\ngetting close to releasing this application in closed beta.\n\nSo we started building an algorithmic crypto trading platform that allows you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私とこのサブで知り合った6人のREDDITORは、これまで\nアルゴリズムによる暗号取引プラットフォームは、8ヶ月ほど前から導入しています。\nこのアプリケーションのクローズドベータ版のリリースが近づいてきました。\n\nそこで私たちは、アルゴリズムによる暗号取引プラットフォームの構築を開始しました...",
      "title": "独自のアルゴリズムによる暗号取引プラットフォームのリリースまであと約1カ月"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和其他6位在此子上认识的红人一直在研究一个\n算法加密货币交易平台已经有8个月的时间了，我们终于快要发布了。\n我们终于接近在封闭测试中发布这个应用程序。\n\n因此，我们开始建立一个算法的加密货币交易平台，让你...",
      "title": "我们离发布自己的算法加密货币交易平台还有大约一个月的时间"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和其他6位在此子上認識的紅人一直在研究一個\n算法加密貨幣交易平臺已經有8個月的時間了，我們終於快要發佈了。\n我們終於接近在封閉測試中發佈這個應用程序。\n\n因此，我們開始建立一個算法的加密貨幣交易平臺，讓你...",
      "title": "我們離發佈自己的算法加密貨幣交易平臺還有大約一個月的時間"
    }
  ]
}