{
  "author": "Lingweenie2",
  "the_new_excerpt": "I have my eyes on a few stocks and have already bought a few. It’s been hard\nrecently finding good companies at the markets overall valuation. To me\ndividends are important. So this is a must considering I’m building a cash\ngeneration machine.\n\nI’m trying to find stocks at bargain/cheap prices. Not…",
  "original_created_utc": 1614315396,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我看中了几只股票，已经买了几只。这很难\n最近在市场整体估值下找到好公司。对我来说\n分红很重要。所以这是必须的，考虑到我正在建立一个现金的。\n代机。\n\n我想以便宜/便宜的价格找到股票。不是...",
      "title": "最佳股息价值股，买入并做多。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看中了幾隻股票，已經買了幾隻。這很難\n最近在市場整體估值下找到好公司。對我來說\n分紅很重要。所以這是必須的，考慮到我正在建立一個現金的。\n代機。\n\n我想以便宜/便宜的價格找到股票。不是...",
      "title": "最佳股息價值股，買入並做多。"
    }
  ],
  "title": "Best dividend value stocks to buy and go long.",
  "created_utc": 1614322287,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have my eyes on a few stocks and have already bought a few. It’s been hard recently finding good companies at the markets overall valuation. To me dividends are important. So this is a must considering I’m building a cash generation machine. </p>\n\n<p>I’m trying to find stocks at bargain/cheap prices. Not exactly solid companies that are trading fairly. Not you’re usual dividend aristocrats like ABBV, T, MMM, KO, etc. </p>\n\n<p>The ones that are being over looked and hopefully trading at historical lows. </p>\n\n<p>Lately I personally have been looking at or have bought:</p>\n\n<p>REYN: Reynolds Consumer Products. Pretty new publicly, but have been around for sometime. They make more notably Reynolds wrap. Pretty decent brand for its category. Boring company but can easily pay out dividends for the foreseeable future presumably. Modest  dividend of about 2%. </p>\n\n<p>TDS: Telephone and Data Systems. The own the majority of US cellular. And have standard land line style phone business. Not one of the big boys in the sector. But I’m sure they’ll get a piece of the pie. Pretty nice dividend a bit under 4%. I’m bullish especially with 5G emerging. </p>\n\n<p>ED: Consolidated Edison. Typical boring utility stock. But the sector is arguably one of the ‘safest.’ Most of the sector is still pretty fairly priced. But ED has gotten beat up lately and they seem much too cheap. And they have a solid 4.5% or so dividend. </p>\n\n<p>PBI: Pitney Bowes. I’m getting really close to buying into this company. I’m just waiting for a bit of a price cool off. (Hopefully.) pretty small company but they deal with shipping/packaging services and general e-commerce stuff. Considering shipping needs seem to be increasing they seem to be a good pick. Plus they seem to have a descent relationship with the USPS as a supplier. And have roughly a 2.3% dividend</p>\n\n<p>These are a few I’m looking at or have bought. I’m interested in what you guys think and which buried, tucked away value dividend stocks you’re looking at that are trading at juicy prices.</p>\n</div><!-- SC_ON -->",
  "score": 1060,
  "permalink": "/r/investing/comments/lsqb55/best_dividend_value_stocks_to_buy_and_go_long/",
  "subreddit": "investing",
  "id": "lsqb55",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937740745
}