{
  "author": "BigBangZebraGirl",
  "original_created_utc": 1637499523,
  "title": "Is it bad that I'd rather die than join the military if there was another world war?",
  "created_utc": 1637505789,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t believe in supporting warfare in the slightest. Killing people to defend fictional borders just isn&#39;t my thing, and I have literally zero things within those borders I want to defend, or any good memories to make me want to defend those fictional borders.</p>\n\n<p>If I&#39;d get drafted, I&#39;d run away and either survive in the woods while on the run or just not survive at all. Warfare goes against all of my philosophical beliefs.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>EDIT: I&#39;ve actually realized in this comment section that my country&#39;s military propaganda is what&#39;s irking me the most, and that there are other reasons to fight in wars than abstract concepts.</p>\n\n<p>If my country had better propaganda, perhaps I wouldn&#39;t have made this post at all. </p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/qyugcr/is_it_bad_that_id_rather_die_than_join_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "qyugcr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don't believe in supporting warfare in the slightest. Killing people to defend\nfictional borders just isn't my thing, and I have literally zero things within\nthose borders I want to defend, or any good memories to make me want to defend\nthose fictional borders.\n\nIf I'd get drafted, I'd run away…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は戦争を支援することを微塵も信じていません。架空の国境を守るために人を殺すのは\n架空の国境を守るために人を殺すことは私の趣味ではありませんし、その国境の中で守りたいものは文字通りゼロです。\n守りたいものもないし、その架空の国境を守りたいと思わせるような良い思い出もありません。\n架空の国境を守りたいと思わせるような良い思い出もありません。\n\nもし徴兵されたら、逃げ出すだろうな...。",
      "title": "また世界大戦が起きたら、軍隊に入るよりも死んだ方がいいと思うのは悪いことですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我丝毫不相信支持战争的说法。杀人来保卫\n虚构的边界不是我的事，而且我在这些边界内没有任何东西是我想保护的。\n我在这些边界内没有任何想要捍卫的东西，也没有任何美好的回忆让我想去捍卫\n那些虚构的边界。\n\n如果我被征召，我就会逃跑......",
      "title": "如果再发生一次世界大战，我宁死也不参军，这很糟糕吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我絲毫不相信支持戰爭的說法。殺人來保衛\n虛構的邊界不是我的事，而且我在這些邊界內沒有任何東西是我想保護的。\n我在這些邊界內沒有任何想要捍衛的東西，也沒有任何美好的回憶讓我想去捍衛\n那些虛構的邊界。\n\n如果我被徵召，我就會逃跑......",
      "title": "如果再發生一次世界大戰，我寧死也不參軍，這很糟糕嗎？"
    }
  ]
}