{
  "author": "bigred91224",
  "the_new_excerpt": "I hope the mods allow this post because I'm sure there are some people who would\nlike to hear this.\n\nI sold all of my GME, BB, NOK, and AMC this morning. I used the money from\nselling these stocks and invested it into SPY and VOO (3 shares each).\n\nHaving to wake up every morning and check my phone…",
  "original_created_utc": 1612452543,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我希望版主允许这个帖子，因为我相信有一些人将会\n喜欢听这个。\n\n我今天早上卖掉了我所有的GME、BB、NOK和AMC。我用钱从\n卖出这些股票，投资到SPY和VOO（各3股）。\n\n每天早上醒来都要看手机...",
      "title": "我卖掉了我所有的备忘录股票，并将其全部投资于SPY和VOO"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我希望版主允許這個帖子，因爲我相信有一些人將會\n喜歡聽這個。\n\n我今天早上賣掉了我所有的GME、BB、NOK和AMC。我用錢從\n賣出這些股票，投資到SPY和VOO（各3股）。\n\n每天早上醒來都要看手機...",
      "title": "我賣掉了我所有的備忘錄股票，並將其全部投資於SPY和VOO"
    }
  ],
  "title": "I sold all my meme stocks and invested it all into SPY and VOO",
  "created_utc": 1612460582,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I hope the mods allow this post because I&#39;m sure there are some people who would like to hear this.  </p>\n\n<p>I sold all of my GME, BB, NOK, and AMC this morning. I used the money from selling these stocks and invested it into SPY and VOO (3 shares each).  </p>\n\n<p>Having to wake up every morning and check my phone to see how these meme stocks are doing and worrying about whether they would make me or break me just wasn&#39;t good for my mental health. I decided to end it.  </p>\n\n<p>I did lose a significant amount from these meme stocks but my portfolio is still worth money than all the money I&#39;ve transferred into it. Just goes to show the importance of keeping a diverse portfolio.  </p>\n\n<p>I feel at peace now and I feel like I can just enjoy life.  </p>\n\n<p>If you are still holding GME and AMC, I wish you the best.</p>\n</div><!-- SC_ON -->",
  "score": 2247,
  "permalink": "/r/stocks/comments/lci2wh/i_sold_all_my_meme_stocks_and_invested_it_all/",
  "subreddit": "stocks",
  "id": "lci2wh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123200915
}