{
  "author": "HistoricalReception7",
  "original_created_utc": 1642514339,
  "title": "Boss wouldn't accept my resignation letter",
  "created_utc": 1642592491,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;After several months of having my vacation time off requests denied, my staff being fired and not replaced and my work hours increased without my consent, I walked into my boss&amp;#39; office and handed her my resignation letter. I was giving 4 weeks notice, which I thought was nice. She looks at me, says &amp;quot;No. I can&amp;#39;t deal with this today.&amp;quot;, packed her stuff and left for a day of shopping on company time. &lt;/p&gt;\n\n&lt;p&gt;I went to my office, cleaned it out, finished off a day&amp;#39;s work and put my keys in her mailbox. &lt;/p&gt;\n\n&lt;p&gt;The next day I got a call from HR saying they were giving me the day off without pay to think about what I did and that I was expected to be at work the next day. &lt;/p&gt;\n\n&lt;p&gt;No thanks.&lt;/p&gt;\n\n&lt;p&gt;2 years later i&amp;#39;m living my dream life. &lt;/p&gt;\n\n&lt;p&gt;Suck it Joan.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 75072,
  "permalink": "/r/antiwork/comments/s6y54e/boss_wouldnt_accept_my_resignation_letter/",
  "subreddit": "antiwork",
  "id": "s6y54e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "After several months of having my vacation time off requests denied, my staff\nbeing fired and not replaced and my work hours increased without my consent, I\nwalked into my boss' office and handed her my resignation letter. I was giving 4\nweeks notice, which I thought was nice. She looks at me, says…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数ヶ月間、休暇の申請を却下され、部下に迷惑をかけました。\nを解雇され、私の労働時間は勝手に増やされました。\n上司のオフィスに行き、辞表を手渡した。私は4\n私はいいことだと思った。彼女は私を見て、こう言った。",
      "title": "上司が退職願を受理してくれない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "经过几个月的时间，我的休假请求被拒绝，我的员工被解雇，没有被替换，我的工作时间未经我同意而增加。\n我的员工被解雇而不被替换，我的工作时间在未经我同意的情况下被增加。\n我走进我老板的办公室，向她递交了我的辞职信。我给了4\n周的通知，我认为这很好。她看着我，说...",
      "title": "老板不接受我的辞职信"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "經過幾個月的時間，我的休假請求被拒絕，我的員工被解僱，沒有被替換，我的工作時間未經我同意而增加。\n我的員工被解僱而不被替換，我的工作時間在未經我同意的情況下被增加。\n我走進我老闆的辦公室，向她遞交了我的辭職信。我給了4\n周的通知，我認爲這很好。她看着我，說...",
      "title": "老闆不接受我的辭職信"
    }
  ]
}