{
  "author": "throwitaway9384",
  "the_new_excerpt": "I like to have time alone to myself every day, in a room. I just play stuff from\nmy mind like I would as a kid. Ill grab a pellet gun and walk around pretending\nto be a sniper, envisioning and acting out finding a spot, setting up, waiting,\ntalking with my \"spotter\". Eventually ill take my shot and…",
  "original_created_utc": 1614450724,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我喜欢每天在房间里独处的时间。我只是在房间里玩一些\n我的脑海里就像我小时候一样， 我拿起一把弹丸枪，走来走去，装作...\n要做一个狙击手，设想和行动起来找位置，布置，等待。\n与我的 \"观察者 \"交谈。最终，我将采取我的镜头和... ...",
      "title": "成年后像个孩子一样玩耍是正常的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我喜歡每天在房間裏獨處的時間。我只是在房間裏玩一些\n我的腦海裏就像我小時候一樣， 我拿起一把彈丸槍，走來走去，裝作...\n要做一個狙擊手，設想和行動起來找位置，佈置，等待。\n與我的 \"觀察者 \"交談。最終，我將採取我的鏡頭和... ...",
      "title": "成年後像個孩子一樣玩耍是正常的嗎？"
    }
  ],
  "title": "Is it normal to play like a kid as an adult?",
  "created_utc": 1614500866,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I like to have time alone to myself every day, in a room. I just play stuff from my mind like I would as a kid. Ill grab a pellet gun and walk around pretending to be a sniper, envisioning and acting out finding a spot, setting up, waiting, talking with my &quot;spotter&quot;. Eventually ill take my shot and move on. Sometimes ill grab a wooden walking stick and imagine myself as a witch/wizard going on adventures. Or act out my own versions of shows I like, Money heist is a good one. </p>\n\n<p>A scene can last for days or weeks. Itll have the same characters, running plots, all kinds of stuff. Whenever i get a chance to not be around people I just pick up wherever I left off. Im embarrassed about it, but if I dont get the chance to for a day or two it has a noticable effect on making me stressed and tense. Theres often times where im talking to someone and thinking basically &quot;I want to leave so that I can get back to my world&quot;.</p>\n\n<p>Im sure I take it too far, but is it normal to still desire to play like that when youre an adult? Like do other adults feel it too and just mutually supress it all the time to be &quot;mature&quot;?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/ltua8d/is_it_normal_to_play_like_a_kid_as_an_adult/",
  "subreddit": "TooAfraidToAsk",
  "id": "ltua8d",
  "is_self": true,
  "media": null,
  "is_video": false
}