{
  "author": "apolloandbackk",
  "original_created_utc": 1639243022,
  "title": "Whales Are Preparing For a Crash",
  "created_utc": 1639262078,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Whales are taking incremental profits by selling and buying back lower only to sell again. The same is happening in the stock market as well, where low-mid caps are getting thrashed while large caps like Microsoft and Apple skyrocket in value. &lt;/p&gt;\n\n&lt;p&gt;This gives the appearance that the market is doing good, because large caps determine the sentiment behind the DOW and S&amp;amp;P 500. &lt;/p&gt;\n\n&lt;p&gt;They offload low-mid caps, ie, riskier investments to free up cash because those investments go down the worst during a crash, and then pumping large caps so that they can give the public a hopeful sentiment that everything is okay while they offload their assets before a large crash. &lt;/p&gt;\n\n&lt;p&gt;Similarly, this is what is happening to the Crypto market. Bitcoin drops from 66k because whales take profits, they then buy and sell back and forth to make incremental profits while giving the public hope before the next leg down.&lt;/p&gt;\n\n&lt;p&gt;This is what is currently happening right now, which is why I see a major drop/crash in the Stock/Crypto market coming up here within the next few weeks.&lt;/p&gt;\n\n&lt;p&gt;Edit : Inflation, over leveraged positions, Fed Tapering, Possible increase in interest rates, the fact China’s housing market is in shambles is a good indicator of a large downtrend. This is more than likely &lt;em&gt;why&lt;/em&gt; the whales are selling, because they see economic destabilization coming soon. Omnicron was just a front for them to sell more while the actual reason remains largely unnoticed.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 186,
  "permalink": "/r/CryptoCurrency/comments/re47zl/whales_are_preparing_for_a_crash/",
  "subreddit": "CryptoCurrency",
  "id": "re47zl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Whales are taking incremental profits by selling and buying back lower only to\nsell again. The same is happening in the stock market as well, where low-mid\ncaps are getting thrashed while large caps like Microsoft and Apple skyrocket in\nvalue.\n\nThis gives the appearance that the market is doing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "クジラは、売りと買い戻しで少しずつ利益を得ている。\nまた売る。株式市場でも同じことが起こっています。\nマイクロソフトやアップルなどの大企業が急騰する一方で、大企業は打ちのめされている。\n値します。\n\nこれでは、市場がやっているように見えても...。",
      "title": "クジラは墜落に備えている"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "鲸鱼通过卖出和买回更低的价格来获取增量利润。\n再次卖出。同样的情况也发生在股票市场上，中低价位的股票受到冲击，而像微软和苹果这样的大盘股则被抛售。\n在微软和苹果这样的大盘股价值飙升的同时，中低价位的股票却受到了冲击。\n价值飙升。\n\n这给人的感觉是，市场正在做...",
      "title": "鲸鱼正在为崩溃做准备"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "鯨魚通過賣出和買回更低的價格來獲取增量利潤。\n再次賣出。同樣的情況也發生在股票市場上，中低價位的股票受到衝擊，而像微軟和蘋果這樣的大盤股則被拋售。\n在微軟和蘋果這樣的大盤股價值飆升的同時，中低價位的股票卻受到了衝擊。\n價值飆升。\n\n這給人的感覺是，市場正在做...",
      "title": "鯨魚正在爲崩潰做準備"
    }
  ]
}