{
  "author": "Vaginosis-Psychosis",
  "original_created_utc": 1655235016,
  "title": "The current inflation and recession is going to last a lot longer than you think.",
  "created_utc": 1655269252,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I see posters here suggesting that the current inflationary environment and recession situation we&amp;#39;re in will end in late 2022 or early 2023. That is highly unlikely. Here is why...&lt;/p&gt;\n\n&lt;p&gt;It takes on average 18-24 months for the inflationary results of monetary / economic policy to play out in the and appear in the real economy. The same is true for the reverse. Raising interest rates and balance sheet roll off will take time, a lot of time... and we&amp;#39;ve only just gotten started!&lt;/p&gt;\n\n&lt;p&gt;If history is any guide, inflation is here to stay for the next several years. The Fed is so far behind the curve that it will take years to tame inflation... just like in the late 70&amp;#39;s / early 80&amp;#39;s. Back then, Paul Volker raised interest rates to obscene levels in the 15-19% range. Even then, it took years for inflation to cool down. Of course, it caused a massive recession and unemployment too, i.e. stagflation.&lt;/p&gt;\n\n&lt;p&gt;Also, the Fed won&amp;#39;t be able to raise interest rates anywhere near what Volker did. The cost to service the national debt would be too high. We&amp;#39;re already paying $420 billion dollars a year to service the debt, that&amp;#39;s almost 9% of the entire federal budget. Do you really think we could afford it to consume 20-25% of the federal budget? No way.&lt;/p&gt;\n\n&lt;p&gt;If the Fed raises rates above 3%, it will actually be losing money as it will be paying more on interest to the banks on excess reserves than it brings in through its balance sheet. That is a big no no.&lt;/p&gt;\n\n&lt;p&gt;There is really only one way to fight inflation in a post-QE environment, and it&amp;#39;s not raising interest rates, it&amp;#39;s by accelerating the balance sheet roll off.&lt;/p&gt;\n\n&lt;p&gt;By accelerating the balance sheet roll off, the Fed will literally remove money from circulation. However, currently they&amp;#39;re only letting $45B per month roll off, and $90B per month by the end of summer. That isn&amp;#39;t anywhere near enough, it needs to be at least $300-400 billion per month because the Fed has a $9 Trillion balance sheet.&lt;/p&gt;\n\n&lt;p&gt;Instead the Fed is going to let inflation run hot for the next couple years or longer so get used to it.  Inflation is currently sitting at 8.6% YOY. It will probably reach 10% by the end of summer, and higher by the end of 2022. Now imagine it stays at 10% throughout next year... that&amp;#39;s 20% over 2 years. That&amp;#39;s when the real pain starts.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 324,
  "permalink": "/r/CryptoCurrency/comments/vcbgsh/the_current_inflation_and_recession_is_going_to/",
  "subreddit": "CryptoCurrency",
  "id": "vcbgsh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I see posters here suggesting that the current inflationary environment and\nrecession situation we're in will end in late 2022 or early 2023. That is highly\nunlikely. Here is why...\n\nIt takes on average 18-24 months for the inflationary results of monetary /\neconomic policy to play out in the and…"
}