{
  "author": "rrdonoo",
  "the_new_excerpt": "https://www.marketwatch.com/story/uber-investors-finally-see-the-costs-of-treating-drivers-as-employees-and-the-stock-is-falling-11620265604\n\nUber Technologies Inc. has spent and fought to keep its drivers from becoming\nclassified as employees instead of contractors, and investors finally got…",
  "original_created_utc": 1620274920,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://www.marketwatch.com/story/uber-investors-finally-see-the-costs-of-treating-drivers-as-employees-and-the-stock-is-falling-11620265604\n\nUber Technologies Inc.は、同社のドライバーが契約者ではなく従業員として分類されることを防ぐために費用をかけて戦ってきました。\nUber Technologies Inc.は、同社のドライバーが契約社員ではなく従業員として分類されないようにするために費用をかけて戦ってきました。",
      "title": "Uberの投資家は、ドライバーを従業員として扱うことのコストをようやく認識し、株価が下落しています。Uberは裁判所の認定を受けて、英国のドライバーのために6億ドルを準備しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.marketwatch.com/story/uber-investors-finally-see-the-costs-of-treating-drivers-as-employees-and-the-stock-is-falling-11620265604\n\nUber Technologies Inc.花了很多钱，并为防止其司机成为\n归类为雇员而不是承包商，而投资者终于得到了...",
      "title": "Uber的投资者终于看到了将司机当作雇员的代价，股价也在下跌。由于法院的裁决，Uber为英国司机预留了6亿美元的资金"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.marketwatch.com/story/uber-investors-finally-see-the-costs-of-treating-drivers-as-employees-and-the-stock-is-falling-11620265604\n\nUber Technologies Inc.花了很多錢，併爲防止其司機成爲\n歸類爲僱員而不是承包商，而投資者終於得到了...",
      "title": "Uber的投資者終於看到了將司機當作僱員的代價，股價也在下跌。由於法院的裁決，Uber爲英國司機預留了6億美元的資金"
    }
  ],
  "title": "Uber investors finally see the costs of treating drivers as employees, and the stock is falling. Uber sets aside $600 million for U.K. drivers as a result of court finding",
  "created_utc": 1620282745,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.marketwatch.com/story/uber-investors-finally-see-the-costs-of-treating-drivers-as-employees-and-the-stock-is-falling-11620265604\">https://www.marketwatch.com/story/uber-investors-finally-see-the-costs-of-treating-drivers-as-employees-and-the-stock-is-falling-11620265604</a></p>\n\n<p>Uber Technologies Inc. has spent and fought to keep its drivers from becoming classified as employees instead of contractors, and investors finally got a glimpse of the financial reasons on Wednesday.</p>\n\n<p>Uber UBER, -3.42% broke out $600 million from its total revenue of $3.5 billion to account “for the resolution of historical claims in the U.K. relating to the classification of drivers” in its first-quarter earnings results. That is a direct result of a U.K. Supreme Court ruling in March that led Uber to classify tens of thousands of drivers in the U.K. as employees.</p>\n\n<p>Uber disclosed in March that it could have to pay claims of back pay due from British drivers in the case, including holiday pay, wages to equal the minimum and, potentially, pension contributions. That would be on top of what the company already paid the drivers in the 2016 case.</p>\n\n<p>That puts a dollar figure on a longstanding concern about Uber and the other “gig work” companies — what it would look like financially if they had to treat drivers as employees. And it is nothing to sneeze at, blowing away the $200 million Uber and other gig companies spent to pass a new law in California in their quest for a “third way” for employment law. That win could be moot, though, as President Joe Biden’s new secretary of the Labor Department said last week drivers should receive the benefits of employment in most cases, spooking some investors.</p>\n\n<p>For more: Here is how the Biden administration could change gig work</p>\n\n<p>Uber shares initially went higher in after-hours trading Wednesday, after the company papered over the “accrual” and continuing losses with the $1.6 billion sale of its self-driving unit, but fell back to a 4.8% decline in the extended session as executives discussed increasing costs for drivers and faced an immediate question about Labor Secretary Marty Walsh’s comments.</p>\n\n<p>“When we look at the makeup of the current administration, it’s fair to say that there are individuals who have varying views on these issues. They’re not all identical in their outlook. And we think that creates space for some meaningful dialogue,” said Uber Chief Legal Officer Tony West, who worked in the Justice Department under President Barack Obama.</p>\n\n<p>The company’s standard mantra when asked about the possible costs of classifying its drivers as employees has been to say that they will pass on the costs to its users, which executives said again during Wednesday’s call. They noted that they did see a slight increase in costs in the quarter, because of driver benefits, and they were able to pass those costs on to riders, with no impact on demand.</p>\n\n<p>See also: Uber and Lyft are public, so the cheap rides are coming to an end</p>\n\n<p>“We are leaning in, with investments to support the recovery mobility and growth initiatives and delivery,” said Uber Chief Financial Officer Nelson Chai, noting that the ride-hailing company plans to invest in its driver base, and increase its spending in general, marketing and administrative costs, and in R&amp;D. Chai estimated Uber will spend between $450 million and $480 million in the second quarter, after a drop in spending last quarter. Also included will be spending on marketing to attract new drivers, as it faces driver shortages in the U.S. and Mexico.</p>\n\n<p>At the same time, Chai noted that the company continues to face “significant forecasting uncertainty and predicting posts reopening consumer behavior.”</p>\n\n<p>Wedbush Securities analyst Dan Ives said that investors were not happy with the higher spending, and pointed to the U.K. charge/accrual as highlighting the hot-button issue of possible further regulation over the classification of its drivers.</p>\n\n<p>“Higher level of investments near term, coupled with some uncertainty around the forecast,” were affecting the shares in after-hours trading, Ives said in an email. “It was a robust print, but after the Biden move against gig players, the Street is very nervous around Uber and Lyft, with selling post-quarter a theme commonplace during tech earnings season.”</p>\n\n<p>Even so, investors now have an idea of how much drivers being classified as employees could cost the company. As the debate over gig workers continues, investors will likely remain jittery about the issue. The nagging question above all is, will companies like Uber and Lyft Inc. LYFT, -6.34% ever be profitable, with their contractor business models again at risk, and prone to big, unexpected costs?</p>\n</div><!-- SC_ON -->",
  "score": 1987,
  "permalink": "/r/investing/comments/n5z0z4/uber_investors_finally_see_the_costs_of_treating/",
  "subreddit": "investing",
  "id": "n5z0z4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380966992
}