{
  "author": "AskScienceModerator",
  "original_created_utc": 1629198035,
  "title": "AskScience AMA Series: Hey Reddit! We are NASA scientists that study Earth systems, how they're changing, and how they impact our favorite foods. Ask us anything about agriculture, drought, and food security!",
  "created_utc": 1629203793,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When you think of NASA, you might think of rockets and space exploration, but did you know we play a big role in the food you eat? From space, Earth satellites have a unique view of fishing, ranching and farming our favorite foods, fruits, veggies, and grains! NASA data helps farmers and local communities address issues like water management, crop-type identification, land use, and sustainable farming processes.</p>\n\n<p>As the climate continues to warm, drought preparedness and food security continue to be challenges that NASA data helps overcome. We&#39;re here from 4pm - 5pm ET (16-17 UT) to answer your questions about agriculture, drought, food security, and NASA data. Ask us anything!</p>\n\n<ul>\n<li><strong>Amber McCullum</strong>: Research Scientist and Project Manager in Applied Sciences, BAERI/NASA Ames Research Center</li>\n<li><strong>Erika Podest</strong>: Scientist, Carbon Cycle and Ecosystems Group, NASA Jet Propulsion Laboratory</li>\n<li><strong>Kerry Cawse-Nicholson</strong>: ECOSTRESS Science Lead, NASA Jet Propulsion Laboratory</li>\n<li><strong>Matthew Rodell</strong>: Acting Deputy Director of Earth Science for Hydrosphere, Biosphere, and Geophysics, NASA Goddard Space Flight Center</li>\n</ul>\n\n<p>Username: <a href=\"/u/nasa\">/u/nasa</a></p>\n</div><!-- SC_ON -->",
  "score": 142,
  "permalink": "/r/askscience/comments/p61i3y/askscience_ama_series_hey_reddit_we_are_nasa/",
  "subreddit": "askscience",
  "id": "p61i3y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "When you think of NASA, you might think of rockets and space exploration, but\ndid you know we play a big role in the food you eat? From space, Earth\nsatellites have a unique view of fishing, ranching and farming our favorite\nfoods, fruits, veggies, and grains! NASA data helps farmers and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "NASAといえば、ロケットや宇宙開発を思い浮かべるかもしれませんが\n皆さんが食べている食品にもNASAが大きく関わっていることをご存知ですか？地球の衛星は、宇宙から\n地球の衛星からは、私たちの大好きな果物や野菜、穀物などの漁業や牧場、農業の様子を見ることができます。\n私たちが大好きな果物、野菜、穀物などの漁業、牧場、農業の様子を宇宙から見ることができます。NASAのデータは、農家や...",
      "title": "AskScience AMAシリーズ。Redditの皆さん、こんにちは。私たちはNASAの科学者で、地球のシステムやその変化、そして私たちの好きな食べ物への影響を研究しています。農業、干ばつ、食料安全保障について何でも聞いてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当你想到NASA时，你可能会想到火箭和太空探索，但是\n你知道我们在你吃的食物中扮演着重要角色吗？从太空中，地球\n卫星有一个独特的视角，可以看到我们最喜欢的食物、水果、蔬菜和谷物的捕鱼、放牧和耕种情况。\n水果、蔬菜和谷物等食物的独特视角! NASA的数据帮助农民和...",
      "title": "AskScience AMA系列。嗨，Reddit! 我们是美国国家航空航天局的科学家，研究地球系统，它们如何变化，以及它们如何影响我们最喜欢的食物。请向我们提出有关农业、干旱和粮食安全的任何问题。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當你想到NASA時，你可能會想到火箭和太空探索，但是\n你知道我們在你喫的食物中扮演着重要角色嗎？從太空中，地球\n衛星有一個獨特的視角，可以看到我們最喜歡的食物、水果、蔬菜和穀物的捕魚、放牧和耕種情況。\n水果、蔬菜和穀物等食物的獨特視角! NASA的數據幫助農民和...",
      "title": "AskScience AMA系列。嗨，Reddit! 我們是美國國家航空航天局的科學家，研究地球系統，它們如何變化，以及它們如何影響我們最喜歡的食物。請向我們提出有關農業、乾旱和糧食安全的任何問題。"
    }
  ]
}