{
  "author": "chirographlimpedg2",
  "original_created_utc": 1627884248,
  "title": "With Compound Interest, small investments can eventually lead to huge gains.",
  "created_utc": 1627889440,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Since crypto markets are always open, they do not have predetermined periods like bonds or savings accounts. Some services offer APY to your Crypto like Celsius, Haru Invest, and BlockFi, to name a few.</p>\n\n<h5>My problem before when I was trading was attempting to be consistent with my daily profits while not returning them to the market. Because I have no daily target when making daily trades, I give lots or all of my profit back in the low volume.</h5>\n\n<p>If you have no daily target or goal of reaching, you could give lots or all of your profit back in low volume. And with the volatility with cryptocurrency, this stands true. </p>\n\n<p>We also have to note that there will be days that you get gains and get losses. Let&#39;s say you invest $500 today. It could be worth $2000 or $10 tomorrow. It&#39;s impossible to say when or if this upward trend will come to an end. </p>\n\n<p>But let&#39;s say that you do aim for long-term investment. You can use this <a href=\"https://www.investor.gov/financial-tools-calculators/calculators/compound-interest-calculator\">Compound Interest Calculator</a> and try it out for yourself.</p>\n\n<p>You can start out a little with, let&#39;s say, an initial of $100 and a contribution of $100 as well and have an 8% interest/year. In 10 years, you&#39;d get $17.6k. Now imagine if you&#39;d place more there? Figures like this aren&#39;t impossible… but of course, you&#39;d expect there will be rainy days too.</p>\n\n<p>It&#39;ll, of course, be hard to hit an exact % consistently each day, so this is a good way to not limit yourself from more gains but also capping your downside risk to the daily target.</p>\n\n<p>Long-term investment leads to big gains, but as always, you should DYOR and recommend doing this every day. This is not one of those get-rich-quick schemes. There are really no shortcuts, and hard work is also just as important.</p>\n</div><!-- SC_ON -->",
  "score": 174,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/LN83TkqHEHu1fkXP0yrfxkFHM6wIX6a1MIXArVFClMQ.jpg?auto=webp&s=1ccdcc505ac3a154094b3937f1ab267102a94fa3",
          "width": 108,
          "height": 108
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/LN83TkqHEHu1fkXP0yrfxkFHM6wIX6a1MIXArVFClMQ.jpg?width=108&crop=smart&auto=webp&s=a88b6acce9b4d90228a3d3f833561d91d2d9a0a7",
            "width": 108,
            "height": 108
          }
        ],
        "variants": {},
        "id": "huz-EDryJUW5HV5R9qdLrr7n-jpgNwo7faXLS5toWgY"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/ow8og1/with_compound_interest_small_investments_can/",
  "subreddit": "CryptoCurrency",
  "id": "ow8og1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Since crypto markets are always open, they do not have predetermined periods\nlike bonds or savings accounts. Some services offer APY to your Crypto like\nCelsius, Haru Invest, and BlockFi, to name a few.\n\nMY PROBLEM BEFORE WHEN I WAS TRADING WAS ATTEMPTING TO BE CONSISTENT WITH MY\nDAILY PROFITS WHILE…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号市場は常にオープンであるため、債券や預貯金のような所定の期間はありません。\n債券や預貯金のような所定の期間はありません。いくつかのサービスは、あなたのCryptoにAPYを提供しています。\nCelsius、Haru Invest、BlockFiなどがあります。\n\n以前トレードをしていたときの問題は、毎日の利益を一定にしようとすることでした。\n毎日の利益を安定させながら...",
      "title": "複利では、小さな投資がやがて大きな利益につながります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "由于加密货币市场总是开放的，它们没有预先确定的时期\n像债券或储蓄账户。一些服务为你的加密货币提供APY，如\nCelsius、Haru Invest和BlockFi，仅举几例。\n\n我以前做交易时的问题是试图保持与我的\n我以前的问题是试图与我的每日利润保持一致，而...",
      "title": "有了复利，小的投资最终可以带来巨大的收益。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "由於加密貨幣市場總是開放的，它們沒有預先確定的時期\n像債券或儲蓄賬戶。一些服務爲你的加密貨幣提供APY，如\nCelsius、Haru Invest和BlockFi，僅舉幾例。\n\n我以前做交易時的問題是試圖保持與我的\n我以前的問題是試圖與我的每日利潤保持一致，而...",
      "title": "有了複利，小的投資最終可以帶來巨大的收益。"
    }
  ]
}