{
  "author": "Jeremymia",
  "the_new_excerpt": "Just to be clear, when I say lab leak I mean a virus that was being studied that\nescaped.\n\nI don't think many scientists thought that a lab leak was absolutely impossible,\nbut anyone who brought up that covid had anything but natural origins was seen\nas a bit of a conspiracy theorist.\n\nNow, the…",
  "original_created_utc": 1623847767,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "念のために申し上げますが、研究室からの漏洩というのは、研究中のウイルスが逃げ出したということです。\n漏れたという意味です。\n\n研究室からの漏洩が絶対にあり得ないと考えていた科学者は少なかったと思います。\nしかし、コビットが自然由来ではないという話を持ち出す人は、ちょっとした陰謀論者と見なされた。\nちょっとした陰謀論者と見られていました。\n\nさて、その...",
      "title": "なぜ、コヴィッドラボのリーク説が左派界隈で可能性として受け入れられているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为了明确起见，当我说实验室泄漏时，我指的是正在研究的病毒被\n逃脱了。\n\n我不认为许多科学家认为实验室泄漏是绝对不可能的。\n但是，任何提出Covid除了自然来源外还有其他原因的人都被视为\n被视为有点阴谋论者的意思。\n\n现在，...",
      "title": "为什么现在在左倾的圈子里接受科维德实验室泄密理论是一种可能性？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲了明確起見，當我說實驗室泄漏時，我指的是正在研究的病毒被\n逃脫了。\n\n我不認爲許多科學家認爲實驗室泄漏是絕對不可能的。\n但是，任何提出Covid除了自然來源外還有其他原因的人都被視爲\n被視爲有點陰謀論者的意思。\n\n現在，...",
      "title": "爲什麼現在在左傾的圈子裏接受科維德實驗室泄密理論是一種可能性？"
    }
  ],
  "title": "Why is the covid lab leak theory now accepted as a possibility in left-leaning circles?",
  "created_utc": 1623901106,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just to be clear, when I say lab leak I mean a virus that was being studied that escaped.</p>\n\n<p>I don&#39;t think many scientists thought that a lab leak was absolutely <em>impossible,</em> but anyone who brought up that covid had anything but natural origins was seen as a bit of a conspiracy theorist. </p>\n\n<p>Now, the language has moved more towards &quot;Yeah sure, investigate it.&quot;</p>\n\n<p>What&#39;s with the sudden change?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/Ask_Politics/comments/o143by/why_is_the_covid_lab_leak_theory_now_accepted_as/",
  "subreddit": "Ask_Politics",
  "id": "o143by",
  "is_self": true,
  "media": null,
  "is_video": false
}