{
  "author": "VMP85",
  "the_new_excerpt": "Curious what sets IRA contribution limits, and what triggers an increase to the\nyearly limit? Do you feel that they're too low? Shouldn't the government be\npushing people to invest for their retirement more?\n\nWhat if you're say an electrician who works for a small outfit and they don't\noffer a 401k,…",
  "original_created_utc": 1623069858,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "IRAの拠出限度額はどのように設定されているのか、また、年間の拠出限度額が増えるきっかけは何なのか。\n年間の上限を増やすきっかけは何ですか？限度額が低すぎると感じますか？政府は人々にもっと老後のための投資を促すべきではないでしょうか？\n政府は、人々にもっと老後のための投資を促すべきではないでしょうか？\n\nもしあなたが小さな会社で働いている電気技師で、401kを提供していないとしたらどうしますか？\nもしあなたが小さな会社で働く電気技師で、401kを提供していないとしたら...。",
      "title": "IRAの拠出限度額は何によって決まるのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很好奇是什么规定了IRA的缴款限额，以及什么会触发年度限额的增加？\n年限额？你觉得他们太低了吗？政府难道不应该\n推动人们为他们的退休生活进行更多的投资？\n\n如果你是一个在小公司工作的电工，而他们不提供401k，那怎么办？\n他们不提供401k,...",
      "title": "什么决定了IRA的供款限额？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很好奇是什麼規定了IRA的繳款限額，以及什麼會觸發年度限額的增加？\n年限額？你覺得他們太低了嗎？政府難道不應該\n推動人們爲他們的退休生活進行更多的投資？\n\n如果你是一個在小公司工作的電工，而他們不提供401k，那怎麼辦？\n他們不提供401k,...",
      "title": "什麼決定了IRA的供款限額？"
    }
  ],
  "title": "What determines IRA contribution limits?",
  "created_utc": 1623080373,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Curious what sets IRA contribution limits, and what triggers an increase to the yearly limit? Do you feel that they&#39;re too low? Shouldn&#39;t the government be pushing people to invest for their retirement more?</p>\n\n<p>What if you&#39;re say an electrician who works for a small outfit and they don&#39;t offer a 401k, or similar account. How can you save for retirement on your own beyond an IRA?</p>\n</div><!-- SC_ON -->",
  "score": 66,
  "permalink": "/r/Bogleheads/comments/nubmhg/what_determines_ira_contribution_limits/",
  "subreddit": "Bogleheads",
  "id": "nubmhg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404885446
}