{
  "author": "Oh_umms_cocktails",
  "original_created_utc": 1660620131,
  "title": "What was the origin of the name \"Mormon?\" Not the religion but specifically how Joseph Smith came up with that word as the name for his prophet.",
  "created_utc": 1660645886,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I understand that Joseph Smith attributed his revelation to a prophet of Jesus named &amp;quot;Mormon&amp;quot; a 4th century indigenous Native American whose name was, apparently according to Smith himself, a contraction of the modern English word &amp;quot;More,&amp;quot; and the Egyptian word &amp;quot;Mon,&amp;quot; (supposedly meaning good).&lt;/p&gt;\n\n&lt;p&gt;Did &amp;quot;More&amp;quot; as an English word exist in the mid-4th century? Does &amp;quot;Mon&amp;quot; mean good in Egyptian?&lt;/p&gt;\n\n&lt;p&gt;Was Joseph Smith familiar with Egyptian? Is there any account of how he came up with that or why he chose it, beyond his above referenced account?&lt;/p&gt;\n\n&lt;p&gt;Did people raise any objections to the, what seems to be obviously ridiculous, claim that 4 century Native Americans named their kids by combining modern English and Ancient Egyptian?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/wpjeyf/what_was_the_origin_of_the_name_mormon_not_the/",
  "subreddit": "AskHistorians",
  "id": "wpjeyf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I understand that Joseph Smith attributed his revelation to a prophet of Jesus\nnamed \"Mormon\" a 4th century indigenous Native American whose name was,\napparently according to Smith himself, a contraction of the modern English word\n\"More,\" and the Egyptian word \"Mon,\" (supposedly meaning good).\n\nDid…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ジョセフ・スミスはイエスの預言者に啓示を受けたと理解しています。\nモルモン」という4世紀のネイティブ・アメリカンの名前に由来しています。\nその名前は、スミス本人によると、現代英語の「More」とエジプト語の「Mon」を縮めたものであるらしいです。\n\"モア \"とエジプト語の \"モン\"(良いという意味)を縮めたものだそうです。\n\nそうなのか...",
      "title": "\"モルモン \"という名前の由来は何でしょうか？宗教のことではなく、具体的にはジョセフ・スミスが預言者の名前としてその言葉を思いついた経緯についてです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道约瑟夫-斯密将他的启示归于耶稣的一位先知。\n名为 \"摩门\"，是一个4世纪的土著美国人，他的名字是。\n显然，根据斯密本人的说法，他的名字是现代英语单词的缩略语\n\"More \"和埃及语的 \"Mon\"（据说是好的意思）的缩写。\n\n难道...",
      "title": "\"摩门 \"这个名字的起源是什么？不是宗教，而是具体地说，约瑟夫-斯密是如何想出这个词作为其先知的名字的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道約瑟夫-斯密將他的啓示歸於耶穌的一位先知。\n名爲 \"摩門\"，是一個4世紀的土著美國人，他的名字是。\n顯然，根據斯密本人的說法，他的名字是現代英語單詞的縮略語\n\"More \"和埃及語的 \"Mon\"（據說是好的意思）的縮寫。\n\n難道...",
      "title": "\"摩門 \"這個名字的起源是什麼？不是宗教，而是具體地說，約瑟夫-斯密是如何想出這個詞作爲其先知的名字的。"
    }
  ]
}