{
  "author": "Mean_Yogurtcloset536",
  "original_created_utc": 1632490195,
  "title": "Today’s dip in crypto shows how stupid majority of investors are that are involved in bitcoin",
  "created_utc": 1632526635,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is old news folks.. China bans crypto.. China doesn’t allow crypto.. China doesn’t like crypto. THIS IS NOT NEW INFORMATION yet people are responding as if this is brand new crucial news. </p>\n\n<p>Stop freaking out every time China says they don’t like crypto.. buy this damn dip bc I can almost guarantee this is going to be one of the last times to buy around these prices.</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/Bitcoin/comments/pujsla/todays_dip_in_crypto_shows_how_stupid_majority_of/",
  "subreddit": "Bitcoin",
  "id": "pujsla",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is old news folks.. China bans crypto.. China doesn’t allow crypto.. China\ndoesn’t like crypto. THIS IS NOT NEW INFORMATION yet people are responding as if\nthis is brand new crucial news.\n\nStop freaking out every time China says they don’t like crypto.. buy this damn\ndip bc I can almost…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは古いニュースですが、皆さん。中国が暗号を禁止... 中国は暗号を認めていない... 中国は\ndoesn't like crypto. これは新しい情報ではありませんが、人々はこれが真新しい重要なニュースであるかのように反応しています。\n新しい重要なニュースであるかのように反応しています。\n\n中国が暗号を好まないと言うたびにパニックになるのはやめよう...この糞ディップを買おう。\nこのディップを買えば、ほとんど...",
      "title": "今日のクリプトの下落は、ビットコインに関わる投資家の大半がいかに愚かであるかを示している"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这已经是老生常谈了... 中国禁止加密货币... 中国不允许加密货币... 中国\n不喜欢加密货币。这不是新的信息，但人们的反应却好像是\n这是全新的关键新闻。\n\n别再为每次中国说他们不喜欢加密货币而惊慌失措了，买这个该死的\n因为我几乎可以...",
      "title": "今天加密货币的下跌表明大多数参与比特币的投资者是多么的愚蠢"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這已經是老生常談了... 中國禁止加密貨幣... 中國不允許加密貨幣... 中國\n不喜歡加密貨幣。這不是新的信息，但人們的反應卻好像是\n這是全新的關鍵新聞。\n\n別再爲每次中國說他們不喜歡加密貨幣而驚慌失措了，買這個該死的\n因爲我幾乎可以...",
      "title": "今天加密貨幣的下跌表明大多數參與比特幣的投資者是多麼的愚蠢"
    }
  ]
}