{
  "author": "Jeremykla",
  "original_created_utc": 1628761766,
  "title": "Most used abbreviations in the cryptospace and top 25 coins explained (as of august 2021)",
  "created_utc": 1628793040,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>This is an updated version from <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/m0jug3/most_used_abbreviations_in_the_cryptospace_newby/\">my post</a> of march. Which includes new abbreviations from the comment section and new words that popped up since then.</h1>\n\n<p>As we welcome newcomers everyday to this sub it&#39;s nice to have a all you need to know abbreviations guide to get them started. When i first started reading up things (because <strong>DYOR</strong>) i came across terms i&#39;ve never heard of. So here are some of the most common abbreviations you will come across while doing research about cryptos. In this list you can also find the top 25 crypto as of <strong>12 august 2021</strong> wich are explained in mostly 2 - 4 sentences. I&#39;ve taken some insparation from this <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/lg1yhv/for_the_newcomers_the_top_50_cryptocurrencies/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\">post</a> by <a href=\"/u/Layneeeee\">u/Layneeeee</a> as a guideline for some of the top 25 tokens. But also included some links to the white papers of them.</p>\n\n<p>I hope this list can help new people coming in and maybe help some people that are just lost in all the jargon people use.  I&#39;ve put sections in the list to also help make the list easier to read. Maybe i missed some, so if anyone want anything added, comment and i will update it.</p>\n\n<p><strong>Top 25 cryptocurrencies (by</strong> <a href=\"https://coinmarketcap.com/nl/\">marketcap</a><strong>) explained in 2-4 senctences:</strong></p>\n\n<ol>\n<li><a href=\"https://whitepaper.io/coin/bitcoin\">Bitcoin</a> <strong>(BTC):</strong> The original cryptocurrency. According to the creator (or creators?) Satoshi Nakamoto was created to allow “online payments to be sent directly from one party to another without going through a financial institution.”</li>\n<li><a href=\"https://ethereum.org/en/whitepaper/\">Ethereum</a> <strong>(ETH):</strong> Ethereum is the wonder child of crypto, acts as an infrastructure for most decentralized applications. Introduces smart contracts, which are like programs with specific procedures that, once deployed, no one can change.</li>\n<li><a href=\"https://whitepaper.io/coin/binance\">Binance Coin</a> <strong>(BNB):</strong> Coin associated with the Binance exchange, valuable since it is the most popular centralized exchange. Can be used to pay transaction fees on Binance.</li>\n<li><a href=\"https://whitepaper.io/coin/tether\">Tether</a> <strong>(USDT):</strong> A centralized stablecoin tied to the dollar</li>\n<li><a href=\"https://whitepaper.io/coin/cardano\">Cardano</a> <strong>(ADA):</strong> Another blockchain trying to improve scalability, interoperability, and sustainability of cryptocurrencies. Those who hold the cryptocurrency have the right to vote on any proposed changes in the software.</li>\n<li><a href=\"https://whitepaper.io/coin/ripple\">Ripple</a> <strong>(XRP):</strong> Centralized coin,  is the native cryptocurrency for products developed by <a href=\"https://ripple.com/\">Ripple Labs</a>. Its products are used for payment settlement, asset exchange, and remittance systems</li>\n<li><a href=\"https://whitepaper.io/coin/dogecoin\">Dogecoin</a> <strong>(DOGE):</strong> Wow, such high ranking! More a meme coin, just for fun. Supply is to infinity and beyond, cause they are minting <a href=\"https://www.cnbc.com/2021/05/07/differences-between-bitcoin-and-dogecoin-experts.html\">14.000.000 tokens</a> a day</li>\n<li><a href=\"https://whitepaper.io/coin/usd-coin\">USD Coin</a> <strong>(USDC):</strong> Another centralized stablecoin tied to the dollar, like USDT.</li>\n<li><a href=\"https://whitepaper.io/coin/polkadot\">Polkadot</a> <strong>(DOT):</strong> Open-source protocol aimed at connecting all different blockchains and allowing them to work together, allowing transfers of any data.</li>\n<li><a href=\"https://whitepaper.io/coin/uniswap\">Uniswap</a> <strong>(UNI):</strong> A DeFi ,but this time it’s an exchange like Binance and the best part is that it&#39;s decentralized.</li>\n<li><a href=\"https://www.allcryptowhitepapers.com/binance-usd-whitepaper/\">Binance USD</a> <strong>(BUSD):</strong> Is a new USD-denominated stablecoin approved by the New York State Department of Financial Services (NYDFS) that will be launched in partnership with Paxos and Binance.</li>\n<li><a href=\"https://whitepaper.io/coin/solana\">Solana</a> <strong>(SOL):</strong>  Is a web-scale blockchain that provides fast, secure, scalable, decentralized apps and marketplaces. The system currently supports 50,000 TPS (Transactions per second) and 400ms Block Times.</li>\n<li><a href=\"https://bitcoincash.org/\">Bitcoin Cash</a> <strong>(BCH):</strong> A fork of Bitcoin (a copy with differences that includes smaller fees and increases scalabillity).</li>\n<li><a href=\"https://whitepaper.io/coin/chainlink\">Chainlink</a> <strong>(LINK):</strong> The main idea is to LINK smart contracts with real-world data, verifying that this data is correct.</li>\n<li><a href=\"https://whitepaper.io/coin/litecoin\">Litecoin</a> <strong>(LTC):</strong> Bitcoin’s cousin, with faster transactions and lower fees.</li>\n<li><a href=\"https://whitepaper.io/coin/wrapped-bitcoin\">Wrapped Bitcoin</a> <strong>(WBTC):</strong> It’s just bitcoin wrapped in ethereum to be used in DeFi applications.</li>\n<li><a href=\"https://dfinity.org/\">Internet Computer</a> <strong>(ICP):</strong> It&#39;s a cryptocurrency/digital token that allows users to create apps, websites and other web-based services.</li>\n<li><a href=\"https://whitepaper.io/coin/polygon\">Polygon</a> <strong>(MATIC):</strong>  A sidechain connecting to a blockchain and helps it perform better. Transactions process much more quickly and have lower fees. Polygon has been developed for use with the Ethereum blockchain, but that doesn&#39;t mean it&#39;s limited to Ethereum.</li>\n<li><a href=\"https://cryptoverze.com/ethereum-classic-whitepaper/\">Ethereum Classic</a> <strong>(ETC):</strong>  Ethereum Classic, like Ethereum, supports smart contracts and decentralized applications (dapps). It originated from a contentious hard fork of the ethereum blockchain that took place in 2016. <strong><em>It&#39;s old nodes that don&#39;t wanna update their software.</em></strong></li>\n<li><a href=\"https://whitepaper.io/coin/stellar\">Stellar</a> <strong>(XLM):</strong> Talking about currencies, XLM is one of the coins aiming to do just that, with fast processing times and low fees.</li>\n<li><a href=\"https://whitepaper.io/coin/vechain\">VeChain</a> <strong>(VET):</strong> A blockchain focusing on business use-cases more than on technology, bringing this technology to the masses without them even knowing they’re using it.</li>\n<li><a href=\"https://whitepaper.io/coin/theta-token\">THETA</a> <strong>(THETA):</strong> Decentralized video delivery network (peer-to-peer streaming). The token performs various governance tasks within the network.</li>\n<li><a href=\"https://whitepaper.io/coin/terra\">Terra</a> <strong>(LUNA):</strong> Aiming to support a global payment network, it tries to create a decentralized stablecoin with an elastic money supply, enabled by stable mining incentives. Its related stablecoin is TerraUSD</li>\n<li><a href=\"https://whitepaper.io/coin/filecoin\">Filecoin</a> <strong>(FIL):</strong>  Filecoin is a peer-to-peer network that stores files, with built-in economic incentives to ensure files are stored reliably over time.</li>\n<li><a href=\"https://whitepaper.io/coin/tron\">TRON</a> <strong>(TRX):</strong> Have you seen Silicon Valley when they try to create a decentralized internet? Yeah, Tron’s founder is Richard Hendricks. It is also one of the most popular blockchain to build decentralized applications on.</li>\n</ol>\n\n<p><em>Bonus: coins that fell out of the top 25 as of</em> <strong><em>8 march 2021:</em></strong></p>\n\n<ul>\n<li>Was at place 16 now 62: <a href=\"https://whitepaper.io/coin/nem\">NEM</a> <strong>(XEM):</strong> instead of controlling just money, you can manage stock ownership, contracts, medical records, and stuff like that</li>\n<li>Was at place 17 now 27: <a href=\"https://whitepaper.io/coin/aave\">Aave</a> <strong>(AAVE):</strong> take a bank and make it decentralized, where the liquidity comes from the users, and they earn fees from borrows. This is Aave.</li>\n<li>Was at place 19 now 39: <a href=\"https://whitepaper.io/coin/cosmos\">Cosmos</a> <strong>(ATOM):</strong> several independent blockchains trying to create an “internet of blockchains.”</li>\n<li>Was at place 21 now 35: <a href=\"https://whitepaper.io/coin/crypto-com-chain\">Crypto.com Coin</a> <strong>(CRO):</strong> the token of Crypto.com public blockchain that tries to enable transactions worldwide between people and businesses</li>\n<li>Was at place 22 now 28: <a href=\"https://www.allcryptowhitepapers.com/monero-whitepaper/\">Monero</a> <strong>(XMR):</strong> privacy token that doesn&#39;t share the sending/recieving end of the transfer.</li>\n<li>Was at place 25 now 30: <a href=\"https://whitepaper.io/coin/eos-1\">EOS</a> <strong>(EOS):</strong> another blockchain aimed at being highly scalable for commercial use. It aims to make it as straightforward as possible for programmers to embrace blockchain technology.</li>\n</ul>\n\n<p>Als with anything in crypto it&#39;s <strong>DYOR.</strong> When a coin is in the top 25 it doesn&#39;t mean it will stay there forever. Anything can happen. Also all the whitepapers are linked to the coin. So it&#39;s easy to to do your own research that way.</p>\n\n<p><strong>Abbreviations for Regulatory Commissions:</strong></p>\n\n<ul>\n<li>CFTC – Commodity Futures Trading Commission</li>\n<li>DOJ – Department of Justice</li>\n<li>FDIC – Federal Deposit Insurance Corporation</li>\n<li>FTC – Federal Trade Commission</li>\n<li>SEC – Securities and Exchange Commission</li>\n</ul>\n\n<p>Like standard currency, cryptocurrency is regulated by various bodies and commissions. These organizations create regulations to avoid fraud and illegal schemes (for the most part).</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Conversational Cryptocurrency abbreviations/words:</strong></p>\n\n<ul>\n<li>AMA - Ask Me Anything</li>\n<li>BEAR MARKET - When everything is down for a long time and the sentiment changed from rainbows and unicorns to a full out depresion</li>\n<li>BTD or BTFD – Buy The Dip or Buy the F\\*\\*\\*\\*\\*\\* Dip</li>\n<li>BUIDL – “Build” <em>(purposeful misspelling for ironic meaning)</em></li>\n<li>CT - Crypto Twitter</li>\n<li>DIAMOND HANDS - People that aren&#39;t selling even at a huge lost or a bear market, those are the people with diamond hands.</li>\n<li>DYOR – Do Your Own Research</li>\n<li>ELI5 - Explain It Like I’m 5</li>\n<li>FOMO – Fear of Missing Out <em>(Bitcoin is rising and instead of buying when it&#39;s low, people are investing because maybe it goes even higher!)</em></li>\n<li>FUD – Fear, Uncertainty, Doubt</li>\n<li>FUDster - A person who spreads Fear, Uncertainty, and Doubt</li>\n<li>HODL – Hold On for Dear Life <em>(purposeful misspelling of “HOLD&quot;)</em></li>\n<li>JOMO - Joy of Missing Out</li>\n<li>KYC - Know Your Customer</li>\n<li>Lambo - Lamborghini <em>(cryptocurrency term for getting rich)</em></li>\n<li>OCO - One Cancels the Other</li>\n<li>REKT - “Wrecked” <em>(meaning major losses)</em></li>\n<li>TLT - Think Long Term</li>\n<li>TOR - The Onion Router <em>(one who sends anonymous data)</em></li>\n</ul>\n\n<p>Because every online community has their own slang and jargon, we are no different.  Read up on cryptocurrency slang that you might need when conversing with others.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Financial abbreviations:</strong></p>\n\n<ul>\n<li>ALT or Altcoin – Alternative Cryptocurrency <em>(cryptocurrency other than Bitcoin)</em></li>\n<li>AML - Anti-Money Laundering</li>\n<li>ATH - All-Time High</li>\n<li>ATL - All-Time Low</li>\n<li>CEX – Centralized Exchange</li>\n<li>CeFi - Centralized Finance <em>(all crypto trade orders are handled through a central exchange. Funds are managed by specific running the central exchange. It means you don&#39;t own a private key that provides you access to your wallet and  you are subject to the rules set by the centralized exchange)</em></li>\n<li>CMC - Coinmarketcap <em>(one of the big</em> <a href=\"https://coinmarketcap.com/\">websites</a> <em>to check on the total market cap of coins)</em></li>\n<li>DAICO - Decentralized Autonomous Initial Coin Offering</li>\n<li>DCA - Dollar Cost Averaging <em>(is a strategy where an investor invests a total sum of money in small increments over time instead of all at once. The goal is to take advantage of market downturns without risking too much capital at any given time)</em></li>\n<li>DeFi - Decentralized Finance <em>(is a blockchain-based form of finance that does not rely on central financial intermediaries such as brokerages, exchanges, or banks to offer traditional financial instruments, and instead utilizes smart contracts on blockchains)</em></li>\n<li>DEX – Decentralized Exchange <em>(are a type of cryptocurrency exchange which allows for direct consumer to consumer cryptocurrency transactions to take place online securely and without the need for an intermediary)</em></li>\n<li>DLT - Distributed Ledger Technology</li>\n<li>ERC-20 - Token standard for Ethereum</li>\n<li>ERC-721 - Token standard for NFT <em>(non-fungible tokens)</em></li>\n<li>ETF - Exchange-Traded Fund</li>\n<li>ETP –s Exchange-Traded Product</li>\n<li>FIAT – Conventional government-issued currency <em>(e.g. US Dollar, Euro)</em></li>\n<li>IBO - Initial Bounty Offering</li>\n<li>ICO – Initial Coin Offering <em>(like a pre sale for cryptocurrency)</em></li>\n<li>IEO - Initial Exchange Offering  <em>(it&#39;s a new form of ICO. This time exchanges are vetting the blockchain projects, white paper and crowdfunding drive. All of this is listed on the exchange)</em></li>\n<li>ITO – Initial Token Offering</li>\n<li>mBTC - Millibitcoin <em>(0.001 BTC)</em></li>\n<li>MCAP – Market Capitalization</li>\n<li>OTC – Over the Counter</li>\n<li>PnD – Pump-and-Dump scheme</li>\n<li>SATS – Satoshis <em>(the smallest denomination of a Bitcoin: 0.00000001 BTC)</em></li>\n<li>STAKING -  Staking cryptocurrencies is a process that involves buying and setting aside a certain amount of tokens to become an active validating node for the network. By simply holding these coins, the buyer becomes an important piece in the network&#39;s security infrastructure and is compensated accordingly.</li>\n<li>STO – Securities Token Offering</li>\n<li>TPS – Transactions Per Second</li>\n<li>Tx – Transaction</li>\n<li>TxID – Transaction Identification</li>\n<li>uBTC - MicroBitcoin (0.000001 BTC)</li>\n<li>UTXO - Unspent Transaction Outputs  <em>(when a transaction is completed, any unspent outputs are deposited back into a database as inputs which can be used at a later date for a new transaction)</em></li>\n<li>UXTO - Unspent Transaction</li>\n</ul>\n\n<p>The ultimate objective os using cryptocurrency is to make money (we mostly say that we&#39;re in it for the technology). Most of the above abbreviations are combined slang from economic markets.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Technical abbreviations:</strong></p>\n\n<ul>\n<li>2FA – Two Factor Authentication</li>\n<li>Addy - Address</li>\n<li>API - Application Programming Interface</li>\n<li>ASIC – Application Specific Integrated Circuit</li>\n<li>Bech32 - Bitcoin address format <em>(also known as bc1 addresses)</em></li>\n<li>BFA - Brute Force Attack</li>\n<li>BFT – Byzantine Fault Tolerance</li>\n<li>CPU – Central Processing Unit  <em>(the CPU in a computer</em> <em>takes instructions from a program or application and performs a calculation, setting binaire units into readable information for humans)</em></li>\n<li>DAG – Directed Acyclic Graph</li>\n<li>DAPP or dApp – Decentralized Application</li>\n<li>DDoS – Distributed Denial of Service <em>(is an malicious attempt to disrupt the normal traffic of a targeted server, service or network by overwhelming the target or its surrounding infrastructure with a flood of Internet traffic)</em></li>\n<li>DEVCON - Developers Conference</li>\n<li>GPU – Graphical Processing Unit <em>(is a specialized electronic circuit designed to rapidly manipulate and alter memory to accelerate the creation of images in a frame buffer intended for output to a display device)</em></li>\n<li>IPFS – Interplanetary Files System</li>\n<li>Multi-sig - Multi-Signature</li>\n<li>NFT - non-fungible token <em>(is a unit of data stored on a digital ledger, called a blockchain, that certifies a digital asset to be unique and therefore not interchangeable. NFTs can be used to represent items such as photos, videos, audio, and other types of digital files)</em></li>\n<li>NONCE – Number Used Only Once</li>\n<li>PKI – Public Key Infrastructure</li>\n<li>SHA-256 - Secure Hash Acronym (256-bit)</li>\n<li>WWDC - Worldwide Developers Conference</li>\n</ul>\n\n<p>Cybersecurity is a major element of using your cryptocurrency the best you can. Above are the most used abbreviations that developers and users can use.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Blockchain and network Abbreviations:</strong></p>\n\n<ul>\n<li>B2B - Business to Business</li>\n<li>B2C - Business to Consumer</li>\n<li>BIP - Bitcoin Improvement Proposal</li>\n<li>BTM - Automatic Teller Machine for Bitcoin</li>\n<li>DAO – Decentralized Autonomous Organization</li>\n<li>DPoS – Delegated Proof of Stake</li>\n<li>EEA - Enterprise Ethereum Alliance</li>\n<li>EIP - Ethereum Improvement Proposal</li>\n<li>ERC – Ethereum Request for Comments</li>\n<li>EVM – Ethereum Virtual Machine</li>\n<li>FA - Fundamental Analysis</li>\n<li>Fork - Different parties need to use common rules to maintain the history of the blockchain. When parties are not in agremeent they can make alternative chains with adjustments.</li>\n<li>Fork (hard) -  A hard fork is when nodes of the newest version of a blockchain no longer accept the older version(s) of the blockchain; which creates a permanent divergence from the previous version of the blockchain.</li>\n<li>LN – Lightning Network</li>\n<li>MACD - Moving Average Convergence Divergence</li>\n<li>MoE – Medium of Exchange</li>\n<li>P2P – Peer to Peer</li>\n<li>PoA – Proof of Authority</li>\n<li>PoB - Proof of Burn</li>\n<li>PoD - Proof of Developer</li>\n<li>PoS – Proof of Stake</li>\n<li>PoW – Proof of Work</li>\n<li>SC – Smart Contract</li>\n<li>SegWit – Segregated Witness</li>\n<li>SoV – Store of value</li>\n<li>TA - Technical Analysis or Trend Analysis</li>\n<li>UoA – Unit of Account</li>\n<li>UTC  - Coordinated Universal Time</li>\n<li>WP – Whitepaper <em>(the pre porposal of a coin, you can read what the builder of a cryptocurrency want with their idea)</em></li>\n<li>YTD - Year to Date</li>\n</ul>\n\n<p>Above are the most commonly used terms when referring to blockchains or trading networks.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/ehupqy7WdAvlmVL4vtLRjBLLd5SddqQM1SsfO0AwPao.jpg?auto=webp&s=17a15a2a0861f93f597a1c798394f0087b70d3f0",
          "width": 600,
          "height": 315
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/ehupqy7WdAvlmVL4vtLRjBLLd5SddqQM1SsfO0AwPao.jpg?width=108&crop=smart&auto=webp&s=cbe6f8e7ae5f056ce6d9543e3c2fc5a4e0b9d542",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/ehupqy7WdAvlmVL4vtLRjBLLd5SddqQM1SsfO0AwPao.jpg?width=216&crop=smart&auto=webp&s=5159c2981f72d4b7a1d513b789715d09af9c745c",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/ehupqy7WdAvlmVL4vtLRjBLLd5SddqQM1SsfO0AwPao.jpg?width=320&crop=smart&auto=webp&s=ea98bd5918d7c16f51bd8e018f5fa5beb66eb3f1",
            "width": 320,
            "height": 168
          }
        ],
        "variants": {},
        "id": "2CglEyeRDgHuG1rCoeOwM7On4SgUk4WbdvFYrwIEeok"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/p2wlqs/most_used_abbreviations_in_the_cryptospace_and/",
  "subreddit": "CryptoCurrency",
  "id": "p2wlqs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "THIS IS AN UPDATED VERSION FROM MY POST\n[https://www.reddit.com/r/CryptoCurrency/comments/m0jug3/most_used_abbreviations_in_the_cryptospace_newby/]\nOF MARCH. WHICH INCLUDES NEW ABBREVIATIONS FROM THE COMMENT SECTION AND NEW\nWORDS THAT POPPED UP SINCE THEN.\n\nAs we welcome newcomers everyday to this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは私の投稿から更新されたバージョンです\n[https://www.reddit.com/r/CryptoCurrency/comments/m0jug3/most_used_abbreviations_in_the_cryptospace_newby/]\n3月の投稿からの更新版です。コメント欄に寄せられた新しい略語や、その後に出てきた新しい言葉などを\nその後に出てきた新しい言葉を含んでいます。\n\nこの記事では、コメント欄に寄せられた新しい略語や、その後に出てきた新しい言葉を紹介しています。",
      "title": "暗号空間で最も使われている略語とトップ25コインの解説（2021年8月現在"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是我的帖子中的一个更新版本\n[https://www.reddit.com/r/CryptoCurrency/comments/m0jug3/most_used_abbreviations_in_the_cryptospace_newby/]\n3月的帖子。其中包括评论区的新缩写和此后出现的新\n词，从那时起就出现了。\n\n由于我们每天都欢迎新来者来到这个...",
      "title": "密码空间中最常用的缩写和前25个硬币的解释（截至2021年8月）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是我的帖子中的一個更新版本\n[https://www.reddit.com/r/CryptoCurrency/comments/m0jug3/most_used_abbreviations_in_the_cryptospace_newby/]\n3月的帖子。其中包括評論區的新縮寫和此後出現的新\n詞，從那時起就出現了。\n\n由於我們每天都歡迎新來者來到這個...",
      "title": "密碼空間中最常用的縮寫和前25個硬幣的解釋（截至2021年8月）。"
    }
  ]
}