{
  "author": "zoyanx",
  "original_created_utc": 1635359832,
  "title": "Nano brought me here but guess everyone hates it?",
  "created_utc": 1635382822,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So you can say I have been living under a rock while I found crypto fascinating I was never really invested in it neither mentally nor monetarily.</p>\n\n<p>Well yesterday nano giveaway reeled me into crypto world and I really loved the eco friendly, fast, and zero fees thing about the nano coin but I have read many negative comments about it on here.</p>\n\n<p>I though of many implementations of it. How it can make transactions global, easy and instant. no payment gateway, no conversion, no bank account integration that’s really awesome but I planned it all with nano in mind and now I am hearing not so good things about it.</p>\n\n<p>So, what’s the deal with it? If it’s not that good what are the alternatives with similar features? Simple to setup, fast, zero or low fees and widely known.</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/CryptoCurrency/comments/qh3dig/nano_brought_me_here_but_guess_everyone_hates_it/",
  "subreddit": "CryptoCurrency",
  "id": "qh3dig",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So you can say I have been living under a rock while I found crypto fascinating\nI was never really invested in it neither mentally nor monetarily.\n\nWell yesterday nano giveaway reeled me into crypto world and I really loved the\neco friendly, fast, and zero fees thing about the nano coin but I have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が暗号の魅力に気づいたとき、私は岩の下で暮らしていたと言えるでしょう。\n精神的にも金銭的にも本気で投資したことはありませんでした。\n\nしかし、昨日のnano giveawayで暗号の世界に引きずり込まれました。そして、私はこのnano giveawayがとても気に入りました。\nナノコインの環境に優しく、迅速で、手数料のかからない点がとても気に入りました。しかし、私は...",
      "title": "Nanoが私をここに連れてきてくれましたが、みんな嫌っているのかな？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以你可以说我一直生活在岩石下，而我发现加密货币的魅力。\n我从未在精神上或金钱上真正投资于它。\n\n昨天，纳诺赠品将我拉入加密货币世界，我真的很喜欢这个\n我真的很喜欢纳米币的生态友好、快速和零费用的特点，但我有...",
      "title": "Nano把我带到了这里，但估计大家都讨厌它？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以你可以說我一直生活在岩石下，而我發現加密貨幣的魅力。\n我從未在精神上或金錢上真正投資於它。\n\n昨天，納諾贈品將我拉入加密貨幣世界，我真的很喜歡這個\n我真的很喜歡納米幣的生態友好、快速和零費用的特點，但我有...",
      "title": "Nano把我帶到了這裏，但估計大家都討厭它？"
    }
  ]
}