{
  "author": "homrqt",
  "original_created_utc": 1631884370,
  "title": "Shitcoins making it to Coinbase before legitimate projects...",
  "created_utc": 1631892974,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Shiba Inu is on Coinbase. WHY?!!? There are so many other projects - ERGO, NANO, LUNA, FLOW, etc etc etc that are solid projects with huge potential and Coinbase is thinking.... NAH, give me the one with 1 QUADRILLION coins because it has a puppy dog on it. All these actual world changing coins sitting in limbo waiting for the masses to turn eyes to it, and Coinbase is playing games, helping people throw their money away. Does Coinbase even share their selection process and why they choose the coins that they do? Because the fact that Doge and Shiba Inu exist on Coinbase before dozens of other real projects is truly disheartening.</p>\n</div><!-- SC_ON -->",
  "score": 443,
  "permalink": "/r/CryptoCurrency/comments/ppzwhx/shitcoins_making_it_to_coinbase_before_legitimate/",
  "subreddit": "CryptoCurrency",
  "id": "ppzwhx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Shiba Inu is on Coinbase. WHY?!!? There are so many other projects - ERGO, NANO,\nLUNA, FLOW, etc etc etc that are solid projects with huge potential and Coinbase\nis thinking.... NAH, give me the one with 1 QUADRILLION coins because it has a\npuppy dog on it. All these actual world changing coins…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "柴犬がCoinbaseに登場。WHY!!!! 他にもたくさんのプロジェクトがあります - ERGO, NANO,\nERGO、NANO、LUNA、FLOWなどなど、大きな可能性を秘めた確かなプロジェクトがたくさんあるのに、Coinbaseは\nは考えています.... NAH、1QUADRILLIONコインのものをくれよ、それには子犬が描かれているんだから。\n子犬が描かれているからです。実際に世界を変えるようなコインばかりで...",
      "title": "合法的なプロジェクトよりも先に、クソコインがCoinbaseに入ってくる...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Shiba Inu在Coinbase上。为什么呢？还有很多其他项目--ERGO、NANO。\nLUNA，FLOW，等等等等，都是具有巨大潜力的可靠项目，而Coinbase\n正在思考.... 不，给我一个有1 QUADRILLION币的项目，因为它有一个\n小狗在上面。所有这些实际改变世界的硬币...",
      "title": "屎币在合法项目之前进入Coinbase..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Shiba Inu在Coinbase上。爲什麼呢？還有很多其他項目--ERGO、NANO。\nLUNA，FLOW，等等等等，都是具有巨大潛力的可靠項目，而Coinbase\n正在思考.... 不，給我一個有1 QUADRILLION幣的項目，因爲它有一個\n小狗在上面。所有這些實際改變世界的硬幣...",
      "title": "屎幣在合法項目之前進入Coinbase..."
    }
  ]
}