{
  "author": "doctor0909",
  "original_created_utc": 1655886373,
  "title": "I played with leverage today!",
  "created_utc": 1655933809,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have been in crypto space since many years but never touched &amp;quot;leverage&amp;quot;. \nFew hours back just out of curiosity I tried leverage on Binance.&lt;/p&gt;\n\n&lt;p&gt;I started with 78 USDT and used leverage of 3x with BTC, voila I made a profit of few dollars and felt like a king. I increased the leverage to 5x and the winning streak continued. &lt;/p&gt;\n\n&lt;p&gt;Next, I leveraged with Ethereum and leveraged 10x and it was wonderful. I was feeling on the top of the world, nothing could stop me. &lt;/p&gt;\n\n&lt;p&gt;After first timers luck the degen ape in me woke up and I leveraged 25x on ShibaInu and the house of cards came falling in front of me. All of my profit from earlier trades was wiped out and my capital of 78 USDT decimated to 50 USDT. &lt;/p&gt;\n\n&lt;p&gt;I was hysterical and went all in on Shiba again with leverage of 50x and recovered my loss and made a mind boggling profit of 5 USDT.&lt;/p&gt;\n\n&lt;p&gt;My take from my experiment with leverage : &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Don&amp;#39;t leverage, Don&amp;#39;t play with futures, it is very demanding.&lt;/li&gt;\n&lt;li&gt;You will be constantly checking prices/profit or loss.&lt;/li&gt;\n&lt;li&gt;It is addictive and this gambling can ruin you financially. &lt;/li&gt;\n&lt;li&gt;My mental peace was gone and I was barely able to sleep for 2 hours and even in my sleep I was dreaming about charts.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;conclusion - Don&amp;#39;t leverage / play with future else it will destroy your future. If you want to do it properly follow stop-loss.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 307,
  "permalink": "/r/CryptoCurrency/comments/vi07un/i_played_with_leverage_today/",
  "subreddit": "CryptoCurrency",
  "id": "vi07un",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have been in crypto space since many years but never touched \"leverage\". Few\nhours back just out of curiosity I tried leverage on Binance.\n\nI started with 78 USDT and used leverage of 3x with BTC, voila I made a profit\nof few dollars and felt like a king. I increased the leverage to 5x and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は長年暗号の世界にいますが、\"レバレッジ \"には触ったことがありません。数時間前\n数時間前に興味本位でBinanceでレバレッジを試してみました。\n\n78USDTでスタートし、BTCで3倍のレバレッジを使いました。\n数ドルの利益を得て、王様になったような気分でした。私はレバレッジを5倍に上げ、そして...",
      "title": "今日はレバレッジで遊んでみました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从多年前就进入了加密货币领域，但从未接触过 \"杠杆\"。几个\n几个小时前，我只是出于好奇，在Binance上尝试了杠杆。\n\n我从78美元开始，使用BTC的3倍杠杆。\n几美元，感觉像个国王。我把杠杆率提高到5倍，然后就开始了。",
      "title": "我今天玩的是杠杆游戏!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從多年前就進入了加密貨幣領域，但從未接觸過 \"槓桿\"。幾個\n幾個小時前，我只是出於好奇，在Binance上嘗試了槓桿。\n\n我從78美元開始，使用BTC的3倍槓桿。\n幾美元，感覺像個國王。我把槓桿率提高到5倍，然後就開始了。",
      "title": "我今天玩的是槓桿遊戲!"
    }
  ]
}