{
  "author": "robinhood1596",
  "original_created_utc": 1627741313,
  "title": "Dear Cryptoenthusiast. Stop acting like a cult. It's a bad look.",
  "created_utc": 1627753463,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I love Crypto, I believe in the tech (except for shitcoins, fuck those asses) and i hold some myself.</p>\n\n<p>However, this sub is sometimes acting like a cult.</p>\n\n<p>Someones critizies Crypto? Shitstorm and insults. Whole posts about one person on the front page. E.g. Warren after the call to regulate Crypto. Or the whole BTC is bad for environment stuff. There is some legitimate criticism in there. And yet this sub ignores that part and starts screaming. It&#39;s like every shitcoin sub, but with Crypto in General.</p>\n\n<p>Same with the EU regulations. Or the whole XMR is used for Crimes. Funnily enough some people in here want to keep Crypto anonymous while saying that Crypto can help with transparency in politics by tracking transactions. Like ... what?</p>\n\n<p><strong>Crypto is not perfect. Let people critizise it to make it better. Don&#39;t bully them out.</strong> You are giving Crypto a bad look and driving people away from it. You are making it so easy for anyone saying Crypto is bad. &quot;Why else would they react like that to valid criticism?&quot;. Just bring forth arguments. Call your representatives in a calm respectful manner and tell them what you think and give them arguments. <strong>Nobody ever made the world better by insulting and bullying people. Be better.</strong></p>\n\n<p>PS: It&#39;s not helping to delete this thread. It just kinda proves my point.</p>\n</div><!-- SC_ON -->",
  "score": 222,
  "permalink": "/r/CryptoCurrency/comments/ov80e5/dear_cryptoenthusiast_stop_acting_like_a_cult_its/",
  "subreddit": "CryptoCurrency",
  "id": "ov80e5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I love Crypto, I believe in the tech (except for shitcoins, fuck those asses)\nand i hold some myself.\n\nHowever, this sub is sometimes acting like a cult.\n\nSomeones critizies Crypto? Shitstorm and insults. Whole posts about one person\non the front page. E.g. Warren after the call to regulate Crypto.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は暗号が大好きで、その技術を信じています（ただし、クソコインは別です。\n自分でもいくつか保有しています。\n\nしかし、このサブサイトは時々カルトのようになっています。\n\n誰かがCryptoを批判しているのでしょうか？罵詈雑言が飛び交います。一人の人間についての全体の投稿\nフロントページに掲載されています。例：Cryptoを規制しようと呼びかけたWarren....",
      "title": "Dear Cryptoenthusiast.com カルトのような行動はやめてください。見た目が悪いですよ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我喜欢加密货币，我相信这种技术（除了狗屎币，去他妈的那些屁股）。\n而且我自己也持有一些。\n\n然而，这个子有时表现得像一个邪教。\n\n有人对加密货币提出批评？狗屎风暴和侮辱。关于一个人的整个帖子\n在头版上。例如，沃伦在呼吁监管加密货币后....。",
      "title": "亲爱的加密爱好者。不要再表现得像个邪教了。这看起来很糟糕。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我喜歡加密貨幣，我相信這種技術（除了狗屎幣，去他媽的那些屁股）。\n而且我自己也持有一些。\n\n然而，這個子有時表現得像一個邪教。\n\n有人對加密貨幣提出批評？狗屎風暴和侮辱。關於一個人的整個帖子\n在頭版上。例如，沃倫在呼籲監管加密貨幣後....。",
      "title": "親愛的加密愛好者。不要再表現得像個邪教了。這看起來很糟糕。"
    }
  ]
}