{
  "author": "StlSMeier",
  "the_new_excerpt": "I had a couple of stocks earlier this year that I sold way too early. In two\ncases tens of thousands . I was following several other stocks that I did not\nbuy and they did extraordinarily well. The ones I hold too long I lost my butt.\nIt seems like every decision I make is exactly the wrong one.…",
  "original_created_utc": 1612737155,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "今年年初我有几只股票，卖得太早了。在两个\n案例数万人。我在关注其他几只股票，我没有。\n买，他们做得特别好。我持有的时间太长的，我就把屁股给丢了。\n似乎我的每一个决定都是完全错误的....。",
      "title": "你们如何决策何时退出交易。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今年年初我有幾隻股票，賣得太早了。在兩個\n案例數萬人。我在關注其他幾隻股票，我沒有。\n買，他們做得特別好。我持有的時間太長的，我就把屁股給丟了。\n似乎我的每一個決定都是完全錯誤的....。",
      "title": "你們如何決策何時退出交易。"
    }
  ],
  "title": "How do you guys make decisions on when to exit a trade.",
  "created_utc": 1612757965,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I had a couple of stocks earlier this year that I sold way too early.  In two cases tens of thousands . I was following several other stocks that I did not buy and they did extraordinarily well. The ones I hold too long I lost my butt. It seems like every decision I make is exactly the wrong one. Here are some examples. </p>\n\n<p>I bought CHK at $3.25 in 2015 and held it all the way to delisting. I held 1500 shares. </p>\n\n<p>I bought CHGG around the same time around $4.50 and sold at $7 held 1K shares. </p>\n\n<p>This year I had 6K shares of RIOT at $2.68 and sold at $3.90. </p>\n\n<p>I had 1k of PLTR at $27.50 and sold for at $25 after the Citron scare and a week later it’s in the mid 30’s</p>\n\n<p>I’ve made money but I just keep doing exactly the wrong thing.</p>\n</div><!-- SC_ON -->",
  "score": 99,
  "permalink": "/r/investing/comments/lexe9r/how_do_you_guys_make_decisions_on_when_to_exit_a/",
  "subreddit": "investing",
  "id": "lexe9r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123199866
}