{
  "author": "Shoor_veer",
  "the_new_excerpt": "Viruses and diseases often are, and have been named after the place of their\ndiscoveries. I remember in the beginning of the pandemic it was unacceptable to\ncall it China virus or Wuhan virus because of supposed racist connotation. But\nnow new variants identified across the globe are being named…",
  "original_created_utc": 1620903135,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ウイルスや病気には、発見された場所にちなんだ名前がつけられていることがよくあります。\n発見された場所にちなんで命名されることがよくあります。パンデミックの初期には、人種差別を理由に、「チャイナ・ウイルス」や「ウーハン・ウイルス」と呼ぶことは受け入れられなかったことを覚えています。\nパンデミックの初期には、人種差別的な意味合いがあるとして、「チャイナ・ウイルス」や「ウーハン・ウイルス」と呼ぶことは許されませんでした。しかし\nしかし、今では世界中で発見された新しい亜種には名前が付けられています...",
      "title": "なぜ、「武漢ウイルス」や「中国ウイルス」と呼ぶのは差別的で、「ブラジル変種」「インド変種」「イギリス変種」などと呼ぶのはいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "病毒和疾病往往是这样，并以其发现地命名。\n发现的地方命名。我记得在大流行病开始时，人们不能接受将其称为中国病毒或武汉病毒，因为据说有种族主义含义。\n我记得在大流行病开始时，人们无法接受将其称为中国病毒或武汉病毒，因为它有所谓的种族主义含义。但是\n现在全球各地发现的新变种被命名为...",
      "title": "为什么称其为 \"武汉病毒 \"或 \"中国病毒 \"是种族歧视，而称其为巴西变种、印度变种、英国变种等就可以？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "病毒和疾病往往是這樣，並以其發現地命名。\n發現的地方命名。我記得在大流行病開始時，人們不能接受將其稱爲中國病毒或武漢病毒，因爲據說有種族主義含義。\n我記得在大流行病開始時，人們無法接受將其稱爲中國病毒或武漢病毒，因爲它有所謂的種族主義含義。但是\n現在全球各地發現的新變種被命名爲...",
      "title": "爲什麼稱其爲 \"武漢病毒 \"或 \"中國病毒 \"是種族歧視，而稱其爲巴西變種、印度變種、英國變種等就可以？"
    }
  ],
  "title": "Why is it racist to call it \"Wuhan Virus\" or \"China virus\" but okay to call it Brazil variant, Indian variant, UK variant, etc?",
  "created_utc": 1620931561,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Viruses and diseases often are, and have been named after the place of their discoveries. I remember in the beginning of the pandemic it was unacceptable to call it China virus or Wuhan virus because of supposed racist connotation. But now new variants identified across the globe are being named after their respective country of origin. What&#39;s the logic at play here?</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/nbdud3/why_is_it_racist_to_call_it_wuhan_virus_or_china/",
  "subreddit": "TooAfraidToAsk",
  "id": "nbdud3",
  "is_self": true,
  "media": null,
  "is_video": false
}