{
  "author": "Pete26l96",
  "the_new_excerpt": "I started trading in January for the first time, but have a background in\naccounting / finance so I was already aware of a lot of theory / mechanisms.\n\nWith that said, more so than anything, I can't wrap my head around how every\ntime I read discussion about stocks or discuss it online that \"shorts\"…",
  "original_created_utc": 1618366265,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は1月に初めて取引を始めましたが、会計／財務のバックグラウンドがあるので\n私は1月に初めてトレーディングを始めましたが、会計や金融のバックグラウンドがあるので、すでに多くの理論やメカニズムを知っていました。\n\nそうは言っても、何よりも、私は毎回、どのようにして\n私は何よりも、株式に関する議論を読んだり、ネット上で議論したりするたびに、「ショート」が...",
      "title": "株式の議論で「ショート」がこれほど大きく取り上げられたり使われたりするのは、昔からなのか、それとも最近の出来事がきっかけなのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从1月份开始第一次做交易，但有背景的我，在\n会计/金融，所以我已经知道了很多理论/机制。\n\n说到这里，更多的是，我无法绕过我的脑袋，如何每一个\n每次我读到关于股票的讨论或讨论它在网上，\"短裤\"... ...",
      "title": "在讨论股票时，\"空头 \"总是被如此大的讨论/使用，还是最近的事件导致了这种情况？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從1月份開始第一次做交易，但有背景的我，在\n會計/金融，所以我已經知道了很多理論/機制。\n\n說到這裏，更多的是，我無法繞過我的腦袋，如何每一個\n每次我讀到關於股票的討論或討論它在網上，\"短褲\"... ...",
      "title": "在討論股票時，\"空頭 \"總是被如此大的討論/使用，還是最近的事件導致了這種情況？"
    }
  ],
  "title": "Have \"shorts\" always been so greatly discussed / used when discussing stocks, or has recent events led to this?",
  "created_utc": 1618423455,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I started trading in January for the first time, but have a background in accounting / finance so I was already aware of a lot of theory / mechanisms. </p>\n\n<p>With that said, more so than anything, I can&#39;t wrap my head around how every time I read discussion about stocks or discuss it online that &quot;shorts&quot; are discussed. </p>\n\n<p>Time and time again I see multiple people blaming shorts for a falling stock price, or people accusing someone of being a short seller for saying anything not positive about a stock. </p>\n\n<p>The crazy thing is that I see this frequently happen even with stocks where less than 0.5% of the shares are shorted. </p>\n\n<p>Has this always been the case or is it only due to recent events?</p>\n\n<p>I couldn&#39;t stop laughing earlier today when one of my holdings, which has approximately 2000 shares shorted out of 32 million, had 20 individuals worried and talking about &quot;squeezing the shorts&quot;. </p>\n\n<p>If the average retail investor actually thinks like this I can understand why so many bankrupt themselves.</p>\n</div><!-- SC_ON -->",
  "score": 42,
  "permalink": "/r/stocks/comments/mqh24l/have_shorts_always_been_so_greatly_discussed_used/",
  "subreddit": "stocks",
  "id": "mqh24l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566618932
}