{
  "author": "misty__moo",
  "original_created_utc": 1645402226,
  "title": "How do I properly archive and store Harry S Truman's diaries left behind by my pop pop?",
  "created_utc": 1645438119,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi y&amp;#39;all! My pop pop, Milton F Perry, left behind a boat load of unfinished work after his unexpected death 30 years ago. He was the curator for the Truman library in independence as well as the Jesse James home.&lt;/p&gt;\n\n&lt;p&gt;We have box after box of his diaries, pictures of the war room during the dropping of the atomic bombs in ww2, sketches and paint samples of the art work done by Thomas hart benton, unpublished books, coins, stamps, newspapers, Truman&amp;#39;s diaries as well as my pop pops.&lt;/p&gt;\n\n&lt;p&gt;We want to properly archive and store them, transcribe the documents to digital forms, etc. We don&amp;#39;t know where to start or who to talk to. So I figured I&amp;#39;d come to the place of answers and community, reddit.&lt;/p&gt;\n\n&lt;p&gt;Can anyone help us?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/sxfg27/how_do_i_properly_archive_and_store_harry_s/",
  "subreddit": "AskHistorians",
  "id": "sxfg27",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi y'all! My pop pop, Milton F Perry, left behind a boat load of unfinished work\nafter his unexpected death 30 years ago. He was the curator for the Truman\nlibrary in independence as well as the Jesse James home.\n\nWe have box after box of his diaries, pictures of the war room during the\ndropping of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。私の父、ミルトンFペリーは、未完成の作品を大量に残していきました。\n30年前の突然の死後 彼はトルーマンの学芸員でした。\nジェシー・ジェイムズの家と同じように、独立した図書館です。\n\n彼の日記の箱が何箱もあるんだ。\nを落とす...",
      "title": "ポップポップが残したハリー・S・トルーマンの日記を適切にアーカイブし、保存するにはどうしたらよいでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你们好! 我的父亲米尔顿-佩里在30年前意外去世后，留下了一船未完成的作品。\n在他30年前意外去世后。他是杜鲁门图书馆的馆长\n图书馆的馆长，也是杰西-詹姆斯故居的馆长。\n\n我们有一箱又一箱的他的日记，以及在投弹时战争室的照片。\n的照片。",
      "title": "我如何正确地归档和储存哈里-S-杜鲁门的日记，这些日记是我的老爹留下的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你們好! 我的父親米爾頓-佩裏在30年前意外去世後，留下了一船未完成的作品。\n在他30年前意外去世後。他是杜魯門圖書館的館長\n圖書館的館長，也是傑西-詹姆斯故居的館長。\n\n我們有一箱又一箱的他的日記，以及在投彈時戰爭室的照片。\n的照片。",
      "title": "我如何正確地歸檔和儲存哈里-S-杜魯門的日記，這些日記是我的老爹留下的？"
    }
  ]
}