{
  "author": "Tronski4",
  "original_created_utc": 1655715458,
  "title": "Random reminder: Don't be naive!",
  "created_utc": 1655757841,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t be fooled by a tiny rally.&lt;/p&gt;\n\n&lt;p&gt;The crypto market is crashing because of interest rate hikes (because debt becomes more expensive and people suddenly wants less of it). Inflation is not dealt with yet and we&amp;#39;ll see more rate hikes. &lt;/p&gt;\n\n&lt;p&gt;Worst case scenario is a global housing crash and financial meltdown. Crypto has never seen that before, but we can be pretty sure it won&amp;#39;t thrive in those conditions either.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t buy crypto now unless you&amp;#39;ve got money to spare and you are prepared to hold for several years. &lt;/p&gt;\n\n&lt;p&gt;Save some money for your debt, or to buy into housing if that market crashes too.&lt;/p&gt;\n\n&lt;p&gt;Edit: There seem to be some confusion about what my &amp;quot;advice&amp;quot; really is. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying that crypto will definitely keep declining, although it&amp;#39;s likely, but rather that there is an alternative cost to your investments as the interest rates increases. It never hurts to have a liquid buffer when there&amp;#39;s hard times ahead, and your indirect profits from paying off a 4% mortgage could potentially be higher than profits from crypto investments made now.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 315,
  "permalink": "/r/CryptoCurrency/comments/vgh0mp/random_reminder_dont_be_naive/",
  "subreddit": "CryptoCurrency",
  "id": "vgh0mp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Don't be fooled by a tiny rally.\n\nThe crypto market is crashing because of interest rate hikes (because debt\nbecomes more expensive and people suddenly wants less of it). Inflation is not\ndealt with yet and we'll see more rate hikes.\n\nWorst case scenario is a global housing crash and financial…"
}