{
  "author": "TNGSystems",
  "the_new_excerpt": "Well all know Safemoon is a clear and defined pyramid scheme. Its growth relies\non a new set of investors suckers to jump in and provide liquidity so the\nprevious set can get out with profit.\n\nI've been seeing a lot of brigading from the Safemoon sub in here, basically\ntrying to legitimatize…",
  "original_created_utc": 1619176931,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Safemoonは明確に定義されたマルチ商法であることは周知の通りです。その成長は\nその成長は、新しい投資家のカモが飛び込んできて、前のセットが利益を得て脱出できるように流動性を提供することにかかっています。\nその成長は、新しい投資家のカモが飛び込んできて、流動性を提供し、前のセットが利益を得て脱出できるようにすることにかかっています。\n\nここでは、Safemoonのサブメンバーからのたくさんの支持を目にしました。\n正当化しようとする...",
      "title": "一攫千金を狙ってスキャムコインの宝くじに挑戦するのは構いませんが、自分の賞金を正当化して次の列のカモを納得させようとするのはやめましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家都知道Safemoon是一个清晰明确的金字塔计划。它的增长依赖于\n它的增长依赖于一组新的投资者吸食者跳入并提供流动资金，这样前一组投资者就可以获利退出。\n前一组人可以带着利润离开。\n\n我在这里看到了很多来自萨菲蒙子的吹捧，基本上是\n试图使其合法化...",
      "title": "如果你想通过玩诈骗币彩票来快速致富，那么你就做你的，但不要试图使你的赢利合法化，以说服下一排吸血者跳进去。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家都知道Safemoon是一個清晰明確的金字塔計劃。它的增長依賴於\n它的增長依賴於一組新的投資者吸食者跳入並提供流動資金，這樣前一組投資者就可以獲利退出。\n前一組人可以帶着利潤離開。\n\n我在這裏看到了很多來自薩菲蒙子的吹捧，基本上是\n試圖使其合法化...",
      "title": "如果你想通過玩詐騙幣彩票來快速致富，那麼你就做你的，但不要試圖使你的贏利合法化，以說服下一排吸血者跳進去。"
    }
  ],
  "title": "If you want to play the scamcoin lottery to get rich quick, then you do you, but don't try and legitimatize your winnings to convince the next row of suckers to jump in.",
  "created_utc": 1619192016,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Well all know Safemoon is a clear and defined pyramid scheme. Its growth relies on a new set of <del>investors</del> suckers to jump in and provide liquidity so the previous set can get out with profit.  </p>\n\n<p>I&#39;ve been seeing a lot of brigading from the Safemoon sub in here, basically trying to legitimatize Safemoon using some really backwards logic, but the point is, I could give a shit if you put in $1,000 and come out a millionaire, Bitconnect had plenty of winners too, but what burned <strong>so, so</strong> many people and turned them off Crypto is the false pretense of legitimacy, and when the rug is eventually pulled, all these people get completely rekt.  </p>\n\n<p>So I take umbrage to all the people who have made a couple thousand dollars who then start preaching how legit the project is, especially spreading unfounded rumors like exchange listings etc.</p>\n\n<p>If you made money, great. You gambled on an unknown, unproven project and sold your earnings to the next set of hopefuls, but you know deep down there&#39;s absolutely nothing in Safemoon and to pretend like it could be the next big thing or &quot;reach 1 penny eventually&quot; is completely disingenuous and should be discouraged at every opportunity.</p>\n</div><!-- SC_ON -->",
  "score": 841,
  "permalink": "/r/CryptoCurrency/comments/mwt1rq/if_you_want_to_play_the_scamcoin_lottery_to_get/",
  "subreddit": "CryptoCurrency",
  "id": "mwt1rq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776208790
}