{
  "approved_at_utc": null,
  "subreddit": "investing",
  "selftext": "Hey guys,\n\nI thought I would share some of my thoughts regarding the tension between value investing and software businesses. Would love some of your comments and feedback on this to see if you agree / disagree with particular parts.\n\n\\---\n\nValue investing is a form of allocating capital based on the principle of identifying good businesses that are trading below their “fair” or “intrinsic” value. Often, they are companies that are trading at a discount relative to their assets, the strength of their earnings or the steadiness of their cash flows. Value investing has proven to be a successful investment strategy, having made numerous millionaires and billionaires, including Warren Buffet.\n\nHowever, the principles of value investing have been questioned over the past decade. Value stocks have performed terribly since the 2008 financial crisis, while growth stocks have performed exceptionally well during this period. Specifically, a large portion of overall market performance through the past decade has been captured by FAANG (Facebook, Amazon, Apple, Netflix, Google) and other software-driven technology companies, which value investors have typically avoided due to high valuations. The post lockdown recovery has further highlighted the attractive returns provided by software-driven companies as several technology stocks are at all-time highs. That seems to be changing a bit with inflation, however the 10 year return metrics cannot be ignored. \n\nValue investing has gone through existential crises numerous times before and survived. I suspect it will overcome the current skepticism it is facing, as the core principles of value investing are still useful. However, as a prudent investor, I must continue to navigate changing market dynamics, question the principles of value investing and determine what, if anything, has changed.\n\n**Devoured By Software**\n\nSoftware has become a key part of our lives today. Yet understanding the full implications and potential of software-driven companies is difficult due to the varied levels of success these companies can have. Products can be category defining (Google Search) or useless (Apple Maps). For all their unpredictability, software-driven companies as a category still demand high valuations. As such, value investors have stayed away from the space and missed out on their returns over the past decade.\n\nMarc Andreessen began exploring the implications of software-driven business in his 2011 essay [Why Software Is Eating The World](https://a16z.com/2011/08/20/why-software-is-eating-the-world/). His essay serves as a great starting point for considering the following key questions of (1) whether the economic and business model changes of software justify the high valuations demanded by these firms and (2) whether the value investing framework is still effective in allocating capital in the markets today.\n\n# An Expensive Opportunity.\n\nThere are three key characteristics of software-driven companies that could justify their expensive valuations: 1) Incremental marginal profits; 2) Scale and reach; and 3) Increasing return to scale.\n\n**1) Incremental Marginal Profits:**\n\nSoftware-driven businesses are characterized by high initial fixed costs. The R&amp;D costs required to get a product to market is massive. However, the incremental cost for each product sold is marginal. Profits can grow quickly once break-even is achieved, leading to a massive boost in profitability.\n\nThis is in contrast to traditional “physical” businesses where the ability to increase profits is limited by the variable costs and step costs of selling the product. While it might be impossible to predict which software products will take-off and what the magnitude of profitability growth will be, failure to understand the mechanics of software-driven business models makes software companies seem expensive.\n\n**2) Scale &amp; Reach:**\n\nA key distinction between software-driven businesses and physical businesses is the former’s ability to scale. Roughly 3.5 billion people in the world currently have access to smartphones and the internet ([source](https://www.statista.com/statistics/330695/number-of-smartphone-users-worldwide/)). A new product can reach millions, if not billions, of people faster than ever before and this trend is only accelerating with time. It took Instagram roughly 8 years to get to a billion active daily users; it will take TikTok roughly 3 ([source](https://www.businessofapps.com/data/instagram-statistics/) &amp; [source](https://wallaroomedia.com/blog/social-media/tiktok-statistics/)).\n\nAn important driver of the rapid growth of technology firms is the low cost of scaling software. Software-driven businesses are not hindered by the common limitations that constrain physical businesses (i.e. supply chain logistics, key real estate in major markets, physical resources and inputs, etc.), which increase costs and delay growth. Software-driven businesses can take advantage of Infrastructure-as-a-Service (i.e. Amazon Web Services) and other key services to reduce the cost of scaling. Gerald F. Davis, professor at the University of Michigan, has estimated that the cost of launching a start-up has decreased by a magnitude of 100x in the past decade ([source](https://bthechange.com/the-declining-cost-of-startup-companies-c5a9a72bf1e6)).\n\n**3) Increase Return To Scale:**\n\nA core heuristic of value investors has been the [law of diminishing returns](https://www.investopedia.com/terms/l/lawofdiminishingmarginalreturn.asp) and [regression to the mean](https://theconversation.com/regression-to-the-mean-or-why-perfection-rarely-lasts-74694). Benjamin Graham, the godfather of value investing, summarized the notion best with the phrase: *“Many shall be restored that are now fallen and many shall fall that now are held in honor.”*\n\nHowever, software has potentially increased the ability of firms to better fight these principles through network effects and increased returns to scale. W. Brian Arthur is credited for the modern description of the concept:\n\n*Increasing returns are the tendency for that which is ahead to get further ahead, for that which loses advantage to lose further advantage. They are mechanisms of positive feedback that operate—within markets, businesses, and industries—to reinforce that which gains success or aggravate that which suffers loss…*\n\n*More than causing products to become standards, increasing returns cause businesses to work differently, and they stand many of our notions of how business operates on their head.*\n\nSoftware-driven businesses are often characterized by network effects and increasing returns to scale. As these businesses grow, their advantages become stronger, their probability of launching successful new products higher, and ability to scale them globally better.\n\nLet’s use Google Search as an example. The more people use search, the better the product becomes. The better the product, the larger their competitive advantage, and the harder it is for a new entrant to compete. The better the product, the most people will continue to use Google Search instead of an alternative (do you know anyone who uses [DuckDuckGo](https://duckduckgo.com/)?) and the positive feedback loop will continue.\n\nContrast this to one of my favorite business that operates in the physical space, Lululemon. Every time I wear the Surge shorts, the product doesn’t become better. While there is an argument that the customer data Luluemon gains can improve their products, that iterative process is not as rapid, scalable and impactful as it is for software-driven firms.\n\n# A New Paradigm?\n\nThe combined impact of these characteristics creates a fly-wheel effect where select software-driven businesses experience lottery like pay-offs. Traditional valuation approaches are not well-suited to understanding these low-probability-high-reward scenarios.\n\nHowever, that doesn’t mean value investing is no longer useful. The principle idea behind value investing is to pay a price that is less than the “fair” or “intrinsic” value of an asset. The better you are at finding this gap between price and value, the larger your margin of safety and ability to make money. But some of the traditional heuristics and mental models associated with value investing need to be reconsidered.\n\nTraditional valuation approaches considered risk to be a bug, not a feature. However, the three characteristics of software-driven companies described above incentivize software-driven firms to chase risky projects that have lottery-like payoffs. A [HBR article](https://hbr.org/2018/06/why-we-need-to-update-financial-reporting-for-the-digital-era) written by Professor Govindarajan, described how “*an idea with uncertain prospects but with at least some conceivable chance of reaching a billion dollars in revenue is considered far more valuable than a project with net present value of few hundred million dollars but no chance of massive upside*” to software-driven companies.\n\nThis is truer the larger the company is. If Apple considered a high probability of success project with a profit boost of $500m (which is significant by most standards), it would only lead to a 1% increase in their 2019 full-year net income of \\~$55bn. They would likely pass in favor of something riskier but with more upside.\n\nAn alternative valuation framework is offered by CFOs of software-driven companies. These CFOs themselves admit that their market capitalizations cannot be justified based on traditional metrics. They speculate that perhaps their valuation might be the sum of the potential pay-offs of all the projects undertaken by their companies, now and in the future. This framework is closer to the venture capital world than traditional value investing. However, over-reliance on this approach would likely cause investors to be irrationally optimistic and over-value every single software-driven company.\n\nHow then do we reconcile the core principle of value investing and this new lens through which to view software-driven companies? I suspect the answer lies somewhere in the middle.\n\nInvestors would be foolish to violate the core principle of value investing. However, investors would be equally foolish in failing to recognize that the software business model has changed the incremental economics for select businesses. Perhaps the most prudent use of this framework is to understand that it applies infrequently, but when it does apply, it justifies the valuations. That takes judgement. And judgement is what separates investors from speculators.\n\nThanks for reading and would love your thoughts!\n\nRegards,\n\nArash Param\n\n*Inspiration And Additional Reading:*\n\n* [https://www.ft.com/content/00c722d6-760f-4871-a927-2c564fe17276](https://www.ft.com/content/00c722d6-760f-4871-a927-2c564fe17276)\n* [https://geoff-yamane.com/blog/2018/09/17/the-investment-paradox-of-software](https://geoff-yamane.com/blog/2018/09/17/the-investment-paradox-of-software)",
  "author_fullname": "t2_975c1prv",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Software is eating value investors",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/investing",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_s3u8lh",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.74,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 46,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 46,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1642172116,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.investing",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey guys,&lt;/p&gt;\n\n&lt;p&gt;I thought I would share some of my thoughts regarding the tension between value investing and software businesses. Would love some of your comments and feedback on this to see if you agree / disagree with particular parts.&lt;/p&gt;\n\n&lt;p&gt;---&lt;/p&gt;\n\n&lt;p&gt;Value investing is a form of allocating capital based on the principle of identifying good businesses that are trading below their “fair” or “intrinsic” value. Often, they are companies that are trading at a discount relative to their assets, the strength of their earnings or the steadiness of their cash flows. Value investing has proven to be a successful investment strategy, having made numerous millionaires and billionaires, including Warren Buffet.&lt;/p&gt;\n\n&lt;p&gt;However, the principles of value investing have been questioned over the past decade. Value stocks have performed terribly since the 2008 financial crisis, while growth stocks have performed exceptionally well during this period. Specifically, a large portion of overall market performance through the past decade has been captured by FAANG (Facebook, Amazon, Apple, Netflix, Google) and other software-driven technology companies, which value investors have typically avoided due to high valuations. The post lockdown recovery has further highlighted the attractive returns provided by software-driven companies as several technology stocks are at all-time highs. That seems to be changing a bit with inflation, however the 10 year return metrics cannot be ignored. &lt;/p&gt;\n\n&lt;p&gt;Value investing has gone through existential crises numerous times before and survived. I suspect it will overcome the current skepticism it is facing, as the core principles of value investing are still useful. However, as a prudent investor, I must continue to navigate changing market dynamics, question the principles of value investing and determine what, if anything, has changed.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Devoured By Software&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Software has become a key part of our lives today. Yet understanding the full implications and potential of software-driven companies is difficult due to the varied levels of success these companies can have. Products can be category defining (Google Search) or useless (Apple Maps). For all their unpredictability, software-driven companies as a category still demand high valuations. As such, value investors have stayed away from the space and missed out on their returns over the past decade.&lt;/p&gt;\n\n&lt;p&gt;Marc Andreessen began exploring the implications of software-driven business in his 2011 essay &lt;a href=\"https://a16z.com/2011/08/20/why-software-is-eating-the-world/\"&gt;Why Software Is Eating The World&lt;/a&gt;. His essay serves as a great starting point for considering the following key questions of (1) whether the economic and business model changes of software justify the high valuations demanded by these firms and (2) whether the value investing framework is still effective in allocating capital in the markets today.&lt;/p&gt;\n\n&lt;h1&gt;An Expensive Opportunity.&lt;/h1&gt;\n\n&lt;p&gt;There are three key characteristics of software-driven companies that could justify their expensive valuations: 1) Incremental marginal profits; 2) Scale and reach; and 3) Increasing return to scale.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;1) Incremental Marginal Profits:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Software-driven businesses are characterized by high initial fixed costs. The R&amp;amp;D costs required to get a product to market is massive. However, the incremental cost for each product sold is marginal. Profits can grow quickly once break-even is achieved, leading to a massive boost in profitability.&lt;/p&gt;\n\n&lt;p&gt;This is in contrast to traditional “physical” businesses where the ability to increase profits is limited by the variable costs and step costs of selling the product. While it might be impossible to predict which software products will take-off and what the magnitude of profitability growth will be, failure to understand the mechanics of software-driven business models makes software companies seem expensive.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;2) Scale &amp;amp; Reach:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;A key distinction between software-driven businesses and physical businesses is the former’s ability to scale. Roughly 3.5 billion people in the world currently have access to smartphones and the internet (&lt;a href=\"https://www.statista.com/statistics/330695/number-of-smartphone-users-worldwide/\"&gt;source&lt;/a&gt;). A new product can reach millions, if not billions, of people faster than ever before and this trend is only accelerating with time. It took Instagram roughly 8 years to get to a billion active daily users; it will take TikTok roughly 3 (&lt;a href=\"https://www.businessofapps.com/data/instagram-statistics/\"&gt;source&lt;/a&gt; &amp;amp; &lt;a href=\"https://wallaroomedia.com/blog/social-media/tiktok-statistics/\"&gt;source&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;An important driver of the rapid growth of technology firms is the low cost of scaling software. Software-driven businesses are not hindered by the common limitations that constrain physical businesses (i.e. supply chain logistics, key real estate in major markets, physical resources and inputs, etc.), which increase costs and delay growth. Software-driven businesses can take advantage of Infrastructure-as-a-Service (i.e. Amazon Web Services) and other key services to reduce the cost of scaling. Gerald F. Davis, professor at the University of Michigan, has estimated that the cost of launching a start-up has decreased by a magnitude of 100x in the past decade (&lt;a href=\"https://bthechange.com/the-declining-cost-of-startup-companies-c5a9a72bf1e6\"&gt;source&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;3) Increase Return To Scale:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;A core heuristic of value investors has been the &lt;a href=\"https://www.investopedia.com/terms/l/lawofdiminishingmarginalreturn.asp\"&gt;law of diminishing returns&lt;/a&gt; and &lt;a href=\"https://theconversation.com/regression-to-the-mean-or-why-perfection-rarely-lasts-74694\"&gt;regression to the mean&lt;/a&gt;. Benjamin Graham, the godfather of value investing, summarized the notion best with the phrase: &lt;em&gt;“Many shall be restored that are now fallen and many shall fall that now are held in honor.”&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;However, software has potentially increased the ability of firms to better fight these principles through network effects and increased returns to scale. W. Brian Arthur is credited for the modern description of the concept:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Increasing returns are the tendency for that which is ahead to get further ahead, for that which loses advantage to lose further advantage. They are mechanisms of positive feedback that operate—within markets, businesses, and industries—to reinforce that which gains success or aggravate that which suffers loss…&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;More than causing products to become standards, increasing returns cause businesses to work differently, and they stand many of our notions of how business operates on their head.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Software-driven businesses are often characterized by network effects and increasing returns to scale. As these businesses grow, their advantages become stronger, their probability of launching successful new products higher, and ability to scale them globally better.&lt;/p&gt;\n\n&lt;p&gt;Let’s use Google Search as an example. The more people use search, the better the product becomes. The better the product, the larger their competitive advantage, and the harder it is for a new entrant to compete. The better the product, the most people will continue to use Google Search instead of an alternative (do you know anyone who uses &lt;a href=\"https://duckduckgo.com/\"&gt;DuckDuckGo&lt;/a&gt;?) and the positive feedback loop will continue.&lt;/p&gt;\n\n&lt;p&gt;Contrast this to one of my favorite business that operates in the physical space, Lululemon. Every time I wear the Surge shorts, the product doesn’t become better. While there is an argument that the customer data Luluemon gains can improve their products, that iterative process is not as rapid, scalable and impactful as it is for software-driven firms.&lt;/p&gt;\n\n&lt;h1&gt;A New Paradigm?&lt;/h1&gt;\n\n&lt;p&gt;The combined impact of these characteristics creates a fly-wheel effect where select software-driven businesses experience lottery like pay-offs. Traditional valuation approaches are not well-suited to understanding these low-probability-high-reward scenarios.&lt;/p&gt;\n\n&lt;p&gt;However, that doesn’t mean value investing is no longer useful. The principle idea behind value investing is to pay a price that is less than the “fair” or “intrinsic” value of an asset. The better you are at finding this gap between price and value, the larger your margin of safety and ability to make money. But some of the traditional heuristics and mental models associated with value investing need to be reconsidered.&lt;/p&gt;\n\n&lt;p&gt;Traditional valuation approaches considered risk to be a bug, not a feature. However, the three characteristics of software-driven companies described above incentivize software-driven firms to chase risky projects that have lottery-like payoffs. A &lt;a href=\"https://hbr.org/2018/06/why-we-need-to-update-financial-reporting-for-the-digital-era\"&gt;HBR article&lt;/a&gt; written by Professor Govindarajan, described how “&lt;em&gt;an idea with uncertain prospects but with at least some conceivable chance of reaching a billion dollars in revenue is considered far more valuable than a project with net present value of few hundred million dollars but no chance of massive upside&lt;/em&gt;” to software-driven companies.&lt;/p&gt;\n\n&lt;p&gt;This is truer the larger the company is. If Apple considered a high probability of success project with a profit boost of $500m (which is significant by most standards), it would only lead to a 1% increase in their 2019 full-year net income of ~$55bn. They would likely pass in favor of something riskier but with more upside.&lt;/p&gt;\n\n&lt;p&gt;An alternative valuation framework is offered by CFOs of software-driven companies. These CFOs themselves admit that their market capitalizations cannot be justified based on traditional metrics. They speculate that perhaps their valuation might be the sum of the potential pay-offs of all the projects undertaken by their companies, now and in the future. This framework is closer to the venture capital world than traditional value investing. However, over-reliance on this approach would likely cause investors to be irrationally optimistic and over-value every single software-driven company.&lt;/p&gt;\n\n&lt;p&gt;How then do we reconcile the core principle of value investing and this new lens through which to view software-driven companies? I suspect the answer lies somewhere in the middle.&lt;/p&gt;\n\n&lt;p&gt;Investors would be foolish to violate the core principle of value investing. However, investors would be equally foolish in failing to recognize that the software business model has changed the incremental economics for select businesses. Perhaps the most prudent use of this framework is to understand that it applies infrequently, but when it does apply, it justifies the valuations. That takes judgement. And judgement is what separates investors from speculators.&lt;/p&gt;\n\n&lt;p&gt;Thanks for reading and would love your thoughts!&lt;/p&gt;\n\n&lt;p&gt;Regards,&lt;/p&gt;\n\n&lt;p&gt;Arash Param&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Inspiration And Additional Reading:&lt;/em&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"https://www.ft.com/content/00c722d6-760f-4871-a927-2c564fe17276\"&gt;https://www.ft.com/content/00c722d6-760f-4871-a927-2c564fe17276&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://geoff-yamane.com/blog/2018/09/17/the-investment-paradox-of-software\"&gt;https://geoff-yamane.com/blog/2018/09/17/the-investment-paradox-of-software&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qhhq",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "s3u8lh",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "arash_param",
  "discussion_type": null,
  "num_comments": 46,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/investing/comments/s3u8lh/software_is_eating_value_investors/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/investing/comments/s3u8lh/software_is_eating_value_investors/",
  "subreddit_subscribers": 1983383,
  "created_utc": 1642223246,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1642172116,
  "the_new_excerpt": "Hey guys,\n\nI thought I would share some of my thoughts regarding the tension between value\ninvesting and software businesses. Would love some of your comments and feedback\non this to see if you agree / disagree with particular parts.\n\n---\n\nValue investing is a form of allocating capital based on…"
}