{
  "author": "ParaGuardarCosas",
  "original_created_utc": 1627237918,
  "title": "Wikipedia says forced and mostly public anilingus was used as a form of punishment, usually of prisoners, during the Thirty Years War. How did this work? Who was having their ass licked? How did this practice originate and how did it die out? Did it happen elsewhere at any time in history?",
  "created_utc": 1627249332,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The relevant quote from the Anilingus article, <a href=\"https://en.wikipedia.org/wiki/Anilingus:\">https://en.wikipedia.org/wiki/Anilingus:</a> &quot;Forced and mostly public anilingus was used as a form of humiliation and punishment, usually of prisoners. The use of the practice in the Thirty Years&#39; War was described by Grimmelshausen in Simplicius Simplicissimus (1668).[17] The practice is commonly referred to as &quot;arse licking&quot;, and the term is still at times applied to the behaviour of someone who is overly respectful or helpful to someone in authority.[18] &quot;</p>\n\n<p>The primary source simply leads to the name of a translated edition of a German picaresque novel from 17 century, without citing any source of the real historicity of this kind of punishment.</p>\n</div><!-- SC_ON -->",
  "score": 321,
  "permalink": "/r/AskHistorians/comments/orh231/wikipedia_says_forced_and_mostly_public_anilingus/",
  "subreddit": "AskHistorians",
  "id": "orh231",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The relevant quote from the Anilingus article,\nhttps://en.wikipedia.org/wiki/Anilingus: \"Forced and mostly public anilingus was\nused as a form of humiliation and punishment, usually of prisoners. The use of\nthe practice in the Thirty Years' War was described by Grimmelshausen in\nSimplicius…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アニリングスの記事から該当箇所を引用します。\nhttps://en.wikipedia.org/wiki/Anilingus。\"強制的に、ほとんどの場合、公衆の面前でアニリングスが行われた。\n囚人の屈辱と罰のために使われた。三十年戦争でのアニリングスの使用は\n三十年戦争での使用については、グリムルスハウゼンが『シンプリシウス...』の中で述べている。\nSimplicius...",
      "title": "ウィキペディアによると、三十年戦争中には、強制的に、ほとんどの場合、公衆の面前でアニリングスを行うことが、刑罰として用いられていたそうです。これはどのように行われたのでしょうか？誰がお尻を舐められていたのでしょうか？この習慣はどのようにして生まれ、どのようにして消えていったのでしょうか？歴史上、他の地域でも同じようなことがあったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Anilingus文章中的相关引用。\nhttps://en.wikipedia.org/wiki/Anilingus。\"强迫性的、主要是公开的肛交被用来作为羞辱和惩罚的形式。\n被用作一种羞辱和惩罚的形式，通常是对囚犯。在三十年战争中使用的\n在三十年战争中使用这种做法的情况，由格里梅尔斯豪森在《Simplicius》一书中描述。\nSimplicius...",
      "title": "维基百科说，在三十年战争期间，强迫和大部分公开的肛交被作为一种惩罚形式，通常是对囚犯的惩罚。这是怎么做到的？谁在被舔屁股？这种做法是如何起源的，又是如何消亡的？它在历史上的任何时候都会发生在其他地方吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Anilingus文章中的相關引用。\nhttps://en.wikipedia.org/wiki/Anilingus。\"強迫性的、主要是公開的肛交被用來作爲羞辱和懲罰的形式。\n被用作一種羞辱和懲罰的形式，通常是對囚犯。在三十年戰爭中使用的\n在三十年戰爭中使用這種做法的情況，由格里梅爾斯豪森在《Simplicius》一書中描述。\nSimplicius...",
      "title": "維基百科說，在三十年戰爭期間，強迫和大部分公開的肛交被作爲一種懲罰形式，通常是對囚犯的懲罰。這是怎麼做到的？誰在被舔屁股？這種做法是如何起源的，又是如何消亡的？它在歷史上的任何時候都會發生在其他地方嗎？"
    }
  ]
}