{
  "author": "Pantsisacat",
  "the_new_excerpt": "Hello all,\n\nBefore I begin, I would like to thank each and every member of this sub for\ntheir contributions. I began my investing journey in February 2020 as a 39 yr\nold, newly divorced man. I guess the timing couldn’t have been better, as I’ve\nwatched my net worth grow from 120k-600k in 14 months.…",
  "original_created_utc": 1618712704,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n始める前に、このサブのメンバー一人一人の貢献に感謝したいと思います。\n貢献に感謝します。私は2020年2月に39歳の離婚したばかりの男性として投資を始めました。\n歳、離婚したばかりの男性です。このタイミングで、私は自分の純資産が12万円から15万円に増えるのを見てきました。\n私の純資産が14ヶ月で12万円から60万円に増えるのを見てきました....",
      "title": "600kのポートフォリオ、もっと分散させるべき？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好\n\n在我开始之前，我要感谢这个小组的每一个成员，感谢他们的努力。\n他们的贡献。我在2020年2月开始了我的投资之旅，作为一个39岁的。\n老了，刚离婚的男人。我想这个时机再好不过了，因为我已经。\n看着我的净资产在14个月内从12万-60万增长....。",
      "title": "60万的投资组合，我是否应该更加分散投资？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好\n\n在我開始之前，我要感謝這個小組的每一個成員，感謝他們的努力。\n他們的貢獻。我在2020年2月開始了我的投資之旅，作爲一個39歲的。\n老了，剛離婚的男人。我想這個時機再好不過了，因爲我已經。\n看着我的淨資產在14個月內從12萬-60萬增長....。",
      "title": "60萬的投資組合，我是否應該更加分散投資？"
    }
  ],
  "title": "600k portfolio, Should I be more diversified?",
  "created_utc": 1618741753,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello all,</p>\n\n<p>Before I begin, I would like to thank each and every member of this sub for their contributions. I began my investing journey in February 2020 as a 39 yr old, newly divorced man. I guess the timing couldn’t have been better, as I’ve watched my net worth grow from 120k-600k in 14 months. My son was just born 6 weeks ago and I’ve noticed my portfolio shrink by 15% even as the market has reached ATH. Highly speculative stocks brought me incredible returns, but now that I have a son, I think I should tone down the risk a bit. Since <a href=\"/r/stocks\">r/stocks</a> and other investing subs have been so instrumental in my early stock market education, I thought I would solicit ideas to help diversify my portfolio. </p>\n\n<p>Here is what I own, after selling a bunch of spacs and a few other speculative assets. </p>\n\n<p>•Pins -13% \n•Net- 12%\n•Sq- 10%\n•Nike-7%\n•SCHD-7%\n•ENPh-5%\n•Etsy-5%\n•Se-5%\n•Stmp-5%\n•Jmia-4%\n•Nvda-4%\n•Crsr-3%\n•Gan-3%\n•Paysafe-3%\n•Boeing -3%\n•CNI- 3%</p>\n\n<p>Cash- $25k </p>\n\n<p>I was thinking of adding Disney and JPM, but I would very much appreciate any other suggestions. Thanks again!</p>\n</div><!-- SC_ON -->",
  "score": 74,
  "permalink": "/r/stocks/comments/mt4bet/600k_portfolio_should_i_be_more_diversified/",
  "subreddit": "stocks",
  "id": "mt4bet",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171526207
}