{
  "author": "freebytauricidej9",
  "original_created_utc": 1631713393,
  "title": "Was Jesus a Psychopath?",
  "created_utc": 1631722534,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just read this book called Evil Religions Unmasked where the author made an analysis on the Sermon of the Mount. My question arose when I understood the evilness of Jesus’ preach “love your enemy.” In that phrase, we have two strong words, love and enemy. Be sure that if you have an enemy, he will never rest until killing you, don’t think he will avoid your presence, it’s like you are an American living in Afghanistan, ok? And about love, instead of telling my words, I use the own Jesus’ below.</p>\n\n<p>“But I say to you, do not resist the one who is evil. But if anyone slaps you on the right cheek, turn to him the other also. And if anyone would sue you and take your tunic, let him have your cloak as well. And if anyone forces you to go one mile, go with him two miles.”</p>\n\n<p>Before this phrase, we read, “Blessed are those who are persecuted for righteousness sake, for theirs is the kingdom of heaven.” The meaning of Jesus’ “righteousness” is that above.</p>\n\n<p>Let’s put this in our true perspective.</p>\n\n<p>From Jesus’ teaching, if Hitler or any other dictator have told you to do all that evil to others you should do that, once, for Jesus, not only you must put yourself in the hands of your enemies, but everyone else because the aim is to reach “the kingdom of heaven.”</p>\n\n<p>So, for Jesus the fight against Hitler was wrong, people should have walked two miles with him, having him asked for one!</p>\n\n<p>To everyone who wants to tell me, “You need to interpret his sayings” I can tell you if you want to know how to interpret the Bible, read the book. And, please, remember that the first Christians did 100% which is in that sermon, so there is no way to deny the meaning of it.</p>\n\n<p>As my question left clear, I’m asking for a psychological analysis of him. Jesus’ “love your enemy” is so malevolent that people push for an “interpretation” trying to turn it into something good, since we have the word love, and you know, love is so good. Psychologically, this people’s behavior toward the Bible’s teachings seems like a wife’s that is being abused by an evil husband, but she tries to find herself wrong and her husband right and doing that due to a love of her, isn’t it?</p>\n\n<p>The author of that book made a Bible’s analysis in many aspects concluding that it’s a diabolic work to put all of us living in hell and, following the instructions of Jesus in that sermon our lives would become a hell. He understood that the purpose of Christianity is to put us to die on a cross, when and where we will discover in our last minute that who we are worshipping is actually a demon, as Jesus screamed, “Father, father, why have you forsaken me?” He concluded that Jesus was created by a demon.</p>\n\n<p>But the Sermon of the Mount doesn’t seem a commandment of Jesus’ God, it seems from his mind, and this is why I’m asking if he himself was a psychopath. More than this sermon we have other scaring words from him like in John 14, “Believe in God; also believe in me.” And “I am the way, and the truth, and the life. No one comes to the Father except through me.” In Mathew 28 we read, “All authority in heaven and on Earth has been given to me.” What a modesty, ah?</p>\n\n<p>If you are a psychologist and facing someone speaking like Jesus, what would be your diagnosis of him?</p>\n\n<p>If the answer is yes, Jesus was a psychopath, could you imagine what a hell is this, advertising a psychopath as a savior? And people falling into it?</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/poqdtc/was_jesus_a_psychopath/",
  "subreddit": "TooAfraidToAsk",
  "id": "poqdtc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I just read this book called Evil Religions Unmasked where the author made an\nanalysis on the Sermon of the Mount. My question arose when I understood the\nevilness of Jesus’ preach “love your enemy.” In that phrase, we have two strong\nwords, love and enemy. Be sure that if you have an enemy, he will…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "邪悪な宗教の仮面を剥ぐ』という本を読みました。\n山の説教について分析しています。私が疑問に思ったのは、イエスが説いた「敵を愛せ」という言葉の邪悪さを理解したときです。\n疑問に思ったのは、イエスが説いた \"敵を愛せ \"という言葉の邪悪さです。この言葉には、愛と敵という二つの強い言葉があります。\n愛と敵という二つの強い言葉があります。もしあなたに敵がいたら、その人は必ず...",
      "title": "イエスはサイコパスだったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚读了这本名为《邪恶宗教揭秘》的书，作者在书中分析了\n的书，作者对《登山宝训》进行了分析。我的问题是，当我理解\n我的问题是，当我理解耶稣宣扬的 \"爱你的敌人 \"的邪恶性时。在这句话中，我们有两个强烈的\n词，爱和敌人。要确信，如果你有一个敌人，他将...",
      "title": "耶稣是个精神病患者吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛讀了這本名爲《邪惡宗教揭祕》的書，作者在書中分析了\n的書，作者對《登山寶訓》進行了分析。我的問題是，當我理解\n我的問題是，當我理解耶穌宣揚的 \"愛你的敵人 \"的邪惡性時。在這句話中，我們有兩個強烈的\n詞，愛和敵人。要確信，如果你有一個敵人，他將...",
      "title": "耶穌是個精神病患者嗎？"
    }
  ]
}