{
  "author": "FinFree4Ever",
  "original_created_utc": 1657203570,
  "title": "“Not your keys, not your crypto” - not for everybody",
  "created_utc": 1657222554,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is definitely an unpopular opinion and I’ll probably get downvoted to the pits of hell especially so in this sub-reddit for saying this but please don’t - hear me out. &lt;/p&gt;\n\n&lt;p&gt;“Not your keys, not your crypto” is definitely a mantra chanted over and over again in this sun-reddit but I’m of the opinion it is not for everybody. In fact, not for the large majority of retailer users, and that includes many of us here. &lt;/p&gt;\n\n&lt;p&gt;So many people lose their keys or coins the moment they take it off exchanges. They get hacked, scammed, phished or even physically robbed in real life - It happens a lot. You hear about it without fail every single week in this sub reddit.&lt;/p&gt;\n\n&lt;p&gt;The attack vectors for cold wallets are plenty as well, from the day you received it is it a compromised or fake hardware device? Did you download the right software? Every time you updated the software, did you update the legitimate software for your hardware token? &lt;/p&gt;\n\n&lt;p&gt;Even after you’ve set up, the attacks are ongoing… What if you download a malware in the future on your desktop, dusting attacks, accidentally interacting with a malicious smart contract.&lt;/p&gt;\n\n&lt;p&gt;Physically, the risk is there. Your seed phrase on the metal sheet can be stolen in a break in. You could lose your seed in a fire, or it gets compromised in someway. &lt;/p&gt;\n\n&lt;p&gt;More gets lost in self-custody than on exchanges.&lt;/p&gt;\n\n&lt;p&gt;I’m of the opinion, it is wiser to spread your crypto in the top CEX like Coinbase, binance, Kraken, Gemini and FTX. Secure it with 2FA, 3FA, 4FA with one of them being a physical key like the yubikey.&lt;/p&gt;\n\n&lt;p&gt;Please don’t downvote me, but I think this needs to be acknowledged rather than just NYKNYC.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 311,
  "permalink": "/r/CryptoCurrency/comments/vtjs7w/not_your_keys_not_your_crypto_not_for_everybody/",
  "subreddit": "CryptoCurrency",
  "id": "vtjs7w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This is definitely an unpopular opinion and I’ll probably get downvoted to the\npits of hell especially so in this sub-reddit for saying this but please don’t -\nhear me out.\n\n“Not your keys, not your crypto” is definitely a mantra chanted over and over\nagain in this sun-reddit but I’m of the opinion…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは間違いなく不人気な意見で、おそらくダウンボーティングされるでしょう。\nこのサブディレクトリでは特にそうです。\n最後まで聞いてください。\n\n\"Not your keys, not your crypto \"は、このsun-redditで何度も何度も唱えられたマントラであることは間違いありません。\nしかし、私はこう考えています。",
      "title": "\"Not your keys, not your crypto\" - not for everybody"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这绝对是一个不受欢迎的观点，我可能会被降级到地狱，尤其是在这个分论坛上。\n特别是在这个子目录下，但请不要--听我说。\n请听我说完。\n\n\"不是你的钥匙，不是你的加密货币 \"绝对是一个反复吟唱的咒语\n但我认为......。",
      "title": "\"不是你的钥匙，不是你的密码\"--不适合所有人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這絕對是一個不受歡迎的觀點，我可能會被降級到地獄，尤其是在這個分論壇上。\n特別是在這個子目錄下，但請不要--聽我說。\n請聽我說完。\n\n\"不是你的鑰匙，不是你的加密貨幣 \"絕對是一個反覆吟唱的咒語\n但我認爲......。",
      "title": "\"不是你的鑰匙，不是你的密碼\"--不適合所有人"
    }
  ]
}