{
  "author": "FirstAuroraBorealis",
  "original_created_utc": 1651838142,
  "title": "What did the Habsburgs think about the 'Habsburg jaw'?",
  "created_utc": 1651844535,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m curious if there are any records of what the Habsburgs thought about their distinctive &amp;#39;Habsburg jaw&amp;#39;. Did they notice that it was prevalent in their family, or did they think it was normal? If they did notice, what did they think caused it? &lt;/p&gt;\n\n&lt;p&gt;An additional question I have is, what did contemporaries think about their jaw? Did other royal families notice it? What did their royal painters think about it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/ujlsbf/what_did_the_habsburgs_think_about_the_habsburg/",
  "subreddit": "AskHistorians",
  "id": "ujlsbf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm curious if there are any records of what the Habsburgs thought about their\ndistinctive 'Habsburg jaw'. Did they notice that it was prevalent in their\nfamily, or did they think it was normal? If they did notice, what did they think\ncaused it?\n\nAn additional question I have is, what did…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ハプスブルク家の顎をどう考えていたのか、記録が残っているか気になるところです。\nハプスブルク家特有の \"ハプスブルグ・アゴ \"について、どう考えていたのか。ハプスブルク家に多いということに気づいていたのでしょうか。\nそれとも、それが普通だと思っていたのでしょうか？もし気づいていたとしたら、その原因は何だと考えていたのでしょう？\nを考えていたのでしょうか？\n\nそして、もうひとつの疑問は、その原因は何だったのか、ということだ。",
      "title": "ハプスブルク家は「ハプスブルクの顎」をどう考えていたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很好奇，是否有任何记录表明哈布斯堡家族对他们的\n独特的 \"哈布斯堡下巴\"。他们是否注意到这在他们的家族中很普遍？\n还是他们认为这是正常现象？如果他们注意到了，他们认为是什么\n造成的？\n\n我的另一个问题是，什么...",
      "title": "哈布斯堡家族对 \"哈布斯堡的下巴 \"有什么看法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很好奇，是否有任何記錄表明哈布斯堡家族對他們的\n獨特的 \"哈布斯堡下巴\"。他們是否注意到這在他們的家族中很普遍？\n還是他們認爲這是正常現象？如果他們注意到了，他們認爲是什麼\n造成的？\n\n我的另一個問題是，什麼...",
      "title": "哈布斯堡家族對 \"哈布斯堡的下巴 \"有什麼看法？"
    }
  ]
}