{
  "author": "ImJustMeSry",
  "the_new_excerpt": "I apologize beforehand if what I type seems really depressing or wrong or\nsomething, I'm honestly really tired of wasting my energy on this \"project\"\nsince most of my friends won't listen or don't want to.\nTL;DR will be at the bottom.\n\nI've heard so much about Safemoon these last few days, from…",
  "original_created_utc": 1618912043,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が入力したものが、本当に憂鬱であったり、間違っていたりしたら、事前に謝ります。\n私は正直、この「プロジェクト」に無駄なエネルギーを費やすことに疲れています。\nほとんどの友達は聞いてくれないし、聞きたくもないからです。\nTL;DRは下部にあります。\n\nここ数日、Safemoonについて多くのことを聞いてきました。",
      "title": "Safemoonは安全の反対で、どうか全財産を失わないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我打的东西看起来非常压抑或错误或什么的，我事先道歉。\n我真的很厌倦在这个 \"项目 \"上浪费我的精力。\n因为我的大多数朋友都不愿意听或不想听。\nTL;DR将在底部。\n\n这几天我听说了很多关于Safemoon的事情，从...",
      "title": "Safemoon是安全的反义词--请不要失去你所有的钱。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我打的東西看起來非常壓抑或錯誤或什麼的，我事先道歉。\n我真的很厭倦在這個 \"項目 \"上浪費我的精力。\n因爲我的大多數朋友都不願意聽或不想聽。\nTL;DR將在底部。\n\n這幾天我聽說了很多關於Safemoon的事情，從...",
      "title": "Safemoon是安全的反義詞--請不要失去你所有的錢。"
    }
  ],
  "title": "Safemoon is the opposite of safe - please don't lose all your money.",
  "created_utc": 1618929059,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I apologize beforehand if what I type seems really depressing or wrong or something, I&#39;m honestly really tired of wasting my energy on this &quot;project&quot; since most of my friends won&#39;t listen or don&#39;t want to.<br/>\nTL;DR will be at the bottom.</p>\n\n<p>I&#39;ve heard so much about Safemoon these last few days, from friends telling me that I should get in on it to seeing it being shilled on this subreddit.<br/>\nSome people saying just to ride the way, it&#39;d be stupid not to!! I&#39;m honestly tired and appalled of this behaviour. So after already spending way too much time trying to save my friends&#39; bank accounts, one last time I felt like putting out my reasoning behind why &quot;riding the wave&quot; of Safemoon is appalling and why Safemoon isn&#39;t safe. Maybe I will help at least one more person to not lose all their savings into this scam.</p>\n\n<p>Okay first off let&#39;s start with the basics.<br/>\n<a href=\"https://safemoon.net/\">Safemoon.net</a>, great the site looks pretty clean! Let&#39;s even ignore the countless clones like for example <a href=\"https://safemarscrypto.com/\">safemarscrypto.com</a> that were supposedly registered on the same day. Okay. The team, they have 5 people in their team and one website developer. They have their names and everything!? Or? The only thing with their personal details are linkedin profiles where anyone can fill in whatever information they want.</p>\n\n<p>Their details are not consistent either, for example: On &quot;Henry Wyatt&quot;&#39;s profile he said the work he is most proud of is that he created an MMORPG with 300k users that blew up practically overnight. On &quot;HLWGroup&quot; which is the company several of the people in the team have on their profiles as experience it says &quot;Started one of the largest legal RuneScape Private Servers in history with 500,000 accounts and $300,000+ annual revenue.&quot;.<br/>\nOkay that doesn&#39;t confirm anything, I just thought it was an interesting thing to note. Creating an MMORPG that blows up overnight or creating a private server for Runescape is pretty different. But fair enough, let&#39;s say Mr. Wyatt here just wanted to sound a bit more accomplished than just creating a big private server.<br/>\nShould we also ignore the fact that HLWGroup links to a website with the link &quot;<a href=\"https://imagine.ps/\">imagine.ps</a>&quot; when, if you do some tiny digging on google, you find out the fact that every mention in the past of the actual private runescape server that existed had the link &quot;<a href=\"https://imagine-ps.com/\">imagine-ps.com</a>&quot;?</p>\n\n<p>Anyway, to note is that the &quot;developers&quot; don&#39;t seem to have any connection with anything that contains real personal information as in they&#39;re not connected to their facebook page with their real accounts nor do their twitter accounts have much activity before all these shenanigans started.</p>\n\n<p>Okay, let&#39;s move on to some more incriminating stuff than just some feelings of stuff being shady.</p>\n\n<p><a href=\"https://tokensniffer.com/\">Tokensniffer.com</a> is a website that compares the similarities behind different tokens to find out if a token is just a simply copy paste of something that has existed in the past or if it&#39;s original. If you go to <a href=\"https://tokensniffer.com/token/0x8076c74c5e3f5852037f31ff0093eeb8c8add8d3\">https://tokensniffer.com/token/0x8076c74c5e3f5852037f31ff0093eeb8c8add8d3</a> which is the Safemoon contract you can see it has already extreme similarities with projects that were deployed weeks before. 94% of the code from a project has been reused in Safemoon. These projects are also flagged due to being run by a known serial scammer. Funny thing to re-use 94% of a code that belonged to someone known for scamming. If you want to you can compare the projects and see how little difference there is, more or less the only things changed being amount of tokens and the name.<br/>\nLiterally anyone with just a basic understanding of programming can do these changes. So they need 5 &quot;developers&quot; for copy-pasting a code being run by a serial scammer and changing a few lines of code?</p>\n\n<p>This is a 4B market cap project by the way. Changing a few lines of codes, hype and claiming to develop things further down the line with no proof whatsoever that they have any type of skill needed to create actually unique things. Let that sink in if you think this will go to the moon forever as well, a 10x from here and it&#39;s already a top 10 crypto.</p>\n\n<p>Now what does this 4B market cap project do? What is its reason for existing? What problem does it solve?<br/>\nIt exists to make money. 5% of every transaction gets burned, 5% gets redistributed to previous holders. It has no fundamental reason to exist past this, if you think this is some type of genius mechanism to make everyone money you are misled. A scheme like this feeds on itself with the money that gets invested from newer investors to older investors. The market cap gets bigger and bigger and the amount of money needed to make everyone profit also increases exponentially until there is no longer enough new people willing to invest in it, what happens then with a project like this that has no reason to exist past making money?<br/>\nEarlier investors will start taking out their money and put them in another project that has better returns, the price will drop, more investors will take out their money while they can and the price will drop further and a panic drop will most likely ensue and the project will be worthless since there is no use case for it.</p>\n\n<p>Who gets burned? The large amount of new investors who got in just before the growth no longer was sustainable.</p>\n\n<p>Now why should you not just join in and ride the wave while you can on a project like this? What&#39;s the difference between something like and Bitcoin?<br/>\nWell. Bitcoin has an underlying reason to exist. It&#39;s valued where people think or expect the blockchain technology of bitcoin to be valued. It also has the computing power behind it that secures Bitcoin&#39;s blockchain. This token solves nothing, provides nothing, and does nothing except lure people in with promises of great returns. You&#39;re simply profiting of people that got in later than you and every scheme like this grows quickly then falls quickly because 10% growth for every person really is not sustainable after some point.</p>\n\n<p>It&#39;s a smart ponzi scheme. And you&#39;re making the most predatory people the most money, and burning the most trusting people by participating in schemes like these.<br/>\nThere are endless copies of Safemoon, or similar schemes, Safemoon just got the most traction from social media. There will be more in the future, and there has already been a lot of very similar schemes. Don&#39;t participate in them if you understand what is happening, even if you manage to make money from it (which is not a guarantee even if you actively search them out), it&#39;s counterproductive and dangerous for the cryptocurrency market and you only steal money from people who are less informed. Things like these are criminal in most places for a reason.</p>\n\n<p>I&#39;m pretty new to economics in general so I might not have given the perfect explanation, if anything I said was wrong or if something could be explained better I would love to hear it. But this is what I&#39;ve understood from wasting a lot of hours trying to help people.</p>\n\n<p>Don&#39;t lose all your savings, don&#39;t make other people lose all their savings.</p>\n\n<p>TL;DR:<br/>\nSafemoon is a &quot;smart&quot; ponzi scheme.<br/>\nIt has nothing original in it and only grows because of a predatory unsustainable mechanism built into its code (stealing 10% of the transaction and benefitting earlier investors).<br/>\nIt has no reason to exist except make money quick, and when it stops because of unsustainable growth the price will collapse.</p>\n\n<p>Stop telling people to ride the wave, you&#39;re hurting innocent people and the crypto market as a whole.</p>\n</div><!-- SC_ON -->",
  "score": 1170,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/x_3VhIUnhWxsIOJnqyRChqercC_XO83mEN2sGTccR4E.jpg?auto=webp&s=df520a82c19c65e4f6b7750a559b09f27a43c750",
          "width": 960,
          "height": 540
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/x_3VhIUnhWxsIOJnqyRChqercC_XO83mEN2sGTccR4E.jpg?width=108&crop=smart&auto=webp&s=df65b2db4e8f718558047eb187a61340a8d72e5f",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/x_3VhIUnhWxsIOJnqyRChqercC_XO83mEN2sGTccR4E.jpg?width=216&crop=smart&auto=webp&s=0be0426c13d214049b5348c5351b47356fa1b94b",
            "width": 216,
            "height": 121
          },
          {
            "url": "https://external-preview.redd.it/x_3VhIUnhWxsIOJnqyRChqercC_XO83mEN2sGTccR4E.jpg?width=320&crop=smart&auto=webp&s=f9e37515e5c522bb07078a5422ee497de5e4bd26",
            "width": 320,
            "height": 180
          },
          {
            "url": "https://external-preview.redd.it/x_3VhIUnhWxsIOJnqyRChqercC_XO83mEN2sGTccR4E.jpg?width=640&crop=smart&auto=webp&s=e795403db41475ef3ef0bd4d142916ec7cbb6eaa",
            "width": 640,
            "height": 360
          },
          {
            "url": "https://external-preview.redd.it/x_3VhIUnhWxsIOJnqyRChqercC_XO83mEN2sGTccR4E.jpg?width=960&crop=smart&auto=webp&s=f824e20af5dd0c3d5daddadac9f99bd8ff88f10d",
            "width": 960,
            "height": 540
          }
        ],
        "variants": {},
        "id": "I8VbLm8YE76h24QIDzWKQQ9vudgQso9YbysR3UhaQ10"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/mumth2/safemoon_is_the_opposite_of_safe_please_dont_lose/",
  "subreddit": "CryptoCurrency",
  "id": "mumth2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171523314
}