{
  "author": "MVTHOLST",
  "the_new_excerpt": "My friend u/HappyAnsu [/u/HappyAnsu] and I originally wanted to buy some of the\nmain ARK ETF's, but due to the tax regulations in Denmark it wouldn't pay off\nvery well. Therefore, we decided that we should rather pick out and invest in\nthe ETF's individual holdings by ourself, which is why we made…",
  "original_created_utc": 1609425105,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我的朋友u/HappyAnsu[/u/HappyAnsu]和我原本想买一些\n主方舟ETF，但由于丹麦的税收规定，它不会有回报\n很好。因此，我们决定，我们宁可挑选并投资于\n交易所交易基金的个人持股是我们自己持有的，这就是为什么我们做了…",
      "title": "我们用5只主方舟ETF的持有量创建了一张表格"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的朋友u/HappyAnsu[/u/HappyAnsu]和我原本想買一些\n主方舟ETF，但由於丹麥的稅收規定，它不會有回報\n很好。因此，我們決定，我們寧可挑選並投資於\n交易所交易基金的個人持股是我們自己持有的，這就是爲什麼我們做了…",
      "title": "我們用5只主方舟ETF的持有量創建了一張表格"
    }
  ],
  "title": "We created a Sheet with the 5 main ARK ETF's holdings",
  "created_utc": 1609429679,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My friend <a href=\"/u/HappyAnsu\">u/HappyAnsu</a> and I originally wanted to buy some of the main ARK ETF&#39;s, but due to the tax regulations in Denmark it wouldn&#39;t pay off very well. Therefore, we decided that we should rather pick out and invest in the ETF&#39;s individual holdings by ourself, which is why we made this sheet.</p>\n\n<p>The sheet lists all the companies from the five main ARK ETF&#39;s (ARK K,W,G,F,Q), with multiple data such as live stock prices, live stock return, weight in the portfolios, etc.</p>\n\n<p>Due to regular changes in both amount of shares owned in the ETF&#39;s and changes to companies owned, we plan to update the sheet fairly often.</p>\n\n<p>We will happily take any constructive feedback, if it adds to the usability of the sheet. :)</p>\n\n<p>LINK: <a href=\"https://docs.google.com/spreadsheets/d/1EEywCKauljHmqIqABdyyRdmRizqzGrACJOm9pzHjmXc/edit?usp=sharing\">https://docs.google.com/spreadsheets/d/1EEywCKauljHmqIqABdyyRdmRizqzGrACJOm9pzHjmXc/edit?usp=sharing</a></p>\n</div><!-- SC_ON -->",
  "score": 366,
  "permalink": "/r/stocks/comments/knqy5l/we_created_a_sheet_with_the_5_main_ark_etfs/",
  "subreddit": "stocks",
  "id": "knqy5l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100748516
}