{
  "author": "Vegetable_Study3730",
  "original_created_utc": 1642794217,
  "title": "Too many people in this sub who still don’t get it",
  "created_utc": 1642836737,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Bitcoin wasn’t made to be another Wall Street instrument, or an “investment” if you will. It was always about making sound money with predictable and fair rules. You don’t make money with Bitcoin, because it is “money”.&lt;/p&gt;\n\n&lt;p&gt;Just like gold, first people have to believe it’s a store of value, then a layer on top of it will be for transactions. There are basically two outcomes for that vision:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;It succeeds and Bitcoin becomes the global money system &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;It fails and goes to zero after successive governments bans and mainstream fud&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;You measure which one is more likely by things like the network value, hash rate, adoption, etc.&lt;/p&gt;\n\n&lt;p&gt;Whether it is $44k or $38k or $75k is completely irrelevant. Just like whether Bitcoin was $100 or $400 few years ago is irrelevant today.&lt;/p&gt;\n\n&lt;p&gt;If you don’t believe in #1 and want some exposure just in case, just put 1% of your net worth in there and forget it. &lt;/p&gt;\n\n&lt;p&gt;If you fully believe in #1, DCA and Hodl. &lt;/p&gt;\n\n&lt;p&gt;If you want to trade in and out, Bitcoin is terrible for that. At a minimum, you will be paying trading fees and terrible spread. Just open a brokerage account and trade some stock that you feel good about.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "permalink": "/r/Bitcoin/comments/s9j2n3/too_many_people_in_this_sub_who_still_dont_get_it/",
  "subreddit": "Bitcoin",
  "id": "s9j2n3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Bitcoin wasn’t made to be another Wall Street instrument, or an “investment” if\nyou will. It was always about making sound money with predictable and fair\nrules. You don’t make money with Bitcoin, because it is “money”.\n\nJust like gold, first people have to believe it’s a store of value, then a…"
}