{
  "author": "iEatSwampAss",
  "original_created_utc": 1636001006,
  "title": "Cryptocurrency has made a lot young people very large sums of money. In the coming years, this will inevitably reshape the way our world works.",
  "created_utc": 1636043896,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am curious why this is not discussed by more people. Forever, younger generations have never had power or any real ways to represent themselves. The people making rules have always had the most wisdom, but that means they’re also the oldest &amp; most out of touch with modern advancements. </p>\n\n<p><strong>Money is power.</strong> It simply opens doors to further wealth generation others aren’t offered. And whether you like it or not, cryptocurrency is putting significant sums of money into younger people’s pockets as NFT’s and BEP20 become popular. It’s bad ass to see!</p>\n\n<p>I’m calling it now, in a decade, there will be some much younger, very powerful people begin appearing and making changes to the world.</p>\n</div><!-- SC_ON -->",
  "score": 250,
  "permalink": "/r/CryptoCurrency/comments/qmd0j3/cryptocurrency_has_made_a_lot_young_people_very/",
  "subreddit": "CryptoCurrency",
  "id": "qmd0j3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am curious why this is not discussed by more people. Forever, younger\ngenerations have never had power or any real ways to represent themselves. The\npeople making rules have always had the most wisdom, but that means they’re also\nthe oldest & most out of touch with modern advancements.\n\nMoney is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜこれがもっと多くの人に議論されないのか不思議です。いつまでたっても若い世代は\n世代は、権力や自分を表現する実際の方法を持っていませんでした。ルールを作る人が\nルールを作る人々は常に最も知恵を持っていますが、それは彼らが最も古くて現代の進歩に疎いということでもあります。\nしかし、それは同時に、最も古く、最も現代の進歩に疎いということでもあります。\n\nお金は...",
      "title": "暗号通貨は、多くの若い人たちに非常に大きなお金をもたらしました。今後数年のうちに、このことが私たちの世界の仕組みを再構築することは避けられないでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很好奇为什么没有更多的人讨论这个问题。永远，年轻一代\n代人从来没有权力或任何真正的方式来代表自己。制定规则的人\n制定规则的人总是有最多的智慧，但这意味着他们也是\n他们也是最老的，也是与现代进步最脱节的。\n\n钱是...",
      "title": "加密货币让很多年轻人赚到了非常大的一笔钱。在未来几年，这将不可避免地重塑我们的世界运作方式。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很好奇爲什麼沒有更多的人討論這個問題。永遠，年輕一代\n代人從來沒有權力或任何真正的方式來代表自己。制定規則的人\n制定規則的人總是有最多的智慧，但這意味着他們也是\n他們也是最老的，也是與現代進步最脫節的。\n\n錢是...",
      "title": "加密貨幣讓很多年輕人賺到了非常大的一筆錢。在未來幾年，這將不可避免地重塑我們的世界運作方式。"
    }
  ]
}