{
  "author": "illintent99",
  "original_created_utc": 1636323477,
  "title": "Whether you want to admit it or not, you're in it for the money.",
  "created_utc": 1636342684,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You&#39;ve read the script before, they &quot;believe in the technology cryptocurrencies bring&quot;, it&#39;s &quot;not about more fiat, it&#39;s building up for the eventual mass adoption&quot;. </p>\n\n<p>Look I get it, blockchain technology is pretty cool and the idea of transparency is, well, ideal but we all know the end game here. </p>\n\n<p>You see it everywhere, I want &quot;financial independence, a house, be able to erase debt&quot;  tons of great reasons but it&#39;s all to get more fiat at the end of the day. I don&#39;t know about you, but my landlord doesn&#39;t accept ETH and you can&#39;t eat Bitcoin.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/qozb2t/whether_you_want_to_admit_it_or_not_youre_in_it/",
  "subreddit": "CryptoCurrency",
  "id": "qozb2t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "You've read the script before, they \"believe in the technology cryptocurrencies\nbring\", it's \"not about more fiat, it's building up for the eventual mass\nadoption\".\n\nLook I get it, blockchain technology is pretty cool and the idea of transparency\nis, well, ideal but we all know the end game…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼らは「暗号通貨がもたらす技術を信じている」、「不換通貨を増やすのではなく、将来に向けての準備をしている」という台本を読んだことがあるでしょう。\nがもたらす技術を信じている」、「不換紙幣を増やすのではなく、最終的な大量導入のために構築している\n最終的な大量導入のための準備」です。\n\nブロックチェーン技術は非常にクールであり、透明性のアイデアは理想的です。\nしかし、我々は最終的なゲームを知っている...",
      "title": "認めたくなくても認めたくなくても、お金のためにやっている。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你以前读过这个剧本，他们 \"相信加密货币的技术\n带来的技术\"，它 \"不是关于更多的法币，而是为最终的大规模发展做准备\n采用\"。\n\n听着，我明白了，区块链技术是非常酷的，而且透明度的想法\n但我们都知道最终的游戏......",
      "title": "无论你是否愿意承认，你都是为了钱。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你以前讀過這個劇本，他們 \"相信加密貨幣的技術\n帶來的技術\"，它 \"不是關於更多的法幣，而是爲最終的大規模發展做準備\n採用\"。\n\n聽着，我明白了，區塊鏈技術是非常酷的，而且透明度的想法\n但我們都知道最終的遊戲......",
      "title": "無論你是否願意承認，你都是爲了錢。"
    }
  ]
}