{
  "author": "Bitcoin_is_plan_A",
  "the_new_excerpt": "You have to invest a valuable, scarce resource in a trustless way to contribute\nto the blockchain, and he saw no other way (and neither do I).\n\nAlso, the more energy the bitcoin network uses, the more expensive it is to\nattack. Consider how much is spent, not only in energy, but production,…",
  "original_created_utc": 1621152989,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ブロックチェーンに貢献するためには、貴重で希少な資源を信頼できない方法で投資しなければなりません。\nブロックチェーンに貢献するためには、貴重な希少資源を信頼できない方法で投資しなければなりませんが、彼はそれ以外の方法を考えませんでした（私もそうです）。\n\nまた、ビットコイン・ネットワークが使用するエネルギーが多ければ多いほど、攻撃のコストも高くなります。\nの攻撃を受けます。エネルギーだけでなく、生産、...にどれだけの費用がかかっているかを考えてみてください。",
      "title": "考察 ビットコインのエネルギー使用量は欠陥ではなく、設計上そうなっています。サトシがビットコインに検閲耐性を持たせるにはそれしかないのだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你必须以一种无信任的方式投资一种有价值的、稀缺的资源来为区块链作出贡献。\n到区块链上，而他认为没有其他办法（我也是如此）。\n\n而且，比特币网络使用的能量越多，它的攻击成本就越高。\n攻击。考虑到有多少花费，不仅是能源，还有生产，...",
      "title": "考虑一下。比特币的能源使用不是一个缺陷，它的设计就是这样的。这是中本聪让比特币抗审查的唯一方法。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你必須以一種無信任的方式投資一種有價值的、稀缺的資源來爲區塊鏈作出貢獻。\n到區塊鏈上，而他認爲沒有其他辦法（我也是如此）。\n\n而且，比特幣網絡使用的能量越多，它的攻擊成本就越高。\n攻擊。考慮到有多少花費，不僅是能源，還有生產，...",
      "title": "考慮一下。比特幣的能源使用不是一個缺陷，它的設計就是這樣的。這是中本聰讓比特幣抗審查的唯一方法。"
    }
  ],
  "title": "Consider: Bitcoin's energy usage is not a flaw, it's like that by design. It's the only way Satoshi could make bitcoin censor resistant.",
  "created_utc": 1621191433,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You have to invest a valuable, scarce resource in a trustless way to contribute to the blockchain, and he saw no other way (and neither do I).</p>\n\n<p>Also, the more energy the bitcoin network uses, the more expensive it is to attack. Consider how much is spent, not only in energy, but production, and carbon emissions to protect value from attacks by adversarial forces. Vaults, military, police, weapons, buildings, laws, lawyers, accountants, auditors, etc. Bitcoin only uses energy (much less of it), which can be procured in a green, more efficient way.</p>\n\n<p>I&#39;m gonna repeat this, to debunk what is becoming common parlance even in this very forum. Bitcoin&#39;s energy usage is not a problem, it&#39;s a feature. Civilization hasn&#39;t advanced through its history by using less energy, but using more. The problem is never energy usage, it&#39;s energy production.</p>\n</div><!-- SC_ON -->",
  "score": 501,
  "permalink": "/r/Bitcoin/comments/ndjn1p/consider_bitcoins_energy_usage_is_not_a_flaw_its/",
  "subreddit": "Bitcoin",
  "id": "ndjn1p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590794222
}