{
  "author": "Sapien001",
  "original_created_utc": 1629552894,
  "title": "How can a single person that lives alone reward themselves without food or masturbation?",
  "created_utc": 1629608058,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am single and lonely, when I am down or want to reward myself after a long week all I can think to do is order food and/ masturbate and it makes me extremely depressed. What else can I do to reward myself/ cheer myself up?</p>\n\n<p>Edit: thank you for all of the responses. I have purchased large painting canvases, paints and a yoga mat. I am also going to plug in my ps2 and start cooking some more elaborate meals for myself. Hopefully this will stop me from being sad :)</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/p8rkca/how_can_a_single_person_that_lives_alone_reward/",
  "subreddit": "NoStupidQuestions",
  "id": "p8rkca",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am single and lonely, when I am down or want to reward myself after a long\nweek all I can think to do is order food and/ masturbate and it makes me\nextremely depressed. What else can I do to reward myself/ cheer myself up?\n\nEdit: thank you for all of the responses. I have purchased large…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は独身で寂しがり屋なので、落ち込んだ時や長い時間をかけて自分にご褒美をあげたい時は\n食べ物を注文したり、自慰行為をしたりすることしか考えられず、非常に落ち込みます。\n非常に落ち込んでしまいます。自分へのご褒美や元気を出すために、他に何ができるでしょうか？\n\n編集部：たくさんのご回答ありがとうございました。私が購入したのは、大...",
      "title": "一人暮らしの独身者が、食事やオナニーをしないで自分にご褒美を与えることができるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个单身且孤独的人，当我情绪低落或想在漫长的一周后奖励自己时\n我所想做的就是订购食物和/或手淫，这让我\n这让我非常郁闷。我还能做什么来奖励自己/让自己高兴起来？\n\n编辑：谢谢你的所有回应。我已经购买了大...",
      "title": "一个独居的人，不吃饭、不手淫，怎么能奖励自己？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個單身且孤獨的人，當我情緒低落或想在漫長的一週後獎勵自己時\n我所想做的就是訂購食物和/或手淫，這讓我\n這讓我非常鬱悶。我還能做什麼來獎勵自己/讓自己高興起來？\n\n編輯：謝謝你的所有迴應。我已經購買了大...",
      "title": "一個獨居的人，不喫飯、不手淫，怎麼能獎勵自己？"
    }
  ]
}