{
  "author": "eymerin",
  "the_new_excerpt": "I have never been one to have strong opinions. I am thirty now and most of my\nlife I have tried to just lay low. But I have been having constantly evolving\nand persistently deep philosophical thoughts about everything I do. It effects\nmost of my every day behavior. I think it's been a very good…",
  "original_created_utc": 1614836933,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我从来都不是一个有强烈意见的人。我现在三十岁了，我的大部分\n生活中，我一直试图只是低调。但我一直有不断演变的\n并对我所做的每一件事都坚持不懈地进行深刻的哲学思考。它影响着\n我每天的大部分行为。我认为这是一个非常好的... ...",
      "title": "你们有谁经历了性格上的重大变化，让你很难与他人相处？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從來都不是一個有強烈意見的人。我現在三十歲了，我的大部分\n生活中，我一直試圖只是低調。但我一直有不斷演變的\n並對我所做的每一件事都堅持不懈地進行深刻的哲學思考。它影響着\n我每天的大部分行爲。我認爲這是一個非常好的... ...",
      "title": "你們有誰經歷了性格上的重大變化，讓你很難與他人相處？"
    }
  ],
  "title": "Have any of you gone through a major change of personality that makes it hard for you to relate to others?",
  "created_utc": 1614878104,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have never been one to have strong opinions. I am thirty now and most of my life I have tried to just lay low. But I have been having constantly evolving and persistently deep philosophical thoughts about everything I do. It effects most of my every day behavior. I think it&#39;s been a very good thing for me but I find myself wanting to engage others in discussions of these ideas I have, but I can see that people are uninterested. I actually feel that I am more aware than I have ever been of my own habits and more understanding of others because of this. I am just having a real hard time expressing and exploring these new tendencies. Pleas let me know if you have had anything like this or have recommendations for me!</p>\n\n<p>Not sure if this is the right place but I have been looking all over.</p>\n\n<p>Edit: wow I didn&#39;t think I would get many replies. If anyone wants to have more discussions I would love to. Maybe even a group would be cool. Message me if you are interested. This thread has been very stimulating already and I think you all have something to offer!</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TrueAskReddit/comments/lxdtzr/have_any_of_you_gone_through_a_major_change_of/",
  "subreddit": "TrueAskReddit",
  "id": "lxdtzr",
  "is_self": true,
  "media": null,
  "is_video": false
}