{
  "author": "SweetN_Low",
  "the_new_excerpt": "I am 19 (F) and my younger sister is 16 and her boyfriend is 24. She hasn’t told\nmy mom or dad, and none of her friends or his friends know about it. They do\neverything bf and gf do and they’ve had sex. She told me and I voiced my\nconcerns about it because obviously I don’t approve. And I don’t know…",
  "original_created_utc": 1623684365,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は19歳（F）で、妹は16歳、彼氏は24歳です。妹は母や父には言っていません。\nなく、妹の友達も彼氏の友達も誰も知らないそうです。彼らは\n彼氏と彼女がすることはすべてやっていて、セックスもしています。彼女が私に話してくれたので、私は私の懸念を表明しました。\n明らかに私は認めていないので、心配しています。そして、私は知らない...",
      "title": "16歳が24歳とデート？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我19岁（女），我妹妹16岁，她的男朋友24岁。她还没有告诉\n她没有告诉我妈妈和爸爸，她的朋友和他的朋友都不知道这件事。他们做\n他们做了男朋友和女朋友做的所有事情，而且他们已经发生了关系。她告诉了我，我表达了我的\n因为显然我不同意。我也不知道...",
      "title": "16岁的孩子与24岁的人约会？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我19歲（女），我妹妹16歲，她的男朋友24歲。她還沒有告訴\n她沒有告訴我媽媽和爸爸，她的朋友和他的朋友都不知道這件事。他們做\n他們做了男朋友和女朋友做的所有事情，而且他們已經發生了關係。她告訴了我，我表達了我的\n因爲顯然我不同意。我也不知道...",
      "title": "16歲的孩子與24歲的人約會？"
    }
  ],
  "title": "16 year old dating a 24 year old?",
  "created_utc": 1623726012,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am 19 (F) and my younger sister is 16 and her boyfriend is 24. She hasn’t told my mom or dad, and none of her friends or his friends know about it. They do everything bf and gf do and they’ve had sex. She told me and I voiced my concerns about it because obviously I don’t approve. And I don’t know her boyfriend but I see him as a predator, because at 24 there should be no reason you would want to date someone who’s 16. She is very stubborn and if I or anyone in my family tried to put a stop to this she wouldn’t listen at all (as most 16 year old girls would). So I feel like there’s nothing I can do. I told her if he oversteps in any direction or makes her feel trapped or uncomfortable I am going to put him in a coma. I feel like my only option is to let her know I’m a safe space if she needs me. Since there’s no way to convince her this isn’t okay. Is there anything else I can do? I want her to know she has at least one person she can go to if he does anything since she won’t tell anyone else. But I really don’t approve of this relationship.</p>\n\n<p>Also they work together so even if someone was able to make them break up it would be very easy for them to sneak around because they’re around each other a lot.</p>\n</div><!-- SC_ON -->",
  "score": 121,
  "permalink": "/r/TooAfraidToAsk/comments/nzpbxc/16_year_old_dating_a_24_year_old/",
  "subreddit": "TooAfraidToAsk",
  "id": "nzpbxc",
  "is_self": true,
  "media": null,
  "is_video": false
}