{
  "author": "AskScienceModerator",
  "original_created_utc": 1633690832,
  "title": "AskScience AMA Series: I'm a psychologist/neuroscientist studying and teaching about social media and adolescent brain development. AMA!",
  "created_utc": 1633696596,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A whistleblower recently exposed that Facebook knew their products could harm teens&#39; mental health, but academic researchers have been studying social media&#39;s effects on adolescents for years. I am a Teaching Assistant Professor in Psychology and Neuroscience at UNC-Chapel Hill, where I teach an undergrad course on &quot;Social media, technology, and the adolescent brain&quot;. I am also the outreach coordinator for the <a href=\"https://www.wifi-initiative.org/\">WiFi Initiative in Technology and Adolescent Brain Development</a>, with a mission to study adolescents&#39; technology use and its effects on their brain development, social relationships, and health-risk behaviors. I engage in scientific outreach on this important topic through our <a href=\"https://teensandtech.org/\">Teens &amp; Tech</a> website - and now here on <a href=\"/r/AskScience\">r/AskScience</a>! I&#39;ll see you all at 2 PM (ET, 18 UT), AMA!</p>\n\n<p>Username: <a href=\"/u/rosaliphd\">/u/rosaliphd</a></p>\n</div><!-- SC_ON -->",
  "score": 132,
  "permalink": "/r/askscience/comments/q3vf3x/askscience_ama_series_im_a/",
  "subreddit": "askscience",
  "id": "q3vf3x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A whistleblower recently exposed that Facebook knew their products could harm\nteens' mental health, but academic researchers have been studying social media's\neffects on adolescents for years. I am a Teaching Assistant Professor in\nPsychology and Neuroscience at UNC-Chapel Hill, where I teach an…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、内部告発者が、フェイスブックが自社の製品が有害であることを知っていたことを暴露しました。\nしかし、学術研究者たちは、ソーシャルメディアが青少年に与える影響を何年も前から研究しています。\nしかし、学術研究者は何年も前からソーシャルメディアが青少年に与える影響を研究しています。私は国連大学チャペル校で心理学と神経科学の助教授をしています。\n私はUNC-Chapel Hillの心理学と神経科学の助教授として、ソーシャル・メディアの影響について教えています。",
      "title": "AskScience AMAシリーズ。ソーシャルメディアと思春期の脳の発達について研究・指導している心理学者・脳科学者です。AMA!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一位举报人最近揭露，Facebook知道他们的产品可能损害\n青少年的心理健康，但学术研究人员多年来一直在研究社交媒体对青少年的影响。\n对青少年的影响已有多年。我是联合国大学芝加哥分校心理学和神经科学的教学助理教授。\n我是联合国大学教堂山分校心理学和神经科学专业的助教，在那里我教的是 \"社交\"。",
      "title": "AskScience AMA系列。我是一名心理学家/神经科学家，研究并教授社交媒体和青少年大脑发育。AMA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一位舉報人最近揭露，Facebook知道他們的產品可能損害\n青少年的心理健康，但學術研究人員多年來一直在研究社交媒體對青少年的影響。\n對青少年的影響已有多年。我是聯合國大學芝加哥分校心理學和神經科學的教學助理教授。\n我是聯合國大學教堂山分校心理學和神經科學專業的助教，在那裏我教的是 \"社交\"。",
      "title": "AskScience AMA系列。我是一名心理學家/神經科學家，研究並教授社交媒體和青少年大腦發育。AMA!"
    }
  ]
}