{
  "author": "shalyar",
  "original_created_utc": 1630959105,
  "title": "Today I reached my goal - Sold all my Coins",
  "created_utc": 1630964146,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is the culmination of a long journey that began in 2017, Today I sold all my Crypto coins and let only the MOONs (For the sake of this great community)</p>\n\n<p>I live in a developing country in the Middle East, and my life has gone through a lot of ups and downs. I couldn&#39;t get rid of my coins (1 BTC bought at 4k), but I had my own goals, and I can say I met them twice this year: in May, I sold my BTC for 62k and bought it back at 32k, and in June, I halved it with ETH @ 1.6k, and today I sold all of them with almost 100% profit.</p>\n\n<p>I&#39;ll be eternally grateful to crypto for allowing me to accomplish two seemingly impossible tasks in my life</p>\n\n<p>It saved one of my family members&#39; lives in 2018 (80% of the surgery costs came from crypto profits)</p>\n\n<p>Second, I finally finished building my house a month ago, and about half of the costs were covered by Crypto once again.</p>\n\n<p>I have a nice paying job (in comparison to the folks around me), and I work as a freelance software engineer.</p>\n\n<p>My next plan for the crypto world is to invest all of my freelancing earnings in crypto with a proper DCA strategy.</p>\n\n<p>I wish you all the best in achieving your goals and believing in this wonderful technology, which has the potential to change our lives</p>\n</div><!-- SC_ON -->",
  "score": 200,
  "permalink": "/r/CryptoCurrency/comments/pj7fqw/today_i_reached_my_goal_sold_all_my_coins/",
  "subreddit": "CryptoCurrency",
  "id": "pj7fqw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is the culmination of a long journey that began in 2017, Today I sold all\nmy Crypto coins and let only the MOONs (For the sake of this great community)\n\nI live in a developing country in the Middle East, and my life has gone through\na lot of ups and downs. I couldn't get rid of my coins (1 BTC…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、2017年に始まった長い旅の集大成であり、今日、私はすべてのCrypto coinsを売却し、MOONs（For.\n私のCrypto coinsをすべて売却し、MOONだけにしました（この素晴らしいコミュニティのために\n\n私は中東の発展途上国に住んでいますが、私の人生は経\n私は中東の発展途上国に住んでおり、私の人生は多くの浮き沈みを経験してきました。私は自分のコインを処分することができませんでした（1BTC...",
      "title": "今日、私は目標を達成し、すべてのコインを売却しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是2017年开始的漫长旅程的高潮。\n我的加密货币，只留下了月亮（为了这个伟大的社区）。\n\n我住在中东的一个发展中国家，我的生活经历了\n很多起伏。我无法摆脱我的硬币（1 BTC...",
      "title": "今天我达到了我的目标--卖掉了我所有的硬币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是2017年開始的漫長旅程的高潮。\n我的加密貨幣，只留下了月亮（爲了這個偉大的社區）。\n\n我住在中東的一個發展中國家，我的生活經歷了\n很多起伏。我無法擺脫我的硬幣（1 BTC...",
      "title": "今天我達到了我的目標--賣掉了我所有的硬幣"
    }
  ]
}