{
  "author": "SoonMoonn",
  "original_created_utc": 1635893516,
  "title": "I opened my Vault. AMA.",
  "created_utc": 1635925013,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ok. I’ll be honest. I was always going to open my vault, but because I only use my laptop for Reddit, and that I’m a huge procrastinator I didn’t open my vault, but now I did. In the last day, but I did. Typical me. </p>\n\n<p>Thanks to everyone, who flooded my inbox and  asked me open my Vault. I love you guys! This is the community I like to be a part of.</p>\n\n<p>Excited for my first moons! I’ve been a long lurker here and thought about investing in them, but realized it’s better to earn them instead of buying them (I still bought some). In my opinion, they have huge potential!</p>\n</div><!-- SC_ON -->",
  "score": 174,
  "permalink": "/r/CryptoCurrency/comments/qlghgv/i_opened_my_vault_ama/",
  "subreddit": "CryptoCurrency",
  "id": "qlghgv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Ok. I’ll be honest. I was always going to open my vault, but because I only use\nmy laptop for Reddit, and that I’m a huge procrastinator I didn’t open my vault,\nbut now I did. In the last day, but I did. Typical me.\n\nThanks to everyone, who flooded my inbox and asked me open my Vault. I love…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "よし、正直に言おう。私はいつも金庫を開けようとしていましたが、私のノートパソコンはRedditにしか使わないし\nノートパソコンはRedditでしか使わないし、すごく先延ばしにするタイプなので、金庫を開けていませんでした。\nでも今は開けました。最後の日に、でもやった。典型的な私です。\n\n私の受信箱に殺到して、私の金庫を開けるように頼んでくれた皆さんに感謝します。私は大好きです...",
      "title": "ヴォールトを開けてみました。AMAです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，我说实话。我一直打算打开我的保险库，但因为我只用我的笔记本电脑访问Reddit，而且我是一个巨大的拖延者，所以我没有打开我的保险库。\n我的笔记本电脑用于Reddit，而且我是一个巨大的拖延者，所以我没有打开我的保险库。\n但现在我打开了。在最后一天，但我打开了。典型的我。\n\n感谢每个人，他们涌入我的收件箱，要求我打开我的金库。我爱...",
      "title": "我打开了我的Vault。AMA。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，我說實話。我一直打算打開我的保險庫，但因爲我只用我的筆記本電腦訪問Reddit，而且我是一個巨大的拖延者，所以我沒有打開我的保險庫。\n我的筆記本電腦用於Reddit，而且我是一個巨大的拖延者，所以我沒有打開我的保險庫。\n但現在我打開了。在最後一天，但我打開了。典型的我。\n\n感謝每個人，他們湧入我的收件箱，要求我打開我的金庫。我愛...",
      "title": "我打開了我的Vault。AMA。"
    }
  ]
}