{
  "author": "Ciabattabingo",
  "the_new_excerpt": "Everything about 18th dynasty Egypt is fascinating and there's quite a lot of\ninformation to be obtained with a quick Google search but most of what I've\nfound on The Amarna Period focuses on Akhenaten and his new capital, Aketaten.\nBut what happened to Thebes during this mass...exodus? It's…",
  "original_created_utc": 1611337585,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "关于18朝埃及的一切都很迷人，而且有相当多的。\n信息可以通过快速的谷歌搜索获得，但大部分我已经\n在《阿玛尔纳时代》上发现的，重点是阿肯那顿和他的新首都阿克塔顿。\n但在这次大规模的... 流亡中，底比斯发生了什么？这是...",
      "title": "底比斯是世界上人口最多的城市，当法老阿肯塔腾选择把首都迁到300多英里外的阿克塔腾（阿玛尔纳）。在阿玛尔纳时期，底比斯发生了什么，它是否被完全废弃了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關於18朝埃及的一切都很迷人，而且有相當多的。\n信息可以通過快速的谷歌搜索獲得，但大部分我已經\n在《阿瑪爾納時代》上發現的，重點是阿肯那頓和他的新首都阿克塔頓。\n但在這次大規模的... 流亡中，底比斯發生了什麼？這是...",
      "title": "底比斯是世界上人口最多的城市，當法老阿肯塔騰選擇把首都遷到300多英里外的阿克塔騰（阿瑪爾納）。在阿瑪爾納時期，底比斯發生了什麼，它是否被完全廢棄了？"
    }
  ],
  "title": "Thebes was the most populous city in the world when Pharaoh Akhentaten chose to relocate the capital to Akhetaten (Amarna), over 300mi away. What happened to Thebes during the Amarna Period; was it completely abandoned?",
  "created_utc": 1611374670,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Everything about 18th dynasty Egypt is fascinating and there&#39;s quite a lot of information to be obtained with a quick Google search but most of what I&#39;ve found on <strong>The Amarna Period</strong> focuses on Akhenaten and his new capital, Aketaten. But what happened to <em>Thebes</em> during this mass...exodus? It&#39;s estimated that 80,000 people lived in the city at the time. Surely, not everyone could have made the journey south, right? Was Thebes still functioning as city, and if so, who was present representative of Akhenaten&#39;s rule?</p>\n</div><!-- SC_ON -->",
  "score": 593,
  "permalink": "/r/AskHistorians/comments/l2suwv/thebes_was_the_most_populous_city_in_the_world/",
  "subreddit": "AskHistorians",
  "id": "l2suwv",
  "is_self": true,
  "media": null,
  "is_video": false
}