{
  "author": "Timely_Jury",
  "original_created_utc": 1639818113,
  "title": "It is widely known here that the mediaeval aversion to bathing is a myth. But what was mediaeval bathhouse culture like? How common were baths? How affordable were they? Were they merely places to wash, or were they also places for socialising (like the Roman baths of olden days)?",
  "created_utc": 1639838433,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;How similar (or how different) were medieval European bathhouses to their Roman counterparts? I am aware that the Middle Ages were long, and spanned a vast area, which makes it difficult to generalise things. But I&amp;#39;m just looking for an overview.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/rj3jy4/it_is_widely_known_here_that_the_mediaeval/",
  "subreddit": "AskHistorians",
  "id": "rj3jy4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "How similar (or how different) were medieval European bathhouses to their Roman\ncounterparts? I am aware that the Middle Ages were long, and spanned a vast\narea, which makes it difficult to generalise things. But I'm just looking for an\noverview.",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "中世ヨーロッパの浴場は、ローマ時代の浴場とどのように似ているか（あるいは異なっているか）。\nということです。中世は長く、広大な地域にまたがっていたことは承知しています。\n一般化するのは難しいですね。ただ、私が求めているのは\nの概要を説明します。",
      "title": "中世の入浴嫌いが神話であることは、ここでは広く知られている。しかし、中世の浴場文化はどのようなものだったのだろうか。入浴はどの程度一般的だったのだろうか。どの程度の価格で利用できたのか。単に体を洗うだけの場所だったのか、それとも（かつてのローマの浴場のように）社交の場でもあったのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "中世纪的欧洲澡堂与罗马的澡堂有多大的相似性（或不同）？\n有多大区别？我知道中世纪的时间很长，而且跨度很大。\n地区，这使得我们很难将事情概括化。但我只是想了解一下\n概述。",
      "title": "在这里，人们普遍知道，中世纪对洗澡的厌恶是一个神话。但中世纪的澡堂文化是什么样的？洗澡有多普遍？它们的价格如何？它们仅仅是清洗的地方，还是也是社交的地方（就像古时的罗马浴场）？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "中世紀的歐洲澡堂與羅馬的澡堂有多大的相似性（或不同）？\n有多大區別？我知道中世紀的時間很長，而且跨度很大。\n地區，這使得我們很難將事情概括化。但我只是想了解一下\n概述。",
      "title": "在這裏，人們普遍知道，中世紀對洗澡的厭惡是一個神話。但中世紀的澡堂文化是什麼樣的？洗澡有多普遍？它們的價格如何？它們僅僅是清洗的地方，還是也是社交的地方（就像古時的羅馬浴場）？"
    }
  ]
}