{
  "author": "rawrtherapybackup",
  "the_new_excerpt": "Seems odd that all of us poor people on reddit are saying that Hedge Funds are\nbad and they rarely beat the SPY anyway\n\nbut if that was trully the case, why would the rich entrust their millions to\nHedge Funds and other similar institutions?\n\nseems like a lot of people downplay the fact that you…",
  "original_created_utc": 1623688971,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "redditの貧乏人たちが、ヘッジファンドは悪いものだと言っているのは奇妙に思える。\nヘッジファンドは悪いもので、SPYに勝つことはほとんどないと\n\nしかし、もしそれが本当なら、なぜ金持ちはヘッジファンドやその他の類似した機関に数百万を託すのだろう？\nしかし、もしそれが本当にそうなら、なぜ金持ちは自分の数百万をヘッジファンドやその他の類似した機関に預けるのでしょうか？\n\n多くの人が、自分がヘッジファンドを利用しているという事実を軽視しているように思えます。",
      "title": "もしヘッジファンドが本当に悪い仕事をするのであれば、なぜお金を持っている人は彼らにお金を託すのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "似乎很奇怪，我们这些在reddit上的穷人都说对冲基金是\n糟糕，而且他们很少能战胜SPY指数\n\n但如果真的是这样的话，为什么富人会把他们的数百万美元委托给\n对冲基金和其他类似机构？\n\n似乎很多人都淡化了这样一个事实，即你...",
      "title": "如果对冲基金真的做得如此糟糕，为什么有钱的人还把钱交给他们？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "似乎很奇怪，我們這些在reddit上的窮人都說對沖基金是\n糟糕，而且他們很少能戰勝SPY指數\n\n但如果真的是這樣的話，爲什麼富人會把他們的數百萬美元委託給\n對沖基金和其他類似機構？\n\n似乎很多人都淡化了這樣一個事實，即你...",
      "title": "如果對沖基金真的做得如此糟糕，爲什麼有錢的人還把錢交給他們？"
    }
  ],
  "title": "If Hedge Funds really do such a bad job, why do people with money trust them with their money?",
  "created_utc": 1623695613,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Seems odd that all of us poor people on reddit are saying that Hedge Funds are bad and they rarely beat the SPY anyway</p>\n\n<p>but if that was trully the case, why would the rich entrust their millions to Hedge Funds and other similar institutions?</p>\n\n<p>seems like a lot of people downplay the fact that you give a fund money, they take a cut and they make you money BUT if this is how the &quot;rich&quot; handle their investments why shouldnt the poor people do it also?</p>\n\n<p>seems like more &quot;poor&quot; people lose money trying to make money than actually make money</p>\n\n<p>Edit: <strong><a href=\"/u/Ronaldoooope\">u/Ronaldoooope</a> makes a great point</strong></p>\n\n<p><em>I know we focus on percentages but 1% of 100 million is quite the gain compared to 1% of 1000</em></p>\n\n<p>I&#39;m assuming the &quot;rich&quot; are a lot more okay with <em>only</em> making 5% a year when that 5% is coming from a portfolio of $10 Million</p>\n\n<p>for the lazy, its $500,000 a year or one VERY expensive Lambo</p>\n</div><!-- SC_ON -->",
  "score": 1838,
  "permalink": "/r/investing/comments/nzr17w/if_hedge_funds_really_do_such_a_bad_job_why_do/",
  "subreddit": "investing",
  "id": "nzr17w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009742346
}