{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Thursday, April 15, 2021\n\nStocks jumped on Thursday, with all three major indexes reaching fresh intraday\nrecords as market participants digested a much better-than-expected unemployment\nreport and a sharp increase in consumer spending. The S&P 500 is up roughly 5%\nin the month…",
  "original_created_utc": 1618518707,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "PsychoMarket Recap - 2021年4月15日（木\n\n市場参加者は、失業率が予想を大幅に上回ったことを受けて、株価は上昇し、主要3指数は日中の新記録を達成した。\n市場参加者は、予想を大幅に上回る失業率の上昇と、日本の経済状況を反映した\nこれは、市場参加者が、失業率が予想を大幅に上回り、個人消費が急増したことを受けたものです。S&P500種指数は約5%上昇。\nS&P 500は約5%の上昇となりました。",
      "title": "本日2021年4月15日（木）のMarket Recapをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾--2021年4月15日，星期四。\n\n周四股市跳水，三大指数盘中均创下新高。\n纪录，因为市场参与者消化了比预期好得多的失业率。\n报告和消费者支出大幅增加。标准普尔500指数上涨约5%。\n在这个月...",
      "title": "以下是今天2021年4月15日星期四的市场回顾。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧--2021年4月15日，星期四。\n\n週四股市跳水，三大指數盤中均創下新高。\n紀錄，因爲市場參與者消化了比預期好得多的失業率。\n報告和消費者支出大幅增加。標準普爾500指數上漲約5%。\n在這個月...",
      "title": "以下是今天2021年4月15日星期四的市場回顧。"
    }
  ],
  "title": "Here is a Market Recap for today Thursday, April 15, 2021",
  "created_utc": 1618530952,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Thursday, April 15, 2021</strong></p>\n\n<p>Stocks jumped on Thursday, with all three major indexes reaching fresh intraday records as market participants digested a much better-than-expected unemployment report and a sharp increase in consumer spending. The S&amp;P 500 is up roughly 5% in the month of April, led primarily by mega-cap technology and financial stocks. </p>\n\n<p>Today, the economic data released was very promising. According to a report by the US Department of Commerce, retail sales boomed 9.8% higher in the month of March as the economy continues to gradually reopen as more vaccines are distributed. Moreover, the Weekly Unemployment report showed first-time unemployment claims plunged far below analyst estimates. The Labor Department reported 576,000 new jobless claims for the week ending April 10. This represents the lowest total first-time unemployment claims filed since August 2020 and a sharp decline from both the previous week’s total of 769,000 and analyst expectations of 710,000. </p>\n\n<p>This is great news on two fronts. First, consumer spending represents 70% of US GDP (<a href=\"https://www.thebalance.com/components-of-gdp-explanation-formula-and-chart-3306015#:%7E:text=Consumer%20spending%20comprises%2070%25%20of,components%20of%20the%20U.S.%20economy.\">more info here</a>) and is a key driver of economic growth. GDP is now expected to increase 6.5% in 2021 according to the Federal Open Market Committee, the central bank&#39;s monetary policy-making group. That is sharply higher than the 4.2% forecast made in December of 2020. Second, Jerome Powell and other FOMC members have reiterated that recovery in the labor market “remains uneven and far from complete”. To see a report blow so far past analyst expectation is a great sign the labor market is recovering in tandem with the surge in consumer spending. </p>\n\n<p>Michael Pearce, senior US economist for Capital Economics said of the consumer report, “What caught our eye was the 13.4% surge in spending on food and drink services, while clothing store sales were up by 18.1%. Relative to pre-pandemic levels, food and drink services sales are down just 5.1%, while clothing store sales are now higher than they were in February 2020. That suggests a combination of loosening restrictions and easing of virus fears linked to the vaccine rollout are driving a rapid return to normalcy.” </p>\n\n<p>Distribution of the Johnson and Johnson (JNJ) coronavirus vaccine remains paused in the US following reports of rare blood clots in people who received the vaccine. The agencies are reviewing data over six reported U.S. cases of a severe blood clot in individuals after receiving the vaccine, and have recommended the pause &quot;out of an abundance of caution,&quot; the FDA said in a Twitter post. To date, roughly 6.8 million doses of the single-dose JNJ vaccine have been administered. </p>\n\n<p>In a statement, JNJ said it has been “working closely with medical experts and health authorities, and we strongly support the open communication of this information to healthcare professionals and the public” and added “In addition, we have been reviewing these cases with European health authorities. We have made the decision to proactively delay the rollout of our vaccine in Europe.” During a press briefing, Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said the J&amp;J vaccine review would likely take “days to weeks, rather than weeks to months”, in order to resolve.” Despite the setback with JNJ, distribution of the vaccine remains strong in the US, with the CDC reporting more than 3 million doses being distributed per day.</p>\n\n<p><strong>Highlights</strong> </p>\n\n<ul>\n<li>Coinbase (COIN) blockbuster direct listing with a valuation of more than $100 billion has so far disappointed, with the stock trading well below its debut price of $381. Still, this is an extremely important moment in both the market and cryptocurrency community, so we will keep you posted. </li>\n<li>Cathie Wood at ARK Investments bought 750,000 shares of Coinbase (COIN) for her ARKF, ARKGW and ARKK funds. All three of those funds were among the best performing ETFs in 2020</li>\n<li>Large-cap tech stocks advanced once again while small-caps and more speculative stocks fell again, continuing a terrible run of performance in 2021. </li>\n<li>Earnings season continued with banks posting extremely strong results. However, big banks were unable to carry their momentum from yesterday, with many trading modestly lower.</li>\n<li>Three of Shopify’s (SHOP) top seven executives will be leaving in the coming months, the Canadian e-commerce company’s chief executive said Wednesday. In a blog post, CEO Tobi Lutke said Chief Talent Officer Brittany Forsyth, Chief Legal Officer Joe Frasca and Chief Technology Officer Jean-Michel Lemieux “will start to transition out of their current roles.”</li>\n<li>Ford Motor (F) outlined another series of plant shutdowns due to the global semiconductor chip shortage, with five facilities in the United States and one in Turkey affected.</li>\n<li><strong>**Please note Current stock price was written premarket and does not reflect intraday changes*\\</strong>*</li>\n<li>First Majestic Silver (AG) target raised by HC Wainwright from $19.50 to $20 at Buy. Stock currently around $16</li>\n<li>Align Technology (ALGN) target raised by SVB Leerink from $680 to $690 at Outperform. Stock currently around $594</li>\n<li>Ally Financial (ALLY) target raised by Deutsche Bank from $48 to $54 at Overweight. Stock currently around $48</li>\n<li>Citigroup (C) target raised by Jefferies Financial from $75 to $85 at Buy. Stock currently around $73</li>\n<li>Dell Technologies (DELL) with three target raises. Stock currently around $93\n\n<ul>\n<li>Evercore ISI from $105 to $110 at Outperform</li>\n<li>Credit Suisse from $80 to $95 at Neutral</li>\n<li>Raymond James from $92 to $113 at Outperform</li>\n</ul></li>\n<li>Facebook (FB) target raised by Cowen from $350 to $360 at Outperform. Stock currently around $302</li>\n<li>Alphabet (GOOG, $GOOGL) with two target raises. Stock currently around $2242\n\n<ul>\n<li>Cowen from $2400 to $2600 at Outperform</li>\n<li>Argus from $2400 to $2500 at Buy</li>\n</ul></li>\n<li>Goldman Sachs (GS) with a host of target raises. Consensus price target $410 at Overweight. Stock currently around $335</li>\n<li>JP Morgan (JPM) with three target raises. Stock currently around $151\n\n<ul>\n<li>Royal Bank of Canada from $150 to $160</li>\n<li>Piper Sandler from $170 to $182</li>\n<li>Jefferies from $157 to $177</li>\n</ul></li>\n<li>Snapchat (SNAP) target raised by Cowen from $86 to $88 at Outperform. Stock currently around $62</li>\n<li>State Street (STT) target raised by Deutsche Bank from $97 to $100 at Buy. Stock currently around $87</li>\n<li>UPS target raised by Raymond James from $195 to $200 at Outperform. Stock currently around $176</li>\n<li>Wells Fargo (WFC) with a host of target raises. Consensus price target $49 at Outperform. Stock currently around $42 </li>\n<li>XPO Logistics (XPO) with two target raises. Stock currently around $134\n\n<ul>\n<li>Raymond James from $140 to $145 at Outperform</li>\n<li>Truist Securities from $140 to $150 at Buy</li>\n</ul></li>\n</ul>\n\n<p>&quot;The most important thing to do if you find yourself in a hole is to stop digging.&quot; - Warren Buffet</p>\n</div><!-- SC_ON -->",
  "score": 128,
  "permalink": "/r/stocks/comments/mrnfq3/here_is_a_market_recap_for_today_thursday_april/",
  "subreddit": "stocks",
  "id": "mrnfq3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171526124
}