{
  "author": "SuaveLomo",
  "original_created_utc": 1634166323,
  "title": "My dad (68) has more noticeable profits than me and I'm the one who advised him",
  "created_utc": 1634185871,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My dad has been DCAing strictly into BTC and ETH since May after my brother and I convinced him to invest in crypto. (Of course we explained about the risks and how blockchain works) </p>\n\n<p>He has definitely more noticeable profits than me who has been experimenting, trying to day trade and buying all sort of alts. Of course I&#39;ve learned a lot more and I have a much more interesting portfolio with stakings and stuff, but here&#39;s my point: If you&#39;re going to talk your loved ones into investing you should give them the most conservative advice. </p>\n\n<p>Also he is the one who chose the big guys (BTC, ETH), he knows about ADA, Algo, Doge, Dot, BNB, LTC, etc...\nI guess from his age and experience he knows how shit works.</p>\n\n<p>And if you think you shouldn&#39;t talk your family into crypto, my dad is happy af with profits he would&#39;ve never had from his shitty bank savings account APY.</p>\n\n<p>TLDR; gave my dad conservative investing advice that I didnt follow myself and his portfolio is greener than mine.</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/q7mykz/my_dad_68_has_more_noticeable_profits_than_me_and/",
  "subreddit": "CryptoCurrency",
  "id": "q7mykz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My dad has been DCAing strictly into BTC and ETH since May after my brother and\nI convinced him to invest in crypto. (Of course we explained about the risks and\nhow blockchain works)\n\nHe has definitely more noticeable profits than me who has been experimenting,\ntrying to day trade and buying all…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の父は、5月に兄と私に説得されてから、BTCとETHに厳しくDCAを回しています。\n説得した後、5月からBTCとETHに厳密にDCAしています。(もちろん、リスクやブロックチェーンの仕組みについては説明しました。\nブロックチェーンがどのように機能するかを説明しました）。)\n\n試行錯誤していた私よりも、彼の方が確実に目立った利益を上げています。\nデイトレードをしてみたり、全部買ってみたり...。",
      "title": "父（68歳）の方が利益が顕著に出ていて、私がアドバイスしています"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自5月以来，在我和哥哥的劝说下，我父亲一直在严格地对BTC和ETH进行DCA投资。\n我说服了他投资加密货币。(当然，我们解释了风险和\n区块链是如何运作的)\n\n他的利润绝对比我这个一直在试验的人要明显得多。\n我一直在尝试日间交易和购买所有的...",
      "title": "我的父亲（68岁）比我有更明显的利润，而我是建议他的人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自5月以來，在我和哥哥的勸說下，我父親一直在嚴格地對BTC和ETH進行DCA投資。\n我說服了他投資加密貨幣。(當然，我們解釋了風險和\n區塊鏈是如何運作的)\n\n他的利潤絕對比我這個一直在試驗的人要明顯得多。\n我一直在嘗試日間交易和購買所有的...",
      "title": "我的父親（68歲）比我有更明顯的利潤，而我是建議他的人"
    }
  ]
}