{
  "author": "rulesforrebels",
  "the_new_excerpt": "For those of you who celebrate Easter just wanted to wish everyone a Happy\nEaster and encourage people to put their phones away for a day and enjoy some\ntime with friends and family.\n\nIt's funny crypto is fun and amazing but it can also overtake our attention.\nWhen the markets are good its fun, when…",
  "original_created_utc": 1617547111,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "对于那些你谁庆祝复活节只是想祝大家快乐\n复活节，鼓励人们把手机收起来，享受一天的时间。\n与朋友和家人的时间。\n\n有趣的是，加密技术很有趣，也很神奇，但它也可以超越我们的注意力。\n当市场好的时候它很有趣，当... ...",
      "title": "复活节快乐，考虑把你的手机放在一边，享受今天与家人的时间。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於那些你誰慶祝復活節只是想祝大家快樂\n復活節，鼓勵人們把手機收起來，享受一天的時間。\n與朋友和家人的時間。\n\n有趣的是，加密技術很有趣，也很神奇，但它也可以超越我們的注意力。\n當市場好的時候它很有趣，當... ...",
      "title": "復活節快樂，考慮把你的手機放在一邊，享受今天與家人的時間。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "イースターを祝う人たちには、みんなでハッピーイースターをお祝いしたいと思います。\nまた、携帯電話を一日置いて、友人や家族との時間を楽しむことをお勧めします。\n友人や家族と一緒に過ごすことをお勧めします。\n\n面白いことに、暗号は楽しくて素晴らしいものですが、私たちの関心を奪うこともあります。\n市場が好調なときは楽しいですが、...",
      "title": "ハッピー・イースター・ガイ、今日は携帯電話を片付けて家族との時間を楽しもう"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "イースターを祝う人たちには、みんなでハッピーイースターをお祝いしたいと思います。\nまた、携帯電話を一日置いて、友人や家族との時間を楽しむことをお勧めします。\n友人や家族と一緒に過ごすことをお勧めします。\n\n面白いことに、暗号は楽しくて素晴らしいものですが、私たちの関心を奪うこともあります。\n市場が好調なときは楽しいですが、...",
      "title": "ハッピー・イースター・ガイ、今日は携帯電話を片付けて家族との時間を楽しもう"
    }
  ],
  "title": "Happy Easter Guys, Consider Putting Your Phones Away and Enjoying Time with Family Today",
  "created_utc": 1617572414,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For those of you who celebrate Easter just wanted to wish everyone a Happy Easter and encourage people to put their phones away for a day and enjoy some time with friends and family.</p>\n\n<p>It&#39;s funny crypto is fun and amazing but it can also overtake our attention. When the markets are good its fun, when the markets are down it&#39;s less fun but alike in both markets many of us are glued to our phones in an unhealthy way. I remember following the 2017 Bull Run I held everything through and didn&#39;t sell off. It was depressing seeing how much money I was down at the time. </p>\n\n<p>I recall at the time deciding to take a week off as I was heading down to Mexico with my gf, my parents and my nephew. I decided to not check prices and to tune out for a week. That week actually led to tuning out for about a year as why look at a market thats flat or trading sideways. </p>\n\n<p>Over the past year or two things have heated back up and I&#39;ve gotten more engaged, sometimes to the point I&#39;m checking my portfolio several times an hour. If you&#39;re actively trading I get it but if you&#39;re holding, your crypto isn&#39;t going to go anywhere it will be fine left unattended for a few hours and you not checking isn&#39;t going to tank the price. </p>\n\n<p>I&#39;m guilty of this myself, especially with recently getting into Cub Finance I&#39;m checking how much cub is in the den like twice an hour and probably cashing it out more often than makes sense from a financial standpoint since it does cost BNB to perform that action. </p>\n\n<p>I guess this is a mental health message more than anything else, spend some time with friends and family today undistracted by checking Delta or CoinMarketCap and even as we get into spring and summer be sure to get out and go for a bike ride, sit at the beach, go sit in a park or take a walk in the woods and get your face out of your phone for a few hours.</p>\n</div><!-- SC_ON -->",
  "score": 231,
  "permalink": "/r/CryptoCurrency/comments/mjxfih/happy_easter_guys_consider_putting_your_phones/",
  "subreddit": "CryptoCurrency",
  "id": "mjxfih",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961875629
}