{
  "author": "Diomides_arsen",
  "original_created_utc": 1637328060,
  "title": "Why this bubble is not going to end well : 15000+ useless coins and tokens owned 100% by their founders during their launch, completely centralized, mostly depending on a couple of networks actually drown the few real crypto in a sea of scams.",
  "created_utc": 1637350407,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First of all I wish to declare one thing : <strong>I love the original cryptocurrency idea</strong> and I think that it is really the most revolutionary discovery of the last many years, after the internet.</p>\n\n<p>It is superb :  <strong>Decentralized transaction networks</strong> with <strong>fixed rules</strong>, where <strong>everyone</strong> can take part (<strong>mining procedure</strong>) &amp; where <strong>no central authority</strong> takes any decisions.</p>\n\n<p>With immutable certain parameters like maximum supply. No need for third &quot;trusted&quot; parties like Banks that set crazy fees, close accounts, ask for requirements, print arbitrarily fiat money etc</p>\n\n<p>All the above could potentially lead to a strong hit to the rotted economic system and achieve a wide re-distribution of  wealth as people who own just a basic computational power could enjoy freedom and on the same time build wealth, hedging even against inflation.</p>\n\n<p>But how many cryptocurrencies today <strong>really serve and honor this original crypto idea anymore</strong>? </p>\n\n<p>How can we consider real &amp; Decentralized &quot;crypto&quot; a Project where <strong>the founders decided to allocate 100% of the supply into their addresses</strong> and sell it to people with heavy marketing and Initial Coin Offerings ? Then jumping to the next project advertising a future &quot;use case&quot; in order convince even more idiots to buy the next 100% pre-mined/pre-owned by founders &quot;asset&quot;. and so on...? Making money out of thin air...fantastic concept isn&#39;t it ?</p>\n\n<p>How can we consider as true Decentralized &quot;crypto&quot;, Projects that act as <strong>shit-token factories</strong>, targeting to <strong>gather more useless assets on one chain</strong>, making them <strong>dependent</strong> on the same network with <strong>crazy fees</strong> ? </p>\n\n<p>Even worse, how can we consider as &quot;crypto&quot; the countless *DeFi* tokens that are made now just for gambling ? Why people cannot understand that buying things like ElonBalls, DogeUncle, Shiba, ShibaSister , Floki etc is meaningless ? Their founders control every single coin in the supply and manipulate the market of these useless tokens.</p>\n\n<p>When are we going to realize that <strong>this situation is pathogenic ?</strong></p>\n\n<p>OR there are still people out there who believe that we can have more and more tokens made out of thin air <strong>forever</strong>.... ?  Hyper-inflation instead of hedge against it ? Seriously ?</p>\n\n<p>&#x200B;</p>\n\n<p>As a supporter of the original cryptocurrency idea I see one thing:</p>\n\n<p><strong>Company-driven projects and rich people</strong> who felt that they <strong>miss the ground</strong> under their feet <strong>because of the original crypto idea</strong>, try hard to <strong>drown the real cryptos into a sea of sh#t</strong>.</p>\n\n<p>They have made it to <strong>abuse</strong> the blockchain technology with their companies, <strong>taking control of everything</strong> again, <strong>disgracing the original concept</strong> and convincing everyone that <strong>crypto = scams</strong> and <strong>crypto = just gambling</strong> with stupid tokens in the best scenario ! </p>\n\n<p>How many crypto newcomers know today what is mining? What is zero premine ? What is Decentralization? What is freedom in transactions without a trusted party?  What is a mining pool?   Immutable supply ? Private keys ?</p>\n\n<p>Most people know only the words tokens, lock, swap, withdrawal. Maybe they also know the word <strong>&quot;rugpull&quot;</strong> or they learn it... in the <strong>hard way</strong>.</p>\n\n<p>We ended up with an insanely vast majority of &quot;assets&quot; that are called &quot;crypto&quot; but <strong>in reality are not  real cryptos</strong> since <strong>they don&#39;t honor any of the fundamentals</strong> that a Bitcoin-like crypto was supposed to do.</p>\n\n<p>With only few (undervalued) exceptions like Monero, Digibyte, Litecoin, BitcoinZ, RTM &amp; maybe a couple more, the landscape is full with Company-Driven / Centralized Projects and even more thousands of useless scam tokens. </p>\n\n<p>&amp; this is definitely not going to end well, because on the day when this bubble bursts, most people around the world will be totally convinced that the original crypto idea was a scam.</p>\n\n<p>I am the only one who feels this way ? </p>\n\n<p>That this is <strong>a well-arranged plan by the system&#39;s big guys</strong> that realized &quot;we cannot kill the original crypto idea and its community driven independent networks....so <strong>let&#39;s better make some money</strong> from it....<strong>cheapen it</strong>, <strong>vulgarize it</strong> and <strong>in the end convince everyone that it was a scam</strong>&quot; ...mission accomplished!</p>\n\n<p>&#x200B;</p>\n\n<p>I know that this will be considered as a bad post  by the most of you (maybe I will find it even deleted because the most Reddit channels are controlled by admins who are &quot;funded&quot; by token founders) but all these are based on arguments that every logical person can easily understand.</p>\n\n<p>You are free to comment with arguments. However it is immature downvoting just because you feel bad for this post and the tokens with which you decided to gamble...</p>\n\n<p>We have to <strong>educate</strong> ourselves and the people around us what the cryptocurrency revolution was truly about.</p>\n\n<p>We have to <strong>support</strong> the few really Community driven projects that had <strong>no founder owning the Lion&#39;s share</strong> in the supply of the Project (<strong>they are less than 0.01%</strong> of all the crypto around....<strong>have you wondered why?</strong> ).</p>\n\n<p>Do your own research, away from noise and paid advertisements about crypto.</p>\n\n<p>Only this way you can be sure that your choices are not part of a game that was already set by the Elites around the World.</p>\n\n<p>Stop playing their game, take your destiny in your hands.</p>\n\n<p>Thank you and sorry for the long post.</p>\n\n<p><strong>&quot;If you can’t beat them, join them&quot;</strong> </p>\n\n<p>Quentin Reynolds </p>\n\n<p><strong>&quot;If you can&#39;t convince them, confuse them.&quot;</strong></p>\n\n<p>Harry S Truman</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/CryptoCurrency/comments/qxg2wk/why_this_bubble_is_not_going_to_end_well_15000/",
  "subreddit": "CryptoCurrency",
  "id": "qxg2wk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "First of all I wish to declare one thing : I love the original cryptocurrency\nidea and I think that it is really the most revolutionary discovery of the last\nmany years, after the internet.\n\nIt is superb : Decentralized transaction networks with fixed rules, where\neveryone can take part (mining…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず最初に宣言したいことがあります：私はオリジナルの暗号通貨のアイデアが大好きで\nのアイデアが大好きで、インターネットに次いでここ数年で最も革命的な発見だと思っています。\n革命的な発見だと思っています。\n\nそれは、次のような素晴らしいものです：固定されたルールを持つ非中央集権的な取引ネットワークで、誰もが参加できる（マイニング...\n誰もが参加できる（マイニング...",
      "title": "このバブルがうまくいかない理由：15,000以上の役に立たないコインやトークンが、立ち上げ時に創業者によって100％所有され、完全に中央集権化され、ほとんどが2、3のネットワークに依存しているため、数少ない本物の暗号が詐欺の海に溺れてしまうのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我想声明一件事：我喜欢原始的加密货币\n的想法，我认为它确实是过去多年来继互联网之后最具革命性的发现\n我认为它确实是过去多年来继互联网之后最具革命性的发现。\n\n它是极好的：具有固定规则的去中心化交易网络，每个人都可以参与其中（采矿......）。\n每个人都可以参与（采矿...",
      "title": "为什么这个泡沫不会有好结果：15000多个无用的硬币和代币在推出时由其创始人100%拥有，完全集中化，主要取决于几个网络，实际上将少数真正的加密货币淹没在骗局的海洋中。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我想聲明一件事：我喜歡原始的加密貨幣\n的想法，我認爲它確實是過去多年來繼互聯網之後最具革命性的發現\n我認爲它確實是過去多年來繼互聯網之後最具革命性的發現。\n\n它是極好的：具有固定規則的去中心化交易網絡，每個人都可以參與其中（採礦......）。\n每個人都可以參與（採礦...",
      "title": "爲什麼這個泡沫不會有好結果：15000多個無用的硬幣和代幣在推出時由其創始人100%擁有，完全集中化，主要取決於幾個網絡，實際上將少數真正的加密貨幣淹沒在騙局的海洋中。"
    }
  ]
}