{
  "author": "jdefgh",
  "original_created_utc": 1657375242,
  "title": "I used an algorithm to find coins that can 20x. Here are the results.",
  "created_utc": 1657428089,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve ran an algorithm to find coins that have a 20x or even 50x potential.\nFirst, I took a list of all coins from CoinGecko API, and I filtered them to exclude leveraged tokens like &amp;quot;SPDR S&amp;amp;P 500 ETF tokenized stock FTX&amp;quot; and of course shitcoins.\nThis step eliminated 7302 out of 13403 coins, leaving 6101 for the next step.\nIn the next step I filtered the remaining coins based on a few conditions I came up with:\n- They must have an ATH Market Cap lower than 200k BTC (~$10B at good times), It&amp;#39;s less likely to 20x if it already did before. Also there&amp;#39;s usually a reason why it&amp;#39;s not in the top anymore.\n- The current market cap must be above 4000 BTC ($80M) - most of those below are scams.\n- The current market cap must be also below 50000 BTC ($1B), the higher the market cap the less volatile the coin is, reducing the chance for a 20x.\n- The supply has to be between 1 million and 1 trillion, no serious project goes beyond this limits.\n- Lastly, it can&amp;#39;t be more than 90% down from its ATH in BTC, if you look into the coins of 2021 bull market, you&amp;#39;ll see that none of them have a history like this.\nI used BTC for all comparisons because it makes all the bull markets more equal to each other.&lt;/p&gt;\n\n&lt;p&gt;After these steps we are left with 74 coins out of 6101. I filtered them out by hand to pick the best 6 I don&amp;#39;t own yet, so my opinion is objective. Here are the coins that survived:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Arweave (AR)\nArweave is a file storage system like Filecoin, except you pay once to store the data forever, so you don&amp;#39;t need to worry about running out of money and losing your data.\nIn Blockweave (Arweave&amp;#39;s variation of Blockchain) every block has to reference a randomly chosen historical block, incentivising miners to store more data.\nCurrently there is 70 TB of data stored on Arveawe. For example if you store 10% of all data, you have 10% chance to be able to mine a block. This mechanism also reduces the power of ASICs in mining.\nArweave was launched in June 2018, and its market cap hit 46k BTC ($2.88B at max) 4 times in 2021 and currently has a Market cap of 19k BTC ($390M).&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Stacks (STX)\nStacks is an L1 blockchain, but it serves as a Smart Contract layer for Bitcoin. It uses a consensus mechanism called Proof of Transfer AKA Proof of Burn, it consists of 2 parties - Miners and Stackers.\nBitcoin miners can deposit their BTC rewards on Stacks to receive STX and write a Stacks block. Stackers on the other hand lock STX to receive the BTC from deposited by the miners.\nUnfortunately Stacks&amp;#39; smart contracts are incompatible with EVM, maybe they want to be more distinct from Ethereum and alts in general. Other chains like this have been successful anyway though.\nA downside of this model is the block time which just like in Bitcoin is 10 minutes, but in return receives Bitcoin level security and has super low transaction fees as low as $0.00007.\nStacks was launched in January 2019, had its highest market cap of 70k BTC or $3.74B in December 2021 and currently sits at 25k BTC ($520M).&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Mina Protocol (MINA)\nMina Protocol is a lightweight blockchain designed to have a constant size of 22 KB using zkSNARKs (without trusted setup). With these 22 KB you can fully participate in the network including consensus.\nOne worrying thing about MINA is its inflation, in the last year alone the coin&amp;#39;s supply has tripled. Every coin has an inflation phase although MINA has one that&amp;#39;s very long.\nThe annual inflation will decrease to around 20% in late 2023 which will make it way safer.\nMina was launched in May 2021, and its market cap had an ATH of 35k BTC ($1.55B) in April 2022. Its current market cap is 19k BTC ($390M).&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;1inch (1INCH)\n1inch takes prices from lots of different DEXs and compares its prices to get the best rate. This costs you a bit more in fees, but it&amp;#39;s worth it.\nAnother feature of 1inch is its Mobile Wallet, which makes trading on a phone way more user friendly. It supports 8 different EVM compatible chains and they recently added support for different dapps.\nThe token is not an important part of the dapp, but considering Uniswap and PancakeSwap have their tokens in the Top 50, it might join Top 50 as well..\n1inch launched in December 2020. Its market cap peaked at 24k BTC ($1.2B) in December 2021, and the current market cap is 17k BTC or $350M&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Secret Network (SCRT)\nSecret Network is a smart contract platform that features fully private smart contracts. It&amp;#39;s built on the Cosmos SDK and supports the IBC cross chain bridge.\nA downside of SCRT is that it uses Trusted Execution Enviroments (TEE) which are parts of CPU that are most likely going to be cracked someday, but it&amp;#39;s still good for short-term privacy.\nSCRT also has a few non-IBC decentralized bridges for Ethereum, Binance Smart Chain and Monero. The existence of a Monero token decreases the usage of SCRT token, altough it&amp;#39;s also good.\nSecret Network launched in September 2020. In its peak in January 2022 its market cap was 34k BTC ($1.45B). Now its market cap is only 7.7k BTC ($160M)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Nervos Network (CKB)\nNervos Network connects all families of smart contracts platform like EVM and IBC. It allows developers to make Universal dApps for different blockchains using the same code.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I did the research in the process of writing this post, do your own research if you&amp;#39;re interested in these coins.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 311,
  "permalink": "/r/CryptoCurrency/comments/vv2c29/i_used_an_algorithm_to_find_coins_that_can_20x/",
  "subreddit": "CryptoCurrency",
  "id": "vv2c29",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've ran an algorithm to find coins that have a 20x or even 50x potential.\nFirst, I took a list of all coins from CoinGecko API, and I filtered them to\nexclude leveraged tokens like \"SPDR S&P 500 ETF tokenized stock FTX\" and of\ncourse shitcoins. This step eliminated 7302 out of 13403 coins, leaving…"
}