{
  "author": "plokij24",
  "the_new_excerpt": "Firstly, very few people know much about crypto investing. It's typically a crap\nshoot and anyone who tries to show you technical analysis or research on chart\nmovement is talking out of their ass.\n\nMost of these people got lucky, rode the bull to the top, then told everyone\nthey did it based on x,…",
  "original_created_utc": 1613353928,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先，很少有人了解加密投资。它是典型的垃圾\n拍摄和任何试图向你展示技术分析或图表研究的人。\n运动是说出来的屁股。\n\n这些人大部分都是运气好，骑着牛上了天，然后告诉大家\n他们这样做是基于X，...",
      "title": "不要听信有钱人的加密投资建议"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，很少有人瞭解加密投資。它是典型的垃圾\n拍攝和任何試圖向你展示技術分析或圖表研究的人。\n運動是說出來的屁股。\n\n這些人大部分都是運氣好，騎着牛上了天，然後告訴大家\n他們這樣做是基於X，...",
      "title": "不要聽信有錢人的加密投資建議"
    }
  ],
  "title": "Do not take crypto investing advice from rich people",
  "created_utc": 1613367541,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Firstly, very few people know much about crypto investing. It&#39;s typically a crap shoot and anyone who tries to show you technical analysis or research on chart movement is talking out of their ass.</p>\n\n<p>Most of these people got lucky, rode the bull to the top, then told everyone they did it based on x, y, &amp; z instead of dumb luck.</p>\n\n<p>Secondly, rich people are risking an extremely small amount of their wealth (or in the case of Elon Musk, his companies wealth, not his own). Sure, it sounds amazing when someone invests hundreds of millions of dollars into crypto. <strong>But they are gambling with a tiny relative amount</strong>.</p>\n\n<p>When the average <a href=\"/r/CryptoCurrency\">/r/CryptoCurrency</a> user invests into crypto, they are likely putting a lot at risk in terms of net worth percentage.</p>\n\n<p>When the rich lose, they might not be able to buy their 50th car. When the poor loses, they go without food. The risk is not the same regardless of the raw amount of money lost.</p>\n\n<p><strong>In summary</strong>: while no one actually knows what they are talking about in terms of crypto investing, you should put more value on the opinion of the person who risks 50% of their $10k net worth vs. the billionaire who puts 0.0001% of their net worth in. The poorer person has more to lose.</p>\n\n<p>Those of you in the US at the moment will know about this really well. You have the 1% (politicians) deciding the fate of millions of people who desperately need a stimulus check. They don&#39;t grasp how a few hundred dollars makes such a big difference to someone who struggles to put food on the table. <strong>Their crypto advice is irrelevant.</strong></p>\n</div><!-- SC_ON -->",
  "score": 763,
  "permalink": "/r/CryptoCurrency/comments/lk2vgp/do_not_take_crypto_investing_advice_from_rich/",
  "subreddit": "CryptoCurrency",
  "id": "lk2vgp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728617845
}