{
  "author": "itsnotwhoyouthink5",
  "original_created_utc": 1641861985,
  "title": "It’s official: I’ve mentally reached the point of not caring about price swings",
  "created_utc": 1641901170,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;At the beginning of 2021 I got into crypto and like most newbies I was fomoing at the top and panic selling on the dips. I eventually got into a good DCA schedule but that’s when the May crash happened and I ended up down a lot. I kept buying but I definitely felt sad, defeated, like I might not see my money again for 3-4 years. &lt;/p&gt;\n\n&lt;p&gt;This used to emotionally affect me a lot. I’d stare at charts all day, wake up at 3am and panic sell, or panic buy. Looking back those short term price swings didn’t matter. All those trades did was made my taxes super complicated to calculate. No matter how many posts I read saying this, the experience of going through it yourself is where you learn the most. &lt;/p&gt;\n\n&lt;p&gt;Now I’ve finally reached the point where I am not emotionally affected at all, and it feels amazing. If the price goes up? I have enough invested that I’d be happy with the profits. If the price goes down? I have another potentially life changing opportunity to load up on more crypto. &lt;/p&gt;\n\n&lt;p&gt;TLDR: Good opportunities are ahead, whether the price goes up or down in the short term&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 308,
  "permalink": "/r/CryptoCurrency/comments/s0zny8/its_official_ive_mentally_reached_the_point_of/",
  "subreddit": "CryptoCurrency",
  "id": "s0zny8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "At the beginning of 2021 I got into crypto and like most newbies I was fomoing\nat the top and panic selling on the dips. I eventually got into a good DCA\nschedule but that’s when the May crash happened and I ended up down a lot. I\nkept buying but I definitely felt sad, defeated, like I might not…"
}