{
  "author": "Accomplished-Design7",
  "the_new_excerpt": "I talk to several friends who have been investing in crypto some of them have\nbeen doing it for years. Imagine my surprise when they asked me \"What's DeFi?\"\nwhen I started to talk about DeFi. So here I am trying to do my best to explain\nDeFi.\n\nTRDL: At the bottom\n\nDeFi: what it is and how it…",
  "original_created_utc": 1624243616,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号に投資している友人が何人かいますが、中には何年もやっている人もいます。\n何年も投資を続けている人もいます。私がDeFiについて話し始めたとき、彼らが \"DeFiって何？\"と聞いてきたときの私の驚きを想像してみてください。\nと聞かれたときの私の驚きを想像してみてください。私がDeFiについて話し始めたとき、彼らが「DeFiって何？\nDeFiです。\n\nTRDL：一番下にある\n\nDeFiとは何か、どうやって...",
      "title": "DeFiとは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和几个一直在投资加密货币的朋友谈过，他们中的一些人已经做了很多年。\n已经做了很多年了。想象一下，当我开始谈论DeFi时，他们问我 \"DeFi是什么？\"时，我是多么惊讶。\n时，我开始谈论DeFi。因此，我在这里试图尽力解释\nDeFi。\n\nTRDL：在底部\n\nDeFi：它是什么以及它如何...",
      "title": "什么是DeFi？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和幾個一直在投資加密貨幣的朋友談過，他們中的一些人已經做了很多年。\n已經做了很多年了。想象一下，當我開始談論DeFi時，他們問我 \"DeFi是什麼？\"時，我是多麼驚訝。\n時，我開始談論DeFi。因此，我在這裏試圖盡力解釋\nDeFi。\n\nTRDL：在底部\n\nDeFi：它是什麼以及它如何...",
      "title": "什麼是DeFi？"
    }
  ],
  "title": "What is DeFi?",
  "created_utc": 1624261982,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I talk to several friends who have been investing in crypto some of them have been doing it for years. Imagine my surprise when they asked me &quot;What&#39;s DeFi?&quot; when I started to talk about DeFi. So here I am trying to do my best to explain DeFi.</p>\n\n<p><strong><em>TRDL: At the bottom</em></strong></p>\n\n<p>DeFi: what it is and how it works</p>\n\n<p>The term “Decentralized Finance” (DeFi) covers financial services carried out on a blockchain. DeFi are financial services with no central authority. It involves taking traditional elements of the financial system and replacing the middleman with a smart contract. We can also describe it as the merger between traditional banking services with blockchain technology, in layman’s terms.</p>\n\n<p>So, for DeFi to work, it needs a decentralized infrastructure to run on. This is where the Ethereum blockchain comes into play. The Ethereum blockchain is a DIY platform for decentralized applications (DApps).</p>\n\n<p>Most DeFi protocols operate on the Ethereum blockchain, although a few have migrated to other competing blockchains to enjoy greater speed and scalability.DeFi: what it is and how it works</p>\n\n<p>The term “Decentralized Finance” (DeFi) covers financial services carried out on a blockchain. DeFi are financial services with no central authority. It involves taking traditional elements of the financial system and replacing the middleman with a smart contract. We can also describe it as the merger between traditional banking services with blockchain technology, in layman’s terms.</p>\n\n<h2>DeFi’s top applications — and notable protocols </h2>\n\n<p>Now, that we know what DeFi is, let’s look at some of its notable applications.</p>\n\n<p><strong>1. Decentralized exchanges (DEXs)</strong></p>\n\n<p>Decentralized exchanges are exchanges that operate without an intermediary. They are not as popular as their centralized counterparts. </p>\n\n<p>With DEXs, users can connect directly with one another to buy and sell cryptocurrencies in a trustless environment. Assets traded under DEXs are never held in an escrow or third party wallet, as is done with centralized exchanges. Some top DEXs include Uniswap, Curve and SushiSwap. </p>\n\n<p>Centralized exchanges, on the other hand, are trading platforms operated by a central authority. Platforms like Binance and Coinbase are popular examples of centralized exchanges. They are custodial in nature. In other words, the buyers and sellers trust the central authority to keep their digital assets safe.</p>\n\n<p><strong>2. Lending Platforms</strong></p>\n\n<p>DeFi proponents say the decentralized lending platforms are democratizing the lending ecosystem. These platforms use smart contracts in place of intermediaries like banks — allowing borrowers and lenders to participate in an open system. Lenders can earn interest on their crypto assets by loaning them out, while borrowers can access liquidity without selling off their assets. </p>\n\n<p>With the traditional financial system, you need to offer collateral before you can access loans from the bank. This is similar to what happens in DeFi. Borrowers have to over-collateralized their loans by offering assets more valuable than the loan value. Some of the top DeFi lending platforms include Maker, Compound, and Aave.</p>\n\n<p><strong>3. Prediction Markets</strong></p>\n\n<p>A prediction market allows participants to make bets on the outcomes of future events. These platforms function like traditional prediction markets — but with blockchain functionality, which eliminates intermediaries. Examples of DeFi prediction markets are Augur, Gnosis and FTX. Crypto powered prediction markets flourished during the 2020 U.S. presidential elections. Augur recorded a milestone volume of over $8 million. Other platforms like Polymarket and Predictit also saw significant election volumes.</p>\n\n<p><strong>4. Yield farming</strong></p>\n\n<p>Yield farming is the process of locking up cryptocurrencies in exchange for a reward. It’s the hottest new term in the DeFi space. Money markets Compound and Aave are two major platforms to farm DeFi yields. Yield farmers stake popular coins like ether, dai, tether and others.</p>\n\n<h2>DeFi benefits </h2>\n\n<p><strong>1. Permissionless</strong></p>\n\n<p>Traditional banks are expensive to run and bureaucratic in nature. They take too long to process transactions and have cut many people out of the financial system due to their stringent requirements. DeFi came to solve many of these issues. Here are some of its benefits.</p>\n\n<p>DeFi opens everyone to the financial system irrespective of income, race, wealth, culture or geographic location. All a user needs is a mobile phone or computer with internet access.</p>\n\n<p>There is a significant number of unbanked people globally. The World Bank estimated in 2018 that 20% of the world’s population lack access to banking services. One reason for this is that most of the unbanked lack much-needed know-your-customer (KYC) documents like state-issued I.D. cards.</p>\n\n<p>Several DeFi platforms allow users to function without any of this. You can take out a Maker loan, for instance, without any identification or credit score.</p>\n\n<p><strong>2. Interest rates for investors</strong></p>\n\n<p>Beyond keeping your wealth like a savings account, DeFi also allows you to earn income. Platforms like Aave and Compound allow you to deposit assets and lend them out to borrowers. At an agreed-upon time, you get your interest and can plow your capital back into the system. </p>\n\n<p>Compound offers up to 4.3% interest on deposits from some tokens, while Aave is paying out as much as 5.73%. Compared to the 0.6% to 0.7% currently offered by traditional banks for savings accounts, it’s not difficult to see why some people are shifting their assets to DeFi. </p>\n\n<p><strong>3. Control over your own finances</strong></p>\n\n<p>With DeFi platforms, you remain in control of your finances. While you have to deposit your funds into the platform, you decide what happens to them. Instead of trusting human intermediaries to qualify you for a loan or decide how to manage your investments, a smart contract does that.</p>\n\n<p>No one can ban you from a DeFi protocol. The underlying smart contract is law, and it operates blindly. </p>\n\n<p><strong>4. Heightened transparency</strong></p>\n\n<p>DeFi enables a greater level of openness and accessibility. Since most DeFi protocols are built on the blockchain — a public ledger — all activities are available to the public. Anyone can view transactions, but these accounts are not tied to anyone directly as is the case with traditional banks. Instead, accounts are pseudo-anonymous, listing only numerical addresses. Users with programming knowledge can also access most DeFi products’ source code to audit or build upon since they’re open source. Open-source codes are far more secure and of higher quality than proprietary software, thanks to community interaction.</p>\n\n<h2>DeFi drawbacks and security risks </h2>\n\n<p><strong>1. Security issues with smart contracts</strong></p>\n\n<p>Smart contracts form the backbone of any DeFi protocol. But they are susceptible to manipulation. </p>\n\n<p>By default, smart contracts are open-source. This design allows prospective users to review them before investing in the DeFi protocol. Most DeFi protocols give their smart contracts to security firms to audit. This is where the problem begins. It’s not unusual for humans to miss flaws in these contracts, which could be exploited in the future. </p>\n\n<p>Take The DAO, for example. The digital “Decentralized Autonomous Organization” was an investor-directed venture capital fund of sorts that launched in April 2016 and grew quickly to become the biggest crowdfunding platform, managing about $120 million. However, by June that same year, hackers found a vulnerability in the smart contract and stole about a third of its funds. They moved the funds into a “child DAO,” which had the same structure as the parent protocol. Users couldn’t access their funds for weeks, making this perhaps the largest hack in crowdfunding history.</p>\n\n<p>There have been several refunds since then, allowing investors with residual DAO tokens to get some compensation. However, the incident sparked an awakening in the DeFi space. Now, developers who build protocols ensure that their smart contracts go through multiple audit rounds </p>\n\n<p><strong>2. Data feed centralization</strong></p>\n\n<p>Blockchain protocols can’t access off-chain data. To remedy this, many of them use oracles — third-party services that provide access to external information. Oracles serve as bridges between blockchains and the outside world, relaying information to smart contracts for them to utilize. </p>\n\n<p>The major issue with oracles is creating a central point of trust into trustless and decentralized setups. This centrality provides a vulnerability for the entire smart contract. When an oracle broadcasts the wrong information, the consequences could be dire. </p>\n\n<p>Take the case of Synthetix — a DeFi asset issuance platform. On June 25, 2019, an oracle transmitted false price feed data to the platform’s smart contract. A user’s trading bot took advantage of this and inflated the user’s balance. This allowed the user to convert this balance to about 37 million Synthetic ETH (sETH) tokens (worth $70 million at the time). Synthetix confirmed that they reached out to the user, who agreed to reverse the transaction in exchange for an unspecified bug bounty. </p>\n\n<p><strong>3. Bad actors</strong></p>\n\n<p>In September last year, the top crypto exchange KuCoin confirmed that it had suffered a hack that saw $150 million in bitcoin and ERC-20 tokens transferred from its hot wallets. Days after the event occurred, blockchain intelligence software Elliptic crunched the numbers and found that the exchange had actually lost about $281 million. </p>\n\n<p>The report added that the hackers had been laundering the funds through DeFi protocols Uniswap, Kyber Network and others. As Elliptic explained, many centralized exchanges had frozen the hackers’ accounts, preventing them from moving their funds. However, in DEXs, the hackers found the perfect conduits — platforms with no central authorities to freeze their funds.</p>\n\n<p><em>TLDR:</em> <strong><em>DeFi</em></strong> <em>are financial services with no central authority. It involves taking traditional elements of the financial system and replacing the middleman with a smart contract. We can also describe it as the merger between traditional banking services with blockchain technology, in</em> <strong><em>layman&#39;s terms</em></strong>*.*</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/CryptoCurrency/comments/o4laa1/what_is_defi/",
  "subreddit": "CryptoCurrency",
  "id": "o4laa1",
  "is_self": true,
  "media": null,
  "is_video": false
}