{
  "author": "cryptochacha",
  "original_created_utc": 1643057696,
  "title": "My biggest regret this crash",
  "created_utc": 1643103227,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My biggest regret was not taking profits on my altcoins. With bitcoin and eth I have full conviction they will recover and set new ATH’s but with some of my alt coins I don’t share the same sentiment. &lt;/p&gt;\n\n&lt;p&gt;I feel like I have mastered the art of hodling and buying. What I really need to work on is taking profits and keeping in mind that no matter how astronomical the gains are on altcoins, they will always bleed in the long term against btc and eth. &lt;/p&gt;\n\n&lt;p&gt;What are some of your regrets this market crash and how will you do better when the market recovers and breaks a new ATH?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 309,
  "permalink": "/r/CryptoCurrency/comments/sbw8bb/my_biggest_regret_this_crash/",
  "subreddit": "CryptoCurrency",
  "id": "sbw8bb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My biggest regret was not taking profits on my altcoins. With bitcoin and eth I\nhave full conviction they will recover and set new ATH’s but with some of my alt\ncoins I don’t share the same sentiment.\n\nI feel like I have mastered the art of hodling and buying. What I really need to\nwork on is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "一番後悔しているのは、アルトコインを利益確定しなかったことです。ビットコインとエスで私は\nしかし、私のアルトのいくつかは、この先回復し、新たなATHを記録すると確信しています。\nを使うようになりました。\n\n私は、ホドリングと買いの技術を習得したような気がします。本当に必要なのは\n取り組むべきは...",
      "title": "今回のクラッシュで一番後悔したこと"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最大的遗憾是没有在我的altcoins上获取利润。对于比特币和以太坊，我完全相信它们会回升并创造新的净值。\n我完全相信它们会恢复并创造新的ATH，但对于我的一些alt\n币，我却没有同样的感觉。\n\n我觉得我已经掌握了躲避和购买的艺术。我真正需要做的是\n工作是...",
      "title": "这次坠机我最大的遗憾"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最大的遺憾是沒有在我的altcoins上獲取利潤。對於比特幣和以太坊，我完全相信它們會回升並創造新的淨值。\n我完全相信它們會恢復並創造新的ATH，但對於我的一些alt\n幣，我卻沒有同樣的感覺。\n\n我覺得我已經掌握了躲避和購買的藝術。我真正需要做的是\n工作是...",
      "title": "這次墜機我最大的遺憾"
    }
  ]
}