{
  "author": "yo_saturnalia",
  "original_created_utc": 1639773250,
  "title": "Coinage is believed to have been invented by the Lydians. Why are there no coins found older than the Lydians from the time of Croesus(circa 500-550BC)? What did older Mesopotamian civilizations such as the Neo-Assyrians or Babylonians use as currency?",
  "created_utc": 1639820442,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It seems surprising that something so fundamental as currency and coinage should emerge so late in history. Are we perhaps biased by the lack of evidence in terms of coins discovered in claiming that the Lydians invented metal coinage? What did the Egyptians or the Assyrians use for trade before this period?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/riq8fs/coinage_is_believed_to_have_been_invented_by_the/",
  "subreddit": "AskHistorians",
  "id": "riq8fs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It seems surprising that something so fundamental as currency and coinage should\nemerge so late in history. Are we perhaps biased by the lack of evidence in\nterms of coins discovered in claiming that the Lydians invented metal coinage?\nWhat did the Egyptians or the Assyrians use for trade before…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "通貨や貨幣のような基本的なものがあるのは意外な気がします。\n歴史上、これほど遅く出現したのである。証拠となるようなものがないために、私たちは偏った見方をしているのでしょうか。\nリディア人が金属貨幣を発明したと主張するのは、発見された貨幣の観点からなのだろうか。\nエジプトやアッシリアが貿易のために使っていたのは...。",
      "title": "貨幣はリディア人によって発明されたと考えられている。クロイソスの時代（前500〜前550年頃）からリュド人よりも古いコインが発見されていないのはなぜでしょうか？新アッシリアやバビロニアなどメソポタミアの古い文明では、通貨として何が使われていたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "令人惊讶的是，像货币和硬币这样基本的东西竟然在历史上出现得如此之晚。\n在历史上出现得如此之晚。我们是否因为缺乏证据而偏向于\n声称吕底亚人发明了金属钱币？\n埃及人或亚述人之前用什么来进行贸易？",
      "title": "钱币被认为是由吕底亚人发明的。为什么没有发现比吕底亚人时期（约公元前500-550年）更早的钱币？更早的美索不达米亚文明，如新亚述人或巴比伦人使用什么作为货币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "令人驚訝的是，像貨幣和硬幣這樣基本的東西竟然在歷史上出現得如此之晚。\n在歷史上出現得如此之晚。我們是否因爲缺乏證據而偏向於\n聲稱呂底亞人發明了金屬錢幣？\n埃及人或亞述人之前用什麼來進行貿易？",
      "title": "錢幣被認爲是由呂底亞人發明的。爲什麼沒有發現比呂底亞人時期（約公元前500-550年）更早的錢幣？更早的美索不達米亞文明，如新亞述人或巴比倫人使用什麼作爲貨幣？"
    }
  ]
}