{
  "author": "jas_man_man_dar",
  "original_created_utc": 1636939787,
  "title": "It’s not racist to not be sexually attracted to a certain color of skin right?",
  "created_utc": 1636953742,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m a tall white guy. I was hanging with a group of friends and acquaintances having burgers and beers. The topic of attraction was brought up. Everybody was talking about height, build, hair color, etc. </p>\n\n<p>I mentioned that I’m attracted to white women and I love Latina’s. Then a girl asked about African American’s. I said I wasn’t really attracted to darker women, though I have been a few times but it’s rare.</p>\n\n<p>She damn near threw her drink on me, called me a racist and stormed out. I was really caught off guard. Everybody told me I didn’t do anything wrong but I left shortly after just to clear the air.</p>\n\n<p><strong>EDIT</strong> After seeing many posts and all different takes, I just wanted to say thanks. Also, It’s not just skin tone I guess. African features? I don’t know how to tell someone “I’m not attracted to the facial structure of most African women” so just saying skin tone seems like the easiest and nicest way. I don’t know. </p>\n\n<p>Also, there is BEAUTIFUL black women. The musician Megan Thee Stallion without make-up is one of the most naturally pretty women I’ve ever seen. Her body, her face, her hair when she wears it naturally. I’d love nothing more than to have a bunch of little mixed babies with her lol.</p>\n</div><!-- SC_ON -->",
  "score": 135,
  "permalink": "/r/NoStupidQuestions/comments/qu4qyz/its_not_racist_to_not_be_sexually_attracted_to_a/",
  "subreddit": "NoStupidQuestions",
  "id": "qu4qyz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m a tall white guy. I was hanging with a group of friends and acquaintances\nhaving burgers and beers. The topic of attraction was brought up. Everybody was\ntalking about height, build, hair color, etc.\n\nI mentioned that I’m attracted to white women and I love Latina’s. Then a girl\nasked about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は背の高い白人です。友人や知人のグループと一緒にハンバーガーやビールを食べていました。\nハンバーガーとビールを飲んでいました。魅力の話題が出ました。みんなは\n身長、体格、髪の色などについて話していました。\n\n私は白人女性に惹かれ、ラテン系の女性が好きだと話しました。すると、ある女の子が\nが聞いてきたのは...。",
      "title": "ある色の肌に性的魅力を感じないのは人種差別ではありませんよね？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个高大的白人。我和一群朋友和熟人在一起\n吃汉堡和喝啤酒。吸引力的话题被提出来了。每个人都在\n谈论身高、身材、发色等等。\n\n我提到我被白人女性吸引，我喜欢拉丁裔女性。然后一个女孩\n问到...",
      "title": "不对某种肤色的人产生性吸引力并不是种族主义者，对吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個高大的白人。我和一羣朋友和熟人在一起\n喫漢堡和喝啤酒。吸引力的話題被提出來了。每個人都在\n談論身高、身材、髮色等等。\n\n我提到我被白人女性吸引，我喜歡拉丁裔女性。然後一個女孩\n問到...",
      "title": "不對某種膚色的人產生性吸引力並不是種族主義者，對嗎？"
    }
  ]
}