{
  "author": "Charmycole",
  "original_created_utc": 1639967741,
  "title": "Loopring (LRC) versus Polygon (MATIC)?",
  "created_utc": 1639996806,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m curious as to your thoughts on which one will outperform. I don&amp;#39;t have any LRC, yet MATIC makes up 30% of my portfolio. I&amp;#39;m considering moving half of my MATIC to LRC.&lt;/p&gt;\n\n&lt;p&gt;Polygon info: &lt;/p&gt;\n\n&lt;p&gt;Polygon (MATIC) is the native cryptocurrency that powers the Polygon Network, a layer 2 platform created in 2017. Originally called the Matic Network, the Polygon Network allows developers to create and deploy their own blockchains that are compatible with the Ethereum blockchain with a single click, as well as enables other Ethereum-based projects to transfer data and tokens between one another using the MATIC sidechain. Think of it as a smaller blockchain that runs in parallel with the Ethereum blockchain.&lt;/p&gt;\n\n&lt;p&gt;Loopring info: &lt;/p&gt;\n\n&lt;p&gt;Loopring is a software running on Ethereum that aims to incentivize a global network of users to operate a platform that enables the creation of new types of crypto asset exchanges.  One of an emerging number of decentralized finance (DeFi) protocols, Loopring uses multiple cryptocurrencies, including its own LRC cryptocurrency, to together provide for this platform.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/rkcjl4/loopring_lrc_versus_polygon_matic/",
  "subreddit": "CryptoCurrency",
  "id": "rkcjl4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm curious as to your thoughts on which one will outperform. I don't have any\nLRC, yet MATIC makes up 30% of my portfolio. I'm considering moving half of my\nMATIC to LRC.\n\nPolygon info:\n\nPolygon (MATIC) is the native cryptocurrency that powers the Polygon Network, a\nlayer 2 platform created in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "どちらがアウトパフォームするか、お考えをお聞かせください。私は\nLRCですが、MATICは私のポートフォリオの30％を占めています。その半分をLRCに移そうかと考えています。\nMATICからLRCへ。\n\nポリゴン情報。\n\nポリゴン（MATIC）は、ポリゴンネットワークを動かすネイティブ暗号通貨です。\nレイヤー2のプラットフォームで...",
      "title": "Loopring（LRC）対Polygon（MATIC）？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很好奇你对哪一个将表现出色的想法。我没有任何\nLRC，但MATIC占我投资组合的30%。我正在考虑将我的一半\nMATIC转移到LRC。\n\nPolygon信息。\n\nPolygon（MATIC）是为Polygon网络提供动力的本地加密货币。\n它是一个创建于2000年的第二层平台。",
      "title": "Loopring（LRC）与Polygon（MATIC）的对比？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很好奇你對哪一個將表現出色的想法。我沒有任何\nLRC，但MATIC佔我投資組合的30%。我正在考慮將我的一半\nMATIC轉移到LRC。\n\nPolygon信息。\n\nPolygon（MATIC）是爲Polygon網絡提供動力的本地加密貨幣。\n它是一個創建於2000年的第二層平臺。",
      "title": "Loopring（LRC）與Polygon（MATIC）的對比？"
    }
  ]
}