{
  "author": "Whiterossy",
  "the_new_excerpt": "Hi everyone, I am back with another long one!\n\n \n\nAs someone with a masters degree in Financial Economics, I have seen many\ntheories over the years, and quite frankly, since last year almost all of them\nhave been proven useless in the real world. Maybe useless is the wrong word, but\nsince the…",
  "original_created_utc": 1620735810,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは！またまた長文になってしまいました。\n\n \n\n金融経済学の修士号を持っている私は、これまで多くの理論を見てきました。\n率直に言って、去年からほとんどすべての理論が実用化されています。\n実社会では役に立たないことが証明されました。役に立たないという言葉は間違っているかもしれませんが\n去年から...",
      "title": "The Greater Fool Theory - なぜシットコインが人気と量を増しているのか"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我又回来了，又是一个长篇。\n\n \n\n作为一个拥有金融经济学硕士学位的人，多年来我看到了许多\n理论，坦率地说，自去年以来，几乎所有这些理论\n都已被证明在现实世界中毫无用处。也许 \"无用 \"这个词用得不对，但\n自从...",
      "title": "大傻瓜理论--为什么屎币的流行和数量在增加"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我又回來了，又是一個長篇。\n\n \n\n作爲一個擁有金融經濟學碩士學位的人，多年來我看到了許多\n理論，坦率地說，自去年以來，幾乎所有這些理論\n都已被證明在現實世界中毫無用處。也許 \"無用 \"這個詞用得不對，但\n自從...",
      "title": "大傻瓜理論--爲什麼屎幣的流行和數量在增加"
    }
  ],
  "title": "The Greater Fool Theory - Why shitcoins are increasing in popularity and quantity",
  "created_utc": 1620765400,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone, I am back with another long one! </p>\n\n<p>&nbsp;</p>\n\n<p>As someone with a masters degree in Financial Economics, I have seen many theories over the years, and quite frankly, since last year almost all of them have been proven useless in the real world. Maybe useless is the wrong word, but since the pandemic, the market has not made a whole load of sense theory-wise. </p>\n\n<p>&nbsp;</p>\n\n<p>However, there is one theory that I want to highlight today, as it appears to be more relevant than ever in the cryptocurrency market: <strong>The Greater Fool Theory</strong>.</p>\n\n<p>The greater fool theory defines that the price of an asset is not only defined by its intrinsic value (like usecase), but solely by the premise that you can sell this asset for a higher price, at a later point in time. The intrinsic value is less important than the increase in demand of this particular asset, however irrational it may be. Therefore, you are willingly investing in a potentially overpriced asset, betting on the fact that there will be a greater fool later on to buy the same asset from you at a higher price. </p>\n\n<p>&nbsp;</p>\n\n<p>Now, does this ring any bells? To me, this just screams shitcoin market. To boomer investors, this screams bitcoin and crypto in general. In fact, many <strong>nobel prize winning economists</strong> have deemed Bitcoin a fools&#39; currency in a fools&#39; market. I am talking about John Quiggin, Robert Shiller (real name, I didn&#39;t make this up I swear), Kevin Costelloe, and Ethan Wolff-Mann. </p>\n\n<p>&nbsp;</p>\n\n<p>As we all know, Bitcoin is indeed one of the crypto&#39;s with the potentially smallest usecase. That doesn&#39;t mean it is valueless, as it is getting compared to gold and treated as such. Compare this however to Ethereum, and anyone with the comprehensive reading skills of a 13 year old will spot very quickly that the intrinsic value and usecase of Ethereum is much, much higher than that of Bitcoin. </p>\n\n<p>&nbsp;</p>\n\n<p>Now compare both of those to SafeMoon, DogeCoin, Shiba Inu and a million other copy paste shitcoins with literally no usecase or intrinsic value, and you can quickly spot that the Greater Fool Theory is definitely fueling these markets. Take one look at the <a href=\"/r/dogecoin\">/r/dogecoin</a> subreddit, I have made my way through yesterday&#39;s Daily Thread, and everyone was talking about holding until $1 before they sell, but some people were talking about DogeCoin hitting $10 easily. So the initial fool, will sell DogeCoin at $1 to a person believing DogeCoin could be sold for $10 easily. This is just a Greater Fool theory spiralling out of control, until at one point there will be no Greater Fool than the last one buying, and he or she will be stuck holding the bags of the sinking ship or inevitably selling at a loss. </p>\n\n<p>&nbsp;</p>\n\n<p>However, DogeCoin still does have a couple of usecases (can be used to pay at certain websites), so perhaps SafeMoon is a better example. SafeMoon does... well, nothing. But people buy it, anticipating hype, otherwise known as irrational demand, causing the price to go up. Then at one point they have reached their price target, and sell the SafeMoon to another investor believing he can dump the SafeMoon at a higher price, to a Greater Fool. </p>\n\n<p>&nbsp;</p>\n\n<p>If there is anything to take away from this post, it is not that there is no money in fool&#39;s markets, but know that it is a very risky business and it can not last forever. Think of buying shitcoins as buying shitty art from an unknown artist, where Ethereum is considered the Mona Lisa and Bitcoin The Last Supper. You know it it ugly and has no value, but you are betting on someone else being a bigger idiot who also thinks he can sell it to a bigger idiot. So tread carefully hunting shitcoins and chasing pumps, do not become the Greatest Fool.</p>\n</div><!-- SC_ON -->",
  "score": 204,
  "permalink": "/r/CryptoCurrency/comments/n9vsga/the_greater_fool_theory_why_shitcoins_are/",
  "subreddit": "CryptoCurrency",
  "id": "n9vsga",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985992427
}