{
  "author": "7484815926263",
  "original_created_utc": 1646167269,
  "title": "How have we allowed for 13,000 nuclear bombs to be created?",
  "created_utc": 1646177020,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been reading up on Mutually Assured Destruction, Dead Hand and Nuclear Winter and I&amp;#39;ve been stressing to say the least. Learning more about this stuff has left me shocked beyond belief. I absolutely cannot wrap my head around how the production of nuclear weapons has not been outright banned decades ago. We have literally created an arsenal of weapons capable of destroying our own entire species several times over??? What braindead animal would ever do that?&lt;/p&gt;\n\n&lt;p&gt;The worst part is how we&amp;#39;ve assured that any small scale attack will inevitably lead into all out war. It&amp;#39;s one strike and we&amp;#39;re all out. Do we expect NONE of the estimated 13,000 bombs to EVER be used? Not a SINGLE ONE? Is the fate of humanity hinging on this absurd expectation? Why is there research still being put into developing STRONGER and even MORE devastating weapons if they&amp;#39;re expected to never be used? Are regular nukes from decades ago not a good enough &amp;quot;deterrent&amp;quot;?&lt;/p&gt;\n\n&lt;p&gt;The past couple of years have completely erased the last shred of hope I had for humanity and I don&amp;#39;t know what to do anymore. Before I would&amp;#39;ve just focused on getting my own microbubble sorted out, but under threat of a war with never before possible consequences, on top of the pandemic and global warming, I&amp;#39;m struggling to find a purpose.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 150,
  "permalink": "/r/TooAfraidToAsk/comments/t4hrvo/how_have_we_allowed_for_13000_nuclear_bombs_to_be/",
  "subreddit": "TooAfraidToAsk",
  "id": "t4hrvo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been reading up on Mutually Assured Destruction, Dead Hand and Nuclear\nWinter and I've been stressing to say the least. Learning more about this stuff\nhas left me shocked beyond belief. I absolutely cannot wrap my head around how\nthe production of nuclear weapons has not been outright banned…"
}