{
  "author": "Fmtservices",
  "original_created_utc": 1638507899,
  "title": "Every time I wanna buy something nice for myself I always think of how I could buy coins instead.",
  "created_utc": 1638538416,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Does anyone else have this same thought pattern? I was Xmas shopping today and saw a new pair of shoes in a store. Now I’m a real frugal bastard so I wear all of my clothing until it basically falls apart. Same goes with everything else. However since I’ve started investing it’s even harder to try\nto justify these types of impulse purchases. The conversation today literally went “yeah I could buy this pair of adidas but do you realize you could just load up on more alts?” Well here I am at home with the same old pair of shoes but I bought more coins. One day I hope I’ll finally splurge and do something nice for myself.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/r7r43p/every_time_i_wanna_buy_something_nice_for_myself/",
  "subreddit": "CryptoCurrency",
  "id": "r7r43p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Does anyone else have this same thought pattern? I was Xmas shopping today and\nsaw a new pair of shoes in a store. Now I’m a real frugal bastard so I wear all\nof my clothing until it basically falls apart. Same goes with everything else.\nHowever since I’ve started investing it’s even harder to try…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これと同じ思考パターンを持つ人はいるのだろうか？今日、Xmasショッピングをしていたら\nお店で新しい靴を見かけました。私は質素倹約家なので、靴を買うときはすべて\nの服は、基本的にボロボロになるまで着ます。他の物も同じです。\nしかし、私が投資を始めてから、それを試すのはさらに難しくなりました...",
      "title": "自分のために何かいいものを買おうとすると、いつも代わりにコインを買えないかと考えるんだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "还有人有这样的思维模式吗？我今天在圣诞节购物时\n在一家商店里看到一双新鞋。现在我是一个真正节俭的混蛋，所以我把所有的衣服都穿到了\n衣服，直到它们基本上散架为止。其他东西也是如此。\n然而，自从我开始投资后，就更难去尝试...",
      "title": "每次我想给自己买点好东西时，我总是想到我可以买硬币来代替。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "還有人有這樣的思維模式嗎？我今天在聖誕節購物時\n在一家商店裏看到一雙新鞋。現在我是一個真正節儉的混蛋，所以我把所有的衣服都穿到了\n衣服，直到它們基本上散架爲止。其他東西也是如此。\n然而，自從我開始投資後，就更難去嘗試...",
      "title": "每次我想給自己買點好東西時，我總是想到我可以買硬幣來代替。"
    }
  ]
}