{
  "author": "IVEMIND",
  "original_created_utc": 1631540003,
  "title": "Are there any elements in the earths crust which are anomalously abundant?",
  "created_utc": 1631555717,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Speaking of the types of planets which are similar to earth, is there more or less gold, for example than there should be according to our current models of how a planet forms?</p>\n\n<p>****Could there be a planet out there with abnormally high deposits of a certain mineral or element? I know there’s asteroids out there that contain a lot of a certain element and we’ve been considering(?) harvesting them.</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/askscience/comments/pnfj82/are_there_any_elements_in_the_earths_crust_which/",
  "subreddit": "askscience",
  "id": "pnfj82",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Speaking of the types of planets which are similar to earth, is there more or\nless gold, for example than there should be according to our current models of\nhow a planet forms?\n\n****Could there be a planet out there with abnormally high deposits of a certain\nmineral or element? I know there’s…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "地球に似ている惑星の種類について言えば、例えば金が多いか少ないか。\n地球に似た惑星の種類について、例えば金の量は、現在の惑星の形成モデルでは、本来あるべき量よりも多いのでしょうか、少ないのでしょうか？\n惑星の形成方法に関する現在のモデルによると、例えば金が多いのか少ないのか？\n\n****、ある鉱物や元素の埋蔵量が異常に多い惑星が存在する可能性はありますか？\nある鉱物や元素の埋蔵量が異常に多い惑星はあるでしょうか？私が知っているのは...",
      "title": "地殻の中に異常に多い元素はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "谈到与地球相似的行星类型，是否有更多或更多的\n例如，根据我们目前关于行星如何形成的模型，黄金应该更多还是更少？\n行星是如何形成的？\n\n**** 会不会有一个星球上有异常多的某种矿物或元素的沉积？\n矿物质或元素的含量异常高？我知道有...",
      "title": "地壳中是否有异常丰富的元素？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "談到與地球相似的行星類型，是否有更多或更多的\n例如，根據我們目前關於行星如何形成的模型，黃金應該更多還是更少？\n行星是如何形成的？\n\n**** 會不會有一個星球上有異常多的某種礦物或元素的沉積？\n礦物質或元素的含量異常高？我知道有...",
      "title": "地殼中是否有異常豐富的元素？"
    }
  ]
}