{
  "author": "upnflames",
  "original_created_utc": 1624633325,
  "title": "Does name familiarity create unintended bias?",
  "created_utc": 1624673055,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know there has been some research done around unintended name discrimination, especially in hiring practices, but I was wondering if there is any data on more general familiarity bias?</p>\n\n<p>A recent example that made me think of this - I&#39;m in sales and I&#39;ve been having kind of a stressful morning, feeling a little cranky. You know how it is. I had a customer I&#39;m not familiar with reach out and ask me for free accessory product with their purchase. This is at my discretion since I manage my own P/L - this particular customer had a name very similar to a close friend of mine who I&#39;m looking forward to seeing this weekend and recalling that made me feel a little happier. I immediately approved the request. I&#39;m not 100% sure I would have done that if they had a name I didn&#39;t feel connected to.</p>\n\n<p>So is there a measurable amount of favoritism that people give to strangers who have names similar to those they are close with. In contrast, could there be negative bias? If you hate your boss and then meet a friend of a friend with a similar name, are you more likely to have a negative first impression? How could you even measure this? </p>\n\n<p>Thanks, looking forward to the discussion!</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/askscience/comments/o7pgeu/does_name_familiarity_create_unintended_bias/",
  "subreddit": "askscience",
  "id": "o7pgeu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know there has been some research done around unintended name discrimination,\nespecially in hiring practices, but I was wondering if there is any data on more\ngeneral familiarity bias?\n\nA recent example that made me think of this - I'm in sales and I've been having\nkind of a stressful morning,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "意図しない名前の差別については、いくつかの研究がなされていることは知っています。\nしかし、より一般的な親近感バイアスについてのデータはあるのでしょうか？\n一般的な親近感バイアスについてのデータはあるのでしょうか？\n\n最近の例では、私は営業職に就いていますが、ストレスの多い朝を過ごしていました。\n私は営業の仕事をしていますが、朝からちょっとしたストレスを感じていて...",
      "title": "名前の親しみやすさが意図しないバイアスを生む？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道有一些研究是围绕着非故意的姓名歧视进行的。\n但我想知道是否有关于更多的熟悉度偏见的数据？\n一般的熟悉度偏见？\n\n最近的一个例子让我想到了这个问题--我是做销售的，我一直有\n一个压力很大的早晨，...",
      "title": "名字的熟悉程度是否会造成无意的偏见？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道有一些研究是圍繞着非故意的姓名歧視進行的。\n但我想知道是否有關於更多的熟悉度偏見的數據？\n一般的熟悉度偏見？\n\n最近的一個例子讓我想到了這個問題--我是做銷售的，我一直有\n一個壓力很大的早晨，...",
      "title": "名字的熟悉程度是否會造成無意的偏見？"
    }
  ]
}