{
  "author": "glacierfield",
  "original_created_utc": 1637888095,
  "title": "Hillary Clinton knows exactly what she's talking about with crypto",
  "created_utc": 1637897870,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m sure everyone has seen the clip by now. If you haven&#39;t Google it. </p>\n\n<p>USD is the world&#39;s reserve currency, china holds over 3T USD alone. USD stabilizes local currencies around the globe. If China decides to cash out their USD for a cryptocurrency. It would crash the USD, US economy and the US would lose it&#39;s world power status. This is a very real threat that in my opinion is inevitable</p>\n\n<p>If this scares you I would recommend researching the technology behind crypto and buying the best one. Even a small amount of a crypto that will become the world&#39;s new reserve currency will lead to incredible gains. I have my opinion on which crypto I think will succeed but I don&#39;t want to be labeled a shill</p>\n</div><!-- SC_ON -->",
  "score": 727,
  "permalink": "/r/CryptoCurrency/comments/r2az4i/hillary_clinton_knows_exactly_what_shes_talking/",
  "subreddit": "CryptoCurrency",
  "id": "r2az4i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm sure everyone has seen the clip by now. If you haven't Google it.\n\nUSD is the world's reserve currency, china holds over 3T USD alone. USD\nstabilizes local currencies around the globe. If China decides to cash out their\nUSD for a cryptocurrency. It would crash the USD, US economy and the US…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もう誰もがこのクリップを見たことがあるだろう。もし見ていなければ、グーグルで検索してみてください。\n\n米ドルは世界の基軸通貨で、中国は一人で3千万米ドル以上を保有しています。米ドル\n世界中の地域通貨を安定させています。もし中国が米ドルを現金化して\n米ドルを暗号通貨に交換したら それは米ドルを暴落させ、米国経済と米国の...",
      "title": "ヒラリー・クリントンは暗号のことをよく知っている"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信每个人现在都已经看到了这个片段。如果你没看过，请谷歌一下。\n\n美元是世界上的储备货币，仅中国就持有超过3吨的美元。美元\n稳定了全球各地的货币。如果中国决定把他们的\n美元换成加密货币。这将使美元、美国经济和美国崩溃...",
      "title": "希拉里-克林顿很清楚她在说什么加密货币的问题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信每個人現在都已經看到了這個片段。如果你沒看過，請谷歌一下。\n\n美元是世界上的儲備貨幣，僅中國就持有超過3噸的美元。美元\n穩定了全球各地的貨幣。如果中國決定把他們的\n美元換成加密貨幣。這將使美元、美國經濟和美國崩潰...",
      "title": "希拉里-克林頓很清楚她在說什麼加密貨幣的問題"
    }
  ]
}