{
  "author": "diamondtoes_69",
  "the_new_excerpt": "I recently sold all of my positions I didn't see a future in anymore as they\nwere still relics from when I first started out and didn't really know what I\nwas doing. Some I sold at a slight loss, on others I broke even, but now I want\nto restructure my portfolio. I'm currently invested in 3 sectors…",
  "original_created_utc": 1623480600,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は最近、将来性がないと判断したポジションをすべて売却しました。\n自分が何をしているのかよくわからなかった最初の頃の遺物だったからです。\nしていたのです。いくつかのポジションは若干の損失を出しましたが、他のポジションは収支がプラスになりましたが、今は自分のポートフォリオを再構築したいと思っています。\n今、私は自分のポートフォリオを再構築したいと思っています。現在、私は3つのセクターに投資しています...",
      "title": "ポートフォリオを分散させたい。数ヶ月先、あるいは数年先に最も成長すると予測されるセクターは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近卖掉了所有我认为没有前途的头寸，因为它们\n因为它们仍然是我刚开始工作时的遗物，我并不真正了解自己在做什么。\n在做什么。有些我是以轻微的亏损卖出的，有些则是收支平衡，但现在我想\n重组我的投资组合。我目前投资于3个行业...",
      "title": "我想使我的投资组合多样化。哪些行业预计在未来几个月或者说几年内会有最大的增长？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近賣掉了所有我認爲沒有前途的頭寸，因爲它們\n因爲它們仍然是我剛開始工作時的遺物，我並不真正瞭解自己在做什麼。\n在做什麼。有些我是以輕微的虧損賣出的，有些則是收支平衡，但現在我想\n重組我的投資組合。我目前投資於3個行業...",
      "title": "我想使我的投資組合多樣化。哪些行業預計在未來幾個月或者說幾年內會有最大的增長？"
    }
  ],
  "title": "I want to diversify my portfolio: Which sectors are projected to have the most growth in the coming months or rather years?",
  "created_utc": 1623550558,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently sold all of my positions I didn&#39;t see a future in anymore as they were still relics from when I first started out and didn&#39;t really know what I was doing.\nSome I sold at a slight loss, on others I broke even, but now I want to restructure my portfolio.\nI&#39;m currently invested in 3 sectors but that&#39;ll turn into 2 once I take profits on my biotech positions as biotech typically performs really well around this time of year.\nSo the 2 sectors that I&#39;m left with are tech and cannabis, which have both done very well for me, but now I want to add back to my portfolio and I&#39;m not sure which sectors to look into.\nI&#39;d appreciate any info/ advice!</p>\n</div><!-- SC_ON -->",
  "score": 50,
  "permalink": "/r/stocks/comments/ny0mze/i_want_to_diversify_my_portfolio_which_sectors/",
  "subreddit": "stocks",
  "id": "ny0mze",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009743455
}