{
  "author": "MouthwashInMyEyes",
  "original_created_utc": 1632589090,
  "title": "If there is a gender pay gap for the same job, why would employers even hire men since they have to pay them more for the same job?",
  "created_utc": 1632602900,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There have been posts similar to this, explaining that many studies are comparing the pay of men and women across different jobs. However, I am interested in comparing pay in the same job. I am an engineering student and as part of my final term, I am taking a class which includes discussion of gender inclusivity and diversity in the workplace.</p>\n\n<p>All the readings in my course state it as fact that women make less than men in the same job, specifically in engineering. Here is where I am confused,</p>\n\n<p>If employers could get away with paying women less than men for truly the same job and same work, then why would employers hire men at all? It would follow that the company would just hire all or mostly women because it would be a better deal. What am I missing?</p>\n\n<p>Side question: Universities lower the admission grades for females and visible minorities for my program and I believe most STEM programs. I am curious if this is actually effective in getting more diversity into STEM. In a program like engineering where up to 40% of students drop out or change programs, it looks like the university is setting people up for failure by accepting students who do not perform up to the regular admission grades. I have personally noticed that in my first year, there was a lot of diversity and it was a pretty even mix over race, creed, colour, gender, etc. Now in my final year, its almost entirely males (still of mixed ethnicities).   </p>\n\n<p>Please help me understand all this! Thanks.</p>\n</div><!-- SC_ON -->",
  "score": 118,
  "permalink": "/r/NoStupidQuestions/comments/pvati5/if_there_is_a_gender_pay_gap_for_the_same_job_why/",
  "subreddit": "NoStupidQuestions",
  "id": "pvati5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There have been posts similar to this, explaining that many studies are\ncomparing the pay of men and women across different jobs. However, I am\ninterested in comparing pay in the same job. I am an engineering student and as\npart of my final term, I am taking a class which includes discussion of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これと似たような投稿がありましたが、多くの研究が、異なる職種の男女の給与を比較していることを説明しています。\n男性と女性の給与を異なる仕事で比較する研究が多いことを説明しています。しかし、私は\n同じ仕事での給与比較に興味があります。私は工学部の学生で、最終学期の一環として\n私は工学系の学生で、最終学期の一環として、議論を含むクラスを取っています。",
      "title": "同じ仕事でも男女間の賃金格差があれば、雇用主はなぜ男性を雇うのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "已经有类似的帖子，解释说许多研究是\n比较不同工作中的男女薪酬。然而，我\n对比较同一工作的薪酬感兴趣。我是一名工程学学生，作为\n作为最后一个学期的一部分，我正在上一堂课，其中包括讨论......",
      "title": "如果同样的工作存在性别薪酬差距，那么雇主为什么还要雇用男性，因为他们必须为同样的工作支付更多的薪酬？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "已經有類似的帖子，解釋說許多研究是\n比較不同工作中的男女薪酬。然而，我\n對比較同一工作的薪酬感興趣。我是一名工程學學生，作爲\n作爲最後一個學期的一部分，我正在上一堂課，其中包括討論......",
      "title": "如果同樣的工作存在性別薪酬差距，那麼僱主爲什麼還要僱用男性，因爲他們必須爲同樣的工作支付更多的薪酬？"
    }
  ]
}