{
  "author": "Ozzmosis1234",
  "original_created_utc": 1650722730,
  "title": "Is it weird if i take a nap with my daughter?",
  "created_utc": 1650733596,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello. I have a 8month baby. She is the most important thing in my life. I sometimes come home from work pretty tired, and if my daughter is in our bed sleeping i usually just lie in bed with her. Some relatives of my girlfriend told me that is weird, that dads shouldnt sleep with their daughters. I think its pretty fucked up that they think that way..&lt;/p&gt;\n\n&lt;p&gt;I have a friend that has an 8 y o daughter, and once told me that one of the best feelings is when his daughter comes in the middle of the night and hugs him or his wife and sleep with them. Is really that bad or weird? Those questionings sometimes make me question if im being a good dad or if maybe im wrong and i should put more distance. &lt;/p&gt;\n\n&lt;p&gt;Worst part of being a dad is being questioned for every little thing, even if you&amp;#39;re doing things with every little piece of love you can give.&lt;/p&gt;\n\n&lt;p&gt;Sorry for my english. And thank you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 143,
  "permalink": "/r/NoStupidQuestions/comments/ua6688/is_it_weird_if_i_take_a_nap_with_my_daughter/",
  "subreddit": "NoStupidQuestions",
  "id": "ua6688",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hello. I have a 8month baby. She is the most important thing in my life. I\nsometimes come home from work pretty tired, and if my daughter is in our bed\nsleeping i usually just lie in bed with her. Some relatives of my girlfriend\ntold me that is weird, that dads shouldnt sleep with their daughters.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。私には8ヶ月の赤ちゃんがいます。彼女は私の人生で最も重要なものです。I\n仕事から疲れて帰ってくることがあります。\n私はいつも娘と一緒にベッドで横になっています。私のガールフレンドの親族は\n父親が娘と寝るのはおかしいと言われましたが...。",
      "title": "娘と一緒に昼寝をするのは変ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好。我有一个8个月的孩子。她是我生命中最重要的东西。I\n有时下班回家很累，如果我女儿在我们的床上\n睡觉，我通常就躺在床上陪她。我女朋友的一些亲戚\n告诉我这很奇怪，爸爸们不应该和女儿一起睡，....。",
      "title": "如果我和我女儿一起睡午觉，这很奇怪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好。我有一個8個月的孩子。她是我生命中最重要的東西。I\n有時下班回家很累，如果我女兒在我們的牀上\n睡覺，我通常就躺在牀上陪她。我女朋友的一些親戚\n告訴我這很奇怪，爸爸們不應該和女兒一起睡，....。",
      "title": "如果我和我女兒一起睡午覺，這很奇怪嗎？"
    }
  ]
}