{
  "author": "hashzzz",
  "original_created_utc": 1652675092,
  "title": "We are in the phase of disbelief in crypto",
  "created_utc": 1652697488,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just look around you, left and right people and quitting crypto because &amp;quot;they don&amp;#39;t believe in it anymore&amp;quot; but the true reason why is because they aren&amp;#39;t money off it anymore.  If we were in a bull market where we would see green candles all day everyday they wouldn&amp;#39;t dare get out but the opposite they&amp;#39;d be dancing all day and screaming crypto to the mooooooooon. &lt;/p&gt;\n\n&lt;p&gt;This sub has many posts of people saying goodbye recently and I think these events mark a possible bottom for the market in my opinion. &lt;/p&gt;\n\n&lt;p&gt;Crypto fundamentals never changed, bitcoin is still scarce, ethereum is still the biggest smart contract platform,  and the other developments are also the same. &lt;/p&gt;\n\n&lt;p&gt;If you are a Dev you will probably enjoy this time to build a project and have time to polish it and gather backers and a member base. &lt;/p&gt;\n\n&lt;p&gt;If you are a normal investor then you aren&amp;#39;t having a great time looking at the color red everyday.&lt;/p&gt;\n\n&lt;p&gt;Right now most of the retail beginners exited, \nit&amp;#39;s just me, you and the whales.&lt;/p&gt;\n\n&lt;p&gt;Thank you for reading\nHave a nice day!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 343,
  "permalink": "/r/CryptoCurrency/comments/uqnjre/we_are_in_the_phase_of_disbelief_in_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "uqnjre",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Just look around you, left and right people and quitting crypto because \"they\ndon't believe in it anymore\" but the true reason why is because they aren't\nmoney off it anymore. If we were in a bull market where we would see green\ncandles all day everyday they wouldn't dare get out but the opposite…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "周りを見てみると、右往左往している人たちが「もう信じられない」という理由で暗号をやめています。\nが、本当の理由は、「もう信じられないから」なのです。\nというのが本当の理由です。もし私たちが強気市場にいて、毎日緑のローソク足が見えるとしたら\n毎日一日中緑のロウソクを見るような強気相場だったら、彼らは降りる勇気はないでしょうが、その逆です...",
      "title": "暗号に不信感を抱いている段階である"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "看看你的周围，左右两边的人都在退出加密货币，因为 \"他们不再相信它了\"。\n但真正的原因是他们不再相信它。\n赚钱了。如果我们处在一个牛市，每天都能看到绿色的\n蜡烛，他们就不敢出来，但情况恰恰相反......",
      "title": "我们正处于对加密货币不相信的阶段"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "看看你的周圍，左右兩邊的人都在退出加密貨幣，因爲 \"他們不再相信它了\"。\n但真正的原因是他們不再相信它。\n賺錢了。如果我們處在一個牛市，每天都能看到綠色的\n蠟燭，他們就不敢出來，但情況恰恰相反......",
      "title": "我們正處於對加密貨幣不相信的階段"
    }
  ]
}