{
  "author": "hashzzz",
  "original_created_utc": 1652675092,
  "title": "We are in the phase of disbelief in crypto",
  "created_utc": 1652697488,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just look around you, left and right people and quitting crypto because &amp;quot;they don&amp;#39;t believe in it anymore&amp;quot; but the true reason why is because they aren&amp;#39;t money off it anymore.  If we were in a bull market where we would see green candles all day everyday they wouldn&amp;#39;t dare get out but the opposite they&amp;#39;d be dancing all day and screaming crypto to the mooooooooon. &lt;/p&gt;\n\n&lt;p&gt;This sub has many posts of people saying goodbye recently and I think these events mark a possible bottom for the market in my opinion. &lt;/p&gt;\n\n&lt;p&gt;Crypto fundamentals never changed, bitcoin is still scarce, ethereum is still the biggest smart contract platform,  and the other developments are also the same. &lt;/p&gt;\n\n&lt;p&gt;If you are a Dev you will probably enjoy this time to build a project and have time to polish it and gather backers and a member base. &lt;/p&gt;\n\n&lt;p&gt;If you are a normal investor then you aren&amp;#39;t having a great time looking at the color red everyday.&lt;/p&gt;\n\n&lt;p&gt;Right now most of the retail beginners exited, \nit&amp;#39;s just me, you and the whales.&lt;/p&gt;\n\n&lt;p&gt;Thank you for reading\nHave a nice day!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 343,
  "permalink": "/r/CryptoCurrency/comments/uqnjre/we_are_in_the_phase_of_disbelief_in_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "uqnjre",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Just look around you, left and right people and quitting crypto because \"they\ndon't believe in it anymore\" but the true reason why is because they aren't\nmoney off it anymore. If we were in a bull market where we would see green\ncandles all day everyday they wouldn't dare get out but the opposite…"
}