{
  "author": "joe_sausage",
  "original_created_utc": 1640117473,
  "title": "What the heck was Dr. Bronner talking about on the soap label? Was any of it rooted in fact?",
  "created_utc": 1640129536,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There’s a pretty famous brand of “new age” liquid soap in the US called Dr. Bronner’s.  The label has since been changed (to sell their book), but for a very long time the label was end-to-end text that was, and I know I’m being blunt here, totally crazy.  There’s “quotes” from Muhammad, Abraham, and lots of anecdotes that seem to be rooted in early Abrahamic religious lore.  There are also some outlandish facts about Dr. Bronner himself.  Is any of this accurate or true?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 124,
  "permalink": "/r/AskHistorians/comments/rln1py/what_the_heck_was_dr_bronner_talking_about_on_the/",
  "subreddit": "AskHistorians",
  "id": "rln1py",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There’s a pretty famous brand of “new age” liquid soap in the US called Dr.\nBronner’s. The label has since been changed (to sell their book), but for a very\nlong time the label was end-to-end text that was, and I know I’m being blunt\nhere, totally crazy. There’s “quotes” from Muhammad, Abraham, and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アメリカには、「ニューエイジ」リキッドソープのブランドとして、かなり有名なDr.があります。\nBronner'sというのがあります。その後、ラベルが変更されましたが（彼らの本を売るために）、非常に長い間\n長い間、ラベルは端から端までテキストで書かれていて、それは、ぶっきらぼうな言い方ですが\n完全に狂っている。ムハンマド、エイブラハム、そして...の「名言」があります。",
      "title": "Dr.ブロナーが石鹸のラベルに書いてあったことは、いったい何だったのだろう？事実に基づいているのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在美国有一个相当著名的 \"新时代 \"液体肥皂品牌，叫Dr.\nBronner's。标签后来被改变了（为了销售他们的书），但在很长一段时间里\n但在很长一段时间里，标签上的文字都是端端正正的，我知道我说得很直白\n我知道我在这里说得很直白，完全是疯狂的。有来自穆罕默德、亚伯拉罕的 \"引言\"，还有...",
      "title": "布朗纳博士在肥皂标签上说的到底是什么呢？它有任何的事实依据吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在美國有一個相當著名的 \"新時代 \"液體肥皂品牌，叫Dr.\nBronner's。標籤後來被改變了（爲了銷售他們的書），但在很長一段時間裏\n但在很長一段時間裏，標籤上的文字都是端端正正的，我知道我說得很直白\n我知道我在這裏說得很直白，完全是瘋狂的。有來自穆罕默德、亞伯拉罕的 \"引言\"，還有...",
      "title": "布朗納博士在肥皂標籤上說的到底是什麼呢？它有任何的事實依據嗎？"
    }
  ]
}