{
  "author": "andrewhartanto",
  "the_new_excerpt": "I feel like XLM has not been getting too much love compared to other coins here,\nHow many of you guys used XLM to move out or move in into exchange?\n\nXLM is doing what stablecoins was meant to do, which is reliable, low fees,\ninstant, and virtually accepted everywhere. It is the go-to crypto in…",
  "original_created_utc": 1621041660,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここでは、他のコインに比べてXLMはあまり愛されていないように感じます。\n皆さんの中で、XLMを使って取引所を出たり入ったりした人はどれくらいいますか？\n\nXLMは安定したコインの役割を果たしています。それは、信頼性が高く、手数料が低く、即時性があり、事実上どこでも受け入れられます。\nXLMは、信頼性が高く、手数料が低く、即時性があり、事実上どこでも受け入れられる安定したコインです。それは、信頼性が高く、手数料が低く、即時性があり、事実上どこでも受け入れられるものです。XLMは...",
      "title": "XLM感謝のスレッド"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得与其他币种相比，XLM在这里没有得到太多的喜爱。\n你们有多少人用XLM移出或移入交易所？\n\nXLM正在做稳定币所要做的事情，即可靠、低费用。\n它是可靠的，低费用的，即时的，而且几乎到处都接受。它是一个很好的加密货币。",
      "title": "XLM欣赏主题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得與其他幣種相比，XLM在這裏沒有得到太多的喜愛。\n你們有多少人用XLM移出或移入交易所？\n\nXLM正在做穩定幣所要做的事情，即可靠、低費用。\n它是可靠的，低費用的，即時的，而且幾乎到處都接受。它是一個很好的加密貨幣。",
      "title": "XLM欣賞主題"
    }
  ],
  "title": "XLM Appreciation Thread",
  "created_utc": 1621054135,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I feel like XLM has not been getting too much love compared to other coins here, How many of you guys used XLM to move out or move in into exchange?</p>\n\n<p>XLM is doing what stablecoins was meant to do, which is reliable, low fees, instant, and virtually accepted everywhere. It is the go-to crypto in which you move from exchange to exchange to buy rare alts. And it does not get enough credit it deserves.</p>\n\n<p>We may not even hold more than a 1% portion of our portfolio on XLM, but let&#39;s appreciate the beauty of the technology and acknowledge XLM as one of the only true currencies between seas of utility cryptos. It is also among few cryptos that have mass adoption already in the space </p>\n\n<h1>Because of that, XLM will always have a special place in our heart &lt;3</h1>\n</div><!-- SC_ON -->",
  "score": 408,
  "permalink": "/r/CryptoCurrency/comments/ncnt68/xlm_appreciation_thread/",
  "subreddit": "CryptoCurrency",
  "id": "ncnt68",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590798338
}