{
  "author": "BeanDaddyMac",
  "the_new_excerpt": "Here's the thing about legal filings and CYA turns of phrase- the lawyers who\ncraft these documents do so based on precedent and are encouraged to reuse legal\nterms as much as possible in order to avoid misinterpretation. Turns out you can\nactually search the SEC's vast archive of 10-K filings for…",
  "original_created_utc": 1616547682,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "关于法律文件和CYA用语的问题是这样的--律师们谁\n拟订这些文件时以先例为依据，并鼓励重复使用法律文件。\n尽可能多的术语，以避免误解。原来你可以\n其实搜索美国证券交易委员会的大量档案10 -K文件... ...",
      "title": "关于GME 10-K文件中 \"他们只是在定义空头挤压 \"和 \"这种措辞在SEC文件中很常见 \"的回应。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關於法律文件和CYA用語的問題是這樣的--律師們誰\n擬訂這些文件時以先例爲依據，並鼓勵重複使用法律文件。\n儘可能多的術語，以避免誤解。原來你可以\n其實搜索美國證券交易委員會的大量檔案10 -K文件... ...",
      "title": "關於GME 10-K文件中 \"他們只是在定義空頭擠壓 \"和 \"這種措辭在SEC文件中很常見 \"的迴應。"
    }
  ],
  "title": "With regard to the \"they're just defining a short squeeze\" and \"this language is common in SEC filings\" response to the GME 10-K filing",
  "created_utc": 1616556568,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Here&#39;s the thing about legal filings and CYA turns of phrase- the lawyers who craft these documents do so based on precedent and are encouraged to reuse legal terms as much as possible in order to avoid misinterpretation. Turns out you can actually search the SEC&#39;s vast archive of 10-K filings for specific phrases. Let&#39;s see just how common this language is, shall we? First, the actual excerpt from the 10K filing in its entirety:</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p><strong>The market price of our Class A Common Stock has been extremely volatile and may continue to be volatile due to numerous circumstances beyond our control.</strong>  </p>\n\n<p>Stock markets in general and our stock price in particular have recently experienced extreme price and volume fluctuations that have often been unrelated or disproportionate to the operating performance of those companies and our company. For example, on January 28, 2021, our Class A Common Stock experienced an intra-day trading high of $483.00 per share and a low of $112.25 per share. In addition, from January 11, 2021 to March 17, 2021, the closing price of our Class A Common Stock on the NYSE ranged from as low as $19.94 to as high as $347.51 and daily trading volume ranged from approximately 7,060,000 to 197,200,000 shares. During this time, we have not experienced any material changes in our financial condition or results of operations that would explain such price volatility or trading volume. These broad market fluctuations may adversely affect the trading price of our Class A Common Stock. In particular, a large proportion of our Class A Common Stock has been and may continue to be traded by short sellers which has put and may continue to put pressure on the supply and demand for our Class A Common Stock, further influencing volatility in its market price. Additionally, these and other external factors have caused and may continue to cause the market price and demand for our Class A Common Stock to fluctuate substantially, which may limit or prevent our stockholders from readily selling their shares of our common stock and may otherwise negatively affect the liquidity of our Class A Common Stock.  </p>\n\n<p><strong>A “short squeeze” due to a sudden increase in demand for shares of our Class A Common Stock that largely exceeds supply has led to, and may continue to lead to, extreme price volatility in shares of our Class A Common Stock.</strong>  </p>\n\n<p>Investors may purchase shares of our Class A Common Stock to hedge existing exposure or to speculate on the price of our Class A Common Stock. Speculation on the price of our Class A Common Stock may involve long and short exposures. To the extent aggregate short exposure exceeds the number of shares of our Class A Common Stock available for purchase on the open market, investors with short exposure may have to pay a premium to repurchase shares of our Class A Common Stock for delivery to lenders of our Class A Common Stock. Those repurchases may in turn, dramatically increase the price of shares of our Class A Common Stock until additional shares of our Class A Common Stock are available for trading or borrowing. This is often referred to as a “short squeeze.”A large proportion of our Class A Common Stock has been and may continue to be traded by short sellers which may increase the likelihood that our Class A Common Stock will be the target of a short squeeze. A short squeeze has led and could continue to lead to volatile price movements in shares of our Class A Common Stock that are unrelated or disproportionate to our operating performance or prospects and, once investors purchase the shares of our Class A Common Stock necessary to cover their short positions, the price of our Class A Common Stock may rapidly decline. Stockholders that purchase shares of our Class A Common Stock during a short squeeze may lose a significant portion of their investment.  </p>\n\n<p><strong>Future sales of a substantial amount of our Class A Common Stock in the public markets by our insiders, or the perception that these sales may occur, may cause the market price of our Class A Common Stock to decline.</strong>  </p>\n\n<p>Our employees, directors and officers, and their affiliates, hold substantial amounts of shares of our Class A Common Stock. Sales of a substantial number of such shares by these stockholders, or the perception that such sales will occur, may cause the market price of our Class A Common Stock to decline. Other than restrictions on trading that arise under securities laws [(or pursuant to our securities trading policy that is intended to facilitate compliance with securities laws)], including the prohibition on trading in securities by or on behalf of a person who is aware of nonpublic material information, we have no</p>\n</blockquote>\n\n<p>*Total number of 10-K filings roughly estimated by the number of hits for the phrase &quot;report&quot; over five year (254,473 filings) and ten year (513,510 filings) periods.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>How often does &quot;extremely volatile&quot; appear in SEC 10-K filings?</strong></li>\n</ul>\n\n<p>The phrase is found in <strong>968</strong> of all 10-K filings in the past 5 years or <strong>0.38%</strong> of all filings</p>\n\n<p><a href=\"https://www.sec.gov/edgar/search/#/q=%2522extremely%2520volatile%2522&amp;filter_forms=10-K\">https://www.sec.gov/edgar/search/#/q=%2522extremely%2520volatile%2522&amp;filter_forms=10-K</a></p>\n\n<p>The phrase is found in <strong>2,268</strong> of all 10-k filings of the past 10 years or 0.44**%** of all filings</p>\n\n<p><a href=\"https://www.sec.gov/edgar/search/#/q=%2522extremely%2520volatile%2522&amp;dateRange=10y&amp;filter_forms=10-K\">https://www.sec.gov/edgar/search/#/q=%2522extremely%2520volatile%2522&amp;dateRange=10y&amp;filter_forms=10-K</a></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>How often does &quot;short squeeze&quot; appear in SEC 10-K filings?</strong></li>\n</ul>\n\n<p>The phrase is found in <strong>58</strong> of all 10K filings in the past 5 years or <strong>0.023%</strong> of all filings</p>\n\n<p><a href=\"https://www.sec.gov/edgar/search/#/q=%2522short%2520squeeze%2522&amp;filter_forms=10-K\">https://www.sec.gov/edgar/search/#/q=%2522short%2520squeeze%2522&amp;filter_forms=10-K</a></p>\n\n<p>The phrase is found in <strong>87</strong> of all of all 10k filings of the past 10 years or <strong>0.017%</strong> of all filings</p>\n\n<p><a href=\"https://www.sec.gov/edgar/search/#/q=%2522short%2520squeeze%2522&amp;dateRange=10y&amp;filter_forms=10-K\">https://www.sec.gov/edgar/search/#/q=%2522short%2520squeeze%2522&amp;dateRange=10y&amp;filter_forms=10-K</a></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>How often does &quot;short exposure exceeds the number of shares&quot; appear in SEC 10-K filings?</strong></li>\n</ul>\n\n<p>The phrase is found in <strong>26</strong> of all 10-K filings in the past 5 years or <strong>0.010%</strong> of all filings</p>\n\n<p><a href=\"https://www.sec.gov/edgar/search/#/q=%2522short%2520exposure%2520exceeds%2520the%2520number%2520of%2520shares%2522%2520&amp;filter_forms=10-K\">https://www.sec.gov/edgar/search/#/q=%2522short%2520exposure%2520exceeds%2520the%2520number%2520of%2520shares%2522%2520&amp;filter_forms=10-K</a></p>\n\n<p>The phrase is found in <strong>51</strong> of all of all 10-k filings of the past 10 years or <strong>0.009%</strong> of all filings</p>\n\n<p><a href=\"https://www.sec.gov/edgar/search/#/q=%2522short%2520exposure%2520exceeds%2520the%2520number%2520of%2520shares%2522%2520&amp;dateRange=10y&amp;filter_forms=10-K\">https://www.sec.gov/edgar/search/#/q=%2522short%2520exposure%2520exceeds%2520the%2520number%2520of%2520shares%2522%2520&amp;dateRange=10y&amp;filter_forms=10-K</a></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>How often do &quot;short sellers&quot; appear in SEC 10-K filings?</strong></li>\n</ul>\n\n<p>The phrase is found in <strong>361</strong> of all 10-K filings in the past 5 years or <strong>0.14%</strong> of all filings</p>\n\n<p><a href=\"https://www.sec.gov/edgar/search/#/q=%2522short%2520sellers%2522&amp;filter_forms=10-K\">https://www.sec.gov/edgar/search/#/q=%2522short%2520sellers%2522&amp;filter_forms=10-K</a></p>\n\n<p>The phrase is found in <strong>754</strong> of all of all 10-k filings of the past 10 years or <strong>0.15%</strong> of all filings</p>\n\n<p><a href=\"https://www.sec.gov/edgar/search/#/q=%2522short%2520sellers%2522&amp;dateRange=10y&amp;filter_forms=10-K\">https://www.sec.gov/edgar/search/#/q=%2522short%2520sellers%2522&amp;dateRange=10y&amp;filter_forms=10-K</a></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>How often do &quot;insiders&quot; appear in SEC 10-K filings?</strong></li>\n</ul>\n\n<p>The phrase is found in <strong>4,503</strong> of all 10-K filings in the past 5 years or <strong>1.8%</strong> of all filings</p>\n\n<p><a href=\"https://www.sec.gov/edgar/search/#/q=%2522insiders%2522&amp;filter_forms=10-K\">https://www.sec.gov/edgar/search/#/q=%2522insiders%2522&amp;filter_forms=10-K</a></p>\n\n<p>The phrase is found in <strong>8,893</strong> of all 10-k filings of the past 10 years or <strong>1.7%</strong> of all filings</p>\n\n<p><a href=\"https://www.sec.gov/edgar/search/#/q=%2522insiders%2522&amp;dateRange=10y&amp;filter_forms=10-K\">https://www.sec.gov/edgar/search/#/q=%2522insiders%2522&amp;dateRange=10y&amp;filter_forms=10-K</a></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>How often does &quot;perception that such sales will occur&quot; appear in SEC 10-K filings?</strong></li>\n</ul>\n\n<p>The phrase is found in <strong>67</strong> of all 10-K filings in the past 5 years or <strong>0.026%</strong> of all filings</p>\n\n<p><a href=\"https://www.sec.gov/edgar/search/#/q=%2522perception%2520that%2520such%2520sales%2520will%2520occur%2522&amp;filter_forms=10-K\">https://www.sec.gov/edgar/search/#/q=%2522perception%2520that%2520such%2520sales%2520will%2520occur%2522&amp;filter_forms=10-K</a></p>\n\n<p>The phrase is found in <strong>109</strong> of all 10-k filings of the past 10 years or <strong>0.021%</strong> of all filings</p>\n\n<p><a href=\"https://www.sec.gov/edgar/search/#/q=%2522perception%2520that%2520such%2520sales%2520will%2520occur%2522&amp;dateRange=10y&amp;filter_forms=10-K\">https://www.sec.gov/edgar/search/#/q=%2522perception%2520that%2520such%2520sales%2520will%2520occur%2522&amp;dateRange=10y&amp;filter_forms=10-K</a></p>\n\n<p>&#x200B;</p>\n\n<p>So yeah...this type of disclosure <strong>IS EXTREMELY RARE.</strong></p>\n\n<p>edit: formatting</p>\n</div><!-- SC_ON -->",
  "score": 28877,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/966iDtrJcLGWwK3ExeZ29af_WhuuCbf7JgjJIFs98nk.jpg?auto=webp&s=258b2aa4ecdcbc5e365d0ac10462d66c7c138422",
          "width": 206,
          "height": 204
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/966iDtrJcLGWwK3ExeZ29af_WhuuCbf7JgjJIFs98nk.jpg?width=108&crop=smart&auto=webp&s=bc6c04a4e04694478d7b80ac13c3da62cef72e5f",
            "width": 108,
            "height": 106
          }
        ],
        "variants": {},
        "id": "w8sM8HOcYwiCaSLW4ohd6k1vGjnBpH4ZJHdERI6HUWc"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/wallstreetbets/comments/mbtpwa/with_regard_to_the_theyre_just_defining_a_short/",
  "subreddit": "wallstreetbets",
  "id": "mbtpwa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752832265
}