{
  "author": "Reckless_Satoshi",
  "original_created_utc": 1645988356,
  "title": "Everyone says we need easy and cheap markets for non-KYC BTC... So I have done this.",
  "created_utc": 1646016683,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;TL;TR:&lt;/strong&gt; Bitcoin is slowly being captured by the tight grip on the fiat on/off ramps. We need convenient, fast and cheap markets for non-KYC bitcoin. I have worked my ass off for two months to create an easy and private P2P exchange that uses solely lightning hold invoices. It is called RoboSats and I believe it can potentially rival centralized exchanges in ease of use and fees, while being totally private and having a close to custody-less pipeline. You can use it from your smartphone right now: it is straightforward to use even for the very noob. The platform is fully open source and will always be. It works quite well, but it is experimental: read the info and trade only small amounts. Open it now with Tor Browser: &lt;a href=\"http://robosats6tkf3eva7x2voqso3a5wcorsnw34jveyxfqi2fu7oyheasid.onion/\"&gt;Onion Link&lt;/a&gt;&lt;/p&gt;\n\n&lt;h2&gt;Background&lt;/h2&gt;\n\n&lt;p&gt;One of the main threats for the Bitcoin network and its users is the ability of a few entities to control the fiat on/off-ramps. The tight grip on them allows for censorship and surveillance by linking funds with identities and strips the freedom away from Bitcoin. While there exists several peer-to-peer alternatives to centralized exchanges, these are rather technical, slow and costly. Most users still prefer the convenience of a centralized exchange at the cost of their privacy and a difficult initial setup (submit passport, selfie-video, etc). Things do not look too well for a truly free Bitcoin ecosystem.&lt;/p&gt;\n\n&lt;p&gt;However, there are opportunities too. Using the Lightning Network it might very well be possible to create a very user friendly, safe, fast and cheap peer-to-peer market. By using hold invoices as fidelity bonds and trade escrows, trust/security can be maximized. It will never be as secure as an on-chain escrow. But one can dream that an open p2p market like that could rival the ease of use of centralized exchanges and have very low fees too; yet, with minimal privacy invasion and a close to custody-less trade pipeline.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/yvd6dqtpafk81.jpg?width=1200&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=6293fafd6fffffd1b6d792134007e588bdc19dd9\"&gt;Wait, is that u/Reckless_Satoshi wearing a hoodie... AGAIN!?. He must have been up to something.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;For the last two months I have been locked in my basement, feeding protein shakes and listening to SaylorWaves instead of sleeping... yeah, living the good life. And... I have also built &lt;strong&gt;RoboSats&lt;/strong&gt; during that time :)&lt;/p&gt;\n\n&lt;h2&gt;What is RoboSats?&lt;/h2&gt;\n\n&lt;p&gt;It is a BTC/FIAT peer-to-peer exchange over lightning. It simplifies matchmaking and minimizes the need for trust. RoboSats focuses in privacy, speed and user friendliness. RoboSats is an &lt;a href=\"https://github.com/reckless-satoshi/robosats\"&gt;open source project&lt;/a&gt;.&lt;/p&gt;\n\n&lt;h2&gt;How does it work?&lt;/h2&gt;\n\n&lt;p&gt;Alice wants to buy bitcoin privately. She generates an avatar in RoboSats homepage (AnonymousAlice01) and stores her random token safely so she can recover the avatar later. She creates a new buy order. Bob wants to sell bitcoin and takes Alice&amp;#39;s order. Both have to post a small bond using lightning to prove they are &lt;strong&gt;real robots&lt;/strong&gt;. Then, Bob posts the trade collateral also using a lightning hold invoice. RoboSats locks the invoice until Bob confirms he received the fiat, then the satoshis are released to Alice. Enjoy your satoshis Alice!&lt;/p&gt;\n\n&lt;p&gt;At no point, Alice and Bob have to entrust the bitcoin to each other. In case they have a conflict, RoboSats staff will help resolving the dispute. You can find a step-by-step description of the trade pipeline in &lt;a href=\"https://github.com/Reckless-Satoshi/robosats/blob/main/README.md#how-it-works\"&gt;How It Works&lt;/a&gt;&lt;/p&gt;\n\n&lt;h2&gt;Use it now&lt;/h2&gt;\n\n&lt;p&gt;Click the link below to start buying/selling non-KYC Bitcoin, no registration or any other BS required. Just visit the site using TOR Browser (Mobile works great). Brave is OK too:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://robosats6tkf3eva7x2voqso3a5wcorsnw34jveyxfqi2fu7oyheasid.onion\"&gt;&lt;strong&gt;RoboSats&lt;/strong&gt;6tkf3eva7x2voqso3a5wcorsnw34jveyxfqi2fu7oyheasid.onion&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;... if it does not work, you must download &lt;a href=\"https://www.torproject.org/download/\"&gt;Tor Browser for your device&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/ciii1r5wafk81.png?width=3407&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=ea29fb95e54c4a7c4184675754b8a8f3ff124dfc\"&gt;They usually place fancy screenshots of the apps in the play store / apple store. This is just my attempt to conform to expectations. There is more to RoboSats that what can be seen here, make sure to read the how-to-use guide.&lt;/a&gt;&lt;/p&gt;\n\n&lt;h2&gt;In more details&lt;/h2&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Here a full guide with two complete walk-throughs: &lt;a href=\"https://github.com/reckless-satoshi/robosats/blob/main/docs/how-to-use.md\"&gt;&lt;strong&gt;How to Use RoboSats&lt;/strong&gt;&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;You can also read the full list of features in the &lt;a href=\"https://github.com/reckless-satoshi/robosats/releases/tag/v0.1.0-mvp\"&gt;&lt;strong&gt;RoboSats v0.1.0 stack release&lt;/strong&gt;&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h2&gt;What payment methods are accepted?&lt;/h2&gt;\n\n&lt;p&gt;Basically all of them as long as they are FAST. You can write down your preferred payment method(s). You will have to match with a peer who also accepts that method as you pay each other directly. The step in the contract to exchange fiat has an expiry time of 24 hours before a dispute is automatically opened. So, I highly recommend using instant fiat payment rails.&lt;/p&gt;\n\n&lt;h2&gt;Are there trade limits?&lt;/h2&gt;\n\n&lt;p&gt;Maximum single trade size is 500,000 satoshis to minimize lightning routing failure. There is no limits to the number of trades per day. A robot can only have one order at a time. However, you can use multiple robots simultaneously in different browsers (remember to back up your robot tokens!). At launch RoboSats is limited to a maximum of 100 public orders at a time (...just a temporary safety measure).&lt;/p&gt;\n\n&lt;h2&gt;Is RoboSats private?&lt;/h2&gt;\n\n&lt;p&gt;RoboSats will absolutely never ask you for your name, email, phone number, country or ID. RoboSats does not custody your funds and does not care pinch about who you are. For best anonymity use Tor Browser and access the .onion hidden site.&lt;/p&gt;\n\n&lt;p&gt;Your trading peer is the only one who can potentially guess anything about you. Keep your chat short and concise. Avoid providing non-essential information other than strictly necessary for the fiat payment. But don&amp;#39;t forget to be polite! :)&lt;/p&gt;\n\n&lt;h2&gt;What are the risks?&lt;/h2&gt;\n\n&lt;p&gt;This is an experimental lightning application, things could go wrong. Trade small amounts! The seller faces the same charge-back risk as with any other peer-to-peer service. I do not recommend using Paypal or credit cards.&lt;/p&gt;\n\n&lt;h2&gt;What is the trust model?&lt;/h2&gt;\n\n&lt;p&gt;The buyer and the seller never have to trust each other. Some trust on RoboSats is needed since linking the seller&amp;#39;s hold invoice and buyer payment is not atomic (research ongoing). In addition, disputes are solved by the RoboSats staff.&lt;/p&gt;\n\n&lt;p&gt;To be totally clear. Trust requirements are minimized. However, there is still one way RoboSats could run away with your satoshis: by not releasing the satoshis to the buyer. It could be argued that such move is not in the platform&amp;#39;s interest as it would badly damage the reputation for a small payout. However, you should hesitate and only trade small quantities at a time. For large amounts use an on-chain escrow service such as Bisq. You can build more trust on RoboSats by inspecting the &lt;a href=\"https://github.com/reckless-satoshi/robosats\"&gt;source code&lt;/a&gt;.&lt;/p&gt;\n\n&lt;h2&gt;What are the fees?&lt;/h2&gt;\n\n&lt;p&gt;The trading fee is 0.2%. That&amp;#39;s about the same as Binance, yet you will not have to pay a &lt;em&gt;withdrawal fine&lt;/em&gt; (that same fee covers for the routing to your wallet). The fidelity bonds are sized 1% with respect the trade amount, these are automatically returned.&lt;/p&gt;\n\n&lt;h2&gt;What happens if RoboSats suddenly disappears?&lt;/h2&gt;\n\n&lt;p&gt;Your sats will return to you. Any hold invoice that is not settled will automatically return even if RoboSats goes down forever. This is true for both, locked bonds and trading escrows. However, there is a small window between the seller confirms FIAT RECEIVED and the moment the buyer receives the satoshis when the funds could be permanently lost if RoboSats disappears. This window is about 1 second long, so make sure to have enough inbound liquidity to avoid routing failures. If you have any problem, reach out trough the RoboSats public channels (&lt;a href=\"https://t.me/robosats\"&gt;Telegram&lt;/a&gt;).&lt;/p&gt;\n\n&lt;h2&gt;Is RoboSats legal in my country?&lt;/h2&gt;\n\n&lt;p&gt;In most countries using RoboSats is no different than using Ebay or Craiglist. Your regulation may vary. It is your responsibility to comply (lmao, sorry but I have to write this). If your country is shitty about p2p commerce start thinking about moving, it will only get worse.&lt;/p&gt;\n\n&lt;h2&gt;Can I access it without Tor Browser / Brave?&lt;/h2&gt;\n\n&lt;p&gt;Not yet, and why should you? Use Tor and improve your privacy! However, the site &lt;strong&gt;robosats.com&lt;/strong&gt; will be accessible at some point. It will be a simple web2tor bridge to widen the access to any browser and improve URL memorability... It comes with a huge set of caveats for privacy and security: so you should always use the .onion site and Tor Browser if possible!&lt;/p&gt;\n\n&lt;h2&gt;You make RoboSats a great place&lt;/h2&gt;\n\n&lt;p&gt;If you like what you see, there is a lot of ways you can become part of this open project. The most needed contributions are: develop code (funding might be possible, ask); create tutorials and guides; open outbound LN channels towards &lt;a href=\"https://1ml.com/node/0282eb467bc073833a039940392592bf10cf338a830ba4e392c1667d7697654c7e\"&gt;RoboSats node (1ML)&lt;/a&gt;; create art (logo, banners, they are shitty rn); and help newbies in our community groups (Telegram: &lt;a href=\"https://t.me/robosats\"&gt;English&lt;/a&gt; and &lt;a href=\"https://t.me/robosats_es\"&gt;Spanish&lt;/a&gt;). Needless to say, simply using the platform, telling a friend or sharing your idea/criticism is a huge help!&lt;/p&gt;\n\n&lt;p&gt;Give it a try now and contribute to make this open source project glorious!&lt;/p&gt;\n\n&lt;p&gt;Cheers, &lt;/p&gt;\n\n&lt;p&gt;Reckless_Satoshi&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 306,
  "permalink": "/r/Bitcoin/comments/t2v44r/everyone_says_we_need_easy_and_cheap_markets_for/",
  "subreddit": "Bitcoin",
  "id": "t2v44r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "TL;TR: Bitcoin is slowly being captured by the tight grip on the fiat on/off\nramps. We need convenient, fast and cheap markets for non-KYC bitcoin. I have\nworked my ass off for two months to create an easy and private P2P exchange that\nuses solely lightning hold invoices. It is called RoboSats and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TL;TR: ビットコインは、フィアットのオン/オフのタイトなグリップによって徐々に捕捉されつつある。\nランプがあります。非KYCビットコインのための便利で速く、安い市場が必要です。私は\n2ヶ月かけて、簡単でプライベートなP2P取引所を作りました。\n雷のインボイスだけを使っています。これはRoboSatsと呼ばれ...",
      "title": "非KYCのBTCを簡単かつ安価に購入できるマーケットが必要だと誰もが言う...。ということで、こんなことをやってみました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TL;TR: 比特币正慢慢地被紧紧抓住法币的上/下限。\n坡道。我们需要方便、快捷、便宜的非KYC比特币市场。我已经\n我花了两个月的时间创建了一个简单的私人P2P交易所。\n只使用闪电持有发票。它被称为RoboSats和...",
      "title": "每个人都说我们需要方便和廉价的非KYC BTC市场...... 所以我已经做了这个。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TL;TR: 比特幣正慢慢地被緊緊抓住法幣的上/下限。\n坡道。我們需要方便、快捷、便宜的非KYC比特幣市場。我已經\n我花了兩個月的時間創建了一個簡單的私人P2P交易所。\n只使用閃電持有發票。它被稱爲RoboSats和...",
      "title": "每個人都說我們需要方便和廉價的非KYC BTC市場...... 所以我已經做了這個。"
    }
  ]
}