{
  "author": "Bl1zza",
  "the_new_excerpt": "Now let me start off by saying that I am very bullish on Palantir when talking\nabout the company, their software, and their operations. However, when it comes\nto the stock, I don’t really see a lot of short-term growth (talking 1-2 years).\n\nMy strong conviction was ever increased as I watched their…",
  "original_created_utc": 1614174208,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "现在我先说一下，我非常看好Palantir，当谈到\n关于公司，他们的软件和他们的操作。然而，当涉及到\n的股票，我真的没有看到很多的短期增长（谈1-2年）。\n\n我坚定的信念是曾经增加的，因为我看了他们的...",
      "title": "$PLTR--提醒一下。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在我先說一下，我非常看好Palantir，當談到\n關於公司，他們的軟件和他們的操作。然而，當涉及到\n的股票，我真的沒有看到很多的短期增長（談1-2年）。\n\n我堅定的信念是曾經增加的，因爲我看了他們的...",
      "title": "$PLTR--提醒一下。"
    }
  ],
  "title": "$PLTR - A word of caution.",
  "created_utc": 1614180777,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Now let me start off by saying that I am very bullish on Palantir when talking about the company, their software, and their operations. However, when it comes to the stock, I don’t really see a lot of short-term growth (talking 1-2 years). </p>\n\n<p>My strong conviction was ever increased as I watched their Demo-Day livestream a while back. I believe that Karp’s vision of them being the world’s most important software company may very well become true someday. My conviction in Palantir and their future is perhaps stronger than on any other growing company. \nHowever, when it comes to their stock price and valuation, I am standing back. I initially bought in at around $15 dollars, saw the first run up to $30 and then averaged up after the drop to around $22. I held and sold my entire position at the peak of $44 (I got lucky timing, for once). This was before the lock-up period ended. I knew this price point wouldn’t hold with the lock-up approaching so I sold my position after more than doubling my money.</p>\n\n<p>Now that the lock-up has expired, the amount of added shares to the public has resulted in a large shift in relation of the share price - to - market cap. I would’ve found yesterdays $24 as a buying opportunity BEFORE the lock-up, but not anymore. Palantir now has a $50B market cap on ~ $1B annual revenue, that is insane, no matter the future growth prospects. They will not reach even close to $2B in revenue in 2021 and people are shouting $50 or $100 share price targets for EOY. This is utterly detached from reality. A $50 price tag would mean a ~ $100B market cap on +$1B in revenue, and $100 would be a $200B market cap. No matter the current nature of the market, valuations still do matter (no matter how alarmingly little at the moment). </p>\n\n<p>I would personally love to re-enter Palantir, but I am not going to at the current prices. I’d re-enter at around or sub $30B market cap. The share price would have to obviously drop quite significantly, but the lock-up period has drastically changed the relation of the share-price to Palantir’s valuation when compared to the time before the lock-up. I personally do not see anything above $20 as a steal, but rather overvalued in current and short-term (1-2 years) perspectives. I understand people looking long-term (that’s great), but I’d rather enter something else for now than sail relatively flat for the next year or two on current valuations. </p>\n\n<p>I’ll probably get downvoted to the core of the earth because Palantir has that same unhinged and almost religious following that Tesla has for example, but this is just my level-headed two cents to my fellow retail investors. </p>\n\n<p>DISCLAIMER: This is not financial advice. I like the company, I like the stock, I do not have any open positions on $PLTR as of this moment.</p>\n</div><!-- SC_ON -->",
  "score": 2626,
  "permalink": "/r/stocks/comments/lrd6uz/pltr_a_word_of_caution/",
  "subreddit": "stocks",
  "id": "lrd6uz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332887589
}