{
  "author": "SoonMoonn",
  "original_created_utc": 1641060103,
  "title": "Ethereum’s gas fees ARE a problem. No matter what you think.",
  "created_utc": 1641145588,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Trust me, I’m an Ethereum fan more than anyone. But what I hate is that people aren’t ready to hear hate about their favorite crypto.&lt;/p&gt;\n\n&lt;p&gt;Even at a low of $5 right now. Ethereum’s fees are way too high than it should be - like Vitalik once said “the internet of money should not cost 5 cents a transaction.”&lt;/p&gt;\n\n&lt;p&gt;$5 is 100x more than 5 cents.&lt;/p&gt;\n\n&lt;p&gt;Hopefully L2 solutions are able to fix that problem or Ethereum 2.0 can by moving to PoS.&lt;/p&gt;\n\n&lt;p&gt;Whichever way, if they manage to succeed with solving this problem. Ethereum will be the biggest thing since sliced bread.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 831,
  "permalink": "/r/CryptoCurrency/comments/rtomon/ethereums_gas_fees_are_a_problem_no_matter_what/",
  "subreddit": "CryptoCurrency",
  "id": "rtomon",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Trust me, I’m an Ethereum fan more than anyone. But what I hate is that people\naren’t ready to hear hate about their favorite crypto.\n\nEven at a low of $5 right now. Ethereum’s fees are way too high than it should\nbe - like Vitalik once said “the internet of money should not cost 5 cents…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "<!-- SC_OFF --><div class=\"md\"><p>Trust me, I'm an Ethereum fan than more than.\n誰よりも しかし、私が嫌いなのは、人々が自分たちのことを嫌うのを聞く準備ができていないことです。\n</p> <p>今、5ドルという安値でも。イーサリアムの手数料は\nヴィタリックがかつて言ったように、「The internet of...」は、あるべき姿よりも高すぎる。",
      "title": "イーサリアムのガス代は問題です。どう考えても"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "<! -- SC_OFF --><div class=\"md\"><p>相信我，我是以太坊的粉丝，比任何人都更喜欢。\n我比任何人都更喜欢以太坊。但我讨厌的是，人们还没有准备好听到关于他们最喜欢的加密货币的仇恨。\n</p> <p>即使现在是5美元的低价。以太坊的费用\n就像Vitalik曾经说过的 \"互联网的...\"。",
      "title": "以太坊的气体费用是一个问题。不管你怎么想。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "<! -- SC_OFF --><div class=\"md\"><p>相信我，我是以太坊的粉絲，比任何人都更喜歡。\n我比任何人都更喜歡以太坊。但我討厭的是，人們還沒有準備好聽到關於他們最喜歡的加密貨幣的仇恨。\n</p> <p>即使現在是5美元的低價。以太坊的費用\n就像Vitalik曾經說過的 \"互聯網的...\"。",
      "title": "以太坊的氣體費用是一個問題。不管你怎麼想。"
    }
  ]
}