{
  "author": "friends4fun82",
  "the_new_excerpt": "First, I’m a scientist, I base my opinions on public information. I own the\nstocks mentioned this post. I am not asking for advise. I want make a case for\ngoing long on two examples. I hope to give serious insight into biotech value\nstocks. After covid, better therapies for common diseases will…",
  "original_created_utc": 1612494113,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我是一个科学家，我的观点是基于公开信息。我拥有\n股票提到这个帖子。我不是在征求意见。我想做一个案例\n去做多两个例子。希望能给大家认真剖析生物技术的价值。\n股票。科维德之后，常见疾病的更好治疗方法将...",
      "title": "你应该如何投资生物技术股票。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我是一個科學家，我的觀點是基於公開信息。我擁有\n股票提到這個帖子。我不是在徵求意見。我想做一個案例\n去做多兩個例子。希望能給大家認真剖析生物技術的價值。\n股票。科維德之後，常見疾病的更好治療方法將...",
      "title": "你應該如何投資生物技術股票。"
    }
  ],
  "title": "How you should invest in biotech stocks.",
  "created_utc": 1612508546,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First, I’m a scientist, I base my opinions on public information. I own the stocks mentioned this post. <strong>I am not asking for advise.</strong> I want make a case for going long on two examples. <strong>I hope to give serious insight into biotech value stocks.</strong> After covid, better therapies for common diseases will soar. I am doing an analysis bases on science. Here it is:</p>\n\n<p>In cancer, we think of immunotherapies (IOs) and targeted therapies as breakthrough treatments. Unfortunately, most patients are either not eligible to use IOs or relapse after a couple of years and then go into traditional, more aggressive chemotherapies regimes.</p>\n\n<p>When cancer patients are on chemo, they are also medicated with glucocorticoids, which are potent anti-inflammatory molecules. Glucocorticoids suppress the immune system and activate the glucocorticoid receptor (GR), a receptor associated with tumor progression. Stress signaling molecules, like cortisol, also activate GR. Therefore, natural stress and anti-inflammatory medications  can work against the standard of care (chemo) in most advanced cancer patient.</p>\n\n<p>Corcept Therapeutics Inc. and ORIC Pharmaceuticals are developing inhibitors of GR. They Are currently running clinical trials of their drug candidates in combination with chemotherapies. By inhibiting the effect of cortisol and glucocorticoids, their drugs could increase the efficacy of traditional chemotherapies. Right now, both companies are running clinical trials on specific cancer types, but their products are potentially useful in many other indications.</p>\n\n<p><strong>CORT and ORIC at set to disrupts the delivery of chemotherapies</strong>. This is a huge market segment, since almost every cancer patient end up using ‘flawed’ chemotherapy combinations. I believe these two companies are a great investment target.</p>\n\n<p>In the next few days, Corcept and ORIC are giving public presentations. If you want to invest, do your own due diligence.</p>\n\n<p>My two cents.</p>\n</div><!-- SC_ON -->",
  "score": 25,
  "permalink": "/r/investing/comments/lcxueg/how_you_should_invest_in_biotech_stocks/",
  "subreddit": "investing",
  "id": "lcxueg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123198809
}