{
  "author": "MySweetDoge2",
  "original_created_utc": 1628883684,
  "title": "Favorite scam coin?",
  "created_utc": 1628897838,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello all,</p>\n\n<p>I know that we all ignore scam coins as a rule of thumb. However I can clearly see that many people actually buy shit coins on regular basis. Most of them are scams, some of them are memes and some have actual real life use and are generally underrated.</p>\n\n<p>So I would like to ask you:</p>\n\n<p>- Have you invested in some shit coin (and by shit coin I mean a coin outside top 20-50 coins)<br/>\n- What percentage of your portfolio is scattered across those coins?<br/>\n- Do you actually believe in the project or do it for the gainz?<br/>\n- How and why did you decide to give for fiat (or precious BTC, ETH) for coin that has an animal in its name</p>\n\n<p>I don&#39;t want you to share the name of the coin (it&#39;s not a shill post). Just tell us how did you went down the road</p>\n</div><!-- SC_ON -->",
  "score": 227,
  "permalink": "/r/CryptoCurrency/comments/p3shxg/favorite_scam_coin/",
  "subreddit": "CryptoCurrency",
  "id": "p3shxg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello all,\n\nI know that we all ignore scam coins as a rule of thumb. However I can clearly\nsee that many people actually buy shit coins on regular basis. Most of them are\nscams, some of them are memes and some have actual real life use and are\ngenerally underrated.\n\nSo I would like to ask you:\n\n-…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n私たちは経験則上、詐欺コインを無視していることは知っています。しかし、私は明らかに\n多くの人が実際にクソコインを定期的に購入していることがわかります。それらのほとんどは\n詐欺コイン、ミームコイン、そして実際に使用されているコインがあります。\n一般的に過小評価されています。\n\nそこで、あなたにお聞きしたいのです。\n\n-...",
      "title": "好きな詐欺コインは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n我知道，我们都忽略了诈骗币，这是一条经验之谈。然而，我可以清楚地看到\n看到许多人实际上是在定期购买垃圾币。他们中的大多数是\n骗局，其中一些是备忘录，一些有实际的现实生活用途，并且普遍被低估。\n通常被低估。\n\n所以我想问问你。\n\n-...",
      "title": "最喜欢的骗局硬币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n我知道，我們都忽略了詐騙幣，這是一條經驗之談。然而，我可以清楚地看到\n看到許多人實際上是在定期購買垃圾幣。他們中的大多數是\n騙局，其中一些是備忘錄，一些有實際的現實生活用途，並且普遍被低估。\n通常被低估。\n\n所以我想問問你。\n\n-...",
      "title": "最喜歡的騙局硬幣？"
    }
  ]
}