{
  "author": "100OrangeJuice100",
  "original_created_utc": 1636334661,
  "title": "Why didn't North Korea reform its economy in the 80s and 90s while neighboring communist countries like China and Vietnam did?",
  "created_utc": 1636369614,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>China and Vietnam&#39;s economic reforms are largely credited with rapid economic growth and increases in quality of life/standard of living. This begs the question, why didn&#39;t North Korea open up their economy if all their ideological counterparts in East and South East Asia did so and to a great success?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/qp2the/why_didnt_north_korea_reform_its_economy_in_the/",
  "subreddit": "AskHistorians",
  "id": "qp2the",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "China and Vietnam's economic reforms are largely credited with rapid economic\ngrowth and increases in quality of life/standard of living. This begs the\nquestion, why didn't North Korea open up their economy if all their ideological\ncounterparts in East and South East Asia did so and to a great…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "中国とベトナムの経済改革は、急速な経済成長と生活の質・水準の向上に大きく貢献しています。\n急速な経済成長と生活の質・水準の向上に大きく貢献しています。ここで疑問が生じます。\n東アジアや東南アジアのイデオロギー的な仲間が経済開放を行い、大きな成果を上げているのに、なぜ北朝鮮は経済開放を行わなかったのか、という疑問が生まれます。\n東アジアや東南アジアのイデオロギー的なカウンターパートが経済開放を行い、大きな成果を上げているのに、なぜ北朝鮮は経済開放を行わなかったのだろうか。",
      "title": "80年代から90年代にかけて、中国やベトナムといった近隣の共産主義国が行った経済改革を、なぜ北朝鮮は行わなかったのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "中国和越南的经济改革在很大程度上得益于快速的经济增长和生活质量的提高。\n中国和越南的经济改革在很大程度上得益于快速的经济增长和生活质量/生活水平的提高。这就提出了一个问题\n这就提出了一个问题：如果东亚和东南亚的所有意识形态国家都开放了经济，为什么朝鲜不开放经济？\n如果东亚和东南亚的同行都这样做了，并且在很大程度上，朝鲜为什么不开放经济？",
      "title": "为什么朝鲜在80年代和90年代没有进行经济改革，而中国和越南等邻近的共产主义国家却进行了改革？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "中國和越南的經濟改革在很大程度上得益於快速的經濟增長和生活質量的提高。\n中國和越南的經濟改革在很大程度上得益於快速的經濟增長和生活質量/生活水平的提高。這就提出了一個問題\n這就提出了一個問題：如果東亞和東南亞的所有意識形態國家都開放了經濟，爲什麼朝鮮不開放經濟？\n如果東亞和東南亞的同行都這樣做了，並且在很大程度上，朝鮮爲什麼不開放經濟？",
      "title": "爲什麼朝鮮在80年代和90年代沒有進行經濟改革，而中國和越南等鄰近的共產主義國家卻進行了改革？"
    }
  ]
}