{
  "author": "Silverslade1",
  "original_created_utc": 1625205247,
  "title": "Does anyone else find the new video player on Reddit mobile a pain in the butt?",
  "created_utc": 1625218329,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m finding it’s just really not very user friendly. I try to just go straight to the comments and then it full screens the video and starts playing it, then I have to press the comment button again to view the comments. Then the video continues playing taking up half the screen so I have to swipe up to get a full screen of comments, while it still continues to play the video in the background even though I can’t see it. </p>\n\n<p>What gives? This was a terrible design choice and whoever did it should be sacked.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/oc3y2h/does_anyone_else_find_the_new_video_player_on/",
  "subreddit": "TooAfraidToAsk",
  "id": "oc3y2h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m finding it’s just really not very user friendly. I try to just go straight\nto the comments and then it full screens the video and starts playing it, then I\nhave to press the comment button again to view the comments. Then the video\ncontinues playing taking up half the screen so I have to swipe…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ただ、あまり使い勝手がよくないと感じています。コメントに直接アクセスしようとすると\nコメントを見ようとすると、ビデオが全画面表示されて再生されてしまいます。\nもう一度コメントボタンを押さないとコメントが表示されません。その後、ビデオが\n画面の半分を使って再生し続けるので、スワイプしないといけない...。",
      "title": "Reddit mobileの新しいビデオプレーヤーが面倒だと感じる人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我发现它真的不是很好用。我试图直接进入\n到评论，然后它就全屏显示视频并开始播放，然后我不得不再次按下评论按钮。\n我不得不再次按下评论按钮来查看评论。然后视频\n继续播放，占据了一半的屏幕，所以我不得不滑动......",
      "title": "还有人觉得Reddit手机上的新视频播放器很麻烦吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我發現它真的不是很好用。我試圖直接進入\n到評論，然後它就全屏顯示視頻並開始播放，然後我不得不再次按下評論按鈕。\n我不得不再次按下評論按鈕來查看評論。然後視頻\n繼續播放，佔據了一半的屏幕，所以我不得不滑動......",
      "title": "還有人覺得Reddit手機上的新視頻播放器很麻煩嗎？"
    }
  ]
}