{
  "author": "homrqt",
  "original_created_utc": 1638124926,
  "title": "Make your argument for what coin would be best as an actual currency and not just a store of value encouraging people to hoard and hodl.",
  "created_utc": 1638142219,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bitcoin is insanely popular, and its adoption as official state currency in several countries is nothing short of amazing. Bitcoin has benefited greatly from name recognition and being the first crypto to moon. But despite its successes, it doesn&#39;t necessarily make it the best candidate for being used as an actual currency, especially now 13 years later we have so many other coins to pick from. Now, without trying to pump your own bags, what coin do you think would make the best virtual currency if it were mass adopted at this point in time? I have my own thoughts but I&#39;ll reserve my own opinion because I want to see what others have to say.</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/CryptoCurrency/comments/r4b5ld/make_your_argument_for_what_coin_would_be_best_as/",
  "subreddit": "CryptoCurrency",
  "id": "r4b5ld",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Bitcoin is insanely popular, and its adoption as official state currency in\nseveral countries is nothing short of amazing. Bitcoin has benefited greatly\nfrom name recognition and being the first crypto to moon. But despite its\nsuccesses, it doesn't necessarily make it the best candidate for being…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインは非常に人気があり、いくつかの国で正式な国家通貨として採用されています。\nいくつかの国で国家通貨として採用されていることは、驚くべきことです。ビットコインは、知名度の高さと\nビットコインは、知名度の高さと、最初に登場した暗号であることから、大きな恩恵を受けています。しかし、その成功にもかかわらず\nしかし、成功しているにもかかわらず、それは必ずしもビットコインが最高の候補であるとは言えません。",
      "title": "実際の通貨としてはどのようなコインが最適なのか、人々が溜め込んだり隠したりするような単なる価値の貯蔵庫ではないのか、といったことを主張してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比特币非常流行，它在几个国家被采用为官方国家货币，这一点令人惊讶。\n它在一些国家被采用为官方国家货币，这简直是太不可思议了。比特币已经大大受益于\n从名字的认知度和成为第一种上市的加密货币中受益匪浅。但是，尽管它\n但尽管它取得了成功，这并不一定使它成为最佳的候选人。",
      "title": "请提出你的论点，什么硬币最适合作为实际的货币，而不仅仅是鼓励人们囤积和囤积的价值储存。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣非常流行，它在幾個國家被採用爲官方國家貨幣，這一點令人驚訝。\n它在一些國家被採用爲官方國家貨幣，這簡直是太不可思議了。比特幣已經大大受益於\n從名字的認知度和成爲第一種上市的加密貨幣中受益匪淺。但是，儘管它\n但儘管它取得了成功，這並不一定使它成爲最佳的候選人。",
      "title": "請提出你的論點，什麼硬幣最適合作爲實際的貨幣，而不僅僅是鼓勵人們囤積和囤積的價值儲存。"
    }
  ]
}