{
  "author": "tanmay1010",
  "original_created_utc": 1642359583,
  "title": "Moody's has downgraded El Salvador Sovereign Debt in the light of their recent Bitcoin purchases. This is a good time to remember that Moody's have conned the investors once during 2008 sub prime crisis by issuing sellout ratings to companies of shady background.",
  "created_utc": 1642402244,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When all these rating agencies are in line to issue OR have already issued their latest ratings to companies/countries/states/etc holding cryptocurrency in their balance sheet, this could be a good time to remind ourselves that these rating agencies have shown their true colours once when they had rated the likes of Lehman Brothers with a stable rating. (That they are capable of conning the common investor with their duplicitous analysis.)&lt;/p&gt;\n\n&lt;p&gt;Many prominent leaders have commented on this issue- one of them is by former principal deputy associate attorney general Bill Baer, who had to say this about Moody&amp;#39;s:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;Moody&amp;#39;s failed to adhere to its own credit rating standards and fell short on its pledge of transparency in the run-up to the Great Recession.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;This is not just true for Moody&amp;#39;s but every other analysts would have a price attached to their heads. If you have connections and you sit in an influential position, you could pretty much influence the ratings of a bankrupt company. &lt;/p&gt;\n\n&lt;p&gt;So a friendly reminder- most of these ratings don&amp;#39;t mean shit.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/CryptoCurrency/comments/s5iq18/moodys_has_downgraded_el_salvador_sovereign_debt/",
  "subreddit": "CryptoCurrency",
  "id": "s5iq18",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "When all these rating agencies are in line to issue OR have already issued their\nlatest ratings to companies/countries/states/etc holding cryptocurrency in their\nbalance sheet, this could be a good time to remind ourselves that these rating\nagencies have shown their true colours once when they had…"
}