{
  "author": "tanmay1010",
  "original_created_utc": 1642359583,
  "title": "Moody's has downgraded El Salvador Sovereign Debt in the light of their recent Bitcoin purchases. This is a good time to remember that Moody's have conned the investors once during 2008 sub prime crisis by issuing sellout ratings to companies of shady background.",
  "created_utc": 1642402244,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When all these rating agencies are in line to issue OR have already issued their latest ratings to companies/countries/states/etc holding cryptocurrency in their balance sheet, this could be a good time to remind ourselves that these rating agencies have shown their true colours once when they had rated the likes of Lehman Brothers with a stable rating. (That they are capable of conning the common investor with their duplicitous analysis.)&lt;/p&gt;\n\n&lt;p&gt;Many prominent leaders have commented on this issue- one of them is by former principal deputy associate attorney general Bill Baer, who had to say this about Moody&amp;#39;s:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;Moody&amp;#39;s failed to adhere to its own credit rating standards and fell short on its pledge of transparency in the run-up to the Great Recession.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;This is not just true for Moody&amp;#39;s but every other analysts would have a price attached to their heads. If you have connections and you sit in an influential position, you could pretty much influence the ratings of a bankrupt company. &lt;/p&gt;\n\n&lt;p&gt;So a friendly reminder- most of these ratings don&amp;#39;t mean shit.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/CryptoCurrency/comments/s5iq18/moodys_has_downgraded_el_salvador_sovereign_debt/",
  "subreddit": "CryptoCurrency",
  "id": "s5iq18",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "When all these rating agencies are in line to issue OR have already issued their\nlatest ratings to companies/countries/states/etc holding cryptocurrency in their\nbalance sheet, this could be a good time to remind ourselves that these rating\nagencies have shown their true colours once when they had…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これらの格付け機関がすべて発行する予定である、またはすでに発行している場合\n暗号通貨を保有する企業/国/州/その他に対する最新の格付けは以下の通りです。\nこの機会に、これらの格付けが、「日本が世界に誇れるものであること」を再認識する必要があります。\nかつて、このような事態に陥ったとき、その本領を発揮したことがある。",
      "title": "Moody'sは、最近のビットコイン購入に鑑みて、エルサルバドル・ソブリン債を格下げした。これは、2008年のサブプライム危機の際、Moody'sが怪しい企業に売り切り格付けを発行し、投資家を騙したことを思い出すのに良い機会である。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当所有这些评级机构都在排队发布或已经发布他们的\n对在其资产负债表中持有加密货币的公司/国家/州/等的最新评级。\n时，这可能是一个提醒我们自己的好时机，这些评级机构\n这些评级机构已经显示了他们的真实面目，当他们有...",
      "title": "鉴于萨尔瓦多最近购买了比特币，穆迪已经下调了他们的主权债务评级。这是一个很好的时间来记住，穆迪在2008年次贷危机期间曾欺骗投资者，向有黑幕背景的公司发出出售评级。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當所有這些評級機構都在排隊發佈或已經發布他們的\n對在其資產負債表中持有加密貨幣的公司/國家/州/等的最新評級。\n時，這可能是一個提醒我們自己的好時機，這些評級機構\n這些評級機構已經顯示了他們的真實面目，當他們有...",
      "title": "鑑於薩爾瓦多最近購買了比特幣，穆迪已經下調了他們的主權債務評級。這是一個很好的時間來記住，穆迪在2008年次貸危機期間曾欺騙投資者，向有黑幕背景的公司發出出售評級。"
    }
  ]
}