{
  "author": "AvidasOfficial",
  "the_new_excerpt": "I'm sure this will get downvoted but if you have entered crypto with the hopes\nof making some profit ignore the cult like mentality of holding indefinitely and\nset yourself a price target at which you would be happy to take some profit.\n\nHolding long term has always been a solid tactic but to hold…",
  "original_created_utc": 1615685271,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我相信这一定会被降权，但如果你进入加密技术的希望是\n赚取一些利润，而忽略了无限期持有的邪教心态和\n给自己设定一个目标价位，在这个价位上你会很高兴地获得一些利润。\n\n长期持有一直是一种稳健的策略，但要想持...",
      "title": "不要因为网上的人告诉你这样做，就盲目HODL。给自己设定一个目标价位，达到目标价位就获利!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信這一定會被降權，但如果你進入加密技術的希望是\n賺取一些利潤，而忽略了無限期持有的邪教心態和\n給自己設定一個目標價位，在這個價位上你會很高興地獲得一些利潤。\n\n長期持有一直是一種穩健的策略，但要想持...",
      "title": "不要因爲網上的人告訴你這樣做，就盲目HODL。給自己設定一個目標價位，達到目標價位就獲利!"
    }
  ],
  "title": "Don't just HODL blindly because people on the Internet told you to do so. Set yourself a target price & take profit when you reach it!",
  "created_utc": 1615704058,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m sure this will get downvoted but if you have entered crypto with the hopes of making some profit ignore the cult like mentality of holding indefinitely and set yourself a price target at which you would be happy to take some profit.</p>\n\n<p>Holding long term has always been a solid tactic but to hold with no exit plan or target is just barmy. </p>\n\n<p>Whether it be a specific price target or a multiplication of your holdings think about which point you would be happy to take profit and stick to it.</p>\n\n<p>For me personally whenever an investment makes 3x I cash out two thirds doubling my initial investment and then hold the last third in the hope that it does it again.</p>\n</div><!-- SC_ON -->",
  "score": 1034,
  "permalink": "/r/CryptoCurrency/comments/m4kn5n/dont_just_hodl_blindly_because_people_on_the/",
  "subreddit": "CryptoCurrency",
  "id": "m4kn5n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147377078
}