{
  "author": "Good-Rooster-9736",
  "the_new_excerpt": "I know things look rough in our community. Mania has turned into tribalism.\nBitcoin is down more than 30% off it's all time high and may go down even more.\nHere's a little story about why I still believe and will always believe in\ncrypto.\n\nI was 25 when the 2007-2008 financial crisis hit. I had a…",
  "original_created_utc": 1621272566,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちのコミュニティが荒れているのは知っています。マニアは部族主義に変わってしまいました。\nビットコインは史上最高値から30％以上下落し、さらに下がる可能性もあります。\nここで、私がまだ信じている理由、そしてこれからも信じていく理由について少しお話します。\n暗号を信じています。\n\n2007年から2008年にかけての金融危機のとき、私は25歳でした。私が持っていたのは...",
      "title": "苦しい時にこそ、自分らしさを見つける"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道我们社区的情况看起来很糟糕。狂热已经变成了部落主义。\n比特币从它的历史最高点下跌了30%以上，而且可能会跌得更多。\n这里有一个小故事，说明为什么我仍然相信并将永远相信\n加密货币。\n\n2007-2008年金融危机爆发时，我才25岁。我有一个...",
      "title": "在困难的时候你会发现自己是谁"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道我們社區的情況看起來很糟糕。狂熱已經變成了部落主義。\n比特幣從它的歷史最高點下跌了30%以上，而且可能會跌得更多。\n這裏有一個小故事，說明爲什麼我仍然相信並將永遠相信\n加密貨幣。\n\n2007-2008年金融危機爆發時，我才25歲。我有一個...",
      "title": "在困難的時候你會發現自己是誰"
    }
  ],
  "title": "You find out who you are when times are tough",
  "created_utc": 1621288154,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know things look rough in our community. Mania has turned into tribalism. Bitcoin is down more than 30% off it&#39;s all time high and may go down even more. Here&#39;s a little story about why I still believe and will always believe in crypto.</p>\n\n<p>I was 25 when the 2007-2008 financial crisis hit. I had a great thing going. Married the woman of my dreams and was about to have a kid. Well the insurance brokerage I worked for went belly up. I was staring unemployment in the face with a kid on the way. I was scared. </p>\n\n<p>I was also pissed off. The snakes that put us normal folks out of work were getting bailed out. Where the fuck was my bail out? Things got so bad for us that we lost our house. Had to move in with our folks. I felt like a loser. I had panic attacks. It got so bad that I was hospitalized for a week. I went to therapy and my therapist said one thing to me that changed my life forever: &quot;You don’t know who you are until you face and survive hard times”</p>\n\n<p>So what did I do? I hustled, man. I worked 3 jobs; fixing computers for old ladies, landscaping, food service, anything I could find.  Finally landed a good entry level gig in healthcare and worked my way up over the last 12 years. Well guess what? I lost my job this year because covid crushed the industry I was in. This time around I wasn&#39;t even stressed. I lived everyday over the last 12 years like I&#39;d lose my job tomorrow. I found work in 3 days. I didn&#39;t take a dime of unemployment.</p>\n\n<p>I got into crypto in 2016. I&#39;ve made money, I&#39;ve gotten rekt but one thing is for certain I never stopped believing. Even if crypto doesn&#39;t become the financial standard for humanity in my lifetime I continue to study, invest, discuss with anyone that will listen so that hopefully my kids can live in a world where hedge fund managers don&#39;t determine that outcomes of their lives. </p>\n\n<p>If you weren’t prepared for this dip, mentally or financially then take a minute to reflect. Who are you now? Who do you want to become? Staring a charts all day isn’t going to fix anything. Take a break. Focus on something else for a minute. Money is a conduit to accomplish goals not the goal. </p>\n\n<p>Anyways be smart out there. Things will get better. Crypto is not going away. We&#39;ve survived worse.</p>\n</div><!-- SC_ON -->",
  "score": 1161,
  "permalink": "/r/CryptoCurrency/comments/nemcnw/you_find_out_who_you_are_when_times_are_tough/",
  "subreddit": "CryptoCurrency",
  "id": "nemcnw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590799675
}