{
  "author": "ItWouldBeGrand",
  "original_created_utc": 1631624328,
  "title": "No. Solana did not pump because it’s awesome. It pumped because someone realized they could make money off of it.",
  "created_utc": 1631633941,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Been in crypto since 2013, and I’ve seen my fair share of projects in this space. I invested in the ETH ICO, getting my ETH at ~$0.30. I entered at the height of the bull market in November 2013, when BTC was growing by $100+ a day for the first time ever. I bought in at $800/BTC through Coinbase, after Mt. Gox rejected my sign-up (thank God).  I remember memcoin, feather coin, colored coins.  I remember feeling like I missed the boat on Bitcoin. When I read about the ETH ICO, i threw some BTC in “just in case it ever goes the way of BTC.” Six months later they were calling VButerin a scammer.</p>\n\n<p>I remember when ETH hit $20 for the first time on June 16th, 2016; only to be immediately whacked back to $7 within a day because of the DAO hack. (“Fork You” anyone?).</p>\n\n<p>In 2017 I saw the rise of ICO’s as the ETH network became a star, and <em>knew</em> that the next best things in crypto would be coins like Iconomi (ICN), and Request Network (REQ). Did you know people used to actually debate on this sub whether ETC was better than ETH? People used to mock anyone who thought BTC would one day go to $10k.</p>\n\n<p>And let’s not forget EOS! The never-ending ICO that could be bought and immediately resold for profit…</p>\n\n<p>Every coin saw its rise and every time a coin exploded it was “<em>finally</em> true price discovery!” “Great team” “awesome project” “I truly believe!” Etc.</p>\n\n<p>Guess what? It’s all shit. GME showed us that there is crazy manipulation happening in the <em>cough</em> heavily regulated <em>cough</em> stock market—and crypto, by comparison, is still very much the Wild West You think there is not ten times as much manipulation here? </p>\n\n<p>Almost every pump you see is orchestrated. Almost every crash is designed to make someone, somewhere money. </p>\n\n<p>There are a variety of factors that determine this market, and orchestrated pumps are just one of them—crowd psychology is another one.</p>\n\n<p>And guess what? SOL did not rise 10x in the past two months because it’s an “awesome project” “great team” “white paper” etc. It’s because for someone, somewhere (most likely the team), the stars aligned and they realized it was the right opportunity to start to pump. And then everyone caught on and it went crazy—and now those guys who started the pump have sold. </p>\n\n<p>But you will hold. Because unlike those sellers, unlike those nasty <em>profiteers</em>,  this is a “5 year investment” for you. You’re a <em>true believer</em>. You read the white paper. You <em>trust the team</em>. </p>\n\n<p>But don’t worry, this is just a “correction” and “it will pump again”—and it probably will, because the guys at the top can still make a lot of money off of this momentum. But one day it will fade, like almost every other project that gained recognition because of its price and the fanboys will be left in their own dedicated subreddit, demanding answers about this or that from a team that has checked out long ago.</p>\n\n<p>Listen folks. Crypto is amazing. Crypto is absolutely the future of finance (and the internet as a whole). But the sooner you recognize the way this market works, the sooner you’ll start to make some real money. Hodling is for suckers.</p>\n</div><!-- SC_ON -->",
  "score": 401,
  "permalink": "/r/CryptoCurrency/comments/po29nk/no_solana_did_not_pump_because_its_awesome_it/",
  "subreddit": "CryptoCurrency",
  "id": "po29nk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Been in crypto since 2013, and I’ve seen my fair share of projects in this\nspace. I invested in the ETH ICO, getting my ETH at ~$0.30. I entered at the\nheight of the bull market in November 2013, when BTC was growing by $100+ a day\nfor the first time ever. I bought in at $800/BTC through Coinbase,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2013年から暗号化に携わり、この分野のプロジェクトを数多く見てきました。\nしてきました。私はETHのICOに投資し、ETHを～0.30ドルで入手しました。私は2013年11月の強気市場の真っ只中に\n2013年11月の強気の市場で、BTCが史上初めて1日に100ドル以上も成長したときでした。\n史上初めてのことでした。私はCoinbaseを通じて800ドル/BTCで購入しました...",
      "title": "いや、ソラナは素晴らしいから盛り上がったのではない。誰かがそれで金儲けができると気づいたから、ポンプになったのだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自2013年以来，我一直在加密货币领域，我已经看到了我在这个领域的项目的公平份额。\n空间。我投资了ETH ICO，以大约0.30美元的价格获得我的ETH。我是在\n我是在2013年11月的牛市高峰期进入的，当时BTC有史以来第一次以每天100美元以上的速度增长。\n有史以来第一次。我通过Coinbase以800美元/BTC买入，...",
      "title": "不，索拉纳没有抽，因为它很厉害。它的增长是因为有人意识到他们可以通过它来赚钱。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自2013年以來，我一直在加密貨幣領域，我已經看到了我在這個領域的項目的公平份額。\n空間。我投資了ETH ICO，以大約0.30美元的價格獲得我的ETH。我是在\n我是在2013年11月的牛市高峯期進入的，當時BTC有史以來第一次以每天100美元以上的速度增長。\n有史以來第一次。我通過Coinbase以800美元/BTC買入，...",
      "title": "不，索拉納沒有抽，因爲它很厲害。它的增長是因爲有人意識到他們可以通過它來賺錢。"
    }
  ]
}