{
  "author": "RampantLion757",
  "original_created_utc": 1628993586,
  "title": "Is it wrong to go to church with your family if it makes your wife and kids really happy but deep down in my heart you just don’t believe in god?",
  "created_utc": 1629020780,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We recently moved to a state where everyone goes to church and we were invited by our neighbors to go. I’ve never seen my kids happier, my wife who is pretty antisocial has made some good friends and my family just seems really happy. I even like it myself, I’ve made some friends as well and a lot of the talks are very thought-provoking. I just deep down in my heart don’t believe in God. I’m very respectful of other people’s faith though and I have an open mind. Even though I don’t believe in God, I still feel like I’m getting a lot of the church. I really feel like it’s making me a better person. I don’t know, it’s just complicated</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/p4l01t/is_it_wrong_to_go_to_church_with_your_family_if/",
  "subreddit": "TooAfraidToAsk",
  "id": "p4l01t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We recently moved to a state where everyone goes to church and we were invited\nby our neighbors to go. I’ve never seen my kids happier, my wife who is pretty\nantisocial has made some good friends and my family just seems really happy. I\neven like it myself, I’ve made some friends as well and a lot…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、誰もが教会に行く州に引っ越してきたのですが、近所の人に誘われて\n近所の人に誘われて行きました。子供たちがこんなに喜んでいるのを見たことがありませんし、反社会的な性格の妻が\n反社会的な妻にも良い友人ができ、家族は本当に幸せそうです。I\n私自身も気に入っていて、何人かの友人ができましたし、多くの...",
      "title": "妻や子供が喜んでくれるなら家族で教会に行くのは悪いことなのか、でも心の奥底では神を信じていないのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们最近搬到一个人人都去教堂的州，我们被邻居邀请去\n邻居们邀请我们去的。我从未见过我的孩子们如此快乐，我的妻子是相当反社会的\n反社会的妻子也交了一些好朋友，我的家人看起来真的很开心。I\n我甚至自己也喜欢这样，我也交了一些朋友，而且有很多...",
      "title": "与家人一起去教堂，如果这让你的妻子和孩子非常高兴，但在我内心深处，你就是不相信上帝，这有错吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們最近搬到一個人人都去教堂的州，我們被鄰居邀請去\n鄰居們邀請我們去的。我從未見過我的孩子們如此快樂，我的妻子是相當反社會的\n反社會的妻子也交了一些好朋友，我的家人看起來真的很開心。I\n我甚至自己也喜歡這樣，我也交了一些朋友，而且有很多...",
      "title": "與家人一起去教堂，如果這讓你的妻子和孩子非常高興，但在我內心深處，你就是不相信上帝，這有錯嗎？"
    }
  ]
}