{
  "author": "C3naa",
  "original_created_utc": 1631524743,
  "title": "Yesterday i payed for coffee with Bitcoin in ...... IRAN.",
  "created_utc": 1631532923,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Im visiting my home country and my family since last week and yesterday i was having a coffee in a cafe with some friends. While checking out i saw this sign above the counter that blew my mind. It said that you could pay with Bitcoin, XRP, Doge, TRX, Litcoin, Ethereum, BitcoinCash, Monero or ETH classic! </p>\n\n<p><a href=\"https://preview.redd.it/n56n3sb1n8n71.jpg?width=1536&amp;format=pjpg&amp;auto=webp&amp;s=b9e54aec43f3b117602c0050e600566ac33b389f\">https://preview.redd.it/n56n3sb1n8n71.jpg?width=1536&amp;format=pjpg&amp;auto=webp&amp;s=b9e54aec43f3b117602c0050e600566ac33b389f</a></p>\n\n<p>I asked if anyone paid with crypto before? and they said only one. I am not a fan of paying for daily needs with crypto just yet and i thought El Salvador accepting BTC as a legal tender was too early but i really needed to try this so i paid for everyone with BTC and it was nice.</p>\n\n<p>With the current inflation in Iran which is INSANE and is estimated to be around 50 to 150% most people are converting their savings to US dollars and now crypto. 1 USD equalls to 280000 Iranian Rials today. I hope crypto saves most of us.</p>\n</div><!-- SC_ON -->",
  "score": 330,
  "permalink": "/r/CryptoCurrency/comments/pnbxlh/yesterday_i_payed_for_coffee_with_bitcoin_in_iran/",
  "subreddit": "CryptoCurrency",
  "id": "pnbxlh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Im visiting my home country and my family since last week and yesterday i was\nhaving a coffee in a cafe with some friends. While checking out i saw this sign\nabove the counter that blew my mind. It said that you could pay with Bitcoin,\nXRP, Doge, TRX, Litcoin, Ethereum, BitcoinCash, Monero or ETH…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先週から母国と家族に会いに行っていて、昨日は友人たちとカフェでコーヒーを飲んでいました。\n友人たちとカフェでコーヒーを飲んでいました。お会計をしているときに、カウンターの上にあるこの看板を見て\nカウンターの上にあったこのサインには驚かされました。それは、ビットコインで支払いができると書いてあったのです。\nXRP、Doge、TRX、Litcoin、Ethereum、BitcoinCash、Monero、ETH...。",
      "title": "昨日、私はコーヒーの代金をビットコインで支払いました。...... IRANです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从上周开始访问我的祖国和我的家人，昨天我和一些朋友在咖啡馆喝咖啡。\n昨天我和一些朋友在一家咖啡馆喝咖啡。在结账的时候，我看到了这个标志\n柜台上面的标志，让我大吃一惊。它说，你可以用比特币支付。\nXRP、Doge、TRX、Litcoin、Ethereum、BitcoinCash、Monero或ETH...。",
      "title": "昨天我在......，用比特币支付了咖啡。伊朗。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從上週開始訪問我的祖國和我的家人，昨天我和一些朋友在咖啡館喝咖啡。\n昨天我和一些朋友在一家咖啡館喝咖啡。在結賬的時候，我看到了這個標誌\n櫃檯上面的標誌，讓我大喫一驚。它說，你可以用比特幣支付。\nXRP、Doge、TRX、Litcoin、Ethereum、BitcoinCash、Monero或ETH...。",
      "title": "昨天我在......，用比特幣支付了咖啡。伊朗。"
    }
  ]
}