{
  "author": "WhiHd",
  "original_created_utc": 1645635692,
  "title": "Don't transgenders reinforce the idea of \"males should act/look 'masculine' and females 'feminine\"\"?",
  "created_utc": 1645641403,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For example, the vast majority of MtF transgenders try their best to look more &amp;quot;feminine&amp;quot;, wear feminine clothes, makeup, use heels, put a makeup, shave the whole beard, act more submissive (this one not everyone), use wig, try to adjust their voice, and the opposite for FtM transgenders.&lt;/p&gt;\n\n&lt;p&gt;If they fight for gender equality (which of course they&amp;#39;re right) shouldn&amp;#39;t they care less about their appearances since doesn&amp;#39;t matter if a girl has a makeup/is shaved or not, for example?&lt;/p&gt;\n\n&lt;p&gt;There is an argument saying that society wouldn&amp;#39;t accept them if they don&amp;#39;t change their looks, but I&amp;#39;ve talked with a few MtF transgenders and they told me they actually want to look feminine.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/TooAfraidToAsk/comments/szm9ap/dont_transgenders_reinforce_the_idea_of_males/",
  "subreddit": "TooAfraidToAsk",
  "id": "szm9ap",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For example, the vast majority of MtF transgenders try their best to look more\n\"feminine\", wear feminine clothes, makeup, use heels, put a makeup, shave the\nwhole beard, act more submissive (this one not everyone), use wig, try to adjust\ntheir voice, and the opposite for FtM transgenders.\n\nIf they…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、MtFのトランスジェンダーの大半は、より美しく見せようと努力します。\n女性らしい服を着る、化粧をする、ヒールを使う、化粧をする、髭を剃るなど、\"女性らしい\"\nヒゲを伸ばす、より従順に振る舞う（これは全員ではない）、ウィッグを使う、調整しようとする。\nFtMのトランスジェンダーはその逆です。\n\nもし彼らが...",
      "title": "トランスジェンダーは、「男性は『男性的』、女性は『女性的』に振る舞う／見えるべき」という考えを強化しないのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "例如，绝大多数MtF变性者都尽力使自己看起来更 \"女性化\"，穿女性化的衣服，化妆，用高跟鞋，化妆，刮胡子。\n\"女性化\"，穿女性化的衣服，化妆，穿高跟鞋，化妆，剃掉整个胡须，表现得更顺从（这不是每个人都能做到的），使用假发，试图调整自己的形象。\n整个胡须，表现得更顺从（这不是每个人都能做到的），使用假发，尝试调整\n他们的声音，而FtM的变性者则相反。\n\n如果他们...",
      "title": "变性人不是强化了 \"男性应该表现/看起来很'男性化'，女性应该很'女性化'\"的观念吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "例如，絕大多數MtF變性者都盡力使自己看起來更 \"女性化\"，穿女性化的衣服，化妝，用高跟鞋，化妝，刮鬍子。\n\"女性化\"，穿女性化的衣服，化妝，穿高跟鞋，化妝，剃掉整個鬍鬚，表現得更順從（這不是每個人都能做到的），使用假髮，試圖調整自己的形象。\n整個鬍鬚，表現得更順從（這不是每個人都能做到的），使用假髮，嘗試調整\n他們的聲音，而FtM的變性者則相反。\n\n如果他們...",
      "title": "變性人不是強化了 \"男性應該表現/看起來很'男性化'，女性應該很'女性化'\"的觀念嗎？"
    }
  ]
}