{
  "author": "RusticBohemian",
  "original_created_utc": 1641306759,
  "title": "From 1824 to the 1980s, NYC's ticker tape parades mostly celebrated great individual achievement. Since 2000, every ticker-tape parade in NYC has celebrated a group (mostly sports teams). Why did the parades transition away from celebrating individuals?",
  "created_utc": 1641358309,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The first major parade in NYC was for the returning revolutionary war hero, the Marquis de Lafayette in 1824. &lt;/p&gt;\n\n&lt;p&gt;You an read the full list of honorees &lt;a href=\"https://en.wikipedia.org/wiki/List_of_ticker-tape_parades_in_New_York_City\"&gt;here&lt;/a&gt;. &lt;/p&gt;\n\n&lt;p&gt;But it&amp;#39;s striking how the parades go from mostly honoring individuals perceived as achieving great things (although many merely honored politicians or monarchs who showed up in NYC), to, beginning in the late 1980s or 1990s, honoring &amp;quot;diffused/large group&amp;quot; achievement. Since 2000, only groups have been honored. The most recent parade honored healthcare workers. &lt;/p&gt;\n\n&lt;p&gt;One could also argue that we&amp;#39;re finding fewer things worth throwing parades for, since the total number of celebrations has declined. &lt;/p&gt;\n\n&lt;p&gt;Does this represent NYC, or American society, becoming more collectivist? Is this society absorbing that the &amp;quot;great man&amp;quot; theory of history is bunk?&lt;/p&gt;\n\n&lt;p&gt;Have there been fewer great achievements since we began landing men on the moon (parades were held for many astronauts)?&lt;/p&gt;\n\n&lt;p&gt;Maybe people just don&amp;#39;t like parades anymore?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/rvvpuf/from_1824_to_the_1980s_nycs_ticker_tape_parades/",
  "subreddit": "AskHistorians",
  "id": "rvvpuf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The first major parade in NYC was for the returning revolutionary war hero, the\nMarquis de Lafayette in 1824.\n\nYou an read the full list of honorees here\n[https://en.wikipedia.org/wiki/List_of_ticker-tape_parades_in_New_York_City].\n\nBut it's striking how the parades go from mostly honoring…"
}