{
  "author": "An_EliteMind_Ihope",
  "the_new_excerpt": "One of Andrew Left's cases for selling $GME was the fact that companies with a\nlong-term \"short thesis\" can still borrow shares easily and aren't paying high\ninterest rates to hold these shares! This is blasphemy. On E-Trade right now its\nliterally impossible to short the stock (no shares available,…",
  "original_created_utc": 1611300148,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "安德鲁-左的销售通用汽车E的案例之一是，公司与。\n长期的 \"空头论文 \"仍然可以很容易地借到股票，并没有支付高昂的费用\n利率来持有这些股票！这是亵渎神灵。在电子贸易现在其\n从字面上看，不可能做空股票（没有股票可用，...",
      "title": "GME DD--安德鲁-左在撒谎! 基金经理都汗颜了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "安德魯-左的銷售通用汽車E的案例之一是，公司與。\n長期的 \"空頭論文 \"仍然可以很容易地借到股票，並沒有支付高昂的費用\n利率來持有這些股票！這是褻瀆神靈。在電子貿易現在其\n從字面上看，不可能做空股票（沒有股票可用，...",
      "title": "GME DD--安德魯-左在撒謊! 基金經理都汗顏了。"
    }
  ],
  "title": "GME DD - Andrew Left was lying! Fund Managers are sweating this.",
  "created_utc": 1611335927,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>One of Andrew Left&#39;s cases for selling $GME was the fact that companies with a long-term &quot;short thesis&quot; can still borrow shares easily and aren&#39;t paying high interest rates to hold these shares! This is <strong>blasphemy</strong>. On E-Trade right now its literally <strong>impossible</strong> to short the stock (no shares available, check picture). E-Trade is one of the largest trading platforms in the world!</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/reodo1fa5uc61.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=f24f737c0e1082ae98af38fd85148909a3179cb7\">https://preview.redd.it/reodo1fa5uc61.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=f24f737c0e1082ae98af38fd85148909a3179cb7</a></p>\n\n<p>And when you were able to short the stock the borrow rates were <strong>astronomical</strong>.....  not &quot;average&quot; as he suggests.... I have posted proof of that as well (I was short GME for a while. Gay bear I know). He paints a picture as if these huge hedge funds are short GME and willing to wait it out for months for their &quot;short thesis&quot; to prove true. <strong>This is false.</strong></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/xwtd0v1m3uc61.png?width=1491&amp;format=png&amp;auto=webp&amp;s=a95b100d31aac9b40eb3496e7abd44fb720e092d\">https://preview.redd.it/xwtd0v1m3uc61.png?width=1491&amp;format=png&amp;auto=webp&amp;s=a95b100d31aac9b40eb3496e7abd44fb720e092d</a></p>\n\n<p><strong>The scary thing about short positions is when they move against you is the get larger.</strong>  What started out as a $10million dollar bet against Gamestop at $5 share price is now a $100million dollar bet if the stock price hits $50. Also consider that many of these funds were probably doubling down as the stock ran up. See how a position that was maybe 1% of your portfolio can quickly become 20% or <strong>even more</strong>.</p>\n\n<p>What Andrew doesn&#39;t want to admit is that some of these big funds are holding <strong>massive</strong> bags. I guarantee you it&#39;s getting to the point where the juice is no longer worth the squeeze. Shares are getting called back, margin req&#39;s are changing (it happened at E-trade), and firms are paying super high interest rates just to hold their position that&#39;s getting larger and larger. Not to mention this is  happening in the middle of a crazy bull run. Do fund managers really want to continue holding this position when so much other stuff is hitting all time highs? I could throw a dart at a board full of SPACs and MEME stocks and be up 100% in 6 months,</p>\n\n<p>Basically what fund managers are beginning to be say to themselves is something along the lines of &quot;<strong>the markets can remain irrational longer than you can remain solvent.&quot;</strong>  Frankly the original &quot;short thesis&quot; doesn&#39;t even matter anymore for these companies like Melvin. What matters is the stock is up nearly 1000% in the last 6 months and their short position has become so large that it&#39;s a massive liability. They aren&#39;t stupid. They understand a gamma squeeze could send this thing to  $1,000 and their fund could legitimately blow up.</p>\n\n<p>What I&#39;m saying is that investors are applying so much pressure that they&#39;re going to break. The  thesis of the company changed when Ryan Cohen came on board. That&#39;s when you saw institutional <strong>smart/big</strong>  money get on the long side (notice how it was one day after the announcement, analysts had to pitch it to the fund managers first). The companies who are short desperately want to get out of their positions but they don&#39;t want to cover at this price. They desperately want the stock to fall to $20 so they can exit their positions without a MTD portfolio loss of double digits. Remember that the people making these decisions got there because they were almost always <strong>correct</strong>. These guys bagholding are feeling the pressure. One bad trade can unravel everything you&#39;ve worked for on Wall Street.</p>\n\n<p><strong>What This Means</strong>:  Buy as many shares as you can and <strong>hold</strong> no matter what. <strong>As long as we don&#39;t sell we will avoid a massive sell-off</strong>. Let the scalpers get their trades in don&#39;t panic. There aren&#39;t enough shares available to short for them to drive down the price artificially. Once they start covering and the algos join in we are going to moon again.</p>\n\n<p>Disclaimer:</p>\n\n<p>I am long Gamestop with 8,000 shares with plans to acquire more......</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/kfpamfz85uc61.png?width=758&amp;format=png&amp;auto=webp&amp;s=4214b6b0876c6c7e236e70d109e369e6d9b68537\">https://preview.redd.it/kfpamfz85uc61.png?width=758&amp;format=png&amp;auto=webp&amp;s=4214b6b0876c6c7e236e70d109e369e6d9b68537</a></p>\n</div><!-- SC_ON -->",
  "score": 2536,
  "permalink": "/r/wallstreetbets/comments/l2iljb/gme_dd_andrew_left_was_lying_fund_managers_are/",
  "subreddit": "wallstreetbets",
  "id": "l2iljb",
  "is_self": true,
  "media": null,
  "is_video": false
}