{
  "author": "Savings-Cheesecake94",
  "original_created_utc": 1639697177,
  "title": "What does ejaculation feel like with Vasectomy?",
  "created_utc": 1639723957,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;How does an ejaculation actually feel like if you have done Vasectomy before and all went 100% perfectly fine (no fail). What happens to the semen while having an orgasm? How does it feel and how does it work exactly? Do you still feel the same as before making the surgery? Does it feel weird or even painful in any way? Do you still release the same amount of testosterone when doing it? I&amp;#39;m really curious to hear what is your experience with this. I don&amp;#39;t plan to do it though but I still want to know what it&amp;#39;s like. Excuse my ignorance and sorry if I did a dumb question. I don&amp;#39;t want to offend anyone. Thanks for reading this post and taking your time. Have a nice one, everyone!&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;PS: Also, does it affect your daily normal life in anything?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&lt;sup&gt;(Sorry for my English. I&amp;#39;m trying to learn it since I&amp;#39;m not a native English-Speaker&lt;/sup&gt;)&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 122,
  "permalink": "/r/TooAfraidToAsk/comments/ri360q/what_does_ejaculation_feel_like_with_vasectomy/",
  "subreddit": "TooAfraidToAsk",
  "id": "ri360q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "How does an ejaculation actually feel like if you have done Vasectomy before and\nall went 100% perfectly fine (no fail). What happens to the semen while having\nan orgasm? How does it feel and how does it work exactly? Do you still feel the\nsame as before making the surgery? Does it feel weird or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "パイプカットの経験がある方は、射精はどのような感じなのでしょうか？\nは100％完全にうまくいった（失敗しなかった）。精液はどうなるのでしょうか？\nオーガズムは？具体的にどのように感じ、どのように作用するのでしょうか？をまだ感じているのでしょうか？\n手術をする前と同じですか？変な感じはしませんか？",
      "title": "パイプカットで射精はどのような感じですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你以前做过输精管结扎手术，而且所有的手术都是100%完美的（没有失败），那么射精到底是什么感觉呢？\n所有的事情都百分之百的顺利（没有失败）。在有性高潮时，精液会发生什么变化？\n高潮时精液会发生什么变化？它的感觉如何，具体如何操作？你是否仍然觉得\n和做手术前一样吗？是否感觉很奇怪或...",
      "title": "输精管切除术后的射精是什么感觉？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你以前做過輸精管結紮手術，而且所有的手術都是100%完美的（沒有失敗），那麼射精到底是什麼感覺呢？\n所有的事情都百分之百的順利（沒有失敗）。在有性高潮時，精液會發生什麼變化？\n高潮時精液會發生什麼變化？它的感覺如何，具體如何操作？你是否仍然覺得\n和做手術前一樣嗎？是否感覺很奇怪或...",
      "title": "輸精管切除術後的射精是什麼感覺？"
    }
  ]
}