{
  "author": "ting_jun48",
  "the_new_excerpt": "Family member's landlord wanted hiked rent to double what she was paying. He did\nthat in the middle of a pandemic; her savings were depleted, and was facing\nexorbitant prices to move into a new place. PANIC.\n\nBTC was made for this, I thought, so I offered to help with the cost of moving.\nWhen she…",
  "original_created_utc": 1611473334,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "家庭成员的房东想把租金提高到她所付租金的两倍。他做到了\n疫情中，她的积蓄已被耗尽，面临的是\n昂贵的价格搬进一个新的地方。恐慌。\n\n我想，BTC就是为这个而生的，所以我提出要帮她支付搬家的费用。\n当她...",
      "title": "向阿根廷的家人发送BTC汇款。未来就在这里。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "家庭成員的房東想把租金提高到她所付租金的兩倍。他做到了\n疫情中，她的積蓄已被耗盡，面臨的是\n昂貴的價格搬進一個新的地方。恐慌。\n\n我想，BTC就是爲這個而生的，所以我提出要幫她支付搬家的費用。\n當她...",
      "title": "向阿根廷的家人發送BTC匯款。未來就在這裏。"
    }
  ],
  "title": "Sent BTC remittance to family in Argentina. The future is here.",
  "created_utc": 1611482406,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Family member&#39;s landlord wanted hiked rent to double what she was paying. He did that in the middle of a pandemic; her savings were depleted, and was facing exorbitant prices to move into a new place. PANIC. </p>\n\n<p>BTC was made for this, I thought, so I offered to help with the cost of moving. When she said yes, I suggested using BTC.</p>\n\n<p>Helped her open an account with a local exchange. <strong><em>It took a total of 30 minutes until all transactions were completed. By the next morning, she had the $ in her bank account, in the local currency. It was Saturday. The cost for all this, $2,30 USD.</em></strong> </p>\n\n<p>I knew this was possible, but I couldn&#39;t believe it. She had never heard of BTC, and she couldn&#39;t believe it. Now we both know, that if she ever needs financial help, it is literally 24 hours away, at almost no cost.</p>\n\n<p>Consider the alternatives:</p>\n\n<ul>\n<li>A wire transfer costs $25 USD. Would take days/weeks. </li>\n<li>With other services like Western Union, a transfer of $900 could cost $76. </li>\n<li>When she receives the $ in USD, she also faces local banking restrictions on how much she can use/withdraw per month. (Argentina always has a dollar liquidity crisis)</li>\n<li>Skipping USD, the banks, and other traditional intermediaries is cheaper, faster, freer. </li>\n</ul>\n\n<p>With lightning it will become even more ridiculous. And when we can pay for things in BTC, it will be beyond ludicrous. But what BTC allows us to do right now, is already pretty cool.</p>\n\n<p>EDIT: Para los Argentinos en el sub, usamos RIPIO. Si envían BTC, quien lo reciba tiene que tener cuenta bancaria para retirar el dinero. No se si hay mejores alternativas, pero esta casa de cambio funcionó muy bien.</p>\n\n<p>Thanks for all the awards!!</p>\n</div><!-- SC_ON -->",
  "score": 2644,
  "permalink": "/r/Bitcoin/comments/l3uxy3/sent_btc_remittance_to_family_in_argentina_the/",
  "subreddit": "Bitcoin",
  "id": "l3uxy3",
  "is_self": true,
  "media": null,
  "is_video": false
}