{
  "author": "throw-away-09876543",
  "original_created_utc": 1654212649,
  "title": "Update Post: I took the leap of faith and accepted their offer to adopt me.?",
  "created_utc": 1654222888,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So yesterday I posted that my chosen parents had let me know they had a desire to legally adopt me.&lt;/p&gt;\n\n&lt;p&gt;I’ve spent the last 24 hours on a roller coaster of emotions, and Reddit helped and hindered that experience for me. Some of you were a huge help and support and some others made me feel I had no choice but to decline. &lt;/p&gt;\n\n&lt;p&gt;Tonight I asked my chosen parents the backstory and if their kids knew, if their kids were accepting of it etc. &lt;/p&gt;\n\n&lt;p&gt;Apparently they reached out to a lawyer on March 1st to see if we met the criteria for adult adoption and once they found out that we would meet the criteria they got more information from their lawyer about the process to make it happen, and decided they wanted to suggest that offer to me.&lt;/p&gt;\n\n&lt;p&gt;Then at the beginning of April they told their kids that they wanted to legally adopt me and asked for all of their true opinions on it. Apparently that went over completely fine and everyone agreed it was a good choice because it would protect me if I have got hurt or sick and needed someone to act on my behalf, plus their kids thought maybe it would help me feel more apart of the family. They even showed me the group text messages their kids sent last night and sent this morning asking if I had told them yes or no yet because they’ve been waiting to find out my decision. &lt;/p&gt;\n\n&lt;p&gt;Around 6:45 tonight I sat them down, asked for the backstory and then once I had my questions answered I told them I wanted them to adopt me. I even called them Mom and Dad for the first time (I’ve only ever used their first names). &lt;/p&gt;\n\n&lt;p&gt;Mom broke down immediately and hugged me for a while as she cried. Dad held it together emotionally until I told him I wanted to have his last name. I also told them I didn’t want to keep my bio mother’s name as my middle name. I told them I wanted them to come up with a couple names that they like that I could choose from. I told them since they never had a biological child together (all their kids are from their first marriages) they never got to name a child together so I wanted them to get to have a say in my new middle name, plus for me that will carry sentimental value. Dad said he was never going to tell me he wanted me to take his last name because he wanted it to be 100% my choice but that it means the world that I want his name. &lt;/p&gt;\n\n&lt;p&gt;So I’m spending the night here again tonight because the emotions are running high and I want to be near them for one more night......... but I’M GETTING ADOPTED!!!!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 128,
  "permalink": "/r/TooAfraidToAsk/comments/v3lye9/update_post_i_took_the_leap_of_faith_and_accepted/",
  "subreddit": "TooAfraidToAsk",
  "id": "v3lye9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So yesterday I posted that my chosen parents had let me know they had a desire\nto legally adopt me.\n\nI’ve spent the last 24 hours on a roller coaster of emotions, and Reddit helped\nand hindered that experience for me. Some of you were a huge help and support\nand some others made me feel I had no…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、昨日、私の選んだ両親が、ある願望を持っていることを知らせてきたと投稿しました。\nというお知らせをしました。\n\nこの24時間、私はジェットコースターのような感情の中で過ごしていました。\nを利用しました。ある人は大きな助けとなり、支えとなりました。\nそして、ある人は私に何もないと感じさせ...",
      "title": "投稿を更新しました。私は思い切って、養子縁組の申し出を受け入れました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨天我发帖说我选择的父母已经让我知道他们希望\n要合法收养我。\n\n在过去的24小时里，我的情绪如坐过山车，而Reddit帮助了我\n也阻碍了我的这一经历。你们中的一些人提供了巨大的帮助和支持\n还有一些人让我觉得我没有...",
      "title": "更新帖子。我抱着信心，接受了他们收养我的提议。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨天我發帖說我選擇的父母已經讓我知道他們希望\n要合法收養我。\n\n在過去的24小時裏，我的情緒如坐過山車，而Reddit幫助了我\n也阻礙了我的這一經歷。你們中的一些人提供了巨大的幫助和支持\n還有一些人讓我覺得我沒有...",
      "title": "更新帖子。我抱着信心，接受了他們收養我的提議。"
    }
  ]
}