{
  "author": "Fit_Consideration560",
  "original_created_utc": 1629826955,
  "title": "Please learn from another’s misfortune… My little brother just lost almost 50,000$ because of something so simple.",
  "created_utc": 1629833478,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So back story since I have to hit a character limit anyway….  My little brother sold his car before his deployment a little over a year ago.   Dumped his 12k into crypto and over the course of the last year turned it into just under 50k… </p>\n\n<p>All is well so far right. Well the guy decided at the beginning the best way to not lose his keys was to screenshot them.   He was even smart enough to print said picture and put it in a safe.   And delete the pic from his phone.  </p>\n\n<p>What he failed to do was delete the photo from his Apple photos backup.   Fast forward to today and someone hacked into his Apple account (not a difficult feat for most hackers) Obviously recognized screenshots from a crypto wallet  keys, address, and QR code included. And cleaned him out.   </p>\n\n<p>His funds since have changed addresses a couple times and from his best look have been converted to Monero…gone forever.  </p>\n\n<p>Hopefully from his misfortune someone here can learn a lesson and not suffer the same fate.  Hell most of us probably even have a insider threat. Get a divorce and a disgruntled spouse who knows your passwords cleans you out lol.   Be smart</p>\n\n<p>And FYI he is a member of this sub if you wish to express condolences or give him crap for being an idiot. (That’s what I’ve been doing).   We will see if he is too embarrassed to speak out lol.</p>\n</div><!-- SC_ON -->",
  "score": 245,
  "permalink": "/r/CryptoCurrency/comments/pas8z3/please_learn_from_anothers_misfortune_my_little/",
  "subreddit": "CryptoCurrency",
  "id": "pas8z3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So back story since I have to hit a character limit anyway…. My little brother\nsold his car before his deployment a little over a year ago. Dumped his 12k into\ncrypto and over the course of the last year turned it into just under 50k…\n\nAll is well so far right. Well the guy decided at the beginning…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "文字数制限があるので、裏話を。.... 私の弟は\n一年以上前に派遣される前に車を売った。12,000ドルを暗号に投じて\n去年1年間で5万円弱にしたんだ...\n\nここまでは順調ですね。この人は最初に決めたんだよね...。",
      "title": "他の人の不幸から学んでください...私の弟は、とても簡単なことで5万ドル近くを失ってしまいました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "由于我必须达到字符限制，所以背景故事.... 我的小兄弟\n在一年多前部署前卖掉了他的车。将他的12000美元投入\n在过去的一年里，他把它变成了不到5万块钱...。\n\n到目前为止，一切都很好吧。这家伙一开始就决定...",
      "title": "请从别人的不幸中学习......我的小兄弟刚刚因为如此简单的事情损失了近5万美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "由於我必須達到字符限制，所以背景故事.... 我的小兄弟\n在一年多前部署前賣掉了他的車。將他的12000美元投入\n在過去的一年裏，他把它變成了不到5萬塊錢...。\n\n到目前爲止，一切都很好吧。這傢伙一開始就決定...",
      "title": "請從別人的不幸中學習......我的小兄弟剛剛因爲如此簡單的事情損失了近5萬美元。"
    }
  ]
}