{
  "author": "EcoWraith",
  "original_created_utc": 1633094299,
  "title": "Why are galactic centers always occupied by black holes? Are galaxies to black holes what accretion disks are to stars?",
  "created_utc": 1633111093,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently heard from Dr Tyson that all galaxies (or at least the vast majority, he wasn&#39;t being super precise in this presentation) we have checked appear to have black holes in their centers. That got me wondering why that would be, and this galaxy-scale accretion disk is the best idea I&#39;ve got. But I feel like I would have heard of that before if the answer was that simple, and that doesn&#39;t really fit with the way that black holes are formed themselves. So what&#39;s the deal?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/askscience/comments/pz7tna/why_are_galactic_centers_always_occupied_by_black/",
  "subreddit": "askscience",
  "id": "pz7tna",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I recently heard from Dr Tyson that all galaxies (or at least the vast majority,\nhe wasn't being super precise in this presentation) we have checked appear to\nhave black holes in their centers. That got me wondering why that would be, and\nthis galaxy-scale accretion disk is the best idea I've got.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は最近、タイソン博士から、すべての銀河（少なくとも大部分は。\n私たちが調べたすべての銀河（少なくとも大部分は、今回の発表では正確ではなかった）の中心には\nその中心にはブラックホールがあるようです。そこで、なぜそうなるのかを考えてみました。\nこの銀河スケールの降着円盤は、私が得た最良のアイデアです。....",
      "title": "なぜ銀河の中心はいつもブラックホールで占められているのか？ブラックホールにとっての銀河は、星にとっての降着円盤のようなものなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近听泰森博士说，所有的星系（或至少是绝大多数的。\n他在这个演讲中并没有说得很精确），我们已经检查过的星系似乎都有黑洞。\n在它们的中心有黑洞。这让我想知道为什么会这样，以及\n这个星系规模的吸积盘是我得到的最好的想法....",
      "title": "为什么星系中心总是被黑洞占据？银河系对黑洞的意义就像吸积盘对恒星的意义一样吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近聽泰森博士說，所有的星系（或至少是絕大多數的。\n他在這個演講中並沒有說得很精確），我們已經檢查過的星系似乎都有黑洞。\n在它們的中心有黑洞。這讓我想知道爲什麼會這樣，以及\n這個星系規模的吸積盤是我得到的最好的想法....",
      "title": "爲什麼星系中心總是被黑洞佔據？銀河系對黑洞的意義就像吸積盤對恆星的意義一樣嗎？"
    }
  ]
}