{
  "author": "lonedrifter1989",
  "the_new_excerpt": "Back before i even knew there was all this hype just seemed like a reopening\nplay... sold at like $4-$6 or something like that so it’s still a little profit,\nbut dammit seeing it about touch $70 realizing i could have between $6K-7K that\nreally would’ve came in handy even after having to pay the tax…",
  "original_created_utc": 1622656030,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が知らないうちに大騒ぎになっていたので、再開したように思えました。\nプレイ...4〜6ドルくらいで売れたので、まだ少し利益が出ています。\nしかし、70ドルに近づいているのを見て、6,000〜7,000ドルを手にすることができたと気付きました。\n税金を払ってでも手に入れたかった...。",
      "title": "AMCについては、2ドルの時に持っていた100株がとても気になっています..."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我还不知道有这些炒作的时候，只是看起来像一个重新开放的\n玩......以4-6美元或类似的价格出售，所以还是有一点利润的。\n但该死的是，看到它即将触及70美元时，我意识到我可以拥有6K-7K美元的资金。\n即使在支付了税款之后，我也会很方便的......。",
      "title": "对$AMC和我在2美元时拥有的100股如此生气..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我還不知道有這些炒作的時候，只是看起來像一個重新開放的\n玩......以4-6美元或類似的價格出售，所以還是有一點利潤的。\n但該死的是，看到它即將觸及70美元時，我意識到我可以擁有6K-7K美元的資金。\n即使在支付了稅款之後，我也會很方便的......。",
      "title": "對$AMC和我在2美元時擁有的100股如此生氣..."
    }
  ],
  "title": "So mad about $AMC and my 100 shares i had when $2...",
  "created_utc": 1622661939,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Back before i even knew there was all this hype just seemed like a reopening play... sold at like $4-$6 or something like that so it’s still a little profit, but dammit seeing it about touch $70 realizing i could have between $6K-7K that really would’ve came in handy even after having to pay the tax man. I mainly trade fidelity IRA/HSA, but that would’ve pumped up my webull nicely and that’s an individual account i could’ve pulled from if and when needed... even after a 35% tax would still be a $4000 or so profit. I’m not sure it’s a stock you can hold a year for less taxes pay the tax man and take your gains or it’s gonna be $2 again.</p>\n</div><!-- SC_ON -->",
  "score": 276,
  "permalink": "/r/stocks/comments/nqro5w/so_mad_about_amc_and_my_100_shares_i_had_when_2/",
  "subreddit": "stocks",
  "id": "nqro5w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804301794
}