{
  "author": "veniato",
  "original_created_utc": 1638686748,
  "title": "With such strong recovery, have we reached a point of no return?",
  "created_utc": 1638703876,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m fairly new to crypto and this was my first crash/dip. Reading the comments I&amp;#39;ve realised that we still have paper hands who are willing to sell despite losses. However, the sudden recovery has definitely startled many like me. We were having thoughts about the dip being deeper however it jumped back rather spectacularly.\nDoes that mean there&amp;#39;s a high chance that even if it crashes in the future, it would have even higher chance of bouncing back up? I know this is a simple hypothesis but any person with technical knowledge might be able to answer and I&amp;#39;d be delighted to learn whether people are trusting crypto more than ever now.\nAlso, yes, I bought the dip.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/r99r6q/with_such_strong_recovery_have_we_reached_a_point/",
  "subreddit": "CryptoCurrency",
  "id": "r99r6q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm fairly new to crypto and this was my first crash/dip. Reading the comments\nI've realised that we still have paper hands who are willing to sell despite\nlosses. However, the sudden recovery has definitely startled many like me. We\nwere having thoughts about the dip being deeper however it jumped…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は暗号にかなり慣れておらず、今回が初めての暴落・急落でした。コメントを読むと\nそれでも売ろうとするペーパーハンドがまだいることに気づきました。\n損失が発生しました。しかし、突然の回復で私のような多くの人が驚いていることは確かです。私たちは\nもっとディップが深くなるかと思いきや、ジャンプしてしまった...。",
      "title": "このような力強い回復の中で、私たちはもう戻れないところまで来ているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对加密货币相当陌生，这是我第一次崩溃/下跌。阅读评论\n我意识到，我们仍然有一些纸上谈兵的人，尽管有损失也愿意卖掉。\n损失。然而，突然的复苏无疑让许多像我一样的人感到震惊。我们\n我们有想法，认为跌势会更深，但是它跳了起来......",
      "title": "在如此强劲的复苏下，我们是否达到了一个不归点？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對加密貨幣相當陌生，這是我第一次崩潰/下跌。閱讀評論\n我意識到，我們仍然有一些紙上談兵的人，儘管有損失也願意賣掉。\n損失。然而，突然的復甦無疑讓許多像我一樣的人感到震驚。我們\n我們有想法，認爲跌勢會更深，但是它跳了起來......",
      "title": "在如此強勁的復甦下，我們是否達到了一個不歸點？"
    }
  ]
}