{
  "author": "AmunPharaoh",
  "original_created_utc": 1645383752,
  "title": "People who ridicule/laugh at strangers for wearing masks in public places, why do you even care?",
  "created_utc": 1645389105,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We&amp;#39;ve been at Disney World for the last week and since we have some immune compromised family members, including me, we have been wearing masks even though they&amp;#39;re not required. So far I&amp;#39;ve noticed about 4-5 different people being very animated and exaggerated about acting like they&amp;#39;re laughing at us for it. Pointing and rolling their eyes and shaking their heads and such.&lt;/p&gt;\n\n&lt;p&gt;For the life of me I cannot comprehend why someone would even notice or care. They don&amp;#39;t have to wear it, and they have no idea why we&amp;#39;re wearing ours (it&amp;#39;s not just about covid, it&amp;#39;s about pretty much any nasty virus, the flu, whatever). I really want to ask one of them if I see that kind of reaction again. But since my parents would be mortified, I&amp;#39;m asking here and hoping someone can explain.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 138,
  "permalink": "/r/TooAfraidToAsk/comments/sx8kat/people_who_ridiculelaugh_at_strangers_for_wearing/",
  "subreddit": "TooAfraidToAsk",
  "id": "sx8kat",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We've been at Disney World for the last week and since we have some immune\ncompromised family members, including me, we have been wearing masks even though\nthey're not required. So far I've noticed about 4-5 different people being very\nanimated and exaggerated about acting like they're laughing at…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先週からディズニーランドに行っているのですが、我が家には免疫力の高い人がいるので\n私を含め、家族全員がマスクをしています。\n必要ありません。今までのところ、4-5人ほどの人が、とても\nを笑っているような演技を大げさにしている。",
      "title": "公共の場でマスクをしている他人を嘲笑する／笑う人、なぜ気にするのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "上周我们一直在迪斯尼世界，由于我们有一些免疫力低下的家庭成员，包括我在内，我们一直戴着口罩。\n由于我们有一些免疫力低下的家庭成员，包括我在内，我们一直戴着口罩，尽管不要求戴口罩。\n我们一直戴着口罩，尽管这不是必须的。到目前为止，我已经注意到大约有4-5个不同的人非常\n夸张的行为，好像他们在嘲笑......",
      "title": "那些嘲笑/嘲笑陌生人在公共场所戴口罩的人，你为什么还要关心？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "上週我們一直在迪斯尼世界，由於我們有一些免疫力低下的家庭成員，包括我在內，我們一直戴着口罩。\n由於我們有一些免疫力低下的家庭成員，包括我在內，我們一直戴着口罩，儘管不要求戴口罩。\n我們一直戴着口罩，儘管這不是必須的。到目前爲止，我已經注意到大約有4-5個不同的人非常\n誇張的行爲，好像他們在嘲笑......",
      "title": "那些嘲笑/嘲笑陌生人在公共場所戴口罩的人，你爲什麼還要關心？"
    }
  ]
}