{
  "author": "Arguesovereverythin",
  "original_created_utc": 1649339095,
  "title": "If 1 in 6 women have been raped and 80% of rapes are committed by someone the victim knows, does that mean that all of us probably know at least 1 rapist?",
  "created_utc": 1649348129,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Or are there just a few super rapey dudes out there that never get caught? But even if it&amp;#39;s just one dude doing a bunch of rapes, we would all have to know him for the statistics to add up, right? And chances are, he&amp;#39;s around even if he hasn&amp;#39;t done it yet?&lt;/p&gt;\n\n&lt;p&gt;This question is fucking me up this morning.&lt;/p&gt;\n\n&lt;p&gt;For the purposes of this question, people like Bill Cosby and R Kelly don&amp;#39;t count.&lt;/p&gt;\n\n&lt;p&gt;Edit: OK, within 30 seconds I got about 20 people agreeing. So now I&amp;#39;m wondering which dude I know that raped somebody.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 247,
  "permalink": "/r/TooAfraidToAsk/comments/tydfd5/if_1_in_6_women_have_been_raped_and_80_of_rapes/",
  "subreddit": "TooAfraidToAsk",
  "id": "tydfd5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Or are there just a few super rapey dudes out there that never get caught? But\neven if it's just one dude doing a bunch of rapes, we would all have to know him\nfor the statistics to add up, right? And chances are, he's around even if he\nhasn't done it yet?\n\nThis question is fucking me up this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それとも、捕まらない超強姦野郎がいるだけなのか？でも\n一人の男が何度も強姦していたとしても、全員がその男を知っていなければならない。\n統計の辻褄を合わせるためでしょう？そして、可能性としては、たとえ彼が\nまだやってないんですか？\n\nこの質問は私を混乱させる...",
      "title": "6人に1人の女性がレイプされた経験があり、レイプの80％が被害者の知り合いによるものだとしたら、私たち全員が少なくとも1人のレイプ犯を知っているということでしょうか？"
    },
    {
      "locale": "zh",
      "title": "如果每6名妇女中有1人被强奸，80%的强奸案是由受害者认识的人实施的，这是否意味着我们所有人都可能至少认识1名强奸犯？",
      "the_new_excerpt": "还是只有少数超级强奸犯才会被抓？但是\n即使只是一个人做了一堆强奸案，我们都必须认识他。\n以使统计数字增加，对吗？而且有可能，他就在附近，即使他\n还没有做过？\n\n这个问题让我很不爽，这..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "それとも、捕まらない超強姦野郎がいるだけなのか？でも\n一人の男が何度も強姦していたとしても、全員がその男を知っていなければならない。\n統計の辻褄を合わせるためでしょう？そして、可能性としては、たとえ彼が\nまだやってないんですか？\n\nこの質問は私を混亂させる...",
      "title": "如果每6名婦女中有1人被強姦，80%的強姦案是由受害者認識的人實施的，這是否意味着我們所有人都可能至少認識1名強姦犯？"
    }
  ]
}