{
  "author": "illintent99",
  "original_created_utc": 1632258566,
  "title": "Yes, you should buy the dip, but not today.",
  "created_utc": 1632267196,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was going to buy in this morning, then I did a bit more researching. This &quot;Evergrande dip&quot; is not happening, it&#39;s about to start. Thursday the 23rd is when Evergrande&#39;s loan payment is due, which they can&#39;t cover. </p>\n\n<p>The Chinese exchanges will open at 9:30am their time, which equates to 9:30pm EST. You may see a huge dip then, which may or may not get worse as their trading day goes on. Smart investing says liquidate crypto first, as it cannot cover traditional payments. I personally expect to wake up to a shitshow tomorrow. </p>\n\n<p>If the company craps the bed and the CCP doesn&#39;t bail them out, there will be a snowball effect on other companies and more people will need more liquidity. This could see big dips in Crypto over the next week(s). </p>\n\n<p>Not sure what my move is yet. Wait for a bit, or if there is a big dip tomorrow, buy it incase there is a upward correction soon.</p>\n\n<p><em>This is pure speculation as the flair suggests, not financial advice. I don&#39;t know what I&#39;m talking about</em></p>\n\n<p>EDIT: Thanks for the awards, goodluck to all!</p>\n</div><!-- SC_ON -->",
  "score": 318,
  "permalink": "/r/CryptoCurrency/comments/pss5cl/yes_you_should_buy_the_dip_but_not_today/",
  "subreddit": "CryptoCurrency",
  "id": "pss5cl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was going to buy in this morning, then I did a bit more researching. This\n\"Evergrande dip\" is not happening, it's about to start. Thursday the 23rd is\nwhen Evergrande's loan payment is due, which they can't cover.\n\nThe Chinese exchanges will open at 9:30am their time, which equates to 9:30pm\nEST.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今朝、買おうと思っていたが、もう少し調べてみた。この\n\"Evergrande dip \"は起こっていない、これから始まるのだ。23日の木曜日は\nEvergrandeのローンの支払い期限であり、彼らはそれをカバーすることができません。\n\n中国の取引所は現地時間の午前9時30分にオープンしますが、これは米国東部時間の午後9時30分に相当します。\nEST....",
      "title": "はい、ディップを買うべきですが、今日ではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我本来打算今天早上买入，然后我又做了一些研究。这\n\"恒大跌停 \"没有发生，它即将开始。23日星期四是\n恒大的贷款支付到期，他们无法支付。\n\n中国的交易所将在他们的时间上午9:30开盘，这相当于晚上9:30\nEST....",
      "title": "是的，你应该买入下跌的股票，但不是今天。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我本來打算今天早上買入，然後我又做了一些研究。這\n\"恆大跌停 \"沒有發生，它即將開始。23日星期四是\n恆大的貸款支付到期，他們無法支付。\n\n中國的交易所將在他們的時間上午9:30開盤，這相當於晚上9:30\nEST....",
      "title": "是的，你應該買入下跌的股票，但不是今天。"
    }
  ]
}