{
  "author": "Moocow870",
  "original_created_utc": 1642122682,
  "title": "TIFU by lying to my wife for 13 years…",
  "created_utc": 1642149590,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;TIFU by lying to my wife for 13 years…&lt;/p&gt;\n\n&lt;p&gt;My wife hates orange and lime flavored candies. I love them. Well, love the orange, like the lime. &lt;/p&gt;\n\n&lt;p&gt;So, she passes on the orange starburst to me. She passes the orange and green skittles to me. She passes the orange and green gummy bears to me. This has been happening for 13 years. &lt;/p&gt;\n\n&lt;p&gt;What she doesn’t know is that the green Haribo gummy bears are actually strawberry. &lt;/p&gt;\n\n&lt;p&gt;Shortly after we married, for one reason or another, I looked at the back of the Haribo gummy bears package and discovered this. &lt;/p&gt;\n\n&lt;p&gt;So I haven’t said anything for 13 years. Every time we get gummy bears, she gives me the orange and green (strawberry). I’ve never said a word. I’ve enjoyed eating my little lies. &lt;/p&gt;\n\n&lt;p&gt;Until last night…&lt;/p&gt;\n\n&lt;p&gt;We had some gummy bears and she opened them and she started to hand me the orange and green ones. But after a few minutes, I saw her looking at the back of the bag. Then I saw her eyes get REAL BIG. &lt;/p&gt;\n\n&lt;p&gt;She turned to me and asked if I’ve known that the green bears were strawberry. She always thought they were lime. &lt;/p&gt;\n\n&lt;p&gt;I was honest and nodded my head yes. The look of betrayal was unreal…. She asked how long I’ve known, and I was honest. I told her as long as we’ve been married. &lt;/p&gt;\n\n&lt;p&gt;She quit giving me the gummy bears she didn’t like. She was even eating the orange ones out of spite. &lt;/p&gt;\n\n&lt;p&gt;I don’t think I’ll get any more gummy bear discards after this. Time to buy my own.&lt;/p&gt;\n\n&lt;p&gt;TL;DR I never corrected my wife by telling her she gave me strawberry gummy bears. She thought they were lime. Now she knows and is spite eating my favorites.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 76005,
  "permalink": "/r/tifu/comments/s3f513/tifu_by_lying_to_my_wife_for_13_years/",
  "subreddit": "tifu",
  "id": "s3f513",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "TIFU by lying to my wife for 13 years…\n\nMy wife hates orange and lime flavored candies. I love them. Well, love the\norange, like the lime.\n\nSo, she passes on the orange starburst to me. She passes the orange and green\nskittles to me. She passes the orange and green gummy bears to me. This has…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "13年間、妻に嘘をつき続けてきたTIFU...。\n\n妻はオレンジとライム味のキャンディが嫌いです。私は大好きです。まあ、好きなのは\nオレンジ、ライムが好きです。\n\nだから、彼女はオレンジのスターバーストを私に譲る。彼女はオレンジと緑の\nスキットル 彼女はオレンジと緑のグミを私に渡します。これは...",
      "title": "13年間、妻に嘘をついてTIFU..."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "骗了我妻子13年的TIFU...\n\n我妻子讨厌橙子和酸橙味的糖果。我喜欢它们。嗯，喜欢\n橙色，喜欢青柠。\n\n所以，她把橙色的星芒糖传给了我。她把橙色和绿色的\n斯基特糖给我。她把橙色和绿色的小熊软糖传给我。这有...",
      "title": "通过欺骗我的妻子13年来的TIFU..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "騙了我妻子13年的TIFU...\n\n我妻子討厭橙子和酸橙味的糖果。我喜歡它們。嗯，喜歡\n橙色，喜歡青檸。\n\n所以，她把橙色的星芒糖傳給了我。她把橙色和綠色的\n斯基特糖給我。她把橙色和綠色的小熊軟糖傳給我。這有...",
      "title": "通過欺騙我的妻子13年來的TIFU..."
    }
  ]
}