{
  "author": "WeissMISFIT",
  "original_created_utc": 1639562777,
  "title": "I work for a wealth management firm, private wealth is VERY interested in crypto.",
  "created_utc": 1639575292,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey everyone, as the title says, I work for a wealth management firm that specializes in private wealth but we also do the backend office work for the majority of the banks in my country as well as facilitate transfers from our countries version of the IRS to retirement funds and banks.&lt;/p&gt;\n\n&lt;p&gt;Recently we had a &amp;#39;meeting&amp;#39; about blockchain, crypto and NFTs and holy shit the firm was really onto it all. We regularly hear the FUD about the environmental impacts of crypto against something like visa or how it can be used by criminals for illegal activity. My firm knocked them out of the park, they pointed out how those comparisons are BS because they dont account for the total carbon footprint of the traditional banking system. They actually went in depth to point out that lots of newer crypto currencies are using PoS over PoW which means we&amp;#39;re using less energy and that a lot of the larger mining facilities are right next to energy production plants, typically green energy plants such as hydro.   &lt;/p&gt;\n\n&lt;p&gt;They also mention that crypto is actually less commonly used for criminal activities than good ol FIAT. You know what else, they actually defended NFTs. They pointed out that they can be used for tickets, passports and more than just jpeg files of bored apes.&lt;/p&gt;\n\n&lt;p&gt;Our company is actually intending on creating a subsidiary company based around blockchain wealth management.&lt;/p&gt;\n\n&lt;p&gt;People you have just received a brief inside look into a foreign private wealth management companies view on cryptocurrency. When you hear on the news about governments being unsure about it or FUD just remember, the big boys dont give a crap and they&amp;#39;re coming to make money and if crypto is where it is, thats where they are going.&lt;/p&gt;\n\n&lt;p&gt;Oh and they said something about 2B people being unbanked or something and how crypto helps fix that which makes them bullish but whatever, who cares about TWO BILLION PEOPLE who stand to benefit from the expansion of crypto am I right lol.  &lt;/p&gt;\n\n&lt;p&gt;[EDIT 1] More information around environmental concerns added.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 266,
  "permalink": "/r/CryptoCurrency/comments/rgvska/i_work_for_a_wealth_management_firm_private/",
  "subreddit": "CryptoCurrency",
  "id": "rgvska",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey everyone, as the title says, I work for a wealth management firm that\nspecializes in private wealth but we also do the backend office work for the\nmajority of the banks in my country as well as facilitate transfers from our\ncountries version of the IRS to retirement funds and banks.\n\nRecently…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、私はタイトルにあるように、資産管理会社に勤めています。\n個人資産に特化した会社ですが、バックエンドの事務処理も行っています。\n私の国では、ほとんどの銀行が、私たちの会社からの送金を促進するために\n退職基金や銀行への国税庁のようなものです。\n\n最近...",
      "title": "私は資産管理会社に勤めていますが、プライベートウェルスは暗号に非常に興味を持っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，正如标题所说，我在一家财富管理公司工作。\n专注于私人财富，但我们也为我国大多数银行做后台办公工作。\n但我们也为我国大多数银行做后台工作，以及促进从我们国家的国税局向退休基金和银行的转移。\n国家的国税局向退休基金和银行转账。\n\n最近...",
      "title": "我在一家财富管理公司工作，私人财富对加密货币非常感兴趣。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，正如標題所說，我在一家財富管理公司工作。\n專注於私人財富，但我們也爲我國大多數銀行做後臺辦公工作。\n但我們也爲我國大多數銀行做後臺工作，以及促進從我們國家的國稅局向退休基金和銀行的轉移。\n國家的國稅局向退休基金和銀行轉賬。\n\n最近...",
      "title": "我在一家財富管理公司工作，私人財富對加密貨幣非常感興趣。"
    }
  ]
}