{
  "author": "MrRubberneck",
  "the_new_excerpt": "When WE BUY crypto, our countries say it's our risk, and they usually spread\nnegative news about crypto. But when WE SELL our crypto, they gladly take their\nprofits, and taxes from it.\n\nThey basically say \"Your risk\" when we buy and they say \"Our profit\" when we\nsell. Honestly, it makes me crazy.",
  "original_created_utc": 1622544005,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちが暗号を購入すると、国はそれが私たちのリスクだと言い、通常は暗号に関するネガティブなニュースを広めます。\n暗号に関するネガティブなニュースを流します。しかし、私たちが暗号を売るとき、彼らは喜んでその利益と税金を取ります。\nそこから利益と税金を得ます。\n\n彼らは基本的に、私たちが買うときには「あなたのリスク」と言い、私たちが売るときには「私たちの利益」と言います。\n売るときには「我々の利益」と言います。正直、頭がおかしくなりそうです。",
      "title": "私たちが買うときには「あなたのリスク」と言われます。私たちが売るとき、彼らは「私たちの利益」と言います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我们购买加密货币时，我们的国家说这是我们的风险，而且他们通常会传播\n关于加密货币的负面新闻。但是，当我们卖出我们的加密货币时，他们很乐意从中获取他们的\n利润，并从中征税。\n\n当我们购买时，他们基本上说 \"你的风险\"，当我们出售时，他们说 \"我们的利润\"。\n卖出。说实话，这让我很生气。",
      "title": "当我们购买时，他们说 \"你的风险\"。当我们卖出时，他们说 \"我们的利润\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我們購買加密貨幣時，我們的國家說這是我們的風險，而且他們通常會傳播\n關於加密貨幣的負面新聞。但是，當我們賣出我們的加密貨幣時，他們很樂意從中獲取他們的\n利潤，並從中徵稅。\n\n當我們購買時，他們基本上說 \"你的風險\"，當我們出售時，他們說 \"我們的利潤\"。\n賣出。說實話，這讓我很生氣。",
      "title": "當我們購買時，他們說 \"你的風險\"。當我們賣出時，他們說 \"我們的利潤\"。"
    }
  ],
  "title": "When we buy, they say \"your risk\". When we sell , they say \"Our profits\"",
  "created_utc": 1622607495,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When WE BUY crypto, our countries say it&#39;s our risk, and they usually spread negative news about crypto. But when WE SELL our crypto, they gladly take their profits, and taxes from it. </p>\n\n<p>They basically say &quot;Your risk&quot; when we buy and they say &quot;Our profit&quot; when we sell. Honestly, it makes me crazy.</p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/CryptoCurrency/comments/npqzxk/when_we_buy_they_say_your_risk_when_we_sell_they/",
  "subreddit": "CryptoCurrency",
  "id": "npqzxk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804297932
}