{
  "author": "francescomalatesta",
  "the_new_excerpt": "Hey there! I am a software developer, and I recently released a tool for website\ndomain management I made for my own company. It's called\nhttps://domain-check.it/, and it's 100% free at the moment. Once you sign up,\nyou can add your domains and enable expiration alerts (for both the domain and\nthe…",
  "original_created_utc": 1620553774,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは！私はソフトウェア開発者です。私はソフトウェア開発者で、最近、自分の会社のために作ったウェブサイトの\nドメイン管理ツールをリリースしました。それは\nhttps://domain-check.it/、現時点では100％無料です。サインアップすると\nドメインを追加し、期限切れアラートを有効にすることができます（ドメインと\nの両方）。",
      "title": "自分の会社でウェブサイトのドメイン管理ソフトを作り、無料で公開した"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，你们好！我是一名软件开发人员。我是一名软件开发人员，最近我发布了一个为自己公司制作的网站\n域名管理的工具，是我为自己的公司制作的。它被称为\nhttps://domain-check.it/，目前它是100%免费的。一旦你注册了。\n你可以添加你的域名，并启用过期提醒（对域名和\n的。",
      "title": "我为自己的公司做了一个网站域名管理软件，并免费发布。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，你們好！我是一名軟件開發人員。我是一名軟件開發人員，最近我發佈了一個爲自己公司製作的網站\n域名管理的工具，是我爲自己的公司製作的。它被稱爲\nhttps://domain-check.it/，目前它是100%免費的。一旦你註冊了。\n你可以添加你的域名，並啓用過期提醒（對域名和\n的。",
      "title": "我爲自己的公司做了一個網站域名管理軟件，並免費發佈。"
    }
  ],
  "title": "I made a website domains management software for my own company and released it for free",
  "created_utc": 1620563779,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey there! I am a software developer, and I recently released a tool for website domain management I made for my own company. <strong>It&#39;s called</strong> <a href=\"https://domain-check.it/\"><strong>https://domain-check.it/</strong></a><strong>, and it&#39;s 100% free at the moment.</strong> Once you sign up, you can add your domains and enable expiration alerts (for both the domain and the certificate). <strong>When the expiration dates are approaching, you will receive an email as a reminder</strong>.</p>\n\n<p>I made it because <strong>I missed an important domain renewal</strong>. I have a lot of domains and my provider groups different domains in the same email, so it&#39;s easy to miss something. (yep, my provider hasn&#39;t any auto-renewal).</p>\n\n<p>With <a href=\"https://domain-check.it/\">domain-check.it</a> you can also <strong>add domains to the availability list, and we will notify you when they&#39;re available again</strong>!</p>\n\n<p>I know that there are other solutions out there, but I made it in approximately <strong>20 hours of work to test some software development techniques and tools.</strong> More than 150 users are using it, so I am quite happy about the result. I am going to add a lot of features in the upcoming weeks. So... stay tuned and let me know if you have any feedback about future features!</p>\n</div><!-- SC_ON -->",
  "score": 15,
  "permalink": "/r/SideProject/comments/n8az2m/i_made_a_website_domains_management_software_for/",
  "subreddit": "SideProject",
  "id": "n8az2m",
  "is_self": true,
  "media": null,
  "is_video": false
}