{
  "author": "l_lecrup",
  "original_created_utc": 1625087059,
  "title": "What are the theoretical minimal and maximal values of pH?",
  "created_utc": 1625110619,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have a rudimentary understanding of pH. I understand that pH below 0 and above 14 are possible, and that pH depends on temperature so quite different values are possible at some extreme temperatures.</p>\n\n<p>Fee free to assume that we could get some substance to absolute zero, or convert all matter in the universe into hydrogen or whatever you like. What are some reasonable bounds on this value? Or have I misunderstood, and they don&#39;t exist?</p>\n\n<p>A side question: why is 14 the magic number in the usual run of things? Why exactly does the activity of hydrogen ions tend to bottom out at 1/10<sup>14</sup> in most cases?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/askscience/comments/ob6jor/what_are_the_theoretical_minimal_and_maximal/",
  "subreddit": "askscience",
  "id": "ob6jor",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have a rudimentary understanding of pH. I understand that pH below 0 and above\n14 are possible, and that pH depends on temperature so quite different values\nare possible at some extreme temperatures.\n\nFee free to assume that we could get some substance to absolute zero, or convert\nall matter in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "pHについては、初歩的な理解をしています。pHが0以下とそれ以上であることを理解している\n14が可能であること、pHは温度に依存し、全く異なる値を示すこと。\nは、ある極端な温度で可能です。\n\nある物質を絶対零度まで持っていけたと仮定しても、また、ある物質を絶対零度まで持っていくために\nのすべての物質が...",
      "title": "pHの理論上の最小値、最大値は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对pH值有一个初步的了解。我知道，pH值低于0和高于\n14都是可能的，而且pH值取决于温度，所以在一些极端温度下，pH值会有很大的不同。\n在一些极端的温度下是可能的。\n\n请自由假设，我们可以让某些物质达到绝对零度，或者把\n所有的物质都在...",
      "title": "理论上pH值的最小值和最大值是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對pH值有一個初步的瞭解。我知道，pH值低於0和高於\n14都是可能的，而且pH值取決於溫度，所以在一些極端溫度下，pH值會有很大的不同。\n在一些極端的溫度下是可能的。\n\n請自由假設，我們可以讓某些物質達到絕對零度，或者把\n所有的物質都在...",
      "title": "理論上pH值的最小值和最大值是什麼？"
    }
  ]
}