{
  "author": "StableNoodle05",
  "original_created_utc": 1658144350,
  "title": "Is there any proof that the crypto market will be at the bottom when the stock market is also at the bottom?",
  "created_utc": 1658176954,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I based this on previous cycles and weekly moving averages. There are people making claims that crypto ATL will be in when the stock market is also at an ATL. The way I see it, BTC and alts follow the Nasdaq. The worst stock market bear markets lasted two to three years. This one is about six months old now.&lt;/p&gt;\n\n&lt;p&gt;So with the crypto bear market happening, what happened to the crypto services lately? Especially the exchanges and services? There are a lot of crypto companies that are also affected by the bear market.&lt;/p&gt;\n\n&lt;p&gt;First, there&amp;#39;s Coinbase being &amp;quot;insolvent&amp;quot;. They also slashed 18% of Staff. There&amp;#39;s Crypto.Com laying off over 250 employees which is roughly 5% of its workforce. Gemini also announced reducing 10% of its workforce and BlockFi by 20%. And worst of all, there’s Celsius which just recently filed for Chapter 11 bankruptcy.&lt;/p&gt;\n\n&lt;p&gt;While the majority of crypto companies are joining the firing frenzy, some are not. Binance claimed they have 2000 open posts. This includes data research, communications, business development, and more. Kraken also had openings for 500 positions. They believe that bear markets are the best when it comes to recruiting. FTX also overtook Coinbase in May to become the second-largest centralized crypto exchange by market share.&lt;/p&gt;\n\n&lt;p&gt;Aside from the CEXes, there are also DeFi and CeFi services doing well. There&amp;#39;s Nexo only making use of overcollateralized loans, which are by definition sustainable. They are extremely cautious and have no involvement in high-risk DeFi projects which is key to why they survived the bear market.  There&amp;#39;s also Haru Invest which is very different from other CeFi services. They don&amp;#39;t place their customer&amp;#39;s funds in DeFi or other platforms. They have an actual arbitration/trading product that is true and tested. And then there’s also Whalefin landing a major Kit Sponsorship Deal With Spanish Atletico Madrid.&lt;/p&gt;\n\n&lt;p&gt;During bear markets, the bad players are usually weeded out while the good players stay. Such is the case with the crypto services mentioned above.&lt;/p&gt;\n\n&lt;p&gt;So with everything that&amp;#39;s happening lately the good and the bad, what do you do with your coins that you probably did or didn&amp;#39;t research but were promised with some good income? Are you going to stake or lend them to these crypto services or do you just HODL? It&amp;#39;s good and it&amp;#39;s safe but you may or may not be missing out on some good returns.&lt;/p&gt;\n\n&lt;p&gt;This whole thing is basically just a roller coaster ride and you are in it. There will be good and bad times. It’s up to you if you’ll continue to join the ride. And if you&amp;#39;re trying to time the bottom, just don&amp;#39;t. That maximum damage will come but not today. In fact, nobody really knows how low the price will go. Hell, if people do know, they&amp;#39;d probably be shorting it right now selling everything they have.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 311,
  "permalink": "/r/CryptoCurrency/comments/w1x5r4/is_there_any_proof_that_the_crypto_market_will_be/",
  "subreddit": "CryptoCurrency",
  "id": "w1x5r4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I based this on previous cycles and weekly moving averages. There are people\nmaking claims that crypto ATL will be in when the stock market is also at an\nATL. The way I see it, BTC and alts follow the Nasdaq. The worst stock market\nbear markets lasted two to three years. This one is about six…"
}