{
  "author": "TooDriven",
  "original_created_utc": 1626785268,
  "title": "Why was the late Roman Army so small? The numbers don't seem to add up?",
  "created_utc": 1626815629,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Note that I&#39;m talking about the Roman Empire before the fall of the Western half. This is also a more general version of my previous question regarding the <a href=\"https://www.reddit.com/r/AskHistorians/comments/onkn56/why_did_valens_field_such_a_small_army_at_the/\">Battle of Adrianople</a>. I&#39;m also <em>aware that similiar questions have been answered before</em> but they didn&#39;t really address my main confusion, unfortunately.</p>\n\n<p>Essentially, what I&#39;m wondering is this:</p>\n\n<p>- all common estimates say that the late Roman Army was actually bigger than at any time during the early Principate or Republic, numbering some 400.000-650.000 men</p>\n\n<p>- yet this doesn&#39;t really seem to fit together/add up with the knowledge we have of the battles fought in the late Roman time around the late 4th and early 5th century</p>\n\n<p>Consider this:</p>\n\n<p>- During the Republican times, even Senators like Crassus and of course also Caesar could field armies of incredible size:  35.000 men (Carrhae), 60.000+ men (Alesia), 80.000+ men (Cannae- despite losing tends of thousands just shortly before), or even 100.-200.000+ in total (Philippi).</p>\n\n<p>- Yet in almost all battles the Romans fought in the 4th and 5th against various invaders from the north, their army was considerably smaller: Adrianople (15.-30.000), Faesulae (15.-20.000), even at the Catalaunian Plains (hard to tell, maybe 20.-40.000 Romans)</p>\n\n<p>Now of course many common explanations are brought up: logistics prevented too large armies; the numbers might be sometimes exaggerated; the Romans were weakened by infighting; later on, they lost the African provinces; they had to defend their borders etc.</p>\n\n<p>But even then, it seems hard to justify the really small size of the Roman Armies fielded in these battles when compared to two things: (1) the supposed absolute size of the Roman army (400-650k) and (2) the Roman armies during the Republic.</p>\n\n<p>Especially when you also consider the following factors: the Roman Empire had much larger territories than the Roman Republic with more manpower reserves; many of these (North Africa, Spain e.g.) were also only barely threatened by invaders until the 5th century,  meaning they didn&#39;t need many standing troops; the respective battles were really important (core provinces were attacked, plundered and threatened by the Goths at Adrianople or by Radagaius in Italy); the Romans often prepared for these major battles for many months (so it wasn&#39;t just an unprepared small force somewhere); the numbers availabe were already supplemanted by like 15-25%+ of Foederati (or even way more).</p>\n\n<p>Another thing also just doesn&#39;t make sense: the lack of battles and the way in which the Roman Empire just let many things happen, like the sack of Rome or the invasions in 406. These seem to indicate that there were just barely any troops available.</p>\n\n<p>Just look at this direct comparison: the Roman Republic, which controlled mostly Italy, Corsica, Sardinia and Sicily could field 80.000 men at Cannae, yet the Roman Empire which controlled all of modern France, Spain, Italy, northern Africa, Egypt, Syria, Israel, Turkey, Greece, the balkans and other areas could barely scrape together 30.000 men at Adrianople?! Even if you consider all the possible reasons for this discrepancy (troops at the eastern border needed etc.), they should be more than made up for by the sheer size and power of the late Empire.</p>\n\n<p>Something doesn&#39;t add up and indicates to me that there was a severe lack of manpower/lack of recruits, for a reason I don&#39;t quite understand.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/oo1dcz/why_was_the_late_roman_army_so_small_the_numbers/",
  "subreddit": "AskHistorians",
  "id": "oo1dcz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Note that I'm talking about the Roman Empire before the fall of the Western\nhalf. This is also a more general version of my previous question regarding the\nBattle of Adrianople\n[https://www.reddit.com/r/AskHistorians/comments/onkn56/why_did_valens_field_such_a_small_army_at_the/].\nI'm also aware…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なお、私が言っているのは、西欧が滅びる前のローマ帝国のことです。\nを半分にしたものです。この質問は、前回のアドリアノープルの戦いに関する質問の、より一般的なバージョンでもあります。\nアドリアノープルの戦い\n[https://www.reddit.com/r/AskHistorians/comments/onkn56/why_did_valens_field_such_a_small_army_at_the/]。\nまた、私が認識しているのは...",
      "title": "後期ローマ軍はなぜあんなに小さかったのか？数字の辻褄が合わないような？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "请注意，我说的是罗马帝国在西半部沦陷之前的情况。\n半。这也是我之前关于 \"阿德里安诺普之战 \"的问题的一个更普遍的版本。\n阿德里安诺普尔之战\n[https://www.reddit.com/r/AskHistorians/comments/onkn56/why_did_valens_field_such_a_small_army_at_the/]。\n我也知道...",
      "title": "为什么罗马后期的军队如此之小？这些数字似乎并不相符？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "請注意，我說的是羅馬帝國在西半部淪陷之前的情況。\n半。這也是我之前關於 \"阿德里安諾普之戰 \"的問題的一個更普遍的版本。\n阿德里安諾普爾之戰\n[https://www.reddit.com/r/AskHistorians/comments/onkn56/why_did_valens_field_such_a_small_army_at_the/]。\n我也知道...",
      "title": "爲什麼羅馬後期的軍隊如此之小？這些數字似乎並不相符？"
    }
  ]
}