{
  "author": "Kugelfang52",
  "original_created_utc": 1639405464,
  "title": "Redditors! Marvel in the glory of your new mods!",
  "created_utc": 1639414532,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In a time of darkness, in a place devoid of hope, a few champions stood between humanity and the galactic threat of the apocalypse of the forgotten past. Without these purveyors of the past, these archivists of antiquity, these reporters of the ancient record, half the population of the redditverse might puff out of existence with the snap of a finger. Today, three more heroes of history have joined the ranks of the Avengers of History! Those who would destroy the past will be naught but [removed] in the wake of their mighty mod suits.&lt;/p&gt;\n\n&lt;p&gt;Behold! &lt;a href=\"/u/Coeurdelionne\"&gt;u/Coeurdelionne&lt;/a&gt; rides into modship on a glorious steed slaying all shitposters before them. Carrying the Mind Stone, this mod enforces the appropriate use of sources by the various nefarious denizens of reddit.&lt;/p&gt;\n\n&lt;p&gt;Behold! &lt;a href=\"/u/snipahar\"&gt;u/snipahar&lt;/a&gt; peers through the stellar networks to pull all knowledge into its appropriate categories. With the Space Stone, this mod will shape the subreddit into an even more glorious form.&lt;/p&gt;\n\n&lt;p&gt;Behold! &lt;a href=\"/u/J-Force\"&gt;u/J-Force&lt;/a&gt; delves into the heart of users and ensures that their ways are pure of motive. Bearing the Soul Stone, this mod guides the heroes into appropriate action to delete any who stand in the way of historical knowledge.&lt;/p&gt;\n\n&lt;p&gt;The will go forth into all thematic clusters of Askhistorians defeating the forces of Historical Yahoos Doing Research Atrociously (HYDRA). As they join the Avengers of History, they will increase their power until no number of META posts calling for an “answered” flair will remain. They will lead us into a brave new world in which all posters use the search function and review the FAQ before asking “Did Japan surrender because of nukes or the Soviets?” &lt;/p&gt;\n\n&lt;p&gt;Heroes walk in Reddit. What a time to be alive.&lt;/p&gt;\n\n&lt;p&gt;It is time to party!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 127,
  "permalink": "/r/AskHistorians/comments/rfguuv/redditors_marvel_in_the_glory_of_your_new_mods/",
  "subreddit": "AskHistorians",
  "id": "rfguuv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In a time of darkness, in a place devoid of hope, a few champions stood between\nhumanity and the galactic threat of the apocalypse of the forgotten past.\nWithout these purveyors of the past, these archivists of antiquity, these\nreporters of the ancient record, half the population of the redditverse…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗闇の時代、希望のない場所で、数人のチャンピオンが間に立ちました。\n人類と、忘れ去られた過去の終末の銀河の脅威。\n過去を伝える者たち、古代の記録者たち、この3人がいなければ\n古代の記録の記者、REDDITVACEの人口の半分が...",
      "title": "Redditors! あなたの新しいモジュールの栄光に驚嘆してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在一个黑暗的时代，在一个没有希望的地方，有几个冠军站在人类和银河系的末日威胁之间。\n人类和被遗忘的过去的天启的星系威胁之间。\n如果没有这些过去的传播者，这些古代的档案员，这些\n古代记录的记者，redditverse的一半人口...",
      "title": "Redditors! 惊叹于你的新模型的光辉!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在一個黑暗的時代，在一個沒有希望的地方，有幾個冠軍站在人類和銀河系的末日威脅之間。\n人類和被遺忘的過去的天啓的星系威脅之間。\n如果沒有這些過去的傳播者，這些古代的檔案員，這些\n古代記錄的記者，redditverse的一半人口...",
      "title": "Redditors! 驚歎於你的新模型的光輝!"
    }
  ]
}