{
  "author": "Jesta23",
  "the_new_excerpt": "I want to clarify a few things to some newer members. You have taken a few jokes\nwe make seriously and it will cause you to lose money.\n\nFirst, FOMO is an extremely bad reason to buy a stock or options. If you have to\nevery ask “is it too late?” It is too late. Don’t ever buy a stock after it…",
  "original_created_utc": 1612610616,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我想向一些新成员澄清一些事情。你把一些笑话\n我们认真地做，它会导致你的资金损失。\n\n首先，FOMO是购买股票或期权的一个极坏的理由。如果你必须\n每一个人都在问 \"是不是太晚了？\" 太晚了 千万不要买了股票之后... ...",
      "title": "给WSB新成员的公益广告。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想向一些新成員澄清一些事情。你把一些笑話\n我們認真地做，它會導致你的資金損失。\n\n首先，FOMO是購買股票或期權的一個極壞的理由。如果你必須\n每一個人都在問 \"是不是太晚了？\" 太晚了 千萬不要買了股票之後... ...",
      "title": "給WSB新成員的公益廣告。"
    }
  ],
  "title": "PSA to newer members of WSB.",
  "created_utc": 1612629451,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I want to clarify a few things to some newer members.  You have taken a few jokes we make seriously and it will cause you to lose money. </p>\n\n<p>First, FOMO is an extremely bad reason to buy a stock or options. If you have to every ask “is it too late?” It is too late. Don’t ever buy a stock after it has rocketed up to ATH. </p>\n\n<p>This was a very very standard but of advice until GME made it’s crazy run. Now it seems like the norm. It’s not. It never was, and it never will be. GME is a once in a lifetime run. You will very likely never see another one. </p>\n\n<p>Second, diamond hands. Pretty much the same story. Diamond hands was seen as a very very stupid thing to do. Anytime you nailed even a 2 bagger we would always always tell you to sell it all, or at the very least sell half to secure some profit and hold the other half as a gamble. </p>\n\n<p>Another note on diamond hands. If you are not familiar with organized pump and dump groups please read up on them. They create runs on a stock, then convince other people to buy it while they sell off securing profits. </p>\n\n<p>The 3 biggest ways to spot a pump and dump is 1 fomo, and 2 they tell you have diamond hands. (Prior to diamond hands they would say “it might dip, but that’s expected! Don’t sell it will go up!” Lastly they will always sell it as a sure thing. No stock is ever a sure thing. </p>\n\n<p>New people that witnessed GME are making these pump and dumps extremely easy to pull off. </p>\n\n<p>My last bit of advice, bag holding isn’t a sound strategy. Holding a stock because you are down on it and only because you are down on it is stupid. Plain and simple. </p>\n\n<p>Only ever hold on to a stock if you really think it’s going to go up. (With good reason.) you can sell, take what money is left and buy something else that will return a better profit. When you lose, ask yourself, if I didn’t own this stock right now, would I buy it at its current price having seen it drop? If the answer is yes, then hold it, if the answer is I would cum in my pants for a chance to buy in at this price having no losses! Then double the fuck down and buy more. </p>\n\n<p>I have been on wsb for almost 10 years. I learned to trade here. I don’t have a job and trade full time for my income. There are some very very smart people here, it is up to you to find those people and learn from them while ignoring or laughing at the retards losing money for the memes. </p>\n\n<p>Lastly, inverse wsb is a very legit strategy, think about that. Doing the exact opposite of the front page of wsb has good returns. (fscomeau, I’ll miss you, you glorious bastard.)</p>\n</div><!-- SC_ON -->",
  "score": 6735,
  "permalink": "/r/wallstreetbets/comments/ldvw8m/psa_to_newer_members_of_wsb/",
  "subreddit": "wallstreetbets",
  "id": "ldvw8m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123213446
}