{
  "author": "ownmonster3000",
  "original_created_utc": 1645116353,
  "title": "In an episode of The Simpsons, Bart drinks a lot of water before bed so that he wakes up early on Christmas morning. Lisa says that he stole this idea from the Native Americans. Did any tribes actually do this?",
  "created_utc": 1645130044,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In The Simpsons episode &lt;em&gt;Miracle on Evergreen Terrace&lt;/em&gt;, Marge has confiscated everyone&amp;#39;s alarm clocks so that no one can be up early and get a head start on opening presents. Bart drinks 12 glasses of water so that his bladder will wake him up early. Lisa accuses him of stealing this idea, saying &amp;quot;you didn&amp;#39;t invent that Bart, the Indians used to drink water to wake up early for their attacks.&amp;quot;   &lt;/p&gt;\n\n&lt;p&gt;Did any Native American tribes actually do this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/AskHistorians/comments/sut84h/in_an_episode_of_the_simpsons_bart_drinks_a_lot/",
  "subreddit": "AskHistorians",
  "id": "sut84h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In The Simpsons episode Miracle on Evergreen Terrace, Marge has confiscated\neveryone's alarm clocks so that no one can be up early and get a head start on\nopening presents. Bart drinks 12 glasses of water so that his bladder will wake\nhim up early. Lisa accuses him of stealing this idea, saying…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "シンプソンズのエピソード「エバーグリーンテラスの奇跡」で、マージが没収した\nを先取りすることができないように、全員の目覚まし時計を用意しました。\nプレゼントを開ける。バートは、膀胱が目覚めるように、コップ12杯の水を飲みます。\n早起きする。リサは彼がこのアイデアを盗んだと非難し...。",
      "title": "ザ・シンプソンズ」のエピソードで、バートが寝る前に水を大量に飲んで、クリスマスの朝早く起きられるようにする。リサによると、彼はこのアイデアをアメリカ先住民から盗んだそうです。実際にこのようなことをしていた部族はいたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在《辛普森一家》的《长青台的奇迹》一集中，玛吉没收了\n每个人的闹钟，这样就没有人可以早起并在开幕式上获得先机\n打开礼物。巴特喝了12杯水，这样他的膀胱就会醒过来。\n他早起。丽莎指责他偷了这个主意，说...",
      "title": "在《辛普森一家》的一集中，巴特在睡前喝了很多水，这样他在圣诞节早上就能早早醒来。丽莎说，他是从美国原住民那里偷来的这个主意。有哪个部落真的这样做了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在《辛普森一家》的《長青臺的奇蹟》一集中，瑪吉沒收了\n每個人的鬧鐘，這樣就沒有人可以早起並在開幕式上獲得先機\n打開禮物。巴特喝了12杯水，這樣他的膀胱就會醒過來。\n他早起。麗莎指責他偷了這個主意，說...",
      "title": "在《辛普森一家》的一集中，巴特在睡前喝了很多水，這樣他在聖誕節早上就能早早醒來。麗莎說，他是從美國原住民那裏偷來的這個主意。有哪個部落真的這樣做了嗎？"
    }
  ]
}