{
  "author": "laterduder",
  "original_created_utc": 1629757847,
  "title": "Do all women in their early 30s go through a type of “heat”?",
  "created_utc": 1629772354,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m 33 and lately I am feeling like I’m almost in heat. My body is having a physical reaction to attractive men/women and my boyfriends attention is not enough. Is this normal? Am I at the age where my body wants a child (which I do not)? It’s almost painful how much I want sex or to sext or literally ANYTHING all the time. It’s so bad that I’m going into a depression. I feel pretty unattractive and unwanted and my self esteem is almost nonexistent, even though I know that Isn’t true. “Other” tag because I couldn’t choose just one flair.</p>\n</div><!-- SC_ON -->",
  "score": 118,
  "permalink": "/r/TooAfraidToAsk/comments/paafsa/do_all_women_in_their_early_30s_go_through_a_type/",
  "subreddit": "TooAfraidToAsk",
  "id": "paafsa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m 33 and lately I am feeling like I’m almost in heat. My body is having a\nphysical reaction to attractive men/women and my boyfriends attention is not\nenough. Is this normal? Am I at the age where my body wants a child (which I do\nnot)? It’s almost painful how much I want sex or to sext or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は33歳ですが、最近はほとんど発情しているように感じています。私の体は魅力的な男性/女性に物理的な反応をしています。\n魅力的な男性や女性に身体が反応してしまい、彼氏の注目を浴びることができません。\n十分ではありません。これは普通のことなのでしょうか？私の体は子供を欲しがる年齢になっているのでしょうか（そんなことはありませんが\nしない）年齢なのでしょうか？) セックスしたい、セッ○スしたい、と思うのはほとんど苦痛です。",
      "title": "30代前半の女性は皆、ある種の \"熱 \"を持っているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今年33岁，最近我感觉自己几乎是在发情。我的身体对有吸引力的男人/女人有一种\n我的身体对有吸引力的男人/女人产生了生理反应，而我的男朋友的注意力却不够。\n足够。这正常吗？我的身体是否到了想要孩子的年龄（我没有\n我没有）？) 我有多想做爱或发短讯，这几乎是很痛苦的事。",
      "title": "所有30岁出头的女性都会经历一种 \"热 \"吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今年33歲，最近我感覺自己幾乎是在發情。我的身體對有吸引力的男人/女人有一種\n我的身體對有吸引力的男人/女人產生了生理反應，而我的男朋友的注意力卻不夠。\n足夠。這正常嗎？我的身體是否到了想要孩子的年齡（我沒有\n我沒有）？) 我有多想做愛或發短訊，這幾乎是很痛苦的事。",
      "title": "所有30歲出頭的女性都會經歷一種 \"熱 \"嗎？"
    }
  ]
}