{
  "author": "melancholyorchid",
  "the_new_excerpt": "Hello! I am from rural Vermont, and there is a quite small cemetery local to me\nthat I visit semi-frequently. I have family buried there. Many of the stones in\nit are from the mid to late 1800s though there are more modern ones as well.\n\nThe particular stone I have a question about is dated in the…",
  "original_created_utc": 1622949396,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは！私はバーモント州の田舎に住んでいます。私はバーモント州の田舎に住んでいて、地元にはとても小さな墓地があります。\n半年に一度の割合で訪れています。そこには家族が埋葬されています。そこにある石の多くは\nその墓地にある石の多くは1800年代半ばから後半のものですが、最近のものもあります。\n\n私が質問している特定の石は、日付が...",
      "title": "バーモント州の田舎にあるお墓がなぜ鎖で囲まれているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好! 我来自佛蒙特州农村，当地有一个相当小的公墓\n我经常去那里。我有家人埋在那里。里面的许多石头\n都是19世纪中后期的，不过也有比较现代的。\n\n我有疑问的那块石头的日期是在19世纪。",
      "title": "为什么佛蒙特州农村的一座坟墓会被铁链包围？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好! 我來自佛蒙特州農村，當地有一個相當小的公墓\n我經常去那裏。我有家人埋在那裏。裏面的許多石頭\n都是19世紀中後期的，不過也有比較現代的。\n\n我有疑問的那塊石頭的日期是在19世紀。",
      "title": "爲什麼佛蒙特州農村的一座墳墓會被鐵鏈包圍？"
    }
  ],
  "title": "Why would a grave in rural Vermont be surrounded by chains?",
  "created_utc": 1622987512,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello! I am from rural Vermont, and there is a quite small cemetery local to me that I visit semi-frequently. I have family buried there. Many of the stones in it are from the mid to late 1800s though there are more modern ones as well. </p>\n\n<p>The particular stone I have a question about is dated in the 1800s ( I think mid, not late, though I am not certain). I do not have a photo of it, as I was worried that would be disrespectful, though I <em>can</em> get a photo of it later in the week if that is needed for identification. The stone is pretty standard whitish, rectangular, and rather tall. There is no special design or words on it. It is clearly next to several other family members&#39; graves. I can&#39;t remember the name on the stone but it was a man&#39;s. I would consider it unassuming except for the fact that there are (or was) chains around it. There are two stone posts in front of the stone as well as two stone posts a bit to the back of the stone (about where the actual casket would end). The front posts are connected by heavy and rusted chains, and so are the back two posts. They have rusted chain loops on the other sides which suggest that there may have once also been chains connecting the back posts to the front ones. Essentially, it looks like the stone and actual grave were intended to have been chained in, although two sides of chains are not present. </p>\n\n<p>My initial assumption was that maybe the man who was put to rest there was someone dangerous or spooky that they wanted to keep from haunting people. Or, that at some point odd things happened with the gravestone that made it seem haunted and it was then cordoned off. These are assumptions I had made when I was a kid but still generally think make sense. However, when I finally remembered to Google it today, I was unable to come up with any results explaining why this might be. I&#39;d thought maybe this was  more or less a common practice in general or, at least, in my area. Now, it seems like it might actually be more odd than I expected. </p>\n\n<p>I would love to hear about the historical/cultural context of this both in the world in general and in my area if that makes any difference. I know New England has been prone to have a lot of weird graveyard/ghost/witch/vampire lore and scares so maybe that has something to do with it. I am extremely curious as to why this random grave in a small cemetery in the relative middle of nowhere has such an unsettling feature. Further, I was wondering if it is common for older graves to have the burial site behind the stone. The way that the chains are oriented would suggest that the man is buried behind the stone (it has a very clear front and back), while I am pretty certain most other graveyards bury the person in the front. I know we seem to always do it that way now, and the newer graves in that same cemetery do for sure. </p>\n\n<p>Thank you to anyone who takes the time to respond!</p>\n</div><!-- SC_ON -->",
  "score": 112,
  "permalink": "/r/AskHistorians/comments/ntcbl5/why_would_a_grave_in_rural_vermont_be_surrounded/",
  "subreddit": "AskHistorians",
  "id": "ntcbl5",
  "is_self": true,
  "media": null,
  "is_video": false
}