{
  "author": "Lobster_Messiah",
  "the_new_excerpt": "There is a free semester of college level, Blockchain/Bitcoin knowledge\navailable in a 15 part, 1 hour YouTube classroom. I won’t post the link, but\nenter “MIT OpenCourseWare Bitcoin” and you’ll find it. I’m on lesson 3 and it’s\n(surprisingly) not too advanced to understand and I’d recommend it for…",
  "original_created_utc": 1624124249,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "大学レベルのブロックチェーン/ビットコインの知識を1学期分無料で提供します。\nを15パート、1時間のYouTube教室で利用できます。リンクは貼りませんが\nMIT OpenCourseWare Bitcoin」と入力すれば出てきます。私はレッスン3にいますが、これは\n驚くべきことに）理解するのにそれほど高度ではなく、次のような方にお勧めします...",
      "title": "世界的に有名なM.I.T.で、ビットコインに関する無料の授業を「受ける」ことができるのをご存知ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一个免费学期的大学水平，区块链/比特币知识\n在一个15个部分，1小时的YouTube课堂上提供。我不会发布链接，但\n输入 \"MIT OpenCourseWare Bitcoin\"，你会发现它。我正在学习第三课，它是\n令人惊讶的是）不是太高级的理解，我推荐它给...",
      "title": "你知道你可以在世界著名的M.I.T. \"参加 \"比特币的免费课程吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一個免費學期的大學水平，區塊鏈/比特幣知識\n在一個15個部分，1小時的YouTube課堂上提供。我不會發布鏈接，但\n輸入 \"MIT OpenCourseWare Bitcoin\"，你會發現它。我正在學習第三課，它是\n令人驚訝的是）不是太高級的理解，我推薦它給...",
      "title": "你知道你可以在世界著名的M.I.T. \"參加 \"比特幣的免費課程嗎？"
    }
  ],
  "title": "Did you know that you can “take” a free class on Bitcoin at the world renowned M.I.T.?",
  "created_utc": 1624134743,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There is a free semester of college level, Blockchain/Bitcoin knowledge available in a 15 part, 1 hour YouTube classroom. I won’t post the link, but enter “MIT OpenCourseWare Bitcoin” and you’ll find it.  I’m on lesson 3 and it’s (surprisingly) not too advanced to understand and I’d recommend it for beginner, intermediate and advanced cryptocurrency enthusiasts.  The class takes place in 2018, after the last market cycle peak and is still very relevant. It’s amazing you can experience this opportunity online without going to MIT or paying for it. I find myself leaving it on while doing housework or laying around outdoors.</p>\n\n<p>If you’re still not “sold”, here’s some interesting points.</p>\n\n<p>1) The class is taught by professor Gary Gensler.  You may (now) know him better as the Chairman of the U.S. Securities and Exchange Commission (SEC) </p>\n\n<p>2) Sitting in the class is Silvio Micali, a computer scientist and founder of Algorand. </p>\n\n<p>3) Also making visits to the class is Larry Lessig who is the Roy L. Furman Professor of Law at Harvard Law School and the former director of the Edmond J. Safra Center for Ethics at Harvard University</p>\n\n<p>4) This is same information taught to countless numbers of some  influential (and soon to be influential) people in the cryptoverse. </p>\n\n<p>Check it out!</p>\n</div><!-- SC_ON -->",
  "score": 291,
  "permalink": "/r/CryptoCurrency/comments/o3ldey/did_you_know_that_you_can_take_a_free_class_on/",
  "subreddit": "CryptoCurrency",
  "id": "o3ldey",
  "is_self": true,
  "media": null,
  "is_video": false
}