{
  "author": "spritefire",
  "the_new_excerpt": "I am pretty certain one of the main drivers behind cryptocurrencies was so that\nthe financial system would be placed back into the hands of the ordinary person\nand not controlled and influenced by the top 1%. Why is it now ok that someone\nof the 1% can now be the influencer and spokesperson (and…",
  "original_created_utc": 1620960333,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、暗号通貨の主な目的の一つは、金融システムを一般の人々の手に取り戻すことであったと確信しています。\n金融システムを、上位1％の人々に支配されることなく、一般の人々の手に取り戻すためのものです。\n庶民の手に取り戻すことでした。なぜ、1％の人が\n1％の人がインフルエンサーやスポークスマン（...",
      "title": "いつから人々の目には、1％の人が暗号通貨をコントロールし、影響を与えることが許されるようになったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我非常确定加密货币背后的主要驱动力之一是为了使\n金融系统将重新回到普通人的手中\n而不是由最高1%的人控制和影响。为什么现在可以让1%的人\n1%的人现在可以成为影响者和代言人（以及...",
      "title": "在人们眼中，允许1%的人控制和影响加密货币何时变得可以了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我非常確定加密貨幣背後的主要驅動力之一是爲了使\n金融系統將重新回到普通人的手中\n而不是由最高1%的人控制和影響。爲什麼現在可以讓1%的人\n1%的人現在可以成爲影響者和代言人（以及...",
      "title": "在人們眼中，允許1%的人控制和影響加密貨幣何時變得可以了？"
    }
  ],
  "title": "When did it become ok in peoples eyes to allow the 1% to control and influence cryptocurrencies?",
  "created_utc": 1620974125,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am pretty certain one of the main drivers behind cryptocurrencies was so that the financial system would be placed back into the hands of the ordinary person and not controlled and influenced by the top 1%. Why is it now ok that someone of the 1% can now be the influencer and spokesperson (and even manipulate devs) to do what they want with it?</p>\n\n<h1>There is something fundamentally wrong with present day crypto if this is the new norm.</h1>\n\n<p>What happened to the anonymous - that now requires more identification than you would to open a bank account.</p>\n\n<p>What happened to the peer to peer - that now goes through middlemen exchanges who &quot;own&quot; your wallets.</p>\n\n<p>What happened to cypherpunks? The dreamers? The ones who want to change the world to make it better and especially the ones who believe in the technology and not looking to &quot;buy&quot; only because you think someone else will buy it from you for more than what you paid for it?</p>\n\n<p>We need to go back to the roots. It&#39;s time to awaken the sleepy cypherpunks from their slumber and give them back the ink they had once lost, so that they can form a new world.</p>\n</div><!-- SC_ON -->",
  "score": 6261,
  "permalink": "/r/CryptoCurrency/comments/nbyj5k/when_did_it_become_ok_in_peoples_eyes_to_allow/",
  "subreddit": "CryptoCurrency",
  "id": "nbyj5k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590796943
}