{
  "author": "No_Ranger_5723",
  "original_created_utc": 1649938347,
  "title": "How do I stop being racially biased when a specific group seems to target me?",
  "created_utc": 1649944288,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am a white 22F living in Washington, D.C. Nearly every day in my neighborhood I am aggressively catcalled by black men - I&amp;#39;ve been spit on, followed, and groped, all solely by black men. I&amp;#39;ve realized it&amp;#39;s now gotten to a point where my subconscious reaction to a black man looking at me is fear and avoidance, whether in my neighborhood or outside of it.&lt;/p&gt;\n\n&lt;p&gt;I realize this question sounds incredibly racist which is why I post it here. I don&amp;#39;t want to have this reaction to people of a specific race. I also understand this is a product of the environment and not their skin color. But I feel like I have to be cautious and on guard and that it&amp;#39;s based on what they look like.&lt;/p&gt;\n\n&lt;p&gt;How can I scope out safety without being actually racist?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 173,
  "permalink": "/r/TooAfraidToAsk/comments/u3g3xb/how_do_i_stop_being_racially_biased_when_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "u3g3xb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am a white 22F living in Washington, D.C. Nearly every day in my neighborhood\nI am aggressively catcalled by black men - I've been spit on, followed, and\ngroped, all solely by black men. I've realized it's now gotten to a point where\nmy subconscious reaction to a black man looking at me is fear…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はワシントンD.C.に住む22歳の白人です。ほぼ毎日、近所で\n唾を吐きかけられたり、後をつけられたり、黒人の男性から積極的に猫なで声をかけられたり。\nを触られ、すべて黒人の男性にだけです。気がつくと、それはもう\n黒人に見つめられると無意識に恐怖を感じてしまう...。",
      "title": "特定のグループが自分をターゲットにしているように見えるとき、どうすれば人種的偏見を持たなくなるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个住在华盛顿特区的白人，22岁。\n我几乎每天都会被黑人男子猛烈的猫叫--我被吐口水，被跟踪，被摸，都是黑人男子。\n我被吐口水，被跟踪，被摸，都是黑人男子干的。我已经意识到，现在已经到了这样一个地步\n我对黑人男子看我的下意识反应是恐惧......",
      "title": "当一个特定群体似乎针对我时，我如何停止种族偏见？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個住在華盛頓特區的白人，22歲。\n我幾乎每天都會被黑人男子猛烈的貓叫--我被吐口水，被跟蹤，被摸，都是黑人男子。\n我被吐口水，被跟蹤，被摸，都是黑人男子乾的。我已經意識到，現在已經到了這樣一個地步\n我對黑人男子看我的下意識反應是恐懼......",
      "title": "當一個特定羣體似乎針對我時，我如何停止種族偏見？"
    }
  ]
}