{
  "author": "anywhereiroa",
  "original_created_utc": 1640090124,
  "title": "How are camgirls, onlyfans girls etc. not afraid of being recognized by friends / family or even colleagues?",
  "created_utc": 1640099697,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I mean there are SOME people who hide their faces but like 90% of them willingly show their faces on camera and are OK with their faces being all over the internet. Do they just don&amp;#39;t care? Do they have zero to none relationships with friends and family? I&amp;#39;m curious on how a person could decide &amp;quot;Ok, I&amp;#39;m going to show my whole nude body to the world, and I&amp;#39;m also going to show my face&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;PS: The reason I&amp;#39;m asking this is that my gf and I are thinking about going in the &amp;quot;business&amp;quot;. But we are very scared that people would recognize us if we show our faces on camera.&lt;/p&gt;\n\n&lt;p&gt;Edit: We also think that showing your face is an important aspect of online cam-shows, like people who also show their faces get more views. So that&amp;#39;s why we&amp;#39;re in such a dilemma about this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 132,
  "permalink": "/r/NoStupidQuestions/comments/rldrj8/how_are_camgirls_onlyfans_girls_etc_not_afraid_of/",
  "subreddit": "NoStupidQuestions",
  "id": "rldrj8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I mean there are SOME people who hide their faces but like 90% of them willingly\nshow their faces on camera and are OK with their faces being all over the\ninternet. Do they just don't care? Do they have zero to none relationships with\nfriends and family? I'm curious on how a person could decide…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "顔を隠している人もいますが、90%は喜んで顔を出しています。\nカメラに顔を映して、自分の顔があちこちで公開されても平気なんです。\nインターネット 彼らは気にしないだけなのか？人間関係ゼロからゼロなのか？\n友人や家族？どのように判断するのか気になるところです...。",
      "title": "カムガールやオンリーファンガールなどは、どうして友達/家族、あるいは同僚に認められることを恐れないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的意思是，有一些人隐藏他们的脸，但像90％的人都愿意\n他们愿意在镜头前展示自己的脸，并且愿意接受自己的脸在互联网上到处出现。\n互联网。他们只是不在意吗？他们与朋友和家人的关系是零还是没有？\n朋友和家人的关系为零？我很好奇，一个人怎么能决定...",
      "title": "凸轮女郎、onlyfans女郎等如何不害怕被朋友/家人甚至同事认出？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的意思是，有一些人隱藏他們的臉，但像90％的人都願意\n他們願意在鏡頭前展示自己的臉，並且願意接受自己的臉在互聯網上到處出現。\n互聯網。他們只是不在意嗎？他們與朋友和家人的關係是零還是沒有？\n朋友和家人的關係爲零？我很好奇，一個人怎麼能決定...",
      "title": "凸輪女郎、onlyfans女郎等如何不害怕被朋友/家人甚至同事認出？"
    }
  ]
}