{
  "author": "monamikonami",
  "original_created_utc": 1629007271,
  "title": "Getting into crypto around the ATH has had the benefit of making me patient and not expecting 1000x gains overnight. Anyone else feel the same?",
  "created_utc": 1629031862,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m only <strong>just</strong> breaking into the green during this last week, and I’m ecstatic. I have no wild dreams of one of my crypto investments mooning overnight and becoming a millionaire. If I make a profit in 5 years - a better one than I would by keeping my money in a savings account - I will be happy. It has made me patient and realistic.</p>\n\n<p>Anyone else in the same boat?</p>\n</div><!-- SC_ON -->",
  "score": 202,
  "permalink": "/r/CryptoCurrency/comments/p4o2im/getting_into_crypto_around_the_ath_has_had_the/",
  "subreddit": "CryptoCurrency",
  "id": "p4o2im",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m only just breaking into the green during this last week, and I’m ecstatic. I\nhave no wild dreams of one of my crypto investments mooning overnight and\nbecoming a millionaire. If I make a profit in 5 years - a better one than I\nwould by keeping my money in a savings account - I will be happy. It…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこの最後の週にグリーンに入ったばかりですが、有頂天になっています。I\n私の暗号投資の一つが一夜にして月になり、億万長者になるなどという荒唐無稽な夢はありません。\n億万長者になるなんて夢にも思っていません。5年後に利益が出れば、それは貯金しておくよりも良いものです。\n5年後に利益が出れば、それは貯蓄口座にお金を置いておくよりも良いもので、私は幸せです。それは...",
      "title": "ATHの頃に暗号化に参入したことで、一夜にして1000倍の利益を期待せず、忍耐強くなるというメリットがありました。同じように感じている人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这最后一周，我才刚刚闯入绿色通道，我欣喜若狂。I\n我并没有幻想我的某项加密货币投资在一夜之间就能成为百万富翁。\n成为百万富翁。如果我在5年内赚到钱--比我自己赚到的更好的钱\n比我把钱放在储蓄账户里要好--我就会很高兴。它...",
      "title": "在ATH附近进入加密货币的好处是让我有耐心，不期望一夜之间获得1000倍收益。还有人有同样的感觉吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這最後一週，我纔剛剛闖入綠色通道，我欣喜若狂。I\n我並沒有幻想我的某項加密貨幣投資在一夜之間就能成爲百萬富翁。\n成爲百萬富翁。如果我在5年內賺到錢--比我自己賺到的更好的錢\n比我把錢放在儲蓄賬戶裏要好--我就會很高興。它...",
      "title": "在ATH附近進入加密貨幣的好處是讓我有耐心，不期望一夜之間獲得1000倍收益。還有人有同樣的感覺嗎？"
    }
  ]
}