{
  "author": "Any_Camel628",
  "original_created_utc": 1643087926,
  "title": "If someone is infected with SARS-COV-2 before vs. after vs. no mRNA vaccination, would their non-spike (nucleocapsid/membrane/envelope) antibody reponses be similar, or different? Would they have similar levels of said antibodies? Would those persist for a similar length of time?",
  "created_utc": 1643116006,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In other words, if one person was infected &lt;em&gt;before&lt;/em&gt; getting vaccinated, another was infected &lt;em&gt;after&lt;/em&gt; getting vaccinated, and another was infected and &lt;em&gt;never&lt;/em&gt; got vaccinated, would they have similar levels of non-spike antibodies, say, 6-12 months later? Or would the levels be higher/lower in one or the other? &lt;/p&gt;\n\n&lt;p&gt;I know it varies from person to person based on many different factors, so for the sake of argument, let&amp;#39;s say these three people are biologically identical clones and they were all asymptomatic.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 121,
  "permalink": "/r/askscience/comments/sc5zd5/if_someone_is_infected_with_sarscov2_before_vs/",
  "subreddit": "askscience",
  "id": "sc5zd5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In other words, if one person was infected before getting vaccinated, another\nwas infected after getting vaccinated, and another was infected and never got\nvaccinated, would they have similar levels of non-spike antibodies, say, 6-12\nmonths later? Or would the levels be higher/lower in one or the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "つまり、ある人がワクチンを接種する前に感染していた場合、別の人は\nを受けた後感染した人と、感染したが一度も接種していない人がいる。\nワクチン接種を受けた場合、例えば6-12年後に、非スパイク抗体のレベルは同じようになるでしょうか。\nヶ月後ですか？それとも、どちらかのレベルが高くなったり低くなったりするのでしょうか？",
      "title": "もし誰かがSARS-COV-2に感染した場合、mRNAワクチン接種前と後では、非スパイク（ヌクレオカプシド/メンブレン/エンベロープ）抗体反応は似ているか、あるいは異なるでしょうか？また、その抗体のレベルは同程度なのでしょうか？その抗体は同じような期間持続するのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "换句话说，如果一个人在接种疫苗前被感染，另一个人在接种疫苗后被感染，而另一个人被感染后从未被感染。\n另一个人在接种疫苗后被感染，而另一个人被感染但从未接种过疫苗。\n疫苗，他们是否会在6-12个月后有类似的非尖峰抗体水平？\n个月后，他们的非尖锐湿疣抗体水平是否相似？还是其中一个人的水平会更高/更低？",
      "title": "如果有人在接种mRNA疫苗之前和之后感染了SARS-COV-2，他们的非钉状物（核壳/膜/包膜）抗体反应是相似还是不同？他们会有类似的抗体水平吗？这些抗体会持续相似的时间吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "換句話說，如果一個人在接種疫苗前被感染，另一個人在接種疫苗後被感染，而另一個人被感染後從未被感染。\n另一個人在接種疫苗後被感染，而另一個人被感染但從未接種過疫苗。\n疫苗，他們是否會在6-12個月後有類似的非尖峯抗體水平？\n個月後，他們的非尖銳溼疣抗體水平是否相似？還是其中一個人的水平會更高/更低？",
      "title": "如果有人在接種mRNA疫苗之前和之後感染了SARS-COV-2，他們的非釘狀物（核殼/膜/包膜）抗體反應是相似還是不同？他們會有類似的抗體水平嗎？這些抗體會持續相似的時間嗎？"
    }
  ]
}