{
  "author": "reddito321",
  "original_created_utc": 1636123679,
  "title": "I don't care paying crypto taxes: in my country there's free healthcare and higher education for everyone. Not all the countries are like 'Murica.",
  "created_utc": 1636137045,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve seen people from the slums entering college because they didn&#39;t have to pay. Free technical books rentals at uni&#39;s libraries, free housing for the poorest students that come from other cities (have to prove income to be eligible), free lunch and dinner (in some unis only, in others you have to pay from 50c to 2 USD, though) and some undergrad research scholarships.</p>\n\n<p>We&#39;ve got free cancer and AIDS treatments. Free ambulances. I&#39;ve seen poor, old ladies that sell corn at Sunday&#39;s vegetables fair that had a life-changing eye surgery that made them see again. If they had to pay for it, they&#39;d go blind long before their death. FFS there are cochlear implants and organ transplants for free in some cases.</p>\n\n<p>Paying 15%-25% over 10x+ crypto profits? Man, just take it.</p>\n\n<p>I&#39;m not saying there aren&#39;t problems. You have to study to be accepted in the universities and if your parents had money in the first place, you could prepare yourself better going to the best private high-schools. The lines for some health procedures are long enough, but if your condition is chronic (AIDS, cancer) or life-threatening (e.g. a car accident), you&#39;re assisted on the spot. Violence is still a big thing, mainly due to a huge wealth gap, and hopefully there are people fighting to give better conditions to as many people as possible. Not everything is perfect.</p>\n\n<p>I&#39;m also not saying that all tax money is rightfully used - I&#39;m not such a fool. But I can&#39;t imagine living in a country where I had to pay a hefty amount to call an ambulance. If I had to pay for my college degree in the old days, probably I wouldn&#39;t have gotten any, as my parents were quite humble.</p>\n\n<p>Being libertarian or communist or capitalist, we live in society, and people tend to forget a good society is one where the maximum amount of people has their basic needs met. </p>\n\n<p>People also tend to forget that things they take for granted, such as the structures for calling the cops, sewage treatment, electricity on the bulbs, water in the taps etc. are generally paid with taxes. Don&#39;t want to pay taxes? Fine, get your own private security, buy yourself a water reservoir and build your own power plant. Might as well declare independence.</p>\n\n<p>Imho, not wanting to pay taxes doesn&#39;t put you far away from people in the Pandora and Panama papers. Want to make sure taxes are rightly used? Participate and get engaged in social participation programs. Get involved. Be part of your community.</p>\n\n<p>If you live in a country where there are such social security structures, don&#39;t mind paying taxes. If all your neighbors are fed, probably you are fed, too.</p>\n\n<p>TL;DR: I don&#39;t mind paying taxes over 10x+ if people around me will be assisted one way or another.</p>\n</div><!-- SC_ON -->",
  "score": 233,
  "permalink": "/r/CryptoCurrency/comments/qncqhu/i_dont_care_paying_crypto_taxes_in_my_country/",
  "subreddit": "CryptoCurrency",
  "id": "qncqhu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've seen people from the slums entering college because they didn't have to\npay. Free technical books rentals at uni's libraries, free housing for the\npoorest students that come from other cities (have to prove income to be\neligible), free lunch and dinner (in some unis only, in others you have to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "スラム街からお金を払わずに大学に入学した人を見たことがあります。\n払っています。大学の図書館では技術書を無料で貸し出し、他の都市から来た貧しい学生には無料で住宅を提供しています。\n他の都市から来た最も貧しい学生には無料で住居を提供しています（資格を得るには収入を証明しなければなりません\n収入を証明しなければならない）、昼食と夕食が無料（一部の大学のみ、他の大学では...",
      "title": "私の国では、誰もが医療費や高等教育費を無料で受けることができます。すべての国が'Murica'のようではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我见过来自贫民窟的人进入大学，因为他们不需要付费。\n支付。大学图书馆免费出租技术书籍，为来自其他城市的最贫穷的学生提供免费住房。\n从其他城市来的最贫穷的学生（必须证明收入才有资格），免费的午餐和晚餐（只在一些大学里，而在其他大学里）。\n资格），免费午餐和晚餐（仅在一些大学，在其他大学，你必须...",
      "title": "我不在乎支付加密货币税：在我的国家，每个人都有免费的医疗保健和高等教育。不是所有的国家都像美国一样。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我見過來自貧民窟的人進入大學，因爲他們不需要付費。\n支付。大學圖書館免費出租技術書籍，爲來自其他城市的最貧窮的學生提供免費住房。\n從其他城市來的最貧窮的學生（必須證明收入纔有資格），免費的午餐和晚餐（只在一些大學裏，而在其他大學裏）。\n資格），免費午餐和晚餐（僅在一些大學，在其他大學，你必須...",
      "title": "我不在乎支付加密貨幣稅：在我的國家，每個人都有免費的醫療保健和高等教育。不是所有的國家都像美國一樣。"
    }
  ]
}