{
  "author": "applesheep4",
  "original_created_utc": 1627656351,
  "title": "I yolod my life into Bitcoin this morning.",
  "created_utc": 1627702374,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Previously I had been putting 10% of my paycheck into Bitcoin. I had about USD4500 Invested, and am currently down about 1500. Not great. </p>\n\n<p>Over the past week I&#39;ve seen all sorts of stuff regarding moons and rockets. Each day, whether listening to the radio in the car, or seeing a billboard, or walking outside, I even saw a Tesla with a license plate that read &quot;MUN·RKT&quot;. \nI feel like this is a sign. So, I dumped all 12,000 of my savings into btc. I have until the 15th to get out while I still can as I&#39;m going to bootcamp for 3.5 months for the us military.</p>\n\n<p>Edit: changed &quot;3,000 return&quot; to &quot;down 1500&quot;</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/Bitcoin/comments/oulzoy/i_yolod_my_life_into_bitcoin_this_morning/",
  "subreddit": "Bitcoin",
  "id": "oulzoy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Previously I had been putting 10% of my paycheck into Bitcoin. I had about\nUSD4500 Invested, and am currently down about 1500. Not great.\n\nOver the past week I've seen all sorts of stuff regarding moons and rockets.\nEach day, whether listening to the radio in the car, or seeing a billboard,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "以前は給料の10％をビットコインに入れていました。私は約\n4500ドルを投資していましたが、現在は1500ドルほど下がっています。よくないですね。\n\nこの1週間、月やロケットに関するさまざまな情報を目にしました。\n毎日、車の中でラジオを聞いていても、ビルボードを見ていても、...",
      "title": "私は今朝、自分の人生をビットコインに託しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在此之前，我一直将我工资的10%存入比特币。我有大约\n4500美元的投资，目前下降了约1500。不是很好。\n\n在过去的一周里，我看到了各种关于月亮和火箭的东西。\n每一天，无论是在车里听广播，还是看到广告牌，...",
      "title": "今天早上，我把我的生命注入了比特币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在此之前，我一直將我工資的10%存入比特幣。我有大約\n4500美元的投資，目前下降了約1500。不是很好。\n\n在過去的一週裏，我看到了各種關於月亮和火箭的東西。\n每一天，無論是在車裏聽廣播，還是看到廣告牌，...",
      "title": "今天早上，我把我的生命注入了比特幣。"
    }
  ]
}