{
  "author": "Pfhorrest-of-Borg",
  "original_created_utc": 1625562185,
  "title": "How can an educated amateur in philosophy get something proportionally akin to peer review?",
  "created_utc": 1625602987,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>(I hope this kind of question is allowed under the &quot;the state of the field&quot; clause in the rules. The lead-in to my question, and the thing prompting me to ask it, is a personal anecdote, but I imagine the answer to the actual question could be very useful to anyone else like me out there.)</p>\n\n<p>I have a BA in philosophy from almost a decade and a half ago. I once dreamed of getting a PhD in the subject, but I can&#39;t afford the time, money, or opportunity cost of doing so -- too busy surviving by other means. Despite that, in my free time I&#39;ve continued studying to the extent I can, and writing a book on the subject as a hobby, with no particular intent to sell it or try to get professional journals to publish it or anything like that. I more or less finished it in 2019, though I&#39;ve continued polishing it up since then.</p>\n\n<p>Usually, when I do a hobby project of some kind, I share it with other hobbyists with similar interests, usually some of whom have at least similar if not superior skill levels. I&#39;ve tried doing that with this project as well, but it seems like I fall into some weird limbo space between lay philosophy enthusiasts and actual professionals in the field that makes that not work out so well.</p>\n\n<p>Most of my attempts to get any feedback from amateur places on the internet have gotten very little response at all, and the little feedback I have gotten has mostly been either people saying they don&#39;t understand it or it&#39;s over their heads, or else people who seem to think they understand it but clearly don&#39;t because their counter-arguments usually aren&#39;t attacking my actual positions.</p>\n\n<p>A few people have given very positive responses, some even asking where they can buy it / suggesting I should publish it. But I would feel very uncomfortable trying to sell something the quality of which I am very unsure of because I haven&#39;t been able to run it past anyone who seems like a good sounding board.</p>\n\n<p>On the other hand, I&#39;m fairly sure that no professional journal would even consider *actual* peer review, by real professionals, of something written by a nobody on the internet like me, who is not really their peer.</p>\n\n<p>So I&#39;m left wondering, what&#39;s an educated amateur to do to get some kind of sanity check on his work by people of at least a similar competency, without having to become an actual professional with a PhD first?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/askphilosophy/comments/oer7bl/how_can_an_educated_amateur_in_philosophy_get/",
  "subreddit": "askphilosophy",
  "id": "oer7bl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "(I hope this kind of question is allowed under the \"the state of the field\"\nclause in the rules. The lead-in to my question, and the thing prompting me to\nask it, is a personal anecdote, but I imagine the answer to the actual question\ncould be very useful to anyone else like me out there.)\n\nI have a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "(このような質問が「現場の状況」という条項で許されることを願っています。\nルールの \"state of the field \"条項で認められているといいのですが。私の質問のきっかけとなったのは、個人的な逸話です。\n私の質問のきっかけは個人的な逸話ですが、実際の質問の答えは、私のような人にはとても役に立つと思います。\n私のような人には非常に役に立つと思います)\n\n私には...",
      "title": "哲学の教育を受けた素人が、比例して査読に似たものを得られるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我希望这种问题在规则中的 \"场地状况 \"条款下是允许的。\n的条款允许。我的问题的引子，以及促使我提出这个问题的原因是一个个人轶事。\n是一个个人轶事，但我想，对实际问题的回答\n对其他像我这样的人来说可能非常有用)。\n\n我有一个...",
      "title": "一个受过教育的哲学业余爱好者如何能得到与同行评议相称的东西？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我希望這種問題在規則中的 \"場地狀況 \"條款下是允許的。\n的條款允許。我的問題的引子，以及促使我提出這個問題的原因是一個個人軼事。\n是一個個人軼事，但我想，對實際問題的回答\n對其他像我這樣的人來說可能非常有用)。\n\n我有一個...",
      "title": "一個受過教育的哲學業餘愛好者如何能得到與同行評議相稱的東西？"
    }
  ]
}