{
  "author": "empanadaparty1",
  "original_created_utc": 1639489423,
  "title": "Is walking to school with my kids everyday really such a big deal?",
  "created_utc": 1639494731,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I live in a town that has walk ways. But barely anyone uses them! People just drive everywhere, even to the store that&amp;#39;s literally a block or two away from them. Me and my husband have two cars. But one of them is overdo for an inspection plus has something going on in a back wheel. We think it&amp;#39;s just a brake pad needing replaced which we will around to fixing. Until then the car just sits on our driveway and i walk with my kids to school. The school is roughly a 3 minute drive, but walking it&amp;#39;s about 0.8- 1 mile and 20 mins walk. I carry both their backpacks the entire way so they don&amp;#39;t have to worry about them. My kids absolutely are ok with walking there and i&amp;#39;ve taken a liking to walking for the following reasons:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;My son is overweight and it&amp;#39;s a good exercise for him (i dont tell him he is overweight)&lt;/li&gt;\n&lt;li&gt;My daughter says she loves how we talk all the way there and considers it a happy bonding time.&lt;/li&gt;\n&lt;li&gt;I suffer from seasonal depression and it&amp;#39;s a good way for me to soak up some vitamin D before starting my day&lt;/li&gt;\n&lt;li&gt;My mother&amp;#39;s side of the family suffers from blood clots on their legs, this helps keep my legs healthy considering the rest of the day consists of me being at home and mostly sedentary&lt;/li&gt;\n&lt;li&gt;We are new to the area and it&amp;#39;s greatly helped the kids get to know the neighborhood, get familiar with the streets etc.&lt;/li&gt;\n&lt;li&gt;I&amp;#39;m originally from a major city where i used to walk everywhere everyday. Walking around is just familiar to me and makes me feel close to home in a weird way&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Now, all this being said. I&amp;#39;ve gotten all sorts of weird looks from people. Especially neighbors..I have a neighbor with kids who will see me getting up and out the door with my kids while she&amp;#39;s getting hers in her car. I&amp;#39;ve gotten remarks from &amp;quot;hope theyre dressed warm!&amp;quot;  to &amp;quot;if you ever need me to take them i can&amp;quot; All the while giving me these sad concerned looks. I&amp;#39;ve had police cars slowing down to see us while driving past because we look so out of  place. I&amp;#39;ve had regular cars stop on stop signs and stare at us all perplexed. Even my kid&amp;#39;s teachers apparently have asked them how do they get to school each morning because my daughter brought up our walks to her friend. I just don&amp;#39;t understand why it&amp;#39;s such a big deal in this town to use your legs and walk...Or am i the weird one here? Should i not make my kids walk a mile everyday? Is it cruel and i&amp;#39;m just not getting it?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Edit: I should add that at pick up, my husband swings by and picks them up by car since that&amp;#39;s when he gets off work. So they don&amp;#39;t walk a mile back home. It&amp;#39;s just the mornings&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 341,
  "permalink": "/r/NoStupidQuestions/comments/rg7s21/is_walking_to_school_with_my_kids_everyday_really/",
  "subreddit": "NoStupidQuestions",
  "id": "rg7s21",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I live in a town that has walk ways. But barely anyone uses them! People just\ndrive everywhere, even to the store that's literally a block or two away from\nthem. Me and my husband have two cars. But one of them is overdo for an\ninspection plus has something going on in a back wheel. We think it's…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の住んでいる町は散歩道があります。でも、ほとんど誰も使っていないんです。人々はただ\n車でどこへでも、文字通り1〜2ブロック先にある店へも。\nということです。私と夫は車を2台持っています。しかし、そのうちの1台はやりすぎで\n車検に加え、後輪に異変がある。私たちは、それが...",
      "title": "毎日子供と一緒に歩いて通学することは、そんなに大変なことなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我住在一个有步行道的城镇。但几乎没有人使用它们! 人们只是\n开车到处跑，甚至去离他们一两个街区远的商店。\n他们。我和我丈夫有两辆车。但其中一辆已经超期服役\n检查，而且后轮也有问题。我们认为这是...",
      "title": "每天带着孩子步行去学校真的有这么大的问题吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我住在一個有步行道的城鎮。但幾乎沒有人使用它們! 人們只是\n開車到處跑，甚至去離他們一兩個街區遠的商店。\n他們。我和我丈夫有兩輛車。但其中一輛已經超期服役\n檢查，而且後輪也有問題。我們認爲這是...",
      "title": "每天帶着孩子步行去學校真的有這麼大的問題嗎？"
    }
  ]
}