{
  "author": "Harucifer",
  "original_created_utc": 1635147529,
  "title": "Jim Cramer didn't \"sell his Ethereum\". He sold ONE-EIGHT of his Ethereum. That's called profit taking.",
  "created_utc": 1635172441,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Irresponsible headline on a thread on the frontpage makes it sound like Jim Creamer liquidated his <em>entire ethereum stash</em>.  </p>\n\n<p>Here&#39;s the source quote by Cramer:</p>\n\n<p>&#x200B;</p>\n\n<p>“If I’m right, then tomorrow very well could be the peak for crypto, <strong>and that’s why I sold off one-eighth of my Ethereum position today</strong>,” he continued. “Obviously, I would sell it all if I had any confidence that it was the top, but I don’t. It’s been too big a win for me.” </p>\n\n<p>&#x200B;</p>\n\n<p>Also, the &quot;tomorrow&quot; from that quote was almost a week ago.</p>\n</div><!-- SC_ON -->",
  "score": 214,
  "permalink": "/r/CryptoCurrency/comments/qfbjg8/jim_cramer_didnt_sell_his_ethereum_he_sold/",
  "subreddit": "CryptoCurrency",
  "id": "qfbjg8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Irresponsible headline on a thread on the frontpage makes it sound like Jim\nCreamer liquidated his entire ethereum stash.\n\nHere's the source quote by Cramer:\n\n\n\n“If I’m right, then tomorrow very well could be the peak for crypto, and that’s\nwhy I sold off one-eighth of my Ethereum position today,”…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "フロントページのスレッドの無責任なヘッドラインでは、Jim\nクリーマーはイーサリアムの隠し場所をすべて清算した。\n\nクレイマーのソース引用は以下の通りです。\n\n\n\n「私が正しければ、明日が暗号のピークになる可能性があります。\nだからこそ、私は今日、イーサリアムのポジションの8分の1を売却したのです」...。",
      "title": "ジム・クレイマーは「自分のイーサリアムを売った」のではない。彼は自分のイーサリアムのONE-EIGHTを売ったのです。これを利益確定といいます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "头版头条上一个不负责任的标题让人觉得吉姆\n克雷默清算了他所有的以太坊藏品。\n\n以下是克莱默的来源引文。\n\n\n\n\"如果我是对的，那么明天很可能是加密货币的高峰，这就是\n这就是为什么我今天卖掉了我八分之一的以太坊头寸，\"...",
      "title": "吉姆-克莱默没有 \"出售他的以太坊\"。他卖掉了他的八分之一的以太坊。这就是所谓的获利回吐。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "頭版頭條上一個不負責任的標題讓人覺得吉姆\n克雷默清算了他所有的以太坊藏品。\n\n以下是克萊默的來源引文。\n\n\n\n\"如果我是對的，那麼明天很可能是加密貨幣的高峯，這就是\n這就是爲什麼我今天賣掉了我八分之一的以太坊頭寸，\"...",
      "title": "吉姆-克萊默沒有 \"出售他的以太坊\"。他賣掉了他的八分之一的以太坊。這就是所謂的獲利回吐。"
    }
  ]
}