{
  "author": "Frost_King907",
  "the_new_excerpt": "Generally speaking, I've got no issues with any human being on the planet. I've\ntried to learn all the new pronouns and whatnot, I've respected the wishes of\nthe few trans folks in my inner social circle and started referring to them as\nwhatever they'd prefer to be called. (I don't totally…",
  "original_created_utc": 1614685179,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "一般来说，我对地球上的任何人类都没有意见。我已经\n试图学习所有新的代词和什么的，我已经尊重了的意愿\n在我的社交圈中，少数跨性别的人，并开始指他们为\n不管他们喜欢叫什么 (我不完全...",
      "title": "变性人运动的总体目标是什么？帮我理解"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一般來說，我對地球上的任何人類都沒有意見。我已經\n試圖學習所有新的代詞和什麼的，我已經尊重了的意願\n在我的社交圈中，少數跨性別的人，並開始指他們爲\n不管他們喜歡叫什麼 (我不完全...",
      "title": "變性人運動的總體目標是什麼？幫我理解"
    }
  ],
  "title": "What's the overall goal of the trans movement? Help me understand",
  "created_utc": 1614732074,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Generally speaking, I&#39;ve got no issues with any human being on the planet. I&#39;ve tried to learn all the new pronouns and whatnot, I&#39;ve respected the wishes of the few trans folks in my inner social circle and started referring to them as whatever they&#39;d prefer to be called. (I don&#39;t totally understand it, but I do it anyways because I&#39;m not a terrible human being and want people to feel at ease &amp; accepted).</p>\n\n<p>...but I just don&#39;t get it. I&#39;m a 41 y.o. guy, own my own HVAC business, and I spend my days turning wrenches, so I realize I&#39;m probably at a disadvantage purely on my upbringing alone, but what&#39;s the goal here, honestly?</p>\n\n<p>When I was younger, the big movement way the Gay Rights stuff. People wanted to get married and be treated equally under law as homosexual couples. I understood that. I wanted to support that. </p>\n\n<p>...but to be honest this whole trans movement is just confusing as hell to me. What are we advocating for, or what&#39;s the general overall objective here? I&#39;m not being facetious or trolling here, I legitimately have no clue what the purpose of the movement is other than using the right pronouns someone asks you to.</p>\n\n<p>Help a stereotypical heterosexual man understand how I can help here, and what we&#39;re doing. Because I feel like I&#39;m just getting drug along with no idea what the endgame is.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/lw02qc/whats_the_overall_goal_of_the_trans_movement_help/",
  "subreddit": "TooAfraidToAsk",
  "id": "lw02qc",
  "is_self": true,
  "media": null,
  "is_video": false
}