{
  "author": "stein77700",
  "the_new_excerpt": "Military Junta staged coup on Feb1 and now shooting protesters on the streets.\nSoldiers and polices are using guns, snipers, rifles, tear gas, stun grenade in\naddition to looting, beating, extortion against peaceful protesters with\nCOMPLETE IMPUNITY. as I am writing, a women got shot in the head in…",
  "original_created_utc": 1614516001,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "军政府在2月1日发动了政变，现在在街上向抗议者开枪。\n士兵和警察正在使用枪支、狙击手、步枪、催泪瓦斯、眩晕手榴弹，以及抢劫。\n除了抢劫、殴打、敲诈勒索之外，还对和平抗议者采取了完全有罪不罚的做法。\n就在我写这篇文章的时候，一名妇女被枪击中头部。",
      "title": "联合国在缅甸针对种族灭绝政权援引保护责任的可能性有多大？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "軍政府在2月1日發動了政變，現在在街上向抗議者開槍。\n士兵和警察正在使用槍支、狙擊手、步槍、催淚瓦斯、眩暈手榴彈，以及搶劫。\n除了搶劫、毆打、敲詐勒索之外，還對和平抗議者採取了完全有罪不罰的做法。\n就在我寫這篇文章的時候，一名婦女被槍擊中頭部。",
      "title": "聯合國在緬甸針對種族滅絕政權援引保護責任的可能性有多大？"
    }
  ],
  "title": "How probable is UN to invoke Responsibility to Protect in Myanmar against genocidal Regime?",
  "created_utc": 1614577687,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Military Junta staged coup on Feb1 and now shooting protesters on the streets. Soldiers and polices are using guns, snipers, rifles, tear gas, stun grenade in addition to looting, beating, extortion against peaceful protesters with COMPLETE IMPUNITY. as I am writing, a women got shot in the head in Mandalay. <a href=\"https://twitter.com/Myanmar_Now_Eng/status/1365993393558409217?s=20\">https://twitter.com/Myanmar_Now_Eng/status/1365993393558409217?s=20</a></p>\n\n<p>At least 20 people got shot and killed and many arrested forcefully today alone. People are asking for military intervention. Many are asking how many body counts does UN need to interfere instead of issuing statements and condemnations?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/Ask_Politics/comments/luf3db/how_probable_is_un_to_invoke_responsibility_to/",
  "subreddit": "Ask_Politics",
  "id": "luf3db",
  "is_self": true,
  "media": null,
  "is_video": false
}