{
  "author": "Zealousideal_Piano13",
  "original_created_utc": 1645944499,
  "title": "Why are Philosophers Motivated to be Moral?",
  "created_utc": 1646008108,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It seems to me that any intelligent person would be amoral, covertly if need be. Cheat always, if you can get away with it. This is without even taking into account moral skepticism or error theory or anything advanced like that. &lt;/p&gt;\n\n&lt;p&gt;Even if there &lt;em&gt;were&lt;/em&gt; moral truths, why would I care? Because God or society will punish me if I don&amp;#39;t? Or because if everyone didn&amp;#39;t care, there&amp;#39;d be chaos? Or because I&amp;#39;ll be a &amp;quot;better person&amp;quot; if I don&amp;#39;t cheat? Aren&amp;#39;t these all just ultimately appeals to egoism? Don&amp;#39;t all justifications for ethical behaviour eat their own tails?&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t all moral systems devolve into a &amp;quot;what&amp;#39;s in it for me?&amp;quot; attitude? Would Kant (or you, for that matter) surreptitiously falsify a magical mathematical theorem that proves lying is wrong and therefore prove he is unequivocally the final God-King of ethics? I would. I think you&amp;#39;d be a complete fool not to.&lt;/p&gt;\n\n&lt;p&gt;Why do moral philosophers care about being good &lt;em&gt;for its own sake&lt;/em&gt;?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/t2i6tu/why_are_philosophers_motivated_to_be_moral/",
  "subreddit": "askphilosophy",
  "id": "t2i6tu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It seems to me that any intelligent person would be amoral, covertly if need be.\nCheat always, if you can get away with it. This is without even taking into\naccount moral skepticism or error theory or anything advanced like that.\n\nEven if there were moral truths, why would I care? Because God or…"
}