{
  "author": "amBrollachan",
  "original_created_utc": 1654946958,
  "title": "Why isn't it always light?",
  "created_utc": 1654965689,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;On a clear night, without light pollution, I can follow the path from Cassiopeia to the Andromeda galaxy, which appears as a dim smear of light. \nI assume that the closer I travel towards Andromeda (as impossible as that is) the brighter and more visible it will be and therefore it stands to reason that if I am &lt;em&gt;inside&lt;/em&gt; Andromeda it will be incredibly bright. I mean, I&amp;#39;d be standing inside something which is giving off enough light to be seen from &lt;em&gt;Earth&lt;/em&gt; in a whole other galaxy.&lt;/p&gt;\n\n&lt;p&gt;I assume our galaxy looks the similar from the perspective of an Andromedan so why does it ever get dark?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 161,
  "permalink": "/r/askscience/comments/v9vmcm/why_isnt_it_always_light/",
  "subreddit": "askscience",
  "id": "v9vmcm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "On a clear night, without light pollution, I can follow the path from Cassiopeia\nto the Andromeda galaxy, which appears as a dim smear of light. I assume that\nthe closer I travel towards Andromeda (as impossible as that is) the brighter\nand more visible it will be and therefore it stands to reason…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "光害のない晴れた夜には、カシオペア座からの道筋をたどることができる。\nカシオペア座からアンドロメダ銀河までの道のりをたどることができる。私は、次のように考えている。\nアンドロメダ銀河に近づけば近づくほど（そんなことはありえないが）明るくなる。\nより明るく、よりよく見えると思う。",
      "title": "なぜ、いつも明るくないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在一个晴朗的夜晚，在没有光污染的情况下，我可以沿着仙后座的路径前进\n到仙女座星系的路径，而仙女座星系就像一抹昏暗的光。我假设\n我假设我越接近仙女座（尽管这是不可能的），它就会越亮，越明显。\n它就会更亮、更明显，因此有理由认为......",
      "title": "为什么它不总是光？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在一個晴朗的夜晚，在沒有光污染的情況下，我可以沿着仙后座的路徑前進\n到仙女座星系的路徑，而仙女座星系就像一抹昏暗的光。我假設\n我假設我越接近仙女座（儘管這是不可能的），它就會越亮，越明顯。\n它就會更亮、更明顯，因此有理由認爲......",
      "title": "爲什麼它不總是光？"
    }
  ]
}