{
  "author": "Iiau_",
  "the_new_excerpt": "With the advent of meme weekend being removed, there have been a massive influx\nof personal story posts which are made to earn moons. For example someone\nliterally made a post where they showed off of their sex toy that he bought with\ncrypto. Like seriously.\n\nI have seen some people propose a…",
  "original_created_utc": 1616019005,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "随着追忆周末的到来被删除，有大量的涌入\n的个人故事帖，是为了赚取月亮。例如有人\n从字面上看，他们做了一个帖子，他们展示了他们的性玩具，他买了。\n加密。说真的\n\n我见过一些人提出... I have seen some people propose a...",
      "title": "建议创建一个所有故事都必须拥有的个人故事特色，这将为MOON分布减少业力。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着追憶週末的到來被刪除，有大量的湧入\n的個人故事帖，是爲了賺取月亮。例如有人\n從字面上看，他們做了一個帖子，他們展示了他們的性玩具，他買了。\n加密。說真的\n\n我見過一些人提出... I have seen some people propose a...",
      "title": "建議創建一個所有故事都必須擁有的個人故事特色，這將爲MOON分佈減少業力。"
    }
  ],
  "title": "Proposal to create a personal story flair that all stories must have which will have reduced Karma for the MOON distribution",
  "created_utc": 1616060380,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>With the advent of meme weekend being removed, there have been a massive influx of personal story posts which are made to earn moons. For example someone literally made a post where they showed off of their sex toy that he bought with crypto. Like seriously.</p>\n\n<p>I have seen some people propose a separate sub to put in personal stories and keep them isolated from this sub which is meant to be information rich. While I have no grudge against personal stories by themselves I do have it when people start posting them just to get moons. I want people to post personal stories that actually mean something of value, something that makes every crypto owner proud to hear. Stuff significant and not garbage shit everyone buys regardless of crypto. Stuff intended to prioritize advice to invest better and not have moons become a massive distraction from that.</p>\n\n<p>A personal story flair would be mandatory for such posts and they will get a 10% reduction of karma for the moon distribution.</p>\n\n<p><a href=\"https://www.reddit.com/poll/m7c2yl\">View Poll</a></p>\n</div><!-- SC_ON -->",
  "score": 189,
  "permalink": "/r/CryptoCurrency/comments/m7c2yl/proposal_to_create_a_personal_story_flair_that/",
  "subreddit": "CryptoCurrency",
  "id": "m7c2yl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147378445
}