{
  "author": "Odlavso",
  "original_created_utc": 1635818674,
  "title": "Has anybody gone to Burger King Today and gotten Crypto?",
  "created_utc": 1635852630,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Has anybody gotten the email with the link from Burger King?</p>\n\n<p>I went and got a Whopper meal three hours ago and have yet to receive an email other than the receipt. was wondering if anybody else has had any luck with this yet?</p>\n\n<p>&#x200B;</p>\n\n<p>Also noticed on the fine print that you can send a letter in the mail with your information on it to get the codes sent to you without having to make a purchase, anybody going to try this? I believe it said you can get one code for everyday the contest is going on so 21 total.</p>\n\n<p>not sure how many Whoppers I can eat, but going to try at least a couple of times and see if I get lucky.</p>\n\n<p>&#x200B;</p>\n\n<p>Whopper, Whopper, Whopper, Whopper</p>\n</div><!-- SC_ON -->",
  "score": 204,
  "permalink": "/r/CryptoCurrency/comments/qktt3b/has_anybody_gone_to_burger_king_today_and_gotten/",
  "subreddit": "CryptoCurrency",
  "id": "qktt3b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Has anybody gotten the email with the link from Burger King?\n\nI went and got a Whopper meal three hours ago and have yet to receive an email\nother than the receipt. was wondering if anybody else has had any luck with this\nyet?\n\n\n\nAlso noticed on the fine print that you can send a letter in the mail…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "バーガーキングからリンク付きのメールを受け取った人はいますか？\n\n私は3時間前にワッパーを買ってきましたが、まだメールを受け取っていません。\nレシート以外のメールは届いていません。\nいないでしょうか？\n\n\n\nまた、郵便で手紙を送ることができると細かい字で書かれていましたが...。",
      "title": "今日、Burger Kingに行ってCryptoを手に入れた人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有人收到汉堡王的链接邮件了吗？\n\n我三个小时前去买了一份汉堡包，但还没有收到电子邮件。\n除了收据之外，我想知道是否有其他人在这方面有任何收获？\n吗？\n\n\n\n我还注意到，在细小的字体上，你可以通过邮件发送一封信...",
      "title": "有没有人今天去汉堡王买了加密货币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有人收到漢堡王的鏈接郵件了嗎？\n\n我三個小時前去買了一份漢堡包，但還沒有收到電子郵件。\n除了收據之外，我想知道是否有其他人在這方面有任何收穫？\n嗎？\n\n\n\n我還注意到，在細小的字體上，你可以通過郵件發送一封信...",
      "title": "有沒有人今天去漢堡王買了加密貨幣？"
    }
  ]
}