{
  "author": "BrilliantFig",
  "the_new_excerpt": "Before you call me out, yes I am a male and this may come off as my fragile male\nego being hurted. I get women’s experiences are pretty traumatic, and a lot of\nmy close friends /girlfriend have had really bad experiences. I also get why\npeople get pissed when men say “not all men” in the same way…",
  "original_created_utc": 1620277723,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "罵倒される前に言っておきますが、私は男性であり、これは私の脆弱な男性の自尊心を傷つけていると思われるかもしれません。\n脆弱な男性の自尊心を傷つけられたと思われるかもしれません。女性の経験がトラウマになることはよくありますし、私の親しい友人や彼女の多くが\n私の親しい友人やガールフレンドの多くは、本当にひどい経験をしています。また、なぜ\n男性が同じように「全ての男性ではない」と言うと怒る人がいるのもわかります。",
      "title": "なぜ、女性が「私の個人的な経験に基づいて、男性の周りでは非常に安全ではないと感じます」と言うのはいいのですが、人々が「私の黒人との経験に基づいて、彼らの周りでは非常に安全ではないと感じます」と言うのはダメなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在你骂我之前，是的，我是一个男性，这可能是我脆弱的男性\n的自尊心受到了伤害。我知道女性的经历是非常痛苦的，我的很多亲密朋友/女朋友都有非常糟糕的经历。\n我的很多亲密朋友/女朋友都有非常糟糕的经历。我也明白为什么\n当男人说 \"不是所有的男人 \"的时候，人们会很生气......",
      "title": "为什么女性可以说 \"根据我的个人经验，我觉得在男人身边很不安全\"，而人们却不能说 \"根据我和黑人的经验，我觉得在他们身边很不安全 \"这样的话？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在你罵我之前，是的，我是一個男性，這可能是我脆弱的男性\n的自尊心受到了傷害。我知道女性的經歷是非常痛苦的，我的很多親密朋友/女朋友都有非常糟糕的經歷。\n我的很多親密朋友/女朋友都有非常糟糕的經歷。我也明白爲什麼\n當男人說 \"不是所有的男人 \"的時候，人們會很生氣......",
      "title": "爲什麼女性可以說 \"根據我的個人經驗，我覺得在男人身邊很不安全\"，而人們卻不能說 \"根據我和黑人的經驗，我覺得在他們身邊很不安全 \"這樣的話？"
    }
  ],
  "title": "Why is it okay for women to say “based on my personal experiences I feel very unsafe around men” but not for people to say something like “based on my experiences with black people, I feel very unsafe around them”?",
  "created_utc": 1620316920,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Before you call me out, yes I am a male and this may come off as my fragile male ego being hurted. I get women’s experiences are pretty traumatic, and a lot of my close friends /girlfriend have had really bad experiences. I also get why people get pissed when men say “not all men” in the same way that people get pissed when they say “all lives matter”. So if you want to attack me, please don’t, I just want a general answer to my question. Why is it okay to generalise men based on action of a few women?</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/TooAfraidToAsk/comments/n5zqo8/why_is_it_okay_for_women_to_say_based_on_my/",
  "subreddit": "TooAfraidToAsk",
  "id": "n5zqo8",
  "is_self": true,
  "media": null,
  "is_video": false
}