{
  "author": "Johnny_KuCoin",
  "original_created_utc": 1635086838,
  "title": "Hey, this is Johnny, CEO at KuCoin. Would love to respond and clarify the Cloudflare access issue mentioned in another post.",
  "created_utc": 1635094243,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey there, this is Johnny, CEO at KuCoin.</p>\n\n<p><a href=\"/u/HammondXX\">u/HammondXX</a> Thank you for raising your question about KuCoin. As the People’s Exchange, we always pursue user satisfaction. Regarding the issues you mentioned, we are very willing to discuss them openly and transparently.</p>\n\n<p>Firstly, Cloudflare is a world-renowned CDN solution. As you said, one of its main functions is to prevent DDoS attacks, which is also our main purpose for deploying it. Currently, almost all major exchanges are working closely with Cloudflare.</p>\n\n<p><strong>All exchanges have applied an access frequency limit through Cloudflare to ensure the stability of their services. Once the limit has been surpassed, denial of website access may occur. When setting the limit, we discussed thoroughly with high-frequency traders, like API traders, for instance, before concluding on the limit. We believe that in most cases, the frequency limit will not affect our users. But it is possible that, when there’s a big price move or someone visits the site too frequently, 504 pages may still appear due to the limitation.</strong> We have been working on improving this for a while, and if you encountered such an issue, we would appreciate it if you could share the RAY ID from the 504 pages with our support team so that we can better solve the problem. Thank you.</p>\n\n<p>Secondly, regarding the AWS server, <strong>KuCoin invests a lot in IT infrastructure and network security. Compared with other exchanges of our size and scale, our investment in AWS servers is almost twice as much as theirs.</strong> And we will continue to invest in this sector as we know this is one of the fundamentals of our services.</p>\n\n<p>In fact, as a platform, we care about usability and stability more than anyone else. The access issue will not only impact KuCoin&#39;s revenue but also affect user experience. As a platform dedicated to building itself and the industry for the long term, we know that reputation is everything. We hope that all users can trade with KuCoin easily and pleasantly, achieve their investment goals, and even improve their lives. <strong>As a neutral platform, we do not profit from users&#39; liquidation. Therefore, we are constantly introducing new functions and educating users to help them manage their futures positions properly and reduce the risk of liquidation.</strong></p>\n\n<p>Having noticed that you’ve been banned in the KuCoin Subreddit, I am checking with the team for the reason, but our current guess is due to spamming. We have unbanned your account. All opinions are welcomed in our community, no matter if they are positive or negative. We are very sorry for the inconvenience. As for the Moderator List you claimed that we made private, actually we didn’t change any setting on that. It’s likely because banned users cannot see it. Please check again since you are now unbanned. </p>\n\n<p>Since its establishment in 2017, we have experienced many ups and downs, but KuCoin always believes in the future of crypto. So, we will continue to invest in our system and strive to provide users with a better experience. I apologize again for the inconvenience. If you have any questions about KuCoin, our 24/7 customer support will always be there to help you out. Thank you.</p>\n</div><!-- SC_ON -->",
  "score": 224,
  "permalink": "/r/CryptoCurrency/comments/qetlgc/hey_this_is_johnny_ceo_at_kucoin_would_love_to/",
  "subreddit": "CryptoCurrency",
  "id": "qetlgc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey there, this is Johnny, CEO at KuCoin.\n\nu/HammondXX [/u/HammondXX] Thank you for raising your question about KuCoin. As\nthe People’s Exchange, we always pursue user satisfaction. Regarding the issues\nyou mentioned, we are very willing to discuss them openly and transparently.\n\nFirstly, Cloudflare…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、KuCoinのCEOであるジョニーです。\n\nu/HammondXX [/u/HammondXX] KuCoinについてご質問をお寄せいただき、ありがとうございます。として\n私たちは常にユーザーの満足度を追求しています。ご指摘の問題点について\nオープンで透明性のある議論をしたいと考えています。\n\nまず、Cloudflare...",
      "title": "こんにちは、KuCoinのCEOであるジョニーです。別の投稿で言及したCloudflareへのアクセス問題について、ぜひ回答して明らかにしたいと思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我是KuCoin的CEO约翰尼。\n\nu/HammondXX [/u/HammondXX] 谢谢你提出关于KuCoin的问题。作为\n人民交易所，我们一直追求用户满意度。关于你提到的问题\n我们非常愿意公开、透明地讨论这些问题。\n\n首先，Cloudflare...",
      "title": "嘿，这是约翰尼，KuCoin的CEO。很想回应并澄清另一个帖子中提到的Cloudflare访问问题。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我是KuCoin的CEO約翰尼。\n\nu/HammondXX [/u/HammondXX] 謝謝你提出關於KuCoin的問題。作爲\n人民交易所，我們一直追求用戶滿意度。關於你提到的問題\n我們非常願意公開、透明地討論這些問題。\n\n首先，Cloudflare...",
      "title": "嘿，這是約翰尼，KuCoin的CEO。很想回應並澄清另一個帖子中提到的Cloudflare訪問問題。"
    }
  ]
}