{
  "approved_at_utc": null,
  "subreddit": "Bogleheads",
  "selftext": "The r/Bogleheads subreddit sees many threads where people are asking what fund they should invest in. Personally, I don't believe that Target Date Funds (TDFs) get nearly the recommendation that they deserve. This is especially pertinent to threads of young / newer investors.\n\nFar too much weight is put on being able to have control, fees, etc., and not enough weight is placed on more important things like savings rate.\n\nInvestors in the US have experienced a massive bull-run with equities, and there are a lot of new investors who don't know that stocks don't just always go up. They've never really experienced a major drawdown, and may not have a real handle on their risk tolerance. For these new investors, a TDF that coincides with their reasonable expected retirement date is still going to be very aggressive (e.g., 90/10) according to historical recommendations (e.g., 75/25 rule, age in bonds, etc.). Even seasoned investors can benefit from a simple \"put money in and forget about it\" strategy where they're less likely to tinker due to recent performance.\n\n**Fees**\n\nWith regard to fees, it is a Boglehead mantra that you want to limit the fees that you spend on your investments, as these are a fixed cost regardless of the performance of the fund.\n\nMy push towards TDFs is entirely based on access to low-cost index TDFs. **Index**\\-based TDFs from reputable firms are typically well below a .20% ER fee (some firms offer actively-managed TDFs for a significantly higher fee, and this post does **NOT** advocate those). A few examples of current fee structures at some reputable firms are:\n\n1. Vanguard: .08% ER\n2. Fidelity: .12% ER\n3. Schwab: .08% ER\n\nWhen talking about fees, it's important to keep things in perspective. The 2022 annual cap (not including for catch-up contributions) for tax-advantaged space for most Americans is $26.5K ($20.5K for 401K + $6K for IRA). A TDF that carries an ER of .20% equates to $53 in annual fees if you maximize the contribution to your tax-advantaged account (obviously less if you're not contributing $26.5K annually). In most cases, the ER difference between individual funds and a TDF is far less, but I'm using that figure as an example in what I would consider to be a \"low-fee\" TDF (.20% or less).\n\nFor someone who is not considering a TDF as a result of the fees are too high, can they honestly suggest that they can't shave $5/mo out of their annual budget? Someone who is not contributing the annual max of their tax-advantaged account would be far better served figuring out a way to get an additional $5/mo into said accounts than worried about the fee difference.\n\nEven if you're able to recreate the TDF asset allocation for cheaper with individual funds, human error / emotion in the asset allocation and rebalancing could completely wipe away any savings in fees you have. These funds take care of everything for you. The difference in fees between Vanguard TDF and their Mutual Fund equivalents is about .01-.02%, which is about $5/year.\n\n**Investing In Bonds Too Early**\n\nFor many people, a TDF is a bad idea because it includes bonds / fixed income too early in your investment horizon.\n\nAccording to [Vanguard](https://investor.vanguard.com/investor-resources-education/education/model-portfolio-allocation), the difference between historical returns of a 100% equities portfolio and an 80/20 portfolio is 1.2% annual. Extrapolating that to a 90/10 portfolio, we're talking about a .6% difference. Using the same math as before with the $26.5K annual tax-advantaged cap, we're talking about a difference of $160. Can someone who isn't maximizing their tax-advantaged space really say there is no way to cut out $15/mo out of their annual budget? Even someone maximizing their tax-advantaged space would be better off figuring out how to get $15/mo into their taxable account than worrying about the 10% bond allocation.\n\nThis doesn't even include the psychological impact of having bonds in the portfolio to dampen market volatility (the worst drawdown for an 80/20 portfolio was 35% vs 43% for 100% equities). Having one fund that you invest all your money into and don't think about the performance of the individual assets can reduce your ability to tinker in a panic situation (rebalancing between asset classes is handled for you).\n\n**Too Much International Equity Allocation**\n\nThe majority of reputable TDFs are going to be weighed along the lines of global market cap weight (e.g., 55-65% US / 35-45% ex-US). For some people, this is too much ex-US exposure.\n\nThis all goes back to the US / ex-US argument, but the irony here is a lot of people often advocate for total market funds from the same companies who offer TDFs. They trust that company to make a US or ex-US \"total market\" fund by market cap, but don't trust them to allocate between the two globally?\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**TDFs Aren't Perfect**\n\nThis is not to say that TDFs are what everyone should invest in.\n\nTDFs have flaws:\n\n1. Fees: TDFs (or any AIO / fund-of-funds) are going to be more expensive than the funds that it is comprised of. Actively-managed TDFs are expensive (same as actively-managed Mutual Funds / ETFs), and are not ideal. In a situation where the TDF options are high-fee, going with individual funds is probably preferred (you can always utilize the \"portfolio as a whole\" method and use IRA / taxable space to develop your own total asset allocation).\n2. At some point in your investing career, your portfolio balance (and complexity), annual contributions, and experience can put you in a situation where you may be able to manage the funds DIY and come out ahead. This is especially true for when withdrawing funds from your portfolio.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**TL;DR**\n\nAs a general rule of thumb, assuming you have access to a low-fee (.20% ER or lower) TDF in your tax-advantaged accounts, until you are maximizing your contributions and contributing a significant amount to your taxable account, you are likely better off focusing on your savings rate vs the fund that you are investing in; let professionals handle the asset allocation for you, and you just focus on getting more money in. You can always switch out from the TDF fund at a later date, but you can't go back and contribute to your tax-advantaged accounts for prior years.\n\nAt some point, if you decide your experience / situation justifies going with individual funds, by all means, go for it, but be aware that just because you can do better than a TDF, that doesn't mean that you will.",
  "author_fullname": "t2_depyynqe",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Unpopular Opinion: More People Should Use Target-Date Funds (TDFs)",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/Bogleheads",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": true,
  "name": "t3_v1d8xf",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.89,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 267,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 267,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1653954972,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.Bogleheads",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The &lt;a href=\"/r/Bogleheads\"&gt;r/Bogleheads&lt;/a&gt; subreddit sees many threads where people are asking what fund they should invest in. Personally, I don&amp;#39;t believe that Target Date Funds (TDFs) get nearly the recommendation that they deserve. This is especially pertinent to threads of young / newer investors.&lt;/p&gt;\n\n&lt;p&gt;Far too much weight is put on being able to have control, fees, etc., and not enough weight is placed on more important things like savings rate.&lt;/p&gt;\n\n&lt;p&gt;Investors in the US have experienced a massive bull-run with equities, and there are a lot of new investors who don&amp;#39;t know that stocks don&amp;#39;t just always go up. They&amp;#39;ve never really experienced a major drawdown, and may not have a real handle on their risk tolerance. For these new investors, a TDF that coincides with their reasonable expected retirement date is still going to be very aggressive (e.g., 90/10) according to historical recommendations (e.g., 75/25 rule, age in bonds, etc.). Even seasoned investors can benefit from a simple &amp;quot;put money in and forget about it&amp;quot; strategy where they&amp;#39;re less likely to tinker due to recent performance.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Fees&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;With regard to fees, it is a Boglehead mantra that you want to limit the fees that you spend on your investments, as these are a fixed cost regardless of the performance of the fund.&lt;/p&gt;\n\n&lt;p&gt;My push towards TDFs is entirely based on access to low-cost index TDFs. &lt;strong&gt;Index&lt;/strong&gt;-based TDFs from reputable firms are typically well below a .20% ER fee (some firms offer actively-managed TDFs for a significantly higher fee, and this post does &lt;strong&gt;NOT&lt;/strong&gt; advocate those). A few examples of current fee structures at some reputable firms are:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Vanguard: .08% ER&lt;/li&gt;\n&lt;li&gt;Fidelity: .12% ER&lt;/li&gt;\n&lt;li&gt;Schwab: .08% ER&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;When talking about fees, it&amp;#39;s important to keep things in perspective. The 2022 annual cap (not including for catch-up contributions) for tax-advantaged space for most Americans is $26.5K ($20.5K for 401K + $6K for IRA). A TDF that carries an ER of .20% equates to $53 in annual fees if you maximize the contribution to your tax-advantaged account (obviously less if you&amp;#39;re not contributing $26.5K annually). In most cases, the ER difference between individual funds and a TDF is far less, but I&amp;#39;m using that figure as an example in what I would consider to be a &amp;quot;low-fee&amp;quot; TDF (.20% or less).&lt;/p&gt;\n\n&lt;p&gt;For someone who is not considering a TDF as a result of the fees are too high, can they honestly suggest that they can&amp;#39;t shave $5/mo out of their annual budget? Someone who is not contributing the annual max of their tax-advantaged account would be far better served figuring out a way to get an additional $5/mo into said accounts than worried about the fee difference.&lt;/p&gt;\n\n&lt;p&gt;Even if you&amp;#39;re able to recreate the TDF asset allocation for cheaper with individual funds, human error / emotion in the asset allocation and rebalancing could completely wipe away any savings in fees you have. These funds take care of everything for you. The difference in fees between Vanguard TDF and their Mutual Fund equivalents is about .01-.02%, which is about $5/year.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Investing In Bonds Too Early&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;For many people, a TDF is a bad idea because it includes bonds / fixed income too early in your investment horizon.&lt;/p&gt;\n\n&lt;p&gt;According to &lt;a href=\"https://investor.vanguard.com/investor-resources-education/education/model-portfolio-allocation\"&gt;Vanguard&lt;/a&gt;, the difference between historical returns of a 100% equities portfolio and an 80/20 portfolio is 1.2% annual. Extrapolating that to a 90/10 portfolio, we&amp;#39;re talking about a .6% difference. Using the same math as before with the $26.5K annual tax-advantaged cap, we&amp;#39;re talking about a difference of $160. Can someone who isn&amp;#39;t maximizing their tax-advantaged space really say there is no way to cut out $15/mo out of their annual budget? Even someone maximizing their tax-advantaged space would be better off figuring out how to get $15/mo into their taxable account than worrying about the 10% bond allocation.&lt;/p&gt;\n\n&lt;p&gt;This doesn&amp;#39;t even include the psychological impact of having bonds in the portfolio to dampen market volatility (the worst drawdown for an 80/20 portfolio was 35% vs 43% for 100% equities). Having one fund that you invest all your money into and don&amp;#39;t think about the performance of the individual assets can reduce your ability to tinker in a panic situation (rebalancing between asset classes is handled for you).&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Too Much International Equity Allocation&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The majority of reputable TDFs are going to be weighed along the lines of global market cap weight (e.g., 55-65% US / 35-45% ex-US). For some people, this is too much ex-US exposure.&lt;/p&gt;\n\n&lt;p&gt;This all goes back to the US / ex-US argument, but the irony here is a lot of people often advocate for total market funds from the same companies who offer TDFs. They trust that company to make a US or ex-US &amp;quot;total market&amp;quot; fund by market cap, but don&amp;#39;t trust them to allocate between the two globally?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TDFs Aren&amp;#39;t Perfect&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This is not to say that TDFs are what everyone should invest in.&lt;/p&gt;\n\n&lt;p&gt;TDFs have flaws:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Fees: TDFs (or any AIO / fund-of-funds) are going to be more expensive than the funds that it is comprised of. Actively-managed TDFs are expensive (same as actively-managed Mutual Funds / ETFs), and are not ideal. In a situation where the TDF options are high-fee, going with individual funds is probably preferred (you can always utilize the &amp;quot;portfolio as a whole&amp;quot; method and use IRA / taxable space to develop your own total asset allocation).&lt;/li&gt;\n&lt;li&gt;At some point in your investing career, your portfolio balance (and complexity), annual contributions, and experience can put you in a situation where you may be able to manage the funds DIY and come out ahead. This is especially true for when withdrawing funds from your portfolio.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;As a general rule of thumb, assuming you have access to a low-fee (.20% ER or lower) TDF in your tax-advantaged accounts, until you are maximizing your contributions and contributing a significant amount to your taxable account, you are likely better off focusing on your savings rate vs the fund that you are investing in; let professionals handle the asset allocation for you, and you just focus on getting more money in. You can always switch out from the TDF fund at a later date, but you can&amp;#39;t go back and contribute to your tax-advantaged accounts for prior years.&lt;/p&gt;\n\n&lt;p&gt;At some point, if you decide your experience / situation justifies going with individual funds, by all means, go for it, but be aware that just because you can do better than a TDF, that doesn&amp;#39;t mean that you will.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2shb7",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "v1d8xf",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "BoxerRumbleEJ257",
  "discussion_type": null,
  "num_comments": 16,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/Bogleheads/comments/v1d8xf/unpopular_opinion_more_people_should_use/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/Bogleheads/comments/v1d8xf/unpopular_opinion_more_people_should_use/",
  "subreddit_subscribers": 165487,
  "created_utc": 1653959724,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1653954972,
  "the_new_excerpt": "The r/Bogleheads [/r/Bogleheads] subreddit sees many threads where people are\nasking what fund they should invest in. Personally, I don't believe that Target\nDate Funds (TDFs) get nearly the recommendation that they deserve. This is\nespecially pertinent to threads of young / newer investors.\n\nFar…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/Bogleheads [/r/Bogleheads] サブレディットでは、多くのスレッドが見られ、人々は次のようなことを行っています。\nどのようなファンドに投資すべきかを尋ねているスレッドが多くあります。個人的には、ターゲット・デート・ファンド（TDF）が、そのような勧められ方をしているとは思っていません。\nターゲットデイトファンド（TDF）は、それに値するほど推奨されていないと思っています。これは\n特に若い/新しい投資家のスレッドに適しています。\n\n遠い・・・。",
      "title": "不評の意見 ターゲット・デート・ファンド(TDF)をもっと活用すべき"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在r/Bogleheads[/r/Bogleheads]子版块中，有许多线程，人们在其中\n问他们应该投资什么基金。就个人而言，我不相信Target\n日期基金（TDFs）几乎得到了它们应得的推荐。这一点\n特别是与年轻/较新的投资者的主题有关。\n\n远...",
      "title": "不受欢迎的意见。更多的人应该使用目标日期基金(TDFs)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在r/Bogleheads[/r/Bogleheads]子版塊中，有許多線程，人們在其中\n問他們應該投資什麼基金。就個人而言，我不相信Target\n日期基金（TDFs）幾乎得到了它們應得的推薦。這一點\n特別是與年輕/較新的投資者的主題有關。\n\n遠...",
      "title": "不受歡迎的意見。更多的人應該使用目標日期基金(TDFs)"
    }
  ],
  "source_updated_at": 1654249409425
}