{
  "author": "ssauronn",
  "the_new_excerpt": "Mods do not delete, this is important to me, please read\n\n\n\nI was in my early teens during the '08 crisis. I vividly remember the enormous\nrepercussions that the reckless actions by those on Wall Street had in my\npersonal life, and the lives of those close to me. I was fortunate - my parents\nwere…",
  "original_created_utc": 1611810374,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "版主不要删除，这对我很重要，请阅读\n\n\n\n08年危机期间，我才十几岁。我清楚地记得，巨大的\n华尔街那些人的鲁莽行为对我的影响。\n个人生活，以及我身边的人的生活。我是幸运的--我的父母\n是...",
      "title": "致梅尔文资本、CNBC、潮人和WSB的公开信。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "版主不要刪除，這對我很重要，請閱讀\n\n\n\n08年危機期間，我才十幾歲。我清楚地記得，巨大的\n華爾街那些人的魯莽行爲對我的影響。\n個人生活，以及我身邊的人的生活。我是幸運的--我的父母\n是...",
      "title": "致梅爾文資本、CNBC、潮人和WSB的公開信。"
    }
  ],
  "title": "An Open Letter to Melvin Capital, CNBC, Boomers, and WSB",
  "created_utc": 1611830063,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Mods do not delete, this is important to me, please read</strong></p>\n\n<p>&#x200B;</p>\n\n<p>I was in my early teens during the &#39;08 crisis. I vividly remember the enormous repercussions that the reckless actions by those on Wall Street had in my personal life, and the lives of those close to me. I was fortunate - my parents were prudent and a little paranoid, and they had some food storage saved up. When that crisis hit our family, we were able to keep our little house, but we lived off of pancake mix, and powdered milk, and beans and rice for a year. Ever since then, my parents have kept a food storage, and they keep it updated and fresh.</p>\n\n<p>Those close to me, my friends and extended family, were not nearly as fortunate. My aunt moved in with us and paid what little rent she could to my family while she tried to find any sort of work. Do you know what tomato soup made out of school cafeteria ketchup packets taste like? My friends got to find out. Almost a year after the crisis&#39; low, my dad had stabilized our income stream and to help out others, he was hiring my friends&#39; dads for odd house work. One of them built a new closet in our guest room. Another one did some landscaping in our backyard. I will forever be so proud of my parents, because in a time of need, even when I have no doubt money was still tight, they had the mindfulness and compassion to help out those who absolutely needed it.</p>\n\n<p>To Melvin Capital: you stand for everything that I hated during that time. You&#39;re a firm who makes money off of exploiting a company and manipulating markets and media to your advantage. Your continued existence is a sharp reminder that the ones in charge of so much hardship during the &#39;08 crisis were not punished. And your blatant disregard for the law, made obvious months ago through your (for the Melvin lawyers out there: alleged) illegal naked short selling and more recently your obscene market manipulation after hours shows that you haven&#39;t learned a single thing since &#39;08. And why would you? Your ilk were bailed out and rewarded for terrible and illegal financial decisions that negatively changed the lives of millions. I bought shares a few days ago. I dumped my savings into GME, paid my rent for this month with my credit card, and dumped my rent money into more GME (which for the people here at WSB, I would not recommend). And I&#39;m holding. This is personal for me, and millions of others. You can drop the price of GME after hours $120, I&#39;m not going anywhere. You can pay for thousands of reddit bots, I&#39;m holding. You can get every mainstream media outlet to demonize us, I don&#39;t care. I&#39;m making this as painful as I can for you.</p>\n\n<p>To CNBC: you must realize your short term gains through promoting institutions&#39; agenda is just that - short term. Your staple audience will soon become too old to care, and the millions of us, not just at WSB but every person affected by the &#39;08 crash that&#39;s now paying attention to GME, are going to remember how you stuck up for the firms that ruined so many of us, and tried to tear down the little guys. I know for sure I&#39;ll remember this. In response, here is a <a href=\"https://www.cnbcevents.com/sponsors/\">list of CNBC sponsors and partners</a>. They include, but are not limited to, <strong>IBM</strong>, <strong>Cisco</strong>, <strong>TMobile</strong>, <strong>JPMorgan</strong>, <strong>Oracle</strong>, and <strong>ZipRecruiter</strong>. Their parent company is <a href=\"https://en.wikipedia.org/wiki/NBCUniversal\">NBCUniversal</a>, owned by <strong>Comcast</strong> and <strong>GE</strong>.</p>\n\n<p>To the boomers, and/or people close to that age, just now paying attention to these &quot;millennial blog posts&quot;: you realize that, even if you weren&#39;t adversely effected by the &#39;08 crash, your children and perhaps grandchildren most likely were? <em>We&#39;re not enemies, we&#39;re on the same side</em>. Stop listening to the media that&#39;s making us out to be market destroyers, and start rooting for us, because we have a once in a lifetime opportunity to punish the sort of people who caused so much pain and stress a decade ago, and we&#39;re taking that opportunity. Your children, your grandchildren, might have suffered as I described because of the institutions that we&#39;re fighting against. You really want to choose them, over your own family and friends? We&#39;re not asking you to risk your 401k or retirement fund on a single GME bet. We&#39;re just asking you to be understanding, supportive, and to not support the people that caused so much suffering a decade ago.</p>\n\n<p>To WSB: you all are amazing. I imagine that I&#39;m not the only one that this is personal for. I&#39;ve read myself so many posts on what you guys went through during the &#39;08 crash. Whether you&#39;re here for the gains, to stick it to the man as I am, or just to be part of a potentially market changing movement - thank you. Each and every one of you are the reason that we have this chance. I&#39;ve never felt this optimistic about the future before. This is life changing amounts of money for so many of you, and to be part of a rare instance of a wealth distribution from the rich to the poor is just incredible. I love you all.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Note: I can&#39;t seem to get a hold of mods and they keep fucking removing the post. I have no idea how to get this to stick and its important to me that the people I&#39;m addressing read it.</p>\n</div><!-- SC_ON -->",
  "score": 142392,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/qY7hzxX8Hs_ej4apat5dGQBXJbriKEqRKggMy2H17O4.jpg?auto=webp&s=d8252aa08cca9f3c8a20024e81f05afc2b34f67d",
          "width": 600,
          "height": 314
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/qY7hzxX8Hs_ej4apat5dGQBXJbriKEqRKggMy2H17O4.jpg?width=108&crop=smart&auto=webp&s=60e1e2ec44b4b839ac10876405e43e1169c57470",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/qY7hzxX8Hs_ej4apat5dGQBXJbriKEqRKggMy2H17O4.jpg?width=216&crop=smart&auto=webp&s=a084cca0091fc94476f33d2ce7e6ca11976f2e11",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/qY7hzxX8Hs_ej4apat5dGQBXJbriKEqRKggMy2H17O4.jpg?width=320&crop=smart&auto=webp&s=60805b0f59fc4fd1693a550f4f5e269443890bf3",
            "width": 320,
            "height": 167
          }
        ],
        "variants": {},
        "id": "tI9W6KVMs0KgCSzP7O7P_pKjCz54T-S5bhXhAX-W--A"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/wallstreetbets/comments/l6omry/an_open_letter_to_melvin_capital_cnbc_boomers_and/",
  "subreddit": "wallstreetbets",
  "id": "l6omry",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518543335
}