{
  "author": "KAX1107",
  "original_created_utc": 1636723788,
  "title": "Run with Bitcoin. 400 days, 40 countries. No FIAT.",
  "created_utc": 1636735082,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Namaste Bitcoin Family,</p>\n\n<p>My name is Paco, and I am crazy enough to want to travel to 40 countries in 400 days, only with Bitcoin. Bear with me please, here’s why.</p>\n\n<p>I am a self-motivated traveler and I have been couch-surfing for the last 6 years.</p>\n\n<p>In 2007 when I came to India for education, $1=38rs,</p>\n\n<p>and now it’s 2021, $1=76rs.</p>\n\n<p>In 2000 Argentina was $1 = 1Peso,</p>\n\n<p>In 2018 during my travel, it was $1 = 25 Pesos,</p>\n\n<p>2021 the same $1 = 100 Pesos.</p>\n\n<p>You know how the story goes. You guys know it way better than me.</p>\n\n<p>Throughout my journey, over the years I have seen plights of citizens in these hyperinflating regions. Folks, running like crazy every day to make their ends meet.</p>\n\n<p>Recently a friend of mine gave me the book “The Bitcoin Standard” and I have been going down the rabbit hole ever since. Over my study in the last few weeks, it went like a blaze, and I could see how many experiences I had from my past travels were correlated with the plights of the fiat currency world.</p>\n\n<p>I came to believe that “sound money”, that people can take their own custody of, is necessary for a working society, and Bitcoin is a possible way to achieve that. Although I don’t know much about how it works under the hood, I feel at home looking at the ethos and dreams of the Bitcoin community, striving for a bitcoinized world. And I wanna be part of that story.</p>\n\n<p>My past travels and experiences provided me a direct path to achieve that. I have been running around the world since I was 24. I will run again, and this time I will do it with Bitcoin while vlogging my entire journey. I will spend in Bitcoin, I will earn in Bitcoin, I will receive your love in Bitcoin, and I will talk about Bitcoin and try to convince whoever I can to accept Bitcoin from me as a payment.</p>\n\n<p>And most importantly I will come and meet with all you Bitcoiners out there in the world and share the love. No matter where you are, I am gonna find you, and I am gonna hug you.</p>\n\n<p>So come along on this wild ride with me. Support me with donations, arrangements, hosting, or just prayers and kind words.</p>\n\n<p>One day we will meet each other at the dawn of HyperBitcoinization, at the end of our current Fiat Tyranny. Till then keep fighting the good fight.</p>\n\n<p>Why am I doing this?</p>\n\n<p>Mass Awareness &amp; Show the kindness of Humans of Bitcoin around the world through the vlogs that will be shared on my youtube channel. The world is a kind place.</p>\n\n<p>Over and out.</p>\n\n<p>Paco De La, India.</p>\n\n<p>Website - <a href=\"https://support.runwithbitcoin.com/\">https://support.runwithbitcoin.com/</a></p>\n\n<p>Twitter - <a href=\"https://twitter.com/RunwithBitcoin\">https://twitter.com/RunwithBitcoin</a></p>\n\n<p>YouTube - <a href=\"https://www.youtube.com/c/PacoDeLaIndia/\">https://www.youtube.com/c/PacoDeLaIndia/</a></p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/Bitcoin/comments/qsb71b/run_with_bitcoin_400_days_40_countries_no_fiat/",
  "subreddit": "Bitcoin",
  "id": "qsb71b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Namaste Bitcoin Family,\n\nMy name is Paco, and I am crazy enough to want to travel to 40 countries in 400\ndays, only with Bitcoin. Bear with me please, here’s why.\n\nI am a self-motivated traveler and I have been couch-surfing for the last 6\nyears.\n\nIn 2007 when I came to India for education,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ナマステBitcoinファミリー。\n\n私の名前はパコです。私は400日で40カ国を旅したいと思うほどクレイジーです。\nビットコインだけで。なぜかというと、私の話を聞いてください。\n\n私はやる気のある旅行者で、過去6年間カウチサーフィンをしてきました。\n年になります。\n\n2007年に教育のためにインドに来たとき、...",
      "title": "ビットコインで走る。400日、40カ国。FIATなし。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Namaste Bitcoin家族。\n\n我的名字叫Paco，我很疯狂，想在400天内去40个国家旅行，只用比特币。\n400天内到40个国家旅行，只用比特币。请容忍我，这就是原因。\n\n我是一个自我激励的旅行者，在过去的6年里，我一直在沙发上冲浪。\n6年了。\n\n2007年，当我来到印度求学时，...",
      "title": "用比特币运行。400天，40个国家。没有FIAT。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Namaste Bitcoin家族。\n\n我的名字叫Paco，我很瘋狂，想在400天內去40個國家旅行，只用比特幣。\n400天內到40個國家旅行，只用比特幣。請容忍我，這就是原因。\n\n我是一個自我激勵的旅行者，在過去的6年裏，我一直在沙發上衝浪。\n6年了。\n\n2007年，當我來到印度求學時，...",
      "title": "用比特幣運行。400天，40個國家。沒有FIAT。"
    }
  ]
}