{
  "author": "AliceStokesPaul",
  "the_new_excerpt": "I have come here with a simple ask, Mr. Nolan. I watched in awe and admiration\nas you told the heroic story of our brave soldiers during a dramatic turning\npoint in that great tragedy, the Second World War, in your mutli-award-winning\nmotion picture “Dunkirk.” I was impressed by the care and…",
  "original_created_utc": 1617284876,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我是带着一个简单的请求来的，诺兰先生。我在敬畏和钦佩中看到了\n你讲述了我们勇敢的士兵在戏剧性的转折中的英雄故事。\n在那场伟大的悲剧中，第二次世界大战中，在你的多次获奖中。\n电影 \"敦刻尔克\"。我印象深刻的护理和... I was impressed by the care and...",
      "title": "[咨询]就克里斯托弗-诺兰先生的电影 \"敦刻尔克 \"一事向他提出温和的反驳和礼貌的建议。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是帶着一個簡單的請求來的，諾蘭先生。我在敬畏和欽佩中看到了\n你講述了我們勇敢的士兵在戲劇性的轉折中的英雄故事。\n在那場偉大的悲劇中，第二次世界大戰中，在你的多次獲獎中。\n電影 \"敦刻爾克\"。我印象深刻的護理和... I was impressed by the care and...",
      "title": "[諮詢]就克里斯托弗-諾蘭先生的電影 \"敦刻爾克 \"一事向他提出溫和的反駁和禮貌的建議。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "私は、ノーラン氏に単純な質問をしてここに来ました。私は畏敬と賞賛の念を持って見ていました\n劇的な転換期にある勇敢な兵士たちの英雄的な物語を語るあなたを、私は畏敬の念を持って見ていました。\n第二次世界大戦という悲劇の劇的な転換点における勇敢な兵士たちの英雄的な物語を、数々の賞を受賞した映画「ダンケルク」で\n映画「ダンケルク」。感動したのは、その丁寧さと...",
      "title": "助言】 クリストファー・ノーラン氏の映画「ダンケルク」についての優しい反論と丁寧な提案です。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "私は、ノーラン氏に単純な質問をしてここに来ました。私は畏敬と賞賛の念を持って見ていました\n劇的な転換期にある勇敢な兵士たちの英雄的な物語を語るあなたを、私は畏敬の念を持って見ていました。\n第二次世界大戦という悲劇の劇的な転換点における勇敢な兵士たちの英雄的な物語を、数々の賞を受賞した映画「ダンケルク」で\n映画「ダンケルク」。感動したのは、その丁寧さと...",
      "title": "助言】 クリストファー・ノーラン氏の映画「ダンケルク」についての優しい反論と丁寧な提案です。"
    }
  ],
  "title": "[Advice] A gentle rejoinder and polite suggestion to Mr. Christopher Nolan upon the matter of his moving picture “Dunkirk”",
  "created_utc": 1617310894,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have come here with a simple ask, Mr. Nolan. I watched in awe and admiration as you told the heroic story of our brave soldiers during a dramatic turning point in that great tragedy, the Second World War, in your mutli-award-winning motion picture “Dunkirk.” I was impressed by the care and attention you gave to those heroic boys and men on the beach, on the water, and in the air. My entreat is that you take your gifts, that remarkable talent you have for storytelling, and the same structure and apply them to a similarly dramatic day, March 3, 1913. </p>\n\n<p>It is my understanding that one of the subplots that you so deftly wove together in your movie began one week before the events on the beach. I do not think it is possible to capture in words the energy and collaboration that filled the air just seven days before that auspicious date. This is why I am calling upon you to remake “Dunkirk” but about Woman Suffrage Procession, the first massive political march in our nation’s capital. You see, the week before, the orderly streets of the city were filled with my fellow suffragists. Our sisterly bond was strong enough to fill the air and stir the hearts of even those who saw us as nothing more than a nuisance. The wives of our country’s politicians joined our efforts, not to abandon their wifely and motherly duties, but to work towards to goal of being better wives and better mothers. After all, how much good can a wife and mother be if she cannot use her innate talents to shape the direction of our country through her vote? The cafes and parlors of Washington, D.C. practically overflowed as we gathered in preparation. We planned. We strategized. We argued. And isn’t the work of suffrage for all the women of our great country worthy of the same attention as the light that is shone upon the horrors of war? We threw our bodies into the fight, much like those boys and men. My body still carries the evidence of the harm cast down upon me for demanding that which I am entitled to as an American. There are more than enough stories from that week for you to choose from. Other directors have referenced that wonderful, fateful day (I shall not mention it by name but only say one such film referenced a metal and the shape of our faces and I did not approve. It was &quot;Iron-Jawed Angels.&quot; I hated it.) and missed the mark. I trust you to do better.  </p>\n\n<p>One day before. It is also my understanding that when an esteemed director such as yourself sets to work crafting a motion picture, you have access to experts. Expert costumers who will be able to capture the remarkable sight of thousands of women, marching together, resplendent in our dresses and sashes. Your costumers will surely give care to the colors we chose for our clothing on that day, understanding that we were not focused on what flattered each individual woman, but to communicate we were a rainbow, emerging from that dark night of disenfranchisement. I also understand you’ll have access to a team who will carefully and thoughtfully select women to portray myself and my dear beloved friends, sisters of my heart, such as the brilliant author Miss Helen Keller, the graceful and talented dancer and our choreographer Miss Florence Fleming Noyes, the politicians Miss Jeannette Rankin, Miss Charlotte Anita Whitney, and so many more. The ever-forward-thinking philanthropist, Mrs. Katharine McCormick who should be known to every woman who would control the rate at which she had children. I could go on for days about my sisters who deserve to have their names and faces up on that large screen. Your trusted crew could tell how we spend that last day building the grandstand with our hands. How we practiced the various tableaux that would unfold during the process. Put the final touches on the floats that told the history of the fight for suffrage. How we celebrated with the marchers from New Zealand, Norway, Finland, and Australia – our sisters from abroad who already had the power of suffrage. Oh, Mr. Nolan. It was a day of beauty beyond compare. Beyond words. </p>\n\n<p>One hour before the Woman Suffrage Procession began, my beloved friend and confident Mrs. Inez Milholland mounted her magnificent horse, “Gray Dawn” and took her place at the head of our procession. I rushed about, finalizing the details and alas, much of that hour is lost to memory and time. I know, though, I am not perfect. I made mistakes. I had the opportunity to meet with the esteemed Mrs. Ida Wells-Barnett and I am ashamed to say I did not take it. The most visually striking part of your narrative, Mr. Nolan, was the image of that handsome, young pilot having to make a difficult choice, miles from home, unable to see the full scope of what was unfolding around him. I connected most with him as I was likewise unable to see the full picture. I did not understand the impact of my actions would have on the Black women who marched with us. I did not recognize my focus on suffrage for me and my white sisters failed my Black sisters. My Native sisters, first of this nation. My Chinese sisters, thousands of miles from home. My sisters on our Southern border, ever caught between the boundaries of two countries and two languages. My sisters trapped in institutions of whose horrors must be told. I shall speak no more on my faults but trust you to see them and bring them to light, in the same way you told that pilot’s story. </p>\n\n<p>I am appealing to you not because I think a man filmmaker can better tell the story of that day than a woman filmmaker. I am not a naïve sort, Mr. Nolan. I know you have had access to budgets larger than that of nearly all women filmmakers combined. I understand you have the ear of studio heads in a way no woman director does. I come to you because you have talent and power. You also recognize that inequities of the world around us and as such, I expect you to hire the finest women costumers, women carpenters, women “best boys” (what an odd name for one who works with their hands) and I expect that when I visit your set, I will be surrounded by women creators and see that you have not only told the story of the glorious Woman Suffrage Procession held on March 3, 1913 but you will have learned from our lessons, and our mistakes. </p>\n\n<p>Yours in solidarity – Miss Alice Paul</p>\n\n<p>Edit to add: My hunch is that some people are downvoting this post as they were disappointed to see it wasn&#39;t actually about &quot;Dunkirk.&quot; In my defense, the act of putting herself directly in front of the men she wanted to convince to support her cause was a common tactic of so-called &quot;militant&quot; American feminists like Alice Paul. She worked to make herself unmistakable and unmissable, including showing up in places she wasn&#39;t expected or welcome.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/mhvob3/advice_a_gentle_rejoinder_and_polite_suggestion/",
  "subreddit": "AskHistorians",
  "id": "mhvob3",
  "is_self": true,
  "media": null,
  "is_video": false
}