{
  "author": "PartTimeAnalyst",
  "original_created_utc": 1634392908,
  "title": "In one sentence, what have you learn from holding Crypto over the months/years",
  "created_utc": 1634406024,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Investing in Crypto has definitely been extremely volatile and many of you guys know it. During May, everyone thought we were heading for Crypto winter and the board was bearish across. </p>\n\n<p>However, I believe that many of us in the community held strong and manage to dollar cost average during this period 2021. However, there were many more significant dips for those who have held on from 2013 onwards.</p>\n\n<p>To those new and OG members in this community, in one sentence, what have you really learn from holding your crypto over the months/years.</p>\n\n<p>I&#39;ll go first, in one sentence, &quot;BUY THE F**KING DIP&quot;.</p>\n\n<p>&#x200B;</p>\n\n<p>What are your thoughts? I really want to know what this community thinks</p>\n</div><!-- SC_ON -->",
  "score": 228,
  "permalink": "/r/CryptoCurrency/comments/q9cm0t/in_one_sentence_what_have_you_learn_from_holding/",
  "subreddit": "CryptoCurrency",
  "id": "q9cm0t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Investing in Crypto has definitely been extremely volatile and many of you guys\nknow it. During May, everyone thought we were heading for Crypto winter and the\nboard was bearish across.\n\nHowever, I believe that many of us in the community held strong and manage to\ndollar cost average during this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Cryptoへの投資は間違いなく非常にボラティリティが高く、皆さんの多くは\nはそれを知っています。5月には、誰もがCryptoの冬に向かっていると考え、全体的に弱気になっていました。\n全体的に弱気になっていました。\n\nしかし、私たちコミュニティの多くの人たちは、この期間中にドル・コスト・アベレージを維持したと信じています。\nドル・コスト・アベレージで...",
      "title": "数ヶ月、数年にわたって暗号を保有してきたことから学んだことを一言で。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "投资加密货币绝对是非常不稳定的，你们中的许多人都知道。\n知道这一点。在5月份，每个人都认为我们正在走向加密货币的冬天，并且\n板块都是看跌的。\n\n然而，我相信我们社区中的许多人都很坚强，并设法在这段时间内实现了\n在这段时间里，美元成本平均数...",
      "title": "用一句话来说，你从几个月/几年来持有加密货币中学到了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "投資加密貨幣絕對是非常不穩定的，你們中的許多人都知道。\n知道這一點。在5月份，每個人都認爲我們正在走向加密貨幣的冬天，並且\n板塊都是看跌的。\n\n然而，我相信我們社區中的許多人都很堅強，並設法在這段時間內實現了\n在這段時間裏，美元成本平均數...",
      "title": "用一句話來說，你從幾個月/幾年來持有加密貨幣中學到了什麼？"
    }
  ]
}