{
  "author": "throwaway_bitcoinq",
  "original_created_utc": 1634925672,
  "title": "Deceased friend’s bitcoin credentials",
  "created_utc": 1634938246,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Throwaway for obvious reasons. I’ll try to be concise: my friend committed suicide in 2012 and his parents gave me his laptop. I only turned it on occasionally to look at the pictures he had of us on it, but six months ago I found a word file with bitcoin details on. It was everything you aren’t supposed to keep on your computer - his account (for a “blockchain wallet”), password, and seed. I’ve since educated myself on bitcoin, but I can’t bring myself to look at his account, even in the block explorer to just see if there’s a balance. He was a very smart guy but was into buying drugs online (which is what I think he used bitcoin for). It feels like it would be wrong to see if there’s a balance, and part of me thinks I just want to leave it untouched. What are your thoughts?</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/Bitcoin/comments/qdmjp9/deceased_friends_bitcoin_credentials/",
  "subreddit": "Bitcoin",
  "id": "qdmjp9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Throwaway for obvious reasons. I’ll try to be concise: my friend committed\nsuicide in 2012 and his parents gave me his laptop. I only turned it on\noccasionally to look at the pictures he had of us on it, but six months ago I\nfound a word file with bitcoin details on. It was everything you aren’t…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "当然のことながら捨てられた。簡潔に説明しますと、私の友人が2012年に自殺して\n2012年に友人が自殺し、彼の両親からノートパソコンをもらいました。たまにしか電源を入れていませんでしたが\n私たちの写真を見るためにたまに電源を入れていたのですが、半年前に\nビットコインの詳細が書かれたワードファイルを見つけました。それはあなたが知らないことばかりで...",
      "title": "亡くなった友人のビットコインの認証情報"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "扔掉的原因显而易见。我试着简明扼要地说：我的朋友在2012年自杀了\n2012年自杀，他的父母把他的笔记本电脑给了我。我只打开了它\n偶尔打开看看他放在上面的我们的照片，但六个月前我\n发现了一个包含比特币细节的word文件。这是你所不...",
      "title": "已故朋友的比特币凭证"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "扔掉的原因顯而易見。我試着簡明扼要地說：我的朋友在2012年自殺了\n2012年自殺，他的父母把他的筆記本電腦給了我。我只打開了它\n偶爾打開看看他放在上面的我們的照片，但六個月前我\n發現了一個包含比特幣細節的word文件。這是你所不...",
      "title": "已故朋友的比特幣憑證"
    }
  ]
}