{
  "author": "Swimming-Explorer-51",
  "original_created_utc": 1636465218,
  "title": "Netflix shows promoting crypto but always as a scam or associated with drugs or money laundering. Early or not this will eventually change!",
  "created_utc": 1636497584,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So this week I was watching the so famous tv show &quot;You&quot; and also a new Korean tv show called &quot;Extracurricular&quot; and who&#39;d think Crypto would come up.  </p>\n\n<p>Well it did and once again with a bad &quot;connotation&quot; to it.   </p>\n\n<p>For &quot;You&quot; it was as simple as the main character wanting to buy some drugs from a kid and the kid saying &quot;I only accept Bitcoin&quot;. Which on one side it promotes BTC as being associated with the black market and the drug selling world but on the other side it also makes you think that the main character was indeed investing in the coin because he ended up buying the drugs. So let&#39;s say no promotion is bad promotion.  </p>\n\n<p>For &quot;Extracurricular&quot; one of the characters from the show has a gambling problem and ends up putting all his money into a meme coin pretty much like squid game but in the show it is called &quot;doolycoin&quot; and he claims to have done so because he got some inside info that it would pump. Well, 5 minutes later and it dumped hard.  </p>\n\n<p>Even though in both tv shows crypto is associated with bad things it is always a good sign that it is becoming famous no matter in what way. However, I think this will eventually change and people will get educated, start to trust it and avoid some of the most obvious scams.  </p>\n\n<p>I believe blockchain will run the future and Bitcoin can take a very important role on it. So hang on tight, do your own research and try to avoid scams. Because in the near future Bitcoin will most definitely appear in tv shows as the normal way of exchanging money and buying products and not as the most wanted criminal for digital money.  </p>\n\n<p>To all of you that believe in this project and got in early, I am confident that it will most definitely be rewarding in the long run!</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/qq3wgk/netflix_shows_promoting_crypto_but_always_as_a/",
  "subreddit": "CryptoCurrency",
  "id": "qq3wgk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So this week I was watching the so famous tv show \"You\" and also a new Korean tv\nshow called \"Extracurricular\" and who'd think Crypto would come up.\n\nWell it did and once again with a bad \"connotation\" to it.\n\nFor \"You\" it was as simple as the main character wanting to buy some drugs from\na kid and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今週、私は有名なテレビ番組「You」と、韓国の新しいテレビ番組「Extracurricular」を見ていました。\n課外授業」という韓国の新番組を見ていたのですが、暗号が出てくるとは思いませんでした。\n\nそして、またしても悪い意味合いの暗号が出てきたのです。\n\nYou」では、主人公が子供からドラッグを買おうとしただけの簡単な話でした。\n子供から薬を買おうとしただけなのに...。",
      "title": "Netflixの番組では、暗号を宣伝していますが、いつも詐欺だったり、麻薬やマネーロンダリングに関連していたりします。早いか遅いかは別として、これはいずれ変わるでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以这周我正在看著名的电视节目 \"你 \"和一个新的韩国电视节目 \"课外活动\"。\n节目，谁会想到Crypto会出现在这里。\n\n它确实出现了，而且又一次带有不好的 \"内涵\"。\n\n对于 \"你 \"来说，它只是简单的主角想从一个孩子那里购买一些毒品\n一个孩子和...",
      "title": "Netflix节目宣传加密货币，但总是作为一个骗局或与毒品或洗钱有关。无论是否早期，这最终会改变"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以這周我正在看著名的電視節目 \"你 \"和一個新的韓國電視節目 \"課外活動\"。\n節目，誰會想到Crypto會出現在這裏。\n\n它確實出現了，而且又一次帶有不好的 \"內涵\"。\n\n對於 \"你 \"來說，它只是簡單的主角想從一個孩子那裏購買一些毒品\n一個孩子和...",
      "title": "Netflix節目宣傳加密貨幣，但總是作爲一個騙局或與毒品或洗錢有關。無論是否早期，這最終會改變"
    }
  ]
}