{
  "author": "breezylurker5",
  "original_created_utc": 1637026713,
  "title": "Does life get better after high school? I hope so",
  "created_utc": 1637056665,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My only motivations for going to school is to get out of it, and move on with my life and doing something I love. Often times my encounters with students are dreadful and leave me scared to go to school and self conscious. This is a genuine question I am asking, and I want to know some of your personal experiences with this.</p>\n\n<p>Edit: thank you to everyone that responded to this. I asked this question because I have been trying to become more motivated to push through and bust my ass every day with good assignments, so I can leave ASAP while keeping my time occupied and not losing interest in persevering. I’m taking online math, geography and chemistry right now and I’ve been very working very hard on assignments. I want to put more time into it too (whole school day during lunch hour too and bus rides there and home) and working until 11:30 at night on assignments. So that I can get this done. I left 4 classes last year gr 11 so I’m with people a year younger than me in Chem trying to earn these credits. I’ll read more of these tomorrow. I gotta go to sleep for school.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/quw48y/does_life_get_better_after_high_school_i_hope_so/",
  "subreddit": "NoStupidQuestions",
  "id": "quw48y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My only motivations for going to school is to get out of it, and move on with my\nlife and doing something I love. Often times my encounters with students are\ndreadful and leave me scared to go to school and self conscious. This is a\ngenuine question I am asking, and I want to know some of your…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が学校に行く唯一の動機は、学校を卒業して、自分の人生を歩み、好きなことをすることです。\n好きなことをして生きていくことです。学生との出会いは、しばしば恐ろしいものです。\n学校に行くのが怖くなり、自意識過剰になってしまいます。これは\nこれは私の純粋な疑問であり、あなた方のことを知りたいのです...",
      "title": "高校卒業後の人生は良くなるのか？そうであってほしい"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我去学校的唯一动机是离开学校，继续我的生活，做我喜欢的事情。\n生活，做我喜欢的事情。很多时候，我与学生的接触是\n让我害怕去学校，并有自我意识。这是一个\n我想知道你的一些看法。",
      "title": "高中毕业后生活会变得更好吗？我希望如此"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我去學校的唯一動機是離開學校，繼續我的生活，做我喜歡的事情。\n生活，做我喜歡的事情。很多時候，我與學生的接觸是\n讓我害怕去學校，並有自我意識。這是一個\n我想知道你的一些看法。",
      "title": "高中畢業後生活會變得更好嗎？我希望如此"
    }
  ]
}