{
  "author": "sharpgreen",
  "original_created_utc": 1627563861,
  "title": "Free college level MIT course on the subject of cryptocurrency and economics",
  "created_utc": 1627577741,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There is a free semester on college level available about blockchain technology, cryptocurrency and economics in general. You can search for “blockchain and money MIT” and follow this course for free, which I can highly recommend. I thought I knew something about this subject we are all in togeher, but still got across a bunch of new points to discover. It takes some time to get through it all. Some keypoints for what you are going to find:</p>\n\n<ul>\n<li>20+ video lectures, 1+ hour each</li>\n<li>Delving into blockchain technology, cryptocurrency and economics in general</li>\n<li>Taught by Gary Gensler, former investment banker and government official and teaching at MIT Sloan School of Management</li>\n<li>Transcript and lecture slides available</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 208,
  "permalink": "/r/CryptoCurrency/comments/otx3ap/free_college_level_mit_course_on_the_subject_of/",
  "subreddit": "CryptoCurrency",
  "id": "otx3ap",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There is a free semester on college level available about blockchain technology,\ncryptocurrency and economics in general. You can search for “blockchain and\nmoney MIT” and follow this course for free, which I can highly recommend. I\nthought I knew something about this subject we are all in togeher,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ブロックチェーン技術について、大学レベルの無料セメスターが用意されています。\nブロックチェーン技術、暗号通貨、経済学全般について、大学レベルで無料で学べます。ブロックチェーンと貨幣 MIT」で検索すると\nmoney MIT」で検索して、このコースを無料で受講することができますが、これはとてもお勧めできます。I\nこのテーマについて何か知っていると思っていたのですが、私たちは皆、一緒にいるのですね。",
      "title": "暗号通貨と経済をテーマにした大学レベルのMIT無料講座"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一个关于区块链技术的大学水平的免费学期。\n加密货币和一般的经济学。你可以搜索 \"区块链和\n货币麻省理工学院\"，免费学习这个课程，我可以强烈推荐。I\n我以为我对这个问题有所了解，我们都是在一起的，...",
      "title": "麻省理工学院关于加密货币和经济学主题的免费大学水平课程"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一個關於區塊鏈技術的大學水平的免費學期。\n加密貨幣和一般的經濟學。你可以搜索 \"區塊鏈和\n貨幣麻省理工學院\"，免費學習這個課程，我可以強烈推薦。I\n我以爲我對這個問題有所瞭解，我們都是在一起的，...",
      "title": "麻省理工學院關於加密貨幣和經濟學主題的免費大學水平課程"
    }
  ]
}