{
  "author": "n0lefin",
  "original_created_utc": 1626453999,
  "title": "Rule #1, 2, 3, 4 & 5 - literally never respond to a DM from anyone mentioning anything about Crypto. EVER.",
  "created_utc": 1626467497,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don’t care if they’re offering Cathy Wood’s feet pics for your seed phrase, resist the temptation. </p>\n\n<p>Seriously though, there is nothing anyone in your DMs can do for you that isn’t a scam. There’s a reason why they’re hiding in your DMs instead of just posting about it or replying to you in public - because they’ll get railroaded by a thousand commenters calling them out.</p>\n</div><!-- SC_ON -->",
  "score": 194,
  "permalink": "/r/CryptoCurrency/comments/olkqmt/rule_1_2_3_4_5_literally_never_respond_to_a_dm/",
  "subreddit": "CryptoCurrency",
  "id": "olkqmt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don’t care if they’re offering Cathy Wood’s feet pics for your seed phrase,\nresist the temptation.\n\nSeriously though, there is nothing anyone in your DMs can do for you that isn’t\na scam. There’s a reason why they’re hiding in your DMs instead of just posting\nabout it or replying to you in public …",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "キャシー・ウッドの足の写真を種明かしに提供していても構いません。\n誘惑に負けないで。\n\n真面目な話、あなたのDMに入っている人があなたのためにできることは、詐欺ではありません。\n詐欺ではありません。あなたのDMに隠れているのには理由があります。\nあなたのDMに隠れているのには理由があります．",
      "title": "ルール1、2、3、4、5 - Cryptoについて言及している人からのDMには、文字通り絶対に返信しない。絶対にです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不在乎他们是否为你的种子短语提供凯西-伍德的脚部照片。\n抵制诱惑。\n\n不过说真的，在你的DMs中，没有任何人能为你做什么，这不是\n一个骗局。他们躲在你的DMs里，而不是直接发帖或回复你，是有原因的\n而不是在公开场合发帖或回复你......",
      "title": "规则1、2、3、4和5--从字面上看，永远不要回应任何人提及有关加密货币的DM。永远不要。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不在乎他們是否爲你的種子短語提供凱西-伍德的腳部照片。\n抵制誘惑。\n\n不過說真的，在你的DMs中，沒有任何人能爲你做什麼，這不是\n一個騙局。他們躲在你的DMs裏，而不是直接發帖或回覆你，是有原因的\n而不是在公開場合發帖或回覆你......",
      "title": "規則1、2、3、4和5--從字面上看，永遠不要回應任何人提及有關加密貨幣的DM。永遠不要。"
    }
  ]
}