{
  "author": "Sympociaa",
  "original_created_utc": 1626442297,
  "title": "New Social Media Platform Made By Me :)",
  "created_utc": 1626508391,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://sympocia.com/\">https://sympocia.com/</a></p>\n\n<p>Whether we like it or not, the age of social media platforms is booming but not in a good way. How do you feel after using social media platforms like Twitter, Facebook, Instagram, or Reddit? It’s a toss-up, right? 50% chance you leave the platform feeling decent and 50% chance you leave feeling triggered.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Our goal</strong></p>\n\n<p>We at Sympocia think the problem boils down to how people are connecting with each other on these platforms. Connecting these days refers to simply clicking a follow button. No additional work is needed. Sympocia is looking to change everything and hopefully spearhead these platforms in the correct direction</p>\n\n<p>&#x200B;</p>\n\n<p><strong>What changes we made to the game</strong> </p>\n\n<p>Let&#39;s start with how connections are actually made. When you follow someone on other platforms like Facebook or Instagram you essentially gain access to them as a whole but here at Sympocia we are taking a different approach. After you recruit someone you then encounter something we call the friend’s gauge. Essentially, the friend’s gauge is a level system for your posts and you give people access to the level you want them to see or restrict them. You can look at it like peeling an onion. The more you get to know someone, the more posts you see, and the more access you get to their profile as a whole</p>\n\n<p>&#x200B;</p>\n\n<p>Reddit is obviously a huge competitor because we offer something similar to subreddits so let’s talk about how we are different and better than them in that aspect. Subreddits are basically topic-based areas of Reddit ruled by moderators and each one has a cookie-cutter template. We, on the other hand, tailor each symposium(section) of our website to its respective topic and each section has unique questions, topics, and discussion areas to upload to. For example, in the mathematics symposium, there is a specific section to upload the most beautiful formula you’ve seen or get tutoring services. On the other hand, that same space in the poetry symposium is dedicated to giving out poetry-specific advice.</p>\n\n<p>&#x200B;</p>\n\n<p>Additionally, we also introduced new ideas for our symposiums. Beacons is a question-based section where you ask a specific question in either an image, video, or text post and people have to respond in that selected post type. We also brought in an idea called oligarchs which is a system where people are selected to be oligarchs after being elected in a voting contest. Oligarchs can do anything in a symposium and are on paper similar to moderators. The difference is that they have more responsibility, have to be voted in, and can be reset each month after the voting period. No more dictatorships like Reddit.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Quickfire features:</strong></p>\n\n<p>Video descriptions for each post</p>\n\n<p>Audio description for each post</p>\n\n<p>Comment pools</p>\n\n<p>Dedicated sections of a comment section based on a question that the owner decides</p>\n\n<p>Video comments</p>\n\n<p>Champions</p>\n\n<p>Section of your profile that you can highlight a specific person that has hugely impacted you</p>\n\n<p>Crowned posts</p>\n\n<p>Highlighted posts in your profiles that stand out immediately</p>\n\n<p>Authentic post comments</p>\n\n<p>Comment type section where the main goal is to write down if you think a post is authentic or not</p>\n\n<p>A limit of 100 friends per profile</p>\n\n<p><strong>Conclusion</strong> </p>\n\n<p>All in all, we are a new platform trying to change the game. If you like what you see, consider supporting us as we grow but either way we are going to change the game or leave a mark.</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/olgx4w/new_social_media_platform_made_by_me/",
  "subreddit": "SideProject",
  "id": "olgx4w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "https://sympocia.com/\n\nWhether we like it or not, the age of social media platforms is booming but not\nin a good way. How do you feel after using social media platforms like Twitter,\nFacebook, Instagram, or Reddit? It’s a toss-up, right? 50% chance you leave the\nplatform feeling decent and 50%…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://sympocia.com/\n\n好むと好まざるとにかかわらず、ソーシャル・メディア・プラットフォームの時代が到来しています。\n良い意味ではありません。Twitter、Facebook、Instagram、Redditなどのソーシャルメディアを利用した後、あなたはどのように感じますか？\nTwitter、Facebook、Instagram、Redditなどのソーシャルメディアを使った後の気分は？迷うところですね。50%の確率で、あなたはそのプラットフォームを\n50％の確率でまともな気分で帰り、50％の確率で...",
      "title": "私が作った新しいソーシャル・メディア・プラットフォーム :)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://sympocia.com/\n\n无论我们喜欢与否，社交媒体平台的时代正在蓬勃发展，但不是好的方式。\n兴，但并不是好事。使用Twitter等社交媒体平台后，你有什么感觉？\nFacebook、Instagram或Reddit等社交媒体平台后，你的感觉如何？这是个折腾，对吗？50%的机会你离开\n平台时感觉很好，50%...",
      "title": "新的社会媒体平台由我制造 :)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://sympocia.com/\n\n無論我們喜歡與否，社交媒體平臺的時代正在蓬勃發展，但不是好的方式。\n興，但並不是好事。使用Twitter等社交媒體平臺後，你有什麼感覺？\nFacebook、Instagram或Reddit等社交媒體平臺後，你的感覺如何？這是個折騰，對嗎？50%的機會你離開\n平臺時感覺很好，50%...",
      "title": "新的社會媒體平臺由我製造 :)"
    }
  ]
}