{
  "author": "sonaldas110",
  "original_created_utc": 1630464424,
  "title": "There is a little fairy amogus in this sub..",
  "created_utc": 1630514079,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>He/she will come silently and tip you with 2 moons out of nowhere. It feels so sweet when you discover that your moons number got increased by +2. I don&#39;t know what I commented to deserve that but I got tipped two times in a row by that moon fairy. Really thanks and a huge shoutout to <a href=\"/u/LargeSnorlax\">u/LargeSnorlax</a> for being the fairy. I hope your bags get skyrocket soon. You are doing such a great work. Spoiler, this fairy loves to tip in daily section.</p>\n\n<p>This is an extra line to complete the 500 character requirement. I know I could thank him in dm but I thought he really needs the shoutout.</p>\n</div><!-- SC_ON -->",
  "score": 186,
  "permalink": "/r/CryptoCurrency/comments/pfkvj0/there_is_a_little_fairy_amogus_in_this_sub/",
  "subreddit": "CryptoCurrency",
  "id": "pfkvj0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "He/she will come silently and tip you with 2 moons out of nowhere. It feels so\nsweet when you discover that your moons number got increased by +2. I don't know\nwhat I commented to deserve that but I got tipped two times in a row by that\nmoon fairy. Really thanks and a huge shoutout to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼/彼女は無言でやってきて、いきなり2つの月であなたを傾けます。自分のムーンが増えたことを\n自分のムーンが＋2個になったことに気づくと、とても嬉しい気持ちになります。私は何をコメントしたのかわかりませんが\n私は何をコメントしたのかわかりませんが、その月の妖精から2回連続でチップをもらいました。\n月の妖精に2回連続でチップをもらいました。本当にありがとうございます！そして、大いなる称賛を...",
      "title": "このサブには、小さな妖精アモーグがいます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他（她）们会悄悄地来，用2个月亮突然给你提示。当你发现的时候，感觉是如此\n当你发现你的月亮数量增加了2个时，感觉是如此的甜蜜。我不知道\n我不知道我是怎么评论的，但我被那个月亮仙子连续给了两次小费。\n月亮仙子。真的很感谢你，并向......大喊一声。",
      "title": "有一个小仙女amogus在这个子..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他（她）們會悄悄地來，用2個月亮突然給你提示。當你發現的時候，感覺是如此\n當你發現你的月亮數量增加了2個時，感覺是如此的甜蜜。我不知道\n我不知道我是怎麼評論的，但我被那個月亮仙子連續給了兩次小費。\n月亮仙子。真的很感謝你，並向......大喊一聲。",
      "title": "有一個小仙女amogus在這個子..."
    }
  ]
}