{
  "author": "KidsSeeKanye",
  "original_created_utc": 1639534931,
  "title": "Do people actually talk/listen to music in the Car?",
  "created_utc": 1639556034,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Growing up, whenever my parents would drive me around they had a strict no talking/playing music rule and would ground me if I said anything while they drove. Now that I have my license my friends have started saying that it’s super weird driving with me because I don’t talk, and won’t let them play music. I thought that everybody had that same rule growing up, but none of my friends had that rule so idk. I feel like it’s definitely quite common, maybe my friends parents just didn’t enforce the rule that often? Is this a common rule or is it a bit weird?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 136,
  "permalink": "/r/NoStupidQuestions/comments/rgnza0/do_people_actually_talklisten_to_music_in_the_car/",
  "subreddit": "NoStupidQuestions",
  "id": "rgnza0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Growing up, whenever my parents would drive me around they had a strict no\ntalking/playing music rule and would ground me if I said anything while they\ndrove. Now that I have my license my friends have started saying that it’s super\nweird driving with me because I don’t talk, and won’t let them…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "幼い頃、両親の運転する車で移動するときは、いつも厳重に禁止されていた。\n音楽を聴きながら話すというルールがあり、何か話すと外出禁止になります。\n運転する。免許をとってからというもの、友人たちから「超面白い」と言われるようになりました。\n私はしゃべらないし、しゃべらせないので、私と一緒に運転するのは変な感じです。",
      "title": "実際に車の中で音楽を話したり聴いたりしている人はいるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我的成长过程中，每当我的父母开车带我四处游玩时，他们都有一个严格的规定，即禁止\n说话/播放音乐的规则，如果我在他们开车时说了什么，他们就会把我禁足。\n开车。现在我有了驾照，我的朋友们开始说，和我一起开车超级奇怪，因为我不知道该怎么办。\n因为我不说话，也不会让他们...",
      "title": "人们真的会在车里说话/听音乐吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我的成長過程中，每當我的父母開車帶我四處遊玩時，他們都有一個嚴格的規定，即禁止\n說話/播放音樂的規則，如果我在他們開車時說了什麼，他們就會把我禁足。\n開車。現在我有了駕照，我的朋友們開始說，和我一起開車超級奇怪，因爲我不知道該怎麼辦。\n因爲我不說話，也不會讓他們...",
      "title": "人們真的會在車裏說話/聽音樂嗎？"
    }
  ]
}