{
  "author": "Nozymetric",
  "the_new_excerpt": "What is EHang Technologies:\n\nEHang (Nasdaq: EH) is the world's leading autonomous aerial vehicle technology\nplatform company. Our mission is to make safe, autonomous, and eco-friendly air\nmobility accessible to everyone. EHang provides customers in various industries\nwith autonomous aerial vehicle…",
  "original_created_utc": 1613543015,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "什么是易航科技。\n\n易航（纳斯达克股票代码：EH）是全球领先的自主飞行器技术。\n平台公司。我们的使命是让安全、自主、环保的空气。\n每个人都能享受到移动性。EHang为各行业客户提供\n与自主飞行器...",
      "title": "$EH易行控股--买入良机"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "什麼是易航科技。\n\n易航（納斯達克股票代碼：EH）是全球領先的自主飛行器技術。\n平臺公司。我們的使命是讓安全、自主、環保的空氣。\n每個人都能享受到移動性。EHang爲各行業客戶提供\n與自主飛行器...",
      "title": "$EH易行控股--買入良機"
    }
  ],
  "title": "$EH EHang Holdings - A Great Opportunity to Buy",
  "created_utc": 1613570230,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>What is EHang Technologies:</strong></p>\n\n<p>EHang (Nasdaq: EH) is the world&#39;s leading autonomous aerial vehicle technology platform company. Our mission is to make safe, autonomous, and eco-friendly air mobility accessible to everyone. EHang provides customers in various industries with autonomous aerial vehicle products and commercial solutions: air mobility (including passenger transportation and logistics), smart city management, and aerial media solutions. As the forerunner of cutting-edge autonomous aerial vehicle technologies and commercial solutions in the global Urban Air Mobility industry, EHang continues to explore the boundaries of the sky to make flying technologies benefit our life in smart cities.</p>\n\n<ol>\n<li><p>My DD Research and Why Ehang Technologies  </p>\n\n<ol>\n<li>January 29th, 2021 ($EH - $66.36) - EHang receives $40M investment from Carmignac. Carmignac is a French <a href=\"https://en.wikipedia.org/wiki/Asset_management\">asset management</a> firm founded in 1989. What is important to note is that they one of the largest funds in all of Europe with $35 billion under management. And furthermore their flagship fund the Carmignac Patrimoine was one of the few funds during the volatility of 2008-2011 that outperformed their peers. I would imagine being one of the premier benchmarked asset management firms in Europe that their DD would have been successfully completed. Any omissions or errors would have been an immediate disapproval. While there has been some cases of bad investment made by firms, it is on the whole a lot rarer.</li>\n<li>December 14th, 2020 - FACC Starts Test Flights with Autonomous Aerial Vehicle EHang 216. The first test flight of the EHang 216 aircraft in national airspace was successfully carried out under the supervision of the Austrian aviation authority Austro Control at the FACC site in St. Martin im Innkreis (Austria). The close and professional cooperation between the specialist teams of Austro Control and FACC led to this milestone. With the successful completion of the system checks and the associated test flight, the aviation authority granted the experimental flight permit for the further execution of EHang 216 test flights.</li>\n<li><strong>Video Link:</strong> <a href=\"https://twitter.com/facc_ag/status/1339922168629653506\">https://twitter.com/facc_ag/status/1339922168629653506</a></li>\n<li><strong>Important to note that FACC is</strong><br/>\n\n<ol>\n<li>FACC is a global aerospace leader when it comes to designing, developing and manufacturing advanced aircraft components and systems. As a technology partner of all major aircraft and engine manufacturers, we are collaborating closely with our customers in order to devise solutions for the mobility of tomorrow. All over the world, an aircraft with FACC technology on board takes off every second. </li>\n<li>In the short fiscal year 2019, FACC generated annual sales amounting to 665 million Euros. We have 2,800 employees from 38 countries working at 13 international sites. Our company is listed on the Vienna Stock Exchange and part of the Fortune 500 AVIC Group.</li>\n</ol></li>\n</ol></li>\n</ol>\n\n<p>EHang 216 undergoing Flight Testing in Austria</p>\n\n<ol>\n<li>There are dozens more of articles/videos that I will not link due to the length it may become but suffice to say you can do you own research.</li>\n<li><p>EHang Founder, Chairman and CEO Honored at Living Legends of Aviation Event First Chinese honoree to be recognized with Technology Innovation Award <a href=\"https://www.ehang.com/news/527.html#:%7E:text=\">https://www.ehang.com/news/527.html#:~:text=</a>  </p>\n\n<ol>\n<li>The same award that was given to Amazon founder Jeff Bezos, SpaceX founder Elon Musk, and Virgin Group founder Sir Richard Branson.</li>\n</ol></li>\n</ol>\n\n<h1></h1>\n\n<p>Today WolfPack Research released on 02/16/21, note this is important as the Chinese New Year Holiday runs from Feburary 11th - Feburary 17th and its a legal holiday week.</p>\n\n<p><a href=\"https://wolfpack-whitepaper.s3.amazonaws.com/EH.pdf?AWSAccessKeyId=ASIAUPWWN73KG77R5OP4&amp;Signature=%2FT3%2FIZPg9Dy%2BlZhyzQjdFo8Huow%3D&amp;x-amz-security-token=IQoJb3JpZ2luX2VjEEoaCXVzLWVhc3QtMSJIMEYCIQD2W97FtzCPNyQ4M7ubfDMWk4CZCN%2Fums06S5xKcaBubgIhAIenmbsZZEuWIag%2BekPHkJI7HYbq%2BXlrWkWdr2WPKOxuKs0BCFIQARoMMzA4NjEzNjExMjIwIgxxgZqM0Lo1NrVfgC0qqgGcxGHCGA%2B1z781XEaYJvBUmdSPL9DeFYVfbKOuFhZbilRffysWHOcsnG6al8eGNXxRcEGWCfWexoRGRIuMI0pmQ%2BVwbQ2PF8S%2BNLQLk2%2F1d1i01nqnmOTb5Ihs5i7336n9LLvslDzhaLTpAAm0D4FJb6jHOqhQt4rhQF2s6TXM4t91wNBLrZzRJUTcqhfcbXrDxlg33p2biikrEltJhpgszvEpLmf5JXwhIDCV27GBBjrfAWUlRTf0DswFo7O%2F3vINRAJ8izCaMVGKf6xaCplp6dokdgYFegOCQiC5r8b3UOOIbfSx9ZOKbWeEIOKy2pASs%2BlkBQHzjUt8WOAo4C%2BZWXmkzgscaiBP%2F2g%2Fe4ndYtpg3bzFUL0NcGaGIX0hioYgp5JY59n6PKTmXrfTG9%2Fsc82Lm4ESDXBFruPESIJ0eHXSgVC99joTMsiCATCJnRwzWR2GHgTafOqGH96f%2B20YA70nr%2FB7%2F1IT78QtYRAQIuMeYQ4UhvKrAgt735VASf2Xuayb%2F1l72sHf7tTQaa3mGSw%3D&amp;Expires=1613529036\">EHANG: A STOCK PROMOTION DESTINED TO CRASH AND BURN</a></p>\n\n<p>Of the portions of the research that are suspicious, or have clearly a bias, or have questionable content as they cannot be confirmed or verified in the report and should be ignored in the report.</p>\n\n<ol>\n<li><p>Suspicious Timing  </p>\n\n<ol>\n<li>As the Chinese New Year is in full swing, it is a week long federal holiday. This ensure that panic sellers will not be able to reach with out any additional information.</li>\n<li>Slow releases starting around 1200EST-1400EST or roughly 2300-0300 in China, which also ensures that any response will be delayed until after panic selling has been complete.</li>\n<li>This in fact caused the stock price to drop almost 62% which brings to price back to roughly ~1 month ago before its run up.</li>\n</ol></li>\n<li><p>Lack of Personnel in EHang Locations, Video Released by Wolfpack Research:  </p>\n\n<ol>\n<li>No metadata on Youtube video, unable to verify date and time stamp. Claimed to be shot during January <em>but no exact dates are provided.</em></li>\n<li>Video taken over the federal holiday, there of course would be no people in the building.</li>\n<li>But what we are able to see is that there are actual EH216 vehicles that are being built and/or assembled, with lots of parts in boxes. If there were actual fraud, there would be absolutely no reason to even spent the effort in having all those parts and pieces. In fact there would be ample security to ensure that no one would ever discover the deception.</li>\n</ol></li>\n<li><p>eVTOL expert Dr. Moore from Uber and NASA  </p>\n\n<ol>\n<li>Regarding his opinion of the use of hobby motors and general quality. Working at NASA we have seen how stagnant NASA has become due to their over redundancy and unwillingness to take risk compared to how SpaceX operates. But redundancy is waste, especially in startups that do not have the federal money. If &quot;hobby&quot; motors work, then why over-engineer something? I think we can draw parallels to early Tesla motors but the key thing is that they worked and that is all that matters.</li>\n<li>Lack of research budget, when you work for NASA anything that is not in the billions would of course be considered anemic, but the company is working first to pioneer passenger VTOLs and then moving on getting acceptance for autonomous technology.</li>\n</ol></li>\n<li><p>Flight Autonomy Dream (Headline: It is not, its already here and it works)  </p>\n\n<ol>\n<li>Flight autonomy is already well used in the the aviation industry. In fact the majority of your domestic and international flights utilize autopilot where the pilot has pre-entered in a specific heading and altitude.</li>\n<li>DJI with their Mavic Air series are able to perform limited autonomous flight in a consumer drone for under $1000 including takeoff, object detection and avoidance, GPS flight routine, landing, and return to base landing. If a consumer drone maker can do this it is not a leap of imagination to think that the same principles can be applied here.</li>\n<li><strong><em>There is nothing special regarding autonomous flight.</em></strong></li>\n<li>In fact you can see from this Wikipedia image regarding autonomous control levels shows that as early as in 2000s with the Predator and Global Hawk autonomous flight was already widely used in the defense sector. Today the focus into the future are fully autonomous swarms, far far ahead of what is necessary for autonomous drone flight.</li>\n</ol></li>\n</ol>\n\n<p>Autonomous Control Level Trend</p>\n\n<ol>\n<li><p>Shanghai Kunxiang Intelligent Technology Office Visit - Distributor of EHang  </p>\n\n<ol>\n<li>Interview with employee who &quot;claimed&quot; to be the finance manager pushing to sell their own drones, which does not make sense because Kunxiang does not make any drones and is a distributor. Also the finance manager reportedly said that their drone had <em>4 hours flight time</em> which is an absolutely unbelievable claim versus EHang&#39;s 30 minutes of total flight time which is far more realistic. No additional evidence was provided by WolfPack regarding the &quot;claimed&quot; finance manager, name, title or any of substance.</li>\n</ol></li>\n</ol>\n\n<p>Of the portions that provide a negative attack and are at best circumstantial evidence</p>\n\n<ol>\n<li># of NewsWire PR Articles - Apparently having 55 news article in 14 months constitutes a pump and dump scheme.</li>\n<li>Lack of Infrastructure Progress and Investments - Because not all progress has gone according to plan, I wonder what other large companies have had the same issues that have become one of the most valuable companies in the world.</li>\n<li><p>Misleading English/Chinese Press Release  </p>\n\n<ol>\n<li>While the titles maybe misleading, Googling the original Chinese press releases identifies does not actually mislead any of the readers. It does not make any false claims regarding passenger vehicles or their permitting, in fact it is actually Dr. Mark Moore who is making the <em>assumptions based upon the title</em>. And you know what they say about assumptions, they make an a** out of you and me. I would think that a NASA engineer would take his time reading the article, I mean they certainly are taking their time with SLS.</li>\n</ol></li>\n</ol>\n\n<p>Of the portions that have merit:</p>\n\n<ol>\n<li><p>Shanghai Kunxiang Intelligent Technology Price Disparity  </p>\n\n<ol>\n<li>Of all the points in the short research, this maybe one of merit.</li>\n<li>The buyer purchased EH216 at widely varying prices from 1.5 million RMB per unit to 150 million RMB as stated in two difference SEC Sales Contract reports. This wide disparity is a note for cause.</li>\n</ol></li>\n<li><p>Rapidly Growing Accounts with low account receivable and allegation of fabricated sales  </p>\n\n<ol>\n<li>Is this not similar to how TSLA presold cars? Additional research needs to be done into this.</li>\n<li>Again the research does not say it is evidence of fabricated sales but only that is a textbook indication. <strong><em>Again circumstantial evidence is not real evidence.</em></strong></li>\n<li><strong><em>Why is this buried at the tail end of the report? At page 19 out of 33.</em></strong> If this was truly damning than it should have been at the forefront.</li>\n</ol></li>\n<li><p>Ongoing Lawsuit  </p>\n\n<ol>\n<li>Could be a future issue, however without knowing the full evidence of the trial it is difficult to make judgement.</li>\n</ol></li>\n</ol>\n\n<p>WolfPack Research History so far (two words, desperate &amp; terrible)</p>\n\n<p><a href=\"https://wolfpackresearch.com/research/#reports\">https://wolfpackresearch.com/research/#reports</a></p>\n\n<p>Of the 6 short researches, all of them insisted that the various companies committed fraud and yet <strong><em>5 out of the 6 stocks</em></strong> are up since their report. I will not mention the tickers as they have all been banned by the mods. With a singular exception, they say a broken clock is wrong twice a day. If ever there was a clear evidence of false reporting and market manipulation this is it. In my opinion WolfPack research utilizes its financial disclaimer purporting that this research is only an expression of their opinion to side step any legal ramifications.</p>\n\n<p>I have to state that $EH has been on a tear lately and as a very young startup it has been on a tremendous run up. It more than likely would have drop due to a pull back but I believe that air transportation will be the next TSLA, especially in China where the population density is 153 per KM2. Electric air transportation is the only way to alleviate the congestion that is plagues their streets and their cities.</p>\n\n<p>But I like this stock!</p>\n\n<p>---------------------------------------------------------------------------------------------------------------------------------------------------</p>\n\n<p>Disclosure: Long on EH since 2020. I/we wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it and I have no business relationship with any company whose stock is mentioned in this article.</p>\n</div><!-- SC_ON -->",
  "score": 90,
  "permalink": "/r/stocks/comments/llnv2o/eh_ehang_holdings_a_great_opportunity_to_buy/",
  "subreddit": "stocks",
  "id": "llnv2o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728625099
}