{
  "author": "scheplick",
  "the_new_excerpt": "I feel compelled to write this post because I am seeing it first hand right now.\nPeople everywhere are asking whether GameStop or AMC or Blackberry or even\nSilver are good buys. Why? Because they are ALL in the news, embedded in culture\nat this very moment. They being texted and shared with friends…",
  "original_created_utc": 1612274070,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得有必要写这篇文章，因为我现在是亲眼所见。\n人们到处都在问，无论是GameStop还是AMC还是黑莓，甚至是。\n白银是好买点。为什么呢？因为它们都在新闻中，嵌入文化中。\n此时此刻。他们被短信和朋友分享... ...",
      "title": "新交易员/投资者必读--黑莓、AMC等"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得有必要寫這篇文章，因爲我現在是親眼所見。\n人們到處都在問，無論是GameStop還是AMC還是黑莓，甚至是。\n白銀是好買點。爲什麼呢？因爲它們都在新聞中，嵌入文化中。\n此時此刻。他們被短信和朋友分享... ...",
      "title": "新交易員/投資者必讀--黑莓、AMC等"
    }
  ],
  "title": "A Must-Read for New Traders/Investors - BlackBerry, AMC, and others",
  "created_utc": 1612286393,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I feel compelled to write this post because I am seeing it first hand right now. People everywhere are asking whether GameStop or AMC or Blackberry or even Silver are good buys. Why? Because they are ALL in the news, embedded in culture at this very moment. They being texted and shared with friends and discussed across the Internet. <strong>I want to write about this to shed light on a really interesting concept in markets related to this and I hope it helps someone.</strong></p>\n\n<p>First of all, there&#39;s an old trader rule that says <em>&quot;if a stock makes the news, you&#39;re late.&quot;</em> What that means is someone who was more prepared, who had built a long-term plan, was involved before the news became a thing. Before you knew what it was. It&#39;s important to remember that people do this for a living -  studying companies, writing about them, reading about them, and building a position over time before the news cycle begins. You need to know this to make better decisions. Otherwise you will chase news headlines and continue to be <em>&quot;late.&quot;</em> Now of course, some people do chase headlines for a living, buying on big news announcements, but just remember that someone out there was there long before it happened. The awareness of this will really change your perspective on markets.</p>\n\n<p>The next topic I want to shed some light on is the broad market and all of the ideas available to you if you just look around. <strong>I see WAY TOO many people talking about AMC and Blackberry and others.</strong> This is silly. There are 3000+ other stocks in the market. That&#39;s right... 3000. Add in crypto and that&#39;s easily another 1000+ crypto projects. Add in forex and futures and that&#39;s easily another 500+ futures and forex trades. The point I am trying to make is - REALLY? You&#39;re going to buy AMC or Blackberry just because you saw a headline? There are 5000+ other trades and ideas out there. Take your time. Be patient. Don&#39;t chase. Look at the entire market. It&#39;s wide open to you.</p>\n\n<p>The final point of this post is the idea that the market is not going anywhere. <strong>Avoid FOMO (Fear of Missing Out) at all costs. My good friend tells me to embrace JOMO (Joy of Missing Out).</strong> The point here, and concluding paragraph, is that the market has been open for 100+ years. It is not going anywhere. No one is telling you to buy or sell. You are talking to yourself and spiraling into a whirlwind of FOMO. You have to take ownership of your portfolio. There is no manipulation or scam going on other than your decision making. The same way you research a car or TV, hours of research, reading reviews, studying your budget, is the same way you should approach markets. There is no rush to do anything. You won&#39;t &quot;miss the move.&quot; As I said, the market has been open 100+ years. Relax. JOMO is a great strategy in certain times.</p>\n\n<p>I hope this post helps and I wrote it because you all mean a lot to me. I have been online talking markets since 2010. I am thankful to the Internet, Reddit, and even Twitter because of the doors they&#39;ve opened in my life. Especially around markets. So I really write this post to help someone, anyone, who is new or confused about the markets. I also want to say that I write this having done all the above. No joke. I have done ALL of the above and been hosed so many times. So I hope this helps.</p>\n\n<p>Thanks for reading and good luck!</p>\n</div><!-- SC_ON -->",
  "score": 884,
  "permalink": "/r/stocks/comments/lavxx7/a_mustread_for_new_tradersinvestors_blackberry/",
  "subreddit": "stocks",
  "id": "lavxx7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518541047
}