{
  "author": "littlebitnotgood",
  "original_created_utc": 1642417117,
  "title": "My Steam account has over 350 games and I realised that I don't even like video game anymore. What can I do to recoup my losses? Or atleast make peace with the loss mentally?",
  "created_utc": 1642427987,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just don&amp;#39;t enjoy video games anymore except for like 2 or 3, and only if I play them occassionally. Is it possible to sell an account? I must have spent over 2 thousand dollars on my games, most of which were impulse purchases during sales. About a third of my games I&amp;#39;ve never even installed and another third I&amp;#39;ve played less than two hours of. And then the other third are games that I don&amp;#39;t even want to play anymore, except maybe dark souls or something. I guess I didn&amp;#39;t fuck up my life from video games so maybe I should just be thankful?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/NoStupidQuestions/comments/s61f9y/my_steam_account_has_over_350_games_and_i/",
  "subreddit": "NoStupidQuestions",
  "id": "s61f9y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I just don't enjoy video games anymore except for like 2 or 3, and only if I\nplay them occassionally. Is it possible to sell an account? I must have spent\nover 2 thousand dollars on my games, most of which were impulse purchases during\nsales. About a third of my games I've never even installed and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "テレビゲームは2、3本しか楽しめなくなった。\nたまにしかやらない。アカウントを売却することは可能でしょうか？今まで\nゲームに2,000ドル以上費やしましたが、そのほとんどは衝動買いでした。\nセール 3分の1くらいはインストールしたこともないゲームだし...。",
      "title": "Steamのアカウントには350本以上のゲームがありますが、私はもうビデオゲームが好きではないのだと気づきました。損失を取り戻すにはどうしたらいいのでしょうか？あるいは、少なくとも精神的に負けたことを受け入れることができますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是不再喜欢视频游戏了，除了两到三个，而且只是在我偶尔玩的时候。\n偶尔玩一下。有可能卖掉一个账户吗？我一定花了\n超过2000美元的游戏，其中大部分是在销售期间冲动购买的。\n销售时冲动购买的。我的游戏中大约有三分之一我甚至从来没有安装过，而且...",
      "title": "我的Steam账户有350多个游戏，我意识到我甚至不喜欢视频游戏了。我能做些什么来挽回我的损失？或者至少在精神上与损失和解？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是不再喜歡視頻遊戲了，除了兩到三個，而且只是在我偶爾玩的時候。\n偶爾玩一下。有可能賣掉一個賬戶嗎？我一定花了\n超過2000美元的遊戲，其中大部分是在銷售期間衝動購買的。\n銷售時衝動購買的。我的遊戲中大約有三分之一我甚至從來沒有安裝過，而且...",
      "title": "我的Steam賬戶有350多個遊戲，我意識到我甚至不喜歡視頻遊戲了。我能做些什麼來挽回我的損失？或者至少在精神上與損失和解？"
    }
  ]
}