{
  "author": "SimpleSwapExchange",
  "original_created_utc": 1624880747,
  "title": "The First Bank In Mexico Is About to Start Accepting Bitcoin",
  "created_utc": 1624890824,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ricardo Salinas Pliego, the third richest man in Mexico, said that he wants his bank to be the first one in Mexico to accept Bitcoin. We heard about lots of banks that already have started to work with crypto, and BTC in particular. The main difference with this case is that Ricardo Salinas Pliego actually believes that BTC is a real equivalent of gold, and that fiat currencies in fact are a fraud. He says that the most significant feature of BTC is the fact that it has a total supply, which cannot be said about any fiat currency.<br/>\nWhat do you think? Is there a real difference? Will it be a successful project?</p>\n</div><!-- SC_ON -->",
  "score": 338,
  "permalink": "/r/Bitcoin/comments/o9ilcc/the_first_bank_in_mexico_is_about_to_start/",
  "subreddit": "Bitcoin",
  "id": "o9ilcc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Ricardo Salinas Pliego, the third richest man in Mexico, said that he wants his\nbank to be the first one in Mexico to accept Bitcoin. We heard about lots of\nbanks that already have started to work with crypto, and BTC in particular. The\nmain difference with this case is that Ricardo Salinas Pliego…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "メキシコで3番目の富豪であるRicardo Salinas Pliego氏は、自分の銀行をメキシコで最初にビットコインを受け入れる銀行にしたいと言っています。\n自分の銀行をメキシコで最初にビットコインを受け入れる銀行にしたいと言っています。私たちは、多くの銀行が\nすでに多くの銀行が暗号、特にBTCの取り扱いを始めていると聞きました。今回のケースとの主な違いは\n今回のケースとの大きな違いは、Ricardo Salinas Pliego...",
      "title": "メキシコ初の銀行がビットコインの取り扱いを開始"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "墨西哥第三大富豪Ricardo Salinas Pliego说，他希望他的银行成为墨西哥第一个接受比特币的银行。\n他希望他的银行成为墨西哥第一家接受比特币的银行。我们听说有很多\n银行已经开始与加密货币合作，特别是BTC。这家银行\n这个案例的主要区别是，里卡多-萨利纳斯-普列戈...",
      "title": "墨西哥的第一家银行即将开始接受比特币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "墨西哥第三大富豪Ricardo Salinas Pliego說，他希望他的銀行成爲墨西哥第一個接受比特幣的銀行。\n他希望他的銀行成爲墨西哥第一家接受比特幣的銀行。我們聽說有很多\n銀行已經開始與加密貨幣合作，特別是BTC。這家銀行\n這個案例的主要區別是，裏卡多-薩利納斯-普列戈...",
      "title": "墨西哥的第一家銀行即將開始接受比特幣"
    }
  ]
}