{
  "author": "Deadlock1920",
  "original_created_utc": 1628856856,
  "title": "Reddit's Wonder Feature: Block User",
  "created_utc": 1628883251,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I come across in the daily thread that a lot of users -even long timers-  do not know this feature.  </p>\n\n<p>When you block a user, you do not see his/her comments anymore. So, if you try to chill, say; on daily with a beer and some chicken wings, meanwhile trying to stay sane due to lambo, dildo, I sold my wife for BTC ehehehe, IT IS HAPPENING!, this is the way!, time in the market beats timing in the market etc etc. for the 43. times in an hour or a user posts a comment per 1.755 second ; I strongly recommend you to use this feature.  </p>\n\n<p>Click on the user, on the right side under username; click on more options and block with pleasure.  </p>\n\n<p>It is THE stuff.  </p>\n\n<p>That is all. Kisses.</p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/p3m5gq/reddits_wonder_feature_block_user/",
  "subreddit": "CryptoCurrency",
  "id": "p3m5gq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I come across in the daily thread that a lot of users -even long timers- do not\nknow this feature.\n\nWhen you block a user, you do not see his/her comments anymore. So, if you try\nto chill, say; on daily with a beer and some chicken wings, meanwhile trying to\nstay sane due to lambo, dildo, I sold my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "毎日のスレッドを見ていると、長い間使っている人でも、多くのユーザーがこの機能を知らないことに気づきます。\nこの機能を知りません。\n\nあるユーザーをブロックすると、そのユーザーのコメントが表示されなくなります。だから、もしあなたが\n例えば、毎日ビールとチキンウィングを食べながら、ランボで正気を保とうとしていても\nランボ、ディルド、私は私のものを売った...などの理由で正気を保とうとしている。",
      "title": "Redditの不思議な機能。ユーザーをブロックする"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在日常工作中发现，很多用户--甚至是老用户--都不知道这个功能。\n知道这个功能。\n\n当你屏蔽一个用户时，你将不再看到他/她的评论。因此，如果你试图\n寒暄，比如说；在日常的啤酒和一些鸡翅，同时试图\n试图保持理智，因为兰博，假阳具，我卖了我的......",
      "title": "Reddit的神奇功能。封锁用户"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在日常工作中發現，很多用戶--甚至是老用戶--都不知道這個功能。\n知道這個功能。\n\n當你屏蔽一個用戶時，你將不再看到他/她的評論。因此，如果你試圖\n寒暄，比如說；在日常的啤酒和一些雞翅，同時試圖\n試圖保持理智，因爲蘭博，假陽具，我賣了我的......",
      "title": "Reddit的神奇功能。封鎖用戶"
    }
  ]
}