{
  "author": "BTC_Stonks",
  "the_new_excerpt": "I cannot be the only one that have seen the shift in the phycology of crypto\ninvestors. The last couple months we have seen the meteoric rise of meme coins\nand shit coins.\n\nIt seems everyone has forgotten about the days were we where content with 5%\ngains a month. We believed in Bitcoin as a…",
  "original_created_utc": 1621592242,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号投資家の心理が変化していることを実感しているのは私だけではないでしょう。\n投資家の方々には ここ数ヶ月は、ミームコインやシットコインの急成長を目の当たりにしました。\nクソコイン。\n\n月に5％の利益で満足していた頃のことを、誰もが忘れてしまったようです。\n月に5％の利益で満足していた時代をみんな忘れてしまったようです。私たちは、ビットコインを信じていました...",
      "title": "ビットコインと暗号通貨のコミュニティ全体に何が起こったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不可能是唯一一个看到加密货币投资者的心理变化的人。\n投资者。在过去的几个月里，我们看到了纪念币和狗屎币的急剧上升。\n和狗屎币。\n\n似乎每个人都已经忘记了我们满足于每月5%收益的日子。\n月收益的日子。我们相信比特币是个好东西...",
      "title": "比特币和加密货币社区作为一个整体发生了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不可能是唯一一個看到加密貨幣投資者的心理變化的人。\n投資者。在過去的幾個月裏，我們看到了紀念幣和狗屎幣的急劇上升。\n和狗屎幣。\n\n似乎每個人都已經忘記了我們滿足於每月5%收益的日子。\n月收益的日子。我們相信比特幣是個好東西...",
      "title": "比特幣和加密貨幣社區作爲一個整體發生了什麼？"
    }
  ],
  "title": "What happened to the Bitcoin and Cryptocurrency community as a whole?",
  "created_utc": 1621620467,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I cannot be the only one that have seen the shift in the phycology of crypto investors. The last couple months we have seen the meteoric rise of meme coins and shit coins. </p>\n\n<p>It seems everyone has forgotten about the days were we where content with 5% gains a month. We believed in Bitcoin as a lifeboat for inflation and government control, it wasn’t all about quick gains. </p>\n\n<p>Now days, I feel like as Bitcoin/Crypto has gone more mainstream, everyone just see’s it as a “get rich quick scheme”. I believe this mentality is actually damaging to crypto in the long run. Not to say all hope is lost, far from it, Bitcoin is a hill i’m prepared to die on. But I fear each time Bitcoin dumps, these types of people are more likely to panic sale instead of hodl, giving whales more monopoly. As I’m not selling this isn’t a problem for me, but again it goes against everything Bitcoin was created for.</p>\n\n<p>Anyone else agree, happy to hear your argument if you don’t?</p>\n</div><!-- SC_ON -->",
  "score": 210,
  "permalink": "/r/Bitcoin/comments/nhp3m3/what_happened_to_the_bitcoin_and_cryptocurrency/",
  "subreddit": "Bitcoin",
  "id": "nhp3m3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197378401
}