{
  "author": "Still_Hat6758",
  "original_created_utc": 1635719628,
  "title": "Where are all the early adopters?",
  "created_utc": 1635762642,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been quite actively lurking on this sub and other crypto subs, seeing when people say they got into crypto and it appears almost 80% are people from the 2017 run. I’m still yet to see anyone who got into it before 2015.</p>\n\n<p>If anyone who sees this that is an honest early adopter and I mean 2009 to 2013 how did you find or even learn about Bitcoin? I couldn’t even imagine stumbling across it back then when social media was very limited and Bitcoin was called a scam countless times. </p>\n\n<p>I saw some posts about how early adopters are part of some group they formed. Not sure where that leads to but I’m just curious as to what it was like over a decade ago</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "permalink": "/r/Bitcoin/comments/qk0ep8/where_are_all_the_early_adopters/",
  "subreddit": "Bitcoin",
  "id": "qk0ep8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve been quite actively lurking on this sub and other crypto subs, seeing when\npeople say they got into crypto and it appears almost 80% are people from the\n2017 run. I’m still yet to see anyone who got into it before 2015.\n\nIf anyone who sees this that is an honest early adopter and I mean 2009 to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブや他の暗号サブで、かなり積極的に潜伏して、いつのまにか\nの人が暗号を始めたということですが、ほぼ8割の人が暗号に興味があるようです。\n2017年の走り。2015年以前にハマった人はまだ見かけませんね。\n\nもしこれを見た人が正直なアーリーアダプターで、2009年から...という意味です。",
      "title": "アーリーアダプターの皆さんは、どこにいるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直很积极地潜伏在这个子网站和其他加密货币子网站上，看到当\n人们说他们进入了加密货币，看来几乎80%是来自2017年的人。\n2017年的运行。我还没有看到有谁在2015年之前就进入了它。\n\n如果有谁看到这一点，是一个诚实的早期采用者，我的意思是2009年到...",
      "title": "所有的早期采用者都在哪里？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直很積極地潛伏在這個子網站和其他加密貨幣子網站上，看到當\n人們說他們進入了加密貨幣，看來幾乎80%是來自2017年的人。\n2017年的運行。我還沒有看到有誰在2015年之前就進入了它。\n\n如果有誰看到這一點，是一個誠實的早期採用者，我的意思是2009年到...",
      "title": "所有的早期採用者都在哪裏？"
    }
  ]
}