{
  "author": "FinancialDominance",
  "the_new_excerpt": "A ton of people in the chat were losing their minds yesterday and the whole chat\nwent from talk of hard, immutable, decentralized, trustless, non inflatable,\npeer to peer money to \"oh mr rich billionaire please buy back your bitcoin\" as\nif we need the elite to buy bitcoin in order for bitcoin to be…",
  "original_created_utc": 1619576868,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日のチャットでは、多くの人が気が狂いそうになっていて、チャット全体が\nハードで、不変で、分散していて、信頼できて、膨張しないピアツーピアのお金の話から\nから、「ああ、金持ちの億万長者さん、あなたのビットコインを買い戻してください。\nまるで、ビットコインが...であるためには、エリートがビットコインを買う必要があるかのように。",
      "title": "テスラがビットコインを売るのは、実は強気のAF"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨天有一大堆人在聊天中失去了理智，整个聊天中\n从谈论坚硬的、不可改变的、去中心化的、无信任的、不可膨胀的。\n到 \"哦，富有的亿万富翁先生，请买回你的比特币\"，好像我们需要精英阶层购买比特币才能让我们的生活更美好。\n仿佛我们需要精英们购买比特币才能让比特币成为...",
      "title": "特斯拉出售比特币实际上是看涨的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨天有一大堆人在聊天中失去了理智，整個聊天中\n從談論堅硬的、不可改變的、去中心化的、無信任的、不可膨脹的。\n到 \"哦，富有的億萬富翁先生，請買回你的比特幣\"，好像我們需要精英階層購買比特幣才能讓我們的生活更美好。\n彷彿我們需要精英們購買比特幣才能讓比特幣成爲...",
      "title": "特斯拉出售比特幣實際上是看漲的。"
    }
  ],
  "title": "Tesla Selling Bitcoin is Actually Bullish AF",
  "created_utc": 1619620232,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A ton of people in the chat were losing their minds yesterday and the whole chat went from talk of hard, immutable, decentralized, trustless, non inflatable, peer to peer money to &quot;oh mr rich billionaire please buy back your bitcoin&quot; as if we need the elite to buy bitcoin in order for bitcoin to be successful.  When in reality the elites just saw why they need to buy bitcoin in order for their own businesses to be successful.  So in this post I&#39;m telling you guys why Tesla selling their bitcoin actually just made a bunch of CEOs and high net worth individuals realize that they need bitcoin and why this is actually really bullish.</p>\n\n<p>So Tesla sold 10% of their bitcoin and this is actually a good thing because the reason they bought it in the first place was to be a store of value as opposed to the usual parking place for corporations money which is treasury and corporate bonds.  This is one of the first steps of many on the road to bitcoin disrupting bonds.  We&#39;re talking about a market that is upwards of 100 plus trillions of dollars in market cap.  A market that Tesla just displayed is out of date.  </p>\n\n<p>Tesla needed a place to park cash and instead of parking it in bonds even though it was fairly short term they still had capitol appreciation.  First of all because we&#39;re in the middle of a bull run and supply shock but the government has also printed money since then so in addition to them getting money out of the fiat system and dodging inflation it also helped that there&#39;s a large wave of adoption right now.  But the most important point Tesla proved is just how liquid this market is on a public stage.  </p>\n\n<p>Even though bitcoin only has a 1 trillion dollar market cap they were able to move 1.5 billion in and a few months later move a couple hundred million out just like nothing ever changed.  If they never announced they were buying or selling in the first place we wouldn&#39;t have even noticed a whale was in the market.  This demonstration proves the legitimacy of this market and just how liquid it is to other companies as well as big hedge funds, pension funds and even governments.  They just proved a 1 trillion dollar market isn&#39;t too small to get into contrasting what many big funds and deep pockets otherwise thought.</p>\n\n<p>Not that we need the big guys and elites because bitcoin has worked just fine for over a decade now and it&#39;ll keep working just fine for many decades to come.  But many deep pockets have known that they need to be in this market for years now and they were just shown that the time to enter has come.  Even though we&#39;ll be fine without the elites I don&#39;t think any of us mind a bunch of money flowing in and pumping our bags as they all desperately try to get exposure after we&#39;ve front ran them for years.</p>\n\n<p>Another bullish part of this whole thing is that on Twitter we had &quot;Dave Day Trader&quot; come in and say  &quot;So am I understanding this correctly? elonmusk buys  bitcoin. Then he pumps it. It goes up.  Then he dumps it and make a fortune.  Listen I own 1 bitcoin but bitcoin is exactly who we thought it was. Just don’t be last 1 HODLing the bag.&quot;  Which is already super misleading because Tesla didn&#39;t even sell all their bitcoin, they sold 10 percent.  They even noted they still believe in bitcoin long term.  They bought bitcoin to store money so it wouldn&#39;t get devalued from inflation and decided to use it later on.  Meanwhile its value had actually increased because it was safe from the devaluation of inflationary fiat.  If this isn&#39;t bullish idk what is.  Tesla literally just proved the whole purpose of bitcoin to other corporations for hundreds of millions of people to see and you know Apple, Amazon and Facebook are now asking themselves &quot;why are we still buying treasuries when we can buy bitcoin and have it increase in value to inverse inflation and even collect yield on it from lending it out?&quot;  Not to mention that if your company buys bitcoin and then you tweet that you bought bitcoin you&#39;ll literally boost the adoption and have a nice little buffer and margin of safety cause the price would go up a few percent.  </p>\n\n<p>But the reason I bring up that tweet is because of Elon&#39;s reply.  &quot;No, you do not. I have not sold any of my Bitcoin.  Tesla sold 10% of its holdings essentially to prove liquidity of Bitcoin as an alternative to holding cash on balance sheet.&quot;  So not only did he announce he personally holds bitcoin which is new news that I don&#39;t believe we knew.  But honestly who is surprised that one of the founders of PayPal holds bitcoin..</p>\n\n<p>But he states that they did that to prove that bitcoin is and alternative to holding cash so they&#39;re probably using their cash from the proceeds to fuel future expansion just like any other company normally would but instead of buying negative real yielding bonds they bought bitcoin and actually ended up with more appreciation than they would&#39;ve if they bought bonds and not to mention that even after the announcement that they sold some bitcoin the price of bitcoin is still in tact further proving this markets legitimacy.  The market is still volatile for sure but this just proves that over time bitcoin is a viable place to store value.</p>\n\n<p>Like I said, I know we already knew this fact for years and we don&#39;t need billionaires coming in and speaking on our behalf but nonetheless the elites and billionaires adopting it is just a normal part of bitcoin&#39;s adoption.  If anyone just does the slightest shred of research they would see that this market is very liquid and billions and billions of dollars worth of bitcoin are traded daily but its important that it was on display for the rest of these corporations to see that this is a better option than bonds and you actually can move in and out of this market with ease and get a better return than bonds.</p>\n\n<p>So to the people who were freaking out on in the chat yesterday, this is bullish.  This proves to other CEOs and probably hedge funds and pensions and governments and any other deep pockets that yes...  this is a viable option and this only furthers the adoption of bitcoin this was a demonstration to trillions and trillions of dollars that hey this asset is just fine.  We already knew bitcoin was a good use for of store of value but if and deep pockets had their doubts, they don&#39;t anymore.  This is even more reason to believe we&#39;ll see more and more institutional adoption.</p>\n\n<p>TLDR So yeah I just wanted to make this post because a bunch of people were freaking out and I&#39;m sure some new guys out there sold their bitcoin because of this.  You just gotta look at the bigger picture here and the implications of this stuff.  People like Michael Saylor and Elon Musk are out here showing deep pockets that it&#39;s all good and they can &quot;come on in the water is fine&quot; and not only is the water fine but the water is actually better.  Because you cant print away our purchasing power over here because the more they print the higher our bitcoin goes.  That&#39;s what this all boils down to.  The money printer go brrr and scarce assets go up and this was all just demonstrated to companies with trillions of dollars of negative real yield.  This is actually huge.  Anyway I could talk about this stuff forever.  I&#39;m all fired up now.  Y&#39;all have a good one and keep stacking.</p>\n</div><!-- SC_ON -->",
  "score": 209,
  "permalink": "/r/Bitcoin/comments/n04tmm/tesla_selling_bitcoin_is_actually_bullish_af/",
  "subreddit": "Bitcoin",
  "id": "n04tmm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776205697
}