{
  "author": "Groundbreaking-Sun68",
  "original_created_utc": 1650941518,
  "title": "What’s wrong with wanting a simple life?",
  "created_utc": 1650972362,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For example, I am a carousel operator. It pays the bills so I don’t feel the need to further my job or find a “better” job (at least not right now). I like just being able to go to work and then coming home to my studio where I can watch anime/movies, listen to music or work on my screen play. Everyone calls me an underachiever but is that really a bad thing when my credit is good, I am eating, my apartment is clean, and my bills are paid on time&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/NoStupidQuestions/comments/uc2lsy/whats_wrong_with_wanting_a_simple_life/",
  "subreddit": "NoStupidQuestions",
  "id": "uc2lsy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For example, I am a carousel operator. It pays the bills so I don’t feel the\nneed to further my job or find a “better” job (at least not right now). I like\njust being able to go to work and then coming home to my studio where I can\nwatch anime/movies, listen to music or work on my screen play.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、私はカルーセルのオペレーターをしています。そのため、私はその必要性を感じていません。\nを探す必要はありません（少なくとも今は）。私が好きなのは\n仕事に行って、家に帰ったらスタジオでアニメや映画を見たり、音楽を聴いたりすることができます。\nアニメや映画を見たり、音楽を聴いたり、スクリーンプレーに取り組んだり......。",
      "title": "シンプルライフを望んで何が悪い？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "例如，我是一名旋转木马操作员。它能支付账单，所以我不觉得有必要进一步发展我的工作或寻找 \"更好 \"的工作（至少现在没有）。\n需要进一步发展我的工作或找到一份 \"更好 \"的工作（至少现在没有）。我喜欢\n我喜欢能够去工作，然后回到我的工作室，在那里我可以\n看动画/电影，听音乐或在我的屏幕上工作....",
      "title": "想过简单的生活有什么错呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "例如，我是一名旋轉木馬操作員。它能支付賬單，所以我不覺得有必要進一步發展我的工作或尋找 \"更好 \"的工作（至少現在沒有）。\n需要進一步發展我的工作或找到一份 \"更好 \"的工作（至少現在沒有）。我喜歡\n我喜歡能夠去工作，然後回到我的工作室，在那裏我可以\n看動畫/電影，聽音樂或在我的屏幕上工作....",
      "title": "想過簡單的生活有什麼錯呢？"
    }
  ]
}