{
  "author": "AccAltD3099",
  "original_created_utc": 1646139049,
  "title": "My son divorced his wife after having mistreated and cheated on her, As a result, We ended up cutting him from the will and adding her and my grabdbaby. He's losing it on the entire family now.",
  "created_utc": 1646165798,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My son (24) mistreated and eventaully cheated on his now ex wife while she was 3 months post-partum. He is leaving town to go be with the other woman and seemingly has no regrets. both me and his dad are ashamed seeing how our daughter in law is struggling to cope with everything happening in her life, while trying to care for a new baby. We decided to cut him off of the will and put everything we planned to give him towards our daughter in law and our grandbaby. My son heard about this arrangement from his sister and is going on a campaign to guilt and shame me and my husband for the decision we&amp;#39;ve made. Sadly, many family members are taking his side and calling my daughter in law now &amp;quot;an outsider&amp;quot; or &amp;quot;not family&amp;quot; saying we&amp;#39;re making a mistake that will cost us our son. She is aware of the negativity around her, but she has nowhere else to go. My husband and I took her and the baby in for now. We are getting heat and criticism and it&amp;#39;s bothersome and exhausting, but we&amp;#39;re standing our ground because we feel like it&amp;#39;s only fair to make sure our grandbaby and his mother get a stable life after what my son did to them.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 76383,
  "permalink": "/r/TrueOffMyChest/comments/t4784a/my_son_divorced_his_wife_after_having_mistreated/",
  "subreddit": "TrueOffMyChest",
  "id": "t4784a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My son (24) mistreated and eventaully cheated on his now ex wife while she was 3\nmonths post-partum. He is leaving town to go be with the other woman and\nseemingly has no regrets. both me and his dad are ashamed seeing how our\ndaughter in law is struggling to cope with everything happening in her…"
}