{
  "author": "Starw1nMarw1n",
  "the_new_excerpt": "Before you start reading, since this is a long post, grab yourself a cup of\ncoffee or tea, and enjoy the read! I hope you appreciate the time and effort put\ninto this post. I am not trying to hype anything, nor am I providing price\npredictions. I have a background in ERP systems and know the segment…",
  "original_created_utc": 1619969833,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この記事は長いので、読み始める前に、コーヒーや紅茶を飲みながら\n楽しんでください。この記事に費やした時間と労力を評価していただければ幸いです。\nこの記事に費やされた時間と労力をご理解いただければ幸いです。私は何かを誇示しようとしているわけではなく、価格の予測をしているわけでもありません。\n予測しているわけではありません。私はERPシステムの経験があり、この分野をよく知っています。",
      "title": "(LONG) OriginTrail - Due Diligence - 価格の予測、クロスポスト、ツイートリンクはありません。OTとそのパートナーによる発表資料と、これがどれだけ大きいかを紹介する記事のみ! それでも、あなたは眠っている...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在你开始阅读之前，由于这是一篇长文，请拿起一杯\n咖啡或茶，并享受阅读 我希望你能欣赏我为这篇文章付出的时间和努力\n这篇文章。我并不是要炒作什么，也不是要提供价格\n预测。我有ERP系统的背景，知道这个领域...",
      "title": "(LONG) OriginTrail - Due Diligence - 没有价格预测，没有交叉张贴，没有推特链接。只有OT、他们的合作伙伴所发表的材料，以及展示这有多大的文章! 然而，你却在睡觉..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在你開始閱讀之前，由於這是一篇長文，請拿起一杯\n咖啡或茶，並享受閱讀 我希望你能欣賞我爲這篇文章付出的時間和努力\n這篇文章。我並不是要炒作什麼，也不是要提供價格\n預測。我有ERP系統的背景，知道這個領域...",
      "title": "(LONG) OriginTrail - Due Diligence - 沒有價格預測，沒有交叉張貼，沒有推特鏈接。只有OT、他們的合作伙伴所發表的材料，以及展示這有多大的文章! 然而，你卻在睡覺..."
    }
  ],
  "title": "(LONG) OriginTrail - Due Diligence - no price predictions, no cross-postings, no tweet-links. Only published material by OT, their partners, and articles to showcase how big this is! Yet, you are sleeping...",
  "created_utc": 1620030619,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Before you start reading, since this is a long post, grab yourself a cup of coffee or tea, and enjoy the read! I hope you appreciate the time and effort put into this post. I am not trying to hype anything, nor am I providing price predictions. I have a background in ERP systems and know the segment very well and what it does and why without the global standards incorporated within this type of solution (Supply Chains) the supply chain complex will never be standardized! This is why standards such as GS1, W3C, EPCIS/EPCIS 2.0, to name a few, are at the core of OriginTrail&#39;s solution. </p>\n\n<p>For some time now I&#39;ve been postponing this post because if truth be told, it&#39;s time-consuming. Also, so many great posts on OriginTrial have been created under the <a href=\"/r/cc\">r/cc</a> subreddit describing OriginTrail only to be deleted by the mods. This is the reason why no one bothers posting anything about OriginTrail here anymore. Posts get deleted and people who are genuinely looking for solid investments miss the opportunity to even get a glance to make informed decisions. After I create this post I will not be able to share it with anyone because if I share it in a Telegram community, and it gets upvoted &quot;too quickly&quot;, it will get deleted for &quot;brigading&quot; by the cc-admins. So, this post will depend more or less on people who actually care about reading its contents and upvoting it because they find it to be useful. Anyway, I guess that belongs to the past now. I am giving this one last attempt for those who truly are searching for a rock-solid project with really great fundamentals. I will not be touching on any price predictions, nor will I crosspost any other Reddit posts here. I will also not link to any Twitter posts, only images of these. In the end, all I will be providing is adoption that has already taken place, and is taking place, within the OriginTrail ecosystem, which btw stretches far outside crypto and has basically gone unnoticed among crypto investors. I&#39;ll be providing direct sources to published material and datasets that are being uploaded to the ODN (OriginTrail Decentralized Network).</p>\n\n<p>First of all, to all those who don&#39;t know anything about OriginTrail, OriginTrail is not a blockchain. It is a layer-2 agnostic protocol that goes on top of blockchain and is utilizing blockchain for data immutability and decentralization. It&#39;s a multichain solution and can be integrated on top of any blockchain. Currently, OT protocol is operating on top of ETH (<em>not much usage there anymore due to high gas fees</em>) and xDAI (<em>currently the main active chain</em>). OTs own blockchain called Starfleet Chain (SFC) is currently being tested for launch and it&#39;s expected to launch in a couple of weeks in mid-May. DOT is also being prepared. In short, ODN will be running on at least 4 chains this year. ETH, xDAI, SFC, and DOT. SFC and DOT integrations have been worked on by TraceLabs (<em>the team behind OriginTrail</em>) and Parity Tech (<em>the team behind Polkadot</em>). It remains to be seen whether OT will get a parachain/parathread on the Polkadot ecosystem.</p>\n\n<p>Now, over to what OriginTrail is solving. There are many who just throw Vechain, Te-Foods, WTC, Ambrosus, OriginTrail, Morpheus, and other &quot;supply chain projects&quot; into the same soup calling it &quot;supply chain&quot; projects. To a slight degree, it is correct, but not really. This is because you really don&#39;t understand this segment properly. Unless you have knowledge of what supply chains really are and do, understand backend system operations which are basically complex ERP systems that supply chains rely on (Oracle NetSuite, SAP, Microsoft Dynamics, and plethora of other systems), and which allow companies to do their day to day operations, you really don&#39;t have much to go with as far as understanding what you&#39;ve actually invested your money into. Most of these projects are NOT supply chain solutions. They literally just scrape the surface layer of the supply chain ecosystem. Most of these are traceability projects, promising to verify that consumers are getting products that producers say they are. That&#39;s it. In no way are the majority of these projects solving the main issue that has been plaguing the supply chain industry for a very long time, which is the lack of seamless and decentralized interoperability and interconnectivity of siloed legacy systems and storages, where all systems are communicating effortlessly, abiding by the strict rules of global standards without the need to create complex customizations each time you are dealing with a system you haven&#39;t dealt with before. Here is an example:</p>\n\n<p><em>If company A runs system X, company B system Y, and company C system Z, they don&#39;t need to create 6-9 different customizations to whatever ERP system they are using in order to communicate with each other. With OT solution, each company uploads their data via the ODN in order to share whatever needs to be shared, keeping their costs down and avoiding expensive expansions into other systems that their clients/vendors/suppliers may demand. This is exactly what OriginTrail is solving, and they are doing it like a boss! Which you will see further down.</em></p>\n\n<p>Since I am not allowed to post links to tweets, if you look up &quot;John G. Keogh&quot; on Twitter, one of the advisors to OriginTrail and board members of TraceAlliance, you can find tons of information about how important OriginTrails solutions are for solving supply chain issues. John is basically advising governments on supply chains, especially in his home country of Canada and why global standards are a MUST in order to create solutions like these. Unfortunately, in crypto space this is not considered &quot;sexy&quot;. It&#39;s considered heavy, boring, and simply too hard to comprehend. This becomes the sole reason why most will miss OriginTrail:</p>\n\n<p>From John&#39;s tweet on May 1st, 2021: &quot;FoodOn, Top scholar &amp; co-creator FoodOn to join Trace Alliance Data Interoperability &amp; Semantic Web workgroup. More coming soon as the research team formulates their plan &amp; solution providers, NGO&#39;s &amp; governments join. Just wow!&quot;  Extract from FoodOn article <a href=\"https://www.nature.com/articles/s41538-018-0032-6.pdf\">https://www.nature.com/articles/s41538-018-0032-6.pdf</a>:</p>\n\n<p>&quot;<em>The construction of high capacity data sharing networks to support increasing government and commercial data exchange has highlighted a key roadblock: the content of existing Internet-connected information remains siloed due to a multiplicity of local languages and data dictionaries. This lack of a digital lingua franca is obvious in the domain of human food as materials travel from their wild or farm origin, through processing and distribution chains, to consumers. Well-defined, hierarchical vocabulary, connected with logical relationships—in other words, an ontology—is urgently needed to help tackle data harmonization problems that span the domains of food security, safety, quality, production, distribution, and consumer health and convenience.&quot;</em></p>\n\n<p>This is what solving supply chain hurdles imply. Not just ensuring product traceability. You solve the traceability problem, sure, but how are you going to ensure that this actually moves through the supply chain seamlessly? You can&#39;t unless you solve what was explained above.</p>\n\n<p>Today most people have invested their money into projects which &quot;sound&quot; sexy by getting shilled these via crypto youtube &quot;experts&quot; and social media shills. This is all great. Some of you may have benefited from all this hype these past 3 months, but in the end, what have you really bought? How much time and effort have you put into learning anything about your investment and how much is just affirmational bias tied to what you&#39;ve heard? The truth is, what most people are really looking for when investing in anything is to find that one seed that&#39;s going to grow into a massive producing tree from which you can reap the benefits for many years to come. Not &quot;how much can I get in the shortest amount of time possible&quot;, which seems to be the main investment strategy currently.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>PARTNERSHIPS</strong>:</p>\n\n<p><strong>BSI, British Standards Institute</strong> </p>\n\n<p><a href=\"https://www.bsigroup.com/\">BSI</a> is just one of many serious standardization organizations that consult roughly 84,000 clients in 193 countries. They are creme de la creme within their segment and they consult both companies and governments to create solutions to mitigate risk, brand protection, and compliance, just to name a few. They rely HEAVILY on the solutions made possible with OriginTrail. Just read below:</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>BSI has partnered exclusively up with OriginTrail to solve some of the major hurdles that their clients experience in supply chains. Back in December of 2020, OriginTrail held a 4-hour Liftoff event where BSI, Oracle, and SBB (Swiss Railways) were showcasing their work and solutions they were building utilizing ODN. (<em>Phil Archer from GS1, was also present there, but more as a commentary. I&#39;ll get back to each of these later.</em>)</li>\n<li>You can watch the Liftoff segment with Dan Putrell, Director of Innovations at BSI <a href=\"https://youtu.be/Ss9pZkVsFpo\">here</a>. The solution being presented here is for BSIs <a href=\"https://www.scanassociation.com/membership/our-members/\">SCAN members</a> in the US. If you don&#39;t know who these are, well, they represent 40% of ALL US imports each year. These companies must ensure that the products they import are from compliant factories outside of the US. You can watch the link I&#39;ve attached to hear Dan explain this entire process and the importance of it.</li>\n<li>Bono, from U2, who is a co-owner of a distillery called Monasterevin, hired BSI to consult them on a solution to ensure the authenticity of their products. You can read about the story <a href=\"https://www.businesspost.ie/business/bono-whiskey-firm-brands-casks-with-blockchain-tokens-242764c7\">here</a>. The story was available in full when it was released but it seems it is now behind a pay-wall in order to read the full article. Nevertheless, at the end of the Liftoff event, I posted above, if you&#39;ve watched the whole thing, Dan Putrell is discussing this exact part there without fully revealing what it is. </li>\n<li>Dan also mentions a solution they are creating for the UK government, which we now know is <a href=\"https://www.bsigroup.com/en-GB/about-bsi/media-centre/press-releases/2021-press-releases/april/bsi-joins-innovate-uk-consortium-designed-to-help-digitize-the-uks-fresh-produce-supply-chains/\">Trusted Bytes</a>. This is a solution to ensure the digitization of the UK&#39;s fresh produce and supply chains:</li>\n</ul>\n\n<ol>\n<li>&quot;<em>BSI will leverage various open international best practice frameworks around supply chain data management, trust, and interoperability within the Trusted Bytes initiative. These include GS1/EPCIS, W3C DIDs, and verifiable credentials, ISO 44001 Collaborative Business Relationships,</em> <strong><em>and the open OriginTrail decentralized protocol stack (origintrail.io)</em></strong><em>.</em>&quot;</li>\n<li>&quot;<em>providing seamless real-time digital connectivity to supply chain operators. It will also enable a trusted data exchange that connects the supply chain with central government and other critical partners enhancing cross border transition, compliance and security.</em>&quot;</li>\n<li>Lincoln University, shortly after, published <a href=\"https://www.lincoln.ac.uk/news/2021/04/1688.asp\">this article</a> that explains more about this initiative and who the involved parties are from the UK; &quot;<em>The consortium, led by Produce Logistics Limited includes leading fresh produce supply chain operators Fesa UK Ltd; Worldwide Fruit Ltd; Davis Worldwide Ltd; Hain Daniels; FreshLinc Ltd; and ukFPN Lincolnshire, supported by technology companies Contained Technologies UK Ltd; British Standards Institution (BSI); and Excelerate Technology Ltd, as well as the University of Lincoln, UK; the High-Value Manufacturing Catapult&#39;s Manufacturing Technology Centre; and the Satellite Applications Catapult.</em>&quot;</li>\n</ol>\n\n<ul>\n<li>BSI Healthcare sector team announcing that they&#39;ve finally created &quot;<em>a FULL neutral way to link all internal supply chain systems to drive data, analytics, and ultimately, visibility.</em>&quot; You can see the update on this <a href=\"https://www.linkedin.com/posts/courtney-foster-8a311512_origintrail-decentralized-knowledge-graph-activity-6785842064576929792-K9-i\">here</a>. This takes us next down the Pharma rabbit hole that started to emerge just this last week:</li>\n</ul>\n\n<ol>\n<li>Since this was a series of tweets, and OriginTrail posts have been deleted by mods for posting twitter links, not sure for what reason, I&#39;ve had to simply snap a shot of this where you can see it <a href=\"https://postimg.cc/Y4tRs9Xd\">here</a>.</li>\n<li>Next, you can add <a href=\"https://postimg.cc/XBNtP9L7\">2 and 2 together</a> where this is heading. &quot;<em>98% of Fortune 500 Pharmaceutical Clients Partner with BSI to mitigate risk and protect Brand Reputation</em>&quot;.</li>\n</ol>\n\n<p><strong>Conclusion:</strong> I think the links and information I&#39;ve provided on just the BSI part speaks for itself.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>GS1 Partnership</strong></p>\n\n<p>This is another partnership that&#39;s based on standards. The entire global supply chain runs on standards developed by the <a href=\"https://www.gs1.org/\">GS1</a> organization. Systems to identify, capture, and share information among supply chain partners (including the ubiquitous bar code), were all developed over the past 45 years by GS1. <a href=\"https://www.gs1.org/standards/epcis\">These standards</a> allow for interoperability between different systems and supply chain architectures across the globe. Any blockchain-based solution to improve traceability should integrate with these legacy systems, and the OriginTrail protocol was designed from the ground up to do this. </p>\n\n<p>GS1 Digital Link is next in line creation by GS1, relying on the Decentralized Knowledge Graph, which is the ODN (OriginTrail Decentralized Network). You can watch Phil Archer explain this in this presentation <a href=\"https://youtu.be/jJnahaZ9-Tc\">here</a> (<em>If you don&#39;t want to spend time listening to a full 8 minutes, then go to 5:20 where Phil points to the Decentralized Knowledge Graph, which is the ODN</em>). In other words, barcodes and product information stored on the ODN for seamless interoperability, interconnectivity, and decentralization, linking everything together!</p>\n\n<p><strong>Oracle</strong></p>\n\n<p>Oracle and OriginTrail partnered up back on Dec. 8th, 2018. As posted by Oracle tweet: &quot;We are thrilled to partner w/@origin_trail to deliver secure and trusted data sharing for supply chains using #blockchain technology.   </p>\n\n<p>This solution is related to Automatic Dairy payments. What this is and how it functions can be seen in <a href=\"https://youtu.be/9-XucYs9FIM\">this video</a>.</p>\n\n<p>You can also watch Jens Lusebrink from Oracle <a href=\"https://youtu.be/UfRWKTKJOFU\">during the Liftoff event</a>, where Dan Putrell from BSI was also present, explaining their involvement with TraceLabs creating solutions on the ODN.</p>\n\n<p>Furthermore, one of the most important aspects of the entire OriginTrail ecosystem is the nOS, which stands for Network Operating System. What nOS does is allow companies to spend credits purchased with company fiat to directly purchase TRAC via Uniswap or any other exchange. TRAC is only utilized in the background, is directly purchased when needed, and used in nodes immediately (see <a href=\"https://medium.com/origintrail/the-network-operating-system-liquidity-provisioning-system-part-1-uniswap-integration-b38e7ae75e76\">this writeup</a> for details). As cryptocurrency never touches the company’s accounting books, it <strong>solves the problem of mainstream companies needing to purchase and hold cryptocurrency to use the protocol</strong>. </p>\n\n<p>&#x200B;</p>\n\n<p><strong>SBB CFF FFS</strong> (Swiss Federal Railways)</p>\n\n<p>Also during the Liftoff event, Dominik Halbeisen from SBB was present to explain the importance of utilization of ODN and why they partnered up with OriginTrail. During <a href=\"https://youtu.be/Rzk-Z9lFaG0\">this presentation,</a> if you watch this entire presentation, you&#39;ll remember my example I explained above with &quot;<em>If company A runs system X, company B system Y, and company C system Z etc.&quot;.</em></p>\n\n<p>Just recently Brana Rakic, who is the CTO of OriginTrail, was at the GS1 Global Forum showcasing how 9 European Railways are utilizing OriginTrail. These are just <a href=\"https://postimg.cc/ppsFDMyn\">two images</a> posted by the OriginTrail team announcing this presentation. </p>\n\n<p>&#x200B;</p>\n\n<p><strong>OneAgrix</strong></p>\n\n<p>OneAgrix is another partnership with OT that isn&#39;t getting the PR it deserves and is always sort of forgotten among BSI, GS1, Oracle, and Swiss Railways. OneAgrix and OriginTrail <a href=\"https://medium.com/origintrail/trace-labs-and-oneagrix-partner-up-to-enable-halal-product-traceability-on-the-blockchain-cde5dcb0efd1\">partnered up back in early 2019</a> with the goal to ensure and tackle the trust deficit in the halal goods marketplace, enabling food safety and transparency. This brings tangible benefits to businesses and consumers in the USD 2.5 trillion global halal markets. </p>\n\n<p><a href=\"https://www.foodnavigator-asia.com/Article/2021/04/29/Tech-ambition-OneAgrix-has-dreams-of-being-the-first-halal-unicorn\">Here you can read</a> about the CEO of OneAgrix Diana Sabrain, who in 2015 established OneAgrix. I would recommend you to read the article because Diana explains WHY and HOW this is made possible by the application of OriginTrail solutions. </p>\n\n<p>Note that John G. Keogh is also OneAgrix strategic advisor! It&#39;s all about complying with global standards. If you do not comply with global standards you can forget about involving your business in global enterprise solutions. There is no other way around this! OriginTrail ticks all of the boxes here. It&#39;s been built from the ground up to do just this.</p>\n\n<p>&#x200B;</p>\n\n<p>According to the team, there are many more entities involved with OriginTrail but these are still yet to be announced. </p>\n\n<p>&#x200B;</p>\n\n<p><strong>Scientific and Academic Research</strong></p>\n\n<p>Due to John G. Keogh&#39;s involvement with OriginTrail since the OTs ICO launch, he has been actively involved with the solution that the TraceLabs and OriginTrail are developing. As mentioned, John Keogh is an advisor and heavy promoter of OriginTrail&#39;s solution. </p>\n\n<p>Just recently, an assembly of scholars and academics have joined a scientific group in the Trace Alliance data interoperability. You can read more about this <a href=\"https://medium.com/origintrail/meet-the-academics-and-research-institutes-taking-part-in-the-trace-alliance-data-interoperability-e0780ba2cc6b\">here</a>, who these individuals are and which establishments they are representing! If you do not have the time to read through the article, in short:</p>\n\n<p><strong>Professor Samuel Fosso-Wamba,</strong> Toulouse Business School, France </p>\n\n<p><strong>Professor Steve Simske</strong>, Colorado State University, USA. </p>\n\n<p><strong>Associate Professor Wayne Martindale</strong>, University of Lincoln, UK </p>\n\n<p><strong>Dr. Edward Smart</strong>, a senior research fellow at the University of Portsmouth, UK </p>\n\n<p><strong>Professor John Breslin</strong> (7,800 citations), Data Science Institute at the National University of Ireland Galway, previously DERI, a Semantic Web research institute established in 2003 </p>\n\n<p><strong>Ph.D. candidate Abderahman Rejeb</strong>, author of numerous papers on the blockchain, IoT, AI, and Augmented Reality </p>\n\n<p>The research team will be jointly coordinated by <strong>Professors of Practice Horia Bradau</strong> and <strong>John G. Keogh</strong>, McGill Centre for the Convergence of Health and Economics, and includes a department research associate </p>\n\n<p>Also, as linked and mentioned earlier, FoodOn has also joined Trace Alliance for this exact purpose. Solving Data Interoperability and Semantic Web.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>TraceAlliance</strong></p>\n\n<p>The <a href=\"https://alliance.origintrail.io/\">Trace Alliance</a> is a global network of 100+ business enterprises, service providers, developers, and research institutions that share knowledge gained using the OriginTrail protocol. They have direct access to OriginTrail knowledge resources, use cases, and the latest technology releases/solutions. </p>\n\n<p>Few of the partners may already be familiar to you;</p>\n\n<p>- Deloitte </p>\n\n<p>- <a href=\"https://www.margento.com/\">Margento R&amp;D</a></p>\n\n<p>- Parity Tech, the team behind Polkadot</p>\n\n<p>- Emurgo, the team behind Cardano</p>\n\n<p>&#x200B;</p>\n\n<p><strong>The Tokenomics Model</strong></p>\n\n<p>OriginTrail token is a non-inflationary token. 500 Million tokens have been minted and all are in circulation. If you look at <a href=\"https://www.coingecko.com/en/coins/origintrail\">coingecko</a> you may notice that it says that the current circulating supply is 361Mn/500Mn. This is due to the fact that 139Mn tokens are tagged for the dev. pool and future development and maintenance of the ODN protocol.</p>\n\n<p>On top of this, additional 10+ Million tokens are currently locked up in nodes and jobs.</p>\n\n<p>Additional 100 Million tokens have been locked up on the new StarFleet Chain that is being launched this month and will be locked up at least until Q3 until the bridge between ETH and SFC is completed.</p>\n\n<p>Meaning that currently 50% of the entire supply is completely locked and unavailable.</p>\n\n<p>OriginTrail token is the life and blood of the entire system. Without it, nothing works. It is what allows the set up of nodes, it is what allows enterprises, organizations, companies, even individuals, to upload whatever data they want to share with the world. </p>\n\n<p><strong><em>How it all works</em></strong>:</p>\n\n<p>If you are a company and you want to upload the data on the ODN you must provide TRAC in order to do so. (<em>Remember nOS? Companies will acquire TRAC via nOS in fiat value and will not be interacting with crypto at all. nOS will automatically acquire fiat-equivalent of TRAC for them in order to allow for the upload of data on the ODN to be stored on running nodes.</em>)</p>\n\n<p>A minimum of 3 nodes are required to hold a &quot;dataset&quot;, or a &quot;job&quot;. The length and data size will determine the cost to upload the specific datasets. This will of course depend on the area of business the company is operating within. Food traceability may not need the same length of storage as say train parts. Currently, datasets that are being uploaded to the ODN are mostly between 90 days and 5 years. You can see the live activity on the network <a href=\"https://v5.othub.info/dashboard\">here</a>.</p>\n\n<p>As an example, this is what happens when &quot;jobs&quot; are uploaded. I will ignore price mechanics for now as it is too technical to explain, so please disregard this part for now:</p>\n\n<ol>\n<li>Data Creator creates a job for a specific size and duration. It&#39;s a 1-year job of 500kb.</li>\n<li>The cost of uploading this job is 30 TRAC.</li>\n<li>All active nodes on the network will attempt to bid to hold this job, only 3 will win it.</li>\n<li>Once 3 nodes have &quot;won&quot; the auction, each node will provide 10 TRAC each, 30 in total, the equivalent of what the Data Creator offered. This job alone will lock 60 TRAC in total for the duration of 1 year.</li>\n<li>If for whatever reason one of the nodes fail litigation, meaning the node is unavailable for a longer period of time, say several days, that node may lose the job. This will lead to loss of provided collateral (10 TRAC) and the remainder of the job will be auctioned to another node.</li>\n<li>If you won a 5-year job, you don&#39;t have to wait 5 years for the job to mature in order to &quot;payout&quot; your earnings. But in order to get paid the full amount, you&#39;ll have to wait for the completion of the job!</li>\n</ol>\n\n<p>As you can see, nodes are providing real utility and are not a wallet that you just put your tokens in and somehow they make you money. This is quite technical, but if you&#39;d like to run OT nodes we have very well-written <a href=\"https://otnode.com/\">guides</a> to do so. Do mind that it may take you some time to set up your first node!</p>\n\n<p>After ODN launched on xDAI, jobs or dataset uploads have increased substantially. In less than month, 2000 datasets have been uploaded to the ODN network. Before this, while still on ETH, 8000 datasets were uploaded over a period of 1,5 years! Meaning, the acceleration of data being uploaded and utilized is increasing by the day!</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Social Media Channels</strong></p>\n\n<p>If you found this information valuable and would like to follow OriginTrail and their development more closely I recommend that you at least subscribe to their Twitter account &quot;OriginTrail&quot;, as they are very active there and post updates often.</p>\n\n<p>You should also follow OTs CEO Ziga Drev, who is extremely active on Twitter! </p>\n\n<p>&#x200B;</p>\n\n<p><strong>Investors and recognition</strong></p>\n\n<p>A couple of months ago it was revealed that a crypto investment fund Alpha Sigma Capital had invested in OriginTrail. You can see their portfolio <a href=\"https://alphasigma.fund/portfolio\">here</a>. As you can see, they don&#39;t have that many projects in there, but they seem to be holding quite a few interesting projects; AAVE, DOT, ADA, CEL, Quant, Solana, AGI, etc. </p>\n\n<p>They also released what could be interpreted as a &quot;simple&quot; report on OriginTrail. You can find this report <a href=\"https://docsend.com/view/vcav3pzz9etmndqw\">here</a>.</p>\n\n<p>World Economic Forum has been actively posting via Twitter their adoration for the OriginTrail solution since OriginTrail is part of the WEF Uplink group. Many of you may have seen this already, if not, just search Google by typing in &quot;WEF Using blockchain to source high-quality, vital PPE.&quot; As I mentioned earlier, posts have been deleted due to Twitter links.</p>\n\n<p>We also found out that Greg Kidd, an early investor of Twitter, Coinbase, Filecoin, and Square. Again, just use your search skills to locate the Twitter that Greg Kidd himself posted. </p>\n\n<p>&#x200B;</p>\n\n<p><strong>Conclusion</strong></p>\n\n<p>I think this should suffice for now. I&#39;ve tried to highlight what most may find most interesting. OriginTrail is a complex project and requires time and effort to really understand. The team has been around since 2011, which means they didn&#39;t start with these solutions suddenly during the crypto hype of 2017. Blockchain became a door-opener for a whole new world of possibilities to what they were creating. You can see their entire interactive progress map <a href=\"https://miro.com/app/board/o9J_klDu5PI=/\">here</a>.  </p>\n\n<p>If you like to dip your toes more and do more research, you can navigate to <a href=\"https://origintrailexplained.info/\">origintrailexplained</a> page and dig in yourself.</p>\n\n<p>Yes, I do hold TRAC myself. This post was more for educational purposes for those who may be interested in the solutions which OriginTrail is bringing to the table.</p>\n\n<p>Good Luck!</p>\n</div><!-- SC_ON -->",
  "score": 283,
  "permalink": "/r/CryptoCurrency/comments/n38wm6/long_origintrail_due_diligence_no_price/",
  "subreddit": "CryptoCurrency",
  "id": "n38wm6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380962696
}