{
  "author": "rottendurum",
  "original_created_utc": 1650276343,
  "title": "Why is having a partner so important? Why is people so concerned about that? What's so bad about being single?",
  "created_utc": 1650351987,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Not a question for myself, but to understand this social convention of finding a sexual partner to be with the rest of your life, of finding &amp;quot;the one&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;It might be the ultimate reason to bear life society has invented. It might be an attempt not to die alone. It might be the need of &amp;quot;owning&amp;quot; somebody.&lt;/p&gt;\n\n&lt;p&gt;But at this point, it seems that being &amp;quot;old&amp;quot; and single is a sign of failure, a lack, an unlived/uncomplete/empty life.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/u69kvx/why_is_having_a_partner_so_important_why_is/",
  "subreddit": "TooAfraidToAsk",
  "id": "u69kvx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Not a question for myself, but to understand this social convention of finding a\nsexual partner to be with the rest of your life, of finding \"the one\".\n\nIt might be the ultimate reason to bear life society has invented. It might be\nan attempt not to die alone. It might be the need of \"owning\"…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自分への問いかけではなく、この社会通念を理解するために、探し出すのが\n一生を共にする性的パートナー、つまり「運命の人」を見つけることです。\n\nそれは、社会が発明した人生を背負う究極の理由かもしれない。それは、もしかしたら\n一人で死なないための試み。それは「所有する」ことの必要性かもしれない...。",
      "title": "なぜ、パートナーを持つことが重要なのか？なぜ人々はそのことを気にするのでしょうか？独身でいることがそんなに悪いことなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不是针对我自己的问题，而是为了理解这种社会习俗，即找到一个\n找到一个与你共度余生的性伴侣，找到 \"那个人\"。\n\n这可能是社会所发明的承受生活的最终原因。它可能是\n试图不孤独地死去。它可能是 \"拥有 \"的需要......",
      "title": "为什么有一个合作伙伴如此重要？为什么人们如此关心这个问题？单身有什么不好？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不是針對我自己的問題，而是爲了理解這種社會習俗，即找到一個\n找到一個與你共度餘生的性伴侶，找到 \"那個人\"。\n\n這可能是社會所發明的承受生活的最終原因。它可能是\n試圖不孤獨地死去。它可能是 \"擁有 \"的需要......",
      "title": "爲什麼有一個合作伙伴如此重要？爲什麼人們如此關心這個問題？單身有什麼不好？"
    }
  ]
}