{
  "author": "47D",
  "original_created_utc": 1633328324,
  "title": "I've heard that North American Natives didn't have agriculture, but I've also heard the Natives taught the Puritans how to grow Corn, Pumpkins, and Beans?",
  "created_utc": 1633373258,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>While I know the story of the first Thanksgiving is questionable, it&#39;s still based on some historical fact. That the Wampanoag Natives helped teach the Puritans how to grow new world crops, such as Corn and Pumpkins. </p>\n\n<p>But I&#39;ve also heard that Northern American natives were hunter gathers, and didn&#39;t have agriculture before English colonization. </p>\n\n<p>So what&#39;s the truth?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/q0zt7a/ive_heard_that_north_american_natives_didnt_have/",
  "subreddit": "AskHistorians",
  "id": "q0zt7a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "While I know the story of the first Thanksgiving is questionable, it's still\nbased on some historical fact. That the Wampanoag Natives helped teach the\nPuritans how to grow new world crops, such as Corn and Pumpkins.\n\nBut I've also heard that Northern American natives were hunter gathers, and\ndidn't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最初の感謝祭の話は疑わしいとは思いますが、それでもある程度の歴史的事実に基づいています。\n歴史的な事実に基づいています。ワンパノアグ族の原住民が、ピューリタンにトウモロコシやカボチャなどの新世界の作物の育て方を教えたこと。\nワンパノアグ族の原住民が、ピューリタンにトウモロコシやカボチャなどの新世界の作物の育て方を教えたこと。\n\nしかし、北アメリカの原住民は狩猟採集をしていたとも聞いています。\nそうではなくて...。",
      "title": "北米の原住民は農業をしていなかったと聞いたことがありますが、原住民がピューリタンにトウモロコシやカボチャ、豆の育て方を教えたとも聞いたことがありますが？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "虽然我知道第一个感恩节的故事是有问题的，但它仍然是基于一些历史事实。\n是基于一些历史事实的。万帕诺格族的土著人帮助教会了\n清教徒如何种植新世界的农作物，如玉米和南瓜。\n\n但我也听说，美国北部的土著人是狩猎采集者，而且\n没有...",
      "title": "我听说北美原住民没有农业，但我也听说原住民教清教徒如何种植玉米、南瓜和豆子？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "雖然我知道第一個感恩節的故事是有問題的，但它仍然是基於一些歷史事實。\n是基於一些歷史事實的。萬帕諾格族的土著人幫助教會了\n清教徒如何種植新世界的農作物，如玉米和南瓜。\n\n但我也聽說，美國北部的土著人是狩獵採集者，而且\n沒有...",
      "title": "我聽說北美原住民沒有農業，但我也聽說原住民教清教徒如何種植玉米、南瓜和豆子？"
    }
  ]
}