{
  "author": "BucephalusINTL3",
  "the_new_excerpt": "Bloomberg) -- U.S. futures edged higher while most Asian stocks climbed as\ninvestors digested Friday’s unexpectedly strong jobs report. Bonds steadied from\nearlier losses.\n\nS&P 500 futures rose 0.1%, adding to Friday’s gains when payrolls data showed\nU.S. employers added the most jobs in seven…",
  "original_created_utc": 1617620636,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "(彭博社) -- 美国期货小幅走高，而大多数亚洲股市攀升，因为美国期货价格上涨。\n投资者消化了周五意外强劲的就业报告。债券从\n早些时候的损失。\n\n标普500指数期货上涨0.1%，增加了上周五的涨幅，因薪资数据显示\n美国雇主新增就业岗位最多 七大...",
      "title": "美棒期货上涨--英镑创两周新高"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "(彭博社) -- 美國期貨小幅走高，而大多數亞洲股市攀升，因爲美國期貨價格上漲。\n投資者消化了週五意外強勁的就業報告。債券從\n早些時候的損失。\n\n標普500指數期貨上漲0.1%，增加了上週五的漲幅，因薪資數據顯示\n美國僱主新增就業崗位最多 七大...",
      "title": "美棒期貨上漲--英鎊創兩週新高"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "ブルームバーグ) -- 米国の先物は上昇し、アジアのほとんどの株式は上昇しました。\n投資家は金曜日に発表された予想外に強い雇用統計を受けて、米国の先物は上昇し、アジアのほとんどの株式は上昇しました。債券は\n債券は下げ止まりました。\n\nS&P500先物は0.1%上昇し、金曜日に発表された雇用統計の結果を受けて上昇しました。\n米国の雇用者数は過去7年間で最多となりました。",
      "title": "米国の棒材先物が上昇 - ポンドは2週間ぶりの高値"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "ブルームバーグ) -- 米国の先物は上昇し、アジアのほとんどの株式は上昇しました。\n投資家は金曜日に発表された予想外に強い雇用統計を受けて、米国の先物は上昇し、アジアのほとんどの株式は上昇しました。債券は\n債券は下げ止まりました。\n\nS&P500先物は0.1%上昇し、金曜日に発表された雇用統計の結果を受けて上昇しました。\n米国の雇用者数は過去7年間で最多となりました。",
      "title": "米国の棒材先物が上昇 - ポンドは2週間ぶりの高値"
    }
  ],
  "title": "Us stick futures gain - pound at two week high",
  "created_utc": 1617625522,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bloomberg) -- U.S. futures edged higher while most Asian stocks climbed as investors digested Friday’s unexpectedly strong jobs report. Bonds steadied from earlier losses.</p>\n\n<p>S&amp;P 500 futures rose 0.1%, adding to Friday’s gains when payrolls data showed U.S. employers added the most jobs in seven months. Treasuries pulled back from a selloff last week, with the benchmark 10-year yield steadying around 1.71%. The pound appreciated to a two-week high against the dollar as Prime Minister Boris Johnson pushed ahead with plans to reopen the economy.</p>\n\n<p>A benchmark of Asian stocks advanced, with increases in Japan and South Korea. Shares in India slumped the most in five weeks with more than 100,000 new Covid-19 cases recorded in 24 hours. Many markets were closed for holidays, including China and Hong Kong, as well as much of Europe.</p>\n\n<p>Oil fell after OPEC+ leaders decided to boost production and as the spike in Indian Covid-19 infections underscored risks to energy demand.</p>\n\n<p>Investors are following the debate over U.S. President Joe Biden’s $2.25 trillion infrastructure proposal, as Republicans expressed guarded support for a more limited plan. The response so far in bond markets has been muted, with inflation concerns easing amid doubts over the viability more-generous spending, even as central banks remain committed to keeping interest rates lower for longer.</p>\n</div><!-- SC_ON -->",
  "score": 72,
  "permalink": "/r/investing/comments/mki1jh/us_stick_futures_gain_pound_at_two_week_high/",
  "subreddit": "investing",
  "id": "mki1jh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961877886
}