{
  "author": "meshreplacer",
  "original_created_utc": 1656726890,
  "title": "Warning #5 pull your assets out of exchanges ASAP",
  "created_utc": 1656737876,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Not your keys not your coin. When you deposit crypto to an exchange you are an unsecured creditor loaning out your assets so that Wallstreet types etc.. can take leveraged bets using your money.&lt;/p&gt;\n\n&lt;p&gt;More exchanges will be locking out customers in the next few weeks and it will be with no warning at all. They will lie even hours before doing so.&lt;/p&gt;\n\n&lt;p&gt;Right now what is happening is cascading margin calls and liquidations occurring just like during the 2007-2008 wallstreet/banking crisis. The big difference is crypto exchanges do not offer SIPC/FDIC insurance so when the doors close you lose everything you worked for.&lt;/p&gt;\n\n&lt;p&gt;The only way to protect yourself is to withdraw assets and put them in cold storage.&lt;/p&gt;\n\n&lt;p&gt;Right now a tsunami is washing over the entire exchange industry and its only a matter of time before you lose what you have deposited with them. Don’t be lazy or distracted now is the time to protect what you worked for.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 310,
  "permalink": "/r/CryptoCurrency/comments/vpgs5z/warning_5_pull_your_assets_out_of_exchanges_asap/",
  "subreddit": "CryptoCurrency",
  "id": "vpgs5z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Not your keys not your coin. When you deposit crypto to an exchange you are an\nunsecured creditor loaning out your assets so that Wallstreet types etc.. can\ntake leveraged bets using your money.\n\nMore exchanges will be locking out customers in the next few weeks and it will\nbe with no warning at…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "鍵じゃない......コインじゃない 暗号を取引所に預けるとき、あなたは無担保債権者です。\n無担保の債権者であり、資産を貸し出して、ウォール街の人間などがそのお金でレバレッジをかけた賭けをすることができるのです。\nあなたのお金でレバレッジをかけた賭けをすることになります。\n\n今後数週間で、より多くの取引所が顧客をロックアウトすることになるだろう。\n警告もなく...",
      "title": "警告その5 取引所から資産を早急に引き揚げろ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不是你的钥匙，不是你的钱币。当你把加密货币存入交易所时，你是一个\n无担保的债权人，借出你的资产，让华尔街的人等可以\n用你的钱进行杠杆赌注。\n\n在接下来的几周，更多的交易所将锁定客户，这将是\n是没有任何警告的...",
      "title": "警告5：尽快将你的资产撤出交易所"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不是你的鑰匙，不是你的錢幣。當你把加密貨幣存入交易所時，你是一個\n無擔保的債權人，借出你的資產，讓華爾街的人等可以\n用你的錢進行槓桿賭注。\n\n在接下來的幾周，更多的交易所將鎖定客戶，這將是\n是沒有任何警告的...",
      "title": "警告5：儘快將你的資產撤出交易所"
    }
  ]
}