{
  "author": "TrueStanks",
  "the_new_excerpt": "A few months ago I got a health scare. Bowl cancer. Nothing major, doctor said\nit’s treatable and if I start chemo right away things were looking good. That’s\nwhen I joined this sub and invested all I had into eth. I figured I’d make some\ngreat gains for when I come out the other side. I’ll be…",
  "original_created_utc": 1620353725,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数ヶ月前、私は健康上の問題を抱えていました。ボウルガンです。大したことではなく、医者は\n治療可能で、すぐに化学療法を始めれば良い結果が得られると言われました。その時\nその時にこのサブサイトに参加して、自分の持っているすべてのものをethに投資しました。このサブサイトに参加して\n私は、あの世に行ったときのために、大きな利益を得ようと考えました。私は...",
      "title": "暗号が私の人生を変えた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几个月前，我的健康受到了惊吓。碗癌。没有什么大问题，医生说\n它是可以治疗的，如果我马上开始化疗，情况会很好。这就是\n这时我加入了这个子，并把我所有的钱都投到了伦理上。我想我将会取得一些\n巨大的收益，当我从另一边出来的时候。我将会...",
      "title": "Crypto几乎改变了我的生活"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾個月前，我的健康受到了驚嚇。碗癌。沒有什麼大問題，醫生說\n它是可以治療的，如果我馬上開始化療，情況會很好。這就是\n這時我加入了這個子，並把我所有的錢都投到了倫理上。我想我將會取得一些\n巨大的收益，當我從另一邊出來的時候。我將會...",
      "title": "Crypto幾乎改變了我的生活"
    }
  ],
  "title": "Crypto almost changed my life",
  "created_utc": 1620372639,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A few months ago I got a health scare. Bowl cancer. Nothing major, doctor said it’s treatable and if I start chemo right away things were looking good. That’s when I joined this sub and invested all I had into eth. I figured I’d make some great gains for when I come out the other side. I’ll be honest I didn’t learn that much about crypto. But I was convinced by my friends who were all making money. \nLong story short I’ve made over 4K the past few months. Not a lot compared to a lot of you, but way more than I had. \nThe biggest thing was this was an escape for me. Riding the waves with you guys, mainly the daily chat, absolutely losing our minds when ADA went to 1.45. It was a riot, and made me think about the future.</p>\n\n<p>I figured if I keep this up then I’ll have life changing money. Maybe diversify into something else promising. </p>\n\n<p>Today the doctor gave me the usual shpeal of 6-12 months if I’m lucky. I’m going for trial runs at the UK’s leading cancer research hospital starting next week. But its mostly for research to be honest. I don’t expect to be here too much longer. Instead ive left instructions to my family of how to access my crypto and how long to wait before cashing out. I’m also gonna ask my friend who’s good at this stuff to help my family with the timing (not selling in the middle of a bear run). </p>\n\n<p>I’m pretty bullish on eth, hopefully in a few years they will be set for life. I’ll put some more in over the next few weeks. </p>\n\n<p>Anyways, why am I telling you this? Life is short my dudes. It’s better to jump in on a risk early than wait till your time runs out. Money doesn’t follow you to the grave. Take your risk with no regrets and cherish your family and time &lt;3</p>\n</div><!-- SC_ON -->",
  "score": 7557,
  "permalink": "/r/CryptoCurrency/comments/n6nypr/crypto_almost_changed_my_life/",
  "subreddit": "CryptoCurrency",
  "id": "n6nypr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985988844
}