{
  "author": "homeland",
  "original_created_utc": 1640524897,
  "title": "Was the Imperial Japanese Navy as hesitant to issue \"abandon ship\" orders as the Army was to see any unit surrender?",
  "created_utc": 1640557745,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In WWII, Imperial Japanese infantry surrendered at astonishingly low rates compared to any other belligerent force. So was there an equal antipathy to letting sailors fall into Allied hands among the IJN?&lt;/p&gt;\n\n&lt;p&gt;I can imagine that the average Japanese sailor would rather not suffer what he perceived to be the shame of surrender, but was this carried out as a matter of policy among the upper ranks? Were doomed vessels ever crewed past any effective point in a sort of &amp;quot;let&amp;#39;s go down with the ship&amp;quot; mentality?&lt;/p&gt;\n\n&lt;p&gt;Or is it a false equivalence to compare the relative close quarters combat and ease of surrender (and related virulent resistance to the possibility) of land forces to the staggering distances navies fought over in the Pacific?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 118,
  "permalink": "/r/AskHistorians/comments/rowtth/was_the_imperial_japanese_navy_as_hesitant_to/",
  "subreddit": "AskHistorians",
  "id": "rowtth",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In WWII, Imperial Japanese infantry surrendered at astonishingly low rates\ncompared to any other belligerent force. So was there an equal antipathy to\nletting sailors fall into Allied hands among the IJN?\n\nI can imagine that the average Japanese sailor would rather not suffer what he\nperceived to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "第二次世界大戦において、日本軍の歩兵は驚くほど低い確率で降伏した。\n他のどの交戦国とも比べ物にならない。では、他の交戦国と比べても、同じように反感を持たれていたのでしょうか。\n日本海軍は、船員を連合国の手に渡すことになったのでしょうか。\n\n平均的な日本人の水兵は、むしろ以下のような苦しみを味わうことはなかったと想像できる。\nを認識した。",
      "title": "日本海軍は、陸軍がどの部隊も降伏するのを見るのと同じように、「船を捨てろ」という命令を出すのをためらったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "二战中，日本帝国的步兵投降率低得令人吃惊\n与任何其他交战部队相比，投降率低得惊人。那么，对于让水手落入盟军手中，日本海军是否也有同样的反感？\n让水手落入盟军之手，在IJN中是否有同样的反感？\n\n我可以想象，普通的日本水手宁愿不遭受他所认为的\n他认为是...",
      "title": "日本帝国海军在发布 \"弃船 \"命令时是否像陆军看到任何部队投降一样犹豫不决？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "二戰中，日本帝國的步兵投降率低得令人喫驚\n與任何其他交戰部隊相比，投降率低得驚人。那麼，對於讓水手落入盟軍手中，日本海軍是否也有同樣的反感？\n讓水手落入盟軍之手，在IJN中是否有同樣的反感？\n\n我可以想象，普通的日本水手寧願不遭受他所認爲的\n他認爲是...",
      "title": "日本帝國海軍在發佈 \"棄船 \"命令時是否像陸軍看到任何部隊投降一樣猶豫不決？"
    }
  ]
}