{
  "author": "Nostalg33k",
  "original_created_utc": 1635708226,
  "title": "If you are poor, crypto may be your best chance to win the most important thing: time",
  "created_utc": 1635730475,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Crypto may help us to get out of poverty just like some jobs can do but, if you are poor, be honest: working 40 hours a day is not sustainable. </p>\n\n<p>I wish to see my children grow up and to have time to pursue my passions. Yes some jobs may allow me to retire early if I don&#39;t die because of the dangerous aspects of the job but frankly I want my time to be mine and working to be a choice. </p>\n\n<p>I wish the best forbhard workers but salaries are not giving me the hope to sustain a famillybor to buy a house. </p>\n\n<p>The only financial hope I have right now lies in crypto. </p>\n\n<p>It speaks volume about our world and about the power of crypto.</p>\n\n<p>Edit: 40 hours a day, what a bufoon am i? Yet I won&#39;t change it and I&#39;ll own this utter stupidity. Shame on me</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/CryptoCurrency/comments/qjwpeg/if_you_are_poor_crypto_may_be_your_best_chance_to/",
  "subreddit": "CryptoCurrency",
  "id": "qjwpeg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Crypto may help us to get out of poverty just like some jobs can do but, if you\nare poor, be honest: working 40 hours a day is not sustainable.\n\nI wish to see my children grow up and to have time to pursue my passions. Yes\nsome jobs may allow me to retire early if I don't die because of the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号は、ある種の仕事ができるように、貧困から抜け出すのに役立つかもしれません。\n正直に言うと、1日40時間働くことは、持続可能ではありません。\n\n私は、子供の成長を見守り、自分の情熱を追求する時間を持ちたいと願っています。そうですね。\n仕事によっては、そのせいで死ななければ早期リタイアできるかもしれない。",
      "title": "もしあなたが貧乏なら、暗号は最も重要なもの、つまり時間を勝ち取るための最良のチャンスかもしれません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "密码货币可能会帮助我们摆脱贫困，就像一些工作可以做的那样，但是，如果你\n如果你是穷人，请诚实地说：每天工作40个小时是不可持续的。\n\n我希望看到我的孩子长大成人，并有时间追求我的激情。是的\n有些工作可能会让我提前退休，如果我没有因为这些工作而死亡的话。",
      "title": "如果你是穷人，加密货币可能是你赢得最重要东西的最好机会：时间"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "密碼貨幣可能會幫助我們擺脫貧困，就像一些工作可以做的那樣，但是，如果你\n如果你是窮人，請誠實地說：每天工作40個小時是不可持續的。\n\n我希望看到我的孩子長大成人，並有時間追求我的激情。是的\n有些工作可能會讓我提前退休，如果我沒有因爲這些工作而死亡的話。",
      "title": "如果你是窮人，加密貨幣可能是你贏得最重要東西的最好機會：時間"
    }
  ]
}