{
  "author": "TheHottestOfBunz",
  "original_created_utc": 1656370442,
  "title": "Have I been cheated on?",
  "created_utc": 1656382802,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is my first ever post. I really just don’t know how to feel right now and I really need to get this off my chest. &lt;/p&gt;\n\n&lt;p&gt;My wife has this really good girl friend of hers where they’ve gotten really close. Last week they went out with friends and for drinks after together while I stayed home and watched our son and put him to bed. That’s ok, I really want her to feel like she can get out and not worry about our son and I. While she was out for drinks after with their friend they shared a kiss. Not a peck but a pretty passionate kiss (she demonstrated it when she told me the next day). Again that was fine, I was happy she was honest with me and felt she could tell me. It was just a kiss with another girl and I’m not gunna worry so much over that. Here’s where I start to get uncomfortable and feeling cheated though.&lt;/p&gt;\n\n&lt;p&gt;Over the past week she told me that they talked about it and never wanted to do more then kiss. This was all leading up to her friend coming over to town for a sleep over at our place this past weekend (she’s still here). Last night they went out and I put our son to bed and went to do work on my computer waiting for them to come back. They ended up staying out for about 45 minutes past the restaurants closing time playing soccer (10:45 PM). Okay, that seemed reasonable. But when they came back they decided to watch a movie while I was still on the computer working. I didn’t have a clear view of them and they were being very quiet and so I listened and stretched to look they were very obviously getting touchy and making out. Alright, now I’m starting to get uncomfortable. The whole time they would talk then get very quiet, being secretive, and feeling each other up. I couldn’t focus on my work so I finished up and decided to sit on the couch behind them and watch the movie too. Great things calmed down. Until my wife decided to go get a blanket. At this point I could clearly see and hear she was doing things to my wife. My wife even typed out a message to her on her phone and just being incredibly secretive. I was not ok with that. If she wasn’t doing anything wrong she wouldn’t feel the need to hide it from me. After the movie everyone was tired and I expected to have a very awkward sleep in bed with my wife. But she ended up staying in the living room and sleeping with her friend. Now, I’m laying in bed seething with anger and I don’t know if they did anything further.&lt;/p&gt;\n\n&lt;p&gt;Just so the other males understand, yes I get it, two women kissing and getting sexual is hot. Even though I agree, this situation unfortunately has made me feel very uncomfortable and like our marital arrangement has been dirtied. Please keep that in mind. I’m just getting this off my chest while curious what others think.&lt;/p&gt;\n\n&lt;p&gt;So, have I been cheated on?&lt;/p&gt;\n\n&lt;p&gt;Edit: I do plan to talk to her tonight when her friend leaves. Additionally, she did even text me today saying “I’m sorry if I hurt you.” She’s knows what she did was wrong. Also, I’m a very non aggressive person which is why I didn’t confront them to begin with. I didn’t want to be looked down on for getting upset, I would’ve immediately been made the enemy.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 435,
  "permalink": "/r/TooAfraidToAsk/comments/vm7uf9/have_i_been_cheated_on/",
  "subreddit": "TooAfraidToAsk",
  "id": "vm7uf9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "This is my first ever post. I really just don’t know how to feel right now and I\nreally need to get this off my chest.\n\nMy wife has this really good girl friend of hers where they’ve gotten really\nclose. Last week they went out with friends and for drinks after together while\nI stayed home and…"
}