{
  "author": "beenoc",
  "the_new_excerpt": "In addition, if anyone has answers:\n\n * I know the idea of using atomic energy for a weapon existed in pop culture\n   well before the Manhattan Project. If the idea of an atomic bomb was so\n   well-known that comic book writers knew about it, what was the harm in comic\n   book readers knowing about…",
  "original_created_utc": 1622664946,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "加えて、誰か答えを持っている人がいれば。\n\n * マンハッタン計画以前から、原子エネルギーを武器に使うというアイデアがポップカルチャーの中に存在していたことは知っています。\n   マンハッタン計画以前から、原子エネルギーを武器に使うというアイデアが大衆文化の中にあったことは知っている。もし原子爆弾のアイデアが漫画家が知っているほど有名だったとしたら\n   漫画家が知っているほど有名だったとしたら、漫画の読者が......を知ることに何の問題があるのでしょうか。\n   漫画家が知っているほど原子爆弾のアイデアがよく知られていたとしたら、漫画本の読者が知っていることに何の問題があるだろうか。",
      "title": "レックス・ルーサーが原子爆弾を使用する1944年のコミックは、マンハッタン計画の機密性を守るために陸軍省の要請により1946年まで延期された。アメリカ政府は、どのようにしてコミックのストーリー展開を知ったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "此外，如果有人有答案。\n\n * 我知道在曼哈顿计划之前，利用原子能作为武器的想法就已经存在于流行文化中了。\n   远在曼哈顿计划之前就存在。如果原子弹的想法是如此众所周知，以至于漫画家们都知道它，那么漫画家们又有什么坏处呢？\n   如果原子弹的想法是如此众所周知，以至于漫画家们都知道它，那么漫画的危害是什么呢？\n   漫画书的读者知道这些又有什么坏处呢？",
      "title": "1944年的一部漫画中，莱克斯-路德使用了一颗原子弹，在陆军部的要求下推迟到1946年，以保护曼哈顿项目的机密性。美国政府怎么会知道有哪些漫画故事情节在进行中呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "此外，如果有人有答案。\n\n * 我知道在曼哈頓計劃之前，利用原子能作爲武器的想法就已經存在於流行文化中了。\n   遠在曼哈頓計劃之前就存在。如果原子彈的想法是如此衆所周知，以至於漫畫家們都知道它，那麼漫畫家們又有什麼壞處呢？\n   如果原子彈的想法是如此衆所周知，以至於漫畫家們都知道它，那麼漫畫的危害是什麼呢？\n   漫畫書的讀者知道這些又有什麼壞處呢？",
      "title": "1944年的一部漫畫中，萊克斯-路德使用了一顆原子彈，在陸軍部的要求下推遲到1946年，以保護曼哈頓項目的機密性。美國政府怎麼會知道有哪些漫畫故事情節在進行中呢？"
    }
  ],
  "title": "A 1944 comic in which Lex Luthor uses an atomic bomb was delayed until 1946 upon request by the War Department to protect the secrecy of the Manhattan Project. How would the US government know what comic storylines were in the works?",
  "created_utc": 1622676177,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In addition, if anyone has answers:</p>\n\n<ul>\n<li>I know the idea of using atomic energy for a weapon existed in pop culture well before the Manhattan Project. If the idea of an atomic bomb was so well-known that comic book writers knew about it, what was the harm in comic book readers knowing about it? Or were the Superman writers at the time more informed than the general public for some reason (and if so, how?)</li>\n<li>Are there other cases of something like this happening (a government requesting or demanding a delay of an entertainment product for national security reasons)?</li>\n</ul>\n\n<p>Wikipedia sources this claim to <em>The Superman Files,</em> by Matthew K. Manning. It also says that a comic strip in 1945 where Lex blasts Superman with particles from a cyclotron was pulled, but that implies it was after publication, so the title question isn&#39;t relevant in that case (though the follow-up question is.)</p>\n</div><!-- SC_ON -->",
  "score": 330,
  "permalink": "/r/AskHistorians/comments/nqv7cl/a_1944_comic_in_which_lex_luthor_uses_an_atomic/",
  "subreddit": "AskHistorians",
  "id": "nqv7cl",
  "is_self": true,
  "media": null,
  "is_video": false
}