{
  "approved_at_utc": null,
  "subreddit": "Bogleheads",
  "selftext": "# Part 1: The Virgin\n\nI started out like like many of you. I had some extra cash from my college job. I stumbled upon some random Youtube video talking about savings accounts and mortgages and such. They mentioned S&amp;P 500 index funds and 8% returns and I thought, \"Hey that's great!\" And so I put my money into an S&amp;P 500 mutual fund. I was pretty happy. But then the demonic thought struck me, \"If my money is going to be invested, shouldn't I try to put it into the investment that will make me as much money as possible?\"\n\n# Part 2: Performance Chasing\n\nShortly thereafter I discovered QQQ. There was one article showing how QQQ had returned over 700% since 2010 while the S&amp;P 500 returned just over 200% and the Dow was even worse. \"700% is so much better than 200%! I'm going to invest in QQQ!\" I even put money into TQQQ. Oh those were such innocent times.\n\n# Part 3: The Stock Picker\n\nIn order to reaffirm my beliefs that QQQ was the best fund out there, I read many articles talking about growth. These often compared growth to value, and mentioned that value historically has beaten growth. \"More outperformance?\" I thought. \"Sign me up!\" I read about Buffett and finding cheap but great companies. I wanted to be like him. So I googled the best value stocks. Micron came up all over the place. It was at $85 and falling. I thought, \"It was so much higher before, this looks really cheap now!\" All the analysts were saying Micron was a great stock with 20% upside, 40% upside, 60% upside. There was no way I could go wrong! Two days in a row it went up 3-5%. \"The momentum is going back up! Now is the time to buy!\" I sold half of my QQQ and put it into Micron. I was so happy with my research. Almost like clockwork it immediately fell the next week. I kept holding on. I read every article from seeking alpha and everywhere else about Micron. Over and over I reaffirmed my beliefs that it was coming back up. It didn't. After a couple months I sold for a $500 loss.\n\nThe stress of huge intraday swings, watching the market every day, reading every article on my portfolio, and being constantly in the red was awful. I hated it. \"I'm done with individual stocks. I'm sticking to index funds from now on.\" In hindsight, I'm glad I only lost $500 learning this lesson.\n\n# Part 4: Birth of a Boglehead\n\nI still wanted the best returns possible on my investment, so I continued pursuing factor investing. I eventually stumbled upon Ben Felix's Youtube channel on factors, and then just kept watching everything else he made. I listened to Rational Reminder every week and discovered the Boglehead community from random searches on factor investing. I learned about diversification, international investing, factors, bonds, taxes, account types, staying the course, low fees, and everything else I could. This info not only helped me craft a portfolio that fit my needs but helped me understand so much better how that portfolio will behave and not to be surprised. Just keep buying. These lessons have made my emotional burden with investing so much lighter.\n\n# Part 5: Bogle Transcendence\n\nDuring this period I discovered Optimized Portfolio and, because investing research had become my hobby a long time prior, I obviously read every article on the site. Amazing work there. Without that site I would never have learned about long term treasuries being the best diversifier to stocks or about (\\*suspenseful pause\\*) leverage. \\*bogle screams in his grave\\*. I started investing in hfea and ntsx. I read all of the major reddit and original forum posts about hfea and leverage. Hopefully it will give me financial freedom much earlier in life than I could achieve otherwise.\n\n# Part 6: Moving On\n\nI spent a lot of time on r/bogleheads and r/letfs. Eventually, everything become redundant. Almost every post was about the same things. There wasn't a lot of new stuff to learn or do. Trading strategies do get pretty advanced, but I've got no interest. My goal was to make more money, not less lmao. But that's the goal, isn't it? To get your knowledge and strategy down to a point that you can forget about it.\n\nNowadays I spend much less time on investing. I only know what's going on in r/bogleheads from r/boglememes lol. Now I just need to find a new hobby.",
  "author_fullname": "t2_5egt37yo",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Lifecycle of a Boglehead",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/Bogleheads",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_sye9ud",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.85,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 18,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": "",
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 18,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1645509159,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1645503918,
  "link_flair_type": "text",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.Bogleheads",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h1&gt;Part 1: The Virgin&lt;/h1&gt;\n\n&lt;p&gt;I started out like like many of you. I had some extra cash from my college job. I stumbled upon some random Youtube video talking about savings accounts and mortgages and such. They mentioned S&amp;amp;P 500 index funds and 8% returns and I thought, &amp;quot;Hey that&amp;#39;s great!&amp;quot; And so I put my money into an S&amp;amp;P 500 mutual fund. I was pretty happy. But then the demonic thought struck me, &amp;quot;If my money is going to be invested, shouldn&amp;#39;t I try to put it into the investment that will make me as much money as possible?&amp;quot;&lt;/p&gt;\n\n&lt;h1&gt;Part 2: Performance Chasing&lt;/h1&gt;\n\n&lt;p&gt;Shortly thereafter I discovered QQQ. There was one article showing how QQQ had returned over 700% since 2010 while the S&amp;amp;P 500 returned just over 200% and the Dow was even worse. &amp;quot;700% is so much better than 200%! I&amp;#39;m going to invest in QQQ!&amp;quot; I even put money into TQQQ. Oh those were such innocent times.&lt;/p&gt;\n\n&lt;h1&gt;Part 3: The Stock Picker&lt;/h1&gt;\n\n&lt;p&gt;In order to reaffirm my beliefs that QQQ was the best fund out there, I read many articles talking about growth. These often compared growth to value, and mentioned that value historically has beaten growth. &amp;quot;More outperformance?&amp;quot; I thought. &amp;quot;Sign me up!&amp;quot; I read about Buffett and finding cheap but great companies. I wanted to be like him. So I googled the best value stocks. Micron came up all over the place. It was at $85 and falling. I thought, &amp;quot;It was so much higher before, this looks really cheap now!&amp;quot; All the analysts were saying Micron was a great stock with 20% upside, 40% upside, 60% upside. There was no way I could go wrong! Two days in a row it went up 3-5%. &amp;quot;The momentum is going back up! Now is the time to buy!&amp;quot; I sold half of my QQQ and put it into Micron. I was so happy with my research. Almost like clockwork it immediately fell the next week. I kept holding on. I read every article from seeking alpha and everywhere else about Micron. Over and over I reaffirmed my beliefs that it was coming back up. It didn&amp;#39;t. After a couple months I sold for a $500 loss.&lt;/p&gt;\n\n&lt;p&gt;The stress of huge intraday swings, watching the market every day, reading every article on my portfolio, and being constantly in the red was awful. I hated it. &amp;quot;I&amp;#39;m done with individual stocks. I&amp;#39;m sticking to index funds from now on.&amp;quot; In hindsight, I&amp;#39;m glad I only lost $500 learning this lesson.&lt;/p&gt;\n\n&lt;h1&gt;Part 4: Birth of a Boglehead&lt;/h1&gt;\n\n&lt;p&gt;I still wanted the best returns possible on my investment, so I continued pursuing factor investing. I eventually stumbled upon Ben Felix&amp;#39;s Youtube channel on factors, and then just kept watching everything else he made. I listened to Rational Reminder every week and discovered the Boglehead community from random searches on factor investing. I learned about diversification, international investing, factors, bonds, taxes, account types, staying the course, low fees, and everything else I could. This info not only helped me craft a portfolio that fit my needs but helped me understand so much better how that portfolio will behave and not to be surprised. Just keep buying. These lessons have made my emotional burden with investing so much lighter.&lt;/p&gt;\n\n&lt;h1&gt;Part 5: Bogle Transcendence&lt;/h1&gt;\n\n&lt;p&gt;During this period I discovered Optimized Portfolio and, because investing research had become my hobby a long time prior, I obviously read every article on the site. Amazing work there. Without that site I would never have learned about long term treasuries being the best diversifier to stocks or about (*suspenseful pause*) leverage. *bogle screams in his grave*. I started investing in hfea and ntsx. I read all of the major reddit and original forum posts about hfea and leverage. Hopefully it will give me financial freedom much earlier in life than I could achieve otherwise.&lt;/p&gt;\n\n&lt;h1&gt;Part 6: Moving On&lt;/h1&gt;\n\n&lt;p&gt;I spent a lot of time on &lt;a href=\"/r/bogleheads\"&gt;r/bogleheads&lt;/a&gt; and &lt;a href=\"/r/letfs\"&gt;r/letfs&lt;/a&gt;. Eventually, everything become redundant. Almost every post was about the same things. There wasn&amp;#39;t a lot of new stuff to learn or do. Trading strategies do get pretty advanced, but I&amp;#39;ve got no interest. My goal was to make more money, not less lmao. But that&amp;#39;s the goal, isn&amp;#39;t it? To get your knowledge and strategy down to a point that you can forget about it.&lt;/p&gt;\n\n&lt;p&gt;Nowadays I spend much less time on investing. I only know what&amp;#39;s going on in &lt;a href=\"/r/bogleheads\"&gt;r/bogleheads&lt;/a&gt; from &lt;a href=\"/r/boglememes\"&gt;r/boglememes&lt;/a&gt; lol. Now I just need to find a new hobby.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "call_to_action": "",
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2shb7",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "sye9ud",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "TissueWizardIV",
  "discussion_type": null,
  "num_comments": 11,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/Bogleheads/comments/sye9ud/lifecycle_of_a_boglehead/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/Bogleheads/comments/sye9ud/lifecycle_of_a_boglehead/",
  "subreddit_subscribers": 141805,
  "created_utc": 1645512612,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1645503918,
  "the_new_excerpt": "PART 1: THE VIRGIN\n\nI started out like like many of you. I had some extra cash from my college job.\nI stumbled upon some random Youtube video talking about savings accounts and\nmortgages and such. They mentioned S&P 500 index funds and 8% returns and I\nthought, \"Hey that's great!\" And so I put my…"
}