{
  "author": "pepperonimilkjuice5",
  "original_created_utc": 1626782045,
  "title": "For people new to crypto: this never happened before. This is the first dip in cryptocurrency history.",
  "created_utc": 1626795662,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So we all know Satoshi Nakamoto made Bitcoin so that the value will go up exponentially forever.</p>\n\n<p>Right now Bitcoin dropped below $30k and I never seen this before (I am a crypto veteran since February 2021). Some YouTube crypto experts said Bitcoin was going to reach $200k by the end of this year. I am not sure what is happening right now, but it clearly is market manipulation.</p>\n\n<p>Even though we still have time to reach $200k end of the year, as a veteran, I think it is wise to sell now and FOMO back in when you see the price go up.</p>\n\n<p>This is not financial advice. I only know how to lose money.</p>\n</div><!-- SC_ON -->",
  "score": 193,
  "permalink": "/r/CryptoCurrency/comments/oo0kds/for_people_new_to_crypto_this_never_happened/",
  "subreddit": "CryptoCurrency",
  "id": "oo0kds",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So we all know Satoshi Nakamoto made Bitcoin so that the value will go up\nexponentially forever.\n\nRight now Bitcoin dropped below $30k and I never seen this before (I am a crypto\nveteran since February 2021). Some YouTube crypto experts said Bitcoin was going\nto reach $200k by the end of this year.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サトシ・ナカモトがビットコインを作ったのは、その価値が永遠に\n指数関数的に永遠に上昇するようにしました。\n\n今、ビットコインは3万ドルを下回りましたが、こんなことは初めてです（私は2021年2月からクリプト\n2021年2月以来のベテランです）。) YouTubeの暗号専門家の中には、Bitcoinは年末までに\n今年の終わりまでに200kドルに達すると言っていました....",
      "title": "暗号に慣れていない人のために：これは今までになかったことです。これは暗号通貨の歴史で初めてのディップです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，我们都知道中本聪创造了比特币，使其价值将永远以指数形式上升。\n永远以指数形式增长。\n\n现在，比特币跌到了3万美元以下，我以前从未见过这种情况（我是一个从2021年2月开始的加密货币\n老手，自2021年2月以来）。) 一些YouTube上的加密货币专家说，比特币将在\n到今年年底将达到20万美元....",
      "title": "对于刚接触加密货币的人来说：这以前从未发生过。这是加密货币历史上的第一次跌落。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，我們都知道中本聰創造了比特幣，使其價值將永遠以指數形式上升。\n永遠以指數形式增長。\n\n現在，比特幣跌到了3萬美元以下，我以前從未見過這種情況（我是一個從2021年2月開始的加密貨幣\n老手，自2021年2月以來）。) 一些YouTube上的加密貨幣專家說，比特幣將在\n到今年年底將達到20萬美元....",
      "title": "對於剛接觸加密貨幣的人來說：這以前從未發生過。這是加密貨幣歷史上的第一次跌落。"
    }
  ]
}