{
  "author": "Jakeron",
  "the_new_excerpt": "Just because your portfolio is up 200% over the past two months, doesn't mean\nyou're an investing expert. If family or friends come to you looking for advice\nin what coins to pick, be very careful about where you direct them. You should\npoint them in the right direction towards useful resources and…",
  "original_created_utc": 1613340314,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "仅仅因为你的投资组合在过去两个月内上涨了200%，并不意味着\n你是一个投资专家。如果家人或朋友来向你寻求建议的话\n在选择什么币的时候，要非常小心你的方向。你应该\n指引他们走向有用的资源和...",
      "title": "小心给你的朋友和家人提供加密建议"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "僅僅因爲你的投資組合在過去兩個月內上漲了200%，並不意味着\n你是一個投資專家。如果家人或朋友來向你尋求建議的話\n在選擇什麼幣的時候，要非常小心你的方向。你應該\n指引他們走向有用的資源和...",
      "title": "小心給你的朋友和家人提供加密建議"
    }
  ],
  "title": "Beware giving crypto advice to your friends and family",
  "created_utc": 1613350525,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just because your portfolio is up 200% over the past two months, doesn&#39;t mean you&#39;re an investing expert.  If family or friends come to you looking for advice in what coins to pick, be very careful about where you direct them.  You should point them in the right direction towards useful resources and explain what the technology is behind certain projects.</p>\n\n<p><strong>If you find yourself telling them that they can double there investment in a months time, you&#39;re making a big mistake.</strong>  If the market crashes again like it did in 2018, you&#39;ve just damaged a relationship.  </p>\n\n<p>I told multiple people close to me about crypto in December of 2017 before the big crash, and when things went downhill in 2018, I looked like a fool.  I was over</p>\n\n<p>Make sure that you make it very clear when answering questions, that you don&#39;t know what the future holds and that they should only invest what they can afford to lose.</p>\n</div><!-- SC_ON -->",
  "score": 3306,
  "permalink": "/r/CryptoCurrency/comments/ljykcz/beware_giving_crypto_advice_to_your_friends_and/",
  "subreddit": "CryptoCurrency",
  "id": "ljykcz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728617843
}