{
  "author": "Cr1ticalRatTheory",
  "original_created_utc": 1650284638,
  "title": "LPT If you're planning on visiting San Francisco please for the love of God do not leave ANYTHING of even a vague resemblance of value in your car, or your windows will get smashed and you'll lose it.",
  "created_utc": 1650333702,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not talking about a laptop or a purse. I&amp;#39;m talking about a hoodie, a blanket, a travel mug, a USB cable, or heaven forbid a few coins in plain sight. Hell, even kids toys aren&amp;#39;t safe.&lt;/p&gt;\n\n&lt;p&gt;Tinted windows are practically a guarantee your windows will get smashed. The biggest pain in the ass is getting the windows replaced, not necessarily whatever gets stolen.&lt;/p&gt;\n\n&lt;p&gt;Buddy of mine who used to live in lower Haight got his car windows smashed so often he decided to just leave them down one night. He woke up to find THREE homeless people sleeping in his car.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 80084,
  "permalink": "/r/LifeProTips/comments/u6bwdo/lpt_if_youre_planning_on_visiting_san_francisco/",
  "subreddit": "LifeProTips",
  "id": "u6bwdo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm not talking about a laptop or a purse. I'm talking about a hoodie, a\nblanket, a travel mug, a USB cable, or heaven forbid a few coins in plain sight.\nHell, even kids toys aren't safe.\n\nTinted windows are practically a guarantee your windows will get smashed. The\nbiggest pain in the ass is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ノートパソコンや財布のことではありません。パーカーやバッグのことではありません。\n毛布、旅行用マグカップ、USBケーブル、そして小銭など、目につくところに置いてはいけません。\n子供のおもちゃでさえも安全ではありません。\n\n着色された窓は、窓ガラスが割られることを保証しているようなものです。そして\n一番面倒なのは...",
      "title": "LPT サンフランシスコに行く予定がある人は、頼むから車に価値のありそうなものを少しでも置いていかないでくれ、窓を割られて失うことになる。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我说的不是一台笔记本电脑或一个钱包。我说的是一件连帽衫、一条毯子、一个旅行杯、一根USB线，或者是天大的硬币。\n毯子、旅行杯、USB数据线，或者天堂般的几枚硬币。\n该死的，甚至儿童玩具也不安全。\n\n有色的车窗几乎可以保证你的车窗会被砸坏。最麻烦的是\n最大的麻烦是...",
      "title": "LPT 如果你打算去旧金山，请看在上帝的份上，不要把任何有价值的东西留在你的车里，哪怕是一个模糊的相似点，否则你的车窗会被砸碎，你会失去它。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我說的不是一臺筆記本電腦或一個錢包。我說的是一件連帽衫、一條毯子、一個旅行杯、一根USB線，或者是天大的硬幣。\n毯子、旅行杯、USB數據線，或者天堂般的幾枚硬幣。\n該死的，甚至兒童玩具也不安全。\n\n有色的車窗幾乎可以保證你的車窗會被砸壞。最麻煩的是\n最大的麻煩是...",
      "title": "LPT 如果你打算去舊金山，請看在上帝的份上，不要把任何有價值的東西留在你的車裏，哪怕是一個模糊的相似點，否則你的車窗會被砸碎，你會失去它。"
    }
  ]
}