{
  "author": "SlayerSleyX",
  "original_created_utc": 1635096593,
  "title": "NFT gaming is still garbage",
  "created_utc": 1635118286,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m not sure if it’s an unpopular opinion. But to me all the NFT games are a load of crap. As of yet at least. I can see in the future games like GTA with NFT cars and weapons and even clothes. That would revolutionize gaming. Maybe an RPG games with player based economies with different professions and loot that is all NFT. I think the future is bright but we’re no where near the point where is worth getting into. I think if all these crypto games had no crypto involved they would be dead the next day with the exception of crypto royale ( which is super fun). What are your opinions? Any games out there that are worth your time?</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/qewsjb/nft_gaming_is_still_garbage/",
  "subreddit": "CryptoCurrency",
  "id": "qewsjb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m not sure if it’s an unpopular opinion. But to me all the NFT games are a\nload of crap. As of yet at least. I can see in the future games like GTA with\nNFT cars and weapons and even clothes. That would revolutionize gaming. Maybe an\nRPG games with player based economies with different professions…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "不人気な意見ではありますが しかし、私にとってNFTのゲームはすべてくだらないものです。\nくだらない。少なくとも今のところはね。将来的には、GTAのようなゲームがNFTのゲームと一緒になることも考えられます。\nNFTの車や武器、そして服までもが登場するGTAのようなゲームが それはゲームに革命をもたらすでしょう。もしかしたら\nRPGゲームでは、様々な職業を持ったプレイヤーベースの経済活動が行われるかもしれません。",
      "title": "NFTのゲームはやっぱりゴミ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道这是否是一个不受欢迎的观点。但对我来说，所有的NFT游戏都是一坨屎。\n一堆废话。至少到现在为止是这样。我可以看到在未来，像《GTA》这样的游戏有NFT汽车和武器甚至衣服。\nNFT汽车和武器，甚至衣服。这将彻底改变游戏。也许是一个\n以玩家为基础的具有不同职业的经济的RPG游戏......",
      "title": "NFT游戏仍然是垃圾"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道這是否是一個不受歡迎的觀點。但對我來說，所有的NFT遊戲都是一坨屎。\n一堆廢話。至少到現在爲止是這樣。我可以看到在未來，像《GTA》這樣的遊戲有NFT汽車和武器甚至衣服。\nNFT汽車和武器，甚至衣服。這將徹底改變遊戲。也許是一個\n以玩家爲基礎的具有不同職業的經濟的RPG遊戲......",
      "title": "NFT遊戲仍然是垃圾"
    }
  ]
}