{
  "author": "boneywankenobi",
  "the_new_excerpt": "Thought I'd take a chance to provide some information on a stock that I have\nliked for a while, MP Materials. Right now it is sitting at a low point for a\nwhile and I think the time is ripe for the pickens. Why do I think this right\nnow?\n\nWell MP sits at a mining site in the middle of the desert out…",
  "original_created_utc": 1617241735,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我想我应该借此机会提供一些信息，我有一只股票。\n喜欢了一段时间，mp材料。现在正坐在一个低点，对于。\n而我认为时机已经成熟，是时候采摘了。为什么我认为这是对的\n现在？\n\n国会议员坐在沙漠中的一个矿区... ...",
      "title": "$MP材料公司 - 一家将可持续生产带回美国的稀有稀土公司。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想我應該藉此機會提供一些信息，我有一隻股票。\n喜歡了一段時間，mp材料。現在正坐在一個低點，對於。\n而我認爲時機已經成熟，是時候採摘了。爲什麼我認爲這是對的\n現在？\n\n國會議員坐在沙漠中的一個礦區... ...",
      "title": "$MP材料公司 - 一家將可持續生產帶回美國的稀有稀土公司。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "この機会に、私が持っている株の情報を提供しようと思いました。\nの情報を提供しようと思いました。今、この銘柄はしばらくの間、安値圏にあります。\n私は今がチャンスだと思っています。なぜこのように考えるのか？\n思うのか？\n\nそれは、MP社が砂漠の真ん中にある採掘場にあるからです。",
      "title": "$MP Materials - 持続可能な生産を米国にもたらす希少なレアアース企業"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "この機会に、私が持っている株の情報を提供しようと思いました。\nの情報を提供しようと思いました。今、この銘柄はしばらくの間、安値圏にあります。\n私は今がチャンスだと思っています。なぜこのように考えるのか？\n思うのか？\n\nそれは、MP社が砂漠の真ん中にある採掘場にあるからです。",
      "title": "$MP Materials - 持続可能な生産を米国にもたらす希少なレアアース企業"
    }
  ],
  "title": "$MP Materials - A rare, rare earth company bringing sustainable production back to the US",
  "created_utc": 1617267285,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Thought I&#39;d take a chance to provide some information on a stock that I have liked for a while, MP Materials.  Right now it is sitting at a low point for a while and I think the time is ripe for the pickens.  Why do I think this right now?</p>\n\n<p>Well MP sits at a mining site in the middle of the desert out near the Cali-Nevada border.  <a href=\"https://www.google.com/maps/search/mp+materials/@35.4652108,-115.5387785,17915m/data=!3m1!1e3\">They sit just south of Las Vegas</a> right next to a highway for easy transport of the extracted and purified materials as they both mine and refine the ore. </p>\n\n<p>Well let&#39;s start with what they do: rare earth materials mining.  Not the sexiest job on the planet, but it is necessary for all things tech.  Rare earths are a key component of clean energy, IT, defense, industrial applications, and neat little magnets.  Right now, the vast majority of rare earths are produced by China at 80%, leaving a huge vulnerability in a high sought after market.  The market isn&#39;t going away but China could pull it&#39;s supply.</p>\n\n<p>The US-China relations are at a pretty fragile point.  <a href=\"https://www.newsweek.com/unforgivable-china-furious-nasa-calling-taiwan-country-1580084\">NASA has even called Taiwan a country</a> which is a hugely sensitive issue.   The current administration seeks to counter Chinese competition and upend their dominance and has been <a href=\"https://www.reuters.com/article/us-autos-semiconductors-biden-order/biden-to-order-review-of-u-s-reliance-on-overseas-supply-chains-for-semiconductors-rare-earths-cnbc-idUSKBN2AI2HJ\">reviewing the reliance on China for rare earths</a>.  </p>\n\n<p><a href=\"https://www.nasdaq.com/articles/mp-materials-quarterly-profit-jumps-on-rising-rare-earths-prices-2021-03-18\">The price of rare earths is rising, and it caused a jump in the stock price earlier in the month</a> - the soaring need for electric vehicles should continue to push it further.  Though the stock price jumped, it did plummet on news that they were <a href=\"https://investors.mpmaterials.com/investor-news/news-details/2021/MP-Materials-Announces-Pricing-of-600-Million-Green-Convertible-Senior-Notes-Offering/default.aspx\">issuing some additional shares, about 10%, to fund new green energy initiatives.</a>.  With a larger focus on environmentally friendly projects, it makes $MP a prime target for eco-conscious investors.  </p>\n\n<p>In my opinion, the price dive spooked a large amount of investors sending it way below it&#39;s fair value.  10% dilution rocked it to a 30% price dive that it is coming back from strongly now.  Even with the dilution included, the price should pop back up another 20% or so as the market in growth stock picks back up.  $MP doubled the analyst estimates for EPS in Q4 last year and don&#39;t look to be slowing down.  <a href=\"https://www.barchart.com/stocks/quotes/MP/earnings-estimates\">Looking ahead, the forward looking EPS estimates put it at close to $2 for a 15 p/e ratio</a> with $0.48 EPS in the 4th quarter of 2021.  MP materials hasn&#39;t been around long, taking over the site from failed Molycorp, but appear to be hitting it at a good time.  Now not only are they expected to be profitable quickly, but also have the new $584m in cash to ramp up and clean up their operation to ensure a sustainable and competitive supplier of rare earths.</p>\n\n<p><a href=\"https://s25.q4cdn.com/570172628/files/doc_presentations/2021/MP-4Q20-Earnings-Deck-FINAL-(3\">If you look at their earnings presentation</a>-3.18.2021.pdf), the story keeps getting better though.  They had 100% YoY revenue growth and are still reducing the cost of production.  Modest for Q4 YoY, but 25% for the entire year.  </p>\n\n<p>I am long MP, with a few hundred shares and a 4/16 $45c.  I like the potential of such a young company that is already pulling a profit in a growing market with a sustainable business model.  Somehow this is a growth stock that has a profitable business model, seems like a safe bet to me - though this isn&#39;t financial advise, this is just my own opinion.</p>\n</div><!-- SC_ON -->",
  "score": 68,
  "permalink": "/r/stocks/comments/mhkybv/mp_materials_a_rare_rare_earth_company_bringing/",
  "subreddit": "stocks",
  "id": "mhkybv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357144822
}