{
  "author": "SomeWateryTwat",
  "original_created_utc": 1650681083,
  "title": "Did lead-laced wine jugs contribute to the fall of the Roman Empire?",
  "created_utc": 1650706641,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I came across this quote in my textbook, &amp;quot;The fall of the Roman Empire has been blamed on the consumption of wine...because wine at the time was fermented and stored in vessels made of lead, and a lead-based additive was used to enhance flavour. It is believed most of the Roman nobility suffered mental instability as a result of lead poisoning.&amp;quot; This is NOT a history textbooks and this immediately stuck out to me as suspect.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/u9v7z2/did_leadlaced_wine_jugs_contribute_to_the_fall_of/",
  "subreddit": "AskHistorians",
  "id": "u9v7z2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I came across this quote in my textbook, \"The fall of the Roman Empire has been\nblamed on the consumption of wine...because wine at the time was fermented and\nstored in vessels made of lead, and a lead-based additive was used to enhance\nflavour. It is believed most of the Roman nobility suffered…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ローマ帝国の滅亡は、消費に起因すると言われている。\nというのも、当時のワインは発酵させ、樽に貯蔵していたからです。\n当時のワインは鉛の容器で発酵・貯蔵され、風味を良くするために鉛の添加物が使われていた。\nの風味を高めるために使用されていたからである。ローマ帝国の貴族のほとんどが苦しんだと言われている...。",
      "title": "ローマ帝国の滅亡は、鉛入りのワインジャグが原因か？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在教科书中看到这样一段话：\"罗马帝国的衰落被归咎于\n归咎于葡萄酒的消费......因为当时的葡萄酒是发酵的，储存在铅制的容器中。\n因为当时的葡萄酒是在铅制的容器中发酵和储存的，并且使用一种铅基添加剂来提高\n味道。据认为，大多数罗马贵族遭受了...",
      "title": "带铅的酒壶是否促成了罗马帝国的衰落？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在教科書中看到這樣一段話：\"羅馬帝國的衰落被歸咎於\n歸咎於葡萄酒的消費......因爲當時的葡萄酒是發酵的，儲存在鉛製的容器中。\n因爲當時的葡萄酒是在鉛製的容器中發酵和儲存的，並且使用一種鉛基添加劑來提高\n味道。據認爲，大多數羅馬貴族遭受了...",
      "title": "帶鉛的酒壺是否促成了羅馬帝國的衰落？"
    }
  ]
}