{
  "author": "garmack",
  "the_new_excerpt": "So whenever I look into this, all I find is a bunch of questions about why\nRussia is so underpopulated, relative to the massive size of their country. This\nseems obvious: most of Russia is freezing cold Siberian land. It makes sense\nthat an east so vast and hostile wouldn’t be densely…",
  "original_created_utc": 1612193504,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以每当我研究这个问题的时候，我发现的都是一堆问题，为什么？\n相对于他们庞大的国土面积来说，俄罗斯的人口太少了。这\n似乎是显而易见的：俄罗斯大部分地区是冰冷的西伯利亚土地。这是有道理的\n东方如此辽阔，充满敌意，却没有密密麻麻... ...",
      "title": "俄罗斯是一个遥远的北方国家，天寒地冻，怎么会有这么多的人口？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以每當我研究這個問題的時候，我發現的都是一堆問題，爲什麼？\n相對於他們龐大的國土面積來說，俄羅斯的人口太少了。這\n似乎是顯而易見的：俄羅斯大部分地區是冰冷的西伯利亞土地。這是有道理的\n東方如此遼闊，充滿敵意，卻沒有密密麻麻... ...",
      "title": "俄羅斯是一個遙遠的北方國家，天寒地凍，怎麼會有這麼多的人口？"
    }
  ],
  "title": "How is Russia, a country far north with freezing temperatures, so heavily populated?",
  "created_utc": 1612209296,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So whenever I look into this, all I find is a bunch of questions about why Russia is so underpopulated, relative to the massive size of their country. This seems obvious: most of Russia is freezing cold Siberian land. It makes sense that an east so vast and hostile wouldn’t be <em>densely</em> populated. </p>\n\n<p>However, taking this into consideration, it’s actually more surprising to me just how heavily populated this country as a whole is. Sure, the east is pretty vast and <em>relatively</em> empty, but Russia’s total population is still the 9th largest on earth. This is for a country that is far north in Europe with no real natural barriers to protect them from neighbouring countries. On top of this, the country has a pretty harsh climate besides their land in the south, though most of the population seems concentrated more north. </p>\n\n<p>So how is this the case? Why is it that Russia - remote, unprotected, with an overwhelmingly harsher climate than most of Europe - has such a gigantic population?</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/AskHistorians/comments/la5qdd/how_is_russia_a_country_far_north_with_freezing/",
  "subreddit": "AskHistorians",
  "id": "la5qdd",
  "is_self": true,
  "media": null,
  "is_video": false
}