{
  "author": "Pearl_is_gone",
  "the_new_excerpt": "Whats your view on these \"quasi-passive\" indices. I saw earlier today a post\nstating that specialized ETFs typically underperform the market as they were\ntypically launched post rallies and publicity events. However, now you can find\nsector specific indices for almost every market, and thus should…",
  "original_created_utc": 1610822345,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你对这些 \"准被动 \"指数有什么看法。我今天早些时候看到一个帖子\n指出，专门的ETF通常表现低于市场，因为它们是。\n通常在集会和宣传活动后推出。然而，现在你可以找到\n几乎每个市场都有特定的行业指数，因此应...",
      "title": "你看好哪些行业的ETF？对这些类型有什么看法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你對這些 \"準被動 \"指數有什麼看法。我今天早些時候看到一個帖子\n指出，專門的ETF通常表現低於市場，因爲它們是。\n通常在集會和宣傳活動後推出。然而，現在你可以找到\n幾乎每個市場都有特定的行業指數，因此應...",
      "title": "你看好哪些行業的ETF？對這些類型有什麼看法？"
    }
  ],
  "title": "What sector etfs are you bullish on? Thoughts on these types?",
  "created_utc": 1610830683,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Whats your view on these &quot;quasi-passive&quot; indices. I saw earlier today a post stating that specialized ETFs typically underperform the market as they were typically launched post rallies and publicity events. However, now you can find sector specific indices for almost every market, and thus should be able to get in independent of triggering publicity/rally events. Hence, done right i think it can be a great addition to the portfolio </p>\n\n<p>To add, I hold 4 of these (UK based): (all bought in 2020 and everyone except for espo has since beaten the global index)</p>\n\n<ul>\n<li>Cloud Computing (FSKY)</li>\n<li>Green energy (INRG, top 35 companies)</li>\n<li>Em eCommerce (emqp) </li>\n<li>Video gaming (espo)</li>\n</ul>\n\n<p>I see this as a way to get exposure to 4 sectors I am very convinced on over the next 5 years. Whats your view? Is this a good addition to a portfolio consisting of 50% global index and the rest sector and company specific shares?</p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/investing/comments/kyoizi/what_sector_etfs_are_you_bullish_on_thoughts_on/",
  "subreddit": "investing",
  "id": "kyoizi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311216189
}