{
  "author": "Bpool91",
  "original_created_utc": 1658315029,
  "title": "Anyone else wish the price would stop rising?",
  "created_utc": 1658334913,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We&amp;#39;re supposed to be in a bear market, it&amp;#39;s perfect for me to get more bang for my buck. &lt;/p&gt;\n\n&lt;p&gt;I was promised a year long bear market, at first I was saddened at the thought of seeing my portfolio dwindle down to low amounts but then I had excitement, I can get this shit cheap as chips. &lt;/p&gt;\n\n&lt;p&gt;And what does the market decide to do, green green green. &lt;/p&gt;\n\n&lt;p&gt;Can we get a few FUD stories going, maybe someone post about a CEX halting trading and being insolvent. &lt;/p&gt;\n\n&lt;p&gt;Sure my limit sells are being filled but my poor poor limit buys are unfilled.&lt;/p&gt;\n\n&lt;p&gt;EDIT - I did put a comedy flair, not sure if some people can&amp;#39;t see it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 757,
  "permalink": "/r/CryptoCurrency/comments/w3jjz9/anyone_else_wish_the_price_would_stop_rising/",
  "subreddit": "CryptoCurrency",
  "id": "w3jjz9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We're supposed to be in a bear market, it's perfect for me to get more bang for\nmy buck.\n\nI was promised a year long bear market, at first I was saddened at the thought\nof seeing my portfolio dwindle down to low amounts but then I had excitement, I\ncan get this shit cheap as chips.\n\nAnd what does…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "弱気相場のはずだから、もっとバンバン売れてもいいと思うんだけどね。\nを得るには最適です。\n\n私は1年間の弱気相場が続くと約束されていました。\n最初は、自分のポートフォリオが低額に減っていくのを見るのは悲しいと思いましたが、その後、私は興奮しました。\nこのクソを安く手に入れることができるんだ。\n\nそれで...",
      "title": "価格高騰が止まればいいのにと思う人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们应该处于一个熊市，这对我来说是完美的，可以获得更多的收益。\n我的钱。\n\n我被许诺会有一个为期一年的熊市，起初我对看到我的投资组合减少到很低的数额感到很难过。\n看到我的投资组合缩减到很低的数额，我感到很兴奋。\n我可以买到这些便宜的东西。\n\n而什么是...",
      "title": "还有人希望价格停止上涨吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們應該處於一個熊市，這對我來說是完美的，可以獲得更多的收益。\n我的錢。\n\n我被許諾會有一個爲期一年的熊市，起初我對看到我的投資組合減少到很低的數額感到很難過。\n看到我的投資組合縮減到很低的數額，我感到很興奮。\n我可以買到這些便宜的東西。\n\n而什麼是...",
      "title": "還有人希望價格停止上漲嗎？"
    }
  ]
}