{
  "author": "gamersyn",
  "the_new_excerpt": "What I mean by hive-mind bargaining is that none of this is organized, but most\nworking people in America are already on the same page that everything is shit\nand they don't want to participate.\n\nIt's like we're already participating in a general strike, we just need to\norganize everyone into unions…",
  "original_created_utc": 1620500387,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が言うハイブマインド・バーゲンとは、このようなことが組織的に行われているわけではありませんが、アメリカのほとんどの労働者は\nアメリカのほとんどの労働者は、何もかもがクソだという同じページをすでに持っていて、参加したくないのです。\n参加したくないのです。\n\n私たちはすでにゼネストに参加しているようなもので、ただ全員を組合に組織する必要があるだけです。\nただ、全員を組合に組織する必要がある...。",
      "title": "失業率が過去最高になり、企業が「身内びいきの交渉」で労働者の確保に苦労している今、労働者階級の労働組合化の歴史的なチャンスではないだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我所说的蜂巢式谈判的意思是，这些都不是有组织的，但大多数\n美国的大多数劳动者已经有了相同的看法，认为一切都很糟糕\n而且他们不想参与。\n\n这就像我们已经在参加大罢工了，我们只需要\n把每个人都组织到工会中去...",
      "title": "随着失业率创下历史新高，公司因 \"一窝蜂式的讨价还价 \"而难以找到工人，这是否是一个让工人阶级加入工会的历史机遇？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我所說的蜂巢式談判的意思是，這些都不是有組織的，但大多數\n美國的大多數勞動者已經有了相同的看法，認爲一切都很糟糕\n而且他們不想參與。\n\n這就像我們已經在參加大罷工了，我們只需要\n把每個人都組織到工會中去...",
      "title": "隨着失業率創下歷史新高，公司因 \"一窩蜂式的討價還價 \"而難以找到工人，這是否是一個讓工人階級加入工會的歷史機遇？"
    }
  ],
  "title": "With unemployment at an all time high and companies having trouble finding workers due to a 'hive-mind bargaining', is this a historical opportunity to unionize the working class?",
  "created_utc": 1620543505,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What I mean by hive-mind bargaining is that none of this is organized, but most working people in America are already on the same page that everything is shit and they don&#39;t want to participate. </p>\n\n<p>It&#39;s like we&#39;re already participating in a general strike, we just need to organize everyone into unions before people get worn down and are forced to take a poverty wage job.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TrueAskReddit/comments/n7vzg1/with_unemployment_at_an_all_time_high_and/",
  "subreddit": "TrueAskReddit",
  "id": "n7vzg1",
  "is_self": true,
  "media": null,
  "is_video": false
}