{
  "author": "valkener1",
  "the_new_excerpt": "I really don’t get all the stress around here. It’s bitcoin, billions of\ncompanies and financial institutions are invested. It’s up every year. It goes\ndown, it goes up day to day. I worry a lot about investments, except this one. I\ngo to sleep every night just fine, even when I am down so…",
  "original_created_utc": 1622208152,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこの辺りのストレスを本当に理解できません。ビットコインで、何十億もの\n企業や金融機関が投資しています。毎年上昇しています。下がることもあれば\n下がることもあれば、日々上がることもある。私は投資についてたくさん悩みますが、この投資だけは別です。I\n落ち込んでいても、毎晩元気に寝ています。",
      "title": "このあたりのストレスはわからない。明日や来週のことでビクビクするのはやめましょう。リラックスして、足を上げて、何年か待ってみましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我真的不明白这里的所有压力。这就是比特币，数十亿的\n公司和金融机构都在投资。它每年都在上涨。它也会\n下降，每天都在上升。我对投资有很多担心，除了这个。I\n我每天晚上都睡得很好，即使是在我情绪低落的时候也是如此。",
      "title": "我不明白这里的压力。不要再为明天或下周的事情发愁了。放松，把脚踢起来，等上几年。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我真的不明白這裏的所有壓力。這就是比特幣，數十億的\n公司和金融機構都在投資。它每年都在上漲。它也會\n下降，每天都在上升。我對投資有很多擔心，除了這個。I\n我每天晚上都睡得很好，即使是在我情緒低落的時候也是如此。",
      "title": "我不明白這裏的壓力。不要再爲明天或下週的事情發愁了。放鬆，把腳踢起來，等上幾年。"
    }
  ],
  "title": "I don’t get the stress around here. Stop freaking out about tomorrow or next week. Relax, kick your feet up and wait a few years.",
  "created_utc": 1622233840,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I really don’t get all the stress around here.  It’s bitcoin, billions of companies and financial institutions are invested.  It’s up every year.  It goes down, it goes up day to day.  I worry a lot about investments, except this one.  I go to sleep every night just fine, even when I am down so much.</p>\n\n<p>Stop freaking out about tomorrow or next week, when to buy, when to sell...long run it will be ok.  Will it 100x your money?  Probably not. It is what it is, a place to put your stash and wait it out.  The fact everyone is talking about bitcoin in the media is positive, it generates volume, and more big time players that will not let it die.</p>\n\n<p>Relax, kick your feet up and be thankful you have money at all to invest. Stop worrying about day to day, be nice, and enjoy that the pandemic is coming to an end and we can soon all enjoy being free again.  It’s too good of a time to waste it being angry and stressed out.  &lt;3 to all of you, happy to be sharing the journey together.</p>\n</div><!-- SC_ON -->",
  "score": 354,
  "permalink": "/r/CryptoCurrency/comments/nmxqkg/i_dont_get_the_stress_around_here_stop_freaking/",
  "subreddit": "CryptoCurrency",
  "id": "nmxqkg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804296474
}