{
  "author": "ipetgoat1984",
  "original_created_utc": 1643288611,
  "title": "Crypto has ruined all link sharing for me.",
  "created_utc": 1643302189,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so absolutely terrified of scams and phishing that I won&amp;#39;t even click on a link sent from my family or friends. I&amp;#39;m serious. If I see the title in the link, I&amp;#39;ll google it myself. I get so many scam texts and automated calls; it&amp;#39;s insane! I delete everything immediately without opening it or listening to it. It&amp;#39;s crazy that there are so many people out there, seemingly living in this dark crypto world of theft and fraud; I feel like there&amp;#39;s more now than ever.&lt;/p&gt;\n\n&lt;p&gt;The sad thing about it, is that it has diminished my trust in most everyone. As a result, I approach all conversations cautiously, always thinking there&amp;#39;s an angle to mislead. It sucks because I know there are good people out there, who really want to engage genuinely.&lt;/p&gt;\n\n&lt;p&gt;Does anyone else feel this way?&lt;/p&gt;\n\n&lt;p&gt;Edit: I appreciate all of the positive feedback from everyone that can relate. As for the negative &amp;quot;, you need a psychiatrist, go touch grass, take a break&amp;quot; feedback; this sub is a place to foster discussion about the world of crypto, and this is an aspect of that world. I understand that grifters and scammers have been around since the beginning of time, but I think it has become exponentially worse. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 310,
  "permalink": "/r/CryptoCurrency/comments/sdxwnx/crypto_has_ruined_all_link_sharing_for_me/",
  "subreddit": "CryptoCurrency",
  "id": "sdxwnx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm so absolutely terrified of scams and phishing that I won't even click on a\nlink sent from my family or friends. I'm serious. If I see the title in the\nlink, I'll google it myself. I get so many scam texts and automated calls; it's\ninsane! I delete everything immediately without opening it or…"
}