{
  "author": "ipetgoat1984",
  "original_created_utc": 1643288611,
  "title": "Crypto has ruined all link sharing for me.",
  "created_utc": 1643302189,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so absolutely terrified of scams and phishing that I won&amp;#39;t even click on a link sent from my family or friends. I&amp;#39;m serious. If I see the title in the link, I&amp;#39;ll google it myself. I get so many scam texts and automated calls; it&amp;#39;s insane! I delete everything immediately without opening it or listening to it. It&amp;#39;s crazy that there are so many people out there, seemingly living in this dark crypto world of theft and fraud; I feel like there&amp;#39;s more now than ever.&lt;/p&gt;\n\n&lt;p&gt;The sad thing about it, is that it has diminished my trust in most everyone. As a result, I approach all conversations cautiously, always thinking there&amp;#39;s an angle to mislead. It sucks because I know there are good people out there, who really want to engage genuinely.&lt;/p&gt;\n\n&lt;p&gt;Does anyone else feel this way?&lt;/p&gt;\n\n&lt;p&gt;Edit: I appreciate all of the positive feedback from everyone that can relate. As for the negative &amp;quot;, you need a psychiatrist, go touch grass, take a break&amp;quot; feedback; this sub is a place to foster discussion about the world of crypto, and this is an aspect of that world. I understand that grifters and scammers have been around since the beginning of time, but I think it has become exponentially worse. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 310,
  "permalink": "/r/CryptoCurrency/comments/sdxwnx/crypto_has_ruined_all_link_sharing_for_me/",
  "subreddit": "CryptoCurrency",
  "id": "sdxwnx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm so absolutely terrified of scams and phishing that I won't even click on a\nlink sent from my family or friends. I'm serious. If I see the title in the\nlink, I'll google it myself. I get so many scam texts and automated calls; it's\ninsane! I delete everything immediately without opening it or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は詐欺やフィッシングがとても怖くて、クリックすることさえしません。\n家族や友人から送られてくるリンク 私は真剣です。タイトルにあるように\nリンクは、自分でググる。詐欺のメールや自動音声の電話がたくさんかかってくるので、大変です。\n非常識だ! 開かずに即座に全部削除したり...。",
      "title": "Cryptoは、私にとってすべてのリンク共有を台無しにしました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我非常害怕诈骗和网络钓鱼，我甚至不会点击家人或朋友发来的链接。\n从我的家人或朋友那里发出的链接。我是认真的。如果我看到标题中的\n链接，我就会自己用谷歌搜索它。我收到如此多的诈骗短信和自动电话；这真是\n疯了! 我立即删除所有的东西，不打开它或...",
      "title": "Crypto毁了我所有的链接分享。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我非常害怕詐騙和網絡釣魚，我甚至不會點擊家人或朋友發來的鏈接。\n從我的家人或朋友那裏發出的鏈接。我是認真的。如果我看到標題中的\n鏈接，我就會自己用谷歌搜索它。我收到如此多的詐騙短信和自動電話；這真是\n瘋了! 我立即刪除所有的東西，不打開它或...",
      "title": "Crypto毀了我所有的鏈接分享。"
    }
  ]
}