{
  "author": "notcaa",
  "original_created_utc": 1642591010,
  "title": "Were brambles and other plant-life taken into account when constructing defensive fortifications? (for example: ditches and ramparts)",
  "created_utc": 1642614558,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I work as an archaeologist and spend most of the time in the field; I&amp;#39;m currently working in a farmers field which has boundary ditches that are full of brambles. (which are a pain to avoid when crossing through/over)&lt;/p&gt;\n\n&lt;p&gt;This question popped into my head as I doubt defensive ditches etc were continually stripped of plantlife and I can imagine that brambles could be somewhat of a deterrent in the form of a natural (albeit weaker) barbed wire.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/AskHistorians/comments/s7nwgw/were_brambles_and_other_plantlife_taken_into/",
  "subreddit": "AskHistorians",
  "id": "s7nwgw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I work as an archaeologist and spend most of the time in the field; I'm\ncurrently working in a farmers field which has boundary ditches that are full of\nbrambles. (which are a pain to avoid when crossing through/over)\n\nThis question popped into my head as I doubt defensive ditches etc…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は考古学者として働いており、ほとんどの時間を現場で過ごしています。\n現在、ある農家の畑で作業をしていますが、境界溝があり、その溝にはたくさんの\nを、萌え萌えなのです。(を避けるのが大変なんです。）\n\n防御溝などを疑っているうちに、この質問が頭に浮かびました。",
      "title": "防御のための砦を作るとき、ワラジムシなどの植物に配慮したのでしょうか？(例：溝や城壁など）"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一名考古学家，大部分时间都在野外工作。\n我目前在一个农民的田地里工作，那里的边界沟渠充满了荆棘。\n荆棘。(在穿过/越过这些沟渠时，要避开这些荆棘，是件很痛苦的事情）。\n\n这个问题突然出现在我的脑海中，因为我怀疑防御性沟渠等......",
      "title": "在建造防御工事时，是否考虑到了荆棘和其他植物的生命？(例如：沟渠和城墙)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一名考古學家，大部分時間都在野外工作。\n我目前在一個農民的田地裏工作，那裏的邊界溝渠充滿了荊棘。\n荊棘。(在穿過/越過這些溝渠時，要避開這些荊棘，是件很痛苦的事情）。\n\n這個問題突然出現在我的腦海中，因爲我懷疑防禦性溝渠等......",
      "title": "在建造防禦工事時，是否考慮到了荊棘和其他植物的生命？(例如：溝渠和城牆)"
    }
  ]
}