{
  "author": "DontMicrowaveCats",
  "original_created_utc": 1632071822,
  "title": "PSA: Stuart Hoagner (Tether's lawyer) just basically confirmed that Tether is in fact holding Chinese Commercial Paper. Though denying it's Evergrande debt, with default looming and its systemic effects on the China money market, this this is a Lehman Brother's-level \"Gray Rhino\" event in crypto",
  "created_utc": 1632087041,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the last 24 hours, $56 Billion in USDT volume was traded. That is more than Bitcoin, ETH, and the next 3 largest coins combined. It is probably the most unpopular major coins, but it is the glue holding the world of crypto exchanges together.</p>\n\n<p>I&#39;m sure most of you have seen the movie &quot;The Big Short&quot;. For the simplified cliff notes refresher - Leading up to the 2008 financial crisis, huge batches of dog-shit mortgages at high risk of default were being bundled up into various securities and bonds, which were then bought &amp;amp;amp;amp; sold by financial institutions around the world. When the defaults started rolling in....bla bla bla....global financial system collapses. Any financial institution holding the dog shit went down (either ending in bankruptcy or government bailout). Cool, remember that.</p>\n\n<p>So Tether FUD has been a meme since Tether was a thing...for good reason too. Since inception, the stablecoin has been caught up in a seemingly endless stream of shadiness and legal issues. A bunch of the OG Tether execs/funders charged with bank fraud, ties to other fraudulent crypto criminal activities, shady ties to Bitfinex, The NYAG suing Tether/Bitfinex and holding them liable for lying about reserves and hiding, the current DOJ investigation...etc etc</p>\n\n<p>Around 2019, Tether low key changed the claim on its website from &quot;We are backed 1-to-1 with cash&quot;, to &quot;we are backed by cash and cash equivalents&quot;. Of course this was swept under the table quickly in wild wild west cryptoverse.</p>\n\n<p>Since January 2020, Tether&#39;s market cap (and distributions) has exploded from just $4+ Billion to now over $62+ Billion. Supposedly all safely backed by some form of financial reserve.</p>\n\n<p>After the NYAG situation, earlier this year Tether was forced to finally publicly disclose their reserve composition. Although they didn&#39;t reveal much, the Microsoft Word-quality pie chart they posted did confirm that in fact just a fraction of their holdings is actual cash...the vast majority being held in &quot;Commercial Paper.&quot;</p>\n\n<p>What&#39;s commercial paper? It&#39;s short-term (unsecured) debt issued by companies. They&#39;re typically used to raise money for short term funding needs like buying inventory, payroll, or pre-paying construction vendors….kind of like an &quot;IOU&quot; of the corporate world. It usually gets a rating, and is usually pretty safe...so long as the companies issuing it remain solvent.</p>\n\n<p>As of the latest Attestation by their sketch accountant <a href=\"https://tether.to/wp-content/uploads/2021/08/tether_assuranceconsolidated_reserves_report_2021-06-30.pdf\">https://tether.to/wp-content/uploads/2021/08/tether_assuranceconsolidated_reserves_report_2021-06-30.pdf</a>  shows Tether holds just $6.2 Billion in cash, $30.8 Billion in commercial paper, the rest T-Bills &amp;amp;amp;amp; RRPs.</p>\n\n<p>With it now in the open that these coins are actually operating more like unregulated money market funds, over the last several months alone the SEC, CFTC, DOJ, congressional financial committees, and the US Treasury department all set their sights on cracking down on stablecoins.</p>\n\n<p>Furthermore, since Commercial Paper is traded at a discount to Face Value, Tether can buy up dog shit junk bonds for pennys on the dollar, but report it as the full maturity amounts on their balance sheet. Great for their balance sheet…horrible if there’s a run on Tether redemptions. </p>\n\n<p>Anyway, the MoonBois and cryptoverse have made an effort to shrug this all off. They say &quot;STFU FUDbois. Who cares? It&#39;s a fractional reserve system, banks do the same shit with your cash all the time. &quot;</p>\n\n<p>True, but traditional banks are not gambling most of it in dog shit debt (at least hopefully not to the degree they pre-2008). And money market funds clearly disclose what they&#39;re buying. They&#39;re also insured by the FDIC so your funds are actually always &quot;safu&quot; in event of a bank run.</p>\n\n<p>The problem with Tether is that as of now, it still refuses to disclose exactly what commercial paper they actually hold. At its current value Tether would be one of the biggest commercial paper investors in the world. But some top dogs in the US financial markets say theyve never actually heard of them <a href=\"https://www.ft.com/content/342966af-98dc-4b48-b997-38c00804270a\">https://www.ft.com/content/342966af-98dc-4b48-b997-38c00804270a</a></p>\n\n<p>So eyebrows were raised, leading to a lot of recent speculation that most of it is actually Chinese commercial paper. Why is this a big deal?</p>\n\n<p>Chinese property developers have been issuing commercial paper debt like crazy over the past couple of years.  So much so that the Chinese government has started a major crackdown, for fear of a collapse of its entire credit market <a href=\"https://www.reuters.com/business/china-order-developers-disclose-commercial-paper-debt-every-month-sources-2021-07-16/\">https://www.reuters.com/business/china-order-developers-disclose-commercial-paper-debt-every-month-sources-2021-07-16/</a> . One of the biggest culprits was a company called Evergrande - who ran up a $300 Billion debt bill (2% of all Chinese GDP) and is expected to default any day. Trading of their bonds were halted by Chinese exchanges last week.</p>\n\n<p>Coincidentally the timing of this debt run-up coincides with Tether&#39;s massive surge in issuances. So speculation arose that Tether&#39;s commercial paper could actually be Evergrande debt.  With pressure mounting, a few weeks ago Tether finally discloses the supposed ratings of their commercial paper holdings. They announce basically, &quot;Don&#39;t worry, most of our paper is rated A-2 and above&quot;.  They release the latest attestation which shows the breakdown.</p>\n\n<p>Sounds like exoneration right? Remember that scene in the Big Short when Steve Carell&#39;s character is going around the bond rating agencies and found out all of the ratings are essentially a big pay-to-play scam? Pretty much all bonds were rated highly regardless of what&#39;s in them.Well it&#39;s essentially the same in China.<a href=\"https://thediplomat.com/2019/06/understanding-chinas-bond-ratings/\">https://thediplomat.com/2019/06/understanding-chinas-bond-ratings/</a>   Almost all issuances are given ratings of AA or above....making those ratings more or less meaningless to the actual risk.</p>\n\n<p>Case in point, Evergrande&#39;s rating was AA until just a few days ago. Chinese commercial paper appears to be the equivilant of Mortgage Backed Securities circa 2007. It is dog shit debt tied in a shiny bow.</p>\n\n<p>With pressure continuing to mount, and regulators circling them like hawks, in the past week Tether has finally publicly denied that they hold Evergrande debt. Saying “Tether does not hold any commercial paper or other debt or securities issued by Evergrande and has never done so,” <a href=\"https://capital.com/stablecoin-tether-denies-holding-evergrande-paper\">https://capital.com/stablecoin-tether-denies-holding-evergrande-paper</a></p>\n\n<p>So maybe they&#39;re telling the truth and it is not Evergrande debt. HOWEVER, just yesterday their laywer, Stewart Hoegner, put out a tweet in response to further accusations .... <a href=\"https://twitter.com/bitcoinlawyer/status/1439261738067767297\">https://twitter.com/bitcoinlawyer/status/1439261738067767297</a><strong>&quot;If the concern is Evergrande, see our earlier statement. If the concern is Chinese Paper, as such, we have published the ratings on our portfolio....&quot;</strong></p>\n\n<p>Which is a lawyer&#39;s way of saying &quot;We hold Chinese paper, but don&#39;t worry it&#39;s super AA rated.&quot;</p>\n\n<p>So...it might not be Evergrande debt, but at least some or all of it is Chinese, with a high likelyhood of that being junk debt. Evergrande&#39;s looming default poses a systemic threat to the entire Chinese credit market.</p>\n\n<p>If Tether is holding Chinese paper, and the Chinese market seizes up, half of Tether&#39;s reserves go with it (if they haven&#39;t already). This is a &quot;Gray Rhino&quot; event of the crypto world. If USDT reserve value drops, either Tether becomes unbacked, or they will be forced to suck liquidity out of the market (burning coins). In any case, any sort of scare leading to a run on Tether redemptions would be catastrophic.</p>\n\n<p>If Tether goes down, USDC or any other stablecoin will not have nearly enough liquidity to bail it out. This is not FUD, this is a real situation you should pay attention to.</p>\n\n<p>**TL;DR** Tether&#39;s lawyer essentially confirmed its holding Chinese commercial paper for at least some to up to half ($31 Billion) of its reserves. If Evergrande defaults in the next week or so, Chinese commercial paper market is in trouble, and so is Tether</p>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/CryptoCurrency/comments/prc5cu/psa_stuart_hoagner_tethers_lawyer_just_basically/",
  "subreddit": "CryptoCurrency",
  "id": "prc5cu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In the last 24 hours, $56 Billion in USDT volume was traded. That is more than\nBitcoin, ETH, and the next 3 largest coins combined. It is probably the most\nunpopular major coins, but it is the glue holding the world of crypto exchanges\ntogether.\n\nI'm sure most of you have seen the movie \"The Big…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この24時間でUSDTの取引量は560億ドルに達しました。これは、以下よりも多いです。\nビットコイン、ETH、そしてその次の3大コインの合計よりも多い。おそらく、最も\n人気のないメジャーコインですが、暗号化された取引所の世界を支えているのです。\nになっています。\n\nほとんどの方が映画「The Big...」を見たことがあると思います。",
      "title": "PSA: スチュアート・ホーグナー（テザー社の弁護士）は、テザー社が実際に中国のコマーシャルペーパーを保有していることを確認した。Evergrande社の債務であることは否定しているが、デフォルトが迫っており、中国の金融市場にシステム的な影響を与えていることから、これは暗号におけるリーマン・ブラザーレベルの「灰色のサイ」の出来事である。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去24小时内，USDT的交易量为560亿美元。这比\n比特币，ETH，和接下来的三个最大的硬币的总和还要多。它可能是最\n它可能是最不受欢迎的主要币种，但它是支撑加密货币交易所世界的胶水\n的粘合剂。\n\n我相信你们中的大多数人都看过电影《大...",
      "title": "PSA：Stuart Hoagner（Tether的律师）刚刚基本确认Tether确实持有中国商业票据。虽然否认是恒大的债务，但随着违约的迫近及其对中国货币市场的系统性影响，这是一个雷曼兄弟级别的加密货币的 \"灰犀牛 \"事件。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去24小時內，USDT的交易量爲560億美元。這比\n比特幣，ETH，和接下來的三個最大的硬幣的總和還要多。它可能是最\n它可能是最不受歡迎的主要幣種，但它是支撐加密貨幣交易所世界的膠水\n的粘合劑。\n\n我相信你們中的大多數人都看過電影《大...",
      "title": "PSA：Stuart Hoagner（Tether的律師）剛剛基本確認Tether確實持有中國商業票據。雖然否認是恆大的債務，但隨着違約的迫近及其對中國貨幣市場的系統性影響，這是一個雷曼兄弟級別的加密貨幣的 \"灰犀牛 \"事件。"
    }
  ]
}