{
  "author": "wists",
  "original_created_utc": 1631534220,
  "title": "If a coin is up over 100% in a matter of days, don't be discouraged from profit-taking by faceless internet profiles pushing the 'HODL' mindset",
  "created_utc": 1631543817,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s quite irritating that this HODL crap is pushed even in scenarios like this - where a coin is touted as the next best thing and somehow guaranteed to continue increasing in value even though it has already increased by such a large amount in such a short timeframe. </p>\n\n<p>Such impetus is hard to maintain even for the larger coins and consolidation usually doesn&#39;t begin until a significant drop from the run&#39;s highs has occurred. As such, it&#39;s almost always in your best interests to confirm and bank those profits.</p>\n\n<p>You owe none of these faceless profiles on sites like these any kind of backwards form of loyalty - most have no incentive to be honest to you and are likely to have taken profits while still pushing the &#39;HODL&#39; mindset. You&#39;re in this for money, ultimately - so, if you&#39;re fearful/ wanting to take your money and run, do what makes you feel most comfortable.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/pndwke/if_a_coin_is_up_over_100_in_a_matter_of_days_dont/",
  "subreddit": "CryptoCurrency",
  "id": "pndwke",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's quite irritating that this HODL crap is pushed even in scenarios like this\n- where a coin is touted as the next best thing and somehow guaranteed to\ncontinue increasing in value even though it has already increased by such a\nlarge amount in such a short timeframe.\n\nSuch impetus is hard to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このような場面でもHODLの戯言が押し付けられるのは非常に苛立たしいことです。\n- コインが次善の策として宣伝され、すでに価値が上がっているにもかかわらず、何らかの方法で\nこのような場面でも、HODLを押し付けるのは非常に腹立たしいことです。\nこのようなシナリオでも、HODLのくだりが押し出されます。\n\nこのような衝動に駆られることは、なかなかありません...。",
      "title": "コインが数日のうちに100％以上上昇した場合、「HODL」の考え方を押し付ける顔の見えないインターネット上のプロフィールによって利益を得ることを躊躇してはいけません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "令人恼火的是，即使在这样的情况下，这种HODL的废话也被推崇。\n- 在这种情况下，一个硬币被吹捧为下一个最好的东西，并以某种方式保证\n价值继续增加，尽管它已经在如此短的时间内增加了这么多\n在这么短的时间内已经增加了这么大的数量。\n\n这种推动力是很难...",
      "title": "如果一个硬币在几天内涨幅超过100%，不要因为不露面的互联网人物推崇 \"HODL \"的心态而放弃获利回吐。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "令人惱火的是，即使在這樣的情況下，這種HODL的廢話也被推崇。\n- 在這種情況下，一個硬幣被吹捧爲下一個最好的東西，並以某種方式保證\n價值繼續增加，儘管它已經在如此短的時間內增加了這麼多\n在這麼短的時間內已經增加了這麼大的數量。\n\n這種推動力是很難...",
      "title": "如果一個硬幣在幾天內漲幅超過100%，不要因爲不露面的互聯網人物推崇 \"HODL \"的心態而放棄獲利回吐。"
    }
  ]
}