{
  "author": "sambadanne",
  "original_created_utc": 1630375231,
  "title": "Fact: Bitcoin is the NES of crypto",
  "created_utc": 1630395047,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Unopened NES games are far more expensive on the gaming market today compared with brand new and technically superior games. That will continue to be the case 20 years from now.</p>\n\n<p>Same goes with Bitcoin. It won&#39;t be surpassed in market cap, ever, no matter how much the other cryptocurrencies evolve.</p>\n\n<p>Ethereum is like a multiplayer game that has lag issues because the servers are full. Everyone wants to play it, because it is the hottest thing right now.</p>\n\n<p>&quot;Ethereum killers&quot; are games that are lag free, because no one wants to play them.</p>\n\n<p>Shiba Inu is the game with malware that your grandma installed by accident.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/pewf5s/fact_bitcoin_is_the_nes_of_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "pewf5s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Unopened NES games are far more expensive on the gaming market today compared\nwith brand new and technically superior games. That will continue to be the case\n20 years from now.\n\nSame goes with Bitcoin. It won't be surpassed in market cap, ever, no matter how\nmuch the other cryptocurrencies…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "未開封のファミコンソフトは、現在のゲーム市場では新品に比べてはるかに高額です。\n技術的に優れた新品のゲームに比べて、現在のゲーム市場でははるかに高価です。それは、20年後も変わりません。\n20年後もそうでしょう。\n\nビットコインも同じです。他の暗号通貨がどれだけ高騰しても、ビットコインの時価総額が抜かれることはありません。\n他の暗号通貨がどれだけ...",
      "title": "事実：ビットコインは暗号のファミコン"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在今天的游戏市场上，未开封的NES游戏要比全新的、技术含量高的游戏贵得多。\n与全新的、技术含量高的游戏相比。这种情况将继续存在\n20年后的今天。\n\n比特币也是如此。它的市值不会被超越，永远不会，无论其他加密货币如何\n其他加密货币都是如此......",
      "title": "事实：比特币是加密货币中的NES"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在今天的遊戲市場上，未開封的NES遊戲要比全新的、技術含量高的遊戲貴得多。\n與全新的、技術含量高的遊戲相比。這種情況將繼續存在\n20年後的今天。\n\n比特幣也是如此。它的市值不會被超越，永遠不會，無論其他加密貨幣如何\n其他加密貨幣都是如此......",
      "title": "事實：比特幣是加密貨幣中的NES"
    }
  ]
}