{
  "author": "plokij24",
  "the_new_excerpt": "Musk got in trouble for tweets which influenced the price of Tesla shares. He\npushed the boundaries and got in trouble pretty quickly.\n\nIt was never about money, it was literally about memes and taking the piss out\nof the situation.\n\nNow he's moved onto Doge, except this time he can't get into…",
  "original_created_utc": 1612746353,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "马斯克因发推文影响了特斯拉股价而惹上了麻烦。他\n突破了界限，并得到了 在相当快的麻烦。\n\n这从来都不是钱的问题，这是字面上的备忘录和采取小便了。\n的情况。\n\n现在他转战窦娥，只是这次他无法进入......",
      "title": "埃隆-马斯克是个玩游戏的亿万富翁"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "馬斯克因發推文影響了特斯拉股價而惹上了麻煩。他\n突破了界限，並得到了 在相當快的麻煩。\n\n這從來都不是錢的問題，這是字面上的備忘錄和採取小便了。\n的情況。\n\n現在他轉戰竇娥，只是這次他無法進入......",
      "title": "埃隆-馬斯克是個玩遊戲的億萬富翁"
    }
  ],
  "title": "Elon Musk is a billionaire playing games",
  "created_utc": 1612795406,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Musk got in trouble for tweets which influenced the price of Tesla shares. He pushed the boundaries and got in trouble pretty quickly.</p>\n\n<p>It was never about money, it was literally about memes and taking the piss out of the situation.</p>\n\n<p>Now he&#39;s moved onto Doge, except this time he can&#39;t get into trouble due to the nature of crypto. So what happens? He doubles down on his comments. He triples down. There are no limits.</p>\n\n<p>It has never been about money for HIM but it&#39;s about money for YOU. He has no interest in making himself rich and that should be a huge red flag. </p>\n\n<p>Want proof of this? Musk sold almost all of his personal possessions and spoke about it in depth on the Joe Rogan podcast. He doesn&#39;t care about money and it&#39;s soooo obvious.</p>\n\n<p>The amount of times I&#39;ve seen comments like &quot;you don&#39;t think Elon loaded up on Doge?&quot;. No, I don&#39;t think he owns a single Doge. Even if he does he does not care if it tanks 99%.</p>\n\n<p><strong>What will be his next move?</strong> It will be whatever makes him laugh the most NOT what will line his pockets.</p>\n\n<p>Stop comparing him to other billionaires who&#39;s sole purpose in life it to accumulate wealth. MUSK IS NOT LIKE THIS.</p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/lf0e0y/elon_musk_is_a_billionaire_playing_games/",
  "subreddit": "CryptoCurrency",
  "id": "lf0e0y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123195577
}