{
  "author": "Demolecularizing",
  "original_created_utc": 1650493059,
  "title": "Is the CoVID19 mRNA vaccine species specific? What would happen in other species?",
  "created_utc": 1650523679,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been wondering if the mRNA based CoVID19 vaccines (from Pfizer and Moderna) are specific only to humans but I can&amp;#39;t really find anything about it.&lt;/p&gt;\n\n&lt;p&gt;Is the mRNA vaccine specific to only the human species? What would happen if a different species, like a dog or cat, received the vaccine?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/askscience/comments/u882ok/is_the_covid19_mrna_vaccine_species_specific_what/",
  "subreddit": "askscience",
  "id": "u882ok",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been wondering if the mRNA based CoVID19 vaccines (from Pfizer and Moderna)\nare specific only to humans but I can't really find anything about it.\n\nIs the mRNA vaccine specific to only the human species? What would happen if a\ndifferent species, like a dog or cat, received the vaccine?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "mRNAベースのCoVID19ワクチン（ファイザーとモデルナ社製）が、ヒトだけに特異的なのかどうか気になっているのですが、なかなか情報がありません。\nがヒトにのみ特異的なのかどうか気になっていたのですが、それに関する情報はあまり見当たりません。\n\nmRNAワクチンはヒトという種にのみ特異的なのでしょうか？もし\n犬や猫のような異なる種がワクチンを接種した場合はどうなるのでしょうか？",
      "title": "CoVID19 mRNAワクチンは種特異的ですか？他の種ではどうなるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在想，基于mRNA的CoVID19疫苗（来自辉瑞公司和Moderna公司）是否只针对人类？\n是否只对人类有特异性，但我真的找不到这方面的信息。\n\nmRNA疫苗是否只对人类特有？如果是不同的物种，如狗或猫，会发生什么？\n不同的物种，如狗或猫，接受该疫苗会怎样？",
      "title": "CoVID19 mRNA疫苗是否具有物种特性？在其他物种中会发生什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在想，基於mRNA的CoVID19疫苗（來自輝瑞公司和Moderna公司）是否只針對人類？\n是否只對人類有特異性，但我真的找不到這方面的信息。\n\nmRNA疫苗是否只對人類特有？如果是不同的物種，如狗或貓，會發生什麼？\n不同的物種，如狗或貓，接受該疫苗會怎樣？",
      "title": "CoVID19 mRNA疫苗是否具有物種特性？在其他物種中會發生什麼？"
    }
  ]
}