{
  "author": "jsamwg",
  "the_new_excerpt": "Hi everyone,\n\nI've been trying to evaluate on my own whether bitcoin is worth buying and\nholding long term and wanted to present to you some basic findings. This is not\nfinancial advice but my own research analysis and I am open to being corrected\nas I am still new. I see a lot of DD for stocks but…",
  "original_created_utc": 1614806817,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好\n\n我一直在尝试着自己评估比特币是否值得购买，并。\n长期持有，想给大家介绍一些基本的发现。这不是\n理财建议，但我自己的研究分析，我愿意接受纠正。\n因为我还是新手。我看到很多股票的DD，但...",
      "title": "比特币的尽职调查"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好\n\n我一直在嘗試着自己評估比特幣是否值得購買，並。\n長期持有，想給大家介紹一些基本的發現。這不是\n理財建議，但我自己的研究分析，我願意接受糾正。\n因爲我還是新手。我看到很多股票的DD，但...",
      "title": "比特幣的盡職調查"
    }
  ],
  "title": "Due Diligence on Bitcoin",
  "created_utc": 1614819442,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone,</p>\n\n<p>I&#39;ve been trying to evaluate on my own whether bitcoin is worth buying and holding long term and wanted to present to you some basic findings. This is not financial advice but my own research analysis and I am open to being corrected as I am still new. I see a lot of DD for stocks but not as much here so I am hoping we can also get some more quality content here to share knowledge. I am someone who has bought and sold bitcoin at a loss back in 2017-2018, and then again 2020-2021. Yes, I saw all the &quot;HODL&quot; posts, but I was only in it for attempted financial gain. I&#39;ve only recently spent the time to look into bitcoin and become a believer.</p>\n\n<p><strong>Supply</strong>: First, Bitcoin has a fixed supply. Right now there are 900 bitcoins mined per day. Every four years the number of Bitcoins produced per block (created every 10 minutes) are cut in half. Currently the mining reward is 6.25 Bitcoin per block. In 2024 it will drop to 3.125 BTC per block. So we are beginning to see something we learned in our high school Economics class called Scarcity.</p>\n\n<p><a href=\"https://preview.redd.it/xqveh5ei8vk61.png?width=359&amp;format=png&amp;auto=webp&amp;s=eff083c195e1aa24ede9ce998708f1d2c0f53f83\">https://institutional.fidelity.com/app/literature/item/9901337.html?pos=T</a></p>\n\n<p><strong>Demand</strong>: Next is demand. It doesn&#39;t matter if there&#39;s less of a resource no one wants. There is a lot to look at here (i.e. Bitcoin ATM installations increased by +85% in 2020 to 11,798 terminals, outpacing the previous year’s near +50% rise by a significant margin, according to data source Coin ATM Radar). But the big one we are all most excited about is the change in institutional money flowing in. For those that don&#39;t know Metcalfe’s Law, it holds that as the number of its users grows linearly, a network’s value (or, by inference, the bitcoin price) grows geometrically. In other words, there is a cascading effect where more and more institutions begin exponentially buying in <em>worldwide</em>. Right now 30% of all U.S. buyers are institutions. This is a big deal because institutions have more money than you, and that means if they keep buying, our clock window to buy at our current price is now ticking.</p>\n\n<p><a href=\"https://preview.redd.it/wc54qsbk7vk61.png?width=456&amp;format=png&amp;auto=webp&amp;s=b468d4499be43c05390432d4e0bd7a578b79d0b7\">https://ir.citi.com/peFJTnzeEoMSIAEFlwH12VeM5d&#37;2BCckWNrsO9lxpmyWezrz5V&#37;2Bx&#37;2FfRvm0gv6cWRpDHGWtIk7sTME&#37;3D</a></p>\n\n<p><strong>Indicators</strong>: The first decade was marked by speculation and pushback. And Bitcoin prices reflected that. I know for a lot of us, me included, we want indicators to show that prices will go up. But something I&#39;d like to propose for your consideration also: The maturation of an ecosystem tends to result in fresh consolidation. Because we are still in a stage of Fear, Uncertainty, and Doubt (FUD), this is good news for you - it means we are only now beginning to exit the early adaptor stage. It&#39;s not too late to buy. As more and more people have bitcoin, it will begin its slow inevitable march towards mainstream as a dependable store of value. This is why the next chart I want to show you is not just money, but people. More and more people are bitcoin owners. More and more people start talking and googling and investing. Metcalfe’s Law, remember?</p>\n\n<p><a href=\"https://preview.redd.it/ndk2uz1t7vk61.png?width=1117&amp;format=png&amp;auto=webp&amp;s=34386a60c29ff9950d506a7899030441a4220200\">https://www.lookintobitcoin.com/charts/wallets-greater-than-1-btc/</a></p>\n\n<p><strong>Inflation/Depreciation</strong>: When I was a kid I remember reading a book called &quot;Rich Dad Poor Dad&quot; where the premise was to put your money in assets that make more money, not less. Putting your money in things that depreciate (i.e. a car) loses you money over time, while things that appreciate (i.e. a house) make more money. A popular Bitcoin valuation chart is called the Stock-to-Flow (S2F) pricing model. Notice how as Bitcoin becomes more scarce due to halving&#39;s, it exponentially grows. Next, notice how your hard earned U.S. Dollar has depreciated by 99% the past hundred years to gold, which has been traditionally the &quot;gold standard&quot; of storage. Guys, this is seriously starting to look like a no brainer to me.</p>\n\n<p><a href=\"https://preview.redd.it/wl841d6g7vk61.png?width=1136&amp;format=png&amp;auto=webp&amp;s=dc15d4580276ef70ecfc9addb718178907dba102\">https://www.lookintobitcoin.com/charts/stock-to-flow-model/</a></p>\n\n<p><a href=\"https://preview.redd.it/ycii0zfhgvk61.png?width=1492&amp;format=png&amp;auto=webp&amp;s=1747777ca3f275aa3b1fbb27a4ccbe3f54688fda\">https://seekingalpha.com/article/4366155-u-s-dollar-devalues-99-vs-gold-in-100-years-gold-price-crosses-2067</a></p>\n\n<p><strong>Regulation</strong>: This something not completely known to any of us. Despite the price volatility, what if the U.S. Office of the Comptroller of the Currency (OCC) and Securities or Exchange Commission (SEC) tried to in some way limit or outright ban Bitcoin? I take comfort that institutions are adopting and even big retail investors are adding Bitcoin as part of their overall asset portfolio. Regulation is not always bad and can provide us a layer security from a &quot;Mt. Gox&quot; happening to us again. There is a stable coin called Tether that is being investigated and other legitimate FUD concerns. But with Coinbase&#39;s soon IPO, and large positions on the news from the likes of Tesla, there is more safety and certainty. Do understand that your faith is currently paid to you at a premium. Once all FUD and volatility from Bitcoin is removed, it&#39;s skyrocketing price will reflect that.</p>\n\n<p><a href=\"https://preview.redd.it/gfyk4m81mvk61.png?width=644&amp;format=png&amp;auto=webp&amp;s=a957eec2e5367ad36acf68cd26e6d320f9818477\">In December 2020, the SEC announced they would allow “crypto-focused broker-dealers to operate for five years without fear of an enforcement action provided that they can verify if they have possession and control of customers’ digital asset securities https://www.sec.gov/rules/policy/2020/34-90788.pdf</a></p>\n\n<p><strong>Competition</strong>: Cryptocurrency is not just limited to Bitcoin, there are many &quot;altcoins.&quot; But analysts have been pointing to Bitcoin as the &quot;north star&quot; of all other cryptocurrencies and welcome mainstream adaption of cryptocurrencies as a portfolio diversifier. Bitcoin helps illuminate the financial industry’s path. There are new technologies and advancements being made too for the &quot;inefficiencies&quot; of Bitcoin. Efforts to improve Bitcoin’s processing speed are underway such as a new scaling technology called the Lightning Network.</p>\n\n<p><a href=\"https://preview.redd.it/t74wwd7edvk61.png?width=660&amp;format=png&amp;auto=webp&amp;s=86efc9bd3a7aaf40556c7d516779594edc53e884\">https://ir.citi.com/peFJTnzeEoMSIAEFlwH12VeM5d&#37;2BCckWNrsO9lxpmyWezrz5V&#37;2Bx&#37;2FfRvm0gv6cWRpDHGWtIk7sTME&#37;3D</a></p>\n\n<p><strong>Conclusion</strong>: Bitcoin has gone mainstream and is considered a legitimate asset class of digital gold by more and more investors. Bitcoin has a proven supply dynamic (S2F) and demand dynamic (Metcalfe’s Law). With banks printing money to infinity, the question for you is:</p>\n\n<p><em>With all this information, is bitcoin worth a portion of your portfolio?</em></p>\n\n<p>If your answer is &quot;<em>yes</em>&quot; then Dollar Cost Averaging (DCA) of buying and holding bitcoin appears to be a viable investment. I do not think this is an asset class to sell anymore. Notice nowhere in this writeup did I talk about getting rich quick off bitcoin&#39;s prices. I&#39;m a firm believer that &quot;time in the market beats timing the market,&quot; and so I will be buying and holding because I believe in the future of bitcoin.</p>\n\n<p>TLDR - Be a long term HODL and start stacking satoshis for your future&#39;s sake.</p>\n</div><!-- SC_ON -->",
  "score": 3281,
  "permalink": "/r/Bitcoin/comments/lx4svz/due_diligence_on_bitcoin/",
  "subreddit": "Bitcoin",
  "id": "lx4svz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937733627
}