{
  "author": "111ascendedmaster",
  "the_new_excerpt": "People think this doge shenanigan's is going to create regulation. America is a\ncapitalist country. What does that mean for an individual tax payer? Absolutely\nnothing. You loose money on doge and your done. However, if a bank lost money on\ndoge, it would be too big to fail. We know this from 2008…",
  "original_created_utc": 1620617829,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人々は、このドージェのシェナンガンで規制が生まれると思っている。アメリカは資本主義の国です。\n資本主義の国です。個人の納税者にとってはどうなんだろう？まったくもって\n何の意味もありません。ドッグでお金を失ったらおしまいです。しかし、もし銀行がドーゲでお金を失ったら\nしかし、もし銀行がDOGEでお金を失ったら、その銀行は大きすぎて潰せないでしょう。このことは2008年から分かっています。",
      "title": "レギュレーションは見られず、2回目、3回目のブルランに備えています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "人们认为这种狗仔队的诡计会创造监管。美国是一个\n资本主义国家。这对个人纳税人来说意味着什么？绝对的\n毫无意义。你在Doge上输了钱，你就完了。然而，如果一家银行在狗仔队上输了钱\n债务，它就会大到不能倒闭。我们从2008年就知道这一点...",
      "title": "我们不会看到监管，正准备迎接第二次和第三次牛市的到来"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們認爲這種狗仔隊的詭計會創造監管。美國是一個\n資本主義國家。這對個人納稅人來說意味着什麼？絕對的\n毫無意義。你在Doge上輸了錢，你就完了。然而，如果一家銀行在狗仔隊上輸了錢\n債務，它就會大到不能倒閉。我們從2008年就知道這一點...",
      "title": "我們不會看到監管，正準備迎接第二次和第三次牛市的到來"
    }
  ],
  "title": "We won't see regulation and are getting ready for a 2nd and 3rd bull run",
  "created_utc": 1620646934,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>People think this doge shenanigan&#39;s is going to create regulation. America is a capitalist country. What does that mean for an individual tax payer? Absolutely nothing. You loose money on doge and your done. However, if a bank lost money on doge, it would be too big to fail. We know this from 2008 and derivatives that the US is now the bag holder of(they still exist). The government just holds the bags now. The reason why doge will never cause regulation is no bank owner is dumb enough to put any significant amount of money in a hyperinflationary asset with a higher issuance rate than the US dollar. If doge collapses absolutely nothing will happen.  If a bank goes down because of doge, the CEO should get fired and removed for investing in the first place.</p>\n\n<p>Why do I think this bull run is going to continue? I am fairly confident, with the amount of adoption we have seen recently, that there is sufficient evidence to show we will not enter a bear market. Some of this evidence includes <a href=\"https://www.reddit.com/r/CryptoCurrency/\">r/CryptoCurrency</a> pumping to 2.6 million subs, <a href=\"https://www.reddit.com/r/bitcoin/\">r/bitcoin</a> nearing 3 million subs, and <a href=\"https://www.reddit.com/r/dogecoin/\">r/dogecoin</a> nearing 2 million subs. There are people on the side lines just waiting and praying that we see a crash like 2017 so that they can throw in more money. We have reached a tipping point that if we see some huge dip, there is going to be a lot of buyers(including myself) buying more and entering more into the market. This frenzy shows we may not see a slow down, or atleast we will see sustained/maintained growth up through the next bitcoin halving in approximately 1040 days from now.</p>\n\n<p>On top of this, ethereum is already going bull because after ethereum 2.0 and once implemented the issuance rate is going to drop to 1/6th of what it was previously. Then when EIP-1559 is released in July and coin burnings start, I believe we will see the start of the 2nd big bull run which I would expect to continue as Ethereum blows past bitcoin in market value up until the next bitcoin halving. At this point I think people will switch back to bitcoin and bitcoin will explode again and start the 3rd bull run. I don&#39;t believe we will see a bear market before the next halving.</p>\n\n<p>Also, I am not a financial advisor giving you financial advice, this is purely speculation.  </p>\n\n<p>TO THE MOON!</p>\n</div><!-- SC_ON -->",
  "score": 187,
  "permalink": "/r/CryptoCurrency/comments/n8uz9y/we_wont_see_regulation_and_are_getting_ready_for/",
  "subreddit": "CryptoCurrency",
  "id": "n8uz9y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985990911
}