{
  "author": "Content_Structure118",
  "the_new_excerpt": "Yes, Boomers aren't cool.  We are grumpy, not risk takers, and no longer in the\nknow. But please, give me a minute to make you think. We were young folks\nstruggling to make it just like you.\n\nHere are some thoughts:\n\n 1. Keep your day job. (Or get a day job!) Mine fiat by hard work every day to\n   …",
  "original_created_utc": 1621687883,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そう、団塊の世代はクールじゃない。  私たちは不機嫌で、リスクテイカーでもなく、もはや情報通でもありません。\n知っているわけではありません。でも、ちょっと考えてみてください。私たちは若い人たちでした。\nあなたと同じように必死に生きてきたのです。\n\n以下、いくつかの考えを述べます。\n\n 1. 1.本業を続ける。(または、本業を持つ！)毎日のハードワークでフィアットを採掘して\n   ...",
      "title": "団塊の世代から新米投資家へのアドバイス"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，婴儿潮一代并不酷。  我们脾气暴躁，不喜欢冒险，而且不再是在\n知道。但是，请给我一分钟时间，让你思考。我们曾是年轻的人\n就像你们一样在努力奋斗。\n\n这里有一些想法。\n\n 1. 保持你的日常工作。或者找一份白天的工作！）通过每天的努力工作来开采菲亚特。\n   ...",
      "title": "一位潮人给新投资者的提示"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，嬰兒潮一代並不酷。  我們脾氣暴躁，不喜歡冒險，而且不再是在\n知道。但是，請給我一分鐘時間，讓你思考。我們曾是年輕的人\n就像你們一樣在努力奮鬥。\n\n這裏有一些想法。\n\n 1. 保持你的日常工作。或者找一份白天的工作！）通過每天的努力工作來開採菲亞特。\n   ...",
      "title": "一位潮人給新投資者的提示"
    }
  ],
  "title": "Tips from a Boomer for New Investors",
  "created_utc": 1621704975,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yes, Boomers aren&#39;t cool.  We are grumpy, not risk takers, and no longer in the know.  But please, give me a minute to make you think. We were young folks struggling to make it just like you.   </p>\n\n<p>Here are some thoughts:   </p>\n\n<ol>\n<li>Keep your day job. (Or get a day job!) Mine fiat by hard work every day to invest in cryptocurrency if that&#39;s your goal. Work hard and efficiently.  You might want to live below your Means for several years. Maybe you&#39;d rather put that money in Crypto or other investments instead of the latest Smartphone or another Night on the Town.<br/></li>\n</ol>\n\n<p>I think you&#39;ll be happier working, even if it&#39;s just your hobby or love - I don&#39;t care how many people want to stay home and do nothing. You&#39;ll get bored. Or depressed. Or start drinking. I promise, it&#39;s not all roses having no purpose in life.   </p>\n\n<ol>\n<li><p>Even if you do that 5x or 10x, even 50x stay in school or build your dream.  Start a business, do what you love - not what you&#39;re told to love;  go to trade school or college, even the school of hard knocks. Just get educated, wherever, however, you can. Money is not the goal...a better life is.   </p></li>\n<li><p>Your 20&#39;s, 30&#39;s and 40s may take you far from family and loved ones, but work hard to keep connected with them as they will become even more important to you with each passing decade. (Not crypto advice but living advice!)   </p></li>\n<li><p>Investing is risky. Don&#39;t invest what you don&#39;t have. Pay off debt (I learned this the hard way) and your life will be so much more worry free and happier. Buy necessities such as a car or house before that Lambo.  Only risk what you can afford to lose.  </p></li>\n</ol>\n\n<p>5.  Getting Rich Quick is usually a scam. If it were easy,  why doesn&#39;t everyone do it? Stay away from Meme coins. Don&#39;t get angry when older people suggest that meme coins have no long term value. Even Doge&#39;s time will come, it will grow old and be out of people&#39;s minds unless it quickly develops more use cases.</p>\n\n<p>Finally, failure is okay, even in Crypto. Each investment will teach you a lesson. Each time you sell will give you information. </p>\n\n<p>You twenty and thirty somethings have a LIFE CHANGING opportunity with cryptocurrencies. With time,  many of you will make mad money. It might take a bear cycle or 2... remember 1 ETH always = 1 ETH and the value can skyrocket like it did a few weeks ago. </p>\n\n<p>You have time is of the older generation may not! </p>\n\n<p>Edit: Yes, I updated and rewrote earlier post. I love to write and interact with folks on Reddit  because I&#39;m an introvert and my kids live far away.\n Please just ignore if you hate my advice. It&#39;s only advice,  don&#39;t take it if you hate it.</p>\n\n<p>SECOND EDIT: WOW,, you all are hating me?  I see so many people posting about this crash being the end of the world and how bad things are in the United States. I guess I want people to appreciate what we have in the US. We are so lucky to actually have food and money even if it requires hard work. There are so many places in the world that we could live with literally nothing and feed our families on 10 moons A-day. I am grateful to be in American in grateful to live here I hope you guys can be too.</p>\n</div><!-- SC_ON -->",
  "score": 656,
  "permalink": "/r/CryptoCurrency/comments/nihyyj/tips_from_a_boomer_for_new_investors/",
  "subreddit": "CryptoCurrency",
  "id": "nihyyj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197383356
}