{
  "author": "gjvf",
  "the_new_excerpt": "I recently saw a post about some white celebrity styling his hair like a black\nperson and lots of comments about how this is cultural appropriation and should\nbe boycotted etc..\n\nAs an Asian I'd love to see foreigners enjoying my culture, I see it as a win if\nmore people try to learn about our…",
  "original_created_utc": 1620261254,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、白人の有名人が黒人のような髪型をしているという記事を見ました。\nこれは文化的流用であり、ボイコットされるべきだというコメントがたくさんありました。\nボイコットされるべきだというコメントがたくさんありました。\n\n私はアジア人として、外国人が自分の文化を楽しんでいる姿を見たいと思っていますし、より多くの人が私たちの文化を学ぼうとするのは良いことだと思っています。\nより多くの人々が私たちの文化を学ぼうとするのは良いことだと思います。",
      "title": "文化の流用はなぜ悪いことなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近看到一个帖子，说某个白人名人把自己的头发弄得像个黑人一样。\n很多人评论说这是文化盗用，应该抵制等等。\n很多人说这是文化挪用，应该抵制等等。\n\n作为一个亚洲人，我很乐意看到外国人喜欢我的文化，我认为这是一个胜利，如果\n更多的人尝试了解我们的文化。",
      "title": "为什么文化盗用是一件坏事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近看到一個帖子，說某個白人名人把自己的頭髮弄得像個黑人一樣。\n很多人評論說這是文化盜用，應該抵制等等。\n很多人說這是文化挪用，應該抵制等等。\n\n作爲一個亞洲人，我很樂意看到外國人喜歡我的文化，我認爲這是一個勝利，如果\n更多的人嘗試瞭解我們的文化。",
      "title": "爲什麼文化盜用是一件壞事？"
    }
  ],
  "title": "Why is cultural appropriation a bad thing?",
  "created_utc": 1620282738,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently saw a post about some white celebrity styling his hair like a black person and lots of comments about how this is cultural appropriation and should be boycotted etc..</p>\n\n<p>As an Asian I&#39;d love to see foreigners enjoying my culture, I see it as a win if more people try to learn about our culture, wear our clothes, enjoy our food and learn more about us. As long as it&#39;s not done to mock us what&#39;s the problem? </p>\n\n<p>But I also agreed that I&#39;m not clear about the difference between cultural appropriation and cultural exchange (I tried to search about it but internet seems to be very contradictory about the official meaning and how they judge it on social media) Is there something I miss or misunderstand?</p>\n</div><!-- SC_ON -->",
  "score": 116,
  "permalink": "/r/NoStupidQuestions/comments/n5uz61/why_is_cultural_appropriation_a_bad_thing/",
  "subreddit": "NoStupidQuestions",
  "id": "n5uz61",
  "is_self": true,
  "media": null,
  "is_video": false
}