{
  "author": "Jumpman707",
  "original_created_utc": 1647745064,
  "title": "Moving forward there’s nothing else for me except just ETH and BTC.",
  "created_utc": 1647765174,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I took a 4 month break from crypto and when I returned almost all are down except for ETH and BTC. It’s also that during that time I realized there are other better things I can do than to follow each movement of my alts daily.&lt;/p&gt;\n\n&lt;p&gt;So moving forward it’s just alternate DCA for these two. I won’t be selling my altcoins either as it’s not wise for me to sell them at these losses and I don’t really need the fiat. &lt;/p&gt;\n\n&lt;p&gt;PS. I’m not saying altcoins are a bad investment for everyone else. Just don’t lose yourself and too much time in it chasing that 100x.&lt;/p&gt;\n\n&lt;p&gt;Cheers to those who are still here.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 329,
  "permalink": "/r/CryptoCurrency/comments/tibmuv/moving_forward_theres_nothing_else_for_me_except/",
  "subreddit": "CryptoCurrency",
  "id": "tibmuv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I took a 4 month break from crypto and when I returned almost all are down\nexcept for ETH and BTC. It’s also that during that time I realized there are\nother better things I can do than to follow each movement of my alts daily.\n\nSo moving forward it’s just alternate DCA for these two. I won’t be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は4ヶ月間暗号から離れ、戻ってきたときにはほとんどすべてがダウンしていました。\nETHとBTCを除く。また、その間に、私は次のようなことがあると気づいたのです。\n毎日アルトの動きを追うよりも、もっと良いことがあるはずです。\n\nというわけで、今後はこの2つのDCAを交互に行うだけです。私はそうしません...",
      "title": "今後は、ETHとBTC以外にはないですね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从加密货币中休息了4个月，当我回来时，几乎所有的加密货币都在下跌。\n除了ETH和BTC。这也是因为在那段时间里，我意识到有其他更好的事情可以做。\n还有其他更好的事情可以做，而不是每天关注我的代理币的每一个动向。\n\n因此，在未来，它只是这两个的交替DCA。我不会...",
      "title": "展望未来，除了ETH和BTC之外，我没有别的选择。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從加密貨幣中休息了4個月，當我回來時，幾乎所有的加密貨幣都在下跌。\n除了ETH和BTC。這也是因爲在那段時間裏，我意識到有其他更好的事情可以做。\n還有其他更好的事情可以做，而不是每天關注我的代理幣的每一個動向。\n\n因此，在未來，它只是這兩個的交替DCA。我不會...",
      "title": "展望未來，除了ETH和BTC之外，我沒有別的選擇。"
    }
  ]
}