{
  "author": "ithrowcox",
  "original_created_utc": 1651935166,
  "title": "If allergies can come from repeated exposures, why are we not allergic to everything?",
  "created_utc": 1651977786,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Correct any assumptions I may have made, but I have read about how allergies can come from repeated exposures to something. For example, I&amp;#39;ve read the story about how cockroach researchers eventually become allergic to them, and in turn have an allergy to instant coffee.&lt;/p&gt;\n\n&lt;p&gt;How come we aren&amp;#39;t allergic to things we experience everyday in our lives? I eat wheat almost everyday, will I eventually get to the point where I die if I walk past a bakery? Will all pet owners become allergic to their pets? Will youngsters all develop an allergy to AXE bodyspray? Will someone eventually become allergic to a medication that they take chronically?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 138,
  "permalink": "/r/askscience/comments/ukey9p/if_allergies_can_come_from_repeated_exposures_why/",
  "subreddit": "askscience",
  "id": "ukey9p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Correct any assumptions I may have made, but I have read about how allergies can\ncome from repeated exposures to something. For example, I've read the story\nabout how cockroach researchers eventually become allergic to them, and in turn\nhave an allergy to instant coffee.\n\nHow come we aren't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の思い込みかもしれませんが、アレルギーがどのように起こるかについて読んだことがあります。\n繰り返し何かに触れることで、アレルギーになる可能性があることを読みました。例えば、ゴキブリの研究者が最終的にアレルギーになるという話を読んだことがあります。\nゴキブリの研究者が、やがてゴキブリアレルギーになり、その結果、インスタントコーヒ\nインスタントコーヒーにもアレルギーを持つようになる。\n\nどうして私たちはそうならないのでしょう...",
      "title": "もし、アレルギーが繰り返しの暴露によって生じるのであれば、なぜ私たちはすべてのものにアレルギーを持たないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "纠正我可能做出的任何假设，但我读过关于过敏如何能\n是来自于对某些东西的反复接触。例如，我读过这样一个故事\n蟑螂的研究者最终对它们产生了过敏，并反过来对速溶咖啡过敏。\n对速溶咖啡过敏。\n\n我们怎么会不...",
      "title": "如果过敏可能来自于反复接触，为什么我们不会对所有东西都过敏？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "糾正我可能做出的任何假設，但我讀過關於過敏如何能\n是來自於對某些東西的反覆接觸。例如，我讀過這樣一個故事\n蟑螂的研究者最終對它們產生了過敏，並反過來對速溶咖啡過敏。\n對速溶咖啡過敏。\n\n我們怎麼會不...",
      "title": "如果過敏可能來自於反覆接觸，爲什麼我們不會對所有東西都過敏？"
    }
  ]
}