{
  "author": "Supercharmeleon",
  "original_created_utc": 1653560977,
  "title": "I wonder how many survivors of the last bear run are on this sub.",
  "created_utc": 1653598174,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;And by survivors I mean people who held through the entirety of the last bear run and were rewarded for it once the bull came with amazing gains.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m mostly wondering because I&amp;#39;d like to know if those telling us to be strong and hold until the next bull comes  actually went through any bears or if theyre just repeating what everyone else says because it&amp;#39;s conventional wisdom.&lt;/p&gt;\n\n&lt;p&gt;Also because I figure if I reach the next bull and I&amp;#39;m rewarded for it then I might not spend much more time on this sub, but that&amp;#39;s just me.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d be curious to hear from any actual survivors.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 338,
  "permalink": "/r/CryptoCurrency/comments/uy4jtn/i_wonder_how_many_survivors_of_the_last_bear_run/",
  "subreddit": "CryptoCurrency",
  "id": "uy4jtn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "And by survivors I mean people who held through the entirety of the last bear\nrun and were rewarded for it once the bull came with amazing gains.\n\nI'm mostly wondering because I'd like to know if those telling us to be strong\nand hold until the next bull comes actually went through any bears or if…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サバイバーとは、最後の熊のようにずっと持ちこたえた人たちのことです。\nを持ち続け、強気相場が来たときに素晴らしい利益で報われた人たちのことです。\n\n私が不思議に思っているのは、「強くなれ」と言う人たちが、そのようなことを言うのかどうか知りたいからです。\n次の強気まで持ちこたえろと言っている人たちが実際に弱気を経験したのか、それとも...。",
      "title": "前回のベアランの生き残りが、このサブに何人いるのだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我所说的幸存者是指那些在上一次熊市中一直持有的人，他们在牛市中获得了回报。\n并在牛市到来时获得了惊人的收益。\n\n我之所以想知道，是因为我想知道那些告诉我们要坚强的\n并坚持到下一个牛市到来的人是否真的经历过任何熊市，或者是否......",
      "title": "我想知道这艘潜艇上有多少上次熊出没的幸存者。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我所說的倖存者是指那些在上一次熊市中一直持有的人，他們在牛市中獲得了回報。\n並在牛市到來時獲得了驚人的收益。\n\n我之所以想知道，是因爲我想知道那些告訴我們要堅強的\n並堅持到下一個牛市到來的人是否真的經歷過任何熊市，或者是否......",
      "title": "我想知道這艘潛艇上有多少上次熊出沒的倖存者。"
    }
  ]
}