{
  "author": "squid4680",
  "original_created_utc": 1646230839,
  "title": "I am the guy whose flights have predicted the price of Bitcoin three times, I will be flying on Saturday",
  "created_utc": 1646263995,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know if you remember me but I posted about two months ago about how my flights have correlated with a sudden severe drop in the price in Bitcoin. I wanted to let the community know this time beforehand that I will be flying on Saturday to evacuate my current country and reunite with my girlfriend. The price drops always happened on my first flight and the first flight should be about noon central standard time.&lt;/p&gt;\n\n&lt;p&gt;I also want to include in this post that I am a young American who has been living in Eastern Europe for well over two years now. I have many friends in Ukraine and I was a business consultant at Skolkovo while I was a student in Moscow. I may have some interesting perspectives on the situation and how it relates to the price changes in the price of Bitcoin if you want to ask.&lt;/p&gt;\n\n&lt;p&gt;Previous post: &lt;a href=\"https://www.reddit.com/r/CryptoCurrency/comments/rr5745/my_flights_have_predicted_the_price_of_bitcoin/\"&gt;https://np.reddit.com/r/CryptoCurrency/comments/rr5745/my_flights_have_predicted_the_price_of_bitcoin/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 310,
  "permalink": "/r/CryptoCurrency/comments/t515jk/i_am_the_guy_whose_flights_have_predicted_the/",
  "subreddit": "CryptoCurrency",
  "id": "t515jk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don't know if you remember me but I posted about two months ago about how my\nflights have correlated with a sudden severe drop in the price in Bitcoin. I\nwanted to let the community know this time beforehand that I will be flying on\nSaturday to evacuate my current country and reunite with my…"
}