{
  "author": "_fat_santa",
  "the_new_excerpt": "Hey everyone. I want to share a little side project I've been working on called\nAwesome Devtools. The site is a collection of tools and resources for web\ndevelopers from around the internet. You can check out the code and the site\nbelow. Consider contributing if you have an awesome devtool to…",
  "original_created_utc": 1622645002,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。今回は、私が取り組んでいるちょっとしたサイドプロジェクト「Awesome Devtools」をご紹介します。\nAwesome Devtoolsです。このサイトは、世界中のウェブ開発者のためのツールやリソースを集めたものです。\nツールやリソースを集めたサイトです。コードとサイトは以下で確認できます。\nをご覧ください。もし、あなたが素晴らしい開発ツールをお持ちでしたら、ぜひご投稿ください。",
      "title": "Awesome Devtoolsを作りました。ウェブ開発者のためのツールとリソースのコレクション"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。我想和大家分享我一直在做的一个小项目，叫做\nAwesome Devtools。该网站收集了互联网上的工具和资源，供网络开发者使用。\n开发者的工具和资源。你可以看看下面的代码和网站\n下面。如果你有一个很棒的开发工具，请考虑贡献出来。",
      "title": "我做了 \"真棒 \"开发工具。一个为网络开发者提供的工具和资源的集合"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。我想和大家分享我一直在做的一個小項目，叫做\nAwesome Devtools。該網站收集了互聯網上的工具和資源，供網絡開發者使用。\n開發者的工具和資源。你可以看看下面的代碼和網站\n下面。如果你有一個很棒的開發工具，請考慮貢獻出來。",
      "title": "我做了 \"真棒 \"開發工具。一個爲網絡開發者提供的工具和資源的集合"
    }
  ],
  "title": "I made Awesome Devtools. A collection of tools and resources for web developers",
  "created_utc": 1622661936,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey everyone. I want to share a little side project I&#39;ve been working on called Awesome Devtools. The site is a collection of tools and resources for web developers from around the internet. You can check out the code and the site below. Consider contributing if you have an awesome devtool to add!</p>\n\n<p>Site: <a href=\"https://awesomedevtools.com\">https://awesomedevtools.com</a></p>\n\n<p>GitHub: <a href=\"https://github.com/sgolovine/awesome-devtools\">https://github.com/sgolovine/awesome-devtools</a></p>\n</div><!-- SC_ON -->",
  "score": 16,
  "permalink": "/r/SideProject/comments/nqne3x/i_made_awesome_devtools_a_collection_of_tools_and/",
  "subreddit": "SideProject",
  "id": "nqne3x",
  "is_self": true,
  "media": null,
  "is_video": false
}