{
  "author": "ubiquitous_raven",
  "the_new_excerpt": "For the past year, every day I visit this subreddit, I've noticed that the most\ndiscussed/upvoted posts are either talking about the market, its ups and downs,\nand, (this I see a lot)- pandering to the 'newbies'.\n\nOf the top 100 posts this month, there are hardly 5 which move away from…",
  "original_created_utc": 1620509684,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この1年、毎日このサブレディットを訪れるたびに、最も議論されたり、投票されたりする記事は、市場やその上昇、下降に関するものであることに気づきました。\n議論されたり、投票されたりするのは、市場やその浮き沈みについての話か\nそして、（私がよく目にするのは）「初心者」への迎合です。\n\n今月の上位100件の投稿の中で、相場から離れた投稿はほとんどありません。",
      "title": "このサブレディットでは、技術についての議論はほとんどなく、市場についての話題しかない状態になっています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的一年里，我每天都会访问这个子版块，我注意到，讨论/投票最多的帖子要么是关于市场的，要么是关于市场的涨跌，要么是关于市场的。\n讨论/投票的帖子要么是在谈论市场，它的涨跌。\n以及，（我经常看到这个）--迎合 \"新手\"。\n\n在这个月的前100个帖子中，几乎没有5个帖子脱离了 \"市场\"。",
      "title": "在这个分论坛上，我们正处于一个几乎没有关于技术的讨论，只有关于市场的讨论的阶段。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的一年裏，我每天都會訪問這個子版塊，我注意到，討論/投票最多的帖子要麼是關於市場的，要麼是關於市場的漲跌，要麼是關於市場的。\n討論/投票的帖子要麼是在談論市場，它的漲跌。\n以及，（我經常看到這個）--迎合 \"新手\"。\n\n在這個月的前100個帖子中，幾乎沒有5個帖子脫離了 \"市場\"。",
      "title": "在這個分論壇上，我們正處於一個幾乎沒有關於技術的討論，只有關於市場的討論的階段。"
    }
  ],
  "title": "We're at a point in this subreddit where there's almost no discussion on the tech and only talk of the market",
  "created_utc": 1620523265,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For the past year, every day I visit this subreddit, I&#39;ve noticed that the most discussed/upvoted posts are either talking about the market, its ups and downs, and, (this I see a lot)- pandering to the &#39;newbies&#39;.</p>\n\n<p>Of the top 100 posts this month, there are hardly 5 which move away from the money/finance aspect of crypto, mentioning things like - learn from these list of courses, what staking is etc. Most of the other content is around the former.</p>\n\n<p>We keep telling people to DYOR, which is legit advice, but a lot of folk found what to DYOR on from here - what&#39;s consensus, what&#39;s the 2 generals problem, what is a distributed ledger, DAGs, Staking, etc. It&#39;s a bit saddening to see that kind of content go down.</p>\n\n<p>Even in 2017 and before, during the bull run, before the crash, there was a lot of content from people who &#39;were in it for the tech&#39; and discussion around tech topics. There obviously weren&#39;t enough of them which is why we used to suggest going to <a href=\"/r/cryptotechnology\">r/cryptotechnology</a> for the serious stuff, but still they were more frequent then. This has been largely replaced by folk telling others about how to manage their money.</p>\n\n<p>Tbh, I&#39;m not some highbrow chap who thinks &#39;this sub has gone to the doge&#39;. I&#39;m not criticising the content - the money has truly changed people&#39;s lives for the better, especially in countries without stable currencies.</p>\n\n<p>I&#39;m mostly just fascinated by how the subreddit has shifted over time. It&#39;s a look into how the growing subscribers of the subreddit, the change in its structure and how the general moderation process has brought a shift in the content here.</p>\n\n<p>Cheers to my fellow Redditors here. Whatever you have come here for, glad to have you around.</p>\n</div><!-- SC_ON -->",
  "score": 2286,
  "permalink": "/r/CryptoCurrency/comments/n7z216/were_at_a_point_in_this_subreddit_where_theres/",
  "subreddit": "CryptoCurrency",
  "id": "n7z216",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985990897
}