{
  "author": "gemandrailfan94",
  "original_created_utc": 1642043770,
  "title": "Am I the only person who wishes they’d died when they were a kid?",
  "created_utc": 1642080377,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I’m not suicidal, I don’t want to die because I don’t know what happens afterwards.&lt;/p&gt;\n\n&lt;p&gt;However, I sometimes wish I had died when I was a small kid and didn’t have any concept of death and would therefore not fear it.&lt;/p&gt;\n\n&lt;p&gt;The first six years of my life were pretty good, but the last 21 years have been a joke. I’m 27 with no hope, no future, and no prospects. If I were to die now, most of the people I know/am related to would remember me as the mistake no one wanted. If I had died when I was about 6 or 7, I’d be remembered as the cute kid that everyone liked until he turned 10 and was then tossed aside.&lt;/p&gt;\n\n&lt;p&gt;Also, my biological mother died when I wasn’t even 2 yet, and when I was little, my father would often tell me that I’d see her in Heaven one day. I don’t know if he’s right or not, but if he is, me spending eternity with my actual mother is the most blissful and beautiful thing I can think of! Her holding me in her arms forever would be a dream come true?&lt;/p&gt;\n\n&lt;p&gt;Once again, Im not suicidal, Im just not interested in being dead or alive at this point. Anyone else feel this way?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/s2p06a/am_i_the_only_person_who_wishes_theyd_died_when/",
  "subreddit": "TooAfraidToAsk",
  "id": "s2p06a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So I’m not suicidal, I don’t want to die because I don’t know what happens\nafterwards.\n\nHowever, I sometimes wish I had died when I was a small kid and didn’t have any\nconcept of death and would therefore not fear it.\n\nThe first six years of my life were pretty good, but the last 21 years have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、自殺願望はない。何が起こるかわからないから、死にたくない。\nの後。\n\nでも、小さい頃に死んでおけばよかったと思うことがあります。\n死に対する概念がないため、死を恐れることがないのです。\n\n人生の最初の6年間はかなり良かったが、この21年間は・・・。",
      "title": "子供の頃に死んでおけばよかったと思うのは俺だけか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我没有自杀倾向，我不想死，因为我不知道以后会发生什么。\n之后的事。\n\n然而，我有时希望我在小的时候就死了，那时我还没有任何\n对死亡没有任何概念，因此不会害怕死亡。\n\n我生命中的前六年还算不错，但在过去的21年里，...",
      "title": "我是唯一一个希望自己在小时候就死掉的人吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我沒有自殺傾向，我不想死，因爲我不知道以後會發生什麼。\n之後的事。\n\n然而，我有時希望我在小的時候就死了，那時我還沒有任何\n對死亡沒有任何概念，因此不會害怕死亡。\n\n我生命中的前六年還算不錯，但在過去的21年裏，...",
      "title": "我是唯一一個希望自己在小時候就死掉的人嗎？"
    }
  ]
}