{
  "author": "xSciFix",
  "original_created_utc": 1640194037,
  "title": "Technical Analysis is bullshit.",
  "created_utc": 1640208691,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Technical Analysis is garbage sold by charlatans who would themselves be rich if what they were pushing really did work.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Why believe in this?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;- Some people think price and market movements aren&amp;#39;t random.&lt;/p&gt;\n\n&lt;p&gt;- It&amp;#39;s easy. Draw some lines, figure your supports out, you&amp;#39;ll be quitting your full-time job by this time next year. It&amp;#39;s the kind of thing you can learn in a few hours. If it was this easy to beat the market, we&amp;#39;d all be doing it.&lt;/p&gt;\n\n&lt;p&gt;- Pattern recognition. We&amp;#39;re humans, this is what we do. Doesn&amp;#39;t mean the patterns we see are real, though.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;You don&amp;#39;t realize what you&amp;#39;re talking about when comparing your chart lines to what big firms do:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;A single proprietary trading firm can have enough computers to fill your house ten times and then some. Each of these computers can easily be $50,000 or more. These firms have zero problem hiring the best programmers in the world for $500 per hour or more to program some of the most complicated programs that ever existed.&lt;/p&gt;\n\n&lt;p&gt;These guys have no problem investing millions to cut their ping from 2s to 1.99s. They have no problems paying an additional $10,000,000 per month rent just to have a office that is half a mile closing to Wall Street just so their orders will pass through a milli-second faster. These people have no problems offering a $500,000 signing bonus to grab the best financial engineering grads and then offering millions of dollars in bonuses every year, even if the trader doesn’t perform all that well.&lt;/p&gt;\n\n&lt;p&gt;These people can test BILLIONS of possible technical analysis indicators and combinations on about every single product that exists a million times by the time you notice your little “A heads and shoulder pattern is forming!” These people can send a million trades by the time your finger hits the “buy” button. &lt;em&gt;These people can backtest millions of strategies in real time by the time you blink your eyes. And despite all that, the vast majority of these funds do not beat the market on a risk-adjusted basis over an extended period of time.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;If you think your moving average whatever can compete with that then go get hired at these firms and teach them what&amp;#39;s up.&lt;/p&gt;\n\n&lt;p&gt;Why are there technical analysts working for brokerage firms, then? Because they recommend a lot of trades and trades generate commissions. They make money from the commission taken from retail, not the trading profits. They get theirs whether up or down.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Here&amp;#39;s the thing:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Technical analysis has no scientific value.&lt;/p&gt;\n\n&lt;p&gt;If you go to a big fund or trading firm and try to pitch them your MACD strategy, they&amp;#39;ll laugh. Goldman doesn&amp;#39;t have a TA group. Citadel doesn&amp;#39;t have a TA group. If TA worked, they would.&lt;/p&gt;\n\n&lt;p&gt;With a little creativity you can fit anything you want to any patterns you want. A Fibonacci retracement, projection for example: The precision that the decimals imply is just another layer of the illusion. Instead of saying that sometimes prices move back by around a third, TA people would have you believe that the prices should move exactly 38.1966%.  I wonder if you’re supposed to use this on price series or total return series? How exactly should you adjust futures prices for term structure to be able to take advantage of this precision? Does it work both on spot and on future, and given the term structure, is that even possible? These questions are never answered, since these numerology approaches are used by people who don’t understand the real life problems implied&lt;/p&gt;\n\n&lt;p&gt;How about a magical set of wave patterns which also govern everything in the universe?  If you can look at a chart and figure out which wave we are in you can use the magical numbers described above to predict exactly where the prices will turn. And when you turn out to be incorrect, you can always revert to your secondary wave count. Or tertiary. Have fun.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Facts, based on statistics gathered over decades:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;- Chartists see patterns in randomness (Malkiel, Burton. &lt;em&gt;A Random Walk Down Wall Street: The Time-Tested Strategy for Successful Investing&lt;/em&gt;. 2007)&lt;/p&gt;\n\n&lt;p&gt;-  Turning points cannot be predicted (Sherdan, Williams. &lt;em&gt;Fortune Sellers: The Big Business of Buying and Selling Predictions.&lt;/em&gt; 1997)&lt;/p&gt;\n\n&lt;p&gt;- Increased sophistication does not improve accuracy (Sherdan, Williams. &lt;em&gt;Fortune Sellers: The Big Business of Buying and Selling Predictions.&lt;/em&gt; 1997)&lt;/p&gt;\n\n&lt;p&gt;-  Past prices are extremely poor indicators of future prices (Sherdan, 1997).&lt;/p&gt;\n\n&lt;p&gt;- Economists’ predictions are no better than guesses (Sherdan, 1997).&lt;/p&gt;\n\n&lt;p&gt;- Consensus forecasts do not improve accuracy (Sherdan, 1997).&lt;/p&gt;\n\n&lt;p&gt;-  Technical analysts see ‘illusory correlations’ which do not indicate future price performance &lt;a href=\"http://rof.oxfordjournals.org/content/17/2/625.abstract\"&gt;(Bender et al. 2013, pp 625–652)&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot; We conduct an extensive examination of the profitability of technical analysis in ten emerging foreign exchange markets. Studying 25,988 trading strategies for emerging foreign exchange markets, we find that the best rules can sometimes generate an annual mean excess return of more than 30%. Based on standard tests, we find hundreds to thousands of seemingly significant profitable strategies. However, almost all of these profits vanish once the data snooping bias is taken into account. &lt;em&gt;Overall, we show that the profitability of technical analysis is illusory.&lt;/em&gt;&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0169207013000964\"&gt;https://www.sciencedirect.com/science/article/abs/pii/S0169207013000964&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I could go on. There is a mountain of evidence that TA is incorrect, and zero evidence to the contrary.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.sciencedirect.com/science/article/abs/pii/S1049007809000682\"&gt;https://www.sciencedirect.com/science/article/abs/pii/S1049007809000682&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.worldscientific.com/doi/abs/10.1142/s0219091511002238\"&gt;https://www.worldscientific.com/doi/abs/10.1142/s0219091511002238&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://orbi.uliege.be/handle/2268/148439\"&gt;https://orbi.uliege.be/handle/2268/148439&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Conclusion:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Every analyst who actively promotes Technical Analysis as a way to earn a return higher than the market on a risk-adjusted basis is wrong. TA has never worked and never will. If you seriously think you can look at a chart and guess in which direction the product is moving with any degree of certainty higher than the average, you are wrong.&lt;/p&gt;\n\n&lt;p&gt;If you think I&amp;#39;m an idiot, fine. But please don&amp;#39;t spend your money on &amp;#39;education programs&amp;#39; promising riches or shills trying to teach you the secrets of the market.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 379,
  "permalink": "/r/CryptoCurrency/comments/rma3kp/technical_analysis_is_bullshit/",
  "subreddit": "CryptoCurrency",
  "id": "rma3kp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Technical Analysis is garbage sold by charlatans who would themselves be rich if\nwhat they were pushing really did work.\n\nWhy believe in this?\n\n- Some people think price and market movements aren't random.\n\n- It's easy. Draw some lines, figure your supports out, you'll be quitting your\nfull-time…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "テクニカル分析というのは、もし自分がお金持ちになれるのであれば、チャラ男が売っているゴミです。\n本当に効果があるのだろうか？\n\nなぜこれを信じるのか？\n\n- 価格や市場の動きはランダムではないと考える人がいます。\n\n- 簡単なことです。線を引いて、支持を把握する。\nフルタイムで...",
      "title": "テクニカル分析はデタラメだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "技术分析是江湖骗子卖的垃圾，如果他们推崇的东西真的有效，他们自己也会很有钱。\n如果他们所推崇的东西真的有效，他们自己也会发财。\n\n为什么相信这些？\n\n- 有些人认为价格和市场运动不是随机的。\n\n- 这很简单。画一些线，算出你的支撑点，你就会辞去你的\n全职...",
      "title": "技术分析是胡说八道。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "技術分析是江湖騙子賣的垃圾，如果他們推崇的東西真的有效，他們自己也會很有錢。\n如果他們所推崇的東西真的有效，他們自己也會發財。\n\n爲什麼相信這些？\n\n- 有些人認爲價格和市場運動不是隨機的。\n\n- 這很簡單。畫一些線，算出你的支撐點，你就會辭去你的\n全職...",
      "title": "技術分析是胡說八道。"
    }
  ]
}