{
  "author": "RefugeeDutch_Syrian",
  "original_created_utc": 1639171048,
  "title": "It is funny how the current financial system allows Evergrande to borrow hundreds of billions it cant pay back but banks say crypto is the problem?",
  "created_utc": 1639193532,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It absolutely blows my mind how hypocrite banks keep lending money to an unprofitable company that is on the verge of collapsing, that printed money out of thin air and which collapse is estimated to hurt all financial markets but crypto is the problem. &lt;/p&gt;\n\n&lt;p&gt;Because crypto is used by criminals and banks are absolute angels that have never been associated with any money laundering! It infuriates me how they think people are gullible idiots who have no clue about what is going on. &lt;/p&gt;\n\n&lt;p&gt;As if banks weren&amp;#39;t involved in the Panama papers and ton of others scandals.  What do you guys think of this absolutely ridiculous situation?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 183,
  "permalink": "/r/CryptoCurrency/comments/rdiwc3/it_is_funny_how_the_current_financial_system/",
  "subreddit": "CryptoCurrency",
  "id": "rdiwc3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It absolutely blows my mind how hypocrite banks keep lending money to an\nunprofitable company that is on the verge of collapsing, that printed money out\nof thin air and which collapse is estimated to hurt all financial markets but\ncrypto is the problem.\n\nBecause crypto is used by criminals and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "偽善者の銀行が、このような会社にお金を貸し続けるなんて、本当に驚きです。\n破綻寸前の不採算会社で、お金を刷りまくった会社。\nその崩壊はすべての金融市場に打撃を与えると推測されるが、しかし\n暗号が問題なのです。\n\nなぜなら暗号は犯罪者に利用され...",
      "title": "現在の金融システムでは、Evergrandeが何千億もの借金をして返せないのに、銀行が暗号が問題だと言うのはおかしいですよね？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这绝对让我吃惊，伪君子的银行怎么会一直把钱借给一个无利可图的公司？\n这家无利可图的公司正处于崩溃的边缘，它凭空印制了钱。\n它凭空印钱，其崩溃估计会损害所有金融市场，但\n而加密货币才是问题所在。\n\n因为加密货币被犯罪分子和...",
      "title": "有趣的是，目前的金融体系允许恒大借入数千亿的资金，但银行却说加密货币是问题。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這絕對讓我喫驚，僞君子的銀行怎麼會一直把錢借給一個無利可圖的公司？\n這家無利可圖的公司正處於崩潰的邊緣，它憑空印製了錢。\n它憑空印錢，其崩潰估計會損害所有金融市場，但\n而加密貨幣纔是問題所在。\n\n因爲加密貨幣被犯罪分子和...",
      "title": "有趣的是，目前的金融體系允許恆大借入數千億的資金，但銀行卻說加密貨幣是問題。"
    }
  ]
}