{
  "author": "AmusedSeagull",
  "the_new_excerpt": "After seeing TSLA land on Mars today when it crossed the $800 mark, I got a\nlittle worried. I had a weird feeling in my gut. I knew the next stop would be\nJupiter, I just... couldn’t help but feel like ”we had arrived”.\n\nSo after thinking about it long and hard, going back and forth, I decided…",
  "original_created_utc": 1610058087,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在看到TSLA今天登陆火星时，它突破了800美元大关，我得到了一个\n有点担心。我的内心有一种奇怪的感觉。我知道下一站会是\n朱庇特，我只是.情不自禁地觉得“我们到了”。\n\n因此，在经过长时间和艰苦的考虑，来回考虑之后，我决定…",
      "title": "抱歉，我出去了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在看到TSLA今天登陸火星時，它突破了800美元大關，我得到了一個\n有點擔心。我的內心有一種奇怪的感覺。我知道下一站會是\n朱庇特，我只是.情不自禁地覺得“我們到了”。\n\n因此，在經過長時間和艱苦的考慮，來回考慮之後，我決定…",
      "title": "抱歉，我出去了。"
    }
  ],
  "title": "Sorry, I’m out.",
  "created_utc": 1610063860,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After seeing TSLA land on Mars today when it crossed the $800 mark, I got a little worried. I had a weird feeling in my gut. I knew the next stop would be Jupiter, I just... couldn’t help but feel like ”we had arrived”.</p>\n\n<p>So after thinking about it long and hard, going back and forth, I decided to cash out and get off this reusable masterpiece of a rocketship. It had taken me and my SO safely from Earth to Mars and it was time to get off.</p>\n\n<p>The money we made from TSLA helped us make a down payment on our first apartment, so it went to good use. </p>\n\n<p>Selling TSLA felt bitter sweet as I love this company, I have a man crush on Papa Musk and I was planning initially to hold my dear TSLA shares “forever”. However, I’m forever grateful to this company as it made buying an apartment possible for me. Believing in it paid off.</p>\n\n<p>Thank you Elon. Thank you TSLA. ❤️</p>\n\n<p>Edit: Thank you guys for all the comments! It is crazy how emotionally attached you can get to a stock. I’ve just spent countless hours studying this company and Elon. I believed in it when so many said I was crazy (or thought it). Elon is a true visionary and I truly believe TSLA is going to continue on its path to greatness.</p>\n\n<p>Also, I wasn’t trying to time the top at all. It’s near impossible to do anyway. I just saw an opportunity, went with my gut feeling and seized it.</p>\n</div><!-- SC_ON -->",
  "score": 4848,
  "permalink": "/r/stocks/comments/ksod8l/sorry_im_out/",
  "subreddit": "stocks",
  "id": "ksod8l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706379526
}