{
  "author": "Fuligo_septica",
  "the_new_excerpt": "Correct me if I'm wrong, but if Royal Dutch Shell reduces its carbon emmissions\nby 45%, it's not as big as it sounds, because the size of carbon emmissions from\ncompany operations is tiny compared to the carbon emmissions produced by its\ncustomers.",
  "original_created_utc": 1622423824,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "間違っているかもしれませんが、ロイヤル・ダッチ・シェルが炭素排出量を45％削減したとしても\n45％削減できたとしても、それはそれほど大きなことではありません。なぜなら、会社の運営による炭素排出量は、その会社の社員が生み出す炭素排出量に比べてごくわずかだからです。\nというのも、同社の事業活動による炭素排出量は、同社の顧客が排出する炭素排出量に比べてごくわずかだからです。\nお客様",
      "title": "ハーグの地方裁判所は、ロイヤル・ダッチ・シェルに対し、2030年末までに世界全体の二酸化炭素排出量を45％削減するよう命じました。これは、本当に重要なことなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我错了，请纠正我，但如果荷兰皇家壳牌公司将其碳排放减少45%，并不像听起来那么大。\n45%，这并不像听起来那么大，因为与公司运营产生的碳排放相比，公司运营产生的碳排放规模很小。\n因为与客户产生的碳排放相比，公司运营的碳排放规模很小。\n客户。",
      "title": "海牙地区法院命令荷兰皇家壳牌公司在2030年底前将其全球碳排放量减少45%。这真的像它听起来那么重要吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我錯了，請糾正我，但如果荷蘭皇家殼牌公司將其碳排放減少45%，並不像聽起來那麼大。\n45%，這並不像聽起來那麼大，因爲與公司運營產生的碳排放相比，公司運營產生的碳排放規模很小。\n因爲與客戶產生的碳排放相比，公司運營的碳排放規模很小。\n客戶。",
      "title": "海牙地區法院命令荷蘭皇家殼牌公司在2030年底前將其全球碳排放量減少45%。這真的像它聽起來那麼重要嗎？"
    }
  ],
  "title": "The district court of The Hague ordered Royal Dutch Shell to cut its global carbon emissions by 45% by the end of 2030. Is this really as significant as it sounds?",
  "created_utc": 1622491837,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Correct me if I&#39;m wrong, but if Royal Dutch Shell reduces its carbon emmissions by 45%, it&#39;s not as big as it sounds, because the size of carbon emmissions from company operations is tiny compared to the carbon emmissions produced by its customers.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/Ask_Politics/comments/nop5e6/the_district_court_of_the_hague_ordered_royal/",
  "subreddit": "Ask_Politics",
  "id": "nop5e6",
  "is_self": true,
  "media": null,
  "is_video": false
}