{
  "author": "Chicky_Nuggy",
  "original_created_utc": 1641234411,
  "title": "\"I'm not in it for the money\" Such BS. We are ALL here for the money!",
  "created_utc": 1641242176,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Every one of us here hold coins and tokens, regardless if they&amp;#39;re BTC or a Shitcoin.&lt;/p&gt;\n\n&lt;p&gt;So many times people on here put people down for being just here for the money. Those same people always have their Reddit vaults open and are farming with passive aggressive comments 10x an hour. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Cociane and hookers&amp;quot;\n&amp;quot;This is the way&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Bore off.  &lt;/p&gt;\n\n&lt;p&gt;We are all here to make money, if you were solely just here for Blockchain technology, you&amp;#39;d be in the Blockchain sub or other technology specific subs. &lt;/p&gt;\n\n&lt;p&gt;The only reason I am I to crypto currency is purely because I want to trade the coins profits into my local currency (so I can actually spend it) the only real use case for spending crypto is XMR or BTC on DWMs  &lt;/p&gt;\n\n&lt;p&gt;After all this is literally a financial &amp;amp; currency subreddit. Not a technology sub.its nice that the technology is pushing the price, but let&amp;#39;s be honest all we care about is the money we make.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 331,
  "permalink": "/r/CryptoCurrency/comments/rv8cgs/im_not_in_it_for_the_money_such_bs_we_are_all/",
  "subreddit": "CryptoCurrency",
  "id": "rv8cgs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Every one of us here hold coins and tokens, regardless if they're BTC or a\nShitcoin.\n\nSo many times people on here put people down for being just here for the money.\nThose same people always have their Reddit vaults open and are farming with\npassive aggressive comments 10x an hour.\n\n\"Cociane and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちは皆、コインやトークンを保有しています。\nクソコイン。\n\nここで何度も人はお金のためにここにいるんだと人を貶しますが\nその人たちはいつもRedditの金庫を開けていて、ファームをやっています。\n受動的な攻撃的なコメントは、1時間に10回。\n\n\"コシアン \"と...",
      "title": "「お金のためにやっているのではありません」 そんなことはない。私たちは皆、お金のためにここにいるのです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们这里的每一个人都持有硬币和代币，不管它们是BTC还是一个\n狗屎币。\n\n很多时候，这里的人把人们贬低为只是为了钱而来。\n这些人总是打开他们的Reddit金库，每小时都会有10次被动攻击性的评论。\n被动攻击性的评论每小时10次。\n\n\"Cociane和...",
      "title": "\"我不是为了钱 \"这样的废话。我们都是为了钱!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們這裏的每一個人都持有硬幣和代幣，不管它們是BTC還是一個\n狗屎幣。\n\n很多時候，這裏的人把人們貶低爲只是爲了錢而來。\n這些人總是打開他們的Reddit金庫，每小時都會有10次被動攻擊性的評論。\n被動攻擊性的評論每小時10次。\n\n\"Cociane和...",
      "title": "\"我不是爲了錢 \"這樣的廢話。我們都是爲了錢!"
    }
  ]
}