{
  "author": "WannaBpolyglot",
  "the_new_excerpt": "Sorry, Long title.\n\nBut I was watching the travels of Ibn Battuta on Extra History, and in this\nepisode he spoke about Ibn Battuta's travel to China.\n\nhttps://youtu.be/dqZYZOjRlmA?t=257\n\nIt piqued my interest about Medieval sailing. He mentions the large ships crewed\nby muslims, with large private…",
  "original_created_utc": 1612917702,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "抱歉，标题很长。\n\n但我在看《史外篇》中伊本-巴图塔的游记，在这个\n他在节目中谈到了伊本-白图泰的中国之行。\n\nhttps://youtu.be/dqZYZOjRlmA?t=257\n\n这引起了我对中世纪航海的兴趣。他提到了大船的船员\n由穆斯林，与大型私人...",
      "title": "1345年，伊本-巴图塔登上了一艘中国船，欣赏他们的规模，5层甲板和私人船舱，有自己的厕所，可以预订。这一切都显得出乎意料的现代和豪华。作为一个富商，在海上旅行是什么感觉？还提供了哪些设施？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "抱歉，標題很長。\n\n但我在看《史外篇》中伊本-巴圖塔的遊記，在這個\n他在節目中談到了伊本-白圖泰的中國之行。\n\nhttps://youtu.be/dqZYZOjRlmA?t=257\n\n這引起了我對中世紀航海的興趣。他提到了大船的船員\n由穆斯林，與大型私人...",
      "title": "1345年，伊本-巴圖塔登上了一艘中國船，欣賞他們的規模，5層甲板和私人船艙，有自己的廁所，可以預訂。這一切都顯得出乎意料的現代和豪華。作爲一個富商，在海上旅行是什麼感覺？還提供了哪些設施？"
    }
  ],
  "title": "In 1345 Ibn Battuta boarded a Chinese ship and admired their size, 5 decks & private cabins with their own lavatories which can be reserved. This all seems unexpectedly modern and luxurious. What was it like to travel on sea as a wealthy merchant? What other Amenities were offered?",
  "created_utc": 1612949524,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sorry, Long title.</p>\n\n<p>But I was watching the travels of Ibn Battuta on Extra History, and in this episode he spoke about Ibn Battuta&#39;s travel to China.</p>\n\n<p><a href=\"https://youtu.be/dqZYZOjRlmA?t=257\">https://youtu.be/dqZYZOjRlmA?t=257</a></p>\n\n<p>It piqued my interest about Medieval sailing. He mentions the large ships crewed by muslims, with large private cabins and private lavatories, which seems unexpectedly modern, making it sound like a medieval cruise ship that is quite cushy and comfortable.</p>\n\n<p>Did large ships of this era all offer amenities such as this? What other things did they offer their travelers and how were they treated? Did they have &quot;staff&quot; on the crew to clean the cabins? Were they treated like guests? Would this be only available to the very wealthy? </p>\n\n<p>What would it have been like to travel by sea to other kingdoms as a moderately wealthy merchant?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/lghw3g/in_1345_ibn_battuta_boarded_a_chinese_ship_and/",
  "subreddit": "AskHistorians",
  "id": "lghw3g",
  "is_self": true,
  "media": null,
  "is_video": false
}