{
  "author": "throwaway099971",
  "original_created_utc": 1659618614,
  "title": "How do I stop my brother from becoming an extremist?",
  "created_utc": 1659704025,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I (20something man) have a brother (20something man) who seems to be becoming more and more extreme. When I say “extreme” I don’t mean “political stance I disagree with” I mean that he says and believes legitimately concerning things. &lt;/p&gt;\n\n&lt;p&gt;As kids, we were fairly close, hanging out and playing games together and such, but in high school we became more distant. We were in the same grade, but I was the more “popular” one of us and he tended to keep to himself. I don’t actually remember him having any friends, not because he was weird or annoying, but he just was a bit of a loner. &lt;/p&gt;\n\n&lt;p&gt;One thing I want to mention is that both of us were big into gaming during the “gamergate” thing, and I think that may have played a part in what happened. While I wasn’t really “sucked into” anything aside from those “feminist cringe comp” videos, I think he went much further. &lt;/p&gt;\n\n&lt;p&gt;In high school, he (as well as myself at the time) described himself as “politically moderate,” seemingly having the viewpoint of “socially liberal, fiscally conservative.” He was never hateful towards anyone, never racist/sexist/homophobic/etc, just had a certain view of how the economy should work and what role the government should play. Later, he became more “right-leaning” as he described, voting Republican in every election but still never being “extreme” about anything. &lt;/p&gt;\n\n&lt;p&gt;One day, he deleted all of his social media accounts. He was never super active, but I noticed he hadn’t been posting much one day and discovered his account was gone. I didn’t think much of it, as he never cared for social media anyway. But one day I found his twitter, and that’s when it seemed like he was a completely different person. &lt;/p&gt;\n\n&lt;p&gt;Everything he liked, retweeted, and posted was some sort of racist remark, something about how women need to go back to “traditional roles,” and various things about how Jewish people are taking over the world. I was pretty surprised. Again, he doesn’t have any friends that I know of, and I’m sure he’s getting a lot of this information from other online extremists. In real life, he’s pretty meek and non-confrontational, so it’s surprising to see things like this from him, especially considering he wasn’t like this as a kid. I’m wondering what I can do to help him out of that mindset, and I’m worried he’ll just become worse as time goes on.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/wg0w4w/how_do_i_stop_my_brother_from_becoming_an/",
  "subreddit": "TooAfraidToAsk",
  "id": "wg0w4w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I (20something man) have a brother (20something man) who seems to be becoming\nmore and more extreme. When I say “extreme” I don’t mean “political stance I\ndisagree with” I mean that he says and believes legitimately concerning things.\n\nAs kids, we were fairly close, hanging out and playing games…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私（20代男）には弟（20代男）がいるのですが、その弟がどんどん過激になっているようです。\nどんどん過激になっている。極端」といっても、「政治的なスタンスに反対」という意味ではなく\nという意味ではなく、正論を言う、信じるという意味です。\n\n子供の頃は結構仲良くて、一緒に遊んだりゲームしたりしてたんですけどね...。",
      "title": "弟が過激派になるのを防ぐにはどうしたらいい？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（20多岁的男人）有一个兄弟（20多岁的男人），他似乎变得\n越来越极端。当我说 \"极端 \"时，我不是指 \"我不同意的政治立场\"。\n我的意思是，他说的和相信的都是合法的事情。\n\n小时候，我们相当亲近，一起玩耍和玩游戏......",
      "title": "我怎样才能阻止我的兄弟成为一个极端分子？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（20多歲的男人）有一個兄弟（20多歲的男人），他似乎變得\n越來越極端。當我說 \"極端 \"時，我不是指 \"我不同意的政治立場\"。\n我的意思是，他說的和相信的都是合法的事情。\n\n小時候，我們相當親近，一起玩耍和玩遊戲......",
      "title": "我怎樣才能阻止我的兄弟成爲一個極端分子？"
    }
  ]
}