{
  "author": "Basic_Bridge_8177",
  "original_created_utc": 1639378341,
  "title": "“Give a man a steak and he will eat for a day but teach a man to stake and he will eat forever”",
  "created_utc": 1639434961,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Staking is a phenomenal way for the average person to make money. By staking you are 1. Contributing to something bigger than you and most importantly 2. You will make as much as if you were invested in an ETF in the stock market. Yes, the price of the coin can go down which is a notable risk factor. However, staking the right coin is a very great opportunity which everyone should at least look into. Many different coins offer ridiculous ROI for adding liquidity to a pool. These do however have a much higher associated risk factor so staking a stable coin is generally considered a safer (Still has risks) option.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/rf9kxk/give_a_man_a_steak_and_he_will_eat_for_a_day_but/",
  "subreddit": "CryptoCurrency",
  "id": "rf9kxk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Staking is a phenomenal way for the average person to make money. By staking you\nare 1. Contributing to something bigger than you and most importantly 2. You\nwill make as much as if you were invested in an ETF in the stock market. Yes,\nthe price of the coin can go down which is a notable risk…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ステーキングは、一般人がお金を稼ぐための驚異的な方法です。ステーキングをすることで、あなたは\n1. 自分より大きなものに貢献すること、そして最も重要なことは2．\nは、株式市場のETFに投資したのと同じような利益を得ることができます。そうです。\nコインの価格が下がる可能性があるのは、顕著なリスクですが...。",
      "title": "\"人にステーキを与えれば一日は食べられるが、人に杭を教えれば永遠に食べられる\""
    },
    {
      "locale": "zh",
      "the_new_excerpt": "赌注是普通人赚钱的一个惊人的方式。通过押注，你可以\n是1。为比你更大的事情做贡献，最重要的是 2.\n你赚的钱就像你投资于股市的ETF一样多。是的。\n币的价格可能会下降，这是一个值得注意的风险......",
      "title": "\"给人一块牛排，他可以吃一天，但教人打桩，他可以吃一辈子\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "賭注是普通人賺錢的一個驚人的方式。通過押注，你可以\n是1。爲比你更大的事情做貢獻，最重要的是 2.\n你賺的錢就像你投資於股市的ETF一樣多。是的。\n幣的價格可能會下降，這是一個值得注意的風險......",
      "title": "\"給人一塊牛排，他可以喫一天，但教人打樁，他可以喫一輩子\""
    }
  ]
}