{
  "author": "R0B0C0P33",
  "original_created_utc": 1633105763,
  "title": "We're all going to be rich. Throw caution to the wind.",
  "created_utc": 1633116647,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello fellow degenerates,</p>\n\n<p>Our crypto coins are going up. That can only mean one thing. They will keep going up forever. It&#39;s time to immediately start counting our chickens before they are hatched. We are definitely going to be super rich and very soon.</p>\n\n<p>What&#39;s that mean for us crypto enthusiasts? We should start spending wildly as if we already had the money. Buy anything you ever wanted. Quit your jobs and kick back since there&#39;s no stopping this rocket ship. You all better have your monocles picked out, because there&#39;s going to be a rush on them with all of us buying at the same time.</p>\n\n<p>&#x200B;</p>\n\n<p>Enjoy your guaranteed millionaire status.</p>\n</div><!-- SC_ON -->",
  "score": 358,
  "permalink": "/r/CryptoCurrency/comments/pzblsg/were_all_going_to_be_rich_throw_caution_to_the/",
  "subreddit": "CryptoCurrency",
  "id": "pzblsg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello fellow degenerates,\n\nOur crypto coins are going up. That can only mean one thing. They will keep\ngoing up forever. It's time to immediately start counting our chickens before\nthey are hatched. We are definitely going to be super rich and very soon.\n\nWhat's that mean for us crypto enthusiasts?…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "堕落した仲間たちよ、こんにちは。\n\n私たちのクリプトコインは上昇しています。その意味するところは一つしかありません。彼らは永遠に\n永遠に上がり続けます。鶏が孵化する前に、すぐに鶏の数を数え始める時が来ました。\n孵化する前に数え始める時です。私たちは間違いなく超金持ちになる、しかもすぐに。\n\nそれは私たち暗号愛好家にとって何を意味するのか...。",
      "title": "みんなでお金持ちになりましょう 油断は禁物だ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，堕落的同胞们。\n\n我们的加密钱币正在上涨。这只能说明一件事。它们将继续\n永远上涨。现在是时候立即开始计算我们的鸡，在它们被孵化之前\n它们被孵化了。我们肯定会成为超级富豪，而且很快。\n\n这对我们加密货币爱好者意味着什么？",
      "title": "我们都将成为富人。把谨慎抛到九霄云外。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，墮落的同胞們。\n\n我們的加密錢幣正在上漲。這隻能說明一件事。它們將繼續\n永遠上漲。現在是時候立即開始計算我們的雞，在它們被孵化之前\n它們被孵化了。我們肯定會成爲超級富豪，而且很快。\n\n這對我們加密貨幣愛好者意味着什麼？",
      "title": "我們都將成爲富人。把謹慎拋到九霄雲外。"
    }
  ]
}