{
  "author": "RIOT_DO_SOMETHING",
  "the_new_excerpt": "Hello cryptonians, good times for us!\n\nI really enjoyed this\n[https://www.reddit.com/r/CryptoCurrency/comments/nawgc2/vechain_explained_from_the_perspective_of_someone/]\nVeChain post last week so I thought I will copy its style and format and fit in\nthe IOTA information I have because I’d like to…",
  "original_created_utc": 1621358454,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "クリプトンの皆さん、こんにちは！良い時間を過ごさせていただきました。\n\n私はこれをとても楽しみました\n[https://www.reddit.com/r/CryptoCurrency/comments/nawgc2/vechain_explained_from_the_perspective_of_someone/]\n先週のVeChainの投稿がとても面白かったので、そのスタイルとフォーマットを真似して、私が持っているIOTAの情報に合わせようと思いました。\n私が持っているIOTAの情報と合わせてみたいと思いました。",
      "title": "IOTA - データ業界で働く人の視点で説明する"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，氪星人，我们的好时光！我很喜欢这本书。\n\n我非常喜欢这个\n[https://www.reddit.com/r/CryptoCurrency/comments/nawgc2/vechain_explained_from_the_perspective_of_someone/]\n上周VeChain的帖子，所以我想我会复制它的风格和格式，并将其纳入\n我所拥有的IOTA信息，因为我想...",
      "title": "IOTA - 从在数据行业工作的人的角度来解释"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，氪星人，我們的好時光！我很喜歡這本書。\n\n我非常喜歡這個\n[https://www.reddit.com/r/CryptoCurrency/comments/nawgc2/vechain_explained_from_the_perspective_of_someone/]\n上週VeChain的帖子，所以我想我會複製它的風格和格式，並將其納入\n我所擁有的IOTA信息，因爲我想...",
      "title": "IOTA - 從在數據行業工作的人的角度來解釋"
    }
  ],
  "title": "IOTA - Explained from the perspective of someone who works in the data industry",
  "created_utc": 1621367164,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello cryptonians, good times for us!</p>\n\n<p>I <strong>really</strong> enjoyed <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/nawgc2/vechain_explained_from_the_perspective_of_someone/\">this</a> VeChain post last week so I thought I will copy its style and format and fit in the IOTA information I have because I’d like to abide by the rules and that post obviously worked out great in that and other regards, though, <em>this might be a bit longer</em>.</p>\n\n<p>Vechain seems to be more than promising and we definitely need more of those quality posts here so shoutout to<a href=\"/u/BrownViking99\">/u/BrownViking99</a> really well done mate!</p>\n\n<p>As a data analyst, I have a very special relationship with crypto.</p>\n\n<p>On paper, it sounds like the missing piece of the puzzle that can protect my data, through decentralization and data integrity, but practically, many supposed solutions are too complicated or too expensive for recurring data packages. In my company, we rely on centralized services or our proprietary solutions because they can handle the work cost-efficiently and they have better usability. I believe with IOTA, that changes now.</p>\n\n<p>Why not one of the other solutions?</p>\n\n<p>Examples:</p>\n\n<ul>\n<li><em>Ethereum:</em><br/>\nWell, if you have a data table with 3000 individual entries to validate (like vaccine records that come in one after another), you would pay $17 each with ETH, for a total of $51,000 in fees. And that would be just one data set from one customer.</li>\n<li><em>Cardano:</em><br/>\nCardano is a bit trickier. The fee structure is transaction (tx) is a * size(tx) + b, where:-a/b are protocol parameters and -size(tx) is the transaction size in bytesEffectively a few cents right now. Bigger transactions mean more fees.</li>\n<li><em>Vechain:</em><br/>\nVeChain is between 30c and a few $.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>In the machine economy, we are talking about tens of thousands of companies globally and millions of sets per hour.  <strong>In the data economy with real adoption, every project with fees runs into a ceiling sooner or later, only feeless is feasible.</strong></p>\n\n<p>So in most cases, a centralized service is cheaper right now. IOTA, however, does it all for free. And I can&#39;t be the only developer who sees this.</p>\n\n<p>You can look at it from all sides, IOTA is currently without competition. Here is why:</p>\n\n<p>---------------------------</p>\n\n<h1>IOTA</h1>\n\n<p>Anyone interested in IOTA&#39;s applications has had to spend the last few years on the roller coaster of emotions.</p>\n\n<p>Rooting for IOTA is many things, but not easy, until now.</p>\n\n<p>Though it gained some momentum back when most of the drama went down, some controversial figures left the stage and they announced an official solution for one of the biggest if not the biggest problem in crypto, for all projects. The <a href=\"https://medium.com/logos-network/everything-you-know-about-the-scalability-trilemma-is-probably-wrong-bc4f4b7a7ef\">scalability trilemma</a>.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/sheydmtzwwz61.png?width=450&amp;format=png&amp;auto=webp&amp;s=a17e15064009df8b5a9b86633c7c0512787c2dc3\">The Trilemma: a Blockchain can only have two edges of this triangle. </a></p>\n\n<p>&#x200B;</p>\n\n<p>This is obviously a big deal for this space and some companies already declared IOTA their ledger to build on, but later more.</p>\n\n<h1>What is IOTA?</h1>\n\n<p>IOTA is a crypto project for the Internet of Things, for the machine economy, and for an actually unspecifiable number of applications wherever data or values are to be sent securely. This means it can also perform many of the functions of other cryptocurrencies through its capabilities. Whenever values are sent, this can also happen through IOTA. Additionally, data can be sent without even owning the token. Neither requires fees or mining.</p>\n\n<p>So, IOTA is a cryptocurrency, but also much more than that.</p>\n\n<p>When I started looking into it, and I think that’s what you should with all big projects, I noticed that most of the projects have a very specific use case, but IOTA was <em>a little bit more than that</em>.</p>\n\n<p>Sure, ultimately the majority are meeting here for investment reasons, but a lot of people, myself included, are interested in the technological narrative for data markets, the social as well as economic impact, because it simplifies our work flow and it will transform major parts of our lives.</p>\n\n<p><em>A little bit more than that</em> -  it&#39;s only logical that a mammoth project like IOTA sometimes comes across as a bit pretentious, considering its history.</p>\n\n<p>&#x200B;</p>\n\n<h1>How does IOTA work?</h1>\n\n<p>I think over the years it has become clear that IOTA is choosing a completely new path because the devs and initiators involved have noticed along the way that blocks and chains provide enough bandwidth for most speculation-based applications, but if you think about infrastructural improvements, i.e. a so-called backbone for e.g. the Internet of things,  data markets, or a scalable e-commerce environment you don&#39;t achieve nearly enough transactions per second.</p>\n\n<p>Bitcoin currently achieves 7 transactions per second, Ethereum about 15, some other projects with proof of authority like Hyperledger also a few thousand, but these are permissioned environments, which are contrary to a free data and machine economy. Permissioned means, your node has to been validated, a form of centralization as not everyone can participate. The machine-to-machine economy is interpreted by the IOTA Foundation as a free network for everyone.</p>\n\n<p>The tangle, i.e. the IOTA network, was therefore created with the aim of confirming transactions in parallel rather than sequentially because it’s faster.</p>\n\n<p>In the first iterations the idea was 2 for 1 so whoever makes a transaction must first confirm two other unconfirmed transactions with a little local proof of work (one-millionth of a BTC transaction).</p>\n\n<p>The first iterations were rather unsuccessful attempts because of a few things but mainly because the whole system was hung up on exotic design decisions.</p>\n\n<p>The trinary hash signatures (a good but complicated idea for the future) or the Winternitz one-time signature scheme (which was used against the future threat of quantum computers) prevented fast processing of the transactions and also the integration and management of addresses for exchanges and users. TBH, it made IOTA way too complicated to create usable solutions in and outside of corporate environments.</p>\n\n<p>Well, the Foundation has made many concessions in this regard, not always without external pressure. We remember some public executions of IOTA, unpleasant times, but part of history and also part of the change processes that people like me were waiting for.</p>\n\n<p>Now we are here. IOTA has integrated Chrysalis, the latest update and old design decisions have been replaced with industry standards like Ed25519.</p>\n\n<p>I could go on here, but essentially IOTA has become more lightweight, binary, faster, and has been equipped with reusable addresses. Now it’s reliable and usable, simple as that.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/u3ea4k8bxwz61.png?width=768&amp;format=png&amp;auto=webp&amp;s=3b94a229a127309139efa3f5b4401f750d7efd3c\">Chrysalis changes</a></p>\n\n<p>For now, the 2 for 1 rule remains, but with IOTA 2.0, expected towards the end of the year, IOTA will also move away from that and become multidimensional, so that many transactions are confirmed at once, without proof of work.</p>\n\n<p>Also possible, according to their roadmap, are smart contracts, DeFi, NFT&#39;s and colored coins. It almost seems as if the base-layer function is not only possible for the IoT, but for a large part of all use cases, including crypto.</p>\n\n<p>Clearly, non-scaling projects like ETH (today) have cost investors and developers a lot of money in transaction fees and due to its technological advances billions of dollars return on investments, so don’t get me wrong, but IOTA would bring about a general improvement that everyone feels - imagine the NFT or DeFi market without fees.  </p>\n\n<p>And just yesterday, Elon Musk declared crypto important but minable projects like Bitcoin not green enough. IOTA certainly wins Internet points here, as it’s one of the greenest that works without mining. This is more important for companies in my realm than people might imagine as sustainable applications and technologies have a better societal and political acceptance, naturally.</p>\n\n<h1>Genesis</h1>\n\n<p>IOTA was created non-inflationary no new tokens will be created, and in the crowd sale in 2015 all tokens were sold fairly, even founders and developers had to buy in.</p>\n\n<p>The tokens used by the IOTA Foundation for development were collected as donations and there is no further premine.</p>\n\n<p>The goal of this technology is to scale high enough so that machines can send data and smallest amounts of money to each other, even millions of transactions per second are possible from IOTA 2.0 and then subsequently integrated sharding.<br/>\nLet me be clear: For now, and only for value transactions, <strong>IOTA’s consensus is accompanied by a validator node, the coordinator that provides the network with a general direction. A centralized protection onboarding mechanism that is finally gone with IOTA 2.0.</strong></p>\n\n<p>What really important for developers is: There is already an IOTA 2.0 testnet called Pollen, and the next one, Nectar (feature complete and incentivized step by step) is here very soon. So if you’d like to develop future-proof tech, it might be a good idea to look into that as well.</p>\n\n<h1>IOTA partnerships</h1>\n\n<p>-Dell Technologies</p>\n\n<p>-Intel</p>\n\n<p>-Jaguar Land Rover</p>\n\n<p>-Edag</p>\n\n<p>-EVRYTHNG</p>\n\n<p>-EU government (CityxChange)</p>\n\n<p>-Object Management Group (Standardization institution)</p>\n\n<p>-Senseering</p>\n\n<p>-Zebra</p>\n\n<p>-TM Forum</p>\n\n<p>-INATBA</p>\n\n<p>-ClimateCHECK</p>\n\n<p>-TRADE MARK EAST AFRICA</p>\n\n<p>-ENSURESEC</p>\n\n<p>-ST Microelectronics (Europe&#39;s biggest semiconductor manufacturer)</p>\n\n<p>In fact, the number is much higher, but it makes most sense if you look in the <a href=\"https://iotaarchive.com/\">IOTA archive</a>, there are all collaborations, projects, and also patents (an impressive number) with IOTA with primary sources.</p>\n\n<p>It&#39;s probably more in the hundreds.</p>\n\n<p>Let&#39;s take a look at the partnerships and collaborations because as a data analyst, there are a few treasures hidden here.</p>\n\n<p>Dell and Intel are working with IOTA on <a href=\"https://www.youtube.com/watch?v=ltv7E0fJBWI\">Project Alvarium</a> (Conference with all parties), a data environment, or fabric, to make data trustworthy.</p>\n\n<p>That&#39;s a big deal to me, because the data that&#39;s in edge environments, at the point of origin (like in sensors), hasn&#39;t been trustworthy until now. The fact that the biggest companies in the world are now working on this, with IOTA, shows me that it has a future.</p>\n\n<p>Senseering is a company founded by the elite university RWTH Aachen in Germany. They are trying to apply IOTA&#39;s tech to modern production in engineering to secure real-life data.</p>\n\n<p>They are on it since 2018 and many videos to prove its results have <a href=\"https://www.youtube.com/watch?v=y-X3mCyta0c\">been uploaded</a>. They create tech for Germanies biggest companies such as Bosch, VW etc.</p>\n\n<p>The Object Management Group is a standardization company in Massachusetts that discusses and defines various standards and provides the industry with uniform ISO standards. There are now 250, including CORBA, CWM, DDS or MOF, SysML, and UML.</p>\n\n<p>IOTA is in the process of being standardized and made available to the broad mass of companies and developers, a data standard.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/79vz46fexwz61.png?width=1000&amp;format=png&amp;auto=webp&amp;s=96fa6127d3f760625ff6670ca08c214e50bfc75f\">Standardization roadmap</a></p>\n\n<p>This is one of the most impressive developments around IOTA and for me a huge relief as I don’t have to rely on an armada of proprietary standards of several companies in the future.  </p>\n\n<p>Also interesting, Dr. Richard Soley, CEO of the OMG is on the Supervisory Board of the IOTA Foundation. All in all, <a href=\"https://www.iota.org/foundation/team\">the team</a> is quite impressive.</p>\n\n<h1>IOTA use cases</h1>\n\n<p>In general, IOTA is located in the Internet of Everything.</p>\n\n<p>Everything that is digital can be supported by IOTA whether it’s value or data-based.</p>\n\n<p><em>Web of trust</em></p>\n\n<p>Whenever data is traded or sent in a trustworthy manner, IOTA can assure data integrity with various frameworks.</p>\n\n<p>This comes into play in the following applications:</p>\n\n<p>-Self-sovereign identity in the mobility sector or for human ID verification (like a vaccine-passport).</p>\n\n<p>-Data markets for science, the industry, or mobility use-cases. A self-driving Tesla had to rely on trusted data, a smart infrastructure could offer that.</p>\n\n<p>-Digital twins are copies of industrial environments that can create data digitally to test and improve parameters. The data generated is valuable.</p>\n\n<p><em>Microtransactions</em></p>\n\n<p>Microtransactions are a novelty that can bring about many different innovations, such as fairest per-second payments for media like video or music streaming.Even data packages from environmental sensors can be paid fairly so that sensors can finance themselves over months and relieve the academic sector financially.</p>\n\n<p><em>Supply and audit chains</em></p>\n\n<p>Quite comparable to what VeChain offers, IOTA can offer a safe route for information on global value chains for food, materials, or pharmaceuticals. I think that is quite self-explanatory.</p>\n\n<p><em>E-commerce</em></p>\n\n<p>Everything that Paypal, Mastercard, or Visa offer today, can be offered by IOTA tomorrow, though, this time without fees for vendors and customers and you own your consumer habits and data generated by it.</p>\n\n<p><em>In Crypto</em></p>\n\n<p>Not ready today but the basis is set: IOTA will be able to host all kinds of smart contracts, NFT’s DeFi, colored coins, and it can also wrap projects and send them for free. Imagine BTC being sent over the tangle. That would be a true cooperative crypto landscape everyone would benefit from.Additionally, I could imagine that IOTA will become some kind of a fast transaction protocol between exchanges (for traders and everyone else) as the finality is extremely fast and the ledger doesn’t require fees.</p>\n\n<p><em>Sustainability</em></p>\n\n<p>There is just one planet, resources are scarce and the atmosphere has enough carbon already. IOTA is a green enabler technology that can induce a transition to a more sustainable society where power from your roof can be traded securely with your neighbors. While it’s offering that, it doesn’t have to rely on miners. No oil or coal needs to be burned for IOTA’s consensus. Considering how the political landscape is changing, and society is sensitized towards a more efficient lifestyle, IOTA is in a good position to be not regulated to death, unlike projects that rely on heavy mining.</p>\n\n<p>Jeremy Rifkin talked about his idea of a zero-margin economy that can bring the necessary transition. Every IOTA enthusiast knows this video and so should you (even if you’re not into IOTA). <a href=\"https://video.vice.com/en_asia/video/vice-the-third-industrial-revolution-a-new-story-for-the-human-family/5a79c759f1cdb34df33d5811?latest=1\">Link</a></p>\n\n<h1>My thoughts on IOTA</h1>\n\n<p>New technologies not only improve our daily lives, our jobs, and the applications we rely on but also lighten the infrastructural load and optimize the world.</p>\n\n<p>Optimization is one of my main concerns, developers are lazy and want simple solutions that will have a direct impact.</p>\n\n<p>IOTA is that technology for me and Nectar / IOTA 2.0 will hopefully prove it.</p>\n\n<p>I believe IOTA is necessary and far away from only providing this space with speculative qualities.</p>\n\n<h1>Disclaimers</h1>\n\n<p>I currently hold IOTA, BTC, ETH, and Vechain - because of the last post ;)<br/>\nMy company is familiar with IOTA and I make sure they keep it that way.</p>\n\n<p>This is an analysis from a developers point of view and <strong>by no means financial advice, DYOR</strong></p>\n\n<p>This article got a little longer, thank you for your attention.</p>\n\n<p>&#x200B;</p>\n\n<h1>Sources</h1>\n\n<p><a href=\"https://www.iota.org/\">https://www.iota.org/</a></p>\n\n<p><a href=\"https://iotaarchive.com/\">https://iotaarchive.com/</a></p>\n\n<p><a href=\"https://coordicide.iota.org/\">IOTA 2.0 Website</a></p>\n</div><!-- SC_ON -->",
  "score": 2459,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/Ry-6c4XcM6VITkeZRq6HwzKSOwvQ5q_6h5Lmsam_gOY.jpg?auto=webp&s=76fac0ec0638e0a7f82e99cb03da19c04004795d",
          "width": 895,
          "height": 648
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/Ry-6c4XcM6VITkeZRq6HwzKSOwvQ5q_6h5Lmsam_gOY.jpg?width=108&crop=smart&auto=webp&s=bf0f46da5c5679f01f8b36a6ccb4805bbb65d5e2",
            "width": 108,
            "height": 78
          },
          {
            "url": "https://external-preview.redd.it/Ry-6c4XcM6VITkeZRq6HwzKSOwvQ5q_6h5Lmsam_gOY.jpg?width=216&crop=smart&auto=webp&s=dce8986be24f7b8281070cbbd29f8df025d31bca",
            "width": 216,
            "height": 156
          },
          {
            "url": "https://external-preview.redd.it/Ry-6c4XcM6VITkeZRq6HwzKSOwvQ5q_6h5Lmsam_gOY.jpg?width=320&crop=smart&auto=webp&s=24f00f2bf007ac5289fc9ca659919c0ef9067228",
            "width": 320,
            "height": 231
          },
          {
            "url": "https://external-preview.redd.it/Ry-6c4XcM6VITkeZRq6HwzKSOwvQ5q_6h5Lmsam_gOY.jpg?width=640&crop=smart&auto=webp&s=dd4abe240a44b3297d766b27fc913d401664eaa3",
            "width": 640,
            "height": 463
          }
        ],
        "variants": {},
        "id": "uH3_AIYkIAXcJpVPkArnm6Rnzf2ELhK1-d_YMbLxjIU"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/nfghhc/iota_explained_from_the_perspective_of_someone/",
  "subreddit": "CryptoCurrency",
  "id": "nfghhc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590801355
}