{
  "author": "ZzzSleepyheadzzZ",
  "original_created_utc": 1625184056,
  "title": "I am the first son of a landed gentleman in Georgian England and my father has just passed away. When do I kick my widowed mother out of the main bedroom? (Among other questions)",
  "created_utc": 1625200882,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It is the era of King George II and I am the first born son of an older, prestigious, but not particularly wealthy, landed gentleman in England. My father has just passed and as his firstborn, I&#39;ve inherited his country estate. He is survived by his wife (my mother) and his sons and daughter. </p>\n\n<p>I&#39;m not on bad terms with my family but my father was cash-poor. Currently me and my siblings are all unmarried. </p>\n\n<p>I find my mother a bit overbearing, particularly about me finding a wife. Assuming she has relatives of rank, would she move to be with them, say a sister, or would I be obliged to maintain her at my household?  </p>\n\n<p>If I have younger brothers, at what point are they expected to leave my residence? Would I be obligated (or expected) to sell a portion of the estate to provide a larger inheritance for them?</p>\n\n<p>I&#39;m relatively concerned about my sister&#39;s ability to find a husband, having neither the looks nor the dowry to entice a suitor to take her off my hands. Would I be obliged to maintain her and cover her expenses? </p>\n\n<p>I eagerly await your replies</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/AskHistorians/comments/obyikz/i_am_the_first_son_of_a_landed_gentleman_in/",
  "subreddit": "AskHistorians",
  "id": "obyikz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It is the era of King George II and I am the first born son of an older,\nprestigious, but not particularly wealthy, landed gentleman in England. My\nfather has just passed and as his firstborn, I've inherited his country estate.\nHe is survived by his wife (my mother) and his sons and daughter.\n\nI'm…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "時はジョージ2世の時代、私は年配の名門貴族の長男として生まれました。\n私はイギリスの名門貴族の長男で、特に裕福ではありません。私の\n父は亡くなったばかりで、長男である私は父の田舎の屋敷を相続することになりました。\n父には、妻（私の母）と息子たち、娘たちがいます。\n\n私は...",
      "title": "私はジョージア王朝時代の英国の土地所有者の長男で、父は亡くなったばかりです。未亡人となった母をいつ主寝室から追い出せばいいのでしょうか？(その他の質問)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是乔治二世的时代，我是英国一位年长者的长子。\n我是英国一位年长的、有名望的、但不是特别富有的地主绅士的长子。我的\n我的父亲刚刚去世，作为他的长子，我继承了他的乡村庄园。\n他的妻子（我的母亲）和他的儿子和女儿在世。\n\n我是...",
      "title": "我是乔治亚时代英国一位土地绅士的长子，我的父亲刚刚去世。我什么时候能把我的寡妇母亲赶出主卧室？(在其他问题中)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是喬治二世的時代，我是英國一位年長者的長子。\n我是英國一位年長的、有名望的、但不是特別富有的地主紳士的長子。我的\n我的父親剛剛去世，作爲他的長子，我繼承了他的鄉村莊園。\n他的妻子（我的母親）和他的兒子和女兒在世。\n\n我是...",
      "title": "我是喬治亞時代英國一位土地紳士的長子，我的父親剛剛去世。我什麼時候能把我的寡婦母親趕出主臥室？(在其他問題中)"
    }
  ]
}