{
  "author": "StarksTwins",
  "the_new_excerpt": "I like to consider myself a pretty decent investor. Nothing legendary, but I’ve\npicked up a few patterns in the few years I started using Reddit for investing\nadvice.\n\nOne thing I like to think I picked up were classic signs of a pump and dump.\nThese stocks usually involve a very low market cap,…",
  "original_created_utc": 1614377785,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我喜欢认为自己是一个相当不错的投资者。没有什么传奇，但我已经\n在我开始使用Reddit投资的这几年里，我学会了一些模式。\n的建议。\n\n我喜欢认为我捡到的一件事是典型的抽水和抛水的迹象。\n这些股票通常涉及一个非常低的市值，...",
      "title": "谨防泵送和倾倒。案例研究"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我喜歡認爲自己是一個相當不錯的投資者。沒有什麼傳奇，但我已經\n在我開始使用Reddit投資的這幾年裏，我學會了一些模式。\n的建議。\n\n我喜歡認爲我撿到的一件事是典型的抽水和拋水的跡象。\n這些股票通常涉及一個非常低的市值，...",
      "title": "謹防泵送和傾倒。案例研究"
    }
  ],
  "title": "Beware of Pump and Dumps: Case Study",
  "created_utc": 1614390832,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I like to consider myself a pretty decent investor. Nothing legendary, but I’ve picked up a few patterns in the few years I started using Reddit for investing advice. </p>\n\n<p>One thing I like to think I picked up were classic signs of a pump and dump. These stocks usually involve a very low market cap, unreasonable hype, and insane price targets. A large amount of awards should also tip you off.</p>\n\n<p>I was so sure of this <a href=\"https://www.reddit.com/r/smallstreetbets/comments/licg0l/sngx_soligenix_inc_is_still_slept_on_a_company/\">highly upvoted post</a> was a pump and dump that I set a reminder. I wanted to come back to try to use this post as sort of a “warning” considering everyone was saying how “all-in” they were</p>\n\n<p>Here’s the warning comment I wrote on the top comment</p>\n\n<blockquote>\n<p>People don’t realize this has all the signs of a pump and dump</p>\n\n<p>Extremely low market cap</p>\n\n<p>WAY too many words. Nobodies reading that shit</p>\n\n<p>Has a bunch of bolds and italics to make it look legit</p>\n\n<p>Shit stock that’s been shit for awhile</p>\n\n<p>Outrageous price target. Seriously, over 100% in a week? What in the fuck?</p>\n\n<p>I bet you my entire life savings 90% of the people who bought in have no idea what this company is and stopped reading after “biopharma”</p>\n\n<p>RemindMe! 2 weeks</p>\n</blockquote>\n\n<p><a href=\"https://i.imgur.com/bPGbhRl.jpgThe\">The post was posted a day before its complete highs</a> Just wanted to use this post as an example/warning to new investors. Don’t believe everything you hear and read. Do your own DD</p>\n</div><!-- SC_ON -->",
  "score": 389,
  "permalink": "/r/stocks/comments/lt9c2a/beware_of_pump_and_dumps_case_study/",
  "subreddit": "stocks",
  "id": "lt9c2a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937742114
}