{
  "author": "NoteAggravating",
  "original_created_utc": 1649636799,
  "title": "For Americans (seriously asking), do you really think America is the best country in the world?",
  "created_utc": 1649655844,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Or MOST Americans think that? Like, I’m not asking if it really IS the best (no country is the best, that’s subjective) but do most Americans think that it is? Like, I know the idea of American exceptionalism is taught to kids at a young age, but as you grow up and learn about other countries with different systems of government, or better systems of health-care, different social structures, etc. and see the ways America may be failing, do you still have this lingering feeling of defensiveness like, “Yeah but we’re still the best because of _____ &amp;amp; ____…” Or is there a growing/shifting understanding that perhaps it’s not true?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/u0v1kq/for_americans_seriously_asking_do_you_really/",
  "subreddit": "TooAfraidToAsk",
  "id": "u0v1kq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Or MOST Americans think that? Like, I’m not asking if it really IS the best (no\ncountry is the best, that’s subjective) but do most Americans think that it is?\nLike, I know the idea of American exceptionalism is taught to kids at a young\nage, but as you grow up and learn about other countries with…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それとも、ほとんどのアメリカ人がそう思っているのでしょうか？本当に最高かどうかを尋ねているのではありません (そんなものはない)\nしかし、ほとんどのアメリカ人はそう思っているのでしょうか？\nアメリカの例外主義という考え方は、若い頃から子供たちに教えられているのは知っています。\nしかし、大人になり、他の国のことを知るようになると......。",
      "title": "アメリカ人に（真剣に聞いて）、本当にアメリカは世界一の国だと思っているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "还是大多数美国人都这么想？比如，我不是问它是否真的是最好的（没有哪个国家是最好的，这是主观的），而是问大多数美国人认为它是最好的？\n国家是最好的，那是主观的），但大多数美国人认为它是最好的吗？\n比如，我知道美国的特殊性的想法在孩子们很小的时候就被灌输了\n但随着你的成长和对其他国家的了解......",
      "title": "对于美国人来说（认真地问），你真的认为美国是世界上最好的国家吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "還是大多數美國人都這麼想？比如，我不是問它是否真的是最好的（沒有哪個國家是最好的，這是主觀的），而是問大多數美國人認爲它是最好的？\n國家是最好的，那是主觀的），但大多數美國人認爲它是最好的嗎？\n比如，我知道美國的特殊性的想法在孩子們很小的時候就被灌輸了\n但隨着你的成長和對其他國家的瞭解......",
      "title": "對於美國人來說（認真地問），你真的認爲美國是世界上最好的國家嗎？"
    }
  ]
}