{
  "author": "starfoxer117two",
  "original_created_utc": 1637910805,
  "title": "I had unprotected sex with a girl who can't remember if she missed a day on her birth control pill ot not. Should I buy the morning after pill?",
  "created_utc": 1637918532,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For reference, I saw on the Planned Parenthood website that due to the brand of pill she&#39;s taking, she should be fine if she just takes the rest of her pills on schedule afterwards.</p>\n\n<p>We&#39;re nervous though and would appreciate some feedback. Particularly from uterus-owners lol.</p>\n\n<p>EDIT: I forgot to mention: I didn&#39;t actually finish inside her to any degree, as far as I can tell. Still, I&#39;m not sure whether that makes a huge difference since we were at it for a bit.</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/TooAfraidToAsk/comments/r2hgrg/i_had_unprotected_sex_with_a_girl_who_cant/",
  "subreddit": "TooAfraidToAsk",
  "id": "r2hgrg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For reference, I saw on the Planned Parenthood website that due to the brand of\npill she's taking, she should be fine if she just takes the rest of her pills on\nschedule afterwards.\n\nWe're nervous though and would appreciate some feedback. Particularly from\nuterus-owners lol.\n\nEDIT: I forgot to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "参考までに、Planned Parenthoodのサイトで見たのですが、ピルのブランドのせいで\n飲んでいるピルの銘柄によっては、その後残りのピルを予定通りに飲めば問題ないだろうと\nと書かれていました。\n\nしかし、私たちは神経質になっているので、何か意見があればお願いします。とくに\n特に子宮持ちの方(笑)。\n\nEDIT:忘れていました・・・。",
      "title": "私は、避妊薬を飲み忘れたことを覚えていない女の子と避妊せずにセックスをしました。モーニングアフターピルを買うべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为参考，我在计划生育网站上看到，由于她服用的药片品牌\n她正在服用的药丸的品牌，如果她按计划服用其余的药丸，应该不会有问题。\n后，她应该不会有事。\n\n但我们很紧张，希望得到一些反馈。特别是来自\n子宫拥有者的意见。\n\nEDIT: 我忘了...",
      "title": "我和一个女孩发生了无保护措施的性行为，她不记得她是否错过了一天的避孕药，还是没有。我应该购买事后避孕药吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲參考，我在計劃生育網站上看到，由於她服用的藥片品牌\n她正在服用的藥丸的品牌，如果她按計劃服用其餘的藥丸，應該不會有問題。\n後，她應該不會有事。\n\n但我們很緊張，希望得到一些反饋。特別是來自\n子宮擁有者的意見。\n\nEDIT: 我忘了...",
      "title": "我和一個女孩發生了無保護措施的性行爲，她不記得她是否錯過了一天的避孕藥，還是沒有。我應該購買事後避孕藥嗎？"
    }
  ]
}