{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "While the overwhelming sentiment around this sub still seems to be that Tesla's valuation is unjustifiable, I have yet to see someone explain that using real data instead of reasoning by analogy (\"but Toyota/VW sell X cars\" and is only worth Y\"). Looking purely at the numbers, it seems to me Tesla is starting to become insanely undervalued.\n\nThis post is largely based on a recent video by Tesla Daily. I believe links to YouTube aren't allowed, but it's his Jan 28th video for anyone who wants to see the detailed version.\n\nSo here are the numbers:\n\nAfter Tesla's Q4 earnings and subsequent 11.5% drop in stock price, its market cap dropped to $833B. Total GAAP earnings for 2021 came in at $5.5B, giving us a PE ratio of 151. \"Ridiculous!\" I hear you say.\n\nWell not so fast. Tesla's earnings in 2021 were up 665%, Q4 earnings was up 760% YoY and earnings in Q1 were just 1/6th of Q4. If we annualize Q4 (basically projecting 0% growth in 2022), we're already at a GAAP net income of $9.3B, or a forward PE of 90.\n\nNow obviously Tesla won't be doing 0% growth in 2022, so let's look at some of the things that seem a given.\n\nFirst of all, Tesla \"paid\" $910M in stock-based compensation to Elon Musk in 2022 for his CEO compensation plan. For 2022, there is only $65M of that plan left. Since this affects GAAP earnings, this will already mean an $845M increase to Tesla's 2022 earnings. Of course there might be a new compensation plan in the future, but this almost definitely won't affect 2022 and it would only come into effect if the stock rise significantly (I'm personally expecting it to be a plan for $2, 3, 4, ..., 10T in market cap)\n\nNext, Tesla had an increase in SG&amp;A of $340M because of Elon exercising his options. This was a one-time expense that will not occur in 2022. Adding these together, that's an added $1,185M to Tesla's bottom line in 2022, all other things equal. This would bring their PE down to 79.\n\nThen we've got growth. In the earnings call, Tesla mentioned how they expect to \"comfortable exceed 50%\" from their two existing factories, meaning they will sell at least 1.4M cars from Fremont and Shanghai alone. While scaling these factories might further improve margins due to economies of scale, let's pretend margin stays flat for these factories. Although this would likely increase GAAP net income by more than 50% (because not all costs would increase 50%, as we could see last year when revenue gross profit grew 135% but GAAP net income grew 760%), let's be super conservative and assume this increases GAAP net income by 50%. This adds up to $2.3B * 4 * 0.5 = $4.6B for the full year.\n\nNow finally, just to appease the bears, let's fully back out regulatory credits even though these are unlikely to go to $0 in 2022. In 2021 this was a total of $314M.\n\nAdding all of these up: 9.3 + 1.2 + 4.6 - 0.3 = $14.8B in net income for the full year 2022. This would give us a forward PE of 56 for a company that's at worst growing earnings 50% per year, or a PEG ratio of around 1.\n\nNow all of this doesn't take into account any of the many catalysts that are coming up for Tesla. Obviously they've just started production in two factories that are each larger than their two current factories combined, they will no longer need to ship (for insanely expensive rates atm) cars to Europe, the new factories will have new technologies like the single-piece casting for rear and front underbodies (which is much faster and cheaper), there's an $8,000 EV incentive that might be coming back and would force Tesla to raise unit prices to prevent demand from getting out of hand, and all of the more speculative stuff like FSD, Tesla bot, Autobidder and energy/solar in general, etc.\n\nFinally, if you still think a forward PE of 56 in the absolute worst case is too expensive, let's have a look at a comparable company in history. In 2016, Amazon also did an EPS of $4.90, after a year of 290% EPS growth. As we stated before, Tesla this year grew 760%, yet Amazon was also right around $830 a share at that time so both traded around the same PE. Looking at the growth in the next years, Amazon grew to $6.15 in 2017 and $20.14 in 2018, whereas we just established Tesla will at worst be growing to ~$15.00 in 2022 and 2023 will see Giga Texas and Berlin starting mass volume production. Just to give you an idea for comparison, Amazon's stock price grew to $1700 based on these earnings.\n\nSo having gone through all these numbers, while you can have doubts about how long Tesla will sustain this growth in car sales and whether their other businesses (energy/software/robotics/AI) will ever become a material part of the business, I think it's safe to say that anyone who says Tesla's valuation is \"nowhere near justified\" simply hasn't done the research.\n\nEDIT: Reupped since I thought the previous title wasn't exactly accurate.",
  "author_fullname": "t2_6ai23",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Unlike popular opinion, Tesla's valuation is far from unjustifiable - An analysis based on the numbers",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_sep6ud",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.69,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 263,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Company Analysis",
  "can_mod_post": false,
  "score": 263,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1643371202,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;While the overwhelming sentiment around this sub still seems to be that Tesla&amp;#39;s valuation is unjustifiable, I have yet to see someone explain that using real data instead of reasoning by analogy (&amp;quot;but Toyota/VW sell X cars&amp;quot; and is only worth Y&amp;quot;). Looking purely at the numbers, it seems to me Tesla is starting to become insanely undervalued.&lt;/p&gt;\n\n&lt;p&gt;This post is largely based on a recent video by Tesla Daily. I believe links to YouTube aren&amp;#39;t allowed, but it&amp;#39;s his Jan 28th video for anyone who wants to see the detailed version.&lt;/p&gt;\n\n&lt;p&gt;So here are the numbers:&lt;/p&gt;\n\n&lt;p&gt;After Tesla&amp;#39;s Q4 earnings and subsequent 11.5% drop in stock price, its market cap dropped to $833B. Total GAAP earnings for 2021 came in at $5.5B, giving us a PE ratio of 151. &amp;quot;Ridiculous!&amp;quot; I hear you say.&lt;/p&gt;\n\n&lt;p&gt;Well not so fast. Tesla&amp;#39;s earnings in 2021 were up 665%, Q4 earnings was up 760% YoY and earnings in Q1 were just 1/6th of Q4. If we annualize Q4 (basically projecting 0% growth in 2022), we&amp;#39;re already at a GAAP net income of $9.3B, or a forward PE of 90.&lt;/p&gt;\n\n&lt;p&gt;Now obviously Tesla won&amp;#39;t be doing 0% growth in 2022, so let&amp;#39;s look at some of the things that seem a given.&lt;/p&gt;\n\n&lt;p&gt;First of all, Tesla &amp;quot;paid&amp;quot; $910M in stock-based compensation to Elon Musk in 2022 for his CEO compensation plan. For 2022, there is only $65M of that plan left. Since this affects GAAP earnings, this will already mean an $845M increase to Tesla&amp;#39;s 2022 earnings. Of course there might be a new compensation plan in the future, but this almost definitely won&amp;#39;t affect 2022 and it would only come into effect if the stock rise significantly (I&amp;#39;m personally expecting it to be a plan for $2, 3, 4, ..., 10T in market cap)&lt;/p&gt;\n\n&lt;p&gt;Next, Tesla had an increase in SG&amp;amp;A of $340M because of Elon exercising his options. This was a one-time expense that will not occur in 2022. Adding these together, that&amp;#39;s an added $1,185M to Tesla&amp;#39;s bottom line in 2022, all other things equal. This would bring their PE down to 79.&lt;/p&gt;\n\n&lt;p&gt;Then we&amp;#39;ve got growth. In the earnings call, Tesla mentioned how they expect to &amp;quot;comfortable exceed 50%&amp;quot; from their two existing factories, meaning they will sell at least 1.4M cars from Fremont and Shanghai alone. While scaling these factories might further improve margins due to economies of scale, let&amp;#39;s pretend margin stays flat for these factories. Although this would likely increase GAAP net income by more than 50% (because not all costs would increase 50%, as we could see last year when revenue gross profit grew 135% but GAAP net income grew 760%), let&amp;#39;s be super conservative and assume this increases GAAP net income by 50%. This adds up to $2.3B * 4 * 0.5 = $4.6B for the full year.&lt;/p&gt;\n\n&lt;p&gt;Now finally, just to appease the bears, let&amp;#39;s fully back out regulatory credits even though these are unlikely to go to $0 in 2022. In 2021 this was a total of $314M.&lt;/p&gt;\n\n&lt;p&gt;Adding all of these up: 9.3 + 1.2 + 4.6 - 0.3 = $14.8B in net income for the full year 2022. This would give us a forward PE of 56 for a company that&amp;#39;s at worst growing earnings 50% per year, or a PEG ratio of around 1.&lt;/p&gt;\n\n&lt;p&gt;Now all of this doesn&amp;#39;t take into account any of the many catalysts that are coming up for Tesla. Obviously they&amp;#39;ve just started production in two factories that are each larger than their two current factories combined, they will no longer need to ship (for insanely expensive rates atm) cars to Europe, the new factories will have new technologies like the single-piece casting for rear and front underbodies (which is much faster and cheaper), there&amp;#39;s an $8,000 EV incentive that might be coming back and would force Tesla to raise unit prices to prevent demand from getting out of hand, and all of the more speculative stuff like FSD, Tesla bot, Autobidder and energy/solar in general, etc.&lt;/p&gt;\n\n&lt;p&gt;Finally, if you still think a forward PE of 56 in the absolute worst case is too expensive, let&amp;#39;s have a look at a comparable company in history. In 2016, Amazon also did an EPS of $4.90, after a year of 290% EPS growth. As we stated before, Tesla this year grew 760%, yet Amazon was also right around $830 a share at that time so both traded around the same PE. Looking at the growth in the next years, Amazon grew to $6.15 in 2017 and $20.14 in 2018, whereas we just established Tesla will at worst be growing to ~$15.00 in 2022 and 2023 will see Giga Texas and Berlin starting mass volume production. Just to give you an idea for comparison, Amazon&amp;#39;s stock price grew to $1700 based on these earnings.&lt;/p&gt;\n\n&lt;p&gt;So having gone through all these numbers, while you can have doubts about how long Tesla will sustain this growth in car sales and whether their other businesses (energy/software/robotics/AI) will ever become a material part of the business, I think it&amp;#39;s safe to say that anyone who says Tesla&amp;#39;s valuation is &amp;quot;nowhere near justified&amp;quot; simply hasn&amp;#39;t done the research.&lt;/p&gt;\n\n&lt;p&gt;EDIT: Reupped since I thought the previous title wasn&amp;#39;t exactly accurate.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "1235582c-6848-11eb-96e8-0e132357f477",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#d6890a",
  "id": "sep6ud",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "Ehralur",
  "discussion_type": null,
  "num_comments": 83,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/sep6ud/unlike_popular_opinion_teslas_valuation_is_far/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/sep6ud/unlike_popular_opinion_teslas_valuation_is_far/",
  "subreddit_subscribers": 3578865,
  "created_utc": 1643378775,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1643371202,
  "the_new_excerpt": "While the overwhelming sentiment around this sub still seems to be that Tesla's\nvaluation is unjustifiable, I have yet to see someone explain that using real\ndata instead of reasoning by analogy (\"but Toyota/VW sell X cars\" and is only\nworth Y\"). Looking purely at the numbers, it seems to me Tesla…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブタイトルでは、テスラについて、まだ圧倒的なセンチメントがあるようです。\nしかし、私はまだ、実際の評価額を用いてそれを説明する人を見たことがありません。\nしかし、トヨタとVWはX台しか売れていない。\nYの価値」）。純粋に数字だけを見ると、テスラ...",
      "title": "一般的な意見とは異なり、テスラの評価額は不当とは言い難い - 数字に基づく分析"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "虽然围绕这个子的压倒性情绪似乎仍然是特斯拉的\n的估值是不合理的，但我还没有看到有人解释，用真实的\n而不是通过类比推理（\"但丰田/大众卖了X辆车\"，只值Y\"）。\n值Y\"）。单纯从数字上看，在我看来，特斯拉...",
      "title": "与流行观点不同，特斯拉的估值远非毫无道理--基于数字的分析"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "雖然圍繞這個子的壓倒性情緒似乎仍然是特斯拉的\n的估值是不合理的，但我還沒有看到有人解釋，用真實的\n而不是通過類比推理（\"但豐田/大衆賣了X輛車\"，只值Y\"）。\n值Y\"）。單純從數字上看，在我看來，特斯拉...",
      "title": "與流行觀點不同，特斯拉的估值遠非毫無道理--基於數字的分析"
    }
  ],
  "source_updated_at": 1643967616674
}