{
  "author": "StevetheCorgi",
  "the_new_excerpt": "Hey everyone!\n\nI just wanted to type out a thank you to this sub for the past couple of weeks.\nAs many of you has noticed there has been a new wave of investors in the crypto\nscene and I am definitely one of those people.\n\nAt first I did think (like many others) I could just buy dogecoin on…",
  "original_created_utc": 1613575552,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，大家好！我只是想打字感谢这个分论坛。\n\n我只想打字感谢这个子在过去几周的工作。\n正如你们中的许多人已经注意到，已经有一波新的投资者在加密的\n场景，而我绝对是这些人中的一员。\n\n起初，我确实认为（像许多人一样）我可以直接购买dogecoin，在...",
      "title": "一个加密的忏悔"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，大家好！我只是想打字感謝這個分論壇。\n\n我只想打字感謝這個子在過去幾周的工作。\n正如你們中的許多人已經注意到，已經有一波新的投資者在加密的\n場景，而我絕對是這些人中的一員。\n\n起初，我確實認爲（像許多人一樣）我可以直接購買dogecoin，在...",
      "title": "一個加密的懺悔"
    }
  ],
  "title": "A Crypto Confession",
  "created_utc": 1613608247,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey everyone!</p>\n\n<p>I just wanted to type out a thank you to this sub for the past couple of weeks. As many of you has noticed there has been a new wave of investors in the crypto scene and I am definitely one of those people. </p>\n\n<p>At first I did think (like many others) I could just buy dogecoin on robinhood and call it a day. I mean, I would be rich by the next weekend and move into my new home next month.... right? Wrong. I used to think this sub was bashing dogecoin out of malice for the community, but I know this is no longer the case.</p>\n\n<p>Over the past two weeks I’ve learned about block chains and cryptography while simultaneously getting almost overwhelmed with the amount of coins and projects available to invest in. I have opened a couple new accounts in different places and even have my own wallet where I own my own coins!</p>\n\n<p>In the end, I just want to say I appreciate you all. Of course, I understand I need to do my own research when it comes to anything crypto, but the input here is almost always helpful to the beginner.</p>\n\n<p>TLDR: thought you guys were dicks, but you turned out to be pretty cool.</p>\n</div><!-- SC_ON -->",
  "score": 206,
  "permalink": "/r/CryptoCurrency/comments/llwx1s/a_crypto_confession/",
  "subreddit": "CryptoCurrency",
  "id": "llwx1s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728620220
}