{
  "author": "pacrimbeer",
  "the_new_excerpt": "Hey Reddit - just sending some good vibes, love, and true positivity your way on\na Friday. This past week has been very tough for a lot of people as the Fed\nchose not to extend the bank leverage ratio and bond yields have been rising.\nIt's a tricky game they're playing, and a lot of investors,…",
  "original_created_utc": 1616168539,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，Reddit - 只是发送一些良好的氛围，爱，和真正的积极性你的方式在\n一个周五。过去的一周对很多人来说都是非常艰难的，因为美联储的\n选择不扩大银行杠杆率，债券收益率一直在上升。\n他们玩的是一个棘手的游戏，很多投资者，...",
      "title": "在 \"红日\"， 花点时间，想想绿色。心理健康是至关重要的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，Reddit - 只是發送一些良好的氛圍，愛，和真正的積極性你的方式在\n一個週五。過去的一週對很多人來說都是非常艱難的，因爲美聯儲的\n選擇不擴大銀行槓桿率，債券收益率一直在上升。\n他們玩的是一個棘手的遊戲，很多投資者，...",
      "title": "在 \"紅日\"， 花點時間，想想綠色。心理健康是至關重要的。"
    }
  ],
  "title": "On RED DAYS: Take a moment and think GREEN. Mental Health is critical.",
  "created_utc": 1616174498,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey Reddit - <strong>just sending some good vibes, love, and true positivity your way on a Friday</strong>. This past week has been very tough for a lot of people as the Fed chose not to extend the bank leverage ratio and bond yields have been rising.  It&#39;s a tricky game they&#39;re playing, and a lot of investors, particularly in tech have been burned, myself included.</p>\n\n<p>As I look at my portfolio, a lot of the winnings earlier in the year with innovation, tech, and EV have literally disappeared in the past 4 days. All I&#39;ve seen lately are negative posts in the red, and questions about what&#39;s happening in the future.  I put a bunch of money in innovation ETFs like ARKK, and have been killed over the past little while.</p>\n\n<p>Like many of you, sometimes I suffer from mental health issues, and weeks like the past few can be devastating. You should know, there is <strong>NOTHING WRONG with closing your brokerage accounts</strong> for a day or two. I typically check about 10-20x a day, and its clearly not healthy. When you&#39;re up it seems great, but it really has a negative effect on me.  I&#39;m forcing myself to work out, to get outside, get some sun, and focus onw what really matters in life.</p>\n\n<p>If anyone needs to chat - by all means shoot me a note. Until then - enjoy your Friday. Love the ones close to you. Try your best to view this in perspective - life is so much more than the value of your portfolio. And so are you.</p>\n\n<p>To the entire stock community - please know you&#39;re not alone. <strong>Life is beautiful in so many ways, all you need to do is find the right places to look. Your loved ones, your family, and those in your circle love the positive you</strong> - so let&#39;s work together to foster a community beyond memes and tendies, but honest and open truth about how we&#39;re feeling.</p>\n</div><!-- SC_ON -->",
  "score": 345,
  "permalink": "/r/stocks/comments/m8k0yn/on_red_days_take_a_moment_and_think_green_mental/",
  "subreddit": "stocks",
  "id": "m8k0yn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752821004
}