{
  "author": "cash4soul",
  "the_new_excerpt": "I assume when most of us started investing, it went something like; buying the\ncool stock, buying a stock that represents an ideal, buying a stock of what you\nthink is a good business, learning about earnings, learning about the PE ratio,\nlearning about a bunch of ratios, learning about financial…",
  "original_created_utc": 1622247004,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人が投資を始めたときには、「かっこいい株を買う」「理想の株を買う」「自分の好きな株を買う」といった感じだったと思います。\nかっこいい株を買う」「理想の株を買う」「いいと思うビジネスの株を買う」「勉強する\n業績を学び、PEレシオを学び、多くのレシオを学び、財務を学び...。\nたくさんのレシオを学び、財務を学び...。",
      "title": "デューディリジェンスの基準は何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想，当我们大多数人开始投资的时候，情况是这样的：买入很酷的股票，买入代表理想的股票，买入你认为合适的股票。\n购买很酷的股票，购买代表理想的股票，购买你认为好的企业的股票\n购买你认为是好企业的股票，学习收益，学习市盈率。\n学习一系列的比率，学习财务知识......。",
      "title": "你的尽职调查标准是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想，當我們大多數人開始投資的時候，情況是這樣的：買入很酷的股票，買入代表理想的股票，買入你認爲合適的股票。\n購買很酷的股票，購買代表理想的股票，購買你認爲好的企業的股票\n購買你認爲是好企業的股票，學習收益，學習市盈率。\n學習一系列的比率，學習財務知識......。",
      "title": "你的盡職調查標準是什麼？"
    }
  ],
  "title": "What is your Due Diligence criteria?",
  "created_utc": 1622272291,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I assume when most of us started investing, it went something like; buying the cool stock, buying a stock that represents an ideal, buying a stock of what you think is a good business, learning about earnings, learning about the PE ratio, learning about a bunch of ratios, learning about financial statements, learning about how to read financial statements, copying a famous investors criteria, and so on until eventually you have your own set of metrics and criteria.</p>\n\n<p>What do you guys look for?\nWhat is your criteria and this scenario and your criteria in that scenario?\nWhat metrics do you focus on?</p>\n</div><!-- SC_ON -->",
  "score": 112,
  "permalink": "/r/investing/comments/nnb85e/what_is_your_due_diligence_criteria/",
  "subreddit": "investing",
  "id": "nnb85e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804299118
}