{
  "author": "AskScienceModerator",
  "original_created_utc": 1625835027,
  "title": "AskScience AMA Series: We are Cosmologists, Experts on the Cosmic Microwave Background, \"The Hubble Tension\", Dark Matter, Dark Energy and much more! Ask Us Anything!",
  "created_utc": 1625840114,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We are a bunch of cosmologists from the Cosmology from Home 2021 conference. Ask us anything, from our daily research to the organization of a large conference during COVID19!</p>\n\n<p>We have some special experts on</p>\n\n<ul>\n<li>Inflation: The mind-bogglingly fast expansion of the Universe in a fraction of the first second. It turned tiny quantum fluctuation into the seeds for the galaxies and clusters we see today</li>\n<li>The Cosmic Microwave background: The radiation reaching us from a few hundred thousand years after the Big Bang. It shows us how our universe was like, 13.4 billion years ago</li>\n<li>Large Scale Structure: Matter in the Universe forms a &quot;cosmic web&quot; with clusters, filaments and voids. The positions of galaxies in the sky shows imprints of the physics in the early universe</li>\n<li>Dark Matter: Most matter in the universe seems to be &quot;Dark Matter&quot;, i.e. not noticeable through any means except for its effect on light and other matter via gravity</li>\n<li>Dark Energy: The unknown force causing the universe&#39;s expansion to accelerate today</li>\n<li>&quot;The Hubble Tension&quot;: Measurements of the universe&#39;s expansion rate, which are almost identical but, mysteriously, slightly discrepant (aka the [sigh] &quot;crisis in cosmology&quot;)</li>\n</ul>\n\n<p>And ask anything else you want to know!</p>\n\n<p>Those of us answering your questions tonight will include</p>\n\n<ul>\n<li>Alex Gough: <a href=\"/u/acwgough\">u/acwgough</a> PhD student: Analytic techniques for studying clustering into the nonlinear regime, and on how to develop clever statistics to extract cosmological information. Previous work on modelling galactic foregrounds for CMB physics. Twitter: @acwgough.</li>\n<li>Katie Mack: <a href=\"/u/astro_katie\">u/astro_katie</a> cosmology, dark matter, early universe, black holes, galaxy formation, end of universe Twitter: @AstroKatie</li>\n<li>Shaun Hotchkiss: <a href=\"/u/just_shaun\">u/just_shaun</a> large scale structure, fuzzy dark matter, compact object in the early universe, inflation. Twitter: @just_shaun</li>\n<li>Tijmen de Haan: <a href=\"/u/tijmen-cosmologist\">u/tijmen-cosmologist</a> PhD student: experimental cosmology, galaxy clusters, South Pole Telescope, LiteBIRD</li>\n<li>Charis K. Pooni (she/her): <a href=\"/u/cosmo_ckpooni\">u/cosmo_ckpooni</a> PhD student: Probing Dark Matter (DM) using the Cosmic Microwave Background (CMB). Previous work on modelling recombination, reionization, extensions to LCDM.</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/askscience/comments/oguw1w/askscience_ama_series_we_are_cosmologists_experts/",
  "subreddit": "askscience",
  "id": "oguw1w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We are a bunch of cosmologists from the Cosmology from Home 2021 conference. Ask\nus anything, from our daily research to the organization of a large conference\nduring COVID19!\n\nWe have some special experts on\n\n * Inflation: The mind-bogglingly fast expansion of the Universe in a fraction\n   of the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Cosmology from Home 2021」会議に参加したコスモロジストの集まりです。質問\n私たちの日々の研究から、COVID19での大規模な会議の開催まで、何でも聞いてください。\nCOVID19では\n\n私たちには以下のような専門家がいます。\n\n * インフレーション。気が遠くなるほどの速さで宇宙が膨張していること。\n   インフレーション",
      "title": "AskScience AMAシリーズ。私たちは宇宙学者です。宇宙マイクロ波背景、「ハッブルの緊張」、ダークマター、ダークエネルギーなどの専門家です。何でも聞いてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们是一群来自2021年 \"家门口的宇宙学 \"会议的宇宙学家。询问\n我们的任何问题，从我们的日常研究到COVID19期间的大型会议的组织\n在COVID19期间!\n\n我们有一些特别的专家在\n\n *通货膨胀。宇宙在一小部分时间内以令人难以置信的速度膨胀。\n   膨胀：宇宙以令人难以置信的速度膨胀，而这一膨胀只占宇宙总量的一小部分。",
      "title": "AskScience AMA系列。我们是宇宙学家，是宇宙微波背景、\"哈勃张力\"、暗物质、暗能量等方面的专家! 向我们提出任何问题!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們是一羣來自2021年 \"家門口的宇宙學 \"會議的宇宙學家。詢問\n我們的任何問題，從我們的日常研究到COVID19期間的大型會議的組織\n在COVID19期間!\n\n我們有一些特別的專家在\n\n *通貨膨脹。宇宙在一小部分時間內以令人難以置信的速度膨脹。\n   膨脹：宇宙以令人難以置信的速度膨脹，而這一膨脹只佔宇宙總量的一小部分。",
      "title": "AskScience AMA系列。我們是宇宙學家，是宇宙微波背景、\"哈勃張力\"、暗物質、暗能量等方面的專家! 向我們提出任何問題!"
    }
  ]
}