{
  "author": "Okmanl",
  "the_new_excerpt": "Let's say a crash does happen soon, which sector or theme would you want to buy\nthe most, if or when it does happen in the coming months?\n\nAs we all know, EV, marijuana, fintech, tech, genomics have all 5-20X'd since\nthe start of the pandemic. The more famous investors such as Burry and Cathie\nWood…",
  "original_created_utc": 1612933287,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "假设真的很快发生暴跌，你会想买哪个板块或主题\n最，如果或当它真的在未来几个月内发生？\n\n众所周知，电动车、大麻、金融科技、科技、基因组学都有5-20倍的增长，自\n疫的开始。比较著名的投资人，如Burry和Cathie\n木头...",
      "title": "在现在形成的所有 \"泡沫 \"中，如果泡沫破灭，你最想买哪一个>（电动车、大麻、金融科技、加密技术等......）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "假設真的很快發生暴跌，你會想買哪個板塊或主題\n最，如果或當它真的在未來幾個月內發生？\n\n衆所周知，電動車、大麻、金融科技、科技、基因組學都有5-20倍的增長，自\n疫的開始。比較著名的投資人，如Burry和Cathie\n木頭...",
      "title": "在現在形成的所有 \"泡沫 \"中，如果泡沫破滅，你最想買哪一個>（電動車、大麻、金融科技、加密技術等......）。"
    }
  ],
  "title": "Out of all the \"bubbles\" that are forming right now, which ones would you buy the most if it popped> (EV, marijuana, fintech, crypto, etc...)",
  "created_utc": 1612954480,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let&#39;s say a crash does happen soon, which sector or theme would you want to buy the most, if or when it does happen in the coming months?</p>\n\n<p>As we all know, EV, marijuana, fintech, tech, genomics have all 5-20X&#39;d since the start of the pandemic. The more famous investors such as Burry and Cathie Wood seem convinced that there will be a crash or at least a correction coming soon.</p>\n\n<p>Also bonus question: What companies would you buy the most of within said bubble popping?</p>\n\n<p>Personally for me it would probably be EV &gt; weed &gt; tech &gt; genomics. With TSLA and NIO being the top 2 companies I would start buying. After that it would be APHA, and then from there stuff like SQ, NET, DKNG, SNOW, and LMND.</p>\n</div><!-- SC_ON -->",
  "score": 193,
  "permalink": "/r/investing/comments/lgme6f/out_of_all_the_bubbles_that_are_forming_right_now/",
  "subreddit": "investing",
  "id": "lgme6f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123200895
}