{
  "author": "VanyLa05",
  "original_created_utc": 1646671974,
  "title": "My 15 year old BF got his outfit for a wedding picked by his mom, is that normal?",
  "created_utc": 1646679447,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Today I accompanied my BF and his mom (at her invitation) to buy a suit for him and the poor guy wasn&amp;#39;t even allowed to decide for himself. Tbh my bf can&amp;#39;t stand nice clothes and i can imagine he would give his mom a hard time buying him something nice, but the fact that he isn´t allowed to choose anything at all is kind of weird and funny at the same time. His parents are usually very relaxed and allow him quite a lot, so that strict behaviour by his mom surprised me a lot. Don&amp;#39;t get me wrong, his outfit for the wedding is super cute and I&amp;#39;m looking forward to seeing him in it longer.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 166,
  "permalink": "/r/TooAfraidToAsk/comments/t8tm8m/my_15_year_old_bf_got_his_outfit_for_a_wedding/",
  "subreddit": "TooAfraidToAsk",
  "id": "t8tm8m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Today I accompanied my BF and his mom (at her invitation) to buy a suit for him\nand the poor guy wasn't even allowed to decide for himself. Tbh my bf can't\nstand nice clothes and i can imagine he would give his mom a hard time buying\nhim something nice, but the fact that he isn´t allowed to choose…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、私はBFと彼の母親（彼女の招待で）に同行して、彼のスーツを買いました。\nと、自分で決めることすら許されないかわいそうな人。正直言って、私のボーイフレンドは\nを買ってもらうのに苦労するのは想像に難くない。\nでも、選ぶことができないというのは...。",
      "title": "15歳のBFが結婚式の衣装を母親に選んでもらったのですが、それって普通なんですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天我陪我的男朋友和他妈妈（应她的邀请）去给他买一套衣服\n而这个可怜的家伙甚至没有被允许为自己做决定。坦率地说，我的男友不能忍受漂亮的衣服\n我可以想象，他一定会让他妈妈很难受，因为他不喜欢漂亮的衣服。\n但事实上，他不被允许选择......",
      "title": "我15岁的男友在婚礼上的服装是由他妈妈挑选的，这正常吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天我陪我的男朋友和他媽媽（應她的邀請）去給他買一套衣服\n而這個可憐的傢伙甚至沒有被允許爲自己做決定。坦率地說，我的男友不能忍受漂亮的衣服\n我可以想象，他一定會讓他媽媽很難受，因爲他不喜歡漂亮的衣服。\n但事實上，他不被允許選擇......",
      "title": "我15歲的男友在婚禮上的服裝是由他媽媽挑選的，這正常嗎？"
    }
  ]
}