{
  "author": "Warm_Bandicoot6835",
  "the_new_excerpt": "Hi everyone! Been browsing this subreddit for a couple of days and am amazed by\nthe awesome support that everyone has shown.\n\nAs a beginner investor, there are a couple of questions I hope you guys can help\nme out with. My apologies if these questions are unintelligent.\n\nIm looking to invest in VT…",
  "original_created_utc": 1621610572,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。数日前からこのサブレディットを見ていて、みんなの素晴らしいサポートに驚いています。\nみんなが見せてくれた素晴らしいサポートに驚いています。\n\n初心者の投資家として、いくつかの質問があるのですが、皆さんが助けてくれることを願っています。\nいただけたらと思います。意味不明な質問だったらごめんなさい。\n\n私はVTに投資することを考えています...",
      "title": "投資を始めたい25歳の方へ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好! 几天来，我一直在浏览这个分论坛，并对每个人所表现出的巨大支持感到惊讶。\n惊讶于每个人所表现出的巨大支持。\n\n作为一个初级投资者，我有几个问题希望你们能帮助我。\n我的问题。如果这些问题是不聪明的，请原谅。\n\n我想投资于VT...",
      "title": "25岁的人想开始投资!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好! 幾天來，我一直在瀏覽這個分論壇，並對每個人所表現出的巨大支持感到驚訝。\n驚訝於每個人所表現出的巨大支持。\n\n作爲一個初級投資者，我有幾個問題希望你們能幫助我。\n我的問題。如果這些問題是不聰明的，請原諒。\n\n我想投資於VT...",
      "title": "25歲的人想開始投資!"
    }
  ],
  "title": "25 year old looking to start investing!",
  "created_utc": 1621690948,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone! Been browsing this subreddit for a couple of days and am amazed by the awesome support that everyone has shown.</p>\n\n<p>As a beginner investor, there are a couple of questions I hope you guys can help me out with. My apologies if these questions are unintelligent.</p>\n\n<p>Im looking to invest in VT with 20k, should I be dumping all of it at once or should I spread it out to achieve DCA despite having the lump sum available now? Also, I understand that as much as I should not be timing the market, is it a bad time to enter the ETF now especially when its at an all time high? Lastly, does it make sense to hold a majority of VT with a small portion with VTI if I want to have more exposure to the US market, or would it better to simply have VTI and VXUS combined.</p>\n\n<p>Thanks everyone! :)</p>\n</div><!-- SC_ON -->",
  "score": 15,
  "permalink": "/r/Bogleheads/comments/nhv3oj/25_year_old_looking_to_start_investing/",
  "subreddit": "Bogleheads",
  "id": "nhv3oj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197387107
}