{
  "author": "FewLooseMarbles",
  "the_new_excerpt": "I have struggled for years with people misunderstanding me. Professional\nsettings, personal settings, etc.\n\nI feel like at this point I would rather just be rendered mute because it\nhappens so often.\n\nOften times it's something simple where I think I am making perfect sense, but\nthe answer isn't…",
  "original_created_utc": 1620335266,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人に誤解されることに長年悩んできました。仕事の場\n個人的な場面でも。\n\nあまりにも頻繁に起こるので、いっそのこと無言になってしまったほうがいいのではないかと思うほどです。\nあまりにも頻繁に起こるので、いっそのこと言葉を失ってしまいたいと思うほどです。\n\n自分では完璧に理解しているつもりでも、答えが違うという単純なことがよくあります。\n答えはそうではない...。",
      "title": "どうすれば、より良い表現ができるでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我多年来一直为人们对我的误解而挣扎。在专业\n场合，个人场合，等等。\n\n我觉得在这一点上，我宁愿变成哑巴，因为这种情况\n频繁发生。\n\n很多时候，这只是一些简单的事情，我认为我说的很有道理，但\n但答案却不是...",
      "title": "我怎样才能更好地说出我的意思呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我多年來一直爲人們對我的誤解而掙扎。在專業\n場合，個人場合，等等。\n\n我覺得在這一點上，我寧願變成啞巴，因爲這種情況\n頻繁發生。\n\n很多時候，這只是一些簡單的事情，我認爲我說的很有道理，但\n但答案卻不是...",
      "title": "我怎樣才能更好地說出我的意思呢？"
    }
  ],
  "title": "How can I better say what I mean?",
  "created_utc": 1620416419,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have struggled for years with people misunderstanding me. Professional settings, personal settings, etc.</p>\n\n<p>I feel like at this point I would rather just be rendered mute because it happens so often.</p>\n\n<p>Often times it&#39;s something simple where I think I am making perfect sense, but the answer isn&#39;t what I asked about (to me) and I often find myself having to back track and reexplain myself. It&#39;s exhausting and it&#39;s wearing me down mentally. I also feel it hurts me in a professional setting cause often times what I feel is a straight forward question leads to confusion and frustration for both parties. </p>\n\n<p>How can I prevent this? I&#39;ve tried being very specific, tried being vague, nothing works.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TrueAskReddit/comments/n6hq30/how_can_i_better_say_what_i_mean/",
  "subreddit": "TrueAskReddit",
  "id": "n6hq30",
  "is_self": true,
  "media": null,
  "is_video": false
}