{
  "author": "dks12",
  "the_new_excerpt": "I got interested in the three fund portfolio after reading a \"bogleheads guide\nto investing\" I started putting money away and investing in the total U.S. total\nstock market, total international market, and some bonds all through fidelity\nbecause I had seen so many of their commercials lol. When I…",
  "original_created_utc": 1621576602,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が3つのファンドのポートフォリオに興味を持ったのは、「Bogleheads Guide to Investment」を読んでからです。\n投資に興味を持ったんだ。\n株式、国際株式、債券に投資しました。\nなぜなら、彼らのコマーシャルをたくさん見ていたからです(笑)。私が...",
      "title": "ステイ・ザ・コースと言ってくれた人たちに感謝したいです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对三个基金的投资组合感兴趣是在读了一本 \"bogleheads投资指南 \"之后。\n我开始把钱存起来，投资于美国股市、国际市场和一些债券。\n股票市场，国际市场，和一些债券，都是通过富达公司投资的。\n因为我看过很多他们的广告，笑了。当我...",
      "title": "我只想感谢那些说要坚持下去的人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對三個基金的投資組合感興趣是在讀了一本 \"bogleheads投資指南 \"之後。\n我開始把錢存起來，投資於美國股市、國際市場和一些債券。\n股票市場，國際市場，和一些債券，都是通過富達公司投資的。\n因爲我看過很多他們的廣告，笑了。當我...",
      "title": "我只想感謝那些說要堅持下去的人。"
    }
  ],
  "title": "Just want to thank everyone who said stay the course.",
  "created_utc": 1621602172,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I got interested in the three fund portfolio after reading a &quot;bogleheads guide to investing&quot; I started putting money away and investing in the total U.S. total stock market, total international market, and some bonds all through fidelity because I had seen so many of their commercials lol.\nWhen I did this I was working for 14 dollar per hour full time and going to school to be an xray tech. The school part was like another full time job with classes and hospital clinicals. In the beginning I went from investing 20 to 40 dollars here and there during school as sort of an experiment to see if it really worked. I noticed a lot of ups and down and was like.. maybe this does or doesn&#39;t work?<br/>\nWhen I graduated and became and x-ray technologist I upped it to just 100 dollars per month since my primary retirement account was through my job now.. Since then I have become an CT tech and kind of forgot about that personal retirement fund.  </p>\n\n<p>Well I still hold all the same positions and have like 3.5k in the account. I am up a total of 38% and my total cash gain is around 900 dollars between all three funds...</p>\n\n<p>This is just proof that the boglehead theory works and you have to STAY THE COURSE!</p>\n</div><!-- SC_ON -->",
  "score": 63,
  "permalink": "/r/Bogleheads/comments/nhlctk/just_want_to_thank_everyone_who_said_stay_the/",
  "subreddit": "Bogleheads",
  "id": "nhlctk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197387106
}