{
  "author": "gigabyteIO",
  "original_created_utc": 1635116408,
  "title": "Coin Bureau is a brand owned and operated by a digital marketing firm. Guy is a paid actor. Everything about the channel and it's mission is astro turfed to feel \"authentic\" for the little guy. In reality, they are pushing on you a hidden agenda so they and their clients can make money off of you.",
  "created_utc": 1635124520,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You might wonder why Coin Bureau doesn&#39;t play adds on their channel.</p>\n\n<p>How incredibly egalitarian of them, right?</p>\n\n<p>Wrong.</p>\n\n<p>Coin Bureau is owned by a company called V3 Digital based out of London. Guess what V3 Digital is? Yep, a marketing firm that tries to maximize traffic for their clients.</p>\n\n<p>From their website:</p>\n\n<p>&quot; Your digital marketing strategy is incomplete without content marketing, which is why getting it right is always imperative. Our marketing experts are capable of tailoring content so that it engages your target audience at every stage of their journey. &quot;</p>\n\n<p>&quot; Growing your followers on social networks will help you increase word of mouth and referrals. We provide social media marketing services that enable you to reach relevant people, increase your following, make connections and drive organic traffic to your website with high success.&quot;</p>\n\n<p>&#x200B;</p>\n\n<p>Basically, the Coin Bureau channel is designed and curated to manipulate and influence your opinions on crypto for either clients of V3 digital or V3 digital itself. Essentially Coin Bureau is paid to shill the highest bidder. They want you buying their shitty hoodies and t-shirts while they cram misinformation and their agenda down your throat. </p>\n\n<p>&#x200B;</p>\n\n<p><strong>TL;DR: Do not trust coin bureau. Guy is a paid actor who has zero technical knowledge. Coin Bureau is owned BY V3 digital, a marketing firm out of London that shills for the highest bidder. It is an untrustworthy source of information. Know you&#39;re being manipulated. Their &quot;mistakes&quot; are not mistakes at all. Rather highly focused and targeted marketing with the intent to manipulate your crypto decisions.</strong></p>\n\n<p>edit:\nlink to v3 digital: <a href=\"https://v3.digital/\">https://v3.digital/</a></p>\n\n<p>link to Coin Burea ToS: <a href=\"https://www.coinbureau.com/terms-of-service/\">https://www.coinbureau.com/terms-of-service/</a></p>\n\n<p>&quot;Coin Bureau is a brand of V3 Digital&quot;</p>\n</div><!-- SC_ON -->",
  "score": 470,
  "permalink": "/r/CryptoCurrency/comments/qf3eqg/coin_bureau_is_a_brand_owned_and_operated_by_a/",
  "subreddit": "CryptoCurrency",
  "id": "qf3eqg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "You might wonder why Coin Bureau doesn't play adds on their channel.\n\nHow incredibly egalitarian of them, right?\n\nWrong.\n\nCoin Bureau is owned by a company called V3 Digital based out of London. Guess\nwhat V3 Digital is? Yep, a marketing firm that tries to maximize traffic for\ntheir clients.\n\nFrom…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜコインビューロは自分たちのチャンネルでアドを流さないのかと思うでしょう。\n\n信じられないほどの平等主義ですよね？\n\nそれは違います。\n\nCoin Bureauは、ロンドンに拠点を置くV3 Digitalという会社が所有しています。V3 Digitalとは？\nV3 Digitalとは？そう、クライアントのトラフィックを最大化するためのマーケティング会社です。\nクライアントのためにトラフィックを最大化しようとするマーケティング会社です。\n\nそれは...",
      "title": "コインビューロは、デジタルマーケティング会社が所有・運営するブランドです。ガイは有料の俳優です。このチャンネルとその使命についてのすべては、小市民にとって「本物」であると感じられるように調整されています。実際には、彼らや彼らのクライアントがあなたを利用してお金を稼ぐために、隠された意図をあなたに押し付けているのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你可能会想，为什么Coin Bureau不在他们的频道上播放添加内容。\n\n他们是多么令人难以置信的平等主义，对吗？\n\n错了。\n\nCoin Bureau是由一家位于伦敦的名为V3 Digital的公司拥有。猜猜看\nV3数字公司是什么？是的，一家营销公司，试图为他们的客户实现流量最大化。\n他们的客户。\n\n从...",
      "title": "Coin Bureau是一个由数字营销公司拥有和运营的品牌。盖伊是一名付费演员。关于这个渠道和它的任务的一切都被天体草皮化了，让小家伙感觉 \"真实\"。实际上，他们正在向你推送一个隐藏的议程，以便他们和他们的客户能够从你身上赚钱。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你可能會想，爲什麼Coin Bureau不在他們的頻道上播放添加內容。\n\n他們是多麼令人難以置信的平等主義，對嗎？\n\n錯了。\n\nCoin Bureau是由一家位於倫敦的名爲V3 Digital的公司擁有。猜猜看\nV3數字公司是什麼？是的，一家營銷公司，試圖爲他們的客戶實現流量最大化。\n他們的客戶。\n\n從...",
      "title": "Coin Bureau是一個由數字營銷公司擁有和運營的品牌。蓋伊是一名付費演員。關於這個渠道和它的任務的一切都被天體草皮化了，讓小傢伙感覺 \"真實\"。實際上，他們正在向你推送一個隱藏的議程，以便他們和他們的客戶能夠從你身上賺錢。"
    }
  ]
}