{
  "author": "rareliquid",
  "the_new_excerpt": "Hey All, each Sunday, I plan to pick 5 stocks from ARK’s funds that are most\nattractive from a fundamental perspective (i.e. growth rates, margins,\nvaluation). I'm doing this for myself so thought it'd be helpful to share with\nothers before trading begins on Mondays.\n\nPlanning to do this for the…",
  "original_created_utc": 1615162207,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，大家好，每个周日，我计划从ARK的基金中挑选5只股票，这些股票最\n从基本面的角度来看，具有吸引力（即增长率、利润率。\n估值）。) 我自己也是这么做的，所以觉得和大家分享一下，会对大家有所帮助。\n其他人在周一开始交易前。\n\n计划这样做，为...",
      "title": "ARKK (Innovation Fund) 5大股票精选-截至3/7/21的一周"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，大家好，每個週日，我計劃從ARK的基金中挑選5只股票，這些股票最\n從基本面的角度來看，具有吸引力（即增長率、利潤率。\n估值）。) 我自己也是這麼做的，所以覺得和大家分享一下，會對大家有所幫助。\n其他人在週一開始交易前。\n\n計劃這樣做，爲...",
      "title": "ARKK (Innovation Fund) 5大股票精選-截至3/7/21的一週"
    }
  ],
  "title": "ARKK (Innovation Fund) Top 5 Stock Picks - Week Ending 3/7/21",
  "created_utc": 1615174211,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey All, each Sunday, I plan to pick 5 stocks from ARK’s funds that are most attractive from a fundamental perspective (i.e. growth rates, margins, valuation). I&#39;m doing this for myself so thought it&#39;d be helpful to share with others before trading begins on Mondays.</p>\n\n<p>Planning to do this for the Innovation (ARKK) fund today, then the autonomous tech next week, then next gen internet, then fintech before the whole cycle repeats. (Unless it turns out that there’s no interest in this, then I’ll stop posting).</p>\n\n<p><strong>Why ARK?</strong></p>\n\n<ul>\n<li>Though ARK’s strategy can be seen as overhyped and controversial, what I do like about the fund is that they are growth-focused with an <a href=\"https://research.ark-invest.com/hubfs/1_Download_Files_ARK-Invest/Marketing_Material/ARKInvest_122019_ESG-Policy.pdf\">internal annual hurdle rate of 15%</a> based on a 5-year time horizon</li>\n<li>But, I think ARK tends to be on the optimistic end of the spectrum and sometimes <strong><em>too</em></strong> <strong>tolerant of overly stretched valuations</strong></li>\n<li>As a result, I’m hoping to give you the <strong>best of both worlds: high growth stock picks at the most attractive prices,</strong> all by using ARK’s ETF picks as a filter for vetted, high-growth companies \n\n<ul>\n<li>To be clear, I’m not saying ARK’s picks are all bulletproof. Just using the fund’s picks since they have a much bigger research team and resources than an individual investor such as myself, so <strong>think of this post as a potential</strong> <strong><em>starting point</em></strong> <strong>for more research</strong></li>\n</ul></li>\n</ul>\n\n<p><strong>My Process &amp; Selection Criteria</strong></p>\n\n<ul>\n<li>First of all, I’ll be excluding all non-tech stocks in my analysis because I personally like to focus on tech. Including healthcare stocks (which pretty much are what the non-tech stocks are) ruins the metric comparisons given the differences in industries.</li>\n<li>My process was pretty simple. Downloaded all the tickers from ARK, pulled data from wallmine or went through filings myself. As a result, there may be some slight discrepancies from the data you use and mine but they should be around the same ballpark.</li>\n<li>Next, my <strong>selection criteria,</strong> which will I’ll likely change over time each week. Today the ones I’m using include the following (data sourced from wallmine and filings):\n\n<ul>\n<li><strong>Trading at less than 70% of the 52 week high</strong> - provides context around market sentiment</li>\n<li><strong>Greater than 25% LTM revenue growth</strong> - guide for the future</li>\n<li><strong>Greater than 60% LTM gross margins</strong> - operational efficiency</li>\n<li><strong>LTM cash flow positive</strong> - operational efficiency</li>\n<li><strong>LTM Revenue multiple of less than 15x</strong> - valuation</li>\n</ul></li>\n<li>Given that the market is a bit bearish right now and punishing stocks with stretched valuations, I’m heavily weighting the valuation criteria as you’ll see soon</li>\n</ul>\n\n<p><strong>The Top 5 Picks of the Week</strong></p>\n\n<ul>\n<li><strong>2U - a leading edtech company</strong>\n\n<ul>\n<li>52 week high discount: 41%</li>\n<li>LTM revenue growth: 34%</li>\n<li>LTM gross margins: 71%</li>\n<li>LTM cash flow positive: 0%</li>\n<li>EV / LTM revenue: 3.3x</li>\n<li>Commentary: Most software companies are trading 20-30x with these types of fundamentals, so based on the valuation, 2U seems very promising</li>\n</ul></li>\n<li><strong>Baidu - a Chinese AI and internet conglomerate</strong>\n\n<ul>\n<li>52 week high discount: 26%</li>\n<li>LTM revenue growth: 46%</li>\n<li>LTM gross margins: 48%</li>\n<li>LTM cash flow positive: 33%</li>\n<li>EV / LTM revenue: 4.7x</li>\n<li>Commentary: Really great financial figures and super low revenue multiple, but do keep in mind that there’s always heightened risk when investing in Chinese companies</li>\n</ul></li>\n<li><strong>PagerDuty - an incident response software company</strong>\n\n<ul>\n<li>52 week high discount: 36%</li>\n<li>LTM revenue growth: 27%</li>\n<li>LTM gross margins: 87%</li>\n<li>LTM cash flow positive: (35%)</li>\n<li>EV / LTM revenue: 13.1x</li>\n<li>Commentary: The company is in its growing phase so that’s why I’m forgiving of its negative 35% free cash flow margin and a 13.1x revenue multiple seems very fair for this kind of financial profile for a software company. Keep in mind these are EV / LTM revenue multiples, so this multiple is even lower for NTM but I just don’t have that data.</li>\n</ul></li>\n<li><strong>Teradyne - a test equipment manufacturing company whose customers include Samsung, Qualcomm, Intel, and more</strong>\n\n<ul>\n<li>52 week high discount: 23%</li>\n<li>LTM revenue growth: 34%</li>\n<li>LTM gross margins: 57%</li>\n<li>LTM cash flow positive: 29%</li>\n<li>EV / LTM revenue: 5.8x</li>\n<li>Commentary: Based on the growth rate, margins, and valuation, seems like a bargain</li>\n</ul></li>\n<li><strong>Taiwan Semiconductor Manufacturing Company - primarily makes chips</strong>\n\n<ul>\n<li>52 week high discount: 15%</li>\n<li>LTM revenue growth: 33%</li>\n<li>LTM gross margins: 53%</li>\n<li>LTM cash flow positive: 29%</li>\n<li>EV / LTM revenue: 11.4x</li>\n<li>Commentary: The company isn’t trading at much of a discount relative to the others at 85% but I chose this company because there has been some news I came across recently of a chip shortage, which means there is incredible demand for TSMC’s products</li>\n</ul></li>\n</ul>\n\n<p><strong>Edit:</strong> One thing I forgot to add - there&#39;s obviously a lot more to investing than just numbers. And it&#39;s very possible that the numbers I share each week has an important story behind it (i.e. an inflated revenue figure due to an acquisition rather than organic growth). So as I mentioned earlier in the post, please view this as a starting point of research and I&#39;m not necessarily recommending all these as buys. Just that they are attractive from a financial perspective + it helps that the ARK team vetted the company.</p>\n</div><!-- SC_ON -->",
  "score": 121,
  "permalink": "/r/stocks/comments/m038nl/arkk_innovation_fund_top_5_stock_picks_week/",
  "subreddit": "stocks",
  "id": "m038nl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542576985
}