{
  "author": "kaushal19",
  "original_created_utc": 1637156147,
  "title": "I created a app for musicians to Connect, Collab and Grow",
  "created_utc": 1637175570,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey guys! Am an electronic music producer. I&#39;ve always had a hard time finding musicians (in my case vocalists) to collab with. There&#39;s just no easy way to do so. So last year I decided to fix this problem, taught myself to code, and along with a friend built Melofic.</p>\n\n<p>Melofic is a social platform for musicians to connect and collaborate. The goal is to help musicians discover each other, describe their music and sound, and to grow. Melofic makes it easy to find like-minded musicians and to meet and collaborate with them.</p>\n\n<p>I tried to solve the problems I faced as a musician. Melofic helps artists find and connect with other artists either locally or internationally. It also promotes the culture of getting reviews on your music from fellow artists on the platform.</p>\n\n<p>We launched the web app for melofic 7 months ago and got really positive feedback from the community, so we decided to take it a step further. This week we launched the native Android app for Melofic (iOS coming soon)</p>\n\n<p><a href=\"https://preview.redd.it/glfd6mf7s5081.png?width=1080&amp;format=png&amp;auto=webp&amp;s=9c30c5a3436beef3525c68e68621333a0c44dae4\">https://preview.redd.it/glfd6mf7s5081.png?width=1080&amp;format=png&amp;auto=webp&amp;s=9c30c5a3436beef3525c68e68621333a0c44dae4</a></p>\n\n<p>The Melofic app gives musicians the power to discover, collaborate and grow. Intuitively find other musicians based on your personal skills or listen to others&#39; creations as well as collaborate with each other as you share the same goal of music efficiency. Use Melofic to network with people from all around the world as you grow together into one big community.</p>\n\n<p>Melofic contains no ads and is 100% free to use.</p>\n\n<p>Whether you&#39;re looking to discover new tunes, collaborate with someone new, or just connect with like-minded people, Melofic is the perfect music community for you.</p>\n\n<p>If you&#39;re a musician i&#39;d really appreciate if you guys to check it out and be a part of its initial users/reviewers.</p>\n\n<p>Signup today! <a href=\"http://www.melofic.com/\">www.melofic.com</a></p>\n\n<p>PlayStore App -<a href=\"https://play.google.com/store/apps/details?id=com.melofic\">https://play.google.com/store/apps/details?id=com.melofic</a></p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/qvzf9e/i_created_a_app_for_musicians_to_connect_collab/",
  "subreddit": "SideProject",
  "id": "qvzf9e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey guys! Am an electronic music producer. I've always had a hard time finding\nmusicians (in my case vocalists) to collab with. There's just no easy way to do\nso. So last year I decided to fix this problem, taught myself to code, and along\nwith a friend built Melofic.\n\nMelofic is a social platform…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。私は電子音楽のプロデューサーです。いつも一緒に仕事をするミュージシャン（私の場合はボーカリスト）を見つけるのに苦労しています。\nミュージシャン（私の場合はボーカリスト）を探すのに苦労しています。簡単な方法がないのです。\nなくてね。そこで昨年、この問題を解決しようと決心し、独学でコードを学び、友人と一緒にMeloficを作りました。\n友人と一緒にMeloficを作りました。\n\nMeloficは、ソーシャル・プラットフォームです。",
      "title": "ミュージシャンがつながり、コラボし、成長するためのアプリを作りました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，伙计们! 我是一个电子音乐制作人。我一直都很难找到\n音乐家（就我而言是主唱）进行合作。只是没有简单的方法来做\n这样做。因此，去年我决定解决这个问题，自学了代码，并随着\n和一个朋友一起建立了Melofic。\n\nMelofic是一个社交平台。",
      "title": "我为音乐人创建了一个连接、合作和成长的应用程序。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，夥計們! 我是一個電子音樂製作人。我一直都很難找到\n音樂家（就我而言是主唱）進行合作。只是沒有簡單的方法來做\n這樣做。因此，去年我決定解決這個問題，自學了代碼，並隨着\n和一個朋友一起建立了Melofic。\n\nMelofic是一個社交平臺。",
      "title": "我爲音樂人創建了一個連接、合作和成長的應用程序。"
    }
  ]
}