{
  "author": "blaat_aap",
  "original_created_utc": 1634720550,
  "title": "What's the age of r/cryptocurrency users",
  "created_utc": 1634769222,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Often seeing posts and comments on how crypto is &quot;this generations&quot; big thing, its not for boomers, mis understood by &quot;dinosaurs&quot; and other age/generation references, and also how at times I see disagreements and views on certain topics that can be explained by age, I am just really curious on what the average age is of users on this sub.</p>\n\n<p>Also interesting to see what age people invest in crypto, as it seems much more accessible and approachable to &quot;younger&quot; people compared to traditional investing. If you like, elaborate in the comments how long you have been in crypto investments already, or what age you started.</p>\n\n<p><a href=\"https://www.reddit.com/poll/qbwl1r\">View Poll</a></p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/qbwl1r/whats_the_age_of_rcryptocurrency_users/",
  "subreddit": "CryptoCurrency",
  "id": "qbwl1r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Often seeing posts and comments on how crypto is \"this generations\" big thing,\nits not for boomers, mis understood by \"dinosaurs\" and other age/generation\nreferences, and also how at times I see disagreements and views on certain\ntopics that can be explained by age, I am just really curious on what…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号が「今の時代」の大流行であるという投稿やコメントをよく目にします。\n団塊の世代には向かない、「恐竜」などの年齢や世代の表現で誤解されている、などのコメントをよく目にします。\nまた、特定のトピックについて意見の相違や見解の相違が見られることがあります。\nまた、年齢によって説明できるような特定のトピックについての意見の相違や見解を目にすることがありますが、私はそれについてとても興味があります...",
      "title": "r/cryptocurrencyのユーザーの年齢は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "经常看到关于加密货币是 \"这一代 \"大事的帖子和评论。\n它不适合潮人，被 \"恐龙 \"和其他年龄/世代误解了。\n的说法，以及有时我看到在某些主题上的分歧和观点，可以用年龄来解释。\n我还看到，有时我在某些话题上的分歧和观点可以用年龄来解释，我只是真的很好奇，什么是......",
      "title": "r/cryptocurrency用户的年龄是多少？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "經常看到關於加密貨幣是 \"這一代 \"大事的帖子和評論。\n它不適合潮人，被 \"恐龍 \"和其他年齡/世代誤解了。\n的說法，以及有時我看到在某些主題上的分歧和觀點，可以用年齡來解釋。\n我還看到，有時我在某些話題上的分歧和觀點可以用年齡來解釋，我只是真的很好奇，什麼是......",
      "title": "r/cryptocurrency用戶的年齡是多少？"
    }
  ]
}