{
  "author": "gorays21",
  "the_new_excerpt": "I am open to investing on companies from other countries(other than U.S), but I\nam curious to know what you all think about China with all of the criticism they\nhave been taking as of late. I am still bullish on Alibaba, JD and other top\nchina companies but what about you guys?\n\nIt seems to me China…",
  "original_created_utc": 1618105104,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は他の国（米国以外）の企業に投資することに前向きですが、中国が批判されていることについて、皆さんはどう思われますか？\n最近批判されている中国について、皆さんがどのように考えているのか知りたいと思います。\n批判されている中国について、皆さんはどう思われますか？私はアリババやJDなど、中国のトップ企業にはまだ強気ですが、皆さんはどうでしょうか？\n私はまだアリババやJDなどの中国のトップ企業に強気ですが、皆さんはどうでしょうか？\n\n私には、中国は...",
      "title": "中国企業への投資はまだ続けるつもりですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对来自其他国家（美国以外）的公司的投资持开放态度，但我对美国公司的投资持开放态度。\n我很想知道你们对中国的批评有什么看法。\n最近一直在拿。我还是看好阿里巴巴、JD等顶层的\n中国公司，但你们呢？\n\n在我看来，中国...",
      "title": "你还打算投资中国企业吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對來自其他國家（美國以外）的公司的投資持開放態度，但我對美國公司的投資持開放態度。\n我很想知道你們對中國的批評有什麼看法。\n最近一直在拿。我還是看好阿里巴巴、JD等頂層的\n中國公司，但你們呢？\n\n在我看來，中國...",
      "title": "你還打算投資中國企業嗎？"
    }
  ],
  "title": "Do you still plan to invest in Chinese companies?",
  "created_utc": 1618141375,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am open to investing on companies from other countries(other than U.S), but I am curious to know what you all think about China with all of the criticism they have been taking as of late. I am still bullish on Alibaba, JD and other top china companies but what about you guys?</p>\n\n<p>It seems to me China won&#39;t let big companies get bigger which is concerning, but I still plan to buy Chinese companies in the future.</p>\n</div><!-- SC_ON -->",
  "score": 63,
  "permalink": "/r/stocks/comments/mohnid/do_you_still_plan_to_invest_in_chinese_companies/",
  "subreddit": "stocks",
  "id": "mohnid",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566618910
}