{
  "author": "Spreizbacken",
  "original_created_utc": 1633779395,
  "title": "Im addicted. How much time did it take you to stop constantly checking the charts?",
  "created_utc": 1633804564,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TL;DR: Hooked on checking charts all the time, how do I stop this addiction?  </p>\n\n<p>I need help. Im hooked on crypto.<br/>\nI spent a couple of months mostly perfecting my strategy, researching coins, listnening podcasts, youtubers and pretty much all there is crypto in the world wide web.<br/>\nNow that I&#39;ve invested all I had set aside for investments I just can&#39;t go back to my regular life. I keep waking up at night just to check the charts, I leave my phone with the tradingview app open just to have a quick peek whenever I use it for something else.<br/>\nEven when just talking to people and I feel like I haven&#39;t checked the price for the last 10 minutes I get a sudden crave to see what&#39;s going on. It&#39;s eating me from inside and I cannot stop it.  </p>\n\n<p>I&#39;ve taken all the decisions I had to take, invested it all and now all I have to do is nothing, just hold, yet I can&#39;t stop wanting to do something.  </p>\n\n<p>How much time did you need to get back to your normal life?</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/q4jkwj/im_addicted_how_much_time_did_it_take_you_to_stop/",
  "subreddit": "CryptoCurrency",
  "id": "q4jkwj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "TL;DR: Hooked on checking charts all the time, how do I stop this addiction?\n\nI need help. Im hooked on crypto.\nI spent a couple of months mostly perfecting my strategy, researching coins,\nlistnening podcasts, youtubers and pretty much all there is crypto in the world\nwide web.\nNow that I've…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TL;DR：チャートを常にチェックすることに夢中になっています。この中毒を止めるにはどうしたらいいですか？\n\n助けが必要です。私は暗号に夢中になっています。\n数ヶ月間、ほとんど自分の戦略を完璧にして、コインを研究していました。\nポッドキャストやユーチューバーなど、世界中のcryptoに関するあらゆる情報を聞いていました。\nウェブ上で暗号化されているものなら何でも調べました。\n今、私は...",
      "title": "ハマっています。常にチャートをチェックするのをやめるのに、どのくらいの時間がかかりましたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TL;DR：一直沉迷于查看图表，我怎样才能戒掉这种瘾？\n\n我需要帮助。我迷上了加密货币。\n我花了几个月的时间来完善我的策略，研究硬币。\n浏览播客、优酷和世界上几乎所有加密货币的信息。\n的所有东西。\n现在，我已经...",
      "title": "我上瘾了。你花了多少时间来停止不断检查图表？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TL;DR：一直沉迷於查看圖表，我怎樣才能戒掉這種癮？\n\n我需要幫助。我迷上了加密貨幣。\n我花了幾個月的時間來完善我的策略，研究硬幣。\n瀏覽播客、優酷和世界上幾乎所有加密貨幣的信息。\n的所有東西。\n現在，我已經...",
      "title": "我上癮了。你花了多少時間來停止不斷檢查圖表？"
    }
  ]
}