{
  "author": "bad8everything",
  "original_created_utc": 1655387870,
  "title": "Can you spray paint in space?",
  "created_utc": 1655400653,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I like painting scifi/fantasy miniatures and for one of my projects I was thinking about how road/construction workers here on Earth often tag asphalt surfaces with markings where they believe pipes/cables or other utilities are.&lt;/p&gt;\n\n&lt;p&gt;I was thinking of incorporating that into the design of the base of one of my miniatures (where I think it has an Apollo-retro meets Space-Roughneck kinda vibe) but then I wasn&amp;#39;t entirely sure whether that&amp;#39;s even physically plausible...&lt;/p&gt;\n\n&lt;p&gt;Obviously cans pressurised for use here on Earth would probably explode or be dangerous in a vacuum - but could you make a canned spray paint for use in space, using less or a different propellant, or would it evaporate too quickly to be controllable?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 201,
  "permalink": "/r/askscience/comments/vdmmsc/can_you_spray_paint_in_space/",
  "subreddit": "askscience",
  "id": "vdmmsc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I like painting scifi/fantasy miniatures and for one of my projects I was\nthinking about how road/construction workers here on Earth often tag asphalt\nsurfaces with markings where they believe pipes/cables or other utilities are.\n\nI was thinking of incorporating that into the design of the base of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はSF/ファンタジーのミニチュアを描くのが好きで、あるプロジェクトのために、私は\n地球上の道路や建設現場で働く人たちが、アスファルトの表面にパイプやケーブルなど\nアスファルトの表面には、パイプやケーブル、その他のユーティリティがあると思われるマークが付けられています。\n\n私は、そのようなことを基地のデザインに取り入れようと考えていました。",
      "title": "宇宙でスプレー塗装はできるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我喜欢画科幻/奇幻小模型，在我的一个项目中，我在考虑如何在道路/建筑方面的问题。\n我在想，地球上的道路/建筑工人经常在沥青表面上标记他们认为是管道/电缆或其他公共设施的地方。\n表面的标记，他们认为那里有管道/电缆或其他公用设施。\n\n我想把这一点融入到我的作品的底座设计中。",
      "title": "你能在太空中喷漆吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我喜歡畫科幻/奇幻小模型，在我的一個項目中，我在考慮如何在道路/建築方面的問題。\n我在想，地球上的道路/建築工人經常在瀝青表面上標記他們認爲是管道/電纜或其他公共設施的地方。\n表面的標記，他們認爲那裏有管道/電纜或其他公用設施。\n\n我想把這一點融入到我的作品的底座設計中。",
      "title": "你能在太空中噴漆嗎？"
    }
  ]
}