{
  "author": "E223476",
  "the_new_excerpt": "The reason the great DFV is so quick, organized and succinct in his responses is\nbecause you don’t need to “prepare” to tell the truth. It’s easy to answer a\nquestion when the truth is the answer.\n\nCompare that to Robinhood or citadel and it’s clear to see who needed to\n“prepare” and be coached for…",
  "original_created_utc": 1613684655,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "伟大的DFV之所以能如此快速、有条理、简洁的回答，是因为\n因为你不需要 \"准备 \"就能说出真相。很容易回答一个\n问题，而事实就是答案。\n\n对比一下罗宾汉或城堡，就知道谁需要\n\"准备 \"和接受指导... ...",
      "title": "DVF的回答之所以如此简洁。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "偉大的DFV之所以能如此快速、有條理、簡潔的回答，是因爲\n因爲你不需要 \"準備 \"就能說出真相。很容易回答一個\n問題，而事實就是答案。\n\n對比一下羅賓漢或城堡，就知道誰需要\n\"準備 \"和接受指導... ...",
      "title": "DVF的回答之所以如此簡潔。"
    }
  ],
  "title": "The reason DVF is so succinct in his answers.",
  "created_utc": 1613700930,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The reason the great DFV is so quick, organized and succinct in his responses is because you don’t need to “prepare” to tell the truth. It’s easy to answer a question when the truth is the answer. </p>\n\n<p>Compare that to Robinhood or citadel and it’s clear to see who needed to “prepare” and be coached for these questions today. </p>\n\n<p>It’s unfortunately clear that this hearing will result in little to no action or changes going forward to hold big money accountable for their bad decisions, and the people will continue to shoulder the burden for their mistakes. </p>\n\n<p>I’m not here to stick it to the man, or take down big hedgies, I’m here for the tendies just like anyone else, but it’s very clear we will see something like this happen again in another 5-10 years, with retail traders and tax payers shielding big money at the cost of our tendies.</p>\n</div><!-- SC_ON -->",
  "score": 29364,
  "permalink": "/r/wallstreetbets/comments/lmy5li/the_reason_dvf_is_so_succinct_in_his_answers/",
  "subreddit": "wallstreetbets",
  "id": "lmy5li",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332889975
}