{
  "author": "crusaderblings2",
  "the_new_excerpt": "I grew up on Looney Tunes in the 90s and it always made sense when compared to\nother 90s/2000s cartoons like Spongebob and Animaniacs that make use of some\nreally surreal humor, but looking back at it it's nothing like any other pieces\nof comedy between that and now. The timing and pacing of its…",
  "original_created_utc": 1619705291,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は90年代のルーニー・テューンズで育ちましたが、SpongebobやAnimaniacsなどの他の90年代/2000年代のアニメと比較しても、常に意味のあるものでした。\nスポンジ・ボブやアニマニアックスのような90年代/2000年代の他のアニメでは、本当にシュールなユーモアが使われています。\nしかし、振り返ってみると、当時から現在に至るまでの他のコメディ作品とは全く違うものでした。\n振り返ってみると、当時から現在に至るまでの他のコメディ作品とは全く異なります。そのタイミングとペースは、...",
      "title": "現代の視点から見ると、ルーニー・テューンズ／メリー・メロディーズのユーモアは、40年代／50年代に発表されたものよりもはるかに時代を先取りしており、現代のシュール／不条理なユーモアに近いものがあるように思えます。それに対する現代の反応はどうでしたか？当時の視聴者はそれを理解していたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是在90年代看Looney Tunes长大的，与其他90年代/2000年代的动画片如Spongebob和Animaniacs相比，它总是很有意义。\n其他90年代/2000年代的卡通片，如海绵宝宝和Animaniacs，使用了一些非常超现实的幽默。\n但回过头来看，它与从那时到现在的任何其他喜剧作品都不一样。\n之间的喜剧作品。它的时间和节奏...",
      "title": "从现代的角度来看，Looney Tunes/Merrie Melodies中的幽默似乎远远领先于它的时代，比40/50年代发行的任何东西都更类似于现代超现实/荒诞主义幽默。当代人对它的反应是什么？当时的观众理解它吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是在90年代看Looney Tunes長大的，與其他90年代/2000年代的動畫片如Spongebob和Animaniacs相比，它總是很有意義。\n其他90年代/2000年代的卡通片，如海綿寶寶和Animaniacs，使用了一些非常超現實的幽默。\n但回過頭來看，它與從那時到現在的任何其他喜劇作品都不一樣。\n之間的喜劇作品。它的時間和節奏...",
      "title": "從現代的角度來看，Looney Tunes/Merrie Melodies中的幽默似乎遠遠領先於它的時代，比40/50年代發行的任何東西都更類似於現代超現實/荒誕主義幽默。當代人對它的反應是什麼？當時的觀衆理解它嗎？"
    }
  ],
  "title": "From a modern perspective, the humor in Looney Tunes/Merrie Melodies seems to be far ahead of its time and more similar to modern surreal/absurdist humor than anything released in the 40s/50s. What was the contemporary reaction to it? Did audiences at the time understand it?",
  "created_utc": 1619717119,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I grew up on Looney Tunes in the 90s and it always made sense when compared to other 90s/2000s cartoons like Spongebob and Animaniacs that make use of some really surreal humor, but looking back at it it&#39;s nothing like any other pieces of comedy between that and now. The timing and pacing of its jokes, the sharp satire, and absurdism don&#39;t really match Silly Symphonies (which it&#39;s obviously mocking) or any cartoons I&#39;ve seen of that era.</p>\n\n<p>Did audiences of the time really <em>get</em> &quot;Yankee Doodle Daffy&quot; or &quot;Corny Concerto&quot;? Were they perceived as silly children&#39;s cartoons, or did adults understand their satirical value?</p>\n</div><!-- SC_ON -->",
  "score": 125,
  "permalink": "/r/AskHistorians/comments/n154qa/from_a_modern_perspective_the_humor_in_looney/",
  "subreddit": "AskHistorians",
  "id": "n154qa",
  "is_self": true,
  "media": null,
  "is_video": false
}