{
  "author": "3STmotivation",
  "the_new_excerpt": "I have to be honest, I didn’t expect to make another post so soon, but I have\nbeen flooded with messages and comments in the past few days, so I deemed it\nnecessary (oh and also for the people crowning me things like the ‘uranium\nmessiah’, ‘uranium guru’ and ‘that one uranium guy’, I am flattered,…",
  "original_created_utc": 1610115128,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "老实说，我没想到这么快就换了个职位，但是我\n在过去的几天里，我收到了大量的信息和评论，所以我认为\n有必要(哦，对那些给我加冕的人来说也是如此，比如“铀\n“弥赛亚”，“铀大师”和“那个铀家伙”，我受宠若惊，…",
      "title": "关于铀牛市的10个最常被问到的问题的答案"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "老實說，我沒想到這麼快就換了個職位，但是我\n在過去的幾天裏，我收到了大量的信息和評論，所以我認爲\n有必要(哦，對那些給我加冕的人來說也是如此，比如“鈾\n“彌賽亞”，“鈾大師”和“那個鈾傢伙”，我受寵若驚，…",
      "title": "關於鈾牛市的10個最常被問到的問題的答案"
    }
  ],
  "title": "Answers to the 10 most asked questions regarding the uranium bull market",
  "created_utc": 1610120361,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have to be honest, I didn’t expect to make another post so soon, but I have been flooded with messages and comments in the past few days, so I deemed it necessary (oh and also for the people crowning me things like the ‘uranium messiah’, ‘uranium guru’ and ‘that one uranium guy’, I am flattered, so thank you). Since my last post I have gotten a lot of questions regarding investing in uranium, the thesis, nuclear power, geopolitical changes and what the bear case for uranium is. So, I have decided to make a post highlighting the 10 most commonly asked questions so that more people can read my general answers to those and be informed about them. Here they are:  </p>\n\n<p>  </p>\n\n<p>Q: Isn’t nuclear power being phased out around the world?  </p>\n\n<p> \nA: No it isn’t, the US now has bipartisan support for it, Canada is looking at SMR technology, the UK intends to build small modular reactors, France has pushed back the phasing out of their nuclear power fleet from 2025 to 2035, several Eastern European countries are planning new reactors, China and the Middle-East are heavily pushing the construction of new power plants and there are many other examples of nuclear power being favored once more.  </p>\n\n<p>  </p>\n\n<p>Q: What companies should I invest in within the uranium sector:  </p>\n\n<p>  \nA: Check my post history and the subsequent comments, especially from my last post, to get an idea of specific stock picks. I don’t want to violate any subreddit guidelines by posting them here. What I can post however, is that everyone should check out the URNM etf and their holdings to get started.  </p>\n\n<p>  </p>\n\n<p>Q: Uranium has been trending downwards for almost a decade, who should it change now?  </p>\n\n<p>A: COVID-19 has really blown this market wide open and probably made sure this bull market started earlier by a margin of at least 1 or perhaps even 2 years. This rally was built on historic seasonality, bipartisan support from the US government and their strategic reserve bill, geopolitical backing of nuclear power, the closing of Cigar Lake (one of the world’s largest uranium mines) and the covering of uranium investing by some of the more mainstream investment outlets.  </p>\n\n<p>  </p>\n\n<p>Q: Did I miss the run already?  </p>\n\n<p>  \nA: No, we are nowhere close to reaching the end of this run and we probably still have years left before we see anything resembling a top. There are 6 phases to this investment and we are only just now barely starting to see the end of phase 1. Remember, the spot price of uranium needs to go to approximately $67.10 a pound to incentivize enough new production to have even a shout of fixing the supply deficit, although common consensus within the sector is that we need even more than that and that the spot price can reach inflation adjusted new all-time highs (~170 dollars a pound)  </p>\n\n<p>  </p>\n\n<p>Q: Won’t solar, wind and hydro remove the need for nuclear power and thus uranium?  </p>\n\n<p>  \nA: No it won’t, see the first question, it is the best and safest form of baseload green power generation we have. But for the sake of argument, let’s say we only finish the reactors currently under construction and shut all further planning of new reactors. What will happens? Guess what, the supply deficit is still significant and the thesis will still play out. There is roughly a 57 million pound supply deficit and the spot market is getting thin with both Cameco and Kazatomprom (the world’s 2 largest producers) buying on the spot market. This can’t hold out for much longer, regardless of whether or not nuclear power plants keep being constructed.  </p>\n\n<p>  </p>\n\n<p>Q: If the price shoots up, can’t people just find alternatives to uranium?  </p>\n\n<p>  \nA: No, for two key reasons. Firstly, as discussed above, we need nuclear power and we are starting to favor it more and more, which means we need a lot of uranium to meet demand. It is also impossible to change the fuel source in these nuclear reactors, you can’t just fill a plant up with natural gas or oil and hope it will do something. Secondly, unlike gas plants and coal plants, uranium is only a small portion of the total operational cost of these reactors. While with gas and coal it can be up to 80-85% of total costs, with uranium it is closer to 5-10%. This means that price can double and double again from here, without having an enormous impact on the total cost structure. Demand is relatively inelastic.  </p>\n\n<p>  </p>\n\n<p>Q: When prices go up, can’t Kazakhstan or some other state owned entity not just flood the market with uranium and bring the price back down?  </p>\n\n<p>  \nA: They can’t and they won’t (Kazatomprom has tended to favor quality over quantity since 2017). First of all, it can take up to 2 years for uranium to go from the ground all the way through the enrichment process and be ready to be used as fuel. This means that even if it was possible and these companies start pumping out massive amounts of uranium, it would take up to 2 years for it to even be used as fuel. This is why security of supply needs to be met years in advance, so that a reactor does not sit there without a fuel source. In terms of the fuel cycle, we are already well into 2023. In terms of the development of new uranium sources to reach the market, we might be in 2030 already. A decade is tomorrow in uranium.  </p>\n\n<p>  </p>\n\n<p>Q: But isn’t there hundreds of millions of pounds of uranium on earth?  </p>\n\n<p>  \nA: Yes there is, but no one is going to mine that at these prices. It takes many years to fully permit and construct a uranium mine in most countries. There might be plenty of supply out there, but there certainly isn’t a way to reach it easily without significant price incentive. Figures of 130 dollars or more per pound of uranium have been quoted as being needed to get to all these different sources of uranium.  </p>\n\n<p>  </p>\n\n<p>Q: What are some catalysts to look out for in 2021?  </p>\n\n<p>  \nA: There are several. Biden’s implementation of the ‘green new deal’, reactors finishing construction and being activated (needing around 3x as much uranium to start with to build a fuel core), the closure of two uranium mines (Ranger and Cominak, a combined ~7 million pounds a year, gone), long term contract negotiations, spot price increasing to meet the  increase in enrichment prices of the past few years, institutional money getting into the sector and last but not least more news on the development and possible implementation of small modular reactor technology. All these catalyst make 2021 a year to look forward to for uranium.  </p>\n\n<p>  </p>\n\n<p>Q: When should I sell my shares?  </p>\n\n<p>  \nA: I can’t tell you that, tops are nearly impossible to call in any sector. However, to get an idea of how a uranium bull market can unfold, here is an article covering the entirety of the previous bull market which ended in 2007. Read it, take some notes, read it again and craft an exit strategy for yourself. This is not a lifetime hold, don’t fall in love with these stocks, there will be a time to sell.  </p>\n\n<p><a href=\"https://thetideoffortune.com/would-you-have-made-a-fortune-in-uranium-part-1/%C2%A0\">https://thetideoffortune.com/would-you-have-made-a-fortune-in-uranium-part-1/ </a> </p>\n\n<p>Oh and an extra point regarding whether or not you should buy into the sector after the recent price run up:\nIf you have not yet established a position in the market, I would advise to do so and scale in over time and extra on weakness. It is a volatile market and a pullback will come, the question is if that it today or next week after another 20% run up. </p>\n\n<p>  </p>\n\n<p>So there we have it, 10 questions about the sector and the thesis. I have tried my best to provide short and easy to understand answers and I hope it helps all of you. Make sure to always do your own due diligence and asses your own risk tolerances, so that you are not shaken out by the volatility of this sector. Best of luck with your investments. </p>\n</div><!-- SC_ON -->",
  "score": 547,
  "permalink": "/r/investing/comments/kt36if/answers_to_the_10_most_asked_questions_regarding/",
  "subreddit": "investing",
  "id": "kt36if",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706378029
}