{
  "author": "caj_gol",
  "original_created_utc": 1648643844,
  "title": "What are your thoughts on the \"36 questions to fall in love\"? Have you tried it? What was your experience like? Outcome?",
  "created_utc": 1648669487,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For those that aren&amp;#39;t familiar the psychologist Arthur Aron designed a protocol revolving around 36 questions which can (according to him) bring even 2 strangers together and even cause them to fall in love. This &amp;quot;protocol&amp;quot; became popular when there was a &amp;quot;Modern Love&amp;quot; article about someone who used it successfully.\nDo you think it could work? Have you tried it? What happened?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskWomen/comments/ts5gzl/what_are_your_thoughts_on_the_36_questions_to/",
  "subreddit": "AskWomen",
  "id": "ts5gzl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For those that aren't familiar the psychologist Arthur Aron designed a protocol\nrevolving around 36 questions which can (according to him) bring even 2\nstrangers together and even cause them to fall in love. This \"protocol\" became\npopular when there was a \"Modern Love\" article about someone who…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "心理学者のアーサー・アロンが考案したプロトコルをご紹介します。\n36の質問に答えるだけで、2人でさえも仲良くなれるという。\n見ず知らずの人同士を結びつけ、恋にまで発展させる。この「プロトコル」は\nある人のことが「モダン・ラブ」に掲載され、話題になりました。",
      "title": "恋に落ちる36の質問」の感想は？試してみましたか？どのような体験でしたか？成果は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于那些不熟悉的人，心理学家阿瑟-阿隆设计了一个协议\n围绕着36个问题，这些问题（据他说）甚至可以使两个\n陌生人在一起，甚至导致他们相爱。这个 \"协议 \"在有 \"现代爱情 \"的时候变得\n当有一篇关于某人的 \"现代爱情 \"文章时，这个 \"协议 \"开始流行。",
      "title": "你对 \"恋爱的36个问题 \"有什么看法？你试过吗？你的经验是怎样的？结果如何？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於那些不熟悉的人，心理學家阿瑟-阿隆設計了一個協議\n圍繞着36個問題，這些問題（據他說）甚至可以使兩個\n陌生人在一起，甚至導致他們相愛。這個 \"協議 \"在有 \"現代愛情 \"的時候變得\n當有一篇關於某人的 \"現代愛情 \"文章時，這個 \"協議 \"開始流行。",
      "title": "你對 \"戀愛的36個問題 \"有什麼看法？你試過嗎？你的經驗是怎樣的？結果如何？"
    }
  ]
}