{
  "author": "EdwardTittyHands",
  "original_created_utc": 1631533583,
  "title": "Why doesn't modern society run on a 24 hour schedule?",
  "created_utc": 1631554124,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ive been night shift (mids and swings) my entire adult life. Every once in a while I&#39;ll go to day shift for a few days to attend a meeting or for some other random reason. During those times my day is hectic outside of work. The commute to work takes at least 30 minutes longer due to traffic, lunch sucks if you didnt bring anything that day, good luck trying to make a mad dash to the bank or anything after work since everyone else is leaving at the same time trying to handle run the same errands. </p>\n\n<p>I think a 24hr society would fix a lot of problems. We have more people in the world, so we have more traffic. Why have all of these people go in at the exact same time and leave at the exact same time? Imagine if most companies ran on a 24hr schedule. You wouldn&#39;t have to worry about making in time before closing to deal with whatever emergency you have at the moment. I understand that a lot of humans operate during the day and thats just the way it is, but all of us dont. So whats the downside to a 24hr society?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/pndr6n/why_doesnt_modern_society_run_on_a_24_hour/",
  "subreddit": "NoStupidQuestions",
  "id": "pndr6n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Ive been night shift (mids and swings) my entire adult life. Every once in a\nwhile I'll go to day shift for a few days to attend a meeting or for some other\nrandom reason. During those times my day is hectic outside of work. The commute\nto work takes at least 30 minutes longer due to traffic, lunch…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は大人になってからずっと夜勤（ミッドとスイング）をしてきました。たまには\n会議に出席するため、あるいはその他のランダムな理由で、数日間、日勤になることがあります。\nランダムな理由で。そのような時は、仕事以外でも慌ただしく過ごしています。通勤時間は\n通勤時間が渋滞で30分以上長くなったり、ランチを食べたり...。",
      "title": "なぜ現代社会は24時間制ではないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的整个成年生活都在上夜班（中班和夜班）。每过一段时间\n我就会去上几天白班，参加一个会议或其他一些随机的原因。\n随机的原因。在这些时候，我的工作以外的日子是很忙碌的。通勤时间\n由于交通、午餐等原因，上班时间至少要多花30分钟......。",
      "title": "为什么现代社会不按24小时的时间表运行？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的整個成年生活都在上夜班（中班和夜班）。每過一段時間\n我就會去上幾天白班，參加一個會議或其他一些隨機的原因。\n隨機的原因。在這些時候，我的工作以外的日子是很忙碌的。通勤時間\n由於交通、午餐等原因，上班時間至少要多花30分鐘......。",
      "title": "爲什麼現代社會不按24小時的時間表運行？"
    }
  ]
}