{
  "author": "Martinus_XIV",
  "original_created_utc": 1628068609,
  "title": "Why are the largest black holes we know of so far away from us?",
  "created_utc": 1628085548,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The YouTube channel Kurzgesagt recently uploaded a video on some of the largest known black holes, and I noticed that most of the larger ones they discuss seem to also be the furthest away. OJ 287 and TON 618 are both in the billions of light-years away from us. </p>\n\n<p>As we look into the distant universe, we are also looking back in time, due to the time it takes the light to travel to us from there. Therefore, we are seeing these ultramassive black holes as they were billions of years ago. But black holes, as far as we understand them, tend to only grow over time. Shouldn&#39;t we therefore expect to see smaller black holes when we look back in time, and larger black holes closer to the present, nearer to us?</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/askscience/comments/oxouav/why_are_the_largest_black_holes_we_know_of_so_far/",
  "subreddit": "askscience",
  "id": "oxouav",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The YouTube channel Kurzgesagt recently uploaded a video on some of the largest\nknown black holes, and I noticed that most of the larger ones they discuss seem\nto also be the furthest away. OJ 287 and TON 618 are both in the billions of\nlight-years away from us.\n\nAs we look into the distant…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "YouTubeのチャンネル「Kurzgesagt」は最近、既知の最大級のブラックホールに関するビデオをアップロードしました。\n話題になっている大きなブラックホールの多くは、最も遠くにあるもののようです。\n大きなブラックホールの多くは、最も遠い場所にあるようです。OJ 287とTON 618はどちらも数十億光年の距離にあります。\n我々から数十億光年の距離にあります。\n\n遠くを見ていると...",
      "title": "判明している最大のブラックホールは、なぜ人間から遠く離れたところにあるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "YouTube的Kurzgesagt频道最近上传了一段关于一些最大的\n我注意到，他们讨论的大多数较大的黑洞似乎也是最远的。\n也是最远的。OJ 287和TON 618都是在数十亿的\n光年的距离。\n\n当我们看向遥远的...",
      "title": "为什么我们知道的最大的黑洞离我们这么远？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "YouTube的Kurzgesagt頻道最近上傳了一段關於一些最大的\n我注意到，他們討論的大多數較大的黑洞似乎也是最遠的。\n也是最遠的。OJ 287和TON 618都是在數十億的\n光年的距離。\n\n當我們看向遙遠的...",
      "title": "爲什麼我們知道的最大的黑洞離我們這麼遠？"
    }
  ]
}