{
  "author": "TheMonsterUCreate",
  "the_new_excerpt": "I can see things visually, and I can imagine things in my mind, and\nhallucination is visually seeing an imagined thing. I'm wondering how this works\nand a few questions in regards to it.\n\nIf a person who is currently hallucinating is visually seeing what his mind has\nimagined, then does that mean…",
  "original_created_utc": 1617567110,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我可以直观地看到事物，我可以在脑海中想象事物，而且... ...\n幻觉就是视觉上看到了想象中的东西。我想知道这是怎么回事\n以及关于它的几个问题。\n\n如果一个正在产生幻觉的人，在视觉上看到的是他头脑中的\n想象出来的，那是不是意味着... ...",
      "title": "视觉上、精神上和幻觉上的 \"见物 \"有什么区别？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我可以直觀地看到事物，我可以在腦海中想象事物，而且... ...\n幻覺就是視覺上看到了想象中的東西。我想知道這是怎麼回事\n以及關於它的幾個問題。\n\n如果一個正在產生幻覺的人，在視覺上看到的是他頭腦中的\n想象出來的，那是不是意味着... ...",
      "title": "視覺上、精神上和幻覺上的 \"見物 \"有什麼區別？"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "視覚的にものを見たり、頭の中で想像したり、そして\n幻覚とは、想像したものを視覚的に見ることです。これはどのような仕組みなのでしょうか？\nいくつか質問があります。\n\nもし、今、幻覚を見ている人が、頭の中で想像したものを視覚的に見ているとしたら\nそれはつまり...",
      "title": "視覚的、精神的、幻覚的に「ものを見る」ことの違いは何ですか？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "視覚的にものを見たり、頭の中で想像したり、そして\n幻覚とは、想像したものを視覚的に見ることです。これはどのような仕組みなのでしょうか？\nいくつか質問があります。\n\nもし、今、幻覚を見ている人が、頭の中で想像したものを視覚的に見ているとしたら\nそれはつまり...",
      "title": "視覚的、精神的、幻覚的に「ものを見る」ことの違いは何ですか？"
    }
  ],
  "title": "What is the difference between \"seeing things\" visually, mentally and hallucinogenically?",
  "created_utc": 1617576770,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I can see things visually, and I can imagine things in my mind, and hallucination is visually seeing an imagined thing. I&#39;m wondering how this works and a few questions in regards to it.</p>\n\n<p>If a person who is currently hallucinating is visually seeing what his mind has imagined, then does that mean that while in this hallucinogenic state where his imagination is being transposed onto his visual image, then if he purposely imagines something else would it override his current hallucination with a new hallucination he thought up? It not, why? </p>\n\n<p>To a degree if I concentrate I can make something look to me as if it is slightly moving, or make myself feel as if the earth is swinging back and forth, subconscious unintentional hallucinations seem much more powerful however, why?</p>\n</div><!-- SC_ON -->",
  "score": 129,
  "permalink": "/r/askscience/comments/mk3uj2/what_is_the_difference_between_seeing_things/",
  "subreddit": "askscience",
  "id": "mk3uj2",
  "is_self": true,
  "media": null,
  "is_video": false
}