{
  "author": "cascading_disruption",
  "original_created_utc": 1626695044,
  "title": "The good old days: I’m Kevin and I'm the guy who bought 259684 BTC for $2613 yesterday",
  "created_utc": 1626713048,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot; I was watching, like many of you, a gigantic sell order burning through  the bids. Mt Gox doesn&#39;t execute trades very quickly, so we were  watching this huge order slowly eat up every buy order on the books. The  price started at around $17.50, and within minutes was below $10. At  this point, I realized this wasn&#39;t merely a large seller willing to  accept some losses. This was someone attempting to crash the market by  selling a huge percentage of the market&#39;s total bitcoins at once.</p>\n\n<p>I  had around $3000 USD in my Mt Gox account, from earlier sales I&#39;d made.  I looked at the market stats, and realized that there were tons of  orders to buy BTC at $0.01 that would likely eat up any remaining  bitcoins this seller had on the order. I figured if I put a buy order in  for $0.0101, my order would execute first and I could buy a huge amount  of bitcoins from this seller before it hit the bottom. The only problem  was that Mt Gox was running slower than molasses at the time, and  everyone was saying that it wasn&#39;t accepting trades. I had to try  several times, but eventually I got a buy order in, offering to buy as  many bitcoins as I could for $0.0101.</p>\n\n<p>The site stopped responding  completely for a while, probably from so many people hitting refresh to  see what was going on. When I got back in, I saw in my account:</p>\n\n<p>06/19/11 17:51  Bought BTC  259684.77 for 0.0101</p>\n\n<p>I  had just purchased over 250,000 bitcoins for $2613. At the trading  price immediately before this large sell order happened, that number  would have been worth nearly $5 million. After I regained my breath, I  tried to figure out what to do. I wasn&#39;t sure what was really going on.  Over the past few days there had been a lot of talk and complaints about  Mt Gox&#39;s security. Lists of Mt Gox usernames, email addresses and  encrypted passwords were being traded around, which was an obvious sign  that security at Mt Gox had been breached in some way. If there was an  attacker in the system, perhaps he was able to log into my account now  and force my account to execute some other crazy trade. &quot;</p>\n\n<p>Source: <a href=\"https://bitcointalk.org/index.php?topic=20207.0\">https://bitcointalk.org/index.php?topic=20207.0</a></p>\n</div><!-- SC_ON -->",
  "score": 173,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/4IQ8VxjuIfEc5XvuL1XFX4TKgd7xszmZ1wi4ceHlEik.jpg?auto=webp&s=e3e9f989765165c9067d5a49a82462d243185460",
          "width": 120,
          "height": 80
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/4IQ8VxjuIfEc5XvuL1XFX4TKgd7xszmZ1wi4ceHlEik.jpg?width=108&crop=smart&auto=webp&s=bf3ec3ee92dbefca82d42803b1d4ca64fc165364",
            "width": 108,
            "height": 72
          }
        ],
        "variants": {},
        "id": "IV_l36b-16aDnpF51xMNrgyRAm2BbAO62c4OAD3WIpQ"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/onceag/the_good_old_days_im_kevin_and_im_the_guy_who/",
  "subreddit": "Bitcoin",
  "id": "onceag",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "\" I was watching, like many of you, a gigantic sell order burning through the\nbids. Mt Gox doesn't execute trades very quickly, so we were watching this huge\norder slowly eat up every buy order on the books. The price started at around\n$17.50, and within minutes was below $10. At this point, I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\" 多くの皆さんと同じように、巨大な売り注文がビッドを燃やしているのを見ていました。\n入札を行っていました。Mt.Goxはあまり早く取引を実行しないので、この巨大な注文がすべての買い注文をゆっくりと食い尽くすのを見ていました。\nこの巨大な注文が帳簿上のすべての買い注文をゆっくりと食い尽くすのを見ていました。価格は約17.50ドルから始まりました。\n17.50ドルから始まり、数分後には10ドルを切りました。この時点で、私は...",
      "title": "古き良き時代。昨日259684BTCを2613ドルで購入したケビンです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\" 我和你们中的许多人一样，看着一个巨大的卖单烧毁了\n竞价。Mt Gox执行交易的速度并不快，所以我们看着这个巨大的\n订单慢慢吞噬了账面上的所有买单。价格开始于大约\n17.50美元，几分钟内就跌破了10美元。在这一点上，我...",
      "title": "过去的美好时光。我是凯文，我是昨天以2613美元买入259684 BTC的人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\" 我和你們中的許多人一樣，看着一個巨大的賣單燒燬了\n競價。Mt Gox執行交易的速度並不快，所以我們看着這個巨大的\n訂單慢慢吞噬了賬面上的所有買單。價格開始於大約\n17.50美元，幾分鐘內就跌破了10美元。在這一點上，我...",
      "title": "過去的美好時光。我是凱文，我是昨天以2613美元買入259684 BTC的人"
    }
  ]
}