{
  "author": "partymsl",
  "original_created_utc": 1645379861,
  "title": "You should definitely not listen to this sub during any major movements in crypto.",
  "created_utc": 1645396530,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As we are currently having some major downtrends in the crypto market its way more important to stick to your plan than ever. But also major movements are the time where this sub is overly bipolar. &lt;/p&gt;\n\n&lt;p&gt;This sub is something way more volatile than crypto. Any minor movement causes a complete shift from bull to bearish in this subs sentiment. And during major movements like this, the sub goes completely crazy. Making predictions of either 100k in a week or as now 18k tomorrow. If you would listen to this sub you would absolutely master buy high sell low. &lt;/p&gt;\n\n&lt;p&gt;You should not listen to anyone actually during rough times and during very amazing times. Those are the moments you should keep your plan to yourself. Just strictly follow it and sell/buy when YOU think it&amp;#39;s right. That way you won&amp;#39;t regret it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 313,
  "permalink": "/r/CryptoCurrency/comments/sx71xo/you_should_definitely_not_listen_to_this_sub/",
  "subreddit": "CryptoCurrency",
  "id": "sx71xo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As we are currently having some major downtrends in the crypto market its way\nmore important to stick to your plan than ever. But also major movements are the\ntime where this sub is overly bipolar.\n\nThis sub is something way more volatile than crypto. Any minor movement causes a\ncomplete shift from…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在、暗号市場ではいくつかの大きな下降トレンドがあるため、その方法について説明します。\n自分の計画に従うことがこれまで以上に重要です。しかし、大きな動きというのは\nこのサブが過度に二極化する時期。\n\nこのサブは暗号よりもずっと不安定なものです。どんな小さな動きでも\nからの完全なシフト...",
      "title": "暗号に大きな動きがあるときは、絶対にこのサブを聴かない方がいい。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "由于我们目前在加密货币市场上有一些主要的下降趋势，其方式是\n坚持你的计划比以往更重要。但是，主要的运动也是\n时候，这个子是过度的两极化。\n\n这个子是比加密货币更不稳定的东西。任何微小的运动都会导致\n彻底转变，从...",
      "title": "在加密货币的任何重大变动期间，你绝对不应该听这个子。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "由於我們目前在加密貨幣市場上有一些主要的下降趨勢，其方式是\n堅持你的計劃比以往更重要。但是，主要的運動也是\n時候，這個子是過度的兩極化。\n\n這個子是比加密貨幣更不穩定的東西。任何微小的運動都會導致\n徹底轉變，從...",
      "title": "在加密貨幣的任何重大變動期間，你絕對不應該聽這個子。"
    }
  ]
}