{
  "author": "Nostalg33k",
  "original_created_utc": 1641464043,
  "title": "Red days are the true FOMO but you need to control yourselves.",
  "created_utc": 1641501923,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Prices are down, and you can&amp;#39;t buy? &lt;/p&gt;\n\n&lt;p&gt;Do you feel the fear of missing out a good buying opportunity? &lt;/p&gt;\n\n&lt;p&gt;Yeah, then you should control yourselves. People will tell you to buy the dip and they may be right BUT your investments shouldn&amp;#39;t be driven by FOMO. &lt;/p&gt;\n\n&lt;p&gt;If you have a plan, stick to your plan. If you have money to invest in red times, spread the sell orders and don&amp;#39;t throw too much at the market. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t invest more than you can afford to lose. This is even more true during red days. The opportunity seems very good but you never know the bottom of the dip. &lt;/p&gt;\n\n&lt;p&gt;Please act rationally and not with your emotions. DCAing doesn&amp;#39;t mean throwing money at dips in hope that the market goes back up. &lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t need to buy every dip, in the end consistency is more rewarded. Good luck out there!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/rxb7hg/red_days_are_the_true_fomo_but_you_need_to/",
  "subreddit": "CryptoCurrency",
  "id": "rxb7hg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Prices are down, and you can't buy?\n\nDo you feel the fear of missing out a good buying opportunity?\n\nYeah, then you should control yourselves. People will tell you to buy the dip\nand they may be right BUT your investments shouldn't be driven by FOMO.\n\nIf you have a plan, stick to your plan. If you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "価格が下がっているのに買えない？\n\n良い買い場を逃す恐怖を感じていませんか？\n\nそう、それなら自分自身をコントロールすべきです。人々は、ディップを買えと言うでしょう。\nしかし、あなたの投資はFOMOに左右されるべきではありません。\n\n計画があるのなら、その計画に従いましょう。もし...",
      "title": "赤い日こそ真のFOMOだが、自分をコントロールする必要がある。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "价格下降了，而你却买不到？\n\n你是否感到害怕错过了一个好的购买机会？\n\n是的，那么你们应该控制自己。人们会告诉你要买入下跌的股票\n他们可能是对的，但你的投资不应该被恐惧心理所驱动。\n\n如果你有一个计划，就坚持你的计划。如果你...",
      "title": "红色的日子是真正的FOMO，但你们需要控制自己。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "價格下降了，而你卻買不到？\n\n你是否感到害怕錯過了一個好的購買機會？\n\n是的，那麼你們應該控制自己。人們會告訴你要買入下跌的股票\n他們可能是對的，但你的投資不應該被恐懼心理所驅動。\n\n如果你有一個計劃，就堅持你的計劃。如果你...",
      "title": "紅色的日子是真正的FOMO，但你們需要控制自己。"
    }
  ]
}