{
  "author": "sol_my_darling",
  "the_new_excerpt": "As a glasses wearer during the pandemic, having to wear a mask has made my\nglasses constantly fog up, which is super annoying. But then, I realized wearing\na burqua is the equivalent of a whole body mask, which must be hot.\n\nEdit: I think some of you are missing the point. Women won't take their…",
  "original_created_utc": 1618587853,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "パンデミック時にメガネをかけていた私は、マスクをしなければならないことで、メガネが一定になってしまいました。\n眼鏡が常に曇ってしまい、とても困っていました。でも、ブルカを着ると\nでも、ブルカを着るということは、全身マスクをするのと同じことなので、きっと暑いんでしょうね。\n\n編集部：何人かの方は的外れなことを言っているようですね。女性は自分の・・・を取らない",
      "title": "Redditのイスラム教徒の女性の皆さん、ブルカを着用している場合、メガネが曇らないようにするにはどうしたらいいですか？コンタクトをつけるだけですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个在疫情期间戴眼镜的人，不得不戴上口罩，这让我的生活充满了乐趣。\n眼镜经常起雾，超级烦人。但后来，我发现戴\n罩杯相当于全身面膜，一定很热。\n\n小编：我觉得你们有些人没说到重点。女人不会把自己的...",
      "title": "Reddit上的穆斯林女性，如果你穿了一件burka，如何让你的眼镜不雾化？你就戴隐形眼镜吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個在疫情期間戴眼鏡的人，不得不戴上口罩，這讓我的生活充滿了樂趣。\n眼鏡經常起霧，超級煩人。但後來，我發現戴\n罩杯相當於全身面膜，一定很熱。\n\n小編：我覺得你們有些人沒說到重點。女人不會把自己的...",
      "title": "Reddit上的穆斯林女性，如果你穿了一件burka，如何讓你的眼鏡不霧化？你就戴隱形眼鏡嗎？"
    }
  ],
  "title": "Muslim women of Reddit, if you wear a burka, how do you keep your glasses from fogging up? Do you just wear contacts?",
  "created_utc": 1618614789,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As a glasses wearer during the pandemic, having to wear a mask has made my glasses constantly fog up, which is super annoying. But then, I realized wearing a burqua is the equivalent of a whole body mask, which must be hot.</p>\n\n<p>Edit: I think some of you are missing the point. Women won&#39;t take their burka off in public to clean their glasses. If you are just wearing a mask, I know you can just take your glasses off and clean them.</p>\n\n<p>Edit 2: I am not asking about masks or advice on how to clean my glasses. Wearing a mask was simply the catalyst that made me think of this question. This question is directed towards Muslim women.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/ms5vxi/muslim_women_of_reddit_if_you_wear_a_burka_how_do/",
  "subreddit": "TooAfraidToAsk",
  "id": "ms5vxi",
  "is_self": true,
  "media": null,
  "is_video": false
}