{
  "author": "Socialinfluencing",
  "original_created_utc": 1652609779,
  "title": "This sub is a lot more bearable during a bear market.",
  "created_utc": 1652622383,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Obviously we all like green and that&amp;#39;s why we&amp;#39;re invested in this market. But one thing that struck me is how calm or more balanced this sub has become as a result of a bear market.&lt;/p&gt;\n\n&lt;p&gt;During the bullrun of 2021 this place was so full of scammers, bots, hype and just pure psychosis that anything reasonable or slightly contrary was off the table. &lt;/p&gt;\n\n&lt;p&gt;Every second post was a shill coin promising to be the next pump with fake replies and down vote armies at the ready. The swings in profit were so large that even just two days of red candles would ignite insane tribalism.&lt;/p&gt;\n\n&lt;p&gt;Ever since the bear market I noticed there&amp;#39;s some balance going on, people aren&amp;#39;t afraid to be honest about the state of the market or even certain projects. Nice to see a little balance, even if only for now.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 379,
  "permalink": "/r/CryptoCurrency/comments/uq331f/this_sub_is_a_lot_more_bearable_during_a_bear/",
  "subreddit": "CryptoCurrency",
  "id": "uq331f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Obviously we all like green and that's why we're invested in this market. But\none thing that struck me is how calm or more balanced this sub has become as a\nresult of a bear market.\n\nDuring the bullrun of 2021 this place was so full of scammers, bots, hype and\njust pure psychosis that anything…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もちろん、私たちは皆、緑が好きで、それがこの市場に投資している理由です。しかし\nしかし、私が驚いたのは、弱気市場の結果として、このサブがいかに落ち着いているか、あるいはよりバランスが取れているかということです。\n弱気市場の結果です。\n\n2021年のブルランの間、ここは詐欺師、ボット、誇大広告、そして純粋な精神病でいっぱいだった。\n純粋な精神異常で...",
      "title": "このサブは、弱気相場の時には、かなり堪える。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "显然，我们都喜欢绿色，这就是我们在这个市场上投资的原因。但是\n让我印象深刻的一件事是，作为熊市的结果，这个子市场变得多么平静或更加平衡。\n熊市的结果。\n\n在2021年的牛市中，这个地方充满了骗子、机器人、炒作和\n只是纯粹的精神错乱，任何事情...",
      "title": "在熊市中，这种子的承受力要强得多。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "顯然，我們都喜歡綠色，這就是我們在這個市場上投資的原因。但是\n讓我印象深刻的一件事是，作爲熊市的結果，這個子市場變得多麼平靜或更加平衡。\n熊市的結果。\n\n在2021年的牛市中，這個地方充滿了騙子、機器人、炒作和\n只是純粹的精神錯亂，任何事情...",
      "title": "在熊市中，這種子的承受力要強得多。"
    }
  ]
}