{
  "author": "Espeonaga",
  "the_new_excerpt": "I along with probably many others here are new to the trading world. GME sparked\nour interest but we know this isn't how the market usually works. With that\nbeing said, I've been doing some research on the different features and\nfunctions provided in different web applications so I figured I'd share…",
  "original_created_utc": 1614283619,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我和这里的许多人可能都是交易界的新手。GME引发了\n我们的兴趣，但我们知道这不是市场通常的运作方式。有鉴于此\n说，我一直在做一些研究，对不同的功能和\n在不同的Web应用程序中提供的功能，所以我想我应该分享......",
      "title": "股市新手的指标解读"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和這裏的許多人可能都是交易界的新手。GME引發了\n我們的興趣，但我們知道這不是市場通常的運作方式。有鑑於此\n說，我一直在做一些研究，對不同的功能和\n在不同的Web應用程序中提供的功能，所以我想我應該分享......",
      "title": "股市新手的指標解讀"
    }
  ],
  "title": "Indicators Explained For Newbies in Stock Market",
  "created_utc": 1614289622,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I along with probably many others here are new to the trading world. GME sparked our interest but we know this isn&#39;t how the market usually works. With that being said, I&#39;ve been doing some research on the different features and functions provided in different web applications so I figured I&#39;d share some basic info here to try and help some others.</p>\n\n<p>Here is a very basic explanation of the different indicators I have got. I guess some of you already have in your charts.</p>\n\n<p><a href=\"https://cindicator.com/macrosentiment\">Macro sentiment</a> - This gives weekly indicators and works best when you have a stock portfolio also if you have option trading. Their risk factor is also improved, through their collective intelligence indicators platform which is an interactive platform between the team and its users where they ask questions about the future trends of the market.<br/>\n<a href=\"https://www.investopedia.com/articles/technical/102201.asp\">BOLL (Bollinger)</a> - This finds the position of a security within Bollinger Bands. %B is simply a percentage measure of a security’s location between the bands. %B can be lower than 0 or higher than 100 if price moves outside the bands. Generally speaking, a %B near or above 100 can suggest an overbought market, while a value near or below 0 can indicate an oversold market.</p>\n\n<p><a href=\"https://www.tradingview.com/scripts/donchianchannels/\">DC (Donchian Channels)</a> - Are used in technical analysis to measure a market&#39;s volatility. It is a banded indicator, similar to Bollinger Bands %B. Besides measuring a market&#39;s volatility, Donchian Channels are primarily used to identify potential breakouts or overbought/oversold conditions when price reaches either the Upper or Lower Band. These instances would indicate possible trading signals.</p>\n\n<p><a href=\"https://www.investopedia.com/terms/e/ema.asp\">EMA (Exponential Moving Average)</a> - This is a technical chart indicator that tracks the price of an investment (like a stock or commodity) over time. The EMA is a type of weighted moving average (WMA) that gives more weighting or importance to recent price data.</p>\n\n<p><a href=\"https://www.investopedia.com/terms/i/ichimoku-cloud.asp\">IC (Ichimoku Cloud)</a> - A collection of technical indicators that show support and resistance levels, as well as momentum and trend direction. It does this by taking multiple averages and plotting them on the chart. It also uses these figures to compute a &quot;cloud&quot; which attempts to forecast where the price may find support or resistance in the future.</p>\n\n<p><a href=\"https://www.tradingview.com/support/solutions/43000502266-keltner-channels-kc/\">KC (Keltner Channels)</a> - A banded indicator similar to Bollinger Bands and Moving Average Envelopes. They consist of an Upper Envelope above a Middle Line as well as a Lower Envelope below the Middle Line. The Middle Line is a moving average of price over a user-defined time period. Either a simple moving average or an exponential moving average are typically used. The Upper and Lower Envelopes (user defined) are set a range away from the Middle Line. This can be a multiple of the daily high/low range, or more commonly a multiple of the Average True Range.</p>\n\n<p>MA (Moving Average) - A simple technical analysis tool that smooths out price data by creating a constantly updated average price. The average is taken over a specific period of time, like 10 days, 20 minutes, 30 weeks or any time period the trader chooses. There are advantages to using a moving average in your trading, as well as options on what type of moving average to use. Moving average strategies are also popular and can be tailored to any time frame, suiting both long-term investors and short-term traders.</p>\n\n<p>Pivot Point - A technical analysis indicator, or calculations, used to determine the overall trend of the market over different time frames. The pivot point itself is simply the average of the intraday high and low, and the closing price from the previous trading day. On the subsequent day, trading above the pivot point is thought to indicate ongoing bullish sentiment, while trading below the pivot point indicates bearish sentiment.</p>\n\n<p>SAR - The Parabolic SAR is a technical indicator developed by J. Welles Wilder to determine the direction that an asset is moving. The indicator is also referred to as a stop and reverse system, which is abbreviated as SAR. It aims to identify potential reversals in the price movement of traded assets. It can also be used to provide entry and exit points.</p>\n\n<p>SuperTrend - This indicator works well in a trending market but can give false signals when a market is trading in a range. It uses the ATR (average true range) as part of its calculation which takes into account the volatility of the market. The ATR is adjusted using the multiplier setting which determines how sensitive the indicator is.</p>\n</div><!-- SC_ON -->",
  "score": 5292,
  "permalink": "/r/stocks/comments/lsfk88/indicators_explained_for_newbies_in_stock_market/",
  "subreddit": "stocks",
  "id": "lsfk88",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937742092
}