{
  "author": "mirza1h",
  "the_new_excerpt": "Did you know that Facebook is creating their own digital currency? They started\nin 2017, and planned to launch it in 2020, but so far only experimental code has\nbeen released. They had several names for the project GlobalCoin, Facebook Coin,\nLibra and now Diem.\n\nIt's supposed to be a stablecoin.…",
  "original_created_utc": 1617041079,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你知道Facebook正在创建自己的数字货币吗？他们开始\n在2017年，并计划在2020年推出，但到目前为止，只有实验性的代码。\n已发布。他们为这个项目取了几个名字：GlobalCoin、Facebook Coin。\n天秤座，现在是琰。\n\n这应该是一个稳定的币....。",
      "title": "Facebook对数字货币的尝试--天秤座(Diem)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你知道Facebook正在創建自己的數字貨幣嗎？他們開始\n在2017年，並計劃在2020年推出，但到目前爲止，只有實驗性的代碼。\n已發佈。他們爲這個項目取了幾個名字：GlobalCoin、Facebook Coin。\n天秤座，現在是琰。\n\n這應該是一個穩定的幣....。",
      "title": "Facebook對數字貨幣的嘗試--天秤座(Diem)"
    }
  ],
  "title": "Facebook's Attempt at a Digital Currency - Libra (Diem)",
  "created_utc": 1617115383,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Did you know that Facebook is creating their own digital currency? They started in 2017, and planned to launch it in 2020, but so far only experimental code has been released. They had several names for the project GlobalCoin, Facebook Coin, Libra and now Diem.</p>\n\n<p>It&#39;s supposed to be a stablecoin. They collaborated with several big companies like Uber, Paypal, Visa, Stripe, eBay and so many more.</p>\n\n<p>However, most of them left the project in 2019, as it&#39;s been looked down upon by regulators around the world. And as many of you saw on the front page today, Visa chose USDC over Libra.</p>\n\n<p>This attempt of a currency is best described by this tweet:</p>\n\n<p>&quot;Can&#39;t wait for a cryptocurrency with the ethics of Uber, the censorship resistance of Paypal, and the centralization of Visa, all tied together under the proven privacy of Facebook.&quot;</p>\n</div><!-- SC_ON -->",
  "score": 174,
  "permalink": "/r/CryptoCurrency/comments/mfvind/facebooks_attempt_at_a_digital_currency_libra_diem/",
  "subreddit": "CryptoCurrency",
  "id": "mfvind",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357138658
}