{
  "author": "sam-sung",
  "original_created_utc": 1633659396,
  "title": "Bitcoin became legal tender in El Salvador a month ago. It is not going well.",
  "created_utc": 1633675368,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is a post about the cryptocurrency situation in El Salvador. I am posting this again because the previous one was removed by a bot. It is not about price, it should not be marked as such.</p>\n\n<p>Twitter post as proof of living in El Salvador: <a href=\"https://nitter.net/samsungsv19/status/1446177713413308428#\">https://nitter.net/samsungsv19/status/1446177713413308428#</a></p>\n\n<p>A month ago, Bitcoin became another Salvadoran currency. I understand that my previous posts looked like complete FUD, but that&#39;s not my intention. I wanted to share how all of this affected Salvadorans, specially for those who barely have money to get a &quot;decent&quot; mobile device.</p>\n\n<p>Adoption is going pretty bad, specially because of identity theft. There have been hundreds of reports about people using the Chivo Wallet to steal money. The government is being quiet about it, and no one is offering a solution to the problem:</p>\n\n<blockquote>\n<p><a href=\"https://diario.elmundo.sv/denuncian-robo-de-datos-personales-para-uso-no-autorizado-de-chequera-chivo/\">https://diario.elmundo.sv/denuncian-robo-de-datos-personales-para-uso-no-autorizado-de-chequera-chivo/</a></p>\n</blockquote>\n\n<p>That is not a case of phishing or people authorizing full access to the Chivo Wallet, this is way worst. The Chivo Wallet &quot;has facial recognition&quot;, or so they said however it is just storing a picture, any picture. There is no validation whatsoever, and because of that people are no longer using/trusting Bitcoin:</p>\n\n<blockquote>\n<p><a href=\"https://imgur.com/a/7vRTft8\">https://imgur.com/a/7vRTft8</a></p>\n</blockquote>\n\n<p>And yes, I know you are going to say that this does not have anything to do with Bitcoin, but you gotta understand the Salvadoran culture: Once something fails, everything associated to it becomes bad. It doesn&#39;t make sense, I know, but that&#39;s how things really are here, and it is affecting adoption.</p>\n\n<p>Businesses are reporting low adoption. 93.1% of small/medium business are reporting ZERO Cryptocurrency transactions. The free bitcoin bonus was either converted to FIAT or spent in groceries, after that usage crashed.</p>\n\n<p>What about the protests? Did people finally accept the Bitcoin Law passed by the Salvadoran congress?</p>\n\n<p>Not quite.</p>\n\n<p>There were two protests:</p>\n\n<ul>\n<li><p>September 15th</p></li>\n<li><p>September 30th</p></li>\n</ul>\n\n<p>Both protests were massive, huge turnout. People are angry, and mad. Salvadorans do not want The Bitcoin Law:</p>\n\n<p>September 30th Protest against the Bitcoin Law </p>\n\n<blockquote>\n<p><a href=\"https://imgur.com/gallery/izClFXl\">https://imgur.com/gallery/izClFXl</a></p>\n</blockquote>\n\n<p>A protestor in front of Congress throwing spaguetti. The government has been giving people bags of spaghetti and tuna for months. </p>\n\n<blockquote>\n<p><a href=\"https://imgur.com/gallery/vcSpiOw\">https://imgur.com/gallery/vcSpiOw</a></p>\n</blockquote>\n\n<p>More photos of the protests:</p>\n\n<blockquote>\n<p><a href=\"https://imgur.com/gallery/oTBmKXL\">https://imgur.com/gallery/oTBmKXL</a></p>\n\n<p><a href=\"https://imgur.com/gallery/Yflx5gi\">https://imgur.com/gallery/Yflx5gi</a></p>\n\n<p><a href=\"http://imgur.com/gallery/NRUp3yx\">http://imgur.com/gallery/NRUp3yx</a></p>\n\n<p><a href=\"http://imgur.com/gallery/wveAR41\">http://imgur.com/gallery/wveAR41</a></p>\n\n<p><a href=\"http://imgur.com/gallery/IaP1YGR\">http://imgur.com/gallery/IaP1YGR</a></p>\n\n<p><a href=\"http://imgur.com/gallery/ysl1jvC\">http://imgur.com/gallery/ysl1jvC</a></p>\n\n<p><a href=\"http://imgur.com/gallery/3HEf4z7\">http://imgur.com/gallery/3HEf4z7</a></p>\n\n<p><a href=\"http://imgur.com/gallery/hO23Vil\">http://imgur.com/gallery/hO23Vil</a></p>\n\n<p><a href=\"http://imgur.com/gallery/zu263IQ\">http://imgur.com/gallery/zu263IQ</a></p>\n\n<p><a href=\"http://imgur.com/gallery/61W1rmh\">http://imgur.com/gallery/61W1rmh</a></p>\n</blockquote>\n\n<p>What was President Bukele&#39;s response?</p>\n\n<p>Just like Donald Trump, he chose to mock the protests via Twitter:</p>\n\n<blockquote>\n<p><a href=\"http://imgur.com/gallery/NhAqko0\">http://imgur.com/gallery/NhAqko0</a></p>\n</blockquote>\n\n<p>Three protests, and instead of listening to the people, he decide to just ignore them, and make fun of them.</p>\n\n<p>Are Salvadorans protesting because they dont understand technology? Are they afraid of changes? Why they don&#39;t want free money?</p>\n\n<p>Well, salvadorans are protesting because this whole Bitcoin Law thing has been shady. First of all, remember the &quot;Not your keys, not your money&quot; thing that you see pretty often here? We don&#39;t know where the 700 bitcoins that the President Bukele bought are. Who is our broker? How much did we pay for those bitcoins? What about the free 30 dollar bonus? How much did it cost? All information regarding the purchase of Bitcoin is classified. </p>\n\n<p>What about the ATMs? We only know that a known Bitcoin ATM company provided them, but the cost of those 200 ATMs is classified information because of &quot;National Security&quot; (whatever that is). </p>\n\n<p>But hey! El Salvador is mining Bitcoin with vulcanoes! </p>\n\n<p>Yeaaaaaaaaah, about that.... It is true, but it is not a new well, nor new infraestructure. The mining farm is located in a poor town called Berlin, Usulutan. LaGeo is the name of the state-owned company that produces geothermal electricity for the Oriental Region (Usulutan and San Miguel), however due to the mining farm, we are starting to burn more coal to provide enough energy to the region. Electricity costs are rising up, but our President puts profits over people.</p>\n\n<p>Profits over people you say? Covid cases/cases are going up, but Bukele is not restricting movement because that would be a fatal blow to the Chivo Wallet adoption. You see, if people cant go outside they cant go to the Chivo Offices to set up the wallet and learn how to use it. Bukele cares more about profits, and spends his days tweeting about bitcoin prices (Trump would be so proud):</p>\n\n<blockquote>\n<p><a href=\"http://imgur.com/gallery/ma4IgAY\">http://imgur.com/gallery/ma4IgAY</a></p>\n</blockquote>\n\n<p>What is next? Another protest is scheduled for October 17th, and rumor has it that it will be bigger than the previous one. Will Congress concede and roll back the Law? We dont know.</p>\n</div><!-- SC_ON -->",
  "score": 686,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/AtpW_13Q5N6z4stknSi9kzlmfW6TeuGaemDcXCfr4kM.jpg?auto=webp&s=dd16f73d2da3941e0db5e6bb78a592a186344a1c",
          "width": 575,
          "height": 1024
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/AtpW_13Q5N6z4stknSi9kzlmfW6TeuGaemDcXCfr4kM.jpg?width=108&crop=smart&auto=webp&s=ab88f5870b415bd6bf5e18f4db1334ebf3735d69",
            "width": 108,
            "height": 192
          },
          {
            "url": "https://external-preview.redd.it/AtpW_13Q5N6z4stknSi9kzlmfW6TeuGaemDcXCfr4kM.jpg?width=216&crop=smart&auto=webp&s=d0ce02e187f7f0cb86161297c8f389041d8e0c8f",
            "width": 216,
            "height": 384
          },
          {
            "url": "https://external-preview.redd.it/AtpW_13Q5N6z4stknSi9kzlmfW6TeuGaemDcXCfr4kM.jpg?width=320&crop=smart&auto=webp&s=98eb21e09a89e6b1734ed22adadcea58a762de7e",
            "width": 320,
            "height": 569
          }
        ],
        "variants": {},
        "id": "O6tcKCbjvpk8fh38Vg19YXrSBk9gV5n1mf4sfu9trQ8"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/q3o83x/bitcoin_became_legal_tender_in_el_salvador_a/",
  "subreddit": "CryptoCurrency",
  "id": "q3o83x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is a post about the cryptocurrency situation in El Salvador. I am posting\nthis again because the previous one was removed by a bot. It is not about price,\nit should not be marked as such.\n\nTwitter post as proof of living in El…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、エルサルバドルの暗号通貨事情についての投稿です。前回の投稿がボットによって削除されたため、再度投稿しています。\n前のものがボットによって削除されたので、これを再び投稿します。価格のことではありません。\nそのように表示されるべきではありません。\n\nエルサルバドルに住んでいる証拠としてのツイッター投稿...",
      "title": "エルサルバドルでは1ヶ月前にビットコインが法定通貨になりました。うまくいっていません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是一篇关于萨尔瓦多的加密货币情况的文章。我再次发布\n因为之前的帖子被一个机器人删除了。这不是关于价格。\n它不应该被标记成这样。\n\n推特帖子作为生活在萨尔瓦多的证明。",
      "title": "一个月前，比特币在萨尔瓦多成为合法货币。进展并不顺利。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是一篇關於薩爾瓦多的加密貨幣情況的文章。我再次發佈\n因爲之前的帖子被一個機器人刪除了。這不是關於價格。\n它不應該被標記成這樣。\n\n推特帖子作爲生活在薩爾瓦多的證明。",
      "title": "一個月前，比特幣在薩爾瓦多成爲合法貨幣。進展並不順利。"
    }
  ]
}