{
  "author": "saffron1990",
  "original_created_utc": 1631224748,
  "title": "Does anyone feel like ETH could be the the myspace of crypto?",
  "created_utc": 1631244771,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I keep hearing about how bitcoin is the myspace of crypto but bitcoin seems to have a very niche market. It&#39;s decentralised money that free&#39;s billions of people from inflation. no other crypto does this.</p>\n\n<p>Meanwhile ETH does smart contracts but it seems like there&#39;s dozens of other projects nipping at the heels and trying to overtake ethereum, it seems like eth could be overtaken and become myspace while bitcoin will never be overtaken because it wants to be money for countries that are trying to free themselves from US control.</p>\n\n<p>&#x200B;</p>\n\n<p>What it everyone&#39;s thoughts?</p>\n\n<p>&#x200B;</p>\n\n<p>also i have a feeling this could be downvoted to oblivion because this sub loves ethereum but hopefully there&#39;s a bit of meaningful discussion.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/pl7njy/does_anyone_feel_like_eth_could_be_the_the/",
  "subreddit": "CryptoCurrency",
  "id": "pl7njy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I keep hearing about how bitcoin is the myspace of crypto but bitcoin seems to\nhave a very niche market. It's decentralised money that free's billions of\npeople from inflation. no other crypto does this.\n\nMeanwhile ETH does smart contracts but it seems like there's dozens of other\nprojects nipping…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインは暗号のマイスペースだという話をよく聞きますが、ビットコインはとてもニッチな市場のようです。\n非常にニッチな市場であると思います。ビットコインは、何十億人もの人々をインフレから解放する分散型マネーです。\n他の暗号にはないことです。\n\n一方、ETHはスマートコントラクトを行っていますが、他にも何十ものプロジェクトが\nプロジェクトがあります。",
      "title": "ETHが暗号のマイスペースになりそうだと感じる人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直听说比特币是加密货币的Myspace，但比特币似乎有一个非常小众的市场。\n有一个非常小众的市场。它是去中心化的货币，让几十亿人免于通货膨胀。\n没有其他加密货币能做到这一点。\n\n同时ETH做的是智能合约，但似乎有几十个其他的\n的项目在抢夺...",
      "title": "有没有人觉得ETH可能是加密货币的Myspace？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直聽說比特幣是加密貨幣的Myspace，但比特幣似乎有一個非常小衆的市場。\n有一個非常小衆的市場。它是去中心化的貨幣，讓幾十億人免於通貨膨脹。\n沒有其他加密貨幣能做到這一點。\n\n同時ETH做的是智能合約，但似乎有幾十個其他的\n的項目在搶奪...",
      "title": "有沒有人覺得ETH可能是加密貨幣的Myspace？"
    }
  ]
}