{
  "author": "isaac000316",
  "the_new_excerpt": "Under the terms of the transaction, each outstanding share of Aetna common stock\nis being exchanged for $145.00 in cash and 0.8378 shares of CVS Health common\nstock.  CVS Health is not issuing any fractional shares in the transaction.\nInstead, the total number of shares of CVS Health common stock…",
  "original_created_utc": 1619398871,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この取引の条件では、Aetnaの発行済普通株式1株は、現金145ドルおよびCVS Healthの普通株式0.8378株と交換されます。\nAetnaの普通株式は、現金145ドルおよびCVS Healthの普通株式0.8378株と交換されます。\n株式に交換されます。  CVS Healthは、この取引で端数株式を発行しません。\n代わりに、CVS Healthの普通株式の総数は...",
      "title": "CVSが株式を発行せずにAetnaを買収？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "根据交易条款，每股流通的Aetna普通股\n将被换成145.00美元的现金和0.8378股CVS Health普通股。\n股票。  CVS健康公司在此次交易中不发行任何零碎的股票。\n相反，CVS健康公司普通股的总股数...",
      "title": "CVS不发股票就收购了Aetna？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據交易條款，每股流通的Aetna普通股\n將被換成145.00美元的現金和0.8378股CVS Health普通股。\n股票。  CVS健康公司在此次交易中不發行任何零碎的股票。\n相反，CVS健康公司普通股的總股數...",
      "title": "CVS不發股票就收購了Aetna？"
    }
  ],
  "title": "CVS bought out Aetna without issuing stocks?",
  "created_utc": 1619405426,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Under the terms of the transaction, each outstanding share of Aetna common stock is being exchanged for $145.00 in cash and <strong><em>0.8378 shares of CVS</em></strong> Health common stock.  CVS Health is not issuing any fractional shares in the transaction. Instead, the total number of shares of CVS Health common stock that each Aetna shareholder is entitled to receive is being rounded down to the nearest whole number, and each Aetna shareholder is entitled to receive cash for any fractional share of CVS Health common stock that the Aetna shareholder is otherwise entitled to receive.</p>\n\n<p>The transaction values Aetna at $212 per share or approximately $70 billion. Including the assumption of Aetna’s debt, the total value of the transaction is $78 billion. The combined company&#39;s shares are listed on the New York Stock Exchange under the ticker symbol “CVS.” The Aetna brand name will continue to be used in reference to the health insurance products. Going forward, Aetna will operate as a standalone business within the CVS Health enterprise and will be led by members of its current management team.</p>\n\n<p>It says it did not issue any fractional shares, but how was shareholders of Aetna given 0.8378 share of CVS? where did the share come from?</p>\n</div><!-- SC_ON -->",
  "score": 624,
  "permalink": "/r/investing/comments/mym30u/cvs_bought_out_aetna_without_issuing_stocks/",
  "subreddit": "investing",
  "id": "mym30u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776214681
}