{
  "author": "doctor-brightsiide",
  "original_created_utc": 1626618586,
  "title": "Would it be weird to hang my own art in my apartment?",
  "created_utc": 1626639769,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m an artist, currently in school for graphic design and I do quite a bit of illustration work as a hobby. I’m getting my own apartment when I move back to campus this fall, so I’ve been looking at furniture and decor. I’ve got some prints and posters from other artists that I plan to hang up, but I also have several of my own pieces that I’m really proud of. Would it come off as conceited to get prints and hang up a bunch of my own artwork? I’m worried people are going to come over and think I’m crazy.</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/NoStupidQuestions/comments/omrjur/would_it_be_weird_to_hang_my_own_art_in_my/",
  "subreddit": "NoStupidQuestions",
  "id": "omrjur",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m an artist, currently in school for graphic design and I do quite a bit of\nillustration work as a hobby. I’m getting my own apartment when I move back to\ncampus this fall, so I’ve been looking at furniture and decor. I’ve got some\nprints and posters from other artists that I plan to hang up, but…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はアーティストで、現在グラフィックデザインの学校に通っており、趣味でイラストレーションの仕事をかなりしています。\n趣味でイラストを描いています。今年の秋にキャンパスに戻ってきたら、自分のアパートを手に入れる予定です。\nこの秋、キャンパスに戻るときに自分のアパートを手に入れるので、家具やインテリアを見ています。私が持っているのは\n他のアーティストの版画やポスターを飾ってみようと思っているのですが",
      "title": "自分のアートをアパートに飾るのは変かな？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个艺术家，目前在学校学习平面设计，我做了不少的\n插画工作作为一种爱好。当我今年秋天搬回校园时，我将有自己的公寓。\n所以我一直在看家具和装饰。我已经有了一些\n我有一些其他艺术家的印刷品和海报，我打算把它们挂起来，但...",
      "title": "在我的公寓里悬挂我自己的艺术品会不会很奇怪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個藝術家，目前在學校學習平面設計，我做了不少的\n插畫工作作爲一種愛好。當我今年秋天搬回校園時，我將有自己的公寓。\n所以我一直在看傢俱和裝飾。我已經有了一些\n我有一些其他藝術家的印刷品和海報，我打算把它們掛起來，但...",
      "title": "在我的公寓裏懸掛我自己的藝術品會不會很奇怪？"
    }
  ]
}