{
  "author": "Verb0182",
  "the_new_excerpt": "why closing at $14 and $200 DOES NOT MATTER Facts not FUD\n\nI see a lot of confusion about this. (It also wouldn’t have mattered if they\nclosed above $14 or below $200)\n\nFirst those large prints you see on the tape at 4 PM? That’s NORMAL. Every day\nat 16:00:02 the first NYSE closing print goes up.…",
  "original_created_utc": 1616190276,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "为什么收盘价在14美元和200美元并不重要，事实而不是FUD。\n\n我看到很多人对此感到困惑。(也不会有什么关系，如果他们\n收盘价高于14美元或低于200美元)\n\n首先你在下午4点看到的带子上的大指纹？那是正常的。每天都有\n16:00:02纽约证券交易所收盘第一笔涨停....。",
      "title": "为什么收盘价在14美元和200美元并不重要--让我们再做一次。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲什麼收盤價在14美元和200美元並不重要，事實而不是FUD。\n\n我看到很多人對此感到困惑。(也不會有什麼關係，如果他們\n收盤價高於14美元或低於200美元)\n\n首先你在下午4點看到的帶子上的大指紋？那是正常的。每天都有\n16:00:02紐約證券交易所收盤第一筆漲停....。",
      "title": "爲什麼收盤價在14美元和200美元並不重要--讓我們再做一次。"
    }
  ],
  "title": "Why closing at $14 and $200 DOES NOT MATTER- let’s do this again",
  "created_utc": 1616239042,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>why closing at $14 and $200  DOES NOT MATTER</strong> Facts not FUD</p>\n\n<p>I see a lot of confusion about this. (It also wouldn’t have mattered if they closed above $14 or below $200) </p>\n\n<p><strong>First</strong> those large prints you see on the tape at 4 PM? That’s NORMAL. Every day at 16:00:02 the first NYSE closing print goes up. This tends to be larger on all Fridays, triple, and quad witching days due to opex. <a href=\"https://www.nyse.com/network/article/nyse-closing-auction?utm_source=homepage&amp;utm_medium=banner\">https://www.nyse.com/network/article/nyse-closing-auction?utm_source=homepage&amp;utm_medium=banner</a></p>\n\n<p>This is not mAnIPulATIOn. This is how the market works. The reason you see the price jump/ change right at 4:00 is you’re watching the tick data until 3:59:59 then at 4:00:02 they put up the first closing auction print. </p>\n\n<p>On to the options component of our class - </p>\n\n<p>Obviously explaining gamma, delta, dealer hedging and open interest is really not getting through to you smooth brains. So I’m going to try a practical approach.</p>\n\n<p>Use the TWO WRINKLES YOU HAVE and think for ONE SECOND. Would the option market work if every time a dealer sold a call option they just sat around and waited until Friday afternoon to figure out if they needed to have shares to deliver for In the money (ITM) options?? Would that make ANY SENSE?! That people went and bought $200 3/19 GME options 2 weeks ago for $20 and the dealer just sat in their chair staring at their screen? And at 4 PM today dealers short calls from $125 to $200 went “oh well looks like I’m short $300M of GME I have to go buy next week.”</p>\n\n<p>OF COURSE NOT. This is what we mean by delta hedging. They have already bought stock as a hedge. As the price went up they bought more. That’s the “gamma squeeze.”</p>\n\n<p>As people close out their positions on Friday the dealers are unwinding. Some options will be exercised and... good news for the dealers! They have the stock! Because they hedged it!</p>\n\n<p>There’s all sorts of slightly technical reasons there’s small overhangs at 4:00 but it’s mostly done. </p>\n\n<p>Second practical point- HOW MANY FUCKING TIMES DOES THIS HAVE TO HAPPEN FOR YOU TO REALIZE ITS NOT HOW IT WORKS? Every Friday we hear “if the stock closes above/ below X then Y will happen next week.” And it doesn’t. Because QUITE OBVIOUSLY if that was the case you would see HUGE movements AH. Spoiler alert- you guys aren’t the only ones that can see open interest. Put on your practical hat again. Don’t you think if the entire street saw 30M options ITM and thought that many shares needed to be bought Monday they would do it... now?</p>\n\n<p>Options markets matter and you should learn more because it can illuminate what’s happening in stocks (Ie earlier this week someone bought a whole lot of GME calls and set off this rally) but price at expiry matters very little. There’s slightly more to it (you can look up “pin risk” and “Max pain” if you’re interested I’m trying to get the most basic concepts across here). The reason AMC traded in such a tight range is because it got pinned at the $14 price due to large OI. This is not manipulation and is just due to mechanical hedging by dealers.</p>\n</div><!-- SC_ON -->",
  "score": 2011,
  "permalink": "/r/wallstreetbets/comments/m8rx62/why_closing_at_14_and_200_does_not_matter_lets_do/",
  "subreddit": "wallstreetbets",
  "id": "m8rx62",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752826410
}