{
  "author": "Picklesadog",
  "original_created_utc": 1653418478,
  "title": "Did archers shoot at an angle or straight on?",
  "created_utc": 1653440475,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I recently watched a video of a historian (not a youtube &amp;quot;historian&amp;quot; but a historian on youtube) talking about the battle of Agincourt and how the archers were firing basically straight on from maybe 40-80m out. He was saying the force of impact, especially with large arrows which lose momentum fast, is much better straight on, and arched shots are more likely to glance off armor. &lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s the video: &lt;a href=\"https://youtu.be/v0Xwx12ekSU\"&gt;https://youtu.be/v0Xwx12ekSU&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I also know the idea of firing in volleys is a myth, based on firearm warfare and propagated back.&lt;/p&gt;\n\n&lt;p&gt;My question is... was this true for basically all pre-firearm warfare? Were archers almost always firing head on at a shorter range? Are all the movies and Total War games in which archers engage from a distance with giant arched shots based on a misconception?&lt;/p&gt;\n\n&lt;p&gt;From what I understand, we know little of actual warfare tactics besides on the macro level. Do we know how archers in... say, the Greek and Roman eras... actually fought? Nearly all the ancient depictions of archers in warfare I&amp;#39;ve seen, regardless of the era, feature them shooting straight ahead.&lt;/p&gt;\n\n&lt;p&gt;So what&amp;#39;s the deal?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/uwy40j/did_archers_shoot_at_an_angle_or_straight_on/",
  "subreddit": "AskHistorians",
  "id": "uwy40j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I recently watched a video of a historian (not a youtube \"historian\" but a\nhistorian on youtube) talking about the battle of Agincourt and how the archers\nwere firing basically straight on from maybe 40-80m out. He was saying the force\nof impact, especially with large arrows which lose momentum…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、ある歴史家（youtubeの「歴史家」ではなく、youtubeの「歴史家」）のビデオを見ました。\nアジャンクールの戦いで、弓兵が40～80mの距離から真正面から撃ってきたという話です。\nを、40～80mの距離から真正面から撃っていたそうです。そのとき、彼はこう言っていました。\n特に大きな矢は勢いを失うと...",
      "title": "弓矢は斜めに射るのか、それとも真直ぐに射るのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近看了一个历史学家的视频（不是YouTube上的 \"历史学家\"，而是一个\n谈到阿金库尔战役以及弓箭手如何\n基本上是从40-80米外直射的。他说\n冲击力，尤其是失去动力的大箭......",
      "title": "弓箭手是斜着射还是直着射？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近看了一個歷史學家的視頻（不是YouTube上的 \"歷史學家\"，而是一個\n談到阿金庫爾戰役以及弓箭手如何\n基本上是從40-80米外直射的。他說\n衝擊力，尤其是失去動力的大箭......",
      "title": "弓箭手是斜着射還是直着射？"
    }
  ]
}