{
  "author": "SueECydal",
  "original_created_utc": 1651365262,
  "title": "Is dating soul-crushing for everyone or am I just overly sensitive?",
  "created_utc": 1651379047,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve only started dating recently and I’m ready to delete all the apps and just die alone. I hate going on pointless first dates. &lt;/p&gt;\n\n&lt;p&gt;I was also starting to feel more confident in myself until I started dating, now I just have a whole lot of self-doubt. If a guy doesn’t want a second date I get depressed over it for months wondering what he must’ve disliked about me, even if I wasn’t that into him. &lt;/p&gt;\n\n&lt;p&gt;Am I just overly sensitive or is it absolutely terrible for everyone?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/NoStupidQuestions/comments/ufo23t/is_dating_soulcrushing_for_everyone_or_am_i_just/",
  "subreddit": "NoStupidQuestions",
  "id": "ufo23t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve only started dating recently and I’m ready to delete all the apps and just\ndie alone. I hate going on pointless first dates.\n\nI was also starting to feel more confident in myself until I started dating, now\nI just have a whole lot of self-doubt. If a guy doesn’t want a second date I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近付き合い始めたばかりですが、もうアプリは全部削除し\n一人で死にたい 無意味な初デートをするのは嫌だ。\n\nまた、付き合うまでは自分に自信を持ち始めていたのに、今は\n自分に自信がないんだ。もし男が2回目のデートを望まないなら...",
      "title": "デートは誰にとっても魂を揺さぶるものなのか、それとも私が過敏なだけなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近才开始约会，我已经准备好删除所有的应用程序，只是\n孤独地死去。我讨厌去参加毫无意义的第一次约会。\n\n在我开始约会之前，我也开始对自己更有信心，现在\n我只是有一大堆的自我怀疑。如果一个男人不希望有第二次约会，我...",
      "title": "约会对每个人来说都是心灵的折磨，还是我过于敏感了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近纔開始約會，我已經準備好刪除所有的應用程序，只是\n孤獨地死去。我討厭去參加毫無意義的第一次約會。\n\n在我開始約會之前，我也開始對自己更有信心，現在\n我只是有一大堆的自我懷疑。如果一個男人不希望有第二次約會，我...",
      "title": "約會對每個人來說都是心靈的折磨，還是我過於敏感了？"
    }
  ]
}