{
  "author": "DisAThrowayBrodie",
  "the_new_excerpt": "When my little sister was presented an iPad as Christmas present, she fell in\nlove with it. I caught her once watching Peppa pig and thought okay that doesn’t\nseem too harmful. A few minutes later I came back and it showed Peppa pig\ngouging out the father pigs eyes out and the baby pig talking in a…",
  "original_created_utc": 1611082046,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "当我的小妹妹被赠予一台iPad作为圣诞礼物时，她爱上了这台iPad。\n爱上了它。有一次我抓到她在看Peppa pig，我想好吧，这不。\n似乎太有害了。几分钟后，我回来了，它显示Peppa猪\n挖出猪爸爸的眼睛，猪宝宝在说话... ...",
      "title": "为什么有的Youtubers拍的视频非常NSFL，是针对小孩子的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我的小妹妹被贈予一臺iPad作爲聖誕禮物時，她愛上了這臺iPad。\n愛上了它。有一次我抓到她在看Peppa pig，我想好吧，這不。\n似乎太有害了。幾分鐘後，我回來了，它顯示Peppa豬\n挖出豬爸爸的眼睛，豬寶寶在說話... ...",
      "title": "爲什麼有的Youtubers拍的視頻非常NSFL，是針對小孩子的？"
    }
  ],
  "title": "Why do some Youtubers make very NSFL videos that are aimed towards little kids?",
  "created_utc": 1611090223,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When my little sister was presented an iPad as Christmas present, she fell in love with it. I caught her once watching Peppa pig and thought okay that doesn’t seem too harmful. A few minutes later I came back and it showed Peppa pig gouging out the father pigs eyes out and the baby pig talking in a really deep voice. I took the iPad away and scrubbed the history and tried to remove any trace of Peppa pig on the iPad. It came up again and this guy was talking about how the next video will be a treat and there will be more mutilation to come. I took the iPad away for about 3 months after that.</p>\n\n<p>I forgot about the whole ordeal until this morning when my little sister was talking about a dog who’s legs were being cut off. It took me by surprise because she’s usually disgusted with anything blood and she loves animals. She described the dog having “red” all over its hair(fur). The strange thing was I had just put on blippi( a children’s YouTuber) for her to watch and checked the side bar for anything that might be unsafe and there wasn’t anything that might’ve showed anything like that.  I asked her what she pressed and she told me she clicked on the video with the Barbie dolls and at apparently at one point in the video, instead of Barbie dolls, it switched to a dog being maimed. I told her to show me and she ran off and I barely saw a glimpse of the video before she promptly closed the tab(I’m still pretty fucking mad that she did that). </p>\n\n<p>I have her iPad with me right now and I’m curious as to why people portray a video for kids, but instead include some NSFL content mid-video? I’ve heard stories of it happening to other people’s children as well.</p>\n</div><!-- SC_ON -->",
  "score": 721,
  "permalink": "/r/TooAfraidToAsk/comments/l0qach/why_do_some_youtubers_make_very_nsfl_videos_that/",
  "subreddit": "TooAfraidToAsk",
  "id": "l0qach",
  "is_self": true,
  "media": null,
  "is_video": false
}