{
  "author": "YearOk5106",
  "the_new_excerpt": "Yes, it is wrong. But why? Some people such as corrupt politicians, poachers, or\nthose who exploit child labour for their own profit, genuinely deserve to be\neliminated, which would also ameliorate the lives of many.\n\nWhen they do live, it's at the expense of better people than themselves.…",
  "original_created_utc": 1621690494,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "はい、間違っています。でも、なぜ？腐敗した政治家や、密猟者、動物を利用する人など、一部の人は\n腐敗した政治家や密猟者、児童労働を利用して自分の利益を追求する人など、純粋に排除されるべき人もいます。\nそうすれば、多くの人の生活が改善されます。\n\n彼らが生きるということは、彼ら自身よりも優れた人々の犠牲の上に成り立っているのです。....",
      "title": "人間を殺すことがなぜ悪いのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，这是不对的。但为什么呢？有些人，如腐败的政客、偷猎者或\n那些为了自己的利益而剥削童工的人，确实应该被消灭。\n淘汰，这也会改善许多人的生活。\n\n当他们确实活着的时候，是以比自己更好的人为代价的....。",
      "title": "为什么杀死一个人是错误的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，這是不對的。但爲什麼呢？有些人，如腐敗的政客、偷獵者或\n那些爲了自己的利益而剝削童工的人，確實應該被消滅。\n淘汰，這也會改善許多人的生活。\n\n當他們確實活着的時候，是以比自己更好的人爲代價的....。",
      "title": "爲什麼殺死一個人是錯誤的？"
    }
  ],
  "title": "Why is it wrong to kill a human being?",
  "created_utc": 1621735913,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yes, it is wrong. But why? Some people such as corrupt politicians, poachers, or those who exploit child labour for their own profit, genuinely deserve to be eliminated, which would also ameliorate the lives of many.</p>\n\n<p>When they do live, it&#39;s at the expense of better people than themselves. Also, overpopulation is a factor.</p>\n\n<p>Assassination is a quick, highly effective way towards a positive change for many countries run by people such as Putin or Lukashenko where a political change through democratic means is not possible.</p>\n\n<p>Are we afraid to discuss the value of human life and that it is, in fact, relative?</p>\n\n<p>Btw I&#39;m not afraid to ask, but this looks like a suitable kind of r/ for such a question.</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/niirfc/why_is_it_wrong_to_kill_a_human_being/",
  "subreddit": "TooAfraidToAsk",
  "id": "niirfc",
  "is_self": true,
  "media": null,
  "is_video": false
}