{
  "author": "Asheddit",
  "original_created_utc": 1631380998,
  "title": "I should have listened to my grandma's investment advice!",
  "created_utc": 1631409358,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Back in April 2013, my then 73 year old sent me this email asking me to check out what Bitcoin was all about. For some reason I completely ignored her email. I looked at my Google account history and found no traces of searches for Bitcoin after I had received her email.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/qbbz5hs1swm71.jpg?width=1440&amp;format=pjpg&amp;auto=webp&amp;s=9be54825286d242e3bdf753620e7ba8d1f83f0fb\">https://preview.redd.it/qbbz5hs1swm71.jpg?width=1440&amp;format=pjpg&amp;auto=webp&amp;s=9be54825286d242e3bdf753620e7ba8d1f83f0fb</a></p>\n\n<p>I finally started investing in crypto in mid-2017 and also got her to invest. Glad she was able to make some significant gains since then even though we had to endure a rather lengthy bear market.</p>\n\n<p>TL;DR: Grandmas don&#39;t always signal the peak of the market cycle.</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/CryptoCurrency/comments/pmbijy/i_should_have_listened_to_my_grandmas_investment/",
  "subreddit": "CryptoCurrency",
  "id": "pmbijy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Back in April 2013, my then 73 year old sent me this email asking me to check\nout what Bitcoin was all about. For some reason I completely ignored her email.\nI looked at my Google account history and found no traces of searches for\nBitcoin after I had received her…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2013年4月、当時73歳だった私に、「ビットコインを調べてみて」というメールが届きました。\nビットコインがどんなものか調べてみて」と。なぜか私はそのメールを完全に無視していました。\n自分のGoogleアカウントの履歴を見ても、メールを受け取った後にビットコインを検索した形跡はありませんでした。\n受け取った後にビットコインを検索した形跡はありませんでした...",
      "title": "おばあちゃんの投資のアドバイスを聞いておけばよかった！」と思いました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "早在2013年4月，我当时73岁的老人给我发了这封邮件，让我去看看\n看看比特币到底是怎么回事。由于某些原因，我完全忽略了她的邮件。\n我查看了我的谷歌账户历史，没有发现任何搜索的痕迹\n在我收到她的邮件后，没有任何搜索比特币的痕迹...",
      "title": "我应该听从我奶奶的投资建议!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "早在2013年4月，我當時73歲的老人給我發了這封郵件，讓我去看看\n看看比特幣到底是怎麼回事。由於某些原因，我完全忽略了她的郵件。\n我查看了我的谷歌賬戶歷史，沒有發現任何搜索的痕跡\n在我收到她的郵件後，沒有任何搜索比特幣的痕跡...",
      "title": "我應該聽從我奶奶的投資建議!"
    }
  ]
}