{
  "author": "Linus_Naumann",
  "original_created_utc": 1626959535,
  "title": "A critical look at Bitcoins ongoing greenwashing campaign",
  "created_utc": 1626985864,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone,</p>\n\n<p>I was wondering if I am the only one who recognizes an ongoin greenwashing-campaign for Bitcoin to mitigate societal and political pressure against professional mining and I want to hear your opinion on this very important topic. Professional mining is under heavy political pressure in important regions such as China and Europe and BTC hashrate has already dropped considerably as a consequence.</p>\n\n<p><strong>Why Bitcoin will always use the maximum amount of energy economically feasible</strong></p>\n\n<p>As you all know, Bitcoin uses proof of work (PoW) to secure its ledger and will therefore always use as much energy as is barely profitable for miners. It is fundamentally designed to be immune to progress in science or improvements in efficiency. Block-difficulty will always be adjusted to lead to new blocks being generated every 10 minutes. If hardware gets better at finding blocks or energy becomes cheaper, then energy consumption will simply always go up again to make up for it.</p>\n\n<p><strong>Example:</strong></p>\n\n<p>If block-rewards + transaction fees of a given block are worth $100.000 it is economically worth spending slightly less than 10% of that (for example $9.900) to get a 10% chance in winning these rewards by winning the hash-race.</p>\n\n<p>This means, if BTC rises in price, the worth of these rewards will rise proportionally and miners subsequently have an incentive to use up more Dollars worth of energy.</p>\n\n<p>Currently BTC marketcap is less than that of gold and it is already profitable for miners to use up the energy equivalent of small western countries. If you assume BTC becoming a global main-layer of finances this would naturally increase price and therefore energy consumption manyfold and would maybe reach the consumption of big nations like USA or China or.</p>\n\n<p><strong>Why is that a problem</strong></p>\n\n<p>We are currently living in the beginnings of the 6th global mass-extinction event in the history of our planet. Climate crisis is real, human-made and we already see huge damages for humans and wildlife around the world in droughts, floods, wildfires and consequently mass-migration and the collaps of societies. This process has no hard limits: We can potentially wipe out modern civilization if we hit +3-5°C increase in average global temperature.</p>\n\n<p>The science about it is clear: we need to cut down our climate-gas emissions. This can largely be done by replacing fossil fuels (in cars and power-plants) with renewable sources of electricity, like solar-panels, water-power and wind-power plants, among other actions.</p>\n\n<p><strong>How BTC mining is greenwashed</strong></p>\n\n<p>Big BTC stake-holders, miners, bag-holding influencers and whales try to argue, that BTC footprint on our climate is not so bad by focussing on two main arguments. Both these arguments however dont tackle the fundamental problems of large-scale PoW at all, as I want to show here.</p>\n\n<p><strong><em>Argument 1: &quot;Mining runs on mostly renewable energies, therefore there is no damage on the environment&quot;</em></strong></p>\n\n<p><strong>Counterargument 1: We need our renewables to turn off coal plants first</strong>.</p>\n\n<p>Our goal must be to shut down coal- and gas power plants as fast as possible, without endangering our energy-security. Globally, plan A to do so is to replace fossil fuel plants with renewable energies, such as solar, wind and water-power.</p>\n\n<p>However if the power of newly build wind-turbines or water-power plants is used up for mining, they CAN NOT simultaneously be used to replace fossil-fuels! It is either-or. From environmental perspective any renewable energy plant that is used for mining instead of shutting down coal plants is a tragic waste, since time is of the essence and damages around the world are already accumulating.</p>\n\n<p><strong>Counterargument 2: Renewable energies are still damaging for our environment</strong></p>\n\n<p>Wind turbines kill large birds and bats, water-power destroys aquatic eco-systems, solar panels are notoriously hard to recycle and basically toxic waste after 20 years of use. All forms of energy generation use up ressources and introduce damage to the environment. The only argument why we prefer them over coal is that climate-change is the bigger evil here. This means or aim is the efficient use of energy and to REDUCE our impact. However, by design BTC willalways only ADD to our energy usage and will continue to do so increasingly with more adoption.</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>Argument 2: &quot;Mining can use up excess energy, that would be wasted anyway&quot;</em></strong></p>\n\n<p><strong>Counter-argument: Excess energy can be stored or used in other ways than mining</strong></p>\n\n<p>It is true that on good days many renewables produce more energy, than can be immediatly used. Currently this energy has to be discarded right away and is therefore wasted. What greenwashing-apologists always fail to mention however: There is huge technological progress made in modern energy storage technologies. From producing hydrogen, to water-pump storage, to batteries - there are several promising ways to store energy for later, productive use. In fact, storing temporary surplus in energy is <strong>crucial</strong> to make large-scale energy grits more reliable. If we cannot store any energy, then our minimum level of energy generation (for example on a dark day with no wind) must still be higher than our maximum usage of energy on a busy day. This requires a whole lot more power plants to be installed, all with their downsides and costs.</p>\n\n<p>However, if we store this excess energy effectively, we can use it to buffer bad days - All without needing more power plants. This whole concept gets undermined (pun intended), if we use up this excess energy for mining instead of storing it.</p>\n\n<p><strong>Alternatives to BTC - PoW is not the only technology to secure a public ledger</strong></p>\n\n<p>Distributed ledger technology (DLT) bears huge potential for advancements of our society and will undoubtly be the future of finance, supply chain, data-economics, tokenized economics and many more. However, these can be performed with other technologies too, that often use up only a millionth or less of Bitcoins PoW protol. Notable mentions are Proof of stake (PoS, Ethereum 2.0, Cardano, etc), IOTAs leaderless consensus, Chiacoins proof of space and time, and others. I will not discuss the ups- and downs of the individual alternatives here, however it is important to note that science never stops and PoW does not have to be the end-all-be-all solution for securing DLTs for all time.</p>\n\n<p><strong>Conclusion</strong></p>\n\n<p>In summary, PoW has a very heavy burden on our climate and if we want to harness the promisses of DLT without adding to the destruction of our habitat, we should critically question if the current greenwashing-arguments in favor of Bitcoin ACTUALLY solve the problem or if they are spread by people with heavy personal interest in BTC continuing to grow.</p>\n\n<p>We all should remain open to new science and technological progress and think globally and long-term out the technology we want to use at the foundation of our society.</p>\n\n<p>Thanks for reading, I´m interested in your opinion (always open to change my view when confronted with good arguments).</p>\n\n<p>Enjoy your day!</p>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/CryptoCurrency/comments/opdjn0/a_critical_look_at_bitcoins_ongoing_greenwashing/",
  "subreddit": "CryptoCurrency",
  "id": "opdjn0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi everyone,\n\nI was wondering if I am the only one who recognizes an ongoin\ngreenwashing-campaign for Bitcoin to mitigate societal and political pressure\nagainst professional mining and I want to hear your opinion on this very\nimportant topic. Professional mining is under heavy political pressure…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n私は、社会的、政治的な圧力を軽減するために、ビットコインのグリーンウォッシュキャンペーンを認識している唯一の人間ではないかと思っています。\nプロのマイニングに対する社会的、政治的圧力を緩和するためのビットコインのグリーンウォッシングキャンペーンを認識しているのは私だけでしょうか？\nこの非常に重要なトピックについて皆さんのご意見を伺いたいと思います。\nこの非常に重要なトピックについて皆さんのご意見を伺いたいと思います。プロのマイニングは強い政治的圧力を受けています...",
      "title": "ビットコインのグリーンウォッシュキャンペーンを批判的に考察する"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n我在想，是否只有我一个人认识到了正在进行的\n矿机的洗绿运动，以减轻社会和政治压力。\n我想听听你们对这个非常重要的话题的看法。\n我想听听你们对这个重要话题的看法。专业采矿业正受到沉重的政治压力...",
      "title": "批判性地审视比特币正在进行的绿色洗牌运动"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n我在想，是否只有我一個人認識到了正在進行的\n礦機的洗綠運動，以減輕社會和政治壓力。\n我想聽聽你們對這個非常重要的話題的看法。\n我想聽聽你們對這個重要話題的看法。專業採礦業正受到沉重的政治壓力...",
      "title": "批判性地審視比特幣正在進行的綠色洗牌運動"
    }
  ]
}