{
  "author": "ConsiderationFew3336",
  "original_created_utc": 1643981568,
  "title": "Are there actually people out there how live that fun, wild, exciting and fast-paced NYC life-style always portrayed in pop culture?",
  "created_utc": 1643990568,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am not even talking about being able to afford it (we all know SATC was unrealistic).&lt;/p&gt;\n\n&lt;p&gt;I am talking about having the energy, the friends and the contacts to do that. &lt;/p&gt;\n\n&lt;p&gt;As a 20-something living in a big city I never get invited to fancy parties, club openings or charity events. I wouldn&amp;#39;t even know where to start.&lt;/p&gt;\n\n&lt;p&gt;The fanciest I do is going out to a nice cocktail bar but nights there usually involve talking to the people I came with. Not flirting with strangers or going dancing.&lt;/p&gt;\n\n&lt;p&gt;Maybe my life is just borring, but maybe no one acutally lives like this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 119,
  "permalink": "/r/TooAfraidToAsk/comments/skde3y/are_there_actually_people_out_there_how_live_that/",
  "subreddit": "TooAfraidToAsk",
  "id": "skde3y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am not even talking about being able to afford it (we all know SATC was\nunrealistic).\n\nI am talking about having the energy, the friends and the contacts to do that.\n\nAs a 20-something living in a big city I never get invited to fancy parties,\nclub openings or charity events. I wouldn't even know…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "余裕があるという話でもない（SATCがそうだったのは周知の通り）。\n非現実的です）。\n\nそのためのエネルギー、友人、人脈があるかという話です。\n\n大都市に住む20代の私は、豪華なパーティに招待されることはない。\nクラブのオープニングやチャリティーイベントなど。私は知る由もない...",
      "title": "ポップカルチャーで描かれるような、楽しくて、ワイルドで、エキサイティングで、マイペースなNYCライフを送る人たちは、実際にいるのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我甚至不是在说能不能买得起（我们都知道SATC是\n不现实的）。\n\n我说的是有精力、有朋友、有关系来做这件事。\n\n作为一个生活在大城市的20多岁的人，我从来没有被邀请参加豪华的聚会。\n俱乐部开幕式或慈善活动。我甚至不知道...",
      "title": "是否真的有人在那里过着流行文化中总是描绘的那种有趣、狂野、令人兴奋和快节奏的纽约市生活方式？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我甚至不是在說能不能買得起（我們都知道SATC是\n不現實的）。\n\n我說的是有精力、有朋友、有關係來做這件事。\n\n作爲一個生活在大城市的20多歲的人，我從來沒有被邀請參加豪華的聚會。\n俱樂部開幕式或慈善活動。我甚至不知道...",
      "title": "是否真的有人在那裏過着流行文化中總是描繪的那種有趣、狂野、令人興奮和快節奏的紐約市生活方式？"
    }
  ]
}