{
  "author": "omgcoin",
  "original_created_utc": 1625993235,
  "title": "CBDCs are complete anti-thesis to everything crypto stands for, even paper cash is superior to CBDCs",
  "created_utc": 1626032345,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Central Bank Digital Currencies (CBDCs) are often mentioned in crypto news as if they are part of broader crypto adoption.</p>\n\n<p>Some naive and confused &quot;crypto influencers&quot; are trying to defend their politicians by saying - yes, he/she is against Bitcoin but they support &quot;blockchain technology&quot;, so they are on our side.</p>\n\n<p>Some crypto foundations even help central banks to develop CBDCs and their reddit cheerleaders are excited about it, naively hoping that it will pump the price. What&#39;s even more pathetic is that crypto projects who wasn&#39;t chosen by central banks look with jealousy at other crypto projects who got &quot;blessing&quot; from central banks.</p>\n\n<p>Establishment (MSM, &quot;economists&quot;, institutions like BIS) are trying to sell idea of CBDCs to naive crypto kids as - so you like crypto because &quot;digital, digital, everything is digital&quot;, we offer you superior version of crypto as CBDCs backed by well-respected Central Bank. And many excited by idea of &quot;cashless society&quot; because paper cash isn&#39;t cool, &quot;outdated&quot; concept.</p>\n\n<p>While majority of people are skeptical about big corporations (especially when it comes surveillance), the same people usually have absolutely zero suspicion about the government itself. They think that government institutions are somehow above the market, above greed, above desire for power grab. Those naive intellectuals think that the state is some neutral abstraction which can step in and tame corporate greed. They foolishly think that if you just write your &quot;rights&quot; on a piece of paper called the constitution, then everything will be alright. They have absolutely no idea that the only thing what really matters is balance of power (not paper power written in constitution but actual power). Any organization have insatiable appetite for power, regardless if it&#39;s private or public organization. And any organization will try to use any excuse to legitimize its power grab. This is what academic &quot;economists&quot; and other intellectuals will never, never able to grasp. In fact, the more time a person spent in academia, less chances to understand this.</p>\n\n<p>This is what Satoshi Nakamoto understood. That&#39;s why he created <strong>trustless, censorship resistant, decentralized</strong> protocol. Bitcoin isn&#39;t about &quot;blockchain technology&quot;, it&#39;s about censorship resistance and real ownership (as opposed to &quot;fiat ownership&quot;). If anything, blockchain itself is rather a liability, a cost you have to pay to preserve Bitcoin (or other crypto) properties, so blockchain isn&#39;t benefit on its own (except some niche non-monetary applications).</p>\n\n<p>CBDCs are, on the other hand, <strong>fiat on steroids</strong>. CBDCs are <strong>ultra-centralized, ultra-trust, surveillance money</strong>. CBDCs is perfect opposite to crypto. Even paper cash is closer to crypto than CBDCs.</p>\n\n<p>Right now, Barclays or HSBC might freeze your transaction to Binance for &quot;your own safety&quot;. It&#39;s very unpleasant but at least you can find smaller bank who might or might not willing to facilitate your transactions. If you can&#39;t find any bank, you can try to use PayPal or other payment provider who is willing to work with you. In the worst case scenario, you might still bring paper cash to WesternUnion. Now, imagine if you have CBDC which has total control over your money and no paper cash. If they start &quot;caring about you for your own safety&quot;, there is absolutely no place to escape. Imagine if you replace all financial institutions, abolish paper cash and put HSBC in charge of everything.</p>\n\n<p>Some might answer something about democracy, that HSBC is private, while CBDC is public etc. That&#39;s why I already mentioned about balance of raw power as opposed to paper power written on piece of paper. Intellectuals use democracy, constitution as magic spells, as something given for eternity just because of some piece of paper. Let me tell what CBDCs will do to remains of liberal democracy. You want to donate money to anti-establishment politician, the government will know your political view in instant, your transfer might be blocked and you will be automatically in their &quot;watch list&quot;. Right now, banks can do this as well. However, there are many banks, even if they are mostly very nasty, they aren&#39;t exactly the same. Moreover, it&#39;s a messy, slow process for government to obtain records about your transactions from private financial institutions. CBDCs remove all remaining obstacles for omnipotent government. <strong>CBDCs will streamline total, inescapable surveillance</strong>.</p>\n\n<p>So as a result, you might be upset about corruption of democratic institutions. That&#39;s why you decided to go to protest against the government. However, you still have to buy tickets to subway to go to protest. Too bad for you, the government will already know you are &quot;active, undesirable element&quot;. So next time, when you try to book airline flights for vacation, the government will freeze your payment because you are already in their &quot;watch list&quot; (so that they will &quot;train&quot; you to be compliant).</p>\n\n<p>Now, let&#39;s talk about wet dream of academics - forced Keynsianism. In order to &quot;stimulate&quot; spending, CBDC can set expiry date on your savings. So you have to spend your savings on useless goods. All your attempts to escape expiry date by buying stocks, gold, crypto will be blocked because this is not what you are &quot;supposed&quot; to do. Same applies to inflation. If you try to escape inflation by buying assets, you might be labeled as &quot;unpatriotic&quot;, so you will be forced to keep rapidly depreciating CBDC.</p>\n\n<p>As a last resort, you might want to convert your wealth into crypto by buying ASICs, GPUs or lots of SSDs (for proof-of-space cryptos). Too bad for you, the government will immediately see your intent.</p>\n\n<p>If it sounds too dystopian and unrealistic for you. I can say one thing - governments almost never grab power quickly. They will slowly &quot;train&quot; you to accept new reality. More than a hundred years ago, there were debates whether or not having central bank. Now existence of central banks is taken for granted by both sides of political spectrum.</p>\n\n<p>Cryptocurrencies are the last hope for humanity to escape dystopian nightmare. The only way cryptocurrencies can survive if they become mainstream within 5-10 years. In other words, there should be significant amount of real crypto holders/users (not crypto gamblers) to be serious political movement. It&#39;s also important if much more corporations hold crypto because they have lobbying power to protect their investments (for their selfish reasons, even if they are nasty).</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/oi0xq4/cbdcs_are_complete_antithesis_to_everything/",
  "subreddit": "CryptoCurrency",
  "id": "oi0xq4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Central Bank Digital Currencies (CBDCs) are often mentioned in crypto news as if\nthey are part of broader crypto adoption.\n\nSome naive and confused \"crypto influencers\" are trying to defend their\npoliticians by saying - yes, he/she is against Bitcoin but they support\n\"blockchain technology\", so they…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "中央銀行デジタル通貨（CBDC）は、暗号ニュースの中で、より広範な暗号採用の一部であるかのように語られることが多い。\n広範な暗号採用の一部であるかのように暗号ニュースで言及されることが多い。\n\n世間知らずで混乱している「暗号インフルエンサー」の中には、「その人はビットコインに反対しているが、自分たちはビットコインを支持している」と言って政治家を守ろうとする人もいる。\nその人はビットコインに反対しているが、「ブロックチェーン技術」を支持している。\n\"ブロックチェーン技術」を支持しているので...",
      "title": "CBDCは暗号の象徴であるすべてのものの完全な反面教師であり、ペーパーキャッシュでさえCBDCより優れている。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "中央银行数字货币（CBDCs）经常在加密货币新闻中被提及，好像它们是更广泛的加密货币采用的一部分。\n它们是更广泛的加密货币采用的一部分。\n\n一些天真的、困惑的 \"加密货币影响者 \"正试图为他们的\n说 - 是的，他/她反对比特币，但他们支持\n\"区块链技术\"，所以他们...",
      "title": "CBDCs与加密货币所代表的一切完全相反，即使是纸币现金也比CBDCs优越。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "中央銀行數字貨幣（CBDCs）經常在加密貨幣新聞中被提及，好像它們是更廣泛的加密貨幣採用的一部分。\n它們是更廣泛的加密貨幣採用的一部分。\n\n一些天真的、困惑的 \"加密貨幣影響者 \"正試圖爲他們的\n說 - 是的，他/她反對比特幣，但他們支持\n\"區塊鏈技術\"，所以他們...",
      "title": "CBDCs與加密貨幣所代表的一切完全相反，即使是紙幣現金也比CBDCs優越。"
    }
  ]
}