{
  "author": "xavierwest888",
  "original_created_utc": 1644696770,
  "title": "I strongly believe that tomorrow's Super Bowl crypto adverts are going to cause the start of the next bull run!",
  "created_utc": 1644709032,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Title sums it up but for those that don&amp;#39;t know tomorrow during the Super Bowl there is going to be advertisements from crypto dot com and other cryptos. This is going to be the single biggest advertising advent reaching the largest number and demographics of people that crypto has ever had.&lt;/p&gt;\n\n&lt;p&gt;Do I believe that just seeing these adverts is going to double our portfolio&amp;#39;s tomorrow? No.&lt;/p&gt;\n\n&lt;p&gt;Do I believe that there is going to be any significant price action tomorrow? Certainly not!&lt;/p&gt;\n\n&lt;p&gt;Do I believe that tomorrow is going to be a focal point for the average public to talk about crypto? Yes.&lt;/p&gt;\n\n&lt;p&gt;And what happens every time the public take an interest in crypto? The media always follow through with more reports, articles, predictions etc and the larger investor, realising that the public are likely to start FOMOing in buy up the lower price quickly. And the more attention crypto gets the harder retail predictably starts FOMOing in which causes a feedback loop pushing prices sky high until large investor money swoops out of the market and crashes the price again.&lt;/p&gt;\n\n&lt;p&gt;So from the charts tomorrow will look like any other day but looking back from the future I bet my sats that it is the beginning of a significant upswing.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Edit: I apparently have to add that I&amp;#39;m not American, I just appreciate the power advertising to retail especially one of the most lucrative retail markets of Americans that have on average the most disposable income and are the most likely to invest (as they have to as they have no social programmes!)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 600,
  "permalink": "/r/CryptoCurrency/comments/sr04jy/i_strongly_believe_that_tomorrows_super_bowl/",
  "subreddit": "CryptoCurrency",
  "id": "sr04jy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Title sums it up but for those that don't know tomorrow during the Super Bowl\nthere is going to be advertisements from crypto dot com and other cryptos. This\nis going to be the single biggest advertising advent reaching the largest number\nand demographics of people that crypto has ever had.\n\nDo I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルに要約されていますが、知らない人のために、明日のスーパーボウルで\ncrypto dot comや他の暗号からの広告が出る予定です。これは\n最大の広告の出現になることでしょう。\nというのは、暗号がこれまでに持っていた人口統計学的な特徴です。\n\n私は...",
      "title": "私は、明日のスーパーボウルの暗号広告が、次のブルランの開始を引き起こすと強く信じています"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题概括了它，但对于那些不知道的人来说，明天的超级碗比赛期间\n将会有来自crypto dot com和其他加密货币的广告。这\n这将是最大的一次广告宣传，达到最大数量的\n和人口统计学的人，加密货币有史以来。\n\n我是否...",
      "title": "我坚信，明天的超级碗加密货币广告将导致下一个牛市的开始！我认为，这将是一个很好的机会。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題概括了它，但對於那些不知道的人來說，明天的超級碗比賽期間\n將會有來自crypto dot com和其他加密貨幣的廣告。這\n這將是最大的一次廣告宣傳，達到最大數量的\n和人口統計學的人，加密貨幣有史以來。\n\n我是否...",
      "title": "我堅信，明天的超級碗加密貨幣廣告將導致下一個牛市的開始！我認爲，這將是一個很好的機會。"
    }
  ]
}