{
  "author": "MarioTheMojoMan",
  "original_created_utc": 1659104505,
  "title": "The prevailing narrative surrounding the collapse of Yugoslavia is that after the death of Tito, the country inevitably dissolved into ethnic chaos without a strongman to \"keep everyone in line.\" Does this match the current scholarly analysis of what happened?",
  "created_utc": 1659120075,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is how I (and most other people) grew up understanding the Yugoslav Wars, but I&amp;#39;ve seen certain things that challenged this narrative in recent years. The main challenges I&amp;#39;ve seen are:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Having multiple ethnicities did not inevitably doom Yugoslavia to failure. After all, there are several examples of successful (to varying degrees) multinational states both historically and today, as well as ethnically homogenous states that have resulted in failure.&lt;/li&gt;\n&lt;li&gt;While Tito&amp;#39;s regime was clearly authoritarian, ethnic divisions were not a significant factor in his efforts to hold onto power. Additionally, nearly a decade passed between Tito&amp;#39;s death and the country fracturing.&lt;/li&gt;\n&lt;li&gt;Aside from Slovenia, most &amp;quot;average Joe&amp;quot; Yugoslavians were in favor of the country remaining together even as violence began to escalate. (Various opinion polls are often referred to for this one, but I&amp;#39;ve never seen any specific polls actually cited.)&lt;/li&gt;\n&lt;li&gt;The international community favored Yugoslavia&amp;#39;s integrity.&lt;/li&gt;\n&lt;li&gt;Perhaps most importantly, the ethnic tensions became too hostile to overcome mostly because of the actions of a few nationalist ideologues, mostly Serbs who wanted to enforce Serb dominance over the whole of the country.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;How well do each of these 5 points hold up, and, in general, what is the current historiographical consensus on how Yugoslavia collapsed and whether it was truly &amp;quot;inevitable&amp;quot;?&lt;/p&gt;\n\n&lt;p&gt;I know this was a long one, so many thanks for reading through!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 148,
  "permalink": "/r/AskHistorians/comments/wb63pt/the_prevailing_narrative_surrounding_the_collapse/",
  "subreddit": "AskHistorians",
  "id": "wb63pt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This is how I (and most other people) grew up understanding the Yugoslav Wars,\nbut I've seen certain things that challenged this narrative in recent years. The\nmain challenges I've seen are:\n\n 1. Having multiple ethnicities did not inevitably doom Yugoslavia to failure.\n    After all, there are…"
}