{
  "author": "doives",
  "original_created_utc": 1633972980,
  "title": "Unpopular opinions (I think): let's stop using the term \"alt\"",
  "created_utc": 1634009700,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;Alternative crypto&quot; or &quot;alt&quot; made sense in a world where besides BTC, crypto projects were small and niche, and thus BTC was the most obvious choice. In a sense, it&#39;s like referring to penny stocks.</p>\n\n<p>However, considering that we&#39;re looking at a multi-chain future with interoperability between blockchains, and some chains already have 1000+ working dApps, it makes no sense to refer to them as &quot;alts&quot;. Those projects are as sound of an investment as BTC is.</p>\n\n<p>It&#39;s like saying that every car that came after Ford was an &quot;alt&quot; car, or every publically traded company/stock after the Dutch East India Company is an &quot;alt&quot; stock.  Not only does it not make sense, but it also plays right into the hands of BTC maximalist, who just seek to delegitimize other projects compared to BTC.</p>\n\n<p>So, I propose that we stop using &quot;alt&quot;. After all, whether it&#39;s BTC, ETH, ALGO and ADA, they&#39;re all cryptos. Unless you&#39;re willing to call your Toyota (or your future Lambo) an alt-car, you should not be calling ETH an &quot;alt&quot; crypto.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/q60v2w/unpopular_opinions_i_think_lets_stop_using_the/",
  "subreddit": "CryptoCurrency",
  "id": "q60v2w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "\"Alternative crypto\" or \"alt\" made sense in a world where besides BTC, crypto\nprojects were small and niche, and thus BTC was the most obvious choice. In a\nsense, it's like referring to penny stocks.\n\nHowever, considering that we're looking at a multi-chain future with\ninteroperability between…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "「オルタナティブ・クリプト」または「アルト」は、BTC以外のクリプト・プロジェクトが小規模でニッチなものであり、BTCが最も明白な競争相手であった世界では意味がありました。\nプロジェクトは小規模でニッチなものが多く、BTCが最も明白な選択肢であったからです。ある意味\nある意味、ペニーストックを指しているようなものです。\n\nしかし、私たちがマルチチェーンの未来を見据えていることを考えると\n相互運用性を考慮すると",
      "title": "不人気な意見（だと思う）：\"alt \"という言葉を使うのをやめよう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这个世界上，除了BTC之外，加密货币项目都是小型和小众的，因此，BTC是最明显的选择，\"另类加密货币 \"或 \"alt \"是有意义的。\n项目都是小型和小众的，因此BTC是最明显的选择。在一个\n从某种意义上说，这就像指的是便士股票。\n\n然而，考虑到我们正在寻找一个多链的未来，其中包括\n之间的互操作性...",
      "title": "不受欢迎的意见（我认为）：让我们停止使用 \"alt \"一词"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這個世界上，除了BTC之外，加密貨幣項目都是小型和小衆的，因此，BTC是最明顯的選擇，\"另類加密貨幣 \"或 \"alt \"是有意義的。\n項目都是小型和小衆的，因此BTC是最明顯的選擇。在一個\n從某種意義上說，這就像指的是便士股票。\n\n然而，考慮到我們正在尋找一個多鏈的未來，其中包括\n之間的互操作性...",
      "title": "不受歡迎的意見（我認爲）：讓我們停止使用 \"alt \"一詞"
    }
  ]
}