{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Wednesday, April 14, 2021\n\nStocks traded mixed on Wednesday, with the Dow Jones rallying to intraday highs\nwhile the S&P 500 (SPY) and tech-heavy Nasdaq (QQQ) pulled back. Market\nparticipants digested a slew of corporate earnings reports from big banks in the\nUS and remarks from…",
  "original_created_utc": 1618433903,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "PsychoMarket Recap - 2021年4月14日（水\n\n4月14日（水）の株式市場は、ダウ平均が日中の最高値を更新する一方で\nS&P 500(SPY)とハイテク株の多いNasdaq(QQQ)は反発しました。市場参加者は\n市場参加者は、米国の大手銀行が相次いで発表した企業業績報告や、日本の金融機関の社長が発表した金融危機に関する発言を消化しました。\n市場参加者は、米国の大手銀行が発表した多数の企業業績報告や、米国の大手銀行が発表した",
      "title": "本日2021年8月14日（水）のMarket Recapをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾--2021年4月14日，星期三。\n\n周三股市交投不一，道琼斯指数回升至盘中高点。\n而标普500指数(SPY)和科技重仓股纳斯达克指数(QQQ)则回落。市场\n参与者消化了大银行的一系列企业财报，并在\n美国和言论从...",
      "title": "以下是2021年8月14日（星期三）今天的市场回顾。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧--2021年4月14日，星期三。\n\n週三股市交投不一，道瓊斯指數回升至盤中高點。\n而標普500指數(SPY)和科技重倉股納斯達克指數(QQQ)則回落。市場\n參與者消化了大銀行的一系列企業財報，並在\n美國和言論從...",
      "title": "以下是2021年8月14日（星期三）今天的市場回顧。"
    }
  ],
  "title": "Here is a Market Recap for today Wednesday, August 14, 2021",
  "created_utc": 1618443834,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Wednesday, April 14, 2021</strong></p>\n\n<p>Stocks traded mixed on Wednesday, with the Dow Jones rallying to intraday highs while the S&amp;P 500 (SPY) and tech-heavy Nasdaq (QQQ) pulled back. Market participants digested a slew of corporate earnings reports from big banks in the US and remarks from Federal Reserve Chair Jerome Powell</p>\n\n<p>Earnings kicked off this morning with several banks reporting first-quarter earnings. JPMorgan (JPM), Goldman Sachs (GS) and Wells Fargo (WFC) blew past analyst expectations, driven by lower loan losses, robust trading and investment banking revenue. Expectations for a strong profit rebound have helped financial stocks and the equity markets rally but have also set a high bar for companies to clear. </p>\n\n<p>Wall Street analysts are expecting a surge in corporate profits in tandem with the recovering economy, with the reopening of the economy and a rise in consumer spending set to boost companies’ results. Ryan Detrick, chief market strategist at LPL Financial said, “We could see upwards of 30% year-over-year earnings growth in the first quarter. That would be the most we’ve seen since coming out of the financial crisis. Expectations are for about 25% earnings growth in the first quarter. And let’s not forget in the previous two quarters what happened: massive, massive beats.”</p>\n\n<p>Jerome Powell reiterated that a near-term move on interest rates remains unlikely until economic recovery, and particularly the labor market, are able to build up momentum and said the Central Bank would slow the pace of its bond purchase program “well before” raising interest rates. Powell said, “We will taper asset purchases when we’ve made substantial further progress toward our goals from last December when we announced that guidance. That would in all likelihood be well before the time we consider raising rates.”</p>\n\n<p>Looking ahead, market participants will closely monitor the report of March retail sales set to be released tomorrow. March retail sales are expected to be strong, with stimulus checks making their way into the economy and the economy gradually reopening due to effective distribution of the vaccine. Economists expect March retail sales to rise a consensus 6.1%, or 5.3% excluding autos, according to Dow Jones. That compares to a sales decline of 3% in February</p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>Coinbase debuted in the market today via direct listing. It was a volatile day, with shares opening at $381 before jumping to a high of around $429 before closing at $328.28.</li>\n<li>Ford Motor Co on Wednesday outlined another series of plant shutdowns due to the global semiconductor chip shortage, with five facilities in the United States and one in Turkey affected.</li>\n<li>Chinese electric vehicle maker Nio confirmed its long-awaited partnership with China Petroleum &amp; Chemical Corporation to set up battery swap stations at Sinopec’s gas filling stations. Sinopec is the largest supplier of refined oil products and petrochemicals as well as the second-largest oil and gas producer in China. The company has more than 30,000 gas stations, ranking it second in the world.</li>\n<li>Apple Inc. scheduled an April 20 event dubbed &quot;Spring Loaded,&quot; the tech giant&#39;s latest virtual gathering to unveil new gadgets. The company is expected to show off new iPads, among other possible additions to its product lineup, analysts say.</li>\n<li>**<strong>Please note that current stock price was written premarket and does not reflect intraday movement*\\</strong>*</li>\n<li>Apple (AAPL) target set by JP Morgan (JPM) at $150 Buy. Stock currently around $134</li>\n<li>Alaska Air (ALK) target raised by JP Morgan (JPM) from $65 to $104 at Overweight. Stock currently around $70. </li>\n<li>Anthem (ANTM) target raised by Cowen from $360 to $395 at Outperform. Stock currently around $359</li>\n<li>Blackrock (BLK) target raised by Morgan Stanley (MS) from $890 to $924 at Overweight. Stock currently around $802</li>\n<li>Boyd Gaming (BYD) target raised at KeyCorp from $61 to $69 at Overweight. Stock currently around $63</li>\n<li>Capital One (COF) target raised by Piper Sandler from $148 to $154 at Overweight. Stock currently around $133</li>\n<li>Costco (COST) with a host of target raises. Consensus price target $400 at Buy. Stock currently around $365</li>\n<li>CVS Health (CVS) target raised by Morgan Stanley (MS) from $86 to $92 at Overweight. Stock currently around $74</li>\n<li>Caesars Entertainment (CZR) target raised by KeyCorp from $102 to $110 at Overweight. Stock currently around $95</li>\n<li>Delta Airlines (DAL) target raised by JP Morgan (JPM) from $49 to $63 at Overweight. Stock currently around $48</li>\n<li>Dell Technology (DELL) target raised by Morgan Stanley (MS) from $98 to $107 at Overweight. Stock currently asround $92</li>\n<li>Goldman Sachs (GS) target raised by Citigroup<a href=\"https://twitter.com/search?q=%24C&amp;src=cashtag_click\"> </a>from $370 to $390 at Buy. Stock currently around $328</li>\n<li>Installed Building Products (IBP) target raised by BTIG Research from $146 to $158. Stock currently around $123</li>\n<li>Jazz Pharma (JAZZ) target raised by Stifel Nicolaus from $195 to $202 at Buy. Stock currently around $163</li>\n<li>NovoCure (NVCR) with two target raises. Stock currently around $197 after gapping up yesterday\n\n<ul>\n<li>Mizuho from $175 to $242 at Buy</li>\n<li>Northland Securities from $200 to $250 at Outperform</li>\n</ul></li>\n<li>Restoration Hardware (RH) target raised by Cowen from $600 to $680 at Outperform. Stock currently around $596</li>\n<li>United Airlines (UAL) target raised by Raymond James from $60 to $80 at Outperform. Stock currently around $57</li>\n</ul>\n\n<p>It is not because things are difficult that we do not dare; it is because we do not dare that things are difficult. - Seneca</p>\n</div><!-- SC_ON -->",
  "score": 144,
  "permalink": "/r/stocks/comments/mqzvok/here_is_a_market_recap_for_today_wednesday_august/",
  "subreddit": "stocks",
  "id": "mqzvok",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566620707
}