{
  "author": "leetikus",
  "the_new_excerpt": "VERY SHORT AND TO THE POINT.\n\nDo not compare BTC with companies, BTC is a currency and will not grow like a\ncompany does. BTC is bigger than any of that. It doesnt compare to any stocks,\nits literal digital gold. IT cant be produced largely, it cant be printed like\ncash can. This is your golden…",
  "original_created_utc": 1613797885,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "很短，而且是重点。\n\n不要将BTC与公司进行比较，BTC是一种货币，不会像公司一样成长。\n公司做的。BTC比这些都要大。它不与任何股票相比。\n它的字面数字黄金。它不能被大量生产，它不能像印刷一样\n现金罐。这是你的黄金...",
      "title": "1万亿的市值... 不要忘了它不是一家公司，它是一种货币。全球消费的法币数量远远超过任何企业。BTC仍有100倍以上的潜在增长空间。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很短，而且是重點。\n\n不要將BTC與公司進行比較，BTC是一種貨幣，不會像公司一樣成長。\n公司做的。BTC比這些都要大。它不與任何股票相比。\n它的字面數字黃金。它不能被大量生產，它不能像印刷一樣\n現金罐。這是你的黃金...",
      "title": "1萬億的市值... 不要忘了它不是一家公司，它是一種貨幣。全球消費的法幣數量遠遠超過任何企業。BTC仍有100倍以上的潛在增長空間。"
    }
  ],
  "title": "1Trillion market cap.. dont forget its not a company, its a currency. The amount of fiat being spent worldwide far exceeds any business. BTC still has 100x+ room to grow potentially.",
  "created_utc": 1613842822,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>VERY SHORT AND TO THE POINT.</p>\n\n<p>Do not compare BTC with companies, BTC is a currency and will not grow like a company does. BTC is bigger than any of that. It doesnt compare to any stocks, its literal digital gold. IT cant be produced largely, it cant be printed like cash can. This is your golden ticket to beat inflation as long as we all stick together and dont let the Govt or banks stear us away from the currency.</p>\n\n<p>you will own parts of history if you backup a wallet and tell you grandkids &#39;hey kids, wanna see what an original BTC wallet looks like?&#39; and see their faces when the USD value is so high on your very CHEAP coins currently.</p>\n</div><!-- SC_ON -->",
  "score": 241,
  "permalink": "/r/Bitcoin/comments/lnzw6s/1trillion_market_cap_dont_forget_its_not_a/",
  "subreddit": "Bitcoin",
  "id": "lnzw6s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332871860
}