{
  "author": "nerooooooo",
  "original_created_utc": 1649584385,
  "title": "How is the outlawing of stuff like Holocaust denial not against the principles of freedom of speech?",
  "created_utc": 1649595725,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t get me wrong, I&amp;#39;m not a Holocaust denier, but shouldn&amp;#39;t everyone be allowed to articulate their opinions and ideas without fear of retaliation, censorship, or legal sanction? Regardless of how stupid those ideas and opinions are. &lt;/p&gt;\n\n&lt;p&gt;I should be able to say the earth is flat, or that giraffes don&amp;#39;t exist, without the fear of being sanctioned. &lt;/p&gt;\n\n&lt;p&gt;Is it the magnitude and the nature of the event (the killing of millions of people) that makes it such a big deal that laws are needed to forbid its denial? &lt;/p&gt;\n\n&lt;p&gt;Is it because the misinformation has reached a point where laws are needed not to make people dumber than they already are?&lt;/p&gt;\n\n&lt;p&gt;Genuinely curious what&amp;#39;s the reasoning behind this.&lt;/p&gt;\n\n&lt;p&gt;Edit: A lot of great answers, thanks!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 178,
  "permalink": "/r/TooAfraidToAsk/comments/u0efun/how_is_the_outlawing_of_stuff_like_holocaust/",
  "subreddit": "TooAfraidToAsk",
  "id": "u0efun",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Don't get me wrong, I'm not a Holocaust denier, but shouldn't everyone be\nallowed to articulate their opinions and ideas without fear of retaliation,\ncensorship, or legal sanction? Regardless of how stupid those ideas and opinions\nare.\n\nI should be able to say the earth is flat, or that giraffes…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誤解を恐れずに言えば、私はホロコースト否定論者ではないが、誰もがそうあるべきではないだろうか。\n報復を恐れることなく、自分の意見や考えを明確にすることが許されている。\n検閲や法的制裁を受けるのでしょうか？その考えや意見がいかに愚かなものであっても。\nである。\n\n地球は平らだとか、キリンは...とか。",
      "title": "ホロコースト否定のようなものを非合法化することが、どうして言論の自由の原則に反しないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不要误会我的意思，我不是否认大屠杀的人，但每个人不应该是\n允许他们表达自己的意见和想法，而不用担心报复。\n审查或法律制裁？不管这些想法和意见有多愚蠢\n是多么愚蠢。\n\n我应该可以说地球是平的，或者说长颈鹿......",
      "title": "把否认大屠杀这样的东西列为非法，怎么就不违反言论自由的原则呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不要誤會我的意思，我不是否認大屠殺的人，但每個人不應該是\n允許他們表達自己的意見和想法，而不用擔心報復。\n審查或法律制裁？不管這些想法和意見有多愚蠢\n是多麼愚蠢。\n\n我應該可以說地球是平的，或者說長頸鹿......",
      "title": "把否認大屠殺這樣的東西列爲非法，怎麼就不違反言論自由的原則呢？"
    }
  ]
}