{
  "author": "Raider4-",
  "the_new_excerpt": "We’ve all seen this in one way or another, hell maybe some of us has exhibited\nthis ourselves in the past.\n\nI’ve had friends and family tease about crypto back in 2018 after the crash when\njust weeks ago they were curious and were talking about how they wish they had\ntaken advantage of the…",
  "original_created_utc": 1621667011,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰もが何らかの形で目にしたことがあるだろうし、もしかしたら過去に自分自身がこのような状態になったことがあるかもしれない。\n過去に自分自身でこれを示したことがあるかもしれません。\n\n私の友人や家族は、暴落後の2018年に暗号についてからかっていました。\nほんの数週間前には興味を持っていたのに、その時には「あの時に利用していれば...」と話していました。\nと話していました。",
      "title": "ビットコインや市場全体がピークに達したとき、友人や家族はどうやって参加するかを尋ねていました。今は下がっているので、同じ人たちは離れています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都以这样或那样的方式看到了这一点，也许我们中的一些人在过去也表现出了这一点。\n这是我自己在过去的表现。\n\n我的朋友和家人在2018年股灾后嘲笑加密货币，而就在几周前，他们还对加密货币感到好奇，并在谈论加密货币是如何实现的。\n就在几周前，他们还很好奇，并在谈论他们如何希望自己能够\n趁着这个机会...",
      "title": "当比特币和整个市场处于高峰时，朋友和家人都在问如何进入。现在它下跌了，这些人也在远离。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都以這樣或那樣的方式看到了這一點，也許我們中的一些人在過去也表現出了這一點。\n這是我自己在過去的表現。\n\n我的朋友和家人在2018年股災後嘲笑加密貨幣，而就在幾周前，他們還對加密貨幣感到好奇，並在談論加密貨幣是如何實現的。\n就在幾周前，他們還很好奇，並在談論他們如何希望自己能夠\n趁着這個機會...",
      "title": "當比特幣和整個市場處於高峯時，朋友和家人都在問如何進入。現在它下跌了，這些人也在遠離。"
    }
  ],
  "title": "When Bitcoin and the overall market was at its peak, friends and family were asking how to get in. Now that it’s down, those same people are staying away.",
  "created_utc": 1621697539,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We’ve all seen this in one way or another, hell maybe some of us has exhibited this ourselves in the past. </p>\n\n<p>I’ve had friends and family tease about crypto back in 2018 after the crash when just weeks ago they were curious and were talking about how they wish they had taken advantage of the opportunity before it blew up. Though when this opportunity re-presents itself, they run for the hills. This is repeating itself now and it’s only a fraction of what happened in 2018.</p>\n\n<p>It’s not easy sticking to your guns and continuing to hodl and make reoccurring purchases through the dark times. But when you do, and you’re now up 1000%’s they’ll call you lucky. </p>\n\n<p>Luck is often when preparation meets opportunity. Stay prepared and the opportunity will present itself. </p>\n\n<p>Granted, recent market conditions are only an extremely small blip compared to the 2018 crash and ensuing bear market, but the pessimism is already apparent.</p>\n</div><!-- SC_ON -->",
  "score": 793,
  "permalink": "/r/CryptoCurrency/comments/nicwb0/when_bitcoin_and_the_overall_market_was_at_its/",
  "subreddit": "CryptoCurrency",
  "id": "nicwb0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197383351
}