{
  "author": "logos88",
  "the_new_excerpt": "It seems Renault could be surfacing his value with the selling of his $1.4\nbillion worth stake in Daimler, meanwhile strengths his position as an EV\nproducer.\n\nThey has just launched Dacia Spring, the cheapest EV car in Europe and a very\npossible TOP seller by particulars and companys. On top of…",
  "original_created_utc": 1615577413,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "似乎雷诺可能会浮现他的价值与他的14亿美元的销售\n价值10亿美元的股份在戴姆勒，同时加强他的位置，作为一个电动车的\n生产商。\n\n他们刚刚推出了达契亚Spring，这是欧洲最便宜的电动车，也是一款非常的。\n可能的顶级卖家的细节和公司。最重要的是...",
      "title": "雷诺有了新的现金战略，可以使其成为被低估的电动车玩法"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "似乎雷諾可能會浮現他的價值與他的14億美元的銷售\n價值10億美元的股份在戴姆勒，同時加強他的位置，作爲一個電動車的\n生產商。\n\n他們剛剛推出了達契亞Spring，這是歐洲最便宜的電動車，也是一款非常的。\n可能的頂級賣家的細節和公司。最重要的是...",
      "title": "雷諾有了新的現金戰略，可以使其成爲被低估的電動車玩法"
    }
  ],
  "title": "Renault has new cash for a strategy that could make it an undervalued EV play",
  "created_utc": 1615651060,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It seems Renault could be surfacing his value with the selling of his $1.4 billion worth stake in Daimler, meanwhile strengths his position as an EV producer.  </p>\n\n<p>They has just launched Dacia Spring, the cheapest EV car in Europe and a very possible TOP seller by particulars and companys. On top of that Nissan (owned by Renault in a 43%) will release Nissan Ariya soon, and the Renault Megane Evision will follow next this year.</p>\n\n<p>Both Nissan Ariya and Megane Evision will use for the first time the new dedicated EV platform which some position as even better than the one from VW. This year probably will be presented the new Alpine premium and only EV brand models. Besides, they have also announced other EV cars like the Renault R5 and R4 for 2023-2024.</p>\n\n<p>With this in mind, Renault possibly will still have a hard year for restrictions for COVID and semiconductors shortage, but with Luca de Meo leading and a very well positioned EV platform, the current valuation maybe will be hard to understand in a not very long future.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://www.marketwatch.com/story/renault-has-new-cash-for-a-strategy-that-could-make-it-an-undervalued-ev-play-says-ubs-11615565876?siteid=yhoof2\">https://www.marketwatch.com/story/renault-has-new-cash-for-a-strategy-that-could-make-it-an-undervalued-ev-play-says-ubs-11615565876?siteid=yhoof2</a></p>\n\n<p>&quot;Renault announced on Friday that it had successfully sold its entire  ownership stake in Mercedes-Benz-owner, reaping €1.14 billion ($1.4  billion) from nearly 16.5 million shares sold at €69.50 per share. The  sale represents 1.54% of Daimler’s share capital sold at a near 4%  discount, based on the stock price at the close on Thursday.</p>\n\n<p>UBS upgraded Renault from neutral to buy on March 2 and increased the  12-month target price on the stock from €22 to €54. Based on the share  price on Friday, this means the stock has legs to climb nearly 37%  higher, according to UBS.</p>\n\n<p>Should the stock market come to appreciate Renault’s EV strategy, UBS  said, this could trigger a rerating of the stock from between double the  current rating to six times the current rating, depending on the  valuation metric used.</p>\n\n<p>The company has “all the tools to sell competitive EV products in a cost  efficient manner,” the analysts said, with its design platform on par  with market-leader Volkswagen’s. In addition, UBS said that a key  differentiator for Renault compared with other manufacturers is that the  company is past its research and development peak, with a  fully-dedicated EV platform already built.&quot;</p>\n</div><!-- SC_ON -->",
  "score": 51,
  "permalink": "/r/investing/comments/m3p454/renault_has_new_cash_for_a_strategy_that_could/",
  "subreddit": "investing",
  "id": "m3p454",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147379958
}