{
  "author": "JDillaRIP",
  "the_new_excerpt": "Fundamentals and global trends would point to a bullish outlook for STMP, but\nafter declining to give guidance in their recent earnings call (citing\nuncertainty caused by covid) STMP dropped ~25% ($70/share).\n\nWith the recent dip, continued increase in ecommerce package volume, and\nStamps.com’s…",
  "original_created_utc": 1614017778,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "基本面和全球趋势表明，STMP的前景看涨，但...。\n在最近的财报电话会议上，他们拒绝给出指导意见（理由是\ncovid造成的不确定性）STMP下跌约25%（70美元/股）。\n\n随着近期的下挫，电商包裹量的持续增加，以及\nStamps.com的...",
      "title": "$STMP在粉碎所有盈利预期并拒绝提供指导后，下跌了25%。看好Stamps.com的情况。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "基本面和全球趨勢表明，STMP的前景看漲，但...。\n在最近的財報電話會議上，他們拒絕給出指導意見（理由是\ncovid造成的不確定性）STMP下跌約25%（70美元/股）。\n\n隨着近期的下挫，電商包裹量的持續增加，以及\nStamps.com的...",
      "title": "$STMP在粉碎所有盈利預期並拒絕提供指導後，下跌了25%。看好Stamps.com的情況。"
    }
  ],
  "title": "$STMP Dropped 25% after crushing all earnings estimates and Declining to offer guidance. The Bullish case for Stamps.com.",
  "created_utc": 1614049002,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Fundamentals and global trends would point to a bullish outlook for STMP, but after declining to give guidance in their recent earnings call (citing uncertainty caused by covid) STMP dropped ~25% ($70/share).</p>\n\n<p>With the recent dip, continued increase in ecommerce package volume, and Stamps.com’s international expansion, STMP is poised to be a good play in Q1 and going forward.</p>\n\n<p><strong>This is post is not financial advice.</strong></p>\n\n<p><strong>Background</strong></p>\n\n<p>Firstly, no, Stamps.com doesn’t sell stamps. They are a SaaS company that offers a variety of shipping, mailing, and tracking solutions for small to enterprise level businesses. Despite its awful name, Stamps.com is a large player in ecommerce. Chances are, if you have shopped online, then you have received a package sent via Stamps.com. Over 40% of all First-Class packages and 33% of Priority Mail packages sent in the US use postage purchased with a Stamps.com software. In the past two years, they also signed a deal strengthening their partnership with UPS and acquired key European/Asian player, MetaPack.</p>\n\n<p><strong>Recent Performance</strong></p>\n\n<ul>\n<li>2020 was the best year to date, capped off by Q4 crushing earnings estimates</li>\n<li><p>Total revenue was $206.0 million, up 28% compared to $160.9 million in the fourth quarter of 2019.</p></li>\n<li><p>GAAP net income was $46.5 million, up 129% compared to $20.3 million in the fourth quarter of 2019.</p></li>\n<li><p>Still has an awful name.</p></li>\n</ul>\n\n<p><strong>Effects of COVID-19 on STMP in 2020</strong></p>\n\n<p>In last week’s earnings call the Stamps.com CEO stated:</p>\n\n<blockquote>\n<p>COVID-19 continues to have a significant positive impact on our business with significant growth in both customers and shipping volume. U.S. e-commerce activity remained elevated throughout the fourth quarter and we benefited from that. </p>\n</blockquote>\n\n<p>He later when on to say:</p>\n\n<blockquote>\n<p>The growth in revenue in the fourth quarter and for the year was primarily driven by strong shipping growth attributable to the shift to online e-commerce purchasing that has been driven by the worldwide COVID-19 pandemic.</p>\n</blockquote>\n\n<p>So, from these statements, it’s pretty clear that Stamps.com’s leadership believes that their business befits from consumers’ increased inclination to shop online during the Covid pandemic...</p>\n\n<p><strong>Q1 Guidance from Stamps.com (or lack thereof)</strong></p>\n\n<p>...but contrary to the statements above, they went on to cite Covid as a source of uncertainty. Despite being halfway through Q1, and continued YoY growth for ecommerce activity throughout the US, Stamps.com did not provide guidance for Q1. Instead, they stated:</p>\n\n<blockquote>\n<p>…as we look forward to 2021, the myriad of factors that are beyond our control, and the resulting effects that those factors could have on our business are very difficult to accurately forecast.\nThese factors include as; global macroeconomic risks, associated with the ongoing pandemic; timing and degree of moderation, in Safer at Home restrictions; the shift back to an office-based working environment; and the overall changes those things could have on global e-commerce.</p>\n</blockquote>\n\n<p><strong>Covid Uncertainty doesn’t really apply to Q1</strong></p>\n\n<p>It’s hard to imagine a scenario where Covid doesn’t have a net positive impact on Stamps.com in Q1. The rest of 2021 may be hard to predict for ecommerce, but Q1 is almost halfway over, and baring an ~80% slowdown for the next month, there will likely be a YoY increase in package volume. Beyond Q1, it will be interesting to see just how much shoppers will stick with their increased propensity to shop online.</p>\n\n<p><strong>Future expansion</strong></p>\n\n<p>Stamps.com has acquired Endicia, ShipStation, ShipEngine, ShippingEasy, ShipWorks, and MetaPack. Though Stamps.com initially started with an exclusive USPS partnership, these acquisitions have opened the door for partnerships with private (UPS, FedEx) and international (Canada Post, Royal Mail, etc.) package carriers. In 2021 Stamps.com expects a 20% increase in operating costs, primarily as a result of increasing headcount and working to develop international business. Stamps.com has only gotten their toes wet in the international market (MetaPack being a huge key to this market), and with their track record, I wouldn’t be surprised if their international business eventually surpassed domestic business.</p>\n\n<p><strong>Stock Buybacks and Neutral Outlooks</strong></p>\n\n<p>In the past, the tin foil hat-wearing redditors among us have accused Stamps.com of offering neutral guidance in an attempt to lower share price just before large buybacks. I don&#39;t usually bust out my aluminum fedora, but I&#39;ll just leave these bullet points here below.</p>\n\n<ul>\n<li>2020 was the biggest year for STMP by far</li>\n<li>Q4 crushed earnings estimates</li>\n<li>Q1 2021 was halfway over by the time of the 2020 earnings call</li>\n<li>Despite more uncertainty in 2020 than Q1 2021 they provided guidance for all 4 quarters last year</li>\n<li><p>Share price dropped ~$70 as a result of no guidance</p></li>\n<li><p>$60M in stock repurchases were approved through the summer </p></li>\n</ul>\n\n<p><strong>TLDR;</strong>\nThis is a good stock. Lack of guidance caused a sell-off. This is still a good stock. Stamps.com has a terrible name.</p>\n</div><!-- SC_ON -->",
  "score": 57,
  "permalink": "/r/investing/comments/lpvjdh/stmp_dropped_25_after_crushing_all_earnings/",
  "subreddit": "investing",
  "id": "lpvjdh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332881993
}