{
  "author": "Hmung",
  "the_new_excerpt": "Sorry for trying to get around the automod but this is important, a fellow\nsubreddit is being attacked.\n\nPlease see this archived post from zjz, the mod who had been holding down the\nfort and one of the many good mods who was kicked off W-S-B and replaced with\nbrand new accounts:…",
  "original_created_utc": 1612425536,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "对不起，我想绕过自动驾驶，但这很重要，一个同胞。\n子reddit被攻击了。\n\n请看这篇来自zjz的存档帖子，这个版主一直在维护着这个\n堡垒和许多优秀的mods之一，谁被踢出W-S-B和取代与。\n全新的账户：...",
      "title": "W-S-B正在经历一个敌对的接管，从老的不活跃的mods寻求利润的subreddit。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對不起，我想繞過自動駕駛，但這很重要，一個同胞。\n子reddit被攻擊了。\n\n請看這篇來自zjz的存檔帖子，這個版主一直在維護着這個\n堡壘和許多優秀的mods之一，誰被踢出W-S-B和取代與。\n全新的賬戶：...",
      "title": "W-S-B正在經歷一個敵對的接管，從老的不活躍的mods尋求利潤的subreddit。"
    }
  ],
  "title": "W-S-B is going through a hostile take over from old inactive mods seeking to profit off of the subreddit",
  "created_utc": 1612429161,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sorry for trying to get around the automod but this is important, a fellow subreddit is being attacked.</p>\n\n<p>Please see this archived post from zjz, the mod who had been holding down the fort and one of the many good mods who was kicked off W-S-B and replaced with brand new accounts: <a href=\"https://archive.is/Q5Pqr\">https://archive.is/Q5Pqr</a></p>\n\n<p>Some folks are segmenting off to other subs like <a href=\"/r/wallstreetbetstest\">r/wallstreetbetstest</a> (zjz’s old test subreddit, controlled by him), or <a href=\"/r/wallstreetbetsnew\">r/wallstreetbetsnew</a> (created when the subreddit locked down last week). We’ll see more of the impact in the morning.</p>\n\n<p>Please be wary of what you see on there, as there will likely be a lot more misinformation coming through and try to keep open arms for folks from the community as this all gets figured out. And most importantly, keep holding.</p>\n</div><!-- SC_ON -->",
  "score": 597,
  "permalink": "/r/stocks/comments/lcasyv/wsb_is_going_through_a_hostile_take_over_from_old/",
  "subreddit": "stocks",
  "id": "lcasyv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518543327
}