{
  "author": "Drudgel",
  "the_new_excerpt": "I first got into crypto in late 2017 via the usual FOMO on-ramps. Purchased\nseveral different prominent coins and felt very stupid after the crash. I didn't\nsell anything, but did drop out of this sub and ignored crypto news until this\nbull market started.\n\nMy portfolio is definitely looking good…",
  "original_created_utc": 1618237663,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が初めて暗号に触れたのは2017年後半、いつものFOMOのオンパレードであった。購入した\nたが、暴落した後、とても愚かな気分になった。何も売りませんでした。\n何も売らなかったが、このサブから脱落し、今回の強気相場まで暗号ニュースを無視した。\n強気市場が始まるまで暗号ニュースを無視していました。\n\n私のポートフォリオは確実に良くなっています...。",
      "title": "次のベアマーケットを正しく行うことに興奮している"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在2017年年底第一次通过常见的FOMO上路进入加密技术。购买了\n几种不同的突出币，崩溃后觉得自己非常愚蠢。我没有\n出售任何东西，但确实退出了这个子，并忽略了加密新闻，直到这个。\n牛市开始了。\n\n我的投资组合肯定是好看的...",
      "title": "我很兴奋地做下一个熊市吧。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在2017年年底第一次通過常見的FOMO上路進入加密技術。購買了\n幾種不同的突出幣，崩潰後覺得自己非常愚蠢。我沒有\n出售任何東西，但確實退出了這個子，並忽略了加密新聞，直到這個。\n牛市開始了。\n\n我的投資組合肯定是好看的...",
      "title": "我很興奮地做下一個熊市吧。"
    }
  ],
  "title": "I'm excited to do the next bear market right",
  "created_utc": 1618263543,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I first got into crypto in late 2017 via the usual FOMO on-ramps. Purchased several different prominent coins and felt <em>very</em> stupid after the crash. I didn&#39;t sell anything, but did drop out of this sub and ignored crypto news until this bull market started. </p>\n\n<p>My portfolio is definitely looking good now, but could have looked incredible had I never stopped DCA&#39;ing into my coins. I just didn&#39;t have the education and confidence then to buy through the bear market. After seeing all the recent news and my portfolio return to the green during this bull run, I no longer have doubts about the long-term growth potential of crypto. I guess it took a full bull-bear-bull cycle for it to &#39;click&#39; for me.</p>\n\n<p>I&#39;m not excited for a bear market, but I will <strong>not</strong> be making the same mistake twice. DCA&#39;ing through crypto winter, whenever it decides to come around, will set up my positions incredibly well for the next bull. Anyone else have a similar realization this run and excited to &quot;buy when there&#39;s blood in the streets&quot;?</p>\n</div><!-- SC_ON -->",
  "score": 302,
  "permalink": "/r/CryptoCurrency/comments/mpf021/im_excited_to_do_the_next_bear_market_right/",
  "subreddit": "CryptoCurrency",
  "id": "mpf021",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566615649
}