{
  "author": "SuperSaiyanSandwich",
  "the_new_excerpt": "Apologies if this is a better question for /r/personalfinance but I find the\nmindset of this sub more in line with my own than their, at times, overly\nconservative advice.\n\nBasically, I'm refinancing my home and it's appreciated quite a lot in the past\nfew years. Due to a rate change and removal of…",
  "original_created_utc": 1624222732,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは/r/personalfinanceに質問した方が良いかもしれませんが、私はこのサブグループの考え方が自分の考え方に合っていると感じています。\nこのサブの考え方は、彼らの時には保守的すぎるアドバイスよりも、私の考え方に近いと思います。\n考え方の方が自分に合っていると思います。\n\n基本的に、私は自分の家を借り換えようとしていて、過去数年間でかなり高くなっています。\n数年でかなり高くなりました。レートの変更と削除のために...",
      "title": "もし、2.5％の金利で資金を調達できるとしたら、その資金をブロード・マーケット・インデックス・ファンドに投入しますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果这个问题对/r/personalalfinance来说更合适，请见谅，但我发现这个分论坛的心态更符合我的想法，而不是他们的，有时过分的。\n的心态更符合我的想法，而不是他们有时过于保守的建议。\n的建议。\n\n基本上，我正在为我的房子进行再融资，在过去的几年里，我的房子升值了不少。\n几年来升值了不少。由于利率的变化和取消了 \"新贷款 \"的规定，我的房子已经升值了很多。",
      "title": "如果你能以2.5%的利率获得资金，你会不会拿去投资广义市场指数基金？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果這個問題對/r/personalalfinance來說更合適，請見諒，但我發現這個分論壇的心態更符合我的想法，而不是他們的，有時過分的。\n的心態更符合我的想法，而不是他們有時過於保守的建議。\n的建議。\n\n基本上，我正在爲我的房子進行再融資，在過去的幾年裏，我的房子升值了不少。\n幾年來升值了不少。由於利率的變化和取消了 \"新貸款 \"的規定，我的房子已經升值了很多。",
      "title": "如果你能以2.5%的利率獲得資金，你會不會拿去投資廣義市場指數基金？"
    }
  ],
  "title": "If you had access to capital at 2.5% interest rate would you take it and put it in broad market index funds?",
  "created_utc": 1624228752,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Apologies if this is a better question for <a href=\"/r/personalfinance\">/r/personalfinance</a> but I find the mindset of this sub more in line with my own than their, at times, overly conservative advice.</p>\n\n<p>Basically, I&#39;m refinancing my home and it&#39;s appreciated quite a lot in the past few years. Due to a rate change and removal of PMI I have the opportunity to cash out 6 figures worth of equity without changing my monthly payment whatsoever.</p>\n\n<p>I realize my home valuation is inflated as is the market as a whole. That said I&#39;m young enough to recover from risk gone south and I have a rather lucrative career that should prevent me from ever being in dire straits if the worst case happened and I found myself underwater on my mortgage.</p>\n\n<p>Hoping to generate some discussion about:</p>\n\n<ol>\n<li><p>If you would take out the money in the first place? and</p></li>\n<li><p>If so what you view as the most prudent asset allocation? Index funds? Stocks, with covered calls? Real estate?</p></li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 41,
  "permalink": "/r/investing/comments/o4exln/if_you_had_access_to_capital_at_25_interest_rate/",
  "subreddit": "investing",
  "id": "o4exln",
  "is_self": true,
  "media": null,
  "is_video": false
}