{
  "author": "juaggo_",
  "the_new_excerpt": "So lately the market has been going down and people might have gotten some\nbloody days in their portfolios. The correction has affected tech the most as\nthe Nasdaq is about 8% from its all time highs.\n\nThe correction has happened because of number one: Rising treasury yields and\nnumber two: Sector…",
  "original_created_utc": 1616760266,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以最近市场一直在下跌，大家可能有一些\n血腥的日子在他们的投资组合。修正对科技的影响最大，因为\n纳斯达克指数距离其历史高点约8%。\n\n修正的发生是因为第一。国债收益率上升和\n二号 部门...",
      "title": "科技股目前是跌跌不休，但最终会回升。不要太听大媒体平台的话!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以最近市場一直在下跌，大家可能有一些\n血腥的日子在他們的投資組合。修正對科技的影響最大，因爲\n納斯達克指數距離其歷史高點約8%。\n\n修正的發生是因爲第一。國債收益率上升和\n二號 部門...",
      "title": "科技股目前是跌跌不休，但最終會回升。不要太聽大媒體平臺的話!"
    }
  ],
  "title": "Tech is tanking at the moment, but it will come back up eventually. Don’t listen to the big media platforms too much!",
  "created_utc": 1616765635,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So lately the market has been going down and people might have gotten some bloody days in their portfolios. The correction has affected tech the most as the Nasdaq is about 8% from its all time highs.</p>\n\n<p>The correction has happened because of number one: Rising treasury yields and number two: Sector rotation. Reopening plays are currently the trend that big money likes and money has gone there recently. </p>\n\n<p>This doesn’t mean that tech is bad in the long term. Stocks go down sometimes and this is the moment that it’s happening. But there is a silver lining to this story...</p>\n\n<p>This gives us a good opportunity get your favourite stocks at a cheaper price. Averaging down is a very delightful thing to do and this is a perfect opportunity. And even if we continue to go down, it’s ok, since you can average down even more.</p>\n\n<p>Another thing that I want to say is that you shouldn’t listen to the media too much. It’s their job to create havoc and drama in the stock market. Their opinions change every week almost, and it’s kinda funny sometimes. One week they say that you shouldn’t sell and another day CNBC reporters tell us how big tech is in a bad place and you should move to industrials, travel, etc. </p>\n\n<p>You have YOUR own plan. Do your plan and don’t listen to those whose job is to dramatize things. The stock market needs patience. Investing is for the long run.</p>\n\n<p>Don’t look at the 1 day chart all the time. It can be very toxic for yourself, especially during a red day. So just chill and remember that your time horizon is in 10 years, not tomorrow.</p>\n\n<p>That’s my 2 cents, have good one everyone!</p>\n</div><!-- SC_ON -->",
  "score": 5705,
  "permalink": "/r/stocks/comments/mdn3nz/tech_is_tanking_at_the_moment_but_it_will_come/",
  "subreddit": "stocks",
  "id": "mdn3nz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357141516
}