{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Wednesday, June 2, 2021\n\nThe three major indexes traded roughly flat in an otherwise action-packed day.\nThe rally in the movie-theater company AMC went to another level, with the\ncompany gapping up more than 100% today (up roughly 255% in the week, 570% for\nthe month). AMC now…",
  "original_created_utc": 1622666483,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サイコ・マーケット・レビュー - 2021年6月2日（水\n\n主要3指数はほぼ横ばいで推移したが、アクションの多い一日だった。\n映画館を運営するAMCの上昇率はさらに高まり、今日は100％以上の上昇となった。\n映画館のAMCの上昇はさらに進み、今日は100％以上の上昇となった（週で約255％、月で570％の上昇\nの上昇となりました。) AMCは現在...",
      "title": "本日2021年6月2日（水）のマーケット・リカップをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾 - 2021年6月2日，星期三\n\n在一个充满行动的日子里，三个主要指数的交易大致持平。\n电影院公司AMC的涨势又上了一个台阶。\n该公司今天涨幅超过100%（本周涨幅约为255%，570%为\n本月上涨570%）。) AMC现在...",
      "title": "以下是今天（2021年6月2日，星期三）的市场回顾"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧 - 2021年6月2日，星期三\n\n在一個充滿行動的日子裏，三個主要指數的交易大致持平。\n電影院公司AMC的漲勢又上了一個臺階。\n該公司今天漲幅超過100%（本週漲幅約爲255%，570%爲\n本月上漲570%）。) AMC現在...",
      "title": "以下是今天（2021年6月2日，星期三）的市場回顧"
    }
  ],
  "title": "Here is a Market Recap for today Wednesday, June 2, 2021",
  "created_utc": 1622692493,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Wednesday, June 2, 2021</strong></p>\n\n<p>The three major indexes traded roughly flat in an otherwise action-packed day. The rally in the movie-theater company AMC went to another level, with the company gapping up more than 100% today (up roughly 255% in the week, 570% for the month). AMC now has a larger market cap (roughly $30 billion) than Gamestop (GME) ever did at the height of its rally. In other news, market participants continued digesting incoming economic data reports. </p>\n\n<p>The month-long battle between short-sellers and retail investors took another drastic turn, with AMC rocketing up, reaching as high as $72.62 and overtaking Gamestop (GME) in terms of market cap. This year has been nothing short of insane and vividly demonstrates the power retail investors are gaining. Shares of other so-called “meme stocks” that have risen in prominence on Reddit this year also gained on Wednesday. Bed Bath &amp; Beyond (BBBY) gained more than 60% while Naked Brand Group (NAKD) and BlackBerry (BB) were up 28% and 30%, respectively. Shares of Gamestop (GME) were up roughly 13%.</p>\n\n<p>New economic reports showed more signs of disruptions in the supply chain. The Institute of Supply Management’s headline index of the manufacturing sector beat analyst estimates but showed production remains constrained by a rise in prices in key materials and labor shortages. The report found that companies and their suppliers “continue to struggle to meet increasing levels of demand”, noting that “record lead times, wide scale shortages of critical basic materials, rising commodity prices and difficulties in transportation products are continuing to affect all segments.” As the economy in the US reopens thanks to effective distribution of the vaccine, supply is having a hard time catching up to rising demand, which of course, causes a rise in prices. The ISM&#39;s headline index registered a reading of 61.2 in May, an increase from April&#39;s reading of 60.7 and the 12th straight month the index has indicated expansion in the sector. Any reading for this index above 50 indicates the sector growing faster; readings below indicating contraction. </p>\n\n<p>However, it’s important to note that as the economy continues to reopen and the labor market improves, material constraints and supply chain are expected to be resolved. And as supply starts to meet demand, the rise in prices in key commodities and consumer goods is expected to slow down.  In a nutshell, this is why Jerome Powell and other monetary officials consistently refer to current inflationary pressures as expected and transitory and have expressed no desire to tighten monetary policy in the near-term. In an April 28 meeting, Jerome Powell said, “Amid progress on vaccinations and strong policy support, indicators of economic activity and employment have strengthened. Inflation has risen, largely reflecting transitory factors. Overall financial conditions remain accommodative, in part reflecting policy measures to support the economy and the flow of credit to U.S. households and businesses.”</p>\n\n<p>Looking ahead, market participants are anxiously waiting for the May Jobs Report, which will be released this Friday. This report will highlight the state of economic recovery, showing whether the labor market has managed to further recover following the extremely disappointing April Job Report. Importantly, the job reports are also used by the Federal Reserve to ascertain if the economy is getting closer to its employment goal, at which point monetary support will begin to taper. </p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>The U.S. said Wednesday it will impose tariffs on the U.K. and five other countries in response to their taxes on U.S. technology companies, but will suspend the levies for six months as it seeks to negotiate an international resolution.</li>\n<li>Tesla Inc is recalling nearly 6,000 U.S. vehicles because brake caliper bolts could be loose, with the potential to cause a loss of tire pressure, documents made public on Wednesday show.</li>\n<li>Twitter Inc said Tuesday it will begin testing ads on its disappearing posts feature called Fleets, as it works to offer more options for advertisers. The company previously said it set a goal of doubling its annual revenue by 2023 from last year&#39;s levels, which it plans to achieve in part by selling ads on more parts of its site and mobile app.</li>\n<li>Late last week, President Joe Biden unveiled a $6 trillion budget proposal for fiscal 2022, which would include a number of proposals around improving the country&#39;s infrastructure, educational resources and health care system and which would be funded in part by higher taxes. </li>\n<li>The price of Tesla vehicles is increasing due to supply chain pressures across the auto industry, particularly for raw materials, Elon Musk said on Monday via Twitter.</li>\n<li><strong>**Please note current stock price was written during the session and may not reflect closing price*\\</strong>*</li>\n<li>Broadcom (AVGO) target raised by Piper Sandler from $500 to $525 at Overweight. Stock currently around $474</li>\n<li>Costco (COST) with two price target raises. Stock currently around $381\n\n<ul>\n<li>Citigroup from $380 to $400 at Neutral </li>\n<li>Wells Fargo from $400 to $415 at Overweight</li>\n</ul></li>\n<li>Scotts Miracle-Gro (SMG) target raised by Raymond James from $300 to $305 at Strong-Buy. Stock currently around $208</li>\n<li>Charles Schwab (SCHW) target raised by Wells Fargo from $76 to $88 at Overweight. Stock currently around $75</li>\n<li>Xpeng (XPEV) target raised by Citigroup from $50 to $51 at Buy. Stock currently around $35.</li>\n<li>Zoom (ZM) with a host of price target raises after reports a positive earnings surprise. Average price target $387.2. Stock currently around $327</li>\n</ul>\n\n<p>“The only guarantee for failure is to stop trying.” - John C Maxwell</p>\n</div><!-- SC_ON -->",
  "score": 71,
  "permalink": "/r/stocks/comments/nqvshl/here_is_a_market_recap_for_today_wednesday_june_2/",
  "subreddit": "stocks",
  "id": "nqvshl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804301795
}