{
  "author": "Spirited_Help_89",
  "original_created_utc": 1638444417,
  "title": "Why are cows so aggressive? How do I avoid this?",
  "created_utc": 1638466863,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So where I live is super rural and we have cows grazing free on open, accessible land. Monday was the third time I&amp;#39;ve been charged at or had serious aggression shown to me by these animals (flustered head shaking and running towards me and my SO).&lt;/p&gt;\n\n&lt;p&gt;I have no idea why this happens. They didn&amp;#39;t have calves, I didn&amp;#39;t come close or split them from their group. I didn&amp;#39;t run or move in any kind of anxious way, I didn&amp;#39;t turn and run when it charged.&lt;/p&gt;\n\n&lt;p&gt;This whole issue seems really dumb to me, I&amp;#39;ve worked with other livestock (sheep and rams, horses etc) and I&amp;#39;ve been around my fair share of dangerous dogs but for some reason cattle seem unpredictable on a whole new level.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also not willing to stop walking on the off chance there are cows. They huddle around the footpaths causing us to have to walk through bogs etc to maintain a safe distance around them. &lt;/p&gt;\n\n&lt;p&gt;I know the local farmers and they treat their animals well, so I don&amp;#39;t think it&amp;#39;s anything to do with them.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/r75f8i/why_are_cows_so_aggressive_how_do_i_avoid_this/",
  "subreddit": "NoStupidQuestions",
  "id": "r75f8i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So where I live is super rural and we have cows grazing free on open, accessible\nland. Monday was the third time I've been charged at or had serious aggression\nshown to me by these animals (flustered head shaking and running towards me and\nmy SO).\n\nI have no idea why this happens. They didn't have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の住んでいるところは超田舎なので、アクセスしやすい広場で牛が放牧されているんです。\nの土地です。月曜日は、3回目の突撃や深刻な攻撃を受けた日でした。\n慌てて頭を振って、私に向かって走ってきたり。\nということです。）\n\nなぜこんなことが起こるのか、まったくわかりません。彼らは...",
      "title": "なぜ牛は攻撃的なのか？どうすれば避けられるの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，我住的地方是超级农村，我们有奶牛在开放的、可进入的土地上自由吃草。\n土地上自由放牧。周一是我第三次被这些动物冲撞或受到严重的攻击\n这些动物向我展示了严重的攻击性（慌乱地摇头，向我和我的SO跑来）。\n我的SO）。\n\n我不知道为什么会发生这种情况。他们没有...",
      "title": "为什么奶牛如此具有攻击性？我怎样才能避免这种情况？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，我住的地方是超級農村，我們有奶牛在開放的、可進入的土地上自由喫草。\n土地上自由放牧。週一是我第三次被這些動物衝撞或受到嚴重的攻擊\n這些動物向我展示了嚴重的攻擊性（慌亂地搖頭，向我和我的SO跑來）。\n我的SO）。\n\n我不知道爲什麼會發生這種情況。他們沒有...",
      "title": "爲什麼奶牛如此具有攻擊性？我怎樣才能避免這種情況？"
    }
  ]
}