{
  "author": "Georgy_K_Zhukov",
  "the_new_excerpt": "TLDR: CLICK HERE, HIT SEND\n[https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe]\nTO SUBSCRIBE TO THE ASKHISTORIANS NEWSLETTER. (IF YOU ARE ON THE MOBILE APP, YOU\nNEED TO EDIT THE MESSAGE IN SOME WAY TO SEND. SIMPLY ADDING A SPACE AND THEN\nDELETING IT IS…",
  "original_created_utc": 1616160007,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "TLDR：点击这里，点击发送。\n[https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=！订阅]\n订阅 \"问历史学家 \"通讯。(如果您在手机APP上，您可以\n需要编辑信息以某种方式发送。简单地添加一个空格，然后再加上\n删除它是...",
      "title": "厌倦了错过AskHistorians的内容？想总是有一些优秀的历史读物？别再想了! 现在就报名参加AskHistorians的每周综述和电子报吧!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TLDR：點擊這裏，點擊發送。\n[https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=！訂閱]\n訂閱 \"問歷史學家 \"通訊。(如果您在手機APP上，您可以\n需要編輯信息以某種方式發送。簡單地添加一個空格，然後再加上\n刪除它是...",
      "title": "厭倦了錯過AskHistorians的內容？想總是有一些優秀的歷史讀物？別再想了! 現在就報名參加AskHistorians的每週綜述和電子報吧!"
    }
  ],
  "title": "Tired of missing AskHistorians content? Want to always have some excellent history to read? Look no further! Sign up NOW for the AskHistorians Weekly Roundup and Newsletter!",
  "created_utc": 1616166956,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>TLDR: <a href=\"https://www.reddit.com/message/compose/?to=AHMessengerBot&amp;subject=Subscribe&amp;message=!subscribe\">Click here, hit send</a> to subscribe to the AskHistorians Newsletter. <sup>(If</sup> <sup>you</sup> <sup>are</sup> <sup>on</sup> <sup>the</sup> <sup>Mobile</sup> <sup>App,</sup> <sup>you</sup> <sup>need</sup> <sup>to</sup> <sup>edit</sup> <sup>the</sup> <sup>message</sup> <sup>in</sup> <sup>some</sup> <sup>way</sup> <sup>to</sup> <sup>send.</sup> <sup>Simply</sup> <sup>adding</sup> <sup>a</sup> <sup>space</sup> <sup>and</sup> <sup>then</sup> <sup>deleting</sup> <sup>it</sup> <sup>is</sup> <sup>sufficient)</sup></h1>\n\n<p>Last month, we rolled for the public our fancy new <a href=\"https://www.reddit.com/r/AskHistorians/comments/ls7oys/get_the_best_askhistorians_content_beamed/\">Newsletter bot</a>. We want to sincerely thank the several hundred users who signed up right off the bat to help us work out the kinks as we continued to expand testing. We&#39;ve been very pleased with the results, and thrilled by the positive feedback we&#39;ve been receiving so far, so ready to start upping that subscriber count!</p>\n\n<p>As regulars know, tons of fantastic answers are written on the subreddit daily, but it can be hard to consume it all. Time gets in the way, but so does the reddit algorithm, which might mean the best answer of the week is buried in a single upvote thread, or else that the most popular question all month doesn&#39;t get answered until several days later. We&#39;ve worked to provide <a href=\"https://www.reddit.com/r/AskHistorians/comments/i6b42q/rules_roundtable_xxvi_be_kind_remind_revisited/\">tools to get around those issues</a>, including RemindMe bot links, the <a href=\"https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/\">AskHistorians browser extension</a>, <a href=\"/u/subredditsummarybot\">/u/subredditsummarybot</a>&#39;s automated roundups, and obviously things like the <a href=\"https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&amp;restrict_sr=on&amp;sort=new&amp;t=all\">Sunday Digest</a> and the <a href=\"https://www.reddit.com/r/AskHistorians/wiki/bestof\">Monthly BestOf</a>.</p>\n\n<p>But we know we can do better! Last years testing of a mass mailer feature with the Admins <a href=\"https://www.reddit.com/r/AskHistorians/comments/fymkgn/weekly_roundup_and_newsletter_20200310_plus_mass/fn0q2mk/\">resulted in mixed feedback</a>, but also showed that with some tweaks, weekly content summaries would be a very welcome feature for many of our users. That feature never did come to pass, but that didn&#39;t mean we weren&#39;t interested.</p>\n\n<h1>As such, we&#39;re excited to be rolling out the <a href=\"/u/AHMessengerBot\">/u/AHMessengerBot</a>! Thanks to the indefatigable <a href=\"/u/AverageAngryPeasant\">/u/AverageAngryPeasant</a>&#39;s assistance in bot development, we have our own personalized messenger bot for users of the subreddit to subscribe to.</h1>\n\n<p><strong>Hows Does It Work?</strong></p>\n\n<p>If you are feeling lazy, <a href=\"https://www.reddit.com/message/compose/?to=AHMessengerBot&amp;subject=Subscribe&amp;message=!subscribe\">click here, hit send</a>. If you want to do the work yourself, then send a private message (Not a chat request!) to <a href=\"/u/AHMessengerBot\">/u/AHMessengerBot</a> with the text <code>!subscribe</code>. If at any time you are sick of us, you can then send <code>!unsubscribe</code>. </p>\n\n<p><strong>What Will I Actually Be Getting?</strong></p>\n\n<p>You will get a mailer straight to your reddit inbox! We&#39;re still tweaking the design, but in general each mailer will highlight a few pieces of popular content from the week, a few pieces of overlooked content from the week, and notable features such as AMAs or podcasts. For a <em>much</em> more in-depth explanation of construction, <a href=\"https://www.reddit.com/r/AskHistorians/comments/fi3bgb/beta_test_askhistorians_weekly_roundup_and/fketrrc/\">check out the guidelines we followed in the original testing</a> which will still be generally the case here.</p>\n\n<p>The things we can say with <em>most</em> certainty though is that we don&#39;t want to get spammy. We don&#39;t want it to get too lengthy, and we don&#39;t want to get too many of these. Weekly is our starting point, and likely to be what we stick with. It is possible the frequency will be made longer, but we promise it won&#39;t be made shorter.</p>\n\n<p>Also, we will usually include a picture of a corgi.</p>\n\n<p><strong>Why a Reddit Bot?</strong></p>\n\n<p>We have been wanting to do something like this for awhile. Using a listserv or mailing list had come up in discussions, but we never much liked the idea. Many users browse <a href=\"/r/AskHistorians\">/r/AskHistorians</a> as part of their broader redditing habits, and we wanted a solution that could integrate into that.</p>\n\n<p><strong>What is Difference from the <a href=\"/u/subredditsummarybot\">/u/subredditsummarybot</a> I Get?</strong></p>\n\n<p><a href=\"/u/subredditsummarybot\">/u/subredditsummarybot</a> is <em>awesome</em>, and we still highly endorse it! But it pulls content solely based on upvotes, and gives you the top ten threads and the top ten comments blind. Sometimes those threads don&#39;t have answers. Sometimes those comments are actually just a follow-up question, or something in a META thread that trended. Our intention here is to provide a more curated experience that helps users enjoy a slice of the <em>best</em> content of the week, regardless of <em>popularity</em>. But we definitely encourage subscribing to both!</p>\n\n<p><strong>I Signed Up. Why Didn&#39;t I Get It?</strong></p>\n\n<p>We&#39;ve found that some users aren&#39;t getting the mailer due to having PMs turned off. If you have done this, please make sure to whitelist the bot account so they can still hit up your inbox! Additionally, please send the message using the <strong>Private Message</strong> function, not the <strong>Chat Function</strong>. Two different things. You should get a subscription confirmation. If you don&#39;t, let us know.</p>\n</div><!-- SC_ON -->",
  "score": 146,
  "permalink": "/r/AskHistorians/comments/m8h3jo/tired_of_missing_askhistorians_content_want_to/",
  "subreddit": "AskHistorians",
  "id": "m8h3jo",
  "is_self": true,
  "media": null,
  "is_video": false
}