{
  "author": "fog_rolls_in",
  "original_created_utc": 1645801984,
  "title": "Why do modern states claim defensive reasons for clearly aggressive acts of war?",
  "created_utc": 1645831294,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don’t imagine that the Vikings or the Kahns of history were “liberating” territory, or “defending” themselves from being attacked first, or claimed that because they are “victims” they therefore have the right to correct history. Is this kind of language and rational a feature of diplomatic relationships, or just a more densely populated world? Is it all propaganda for the home front so people feel like there’s a personal-seeming reason to fight? Why do states go to the trouble to feign a defensive motive when it’s clear that they’re just taking territory and resources because they can?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/t16axl/why_do_modern_states_claim_defensive_reasons_for/",
  "subreddit": "AskHistorians",
  "id": "t16axl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don’t imagine that the Vikings or the Kahns of history were “liberating”\nterritory, or “defending” themselves from being attacked first, or claimed that\nbecause they are “victims” they therefore have the right to correct history. Is\nthis kind of language and rational a feature of diplomatic…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ヴァイキングやカーンの歴史が「解放」だったとは思えません。\nの領土であるとか、先に攻撃されてからの「防衛」であるとか、主張するのは\n彼らは「被害者」であるからこそ、歴史を修正する権利があるのです。はたして\nこのような言葉遣いや理性は、外交の特徴でもあるのですが...。",
      "title": "近代国家は、明らかに攻撃的な戦争行為に対して、なぜ防衛的な理由を主張するのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不认为历史上的维京人或卡恩人在 \"解放 \"领土\n领土，或 \"保卫 \"自己不被攻击，或声称\n因为他们是 \"受害者\"，所以他们有权利纠正历史。这种语言和理性是否是\n这种语言和理性是外交界的特点吗？",
      "title": "为什么现代国家对明显的侵略性战争行为声称有防御性理由？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不認爲歷史上的維京人或卡恩人在 \"解放 \"領土\n領土，或 \"保衛 \"自己不被攻擊，或聲稱\n因爲他們是 \"受害者\"，所以他們有權利糾正歷史。這種語言和理性是否是\n這種語言和理性是外交界的特點嗎？",
      "title": "爲什麼現代國家對明顯的侵略性戰爭行爲聲稱有防禦性理由？"
    }
  ]
}