{
  "author": "qqwe22",
  "original_created_utc": 1633710066,
  "title": "What is your most unpopular crypto opinion?",
  "created_utc": 1633747639,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Good morning or evening traders, hodlers, moon farmers and people who just stumbled upon this post randomly. Welcome to my new question!</p>\n\n<p>Today my new question is... What is your most unpopular crypto opinion? What is the most unpopular opinion you guys have?</p>\n\n<p>Does not matter if you think Bitcoin is going to 0 dollars, that Tether is not sketchy at all or whatever. Does not matter, what matters is that your opinion is unpopular!!!</p>\n\n<p>Please please type your thoughts in the comment section down below! I am really curious about your opinions. Also I will read any and every comment you post!!!</p>\n\n<p>LETS GO!!!</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/q4146d/what_is_your_most_unpopular_crypto_opinion/",
  "subreddit": "CryptoCurrency",
  "id": "q4146d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Good morning or evening traders, hodlers, moon farmers and people who just\nstumbled upon this post randomly. Welcome to my new question!\n\nToday my new question is... What is your most unpopular crypto opinion? What is\nthe most unpopular opinion you guys have?\n\nDoes not matter if you think Bitcoin is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "トレーダー、ホドラー、ムーンファーラー、そしてこの記事を偶然見つけた人たち、おはようございます。\n偶然この記事にたどり着いた人もいるでしょう。私の新しい質問にようこそ\n\n今日の私の新しい質問は あなたの最も人気のない暗号の意見は何ですか？あなた方の最も人気のない意見は何ですか？\n皆さんが持っている最も人気のない意見は何ですか？\n\nあなたがビットコインを考えるかどうかは関係ありません...",
      "title": "最も人気のない暗号の意見は何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "早晨或傍晚时分，商人、搬运工、月球农夫和那些仅仅是为了生计的人。\n偶然发现这个帖子。欢迎来到我的新问题!\n\n今天我的新问题是... 你最不受欢迎的加密货币意见是什么？什么是\n你们最不受欢迎的观点？\n\n如果你认为比特币是...",
      "title": "你最不受欢迎的加密货币意见是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "早晨或傍晚時分，商人、搬運工、月球農夫和那些僅僅是爲了生計的人。\n偶然發現這個帖子。歡迎來到我的新問題!\n\n今天我的新問題是... 你最不受歡迎的加密貨幣意見是什麼？什麼是\n你們最不受歡迎的觀點？\n\n如果你認爲比特幣是...",
      "title": "你最不受歡迎的加密貨幣意見是什麼？"
    }
  ]
}