{
  "author": "WhodatKoi",
  "original_created_utc": 1643036617,
  "title": "Why does everyone think student loans should be forgiven?",
  "created_utc": 1643044295,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I feel like an asshole for asking this but, didn’t these people knowingly take out these loans to get their education? They put themselves in that situation. I’m blue collar so I don’t have any student debt, so I can’t really relate or understand how bad it truly is, it’s just puzzling to me, it seems like taking out a 50,000 car loan then asking for it to be forgiven because it’s too expensive.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 398,
  "permalink": "/r/TooAfraidToAsk/comments/sbo6np/why_does_everyone_think_student_loans_should_be/",
  "subreddit": "TooAfraidToAsk",
  "id": "sbo6np",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I feel like an asshole for asking this but, didn’t these people knowingly take\nout these loans to get their education? They put themselves in that situation.\nI’m blue collar so I don’t have any student debt, so I can’t really relate or\nunderstand how bad it truly is, it’s just puzzling to me, it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんなことを聞くのはアホらしいのですが、この人たちは故意に取ったのではないのでしょうか。\nこのようなローンを組んで、教育を受けることができるのでしょうか？彼らは自分自身をそのような状況に追い込みました。\n私はブルーカラーなので、学生時代の借金はないのですが、あまり共感できません。\n本当に悪いことなのか、私には不可解です、それは...。",
      "title": "なぜみんな学生ローンは免除されるべきだと考えているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得问这个问题像个混蛋，但是，这些人难道不是明知故犯吗？\n贷款来获得教育？他们把自己置于这种境地。\n我是蓝领，所以我没有任何学生债务，所以我不能真正涉及或\n我是蓝领，所以我没有任何学生债务，所以我不能真正理解它到底有多糟糕，这只是让我感到困惑，它...",
      "title": "为什么大家都认为学生贷款应该被免除？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得問這個問題像個混蛋，但是，這些人難道不是明知故犯嗎？\n貸款來獲得教育？他們把自己置於這種境地。\n我是藍領，所以我沒有任何學生債務，所以我不能真正涉及或\n我是藍領，所以我沒有任何學生債務，所以我不能真正理解它到底有多糟糕，這只是讓我感到困惑，它...",
      "title": "爲什麼大家都認爲學生貸款應該被免除？"
    }
  ]
}