{
  "author": "thepoluboy",
  "the_new_excerpt": "Assume there's two 2 year old kids, 'A' and 'B'. A lived their entire childhood\nwith only their parents. And B lived their entire childhood with a joint family\nwhich includes their parents, grandparents and their uncle aunts. Will their\nword learning rate at the age of 2 will be different and how…",
  "original_created_utc": 1622560937,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "A」と「B」という2歳の子供がいるとします。A君は幼少期を両親だけで過ごしてきました。\n両親だけで過ごしてきました。Bは、両親、祖父母、叔父叔母を含む共同家族で子供時代を過ごしました。\n両親、祖父母、叔父叔母を含む共同家族と過ごしました。果たして彼らの\n2歳の時の言葉の習得率は違うのでしょうか？",
      "title": "2歳の幼児は約6000語を学びますが、研究によるとその割合は2500%です。もし子供が幼児期に複数の人と接触していたら、この指標は増えるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "假设有两个2岁的孩子，'A'和'B'。A在整个童年期间\n只和他们的父母在一起。而B的整个童年都和一个联合家庭生活在一起\n其中包括他们的父母、祖父母和叔叔阿姨。他们的\n2岁时的单词学习率会不会不同，以及如何...",
      "title": "根据研究，一个2岁的幼儿学习了大约6000个单词，并且有2500%的比率，如果孩子在整个幼儿期与多人接触，这个指标是否会增加，如果是，那么如何增加？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "假設有兩個2歲的孩子，'A'和'B'。A在整個童年期間\n只和他們的父母在一起。而B的整個童年都和一個聯合家庭生活在一起\n其中包括他們的父母、祖父母和叔叔阿姨。他們的\n2歲時的單詞學習率會不會不同，以及如何...",
      "title": "根據研究，一個2歲的幼兒學習了大約6000個單詞，並且有2500%的比率，如果孩子在整個幼兒期與多人接觸，這個指標是否會增加，如果是，那麼如何增加？"
    }
  ],
  "title": "A 2 year old toddler learns about 6000 words and with the rate of 2500% according to studies, if the kid is in touch with multiple people throughout his early childhood, will this metrics increase, if yes then how?",
  "created_utc": 1622572638,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Assume there&#39;s two 2 year old kids, &#39;A&#39; and &#39;B&#39;. A lived their entire childhood with only their parents. And B lived their entire childhood with a joint family which includes their parents, grandparents and their uncle aunts. Will their word learning rate at the age of 2 will be different and how much different?</p>\n</div><!-- SC_ON -->",
  "score": 1181,
  "permalink": "/r/askscience/comments/npwh7z/a_2_year_old_toddler_learns_about_6000_words_and/",
  "subreddit": "askscience",
  "id": "npwh7z",
  "is_self": true,
  "media": null,
  "is_video": false
}