{
  "author": "Some1fromReddit",
  "the_new_excerpt": "This one will probably be down voted too.\n\nI think this is the most ridiculous thing ever, as most of these have no reason\nto get down voted at all.\n\nIt's clear as day manipulation of karma is occuring so that some group, and\nobviously it's a group can benefit the most from recording karma. If you…",
  "original_created_utc": 1619719226,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この作品もおそらくダウンブリードされるでしょう。\n\nこれまでで最も馬鹿げたことだと思います。\n下げられる理由が全くありません。\n\nカルマの操作が行われているのは明らかで、あるグループが、明らかにそのグループが\n明らかにあるグループがカルマを記録することで最も利益を得られるように、カルマの操作が行われています。もし...",
      "title": "この6時間以内に投稿された最新の記事に目を通したところ、95％がダウンボットされていました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个人可能也会被降级投票。\n\n我认为这是最荒唐的事情，因为大部分的作品都没有理由\n被降票的理由。\n\n这很明显是在操纵因果报应，以便某些团体，而且显然是一个团体可以从记录因果报应中获得最大利益。\n显然，这是一个团体可以从记录业力中获得最大的利益。如果你...",
      "title": "我刚刚扫描了过去6小时内的所有最新帖子，其中95%的帖子都被降权了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個人可能也會被降級投票。\n\n我認爲這是最荒唐的事情，因爲大部分的作品都沒有理由\n被降票的理由。\n\n這很明顯是在操縱因果報應，以便某些團體，而且顯然是一個團體可以從記錄因果報應中獲得最大利益。\n顯然，這是一個團體可以從記錄業力中獲得最大的利益。如果你...",
      "title": "我剛剛掃描了過去6小時內的所有最新帖子，其中95%的帖子都被降權了。"
    }
  ],
  "title": "I just scanned through the all the latest posts within the last 6hrs, and 95% of them have been downvoted",
  "created_utc": 1619735850,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This one will probably be down voted too.</p>\n\n<p>I think this is the most ridiculous thing ever, as most of these have no reason to get down voted at all. </p>\n\n<p>It&#39;s clear as day manipulation of karma is occuring so that some group, and obviously it&#39;s a group can benefit the most from recording karma.  If you down vote everything as a group but don&#39;t down vote anyone in your group, their posts will become more prominent and not fade as fast as the other ones. </p>\n\n<p>As one thread pointed out a chart, there are significantly more down votes happening in this sub than any other crypto sub out there.</p>\n\n<p>Something has to be done about this obviously.  Maybe show the number of down votes separately from the upvotes?</p>\n\n<p>Like..</p>\n\n<p>30 upvotes - 15 downvotes - 25 comments </p>\n\n<p>Instead of. </p>\n\n<p>15 upvotes - 25 comments </p>\n\n<p>Seems logical to me, and will clearly show obvious manipulation using down votes when you open all these threads down votes and realize 100% of comments were positive. </p>\n\n<p>I was looking at this one thread the other day that had 80 comments all of them were positive.  70 of them were unique users but it had only 5 upvotes...</p>\n\n<p>Now you tell me ...in what other subreddit do you see  100% of the commenters agree with the post but only 7% of them actually clicked the like button?       None. </p>\n\n<p>Fix this stupid problem.</p>\n</div><!-- SC_ON -->",
  "score": 228,
  "permalink": "/r/CryptoCurrency/comments/n1a6gt/i_just_scanned_through_the_all_the_latest_posts/",
  "subreddit": "CryptoCurrency",
  "id": "n1a6gt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380959904
}