{
  "author": "busterrulezzz",
  "original_created_utc": 1643121434,
  "title": "Every single person laughing at NFTs today will be using them in 10 years",
  "created_utc": 1643129884,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;NFTs are probably the most hated thing on the internet right now. I can understand why : stupid apes jpegs and the &amp;quot;crypto-bro&amp;quot; subculture is kinda annoying.&lt;/p&gt;\n\n&lt;p&gt;But here is what a lot of people need to understand : NFTs are much, much more than jpegs. &lt;strong&gt;It&amp;#39;s a piece of technology that has the potential to revolutionize a lot of things in our daily digital lives.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Let me illustrate my point. Last week, there was an ETH hackaton organized by ETHglobal. In two days, participants created 255 different projects related to NFTs. Here&amp;#39;s some very interesting projects that have nothing to do with &amp;quot;stupid jpegs&amp;quot; :&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Creativerse, a Minecraft server connected to Ethereum where lands and buildings are turned into NFTs - that means that nobody can censor you. &lt;/li&gt;\n&lt;li&gt;0xPhotos, a stock photography marketplace that enable creators to get royalties everytime their photo is used. &lt;/li&gt;\n&lt;li&gt;veNFT, a DeFi projects that gives rewards to owners willing to stake their NFT. &lt;/li&gt;\n&lt;li&gt;ENS-Signature, which aim to integrate Ethereum Universal Sign-In into official documents such as DocuSigns. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I think I&amp;#39;ve made my point : we are in the very early stages of a groundbreaking technology going mainstream. In ten years, those of us who choose to invest in this sector will be called &amp;quot;lucky&amp;quot; by the very same people that are laughing at NFTs right now.&lt;/p&gt;\n\n&lt;p&gt;Keep your mind open. Don&amp;#39;t believe the lies ignorant people are telling you. DYOR, and you will see a lot of opportunities. &lt;strong&gt;NFTs will be everywhere in our digital lives in less than a decade.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;(I&amp;#39;d like to give credit to Twitter user CroissantETH for opening my eyes about this subject. The projects listed above are from one of his thread.)&lt;/p&gt;\n\n&lt;p&gt;(I swear to god, the first person to reply &amp;quot;bUt I cAn RiGhT-cLiCk AnD sAvE tHe JpEgS!!1!!&amp;quot; is getting replied to with a very mean GIF. You&amp;#39;ve been warned.)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 501,
  "permalink": "/r/CryptoCurrency/comments/scf6bb/every_single_person_laughing_at_nfts_today_will/",
  "subreddit": "CryptoCurrency",
  "id": "scf6bb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "NFTs are probably the most hated thing on the internet right now. I can\nunderstand why : stupid apes jpegs and the \"crypto-bro\" subculture is kinda\nannoying.\n\nBut here is what a lot of people need to understand : NFTs are much, much more\nthan jpegs. It's a piece of technology that has the potential…"
}