{
  "author": "Many_Scratch2269",
  "original_created_utc": 1633794506,
  "title": "Get ready for Ethereum supply shock",
  "created_utc": 1633801196,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Since August 5, over 188,000 ETH has been burned. This is about $750,000,000 worth of Ethereum. Ethereum has also been consistently seeing deflationary days. Not only this, but Ethereum is also close to a triple halving. Perhaps the most bullish thing is that Crypto exchanges are running out of Ethereum.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/qenj6lyz2gs71.png?width=408&amp;format=png&amp;auto=webp&amp;s=ce81e35a6bcb9ad5e5386fce035fe3988b755029\">ETH On Exchanges at their lowest level</a></p>\n\n<p>And guess what? This is not even the biggest news for Ethereum. Ethereum layer 2 is also promising 100x gas cuts and is expected to be live by November. This is incredibly bullish for Ethereum. We can easily expect one of the largest bull runs ever if this keeps continuing. Miners are also losing momentum too. With Ethereum being burned more and more and exchanges almost running out soon, I&#39;d say get ready for a supply shock soon.</p>\n</div><!-- SC_ON -->",
  "score": 323,
  "permalink": "/r/CryptoCurrency/comments/q4nwqi/get_ready_for_ethereum_supply_shock/",
  "subreddit": "CryptoCurrency",
  "id": "q4nwqi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Since August 5, over 188,000 ETH has been burned. This is about $750,000,000\nworth of Ethereum. Ethereum has also been consistently seeing deflationary days.\nNot only this, but Ethereum is also close to a triple halving. Perhaps the most\nbullish thing is that Crypto exchanges are running out of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "8月5日以降、188,000ETH以上のETHが燃やされました。これは、約750,000,000ドルの\nのイーサリアムに相当します。また、イーサリアムは一貫してデフレの日が続いています。\nこれだけではなく、イーサリアムはトリプルハーフ化にも近い状態です。おそらく最も\n強気なのは、暗号化された取引所が不足しているということです...",
      "title": "イーサリアムの供給ショックに備えよう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自8月5日以来，已经有超过188,000个ETH被烧毁。这大约是750,000,000美元\n价值的以太坊。以太坊也一直在持续出现通货紧缩的日子。\n不仅如此，以太坊还接近于三倍的减半。也许最\n看好的事情是，加密货币交易所正在耗尽...",
      "title": "准备好迎接以太坊的供应冲击"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自8月5日以來，已經有超過188,000個ETH被燒燬。這大約是750,000,000美元\n價值的以太坊。以太坊也一直在持續出現通貨緊縮的日子。\n不僅如此，以太坊還接近於三倍的減半。也許最\n看好的事情是，加密貨幣交易所正在耗盡...",
      "title": "準備好迎接以太坊的供應衝擊"
    }
  ]
}