{
  "author": "Asti_WhiteWhiskers",
  "original_created_utc": 1639590579,
  "title": "When did the USA start adding so much sugar to their food? And why?",
  "created_utc": 1639614159,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m an American and pretty frustrated by how hard it is to avoid excessive amounts of sugar. An example is I used to buy &amp;quot;regular&amp;quot; applesauce which has lots of sugar added to get kids to eat it. I switched to unsweetened applesauce and it tasted so bland at first! But after a few months of eating unsweetened I accidentally bought the regular version again and I couldn&amp;#39;t eat it at all. It tasted like liquid sugar and was disgusting.  &lt;/p&gt;\n\n&lt;p&gt;Was this change to get people addicted to certain foods? To please kids? I&amp;#39;m curious!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/rh4v26/when_did_the_usa_start_adding_so_much_sugar_to/",
  "subreddit": "NoStupidQuestions",
  "id": "rh4v26",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm an American and pretty frustrated by how hard it is to avoid excessive\namounts of sugar. An example is I used to buy \"regular\" applesauce which has\nlots of sugar added to get kids to eat it. I switched to unsweetened applesauce\nand it tasted so bland at first! But after a few months of eating…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はアメリカ人ですが、過剰摂取を避けるのがいかに難しいか、かなりイライラしています。\n砂糖の量 例えば、私は以前、「普通の」アップルソースを買っていました。\n子供に食べさせるために、砂糖をたくさん入れています。無糖のアップルソースに変えました。\n最初は味気なかったです。しかし、数ヶ月間食べ続けた結果...",
      "title": "アメリカはいつからこんなに砂糖を入れるようになったのでしょうか？そして、その理由は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个美国人，对如何避免过度肥胖感到相当沮丧。\n的糖。一个例子是，我曾经买过 \"普通 \"苹果酱，其中有很多糖。\n为了让孩子们吃它，添加了很多糖。我换成了不加糖的苹果酱\n起初，它的味道很淡。但在吃了几个月后...",
      "title": "美国什么时候开始在食物中加入这么多的糖？为什么呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個美國人，對如何避免過度肥胖感到相當沮喪。\n的糖。一個例子是，我曾經買過 \"普通 \"蘋果醬，其中有很多糖。\n爲了讓孩子們喫它，添加了很多糖。我換成了不加糖的蘋果醬\n起初，它的味道很淡。但在吃了幾個月後...",
      "title": "美國什麼時候開始在食物中加入這麼多的糖？爲什麼呢？"
    }
  ]
}