{
  "author": "fetchbacktime",
  "original_created_utc": 1636765130,
  "title": "Finding or developing software that enables players to game with people in their location",
  "created_utc": 1636803895,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The idea is that you can easily find people in your state/county/within &quot;x&quot; distance of you to play games with online</p>\n\n<p>have a profile much like a Twitter. With a bio that describes a bit about you and profile picture. Age gender and hobbies/interests would all be nice to include but perhaps not required. The details are semantics really for the purpose of this post.</p>\n\n<p>I&#39;d like it to piggyback on a pre-existing large gaming platform like steam Xbox life, addicting games.com (does that still exist), etc</p>\n\n<p>The ultimate purpose is to bring people together in IRL using gaming as an icebreaker and way of forming new friendships. Or at least game with people from your area who you can better relate to.</p>\n\n<p>Does this exist? If not, can we get a group of people together to build it?</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/qspjhq/finding_or_developing_software_that_enables/",
  "subreddit": "SideProject",
  "id": "qspjhq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The idea is that you can easily find people in your state/county/within \"x\"\ndistance of you to play games with online\n\nhave a profile much like a Twitter. With a bio that describes a bit about you\nand profile picture. Age gender and hobbies/interests would all be nice to\ninclude but perhaps not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このアイデアは、あなたの州、郡、または \"x \"距離以内にいる人々を簡単に見つけることができるというものです。\nオンラインで一緒にゲームをする人を簡単に見つけることができます。\n\nTwitterのようなプロフィールがあります。自分のことを少し説明したバイオグラフィーと\nそしてプロフィール写真。年齢、性別、趣味・関心事などがあるといいと思います。\nでも、そうではないかもしれません...。",
      "title": "プレイヤーがいる場所にいる人と一緒にゲームをすることができるソフトウェアの発見または開発"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个想法是，你可以很容易地找到在你的州/县/在 \"x \"距离内的人。\n距离的人进行在线游戏\n\n有一个很像Twitter的个人资料。有一个描述关于你的简历\n和个人照片。年龄、性别和爱好/兴趣都是不错的选择。\n但也许不包括...",
      "title": "寻找或开发软件，使玩家能够与所在地区的人进行游戏"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個想法是，你可以很容易地找到在你的州/縣/在 \"x \"距離內的人。\n距離的人進行在線遊戲\n\n有一個很像Twitter的個人資料。有一個描述關於你的簡歷\n和個人照片。年齡、性別和愛好/興趣都是不錯的選擇。\n但也許不包括...",
      "title": "尋找或開發軟件，使玩家能夠與所在地區的人進行遊戲"
    }
  ]
}