{
  "author": "UnusualPass",
  "the_new_excerpt": "Over the last few days, as Bitcoin has dropped in price, I have seen more and\nmore tin foil hat posts blaming JP morgan, banks / whoever for why the price has\ndropped. The truth is we simply don't know and have no proof. I see that Lad\nBible video being posted endlessly, they have absolutely fuck…",
  "original_created_utc": 1619086668,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここ数日、ビットコインの価格が下がってくると、価格が下がった理由をJPモルガンや銀行、その他の人のせいにしているTin foil hatの投稿が増えてきました。\n価格が下がった理由をJPモルガンや銀行などに責任転嫁する錫箔帽子の投稿が増えています。\nを非難する投稿を目にしました。実際のところ、私たちは単に知らないし、証拠もありません。私はあのLad\n聖書のビデオが延々と投稿されていますが、彼らは全くもって...",
      "title": "この場所をWall Street Betsにしないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的几天里，随着比特币价格的下跌，我看到了越来越多的\n越来越多的锡箔帽帖子将价格下跌的原因归咎于JP摩根、银行/谁。\n跌。事实是我们根本不知道，也没有证据。我看到Lad\n圣经》视频被无休止地发布，他们绝对有他妈的...",
      "title": "不要让这个地方成为华尔街的赌城!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的幾天裏，隨着比特幣價格的下跌，我看到了越來越多的\n越來越多的錫箔帽帖子將價格下跌的原因歸咎於JP摩根、銀行/誰。\n跌。事實是我們根本不知道，也沒有證據。我看到Lad\n聖經》視頻被無休止地發佈，他們絕對有他媽的...",
      "title": "不要讓這個地方成爲華爾街的賭城!"
    }
  ],
  "title": "Don't let this place become Wall Street Bets!",
  "created_utc": 1619098407,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Over the last few days, as Bitcoin has dropped in price, I have seen more and more tin foil hat posts blaming JP morgan, banks / whoever for why the price has dropped. The truth is we simply don&#39;t know and have no proof. I see that Lad Bible video being posted endlessly, they have absolutely  fuck all to do with JP Morgan.</p>\n\n<p>Could it be that many people are asking genuine questions about the sustainability around things like power requirements /wastage, threats to governments, and  China&#39;s influence? (Yes is the answer).</p>\n\n<p>No matter what you feel about these subject areas let&#39;s not lower ourselves to how the WSB forum acts, where they post endlessly about fighting the man and stirring up silly paranoia and ridiculous behaviour.</p>\n\n<p>If you believe in Bitcoin, hodl it, if you don&#39;t and are afraid, sell it... it&#39;s that simple!</p>\n</div><!-- SC_ON -->",
  "score": 3362,
  "permalink": "/r/Bitcoin/comments/mw1n3m/dont_let_this_place_become_wall_street_bets/",
  "subreddit": "Bitcoin",
  "id": "mw1n3m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776204231
}