{
  "author": "KingOfNumismatics",
  "the_new_excerpt": "Upvoting someone post/comment DOES NOT take the moons away from you. To transfer\na moon from you, to someone else, you need to \"tip\" them. Do not be afraid to\nupvote posts or comments. What I personally do is I upvote basically everything\nthat is not a low effort moon farming attempt. Since memes…",
  "original_created_utc": 1618108191,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰かの投稿やコメントをアップヴォートしても、あなたから月を奪うことにはなりません。あなたから他の人に月を移すには\n月を自分から他の人に移すには、「チップ」を渡す必要があります。恐れずに\n恐れずに投稿やコメントをupvoteしましょう。私は個人的に、低努力のムーンファーミングではない、基本的にすべてのものにupvoteしています。\n努力の足りないムーンファーミングの試みではありません。ミームは...",
      "title": "MOONの誤解を解くために"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对某人的帖子/评论进行上调投票并不会让你失去月亮。要转移\n一个月亮从你，到别人，你需要 \"提示 \"他们。不要害怕\n加注帖子或评论。我个人的做法是，基本上所有的东西我都会加注。\n这不是一个低努力月球养殖的尝试。由于备忘录...",
      "title": "澄清对月亮的误解"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對某人的帖子/評論進行上調投票並不會讓你失去月亮。要轉移\n一個月亮從你，到別人，你需要 \"提示 \"他們。不要害怕\n加註帖子或評論。我個人的做法是，基本上所有的東西我都會加註。\n這不是一個低努力月球養殖的嘗試。由於備忘錄...",
      "title": "澄清對月亮的誤解"
    }
  ],
  "title": "Clearing up a misconception about MOONs",
  "created_utc": 1618133430,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Upvoting someone post/comment DOES NOT take the moons away from you. To transfer a moon from you, to someone else, you need to &quot;tip&quot; them. Do not be afraid to upvote posts or comments. What I personally do is I upvote basically everything that is not a low effort moon farming attempt. Since memes are gone, I upvote anything that isn&#39;t the generic &quot;It&#39;s the year 2069 and my .001 BTC bought me a house&quot; posts. Spread a little love, it costs you nothing, and gives something to others. </p>\n\n<p>Thanks for your time. </p>\n\n<p>PS</p>\n\n<p>Yea I know I&#39;m going to get downvoted but idc I want people to be informed.\nEdit: thanks my first gold!!</p>\n</div><!-- SC_ON -->",
  "score": 333,
  "permalink": "/r/CryptoCurrency/comments/moihgv/clearing_up_a_misconception_about_moons/",
  "subreddit": "CryptoCurrency",
  "id": "moihgv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566614255
}