{
  "author": "2020_is_my_year",
  "the_new_excerpt": "Vaxart is a vaccine company working on creating a COVID vaccine that can be\ningested orally in the form of a pill (vs. a typical vaccine injected through a\nsyringe). There are some obvious benefits of rolling out vaccine in pill forms\n(i.e. can be stored in room temperature, ease of transportation,…",
  "original_created_utc": 1612841054,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Vaxart是一家疫苗公司，正致力于创造一种COVID疫苗，可用于\n以药丸形式口服（与典型的疫苗注射相比，通过以下方式注入\n注射器）。) 以丸剂形式推出疫苗有一些明显的好处。\n(即可以在常温下储存，便于运输，...",
      "title": "$VXRT是一个可能值得冒险的疫苗游戏"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Vaxart是一家疫苗公司，正致力於創造一種COVID疫苗，可用於\n以藥丸形式口服（與典型的疫苗注射相比，通過以下方式注入\n注射器）。) 以丸劑形式推出疫苗有一些明顯的好處。\n(即可以在常溫下儲存，便於運輸，...",
      "title": "$VXRT是一個可能值得冒險的疫苗遊戲"
    }
  ],
  "title": "$VXRT is a vaccine play that might be worth the risk",
  "created_utc": 1612897854,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Vaxart is a vaccine company working on creating a COVID vaccine that can be ingested orally in the form of a pill (vs. a typical vaccine injected through a syringe). There are some obvious benefits of rolling out vaccine in pill forms (i.e. can be stored in room temperature, ease of transportation, cheaper cost to produce). Unlike Pfizer&#39;s vaccine that has to be store at negative 70 degree Celsius, Vaxart&#39;s vaccine has some clear distribution advantages especially in third world countries.</p>\n\n<p>Last week the company announced its Phase 1 trial results and absolutely blundered their PR, which sent the stock down like 60%. It&#39;s recovered a little bit today but I believe the company&#39;s ability to properly convey the difference between their oral vaccine vs. other syringe delivered vaccines really is leading the company&#39;s share price to reflect a stock price that&#39;s currently underappreciated by laymen investors (like myself). </p>\n\n<p>For some more detailed science behind what&#39;s happening and the recent PR blunder, take a look here: <a href=\"https://seekingalpha.com/article/4403369-vaxart-stock-drop-following-phase-1-data-for-oral-covidminus-19-vaccine-is-buying-opportunity\">https://seekingalpha.com/article/4403369-vaxart-stock-drop-following-phase-1-data-for-oral-covidminus-19-vaccine-is-buying-opportunity</a></p>\n\n<p>Take a look and let me know what you think!</p>\n</div><!-- SC_ON -->",
  "score": 61,
  "permalink": "/r/investing/comments/lftfuw/vxrt_is_a_vaccine_play_that_might_be_worth_the/",
  "subreddit": "investing",
  "id": "lftfuw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123199874
}