{
  "author": "Truthamania",
  "the_new_excerpt": "Here in Texas we're going through somewhat of an unprecedented cold blast that's\nresulted in 1.1 million people being without power, roads closed, and AAA being\nso overwhelmed that they've suspended service.\n\nI certainly don't consider myself a slacker. I make a comfortable six figure\nsalary, I work…",
  "original_created_utc": 1613443198,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在德克萨斯州，我们正在经历一场前所未有的寒潮\n导致110万人停电，道路关闭，美国汽车协会（AAA）也被关闭。\n所以不堪重负，他们已经暂停服务。\n\n我当然不认为自己是个懒汉。我的收入是六位数\n工资，我工作...",
      "title": "为什么有的人在灾难中只恨不得回到办公室？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在德克薩斯州，我們正在經歷一場前所未有的寒潮\n導致110萬人停電，道路關閉，美國汽車協會（AAA）也被關閉。\n所以不堪重負，他們已經暫停服務。\n\n我當然不認爲自己是個懶漢。我的收入是六位數\n工資，我工作...",
      "title": "爲什麼有的人在災難中只恨不得回到辦公室？"
    }
  ],
  "title": "Why are some people just itching to get back to the office during a disaster?",
  "created_utc": 1613484544,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Here in Texas we&#39;re going through somewhat of an unprecedented cold blast that&#39;s resulted in 1.1 million people being without power, roads closed, and AAA being so overwhelmed that they&#39;ve suspended service.</p>\n\n<p>I certainly don&#39;t consider myself a slacker. I make a comfortable six figure salary, I work hard,  and I enjoy my work. That said, when disasters such as this one hit (or the hurricanes we get every year here in Texas), to me the idea of being able to hunker down at home for a few days and work in front of my fire with a glass of wine is just divine.</p>\n\n<p>So is being home with my family and knowing that we&#39;re all here, we&#39;re all off the road, we&#39;re all safe.</p>\n\n<p>Despite this, every time there is some sort of &#39;work from home&#39; order in place due to a disaster or emergency, there are always these emails that come out from management or fellow coworkers, and you can just <em>tell</em> they&#39;re jonesing to get back to the office.</p>\n\n<ul>\n<li>&quot;Hopefully the snow melts tomorrow no later than 6pm and we can all begin planning our return to the office....&quot;</li>\n<li>&quot;It&#39;s <em>extremely unfortunate</em> that we all can&#39;t be in the office today, hopefully this all passes as soon as possible...&quot;</li>\n<li>&quot;We will never ask you to risk your safety, but those of you who are willing to be a team player and make it into the office this week - you guys rock!!&quot;</li>\n</ul>\n\n<p>Maybe it says something about my professionalism and ambition (even though I don&#39;t believe I lack either), but I read all this and I&#39;m like <strong>&quot;Man, get a fucking life.&quot;</strong></p>\n\n<p>Is your home so uncomfortable that you hate to be &quot;trapped&quot; in it for more than the mandatory weekend? Do you hate your family so much that the thought of being with them during a historic artic blast is so miserable to you? Is your entire identity so wrapped up in the corporate world that you&#39;re that empty and meaningless without the office life?</p>\n\n<p>These people infuriate me because they want to accelerate this time for the rest of us and hurry us back into the 8-5 rat race as quickly as possible.</p>\n\n<p>Are you one of these people? If you are, why are you this way? Cos you fucking suck and seriously need to get a life.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/lktrh4/why_are_some_people_just_itching_to_get_back_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "lktrh4",
  "is_self": true,
  "media": null,
  "is_video": false
}