{
  "author": "Opposite-Golf-3232",
  "the_new_excerpt": "Have seen a lot of posts about Royal Bank of Canada and the few shares that were\nsold afterhours for around 35 $. The graph they show is completely flat and than\na collapse durnig after hours. They also ask why there is no news item on the\nevent. Well, there is no news item about it, because nothing…",
  "original_created_utc": 1618765561,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Royal Bank of Canadaについて多くの投稿を見ましたが、アフターアワーで約35ドルで売られた数株の\n約35ドルでアフターアワーに売られています。彼らが示したグラフは完全にフラットで、時間外に崩壊した後\n時間後には崩壊していました。彼らはまた、なぜこのイベントに関するニュース記事がないのかと尋ねています。\nイベントです。まあ、ニュース記事がないのは、何もないからだが...。",
      "title": "ロイヤル・バンク・オブ・カナダが倒産して、明日からドゥームズデイが始まると思っている人のために、実際の情報を紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "看到了很多关于加拿大皇家银行的帖子，少数股份是\n售后35美元左右。他们显示的图形是完全平坦的，比\n凌晨时分发生坍塌事故。他们还问，为什么没有新闻上的新闻？\n事件。好吧，没有关于它的新闻，因为没有... ...",
      "title": "对于那些认为加拿大皇家银行破产，明天末日开始的人，这里有一些实际信息。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "看到了很多關於加拿大皇家銀行的帖子，少數股份是\n售後35美元左右。他們顯示的圖形是完全平坦的，比\n凌晨時分發生坍塌事故。他們還問，爲什麼沒有新聞上的新聞？\n事件。好吧，沒有關於它的新聞，因爲沒有... ...",
      "title": "對於那些認爲加拿大皇家銀行破產，明天末日開始的人，這裏有一些實際信息。"
    }
  ],
  "title": "For the people who think Royal Bank of Canada is bankrupt and that tomorrow doomsday starts, here some actual information.",
  "created_utc": 1618837649,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Have seen a lot of posts about Royal Bank of Canada and the few shares that were sold afterhours for around 35 $. The graph they show is completely flat and than a collapse durnig after hours. They also ask why there is no news item on the event. Well, there is no news item about it, because nothing happened and tomorrow RY will just open trading around the price it closed Friday. </p>\n\n<p>Let&#39;s look at some professional graphs to debunk the conspiracy of the economic collapse tomorrow. There are probably already people in their doomsday bunkers because of it. </p>\n\n<p>As the graph shows underneath, there is no price of 35$ to be seen. It even went up in after hours. What else do you need more to see?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/27fwgxirqyt61.png?width=1362&amp;format=png&amp;auto=webp&amp;s=7e1a8971632163fa0253c7caf9713590d4ef8331\">5 min chart of RY 16th april 2021</a></p>\n\n<p>&#x200B;</p>\n\n<p>Let&#39;s take a look at a one year graph of RY. As you can see in the graph, it doesn&#39;t show a price of 35$ on Friday. </p>\n\n<p><a href=\"https://preview.redd.it/36mupmapqyt61.png?width=1362&amp;format=png&amp;auto=webp&amp;s=d6d73b0291bd6309d0eee419a2d8f0089ce06277\">RY: one year daily graph</a></p>\n\n<p>TLDR: get out of your doomsday bunkers, RY is not collapsing. There is no news, just because there is nothing.</p>\n</div><!-- SC_ON -->",
  "score": 1089,
  "permalink": "/r/wallstreetbets/comments/mtgtbo/for_the_people_who_think_royal_bank_of_canada_is/",
  "subreddit": "wallstreetbets",
  "id": "mtgtbo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171530326
}