{
  "author": "illintent99",
  "original_created_utc": 1630322535,
  "title": "Which coin has the most annoying Subreddit?",
  "created_utc": 1630337871,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s Monday and I&#39;m in a pissy mood so off we go. I&#39;m becoming more intolerant of some of these crypto subs. Went from source of good info to whatever it is now. </p>\n\n<p>DYOR. ✔ \nFind a promising coin. ✔ \nVisit the sub for it. Big fucking mistake</p>\n\n<p>Ask a simple question and you get bombarded with bullshit trying to suck you up to the mothership while they chant &quot;One Of Us!&quot; over and over. </p>\n\n<p>Don&#39;t get me wrong, not all of them feel like a cult or an insane asylum, but they are few and far between.</p>\n\n<p>What&#39;s the most insufferable crypto community you&#39;ve had the displeasure of finding?</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/peg42x/which_coin_has_the_most_annoying_subreddit/",
  "subreddit": "CryptoCurrency",
  "id": "peg42x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's Monday and I'm in a pissy mood so off we go. I'm becoming more intolerant\nof some of these crypto subs. Went from source of good info to whatever it is\nnow.\n\nDYOR. ✔ Find a promising coin. ✔ Visit the sub for it. Big fucking mistake\n\nAsk a simple question and you get bombarded with bullshit…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日は月曜日で、私は腹立たしい気分なので、出発します。私はこのような暗号化されたサブスクリプションに\nこの手の暗号化されたサブサイトには、より耐性が出てきました。良い情報源だったのが、今では何でもありになってしまった。\n今は\n\nDYOR。有望なコインを見つけてください。そのためのサブサイトを訪問します。大きな間違い\n\n簡単な質問をすると、でたらめな言葉を浴びせられる...。",
      "title": "最も迷惑なSubredditを持つコインは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天是星期一，我的心情很不爽，所以我们走了。我越来越不能容忍\n对这些加密货币的一些子。从良好的信息来源变成了现在的什么东西。\n现在。\n\nDYOR。✔ 找到一个有前途的硬币。✔访问它的子。他妈的大错误\n\n问一个简单的问题，你会被轰炸的废话... ...",
      "title": "哪个币种的Subreddit最让人讨厌？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天是星期一，我的心情很不爽，所以我們走了。我越來越不能容忍\n對這些加密貨幣的一些子。從良好的信息來源變成了現在的什麼東西。\n現在。\n\nDYOR。✔ 找到一個有前途的硬幣。✔訪問它的子。他媽的大錯誤\n\n問一個簡單的問題，你會被轟炸的廢話... ...",
      "title": "哪個幣種的Subreddit最讓人討厭？"
    }
  ]
}