{
  "author": "Iiau_",
  "the_new_excerpt": "Comes to show how stupid people are that they're triggering this mass selling\nmania for a company's insignificant decision.\n\nThe bull market isn't fucking over. Rather, the weak hands are getting shaken\nout because people are so stupid to realize that Elon won't matter in the future\nwhen crypto…",
  "original_created_utc": 1620865142,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この大量販売を誘発しているのは、いかに人々が愚かであるかを示している。\n一企業の些細な判断で、大量の売り物を出すマニアを誘発している人々の愚かさを示しています。\n\n強気相場は終わったわけではありません。むしろ、弱者が淘汰されているのだ。\n人々は愚かなので、イーロンが将来的に重要でないことを理解していないからです。\n暗号化された...",
      "title": "たかが車の会社、されど車の会社、マニアックな億万長者が経営している。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这表明人们是多么的愚蠢，他们为了一个公司微不足道的决定而引发了这种大规模的销售\n为一个公司无关紧要的决定而引发的狂热。\n\n牛市还没他妈的结束。相反，弱者的手正在被甩出去\n因为人们太愚蠢了，没有意识到埃隆在未来并不重要。\n当加密货币...",
      "title": "看在上帝的份上，这只是一家由狂热的亿万富翁经营的汽车公司。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這表明人們是多麼的愚蠢，他們爲了一個公司微不足道的決定而引發了這種大規模的銷售\n爲一個公司無關緊要的決定而引發的狂熱。\n\n牛市還沒他媽的結束。相反，弱者的手正在被甩出去\n因爲人們太愚蠢了，沒有意識到埃隆在未來並不重要。\n當加密貨幣...",
      "title": "看在上帝的份上，這只是一家由狂熱的億萬富翁經營的汽車公司。"
    }
  ],
  "title": "For fucks sake, it's just a car company ran by a maniac billionaire",
  "created_utc": 1620881414,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Comes to show how stupid people are that they&#39;re triggering this mass selling mania for a company&#39;s  insignificant decision.</p>\n\n<p>The bull market isn&#39;t fucking over. Rather, the weak hands are getting shaken out because people are so stupid to realize that Elon won&#39;t matter in the future when crypto grows big enough. I&#39;m seeing so many of you whine about it and what Elon did, Elon this Elon that.</p>\n\n<p>In the meantime, buy the tasty guacamole dip and take a break from crypto.</p>\n</div><!-- SC_ON -->",
  "score": 668,
  "permalink": "/r/CryptoCurrency/comments/nb3nkv/for_fucks_sake_its_just_a_car_company_ran_by_a/",
  "subreddit": "CryptoCurrency",
  "id": "nb3nkv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985993634
}