{
  "author": "AbstractLogic",
  "the_new_excerpt": "Did you know C suit execs have to file their trades with the SEC and that\ninformation is public? Of course you did. But now you have a handy website to\nmonitor those SEC Form 4 filings! Like my da always said, follow the money.\n\nhttp://openinsider.com/\n\nOne trade that I found interesting is the $10M…",
  "original_created_utc": 1619192123,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Cスーツの幹部はSECにトレードを提出しなければならず、その情報が公開されていることを知っていますか？\nその情報は公開されています。もちろん、知っていました。でも、今はそのSECフォーム4の提出を監視する便利なウェブサイトがあります\nSECフォーム4の提出をモニターすることができます。私の父がいつも言っていたように、お金の流れを追えばいいのです。\n\nhttp://openinsider.com/\n\n私が面白いと思ったのは、1,000万ドルの取引です...",
      "title": "インサイダー・トレーダー・スクリーナー"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你知道吗，C类公司的高管必须向美国证券交易委员会提交他们的交易，而且这些信息是公开的。\n信息是公开的？你当然知道。但现在你有一个方便的网站来\n监控那些美国证券交易委员会的4号表格备案! 就像我爸常说的，跟着钱走。\n\nhttp://openinsider.com/\n\n我发现一个有趣的交易是1000万美元的...",
      "title": "内幕交易者筛选器"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你知道嗎，C類公司的高管必須向美國證券交易委員會提交他們的交易，而且這些信息是公開的。\n信息是公開的？你當然知道。但現在你有一個方便的網站來\n監控那些美國證券交易委員會的4號表格備案! 就像我爸常說的，跟着錢走。\n\nhttp://openinsider.com/\n\n我發現一個有趣的交易是1000萬美元的...",
      "title": "內幕交易者篩選器"
    }
  ],
  "title": "Insider Trader Screener",
  "created_utc": 1619204171,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Did you know C suit execs have to file their trades with the SEC and that information is public? Of course you did. But now you have a handy website to monitor those SEC Form 4 filings! Like my da always said, follow the money.</p>\n\n<p><a href=\"http://openinsider.com/\">http://openinsider.com/</a></p>\n\n<p>One trade that I found interesting is the $10M  invested into   Voip-Pal.Com Inc (VPLM) with the CEOpurchasing a whopping 500 million shares.That is some faith in your company when you want to own half a shares worth about $10M.</p>\n\n<p>I also started looking into Bed Bath &amp; Beyond Inc (BBB) after I saw a CFO purchase on the tracker. It hit a low during the pandemic and has been slowing growing back towards its 2017 value. I&#39;m trying to figure out what changed to right the ship.</p>\n</div><!-- SC_ON -->",
  "score": 119,
  "permalink": "/r/stocks/comments/mwxyz8/insider_trader_screener/",
  "subreddit": "stocks",
  "id": "mwxyz8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776214688
}