{
  "author": "Lopsided-Signature87",
  "original_created_utc": 1636377797,
  "title": "What is life changing money for you? No Lambo , all I need is a normal life when I could buy products without looking at its price everytime",
  "created_utc": 1636385573,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When people saying I&#39;m in Crypto for life changing money , I really wonder what that means. I mean each person will have different ideas and goals to lead their life.\nThere are few who need a lambo but most of us in here at using crypto as the only hope to come out of poverty. We don&#39;t need fancy cars but to live happily without any problem.</p>\n\n<p>Crypto is the only asset out there which gives us a hope one day our life will be changed and we&#39;re not asking for a rich life but a stable life.</p>\n\n<p>Crypto will be my way of changing my life so that I wouldn&#39;t have to worry about any emergency situation.</p>\n\n<p>With crypto I can go to work just because I love to and not because I have to, there&#39;s a huge advantage in there.\nWhat&#39;s your life changing money or how do you want crypto to change your life? I would like to hear from everyone about this</p>\n</div><!-- SC_ON -->",
  "score": 228,
  "permalink": "/r/CryptoCurrency/comments/qpdjjd/what_is_life_changing_money_for_you_no_lambo_all/",
  "subreddit": "CryptoCurrency",
  "id": "qpdjjd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "When people saying I'm in Crypto for life changing money , I really wonder what\nthat means. I mean each person will have different ideas and goals to lead their\nlife. There are few who need a lambo but most of us in here at using crypto as\nthe only hope to come out of poverty. We don't need fancy…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人生を変えるようなお金のために暗号に参加していると言う人がいますが、私はそれがどういう意味なのかを考えます。\nと思ってしまいます。つまり、人はそれぞれ、自分の人生を導くためのアイデアや目標を持っているということです。\nのです。ランボを必要とする人はほとんどいませんが、ここにいるほとんどの人は、貧困から抜け出す唯一の希望として暗号を使っています。\n貧困から抜け出すための唯一の希望です。豪華なものは必要ありません...。",
      "title": "あなたにとって人生を変えるお金とは？ランボはありません。私が必要としているのは、いつも値段を見ずに商品を買えるような、普通の生活です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当人们说我是为了改变生活的钱而加入加密货币时，我真的想知道这意味着什么。\n这意味着什么。我的意思是，每个人都会有不同的想法和目标来领导他们的\n生活。有少数人需要一辆兰博，但我们这里的大多数人都在使用加密货币作为\n作为摆脱贫困的唯一希望。我们不需要花哨的...",
      "title": "对你来说，什么是改变生活的钱？没有兰博，我所需要的是一种正常的生活，当我可以购买产品而不用每次都看它的价格时。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當人們說我是爲了改變生活的錢而加入加密貨幣時，我真的想知道這意味着什麼。\n這意味着什麼。我的意思是，每個人都會有不同的想法和目標來領導他們的\n生活。有少數人需要一輛蘭博，但我們這裏的大多數人都在使用加密貨幣作爲\n作爲擺脫貧困的唯一希望。我們不需要花哨的...",
      "title": "對你來說，什麼是改變生活的錢？沒有蘭博，我所需要的是一種正常的生活，當我可以購買產品而不用每次都看它的價格時。"
    }
  ]
}