{
  "author": "toldinstone",
  "original_created_utc": 1631189210,
  "title": "AMA: I'm Garrett Ryan, author of NAKED STATUES, FAT GLADIATORS, AND WAR ELEPHANTS: FREQUENTLY ASKED QUESTIONS ABOUT THE ANCIENT GREEKS AND ROMANS. Ask me anything about my book!",
  "created_utc": 1631195689,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone! I&#39;m Dr. Garrett Ryan, AKA <a href=\"/u/toldinstone\">u/toldinstone</a>. I&#39;m a Roman historian, and I recently released my first popular book: <a href=\"https://amzn.to/2WSMAgF\">Naked Statues, Fat Gladiators, and War Elephants: Frequently Asked Questions about the Ancient Greeks and Romans</a>. In a series of short and (hopefully) humorous essays, the book answers 36 questions about the classical world that I&#39;ve been asked over the years, both in the classroom and - in a few cases - here on AskHistorians. The questions range from practicalities (&quot;Why didn&#39;t the Greeks or Romans wear pants?&quot;) to beliefs (&quot;Did they believe in ghosts, monsters, and/or aliens?&quot;), from leisure (&quot;Did they jog or lift weights?&quot;) to warfare (&quot;How were elephants used in battle?&quot;), and from antiquity (&quot;What happened to Alexander the Great&#39;s body?&quot;) to the present (&quot;Can any families trace their ancestry back to the Greeks or Romans?&quot;). You&#39;ll find the full list of questions in the table of contents on the <a href=\"https://amzn.to/2WSMAgF\">Amazon preview</a>. </p>\n\n<p>(The book sold out on the day of its release at both Amazon and <a href=\"https://bookshop.org/books/naked-statues-fat-gladiators-and-war-elephants-frequently-asked-questions-about-the-ancient-greeks-and-romans/9781633887022\">bookstore.org</a>. New shipments, however, are already on the way, and anyone who orders now will receive their book with only a slight delay. In the meantime, <em>Naked Statues</em> is available from other retailers (including <a href=\"https://www.barnesandnoble.com/w/naked-statues-fat-gladiators-and-war-elephants-garrett-ryan/1138493774\">Barnes &amp; Noble</a>) and as a <a href=\"https://amzn.to/2WSMAgF\">Kindle e-book</a>. You can also preorder the audiobook, which will be released <a href=\"https://www.audiobooks.com/audiobook/9781666169966\">on October 26</a>.)</p>\n\n<p>Today, it will be my pleasure to answer any and every question you might have about the topics discussed in my book, about the process of writing it, or about my YouTube channel <a href=\"https://www.youtube.com/c/toldinstone/videos\">toldinstone</a>. Ask me anything!</p>\n</div><!-- SC_ON -->",
  "score": 120,
  "permalink": "/r/AskHistorians/comments/pkwho9/ama_im_garrett_ryan_author_of_naked_statues_fat/",
  "subreddit": "AskHistorians",
  "id": "pkwho9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi everyone! I'm Dr. Garrett Ryan, AKA u/toldinstone [/u/toldinstone]. I'm a\nRoman historian, and I recently released my first popular book: Naked Statues,\nFat Gladiators, and War Elephants: Frequently Asked Questions about the Ancient\nGreeks and Romans [https://amzn.to/2WSMAgF]. In a series of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。私はギャレット・ライアン博士、別名u/toldinstone [/u/toldinstone]です。私はローマの歴史家です。\nローマの歴史家で、最近、初めての人気本を出版しました。裸の彫像。\n裸の像、太った剣闘士、そして戦象」です。古代ギリシャ・ローマ人についてのよくある質問\nギリシャ人とローマ人についてのよくある質問 [https://amzn.to/2WSMAgF]です。一連の...",
      "title": "AMA：『NAKED STATUES, FAT GLADIATORS, AND WAR ELEPHANTS』の著者、ギャレット・ライアンです。古代ギリシア人とローマ人についてのよくある質問です。私の本について何でも聞いてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好! 我是Garrett Ryan博士，又名u/toldinstone [/u/toldinstone]。我是一个\n罗马历史学家，我最近发布了我的第一本畅销书。裸体雕像。\n胖角斗士和战象。关于古希腊和古罗马的常见问题\n希腊人和罗马人[https://amzn.to/2WSMAgF]。在一系列的...",
      "title": "AMA：我是加勒特-莱恩，《裸体雕像、胖胖的希腊人和战神》的作者。关于古希腊人和罗马人的常见问题。关于我的书，你可以问我任何问题!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好! 我是Garrett Ryan博士，又名u/toldinstone [/u/toldinstone]。我是一個\n羅馬歷史學家，我最近發佈了我的第一本暢銷書。裸體雕像。\n胖角鬥士和戰象。關於古希臘和古羅馬的常見問題\n希臘人和羅馬人[https://amzn.to/2WSMAgF]。在一系列的...",
      "title": "AMA：我是加勒特-萊恩，《裸體雕像、胖胖的希臘人和戰神》的作者。關於古希臘人和羅馬人的常見問題。關於我的書，你可以問我任何問題!"
    }
  ]
}