{
  "author": "Agreeable_Spring5816",
  "the_new_excerpt": "I have bought 0.001BTC and a small portfolio of crypto. I hodl. What's on my\nmind? Am I want a Lambo? Am I want to go to the Moon? No. I am simply a person\nhoping for the crypto platform to stay alive. Why? I want to send my hard earn\nmoney back to my parents to make their lives better, securely…",
  "original_created_utc": 1623491540,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は0.001BTCを購入し、クリプトの小さなポートフォリオを持っています。I hodl。私は何を考えている\n考えていますか？ランボが欲しいかな？月に行きたいのか？いいえ、私はただの人間です。\n暗号プラットフォームの存続を願っています。なぜかって？私が一生懸命に稼いだお金を、両親に送りたいのです。\n両親の生活をより良くするために、しっかりと...",
      "title": "私がBTCを買った理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经买了0.001BTC和一个小型的加密货币组合。我有个问题。我在想什么呢？\n想什么？我想要一辆兰博吗？我想去月球吗？不，我只是一个人\n希望加密货币平台能够保持活力。为什么？我想把我辛苦赚来的\n钱给我的父母，让他们生活得更好，安全地......",
      "title": "我为什么买入BTC"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經買了0.001BTC和一個小型的加密貨幣組合。我有個問題。我在想什麼呢？\n想什麼？我想要一輛蘭博嗎？我想去月球嗎？不，我只是一個人\n希望加密貨幣平臺能夠保持活力。爲什麼？我想把我辛苦賺來的\n錢給我的父母，讓他們生活得更好，安全地......",
      "title": "我爲什麼買入BTC"
    }
  ],
  "title": "Why I bought BTC",
  "created_utc": 1623573939,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have bought 0.001BTC and a small portfolio of crypto. I hodl. What&#39;s on my mind? Am I want a Lambo? Am I want to go to the Moon? No. I am simply a person hoping for the crypto platform to stay alive. Why? I want to send my hard earn money back to my parents to make their lives better, securely without paying expensive fee. Before i discover crypto, the fee i have to pay every month is worth a full meal for a full month. That&#39;s all! I don&#39;t need lambo. And i definately not interested to go to the moon.</p>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/Bitcoin/comments/ny37y3/why_i_bought_btc/",
  "subreddit": "Bitcoin",
  "id": "ny37y3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009733512
}