{
  "author": "SaltLifeTrans",
  "original_created_utc": 1655703382,
  "title": "Black GIs Introduced Koreans to fried chicken?",
  "created_utc": 1655751595,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was watching the new Iron Chef on Netflix and in the second episode the hosts Kristen Kish and Alton Brown were discussing the fried chicken being made by one of the contestants. Kristen Kish said something about how Korea has the best fried chicken in the world and Alton Brown made the comment that it is because African American GIs taught Koreans how to make fried chicken during the Korean War.&lt;/p&gt;\n\n&lt;p&gt;I was curious about this so I attempted my own research and found nothing to really corroborate what Alton Brown was saying. It seems like this is perhaps just an apocryphal story, but I am curious as to where it came from or why Alton Brown said it with such authority. I&amp;#39;m not specifically trying debunk this, but I am curious about a historians perspective on the likeliness of this exchange taking place.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/vge14v/black_gis_introduced_koreans_to_fried_chicken/",
  "subreddit": "AskHistorians",
  "id": "vge14v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was watching the new Iron Chef on Netflix and in the second episode the hosts\nKristen Kish and Alton Brown were discussing the fried chicken being made by one\nof the contestants. Kristen Kish said something about how Korea has the best\nfried chicken in the world and Alton Brown made the comment…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Netflixで新しいアイアンシェフを見ていたら、2話目でホストが\nを作るのですが、出場者の一人が作ったフライドチキンについて、司会のクリステン・キッシュとアルトン・ブラウンが\nが作るフライドチキンについて議論していました。クリステン・キッシュが「韓国のフライドチキンは世界一だ」と言い、アルトン・ブラウンが「韓国は世界一だ」と言う。\nと発言し、アルトン・ブラウンが...",
      "title": "黒人GIが韓国人にフライドチキンを紹介した？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在Netflix上观看新的《钢铁大厨》，在第二集中，主持人\n克里斯汀-基什和奥尔顿-布朗正在讨论一位参赛者制作的炸鸡。\n其中一位参赛者做的炸鸡。克里斯汀-基什说了一些关于韩国有世界上最好的\n而奥尔顿-布朗发表了这样的评论...",
      "title": "黑人大兵向韩国人介绍炸鸡？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在Netflix上觀看新的《鋼鐵大廚》，在第二集中，主持人\n克里斯汀-基什和奧爾頓-布朗正在討論一位參賽者製作的炸雞。\n其中一位參賽者做的炸雞。克里斯汀-基什說了一些關於韓國有世界上最好的\n而奧爾頓-布朗發表了這樣的評論...",
      "title": "黑人大兵向韓國人介紹炸雞？"
    }
  ]
}