{
  "author": "DontBanMeForAsking",
  "original_created_utc": 1644821412,
  "title": "This is a very serious question, it's about a missing person. [explained inside]",
  "created_utc": 1644832738,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A member of my family has gone missing.  &lt;/p&gt;\n\n&lt;p&gt;They left behind their car, their money, and all of their forms of ID. The only thing they took with them is a duffle bag and 2 changes of clothing.   &lt;/p&gt;\n\n&lt;p&gt;We called the cops and when they ran their social through their computers the cops said his digital existence had been wiped clean. They had no employment history, no tax history, no school records, they didn&amp;#39;t even recognize it as a legit social security number.  &lt;/p&gt;\n\n&lt;p&gt;Now, my question for YOU is.... Who has the power to do that?  &lt;/p&gt;\n\n&lt;p&gt;Did this missing member of my family get sent into the witness protection program? Did they erase his digital past?  &lt;/p&gt;\n\n&lt;p&gt;At first we were all fearing the worst. Then we stared to think maybe they ran away to start a new life in another country or state. But, now that the cops have said someone erased his digital existence. We&amp;#39;re really baffled as to what to think.    &lt;/p&gt;\n\n&lt;p&gt;Either witness protection or.... he joined the Men In Black. Those are the only two things I can think of.  &lt;/p&gt;\n\n&lt;p&gt;The only thing is. They have a secure letter writing program. He&amp;#39;d have written his mom a letter by now. It&amp;#39;s been 2 months since he went missing. Could the letter still be on it&amp;#39;s way? Do they make the person wait six months before they let them write letters to their family? I looked it up and it says they DO let you write letters to your family. But, it didn&amp;#39;t go into any details.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/ss498b/this_is_a_very_serious_question_its_about_a/",
  "subreddit": "NoStupidQuestions",
  "id": "ss498b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A member of my family has gone missing.\n\nThey left behind their car, their money, and all of their forms of ID. The only\nthing they took with them is a duffle bag and 2 changes of clothing.\n\nWe called the cops and when they ran their social through their computers the\ncops said his digital…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "家族の一人が行方不明になった。\n\n車とお金と身分証明書を残して。唯一\n持って行ったものはダッフルバッグと着替え2着です。\n\n警察を呼んだのですが、コンピュータで社会科を調べたら、\n警察は、彼のデジタル...",
      "title": "これはとても深刻な問題で、行方不明者についてです。[中で説明]"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的一个家庭成员失踪了。\n\n他们留下了他们的车，他们的钱，以及他们所有的身份证。他们唯一\n他们唯一带走的东西是一个行李袋和两件换洗的衣服。\n\n我们打电话给警察，当他们通过电脑查询他们的社会关系时，警察说他的数字...\n警察说他的数字...",
      "title": "这是一个非常严肃的问题，它是关于一个失踪的人。[内部解释]"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的一個家庭成員失蹤了。\n\n他們留下了他們的車，他們的錢，以及他們所有的身份證。他們唯一\n他們唯一帶走的東西是一個行李袋和兩件換洗的衣服。\n\n我們打電話給警察，當他們通過電腦查詢他們的社會關係時，警察說他的數字...\n警察說他的數字...",
      "title": "這是一個非常嚴肅的問題，它是關於一個失蹤的人。[內部解釋]"
    }
  ]
}