{
  "author": "Brice55",
  "the_new_excerpt": "I started my 401k very late and luckily i work for a amazing company that has a\ngreat match program and stock purchase program. I was just letting my 401k do\nits own thing for a while until a older employee started talking about how much\nbetter he was doing doing the investing himself.\n\nI opened up…",
  "original_created_utc": 1613230357,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我很晚才开始我的401k，幸运的是，我在一家了不起的公司工作，该公司有一个很好的 \"小金库\"。\n伟大的匹配计划和股票购买计划。我只是让我的401k做\n有一段时间，它自己的事情，直到一个年长的员工开始谈论如何多\n最好是他自己做做投资。\n\n我打开了...",
      "title": "30岁，刚刚开始。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很晚纔開始我的401k，幸運的是，我在一家了不起的公司工作，該公司有一個很好的 \"小金庫\"。\n偉大的匹配計劃和股票購買計劃。我只是讓我的401k做\n有一段時間，它自己的事情，直到一個年長的員工開始談論如何多\n最好是他自己做做投資。\n\n我打開了...",
      "title": "30歲，剛剛開始。"
    }
  ],
  "title": "30 years old and just getting started.",
  "created_utc": 1613241145,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I started my 401k very late and luckily i work for a amazing company that has a great match program and stock purchase program. I was just letting my 401k do its own thing for a while until a older employee started talking about how much better he was doing doing the investing himself.</p>\n\n<p>I opened up a brokerage account and just moved 2.5k over to dip my toes into the market.. and i have already doubled that in about two weeks. Complete luck...I have done some research but was wondering if you guess could give me some advice on ways to improve in the long term. Even very common advice will help because i am so new to this. Thanks!!</p>\n\n<p>Edit : Thank you everyone for the awesome advice. </p>\n\n<p>Definitely will look into all of the material everyone recommended!</p>\n</div><!-- SC_ON -->",
  "score": 985,
  "permalink": "/r/stocks/comments/lj2m6o/30_years_old_and_just_getting_started/",
  "subreddit": "stocks",
  "id": "lj2m6o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728623043
}