{
  "author": "Kumquats_indeed",
  "the_new_excerpt": "Do we know about what percentage of the British Empire's colonial revenue came\nfrom the 13 Colonies in the years before the American Revolution? I imagine that\nthe sugar producing Caribbean colonies and the trade out of India were bigger\ncash cows. And how directly invested was King George in the…",
  "original_created_utc": 1616339819,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们知道大英帝国的殖民地收入中，有多少百分比是来自于...\n在美国独立战争之前的几年里，从13个殖民地来的？我想\n加勒比海地区的产糖殖民地和印度的贸易外流规模更大。\n现金牛。乔治王又是如何直接投资于... ...",
      "title": "18世纪中叶，美国13个殖民地对英国经济有多重要？美国独立对帝国和王室的账面损失有多大？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們知道大英帝國的殖民地收入中，有多少百分比是來自於...\n在美國獨立戰爭之前的幾年裏，從13個殖民地來的？我想\n加勒比海地區的產糖殖民地和印度的貿易外流規模更大。\n現金牛。喬治王又是如何直接投資於... ...",
      "title": "18世紀中葉，美國13個殖民地對英國經濟有多重要？美國獨立對帝國和王室的賬面損失有多大？"
    }
  ],
  "title": "How important were the 13 American colonies to the British economy in the mid 18th century? How big a loss was American independence to the Empire and Crown's ledgers?",
  "created_utc": 1616353235,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Do we know about what percentage of the British Empire&#39;s colonial revenue came from the 13 Colonies in the years before the American Revolution? I imagine that the sugar producing Caribbean colonies and the trade out of India were bigger cash cows. And how directly invested was King George in the American colonies? Did their loss hurt his personal finances in particular?</p>\n\n<p>Also, how significant were the expenses of waging the war against the rebelling Americans? Were they hemorrhaging cash to keep the war going, merely an irritating nuisance, or somewhere in between? Was it necessary for the British to borrow any significant sums of money to keep the war going? </p>\n\n<p>Any other information about the economics of the British side of the war would also be appreciated, thank you.</p>\n</div><!-- SC_ON -->",
  "score": 177,
  "permalink": "/r/AskHistorians/comments/m9yrvk/how_important_were_the_13_american_colonies_to/",
  "subreddit": "AskHistorians",
  "id": "m9yrvk",
  "is_self": true,
  "media": null,
  "is_video": false
}