{
  "author": "WellMakeItSomehow",
  "the_new_excerpt": "I know that our immune system does pretty well overall against viruses and\nbacteria, but I read less about parasites. The ones I've learned about like\nmalaria, trichinellosis or tapeworms seem to have no trouble infecting and\nsurviving in the human body, but I imagine there must be some selection…",
  "original_created_utc": 1619339255,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちの免疫システムは、ウイルスやバクテリアに対して全体的によく機能していることは知っています。\nしかし、寄生虫についてはあまり知りません。マラリアやサナダムシなどの寄生虫については\nマラリア、トリキネラ症、サナダムシなどの寄生虫は、人間の体に感染して生き延びるのに苦労しないようです。\n人体に感染して生き延びるのは難しいことではなさそうですが、何か選択があるのでしょうね。",
      "title": "私たちの免疫力は、寄生虫に対してどのように作用しているのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道我们的免疫系统在对付病毒和细菌方面总体上做得相当好。\n细菌，但我对寄生虫的了解较少。我所了解到的诸如\n疟疾、旋毛虫病或绦虫似乎在感染和生存方面没有问题。\n在人体中生存，但我想一定有一些选择......",
      "title": "我们的免疫系统在对抗寄生虫方面的表现如何？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道我們的免疫系統在對付病毒和細菌方面總體上做得相當好。\n細菌，但我對寄生蟲的瞭解較少。我所瞭解到的諸如\n瘧疾、旋毛蟲病或絛蟲似乎在感染和生存方面沒有問題。\n在人體中生存，但我想一定有一些選擇......",
      "title": "我們的免疫系統在對抗寄生蟲方面的表現如何？"
    }
  ],
  "title": "How well does our immune system fare against parasites?",
  "created_utc": 1619360165,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know that our immune system does pretty well overall against viruses and bacteria, but I read less about parasites. The ones I&#39;ve learned about like malaria, trichinellosis or tapeworms seem to have no trouble infecting and surviving in the human body, but I imagine there must be some selection bias coming into play.</p>\n\n<p>Are there parasites (including helminths) that our body can easily get rid of -- the equivalent of common colds, flu or the other bacteria and viruses we might not even notice? I suppose a way to answer this is to look at immunocompromised patients for ones that aren&#39;t usually seen in the general population.</p>\n</div><!-- SC_ON -->",
  "score": 197,
  "permalink": "/r/askscience/comments/my3zxl/how_well_does_our_immune_system_fare_against/",
  "subreddit": "askscience",
  "id": "my3zxl",
  "is_self": true,
  "media": null,
  "is_video": false
}