{
  "author": "Cactus-Soup90",
  "the_new_excerpt": "Was on an internet binge of language videos and one was talking about the old\nthorn letter 'þ' (th) and how it ended up being converted to 'y' (as in Ye Olde\nwhatever) in printed books as the letter wasn't available in type fonts commonly\navailable. Similarly how we used to have 'ß' (ss) which is…",
  "original_created_utc": 1622925308,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "インターネットで言語のビデオを見ていたら、古い棘のある文字「þ（th）」について話していた。\nとげのある文字「þ」（th）が、一般的な書体では使用できなかったため、印刷された本では「y」（Ye Olde Whateverのように）に変換されてしまったという話でした。\n印刷された本の中では、「y」に変換されていました。\nこれは、一般的なフォントでは使用できなかったからです。同様に、かつては「ß」という文字がありましたが、これは...",
      "title": "印刷機メーカーが、「q」や「x」などの文字を入れて、「þ」や「ß」は入れないようにしたのはなぜか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在互联网上狂热地观看语言视频，其中一个视频谈到了古老的\n刺字母 \"þ\"（th），以及它是如何在印刷书籍中被转换为 \"y\"（如Ye Olde\n什么的），因为这个字母在常见的字体中并不存在。\n具备的。同样，我们过去也有'ß'（ss），这是...",
      "title": "是什么驱使印刷厂的制造者加入他们常用的字母（如'q'和'x'，而不是'þ'和'ß'）？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在互聯網上狂熱地觀看語言視頻，其中一個視頻談到了古老的\n刺字母 \"þ\"（th），以及它是如何在印刷書籍中被轉換爲 \"y\"（如Ye Olde\n什麼的），因爲這個字母在常見的字體中並不存在。\n具備的。同樣，我們過去也有'ß'（ss），這是...",
      "title": "是什麼驅使印刷廠的製造者加入他們常用的字母（如'q'和'x'，而不是'þ'和'ß'）？"
    }
  ],
  "title": "What drove printing press makers to include the letters they commonly did ( like 'q' and 'x' but not 'þ' and 'ß')?",
  "created_utc": 1622944505,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Was on an internet binge of language videos and one was talking about the old thorn letter &#39;þ&#39; (th) and how it ended up being converted to &#39;y&#39; (as in Ye Olde whatever) in printed books as the letter wasn&#39;t available in type fonts commonly available. Similarly how we used to have &#39;ß&#39; (ss) which is why on hand written documents like <a href=\"https://en.wikipedia.org/wiki/United_States_Bill_of_Rights#/media/File:Bill_of_Rights_Pg1of1_AC.jpg\">the Bill of Rights it&#39;s the &quot;Congrefs&quot; of the United States</a>  </p>\n\n<p>The argument made was that it was very expensive to make more letters, so it was easier to change the language around the font rather than the other way around. Which makes some amount of sense.</p>\n\n<p>Problem then is, why on earth would the modern Latin alphabet have 26 letters? &#39;C&#39; when pronounced is interchangeable with &#39;K&#39; or &#39;S&#39; depending on the word and could be removed under the same cost saving argument. &#39;Q&#39; could just be &#39;KW&#39; (bac<strong>kw</strong>ard), &#39;X&#39; could just be &#39;KS&#39; (so<strong>cks</strong>), &#39;J&#39; is largely the same as a soft &#39;G&#39; (<strong>g</strong>erms) and so on.</p>\n\n<p>If letters being very expensive was a real concern, why would we then have the letters that we do today, given how many are far more rarely used than (th) and (ss) are?</p>\n</div><!-- SC_ON -->",
  "score": 240,
  "permalink": "/r/AskHistorians/comments/nt4qj1/what_drove_printing_press_makers_to_include_the/",
  "subreddit": "AskHistorians",
  "id": "nt4qj1",
  "is_self": true,
  "media": null,
  "is_video": false
}