{
  "author": "tractatusmoralis",
  "original_created_utc": 1631889938,
  "title": "What causes the ‘wet spot’ after sex? Do most people not use tissues and shower afterwards?",
  "created_utc": 1631894992,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So this question is inspired by another post’s comments I saw recently, as well as hearing about ‘sleeping in the wet spot’ after sex.</p>\n\n<p>Do most people just not clean up after sex? Me and my partner always wipe everything and shower post-sex, before getting to the shower we use tissues to stop any ‘leakage’. There’s no wet spot unless we were very sweaty and even then, just switching positions can help avoid that. </p>\n\n<p>Is this not standard? Do most people just sleep after sex with sticky genitals and leak their liquids everywhere? I have little sexual experience so I’m not sure what the ‘societal norm’ is, but I would very much like to know.</p>\n\n<p>Also this is my post ever, pls b gentle.</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/TooAfraidToAsk/comments/pq1jeb/what_causes_the_wet_spot_after_sex_do_most_people/",
  "subreddit": "TooAfraidToAsk",
  "id": "pq1jeb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So this question is inspired by another post’s comments I saw recently, as well\nas hearing about ‘sleeping in the wet spot’ after sex.\n\nDo most people just not clean up after sex? Me and my partner always wipe\neverything and shower post-sex, before getting to the shower we use tissues to\nstop any…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今回の質問は、最近見た他の記事のコメントに触発されたものです。\n濡れた場所で寝る」という話を聞いたことがきっかけです。\n\nほとんどの人は、セックスの後に掃除をしないのですか？私と私のパートナーは、いつもすべてを拭いて\nシャワーを浴びる前にティッシュを使って止めます。\nシャワーを浴びる前にティッシュを使って...",
      "title": "セックスの後の「濡れ場」の原因は？多くの人は、セックスの後にティッシュやシャワーを使わないのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以这个问题的灵感来自于我最近看到的另一个帖子的评论，以及\n以及听到关于性生活后 \"睡在湿地上 \"的说法。\n\n大多数人在做爱后都不清理吗？我和我的伴侣总是在性生活后擦拭所有的东西并洗澡\n我和我的伴侣在性爱后总是擦拭一切并洗澡，在去洗澡之前我们用纸巾来\n阻止任何...",
      "title": "什么原因导致性生活后出现 \"湿斑\"？大多数人在事后不使用纸巾和淋浴吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以這個問題的靈感來自於我最近看到的另一個帖子的評論，以及\n以及聽到關於性生活後 \"睡在溼地上 \"的說法。\n\n大多數人在做愛後都不清理嗎？我和我的伴侶總是在性生活後擦拭所有的東西並洗澡\n我和我的伴侶在性愛後總是擦拭一切並洗澡，在去洗澡之前我們用紙巾來\n阻止任何...",
      "title": "什麼原因導致性生活後出現 \"溼斑\"？大多數人在事後不使用紙巾和淋浴嗎？"
    }
  ]
}