{
  "author": "Longjumping-Hat-6303",
  "original_created_utc": 1637021503,
  "title": "Lincoln's original Thanksgiving proclamation did not mention Native Americans, instead focusing on \"divine providence.\" 130 years later, children all over America were acting out a Native American and Pilgrim cooperation narrative, complete with construction paper hats. How did this shift occur?",
  "created_utc": 1637067865,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Examples of the hats/costumes from the <a href=\"https://www.jenx67.com/2019/11/thanksgiving-1976.html\">1970s here.</a> I grew up in the 1990s and vividly remember wearing these kind of hats and being presented with and reenacting a Thanksgiving narrative that went roughly &quot;the pilgrims came to America and the Native Americans said welcome and helped them learn to provide for themselves and eventually they had a feast and ate together.&quot;</p>\n\n<p>This narrative is obviously extremely oversimplified and erases much harm done to native populations by colonists and settlers. And the costumes are more than a bit offensive. Today, Thanksgiving is reasonably a flashpoint for discussions of colonizers and the harm they and their descendants have wrought on indigenous communities.</p>\n\n<p>But it also seems markedly different from the original intent of the holiday, which makes no mention of America&#39;s founding myth and focuses on simply on giving thanks to God for bountiful harvests and other gifts.</p>\n\n<p>When did Thanksgiving become tied to the American founding narrative and how/why/when did indigenous people become part of that narrative?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/quuffz/lincolns_original_thanksgiving_proclamation_did/",
  "subreddit": "AskHistorians",
  "id": "quuffz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Examples of the hats/costumes from the 1970s here.\n[https://www.jenx67.com/2019/11/thanksgiving-1976.html] I grew up in the 1990s\nand vividly remember wearing these kind of hats and being presented with and\nreenacting a Thanksgiving narrative that went roughly \"the pilgrims came to\nAmerica and the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1970年代の帽子・コスチュームの例をここで紹介します。\n[https://www.jenx67.com/2019/11/thanksgiving-1976.html] 私は1990年代に育ちました。\n私は1990年代に育ちましたが、この種の帽子をかぶって、「巡礼者たちが来た」という感謝祭の物語を紹介され\n私は1990年代に育ちましたが、このような帽子をかぶり、「巡礼者がアメリカに来て、......」という感謝祭の物語を再現したことを鮮明に覚えています。\n巡礼者がアメリカに来て、...",
      "title": "リンカーンの最初の感謝祭宣言は、ネイティブ・アメリカンには触れず、「神の摂理」に焦点を当てたものでした。それから130年後、アメリカ中の子供たちが、画用紙の帽子をかぶって、ネイティブ・アメリカンとピルグリムの協力関係を演じていました。この変化はどのようにして起こったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这里有70年代的帽子/服装的例子。\n[https://www.jenx67.com/2019/11/thanksgiving-1976.html]我是在1990年代长大的。\n清楚地记得，我戴着这种帽子，被介绍给别人，并重演了一个感恩节的故事。\n我在20世纪90年代长大，清楚地记得我戴着这种帽子，并被介绍和重演感恩节的叙述，内容大致是 \"朝圣者来到美国和\n美国和...",
      "title": "林肯最初的感恩节公告没有提到美国原住民，而是把重点放在 \"神的旨意 \"上。130年后，全美国的儿童都在表演美国原住民和朝圣者的合作故事，并戴上了建筑纸帽。这种转变是如何发生的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏有70年代的帽子/服裝的例子。\n[https://www.jenx67.com/2019/11/thanksgiving-1976.html]我是在1990年代長大的。\n清楚地記得，我戴着這種帽子，被介紹給別人，並重演了一個感恩節的故事。\n我在20世紀90年代長大，清楚地記得我戴着這種帽子，並被介紹和重演感恩節的敘述，內容大致是 \"朝聖者來到美國和\n美國和...",
      "title": "林肯最初的感恩節公告沒有提到美國原住民，而是把重點放在 \"神的旨意 \"上。130年後，全美國的兒童都在表演美國原住民和朝聖者的合作故事，並戴上了建築紙帽。這種轉變是如何發生的？"
    }
  ]
}