{
  "author": "Steadymaz",
  "the_new_excerpt": "I saw today that Trading 212 made changes to their terms and conditions on the\nInvest account. In Chapter 22, it states the platform may lend your shares to\n3rd parties, and those shares are covered to 102% of the value from what I\nunderstand.\n\nSo my guess is that due to the potential short squeezes…",
  "original_created_utc": 1623951208,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "本日、Trading 212がInvestアカウントの規約を変更したことを確認しました。\n投資口座の条件を変更しました。第22章では、プラットフォームがお客様の株式を第三者に貸し出すことができると記載されています。\n第三者に貸し出すことができるとありますが、それらの株式は私の理解では価値の102％まで補償されます。\n理解しています。\n\nつまり、私の推測では、潜在的なショートスクイーズのために...。",
      "title": "ショートスクイーズの可能性に備えた株式の借り入れ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今天看到Trading 212对他们的条款和条件做了修改。\n投资账户的条款。在第22章，它规定平台可以将你的股票借给\n第三方，而这些股票的价值的102％，从我的理解\n理解。\n\n所以我的猜测是，由于潜在的空头挤压...",
      "title": "在潜在的空头挤压之前的股票借贷"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今天看到Trading 212對他們的條款和條件做了修改。\n投資賬戶的條款。在第22章，它規定平臺可以將你的股票借給\n第三方，而這些股票的價值的102％，從我的理解\n理解。\n\n所以我的猜測是，由於潛在的空頭擠壓...",
      "title": "在潛在的空頭擠壓之前的股票借貸"
    }
  ],
  "title": "Share borrowing in the lead up to potential short squeezes",
  "created_utc": 1623974393,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I saw today that Trading 212 made changes to their terms and conditions on the Invest account. In Chapter 22, it states the platform may lend your shares to 3rd parties, and those shares are covered to 102% of the value from what I understand.</p>\n\n<p>So my guess is that due to the potential short squeezes in GME / AMC this change has come to play now at least on the T212 platform (I know other platforms had this before). So I would assume hedge funds could be among the third parties able to borrow the shares, essentially giving them more ammunition to play with messing around with the price! </p>\n\n<p>I’m guessing it’s a strategy to minimise the financial damage to the organisations that are gonna be hit by the short squeezes... What about us retail investors though, how are we gonna be hit by this when the hedge funds have to return the shares, and what if it gets to the point that they can’t return those shares and go bust? I’m curious about that 102% value on the share. Luckily I have majority of my shares in the ISA - which I don’t believe is affected by this.... I know those shares are safe for everyone in invest, but at what return value is what I’m investigating. </p>\n\n<p>I’m new to this, and I might be interpreting this wrong...but this seems to be saying the shares we have in Invest can be lent out to any third parties, and if they can’t pay them back then we are covered up to 102% of the value so the stocks are safe - I’m curious if that’s the value we purchased them at, or the 102% is a value updated on a daily basis on the stocks worth at that time in the market?</p>\n\n<p>Hopefully someone more clued up than me can share some thoughts for everyone! Maybe it’s not even a big deal, but I’d be really interested to hearing some of the more experienced peoples thoughts as I’m still learning. </p>\n\n<ul>\n<li>not financial advice, and I am very new to this, just speculation and curiosity, thankyou to all commenters :) *</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 51,
  "permalink": "/r/investing/comments/o22ss2/share_borrowing_in_the_lead_up_to_potential_short/",
  "subreddit": "investing",
  "id": "o22ss2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009742353
}