{
  "author": "Allestyr",
  "original_created_utc": 1649512336,
  "title": "What's the difference between vitamin A, retinol, and retinoids?",
  "created_utc": 1649523215,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been looking into skin care products and became interested in retinol for its supposed benefits. Something that&amp;#39;s confusing for me though, is why couldn&amp;#39;t I use pure vitamin A oil for the same purpose? It&amp;#39;s generally only marketed as a dietary supplement, but it&amp;#39;s often &lt;em&gt;much&lt;/em&gt; cheaper and without all of the extra ingredients. Everything that I&amp;#39;ve read says they&amp;#39;re basically the same,  but doesn&amp;#39;t really explain how they&amp;#39;re different. &lt;/p&gt;\n\n&lt;p&gt;Why couldn&amp;#39;t I just use the vitamin A oil directly on my skin and reap the benefits without spending the extra money?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 145,
  "permalink": "/r/askscience/comments/tztmku/whats_the_difference_between_vitamin_a_retinol/",
  "subreddit": "askscience",
  "id": "tztmku",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been looking into skin care products and became interested in retinol for\nits supposed benefits. Something that's confusing for me though, is why couldn't\nI use pure vitamin A oil for the same purpose? It's generally only marketed as a\ndietary supplement, but it's often much cheaper and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "スキンケア製品について調べていて、レチノールに興味を持ちました。\nその効果について しかし、私が困惑しているのは、なぜそれができないのかということです。\n同じ目的でピュアビタミンAオイルを使用することはできますか？一般に、ビタミンAは医薬品としてのみ販売されています。\n栄養補助食品ですが、もっと安価なものが多く、...",
      "title": "ビタミンA、レチノール、レチノイドの違いは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在研究皮肤护理产品，并对视黄醇感兴趣。\n它的所谓好处。但让我感到困惑的是，为什么我不能\n用纯维生素A油来达到同样的目的？它通常只被作为一种\n它一般只作为膳食补充剂销售，但它通常要便宜得多，而且...",
      "title": "维生素A、视黄醇和维甲酸之间有什么区别？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在研究皮膚護理產品，並對視黃醇感興趣。\n它的所謂好處。但讓我感到困惑的是，爲什麼我不能\n用純維生素A油來達到同樣的目的？它通常只被作爲一種\n它一般只作爲膳食補充劑銷售，但它通常要便宜得多，而且...",
      "title": "維生素A、視黃醇和維甲酸之間有什麼區別？"
    }
  ]
}