{
  "author": "medo_SWE95",
  "original_created_utc": 1655869034,
  "title": "is it actually rude to DM someone?",
  "created_utc": 1655886969,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was in a book reading server on discord, noticed someone wrote they were from same country as me, so I decided to DM and ask if they could recommend a good book in our language. No responsive given - but 10 minutes later a mod warns me in public chat.&lt;/p&gt;\n\n&lt;p&gt;I apologized, but truth be told I don&amp;#39;t see how it can be offensive, unless you DM something rude. I think warning me in public like that is more rude.&lt;/p&gt;\n\n&lt;p&gt;When I make reddit posts I occasionally receive DMs regarding my post, never once did I consider it to be rude&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/NoStupidQuestions/comments/vhviyu/is_it_actually_rude_to_dm_someone/",
  "subreddit": "NoStupidQuestions",
  "id": "vhviyu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was in a book reading server on discord, noticed someone wrote they were from\nsame country as me, so I decided to DM and ask if they could recommend a good\nbook in our language. No responsive given - but 10 minutes later a mod warns me\nin public chat.\n\nI apologized, but truth be told I don't see…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "discordの読書会サーバーで、ある人が「私はこの国の人です」と書いているのに気づきました。\nと書いている人がいたので、DMで「私たちの言語で書かれた良い本はないですか？\nをDMで送りました。しかし、10分後、Modが私に警告を発しました。\nを公開チャットで警告されました。\n\n私は謝罪しましたが、正直なところ、私は...",
      "title": "は、実際にDMを送るのは失礼なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在一个看书的服务器上，注意到有人写着他们是来自\n和我来自同一个国家，所以我决定用DM询问他们是否能推荐一本好的\n我们语言的书。没有得到回应--但10分钟后，一个管理员在公共聊天中警告我\n在公共聊天中警告我。\n\n我道歉了，但说实话，我没有看到...",
      "title": "给别人发短信实际上是不礼貌的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在一個看書的服務器上，注意到有人寫着他們是來自\n和我來自同一個國家，所以我決定用DM詢問他們是否能推薦一本好的\n我們語言的書。沒有得到回應--但10分鐘後，一個管理員在公共聊天中警告我\n在公共聊天中警告我。\n\n我道歉了，但說實話，我沒有看到...",
      "title": "給別人發短信實際上是不禮貌的嗎？"
    }
  ]
}