{
  "author": "jimfird",
  "original_created_utc": 1660387607,
  "title": "ETH back over $2,000 for first time since May 25",
  "created_utc": 1660423337,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Pleasantly surprised to wake up to ETH being back over $2,000. Feels like it’s been forever but according to CMC data it was last over that mark at 12am on May 25th, so a little less than 3 months ago.&lt;/p&gt;\n\n&lt;p&gt;Is it just pumping because of the upcoming merge or is this the start of the next crypto rally? I tend to think this is a bit of a bull trap/bear rally, whatever you want to call it. &lt;/p&gt;\n\n&lt;p&gt;My reason being for that is because the last couple major bull runs for crypto had a lot to do with high levels of cheap liquidity coming into the crypto markets (stimulus checks, very low borrowing rates, etc.). We don’t have these economic conditions in play currently. &lt;/p&gt;\n\n&lt;p&gt;My plan is to continue buying on dips as I see them (mainly BTC and ETH, 80% of my portfolio) but not going in heavy now and saving more dry powder to wait on the next dips back towards the $1,500 range. Good luck to all!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 361,
  "permalink": "/r/CryptoCurrency/comments/wnbm4q/eth_back_over_2000_for_first_time_since_may_25/",
  "subreddit": "CryptoCurrency",
  "id": "wnbm4q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Pleasantly surprised to wake up to ETH being back over $2,000. Feels like it’s\nbeen forever but according to CMC data it was last over that mark at 12am on May\n25th, so a little less than 3 months ago.\n\nIs it just pumping because of the upcoming merge or is this the start of the\nnext crypto rally?…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ETHが2,000ドルを超えて戻ってきたことに嬉しい驚きを覚えた。もうずっと前のことのように感じますが\nCMCのデータによると、最後にこのマークを超えたのは5月25日の午前12時でした。\nということは、3ヶ月弱前ということになります。\n\nそれはちょうど今度の合併のためにポンピングしているのか、それともこれは次の暗号ラリーの始まりなのでしょうか？\n次の暗号ラリーの始まりなのか？",
      "title": "ETHが5月25日以来の2,000ドル超を回復"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一觉醒来，ETH回到了2000美元以上，令人欣喜。感觉就像它已经\n但根据CMC的数据，它最后一次超过这个大关是在5月25日上午12点。\n25日，所以不到3个月的时间。\n\n它只是因为即将到来的合并而被抽走，还是这是它的开始？\n下一次加密货币涨势的开始？",
      "title": "ETH自5月25日以来首次回到2000美元以上"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一覺醒來，ETH回到了2000美元以上，令人欣喜。感覺就像它已經\n但根據CMC的數據，它最後一次超過這個大關是在5月25日上午12點。\n25日，所以不到3個月的時間。\n\n它只是因爲即將到來的合併而被抽走，還是這是它的開始？\n下一次加密貨幣漲勢的開始？",
      "title": "ETH自5月25日以來首次回到2000美元以上"
    }
  ]
}