{
  "author": "Qmobss",
  "original_created_utc": 1626729937,
  "title": "Is there a name for this feeling?",
  "created_utc": 1626760464,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi. Sometimes I get this intense feeling of everything being &quot;real&quot;. Like, I&#39;ll move my limbs and think &quot;holy fuck, I&#39;m actually an alive person&quot; or if I&#39;m with people it might be &quot;Holy crap, these people are real&quot;. Sometimes it&#39;s kind of a cool feeling but othertimes it feels quite overwhelming and I become anxious. I&#39;ve tried googling this but all the comes up is &quot;derealization&quot; which seems to be the exact opposited of what I experience. Is there a name for this feeling?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/onnmsm/is_there_a_name_for_this_feeling/",
  "subreddit": "TooAfraidToAsk",
  "id": "onnmsm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi. Sometimes I get this intense feeling of everything being \"real\". Like, I'll\nmove my limbs and think \"holy fuck, I'm actually an alive person\" or if I'm with\npeople it might be \"Holy crap, these people are real\". Sometimes it's kind of a\ncool feeling but othertimes it feels quite overwhelming and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。私は時々、すべてが「現実」であるという強烈な感覚に襲われます。例えば、手足を動かすと\n手足を動かして「なんてこった、俺は実際に生きている人間なんだ」と思ったり、人と一緒にいると\n人と一緒にいると「なんてこった、この人たちは本物だ」と思うかもしれません。時々、それは一種のクールな\n時にはクールな気分になりますが、他の時には非常に圧倒されて...。",
      "title": "この感覚に名前はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，有时我会有这种强烈的感觉，觉得一切都很 \"真实\"。比如，我会\n我移动我的四肢，并认为 \"他妈的，我实际上是一个活人\"，或者如果我与\n如果我和人们在一起，就会觉得 \"我靠，这些人是真的\"。有时它是一种\n但在其他时候，它感觉很压抑，而且... ...",
      "title": "这种感觉有什么名字吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，有時我會有這種強烈的感覺，覺得一切都很 \"真實\"。比如，我會\n我移動我的四肢，並認爲 \"他媽的，我實際上是一個活人\"，或者如果我與\n如果我和人們在一起，就會覺得 \"我靠，這些人是真的\"。有時它是一種\n但在其他時候，它感覺很壓抑，而且... ...",
      "title": "這種感覺有什麼名字嗎？"
    }
  ]
}