{
  "author": "Accomplished-Design7",
  "the_new_excerpt": "I cannot believe so many people I know are not staking their coins and if you\nare in for the longrun. Why wouldn't you be staking?!\n\nStaking is a form of passive income. You stake your coin and you shall receive\nsome interest for staking it. Think of it as interest you get for putting your\nmoney in…",
  "original_created_utc": 1624202302,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "信じられないことに、多くの人が自分のコインをステークしていません。\nは長い目で見てください。なぜステーキングをしないのでしょうか？\n\nステーキングは受動的収入の一形態です。自分のコインを賭けて、ステークした分だけ\n利子を受け取ることができます。お金を入れることで得られる利子だと思ってください。\nお金を預けることで得られる利息だと思ってください...",
      "title": "\"Give a steak and he'll eat for a day. ステーキを教えれば永遠に食べ続ける。\" - ジョージエフ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我无法相信我认识的这么多人都没有为他们的硬币做赌注，如果你\n是长期的。你为什么不押注呢？\n\n赌注是一种被动收入的形式。你用你的硬币做赌注，你将收到\n一些利息。把它看作是你把你的钱放在\n钱放在...",
      "title": "\"给一个人一块牛排，他就能吃一天。教一个人打桩，他就会永远吃下去。\" - 乔治夫"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我無法相信我認識的這麼多人都沒有爲他們的硬幣做賭注，如果你\n是長期的。你爲什麼不押注呢？\n\n賭注是一種被動收入的形式。你用你的硬幣做賭注，你將收到\n一些利息。把它看作是你把你的錢放在\n錢放在...",
      "title": "\"給一個人一塊牛排，他就能喫一天。教一個人打樁，他就會永遠喫下去。\" - 喬治夫"
    }
  ],
  "title": "\"Give a man a steak and he'll eat for a day. Teach a man to stake he eats forever.\" - Georgeev",
  "created_utc": 1624242244,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I cannot believe so many people I know are not staking their coins and if you are in for the longrun. <strong><em>Why wouldn&#39;t you be staking?!</em></strong></p>\n\n<p>Staking is a form of passive income. You stake your coin and you shall receive some interest for staking it. Think of it as interest you get for putting your money in the bank, where the only difference is the interest in staking isn&#39;t as crappy as those nasty banks. The more you stake the more you take. Let&#39;s use ADA as an example. On the Binance exchange if you stake your ADAs for 15 days you can get an APY of 17.79% (This 17.79% is a promotion, the usual APY would be 5.09% for 30 days, &amp;.79% for 60 days and 9.32% for 90 days).</p>\n\n<p>It involves holding funds in a <strong>cryptocurrency</strong> wallet to support the security and operations of a <strong>blockchain</strong> network. <strong>Simply</strong> put, <strong>staking</strong> is the act of locking cryptocurrencies to receive rewards. In most cases, you&#39;ll be able to stake your coins directly from your <strong>crypto</strong>wallet. One example is the Trust  Wallet.</p>\n\n<p><strong><em>Once again if you plan to HODL, then staking is a good friend of yours.</em></strong></p>\n\n<p>In simple English: You <strong>giveth</strong> to stake and you <strong>taketh</strong> more cryptos</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/o47wo4/give_a_man_a_steak_and_hell_eat_for_a_day_teach_a/",
  "subreddit": "CryptoCurrency",
  "id": "o47wo4",
  "is_self": true,
  "media": null,
  "is_video": false
}