{
  "author": "Bangkok-Boy",
  "original_created_utc": 1639664452,
  "title": "I was adamant that Bitcoin was a pyramid scheme. It was so obvious to me. Here’s a laugh for you.",
  "created_utc": 1639668793,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;About 4-5 years ago I sat at a bar here in Bangkok and argued with an English mate about Bitcoin. I’m an engineer and mathematician and had studied it extensively. &lt;/p&gt;\n\n&lt;p&gt;We argued for hours. To prove my point, I said I would buy one Bitcoin and happily lose it when the system collapsed to prove my point. So I bought one BTC for around US$4,000. &lt;/p&gt;\n\n&lt;p&gt;We argued for years. &lt;/p&gt;\n\n&lt;p&gt;I sold it a few months ago for $48,000. Best investment I ever made!!! &lt;/p&gt;\n\n&lt;p&gt;Ha ha. I wish I’d bought more.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 184,
  "permalink": "/r/Bitcoin/comments/rhrplg/i_was_adamant_that_bitcoin_was_a_pyramid_scheme/",
  "subreddit": "Bitcoin",
  "id": "rhrplg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "About 4-5 years ago I sat at a bar here in Bangkok and argued with an English\nmate about Bitcoin. I’m an engineer and mathematician and had studied it\nextensively.\n\nWe argued for hours. To prove my point, I said I would buy one Bitcoin and\nhappily lose it when the system collapsed to prove my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "4～5年前、バンコクのバーで、イギリス人と口論になったことがある。\nビットコインについて 私はエンジニアであり数学者であり、ビットコインを研究していました。\nを広げた。\n\n私たちは何時間も議論しました。自分の主張を証明するために、私は1ビットコインを買って\nシステムが崩壊したとき、喜んでそれを失い、私の...",
      "title": "私は、ビットコインはマルチ商法であると断言しました。私にはとても明白でした ここに笑いがあります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大约4-5年前，我坐在曼谷的一个酒吧里，和一个英国人争论起比特币。\n关于比特币。我是一个工程师和数学家，对它进行了广泛的研究。\n广泛的研究。\n\n我们争论了几个小时。为了证明我的观点，我说我要买一个比特币，然后在系统崩溃的时候高兴地失去它。\n当系统崩溃时，我很乐意失去它，以证明我的...",
      "title": "我坚持认为，比特币是一个传销组织。这对我来说是如此明显。这是给你的一个笑料。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大約4-5年前，我坐在曼谷的一個酒吧裏，和一個英國人爭論起比特幣。\n關於比特幣。我是一個工程師和數學家，對它進行了廣泛的研究。\n廣泛的研究。\n\n我們爭論了幾個小時。爲了證明我的觀點，我說我要買一個比特幣，然後在系統崩潰的時候高興地失去它。\n當系統崩潰時，我很樂意失去它，以證明我的...",
      "title": "我堅持認爲，比特幣是一個傳銷組織。這對我來說是如此明顯。這是給你的一個笑料。"
    }
  ]
}