{
  "author": "abcdef1239",
  "original_created_utc": 1652557313,
  "title": "Why do people force introverts into social situations to get them out of their comfort zone, but don’t isolate extroverts to get them out of theirs?",
  "created_utc": 1652569056,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Now listen, I think isolating people is BAD, but I also think forcing introverts to be social when they don’t want to is also bad. They’re both bad and mentally draining in my opinion, but why is it so normal for people to push introverts into situations that make them uncomfortable?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/uporba/why_do_people_force_introverts_into_social/",
  "subreddit": "TooAfraidToAsk",
  "id": "uporba",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Now listen, I think isolating people is BAD, but I also think forcing introverts\nto be social when they don’t want to is also bad. They’re both bad and mentally\ndraining in my opinion, but why is it so normal for people to push introverts\ninto situations that make them uncomfortable?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、私は人を孤立させることは悪いことだと思いますが、内向的な人を強制することも悪いことだと思います。\n内向的な人に社交的であることを強要することも悪いことだと思います。どちらも悪いことであり、精神的に\n内向的な人たちを、そのような状況に追い込むことが、なぜそんなに普通なのでしょうか。\n内向的な人を不快にさせるような状況に追い込むのが普通なのでしょうか？",
      "title": "なぜ人々は、内向的な人を無理やり社会的な状況に追いやって自分の快適な領域から出させるのに、外向的な人を孤立させて自分の領域から出させないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在听着，我认为孤立人们是不好的，但我也认为强迫内向的人\n但我也认为强迫内向的人在他们不愿意的情况下参加社交活动也是不好的。在我看来，这两种做法都是不好的，都是精神上的消耗。\n在我看来，它们都是坏事，都是精神上的消耗，但为什么人们把内向的人推给别人就这么正常呢？\n逼迫内向的人进入让他们感到不舒服的环境，为什么这么正常？",
      "title": "为什么人们强迫内向的人进入社交场合，让他们走出自己的舒适区，却不把外向的人孤立起来，让他们走出自己的舒适区？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在聽着，我認爲孤立人們是不好的，但我也認爲強迫內向的人\n但我也認爲強迫內向的人在他們不願意的情況下參加社交活動也是不好的。在我看來，這兩種做法都是不好的，都是精神上的消耗。\n在我看來，它們都是壞事，都是精神上的消耗，但爲什麼人們把內向的人推給別人就這麼正常呢？\n逼迫內向的人進入讓他們感到不舒服的環境，爲什麼這麼正常？",
      "title": "爲什麼人們強迫內向的人進入社交場合，讓他們走出自己的舒適區，卻不把外向的人孤立起來，讓他們走出自己的舒適區？"
    }
  ]
}