{
  "author": "Bobknows27",
  "the_new_excerpt": "I have read too many posts about the dip, about investing too aggressively, and\nabout investing irresponsibly to stay silent.\n\nBitcoin is not a short term investment. Bitcoin is not a medium term investment.\nBitcoin is a lifetime+ investment.\n\nCrypto is an emerging market. It may have as monumental…",
  "original_created_utc": 1622263010,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ディップについて、積極的すぎる投資について、無責任な投資について、あまりにも多くの記事を読んだので、黙っていられませんでした。\n無責任な投資についての記事をあまりにも多く読んだので、黙っていられませんでした。\n\nビットコインは短期的な投資ではありません。ビットコインは、中期的な投資ではありません。\nビットコインは生涯＋αの投資です。\n\n暗号は新興市場である。それは記念碑的なものとして持っているかもしれない...",
      "title": "ビットコインは、1年、4年、X年の投資ではありません。ビットコインは生涯＋αの投資です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我读了太多关于下跌的帖子，关于投资过于激进，以及\n关于不负责任的投资的帖子，让我保持沉默。\n\n比特币不是一项短期投资。比特币不是一个中期投资。\n比特币是一种终身投资。\n\nCrypto是一个新兴市场。它可能有如不朽的...",
      "title": "比特币不是1、4或X年的投资。比特币是一种终身投资。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我讀了太多關於下跌的帖子，關於投資過於激進，以及\n關於不負責任的投資的帖子，讓我保持沉默。\n\n比特幣不是一項短期投資。比特幣不是一箇中期投資。\n比特幣是一種終身投資。\n\nCrypto是一個新興市場。它可能有如不朽的...",
      "title": "比特幣不是1、4或X年的投資。比特幣是一種終身投資。"
    }
  ],
  "title": "Bitcoin is not a 1, 4, or X year investment. Bitcoin is a lifetime+ investment.",
  "created_utc": 1622312922,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have read too many posts about the dip, about investing too aggressively, and about investing irresponsibly to stay silent.</p>\n\n<p>Bitcoin is not a short term investment. Bitcoin is not a medium term investment. Bitcoin is a lifetime+ investment.</p>\n\n<p>Crypto is an emerging market. It may have as monumental effects as the internet. But, the internet was not built in a day, and neither will be crypto. Indeed, even certain effects of the internet are yet to be realized.</p>\n\n<p>Many people focus on the stock-to-flow model or the 4-year halvening cycle. These do not matter. Even this year, we&#39;ve seen significantly different behaviour than predicted. Still, this is a drop in the ocean of finance. Bitcoin recently had significant price movement based only on a tweet from Elon Musk. This is not a robust, well-established market. Bitcoin (and all crypto) is still far from its true value.</p>\n\n<p>It is painfully obvious that our grandchildren will use some cryptocurrency as their primary store of value and currency. We cannot say exactly which cryptocurrency that will be, but there&#39;s very good odds that it will be Bitcoin. It is far from obvious whether cryptocurrency will be of any value within any of our lifetimes. Do not invest money that you will need in one year. Do not invest money that you will want within 10 years. Do invest money that you intend for your children and grandchildren to inherit. Do invest money in a variety of established cryptocurrencies. Do invest the majority in Bitcoin, the largest existing cryptocurrency.</p>\n\n<p>There are a number of shills and get-rich-quick schemes out there and it&#39;s easy to categorize Bitcoin as one. The fundamental reasons for investing in Bitcoin are sound, but extremely long term. Just because you&#39;re right today doesn&#39;t mean you&#39;ll be paid tomorrow. Actively work against hype - it clouds our core message and investment theses. For Bitcoin to succeed we not only need to build the best Cryptocurrency, but also a community which is not culty and overly optimistic, but rather conservative, rational, and welcoming. This is a rare case where your own actions and attitude can affect the value of your investment. Take care.</p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/Bitcoin/comments/nnfm1q/bitcoin_is_not_a_1_4_or_x_year_investment_bitcoin/",
  "subreddit": "Bitcoin",
  "id": "nnfm1q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804293697
}