{
  "author": "miki77miki",
  "original_created_utc": 1636082858,
  "title": "The crypto community used to be rooted in libertarian ideals, now it's all people trying to make a buck",
  "created_utc": 1636105245,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I almost feel like an old man harkening back to &quot;the good ole days&quot; but for the ones that have been around since the early days (Before $1k+++ BTC) know how deeply rooted the crypto community was in libertarian ideals toward the start. For the most part, no one knew how big bitcoin and the crypto space would really be, and most didn&#39;t support bitcoin and the concept of cryptocurrency for price gains (Since there wasn&#39;t much) but for ideological reasons of freedom from the excessive power that the government holds over us and the monetary system. It nearly breaks my heart that the community has gone so far from the ideals it was based on and has turned more into a circlejerk of people trying to become millionaires rather than on the incredible freeing power that bitcoin and other cryptos can have for the regular, common person. I&#39;m sure this will get lost to the other SHIB X10000 and gov loving posts but I hope some will step back from the intoxicating ideas of getting big gains and focus more on the freedom of decentralized currency and the ideals the crypto community is based on. Also taxation is theft</p>\n\n<p><strong>The Times 03/Jan/2009 Chancellor on brink of second bailout for banks</strong></p>\n\n<p>(What crypto is really about)</p>\n\n<p>Edit: I love the downvotes! It only further solidifies how far this community has strayed from it&#39;s original ideals</p>\n</div><!-- SC_ON -->",
  "score": 192,
  "permalink": "/r/CryptoCurrency/comments/qn2935/the_crypto_community_used_to_be_rooted_in/",
  "subreddit": "CryptoCurrency",
  "id": "qn2935",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I almost feel like an old man harkening back to \"the good ole days\" but for the\nones that have been around since the early days (Before $1k+++ BTC) know how\ndeeply rooted the crypto community was in libertarian ideals toward the start.\nFor the most part, no one knew how big bitcoin and the crypto…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昔を懐かしむ老人のような気分ですが、初期の頃（BTCが1ドル以上になる前）からいる人にとっては\n初期の頃（BTCが1ドル以上になる前）からいる人にとっては、暗号コミュニティが最初の頃、どれだけリバタリアンの理想に深く根ざしていたかを知っています。\nしかし、初期の頃（BTCが1,000ドル以上になる前）から活動している人は、暗号コミュニティが当初からリバタリアンの理想に深く根ざしていたことを知っています。\nほとんどの人は、ビットコインや暗号コミュニティがどれほど大きな存在であるかを知りませんでした...",
      "title": "かつて暗号コミュニティはリバタリアンの理想に根ざしていたが、今は金儲けに走る人々ばかりだ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我几乎觉得自己像个老人，在回味 \"美好的过去\"，但对于\n但对于那些从早期（在1千美元以上的BTC之前）就已经存在的人来说，他们知道\n但对于那些从早期就在这里的人（在1千美元以上的BTC之前）来说，他们知道加密货币社区在一开始就深深地扎根于自由主义的理想中。\n在大多数情况下，没有人知道比特币和加密货币有多大。",
      "title": "加密社区曾经植根于自由主义理想，现在都是想赚钱的人了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我幾乎覺得自己像個老人，在回味 \"美好的過去\"，但對於\n但對於那些從早期（在1千美元以上的BTC之前）就已經存在的人來說，他們知道\n但對於那些從早期就在這裏的人（在1千美元以上的BTC之前）來說，他們知道加密貨幣社區在一開始就深深地紮根於自由主義的理想中。\n在大多數情況下，沒有人知道比特幣和加密貨幣有多大。",
      "title": "加密社區曾經植根於自由主義理想，現在都是想賺錢的人了"
    }
  ]
}