{
  "author": "el_palmera",
  "original_created_utc": 1626444033,
  "title": "How I finally got my crypto off of robinhoid (and a guide)",
  "created_utc": 1626460658,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been stuck in robinhood since January. Even after everything that went down, and knowing that I didn&#39;t actually own my crypto, I didn&#39;t want to try and get out because 1. Everything would be taxed, because you can&#39;t transfer coins from robinhood, you have to sell then and just rebuild elsewhere. And 2. The process of money getting to your bank from rh could take a week, which is extremely stressful in this market.</p>\n\n<p>So how did I finally get out? After some research and some help from this sub, I figured out how to minimize the risks. I should let you know that, even though this method allows you to almost instantly transfer from rh to coinbase, your coins will STILL be taxed. There is just no way around that.</p>\n\n<ol>\n<li><p>Go to the money management tab on RH and enable it. This will turn your RH account into a bank.</p></li>\n<li><p>Go to coinbase pro and list a new source of funding. You will be able to list you new RH account.</p></li>\n<li><p>Depending on your coinbase daily deposit limit (mine was 2000$) you can sell chunks of your crypto in that amount, and then immediately deposit that 2000 into coinbase, where you can buy your own coins to do what you wish with.</p></li>\n<li><p>Repeat until you are finished.</p></li>\n</ol>\n\n<p>Yes, it really is that easy. I wish I&#39;d known about it a long time ago. I can&#39;t tell you how nice it is to finally own my crypto after so long. Hopefully this helps some people who were in my situation</p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/CryptoCurrency/comments/olhf9l/how_i_finally_got_my_crypto_off_of_robinhoid_and/",
  "subreddit": "CryptoCurrency",
  "id": "olhf9l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been stuck in robinhood since January. Even after everything that went\ndown, and knowing that I didn't actually own my crypto, I didn't want to try and\nget out because 1. Everything would be taxed, because you can't transfer coins\nfrom robinhood, you have to sell then and just rebuild…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1月からロビンフッドにはまっています。すべてが終わった後でも\n自分の暗号を実際には所有していないことを知っていても、出ようとはしませんでした。\n1. ロビンフッドからコインを送金することはできないので、すべてに課税されます。\nロビンフッドからコインを譲渡することはできないので、売却して再構築しなければなりません...",
      "title": "robinhoidから最終的にcryptoを入手した方法（とガイド"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从一月份开始就一直被困在Robinhood。即使在发生了一切\n我知道我实际上并不拥有我的加密货币，我不想尝试和\n出，因为1. 一切都会被征税，因为你不能将硬币\n因为你不能从Robinhood转移硬币，你必须卖掉，然后重新建立...",
      "title": "我是如何最终从Robinhoid上获得我的加密货币的（和一个指南"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從一月份開始就一直被困在Robinhood。即使在發生了一切\n我知道我實際上並不擁有我的加密貨幣，我不想嘗試和\n出，因爲1. 一切都會被徵稅，因爲你不能將硬幣\n因爲你不能從Robinhood轉移硬幣，你必須賣掉，然後重新建立...",
      "title": "我是如何最終從Robinhoid上獲得我的加密貨幣的（和一個指南"
    }
  ]
}