{
  "author": "Confucius3000",
  "original_created_utc": 1627644883,
  "title": "Why is the Bible written in such a weird style?",
  "created_utc": 1627651837,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently rewatched &quot;Monty Python and the Holy Grail&quot;, and the Holy Hand Grenade sequence reminded me of the strange quirks of the Bible texts. Long enumerations, very redundant phrases (think Mojo Jojo overexplaining what he does), and much more. Seems like the Pythons were also aware of these quirks, as they reflect them perfectly in their dialogue, which I copy below:</p>\n\n<p>&quot; <em>&quot;And Saint Attila raised the hand grenade up on high, saying, &#39;O Lord,  bless this thy hand grenade, that with it thou mayst blow thine enemies  to tiny bits, in thy mercy.&#39; And the Lord did grin. And the people did  feast upon the lambs, and sloths, and carp, and anchovies, and  orangutans, and breakfast cereals, and fruit bats, and large chulapas.  And the Lord spake, saying,   &#39;First shalt thou take out the Holy Pin. Then shalt thou count to  three, no more, no less. Three shall be the number thou shalt count, and  the number of the counting shall be three. Four shalt thou not count,  neither count thou two, excepting that thou then proceed to three. Five  is right out. Once the number three, being the third number, be reached,  then lobbest thou thy Holy Hand Grenade of Antioch towards thy foe,  who, being naughty in My sight, shall snuff it.&#39;</em>  &quot;</p>\n\n<p>Why was the Bible written that way? Is it a translation issue, or a characteristic of Greek or Aramaic? A ritualized manner of speech? Or was it just the way people wrote at the time?</p>\n</div><!-- SC_ON -->",
  "score": 139,
  "permalink": "/r/AskHistorians/comments/ouivvt/why_is_the_bible_written_in_such_a_weird_style/",
  "subreddit": "AskHistorians",
  "id": "ouivvt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I recently rewatched \"Monty Python and the Holy Grail\", and the Holy Hand\nGrenade sequence reminded me of the strange quirks of the Bible texts. Long\nenumerations, very redundant phrases (think Mojo Jojo overexplaining what he\ndoes), and much more. Seems like the Pythons were also aware of these…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、「モンティ・パイソンと聖杯」を再見したのですが、聖なる手の\n手榴弾のシークエンスは、聖書のテキストの奇妙なクセを思い出させてくれました。長い\n冗長な表現（モジョ・ジョジョが自分のしていることを過剰に説明しているようなもの）などなど。\nなどがありました。パイソンズもこれらを意識していたようだが...。",
      "title": "なぜ聖書はあんなに奇妙なスタイルで書かれているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近重新观看了《巨蟒与圣杯》，其中的圣手\n手榴弹的情节让我想起了《圣经》文本中的奇怪怪癖。长长的\n冗长的列举，非常多余的短语（想想莫乔乔过度解释他所做的事情\n做的事情），以及更多。似乎俾斯麦人也意识到了这些...",
      "title": "为什么《圣经》的写作风格如此怪异？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近重新觀看了《巨蟒與聖盃》，其中的聖手\n手榴彈的情節讓我想起了《聖經》文本中的奇怪怪癖。長長的\n冗長的列舉，非常多餘的短語（想想莫喬喬過度解釋他所做的事情\n做的事情），以及更多。似乎俾斯麥人也意識到了這些...",
      "title": "爲什麼《聖經》的寫作風格如此怪異？"
    }
  ]
}