{
  "author": "sharksgivethebestbjs",
  "original_created_utc": 1632964931,
  "title": "A standard internal combustion engine burns fuel and oxygen, which burns to produce a greater number of gas molecules as well as heat. Assuming that both of these produce power, which one produces most of the power? The heat excess or the stoichiometric excess?",
  "created_utc": 1632981355,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>At a simple glance C8H18+13.5O2=8CO2+9H2O, or 14.5 gas molecules into 17 gas molecules. Is this the greater cause of pressure in the cylinder, or the heat given off and the resulting expansion (roughly online with the ideal gas law)?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askscience/comments/py9bvs/a_standard_internal_combustion_engine_burns_fuel/",
  "subreddit": "askscience",
  "id": "py9bvs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "At a simple glance C8H18+13.5O2=8CO2+9H2O, or 14.5 gas molecules into 17 gas\nmolecules. Is this the greater cause of pressure in the cylinder, or the heat\ngiven off and the resulting expansion (roughly online with the ideal gas law)?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "単純に考えて、C8H18+13.5O2=8CO2+9H2O、つまり14.5個の気体分子が17個の気体分子になります。\n分子になります。これは、シリンダー内の圧力が原因なのか、それとも熱が発生して膨張することが原因なのか？\n放出された熱とその結果としての膨張（理想気体の法則とほぼ一致）？",
      "title": "一般的な内燃機関では、燃料と酸素を燃焼させて、より多くの気体分子と熱を発生させます。この両方が動力を生み出すと仮定した場合、どちらが動力を多く生み出すでしょうか？熱の過剰分か、それとも化学量論的な過剰分か？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "简单来说，C8H18+13.5O2=8CO2+9H2O，或者说14.5个气体分子变成17个气体分子。\n分子。这是导致气缸内压力增加的主要原因，还是放出的热量以及由此产生的膨胀（与理想气体定律大致相同）？\n放出的热量和由此产生的膨胀（大致与理想气体定律一致）？",
      "title": "一个标准的内燃机燃烧燃料和氧气，燃烧后产生更多的气体分子以及热量。假设这两者都产生动力，哪一个产生的动力最多？是热量过剩还是化学计量过剩？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "簡單來說，C8H18+13.5O2=8CO2+9H2O，或者說14.5個氣體分子變成17個氣體分子。\n分子。這是導致氣缸內壓力增加的主要原因，還是放出的熱量以及由此產生的膨脹（與理想氣體定律大致相同）？\n放出的熱量和由此產生的膨脹（大致與理想氣體定律一致）？",
      "title": "一個標準的內燃機燃燒燃料和氧氣，燃燒後產生更多的氣體分子以及熱量。假設這兩者都產生動力，哪一個產生的動力最多？是熱量過剩還是化學計量過剩？"
    }
  ]
}