{
  "author": "arnaudmrtn",
  "original_created_utc": 1625074462,
  "title": "Long term opinion : Bitcoin will reduce mass consumerism globally because of its deflationary effect, and therefore will help reduce climate change rate. What do you guys think?",
  "created_utc": 1625101958,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My thinking is that Bitcoin is a secured bank account available for anyone in the world. Not only it embraces third countries to preserve their wealth, but the finite supply makes value go up over time incentiving people to hold long term. In that regard, why would anyone sell something that will appreciate over time for things that will lose value like better cars, better phones or fancy clothes? I mean, if we don’t really need them, we will consume less and our planet will benefit from this. If Bitcoin goes up in value on the long term as scheduled by its mathematic algorythm, it could be a way to get out of this endless growth capitalism non-sense that is polluting earth and making people more selfish. Happy to see your thoughts on this :)</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/Bitcoin/comments/ob28a4/long_term_opinion_bitcoin_will_reduce_mass/",
  "subreddit": "Bitcoin",
  "id": "ob28a4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My thinking is that Bitcoin is a secured bank account available for anyone in\nthe world. Not only it embraces third countries to preserve their wealth, but\nthe finite supply makes value go up over time incentiving people to hold long\nterm. In that regard, why would anyone sell something that will…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の考えでは、ビットコインは安全な銀行口座であり、世界中の誰もが利用できるものです。\n世界一。第三国の富を守るために受け入れるだけでなく\n供給量に限りがあるため、時間が経つにつれて価値が上がり、長期保有するインセンティブになります。\nを長期に渡って使用することができます。その点では、なぜ誰もそのようなものを売らないのでしょうか。",
      "title": "長期的な意見 : ビットコインは、そのデフレ効果により、世界的に大量消費主義を削減し、その結果、気候変動率の削減に貢献する。皆さんはどう思われますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的想法是，比特币是一个安全的银行账户，世界上任何人都可以使用。\n的安全银行账户。它不仅支持第三国保存他们的财富，而且\n有限的供应使价值随着时间的推移而上升，激励人们长期持有\n长期持有。在这方面，为什么有人会卖掉一些将...",
      "title": "长期观点：比特币将在全球范围内减少大众消费，因为它具有通货紧缩的作用，因此将有助于降低气候变化率。你们有什么看法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的想法是，比特幣是一個安全的銀行賬戶，世界上任何人都可以使用。\n的安全銀行賬戶。它不僅支持第三國保存他們的財富，而且\n有限的供應使價值隨着時間的推移而上升，激勵人們長期持有\n長期持有。在這方面，爲什麼有人會賣掉一些將...",
      "title": "長期觀點：比特幣將在全球範圍內減少大衆消費，因爲它具有通貨緊縮的作用，因此將有助於降低氣候變化率。你們有什麼看法？"
    }
  ]
}