{
  "author": "themorrishouse",
  "original_created_utc": 1627829534,
  "title": "What really happened to Cairo, Illinois?",
  "created_utc": 1627857762,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>And why did it never—as I understand—take off the way its early promoters thought it would, being at a strategically important and commercially advantageous spot at the confluence of the Ohio and the Mississippi?</p>\n\n<p>I’ve driven through a handful of times over the years and heard all the stories—about the flooding, the railroad bypassing the city, the corruption, the racism and resulting violence, etc. But I grew up in a Midwestern river city that’s had its fair share of similar challenges over the past couple of centuries, and I’ve visited many others, and I don’t know if I’ve ever been anywhere that feels as hollowed-out and bleak as Cairo.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/ovti45/what_really_happened_to_cairo_illinois/",
  "subreddit": "AskHistorians",
  "id": "ovti45",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "And why did it never—as I understand—take off the way its early promoters\nthought it would, being at a strategically important and commercially\nadvantageous spot at the confluence of the Ohio and the Mississippi?\n\nI’ve driven through a handful of times over the years and heard all the\nstories—about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そして、なぜ初期の推進者たちが考えていたようにはいかなかったのか。\n戦略的に重要で、商業的にも有利な場所にあったからです。\nオハイオ川とミシシッピ川の合流点という、戦略的に重要で商業的にも有利な場所にあったからです。\n\n何年も前に何度か車で通ったことがあり、いろいろな話を聞きました。\n話を聞いてみると...",
      "title": "イリノイ州のカイロに何が起こったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为什么它从来没有像其早期推动者所认为的那样起飞呢？\n为什么它从来没有像它的早期发起人所想的那样起飞，因为它位于一个具有战略意义和商业利益的\n处于俄亥俄河和密西西比河的交汇处，具有战略意义和商业优势？\n\n多年来，我曾多次开车经过这里，听到了所有的\n故事--关于......",
      "title": "伊利诺伊州开罗市到底发生了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲什麼它從來沒有像其早期推動者所認爲的那樣起飛呢？\n爲什麼它從來沒有像它的早期發起人所想的那樣起飛，因爲它位於一個具有戰略意義和商業利益的\n處於俄亥俄河和密西西比河的交匯處，具有戰略意義和商業優勢？\n\n多年來，我曾多次開車經過這裏，聽到了所有的\n故事--關於......",
      "title": "伊利諾伊州開羅市到底發生了什麼？"
    }
  ]
}