{
  "author": "Set1Less",
  "original_created_utc": 1649346804,
  "title": "Kraken shut down their global headquarters in SF after employees were harassed and robbed. CEO issues a statement on rampant crime in San Francisco and failure of DA Chesa Boudin. Says SF is not safe.",
  "created_utc": 1649356338,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Kraken CEO today came out with an attack on San Francisco&amp;#39;s administration after their employees were attacked and robbed, leading to the closure of Kraken&amp;#39;s global headquarters in San Francisco. &lt;/p&gt;\n\n&lt;p&gt;According to Kraken, business partners were also afraid to visit, and crime, drug abuse etc are out of control in the city. Kraken has blamed the policies of District Attorney Chesa Boudin.&lt;/p&gt;\n\n&lt;p&gt;He says &amp;quot;San Francisco is not safe and will not be safe until we have a DA who puts the rights of law abiding citizens above those of the street criminals he so ingloriously protects.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/leqkz1nqo4s81.jpg?width=1330&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=9782f5a70d2afe1961002145d8046956221a62fc\"&gt;Full statement by Kraken CEO Jesse Powell, RT&amp;#39;d by him as well...&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 1386,
  "permalink": "/r/CryptoCurrency/comments/tyg33o/kraken_shut_down_their_global_headquarters_in_sf/",
  "subreddit": "CryptoCurrency",
  "id": "tyg33o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Kraken CEO today came out with an attack on San Francisco's administration after\ntheir employees were attacked and robbed, leading to the closure of Kraken's\nglobal headquarters in San Francisco.\n\nAccording to Kraken, business partners were also afraid to visit, and crime,\ndrug abuse etc are out of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "KrakenのCEOは本日、サンフランシスコの行政を攻撃する発言をしました。\nKrakenの従業員が襲撃され、強盗に襲われたため、Krakenは閉鎖されました。\nのグローバル本社を設立しました。\n\nKrakenによると、ビジネスパートナーも訪問を恐れており、犯罪\n薬物乱用などは論外です。",
      "title": "Krakenは、従業員が嫌がらせや強盗に遭ったため、SFのグローバル本社を閉鎖しました。CEOがサンフランシスコの犯罪の横行とチェサ・ブーダン検事の失態について声明を発表。サンフランシスコは安全ではないと語る。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Kraken首席执行官今天出来攻击旧金山的行政部门，因为他们的员工被攻击和抢劫，导致Kraken公司关闭。\n他们的员工被袭击和抢劫，导致Kraken的\n导致Kraken在旧金山的全球总部关闭。\n\n根据Kraken的说法，商业伙伴也不敢去参观，犯罪。\n滥用药物等都出...",
      "title": "Kraken在员工被骚扰和抢劫后关闭了他们在旧金山的全球总部。首席执行官就旧金山猖獗的犯罪和检察官Chesa Boudin的失败发表声明。表示三藩市并不安全。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Kraken首席執行官今天出來攻擊舊金山的行政部門，因爲他們的員工被攻擊和搶劫，導致Kraken公司關閉。\n他們的員工被襲擊和搶劫，導致Kraken的\n導致Kraken在舊金山的全球總部關閉。\n\n根據Kraken的說法，商業夥伴也不敢去參觀，犯罪。\n濫用藥物等都出...",
      "title": "Kraken在員工被騷擾和搶劫後關閉了他們在舊金山的全球總部。首席執行官就舊金山猖獗的犯罪和檢察官Chesa Boudin的失敗發表聲明。表示三藩市並不安全。"
    }
  ]
}