{
  "author": "Gonzo1888",
  "original_created_utc": 1656085794,
  "title": "How did for example Roman soldiers look after their feet when marching huge distances?",
  "created_utc": 1656172513,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve just hiked 71 miles in 5 days and I have to say my feet are pretty broken. They hurt like hell and I have some nasty blisters. Which is probably down to my socks and footwear, but that is not the issue here! When I was walking particularly on my final day the question above was all I could think about. &lt;/p&gt;\n\n&lt;p&gt;They walked for miles and I have seen their footwear, it did not look comfortable. Did they just tough it out or was it a case that it’s just how the grew up so their feet were used to it? Thanks&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/vjri9q/how_did_for_example_roman_soldiers_look_after/",
  "subreddit": "AskHistorians",
  "id": "vjri9q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve just hiked 71 miles in 5 days and I have to say my feet are pretty broken.\nThey hurt like hell and I have some nasty blisters. Which is probably down to my\nsocks and footwear, but that is not the issue here! When I was walking\nparticularly on my final day the question above was all I could…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "5日間で71マイルを歩いたが、足がかなり壊れたと言わざるを得ない。\n地獄のように痛いし、ひどい水ぶくれができた。これはおそらく靴下と靴のせいだと思うのですが\n靴下と靴のせいかもしれませんが、それはここでは問題ではありません。歩いているとき\n特に最終日には、上記の質問で頭がいっぱいでした...",
      "title": "例えば、ローマ軍の兵士は、長距離を行進する際、足をどのようにケアしていたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚在5天内徒步走了71英里，我不得不说我的脚已经很破了。\n它们疼得要命，而且我有一些讨厌的水泡。这可能是由于我的\n袜子和鞋类，但这并不是问题所在 当我在行走时\n特别是在最后一天，上面的问题是我所能...",
      "title": "例如，罗马士兵在长距离行军时是如何照顾他们的脚的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛在5天內徒步走了71英里，我不得不說我的腳已經很破了。\n它們疼得要命，而且我有一些討厭的水泡。這可能是由於我的\n襪子和鞋類，但這並不是問題所在 當我在行走時\n特別是在最後一天，上面的問題是我所能...",
      "title": "例如，羅馬士兵在長距離行軍時是如何照顧他們的腳的？"
    }
  ]
}