{
  "author": "potaloma",
  "original_created_utc": 1632272086,
  "title": "This dip might look really juicy, but wait for buy signals before going in",
  "created_utc": 1632325398,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>These are good prices to enter at, but for your own good, wait at least one day to see what happens. I was going to buy in this evening, but I decided to do some more reading and saw that this Evergrande panic is not only happening now, but will go into full force soon. Evergrande&#39;s loan payment is due on the sept 23rd, and they have publicly stated they cannot guarantee they can repay it. </p>\n\n<p>If the CCP does not bail them out, it will have a snowball effect on other companies, creating a staggering amount of liquidations. This could result in significant drops in cryptocurrency prices over time. </p>\n\n<p>Already more than $1 billion was liquidated in this 24 hour period, bringing the total liquidation in 48 hours to more than $2.5 billion.</p>\n\n<p>Furthermore, the Chinese exchanges will open at 6:30 p.m. PST. You may notice a significant drop at that point, which may or may not worsen as their trading day progresses. The panic will hit us then. </p>\n\n<p>Right now we don’t know how far we are going to slide. It is a huge risk to hold the bag while big whales dump on us. It might be wisest to liquidate before China markets open, and DCA once we start seeing some real buy signals and not just dead cat bounces. Unless you have f u money please make sure you have enough fiat to ride the wave til the next rent bill. </p>\n\n<p>What’s my next move? DCA little by little and keep a close eye on the trading volume. </p>\n\n<p>Stay safe, everyone, and let&#39;s hope we recover quickly...</p>\n\n<p><strong>This is just speculation and not financial advice</strong></p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/pswdv0/this_dip_might_look_really_juicy_but_wait_for_buy/",
  "subreddit": "CryptoCurrency",
  "id": "pswdv0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "These are good prices to enter at, but for your own good, wait at least one day\nto see what happens. I was going to buy in this evening, but I decided to do\nsome more reading and saw that this Evergrande panic is not only happening now,\nbut will go into full force soon. Evergrande's loan payment is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これらはエントリーするには良い価格ですが、ご自身のためにも、少なくとも1日は待ってください。\n様子を見てください。私は今日の夕方に買おうと思っていましたが、もう少し読んでみることにしました。\n読んでみると、このEvergrandeのパニックは今だけではなく、もうすぐ本格化するようです。\nもうすぐ本格的に始まる。Evergrandeのローン支払いは...",
      "title": "このディップは本当にジューシーに見えるかもしれませんが、買いシグナルを待ってから入りましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这些都是很好的入市价格，但为了你自己的利益，至少要等上一天\n看看会发生什么。我本来打算今天晚上买入，但是我决定做一些\n但我决定多读一些书，看到恒大的恐慌不仅是现在发生的。\n而且很快就会全面展开。恒大的贷款支付是...",
      "title": "这种下跌可能看起来非常多汁，但在进入之前要等待买入信号。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這些都是很好的入市價格，但爲了你自己的利益，至少要等上一天\n看看會發生什麼。我本來打算今天晚上買入，但是我決定做一些\n但我決定多讀一些書，看到恆大的恐慌不僅是現在發生的。\n而且很快就會全面展開。恆大的貸款支付是...",
      "title": "這種下跌可能看起來非常多汁，但在進入之前要等待買入信號。"
    }
  ]
}