{
  "author": "byb9069",
  "the_new_excerpt": "I see a number of posts on here about people hiding bitcoin purchases from their\nspouse (married significant other). Or how people are upsetting their spouses\nwith their bitcoin purchases.\n\nThis is not a bitcoin issue. This a marriage issue.\n\nTake the time to work an intentional plan with your…",
  "original_created_utc": 1614389567,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在这里看到一些帖子，关于人们对他们的比特币购买隐瞒了\n配偶（已婚的另一半）。或者人们如何让他们的配偶不高兴\n与他们的比特币购买。\n\n这不是一个比特币问题。这是一个婚姻问题.\n\n花点时间和你一起制定一个有针对性的计划... ...",
      "title": "配偶和比特币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在這裏看到一些帖子，關於人們對他們的比特幣購買隱瞞了\n配偶（已婚的另一半）。或者人們如何讓他們的配偶不高興\n與他們的比特幣購買。\n\n這不是一個比特幣問題。這是一個婚姻問題.\n\n花點時間和你一起制定一個有針對性的計劃... ...",
      "title": "配偶和比特幣"
    }
  ],
  "title": "Spouses and Bitcoin",
  "created_utc": 1614415256,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I see a number of posts on here about people hiding bitcoin purchases from their spouse (married significant other). Or how people are upsetting their spouses with their bitcoin purchases. </p>\n\n<p>This is not a bitcoin issue. This a marriage issue. </p>\n\n<p>Take the time to work an intentional plan with your spouse. Set goals. Make a monthly budget. And decide what to do with your money together. </p>\n\n<p>Your financial life is much more than just bitcoin. And you and your spouse should be working as a team. </p>\n\n<p>If you disagree on allocation into bitcoin, talk about it. Set a plan where you achieve your financial goals together, and teach your spouse how bitcoin might be part of that. And be open minded enough to understand that your spouse has goals that are more than just stacking sats.</p>\n</div><!-- SC_ON -->",
  "score": 538,
  "permalink": "/r/Bitcoin/comments/ltd2zc/spouses_and_bitcoin/",
  "subreddit": "Bitcoin",
  "id": "ltd2zc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937731103
}