{
  "author": "hereinmygarageeeee",
  "the_new_excerpt": "I'm still fairly new to the working world, but for the past few years, I've\ntaught myself to make the \"right\" choices with my money, considering I don't\ncome from a wealthy family and don't expect to inherit anything life-changing\ndown the line. A few examples of what I'm doing are: maxing out a…",
  "original_created_utc": 1621623518,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は社会人になってまだ日が浅いのですが、ここ数年は、お金に対して「正しい」選択をすることを学んできました。\n私は裕福な家庭の出身ではなく、人生を変えるような遺産を相続することも期待できないので、お金に関しては「正しい」選択をするように自分に言い聞かせています。\n私は裕福な家庭の出身ではなく、将来的に人生を変えるようなものを相続するとは思っていません。\n私は裕福な家庭の出身ではなく、将来的に人生を変えるようなものを相続することも期待できないので、お金に関して「正しい」選択をすることを学んでいます。私が行っていることの例としては、例えば以下のようなものがあります。",
      "title": "年配の方へ 経済的に責任を負うことに意味はあったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我仍然是工作领域的新手，但在过去的几年里，我一直在教育自己对金钱做出 \"正确 \"的选择。\n考虑到我不是来自一个富裕的家庭，也不指望能继承什么改变生活的东西，我教自己用钱做出 \"正确 \"的选择。\n我不是来自一个富裕的家庭，也不指望能继承任何改变生活的东西。\n的东西。我所做的几个例子是：把自己的钱花光。",
      "title": "年长的人群。在经济上负责任的做法值得吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我仍然是工作領域的新手，但在過去的幾年裏，我一直在教育自己對金錢做出 \"正確 \"的選擇。\n考慮到我不是來自一個富裕的家庭，也不指望能繼承什麼改變生活的東西，我教自己用錢做出 \"正確 \"的選擇。\n我不是來自一個富裕的家庭，也不指望能繼承任何改變生活的東西。\n的東西。我所做的幾個例子是：把自己的錢花光。",
      "title": "年長的人羣。在經濟上負責任的做法值得嗎？"
    }
  ],
  "title": "Older Crowd: Was being financially responsible worth it?",
  "created_utc": 1621668831,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m still fairly new to the working world, but for the past few years, I&#39;ve taught myself to make the &quot;right&quot; choices with my money, considering I don&#39;t come from a wealthy family and don&#39;t expect to inherit anything life-changing down the line. A few examples of what I&#39;m doing are: maxing out a Roth IRA, contributing to a company-sponsored 401k, keeping an emergency fund, living at home to save up for a down payment instead of renting, owning a reliable Japanese car, etc.</p>\n\n<p>&#x200B;</p>\n\n<p>A lot of this is obviously taking away from my &quot;fun&quot; budget, which is why I ask if some of you feel it was worth it when looking back at your own lives. As you got older, and your income presumably increased, did you even need to rely on these safety nets you created for yourself? Maybe you can share some things you&#39;re glad you did on your financial journey, and some that you regret.</p>\n\n<p>&#x200B;</p>\n\n<p>I&#39;m still currently fortunate enough to travel a couple times a year and dine out within reason, but definitely not to the extent that I could if I stopped caring about investing/saving and just spent money towards more short-term things. For context, I&#39;m not in the tech or the medical fields, so my income is probably pretty standard relative to my age, although definitely not great when considering the cost of living in my area (&amp; moving would not currently be the best career decision).</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TrueAskReddit/comments/ni0267/older_crowd_was_being_financially_responsible/",
  "subreddit": "TrueAskReddit",
  "id": "ni0267",
  "is_self": true,
  "media": null,
  "is_video": false
}