{
  "author": "Fountainheadusa",
  "the_new_excerpt": "I bought NVDA today, adding to a position I’d initiated in 2018 and have\ncontinuously added to on most dips.\n\nThe Bull Case\n\n * A great long term investment as demand for GPU’s will remain high for the\n   next decade\n * User markets such as data center, gaming and auto continue to grow\n * Leader in…",
  "original_created_utc": 1616074634,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我今天买入了NVDA，追加了我在2018年启动的仓位，并已\n在大多数跌幅上不断加。\n\n牛市案例\n\n * 由于未来对GPU的需求将持续高涨，因此是一项很好的长期投资。\n   下一个十年\n * 数据中心、游戏和汽车等用户市场持续增长。\n *领导在...",
      "title": "英伟达--$NVDA是一项伟大的长期投资。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今天買入了NVDA，追加了我在2018年啓動的倉位，並已\n在大多數跌幅上不斷加。\n\n牛市案例\n\n * 由於未來對GPU的需求將持續高漲，因此是一項很好的長期投資。\n   下一個十年\n * 數據中心、遊戲和汽車等用戶市場持續增長。\n *領導在...",
      "title": "英偉達--$NVDA是一項偉大的長期投資。"
    }
  ],
  "title": "NVIDIA - $NVDA is a great long term investment",
  "created_utc": 1616087926,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I bought NVDA today, adding to a position I’d initiated in 2018 and have continuously added to on most dips. </p>\n\n<p><strong>The Bull Case</strong></p>\n\n<ul>\n<li>A great long term investment as demand for GPU’s will remain high for the next decade</li>\n<li>User markets such as data center, gaming and auto continue to grow</li>\n<li>Leader in its market segments – best in class products</li>\n<li>Gaming - Huge pricing power because of innovative, high quality product improvements such as ray tracing</li>\n<li>Strong competitive advantage with its CUDA software stack</li>\n<li>Mellanox acquisition also gives it a serious competitive advantage in Data Center</li>\n<li>15% Rev and 20% earnings growth expected per year in the next 5 years.</li>\n<li>The ARM deal, if it goes through will be a huge shot in the arm for NVDA as a strategic near monopoly in licensing </li>\n<li>NVDA has bought a majority of ARM with its own stock at $485 per share. The equity dilution is only 7%.</li>\n</ul>\n\n<p><strong>The Bear Case</strong></p>\n\n<ul>\n<li>Stretched valuation at 40X Jan -22 earnings and 20X Jan-22 sales </li>\n<li>Data center GPU users such as Amazon, Microsoft and Alphabet are investing heavily to build their own chips. </li>\n<li>Crypto revenue is not sustainable </li>\n<li>Post covid environment may reduce gaming and therefore GPU demand</li>\n</ul>\n\n<p><strong>Challenges</strong></p>\n\n<p>The ARM deal may not go through</p>\n\n<p>The chances of several governments, especially the U.K and China passing the deal are low.  Several ARM customers have raised concerns about Nvidia likely misusing/abusing its position as the default licensor, forcing customers to use  its own chips.</p>\n\n<p>With these concerns there will be heightened governmental and regulatory scrutiny into NVDA.</p>\n\n<p>There are two interesting articles on the ARM deal. <a href=\"https://www.forbes.com/sites/bethkindig/2021/03/11/why-the-nvidia-arm-acquisition-should-be-approved/?sh=44c39eac45b2\">Here’s the one from Forbes</a>–  the author is hopeful that the deal goes through and why. She believes that governments like the US will push through to gain and maintain its competitive advantage in A.I.</p>\n\n<p>The second is from Trading Places Research and called Nvidia and ARM: All About Control. It’s from Seeking Alpha and why the ARM acquisition makes sense for NVIDIA. Here’s the gist in the author’s own words.</p>\n\n<blockquote>\n<p>“But in the end, NVIDIA is trying to do what Apple does regularly, and is so very successful with: control the core technologies behind its products. NVIDIA wants to build a data center behemoth built around the CPU-GPU-DPU-AI stack. They control three of the four layers, and the Arm acquisition would give them the fourth, and most important layer in the stack. They can build this Goliath licensing Arm technology, but they would be dependent on someone else’s roadmap. That someone else is mostly in the business of selling smartphone SoC IP, and is most interested in the future of IoT.  </p>\n\n<p>But again, this is precisely what is going to scare Arm’s customers so much. The entire smartphone ecosystem is dependent on the continued development of those cores, and if the company is shifting its attention to the data center, the rest may languish down the road. Those customers may even start looking at RISC-V. They have at least 18 months to mull it over, which is a lifetime in tech.”</p>\n</blockquote>\n\n<p><strong>Valuation</strong></p>\n\n<p>Sure, the stock&#39;s expensive at 530, but 3 years out NVDA earns about $24 a share, getting the PE down to 22, which is not bad for a 20% grower. </p>\n\n<p>Sources: Wall Street Journal, Seeking Alpha, Forbes, Motley Fool.</p>\n</div><!-- SC_ON -->",
  "score": 97,
  "permalink": "/r/stocks/comments/m7qyyy/nvidia_nvda_is_a_great_long_term_investment/",
  "subreddit": "stocks",
  "id": "m7qyyy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752819547
}