{
  "author": "Fabulous-Ad7895",
  "original_created_utc": 1651317039,
  "title": "does anybody feels just overwhelmed by life itself and is avoiding it?",
  "created_utc": 1651395166,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;some times, I want to do everything and feel empowered; other times  I need a break from life without anything stressful going on in my life. But I dont want to do anythiing and feel like I cant do anything, applying for a job, getting a health insurance, doing uni tasks, hosting a friend whos visiting, etc.&lt;br/&gt;\ni just want a break from all&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/uf8y8r/does_anybody_feels_just_overwhelmed_by_life/",
  "subreddit": "NoStupidQuestions",
  "id": "uf8y8r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "some times, I want to do everything and feel empowered; other times I need a\nbreak from life without anything stressful going on in my life. But I dont want\nto do anythiing and feel like I cant do anything, applying for a job, getting a\nhealth insurance, doing uni tasks, hosting a friend whos…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あるときは、すべてをやり遂げ、力を得たと感じ、またあるときは、何もストレスのない生活を送りたいと思う。\nまた、ストレスのない生活で一息つきたいときもあります。しかし、私は何もしたくないのです。\n何もしたくないし、何もできないように感じる。\n健康保険に入るのも、ユニの課題をこなすのも、友人をもてなすのも...。",
      "title": "人生そのものに圧倒されて、それを避けている人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有些时候，我想做所有的事情，并感到有力量；其他时候，我需要从生活中休息一下，没有任何压力。\n我需要在生活中没有任何压力的情况下休息一下。但我不希望\n但我不想做任何事情，感觉自己什么都做不了，申请工作，获得\n健康保险，做大学的任务，接待一个朋友，而这个朋友是我的朋友。",
      "title": "是否有人对生活本身感到不知所措，并在回避它？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有些時候，我想做所有的事情，並感到有力量；其他時候，我需要從生活中休息一下，沒有任何壓力。\n我需要在生活中沒有任何壓力的情況下休息一下。但我不希望\n但我不想做任何事情，感覺自己什麼都做不了，申請工作，獲得\n健康保險，做大學的任務，接待一個朋友，而這個朋友是我的朋友。",
      "title": "是否有人對生活本身感到不知所措，並在迴避它？"
    }
  ]
}