{
  "author": "TNGSystems",
  "original_created_utc": 1631053859,
  "title": "Emergency Proposal - Less than 24 hours to vote. Remove network of accounts from receiving Moons this distribution for subreddit manipulation amounting to 138,733 moons.",
  "created_utc": 1631072033,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h3><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/pjz7g6/daily_discussion_september_8_2021_gmt0/\">New daily here</a></h3>\n\n<hr/>\n\n<h3>IOS VOTING IS HAPPILY BUGGED, USE A LAPTOP/DESKTOP.</h3>\n\n<p>It has recently come to our attention that a user has been operating several accounts for the sole purpose of bypassing the karma limits imposed by Governance polls to earn more moons than possible each distribution.</p>\n\n<p>&#x200B;</p>\n\n<p>For obvious reasons, we can&#39;t divulge too many details on how this has been identified, though Reddit admins have actioned some of the accounts listed (which usually happens when the accounts repeatedly upvote themselves) but you should know that this has been passed around the moderation team and there exists no shadow of doubt that these are the same entity. The user has since confirmed as much in a message to the moderation team. You may know this user as:</p>\n\n<p><a href=\"/u/Hame_BiH\">u/Hame_BiH</a><br/>\n<a href=\"/u/TDavid13\">u/TDavid13</a><br/>\n<a href=\"/u/DestroRe13\">u/DestroRe13</a><br/>\n<a href=\"/u/mahatmadandi\">u/mahatmadandi</a><br/>\n<a href=\"/u/Obito_DOS3\">u/Obito_DOS3</a>  </p>\n\n<p>&#x200B;</p>\n\n<p><strong>Over the course of the previous distributions, this user has been given a total of 138,733 moons - which should have been spread fairly around the community of users here that earns them.</strong></p>\n\n<p>&#x200B;</p>\n\n<p>While this user and all accounts have been permanently banned, the timing of the bans means that the 5,655 moons marked for distribution will still be paid out on the 8th September unless a poll passes.</p>\n\n<p>&#x200B;</p>\n\n<p>We have very strict rules on using multiple accounts to bypass the karma cap, or otherwise game the system in an effort to earn more moons.  Rule 3 is &quot;No Manipulation&quot; and that counts for bypassing Governance rules for the subreddit.</p>\n\n<p><strong>It is not fair for the rest of the users who are following the rules to have these moons distributed for ill-gotten karma, especially not over several accounts.</strong></p>\n\n<p>Unfortunately, the rest of the moons these accounts have received cannot be recovered (the beauty of trustless, blockchain technology) but we can at least act now to prevent this final distribution from rewarding this user for their bad-faith posting. If this karma is removed from the distribution, the current ratio will increase, giving each and every user more moons for their karma this round  This will be a record-setting poll if it passes, and it is a long shot.</p>\n\n<p>&#x200B;</p>\n\n<p>By this poll passing, it will remove the above accounts from the current distribution, ensuring they do not receive the final moons allocated for their posts in snapshot 17. The methodology to address problem users has been laid out by Reddit admins.</p>\n\n<p>An additional effect of the poll passing will be less karma in the pool, meaning the Karma:Moons ratio goes up - more moons for everyone!</p>\n\n<p>&#x200B;</p>\n\n<p>Thanks for reading.</p>\n\n<p><a href=\"https://www.reddit.com/poll/pjxnut\">View Poll</a></p>\n</div><!-- SC_ON -->",
  "score": 2291,
  "permalink": "/r/CryptoCurrency/comments/pjxnut/emergency_proposal_less_than_24_hours_to_vote/",
  "subreddit": "CryptoCurrency",
  "id": "pjxnut",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "NEW DAILY HERE\n[https://www.reddit.com/r/CryptoCurrency/comments/pjz7g6/daily_discussion_september_8_2021_gmt0/]\n\n--------------------------------------------------------------------------------\n\n\nIOS VOTING IS HAPPILY BUGGED, USE A LAPTOP/DESKTOP.\n\nIt has recently come to our attention that a user…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ニューデイリーはこちら\n[https://www.reddit.com/r/CryptoCurrency/comments/pjz7g6/daily_discussion_september_8_2021_gmt0/]\n\n--------------------------------------------------------------------------------\n\n\niosの投票には嬉しいバグがあります、ラップトップ/デスクトップを使用してください。\n\n最近になって、あるユーザーが...",
      "title": "緊急提案 - 投票まで24時間を切っています。138,733個のムーンを獲得したアカウントのネットワークを、今回の配布分のムーンの受け取りから外します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这里每天都有新消息\n[https://www.reddit.com/r/CryptoCurrency/comments/pjz7g6/daily_discussion_september_8_2021_gmt0/]\n\n--------------------------------------------------------------------------------\n\n\nios投票很高兴地出现了问题，请使用笔记本电脑/台式机。\n\n最近我们注意到，一个用户...",
      "title": "紧急提案--投票时间不足24小时。移除网络上的账户，使其不再接受月球这个分配，因为他们操纵子红帽的金额达到138,733月球。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏每天都有新消息\n[https://www.reddit.com/r/CryptoCurrency/comments/pjz7g6/daily_discussion_september_8_2021_gmt0/]\n\n--------------------------------------------------------------------------------\n\n\nios投票很高興地出現了問題，請使用筆記本電腦/臺式機。\n\n最近我們注意到，一個用戶...",
      "title": "緊急提案--投票時間不足24小時。移除網絡上的賬戶，使其不再接受月球這個分配，因爲他們操縱子紅帽的金額達到138,733月球。"
    }
  ]
}