{
  "author": "OberynMartell94",
  "original_created_utc": 1635206133,
  "title": "I made $2 of profit. AMA",
  "created_utc": 1635233444,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yes, you are seeing right. Your eyes or your mind is not playing tricks on you. It is possible to profit in the cryptosphere. \n5 months ago i bought $100 worth of EOS and a month later another $100. After 5 long months of HODLING I am finally in the green. 1% profit.</p>\n\n<p>You can ask me anything and I will answer truthfully so you can feed of off this success story and create your own. \nYou want to make 2 dollars in 5 months ? I am right here to teach you that shit. Before you know it you might profit 3-4 or maybe 5 dollars and buy a toy lambo. Who knows?</p>\n</div><!-- SC_ON -->",
  "score": 198,
  "permalink": "/r/CryptoCurrency/comments/qftsph/i_made_2_of_profit_ama/",
  "subreddit": "CryptoCurrency",
  "id": "qftsph",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Yes, you are seeing right. Your eyes or your mind is not playing tricks on you.\nIt is possible to profit in the cryptosphere. 5 months ago i bought $100 worth\nof EOS and a month later another $100. After 5 long months of HODLING I am\nfinally in the green. 1% profit.\n\nYou can ask me anything and I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "はい、その通りです。あなたの目や心があなたを騙しているのではありません。\nクリプトスフィアで利益を得ることは可能です。5ヶ月前、私は100ドル分のEOSを買いました。\nEOSを100ドル分購入し、1ヶ月後にさらに100ドル分購入しました。5ヶ月の長いホドリングの後、私はついに\nようやく利益が出ました。1%の利益です。\n\nあなたは私に何でも尋ねることができます。",
      "title": "2ドルの利益を得た。AMA"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，你看对了。你的眼睛或你的头脑没有在玩弄你。\n在加密圈中获利是可能的。5个月前，我买了价值100美元的\n的EOS，一个月后又买了100美元。经过长达5个月的炒作，我\n终于绿了。1%的利润。\n\n你可以问我任何问题，我...",
      "title": "我赚了2美元的利润。AMA"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，你看對了。你的眼睛或你的頭腦沒有在玩弄你。\n在加密圈中獲利是可能的。5個月前，我買了價值100美元的\n的EOS，一個月後又買了100美元。經過長達5個月的炒作，我\n終於綠了。1%的利潤。\n\n你可以問我任何問題，我...",
      "title": "我賺了2美元的利潤。AMA"
    }
  ]
}