{
  "author": "kahntemptuous",
  "the_new_excerpt": "It seems clear to me that there are plenty of parallels between the Exodus story\nand the plight of the pre-Civil War Black population. Enslaved in a foreign\nland, overseen by cruel masters who \"...embittered their lives with hard labor,\nwith mortar and with bricks and with all manner of labor in the…",
  "original_created_utc": 1617187059,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在我看来，出埃及记之间有很多相似之处。\n以及内战前黑人人口的困境。在外国被奴役\n土地，由残酷的主人监督，他们\"......用辛勤的劳动使他们的生活苦不堪言。\n用灰泥和砖头，用各种方式的劳动在... ...",
      "title": "现在是逾越节。在美国被奴役的非洲人认同了出埃及故事中的犹太人。\"打倒摩西 \"这首歌最初是由被解放的黑人唱的 -- 哈里特-塔布曼本人甚至唱过这首歌。为什么解放后，他们就成了基督徒而不是犹太人？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我看來，出埃及記之間有很多相似之處。\n以及內戰前黑人人口的困境。在外國被奴役\n土地，由殘酷的主人監督，他們\"......用辛勤的勞動使他們的生活苦不堪言。\n用灰泥和磚頭，用各種方式的勞動在... ...",
      "title": "現在是逾越節。在美國被奴役的非洲人認同了出埃及故事中的猶太人。\"打倒摩西 \"這首歌最初是由被解放的黑人唱的 -- 哈里特-塔布曼本人甚至唱過這首歌。爲什麼解放後，他們就成了基督徒而不是猶太人？"
    }
  ],
  "title": "It's Passover right now. Enslaved Africans in America identified with the Jews of the Exodus story. The song \"Go Down Moses\" was originally sung by freed Blacks - Harriet Tubman herself even sung it. Why, after emancipation, did they then become Christian and not Jewish?",
  "created_utc": 1617205968,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It seems clear to me that there are plenty of parallels between the Exodus story and the plight of the pre-Civil War Black population. Enslaved in a foreign land, overseen by cruel masters who &quot;...embittered their lives with hard labor, with mortar and with bricks and with all manner of labor in the field; any labor that they made them do was with hard labor&quot; (Exodus 1:14). </p>\n\n<p>It also seems to me that this was not lost on those alive in the 1860s. The song &quot;Go Down Moses&quot; seems to be the most obvious connection. Even Jews were contemporaneously drawing comparisons between Moses and Lincoln after he was assassinated.</p>\n\n<p>Now, I understand that &quot;why did X not happen&quot; is quite difficult to answer. So perhaps this is better phrased as, &quot;If Christianity was the religion of the oppressors, why did postbellum American Blacks become Christians instead of Jews, with whom you&#39;d think they&#39;d&#39;ve more strongly identified?&quot;</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/mh3b10/its_passover_right_now_enslaved_africans_in/",
  "subreddit": "AskHistorians",
  "id": "mh3b10",
  "is_self": true,
  "media": null,
  "is_video": false
}