{
  "author": "Tajo990",
  "original_created_utc": 1638979649,
  "title": "Reddit Recap - Crypto is the most popular theme on the whole Reddit!",
  "created_utc": 1638992034,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We&amp;#39;ve made it big on Reddit my dudes according to the Reddit Recap for 2021!&lt;/p&gt;\n\n&lt;p&gt;We are among the top communities for crypto/finance subs.&lt;/p&gt;\n\n&lt;p&gt;Other than that, if you go to the full report which should be flashing at the top of your screens on homepage there is a whole section devoted to crypto&lt;/p&gt;\n\n&lt;p&gt;To quote the description for this section: &amp;quot; In 2021, there were &lt;strong&gt;&lt;em&gt;a lot&lt;/em&gt;&lt;/strong&gt; of conversations on Reddit, but none more prominent than cryptocurrency. For more than 10 years, Reddit has been home to over 500 cryptocurrency communities. As more redditors participate in conversation, whether it be for information, help, or to share major successes, Reddit continues to be the hub for cryptocurrency enthusiasts. &amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Crypto is also the most popular theme on the whole Reddit followed by Gaming, Sports, Weddings, Health and Fitness, Food and Drink, Movies and Television.&lt;/p&gt;\n\n&lt;p&gt;This is one of the best promotions we can get!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 181,
  "permalink": "/r/CryptoCurrency/comments/rbukyb/reddit_recap_crypto_is_the_most_popular_theme_on/",
  "subreddit": "CryptoCurrency",
  "id": "rbukyb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We've made it big on Reddit my dudes according to the Reddit Recap for 2021!\n\nWe are among the top communities for crypto/finance subs.\n\nOther than that, if you go to the full report which should be flashing at the\ntop of your screens on homepage there is a whole section devoted to crypto\n\nTo quote…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2021年のReddit Recapによると、私たちはRedditで大成功を収めたそうです。\n\n暗号や金融のサブスクリプションでトップクラスのコミュニティになっています。\n\nその他にも、フルレポートをご覧になれば、そのページが点滅しているはずです。\nトップページの画面上部に暗号のセクションがあります。\n\n引用すると...",
      "title": "Reddit Recap - Reddit全体で最も人気のあるテーマはCrypto!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "根据2021年的Reddit回顾，我们已经在Reddit上取得了巨大的成功。\n\n我们是加密货币/金融子网站的顶级社区之一。\n\n除此以外，如果你去看完整的报告，它应该在你的主页屏幕顶部闪烁\n你的屏幕顶部的主页，有一整节专门讨论加密货币。\n\n引用一下...",
      "title": "Reddit回顾--加密货币是整个Reddit上最受欢迎的主题!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據2021年的Reddit回顧，我們已經在Reddit上取得了巨大的成功。\n\n我們是加密貨幣/金融子網站的頂級社區之一。\n\n除此以外，如果你去看完整的報告，它應該在你的主頁屏幕頂部閃爍\n你的屏幕頂部的主頁，有一整節專門討論加密貨幣。\n\n引用一下...",
      "title": "Reddit回顧--加密貨幣是整個Reddit上最受歡迎的主題!"
    }
  ]
}