{
  "author": "domchi",
  "the_new_excerpt": "Inflation or deflation, is crypto a bubble or an S curve, are value stock\ninvestors missing by not investing in bankrupt or non-profit generating\ncompanies... it seems nothing is certain these days. Which made me think. Are\nthere long term trends that it makes sense investing in for at least the…",
  "original_created_utc": 1620705799,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "インフレかデフレか、暗号はバブルなのかS字なのか、バリュー株投資家は破綻した企業や非営利団体に投資しないことで損をしているのか。\n倒産した会社や利益を生まない会社に投資しないことで、バリュー株投資家は損をしているのか。\n最近では、確かなものは何もないようです。と考えさせられました。そこで私は考えました。\n長期的なトレンドがあり、それに投資することは、少なくとも...",
      "title": "あなたが知っている、投資可能な最も長い未来のトレンドは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "通货膨胀或通货紧缩，加密货币是泡沫还是S型曲线，价值型股票\n价值型股票投资者不投资于破产或非营利性的公司而错过了机会。\n这些天来似乎没有什么是确定的。这让我想到。是否\n是否有长期的趋势，至少在未来的一段时间内投资是有意义的。",
      "title": "你所知道的可以投资的最长的未来趋势是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "通貨膨脹或通貨緊縮，加密貨幣是泡沫還是S型曲線，價值型股票\n價值型股票投資者不投資於破產或非營利性的公司而錯過了機會。\n這些天來似乎沒有什麼是確定的。這讓我想到。是否\n是否有長期的趨勢，至少在未來的一段時間內投資是有意義的。",
      "title": "你所知道的可以投資的最長的未來趨勢是什麼？"
    }
  ],
  "title": "What is the longest future trend you know of that can be invested in?",
  "created_utc": 1620736870,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Inflation or deflation, is crypto a bubble or an S curve, are value stock investors missing by not investing in bankrupt or non-profit generating companies... it seems nothing is certain these days. Which made me think. Are there long term trends that it makes sense investing in for at least the next two to five decades?</p>\n\n<p>For example, ARK Invest identified 5 big trends. One other big trend seems to be the end of petrodollar dominance. Boomers getting older and millennials taking over. Petrodollar slowly losing dominance. Maybe index investing dominance, but that&#39;s debatable.</p>\n\n<p>I&#39;m not looking at a short-term 5 to 10 year trends such as, for example, weed stocks which I expect to reach market saturation relatively soon (but what do I know), or real estate bubbles, although perhaps it makes sense looking at the long-term trend of urbanization.</p>\n\n<p>Any ideas?</p>\n</div><!-- SC_ON -->",
  "score": 263,
  "permalink": "/r/investing/comments/n9odr2/what_is_the_longest_future_trend_you_know_of_that/",
  "subreddit": "investing",
  "id": "n9odr2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994599
}