{
  "author": "shoshilyawkward",
  "the_new_excerpt": "I'm on mobile.\n\nI feel like starting a few days ago, every time I open reddit I see stuff I've\nalready seen. Like it'll refresh when I open the app and just scramble\neverything I saw an hour ago when I had the app open last.\n\nI used to be able to scroll forever and only rarely see stuff I'd already…",
  "original_created_utc": 1612647679,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在手机上。\n\n我感觉从几天前开始，每次打开reddit都会看到我的东西，我已经。\n已经看到了。比如说我打开应用的时候会刷新，然后就拼命的\n我看到的一切一个小时前，当我有应用程序打开最后。\n\n我曾经可以永远滚动，只有很少看到的东西，我已经... ...",
      "title": "是reddit的算法被改变了还是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在手機上。\n\n我感覺從幾天前開始，每次打開reddit都會看到我的東西，我已經。\n已經看到了。比如說我打開應用的時候會刷新，然後就拼命的\n我看到的一切一個小時前，當我有應用程序打開最後。\n\n我曾經可以永遠滾動，只有很少看到的東西，我已經... ...",
      "title": "是reddit的算法被改變了還是什麼？"
    }
  ],
  "title": "Did reddit's algorithm get changed or something?",
  "created_utc": 1612666412,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m on mobile. </p>\n\n<p>I feel like starting a few days ago, every time I open reddit I see stuff I&#39;ve already seen. Like it&#39;ll refresh when I open the app and just scramble everything I saw an hour ago when I had the app open last. </p>\n\n<p>I used to be able to scroll forever and only rarely see stuff I&#39;d already seen. </p>\n\n<p>And I&#39;m not talking about reposts, because I upvote a lot of things I see and 70-80% of posts I&#39;m seeing on my home page are already upvoted by me. There have always been reposts, this post isn&#39;t about that. </p>\n\n<p>If this is an algorithm thing, can anyone advise how to fix it? I&#39;m finding it very difficult to use reddit anymore because of this.</p>\n\n<p>Edit: I&#39;m seeing a lot of you are having this issue as well. Is there somewhere we can all complain about this and hope they change it back? I just haven&#39;t gone on reddit in 3 days, they&#39;re kinda losing me here if they don&#39;t fix it, and probably some of you too</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/le7k5j/did_reddits_algorithm_get_changed_or_something/",
  "subreddit": "NoStupidQuestions",
  "id": "le7k5j",
  "is_self": true,
  "media": null,
  "is_video": false
}