{
  "author": "Least_Exercise2127",
  "original_created_utc": 1643199950,
  "title": "For how long are we meant to “pay our dues”?",
  "created_utc": 1643273924,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was repeatedly told this growing up “you need to pay your dues before you can start enjoying life” &lt;/p&gt;\n\n&lt;p&gt;Well after shuffling around through bad jobs and situations I’ve finally ended up in a place where I am relatively content and comfortable. But it feels a bit like cheating, since many of my peers are still in the struggle phase of their lives.&lt;/p&gt;\n\n&lt;p&gt;Is “paying your dues” just something bitter old people made up out of jealousy?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/sd4t74/for_how_long_are_we_meant_to_pay_our_dues/",
  "subreddit": "TooAfraidToAsk",
  "id": "sd4t74",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was repeatedly told this growing up “you need to pay your dues before you can\nstart enjoying life”\n\nWell after shuffling around through bad jobs and situations I’ve finally ended\nup in a place where I am relatively content and comfortable. But it feels a bit\nlike cheating, since many of my peers…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は幼少の頃、何度もこう言われたものだ。「自分の代価を払ってからが本番だ」と。\n人生を楽しみ始める\"\n\nしかし、悪い仕事や状況を転々とした後、私はようやく、このように\nを、比較的満足のいく形で手に入れることができました。しかし、それは少し\n同級生の多くが...。",
      "title": "いつまで「会費を払う」のか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在成长过程中被反复告知：\"你需要支付你的会费，然后才能开始享受生活。\n开始享受生活\"\n\n在经历了糟糕的工作和情况后，我终于在一个相对满足和舒适的地方结束了自己的生活。\n在一个相对满足和舒适的地方。但这感觉有点\n欺骗，因为我的许多同龄人...",
      "title": "我们要 \"交纳会费 \"多久？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在成長過程中被反覆告知：\"你需要支付你的會費，然後才能開始享受生活。\n開始享受生活\"\n\n在經歷了糟糕的工作和情況後，我終於在一個相對滿足和舒適的地方結束了自己的生活。\n在一個相對滿足和舒適的地方。但這感覺有點\n欺騙，因爲我的許多同齡人...",
      "title": "我們要 \"交納會費 \"多久？"
    }
  ]
}