{
  "author": "trajanaugustus",
  "the_new_excerpt": "The computer game Europa Universalis made me realize that many of the great\ntrade cities of the world are located at the mouths/estuaries/deltas of major\nrivers, and nearly every major river has an entrepot at or near the mouth, from\nNew Orleans on the Mississipi to Lisbon on the Tajus to Hamburg on…",
  "original_created_utc": 1620595374,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "コンピュータゲーム「Europa Universalis」のおかげで、世界の偉大な貿易都市の多くが\n世界の偉大な貿易都市の多くは、大河の河口/河口/デルタに位置しています。\n川の河口・河口域・デルタに位置しており、ほとんどの大河には河口付近にアントルポがあります。\nミシシッピ川のニューオリンズ、タジュス川のリスボン、ハンブルグ...。",
      "title": "ドナウ川の河口にはなぜ大きな貿易都市ができなかったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "电脑游戏Europa Universalis让我意识到，世界上许多伟大的贸易城市都位于主要河流的入口/河口/三角洲。\n世界上许多伟大的贸易城市都位于主要河流的河口/河口/三角洲。\n几乎每条大河都有一个位于河口或靠近河口的转口港，从密西西比河上的新奥尔良到塔吉克河上的里斯本。\n从密西西比河上的新奥尔良到塔杰斯河上的里斯本再到汉堡。",
      "title": "为什么在多瑙河口没有发展出大型贸易城市？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "電腦遊戲Europa Universalis讓我意識到，世界上許多偉大的貿易城市都位於主要河流的入口/河口/三角洲。\n世界上許多偉大的貿易城市都位於主要河流的河口/河口/三角洲。\n幾乎每條大河都有一個位於河口或靠近河口的轉口港，從密西西比河上的新奧爾良到塔吉克河上的里斯本。\n從密西西比河上的新奧爾良到塔傑斯河上的里斯本再到漢堡。",
      "title": "爲什麼在多瑙河口沒有發展出大型貿易城市？"
    }
  ],
  "title": "Why did no major trade city develop at the mouth of the Danube river?",
  "created_utc": 1620613754,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The computer game Europa Universalis made me realize that many of the great trade cities of the world are located at the mouths/estuaries/deltas of major rivers, and nearly every major river has an entrepot at or near the mouth, from New Orleans on the Mississipi to Lisbon on the Tajus to Hamburg on the Rhine, Alexandria on the Nile, Calcutta on the Ganges and Hong Kong on the Pearl. I gather this is because they can serve as a port for goods to change from riverboat to ocean ships, as well as fortifications to defend the river and outposts for levying taxes. The Danube is one of the most important rivers in Europe, passing through productive lands, and draining a large floodplain. Why did no major city form at the mouth? Is the terrain too marshy? The harbour poorly protected? Was it vulnerable to raids from seafarers? Was the river too long for viable trade, and the Black Sea too distant and closed off to bother shipping into? Am I being too geographically determinist about a fundamentally organic and stochastic process, seeking a just-so explanation about complex, contingent historical forces that can&#39;t be explained in a falsifiable, scientific way?</p>\n\n<p>Do any of these factors apply to the mouth of the Amazon or the Yellow rivers to explain more broadly where trade cities arise or don&#39;t?</p>\n</div><!-- SC_ON -->",
  "score": 134,
  "permalink": "/r/AskHistorians/comments/n8ny3d/why_did_no_major_trade_city_develop_at_the_mouth/",
  "subreddit": "AskHistorians",
  "id": "n8ny3d",
  "is_self": true,
  "media": null,
  "is_video": false
}