{
  "author": "_bono983",
  "the_new_excerpt": "\"Tesla finished below $600 for the first time since Dec. 4, and has lost 15% on\nthe year.\n\nThe sell-off comes amidst a bigger drawback in tech stocks, which are valued\nbased on the presumption of heavy growth in future cash flows.\n\nCompetition and parts shortages are also playing a part.\n\nShares…",
  "original_created_utc": 1614999666,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "\"自12月4日以来，特斯拉首次收盘跌破600美元，已跌去15%。\n年的。\n\n抛售的同时，科技股也出现了较大的回落，科技股的估值为\n基于未来现金流大量增长的假设。\n\n竞争和零部件短缺也在发挥作用。\n\n股...",
      "title": "特斯拉自12月以来首次收于600美元以下。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"自12月4日以來，特斯拉首次收盤跌破600美元，已跌去15%。\n年的。\n\n拋售的同時，科技股也出現了較大的回落，科技股的估值爲\n基於未來現金流大量增長的假設。\n\n競爭和零部件短缺也在發揮作用。\n\n股...",
      "title": "特斯拉自12月以來首次收於600美元以下。"
    }
  ],
  "title": "Tesla closes below $600 for the first time since December",
  "created_utc": 1615011344,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;Tesla finished below $600 for the first time since Dec. 4, and has lost 15% on the year.</p>\n\n<p>The sell-off comes amidst a bigger drawback in tech stocks, which are valued based on the presumption of heavy growth in future cash flows.</p>\n\n<p>Competition and parts shortages are also playing a part.</p>\n\n<p>Shares in Tesla were down as much as 8% Friday morning. They’ve since recovered to finish down -3.78% as markets showed a dramatic bounceback late on Friday, but the stock has still lost more than 15% of its value the year, and finished below $600 for the first time since Dec. 4.</p>\n\n<p>FED FEARS </p>\n\n<p>On Thursday, Fed Chairman Jerome Powell said that “upward pressure on prices” and “transitory increases in inflation” might be coming to the U.S. as the economy reopens following a year of Covid restrictions that hit businesses across the board.</p>\n\n<p>The market is now worried that interest rates will climb, and the feds won’t take aggressive policy actions or even be able to control it. Bond yields are surging.</p>\n\n<p>This is causing a broader correction in tech stocks, which are valued based on the presumption of heavy growth in future cash flows. As inflation goes up, the value of those future cash flows declines. As CNBC previously reported, the Nasdaq 100 list of the largest 100 non-financial stocks on the exchange, is down about 8% from historic highs reached three weeks ago.\nThis is affecting most tech giants. For instance, Apple dropped from approximately $129 to $121 year-to-date, and Netflix has dropped from around $523 to $516. But Tesla’s drop is more precipitous, so far.</p>\n\n<p>Bulls acknowledge competition</p>\n\n<p>Some of Tesla’s biggest and most vocal backers have cashed out a chunk of their shares, and begun to acknowledge the onslaught of electric vehicle competition as a real challenge to Tesla at long last.</p>\n\n<p>For example, Ron Baron sold 1.7 million worth of Tesla shares and invested in two of the company’s biggest potential rivals, GM-owned Cruise and Amazon-backed Rivian, while paradoxically saying he expects Tesla shares to rise, eventually, to $2,000.\nFormer Tesla board member Steve Westly said on CNBC’s Power Lunch this week that while he remains bullish, “Tesla is not going to be king of the hill in electric forever.” He added, “They’re getting competition from all sectors. They’re going to have to double down to compete.”\nIndeed, automakers including Ford and Volkswagen have seen early success with sales of their electric vehicles including the Mach E and ID.3 up against Tesla models in the US and Europe.\nMeanwhile, forthcoming EV’s, including the all electric version of Ford’s F-150, the Lucid Air, Rivian’s electric SUVs and trucks, and others are stirring excitement. Just yesterday, Porsche showed off the production version of its Taycan Cross Turismo, and said it would start sales in the US this summer. It’s a $90,000 EV wagon, a more affordable, practical take on Porsche’s performance EV, the Taycan.</p>\n\n<p>Part shortages</p>\n\n<p>Semiconductor shortages have caused most auto makers to temporarily close some lines at their factories, and Tesla is no exception.\nTesla CEO Elon Musk acknowledged the company’s Fremont, California, plant shut down temporarily due to “parts shortages” in a tweet on February 25. He said it was shut down for just two days, but did not make clear whether partial shut-downs on some lines would continue.\nTesla had previously warned, in its Q4 2020 earnings call and filing, that chip shortages could hamper their vehicle production goals in the first half of 2021.\nCFO Zachary Kirkhorn said on the call with investors, that for the first quarter of 2021:\n″[Model] S and X production will be low due to the transition to the newly re-architected products. Additionally, we are working extremely hard to manage through the global semiconductor shortage as well as port capacity which may have a temporary impact.”\nIf Tesla does not produce a high volume of vehicles, due to parts shortages or lag times shipping parts from overseas to its U.S. plants, the company would not generate as many regulatory credits that it wants to. Tesla sells these environmental credits to other automakers, which is how it has historically achieved profitability.</p>\n\n<p>Steeper expenses</p>\n\n<p>Controlling costs has been on CEO Elon Musk’s mind on and off for years.\nIn December 2020, he wrote in e-mail to all Tesla employees: “Investors are giving us a lot of credit for future profitability but if, at any point, they conclude that’s not going to happen, our stock will immediately get crushed like a souffle under a sledgehammer!”\nBut at the same time, Tesla is on an expansion tear that will cost it handsomely. The EV maker is building factories in Austin, Texas, in Brandenburg, Germany and expanding its footprint in China. It has also embarked on revamping aspects of its Fremont facilities, including the paint shop, the area of the factory where its cars are painted.\nMusk also has ambitions for Tesla to mine its own lithium, domestically. And to ramp up production of Tesla’s own battery cells at a pilot plant also in Fremont.\nBesides these efforts, the company is in the midst of costly recalls and could face more-- whether voluntary or mandatory. Most significantly of these voluntary recalls, in China and in the US, Tesla is recalling Model S and X vehicles experiencing touchscreen display failures.&quot;</p>\n\n<p><a href=\"https://www.cnbc.com/2021/03/05/tesla-whats-weighing-the-stock-down.html\">Tesla closes below $600 for the first time since December</a></p>\n</div><!-- SC_ON -->",
  "score": 1352,
  "permalink": "/r/stocks/comments/lyskcg/tesla_closes_below_600_for_the_first_time_since/",
  "subreddit": "stocks",
  "id": "lyskcg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542576956
}