{
  "author": "spacej3di",
  "the_new_excerpt": "Dow +1.13%, S&P 500 +1.44%, Nasdaq +1.67%, Russell 2000 +0.49%\n\n * Synopsis\n   * US equities rallied Monday with S&P 500 and Dow both setting new record\n     closes. Growth outperformed value, though both factors saw good gains.\n     Consumer discretionary was the leader with travel and leisure…",
  "original_created_utc": 1617654798,
  "localize": [
    {
      "locale": "ja-JA",
      "the_new_excerpt": "ダウ +1.13%, S&P 500 +1.44%, ナスダック +1.67%, ラッセル 2000 +0.49\n\n *あらすじ\n   * 米国の株式は月曜日に上昇し、S&P 500 とダウはともに新記録を達成しました。\n     終値を更新しました。S&P 500 とダウはともに過去最高の終値を記録しました。\n     消費財がリードし、旅行・レジャーも上昇しました。",
      "title": "米国市場の総括 - 2021年4月5日（月"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "道指+1.13%，标普500+1.44%，纳指+1.67%，罗素2000+0.49%。\n\n * 概要\n   * 美国股市周一反弹，标普500指数和道指均创下新纪录。\n     收盘。增长表现优于价值，尽管这两个因素都有不错的收益。\n     消费品是领头羊，旅游和休闲...。",
      "title": "美国市场回顾--2021年4月5日(星期一)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "道指+1.13%，標普500+1.44%，納指+1.67%，羅素2000+0.49%。\n\n * 概要\n   * 美國股市週一反彈，標普500指數和道指均創下新紀錄。\n     收盤。增長表現優於價值，儘管這兩個因素都有不錯的收益。\n     消費品是領頭羊，旅遊和休閒...。",
      "title": "美國市場回顧--2021年4月5日(星期一)"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "ダウ +1.13%, S&P 500 +1.44%, ナスダック +1.67%, ラッセル 2000 +0.49\n\n *あらすじ\n   * 米国の株式は月曜日に上昇し、S&P 500 とダウはともに新記録を達成しました。\n     終値を更新しました。S&P 500 とダウはともに過去最高の終値を記録しました。\n     消費財がリードし、旅行・レジャーも上昇しました。",
      "title": "米国市場の総括 - 2021年4月5日（月"
    }
  ],
  "title": "U.S. Market Recap - Monday, April 5, 2021",
  "created_utc": 1617696373,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Dow +1.13%, S&amp;P 500 +1.44%, Nasdaq +1.67%, Russell 2000 +0.49%</strong>  </p>\n\n<ul>\n<li><strong>Synopsis</strong>\n\n<ul>\n<li>US equities rallied Monday with S&amp;P 500 and Dow both setting new record closes. Growth outperformed value, though both factors saw good gains. Consumer discretionary was the leader with travel and leisure names faring well. Communications services performed well with FB and GOOGL strength. Tech was boosted by AAPL and MSFT. Energy was the only sector lower on the day. Treasuries were mostly firmer led by the five year point of the curve after rates saw some upward pressure on Good Friday when equities were closed. 10s finished above 1.70% again. Dollar weakened vs both yen and euro. Gold finished fractionally higher. WTI crude ended down 4.6%.</li>\n<li><strong>Market was largely supported by combination of upbeat recovery sentiment following better March employment data and fairly well behaved bond yields</strong>. Nonfarm payrolls surged 916K, well above the 660K consensus, while net upward revisions to prior months totaled 156K. Economist takeaways were positive, highlighting the broad-based job creation, the room for further recovery over the next few months in the industries most adversely impacted by the pandemic and the lack of upward pressure on wages. Fits with broader reopening momentum seen in high-frequency indicators surrounding mobility, card spending, air travel and dining out.</li>\n<li><strong>ISM services hit record high</strong> in March. <strong>Biden said not worried about a tax increase hurting economy</strong> amid heightened debate about how to best fund infrastructure stimulus. <strong>Manchin reiterated corporate tax rate should settle at 25%</strong>, <strong>not 28%</strong>, and more money should come from high earners. <strong>Yellen said US working with G20 on global minimum tax</strong>. Also called on other nations to avoid pre-emptive fiscal tightening. <strong>US vaccine outperformance continues</strong> with seven-day average of 3M+ doses per day, seemingly overshadowing some concerns about a <strong>potential fourth wave</strong>. Multiple reports discussed <strong>dampened momentum behind retail investors</strong>.</li>\n<li><strong>GOOGL</strong> secured favorable ruling from SCOTUS in Android copyright infringement case. <strong>TSLA</strong> Q1 deliveries hit a new record high and beat consensus expectations. <strong>PLTR</strong> boosted by ~$90M NNSW contract. <strong>PINS</strong> has reportedly held talks to acquire photography app VSCO. <strong>PXD</strong> to acquire DoublePoint Energy in a cash and stock deal with an EV of $6.4B. <strong>DAL</strong> forced to cancel ~100 flights due to a staffing shortage. <strong>GME</strong> announced 3.5M share secondary offering. <strong>NVTA</strong> higher on Softbank-led investment. <strong>TPCO</strong> board blessed higher takeover bid. <strong>BVH</strong> announced intent to acquire the 7% of <strong>BXG</strong> it does not already own. <strong>LEAF</strong> to be acquired by <strong>GHC</strong> for $323M in cash.</li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Digest</strong>\n\n<ul>\n<li><strong>Most sectors finished higher, with growth groups outperforming:</strong>\n\n<ul>\n<li><strong>Consumer discretionary</strong> led the market with strength from AMZN, auto names, and travel/leisure names (NCLH submitted plans to CDC for cruise resumptions). The megacap internets were stronger in <strong>communication services</strong>. MSFT and AAPL helped boost <strong>tech</strong>, with the semi space mostly higher as well. <strong>Consumer staples</strong> were a touch behind on food losses though good gains among drug stores, grocers, and beverages. <strong>Industrials</strong> trailed a bit though transports, A&amp;D, and multis performed well. <strong>Materials</strong> <strong>lagged somewhat with packaging performing well while precious metal miners lagged. Financials</strong> lagged with banks mixed and tech lending lower. <strong>Healthcare</strong> was a relative underperformer. MedTech stocks were generally better but there was some scattered weakness in biotech and pharma. <strong>Energy</strong> was the only sector lower, with E&amp;Ps and oil-services firms weaker alongside crude oil.</li>\n</ul></li>\n<li><strong>Big beat for March payrolls:</strong>\n\n<ul>\n<li>Nonfarm payrolls surged 916K in March, the biggest gain since last August and well above the 660K consensus. In addition, the net upward revision to prior months totaled 156K. The unemployment rate fell by 0.2pp to 6.0%, in line with expectations. Household employment increased 609K, the participation rate rose 0.1pp to 61.5% and the employment-population ratio increased 0.2pp to 57.8%. Average hourly earnings fell 0.1% m/m vs expectations for a 0.1% gain, with compositional changes flagged as an overhang. Economist takeaways were positive, highlighting the broad-based job creation (Goldman Sachs said industry breadth hit a 9-month high) and the further room for recovery over the next few months in the industries most adversely impacted by the pandemic. There was some discussion about a return to the pre-pandemic level of jobs by year-end.</li>\n</ul></li>\n<li><strong>ISM non-manufacturing index posted record high:</strong>\n\n<ul>\n<li><strong>ISM non-manufacturing index</strong> for March soared to 63.7, beating 58.5 estimate and up from prior month 55.3. Highest reading in series history (from 1997). Business activity index up 13.9 at 69.4, new orders index up 15.3 at 67.2, employment index up 4.5 at 57.2. Prices index rose 2.2 to 74. Respondents noted lifting of Covid restrictions has unleashed pent-up demand while capacity constraints remain a challenge. Elsewhere, March <strong>Markit services PMI</strong> at 60.4, up 0.4% from flash; above Feb&#39;s 59.8. Highest since Jul-14. New orders, input, output cost series up sharply. Production, employment, expectations also rose. February <strong>factory orders</strong> were -0.8% as expected following +2.7% in the prior month, while durable goods orders revised down a tenth to -1.2% for the month. Thursday&#39;s <strong>initial claims</strong> (719K prior) and Friday&#39;s March <strong>producer price index</strong> (cons 0.5%, prior 0.5%) are the only other major data releases this week.</li>\n</ul></li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Afternoon headlines:</strong></li>\n<li><strong>Markets:</strong>\n\n<ul>\n<li>Equity market growing less concerned about rising Treasury yields (<a href=\"https://www.bloomberg.com/news/articles/2021-04-05/yield-scare-that-shocked-stocks-in-february-barely-registers-now?sref=J9GPLx1B\">Bloomberg</a>)</li>\n<li>Q1 M&amp;A financing hit highest level since 2018 (<a href=\"https://bloom.bg/3rTkrQf\">Bloomberg</a>)</li>\n</ul></li>\n<li><strong>Economic policy/stimulus:</strong>\n\n<ul>\n<li>Manchin says he won&#39;t support raising corporate tax to 28%, but could see 25% (<a href=\"https://bloom.bg/2PVjcTe\">Bloomberg</a>)</li>\n<li>Treasury Secretary Yellen calls for global minimum corporate tax rate (<a href=\"https://on.wsj.com/3fJPBqQ\">WSJ</a>)</li>\n<li>New York lawmakers reach agreement to raise taxes on wealthiest residents to highest combined rate in US (<a href=\"https://bloom.bg/3uleVaH\">Bloomberg</a>)</li>\n<li>Democrats prepare plan to tax multinational corporations (NY Times)</li>\n</ul></li>\n<li><strong>Corporate:</strong>\n\n<ul>\n<li>Supreme Court rules Alphabet didn&#39;t commit copyright infringement in using Oracle code in Android OS (<a href=\"https://bloom.bg/2PASSxW\">Bloomberg</a>)</li>\n<li>UBS estimates one in 11 retail stores will close in the next five years (<a href=\"https://bloom.bg/3dDjkPo\">Bloomberg</a>)</li>\n</ul></li>\n<li><strong>Crypto:</strong>\n\n<ul>\n<li>Cryptocurrency market capitalization hits record $2T, with bitcoin at $1.1T (<a href=\"https://reut.rs/3mkXioB\">Reuters</a>)</li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Notable Gainers:</strong>\n\n<ul>\n<li>+21.3% <strong>LEAF</strong> (Leaf Group): Agreed to be acquired by Graham Holdings Company (GHC) for $8.50 a share in cash in a deal valued at $323M; represents a ~21% premium to prior close.</li>\n<li>+13.5% <strong>AMC</strong> (AMC Entertainment Holdings): Upgraded to buy from neutral at B. Riley; has been impressed with management&#39;s response to Covid headwinds and strengthening balance sheet; elsewhere noted strong weekend performance of Godzilla vs Kong demonstrates pent-up demand.</li>\n<li>+7.2% <strong>NCLH</strong> (Norwegian Cruise Line Holdings): Submitted plans to CDC to resume cruise operations from US ports in July; said it would recommence operations with 100% vaccinated guests and crew, operate with reduce capacity initially.</li>\n<li>+5.1% <strong>RBLX</strong> (Roblox): Initiated buy/overweight at Morgan Stanley, Goldman Sachs, Bank of America, Truist; analysts noted strong user growth runway for kids in gaming/social networking while already leading in engagement; also opportunities through subscription tier launch, expansion into China, branded content, education, ecommerce.</li>\n<li>+4.4% <strong>TSLA</strong> (Tesla): Reported Q1 deliveries of 184,800 vehicles, ahead of 168,000 consensus and representing a new a record high; upside came despite some concerns about a miss stemming from supply chain challenges that have impacted the global auto industry.</li>\n<li>+4.2% <strong>GOOGL</strong> (Alphabet): SCOTUS ruled 6-2 Alphabet did not commit copyright infringement over software in Android devices; at issue was whether Google&#39;s use of Oracle&#39;s (ORCL) Java programming language constituted a &quot;fair use&quot; and was thus protected from copyright infringement claims.</li>\n<li>+3.9% <strong>JBLU</strong> (JetBlue Airways): Upgraded to outperform from market perform at Raymond James. Cited recovery in near-international market, opportunity for margin expansion through Northeast alliance with AAL and new cost controls.</li>\n<li>+3.4% <strong>FB</strong> (Facebook): Barron&#39;s cover story positive; noted stickiness of both consumers and advertisers; also cited valuation with shares at 26x forward earnings vs historical average of 32x, and only largely in line with S&amp;P 500; innovation and hidden assets another positive; noted investors already cognizant of risks.</li>\n<li>+3.1% <strong>NVTA</strong> (Invitae): Confirmed a group led by Softbank Group (9984.JP) will make an investment of $1.15B in convertible senior notes to support future growth initiatives; initial conversion price of $43.18/sh represents a ~10% premium to Friday&#39;s close.</li>\n<li>+2.3% <strong>PINS</strong> (Pinterest): Company has held talks to buy photography app VSCO, according to NY Times report; noted VSCO was last valued at $550M.</li>\n<li>+1.6% <strong>PLTR</strong> (Palantir Technologies): Announced it has been selected by the National Nuclear Security Administration for 5-year, $89.9M contract for Safety Analytics, Forecasting, and Evaluation Reporting (SAFER) project that will</li>\n<li>+1.4% <strong>CZR</strong> (Caesars Entertainment): Upgraded to overweight from equal weight at Morgan Stanley; argued market grossly underestimating recovery in Las Vegas gaming; noted promising booking trends and increasing pricing power; also positive on sports betting exposure.</li>\n</ul></li>\n<li><strong>Notable Decliners:</strong>\n\n<ul>\n<li>-17.2% <strong>ACAD</strong> (Acadia Pharmaceuticals): FDA said application for pimavanserin in dementia-related psychosis cannot be approved in its current form; cited multiple flaws with Phase 2 and 3 studies; analysts noted FDA criticisms worse than feared.</li>\n<li>-7.6% <strong>PXD</strong> (Pioneer Natural Resources): To acquire Double Point Energy in a $6.4B cash and stock deal; Pioneer shareholders to own ~89% of combined company, DoublePoint owners remaining 11%; downgraded to sector weight from overweight at KeyBanc, saying it is one of the highest purchase prices in years.</li>\n<li>-2.4% <strong>GME</strong> (Gamestop): Announced ATM equity offering program for up to 3.5M shares; proceeds to help further accelerate its transformation and strengthen balance sheet; stock up over 900% ytd and 6,700% in last 12 months.</li>\n</ul></li>\n<li><strong>S&amp;P 500 Sector Performance</strong>\n\n<ul>\n<li><strong>Outperformers:</strong> Consumer Disc. +2.28%, Tech +2.02%, Communication Svcs. +2.27%</li>\n<li><strong>Underperformers:</strong> Energy (2.41%), REITs +0.59%, Healthcare +0.66%, Financials +0.74%, Utilities +1.09%, Materials +1.22%, Industrials +1.27%, Consumer Spls. +1.28%</li>\n</ul></li>\n<li><strong>Data</strong></li>\n<li>DXY: 92.6, (0.45)</li>\n<li>€-$ +0.0055 or +0.47% to 1.1812</li>\n<li>£-$ +0.0079 or +0.57% to 1.3904</li>\n<li>$-¥ (0.47) or (0.42%) to 110.20</li>\n<li>€-¥ +0.04 or +0.03% to 130.15</li>\n<li>2-year yield (2) bps to 0.16%</li>\n<li>10-year yield (1) bps to 1.71%</li>\n<li>30-year yield (0) bps to 2.36%</li>\n<li>WTI Crude (May 21): ($2.69) or (4.38%) to $58.76</li>\n<li>Gold (Jun 21): +$0.40 or +0.02% to $1728.8</li>\n<li>Breadth on the NYSE is positive 1.57:1; breadth on the Nasdaq is positive 1.29:1</li>\n<li>Index Performance\n\n<ul>\n<li>Month/Quarter-to-date: Dow +1.65%, S&amp;P +2.64%, Nasdaq +3.46%, Russell +2.00%</li>\n<li>Year-to-date: Dow +9.54%, S&amp;P +8.57%, Nasdaq +6.34%, Russell +14.69%</li>\n</ul></li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 784,
  "permalink": "/r/stocks/comments/mku6oi/us_market_recap_monday_april_5_2021/",
  "subreddit": "stocks",
  "id": "mku6oi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961878997
}