{
  "author": "Wetstocks",
  "the_new_excerpt": "It's all about time in the market not timing the market but..... we all know\nthere are ups and downs.\n\nI'm about 10K into ETFs (IWM, SPY, DVY) and starting to become very sensitive to\nthe idea of a market crash (childish, I know). I have no plans to pull out (very\nchildish), but I want to be on top…",
  "original_created_utc": 1612546235,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在市场上都是时间的问题，而不是时间的问题，但是.....，我们都知道。\n有涨有跌。\n\n我对ETF（IWM、SPY、DVY）大概有1万块钱的投入，开始对\n市场崩溃的想法（幼稚，我知道）。我没有计划退出（很\n幼稚），但我想在上面... ...",
      "title": "持有数千现金与时机价值"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在市場上都是時間的問題，而不是時間的問題，但是.....，我們都知道。\n有漲有跌。\n\n我對ETF（IWM、SPY、DVY）大概有1萬塊錢的投入，開始對\n市場崩潰的想法（幼稚，我知道）。我沒有計劃退出（很\n幼稚），但我想在上面... ...",
      "title": "持有數千現金與時機價值"
    }
  ],
  "title": "Holding Thousands in Cash and the Value of Timing",
  "created_utc": 1612557745,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>It&#39;s all about time</strong> <strong><em>in</em></strong> <strong>the market not</strong> <strong><em>timing</em></strong> <strong>the market but..... we all know there are ups and downs.</strong></p>\n\n<p>I&#39;m about 10K into ETFs (IWM, SPY, DVY) and starting to become very sensitive to the idea of a market crash (childish, I know). I have no plans to pull out (very childish), but I want to be on top of any and all scenarios where there is a massive buying opportunity. I&#39;ve decided to hold an additional 15% worth my portolio in cash. This cash strictly for investing, not personal. The hope really, is that I never deploy that capital and the rest of my account keeps going up. </p>\n\n<p>How does everyone else deal with bears, buying opportunities and cash?</p>\n\n<p>Note: Almost all investment forums suggest investing 100% of your portfolio into equities unless you&#39;re getting near your retirement/exit.</p>\n\n<p>Edit: Not confident in my plan yet, but I’m leaning towards taking some profits out of my high returning ETFs (probably 10% of my gains) and leaving them in cash.</p>\n</div><!-- SC_ON -->",
  "score": 218,
  "permalink": "/r/investing/comments/ldcb85/holding_thousands_in_cash_and_the_value_of_timing/",
  "subreddit": "investing",
  "id": "ldcb85",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123198817
}