{
  "author": "katzenpflanzen",
  "original_created_utc": 1633518241,
  "title": "How was the relationship of the original hippies with television? Were they interested in it? Was television interested in them? Did the hippies care how television might or might not represent them and their movement? How important was television in their lives?",
  "created_utc": 1633529604,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was talking with friends about the 60s and somebody said that the hippie counterculture couldn&#39;t exist today because smartphones would make it impossible. Television, however, did exist in the 60s, and I think it was not that different from the internet. But somebody correctly pointed out that I couldn&#39;t know because I wasn&#39;t there. The most logical thing to do would be therefore to ask the historians.</p>\n\n<p>How important was television for the hippies? Was television obsessed with them (similar to what we see today with some youth-centered movements)? Were they &#39;raised by television&#39;, to say so (grew up watching television all the time)? Did the media affect their movement at all?</p>\n</div><!-- SC_ON -->",
  "score": 120,
  "permalink": "/r/AskHistorians/comments/q2i4e7/how_was_the_relationship_of_the_original_hippies/",
  "subreddit": "AskHistorians",
  "id": "q2i4e7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was talking with friends about the 60s and somebody said that the hippie\ncounterculture couldn't exist today because smartphones would make it\nimpossible. Television, however, did exist in the 60s, and I think it was not\nthat different from the internet. But somebody correctly pointed out that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "友達と60年代の話をしていたら、誰かが「ヒッピーのカウンターカルチャーは今では存在しない。\nカウンターカルチャーは現代ではありえない。\nと言っていました。しかし、60年代にもテレビは存在していましたし、インターネットとそれほど変わらないと思います。\nインターネットとそれほど変わらなかったと思います。しかし、誰かが正しく指摘したのは...。",
      "title": "オリジナルのヒッピーたちは、テレビとどのような関係にあったのでしょうか？彼らはテレビに興味を持っていたのか？テレビは彼らに興味を持っていたのか？ヒッピーたちは、テレビが自分たちやその運動をどのように表現するか、あるいは表現しないかを気にしていたのだろうか？彼らの生活の中でテレビはどのくらい重要だったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和朋友们谈论60年代，有人说嬉皮士\n有人说，嬉皮士的反叛文化今天不可能存在，因为智能手机会使它\n不可能。然而，电视在60年代确实存在，而且我认为它与互联网没有什么不同。\n与互联网没有什么不同。但有人正确地指出，...",
      "title": "最初的嬉皮士与电视的关系如何？他们对电视感兴趣吗？电视对他们感兴趣吗？嬉皮士们是否关心电视可能或不可能如何表现他们和他们的运动？电视在他们的生活中有多重要？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和朋友們談論60年代，有人說嬉皮士\n有人說，嬉皮士的反叛文化今天不可能存在，因爲智能手機會使它\n不可能。然而，電視在60年代確實存在，而且我認爲它與互聯網沒有什麼不同。\n與互聯網沒有什麼不同。但有人正確地指出，...",
      "title": "最初的嬉皮士與電視的關係如何？他們對電視感興趣嗎？電視對他們感興趣嗎？嬉皮士們是否關心電視可能或不可能如何表現他們和他們的運動？電視在他們的生活中有多重要？"
    }
  ]
}