{
  "author": "TheseMood",
  "original_created_utc": 1626150851,
  "title": "When did the five-pointed star become the default, and why?",
  "created_utc": 1626175834,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Recently, I was looking at illustrations of the night sky and the zodiac in Alexander Roob&#39;s Alchemy and Mysticism. The drawings are from the 14th-17th centuries, and I noticed that nearly every depiction of a star was six-pointed, even those not used in a religious context. </p>\n\n<p>Arguably, in modern times the five-pointed star is the default. It&#39;s on everything from flags to glow-in-the-dark constellation stickers. So: at what point in history did the five-pointed star become more common than the six-pointed one, and why?</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/AskHistorians/comments/oj89l3/when_did_the_fivepointed_star_become_the_default/",
  "subreddit": "AskHistorians",
  "id": "oj89l3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Recently, I was looking at illustrations of the night sky and the zodiac in\nAlexander Roob's Alchemy and Mysticism. The drawings are from the 14th-17th\ncenturies, and I noticed that nearly every depiction of a star was six-pointed,\neven those not used in a religious context.\n\nArguably, in modern…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、夜空と星座のイラストを見ていたら\nアレクサンダー・ルーブの『錬金術と神秘主義』に掲載されている夜空と星座のイラストを見ていました。14世紀から17世紀にかけて描かれたものです。\n描かれているのですが、ほとんどの星が6芒星であることに気づきました。\n宗教的な意味合いで使われていないものも含めて。\n\n議論の余地はありますが、現代では...",
      "title": "いつから五芒星がデフォルトになったのか、その理由は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，我在看亚历山大-罗布的《炼金术与神秘主义》中关于夜空和十二宫的插图。\n亚历山大-罗布的《炼金术与神秘主义》中的夜空和十二宫图。这些图画是14-17世纪的\n我注意到，几乎所有的星星都是六角形的。\n即使是那些没有在宗教背景下使用的。\n\n可以说，在现代...",
      "title": "五角星是什么时候成为默认的，为什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，我在看亞歷山大-羅布的《鍊金術與神祕主義》中關於夜空和十二宮的插圖。\n亞歷山大-羅布的《鍊金術與神祕主義》中的夜空和十二宮圖。這些圖畫是14-17世紀的\n我注意到，幾乎所有的星星都是六角形的。\n即使是那些沒有在宗教背景下使用的。\n\n可以說，在現代...",
      "title": "五角星是什麼時候成爲默認的，爲什麼？"
    }
  ]
}