{
  "author": "itisamindset",
  "the_new_excerpt": "Would the difference in expense ratios between Vanguard and Fidelity's Total\nStock Market funds make a sizable difference if I don't touch the money for 45\nyears? Am I missing any other variable here other than the 0.04 vs 0.00 %\nexpense ratios? I understand this sub is largely partial to Vanguard…",
  "original_created_utc": 1621692454,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "バンガード社とフィデリティ社の「トータル」の経費率の違いは、「トータル」の経費率の高さを表しています。\n45年間お金に触れない場合、VanguardとFidelityのTotal Stock Marketファンドの経費率の違いは、大きな違いになるでしょうか？\nるのでしょうか？0.04%と0.00%の違い以外に、何か他の要素を見逃していませんか？\n経費率以外に何か見落としがあるでしょうか？このサイトではVanguardに傾倒しているようですが・・・。",
      "title": "経費率は残業にどれだけ影響するのか？(VTSAX vs FZROX vs FSKAX)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我不碰股票市场基金，Vanguard和Fidelity的总费用率之间的差异会不会有很大的区别？\n如果我在45年内不碰这些钱，先锋和富达的总股票市场基金之间的费用率差异会不会很大？\n年不碰这些钱，它们之间的差别会很大吗？除了0.04%与0.00%的费用率之外，我是否还遗漏了其他变量？\n费用率之外，我是否还遗漏了其他变量？我知道这部分人在很大程度上偏向于Vanguard...",
      "title": "费用率在加班时到底有多重要？(VTSAX vs. FZROX vs. FSKAX)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我不碰股票市場基金，Vanguard和Fidelity的總費用率之間的差異會不會有很大的區別？\n如果我在45年內不碰這些錢，先鋒和富達的總股票市場基金之間的費用率差異會不會很大？\n年不碰這些錢，它們之間的差別會很大嗎？除了0.04%與0.00%的費用率之外，我是否還遺漏了其他變量？\n費用率之外，我是否還遺漏了其他變量？我知道這部分人在很大程度上偏向於Vanguard...",
      "title": "費用率在加班時到底有多重要？(VTSAX vs. FZROX vs. FSKAX)"
    }
  ],
  "title": "How much do expense ratios really matter overtime? (VTSAX vs. FZROX vs. FSKAX)",
  "created_utc": 1621704978,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Would the difference in expense ratios between Vanguard and Fidelity&#39;s Total Stock Market funds make a sizable difference if I don&#39;t touch the money for 45 years? Am I missing any other variable here other than the 0.04 vs 0.00 % expense ratios? I understand this sub is largely partial to Vanguard and I&#39;ve had nothing but good experiences with them, but I wonder if there&#39;s any reason not to move my VTSAX holdings over to FZROX for my Roth and taxable accounts? (Especially seeing as how the holdings of the two funds are nearly identical) My apologies if this has been covered already, but I&#39;m mainly interested in the theoretics of differences in expense ratios when both options are very low.</p>\n</div><!-- SC_ON -->",
  "score": 74,
  "permalink": "/r/Bogleheads/comments/nije15/how_much_do_expense_ratios_really_matter_overtime/",
  "subreddit": "Bogleheads",
  "id": "nije15",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197387107
}