{
  "author": "Angel_Valoel",
  "the_new_excerpt": "Holy hell the number of people and relatives that come out of nowhere was\nsurprising. He only told a few people but it quickly spread. The real problem is\nnot those irrelevant people, but his closest and direct relatives. Our family\nseemed stable when it came to money. No one ever seemed like they'd…",
  "original_created_utc": 1614354163,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我的天啊，突然冒出来的人和亲戚的数量是多少？\n竟然。他只告诉了几个人，但很快就传开了。真正的问题是\n不是那些不相干的人，而是他最亲近的直系亲属。我们家\n似乎稳定 当它来到钱。没有人看起来像他们会... ...",
      "title": "不要告诉任何人你从CC赚了多少钱。我表哥最近把所有东西都卖了，因为他有足够的钱退休，而且... ..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的天啊，突然冒出來的人和親戚的數量是多少？\n竟然。他只告訴了幾個人，但很快就傳開了。真正的問題是\n不是那些不相干的人，而是他最親近的直系親屬。我們家\n似乎穩定 當它來到錢。沒有人看起來像他們會... ...",
      "title": "不要告訴任何人你從CC賺了多少錢。我表哥最近把所有東西都賣了，因爲他有足夠的錢退休，而且... ..."
    }
  ],
  "title": "Don't tell anyone how much you've made off of CC. My cousin recently sold everything since he has enough to retire and...",
  "created_utc": 1614368161,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Holy hell the number of people and relatives that come out of nowhere was surprising. He only told a few people but it quickly spread. The real problem is not those irrelevant people, but his closest and direct relatives. Our family seemed stable when it came to money. No one ever seemed like they&#39;d be like this other than 1 or 2 members. Some of his siblings are fighting him, his mum is just being a horrible person. The things that have been said left me in shock. My parents/siblings have been trying to resolve this but I also see the greed in some of their eyes.</p>\n\n<p>&#x200B;</p>\n\n<p>I feel bad for the guy. We spent the first week just talking and doing random shit to distract him from the situation at home. Some of his relatives turned on his girlfriend blaming her when she has kept quiet the whole time and just supporting my cousin. Honestly, I&#39;m worried for him. We don&#39;t know how to handle the future, but for now, we&#39;re just making sure he spends it wisely and limits himself.</p>\n\n<p>&#x200B;</p>\n\n<p>Seriously guys, LPT even if you think your family is not like other families, and money won&#39;t cause this. Just stay quiet. It&#39;s for the best. I&#39;ve always felt this way, but after seeing it... just wow</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>I hope everything makes sense up there cuz I have yet to sleep and I feel like I&#39;m rambling</p>\n</div><!-- SC_ON -->",
  "score": 807,
  "permalink": "/r/CryptoCurrency/comments/lt0aww/dont_tell_anyone_how_much_youve_made_off_of_cc_my/",
  "subreddit": "CryptoCurrency",
  "id": "lt0aww",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937735129
}