{
  "author": "moazzam0",
  "the_new_excerpt": "As many of you rightfully complain, Buffett has failed to find elephant deals\nfor many years. He's complained himself about this every year and warned every\nyear that BRK will lag SPY in the short term. In the meantime, he's fiddled with\nnew ways to put the cash to use with sector bets on airlines,…",
  "original_created_utc": 1614577053,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "正如很多人理所当然地抱怨，巴菲特没有找到大象的交易\n多年来。他每年都会自己抱怨，每年都会警告自己\n年，BRK将在短期内落后于SPY。同时，他还在摆弄着\n新的套现方式与行业押注航空公司、...",
      "title": "伯克希尔哈撒韦公司年度信分析"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如很多人理所當然地抱怨，巴菲特沒有找到大象的交易\n多年來。他每年都會自己抱怨，每年都會警告自己\n年，BRK將在短期內落後於SPY。同時，他還在擺弄着\n新的套現方式與行業押注航空公司、...",
      "title": "伯克希爾哈撒韋公司年度信分析"
    }
  ],
  "title": "Analysis of Berkshire Hathaway's Annual Letter",
  "created_utc": 1614606299,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As many of you rightfully complain, Buffett has failed to find elephant deals for many years. He&#39;s complained himself about this every year and warned every year that BRK will lag SPY in the short term. In the meantime, he&#39;s fiddled with new ways to put the cash to use with sector bets on airlines, banks, japanese conglomerates, etc. With this backdrop, remember that Buffett is from the Silent Generation. So, what he didn&#39;t say in the report is really important. </p>\n\n<p>He didn&#39;t complain at all about not knowing what to do with cash and didn&#39;t warn that BRK might lag SPY. Let me explain.</p>\n\n<p>The reason he&#39;s been fiddling with sector bets is because these are his replacement for the elephants. In fact, he explains in his letter linked above that they&#39;re even better. He no longer needs to pay a control premium to own them. Plus he can buy into better businesses that are too valued by their shareholders to be sold entirely to any one owner.</p>\n\n<p>A lot of you also think that Warren missed buying last year&#39;s dip. This is not true. When BRK repurchased their own stock at a discount to intrinsic value through all of last year, you as a shareholder got more of everything they own at an additional discount to the bargain prices that existed last year. So not only did they in effect buy at the severely discounted prices, but they bought at an additional discount to those bargain prices.</p>\n\n<p>Over the next year, the market will transition from an easy money market to one where economic principles and free cash flows matter. There&#39;s no one more adept at navigating such markets than Warren and his colossal BRK cash machine.</p>\n\n<p>Also, here&#39;s some simple math for you. SP500 P/E ratio: 38.8. BRK P/E ratio: 13.5. [Yes, I included unrealized capital gains in calculating BRK&#39;s P/E. That&#39;s because BRK&#39;s portfolio is actively managed and it is part of their business model and reported net income. Plus 2020 was a year with a crash in it, so this makes even more sense.] This means BRK&#39;s underperformace relative to SPY lately was due to earnings multiple contraction in BRK while SPY experienced multiple expansion!</p>\n\n<p>This is why Buffett didn&#39;t warn that BRK might underperform. He&#39;s back in his mojo and about to whoop the SP500 again. The repurchases will only accelerate this.</p>\n</div><!-- SC_ON -->",
  "score": 55,
  "permalink": "/r/investing/comments/lv17ke/analysis_of_berkshire_hathaways_annual_letter/",
  "subreddit": "investing",
  "id": "lv17ke",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937740757
}