{
  "author": "Welshybird",
  "original_created_utc": 1624806573,
  "title": "Moons are supposed to incentivise contribution and participation, they only encourage negativity right now",
  "created_utc": 1624818635,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TLDR: be more positive and encouraging. More importantly listen or allow others to have an opinion without shooting them down</p>\n\n<p>Please return things to how it used to be. Currently people downvote, knowing this affects another persons karma value, often to try and force an opinion change.</p>\n\n<p>People disagree completely and just downvote based on it not, pushing their agenda or message. </p>\n\n<p>We are supposed to be encouraging community and new voices. Listening/reasoning/chatting. Moons are supposed to be shared with good contributions, or to encourage not hoarded and used as a status symbol. Currently only those with 1ks of moons get a voice</p>\n\n<p>Stop using votes/moons as weapons</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/o8ywgl/moons_are_supposed_to_incentivise_contribution/",
  "subreddit": "CryptoCurrency",
  "id": "o8ywgl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "TLDR: be more positive and encouraging. More importantly listen or allow others\nto have an opinion without shooting them down\n\nPlease return things to how it used to be. Currently people downvote, knowing\nthis affects another persons karma value, often to try and force an opinion\nchange.\n\nPeople…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TLDR: もっとポジティブに、もっと励ましてください。もっと重要なのは、相手の意見を否定せずに聞いたり\n意見を聞いてあげてください。\n\n以前のように戻してください。現在、人々は他の人のカルマ値に影響を与えることを知っていながら、ダウンボートします。\n他の人のカルマ値に影響することを知っていて、しばしば意見を変えさせようとします。\n変更してください。\n\n人々は...",
      "title": "貢献や参加を促すはずのムーンが、今はネガティブな印象しか与えない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TLDR：要更积极和鼓励。更重要的是倾听或允许他人\n的意见，而不将其击倒\n\n请把事情恢复到以前的样子。目前，人们都在降级投票，知道\n这影响了另一个人的业力值，往往是为了试图强迫别人改变意见\n改变。\n\n人们...",
      "title": "月亮应该是激励贡献和参与的，现在它们只鼓励消极的态度。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TLDR：要更積極和鼓勵。更重要的是傾聽或允許他人\n的意見，而不將其擊倒\n\n請把事情恢復到以前的樣子。目前，人們都在降級投票，知道\n這影響了另一個人的業力值，往往是爲了試圖強迫別人改變意見\n改變。\n\n人們...",
      "title": "月亮應該是激勵貢獻和參與的，現在它們只鼓勵消極的態度。"
    }
  ]
}