{
  "author": "Luminous_Numenorean",
  "original_created_utc": 1629740696,
  "title": "Possible Scam! Let's get to the bottom of this",
  "created_utc": 1629758442,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://ADAX.PRO\">ADAX.PRO</a> is a team of people supposedly working on a new DeFi project for the Cardano ecosystem, and of course like the good little <a href=\"/r/CryptoCurreny\">r/CryptoCurreny</a> member I am, I&#39;ve elected to do my own research and you should too. </p>\n\n<p>That being said I&#39;ve found some disturbing rumours circulating about the project and so I started looking into them based on my own suspicions about the project being fraudulent.</p>\n\n<p>Now what do I mean? first off take a look at their <a href=\"https://ADAX.PRO\">website</a>. At first glance it looks professional and it&#39;s certainly a fluid, well made web design however, when I really sat down and tried to learn about what they were doing I found it unnervingly hard to do so. I wanted to understand more about how the platform worked and how it would compete with other up and coming DeFi projects but all I could find was a well designed website with very vague descriptions about the project&#39;s inner workings. </p>\n\n<p>I read their white paper, I watched their videos, I watched multiple interviews with the CMO Dovydas Petkevičius and it was all to no avail.  </p>\n\n<p>The project as a whole was lacking any kind of technical information. I could find no code, no Github, no visual models or plan for what they were creating. That&#39;s when I dove into their social media which unsurprisingly is rife with people that have the same concerns as me however they are far outweighed by the moonboy culture and active sentinels who will be ready to defend and shut down and reasonable questions that dare to dig a little deeper. There&#39;s a lot of &quot;we&#39;ll be releasing code soon&quot; &quot;Just wait&quot; type responses that have been the norm for months now.</p>\n\n<p>The telegram is full of people who want to go to the moon and the community and its mods encourage it. This sends off red flags instantly, I&#39;ve spent time lurking pump and dump meme coin discords before just to observe (creepy I know) but I find it&#39;s a good way to gauge a community&#39;s drive and intentions.</p>\n\n<p>So anyway, this is long winded I&#39;m sorry. When I&#39;m checking out the team associated with the project on linkedin I notice a lot of the team members are based in Lithuania and there&#39;s nothing wrong with that of course but still I made the mental note.</p>\n\n<p>Fast forward, I look at the buying process for the tokens. They are only available on one exchange, EXmarkets. Nothing too unsual. A lot of startups require some sort of launchpad to get going. As I&#39;m exploring the website I see a little Lithuanian flag at the bottom of the page &quot;Oh they&#39;re based in lithunia too. Odd coincidence but not impossible. They could be working together&quot;</p>\n\n<p>It&#39;s around about this time I look at the reviews for exmarkets. I found quite a few stories suggesting that the site is a scam and that large amounts of money customers had put in had been locked and subject to 30-50% fees to unlock.</p>\n\n<p>Weird, but there&#39;s always those few within this space who lose their money due to their own error and blame the exchange or the software. You see it on almost every crypto platform. I didn&#39;t find out much about the exchange other than it&#39;s a place that provides a service that facilitates newer projects with marketing and a listing on their exchange </p>\n\n<p><a href=\"https://preview.redd.it/xzrj1zqn85j71.png?width=1407&amp;format=png&amp;auto=webp&amp;s=e1681154d5be364f7d64e021ba7cc49b80db9262\">https://preview.redd.it/xzrj1zqn85j71.png?width=1407&amp;format=png&amp;auto=webp&amp;s=e1681154d5be364f7d64e021ba7cc49b80db9262</a></p>\n\n<p>Soon after this that I found <a href=\"https://solanax.org\">solanax.org</a> , an up and coming project that has a resemblance to ADAX. The web design is like a finger print of its developer. It&#39;s not just graphically and visually similar. It has the same level of opacity and vague information available as ADAX&#39;s project. Lo and behold their core team also is heavily represented by Lithuania. Now I&#39;m feeling like a detective but I&#39;m still doubting myself. I don&#39;t want to put out potentially damaging information to an honest project. What if I&#39;m wrong and this is all perfectly innocent? But what if my suspicions are correct and more people will get hurt by this elaborate scam. People easily forgo reason when there&#39;s an expectation of a huge payout.</p>\n\n<p>I decided to check user reviews of Exmarkets. The reviews are highly positive in most places but  if you look at it carefully some of the reviews are written under the same names as the telegram, reddit and discord active users/mods.  Certainly there&#39;s incentive to do so.</p>\n\n<p>There are plenty of hidden negative reviews though and they mostly tell horror stories of losing money and having their funds locked. Some conspiritorial reviews even directed me to an old website <a href=\"https://coinstruction.com\">coinstruction.com</a> which is now down. Luckily we have a beautiful tool called the Waybackmachine that snapshots and archives the internet. Now compare and contrast this old project <a href=\"https://web.archive.org/web/20191016202953/https://www.coinstruction.com/\">https://web.archive.org/web/20191016202953/https://www.coinstruction.com/</a> with the current <a href=\"https://ADAX.PRO\">ADAX.PRO</a> site. Uncanny to say the least</p>\n\n<p><a href=\"https://preview.redd.it/pewziwd795j71.png?width=678&amp;format=png&amp;auto=webp&amp;s=e3cc22b7f08f15040cb81b8dfafac9ef1cde1b2b\">https://preview.redd.it/pewziwd795j71.png?width=678&amp;format=png&amp;auto=webp&amp;s=e3cc22b7f08f15040cb81b8dfafac9ef1cde1b2b</a></p>\n\n<p><a href=\"https://preview.redd.it/zuhtblz895j71.png?width=434&amp;format=png&amp;auto=webp&amp;s=1d2bdf457bfb2575cc4b369a9261057f1b1070ec\">https://preview.redd.it/zuhtblz895j71.png?width=434&amp;format=png&amp;auto=webp&amp;s=1d2bdf457bfb2575cc4b369a9261057f1b1070ec</a></p>\n\n<p><a href=\"https://preview.redd.it/sow9ey4a95j71.png?width=403&amp;format=png&amp;auto=webp&amp;s=e1472bbf0d7003aff1d25907992ab9d4e497d194\">https://preview.redd.it/sow9ey4a95j71.png?width=403&amp;format=png&amp;auto=webp&amp;s=e1472bbf0d7003aff1d25907992ab9d4e497d194</a></p>\n\n<p>This isn&#39;t such a big deal. Marketing can and will happen.</p>\n\n<p>Now, after looking at the familiar vague descriptions of the Coinstruction plan and lighter than a feather white paper I moved on to the team at the time circa 2018-19. </p>\n\n<p>First thing I noticed was that the Coinstruction backend senior director Muhammad Furqan, is now the CTO of ADAX. Again it&#39;s not that odd. Perhaps the project failed and he moved on to ADAX with more experience and a better plan.</p>\n\n<p>The next thing I did was look into the founder of Coinstruction Tadas Kasputis. It seems he has a shady past and has been involved High-Yield Investment Programs and pyramid schemes since before Bitcoin was conceived.</p>\n\n<p>I found this <a href=\"https://siliconangle.com/2015/01/23/millions-stolen-inside-the-elaborate-bitcoin-scams-of-tadas-kasputis-egopay-virtex-com-paymentbase/\">article</a> from 2015 investigating some of his ventures.</p>\n\n<p>&#x200B;</p>\n\n<p>Needless to say this has raised more red flags and questions than I initially had thought.</p>\n\n<p>I could be wrong and I for sure don&#39;t have all the information available but I would think very very carefully about putting your money into this project.</p>\n\n<p>The lack of transparency is alarming and I&#39;d hate for the start of the Cardano Ecosystem to be marred by a big rug pull.</p>\n\n<p>There&#39;s a lot of Cardano hype right now and people will absolutely FOMO into these without doing their due diligence.</p>\n\n<p>They also have partnerships with various other projects like Charli3 and Blackdragon which I haven&#39;t had the time to look into. I did see Charli3&#39;s white paper though and it suffers from a similar lack of information.</p>\n\n<p>&#x200B;</p>\n\n<p>If I&#39;m wrong that&#39;s fine and I&#39;ll eat my words. But I&#39;d rather people err on the side of caution during this time of immense hype. Life changing money is alluring and scammers are experts at taking advantage of that.</p>\n\n<p>&#x200B;</p>\n\n<p>The world is getting smarter and that means the scammers are getting smarter too. Be safe.</p>\n</div><!-- SC_ON -->",
  "score": 280,
  "permalink": "/r/CryptoCurrency/comments/pa4wlj/possible_scam_lets_get_to_the_bottom_of_this/",
  "subreddit": "CryptoCurrency",
  "id": "pa4wlj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "ADAX.PRO [https://ADAX.PRO] is a team of people supposedly working on a new DeFi\nproject for the Cardano ecosystem, and of course like the good little\nr/CryptoCurreny [/r/CryptoCurreny] member I am, I've elected to do my own\nresearch and you should too.\n\nThat being said I've found some disturbing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ADAX.PRO [https://ADAX.PRO]は、新しいDeFiに取り組んでいるとされるチームです。\nプロジェクトに取り組んでいると言われています。\nr/CryptoCurreny [/r/CryptoCurreny]メンバーである私は、自分自身の\nあなたもそうしてください。\n\nとはいえ、私はいくつかの気がかりなことを見つけました...",
      "title": "詐欺の可能性あり！？真相を究明しよう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "ADAX.PRO [https://ADAX.PRO]是一个据说是在新的DeFi上工作的团队。\n项目，当然，像我这样一个好的小\nr/CryptoCurreny [/r/CryptoCurreny] 的成员，我选择做我自己的\n研究，你也应该这样做。\n\n这就是说，我发现了一些令人不安的...",
      "title": "可能的骗局! 让我们来了解一下这个问题的真相"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "ADAX.PRO [https://ADAX.PRO]是一個據說是在新的DeFi上工作的團隊。\n項目，當然，像我這樣一個好的小\nr/CryptoCurreny [/r/CryptoCurreny] 的成員，我選擇做我自己的\n研究，你也應該這樣做。\n\n這就是說，我發現了一些令人不安的...",
      "title": "可能的騙局! 讓我們來了解一下這個問題的真相"
    }
  ]
}