{
  "author": "MaxAugust",
  "original_created_utc": 1657796643,
  "title": "Xiang Yu was the archnemesis of the founder of the Han Dynasty. In spite of this, he is usually depicted by later writers as a tragic hero. How did China's seminal dynasty's greatest obstacle get such a good reputation?",
  "created_utc": 1657846885,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Obviously, the old adage &amp;quot;history is written by the victors&amp;quot; often does not hold up. But it is striking to me how often and how soon generally positive depictions of the Hegemon King show up in the record.&lt;/p&gt;\n\n&lt;p&gt;By my reading at least, Sima Qian characterizes Xiang Yu as a perhaps somewhat flawed but ultimately heroic figure. While the Grand Historian is famous for his veiled criticism, that seems fairly blatant considering he was writing near the height of the Han Dynasty which presumably had a vested interest in people not believing that maybe Xiang Yu was the better man.&lt;/p&gt;\n\n&lt;p&gt;Considering how slanderous the accounts of many failed leaders are in Chinese history. How did Xiang Yu end up getting remembered for his martial valor and tragic love story rather than for being some horrific butcher.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/vyt6ww/xiang_yu_was_the_archnemesis_of_the_founder_of/",
  "subreddit": "AskHistorians",
  "id": "vyt6ww",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Obviously, the old adage \"history is written by the victors\" often does not hold\nup. But it is striking to me how often and how soon generally positive\ndepictions of the Hegemon King show up in the record.\n\nBy my reading at least, Sima Qian characterizes Xiang Yu as a perhaps somewhat\nflawed but…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "明らかに、「歴史は勝者によって書かれる」という古い格言は通用しないことが多い。\nしかし しかし、一般に肯定的なヘゲモニー王の描写が、しばしば、そしてどれほど早くも\n覇権を握った王について、一般的に肯定的な描写が、記録に頻繁に、そしてすぐに現れていることは印象的である。\n\n少なくとも私の読みでは、司馬遷は項羽を、おそらく多少なりとも\n欠点があるが...",
      "title": "項羽は漢王朝の創始者の宿敵である。にもかかわらず、後世の作家は彼を悲劇のヒーローとして描くことが多い。中国を代表する王朝の最大の敵が、なぜこれほどまでに評価されるようになったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "显然，\"历史是由胜利者书写的 \"这句老话往往不成立。\n的。但是，令我震惊的是，一般来说，正面的描述是多么频繁，多么迅速\n霸王的描述出现在记录中。\n\n至少在我的解读中，司马迁把项羽描述为一个也许有点儿\n有缺陷，但...",
      "title": "项羽是汉朝创始人的克星。尽管如此，他通常被后来的作家们描绘成一个悲剧性的英雄。中国这个开创性王朝的最大障碍是如何获得如此好的声誉的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "顯然，\"歷史是由勝利者書寫的 \"這句老話往往不成立。\n的。但是，令我震驚的是，一般來說，正面的描述是多麼頻繁，多麼迅速\n霸王的描述出現在記錄中。\n\n至少在我的解讀中，司馬遷把項羽描述爲一個也許有點兒\n有缺陷，但...",
      "title": "項羽是漢朝創始人的剋星。儘管如此，他通常被後來的作家們描繪成一個悲劇性的英雄。中國這個開創性王朝的最大障礙是如何獲得如此好的聲譽的？"
    }
  ]
}