{
  "author": "Orlak007",
  "original_created_utc": 1633360872,
  "title": "How do I tell a girl her vagina stinks?",
  "created_utc": 1633380636,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is an honest question. I’m not trying to make fun of her or anything. We were having sex under the cover and the whiffs of the odor were so bad I just rolled over and quit pumping. When I rolled over the covers came down on me. I mention this because just as you fart under the covers then raise the cover up and slam it down, you get a huge inhale of the fart, well this time it was a huge inhale of her foul vagina odor. It was so bad! Weirdly it’s like she doesn’t smell it.</p>\n\n<p>I then got up to take a shower, feeling disgusted. She got in with me and it hit me like a ton of bricks. The smell of her vagina with the hot steam almost sent me into a coma. I’m not one to confront someone or be too upfront, how should I go about this?</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/q17jgp/how_do_i_tell_a_girl_her_vagina_stinks/",
  "subreddit": "TooAfraidToAsk",
  "id": "q17jgp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is an honest question. I’m not trying to make fun of her or anything. We\nwere having sex under the cover and the whiffs of the odor were so bad I just\nrolled over and quit pumping. When I rolled over the covers came down on me. I\nmention this because just as you fart under the covers then raise…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは正直なところ、疑問です。彼女をバカにしているわけでも何でもないんです。私たちは\n隠れてセックスしていたら、臭いの匂いがひどくて、つい\n寝返りを打ってピストンをやめました。私が寝返りを打ったとき、布団が私の上に降りてきました。I\nこれは、布団の中でおならをした後、布団を上げるのと同じように...。",
      "title": "女の子に「アソコが臭い」と伝えるには？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是个诚实的问题。我不是想取笑她或什么。我们\n我们在被窝里做爱，闻到的气味太难闻了，我只是\n我就翻了个身，放弃了抽插。当我翻身的时候，被子落在我身上。I\n提到这个，是因为就像你在被子里放屁，然后掀开...",
      "title": "我如何告诉一个女孩她的阴道很臭？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是個誠實的問題。我不是想取笑她或什麼。我們\n我們在被窩裏做愛，聞到的氣味太難聞了，我只是\n我就翻了個身，放棄了抽插。當我翻身的時候，被子落在我身上。I\n提到這個，是因爲就像你在被子裏放屁，然後掀開...",
      "title": "我如何告訴一個女孩她的陰道很臭？"
    }
  ]
}