{
  "author": "gorte1ec",
  "original_created_utc": 1644257967,
  "title": "Help me understand the recent market turnaround",
  "created_utc": 1644269962,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am sitting here trying to understand and rationalize the market rebound and I have come to the conclusion that I have no idea why the market is trending back upwards. Was there something in particular that can be attributed to the turnaround? Just not sure where all the current resilience and market confidence is coming from.&lt;/p&gt;\n\n&lt;p&gt;I have been hesitant ever since it was signaled that there would be an announcement from the White House on how they wanted to “enforce rules around crypto as a matter of national security”. I’m sure this announcement will be something close to what India has done with their 30% but there is no way to know.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 337,
  "permalink": "/r/CryptoCurrency/comments/smwx3o/help_me_understand_the_recent_market_turnaround/",
  "subreddit": "CryptoCurrency",
  "id": "smwx3o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am sitting here trying to understand and rationalize the market rebound and I\nhave come to the conclusion that I have no idea why the market is trending back\nupwards. Was there something in particular that can be attributed to the\nturnaround? Just not sure where all the current resilience and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はここで、市場の反発を理解し合理化しようとしています。\nなぜ市場が戻ってくるのか、私にはわからないという結論に達しました。\nを上方修正した。何か特別な要因があったのでしょうか？\nターンアラウンド？ただ、現在の反発力がどこにあるのかがわからないし、...",
      "title": "最近の相場の転換期を理解するのに役立つ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我坐在这里试图理解和理顺市场的反弹，我得出的结论是，我不知道为什么市场会出现反弹趋势。\n我得出的结论是，我不知道为什么市场会出现反弹趋势\n向上。是否有什么特别的东西可以归因于\n转机？只是不知道目前所有的抗跌性和...",
      "title": "帮助我理解最近的市场转机"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我坐在這裏試圖理解和理順市場的反彈，我得出的結論是，我不知道爲什麼市場會出現反彈趨勢。\n我得出的結論是，我不知道爲什麼市場會出現反彈趨勢\n向上。是否有什麼特別的東西可以歸因於\n轉機？只是不知道目前所有的抗跌性和...",
      "title": "幫助我理解最近的市場轉機"
    }
  ]
}