{
  "author": "tfproblem",
  "original_created_utc": 1629563113,
  "title": "10 Years Ago Bankers Froze All Donations to WikiLeaks after they exposed Government Corruption: Now they Accept Crypto",
  "created_utc": 1629581989,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>10 years ago bankers and politicians forced Paypal to freeze all donations to WikiLeaks after they exposed government corruption.</p>\n\n<p>There was only one thing which they could not stop: Bitcoin donations which still went through and were impossible to freeze or take away.</p>\n\n<p>This is what happens now to OnlyFans, which against popular believe did not decide itself to stop pornographic content, but bankers forced them to, or they stop all transactions.</p>\n\n<p>Crypto/Bitcoin is the only payment option even the government could and can still not stop. The last financial system where the users are still in charge</p>\n</div><!-- SC_ON -->",
  "score": 177,
  "permalink": "/r/CryptoCurrency/comments/p8ufeg/10_years_ago_bankers_froze_all_donations_to/",
  "subreddit": "CryptoCurrency",
  "id": "p8ufeg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "10 years ago bankers and politicians forced Paypal to freeze all donations to\nWikiLeaks after they exposed government corruption.\n\nThere was only one thing which they could not stop: Bitcoin donations which\nstill went through and were impossible to freeze or take away.\n\nThis is what happens now to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "10年前、銀行家と政治家は、Paypalに、WikiLへのすべての寄付を凍結するよう強制しました。\nウィキリークスが政府の汚職を暴露した後、Paypalはウィキリークスへのすべての寄付を凍結させました。\n\nしかし、唯一止められなかったのが、ビットコインによる寄付でした。\nそれは、ビットコインによる寄付で、これは凍結も奪うこともできませんでした。\n\nこれが今の状況です...",
      "title": "10年前、政府の腐敗を暴いたウィキリークスへの寄付金を銀行が凍結した。今、彼らは暗号を受け入れている"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "10年前，银行家和政客迫使Paypal冻结所有对维基解密的捐款。\n维基解密揭露了政府的腐败行为后。\n\n只有一件事是他们无法阻止的：比特币捐款。\n仍然通过，并且不可能被冻结或拿走。\n\n这就是现在发生在...",
      "title": "10年前，维基解密揭露政府腐败后，银行家们冻结了对他们的所有捐款。现在他们接受加密货币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "10年前，銀行家和政客迫使Paypal凍結所有對維基解密的捐款。\n維基解密揭露了政府的腐敗行爲後。\n\n只有一件事是他們無法阻止的：比特幣捐款。\n仍然通過，並且不可能被凍結或拿走。\n\n這就是現在發生在...",
      "title": "10年前，維基解密揭露政府腐敗後，銀行家們凍結了對他們的所有捐款。現在他們接受加密貨幣"
    }
  ]
}