{
  "author": "finncorg",
  "the_new_excerpt": "With Joe Biden as President, John Roberts as Chief Justice, Patrick Leahy as\nPresident Pro Tempore, and Nancy Pelosi as Speaker, Catholics occupy some of the\nhighest offices of the government. I’m aware of President Kennedy and the\ncontinued representation of Catholics on the Supreme Court. I was…",
  "original_created_utc": 1611265594,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "乔-拜登为总统，约翰-罗伯茨为首席大法官，帕特里克-莱希为总统。\n臨時總統和南希-佩洛西擔任議長，天主教徒佔據了一些地方。\n政府的最高职位。我知道肯尼迪总统和\n天主教徒在最高法院的持续代表性。我是...",
      "title": "今天，天主教徒领导着美国政府的每一个部门。天主教徒在美国政府最高层的代表权以前是否存在过这么大的程度，天主教何时/如何为美国新教主流所接受？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "喬-拜登爲總統，約翰-羅伯茨爲首席大法官，帕特里克-萊希爲總統。\n臨時總統和南希-佩洛西擔任議長，天主教徒佔據了一些地方。\n政府的最高職位。我知道肯尼迪總統和\n天主教徒在最高法院的持續代表性。我是...",
      "title": "今天，天主教徒領導着美國政府的每一個部門。天主教徒在美國政府最高層的代表權以前是否存在過這麼大的程度，天主教何時/如何爲美國新教主流所接受？"
    }
  ],
  "title": "Today, Catholics lead every branch of the US government. Has Catholic representation at the highest levels of American government ever existed to this large of a degree before and when/how did Catholicism become acceptable to the American Protestant mainstream?",
  "created_utc": 1611284385,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>With Joe Biden as President, John Roberts as Chief Justice, Patrick Leahy as President Pro Tempore, and Nancy Pelosi as Speaker, Catholics occupy some of the highest offices of the government. I’m aware of President Kennedy and the continued representation of Catholics on the Supreme Court. I was wondering if this level of Catholic representation has been reached before and when Catholics became acculturated enough into the American Christian mainstream for this to become possible.</p>\n\n<p>Edit: It has been pointed out that Sen. Patrick Leahy isn’t the highest officer of the Senate, but he still occupies a very high leadership role in the chamber.</p>\n</div><!-- SC_ON -->",
  "score": 1559,
  "permalink": "/r/AskHistorians/comments/l28mmu/today_catholics_lead_every_branch_of_the_us/",
  "subreddit": "AskHistorians",
  "id": "l28mmu",
  "is_self": true,
  "media": null,
  "is_video": false
}