{
  "author": "thatvampigoddess",
  "original_created_utc": 1627307716,
  "title": "Do black people actually care about non black people doing braids or is that just twitter?",
  "created_utc": 1627318466,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, I&#39;m from Iraq and I wouldn&#39;t just assume the internet is real life. We don&#39;t have enough black people here for me to ask so I have no idea.</p>\n\n<p>I&#39;m not even on twitter but the app is a cesspool of people whining about anything and everything.</p>\n\n<p>Does it make a difference to you if the person has curly hair? Or is it just a race issue?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/orz736/do_black_people_actually_care_about_non_black/",
  "subreddit": "TooAfraidToAsk",
  "id": "orz736",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So, I'm from Iraq and I wouldn't just assume the internet is real life. We don't\nhave enough black people here for me to ask so I have no idea.\n\nI'm not even on twitter but the app is a cesspool of people whining about\nanything and everything.\n\nDoes it make a difference to you if the person has…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、私はイラク出身ですが、インターネットを現実のものだと決めつけることはしません。この国には\n聞けるほどの黒人がここにはいないので、さっぱりわかりません。\n\nツイッターもやっていませんが、このアプリは何でもかんでも愚痴っている人の巣窟です。\n何でもかんでも愚痴っている人の巣窟です。\n\nあなたにとって、その人が持っているものに違いはありますか？",
      "title": "黒人の人たちは、黒人以外の人が三つ編みをしていることを実際に気にしているのでしょうか、それともそれはtwitterだけのことでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我来自伊拉克，我不会随便认为互联网就是现实生活。我们这里没有\n我们这里有足够多的黑人，所以我也不知道。\n\n我甚至没有上Twitter，但这个应用程序是一个人们抱怨的粪坑。\n任何事情和所有事情。\n\n这对你来说有什么区别吗，如果这个人有...",
      "title": "黑人是否真的关心非黑人做辫子的事，还是说这只是微博上的说法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我來自伊拉克，我不會隨便認爲互聯網就是現實生活。我們這裏沒有\n我們這裏有足夠多的黑人，所以我也不知道。\n\n我甚至沒有上Twitter，但這個應用程序是一個人們抱怨的糞坑。\n任何事情和所有事情。\n\n這對你來說有什麼區別嗎，如果這個人有...",
      "title": "黑人是否真的關心非黑人做辮子的事，還是說這只是微博上的說法？"
    }
  ]
}