{
  "author": "nafizzaki",
  "the_new_excerpt": "There comes a point in any big selloff in Treasury bonds when the move becomes\nso pronounced that it starts to feed on itself. Increases in yields force a\ncrucial group of investors to sell Treasuries, which in turn leads to further\nincreases in yields. Two months into this rout, that moment appears…",
  "original_created_utc": 1614319216,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "国债的任何一次大抛售都会有一个点，当移动变得\n如此明显，以至于它开始自食其力。产量的增加迫使\n关键的投资者群体抛售国债，进而导致进一步的\n产量的增加。溃败两个月后，那一刻似乎... ...",
      "title": "由于抵押贷款支持债券的投资者，国债市场的反馈循环（凸性对冲）正在进行。你们要小心。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "國債的任何一次大拋售都會有一個點，當移動變得\n如此明顯，以至於它開始自食其力。產量的增加迫使\n關鍵的投資者羣體拋售國債，進而導致進一步的\n產量的增加。潰敗兩個月後，那一刻似乎... ...",
      "title": "由於抵押貸款支持債券的投資者，國債市場的反饋循環（凸性對沖）正在進行。你們要小心。"
    }
  ],
  "title": "Feedback loop(convexity hedging) is ongoing in the treasury market due to mortgage-backed bond investors. Be careful guys.",
  "created_utc": 1614349484,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There comes a point in any big selloff in Treasury bonds when the move becomes so pronounced that it starts to feed on itself. Increases in yields force a crucial group of investors to sell Treasuries, which in turn leads to further increases in yields. Two months into this rout, that moment appears to have arrived, and it’s beginning to send shudders throughout all corners of U.S. financial markets.</p>\n\n<p>The forced sellers are investors in the $7 trillion mortgage-backed bond market. Their problem is that when Treasury yields -- which strongly influence home-loan rates -- suddenly rise sharply, many Americans lose interest in refinancing their old mortgages. A reduced stream of refinancings means mortgage-bond investors are left waiting for longer to collect payments on their investments. The longer the wait, the more financial pain they feel as they watch market rates climb higher without being able to take advantage of them. Their answer: unload the Treasury bonds they hold with long maturities or adjust derivatives positions -- a phenomenon known as convexity hedging -- to compensate for the unexpected jump in duration on their mortgage portfolios. The extra selling just as the market just as the market is already weakening has a history of exacerbating upward moves in Treasury yields -- including during major “convexity events” in 1994 and 2003.</p>\n\n<p>Read more at: <a href=\"https://www.bloombergquint.com/onweb/convexity-hedging-haunts-markets-already-reeling-from-bond-rout\">https://www.bloombergquint.com/onweb/convexity-hedging-haunts-markets-already-reeling-from-bond-rout</a>\nCopyright © BloombergQuint</p>\n\n<p>This go around, the Federal Reserve’s massive presence in the mortgage-bond market -- it’s adding about $40 billion of the securities each month to its balance sheet -- has created something of a stabilizing force that has kept the market’s hedging needs in check. Even so, waves of mortgage investors adjusting their portfolios could still have an outsized impact on rates that reverberates across asset classes, market watchers say. “Everyone -- except the Fed -- is a convexity hedger at some point because as your portfolio keeps getting longer with the rise in rates it will become increasingly painful,” said Joshua Younger, head of U.S. interest-rate derivatives strategy at JPMorgan Chase &amp;amp; Co. “There’s more flexibility now for those who need to hedge so rates rising won’t cause the train to go off the rails. But even a train on the rails can be difficult to stop.”</p>\n\n<p>Ten-year Treasury yields surged as much as 0.23 percentage point to a more than one year high of 1.61% Thursday before the selloff eased. Overall convexity hedging needs are likely at peak levels near the 1.6% area, Morgan Stanley strategist Guneet Dhingra wrote in a note to clients, potentially creating further upward pressure on yields in the middle of the Treasury curve. Five-year yields climbed even more than long-term rates, jumping as much as 0.26 percentage point to about 0.86% before paring their ascent. For Peter Chatwell, head of multi-asset strategy at Mizuho International, the spike in five-year rates is a warning signal that the selloff is going beyond a repricing, toward a convexity move, suggesting U.S. stocks and credit spreads will suffer further. The Nasdaq 100 fell as much as 3.7% Thursday, its biggest intraday drop since October. </p>\n\n<p>Read more: Treasury yields surge past 1.6%, sounding alarm for risk assets </p>\n\n<p>Still, few expect to see anything like what occurred in 2003, when convexity hedging helped fuel a roughly 1.5 percentage-point increase in 10-year Treasury yields over just two months, triggering widespread losses for bond investors. That’s because roughly a third of all mortgage-backed securities are now held by the Fed, which doesn’t hedge its duration risk, and another third by U.S. banks, which also largely don’t. Back in 2003, before the Fed started buying mortgage bonds to help stimulate the economy, Fannie Mae and Freddie Mac owned more than 20% of the market and were major convexity hedgers.</p>\n\n<p>Nonetheless, there are enough mortgage-bond investors that do hedge to raise concerns just as yields threaten to become unmoored. Bank of America Corp. last week estimated there to be north of $60 billion of convexity hedging needs in terms of 10-year equivalents, the bulk coming from mortgage lenders, which must hedge their loan pipelines. The fact that investors are on high alert for mortgage-bond hedging effects despite being aware that non-hedgers now own the lion’s share of the debt should help ensure future portfolio adjustments are more “orderly” than in years past, according to Mahesh Swaminathan, a securitized-bond strategist at Hilltop Securities. “The focus now on this risk is positive for the marketplace and from a big-picture standpoint,” said Swaminathan. “This will prevent the situation of people being so far off sides that they have to make a sudden and huge adjustment. People are being vigilant about potential duration extension in the mortgage market.”</p>\n\n<p><em>My take:</em> while I don’t have any time machine, I don’t think this rise in yield will sustain as FED continues to abolish the free market. So, I think FED fund rates won’t rise and the yield in treasury will fall pretty quickly and we will have negative real interest rate in the future.</p>\n\n<p>It logically follows that this is probably a good opportunity to buy the dip.</p>\n\n<p>Do remember that the feedback loop in the treasury market may not have topped still.</p>\n</div><!-- SC_ON -->",
  "score": 52,
  "permalink": "/r/stocks/comments/lsralb/feedback_loopconvexity_hedging_is_ongoing_in_the/",
  "subreddit": "stocks",
  "id": "lsralb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937742101
}