{
  "author": "DesignerAccount",
  "original_created_utc": 1634221281,
  "title": "Unpopular reality check: We're early, but not *that* early.",
  "created_utc": 1634254751,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I see a lot of posts and people claiming we&#39;re early and that if you only stack SATS you&#39;ll end up with generational wealth. Sorry to bust your bubble, but that&#39;s just not true anymore, unless you already have significant money.</p>\n\n<p>Note: Emphasis on <strong>generational wealth by stacking SATS</strong>.</p>\n\n<p>&nbsp;</p>\n\n<p>Some maths. Do you like a price of $10m? OK, let&#39;s take that as our target goal. People might object, or argue it will happen in a long time, but let&#39;s stick with it as a best case scenario. Starting price, let&#39;s assume $60k. Or better, let&#39;s say we get another 150x on money invested from here. ($10m/$60k ~ 150x, if we assume some uncertainty in end price.)</p>\n\n<p>Right, so that 150x is what you&#39;ll get. To get to $1m, you need $7k <strong>today</strong>. And I know that $1m sounds like a lot, but it&#39;s a lot less than you may think. One thing for sure, that&#39;s no generational wealth, in the sense that you can pass it down many generations. Depending on where you live, that might not even be enough for a family house! (So to bust you bubble once more, even in those high cost of living areas your parents probably already own a family house... hardly generational wealth, right?)</p>\n\n<p>Oh, and all of this is assuming you have $7k today to invest. Which not many do. Do you want true generational wealth, say in excess of $10m? You&#39;ll need to buy <strong>1 whole coin</strong> today.</p>\n\n<p>Stacking SATS at $50 a pop? Great savings strategy, but don&#39;t fool yourself about riches.</p>\n\n<p>&nbsp;</p>\n\n<p>All of the above is true if you invest <strong>today</strong>. What if you stack SATS @ $90k? $150k? $250k? You get the picture.</p>\n\n<p>And ofc I didn&#39;t even start talking about the time it will take you. Let&#39;s say we get to $10m/coin in ~40yrs. Right, so now you have generational wealth and... you slaved your life away. Enjoy spending that money to treat all the health problems you accumulated until retirement.</p>\n\n<p>&nbsp;</p>\n\n<p>I stack SATS like many, and encourage everyone do the same, including running your own node and having full control of your keys, but I&#39;m under no illusion that those SATS will become &quot;generational wealth&quot;. </p>\n\n<p>I don&#39;t want to discourage people, the changes Bitcoin will bring go far beyond anything we&#39;ve ever seen, and far beyond any one individual&#39;s wealth accumulation. Yes, it&#39;s early in terms of economic activity based on Bitcoin, but it&#39;s absolutely not early anymore price-wise.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/Bitcoin/comments/q80qbp/unpopular_reality_check_were_early_but_not_that/",
  "subreddit": "Bitcoin",
  "id": "q80qbp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I see a lot of posts and people claiming we're early and that if you only stack\nSATS you'll end up with generational wealth. Sorry to bust your bubble, but\nthat's just not true anymore, unless you already have significant money.\n\nNote: Emphasis on generational wealth by stacking SATS.\n\n \n\nSome…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの投稿や人々が我々は早いと主張しているのを見て、もしあなたがSATSだけを積み重ねれば\nSATSだけを積み上げれば、世代を超えた豊かさを手に入れることができます。あなたのバブルを壊すようで申し訳ありませんが\nすでにかなりのお金を持っていない限り、それはもう真実ではありません。\n\n注：SATSを積み重ねることで世代を超えた富を得ることを強調しています。\n\n \n\nいくつかの...",
      "title": "不評のリアリティチェック 私たちは早いですが、そんなに早くはありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到很多帖子和人们声称我们早了，如果你只堆积\nSATS，你就会拥有一代人的财富。很抱歉打破你的泡沫，但\n除非你已经有了大量的资金，否则这已经不是事实了。\n\n注：强调通过堆积SATS的代际财富。\n\n \n\n有些人...",
      "title": "不受欢迎的现实检查。我们来早了，但没有*那么早。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到很多帖子和人們聲稱我們早了，如果你只堆積\nSATS，你就會擁有一代人的財富。很抱歉打破你的泡沫，但\n除非你已經有了大量的資金，否則這已經不是事實了。\n\n注：強調通過堆積SATS的代際財富。\n\n \n\n有些人...",
      "title": "不受歡迎的現實檢查。我們來早了，但沒有*那麼早。"
    }
  ]
}