{
  "author": "MGMB89",
  "the_new_excerpt": "The Sound of Music takes places in the 1930s in the lead-up to the Anschluss.\nCaptain von Trapp stands out as someone against Nazism and this merging of\nGermany and Austria.\n\nNot in the movie: the political party of Austria was the Fatherland Front which\nwas led by Engelbert Dollfuss until his…",
  "original_created_utc": 1612788896,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "音乐之声》的故事发生在上世纪30年代的Anschluss之前。\n冯-特拉普上尉作为反对纳粹主义的人而脱颖而出，这种融合的。\n德国和奥地利。\n\n电影中没有：奥地利的政党是祖国阵线，它\n由恩格尔伯特-多尔福斯领导，直到他... ...",
      "title": "冯-特拉普上尉是法西斯分子吗？反对纳粹主义和Anschluss的非犹太裔奥地利人的政治信仰是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "音樂之聲》的故事發生在上世紀30年代的Anschluss之前。\n馮-特拉普上尉作爲反對納粹主義的人而脫穎而出，這種融合的。\n德國和奧地利。\n\n電影中沒有：奧地利的政黨是祖國陣線，它\n由恩格爾伯特-多爾福斯領導，直到他... ...",
      "title": "馮-特拉普上尉是法西斯分子嗎？反對納粹主義和Anschluss的非猶太裔奧地利人的政治信仰是什麼？"
    }
  ],
  "title": "Was Captain von Trapp a fascist? What were the political beliefs of non-Jewish Austrians who were against Nazism and the Anschluss?",
  "created_utc": 1612799036,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>The Sound of Music</em> takes places in the 1930s in the lead-up to the Anschluss. Captain von Trapp stands out as someone against Nazism and this merging of Germany and Austria.</p>\n\n<p>Not in the movie: the political party of Austria was the Fatherland Front which was led by Engelbert Dollfuss until his assassination. They weren&#39;t Nazis but they were Austrian Nationalists.</p>\n\n<p>How much of a unifying factor was loyalty to the Fatherland Front in anti-Nazism in Austria? What were the political beliefs of non-Jewish Austrians during this time? How interested were some in a Habsburg restoration?</p>\n</div><!-- SC_ON -->",
  "score": 135,
  "permalink": "/r/AskHistorians/comments/lfb75k/was_captain_von_trapp_a_fascist_what_were_the/",
  "subreddit": "AskHistorians",
  "id": "lfb75k",
  "is_self": true,
  "media": null,
  "is_video": false
}