{
  "author": "RoyalInterest",
  "original_created_utc": 1643874411,
  "title": "Is it easy to fool child protective services?",
  "created_utc": 1643887177,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My neighbors are drug addicts and they have 3 young little girls. They moved in unexpectedly because the mom lied and told the landlord that she fleeing a domestic violence situation with her boyfriend and that he stole all of her stuff. I knew it was a lie because he helped her move into this apartment even though she told the landlord she had no contact with him. Anyway, I can hear the kids crying and begging their parents for food on occasion and they are visibly dirty and unkept. I can also hear the mom verbally abusing the kids by calling them retards and bitches. I know they do drugs because there are constantly cars coming to this house at all hours of the night and they run out to grab something from them and run back in. Also, I’ve overheard conversations about their drug use. The landlord claims he’s trying to evict them due to non-payment of rent and he called CPS, but all the mom did was tell them lies, cleaned the house, and put them on nice clothes for the visit. CPS literally brought her bunk beds and mattresses because the kids were sleeping on the bare floor. Also, the kids barely to go to school because I hear them during school hours. How can they possibly hide all of this and CPS not notice???&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/NoStupidQuestions/comments/sjdejw/is_it_easy_to_fool_child_protective_services/",
  "subreddit": "NoStupidQuestions",
  "id": "sjdejw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My neighbors are drug addicts and they have 3 young little girls. They moved in\nunexpectedly because the mom lied and told the landlord that she fleeing a\ndomestic violence situation with her boyfriend and that he stole all of her\nstuff. I knew it was a lie because he helped her move into this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の隣人は麻薬中毒者で、3人の幼い娘がいます。彼らが引っ越してきたのは\nというのも、母親が大家さんに、「私は、今、逃げているんです」と嘘をついたからです。\n彼氏から家庭内暴力を受けていて、全部盗まれてしまったと。\nものです。この部屋への引っ越しを手伝ったのは彼なので、嘘だとわかっていたのですが...。",
      "title": "児童相談所を騙すのは簡単？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的邻居是吸毒者，他们有三个年轻的小女孩。他们搬进来\n因为她的母亲撒谎，告诉房东她正在逃避与男友的家庭暴力，而且男友偷走了她所有的东西。\n她和她的男朋友发生了家庭暴力，他偷走了她所有的东西。\n东西。我知道这是个谎言，因为他帮助她搬进了这个...",
      "title": "欺骗儿童保护机构容易吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的鄰居是吸毒者，他們有三個年輕的小女孩。他們搬進來\n因爲她的母親撒謊，告訴房東她正在逃避與男友的家庭暴力，而且男友偷走了她所有的東西。\n她和她的男朋友發生了家庭暴力，他偷走了她所有的東西。\n東西。我知道這是個謊言，因爲他幫助她搬進了這個...",
      "title": "欺騙兒童保護機構容易嗎？"
    }
  ]
}