{
  "author": "Wulkingdead",
  "original_created_utc": 1652259292,
  "title": "I'm sorry for all the people that lost their life savings, again! ... This is why the OG's always give the same advice.",
  "created_utc": 1652287231,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In my 6 years of being in this rollercoaster i have seen countless of people lose their money taking too much risk and getting caught in scams, ponzi&amp;#39;s, rugpulls, lies, traps, ... you name it.&lt;/p&gt;\n\n&lt;p&gt;Especially new people always get pulled in to these things and they believe all the smart words they get thrown at them. They get offered &amp;#39;amazing&amp;#39; oppurtunities and fall for it.&lt;/p&gt;\n\n&lt;p&gt;Founders &amp;amp; influencers putting out wonderful video&amp;#39;s and tweets filled with smart words and lies are dangerous, be carefull, be sceptical, there is a reason most developers and users are in only a couple of places.&lt;/p&gt;\n\n&lt;p&gt;This is why all the OG&amp;#39;s say &amp;quot;just invest in BTC/ETH&amp;quot; and ride the waves, you don&amp;#39;t have to worry about losing all of your money. Think long term, invest what u can/DCA, and you will be a happy person in the future.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 354,
  "permalink": "/r/CryptoCurrency/comments/un5fvb/im_sorry_for_all_the_people_that_lost_their_life/",
  "subreddit": "CryptoCurrency",
  "id": "un5fvb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In my 6 years of being in this rollercoaster i have seen countless of people\nlose their money taking too much risk and getting caught in scams, ponzi's,\nrugpulls, lies, traps, ... you name it.\n\nEspecially new people always get pulled in to these things and they believe all\nthe smart words they get…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この6年間、私は数え切れないほどの人々がこのジェットコースターに乗っているのを見てきました。\n数え切れないほどの人々が、リスクを取りすぎて、詐欺やポンジーの罠にかかり、お金を失うのを見てきました。\n詐欺、ねずみ講、嘘、罠、......何でもござれだ。\n\n特に新参者は、いつもこうしたものに引き込まれ、巧みな言葉をすべて信じてしまう。\n特に新参者は、こうしたものに引き込まれ、うまい話を信じてしまう...。",
      "title": "貯金をなくした人たち、またまたご愁傷様です! ... これだからOGはいつも同じようなアドバイスをするんだよ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我从事这个过山车的6年中，我看到了无数的人\n失去了他们的钱，承担了太多的风险，陷入了骗局，庞氏骗局。\n骗局、庞氏骗局、谎言、陷阱......你能想到的都有。\n\n尤其是新人们总是被拉进这些事情中，他们相信所有的\n他们相信所有他们得到的聪明话...",
      "title": "我为所有失去一生积蓄的人感到遗憾，再次！我为他们感到遗憾。... 这就是为什么OG的人总是给出同样的建议。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我從事這個過山車的6年中，我看到了無數的人\n失去了他們的錢，承擔了太多的風險，陷入了騙局，龐氏騙局。\n騙局、龐氏騙局、謊言、陷阱......你能想到的都有。\n\n尤其是新人們總是被拉進這些事情中，他們相信所有的\n他們相信所有他們得到的聰明話...",
      "title": "我爲所有失去一生積蓄的人感到遺憾，再次！我爲他們感到遺憾。... 這就是爲什麼OG的人總是給出同樣的建議。"
    }
  ]
}