{
  "author": "JorisR94",
  "the_new_excerpt": "A lot of people check the charts every 15 minutes. I used to be that guy too.\nEven though I knew that a small 20 minute pump or dip doesn't mean shit\nlong-term, I kept on checking charts like a maniac. If anything, checking charts\ntoo often makes you nervous, and you risk of letting your emotions…",
  "original_created_utc": 1622729559,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人が15分ごとにチャートをチェックしています。私も以前はそのような人でした。\n20分程度の小さなパンプやディップは、長期的には何の意味もないことがわかっていても\n長期的に見てもチャートのチェックはマニアックに続けていました。むしろ、チャートをチェックしすぎると\nむしろ、チャートをチェックしすぎると神経質になり、感情に流されてしまう危険性があります。",
      "title": "PSA: HODLに最適な方法は、忙しいことです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很多人每隔15分钟就查看一次图表。我曾经也是这样的人。\n尽管我知道20分钟的小幅上涨或下跌并不意味着什么\n长期以来，我一直像个疯子一样检查图表。如果有的话，检查图表\n太频繁会让你紧张，而且你有可能让你的情绪...",
      "title": "PSA: 忙于工作的最佳方式是HODL"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多人每隔15分鐘就查看一次圖表。我曾經也是這樣的人。\n儘管我知道20分鐘的小幅上漲或下跌並不意味着什麼\n長期以來，我一直像個瘋子一樣檢查圖表。如果有的話，檢查圖表\n太頻繁會讓你緊張，而且你有可能讓你的情緒...",
      "title": "PSA: 忙於工作的最佳方式是HODL"
    }
  ],
  "title": "PSA: Best way to HODL is by being busy",
  "created_utc": 1622755927,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A lot of people check the charts every 15 minutes. I used to be that guy too. Even though I knew that a small 20 minute pump or dip doesn&#39;t mean shit long-term, I kept on checking charts like a maniac. If anything, checking charts too often makes you nervous, and you risk of letting your emotions get the best of you.</p>\n\n<p>So one day a few week ago, on a moment where I was checking the charts way too often again, I decided to go on a run. Literally forced myself not to check charts.</p>\n\n<p>That&#39;s been a few weeks ago and I&#39;ve been enjoying going on running more often. I headed over to <a href=\"/r/running\">r/running</a>, did some research on how to improve, and now I go on 3-4 runs per week. In addition to that, I&#39;ve picked up lifting weights. Every day I either run or lift weights, on an empty moment where I&#39;d otherwise be checking charts. </p>\n\n<p>I&#39;ve found myself checking charts way less ever since, and I&#39;ve got a new healthy hobby. I don&#39;t care what it is for you. It could be gaming, it could be cooking. Or maybe you like gardening. Get busy, you&#39;ll literally forget about these charts.</p>\n</div><!-- SC_ON -->",
  "score": 290,
  "permalink": "/r/CryptoCurrency/comments/nreh3v/psa_best_way_to_hodl_is_by_being_busy/",
  "subreddit": "CryptoCurrency",
  "id": "nreh3v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404881312
}