{
  "author": "Spreizbacken",
  "original_created_utc": 1635586619,
  "title": "Very soon I will be able to pay my parent's house mortgage with my portfolio.",
  "created_utc": 1635598036,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was not born in a rich family, my parents had to struggle to make ends meet.<br/>\nNevertheless I was never hungry and always had clean clothes to wear. They sent me to school, than they paid for my university expenses and I am debt free, however they aren&#39;t.<br/>\nI am a young man in his late twenties and I&#39;ve been in crypto for 3 years.<br/>\nI&#39;ve calculated, that when ETH hits $4723 I will have just enough to pay out their mortgage completely, making them debt free.</p>\n\n<p>I am recently engaged and I could use the money to buy myself and my fiancee something nice but this is the only way I could think of to repay my parents for all they&#39;ve done for me.<br/>\nAfter doing so, my portfolio would be worth exactly $0 and im fine with it.<br/>\nOver the past 3 years I&#39;ve learned so much that I am sure I will be able to save up some money over the next year to invest in the bear market. I could wait a bit more for ETH to be worth more than $5k or so and get a better start next cycle, but I am not taking any more chances here, even if I miss out on some more potential gains.</p>\n\n<p>My parents don&#39;t really know about my crypto investments.<br/>\nI tried to explain it to them when I started but it didn&#39;t go well. Them being mostly on the struggling side of things financially they were not okay with any form of &#39;&#39;gambling&#39;&#39; (as they saw it back than), so now, paying out their debt with money from this bitcoin scheme would be a hell of on emotional shock.<br/>\nWish me luck!</p>\n</div><!-- SC_ON -->",
  "score": 217,
  "permalink": "/r/CryptoCurrency/comments/qiy1mh/very_soon_i_will_be_able_to_pay_my_parents_house/",
  "subreddit": "CryptoCurrency",
  "id": "qiy1mh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was not born in a rich family, my parents had to struggle to make ends meet.\nNevertheless I was never hungry and always had clean clothes to wear. They sent\nme to school, than they paid for my university expenses and I am debt free,\nhowever they aren't.\nI am a young man in his late twenties and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はお金持ちの家に生まれたわけではなく、両親は生活のために苦労していました。\nそれでも、私はお腹をすかしたことがなく、いつもきれいな服を着ていました。両親は私を学校に通わせ\n学校にも行かせてくれたし、大学の学費も出してくれたので、私は無借金です。\nしかし、両親はそうではありませんでした。\n私は20代後半の若い男性ですが、...",
      "title": "近いうちに、私のポートフォリオで親の家のローンを払えるようになります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是出生在一个富裕的家庭，我的父母不得不为生计而挣扎。\n尽管如此，我从未挨过饿，而且总是有干净的衣服穿。他们送我去学校\n我去上学，他们支付了我的大学费用，我现在没有债务。\n然而，他们并没有。\n我是一个二十多岁的年轻人，...",
      "title": "很快，我就能用我的投资组合支付我父母的房屋抵押贷款。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是出生在一個富裕的家庭，我的父母不得不爲生計而掙扎。\n儘管如此，我從未捱過餓，而且總是有乾淨的衣服穿。他們送我去學校\n我去上學，他們支付了我的大學費用，我現在沒有債務。\n然而，他們並沒有。\n我是一個二十多歲的年輕人，...",
      "title": "很快，我就能用我的投資組合支付我父母的房屋抵押貸款。"
    }
  ]
}