{
  "author": "BradlyL",
  "the_new_excerpt": "I have a ton of friends (many who I warned about investing in DOGE), messaging\nme today with a narrative that Elon Musk somehow did \"something wrong\", here. By\npouring fuel on the DOGE fire, and sitting on the sidelines, all while making a\nmove on BTC...\n\n\nTHIS IS HOW WHALES INVEST!\n\nIf you were…",
  "original_created_utc": 1612792506,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我有一大堆朋友（很多人我都警告过他们要投资DOGE），留言\n我今天用一种说法，说埃隆-马斯克不知为何做了 \"错事\"，在这里。由\n在DOGE的火上浇油，坐视不理，同时还做了一个。\n移动BTC...\n\n\n这就是鲸鱼的投资方式!\n\n如果你是...",
      "title": "$TSLA购买15亿美元BTC，是马斯克 \"跟着我做，而不是跟着我说 \"的经典案例，也是鲸鱼投资策略的大师级......"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一大堆朋友（很多人我都警告過他們要投資DOGE），留言\n我今天用一種說法，說埃隆-馬斯克不知爲何做了 \"錯事\"，在這裏。由\n在DOGE的火上澆油，坐視不理，同時還做了一個。\n移動BTC...\n\n\n這就是鯨魚的投資方式!\n\n如果你是...",
      "title": "$TSLA購買15億美元BTC，是馬斯克 \"跟着我做，而不是跟着我說 \"的經典案例，也是鯨魚投資策略的大師級......"
    }
  ],
  "title": "The $TSLA purchase of $1.5 Billion in BTC is a classic case of \"Follow what I do, not what I say\" by Musk, and a masterclass in whale investment strategy...",
  "created_utc": 1612816914,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have a ton of friends <em>(many who I warned about investing in DOGE)</em>, messaging me today with a narrative that Elon Musk somehow did <em>&quot;something wrong&quot;</em>, here. By pouring fuel on the DOGE fire, and sitting on the sidelines, all while making a move on BTC...</p>\n\n<h1>THIS IS HOW WHALES INVEST!</h1>\n\n<p>If you were going to be investing ~2% of your entire net worth on an asset, would you be pumping it up to the sky? Of course not...it&#39;s quite literally where the idea of <strong>FUD (fear, uncertainty, doubt)</strong> comes from. And the strategy of diverting attention away from your investment, to help ensure a lower entry point.</p>\n\n<p>A reminder that <strong>Elon is not new to the crypto space</strong>. He even gained his original wealth from Quick-2-Pay (now PayPal), and has been intimately tied into the digital payment community for FAR LONGER than most realize...which, translates to him fully knowing and understanding that DOGE was NOTHING MORE than a meme. Subsequently, also allowing him to recognize the value in BTC as a store/transfer of value....oh yeah, and he hates big gov., SEC, FTC, and basically all the other entities trying to slow him down.</p>\n\n<p>Investors for years have followed this tactic, which is why the saying <strong><em>&quot;Follow what I do, not what I say&quot;</em></strong> is so commonly regurgitated in investment circles. In the case of DOGE as a distraction, while Musk and $TSLA quietly accumulate their $1.5 Billion holdings in BTC, there is no difference.</p>\n</div><!-- SC_ON -->",
  "score": 367,
  "permalink": "/r/CryptoCurrency/comments/lfc9ah/the_tsla_purchase_of_15_billion_in_btc_is_a/",
  "subreddit": "CryptoCurrency",
  "id": "lfc9ah",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123195589
}