{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "A young teenager contacted me on Reddit, asking me to tell him how he can predict stocks. He asked a person who, after 2 years, still cannot understand how the stock market works, not to mention predicting, but what I realized is, if I ignore his question, he will ask someone else, and I think I am a tiny bit wiser than others who wouldn't mind selling their future for gambling on the stock market. After long typing I realized that it would make sense to post my thoughts here, perhaps someone else might want to read it.  \n\n\nI ended up writing 12 points, even though I didn't plan to write more than 4. Why did I name this post this way? Well if I named it '*12 Rules for Success on the Stock Market*' I would trick many people, since I am not successful at first place, plus the whole idea about this post is to help people be wiser and avoid losing their investments. Once they figure this out, then they can also make profits. If you focus on profits from the very start you might end up having nothing. Plus if I knew how to be successful I wouldn't be here, would I? So here's what I learned in the last 2 years.   \n\n\n**FYI: I learned all of that by making mistakes, so this is just my experience and you shouldn't use it as a guide or the ultimate truth!**  \n\n\n1. **Get to know the company and try to understand the principles as much as you can.**  \nWhat is their goal? What are their promises? What promises have they kept in the past? What is their vision and when should it become reality? How much money do they have in cash? And so on. If everything sounds great or promising then there's SOME hope. \n2. **Go to their website and read their quarterly reports as well as other documentation.**  \nThis will give you a better insight on whether the company is healthy or not. It is obviously not enough but still better than nothing. \n3. **Check if they are hiring.**  \nOften on their websites they might have open positions - if you see a small company like ABGD (Alpha Beta Gamma Delta Inc.) with big promises but you don't know if it's true or not, then you can go to their website and check if they have open positions. In this case with the fake company ABGD, they have a lot of open positions which MIGHT mean that they have the money to pay them, they plan to go big and that's all a SMALL sign that people are working behind it. It is not enough, but if there are 5 open positions in a team of a 100, but everybody is talking about it, then stay away from this hype.\n4. **Read the news.**   \nKeep yourself up to date. Yahoo Finance is a great platform to show you the news from different sources. You don't need to read every single one of them but you need to know what is going on. Don't sit and wonder why your stock is 80% down in the last month.\n5. **Don't buy/sell depending on the news.**   \nOften the media tries to scare or encourage people to do something, one article is not enough to convince you that everything is great. Take your time and don't trust everything you read. Many will get scared sometimes for no reason but remember why you are there. Sometimes it is good to go against the crowd. \n6. **Don't invest in too many companies.**  \nIt might be good to have a diversity in your portfolio because then if one goes down the others will support your finances, but that is often silly because you cannot keep yourself up to date with 30-50 companies, therefore you cannot control your money. But if you have a portfolio of 3-5-10 companies then you have a better control over your investments because you know what's going on and you will know if one day the company goes shit and it's time to pull.\n7. **Don't think short-term - always look at things long-term.**   \nLike 2-5 years. Maybe more sometimes, not 2-5 months from now. Don't be short-sighted unless you want some quick profits. Companies can't grow massively in just half a year, but a stock could. If you are focused on quick profits, then you have to look for a hype, not values or mission. \n8. **Never punish yourself for making a mistake in the past.**   \nYou should learn from the past but you live in the present so if you lose money that doesn't mean you should gamble now to return your loses. You will lose even more this way. Always be patient and learn from your mistakes. Even the richest had to fail many times in order for them to succeed.\n9. **Invest what you can afford to lose.**  \nI know everyone says that but some people really don't know this. If you have $1000 but you think you might need them in a few months then don't invest them. If you think that you only need $500 and you can live perfectly fine with $500 less then invest $500. If you lose them one day then you won't have to stress yourself about it. But if you win, then it'll feel like you have a bunch of apple trees in your garden. FREE FRUITS! Unlike apples, money don't grow on trees but they grow on the stock market. Money kept under your mattress will have the same worth as the mattress one day. \n10. **Take some profits out!!!**  \nDon't make the mistakes that I did where you triple your income in few months and then you let your money there thinking that it will be like that forever! You need to take some profits out. The stocks will always go down, some will go bust, but having some money out will give you the chance to invest more or invest in something new. If you wait until you have 10 or 100x gains, you might quickly end up with a lot less than what you had at the peak, or go minus. Being in minus is fine as long as you remember that you're there long-term and the company will grow again, but having your money stuck there for 2-3 years when you know you could've made even bigger investments if you took the profits out, will only prevent you from getting rich.\n11. **If you don't know much about stocks and what the companies do and you are very emotional person, then invest in ETFs**.   \nThe growth there is small, but it is a great way to preserve your wealth from being eaten by the inflation, plus if you keep investing every month a bit, after 10-20 years this small growth of 1-5% a year, could become 30-50% a year. This should be your retirement money, but if you want to have a house in 10 years from now then ETFs are not gonna be for you.\n12. **Any small profit is a profit.**   \nMost amateur investors lose their money. If you manage to not lose your money and one day leave even with 10% more, you still did well and better than most, so don't hate yourself for missed opportunities. There will be more chances. \n13. **Don't listen to any Redditor online, including me.**   \nAs you can see I am not that competent in what I do because I said there will be 12 Rules, but instead there are 13. We are all here to grow and get rich, but if we knew the secrets, insights, hidden knowledge, and made a great fortune and have a great life etc, then probably we wouldn't sit here trying to inform ourselves and look for the next big thing. The successful people here are a very small percentage. Most of the people are here to fix their mistakes, become better at what they do, and so on. You'll get so many bad pieces of advice and people might trick you into believing in something that is a complete BS, so **if you want to avoid mistakes caused by someone else, then simply listen to no one**. Learn from them, learn from their mistakes and successes but ALWAYS decide what is the best for you! Don't let others do that for you. I hope this will help you to become successful and remember, don't listen to me.   \n\n\nGood luck!",
  "author_fullname": "t2_4nvatocu",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "12 Rules for Avoiding Misery",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "advice",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_st08u3",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.77,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 132,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": "",
  "secure_media_embed": {},
  "link_flair_text": "Advice",
  "can_mod_post": false,
  "score": 132,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1644932165,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1644922066,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A young teenager contacted me on Reddit, asking me to tell him how he can predict stocks. He asked a person who, after 2 years, still cannot understand how the stock market works, not to mention predicting, but what I realized is, if I ignore his question, he will ask someone else, and I think I am a tiny bit wiser than others who wouldn&amp;#39;t mind selling their future for gambling on the stock market. After long typing I realized that it would make sense to post my thoughts here, perhaps someone else might want to read it.  &lt;/p&gt;\n\n&lt;p&gt;I ended up writing 12 points, even though I didn&amp;#39;t plan to write more than 4. Why did I name this post this way? Well if I named it &amp;#39;&lt;em&gt;12 Rules for Success on the Stock Market&lt;/em&gt;&amp;#39; I would trick many people, since I am not successful at first place, plus the whole idea about this post is to help people be wiser and avoid losing their investments. Once they figure this out, then they can also make profits. If you focus on profits from the very start you might end up having nothing. Plus if I knew how to be successful I wouldn&amp;#39;t be here, would I? So here&amp;#39;s what I learned in the last 2 years.   &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;FYI: I learned all of that by making mistakes, so this is just my experience and you shouldn&amp;#39;t use it as a guide or the ultimate truth!&lt;/strong&gt;  &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;Get to know the company and try to understand the principles as much as you can.&lt;/strong&gt;&lt;br/&gt;\nWhat is their goal? What are their promises? What promises have they kept in the past? What is their vision and when should it become reality? How much money do they have in cash? And so on. If everything sounds great or promising then there&amp;#39;s SOME hope. &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Go to their website and read their quarterly reports as well as other documentation.&lt;/strong&gt;&lt;br/&gt;\nThis will give you a better insight on whether the company is healthy or not. It is obviously not enough but still better than nothing. &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Check if they are hiring.&lt;/strong&gt;&lt;br/&gt;\nOften on their websites they might have open positions - if you see a small company like ABGD (Alpha Beta Gamma Delta Inc.) with big promises but you don&amp;#39;t know if it&amp;#39;s true or not, then you can go to their website and check if they have open positions. In this case with the fake company ABGD, they have a lot of open positions which MIGHT mean that they have the money to pay them, they plan to go big and that&amp;#39;s all a SMALL sign that people are working behind it. It is not enough, but if there are 5 open positions in a team of a 100, but everybody is talking about it, then stay away from this hype.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Read the news.&lt;/strong&gt;&lt;br/&gt;\nKeep yourself up to date. Yahoo Finance is a great platform to show you the news from different sources. You don&amp;#39;t need to read every single one of them but you need to know what is going on. Don&amp;#39;t sit and wonder why your stock is 80% down in the last month.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Don&amp;#39;t buy/sell depending on the news.&lt;/strong&gt;&lt;br/&gt;\nOften the media tries to scare or encourage people to do something, one article is not enough to convince you that everything is great. Take your time and don&amp;#39;t trust everything you read. Many will get scared sometimes for no reason but remember why you are there. Sometimes it is good to go against the crowd. &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Don&amp;#39;t invest in too many companies.&lt;/strong&gt;&lt;br/&gt;\nIt might be good to have a diversity in your portfolio because then if one goes down the others will support your finances, but that is often silly because you cannot keep yourself up to date with 30-50 companies, therefore you cannot control your money. But if you have a portfolio of 3-5-10 companies then you have a better control over your investments because you know what&amp;#39;s going on and you will know if one day the company goes shit and it&amp;#39;s time to pull.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Don&amp;#39;t think short-term - always look at things long-term.&lt;/strong&gt;&lt;br/&gt;\nLike 2-5 years. Maybe more sometimes, not 2-5 months from now. Don&amp;#39;t be short-sighted unless you want some quick profits. Companies can&amp;#39;t grow massively in just half a year, but a stock could. If you are focused on quick profits, then you have to look for a hype, not values or mission. &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Never punish yourself for making a mistake in the past.&lt;/strong&gt;&lt;br/&gt;\nYou should learn from the past but you live in the present so if you lose money that doesn&amp;#39;t mean you should gamble now to return your loses. You will lose even more this way. Always be patient and learn from your mistakes. Even the richest had to fail many times in order for them to succeed.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Invest what you can afford to lose.&lt;/strong&gt;&lt;br/&gt;\nI know everyone says that but some people really don&amp;#39;t know this. If you have $1000 but you think you might need them in a few months then don&amp;#39;t invest them. If you think that you only need $500 and you can live perfectly fine with $500 less then invest $500. If you lose them one day then you won&amp;#39;t have to stress yourself about it. But if you win, then it&amp;#39;ll feel like you have a bunch of apple trees in your garden. FREE FRUITS! Unlike apples, money don&amp;#39;t grow on trees but they grow on the stock market. Money kept under your mattress will have the same worth as the mattress one day. &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Take some profits out!!!&lt;/strong&gt;&lt;br/&gt;\nDon&amp;#39;t make the mistakes that I did where you triple your income in few months and then you let your money there thinking that it will be like that forever! You need to take some profits out. The stocks will always go down, some will go bust, but having some money out will give you the chance to invest more or invest in something new. If you wait until you have 10 or 100x gains, you might quickly end up with a lot less than what you had at the peak, or go minus. Being in minus is fine as long as you remember that you&amp;#39;re there long-term and the company will grow again, but having your money stuck there for 2-3 years when you know you could&amp;#39;ve made even bigger investments if you took the profits out, will only prevent you from getting rich.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;If you don&amp;#39;t know much about stocks and what the companies do and you are very emotional person, then invest in ETFs&lt;/strong&gt;.&lt;br/&gt;\nThe growth there is small, but it is a great way to preserve your wealth from being eaten by the inflation, plus if you keep investing every month a bit, after 10-20 years this small growth of 1-5% a year, could become 30-50% a year. This should be your retirement money, but if you want to have a house in 10 years from now then ETFs are not gonna be for you.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Any small profit is a profit.&lt;/strong&gt;&lt;br/&gt;\nMost amateur investors lose their money. If you manage to not lose your money and one day leave even with 10% more, you still did well and better than most, so don&amp;#39;t hate yourself for missed opportunities. There will be more chances. &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Don&amp;#39;t listen to any Redditor online, including me.&lt;/strong&gt;&lt;br/&gt;\nAs you can see I am not that competent in what I do because I said there will be 12 Rules, but instead there are 13. We are all here to grow and get rich, but if we knew the secrets, insights, hidden knowledge, and made a great fortune and have a great life etc, then probably we wouldn&amp;#39;t sit here trying to inform ourselves and look for the next big thing. The successful people here are a very small percentage. Most of the people are here to fix their mistakes, become better at what they do, and so on. You&amp;#39;ll get so many bad pieces of advice and people might trick you into believing in something that is a complete BS, so &lt;strong&gt;if you want to avoid mistakes caused by someone else, then simply listen to no one&lt;/strong&gt;. Learn from them, learn from their mistakes and successes but ALWAYS decide what is the best for you! Don&amp;#39;t let others do that for you. I hope this will help you to become successful and remember, don&amp;#39;t listen to me.&lt;br/&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Good luck!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "823be0a6-65e6-11e5-9784-125ee764bc01",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "call_to_action": "",
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#646d73",
  "id": "st08u3",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "rotloch",
  "discussion_type": null,
  "num_comments": 33,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/st08u3/12_rules_for_avoiding_misery/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/st08u3/12_rules_for_avoiding_misery/",
  "subreddit_subscribers": 3649605,
  "created_utc": 1644942523,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1644922066,
  "the_new_excerpt": "A young teenager contacted me on Reddit, asking me to tell him how he can\npredict stocks. He asked a person who, after 2 years, still cannot understand\nhow the stock market works, not to mention predicting, but what I realized is,\nif I ignore his question, he will ask someone else, and I think I am…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ある10代の若者が、Redditで私に「どうすればいいか教えてほしい」と連絡してきました。\n株を予想する。彼は、2年経っても理解できない人に尋ねました。\n予測するまでもなく、株式市場がどのように動くのか、しかし、私が気づいたのは\n彼の質問を無視すれば、彼は他の人に質問するでしょうし、私は...",
      "title": "不幸を避けるための12のルール"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一个年轻的少年在Reddit上联系我，要求我告诉他如何能够\n预测股票。他问一个在两年后仍然不能理解的人\n他问的是一个在两年后仍然不能理解股票市场如何运作的人，更不用说预测了，但我意识到的是。\n如果我不理会他的问题，他就会去问别人，而我认为我...",
      "title": "避免痛苦的12条规则"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一個年輕的少年在Reddit上聯繫我，要求我告訴他如何能夠\n預測股票。他問一個在兩年後仍然不能理解的人\n他問的是一個在兩年後仍然不能理解股票市場如何運作的人，更不用說預測了，但我意識到的是。\n如果我不理會他的問題，他就會去問別人，而我認爲我...",
      "title": "避免痛苦的12條規則"
    }
  ],
  "source_updated_at": 1645177237269
}