{
  "author": "Diatery",
  "original_created_utc": 1633835754,
  "title": "El Salvador made 4 million dollars on the Bitcoin pump and is splurging a part of it for a high-end animal hospital called Chivo Pets, and there's even a 3D tour",
  "created_utc": 1633851044,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m following the self-proclaimed coolest dictator in the world on Twitter and man, so many mixed feelings on this one. But first let me get to the news:</p>\n\n<p>A few hours ago he tweeted that he had a surprise for everyone, and went on to explain that the financial incentives program from Bitcoin is currently measured in dollars, and that schedule has a surplus of 4 million dollars in the green at the moment, and those proceeds are going to be used for ... kittens. No seriously, they&#39;re building a luxurious looking veterinarian hospital.  There&#39;s even a 3D render of the thing and a long list of specifications of &quot;Chivo Pets&quot; aka like Chivo Wallet, which is slang for hip/cool.  Cool Pets Animal Hospital, basically. (It&#39;s unclear if that&#39;s just a placeholder name, but I wouldn&#39;t be surprised*)</p>\n\n<p>Here&#39;s the thread play-by-play translated:</p>\n\n<blockquote>\n<p><em>Presidente:   I have a surprise for you!  (my nerves!)</em>  </p>\n\n<p><em>Here we go:</em>  </p>\n\n<p><em>The financial trust &quot;FideBitcoin&quot; is set up in US dollars and must settle with the bank of El Salvador in dollars, as per the statutes.</em>  </p>\n\n<p><em>But there&#39;s an accounting discrepancy, and the trust fund is now worth more than what&#39;s on the static USD ledger, meaning there&#39;s a surplus of 4 million dollars due to the rise in price of Bitcoin</em>  </p>\n\n<p><em>Therefor we can spend/dispose the 4 million without affecting the trust\\</em>*.*  </p>\n\n<p><em>So we decided to invest a part of that money in this: A VETERINARY HOSPITAL for all our furry friends. Which will include:</em>   </p>\n\n<p><em>12 basic clinics</em><br/>\n<em>4 Emergency clinics</em><br/>\n<em>4 Operating rooms</em><br/>\n<em>Rehabilitation area</em><br/>\n<em>Isolation Wing for Hospitalizations, Recovery</em><br/>\n<em>Hairdresser (lol)</em><br/>\n<em>7 offices</em><br/>\n<em>14 co-work offices</em><br/>\n<em>Lab</em><br/>\n<em>2 classrooms</em><br/>\n<em>An auditorium</em><br/>\n<em>xray labs</em><br/>\n<em>Which can attend to 384 visits a day, 128 emergency visits, 64 surgeries, 63 hospitalizations, 64 hair cuts (dude), 128 rehabs, 32 xrays, everyday.</em></p>\n</blockquote>\n\n<p>You can guess how this went.  </p>\n\n<p>There&#39;s quite a bit of negative comments about how of all the things the country needs, this is not really one of those items in high demand, and some sarcasm about how it will be useful to tame some hairy people on the streets. The comments are gold.</p>\n\n<p>To el Presidente&#39;s defense, he did say &quot;in part&quot;, not the full amount. The fact that there was a 3D render of the place seems like this was a proposal that was on hold for a long time and just happened to catch his fancy.</p>\n\n<p>*Clearly, this is a bit of propaganda aimed at young people.  It&#39;s also great to see that much money flow into existence by doing nothing but holding an appreciating asset that&#39;s globally in demand. </p>\n\n<p>**I think he means selling some BTC here, but it wasn&#39;t specified.  If he didn&#39;t, the giant leap of faith here by El Presidente is that Bitcoin will continue to go higher and never dip down, unless he&#39;s cashing out all his BTC right now and taking all profits.  Otherwise this is going to be underwater by Tuesday if things turn bearish. But Bitcoin only goes up, right?  </p>\n\n<p>A cooler surprise would be to provide universal income through Chivo from the mining of Bitcoin from those volcanoes while it lasts, setting a precedent that natural resources in a country could be passively farmed (perhaps more split locally so allocation wouldn&#39;t be insignificant), setting an example for places that have bountiful clean energy available to them (big dams, solar farms).</p>\n\n<p>Anyway, this whole thing is playing out like an unrealistic video game plotline in something like Civilization or Far Cry, but it&#39;s real life. It&#39;s quite surreal to watch! </p>\n\n<p>Source: <a href=\"https://nitter.net/nayibbukele/status/1446936617575387140#m\">https://nitter.net/nayibbukele/status/1446936617575387140#m</a></p>\n</div><!-- SC_ON -->",
  "score": 164,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/DDTDh20N4aAFQu0dDsYyq5WgXj_a_XaPTPv0sdpDwIs.jpg?auto=webp&s=877def27bfc5fabfe642b5451eed204cd83f1380",
          "width": 500,
          "height": 500
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/DDTDh20N4aAFQu0dDsYyq5WgXj_a_XaPTPv0sdpDwIs.jpg?width=108&crop=smart&auto=webp&s=0a6305391cd99abf1d4b04204e0c0185b47dbaab",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/DDTDh20N4aAFQu0dDsYyq5WgXj_a_XaPTPv0sdpDwIs.jpg?width=216&crop=smart&auto=webp&s=9963fab1f5e17fe95bc74a8fcc6995622ece4d80",
            "width": 216,
            "height": 216
          },
          {
            "url": "https://external-preview.redd.it/DDTDh20N4aAFQu0dDsYyq5WgXj_a_XaPTPv0sdpDwIs.jpg?width=320&crop=smart&auto=webp&s=965c0d927956df05abe07e3aee2fed973e769335",
            "width": 320,
            "height": 320
          }
        ],
        "variants": {},
        "id": "WqxyYYLS2On0nHmquY_KhzJuXP3NwjKAw4CLW1iMg_o"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/q501ea/el_salvador_made_4_million_dollars_on_the_bitcoin/",
  "subreddit": "CryptoCurrency",
  "id": "q501ea",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm following the self-proclaimed coolest dictator in the world on Twitter and\nman, so many mixed feelings on this one. But first let me get to the news:\n\nA few hours ago he tweeted that he had a surprise for everyone, and went on to\nexplain that the financial incentives program from Bitcoin is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自称、世界で最もクールな独裁者のツイッターをフォローしていますが\nこの件に関しては、とても複雑な気持ちです。でも、まずはニュースを見てみましょう。\n\n数時間前、彼はみんなにサプライズがあるとツイートしました。\nビットコインからの金融優遇プログラムが...」と説明しました。",
      "title": "エルサルバドルはビットコインポンプで400万ドルを稼ぎ、その一部を「Chivo Pets」という高級動物病院のために散財しており、3Dツアーも用意されている"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在推特上关注这位自称是世界上最酷的独裁者。\n伙计，在这个问题上有很多不同的感受。但首先让我说说这个消息。\n\n几个小时前，他在推特上说他给大家带来了一个惊喜，并接着说\n解释说，比特币的金融激励计划是...",
      "title": "萨尔瓦多在比特币泵上赚了400万美元，并将其中的一部分用于建设一个名为Chivo Pets的高端动物医院，甚至还有一个3D旅游。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在推特上關注這位自稱是世界上最酷的獨裁者。\n夥計，在這個問題上有很多不同的感受。但首先讓我說說這個消息。\n\n幾個小時前，他在推特上說他給大家帶來了一個驚喜，並接着說\n解釋說，比特幣的金融激勵計劃是...",
      "title": "薩爾瓦多在比特幣泵上賺了400萬美元，並將其中的一部分用於建設一個名爲Chivo Pets的高端動物醫院，甚至還有一個3D旅遊。"
    }
  ]
}