{
  "author": "PZinger6",
  "the_new_excerpt": "https://www.cnbc.com/2021/02/17/blackrock-has-started-to-dabble-in-bitcoin-says-rick-rieder.html\n\nBlackRock’s Rick Rieder told CNBC on Wednesday the world’s largest asset manager\nhas begun entering the bitcoin space.\n\nThe remarks from Rieder, who is BlackRock’s chief investment officer of…",
  "original_created_utc": 1613590487,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.cnbc.com/2021/02/17/blackrock-has-started-to-dabble-in-bitcoin-says-rick-rieder.html\n\nBlackRock的Rick Rieder周三对CNBC表示，全球最大的资产管理公司。\n已经开始进入比特币领域。\n\nRieder的这番话，是黑石集团首席投资官的...",
      "title": "全球最大的基金管理公司BlackRock开始 \"涉足 \"比特币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.cnbc.com/2021/02/17/blackrock-has-started-to-dabble-in-bitcoin-says-rick-rieder.html\n\nBlackRock的Rick Rieder週三對CNBC表示，全球最大的資產管理公司。\n已經開始進入比特幣領域。\n\nRieder的這番話，是黑石集團首席投資官的...",
      "title": "全球最大的基金管理公司BlackRock開始 \"涉足 \"比特幣。"
    }
  ],
  "title": "BlackRock, the world's largest money manager, is starting to \"dabble\" in Bitcoin",
  "created_utc": 1613593483,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.cnbc.com/2021/02/17/blackrock-has-started-to-dabble-in-bitcoin-says-rick-rieder.html\">https://www.cnbc.com/2021/02/17/blackrock-has-started-to-dabble-in-bitcoin-says-rick-rieder.html</a></p>\n\n<p>BlackRock’s Rick Rieder told CNBC on Wednesday the world’s largest asset manager has begun entering the bitcoin space.</p>\n\n<p>The remarks from Rieder, who is BlackRock’s chief investment officer of global fixed income, came on the same day bitcoin broke above $51,000 for the first time.</p>\n\n<p>“Today the volatility of it is extraordinary, but listen, people are looking for storehouses of value,” Rieder said on “Squawk Box.” “People are looking for places that could appreciate under the assumption that inflation moves higher and that debts are building, so we’ve started to dabble a bit into it.”</p>\n\n<p>In January, BlackRock added bitcoin futures as an potential investment for two of its funds, according to filings with the Securities and Exchange Commission. The funds are BlackRock Strategic Income Opportunities and BlackRock Global Allocation Fund.</p>\n\n<p>A number of other financial institutions, such as BNY Mellon and Mastercard, have made entrances into the crypto space in recent days. BNY Mellon, the nation’s oldest bank, will launch a digital assets unit later this year, while Mastercard intends to support certain cryptocurrencies on its formal network.</p>\n\n<p>Electric vehicle maker Tesla also announced last week it bought $1.5 billion worth of bitcoin using cash on its balance sheet and intends to begin accepting the digital coin as payment for its products.</p>\n\n<p>The price of bitcoin has risen more than 70% this year, adding to a major rally that began in the fall. “My sense is the technology has evolved and the regulation has evolved to the point where a number of people find it should be part of the portfolio, so that’s what’s driving the price up,” Rieder said.</p>\n\n<p>Despite bitcoin’s growing respectability as an asset class, Rieder said Wednesday that how much exposure an investor should have “depends on what the rest of your portfolio looks like.”</p>\n\n<p>“We’re holding a lot more cash than we’ve held historically,” he said. “It’s because duration doesn’t work, interest rates don’t work as a hedge and so diversifying into other assets makes some sense. Holding some portion of what you hold in cash in things like crypto seems to make some sense to me, but I wouldn’t espouse a certain allocation or target holding.”</p>\n</div><!-- SC_ON -->",
  "score": 3582,
  "permalink": "/r/investing/comments/lm2mry/blackrock_the_worlds_largest_money_manager_is/",
  "subreddit": "investing",
  "id": "lm2mry",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728622068
}