{
  "author": "meltedGrape96",
  "original_created_utc": 1627566834,
  "title": "What is Dostoyevsky saying about existentialism in Crime and Punishment?",
  "created_utc": 1627616435,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently overhead a friend of a relative give their take on Crime and Punishment and it has me really confused. They basically said that the book is about Raskolnikov exercising his freedom and trying to create his own meaning and values, rather than accepting what societal norms dictate, but this leads to suffering because he has some some &quot;essence&quot; that he cannot escape. And his freedom, both philosophically and literally, were what caused the catastrophe he found himself in and thus should not be emphasized. They also saw his article on crime as a parallel to Nietzsche&#39;s overman, and therefore the book as a criticism of Nietzsche.</p>\n\n<p>Unless I severely misunderstand existentialism, this sounds like a direct criticism of it. Of course this wouldn&#39;t make sense because Dostoyevsky himself was an existentialist. I suspect that either Dostoyevsky&#39;s brand of existentialism is much different from (my understanding of) Sartre&#39;s and Nietzsche&#39;s, or there is something specific about Raskolnikov that characterizes him not as an existentialist, but as a something like a nihilist, or maybe a person living inauthentically.</p>\n\n<p>Anyway, what is he actually saying, and how would you respond to the above take?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/otxx7o/what_is_dostoyevsky_saying_about_existentialism/",
  "subreddit": "askphilosophy",
  "id": "otxx7o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I recently overhead a friend of a relative give their take on Crime and\nPunishment and it has me really confused. They basically said that the book is\nabout Raskolnikov exercising his freedom and trying to create his own meaning\nand values, rather than accepting what societal norms dictate, but this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、親戚の友人が「罪と罰」についての見解を述べているのを見て、私はとても困惑しました。\nのことを話していて、とても混乱しました。彼らは基本的に、この本は\nRaskolnikovが自由を行使して、社会的な規範を受け入れるのではなく、自分自身の意味や価値を作り出そうとしている、と。\nこの本は、ラスコーリニコフが自由を行使して、社会的な規範を受け入れるのではなく、自分自身の意味や価値観を作り出そうとしていると言っていましたが、これは",
      "title": "ドストエフスキーは『罪と罰』の中で、実存主義についてどのようなことを言っているのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，我在一个亲戚的朋友的头顶上看到了他们对《罪与罚》的看法。\n惩罚》，这让我非常困惑。他们基本上说，这本书是\n拉斯柯尔尼科夫行使他的自由，试图创造他自己的意义和价值。\n和价值观，而不是接受社会规范的规定，但这...",
      "title": "陀思妥耶夫斯基在《罪与罚》中对存在主义的说法是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，我在一個親戚的朋友的頭頂上看到了他們對《罪與罰》的看法。\n懲罰》，這讓我非常困惑。他們基本上說，這本書是\n拉斯柯爾尼科夫行使他的自由，試圖創造他自己的意義和價值。\n和價值觀，而不是接受社會規範的規定，但這...",
      "title": "陀思妥耶夫斯基在《罪與罰》中對存在主義的說法是什麼？"
    }
  ]
}