{
  "author": "ljseminarist",
  "original_created_utc": 1649767655,
  "title": "Every gun should be treated as loaded. Which means, it isn’t obvious whether a gun is loaded or not. Why?",
  "created_utc": 1649781371,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Every time people discuss guns on reddit somebody will bring up this rule, and others tell stories about guns that seemed unloaded, with magazine removed, but still had a cartridge in the chamber, and somebody got killed or almost got killed. Which means gun design doesn’t make it obvious whether a gun is loaded or not. But why? This is a huge safety concern, both ways. With so many gun designs around, why hasn’t anyone tried to resolve this problem?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/u1ya98/every_gun_should_be_treated_as_loaded_which_means/",
  "subreddit": "NoStupidQuestions",
  "id": "u1ya98",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Every time people discuss guns on reddit somebody will bring up this rule, and\nothers tell stories about guns that seemed unloaded, with magazine removed, but\nstill had a cartridge in the chamber, and somebody got killed or almost got\nkilled. Which means gun design doesn’t make it obvious whether a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "redditで銃について議論するたびに、誰かがこのルールを持ち出すでしょう。\nマガジンを外して弾がないように見える銃の話をする人もいます。\nにはまだカートリッジが入っていて、誰かが殺されたり、殺されそうになったりした。\n殺される。つまり、銃の設計は、...を明白にするものではありません。",
      "title": "すべての銃は装填済みとして扱われるべきです。つまり、銃に弾が入っているかどうかは明らかではないのです。どうして？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每次人们在reddit上讨论枪支问题时，都会有人提出这个规则，并且\n还有人讲述枪支的故事，这些枪看起来没有子弹，弹夹也拿掉了，但枪膛里还有子弹。\n但枪膛里仍有子弹，有人被杀或几乎被杀。\n被杀。这意味着枪支的设计并不能让人清楚地了解是否有...",
      "title": "每支枪都应被视为上膛。这意味着，一把枪是否上膛并不明显。为什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每次人們在reddit上討論槍支問題時，都會有人提出這個規則，並且\n還有人講述槍支的故事，這些槍看起來沒有子彈，彈夾也拿掉了，但槍膛裏還有子彈。\n但槍膛裏仍有子彈，有人被殺或幾乎被殺。\n被殺。這意味着槍支的設計並不能讓人清楚地瞭解是否有...",
      "title": "每支槍都應被視爲上膛。這意味着，一把槍是否上膛並不明顯。爲什麼？"
    }
  ]
}