{
  "author": "MsTurner88",
  "original_created_utc": 1636124258,
  "title": "What's the deal with men refusing to wear condoms?",
  "created_utc": 1636133598,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>And not just young men who may or may not be particularly mature and therefore maybe somewhat excused.. But also men in their late 40s. I mean why?? Why don&#39;t they want to be protected against diseases and unwanted pregnancies?</p>\n\n<p>And additional question.. Why don&#39;t the women they hook up with talk about and insist on condoms? Lately I talked to a single man who hooks up with different women quite frequently and NONE (I mean none!) had this conversation or insisted he wore condoms.</p>\n\n<p>I don&#39;t get it - why??</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/qncxm0/whats_the_deal_with_men_refusing_to_wear_condoms/",
  "subreddit": "NoStupidQuestions",
  "id": "qncxm0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "And not just young men who may or may not be particularly mature and therefore\nmaybe somewhat excused.. But also men in their late 40s. I mean why?? Why don't\nthey want to be protected against diseases and unwanted pregnancies?\n\nAnd additional question.. Why don't the women they hook up with talk…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "若者だけではなく、特に成熟しているかどうかに関わらず、そのために多少の言い訳ができるかもしれません。\n許されるかもしれません。しかし、40代後半の男性もいます。つまり、なぜ？なぜ\n病気や望まない妊娠から守りたいと思うのでしょうか？\n\nさらに疑問なのは... なぜ彼らが付き合う女性たちは...",
      "title": "男性がコンドームの着用を拒否するのはどうしたものか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "而不仅仅是年轻人，他们可能或可能不是特别成熟，因此\n也许有点情有可原。但也包括40多岁的男人。我是说为什么？为什么不\n他们为什么不希望得到保护，防止疾病和意外怀孕？\n\n还有一个问题... 为什么他们勾搭的女人不谈...",
      "title": "男人拒绝戴避孕套是怎么回事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "而不僅僅是年輕人，他們可能或可能不是特別成熟，因此\n也許有點情有可原。但也包括40多歲的男人。我是說爲什麼？爲什麼不\n他們爲什麼不希望得到保護，防止疾病和意外懷孕？\n\n還有一個問題... 爲什麼他們勾搭的女人不談...",
      "title": "男人拒絕戴避孕套是怎麼回事？"
    }
  ]
}