{
  "author": "helsa233",
  "original_created_utc": 1639997960,
  "title": "Friends son is being sexually suggestive, what do I do?",
  "created_utc": 1640007964,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I recently moved back to my hometown and got back in contact with an old friend of mine who still lives there. We helped each other out a lot over the last year and they kind of became a second family for me. &lt;/p&gt;\n\n&lt;p&gt;She’s a single mom with two kids, the one of concern being 13. Over the past few months when I’ve visited he’s been more and more sexually suggestive towards me. I’m not sure if I’m overreacting or not. He checks me out A LOT and sometimes even makes faces. It’s definitely unnerving especially due to his age. Recently it even looked like he put something in his pants.&lt;/p&gt;\n\n&lt;p&gt;I brought it up to my friend and she said she would talk to him about respecting boundaries but it doesn’t seem to have done much. I’m at a loss as to what to do. I only know how to deal with the young ones, like my toddler. I have no clue how to deal with teens…&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 118,
  "permalink": "/r/TooAfraidToAsk/comments/rkkr9l/friends_son_is_being_sexually_suggestive_what_do/",
  "subreddit": "TooAfraidToAsk",
  "id": "rkkr9l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I recently moved back to my hometown and got back in contact with an old friend\nof mine who still lives there. We helped each other out a lot over the last year\nand they kind of became a second family for me.\n\nShe’s a single mom with two kids, the one of concern being 13. Over the past few\nmonths…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、故郷に戻り、古い友人と連絡を取り合うようになりました。\nまだそこに住んでいる私の この1年、お互いにたくさん助け合いました。\n私にとって第二の家族のようなものです。\n\n彼女はシングルマザーで、2人の子供がいて、そのうち1人は13歳です。この数年\nこの数ヶ月...",
      "title": "友達の息子が性的な誘惑をしている、どうしたらいい？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近搬回了我的家乡，并与我的一位老朋友重新取得了联系。\n我的一个老朋友，他仍然住在那里。在过去的一年里，我们互相帮助了很多。\n他们成了我的第二个家庭。\n\n她是个单亲妈妈，有两个孩子，其中一个是13岁。在过去的几个\n几个月来...",
      "title": "朋友的儿子有性暗示，我应该怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近搬回了我的家鄉，並與我的一位老朋友重新取得了聯繫。\n我的一個老朋友，他仍然住在那裏。在過去的一年裏，我們互相幫助了很多。\n他們成了我的第二個家庭。\n\n她是個單親媽媽，有兩個孩子，其中一個是13歲。在過去的幾個\n幾個月來...",
      "title": "朋友的兒子有性暗示，我應該怎麼做？"
    }
  ]
}