{
  "author": "truemeliorist",
  "the_new_excerpt": "With all the hullabaloo about GME and other meme stocks, this kinda flew under\nthe radar. President Biden issued multiple climate change related executive\norders yesterday, some with potentially big implications for the market.\n\nBig highlights:\n\n * Replace federal vehicle fleets with EVs (good for…",
  "original_created_utc": 1611878699,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "随着所有的喧嚣关于GME和其他纪念股，这有点飞了下\n的雷达。拜登总统发布了多项与气候变化有关的行政\n昨天的订单，有些对市场的影响可能很大。\n\n大的亮点。\n\n *用电动车取代联邦车队（有利于...",
      "title": "我想讨论一下拜登昨天签署的绿色能源行政命令及其对市场的影响。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着所有的喧囂關於GME和其他紀念股，這有點飛了下\n的雷達。拜登總統發佈了多項與氣候變化有關的行政\n昨天的訂單，有些對市場的影響可能很大。\n\n大的亮點。\n\n *用電動車取代聯邦車隊（有利於...",
      "title": "我想討論一下拜登昨天簽署的綠色能源行政命令及其對市場的影響。"
    }
  ],
  "title": "I'd like to discuss the green energy executive orders Biden signed yesterday and its impacts on the market.",
  "created_utc": 1611946599,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>With all the hullabaloo about GME and other meme stocks, this kinda flew under the radar. President Biden issued multiple climate change related executive orders yesterday, some with potentially big implications for the market.</p>\n\n<p>Big highlights:</p>\n\n<ul>\n<li><p>Replace federal vehicle fleets with EVs (good for EVs, energy storage tech, bad for traditional car companies and fossil fuel companies)</p></li>\n<li><p>Remove subsidies from fossil fuel companies (potentially huge impact on fuel companies, drillers, refiners, car companies, and more depending on what subsidies are targeted)</p></li>\n<li><p>Redirect fossil fuel subsidies to clean energy initiatives and to incentivize green companies (great news for renewable energy companies, possible help for solar companies and installers?)</p></li>\n<li><p>Pause new oil/gas drilling leases (negative impact to fossil fuel drillers, and fossil fuel exploration)</p></li>\n<li><p>Massive grid improvements to deal with new sources of industry (utility plays here? Durable equipment plays for things like transformers?)</p></li>\n<li><p>Double offshore wind energy production by 2030 (wind energy play)</p></li>\n<li><p>A new civilian climate corps to help with cleaning forests, waterways (potentially good for fishery and forestry plays)</p></li>\n</ul>\n\n<p>I&#39;m just curious who else had seen this, and what your thoughts are. There is a lot more but these were the big ones that stood out to me.</p>\n\n<p>Announcement:</p>\n\n<p><a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2021/01/27/fact-sheet-president-biden-takes-executive-actions-to-tackle-the-climate-crisis-at-home-and-abroad-create-jobs-and-restore-scientific-integrity-across-federal-government/\">https://www.whitehouse.gov/briefing-room/statements-releases/2021/01/27/fact-sheet-president-biden-takes-executive-actions-to-tackle-the-climate-crisis-at-home-and-abroad-create-jobs-and-restore-scientific-integrity-across-federal-government/</a></p>\n\n<p>Edit: Mods, I did my best to keep this politically neutral, lmk if this is a problem.</p>\n</div><!-- SC_ON -->",
  "score": 96,
  "permalink": "/r/investing/comments/l7datt/id_like_to_discuss_the_green_energy_executive/",
  "subreddit": "investing",
  "id": "l7datt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518532616
}