{
  "author": "SnooLobsters6240",
  "original_created_utc": 1642279136,
  "title": "Why do people hate CEOs for being rich but not celebrities?",
  "created_utc": 1642294417,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We see it everywhere… Zuck is a crook, Jamie Dimon is a crook, etc. Not disagreeing with those statements at all—wealth inequality is insane and a serious problem, and guys like that are actively propping themselves up at the expense of the masses.&lt;/p&gt;\n\n&lt;p&gt;But why do we not think of Mahomes and Ashton Kutcher the same way? The fact that athletes and celebrities amass such an insane level of wealth and add very little to the concrete advancement of society is obscene to me and should be looked at with the same righteous anger that we direct to big business for creating wealth inequality in America.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 185,
  "permalink": "/r/TooAfraidToAsk/comments/s4tnel/why_do_people_hate_ceos_for_being_rich_but_not/",
  "subreddit": "TooAfraidToAsk",
  "id": "s4tnel",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We see it everywhere… Zuck is a crook, Jamie Dimon is a crook, etc. Not\ndisagreeing with those statements at all—wealth inequality is insane and a\nserious problem, and guys like that are actively propping themselves up at the\nexpense of the masses.\n\nBut why do we not think of Mahomes and Ashton…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Zuckは詐欺師、Jamie Dimonは詐欺師、などなど、いたるところで見かけます。そうではなく\n富の不平等は非常識であり、このような発言には全く反対です。\n深刻な問題で、あのような連中は積極的に自分を支えているのです。\n大衆の犠牲の上に成り立っている。\n\nしかし、なぜ私たちはマホメスやアシュトンのことを考えないのだろう...。",
      "title": "なぜCEOは金持ちなのに、芸能人は嫌われるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们到处都能看到......扎克是个骗子，杰米-戴蒙是个骗子，等等。不\n我并不反对这些说法--财富的不平等是疯狂的，是一个严重的问题。\n财富不平等是一个严重的问题，像这样的人正在积极支持自己，以牺牲大众为代价。\n牺牲大众的利益。\n\n但为什么我们没有想到马霍姆斯和阿什顿...",
      "title": "为什么人们憎恨CEO的富有而不憎恨名人？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們到處都能看到......扎克是個騙子，傑米-戴蒙是個騙子，等等。不\n我並不反對這些說法--財富的不平等是瘋狂的，是一個嚴重的問題。\n財富不平等是一個嚴重的問題，像這樣的人正在積極支持自己，以犧牲大衆爲代價。\n犧牲大衆的利益。\n\n但爲什麼我們沒有想到馬霍姆斯和阿什頓...",
      "title": "爲什麼人們憎恨CEO的富有而不憎恨名人？"
    }
  ]
}