{
  "author": "Kemba4Heisman",
  "the_new_excerpt": "What the fuck is going on? The front page is full of posts about short squeezes,\nmarket manipulation, holding the line, coordinated FUD attacks and other\nconspiracy-theory nonsense. I get that a lot of folks had a lot of fun and made\nsome good money with the AMC/GME trades - but you have to realize…",
  "original_created_utc": 1623114183,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いったい何が起こっているんだ？トップページには、ショートスクイーズについての投稿がたくさんあります。\n市場操作、ラインの維持、協調したFUD攻撃、そしてその他の\n他の陰謀論的なナンセンスな記事でいっぱいです。私は、多くの人々がAMC/Gの取引で大いに楽しみ、大金を手にしたことを知っています。\nAMC/GMEのトレードで、多くの人々が楽しみながら大金を手にしたことはわかりますが、あなたは理解しなければなりません...。",
      "title": "WSBのくだらない話はもうやめませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这到底是怎么回事？头版上到处都是关于空头挤压的帖子。\n市场操纵、守住底线、协调的FUD攻击和其他\n阴谋论的胡说八道。我知道，很多人在AMC/GDP交易中玩得很开心，赚了不少钱。\n但你必须意识到......。",
      "title": "我们能不能不说WSB的废话？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這到底是怎麼回事？頭版上到處都是關於空頭擠壓的帖子。\n市場操縱、守住底線、協調的FUD攻擊和其他\n陰謀論的胡說八道。我知道，很多人在AMC/GDP交易中玩得很開心，賺了不少錢。\n但你必須意識到......。",
      "title": "我們能不能不說WSB的廢話？"
    }
  ],
  "title": "Can we stop with the WSB bullshit?",
  "created_utc": 1623121746,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What the fuck is going on? The front page is full of posts about short squeezes, market manipulation, holding the line, coordinated FUD attacks and other conspiracy-theory nonsense. I get that a lot of folks had a lot of fun and made some good money with the AMC/GME trades - but you have to realize that you caught lightning in a bottle, this shit doesn&#39;t happen all the time, and it definitely doesn&#39;t happen in markets as liquid and enormous as bitcoin. </p>\n\n<p>I don&#39;t know what this sub is or will end up being about with 3 million members- but can we all just make a commitment to not turn it into some hodl cult to bitcoin? I know we hate centralization but maybe some new moderator policies could help cut down on this kind of discourse. I&#39;m not saying &quot;go back where you came from&quot; or any bullshit like that - I am pretty new to the whole scene as well and I think everyone should be welcome - doesn&#39;t mean that every sub has to turn into some off-brand WSB</p>\n</div><!-- SC_ON -->",
  "score": 5703,
  "permalink": "/r/CryptoCurrency/comments/nusj9f/can_we_stop_with_the_wsb_bullshit/",
  "subreddit": "CryptoCurrency",
  "id": "nusj9f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404882874
}