{
  "author": "bolshevik76",
  "original_created_utc": 1654849549,
  "title": "why doesn’t anyone care that the wealth of billionaires during the pandemic has more than doubled while the world’s most vulnerable populations have suffered and died?",
  "created_utc": 1654865155,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;i just don’t understand. the fact that some people have been making $1.5 million dollars a DAY over the course of the pandemic while millions of people have starved to death at alarming rates and died due to the effects of the climate crisis. US homelessness has increased to a worse level than the 2008 housing crisis. inflation is higher than ever while wages have utterly stagnated for decades versus worker productivity. &lt;/p&gt;\n\n&lt;p&gt;this all seems somewhat immoral, inefficient, and, well, a little fucked up to me, to say the least. are we going to collectively do anything or are we just going to let a handful of people continue to hoard the world’s resources until we all die and they don’t have a planet to exploit anymore?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 181,
  "permalink": "/r/TooAfraidToAsk/comments/v92zwj/why_doesnt_anyone_care_that_the_wealth_of/",
  "subreddit": "TooAfraidToAsk",
  "id": "v92zwj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "i just don’t understand. the fact that some people have been making $1.5 million\ndollars a DAY over the course of the pandemic while millions of people have\nstarved to death at alarming rates and died due to the effects of the climate\ncrisis. US homelessness has increased to a worse level than the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "150万ドルを稼いでいる人がいるという事実が理解できない。\n何百万人もの人々が憂慮すべき速度で餓死し、気候の影響で死亡している一方で\n何百万人もの人々が飢え死にし、気候変動の影響により死亡している一方で\n危機が迫っています。アメリカのホームレス問題は、世界一深刻なレベルにまで増加しています。",
      "title": "世界で最も弱い立場にある人々が苦しみ、死んでいく一方で、パンデミック中の億万長者の富が2倍以上になったことを、なぜ誰も気にかけないのだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是不明白，有些人在大流行病期间每天赚取150万美元的事实\n而数百万人却以惊人的速度饿死，并因气候影响而死亡。\n而数百万人以惊人的速度饿死，并因气候危机的影响而死亡。\n危机。美国的无家可归者已经增加到比......更糟糕的程度。",
      "title": "为什么没有人关心，在大流行期间，亿万富翁的财富增加了一倍多，而世界上最脆弱的人群却在遭受痛苦和死亡？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是不明白，有些人在大流行病期間每天賺取150萬美元的事實\n而數百萬人卻以驚人的速度餓死，並因氣候影響而死亡。\n而數百萬人以驚人的速度餓死，並因氣候危機的影響而死亡。\n危機。美國的無家可歸者已經增加到比......更糟糕的程度。",
      "title": "爲什麼沒有人關心，在大流行期間，億萬富翁的財富增加了一倍多，而世界上最脆弱的人羣卻在遭受痛苦和死亡？"
    }
  ]
}