{
  "author": "41351865132435",
  "the_new_excerpt": "So, I bought GameStop towards the beginning of this whole debacle with 44 shares\nan average share price of about $250. I'll admit I let the greed get the best of\nme even though there were many times last week I simply wanted to just walk away\nwith the money i didn't. Oh well..\n\nAll said and done,…",
  "original_created_utc": 1612286369,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我买了GameStop对整个崩溃的开始，与44股\n平均股价约为250美元。我承认，我让贪婪得到最好的。\n尽管上周有很多次我只想一走了之。\n用钱我没有。哦，好吧。\n\n所有说和做，...",
      "title": "降低风险：如何才能减轻打击？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我買了GameStop對整個崩潰的開始，與44股\n平均股價約爲250美元。我承認，我讓貪婪得到最好的。\n儘管上週有很多次我只想一走了之。\n用錢我沒有。哦，好吧。\n\n所有說和做，...",
      "title": "降低風險：如何才能減輕打擊？"
    }
  ],
  "title": "risk mitigation: how can I soften the blow",
  "created_utc": 1612295259,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, I bought GameStop towards the beginning of this whole debacle with 44 shares an average share price of about $250. I&#39;ll admit I let the greed get the best of me even though there were many times last week I simply wanted to just walk away with the money i didn&#39;t. Oh well..</p>\n\n<p>All said and done, I&#39;m currently down about 7k on this stock. I probably should just cut my losses but I feel like if the big boys have some tricks up their sleeves maybe so do some of you.</p>\n\n<p>In the long term I was thinking about potentially averaging down my cost per share to try and sell at a break even if possible. This would obviously expose me to even more risk BUT... for example, say the price were to drop to around 20 dollars per share if I bought 500 shares this would bring my average cost to about $38.6. However, I&#39;ve never done something like this so I&#39;m not entirely sure how the math would work out in the end.</p>\n\n<p>Obviously we don&#39;t know how to future of Gamestop will pan out, maybe it&#39;s worth around $100 in a few years like Chewy or it goes the route of KB toys and ceases to exist. What I do know is I played myself and took home a very expensive lesson lol.</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "permalink": "/r/investing/comments/lb0zio/risk_mitigation_how_can_i_soften_the_blow/",
  "subreddit": "investing",
  "id": "lb0zio",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518534790
}