{
  "author": "Teaatnighttime",
  "original_created_utc": 1630801551,
  "title": "El Salvador Recognizes Bitcoin as Legal Tender on Tuesday!",
  "created_utc": 1630838621,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As tribute, I am going to be a part of the bitcoin &#39;$30 tuesday pump&#39; Make sure to buy in at the time El Salvador officializes the currency. If you see another post like this, go in and see how many likes you can give in the comments while holding your breathe. Good luck! Have fun!\nEdit #1: Their Citizens are receiving $30 in free bitcoin each.\nEdit #2: I am to share information from another post shortly to define what you get from the currency in imformational matters.\nEdit#3: Legal tender as in theyre officiating it!\nEdit #4: This post has crossed 25 viewer votes and I am going to revise and make additions.\nEdit #5: Bitcoin teaches you economics, computer science, math, philosophy, political science, history, sociology, and physics. Understand these traits and you will understand Bitcoin.\nEdit#6: Bitcoin&#39;s uptrend is probably complimentary to this Christmas and New Years. Cheers to breaking 60K? We can beat 65.\nEdit#7: 3,321,113 x $30 = 99,6333,90. Add this so El S. And we might walk away with a good pump. Extra if people catch on without doubt\nEdit #8: Reddit is eyeballing an IPO on the Stock Market. More information with Yahoo Finance, Reuters.\nEdit #9: An effective price alert tool is Cryptocurrency Alerting LLC. You may find them on the app store or their www.</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "permalink": "/r/Bitcoin/comments/pi2wu1/el_salvador_recognizes_bitcoin_as_legal_tender_on/",
  "subreddit": "Bitcoin",
  "id": "pi2wu1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As tribute, I am going to be a part of the bitcoin '$30 tuesday pump' Make sure\nto buy in at the time El Salvador officializes the currency. If you see another\npost like this, go in and see how many likes you can give in the comments while\nholding your breathe. Good luck! Have fun! Edit #1: Their…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "トリビュートとして、私は、ビットコインの「30ドルチューズデイポンプ」で必ず\nエルサルバドルが通貨を公式化したタイミングで買い付けを行います。もし、また\nこのような投稿があったら、息を止めてコメントにどれだけ「いいね！」を付けられるか試してみましょう。\n息を止めながら、コメントでどれだけの「いいね！」を付けられるか見てみましょう。がんばってください! 楽しんでくださいね。Edit #1: 彼らの...",
      "title": "エルサルバドル、火曜日にビットコインを法定通貨として認める!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为贡品，我将成为比特币 \"30美元星期二泵 \"的一部分。\n在萨尔瓦多正式发行货币的时候买入。如果你看到另一个\n这样的帖子，进去看看你能在评论中给多少个赞，同时屏住呼吸。\n屏住呼吸。好运! 玩得开心 编辑#1：他们的...",
      "title": "萨尔瓦多周二承认比特币为法定货币!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲貢品，我將成爲比特幣 \"30美元星期二泵 \"的一部分。\n在薩爾瓦多正式發行貨幣的時候買入。如果你看到另一個\n這樣的帖子，進去看看你能在評論中給多少個贊，同時屏住呼吸。\n屏住呼吸。好運! 玩得開心 編輯#1：他們的...",
      "title": "薩爾瓦多週二承認比特幣爲法定貨幣!"
    }
  ]
}