{
  "author": "twitchHUNTR",
  "the_new_excerpt": "I first started with bitcoin in 2014. It was amazing how you could easily buy\nbitcoins or mine them (I myself mined them with my 2 980s and got like 2.5 btc\nout of it. You could easily transfer them from wallet to wallet for a small fee.\nIt was amazing..\n\n2017 I jumped into bitcoin again because the…",
  "original_created_utc": 1620902608,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が初めてビットコインを始めたのは2014年でした。簡単にビットコインを購入したり、採掘したりできることに驚きました。\nビットコインを購入したり、マイニングしたりできることに驚きました（私自身、980を2台使ってマイニングし、2.5btc\n獲得しました。ウォレットからウォレットへの送金もわずかな手数料で簡単にできました。\n驚きましたね。\n\n2017年 私は再びビットコインに飛びつきました...",
      "title": "ビットコイン技術の記事はなくなりましたが、取引だけはあります"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我第一次使用比特币是在2014年。你可以很容易地买到\n我自己用我的两台980挖矿，得到了2.5个比特币。\n了。你可以很容易地把它们从一个钱包转移到另一个钱包，只需要一点费用。\n这很神奇。\n\n2017年我又跳进了比特币，因为...",
      "title": "没有更多的比特币技术帖子，只有交易"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我第一次使用比特幣是在2014年。你可以很容易地買到\n我自己用我的兩臺980挖礦，得到了2.5個比特幣。\n了。你可以很容易地把它們從一個錢包轉移到另一個錢包，只需要一點費用。\n這很神奇。\n\n2017年我又跳進了比特幣，因爲...",
      "title": "沒有更多的比特幣技術帖子，只有交易"
    }
  ],
  "title": "There are no more bitcoin technology posts but only trading",
  "created_utc": 1620981342,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I first started with bitcoin in 2014. It was amazing how you could easily buy bitcoins or mine them (I myself mined them with my 2 980s and got like 2.5 btc out of it. You could easily transfer them from wallet to wallet for a small fee. It was amazing..</p>\n\n<p>2017 I jumped into bitcoin again because the currency itself became pretty popular and I still had like 2 btc. So I started trading it, selling it when the price was good, buying it when the price jumped down. In that time I really learned what bitcoin is all about and not only for transferring. The block chain itself was so stunning for me that I learned all about it.</p>\n\n<p>Today I only see investors in this sub, being monkes like on the <a href=\"/r/wsb\">r/wsb</a> sub.. bitcoin is not what it was anymore and with that price high/low it will never be an opportunity to pay or transfer. You just destroyed the whole concept of bitcoin by being a jerk hoping it goes up or down to make the most profit out of it. </p>\n\n<p>I was there in 2017 and stopped this stupid trading shit because this currency was allready then a currency to trade on.</p>\n\n<p>I really hope the investors stop working with bitcoin so it will be, what it was before - a cryptocurrency made for transferring money from A to B.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/Bitcoin/comments/nbdppp/there_are_no_more_bitcoin_technology_posts_but/",
  "subreddit": "Bitcoin",
  "id": "nbdppp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590792948
}