{
  "author": "WDFIWWTW",
  "original_created_utc": 1652881577,
  "title": "Can depression affect your memory?",
  "created_utc": 1652893606,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Im doing my exams n I know the topics pretty well but I keep making small mistakes while writing down my formulae even when I know the correct one it&amp;#39;s like my head is somewhere else when I&amp;#39;m noting it down. Sometimes I forget the names of the  topics. I&amp;#39;ve never been this way and this is happening to me all of a sudden. I&amp;#39;ve been quite depressed these days but I&amp;#39;m coping with it . I jus wanted to know if my depression has anything to do with me forgetting small details in my studies. I don&amp;#39;t want it to affect my grades :/&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/askscience/comments/usdbk9/can_depression_affect_your_memory/",
  "subreddit": "askscience",
  "id": "usdbk9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Im doing my exams n I know the topics pretty well but I keep making small\nmistakes while writing down my formulae even when I know the correct one it's\nlike my head is somewhere else when I'm noting it down. Sometimes I forget the\nnames of the topics. I've never been this way and this is happening…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は試験を受けていて、トピックはよく分かっているのですが、小さなミスを繰り返してしまいます。\nを書き留めるとき、正しい式を知っていても、まるで頭の中がどこか\nメモしているとき、頭の中が別のところにあるような感じです。時々、トピックの名前を忘れ\nトピックの名前も忘れてしまう。今までこんなことなかったのに、こんなことになるなんて...。",
      "title": "うつ病は記憶力に影響を与えるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在做我的考试，我对题目非常了解，但我一直在做小的事情。\n错，即使我知道正确的公式也是如此。\n即使我知道正确的公式，但在记下它时，我的脑子却不在这里。有时我还会忘记\n题目的名称。我从来没有这样过，现在却发生了这种情况......",
      "title": "抑郁症会影响你的记忆吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在做我的考試，我對題目非常瞭解，但我一直在做小的事情。\n錯，即使我知道正確的公式也是如此。\n即使我知道正確的公式，但在記下它時，我的腦子卻不在這裏。有時我還會忘記\n題目的名稱。我從來沒有這樣過，現在卻發生了這種情況......",
      "title": "抑鬱症會影響你的記憶嗎？"
    }
  ]
}