{
  "author": "Mediocre-Sale8473",
  "original_created_utc": 1632233287,
  "title": "Less than 12 hours to see who was right.",
  "created_utc": 1632243529,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In less than 12 hours the Chinese markets open. For those unaware, they have been closed the last 2 days for holiday in China. Looks like approximately 9:30 am over there is the open, which puts us at about 9:30 pm EST.</p>\n\n<p>That&#39;s when the Evergarde shit will hit the fan. Multiple things could go down:</p>\n\n<p>1.) CCP announces a bailout for them. Unlikely currently, but NOBODY wants a repeat of 2008.</p>\n\n<p>2.) MASSIVE crypto pump today. Like all the big ones (ETH, BTC, etc) see gains of 4-5% or more. This could be indicative of a coming dump on Wednesday/Thursday. Beware of seeing pumps close to 9pm tonight (EST).</p>\n\n<p>2a.) ...But also, the dumpage yesterday could mean a massive rebuy of crypto that could be hiding assets of those that invested in Evergarde. It <em>could</em> be a good thing if we see prices in the green today. However, that boils down to money laundering, so if that IS the case, expect a response from the Fed on US soil in a week or 2 clamouring for regulations if this is the case.</p>\n\n<p>3.) The markets will be dumping hard. Stocks, bonds, and crypto to liquidate. It most definitely affects global markets just like the 08 crash did (though not as large). Expect to see drops on futures, and throughout Wednesday and Thursday. Friday might see some corrections from this.</p>\n\n<p>4.) Crypto is going to be liquidated first. Honest truth and a hard truth. It&#39;s intangible digital money. And even will all the evidence of &quot;practical us&quot;, it can&#39;t be used for shit and smart economics says ditch it first. Think of how much you buy with actual cryptocurrency (not crypto you converted to cash) and realize this is mostly true.You get your cash assets out of it to bail yourself out of their junk bonds and bad margins. After that, liquidate stocks as well. Same shit.</p>\n\n<p>5.) There could be an impending downturn for major crypto. BTC sub $35k, ETH sub $2200. This shit scares everyone.</p>\n\n<p>6.) Maybe this is all wrong and the crash part happened yesterday and now it&#39;s green dildos for the rest of September.</p>\n\n<p>TL; DR: September still sucks for crypto. But I think we will bull run in October when this shit settles the fuck down.</p>\n</div><!-- SC_ON -->",
  "score": 252,
  "permalink": "/r/CryptoCurrency/comments/psjgh7/less_than_12_hours_to_see_who_was_right/",
  "subreddit": "CryptoCurrency",
  "id": "psjgh7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In less than 12 hours the Chinese markets open. For those unaware, they have\nbeen closed the last 2 days for holiday in China. Looks like approximately 9:30\nam over there is the open, which puts us at about 9:30 pm EST.\n\nThat's when the Evergarde shit will hit the fan. Multiple things could go…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あと12時間もしないうちに、中国の市場が開きます。ご存知ない方もいらっしゃるかもしれませんが\nご存知ない方もいらっしゃるかもしれませんが、この2日間は中国の祝日で休場でした。向こうでは午前9時30分頃がオープンのようです。\nあちらでは午前9時30分頃がオープンで、私たちは午後9時30分頃になります。\n\nその時にEvergardeの糞が爆発するのです。複数のことが起こる可能性がある...",
      "title": "誰が正しかったのか、12時間足らずでわかる。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在不到12个小时的时间里，中国市场就会开放。对于那些不知道的人来说，他们已经\n在过去的两天里，中国的市场是关闭的，因为有假期。看起来大约9:30\n上午是开盘时间，这使得我们在美国东部时间晚上9:30左右。\n\n这时Evergarde的事情就会发生。许多事情可能会发生...",
      "title": "在不到12小时的时间里，看看谁是对的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在不到12個小時的時間裏，中國市場就會開放。對於那些不知道的人來說，他們已經\n在過去的兩天裏，中國的市場是關閉的，因爲有假期。看起來大約9:30\n上午是開盤時間，這使得我們在美國東部時間晚上9:30左右。\n\n這時Evergarde的事情就會發生。許多事情可能會發生...",
      "title": "在不到12小時的時間裏，看看誰是對的。"
    }
  ]
}