{
  "author": "YaAbsolyutnoNikto",
  "original_created_utc": 1646936382,
  "title": "Do humans really feel the urge to work?",
  "created_utc": 1646983691,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Maybe it&amp;#39;s hustle culture but I&amp;#39;ve heard more than once that humans always need to be doing something productive: That we live for it. The Japanese call it Ikigai (having a purpose), for example. Even when discussing whether UBI (Universal Basic Income) should be a thing, people always mention that humans inherently like working. &amp;quot;It&amp;#39;s not just because of the money, we like contributing to society and being busy.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Maybe it&amp;#39;s because I&amp;#39;ve never had a long time to actually do nothing, but I definitely don&amp;#39;t feel like I need to be working to be happy.&lt;/p&gt;\n\n&lt;p&gt;If I didn&amp;#39;t need to work to survive, I think I could love my life anyway just by watching Netflix, going to the beach, the park or the cinema, eating out in restaurants, travelling, etc. - Just enjoying life in general.&lt;/p&gt;\n\n&lt;p&gt;I was afraid to ask this question because, well, I don&amp;#39;t want to seem like a lazy ass and find out that everyone around me is actually super motivated or something haha. I don&amp;#39;t feel like that at all.&lt;/p&gt;\n\n&lt;p&gt;My life goal is actually to FIRE (Retire Early) so I can do nothing productive after that. No, it&amp;#39;s not to open a company while working &amp;quot;on my own terms&amp;quot; or something. My goal is to do nothing productive all day (except for going to the gym).&lt;/p&gt;\n\n&lt;p&gt;Can you relate to what I am saying or am I weird?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/tb4zme/do_humans_really_feel_the_urge_to_work/",
  "subreddit": "TooAfraidToAsk",
  "id": "tb4zme",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Maybe it's hustle culture but I've heard more than once that humans always need\nto be doing something productive: That we live for it. The Japanese call it\nIkigai (having a purpose), for example. Even when discussing whether UBI\n(Universal Basic Income) should be a thing, people always mention that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ハッスル文化なのかもしれませんが、人間は常に何かを必要としていると何度も聞いたことがあります。\n何か生産的なことをしなければならない。私たちはそのために生きているのです。日本人はそれを\n例えば、「生きがい」。UBIの是非を議論するときにも\n(ユニバーサル・ベーシックインカムはどうあるべきかというと、必ずこう言うんです。",
      "title": "人間は本当に働きたいと感じているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "也许这是一种喧嚣的文化，但我不止一次地听到，人类总是需要\n要做一些有意义的事情。我们为它而活。日本人称其为\n比如说，日本人称之为 \"有目的\"（Ikigai）。即使在讨论UBI\n(Universal Basic Income)时，人们总是提到...",
      "title": "人类真的有工作的冲动吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "也許這是一種喧囂的文化，但我不止一次地聽到，人類總是需要\n要做一些有意義的事情。我們爲它而活。日本人稱其爲\n比如說，日本人稱之爲 \"有目的\"（Ikigai）。即使在討論UBI\n(Universal Basic Income)時，人們總是提到...",
      "title": "人類真的有工作的衝動嗎？"
    }
  ]
}