{
  "author": "_manicblue",
  "original_created_utc": 1636137199,
  "title": "Aren’t dress codes at least somewhat sexist?",
  "created_utc": 1636143864,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don’t mean dress codes with obvious utilitarian intent (things like requiring use of certain protective clothing/equipment or saying you have to wear a uniform) for your job. </p>\n\n<p>I mean things like explicitly forbidding male employees from having long hair, but allowing females to have long hair, as long as it is styled appropriately (kept in a bun or ponytail) or appropriate covering (hairnets in food service) is worn; saying that males are explicitly prohibited from wearing cosmetics or having their nails painted, but allowing females to do so; or allowing females to have piercings (even if just their earlobes), but forbidding males from doing so.</p>\n\n<p>I fully understand that some may consider males with long hair, cosmetics, pierced ears, painted nails, etc as “unprofessional looking”, and use that as justification for the dress code, but that feels discriminatory to me, unless it’s for something like a health/safety related reason.</p>\n\n<p>Edit: for those who think it is sexist, what can we really do to challenge/change these kinds of policies?</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/NoStupidQuestions/comments/qnhiqo/arent_dress_codes_at_least_somewhat_sexist/",
  "subreddit": "NoStupidQuestions",
  "id": "qnhiqo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don’t mean dress codes with obvious utilitarian intent (things like requiring\nuse of certain protective clothing/equipment or saying you have to wear a\nuniform) for your job.\n\nI mean things like explicitly forbidding male employees from having long hair,\nbut allowing females to have long hair, as…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "明らかに実用的な意図を持ったドレスコードのことではありません。\n制服を着用しなければならないというような、明らかに実用的な意図を持った服装規定のことです。\n制服を着用しなければならないというようなものです）。\n\nつまり、男性従業員の長髪を明確に禁止するようなものです。\nしかし、女性が長髪であることは認める、というようなことです。",
      "title": "ドレスコードは、少なくとも多少は性差別的ではないでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我指的不是具有明显功利目的的着装规定（如要求使用证书）。\n要求使用特定的防护服/设备或说你必须穿上制服）。\n统一）的工作。\n\n我指的是像明确禁止男性员工留长发这样的事情。\n但允许女性留长发，因为......",
      "title": "难道着装规范不是至少有些性别歧视吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我指的不是具有明顯功利目的的着裝規定（如要求使用證書）。\n要求使用特定的防護服/設備或說你必須穿上制服）。\n統一）的工作。\n\n我指的是像明確禁止男性員工留長髮這樣的事情。\n但允許女性留長髮，因爲......",
      "title": "難道着裝規範不是至少有些性別歧視嗎？"
    }
  ]
}