{
  "author": "gorays21",
  "the_new_excerpt": "> Alibaba Group Holding Ltd. shares jumped Monday, after China's antitrust\n> regulator slapped a record fine on the e-commerce giant following a monthslong\n> investigation.\n> \n> Alibaba's Hong Kong-listed shares, which opened 5.5% higher, were recently\n> 7.9% higher at 235 Hong Kong dollars, when…",
  "original_created_utc": 1618197486,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "> アリババ・グループ・ホールディング・リミテッドの株価は、中国の独占禁止法に基づく規制当局が\n> 中国の反トラスト規制当局が1カ月にわたる調査の結果、電子商取引の大手企業に記録的な罰金を科したことで\n> 罰金を科しました。\n> \n> 5.5%の上昇で始まったアリババの香港上場株式は、最近では\n> 7.9％高の235香港ドルとなりました...",
      "title": "アリババ、過去最高の28億ドルの罰金にもかかわらず香港で株価上昇"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "> 阿里巴巴集团控股有限公司股价周一大涨，此前中国反垄断局的\n>监管机构对电商巨头处以创纪录的罚款，此前长达一个月之久\n> 调查。\n> \n> 阿里巴巴在香港上市的股价，开盘后上涨5.5%，近日被\n>上涨7.9%，报235港元，当...",
      "title": "阿里巴巴在港股价上涨，尽管被罚28亿港元创纪录"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> 阿里巴巴集團控股有限公司股價週一大漲，此前中國反壟斷局的\n>監管機構對電商巨頭處以創紀錄的罰款，此前長達一個月之久\n> 調查。\n> \n> 阿里巴巴在香港上市的股價，開盤後上漲5.5%，近日被\n>上漲7.9%，報235港元，當...",
      "title": "阿里巴巴在港股價上漲，儘管被罰28億港元創紀錄"
    }
  ],
  "title": "Alibaba Shares Rise in Hong Kong Despite Record $2.8 Billion Fine",
  "created_utc": 1618205726,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p>Alibaba Group Holding Ltd. shares jumped Monday, after China&#39;s antitrust regulator slapped a record fine on the e-commerce giant following a monthslong investigation.  </p>\n\n<p>Alibaba&#39;s Hong Kong-listed shares, which opened 5.5% higher, were recently 7.9% higher at 235 Hong Kong dollars, when most other leading Chinese tech stocks were down.  </p>\n\n<p>China&#39;s antitrust regulator on Saturday imposed a fine equivalent to US$2.8 billion against Alibaba for abusing its dominant position over rivals and merchants on its e-commerce platforms, coming amid a wave of scrutiny on the business empire of company founder Jack Ma.  </p>\n\n<p>The penalty could put an end to the regulatory uncertainty associated with the antimonopoly investigation into Alibaba that started late last year, some analysts say.</p>\n</blockquote>\n\n<p><a href=\"https://www.morningstar.com/news/dow-jones/202104112707/alibaba-shares-rise-in-hong-kong-despite-record-28-billion-fine\">Alibaba Shares Rise in Hong Kong Despite Record $2.8 Billion Fine | Morningstar</a></p>\n</div><!-- SC_ON -->",
  "score": 868,
  "permalink": "/r/stocks/comments/mp5sao/alibaba_shares_rise_in_hong_kong_despite_record/",
  "subreddit": "stocks",
  "id": "mp5sao",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566618917
}