{
  "author": "Kingmaker251",
  "the_new_excerpt": "I've seen a few posts about ADRs recently talking about how all chinese stocks\n(NIO BABA TENCENT) are based in the Cayman Islands and no one's really buying\nstock in these chinese companies and that China has no need to uphold these\nagreements - As a disclaimer, before I go on, I was to say I do own…",
  "original_created_utc": 1610994705,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "最近看到一些关于ADR的帖子，说到中国的股票怎么都是\n(NIO BABA TENCENT)的总部设在开曼群岛，但没有人真正购买\n这些中国公司的股票，中国没有必要维护这些公司的利益。\n协议--作为一个免责声明，在我继续之前，我想说的是，我确实拥有... ...",
      "title": "中国的软实力与ADR的?"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近看到一些關於ADR的帖子，說到中國的股票怎麼都是\n(NIO BABA TENCENT)的總部設在開曼羣島，但沒有人真正購買\n這些中國公司的股票，中國沒有必要維護這些公司的利益。\n協議--作爲一個免責聲明，在我繼續之前，我想說的是，我確實擁有... ...",
      "title": "中國的軟實力與ADR的?"
    }
  ],
  "title": "China's Soft Power and ADR's",
  "created_utc": 1611020856,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve seen a few posts about ADRs recently talking about how all chinese stocks (NIO BABA TENCENT) are based in the Cayman Islands and no one&#39;s really buying stock in these chinese companies and that China has no need to uphold these agreements - As a disclaimer, before I go on, I was to say I do own stock in NIO and BABA as well as AMZN, AAPL and a few other small AI companies.</p>\n\n<p>While many of you may be technically correct about ADRs, it fundamentally ignores the foreign policy climate of almost all countries and more specifically ignores the way China&#39;s foreign policy is being conducted right now - I&#39;m not an expert and you should of course do your own DD but what I&#39;ve noticed from all these posts is that they are all ignoring the idea of Soft Power.</p>\n\n<p><strong>Lets define what soft and hard power are</strong>: I&#39;ve taken these definitions from wikipedia, because they&#39;re concise and as always wikipedia is well referenced (damn teachers!)</p>\n\n<p>Soft power: In politics (and particularly in international politics), soft power is the ability to attract and co-opt, rather than coerce (contrast hard power). In other words, soft power involves shaping the preferences of others through appeal and attraction - Foreign Aid is an excellent example of the use of Soft Power</p>\n\n<p>Hard Power: Hard power is the use of military and economic means to influence the behavior or interests of other political bodies. This form of political power is often aggressive (coercion), and is most immediately effective when imposed by one political body upon another of lesser military and/or economic power</p>\n\n<p><strong>Why is this important?:</strong></p>\n\n<p>While China is on its way to becoming a global superpower its not there yet, there are more economically reliable countries (US) and countries with more functional military might (Russia and US) - I say functional here because military might isn&#39;t just man power and number of soldiers.</p>\n\n<p>China uses hard power when it comes to domestic policy, through the use of censorship, coercion of officials, imprisonment of dissidents and so on and so forth. (<a href=\"https://www.amnesty.org/en/countries/asia-and-the-pacific/china/report-china/\">https://www.amnesty.org/en/countries/asia-and-the-pacific/china/report-china/</a>)</p>\n\n<p>However, they&#39;ve also learnt from the collapse of the USSR which collapsed in part due their international and economic isolation among other factors (<a href=\"https://www.britannica.com/story/why-did-the-soviet-union-collapse\">https://www.britannica.com/story/why-did-the-soviet-union-collapse</a>) - Now China doesn&#39;t want that to happen and to ensure it doesn&#39;t, it&#39;s followed an interesting hybridisation of communism and capitalism where private companies are closely linked to the government but are allowed to compete and have private ownership. However this has meant that chinese companies and by extension China as a country has to be attractive to outside investors and that&#39;s where soft power comes in.</p>\n\n<p>Throughout the pandemic and even before China has been trying to expand its soft power further in the hope of eventually leveraging itself into the world&#39;s leading super power. Case and point is the Free trade agreement it signed with 14 other asia-pacific countries creating an even larger free market than the eu (16% vs 22%) (<a href=\"https://www.theguardian.com/business/2020/nov/15/china-and-14-asia-pacific-countries-agree-historic-free-trade-deal\">https://www.theguardian.com/business/2020/nov/15/china-and-14-asia-pacific-countries-agree-historic-free-trade-deal</a>). While this gives it more economic power, it also gives china great headlines!</p>\n\n<p>This isn&#39;t the only way China is trying to garner a better image of itself and therefore more soft power - For a long time, China has been and is commonly viewed as one of the largest polluters in the world (<a href=\"https://ge.usembassy.gov/chinas-air-pollution-harms-its-citizens-and-the-world/#:%7E:text=The%20People&#x27;s%20Republic%20of%20China,health%20and%20the%20world&#x27;s%20economy\">https://ge.usembassy.gov/chinas-air-pollution-harms-its-citizens-and-the-world/#:~:text=The%20People&#39;s%20Republic%20of%20China,health%20and%20the%20world&#39;s%20economy</a>.), pollution that has been killing around a million of its citizens a year - so to not only improve their citizens lives (though how much of the main motivation that is I&#39;m very skeptical) but to also capture the ongoing trend of renewable energy becoming the dominant energy market in the next decade or two, China has been pouring money into clean energy initiatives, so they not only capture a significant slice of an upcoming dominant market but they are also able to position themselves as the clean energy capital of the world.</p>\n\n<p>Let&#39;s be clear though, the current pandemic has affected their soft power and reduced it massively which leads onto the crux of my argument.</p>\n\n<p><strong>How Soft power relates to ADRs and Stocks?</strong></p>\n\n<p>For China to successfully follow through with their plans (leveraging soft power into economic might - the tried and tested american way to an extent - except america had WW2 and the Marshall plan to reach this point sidenote: I know that&#39;s massively reductive and there&#39;s a lot of other factors involved in america becoming a superpower including a shit load of hard power i.e. nuclear bombs and military might) they require investment not just from domestic sources but foreign sources otherwise they gain no soft power. So how does this relate the ADRs:</p>\n\n<p>If China and Chinese companies were to renege on their agreements with these shell companies, it would lead to major banks, hedge funds and entire countries to disinvest from the chinese economy - a counterpoint I can imagine in the comments may be that it&#39;s technically not a reneging because the these chinese companies and chinese law doesn&#39;t state that you can own shares but the optics of it certainly are. Every major newspaper would be covering it, people who have invested would be using their soft power (their vote) to push for harder line on china and so would banks who would be disinvesting by their droves from chinese ADRs. I know I wouldn&#39;t be buying anything from China again because the risk is too high and that would be the most dangerous thing for the chinese government. They are trying and have until now succeeded in creating an image of a stable thriving economy</p>\n\n<p>Disinvestment may sound sensationalist and to an extent I would agree it may be but the most recent example is BABA stock - The disappearance of Jack Ma not only lead to a massive drop in BABA stock but countless headlines about how dangerous it is to invest in Chinese companies - and while I&#39;m sure Jack Ma when he returns will have to change to adapt to his potentially curbed reality, the chinese government will have also realised that they&#39;ll need to adapt to ensure that they don&#39;t lose the soft power they&#39;ve spent over 40 years cultivating ( look up Deng Xiaoping&#39;s China reform and opening-up policy).</p>\n\n<p>And to address comments that I&#39;m sure will say China can be self sufficient without any foreign investments - I&#39;m sure they can but that path has until now lead to ruin for other countries, the primary example being the USSR and a less prominent example being North Korea. The chinese government is ruthless, efficient and they&#39;re certainly not stupid.</p>\n\n<p>Of course if anyone thinks I&#39;m wrong, please let me know - I also understand that the BABA example is more nuanced than how far I&#39;ve gone into it because of Jack Ma&#39;s Ant group going onto central bank turf but the logic behind the point stands.</p>\n\n<p><strong>TLDR: China would lose their soft power, banks and people would disinvest in China if they didn&#39;t honor their ADR agreements and would set China onto the path of future economic ruin and upheaval - I could be wrong though</strong></p>\n\n<p>Edit: Hong Kong is an interesting counterpoint to my argument, but I would say that to a certain extent, Banks knew HK would be bought under the CCP and still think they can make money there - also Hong Kong massively damaged Chinese Soft power and if there had been a better president I think the effect would have been huge but there wasn&#39;t and the markets are over it - if ADRs aren&#39;t honoured, then Banks and hedge funds would lose money and I think that that&#39;s their bottom line and a red line for them - I could be wrong though</p>\n</div><!-- SC_ON -->",
  "score": 49,
  "permalink": "/r/investing/comments/l00jdw/chinas_soft_power_and_adrs/",
  "subreddit": "investing",
  "id": "l00jdw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311217229
}