{
  "author": "FortniteRice",
  "original_created_utc": 1627793035,
  "title": "Crypto is the only path to financial freedom I see for young people like me",
  "created_utc": 1627810569,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For many people in their 20s and 30s, myself included, crypto represents a chance at a better life. I want money to support a family and myself financially, and this might be the only path to it I can see.</p>\n\n<p>I don’t want to have to worry about not being able to pay my rent. I don’t want to have to worry about not being able to put food on the table. I don’t want myself or my family to be scared </p>\n\n<p>I want a chance to start something big. I want to lay down the foundation of success in my family for generations to come. That is my dream and that is my moon. I wonder if many other people in their 20’s like me think this way.</p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/CryptoCurrency/comments/ovlv1h/crypto_is_the_only_path_to_financial_freedom_i/",
  "subreddit": "CryptoCurrency",
  "id": "ovlv1h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For many people in their 20s and 30s, myself included, crypto represents a\nchance at a better life. I want money to support a family and myself\nfinancially, and this might be the only path to it I can see.\n\nI don’t want to have to worry about not being able to pay my rent. I don’t want\nto have to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私を含めた20代、30代の多くの人にとって、暗号はより良い生活を手に入れるチャンスです。\nより良い生活を手に入れるチャンスです。家族と自分自身を経済的に支えるお金が欲しい。\nそのための唯一の道かもしれません。\n\n家賃が払えなくなる心配はしたくありません。私は\nこのようなことは...",
      "title": "暗号は、私のような若者にとって経済的自由への唯一の道だと思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于许多20多岁和30多岁的人来说，包括我自己，加密货币代表了一个\n更好的生活的机会。我想要钱来支持家庭和自己\n在经济上，这可能是我能看到的唯一途径。\n\n我不想再为付不起房租而担心。我不希望\n要...",
      "title": "对于像我这样的年轻人来说，加密货币是我看到的通往财务自由的唯一途径"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於許多20多歲和30多歲的人來說，包括我自己，加密貨幣代表了一個\n更好的生活的機會。我想要錢來支持家庭和自己\n在經濟上，這可能是我能看到的唯一途徑。\n\n我不想再爲付不起房租而擔心。我不希望\n要...",
      "title": "對於像我這樣的年輕人來說，加密貨幣是我看到的通往財務自由的唯一途徑"
    }
  ]
}