{
  "author": "HelpfulDoubleHJ",
  "original_created_utc": 1629603689,
  "title": "India's Crypto ban bill sent to Cabinet approval. Time to vote them out.",
  "created_utc": 1629657951,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So the bill seeking to ban non-government cryptos in India has been sent to approval. </p>\n\n<p>Apparently apart from banning cryptos (BTC,ETH - all), They want to keep using blockchains like Ethereum but ban the native currency ETH. Not sure how they plan to achieve that. </p>\n\n<p>The country has one of the fastest adoption rate and Bitcoin has a huge and growing following. Its a case of the Old trying to suppress the New. Constantinople fell to the very cannons they refused to take. Nokia refused to adapt to Android, they are nowhere now. When will they learn ??</p>\n\n<p>In any case it seems the govt is hell bent on screwing itself in the coming elections and the country&#39;s future in tech. </p>\n\n<p>-Reposted after it was removed from another sub as this is an important issue.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/Bitcoin/comments/p95dyx/indias_crypto_ban_bill_sent_to_cabinet_approval/",
  "subreddit": "Bitcoin",
  "id": "p95dyx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So the bill seeking to ban non-government cryptos in India has been sent to\napproval.\n\nApparently apart from banning cryptos (BTC,ETH - all), They want to keep using\nblockchains like Ethereum but ban the native currency ETH. Not sure how they\nplan to achieve that.\n\nThe country has one of the fastest…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そのため、インドでの非政府系暗号の禁止を求める法案が送られてきました。\n承認されました。\n\nどうやら、暗号（BTC、ETH）を禁止するだけでなく、Ethereumのようなブロックチェーンの使用は継続したいようです。\nイーサリアムのようなブロックチェーンは使い続けるが、固有の通貨ETHは禁止したいようです。どのようにしてそれを実現しようとしているのかは\nどうやって実現するのかはわかりませんが。\n\nこの国は、最速の...",
      "title": "インドの暗号禁止法案、閣議決定へ。彼らを投票で排除する時が来た"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，寻求在印度禁止非政府加密货币的法案已被送至\n批准。\n\n显然，除了禁止加密货币（BTC,ETH--所有），他们想继续使用\n区块链，如Ethereum，但禁止本地货币ETH。不知道他们如何\n计划实现这一目标。\n\n这个国家有一个最快的...",
      "title": "印度的加密货币禁令法案送交内阁批准。是时候把他们投出去了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，尋求在印度禁止非政府加密貨幣的法案已被送至\n批准。\n\n顯然，除了禁止加密貨幣（BTC,ETH--所有），他們想繼續使用\n區塊鏈，如Ethereum，但禁止本地貨幣ETH。不知道他們如何\n計劃實現這一目標。\n\n這個國家有一個最快的...",
      "title": "印度的加密貨幣禁令法案送交內閣批准。是時候把他們投出去了。"
    }
  ]
}