{
  "author": "AngrySam7",
  "original_created_utc": 1626098574,
  "title": "How do ppl in the US stay sane with only 1 or 2 weeks holiday per year?",
  "created_utc": 1626116185,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In Europe it&#39;s pretty much minimum to get 4 weeks paid vacation. I live in Finland and ppl who works for the gov. or county, get even more. I have 6 weeks and 3 days paid vacation annual. The amount you get depends on the years you have worked for said employer.</p>\n\n<p>I cant imagine having just 1 or 2 weeks holiday/year, I would go insane or burnout.</p>\n\n<p>How about other countries? How much holiday you get?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/NoStupidQuestions/comments/oirviw/how_do_ppl_in_the_us_stay_sane_with_only_1_or_2/",
  "subreddit": "NoStupidQuestions",
  "id": "oirviw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In Europe it's pretty much minimum to get 4 weeks paid vacation. I live in\nFinland and ppl who works for the gov. or county, get even more. I have 6 weeks\nand 3 days paid vacation annual. The amount you get depends on the years you\nhave worked for said employer.\n\nI cant imagine having just 1 or 2…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ヨーロッパでは、4週間の有給休暇を取るのが最低条件です。私はフィンランドに住んでいます。\nフィンランドに住んでいますが、政府や郡で働いている人はさらに多くの休暇をもらえます。私は6週間と\nと3日の年次有給休暇があります。貰える金額は、その雇用主で働いた年数に\n勤続年数によって異なります。\n\n1、2日しかないなんて想像もできません...。",
      "title": "アメリカでは、1年に1～2週間の休暇しかないのに、どうやって正気を保っているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在欧洲，获得4周的带薪休假几乎是最低限度的。我住在\n我住在芬兰，为政府或县政府工作的人得到的假期甚至更多。我有6周\n和3天的带薪年假。你能得到的假期取决于你为该雇主工作的年限\n你为该雇主工作的年限。\n\n我无法想象只有1或2天的假期...",
      "title": "在美国，每年只有1或2周的假期，人们是如何保持理智的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在歐洲，獲得4周的帶薪休假幾乎是最低限度的。我住在\n我住在芬蘭，爲政府或縣政府工作的人得到的假期甚至更多。我有6周\n和3天的帶薪年假。你能得到的假期取決於你爲該僱主工作的年限\n你爲該僱主工作的年限。\n\n我無法想象只有1或2天的假期...",
      "title": "在美國，每年只有1或2周的假期，人們是如何保持理智的？"
    }
  ]
}