{
  "author": "FollowMe22",
  "the_new_excerpt": "I sold out my remaining crypto last night. Still feels surreal to me. Started\nbuying Ethereum at just above $2 in early 2016 after missing the boat on\nBitcoin. I put my whole tax return in in 2016 and threw a couple hundred at it\nwhenever I could. I didn't buy a car and biked to work to save money.…",
  "original_created_utc": 1611080391,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "昨晚我把剩余的加密币卖掉了。我还是觉得不真实。开始\n在2016年初以略高于2美元的价格买入Ethereum，在错失了机会的情况下\n比特币。2016年我把整个报税单都放进去了，扔了几百块钱。\n只要我能做到的。我没有买车，为了省钱骑车上班....。",
      "title": "在2美元的时候买了我的第一个ETH，终于完全退出了游戏。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨晚我把剩餘的加密幣賣掉了。我還是覺得不真實。開始\n在2016年初以略高於2美元的價格買入Ethereum，在錯失了機會的情況下\n比特幣。2016年我把整個報稅單都放進去了，扔了幾百塊錢。\n只要我能做到的。我沒有買車，爲了省錢騎車上班....。",
      "title": "在2美元的時候買了我的第一個ETH，終於完全退出了遊戲。"
    }
  ],
  "title": "Bought My First ETH at $2. Finally Fully Out of the Game.",
  "created_utc": 1611090225,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I sold out my remaining crypto last night. Still feels surreal to me. Started buying Ethereum at just above $2 in early 2016 after missing the boat on Bitcoin. I put my whole tax return in in 2016 and threw a couple hundred at it whenever I could. I didn&#39;t buy a car and biked to work to save money. I remember at the time thinking there was about a 1/3 chance it would 100x, so there was an asymmetrical risk/reward in my opinion. </p>\n\n<p>Sold a large chunk during the previous bull run in 2017, and sold the remaining in multiple sales this January. Averaged about a 150x on my cost basis across all sales. All long-term capital gains. Now I&#39;m 27 and financially independent. Will be buying my parents a house this year.</p>\n\n<p>I love this community and hope both the technology and price continues to improve. Thanks to everyone for making this a fun ride!</p>\n</div><!-- SC_ON -->",
  "score": 6884,
  "permalink": "/r/CryptoCurrency/comments/l0poi3/bought_my_first_eth_at_2_finally_fully_out_of_the/",
  "subreddit": "CryptoCurrency",
  "id": "l0poi3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311216175
}