{
  "author": "CheckOutMyDoubleDs",
  "the_new_excerpt": "Welcome to Part I of my Pharma Stocks Guide. I see a lot of interest in\npharmaceuticals and my goal is to provide people with a little more information\nso they can make an informed decision. Today's topic will be: The FDA Drug\nApproval Process\n\nThe FDA Drug Approval Process can be broken down into 4…",
  "original_created_utc": 1619700158,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の医薬品株ガイドのパート1にようこそ。製薬会社には多くの関心が寄せられています。\n私の目標は、皆さんに少しでも多くの情報を提供して、投資判断をしていただくことです。\n私の目標は、皆さんに少しでも多くの情報を提供し、十分な情報に基づいた決断をしていただくことです。今日のトピックは FDAの医薬品\n承認プロセス\n\nFDAの医薬品承認プロセスは、以下の4つに分けられます。",
      "title": "FDA医薬品承認プロセスの基本概要"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "欢迎来到我的医药股指南的第一部分。我看到很多人对\n我的目标是为人们提供更多的信息\n这样他们就可以做出一个明智的决定。今天的主题将是。美国食品和药物管理局的药物\n审批程序\n\n美国食品和药物管理局（FDA）的药品审批程序可以分为4个部分...",
      "title": "美国食品和药物管理局药品审批程序的基本概述"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "歡迎來到我的醫藥股指南的第一部分。我看到很多人對\n我的目標是爲人們提供更多的信息\n這樣他們就可以做出一個明智的決定。今天的主題將是。美國食品和藥物管理局的藥物\n審批程序\n\n美國食品和藥物管理局（FDA）的藥品審批程序可以分爲4個部分...",
      "title": "美國食品和藥物管理局藥品審批程序的基本概述"
    }
  ],
  "title": "Basic Overview of the FDA Drug Approval Process",
  "created_utc": 1619707652,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Welcome to Part I of my Pharma Stocks Guide. I see a lot of interest in pharmaceuticals and my goal is to provide people with a little more information so they can make an informed decision. Today&#39;s topic will be: The FDA Drug Approval Process</p>\n\n<p>The FDA Drug Approval Process can be broken down into 4 main sections: Pre-Clinical, Clinical Trials, Post Clinical, and Post Approval.</p>\n\n<h1>Pre-Clinical</h1>\n\n<ol>\n<li>A drug&#39;s journey begins in the lab where researchers will look at thousands of compounds and eventually select a few that they believe are promising.</li>\n<li>After gathering initial data on the compound the next step is further testing. This will be done either In Vitro (testing done in a petri dish/ test tube) or In Vivo (animal testing).</li>\n<li>After successful testing, the pharmaceutical company will submit an Investigational New Drug (IND) application to the FDA. This includes all of the data gathered so far and a plan for testing the drugs on humans (clinical trials).</li>\n<li>The FDA has 30 days to review the IND application and ensures human lives aren&#39;t at unreasonable risk. If the FDA accepts the IND, we move on to section 2 (Clinical Trials)</li>\n</ol>\n\n<h1>Clinical trials</h1>\n\n<p>5) <strong><em>Phase 1</em></strong> studies consist of 20-100 <strong>healthy volunteers</strong> that last for <strong>several months</strong>. The exception being a drug used in cancer patients will be studied in patients with that type of cancer. The goal is to assess <strong>safety</strong> by monitoring how the drug affects the body as a whole, how long it lasts in the body, and any side effects that may appear. Results of <strong>Phase 1 studies do not indicate effectiveness</strong>. I’ll repeat this because I believe it’s important: results of Phase 1 studies do not indicate effectiveness. As of 2018, the FDA states roughly <strong>70% of drugs will pass phase 1.</strong></p>\n\n<p>6) <strong><em>Phase 2</em></strong> studies consist of <strong>several hundreds of people with the disease/condition.</strong> Studies here typically take <strong>months- 2 years</strong>. The goal here is to observe <strong>effectiveness</strong> of the drug in the intended patient population. This is where we first get to see if the drug truly works. Safety and side effects are monitored further as well. Approximately <strong>33% pass phase 2.</strong></p>\n\n<p>7) FDA and pharmaceutical company meet to discuss plans for large scale Phase 3 studies</p>\n\n<p>8) <strong><em>Phase 3</em></strong> consists of <strong>several</strong> <strong>thousands of participants</strong>. These studies typically last <strong>1-4 years.</strong> The goal here is to continue to observe effectiveness and safety as well as seeing how different doses of the drug or in combination with other drugs affects the outcome. It is important to note that because the <strong>studies are larger and for a longer duration, the results are more likely to show long term or less common side effects.</strong> Should either happen, it almost always affects the stock negatively. <strong>Approximately</strong> <strong>25-30% of drugs will pass Phase 3.</strong></p>\n\n<h1>Post Clinical</h1>\n\n<p>9) The pharmaceutical company files a New Drug Application (NDA). The NDA tells the FDA everything about the drug up to this point. This includes Pre-Clinical data, data from all clinical trials, as well as how the drug will be manufactured, and proposed labeling.</p>\n\n<p>10) The FDA has 60 days to decide if they will accept the NDA or reject it. If accepted, the drug is now under FDA review by a review team. Each team member will review their particular portion of the NDA. For example, the medical officer reviews all clinical data, the pharmacologist reviews all Pre-Clinical data, a chemist evaluates the drug&#39;s chemical compound and stability, etc. If the NDA is rejected, the company and FDA will have to work together to resubmit a new NDA at a later date.</p>\n\n<p>11) An inspection team is sent to the manufacturing site of where the drug will be made to assess for any issues that may affect the production of the drug.</p>\n\n<p>12) After a thorough assessment of the reports from each review team member and the inspection team (<strong>typically 6-10 months</strong>), the FDA will either approve the drug or issue a Complete Response Letter (CRL) stating the drug and the application cannot be approved in its current form. This isn’t the end of the drug’s journey however, a company can work with the FDA and resubmit a NDA.</p>\n\n<h1>Post Approval</h1>\n\n<p>13) <strong>Phase 4</strong> Clinical trials (often referred to as post marketing surveillance trial). These are studies conducted in a large scale (thousands of people) to continue to monitor the safety and efficacy of the drug after FDA approval. The company is required to send periodic updates on safety and efficacy to the FDA.</p>\n\n<h1>Looking at some General Numbers</h1>\n\n<ul>\n<li>· From start (Preclinical research) to finish (FDA approval) <strong>a drug’s journey typically takes 10 years</strong></li>\n<li>· Some studies suggest the overall chance a drug gets approved is 10%. Other studies suggest 14%.</li>\n<li>· If we go by the FDA numbers, lets say we have 100 potential drugs. 70% will make it to phase 2. We now have 70 hopeful drugs and only 33% make it to phase 3. We now have 23 hopeful drugs and only 25% make it to pass phase 3. So now only 5-6 drugs have made it this far (5-6%).</li>\n<li>· These numbers don’t exactly match because certain drugs like say for your skin are easier to get approval than cancer drugs</li>\n<li>· Regardless of which approval percentage you go with, studies show 2 common themes: The <strong>FDA drug approval percentage is low</strong> and the drug <strong>approval chance for cancer drugs is extremely low (usually around 3%). Also, fuck cancer.</strong></li>\n</ul>\n\n<h1>In Summary</h1>\n\n<ul>\n<li>Preclinical Trials: the company does lab research on the drug via petri dishes or animal testing. No humans yet.</li>\n<li>IND (Investigational New Drug) application is sent to FDA. If approved we move on to clinical trials</li>\n<li>Phase 1: small group of healthy volunteers. Goal to observe safety. Timeline several months. 70% pass rate</li>\n<li>Phase 2: medium sized group of people with the intended disease/condition. Goal to observe safety AND efficacy. Timeline months - 2 years. 33% pass rate.</li>\n<li>Phase 3: Large scale study for long duration. Goal to further assess safety and efficacy. Timeline 1-4 years. 25-30% pass rate.</li>\n<li>Company then files NDA and will undergo FDA review. Hopefully approval after that.</li>\n<li>Phase 4: Studies safety and efficacy of the drug after FDA approval and in a large population.</li>\n<li>From start to finish, drug’s typically take 10 years to make</li>\n<li>The overall approval chance for a drug is quite low (10-14%)</li>\n<li>Please please be careful/contain your excitement when you see positive Phase 1 results. It really doesn’t mean much.</li>\n</ul>\n\n<p>This is a general overview of the FDA drug approval process. I hope this has been informative to some and if so, I may try to write some more quick guides in the future regarding pharmaceuticals.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/stocks/comments/n13hwg/basic_overview_of_the_fda_drug_approval_process/",
  "subreddit": "stocks",
  "id": "n13hwg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380966995
}