{
  "author": "Username-Not-A-Bot",
  "the_new_excerpt": " 1.  Bitcoin (BTC): Consumes 0.34% of the total electricity produced. The amount\n     of energy consumed by bitcoin is more than the energy that is required to\n     power all the UK tea kettles for 19 years.\n 2.  Ethereum (ETH): You just have to pay a 'small' fee to use it. But we\n     promise we…",
  "original_created_utc": 1618346808,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": " 1.  ビットコイン（BTC）。総発電量の0.34%を消費。ビットコインが消費するエネルギー量は\n     ビットコインが消費するエネルギー量は、英国のティーポットを19年間動かすのに必要なエネルギー量を上回ります。\n     ビットコインが消費するエネルギーは、英国のすべてのティーポットを19年間動かすのに必要なエネルギーよりも多い。\n 2.  イーサリアム（ETH）。使うためには「少額」の手数料を払えばいい。しかし、私たちは\n     約束します...",
      "title": "10種類の暗号通貨の面白い/正直な説明"
    },
    {
      "locale": "zh",
      "the_new_excerpt": " 1.  比特币（BTC）。占总发电量的0.34%。该金额\n     比特币所消耗的能量，要比\n     19年为英国所有茶壶提供动力。\n 2.  Ethereum（ETH）。你只需要支付少量的费用就可以使用它。但我们\n     我们保证",
      "title": "10种加密货币的有趣/诚实描述"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " 1.  比特幣（BTC）。佔總發電量的0.34%。該金額\n     比特幣所消耗的能量，要比\n     19年爲英國所有茶壺提供動力。\n 2.  Ethereum（ETH）。你只需要支付少量的費用就可以使用它。但我們\n     我們保證",
      "title": "10種加密貨幣的有趣/誠實描述"
    }
  ],
  "title": "A funny/honest description of 10 Cryptocurrencies",
  "created_utc": 1618366639,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><ol>\n<li><strong>Bitcoin (BTC):</strong> Consumes 0.34% of the total electricity produced. The amount of energy consumed by bitcoin is more than the energy that is required to power all the UK tea kettles for 19 years. </li>\n<li><strong>Ethereum (ETH):</strong> You just have to pay a &#39;small&#39; fee to use it. But we promise we are working on it. Pay 30$ to send a 100$.</li>\n<li><strong>Binance Coin (BNB):</strong> We are like the shovel manufacturer in the gold rush of crypto. We are the exact opposite of what crypto tends to be, but hey, people are making money so who cares.</li>\n<li><strong>Ripple (XRP):</strong> We have the worlds most toxic youtube community, but banks sure love us.</li>\n<li><strong>Cardano (ADA):</strong> The year is 2070, still waiting for smart contracts and birds keep singing.</li>\n<li><strong>Dogecoin (DOGE):</strong> Outperforming most cryptos while being a complete joke. We brought a lot of people over to <a href=\"/r/CryptoCurrency\">r/CryptoCurrency</a> and people hate our profit.</li>\n<li><strong>Polkadot (DOT):</strong> We only have a limited number of parachains available and slot are sold via auction. So smaller use cases? I think not.</li>\n<li><strong>Bitcoin Gold (BTG):</strong> We are only being bought when people mistake us for Bitcoin.</li>\n<li><strong>Chiliz (CHZ):</strong> Our marketing is done only when drunk. When we are in the red for just one day, our community drops us faster then snoopdog when it`s hot.</li>\n<li><a href=\"https://Crypto.org\"><strong>Crypto.org</strong></a> <strong>Coin:</strong> We are in the top 25. &#39;How?&#39; Ask our custommer support. They will get back to you within a few months.</li>\n</ol>\n\n<p>Describe your favorite coin in a honest or funny way!</p>\n</div><!-- SC_ON -->",
  "score": 370,
  "permalink": "/r/CryptoCurrency/comments/mqb7l0/a_funnyhonest_description_of_10_cryptocurrencies/",
  "subreddit": "CryptoCurrency",
  "id": "mqb7l0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566615670
}