{
  "author": "RelationshipWhiplash",
  "original_created_utc": 1655881684,
  "title": "Can someone explain what a royal court is/was?",
  "created_utc": 1655920933,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I love royal history but I’m wondering what a court was. So is this like a castle where nobility just hung out everyday? Did nobles live at court or did they have their own homes near by maybe? Were they there all day just chillin and walking the halls talking shit? &lt;/p&gt;\n\n&lt;p&gt;Also why was gossiping allowed?! Is court not a castle? Is it not where the king and queen lived? Or did they live somewhere else? Because they just let people walk around their homes talking shit about them all day, gossiping? &lt;/p&gt;\n\n&lt;p&gt;Also was court a public place or just for VIPs like nobles? Could common people go to court? &lt;/p&gt;\n\n&lt;p&gt;Or do I have it all wrong? &lt;/p&gt;\n\n&lt;p&gt;Also do courts exist today and when was the last one?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/vhz2n8/can_someone_explain_what_a_royal_court_iswas/",
  "subreddit": "AskHistorians",
  "id": "vhz2n8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So I love royal history but I’m wondering what a court was. So is this like a\ncastle where nobility just hung out everyday? Did nobles live at court or did\nthey have their own homes near by maybe? Were they there all day just chillin\nand walking the halls talking shit?\n\nAlso why was gossiping…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから王家の歴史は好きなんだけど、宮廷ってなんだったんだろう。つまり、貴族が毎日集まるお城のようなものなのでしょうか？\n貴族が毎日たむろするお城のようなものですか？貴族は宮廷に住んでいたのでしょうか？\nそれとも近くに自分の家があったのでしょうか？一日中そこにいて、くつろいだり\nとか、ホールを歩きながらくだらない話をしていたのでしょうか？\n\nまた、なぜゴシップを...",
      "title": "王宮とは何か、誰か説明してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我喜欢皇家历史，但我想知道宫廷是什么。那么这是不是像一个\n城堡，贵族们每天都在那里闲逛？贵族们是住在宫廷里还是\n他们在附近有自己的家吗？他们是否整天都在那里闲逛？\n和走在大厅里谈天说地？\n\n还有，为什么闲聊......",
      "title": "谁能解释一下什么是/什么是皇家法庭？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我喜歡皇家歷史，但我想知道宮廷是什麼。那麼這是不是像一個\n城堡，貴族們每天都在那裏閒逛？貴族們是住在宮廷裏還是\n他們在附近有自己的家嗎？他們是否整天都在那裏閒逛？\n和走在大廳裏談天說地？\n\n還有，爲什麼閒聊......",
      "title": "誰能解釋一下什麼是/什麼是皇家法庭？"
    }
  ]
}