{
  "author": "EclipseGT89",
  "original_created_utc": 1629200118,
  "title": "Paypal in my country is banned. Crypto allows me to have a financial connection with other countries.",
  "created_utc": 1629218157,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Turkey banned Paypal in 2016 because of some bullshit &quot;regulations&quot;. In reality it&#39;s our president trying to cut the people&#39;s ties with the world economy because he wants to have financial, political and social monopoly over us. I wasn&#39;t able to buy or order anything that was outside of Turkey without some sketchy middleman or site, <strong>until now</strong>. </p>\n\n<p>Yesterday I ordered myself some swimming shorts, luckily the seller was familiar with crypto and accepted it. I know it may not seem like a big deal for you guys but the fact that I could trade freely was such a relieving feeling.</p>\n\n<p>There was no middleman, no government monitoring my actions, no centralized bank who had authority over my assets, just me and a seller. With more people and businesses adopting crypto, all of this will be more widespread.</p>\n\n<p><strong>Crypto is inevitable.</strong></p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/p61zd7/paypal_in_my_country_is_banned_crypto_allows_me/",
  "subreddit": "CryptoCurrency",
  "id": "p61zd7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Turkey banned Paypal in 2016 because of some bullshit \"regulations\". In reality\nit's our president trying to cut the people's ties with the world economy\nbecause he wants to have financial, political and social monopoly over us. I\nwasn't able to buy or order anything that was outside of Turkey…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "トルコは2016年、デタラメな「規制」のためにPaypalを禁止しました。実際には\n大統領が国民と世界経済のつながりを断ち切ろうとしているのです。\nなぜなら、彼は私たちを金融的、政治的、社会的に独占したいからです。I\nはトルコ以外の国のものを買ったり注文したりすることができなかった...。",
      "title": "私の国ではPayPalが禁止されています。暗号を使うことで、他の国との金融関係を持つことができます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "土耳其在2016年禁止了支付宝，因为一些狗屁 \"规定\"。实际上\n这是我们的总统试图切断人民与世界经济的联系\n因为他想对我们进行金融、政治和社会垄断。I\n无法购买或订购土耳其以外的任何东西......",
      "title": "在我的国家，Paypal被禁止了。Crypto使我能够与其他国家建立金融联系。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "土耳其在2016年禁止了支付寶，因爲一些狗屁 \"規定\"。實際上\n這是我們的總統試圖切斷人民與世界經濟的聯繫\n因爲他想對我們進行金融、政治和社會壟斷。I\n無法購買或訂購土耳其以外的任何東西......",
      "title": "在我的國家，Paypal被禁止了。Crypto使我能夠與其他國家建立金融聯繫。"
    }
  ]
}