{
  "author": "Fantastic-Cucumber-1",
  "the_new_excerpt": "What is a smart contract? How do smart contracts work? And what are they good\nfor? I'll try to answer these questions in this post.\n\n\nWHAT ARE SMART CONTRACTS?\n\nA smart contract is an agreement between two or more parties in the form of\ncomputer code. The contracts are stored on the blockchain and…",
  "original_created_utc": 1616833339,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "什么是智能合约？智能合约是如何运作的？它们又有什么好处？\n为？我将在这篇文章中试着回答这些问题。\n\n\n什么是智能合约？\n\n智能合约是指双方或多方以下列形式达成的协议。\n计算机代码。合同存储在区块链上，并...",
      "title": "德菲解释说。智能合约"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "什麼是智能合約？智能合約是如何運作的？它們又有什麼好處？\n爲？我將在這篇文章中試着回答這些問題。\n\n\n什麼是智能合約？\n\n智能合約是指雙方或多方以下列形式達成的協議。\n計算機代碼。合同存儲在區塊鏈上，並...",
      "title": "德菲解釋說。智能合約"
    }
  ],
  "title": "DeFi explained: Smart contracts",
  "created_utc": 1616841029,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What is a smart contract? How do smart contracts work? And what are they good for? I&#39;ll try to answer these questions in this post.</p>\n\n<h2>What are smart contracts?</h2>\n\n<p>A smart contract is an agreement between two or more parties in the form of computer code. The contracts are stored on the blockchain and cannot be changed. Transactions that take place in a smart contract are processed by the blockchain, which means they can be sent automatically without the intervention of a third party. When you enter into an agreement with a smart contract, no confidential advisor is required. The transactions only take place if the conditions in the agreement are met.</p>\n\n<h2>What can smart contracts do?</h2>\n\n<p>Smart contracts help you exchange money, stock or anything else of value in a transparent, trustless manner, all while avoiding the services of an intermediary and the possibility of conflict. Smart contracts provide you:</p>\n\n<ul>\n<li>Autonomy - You are the one who makes the deal and you don&#39;t have to rely on an intermediary to confirm transactions. The execution is automatically managed by a decentralized network, which excludes manipulation of contracts.</li>\n<li>Speed ​​- Automated contracts can save you hours on manual paperwork.</li>\n<li>Security - Smart contracts are secured with similar cryptography that encrypts websites. In short, it keeps your documents safe.</li>\n<li>Savings - Because they disable the presence of an intermediary, smart contracts can save you a lot of money. Where, for example, you would normally have to pay a notary to witness your transaction, this is now regulated by the blockchain.</li>\n<li>Backup - Unlike files on your computer, data on the blockchain is duplicated many times over. So you do not have to be afraid of losing something that is registered on the blockchain. Also, there is no way anyone can say they lost the contract or the dog ate it.</li>\n</ul>\n\n<h2>A smart contract in effect</h2>\n\n<p>As an example; If you were to register cinema tickets on the blockchain using a smart contract, then as a visitor you will receive the tickets in your personal wallet. You only have to show the address to which the tickets were sent upon entry and the cinema can immediately be sure that you do not have any fake tickets and that you have actually paid for your tickets. This gives a better customer experience and the cinema can save a lot of costs in this way because it no longer needs ticket processing services.</p>\n\n<h2>But why is this so safe?</h2>\n\n<p>Thanks to blockchain technology, we can decentralize smart contracts so that they are fair and trusted. Decentralization means that they are not controlled by one central party, such as a bank or the government. </p>\n\n<p>The blockchain is a shared database managed by many different computers (nodes). As a result, not one person or company has control over it. It also means that it is almost impossible to hack it and therefore smart contracts can be executed securely and automatically without anyone being able to change them.</p>\n\n<h2>Best practices for smart contracts</h2>\n\n<p>In principle, smart contracts can be used for any type of transaction, it does not have to be financial. Here are some industries where smart contracts can be used conveniently.</p>\n\n<h2>Insurances</h2>\n\n<p>The insurance world could be shaken up considerably by blockchain technology. An existing example of a smart contract is a project run by a French insurance company called AXA. AXA offers flight insurance that is paid out if the policyholder&#39;s flight is delayed by more than two hours. AXA is currently running a pilot project that pays out insurance via smart contracts on the Ethereum blockchain.</p>\n\n<p>The smart contract works with an “if / then function”: IF the flight is delayed by more than two hours, THEN the policyholder will be paid. Because the smart contract is connected to a database that keeps track of flight times, the function can be performed automatically and paid for via the Ethereum blockchain. This saves a lot of time for AXA, but also for the policyholder. This is just one example of the many options that smart contracts offer.</p>\n\n<h2>Healthcare</h2>\n\n<p>Within healthcare, smart contracts will be used to record and securely transfer data. We can already see examples of smart contracts used in the medical industry, such as the company Encrypgen, for example. This is an application that uses blockchain to transfer patient data in a secure manner, eliminating the need for third-party access. In this way, the patients are in control of their own data. If researchers want to use patient data, they have to pay for it. The patient also chooses whether the data may be sold or not.</p>\n\n<h2>Governments</h2>\n\n<p>Governments guarantee that it is extremely difficult to manipulate the voting system, but despite that, smart contracts could alleviate all concerns by providing an infinitely more secure system. Smart contracts could also prevent low voter turnout. Much of the small turnout is due to a clunky system consisting of lining up a queue, showing your identity, and filling out forms. With the use of smart contracts, anyone can transfer their votes securely online, which is expected to generate much more response.</p>\n\n<h2>Business management</h2>\n\n<p>There is still a lot of room for improvement within business management and smart contracts can help a lot. Why do administration when everything is registered on the blockchain anyway? Right, the blockchain is already doing the work for you. You also do not have to make a pay slip every month. The money automatically goes to your employees as soon as they have fulfilled the agreements. Companies can simply set up a smart contract that states: IF the date is 10/20/2020, THEN $2500 will be sent to employee A. This means that employees will always be paid on time and that they will never be underpaid. The advantage of the company is that it is all automated, saving them a lot of time and money!</p>\n\n<h2>Fundraising (ICOs)</h2>\n\n<p>In principle, anyone could create their own token and sell it to the general public in order to raise money for a project. In 2017 there was a real ICO craze, where some projects managed to raise tens of millions within hours. There was even an EOS ICO that lasted for a year and racked up more than $ 4 billion in total!</p>\n\n<p>If you want to organize an ICO (Initial Coin Offering) you create a token and a contract to sell the token. The function of the smart contract in this case would be: if person A sends an X amount of ETH, person A gets an X amount of tokens.</p>\n\n<h2>Smart contracts in a nutshell</h2>\n\n<p>The most important features of a smart contract are:</p>\n\n<ul>\n<li>Digital Agreement - A smart contract is an agreement in the form of computer code.</li>\n<li>Blockchain - Transactions are processed by a public database, based on blockchain technology.</li>\n<li>Confidentiality - A transaction can only take place if the conditions in the agreement are met.</li>\n</ul>\n\n<h2>Conclusion</h2>\n\n<p>It will be a while before smart contracts are everywhere in everyday life, but we can say with some certainty that the technology has a lot to offer.</p>\n\n<p>I hope this post helped you with:</p>\n\n<ul>\n<li>Getting a better understanding of smart contracts</li>\n<li>Understanding the significance of smart contracts within the crypto space.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>Wondering which crypto wallet you need? Check my post about wallets <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/mdjsrj/defi_explained_defi_wallets/\">here</a>.</p>\n</div><!-- SC_ON -->",
  "score": 3948,
  "permalink": "/r/CryptoCurrency/comments/me9p7h/defi_explained_smart_contracts/",
  "subreddit": "CryptoCurrency",
  "id": "me9p7h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357137104
}