{
  "author": "hotchilidamo",
  "original_created_utc": 1636792489,
  "title": "How has crypto changed you?",
  "created_utc": 1636806913,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I noticed that while a lot of people seem to be focused on Black Friday deals and the shit they can buy, I’m here thinking about what I would invest with my money instead. </p>\n\n<p>I used to have a long list of stuff I wanted, new boots, new clothes, new watch, new anything. Now I’m not bothered, now I’m focused on making my money work for me. It feels like a fundamental shift.</p>\n\n<p>Not all of us have lambos or life changing money… yet, but if you’ve been doing this a while now, I bet it has changed your mindset in some way.</p>\n\n<p>How has crypto changed you?</p>\n</div><!-- SC_ON -->",
  "score": 205,
  "permalink": "/r/CryptoCurrency/comments/qswzjt/how_has_crypto_changed_you/",
  "subreddit": "CryptoCurrency",
  "id": "qswzjt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I noticed that while a lot of people seem to be focused on Black Friday deals\nand the shit they can buy, I’m here thinking about what I would invest with my\nmoney instead.\n\nI used to have a long list of stuff I wanted, new boots, new clothes, new watch,\nnew anything. Now I’m not bothered, now I’m…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人がブラックフライデーのお得な情報や、買えるものに注目しているようですが、私はここで、自分が何に投資するかを考えていました。\n買うことに集中しているようですが、私はここで、自分のお金で何を投資するかを考えています。\n私はここで、自分のお金で何を投資するかを考えています。\n\n私は以前、欲しいものの長いリストを持っていました。新しいブーツ、新しい服、新しい時計。\n新しいものなら何でも。でも、今は気にしていません。",
      "title": "暗号はあなたをどのように変えましたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我注意到，当很多人似乎都在关注黑色星期五的交易和他们可以买到的东西时\n和他们能买到的东西，而我却在这里思考我将用我的钱投资什么\n钱来投资。\n\n我曾经有一个长长的清单，列出我想要的东西，新靴子、新衣服、新手表。\n新的任何东西。现在我不烦了，现在我...",
      "title": "加密货币如何改变了你？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我注意到，當很多人似乎都在關注黑色星期五的交易和他們可以買到的東西時\n和他們能買到的東西，而我卻在這裏思考我將用我的錢投資什麼\n錢來投資。\n\n我曾經有一個長長的清單，列出我想要的東西，新靴子、新衣服、新手錶。\n新的任何東西。現在我不煩了，現在我...",
      "title": "加密貨幣如何改變了你？"
    }
  ]
}