{
  "author": "NoPie8947",
  "original_created_utc": 1635886331,
  "title": "Top 30+ stablecoins (crypto) explained in one sentence",
  "created_utc": 1635935865,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For new people in crypto: the different stablecoins in one sentence sorted by market cap. Hope it helps newcomers in the crypto jungle.</p>\n\n<p>It is not uncommon for stables to lose their pegs to the US$.</p>\n\n<p><strong>1. USDT / Tether</strong></p>\n\n<p>Centralized, backed by 1:? US$, FUD resistant &amp; Bitfinex BFF. Seems to be covered in Teflon.</p>\n\n<p><strong>2. USDC / USD Coin</strong></p>\n\n<p>Centralized, backed by 1:1 US$ &amp; Coinbase BFF.</p>\n\n<p><strong>3. BUSD / Binance USD</strong></p>\n\n<p>Centralized, backed by 1:1 US$ &amp; Binance BFF.</p>\n\n<p><strong>4. DAI / Dai</strong></p>\n\n<p>Decentralized (MKR), backed by ETH + USDC &amp; decentralized fanatics BFF.</p>\n\n<p><strong>5. UST / TerraUSD</strong></p>\n\n<p>Decentralized (LUNA), algorithmically backed by Luna &amp; it just simply works.</p>\n\n<p><strong>6. MIM / Magic Internet Money</strong></p>\n\n<p>Decentralized (SPELL), backed by interest-bearing tokens (complicated) &amp; wins the internet by name.</p>\n\n<p><strong>7. True USD / TUSD</strong></p>\n\n<p>Centralized, backed by 1:1 US$, escrow balance &amp; takes transparency to the next level for a centralized entity.</p>\n\n<p><strong>8. USDP / Pax Dollar</strong></p>\n\n<p>Centralized, backed by 1:1 US$, addresses the corporate onboarding process of crypto (i.e. companies moving assets to the blockchain). TIP: Great coin to keep watch on the MC for the onboarding process by US companies.</p>\n\n<p><strong>9. LUSD / Liquity USD</strong></p>\n\n<p>(Semi) Decentralized (LQTY). LQTY serves as a token to capture fee revenue generated by the protocol (dividend) and not governance. LUSD is backed by ETH. Charges flat-fees for issuing their tokens, this fee is redistributed to LQTY (onboarding volume matters on this one).</p>\n\n<p><strong>10. USDN / Neutrino USD</strong></p>\n\n<p>Decentralized (NSBT), algorithmically backed by WAVES, currently only compatible on WAVES blockchain.</p>\n\n<p><strong>11. FEI / FEI USD</strong></p>\n\n<p>Decentralized (TRIBE), algorithmically backed by smart-contracts (PCV) that give the protocol “value”. Basically, it is backed by the treasuries and funds from other projects. Technically very complicated to explain also from a risk perspective.</p>\n\n<p><strong>12. FRAX / Frax</strong></p>\n\n<p>Decentralized (FXS), backed by stables (USDC) algorithmically. Backing ratio is not 1:1, as it algorithmically stabilizes itself, so the collateral can be “floating”. Solves a token becoming off-peg rapidly, but the collateral will not always be there in “cash”.</p>\n\n<p><strong>13. HUSD / Stable Universal</strong></p>\n\n<p>Centralized, backed by 1:1 US$, very similar to USDP (#8) as it uses their infrastructure. Difference is that the money is backed by a trust company in U.S. instead of Escrow.</p>\n\n<p><strong>14. ALUSD / Alchemix USD</strong></p>\n\n<p>Decentralized (ALCX), backed by 1:1 stables (DAI). The collateral (DAI) you leave for the protocol autocompounds on different platform and “tokenizes” your future yield. Basically, you borrow their token alUSD with DAI, and will not get liquidated (DAI) because your debt is paid overtime. Theoretically, can earn you yield on alUSD you have already spent. They maintain the peg algorithmically by disabling features on their platform. It’s one of the more complicated on this list.</p>\n\n<p><strong>15. SUSD / sUSD</strong></p>\n\n<p>Decentralized (SNX), backed by SNX. SNX is a platform where you can trade synthetic assets (read: not the real deal, but as plastic fantastic as you can get). By staking SNX on the platform, you can accrue debt and obtain sUSD, which you are free to use on their exchange or trade with on supported blockchains. Algorithmically maintains the peg, by changing the minting and debt of the participants of the staking programme in relation to SNX price.</p>\n\n<p><strong>16. USDX / USDX</strong></p>\n\n<p>Decentralized (KAVA), backed by a basket of crypto (KAVA, BNB, BTC, XRP, etc.). Deposit your crypto, and in exchange you get USDX. Maintains peg by liquidating assets and buying back USDX (when market goes down).</p>\n\n<p><strong>17. GUSD / Gemini Dollar</strong></p>\n\n<p>Centralized, backed by 1:1 US$, trust company.</p>\n\n<p><strong>18. VAI / Vai</strong></p>\n\n<p>Decentralized (XVS), backed by a basket of crypto (XVS, SXP, BNB, USDC, etc.). Used to be Binance’s favorite cousin until a hack. After hack, Binance denies XVS being family and that it is more like Quasimodo. Ever since has never regained US$ peg.</p>\n\n<p><strong>19. MUSD / mStable USD</strong></p>\n\n<p>Decentralized (MTA), backed by crypto stables (DAI, USDC, USDT, etc.). Borrow, lending, swapping. Maintains peg due to the other stables that is backing it. Risk when any of the majors lose peg (incentivizes liquidity drain for the swapping functionality).</p>\n\n<p><strong>20. CUSD / Cello Dollar</strong></p>\n\n<p>(Semi) Decentralized (CELO), backed by crypto (ETH) and lives on its own Celo Blockchain. Supposed to be a blockchain for fast transactions (retail).</p>\n\n<p><strong>21. EURS / Stasis Euro</strong></p>\n\n<p>Centralized, backed by 1:1 EUR€, located in Malta. Aims to be “transparent”.</p>\n\n<p><strong>22. SERU / sEUR</strong></p>\n\n<p>Exactly same mechanic as sUSD (#15) but then in Euro. Synthethix (SNX) is behind it.</p>\n\n<p><strong>23.USDP / USDP Stablecoin</strong></p>\n\n<p>Decentralized (DUCK), backed by EURS (#21). Borrow and lending protocol.</p>\n\n<p><strong>24. MAI / MIMATIC</strong></p>\n\n<p>Decentralized (QI), backed by a basket of crypto (most notably MATIC). Algorithmically pegged.</p>\n\n<p><strong>25. EURT / Eur Tether</strong></p>\n\n<p>Same as USDT (#1) but then for Euro’s. BFF with Bitfinex.</p>\n\n<p><strong>26. CEUR / Celor Euro</strong></p>\n\n<p>Same as CUSD (#20) but then for Euro’s. Designed for retail transactions.</p>\n\n<p><strong>27. USDK / USDK</strong></p>\n\n<p>Centralized, backed by 1:1 US$, currency of OKExChain (OKT) [same for BUSD for BNB]. OKT is the poormans version of a blockchain. OKEx BFF.</p>\n\n<p><strong>28. KRT / TerraKRW</strong></p>\n\n<p>Same as UST (#5) but then for the Korean Won (crypto is huge there).</p>\n\n<p><strong>29. OUSD / Origin Dollar</strong></p>\n\n<p>(Semi) Decentral (OGN), backed by 1:1 by stables (USDT, USDC and DAI). Origin Protocol is behind it (addresses p2p and e-commerce transactions). Main gimmick is that it allows to earn yield while in wallet.</p>\n\n<p><strong>30. TRYB / BiLira</strong></p>\n\n<p>Centralized, backed by 1:1 Turskish Lira. Probably the most inflationary stable on this list. Crypto is big in Turkey because of inflation (sidenote: they love AVAX over there).</p>\n\n<p><strong>31. RSV / Reserve</strong></p>\n\n<p>(Semi) Decentral (RSR/RSt), backed by equal parts of USDC, TUSD and PAX.</p>\n\n<p><strong>32. sEuro / Standard Euro</strong></p>\n\n<p>(Semi) Decentralized (TST), backed by crypto and assets (BTC, ETH, Gold, Silver, etc.). Early stage, the main gimmick is to mint more sEuro’s as the price of the collateral rises without selling the underlying asset. Algorithmically pegged.</p>\n\n<p><strong>33. WUSD / Wault USD</strong></p>\n\n<p>Decentralized (?) (long, long, long story), backed by 1:? USDT (1#).</p>\n\n<p><strong>34. IRON / Iron</strong></p>\n\n<p>Past: Decentralized (TITAN), an algorithmic stable backed by TITAN, hurt Mark Cuban&#39;s feelings and a LOT of people lost money on it.</p>\n\n<p>Present: Decentralized (ICE), backed by 1:1 USDC, Mark Cuban is not over his feelings being hurt and has a crusade against crypto now &amp; “Crypto Rewind: Top 10 biggest disappointments of 2021.”</p>\n\n<p>--------------</p>\n\n<p>Missed any? See mistakes? Let me know. Made this list while researching a project (it’s also on the list, no shill intended).</p>\n</div><!-- SC_ON -->",
  "score": 249,
  "permalink": "/r/CryptoCurrency/comments/qldxhp/top_30_stablecoins_crypto_explained_in_one/",
  "subreddit": "CryptoCurrency",
  "id": "qldxhp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For new people in crypto: the different stablecoins in one sentence sorted by\nmarket cap. Hope it helps newcomers in the crypto jungle.\n\nIt is not uncommon for stables to lose their pegs to the US$.\n\n1. USDT / Tether\n\nCentralized, backed by 1:? US$, FUD resistant & Bitfinex BFF. Seems to be\ncovered…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号の初心者のために：様々な安定したコインを1つの文章でソートしています。\n時価総額 crypto jungleの新参者の助けになれば幸いです。\n\nステーブルコインが米ドルへのペッグを失うことは珍しいことではありません。\n\n1. USDT / テザー\n\n中央化され、1:? US$、FUDに強い、BitfinexのBFF。されているようだ。\n網羅されているように見える...",
      "title": "トップ30以上の安定コイン（暗号）を1文で説明"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于加密货币的新人们：按市值排序的不同稳定币的一句话。\n市值。希望它能帮助加密货币丛林中的新人。\n\n稳定币失去与美元挂钩的情况并不少见。\n\n1. USDT / Tether\n\n集中化，由1：? 美元，抵制FUD和Bitfinex BFF。看上去是\n覆盖...",
      "title": "一句话解释30多个稳定币(加密货币)排行榜"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於加密貨幣的新人們：按市值排序的不同穩定幣的一句話。\n市值。希望它能幫助加密貨幣叢林中的新人。\n\n穩定幣失去與美元掛鉤的情況並不少見。\n\n1. USDT / Tether\n\n集中化，由1：? 美元，抵制FUD和Bitfinex BFF。看上去是\n覆蓋...",
      "title": "一句話解釋30多個穩定幣(加密貨幣)排行榜"
    }
  ]
}