{
  "author": "Dr_Mike_Hunt_MD",
  "the_new_excerpt": "For example how come I've never seen signs and arguments that were pro-adoption,\nor anti poverty in these types of crowds? Poverty cause suffering and pain in\nchildren in many different ways, does it not? If all life is precious in thier\neyes how come they get to pick and choose which life is more…",
  "original_created_utc": 1611937120,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "比如我怎么从来没有看到过支持收养的标语和论调。\n在这类人群中，还是反贫困？贫困造成的痛苦\n儿童在许多不同的方式，不是吗？如果所有的生命都是宝贵的，在他们的\n他们的眼睛怎么会选择哪种生活更... ...",
      "title": "为什么主张未出生的孩子的人，不也是主张从子宫里出来的苦难孩子吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比如我怎麼從來沒有看到過支持收養的標語和論調。\n在這類人羣中，還是反貧困？貧困造成的痛苦\n兒童在許多不同的方式，不是嗎？如果所有的生命都是寶貴的，在他們的\n他們的眼睛怎麼會選擇哪種生活更... ...",
      "title": "爲什麼主張未出生的孩子的人，不也是主張從子宮裏出來的苦難孩子嗎？"
    }
  ],
  "title": "Why do people who advocate for unborn children, not also advocate for the suffering children out of the womb?",
  "created_utc": 1611956998,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For example how come I&#39;ve never seen signs and arguments that were pro-adoption, or anti poverty in these types of crowds?  Poverty cause suffering and pain in children in many different ways, does it not? If all life is precious in thier eyes how come they get to pick and choose which life is more precious? I genuinely don&#39;t get it at all. </p>\n\n<p>Why not hold up signs for foster care companies or early intervention programs instead of hateful messages towards women? </p>\n\n<p>Neither can advocate for themselves all that much. If a baby goes hungry due to poverty and dies, wouldn&#39;t it also be considered murder to them? I&#39;m not making any political statements I&#39;m just trying to understand.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/l7wlwk/why_do_people_who_advocate_for_unborn_children/",
  "subreddit": "TooAfraidToAsk",
  "id": "l7wlwk",
  "is_self": true,
  "media": null,
  "is_video": false
}