{
  "author": "kwally89",
  "the_new_excerpt": "Back in 2016 when I had no money and was a poor graduate student working 60hr a\nweek in lab, I decided to buy Bitcoin. Maybe I was a bit late to the game as my\nother nerdy gaming buddies had been buying and selling since 2010, but I didn’t\nhave the balls to join. Well, against the advice of my…",
  "original_created_utc": 1612538058,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "早在2016年，当我没有钱，还是一个贫困的研究生，工作60小时一。\n在实验室的一周里，我决定购买比特币。也许我是有点晚了，因为我的...\n其他宅男游戏好友从2010年就开始买卖，但我没有\n有胆量加入。好吧，不顾我的建议... ...",
      "title": "2016年买的，作为一个低劣的穷研究生，继续在过山车上小买。是我一生中最好的投资。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "早在2016年，當我沒有錢，還是一個貧困的研究生，工作60小時一。\n在實驗室的一週裏，我決定購買比特幣。也許我是有點晚了，因爲我的...\n其他宅男遊戲好友從2010年就開始買賣，但我沒有\n有膽量加入。好吧，不顧我的建議... ...",
      "title": "2016年買的，作爲一個低劣的窮研究生，繼續在過山車上小買。是我一生中最好的投資。"
    }
  ],
  "title": "Bought in 2016 as a lowly poor graduate student and continued small buys on the rollercoaster. Best investment of my life.",
  "created_utc": 1612571913,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Back in 2016 when I had no money and was a poor graduate student working 60hr a week in lab, I decided to buy Bitcoin. Maybe I was a bit late to the game as my other nerdy gaming buddies had been buying and selling since 2010, but I didn’t have the balls to join. Well, against the advice of my “rational” friends and family, I bought a substantial amount (for my wallet) in 2016. Somehow... I resisted the urge to sell when it skyrocketed in 2017. That was a lot of money for me at the time, and everyone who told me to NOT buy a year prior was telling me to sell. </p>\n\n<p>Here I am today continuing to hold through all the volatility and continuing to make small incremental buys. Best decision I’ve ever made. I have no plan to sell if it reaches $100k, $200k, or even a million. This is an investment for future generations. </p>\n\n<p>I often lurk this and other subreddits without posting and just want to say thank you. Cheers!</p>\n</div><!-- SC_ON -->",
  "score": 251,
  "permalink": "/r/Bitcoin/comments/ld97w5/bought_in_2016_as_a_lowly_poor_graduate_student/",
  "subreddit": "Bitcoin",
  "id": "ld97w5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123190807
}