{
  "author": "Professional-Tax6782",
  "original_created_utc": 1642147947,
  "title": "My(17m)gf(17f) started crying after she orgasmed. I don't know what to do?",
  "created_utc": 1642173734,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hear  me out. Me and my gf are Indians and we both are science students. We are each other firsts. Romance between teens is not a common thing from where we are. But we both are mature enough to realize it&amp;#39;s okay if both of us feel comfortable about it.\nWe both talk abot everything and hesitation and miscommunication has no place in our relationship.\nThe only physical romance we do is kiss and we try different types of kiss every time, she is comfortable about speaking about kisses and has a favorite type of kiss too. And from this year we decided to take things to a next level. But the privacy we get to do things is very little. So we decided to start things with oral sex. \nAnd we decided to guide others during our 1st time even though its awkward. She gave me a Blow job and I went down on her. She guided me but I thing I made orgasm. She shaked and she said she came and started crying immediately. I went from feeling proud to feeling guilty. I immediately hugged her said everything was okay and she kept weeping and said she doesn&amp;#39;t want to do it again. I agreed and she had to leave to her home after sometime. And the next day morning she said she was sorry for what happened and she said she liked it and want to do it again. I don&amp;#39;t know what to do.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 119,
  "permalink": "/r/TooAfraidToAsk/comments/s3n6gn/my17mgf17f_started_crying_after_she_orgasmed_i/",
  "subreddit": "TooAfraidToAsk",
  "id": "s3n6gn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Hear me out. Me and my gf are Indians and we both are science students. We are\neach other firsts. Romance between teens is not a common thing from where we\nare. But we both are mature enough to realize it's okay if both of us feel\ncomfortable about it. We both talk abot everything and hesitation…"
}