{
  "author": "Irichcrusader",
  "original_created_utc": 1630657300,
  "title": "How did the Ottoman army go from being 'the terror of Europe' to a laughing stock?",
  "created_utc": 1630675794,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We often hear how the Ottoman army (and the empire as a whole) failed to keep pace with military and scientific developments in Europe. As such, they went from being at one time &#39;the terror of Europe&#39; where their armies were nearly always victorious, to almost a laughing stock by the start of the 18th century. How much truth is there to this? Did they really fail to keep pace with the development of gunpowder armies in Europe or was there something more going on?</p>\n\n<p>The era in question that I&#39;m talking about is (roughly) from the late 16th century to the end of the 17th century, or from about the battle of Lepanto (1571) to the end of the Great Turkish War (1683-1699). Prior to then, the Ottoman army has been described as being one of the best organized in the world. They were almost unstoppable everywhere they went. Nicopolis, Varna, Kosovo, Mohacs, and dozens of other smaller battles where they didn&#39;t just win but practically annihilated their enemies. They had a few setbacks true, but these were mostly in sieges. It isn&#39;t until we get to the Long Turkish War (1593-1606) that we begin to see a noticible drop in their ability to prosecute successful land campaigns. This was a badly run war on both sides, and in the one major land battle of the war at Keresztes, it appears to have to have been a very close victory for the Ottomans, who only won because the Imperial troops stopped fighting to pillage the Ottoman camp, only to be routed themselves. They would have one last hurrah moment with the second siege of Vienna, but with their defeat there they would begin slowly falling back. </p>\n\n<p>So, to summarize, I guess what I&#39;m asking, in general, is how the rot set in with the Ottoman Empire. More specifically, I&#39;m asking was there a real drop in the quality and organization of their armies or did they just fail to modernize enough? I&#39;m going to throw a guess that the questions are somehow related.</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/ph0yzm/how_did_the_ottoman_army_go_from_being_the_terror/",
  "subreddit": "AskHistorians",
  "id": "ph0yzm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We often hear how the Ottoman army (and the empire as a whole) failed to keep\npace with military and scientific developments in Europe. As such, they went\nfrom being at one time 'the terror of Europe' where their armies were nearly\nalways victorious, to almost a laughing stock by the start of the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "オスマン帝国の軍隊（および帝国全体）が、ヨーロッパの軍事的・科学的発展についていけなかったという話はよく聞きます。\nヨーロッパの軍事的、科学的発展に追いつけなかった。そのため、オスマン帝国は\n一時は「ヨーロッパの恐怖」と呼ばれ、その軍隊はほとんど常に勝利を収めていましたが\nそのため、一時は「ヨーロッパの恐怖」と呼ばれ、その軍隊はほぼ常に勝利を収めていたのですが、19世紀初頭にはほとんど笑いものにされてしまいました。",
      "title": "ヨーロッパの恐怖」と言われたオスマン・トルコ軍は、どのようにして笑いものになったのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们经常听到奥斯曼帝国的军队（以及整个帝国）如何未能跟上欧洲的军事和科学发展。\n军队（以及整个帝国）未能跟上欧洲军事和科学发展的步伐。因此，他们从\n他们曾一度是 \"欧洲的恐怖\"，他们的军队几乎总是取得胜利。\n他们从一度是 \"欧洲的恐怖\"，他们的军队几乎总是取得胜利，到后来几乎成了笑柄。",
      "title": "奥斯曼军队是如何从 \"欧洲的恐怖 \"变成一个笑柄的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們經常聽到奧斯曼帝國的軍隊（以及整個帝國）如何未能跟上歐洲的軍事和科學發展。\n軍隊（以及整個帝國）未能跟上歐洲軍事和科學發展的步伐。因此，他們從\n他們曾一度是 \"歐洲的恐怖\"，他們的軍隊幾乎總是取得勝利。\n他們從一度是 \"歐洲的恐怖\"，他們的軍隊幾乎總是取得勝利，到後來幾乎成了笑柄。",
      "title": "奧斯曼軍隊是如何從 \"歐洲的恐怖 \"變成一個笑柄的？"
    }
  ]
}