{
  "author": "misterslothman",
  "the_new_excerpt": "This is not a bragging post, I really do need help.\n\nAt current times, where the market is so crazy and unpredictable, I find myself\nin a pretty bizarre situation. A bit of a backstory- I'm 18 y/o, and at the end\nof 2020 I decided I should hop on the investing train (better early than never).\nsince…",
  "original_created_utc": 1613220154,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这不是吹牛的帖子，我真的需要帮助。\n\n在目前这个市场如此疯狂和不可预测的时代，我发现自己\n在一个相当奇怪的情况。有点背景故事--我18岁，在最后的时候\n2020年的时候，我决定我应该跳上投资的列车（早来比晚来好）。\n因为...",
      "title": "我在市场上的运气太差了，我想知道，我应该怎么做，才能防止我的下一个大错误？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這不是吹牛的帖子，我真的需要幫助。\n\n在目前這個市場如此瘋狂和不可預測的時代，我發現自己\n在一個相當奇怪的情況。有點背景故事--我18歲，在最後的時候\n2020年的時候，我決定我應該跳上投資的列車（早來比晚來好）。\n因爲...",
      "title": "我在市場上的運氣太差了，我想知道，我應該怎麼做，才能防止我的下一個大錯誤？"
    }
  ],
  "title": "I'm getting a bit too lucky in the market, and am wondering, what I should do to prevent my next big mistake?",
  "created_utc": 1613269749,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>This is not a bragging post, I really</strong> <strong><em>do</em></strong> <strong>need help.</strong></p>\n\n<p>At current times, where the market is so crazy and unpredictable, I find myself in a pretty bizarre situation. A bit of a backstory- I&#39;m 18 y/o, and at the end of 2020 I decided I should hop on the investing train (better early than never). since I don&#39;t have any real financial obligations and am not in any debt, I decided to play it a bit speculative. Now, I know this is not something I should get used to, but I&#39;ve already made 70% + in profit; thanks to NIU (@29), APHA (@4.7), and SPCE (@19). I know this is almost purely luck, but not sure how to change my strategy to being safer (since the market is, clearly, way too high) yet, not going completely Buffet kind of safe (since I&#39;m still young, and fuck it, I want some action).</p>\n\n<p>If anyone can recommend books, articles, strategies, or really anything that could humble me a little, it would be fantastic. I hope the post -well, the comments- can help other investors that find themselves in a similar situation as mine and save them from their next mistake. Thanks in advance, and happy investing.</p>\n</div><!-- SC_ON -->",
  "score": 42,
  "permalink": "/r/stocks/comments/lizvrr/im_getting_a_bit_too_lucky_in_the_market_and_am/",
  "subreddit": "stocks",
  "id": "lizvrr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728623039
}