{
  "author": "GibsonJ45",
  "the_new_excerpt": "Hoping to encourage a balanced discussion here.\n\nAfter a long time rallying against these new coins of little value to the\necosystem, I looked up CumRocket, which the name alone had me assuming it was\nnot worth the time.\n\nI was surprised with the whitepaper (no pun intended). Deflationary token…",
  "original_created_utc": 1620838963,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "バランスのとれた議論ができることを願っています。\n\n長い間、エコシステムにとって価値のない新しいコインに反対してきました。\n私はCumRocketを調べましたが、名前だけでは時間をかける価値がないと思いました。\n時間をかける価値はないと思っていました。\n\nしかし、ホワイトペーパーを見て驚きました（ダジャレではありません）。デフレ・トークン...",
      "title": "NFT、ミーム、そして暗号通貨の未来についての議論 - NFTを統合するミームコインについてのあなたの考えは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "希望能在这里鼓励大家进行平衡的讨论。\n\n经过长时间的反弹，反对这些对生态系统没有什么价值的新币\n生态系统没有什么价值的新币后，我查阅了CumRocket，光是这个名字就让我认为它是\n不值得花时间。\n\n我对白皮书感到惊讶（没有双关的意思）。通货紧缩的代币...",
      "title": "关于NFT、memes和加密货币的未来的讨论--你对memecoins整合NFT有什么看法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "希望能在這裏鼓勵大家進行平衡的討論。\n\n經過長時間的反彈，反對這些對生態系統沒有什麼價值的新幣\n生態系統沒有什麼價值的新幣後，我查閱了CumRocket，光是這個名字就讓我認爲它是\n不值得花時間。\n\n我對白皮書感到驚訝（沒有雙關的意思）。通貨緊縮的代幣...",
      "title": "關於NFT、memes和加密貨幣的未來的討論--你對memecoins整合NFT有什麼看法？"
    }
  ],
  "title": "A Discussion about NFTs, memes, and the future of Cryptocurrency - What are your thoughts on memecoins integrating NFT",
  "created_utc": 1620869072,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hoping to encourage a balanced discussion here.</p>\n\n<p>After a long time rallying against these new coins of little value to the ecosystem, I looked up CumRocket, which the name alone had me assuming it was not worth the time.</p>\n\n<p>I was surprised with the whitepaper (no pun intended). Deflationary token on BSC, enabling NFT transactions, allowing tokens as means of tipping/NFT purchase. 5% tax on transactions, (2.5% burn, 2.5% reflection to the holders). It&#39;s got more of a use case than Shiba, Doge, etc., arguably a use case that would put it in the category of legit tokens and NFT frontrunners.</p>\n\n<p>If NFTs hadn&#39;t taken off the way they have, I would be 100% against this project on name alone, but I think they may be on to something. Nobody can argue that if one thing comes from 2021, it will be the emergence of DeFi and NFTs, and memecoins.</p>\n\n<p>I&#39;m wondering if the name of the token will prevent it from being added to some of the larger purchase platforms (I anticipate this being more of a US issue than other countries).</p>\n\n<p>Time will tell. What are your thoughts? Do coins like these, that try to implement a real world use case, have a chance in the market?</p>\n\n<p>(DYOR - I am in no way affiliated with this project).</p>\n\n<p>**Edit**</p>\n\n<p>Thanks for the awards, amigos!</p>\n</div><!-- SC_ON -->",
  "score": 203,
  "permalink": "/r/CryptoCurrency/comments/natp3u/a_discussion_about_nfts_memes_and_the_future_of/",
  "subreddit": "CryptoCurrency",
  "id": "natp3u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985993624
}