{
  "author": "stormskiies",
  "original_created_utc": 1627538004,
  "title": "Did the ancient Egyptian pharaoh masturbate into the Nile River?",
  "created_utc": 1627570803,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A factoid I often hear repeated on Reddit is that an ancient Egyptian ritual involved the Pharaoh publicly masturbating into the Nile River. Some variations even recount that all the men at the festival would simultaneously ejaculate into the Nile.   </p>\n\n<p>While it’s true that ancient Egyptian mythology was rife with sexuality, this story almost feels too scandalous and bawdy to be true, and I&#39;ve yet to come across a reputable source for these claims beyond Reddit posts and pop-history websites. At most, there&#39;s a published book from 2015 titled <em>Did you know that?</em> by Frederic Cottart that goes over similarly unbelievable occurrences and repeats this <a href=\"https://books.google.com/books?id=hqYjBQAAQBAJ&amp;pg=PT63&amp;dq=pharaoh+fertilize+nile+seed&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwjrncWQoJXKAhWCLmMKHbxQCqsQ6AEINTAB#v=onepage&amp;q=pharaoh%20fertilize%20nile%20seed&amp;f=false\">claim</a> of the pharaoh &quot;fertilizing&quot; the Nile.   </p>\n\n<p>So, is this fun-fact true or false, and where does it originate from?</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/AskHistorians/comments/otrl55/did_the_ancient_egyptian_pharaoh_masturbate_into/",
  "subreddit": "AskHistorians",
  "id": "otrl55",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A factoid I often hear repeated on Reddit is that an ancient Egyptian ritual\ninvolved the Pharaoh publicly masturbating into the Nile River. Some variations\neven recount that all the men at the festival would simultaneously ejaculate\ninto the Nile.\n\nWhile it’s true that ancient Egyptian mythology…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Redditでよく耳にするのが、「古代エジプトの儀式では、ファラオが公衆の面前で自慰行為をしていた」というもの。\n古代エジプトの儀式では、ファラオがナイル川に向かって公然と自慰行為をしていたそうです。いくつかのバリエーション\n祭りに参加した男たちが一斉にナイル川に射精したという話もあります。\nナイル川に向かって射精するというものです。\n\n確かに、古代エジプトの神話は...",
      "title": "古代エジプトのファラオはナイル川で自慰行為をしたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我经常在Reddit上听到一个事实，即古埃及的一个仪式\n涉及法老公开向尼罗河自慰。有些说法\n甚至叙述说，所有参加庆典的男人都会同时向尼罗河射精\n到尼罗河中。\n\n虽然古埃及神话中确实...",
      "title": "古埃及法老对着尼罗河自慰吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我經常在Reddit上聽到一個事實，即古埃及的一個儀式\n涉及法老公開向尼羅河自慰。有些說法\n甚至敘述說，所有參加慶典的男人都會同時向尼羅河射精\n到尼羅河中。\n\n雖然古埃及神話中確實...",
      "title": "古埃及法老對着尼羅河自慰嗎？"
    }
  ]
}