{
  "author": "newfriend789",
  "original_created_utc": 1627943141,
  "title": "Is it ok for me as a straight guy to put a dick in my mouth?",
  "created_utc": 1627962789,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I&#39;m a 27 yr old straight guy, and for some reason I want to just want to try and see what it feels like to have a dick in my mouth.</p>\n\n<p>Now to be clear, I am 100% POSITIVE I am straight. I know this would be a point of contention but I can assure I am only attracted to women and pussy. I simply want to try it as a curiosity and experimental purposes. I dont even care to make the person cum, I would just like to have it my mouth for a little while.</p>\n\n<p>Now the reason I ask if its ok is because I mentioned this desire to a friend in the LGBTQ community and he said it would be dishonest of me to tell a guy I was gay so I could blow him. I agreed and thought if I do go forward I would explicity say that I am a straight guy so there is no deception. My friend said many guys would like this idea and would enjoy being my guinea pig of sorts. </p>\n\n<p>I just wanted some outside opinion of whether its ok for me to experiment like this or for some reason it would be unethical. Thanks for the input</p>\n</div><!-- SC_ON -->",
  "score": 134,
  "permalink": "/r/NoStupidQuestions/comments/owpgxj/is_it_ok_for_me_as_a_straight_guy_to_put_a_dick/",
  "subreddit": "NoStupidQuestions",
  "id": "owpgxj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I'm a 27 yr old straight guy, and for some reason I want to just want to try\nand see what it feels like to have a dick in my mouth.\n\nNow to be clear, I am 100% POSITIVE I am straight. I know this would be a point\nof contention but I can assure I am only attracted to women and pussy. I simply\nwant…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は27歳のノンケですが、なぜか口の中にペニスを入れてみたいと思っています。\n口の中にペニスを入れるとどんな感じになるのか試してみたいのです。\n\nはっきりさせておきたいのは、僕は100％ストレートだということです。これは議論の余地があると思いますが\n女性とマンコにしか惹かれないのは確かだ 私は単に\n欲しいのは...",
      "title": "ノンケの僕が口の中にチンポを入れてもいいんですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个27岁的直男，由于某种原因，我想尝试一下\n并看看在我的嘴里有一个阴茎是什么感觉。\n\n现在要说明的是，我100%肯定自己是直男。我知道这将是一个争议点\n但我可以保证，我只对女人和阴部感兴趣。我只是\n想...",
      "title": "我作为一个直男，把鸡巴放在嘴里可以吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個27歲的直男，由於某種原因，我想嘗試一下\n並看看在我的嘴裏有一個陰莖是什麼感覺。\n\n現在要說明的是，我100%肯定自己是直男。我知道這將是一個爭議點\n但我可以保證，我只對女人和陰部感興趣。我只是\n想...",
      "title": "我作爲一個直男，把雞巴放在嘴裏可以嗎？"
    }
  ]
}