{
  "author": "freddyjohnson",
  "the_new_excerpt": "> Tesla Inc. shares roared to a record high on the eve of their inclusion in the\n> S&P 500, punctuating a 2020 rally that has propelled the electric-car maker\n> into the ranks of the most-valuable U.S. companies.\n> \n> Big swings in shares of the Fremont, Calif., company overshadowed a blah day\n> for…",
  "original_created_utc": 1608340295,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": ">特斯拉公司(Tesla Inc.)在被纳入该指数前夕，股价飙升至创纪录高位\n>标准普尔500指数，标志着推动这家电动汽车制造商的2020年反弹\n>进入最有价值的美国公司行列。\n>\n>这家位于加利福尼亚州弗里蒙特的公司股价的大幅波动给无聊的一天蒙上了一层阴影\n>对于…",
      "title": "特斯拉股价在标准普尔500指数首次亮相前最后一分钟飙升后创下历史新高"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": ">特斯拉公司(Tesla Inc.)在被納入該指數前夕，股價飆升至創紀錄高位\n>標準普爾500指數，標誌着推動這家電動汽車製造商的2020年反彈\n>進入最有價值的美國公司行列。\n>\n>這家位於加利福尼亞州弗裏蒙特的公司股價的大幅波動給無聊的一天蒙上了一層陰影\n>對於…",
      "title": "特斯拉股價在標準普爾500指數首次亮相前最後一分鐘飆升後創下歷史新高"
    }
  ],
  "title": "Tesla Shares Hit Record After Last-Minute Surge Ahead of S&P 500 Debut",
  "created_utc": 1608355865,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p>Tesla Inc. shares roared to a record high on the eve of their inclusion in the S&amp;P 500, punctuating a 2020 rally that has propelled the electric-car maker into the ranks of the most-valuable U.S. companies.</p>\n\n<p>Big swings in shares of the Fremont, Calif., company overshadowed a blah day for the broader market that saw the Dow industrials drop 124 points, or 0.4%, to 30179. Tesla trading was heavy throughout Friday before rising to a fever pitch in the last moments of the market day, when index funds that track the S&amp;P began preparing to purchase billions of dollars worth of Tesla stock to match their holdings with the broad index.</p>\n\n<p>Tesla shares soared in the morning before slumping in late-afternoon trading and trading in and out of the red throughout the last hour. They finished up $39.10, or 6% to $695, a closing record—some $40 a share above their last trade in the moments before the market-closing auction at Nasdaq. Traders had said the firm’s addition to the broad index raised the possibility of an epic squeeze as index funds scrambled to buy shares.</p>\n\n<p>Investors who followed the up and down through the last chunk of the trading day suffered “a little bit of whiplash there,” said Mike Bailey, a director of research at FBB Capital </p>\n</blockquote>\n\n<p><a href=\"https://www.wsj.com/articles/tesla-shares-hit-record-after-last-minute-surge-ahead-of-s-p-500-debut-11608331441\">https://www.wsj.com/articles/tesla-shares-hit-record-after-last-minute-surge-ahead-of-s-p-500-debut-11608331441</a></p>\n</div><!-- SC_ON -->",
  "score": 743,
  "permalink": "/r/investing/comments/kfy4vo/tesla_shares_hit_record_after_lastminute_surge/",
  "subreddit": "investing",
  "id": "kfy4vo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260493088
}