{
  "author": "gnarley_quinn",
  "original_created_utc": 1634765523,
  "title": "Hype was the driving factor for Bitcoin reaching its ATH in May. This time, its utility and political backing is driving its rise as a viable investment.",
  "created_utc": 1634808652,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As we witness a new all time high for Bitcoin, it  is worth reflecting on the things that have changed since its previous highest value.</p>\n\n<p>A  vast majority of the reason for Bitcoin and other major alts reaching  their highs back in May was little more than hype. Memecoins like Doge,  and the rally of the GME stock were leading the way. The FOMO was real.  Unfortunately, this is what also led to a large portion of the drop and  the subsequent massive dip. Since the hype was never going to be  maintained, there was little else propping up the values.</p>\n\n<p>Since  then however, a number of projects, particularly Bitcoin specific, have  promoted more viable long term investment and adoption. Some examples  include:</p>\n\n<ul>\n<li>The first Bitcoin Futures ETF just started trading on the New York Stock Exchange.</li>\n<li>Grayscale is planning to convert their US$39 billion fund into a physical ETF.</li>\n<li>Bitcoin is now the 8th most valuable asset on the planet.</li>\n<li>Google announced a Bitcoin payments option</li>\n<li>Twitter is using the Lightning Network </li>\n<li>An actual country adopted Bitcoin as its national currency</li>\n</ul>\n\n<p>This time, it is much more than just hype driving the rise and use of Bitcoin.</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/CryptoCurrency/comments/qcbja6/hype_was_the_driving_factor_for_bitcoin_reaching/",
  "subreddit": "CryptoCurrency",
  "id": "qcbja6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As we witness a new all time high for Bitcoin, it is worth reflecting on the\nthings that have changed since its previous highest value.\n\nA vast majority of the reason for Bitcoin and other major alts reaching their\nhighs back in May was little more than hype. Memecoins like Doge, and the rally\nof…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインが史上最高値を記録した今、前回の最高値からの変化を振り返ってみたいと思います。\nビットコインの史上最高値を目の当たりにして、前回の最高値から変化したことを振り返ってみましょう。\n\n5月にビットコインやその他の主要なアルトが最高値を記録した理由の大半は、誇大広告に過ぎませんでした。\n5月にビットコインやその他の主要なアルトが最高値をつけた理由の大半は、誇大広告に過ぎませんでした。DogeのようなMemecoins、そしてラリーの\nの...",
      "title": "5月にビットコインがATHに達したのは、ハイプが原動力だった。今回は、その実用性と政治的な裏付けが、投資対象としての上昇の原動力となっています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我们看到比特币的历史新高时，值得反思的是\n自其之前的最高价值以来，事情已经发生了变化。\n\n比特币和其他主要货币达到历史最高点的绝大部分原因是\n5月达到高点的绝大部分原因不过是炒作而已。像Doge这样的记忆币，以及在5月份的反弹中的\n币。",
      "title": "炒作是比特币在5月达到ATH的驱动因素。这一次，它的实用性和政治支持正在推动它作为一种可行的投资而上升。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我們看到比特幣的歷史新高時，值得反思的是\n自其之前的最高價值以來，事情已經發生了變化。\n\n比特幣和其他主要貨幣達到歷史最高點的絕大部分原因是\n5月達到高點的絕大部分原因不過是炒作而已。像Doge這樣的記憶幣，以及在5月份的反彈中的\n幣。",
      "title": "炒作是比特幣在5月達到ATH的驅動因素。這一次，它的實用性和政治支持正在推動它作爲一種可行的投資而上升。"
    }
  ]
}