{
  "author": "FearlessConnection",
  "the_new_excerpt": "TL;DR - Guys put a lot of effort into gaining my interest, then only seem to\nremember I exist at “booty call hour”. What, in your opinion, determines whether\na woman is someone you’d sleep with versus someone you’d date?\n\nI (27F) have started to notice a recurring theme in my romantic affairs over…",
  "original_created_utc": 1611566157,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "\n记住我存在于 \"战利品时间\"。在你看来，是什么决定了\n一个女人是你会睡的人与你会约会的人？\n\n我（27F）已经开始注意到一个反复出现的主题，在我的浪漫事务中，在...",
      "title": "Reddit的男人--什么样的特质让一个女人成为你睡觉的对象（\"战利品电话 \"的材料），但永远不会约会？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\n記住我存在於 \"戰利品時間\"。在你看來，是什麼決定了\n一個女人是你會睡的人與你會約會的人？\n\n我（27F）已經開始注意到一個反覆出現的主題，在我的浪漫事務中，在...",
      "title": "Reddit的男人--什麼樣的特質讓一個女人成爲你睡覺的對象（\"戰利品電話 \"的材料），但永遠不會約會？"
    }
  ],
  "title": "Men of Reddit - What traits make a woman someone you’d sleep with (“booty call” material), but never date?",
  "created_utc": 1611583957,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>TL;DR</em> - Guys put a lot of effort into gaining my interest, then only seem to remember I exist at “booty call hour”. What, in your opinion, determines whether a woman is someone you’d sleep with versus someone you’d date?</p>\n\n<p>I (27F) have started to notice a recurring theme in my romantic affairs over the last 5 years or so. </p>\n\n<p>Practically every guy I’ve developed any legitimate interest in has been the type to work really hard to gain my interest, then put forth very little effort once they have it. After the initial “chase” period, they almost exclusively contact me/want to see me at ~2am (usually drunk) and then return to minimal contact until their next lonely booty call hour.</p>\n\n<p>I don’t <em>feel</em> as though I’m doing anything particular to encourage this - I almost never entertain 2am “come over” texts, and I’m 100% content being single so It’s not like I’m desperate or needy. </p>\n\n<p>Yet, this has happened enough that I can say I am <em>definitely</em> the common denominator. </p>\n\n<p>I’m starting to wonder what makes someone “booty call only” material versus someone you could actually develop a relationship with? What’s the difference between the “late-night fun” girl and the girl you’d (eventually) bring to meet your mom?</p>\n\n<p>Soo.... Help me understand, men of Reddit -\n<strong>What traits/factors make you automatically place someone in the “booty call” category?</strong></p>\n</div><!-- SC_ON -->",
  "score": 125,
  "permalink": "/r/AskMen/comments/l4k8os/men_of_reddit_what_traits_make_a_woman_someone/",
  "subreddit": "AskMen",
  "id": "l4k8os",
  "is_self": true,
  "media": null,
  "is_video": false
}