{
  "author": "Stefan1414411346",
  "the_new_excerpt": "The title really says it all. All the other major platforms have had multiple\nposts reach one million, and some even multiple millions.\n\nThere seems to be no age correlation, as TikTok has thousands of posts over a\nmillion, and its only really picked up in the last two years.\n\nI know Tumblr, which…",
  "original_created_utc": 1615121342,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这个标题真的说得很好。其他各大平台都有多个\n帖子达到100万，有的甚至达到几百万。\n\n似乎没有年龄上的关联性，因为TikTok有数千条帖子超过了100万条。\n万元，其只有在最近两年才真正回升。\n\n我知道Tumblr，这... ...",
      "title": "为什么到现在reddit还没有一个帖子超过100万的upvotes/likes？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個標題真的說得很好。其他各大平臺都有多個\n帖子達到100萬，有的甚至達到幾百萬。\n\n似乎沒有年齡上的關聯性，因爲TikTok有數千條帖子超過了100萬條。\n萬元，其只有在最近兩年才真正回升。\n\n我知道Tumblr，這... ...",
      "title": "爲什麼到現在reddit還沒有一個帖子超過100萬的upvotes/likes？"
    }
  ],
  "title": "Why hasn't reddit had a post over 1 million upvotes/likes by now?",
  "created_utc": 1615131890,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The title really says it all. All the other major platforms have had multiple posts reach one million, and some even multiple millions. </p>\n\n<p>There seems to be no age correlation, as TikTok has thousands of posts over a million, and its only really picked up in the last two years. </p>\n\n<p>I know Tumblr, which is super old, has posts over a million, and not just in total notes (likes + reblogs) but in just likes - <a href=\"https://snookeroo.tumblr.com/post/645001027210346496/lionowlonao3-lucyheartfiliaxxnatsudragneel\">such as this one</a>, with 1.1 mil likes</p>\n\n<p>Twitter has a bunch, and although they are political, reddit also hosts a bunch of political subreddits that often get to popular. </p>\n\n<p>Instagram also has a few, eg. Kylie Jenner Baby post. I feel like this is my biggest reason for my confusion since Instagram doesn&#39;t really have a big &#39;popular content&#39; page, like all the other platforms. People seek that out to like, which i feel like could easily happen with reddit and its Hivemind. </p>\n\n<p>So I guess i just want to know why a website with such an active and connected userbase hasn&#39;t had a post with over a million upvotes yet?</p>\n</div><!-- SC_ON -->",
  "score": 112,
  "permalink": "/r/NoStupidQuestions/comments/lzq1jy/why_hasnt_reddit_had_a_post_over_1_million/",
  "subreddit": "NoStupidQuestions",
  "id": "lzq1jy",
  "is_self": true,
  "media": null,
  "is_video": false
}