{
  "author": "TaxGuy_021",
  "the_new_excerpt": "10 Year Treasury auctions are always important as the rate sets the benchmark\nfor discount rates in 4 corners of the finance world.\n\nGiven the CPI jump today, this auction became that much more important to watch\nand I thought you fellows would appreciate a take on how it went.\n\nIn short, today's…",
  "original_created_utc": 1620840122,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "10年物国債の入札は、金融界の4つの分野で割引率の基準となるため、常に重要です。\n10年債入札は、金融界の4つの分野で割引率の基準となるため、常に重要です。\n\n今日のCPIの上昇を考えると、このオークションはより重要なものになりました。\nその結果を皆さんにお伝えしたいと思います。\n\n要するに、今日の...",
      "title": "10年物国債オークション（5/12/2021"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "10年期国债拍卖一直很重要，因为该利率为金融界的四个角落设定了基准\n在金融世界的4个角落里为贴现率设定基准。\n\n鉴于今天的CPI跳升，这次拍卖变得更加重要，需要关注\n我想你们会喜欢看它是如何进行的。\n\n简而言之，今天的...",
      "title": "10年期国债拍卖（5/12/2021"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "10年期國債拍賣一直很重要，因爲該利率爲金融界的四個角落設定了基準\n在金融世界的4個角落裏爲貼現率設定基準。\n\n鑑於今天的CPI跳升，這次拍賣變得更加重要，需要關注\n我想你們會喜歡看它是如何進行的。\n\n簡而言之，今天的...",
      "title": "10年期國債拍賣（5/12/2021"
    }
  ],
  "title": "10 Year Treasury Auction (5/12/2021)",
  "created_utc": 1620873424,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>10 Year Treasury auctions are always important as the rate sets the benchmark for discount rates in 4 corners of the finance world.</p>\n\n<p>Given the CPI jump today, this auction became that much more important to watch and I thought you fellows would appreciate a take on how it went.</p>\n\n<p>In short, today&#39;s auction was an excellent one. A+ grade really.</p>\n\n<p>Why?</p>\n\n<p>Dealers had to keep 19.49% of the issued securities versus six month average at 24.2%</p>\n\n<p>Direct buyers took 17.1% of the issued bonds versus six month average at 16.4%</p>\n\n<p>Indirects (generally foreign investors) took 63.4% of the issued bonds versus the 59.4% six month average.</p>\n\n<p>But most importantly of all, the yield dropped 1.3 basis points after the auction despite all the upward pressure today from the news which shows strong demand. The bond markets arent buying the inflation fears it seems.</p>\n</div><!-- SC_ON -->",
  "score": 63,
  "permalink": "/r/investing/comments/nau5r6/10_year_treasury_auction_5122021/",
  "subreddit": "investing",
  "id": "nau5r6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994601
}