{
  "author": "UnappealingCremepie",
  "original_created_utc": 1637165050,
  "title": "Where do long term holders feel most comfortable storing their stash?",
  "created_utc": 1637242313,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First off - Sorry if this is a sensitive topic or rides too close to others privacy, or \nhas been asked 1,000 times. Delete if not allowed, please.</p>\n\n<p>I know the mantra from most is “not your keys, not your coins” and I understand that… but isn’t spreading out your holdings throughout different wallets/exchanges the safest play? </p>\n\n<p>I guess I’m just wondering how many serious long term holders are doing this rather than piling everything in one spot.. any feedback is appreciated</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/Bitcoin/comments/qw2hgw/where_do_long_term_holders_feel_most_comfortable/",
  "subreddit": "Bitcoin",
  "id": "qw2hgw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "First off - Sorry if this is a sensitive topic or rides too close to others\nprivacy, or has been asked 1,000 times. Delete if not allowed, please.\n\nI know the mantra from most is “not your keys, not your coins” and I understand\nthat… but isn’t spreading out your holdings throughout…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず最初に、これがデリケートな話題であったり、他の人のプライバシーに近づきすぎたり、あるいは1000回も質問されたことがあったら申し訳ありません。\nプライバシーに関わることだったり、1,000回も質問されたことがあったらごめんなさい。許されない場合は削除してください。\n\n多くの人が「あなたのキーではなく、あなたのコインではなく」という信条を持っていることは知っていますし、それは理解しています。\nしかし、あなたの保有するコインを全体に分散させることは...",
      "title": "長期保有者は、どこに隠しておくのが一番快適なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先--如果这是一个敏感的话题，或者太接近别人的隐私，或者已经被问过1000次了，那么很抱歉。\n隐私，或者已经被问过1000次。如果不允许，请删除。\n\n我知道大多数人的口头禅是 \"不是你的钥匙，不是你的硬币\"，我理解这一点。\n但把你的持有量分散到整个...",
      "title": "长期持有者觉得在哪里储存他们的藏品最合适？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先--如果這是一個敏感的話題，或者太接近別人的隱私，或者已經被問過1000次了，那麼很抱歉。\n隱私，或者已經被問過1000次。如果不允許，請刪除。\n\n我知道大多數人的口頭禪是 \"不是你的鑰匙，不是你的硬幣\"，我理解這一點。\n但把你的持有量分散到整個...",
      "title": "長期持有者覺得在哪裏儲存他們的藏品最合適？"
    }
  ]
}