{
  "author": "KTOfficial_On_YT",
  "the_new_excerpt": "I saw a reddit post a few months ago how using \"girl\" for a woman could be\ndemeaning in a way. On a different note, I'm now old enough (24) that at some\nschool gatherings people say things like \"look at all these beautiful men and\nwomen in the room\" but it all feels so fake to me.\n\n\n\nTo me, I still…",
  "original_created_utc": 1615395054,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "几个月前，我在reddit上看到一个帖子，用 \"女孩 \"来形容一个女人，怎么可能是？\n在某种程度上是贬低的。从另一个角度来说，我现在已经足够大了（24岁），在某些方面\n在学校的聚会上，人们会说：\"你看这些漂亮的男人和\n房间里的女人\"，但我觉得这一切都很假。\n\n\n\n对我来说，我还是...",
      "title": "20岁以上的人把自己的年龄段称为 \"男女 \"与 \"男生女生\"，感觉很奇怪，这正常吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾個月前，我在reddit上看到一個帖子，用 \"女孩 \"來形容一個女人，怎麼可能是？\n在某種程度上是貶低的。從另一個角度來說，我現在已經足夠大了（24歲），在某些方面\n在學校的聚會上，人們會說：\"你看這些漂亮的男人和\n房間裏的女人\"，但我覺得這一切都很假。\n\n\n\n對我來說，我還是...",
      "title": "20歲以上的人把自己的年齡段稱爲 \"男女 \"與 \"男生女生\"，感覺很奇怪，這正常嗎？"
    }
  ],
  "title": "Is it normal for people 20+ to feel weird calling their age group \"men and women\" vs \"guys and girls\"?",
  "created_utc": 1615438987,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I saw a reddit post a few months ago how using &quot;girl&quot; for a woman could be demeaning in a way.  On a different note, I&#39;m now old enough (24) that at some school gatherings people say things like &quot;look at all these beautiful men and women in the room&quot; but it all feels so fake to me.</p>\n\n<p>&#x200B;</p>\n\n<p>To me, I still feel like we&#39;re all just guys (or boys) and girls (or gals). So if I refer to someone around my age I just say &quot;that guy&quot; or &quot;that girl&quot;.  Being a &quot;man&quot; sounds weird and if I was female I can&#39;t imagine being a &quot;woman&quot; at this age yet either.  It&#39;s like imposter syndrome but with age nouns.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/m2208f/is_it_normal_for_people_20_to_feel_weird_calling/",
  "subreddit": "NoStupidQuestions",
  "id": "m2208f",
  "is_self": true,
  "media": null,
  "is_video": false
}