{
  "author": "ron_leflore",
  "original_created_utc": 1645329781,
  "title": "Did the US drop a film unit ahead of the D-Day Normandy invasion specifically to film the landings at Omaha Beach?",
  "created_utc": 1645360966,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I found this 1998 &lt;a href=\"https://www.latimes.com/archives/la-xpm-1998-oct-23-me-35295-story.html\"&gt;LA times article&lt;/a&gt; that claims this occurred and the film is lost in government archives.&lt;/p&gt;\n\n&lt;p&gt;Here are some excerpts:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;George Hjorth’s orders that June morning 54 years ago were mysterious: After parachuting into occupied France with his three cameras, he was to hide in front of the German lines at Normandy and film whatever happened on the beach.&lt;/p&gt;\n\n&lt;p&gt;It was before dawn on June 6, 1944, and Hjorth was in the dark, literally and figuratively. He had no idea what to expect on that now-fabled stretch of coastline.&lt;/p&gt;\n\n&lt;p&gt;Only when the invasion began did he learn that his mission was to film the D-day landing of the U.S Army’s 1st Infantry Division and 29th Infantry Division at Omaha Beach--from the German side.&lt;/p&gt;\n\n&lt;p&gt;But whatever he saw, Hjorth (pronounced “Yorth”) was under standing orders not to discuss it for 50 years. Even today, the Cypress retiree’s mission remains an enigma: The film he shot, called unique by historians who recently learned of it from declassified documents, is missing.&lt;/p&gt;\n\n&lt;p&gt;“We’re hunting it down,” said Douglas Brinkley, a professor of history and director of the University of New Orleans’ Eisenhower Center. Hjorth’s movie footage and photographs--probably gathering dust in a government archive--are the only known invasion pictures from the German perspective shot at the Normandy beaches, he said.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That article was almost 25 years ago.  So, what happened?  Is the film lost?  Is the story not true?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/sws9fw/did_the_us_drop_a_film_unit_ahead_of_the_dday/",
  "subreddit": "AskHistorians",
  "id": "sws9fw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I found this 1998 LA times article\n[https://www.latimes.com/archives/la-xpm-1998-oct-23-me-35295-story.html] that\nclaims this occurred and the film is lost in government archives.\n\nHere are some excerpts:\n\n> George Hjorth’s orders that June morning 54 years ago were mysterious: After\n> parachuting…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1998年のLAタイムズの記事を見つけた。\n[https://www.latimes.com/archives/la-xpm-1998-oct-23-me-35295-story.html]によると\nフィルムは政府の公文書館で行方不明になっている。\n\n以下はその抜粋である。\n\n> 54年前の6月の朝、ジョージ・ヒョルトの命令は謎めいていた。\n> パラシュートで降下...",
      "title": "Dデーのノルマンディー上陸作戦に先立ち、アメリカはオマハビーチへの上陸を撮影するために、特別にフィルム部隊を投入したのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我发现1998年《洛杉矶时报》的这篇文章\n[https://www.latimes.com/archives/la-xpm-1998-oct-23-me-35295-story.html]说\n声称发生了这种情况，而且影片在政府档案中丢失。\n\n这里有一些摘录。\n\n> 54年前6月的那个早晨，乔治-赫约斯的命令很神秘：在\n> 降落伞...",
      "title": "美国是否在D日诺曼底入侵前投放了一支电影部队，专门拍摄奥马哈海滩的登陆情况？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我發現1998年《洛杉磯時報》的這篇文章\n[https://www.latimes.com/archives/la-xpm-1998-oct-23-me-35295-story.html]說\n聲稱發生了這種情況，而且影片在政府檔案中丟失。\n\n這裏有一些摘錄。\n\n> 54年前6月的那個早晨，喬治-赫約斯的命令很神祕：在\n> 降落傘...",
      "title": "美國是否在D日諾曼底入侵前投放了一支電影部隊，專門拍攝奧馬哈海灘的登陸情況？"
    }
  ]
}