{
  "author": "PWNWTFBBQ",
  "the_new_excerpt": "If you look at today's GME chart (image 1) at 5 PM EST, you can see how there is\na candle that is suppose to be green due to an increase. The value should read\n51.25 and not 50.25. Odd how it's exactly $1 different. Furthermore, the\nadjacent candle sticks read the same measurement as that red rocket…",
  "original_created_utc": 1613102685,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "如果你看看今天美国东部时间下午5点的GME图表（图1），你可以看到如何有\n蜡烛，应该是绿色的，因为增加了。该值应改为\n51.25而不是50.25。奇怪的是，怎么正好相差1元。而且，这个\n相邻的蜡烛棒读数与那枚红色火箭相同... ...",
      "title": "RH伪造数据，欺骗投资者高买低卖。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你看看今天美國東部時間下午5點的GME圖表（圖1），你可以看到如何有\n蠟燭，應該是綠色的，因爲增加了。該值應改爲\n51.25而不是50.25。奇怪的是，怎麼正好相差1元。而且，這個\n相鄰的蠟燭棒讀數與那枚紅色火箭相同... ...",
      "title": "RH僞造數據，欺騙投資者高買低賣。"
    }
  ],
  "title": "RH falsified data to trick investors to buy high and sell low.",
  "created_utc": 1613114642,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you look at today&#39;s GME chart (image 1) at 5 PM EST, you can see how there is a candle that is suppose to be green due to an increase. The value should read 51.25 and not 50.25. Odd how it&#39;s exactly $1 different. Furthermore, the adjacent candle sticks read the same measurement as that red rocket we got going.</p>\n\n<p>Comparing the graph and value against fidelity (image 2) , it obviously is the wrong color and the incorrect value. I&#39;m in PST so 2 pm here is 5 pm out east, thus, the time difference.</p>\n\n<p>Remember that one time RH fucked us in the ass when we couldn&#39;t buy any GME? Within their script, they switch the high and low variables. The same thing happened in this script.</p>\n\n<p><a href=\"https://imgur.com/gallery/kojXRYR\">https://imgur.com/gallery/kojXRYR</a></p>\n\n<p>I&#39;ve been following this constant script change (that&#39;s only has occurred for GME) since the day of the great fuckery. They&#39;ve since then have changed the script at least 5 times.</p>\n\n<p>Edit: To make things worse, the adjacent candlesticks have the same values.</p>\n\n<p><a href=\"https://imgur.com/a/W3BEgSn\">https://imgur.com/a/W3BEgSn</a></p>\n</div><!-- SC_ON -->",
  "score": 261,
  "permalink": "/r/stocks/comments/li3846/rh_falsified_data_to_trick_investors_to_buy_high/",
  "subreddit": "stocks",
  "id": "li3846",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728622094
}