{
  "author": "CrymsonReaper",
  "original_created_utc": 1644140229,
  "title": "What do heavy cavalry do after a successful charge?",
  "created_utc": 1644169929,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I dont understand what do cavalry do after successfully breaking the ranks of their opposition? Arnt they surrounded knee deep by angry men with sharp pointy sticks ready to poke them where it hurts especially when a horse is such a big target. &lt;/p&gt;\n\n&lt;p&gt;I have another question. How effective were archers against charging cavalry? Shouldn&amp;#39;t targeting and dropping the horses in the front of the horse successfully dissipate the onslaught (the horse behind would topple over the horses at front, thus creating a domino effect)?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Thank you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/slsx9u/what_do_heavy_cavalry_do_after_a_successful_charge/",
  "subreddit": "AskHistorians",
  "id": "slsx9u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I dont understand what do cavalry do after successfully breaking the ranks of\ntheir opposition? Arnt they surrounded knee deep by angry men with sharp pointy\nsticks ready to poke them where it hurts especially when a horse is such a big\ntarget.\n\nI have another question. How effective were archers…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "騎兵隊が相手の陣形を崩すのに成功した後、どうするのかがわからない。\nということでしょうか？彼らは、膝の深さまで、鋭い先のとがったものを持った怒った男たちに囲まれているのではないでしょうか？\n特に馬は大きいので、痛いところを突いてきます。\n的です。\n\nもうひとつ質問があります。弓矢はどの程度有効だったのか...",
      "title": "重騎兵は突撃に成功した後、どうするのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不明白，骑兵在成功突破对手的队伍后会做什么？\n他们的对手？他们不是被愤怒的人包围在膝盖深处，拿着锋利的尖头\n他们不是被愤怒的人包围在膝盖深处，拿着尖锐的棍子准备戳他们的痛处吗，特别是当一匹马是如此大的\n目标。\n\n我还有一个问题。弓箭手的效率如何？",
      "title": "重型骑兵在冲锋成功后会做什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不明白，騎兵在成功突破對手的隊伍後會做什麼？\n他們的對手？他們不是被憤怒的人包圍在膝蓋深處，拿着鋒利的尖頭\n他們不是被憤怒的人包圍在膝蓋深處，拿着尖銳的棍子準備戳他們的痛處嗎，特別是當一匹馬是如此大的\n目標。\n\n我還有一個問題。弓箭手的效率如何？",
      "title": "重型騎兵在衝鋒成功後會做什麼？"
    }
  ]
}