{
  "author": "Wuntv",
  "original_created_utc": 1628694373,
  "title": "In general, do people really care about STD?",
  "created_utc": 1628718673,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I read stories online where people meet strangers at bar/club/whatever and have bareback sex/blowjob/eating out and are not scared of getting a STD. Of course I ain&#39;t talking about porn or whatever. But even the people I met throughout dating apps or just acquaintance/friends when we start talking about personal sex stories where they had bareback sex with strangers and seems to not give a damn about it.... I&#39;m so mad</p>\n\n<p>When I started to be sexually active, I didn&#39;t mind about unprotected oral sex but now I&#39;m always scared and overthinking every single sex I had.... Looking at the mirror if I have weird buttons of my dick/lips. Like why am I that scared? I would love to just breathe out and let the anxiety die for a minute.....</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/p2ew06/in_general_do_people_really_care_about_std/",
  "subreddit": "TooAfraidToAsk",
  "id": "p2ew06",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I read stories online where people meet strangers at bar/club/whatever and have\nbareback sex/blowjob/eating out and are not scared of getting a STD. Of course I\nain't talking about porn or whatever. But even the people I met throughout\ndating apps or just acquaintance/friends when we start talking…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "バーやクラブなどで見知らぬ人と会って、ベアバックセックスやフェラチオ、食事をしている人の話をネットで読みます。\n裸でセックスをしたり、フェラチオをしたり、外で食事をしたりしても、性病にかかる心配はないという話をネットで読みました。もちろん、私は\n勿論、ポルノや何かの話ではありません。でも、出会い系アプリや知り合いで知り合った人でも\n出会い系アプリで知り合った人や、ただの知人・友人でも、話し始めると",
      "title": "一般的に、人々はSTDを気にしているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在网上看到一些故事，人们在酒吧/俱乐部/什么地方遇到陌生人，然后发生了\n光着屁股做爱/吹箫/在外面吃饭，并且不害怕得性病。当然，我\n不是在谈论色情或什么。但是，即使是我在约会软件上遇到的人\n约会应用程序或只是熟人/朋友，当我们开始交谈时...",
      "title": "一般来说，人们真的关心性病吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在網上看到一些故事，人們在酒吧/俱樂部/什麼地方遇到陌生人，然後發生了\n光着屁股做愛/吹簫/在外面喫飯，並且不害怕得性病。當然，我\n不是在談論色情或什麼。但是，即使是我在約會軟件上遇到的人\n約會應用程序或只是熟人/朋友，當我們開始交談時...",
      "title": "一般來說，人們真的關心性病嗎？"
    }
  ]
}