{
  "author": "limecigar",
  "original_created_utc": 1645445530,
  "title": "Is a 14 year old and a 18 year old dating wrong/weird?",
  "created_utc": 1645452824,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Had a girl in class the other day say she wanted to date a senior (she’s 14, he’s 18) and I pretty much told her it’s not okay because their maturity levels are WAYY different. She, along with EVERYONE else at the table told me “I’m mature for my age, it’s only 4 years, no big deal! My parents have an age gap” \nAnd I just? I still think it’s weird for a 14 year old to date an 18 year old. Like that just don’t sit right with me. Am I in the wrong here for telling her it’s weird?&lt;/p&gt;\n\n&lt;p&gt;EDIT: just to make this clear, I do personally think it’s wrong, I just wanted to kinda verify I was right here&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 161,
  "permalink": "/r/TooAfraidToAsk/comments/sxs334/is_a_14_year_old_and_a_18_year_old_dating/",
  "subreddit": "TooAfraidToAsk",
  "id": "sxs334",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Had a girl in class the other day say she wanted to date a senior (she’s 14,\nhe’s 18) and I pretty much told her it’s not okay because their maturity levels\nare WAYY different. She, along with EVERYONE else at the table told me “I’m\nmature for my age, it’s only 4 years, no big deal! My parents have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先日、クラスの女子が「先輩と付き合いたい」と言い出したのですが（彼女は14歳。\n18歳）、私は「2人の成熟度は違うから、大丈夫じゃない」と言いました。\nが全然違うんです。彼女は、そのテーブルにいた他のみんなと一緒に、私に「私は\n年の割に大人っぽい、たった4年、大したことない！」。うちの親は・・・。",
      "title": "14歳と18歳の交際はいけないこと/変なこと？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一天，班上的一个女孩说她想和一个高年级学生约会（她14岁。\n他18岁），我告诉她这是不对的，因为他们的成熟度有很大不同。\n差异很大。她和同桌的每个人都告诉我：\"我的年龄已经很成熟了。\n我的年龄已经很成熟了，只是4年而已，没什么大不了的！我的父母已经......\"。我的父母有...",
      "title": "一个14岁的孩子和一个18岁的孩子约会是错误/奇怪的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一天，班上的一個女孩說她想和一個高年級學生約會（她14歲。\n他18歲），我告訴她這是不對的，因爲他們的成熟度有很大不同。\n差異很大。她和同桌的每個人都告訴我：\"我的年齡已經很成熟了。\n我的年齡已經很成熟了，只是4年而已，沒什麼大不了的！我的父母已經......\"。我的父母有...",
      "title": "一個14歲的孩子和一個18歲的孩子約會是錯誤/奇怪的嗎？"
    }
  ]
}