{
  "author": "DenizenOfTitan",
  "original_created_utc": 1628102731,
  "title": "Please help me find if my friend is trolling me or he is right?",
  "created_utc": 1628113091,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, I am super new to English language and Gaming, so one of my friends said that it is perfectly fine to converse like people converse in GTA 5. I am suspicious though because the language <em>feels</em> vulgar to me but my friend said it is just informal way of communication. Not sure if he is trolling <a href=\"https://www.youtube.com/watch?v=CXZtVoQ0gqs\">https://www.youtube.com/watch?v=CXZtVoQ0gqs</a>  Like he said it is OK to converse like that as shown in video. Can you guys check is it okay to converse like that?</p>\n\n<p>I am adding NSFW flair just in case it turns out to be.</p>\n\n<p>Edit 1: I am using Grammarly Premium so I think it looks like I am trolling instead but it is not the case. And I am using Reddit a lot from past few days so I get to know how to write a post.</p>\n\n<p>Edit 2: People just can&#39;t accept I was this much sheltered from western influence. Yes. I Was. Until I got into college. My family was poor when I was in high school. But now things are improving; I got gaming laptop and decent Internet and a bunch of friends. I am learning as much as I can.</p>\n\n<p>Edit 3: Oh my Inbox! I am trying to go through each comment. It is a lot confusing to me right now as an outsider. Like somebody mentioned there is internal confusion between blacks whether they find that word offensive or not. And someone also said that we should not even write N or leave it blank (______). I mean what??? How you are supposed to refer to that word (Using brain to brain communication? Lol). I mean this is really weird. And somebody also said you can use that word freely but your intent shouldn&#39;t be wrong. I just can&#39;t stop laughing. So many different views.</p>\n</div><!-- SC_ON -->",
  "score": 364,
  "permalink": "/r/NoStupidQuestions/comments/oxzdnm/please_help_me_find_if_my_friend_is_trolling_me/",
  "subreddit": "NoStupidQuestions",
  "id": "oxzdnm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So, I am super new to English language and Gaming, so one of my friends said\nthat it is perfectly fine to converse like people converse in GTA 5. I am\nsuspicious though because the language feels vulgar to me but my friend said it\nis just informal way of communication. Not sure if he is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は英語もゲームも超初心者なので、友人の一人が「英語で会話するのは全く問題ない。\nGTA5での会話のように会話しても全く問題ないと言っていました。私は\n疑っています。というのも、その言葉は私には下品に感じられるのですが、友人はそれは単なるインフォーマルなコミュニケーションの方法だと言っています。\nただのインフォーマルなコミュニケーション方法だと言っていました。しかし、私の友人は、それはカジュアルなコミュニケーションだと言いました。",
      "title": "私の友人が私を馬鹿にしているのか、それとも彼が正しいのかを見極める手助けをしてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我对英语和游戏超级陌生，所以我的一个朋友说\n说像《GTA5》中的人那样交谈是完全可以的。我\n怀疑，因为我觉得这种语言很粗俗，但我的朋友说它\n只是非正式的交流方式。不确定他是否...",
      "title": "请帮助我找到我的朋友是在欺骗我还是他是对的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我對英語和遊戲超級陌生，所以我的一個朋友說\n說像《GTA5》中的人那樣交談是完全可以的。我\n懷疑，因爲我覺得這種語言很粗俗，但我的朋友說它\n只是非正式的交流方式。不確定他是否...",
      "title": "請幫助我找到我的朋友是在欺騙我還是他是對的？"
    }
  ]
}