{
  "author": "heyheoy",
  "original_created_utc": 1627948810,
  "title": "ETH just closed 13 straight green days for the first time in history!!",
  "created_utc": 1627965898,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It just happened, ETH just closed 13 straight green days for the first time in its 6 years of history. We are all seeing history in here, the longest green candles run ever!! Despite this last hour dump (in all crypto) we still managed to close above $2600</p>\n\n<p>Lot of us are also expecting the London Fork upgrade with the EIP 1559 update that will start burning ETH, yall can check the countdown in here: <a href=\"https://etherscan.io/block/countdown/12965000\">https://etherscan.io/block/countdown/12965000</a> still 2 more days and some hours. There will be also some live stream party and some public drawing where we all can participate an receive a POAP for it, more info in here <a href=\"https://ethstaker.cc/london/\">https://ethstaker.cc/london/</a></p>\n\n<p>Im glad that i helped into this 13 days run with a small purchase of 0.01 ETH, baby fish purchase, but every single purchase helped into it.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/owr958/eth_just_closed_13_straight_green_days_for_the/",
  "subreddit": "CryptoCurrency",
  "id": "owr958",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It just happened, ETH just closed 13 straight green days for the first time in\nits 6 years of history. We are all seeing history in here, the longest green\ncandles run ever!! Despite this last hour dump (in all crypto) we still managed\nto close above $2600\n\nLot of us are also expecting the London…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ETHは、6年間の歴史の中で初めて13日連続でグリーンデーを迎えました。\n6年間の歴史の中で初めてのことです。私たちはここで歴史を見ています、史上最長の緑の\n史上最長の緑のローソク足です！！。この最後の1時間のダンプ（すべての暗号化）にもかかわらず、我々はまだ管理しています\n2600ドルを超えることができました。\n\n多くの人が、ロンドン市場に期待しています...",
      "title": "ETHは史上初の13連続グリーンデーを迎えました!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "事情刚刚发生，ETH刚刚连续13天收盘，这在其6年历史上还是第一次。\n它的6年历史中第一次。我们都在这里看到了历史，有史以来最长的绿色\n蜡烛运行的历史！！。尽管最后一小时的抛售（在所有加密货币中），我们仍然设法\n收于2600美元以上\n\n我们中的很多人也在期待着伦敦的...",
      "title": "ETH刚刚连续13天收绿，这在历史上还是第一次！!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "事情剛剛發生，ETH剛剛連續13天收盤，這在其6年曆史上還是第一次。\n它的6年曆史中第一次。我們都在這裏看到了歷史，有史以來最長的綠色\n蠟燭運行的歷史！！。儘管最後一小時的拋售（在所有加密貨幣中），我們仍然設法\n收於2600美元以上\n\n我們中的很多人也在期待着倫敦的...",
      "title": "ETH剛剛連續13天收綠，這在歷史上還是第一次！!"
    }
  ]
}