{
  "author": "greyzcale",
  "the_new_excerpt": "I've been learning more about how the stock market works and I'm amazed that\nnaked shorting legal, and that financial firms have mechanisms which permit it\nto happen.\n\nI hear that \"market makers\" have special privileges to naked short sell, and\nthese privileges exist in order to \"provide…",
  "original_created_utc": 1622966176,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "株式市場の仕組みを学んできて、驚いたことがあります。\n裸の空売りが合法であること、金融機関がそれを可能にする仕組みを持っていることに驚きました。\n驚いています。\n\nマーケットメーカー」には、ネイキッドショートをするための特別な権限があるそうです。\nこの特権は、「...を提供する」ために存在するそうです。",
      "title": "なぜ市場の「流動性」を確保することが、「マーケットメイカー」に特別な特権（ネイキッド・ショートなど）を与えるほど重要だと考えられているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在学习更多关于股票市场如何运作的知识，我很惊讶地发现\n我很惊讶，裸体做空是合法的，而且金融公司有允许它发生的机制。\n发生。\n\n我听说 \"做市商 \"在裸体卖空方面有特殊的特权，而这些特权的存在是为了 \"提供......\"。\n这些特权的存在是为了 \"提供...",
      "title": "为什么在市场中拥有 \"流动性 \"被认为重要到足以给予 \"做市商 \"特殊的特权（如裸体做空）？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在學習更多關於股票市場如何運作的知識，我很驚訝地發現\n我很驚訝，裸體做空是合法的，而且金融公司有允許它發生的機制。\n發生。\n\n我聽說 \"做市商 \"在裸體賣空方面有特殊的特權，而這些特權的存在是爲了 \"提供......\"。\n這些特權的存在是爲了 \"提供...",
      "title": "爲什麼在市場中擁有 \"流動性 \"被認爲重要到足以給予 \"做市商 \"特殊的特權（如裸體做空）？"
    }
  ],
  "title": "Why is having \"liquidity\" in markets considered important enough to give \"market makers\" special privileges (such as naked shorting)?",
  "created_utc": 1622977344,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been learning more about how the stock market works and I&#39;m amazed that naked shorting legal, and that financial firms have mechanisms which permit it to happen.</p>\n\n<p>I hear that &quot;market makers&quot; have special privileges to naked short sell, and these privileges exist in order to &quot;provide liquidity&quot;.</p>\n\n<p>Why is providing liquidity considered to be a good thing?</p>\n\n<p>In my mind, in an illiquid market, there might be a massive spread between the bid and ask and (without market makers able to nakedly short sell) this might mean that no trade occurs for a long time until one side cracks and changes their price to close the spread.</p>\n\n<p>But... why would that be a bad thing?</p>\n\n<p>So there&#39;s a big spread for a while and no trading occurs? So what? What&#39;s the problem? Since naked shorting is so transparently an opportunity for market manipulation and fraud, there must be some rationale for why it exists, right?</p>\n\n<p>What&#39;s the worst that could happen if market makers were not able to nakedly short?</p>\n</div><!-- SC_ON -->",
  "score": 1405,
  "permalink": "/r/investing/comments/ntgmks/why_is_having_liquidity_in_markets_considered/",
  "subreddit": "investing",
  "id": "ntgmks",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404886624
}