{
  "author": "jurble",
  "original_created_utc": 1641764475,
  "title": "If slavery in Japan was banned by Toyotomi Hideyoshi (according to Wikipedia), then what was the legal status of girls sold by their families to brothels, panders or pimps? What transaction actually took place when money was exchanged if it wasn't transfer of human property?",
  "created_utc": 1641805932,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Watching the new season of Kimetsu no Yaiba, set during the 1910s-1920s I believe, and the character Tengen Uzui is explaining how poor families sell their girls to brothels.  Given that brothels operate legally/openly in this period, my assumption is that the sale of daughters to brothels must be legal?  If so then, given slavery isn&amp;#39;t legal, what exactly is happening in such an exchange?&lt;/p&gt;\n\n&lt;p&gt;Of course, they might be acquiring the girls illegally and no one in the government cares, in which case my question is moot I suppose.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/s02d52/if_slavery_in_japan_was_banned_by_toyotomi/",
  "subreddit": "AskHistorians",
  "id": "s02d52",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Watching the new season of Kimetsu no Yaiba, set during the 1910s-1920s I\nbelieve, and the character Tengen Uzui is explaining how poor families sell\ntheir girls to brothels. Given that brothels operate legally/openly in this\nperiod, my assumption is that the sale of daughters to brothels must be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1910年代から1920年代を舞台とした「君の名は」の新シーズンを見ています。\n天元ウズイというキャラクターが、貧しい家庭がどのように売られているかを説明しています。\n娼館に娘を預ける。この時代、娼館は合法的／公然と営業していることを考えると\n私が思うに、この時代、娘を娼館に売るというのは",
      "title": "日本における奴隷制度が豊臣秀吉によって禁止されたのなら（Wikipediaより）、家族から遊郭やパンダー、ポン引きに売られた少女たちの法的地位はどうだったのだろうか？人身売買でないとすれば、金銭のやり取りは実際にどのような取引で行われたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在看新一季的《金月的八叶》，背景是1910-1920年代。\n我相信是这样的，其中的角色Tengen Uzui正在解释贫困家庭如何将女孩卖给妓院。\n他们的女孩被卖到妓院。鉴于这一时期的妓院是合法/公开经营的\n我的假设是，将女儿卖给妓院一定是......",
      "title": "如果日本的奴隶制被丰臣秀吉所禁止（根据维基百科），那么被家人卖给妓院、摊贩或皮条客的女孩的法律地位如何？如果不是转移人的财产，那么在交换金钱时究竟发生了什么交易？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在看新一季的《金月的八葉》，背景是1910-1920年代。\n我相信是這樣的，其中的角色Tengen Uzui正在解釋貧困家庭如何將女孩賣給妓院。\n他們的女孩被賣到妓院。鑑於這一時期的妓院是合法/公開經營的\n我的假設是，將女兒賣給妓院一定是......",
      "title": "如果日本的奴隸制被豐臣秀吉所禁止（根據維基百科），那麼被家人賣給妓院、攤販或皮條客的女孩的法律地位如何？如果不是轉移人的財產，那麼在交換金錢時究竟發生了什麼交易？"
    }
  ]
}