{
  "author": "FaisalAli_91",
  "the_new_excerpt": "Maybe go item by item: like super-speed internet - I think everyone can see the\nneed for infrastructure that is future-proof, so 20 years from now when the\ninternet is billions of times faster our rural communities will still have\naccess.\n\nSlow internet speeds are a death sentence for our rural…",
  "original_created_utc": 1622821222,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "超高速インターネットのように、20年後の未来を見据えたインフラの必要性は、誰もが感じていると思います。\n20年後にインターネットが数十億倍になっても、私たちの生活が破綻しないような、将来性のあるインフラが必要です。\n20年後にインターネットの速度が何十億倍にもなっていても、地方のコミュニティがアクセスできるような\nアクセスできるようになります。\n\nインターネットの速度が遅いことは、地方のコミュニティにとっては死刑宣告です。",
      "title": "民主党は今、共和党と一緒に小さな断片的なインフラ法案を通過させ、2022年以降、より多くの議席を獲得した場合に大きな法案を通過させることができるでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "也许可以逐项进行：比如超速互联网--我想每个人都能看到对面向未来的基础设施的需求。\n我想每个人都能看到对面向未来的基础设施的需求，所以20年后，当互联网的速度比以前快了几十亿倍的时候，我们就会有更多的机会。\n20年后，当互联网的速度提高了数十亿倍时，我们的农村社区仍然可以获得\n接入。\n\n缓慢的网速对我们的农村来说是一个死刑判决。",
      "title": "民主党人现在能否与共和党人一起通过较小的零散的基础设施法案，如果他们赢得更多的席位，在2022年之后再通过一个更大的法案？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "也許可以逐項進行：比如超速互聯網--我想每個人都能看到對面向未來的基礎設施的需求。\n我想每個人都能看到對面向未來的基礎設施的需求，所以20年後，當互聯網的速度比以前快了幾十億倍的時候，我們就會有更多的機會。\n20年後，當互聯網的速度提高了數十億倍時，我們的農村社區仍然可以獲得\n接入。\n\n緩慢的網速對我們的農村來說是一個死刑判決。",
      "title": "民主黨人現在能否與共和黨人一起通過較小的零散的基礎設施法案，如果他們贏得更多的席位，在2022年之後再通過一個更大的法案？"
    }
  ],
  "title": "Can Democrats pass smaller piecemeal infrastructure bills with Republicans now, and pass a bigger one later after 2022 if they win more seats?",
  "created_utc": 1622898583,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Maybe go item by item: like super-speed internet - I think everyone can see the need for infrastructure that is <em>future-proof</em>, so 20 years from now when the internet is billions of times faster our rural communities will still have access.</p>\n\n<p>Slow internet speeds are a death sentence for our rural communities and agricultural industry, so this feels like a no-brainer.</p>\n\n<p>Waiting for private interests to fill the gaps could take decades and would give the people who build the networks total control to charge whatever they want for internet access and block out competitors. Publicly funded fiber optic networks will allow multiple companies to compete to offer data on the same cables.</p>\n\n<p>And maybe the Dems can get the Republicans on a few others priorities, like childcare and compulsory pre-kindergarten for all Americans. Starting school earlier massively benefits the kids, and easy access to childcare allows parents to offload their kids so they can go to work and make money and buy things. Win-win-win.</p>\n\n<p>And anything the Republicans fail to agree on, like eldercare and replacing lead pipes from our drinking water systems - that can wait till 2022 if Dems can keep the people&#39;s support.</p>\n\n<p>Is that a viable way to pass this kind of legislation?</p>\n\n<p>The Dems would have to make it clear that all of these measures are tied to increasing taxes on the rich - no user fees or siphoning money from Covid-relief and out of the pockets of middle-and-lower-class Americans.</p>\n\n<p>The Dems would also have to play hardball: give Republicans enough chances to prove they can compromise and come to an agreement for the good of the nation, but be prepared to axe them out of the equation without a second&#39;s hesitation and move on because nobody has time to play games forever.</p>\n\n<p>The world isn&#39;t going to stop advancing while we fight in the mud going nowhere. Both the Dems and the GOP promised their own Infrastructure Plans and were elected on that promise. They should be united in bringing this urgently needed Plan to reality that Americans demand.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/Ask_Politics/comments/ns83ic/can_democrats_pass_smaller_piecemeal/",
  "subreddit": "Ask_Politics",
  "id": "ns83ic",
  "is_self": true,
  "media": null,
  "is_video": false
}