{
  "author": "geonic_",
  "the_new_excerpt": "tldr: a short story about a reformed shitcoiner who saw the light\n\nThis post will probably kill my karma, cause I know you’re all here to change\nthe world and what-not, but I wanted to make a confession: I’m in crypto for the\ngains.\n\nI got into crypto in 2016 because I wanted more fiat. Yeah I know.…",
  "original_created_utc": 1616706874,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "TLDR：一个关于一个改过自新的大粪贩子的短篇小说，他看到了光明。\n\n这个帖子可能会杀了我的业力，因为我知道你们都是来改变的。\n世界和什么的， 但我想做一个忏悔。我加入加密技术是为了...\n的收益。\n\n我在2016年进入加密技术，因为我想要更多的法币。是的，我知道....。",
      "title": "为什么我把我所有的Monero卖掉换成了比特币（为什么你也应该这样做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TLDR：一個關於一個改過自新的大糞販子的短篇小說，他看到了光明。\n\n這個帖子可能會殺了我的業力，因爲我知道你們都是來改變的。\n世界和什麼的， 但我想做一個懺悔。我加入加密技術是爲了...\n的收益。\n\n我在2016年進入加密技術，因爲我想要更多的法幣。是的，我知道....。",
      "title": "爲什麼我把我所有的Monero賣掉換成了比特幣（爲什麼你也應該這樣做？"
    }
  ],
  "title": "Why I sold all my Monero for Bitcoin (and why you should too)",
  "created_utc": 1616730202,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>tldr: a short story about a reformed shitcoiner who saw the light</p>\n\n<p>This post will probably kill my karma, cause I know you’re all here to change the world and what-not, but I wanted to make a confession: I’m in crypto for the gains.</p>\n\n<p>I got into crypto in 2016 because I wanted more fiat. Yeah I know. But does your landlord care about your censorship resistant UTXO? Can you pay your medical bill with crypto? Or fund a retirement account with it? No. If you hand-waved that away and still think fiat isn’t important, answer yourself this:</p>\n\n<p>When your wife asks how your crypto investment is doing, does your response depend on the fiat value of your holdings? Don’t lie. Fiat is the yardstick. And crypto is just another way to get more of it.</p>\n\n<p>Back to my story. Like many of you, I thought I had missed out on Bitcoin and was looking for the “next big thing”. When I heard of Monero being listed on Alphabay, I remembered that a friend had sent me an article about Bitcoin being used on Silk Road way back in 2011. I didn’t listen then, but I was sure as hell going to listen to him now. I put a good chunk of my personal savings into Monero and started following the subreddit. This was ~September 2016, right as the great bull market of 2017 was heating up. Darknet market adoption was going to make me rich.</p>\n\n<p>I swallowed up all the news that was published in the Monero subreddit. Bitcoin is bad and traceable. Monero is good and untraceable. I thought Bitcoin was a cult and was blind to its many advantages. Looking at it now, I was the one who was in a cult. Every coin is a cult. The difference is, Bitcoin is a religion. And religions make money, while cult members commit suicide.</p>\n\n<p>I rode the 2017 wave up, all the way up. I became a millionaire before I turned 30. I felt proud and my wife was proud of me too. But I had drunk the Kool-Aid. I thought XMR would be on Apple Pay within a year. Apple’s commitment to privacy + Monero.. it was a no-brainer. Monero was on the brink of going mainstream. Or not.</p>\n\n<p>So I rode it back all the way down. All my paper gains — gone. Maybe we weren’t ready for primetime yet, but I still believed that my coin was superior to Bitcoin. The losses in dollar terms were made more palatable by the schadenfreude I got from reading about people trying to use Bitcoin privately and failing miserably.</p>\n\n<p>Like <a href=\"https://twitter.com/bittlecat/status/1207621591820951552\">this guy</a>, who thought he can coinjoin his bitcoins without first asking for Binance’s permission. Or <a href=\"https://np.reddit.com/r/WasabiWallet/comments/czext2/paxful_account_was_frozen_due_to_coinjoin/\">this one</a>, who had 1 BTC confiscated by Paxful for the same reason. Or this <a href=\"https://bisq.community/t/dirty-btc-coins-on-the-xmr-market/7798\">poor fella</a>, who used one of those fancy new decentralized exchanges, ended up with dirty bitcoins and had two of his (centralized) exchange accounts frozen when he tried to cash out (we all cash out sooner or later — see the first paragraph). I relished in Bitcoin’s lack of fungibility.</p>\n\n<p>I was on the front lines of crypto twitter every day, reminding everyone who would listen that Lightning Network <a href=\"http://arxiv.org/pdf/2003.12470v1.pdf\">does nothing</a> to improve Bitcoin privacy. I told them that Monero built the first ASIC-resistant PoW algorithm that <a href=\"https://www.monerooutreach.org/stories/RandomX.html\">actually works</a> and fulfilled Satoshi’s one-cpu-one-vote ideal. Hell, I even told them how Monero solved the <a href=\"https://localmonero.co/knowledge/dynamic-block-size?language=en\">blocksize problem</a> and is actually more scaleable on-chain. I made fun of people paying $20 for a transparent transaction, when I was making perfectly private ones for less than a cent. When NFT’s rolled around, I joked that Monero is the only crypto currency (crypto meaning hidden in Greek), while everything else is a non-fungible token. Turns out, NFTs can accrue a lot of value.</p>\n\n<p>I was sure that Monero being technically superior to Bitcoin would be recognized and rewarded in the market. I was certain that, as soon as this bear market is over and crypto is again in the mainstream, Monero would perform and it would perform better than Bitcoin. But it hasn’t. Bitcoin has returned 200% since its 2017 ATH. In the same timeframe, measured against its ATH in USD, Monero has returned -50%. If you think this is bad, let me tell you about its performance against Bitcoin. In BTC terms, Monero is 89% down from its ATH.</p>\n\n<p>In the middle of a bull market, with every fund under the sun getting into crypto, one mega-pump event after another, I was missing out. My shitcoin of choice was 50% down from its USD ATH and 89% down from its BTC ATH. I couldn’t face my wife if I kept holding Monero. I had let my ideals get the better of me. I had forgotten why I got into crypto in the first place. The final straw was this <a href=\"https://twitter.com/gladstein/status/1374512334165569540\">brilliant tweet</a> from Alex Gladstein at the Human Rights Foundation. When asked about Bitcoin’s fungibility issues, he just points to its price performance.</p>\n\n<p>Like Paul Tudor Jones said, you just have to own the fastest horse. This isn’t complicated. Today I dumped all my Monero for Bitcoin and feel cleansed. Fuck building a decentralized cryptocurrency that actually works. Let&#39;s get the money first and then we&#39;ll change the rules. I hope you accept latecomers.</p>\n\n<p>Bitcoin to the moon!</p>\n</div><!-- SC_ON -->",
  "score": 414,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/xZKc5yfsBIIfEp2Pz-8CiD7RnvQNP0k-zUcvaJPAb7o.jpg?auto=webp&s=fd57dd7b133add99db40ab7dc30047d68779d66f",
          "width": 140,
          "height": 72
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/xZKc5yfsBIIfEp2Pz-8CiD7RnvQNP0k-zUcvaJPAb7o.jpg?width=108&crop=smart&auto=webp&s=ff107b26040721985283593318455dab63956078",
            "width": 108,
            "height": 55
          }
        ],
        "variants": {},
        "id": "b_dx26p_4k_6sfgV7wIOkLugW47R7FhiPlH7gmHZ_4c"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/md8m0b/why_i_sold_all_my_monero_for_bitcoin_and_why_you/",
  "subreddit": "CryptoCurrency",
  "id": "md8m0b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357135579
}