{
  "author": "coinsntings",
  "the_new_excerpt": "I got into crypto last year just after the crash on a whim and obviously it’s\ngone quite well. I frequently talk about crypto to my family and my youngest\nbrother (13) has started looking at past graphs and prices. I never encouraged\nthis, I don’t believe in shilling any investment to anyone at any…",
  "original_created_utc": 1617889860,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "去年の暴落直後に気まぐれで暗号に手を出しましたが、明らかにうまくいっています。\nかなりうまくいっています。家族にも暗号の話をよくするのですが、一番下の弟（13歳）が過去のグラフや価格を見始めました。\n弟（13歳）は過去のグラフや価格を見始めました。勧めたことはありません。\nどんな投資でも、誰かに見せびらかすようなことはしませんから...",
      "title": "家族に暗号の説明をしたら、一番下の弟に「もっと早く参加しなかったのは馬鹿だ」と言われた。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "去年股灾后我一时兴起就进入了加密领域，显然这是\n进展相当顺利。我经常跟我的家人谈论加密技术，我最小的孩子\n弟弟（13岁）已经开始看过去的图形和价格。我从不鼓励\n这一点，我不相信向任何人推销任何投资，在任何... ...",
      "title": "我向我的家人解释了加密技术，我的小兄弟说我是个白痴，因为我没有早点加入。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "去年股災後我一時興起就進入了加密領域，顯然這是\n進展相當順利。我經常跟我的家人談論加密技術，我最小的孩子\n弟弟（13歲）已經開始看過去的圖形和價格。我從不鼓勵\n這一點，我不相信向任何人推銷任何投資，在任何... ...",
      "title": "我向我的家人解釋了加密技術，我的小兄弟說我是個白癡，因爲我沒有早點加入。"
    }
  ],
  "title": "I explained crypto to my family and my youngest brother called me an idiot for not getting in sooner",
  "created_utc": 1617899785,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I got into crypto last year just after the crash on a whim and obviously it’s gone quite well. I frequently talk about crypto to my family and my youngest brother (13) has started looking at past graphs and prices. I never encouraged this, I don’t believe in shilling any investment to anyone at any age. Anyways he did his research and here’s his conclusion: I’m stupid for not buying in 2010. </p>\n\n<p>I agree, but I was also only 11 back then.</p>\n\n<p>Anyways, given his initiative I’ve got 0.001 BTC set aside for him. It isn’t much but I owed him a tenner for something petty a few months back and gave him the choice between cash or  Bitcoin and he choose bitcoin. This morning I updated him on his crypto and he told me I’ve got to hold on to it till he’s 18 at least. This kid knows what’s up.</p>\n\n<p>I felt really great about my crypto story but tbh his will be better. Even though he’s young he’s got a foot in the game. I just wish someone has done this for me back then lol.</p>\n</div><!-- SC_ON -->",
  "score": 960,
  "permalink": "/r/CryptoCurrency/comments/mms8qi/i_explained_crypto_to_my_family_and_my_youngest/",
  "subreddit": "CryptoCurrency",
  "id": "mms8qi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566612880
}