{
  "author": "DaveinOakland",
  "the_new_excerpt": "Over the course of the last 5 months I became a crypto market master. I managed\nto turn about 2k into just over 10k. Legit was celebrating my awesomeness like a\nweek ago as my portfolio officially cracked $10,000.\n\nI fucked up. Bad.\n\nI made a leverage call on Ethereum at 4,000 expecting it to go…",
  "original_created_utc": 1621707516,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この5ヶ月間で、私は暗号市場の達人になりました。私は約\n約2,000ドルを10,000ドル強にすることができました。1週間前、私のポートフォリオが正式に1万ドルを突破したとき、Legitは私の素晴らしさを祝福しました。\n1週間前にポートフォリオが 正式に10,000ドルを突破しました\n\n私は失敗しました。悪い。\n\nイーサリアムを4,000でレバレッジコールしたんだけど、それが上がると思っていたら...",
      "title": "人生最大の金銭的な失敗をしてしまったことを受け入れるのに、2、3日かかってしまいました。私が犯した過ちを犯さないように」と書かれた記事の山に、私も加わってみましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的5个月里，我成为了一名加密货币市场的主人。我设法\n把大约2千美元变成了1万多美元。一周前，我的投资组合正式突破1万美元，Legit公司正在庆祝我的伟大成就。\n一周前，我的投资组合正式突破了1万美元。\n\n我搞砸了。很糟糕。\n\n我在4,000点对以太坊做了一个杠杆看涨，期望它能...",
      "title": "我花了几天时间来接受犯了我一生中最大的财务错误的事实。让我在这里的一堆 \"不要犯我所犯的错误 \"的帖子中补充一下。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的5個月裏，我成爲了一名加密貨幣市場的主人。我設法\n把大約2千美元變成了1萬多美元。一週前，我的投資組合正式突破1萬美元，Legit公司正在慶祝我的偉大成就。\n一週前，我的投資組合正式突破了1萬美元。\n\n我搞砸了。很糟糕。\n\n我在4,000點對以太坊做了一個槓桿看漲，期望它能...",
      "title": "我花了幾天時間來接受犯了我一生中最大的財務錯誤的事實。讓我在這裏的一堆 \"不要犯我所犯的錯誤 \"的帖子中補充一下。"
    }
  ],
  "title": "It's taken me a couple days to come to terms with making the biggest financial mistake of my life. Let me add to the pile of \"don't make the mistake I made\" posts around here.",
  "created_utc": 1621726235,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Over the course of the last 5 months I became a crypto market master.  I managed to turn about 2k into just over 10k.  Legit was celebrating my awesomeness like a week ago as my portfolio officially cracked $10,000. </p>\n\n<p>I fucked up.  Bad.</p>\n\n<p>I made a leverage call on Ethereum at 4,000 expecting it to go back up to 4,300ish and to cash in, again.  But I was sloppy and I forgot to set a stop loss price.  I spent the next week chasing my own tail down a rabbit hole of losses trying to hopelessly save what I could.  Before I knew it, liquidated, boom, zero.  This happened so fucking fast, it feels like a year since it happened but it&#39;s still this week.</p>\n\n<p>I&#39;m sitting here with (thank God) the 1 ETH I staked and some change in BTC (like $400). The rebuild has begun.  It hurts, bad.  No one to blame but me.  It&#39;s hard to not blame Elon, China, or whoever but it was my mistake.</p>\n\n<p>And all it took was one.</p>\n\n<p>With that said, time to get to work rebuilding, I know I&#39;m not the only one, and there is something therapeutic about coming to a space that you know is going to say &quot;I told you so&quot; and just owning up to your mistake.  </p>\n\n<p>So my name&#39;s Dave, I lost everything to a sloppy leverage play, I&#39;m starting back from zero, who&#39;s with me?</p>\n\n<p>-edit- \nOk technically not EVERYTHING, since I had something staked.</p>\n</div><!-- SC_ON -->",
  "score": 1258,
  "permalink": "/r/CryptoCurrency/comments/nionbp/its_taken_me_a_couple_days_to_come_to_terms_with/",
  "subreddit": "CryptoCurrency",
  "id": "nionbp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197383360
}