{
  "author": "CaptnPilot",
  "original_created_utc": 1626956885,
  "title": "Yesterday, a 15 year old kid in my neighborhood asked if he could cut my grass for BTC, ETH, or Doge.",
  "created_utc": 1626975341,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Kinda surprised a 15 year would even care about this at all, but I guess it&#39;s a good thing.   </p>\n\n<p>Not even sure how I would be able to pay him such a small amount ($15) weekly without getting destroyed on fees. The only one that seems feasible is Doge, and well, idk if I want to watch this kid work hard just to lose all his money before Christmas.   </p>\n\n<p>Is there a way I could actually pay this kid $15 week without losing a lot on the transaction costs?</p>\n</div><!-- SC_ON -->",
  "score": 580,
  "permalink": "/r/CryptoCurrency/comments/opctk6/yesterday_a_15_year_old_kid_in_my_neighborhood/",
  "subreddit": "CryptoCurrency",
  "id": "opctk6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Kinda surprised a 15 year would even care about this at all, but I guess it's a\ngood thing.\n\nNot even sure how I would be able to pay him such a small amount ($15) weekly\nwithout getting destroyed on fees. The only one that seems feasible is Doge, and\nwell, idk if I want to watch this kid work hard…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "15歳でこのようなことを気にするとは驚きですが、これは良いことだと思います。\nいいことだと思います。\n\nこんなに少ない金額（15ドル）を、毎週どうやって彼に払えばいいのかもわからない。\nどうやって毎週払えばいいのかわかりませんが、手数料を払わずに 実現できそうなのはDogeだけだし\nこの子が頑張っている姿を見たいかどうかはわかりませんが・・・。",
      "title": "昨日、近所の15歳の子供が、BTC、ETH、Dogeで草刈りをしてくれないかと言ってきました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很惊讶一个15岁的孩子竟然会关心这个问题，但我想这是一个\n好事。\n\n我甚至不知道我如何能够每周向他支付这么少的钱（15美元），而不至于在费用上遭到破坏。\n而不至于在费用上遭到破坏。唯一一个看起来可行的是Doge，而\n嗯，我不知道我是否想看着这孩子努力工作......",
      "title": "昨天，我家附近的一个15岁的孩子问他是否可以用BTC、ETH或Doge给我剪草。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很驚訝一個15歲的孩子竟然會關心這個問題，但我想這是一個\n好事。\n\n我甚至不知道我如何能夠每週向他支付這麼少的錢（15美元），而不至於在費用上遭到破壞。\n而不至於在費用上遭到破壞。唯一一個看起來可行的是Doge，而\n嗯，我不知道我是否想看着這孩子努力工作......",
      "title": "昨天，我家附近的一個15歲的孩子問他是否可以用BTC、ETH或Doge給我剪草。"
    }
  ]
}