{
  "author": "ultron290196",
  "original_created_utc": 1629794126,
  "title": "Can we all take a moment to thank China for their ultimate sacrifice by shutting themselves off from the future.",
  "created_utc": 1629801788,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>China was the dominant mining force of the world. Dominant is a way that it was starting to become concerning that they hold too much power. 65% of the hashrate.</p>\n\n<p>Controversies were flying around that BTC is their brain child to dominate the world economy. Well that FUD has been broken thanks to their own callousness, inability to comprehend their own power and shutting themselves off from the new paradigm. </p>\n\n<p>Nevertheless they still hold 46% of the hashrate. Even despite the mining ban. However it has lost the 51% dominance and other countries like the US, Kazakhstan, etc are catching up.</p>\n\n<p>The hashrate in China could continue to fall as their government keeps cracking down on the miners.</p>\n\n<p>Thank you for giving us a hard reset and giving other countries a chance to catch up.</p>\n</div><!-- SC_ON -->",
  "score": 332,
  "permalink": "/r/CryptoCurrency/comments/paj9sx/can_we_all_take_a_moment_to_thank_china_for_their/",
  "subreddit": "CryptoCurrency",
  "id": "paj9sx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "China was the dominant mining force of the world. Dominant is a way that it was\nstarting to become concerning that they hold too much power. 65% of the\nhashrate.\n\nControversies were flying around that BTC is their brain child to dominate the\nworld economy. Well that FUD has been broken thanks to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "中国は、世界の圧倒的な鉱山力を誇っていました。支配的というのは、彼らがあまりにも大きな力を持っていることが問題になり始めたということです。\n力を持ちすぎていることが問題になり始めていました。の65％を占めています。\nハッシュレート。\n\nBTCは彼らが世界経済を支配するために考え出したものだという論争が飛び交っていました。\n議論が飛び交っていました。しかし、その不安は、...",
      "title": "未来を閉ざしてしまった中国の犠牲に感謝しましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "中国是世界上最主要的采矿力量。主导是一种方式，它是\n开始变得令人担忧，他们掌握了太多的权力。65%的\nhashrate。\n\n争议四起，认为BTC是他们主宰世界经济的智囊团。\n世界经济。好了，这种疑虑已经被打破了，因为...",
      "title": "我们能不能花点时间感谢中国做出的最终牺牲，将自己与未来隔绝。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "中國是世界上最主要的採礦力量。主導是一種方式，它是\n開始變得令人擔憂，他們掌握了太多的權力。65%的\nhashrate。\n\n爭議四起，認爲BTC是他們主宰世界經濟的智囊團。\n世界經濟。好了，這種疑慮已經被打破了，因爲...",
      "title": "我們能不能花點時間感謝中國做出的最終犧牲，將自己與未來隔絕。"
    }
  ]
}