{
  "author": "AskScienceModerator",
  "original_created_utc": 1647428456,
  "title": "AskScience AMA Series: I'm Patrick Long, M.D. and I am a geneticist with a specific interest in the adult genetics field. I just started an adult genetics clinic, SequenceMD, to address the needs of this widely underserved population. AMA!",
  "created_utc": 1647438049,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi Reddit! SequenceMD team here: we are Dr. Patrick Long and genetic counselor, Alisha. We&amp;#39;re here to answer any questions you may have about medical genetics or... anything!&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;ll start by answering our own question: why adult genetics? Genetic testing is a routine part of the diagnostic workup for many childhood onset disorders including cerebral palsy, developmental delay, movement disorders, etc. Your genes don&amp;#39;t change when you turn 18, but it&amp;#39;s still not standard of care to test adults living with these disorders. In some cases, genetic testing can reveal treatment options, management guidelines, or preventative care, that is very much relevant to adults. Most geneticists in the United States are pediatric focused. Adults who are able to see a geneticist may face long wait lists or be denied testing. We believe that genetic testing should be an accessible choice for those who are interested. &lt;/p&gt;\n\n&lt;p&gt;Username: &lt;a href=\"/u/SequenceMD\"&gt;/u/SequenceMD&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 135,
  "permalink": "/r/askscience/comments/tff16f/askscience_ama_series_im_patrick_long_md_and_i_am/",
  "subreddit": "askscience",
  "id": "tff16f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi Reddit! SequenceMD team here: we are Dr. Patrick Long and genetic counselor,\nAlisha. We're here to answer any questions you may have about medical genetics\nor... anything!\n\nWe'll start by answering our own question: why adult genetics? Genetic testing\nis a routine part of the diagnostic workup…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Redditの皆さん、こんにちは。SequenceMDチームです：私たちはパトリック・ロング博士と遺伝カウンセラーです。\nアリーシャです。私たちは、遺伝学に関するあらゆる質問にお答えします。\nとか、なんでもいいんです。\n\nまずは、私たち自身の質問に答えることから始めましょう：なぜ成人遺伝学なのか？遺伝学的検査\n診断の一環として日常的に行われています。",
      "title": "AskScienceのAMAシリーズ。私はパトリック・ロング医学博士で、成人の遺伝学分野に特別な関心を持つ遺伝学者です。私は成人遺伝学クリニック、SequenceMDを始めたばかりで、この広く行き届いていない人々のニーズに対応するためです。AMA!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Hi Reddit! 我是SequenceMD团队：我们是Patrick Long博士和遗传咨询师。\nAlisha。我们在这里回答你可能有的关于医学遗传学的任何问题\n或......任何问题!\n\n我们首先要回答我们自己的问题：为什么是成人遗传学？基因测试\n是诊断工作的一个常规部分...",
      "title": "AskScience AMA系列。我是帕特里克-朗，医学博士，我是一名遗传学家，对成人遗传学领域有着特殊的兴趣。我刚刚创办了一家成人遗传学诊所，SequenceMD，以满足这一广泛服务不足的人群的需求。AMA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Hi Reddit! 我是SequenceMD團隊：我們是Patrick Long博士和遺傳諮詢師。\nAlisha。我們在這裏回答你可能有的關於醫學遺傳學的任何問題\n或......任何問題!\n\n我們首先要回答我們自己的問題：爲什麼是成人遺傳學？基因測試\n是診斷工作的一個常規部分...",
      "title": "AskScience AMA系列。我是帕特里克-朗，醫學博士，我是一名遺傳學家，對成人遺傳學領域有着特殊的興趣。我剛剛創辦了一家成人遺傳學診所，SequenceMD，以滿足這一廣泛服務不足的人羣的需求。AMA!"
    }
  ]
}