{
  "author": "shleebs",
  "the_new_excerpt": "STOP ASKING ABOUT THE NEXT DIP AND READ CAREFULLY\n\nIt's pointless to try and time the market. Bitcoin has an average of 200% gains\nevery year since it was invented. I am not a day trader, I don't give a flying\nfuck what the new \"price floor\" is. As someone who has been watching the market\nfor 7…",
  "original_created_utc": 1612224798,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "不要再问下一个DIP，仔细阅读。\n\n试图给市场计时是没有意义的。比特币平均有200%的收益。\n自从它被发明以来，每年都在增加。我不是一个日间交易员，我不给一个飞翔的\n去他妈的什么是新的 \"价格底线\"。作为一个一直在观察市场的人\n为7...",
      "title": "对于所有询问下一个DIP的新人，请阅读以下内容"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不要再問下一個DIP，仔細閱讀。\n\n試圖給市場計時是沒有意義的。比特幣平均有200%的收益。\n自從它被髮明以來，每年都在增加。我不是一個日間交易員，我不給一個飛翔的\n去他媽的什麼是新的 \"價格底線\"。作爲一個一直在觀察市場的人\n爲7...",
      "title": "對於所有詢問下一個DIP的新人，請閱讀以下內容"
    }
  ],
  "title": "TO ALL NEWCOMERS ASKING ABOUT THE NEXT DIP PLEASE READ",
  "created_utc": 1612254735,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>STOP ASKING ABOUT THE NEXT DIP AND READ CAREFULLY</p>\n\n<p>It&#39;s pointless to try and time the  market. Bitcoin has an average of 200% gains every year since it was  invented. I am not a day trader, I don&#39;t give a flying fuck what the new  &quot;price floor&quot; is. As someone who has been watching the market for 7 years I can tell you this: Buy as much of it as you can whenever you can afford it. Wait 5 years, and thank me. Every single person with experience will tell you  the same thing. STOP TRYING TO TIME THE MARKET AND JUST BUY. I could  give you my opinion about the short term price action, but I could be  wrong and it doesn&#39;t really matter anyways. The money you may save is  not enough to justify sitting on the side lines. If it hits 220K this  year and falls back to 50k, then you will just tell yourself it&#39;s too late and &quot;I should have bought in at $33,000&quot;. DO YOU GET IT YET? If you buy in at $33k and it falls, to $20k, who the fuck cares? Buy more. In 5 years your $33k buy will be worth a shit load. Not to mention you will be a part of the new monetary network.</p>\n\n<p>Even though I HAVE NO IDEA WHAT IS GOING TO HAPPEN, I can tell you what I personally think will happen. 30k is our support level for now until price breaks bullish. It will have an incredible run up to  somewhere near 220k and fall to an unknown level. Could be 50k, could  be 100k. I doubt it will fall below 40k ever again after it makes this run because there are too many strong hands in Bitcoin now unlike 2017.  Historical data is useless when talking Bitcoin because it&#39;s an emerging technology unlike other comparative assets. There is no guarantee of anything. If you buy in at 200k IT IS STILL A SMART MOVE because I think Bitcoin&#39;s true value is in the millions.</p>\n\n<p>This is not financial advise. Sometimes I put my finger in my butt and smell it, hard.</p>\n</div><!-- SC_ON -->",
  "score": 378,
  "permalink": "/r/Bitcoin/comments/laih55/to_all_newcomers_asking_about_the_next_dip_please/",
  "subreddit": "Bitcoin",
  "id": "laih55",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518525374
}