{
  "author": "FuzzyJesusX21",
  "original_created_utc": 1652614228,
  "title": "Not being political but am actually curious, how is it that cops seem to detain these mass shooters but so many end up killing someone over smaller crimes?",
  "created_utc": 1652627769,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It’s weird right? I mean, we hear about police abuse so much and over nothing to smaller crimes like drugs that it feels like the majority of them are untrained and scared. However when a mass shooting comes up, so many cops become tactical, patient. Pulling away from big emotional issues or political points of view, why does this seem that cops become more level headed in these situations? Is it because their bosses are usually on the scene? Is it because there are more of them? Are different quality of cops called in for these situations?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/NoStupidQuestions/comments/uq44so/not_being_political_but_am_actually_curious_how/",
  "subreddit": "NoStupidQuestions",
  "id": "uq44so",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It’s weird right? I mean, we hear about police abuse so much and over nothing to\nsmaller crimes like drugs that it feels like the majority of them are untrained\nand scared. However when a mass shooting comes up, so many cops become tactical,\npatient. Pulling away from big emotional issues or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "変でしょう？つまり、私たちは警察の虐待についてよく耳にしますし、麻薬のような小さな犯罪には何もしません。\n警察官の大半は訓練を受けていないような気がします。\n怯えているように感じます。しかし、大量殺人が起きると、多くの警官が戦術的になる。\n忍耐強くなります。大きな感情的問題から遠ざかり...",
      "title": "政治的なことではなく、実は興味があるのですが、警察はこれらの大量殺人犯を拘留するようですが、多くの人はより小さな犯罪のために誰かを殺してしまうのはどうしてでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这很奇怪吧？我的意思是，我们听到了很多关于警察滥用职权的消息，而对于像毒品这样较小的犯罪行为，我们却一无所知。\n小的犯罪，如毒品，感觉他们中的大多数人都没有经过训练\n和害怕。然而，当大规模枪击事件发生时，许多警察就会变得有策略。\n耐心。从大的情感问题上拉开距离，或者...",
      "title": "不是政治性的，但实际上我很好奇，为什么警察似乎可以拘留这些大规模的枪手，但那么多的人最终却因为较小的罪行而杀人？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這很奇怪吧？我的意思是，我們聽到了很多關於警察濫用職權的消息，而對於像毒品這樣較小的犯罪行爲，我們卻一無所知。\n小的犯罪，如毒品，感覺他們中的大多數人都沒有經過訓練\n和害怕。然而，當大規模槍擊事件發生時，許多警察就會變得有策略。\n耐心。從大的情感問題上拉開距離，或者...",
      "title": "不是政治性的，但實際上我很好奇，爲什麼警察似乎可以拘留這些大規模的槍手，但那麼多的人最終卻因爲較小的罪行而殺人？"
    }
  ]
}