{
  "author": "LevyShorts",
  "original_created_utc": 1653349297,
  "title": "How far back does \"Jody\" go? Did Redcoats fret about their wives schtupping some Northumbrian baronet back home during the Seven Years' War? Mongols during their conquest? Roman centurions?",
  "created_utc": 1653396801,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In case you&amp;#39;re unfamiliar: &amp;quot;Jody&amp;quot; is a common American military slang term for a man who stays behind at home while a soldier, sailor, marine, or airman is off fighting. Jody gets to enjoy all the pleasures of home, including, usually, the girlfriends and wives of those overseas. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d imagine this phenomenon is not new, but I&amp;#39;d like to learn just how much it was openly discussed in the militaries of the past, what jokes and memes they had, and, on a more serious note, how fighters with significant others back home dealt with the worry of betrayal back in the day.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/uwdkwu/how_far_back_does_jody_go_did_redcoats_fret_about/",
  "subreddit": "AskHistorians",
  "id": "uwdkwu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In case you're unfamiliar: \"Jody\" is a common American military slang term for a\nman who stays behind at home while a soldier, sailor, marine, or airman is off\nfighting. Jody gets to enjoy all the pleasures of home, including, usually, the\ngirlfriends and wives of those overseas.\n\nI'd imagine this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ジョディ」とは、米軍の俗語で、兵士や水兵、海兵隊員、航空隊員の休暇中に家に残る男性のことを指します。\n兵士、水兵、海兵隊員、飛行士が戦っている間、家に残っている男のことを指す。\nジョディとは、アメリカ軍の俗称で、兵士、水兵、海兵隊員、空士が戦っている間、家に残る男性のことです。Jodyは故郷の楽しみをすべて味わうことができ、その中には通常、海外にいる兵士のガールフレンドや妻も含まれます。\n海外にいる兵士のガールフレンドや奥さんも一緒にね\n\n想像するに...",
      "title": "ジョディ」とはどこまでさかのぼるのだろう？七年戦争の時 レッドコートは 女房が男爵と寝るのを心配してた？モンゴルの征服の時は？ローマの百人隊長？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你不熟悉：\"乔迪 \"是一个常见的美国军事俚语，指的是在士兵、水手、海军陆战队员或飞行员外出时留在家里的人。\n当士兵、水手、海军陆战队员或飞行员外出时，留在家里的人。\n战斗。裘迪可以享受家里所有的乐趣，包括，通常情况下的\n包括那些在海外的女友和妻子。\n\n我可以想象这...",
      "title": "\"乔迪 \"的历史有多长？在七年战争期间，红衣人是否担心他们的妻子会把某个诺森布里亚男爵赶回家？蒙古人在其征服期间？罗马百夫长？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你不熟悉：\"喬迪 \"是一個常見的美國軍事俚語，指的是在士兵、水手、海軍陸戰隊員或飛行員外出時留在家裏的人。\n當士兵、水手、海軍陸戰隊員或飛行員外出時，留在家裏的人。\n戰鬥。裘迪可以享受家裏所有的樂趣，包括，通常情況下的\n包括那些在海外的女友和妻子。\n\n我可以想象這...",
      "title": "\"喬迪 \"的歷史有多長？在七年戰爭期間，紅衣人是否擔心他們的妻子會把某個諾森布里亞男爵趕回家？蒙古人在其征服期間？羅馬百夫長？"
    }
  ]
}