{
  "author": "ta_pi",
  "original_created_utc": 1636858754,
  "title": "I just realised why cash isn't worth having",
  "created_utc": 1636879396,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It hit me the other day that money (fiat) isn&#39;t worth having. For now you need it to spend on most things still but holding it is a liability. It&#39;s designed to lose its worth, so you have to spend it or buy assets. It&#39;s good for the masses to keep it in circulation.</p>\n\n<p>Anyway - the point that dawned on me was this: <strong>It isn&#39;t that assets appreciate, it&#39;s more that they just don&#39;t lose value like cash</strong>. Take a range of asset classes like property, gold, etc. It looks like their value increases, but on average what you&#39;re seeing is just what the money you purchased them with <em>would</em> be worth if it weren&#39;t designed to deflate.</p>\n\n<p>It&#39;s not assets increasing in worth - it&#39;s the dollars they cost falling in value. They&#39;re really just a hedge against inflation. Some better and worse than others.</p>\n\n<p>Monetary policy erodes savings.</p>\n\n<p>The average person can&#39;t get an interest rate to beat inflation, and when they do they are taxed on it - even where the real value of their money is <em>less</em>.</p>\n\n<p>One of the wonderful things about <strong>bitcoin</strong> is that eventually everyone will be able to have <strong>savings that don&#39;t lose value.</strong> People won&#39;t have to hand money to a bank or investment fund where the financial industry take their cut.</p>\n\n<p>Imagine millions of people whose savings can be relied upon, where if you do nothing after 2, 5 or 10 years no government or financial institution has robbed them of their value.</p>\n\n<p>It&#39;s very exciting!</p>\n</div><!-- SC_ON -->",
  "score": 180,
  "permalink": "/r/Bitcoin/comments/qtgii6/i_just_realised_why_cash_isnt_worth_having/",
  "subreddit": "Bitcoin",
  "id": "qtgii6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It hit me the other day that money (fiat) isn't worth having. For now you need\nit to spend on most things still but holding it is a liability. It's designed to\nlose its worth, so you have to spend it or buy assets. It's good for the masses\nto keep it in circulation.\n\nAnyway - the point that dawned…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先日、お金（不換紙幣）は持つ価値がないと思いました。今のところ、ほとんどのことに使うには必要ですが\n必要ですが、それを持っていることは負債です。価値が失われるように設計されています。\n価値がなくなるように設計されているので、使うか資産を買わなければなりません。大衆のためには\n流通させておくことは、大衆にとっては良いことです。\n\nいずれにしても、ここで気付いたことは...。",
      "title": "現金を持つ価値がない理由がわかった"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一天我突然发现，钱（法币）并不值得拥有。现在你需要\n它在大多数事情上仍然需要花费，但持有它是一种责任。它的目的是要\n它被设计成会失去价值，所以你必须花费它或购买资产。这对大众来说是件好事\n让它保持流通。\n\n总之--恍然大悟的一点是......",
      "title": "我刚刚意识到为什么现金不值得拥有"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一天我突然發現，錢（法幣）並不值得擁有。現在你需要\n它在大多數事情上仍然需要花費，但持有它是一種責任。它的目的是要\n它被設計成會失去價值，所以你必須花費它或購買資產。這對大衆來說是件好事\n讓它保持流通。\n\n總之--恍然大悟的一點是......",
      "title": "我剛剛意識到爲什麼現金不值得擁有"
    }
  ]
}