{
  "author": "pooperT100",
  "the_new_excerpt": "TLDR;\n\n 1. QNX is the most secure EV Real Time Operating System proven by customer\n    traction – its in 175m cars, top 19/25 car producers\n 2. EV cybersecurity cars are important. Without it, people can hack your car\n    and crash it into your wall\n 3. QNX as the main operating system opens up data…",
  "original_created_utc": 1612403745,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "TLDR。\n\n 1. QNX是经过客户验证的最安全的EV实时操作系统。\n    牵引力--其在1.75亿辆汽车中，前19/25家汽车生产商中。\n 2. 电动车网络安全汽车很重要。没有它，人们可以黑掉你的车\n    撞上你的墙\n 3. QNX作为主操作系统，开启了数据...",
      "title": "Blackberry $BB DD PT 100"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TLDR。\n\n 1. QNX是經過客戶驗證的最安全的EV實時操作系統。\n    牽引力--其在1.75億輛汽車中，前19/25家汽車生產商中。\n 2. 電動車網絡安全汽車很重要。沒有它，人們可以黑掉你的車\n    撞上你的牆\n 3. QNX作爲主操作系統，開啓了數據...",
      "title": "Blackberry $BB DD PT 100"
    }
  ],
  "title": "Blackberry $BB DD PT 100",
  "created_utc": 1612409060,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TLDR;</p>\n\n<ol>\n<li>QNX is the most secure EV Real Time Operating System proven by customer traction – its in 175m cars, top 19/25 car producers</li>\n<li>EV cybersecurity cars are important. Without it, people can hack your car and crash it into your wall</li>\n<li>QNX as the main operating system opens up data related business models</li>\n<li>Amazon / Blackberry IVY is a JV with Amazon where they combined entity will begin monetizing its users</li>\n<li>The legacy cybersecurity business is still valuable proven by customers – 9/10 largest banks, 18/20 of G20 countries</li>\n<li>Any other EV technology is a point solution, Blackberry is a platform play on EVs</li>\n<li>Blackberry has its users, it just needs to monetize them. AND the user segment is growing exponentially.</li>\n<li>If you thought the VC scene got big because of Amazon Alexa or Google Home, wait till you see the businesses incoming in BlackberryIVY</li>\n<li>Based on my DCF, my one year target price is over C$106 or USD$82 per share.</li>\n</ol>\n\n<p>NOTE THIS ISN’T Blackberry QNX going SAAS. This is QNX becoming a platform play that takes a tax anytime you ever want</p>\n\n<p>to do anything in a car. Business model isn’t make the car manufacturer pay. Business model is your data sold to people / insurance providers.</p>\n\n<p>&#x200B;</p>\n\n<p>Have you seen Fast and Furious where autonomous vehicles become zombie cars, or Upload where the main character gets smashed into a building? Sounds stupid yes, but it is a real threat when someone can hack into your car and kill you instantly. Shout out to <a href=\"https://www.reddit.com/u/justaneverydaylife/\">u/justaneverydaylife</a> for providing excellent DD on this which made me jump in .I’m going to fully quote <a href=\"https://www.reddit.com/u/justaneverydaylife/\">u/justaneverydaylife</a> here because the summary is excellent, and any changes would dilute the message.</p>\n\n<p>QNX is the first commercial microkernel RTOS. What the fuck does that even mean nerd? For anyone like me who&#39;s not a software genius, I&#39;ve done some research so we all know what we&#39;re getting into. A Real Time Operating System is developed to focus processing power on two most important things: Speed and Accuracy. This is different from shit like Windows and Mac OS (General Purpose OS or GPOS) as they spread processing power throughout the system because there isn&#39;t exactly anything that&#39;s significantly more important than the others. However, when you&#39;re using a self-driving program you need the hardware to perform the action at the exact time and speed. Your self driving program brakes too late? Crash into the car ahead of you. Your self program turns the wheel too late or too soon? Crash into a wall.</p>\n\n<p>Blackberry has been working on this technology since 2014. But car makers literally couldn&#39;t develop autonomous vehicles fast enough. So these guys have just been twiddling their fucking thumbs. Fast forward to now, where the rise of Tesla has made everyone and their momma make a self driving EV. Everyone is trying to make their own autopilot program but not their own OS. So who&#39;s OS are they using? SONY? Blackberry QNX. Baidu? QNX baby. XPENG? Blackberry as well. If you read the article, you&#39;ll see XPEV is using DESAY&#39;s autopilot program that&#39;s built on QNX. Know who else is using DESAY autopilot? Li Auto But what about Nio you might ask? Well on NIO day, it was announced that NIO will be using Nvidia DRIVE....which is also built on QNX. What about the Apple car? There&#39;s no confirmation yet, but rumors of them reaching out to both Canoo and Hyundai makes me skeptical that Apple has succeeded in creating their own RTOS even after rumors of them starting 7 years ago. But even if they did... it doesn&#39;t even matter. You might have noticed that I didn&#39;t mention Tesla at all. That&#39;s because they have developed their own Linux-based Operating system, which Tesla has been having trouble getting it approved by US safety regulations. QNX on the other hand, already is. $BB to the fucking moon.</p>\n\n<p>Back in September 24, 2020, Blackberry published a research study on why microkernel systems are more secure. A bit of a TLDR currently, other systems are developed in a Monolithic OS architecture, namely Tesla and a few others. A decent primer on a comparison between the two here. Long story short, if a single component of a Microkernel system fails, the incident is only isolated to the component. I.e. if your air conditioning malfunctions, it will only effect your air condition and would not shut down your autopilot.</p>\n\n<p>Facebook, WeChat and WhatsApp decide to charge its users $100 for a one-time upfront fee, with the option to charge its users in a recurring method in the future, do we reward them or punish them? Yes I understand they’re monetizing data, not exactly comparable here and yes you have to buy a new car to have a new user on QNX. Let’s be a little less bearish and think through the lens of a Venture Capitalist. Blackberry is in its customer acquisition phase it will find unlimited ways to monetize its user base as it has proven to be and will continue to be the leading Real Time Operating System for vehicles. QNX current user acquisition cost is net positive. It does not pay money to acquire users, it receives money to acquire users. WHAT A CRAZY THOUGHT. By the way, it’s already in 175m cars across 45+ automakers . If Blackberry was an anonymous company you saw in 175m cars with unlimited ways to monetize its userbase, how valuable is that? Taking a 2 minute brainstorm session for ways to monetize an operating system, also linked a McKinsey report on monetizing these systems:</p>\n\n<p>- Royalties on any apps developed on the platform and used in car;</p>\n\n<p>- Collecting data from user driving habits used to:</p>\n\n<p>o Price auto insurance;</p>\n\n<p>▪ Provide accurate pricing for AUTONOMOUS Auto Insurance (which no one has a clue how to price</p>\n\n<p>yet)</p>\n\n<p>o Anonymize and plan driving routes for governments making more efficient urban planning</p>\n\n<p>o Create more efficient batteries based on energy usage</p>\n\n<p>o Develop stronger car sharing systems (UBER, Rent-a-car, distributed ownership) and recommendations for users</p>\n\n<p>- Monetize the attention span that is now freed up as a result of fully autonomous cars</p>\n\n<p>- An actual profitable UBER/Lyft business model with Autonomous Vehicles</p>\n\n<p>- Really create any business model where now you own the car</p>\n\n<p>If you thought the VC scene got big because of Amazon Alexa or Google Home, wait till you see the businesses incoming in BlackberryIVY.</p>\n\n<p>- Alexa and Google Home are integrated into your life yes. But for those that spend time commuting. In the eyes of a VC, you’ve now freed up 1-2hours of your day of attention span. They want your attention span and they will build businesses on it.</p>\n\n<p>As car manufacturers entrench its vehicles the BB QNX platform, who’s to say this does not become a platform with stickiness equivalent to Facebook, Whatsapp or Instagram? Oh is it the network effect you say? Leads me to my next point. Included pic from management presentation below regarding the channels BlackberryIVY unlocks.</p>\n\n<p>Intel</p>\n\n<p>From <a href=\"https://www.reddit.com/u/987djf3498dwesrf/\">u/987djf3498dwesrf</a></p>\n\n<p>Intel and BB are working on integrating Vulkan API to QNX. That means Intel is getting in on it. That combined with Intel&#39;s mature suite of tools they got from buying mobileeye (supplier of Tesla&#39;s auto pilot v1) Also BB and Nissan I think have a tight history. I think Nissan was one of the first auto makers to use QNX. Nissan also uses Intel&#39;s self driving hardware in their vehicles. Nissan hasn&#39;t been discussing their long-term EV plans in North America, only announced the ariya which I think is being made in Japan? The earliest info started in 2005 and saw another in 2015 regarding the development of Advanced Driver Assistance systems. I don’t know what it means, but when I see Intel (Big company) partner with Blackberry, I see $$$.</p>\n\n<p>NVIDIA</p>\n\n<p>Oh ya, did you know NVIDIA is integrating its hardware with QNX tech too, announced I 2018? Now it’s in XPENG, another prominent EV player. If you haven’t noticed, John Chen is Chinese, there are a lot of Chinese EV companies. China has been ahead of the game for awhile, let’s face it folks there is something here!</p>\n\n<p>Partnership with Baidu</p>\n\n<p>Yes this is important. Baidu is Chinese Google. They’re the th company to test fully driverless cars in California. Last September they demonstrated level 4 Autonomous vehicles, they are pretty advanced in this space. Yet they decided they needed to partner with Blackberry.</p>\n\n<p>Growing List of Brands that use QNX</p>\n\n<p>Please let me know if I’ve missed any</p>\n\n<p>: Audi, BMW, Ford, GM, Honda, Hyundai, Jaguar Land Rover, KIA, Maserati,</p>\n\n<p>Mercedes-Benz, Porsche, Toyota, Volkswagen, XPENG, Desay SV, Li Auto, Nio (using NVIDIA Drive).</p>\n\n<p>How much would you pay to hack into the G20 Countries? How much would you pay to hack into the</p>\n\n<p>9/10 of the largest global banks? How much would you pay to hack into the 9/10 automakers?</p>\n\n<p>Without needing to show a parabolic graph and 45 degree arrow showing CAGR of 20% YoY, its clear that this world is becoming increasingly digitally connected. Directly correlated to this is the impact of a potential attack on these ecosystems. More devices, more damage from a single hack as it effects more people. Blackberry currently sells to 18/20 of G20 governments and 9/10 of the largest global banks</p>\n\n<p>. The banks alone generate just under $1tn of revenue</p>\n\n<p>. We all know that these governments and banks have all arrived at the same conclusion, that</p>\n\n<p>Blackberry provides the most compelling cybersecurity services.</p>\n\n<p>At the time of writing this report, the market cap of Blackberry is $10bn. If a larger malicious body purchases a controlling interest of Blackberry, how much would they pay? $10bn? $20bn? $100bn? How much would it be worth to them? Put simply, someone comes in to purchase a majority stake of Blackberry, announces that they are discontinuing all services, the disarray that that would cause for even temporary period would justify BB at its current price and even more.</p>\n\n<p>Directly taken from <a href=\"https://www.reddit.com/u/MoveSwiftly/\">u/MoveSwiftly</a> because it’s a great summary</p>\n\n<p>- QNX: Embedded system OS.</p>\n\n<p>oMulti-OS housing: It has the capability to allow for multiple OSs on a single chip.</p>\n\n<p>oReal-time availability/software prioritization: Not all pieces of software operate on the same priority. Steering/braking would be higher priority than media, and QNX allows for that. Even if the thread/core is shared with other applications, when high priority software is requesting a resource it will be prioritized to ensure reliability.</p>\n\n<p>oResource sharing: CPU, RAM, and GPU resource sharing between different applications capability. Two applications can share the same CPU core and bump each other based on prioritization.</p>\n\n<p>oWhy not Linux? QNX has the highest certification for security available. Linux does not. CEOs would want to avoid liability and this certification allows for that. oDevice agnostic: It can be installed on any device, not just cars. Any IoT and offline device can use QNX.</p>\n\n<p>- QNX Hypervisor: Consolidate multiple OSs on a single SoC using virtualization</p>\n\n<p>oSoC: System on a chip. Instead of using multiple ECUs, which is what car manufacturers currently do, they can use one single chip to run multiple high priority applications and multiple OSs. This is what Tesla does now.</p>\n\n<p>oVirtualization: Running an OS in a virtual environment. Think Linux environment inside of Windows. This helps with debugging for developers without having to have the actual hardware.</p>\n\n<p>- IVY: Scalable cloud-connected software platform for vehicles.</p>\n\n<p>oWhat is it a solution for? When a vehicle manufacturer wants a way to transmit the QNX/OS data safely, normalize it, and visualize it/interact with it. It also allows car manufacturers to own the data, unlike other OSs.</p>\n\n<p>oScalable: AWS servers are capable of handling the load from many endpoints.</p>\n\n<p>oSoftware platform: There is currently no centralized software ecosystem for vehicles. IVY is providing that.</p>\n\n<p>oNon-BB developers would be able to use an SDK to develop applications on IVY for infotainment/general apps/others. IVY will also use ML to gain insight on unrecognized patterns by developers. An example of this is detecting if a car slipped, without having the developer connect multiple sensors to figure out if that event happened.</p>\n\n<p>o50/50 joint effort on revenue and effort to develop the ecosystem. Using AWS&#39;s knowledge in AI/ML for calculated sensors (slip, driver on seat, etc)</p>\n\n<p>oUsage by other vendors: A city can connect to the data from vehicles and detect when ice/slipping is happening. If brakes are getting overheated coming from a high elevation area. If a car had an accident, etc. An insurance company can provide an app to give discounts similar to the currently implemented OBD-2 readers. A maintenance provider can also connect to this data and check if an error is specific to maintenance, malpractice, or general misuse.</p>\n\n<p>- Spark: Endpoint management. Basically API security. Did not delve far into this, basic info. oUnified Endpoint Security: This is the endpoint where a laptop/phone/IoT device hits. It provides encryption and security around that. Continuous authentication is a part of it, where a device is learning the user behavior using ML and continuously checking if the behavior matches the original owner; if not, lock the device.</p>\n\n<p>oUnified Endpoint Management: Basically managing your API for devices.</p>\n\n<p>oZero trust: I think this is specifically talking about continuous authentication. Basically, it&#39;s not an authenticate once and forget it. It&#39;s constantly tracking behavior to verify the user is the authenticated user.</p>\n\n<p>- AtHoc: Non-enterprise communication system.</p>\n\n<p>oTarget customers: Government, healthcare, education, etc.</p>\n\n<p>oSolution: A communication system targeting non-enterprise businesses; specifically for Event management, cross organizational communication/collaboration, mass notifications.</p>\n\n<p>oWho does this benefit? You&#39;ve seen the hacks in healthcare/educational/governmental sector. This is specifically for them.</p>\n\n<p>- SecuSUITE: Phone application to allow employees to use work related data in personal devices without cross communication (between personal and work data).</p>\n\n<p>oEnd to end encryption.</p>\n\n<p>oSeparation of concerns between personal and work data. Employers CANNOT access your personal data.</p>\n\n<ol>\n<li>Social / Capital Markets Effects</li>\n</ol>\n\n<p>Sell-side research isn’t paid to publish accurate price targets For you non-wallstreeters out there. You have to understand the capital markets compensation model in order to understand key biases of opinion. Investment banking fees are generated at the point of a transaction: advisory fees for placing debt and equity or executing on an M&amp;A deal. Blackberry does not consistently pay the street fees, therefore less attention is spent on this file compared to others. No sell-side analyst is willing to do the research to understand this business model aside from Cars produces with QNX * QNX price.</p>\n\n<p>Further, the Canadian foundation and capital markets relationship of this company leave it dead in the water for any real technology analysts. Buy-side research doesn’t care about making you money, they want to accumulate it It’s outside the strike zone but valuation metrics will only credit this as a widget manufacturer. This is a Canadian company deemed as small cap from the US perspective, there are little to no eyes on the story. There has been little to no Investor Relations efforts You can tell that Blackberry is packed with buzzwords, IoT, smart cities, cybersecurity, EVs, AI the list goes on. They purposely keep themselves under the radar because management is not promotional. Aka. Sign of a great company.</p>\n\n<ol>\n<li>Other Boring Facts for Completion Purposes</li>\n</ol>\n\n<p>Yes, Management is still incentivized for $BB shares to perform, no insiders are not panic selling Management is competent. See chart below. Management still has a lot of shares. Also included John Chen’s ownership history, his # of shares owned only increases over time. As you can see its just for liquidity.</p>\n\n<p>Also from the financial post:</p>\n\n<p>BlackBerry Ltd. Chief Executive Officer John Chen signed a new contract worth at least US$128 million to keep him on the job for at least five years. The pay package includes 10 million restricted stock grants — valued at $128 million as of Wednesday’s close —that will vest through November 2023, the Waterloo, Ontario-based company said Thursday in a statement. Half will pay out if share-price goals of US$16 to US$20 are reached. He’ll also get a performance-based cash award if the stock hits US$30. The value of the cash grant will be disclosed in the company’s proxy circular in May, according to the statement.</p>\n\n<ol>\n<li>Valuation</li>\n</ol>\n\n<p>EVs are the future yet the biggest platform of them all gets no love – Comp to LAZR LAZR is valuated at $10.5b. Blackberry a proven technology that’s in EVs is $10b today yet people think is overvalued. LAZRs stay as LIDAR technology, how does it scale? Blackberry will control all your in car data, there’s clear longtail revenue streams with BB. LAZR generates $17m in revenue and -$70m of EBITDA. Take any other critical EV technology you will see that they are just point solutions and are not a platform play. BB is a platform play on the EV sector unlocking a multitude of new businesses.</p>\n\n<p>Financial Projections (reasonableness discussion)</p>\n\n<p>Revenue – legacy business is straight lined. BlackberryIVY – based on platform company growth rates. If you think this is unreasonable, I implore you to look at the growth rate of Facebook or any other platform company with network style growth rates. McKinsey published a report forecasting that by 2030, the recurring revenues from shared mobility expands to $1.5tn by 2030. This includes things mobility, connectivity services, feature upgrades, selling data to insurance providers etc. If Blackberry is the incumbent OS, all of these revenue streams will be flowing through BlackberryIVY. In my model I have $8bn of revenue captured in 2030 of a $1.5tn market size representing 0.5% of the overall market size shown in McKinsey’s report</p>\n\n<p>Note that Apple currently takes 30% commission from the total price of all paid apps and all in-app purchases. My model is significantly more conservative Discount Rates, Multiples Etc. – all within limits of reason for a large tech company. Note that Blackberry is a platform that already has all of its customers unlike all other growth software platforms. It’s proven / proving that it is the incumbent, it only has to monetize its users properly.</p>\n\n<ol>\n<li><p>Fun Facts that WSBers love Blackberry Jarvis is Cloud based security and is the future This shit is called Jarvis. Tony Stark was based on Elon. Elon is the future. Blackberry is the future.</p></li>\n<li><p>Catalysts</p></li>\n<li><p>BlackberryIVY begins generating recurring revenue</p></li>\n<li><p>BlackberryIVY demonstrates a network effect in generating revenue (from other apps that are built on it)</p></li>\n<li><p>BlackberryIVY announces they are selling data to insurance providers, or anyone willing to purchase the data</p></li>\n<li><p>Blackberry QNX announces additional car manufacturers that will use its platform</p></li>\n<li><p>Blackberry QNX becomes approved for autopilot</p></li>\n<li><p>Increased US institutional coverage / anyone willing to publish a decent report on what this actually is.</p></li>\n<li><p>Anyone that reads this report</p></li>\n</ol>\n\n<p>This is not my DD it is copied from another user&#39;s pdf who I cannot find, heres the link to the original,</p>\n\n<p><a href=\"https://drive.google.com/file/d/1YmBTtxxoAxW2l1cDTCKJzqsxpT7sL4j7/view\">https://drive.google.com/file/d/1YmBTtxxoAxW2l1cDTCKJzqsxpT7sL4j7/view</a></p>\n\n<p>position: 800 @ 11</p>\n</div><!-- SC_ON -->",
  "score": 886,
  "permalink": "/r/stocks/comments/lc4jz7/blackberry_bb_dd_pt_100/",
  "subreddit": "stocks",
  "id": "lc4jz7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518543326
}