{
  "author": "wpeironnet",
  "original_created_utc": 1640390468,
  "title": "Why is everyone so convinced talking about crypto gains at the family dinner is a mistake, am I the only one with family who is interested and not back stabbing thieves?",
  "created_utc": 1640431923,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My family, my middle class family, love talking finance and business. We all love talking about our work and cool new investments and ways to spend our money on future vacations or sport equipment. My family is small so maybe we have less to worry about. But no one in my family tries to get loans, steal money, and would survive an audit. My interests, like crypto, would be an awesome topic for the dinner table. Debating on why or why not it’s the future. Debating on if it’s paid off investing in risky assets and whether it’s worth looking into. For real guys if you know your family well then don’t be afraid to talk about your interests and passion such as financial freedom and the technology in crypto. No need to talk about holdings.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/rny0ld/why_is_everyone_so_convinced_talking_about_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "rny0ld",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My family, my middle class family, love talking finance and business. We all\nlove talking about our work and cool new investments and ways to spend our money\non future vacations or sport equipment. My family is small so maybe we have less\nto worry about. But no one in my family tries to get loans,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の家族は、中産階級の家族で、金融やビジネスの話が大好きです。私たちは皆\n仕事の話、新しい投資の話、お金の使い方の話が大好きです。\nを、将来のバケーションやスポーツ用品に使うことができます。私の家族は少人数なので、もしかしたら、あまり\nを心配する必要があります。しかし、私の家族は誰もローンを組もうとしない、...",
      "title": "なぜみんな、家族の夕食の席で暗号の利得について話すことが間違いだと確信しているのでしょうか。家族がいて、盗人の裏切りなどせず、関心を持っているのは私だけでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的家人，我的中产阶级家庭，喜欢谈论金融和商业。我们都\n我们都喜欢谈论我们的工作和很酷的新投资以及花钱的方法\n在未来的假期或运动设备上。我的家庭规模不大，所以也许我们有较少的\n担心的事情。但我的家庭中没有人试图获得贷款，...",
      "title": "为什么每个人都如此相信在家庭晚宴上谈论加密货币收益是一个错误，难道我是唯一一个有家人感兴趣而不是背后捅刀子的小偷？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的家人，我的中產階級家庭，喜歡談論金融和商業。我們都\n我們都喜歡談論我們的工作和很酷的新投資以及花錢的方法\n在未來的假期或運動設備上。我的家庭規模不大，所以也許我們有較少的\n擔心的事情。但我的家庭中沒有人試圖獲得貸款，...",
      "title": "爲什麼每個人都如此相信在家庭晚宴上談論加密貨幣收益是一個錯誤，難道我是唯一一個有家人感興趣而不是背後捅刀子的小偷？"
    }
  ]
}