{
  "author": "Trisolaran_arbitrage",
  "the_new_excerpt": "I am hoping people here take the time to read about Jack Macdonald - a man that\nlived frugally his whole life but invested in the stock market and left $188M to\ncharitable organizations when he died in 2013. He was a lawyer living in\nSeattle, no one aside from a few close family members were aware…",
  "original_created_utc": 1616959270,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我希望这里的人花时间读一读杰克-麦克唐纳的故事--他是一个人，他是一个人。\n他一生节俭，却投资股市，留下1.88亿美金。\n2013年他去世时，慈善组织。他是一名律师，住在\n西雅图，除了几个亲近的家人，没有人知道... ...",
      "title": "不知名的股市投资者死于1.88亿美元的股票，并全部捐给了慈善机构。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我希望這裏的人花時間讀一讀傑克-麥克唐納的故事--他是一個人，他是一個人。\n他一生節儉，卻投資股市，留下1.88億美金。\n2013年他去世時，慈善組織。他是一名律師，住在\n西雅圖，除了幾個親近的家人，沒有人知道... ...",
      "title": "不知名的股市投資者死於1.88億美元的股票，並全部捐給了慈善機構。"
    }
  ],
  "title": "Unknown Stock Market Investor died with $188M in stocks and donated ALL TO CHARITY",
  "created_utc": 1616963279,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am hoping people here take the time to read about Jack Macdonald - a man that lived frugally his whole life but invested in the stock market and left $188M to charitable organizations when he died in 2013. He was a lawyer living in Seattle, no one aside from a few close family members were aware of his wealth. He was fascinated by the stock market and thought of himself as shepherding over his wealth that would eventually go back to benefit the rest of society. </p>\n\n<p>Here are a few stories you can read about him:</p>\n\n<p><a href=\"https://www.joshuakennon.com/add-jack-macdonald-list-secret-millionaires-just-died-left-188-million-built-investing-stocks-charity/\">https://www.joshuakennon.com/add-jack-macdonald-list-secret-millionaires-just-died-left-188-million-built-investing-stocks-charity/</a></p>\n\n<p><a href=\"https://who13.com/news/secret-millionaire-seattle-man-lived-frugally/\">https://who13.com/news/secret-millionaire-seattle-man-lived-frugally/</a></p>\n\n<p>I hope we all can take away something from this story - it is not about flashing your wealth. His story obviously is on an extreme, but everyone can take something away from the way he lived his life and looked at investing. </p>\n\n<p>For those that have made large gains this year, remember to give back to those that are less fortunate. Or, just keep investing that until you have $188M when you die - and then give that to charity to benefit others.</p>\n</div><!-- SC_ON -->",
  "score": 21210,
  "permalink": "/r/stocks/comments/mf7tae/unknown_stock_market_investor_died_with_188m_in/",
  "subreddit": "stocks",
  "id": "mf7tae",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357142648
}