{
  "author": "cascadiaunited",
  "original_created_utc": 1641425289,
  "title": "Do hormones in toddler boys and girls really differ much?",
  "created_utc": 1641447176,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As a parent I have heard people repeatedly make comments about how boys are so much harder to raise because of their hormones. I’m not talking about pubescent kids, people make this kind of comment about my 3 year old and even my 1 year old. I always assume this is just sexist thinking but is there a big difference between biological boys and girls at such a young age? Thanks.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/askscience/comments/rwzzju/do_hormones_in_toddler_boys_and_girls_really/",
  "subreddit": "askscience",
  "id": "rwzzju",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As a parent I have heard people repeatedly make comments about how boys are so\nmuch harder to raise because of their hormones. I’m not talking about pubescent\nkids, people make this kind of comment about my 3 year old and even my 1 year\nold. I always assume this is just sexist thinking but is there…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "親として、「男の子は大変だ」という意見を何度も聞いたことがあります。\nホルモンの関係で、育てるのが大変なんです。思春期の話ではないのですが\n私の3歳の子供や1歳の子供にも同じようなことを言う人がいます。\nということです。私はいつも、これは単なる性差別的な考え方だと思うのですが、何かあるのでしょうか？",
      "title": "幼児の男の子と女の子のホルモンは、本当にあまり変わらないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一名家长，我曾多次听到有人评论说，男孩是如此的难养，因为他们的荷尔蒙。\n因为他们的荷尔蒙而更难抚养。我说的不是青春期的孩子。\n我说的不是青春期的孩子，人们对我3岁的孩子，甚至1岁的孩子都有这样的评论。\n1岁的孩子。我总是认为这只是性别歧视的想法，但是否有...",
      "title": "学步期男孩和女孩的荷尔蒙真的有很大差别吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一名家長，我曾多次聽到有人評論說，男孩是如此的難養，因爲他們的荷爾蒙。\n因爲他們的荷爾蒙而更難撫養。我說的不是青春期的孩子。\n我說的不是青春期的孩子，人們對我3歲的孩子，甚至1歲的孩子都有這樣的評論。\n1歲的孩子。我總是認爲這只是性別歧視的想法，但是否有...",
      "title": "學步期男孩和女孩的荷爾蒙真的有很大差別嗎？"
    }
  ]
}