{
  "author": "Sweet-Zookeepergame",
  "the_new_excerpt": "It might sound crazy, but I feel much more comfortable investing in ETH, BTC and\nPOLKADOT than investing in the stock market. Currently I‘m like 70% crypto and\n30% stonks.\n\nThe reason: I believe that the amount of brain power behind projects like ETH\nhappens once in a lifetime and I strongly believe…",
  "original_created_utc": 1618213497,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "おかしいと思われるかもしれませんが、ETH、BTC、POLKADOTへの投資は、株式市場への投資よりもずっと安心感があります。\nPOLKADOTに投資する方が、株式市場に投資するよりもずっと安心です。現在、私は70％の暗号化と\n30％のストンクです。\n\nその理由は、ETHやBTCのようなプロジェクトを支える脳力の大きさは、株式市場よりもはるかに大きいと考えているからです。\nETHのようなプロジェクトを支える頭脳の大きさは、一生に一度のことだと信じています。",
      "title": "株よりも暗号の方がはるかに安心だ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这可能听起来很疯狂，但我觉得投资ETH、BTC和ETH更舒服。\nPOLKADOT比投资股市。目前，我喜欢70％的加密和\n30%的石子。\n\n原因是：我相信，像ETH这样的项目，其背后的脑洞是很大的。\n一生只有一次，我坚信...",
      "title": "我觉得加密技术比股票要舒服得多。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這可能聽起來很瘋狂，但我覺得投資ETH、BTC和ETH更舒服。\nPOLKADOT比投資股市。目前，我喜歡70％的加密和\n30%的石子。\n\n原因是：我相信，像ETH這樣的項目，其背後的腦洞是很大的。\n一生只有一次，我堅信...",
      "title": "我覺得加密技術比股票要舒服得多。"
    }
  ],
  "title": "I feel much more comfortable with crypto that with stocks",
  "created_utc": 1618227703,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It might sound crazy, but I feel much more comfortable investing in ETH, BTC and POLKADOT than investing in the stock market. Currently I‘m like 70% crypto and 30% stonks.</p>\n\n<p>The reason: I believe that the amount of brain power behind projects like ETH happens once in a lifetime and I strongly believe in it‘s utilization and worldwide value long-term. I also believe that it‘s inevitable that giants like Visa, Apple, MSFT, Google etc. are going to adopt the ethereum blockchain technology too.</p>\n\n<p>I mean, adoption of crypto already happened with Tesla/BTC.</p>\n\n<p>Am I the only one?</p>\n</div><!-- SC_ON -->",
  "score": 3408,
  "permalink": "/r/CryptoCurrency/comments/mp92r9/i_feel_much_more_comfortable_with_crypto_that/",
  "subreddit": "CryptoCurrency",
  "id": "mp92r9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566614261
}