{
  "author": "gsarin1980",
  "the_new_excerpt": "Bitcoin is gathering escape velocity to take the \"HODLERs\" out of the broken and\ncorrupt monetary system.\n\nWe are reading some amazing stories on this forum. Venezulean securing his\nfuture. Bitcoin grandma our new Hodler.\n\nI heard Bitcoin in Aug 2017. It kind of stuck with me. I was baptized with…",
  "original_created_utc": 1608960522,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "比特币正在加速逃逸速度，将“HODLER”从破碎的\n腐败的货币体系。\n\n我们在这个论坛上读到了一些令人惊叹的故事。威尼斯人保护他的\n未来。比特币奶奶我们的新霍德勒。\n\n我在2017年8月听说比特币。这有点让我难以释怀。我接受了…的洗礼",
      "title": "来自一位印度人：做得好，献给真正的信徒"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣正在加速逃逸速度，將“HODLER”從破碎的\n腐敗的貨幣體系。\n\n我們在這個論壇上讀到了一些令人驚歎的故事。威尼斯人保護他的\n未來。比特幣奶奶我們的新霍德勒。\n\n我在2017年8月聽說比特幣。這有點讓我難以釋懷。我接受了…的洗禮",
      "title": "來自一位印度人：做得好，獻給真正的信徒"
    }
  ],
  "title": "From an Indian: Well done to the true believers",
  "created_utc": 1608997724,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bitcoin is gathering escape velocity to take the &quot;HODLERs&quot; out of the broken and corrupt monetary system. </p>\n\n<p>We are reading some amazing stories on this forum. Venezulean securing his future. Bitcoin grandma our new Hodler.</p>\n\n<p>I heard Bitcoin in Aug 2017. It kind of stuck with me. I was baptized with fire in dealing with the various noises in this ecosystem. </p>\n\n<p>The massive pumps and dumps, Bitcoin Cash noise, Ripple fan boys, exchanges crashing, Jamie Dimon and Warren Buffets monologues. The bear market was fun. </p>\n\n<p>In my country, Bitcoin was banned for 19 months right through the bear market. I couldnt buy. But Thanks to you beautiful people on this forum, I always felt connected to this amazing revolution. </p>\n\n<p>I became wiser every day I read your views. When the ban was removed in March this year, the mankind was facing a Pandemic. But I had clarity in my thoughts and bulldozed my way into accumulating sats day in day out. </p>\n\n<p>Hell yeah. I am 400% up in my portfolio. I am already looking for the next halvening in 2024 when Bitcoin will become even more harder money. </p>\n\n<p>Should I have bought more sats or full bitcoins? How does it matter? I believe I have now a solid stake in this silent revolution to make the world better place. </p>\n\n<p>Well done Hodlers!!! </p>\n\n<p>Remember: </p>\n\n<p>Invest only what you can afford to lose. If you want to deserve $100k coin, you need to stomach $4k coin. </p>\n\n<p>Learn how to protect your newly found wealth!!! You are the bank!!!</p>\n</div><!-- SC_ON -->",
  "score": 75,
  "permalink": "/r/Bitcoin/comments/kkdbht/from_an_indian_well_done_to_the_true_believers/",
  "subreddit": "Bitcoin",
  "id": "kkdbht",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495327978
}