{
  "author": "partymsl",
  "original_created_utc": 1660423917,
  "title": "Why are people still comparing Bitcoin and Ethereum? They are simply not the same and can both be equally successful.",
  "created_utc": 1660476986,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just as the Ethereum Merge is inching closer and ETH is pumping a lot due to the hype many are once again starting to compare Ethereum to Bitcoin and talk about &amp;quot;The Flippening&amp;quot;. Why? Probably just because they are two OG cryptos and by far the most safe ones. There is literally no other similarity you can find here. They are very different from each other. &lt;/p&gt;\n\n&lt;p&gt;While Bitcoin has been seen as a currency by most and even is accepted as one in some countries. Ethereum clearly is not a currency of you just look at the fees but even if the fees get lower, it&amp;#39;s still not a currency. Ethereum is meant to be about smart contracts and decentralized applications in crypto and as we can see ETH had a very huge ecosystem around that. &lt;/p&gt;\n\n&lt;p&gt;Comparing them both is stupid because at the end of the day both will prevail and be successful together and more importantly both are needed for Cryptos future.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 309,
  "permalink": "/r/CryptoCurrency/comments/wnobq1/why_are_people_still_comparing_bitcoin_and/",
  "subreddit": "CryptoCurrency",
  "id": "wnobq1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Just as the Ethereum Merge is inching closer and ETH is pumping a lot due to the\nhype many are once again starting to compare Ethereum to Bitcoin and talk about\n\"The Flippening\". Why? Probably just because they are two OG cryptos and by far\nthe most safe ones. There is literally no other similarity…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちょうど、イーサリアムマージがじりじりと近づき、ETHはその影響で大きくポンプアップしています。\n多くの人がイーサリアムとビットコインを比較し、\"That \"について話し始めています。\n\"The Flippening \"と言っています。なぜでしょうか？おそらく、2つのOG暗号であり、圧倒的に\n最も安全なものだからです。他の類似点はありません...",
      "title": "なぜ人々はまだビットコインとイーサリアムを比較しているのでしょうか？両者は単純に同じではなく、どちらも同じように成功することができます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就在以太坊合并的脚步越来越近，而ETH也因\n炒作，许多人再次开始将以太坊与比特币相提并论，并谈论\n\"翻转\"。为什么呢？可能只是因为它们是两个原始的加密货币，而且是迄今为止\n最安全的加密货币。从字面上看，没有其他相似之处...",
      "title": "为什么人们还在比较比特币和以太坊？它们根本不一样，都可以同样成功。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就在以太坊合併的腳步越來越近，而ETH也因\n炒作，許多人再次開始將以太坊與比特幣相提並論，並談論\n\"翻轉\"。爲什麼呢？可能只是因爲它們是兩個原始的加密貨幣，而且是迄今爲止\n最安全的加密貨幣。從字面上看，沒有其他相似之處...",
      "title": "爲什麼人們還在比較比特幣和以太坊？它們根本不一樣，都可以同樣成功。"
    }
  ]
}