{
  "author": "aesir23",
  "original_created_utc": 1659628283,
  "title": "Did attitudes toward marriage between cousins change between the two editions of Frankenstein?",
  "created_utc": 1659657027,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In the 1818 edition of Frankenstein, Elizabeth Lavanza was Victor Frankenstein&amp;#39;s cousin. In the 1831 edition, her background is changed to make her an orphan adopted by the Frankensteins, unrelated by blood.&lt;/p&gt;\n\n&lt;p&gt;Did this change reflect a change in public attitudes in the intervening 13 years?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/wg4o0j/did_attitudes_toward_marriage_between_cousins/",
  "subreddit": "AskHistorians",
  "id": "wg4o0j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In the 1818 edition of Frankenstein, Elizabeth Lavanza was Victor Frankenstein's\ncousin. In the 1831 edition, her background is changed to make her an orphan\nadopted by the Frankensteins, unrelated by blood.\n\nDid this change reflect a change in public attitudes in the intervening 13\nyears?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1818年版『フランケンシュタイン』では、エリザベス・ラヴァンザはヴィクター・フランケンシュタインの\nいとこである。1831年版では、彼女の経歴が変更され、フランケンシュタイン家の養子となり、血のつながりのない孤児となりました。\nフランケンシュタイン夫妻の養子となり、血のつながりのない孤児となりました。\n\nこの変更は、その間の13年間における人々の意識の変化を反映したものなのでしょうか。\n年後の世相を反映したものなのだろうか。",
      "title": "いとこ同士の結婚に対する考え方は、『フランケンシュタイン』の2つの版で変わったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在1818年版的《弗兰肯斯坦》中，伊丽莎白-拉万扎是维克多-弗兰肯斯坦的\n表妹。在1831年版中，她的背景被改变，变成了一个孤儿\n被弗兰肯斯泰因夫妇收养，没有血缘关系。\n\n这一变化是否反映了这13年间公众态度的变化？\n年间公众态度的变化？",
      "title": "在两个版本的《弗兰肯斯坦》之间，人们对表兄妹之间的婚姻的态度是否有所改变？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在1818年版的《弗蘭肯斯坦》中，伊麗莎白-拉萬紮是維克多-弗蘭肯斯坦的\n表妹。在1831年版中，她的背景被改變，變成了一個孤兒\n被弗蘭肯斯泰因夫婦收養，沒有血緣關係。\n\n這一變化是否反映了這13年間公衆態度的變化？\n年間公衆態度的變化？",
      "title": "在兩個版本的《弗蘭肯斯坦》之間，人們對錶兄妹之間的婚姻的態度是否有所改變？"
    }
  ]
}