{
  "author": "hokutravel",
  "original_created_utc": 1639780752,
  "title": "Just launched the best group travel platform to plan trips with your friends. Took me 18 months to make. Finally!!",
  "created_utc": 1639788113,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have been working on Hoku for the past 18 months to ease the group travel experience. When I started working on this platform I had no idea how to create a mobile application but through ups, downs and a lot of stack-overflow searches, I have been able to create this platform. Would love to know what you guys think.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://hoku.travel\"&gt;https://hoku.travel&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://i.redd.it/fnvusvzlk6681.gif\"&gt;https://i.redd.it/fnvusvzlk6681.gif&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 6,
  "permalink": "/r/SideProject/comments/risrbf/just_launched_the_best_group_travel_platform_to/",
  "subreddit": "SideProject",
  "id": "risrbf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have been working on Hoku for the past 18 months to ease the group travel\nexperience. When I started working on this platform I had no idea how to create\na mobile application but through ups, downs and a lot of stack-overflow\nsearches, I have been able to create this platform. Would love to know…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は過去18ヶ月間、団体旅行を容易にするために、ホクに取り組んできました。\nを体験することができます。このプラットフォームに取り組み始めたとき、私はどのように作ればいいのか全く分かりませんでした。\nしかし、浮き沈みを繰り返し、多くのスタックオーバーフローを経て\nを検索し、このプラットフォームを作り上げることができました。ぜひ教えてください...",
      "title": "仲間と一緒に旅行を計画するのに最適なグループ旅行プラットフォームを立ち上げたばかりです。作るのに1年半かかりました。ついに！"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的18个月里，我一直在为Hoku工作，以减轻团体旅行的负担。\n经验。当我开始在这个平台上工作时，我不知道如何创建一个移动应用程序。\n一个移动应用程序，但通过跌宕起伏和大量的堆栈溢出\n搜索，我已经能够创建这个平台了。很想知道...",
      "title": "刚刚推出的最佳团体旅游平台，可以与你的朋友一起计划旅行。花了我18个月的时间来做。终于！!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的18個月裏，我一直在爲Hoku工作，以減輕團體旅行的負擔。\n經驗。當我開始在這個平臺上工作時，我不知道如何創建一個移動應用程序。\n一個移動應用程序，但通過跌宕起伏和大量的堆棧溢出\n搜索，我已經能夠創建這個平臺了。很想知道...",
      "title": "剛剛推出的最佳團體旅遊平臺，可以與你的朋友一起計劃旅行。花了我18個月的時間來做。終於！!"
    }
  ]
}