{
  "author": "nevermindphillip",
  "the_new_excerpt": "Today is a huge and very sexual day for Bitcoin, but first a little background\n(skip ahead if you don't care).\n\nThe stock to flow (S2F) multiple shows the stock to flow model price compared to\nactual close price for a given day (read more here\n[https://stats.buybitcoinworldwide.com/sf-multiple/]).…",
  "original_created_utc": 1620820723,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日はビットコインにとって非常に大きな、そして非常に性的な日ですが、まず少し背景を説明します\nを説明します（気にならない方は読み飛ばしてください）。\n\nストック・トゥー・フロー（S2F）マルチプルは、ストック・トゥー・フローのモデル価格と、その日の実際の終値を比較したものです。\nその日の実際の終値と比較したものです（詳しくはこちら\n[https://stats.buybitcoinworldwide.com/sf-multiple/])....",
      "title": "今日はその日です。\"The fornication \"がついに始まりました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天对比特币来说是一个巨大的、非常性的日子，但首先要介绍一下背景情况\n如果你不关心，请跳过）。\n\n股票流向（S2F）倍数显示了股票流向模型价格与某一天的实际收盘价的比较。\n实际收盘价的比较（更多信息请看这里\n[https://stats.buybitcoinworldwide.com/sf-multiple/])....",
      "title": "今天是个好日子。\"通奸 \"终于开始了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天對比特幣來說是一個巨大的、非常性的日子，但首先要介紹一下背景情況\n如果你不關心，請跳過）。\n\n股票流向（S2F）倍數顯示了股票流向模型價格與某一天的實際收盤價的比較。\n實際收盤價的比較（更多信息請看這裏\n[https://stats.buybitcoinworldwide.com/sf-multiple/])....",
      "title": "今天是個好日子。\"通姦 \"終於開始了。"
    }
  ],
  "title": "TODAY IS THE DAY. \"The fornication\" has finally begun.",
  "created_utc": 1620834742,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Today is a huge and very sexual day for Bitcoin, but first a little background (skip ahead if you don&#39;t care).</p>\n\n<p><em>The stock to flow (S2F) multiple shows the stock to flow model price compared to actual close price for a given day (</em><a href=\"https://stats.buybitcoinworldwide.com/sf-multiple/\"><em>read more here</em></a><em>). The two S2F model price predictions use 10 days of bitcoin production estimated forward and, 463 days of actual production to measure scarcity and predict a value or price. Each line of the below chart represents the current BTC price&#39;s</em> <strong><em>multiple</em></strong> <em>of those price predictions. A value of 1 means the actual price matches the model prediction. Boring, yes. The point is, they have a rocky relationship with each other.</em></p>\n\n<p>Anyway, following every halving, the relationship between the 463 day and the 10 day wiggly lines sours, and the 10 day drops away after they are kicked out of the house. The actual price is suddenly way below the 10 day model price, and takes a couple of years to recover.</p>\n\n<p>Then, a magical moment happens. A moment of greatness that we in the know refer to as &quot;<em>THE FORNICATION</em>&quot;. This is the moment that the two lines finally reunite again, lost lovers rekindling the flame, and begin to have intercourse.</p>\n\n<p>They hold hands and kiss and roll around as the intensity builds to the inevitable market climax and the sweet release of the final blow-off. Once this process is started it cannot be stopped until the Bitgasm is achieved at a much higher multiple than the model prediction.</p>\n\n<p>You can see the moment &quot;<em>The Fornication</em>&quot; begins, and the following blow-off in 2013 and 2017, and&quot;<em>The Fornication</em>&quot; NOW, TODAY, IN 2021:</p>\n\n<p><a href=\"https://preview.redd.it/dwz0mu3gcoy61.png?width=1915&amp;format=png&amp;auto=webp&amp;s=c49df5430cfbb346f1ac82f848cd7c2076f75200\">Value of 1 means the actual price matches the model prediction. We have always overshot on the climax by a multiple of that prediction.</a></p>\n\n<p>You can also see this beautiful and slightly X-rated moment clearly today on the <a href=\"https://stats.buybitcoinworldwide.com/stock-to-flow/\">actual stock to flow model</a>:</p>\n\n<p><a href=\"https://preview.redd.it/o416gq45doy61.png?width=1911&amp;format=png&amp;auto=webp&amp;s=b52466723296c1afa9cb10c7b755e95ad1bf7dfd\">https://preview.redd.it/o416gq45doy61.png?width=1911&amp;format=png&amp;auto=webp&amp;s=b52466723296c1afa9cb10c7b755e95ad1bf7dfd</a></p>\n\n<p>We&#39;ve waited a long time for these two to get back together, and I expect the same level of passion this time around too.</p>\n\n<p>I hope you will join me in celebrating the great day of &quot;<em>The Fornication</em>&quot;, and that the upcoming final blow-off showers you with bits...? riches...? bitches...? heh.</p>\n\n<p><strong>Edit:</strong> reworded for clarity.</p>\n\n<p><strong>Edit Edit:</strong> The 463 day model price in the lower chart rises to about $100k to meet the 10 day for this cycle. Overshooting to a multiple of 2 on the top graph puts us at $200k per BTC. Not a prediction or advice, just pointing it out.</p>\n\n<p>Using the highest shelf of the prediction:<br/>\n- Last cycle peaked in 2017 at a multiple of 3.42 ($19,345 vs a model prediction of $5,649).<br/>\n- The cycle before that in 2013 peaked at a multiple of 9.3 ($1,220 vs a model prediction of $130).</p>\n</div><!-- SC_ON -->",
  "score": 399,
  "permalink": "/r/CryptoCurrency/comments/namwyg/today_is_the_day_the_fornication_has_finally_begun/",
  "subreddit": "CryptoCurrency",
  "id": "namwyg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985993622
}