{
  "author": "CalzerMalzer",
  "original_created_utc": 1630345889,
  "title": "The Ethereum Triple Halving - Part 2",
  "created_utc": 1630377454,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello again everyone, around 1-2 weeks ago I made a post about the <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/p5m9eq/the_ethereum_triple_halving_and_why_eth_will/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">Ethereum Triple Halving and why ETH will easily overtake BTC in market cap</a>. The post did extremely well and a lot of you asked for a more in depth review of the two event major events (EIP-1559 and PoS) that are taking place. The original post was mostly just a surface level overview of what the ETH triple halving entails and some of the likely outcomes after the two events and comparing with BTC. The intention of this post is to clarify some of the details of the two major ETH updates: EIP-1599, and the transition from PoW to PoS, and discuss the economical side effects of the changing supply dynamic of ETH as a result of these two major events and why a $150,000 ETH isn&#39;t as unreasonable as you may first think.</p>\n\n<p>Firstly, a disclaimer: The brains behind this whole ETH triple halving thesis is Nikhita Shamapant and the thesis can be found <a href=\"https://drive.google.com/file/d/1bECqgijhgjdS782AB620gFjK5qx-vA99/view\">here</a>. I highly recommend reading it if you want an even better understanding on the whole ETH triple halving.</p>\n\n<p>Secondly, I want to clarify the two straight forward yet important terms mean as they will be helpful in understanding this post</p>\n\n<p><strong>Total supply -</strong> The total amount in existence. Bitcoin&#39;s total supply is 21M. A more traditional example to think of it is the total supply of crude oil is equal to the amount of crude oil underground + the amount of crude oil above ground.</p>\n\n<p><strong>Circulating Supply -</strong> The amount being bought and sold. Bitcoin’s circulating supply is ~85% of the 21M total cap, this is even lower if you consider HODLers as removing BTC from circulating supply. Analogously the circulating supply of crude oil refers to the crude oil above ground.</p>\n\n<p><strong>BTC&#39;s Supply Dynamic</strong></p>\n\n<p>As mentioned above, only 21M bitcoin will ever exist. Approximately 85% of that is already circulating. Miners mine more of this supply and the block reward dilutes the circulating supply but leaves total supply unchanged. Eventually, the circulating supply of Bitcoin will slowly approach the total supply. If we also consider the elite army of BTC HODLers, the people that only ever buy BTC and will never sell, this removes more of the circulating supply which to some degree will counteract the dilution of the issuance of BTC. If more Bitcoin is purchased and HODLd than the block reward sold by miners, circulating supply of Bitcoin could potentially decrease.</p>\n\n<p>We could make the argument that the circulating supply determines the price not the total supply. If we look at crude oil production we see that when it surges the price goes down despite the fact that the total supply of crude oil remains the same. If this argument holds then BTC&#39;s block reward for mining acts as a net negative for price and the halving acts as a stimulus to increase price. Hodling also adds another dimension to this argument. As previously mentioned HODLers never sell and take away from the circulating supply. Analogous to this, If I were to hold a high percentage of the world&#39;s crude oil supply the demand for crude oil is placed on a smaller circulating supply thus squeezing prices even higher. Similarly HODL culture will also have a price impact on BTC.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/5qglormu7jk71.png?width=1039&amp;format=png&amp;auto=webp&amp;s=203bb54756303031f4b030bd1770a75aa527ffe3\">Bitcoin supply over time</a></p>\n\n<p><strong>ETH&#39;s Supply Dynamic</strong></p>\n\n<p>On the flipside, ETH&#39;s supply dynamic has big differences relative to BTC. Namely, ETH does not have a hard cap (yet). Due to there not being a hard capped supply with ETH, the block reward does not reduce with halving events like BTC does. In the case of ETH, the circulating supply equals the total supply. This means that similar to BTC, miner block rewards also dilute circulating supply. However, unlike BTC, ETH block rewards also dilute total supply. ETH has never gone through a halving event before, therefore, the net negative price effect as a result of the block reward dilution remains consistent. To add to this, the HODL culture is arguably much younger and less hardcore with ETH and is thus speculatively less likely to impact the price as much as for BTC.</p>\n\n<p><strong>The Effect of EIP-1559 on ETH&#39;s Supply</strong></p>\n\n<p>The first major event which has already taken place is the network upgrade to EIP-1559. The critical change with this update is how ETH as an asset changes. <strong>As a result of EIP 1559, 70% of transaction fees on the Ethereum network will be burned.</strong> Projections from Ethereum research Justin Drake predicts that Ethereum will be net deflationary, losing 2% of supply annually after accounting for the issuance of new ether to stakers. This is the ETH community deciding it wants to compete with BTC as a store of value. The main differences with BTC are:</p>\n\n<ul>\n<li>ETH&#39;s circulating supply is equal to the total supply which implies deflation decreases circulating supply to also decrease. With BTC, even though it has a hard cap its circulating supply is consistently increasing over time.</li>\n<li>ETH&#39;s hard cap will reduce after hitting its peak supply at approx. 120M. The supply will decrease around 2% annually.</li>\n</ul>\n\n<p>If the idea that the circulating supply drives the price holds then a decreasing circulating supply of ETH is a very bullish prospect.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ngoyfjkv7jk71.png?width=1067&amp;format=png&amp;auto=webp&amp;s=72d9adf7e46dc6251e90e8f1e5a55ed2feb21045\">The supply reduced from about 115M to 85M from 2016 to 2021. It turns out that represents the same 30&#37; decline in issuance as we’ll see from EIP1559.</a></p>\n\n<p><strong>The Effect of Proof of Stake on ETH&#39;s Supply</strong></p>\n\n<p>Currently ETH is in a PoW system just like BTC. In a nutshell PoW blockchain has miners securing the network and PoS blockchain has stakers securing the network. The result of this transition is that the efficiency of how the network is secured is greatly increased which has a knock on effect of requiring less issuance of ETH the achieve the same level of security. This event is significant because it will represent a drop in sell pressure equivalent to 2.5 BTC halvings.</p>\n\n<p>After the transition from PoW to PoS ETH will have economically incentivized HODLing from the staking yield and DeFi yield. Right now 8% of ETH&#39;s circulating supply is locked in to DeFi and approx. 6% is being staked so in total 14% of ETH is locked out of circulating supply already.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/u2zgos8w7jk71.png?width=1605&amp;format=png&amp;auto=webp&amp;s=656ac2f87bce83273b8cb8434d09183a32ed81d1\">Total amount of ETH locked into the DeFi space Aug 27th 2021.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/oxptspww7jk71.png?width=1681&amp;format=png&amp;auto=webp&amp;s=2a793e98e3f30b0bf5ca6d5f206f0e091a1934c0\">Staked ETH over the last week</a></p>\n\n<p>Now, taking a look at some of potential yield rewards after the merge we have several different cases. On one side the staking APR is 68.7% if only 4.5M ETH is staked (assuming there is no change in DeFi value this represents 12% of circulating supply being locked) compared to a 7.2% APR if 15M ETH is staked (this represents 20% of all ETH being locked up on top of the ETH locked into DeFi assuming it stays the same). We should also note that price isn&#39;t the relevant variable to see ETH staking yields moving. If you buy ETH at $2,000 you will get say a 25% yield; if ETH triples in price and a new investor comes and buy ETH for $6,000 they will still get a 25% staking yield until enough has been locked into staking for yields to move down. We must also note that there is in fact a validator queue. Not all ETH can be staked simultaneously there is a limit of approx. 900 new validators per day with each validator holding 32 ETH that&#39;s approx. 29,000 ETH that can be staked every day. The validator queues will likely be years long and is the reason we won&#39;t see 80%+ ETH being staked in the short term. With 80%+ ETH being staked there comes another positive security implication. If ETH and BTC both have a 1T market cap, the value of Bitcoin’s hash power is about $5B. If 80% of Ethereum is staked, the security of ETH at that market cap will be over $400B. That’s 80x the security of Bitcoin.</p>\n\n<p>HODL culture is about to become economically enforced with ETH as investors will be paid a yield to keep their ETH out of circulating supply. The attractive staking yields will lead to huge sums of ETH being taken out of circulation leaving less ETH in circulation on top of the decreasing total supply will cause a <strong>price squeeze</strong>.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/0upgb1vy7jk71.png?width=1827&amp;format=png&amp;auto=webp&amp;s=d06c75eb5a53fd237ea553b36ac9c912448c7928\">Justin Drakes estimated staking yields.</a></p>\n\n<p>You&#39;ve probably seen many ETH price predictions usually ranging from <strong>$10,000</strong> to <strong>$20,000</strong>, but one thing to note about these predictions is that every price analysis on ETH essentially boils down to a comparison with BTC. A popularized approach is using the Stock to Flow (S2F) model as is used with gold and silver and applied to BTC. The &quot;Stock&quot; refers to the circulating supply where the &quot;Flow&quot; is the amount of new issuance. Every BTC halving the issuance rate drop in half and the S2F rises, using the model a price target of $288,000 was calculated as this cycle peak for BTC. Many analysts then take this price target and apply it to the ETH/BTC ratio which has ranged anywhere from 0.02 to 0.1 and this then gives us the commonly seen ETH price targets ranging anywhere between $5,700 to $28,000.</p>\n\n<p>Now consider the fact that staking Ethereum could potentially unlock more than 5x the value for each Ether (the calculation for this number is discussed in the thesis on PG 61) on top of many other factors such as the changing supply dynamic, the huge demand for ETH, the utility it brings, then ETH reaching 6 digits seems a lot more reasonable. To add to this, if staking yields were to go below 1.81% APR it would equate to 83% (100M) of ETH being locked out of circulation which is not including the amount locked in the DeFi space so potentially upwards of 90% of ETH being locked in. With such a large amount of illiquidity the amount of money to actually raise the price of ETH is not on a 1:1 ratio in other words to a reach a market cap of $15T ($150,000 ETH) you wouldn&#39;t actually require 15 trillion dollars worth of ETH to be bought. So through the power of a price insensitive staking with high yields it will attract more staking which in turn leads to more illiquidity allowing for the price of ETH to go up more easily.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/fd7igl8z7jk71.png?width=1105&amp;format=png&amp;auto=webp&amp;s=697ac6735b89fc4360f538139512ec80ca8cae55\">Staking economics taken fromEthHub.</a></p>\n\n<p>&#x200B;</p>\n\n<p>&quot;I believe the future could break the past as is often the case with disruptive technology&quot; Therefore, I don&#39;t think the price predictions make total sense from an investment stand point. The forecasts always rely heavily on analogizing from prior cycles and using BTC, but don&#39;t really consider the idea that the implementation of these major changes have never have happened before in crypto history so there is no way to analogize what these effects will do. I think these analogies can potentially break down due to the uniqueness of the attributes coming to ETH and how they change the supply dynamics of ETH. After the merge to proof of stake ETH will have a negative S2F and unlike BTC which is becoming increasingly scarce as it approaches a hard cap, its total circulating supply will decrease every year. It will not only be more scarce on an issuance basis, but be more scarce on a circulating supply basis than bitcoin each year.</p>\n\n<p>TLDR: EIP-1559 and PoS significantly change the supply dynamics of ETH relative to BTC and it would thus be erroneous to use BTC price predictions and apply them to ETH as it is almost always done with ETH price predictions. EIP-1559 and PoS will account for a reduction in ~90% in sell pressure due to the deflationary tokenomics and huge monetary incentive to stake ETH which in turn gives more illiquidity, implies the price of ETH could reach up to $150,000 in a best case scenario.</p>\n\n<p>This is the gwei.</p>\n</div><!-- SC_ON -->",
  "score": 194,
  "permalink": "/r/CryptoCurrency/comments/pen9od/the_ethereum_triple_halving_part_2/",
  "subreddit": "CryptoCurrency",
  "id": "pen9od",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello again everyone, around 1-2 weeks ago I made a post about the Ethereum\nTriple Halving and why ETH will easily overtake BTC in market cap\n[https://www.reddit.com/r/CryptoCurrency/comments/p5m9eq/the_ethereum_triple_halving_and_why_eth_will/?utm_source=share&utm_medium=web2x&context=3].\nThe post…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。1～2週間前に、イーサリアムのトリプルハーフ化についての記事を書きました。\nトリプルハーフ化と、ETHがBTCを時価総額で簡単に追い越す理由について投稿しました。\n[https://www.reddit.com/r/CryptoCurrency/comments/p5m9eq/the_ethereum_triple_halving_and_why_eth_will/?utm_source=share&utm_medium=web2x&context=3]をご紹介しました。\nこの投稿は...",
      "title": "イーサリアムのトリプルハーフ化について - その2"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好！大约1-2周前，我发表了一篇关于以太坊\n三倍减半以及为什么ETH的市值会轻松超过BTC\n[https://www.reddit.com/r/CryptoCurrency/comments/p5m9eq/the_ethereum_triple_halving_and_why_eth_will/?utm_source=share&utm_medium=web2x&context=3]。\n该帖子...",
      "title": "以太坊三重减半--第二部分"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好！大約1-2周前，我發表了一篇關於以太坊\n三倍減半以及爲什麼ETH的市值會輕鬆超過BTC\n[https://www.reddit.com/r/CryptoCurrency/comments/p5m9eq/the_ethereum_triple_halving_and_why_eth_will/?utm_source=share&utm_medium=web2x&context=3]。\n該帖子...",
      "title": "以太坊三重減半--第二部分"
    }
  ]
}