{
  "author": "kyle_h2486",
  "the_new_excerpt": "I can still afford a Tesla. But, hey.\n\nHonestly was going to look at buying one in a year or so. The cheapest model of\ncourse. $35,000 really isn’t bad for a new car. Electric even. How cool to run\naround in a massive battery powered car.\n\nBut now that Elon is fucking with my money, I think I’ll…",
  "original_created_utc": 1621604928,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "テスラを買う余裕はまだある。でもね。\n\n正直なところ、1年後くらいに購入を検討しようと思っていました。もちろん一番安いモデルをね。\nもちろん。新車で3万5,000ドルは悪くないですよね。しかも電気自動車。走っている姿がかっこいい\n巨大なバッテリーを搭載した車で走り回れるなんて。\n\nしかし、イーロンが私のお金を使っている今、私は思うのです...",
      "title": "テスラを買う余裕がなくなった"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我仍然可以买得起特斯拉。但是，嘿。\n\n说实话，我打算在一年左右的时间里看看买一个。当然是最便宜的型号。\n当然。35,000美元对于一辆新车来说真的不赖。甚至是电动的。开着一辆巨大的电池驱动的汽车到处跑，多酷啊\n在一个巨大的电池驱动的汽车里跑来跑去。\n\n但现在埃隆在拿我的钱开玩笑，我想我要...",
      "title": "不再有能力购买特斯拉"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我仍然可以買得起特斯拉。但是，嘿。\n\n說實話，我打算在一年左右的時間裏看看買一個。當然是最便宜的型號。\n當然。35,000美元對於一輛新車來說真的不賴。甚至是電動的。開着一輛巨大的電池驅動的汽車到處跑，多酷啊\n在一個巨大的電池驅動的汽車裏跑來跑去。\n\n但現在埃隆在拿我的錢開玩笑，我想我要...",
      "title": "不再有能力購買特斯拉"
    }
  ],
  "title": "No longer able to afford a Tesla",
  "created_utc": 1621617107,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I can still afford a Tesla. But, hey. </p>\n\n<p>Honestly was going to look at buying one in a year or so. The cheapest model of course. $35,000 really isn’t bad for a new car. Electric even. How cool to run around in a massive battery powered car. </p>\n\n<p>But now that Elon is fucking with my money, I think I’ll fuck with his. I am no longer interested in his cars. Other companies are moving into the market now. I’ll probably never look into owning a Tesla ever again. </p>\n\n<p>Not sure if this is a sentiment the crypto community should latch on to, but I sure the fuck am. </p>\n\n<p>Oh, and happy Friday everybody!</p>\n</div><!-- SC_ON -->",
  "score": 1060,
  "permalink": "/r/CryptoCurrency/comments/nhsyyo/no_longer_able_to_afford_a_tesla/",
  "subreddit": "CryptoCurrency",
  "id": "nhsyyo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197381675
}