{
  "author": "Mozad1",
  "the_new_excerpt": "With on-chain data showing that a lot of the selling was from short term holders\nI'm curious to know how many newbies had a white-knuckle grip but didn't let go\non the ride down.\n\nI felt the burn in 2018-2019 so I can sympathise.\n\nIf you're still around well done. It is stomach churning in the…",
  "original_created_utc": 1623083214,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "オンチェーンのデータでは、短期保有者からの売りが多かったようですが\nどれだけの初心者が、手に汗握っても離さなかったのかが気になります。\n降りるときに離さなかった初心者がどのくらいいるのか興味があります。\n\n私は2018年から2019年にかけて燃えましたので、共感できます。\n\n残っている人はよくやった。で胃が痛くなります。",
      "title": "新人のうち何人が定着したのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "链上数据显示，大量的卖盘来自短线持有者\n我很想知道，有多少新手在下跌过程中紧紧抓住了白手起家的机会，但没有放手。\n在下跌的过程中。\n\n我在2018-2019年感受到了灼热，所以我很同情。\n\n如果你还在这里，做得很好。这让人胃部翻腾，在...",
      "title": "有多少新手坚持在这里？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "鏈上數據顯示，大量的賣盤來自短線持有者\n我很想知道，有多少新手在下跌過程中緊緊抓住了白手起家的機會，但沒有放手。\n在下跌的過程中。\n\n我在2018-2019年感受到了灼熱，所以我很同情。\n\n如果你還在這裏，做得很好。這讓人胃部翻騰，在...",
      "title": "有多少新手堅持在這裏？"
    }
  ],
  "title": "How many of the newbies stuck around?",
  "created_utc": 1623110450,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>With on-chain data showing that a lot of the selling was from short term holders I&#39;m curious to know how many newbies had a white-knuckle grip but didn&#39;t let go on the ride down.</p>\n\n<p>I felt the burn in 2018-2019 so I can sympathise.</p>\n\n<p>If you&#39;re still around well done. It is stomach churning in the beginning. The best way to avoid it is to only put in an amount that won&#39;t keep you up at night.</p>\n\n<p>EDIT: I&#39;m really surprised so many new entrants are still here. Obviously I&#39;m glad to see it. </p>\n\n<p>Now that I see there are so many of you I have a question. Where do you go to find information on cryptocurrency? I rely on the same sites I have for years so I&#39;m wondering if there are new high quality sites. Thanks in advance.</p>\n\n<p>EDIT: I&#39;m so happy to see so many new people discovering cryptocurrency. I posted this thinking there might be a few people still hanging around. The number of responses and the general quality of the responses has made me more enthusiastic. Thanks!</p>\n</div><!-- SC_ON -->",
  "score": 276,
  "permalink": "/r/CryptoCurrency/comments/nugq7s/how_many_of_the_newbies_stuck_around/",
  "subreddit": "CryptoCurrency",
  "id": "nugq7s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404882872
}