{
  "author": "rrdonoo",
  "the_new_excerpt": "https://www.fool.com/investing/2021/05/10/quarterly-losses-uber-lyft-confirm-ride-hailing/\n\nThe business premise seems sound enough, at least on the surface. The problem:\nOwning a vehicle is more trouble than it's worth, but taxi cabs are costly and\nso yesterday. The solution: Just use a mobile app…",
  "original_created_utc": 1620659349,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://www.fool.com/investing/2021/05/10/quarterly-losses-uber-lyft-confirm-ride-hailing/\n\nこのビジネスの前提は、少なくとも表面的には健全なものです。しかし、問題があります。\n車を持つのは面倒だけど、タクシーはお金がかかるし、昨日までは\n昨日のことです。解決策は？スマホアプリを使って",
      "title": "モトリーフール】UberとLyftの現在のモデルは機能していない。売上高にほぼ比例して費用が膨らみ、純損失も増加しています。現状では、EBITDA改善の見通しはどちらも信じがたいものです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.fool.com/investing/2021/05/10/quarterly-losses-uber-lyft-confirm-ride-hailing/\n\n商业前提似乎足够健全，至少在表面上。问题是。\n拥有一辆车比它的价值更麻烦，但出租车的成本很高，而且是在昨天。\n所以昨天。解决办法。只需使用一个移动应用程序...",
      "title": "[Motley Fool]Uber和Lyft的现有模式根本行不通。支出与收入几乎完全同步增长，净亏损也是如此。就目前的情况来看，EBITDA的改善前景都很难让人相信。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.fool.com/investing/2021/05/10/quarterly-losses-uber-lyft-confirm-ride-hailing/\n\n商業前提似乎足夠健全，至少在表面上。問題是。\n擁有一輛車比它的價值更麻煩，但出租車的成本很高，而且是在昨天。\n所以昨天。解決辦法。只需使用一個移動應用程序...",
      "title": "[Motley Fool]Uber和Lyft的現有模式根本行不通。支出與收入幾乎完全同步增長，淨虧損也是如此。就目前的情況來看，EBITDA的改善前景都很難讓人相信。"
    }
  ],
  "title": "[Motley Fool] Current model for Uber, Lyft just doesn't work. Expenses have scaled up in near-perfect step with revenue, as have net losses. As it stands now, both EBITDA improvement outlooks are tough to believe.",
  "created_utc": 1620670249,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.fool.com/investing/2021/05/10/quarterly-losses-uber-lyft-confirm-ride-hailing/\">https://www.fool.com/investing/2021/05/10/quarterly-losses-uber-lyft-confirm-ride-hailing/</a></p>\n\n<p>The business premise seems sound enough, at least on the surface. The problem: Owning a vehicle is more trouble than it&#39;s worth, but taxi cabs are costly and so yesterday. The solution: Just use a mobile app to summon a contracted driver who will ferry you from one place to another at a more efficient (i.e. cheaper) price. Everyone wins.</p>\n\n<p>Except not everyone is winning with this modern-day business model. Shareholders of ride-hailing powerhouses Lyft (NASDAQ:LYFT) and Uber Technologies (NYSE:UBER) just saw another quarter of steep losses.</p>\n\n<p>Both companies fared better than expected, mind you, at least on the earnings front. But both companies&#39; losses continue to scale up in step with revenue growth rather than decline, as their two biggest expenses are directly tethered to sales. Those expenses are the cost of revenue -- what Uber and Lyft are paying their drivers -- and marketing expenses.</p>\n\n<p>It&#39;s past time for investors to ask what the plausible path to profitability looks like for these companies.</p>\n\n<p>Woman on cell phone standing in front of a broken-down car.\nIMAGE SOURCE: GETTY IMAGES.</p>\n\n<p>What&#39;s changing?\nFor the record, the analyst community isn&#39;t fazed by the losses so far, apparently convinced that both ride-hailing brands are on the cusp of fiscal breakthroughs. Current estimates imply Uber will cut its operating losses by more than half this year, and do the same again in 2022. Those same analysts are predicting Lyft will swing to operating profitability next year. Investors are (for the most part) buying into this bullishness.</p>\n\n<p>The graphics below put things in perspective, starting with Uber Technologies. Notice how, thus far, the company&#39;s cost of revenue has consumed 45% to 50% of revenue. Analysts believe these costs will fall toward 40% of sales in the foreseeable future, when marketing spending is expected to slide well below 30% of revenue.</p>\n\n<p>Uber&#39;s profitability is projected to widen soon, but the company&#39;s not explained how its driver costs are going to be curbed.\nDATA SOURCE: THOMSON REUTERS. CHART BY AUTHOR. DOLLAR FIGURES ARE IN MILLIONS.</p>\n\n<p>The same basic concern applies to Lyft, though at different proportions. Lyft&#39;s cost of sales -- or its direct cost of delivering services -- lingered in excess of 50% of sales before COVID-19 took hold. Now expectations are that those costs can be whittled down to under 40% of revenue. Marketing expenses are projected to fall to single-digit percentages, while administrative expenses are expected to fall despite expansion into new ventures like bikes, scooters, car rentals, and mass transit (public busing) partnerships.</p>\n\n<p>Lyft&#39;s driver costs are supposed to inch lower, improving profits. The ride-hailing outfit has yet to explain how this biggest cost is feasibly going to fall though.\nDATA SOURCE: THOMSON REUTERS. CHART BY AUTHOR. ALL DOLLAR FIGURES ARE IN MILLIONS.</p>\n\n<p>What&#39;s missing from both of these progressive forecasts, however, is a clear explanation of how the ride-hailing business model is going to cost less on a per-mile or per-ride basis in the future than it has in the past. More scale doesn&#39;t inherently translate into profitability if most of your expenses are variable costs rather than fixed costs. </p>\n\n<p>Unanswered questions and overlooked threats\nBeing pessimistic about either company&#39;s future is tough these days, of course. Both stocks are rated as buys, and each is currently trading below analysts&#39; consensus price targets.</p>\n\n<p>Then there&#39;s the encouraging commentary of each outfit&#39;s top executives. Lyft CEO Logan Green explained during the company&#39;s first-quarter conference call that &quot;as the recovery continues, we&#39;re confident we&#39;ll be able to deliver strong organic growth and adjusted EBITDA improvements.&quot; That swing to positive EBITDA should take shape during Q3 of this year, according to the company. Uber&#39;s chief Dara Khosrowshahi is just as bullish, commenting during his company&#39;s first-quarter call that &quot;Even as we invested for growth, the benefits of scale and rigorous cost management drove an adjusted EBITDA improvement of $253 million year on year and $95 million quarter on quarter.&quot; Khosrowshahi also broadly suggested positive EBITDA figures were in sight. Package and food deliveries will help on that front.</p>\n\n<p>Neither chief, however, explained exactly how or why it&#39;s going to cost less to drive a passenger from point A to point B in 2021 than it did in 2019 -- before the pandemic shook things up, and when gasoline was still dirt-cheap.</p>\n\n<p>It&#39;s also naive to ignore how efforts to protect so-called &quot;gig&quot; workers aren&#39;t already threatening both companies&#39; business models, which lean heavily on the relatively lower costs of contracted drivers (as opposed to conventional employees). The threat of that additional expense will only grow as time marches on, and even without the regulatory movement we&#39;ve already seen, would-be drivers aren&#39;t being lured back en masse despite big sign-up bonuses and incentives put in place last month. Uber&#39;s management clearly conceded this headwind during last week&#39;s call, although it downplayed the actual scope of the risk.</p>\n\n<p>To its credit, Lyft cut its marketing spending dramatically last quarter. Uber&#39;s Khosrowshah believes his company will need less advertising in the future as well. </p>\n\n<p>That too may mostly be wishful thinking, though, given the competition coming to the market. Alphabet&#39;s driverless ride-hailing service Waymo is up and running in Phoenix, and the company&#39;s ultimate aim is to expand the service. In the meantime, smaller start-ups like Blacklane, Myle, and Nomad are just some of the names standing ready to swipe share from a market Uber and Lyft largely developed.</p>\n\n<p>The point is that marketing isn&#39;t something that&#39;s easy to simply stop doing, or even curtail. It&#39;s conceivable both of these companies will need to expand rather than reduce their marketing outlays in the future.</p>\n\n<p>Bottom line\nBoth Uber and Lyft can continue to scale up, but to what end? Both have already been scaling up for some time. Expenses have merely scaled up in near-perfect step with revenue, as have net losses. Investors may want to start asking for specifics about each company&#39;s cost-reduction plans, and then decide whether or not they&#39;re plausible. As it stands now, both EBITDA improvement outlooks are tough to believe.</p>\n</div><!-- SC_ON -->",
  "score": 336,
  "permalink": "/r/investing/comments/n974pi/motley_fool_current_model_for_uber_lyft_just/",
  "subreddit": "investing",
  "id": "n974pi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994599
}