{
  "author": "Juicy5junior",
  "original_created_utc": 1658273246,
  "title": "So theres a building that I walk by everyday and each day I see children throwing up out in the alleyway behind it and shortly after being carried in by 2 men. Any Ideas?",
  "created_utc": 1658281569,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I walk by this large concrete building everyday during my morning, afternoon, and evening walks and one evening I was late to my walk and while passing the building I noticed 2 girls vomiting their guts out in the alleyway behind it, I&amp;#39;ve seen this happen 4 more times after that, but only because I went across the street and waited to see if it would happen again. After the first time I&amp;#39;ve been watching the alleyway every evening from 5-6 and each time so far there&amp;#39;s been a girl/boy vomiting and shortly after being yanked back into the building. I&amp;#39;m too afraid to investigate this but any ideas on what could be going on?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 253,
  "permalink": "/r/TooAfraidToAsk/comments/w36tlw/so_theres_a_building_that_i_walk_by_everyday_and/",
  "subreddit": "TooAfraidToAsk",
  "id": "w36tlw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I walk by this large concrete building everyday during my morning, afternoon,\nand evening walks and one evening I was late to my walk and while passing the\nbuilding I noticed 2 girls vomiting their guts out in the alleyway behind it,\nI've seen this happen 4 more times after that, but only because I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この大きなコンクリートの建物を、私は毎日、朝、昼と通りかかります。\nある晩、散歩に遅れてしまい、この建物の前を通りかかりました。\nそのビルの裏の路地で2人の少女が嘔吐しているのを目撃しました。\nその後、4回ほどこの光景を目にしたのですが、ただ、私は...。",
      "title": "毎日通るビルで、裏の路地で子供が吐いた後、2人の男に運ばれていくのを毎日見ているんです。何か思い当たることはありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我每天上午、下午都会经过这座大型混凝土建筑。\n有一天晚上，我在散步时迟到了，在经过这栋大楼时，我注意到有两个女孩正在呕吐。\n我注意到两个女孩在大楼后面的巷子里呕吐。\n之后我又看到这种情况发生了4次，但只是因为我...",
      "title": "我每天都会路过一栋大楼，每天我都会看到孩子们在大楼后面的巷子里呕吐，不久后就被两个男人抱进去。有什么想法吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我每天上午、下午都會經過這座大型混凝土建築。\n有一天晚上，我在散步時遲到了，在經過這棟大樓時，我注意到有兩個女孩正在嘔吐。\n我注意到兩個女孩在大樓後面的巷子裏嘔吐。\n之後我又看到這種情況發生了4次，但只是因爲我...",
      "title": "我每天都會路過一棟大樓，每天我都會看到孩子們在大樓後面的巷子裏嘔吐，不久後就被兩個男人抱進去。有什麼想法嗎？"
    }
  ]
}