{
  "author": "ThrowawayEARTH32",
  "original_created_utc": 1647561364,
  "title": "How do you guys in the USA not find it stressful living with people with guns with them all the time?",
  "created_utc": 1647570881,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Like, do you try your best not to piss people off? Don&amp;#39;t you find it stressful if any situation escalates and you get very worried that they might pull out a gun and kill you?&lt;/p&gt;\n\n&lt;p&gt;How stressful it is to live in the USA with everybody having guns walking around?&lt;/p&gt;\n\n&lt;p&gt;EDIT: Gosh. I just realized I made the shittiest title, lol I repeated &amp;quot;with&amp;quot; 3 times! It&amp;#39;s crazy, too bad I can&amp;#39;t edit it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/tgnypg/how_do_you_guys_in_the_usa_not_find_it_stressful/",
  "subreddit": "NoStupidQuestions",
  "id": "tgnypg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Like, do you try your best not to piss people off? Don't you find it stressful\nif any situation escalates and you get very worried that they might pull out a\ngun and kill you?\n\nHow stressful it is to live in the USA with everybody having guns walking\naround?\n\nEDIT: Gosh. I just realized I made the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人を怒らせないように頑張る、みたいな？ストレスにならないか？\nもし、状況がエスカレートして、相手が銃を抜くかもしれないと、とても心配になったら\n銃で殺される？\n\n誰もが銃を持って歩いているアメリカで生活することは、どれほどのストレスなのでしょうか？\nということです。\n\n編集部：ごっつぁんです。私はちょうど私が作った気づいた...",
      "title": "アメリカの皆さんは、いつも銃を持っている人たちと一緒に暮らしていて、よくストレスに感じないものですね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比如，你是否尽力不惹人生气？你不觉得压力很大吗？\n如果任何情况升级，你会非常担心他们会掏出枪来杀你？\n枪，然后杀了你？\n\n生活在美国，每个人都有枪走来走去，这有多大的压力？\n左右？\n\n编辑：天哪。我刚刚意识到我做了...",
      "title": "你们这些在美国的人怎么不觉得和一直带着枪的人生活在一起会有压力呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比如，你是否盡力不惹人生氣？你不覺得壓力很大嗎？\n如果任何情況升級，你會非常擔心他們會掏出槍來殺你？\n槍，然後殺了你？\n\n生活在美國，每個人都有槍走來走去，這有多大的壓力？\n左右？\n\n編輯：天哪。我剛剛意識到我做了...",
      "title": "你們這些在美國的人怎麼不覺得和一直帶着槍的人生活在一起會有壓力呢？"
    }
  ]
}