{
  "author": "Acceptable_Novel8200",
  "original_created_utc": 1638872014,
  "title": "Bitcoin Horror Stories!",
  "created_utc": 1638884090,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Most of us always regret why didn&amp;#39;t we got in early when BTC was less than $10,$50,$100 etc\nSome people regret that they didn&amp;#39;t knew about Bitcoin back then, then some regret even though they knew why didn&amp;#39;t they bought it,then some people regret that why did they sold it cheap ?&lt;/p&gt;\n\n&lt;p&gt;Then comes the people who managed to bought/mined thousands of Bitcoin, somehow they managed to hold it because they forgot about it or any other reason but only to find out that they lost the Bitcoin by mistake. This is absolute horror,they just lost life changing money and will only have regret for that day. &lt;/p&gt;\n\n&lt;p&gt;Like &lt;/p&gt;\n\n&lt;p&gt;-A guy named James Howells, lost his 7500 mined Bitcoins when his partner threw the drive in garbage.When he saw Bitcoin price soared then he realised what he lost. He is fighting a battle with the City officials to excavate the dumping site to recover his drive.\nHe check the price of his BTC holding everyday, which is rising.He is optimistic that he would get the required permission one day to recover his lost fortune.&lt;/p&gt;\n\n&lt;p&gt;-Stefan Thomas lost access to his 7002 Bitcoins, because he forgot the password which would allow him to unlock a hard drive known as Iron key.It contained the private keys to his digital wallet which still contains the multi-million dollar fortune.\nHe says he felt like &amp;quot;complete idiot&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;-The guy claimed on Bitcoin sub that he bought 10k BTC in early 2010 for just $80.,stored the keys on his laptop after transferring them from a USB.In 2014,crypto started to gain more traction, he went back to look for it thinking he maybe sitting on a huge fortune.He went home to find his old laptop which had been broken for years., then he found out that his mother threw the laptop.&lt;/p&gt;\n\n&lt;p&gt;These incidents in life are definitely going to hunt these people who lost life changing money because of silly mistakes.&lt;/p&gt;\n\n&lt;p&gt;Tomorrow there will be more stories maybe of a different coin which is not even $1 today. \nBut don&amp;#39;t be like these guys learn from their mistakes and follow every measure to secure your Crypto holdings and make sure when the day comes you have access to your crypto.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/ravylm/bitcoin_horror_stories/",
  "subreddit": "CryptoCurrency",
  "id": "ravylm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Most of us always regret why didn't we got in early when BTC was less than\n$10,$50,$100 etc Some people regret that they didn't knew about Bitcoin back\nthen, then some regret even though they knew why didn't they bought it,then some\npeople regret that why did they sold it cheap ?\n\nThen comes the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちの多くは、BTCがまだそれほど高価でなかったときに、なぜ早く参入しなかったのかと後悔しています。\n10ドル、50ドル、100ドルなどなど。\nその時、なぜ買わなかったのかと後悔する人もいれば、わかっていながら\nなぜ安売りしたのか？\n\nそして、次に来るのは...",
      "title": "ビットコインの怖い話！？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们中的大多数人总是后悔，为什么不在BTC低于10美元、50美元、100美元的时候早早入市？\n10美元、50美元、100美元等等。\n然后有些人后悔，即使他们知道为什么不买它，然后有些人后悔，为什么他们把它贱卖了？\n有些人后悔他们为什么不买，然后有些人后悔他们为什么便宜卖掉它？\n\n然后是...",
      "title": "比特币的恐怖故事!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們中的大多數人總是後悔，爲什麼不在BTC低於10美元、50美元、100美元的時候早早入市？\n10美元、50美元、100美元等等。\n然後有些人後悔，即使他們知道爲什麼不買它，然後有些人後悔，爲什麼他們把它賤賣了？\n有些人後悔他們爲什麼不買，然後有些人後悔他們爲什麼便宜賣掉它？\n\n然後是...",
      "title": "比特幣的恐怖故事!"
    }
  ]
}