{
  "author": "Jasquirtin",
  "original_created_utc": 1631900466,
  "title": "Crypto is Saving my Life",
  "created_utc": 1631918349,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Every bit of extra savings I can get I try to put into crypto. So much so I stopped eating out and started shopping at LIDL and ALDI. I am an African American male who is overweight, has high cholesterol and pushing into high blood pressure with a kid on the way. I usually like to drink with football games and eat fatty salty fried foods.</p>\n\n<p>Well no more. My wife and I have decided to cut those things out. We are eating salads lean meat chicken and vegetables to not only save money on eating out for lunch/dinner but to improve our health. What is the point of getting rich if I am dead 5 years after I retire on my crypto gains? How can I pass down incorrect seed phrases to my baby boy if I die before I get to see him receive them?</p>\n\n<p>Buying ETH on the regular has me cutting out junk food and trying to live cheaper and has resulted in a weight reduction of 10 pounds in a month! Oh and when charts are red I stop looking at them and burn off some steam in our home gym on the treadmill.</p>\n\n<p>Crypto is a life saver in more than one way.</p>\n\n<p>&#x200B;</p>\n\n<p>EDIT: I wish every 10 pounds i dropped ETH would increase by 1k. That would really light a fire under my ass.</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/pq4wf1/crypto_is_saving_my_life/",
  "subreddit": "CryptoCurrency",
  "id": "pq4wf1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Every bit of extra savings I can get I try to put into crypto. So much so I\nstopped eating out and started shopping at LIDL and ALDI. I am an African\nAmerican male who is overweight, has high cholesterol and pushing into high\nblood pressure with a kid on the way. I usually like to drink with…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "少しでも余分な貯金があれば、暗号に回すようにしています。そのため、私は\n外食をやめて、LIDLやALDIで買い物をするようになりました。私はアフリカ系アメリカ人の男性です。\n私はアフリカ系アメリカ人の男性で、太りすぎで、コレステロール値が高く、高血圧になりがちです。\n私はアフリカ系アメリカ人の男性で、太り気味で、コレステロール値が高く、高血圧気味で、子供が生まれようとしています。私は通常、一緒に飲むのが好きです...",
      "title": "暗号が私の命を救う"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我可以得到的每一点额外储蓄，我都试图投入到加密货币中。以至于我\n不再在外面吃饭，开始在LIDL和ALDI购物。我是一个非洲\n美国男性，体重超标，胆固醇过高，并且正在向高血压迈进。\n我是一个非裔美国人，体重超标，胆固醇高，血压高，还有一个即将出生的孩子。我通常喜欢与人喝酒。",
      "title": "加密货币正在拯救我的生活"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我可以得到的每一點額外儲蓄，我都試圖投入到加密貨幣中。以至於我\n不再在外面喫飯，開始在LIDL和ALDI購物。我是一個非洲\n美國男性，體重超標，膽固醇過高，並且正在向高血壓邁進。\n我是一個非裔美國人，體重超標，膽固醇高，血壓高，還有一個即將出生的孩子。我通常喜歡與人喝酒。",
      "title": "加密貨幣正在拯救我的生活"
    }
  ]
}