{
  "author": "Appropriate-Ad-8167",
  "original_created_utc": 1625562784,
  "title": "Here's a list of ways of making passive income from your cryptos ( that I'm aware of )",
  "created_utc": 1625586127,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><ul>\n<li>Staking.  Can be done at major exchanges ( Binance, Kraken etc ) but safer to do it on the token&#39;s native wallet or wallets that you have the private keys to. ( Algorand wallet for Algo, Yoroi/Daedalus/ Exodus wallet for ADA and many more ).&quot;Not your keys, not your wallets&quot; - Aantonop</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Lending. You let centralized financed apps ( Cefi ) such as Blockfi, Nexo, Celcius or AAVE ( which is Defi or decentralized finance ) hold your cryptos and they&#39;ll give you interests over time. Most profitable when lending in stablecoins where they can get up to 12% on Nexo ( 8% base + 2% by having 10% of ur total holdings in NEXO tokens + 2% for having NEXO tokens as the rewards )Note, you could also receive some free MATIC by lending on AAVE but their  lending interests are fairly low compared to other lenders ( For USDC, you&#39;ll get 2.09% on AAVE but you could get up to 12% and  8.88% on Nexo and Celcius respectively )</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Brave browser. You could argue that this is not passive income as you are actively searching up things on the internet but this is something we all do ( I assume, we all here are frequent internet users ) on a daily basis and we don&#39;t even actively think about it. Hell, we could make BATs when watching YouTube videos so it&#39;s definitely a win. Currently have a total of 3 BATs combined on my laptop and my PC. Highly recommended</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Liquidity mining? I must admit, my knowledge in this area is certainly lacking and take my words with a grain of salt as I&#39;ve lost value ( my &#39;share&#39; price has dropped a dollar or two but I haven&#39;t sold ) but nevertheless, I get to collect a couple of cents worth of BNB/USDT/XRPS/LINKS every morning ( so could you ) after I wake up which rejuvenates my mind a little. Mind you, I use Binance for liquidity mining.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>In conclusion,</p>\n\n<p>If you have POS based cryptos ( ADA,ALGO, DOT, VET, ATOM, NEO, SOL )  = STAKE them</p>\n\n<p>If you have stablecoins ( USDT ( ew ), USDc, DAI,  ) = HODL them in either a CeFi/ DeFI lending services</p>\n\n<p>&#x200B;</p>\n\n<p>All in all, I am still a crypto noob on my long and perilous journey to become a crypto chad so forgive me if I have made a mistake or two, If you have any other ways to make passive income via cryptos pls comment below as I too would like a piece of that tasty pie of knowledge.</p>\n\n<p>&#x200B;</p>\n\n<p>Toddle - loo  ✌️,</p>\n\n<p>Double A</p>\n\n<p>&#x200B;</p>\n\n<p>edit: Usdc - spelling error</p>\n\n<p>And don&#39;t forget ur moons! ty <a href=\"/u/Arsa3108\">u/Arsa3108</a> for reminding me!</p>\n\n<p>2nd edit: thank you <a href=\"/u/anykeyh\">u/anykeyh</a> for explaining Liquidity in greater depth. Here&#39;s what he wrote in the comment section that I feel like should&#39;ve been integrated into the post in the first place.</p>\n\n<p>/**</p>\n\n<p>LP is for long game.</p>\n\n<p>I won&#39;t recommend unless you have a long-term holding strategy, and only for pairs you know will succeed in the long run or you might get a lot of loss.</p>\n\n<p>ETH/BTC, DAI/BUSD are some of the safest pairs. STABLE/UNSTABLE are ok as long as the market goes sideway like the last 2 months.<br/>\nETH/VET or ETH/THETA are great for sideway market, as chart of those alt-coins tends to be coupled but with different volatily (making it the perfect LP scenario).</p>\n\n<p>If you want to play it safe, PAXG + Nexo is great; the token PAXG is just an ounce of gold-backed by real gold, and Nexo offers 5% on it.<br/>\nSeems for me as safe as possible yet offer good ROI.</p>\n\n<p>**/</p>\n</div><!-- SC_ON -->",
  "score": 174,
  "permalink": "/r/CryptoCurrency/comments/oerbf7/heres_a_list_of_ways_of_making_passive_income/",
  "subreddit": "CryptoCurrency",
  "id": "oerbf7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": " * Staking. Can be done at major exchanges ( Binance, Kraken etc ) but safer to\n   do it on the token's native wallet or wallets that you have the private keys\n   to. ( Algorand wallet for Algo, Yoroi/Daedalus/ Exodus wallet for ADA and\n   many more ).\"Not your keys, not your wallets\" - Aantonop\n\n\n\n…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": " * ステイキング。主要な取引所（Binance、Krakenなど）で行うことができますが、より安全なのは\n   トークンのネイティブウォレットや、秘密鍵を持っているウォレットで行うのが安全です。\n   で行うことができます。(AlgoのAlgorandウォレット、ADAのYoroi/Daedalus/Exodusウォレットなど。\n   その他多数). \"Not your keys, not your wallets\" - Aantonop\n\n\n\n...",
      "title": "クリプトから受動的な収入を得るための方法（私が知っているもの）を以下に列挙します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": " * 赌注。可以在主要的交易所（Binance, Kraken等）进行，但更安全的做法是在你拥有私钥的代币原生钱包或钱包中进行。\n   但在代币的原生钱包或你有私钥的钱包上做更安全。\n   的钱包。Algo的Algorand钱包，ADA的Yoroi/Daedalus/Exodus钱包等等）。\n   \"不是你的钥匙，不是你的钱包\" - Aantonop\n\n\n\n...",
      "title": "以下是利用加密货币赚取被动收入的方法清单（据我所知）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " * 賭注。可以在主要的交易所（Binance, Kraken等）進行，但更安全的做法是在你擁有私鑰的代幣原生錢包或錢包中進行。\n   但在代幣的原生錢包或你有私鑰的錢包上做更安全。\n   的錢包。Algo的Algorand錢包，ADA的Yoroi/Daedalus/Exodus錢包等等）。\n   \"不是你的鑰匙，不是你的錢包\" - Aantonop\n\n\n\n...",
      "title": "以下是利用加密貨幣賺取被動收入的方法清單（據我所知）。"
    }
  ]
}