{
  "author": "Smasher1234",
  "the_new_excerpt": "I like to think I'm a pretty open guy when it comes to discussions. And lately\nI've loved talking about the progress I'm making in the market, how I'm so close\nto paying off my debts, the thrill of having patience and time work out for you,\netc. But I find that maybe talking about with certain…",
  "original_created_utc": 1613306536,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我喜欢认为我是一个很开放的人，当涉及到讨论。而最近\n我很喜欢谈论我在市场上取得的进步，我是如何在市场上接近\n到还债，有耐心和时间为你工作的快感。\n等。但我发现，也许与某些人谈...",
      "title": "您是否与您的朋友和/或家人分享您的股票收益和股票活动？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我喜歡認爲我是一個很開放的人，當涉及到討論。而最近\n我很喜歡談論我在市場上取得的進步，我是如何在市場上接近\n到還債，有耐心和時間爲你工作的快感。\n等。但我發現，也許與某些人談...",
      "title": "您是否與您的朋友和/或家人分享您的股票收益和股票活動？"
    }
  ],
  "title": "Do you share your stock gains and stock activity with your friends and/or family?",
  "created_utc": 1613328807,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I like to think I&#39;m a pretty open guy when it comes to discussions. And lately I&#39;ve loved talking about the progress I&#39;m making in the market, how I&#39;m so close to paying off my debts, the thrill of having patience and time work out for you, etc. But I find that maybe talking about with certain people feels...icky. </p>\n\n<p>Obviously I can talk NIO vs XPEV with the guy who has 80K in his retirement like nothing. But it feels way more inappropriate when I&#39;m talking about stocks with people who have lost their jobs in this pandemic with no savings and are seeing all their overdue bills pile up.</p>\n\n<p>Maybe I&#39;m just being way too up front with personal finances with people? But sometimes if feels really bad talking about how the rally in the last year has helped me pay off my car three years early when they&#39;ve had to move to a cheaper and smaller apartment with more people when one or two on the household lost their job in this pandemic.</p>\n\n<p>How you all feel about this?</p>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/stocks/comments/ljnq16/do_you_share_your_stock_gains_and_stock_activity/",
  "subreddit": "stocks",
  "id": "ljnq16",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728623057
}