{
  "author": "SlappySpankBank",
  "original_created_utc": 1625055032,
  "title": "When I copy and paste my wallet address from Kraken, the pasted address is not the same. Is this normal or a virus?",
  "created_utc": 1625063628,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think this might be a virus, I don&#39;t think I&#39;ve downloaded anything suspicious but maybe I did.</p>\n\n<p>I copy and pasted and address from Kraken into the Monero GUI wallet. The addresses do not match.I copied it again and posted it in a word document, it&#39;s the same address from before, but does not match the wallet address on Kraken.</p>\n\n<p>I just tried the same thing again on a different computer and now the addresses match. I&#39;m thinking I have a virus for sure now but I have no idea where it came from our how to find it.</p>\n\n<p>Edit: Ok there were a few viruses, I&#39;m not sure which one was which or where it came from. This is what malwarebyte shows me</p>\n\n<p>Hijack.ShellA.Gen</p>\n\n<p>Trojan.Crypt.MSIL.Generic</p>\n\n<p>Malware.AI.4251292410</p>\n</div><!-- SC_ON -->",
  "score": 282,
  "permalink": "/r/CryptoCurrency/comments/oavzsp/when_i_copy_and_paste_my_wallet_address_from/",
  "subreddit": "CryptoCurrency",
  "id": "oavzsp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I think this might be a virus, I don't think I've downloaded anything suspicious\nbut maybe I did.\n\nI copy and pasted and address from Kraken into the Monero GUI wallet. The\naddresses do not match.I copied it again and posted it in a word document, it's\nthe same address from before, but does not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ウイルスかもしれません。怪しいものをダウンロードしていないと思うのですが、もしかしたら\n怪しいものをダウンロードしたとは思いませんが、もしかしたらしてしまったかもしれません。\n\nKrakenからMoneroのGUIウォレットにアドレスをコピー＆ペーストしました。アドレスは一致しません。\nアドレスが一致しません。もう一度コピーしてワード文書に貼ってみましたが、先ほどと同じアドレスです。\n再度コピーしてワード文書で投稿すると、先ほどと同じアドレスですが、一致しません。",
      "title": "Krakenからウォレットアドレスをコピーして貼り付けると、貼り付けたアドレスが同じになりません。これは普通のことなのか、ウイルスなのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为这可能是一种病毒，我不认为我下载了任何可疑的东西\n但也许我做了。\n\n我把Kraken的地址复制并粘贴到Monero GUI钱包中。这些\n地址不匹配。我又复制了一次，并把它贴在一个word文档中，这是\n它与之前的地址相同，但并不...",
      "title": "当我从Kraken复制和粘贴我的钱包地址时，粘贴的地址是不一样的。这是正常现象还是病毒？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲這可能是一種病毒，我不認爲我下載了任何可疑的東西\n但也許我做了。\n\n我把Kraken的地址複製並粘貼到Monero GUI錢包中。這些\n地址不匹配。我又複製了一次，並把它貼在一個word文檔中，這是\n它與之前的地址相同，但並不...",
      "title": "當我從Kraken複製和粘貼我的錢包地址時，粘貼的地址是不一樣的。這是正常現象還是病毒？"
    }
  ]
}