{
  "author": "janpkrs97",
  "original_created_utc": 1632674023,
  "title": "Learn from my mistakes: store your keys physically and make sure you have multiple backups.",
  "created_utc": 1632704915,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I really just need to vent right now. Couple months ago I started DCA&#39;ing into ADA and had a decent bag of about 250ADA. Not really live changing money, but a decent ~ 10% of my portfolio. </p>\n\n<p>I stored the coins on Daedalus and was actively staking, passively earning more coins. </p>\n\n<p>Well, here&#39;s the fuckup. Instead of physically storing my keys for Daedalus on paper I used my old password manager app for the recovery seed and spending password (randomly generated password - all I remember is like 3/21 characters.)</p>\n\n<p>A couple days ago I checked my phone and for some reason the password manager app doesn&#39;t exist anymore. I still don&#39;t believe it but I must&#39;ve accidentally deleted the app. </p>\n\n<p>Without the spending password, I can&#39;t send the ADA to a new wallet and without the recovery seed I can&#39;t restore it. </p>\n\n<p>No backups, emergency kit or any other way of retrieving and restoring the app. </p>\n\n<p>Now all I can do is watch my ADA slowly grow without ever being able to spend any of it. </p>\n\n<p>Oh well, guess I have to learn from this. </p>\n\n<p>TLDR; another sacrifice to the crypto gods. Store your keys/passwords physically and if you do want to store them digitally, make sure you have multiple backups!</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/pvx9jm/learn_from_my_mistakes_store_your_keys_physically/",
  "subreddit": "CryptoCurrency",
  "id": "pvx9jm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I really just need to vent right now. Couple months ago I started DCA'ing into\nADA and had a decent bag of about 250ADA. Not really live changing money, but a\ndecent ~ 10% of my portfolio.\n\nI stored the coins on Daedalus and was actively staking, passively earning more\ncoins.\n\nWell, here's the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は今、本当に吐き出したいのです。2ヶ月前、私はADAにDCAを始めました。\n数ヶ月前、私はADAにDCAを始め、250ADAほどのまとまったバッグを手に入れました。人生を変えるほどの金額ではありませんが、私のポートフォリオの\n私のポートフォリオの10％に相当します。\n\n私はDaedalusにコインを保管し、積極的にステークして、より多くのコインをパッシブに獲得していました。\nコインを稼いでいました。\n\nさて、ここで問題が発生しました...。",
      "title": "私の失敗から学んだことは、鍵を物理的に保管し、複数のバックアップを取っておくことです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我现在真的需要发泄一下。几个月前，我开始将DCA纳入\nADA，并有了一个大约250ADA的体面袋子。不是真正改变生活的钱，但\n我的投资组合的10%。\n\n我把硬币存放在代达罗斯，并积极押注，被动地赚取更多的\n币。\n\n那么，这里是...",
      "title": "从我的错误中吸取教训：将你的钥匙存放在实物中并确保你有多个备份。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我現在真的需要發泄一下。幾個月前，我開始將DCA納入\nADA，並有了一個大約250ADA的體面袋子。不是真正改變生活的錢，但\n我的投資組合的10%。\n\n我把硬幣存放在代達羅斯，並積極押注，被動地賺取更多的\n幣。\n\n那麼，這裏是...",
      "title": "從我的錯誤中吸取教訓：將你的鑰匙存放在實物中並確保你有多個備份。"
    }
  ]
}