{
  "author": "Badprime010",
  "original_created_utc": 1657175589,
  "title": "Is it unreasonable to ask my girlfriend to not talk about our sex life to her friends?",
  "created_utc": 1657209624,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So in the past, in conversation with my girlfriends friends they’ve brought up how they know EVERYTHING (inferring they know about our sex life). This makes me a little uncomfortable but I haven’t said anything. I’ll sometimes joke about like my girlfriend and I have sex, for example after a long night out my girlfriend and her friend Emily walked my upstairs to my room. As my girlfriend was taking off my shoes I had joked “Emily you might want to leave things are about to get freaky.” Just to give an idea about the type of joking. It’s never usually specific or grotesque. &lt;/p&gt;\n\n&lt;p&gt;So Tonight I was talking a little dirty to my girlfriend and she really liked what I was saying and told me I should write a book. I threw a little something together and presented it to her. She then said “Emily and I are going to read it.” For some background Emily is her friend who is sleeping over. I was immediately against this and said that I had wrote it for my girlfriend and I didn’t want Emily to laugh at it or something. My girlfriend insisted Emily wouldn’t so I just said fine. She then gave me all the feedback that Emily had, which made me very uncomfortable. I had explained that to my girlfriend and sort of just brushed it off. It makes me really uncomfortable that she was willing to just let her friend read a very explicit “erotic novel” about us without even asking if it was okay. My girlfriend has since gone to bed and it’s really stuck with me and just make me really uncomfortable and I’m not sure why I even said okay in the first place. I don’t want to seem controlling but 50% of sex is me, so I feel like I should have at least some say over who knows about it, especially when it’s things written from my point of view.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/vtbykr/is_it_unreasonable_to_ask_my_girlfriend_to_not/",
  "subreddit": "TooAfraidToAsk",
  "id": "vtbykr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "So in the past, in conversation with my girlfriends friends they’ve brought up\nhow they know EVERYTHING (inferring they know about our sex life). This makes me\na little uncomfortable but I haven’t said anything. I’ll sometimes joke about\nlike my girlfriend and I have sex, for example after a long…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、過去に女友達との会話で、彼らが話題にしたのは\n私たちの性生活について知っていると思われる）。これは私\n少し不愉快ですが、何も言いません。私は時々冗談を言います。\n私は私のガールフレンドと私は長い間、例えば、セックスを持っているような冗談を言う...",
      "title": "恋人に「友達に私たちの性生活の話をしないで」と頼むのは無理があるでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，在过去，在与我的女友朋友的谈话中，他们提出了\n他们如何知道所有的事情（推断他们知道我们的性生活）。这让我\n有点不舒服，但我没有说什么。我有时会开玩笑说\n比如我和我的女朋友做爱，例如在一个很长的时间里。",
      "title": "要求我的女友不要向她的朋友谈论我们的性生活，这是否不合理？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，在過去，在與我的女友朋友的談話中，他們提出了\n他們如何知道所有的事情（推斷他們知道我們的性生活）。這讓我\n有點不舒服，但我沒有說什麼。我有時會開玩笑說\n比如我和我的女朋友做愛，例如在一個很長的時間裏。",
      "title": "要求我的女友不要向她的朋友談論我們的性生活，這是否不合理？"
    }
  ]
}