{
  "author": "nonce--sense",
  "original_created_utc": 1637949012,
  "title": "When an asset drops 10% in a matter of minutes, here's what happened:",
  "created_utc": 1637959289,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Step 1: Corporations with large amounts of money borrow thousands of BTC. </p>\n\n<p>Step 2: They take the BTC and dump it on the market. This blows through buy walls and causes leverage traders to be liquidated. </p>\n\n<p>Step 3: Fear and panic spread through the market. Shills and salty traders alike will flood social media with FUD. The price further dips.</p>\n\n<p>Step 4: The hedge funds close the loop: they buy back the BTC they borrowed, pay back their lenders, and generate a profit.</p>\n\n<p>They can do this because they have capital that you and I do not have. And they do it over and over.</p>\n\n<p>Don&#39;t fall for their tricks. Just hodl. Or better, buy whenever you see a -10% price dip. You can be assured that this was NOT a bunch of ordinary individuals, who happen to take profits at the same time.</p>\n\n<p>Bitcoin is truth.</p>\n</div><!-- SC_ON -->",
  "score": 293,
  "permalink": "/r/Bitcoin/comments/r2ssq2/when_an_asset_drops_10_in_a_matter_of_minutes/",
  "subreddit": "Bitcoin",
  "id": "r2ssq2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Step 1: Corporations with large amounts of money borrow thousands of BTC.\n\nStep 2: They take the BTC and dump it on the market. This blows through buy\nwalls and causes leverage traders to be liquidated.\n\nStep 3: Fear and panic spread through the market. Shills and salty traders alike\nwill flood…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ステップ1：大金を持っている企業が数千のBTCを借りる。\n\nステップ2：BTCを奪って市場に投売りする。これにより、買いの壁が吹き飛び\n壁を吹き飛ばし、レバレッジ・トレーダーを清算させる。\n\nステップ3： 恐怖とパニックが市場に広がる。詐欺師も塩辛いトレーダーも\n殺到する...",
      "title": "ある資産が数分で10％下落したとき、何が起こったのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "第一步：拥有大量资金的公司借入成千上万的BTC。\n\n第二步：他们拿着BTC在市场上抛售。这样就可以通过购买\n墙，导致杠杆交易者被清算。\n\n第三步：恐惧和惊慌在市场上蔓延。骗子和咸鱼交易者都会\n将涌入...",
      "title": "当一项资产在几分钟内下跌10%时，这里发生了什么。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "第一步：擁有大量資金的公司借入成千上萬的BTC。\n\n第二步：他們拿着BTC在市場上拋售。這樣就可以通過購買\n牆，導致槓桿交易者被清算。\n\n第三步：恐懼和驚慌在市場上蔓延。騙子和鹹魚交易者都會\n將湧入...",
      "title": "當一項資產在幾分鐘內下跌10%時，這裏發生了什麼。"
    }
  ]
}