{
  "author": "Feliscatus1920",
  "the_new_excerpt": "Coworkers, select strangers, meeting new people etc. Is this part of an illness?\nHow can I stop this? For example, I meet someone new at work and imagine that I\nam predicting a future connection between us that leads to being sexual in\nnature.\n\nIt's as if there's a non-existent sexual energy that I…",
  "original_created_utc": 1618455364,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "同僚、見知らぬ人を選ぶ、新しい人に会うなど。これは病気の一部ですか？\nこれを止めるにはどうしたらいいですか？例えば、職場で新しい人に会って、その人との将来のつながりを予測していると想像します。\n例えば、職場で新しい人と出会い、その人との間に性的な関係が生まれることを予測していると想像します。\n性的な関係になると予測していると想像します。\n\nまるで存在しない性的エネルギーがあるかのように...。",
      "title": "誰かが常に、無意識のうちに、交流のある人とのセックスや性的な関係を想像してしまうのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "同事、选择陌生人、认识新朋友等。这是疾病的一部分吗？\n怎样才能阻止这种情况的发生？例如，我在工作中遇到一个新的人，并想象我\n我预测未来我们之间的联系会导致性爱的发生。\n的性质。\n\n好像有一种不存在的性能量，我...",
      "title": "还有人不断地、不由自主地想象着与自己交往的人发生性关系或性行为吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "同事、選擇陌生人、認識新朋友等。這是疾病的一部分嗎？\n怎樣才能阻止這種情況的發生？例如，我在工作中遇到一個新的人，並想象我\n我預測未來我們之間的聯繫會導致性愛的發生。\n的性質。\n\n好像有一種不存在的性能量，我...",
      "title": "還有人不斷地、不由自主地想象着與自己交往的人發生性關係或性行爲嗎？"
    }
  ],
  "title": "Does anyone else constantly and involuntarily imagine having sex or being sexual with people they interact with?",
  "created_utc": 1618471652,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Coworkers, select strangers, meeting new people etc. Is this part of an illness? How can I stop this? For example, I meet someone new at work and imagine that I am predicting a future connection between us that leads to being sexual in nature. </p>\n\n<p>It&#39;s as if there&#39;s a non-existent sexual energy that I involuntary believe exists and will inevitably lead to reality with me being some type of desireable being. I have a difficult time telling my brain that this sexual connection does not exist and that I am not sexually wanted even if the idea keeps replaying in my head as if watching a prediction.</p>\n</div><!-- SC_ON -->",
  "score": 126,
  "permalink": "/r/NoStupidQuestions/comments/mr65a7/does_anyone_else_constantly_and_involuntarily/",
  "subreddit": "NoStupidQuestions",
  "id": "mr65a7",
  "is_self": true,
  "media": null,
  "is_video": false
}