{
  "author": "Nuewim",
  "original_created_utc": 1632242438,
  "title": "I prefer to invest in crypto and risk losing all my money, than do nothing and waste my life.",
  "created_utc": 1632252670,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yes, I prefer invest as much as I can, because I am much more afraid that I will waste my life by working whole life 9-5 like and never be happy.</p>\n\n<p>I always ask myself what is the  worst that can happen? And I can&#39;t find answer that would scare me or change  my mind. I am young,  university student. I  don&#39;t have  my own home,  car or job. I am not scared to end on street or under the bridge. I prefer this, because it will mean I at least tried to not be part of rat race.</p>\n\n<p>People work for  few k $, have to pay 30 years for their home and 2 cars. Wife, kids, dog and working 40 years 9-5 with 2 week holidays once a year. Free weekends, when you have a lot of things to do in home, few friends you see rarely, cause you are all busy, no time for yourself. This is what scare shit out of me, not losing money on crypto. I don&#39;t want to become small robot in huge machine called society, working for little bit  fiat,  when a some people live their dream lives.</p>\n\n<p>Many people are too afraid to risk and invest as much they can and HODL no matter what happen, because they believe it is  too risky. They prefer to settle for safe mediocre life. They do no risk, do not invest, do not ask  person they like for date, do not change terrible do job,  not throw all this shit to travel around the world, because they are too afraid to lose roof over the head and little bit of security they have. </p>\n\n<p>Someone told me that by investing in stocks I can be rich in 30 years. Many people like to tell this bullshit that by invesiting whole life, every month when you will retire you will have finally 1 or 1,5 million $... I am 22 years old, I don&#39;t want to be pawn on chessboard and see how world change around me when I work 30/40 years for my first big money. </p>\n\n<p>I prefer to invest in crypto as much as I can, achieve  my dreams, become rich, travel around the world, climb fricking Mount Everest or jump with parachute  and change the world for better, by supporting new technologies. I want to support finding cure for some untreatable illness, invest in space rockets, solar panels, electric cars, exosceletons, drones and everything that will help humanity. I want matter, even if I will have to took risk. Investing in crypto is still less risky  for me than living average life.</p>\n\n<p>It is of course my way, I do not advice anyone to do it. I just wanted you to see different  point of view.</p>\n</div><!-- SC_ON -->",
  "score": 260,
  "permalink": "/r/CryptoCurrency/comments/psmju7/i_prefer_to_invest_in_crypto_and_risk_losing_all/",
  "subreddit": "CryptoCurrency",
  "id": "psmju7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Yes, I prefer invest as much as I can, because I am much more afraid that I will\nwaste my life by working whole life 9-5 like and never be happy.\n\nI always ask myself what is the worst that can happen? And I can't find answer\nthat would scare me or change my mind. I am young, university student. I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はできる限り投資をしたいと思っています。なぜなら、9時から5時のような仕事をして人生を無駄にし、幸せになれないことの方がずっと怖いからです。\nなぜなら、9時から5時まで働いて人生を無駄にし、幸せになれないことの方がずっと怖いからです。\n\n私はいつも、起こりうる最悪の事態は何かと自問しています。と自問自答していますが\n私を怖がらせたり、考えを変えたりするような答えは見つかりません。私は若く、大学生です。I...",
      "title": "何もしないで人生を無駄にするより、暗号に投資して全財産を失うリスクを負った方がいいと思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，我更喜欢尽可能多的投资，因为我更害怕我将会\n浪费我的生命，一辈子朝九晚五地工作，永远不会快乐。\n\n我总是问自己，可能发生的最坏情况是什么？而且我找不到答案\n能让我感到害怕或改变我的想法。我很年轻，是个大学生。I...",
      "title": "我宁愿投资于加密货币，冒着失去所有资金的风险，也不愿意什么都不做，浪费我的生命。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，我更喜歡儘可能多的投資，因爲我更害怕我將會\n浪費我的生命，一輩子朝九晚五地工作，永遠不會快樂。\n\n我總是問自己，可能發生的最壞情況是什麼？而且我找不到答案\n能讓我感到害怕或改變我的想法。我很年輕，是個大學生。I...",
      "title": "我寧願投資於加密貨幣，冒着失去所有資金的風險，也不願意什麼都不做，浪費我的生命。"
    }
  ]
}