{
  "author": "Hardcore90skid",
  "the_new_excerpt": "My FIL brought up a good point as we were discussing the vaccine I received. Our\nprovincial government has mandated that we push back booster shots well beyond\nthe recommended period, in this case, it's four months from twenty-one days for\nPfizer. He said that the manufacturer has set twenty-one…",
  "original_created_utc": 1618232134,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が受けたワクチンの話をしているときに、財閥がいいことを言いました。私たちの\n私たちの州政府は、推奨された期間を大幅に超えてブースターショットを延期することを義務付けています。\nこの場合、ファイザー社では21日から4ヶ月となっています。\nファイザー社 彼が言うには、メーカーが21日としているのは...。",
      "title": "メーカー推奨のブースター期間後のワクチンの有効性は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的FIL提出了一个很好的观点，因为我们正在讨论我接受的疫苗。我们的\n省政府规定，我们推倒重来的助推器远远超过了......。\n建议的期限，在这种情况下，它是四个月，从21天的建议。\n辉瑞公司。他说，制造商已经设定了二十一个...",
      "title": "厂家推荐增效期后的疫苗疗效？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的FIL提出了一個很好的觀點，因爲我們正在討論我接受的疫苗。我們的\n省政府規定，我們推倒重來的助推器遠遠超過了......。\n建議的期限，在這種情況下，它是四個月，從21天的建議。\n輝瑞公司。他說，製造商已經設定了二十一個...",
      "title": "廠家推薦增效期後的疫苗療效？"
    }
  ],
  "title": "Vaccine Efficacy After Manufacturer Recommended Booster Period?",
  "created_utc": 1618264450,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My FIL brought up a good point as we were discussing the vaccine I received. Our provincial government has mandated that we push back booster shots well beyond the recommended period, in this case, it&#39;s four months from twenty-one days for Pfizer. He said that the manufacturer has set twenty-one days for a reason, so how effective is the booster after four months. His position is that it&#39;s pointless to even get it if the booster shot is worthless after even twenty-two days.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/askscience/comments/mpd956/vaccine_efficacy_after_manufacturer_recommended/",
  "subreddit": "askscience",
  "id": "mpd956",
  "is_self": true,
  "media": null,
  "is_video": false
}