{
  "author": "slvbtc",
  "original_created_utc": 1650445200,
  "title": "I used to think $1 million per bitcoin was a fantasy, now it seems highly logical and almost conservative.",
  "created_utc": 1650470060,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Many investors who previously had 5% of their networth in gold are allocating an additional 5% of their net worth to bitcoin. Investors are starting to allocate the same amount of capital to bitcoin as they have allocated to gold.&lt;/p&gt;\n\n&lt;p&gt;Golds market cap risisng from $10T to $25T is a given during a period of high inflation and financial uncertainty, and if investors are allocating the same amount to both gold and bitcoin then theres nothing to stop bitcoins market cap also rising to $25T.&lt;/p&gt;\n\n&lt;p&gt;That would mean a 25x rise from this point and price per bitcoin above $1 million.&lt;/p&gt;\n\n&lt;p&gt;Investors simply allocating the same percentage of their networth to bitcoin as they do to gold in an inflationary environment could easily mean a bitcoin price above $1 million.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 320,
  "permalink": "/r/Bitcoin/comments/u7s55c/i_used_to_think_1_million_per_bitcoin_was_a/",
  "subreddit": "Bitcoin",
  "id": "u7s55c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Many investors who previously had 5% of their networth in gold are allocating an\nadditional 5% of their net worth to bitcoin. Investors are starting to allocate\nthe same amount of capital to bitcoin as they have allocated to gold.\n\nGolds market cap risisng from $10T to $25T is a given during a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これまで純資産の5％を金に投資していた投資家の多くが、さらに5％をビットコインに配分している。\nビットコインに投資しています。投資家たちは\n投資家は、金と同程度の資金をビットコインに割り当て始めています。\n\nゴールドの時価総額が$10Tから$25Tに上昇することは、この間、当然のことです。",
      "title": "以前は1ビットコイン100万ドルなんて幻想だと思っていましたが、今は非常に論理的で、ほとんど保守的に見えます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "许多以前有5%的净资产在黄金上的投资者正在将他们的净资产的另外5%分配给比特币。\n额外5%的净资产分配给比特币。投资者开始将\n和他们分配给黄金的资金数量一样。\n\n黄金的市值从10吨上升到25吨是一个必然的过程。",
      "title": "我曾经认为每个比特币100万美元是一个幻想，现在看来是非常符合逻辑的，几乎是保守的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "許多以前有5%的淨資產在黃金上的投資者正在將他們的淨資產的另外5%分配給比特幣。\n額外5%的淨資產分配給比特幣。投資者開始將\n和他們分配給黃金的資金數量一樣。\n\n黃金的市值從10噸上升到25噸是一個必然的過程。",
      "title": "我曾經認爲每個比特幣100萬美元是一個幻想，現在看來是非常符合邏輯的，幾乎是保守的。"
    }
  ]
}