{
  "author": "j_isaac120",
  "original_created_utc": 1624650193,
  "title": "I'm so proud of my country El Salvador",
  "created_utc": 1624692635,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I moved from El Salvador to the U.S when I was 14 years old (I&#39;m 23 now), looking for better future. I look back and I wanna cry so bad for all the good that is coming to El Salvador. My country, my people have suffered enough with all the corrupt government, gangs, and violence. Now that we have an amazing President Nayib Bukele and the good news about bitcoin we can finally see a good future for El Salvador, if you guys can only imagine how happy I&#39;m. I own a little bit of bitcoin, and hopefully I can go visit to El Salvador in December to see my family and spend a little bit of bitcoin there. :&#39;)</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/Bitcoin/comments/o7uyjd/im_so_proud_of_my_country_el_salvador/",
  "subreddit": "Bitcoin",
  "id": "o7uyjd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I moved from El Salvador to the U.S when I was 14 years old (I'm 23 now),\nlooking for better future. I look back and I wanna cry so bad for all the good\nthat is coming to El Salvador. My country, my people have suffered enough with\nall the corrupt government, gangs, and violence. Now that we have an…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、14歳のときにエルサルバドルからアメリカに移住しました（現在23歳）。\nより良い未来を求めて。振り返ってみると、エルサルバドルにもたらされているすべての良いことに対して、とても泣きたくなります。\n振り返ってみると、エルサルバドルにもたらされる良いことのために、とても泣きたくなります。私の国は、私の国民は、腐敗した社会に十分苦しんできました。\n腐敗した政府、ギャング、暴力に苦しんできました。今、私たちは...",
      "title": "自分の国エルサルバドルをとても誇りに思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在14岁时从萨尔瓦多搬到美国（现在23岁）。\n寻找更好的未来。我回顾过去，我很想为萨尔瓦多的所有好处哭泣。\n带来的好处。我的国家，我的人民已经遭受了足够的痛苦\n腐败的政府、帮派和暴力已经让我受够了。现在，我们有了一个...",
      "title": "我为我的国家萨尔瓦多感到非常自豪"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在14歲時從薩爾瓦多搬到美國（現在23歲）。\n尋找更好的未來。我回顧過去，我很想爲薩爾瓦多的所有好處哭泣。\n帶來的好處。我的國家，我的人民已經遭受了足夠的痛苦\n腐敗的政府、幫派和暴力已經讓我受夠了。現在，我們有了一個...",
      "title": "我爲我的國家薩爾瓦多感到非常自豪"
    }
  ]
}