{
  "author": "reqgul889",
  "original_created_utc": 1625049055,
  "title": "Google has lifted its ban on crypto advertisements.",
  "created_utc": 1625067041,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Google recently updated their policies regarding Google Ads and will now allow ads related to cryptocurrency exchanges and wallets provided they have registered with FinCEN. This change is set to take effect in August 2021. As you may recall, the ban was imposed in March 2018 and lasted almost three years. </p>\n\n<p>This easing of crypto advertising restrictions is a positive sign. Google appears to be warming up to bitcoin and cryptocurrency in general as many governments, financial institutions and private companies are increasingly liberalizing their crypto policies these days. What do you think?</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/Bitcoin/comments/oauil4/google_has_lifted_its_ban_on_crypto_advertisements/",
  "subreddit": "Bitcoin",
  "id": "oauil4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Google recently updated their policies regarding Google Ads and will now allow\nads related to cryptocurrency exchanges and wallets provided they have\nregistered with FinCEN. This change is set to take effect in August 2021. As you\nmay recall, the ban was imposed in March 2018 and lasted almost three…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Googleは最近、Google広告に関するポリシーを更新し、今後は\n暗号通貨の取引所やウォレットに関連する広告を許可することになりました。\nFinCENに登録していることを条件に、暗号通貨取引所やウォレットに関連する広告を許可することにした。この変更は2021年8月に発効する予定です。ご存知の通り\n思い出すかもしれませんが、2018年3月に禁止令が出され、約3...",
      "title": "Googleは、暗号広告の禁止を解除しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "谷歌最近更新了他们关于谷歌广告的政策，现在将允许\n与加密货币交易所和钱包有关的广告，只要他们在金融犯罪执法局注册。\n在FinCEN注册。这一变化将在2021年8月生效。正如你\n你可能还记得，该禁令是在2018年3月实施的，并持续了近三年。",
      "title": "谷歌已经解除了对加密货币广告的禁令。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "谷歌最近更新了他們關於谷歌廣告的政策，現在將允許\n與加密貨幣交易所和錢包有關的廣告，只要他們在金融犯罪執法局註冊。\n在FinCEN註冊。這一變化將在2021年8月生效。正如你\n你可能還記得，該禁令是在2018年3月實施的，並持續了近三年。",
      "title": "谷歌已經解除了對加密貨幣廣告的禁令。"
    }
  ]
}