{
  "author": "Kylorin94",
  "original_created_utc": 1632209514,
  "title": "Is calling the first World War that and not \"The Great War\" obfuscating the historical records?",
  "created_utc": 1632234659,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am currently listening and reading a lot about the 1900 time range and the prelude to the Great War. Thinking about it without having the second on in the back of my mind opened me to a more broad acknowledgement of its effects for the Balkans, Russia, Austria, Germany, even the US. </p>\n\n<p>From my school days, getting them presented as WW1 and then WW2 coupled them in a way that had me not understand the profound differences between the two wars. </p>\n\n<p>Especially as a German, this is interesting due to WW2 being as black and white as it is portrayed but WW1 really being an all around catastrophe with basically no &quot;good guys&quot; and a very 9/11 like start. </p>\n\n<p>So my question is - would framing WW1 as &quot;The Great War&quot; allow for a more unique understanding of it, more decoupled from WW2?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/psdxrm/is_calling_the_first_world_war_that_and_not_the/",
  "subreddit": "AskHistorians",
  "id": "psdxrm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am currently listening and reading a lot about the 1900 time range and the\nprelude to the Great War. Thinking about it without having the second on in the\nback of my mind opened me to a more broad acknowledgement of its effects for the\nBalkans, Russia, Austria, Germany, even the US.\n\nFrom my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は今、1900年という時代と、その前段階である第一次世界大戦について、いろいろと聞いたり読んだりしています。\n第一次世界大戦の前哨戦です。第二次世界大戦のことが頭の片隅にない状態で考えてみると\nバルカン半島、ロシア、オーストリア、ドイツ、さらにはアメリカにまで影響を与えたことを、より広く認識することができました。\nバルカン半島、ロシア、オーストリア、ドイツ、さらにはアメリカにまで影響を与えたことがわかりました。\n\n私からは...",
      "title": "第一次世界大戦を \"The Great War \"ではなく、そう呼ぶことは、歴史的記録を難読化することになるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我目前正在听和读很多关于1900年的时间范围和\n大战的前奏。思考这个问题时，我的脑海中没有出现第二种情况。\n我的脑海中打开了一个更广泛的认识，即它对巴尔干半岛、俄罗斯、奥地利、德国甚至美国的影响。\n巴尔干半岛、俄罗斯、奥地利、德国，甚至美国的影响。\n\n从我的角度来看，我认为这是很重要的。",
      "title": "这样称呼第一次世界大战而不是 \"伟大的战争 \"是在混淆历史记录吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我目前正在聽和讀很多關於1900年的時間範圍和\n大戰的前奏。思考這個問題時，我的腦海中沒有出現第二種情況。\n我的腦海中打開了一個更廣泛的認識，即它對巴爾幹半島、俄羅斯、奧地利、德國甚至美國的影響。\n巴爾幹半島、俄羅斯、奧地利、德國，甚至美國的影響。\n\n從我的角度來看，我認爲這是很重要的。",
      "title": "這樣稱呼第一次世界大戰而不是 \"偉大的戰爭 \"是在混淆歷史記錄嗎？"
    }
  ]
}