{
  "author": "RefugeeDutch_Syrian",
  "original_created_utc": 1639081625,
  "title": "What is the perfect gift for a crypto enthusiast?",
  "created_utc": 1639099979,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As holidays are approaching, I was thinking, what could I get to a dear person in my life, who also happens to be a crypto enthusiast? &lt;/p&gt;\n\n&lt;p&gt;I found it to be a tough question. I couldn&amp;#39;t come up with anything beside buying the dip for them lol. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;What do you guys think? What would you like to be gifted? I&amp;#39;m assuming most people that are taking this seriously will already have a hardware wallet and all the nice stuff, and I couldn&amp;#39;t find any gift cards from any Centralized exchanges. So I&amp;#39;m actually clueless.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 218,
  "permalink": "/r/CryptoCurrency/comments/rcqfm1/what_is_the_perfect_gift_for_a_crypto_enthusiast/",
  "subreddit": "CryptoCurrency",
  "id": "rcqfm1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As holidays are approaching, I was thinking, what could I get to a dear person\nin my life, who also happens to be a crypto enthusiast?\n\nI found it to be a tough question. I couldn't come up with anything beside\nbuying the dip for them lol.\n\n\n\nWhat do you guys think? What would you like to be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "クリスマスが近づいてきたので、大切な人に何をプレゼントしようかと考えていました。\n私の人生の中で、暗号の愛好家でもあるのでしょうか？\n\nこれは難しい問題だと思いました。私は何も思いつかなかったのですが\nディップを買ってあげてください(笑)。\n\n\n\n皆さんはどう思われますか？どうなりたいか・・・。",
      "title": "暗号好きな人にぴったりのプレゼントは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "随着假期的临近，我在想，我可以送什么给我生命中一个亲爱的人呢？\n我生命中的一个亲爱的人，他恰好也是一个加密货币的爱好者？\n\n我发现这是个难题。我想不出任何东西来，除了\n给他们买点东西，笑。\n\n\n\n你们觉得呢？你想成为什么...",
      "title": "什么是送给加密货币爱好者的完美礼物？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着假期的臨近，我在想，我可以送什麼給我生命中一個親愛的人呢？\n我生命中的一個親愛的人，他恰好也是一個加密貨幣的愛好者？\n\n我發現這是個難題。我想不出任何東西來，除了\n給他們買點東西，笑。\n\n\n\n你們覺得呢？你想成爲什麼...",
      "title": "什麼是送給加密貨幣愛好者的完美禮物？"
    }
  ]
}