{
  "author": "Jettae7",
  "the_new_excerpt": "And they produced exactly 0 lbs of Uranium Last Year..... Control yourselfs\nfolks.\n\nWhy am In UUUU. Simply I feel it is the best way for me to play the Green Energy\nand Rare Earth Boom that is coming.\n\nNuclear is currently our only Carbon Free Fuel Source for Baseload Energy. It\ndoesn't compete with…",
  "original_created_utc": 1616553432,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "而他们去年生产的铀正好是0磅.....。控制自己\n乡亲们。\n\n为什么我在UUUU。很简单，我觉得这是最好的方式，我玩的绿色能源。\n和稀土热潮，即将到来。\n\n核能是目前我国唯一的无碳燃料源，用于基荷能源。它\n不敌",
      "title": "UUUU是美国铀矿业的旗舰股。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "而他們去年生產的鈾正好是0磅.....。控制自己\n鄉親們。\n\n爲什麼我在UUUU。很簡單，我覺得這是最好的方式，我玩的綠色能源。\n和稀土熱潮，即將到來。\n\n核能是目前我國唯一的無碳燃料源，用於基荷能源。它\n不敵",
      "title": "UUUU是美國鈾礦業的旗艦股。"
    }
  ],
  "title": "UUUU is the flagship US Uranium Mining Stock",
  "created_utc": 1616612318,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>And they produced exactly 0 lbs of Uranium Last Year..... Control yourselfs folks.</p>\n\n<p>Why am In UUUU. Simply I feel it is the best way for me to play the Green Energy and Rare Earth Boom that is coming. </p>\n\n<p>Nuclear is currently our only Carbon Free Fuel Source for Baseload Energy. It doesn&#39;t compete with wind and solar. It competes with Coal and Natural Gas to provide the power we need when the wind isn&#39;t blowing or the moon is in the sky.</p>\n\n<p>The Uranium Market is highly cylical and it has been beaten down for a long time. History shows that when it pops it goes big. The stock is relatively cheap and the upside potential is exponential.</p>\n\n<p>The company has recently branched into the rare earth&#39;s market as well. I have been looking gain exposure to this market and they are the best US Play I&#39;ve found.</p>\n\n<p>The stock has pulled back from 7.80 to 5.98 in the last week. Check it out if you are interested in this market segments. Not advice just an idiot with an opinion.</p>\n</div><!-- SC_ON -->",
  "score": 41,
  "permalink": "/r/stocks/comments/mbvi2j/uuuu_is_the_flagship_us_uranium_mining_stock/",
  "subreddit": "stocks",
  "id": "mbvi2j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752822099
}