{
  "author": "FrostyxShrimp",
  "the_new_excerpt": "2020 had me lose my job, be unemployed for 6 months, and start a new job in an\nindustry I know nothing about. Needless to say my savings were completely\ndrained. I had to get rid of my dream car for something more affordable. Also\naccrued quite a bit of credit card debt as well as a few personal…",
  "original_created_utc": 1613615351,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "2020年让我失去了工作，失业了6个月，然后在一家公司开始了新的工作。\n我对这个行业一无所知。不用说，我的积蓄完全\n枯竭。我不得不把我的梦想之车扔掉，换取更实惠的东西。还有\n累积了不少信用卡债务以及一些个人... ...",
      "title": "今天用加密货币还清了我2020年的所有债务"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2020年讓我失去了工作，失業了6個月，然後在一家公司開始了新的工作。\n我對這個行業一無所知。不用說，我的積蓄完全\n枯竭。我不得不把我的夢想之車扔掉，換取更實惠的東西。還有\n累積了不少信用卡債務以及一些個人... ...",
      "title": "今天用加密貨幣還清了我2020年的所有債務"
    }
  ],
  "title": "Paid off all of my 2020 debt today with crypto",
  "created_utc": 1613626896,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>2020 had me lose my job, be unemployed for 6 months, and start a new job in an industry I know nothing about. Needless to say my savings were completely drained. I had to get rid of my dream car for something more affordable. Also accrued quite a bit of credit card debt as well as a few personal loans during the pandemic. With the start of the new job it was daunting thinking of how to pay these down. So, I got involved with crypto trading again end of December with a very small investment into Lumens at .11 a coin. Made it a point to invest whatever I could comfortably invest every paycheck. Bought more Lumens, bought whatever bits of BTC I could, bought some doge (before Elon tweeted, glad he did), and then some VET and VTHO. Also started using my PC to mine small amounts of ETH while I was at work. This last month or so has been incredible. Seeing the small bits I put in grow to what they have has allowed me to breathe a sigh of relief. I started collecting my profits and just got the final payment confirmation for the last unpaid credit card. All of 2020 debts, gone in 2 months. Thanks to crypto and its communities. I know that crypto is way larger than the dollar amounts they trade for, and I truly believe that blockchain is the future. Crypto hasn’t made me a millionaire, but I sure do feel like a million bucks.</p>\n</div><!-- SC_ON -->",
  "score": 1588,
  "permalink": "/r/CryptoCurrency/comments/lmbgua/paid_off_all_of_my_2020_debt_today_with_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "lmbgua",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728620227
}