{
  "author": "fan_of_hakiksexydays",
  "original_created_utc": 1651692174,
  "title": "Fed meeting: raising rates by the expected half percent. JPOW feeling more optimistic with economic numbers. Stock are going up. What this all means for markets and crypto...",
  "created_utc": 1651707322,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Bullish news overall, at least short term.&lt;/p&gt;\n\n&lt;h1&gt;Background: how high are those Fed rates eventually gonna go and how big is the effect?&lt;/h1&gt;\n\n&lt;p&gt;It&amp;#39;s important to keep things in perspective.&lt;/p&gt;\n\n&lt;p&gt;Lowering or increasing rates, doesn&amp;#39;t necessarily mean we&amp;#39;ll have very high or very low rates.&lt;/p&gt;\n\n&lt;p&gt;In fact, Fed rates are only going up from a near 0 floor. We&amp;#39;re not jumping from high rates to higher rates.&lt;/p&gt;\n\n&lt;p&gt;The long term plan by the Fed is to target around 2 -2.5%.&lt;/p&gt;\n\n&lt;p&gt;This is far from being high rates. These are still low rates designed more to stimulate an economy. With cost of borrowing still not very expensive.&lt;/p&gt;\n\n&lt;p&gt;In fact, 2% is simply going back to 2020 rates and the pre-covid normal.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;The key points of the JPOW&amp;#39;s meeting:&lt;/h1&gt;\n\n&lt;p&gt;-0.5 fed hikes as expected, following the roadmap to 2%.&lt;/p&gt;\n\n&lt;p&gt;-75 basis points moved off the table. This lowers a lot of uncertainty.&lt;/p&gt;\n\n&lt;p&gt;-Unemployment at one of the lowest in 50 years.&lt;/p&gt;\n\n&lt;p&gt;-Wages moving up.&lt;/p&gt;\n\n&lt;p&gt;-According to JPOW, inflation has likely peaked, and expects it to go down.&lt;/p&gt;\n\n&lt;p&gt;-The economy is &amp;quot;not vulnerable to a recession&amp;quot; and &amp;quot;the economy is doing fairly well&amp;quot; according to JPOW.&lt;/p&gt;\n\n&lt;p&gt;-JPOW&amp;#39;s tone has changed since the last meeting. From a somber dovish tone, to a more hawkish and optimistic tone.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;What does it mean for Bitcoin and ultimately crypto?&lt;/h1&gt;\n\n&lt;p&gt;The US has the biggest share of the Bitcoin market, so while this may seem very US-centric, what happens in the US could affect the crypto market.&lt;/p&gt;\n\n&lt;p&gt;Probably not as much as most people would expect.&lt;/p&gt;\n\n&lt;p&gt;While the correlation between Bitcoin and US stocks has increased since Covid, it has only increased from nearly 0 and weak correlation, to only a moderate and inconsistent correlation.&lt;/p&gt;\n\n&lt;p&gt;The correlation works more strongly, when the crypto market is already more vulnerable to move in that direction.&lt;/p&gt;\n\n&lt;p&gt;Right now, crypto has been testing lows, and may have been forming a bottom.&lt;/p&gt;\n\n&lt;p&gt;If stocks do well and go up, it could help boost crypto in going in the path of least resistance, which right now is up.&lt;/p&gt;\n\n&lt;p&gt;There is one important effect that should still affect the crypto market: liquidity.&lt;/p&gt;\n\n&lt;p&gt;Even if whales trading bots don&amp;#39;t care about the cost of a car loan increasing, they do care about liquidity coming into the market.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;Additional data about the current state of the US economy:&lt;/h1&gt;\n\n&lt;p&gt;US real GDP growth has decreased at a rate of about 1.4% this quarter.&lt;/p&gt;\n\n&lt;p&gt;Unemployment is down to 3.8%.&lt;/p&gt;\n\n&lt;p&gt;Consumer expenditure has increased 2.7% despite inflation.&lt;/p&gt;\n\n&lt;p&gt;Residential investment has gone up 2%.&lt;/p&gt;\n\n&lt;p&gt;The trade gap has increased to $110 Billion.&lt;/p&gt;\n\n&lt;p&gt;Covid cases have been steadily rising this year to about 30K per day for the US. They are still much lower than last summer, and compared to the major part of 2021.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;Conclusion:&lt;/h1&gt;\n\n&lt;p&gt;The policy remains the same: kicking the can down the road.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t bet the farm on a great depression just yet. It&amp;#39;s possible, but... realize that it&amp;#39;s not the only scenario at play. We are still at a tipping point where it could go either way.&lt;/p&gt;\n\n&lt;p&gt;We are still in a potential scenario where this was just a correction. Likely more due to the extra liquidity turned off, and liquidity getting more back to normal, and the market having to re-adjust to reality with no more extra money printed.&lt;/p&gt;\n\n&lt;p&gt;So it&amp;#39;s not completely out of the question that the stock market could eventually resume its run, as businesses re-open, supply chains unclog, economic growth picks up again, inflation stabilizes, and maybe even the war in Ukraine ends or becomes less uncertain.&lt;/p&gt;\n\n&lt;p&gt;If markets pick up again, that will be very good for bringing back liquidity into crypto, along with confidence. &lt;/p&gt;\n\n&lt;p&gt;For now, the more short term result of this meeting on crypto, the odds favoring going for the path of least resistance to test $40K again.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 307,
  "permalink": "/r/CryptoCurrency/comments/uiech3/fed_meeting_raising_rates_by_the_expected_half/",
  "subreddit": "CryptoCurrency",
  "id": "uiech3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Bullish news overall, at least short term.\n\n\nBACKGROUND: HOW HIGH ARE THOSE FED RATES EVENTUALLY GONNA GO AND HOW BIG IS THE\nEFFECT?\n\nIt's important to keep things in perspective.\n\nLowering or increasing rates, doesn't necessarily mean we'll have very high or\nvery low rates.\n\nIn fact, Fed rates are…"
}