{
  "author": "bladecg",
  "original_created_utc": 1646797649,
  "title": "50 Lessons I learned trading crypto for the past 5 years",
  "created_utc": 1646815168,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;1 - Everyone’s a genius in a bull market. Real traders can survive and even thrive in bear markets or highly volatile markets.&lt;/p&gt;\n\n&lt;p&gt;2 - Don’t be a blind bull. ALL markets are cyclical. Don’t be afraid of pullbacks or market crashes – that’s where you can make the most money.&lt;/p&gt;\n\n&lt;p&gt;3 - There’s a big difference between a trade and an investment.&lt;/p&gt;\n\n&lt;p&gt;4 - Fully plan your trade before you pull the trigger on the entry.&lt;/p&gt;\n\n&lt;p&gt;5 - Entries are important, but risk &amp;amp; money management is where you make or lose money.&lt;/p&gt;\n\n&lt;p&gt;6 - Beware of get-rich-quick gurus hopping on the crypto bandwagon over the past year.&lt;/p&gt;\n\n&lt;p&gt;7 - Decide which types of trade setups or investments you’ll take and ignore everything else.&lt;/p&gt;\n\n&lt;p&gt;8 - Don’t assume just because you’ve made a lot of money in crypto that you can just as easily make money in other financial markets. 95%+ of stock market traders LOSE money. The game is rigged. Stick to what you know works for you.&lt;/p&gt;\n\n&lt;p&gt;9 - The best way to day trade cryptocurrencies is – DON’T!&lt;/p&gt;\n\n&lt;p&gt;10 - The best way to profit in any market is to find something you think has big potential early (before the general public catches on), and invest assuming you’re going to lose 100% of your capital. It’s the “angel investor” approach.&lt;/p&gt;\n\n&lt;p&gt;11 - You can’t control the market. The only thing you can control is your entries, trade size, and exits.&lt;/p&gt;\n\n&lt;p&gt;12 - One market participant can completely destroy “good technical analysis”.&lt;/p&gt;\n\n&lt;p&gt;13 - Don’t blindly follow trade alerts from ANYONE, especially random people on social media or chat rooms.&lt;/p&gt;\n\n&lt;p&gt;14 - All financial networking marketing projects are ponzi schemes, period.&lt;/p&gt;\n\n&lt;p&gt;15 - If you make a life-changing amount of money, do NOTHING for at least 30 days.&lt;/p&gt;\n\n&lt;p&gt;16 - Trading isn’t about picking exact tops and bottoms in a market – it’s about catching the meat of a move.&lt;/p&gt;\n\n&lt;p&gt;17 - Don’t turn a small losing trade into a massive losing investment.&lt;/p&gt;\n\n&lt;p&gt;18 - Don’t set daily profit target goals – set long-term performance goals.&lt;/p&gt;\n\n&lt;p&gt;19 - Learn to survive, then thrive.&lt;/p&gt;\n\n&lt;p&gt;20 - The best charting indicators are price action and volume. You can use others, but it won’t necessarily make you a more profitable trader.&lt;/p&gt;\n\n&lt;p&gt;21 - Trends can go way past what seems rational.&lt;/p&gt;\n\n&lt;p&gt;22 - Don’t try to pick tops in a market. Wait for the market to tell you when the trend is over.&lt;/p&gt;\n\n&lt;p&gt;23 - Don’t trade in front of big news events – it’s impossible to predict how markets will react.&lt;/p&gt;\n\n&lt;p&gt;24 - The biggest challenge for most traders is their ego, or the need to be right.&lt;/p&gt;\n\n&lt;p&gt;25 - You can lose 50% of your trades and still be profitable if you manage risk properly.&lt;/p&gt;\n\n&lt;p&gt;26 - The best entrepreneurs and CEO’s typically make the worst traders and investors.&lt;/p&gt;\n\n&lt;p&gt;27 - People with the best mindset for investing typically have a career in high-risk situations like firefighters, pilots, police.&lt;/p&gt;\n\n&lt;p&gt;28 - Avoid pump and dump groups like the plague they are.&lt;/p&gt;\n\n&lt;p&gt;29 - You WILL make every mistake in the book. Don’t beat yourself up when you make mistakes, just learn and try not to make the same mistake twice.&lt;/p&gt;\n\n&lt;p&gt;30 - Don’t treat crypto exchanges like bank accounts. You don’t own the coins unless you control the private keys.&lt;/p&gt;\n\n&lt;p&gt;31 - Crypto is a 24/7/365 market. You can’t catch every trade. If you miss one, don’t worry – there’s ALWAYS another trade.&lt;/p&gt;\n\n&lt;p&gt;32 - Don’t invest in a coin unless you understand it inside out.&lt;/p&gt;\n\n&lt;p&gt;33 - You can make money trading the momentum and hype in shitcoins, just don’t invest long-term.&lt;/p&gt;\n\n&lt;p&gt;34 - Stay away from coins with low trading volume and low market caps. They are easily manipulated and you can get stuck in a position.&lt;/p&gt;\n\n&lt;p&gt;35 - Don’t trade with money you need for living expenses. It’s called “risk capital” for a reason.&lt;/p&gt;\n\n&lt;p&gt;36 - Think of yourself as a hunter – save your ammo for the big game.&lt;/p&gt;\n\n&lt;p&gt;37 - Crypocurrency exchanges go down when there’s high volatility. If price hits a major target or buy zone, it might make sense to place some orders BEFORE everyone else.&lt;/p&gt;\n\n&lt;p&gt;38 - Trading and investing brings all your emotions to the forefront – fear, greed, hesitation.&lt;/p&gt;\n\n&lt;p&gt;39 - The hardest thing to do in trading is… NOTHING. This can also be the most profitable thing to do.&lt;/p&gt;\n\n&lt;p&gt;40 - Just because a market is in a “bubble” doesn’t mean it’s going to die. Bitcoin has been through over half a dozen big bubbles and increased in price after each one.&lt;/p&gt;\n\n&lt;p&gt;41 - Manage your trades in a way that would leave you with no regrets no matter what the market does.&lt;/p&gt;\n\n&lt;p&gt;42 - Learn to think like a contrarian. If you’re someone who needs to have your opinion validated by everyone around you, then trading and investing isn’t for you.&lt;/p&gt;\n\n&lt;p&gt;43 - The shorter the chart time frame, the less reliable the chart patterns are. The longer the time frame, the more variables affect price action and the harder it becomes to predict price. My sweet spot in the daily chart for trade setups and 60-minute chart for entries.&lt;/p&gt;\n\n&lt;p&gt;44 - Some market conditions are great for pushing the gas on every trade setup you can find, where other market conditions call for you to slam on the brakes and step away from the markets altogether.&lt;/p&gt;\n\n&lt;p&gt;45 - 90%+ of cryptocurrencies will eventually go to zero. Invest accordingly.&lt;/p&gt;\n\n&lt;p&gt;46 - The mental side of trading is the hardest to master, the most under-appreciated skill, and will cause you to make or lose the biggest amounts of money.&lt;/p&gt;\n\n&lt;p&gt;47 - The 3 biggest problems for traders are over-trading, hesitating on entries, and closing positions prior to profit targets when the trade is still intact.&lt;/p&gt;\n\n&lt;p&gt;48 - You can make a career’s worth of profit in one year or one trade – don’t feel like every day has to be a home run. Play the long game. Be patient and wait for the best plays.&lt;/p&gt;\n\n&lt;p&gt;49 - Don’t trust anyone else to trade for you. Manage your own high-risk investments (like crypto trading) or don’t participate at all.&lt;/p&gt;\n\n&lt;p&gt;50 - Take the news for what it is – they’re trying to get views and clicks. They’re NOT looking out for your best interests or trying to help you make money.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 431,
  "permalink": "/r/CryptoCurrency/comments/t9yujw/50_lessons_i_learned_trading_crypto_for_the_past/",
  "subreddit": "CryptoCurrency",
  "id": "t9yujw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "1 - Everyone’s a genius in a bull market. Real traders can survive and even\nthrive in bear markets or highly volatile markets.\n\n2 - Don’t be a blind bull. ALL markets are cyclical. Don’t be afraid of\npullbacks or market crashes – that’s where you can make the most money.\n\n3 - There’s a big…"
}