{
  "author": "Appropriate_Win_7829",
  "original_created_utc": 1646326296,
  "title": "If you actually make some money in crypto, are you actually going to tell anyone?",
  "created_utc": 1646412265,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know I’m engaging in hopium at this point, but sometimes it’s nice to indulge in a little fantasy. &lt;/p&gt;\n\n&lt;p&gt;Say your investments do pay off a few years down the line, and you find yourself reaping a large amount cash, will you actually say where it came from? &lt;/p&gt;\n\n&lt;p&gt;I’ll tell my SO but that’s about it, hopefully pay off the mortgage which will get me out of the dog house for not telling her I was investing my disposable in crypto.  Maybe the one friend I trust enough as well. &lt;/p&gt;\n\n&lt;p&gt;Or maybe I’ll just say nothing.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 304,
  "permalink": "/r/CryptoCurrency/comments/t5vxdw/if_you_actually_make_some_money_in_crypto_are_you/",
  "subreddit": "CryptoCurrency",
  "id": "t5vxdw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I know I’m engaging in hopium at this point, but sometimes it’s nice to indulge\nin a little fantasy.\n\nSay your investments do pay off a few years down the line, and you find yourself\nreaping a large amount cash, will you actually say where it came from?\n\nI’ll tell my SO but that’s about it,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この時点では、私はホピウムに従事していることは分かっていますが、時にはそれを満喫するのもいいものです。\nという、ちょっとしたファンタジー。\n\n数年後に投資が実を結び、気がついたら、その数年後に\n多額の現金が手に入ったら、その出どころをちゃんと言えますか？\n\n私はSOに言いますが、それくらいしか......。",
      "title": "実際に暗号でお金を稼いだら、誰かに話すんですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道在这一点上，我正在从事希望，但有时放纵一下\n在一个小小的幻想中。\n\n如果你的投资在几年后确实得到了回报，而你发现自己\n收获了一大笔现金，你真的会说它是从哪里来的吗？\n\n我会告诉我的妻子，但仅此而已，...",
      "title": "如果你真的在加密货币中赚了一些钱，你真的会告诉别人吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道在這一點上，我正在從事希望，但有時放縱一下\n在一個小小的幻想中。\n\n如果你的投資在幾年後確實得到了回報，而你發現自己\n收穫了一大筆現金，你真的會說它是從哪裏來的嗎？\n\n我會告訴我的妻子，但僅此而已，...",
      "title": "如果你真的在加密貨幣中賺了一些錢，你真的會告訴別人嗎？"
    }
  ]
}