{
  "author": "EthanGibson2",
  "original_created_utc": 1631968265,
  "title": "If every Crypto went to $0, how would it effect you",
  "created_utc": 1631983027,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You wake up. It’s a new month. October 1st, you go for a shower, wash etc and then look at your phone while sitting on your bed blindlessly staring at your portfolio. Down 100%. Every Cryptocurrency has went bust, for an unknown reason to your knowledge. What goes through your mind?</p>\n\n<p>What is your first reaction?\nHow will you be financially?\nWill the wife disown you?</p>\n\n<p>We all say “invest what you can afford to lose” but has everyone actually done so? Did you DCA too much of your wage?</p>\n\n<p>Yes, yes we all know this is literally impossible to happen. Or is it?</p>\n</div><!-- SC_ON -->",
  "score": 180,
  "permalink": "/r/CryptoCurrency/comments/pqlkf6/if_every_crypto_went_to_0_how_would_it_effect_you/",
  "subreddit": "CryptoCurrency",
  "id": "pqlkf6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "You wake up. It’s a new month. October 1st, you go for a shower, wash etc and\nthen look at your phone while sitting on your bed blindlessly staring at your\nportfolio. Down 100%. Every Cryptocurrency has went bust, for an unknown reason\nto your knowledge. What goes through your mind?\n\nWhat is your…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "目を覚ますと 新しい月になった。10月1日、あなたはシャワーを浴びて、体を洗い、そして\nベッドに座って無心でポートフォリオを見ながら、携帯電話を見る。\nポートフォリオを見る。100％ダウン。すべての暗号通貨が、未知の理由で破綻しました。\nあなたの知る限りでは。何を考えているのでしょうか？\n\nあなたは何を...",
      "title": "すべての暗号が0ドルになったら、どのような影響がありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你醒来的时候。这是一个新的月份。10月1日，你去洗澡，洗漱等，然后看着你的脸。\n然后看了看你的手机，同时坐在床上盲目地盯着你的\n投资组合。跌了100%。所有的加密货币都破产了，原因不明\n就你所知。你脑子里想的是什么？\n\n你有什么...",
      "title": "如果每个加密货币都变成了0美元，对你有什么影响？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你醒來的時候。這是一個新的月份。10月1日，你去洗澡，洗漱等，然後看着你的臉。\n然後看了看你的手機，同時坐在牀上盲目地盯着你的\n投資組合。跌了100%。所有的加密貨幣都破產了，原因不明\n就你所知。你腦子裏想的是什麼？\n\n你有什麼...",
      "title": "如果每個加密貨幣都變成了0美元，對你有什麼影響？"
    }
  ]
}