{
  "author": "audyaudvi",
  "original_created_utc": 1628697123,
  "title": "Why the FUCK are we still catering to billionaires and the \"elite\" class when we're on the cusp of a scorched earth and total societal collapse? The Titanic is sinking and we're serving cucumber sandwiches and playing Vivaldi to 1st class in front of the lifeboats we don't get to use, WHY is this OK",
  "created_utc": 1628703381,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Seriously, what? Why? Why are we enabling the people who are fucking up the planet we all have to live on? Why do we serve them their meals and drive their cars and clean their laundry? I have a fantasy where every POS rich person who got what they got through human suffering and exploitation is just...ignored. </p>\n\n<p>Seriousky, try it. Pick your least favorite corrupt politician or out-of-touch space-fucking billionaire and play a scene in your mind where they wake up and no one acknowledges them.</p>\n\n<p>Imagine their pissy little hissy fits when they demand their breakfast or clothes for the day or whatever only to be met by total silence and an indifferent, formerly-loyal workforce. Imagine their pathetic little scrunched up face getting redder and redder when they realize that they&#39;ve lost it, it&#39;s gone...they can&#39;t coerce or bribe or threaten people to do their bidding anymore. They have to fucking cooperate if they want to live.</p>\n\n<p>I know there will ALWAYS be indoctrinated dipshits who froam at the mouth in a frenzy to serve the predator class, but WHY? Why, after all the mounting evidence that billionaires and the &quot;elite&quot; are essentially parasites who make the world objectively worse through the working conditions they create and the environmental abuses they perpetuate, why do we KEEP WORKING TO MAKE THEIR LIVES COMFORTABLE WHILE THEY LAY THE FOUNDATION FOR OUR DEATHS?</p>\n\n<p>The ultra-rich are acting like the global climate catastrophe doesn&#39;t matter because to them it doesn&#39;t, their money will insulate them no matter how bad things get. Well, I fucking wish we could change that. Oh no, Jess Bezo&#39;s hydroponic farm in his secret New Zealand apocalypse island needs someone to maintain it? Get fucked Jeff, no self-sustaining food source unless you put the work in and do it yourself or else learn how to cooperate with the rest of humanity. </p>\n\n<p>Seriously, can we all just keep doing what we&#39;re doing and start working towards a healthier planet and society, while actively ignoring ultra-rich parasites in the process? We don&#39;t need a guillotine, all we need to do us stop serving these fucks until they realize what the &quot;we&#39;re in this together&quot; message their companies and governments propagate really means.</p>\n\n<p>Whats the answer here? Why are we apparently more than okay to keep cleaning up after the shits who keep wrecking things for the rest of us? </p>\n\n<p>Oh and if you&#39;re here to defend billionaires because &quot;they help people by creating jobs&quot; or whatever fucking excuse you use to stand up for the people who would exploit you to death in a heartbeat, we are WELL past this argument. The ocean&#39;s on fire,  everything is dying, and the super-rich are still holding the match and gasoline; you piping in to say that maybe they have a good reason for doing what they&#39;re doing and we should let them play out their destruction is fucking stupid, delusional, and pathetic</p>\n</div><!-- SC_ON -->",
  "score": 232,
  "permalink": "/r/TooAfraidToAsk/comments/p2fsvo/why_the_fuck_are_we_still_catering_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "p2fsvo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Seriously, what? Why? Why are we enabling the people who are fucking up the\nplanet we all have to live on? Why do we serve them their meals and drive their\ncars and clean their laundry? I have a fantasy where every POS rich person who\ngot what they got through human suffering and exploitation is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "真面目な話、何？なぜ？なぜ私たちは、私たちが生きていかなければならない地球を破壊している人々を支援しているのでしょうか？\n私たちが生きていかなければならない地球を台無しにしている人たちを なぜ私たちは彼らに食事を提供し、彼らの車を運転するのでしょうか？\n車を運転したり、洗濯物を洗ったりするのか？私は幻想を抱いています。\n人間の苦しみと搾取によって得たものを手に入れたすべての金持ちが...",
      "title": "焦土と化し、社会が完全に崩壊しようとしているときに、なぜ私たちはまだ億万長者や「エリート」階級に仕えているのでしょうか？タイタニック号は沈みかけているのに、私たちは救命ボートの前で1等車にキュウリのサンドイッチを出したり、ヴィヴァルディを演奏したりしていますが、なぜこれでいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "说真的，什么？为什么？为什么我们要让那些把我们必须生活的星球搞得一团糟的人\n我们都必须生活在这个星球上？为什么我们要为他们提供饭菜，开他们的\n汽车和清洗他们的衣服？我有一个幻想，在这个幻想中，每一个通过人类苦难而得到的POS富人\n通过人类的痛苦和剥削得到的东西都是...",
      "title": "当我们处于焦土和社会全面崩溃的边缘时，为什么我们还在迎合亿万富翁和 \"精英 \"阶层？泰坦尼克号正在沉没，而我们却在我们无法使用的救生艇前为头等舱提供黄瓜三明治和播放维瓦尔第的音乐，这有什么问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說真的，什麼？爲什麼？爲什麼我們要讓那些把我們必鬚生活的星球搞得一團糟的人\n我們都必須生活在這個星球上？爲什麼我們要爲他們提供飯菜，開他們的\n汽車和清洗他們的衣服？我有一個幻想，在這個幻想中，每一個通過人類苦難而得到的POS富人\n通過人類的痛苦和剝削得到的東西都是...",
      "title": "當我們處於焦土和社會全面崩潰的邊緣時，爲什麼我們還在迎合億萬富翁和 \"精英 \"階層？泰坦尼克號正在沉沒，而我們卻在我們無法使用的救生艇前爲頭等艙提供黃瓜三明治和播放維瓦爾第的音樂，這有什麼問題？"
    }
  ]
}