{
  "author": "msquared_ita",
  "the_new_excerpt": "The drug P/E ratio is one of the lowest among any major industry group, so much\nso that pharma stocks haven’t been so inexpensive relative to the S&P 500 in at\nleast 20 years. Many pharmaceutical stocks are trading with a forward PE ratio\nranging from 12 to 7,5. Abbvie has a forward PE of 7,5, Merck…",
  "original_created_utc": 1616414196,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "药品的市盈率在各大行业集团中是最低的，如此一来\n所以，制药股相对于标准普尔500指数来说，并没有那么便宜，在这一点上，制药股的价格是很高的。\n至少20年。许多医药股的交易远期PE值为\n从12到7. 5不等 Abbvie的远期PE为7,5，Merck...",
      "title": "医药股是过去20年来最便宜的。为什么这么说？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "藥品的市盈率在各大行業集團中是最低的，如此一來\n所以，製藥股相對於標準普爾500指數來說，並沒有那麼便宜，在這一點上，製藥股的價格是很高的。\n至少20年。許多醫藥股的交易遠期PE值爲\n從12到7. 5不等 Abbvie的遠期PE爲7,5，Merck...",
      "title": "醫藥股是過去20年來最便宜的。爲什麼這麼說？"
    }
  ],
  "title": "Pharma stocks are as cheap as they've been in the past 20 years. Why?",
  "created_utc": 1616431209,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The drug P/E ratio is one of the lowest among any major industry group, so much so that pharma stocks haven’t been so inexpensive relative to the S&amp;P 500 in at least 20 years. Many pharmaceutical stocks are trading with a forward PE ratio ranging from 12 to 7,5. Abbvie has a forward PE of 7,5, Merck is at 11,5, Bristol Myers Squibb at 8, Novartis as well is trading at 12 forward PE. They all boast a 3-4% dividend yield and EPS growth forecasted between 7-10%. I do not see many downsides in investing in these companies, beside some patents expiration down the line. Despite the great cash flow and valuations this sector seems to be lagging. Why do you think it is so? In such an expensive market to see a company like Merck trade at 11 forward PE seems too good to be true, and I&#39;d like to hear your opinion.</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/stocks/comments/malrnv/pharma_stocks_are_as_cheap_as_theyve_been_in_the/",
  "subreddit": "stocks",
  "id": "malrnv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752821014
}