{
  "author": "ThrowawayAccount_143",
  "original_created_utc": 1630163701,
  "title": "Is it weird to watch exclusively lesbian porn as a straight woman?",
  "created_utc": 1630172642,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I only watch lesbian porn. I have tried straight porn, even &quot;romantic&quot; ones targeted at female audience but I can never enjoy it. I started questioning my sexuality but I&#39;m 100% sure I don&#39;t want to fuck women myself. But I&#39;m sure I&#39;m attracted to men because I feel like kissing my crush. Is there a possible explanation for this?</p>\n</div><!-- SC_ON -->",
  "score": 123,
  "permalink": "/r/NoStupidQuestions/comments/pdblat/is_it_weird_to_watch_exclusively_lesbian_porn_as/",
  "subreddit": "NoStupidQuestions",
  "id": "pdblat",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I only watch lesbian porn. I have tried straight porn, even \"romantic\" ones\ntargeted at female audience but I can never enjoy it. I started questioning my\nsexuality but I'm 100% sure I don't want to fuck women myself. But I'm sure I'm\nattracted to men because I feel like kissing my crush. Is there a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はレズビアンのAVしか見ません。ストレートのポルノも、女性向けの「ロマンティック」なものも試してみましたが\n楽しんだことはありません。自分のセクシュアリティに疑問を持ち始めました。\n自分のセクシュアリティに疑問を持ち始めましたが、自分が女性とセックスしたいとは100％思っていません。でも、男性に惹かれるのは確かです。\nしかし、私は男性に惹かれていると確信しています。なぜなら、片思いの相手とキスしたいと思うからです。このようなことはありませんか？",
      "title": "ストレートの女性がレズビアンだけのAVを見るのは変ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只看女同性恋色情片。我试过直男色情片，甚至是 \"浪漫 \"的\n但我从来没有享受过它。我开始质疑自己的\n但我百分之百确定我自己并不想和女人做爱。但我确定我被男人所吸引，因为我觉得自己喜欢亲吻。\n因为我想亲吻我的暗恋对象。是否有一个...",
      "title": "作为一个直女，只看女同性恋色情片是不是很奇怪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只看女同性戀色情片。我試過直男色情片，甚至是 \"浪漫 \"的\n但我從來沒有享受過它。我開始質疑自己的\n但我百分之百確定我自己並不想和女人做愛。但我確定我被男人所吸引，因爲我覺得自己喜歡親吻。\n因爲我想親吻我的暗戀對象。是否有一個...",
      "title": "作爲一個直女，只看女同性戀色情片是不是很奇怪？"
    }
  ]
}