{
  "author": "NextFlan",
  "the_new_excerpt": "PLEASE be incredibly wary of the massive influx of Youtube Crypto Gurus who are\nselling you their \"TA\"/analysis, often with manufactured and over excited\nspeech.\n\nMany of you have just started out investing in Cryptocurrency.\n\nCongratulations! You are a relatively new adopter.\n\n\n\nNaturally you are…",
  "original_created_utc": 1619808286,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Youtubeに大量に流入してくる暗号の達人たちに、くれぐれもご注意ください。\nその「TA」／分析は、しばしば作られ、過剰に興奮した状態で売りつけられます。\nのスピーチがあります。\n\n多くの方は暗号通貨への投資を始めたばかりです。\n\nおめでとうございます。あなたは比較的新しい投資家です。\n\n\n\n当然、あなたは...",
      "title": "新しい投資家への警告と、非常に重要なアドバイス。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "请对大量涌入Youtube的加密货币大师保持高度警惕，他们正在向你推销他们的 \"技术\"。\n他们向你推销他们的 \"TA\"/分析，往往是以制造和过度兴奋的方式\n讲话。\n\n你们中的许多人刚刚开始投资加密货币。\n\n恭喜你！你是一个相对较新的采用者。你是一个相对较新的采用者。\n\n\n\n自然，你是...",
      "title": "对新投资者的警告和一些非常重要的建议。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "請對大量湧入Youtube的加密貨幣大師保持高度警惕，他們正在向你推銷他們的 \"技術\"。\n他們向你推銷他們的 \"TA\"/分析，往往是以製造和過度興奮的方式\n講話。\n\n你們中的許多人剛剛開始投資加密貨幣。\n\n恭喜你！你是一個相對較新的採用者。你是一個相對較新的採用者。\n\n\n\n自然，你是...",
      "title": "對新投資者的警告和一些非常重要的建議。"
    }
  ],
  "title": "A warning to new investors and some very important advice.",
  "created_utc": 1619840206,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>PLEASE be incredibly wary of the massive influx of Youtube Crypto Gurus who are selling you their &quot;TA&quot;/analysis, often with manufactured and over excited speech.</p>\n\n<p>Many of you have just started out investing in Cryptocurrency. </p>\n\n<p>Congratulations! You are a relatively new adopter.</p>\n\n<p>&#x200B;</p>\n\n<p>Naturally you are seeking guidance about investment strageies; for example, &quot;Which coins should I invest in?&quot; &quot;When is the best time to buy?&quot; &quot;Which technical charts should I look at if I want to Day Trade&quot;</p>\n\n<p>Stop.</p>\n\n<p>&#x200B;</p>\n\n<p>Right </p>\n\n<p>&#x200B;</p>\n\n<p>There. </p>\n\n<p>&#x200B;</p>\n\n<p>Investing in crypto is an incredibly simple process. </p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Buy Bitcoin. (Dollar Cost Average)<br/></li>\n<li>Hodl it for as long as you can. </li>\n<li>When there is a dip. Buy more. </li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>That&#39;s it. Technical analysis ONLY benefits the people who are selling it to YOU. You cannot predict this market with exotic sounding extensions. Read more about why TA doesn&#39;t work in Crypto, if you want to learn more. </p>\n\n<p>&#x200B;</p>\n\n<p>The sharks and manipulators will encourage you to sign up for their ultimately useless classes and use their BONUS codes to sign up for devastating leverage trading on various platforms which WILL eventually leave you with nothing. But why? Well, There is a reason why they push this in EVERY video they make. </p>\n\n<p>&#x200B;</p>\n\n<p>They want YOU, the naive newcomer to make moves and trade as much as possible using bonuses they have available on certain sites and to sign up to their classes which DO NOT WORK.</p>\n\n<p>They want encourage you to trade and make THEM money. It&#39;s a very obvious game and it nets these disgraceful people hundreds of thousands, if not millions in referral revenue, donations and sign ups. </p>\n\n<p>&#x200B;</p>\n\n<p>Bitcoin is a FANTASTIC investment, but that&#39;s all you have to do.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Buy (Dollar Cost Average) </li>\n<li>Hodl. </li>\n<li>Buy Dips. </li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>That&#39;s it. Please do not get scammed. </p>\n\n<p>&#x200B;</p>\n\n<p>I have seen too many innocent victims fall for these ridiculous Yutubers shilling strategies only to line their pockets. </p>\n\n<p>Watch these videos for entertainment purposes only. TA in Crypto is essentially, Astrology.  Read and keep aware of what&#39;s happening in the world and the markets IF you are a trader. But, again. Don&#39;t trade. Buy. Hodl. Wait.</p>\n\n<p>You have the same odds using a Ouija bored to predict what is happening, but you have almost a guranteed success rate if you just buy and hodl.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Buy Bitcoin. Zoom out. Relax and wait.</strong></p>\n\n<p>&#x200B;</p>\n\n<p>Stay safe.</p>\n</div><!-- SC_ON -->",
  "score": 220,
  "permalink": "/r/Bitcoin/comments/n20ifh/a_warning_to_new_investors_and_some_very/",
  "subreddit": "Bitcoin",
  "id": "n20ifh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380958566
}