{
  "author": "MKorostoff",
  "the_new_excerpt": "That value has inflated a lot since then. Did they not expect the constitution\nto last long enough for inflation to become an issue? Or is inflation just not\nsomething they knew about?\n\nEdit:\n\nThanks for all the replies. To summarize the many excellent comments in this\nthread:\n\n * Yes, the founders…",
  "original_created_utc": 1616556494,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "从那时起，这个数值就膨胀了很多。难道他们没有想到宪法\n要持续足够长的时间让通货膨胀成为一个问题？还是说，通货膨胀并不是\n他们知道的事情？\n\n编辑。\n\n谢谢大家的回复。总结一下这里面的很多优秀评论\n是的，创始人..:\n\n * 是的，创始人...",
      "title": "美国宪法第七修正案保障价值超过20美元的民事案件有陪审团审判的权利。作者不知道通货膨胀吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從那時起，這個數值就膨脹了很多。難道他們沒有想到憲法\n要持續足夠長的時間讓通貨膨脹成爲一個問題？還是說，通貨膨脹並不是\n他們知道的事情？\n\n編輯。\n\n謝謝大家的回覆。總結一下這裏面的很多優秀評論\n是的，創始人..:\n\n * 是的，創始人...",
      "title": "美國憲法第七修正案保障價值超過20美元的民事案件有陪審團審判的權利。作者不知道通貨膨脹嗎？"
    }
  ],
  "title": "The 7th Amendment to the US constitution guarantees the right to a jury trial in civil cases where the value exceeds $20. Did the authors not know about inflation?",
  "created_utc": 1616628756,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>That value has inflated a lot since then. Did they not expect the constitution to last long enough for inflation to become an issue? Or is inflation just not something they knew about?</p>\n\n<p><strong>Edit:</strong></p>\n\n<p>Thanks for all the replies. To summarize the many excellent comments in this thread:</p>\n\n<ul>\n<li>Yes, the founders would have known about inflation as a general concept. They debated and wrote about monetary policy with respect to its impact on inflation.</li>\n<li>They would <em>not</em> have understood inflation as a steady, consistent, inevitable march towards higher prices, because that just isn&#39;t how inflation worked at the time. Steady single-digit inflation only began in the late 20th century as a result of monetary policies specifically selected to achieve this outcome. It is also not a given that these policies will continue eternally into the future, as I previously assumed.</li>\n<li>Even if steady single-digit inflation <em>had</em> existed at the time, it is not clear the founders would have been able to precisely measure it, because rigorous collection and analysis of macroeconomic indicators was not a thing. (It&#39;s <em>also</em> not clear if this matters, because you can observe a general trend without precisely measuring it).</li>\n<li>A civil case under $20 would have been unlikely even at the time, and is rendered even more unlikely today by jurisdiction rules that prevent courts from hearing certain types of cases if the dollar value does not rise to a certain threshold.</li>\n<li>The $20 threshold <em>may</em> have been intended as a token amount, essentially meant to allow for jury trials in almost all civil cases concerning money.</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 2435,
  "permalink": "/r/AskHistorians/comments/mbwfee/the_7th_amendment_to_the_us_constitution/",
  "subreddit": "AskHistorians",
  "id": "mbwfee",
  "is_self": true,
  "media": null,
  "is_video": false
}