{
  "author": "barhooooom",
  "original_created_utc": 1632252426,
  "title": "I created a chrome extension, that detects rickrolling links.",
  "created_utc": 1632261985,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey, I am a computer science and economist student. I finished my freshman year a couple of weeks ago. I wanted during the break, before going back to university for my sophomore year to join a hackathon or two and do some projects on the side. Well, I joined a hackathon and didn&#39;t do any projects until now, so because uni is starting in a couple of weeks and not having a lot of time, I decided my project should be small. I juiced my brain for ideas until I decided on the genius idea of creating a chrome extension, that detects rickrolling links. I did this whole thing on python, it&#39;s quite simple actually when you right-click there is an option where it says if you wanna check if it&#39;s a rickroll, through machine learning it sees if the video&#39;s audio is the same as the original rickrolls audio (I did this because people use different links aside from the original Never Gonna Give You Up music video. I created a youtube video, illustrating what I did a how I did it accompanied by the source code on GitHub and a link to download the extension. This is the <a href=\"https://www.youtube.com/watch?v=pVbPq99jyJY\">video</a> if you want to watch it. I hope y&#39;all enjoy it :)</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/RFtHk7e0iqNbcCpEciXs0gcJIqw_4HbJQsyyonaJlPQ.jpg?auto=webp&s=b6dde996d629eb8eab07237da9bf463f28f35419",
          "width": 480,
          "height": 360
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/RFtHk7e0iqNbcCpEciXs0gcJIqw_4HbJQsyyonaJlPQ.jpg?width=108&crop=smart&auto=webp&s=e17087a7ab5e293ceed93afdb74aca6d5987e641",
            "width": 108,
            "height": 81
          },
          {
            "url": "https://external-preview.redd.it/RFtHk7e0iqNbcCpEciXs0gcJIqw_4HbJQsyyonaJlPQ.jpg?width=216&crop=smart&auto=webp&s=0ce1e241d949ef5a2bf9a774b6f0a603c8f0ac6f",
            "width": 216,
            "height": 162
          },
          {
            "url": "https://external-preview.redd.it/RFtHk7e0iqNbcCpEciXs0gcJIqw_4HbJQsyyonaJlPQ.jpg?width=320&crop=smart&auto=webp&s=4eb353aafdb7999b03075fa9a9572d122714f702",
            "width": 320,
            "height": 240
          }
        ],
        "variants": {},
        "id": "KM86_ijYcqxb_oXfanmcGKBH4Sf47fZ9RV8gDAFOFUw"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/SideProject/comments/psq0ol/i_created_a_chrome_extension_that_detects/",
  "subreddit": "SideProject",
  "id": "psq0ol",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey, I am a computer science and economist student. I finished my freshman year\na couple of weeks ago. I wanted during the break, before going back to\nuniversity for my sophomore year to join a hackathon or two and do some projects\non the side. Well, I joined a hackathon and didn't do any projects…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、私はコンピュータサイエンスとエコノミストの学生です。私は1年目を終えました。\n2週間前に終わりました。私は、大学に戻る前の休みの間に\nハッカソンやプロジェクトに参加したいと思っています。\n行いたいと思っていました。まあ、ハッカソンに参加したものの、何のプロジェクトもしませんでしたが......。",
      "title": "私はクロームの拡張機能を作って、リクロルリンクを検出するようにしました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，我是一名计算机科学和经济学家学生。我在几周前完成了我的大一课程\n几个星期前。我想在休息期间，在回到大学进行大二学习之前\n参加一两个黑客马拉松并做一些项目。\n做一些副业。好吧，我参加了一个黑客马拉松，但没有做任何项目......",
      "title": "我创建了一个chrome扩展程序，可以检测佝偻病的链接。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，我是一名計算機科學和經濟學家學生。我在幾周前完成了我的大一課程\n幾個星期前。我想在休息期間，在回到大學進行大二學習之前\n參加一兩個黑客馬拉松並做一些項目。\n做一些副業。好吧，我參加了一個黑客馬拉松，但沒有做任何項目......",
      "title": "我創建了一個chrome擴展程序，可以檢測佝僂病的鏈接。"
    }
  ]
}