{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Tuesday, February 23, 2021\n\nThe market was extremely volatile today. After opening deep in the red, the S&P\n500 (SPY) and Dow Jones (DIA) was able to reverse to close marginally positive.\nThe sell-off in technology stocks continued, with the Nasdaq (QQQ) once…",
  "original_created_utc": 1614115357,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾--2021年2月23日，星期二。\n\n今天市场波动极大。在开盘深陷红盘后，标普\n500指数(SPY)和道琼斯指数(DIA)得以逆转，小幅收阳。\n科技股的抛售仍在继续，纳斯达克（QQQ）一度...",
      "title": "以下是今天2021年2月23日星期二的市场回顾。多么疯狂的一天啊!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧--2021年2月23日，星期二。\n\n今天市場波動極大。在開盤深陷紅盤後，標普\n500指數(SPY)和道瓊斯指數(DIA)得以逆轉，小幅收陽。\n科技股的拋售仍在繼續，納斯達克（QQQ）一度...",
      "title": "以下是今天2021年2月23日星期二的市場回顧。多麼瘋狂的一天啊!"
    }
  ],
  "title": "Here is a Market Recap for today Tuesday, February 23, 2021. What a crazy day!",
  "created_utc": 1614141541,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Tuesday, February 23, 2021</strong></p>\n\n<p>The market was extremely volatile today. After opening deep in the red, the S&amp;P 500 (SPY) and Dow Jones (DIA) was able to reverse to close marginally positive. The sell-off in technology stocks continued, with the Nasdaq (QQQ) once again underperforming. The recent pressure on the market comes after a spike in the 10-year Treasury yield that has market participants concerned that inflation will begin to rise. </p>\n\n<p>Federal Reserve Chair Jerome Powell delivered his semiannual monetary policy testimony, offering another update on his view for the path forward for monetary policy during and after the pandemic. In his remarks, Powell reaffirmed that the Federal Reserve was looking to maintain its current accommodative policy posturing for the time being, keeping benchmark rates near zero and asset purchases at the current pace of $120 billion per month. He said, &quot;The economy is a long way from our employment and inflation goals, and it is likely to take some time for substantial further progress to be achieved. We will continue to clearly communicate our assessment of progress toward our goals well in advance of any change in the pace of purchases.&quot; </p>\n\n<p>In Washington, The U.S. House of Representatives Budget Committee voted to advance President Joe Biden&#39;s $1.9 trillion virus relief proposal on Monday, bringing it a step closer to passage ahead of a mid-March cliff, after which federal unemployment benefits are set to expire. </p>\n\n<p>In the last week or two, market participants have been eyeing a sharp spike in Treasury yields, raising concerns of a surge in borrowing costs and inflationary pressures in the post-pandemic economy. The benchmark 10-year yield hovered around 1.36% for its highest level in a year, after wallowing below 1% for most of 2020. That said, the Treasury yield remains at historically low levels. While we expect the spike in the yield to put pressure on the market, our long-term bull thesis remains intact.</p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>The U.S. Postal Service said Tuesday it would award a multi-billion-dollar, 10-year contract to Oshkosh Defense to manufacture a new generation of postal delivery vehicles. Shares of Workhorse (WKHS), another company that was vying for that contract, plummeted more than 40% after the deal was announced.</li>\n<li>Shares of Snapchat (SNAP) reached all-time highs after the company provided an optimistic outlook on ad revenue and customer growth.</li>\n<li>Apple (AAPL) is planning to increase dividend according to Chief Executive Tim Cook, CNBC reported on Tuesday, citing the shareholder meeting.</li>\n<li>Facebook said late Monday it will restore news content to its platform in Australia. The company had suspended news sharing last week amid a dispute over a proposed Australian law requiring tech platforms to pay publishers.</li>\n<li>French antitrust investigators have accused Alphabet Inc&#39;s Google of failing to comply with the state competition authority&#39;s orders on how to conduct negotiations with news publishers over copyright, two sources who read the investigators&#39; report said.</li>\n<li>After reaching an all-time high of more than $58,000, the value of Bitcoin (BTC) has plummeted in the few days</li>\n<li><strong>Please note many of the current stock prices were written in the morning and probably changed due to intraday movement.</strong></li>\n<li>Baidu (BIDU) target raised by KeyCorp from $290 to $390 at Overweight. Stock currently around $322</li>\n<li>MongoDB (MDB) target raised by Citigroup from $465 to $500 at Buy. Stock currently around $380</li>\n<li>Palo Alto Networks (PANW) with a host of target raises. Consensus price target of $450 at Buy. Stock currently around $377</li>\n<li>SEA (SE) target raised by Cowen from $225 to $350 at Outperform. Stock currently around $250</li>\n<li>Spotify (SPOT) target raised by Rosenblatt Securities from $390 to $425 at Buy. </li>\n</ul>\n\n<p>“The only thing we have to fear is fear itself.” - Franklin D. Roosevelt</p>\n</div><!-- SC_ON -->",
  "score": 61,
  "permalink": "/r/stocks/comments/lqtfm2/here_is_a_market_recap_for_today_tuesday_february/",
  "subreddit": "stocks",
  "id": "lqtfm2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332886312
}