{
  "author": "grrrlgonecray999",
  "the_new_excerpt": "I see a lot of people who have poured their hard earned money into something\nthat they havent bothered to research at all and it is hilarious and sad.\n\nPeople spout about which coin is hot. AAVE, COMP, ETH...is defi hot? Are nfts\nhot???\n\nSo here we have Biden suggesting a cap gains increase and…",
  "original_created_utc": 1619151177,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "苦労して稼いだお金を、全く調べもせずに、何かに注ぎ込んでいる人をたくさん見ます。\n笑えるし、悲しいことです。\n\n人々はどのコインがホットなのかについて話しています。AAVE、COMP、ETH...defiはホットですか？nftsは？\nはホットなのか？\n\nここではバイデンがキャップゲインの増加を提案していて...",
      "title": "この税金のFUDは笑えます。その理由を説明しましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到很多人把他们辛苦赚来的钱投入到他们根本懒得研究的东西中去。\n他们根本懒得去研究，这很搞笑也很可悲。\n\n人们大谈哪种钱币是热门。AAVE、COMP、ETH......defi是热门吗？Nfts\n热吗？\n\n所以在这里，我们有拜登建议增加上限收益和...",
      "title": "这种税收疑虑是很搞笑的。让我解释一下原因。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到很多人把他們辛苦賺來的錢投入到他們根本懶得研究的東西中去。\n他們根本懶得去研究，這很搞笑也很可悲。\n\n人們大談哪種錢幣是熱門。AAVE、COMP、ETH......defi是熱門嗎？Nfts\n熱嗎？\n\n所以在這裏，我們有拜登建議增加上限收益和...",
      "title": "這種稅收疑慮是很搞笑的。讓我解釋一下原因。"
    }
  ],
  "title": "This tax FUD is hilarious. Let me explain why.",
  "created_utc": 1619160364,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I see a lot of people who have poured their hard earned money into something that they havent bothered to research at all and it is hilarious and sad. </p>\n\n<p>People spout about which coin is hot. AAVE, COMP, ETH...is defi hot? Are nfts hot??? </p>\n\n<p>So here we have Biden suggesting a cap gains increase and everyone panic sells and rants about missing Trump. </p>\n\n<p>Do you realize how dumb you sound? Do you even realize that you are literally investing in the very solution to that problem? Did you even know what DeFi stands for or was it just a picture of a unicorn that got your attention?</p>\n\n<p>Defi stands for DECENTRALIZED FINANCE. It means you have a bank, a lender, etc without a middleman. Bankless! And there are CeFi platforms as well that make it even easier!</p>\n\n<p>What do these platforms do, you ask? (Since apparently none of you even bother to understand what you buy. You just cry and scream at the sky when number go down) </p>\n\n<p>Well, one thing you can do with lending platforms is use your crypto as collateral to take out loans against your crypto! </p>\n\n<p>and guess what the BEST part is...</p>\n\n<p>...wait for it...</p>\n\n<p>IT ISNT A TAXABLE EVENT. </p>\n\n<p>Yes. Let me repeat this again. You can have a bIg ole pile of crypto earning rewards and you can take out cash whenever you want and you dont pay taxes on it! And its lower fees than a bank and with defi even lower! Thats literally what you have been investing in the entire time you dolts!! </p>\n\n<p>It isnt called defi for no reason. Its DECENTRALIZED FINANCE! You can take out loans, earn interest, lend money across the planet. Biden cant touch it if you dont sell it. </p>\n\n<p>But if everyone PANIC SELLS than that fucks it up for everyone and for the people the angriest at Biden IT FUCKS IT UP FOR YOU THE MOST! </p>\n\n<p>This isnt wall street bets. This isnt a couch you are buying to flip. The goal is to stack crypto and take out loans against it (which is not a taxable event) or to escape your country’s shitty and predatory banking system! Thats why we are all here!  Its literally what the fucking sub is named. Look up in the top corner of your screen. It says CryptoCurrency! Read thag again a few more times. </p>\n\n<p>You arent hurting Biden by panic selling, you clowns! You are shooting yourself in the foot. </p>\n\n<p>Go watch some videos and educate yourself on taxes in crypto and how to avoid them. You can start a crypto IRA. You can simply stack on celsius/nexo/blockfi and take out low interest loans. </p>\n\n<p>ITS SURREAL TO WATCH THIS! </p>\n\n<p>Its like watching people investing in canoes and freaking out because their street is flooded and they are like “Well what the fuck are we supposed to do with all these canoes now?!!!”</p>\n\n<p>This is like an IQ test that America failed. Its really sad to watch.</p>\n</div><!-- SC_ON -->",
  "score": 2992,
  "permalink": "/r/CryptoCurrency/comments/mwn1jk/this_tax_fud_is_hilarious_let_me_explain_why/",
  "subreddit": "CryptoCurrency",
  "id": "mwn1jk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776207033
}