{
  "author": "concerninglydumb",
  "original_created_utc": 1635434617,
  "title": "What makes a high, basic pH so dangerous?",
  "created_utc": 1635446882,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We’re studying pH in one of my science classes and did a lab involving NaOH, and the pH of 13/14 makes it one of the most basic substances. The bottle warned us that it was <em>corrosive</em>, which caught me off guard. I was under the impression that basic meant not-acidic, which meant gentle. I’m clearly very wrong, especially considering water has a purely neutral pH.</p>\n\n<p>Low pH solutions (we used HCl too) are obviously harsh and dangerous, but if a basic solution like NaOH <em>isn’t</em> acidic, how is it just as harsh?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/askscience/comments/qhpgar/what_makes_a_high_basic_ph_so_dangerous/",
  "subreddit": "askscience",
  "id": "qhpgar",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We’re studying pH in one of my science classes and did a lab involving NaOH, and\nthe pH of 13/14 makes it one of the most basic substances. The bottle warned us\nthat it was corrosive, which caught me off guard. I was under the impression\nthat basic meant not-acidic, which meant gentle. I’m clearly…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "理科の授業でpHの勉強をしていて、NaOHを使った実験をしたのですが、その時に\npHが13/14であることから、最も基本的な物質のひとつであることがわかります。ボトルには「腐食性があります」と書かれていました。\n腐食性があるとボトルに書かれていたので、びっくりしました。私は\n塩基性とは酸性ではないこと、つまり優しいことだと思っていました。私は明らかに...",
      "title": "塩基性の高いpHが危険なのはなぜですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们在我的一门科学课上研究pH值，并做了一个涉及NaOH的实验。\n13/14的pH值使其成为最基本的物质之一。瓶子上警告我们\n它具有腐蚀性，这让我措手不及。我当时的印象是\n碱性意味着非酸性，也就是温和的。我显然...",
      "title": "是什么让高的、碱性的pH值如此危险？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們在我的一門科學課上研究pH值，並做了一個涉及NaOH的實驗。\n13/14的pH值使其成爲最基本的物質之一。瓶子上警告我們\n它具有腐蝕性，這讓我措手不及。我當時的印象是\n鹼性意味着非酸性，也就是溫和的。我顯然...",
      "title": "是什麼讓高的、鹼性的pH值如此危險？"
    }
  ]
}