{
  "author": "Rusty_Charm",
  "original_created_utc": 1636490059,
  "title": "The 2021 bullrun exit strategy",
  "created_utc": 1636497584,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Disclaimer:</strong> This exit strategy relies on a bunch of assumptions. The point of this post is not to debate those. If you think this bullrun will last well into 2022 or perhaps even longer, that&#39;s cool, you do you. What I&#39;m about to describe is my own exit strategy. I&#39;m not trying to convince you that it&#39;s better than your plan, my only hope is that there might be handful of people to whom this makes sense who can take something valuable from this post. As for the rest of you, best of luck, and I sincerely mean that.</p>\n\n<p><strong>Thesis Statement:</strong> I believe we are at the tail end of the bullrun that started after the March Covid crash of 2020. We have seen mindblowing gains on alts like Solana, Luna, Ada, Avax, Harmony, and many others. I believe that there&#39;s not much juice left in that lemon. The main reasons for this belief are:</p>\n\n<p>- <strong>This isn&#39;t the &quot;cycle of mass adoption&quot;.</strong> This is actually a good thing, because literally none of the L1s in the top 100 are ready for mass adoption: Solana had to shut down for 17 hours because it buckled under the weight of transactions. Eth&#39;s answer to increasing traffic is to charge you $250 in gas for a uniswap transaction. Matic can barely handle the traffic it gets currently and transactions frequently remain &#39;pending&#39; for hours or days. Cardano still doesn&#39;t have working smart contracts and Hoskinson himself essentially admitted that it can&#39;t scale without L2s. I could go on here, but you get the point.</p>\n\n<p>- <strong>Governments all around the world have been printing money like it&#39;s a sport, and that didn&#39;t begin in 2020 with the onset of the pandemic, it began more than 10 years ago after the financial crisis.</strong> A by-product of this has been record-low interest rates. This has fueled investment all over the planet, as is easily evidenced by a completely out of control housing market in most major markets and a stock market that has been basically &#39;up only&#39; for ten years straight. Governments are now admitting that the current 4%-5% inflation rate is not sustainable. In order to get this back in line, the federal banks will have to raise interest rates. That means less money for all of us, because things like mortgages, car payments, credit card debt, etc. will all go up. And obviously, it will no longer make sense to take a loan to invest (and yes, people have definitely been taking loans to invest, simply because it made sense: you can take a loan from the bank for less 5% and put that money into index funds and you&#39;ll come out on top....at least for now).</p>\n\n<p>- <strong>This whole space is dramatically overvalued.</strong> Yes I know, market caps do not reflect the actual value of a company, but they do reflect the current level of speculation: we are in the kind of market where Tesla is worth more than the entire German automotive industry. Cardano is worth $77 billion dollars and it currently doesn&#39;t even function as an L1 smart contract chain. Dot is worth $50 billion dollars and barely has a working product. The point is that the current valuations reflect what these projects may become in the next 5 years. In other words, their valuations are based on speculation, not current capabilities.</p>\n\n<p><strong>&quot;Ok dude, get to the point already&quot;</strong> I believe that this December will see the crypto market go absolutely ballistic, fueled by holiday spending, euphoria, and an over confidence in a market that has already seen 10X gains in the last 3 months. It will crash in early 2022, most likely kicked off by a stock market crash as governments all over the word raise interest rates and announce efforts to contain their out of control spending that&#39;s resulted in debt levels our grand children will still be paying off.</p>\n\n<p><strong>&quot;Cool story bro, so what are you gonna do about it?&quot;</strong> At some point in late December (obviously depending on market dynamics at the time), I&#39;m going to sell most of my crypto assets for stable coins and earn yield on stable coins. The US dollar is extremely unlikely to collapse. And if it does, the whole planet goes into a massive economic recession and crypto will not be spared. USD will be the safest asset to be in, save for perhaps gold. Here&#39;s what I will do step by step:</p>\n\n<p>- Deposit stable coin as collateral on a protocol such as anchor, earning interest</p>\n\n<p>- take stable coin loan against collateral, again earning to borrow (and even if you&#39;re no longer getting paid to borrow, the interest earned from lending will most likely outweigh the interest owed from borrowing, meaning on a net level, you&#39;re still making money)</p>\n\n<p>- Provide stable coin liquidity, e.g. USDC &lt;&gt; DAI pair, earning yield and compounding that yield into liquidity.</p>\n\n<p>The rates currently available for doing this vary from platform to platform, but at the moment, you can easily get 20% APR doing this. If you&#39;re willing to risk doing this with smaller, less established platforms like Tranquil and Openswap on Harmony, you can get almost 100% APR). There are variations of the above, but that&#39;s the general gist.</p>\n\n<p><strong>&quot;And then what?&quot;</strong> I wait as my USD reserves grow. I use the time to research in an effort to identify alts that have a good chance of becoming winners in the next bull market. My focus will be on L1s that can actually scale to global demand without having to rely on imperfect L2 solutions. Once it becomes relatively clear that the market has reached the bottom (where it will probably stay for quite some time like it has in every other true bear market), I start to DCA, positioning myself for the next bull market, whether that comes in late 2022 or in 2024, I plan on being a part of it.</p>\n\n<p>Thanks to those who read this entire wall of text, and to those who didn&#39;t, well, you&#39;re not reading this anyway ;)</p>\n\n<p><strong>EDIT:</strong> A few responses are misinterpreting the above as trying to &#39;time the market&#39;. I wouldn&#39;t really call it that. If I was trying to time the market, I&#39;d be trying to sell more or less the exact top. I know I won&#39;t be able to do that, and I&#39;m not at all ruling out that after I sell, the market keeps pumping throughout January and maybe even longer. But I&#39;m absolutely willing to forego gains at the very tail end of the market if it means not having to see my portfolio bleed like a slasher movie over the course of a few short days like it did in 2018. </p>\n</div><!-- SC_ON -->",
  "score": 263,
  "permalink": "/r/CryptoCurrency/comments/qqcmpi/the_2021_bullrun_exit_strategy/",
  "subreddit": "CryptoCurrency",
  "id": "qqcmpi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Disclaimer: This exit strategy relies on a bunch of assumptions. The point of\nthis post is not to debate those. If you think this bullrun will last well into\n2022 or perhaps even longer, that's cool, you do you. What I'm about to describe\nis my own exit strategy. I'm not trying to convince you that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "免責事項：この出口戦略は、多くの仮定に依存しています。この記事の目的は\nこの記事の目的は、それらを議論することではありません。もしあなたが、このブルランが2022年まで、あるいはそれ以上続くと思うなら\nこのブルランが2022年まで、あるいはそれ以上続くとお考えの方は、それはそれで構いません。私がこれから説明するのは\n私自身の出口戦略です。あなたを説得しようとしているわけではありませんが・・・。",
      "title": "2021年ブルランの出口戦略"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "免责声明：这个退出策略依赖于一堆假设。这篇文章的重点是\n这篇文章不是为了辩论这些。如果你认为这轮牛市将持续到\n2022年，甚至更久，这很好，你就是你。我所要描述的\n是我自己的退出策略。我不是想说服你...",
      "title": "2021年牛市的退出战略"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "免責聲明：這個退出策略依賴於一堆假設。這篇文章的重點是\n這篇文章不是爲了辯論這些。如果你認爲這輪牛市將持續到\n2022年，甚至更久，這很好，你就是你。我所要描述的\n是我自己的退出策略。我不是想說服你...",
      "title": "2021年牛市的退出戰略"
    }
  ]
}