{
  "author": "pseudoHappyHippy",
  "original_created_utc": 1630093684,
  "title": "Flash loans: a dive into DeFi’s most bizarre, outlandish, and intimidating innovation. If you’re not yet familiar with flash loans and how they work, this will probably blow your mind.",
  "created_utc": 1630103886,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Warning: Very long (but also super interesting, I promise)!</p>\n\n<p><strong>What if I told you that you could anonymously borrow $200+ million dollars in the blink of an eye without posting any collateral, and without even assuming any liability for the loan?</strong></p>\n\n<p>This sounds impossible on many levels, and would be an outrageous concept in traditional finance, but it is a reality in DeFi. With a little effort, you could be borrowing millions of dollars by the end of the day with no collateral.</p>\n\n<p>Of course, there are a few limitations that I have not yet mentioned. For one thing, as far as I know, there is still no user-friendly way to do this. You would need to be able to write and deploy the Solidity smart contract yourself (there are a few guides on how to do this floating around the web). Eventually, it is expected that Aave and other protocols will offer flash loans in their user interface rather than requiring that you interact directly with their lending pools using your own smart contract.</p>\n\n<p>The next limitation of flash loans is absolutely critical: the loan must be repaid (with interest, which is usually a bit under 1%) within seconds of when you take it out. More specifically, it must be repaid by the time the Ethereum transaction ends.</p>\n\n<p>The third limitation is that everything you do with the funds in between borrowing them and returning them must happen inside the Ethereum ecosystem; you cannot move those assets off the Ethereum network.</p>\n\n<p>This still doesn’t make sense, right? What happens if you don’t or can’t repay it? What does it even mean to repay a loan inside the same transaction that you took it in? What is the point of having $200 million for 10 seconds? To answer these questions, we need to take a look at how flash loans actually work.</p>\n\n<p>The first thing we need to understand is Ethereum transactions. Thanks to smart contracts, Ethereum transactions aren’t just a simple transfer of assets; they can contain any arbitrary logic. Moreover, these transactions can contain more transactions inside themselves (and these transactions can even contain transactions in themselves). So, Ethereum transactions can nest in each other. The top-level transaction can <em>only</em> succeed if every single transaction it contains also succeeds.</p>\n\n<p>This last sentence is a very important concept known as <em>atomicity</em> (which comes from ancient Greek for “indivisible”). For smart contract platforms, the property of atomicity means that a transaction must either entirely succeed or entirely fail; it can’t partly succeed. So, if a single sub-transaction inside a top-level transaction fails, then the <em>entire</em> top-level transaction will fail, which means every sub-transaction it contains will fail, and therefore nothing at all will actually happen on the blockchain, besides a record of the failed transaction.</p>\n\n<p>Only once a transaction has fully succeeded is it added to the blockchain as an immutable fact of history. Until that moment, <em>everything that happens on the Ethereum network is reversible</em>. Ethereum knows how to backtrack any arbitrary sequence of transactions in the case that the parent transaction has failed.</p>\n\n<p>For example, let’s say I make a transaction containing 3 sub-transactions; one involving borrowing something on Aave, another involving selling something on SushiSwap, and the third involving buying something on Uniswap. Now, let’s say the Aave transaction succeeds, the SushiSwap transaction succeeds, but then the Uniswap fails (due to insufficient gas limit for example). This failure causes the entire top-level transaction to fail, which will cause the SushiSwap sell and the Aave borrow to reverse.  In effect, those things never actually happened. All that is added to the blockchain is a record of that failed transaction that was attempted.</p>\n\n<p>If, however, all 3 transactions succeed, then the top-level transaction will complete successfully, and it will then be added to the blockchain, meaning all 3 sub-transactions have actually happened, and now can’t be reversed.</p>\n\n<p>This finally brings us back to flash loans. When you take out a flash loan, an Ethereum transaction begins. The first sub-transaction inside this top-level transaction is the actual transferring of the funds you are borrowing to your address. Next, you are free to do any sequence of transactions you like in order to try to turn a profit on the funds you’ve borrowed. You can interact with any protocols, DEXes, AMMs, or whatever kind of contracts you like, in whatever way and whatever order. The only limit is that you cannot move the funds outside of the Ethereum network; otherwise, you would simply be able to take the money and run, since the loan is anonymous and uncollateralized.</p>\n\n<p>No matter what sub-transactions you include in the smart contract, the very last sub-transaction of a flash loan must always be full repayment of the loan with interest. If you succeed in repaying the loan and interest, then the entire flash loan transaction will complete successfully. The lender will get their funds back plus interest, and you get to keep any additional profits you managed to create with whatever you did between borrowing and returning the funds. This entire transaction will now be added to the blockchain as an immutable fact of history.</p>\n\n<p>If, however, you cannot repay the loan with interest by the end of the top-level transaction (say you somehow managed to lose some of the funds in the few seconds since the flash loan started), then the final sub-transaction (the repayment one) will fail. Due to atomicity, this will cause the whole flash loan transaction to fail, meaning every sub-transaction will fail, reversing every action taken by your smart contract, including even the first sub-transaction in which you received the borrowed funds.</p>\n\n<p>In other words, <strong>if you can’t repay your flash loan with interest by the end of the transaction, then you never even borrowed the funds in the first place</strong>! Flash loans are thus kind of like Schrodinger&#39;s loans: if they turn a profit, then they are real; otherwise, they never existed.</p>\n\n<p>So, how does one actually use the funds to turn a profit during the few seconds between the beginning and end of the flash loan transaction? The only real use-case people have worked out so far is arbitrage (the act of taking advantage of a price difference between two markets for the same asset, and then buying in the cheaper market and selling in the more expensive one and pocketing the difference). So, a realistic flash loan smart contract would most likely involve a bot that is searching for sufficiently large arbitrage opportunities, and then, upon finding one, taking out a huge flash loan, using those funds to execute the arbitrage play in a huge way, and then repaying the funds and pocketing the profit.</p>\n\n<p>In a sense, a flash loan is like a brief, anonymous partnership between two parties who each bring an important resource to the alliance. The lender(s) is basically saying “I have tons of money and am interested in multiplying it, but I don’t have the patience or know-how to do it”. The borrower is basically saying “I have extensive knowledge of DeFi, smart contracts, Solidity, and arbitrage, so I know how to multiply money, but I don’t have enough capital to make it worth my while”. For a few seconds, these people anonymously join forces, and, if it works out, the lender walks away with their 0.9% interest, and the borrower walks away with the remainder of the profits. If it doesn’t work out, then the flash loan never happened in the first place; no harm, no foul.</p>\n\n<p>These parties can sometimes walk away with millions of dollars in profit after a 10 second transaction, and <strong>neither party assumes any risk at all for the flash loan</strong> (besides inherent smart contract risk). If it doesn’t work out, it simply never happened; this is why you don’t need a credit check or collateral or anything. The lender doesn’t need to worry about a loan default, and the borrower doesn’t need to worry about being saddled with debt liability.</p>\n\n<p>So, if people can anonymously borrow huge amounts of money with no risk for either party, why are flash loans not mainstream?</p>\n\n<p>Well, for one, they are quite a new invention. Moreover, <em>they just feel wrong</em>. Flash loans don’t really sit well with anyone. It feels like having your cake, and eating it too. It just seems like it shouldn’t be possible to borrow $200 million with no risk (by the way, there is no theoretical limit to flash loan sizes; I just keep saying $200 million because I believe that’s the biggest one ever taken so far. It’s only limited by lending liquidity).</p>\n\n<p>For these reasons, flash loans have seen slow, hesitant adoption among DeFi protocols and users (even extremely savvy ones). Nevertheless, for people who are actually willing to learn how to write flash loan arbitrage contracts, it’s basically free money sitting on the ground.</p>\n\n<p>One final reason that the crypto world has been very hesitant in embracing flash loans is that they have been used for a few high-profile DeFi exploits. Basically, some extremely savvy users have found ways to use flash loans combined with complex strings of interactions with various protocols in order to do things like momentarily trick price feed oracles or briefly de-peg stablecoins on a single exchange, or whatever. Flash loans allow these exploiters to drastically multiply how much profit they can get from their ploys. These attacks require extremely deep knowledge of all the protocols involved, and often involve 4 or 5 steps, all very nuanced and clever. These exploits have all been immediately patched when they happen; after all, the vulnerabilities exist not in the flash loans themselves, but in whatever protocols are used in the exploit. If someone can do these exploits with flash loans, then somebody else who simply has that much money to begin with could have done the exact same thing.</p>\n\n<p>(By the way, if you’re looking for deeper and more challenging reading on flash loans, I highly recommend looking up the couple major flash loan attacks that have happened. They are extremely interesting, nuanced, and ingenious, regardless of your position on the ethics surrounding them.)</p>\n\n<p>Because the only news stories that even mention flash loans have been about the 2 or 3 big flash loan attacks, most people have only ever heard of them in the context of exploits, and thus most people associate flash loans with nothing but hacks and attacks.</p>\n\n<p>I am sure the day will come when they will be normalized, but today is not that day. One thing is sure though: they can’t be de-invented. The cat is out of the box. As long as there are DeFi protocols willing to support flash loans and DeFi users willing to use them, then they will be forever available to anyone willing to take the plunge.</p>\n\n<p>Anyway, this is getting atrociously long, so I will end it here. I hope you enjoyed the read, and that it has left you as intrigued by (and as uncomfortable with) the idea of flash loans as I am!</p>\n\n<p>EDIT: Many commenters have mentioned something very valid that I forgot to include. You must pay the gas fees for the transaction, whether it succeeds or fails. These gas fees can be pretty high if there are many complicated sub-transactions. So, technically, you can lose money taking flash loans due to gas fees. You just aren&#39;t subject to liability for the loan itself, and the lender is not subject to default risk.</p>\n</div><!-- SC_ON -->",
  "score": 248,
  "permalink": "/r/CryptoCurrency/comments/pcumpk/flash_loans_a_dive_into_defis_most_bizarre/",
  "subreddit": "CryptoCurrency",
  "id": "pcumpk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Warning: Very long (but also super interesting, I promise)!\n\nWhat if I told you that you could anonymously borrow $200+ million dollars in\nthe blink of an eye without posting any collateral, and without even assuming\nany liability for the loan?\n\nThis sounds impossible on many levels, and would be an…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "警告 とても長いです（でも、超面白いですよ、約束します）!\n\nもし私が、あなたが匿名で2億ドル以上のお金を電子メールの瞬きで借りられると言ったらどうでしょう？\n瞬く間に2億ドル以上の借金ができるとしたら？\n借りられるとしたら？\n\nこれは多くのレベルで不可能に聞こえますし、また、それは...",
      "title": "フラッシュローン：DeFiの最も奇抜で、突飛で、威圧的なイノベーションに迫る。フラッシュ・ローンとその仕組みについてまだよく知らない人は、この記事を読めばきっと驚くことでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "警告。非常长（但也超级有趣，我保证）!\n\n如果我告诉你，你可以在眨眼之间匿名借到2亿多美元，而不需要在网上公布，你会怎样？\n眨眼间就能借到2亿多美元，而无需提供任何抵押品，甚至无需承担任何贷款责任？\n贷款的任何责任？\n\n这在很多方面听起来都是不可能的，而且会是一个很好的例子。",
      "title": "闪电贷款：深入了解DeFi最古怪、最离奇、最令人生畏的创新。如果你还不熟悉闪电贷款以及它们是如何运作的，这可能会让你大吃一惊。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "警告。非常長（但也超級有趣，我保證）!\n\n如果我告訴你，你可以在眨眼之間匿名借到2億多美元，而不需要在網上公佈，你會怎樣？\n眨眼間就能借到2億多美元，而無需提供任何抵押品，甚至無需承擔任何貸款責任？\n貸款的任何責任？\n\n這在很多方面聽起來都是不可能的，而且會是一個很好的例子。",
      "title": "閃電貸款：深入瞭解DeFi最古怪、最離奇、最令人生畏的創新。如果你還不熟悉閃電貸款以及它們是如何運作的，這可能會讓你大喫一驚。"
    }
  ]
}