{
  "author": "Kloppite16",
  "original_created_utc": 1644750085,
  "title": "The armed conflict in Northern Ireland is referred to in the media and by state actors on both sides as 'the Troubles'. From where is the origin of this phrase, i.e who coined it, where was it first used how did it develop into the accepted term to use to describe the conflict?",
  "created_utc": 1644762954,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;And is the moniker an attempt by one side or the other to down play the seriousness of the conflict? &amp;#39;The Troubles&amp;#39; just seems a very quaint way to describe armed conflict where there was bombs and assassinations going on throughout the conflict.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/srg9m7/the_armed_conflict_in_northern_ireland_is/",
  "subreddit": "AskHistorians",
  "id": "srg9m7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "And is the moniker an attempt by one side or the other to down play the\nseriousness of the conflict? 'The Troubles' just seems a very quaint way to\ndescribe armed conflict where there was bombs and assassinations going on\nthroughout the conflict.",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "また、この呼称は、どちらか一方が軽視しようとするものなのでしょうか？\n紛争の深刻さは？トラブル」というのは、非常に古風な表現に思えます。\n爆弾や暗殺が行われていた武力紛争を表現しています。\nを、ずっと続けています。",
      "title": "北アイルランドの武力紛争は、メディアや双方の国家権力者によって「トラブル」と呼ばれている。この言葉の起源はどこにあるのでしょうか。つまり、誰が作ったのか、どこで最初に使われたのか、そしてどのようにしてこの紛争を表現する言葉として受け入れられるようになったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "而这个名称是否是一方或另一方试图淡化冲突的严重性？\n严肃的冲突？麻烦 \"似乎是一种非常古板的方式来描述武装冲突。\n在整个冲突过程中，有炸弹和暗杀事件发生。\n在整个冲突过程中都有炸弹和暗杀。",
      "title": "北爱尔兰的武装冲突被媒体和双方的国家行为者称为 \"麻烦\"。这个短语的起源是什么，即谁创造了它，它在哪里被首次使用，它是如何发展成为描述冲突的公认术语的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "而這個名稱是否是一方或另一方試圖淡化衝突的嚴重性？\n嚴肅的衝突？麻煩 \"似乎是一種非常古板的方式來描述武裝衝突。\n在整個衝突過程中，有炸彈和暗殺事件發生。\n在整個衝突過程中都有炸彈和暗殺。",
      "title": "北愛爾蘭的武裝衝突被媒體和雙方的國家行爲者稱爲 \"麻煩\"。這個短語的起源是什麼，即誰創造了它，它在哪裏被首次使用，它是如何發展成爲描述衝突的公認術語的？"
    }
  ]
}