{
  "author": "TheIndulgery",
  "the_new_excerpt": "This is in response to this post from yesterday\n[https://www.reddit.com/r/stocks/comments/m71xi8/a_month_of_tracking_stock_scrapers_for/]\n\n\n\nI should have expected it but it didn't occur to me until it started happening,\nbut too many people being in the sheet at the same time locked it up to…",
  "original_created_utc": 1616082280,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这是对昨天这个帖子的回应\n[https://www.reddit.com/r/stocks/comments/m71xi8/a_month_of_tracking_stock_scrapers_for/]\n\n\n\n我应该预料到的，但直到它开始发生，我才想到。\n但太多的人在同一时间的表锁定了... ...",
      "title": "昨天(03/17/21)的股票搜刮器分析的后续工作。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是對昨天這個帖子的迴應\n[https://www.reddit.com/r/stocks/comments/m71xi8/a_month_of_tracking_stock_scrapers_for/]\n\n\n\n我應該預料到的，但直到它開始發生，我纔想到。\n但太多的人在同一時間的表鎖定了... ...",
      "title": "昨天(03/17/21)的股票搜刮器分析的後續工作。"
    }
  ],
  "title": "Followup to the Stock Scraper Analysis from yesterday (03/17/21)",
  "created_utc": 1616102591,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is in response <a href=\"https://www.reddit.com/r/stocks/comments/m71xi8/a_month_of_tracking_stock_scrapers_for/\">to this post from yesterday</a></p>\n\n<p>&#x200B;</p>\n\n<p>I should have expected it but it didn&#39;t occur to me until it started happening, but too many people being in the sheet at the same time locked it up to where most people got errors. I was sending out copies of the sheet but with hundreds of DMs it was getting to be too much to keep up with. I&#39;m interested in presenting this in a way that people can access all the want without it locking up, but although I&#39;m an expert with Excel I don&#39;t know Python and don&#39;t have any experience auto-publishing stuff online. If anyone can help with that let me know!</p>\n\n<p>&#x200B;</p>\n\n<p>Meanwhile, the most common question I got was how I interpret data so I will give examples from today&#39;s data below. Keep in mind that none of this is a clear &quot;buy me!!&quot; flashing light, it&#39;s just how I interpret the data. I&#39;ve been getting 10% - 15% returns on about 80% of my picks. The indicators convinced me to buy UWMC, ASO, ASRT, RMBL, CVR, SJR, and AMD within the last week. Of all of them the only one I lost money on was RMBL, the rest all sold at a profit.</p>\n\n<p>&#x200B;</p>\n\n<p>So what am I looking at today? Before I go into the criteria, here&#39;s what the data has shown my so far. This could change after another few weeks of tracking, but as of right now it says:</p>\n\n<ol>\n<li>The social media platform that is the most successful in picking stocks is Reddit</li>\n<li>Tickers with a Reddit score of 500 or under have been the most likely to go green in the next week</li>\n<li>The average % return for those categories is 15%</li>\n<li>The average days until it hits max profit is 6 days</li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p><strong>All that being said, here&#39;s the criteria I look for:</strong></p>\n\n<ol>\n<li>Using Unbias data I copy/paste all the Reddit data for the last 24 hours into my excel sheet</li>\n<li>From there I filter it down to just items with a score under 500</li>\n<li>I have a column that calculates the % increase between yesterday and today so I sort it by % return</li>\n<li>I filter out anything that has already had more than 5% growth. Those aren&#39;t necessarily bad buys, I just want the full 15% as often as I can get it</li>\n<li>I enter each ticker into the Reddit search and manually get rid of anything that isn&#39;t a real ticker (sometimes the scraper picks up repeated things that look like tickers but are just phrases)</li>\n<li>I note any ticker that is being mentioned across at least 4 different subs. I&#39;m looking for stocks that are getting mentioned all over, not just multiple times in 1 sub</li>\n<li>I filter out anything that looks like it&#39;s just bots posting all over the place</li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p>From there I try narrow it down to 3 - 5 that I feel the best about. Keep in mind I&#39;m trading 100% on sentiment, so I don&#39;t do any DD on the company itself. My assumption is that if a lot of people are talking about it then they&#39;ve done all the DD for me, I just have to follow the crowd and jump on the band wagons that are just starting to move. The strategy has worked pretty well, as of today I&#39;m up about 22% since starting this.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>How do I put it to use?</strong></p>\n\n<ol>\n<li>I spread the money evenly across 3 - 5 of the tickers that just feel the best to me.</li>\n<li>I hold for no longer than a week. I sell somewhere between 10% and 15%, but if it hits 7 days I sell no matter what. Usually I sell after 5 business days, but sometimes I&#39;ll hold a week. If I take a loss I take a loss, but usually I&#39;m up</li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p>So what are my picks today? These are the ones I&#39;m going to look into. I have no idea what will pop and what I&#39;ll choose, but these are the ones I&#39;m most curious about based on today&#39;s data. I don&#39;t know if they&#39;re good or not, don&#39;t know anything about the companies - only that they fit into the categories that are the most profitable in the spreadsheet</p>\n\n<p>&#x200B;</p>\n\n<p>EDIT: The post was deleted due to mentioning some stocks that it didn&#39;t like, <a href=\"https://imgur.com/gallery/XwhkLWP\">so here&#39;s a screenshot of the ones I&#39;ll be considering today.</a> Most likely I&#39;m going to throw money evenly across the top 5</p>\n</div><!-- SC_ON -->",
  "score": 57,
  "permalink": "/r/stocks/comments/m7tn9w/followup_to_the_stock_scraper_analysis_from/",
  "subreddit": "stocks",
  "id": "m7tn9w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752819547
}