{
  "author": "thegimboid",
  "original_created_utc": 1659457618,
  "title": "On the evening before his death, George Washington read the newspapers with his secretary, Tobias Lear. What sort of stories would he have been printed in them?",
  "created_utc": 1659495925,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Tobias Lear wrote:  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;a href=\"https://www.mountvernon.org/george-washington/facts/washington-stories/tobias-lear-tells-the-tale-of-washingtons-death/\"&gt;In the evening the Papers were brought from the Post Office, and he sat in the parlour, with Mrs Washington &amp;amp; myself reading them till about nine o’clock—when Mrs W. went up into Mrs Lewis’ room, who was confind in Child bed, and left the General &amp;amp; myself reading the papers. He was very chearful, and when he met with anything interesting or entertaini[n]g, he read it aloud as well as his hoarseness would permit him. He requested me to read to him the debates of the Virginia Assembly on the election of a Senator and a Governor; and on hearing Mr Madison’s observations respecting Mr Monroe, he appeared much affected and spoke with some degree of asperity on the subject; which I endeavoured to moderate, as I always did on such occasions.&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Clearly he read about the Virginia Assembly, but what newspapers would have been readily available at Mount Vernon in December 1799, and what &amp;quot;interesting or entertaining&amp;quot; things could Washington have been reading aloud?&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;A separate, but related follow-up question. Since Lear obviously stayed into the evening, did he currently reside inside the Mount Vernon mansion when Washington died? If so, is it known &lt;a href=\"https://www.mountvernon.org/the-estate-gardens/the-mansion/the-mansion-room-by-room/\"&gt;which bedroom was his?&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/AskHistorians/comments/weg597/on_the_evening_before_his_death_george_washington/",
  "subreddit": "AskHistorians",
  "id": "weg597",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Tobias Lear wrote:\n\n> In the evening the Papers were brought from the Post Office, and he sat in the\n> parlour, with Mrs Washington & myself reading them till about nine\n> o’clock—when Mrs W. went up into Mrs Lewis’ room, who was confind in Child\n> bed, and left the General & myself reading the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Tobias Lear さんが書き込みました。\n\n> 夕方、新聞が郵便局から運ばれてきて、彼はその部屋に座った。\n> 9時頃まで読んでいました。\n> W夫人がルイス夫人の部屋へ行くと、ルイス夫人は子供部屋に閉じこもっていた。\n> その時、W夫人は、子供と一緒に寝ているルイス夫人の部屋に行き、将軍と私が本を読むままにした。",
      "title": "死の前夜、ジョージ・ワシントンは秘書のトビアス・リアと新聞を読んでいた。彼はそこにどんな記事を載せていたのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "托比亚斯-李尔写道。\n\n> 晚上，报纸从邮局送来，他坐在客厅里，和华盛顿夫人及我一起阅读。\n> 他坐在客厅里，与华盛顿夫人和我一起阅读这些文件，直到大约九点\n> 这时，W夫人走到刘易斯夫人的房间，她正躺在儿童床上。\n> 这时，W夫人走进刘易斯夫人的房间，她正躺在孩子的床上，只留下将军和我在看这些书。",
      "title": "在他去世的前一天晚上，乔治-华盛顿与他的秘书托比亚斯-李尔一起阅读报纸。他在其中会刊登什么样的故事呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "托比亞斯-李爾寫道。\n\n> 晚上，報紙從郵局送來，他坐在客廳裏，和華盛頓夫人及我一起閱讀。\n> 他坐在客廳裏，與華盛頓夫人和我一起閱讀這些文件，直到大約九點\n> 這時，W夫人走到劉易斯夫人的房間，她正躺在兒童牀上。\n> 這時，W夫人走進劉易斯夫人的房間，她正躺在孩子的牀上，只留下將軍和我在看這些書。",
      "title": "在他去世的前一天晚上，喬治-華盛頓與他的祕書托比亞斯-李爾一起閱讀報紙。他在其中會刊登什麼樣的故事呢？"
    }
  ]
}