{
  "author": "dangercat415",
  "the_new_excerpt": "Hey gang\n\nI sold my company in December and would love your advice.\n\nBasically I sold i for about $750k but it's all based on earn-outs on the\ncompanies future revenue. I don't have to do anything other than just receive\nchecks for the next 4 years.\n\nI have a promissory note for the value but I'd…",
  "original_created_utc": 1621995686,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Hey gang\n\n12月に会社を売却したのですが、皆さんのアドバイスが欲しいです。\n\n基本的に私は75万ドルで会社を売却しましたが、それはすべて会社の将来の収益に対する獲得報酬に基づいています。\n会社の将来の収益に基づいています。私は今後4年間、小切手を受け取る以外に何もする必要はありません。\n今後4年間は小切手を受け取るだけで、何もする必要はありません。\n\nその金額の約束手形を持っていますが、私は...",
      "title": "会社を$750kで売却しましたが、それは将来の収益に基づいた約束手形です。現在の価値に見合ったローンを組むにはどうしたらよいでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，大家好\n\n我在12月出售了我的公司，希望得到你们的建议。\n\n基本上，我以大约75万美元的价格出售了我的公司，但这都是基于对公司未来收入的收益分配。\n公司未来的收入。我不需要做任何事情，只需要在未来4年内收到\n未来4年的支票。\n\n我有一张价值不菲的承兑汇票，但我想...",
      "title": "以75万美元出售我的公司，但它是基于未来收入的承兑汇票--我现在如何为该价值获得贷款？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，大家好\n\n我在12月出售了我的公司，希望得到你們的建議。\n\n基本上，我以大約75萬美元的價格出售了我的公司，但這都是基於對公司未來收入的收益分配。\n公司未來的收入。我不需要做任何事情，只需要在未來4年內收到\n未來4年的支票。\n\n我有一張價值不菲的承兌匯票，但我想...",
      "title": "以75萬美元出售我的公司，但它是基於未來收入的承兌匯票--我現在如何爲該價值獲得貸款？"
    }
  ],
  "title": "Sold my company for $750k but it's a promissory note based on future revenue - how do I get a loan for the value now?",
  "created_utc": 1622016113,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey gang</p>\n\n<p>I sold my company in December and would love your advice. </p>\n\n<p>Basically I sold i for about $750k but it&#39;s all based on earn-outs on the companies future revenue.  I don&#39;t have to do anything other than just receive checks for the next 4 years.</p>\n\n<p>I have a promissory note for the value but I&#39;d like some more of the money up front.</p>\n\n<p>I have some bills to catch up on and some things I&#39;d like to buy (like maybe a house).</p>\n\n<p>I talked to my bank and it&#39;s not something they do.</p>\n\n<p>Any advice here on how I should proceed?</p>\n</div><!-- SC_ON -->",
  "score": 75,
  "permalink": "/r/investing/comments/nl640m/sold_my_company_for_750k_but_its_a_promissory/",
  "subreddit": "investing",
  "id": "nl640m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197388316
}