{
  "author": "feygay",
  "original_created_utc": 1650273718,
  "title": "Before desegregation, did people believe that Heaven was segregated?",
  "created_utc": 1650284228,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Okay, it&amp;#39;s a really weird question, I know. And I hope I&amp;#39;m in the right sub to ask.&lt;/p&gt;\n\n&lt;p&gt;But the other day I was listening to the audiobook of &amp;quot;Little House In The Big Woods&amp;quot; by Laura Ingalls Wilder, and she recalled her father playing a tune on his fiddle with some lyrics about a Black man that ended with saying that he &amp;quot;went to where all good d-rkies go&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;I guess I was taken aback a little when I heard, so it got me pondering this, wondering if this was literal, just a turn of phrase. Wondering what that meant to someone who would say that. I looked up the phrase (&amp;quot;where all the good blank go&amp;quot;) and I found only a few results. Most of them came from archives of old newspapers, so it seems like it was a real phrase used with some frequency at least in the late 1800&amp;#39;s. I even saw it used in relation to a real man, which I think is a little significant.&lt;/p&gt;\n\n&lt;p&gt;So does the phrase originate from a real idea white people had about the afterlife back then? Or is it just a phrase people threw around without thinking about it? (Perhaps a mixture of both?)&lt;/p&gt;\n\n&lt;p&gt;And just to reiterate: the most important question here is, did people believe that the Christian afterlife was different for people depending on their race? Not necessarily the etymology of that specific phrase (though if anyone knows that would be cool, too)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/u68xuh/before_desegregation_did_people_believe_that/",
  "subreddit": "AskHistorians",
  "id": "u68xuh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Okay, it's a really weird question, I know. And I hope I'm in the right sub to\nask.\n\nBut the other day I was listening to the audiobook of \"Little House In The Big\nWoods\" by Laura Ingalls Wilder, and she recalled her father playing a tune on\nhis fiddle with some lyrics about a Black man that ended…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、本当に奇妙な質問だと思います。このような質問をしていいのでしょうか？\nと聞きます。\n\nしかし、先日、オーディオブックの「大きな家の小さな家」を聴いていたのですが\nローラ・インガルス・ワイルダーの「森」で、父親がある曲を演奏しているのを思い出したそうです。\n彼のバイオリンには黒人の歌詞があり、その歌詞は...",
      "title": "人種差別撤廃の前、人々は天国が隔離されていると信じていたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，这是个非常奇怪的问题，我知道。我希望我是在正确的次\n问。\n\n但是有一天，我在听《大森林里的小房子》的有声书。\n的有声读物，她回忆起她的父亲用小提琴演奏了一首曲子，其中有几句关于一个人的歌词。\n她记得她父亲用他的小提琴演奏了一首曲子，其中有一些关于黑人的歌词，最后...",
      "title": "在取消种族隔离之前，人们是否相信天堂是被隔离的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，這是個非常奇怪的問題，我知道。我希望我是在正確的次\n問。\n\n但是有一天，我在聽《大森林裏的小房子》的有聲書。\n的有聲讀物，她回憶起她的父親用小提琴演奏了一首曲子，其中有幾句關於一個人的歌詞。\n她記得她父親用他的小提琴演奏了一首曲子，其中有一些關於黑人的歌詞，最後...",
      "title": "在取消種族隔離之前，人們是否相信天堂是被隔離的？"
    }
  ]
}