{
  "author": "Monster_Chief17",
  "the_new_excerpt": "For those that want a crash course on ETH and want to know why so many of us\npurchase it and use it, here is the most beginner-friendly explanation I could\ncome up with.\n\n\nWHAT IS ETHEREUM?\n\nIn short, Ethereum is a global, open-source platform for decentralized\napplications. On Ethereum, you can…",
  "original_created_utc": 1610457103,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "对于那些想了解ETH速成课程，并想知道为什么我们有这么多的人。\n购买并使用它，这里是我能找到的最适合初学者的解释。\n想出。\n\n\n什么是Ethereum？\n\n简而言之，Ethereum是一个全球性的、开源的去中心化的平台。\n应用。在Ethereum上，你可以...",
      "title": "什么是Ethereum？为什么是Ethereum？Ethereum是怎样的？您需要在五分钟内了解的一切。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於那些想了解ETH速成課程，並想知道爲什麼我們有這麼多的人。\n購買並使用它，這裏是我能找到的最適合初學者的解釋。\n想出。\n\n\n什麼是Ethereum？\n\n簡而言之，Ethereum是一個全球性的、開源的去中心化的平臺。\n應用。在Ethereum上，你可以...",
      "title": "什麼是Ethereum？爲什麼是Ethereum？Ethereum是怎樣的？您需要在五分鐘內瞭解的一切。"
    }
  ],
  "title": "What is Ethereum? Why is Ethereum? How is Ethereum? Everything you need to know in five minutes or less.",
  "created_utc": 1610502909,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For those that want a crash course on ETH and want to know why so many of us purchase it and use it, here is the most beginner-friendly explanation I could come up with.</p>\n\n<h1><strong>What is Ethereum?</strong></h1>\n\n<p>In short, Ethereum is a global, open-source platform for decentralized applications. On Ethereum, you can write code that controls digital value, runs exactly as programmed, and is accessible anywhere in the world. If there was no Ethereum, there would be no DeFi (yet) because Bitcoin gave us programmable money, but Ethereum gave us smart contracts that make your money even more programmable. Every movement you make in real life is just a series of smart contracts executed in the correct order and that is exactly what Ethereum will do to our economy, finance, education, and everything else that can be improved with smart contracts. Someone somewhere right now is building a decentralized business from scratch on this network. 10 years ago this couldn&#39;t be done.</p>\n\n<h1><strong>Why is Ethereum?</strong></h1>\n\n<p>To truly decentralize all aspects of our society we will need a framework that ensures trust among participants. Without smart contracts, two parties can not interact securely with each other without a third-party service ensuring both participants get their share of the deal. Today, if you use an escrow service, you don&#39;t need to trust the other participant in that transaction but you do need to trust the escrow service provider. With smart contracts and a tokenized economy, you could simply transfer a tokenized version of your asset to your neighbor or a stranger on the internet in exchange for a certain amount of crypto. A smart contract would make sure that your tokenized asset is transferred to the other participant as soon as they make the payment. If you apply this same principle to public transportation, supply chains, and the economy in general, there is a lot of need for an Ethereum-like platform so that should explain why Ethereum is.</p>\n\n<h1><strong>How is Ethereum?</strong></h1>\n\n<p>The whole existence of the ETH network is a product of distributed governance and security. Miners all around the world secure the network with their hash power and the network pays them in transaction fees that are generated. Since almost every interaction with the network is considered a transaction, and the hash rate isn&#39;t following the exponential price growth, these transactions have become a problem for most of us that use the ETH network on a daily basis. This means that we will need layer 2 solutions like Matic and xDai. These solutions operate as sidechains for Ethereum and aim to provide a much cheaper space for big ecosystems like Decentralized Finance which is growing at a very rapid pace. For all of this to work, we will need efficient bridges that can send your Ethereum-based tokens to these sidechains. During the course of 2021 we should see more hype around DeFi and L2 solutions IF the integration goes well and gets completed fast enough. And if you are confused about why would projects build Dapps on ETH and not some faster and cheaper solution like EOS you should know that serious projects value security and no one can compete with ETH in that race except Bitcoin. The miners have spoken and at the end of the day that will be the only number that matters because no one wants to use an insecure network. So how is Ethereum? It&#39;s doing fine but it could be a lot better.</p>\n\n<p>TLDR: If you invested in Ethereum and don&#39;t know what you actually bought here it is:</p>\n\n<ul>\n<li><p>ETH is not the only smart contract platform but it is the most secure one.</p></li>\n<li><p>ETH makes sure you don&#39;t get scammed when transacting value with unknown parties.</p></li>\n<li><p>ETH enabled DeFi to exist.</p></li>\n<li><p>There are a lot of potential &quot;Ethereum killers&quot; out there but the number of users on the ETH network tells a very different story. Uniswap alone attracts <a href=\"https://dappradar.com/rankings/protocol/ethereum\">more daily users</a> than all Dapps combined on EOS.</p></li>\n</ul>\n\n<p>PS. I know that all of this sounds like no project will ever be able to compete with Ethereum but that&#39;s simply not the case. If the fees keep going up and L2 solutions don&#39;t come soon enough some projects may be forced to migrate to other chains. There is a slim chance of this happening IMO but it sure is a possibility.</p>\n</div><!-- SC_ON -->",
  "score": 502,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/IXvhq-nzAz9sP_z__J9hKsYnvTB8MbPqyTHdgYCrTEY.jpg?auto=webp&s=d3ee23750a88c9e786c496b2c28f4be9a7ecefff",
          "width": 1200,
          "height": 630
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/IXvhq-nzAz9sP_z__J9hKsYnvTB8MbPqyTHdgYCrTEY.jpg?width=108&crop=smart&auto=webp&s=c8878c97ca2093f87e9b712379326d7d43deea73",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/IXvhq-nzAz9sP_z__J9hKsYnvTB8MbPqyTHdgYCrTEY.jpg?width=216&crop=smart&auto=webp&s=c72af0c59d43d65ec878548193c606814292492a",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/IXvhq-nzAz9sP_z__J9hKsYnvTB8MbPqyTHdgYCrTEY.jpg?width=320&crop=smart&auto=webp&s=9114f2d313f3f598e6c8fe3eb5a1cda54c0897cb",
            "width": 320,
            "height": 168
          },
          {
            "url": "https://external-preview.redd.it/IXvhq-nzAz9sP_z__J9hKsYnvTB8MbPqyTHdgYCrTEY.jpg?width=640&crop=smart&auto=webp&s=4759b0354186e9350727b560152656b35c506782",
            "width": 640,
            "height": 336
          },
          {
            "url": "https://external-preview.redd.it/IXvhq-nzAz9sP_z__J9hKsYnvTB8MbPqyTHdgYCrTEY.jpg?width=960&crop=smart&auto=webp&s=d8f79f3b1a0a2da9ad68984af0c8d9b72ded1974",
            "width": 960,
            "height": 504
          },
          {
            "url": "https://external-preview.redd.it/IXvhq-nzAz9sP_z__J9hKsYnvTB8MbPqyTHdgYCrTEY.jpg?width=1080&crop=smart&auto=webp&s=a771bb810fabe362ba044ff2f31e66a8f5f02290",
            "width": 1080,
            "height": 567
          }
        ],
        "variants": {},
        "id": "CsU2jkVfGyEbOR340OZh7s2RZsuNehMa7Ux8NIPU594"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/kvre5l/what_is_ethereum_why_is_ethereum_how_is_ethereum/",
  "subreddit": "CryptoCurrency",
  "id": "kvre5l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706376237
}