{
  "author": "AffectionateMind26",
  "original_created_utc": 1636773138,
  "title": "Realistically, what are you going to buy when you get enough profits from your Crypto portfolio?",
  "created_utc": 1636796299,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Well, we all joke about getting a lambo when our Crypto portfolio skyrockets. \nBut realistically, what are you going to buy, or would you keep hodling this money?</p>\n\n<p>For me,\nI am into filmmaking. 5 years ago, through an initial investment in this business, I was able to buy a good camera and editing setup at the time.</p>\n\n<p>But to upgrade from this one, I will need a huge sum of money. </p>\n\n<p>What do I have?\nCurrently I have 2015 Macbook Pro, Panasonic Camera 4k, a small Office/editing setup.\n(Usually I rent out the equipments I require for specific shoots)</p>\n\n<p>What do I need?\nMacBook M1 Max, Sony A7Siii with all the lenses, Mavic pro Cine Drone, a bigger editing setup and a good size studio (on rent)</p>\n\n<p>Total investment required - $15K +</p>\n\n<p>So whenever my crypto portfolio moons, I will probably DCA into all my requirements. </p>\n\n<p>I can definitely buy everything right now with what I have invested in Crypto. But I am being patient and I will hodl my portfolio until its sufficient.</p>\n\n<p>Tell me what would you buy or do with your profits?</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/CryptoCurrency/comments/qsrzdv/realistically_what_are_you_going_to_buy_when_you/",
  "subreddit": "CryptoCurrency",
  "id": "qsrzdv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Well, we all joke about getting a lambo when our Crypto portfolio skyrockets.\nBut realistically, what are you going to buy, or would you keep hodling this\nmoney?\n\nFor me, I am into filmmaking. 5 years ago, through an initial investment in this\nbusiness, I was able to buy a good camera and editing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号ポートフォリオが急上昇したら、ランボを買おうと誰もが冗談で言っていますよね。\nしかし現実的には、何を買うつもりなのか、それともこのお金を貯め続けるのか？\nお金を貯め続けますか？\n\n私の場合は、映画製作が趣味です。5年前、このビジネスへの初期投資を通じ\n5年前、このビジネスへの初期投資によって、良いカメラと編集機器を購入することができました...",
      "title": "現実的には、Cryptoポートフォリオから十分な利益が得られたら、何を購入するつもりですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，我们都开玩笑说，当我们的加密货币投资组合暴涨时，我们会得到一辆兰博。\n但现实中，你会买什么，还是会继续使用这些钱？\n钱？\n\n对我来说，我喜欢电影制作。5年前，通过对这个行业的初始投资\n业务，我能够购买一个好的相机和编辑......",
      "title": "现实地说，当你从你的加密货币投资组合中获得足够的利润时，你打算买什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，我們都開玩笑說，當我們的加密貨幣投資組合暴漲時，我們會得到一輛蘭博。\n但現實中，你會買什麼，還是會繼續使用這些錢？\n錢？\n\n對我來說，我喜歡電影製作。5年前，通過對這個行業的初始投資\n業務，我能夠購買一個好的相機和編輯......",
      "title": "現實地說，當你從你的加密貨幣投資組合中獲得足夠的利潤時，你打算買什麼？"
    }
  ]
}