{
  "author": "nobjos",
  "the_new_excerpt": "Preamble: The ability of Congress Members to trade stocks have been\ncontroversial from the start. The 2020 congressional insider trading scandal\n[https://en.wikipedia.org/wiki/2020_congressional_insider_trading_scandal] where\nCongress Members used insider knowledge to trade large positions in stocks…",
  "original_created_utc": 1620824027,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "プリアンブル 議員が株式を売買することについては、当初から議論の余地がありました。\n最初から議論の的になっていました。2020年の議会のインサイダー取引スキャンダル\n[https://en.wikipedia.org/wiki/2020_congressional_insider_trading_scandal] ここでは\n議員がインサイダーの知識を利用して株式の大規模なポジションを取引していた...",
      "title": "私は、過去2年間に米国議会議員が行った9000以上のトレードを分析し、S&P500に対してベンチマークを行いました。その結果は以下の通りです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "序言。国会议员进行股票交易的能力一直是\n从一开始就有争议。2020年的国会内幕交易丑闻\n[https://en.wikipedia.org/wiki/2020_congressional_insider_trading_scandal] 其中\n国会议员利用内幕知识交易大量股票头寸...",
      "title": "我分析了美国国会议员在过去两年中进行的9000多笔交易，并以标普500指数为基准。以下是结果。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "序言。國會議員進行股票交易的能力一直是\n從一開始就有爭議。2020年的國會內幕交易醜聞\n[https://en.wikipedia.org/wiki/2020_congressional_insider_trading_scandal] 其中\n國會議員利用內幕知識交易大量股票頭寸...",
      "title": "我分析了美國國會議員在過去兩年中進行的9000多筆交易，並以標普500指數爲基準。以下是結果。"
    }
  ],
  "title": "I analyzed 9000+ trades made by U.S Congress Members in the last two years and benchmarked it against S&P500. Here are the results.",
  "created_utc": 1620846739,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Preamble:</strong> The ability of Congress Members to trade stocks have been controversial from the start. The 2020 congressional <a href=\"https://en.wikipedia.org/wiki/2020_congressional_insider_trading_scandal\">insider trading scandal</a> where Congress Members used insider knowledge to trade large positions in stocks just before the coronavirus pandemic crash was just one example where they used their privileged position for gain.  While there is scope for a lot of discussion regarding the legality/ethical aspects of this, what I wanted to know is </p>\n\n<p><strong>Did Congress Members beat the market and can I beat the market if I follow their trades after its been made public?</strong> </p>\n\n<p><strong>Where is the data from:</strong> senatestockwatcher.com</p>\n\n<p>Massive shoutout to <a href=\"/u/rambat1994\">u/rambat1994</a> for putting in the efforts to create this site and make the knowledge public. The website has data of Senator trading from 2019. While I could observe that all the trades may not be captured by the site, given that we have more than 9K trades to work with, I feel that we should be good from a statistical significance perspective. Also, please note that the data will contain trades done by Congress who are not currently in the senate (Either they were in Senate earlier and now in the house of representative or another position of power which forces them to disclose their trades) </p>\n\n<p>While Congress members are supposed to <a href=\"https://www.citizen.org/article/personal-financial-disclosure-requirements-for-public-officials/\">report the transaction within 30 days</a>, the median delay in reporting that I observed for the trades was 28 days and the average delay was 52 days. There were some outliers that pushed the average up and are most likely due to the fact that their broker might not report the trade to them immediately. </p>\n\n<p>All the trades and my analysis are shared as a google sheet at the end. </p>\n\n<p><strong>Analysis:</strong></p>\n\n<p><strong>Distribution of Trades</strong></p>\n\n<p><a href=\"https://preview.redd.it/kh4ythn8roy61.png?width=410&amp;format=png&amp;auto=webp&amp;s=c054d4e698ab159a8b4fdd3cdaa88e8a3ea2fb43\">  </a></p>\n\n<p>A total of 9,676 trades were made by the Congress Members in the past two years. This analysis would be focusing on the stock purchases made the Congress. (The stock sales and the pandemic controversy can be a standalone analysis by itself). Out of the 4,911 Buy’s what I am really interested in is the 1,375 transactions which were over $15K. I decided this cutoff as I did not want small transactions (&lt;5K) to affect the analysis. The hypothesis being that if someone is putting almost 10% of their annual salary into one trade, they should be very confident about the stock. (I know that some Congress members are millionaires and this hypothesis would not apply to them, but adding their net worth would again complicate the calculations unnecessarily)</p>\n\n<p><strong>Results:</strong> For all the stock purchases I calculated the stock price change across 3 periods and benchmarked it against S&amp;P500 returns during the same period. </p>\n\n<p>a. One Month </p>\n\n<p>b. One Quarter </p>\n\n<p>c. Till Date (From the date of purchase to Today)</p>\n\n<p><strong>Returns of Congress Members vs S&amp;P500</strong></p>\n\n<p><a href=\"https://preview.redd.it/j5lejvpdroy61.png?width=624&amp;format=png&amp;auto=webp&amp;s=4edea1cb42cac7ecab4e9e6c5b034ace5d9ac566\">https://preview.redd.it/j5lejvpdroy61.png?width=624&amp;format=png&amp;auto=webp&amp;s=4edea1cb42cac7ecab4e9e6c5b034ace5d9ac566</a></p>\n\n<p>At this point, it should not come as a surprise, but Congress members did beat SP500 across the different time periods. But what I am really interested in is if it&#39;s possible to follow their trades after disclosure (after a time lag of 30 days) and still beat the benchmark. </p>\n\n<p><strong>Returns if you followed their trades</strong></p>\n\n<p><a href=\"https://preview.redd.it/rnuw3kyhroy61.png?width=624&amp;format=png&amp;auto=webp&amp;s=84ea3a1ab53fd502a2968939891bd11e9da84c8a\">https://preview.redd.it/rnuw3kyhroy61.png?width=624&amp;format=png&amp;auto=webp&amp;s=84ea3a1ab53fd502a2968939891bd11e9da84c8a</a></p>\n\n<p>If you had invested in the stocks Congress Members bought, even after adjusting for the lag of disclosure, you would beat SP500 over the long run. My theory for this is that Senators usually play the long game and invest having a time horizon of more than a year as sudden short-term gains can put a spotlight on their trades. This gives the retail investors a window of opportunity where they can follow the trades and make a significant profit. </p>\n\n<p>Now that our main question is out of the way, we can really deep dive into the data and see some interesting patterns. The next question I wanted answered was which were the best trades made by Congress Members over the last 2 years. </p>\n\n<p><strong>Best trades made by U.S Congress Members</strong>  </p>\n\n<p><a href=\"https://preview.redd.it/0xatcb5rroy61.png?width=624&amp;format=png&amp;auto=webp&amp;s=d157bba30bcd309db66bd51ababcf36e7c76710c\"> </a></p>\n\n<p>Brian Mast seems to be the frontrunner with making almost 100% gain in one month investing in lesser-known companies. Michael Garcia also seems to have made it rain with his Tesla plays. But not all the trades made by Congress Members were successful as shown below. </p>\n\n<p><strong>Worst trades made by U.S Congress Members</strong></p>\n\n<p><a href=\"https://preview.redd.it/dfsg5lksroy61.png?width=624&amp;format=png&amp;auto=webp&amp;s=83c41517d7299e6b62cbd6dfa1bbdf42a672d750\">  </a></p>\n\n<p>These are the worst trades made by Congress Members with Greg losing more than 80% of investment value within the disclosure period. Brain Mast also makes an appearance in the worst trades making him a prime candidate for some WSB loss porn.  </p>\n\n<p>But even Warren Buffet can go wrong on a stock pick. So, I wanted to know was who made the most returns over all their investments in the last 2 years. I only considered Congress Members having at least $100K in investments and a minimum of 5 trades. </p>\n\n<p><strong>U.S Congress Members having the highest returns</strong>  </p>\n\n<p><a href=\"https://preview.redd.it/7yk3wa4wroy61.png?width=624&amp;format=png&amp;auto=webp&amp;s=9ad6ae5de91e6ec8ade045378e72983dee356b0c\">  </a></p>\n\n<p>John Curtis made a whopping 95% average return on his investments. All the top 10 Congress Members comfortably beat the market return of 26.4% during the same investment period. Next thing I looked is the Congress Members that had the most amount of money invested in stocks during the last 2 years.</p>\n\n<p><strong>U.S Congress Members having the highest amount invested in stocks</strong></p>\n\n<p><a href=\"https://preview.redd.it/x4vb26xxroy61.png?width=624&amp;format=png&amp;auto=webp&amp;s=c34019c2a724babc40a9823ec513e7a69e562aaf\">https://preview.redd.it/x4vb26xxroy61.png?width=624&amp;format=png&amp;auto=webp&amp;s=c34019c2a724babc40a9823ec513e7a69e562aaf</a></p>\n\n<p>The top 3 Congress Members as shown above invested more than $15MM over the last 2 years and were also able to beat the market at the same time.</p>\n\n<p>Finally, this leads us to the last question of which were the most popular stocks among U.S Congress Members </p>\n\n<p><strong>Most popular stocks among US Congress</strong></p>\n\n<p><a href=\"https://preview.redd.it/t4vv63s1soy61.png?width=624&amp;format=png&amp;auto=webp&amp;s=327b56f8cbfff8465b09e797272a45ccde46429c\">  </a></p>\n\n<p>As expected, big tech dominates the investments but what was surprising was the skew of investment towards Microsoft which had more money invested in it than the rest of the top 9 put together. One important thing to note here is that except for Antero, the rest all the companies have $100B+ valuation. </p>\n\n<p><strong>Limitations of analysis:</strong> There are multiple limitations to the analysis.</p>\n\n<p>a. The time period of analysis is 2 years on which the market experienced a significant bull run. So, the results might change in market downturn/recession </p>\n\n<p>b. The data has been sourced from senatestockwatcher.com as parsing the data from the official government site is extremely difficult. All the recorded transactions have a pdf of the disclosure linked to it (you can find it in the Google sheet). I have made my best effort to QC the data and make sure there are no false positives. But this might not contain all the transactions made by Congress Members. </p>\n\n<p>c. There is no disclosure for the exact amount of money invested by Congress Members. The disclosure is always in ranges (e.g., $100k – $200k). So, for calculating the investment amount, I have taken the average of the given range. </p>\n\n<p><strong>Conclusion:</strong> </p>\n\n<p>This analysis proves that Congress Members indeed get a better return than the overall market. Whether it is due to insider trading or due to their superior stock-picking capability is something that can’t be proven from the data and is left to the reader&#39;s judgment. I intentionally left out the party affiliation of the Congress Members as I felt that it would bias the reader and was not the objective of this analysis.</p>\n\n<p>Whichever side of the political spectrum you lean-to, the above analysis shows that you get to gain by following their trades!  </p>\n\n<p>Link to Google Sheet containing all the analysis and trades: <a href=\"https://docs.google.com/spreadsheets/d/1Rg5jMYG-X4I7cidQylzCNc_UpJZGNhGrjAt7g0QkXYs/edit?usp=sharing\">here</a></p>\n\n<p><em>Disclaimer: I am not a financial advisor</em></p>\n</div><!-- SC_ON -->",
  "score": 3395,
  "permalink": "/r/wallstreetbets/comments/nanynr/i_analyzed_9000_trades_made_by_us_congress/",
  "subreddit": "wallstreetbets",
  "id": "nanynr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620986000160
}