{
  "author": "pale_blue_dots",
  "the_new_excerpt": "Don't feel embarrassed or dejected or hopeless about sharing your\nopinion/voice/ideas, people. Your voice matters. Being cynical about this is\nself-fulfilling and defeatist - there's no harm commenting. (Edit: was thinking\nabout \"no harm commenting\" and that may not be compeltely accurate if you're…",
  "original_created_utc": 1609799938,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "不要因为分享你的信息而感到尴尬、沮丧或绝望\n意见/声音/想法，人们。你的声音很重要。对此持愤世嫉俗态度是\n自我实现和失败主义--发表评论没什么坏处。(编辑：正在思考\n关于“无伤大雅的评论”，如果你是…，这可能不是绝对准确的",
      "title": "今天是对加密货币相关法规发表评论的最后一天--该法规只有15天的评论时间，而不是60天。别让这成为一种自我实现的失败主义态度.与人们的普遍看法相反，你的声音很重要。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不要因爲分享你的信息而感到尷尬、沮喪或絕望\n意見/聲音/想法，人們。你的聲音很重要。對此持憤世嫉俗態度是\n自我實現和失敗主義--發表評論沒什麼壞處。(編輯：正在思考\n關於“無傷大雅的評論”，如果你是…，這可能不是絕對準確的",
      "title": "今天是對加密貨幣相關法規發表評論的最後一天--該法規只有15天的評論時間，而不是60天。別讓這成爲一種自我實現的失敗主義態度.與人們的普遍看法相反，你的聲音很重要。"
    }
  ],
  "title": "Today is the LAST day to make comments on the cryptocurrency related regulation - of which had only 15 days for comments instead of 60 days. Don't let this be a self-fulfilling, defeatist-attitude thing... your voice, contrary to popular belief, matters.",
  "created_utc": 1609870338,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Don&#39;t feel embarrassed or dejected or hopeless about sharing your opinion/voice/ideas, people. Your voice <em>matters.</em> Being cynical about this is self-fulfilling and defeatist - <em>there&#39;s no harm commenting.</em> <strong>(Edit: was thinking about &quot;no harm commenting&quot; and that may not be compeltely accurate if you&#39;re not wanting to let the <em>gubmint</em> know you are interested in the space/cryptocurrency, but there are probably multiple other ways &quot;they&quot; already know; anyway, use a different name and VPN if you&#39;re worried about it)</strong> This is what democracy is about. If you/we don&#39;t exercise the right, it very well may disintegrate before our/your very eyes.  </p>\n\n<p>Take five or fewer minutes to write a little something - it may actually make a big difference. </p>\n\n<p>Some ideas: </p>\n\n<ul>\n<li><p>Short commenting period is undemocratic </p></li>\n<li><p>Short commenting period for something so complex doesn&#39;t make any sense</p></li>\n<li><p>This is about freedom and liberty</p></li>\n<li><p>This is about something bigger than all of us; separation of <del>church</del>money and state/government</p></li>\n<li><p>You have read about andor have family members who use remittance services and it&#39;s saved them lots of money/time/heartache (or if not using blockchain how it&#39;s <em>hurt</em> them)</p></li>\n<li><p>Economically speaking blockchain increases efficiency</p></li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/kqjwpo/today_is_the_last_day_to_make_comments_on_the/",
  "subreddit": "CryptoCurrency",
  "id": "kqjwpo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100746074
}