{
  "author": "Jon32492",
  "original_created_utc": 1660794423,
  "title": "Is it appropriate to give my doctor a gift?",
  "created_utc": 1660835182,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;TL;DR: Dr saved me and my wife. How do I show my appreciation?&lt;/p&gt;\n\n&lt;p&gt;Last year about this time, my wife (31F) and I (30M) sorta had the scare of our lives when I went to or family doctor with belly pains. I had been having the pain for a couple of days (they were booked the day I called), but the night before actually going to my appointment, I had a rather large bowl movement and the pain eased off. I considered skipping the appointment cause I figured it was just constipation, but the wife insisted. I think it was the NP that first asked me questions and then she got the Dr to examine me. I told them both it was probably just constipation and I feel fine now. I feel like most Drs I’ve heard about would have left it at that and just said “call me if it gets any worse.” But he wanted to examine me and afterwards he said he’s worried about my appendix and insists I go for imaging right away. The Dr and staff got an order over to imaging right away and told me to go straight there, no detour. About an hour after imaging, drs office called me back and told me to go to the ER immediately. They’ve already called ahead and got a doctor there ready to perform an emergency appendectomy. I get there and the surgery team rushed me in and got it done. The surgeon said my appendix was “angry”.&lt;/p&gt;\n\n&lt;p&gt;I’ve told the Dr thanks a couple of times for finding it and have told a few others how I think he saved my life.&lt;/p&gt;\n\n&lt;p&gt;Now he’s done it again, this time with my wife. She had sudden stabbing pains in her chest one night and we actually went to the local ER (not the same one that did my surgery). The ER ran tests and imaging and all sorts of stuff. As I was talking to family about it, a few of them mentioned gallstones so I asked the ER Dr about it. He said “No, I don’t think it’s gallstones.” He said it was skeletal-muscular pain and she’ll be fine with a little rest and muscle relaxer. Two days later she’s still having these sort of spasms of pain and now seems jaundiced, so she goes to our primary. The NP asks her a bunch of questions and then goes for the Dr. After an exam, he sends her straight for imaging and found that her common bile duct was blocked. Told us to go to the ER and that she’ll likely need surgery to remove her gallbladder. We had a little trouble with reception at the ER but after a quick call to our Dr office, they were able to clear it up for us. In the hospital, and now obviously jaundiced, they confirmed there was some infection and there was a large gallstone blocking her duct and several smaller stones inside the gallbladder. They put her on IV antibiotics and got her in for surgery the next day. &lt;/p&gt;\n\n&lt;p&gt;Now he seems to have saved both our lives. One might say he’s just doing his job but I feel like I’ve heard a lot of stories of Drs ignoring patient concerns and sending them home with no answers. I feel like I should do something to show our appreciation. Is it appropriate to buy him a gift? What about his NP and their staff? What sort of gift?&lt;/p&gt;\n\n&lt;p&gt;Thanks for reading and for your input.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/wr94sy/is_it_appropriate_to_give_my_doctor_a_gift/",
  "subreddit": "NoStupidQuestions",
  "id": "wr94sy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "TL;DR: Dr saved me and my wife. How do I show my appreciation?\n\nLast year about this time, my wife (31F) and I (30M) sorta had the scare of our\nlives when I went to or family doctor with belly pains. I had been having the\npain for a couple of days (they were booked the day I called), but the…"
}