{
  "author": "Megajin_",
  "the_new_excerpt": "Hello,\n\nI want to make it clear from the start that I am not a professional financial\nadvisor. Everything I am about to write has come from my own research. You\nshould cross check everything and make your own decision on what you will do\nwith this information.\n\nDISCLAIMER: This is not going to be a…",
  "original_created_utc": 1612344789,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你好啊\n\n我想从一开始就说明，我不是一个专业的金融\n顾问： 我将要写的一切都来自于我自己的研究。你\n审时度势，自作主张\n与这些信息。\n\n声明：这不会是一个... ...",
      "title": "零碳锂--富含锂元素--不破坏环境!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好啊\n\n我想從一開始就說明，我不是一個專業的金融\n顧問： 我將要寫的一切都來自於我自己的研究。你\n審時度勢，自作主張\n與這些信息。\n\n聲明：這不會是一個... ...",
      "title": "零碳鋰--富含鋰元素--不破壞環境!"
    }
  ],
  "title": "ZERO CARBON LITHIUM - Rich through lithium - without environmental damage!",
  "created_utc": 1612373188,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello,</p>\n\n<p>I want to make it clear from the start that I am not a professional financial advisor. Everything I am about to write has come from my own research. You should cross check everything and make your own decision on what you will do with this information.</p>\n\n<p>DISCLAIMER: This is not going to be a PUMP &amp; DUMP. I don&#39;t want to achieve that either. I report here because I am convinced of the idea and the company!</p>\n\n<p><strong>What is it about?</strong></p>\n\n<p>I&#39;ve been watching an interesting company since December 2020 that advertises with the following slogan: &quot;We exist to decarbonize the currently high carbon production footprint of lithiumion batteries used in electric vehicles.&quot; The company is called Vulcan Energy Resources[1].</p>\n\n<p>ISIN: AU0000066086</p>\n\n<p>WKN: A2PV3A</p>\n\n<p><strong>How did you find the company?</strong></p>\n\n<p>I became aware of the company because I see that there is a trend towards sustainable investing[2]. So I started looking for a company that appealed to me. At some point I came across an article that a project was underway to extract lithium without damaging the environment[3]. Gripped by the topic, I spent several days trying to find out what was going on and what it was all about.</p>\n\n<p><strong>What about sustainability?</strong></p>\n\n<p>ZERO CARBON LITHIUM: The project is called Zero Carbon Lithium[4] and is being driven by Vulcan Energy Resources as mentioned above. The current main way to extract and refine lithium, from hard rock mines, will emit about 1.05 billion tons of CO2 to produce the amount of lithium needed to electrify all the world&#39;s passenger cars. Unlike current lithium extraction methods, Zero Carbon Lithium will have virtually no impact on the public or the environment. That means no large open pit mines, no large, unsightly, water-guzzling evaporation ponds, or process plants that run on fossil fuels.</p>\n\n<p>After reading that, I was hooked for now. But not yet ready to invest. Moreover, the share was still a penny stock at the time. That was too risky for me. So I looked weekly to see if something is about to happen.</p>\n\n<p><strong>The Decision:</strong></p>\n\n<p>Investing based on an idea is never a good idea, so I took a close look at the company and the idea:</p>\n\n<ol>\n<li>Since I already had a bad experience once, with such a young idea, I first looked how often and how well information is published[5]. Surprisingly, it is published diligently and everything fits so far. ✔</li>\n<li>Publishing is one thing, the other is whether there is something behind it. Since listed companies have a disclosure obligation, it is easy to see whether the figures from the Investor Centre correspond to those on the stock exchange[6]. ✔</li>\n<li>Financially, you can&#39;t do an analysis á la Warren Buffet here. The company is still young, and has a lot to invest. Nevertheless, I took a look at what is going on. Quick Analysis: More assets than liabilities ✔. Equity consistently increased ✔. Cash flow and net income: naturally in the red due to the investments ✖. More does not make sense here, as said value investing does not work here.</li>\n<li>Vulcan operates a lot of geothermal plants and is familiar with the matter. So there is internal and independent expertise in geothermal and lithium on site for project execution[7]. ✔</li>\n<li>Location - the right market, compelling supply-demand dynamics: being at the center of the European lithium ion battery industry is a major advantage for a semi-bulk product. Europe will be the world&#39;s fastest-growing lithium ion battery production center in the 2020s, with no local supply of lithium hydroxide.[7] ✔</li>\n<li>Positive framework study: world-leading industry experts in lithium extraction and geothermal energy are behind the first study of its kind, which provides a solid foundation for the start of feasibility studies planned soon.[7] ✔</li>\n<li>I understood how the process works and read the feasibility study.Not only lithium is extracted but also other rare metals[9]. ✔</li>\n</ol>\n\n<p>If you go through my sources with interest, you will see that there is a very solid basis behind the project. But what was the deciding point for me to invest was the fact that Vulcan intentionally requested a trading halt while they were conducting the study to prevent wild speculation. This happened once in January2021[9] and once now around February 2021[10]. I got in in January because that was a sign to me that Vulcan was serious.</p>\n\n<p>In addition, Vulcan gave a presentation to the EU Commission, with positive feedback. Vulcan has signed a binding agreement with the EU-funded EIT InnoEnergy as part of the Business Investment Platform (BIP) of the European Battery Alliance (EBA) initiative of the European Commission. This agreement is expected to significantly accelerate the momentum of Vulcan&#39;s Zero Carbon Lithium project. The project is located in Germany, at the center of the fastest growing lithium market in the world: the European battery industry for electric vehicles [11].</p>\n\n<p><strong>What&#39;s in store for the future?</strong></p>\n\n<p>I can&#39;t see into the future, of course, but I am sure that with this project electric vehicles will gain significant momentum. Also, the EU would be more independent and I personally like that a lot. In addition, there is no need to dry salt lakes or make bad environmental cuts like in other countries. I also see it critically that we consume here, and in mines at the other end of the world people have to work life-threatening for our luxury.</p>\n\n<p><strong>Is $VUL the next $GME?</strong></p>\n\n<p>Please, this is not a comparison. This is about the environment and the future of next generations. I am against PUMP&amp;DUMP! If you are convinced of a company you invest and don&#39;t gamble!</p>\n\n<p><strong>Is now the right time?</strong></p>\n\n<p>I do not know. You have to decide that for yourself. I am invested myself in the meantime, because I am convinced of the idea therefore I will hold the share also with fluctuations. I got in at ~4.00 - 5.00€.</p>\n\n<p>Sources:</p>\n\n<p>[1] Vulcan Energy Resources: <a href=\"https://v-er.com/\">https://v-er.com/</a></p>\n\n<p>[2] Sustainable Investing Trend: <a href=\"https://www.morganstanley.com/ideas/sustainability-investing-institutional-asset-owners\">https://www.morganstanley.com/ideas/sustainability-investing-institutional-asset-owners</a></p>\n\n<p>[3] Lithium Geothermal energy: <a href=\"https://www.electrive.net/2020/06/15/lithium-gewinnung-aus-geothermie-anlagen-in-deutschland/\">https://www.electrive.net/2020/06/15/lithium-gewinnung-aus-geothermie-anlagen-in-deutschland/</a></p>\n\n<p>[4] Zero Carbon Lithium: <a href=\"https://v-er.com/zero-carbon-lithium/\">https://v-er.com/zero-carbon-lithium/</a></p>\n\n<p>[5] Vulcan Investor Centre: <a href=\"https://v-er.com/investor-centre/\">https://v-er.com/investor-centre/</a></p>\n\n<p>[6] Yahoo Finance VUL: <a href=\"https://de.finance.yahoo.com/quote/6KO.F/financials?p=6KO.F\">https://de.finance.yahoo.com/quote/6KO.F/financials?p=6KO.F</a></p>\n\n<p>[7] Vulcan Facts: <a href=\"https://www.geothermie.de/bibliothek/lexikon-der-geothermie/v/vulkan-energy-firma.html\">https://www.geothermie.de/bibliothek/lexikon-der-geothermie/v/vulkan-energy-firma.html</a></p>\n\n<p>[8] Vulcan Positive Pre Feasibility Study: <a href=\"https://vul.live.irmau.com/site/PDF/6a9c79d2-5c99-40d7-ba32-72cd6ea3a6f6/PositivePreFeasibilityStudy\">https://vul.live.irmau.com/site/PDF/6a9c79d2-5c99-40d7-ba32-72cd6ea3a6f6/PositivePreFeasibilityStudy</a></p>\n\n<p>[9] Trading Halt January2021: <a href=\"https://vul.live.irmau.com/site/PDF/e5371199-d0f8-4d91-82b1-f7e1ed7ebae6/TradingHalt\">https://vul.live.irmau.com/site/PDF/e5371199-d0f8-4d91-82b1-f7e1ed7ebae6/TradingHalt</a></p>\n\n<p>[10] Trading Halt February 2021: <a href=\"https://vul.live.irmau.com/site/PDF/492bcfbd-6157-4aec-8542-f6641341578f/TradingHalt\">https://vul.live.irmau.com/site/PDF/492bcfbd-6157-4aec-8542-f6641341578f/TradingHalt</a></p>\n\n<p>[11] Vulcan signs with EU: <a href=\"https://finfeed.com/small-caps/juniors/vul-signs-agreement-with-eu-backed-body-to-drive-the-vulcan-zero-carbon-lithium-project/\">https://finfeed.com/small-caps/juniors/vul-signs-agreement-with-eu-backed-body-to-drive-the-vulcan-zero-carbon-lithium-project/</a></p>\n</div><!-- SC_ON -->",
  "score": 59,
  "permalink": "/r/investing/comments/lbjzfp/zero_carbon_lithium_rich_through_lithium_without/",
  "subreddit": "investing",
  "id": "lbjzfp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518534794
}