{
  "author": "dragondude4",
  "original_created_utc": 1636405521,
  "title": "The Difference Between Being Rich and Wealthy: Why buying a Lambo Would Be a Terrible Decision.",
  "created_utc": 1636443053,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>“If you don’t find a way to make money while you sleep, you will work until you die.”</em></p>\n\n<p>— Warren Buffett</p>\n\n<p>The saddest thing to see is people who “are rich” spending way more than they earn and end up losing all their money. They spend their riches on material things, such as cars, homes and watches, that allow them to let everyone around them know how successful they are. There are multiple studies that show that people who happen upon a large sum of money very quickly are likely to lose it all. There are probably thousands of lucky crypto investors too who mooned and lost it all. </p>\n\n<p>Contrast that with people who concentrate on accumulating wealth. These people are focused not on how others view them, but on what their money can provide them via peace of mind and security. Their goal is to save, invest and accumulate wealth not to impress anyone, but to achieve financial independence so they can enjoy the benefits of accumulating wealth, which can include a stress-free retirement, the ability to be philanthropic, the ability to take care of family or the ability to travel and create experiences. They understand that material things are fleeting and that their “stuff” has no lasting value.</p>\n\n<p>Wealthy people amass assets and making their money for them. Buying a Lambo if your crypto moons is a terrible financial decision. You’d want to secure yourself with a financial safety net first and then figure out how to make passive income. Only once I’m making so much money through passive income that I don’t know what to do with it anymore, I might spoilt myself a bit ;)</p>\n</div><!-- SC_ON -->",
  "score": 214,
  "permalink": "/r/CryptoCurrency/comments/qpn6yz/the_difference_between_being_rich_and_wealthy_why/",
  "subreddit": "CryptoCurrency",
  "id": "qpn6yz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "“If you don’t find a way to make money while you sleep, you will work until you\ndie.”\n\n— Warren Buffett\n\nThe saddest thing to see is people who “are rich” spending way more than they\nearn and end up losing all their money. They spend their riches on material\nthings, such as cars, homes and watches,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"寝ている間にお金を稼ぐ方法 \"を見つけないと、死ぬまで働くことになる。\n死ぬまで働くことになる。\"\n\n- ウォーレン・バフェット\n\n一番悲しいのは、\"お金持ち \"の人が、稼いだお金以上のものを使って\n稼いだお金以上に使ってしまい、結局すべてのお金を失ってしまうことです。彼らはその金持ちを物質的なものに使い\n車や家、時計などの物質的なものにお金を使いますが",
      "title": "お金持ちと富裕層の違い。なぜランボを買うのは最悪の決断なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"如果你不找到一个在睡觉时赚钱的方法，你将工作到死。\n亡。\"\n\n- 沃伦-巴菲特\n\n最悲哀的事情是那些 \"富有 \"的人花的钱比他们赚的钱多得多。\n而最终失去所有的钱。他们把自己的财富花在物质\n物质，如汽车、房屋和手表，...",
      "title": "富有和富有之间的区别。为什么购买兰博是一个可怕的决定？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"如果你不找到一個在睡覺時賺錢的方法，你將工作到死。\n亡。\"\n\n- 沃倫-巴菲特\n\n最悲哀的事情是那些 \"富有 \"的人花的錢比他們賺的錢多得多。\n而最終失去所有的錢。他們把自己的財富花在物質\n物質，如汽車、房屋和手錶，...",
      "title": "富有和富有之間的區別。爲什麼購買蘭博是一個可怕的決定？"
    }
  ]
}