{
  "author": "jed_dowling",
  "original_created_utc": 1628658368,
  "title": "Did I buy ETH for $1700 in late July? No. Did I buy ETH for $3100 last night? Yes",
  "created_utc": 1628671105,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Annoyed about missing the bottom? Don&#39;t worry, odds are that many other people are too.</p>\n\n<p>Look, I was stupid. During the last dip, prices kept going lower and there was a lot of fear around that we were going into another crypto winter. I was scared too and chose not to buy. I know that there are many people on here who felt the same way.</p>\n\n<p>Now, did others time it exactly right and buy? Probably. No good comes from focussing on people who were more successful than you though and we can&#39;t dwell on missed opportunities. They are chances to learn and yet another sign that dollar cost averaging is the best way to approach crypto trading. Sometimes it can just be really hard to practice what you preach. You&#39;ve got to be optimistic though. There are still like 7 billion people who don&#39;t even understand crypto.</p>\n</div><!-- SC_ON -->",
  "score": 440,
  "permalink": "/r/CryptoCurrency/comments/p26e7j/did_i_buy_eth_for_1700_in_late_july_no_did_i_buy/",
  "subreddit": "CryptoCurrency",
  "id": "p26e7j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Annoyed about missing the bottom? Don't worry, odds are that many other people\nare too.\n\nLook, I was stupid. During the last dip, prices kept going lower and there was a\nlot of fear around that we were going into another crypto winter. I was scared\ntoo and chose not to buy. I know that there are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ボトムを外して悔しい？安心してください、他の多くの人も\nもいます。\n\nいいですか、私は愚かでした。前回の下落局面では、価格は下がり続け、その間に多くの恐怖がありました。\n暗号の冬がやってくるのではないかと恐れられていました。私も怖かったです。\n私も怖くて買わなかった。私が知っているのは...",
      "title": "私は7月下旬にETHを1700ドルで購入しましたか？いいえ 昨晩 ETHを3100ドルで買いましたか？はい。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为错过底部而苦恼？别担心，其他许多人也有可能这样做。\n也是如此。\n\n看，我很傻。在上一次下跌中，价格不断走低，而且有很多人担心我们会进入另一次下跌。\n很多人担心我们将进入另一个加密货币的冬天。我当时也很害怕\n我也害怕，所以选择不买。我知道，有...",
      "title": "我在7月底以1700美元买入ETH吗？我昨晚是否以3100美元买了ETH？是的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲錯過底部而苦惱？別擔心，其他許多人也有可能這樣做。\n也是如此。\n\n看，我很傻。在上一次下跌中，價格不斷走低，而且有很多人擔心我們會進入另一次下跌。\n很多人擔心我們將進入另一個加密貨幣的冬天。我當時也很害怕\n我也害怕，所以選擇不買。我知道，有...",
      "title": "我在7月底以1700美元買入ETH嗎？我昨晚是否以3100美元買了ETH？是的"
    }
  ]
}