{
  "author": "dripincode",
  "original_created_utc": 1628007360,
  "title": "I built a website that allows you to virtually travel through 50+ cities around the world while listening to local radio and moving through different climatic conditions.",
  "created_utc": 1628077045,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I created <a href=\"https://walkwithfeel.vercel.app/\">Walk with Feel</a>, a website that allows you to explore more than 50+ cities around the world. It has the feature of listening to the local radio of the different cities, you can also change the different locations around the city and explore different weather conditions. If you want me to add any city do let me know, I will make this open source as soon as I refactor my code. Hope you guys enjoy it!!</p>\n\n<p><a href=\"https://walkwithfeel.vercel.app/\">https://walkwithfeel.vercel.app/</a></p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->",
  "score": 9,
  "permalink": "/r/SideProject/comments/ox6tjb/i_built_a_website_that_allows_you_to_virtually/",
  "subreddit": "SideProject",
  "id": "ox6tjb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I created Walk with Feel [https://walkwithfeel.vercel.app/], a website that\nallows you to explore more than 50+ cities around the world. It has the feature\nof listening to the local radio of the different cities, you can also change the\ndifferent locations around the city and explore different…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はWalk with Feel [https://walkwithfeel.vercel.app/]というウェブサイトを作りました。\n世界の50以上の都市を探索することができます。このサイトの特徴は\n各都市のローカル・ラジオを聴くことができ、また、都市の様々な場所を変えて、異なる...\nまた、都市の様々な場所を変えて、様々な都市を探索することもできます。",
      "title": "私は、世界の50以上の都市を、現地のラジオを聴きながら、異なる気候条件の中を移動しながらバーチャルに旅することができるウェブサイトを作りました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我创建了 \"与感觉同行\"[https://walkwithfeel.vercel.app/]，这个网站\n允许你探索世界上超过50个城市。它有一个特点\n聆听不同城市的当地广播，你也可以改变城市周围的不同地点并探索这些地方。\n你还可以改变城市周围的不同地点，探索不同的城市。",
      "title": "我建立了一个网站，让你在听着当地广播和在不同的气候条件下移动时，虚拟地穿越世界上50多个城市。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我創建了 \"與感覺同行\"[https://walkwithfeel.vercel.app/]，這個網站\n允許你探索世界上超過50個城市。它有一個特點\n聆聽不同城市的當地廣播，你也可以改變城市周圍的不同地點並探索這些地方。\n你還可以改變城市周圍的不同地點，探索不同的城市。",
      "title": "我建立了一個網站，讓你在聽着當地廣播和在不同的氣候條件下移動時，虛擬地穿越世界上50多個城市。"
    }
  ]
}