{
  "author": "ryzen124",
  "original_created_utc": 1645663880,
  "title": "Can you criticize abusive capitalist companies for labor practices while still using their products or working for them?",
  "created_utc": 1645724783,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Is it hypocritical or logically fallacious to criticize the bad treatment of the labor force by let’s say Amazon and still work for Amazon or purchase items from Amazon? Or criticize Facebook while using Facebook? I often hear on social media the argument that if you hate it then why are you using their products or working there. What’s the fault in their reasoning?&lt;/p&gt;\n\n&lt;p&gt;If it is not logically fallacious or hypocritical, is it morally wrong? Like driving gasoline while advocating for electric cars?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/szx6p7/can_you_criticize_abusive_capitalist_companies/",
  "subreddit": "askphilosophy",
  "id": "szx6p7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Is it hypocritical or logically fallacious to criticize the bad treatment of the\nlabor force by let’s say Amazon and still work for Amazon or purchase items from\nAmazon? Or criticize Facebook while using Facebook? I often hear on social media\nthe argument that if you hate it then why are you using…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "の待遇の悪さを批判するのは偽善か、論理的に間違っているのか。\n例えばアマゾンが労働力を提供しているにもかかわらず、アマゾンで働いたり、アマゾンの商品を買ったりしている。\nアマゾンは？あるいは、Facebookを使いながらFacebookを批判する？ソーシャルメディア上でよく聞くのは\n嫌いならなぜ使っているんだ、という論調。",
      "title": "あなたは、虐待的な資本主義企業の労働慣行を批判しながら、その企業の製品を使用したり、その企業のために働いたりすることができますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "批评亚马逊公司对劳动力的恶劣待遇，却仍然为亚马逊公司工作或购买商品，这是否虚伪或逻辑上的谬误？\n比如说亚马逊对劳动力的恶劣待遇，却仍然为亚马逊工作或从亚马逊购买商品，这是否是一种虚伪或逻辑错误？\n亚马逊？或者在使用Facebook时批评Facebook？我经常在社交媒体上听到\n争论说，如果你讨厌它，那么你为什么要使用......",
      "title": "你能在使用他们的产品或为他们工作的同时，批评滥竽充数的资本主义公司的劳工行为吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "批評亞馬遜公司對勞動力的惡劣待遇，卻仍然爲亞馬遜公司工作或購買商品，這是否虛僞或邏輯上的謬誤？\n比如說亞馬遜對勞動力的惡劣待遇，卻仍然爲亞馬遜工作或從亞馬遜購買商品，這是否是一種虛僞或邏輯錯誤？\n亞馬遜？或者在使用Facebook時批評Facebook？我經常在社交媒體上聽到\n爭論說，如果你討厭它，那麼你爲什麼要使用......",
      "title": "你能在使用他們的產品或爲他們工作的同時，批評濫竽充數的資本主義公司的勞工行爲嗎？"
    }
  ]
}