{
  "author": "throwaway1234yeawow",
  "original_created_utc": 1647796532,
  "title": "What's up with older people asking if I have a girlfriend?",
  "created_utc": 1647812248,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Really I don&amp;#39;t fucking get it. Every time I&amp;#39;m at a party or a family gathering or whatever it&amp;#39;s always the first question I hear right after they ask about my age and when I tell them that I don&amp;#39;t have anyone they&amp;#39;re somehow dissatisfied with my answer and they keep asking in disbelief. I never get this shit from my peers, it&amp;#39;s always people around my parents age or older. I kinda get it when it&amp;#39;s my grandparents or close family but it&amp;#39;s still frustrating. I&amp;#39;m sure there&amp;#39;s alot more interesting things than my relationship status.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/tipufr/whats_up_with_older_people_asking_if_i_have_a/",
  "subreddit": "NoStupidQuestions",
  "id": "tipufr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Really I don't fucking get it. Every time I'm at a party or a family gathering\nor whatever it's always the first question I hear right after they ask about my\nage and when I tell them that I don't have anyone they're somehow dissatisfied\nwith my answer and they keep asking in disbelief. I never get…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "本当に理解できないんです。パーティーや家族の集まりのたびに\nを聞かれた直後の最初の質問なんです。\n年齢を聞いて、相手がいないことを伝えると、何となく不満そうな顔をする。\nと、信じられないような質問をされます。私は決して...",
      "title": "年上の人に「彼女いるんですか」って聞かれるのってどうなの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "真的，我他妈的不明白。每次我在一个聚会或家庭聚会上\n或其他什么场合，我听到的第一个问题总是紧接着他们问起我的年龄。\n当我告诉他们我没有任何人时，他们就会对我的年龄感到不满意。\n他们对我的回答不满意，并继续不相信地问。我从来没有得到...",
      "title": "老年人问我是否有女朋友是怎么回事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "真的，我他媽的不明白。每次我在一個聚會或家庭聚會上\n或其他什麼場合，我聽到的第一個問題總是緊接着他們問起我的年齡。\n當我告訴他們我沒有任何人時，他們就會對我的年齡感到不滿意。\n他們對我的回答不滿意，並繼續不相信地問。我從來沒有得到...",
      "title": "老年人問我是否有女朋友是怎麼回事？"
    }
  ]
}