{
  "author": "thiaaa",
  "original_created_utc": 1626443618,
  "title": "We built a successful pre-launch campaign on zero budget.",
  "created_utc": 1626457037,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Recently I&#39;ve been working with my friend on a pre-launch campaign for his app startup. I thought it was pretty interesting, and wanted to share some insights from my experience. Buckle up for a lengthy post!</p>\n\n<h1>Why Pre-Launch?</h1>\n\n<p>One of the key things in <em>good</em> marketing is to get people to know about your product. The key to <em>successful</em> marketing is to get the <strong>right</strong> people to know about your product. So that was our main goal — to utilise the right platforms to reach our desired audience and pull in potential users.</p>\n\n<p>A pre-launch campaign was the perfect. We could...</p>\n\n<ul>\n<li>gather excitement and raise <strong>awareness</strong>;</li>\n<li>start <strong>accumulating content</strong> steadily on our pages; and</li>\n<li><strong>build</strong> <strong>rapport</strong> with potential users.</li>\n</ul>\n\n<h1>How We Built Our Pre-Launch Campaign</h1>\n\n<h2>Landing page: Direct your audience</h2>\n\n<p>The first thing we did was set up a landing page. This is one of the basic but essential things to do for your product. Whatever we put on social media as promotion, we&#39;d link to this page. How the landing page was created is a story for my friend to tell, but the short answer is he followed advice from <a href=\"https://landingpage.fyi/landing-page-checklist.html\">this site</a>, and these are some key elements he made sure to include:</p>\n\n<ul>\n<li>Features list and descriptions</li>\n<li>Explainer video</li>\n<li>Privacy Policy</li>\n<li>Waitlist sign up form</li>\n<li>Links to our social media</li>\n</ul>\n\n<p>I&#39;d like to include a blog section and nest our podcast website here in the future as well; this landing page is going to become a hub for everything we do going forward. That&#39;s the power of a designated website for your product — the audience and users will know to come here for information and updates whenever they need it.</p>\n\n<h2>Instagram: Give a visual overview</h2>\n\n<p>Instagram was also a no-brainer. Almost everybody uses Instagram nowadays, or at least knows it&#39;s a huge social media platform. Compared to Facebook, it&#39;s <strong>visually appealing</strong>.</p>\n\n<p>With one scroll through your Instagram profile, your visitors get an overall feel for your brand&#39;s style, as well as information of your product broken down into individual posts. These are the kinds of posts we made on our Instagram:</p>\n\n<ul>\n<li>Introduction</li>\n<li>Explainer video (15-second clip)</li>\n<li>Important dates (launch, countdowns)</li>\n<li>Feature explainers</li>\n<li>User-oriented content (see top left post)</li>\n</ul>\n\n<p>There&#39;s the aesthetic element as well — we kept to our colour palette and design. And you&#39;ve got to admit, an informative, nice-looking Instagram page can&#39;t do any wrong for your brand.</p>\n\n<h2>Reddit: Connect with niche communities</h2>\n\n<p>I personally use Reddit on a regular basis. I love how it splits up into many subreddits that are dedicated to a particular topic, like <a href=\"/r/marketing\">r/marketing</a> and <a href=\"/r/uxdesign\">r/uxdesign</a>. The user base is also huge.</p>\n\n<p>After I identified the ones right for us, I made a couple posts that were <strong>mainly based on our experience working on the product</strong> (since self-promotion is usually banned) and lightly mentioned it at the end.</p>\n\n<p>Granted, this isn&#39;t the most efficient marketing strategy. It takes time and effort to write down your experiences and attract readers, and this isn&#39;t even direct marketing material. But you can <strong>share your story</strong>. Your product needs a story so that the audience can feel its authenticity.</p>\n\n<p>And doing this on Reddit means it&#39;s easier to see reactions and interact with people who have read it. For a new and upcoming product, any feedback that you can get is everything. I know that my friend made a few connections through talking to people who replied to his posts, and I thought it was simply mind-blowing.</p>\n\n<h2>Medium: Blog your process</h2>\n\n<p>My friend also wrote blog posts to publish on Medium. He talked about his app&#39;s design process, which garnered the interest of an editor from Bootcamp (a publication by the UX Collective on Medium), and got the article posted there.</p>\n\n<p>It was a really cool moment for us, and we got more views thanks to this! I think the notion of writing about your experience is valuable to anyone starting out, so we&#39;ll be doing more of this in the future as well.</p>\n\n<h2>LinkedIn: Create a professional profile</h2>\n\n<p>To be frank, our LinkedIn page was made for our team to say we worked here. LinkedIn is <em>the</em> platform for pretty much anything business. There is probably no other site for a better professional online presence and for making business connections; sooner or later you&#39;d need one anyway.</p>\n\n<p>However, it&#39;s not a platform for lots of self-promotion; ideally, LinkedIn content is <strong>informative and resourceful</strong>. You want to make your product known, but not at the expense of getting a bad rep.</p>\n\n<p>I&#39;d say that making a decent LinkedIn page with one or two posts to <strong>establish your presence</strong> would be enough at the pre-launch stage. There&#39;s time to develop more original content in the future.</p>\n\n<h2>Twitter: Build your brand personality</h2>\n\n<p>If LinkedIn is the top choice for a professional online presence, I daresay that Twitter is the top choice for a casual one — though I think it takes a bit of practice to get used to the post formats.</p>\n\n<p>Still, Twitter is great because it:</p>\n\n<ul>\n<li>has an enormous user base;</li>\n<li>lets us communicate with users quickly; and</li>\n<li>build our brand personality.</li>\n</ul>\n\n<p>What I mean for the last point is, you don&#39;t have to write in &quot;marketer&quot; tones all the time in your tweets. I see the character limit as a test of flair; how can you stand out in this sea of mini-blogs? We&#39;re still working on our &quot;voice&quot;, but we&#39;re definitely here for the long run.</p>\n\n<h2>Email: Stay in touch</h2>\n\n<p>When all&#39;s said and done (the ads have been placed, the app has been launched), you need a solid medium to bridge the connection between you and your users. Of course, the above platforms are all viable options for communication, but <strong>emails are the most reliable</strong>.</p>\n\n<p>There&#39;s a delicate balance to be maintained with email marketing: you can&#39;t send too many, and you can&#39;t send too little. Thus far, I&#39;ve only sent two emails to users:</p>\n\n<ul>\n<li><strong>Thank-you</strong> message for signing up</li>\n<li>Note about our <strong>social media</strong> (see above picture).</li>\n</ul>\n\n<p>Going forward, my email plans will only be:</p>\n\n<ul>\n<li>Monthly newsletters</li>\n<li>Product updates</li>\n<li>Essential notifications (e.g. changes in Privacy Policy)</li>\n</ul>\n\n<p>I&#39;d include an &quot;unsubscribe&quot; option, of course, but I really want to strive for an email campaign that users will appreciate. The key to that, I believe, is <strong>bite-size, informative content</strong> distributed at a <strong>spaced out</strong> schedule. If it&#39;s promotional, <strong>keep it short</strong>.</p>\n\n<h2>Side note: Make an editorial calendar</h2>\n\n<p>As you can see, we&#39;ve used a variety of platforms to conduct our pre-launch campaign. If you are considering doing all of that as well, <em>please</em> make an editorial calendar or content manager to <strong>organise all the copy and visuals</strong>!</p>\n\n<p>Because one thing that I didn&#39;t realise until I started getting overwhelmed was that every post I made on each platform was very different. Twitter has its character limit, Instagram needs captions and pictures, and we had to change the writing tone for LinkedIn and Reddit. The Google Doc I was using at the beginning wasn&#39;t really cutting it anymore.</p>\n\n<p>An editorial calendar, replete with all your scheduled content at a glance, will save you <em>so</em> much time and effort. I use Notion — you can use whatever suits you.</p>\n\n<h1>The Results</h1>\n\n<p>How did we do in the end? It&#39;s not huge, but it&#39;s a great start considering we started from absolutely nothing (no one to really back us up).</p>\n\n<h2>Building connections</h2>\n\n<p>We&#39;ve also been able to meet a couple interested users on Reddit! Again, we&#39;re blown away from their enthusiasm and support for the app. (DMs are open for anyone interested in getting to know what we made!) They&#39;ve also agreed to do some user testing for us so we can improve our app. We are continuously amazed by the power of online communities.</p>\n\n<h2>Growing our follower count</h2>\n\n<p>Our team shared the pre-launch campaign on our personal Instagram stories and asked our friends to help repost it. In just few days we got 100 followers and so far we’ve reached 800 accounts organically on Instagram, and we are still growing steadily. The effort will pay off!</p>\n\n<p>---</p>\n\n<p>I hope this post was able to help out anyone who&#39;s also looking to do something similar. I&#39;m open to feedback or suggestions that could have improved the campaign for future reference. In fact, please do; I&#39;ll be hanging around here for a while!</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/9bpPFR1mtXuEMp5j1DjzCqK0HGumLLyPeEOBeqCKBus.jpg?auto=webp&s=9f9b2f52feb378dd43c10390025c0a172a19e827",
          "width": 1200,
          "height": 630
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/9bpPFR1mtXuEMp5j1DjzCqK0HGumLLyPeEOBeqCKBus.jpg?width=108&crop=smart&auto=webp&s=af8c3e2d4074092ffac2eb53d9280cf122a0b9f2",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/9bpPFR1mtXuEMp5j1DjzCqK0HGumLLyPeEOBeqCKBus.jpg?width=216&crop=smart&auto=webp&s=edfb39aa3f95c2dc55e84bdf656b1be3cb14e19e",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/9bpPFR1mtXuEMp5j1DjzCqK0HGumLLyPeEOBeqCKBus.jpg?width=320&crop=smart&auto=webp&s=54f4800931459ea46cbd7952fc17c841180ab314",
            "width": 320,
            "height": 168
          },
          {
            "url": "https://external-preview.redd.it/9bpPFR1mtXuEMp5j1DjzCqK0HGumLLyPeEOBeqCKBus.jpg?width=640&crop=smart&auto=webp&s=a69392ee5217b0cfb8ff60cfd4c8524ecb38afc1",
            "width": 640,
            "height": 336
          },
          {
            "url": "https://external-preview.redd.it/9bpPFR1mtXuEMp5j1DjzCqK0HGumLLyPeEOBeqCKBus.jpg?width=960&crop=smart&auto=webp&s=b4097cb863c3dd0ab46538eb9a2bbc0c5f93832f",
            "width": 960,
            "height": 504
          },
          {
            "url": "https://external-preview.redd.it/9bpPFR1mtXuEMp5j1DjzCqK0HGumLLyPeEOBeqCKBus.jpg?width=1080&crop=smart&auto=webp&s=2115e60fe089c51c061c89dcffb51829bd414ecd",
            "width": 1080,
            "height": 567
          }
        ],
        "variants": {},
        "id": "1c3dAStbSeI18ErgI7Tlq7xCRhz0d5S3wrXThwpvEWs"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/SideProject/comments/olhaki/we_built_a_successful_prelaunch_campaign_on_zero/",
  "subreddit": "SideProject",
  "id": "olhaki",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Recently I've been working with my friend on a pre-launch campaign for his app\nstartup. I thought it was pretty interesting, and wanted to share some insights\nfrom my experience. Buckle up for a lengthy post!\n\n\nWHY PRE-LAUNCH?\n\nOne of the key things in good marketing is to get people to know about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、私は友人と一緒に彼のアプリのプレローンチキャンペーンを行っています。\nを立ち上げました。これはなかなか面白いと思ったので、いくつかのインサイトを紹介したいと思います。\n私の経験からいくつかの洞察を共有したいと思います。長文になりますが、よろしくお願いします。\n\n\nなぜプレローンチなのか？\n\n優れたマーケティングで重要なことの1つは、人々に製品のことを知ってもらうことです...",
      "title": "予算ゼロでプレローンチキャンペーンを成功させました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，我一直在与我的朋友合作，为他的应用程序开展上市前的宣传活动。\n创业公司。我认为这很有趣，并想与大家分享我的一些见解。\n我的经验。请扣好安全带，等待长篇大论\n\n\n为什么要进行预发布？\n\n好的营销的关键之一是让人们知道......",
      "title": "我们在零预算的情况下建立了一个成功的上市前活动。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，我一直在與我的朋友合作，爲他的應用程序開展上市前的宣傳活動。\n創業公司。我認爲這很有趣，並想與大家分享我的一些見解。\n我的經驗。請扣好安全帶，等待長篇大論\n\n\n爲什麼要進行預發佈？\n\n好的營銷的關鍵之一是讓人們知道......",
      "title": "我們在零預算的情況下建立了一個成功的上市前活動。"
    }
  ]
}