{
  "author": "Bitcoin1776",
  "original_created_utc": 1625236613,
  "title": "On the 4th of July Bitcoin's difficulty is to get reset, and will be free of China mining - Oddly fitting.",
  "created_utc": 1625265396,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t know if this is deserving as a stand alone post, but what the fuck, no one could have planned it better.</p>\n\n<p>For those that don&#39;t know, Bitcoin block rate is currently running 1 per 20 mins, vs 10 mins, and is set for an extreme difficulty adjustment (to speed them up).</p>\n\n<p>This will make miners more profitable, benefiting those who live in more free and equitable societies than China.</p>\n\n<p>As miners become more profitable, they either sell less coin (put them on permanent hodl, as Michael Saylor suggests), or they expand ops. Either way, this generally is expected to lead to greater price stability.</p>\n\n<p>Miners outside of China have been found to be using 56% renewable energy, per the report by Michael Saylor. As most countries favor new green energy alternatives, Bitcoin is set to continue expanding it&#39;s lead as the most green energy industry in the world, that&#39;s not exclusively focused on green energy.</p>\n\n<p>Can anyone name a single industry that&#39;s more than 50% renewable? Outside of solar, wind, and geo farms etc.? I don&#39;t think so.</p>\n\n<p>Even Tesla cars are dependent upon grid power, which in most parts of the world is less than 20% renewable, unless they come attached with a $50k solar / battery project (doubling the cost).</p>\n\n<p>So all in all - on July 4th - more Bitcoins will be moved into the freer societies than was done in the past. More Bitcoins will be mined with more sustainable, less pollutant energy, than was done in the past. Bitcoin will excel as one of the greatest stimulants of computer technology and energy efficiency optimization, including expanded use of flair gas and volcano technology, optimizing energy output in remote locations and super energization, to maximize global efficiencies.</p>\n\n<blockquote>\n<p>Super energization is a renewable issue, where one needs double the solar production vs coal, as solar must be stored, but coal is naturally &#39;batteried&#39; and can be turned off / on with demand - all renewables require hyper production, to account for the lack of ability to adjust output with demand - necessitating massive battery production or sustainable storage, which is accomplished with Bitcoin.</p>\n</blockquote>\n\n<p>So, while the market may be rocky - the start of the next cycle of Bitcoin is tops. Hold strong, and rotate assets from those that are peaking, to those that are robust.</p>\n\n<p>The roots are deep, and Bitcoin is a mighty power.</p>\n\n<h1>Hodl strong.</h1>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/Bitcoin/comments/ocbe6n/on_the_4th_of_july_bitcoins_difficulty_is_to_get/",
  "subreddit": "Bitcoin",
  "id": "ocbe6n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don't know if this is deserving as a stand alone post, but what the fuck, no\none could have planned it better.\n\nFor those that don't know, Bitcoin block rate is currently running 1 per 20\nmins, vs 10 mins, and is set for an extreme difficulty adjustment (to speed them\nup).\n\nThis will make miners…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これが独立した記事として相応しいかどうかは分かりませんが、何というか、誰もが\n誰もこれ以上の計画を立てることはできなかったでしょう。\n\n知らない人もいるかもしれませんが、ビットコインのブロックレートは現在、10分ごとではなく20分ごとに1回となっています。\n分に1回、10分に1回となっていて、極度の難易度調整が行われています。\n速くするために）設定されています。)\n\nこれにより、マイナーは...",
      "title": "7月4日、ビットコインの難易度はリセットされ、中国のマイニングから解放される - Oddly fitting."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道这是否值得作为一个独立的帖子，但他妈的，没有人可以把它计划得更好。\n没有人可以把它计划得更好。\n\n对于那些不知道的人来说，比特币区块率目前是每20分钟1个，而不是10分钟。\n分钟，而不是10分钟，并且被设定为极端困难的调整（以加快它们的速度\n加速）。)\n\n这将使矿工...",
      "title": "7月4日，比特币的难度将得到重置，并将摆脱中国的挖矿--奇怪的是。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道這是否值得作爲一個獨立的帖子，但他媽的，沒有人可以把它計劃得更好。\n沒有人可以把它計劃得更好。\n\n對於那些不知道的人來說，比特幣區塊率目前是每20分鐘1個，而不是10分鐘。\n分鐘，而不是10分鐘，並且被設定爲極端困難的調整（以加快它們的速度\n加速）。)\n\n這將使礦工...",
      "title": "7月4日，比特幣的難度將得到重置，並將擺脫中國的挖礦--奇怪的是。"
    }
  ]
}