{
  "author": "just-a_a-user",
  "the_new_excerpt": "I’ve recently discovered that I have tendency to sabotage myself in situations\nthat could result to success. I’m a pretty quick learner, I can work hard and I\nknow I have it in me to get great things done. And I even let myself hover\naround those things, but I find excuses to never make the big…",
  "original_created_utc": 1618978761,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は最近、成功につながりそうな場面で自分を妨害する傾向があることに気づきました。\n妨害する傾向があることを発見しました。私は学習能力が高く、一生懸命働くことができます。\n自分には素晴らしいことを成し遂げる力があると思っています。そして、私は自分自身にそのようなことをさせても\nしかし、私は自分に言い訳をして、大きなことを成し遂げることができませんでした...",
      "title": "どうやって自己妨害を制限したり、止めたりするのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近发现，我有在可能导致成功的情况下破坏自己的倾向。\n可能会导致成功。我是一个相当快的学习者，我可以努力工作，我知道我有能力完成伟大的事情。\n我知道我有能力完成伟大的事情。而且我甚至让自己徘徊在\n围绕着这些事情，但我找到了借口，从来没有做大...",
      "title": "你如何限制或阻止自我破坏？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近發現，我有在可能導致成功的情況下破壞自己的傾向。\n可能會導致成功。我是一個相當快的學習者，我可以努力工作，我知道我有能力完成偉大的事情。\n我知道我有能力完成偉大的事情。而且我甚至讓自己徘徊在\n圍繞着這些事情，但我找到了藉口，從來沒有做大...",
      "title": "你如何限制或阻止自我破壞？"
    }
  ],
  "title": "How do you limit or stop self-sabotage?",
  "created_utc": 1619062548,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve recently discovered that I have tendency to sabotage myself in situations that could result to success. I’m a pretty quick learner, I can work hard and I know I have it in me to get great things done. And I even let myself hover around those things, but I find excuses to never make the big attempts, mostly not because I fear I’d fail, but because I fear it could work out\nAny opinions in this regard to, psychological or philosophical, as to why we do that and how to put an end to it?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TrueAskReddit/comments/mv82uy/how_do_you_limit_or_stop_selfsabotage/",
  "subreddit": "TrueAskReddit",
  "id": "mv82uy",
  "is_self": true,
  "media": null,
  "is_video": false
}