{
  "author": "Elliottafc1",
  "the_new_excerpt": "BlackRock CEO Larry Fink said Tuesday in his annual letter to CEOs that the\n“tectonic shift” toward sustainability-focused companies is accelerating in the\nwake of the coronavirus pandemic. “More and more people do understand that\nclimate risk is investment risk. ...When finance really understands a…",
  "original_created_utc": 1611675653,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "黑石集团CEO拉里-芬克周二在致CEO的年度信中表示，。\n的 \"构造性转变\"，正加速向注重可持续发展的企业转变。\n冠状病毒大流行后。\"越来越多的人确实明白\n气候风险就是投资风险。...当金融真正了解一个...",
      "title": "全球最大基金管理公司称可持续投资热潮将持续，推动更多信息披露。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "黑石集團CEO拉里-芬克週二在致CEO的年度信中表示，。\n的 \"構造性轉變\"，正加速向注重可持續發展的企業轉變。\n冠狀病毒大流行後。\"越來越多的人確實明白\n氣候風險就是投資風險。...當金融真正瞭解一個...",
      "title": "全球最大基金管理公司稱可持續投資熱潮將持續，推動更多信息披露。"
    }
  ],
  "title": "World’s largest money manager says sustainable investing surge to continue, pushes for more disclosure",
  "created_utc": 1611690164,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>BlackRock CEO Larry Fink said Tuesday in his annual letter to CEOs that the “tectonic shift” toward sustainability-focused companies is accelerating in the wake of the coronavirus pandemic.\n“More and more people do understand that climate risk is investment risk. ...When finance really understands a problem, we take that future problem and bring it forward,” the head of the world’s largest asset manager said on “Squawk Box.”\nBlackRock is asking companies to disclose how their business model will be compatible with a net-zero economy. What do you think about these key points? Article here: <a href=\"https://www.cnbc.com/2021/01/26/blackrock-calls-for-climate-change-disclosure-expects-sustainable-investing-to-continue.html\">https://www.cnbc.com/2021/01/26/blackrock-calls-for-climate-change-disclosure-expects-sustainable-investing-to-continue.html</a></p>\n</div><!-- SC_ON -->",
  "score": 310,
  "permalink": "/r/investing/comments/l5ghwk/worlds_largest_money_manager_says_sustainable/",
  "subreddit": "investing",
  "id": "l5ghwk",
  "is_self": true,
  "media": null,
  "is_video": false
}