{
  "author": "raiderloverwreckum",
  "the_new_excerpt": "\"US looks into cryptocurrency role in Ransomware hacks\"\n\nCould you imagine turning on the news one day and reading, \"US looking into\ndollar bills role in bank robberies\"\n\nThe fact ridiculous articles and headlines can even be takem serious is\nastounding. But sure let's blame the asset, let's blame…",
  "original_created_utc": 1622779241,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"ランサムウェアのハッキングにおける 暗号通貨の役割を米国が調査\"\n\nある日、ニュースを見て、「米国は銀行強盗での\n銀行強盗におけるドル紙幣の役割を調査中」と書かれていたら？\n\n馬鹿げた記事や見出しが真面目に扱われることがあるというのは\n驚くべきことです。しかし、確かに、資産のせいにしましょう。",
      "title": "今まで読んだ中で最もFUDを狙った見出しであることは間違いない。そして、私は病気です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"美国正在调查加密货币在勒索软件黑客中的作用\"\n\n你能想象有一天打开新闻，看到 \"美国正在调查\n美元钞票在银行抢劫案中的作用\"\n\n荒谬的文章和标题甚至可以被视为严肃的事实是\n令人震惊。但当然，让我们责备资产，让我们责备......",
      "title": "这是我读过的最有针对性的头条新闻。而且我很不舒服。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"美國正在調查加密貨幣在勒索軟件黑客中的作用\"\n\n你能想象有一天打開新聞，看到 \"美國正在調查\n美元鈔票在銀行搶劫案中的作用\"\n\n荒謬的文章和標題甚至可以被視爲嚴肅的事實是\n令人震驚。但當然，讓我們責備資產，讓我們責備......",
      "title": "這是我讀過的最有針對性的頭條新聞。而且我很不舒服。"
    }
  ],
  "title": "This is single handedly the most FUD aiming headline I've ever read. And I'm sick.",
  "created_utc": 1622817279,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;US looks into cryptocurrency role in Ransomware hacks&quot;</p>\n\n<p>Could you imagine turning on the news one day and reading, &quot;US looking into dollar bills role in bank robberies&quot;</p>\n\n<p>The fact ridiculous articles and headlines can even be takem serious is astounding. But sure let&#39;s blame the asset, let&#39;s blame the reward not the crime. Let&#39;s sit back and think to ourselves well if they didnt have bitcoin they wouldn&#39;t be criminals. Pretty sure crimes been paid for with good ol Uncle Sam&#39;s pride and joy paper for almost 245 years. </p>\n\n<p>It eats me up that the next paragraph has OUR(US sorry) PRESIDENT MENTIONED as investigating this absurd notion. </p>\n\n<p>&quot;Man you know ol Pete wouldn&#39;t of whacked that guy if money wasn&#39;t invented.&quot; <a href=\"http://Ridiculous%20https://imgur.com/gallery/OHis2jF\">This is just dumb writing</a></p>\n</div><!-- SC_ON -->",
  "score": 253,
  "permalink": "/r/CryptoCurrency/comments/nrw29z/this_is_single_handedly_the_most_fud_aiming/",
  "subreddit": "CryptoCurrency",
  "id": "nrw29z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404881315
}