{
  "author": "firmirtap",
  "original_created_utc": 1624546082,
  "title": "Is it bad that I fantasize about my boyfriends best friend?",
  "created_utc": 1624555595,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Me and my boyfriend have been talking to each other about threesomes and we’re both pretty open to the idea just not comfortable acting on it just yet. He fantasizes about letting another guy use me while he watches and tells me what to do. Honestly when he first told me this I was a bit confused but the more we talk about it, it’s starting to become my fantasy as well. But the thing that I feel like I can never tell him is that I fantasize about his best friend being the third. It feels so hot imagining my boyfriend letting his best friend do whatever he wants to me and having my boyfriend tell me what to do. This feels like such a guilty thought and I don’t even find his best friend that attractive tbh. Idk if I should bring this up with my boyfriend, even if I were too idk how. Is it bad that I think this?</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/TooAfraidToAsk/comments/o72dtv/is_it_bad_that_i_fantasize_about_my_boyfriends/",
  "subreddit": "TooAfraidToAsk",
  "id": "o72dtv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Me and my boyfriend have been talking to each other about threesomes and we’re\nboth pretty open to the idea just not comfortable acting on it just yet. He\nfantasizes about letting another guy use me while he watches and tells me what\nto do. Honestly when he first told me this I was a bit confused…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私と私の彼氏は3Pについて話していて、2人ともかなりオープンな考えを持っています。\n二人ともかなりオープンな考えを持っていますが、まだ行動に移すことには抵抗があります。彼は\n彼は他の男性に私を使わせて、自分はそれを見ていて、私に何をさせるか教えてくれるということを空想しています。\n妄想しています。正直なところ、彼が最初にこの話をしたとき、私は少し混乱しました...。",
      "title": "彼氏の親友を妄想するのは悪いことですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和我的男朋友一直在谈论三人行的问题，我们都对这个想法很开放，只是还不愿意采取行动。\n我们都对这一想法持开放态度，只是还不太愿意采取行动。他\n幻想着让另一个人利用我，而他在一旁观看并告诉我\n做什么。说实话，当他第一次告诉我这些时，我有点困惑......",
      "title": "我幻想我男朋友最好的朋友，这很糟糕吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和我的男朋友一直在談論三人行的問題，我們都對這個想法很開放，只是還不願意採取行動。\n我們都對這一想法持開放態度，只是還不太願意採取行動。他\n幻想着讓另一個人利用我，而他在一旁觀看並告訴我\n做什麼。說實話，當他第一次告訴我這些時，我有點困惑......",
      "title": "我幻想我男朋友最好的朋友，這很糟糕嗎？"
    }
  ]
}