{
  "author": "ProfessorPurrrrfect",
  "original_created_utc": 1652059940,
  "title": "Some advice from a previous bear market participant",
  "created_utc": 1652078845,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I got into crypto in 2016 pretty casually. Bought 2 BTC for $900, sold them for $1000 and thought I was a genius. Didn’t take it too seriously. &lt;/p&gt;\n\n&lt;p&gt;After trading them for awhile and doing more research I started thinking crypto could have a really bright future. Then I woke up one day in 2017 and BTC was jumping to 2k. I frantically bought that morning with all the money I could spare. I could feel the FOMO coursing through the investment community. Bitcoin was national news and on CNBC everyday after being mostly ignored for years.&lt;/p&gt;\n\n&lt;p&gt;Shortly thereafter, it went to 19k and I was walking around town like a God amongst mortals. I told all my friends and family to buy some crypto. I begged them. I was so cocky I put 100% of my IRA account into GBTC at $29/share. Why not? BTC was going to the moon and there would be no detours along the way. &lt;/p&gt;\n\n&lt;p&gt;Then I went to lunch a few days later, checked the price and it had dropped to 17k. No biggie, I thought, of course there needs to be a correction after this run up, it’ll bounce back. A few days later it was 15k. Okay, I thought, just some more profit taking by short term investors, this’ll stop soon and we’ll be at 30k in a month. &lt;/p&gt;\n\n&lt;p&gt;The next two months we’re a torturous gauntlet of small bounces of hope followed by spirit crushing dips, sleepless nights and poor mental health. I capitulated and sold half of my stack at 6k/BTC just so I could take a break from thinking about it and “get my old life back.”&lt;/p&gt;\n\n&lt;p&gt;For the next 2 years I kept advocating for crypto and wishing it would rise as it became less and less relevant in the news once again. It bounced around 10k again for awhile and finally landed down at 3k during the Covid crash in March 2020. My GBTC position and my IRA was down 95% to $3/ share. I laughed to myself looking at the account balance on my screen and said out loud “Ha! Space cash?…What the fuck was I thinking?”&lt;/p&gt;\n\n&lt;p&gt;Of course we all know that was the start of the next bull market and we ended up at 68k. I DCA’ed every chance I could over that 2 year period and I ended up with about 50% more crypto as I had before I sold half in 2017. I still DCA today as we have drifted back down to 34k, a 50% drop from ATHs.&lt;/p&gt;\n\n&lt;p&gt;The message and point of this story is:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Allowing myself to feel depressed or super excited about the price over the last 6 years has been a complete waste of my time. I could’ve just set an automatic recurring buy order my exchange account and gotten drunk or been in a coma and I’d be elated with the results right now if I had never checked the price. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The drop allowed me to increase my crypto position. Dollars or euros don’t matter, what matters is increasing your crypto stack. We all know it’s just a matter of time until it’s $680k/BTC. Guess what? It’ll probably drop to 340k then too. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;This is the crypto game. My story is not unique. Losing 50%+ of your money is a right of OG crypto hodler passage, so welcome to the club of this is your first time.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Hang in there.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 532,
  "permalink": "/r/CryptoCurrency/comments/ulg72c/some_advice_from_a_previous_bear_market/",
  "subreddit": "CryptoCurrency",
  "id": "ulg72c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I got into crypto in 2016 pretty casually. Bought 2 BTC for $900, sold them for\n$1000 and thought I was a genius. Didn’t take it too seriously.\n\nAfter trading them for awhile and doing more research I started thinking crypto\ncould have a really bright future. Then I woke up one day in 2017 and BTC…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2016年にかなりカジュアルに暗号に手を出しました。2BTCを900ドルで買い、1000ドルで売りました。\n1000ドルで売却し、自分は天才だと思いました。あまり真剣に取り組まなかった。\n\nしばらく取引して、もっと研究した後、私は暗号を考え始めました。\nは本当に明るい未来があるのではと思うようになりました。そして2017年のある日、私は目を覚まし、BTC...",
      "title": "過去の弱気相場参加者からのアドバイス"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在2016年很随意地进入了加密货币。以900美元买了2个BTC，以1000美元卖出\n1000美元，并认为我是个天才。没有太认真地对待它。\n\n在交易了一段时间后，做了更多的研究，我开始认为加密货币\n可能有一个非常光明的未来。然后我在2017年的某一天醒来，BTC...",
      "title": "一位前熊市参与者的一些建议"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在2016年很隨意地進入了加密貨幣。以900美元買了2個BTC，以1000美元賣出\n1000美元，並認爲我是個天才。沒有太認真地對待它。\n\n在交易了一段時間後，做了更多的研究，我開始認爲加密貨幣\n可能有一個非常光明的未來。然後我在2017年的某一天醒來，BTC...",
      "title": "一位前熊市參與者的一些建議"
    }
  ]
}