{
  "author": "Document10",
  "the_new_excerpt": "Good morning!\n\nIn the last year I have spent so much time researching companies and chances are\nmy watchlist looks like many of yours. I've been focused on zoom, tesla,\ncrowdstrike, twlo, and stay at home stocks like fiverr, pton, and etsy. While\nmany of these companies still have decades worth of…",
  "original_created_utc": 1622723076,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "おはようございます。\n\nこの1年間、私は企業研究に多くの時間を費やしてきました。\n私のウォッチリストは皆さんのようなものです。私はズーム、テスラ、クラウドストライク、Twlo、そしてfiverr、pton、stay at homeなどに注目しています。\nズーム、テスラ、クラウドストライク、ツロ、そしてfiverr、pton、etsyなどの在宅株に注目してきました。しかし\nこれらの企業の多くは、まだ何十年もの価値がある...",
      "title": "誰も語らない企業"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "早上好\n\n在过去的一年里，我花了很多时间来研究公司，而且有可能\n我的观察清单看起来像你们中的许多人。我一直在关注Zoom, Tesla,\ncrowdstrike、twlo，以及像fiverr、pton和etsy这样的居家股票。虽然\n这些公司中的许多仍然有几十年的价值。",
      "title": "没有人在谈论的公司"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "早上好\n\n在過去的一年裏，我花了很多時間來研究公司，而且有可能\n我的觀察清單看起來像你們中的許多人。我一直在關注Zoom, Tesla,\ncrowdstrike、twlo，以及像fiverr、pton和etsy這樣的居家股票。雖然\n這些公司中的許多仍然有幾十年的價值。",
      "title": "沒有人在談論的公司"
    }
  ],
  "title": "Companies no one is talking about",
  "created_utc": 1622735871,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Good morning!</p>\n\n<p>In the last year I have spent so much time researching companies and chances are my watchlist looks like many of yours. I&#39;ve been focused on zoom, tesla, crowdstrike, twlo, and stay at home stocks like fiverr, pton, and etsy. While many of these companies still have decades worth of growth ahead of them (amd), I haven&#39;t found any new exciting stocks recently. C3AI and coupang are about the only two. Coupang is the only one i would consider investing in at this moment. Would love to research some of the companies that are flying under the radar if any of you have your eyes on one.</p>\n</div><!-- SC_ON -->",
  "score": 335,
  "permalink": "/r/stocks/comments/nrc7tm/companies_no_one_is_talking_about/",
  "subreddit": "stocks",
  "id": "nrc7tm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404886629
}