{
  "author": "LactatingJello",
  "original_created_utc": 1643072893,
  "title": "The global crypto market ($1.73T) is still worth less than a single US company (Apple $2.64T). If you think the largest decentralized financial system will never recover, then sell and move on.",
  "created_utc": 1643092365,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just wanted to put some perspective/hopium with this recent drop and that we are nowhere close to gold&amp;#39;s market cap (10 trillion) and stock market (50 trillion). If BTC hit 100k it would only closely match apple and still be nowhere close to gold&amp;#39;s market cap. I still have money invested in the stock market because I believe in the future of US companies but even I think it&amp;#39;s overvalued compared to what crypto could bring to financial networks.&lt;/p&gt;\n\n&lt;p&gt;And yes, apple is a big company that is also internal national but I still think the idea of crypto and the technology being developed by over 10,000+ developers  deserves a much higher valuation. &lt;/p&gt;\n\n&lt;p&gt;The negatives about crypto are what is highlighted like the exploitation of NFTs, scams, and pump and dumps.  Take a look at the bigger picture and you can see that nothing has changed.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 307,
  "permalink": "/r/CryptoCurrency/comments/sc0y98/the_global_crypto_market_173t_is_still_worth_less/",
  "subreddit": "CryptoCurrency",
  "id": "sc0y98",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Just wanted to put some perspective/hopium with this recent drop and that we are\nnowhere close to gold's market cap (10 trillion) and stock market (50 trillion).\nIf BTC hit 100k it would only closely match apple and still be nowhere close to\ngold's market cap. I still have money invested in the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ただ、この最近の下落について、いくつかの展望/希望を述べたいと思います。\n金の時価総額（10兆円）や株式市場（50兆円）に迫る勢いです。\nBTCが10万ドルになったとしても、リンゴに匹敵する程度で、まだどこにも及ばない。\nゴールドの時価総額 私はまだお金を投資しています...",
      "title": "世界の暗号市場（1.73Tドル）は、まだ米国企業1社（アップル2.64Tドル）よりも価値が低いのです。最大の分散型金融システムが回復しないと思うのであれば、売却して次に進むことです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "只是想对最近的下跌提出一些看法/希望，而且我们正在\n与黄金的市值（10万亿）和股票市场（50万亿）相差甚远。\n如果BTC达到10万，它只会与苹果相差无几，但仍然远远无法接近\n黄金的市值。我仍然有资金投资于BTC。",
      "title": "全球加密货币市场（1.73T美元）的价值仍然低于一家美国公司（苹果2.64T美元）。如果你认为最大的去中心化金融系统将永远不会恢复，那么卖掉并继续前进。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "只是想對最近的下跌提出一些看法/希望，而且我們正在\n與黃金的市值（10萬億）和股票市場（50萬億）相差甚遠。\n如果BTC達到10萬，它只會與蘋果相差無幾，但仍然遠遠無法接近\n黃金的市值。我仍然有資金投資於BTC。",
      "title": "全球加密貨幣市場（1.73T美元）的價值仍然低於一家美國公司（蘋果2.64T美元）。如果你認爲最大的去中心化金融系統將永遠不會恢復，那麼賣掉並繼續前進。"
    }
  ]
}