{
  "author": "H_Finn27",
  "original_created_utc": 1634223585,
  "title": "CoinBase is Shilling for SHIB",
  "created_utc": 1634239912,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This morning I got an email from Coinbase with the title <strong>Don’t Miss Out On SHIB</strong>. </p>\n\n<p>So not only is my exchange shilling me a shitcoin, but they are also trying to give us FOMO! It’s so blatant they even use the words <strong>miss out</strong>. This feels like dirty marketing to me and is something I want nothing to do with the exchange I trade on. Instead of shilling me a meme coin, I would prefer they start listing the coins I actually want to invest in.</p>\n\n<p>Coinbase rant over. Does anyone have another exchange they would recommend over these FOMO inducing shills?</p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/q81gcg/coinbase_is_shilling_for_shib/",
  "subreddit": "CryptoCurrency",
  "id": "q81gcg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This morning I got an email from Coinbase with the title Don’t Miss Out On SHIB.\n\nSo not only is my exchange shilling me a shitcoin, but they are also trying to\ngive us FOMO! It’s so blatant they even use the words miss out. This feels like\ndirty marketing to me and is something I want nothing to do…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今朝、Coinbaseから「Don't Miss Out On SHIB」というタイトルのメールが届きました。\n\nつまり、私の取引所は私にクソコインを売っているだけでなく、私たちにFOMOを与えようとしているのです。\n私たちに不安を与えようとしています。miss outという言葉を使っているくらい、露骨なのだ。これは私にとって汚いマーケティングのように感じます。\n私には汚いマーケティングのように感じられ、何もしたくありません...。",
      "title": "CoinBaseがSHIBにシリング"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天早上，我收到Coinbase的电子邮件，标题是不要错过SHIB。\n\n因此，我的交易所不仅在向我兜售一个狗屎币，而且他们还在试图\n给我们带来FOMO! 他们甚至使用了 \"错过 \"这个词，这是如此明目张胆。这感觉就像\n对我来说，这是肮脏的营销，是我不想做的事情...",
      "title": "CoinBase为SHIB开价"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天早上，我收到Coinbase的電子郵件，標題是不要錯過SHIB。\n\n因此，我的交易所不僅在向我兜售一個狗屎幣，而且他們還在試圖\n給我們帶來FOMO! 他們甚至使用了 \"錯過 \"這個詞，這是如此明目張膽。這感覺就像\n對我來說，這是骯髒的營銷，是我不想做的事情...",
      "title": "CoinBase爲SHIB開價"
    }
  ]
}