{
  "author": "killawaspattack",
  "original_created_utc": 1625598609,
  "title": "Never turn down free crypto even if it’s only a few dollars.",
  "created_utc": 1625622361,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So let’s talk a little about the earn schemes from exchanges like Coinbase. When I first got into crypto I got the about $30 worth of random coins like ox, dia, eos, bat and nu. I was too late for the good coins but still all of these went up over the years and I sold them all for ETH getting just over $250 worth. Now I have done a load of the more recent earns on Coinbase over the last few months as I save them for bear markets but was worried some would expire soon. Now I have roughly $3 each of The graph, Amp, uma, celo, band protocol, polygon, skale, and barnbridge? Yea never heard of the last. I’m quite sure these aren’t going to be crazy coins but I was lucky I got the GRT just as all was on the way up and celo a bit after so these are now at $10 and $6 but all the others were closer to the top so are roughly worth $1-$2. Now it’s still up in all and honestly these are just gunna sit in my CB wallet until they are actually worth something but I don’t have any doubts that it’ll all be worth well into it’s hundreds again within a few years. If btc does have another big drive up this year I’m quite sure these will already have a tasty jump too. Quite sure a lot of you don’t care about a few hundred dollars but I can also guarantee that there are plenty of people who can’t afford to put much money into crypto monthly and this would definitely help a lot. Lastly coinmarketcap also has an earn scheme but I haven’t used it yet, I only found out about it recently but will be joining and doing them to soon.</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/of1sib/never_turn_down_free_crypto_even_if_its_only_a/",
  "subreddit": "CryptoCurrency",
  "id": "of1sib",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So let’s talk a little about the earn schemes from exchanges like Coinbase. When\nI first got into crypto I got the about $30 worth of random coins like ox, dia,\neos, bat and nu. I was too late for the good coins but still all of these went\nup over the years and I sold them all for ETH getting just…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで、Coinbaseのような取引所の稼ぐ仕組みについて少しお話します。私が初めて暗号に触れたとき\n約30ドル分のox、dia、eos、bat、nuなどのランダムなコインを手に入れました。\neos、bat、nuなどのランダムなコインを手に入れました。良いコインを手に入れるには遅すぎましたが、それでもこれらのコインは何年もかけて上昇したので\nETHで売却して得たのは...。",
      "title": "たとえ数ドルであっても、無料の暗号を断ってはいけません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，让我们来谈一谈像Coinbase这样的交易所的赚取计划。当\n我第一次接触加密货币时，我得到了价值约30美元的随机硬币，如牛市，迪亚，EOS，蝙蝠和NAS。\neos，bat和nu。我对好币的购买为时已晚，但所有这些币在几年内仍然上涨。\n几年来，我把它们全部卖给了ETH，只得到了......",
      "title": "永远不要拒绝免费的加密货币，即使它只有几美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，讓我們來談一談像Coinbase這樣的交易所的賺取計劃。當\n我第一次接觸加密貨幣時，我得到了價值約30美元的隨機硬幣，如牛市，迪亞，EOS，蝙蝠和NAS。\neos，bat和nu。我對好幣的購買爲時已晚，但所有這些幣在幾年內仍然上漲。\n幾年來，我把它們全部賣給了ETH，只得到了......",
      "title": "永遠不要拒絕免費的加密貨幣，即使它只有幾美元。"
    }
  ]
}