{
  "author": "Caramal76",
  "the_new_excerpt": "I have read that Spinoza was (wrongly) called an atheist in his own time and was\nexcommunicated from his Jewish community because of his views on God. I have\nalso heard it said that the label of pantheism and the idea that he believed\n“Everything is God” isn’t really accurate either.\n\nSo I’m…",
  "original_created_utc": 1620832541,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "スピノザは当時、（間違って）無神論者と呼ばれ、神に対する見解のためにユダヤ人社会から破門されたと読んだことがあります。\n神についての見解のために、ユダヤ人社会から破門された。私は\nまた、汎神論というレッテルや、「すべては神である」と信じていたという考えは、「神ではない」とも言われているそうです。\n\"汎神論というレッテルを貼って、「すべては神である」と信じていたという話も聞いたことがあります。\n\nだから、私は...",
      "title": "スピノザの神についての考え方は、正統的な神道の見解にどのように挑戦したのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我读到，斯宾诺莎在他自己的时代被（错误地）称为无神论者，并且因为他对上帝的看法而被逐出他的犹太社区。\n因为他对上帝的看法而被逐出犹太社区。我还听说\n我还听到有人说，泛神论的标签和他相信 \"万物皆神 \"的观点并不是真的。\n\"万物皆神 \"的说法也不太准确。\n\n所以我...",
      "title": "斯宾诺莎关于上帝的思想是如何挑战正统神论的观点的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我讀到，斯賓諾莎在他自己的時代被（錯誤地）稱爲無神論者，並且因爲他對上帝的看法而被逐出他的猶太社區。\n因爲他對上帝的看法而被逐出猶太社區。我還聽說\n我還聽到有人說，泛神論的標籤和他相信 \"萬物皆神 \"的觀點並不是真的。\n\"萬物皆神 \"的說法也不太準確。\n\n所以我...",
      "title": "斯賓諾莎關於上帝的思想是如何挑戰正統神論的觀點的？"
    }
  ],
  "title": "How did Spinoza’s ideas about God challenge the views of orthodox theism?",
  "created_utc": 1620894747,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have read that Spinoza was (wrongly) called an atheist in his own time and was excommunicated from his Jewish community because of his views on God. I have also heard it said that the label of pantheism and the idea that he believed “Everything is God” isn’t really accurate either.</p>\n\n<p>So I’m wondering:</p>\n\n<p>1.) What did he actually believe about the nature of God.</p>\n\n<p>2.) What problems did he have with the idea of God as proposed by Jews/Christians/Muslims.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/nar433/how_did_spinozas_ideas_about_god_challenge_the/",
  "subreddit": "askphilosophy",
  "id": "nar433",
  "is_self": true,
  "media": null,
  "is_video": false
}