{
  "author": "roberthonker",
  "original_created_utc": 1625972275,
  "title": "Don't be afraid to ask if a local business accepts crypto! This is the only way that we will ever get adoption.",
  "created_utc": 1626014272,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The next time that you are out shopping in a local business, ask them if they accept crypto. Trust me, just give it a try. The worst that can happen is that you get a strange look from the owner. You&#39;d be surprised the number of local business owners who are willing to accept crypto to save themselves fees from the big boys like Visa or Mastercard.</p>\n\n<p>If you want crypto adoption, show your local businesses that there is interest for them to accept it. If no one ever asks them about it, they will assume that no one wants to pay with it. Crypto is a wonderful revolution that benefits both you and the shop owner, while giving the middle finger to big banks and corporations.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/ohwike/dont_be_afraid_to_ask_if_a_local_business_accepts/",
  "subreddit": "CryptoCurrency",
  "id": "ohwike",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The next time that you are out shopping in a local business, ask them if they\naccept crypto. Trust me, just give it a try. The worst that can happen is that\nyou get a strange look from the owner. You'd be surprised the number of local\nbusiness owners who are willing to accept crypto to save…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "次回、地元の企業で買い物をする際には、暗号を使えるかどうか聞いてみましょう。\nてみてください。私を信じて、試してみてください。最悪の場合、店主から変な目で見られるかもしれません。\n店主に変な顔をされることです。驚いたことに、地元のビジネスオーナーの中には、暗号を受け入れて\n節約のために暗号を受け入れようとする地元のビジネスオーナーの数には驚かされます。",
      "title": "地元の企業が暗号を使えるかどうかを尋ねることを恐れないでください。これが採用されるための唯一の方法なのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "下次你在当地企业购物时，问问他们是否接受加密货币。\n接受加密货币。相信我，就试一试吧。最坏的情况是\n你会从老板那里得到一个奇怪的眼神。你会惊讶于有多少当地的\n你会惊讶于有多少当地的企业主愿意接受加密货币来拯救...",
      "title": "不要害怕询问当地的企业是否接受加密货币! 这是我们获得采用的唯一途径。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "下次你在當地企業購物時，問問他們是否接受加密貨幣。\n接受加密貨幣。相信我，就試一試吧。最壞的情況是\n你會從老闆那裏得到一個奇怪的眼神。你會驚訝於有多少當地的\n你會驚訝於有多少當地的企業主願意接受加密貨幣來拯救...",
      "title": "不要害怕詢問當地的企業是否接受加密貨幣! 這是我們獲得採用的唯一途徑。"
    }
  ]
}