{
  "author": "Many_Scratch2269",
  "original_created_utc": 1633880976,
  "title": "We will no longer see brutal bear markers because Crypto is already very mainstream",
  "created_utc": 1633901442,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know that a lot of people will say otherwise because Crypto has seen -80% crashes before. However, I really can&#39;t see BTC being sold below 5 digits anymore. Nor do I see ETH being sold at 3 digits. It&#39;s simply too much of a discount. Way too many people are familiar with Crypto nowadays. You have thousands of institutions and companies investing in Crypto. You didn&#39;t have this just 2 years ago.</p>\n\n<p>Moreover, the explosive growth we&#39;ve seen just this year alone makes me believe that Crypto can no longer be stopped no matter how much FUD is being spread around. Bear markets are also becoming less longer and less and less profound.  We’ve had two down 83% bear markets, but  The previous two have been -61% and -54%. With the -54% being just a few months ago and we&#39;re already on a new bull market. </p>\n\n<p>The Crypto market just a few months ago crashed -54% because of an Elon tweet and crashed -30% again after a China FUD in June. Since then we&#39;ve brushed off dozens of these tweets and actually spurred a bull run after the latest China FUD. I seriously believe 2021 has begun a new chapter for Crypto. We are not only seeing longer and more bull markets but shorter and fewer bear markets in between. Crypto is a huge multi-trillion dollar industry now. I truly believe long and brutal bear markets are now a thing of the past.</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/CryptoCurrency/comments/q5aln9/we_will_no_longer_see_brutal_bear_markers_because/",
  "subreddit": "CryptoCurrency",
  "id": "q5aln9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know that a lot of people will say otherwise because Crypto has seen -80%\ncrashes before. However, I really can't see BTC being sold below 5 digits\nanymore. Nor do I see ETH being sold at 3 digits. It's simply too much of a\ndiscount. Way too many people are familiar with Crypto nowadays. You…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人がそうではないと言うでしょうが、Cryptoは過去に-80%の\nのクラッシュを見たことがあるからです。しかし、BTCが5桁以下で売られることはもうありません。\nとは思えません。ETHが3桁で売られるとも思えません。あまりにも割安だからです。\n割安感があります。最近はCryptoを知っている人が多すぎます。あなた...",
      "title": "暗号はすでに非常に主流になっているので、残酷なベア・マーカーはもう見られないだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道很多人都会这么说，因为加密货币曾经见过-80%的\n崩溃过。然而，我真的看不到BTC被卖到5位数以下了\n了。我也不认为ETH会在3位数时被卖出。这简直是太多的\n折扣。现在有太多的人熟悉加密货币了。你...",
      "title": "我们将不再看到残酷的熊市标记，因为加密货币已经是非常主流的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道很多人都會這麼說，因爲加密貨幣曾經見過-80%的\n崩潰過。然而，我真的看不到BTC被賣到5位數以下了\n了。我也不認爲ETH會在3位數時被賣出。這簡直是太多的\n折扣。現在有太多的人熟悉加密貨幣了。你...",
      "title": "我們將不再看到殘酷的熊市標記，因爲加密貨幣已經是非常主流的。"
    }
  ]
}