{
  "author": "thecheese27",
  "the_new_excerpt": "It’s pathetic to me browsing subreddits and seeing post after post talking about\nhow XYZ is forming a double zenith ultra harmonic convergence and is about to\nbreak out to the moon when in reality there is no merit to this “pattern”\nwhatsoever and the stock continues to move with randomness.\n\nIt’s…",
  "original_created_utc": 1615610367,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在浏览subreddits的时候，看到一个又一个的帖子在讨论\nXYZ如何形成双天顶超谐波收敛，并即将\n扑朔迷离，其实这种 \"模式 \"并无可取之处。\n什么都没有，股票继续随机移动。\n\n这是...",
      "title": "改变我的想法。技术分析完全是扯淡"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在瀏覽subreddits的時候，看到一個又一個的帖子在討論\nXYZ如何形成雙天頂超諧波收斂，並即將\n撲朔迷離，其實這種 \"模式 \"並無可取之處。\n什麼都沒有，股票繼續隨機移動。\n\n這是...",
      "title": "改變我的想法。技術分析完全是扯淡"
    }
  ],
  "title": "Change my mind: Technical Analysis is complete bullshit",
  "created_utc": 1615617615,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It’s pathetic to me browsing subreddits and seeing post after post talking about how XYZ is forming a double zenith ultra harmonic convergence and is about to break out to the moon when in reality there is no merit to this “pattern”  whatsoever and the stock continues to move with randomness.</p>\n\n<p>It’s even more pathetic when WSB tries to use TA, something that predicts movement based off of <em>patterns</em>, on GME, a stock that has had a completely unprecedented rise and is solely governed by sources such as news, tweets, hedge funds and market makers. </p>\n\n<p>I physically cringe anytime I see “DD” that involves a chart and every time I do see one, I instantly discredit the entire post. There have been many studies that prove the natural randomness of the stock market overshadows any patterns and predictions that could be made and your chance of predicting a stocks movement off of TA is basically that of a coin flip. Fundamental analysis, news and the current trend and sentiment of the market are infinitely more important for predicting a stocks immediate movement than TA could ever be.</p>\n\n<p>The only glimmer of credibility I’d be willing to give TA is scalping but even then 90% of daytraders lose money so id say it’s not even paying off for them well in that regard either.</p>\n\n<p>What it feels like to me is TA is a “noob trap” that attracts people who are new to the stock market because it makes them feel like they know what they are doing and they want an excuse to just gamble away their money. I’ve noticed a lot of YouTube channels prey off of people thinking they’re some God of the stock market for employing TA and it gives them false credibility when in reality they’re just guessing as much as anyone. Like some fake scam psychic tarot card reading shit. </p>\n\n<p>Not really looking for anyone to change my mind, I just had to get this out of my system although I’m curious to hear others’ thoughts.</p>\n</div><!-- SC_ON -->",
  "score": 835,
  "permalink": "/r/stocks/comments/m3z7tm/change_my_mind_technical_analysis_is_complete/",
  "subreddit": "stocks",
  "id": "m3z7tm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147381398
}