{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "I failed a lot while trading before, during, and after succeeding. I haven’t counted it up, but it’s likely I encountered losses in excess of $150,000 from making mistakes that were easily avoided, rash decisions, and not giving myself enough time to test out strategies. Net net, I’m up $500,000, but I was asked to share some of what worked for me over IM quite a bit after my last post and figured I’d lay it for others who may not want to waste money learning the hard way, as I did. \n\nThese are tactics and strategies that worked for me and my situation - someone trying to increase net worth, not increase income - and they may not be suitable for everyone.\n\n**Understand the Trading Environment**\n\nOne mistake I made more than a few times was not understanding or paying attention to the trading environment I was in before picking out a strategy. What do I mean? I need to know where things are in the year, in relation to earnings season, and in relation to sector rotations. I need to pay attention to the macroeconomic indicators and I need to watch the VIX.\n\n**Mind the Gap Between Earnings Seasons**. I can’t stress this enough. When earnings are strong and earnings data is coming in, investors watch those like hawks. Good earnings reports bring confidence to the market which yields a rising market. \n\nIn between earnings seasons, there is less data from companies to review and investors pay closer attention to macroeconomic indicators like inflation, 10-year bond yields, and what the Fed is doing. This makes for a much jumpier market that’s more likely to pull back.  It’s also a time when the large asset managers rebalance their portfolios. They manage billions, so this can cause large movements to stocks and indexes as they shift to be overweight in one asset class (e.g. value stocks, energy) and underweight in other asset classes (e.g. growth stocks, technology).\n\nI try not to get caught by these patterns. I anticipate they are coming and invest accordingly. Simply put, I buy the pullback after the rotations have occurred and before earnings seasons begin as a general rule. Of course, I don’t do this if I expect a terrible earnings season. \n\n**Take Advantage of Sector Rotations**\n\nThe sector rotations are pretty predictable if you track the performance of the different sectors over the year. I do this by plotting sector ETFs on a graph and noting when one begins to gain that was flat while others that were up a lot begin to flatten or pull back. Professional investors tend to sell off sectors that have been hot the last quarter or two and replace them with underperforming sectors that represent a better value or opportunity for upside. If I run the P/E ratios for the sector ETFs, I can get a quick sense of the sectors that have had a hot run up over 30 P/E vs other sectors that are more modestly valued. Just keep in mind that certain sectors, like Tech, will always be valued more richly given their growth. So looking at P/E ratios is not apples to apples - it’s just a way to note if historically that sector is at the high end of its own typical valuation range.\n\nLast year’s worst performing sector tends to be one of the best performing sectors the following year. This is because investors prefer to buy low and sell high. I don’t bet against this trend, it’s been around longer than I have and will continue to be around long after I’m dirt. \n\nLast year you couldn’t give away a barrel of oil. Last week, oil reached $80 a barrel. \n\nOne of my favorite options strategies is to buy long dated calls at the money for sector ETFs that underperformed the previous year. I buy calls with expirations in 6-9 months, knowing that I will sell at my exit point which for me is a 100% gain. Sometimes this happens 6 weeks into the year; other times it takes 9 months. So long as I don’t overpay for the options, it works. I don’t like to pay more than the average price return of the sector. For example, if the sector ETF averages a 10% annual return and the ETF price is $100, I’m not going to buy a call for more than $10. That way, if the sector only moves 5%, I can still make money provided the price increase moves quickly enough.\n\n**Make The VIX Your Friend**\n\nThe VIX is an easy way to gauge fear in the marketplace and is a hedge used widely against market pullbacks. If the VIX goes up, the market is worried. If it goes down, the market is getting bullish. If it stays up, everyone is on edge. It’s hard to make good trades in an environment where everyone is on edge and ready to hit the sell button. So be careful buying during times when the VIX is high. On the flip side, if the market has pulled back and the VIX starts to retreat away from its highs, that makes for a good entry point. \n\nAnother interesting phenomenon is when the VIX is higher than normal, there tends to be a selloff the Friday before a long weekend. This happens because investors don’t want to sit through a long weekend that might hold worse news out of fear they will start their Tuesday with losses piling up. I’ve found this is a nice time to get some discounts at the end of the day Friday, or to run some weekly puts on Thursday afternoon before the dips. \n\n**Selecting Trades & Investments**\n\n**Have an Allocation Plan**\n\nThe first thing I recommend is determining, in advance, the amount of money you want to invest longer term vs the amount you want to invest short term vs the amount of money you might actually need to have available for life emergencies. Anything shorter term is higher risk, higher reward. I break my portfolio in the following buckets:\n\n* 25% long-term market investment using equity ETFs that largely track the SPX or do a breakdown between bonds and the market. I use Vanguard funds and a small cap value fund called CALF. I will not touch this money for 15+ years.\n* 25% cash. I like to be ready to buy the dips and have enough to spare. This way if a black swan event happens, I not only have money to invest, I have money to live on should things go bad for a while. This philosophy enabled me to buy options when COVID hit in 2020 without worrying if I could continue paying a mortgage for a year without a job. It’s also very useful if I have to roll covered calls to offset taxes and buy back expensive positions. I took this from Buffet FWIW.\n* 30% options, mostly in tax advantaged accounts (IRAs). I aim for a 50% annual return overall with this portfolio, though it fluctuates a lot year to year.\n* 10% long term blue chips stocks like Visa, Apple, MSFT, etc. I defend these positions when the stocks get overheated by selling calls on them and/or buying puts out of the money that expire after a typical sector rotation would occur. That can generate some additional income or help lessen the sting if the stock falls. \n* 6% long-term bets in a Roth IRA. These are equities I think all have a chance at a 10X return but that will take 5-10 years. It’s a lot of IPOs, small tech companies, and biotechs. I have to stomach pullbacks in this portfolio of 40-50% on the belief that a few of the 30 in here will more than compensate for it. This is a new strategy for me so I’ll let you know in 10 years if it works.\n* 3% leveraged hedges.These are puts on my own positions, stocks, or the market at large. Generally I use VIX calls, buy puts, occasionally buy calls on the SPXS, and run strangles on investments (betting both up and down on the same stock using calls and puts).  \n* 1% in other things I can’t mention due to the bots in here but they rhyme with tiptoe.\n\n**Use Technologies to Find Ideas**\n\nUnless you want to spend 8 hours a day reading news or are OK getting all your ideas from meme stocks and friends, you need to use tools to help you locate investment/trade ideas and be willing to pay for them. I value my time and am willing to pay .5% of my portfolio a year if it saves me time, and more if it generates higher returns. \n\nI’ve tried about a dozen or so services, including stock picking services like Fool and Investorsplace. Ultimately I decided the stock picking sites were not working for me because I did not want to wait 5 years to find out if they were the right recommendations and lost a lot of money learning that lesson on their pump and dumps. So I switched to analytics tools and my Fidelity platform. \n\nMy favorite tools to use are Zack’s VGM score, Levelfields, and Fidelity. The Zack’s VGM measures a stock’s value, growth rate, and momentum. It’s an easy screen I can run off the basic level subscription to get a list of companies to look at. The caveat is that you need to run this screen often because sometimes the companies on the list get stale and have already moved 99% of the way they are going to move. So you need to keep an eye on what’s new to the list to avoid losing money. That part is crucial. \n\nThe list usually represents companies that are well valued and poised to move up over the next 6-9 months. Warning: they can move very slowly so be patient and set your target exit to automatically exit. I use Fidelity to do my own due diligence on the stocks from there, examining their actual growth and earnings rates and ensuring there is no negative news against them which could drive down the price.\n\nA friend recently turned me on to an AI tool called Levelfields. They have a lot of news alerts but only for the types of events that matter and are organized thematically. It helps me find trades on news events with high returns or get in early on the small to mid-cap companies you don’t usually hear about which fall between the cracks in the penny stock discussions and cnbc favorites. They often send alerts on company events before there’s any news out, which is really helpful. The interface shows you how stocks perform when these events happen, so it’s easy to figure out my entry and exit points and statistical likelihood of success.   \nI use it a lot for pinpointing entry/exit points from options trades and have bought stock in a few companies I hadn’t ever heard of before that were absolutely crushing it on revenue and earnings. Not sure why, but they never came up in any of my Fidelity stock screens. I suspect it’s because there’s a lag in the data Fidelity is getting from S&P but haven’t confirmed this. They send a lot of high quality alerts and my only wish is that they’d have a better way to rank the stocks in the alerts so I didn’t have to look up the stocks on Fidelity.\n\nI use Fidelity for basic news reading, running stock screens for high growth stocks at decent valuations, looking deeply at the history of earnings results, actually trading options, and for their options scanner which tracks abnormal option activity.  I sell puts when I see abnormal call volume and run strangles if the stock is at a mid-point in its 52-week price range in case it shoots up and then down. I always set an automated exit.\n\nFidelity also has a cool probability calculator for options I use when selling puts. It tells you the probability of a stock falling below a certain range. I use that number to determine where to sell puts without a lot of risk. I do two standard deviations out and still buy a put with a lower strike price as insurance and sell weekly puts on high vol companies like GME and TSLA. My typical goal is to make 800 a week from these plays which I use to fund new call positions.\n\n**Be Wary of Analyst Opinions**\n\nIf you’ve invested actively for a while, you’ve likely noticed a peculiar trend: as a stock is cratering, analysts are increasing their target purchase price on it. This is not for your benefit. Brokerages often make investment recommendations based on the research provided by their analysts, so there is inherent bias in the system. \n\nI’ve also found that few analysts recommend sell ratings. They are much more likely to issue calls to buy stocks. One study found less than 1% issued sell recommendations. What’s more, the track records of these analysts are usually about the same as coin flipping. CNBC has gotten very into pushing analyst views from big name firms (e.g. “Goldman Sachs says these 3 stocks are ready to explode”), but if you look at the actual analyst behind the headline, they are often inexperienced or wrong more than right. \n\nI am embarrassed to say I lost a lot of money listening to analyst opinions and believing their price targets were rooted in reality. It’s easy to get caught up in the excitement of an upgrade and if 4 analysts are all touting the stock at the same time it can create a bit of a ponzi effect, which is tradable. But it boils down to needing to do your own research.\n\n**Good Things Come in Pairs**\n\nJust about every stock has a peer or competitor. Most have several. I stopped trying to pick the winner and now place bets on multiple leaders. I’ve owned Visa and Mastercard. I own OLO and TOST. I have a handful of, um, herbal medicine providers. I like ETSY and AMZN. If you bet on a small group of competitors, it’s likely one will pull ahead and your odds of success will increase substantially. \n\nSimilarly, it enables you to monitor the news of competitors which many investors use as a proxy. What do I mean? If Mastercard reports low cross border transactions, it’s highly probable Visa will be experiencing the same thing. So you can use the information from Mastercard to alter your position on Visa.\n\n**Exercise Financial Discipline**\n\nEven when I’ve been successful picking investments, I’ve run into problems with how to handle my successes. We’ve all experienced the thrill of being up huge and wondering how much higher it will go. That’s usually the moment I’ve learned I should be taking some gains. A few rules I try hard to follow but still screw up:\n\n1. Take Profits Often.   \nWhen an option or stock hits 100% return, I look to take some profit. It may not seem possible if you only bought 1 call, but it is. Just roll the call to a higher strike price and ensure the credit to your account equals your original investment plus substantial return. You can let the new call ride in case the stock gets going up. This ensures you cannot lose money. My rationale here is simple: at a 100% gain, I now have more to lose than I have to gain. You will be surprised how much this adds up when you trade often and how often you can be up 150% then down to -50% on the same positions, which makes me want to break things.  \nIf you find yourself up huge on an equity investment, switch to options. I did this for my BABA position and it saved me. When it hit 300, I was up 200%. I sold all the stock and bought options for the same number of shares. I had about 60K in stock and switched to something like 6K in options. When BABA crashed down to 150 I really didn’t care much. I was only down 4.5K instead of 30K. I had my profit of 40K locked in, so being down 4.5K was no big deal.  \n\n2. Fail Fast.   \nIf the option price sinks to -50% in value, it’s likely time to call it quits unless you have a solid reason not to (praying is not a strategy). The other half of the value left can easily be eaten up by the time decay in the value of the option as I wait for the turnaround and it gets closer to the expiration date. If there’s negative news driving this, I’m out. I want to fail quickly. That allows me time to take the remaining 50% and generate gains with it on a better investment. I think this is the hardest rule for me to stick to as I tend to be an optimist.  \n\n3. Profit Both Ways.   \nIf a stock I hold hits an all-time high in price or valuation, I look for a way to profit from the downside by selling covered calls or buying cheap puts. This enables you to stash some cash while riding the volatility wave. I hold Visa and when it hit 235 headed into earnings, I sold 3 calls and bought 10 puts. This offset a paper loss for me of \\~20K yesterday alone by 7.5K in gains, which I secured as real profits. Assuming Visa will recover, that 7K adds 9% to this year’s returns for Visa.  \n\n4. Be Patient but Not Greedy.   \nI have learned the hard way from selling positions days before they pop that it can take a while before the market catches on to my investment idea, especially if using good tools. Asset managers, wealth managers, and passive investors are usually looking for new investments every 3 months, not daily, so stocks can stay stuck in a channel for some time before the world catches on to its awesomeness. Example, I held Upstart from April to August this year and sold it because it was running flat. A couple weeks later the stock tripled. FML were the only words I could think of at the time. The second thought I had was that I should’ve bought just one call option to replace the stock I sold.  \nOn the flip side, once a stock does move a lot higher, don’t be greedy. What goes up fast can come down just as fast. I feel a lot worse watching a stock/option go up 200% then come down all the way or more than I do exiting with a 100% gain watching the stock go up more. Don’t chase the perfect trade. It’s a white whale. Just make money.  \n\n5. Everyone Has a Plan Until You Get Punched in the Mouth.   \nThis is as true in boxing (thanks Mike) as it is investing. That’s why it’s essential to have a plan A and a plan B should plan A not work out as you thought. Waiting through it can work, but it isn’t a very effective strategy for navigating a changing environment.   \nSo if my thesis is that the stock will do well with rising COVID rates and COVID rates stop rising, I try to have plan B ready. I keep a lot of notes. I track every trade. I review what went wrong with trades quarterly. I learn. I avoid the pity party as much as possible and drink vodka for the rest. I try not to fall in love with any stock. And I know that even if I lose 100K, there’s more money to be made in the coming years and decades if I stick it out.",
  "author_fullname": "t2_7wptiowj",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "I made $500,000 trading stocks and options in 18 months. These are the 15 things I did that worked best.",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "advice",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": true,
  "name": "t3_qi92fg",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.91,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 7428,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Advice",
  "can_mod_post": false,
  "score": 7428,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1635500383,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I failed a lot while trading before, during, and after succeeding. I haven’t counted it up, but it’s likely I encountered losses in excess of $150,000 from making mistakes that were easily avoided, rash decisions, and not giving myself enough time to test out strategies. Net net, I’m up $500,000, but I was asked to share some of what worked for me over IM quite a bit after my last post and figured I’d lay it for others who may not want to waste money learning the hard way, as I did. </p>\n\n<p>These are tactics and strategies that worked for me and my situation - someone trying to increase net worth, not increase income - and they may not be suitable for everyone.</p>\n\n<p><strong>Understand the Trading Environment</strong></p>\n\n<p>One mistake I made more than a few times was not understanding or paying attention to the trading environment I was in before picking out a strategy. What do I mean? I need to know where things are in the year, in relation to earnings season, and in relation to sector rotations. I need to pay attention to the macroeconomic indicators and I need to watch the VIX.</p>\n\n<p><strong>Mind the Gap Between Earnings Seasons</strong>. I can’t stress this enough. When earnings are strong and earnings data is coming in, investors watch those like hawks. Good earnings reports bring confidence to the market which yields a rising market. </p>\n\n<p>In between earnings seasons, there is less data from companies to review and investors pay closer attention to macroeconomic indicators like inflation, 10-year bond yields, and what the Fed is doing. This makes for a much jumpier market that’s more likely to pull back.  It’s also a time when the large asset managers rebalance their portfolios. They manage billions, so this can cause large movements to stocks and indexes as they shift to be overweight in one asset class (e.g. value stocks, energy) and underweight in other asset classes (e.g. growth stocks, technology).</p>\n\n<p>I try not to get caught by these patterns. I anticipate they are coming and invest accordingly. Simply put, I buy the pullback after the rotations have occurred and before earnings seasons begin as a general rule. Of course, I don’t do this if I expect a terrible earnings season. </p>\n\n<p><strong>Take Advantage of Sector Rotations</strong></p>\n\n<p>The sector rotations are pretty predictable if you track the performance of the different sectors over the year. I do this by plotting sector ETFs on a graph and noting when one begins to gain that was flat while others that were up a lot begin to flatten or pull back. Professional investors tend to sell off sectors that have been hot the last quarter or two and replace them with underperforming sectors that represent a better value or opportunity for upside. If I run the P/E ratios for the sector ETFs, I can get a quick sense of the sectors that have had a hot run up over 30 P/E vs other sectors that are more modestly valued. Just keep in mind that certain sectors, like Tech, will always be valued more richly given their growth. So looking at P/E ratios is not apples to apples - it’s just a way to note if historically that sector is at the high end of its own typical valuation range.</p>\n\n<p>Last year’s worst performing sector tends to be one of the best performing sectors the following year. This is because investors prefer to buy low and sell high. I don’t bet against this trend, it’s been around longer than I have and will continue to be around long after I’m dirt. </p>\n\n<p>Last year you couldn’t give away a barrel of oil. Last week, oil reached $80 a barrel. </p>\n\n<p>One of my favorite options strategies is to buy long dated calls at the money for sector ETFs that underperformed the previous year. I buy calls with expirations in 6-9 months, knowing that I will sell at my exit point which for me is a 100% gain. Sometimes this happens 6 weeks into the year; other times it takes 9 months. So long as I don’t overpay for the options, it works. I don’t like to pay more than the average price return of the sector. For example, if the sector ETF averages a 10% annual return and the ETF price is $100, I’m not going to buy a call for more than $10. That way, if the sector only moves 5%, I can still make money provided the price increase moves quickly enough.</p>\n\n<p><strong>Make The VIX Your Friend</strong></p>\n\n<p>The VIX is an easy way to gauge fear in the marketplace and is a hedge used widely against market pullbacks. If the VIX goes up, the market is worried. If it goes down, the market is getting bullish. If it stays up, everyone is on edge. It’s hard to make good trades in an environment where everyone is on edge and ready to hit the sell button. So be careful buying during times when the VIX is high. On the flip side, if the market has pulled back and the VIX starts to retreat away from its highs, that makes for a good entry point. </p>\n\n<p>Another interesting phenomenon is when the VIX is higher than normal, there tends to be a selloff the Friday before a long weekend. This happens because investors don’t want to sit through a long weekend that might hold worse news out of fear they will start their Tuesday with losses piling up. I’ve found this is a nice time to get some discounts at the end of the day Friday, or to run some weekly puts on Thursday afternoon before the dips. </p>\n\n<p><strong>Selecting Trades &amp; Investments</strong></p>\n\n<p><strong>Have an Allocation Plan</strong></p>\n\n<p>The first thing I recommend is determining, in advance, the amount of money you want to invest longer term vs the amount you want to invest short term vs the amount of money you might actually need to have available for life emergencies. Anything shorter term is higher risk, higher reward. I break my portfolio in the following buckets:</p>\n\n<ul>\n<li>25% long-term market investment using equity ETFs that largely track the SPX or do a breakdown between bonds and the market. I use Vanguard funds and a small cap value fund called CALF. I will not touch this money for 15+ years.</li>\n<li>25% cash. I like to be ready to buy the dips and have enough to spare. This way if a black swan event happens, I not only have money to invest, I have money to live on should things go bad for a while. This philosophy enabled me to buy options when COVID hit in 2020 without worrying if I could continue paying a mortgage for a year without a job. It’s also very useful if I have to roll covered calls to offset taxes and buy back expensive positions. I took this from Buffet FWIW.</li>\n<li>30% options, mostly in tax advantaged accounts (IRAs). I aim for a 50% annual return overall with this portfolio, though it fluctuates a lot year to year.</li>\n<li>10% long term blue chips stocks like Visa, Apple, MSFT, etc. I defend these positions when the stocks get overheated by selling calls on them and/or buying puts out of the money that expire after a typical sector rotation would occur. That can generate some additional income or help lessen the sting if the stock falls. </li>\n<li>6% long-term bets in a Roth IRA. These are equities I think all have a chance at a 10X return but that will take 5-10 years. It’s a lot of IPOs, small tech companies, and biotechs. I have to stomach pullbacks in this portfolio of 40-50% on the belief that a few of the 30 in here will more than compensate for it. This is a new strategy for me so I’ll let you know in 10 years if it works.</li>\n<li>3% leveraged hedges.These are puts on my own positions, stocks, or the market at large. Generally I use VIX calls, buy puts, occasionally buy calls on the SPXS, and run strangles on investments (betting both up and down on the same stock using calls and puts).<br/></li>\n<li>1% in other things I can’t mention due to the bots in here but they rhyme with tiptoe.</li>\n</ul>\n\n<p><strong>Use Technologies to Find Ideas</strong></p>\n\n<p>Unless you want to spend 8 hours a day reading news or are OK getting all your ideas from meme stocks and friends, you need to use tools to help you locate investment/trade ideas and be willing to pay for them. I value my time and am willing to pay .5% of my portfolio a year if it saves me time, and more if it generates higher returns. </p>\n\n<p>I’ve tried about a dozen or so services, including stock picking services like Fool and Investorsplace. Ultimately I decided the stock picking sites were not working for me because I did not want to wait 5 years to find out if they were the right recommendations and lost a lot of money learning that lesson on their pump and dumps. So I switched to analytics tools and my Fidelity platform. </p>\n\n<p>My favorite tools to use are Zack’s VGM score, Levelfields, and Fidelity. The Zack’s VGM measures a stock’s value, growth rate, and momentum. It’s an easy screen I can run off the basic level subscription to get a list of companies to look at. The caveat is that you need to run this screen often because sometimes the companies on the list get stale and have already moved 99% of the way they are going to move. So you need to keep an eye on what’s new to the list to avoid losing money. That part is crucial. </p>\n\n<p>The list usually represents companies that are well valued and poised to move up over the next 6-9 months. Warning: they can move very slowly so be patient and set your target exit to automatically exit. I use Fidelity to do my own due diligence on the stocks from there, examining their actual growth and earnings rates and ensuring there is no negative news against them which could drive down the price.</p>\n\n<p>A friend recently turned me on to an AI tool called Levelfields. They have a lot of news alerts but only for the types of events that matter and are organized thematically. It helps me find trades on news events with high returns or get in early on the small to mid-cap companies you don’t usually hear about which fall between the cracks in the penny stock discussions and cnbc favorites. They often send alerts on company events before there’s any news out, which is really helpful. The interface shows you how stocks perform when these events happen, so it’s easy to figure out my entry and exit points and statistical likelihood of success.<br/>\nI use it a lot for pinpointing entry/exit points from options trades and have bought stock in a few companies I hadn’t ever heard of before that were absolutely crushing it on revenue and earnings. Not sure why, but they never came up in any of my Fidelity stock screens. I suspect it’s because there’s a lag in the data Fidelity is getting from S&amp;P but haven’t confirmed this. They send a lot of high quality alerts and my only wish is that they’d have a better way to rank the stocks in the alerts so I didn’t have to look up the stocks on Fidelity.</p>\n\n<p>I use Fidelity for basic news reading, running stock screens for high growth stocks at decent valuations, looking deeply at the history of earnings results, actually trading options, and for their options scanner which tracks abnormal option activity.  I sell puts when I see abnormal call volume and run strangles if the stock is at a mid-point in its 52-week price range in case it shoots up and then down. I always set an automated exit.</p>\n\n<p>Fidelity also has a cool probability calculator for options I use when selling puts. It tells you the probability of a stock falling below a certain range. I use that number to determine where to sell puts without a lot of risk. I do two standard deviations out and still buy a put with a lower strike price as insurance and sell weekly puts on high vol companies like GME and TSLA. My typical goal is to make 800 a week from these plays which I use to fund new call positions.</p>\n\n<p><strong>Be Wary of Analyst Opinions</strong></p>\n\n<p>If you’ve invested actively for a while, you’ve likely noticed a peculiar trend: as a stock is cratering, analysts are increasing their target purchase price on it. This is not for your benefit. Brokerages often make investment recommendations based on the research provided by their analysts, so there is inherent bias in the system. </p>\n\n<p>I’ve also found that few analysts recommend sell ratings. They are much more likely to issue calls to buy stocks. One study found less than 1% issued sell recommendations. What’s more, the track records of these analysts are usually about the same as coin flipping. CNBC has gotten very into pushing analyst views from big name firms (e.g. “Goldman Sachs says these 3 stocks are ready to explode”), but if you look at the actual analyst behind the headline, they are often inexperienced or wrong more than right. </p>\n\n<p>I am embarrassed to say I lost a lot of money listening to analyst opinions and believing their price targets were rooted in reality. It’s easy to get caught up in the excitement of an upgrade and if 4 analysts are all touting the stock at the same time it can create a bit of a ponzi effect, which is tradable. But it boils down to needing to do your own research.</p>\n\n<p><strong>Good Things Come in Pairs</strong></p>\n\n<p>Just about every stock has a peer or competitor. Most have several. I stopped trying to pick the winner and now place bets on multiple leaders. I’ve owned Visa and Mastercard. I own OLO and TOST. I have a handful of, um, herbal medicine providers. I like ETSY and AMZN. If you bet on a small group of competitors, it’s likely one will pull ahead and your odds of success will increase substantially. </p>\n\n<p>Similarly, it enables you to monitor the news of competitors which many investors use as a proxy. What do I mean? If Mastercard reports low cross border transactions, it’s highly probable Visa will be experiencing the same thing. So you can use the information from Mastercard to alter your position on Visa.</p>\n\n<p><strong>Exercise Financial Discipline</strong></p>\n\n<p>Even when I’ve been successful picking investments, I’ve run into problems with how to handle my successes. We’ve all experienced the thrill of being up huge and wondering how much higher it will go. That’s usually the moment I’ve learned I should be taking some gains. A few rules I try hard to follow but still screw up:</p>\n\n<ol>\n<li><p>Take Profits Often.<br/>\nWhen an option or stock hits 100% return, I look to take some profit. It may not seem possible if you only bought 1 call, but it is. Just roll the call to a higher strike price and ensure the credit to your account equals your original investment plus substantial return. You can let the new call ride in case the stock gets going up. This ensures you cannot lose money. My rationale here is simple: at a 100% gain, I now have more to lose than I have to gain. You will be surprised how much this adds up when you trade often and how often you can be up 150% then down to -50% on the same positions, which makes me want to break things.<br/>\nIf you find yourself up huge on an equity investment, switch to options. I did this for my BABA position and it saved me. When it hit 300, I was up 200%. I sold all the stock and bought options for the same number of shares. I had about 60K in stock and switched to something like 6K in options. When BABA crashed down to 150 I really didn’t care much. I was only down 4.5K instead of 30K. I had my profit of 40K locked in, so being down 4.5K was no big deal.  </p></li>\n<li><p>Fail Fast.<br/>\nIf the option price sinks to -50% in value, it’s likely time to call it quits unless you have a solid reason not to (praying is not a strategy). The other half of the value left can easily be eaten up by the time decay in the value of the option as I wait for the turnaround and it gets closer to the expiration date. If there’s negative news driving this, I’m out. I want to fail quickly. That allows me time to take the remaining 50% and generate gains with it on a better investment. I think this is the hardest rule for me to stick to as I tend to be an optimist.  </p></li>\n<li><p>Profit Both Ways.<br/>\nIf a stock I hold hits an all-time high in price or valuation, I look for a way to profit from the downside by selling covered calls or buying cheap puts. This enables you to stash some cash while riding the volatility wave. I hold Visa and when it hit 235 headed into earnings, I sold 3 calls and bought 10 puts. This offset a paper loss for me of ~20K yesterday alone by 7.5K in gains, which I secured as real profits. Assuming Visa will recover, that 7K adds 9% to this year’s returns for Visa.  </p></li>\n<li><p>Be Patient but Not Greedy.<br/>\nI have learned the hard way from selling positions days before they pop that it can take a while before the market catches on to my investment idea, especially if using good tools. Asset managers, wealth managers, and passive investors are usually looking for new investments every 3 months, not daily, so stocks can stay stuck in a channel for some time before the world catches on to its awesomeness. Example, I held Upstart from April to August this year and sold it because it was running flat. A couple weeks later the stock tripled. FML were the only words I could think of at the time. The second thought I had was that I should’ve bought just one call option to replace the stock I sold.<br/>\nOn the flip side, once a stock does move a lot higher, don’t be greedy. What goes up fast can come down just as fast. I feel a lot worse watching a stock/option go up 200% then come down all the way or more than I do exiting with a 100% gain watching the stock go up more. Don’t chase the perfect trade. It’s a white whale. Just make money.  </p></li>\n<li><p>Everyone Has a Plan Until You Get Punched in the Mouth.<br/>\nThis is as true in boxing (thanks Mike) as it is investing. That’s why it’s essential to have a plan A and a plan B should plan A not work out as you thought. Waiting through it can work, but it isn’t a very effective strategy for navigating a changing environment.<br/>\nSo if my thesis is that the stock will do well with rising COVID rates and COVID rates stop rising, I try to have plan B ready. I keep a lot of notes. I track every trade. I review what went wrong with trades quarterly. I learn. I avoid the pity party as much as possible and drink vodka for the rest. I try not to fall in love with any stock. And I know that even if I lose 100K, there’s more money to be made in the coming years and decades if I stick it out.</p></li>\n</ol>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "823be0a6-65e6-11e5-9784-125ee764bc01",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#646d73",
  "id": "qi92fg",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "Swingtrader79",
  "discussion_type": null,
  "num_comments": 16,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/qi92fg/i_made_500000_trading_stocks_and_options_in_18/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/qi92fg/i_made_500000_trading_stocks_and_options_in_18/",
  "subreddit_subscribers": 3180399,
  "created_utc": 1635503269,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1635500383,
  "the_new_excerpt": "I failed a lot while trading before, during, and after succeeding. I haven’t\ncounted it up, but it’s likely I encountered losses in excess of $150,000 from\nmaking mistakes that were easily avoided, rash decisions, and not giving myself\nenough time to test out strategies. Net net, I’m up $500,000,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "成功する前、成功している間、そして成功した後も、トレード中にたくさんの失敗をしました。数えたことはありませんが\n数えたことはありませんが、おそらく15万ドルを超える損失に遭遇したと思います。\n簡単に回避できるミスを犯したり、軽率な判断をしたり、戦略を試す時間を十分に取れなかったりしたことで\nまた、戦略を試すのに十分な時間がなかったこともあります。ネットでは50万ドルのプラスですが...。",
      "title": "18ヶ月で株とオプションの取引で50万ドル稼ぎました。これらは、私が行った中で最も効果があった15のことです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在成功之前、期间和之后的交易中，我失败了很多次。我没有\n我没有计算过，但我可能遇到了超过150,000美元的损失。\n犯了很容易避免的错误，作出了轻率的决定，以及没有给自己足够的时间来测试策略。\n足够的时间来测试策略。净利润，我增加了50万美元，...",
      "title": "我在18个月内通过交易股票和期权赚了50万美元。这是我做的最有效的15件事。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在成功之前、期間和之後的交易中，我失敗了很多次。我沒有\n我沒有計算過，但我可能遇到了超過150,000美元的損失。\n犯了很容易避免的錯誤，作出了輕率的決定，以及沒有給自己足夠的時間來測試策略。\n足夠的時間來測試策略。淨利潤，我增加了50萬美元，...",
      "title": "我在18個月內通過交易股票和期權賺了50萬美元。這是我做的最有效的15件事。"
    }
  ],
  "source_updated_at": 1636105285972
}