{
  "author": "GraduatedRadish",
  "original_created_utc": 1660654194,
  "title": "My gf suddenly has mixed feelings about our relationship. Should I be worried?",
  "created_utc": 1660665153,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Due to vacations we&amp;#39;ve been apart for a month. Been together for 8 months rn. We both love each other but recently she shared that she feels kind of empty when saying I love you. In her words, our photos together dont feel the same to her. I consolidated her and she seemed better. But she mentioned it again today. Should I be worried? I know feelings are complicated and shit happens but I don&amp;quot;t wanna lose her. I wanna help her but that doesn&amp;#39;t mean I wanna force love upon her. We are gonna talk again tonight about it. But I&amp;#39;m really scared. What if it&amp;#39;s just something that happens, and she doesn&amp;#39;t feel love for me anymore? Or what if it&amp;#39;s unlnowingly due to a bland relationship? Vacation also took a toll on our time, we couldn&amp;#39;t find much to talk about in the last week of the vacation.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 20 and she&amp;#39;s 19&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 128,
  "permalink": "/r/TooAfraidToAsk/comments/wptibr/my_gf_suddenly_has_mixed_feelings_about_our/",
  "subreddit": "TooAfraidToAsk",
  "id": "wptibr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Due to vacations we've been apart for a month. Been together for 8 months rn. We\nboth love each other but recently she shared that she feels kind of empty when\nsaying I love you. In her words, our photos together dont feel the same to her.\nI consolidated her and she seemed better. But she mentioned…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "休暇のため、1ヶ月間ご無沙汰しています。現在、8ヶ月間一緒にいます。私たち\nお互いに愛し合っているのですが、最近彼女が、「愛してる」と言う時、なんだか空しい気がすると言っていました。\nと言っていました。彼女の言葉を借りれば、一緒に撮った写真が同じように感じられないということです。\n私は彼女を説得し、彼女は良くなったように見えました。しかし、彼女は言った...",
      "title": "私の妻は突然、私たちの関係に対して複雑な感情を抱くようになりました。私は心配するべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "由于休假，我们已经分开一个月了。现在已经在一起8个月了。我们\n我们都爱对方，但最近她说她感到有点空虚，当\n说我爱你。用她的话说，我们在一起的照片对她来说感觉不一样了。\n我巩固了她，她看起来好多了。但她提到...",
      "title": "我的女友突然对我们的关系产生了复杂的感觉。我应该担心吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "由於休假，我們已經分開一個月了。現在已經在一起8個月了。我們\n我們都愛對方，但最近她說她感到有點空虛，當\n說我愛你。用她的話說，我們在一起的照片對她來說感覺不一樣了。\n我鞏固了她，她看起來好多了。但她提到...",
      "title": "我的女友突然對我們的關係產生了複雜的感覺。我應該擔心嗎？"
    }
  ]
}