{
  "author": "emc87",
  "the_new_excerpt": "The current administration is discussing a few proposals for a tax on financial\ntransactions. Most are in the realm of a 0.1% tax on equities and bonds and a\nsmaller tax on derivatives. The estimated revenue from this tax varies based on\nwho you ask, somewhere between a few hundred billion to…",
  "original_created_utc": 1615132157,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "本届政府正在讨论对金融征税的几个建议。\n的交易。大多数都是在股票和债券征收0.1%的税和\n对衍生品征收较少的税。该税种的估计收入根据以下因素而变化：\n你问谁，介于几千亿到... ...",
      "title": "金融证券交易税"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "本屆政府正在討論對金融徵稅的幾個建議。\n的交易。大多數都是在股票和債券徵收0.1%的稅和\n對衍生品徵收較少的稅。該稅種的估計收入根據以下因素而變化：\n你問誰，介於幾千億到... ...",
      "title": "金融證券交易稅"
    }
  ],
  "title": "Financial Securities Transaction Taxes",
  "created_utc": 1615145182,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The current administration is discussing a few proposals for a tax on financial transactions.  Most are in the realm of a 0.1% tax on equities and bonds and a smaller tax on derivatives.  The estimated revenue from this tax varies based on who you ask, somewhere between a few hundred billion to upwards of 1 trillion over a decade.</p>\n\n<p><strong>Securities Transaction Taxes and Market Quality</strong> studies the transaction tax levied in NY in the bulk of the 1900s. It&#39;s interesting in that it studies the same market as the proposed tax, but the NY tax was local and had a side effect of pushing volumes to other venues (AMEX) which wouldn&#39;t occur in a national STT. It can be found here for download or viewing for free: <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract%5C_id=1980185\">https://papers.ssrn.com/sol3/papers.cfm?abstract\\_id=1980185</a>.</p>\n\n<p>Results</p>\n\n<ul>\n<li>Portfolio Volatility - results suggest portfolio does not move in opposite direction of STT levels (counter to views of tax proponents).</li>\n<li>Bid/Ask Spreads - They use a proxy measure as bid/ask spreads aren&#39;t available for the time period, but find a positive relationship between STT and bid/ask spread width.</li>\n<li>Volumes - In 8/9 STT changes, volume moved in the opposite direction of the STT changes when an alternative (AMEX) was available. When there was no alternative (NYSE or don&#39;t trade), 4/9 cases had a statistically significant reduction in volume while 5/9 were not statistically significant in either direction.</li>\n</ul>\n\n<p>Generally, the study found that STTs have an inverse relationship with market quality.  </p>\n\n<p>&#x200B;</p>\n\n<p><strong>Securities Transactions Taxes and Financial Markets</strong> published by the IMF is a somewhat more general paper, but for a period focuses on Sweden’s experiment with STTs for about eight years. It can be found here: <a href=\"https://www.imf.org/external/pubs/ft/wp/2001/wp0151.pdf\">https://www.imf.org/external/pubs/ft/wp/2001/wp0151.pdf</a>  </p>\n\n<p>Sweden:</p>\n\n<ul>\n<li>Taxes levied were 1% on stocks and 2% on options round trip.</li>\n<li>Revenue was disappointing, with widespread avoidance being a major reason. Foreign investors placed orders in NY and London, Domestic investors established off-shore accounts to use foreign brokers.</li>\n</ul>\n\n<p>General Conclusions: </p>\n\n<ul>\n<li>STTs increase price volatility</li>\n<li>STTs increase demand for derivatives, decrease demand for stocks and bonds.</li>\n<li>STTs decrease volumes</li>\n<li>STTs are similar to capital controls, and both suffer from implementation and enforcement problems</li>\n<li>STTs can obstruct price discovery and stabilization and inhibit information efficiency of financial markets.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>It&#39;s relatively undisputed that the transaction taxes have a negative effect on the market as a whole, so the main question is: Is the effect on the market worth the small revenue increase?  </p>\n\n<p>My personal opinions are that no, there are better ways to raise that revenue without disrupting the financial markets.</p>\n</div><!-- SC_ON -->",
  "score": 130,
  "permalink": "/r/investing/comments/lzt88b/financial_securities_transaction_taxes/",
  "subreddit": "investing",
  "id": "lzt88b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542574797
}