{
  "author": "callmedemorex",
  "original_created_utc": 1633413350,
  "title": "Why are women so surprised that penises can stretch?",
  "created_utc": 1633422328,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My girlfriend was playing with my balls and she was amazed that they weren’t perfect spheres but more like eggs. Then she tried to switch em around (left to right which kinda scared me) and lost her shit. I took the opportunity to show her all the amazing penis and ball maneuvers I could think of like stretching ball skin apart to make it flat. She was in awe of how much fun it seemed and said she was jealous. I’m guessing this is just something new to them? She showed me the fabled labia clap but that was all she really had.</p>\n</div><!-- SC_ON -->",
  "score": 204,
  "permalink": "/r/TooAfraidToAsk/comments/q1ol0i/why_are_women_so_surprised_that_penises_can/",
  "subreddit": "TooAfraidToAsk",
  "id": "q1ol0i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My girlfriend was playing with my balls and she was amazed that they weren’t\nperfect spheres but more like eggs. Then she tried to switch em around (left to\nright which kinda scared me) and lost her shit. I took the opportunity to show\nher all the amazing penis and ball maneuvers I could think of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ガールフレンドが僕のボールで遊んでいて、ボールが完全な球体ではなく、卵のようだと驚いていました。\n完全な球体ではなく、卵のようだと驚いていました。その後、彼女はそれらを入れ替えようとしました（左から右に）。\n切り替えようとして（左から右へ、ちょっと怖かった）、気が狂ったようになった。この機会に、私は彼女に\n私はこの機会に、彼女に思いつく限りの素晴らしいペニスとボールの操作を見せてあげました...。",
      "title": "なぜ女性はペニスが伸びることに驚くのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的女朋友在玩我的蛋蛋，她很惊讶，它们不是完美的球体，而更像鸡蛋。\n完美的球体，而更像是鸡蛋。然后她试着把它们换过来（从左到右）。\n这有点吓到我了），然后她失去了她的狗屎。我利用这个机会向她展示了\n我趁机向她展示了我能想到的所有惊人的阴茎和球的动作......",
      "title": "为什么女人对阴茎可以拉伸感到如此惊讶？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的女朋友在玩我的蛋蛋，她很驚訝，它們不是完美的球體，而更像雞蛋。\n完美的球體，而更像是雞蛋。然後她試着把它們換過來（從左到右）。\n這有點嚇到我了），然後她失去了她的狗屎。我利用這個機會向她展示了\n我趁機向她展示了我能想到的所有驚人的陰莖和球的動作......",
      "title": "爲什麼女人對陰莖可以拉伸感到如此驚訝？"
    }
  ]
}