{
  "author": "gdj11",
  "original_created_utc": 1627179931,
  "title": "FYI - Simply linking to a post on r/CryptoCurrency will get you a permanent lifetime ban",
  "created_utc": 1627188294,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;d like to bring attention to a rule in <a href=\"/r/CryptoCurrency\">r/CryptoCurrency</a> that most of you do not know about, but <strong>that is actively enforced</strong>, and which I do not agree with whatsoever. In my opinion it goes against the core idea behind Reddit and is a gross abuse of moderator power.</p>\n\n<p>(From: <a href=\"https://old.reddit.com/r/CryptoCurrency/wiki/expanded_rules\">https://old.reddit.com/r/CryptoCurrency/wiki/expanded_rules</a>)</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>You cannot link to <a href=\"/r/Cryptocurrency\">r/Cryptocurrency</a> posts or comments from outside communities.</p>\n</blockquote>\n\n<p>and</p>\n\n<blockquote>\n<p>Please note that simply linking a reddit post is an implicit solicitation of votes. A lifetime ban will be given to the user who does the linking.</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p>I first interpreted this rule as meaning you cannot create your own post on <a href=\"/r/CryptoCurrency\">r/CryptoCurrency</a> and then share that link in other communities and ask people to upvote it, which would make sense, because that is brigading. But this is not the case. Simple copying the link to <strong><em>someone else&#39;s post</em></strong> and pasting it into <strong><em>any</em></strong> other community (e.g. Facebook, Telegram, Discord, another subreddit, etc.) will result in a LIFETIME PERMANENT BAN from <a href=\"/r/CryptoCurrency\">r/CryptoCurrency</a> if the moderators find out your Reddit username.</p>\n\n<p>These lifetime bans are given without warning and are permanent. I do not agree with this rule and everyone here should know the consequences of simply copying and pasting a link to a post they enjoy. Reddit has a &quot;Share&quot; button on every post which allows you to copy the link and share it, but if you actually share that link you can face a permanent lifetime ban from <a href=\"/r/CryptoCurrency\">r/CryptoCurrency</a>. This is not right.</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/or3891/fyi_simply_linking_to_a_post_on_rcryptocurrency/",
  "subreddit": "CryptoCurrency",
  "id": "or3891",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'd like to bring attention to a rule in r/CryptoCurrency [/r/CryptoCurrency]\nthat most of you do not know about, but that is actively enforced, and which I\ndo not agree with whatsoever. In my opinion it goes against the core idea behind\nReddit and is a gross abuse of moderator power.\n\n(From:…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/CryptoCurrency [/r/CryptoCurrency]のあるルールに注目してほしいと思います。\nほとんどの人は知らないと思いますが、積極的に施行されているルールで、私は全く同意しません。\n私は全く同意していません。私の意見では、これはRedditの背後にある中核的な考え方に反しています。\n私の意見では、これはRedditの基本理念に反しており、モデレーターの権限を著しく乱用しています。\n\n(From:...",
      "title": "FYI - r/CryptoCurrencyの投稿にリンクするだけで、永久追放されます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想提请注意r/CryptoCurrency [/r/CryptoCurrency]中的一条规则。\n你们中的大多数人都不知道，但却在积极执行，而且我\n我完全不同意。在我看来，这违背了Reddit的核心理念，是对Reddit的严重滥用。\n我认为这违背了Reddit的核心理念，是对版主权力的严重滥用。\n\n(From: ...",
      "title": "参考 - 仅仅链接到r/CryptoCurrency上的一个帖子，就会让你被永久禁言。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想提請注意r/CryptoCurrency [/r/CryptoCurrency]中的一條規則。\n你們中的大多數人都不知道，但卻在積極執行，而且我\n我完全不同意。在我看來，這違背了Reddit的核心理念，是對Reddit的嚴重濫用。\n我認爲這違背了Reddit的核心理念，是對版主權力的嚴重濫用。\n\n(From: ...",
      "title": "參考 - 僅僅鏈接到r/CryptoCurrency上的一個帖子，就會讓你被永久禁言。"
    }
  ]
}