{
  "author": "roymustang261",
  "original_created_utc": 1635442815,
  "title": "If you bought $100 worth of meme coins a year ago, you probably would have sold for $200 a few months later. Its easy to say what you could've done but its hard to HODL",
  "created_utc": 1635456635,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have seen a lot of people say, &#39;if you bought $100 worth of SHIB a year ago you would have $70 Million&quot; , &quot;If you bought $1000 worth of SHIB 11 months ago you would have a Billion dollars&quot; but in reality you would have sold way early. There is no way to know which projects will do well, specially if they&#39;re meme coins and most people don&#39;t have the money to throw around $100 on random meme coins. If you get in early on a project you will most likely sell way early or HODL for too long and eventually it will go down. Have conviction in your projects and recognize that getting rich from meme coins is like winning the lottery, you can&#39;t know which will pump. Increasing your wealth slowly over a long period of time is better than throwing away money at lottery tickets</p>\n</div><!-- SC_ON -->",
  "score": 241,
  "permalink": "/r/CryptoCurrency/comments/qhsanw/if_you_bought_100_worth_of_meme_coins_a_year_ago/",
  "subreddit": "CryptoCurrency",
  "id": "qhsanw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have seen a lot of people say, 'if you bought $100 worth of SHIB a year ago\nyou would have $70 Million\" , \"If you bought $1000 worth of SHIB 11 months ago\nyou would have a Billion dollars\" but in reality you would have sold way early.\nThere is no way to know which projects will do well, specially…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1年前に100ドル分のSHIBを買っていたら、70ミリオンになっていた」という人をたくさん見てきました。\n1年前に100ドル分のSHIBを買っていたら7000万ドルになっていた」「11ヶ月前に1000ドル分のSHIBを買っていたら\n11ヶ月前に1,000ドルのSHIBを買っていたら10億ドルになっていた」と言う人をよく見かけますが、実際にはもっと早く売っていたでしょう。\nどのプロジェクトがうまくいくかを知る方法はありません、特に...。",
      "title": "1年前に100ドル分のミームコインを買ったとしても、おそらく数ヶ月後には200ドルで売れていたでしょう。何ができたかを言うのは簡単ですが、HODLするのは難しいです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到很多人说，'如果你一年前买了价值100美元的SHIB\n你就会有7000万美元\"，\"如果你11个月前买了价值1000美元的SHIB\n你就会有10亿美元\"，但实际上你会提前卖掉。\n没有办法知道哪些项目会做得好，特别是...",
      "title": "如果你一年前买了价值100美元的纪念币，几个月后可能会卖到200美元。说你可以做什么很容易，但很难做到HODL。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到很多人說，'如果你一年前買了價值100美元的SHIB\n你就會有7000萬美元\"，\"如果你11個月前買了價值1000美元的SHIB\n你就會有10億美元\"，但實際上你會提前賣掉。\n沒有辦法知道哪些項目會做得好，特別是...",
      "title": "如果你一年前買了價值100美元的紀念幣，幾個月後可能會賣到200美元。說你可以做什麼很容易，但很難做到HODL。"
    }
  ]
}