{
  "author": "NoelPhD2024",
  "original_created_utc": 1634917663,
  "title": "To those who did not see this pullback coming, have you ever looked at a chart before?",
  "created_utc": 1634927439,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A pullback or price correction is one of if not the most common price action after an asset reaches an ATH or just pumps for a while. It is almost guaranteed to occur.  This happens for a few reasons (this list is not exhaustive) :</p>\n\n<ol>\n<li>Profit taking. Believe it or not, people actually take out profits or their original investments after an ATH is reached or profit is made in general.</li>\n<li>Fear. An ATH is called an ATH because it is the first time an asset has reached that price and that is the highest price it has ever reached. Some fear that it will not continue to rise after it reaches an ATH is normal</li>\n<li>Whale manipulation. Whales love to sell at ATH to manipulate the price. A whale could buy 1k bitcoins at 62k, sell those same 1k coins at ATH 65K. If the  buying volume is low enough, this could significantly affect the price of the asset, causing a dip to below where they originally bought in. The dip then sends the first 2 reasons I mentioned into action by other traders. Then the whale buys in at much lower price.</li>\n</ol>\n\n<p>So don&#39;t always freak out when green days are followed by red days. If the asset you are investing in is a decent project, there is probably no need to fear.</p>\n</div><!-- SC_ON -->",
  "score": 192,
  "permalink": "/r/CryptoCurrency/comments/qdjr31/to_those_who_did_not_see_this_pullback_coming/",
  "subreddit": "CryptoCurrency",
  "id": "qdjr31",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A pullback or price correction is one of if not the most common price action\nafter an asset reaches an ATH or just pumps for a while. It is almost guaranteed\nto occur. This happens for a few reasons (this list is not exhaustive) :\n\n 1. Profit taking. Believe it or not, people actually take out…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "プルバックまたは価格修正は、最も一般的な価格行動の一つである。\nは、ある資産がATHに到達した後、あるいはしばらくの間パンプした後の最も一般的な価格行動の一つです。これは、ほぼ確実に\n起こります。これにはいくつかの理由があります（このリストは網羅的ではありません）。\n\n 1. 利益確定。信じられないかもしれませんが、人々は実際に利益を得ています...",
      "title": "このプルバックを見抜けなかった人は、今までにチャートを見たことがあるだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "回调或价格修正是一种最常见的价格行为，如果不是的话。\n在一项资产达到ATH后或只是抽动了一段时间。它几乎可以保证\n会发生。发生这种情况有几个原因（这个清单并不详尽）。\n\n 1. 获利回吐。信不信由你，人们实际上是在为他们自己的利益着想。",
      "title": "对于那些没有看到这次回调的人来说，你以前看过图表吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "回調或價格修正是一種最常見的價格行爲，如果不是的話。\n在一項資產達到ATH後或只是抽動了一段時間。它幾乎可以保證\n會發生。發生這種情況有幾個原因（這個清單並不詳盡）。\n\n 1. 獲利回吐。信不信由你，人們實際上是在爲他們自己的利益着想。",
      "title": "對於那些沒有看到這次回調的人來說，你以前看過圖表嗎？"
    }
  ]
}