{
  "author": "hutch_man0",
  "the_new_excerpt": "I recently was well overallocated to and got hit hard in a recent downturn that\nwas much sharper than I imagined. It was painful. Sold low, then the holding\npopped up hugely the next few days. So then I bought back higher, at half my\noriginal allocation, only to see it bleed down once again. On the…",
  "original_created_utc": 1617301577,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我最近在最近的经济低迷中得到了很好的整体配置，并受到了严重的打击，这也是我的工作。\n比我想象的要犀利得多。很痛苦。低价卖出，然后持股\n在接下来的几天里出现了大量的。所以后来我又买回了更高的价格，在我的一半的\n原本的分配，只见它再次流下。在...",
      "title": "你最大的投资错误是什么，你从中学到了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近在最近的經濟低迷中得到了很好的整體配置，並受到了嚴重的打擊，這也是我的工作。\n比我想象的要犀利得多。很痛苦。低價賣出，然後持股\n在接下來的幾天裏出現了大量的。所以後來我又買回了更高的價格，在我的一半的\n原本的分配，只見它再次流下。在...",
      "title": "你最大的投資錯誤是什麼，你從中學到了什麼？"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "私は最近、全体的にうまく配置されていましたが、最近の景気後退で大きな打撃を受けました。\n想像していたよりもはるかに厳しいものでした。辛かったですね。安く売って、その後持ち株が\nは数日後に大きく上昇しました。そこで、当初の配分の半分の高さで買い戻しました。\n買い戻しましたが、再び下落してしまいました。その結果...",
      "title": "あなたの投資における最大の失敗と、そこから学んだことは何ですか？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "私は最近、全体的にうまく配置されていましたが、最近の景気後退で大きな打撃を受けました。\n想像していたよりもはるかに厳しいものでした。辛かったですね。安く売って、その後持ち株が\nは数日後に大きく上昇しました。そこで、当初の配分の半分の高さで買い戻しました。\n買い戻しましたが、再び下落してしまいました。その結果...",
      "title": "あなたの投資における最大の失敗と、そこから学んだことは何ですか？"
    }
  ],
  "title": "What was your biggest investing mistake and what did you learn from it?",
  "created_utc": 1617338932,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently was well overallocated to and got hit hard in a recent downturn that was much sharper than I imagined. It was painful. Sold low, then the holding popped up hugely the next few days. So then I bought back higher, at half my original allocation, only to see it bleed down once again. On the sale, I made a 20% cap gain, and I&#39;m happy to have an allocation I am comfortable with now. But it was an interesting experience and some valuable lessons learned: </p>\n\n<ol>\n<li><p>set limits on allocation</p></li>\n<li><p>don&#39;t get (too) greedy</p></li>\n<li><p>don&#39;t listen to redditors deriding you for your decision. and certainly don&#39;t let them influence any decision going forward. In the end, you may be right, they may be wrong. they don&#39;t know you or your portfolio. better yet, don&#39;t post your investment decisions on reddit in the heat of the moment!</p></li>\n<li><p>have conviction in your decision. know the current (negative) environment and why you made your decision. base it on hard numbers. selling in a downturn isn&#39;t bad in and of itself. set conditions at which you would reconsider buying back in the future. if you don&#39;t have conviction, then do nothing.</p></li>\n<li><p>remember why you entered into the position in the first place. has anything fundamentally changed?</p></li>\n<li><p>it&#39;s just paper money until you sell.</p></li>\n<li><p>FOMO is a b#%ch. don&#39;t let it control you. if the holding pops back up you really really need #4. plus downturns are sawtoothed, not straight down. if the negative environment hasn&#39;t changed, snap backs are common, before a further downturn takes place.</p></li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 67,
  "permalink": "/r/stocks/comments/mi1n4h/what_was_your_biggest_investing_mistake_and_what/",
  "subreddit": "stocks",
  "id": "mi1n4h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961878971
}