{
  "author": "pdwp90",
  "the_new_excerpt": "EDIT: Based on the fact that a number of comments seem to have been made without\nreading beyond the first 9 words of the title, and the fact that this is sitting\nat 60% upvoted, I'd encourage you to at least read to the TLDR.\n\nI usually stick to providing raw data, but this post has a little bit of…",
  "original_created_utc": 1614795628,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：基于一些评论似乎没有被提出。\n阅读超过标题的前9个字，以及事实上，这是在坐。\n在60%的上票，我鼓励你至少读到TLDR。\n\n我通常坚持提供原始数据，但这篇文章有一点... ...",
      "title": "\"RKT被推崇为分散GME的注意力\"：定量分析。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：基於一些評論似乎沒有被提出。\n閱讀超過標題的前9個字，以及事實上，這是在坐。\n在60%的上票，我鼓勵你至少讀到TLDR。\n\n我通常堅持提供原始數據，但這篇文章有一點... ...",
      "title": "\"RKT被推崇爲分散GME的注意力\"：定量分析。"
    }
  ],
  "title": "\"RKT is being pushed as a distraction from GME\": a quantitative analysis",
  "created_utc": 1614870703,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>EDIT: Based on the fact that a number of comments seem to have been made without reading beyond the first 9 words of the title, and the fact that this is sitting at 60% upvoted, I&#39;d encourage you to at least read to the TLDR.</p>\n\n<p>I usually stick to providing raw data, but this post has a little bit of added analysis. I don’t own $GME or $RKT (I don&#39;t actively invest to avoid accusations of bias in my data) and don’t like either stock over the other. I do like WSB though and don’t like baseless conspiracy theories, and I have seen a lot of conspiracy theories flying around WSB recently without much evidence to accompany them. Most recently, I got flooded by comments like this on my data post yesterday.</p>\n\n<p><a href=\"https://preview.redd.it/baa7ritypuk61.png?width=1432&amp;format=png&amp;auto=webp&amp;s=d6b8eab6ff5519aac82a87a06e742d52aa74440e\">Comments</a></p>\n\n<p>&#x200B;</p>\n\n<p>The goal of this post was to look at one of those theories and see if I can provide a base for it. The theory in question is “$RKT discussion is being artificially pushed to distract from $GME”. A TLDR of my analysis is:</p>\n\n<p><strong>A) Both $RKT and $GME are being discussed by a lot of accounts that are new to posting on WSB.</strong></p>\n\n<p><strong>B) Accounts discussing $GME are actually newer to WSB on average than accounts discussing $RKT</strong></p>\n\n<p><strong>C) There are a small, but non-zero, number of people trying to artificially manipulate discussion to get others to sell $GME. However, this is done with no relation to $RKT.</strong></p>\n\n<p><strong>D) Accounts mentioning $GME and $RKT behave similarly in promoting the respective stocks.</strong></p>\n\n<p>Through my analysis I wasn’t able to find any solid evidence of $RKT being artificially pushed as a distraction from $GME. While it’s easy to complain about <a href=\"/u/zjz\">u/zjz</a>&#39;s iron-fisted bot army, I think it deserves a lot of credit for curbing attempts at manipulation.</p>\n\n<p>Now I will provide the data backing up these conclusions, and call out one account I did find attempting to artificially manipulate discussion.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Both $RKT and $GME are being discussed by a lot of accounts that are new to posting on WSB. Accounts discussing $GME are actually newer to WSB on average than accounts discussing $RKT.</strong></p>\n\n<p>I don’t think I need to patronize you with a bunch of facts and figures showing how much attention has been drawn to wsb recently. Obviously this attention came with a lot of new posters, and that’s fully on display when we look at when accounts talking about $GME and $RKT first joined the wsb community. The motive behind looking at these numbers was to determine whether there were a bunch of new accounts who joined the community with the sole purpose of distracting from $GME.</p>\n\n<p>The average $RKT poster first posted on wsb on December 10th, 2020. This is pretty shockingly young, but the average $GME poster is even newer to the community with an average date of December 22nd, 2020.</p>\n\n<p>Here are histograms showing when the accounts mentioning both stocks first joined the community, by year:</p>\n\n<p><a href=\"https://preview.redd.it/qp652yp7quk61.png?width=1726&amp;format=png&amp;auto=webp&amp;s=2cc3b954aea59a00e2a3f0e570b825e614c0cec0\">RKT Histogram</a></p>\n\n<p><a href=\"https://preview.redd.it/d79kdzu8quk61.png?width=1726&amp;format=png&amp;auto=webp&amp;s=95408f675b12f97cbd9231e71fa96aac0c43b1d8\">GME Histogram</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>There is a non-zero number of people trying to manipulate discussion to get others to sell $GME, but not enough to have a significant effect.</strong></p>\n\n<p>One other thing I examined was how much different accounts were shilling $GME and $RKT. For the most part, there wasn’t too much spam of either ticker by individual accounts with a few notable exceptions. Below are scatter plots showing accounts with the date they joined WSB on the x-axis and the number of times they have mentioned $GME/$RKT in the last 5 days on the y-axis.</p>\n\n<p><a href=\"https://preview.redd.it/g9vgmq6gquk61.png?width=1852&amp;format=png&amp;auto=webp&amp;s=73571b1836771fc0c8fa3c80eebd738d13bd5d9b\">$GME date joined vs. mentions</a></p>\n\n<p><a href=\"https://preview.redd.it/0a8xwqlkquk61.png?width=1752&amp;format=png&amp;auto=webp&amp;s=a7e79bb797abbdf49eb43b4c7fd94c4541c6d58b\">$RKT date joined vs. mentions</a></p>\n\n<p>There are 3 prominent outliers that I will examine, one of which I think probably deserves some sort of moderator action. On the $GME graph we have <a href=\"/u/char1101g\">/u/char1101g</a> way out in the upper right. He just started posting on here yesterday, and has been just absolutely spamming anti-GME shit since. Although posts like &quot;SELL YOU GME STOCK&quot; seem to match the grammar and speech patterns expected of a short-only investor, I don&#39;t really see this single example as solid evidence of a larger artificial anti-GME push.</p>\n\n<p>On the $RKT side of things we have two accounts that are pretty clearly tied to real people, so I don’t want to call them out by username. While I’d say they’re pretty clearly innocent of being hedge fund accounts (old accounts, lots of personal info, lots of non-wsb posts), they’re absolutely guilty of living in the discussion threads, with dozens of comments already today. You could probably make an argument that someone commenting about $RKT all day long is having some impact on the overall discussion, but given that it’s just two random dudes I kind of doubt it has much of an effect in the grand scheme of things.</p>\n\n<p><strong>Accounts mentioning $GME and $RKT behave similarly in promoting the respective stocks.</strong></p>\n\n<p>The last thing I wanted to look at was how accounts behaved in promoting $GME and $RKT. In particular, I wanted to see if accounts mentioning either stock were more likely to mention it repeatedly. I ended up not finding much of a significant difference. Below is a table where $GME/$RKT accounts are defined as accounts mentioning each respective stock.</p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Mentions of $RKT/$GME over last 5 days</th>\n<th align=\"left\">$RKT accounts</th>\n<th align=\"left\">$GME accounts</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">&gt;1</td>\n<td align=\"left\">.806</td>\n<td align=\"left\">.801</td>\n</tr>\n<tr>\n<td align=\"left\">&gt;2</td>\n<td align=\"left\">.653</td>\n<td align=\"left\">.657</td>\n</tr>\n<tr>\n<td align=\"left\">&gt;5</td>\n<td align=\"left\">.454</td>\n<td align=\"left\">.433</td>\n</tr>\n<tr>\n<td align=\"left\">&gt;10</td>\n<td align=\"left\">.331</td>\n<td align=\"left\">.310</td>\n</tr>\n</tbody></table>\n\n<p>&#x200B;</p>\n\n<p>There&#39;s a pretty small overlap (34%) between people talking about $GME and people talking about $RKT, likely leading to some of the conflict that we have seen, but from my research I wasn&#39;t able to find any solid evidence of $RKT being artificially pushed as a distraction from $GME.  That being said, I&#39;m happy to hear criticisms on my work, let me know below if you have any thoughts.</p>\n</div><!-- SC_ON -->",
  "score": 1904,
  "permalink": "/r/wallstreetbets/comments/lx0ls8/rkt_is_being_pushed_as_a_distraction_from_gme_a/",
  "subreddit": "wallstreetbets",
  "id": "lx0ls8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542579467
}