{
  "author": "SuperFireTower",
  "the_new_excerpt": "SAN FRANCISCO--(BUSINESS WIRE)-- Unity Software Inc. (NYSE: U), the world’s\nleading platform for creating and operating interactive, real-time 3D content,\ntoday announced results for the first quarter ended March 31, 2021.\n\n“Our first quarter results are reflective of the powerful transition from…",
  "original_created_utc": 1620768302,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サンフランシスコ--(BUSINESS WIRE)--（ビジネスワイヤ） -- Unity Software Inc. (NYSE: U)は、インタラクティブなリアルタイム3Dコンテンツを作成・運用するための世界有数のプラットフォームである\nは、本日、インタラクティブなリアルタイム3Dコンテンツを制作・運用するための世界有数のプラットフォームであるユニティ・ソフトウェア・インク（NYSE: U）の第1四半期業績を発表しました。\nは本日、2021年3月31日に終了した第1四半期の業績を発表しました。\n\n\"当社の第1四半期の業績は.......................からの力強い移行を反映しています。",
      "title": "Unityの第1四半期の収益は予想を上回る41%増、2021年の収益見通しを10億ドルに上方修正"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "旧金山--(美国商业资讯)--Unity Software Inc. (NYSE: U)是全球领先的创建和运营交互式三维内容的平台。\n(NYSE: U)是全球领先的交互式实时3D内容创建和运营平台。\n今天公布了截至2021年3月31日的第一季度业绩。\n\n\"我们第一季度的业绩反映了从...",
      "title": "Unity第一季度营收增长41%，超出预期；公司将2021年营收前景提高到10亿美元"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "舊金山--(美國商業資訊)--Unity Software Inc. (NYSE: U)是全球領先的創建和運營交互式三維內容的平臺。\n(NYSE: U)是全球領先的交互式實時3D內容創建和運營平臺。\n今天公佈了截至2021年3月31日的第一季度業績。\n\n\"我們第一季度的業績反映了從...",
      "title": "Unity第一季度營收增長41%，超出預期；公司將2021年營收前景提高到10億美元"
    }
  ],
  "title": "Unity Q1 revenue up 41%, exceeding expectations; company raises 2021 revenue outlook to $1 billion",
  "created_utc": 1620791085,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>SAN FRANCISCO--(BUSINESS WIRE)-- Unity Software Inc. (NYSE: U), the world’s leading platform for creating and operating interactive, real-time 3D content, today announced results for the first quarter ended March 31, 2021.</p>\n\n<p>“Our first quarter results are reflective of the powerful transition from linear 2D to real-time 3D, which is one of the most important changes in how people interact with technology,” said John Riccitiello, President and Chief Executive Officer, Unity. “We believe that real-time 3D will continue to grow at an accelerated pace and achieve massive scale.”</p>\n\n<p>Unity is the world’s leading platform for creating and operating interactive, real-time 3D (RT3D) content. With Unity, creators have the tools to become RT3D creators. Creators, ranging from game developers to artists, architects, automotive designers, filmmakers and others, use Unity to make their creative vision come to life. With this broad approach, we believe the opportunity to create and operate rich and immersive experiences is almost limitless, setting up Unity to not only anchor tomorrow’s most advanced applications but to enable and power the metaverse at the most foundational level.</p>\n\n<p>“Execution in the first quarter was very strong with revenue of $234.8 million, an increase of 41% from last year. We are encouraged by the growth of our customers contributing more than $100K of trailing twelve-month revenue and the healthy dollar-based net expansion rate during the first quarter,” said Luis Visoso, Chief Financial Officer, Unity. “We continue to invest strategically in R&amp;D and vertical expansion to enable Unity to lead the transition to real-time 3D.”</p>\n\n<p><a href=\"https://investors.unity.com/news/news-details/2021/Unity-Announces-First-Quarter-2021-Financial-Results/default.aspx\">read more </a></p>\n</div><!-- SC_ON -->",
  "score": 79,
  "permalink": "/r/stocks/comments/na862w/unity_q1_revenue_up_41_exceeding_expectations/",
  "subreddit": "stocks",
  "id": "na862w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985996883
}