{
  "author": "FreshYoungBalkiB",
  "original_created_utc": 1641903209,
  "title": "Why do most library jobs require a masters degree?",
  "created_utc": 1641914767,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My local library system is having to close on Sundays and Mondays because of staffing shortages - seems nobody with an MA wants to try to live on what public libraries can pay.&lt;/p&gt;\n\n&lt;p&gt;Why does it take so many years of post-high-school education to learn how to catalog and shelve books? Why can&amp;#39;t the necessary skills just be acquired on the job? Seems to me any reasonably intelligent, literate person with the right temperament can learn this stuff pretty quickly.&lt;/p&gt;\n\n&lt;p&gt;Or, failing that, why can&amp;#39;t it be taught at vocational high schools? That would render unnecessary the huge student loans and the years of youth spent in unproductive study.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/s1bjkw/why_do_most_library_jobs_require_a_masters_degree/",
  "subreddit": "TooAfraidToAsk",
  "id": "s1bjkw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My local library system is having to close on Sundays and Mondays because of\nstaffing shortages - seems nobody with an MA wants to try to live on what public\nlibraries can pay.\n\nWhy does it take so many years of post-high-school education to learn how to\ncatalog and shelve books? Why can't the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の地元の図書館は、日曜日と月曜日を休館にせざるを得なくなりました。\n修士号を持っている人は、公立学校の学費で暮らそうとは思わないようです。\n図書館が払える金額です。\n\nなぜ、図書館の運営を学ぶのに高校卒業後何年もかかるのでしょうか。\n本の目録を作り、棚に並べる。なぜ、...",
      "title": "図書館の仕事はなぜ修士号が必要なのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我当地的图书馆系统不得不在周日和周一关闭，因为人手不足。\n人员短缺--似乎没有人愿意靠公共图书馆的工资生活。\n图书馆能支付的费用。\n\n为什么需要这么多年的高中后教育才能学会如何\n编目和摆放书籍？为什 么不可以...",
      "title": "为什么大多数图书馆工作需要硕士学位？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我當地的圖書館系統不得不在週日和週一關閉，因爲人手不足。\n人員短缺--似乎沒有人願意靠公共圖書館的工資生活。\n圖書館能支付的費用。\n\n爲什麼需要這麼多年的高中後教育才能學會如何\n編目和擺放書籍？爲什 麼不可以...",
      "title": "爲什麼大多數圖書館工作需要碩士學位？"
    }
  ]
}