{
  "author": "Marcus-Gorillius",
  "original_created_utc": 1632253898,
  "title": "Why do we mock those untrusting of government officials when the government's track record for honesty and transparency is absolutely ABYSMAL?",
  "created_utc": 1632267188,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I understand that Cleetus and friends probably ARE somewhat uneducated and stupid, but why mock them for not trusting the government when we have a long, LONG verifiable track record of government abuse, a lack of transparency as long as time, and CONSISTENT dishonesty coming from up above?</p>\n\n<p>Shouldn&#39;t we mock and shame the government,  MUCH more than dipshit Cleetus, for EXPECTING Americans to have any semblance of faith/trust in their &#39;elected&#39; &#39;leaders&#39; and what they say?</p>\n\n<p>If you used and abused not only me, but my elders generation after generation, all of which is documented and verifiable, wouldn&#39;t you have a very serious mistrust of the government ingrained? I think that&#39;s fairly reasonable.</p>\n\n<p><strong>I am vaccinated, college educated and in no way advocating for unvaccinated Americans to remain so. I&#39;m simply trying to give some perspective, and show the absurdity of the situation when Redditors are mocking grieving rednecks who have to quite a degree GOOD REASON NOT to trust the government(corporate alliance).</strong></p>\n\n<p>I know this is a diverse country with a lot of new immigrants each year (which is fantastic), but at least understand that a lot of farmers and rednecks in America have families going back generations here, and they can attest for repeated oppressive forms of legislation, lies and dishonesty that have in A VERY REAL SENSE, negatively affected their lives.</p>\n\n<p>Think of the millions of lives lost in fruitless wars where young men died alone and in agonizing pain so they could maybe one day afford college or an acre of land (nice bait), only to further line the pocket of some faceless corporate interest. (Afghanistan/vietnam). Think of the countless marginalized groups our government has spent generations working against, while claiming to have a much higher sense of morality/ethical judgement than what was displayed. Think the patriot act. Think of the USDA&#39;s food pyramid. Manipulation at all levels, across generations, and these are only a FEW examples.</p>\n\n<hr/>\n\n<p><strong>To make my primary question here ABUNDANTLY clear -</strong><br/>\nHow do you make sense of the outrage towards the redneck/antivax community <strong>SUPERSEDING</strong> the outrage towards our government who has a much, MUCH longer history than rednecks of betraying the trust of and actively working against the best interests of society as a whole? </p>\n\n<p>Is the direction of our outrage reasonable considering our &#39;government&#39;(corporate alliance) has contributed far more to the situation we find ourselves in than rednecks ever have?</p>\n</div><!-- SC_ON -->",
  "score": 129,
  "permalink": "/r/TooAfraidToAsk/comments/psqigq/why_do_we_mock_those_untrusting_of_government/",
  "subreddit": "TooAfraidToAsk",
  "id": "psqigq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I understand that Cleetus and friends probably ARE somewhat uneducated and\nstupid, but why mock them for not trusting the government when we have a long,\nLONG verifiable track record of government abuse, a lack of transparency as long\nas time, and CONSISTENT dishonesty coming from up…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "クリートゥスとその仲間たちは、おそらく無学で愚かな存在であると理解しています。\nしかし、政府を信用していないことで彼らを馬鹿にするのはどうかと思います。\n政府の乱用の長い長い検証可能な実績があり、長い間透明性に欠けていて\nしかし、なぜ彼らが政府を信用しないことを馬鹿にするのでしょうか？",
      "title": "政府の誠実さと透明性の実績は全くもって醜いものであるのに、なぜ政府関係者を信用していない人たちを嘲笑するのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我理解克里特斯和他的朋友们可能是有点没有受过教育和愚蠢。\n但为什么要嘲笑他们不相信政府，因为我们有一个很长的。\n我们有一个长期的、可证实的政府滥用职权的记录，一个缺乏透明度的长期\n时间，以及来自上层的持续的不诚实行为......",
      "title": "为什么我们要嘲笑那些不信任政府官员的人，而政府在诚实和透明方面的记录绝对是ABYSMAL？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我理解克里特斯和他的朋友們可能是有點沒有受過教育和愚蠢。\n但爲什麼要嘲笑他們不相信政府，因爲我們有一個很長的。\n我們有一個長期的、可證實的政府濫用職權的記錄，一個缺乏透明度的長期\n時間，以及來自上層的持續的不誠實行爲......",
      "title": "爲什麼我們要嘲笑那些不信任政府官員的人，而政府在誠實和透明方面的記錄絕對是ABYSMAL？"
    }
  ]
}