{
  "author": "sikeig",
  "original_created_utc": 1632413873,
  "title": "Here are 20 Arguments against Bitcoin",
  "created_utc": 1632429431,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Disclaimer:</strong> <em>I personally own and hold Bitcoin since several years. But I think critical thinking is heavily underrepresented in cryptocurrency communities. It gets mostly just branded as “FUD”.</em></p>\n\n<p><strong>So here are 20 arguments against Bitcoin succeeding in the future:</strong></p>\n\n<ul>\n<li><p>Bitcoin is backed by nothing</p></li>\n<li><p>It&#39;s a deflationary currency which discourages spending</p></li>\n<li><p>It is wildly energy intensive</p></li>\n<li><p>⁠Transaction fees will prevent domestic spending</p></li>\n<li><p>⁠There are &gt;10,000 cryptocurrency alternatives</p></li>\n<li><p>It is overly complicated for the average person to understand and use</p></li>\n<li><p>Using it requires internet access</p></li>\n<li><p>⁠Bitcoin communities are heavily censored and corrupted by individuals (Bitcoin.org, Bitcoin mailing list, <a href=\"/r/Bitcoin\">r/Bitcoin</a>, Twitter @Bitcoin)</p></li>\n<li><p>Extreme volatile day to day price fluctuations</p></li>\n<li><p>Lack of a central authority means governments can&#39;t respond to a economic crises</p></li>\n<li><p>The price of Bitcoin is too high (how many bitcoins does it cost to buy this Coffee at Starbucks? .00023?)</p></li>\n<li><p>It doesn&#39;t solve a market need (95% of USD is already digital and free mobile payments are already available)</p></li>\n<li><p>⁠It functions more like an asset than a currency</p></li>\n<li><p>It is expensive and cumbersome for vendors to adopt and accept it</p></li>\n<li><p>The most volume comes from Tether Tokens mostly backed by undisclosed chinese commercial papers</p></li>\n<li><p>It&#39;s a tax nightmare for consumers and corporations</p></li>\n<li><p>⁠Financial services offered by conventional institutions are cheaper than those currently offered by crypto fintechs (loans, letters of credit, trade finance, leases, etc)</p></li>\n<li><p>It is easy to send Bitcoin to the wrong address, irreversible decisions</p></li>\n<li><p>Forgotten passwords/lost devices can lead to major losses, no password reset options</p></li>\n<li><p>Exchanges and wallets can be hacked or can go bankrupt</p></li>\n</ul>\n\n<p><strong>Being open to the arguments from the opposition is key to investing. You haven’t won the lottery from just blindly pouring money into Bitcoin. It’s a heavily volatile investment still based mainly on speculation.</strong></p>\n</div><!-- SC_ON -->",
  "score": 182,
  "permalink": "/r/CryptoCurrency/comments/ptyq5g/here_are_20_arguments_against_bitcoin/",
  "subreddit": "CryptoCurrency",
  "id": "ptyq5g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Disclaimer: I personally own and hold Bitcoin since several years. But I think\ncritical thinking is heavily underrepresented in cryptocurrency communities. It\ngets mostly just branded as “FUD”.\n\nSo here are 20 arguments against Bitcoin succeeding in the future:\n\n * Bitcoin is backed by nothing\n\n *…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "免責事項：私は個人的に数年前からビットコインを所有・保有しています。しかし、私が思うに\n批判的な考え方は、暗号通貨のコミュニティではほとんど見られません。それは\n批判的な考え方は、暗号通貨のコミュニティではほとんど紹介されていません。\n\nそこで、ビットコインが将来的に成功することを否定する20の議論を紹介します。\n\n * ビットコインには何の裏付けもありません。\n\n *...",
      "title": "ビットコインに対する20の論拠を紹介"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "免责声明：我个人从几年前就拥有并持有比特币。但我认为\n批判性思维在加密货币社区中的代表性严重不足。它\n它大多被打成 \"FUD\"。\n\n因此，这里有20个反对比特币在未来成功的论据。\n\n * 比特币没有任何支持\n\n *...",
      "title": "这里有20个反对比特币的论据"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "免責聲明：我個人從幾年前就擁有並持有比特幣。但我認爲\n批判性思維在加密貨幣社區中的代表性嚴重不足。它\n它大多被打成 \"FUD\"。\n\n因此，這裏有20個反對比特幣在未來成功的論據。\n\n * 比特幣沒有任何支持\n\n *...",
      "title": "這裏有20個反對比特幣的論據"
    }
  ]
}