{
  "author": "rockinoutwith2",
  "the_new_excerpt": "This story could definitely have wide ranging impacts within the O&G sector -\nshould be interesting to see how it unfolds:\n\n--------------------------------------------------------------------------------\n\nThe chief executives of Exxon XOM -2.65% Mobil Corp. and Chevron Corp. CVX\n-4.29% spoke last…",
  "original_created_utc": 1612129271,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这个故事肯定会在O&G领域产生广泛的影响--。\n应该是有趣的，看看它如何展开。\n\n--------------------------------------------------------------------------------\n\n埃克森XOM -2.65%美孚公司和雪佛龙公司的首席执行官。CVX\n-4.29%最后发言...",
      "title": "华尔街日报》独家报道。埃克森和雪佛龙CEO讨论合并问题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個故事肯定會在O&G領域產生廣泛的影響--。\n應該是有趣的，看看它如何展開。\n\n--------------------------------------------------------------------------------\n\n埃克森XOM -2.65%美孚公司和雪佛龍公司的首席執行官。CVX\n-4.29%最後發言...",
      "title": "華爾街日報》獨家報道。埃克森和雪佛龍CEO討論合併問題"
    }
  ],
  "title": "WSJ Exclusive: Exxon, Chevron CEOs Discussed Merger",
  "created_utc": 1612137547,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This story could definitely have wide ranging impacts within the O&amp;G sector - should be interesting to see how it unfolds:</p>\n\n<hr/>\n\n<p>The chief executives of Exxon XOM -2.65% Mobil Corp. and Chevron Corp. CVX -4.29% spoke last year about combining the oil giants, according to people familiar with the talks, testing the waters for what could be one of the largest corporate mergers ever.</p>\n\n<p>Chevron Chief Executive Mike Wirth and Exxon CEO Darren Woods spoke shortly after the coronavirus pandemic took hold, decimating oil and gas demand and putting enormous financial strain on both companies, the people said. The discussions were described as preliminary and aren’t ongoing but could come back in the future, the people said.</p>\n\n<p>Such a deal would reunite the two largest descendants of John D. Rockefeller’s Standard Oil monopoly, which was broken up by U.S. regulators in 1911, and reshape the oil industry.</p>\n\n<p>A combined company’s market value could top $350 billion. Exxon has a market value of $190 billion, while Chevron’s is $164 billion. Together, they would likely form the world’s second largest oil company by market capitalization and production, producing about 7 million barrels of oil and gas a day, based on pre-pandemic levels, second only in both measures to Saudi Aramco.</p>\n\n<p>But a merger of the two largest American oil companies could encounter regulatory and antitrust challenges under the Biden administration. President Biden has said climate change is one of the biggest crises the country faces. In October, he said he would push the country to “transition away from the oil industry.” He hasn’t been as vocal about antitrust matters, and the administration has yet to nominate the Justice Department’s head of that division.</p>\n\n<p>One of the people familiar with the talks said the sides may have missed an opportunity to consummate the deal under former President Donald Trump, whose administration was seen as more friendly to the industry.</p>\n\n<p>A handful of sizable oil and gas deals were completed last year, including Chevron’s $5 billion takeover of Noble Energy Inc. and ConocoPhillips ’ roughly $10 billion takeover of Concho Resources Inc., but nothing close to the scale of combining San Ramon, Calif.-based Chevron and Irving, Texas-based Exxon.</p>\n\n<p>Such a deal would be noteworthy in the oil industry, surpassing in size the mega-oil-mergers of the late 1990s and early 2000s, which included the combination of Exxon and Mobil and Chevron and Texaco Inc.</p>\n\n<p>It also could be the largest corporate tie-up ever, depending on its structure. That distinction currently belongs to the roughly $181 billion purchase of German conglomerate Mannesmann AG by Vodafone AirTouch Plc in 2000, according to Dealogic.</p>\n\n<p>Many investors, analysts and energy executives have called for consolidation in the beleaguered oil-and-gas industry, arguing that cutting costs and improving operational efficiencies would help companies weather the pandemic-induced downturn and prepare for an uncertain future as many countries seek to reduce their dependence on fossil fuels to combat climate change.</p>\n\n<p>In an interview discussing Chevron’s earnings Friday, Mr. Wirth, who like Mr. Woods also serves as his company’s board chairman, said that consolidation could make the industry more efficient. He was speaking generally and not about a possible Exxon-Chevron merger.</p>\n\n<p>“As for larger scale things, it’s happened before,” Mr. Wirth said, referring to the 1990s and early-2000s megamergers. “Time will tell.”</p>\n\n<p>Paul Sankey, an independent analyst who hypothesized a merger of Chevron and Exxon in October, estimated at the time that the combined company would have a market capitalization of about $300 billion and $100 billion in debt. A merger would allow them to cut a combined $15 billion in administrative expenses and $10 billion in annual capital expenditures, he wrote.</p>\n\n<p>Exxon was America’s most valuable company seven years ago, with a market value of more than $400 billion, nearly double Chevron’s. But Exxon has fallen from its heights following a series of strategic missteps, which were further exacerbated by the pandemic. It has been eclipsed as a profit engine by tech giants such as Apple Inc. and Amazon.com Inc. in recent years and was removed from the Dow Jones Industrial Average last year for the first time since it was added as Standard Oil of New Jersey in 1928.</p>\n\n<p>Exxon’s shares have fallen nearly 29% over the last year, while Chevron’s are down about 20%. Chevron briefly topped Exxon in market capitalization in the fall.</p>\n\n<p>Exxon endured one of its worst financial performances ever in 2020. It is expected to report a fourth consecutive quarterly loss for the first time in modern history on Tuesday and already has posted more than $2 billion in losses through the first three quarters of 2020.</p>\n\n<p>Chevron also has struggled, reporting nearly $5.5 billion in 2020 losses Friday. But investors have expressed more faith in Chevron because it entered the downturn with a stronger balance sheet—in part because it failed in its $33 billion bid to buy Anadarko Petroleum Corp. before the pandemic, having been outbid by Occidental Petroleum Corp. in 2019.</p>\n\n<p>Exxon has about $69 billion in debt as of September, while Chevron has around $35 billion, according to S&amp;P Global Market Intelligence.</p>\n\n<p>Some investors have grown increasingly concerned about Exxon’s direction under Mr. Woods as the company faces a rapidly changing energy industry and growing global consciousness about climate change. Some are also worried that Exxon may have to cut its hefty dividend, which costs it about $15 billion annually, due to its high debt levels. Many individual investors count on the payments as a source of income.</p>\n\n<p>Mr. Woods embarked on an ambitious plan in 2018 to spend $230 billion to pump an additional one million barrels of oil and gas a day by 2025. But before the pandemic, production was up only slightly and Exxon’s financial flexibility was diminished. In November, Exxon retreated from the plan and said it would cut billions of dollars from its capital spending every year through 2025 and focus on investing in only the most promising assets.</p>\n\n<p>Meanwhile, the company’s woes have helped draw the attention of activist investors. One of them, Engine No. 1 LLC, has argued that the company should focus more on investments in clean energy while cutting costs elsewhere to preserve its dividend. The firm nominated four directors to Exxon’s board Wednesday and called for it to make strategic changes to its business plan.</p>\n\n<p>Exxon also has been in talks with another activist, D.E. Shaw Group, and is preparing to announce one or more new board members, additional spending cuts and investments in new technologies to help it reduce its carbon emissions.</p>\n\n<p>Rivals such as BP PLC and Royal Dutch Shell PLC have embarked on bold strategies to remake their business as regulatory and investor pressure to reduce carbon emissions mounts. Both have said they will invest heavily in renewable energy—a strategy that their investors so far haven’t rewarded.</p>\n\n<p>Exxon and Chevron haven’t invested substantially in renewables, instead choosing to double down on oil and gas. Both companies have argued that the world will need vast amounts of fossil fuels for decades to come, and that they can capitalize on current underinvestment in oil production.</p>\n\n<p><a href=\"https://www.wsj.com/articles/exxon-chevron-ceos-discussed-merger-11612126203?mod=hp_lead_pos1\">https://www.wsj.com/articles/exxon-chevron-ceos-discussed-merger-11612126203?mod=hp_lead_pos1</a></p>\n</div><!-- SC_ON -->",
  "score": 1482,
  "permalink": "/r/investing/comments/l9mrpb/wsj_exclusive_exxon_chevron_ceos_discussed_merger/",
  "subreddit": "investing",
  "id": "l9mrpb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518534779
}