{
  "author": "Dr_Pips_Rips_Dips",
  "the_new_excerpt": "Hey Internet,\n\nThis post is the first part in a series I will be doing outlining some of the\nbasic tools, tips, and techniques I use to conduct technical analysis on charts.\n\nI figured that the best place to start is at the beginning, so the title of\ntoday's post is: \"Candlesticks, what are they and…",
  "original_created_utc": 1610031536,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，互联网，\n\n这篇文章是我将要做的一系列文章的第一部分，我将概述一些\n我用来对图表进行技术分析的基本工具、技巧和技巧。\n\n我认为最好的起点是开头，所以书名是\n今天的帖子是：“烛台，它们和…是什么？",
      "title": "技术分析系列1：烛台，它们是什么，我如何使用它们？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，互聯網，\n\n這篇文章是我將要做的一系列文章的第一部分，我將概述一些\n我用來對圖表進行技術分析的基本工具、技巧和技巧。\n\n我認爲最好的起點是開頭，所以書名是\n今天的帖子是：“燭臺，它們和…是什麼？",
      "title": "技術分析系列1：燭臺，它們是什麼，我如何使用它們？"
    }
  ],
  "title": "Technical Analysis Series 1: Candlesticks, what are they and how do I use them?",
  "created_utc": 1610060261,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey Internet,</p>\n\n<p>This post is the first part in a series I will be doing outlining some of the basic tools, tips, and techniques I use to conduct technical analysis on charts.</p>\n\n<p>I figured that the best place to start is at the beginning, so the title of today&#39;s post is: &quot;Candlesticks, what are they and how do I use them?&quot;</p>\n\n<p>In this post I will present some of the basic elements of candle sticks, a few noteworthy candle stick formations, and introduce some other relevant terminology. In addition, this post will be helpful in generally explaining how to read a chart at a very basic level.</p>\n\n<p>A candlestick tells the story of the price action for the asset during the relevant timeframe you have selected for your chart.</p>\n\n<p>While they may not look like much to the untrained eye, markets are run off of human emotion, primarily fear and greed. Candlesticks can give valuable insight into what the mood of the market was during a given timeframe.</p>\n\n<p><strong>Why Candlesticks vs other types of Charts?</strong></p>\n\n<ul>\n<li>There are plenty of valid ways to look at historical price data for assets:\n\n<ul>\n<li>bar charts</li>\n<li>line charts</li>\n<li>heikin-ashi charts</li>\n</ul></li>\n<li>The reasons I prefer candlesticks are:\n\n<ul>\n<li>can easily visually see where the candle opened</li>\n<li>can easily visually see where the candle closed</li>\n<li>can easily visually see where the candle &quot;wicked&quot; up or down to and was rejected from\n\n<ul>\n<li>Being able to easily identify these data points allows for a technical trader to more quickly assess the relevant info required for assessing risk and putting on trades.</li>\n</ul></li>\n</ul></li>\n</ul>\n\n<p><strong>Here is a 1 week (&quot;1W&quot;) timeframe (&quot;TF&quot;) chart of Starbucks:</strong> <a href=\"https://imgur.com/gallery/gmzRPrY\">https://imgur.com/gallery/gmzRPrY</a></p>\n\n<p><strong>As explained in the graphic:</strong></p>\n\n<ul>\n<li>The asset is generally listed in the top left of the chart followed by the TF of the candles on the chart.\n\n<ul>\n<li>Since this is a 1W TF chart of Starbucks that means that each red or green candle on the chart represents 1 week of price action.\n\n<ul>\n<li>Candle periods are broken into what is considered high TF, medium TF, and low TF.</li>\n</ul></li>\n</ul></li>\n<li>The general rule of thumb is that looking at a high TF candle chart reduces the risks of getting &quot;faked out&quot; by bull traps, bear traps, or otherwise sideways choppy action (future posts will touch on what these are if you&#39;d like to know more).</li>\n<li><p>Essentially, it would take much more sustained application of capital to lay such a trap for a 1 week period vs. a 1 hour period. Therefore, high TF charts are much more reliable for longer term analysis. The downside to high TF candles though is that they are obviously less responsive to explosive and sudden price action brought on by a catalyst or other outside event.  </p>\n\n<ul>\n<li>On equities the TF breakdown is generally:\n\n<ul>\n<li>High TF: 12 month candles, 6 month candles, 3 month candles, 1 month candles, 2 week candles, and 1 week candles</li>\n<li>Medium TF: 3 day candles, 2 day candles, and 1 day candles</li>\n<li>Low TF: 4 hour candles, 2 hour/90 minute candles, 1 hour candles, 30 minute candles, 15 minute candles</li>\n</ul></li>\n<li>Technical traders will run all types of TF&#39;s on candles and these are just some of the most common examples. Furthermore , the most relevant or &quot;favorite&quot; TF&#39;s of technical traders will change as algorithms are adjusted across the market, thereby requiring the trader to adjust as relevant market data is analyzed.</li>\n</ul></li>\n</ul>\n\n<p><strong>Here is another shot of the 1W TF chart of Starbucks with some additional info to cover candle stick bodies and wicks:</strong> <a href=\"https://imgur.com/gallery/IUNET9x\">https://imgur.com/gallery/IUNET9x</a></p>\n\n<p><strong>As explained in the graphic:</strong></p>\n\n<ul>\n<li>The body of the candle is the solid portion of each candle.\n\n<ul>\n<li>The body contains the price range between the Open and Close of the asset.\n\n<ul>\n<li>A red candle has the Open at the top of the body and the close at the bottom of the body.</li>\n<li>A green candle has the Open at the bottom of the body and the close at the top of the body.</li>\n</ul></li>\n<li>The lines sticking out of the top and bottom of the candle body are the wicks for the candle and represent the High and Low for the TF.</li>\n</ul></li>\n</ul>\n\n<p>The importance of Open and Close for a candle will be further expanded upon in later posts, but the short version is that open and closing prices for an asset are extremely important for &quot;confirmation trading.&quot; This is a style of technical trading where one waits for a candle to confirm (open, or even open and close) over (or under) a critical resistance level before entering a position. This is a more conservative technical trading style, but it can also increase one&#39;s chance of success by preventing them from buying or selling into wicking price action that is not truly indicative of the trend.</p>\n\n<p><strong>Candle Stick Formations</strong></p>\n\n<p>A lot of materials have been written on various candlestick formations and in my experience the new trader will put far too much weight in these formations, Treating these formations as if they are some secret sauce to conquering the markets. In my experience candle stick formations and patterns are quite important, but what is less important is memorizing every catchy name for the formations and being able to recite them off the top of your head. Once one understands the principles and market forces these formations are conveying they will be much better served in comparison to just memorizing their names.</p>\n\n<p>The most important concepts of analyzing candlestick formations relate to the size of the bodies and wicks on the candles being analyzed. In addition, volume should also be a main consideration when looking at candlesticks in order to gauge the level of market participation over the relevant period (a little write up on volume will be coming shortly).</p>\n\n<p><strong>Core Concepts on formations:</strong></p>\n\n<p><strong>Wicks:</strong></p>\n\n<ul>\n<li>A long wick coming out the bottom of a candle on a downtrend may reflect that a local floor has been reached for the asset. The long wick reflects this because it shows that the market has readily bought up the price of the asset at lower prices.\n\n<ul>\n<li>For example, here is what is known as a &quot;bullish hammer&quot;, or dragonfly doji, on the 3d tf for the S&amp;P 500 in the march lows of 2020: <a href=\"https://imgur.com/gallery/xjjC3dB\">https://imgur.com/gallery/xjjC3dB</a>\n\n<ul>\n<li>you will notice that there was a massive wick coming out the bottom of the candle body (reflecting the strong buy pressure at those lower levels) and then subsequently no candle body closed below the body of this bullish hammer/dragonfly doji.</li>\n</ul></li>\n</ul></li>\n<li>Similarly, a long wick coming out the top of a candle on an uptrend may reflect that a local top has been reached for the asset. The long wick reflect this because it shows that the market has readily sold down the price of the asset at higher prices.\n\n<ul>\n<li>For example, here is a local top reached in September 2020 for the S&amp;P 500 (the second arrow pointing out a long wick to the bottom and resumption of trend): <a href=\"https://imgur.com/gallery/HFM85ni\">https://imgur.com/gallery/HFM85ni</a></li>\n</ul></li>\n</ul>\n\n<p><strong>Body:</strong></p>\n\n<ul>\n<li>The size of the candle body and its relation to prior candle bodies is also of critical importance. As previously discussed, the candle body represents the open and closing prices of that asset for the given TF. This range can be considered the &quot;accepted price range&quot; for the asset while the wicks are outliers on the relevant price action.</li>\n<li>Therefore, a candle body that closes above the prior candle body can be indicative of bullish trend resuming.\n\n<ul>\n<li>For example, here is a shot of 3d S&amp;P 500 showing the relevance of candle bodies: <a href=\"https://imgur.com/gallery/NP3AT6d\">https://imgur.com/gallery/NP3AT6d</a></li>\n</ul></li>\n<li>Here is another example except for a bearish continuation of candle bodies: <a href=\"https://imgur.com/gallery/JeZPCUB\">https://imgur.com/gallery/JeZPCUB</a></li>\n</ul>\n\n<p><strong>Doji:</strong></p>\n\n<ul>\n<li>A doji is a name for a session in which the candlestick for a security has an open and close that are virtually equal and are often components in patterns.</li>\n<li>Doji candlesticks look like a cross, inverted cross or plus sign.\n\n<ul>\n<li>Here are some types of dojis: <a href=\"https://imgur.com/gallery/GNWdwyG\">https://imgur.com/gallery/GNWdwyG</a></li>\n</ul></li>\n<li>Dojis by themselves are not inherently bearish or bullish patterns, they must be analyzed in context of the greater trend and accompanying volume.</li>\n<li>However, Dojis are a sign of indecision in the market place. The fact that there was very little range between the open and close (thereby causing the candle to have a very small body) reflects that bulls and bears are undecided on which direction the asset should continue.</li>\n<li>In practice, I often view Dojis as a sign to watch out, because it suggests the asset may soon be making a sizable move one way or the other.</li>\n<li>For example, here is a recent 3d gravestone doji on AAPL incorporating several of the concepts related to candles touched on in this article: <a href=\"https://imgur.com/gallery/NYYwn1x\">https://imgur.com/gallery/NYYwn1x</a></li>\n</ul>\n\n<p>Now that some general concepts have been outlined regarding the relevancy of candle bodies and candle wicks, take a look at the below traditional candlestick formations and try to determine why they are considered &quot;bullish&quot; or &quot;bearish&quot; candlestick formations:</p>\n\n<ul>\n<li>Bullish candlestick formations: <a href=\"https://imgur.com/gallery/LgIUUtg\">https://imgur.com/gallery/LgIUUtg</a></li>\n<li>Bearish candlestick formations: <a href=\"https://imgur.com/gallery/cmuRhWP\">https://imgur.com/gallery/cmuRhWP</a></li>\n</ul>\n\n<p>I hope the above was helpful in providing some useful info for new technical analysts!</p>\n</div><!-- SC_ON -->",
  "score": 54,
  "permalink": "/r/stocks/comments/ksew9c/technical_analysis_series_1_candlesticks_what_are/",
  "subreddit": "stocks",
  "id": "ksew9c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706379523
}