{
  "author": "Adventurous-Sound52",
  "original_created_utc": 1625784836,
  "title": "Does anyone else ask questions they already know answers for just to keep a conversation going?",
  "created_utc": 1625805894,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I came to realize that I often ask silly questions for no particular reason, especially regarding stuff that I am somewhat knowledgeable about.</p>\n\n<p>Just the other day a colleague  mentioned a &#39;new&#39; store she had discovered and I ended up asking all about that place despite being quite a frequent visitor of the store...</p>\n\n<p>I can&#39;t explain it, I just know that I&#39;ve been doing it more or less my entire life.</p>\n\n<p>Can anyone relate?</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/TooAfraidToAsk/comments/ogijrk/does_anyone_else_ask_questions_they_already_know/",
  "subreddit": "TooAfraidToAsk",
  "id": "ogijrk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I came to realize that I often ask silly questions for no particular reason,\nespecially regarding stuff that I am somewhat knowledgeable about.\n\nJust the other day a colleague mentioned a 'new' store she had discovered and I\nended up asking all about that place despite being quite a frequent visitor…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、特に理由もなくくだらない質問をすることが多いことに気がつきました。\n特に自分がある程度知っていることに関しては。\n\nつい先日も、同僚が「新しいお店」を見つけたと言っていたので、よく行くお店にもかかわらず\n私はその店によく行っているにもかかわらず、その店のことを質問してしまいました...。",
      "title": "会話を続けるために、すでに答えを知っている質問をする人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我开始意识到，我经常毫无理由地问一些愚蠢的问题。\n特别是关于我有一定知识的东西。\n\n就在前几天，一位同事提到了她发现的一家 \"新 \"商店，而我\n结果我就问了关于那家店的所有情况，尽管我是个常客......。",
      "title": "还有人问一些他们已经知道答案的问题，只是为了让谈话继续下去吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我開始意識到，我經常毫無理由地問一些愚蠢的問題。\n特別是關於我有一定知識的東西。\n\n就在前幾天，一位同事提到了她發現的一家 \"新 \"商店，而我\n結果我就問了關於那家店的所有情況，儘管我是個常客......。",
      "title": "還有人問一些他們已經知道答案的問題，只是爲了讓談話繼續下去嗎？"
    }
  ]
}