{
  "author": "jdefgh",
  "original_created_utc": 1652813186,
  "title": "Tether has not reported its supply for 3 days now. Its supply has also fell 8B in the 5 days before that.",
  "created_utc": 1652827406,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Tether is usually reports its supply on their official website once every day, at an inconsistent time. That&amp;#39;s why you can see stairs like this on a market cap chart:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/dymvdlxi03091.png?width=951&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=098410d180c50328cbe0103ebc98317c3d72f917\"&gt;Tether market cap in the past 7 days - not counting the depeg it&amp;#39;s the same as the supply&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;If you go to their website you can see their current circulating supply with the same latency:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/1vtvjvqez2091.png?width=1298&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=390553ce99b2cdb44d12eb745cf9b3505c77c9aa\"&gt;The last update date is not true - it&amp;#39;s actually May 14 and the supply exactly the same as it was 3 days ago&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;So they&amp;#39;re not only not reporting the supply, but they&amp;#39;re also lying about updating it. The only reason why would they do that is because their supply fell significantly in these 3 days and they don&amp;#39;t want more people to follow. If they didn&amp;#39;t hide the 8B that dropped during 5 days, how much are they hiding from these 3 days?&lt;/p&gt;\n\n&lt;p&gt;Tether is getting more and more shady with everyday. They will probably try to buy back some of the withdrawn Tether with their reserves, decreasing their actual reserves and shooting themselves in the foot further. Of course Tether collapsing is not a good thing, many people will lose their money and a crypto crash will follow. Under any circumstances, don&amp;#39;t hold Tether.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 591,
  "permalink": "/r/CryptoCurrency/comments/urtbhx/tether_has_not_reported_its_supply_for_3_days_now/",
  "subreddit": "CryptoCurrency",
  "id": "urtbhx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Tether is usually reports its supply on their official website once every day,\nat an inconsistent time. That's why you can see stairs like this on a market cap\nchart:\n\nTether market cap in the past 7 days - not counting the depeg it's the same as\nthe…"
}