{
  "author": "4GreatHeavenlyKings",
  "original_created_utc": 1632595112,
  "title": "How have Muslim Scholars Traditionally Reconciled Theological Claims that the Qur'an is Perfectly Preserved with Traditions that Portions of the Qur'an Have Been Lost?",
  "created_utc": 1632637608,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Non-Muslims, obviously, have the option of rejecting the claim that the Qur&#39;an is perfectly preserved, and some Muslims, especially in more modern times, have rejected the Ahadith that claim that portions of the Qur&#39;an were lost. But traditional Muslim scholars of Ahadith categorized multiple Ahadith that claim that portions of the Qur&#39;an were lost as sahih - that is, the highest grade of authenticity.</p>\n\n<p>Such ahadith include: Sahih Muslim 1691a, in which Umar says the Verse of Stoning is missing from the Qur’an; Sahih Muslim 1050, which says that there are two Missing Surahs from the Qur’an; Sahih al-Bukhari 5005, in which Umar says that Ubayy was the best Quran reciter, but they left out some of what he recites from the Quran; Sahih al-Bukhari 6829, in which Umar says that the verse of stoning is missing from the Qur’an; Sahih Muslim 208a, in which Ibn Abbas says that a portion of Qur’an 26:214 is missing; Sahih Bukhari 4727, in which Ibn Abbas says that a portion of Qur’an 18:79 is missing; Sahih al-Bukhari 1770, in which Ibn Abbas says that a portion of Qur’an 2:198 is missing; Sahih Muslim 1452a, in which Aisha says that the verse of breastfeeding is missing from the Qur’an; Sahih Muslim 1050, in which Abu Musa al Ash’ari says that they have forgotten a surah as long as Surah Tawbah; and another sahih hadith exists [which I link to in lieu of citing: <a href=\"https://islamqa.info/en/answers/197942/soorat-al-ahzaab-was-as-long-as-soorat-al-baqarah-then-most-of-it-was-abrogated\">https://islamqa.info/en/answers/197942/soorat-al-ahzaab-was-as-long-as-soorat-al-baqarah-then-most-of-it-was-abrogated</a>] in which Ubayy ibn Ka’ab says that Surah Al-Ahzab used to be as long as Baqarah.</p>\n\n<p>In this context, How have Muslim Scholars Traditionally Reconciled Theological Claims that the Qur&#39;an is Perfectly Preserved with sahih ahadith that Portions of the Qur&#39;an Have Been Lost?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/pvctut/how_have_muslim_scholars_traditionally_reconciled/",
  "subreddit": "AskHistorians",
  "id": "pvctut",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Non-Muslims, obviously, have the option of rejecting the claim that the Qur'an\nis perfectly preserved, and some Muslims, especially in more modern times, have\nrejected the Ahadith that claim that portions of the Qur'an were lost. But\ntraditional Muslim scholars of Ahadith categorized multiple…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "非ムスリムには、クルアーンが完全に保存されているという主張を否定するという選択肢があるのは当然です。\nムスリムの中には、特に近代において、クルアーンの一部が失われたとするアハディースを否定する人もいます。\nムスリムの中には、特に現代において、クルアーンの一部が失われたとするアハディースを否定する人もいます。しかし\n伝統的なムスリムのアハディース研究者は、複数のアハディースを分類...",
      "title": "クルアーンが完全に保存されているという神学的主張と、クルアーンの一部が失われたという伝承を、ムスリムの学者は伝統的にどのように両立させてきたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "显然，非穆斯林可以选择拒绝《古兰经》的说法。\n的说法，而一些穆斯林，特别是在现代，则拒绝接受《古兰经》是完美保存的说法。\n一些穆斯林，特别是在现代，拒绝接受声称《古兰经》部分内容已经丢失的阿哈迪。但是\n传统的穆斯林阿赫德学者将多种...",
      "title": "穆斯林学者在传统上是如何将《古兰经》完美保存的神学主张与《古兰经》部分内容失传的传统相协调的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "顯然，非穆斯林可以選擇拒絕《古蘭經》的說法。\n的說法，而一些穆斯林，特別是在現代，則拒絕接受《古蘭經》是完美保存的說法。\n一些穆斯林，特別是在現代，拒絕接受聲稱《古蘭經》部分內容已經丟失的阿哈迪。但是\n傳統的穆斯林阿赫德學者將多種...",
      "title": "穆斯林學者在傳統上是如何將《古蘭經》完美保存的神學主張與《古蘭經》部分內容失傳的傳統相協調的？"
    }
  ]
}