{
  "author": "ReddSpark",
  "original_created_utc": 1639132930,
  "title": "Crypto in 2022",
  "created_utc": 1639150462,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I thought I would paint one vision of what might be in store for cryptocurrencies in 2022. Most of this is just an extrapolation of where were are today and stuff I came up with just to get people thinking and generate debate.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;More and more people will get into cryptos&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Crypto has had a great ride in 2021 when it comes to adoption. Most of this adoption has been in winning over financial institutions. In 2022, crypto will become  an investment vehicle for the masses. This will be spearheaded by banks acting as custodians and offering crypto based investment portfolios to their customers.&lt;/p&gt;\n\n&lt;p&gt;As the realization that blockchain is disrupting business models seeps into the public consciousness,  altcoins will be viewed as investment in tech startups. As a result the correlation between altcoins and Bitcoin will breakdown and greater emphasis will be placed on the fundamentals of each token. Good projects will receive substantial investment while lesser projects will flounder.&lt;/p&gt;\n\n&lt;p&gt;As more and more people start to interact with DeFi and staking; scalability and usability will become important. DeFi experiences that are &lt;strong&gt;easy and cheap&lt;/strong&gt; to use for the ordinary person will become important.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Digital identity will become important&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The traditional world and the crypto world will continue to come together and be unified through regulation. A key part of this will be KYC and AML laws. DeFi solutions that blend in KYC will become important.&lt;/p&gt;\n\n&lt;p&gt;This will give rise to the importance of digital identity solutions that allows for verification while maintaining privacy. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Low energy coins will become important&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The energy usage of cryptocurrencies will receive a lot of attention. POW will be viewed as wasteful and POS will be seen as a favorable alternative by lawmakers.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;NFT 2.0 will develop&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;NFTs will be used to tokenize and fund music, film, and games development with holders getting a slice of the revenue. &lt;/p&gt;\n\n&lt;p&gt;NFTs will move on from being associated with low quality jpg images to high quality artwork. The first ever art galley to physically show case digital NFTs will launch.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Layer 1s will become invisible&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Layer 1 blockchains will increasingly be seen as infrastructure that DApp developers care about but DApp consumers are oblivious to. Alternatives to the EVM operating system will become popular similar to iOS and Android today.&lt;/p&gt;\n\n&lt;p&gt;The same DEX will exist on multiple blockchain platforms and liquidity will be aggregated across them. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Real world governance and Crypo governance will intermingle&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;The first ever governmental election recorded on a blockchain will happen in 2022. This will pave the way of governance of all sorts moving onto the blockchain from housing boards to stockholder voting.&lt;/p&gt;\n\n&lt;p&gt;Edit:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://youtu.be/hmyuE0NpNgE?t=36\"&gt;https://youtu.be/hmyuE0NpNgE?t=36&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 189,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/YoaAgtoBrud8vW-xgl-T-iOgKgetTfz1DNXjq4xh8jk.jpg?auto=webp&amp;s=0a31914ecc7eb085bf220f33079fa74aa7329130",
          "width": 480,
          "height": 360
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/YoaAgtoBrud8vW-xgl-T-iOgKgetTfz1DNXjq4xh8jk.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=803be25ff11147a1aad71038e2c8ce21c80daea0",
            "width": 108,
            "height": 81
          },
          {
            "url": "https://external-preview.redd.it/YoaAgtoBrud8vW-xgl-T-iOgKgetTfz1DNXjq4xh8jk.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=50e04656026a811c1a04cad60242ae2b969c7309",
            "width": 216,
            "height": 162
          },
          {
            "url": "https://external-preview.redd.it/YoaAgtoBrud8vW-xgl-T-iOgKgetTfz1DNXjq4xh8jk.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=c9790661d2afa7d38c83e55e52acd678e5b22dc3",
            "width": 320,
            "height": 240
          }
        ],
        "variants": {},
        "id": "PaduUqbJGO8NY-X3lyumM7RJ-10y7rXMprKX6pVe7W4"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/rd5zjj/crypto_in_2022/",
  "subreddit": "CryptoCurrency",
  "id": "rd5zjj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I thought I would paint one vision of what might be in store for\ncryptocurrencies in 2022. Most of this is just an extrapolation of where were\nare today and stuff I came up with just to get people thinking and generate\ndebate.\n\nMore and more people will get into cryptos\n\nCrypto has had a great ride…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この先、何が待ち受けているのか、ひとつのビジョンを描いてみようと思ったのです。\n2022年、暗号通貨はどうなる？この記事の大半は 現在の状況からの推測に過ぎません\nを考えるきっかけになればと思い、思いつきました。\nを議論する。\n\nより多くの人々が暗号に参加するようになる\n\nCryptoは素晴らしい乗り物だった...",
      "title": "2022年のCrypto"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想我将为2022年可能出现的情况描绘一个愿景\n加密货币在2022年的前景。这其中的大部分只是对今天的情况的推断。\n我想出来的东西，只是为了让人们思考并引发辩论。\n辩论。\n\n越来越多的人将进入加密货币领域\n\n加密货币已经有了一个很好的发展...",
      "title": "2022年的加密货币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想我將爲2022年可能出現的情況描繪一個願景\n加密貨幣在2022年的前景。這其中的大部分只是對今天的情況的推斷。\n我想出來的東西，只是爲了讓人們思考並引發辯論。\n辯論。\n\n越來越多的人將進入加密貨幣領域\n\n加密貨幣已經有了一個很好的發展...",
      "title": "2022年的加密貨幣"
    }
  ]
}