{
  "author": "rrriiippptide",
  "original_created_utc": 1627024044,
  "title": "how many women ended up in prostitution in ancient Rome?",
  "created_utc": 1627060094,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Pre-covid I visited Italy and toured many ruins, and one thing that stuck out was how many brothels there were. I went in one in Pompeii, and it was big. I think there were 15-20 “rooms” in it. I’ve also read texts that talk about how prevalent it was. But this made me wonder, how many people were funneled into sex work back then? And also, was prostitution considered work or was it more of a poverty/slavery situation, or even women being owned (like with pimps). Was sex trafficking a huge threat? </p>\n\n<p>I know it’s a weird question, but I never have been able to find the answer and i’ve been wondering for years.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/opx32l/how_many_women_ended_up_in_prostitution_in/",
  "subreddit": "AskHistorians",
  "id": "opx32l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Pre-covid I visited Italy and toured many ruins, and one thing that stuck out\nwas how many brothels there were. I went in one in Pompeii, and it was big. I\nthink there were 15-20 “rooms” in it. I’ve also read texts that talk about how\nprevalent it was. But this made me wonder, how many people were…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "コビトになる前にイタリアを訪れ、多くの遺跡を見学しましたが、特に印象的だったのは\n売春宿の多さです。ポンペイで入ったのですが、大きかったですね。I\n15～20の部屋があったと思います。それがどれだけ普及していたかについて書かれた文章も読みました。\n普及していたという文章も読みました。でもこれを見て思ったのは、一体どれくらいの人が......。",
      "title": "古代ローマでは何人の女性が売春をしていたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在结婚前，我访问了意大利，参观了许多遗迹，有一件事让我印象深刻\n是那里有多少家妓院。我去了庞贝城的一个妓院，它很大。I\n我想里面有15-20个 \"房间\"。我也读过一些文章，其中谈到了\n它是多么的普遍。但这让我想知道，有多少人被...",
      "title": "在古罗马有多少妇女最终沦为妓女？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在結婚前，我訪問了意大利，參觀了許多遺蹟，有一件事讓我印象深刻\n是那裏有多少家妓院。我去了龐貝城的一個妓院，它很大。I\n我想裏面有15-20個 \"房間\"。我也讀過一些文章，其中談到了\n它是多麼的普遍。但這讓我想知道，有多少人被...",
      "title": "在古羅馬有多少婦女最終淪爲妓女？"
    }
  ]
}