{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "So, first things first let me get my investing background out of the way. I am 21, and relatively new. I started around April of this year, but I've been eyeing the stock market for a while, since I was 17, but since I didn't have a stable income stream, I couldn't invest until recently. I heard about meme stocks but as I knew I wanted to be an index investor. First I bought VOO then moved to VTI. I was a boglehead at heart and still am, more or less.  Also, when I say things such as \"This cannot happen\", it really means \"In my opinion, this cannot happen.\" I figured it'd be obvious from now on that this is mostly just my opinion. I'm not saying I'm 100% right, but I figured since it'd be annoying to constantly repeat, \"this is my opinion\", I'd mention this nonetheless. ***Since this is a Long post, if you'd like, just see if you find your argument in bold, as I tried to go over the main counter-arguments for them.***\n\nI, like many others, have discovered LETFs, but people scare people away from truly investing in them while spouting the same repeated things, ad nauseum. I also have seen a lot of TQQQ posts recently, which.... lowkey brings up alarm bells. If history truly does repeat itself, people used the hell out of leverage and LETFs during the dot-com bubble and the 2008 crash.. With all the talk of the market being in a bubble (And for the record, when i mention \"the market\", I strictly mean the S&amp;P 500, or VOO/SPY), then then yikes..? But nonetheless I haven't quite seen anything thoroughly in depth, which is what I strive to do with this post. So, if I succeeded, let me know at the end. I'm not going to cut corners, as I've mentioned in the title. This will be long, so get some snacks if you'd like.\n\nAnyway, speaking of crashes, people often say stuff like:***\"What about Dot-Com crash and 2008? You'd still be at a loss today from the dot-com crash if TQQQ existed back then!\"***  \n[True](https://i.imgur.com/1fmpmxW.png)... But, let's go over why one is not like the other: The dot-com bubble is not what TQQQ is currently. Some parts of the market, such as electric vehicle companies such as RIVN, TESLA, NKLA, meme stocks such as GME, AMC, or some penny stocks may be in a bubble, but the market as a whole is not in a bubble. It may head for a correction, but the whole reason why the Dot-Com Bubble popped was because the market was euphoric, with P/E ratios completely bonkers for the companies that are essentially garbage. Take this [chart](https://images.thinkadvisor.com/contrib/content/uploads/sites/415/2020/12/cape.jpg) showcasing how absurdly high the Shiller P/E ratio around 2001 was. It's \\*still way higher\\* than even now, with companies that are much more profitable, mature, and robust than ever before. Instead of random companies that have never sold anything before (Ouch, I know RIVN exists y'all.. I already said it's a bubble stock. But the market as a whole...? Not at all), you have companies like Apple, Amazon, FB/Meta, Microsoft, etc. I mean, I could go on and on about the amazing companies that are currently in the S&amp;P 500. While yes, people thought the same about things like Blockbuster, Nokia, Enron, these companies are at completely different stages in terms of profitability, maturity, and/or diversity in assets entirely.\n\nWhile, sure, anything can happen to, say, Apple -or even multiple companies- if you take ***index investing seriously, and buy/hold, you will statistically always come out on top in the long run.***   \nThis is simply due to the fact that index investing in the broad market is diversified, and has great companies. It's so simple, yet so effective. On top of that, the risk that the majority of companies in the S&amp;P 500 go bankrupt like in 2001 is just so insanely small, that if that were to be the case, something \\*terribly, terribly wrong\\* is happening to America, if not the entire world due to how globalized the companies in the index are. Trust me, if your boomer stocks such as KO, JNJ, and even stuff like Microsoft and Amazon go under, it doesn't matter what you invested in. Everything is on fire. This is essentially the idea of investing in the index in the first place. If you are able to worry about if the market is down, you don't have it bad enough, and it's going to be alright in the long term. This, combined with everything else I said, more or less ensures that investing into something like VOO/UPRO won't have such a gigantic crash such as before. As cliche as it may sound, \\*This time truly is different\\*... For this anyway. Besides, due to how LETF's are, I would argue it's actually better to \\*DCA\\* instead of Lump sum, or at least continue to DCA after a huge draw-down so the draw-up roars louder and harder. There's a difference between DCA into an LETF just like you would with VTI and just putting all 100k of your retirement at once into a market environment with a lot of companies that never have made any profitability at all when you're 2 years away from retirement\n\n***\"So, Okay, what about 2008 then?\"***  \n[Well...](https://i.imgur.com/hXj9RnA.png) It's not pretty. But that's entirely the point of LETF's. They amplify, and compound gains and losses. But you'd still have recovered through a 90% drawdown in just... in 4-5 years. If you are able to stomach it, which you \\*should mentally expect and prepare for\\* during such a thing, and continue to DCA (which this only tests a lump sum), you essentially are loading up your weapons for the next bull market. And when the bull market comes, it roars loud and clear with LETF's. The thing people might think with LETF's is that they're \"beginner traps\", or that \"they seem too good to be true\". Really, they're \"risky\" extremely volatile. With a lot of things in investing, risk/reward is a big thing. For example, bonds are low-risk, low-reward typically. VTI is considered low-medium risk, low-medium reward. TQQQ/UPRO is high-risk/High-reward, and managing your risk is how you can mitigate the downs, should anything like it happen again. If you're able to handle 90%+ drawdowns, sure, you can have 90%+ rallies. In fact, though, 2008 is one of the big reasons why QE is such a huge influence in the market. It seems like \"The Fed\" will do whatever it can to save the market. So, while 2008 probably won't happen again, an event similar to it (such as 2020) may happen again. But it probably won't be as bad, last for as long, and may recover quicker.\n\n***\"But what about Volatility Decay? If the price of $100 goes up 10%, then down $10, you lost money! It's simple math!\"***  \nYeah? That is just simple math. I've seen this repeated so many times as an argument against LETF's. It's not really an argument as the same goes for unleveraged ETF's such as VTI as well. Sure, while Index XYZ would be at 99, the 3x XYZ would be at 91. But, what exactly does that look like? [Well](https://assets.website-files.com/617960145ff34f911afe7243/617960145ff34f0fcdfe79eb_5ed6befa9e2f6d4f2c1095c7_pic-3.png), it certainly looks very odd to say the least. I've never had anybody bring up any real examples of decay eating away LETF's long term. Sure, \\*theoretically\\* if the market just goes up and down the exact same amount every single day forever then sure, but \\*theoretically\\* I can easily Mike Tyson in a fight if I just perfectly dodge every attack and never get hit. Realistically though, that will never happen. It's technically \\*possible\\*, but hypotheticals and theoreticals oftentimes have no place in reality. Sideways trading does happen quite a bit on a day-to-day scale, but there's quite a few days/months that on average in the stock market where they account for a good chunk of gains. This is why the saying, \"Time in the market beats timing the market\", because if you do somehow get in at the perfect time, you could have missed out some really, really, REALLY great days that would have still made you go up regardless.\n\n***\"What about if the market drops 34% in a day?! You lose everything\"***  \nYes/No. Yes, theoretically/hypothetically, the math tells you you would. But realistically there are circuit breakers on basically everything. From futures, to the market, to whatever else you can think of, there are circuit breakers that stop trading so that at any point, a drawdown of such a magnitude is next to impossible at all. As far as I know, historically, such a thing has never happened. There have been some pretty nasty drawdowns, but nothing of that magnitude. Furthermore, you need to ask yourself a simple question: If we've had such a crazy bull market, why haven't inverse LETF's just went tits up? Surely the math would point to them fizzling out right? I mean, take SQQQ, a 3x inverse of QQQ. But in the real world scenarios, with real world people, these LETF's are actively managed, which means they'll do whatever they can to keep it afloat. For example, SQQQ does reverse splits keep it alive. While SQQQ has basically killed all your money if you bought it and held, that's the same for most inverse ETF's. It doesn't have anything to do with leverage.\n\n***\"So, what about a prolonged bear market such as the Great Depression??\"***  \nSo, I don't mean to pull the \"ThIs TiMe Is DiFFeReNT\" shlick, but truthfully, comparing 1920s america to 2020's america is like comparing modern cars to 1920's cars. Sure they both drive but they're entirely different beasts. Oftentimes, it's better to bring up averages, rather than extremes, as extremes are usually outliers. Even if they are possible, they're rarely ever going to happen. Again, This is why something such as 2008 is a better argument against LETF's than say, the dot-com bubble, but even then, 2008 eventually recovered. Combine those things, plus the willingness of The Fed to just woosh in and save the market, it's very unlikely such an event will happen again. One important fact to remember is that, on average:\n\n***The average length of a Bull/Bear market is 2.7 years and 9.6 months respectively***  \nThis is the whole crux as to why holding something such as VTI/VOO wins long term. You simply have more up days than down days, on average. If you truly are a believer in the sentiment that bull markets will last longer and that the market will continue to be profitable, while bear markets will be significantly shorter, it's a no-brainer to invest in VTI/VOO, just like it is to invest in TQQQ, once you learn the risks and differences of leveraged ETF's compared to regular ETF's. This also brings me back to my next point:\n\n***If you followed Benjamin Graham's book on the Intelligent Investor, \"Mr. Market\" is described as irrational and too optimistic or pessimistic.***  \nAlong with creating the fundamental investing advice, and being labelled as \"probably the most important and influential value investing book ever written\" by Warren Buffet himself, Graham describes Mr Market as an analogy for market sentiment. Use this to your advantage. On any bad news about something, the market, instead of being perfectly \"efficient\", will be incredibly \"bipolar\", swinging from one pendulum of extreme, either being optimistic or pessimistic. This means when the market dips, it will dip \\*hard\\*, and when it rallies, it will rally \\*high\\*. You can clearly see this currently with the current bull market. People complain that it's too high, or a bubble. Really, that's just the market sentiment. No wonder it's extreme. It's purely the collective emotion of greed compared to fear. Not \"pure raw logic and wits and math and calculations\". The saying goes, \"be fearful when others are greedy and greedy when others are fearful\", not \"be robotic and logical\". Another great saying is \"The market can remain irrational longer than you can remain solvent\". Truth is, the market is irrational. Extremely so.\n\nWith all this being said, these were most of the argument's I've heard against LETF's. LETF's are all about risk-management. For example, when I brought up someone who is buying 100k worth of TQQQ in 2001 two years before retirement, that's for a reason. Due to me being 21, and somewhat little to somewhat moderate cash invested into TQQQ, *due to it being leveraged, even a small amount can turn into a large sum.* For example, *if you invested 5k in 2010, reinvesting your little dividends you earn from TQQQ, you'd have over 400k today.* This is the power of leverage in great companies. with as little as 5k you can \"gamble\", if you really think it's a gamble. Personally, I think a gamble is 5k in GME right now. Investing into the top companies in the nasdaq, leveraged or not, is way less of a gamble, if at all. Having a long time horizon especially helps, which for high/risk high/reward plays, is definitely an advantage. This is why I would not recommend someone who is two years from retirement to put money they need into leveraged funds. They are inherently, amplified in volatility. Entering at the wrong time, and not having enough time to DCA back in can be devastating.\n\n***If, however, you need a hedge due to your risk tolerance, or having a large sum into TQQQ, you can use 55% TQQQ/UPRO / 45% TMF***  \nThis is also another thing I rarely see mentioned. It's more mentioned from people using TQQQ/UPRO or other LETF's, but people act like you just go 100% into TQQQ without a hedge and call it a day. Realistically, you can do so much with portfolios. For simplicity sake, TMF, a 3x bonds index, hedges great with TQQQ/UPRO, due to being \\*uncorrelated\\* in most timeframes. For example, when people get scared of something such as say.. I don't know.....? A new Covid Variant called the Omicron, they flock to save bets such as bonds. This means that as TQQQ goes down, TMF will go up. You can actually see it clear as day during last Friday, and especially other days as well. While TQQQ took a beating, TQQQ/TMF was actually up. While, sure, pure 100% TQQQ beats TQQQ/TMF, but if you can't handle the drawdowns or need a hedge, it's well, well worth it. This strategy is called ***HedgeFundies Excellent Adventure,*** *or* ***HFEA*** for short. I won't go over it much due to it being exhaustively gone over, but on the bogleheads site, there's a thread for it already, which you can take a look at them here, [Part I](https://www.bogleheads.org/forum/viewtopic.php?t=288192) and [Part II](https://www.bogleheads.org/forum/viewtopic.php?t=288192) here.\n\nAnyways, In short, why I'm 100% investing in TQQQ and soon to hedge with TMF once I reach a sizable sum is simply for multiple reasons. I disagree with plenty of the arguments I've heard about LETF's, I'm 21, have a long time horizon, and I'm willing to take risks such as leverage in ETF's to turn a small sum such as 5k, 10k, or 15k into something hopefully huge later down the line. Then once I finally hit a good amount, if I ever do, I'll then invest back into VTI/VOO and let the dividends compound more than I ever could DCA into. Truth be told, even I'm terrified of holding 500k worth of TQQQ, \\*maybe\\* even with a hedge. That's the short of it.\n\nThere's also nothing stopping someone from just going 10% TQQQ as well. Even though the prospectus of every LETF says not to buy/hold as they're only for daily leveraged returns, nobody is stopping you from holding it and seeing what happens. Some people just want to take it farther than others, myself included.",
  "author_fullname": "t2_gnpc7miq",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "[Long post DD] Why I'm buy/holding 100% TQQQ for long term",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_r57m25",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.74,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 63,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 63,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1638225343,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, first things first let me get my investing background out of the way. I am 21, and relatively new. I started around April of this year, but I&amp;#39;ve been eyeing the stock market for a while, since I was 17, but since I didn&amp;#39;t have a stable income stream, I couldn&amp;#39;t invest until recently. I heard about meme stocks but as I knew I wanted to be an index investor. First I bought VOO then moved to VTI. I was a boglehead at heart and still am, more or less.  Also, when I say things such as &amp;quot;This cannot happen&amp;quot;, it really means &amp;quot;In my opinion, this cannot happen.&amp;quot; I figured it&amp;#39;d be obvious from now on that this is mostly just my opinion. I&amp;#39;m not saying I&amp;#39;m 100% right, but I figured since it&amp;#39;d be annoying to constantly repeat, &amp;quot;this is my opinion&amp;quot;, I&amp;#39;d mention this nonetheless. &lt;strong&gt;&lt;em&gt;Since this is a Long post, if you&amp;#39;d like, just see if you find your argument in bold, as I tried to go over the main counter-arguments for them.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I, like many others, have discovered LETFs, but people scare people away from truly investing in them while spouting the same repeated things, ad nauseum. I also have seen a lot of TQQQ posts recently, which.... lowkey brings up alarm bells. If history truly does repeat itself, people used the hell out of leverage and LETFs during the dot-com bubble and the 2008 crash.. With all the talk of the market being in a bubble (And for the record, when i mention &amp;quot;the market&amp;quot;, I strictly mean the S&amp;amp;P 500, or VOO/SPY), then then yikes..? But nonetheless I haven&amp;#39;t quite seen anything thoroughly in depth, which is what I strive to do with this post. So, if I succeeded, let me know at the end. I&amp;#39;m not going to cut corners, as I&amp;#39;ve mentioned in the title. This will be long, so get some snacks if you&amp;#39;d like.&lt;/p&gt;\n\n&lt;p&gt;Anyway, speaking of crashes, people often say stuff like:&lt;strong&gt;&lt;em&gt;&amp;quot;What about Dot-Com crash and 2008? You&amp;#39;d still be at a loss today from the dot-com crash if TQQQ existed back then!&amp;quot;&lt;/em&gt;&lt;/strong&gt;&lt;br/&gt;\n&lt;a href=\"https://i.imgur.com/1fmpmxW.png\"&gt;True&lt;/a&gt;... But, let&amp;#39;s go over why one is not like the other: The dot-com bubble is not what TQQQ is currently. Some parts of the market, such as electric vehicle companies such as RIVN, TESLA, NKLA, meme stocks such as GME, AMC, or some penny stocks may be in a bubble, but the market as a whole is not in a bubble. It may head for a correction, but the whole reason why the Dot-Com Bubble popped was because the market was euphoric, with P/E ratios completely bonkers for the companies that are essentially garbage. Take this &lt;a href=\"https://images.thinkadvisor.com/contrib/content/uploads/sites/415/2020/12/cape.jpg\"&gt;chart&lt;/a&gt; showcasing how absurdly high the Shiller P/E ratio around 2001 was. It&amp;#39;s *still way higher* than even now, with companies that are much more profitable, mature, and robust than ever before. Instead of random companies that have never sold anything before (Ouch, I know RIVN exists y&amp;#39;all.. I already said it&amp;#39;s a bubble stock. But the market as a whole...? Not at all), you have companies like Apple, Amazon, FB/Meta, Microsoft, etc. I mean, I could go on and on about the amazing companies that are currently in the S&amp;amp;P 500. While yes, people thought the same about things like Blockbuster, Nokia, Enron, these companies are at completely different stages in terms of profitability, maturity, and/or diversity in assets entirely.&lt;/p&gt;\n\n&lt;p&gt;While, sure, anything can happen to, say, Apple -or even multiple companies- if you take &lt;strong&gt;&lt;em&gt;index investing seriously, and buy/hold, you will statistically always come out on top in the long run.&lt;/em&gt;&lt;/strong&gt;&lt;br/&gt;\nThis is simply due to the fact that index investing in the broad market is diversified, and has great companies. It&amp;#39;s so simple, yet so effective. On top of that, the risk that the majority of companies in the S&amp;amp;P 500 go bankrupt like in 2001 is just so insanely small, that if that were to be the case, something *terribly, terribly wrong* is happening to America, if not the entire world due to how globalized the companies in the index are. Trust me, if your boomer stocks such as KO, JNJ, and even stuff like Microsoft and Amazon go under, it doesn&amp;#39;t matter what you invested in. Everything is on fire. This is essentially the idea of investing in the index in the first place. If you are able to worry about if the market is down, you don&amp;#39;t have it bad enough, and it&amp;#39;s going to be alright in the long term. This, combined with everything else I said, more or less ensures that investing into something like VOO/UPRO won&amp;#39;t have such a gigantic crash such as before. As cliche as it may sound, *This time truly is different*... For this anyway. Besides, due to how LETF&amp;#39;s are, I would argue it&amp;#39;s actually better to *DCA* instead of Lump sum, or at least continue to DCA after a huge draw-down so the draw-up roars louder and harder. There&amp;#39;s a difference between DCA into an LETF just like you would with VTI and just putting all 100k of your retirement at once into a market environment with a lot of companies that never have made any profitability at all when you&amp;#39;re 2 years away from retirement&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&amp;quot;So, Okay, what about 2008 then?&amp;quot;&lt;/em&gt;&lt;/strong&gt;&lt;br/&gt;\n&lt;a href=\"https://i.imgur.com/hXj9RnA.png\"&gt;Well...&lt;/a&gt; It&amp;#39;s not pretty. But that&amp;#39;s entirely the point of LETF&amp;#39;s. They amplify, and compound gains and losses. But you&amp;#39;d still have recovered through a 90% drawdown in just... in 4-5 years. If you are able to stomach it, which you *should mentally expect and prepare for* during such a thing, and continue to DCA (which this only tests a lump sum), you essentially are loading up your weapons for the next bull market. And when the bull market comes, it roars loud and clear with LETF&amp;#39;s. The thing people might think with LETF&amp;#39;s is that they&amp;#39;re &amp;quot;beginner traps&amp;quot;, or that &amp;quot;they seem too good to be true&amp;quot;. Really, they&amp;#39;re &amp;quot;risky&amp;quot; extremely volatile. With a lot of things in investing, risk/reward is a big thing. For example, bonds are low-risk, low-reward typically. VTI is considered low-medium risk, low-medium reward. TQQQ/UPRO is high-risk/High-reward, and managing your risk is how you can mitigate the downs, should anything like it happen again. If you&amp;#39;re able to handle 90%+ drawdowns, sure, you can have 90%+ rallies. In fact, though, 2008 is one of the big reasons why QE is such a huge influence in the market. It seems like &amp;quot;The Fed&amp;quot; will do whatever it can to save the market. So, while 2008 probably won&amp;#39;t happen again, an event similar to it (such as 2020) may happen again. But it probably won&amp;#39;t be as bad, last for as long, and may recover quicker.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&amp;quot;But what about Volatility Decay? If the price of $100 goes up 10%, then down $10, you lost money! It&amp;#39;s simple math!&amp;quot;&lt;/em&gt;&lt;/strong&gt;&lt;br/&gt;\nYeah? That is just simple math. I&amp;#39;ve seen this repeated so many times as an argument against LETF&amp;#39;s. It&amp;#39;s not really an argument as the same goes for unleveraged ETF&amp;#39;s such as VTI as well. Sure, while Index XYZ would be at 99, the 3x XYZ would be at 91. But, what exactly does that look like? &lt;a href=\"https://assets.website-files.com/617960145ff34f911afe7243/617960145ff34f0fcdfe79eb_5ed6befa9e2f6d4f2c1095c7_pic-3.png\"&gt;Well&lt;/a&gt;, it certainly looks very odd to say the least. I&amp;#39;ve never had anybody bring up any real examples of decay eating away LETF&amp;#39;s long term. Sure, *theoretically* if the market just goes up and down the exact same amount every single day forever then sure, but *theoretically* I can easily Mike Tyson in a fight if I just perfectly dodge every attack and never get hit. Realistically though, that will never happen. It&amp;#39;s technically *possible*, but hypotheticals and theoreticals oftentimes have no place in reality. Sideways trading does happen quite a bit on a day-to-day scale, but there&amp;#39;s quite a few days/months that on average in the stock market where they account for a good chunk of gains. This is why the saying, &amp;quot;Time in the market beats timing the market&amp;quot;, because if you do somehow get in at the perfect time, you could have missed out some really, really, REALLY great days that would have still made you go up regardless.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&amp;quot;What about if the market drops 34% in a day?! You lose everything&amp;quot;&lt;/em&gt;&lt;/strong&gt;&lt;br/&gt;\nYes/No. Yes, theoretically/hypothetically, the math tells you you would. But realistically there are circuit breakers on basically everything. From futures, to the market, to whatever else you can think of, there are circuit breakers that stop trading so that at any point, a drawdown of such a magnitude is next to impossible at all. As far as I know, historically, such a thing has never happened. There have been some pretty nasty drawdowns, but nothing of that magnitude. Furthermore, you need to ask yourself a simple question: If we&amp;#39;ve had such a crazy bull market, why haven&amp;#39;t inverse LETF&amp;#39;s just went tits up? Surely the math would point to them fizzling out right? I mean, take SQQQ, a 3x inverse of QQQ. But in the real world scenarios, with real world people, these LETF&amp;#39;s are actively managed, which means they&amp;#39;ll do whatever they can to keep it afloat. For example, SQQQ does reverse splits keep it alive. While SQQQ has basically killed all your money if you bought it and held, that&amp;#39;s the same for most inverse ETF&amp;#39;s. It doesn&amp;#39;t have anything to do with leverage.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&amp;quot;So, what about a prolonged bear market such as the Great Depression??&amp;quot;&lt;/em&gt;&lt;/strong&gt;&lt;br/&gt;\nSo, I don&amp;#39;t mean to pull the &amp;quot;ThIs TiMe Is DiFFeReNT&amp;quot; shlick, but truthfully, comparing 1920s america to 2020&amp;#39;s america is like comparing modern cars to 1920&amp;#39;s cars. Sure they both drive but they&amp;#39;re entirely different beasts. Oftentimes, it&amp;#39;s better to bring up averages, rather than extremes, as extremes are usually outliers. Even if they are possible, they&amp;#39;re rarely ever going to happen. Again, This is why something such as 2008 is a better argument against LETF&amp;#39;s than say, the dot-com bubble, but even then, 2008 eventually recovered. Combine those things, plus the willingness of The Fed to just woosh in and save the market, it&amp;#39;s very unlikely such an event will happen again. One important fact to remember is that, on average:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;The average length of a Bull/Bear market is 2.7 years and 9.6 months respectively&lt;/em&gt;&lt;/strong&gt;&lt;br/&gt;\nThis is the whole crux as to why holding something such as VTI/VOO wins long term. You simply have more up days than down days, on average. If you truly are a believer in the sentiment that bull markets will last longer and that the market will continue to be profitable, while bear markets will be significantly shorter, it&amp;#39;s a no-brainer to invest in VTI/VOO, just like it is to invest in TQQQ, once you learn the risks and differences of leveraged ETF&amp;#39;s compared to regular ETF&amp;#39;s. This also brings me back to my next point:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;If you followed Benjamin Graham&amp;#39;s book on the Intelligent Investor, &amp;quot;Mr. Market&amp;quot; is described as irrational and too optimistic or pessimistic.&lt;/em&gt;&lt;/strong&gt;&lt;br/&gt;\nAlong with creating the fundamental investing advice, and being labelled as &amp;quot;probably the most important and influential value investing book ever written&amp;quot; by Warren Buffet himself, Graham describes Mr Market as an analogy for market sentiment. Use this to your advantage. On any bad news about something, the market, instead of being perfectly &amp;quot;efficient&amp;quot;, will be incredibly &amp;quot;bipolar&amp;quot;, swinging from one pendulum of extreme, either being optimistic or pessimistic. This means when the market dips, it will dip *hard*, and when it rallies, it will rally *high*. You can clearly see this currently with the current bull market. People complain that it&amp;#39;s too high, or a bubble. Really, that&amp;#39;s just the market sentiment. No wonder it&amp;#39;s extreme. It&amp;#39;s purely the collective emotion of greed compared to fear. Not &amp;quot;pure raw logic and wits and math and calculations&amp;quot;. The saying goes, &amp;quot;be fearful when others are greedy and greedy when others are fearful&amp;quot;, not &amp;quot;be robotic and logical&amp;quot;. Another great saying is &amp;quot;The market can remain irrational longer than you can remain solvent&amp;quot;. Truth is, the market is irrational. Extremely so.&lt;/p&gt;\n\n&lt;p&gt;With all this being said, these were most of the argument&amp;#39;s I&amp;#39;ve heard against LETF&amp;#39;s. LETF&amp;#39;s are all about risk-management. For example, when I brought up someone who is buying 100k worth of TQQQ in 2001 two years before retirement, that&amp;#39;s for a reason. Due to me being 21, and somewhat little to somewhat moderate cash invested into TQQQ, &lt;em&gt;due to it being leveraged, even a small amount can turn into a large sum.&lt;/em&gt; For example, &lt;em&gt;if you invested 5k in 2010, reinvesting your little dividends you earn from TQQQ, you&amp;#39;d have over 400k today.&lt;/em&gt; This is the power of leverage in great companies. with as little as 5k you can &amp;quot;gamble&amp;quot;, if you really think it&amp;#39;s a gamble. Personally, I think a gamble is 5k in GME right now. Investing into the top companies in the nasdaq, leveraged or not, is way less of a gamble, if at all. Having a long time horizon especially helps, which for high/risk high/reward plays, is definitely an advantage. This is why I would not recommend someone who is two years from retirement to put money they need into leveraged funds. They are inherently, amplified in volatility. Entering at the wrong time, and not having enough time to DCA back in can be devastating.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;If, however, you need a hedge due to your risk tolerance, or having a large sum into TQQQ, you can use 55% TQQQ/UPRO / 45% TMF&lt;/em&gt;&lt;/strong&gt;&lt;br/&gt;\nThis is also another thing I rarely see mentioned. It&amp;#39;s more mentioned from people using TQQQ/UPRO or other LETF&amp;#39;s, but people act like you just go 100% into TQQQ without a hedge and call it a day. Realistically, you can do so much with portfolios. For simplicity sake, TMF, a 3x bonds index, hedges great with TQQQ/UPRO, due to being *uncorrelated* in most timeframes. For example, when people get scared of something such as say.. I don&amp;#39;t know.....? A new Covid Variant called the Omicron, they flock to save bets such as bonds. This means that as TQQQ goes down, TMF will go up. You can actually see it clear as day during last Friday, and especially other days as well. While TQQQ took a beating, TQQQ/TMF was actually up. While, sure, pure 100% TQQQ beats TQQQ/TMF, but if you can&amp;#39;t handle the drawdowns or need a hedge, it&amp;#39;s well, well worth it. This strategy is called &lt;strong&gt;&lt;em&gt;HedgeFundies Excellent Adventure,&lt;/em&gt;&lt;/strong&gt; &lt;em&gt;or&lt;/em&gt; &lt;strong&gt;&lt;em&gt;HFEA&lt;/em&gt;&lt;/strong&gt; for short. I won&amp;#39;t go over it much due to it being exhaustively gone over, but on the bogleheads site, there&amp;#39;s a thread for it already, which you can take a look at them here, &lt;a href=\"https://www.bogleheads.org/forum/viewtopic.php?t=288192\"&gt;Part I&lt;/a&gt; and &lt;a href=\"https://www.bogleheads.org/forum/viewtopic.php?t=288192\"&gt;Part II&lt;/a&gt; here.&lt;/p&gt;\n\n&lt;p&gt;Anyways, In short, why I&amp;#39;m 100% investing in TQQQ and soon to hedge with TMF once I reach a sizable sum is simply for multiple reasons. I disagree with plenty of the arguments I&amp;#39;ve heard about LETF&amp;#39;s, I&amp;#39;m 21, have a long time horizon, and I&amp;#39;m willing to take risks such as leverage in ETF&amp;#39;s to turn a small sum such as 5k, 10k, or 15k into something hopefully huge later down the line. Then once I finally hit a good amount, if I ever do, I&amp;#39;ll then invest back into VTI/VOO and let the dividends compound more than I ever could DCA into. Truth be told, even I&amp;#39;m terrified of holding 500k worth of TQQQ, *maybe* even with a hedge. That&amp;#39;s the short of it.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s also nothing stopping someone from just going 10% TQQQ as well. Even though the prospectus of every LETF says not to buy/hold as they&amp;#39;re only for daily leveraged returns, nobody is stopping you from holding it and seeing what happens. Some people just want to take it farther than others, myself included.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "r57m25",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "Sad_Umbreon",
  "discussion_type": null,
  "num_comments": 63,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/r57m25/long_post_dd_why_im_buyholding_100_tqqq_for_long/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/r57m25/long_post_dd_why_im_buyholding_100_tqqq_for_long/",
  "subreddit_subscribers": 3326858,
  "created_utc": 1638285562,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1638225343,
  "the_new_excerpt": "So, first things first let me get my investing background out of the way. I am\n21, and relatively new. I started around April of this year, but I've been\neyeing the stock market for a while, since I was 17, but since I didn't have a\nstable income stream, I couldn't invest until recently. I heard…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、まず最初に私の投資の経歴を整理しておきましょう。私は\n21歳で、比較的新しい。今年の4月頃から始めたのですが、ずっと前から\n17歳のときからしばらく株式市場に目を向けていましたが、私には\n安定した収入源があるため、最近まで投資ができなかった。聞いた話ですが・・・。",
      "title": "[ロングポストDD】私がTQQQを100%長期購入/保有する理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，首先让我把我的投资背景说出来。我今年\n21岁，相对较新。我大约在今年4月开始，但我已经\n盯着股市有一段时间了，从我17岁开始，但因为我没有稳定的收入来源，所以直到最近才开始投资。\n但由于我没有稳定的收入来源，直到最近我才开始投资。我听说...",
      "title": "[长帖DD]为什么我长期购买/持有100%的TQQQ？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，首先讓我把我的投資背景說出來。我今年\n21歲，相對較新。我大約在今年4月開始，但我已經\n盯着股市有一段時間了，從我17歲開始，但因爲我沒有穩定的收入來源，所以直到最近纔開始投資。\n但由於我沒有穩定的收入來源，直到最近我纔開始投資。我聽說...",
      "title": "[長帖DD]爲什麼我長期購買/持有100%的TQQQ？"
    }
  ],
  "source_updated_at": 1638524502007
}