{
  "author": "deviantmoth",
  "original_created_utc": 1655514797,
  "title": "I'm at a party and there's a drunk woman passed out in the spare bedroom. What do I do?",
  "created_utc": 1655531679,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I went to the person who&amp;#39;s throwing the party and explained to him the situation and he said it&amp;#39;s fine. I explained she could get raped or something, he didn&amp;#39;t seem bothered. So I&amp;#39;m currently stood outside the door to the bedroom kind of guarding it to make sure nobody comes in. I feel silly. Should I wake her up? She&amp;#39;s out cold, so idek how I would do that or if she&amp;#39;d take it the wrong way.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/veuzrg/im_at_a_party_and_theres_a_drunk_woman_passed_out/",
  "subreddit": "NoStupidQuestions",
  "id": "veuzrg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I went to the person who's throwing the party and explained to him the situation\nand he said it's fine. I explained she could get raped or something, he didn't\nseem bothered. So I'm currently stood outside the door to the bedroom kind of\nguarding it to make sure nobody comes in. I feel silly.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "パーティーを開く人のところに行き、事情を説明しました\n彼は大丈夫だと言いました。私は彼女がレイプされたりする可能性があると説明したのですが、彼は気にしていないようでした。\n気にしてないみたい。だから今、寝室のドアの外に立って、誰も来ないように警備しているんだ。\n誰も入ってこないように守っているんだ。バカみたいだけど...。",
      "title": "パーティーで、酔っぱらった女が寝室で倒れてるんだ。どうすればいいんだ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我去找举办宴会的人，向他解释情况\n他说这很好。我解释说她可能会被强奸或什么的，他没有\n他似乎并不在意。所以我现在就站在卧室的门外。\n守着它，确保没有人进来。我觉得很傻....",
      "title": "我在一个聚会上，有一个喝醉酒的女人昏倒在备用卧室里。我应该怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我去找舉辦宴會的人，向他解釋情況\n他說這很好。我解釋說她可能會被強姦或什麼的，他沒有\n他似乎並不在意。所以我現在就站在臥室的門外。\n守着它，確保沒有人進來。我覺得很傻....",
      "title": "我在一個聚會上，有一個喝醉酒的女人昏倒在備用臥室裏。我應該怎麼做？"
    }
  ]
}