{
  "author": "TheBuilderDrizzle497",
  "the_new_excerpt": "I’m going to make this short and sweet. I see a lot of hate for Coinbase and\nBinance. I see it constantly. The hate is stupid. Most of hate is from people\nhating because Binance and Coinbase or whatever exchange you use happens to be\nsomewhat like a centralized bank.\n\nHave you guys tried buying…",
  "original_created_utc": 1617540216,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我要把这话说得简短而甜蜜。我看到很多人对Coinbase和\nBinance. 我经常看到它。仇恨是愚蠢的。大多数的仇恨是来自于人们\n讨厌因为Binance和Coinbase或任何你使用的交易所恰好是。\n有点像中央银行。\n\n你们有没有试过买...",
      "title": "交易所："
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我要把這話說得簡短而甜蜜。我看到很多人對Coinbase和\nBinance. 我經常看到它。仇恨是愚蠢的。大多數的仇恨是來自於人們\n討厭因爲Binance和Coinbase或任何你使用的交易所恰好是。\n有點像中央銀行。\n\n你們有沒有試過買...",
      "title": "交易所："
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "簡潔に説明しますね。コインベースへの憎しみを目の当たりにしたり\nバイナンスのことを 常に見ています。ヘイトは愚かです。ヘイトのほとんどは、人々が\nBinanceやCoinbase、あるいはあなたが使っている取引所が、たまたま中央銀行のようなものだから嫌っているのです。\n中央銀行のようなものです。\n\n皆さんは購入してみたことがありますか？",
      "title": "交換します。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "簡潔に説明しますね。コインベースへの憎しみを目の当たりにしたり\nバイナンスのことを 常に見ています。ヘイトは愚かです。ヘイトのほとんどは、人々が\nBinanceやCoinbase、あるいはあなたが使っている取引所が、たまたま中央銀行のようなものだから嫌っているのです。\n中央銀行のようなものです。\n\n皆さんは購入してみたことがありますか？",
      "title": "交換します。"
    }
  ],
  "title": "Exchanges.",
  "created_utc": 1617575460,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m going to make this short and sweet. I see a lot of hate for Coinbase and Binance. I see it constantly. The hate is stupid. Most of hate is from  people hating because Binance and Coinbase or whatever exchange you use happens to be somewhat like a centralized bank. </p>\n\n<p>Have you guys tried buying crypto back in the day?</p>\n\n<p>Have you guys forgotten how hard that was?</p>\n\n<p>Do you guys realize that you don’t NEED to keep crypto on an exchange?</p>\n\n<p>Do you not realize how easy investing in crypto is now as opposed to back in the day because of these exchanges? </p>\n\n<p>These huge exchanges have allowed many naive investors and less tech savvy investors invest into t he cryptocurrency market like never before. I can appreciate that. Any investor can.</p>\n\n<p>It’s not a perfect system, but it’s also a relatively NEW system. Banks have been around for a very long time. They’ve established trust in society. Crypto exchanges haven’t had that time to mature yet. Give this shit some time and appreciate the fact that crypto finally has multiple platforms to trade, stake, buy, sell or whatever as opposed to a couple of years ago.</p>\n\n<p>Edit: I’m not trying to say that exchanges like Coinbase or Binance are perfect. I just think people forget how far it took to get to where we’re at and don’t consider what these exchanges offer now that wasn’t ever possible before. </p>\n\n<p>These exchanges may come and go. Maybe new platforms get created down the line. Crypto is still new and Rome wasn’t built in a day.</p>\n\n<p>EDIT 2: People seem to think I’m shilling Binance. I’m not shilling Binance. I’ve used and I use multiple exchanges. The point if this post is to acknowledge how far we’ve come while also taking into consideration that improvement amongst ALL platforms needs to be made. Yes, I use Binance for some transactions, but not all. If I replace that with Coinbase, are you guys going to tell me I’ll shilling Coinbase too?</p>\n</div><!-- SC_ON -->",
  "score": 178,
  "permalink": "/r/CryptoCurrency/comments/mjvjya/exchanges/",
  "subreddit": "CryptoCurrency",
  "id": "mjvjya",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961875628
}