{
  "author": "SepticSovietShark",
  "original_created_utc": 1634755891,
  "title": "Why is Australia's force removal of children with regards to the stolen generations not considered genocide?",
  "created_utc": 1634833605,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>From my understanding Australia practised the removal of native children up to the 1960s, considering that forcibly transferring children of the group to another group is specifically stated as a act of genocide. Why is this not considered an act of genocide? I understand that with regards to genocide, it is often about intention, but I can&#39;t quite fathom a reason for removing children from a certain group of people other than to attempt to elimate them as a people.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/qc80f3/why_is_australias_force_removal_of_children_with/",
  "subreddit": "AskHistorians",
  "id": "qc80f3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "From my understanding Australia practised the removal of native children up to\nthe 1960s, considering that forcibly transferring children of the group to\nanother group is specifically stated as a act of genocide. Why is this not\nconsidered an act of genocide? I understand that with regards to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の理解では、オーストラリアは1960年代まで先住民の子供を連れ去ることを行っていました。\n集団の子供を強制的に他の集団に移すことがジェノサイド行為と明記されていることを考えると、オーストラリアでは1960年代までは\n集団の子供を強制的に他の集団に移すことは、ジェノサイドの行為として明記されていることを考えると なぜこれが\n虐殺行為とみなされないのでしょうか？私が理解しているのは...",
      "title": "奪われた世代に関して、オーストラリアが子供たちを強制的に連れ去ったことが、なぜジェノサイドとみなされないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "根据我的理解，澳大利亚一直到1960年代都在实施转移土著儿童的做法。\n考虑到强行将该群体的儿童转移到另一群体，澳大利亚在20世纪60年代一直在实行转移土著儿童的做法。\n考虑到强行将该群体的儿童转移到另一群体是被明确规定为种族灭绝的行为。为什么这不被认为是\n被认为是种族灭绝的行为？我理解，关于...",
      "title": "为什么澳大利亚对被偷走的几代人强行带走儿童的行为不被视为种族灭绝？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據我的理解，澳大利亞一直到1960年代都在實施轉移土著兒童的做法。\n考慮到強行將該羣體的兒童轉移到另一羣體，澳大利亞在20世紀60年代一直在實行轉移土著兒童的做法。\n考慮到強行將該羣體的兒童轉移到另一羣體是被明確規定爲種族滅絕的行爲。爲什麼這不被認爲是\n被認爲是種族滅絕的行爲？我理解，關於...",
      "title": "爲什麼澳大利亞對被偷走的幾代人強行帶走兒童的行爲不被視爲種族滅絕？"
    }
  ]
}