{
  "author": "Thrownaway23002",
  "original_created_utc": 1636097110,
  "title": "In WW2, did anti-aircraft weaponry fire so many shots because of the difficulty hitting targets, or also because aircraft could withstand many hits?",
  "created_utc": 1636120733,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I searched through older questions and couldn&#39;t find any asking about this specifically. </p>\n\n<p>Of course the chance to hit a target is increased by increasing volume of fire, but were armoured planes of the era able to withstand many impacts from AA weapons?</p>\n\n<p>I&#39;m trying to understand the effectiveness of aircraft armour, system redundancy and in-flight repairs when compared to the calibres of the era, and any answers or pointers in the right direction would be much appreciated.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/qn5qbj/in_ww2_did_antiaircraft_weaponry_fire_so_many/",
  "subreddit": "AskHistorians",
  "id": "qn5qbj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I searched through older questions and couldn't find any asking about this\nspecifically.\n\nOf course the chance to hit a target is increased by increasing volume of fire,\nbut were armoured planes of the era able to withstand many impacts from AA\nweapons?\n\nI'm trying to understand the effectiveness of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "過去の質問を検索してみましたが、特にこの件について尋ねているものはありませんでした。\nといったものがありました。\n\nもちろん、射撃量が増えれば命中率は上がります。\nしかし、当時の装甲機は単弾の衝撃に何度も耐えられたのでしょうか？\nの衝撃に耐えられたのでしょうか？\n\n私が理解しようとしているのは、その有効性です。",
      "title": "第二次世界大戦の対空兵器は、命中させるのが難しいから何発も発射したのか、それとも航空機が何発もの命中に耐えられるからなのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我搜索了以前的问题，没有发现任何关于这个问题的问题。\n具体地说。\n\n当然，由于火力的增加，击中目标的机会也会增加。\n但那个时代的装甲飞机是否能够承受住AA武器的多次冲击？\n武器的多次冲击？\n\n我想了解一下这个问题的有效性。",
      "title": "在二战中，防空武器发射如此多的子弹是因为难以击中目标，还是也因为飞机可以承受很多的打击？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我搜索了以前的問題，沒有發現任何關於這個問題的問題。\n具體地說。\n\n當然，由於火力的增加，擊中目標的機會也會增加。\n但那個時代的裝甲飛機是否能夠承受住AA武器的多次衝擊？\n武器的多次衝擊？\n\n我想了解一下這個問題的有效性。",
      "title": "在二戰中，防空武器發射如此多的子彈是因爲難以擊中目標，還是也因爲飛機可以承受很多的打擊？"
    }
  ]
}