{
  "author": "gulasch_man",
  "the_new_excerpt": "All you people are so desperate for a \"reason\" why you made irresponsible\nfinancial choices and now want to shift the blame on others?\n\nI get that seeing such a crash and long days of reds can be heavy on people's\nminds, but right now it is starting to be insane. We have 3 GME, AMC, WSB posts\non…",
  "original_created_utc": 1621868656,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あなた方は、自分が無責任な経済的選択をした「理由」を必死に探している。\n自分が無責任な経済的選択をした「理由」を必死に探して、他人に責任を転嫁したいのでしょうか？\n\nこのような暴落と長い赤の日々を目の当たりにすると、人々の心に重くのしかかってくるのはわかります。\nしかし、今は正気の沙汰ではありません。GME、AMC、WSBの3つの投稿があります。\nで...",
      "title": "Redditに掲載された暗号サブスクの非常識な感情の変化"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你们所有的人都在急切地寻找一个 \"理由\"，为什么你们做出了不负责任的\n财务选择，现在却想把责任推给别人？\n\n我明白，看到这样的崩溃和漫长的红色日子，人们的心情会很沉重。\n但现在它已经开始变得疯狂了。我们有三个GME，AMC，WSB的帖子\n在...",
      "title": "Reddit上到处都是加密货币子的疯狂情绪变化"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你們所有的人都在急切地尋找一個 \"理由\"，爲什麼你們做出了不負責任的\n財務選擇，現在卻想把責任推給別人？\n\n我明白，看到這樣的崩潰和漫長的紅色日子，人們的心情會很沉重。\n但現在它已經開始變得瘋狂了。我們有三個GME，AMC，WSB的帖子\n在...",
      "title": "Reddit上到處都是加密貨幣子的瘋狂情緒變化"
    }
  ],
  "title": "Insane sentiment change in crypto subs all over Reddit",
  "created_utc": 1621914795,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>All you people are so desperate for a &quot;reason&quot; why you made irresponsible financial choices and now want to shift the blame on others?</p>\n\n<p>I get that seeing such a crash and long days of reds can be heavy on people&#39;s minds, but right now it is starting to be insane. We have 3 GME, AMC, WSB posts on main and all of the comments have thousands and hundreds of upvotes, which are talking about- frontline war on the elite and wall street- mother of all short squeezes will happen soon- economy will collapse soon- the only safe haven for you mooney is GME- GME will &quot;probably&quot; worth millions- you should sell your crypto for GME</p>\n\n<p>All of these comments have hundreds of upvotes while all the sane people who are opposing or questioning these are downvoted to hell. What the fuck is happening here? And it&#39;s not only this sub, it happens all across reddit right now. And in some twisted, conspiracy explaining sick way they can somehow attach all this lunatic bullshit to the topic of the sub and they get support. It&#39;s not removed or blocked or whatever. It&#39;s on the main page. But when you post something, 50% chance it gets removed because it&#39;s &quot;meta&quot;.</p>\n\n<p>Can we at least return back to crypto? I already had enough with all the low-effort moon farming content going on here and barely seeing anything about crypto, news and technical discussion, but this is really a new low.</p>\n\n<p>And when it was proposed in meta to remove all such posts, then it has also been downvoted. Crazy...</p>\n</div><!-- SC_ON -->",
  "score": 294,
  "permalink": "/r/CryptoCurrency/comments/nk01am/insane_sentiment_change_in_crypto_subs_all_over/",
  "subreddit": "CryptoCurrency",
  "id": "nk01am",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197385285
}