{
  "author": "_DEDSEC_",
  "original_created_utc": 1633417097,
  "title": "BTC took 96 Days to recover from the May Chinese FUD and only 9 Days to recover from the September Chinese FUD.",
  "created_utc": 1633433452,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>if you&#39;ve been sticking with us since May, congratulations on not giving in to the FUD, and welcome to the start of another rally. </p>\n\n<p>In the past couple of days, BTC has made an amazing recovery compared to other markets, due to the Evergrande situation. But I think the Chinese FUD needs more emphasizing to truly understand how strong the market is.</p>\n\n<p>During the May Chinese FUD we crashed down by 50% in a week, and it took us 96 Days (3.1Months) to recover to somewhere in the price range.</p>\n\n<p>But on the 20Th of September, we crashed yet again thanks to China by 16%, and BTC recovered back 18% within 9 days.</p>\n\n<p>This is truly a remarkable recovery in my opinion and it shows investors are no longer worried about the Chinese FUDs.</p>\n\n<p>We have also seen a massive increase in Defi solutions that aim to provide Chinese investors with an alternative solution to the ban.</p>\n\n<p><strong><em>TL;DR: BTC is resilient to Chinese F.U.D and we&#39;re witnessing diminishing results for China. Thus price goes up.</em></strong></p>\n</div><!-- SC_ON -->",
  "score": 214,
  "permalink": "/r/CryptoCurrency/comments/q1peeb/btc_took_96_days_to_recover_from_the_may_chinese/",
  "subreddit": "CryptoCurrency",
  "id": "q1peeb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "if you've been sticking with us since May, congratulations on not giving in to\nthe FUD, and welcome to the start of another rally.\n\nIn the past couple of days, BTC has made an amazing recovery compared to other\nmarkets, due to the Evergrande situation. But I think the Chinese FUD needs…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "5月からお付き合いいただいている方は、FUDに屈せず、次のラリーの始まりを歓迎します。\nFUDに屈せず、新たなラリーの始まりを歓迎します。\n\nここ数日、BTCは他の市場に比べて驚くほどの回復を見せています。\nここ数日、BTCは他の市場に比べて驚くべき回復を見せていますが、これはEvergrandeの状況によるものです。しかし、私は中国のFUDには必要...",
      "title": "BTCは、5月の中国のFUDから96日で回復し、9月の中国のFUDからはわずか9日で回復しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你从5月起就一直坚持和我们在一起，那么恭喜你没有屈服于谣言。\n如果你自5月以来一直坚持我们的观点，那么恭喜你没有屈服于恐惧症，并欢迎你开始另一次反弹。\n\n在过去的几天里，与其他市场相比，BTC已经取得了惊人的复苏。\n由于恒大的情况，BTC在市场上取得了惊人的复苏。但我认为中国的FUD需要...",
      "title": "BTC花了96天时间从5月的中国恐惧症中恢复过来，而从9月的中国恐惧症中恢复过来的时间只有9天。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你從5月起就一直堅持和我們在一起，那麼恭喜你沒有屈服於謠言。\n如果你自5月以來一直堅持我們的觀點，那麼恭喜你沒有屈服於恐懼症，並歡迎你開始另一次反彈。\n\n在過去的幾天裏，與其他市場相比，BTC已經取得了驚人的復甦。\n由於恆大的情況，BTC在市場上取得了驚人的復甦。但我認爲中國的FUD需要...",
      "title": "BTC花了96天時間從5月的中國恐懼症中恢復過來，而從9月的中國恐懼症中恢復過來的時間只有9天。"
    }
  ]
}