{
  "author": "Hermes_Trismagistus",
  "original_created_utc": 1631176722,
  "title": "Algorand blasts into the Top 20.",
  "created_utc": 1631202190,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Algorand has moved up to number 17 in the Coin Market Cap list of top cryptocurrencies by market capitalisation. This recent climb may be down to the impending introduction of governance from October the 1st. </p>\n\n<p>What does everyone think about Algorand? and will it continue it&#39;s climb up the charts? I&#39;m very bullish on algo but it&#39;d be interesting to hear any dissenting voices as well as from my fellow algo bulls.</p>\n\n<p>Algorand is the first carbon negative blockchain, it has a top quality team working on it, and there are many new apps being built upon it&#39;s blockchain.</p>\n\n<p>Best wishes, H.T.</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/CryptoCurrency/comments/pktubw/algorand_blasts_into_the_top_20/",
  "subreddit": "CryptoCurrency",
  "id": "pktubw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Algorand has moved up to number 17 in the Coin Market Cap list of top\ncryptocurrencies by market capitalisation. This recent climb may be down to the\nimpending introduction of governance from October the 1st.\n\nWhat does everyone think about Algorand? and will it continue it's climb up the\ncharts?…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アルゴランドは、コインマーケットキャップのトップリストで17位に浮上しました。\nアルゴランドは、時価総額で上位の暗号通貨リストの17位にランクインしました。今回の上昇は、10月1日からのガバナンス導入を目前に控えたことによるものと思われます。\n10月1日からのガバナンスの導入が迫っているからかもしれません。\n\n皆さんはAlgorandについてどう思われますか？また、このまま上昇を続けるでしょうか？\nそして、このまま上昇を続けるのか？...",
      "title": "アルゴランドがトップ20に躍り出た。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Algorand在币圈市值排名中已上升至第17位。\n的第17位。最近的这种攀升可能是由于\n10月1日即将推出的治理。\n\n大家对Algorand有什么看法？\n榜单？",
      "title": "阿尔戈兰轰然进入前20名。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Algorand在幣圈市值排名中已上升至第17位。\n的第17位。最近的這種攀升可能是由於\n10月1日即將推出的治理。\n\n大家對Algorand有什麼看法？\n榜單？",
      "title": "阿爾戈蘭轟然進入前20名。"
    }
  ]
}