{
  "author": "allthatrazmataz",
  "the_new_excerpt": "My Austrian great-grandfather had a friend, Herr Wagner. Herr Wagner had no wife\nor children. When he died, my great-grandmother told the following story:\n\nWhen Herr Wagner reported for conscription, he was measured all over - face,\nfingers, body. The doctors determined he met the proportions of the…",
  "original_created_utc": 1614370110,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我的奥地利曾祖父有一个朋友，瓦格纳先生。瓦格纳先生没有妻子\n或子女。当他去世时，我的曾祖母讲述了以下故事：\n\n当瓦格纳先生报到时，他的脸被量了个遍。\n手指，身体。医生确定他符合比例的... ...",
      "title": "纳粹真的为了繁衍 \"雅利安人 \"士兵而不惜以最惨烈的战争为代价吗？- 口述历史说他们有"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的奧地利曾祖父有一個朋友，瓦格納先生。瓦格納先生沒有妻子\n或子女。當他去世時，我的曾祖母講述了以下故事：\n\n當瓦格納先生報到時，他的臉被量了個遍。\n手指，身體。醫生確定他符合比例的... ...",
      "title": "納粹真的爲了繁衍 \"雅利安人 \"士兵而不惜以最慘烈的戰爭爲代價嗎？- 口述歷史說他們有"
    }
  ],
  "title": "Did the Nazis really spare “Aryan” soldiers the worst of war for reproduction purposes? - Oral history says they did",
  "created_utc": 1614402005,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My Austrian great-grandfather had a friend, Herr  Wagner. Herr Wagner had no wife or children. When he died, my great-grandmother told the following story:</p>\n\n<p>When Herr Wagner reported for conscription, he was measured all over - face, fingers, body. The doctors determined he met the proportions of the “perfect Aryan” and sent him to a special training center.</p>\n\n<p>He didn’t know what he was doing there at first, but the training was intense. For example, the officers set the barracks on fire in the middle of the night without any warning.</p>\n\n<p>At some point, Herr Wagner was told that we was to be one of Hitler’s bodyguards. He then saw terrible things. For example, he said he saw Hitler give a speech telling soldiers than Germans do not retreat. The next day, after a battle, only three men out of about 100 were still alive and uninjured.</p>\n\n<p>In 1941, Herr Wagner returned home with a medical certificate exempting him from military service because of a weak heart. However, his hearts was fine. He was sent home because by then someone up high was afraid that Germany could lose, or that too many “perfect Aryans” could be killed, and he was sent home to survive and reproduce.</p>\n\n<p>Herr Wagner did not want to be a stud for Hitler, so he never married or had children.</p>\n\n<p>I cannot confirm this. By the time I knew any of it, the man was dead. He did not want to talk about it, so my great-grandmother only knew the basics, and then second-hand from when he told my great-grandfather years before.</p>\n\n<p>So, my dear Historians. Is such a scenario possible? Could a young man be selected for special service/Hitler’s bodyguard just for the proportions of his body? Was there a policy of secretly sending home people with eugenics in mind? Was there such insane training? </p>\n\n<p>It is true that Herr Wagner returned early from the way, and his advanced age suggests that he did not have heart problems. It is also true that the man never married or had children, in a time when the extreme ratio of women to men, and conservative social pressure, would have made it easy to do and difficult to avoid. </p>\n\n<p>Any insight you have would be greatly appreciated. I’ve always wondered, but have no one who would know that I could ask.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/lt6kms/did_the_nazis_really_spare_aryan_soldiers_the/",
  "subreddit": "AskHistorians",
  "id": "lt6kms",
  "is_self": true,
  "media": null,
  "is_video": false
}