{
  "author": "ksnizzo",
  "original_created_utc": 1627222409,
  "title": "The cult of Safemoon is getting out of control. I was one for a while, but I feel like one of those anti-brainwashed people that get out of cults now.",
  "created_utc": 1627252450,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was all about Safemoon early on…not quite early enough to make a huge profit, but still early enough to almost have to learn how to code and create my own token just to buy the stuff. Recently between people whining about price, wanting more info, the corny cryptic pictures the Devs have been releasing, and the worship of “Papa” I have been getting a bad vibe.</p>\n\n<p>Cut to Yesterday…a character that goes by “Safemoon mark” released a new way to buy the tokens by using a contract address he created. It does seem to be legit, but people immediately accepted it and started buying through his created address. He was a normal redditer, albeit a super fan, and after the sub pumped him up so much, the Safemoon team actually hired him. I mean hey, good for him, but that is a little wild. </p>\n\n<p>So, I posted on their sub earlier just saying what if he was playing the long con…and that like 90% of the “Safemoon army” is so indoctrinated they just went with it with zero DD. Wow, I was attacked fiercely! How dare I even question that someone might try a scam in the crypto world. It’s gotten to the point that even mentioning anything that might be a negative about the holy grail that is Safemoon is undoubtedly FUD and I am obviously trying to take them down. Hmmmm…sounds very similar to things like Scientology. </p>\n\n<p>Anyway, I was about to buy a lot more, but after seeing recent activity and the reaction to my post, it’s like the veil was lifted and I’m no longer brainwashed. The Devs are all hipster 20 somethings with hardly no experience and they haven’t really delivered any of the “world-changing” concepts they speak of. I very well may be wrong and “Safemoon is the way” but I’m out. Any other people feel this way? </p>\n\n<p>P.S. The hatred for this sub is real over there. People even post screenshots of them posting here and saying their post was deleted as this sub is scared (from what I’ve seen the posts have been deleted for valid reasons like lack of character count, etc), but it’s a huge win for them! I’m sure I’d be crucified for speaking out on this sub. </p>\n\n<p>Sorry for the length, but just needed to get these feelings out. Like an epiphany.</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/orcatg/the_cult_of_safemoon_is_getting_out_of_control_i/",
  "subreddit": "CryptoCurrency",
  "id": "orcatg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was all about Safemoon early on…not quite early enough to make a huge profit,\nbut still early enough to almost have to learn how to code and create my own\ntoken just to buy the stuff. Recently between people whining about price,\nwanting more info, the corny cryptic pictures the Devs have been…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は早くからSafemoonに注目していました...莫大な利益を上げるほどではありませんでしたが。\n大儲けできるほどではありませんでしたが、コードの書き方を勉強して、自分でトークンを作らなければならないほどでした。\nトークンを作成しなければならないほどでした。最近では、価格について泣き言を言っている人や、もっと情報が欲しいと言っている人の間で\n最近では、価格に不満を持つ人、もっと情報が欲しい人、開発者が描いた陳腐な暗号のような絵...。",
      "title": "Safemoonのカルトは制御不能になりつつある。私も一時期はそうでしたが、今はカルトから抜け出す反洗脳された人の一人のように感じています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很早就开始关注Safemoon......还没有早到可以赚大钱的程度。\n但仍然足够早，几乎要学习如何编码和创建自己的\n代币来购买这些东西。最近在人们抱怨价格的同时。\n希望得到更多的信息，开发人员一直在用陈词滥调的图片......",
      "title": "对Safemoon的崇拜正在失去控制。我曾经是其中一员，但我觉得自己现在就像那些从邪教中走出来的反洗脑者。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很早就開始關注Safemoon......還沒有早到可以賺大錢的程度。\n但仍然足夠早，幾乎要學習如何編碼和創建自己的\n代幣來購買這些東西。最近在人們抱怨價格的同時。\n希望得到更多的信息，開發人員一直在用陳詞濫調的圖片......",
      "title": "對Safemoon的崇拜正在失去控制。我曾經是其中一員，但我覺得自己現在就像那些從邪教中走出來的反洗腦者。"
    }
  ]
}