{
  "author": "SlavophilesAnonymous",
  "original_created_utc": 1625726232,
  "title": "Why were West African blacksmiths so resistant to technological advancement before colonization?",
  "created_utc": 1625747783,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Here’s what I understand about the West African smithing tradition. West Africa invented ironworking for themselves, but their art seems to have stayed remarkably the same for millenia. Metalworking was regarded as magical, and only certain clans did it. As a result, smiths never made maille armor or guns, despite the immense demand that African states had for both. Chainmail and muskets had to be imported.</p>\n\n<p>Fast forward to today, <a href=\"http://www.smallarmssurvey.org/fileadmin/docs/D-Book-series/book-01-Armed-and-Aimless/SAS-Armed-Aimless-Part-1-Chapter-03.pdf\">and if you go to Suame in Ghana</a>, you’ll find traditional blacksmiths turning out rifles and pump-action shotguns at a rate of one every week or every other week per smith. One smith will specialize in a certain component as part of a division of labor throughout the community of the town’s gunsmiths. These craft guns have a reputation for quality, no less. In Accra, some traditional blacksmiths have even figured out how to make imitation AK-47s. All of this is completely illegal in Ghana, so the government can’t get any credit for the industriousness of these smiths.</p>\n\n<p>But how is it that the ancestors of these ingenious smiths were unable to make simple muskets or put together even a crude maille outfit, despite having so many examples of these useful weapons and armor around them? Or is it that I’m wrong, and they did?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/og1p88/why_were_west_african_blacksmiths_so_resistant_to/",
  "subreddit": "AskHistorians",
  "id": "og1p88",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Here’s what I understand about the West African smithing tradition. West Africa\ninvented ironworking for themselves, but their art seems to have stayed\nremarkably the same for millenia. Metalworking was regarded as magical, and only\ncertain clans did it. As a result, smiths never made maille armor…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "西アフリカの鍛冶屋の伝統について、私はこう理解しています。西アフリカ\n自分たちで鉄加工を発明したが、その技術は何千年もの間\n彼らの技術は何千年もの間、驚くほど変わっていないようです。金属加工は魔法のようなものと考えられていて、特定の一族だけが\n金属加工は魔法のようなものとされ、特定の一族だけが行っていました。そのため、鍛冶屋がメイル・アーマーを作ることはありませんでした...。",
      "title": "植民地化以前の西アフリカの鍛冶屋は、なぜ技術の進歩に抵抗があったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "以下是我对西非铁匠传统的理解。西非\n为自己发明了铁器加工，但他们的艺术似乎已经保持了几千年的\n几千年来一直保持着惊人的一致性。金属加工被认为是神奇的，而且只有\n只有某些部族才会这样做。因此，铁匠们从来没有制造过邮票式盔甲......",
      "title": "为什么在殖民化之前，西非的铁匠对技术进步如此抗拒？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "以下是我對西非鐵匠傳統的理解。西非\n爲自己發明了鐵器加工，但他們的藝術似乎已經保持了幾千年的\n幾千年來一直保持着驚人的一致性。金屬加工被認爲是神奇的，而且只有\n只有某些部族纔會這樣做。因此，鐵匠們從來沒有製造過郵票式盔甲......",
      "title": "爲什麼在殖民化之前，西非的鐵匠對技術進步如此抗拒？"
    }
  ]
}