{
  "author": "livebonk",
  "the_new_excerpt": "The year is 2053. Every country's fiat has been replaced by Walmart reward\ntokens. It's decentralized on a blockchain and has nothing to do with Walmart,\nbut was gradually adopted because of its stability and the name remains. Due to\nthe global redistribution of wealth resulting from DeFi, a loaf of…",
  "original_created_utc": 1619614746,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "時は2053年。すべての国のフィアットは、ウォルマートのリワードトークンに置き換えられました。\nトークンに置き換えられています。ブロックチェーンで分散化されており、ウォルマートとは何の関係もありません。\nが、安定していることと名前が残っていることから徐々に採用されていった。因みに\nDeFiによる世界的な富の再分配により、1斤の...",
      "title": "時は2053年。すべての国のフィアットは、ウォルマートのリワードトークンに置き換えられました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这一年是2053年。每个国家的法币都已被沃尔玛的奖励品所取代\n代币所取代。它是在区块链上去中心化的，与沃尔玛无关。\n但由于其稳定性和名字的存在，逐渐被采用。由于\nDeFi带来的全球财富再分配，一块面包...",
      "title": "这一年是2053年。每个国家的法币都已被沃尔玛的奖励代币所取代。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這一年是2053年。每個國家的法幣都已被沃爾瑪的獎勵品所取代\n代幣所取代。它是在區塊鏈上去中心化的，與沃爾瑪無關。\n但由於其穩定性和名字的存在，逐漸被採用。由於\nDeFi帶來的全球財富再分配，一塊麪包...",
      "title": "這一年是2053年。每個國家的法幣都已被沃爾瑪的獎勵代幣所取代。"
    }
  ],
  "title": "The year is 2053. Every country's fiat has been replaced by Walmart reward tokens.",
  "created_utc": 1619638233,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The year is 2053. Every country&#39;s fiat has been replaced by Walmart reward tokens. It&#39;s decentralized on a blockchain and has nothing to do with Walmart, but was gradually adopted because of its stability and the name remains. Due to the global redistribution of wealth resulting from DeFi, a loaf of bread costs between 0.01 and 0.03 Wallys anywhere in the world.</p>\n</div><!-- SC_ON -->",
  "score": 563,
  "permalink": "/r/CryptoCurrency/comments/n0e8kw/the_year_is_2053_every_countrys_fiat_has_been/",
  "subreddit": "CryptoCurrency",
  "id": "n0e8kw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776213348
}