{
  "author": "Lex_Ambr",
  "the_new_excerpt": "So I've been trading with crypto for some time and everyone has noticed a huge\nwave of newbies getting into the crypto market. Especially with the DOGE coin\ntrending on social media.\n\nPeople sometimes say, \"Aw man, if only I held on longer then I would've got\nmore!\".\n\nSTOP IT. This thought can LOSE…",
  "original_created_utc": 1612774739,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我用加密货币交易已经有一段时间了，大家都注意到了一个巨大的。\n波的新手进入加密市场。尤其是DOGE币\n社交媒体上的趋势。\n\n人们有时会说：\"啊，伙计，如果我坚持的时间长一点，那么我就会有了。\n更多！\"。\n\n停止它。这个念头可以LOSE...",
      "title": "如果你赚了......干得好，你赢了。不要后悔！"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我用加密貨幣交易已經有一段時間了，大家都注意到了一個巨大的。\n波的新手進入加密市場。尤其是DOGE幣\n社交媒體上的趨勢。\n\n人們有時會說：\"啊，夥計，如果我堅持的時間長一點，那麼我就會有了。\n更多！\"。\n\n停止它。這個念頭可以LOSE...",
      "title": "如果你賺了......幹得好，你贏了。不要後悔！"
    }
  ],
  "title": "If you made profit...Well done, you've won. Don't Regret it!",
  "created_utc": 1612812634,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I&#39;ve been trading with crypto for some time and everyone has noticed a huge wave of newbies getting into the crypto market. Especially with the DOGE coin trending on social media.</p>\n\n<p>People sometimes say, &quot;Aw man, if only I held on longer then I would&#39;ve got more!&quot;. </p>\n\n<p><strong>STOP IT. This thought can LOSE YOU MONEY.</strong> </p>\n\n<p>I have seen people with not just crypto, always beat themselves down that they only made like 20% profit instead of 60%. If you do this, you could actually lose money on your next investment with this mindset. For example with the XRP Crypto. I&#39;ve seen people go, &quot;Man, I pulled out early. But I&#39;ll rebuy it and maybe it&#39;ll continue to raise.&quot; and then all of a sudden drop back down to 0.39 and they lost everything they&#39;ve earned.</p>\n\n<p>I bought DOGE at .037 and sold it at .054. Now it reached .078 recently. Do I regret it? <strong>No.</strong> Because it&#39;s soo damn easy for things to turn upside down. It dropped to 0.28 not long ago. Despite the unstable background and info on the DOGE coin,  054 was a good time to pull out, and the moment I did, It dropped down to .42! </p>\n\n<p>People sold their bitcoin years ago and made themselves hundreds to tens of thousands of dollars. I&#39;ve seen people save themselves from a terrifying medical bill or completely paid off their student debts thanks to their early investment. That is a success!  </p>\n\n<p>You wish you could&#39;ve stayed a bit longer when you&#39;re out and looking back on it. But it&#39;s a completely different thought process when you&#39;re actually involved and got your money riding on it.</p>\n\n<p>Nobody has a crystal ball to predict that it can shoot up, and anybody who says, &quot;LOL pathetic paper hands you shouldn&#39;t have sold idiot&quot; are likely liars, foolish, gamblers with barely any understanding of how the investment/crypto world works. Ignore them. Never compare your success to others. Stories of people making +1000% in a short amount of time are soo damn rare. </p>\n\n<p>No matter how big or small. If it&#39;s $20 Profit or $2000. If you&#39;re up and got out. You&#39;ve won.</p>\n</div><!-- SC_ON -->",
  "score": 205,
  "permalink": "/r/CryptoCurrency/comments/lf7w0s/if_you_made_profitwell_done_youve_won_dont_regret/",
  "subreddit": "CryptoCurrency",
  "id": "lf7w0s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123195587
}