{
  "author": "Okmanl",
  "the_new_excerpt": "\"key findings:\n\n * We find a simple investment strategy of buying an equally weighted portfolio\n   of each year’s U.S. large BPTW winners outperforms the S&P 500 index in nine\n   of the 11 years we examined. On average, stocks of BPTW winners earned 20.3\n   percent per year between 2009 and 2019,…",
  "original_created_utc": 1613359048,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "\"主要发现。\n\n * 我们发现了一个简单的投资策略，即购买同等权重的投资组合。\n   每年的美国大型BPTW获奖者中，有9家的表现超过了标准普尔500指数。\n   在我们考察的11年中。平均而言，BPTW获奖者的股票获得了20．\n   在2009年至2019年期间，每年的百分比，．",
      "title": "被Glassdoor评为 \"最佳工作地点 \"的股票，过去十年的平均回报率为20.3%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"主要發現。\n\n * 我們發現了一個簡單的投資策略，即購買同等權重的投資組合。\n   每年的美國大型BPTW獲獎者中，有9家的表現超過了標準普爾500指數。\n   在我們考察的11年中。平均而言，BPTW獲獎者的股票獲得了20．\n   在2009年至2019年期間，每年的百分比，．",
      "title": "被Glassdoor評爲 \"最佳工作地點 \"的股票，過去十年的平均回報率爲20.3%。"
    }
  ],
  "title": "Stocks that were awarded \"Best Place To Work At\" by Glassdoor have averaged 20.3% returns for the past decade.",
  "created_utc": 1613363819,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;key findings:</p>\n\n<ul>\n<li>We find a simple investment strategy of buying an equally weighted portfolio of each year’s U.S. large BPTW winners outperforms the S&amp;P 500 index in nine of the 11 years we examined. On average, stocks of BPTW winners earned 20.3 percent per year between 2009 and 2019, compared to 12.9 percent for the S&amp;P 500. </li>\n<li>Three industry sectors lead in terms of stock performance among BPTW companies: Retail (40.5 percent average annual return in the year after award recognition); professional and business services (28.3 percent); and information technology (24.7 percent). The lowest stock returns among award winners were found in more traditional sectors of the economy: Construction, repair and maintenance (-1.4 percent); oil, gas, energy and utilities (3.9 percent); and insurance (4.4 percent).</li>\n<li>Consistent with the growing <a href=\"https://www.glassdoor.com/research/satisfied-employees-drive-business-results/\">academic literature</a> that finds a link between employee culture and business performance, we find that stocks of publicly-traded winners of Glassdoor’s Best Places to Work award historically outperformed the U.S. stock market in most years.&quot;</li>\n</ul>\n\n<p>When it comes to valuing a company, it seems that people tend to just look at balance sheets. And completely ignore the people that actually make up the company. The CEO, management team, and the engineers that are responsible for making the company grow.</p>\n\n<p>When you think about it, when you invest you&#39;re ultimately giving it to the CEO and his employees to manage. So maybe one should start there first, and then work backwards to determine whether or not the investment is a potential 10Xer.</p>\n\n<p>For example people were constantly calling Amazon overpriced in the 90s and late 00s just based on balance sheets. But ignored the fact that Jeff Bezos was the one leading the company. Constantly innovating Amazon, hiring the best engineers, and creating a company culture of innovation. The same could be said about Jack Dorsey and Square, Elon Musk and Tesla and so on.</p>\n\n<p>source: <a href=\"https://www.glassdoor.com/research/app/uploads/sites/2/2020/04/Stock-Returns-2020-Glassdoor-Final-Reduced.pdf\">https://www.glassdoor.com/research/app/uploads/sites/2/2020/04/Stock-Returns-2020-Glassdoor-Final-Reduced.pdf</a></p>\n</div><!-- SC_ON -->",
  "score": 1695,
  "permalink": "/r/investing/comments/lk4fei/stocks_that_were_awarded_best_place_to_work_at_by/",
  "subreddit": "investing",
  "id": "lk4fei",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728621141
}