{
  "author": "Draygoes",
  "original_created_utc": 1645371807,
  "title": "How could a normal person become president of the United States?",
  "created_utc": 1645399399,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We grew up being told that it is technically possible, so let&amp;#39;s play off of that.&lt;br/&gt;\nWhat if it were more viable than it is now. If the country accepted any normal person to try out, what sort of challenges would that person face?  &lt;/p&gt;\n\n&lt;p&gt;And most importantly, how would that person actually run? What happens from the moment that they get the idea of running into their heads until the moment they are elected?  &lt;/p&gt;\n\n&lt;p&gt;Oh, and I don&amp;#39;t have any agenda here. This hypothetical person can come from either side of the political isle for all that I care.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/sx3z2z/how_could_a_normal_person_become_president_of_the/",
  "subreddit": "NoStupidQuestions",
  "id": "sx3z2z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We grew up being told that it is technically possible, so let's play off of\nthat.\nWhat if it were more viable than it is now. If the country accepted any normal\nperson to try out, what sort of challenges would that person face?\n\nAnd most importantly, how would that person actually run? What happens…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "技術的に可能だと言われて育ったのだから、それに乗っかってみよう。\nということです。\n今よりも実現性が高いとしたらどうでしょう。もし、国が普通の人を受け入れるとしたら\nその人はどんなことに挑戦するのだろう。\n\nそして何より、その人が実際にどのように走るのか？どうなるんだろう...。",
      "title": "普通の人がアメリカの大統領になれるわけがない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们在成长过程中被告知这在技术上是可能的，所以让我们来发挥一下\n这一点。\n如果它比现在更可行呢。如果这个国家接受任何正常人\n试试，这个人将面临什么样的挑战？\n\n而最重要的是，这个人究竟会如何竞选？会发生什么...",
      "title": "一个正常人怎么可能成为美国总统？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們在成長過程中被告知這在技術上是可能的，所以讓我們來發揮一下\n這一點。\n如果它比現在更可行呢。如果這個國家接受任何正常人\n試試，這個人將面臨什麼樣的挑戰？\n\n而最重要的是，這個人究竟會如何競選？會發生什麼...",
      "title": "一個正常人怎麼可能成爲美國總統？"
    }
  ]
}