{
  "author": "Preacher_rob",
  "original_created_utc": 1644543420,
  "title": "Was my boss justified in firing me? Should I fight this?",
  "created_utc": 1644593529,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I (24M) was fired today.&lt;/p&gt;\n\n&lt;p&gt;I am a student, but also work part time for the government and a shoe store. Today I called in sick from my government job because I was nauseous and throwing up all morning. By the afternoon, I felt well enough to leave the house and I went to the shoe store to pick up my paycheck. My tuition was due today and I needed money. While I was at the store (a matter of minutes) my boss from the government job comes in. (Not to buy shoes, obviously). He said &amp;quot;what are you doing here if you&amp;#39;re sick?&amp;quot; I told him I was only getting my paycheck so I could have some money in my pocket for food, gas, etc. Without hesitation, he asked for my work keys, credit cards, etc. He said &amp;quot;this ain&amp;#39;t gonna fly. You&amp;#39;re done&amp;quot;. He went out of his way to come to my shoe store across town, just to see if I was there instead of at work.&lt;/p&gt;\n\n&lt;p&gt;Was he in the wrong or was I? Should I do something about this or forget about it? Am I not entitled to do as I please when I call in?&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t be the only person on the planet who calls in sick and feels better later in the day, or even calls in and isn&amp;#39;t sick. What I do outside of work is my business. Also note, I was not getting paid leave for my absence. It was unpaid leave.&lt;/p&gt;\n\n&lt;p&gt;Edit: this was my first time calling in over the 6 months I have worked. I live in the US.&lt;/p&gt;\n\n&lt;p&gt;Edit 2: I puked (vomited, barfed) multiples times today, have body aches, fever and muscle pain. I took some water with alka seltzer then went to get my paycheck so I could have some money for the week and use some of it to pay my tuition. I have less than $100 in my bank account so it was basically get that check or have my classes canceled for missing a payment.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/spmp8g/was_my_boss_justified_in_firing_me_should_i_fight/",
  "subreddit": "NoStupidQuestions",
  "id": "spmp8g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I (24M) was fired today.\n\nI am a student, but also work part time for the government and a shoe store.\nToday I called in sick from my government job because I was nauseous and\nthrowing up all morning. By the afternoon, I felt well enough to leave the house\nand I went to the shoe store to pick up my…"
}