{
  "author": "Someus3r",
  "original_created_utc": 1629142105,
  "title": "Please don’t ever take out a loan to buy the dip",
  "created_utc": 1629171328,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was scrolling through the Safemoon sub and came across a comment that recommended people to take out a loan to buy the dip. This is just about the worst piece of advice I’ve ever heard, and shouldn’t even be joked about. </p>\n\n<p>Please only invest what you can afford to lose. Although I firmly believe in the future of crypto, it’s extremely volatile.</p>\n\n<p>I want each and every person reading this to be able to be financially independent one day, but risking it all on a potential scam is not the way to go.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/p5n6m4/please_dont_ever_take_out_a_loan_to_buy_the_dip/",
  "subreddit": "CryptoCurrency",
  "id": "p5n6m4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was scrolling through the Safemoon sub and came across a comment that\nrecommended people to take out a loan to buy the dip. This is just about the\nworst piece of advice I’ve ever heard, and shouldn’t even be joked about.\n\nPlease only invest what you can afford to lose. Although I firmly believe in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Safemoonのサブページを見ていたら、あるコメントに出会いました。\nディップを買うためにローンを組むことを推奨するコメントがありました。これは、今まで聞いた中で\n私がこれまでに聞いたアドバイスの中で最悪のものであり、冗談でも言うべきではありません。\n\n損失を被る可能性のあるものだけを投資してください。私はしっかりと信じていますが...。",
      "title": "ディップを買うためにローンを組むのは絶対にやめてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在翻阅Safemoon子刊时，看到一条评论说\n建议人们贷款购买股票。这几乎是我所见过的\n这是我听过的最糟糕的建议，甚至不应该被开玩笑。\n\n请只投资你能承受的损失。虽然我坚定地相信...",
      "title": "请千万不要贷款买跌停板"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在翻閱Safemoon子刊時，看到一條評論說\n建議人們貸款購買股票。這幾乎是我所見過的\n這是我聽過的最糟糕的建議，甚至不應該被開玩笑。\n\n請只投資你能承受的損失。雖然我堅定地相信...",
      "title": "請千萬不要貸款買跌停板"
    }
  ]
}