{
  "author": "0toHeroInvesting",
  "the_new_excerpt": "Quadruple witching day is just ahead, what will happen in the stock market? Does\nApple have room to grow again? DASH & ABNB are fading after crazy IPOs. Let’s\ntalk about this and the latest stock market news\n\n~Very Long Post~\n\nHello everyone and Good morning! So, let’s start with the recap of…",
  "original_created_utc": 1608039311,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "四重巫术日就在眼前，股市会发生什么呢？会吗？\n苹果还有再次成长的空间吗？在疯狂的首次公开募股(IPO)之后，Dash&ABNB正在逐渐消退。我们走吧\n谈谈这个和最新的股市消息\n\n~很长的帖子~\n\n大家好，早上好！那么，让我们从…的回顾开始",
      "title": "四重魔法股日|DASH&ABNB崩盘|苹果股票|今日股市行情[12-15]"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "四重巫術日就在眼前，股市會發生什麼呢？會嗎？\n蘋果還有再次成長的空間嗎？在瘋狂的首次公開募股(IPO)之後，Dash&ABNB正在逐漸消退。我們走吧\n談談這個和最新的股市消息\n\n~很長的帖子~\n\n大家好，早上好！那麼，讓我們從…的回顧開始",
      "title": "四重魔法股日|DASH&ABNB崩盤|蘋果股票|今日股市行情[12-15]"
    }
  ],
  "title": "Quadruple Witching Stock Day | DASH & ABNB Crash | Apple Stock | Stock Market News Today [12-15]",
  "created_utc": 1608054206,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Quadruple witching day is just ahead, what will happen in the stock market? Does Apple have room to grow again? DASH &amp; ABNB are fading after crazy IPOs. Let’s talk about this and the latest stock market news</strong></p>\n\n<p><strong>~Very Long Post~</strong></p>\n\n<p>Hello everyone and Good morning! So, let’s start with the recap of Monday, as we saw a great start in the early morning with the Dow hitting an intra-day record, but the rally faded for the broader stock market and especially the industrial heavy <a href=\"https://ibb.co/yVcZV95\">DOW JONES</a> which lost .61%, with the broad market <a href=\"https://ibb.co/xGBkgyF\">SP500</a> also losing .44% while the tech heavy <a href=\"https://ibb.co/dWNjyCY\">NASDAQ</a> lived up to the recent reputation as a go-to defensive play yesterday and finished up .50%. Meanwhile the <a href=\"https://ibb.co/mH5Pmsw\">VIX</a> also spiked more than 6% and is nearing the 25 levels, which could mean significantly more volatility for the stock market.</p>\n\n<p>We also saw more companies declining <a href=\"https://ibb.co/jwVnsXt\">yesterday</a> on normal volume of about 10.5B shares, as we finally went below 80% of the companies trading above the 50-day simple moving average, as small-cap growth companies outperformed <a href=\"https://ibb.co/NNWkSQt\">yesterday</a> with large-cap value companies lagging, especially from the energy and industrial sectors. With energy losing more 3.5% for the day, while the only 2 gaining <a href=\"https://ibb.co/0ymGMHL\">sectors</a> were Technology and Consumer Discretionary, which seems to indicate what I was expecting, that investors are dropping losers from this year for tax purposes and betting again on the companies that sparked the rally since the bottom in March. And keep in mind that funds &amp; money managers use this tactic for window dressing also, so that they can have a nice advertising brochure for next year.</p>\n\n<p>Here is the <a href=\"https://ibb.co/kMTNKY7\">HEAT MAP</a> from yesterday, you can see here the big wall of red in the energy sector, with Disney which saw a healthy correction after a huge run and Pfizer being some of the biggest losers. While Netflix, Amazon, Nvidia, Tesla and PayPal were some of the biggest gainers alongside the biotech sector.</p>\n\n<p><a href=\"https://ibb.co/tPnzGmN\">HERE</a> is the economic data that will be received today, there isn’t anything big on the calendar, as we get ready for a lot of big numbers coming on Wednesday and Thursday. Just a reminder, there was no big economic data that came in yesterday.</p>\n\n<p>So, Quadruple witching day is just a couple of days away, and this time it will probably bring even more heavy trading volume than usual.</p>\n\n<p>For anyone that doesn’t know, quadruple witching <a href=\"https://ibb.co/p063Sgw\">refers</a> to the day when stock options, stock index futures &amp; options and single stock futures expire on the same day. </p>\n\n<p>This happens 4 times every single year, and usually brings increased <a href=\"https://ibb.co/Gxr4pnc\">volume</a> to the stock markets, and guess what guys, this will coincide with the last day of trading before Tesla enters the SP index.</p>\n\n<p>So I believe this next week and especially the 17th-22nd will be very volatile for Tesla. </p>\n\n<p>At the <a href=\"https://ibb.co/SRTyzcN\">moment</a> there is more open interest in tesla stock options, with over 8 million contracts, which multiplied by 100 shares for each contract represent 800M shares, that is more than the actual free float for the stock at the moment at 760M shares.</p>\n\n<p>And, right now, there are a lot more put options contract on Tesla, with a put to call ratio of 1.5</p>\n\n<p>My personal opinion is that we can see the stock continue to rise in the following days before going for a dip or correction following this huge moment of volatility for the stock. We can see the avg <a href=\"https://ibb.co/qYNg2dL\">volume</a> for Tesla has been near 60M shares in the last 10days, so there have been a lot of shares that have already exchanged hands. I believe most of the money managers, who are not obliged to perfectly track the SP indexes, have already finished up buying the stock, so I expect there will be a lot more sellers than buyers when most retail investors expect the stock to go even higher. But don’t take my advice, do your own research and analysis. Full disclosure, I am a bull long-term on Tesla, but just think there is a downside risk approaching.</p>\n\n<p>So let go through a couple of stock market news, <a href=\"https://ibb.co/NVQsB0b\">Apple</a> is planning on manufacturing almost 100M new iPhone in the first half of 2021, that would be an increase of almost 30%, as they are planning make more than 230M iPhones in 2021 (including new &amp; old models). This is great news for the stock as Apple has been pretty much flat after the September pullback, and might finally get some momentum back when they announce sales for the iPhone in the next quarters.</p>\n\n<p>This might also be helped by the fact that US <a href=\"https://ibb.co/f2Tfhpj\">consumers</a> are expecting to spend more next year, even if they expect to have a pretty much flat income and earnings growth. This is an improving view of the consumers as they were expecting to spend less in the last survey from October.</p>\n\n<p>Meanwhile, as I expected <a href=\"https://ibb.co/xSdVJrG\">AirBnB</a> and <a href=\"https://ibb.co/wLfyvFG\">Doordash</a> have started to fade after that crazy IPO frenzy. <a href=\"https://ibb.co/tmyyWnW\">Doordash</a> fell more than 8% yesterday and is down again pre-market while <a href=\"https://ibb.co/GnRxn3b\">AirBnB</a> is also down almost 10% since last week. And with downgrades from analysts already starting to appear, this companies have small to no room for error at this valuation. Especially with Doordash which has received a significant boost in the last year, growth will be more difficult in the future and won’t justify this price point.</p>\n\n<p>We have also seen <a href=\"https://ibb.co/J5j6DsP\">Snowflake</a> come back to earth, dropping more than 15% in the last 5 trading days, as the first share lockup period expiration is today. This will allow current and former employees to sell 25% of their stock options, currently representing 1,3M shares. With Non-employee shareholders also able to sell up to 25% of shares, those shares stand at 38M right now, with the rest of the shares being unlocked after they release their second quarterly earnings report in March, </p>\n\n<p>We also got <a href=\"https://ibb.co/8srNcwj\">numbers</a> from New Jersey, as gambling keeps expanding even if sports are not back to normal. This is great news for companies like DraftKings. While others like Wynn will <a href=\"https://ibb.co/zHL4Gvw\">benefit</a> a lot from more tourism both in the US and in Macau.</p>\n\n<p>And just keep an eye on <a href=\"https://ibb.co/nMHptKW\">Shopify</a>, as the company seems to be in the eye of the tiger, with Amazon looking into ways of entering that market also.</p>\n\n<p>So, guys, I still think there are a lot of positive catalysts for the markets, especially with a stimulus apparently very close, the European Central Bank <a href=\"https://ibb.co/xqWDmZs\">agreed</a> last week on a new stimulus for the Eurozone, as they keep printing money. And with interest rates probably remaining incredibly low after this week FED meeting, money will remain very cheap at the moment. So yeah, with the Pfizer vaccine yesterday, Moderna probably next week, and JNJ to follow in early 2021, I think we are poised for a good 2021 in the stock market. Especially with little political volatility after the Georgia run-off in early January as the US electoral College also formally <a href=\"https://ibb.co/pvjc9nf\">confirmed</a> Biden as the next President of the US yesterday.</p>\n\n<p>Let’s hope for a great day in the market as the <a href=\"https://ibb.co/vjT9ghr\">FUTURES</a> seem to be pointing at a good open, hopefully some green action continues after that.</p>\n\n<p>Thank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!</p>\n\n<p>Have a great day and see you next time!</p>\n</div><!-- SC_ON -->",
  "score": 238,
  "permalink": "/r/stocks/comments/kdltoc/quadruple_witching_stock_day_dash_abnb_crash/",
  "subreddit": "stocks",
  "id": "kdltoc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260495582
}