{
  "author": "adamwithacharge_",
  "original_created_utc": 1652988980,
  "title": "Do people who earn real doctorates get annoyed by celebrities receiving honorary doctorates?",
  "created_utc": 1653005351,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I see Taylor Swift has received an honorary doctorate, and her fans are blasting “Dr. Taylor Swift” everywhere. I mean good for her, but if I were at that commencement also receiving my doctorate that I spent 4-8 years of post-grad working towards, writing and defending a thesis along the way, not to mention the 4 years in already spent in undergrad, only to be fully overshadowed by the school giving a meaningless title to a celebrity, I’d probably be pissed&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 116,
  "permalink": "/r/TooAfraidToAsk/comments/utbauc/do_people_who_earn_real_doctorates_get_annoyed_by/",
  "subreddit": "TooAfraidToAsk",
  "id": "utbauc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I see Taylor Swift has received an honorary doctorate, and her fans are blasting\n“Dr. Taylor Swift” everywhere. I mean good for her, but if I were at that\ncommencement also receiving my doctorate that I spent 4-8 years of post-grad\nworking towards, writing and defending a thesis along the way, not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "テイラー・スウィフトが名誉博士号を授与され、彼女のファンが非難していますね。\n\"テイラー・スウィフト博士 \"と 叫んでいます つまり、彼女にとっては良いことですが、もし私がその卒業式で\n卒業後4～8年かけて取得した博士号が、その場で授与されるとしたら。\nを目指して働き、論文を書き、その過程で弁護をした、その博士号を受け取っていたら...",
      "title": "本物の博士号を取得した人は、有名人が名誉博士号をもらうと困るのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到泰勒-斯威夫特获得了一个荣誉博士学位，而她的粉丝们正在到处宣扬\n\"泰勒-斯威夫特博士\"，到处都是。我的意思是对她来说是好事，但如果我在那个\n但如果我在毕业典礼上也获得我的博士学位，我花了4-8年的时间\n我花了4-8年的时间，写了一篇论文并进行了答辩，而不是...",
      "title": "获得真正博士学位的人对名人获得荣誉博士学位感到恼火吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到泰勒-斯威夫特獲得了一個榮譽博士學位，而她的粉絲們正在到處宣揚\n\"泰勒-斯威夫特博士\"，到處都是。我的意思是對她來說是好事，但如果我在那個\n但如果我在畢業典禮上也獲得我的博士學位，我花了4-8年的時間\n我花了4-8年的時間，寫了一篇論文並進行了答辯，而不是...",
      "title": "獲得真正博士學位的人對名人獲得榮譽博士學位感到惱火嗎？"
    }
  ]
}