{
  "author": "Caddywhompp",
  "the_new_excerpt": "[WARNING] If you've purchased a hardware wallet from a third-party seller, i.e\nAmazon or Ebay, and it included a recovery seed card with silver foil that you\nscratch off, MOVE YOUR FUNDS NOW. The device itself generates that seed when you\ninitialize it. If it already exists, then someone has a copy…",
  "original_created_utc": 1620008442,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "警告】AmazonやEbayなどの第三者からハードウェアウォレットを購入し、その中に銀箔付きのリカバリーシードカードが含まれていた場合、そのカードを使用することはできません。\nAmazonやEbayなどの第三者からハードウェアウォレットを購入し、その中に銀箔のリカバリーシードカードが含まれていて、それをスクラッチすると\n今すぐ資金を移動させてください。初期化時にデバイス自体がシードを生成します。\n初期化したときにデバイス自身がシードを生成します。もしそれが既に存在しているのであれば、誰かがコピーを持っていることになります...。",
      "title": "ハードウェアウォレット詐欺にご注意ください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "[警告] 如果你从第三方卖家购买了一个硬件钱包，例如\n亚马逊或Ebay的硬件钱包，它包括一张带有银箔的恢复种子卡，你可以刮掉它。\n刮掉，请立即转移你的资金。当你初始化设备时，设备本身会生成该种子\n初始化它。如果它已经存在，那么有人就有一个副本......",
      "title": "谨防：硬件钱包骗局!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "[警告] 如果你從第三方賣家購買了一個硬件錢包，例如\n亞馬遜或Ebay的硬件錢包，它包括一張帶有銀箔的恢復種子卡，你可以刮掉它。\n刮掉，請立即轉移你的資金。當你初始化設備時，設備本身會生成該種子\n初始化它。如果它已經存在，那麼有人就有一個副本......",
      "title": "謹防：硬件錢包騙局!"
    }
  ],
  "title": "Beware: Hardware Wallet Scam!",
  "created_utc": 1620019960,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>[WARNING] If you&#39;ve purchased a hardware wallet from a third-party seller, i.e Amazon or Ebay, and it included a recovery seed card with silver foil that you scratch off, MOVE YOUR FUNDS NOW. The device itself generates that seed when you initialize it. If it already exists, then someone has a copy of it.</p>\n\n<p>This is a 3-4 year old scam that is just coming back around BIG TIME with the influx in new crypto investors. Stay safe out there!</p>\n</div><!-- SC_ON -->",
  "score": 1618,
  "permalink": "/r/CryptoCurrency/comments/n3lqg8/beware_hardware_wallet_scam/",
  "subreddit": "CryptoCurrency",
  "id": "n3lqg8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380962704
}