{
  "author": "calvintheidiot",
  "the_new_excerpt": "You can't really have it both ways. If you're tempted to take profits when you\nmake some nice gains, say 2x, 5x, or even 10x ... there's no need to look on the\npast with regret, and wish you got in the early days of cheap Bitcoin, doing the\nmath on how much you would have today.\n\nThere's almost no…",
  "original_created_utc": 1613463111,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你真的不能两全其美。如果你受到诱惑，在你获利的时候，你的\n赚取一些不错的收益，比如说2倍，5倍，甚至10倍......没有必要在上看。\n过去的遗憾，希望自己在早期廉价比特币的时候，得到的是\n计算你今天会有多少钱。\n\n几乎没有...",
      "title": "人。\"我希望我在10美分的好日子里买了BTC 并一直持有到现在\" ... 还有人：\"记住要获利！\"记住要获利！\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你真的不能兩全其美。如果你受到誘惑，在你獲利的時候，你的\n賺取一些不錯的收益，比如說2倍，5倍，甚至10倍......沒有必要在上看。\n過去的遺憾，希望自己在早期廉價比特幣的時候，得到的是\n計算你今天會有多少錢。\n\n幾乎沒有...",
      "title": "人。\"我希望我在10美分的好日子裏買了BTC 並一直持有到現在\" ... 還有人：\"記住要獲利！\"記住要獲利！\""
    }
  ],
  "title": "People: \"I Wish I had Bought BTC In the Good Old Days of 10 Cents And Held Until Now\" ... Also People: \"Remember To Take Profits!\"",
  "created_utc": 1613478866,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You can&#39;t really have it both ways. If you&#39;re tempted to take profits when you make some nice gains, say 2x, 5x, or even 10x ...  there&#39;s no need to look on the past with regret, and wish you got in the early days of cheap Bitcoin, doing the math on how much you would have today. </p>\n\n<p>There&#39;s almost no way you would have that same stack today ... holding past 10x, 100x, 1000x, 10000x .... and beyond. And that&#39;s okay. We all have our moons, and taking profits is great. What&#39;s the point of being in crypto if not to take profits eventually? But when you do, don&#39;t live with regrets. </p>\n\n<p>And if you can, try to hold past the 2x, 5x, 10x ... one day it&#39;s likely people will wish for the good old days of 50k Bitcoin. </p>\n\n<p>Just imagine the posts in 2030: </p>\n\n<p>&quot;Man buys Tesla for 1 Bitcoin in 2021 - that Bitcoin is now worth 50 Teslas&quot; </p>\n\n<p>50k seems like a lot right now, but it may be the new &quot;Bitcoin for 10 cents&quot; in the future. </p>\n\n<p>TLDR - Take profits if you want/need - hold if you can. And most importantly, don&#39;t look back with regrets.</p>\n</div><!-- SC_ON -->",
  "score": 1288,
  "permalink": "/r/CryptoCurrency/comments/lkzb8m/people_i_wish_i_had_bought_btc_in_the_good_old/",
  "subreddit": "CryptoCurrency",
  "id": "lkzb8m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728619132
}