{
  "author": "longsh0t1994",
  "the_new_excerpt": "Seven months ago I posted that I had entered into the arena with a whopping $100\ninvestment into 10 stocks ($10 per stock) and how I was drunk with power after\nthis first day. Y'all seemed to enjoy it so I figured an update almost\nend-of-year post would be in order.\n\nOriginal…",
  "original_created_utc": 1608976699,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "七个月前，我发帖子说，我带着高达100美元的身家进入竞技场。\n对10股票(每股10美元)的投资，以及之后我是如何沉迷于权力的\n这是第一天。你们看起来都很喜欢，所以我想最新消息差不多\n年终职位将是合适的。\n\n原始…",
      "title": "第一个交易日后，那个喝醉了权力的家伙发了后续帖子"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "七個月前，我發帖子說，我帶着高達100美元的身家進入競技場。\n對10股票(每股10美元)的投資，以及之後我是如何沉迷於權力的\n這是第一天。你們看起來都很喜歡，所以我想最新消息差不多\n年終職位將是合適的。\n\n原始…",
      "title": "第一個交易日後，那個喝醉了權力的傢伙發了後續帖子"
    }
  ],
  "title": "Follow up post from the guy who was drunk with power after his first trading day",
  "created_utc": 1609001776,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Seven months ago I posted that I had entered into the arena with a whopping $100 investment into 10 stocks ($10 per stock) and how I was drunk with power after this first day. Y&#39;all seemed to enjoy it so I figured an update almost end-of-year post would be in order. </p>\n\n<p>Original post: <a href=\"https://old.reddit.com/r/stocks/comments/gkj3ei/i_had_my_first_ever_day_trading_put_10_in_10/\">https://old.reddit.com/r/stocks/comments/gkj3ei/i_had_my_first_ever_day_trading_put_10_in_10/</a></p>\n\n<p>This was my portfolio on that day (plus the gains that day):</p>\n\n<ul>\n<li>Aurora Cannabis (+68.67%)</li>\n<li>Cronos Group (+11.94%)</li>\n<li>Peloton (+7.33%)</li>\n<li>Zoom (+4.12%)</li>\n<li>Lululemon (+4%)</li>\n<li>Microsoft (+1.45%)</li>\n<li>Amazon (+0.87%)</li>\n<li>QQQ (+0.64%)</li>\n<li>SPDR S&amp;P 500 (+0.45%)</li>\n<li>Apple (-0.59) </li>\n</ul>\n\n<p>Since then I upped my investment to almost $2k with a total gain of $814.51 so far.</p>\n\n<p>My approach was to sell off some of the volatile cannabis and pandemic stocks, stay away from super involved day-by-day trading, and focus on companies I believe will be good in 5-10 years from now.</p>\n\n<p>My current portfolio (plus total investment and gains so far):</p>\n\n<ul>\n<li>Tesla ($275 / $462.99)</li>\n<li>Apple ($415 / $130.11)</li>\n<li>QQQ ($687 / $129.22)</li>\n<li>Square ($116 / $44.49)</li>\n<li>Alphabet ($175 / $24.20)</li>\n<li>Microsoft ($200 / $20.62)</li>\n<li>Shopify ($50 / $2.88)</li>\n</ul>\n\n<p>Some notes and mistakes I made:</p>\n\n<ul>\n<li><p>Mistake: I bought Shopify much earlier before their big pop because I believe in their business model and leadership, then panic sold when it dropped a bit and since then it went WAY up and I missed out on that.</p></li>\n<li><p>Mistake: Same thing happened with Spotify but I haven&#39;t bought back in out of spite.</p></li>\n<li><p>Mistake: Not putting in more money in general because 2020 has been a terrible year for me financially due to canceled jobs thanks to Covid. It&#39;s taking every fiber of strength to not pull out this money too.</p></li>\n<li><p>Good thing: staying away from following all the news and pretending I am a genius predictor about which real life news will make a price go up or down.</p></li>\n<li><p>Good thing: I still very much enjoy it and would love to continue going this way. I realize for many my strategy is probably a boring conservative one but I am most comfortable with this and I feel it still did quite well for me, mostly thanks to Tesla of course (and who knows where that price will go) but the rest of them went up too still.</p></li>\n</ul>\n\n<p>edit: formatting/typo</p>\n</div><!-- SC_ON -->",
  "score": 140,
  "permalink": "/r/stocks/comments/kkg7fi/follow_up_post_from_the_guy_who_was_drunk_with/",
  "subreddit": "stocks",
  "id": "kkg7fi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495334785
}