{
  "author": "Kontikulus",
  "the_new_excerpt": "There is a good chance a young person without any prior investing experience and\nnot much life experience is panicking right now. Close your eyes, take a deep\nbreath and count to ten slowly.Maybe you sold already and wondering if you\nshould buy again, maybe you are thinking only about your crypto…",
  "original_created_utc": 1621291939,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "投資経験のない、人生経験の浅い若い人が今パニックになっている可能性が高いです。\n投資経験もなく、人生経験も浅い若い人が今、パニックに陥っている可能性があります。目を閉じて、深呼吸をして、ゆっくりと10まで数えてみてください。\nもう売ってしまって、もう一度買うべきかどうか悩んでいるかもしれません。\nもしかしたら、すでに売ってしまって、もう一度買うべきかどうか悩んでいるかもしれませんし、暗号のことばかり考えているかもしれません。",
      "title": "赤字で売っているすべての人へ。自分の感情に対処することを学ばなければ、何に投資してもうまくいかないでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很有可能一个没有任何投资经验和没有多少生活经验的年轻人现在正在恐慌。\n没有太多的生活经验，现在就很恐慌。闭上你的眼睛，深吸一口气，慢慢地数到十。\n也许你已经卖掉了，并想知道你是否应该买入。\n也许你已经卖出，并在想是否应该再次买入，也许你只想着你的加密货币...。",
      "title": "对于所有在亏损中卖出的人。如果你不学会处理你的情绪，你在任何事情上的投资都会有一个糟糕的时间。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很有可能一個沒有任何投資經驗和沒有多少生活經驗的年輕人現在正在恐慌。\n沒有太多的生活經驗，現在就很恐慌。閉上你的眼睛，深吸一口氣，慢慢地數到十。\n也許你已經賣掉了，並想知道你是否應該買入。\n也許你已經賣出，並在想是否應該再次買入，也許你只想着你的加密貨幣...。",
      "title": "對於所有在虧損中賣出的人。如果你不學會處理你的情緒，你在任何事情上的投資都會有一個糟糕的時間。"
    }
  ],
  "title": "For all people selling in the red: If you don't learn to deal with your emotions, you will have a bad time investing in anything.",
  "created_utc": 1621309583,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There is a good chance a young person without any prior investing experience and not much life experience is panicking right now. Close your eyes, take a deep breath and count to ten slowly.Maybe you sold already and wondering if you should buy again, maybe you are thinking only about your crypto for the last days. No amount of sick gains is more important than your mental and physical wellbeing.</p>\n\n<p>Ask yourself one simple question: Will my life change for the worse if all crypto goes to zero? If the answer is &quot;yes&quot;, than you are overinvested. Take money out until the answer is &quot;no&quot;. What remains in your portfolio is not money, it is the future. It can bring great things, it can suck sometimes, but we don&#39;t live there. We live in the now and you can be relaxed now by knowing that you put something into your future.</p>\n</div><!-- SC_ON -->",
  "score": 705,
  "permalink": "/r/CryptoCurrency/comments/neudc6/for_all_people_selling_in_the_red_if_you_dont/",
  "subreddit": "CryptoCurrency",
  "id": "neudc6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590799677
}