{
  "author": "ethanwc",
  "original_created_utc": 1639361488,
  "title": "I hope Tickmaster gets devoured by Blockchain tech",
  "created_utc": 1639366324,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was reminded today that Ticketmaster desperately needs to go the way of Blockbuster. I bought a seat ticket for a Tool concert next year, $74. With fees it came to $97. Ridiculous considering I don’t even receive a physical ticket anymore. &lt;/p&gt;\n\n&lt;p&gt;Blockchain, once mainstream and widespread, will break the stranglehold middlemen hold over venues. Imagine direct selling NFTs to fans and locking in price so scalping is practically non-existent. And the artist would get a kickback of secondary sales. Maybe lock in transferring the ticket more than once. &lt;/p&gt;\n\n&lt;p&gt;There’s so many possibilities I’m sure these issues will get solved someday soon. This is why crypto is so exciting. The possibilities are endless.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 310,
  "permalink": "/r/CryptoCurrency/comments/rf4hbn/i_hope_tickmaster_gets_devoured_by_blockchain_tech/",
  "subreddit": "CryptoCurrency",
  "id": "rf4hbn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was reminded today that Ticketmaster desperately needs to go the way of\nBlockbuster. I bought a seat ticket for a Tool concert next year, $74. With fees\nit came to $97. Ridiculous considering I don’t even receive a physical ticket\nanymore.\n\nBlockchain, once mainstream and widespread, will break…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、私は、Ticketmasterは、どうしてもこのままではいけないと思い知らされました。\nブロックバスター 来年のToolのコンサートの座席券を74ドルで購入した。\n97ドルになった。チケットの現物を受け取らないことを考えると、ばかげた話だ。\nを使うようになりました。\n\nブロックチェーンは、一度主流になり普及すれば、壊れる...",
      "title": "TickmasterがBlockchain技術に食われてしまえばいいのに。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天有人提醒我，Ticketmaster公司迫切需要走Blockbuster公司的路。\nBlockbuster的方式。我买了一张明年Tool音乐会的座位票，74美元。\n变成了97美元。考虑到我甚至没有收到实体票，这很荒谬。\n了。\n\n区块链，一旦成为主流和普及，将打破...",
      "title": "我希望Tickmaster被区块链技术所吞噬"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天有人提醒我，Ticketmaster公司迫切需要走Blockbuster公司的路。\nBlockbuster的方式。我買了一張明年Tool音樂會的座位票，74美元。\n變成了97美元。考慮到我甚至沒有收到實體票，這很荒謬。\n了。\n\n區塊鏈，一旦成爲主流和普及，將打破...",
      "title": "我希望Tickmaster被區塊鏈技術所吞噬"
    }
  ]
}