{
  "author": "zincabuser",
  "original_created_utc": 1624278889,
  "title": "Are there people who are just destined to be unlikable?",
  "created_utc": 1624306312,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A friend of mine seems like he is detached most of the time. He does not enjoy conversations usually. Does not have many friends, and no close friends. Can&#39;t talk about things most of the time. Is described as weird at times. Used to be very funny, but now he is a shut in.</p>\n\n<p>He is a good person, just doesn&#39;t get along with people. Is he just destined to never be liked by people? What could the reason for this be? We&#39;ve been having short whatsapp conversations (I check in on him every now and again) but we can&#39;t seem to really speak about anything beyond surface level stuff.</p>\n</div><!-- SC_ON -->",
  "score": 131,
  "permalink": "/r/TooAfraidToAsk/comments/o4u2y4/are_there_people_who_are_just_destined_to_be/",
  "subreddit": "TooAfraidToAsk",
  "id": "o4u2y4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A friend of mine seems like he is detached most of the time. He does not enjoy\nconversations usually. Does not have many friends, and no close friends. Can't\ntalk about things most of the time. Is described as weird at times. Used to be\nvery funny, but now he is a shut in.\n\nHe is a good person, just…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の友人は、ほとんどの時間を離脱しているように見えます。会話を楽しむことができません。\n会話を楽しむことはありません。友達が少なく、親しい友人もいない。ほとんどの場合、物事について話すことができない。\nほとんどの場合、物事について話すことができない。変わった人だと言われることもある。以前は\n以前はとても面白かったのですが、今は引きこもっています。\n\n彼は良い人ですが、ただ...。",
      "title": "嫌われる運命にある人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的一个朋友看起来大部分时间都很超脱。他不喜欢\n谈话。没有很多朋友，也没有亲密的朋友。不能\n大部分时间不能谈论事情。有时被形容为怪异。曾经是\n非常有趣，但现在他是一个封闭的人。\n\n他是一个好人，只是...",
      "title": "是否有一些人注定是不受欢迎的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的一個朋友看起來大部分時間都很超脫。他不喜歡\n談話。沒有很多朋友，也沒有親密的朋友。不能\n大部分時間不能談論事情。有時被形容爲怪異。曾經是\n非常有趣，但現在他是一個封閉的人。\n\n他是一個好人，只是...",
      "title": "是否有一些人註定是不受歡迎的？"
    }
  ]
}