{
  "author": "daquanjongun",
  "original_created_utc": 1632940406,
  "title": "Is it common to not be able to cum during your first time (or any time) as a guy?",
  "created_utc": 1632946874,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So when losing my virginity my top concern was that I’d only last like 5 minutes and was really worried about that. We made out for like 15 minutes, then fucked for around 40 minutes before we concluded I wouldn’t finish and it was already past 3 am. She was hot af and didn’t at all feel like I was settling, and her titties were in my face the whole time which was also hot. The sex felt great and I felt close at times but it never happened for me while she was able to get quite wet. She suggested it may be because it was too cold outside as we did this in the forest of a college campus due to lack of options. Still I’m just wondering what was up with that, I’m just at least happy it was good for her and I of course loved it.</p>\n</div><!-- SC_ON -->",
  "score": 126,
  "permalink": "/r/TooAfraidToAsk/comments/py1m59/is_it_common_to_not_be_able_to_cum_during_your/",
  "subreddit": "TooAfraidToAsk",
  "id": "py1m59",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So when losing my virginity my top concern was that I’d only last like 5 minutes\nand was really worried about that. We made out for like 15 minutes, then fucked\nfor around 40 minutes before we concluded I wouldn’t finish and it was already\npast 3 am. She was hot af and didn’t at all feel like I was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "童貞を捨てるときに一番心配したのは、5分しかもたないのではないかということでした。\nそれを心配していたんだ。私たちは15分ほどイチャイチャして、その後40分ほどセックスしました。\n終わっていないという結論に達するまで、40分ほどやりましたが、すでに午前3時を過ぎていました。\n午前3時を過ぎていました。彼女はとてもセクシーで、私が...という感じは全くありませんでした。",
      "title": "男としての初めての経験（あるいはいつでも）で、イクことができないのはよくあることなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以当我失去童贞时，我最担心的是我只能坚持5分钟左右\n我真的很担心这个问题。我们亲热了大约15分钟，然后做爱\n大约40分钟后，我们得出结论，我无法完成，而且已经过了\n凌晨3点多了。她很性感，而且完全没有感觉到我是......",
      "title": "在你第一次（或任何一次）做男人时不能射精，这很常见吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以當我失去童貞時，我最擔心的是我只能堅持5分鐘左右\n我真的很擔心這個問題。我們親熱了大約15分鐘，然後做愛\n大約40分鐘後，我們得出結論，我無法完成，而且已經過了\n凌晨3點多了。她很性感，而且完全沒有感覺到我是......",
      "title": "在你第一次（或任何一次）做男人時不能射精，這很常見嗎？"
    }
  ]
}