{
  "author": "JigsawPuzzleUnit",
  "original_created_utc": 1625121265,
  "title": "Did armies really played music during battle?",
  "created_utc": 1625161829,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Every time I hear about this I just get amazed by how ridiculous it sounds. And if it was a thing of like the middle Ages I can get behind that (it&#39;s still stupid tho).</p>\n\n<p>But I&#39;ve heard and seen pictures of people playing and Instrument in the front row even during 19th century. I think I&#39;ve even heard that during WW1 armies still had musical instruments with them, playing Bagpipies and drums while marching.</p>\n\n<p>Not only it would bring attention of anyone nearby (and that cannot be a good idea during war). But also It seems like a waste of space and ressources to have instruments considering all the weapons and gear they had to carry.</p>\n\n<p>So how accurate is the idea that soldiers, even at beggining of 20th century, wenth chanting and playing instruments in their way to whatever their going, and that right before battle they would &quot;declare it&quot; with some sort of music.</p>\n\n<p>How much of that is true and, why would they do it?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/obfx5v/did_armies_really_played_music_during_battle/",
  "subreddit": "AskHistorians",
  "id": "obfx5v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Every time I hear about this I just get amazed by how ridiculous it sounds. And\nif it was a thing of like the middle Ages I can get behind that (it's still\nstupid tho).\n\nBut I've heard and seen pictures of people playing and Instrument in the front\nrow even during 19th century. I think I've even…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この話を聞くたびに、あまりにもバカバカしい話だと驚いてしまいます。そして\n中世のようなものであれば、それはそれで納得できるのですが、やはり\nしかし)\n\nしかし、19世紀にも最前列で演奏している人や楽器を持っている人の写真を見聞きしたことがあります。\n19世紀にも最前列で楽器を演奏している人の写真を見たことがあります。思うに、私は...",
      "title": "軍隊は戦闘中に音楽を演奏していたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每次听到这个消息，我都会惊讶于它听起来是多么的荒谬。而且\n如果它是中世纪的东西，我可以接受（它仍然是\n愚蠢）。)\n\n但是我听说和看到过人们在前排演奏和演奏乐器的照片。\n甚至在19世纪也是如此。我想我甚至...",
      "title": "军队真的在战斗中播放音乐吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每次聽到這個消息，我都會驚訝於它聽起來是多麼的荒謬。而且\n如果它是中世紀的東西，我可以接受（它仍然是\n愚蠢）。)\n\n但是我聽說和看到過人們在前排演奏和演奏樂器的照片。\n甚至在19世紀也是如此。我想我甚至...",
      "title": "軍隊真的在戰鬥中播放音樂嗎？"
    }
  ]
}