{
  "author": "MarioTheMojoMan",
  "original_created_utc": 1639700334,
  "title": "In Stan Rogers' song \"Barrett's Privateers,\" a royal letter of marque is issued to the captain of a sloop barely fit to cross a pond, never mind sea serious naval action. How lax were standards for getting a license to privateer in the American Revolutionary War?",
  "created_utc": 1639760143,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A &amp;quot;sickening sight&amp;quot; with a &amp;quot;list to the port&amp;quot; and &amp;quot;sails in rags&amp;quot; that requires constant pumping to stay afloat, to be precise -- with predictable results, namely getting sunk in one shot by an American merchant vessel. Were letters of marque really granted to vessels with such a low chance of success? Could any fisherman -- royalist or separatist -- really get their hands on one?&lt;/p&gt;\n\n&lt;p&gt;EDIT: Gah, &amp;quot;&lt;em&gt;see&lt;/em&gt; serious naval action.&amp;quot; At least it&amp;#39;s an innocuous Freudian slip.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/ri47pw/in_stan_rogers_song_barretts_privateers_a_royal/",
  "subreddit": "AskHistorians",
  "id": "ri47pw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A \"sickening sight\" with a \"list to the port\" and \"sails in rags\" that requires\nconstant pumping to stay afloat, to be precise -- with predictable results,\nnamely getting sunk in one shot by an American merchant vessel. Were letters of\nmarque really granted to vessels with such a low chance of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "舷側のリスト」と「ぼろぼろの帆」を必要とする「気持ち悪い光景」。\n正確には、浮き上がるために常にポンプを使うのだが、その結果は予想通りだ。\nアメリカの商船に一発で撃沈されてしまうのだ。果たして\nそのような可能性の低い船に、本当に私たちの船は与えられたのだろうか？",
      "title": "スタン・ロジャースの歌「バレットの私掠船」では、池を渡れるかどうかのスループの船長に勅書が発行され、まともな海戦には到底適さない。アメリカ独立戦争で私掠船の免許を取得する基準はどの程度緩かったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一个 \"令人作呕的景象\"，\"船身向左倾斜\"，\"船帆褴褛\"，需要不断地抽水来保持浮力。\n准确地说，需要不断抽水才能保持漂浮 -- 结果可想而知。\n即被一艘美国商船一枪击沉。是否真的向拥有这样的船只颁发了\n的机会如此之低的船只，是否真的授予了 \"侯爵令\"？",
      "title": "在斯坦-罗杰斯的歌曲 \"巴雷特的私掠者 \"中，一份皇家赎罪书被发给了一艘几乎不适合穿过池塘的单桅帆船的船长，更不用说海上的严重海战了。在美国革命战争中，获得私掠者许可证的标准有多宽松？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一個 \"令人作嘔的景象\"，\"船身向左傾斜\"，\"船帆襤褸\"，需要不斷地抽水來保持浮力。\n準確地說，需要不斷抽水才能保持漂浮 -- 結果可想而知。\n即被一艘美國商船一槍擊沉。是否真的向擁有這樣的船隻頒發了\n的機會如此之低的船隻，是否真的授予了 \"侯爵令\"？",
      "title": "在斯坦-羅傑斯的歌曲 \"巴雷特的私掠者 \"中，一份皇家贖罪書被髮給了一艘幾乎不適合穿過池塘的單桅帆船的船長，更不用說海上的嚴重海戰了。在美國革命戰爭中，獲得私掠者許可證的標準有多寬鬆？"
    }
  ]
}