{
  "author": "Rocketsponge",
  "original_created_utc": 1625549514,
  "title": "How likely was it that Julius Caesar was not the father of his son with Cleopatra, Caesarion?",
  "created_utc": 1625603835,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In Robert Garland&#39;s course &quot;Greece &amp; Rome: An Integrated History of the Ancient Mediterranean&quot;, he mentions that there were doubts Caesarion was really his son with Cleopatra as he was quote, &quot;likely already infertile at this point.&quot; Why would historians assume Caesar was potentially infertile? He would have been in his late 40&#39;s or early 50&#39;s during the time he spent with Cleopatra, certainly not outside the range of being able to father a child. Were there other sources that point to Caesar not able to father children later in life?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/oeolbg/how_likely_was_it_that_julius_caesar_was_not_the/",
  "subreddit": "AskHistorians",
  "id": "oeolbg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In Robert Garland's course \"Greece & Rome: An Integrated History of the Ancient\nMediterranean\", he mentions that there were doubts Caesarion was really his son\nwith Cleopatra as he was quote, \"likely already infertile at this point.\" Why\nwould historians assume Caesar was potentially infertile? He…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ロバート・ガーランドの講座「ギリシャ・ローマ」では 古代地中海の統合された歴史\n彼は、シーザーリオンがクレオパトラとの間の息子であることを疑っていたと述べています。\nクレオパトラとの間にできた息子ではないかと疑われていたと述べています（引用文：\"この時点ですでに不妊であった可能性が高い\"）。なぜ\n歴史家はシーザーが潜在的に不妊であったと考えるのか？彼は...",
      "title": "ユリウス・カエサルがクレオパトラとの間の息子シーザリオンの父親ではない可能性はどのくらいあったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在罗伯特-加兰的课程 \"希腊和罗马。古代地中海的综合历史\n中，他提到有人怀疑凯撒里奥是否真的是他与克里奥帕特拉的儿子\n因为他被引用为 \"此时可能已经不能生育\"。为什么\n为什么历史学家会认为凯撒有可能不能生育？他...",
      "title": "朱利叶斯-凯撒不是他与克里奥帕特拉的儿子凯撒里奥的父亲，这种可能性有多大？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在羅伯特-加蘭的課程 \"希臘和羅馬。古代地中海的綜合歷史\n中，他提到有人懷疑凱撒里奧是否真的是他與克里奧帕特拉的兒子\n因爲他被引用爲 \"此時可能已經不能生育\"。爲什麼\n爲什麼歷史學家會認爲凱撒有可能不能生育？他...",
      "title": "朱利葉斯-凱撒不是他與克里奧帕特拉的兒子凱撒里奧的父親，這種可能性有多大？"
    }
  ]
}