{
  "author": "AppleBagel913",
  "the_new_excerpt": "So, this is kind of a specific scenario, but I think it's one that a lot of\nRedditor's find ourselves in, so I figured i'd share my thoughts on how to\nprotect a portion of any gains if you expect to make a ton in the near future.\nLook at any millionaire/billionaire/trillionaire in the news and you…",
  "original_created_utc": 1618119292,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは特殊なシナリオですが、多くのRedditorが直面する問題だと思います。\nそこで、もしも利益が出ると予想される場合に、その利益の一部を保護する方法について、私の考えを述べたいと思います。\n近い将来、大きな利益を得ることが予想される場合、利益の一部を保護する方法について、私の考えをお伝えしようと思います。\n話題の大富豪や億万長者、兆万長者を見て、あなたは...",
      "title": "近い将来、億万長者になることを期待しているのであれば、今のうちに利用して、数百万ドル（またはバナナ）の税金から身を守りましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，这是一种特殊的情况，但我认为这是一个很多的\nRedditor's find ourselves in, so I figured I'd share my thoughts on how to\n保护任何收益的一部分，如果你期望在不久的将来，使吨。\n看看新闻中的任何百万富翁/亿万富翁/万亿富翁，你......",
      "title": "如果你期望很快成为百万富翁，现在就利用这个机会，让自己免于数百万美元（或香蕉）的税收。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，這是一種特殊的情況，但我認爲這是一個很多的\nRedditor's find ourselves in, so I figured I'd share my thoughts on how to\n保護任何收益的一部分，如果你期望在不久的將來，使噸。\n看看新聞中的任何百萬富翁/億萬富翁/萬億富翁，你......",
      "title": "如果你期望很快成爲百萬富翁，現在就利用這個機會，讓自己免於數百萬美元（或香蕉）的稅收。"
    }
  ],
  "title": "If you expect to become a multi-millionaire soon, take advantage NOW and save yourself from millions of dollars(or bananas) in taxes",
  "created_utc": 1618179594,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, this is kind of a specific scenario, but I think it&#39;s one that a lot of Redditor&#39;s find ourselves in, so I figured i&#39;d share my thoughts on how to protect a portion of any gains if you expect to make a ton in the near future. Look at any millionaire/billionaire/trillionaire in the news and you can be sure they&#39;re protecting their companies and investments from any unnecessary tax liabilities, and the same should apply for apes who are investing. If you&#39;re going to be a millionaire soon, you need to start thinking like a millionaire and planning so that you can reduce the amount that you&#39;ll owe. NOW in particular because there&#39;s a deadline for this, especially if you fit the following scenario.</p>\n\n<p>---<em>This particular tax-scenario might be a once-in-a-lifetime opportunity, so pay attention and do your own research. This isn&#39;t tax or financial advice, so please reach out to someone who can help you navigate all the rules, but you still have time to look into it if you want to save some bananas. ---</em></p>\n\n<p>Most of us retail traders are people who are scraping by, or maybe living comfortably but definitely not buying yachts on the weekend, or running hedge funds attempting to short companies into bankruptcy. That means you probably have a job where you report to most days, and take home a paycheck that gets taxed before it hits your bank account. If your income is below a certain threshold, and you have some extra money sitting around, you&#39;re allowed to put those already-taxed dollars into a retirement account and allow it to grow tax-free on a number of securities or assets(including stocks and even property), and the IRS doesn&#39;t mind since they don&#39;t expect you to take a couple of dollars and have that investment multiply exponentially. Notably, these retirement accounts allow you to invest into any stock, which <em>includes</em> stock in your favorite company. Any capital gains (let&#39;s say gains in a normal Robinhood account) are ordinarily taxed as a short-term or long-term capital gain depending how long you held those shares in your account(up to 37% depending on your gains and tax bracket), but if you were to buy/sell an IRA, you get to keep ALL of those gains in your IRA tax-free, regardless of short-vs-long-term holding or percentage gain. The caveat is that you&#39;re only allowed to make contributions up to a certain dollar amount (and you&#39;re only allowed to contribute to a Roth IRA up to a specific income level in a tax year).</p>\n\n<p>The income limits for contributions into a Roth IRA in the 2020 tax-season are <strong>$124,000 for a single-filer</strong>(which let&#39;s be honest most of us are single anyways), and you&#39;re allowed to contribute <strong>up to $6,000</strong> in either a Traditional or a Roth IRA. But wait, we&#39;re already in 2021, and we left 2020(along with all the shutdowns, quarantines and the Tiger King) in the past, right? Well, the IRS allows you to make contributions to an IRA <em>up until</em> the tax filing deadline. For this year, they went ahead and gave us a blessing in disguise and extended the filing deadline to <strong>May 17th 2021</strong>, so you have an extra month to plan your taxes, and there&#39;s still time to take advantage of this tax-blessing. If you plan on becoming a millionaire from selling any stocks this year, you WOULD NOT be able to make contributions for the 2021 tax season in the Roth IRA example since your income would put you in a much higher tax bracket than the one for 2020, so this specific scenario is a limited-time offer, not redeemable in the future. Theoretically, you could take a couple dollars that you have lying around, fund an IRA account and let that money grow tax-free until you&#39;re old and wrinkly, then buy a tax-free Space-Tesla at retirement age with your gains.</p>\n\n<p>Let&#39;s take a look at an example for a best case scenario in an ape-market and and an ape stock-exchange:</p>\n\n<ul>\n<li>Let&#39;s say your favorite ape stock last closed at ~158 bananas a share. You could take $6,000 that you had sitting around in an account and drop that into an IRA</li>\n<li>Let&#39;s assume bananas are $1 each on the open market. You could theoretically take those $6,000 and purchase 6,000 bananas in your IRA as an investment asset</li>\n<li>You could then setup a limit order in your IRA to execute if the price of that ape-stock were to drop a bit on Monday morning, let&#39;s say to 157.89 bananas for sh!ts and giggles(.89 bananas are those little stringy things that all apes peel off before eating them)</li>\n<li>If that order executes, you&#39;d get a nice round number of 12 ape-shares to hold in your IRA</li>\n<li>You could then go file your taxes for 2020, and claim this contribution to lock in your future gains tax-free.</li>\n<li>Hypothetically, the aforementioned ape stock could shoot up in value into stratospheric levels never before seen in the history of the ape-market. If you were to sell them all at ohhh idk, let&#39;s say 1,000,000 bananas each, this IRA would save you about $4.4 million in taxes after exchanging those bananas back into U.S. Dollars because the IRS doesn&#39;t accept bananas as payment, just FYI</li>\n<li>If you somehow managed to sell each ape-share for 10,000,000 bananas, you&#39;d be saving yourself about $44.3 million in taxes\n\n<ul>\n<li>On the math: If you were to sell your assets for a net gain, you&#39;d reduce that amount by your initial investment(cost basis), and the rest would be considered a capital gain. For a short-term capital gain in a typical cash or margin account in 2021, you&#39;d owe a cumulative tax amount(35%) on the first $523,600, and anything above that is taxed at 37% for the examples above(single-filer)</li>\n<li>On a $12,000,000 order execution from above, that tax works out to $4,406,802.25</li>\n<li>On a $120,000,000 order execution from above, that tax works out to $44,366,802.25</li>\n<li><a href=\"https://www.policygenius.com/taxes/tax-brackets/\">Tax Brackets</a></li>\n</ul></li>\n</ul>\n\n<p>It&#39;s important to note that you can only fund the account with cash, so you can&#39;t transfer any shares that you already own into the account. This has to do with the fact that you&#39;d have unrealized losses and gains in those shares, which would create a tax-nightmare for the IRS&#39;s purposes, so you&#39;ll need to transfer cash(or a check equivalent) into your account before being able to use the IRA, but hopefully you all have some money set aside for buying any dips in the market (if there were to hypothetically be a synthetic fire-sale in the future created by hedge funds). You&#39;ll need to do some research on which type of IRA is best for you, and all the rules regarding funding the account, but it seems like a Roth IRA has more favorable conditions, although a Traditional IRA allows you to deduct those $6,000 from your taxes so start reading and see what works for you. You won&#39;t be able to touch that money until you&#39;re 59-1/2(or after a 5-year holding period if you&#39;re a wise-old-ape who is nearing retirement age, which also allows a max contribution of $7,000), but that shouldn&#39;t be a problem if you make millions in gains in the near future, just don&#39;t keep your entire portfolio in it or you&#39;d be creating a taxable event if you wanted to withdraw any money early. There are qualified exemptions like withdrawing for certain educational expenses, purchasing your first home, certain medical expenses, and other unforseen expenses, but you&#39;ll need to do some research if you think you may want to use any of those exemptions.</p>\n\n<p>If you have Fidelity, it couldn&#39;t be easier to setup the account. I setup my main brokerage account a couple days ago and when the lightbulb went off in my ape-brain, I went to my account, submitted an application(which was pre-filled with all my account info), and I had the account setup in like 5 minutes, ready to be funded (other brokerages may take longer to open an account, that was just my experience with Fidelity). Thankfully i&#39;m a procrastinator and haven&#39;t filed my taxes yet, but if you&#39;ve already filed your taxes for 2020, you should still be able to take advantage of this with an amended tax return, just make sure you talk to a tax-professional who can guide you through it or submit paperwork on your behalf.</p>\n\n<p>Hopefully we all see life-changing amounts of money hitting our bank accounts this year, and if this scenario sounds like you, please do some research and consider opening a tax-sheltered IRA. Your future self will thank you, and you can still hold onto your stock in your main brokerage accounts, just make sure you&#39;re aware of any tax implications coming down the line. I have another post for dealing with any gains in your main spending account coming soon, so stay tuned for that and good luck!</p>\n\n<p><em>--- Just to re-iterate: This is neither tax-, legal-, nor financial-advice. The above-mentioned transactional numbers are all hypothetical and are for illustrative purposes only. This is not a financial plan and any positions or scenarios outlined above are purely hypothetical and are not meant to be used as a guide on executing positions, buy/sell orders, timing the market or as an implied price ceiling for any individual securities. Investing involves risk including the possible loss of principle. Any investment should be assessed for risk-tolerance, financial objectives, and the financial circumstances of the individual investor, along with any associated tax-implications. Do not invest what you aren&#39;t willing to lose. Read and follow all the relevant tax rules/regulations related to IRA&#39;s and other tax-sheltered investment vehicles. I am a regular Ape who barely knows how to read, so talk to a Financial-Ape or a Tax-Ape if you want to save some bananas on your Ape-taxes. ---</em></p>\n\n<p>TLDR: If you made less than $124,000 in 2020 as a single-filer, you can put $6,000 into an IRA and any gains from buying/selling your favorite stock would be kept tax-free. The deadline for funding an IRA for the 2020 tax season is May 17th 2021. Tax situations are wildly different for each individual ape, so do your own research and talk to a tax-professional to see if you can reduce your tax liability, ESPECIALLY if you expect to make any trades this year that would put you in a different tax bracket for 2021</p>\n\n<p><a href=\"https://www.irs.gov/retirement-plans/traditional-and-roth-iras\">IRS.gov : Traditional vs. Roth IRA</a></p>\n\n<p><a href=\"https://www.irs.gov/retirement-plans/plan-participant-employee/retirement-topics-ira-contribution-limits\">IRS.gov : IRA Contribution Limits</a></p>\n\n<p><a href=\"https://www.irs.gov/retirement-plans/plan-participant-employee/retirement-topics-tax-on-early-distributions\">IRS.gov : Early Distributions and Exceptions</a></p>\n</div><!-- SC_ON -->",
  "score": 1321,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/X7iHmNZUaIzWq6FYcdLHVOL6-m2nbWT0Quu6PLNR3xE.jpg?auto=webp&s=87d1ccfe76e099d3918357735335d5e66f305dff",
          "width": 2400,
          "height": 1256
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/X7iHmNZUaIzWq6FYcdLHVOL6-m2nbWT0Quu6PLNR3xE.jpg?width=108&crop=smart&auto=webp&s=4a7f17ec8289d1130ff49f084abfd1b4038603a7",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/X7iHmNZUaIzWq6FYcdLHVOL6-m2nbWT0Quu6PLNR3xE.jpg?width=216&crop=smart&auto=webp&s=dc03712ab165f992cd90c18bca5f740ec0ccbd73",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/X7iHmNZUaIzWq6FYcdLHVOL6-m2nbWT0Quu6PLNR3xE.jpg?width=320&crop=smart&auto=webp&s=59d8db39d2325044971eeac1450eb3fbb32e6689",
            "width": 320,
            "height": 167
          },
          {
            "url": "https://external-preview.redd.it/X7iHmNZUaIzWq6FYcdLHVOL6-m2nbWT0Quu6PLNR3xE.jpg?width=640&crop=smart&auto=webp&s=886fd3a54dda59f45e707f1a751c8c0938ad1f07",
            "width": 640,
            "height": 334
          },
          {
            "url": "https://external-preview.redd.it/X7iHmNZUaIzWq6FYcdLHVOL6-m2nbWT0Quu6PLNR3xE.jpg?width=960&crop=smart&auto=webp&s=3ad2a62c186052af1385632a4ea66e42ccae721f",
            "width": 960,
            "height": 502
          },
          {
            "url": "https://external-preview.redd.it/X7iHmNZUaIzWq6FYcdLHVOL6-m2nbWT0Quu6PLNR3xE.jpg?width=1080&crop=smart&auto=webp&s=398efecbe19bc4a531fe3f9373a1921f301def23",
            "width": 1080,
            "height": 565
          }
        ],
        "variants": {},
        "id": "0E3aaa8I-c4xBw7s_2uI1pfoy_6aINpo20jawBJSrpo"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/wallstreetbets/comments/mol6ms/if_you_expect_to_become_a_multimillionaire_soon/",
  "subreddit": "wallstreetbets",
  "id": "mol6ms",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566622486
}