{
  "approved_at_utc": null,
  "subreddit": "investing",
  "selftext": "Show me names that are generally off the radar or at least not usually discussed here.\n\n* I mostly hold blue-chips but they are already on everyone’s radar. I don’t need to hear for the millionth time that  “GE is going to sell a bunch of electric ovens” or that a China cold war is going to help defense stocks. Give me a thesis I haven’t heard before if you’re throwing out a blue chip.\n* Please don’t throw out something like PLUG. Maybe it is out-of-favor with its recent beat-down but there are already a billion posts already on them.\n* No \tbio-tech/pharma please unless you actually have a bull/bear case for the science.\n* Under-appreciated\tdoes not need to mean “low-PE”, I’m looking for companies that are investing in the future and ideally doing something that provides value to society, not “oh gee, this private \tprison company is trading with a 14% dividend”  (yes, CXW is a thing).\n\nWhat I want is something that is **currently not in favor** but has potential to do well on a 10 year time frame. Why 10 years? The idea of “efficient market hypothesis” is misunderstood. It’s really “average weighted market participant”, and guess what...every market participant is in the game for a different reason. Some folks are in it for the YOLO, some are just trying to keep up with inflation, and most (asset managers) are simply trying to earn a good end-of-year bonus. I don’t have a chance in hell beating the market on **their time-frame**, but I think I have a good shot of beating it on **my time-frame** if I buy and hold solid companies with patience on my side.\n\nFundamental DD isn’t what I’m looking for, I assume the market has already priced that in. **Tell me what the market isn’t pricing in**. Also give me the **bear case**. I’ll start this off with the most eccentric stuff in my book...\n\n**Alleghany Corp (Y)**\n\nI just really love the management of this re-insurance company. They don’t “play Warren Buffet” and invest in the stock market. Instead they invest in private companies, with an eye towards durable moats...companies that can’t easily lose their position to Amazon or foreign competitors. Investments include AFCO Steel LLC (steel erection) & Jazware Toys (maker of Pokemon & AEW action figures). This is the management team that had the foresight to buy a private **FUNERAL** company while the corona-virus epidemic was raging.\n\nBull: COVID & severe weather (winter storm) losses really took it’s toll on the industry. Alleghany and others took significant underwriting losses. I see this as a positive going forward, because demand and pricing-power on re-insurance is likely be in an uptrend for the foreseeable future especially as severe climate events become the norm.\n\nBear: Climate change is a double-edged sword. More frequent severe weather is a good thing, because that improves demand/pricing-power...but the risk of massive black-swan event is always there.\n\n**Restaurant Brands International (QSR)**\n\nI nearly decided not to include this as they are a blue-chip, but mutual funds and asset managers HATE QSR. Their financials are uninspiring and generally they have a reputation on the street for “not being well-managed.” My take is that management is playing the long game rather than focusing on keeping the analysts happy...\n\nBull: If you’ve ever walked around Wall St., one thing is for certain...those managers have not eaten in one of those restaurants in years. Asset managers are in love with YUM Brands’ margin expansion yet ignoring that their food quality is going down the tubes. Meanwhile QSR has been playing the opposite game, stepping up their quality in Burger King and Tim Horton’s especially. The market is also under-appreciating the global expansion potential of Popeyes and Burger King. Indians love the veggie burger, and China loves fried chicken. Global expansion was put on hold due to corona-virus but is going to resume.\n\nBear: Tim Hortons. Their quality has vastly improved but brand-damage already took its toll, will take years to repair the reputation. Work-from-home conditions are going to hurt this line-of-business for the foreseeable future.\n\n**Freyr (FREY)**\n\nBull: Not just another lithium-ion SPAC. This one is out of Norway and even had a show of support from Erna Solberg (Norwegian prime minister). Energy is cheap there thanks to wind/hydro and  Freyr provides a rare opportunity for Norwegians to get a job at a promising upstart.\n\nBear: This is the biggest risk on my book. They are literally starting from scratch. No manufacturing capability expected for several years. They are currently hiring w/ the funds from their IPO. My main thesis is that Norwegians don’t generally pull pump-and-dump schemes like in the US. This can grow big or go to $0 if mismanaged.\n\n**Ingridion (INGR)**\n\nBull:  While everyone is distracted with Beyond Meat, industry dinosaur INGR has been not-so-secretly pivoting towards plant protein manufacturing. Just recently they’ve opened the first US plant that focuses exclusively on plant-based protein isolates and teaming with Clara Foods on egg protein alternatives. Their plant-protein investments are expected to continue accelerating with nearly $200 million in investments planned.\n\nBear: High-fructose corn syrup. While the company has been diversifying their portfolio to include stevia, starches, and beer brewing ingredients, HFCS is still a major part of their business, and it continues to get a bad rep despite that Ingridion’s corn syrup is likely more environmentally sustainable than cane sugar. Ingridion has not been able to win the perception war on HFCS and will need to keep finding new revenue streams to make up for stale demand in sweeteners.\n\n**NiSource, Inc (NI)**\n\nBull: Renewable energy investments are their biggest growth driver. While green energy eyes are focusing on cars, folks don’t realize **utility** **workers** are going to be the muscle behind the energy revolution. I’m looking towards a near-future where the political atmosphere recognizes this and accordingly green-lights the investments that are going to need to be made.\n\nTheir business model is also very resilient...this is a company that literally blew up 80 homes in Massachusetts, survived the lawsuit and ended with a stronger all-time high a year later. Currently trading (along many other utilities) at way below their pre-corona highs despite a near record-high spread between their dividend and treasury yield.\n\nBear: It’s a regulated utility company. Political constraints are going to cap their upward potential.\n\n**IAMGold (IAG)**\n\nBull: Their stock has been beaten down after something like eight years of red tape, and now they’ve finally broken ground on their Cote Mine in Quebec. I had to pay attention because Justin Trudeau himself attending the ground-breaking ceremony. Company has practically zero debt and a price to book of around 0.6. They are literally worth more than the gold they are sitting on. I don’t think gold bugs realize the benefit of having a mine in Canada. If gold ever does reach $3000, good luck getting it out of a 3rd world country without paying bribes.\n\nBear: This company needs a strong gold price. Canadian labor is expensive: gold needs to fetch a good price to make mining profitable. A lot is riding on Cote and there’s always the risk it could end up a bust.\n\n**Cal Maine Foods (CALM)**\n\nBull: Eggs are currently selling at near inflation adjusted lows (measured over 30+ years). It’s practically never been cheaper to eat eggs, while per-capita consumption is on uptrend. Sooner or later the hope is that margins will improve, especially as demand for cage free increases. Cal-Maine is currently trading with a depressed price yet very high PE due to continued investment in growth, especially cage-free (these sell at larger margins). I see this as an investment that will pay off in 5+ years.\n\nBear: Literally all you need to compete with them is to buy a rooster and some hens. Egg industry pricing power remains weak.\n\n**Graftech (EAF)**\n\nI’m usually not into very cheap but this company is very cheap. 7 PE. EAF is a Brookfield turnaround story. It’s understood that they were mismanaged before Brookfield came in, cleaned things up, and improved efficiency/margins. Stock has been a bear since Brookfield IPO’d it, as it’s obvious the purpose of the IPO is just so that Brookfield could cash in on their original investment. BIG insider selling by Brookfield has not finished yet and it remains an anchor around the stock price. Fortunately however Brookfield has already trimmed down to own < 25% of the company...so there’s a bit more to go but the insider selling drag is likely to be over soon.\n\nBull: The steel industry is responsible for roughly 5% of all global carbon emissions. There’s currently no other way to produce low-carbon steel other than recycling steel scrap. EAF is the largest US manufacturer of graphite electrodes: the heating element used in the furnace to melt down and recycle steel. Right now there isn’t any political “push” to increase recycled steel demand, and “made in USA” has so far been an empty promise, but I expect real political push for both will come in a few years.\n\nBear: China. Industry speculation is that China is building up several times the capacity to build graphite electrodes...although speculation is also that quality will not be a good. It remains to be seen if Chinese firms are doing this for domestic consumption only (China wants to go green too). It also remains to be seen if Chinese output will be able to keep up with or exceed recycled steel demand.",
  "author_fullname": "t2_9hxza",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "What are your under-appreciated, off-the-radar picks for a 10 year hold?",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/investing",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": true,
  "name": "t3_om9772",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.93,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 1125,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 1125,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1626545916,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1626573390,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.investing",
  "allow_live_comments": true,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Show me names that are generally off the radar or at least not usually discussed here.</p>\n\n<ul>\n<li>I mostly hold blue-chips but they are already on everyone’s radar. I don’t need to hear for the millionth time that  “GE is going to sell a bunch of electric ovens” or that a China cold war is going to help defense stocks. Give me a thesis I haven’t heard before if you’re throwing out a blue chip.</li>\n<li>Please don’t throw out something like PLUG. Maybe it is out-of-favor with its recent beat-down but there are already a billion posts already on them.</li>\n<li>No    bio-tech/pharma please unless you actually have a bull/bear case for the science.</li>\n<li>Under-appreciated does not need to mean “low-PE”, I’m looking for companies that are investing in the future and ideally doing something that provides value to society, not “oh gee, this private    prison company is trading with a 14% dividend”  (yes, CXW is a thing).</li>\n</ul>\n\n<p>What I want is something that is <strong>currently not in favor</strong> but has potential to do well on a 10 year time frame. Why 10 years? The idea of “efficient market hypothesis” is misunderstood. It’s really “average weighted market participant”, and guess what...every market participant is in the game for a different reason. Some folks are in it for the YOLO, some are just trying to keep up with inflation, and most (asset managers) are simply trying to earn a good end-of-year bonus. I don’t have a chance in hell beating the market on <strong>their time-frame</strong>, but I think I have a good shot of beating it on <strong>my time-frame</strong> if I buy and hold solid companies with patience on my side.</p>\n\n<p>Fundamental DD isn’t what I’m looking for, I assume the market has already priced that in. <strong>Tell me what the market isn’t pricing in</strong>. Also give me the <strong>bear case</strong>. I’ll start this off with the most eccentric stuff in my book...</p>\n\n<p><strong>Alleghany Corp (Y)</strong></p>\n\n<p>I just really love the management of this re-insurance company. They don’t “play Warren Buffet” and invest in the stock market. Instead they invest in private companies, with an eye towards durable moats...companies that can’t easily lose their position to Amazon or foreign competitors. Investments include AFCO Steel LLC (steel erection) &amp; Jazware Toys (maker of Pokemon &amp; AEW action figures). This is the management team that had the foresight to buy a private <strong>FUNERAL</strong> company while the corona-virus epidemic was raging.</p>\n\n<p>Bull: COVID &amp; severe weather (winter storm) losses really took it’s toll on the industry. Alleghany and others took significant underwriting losses. I see this as a positive going forward, because demand and pricing-power on re-insurance is likely be in an uptrend for the foreseeable future especially as severe climate events become the norm.</p>\n\n<p>Bear: Climate change is a double-edged sword. More frequent severe weather is a good thing, because that improves demand/pricing-power...but the risk of massive black-swan event is always there.</p>\n\n<p><strong>Restaurant Brands International (QSR)</strong></p>\n\n<p>I nearly decided not to include this as they are a blue-chip, but mutual funds and asset managers HATE QSR. Their financials are uninspiring and generally they have a reputation on the street for “not being well-managed.” My take is that management is playing the long game rather than focusing on keeping the analysts happy...</p>\n\n<p>Bull: If you’ve ever walked around Wall St., one thing is for certain...those managers have not eaten in one of those restaurants in years. Asset managers are in love with YUM Brands’ margin expansion yet ignoring that their food quality is going down the tubes. Meanwhile QSR has been playing the opposite game, stepping up their quality in Burger King and Tim Horton’s especially. The market is also under-appreciating the global expansion potential of Popeyes and Burger King. Indians love the veggie burger, and China loves fried chicken. Global expansion was put on hold due to corona-virus but is going to resume.</p>\n\n<p>Bear: Tim Hortons. Their quality has vastly improved but brand-damage already took its toll, will take years to repair the reputation. Work-from-home conditions are going to hurt this line-of-business for the foreseeable future.</p>\n\n<p><strong>Freyr (FREY)</strong></p>\n\n<p>Bull: Not just another lithium-ion SPAC. This one is out of Norway and even had a show of support from Erna Solberg (Norwegian prime minister). Energy is cheap there thanks to wind/hydro and  Freyr provides a rare opportunity for Norwegians to get a job at a promising upstart.</p>\n\n<p>Bear: This is the biggest risk on my book. They are literally starting from scratch. No manufacturing capability expected for several years. They are currently hiring w/ the funds from their IPO. My main thesis is that Norwegians don’t generally pull pump-and-dump schemes like in the US. This can grow big or go to $0 if mismanaged.</p>\n\n<p><strong>Ingridion (INGR)</strong></p>\n\n<p>Bull:  While everyone is distracted with Beyond Meat, industry dinosaur INGR has been not-so-secretly pivoting towards plant protein manufacturing. Just recently they’ve opened the first US plant that focuses exclusively on plant-based protein isolates and teaming with Clara Foods on egg protein alternatives. Their plant-protein investments are expected to continue accelerating with nearly $200 million in investments planned.</p>\n\n<p>Bear: High-fructose corn syrup. While the company has been diversifying their portfolio to include stevia, starches, and beer brewing ingredients, HFCS is still a major part of their business, and it continues to get a bad rep despite that Ingridion’s corn syrup is likely more environmentally sustainable than cane sugar. Ingridion has not been able to win the perception war on HFCS and will need to keep finding new revenue streams to make up for stale demand in sweeteners.</p>\n\n<p><strong>NiSource, Inc (NI)</strong></p>\n\n<p>Bull: Renewable energy investments are their biggest growth driver. While green energy eyes are focusing on cars, folks don’t realize <strong>utility</strong> <strong>workers</strong> are going to be the muscle behind the energy revolution. I’m looking towards a near-future where the political atmosphere recognizes this and accordingly green-lights the investments that are going to need to be made.</p>\n\n<p>Their business model is also very resilient...this is a company that literally blew up 80 homes in Massachusetts, survived the lawsuit and ended with a stronger all-time high a year later. Currently trading (along many other utilities) at way below their pre-corona highs despite a near record-high spread between their dividend and treasury yield.</p>\n\n<p>Bear: It’s a regulated utility company. Political constraints are going to cap their upward potential.</p>\n\n<p><strong>IAMGold (IAG)</strong></p>\n\n<p>Bull: Their stock has been beaten down after something like eight years of red tape, and now they’ve finally broken ground on their Cote Mine in Quebec. I had to pay attention because Justin Trudeau himself attending the ground-breaking ceremony. Company has practically zero debt and a price to book of around 0.6. They are literally worth more than the gold they are sitting on. I don’t think gold bugs realize the benefit of having a mine in Canada. If gold ever does reach $3000, good luck getting it out of a 3rd world country without paying bribes.</p>\n\n<p>Bear: This company needs a strong gold price. Canadian labor is expensive: gold needs to fetch a good price to make mining profitable. A lot is riding on Cote and there’s always the risk it could end up a bust.</p>\n\n<p><strong>Cal Maine Foods (CALM)</strong></p>\n\n<p>Bull: Eggs are currently selling at near inflation adjusted lows (measured over 30+ years). It’s practically never been cheaper to eat eggs, while per-capita consumption is on uptrend. Sooner or later the hope is that margins will improve, especially as demand for cage free increases. Cal-Maine is currently trading with a depressed price yet very high PE due to continued investment in growth, especially cage-free (these sell at larger margins). I see this as an investment that will pay off in 5+ years.</p>\n\n<p>Bear: Literally all you need to compete with them is to buy a rooster and some hens. Egg industry pricing power remains weak.</p>\n\n<p><strong>Graftech (EAF)</strong></p>\n\n<p>I’m usually not into very cheap but this company is very cheap. 7 PE. EAF is a Brookfield turnaround story. It’s understood that they were mismanaged before Brookfield came in, cleaned things up, and improved efficiency/margins. Stock has been a bear since Brookfield IPO’d it, as it’s obvious the purpose of the IPO is just so that Brookfield could cash in on their original investment. BIG insider selling by Brookfield has not finished yet and it remains an anchor around the stock price. Fortunately however Brookfield has already trimmed down to own &lt; 25% of the company...so there’s a bit more to go but the insider selling drag is likely to be over soon.</p>\n\n<p>Bull: The steel industry is responsible for roughly 5% of all global carbon emissions. There’s currently no other way to produce low-carbon steel other than recycling steel scrap. EAF is the largest US manufacturer of graphite electrodes: the heating element used in the furnace to melt down and recycle steel. Right now there isn’t any political “push” to increase recycled steel demand, and “made in USA” has so far been an empty promise, but I expect real political push for both will come in a few years.</p>\n\n<p>Bear: China. Industry speculation is that China is building up several times the capacity to build graphite electrodes...although speculation is also that quality will not be a good. It remains to be seen if Chinese firms are doing this for domestic consumption only (China wants to go green too). It also remains to be seen if Chinese output will be able to keep up with or exceed recycled steel demand.</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qhhq",
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "om9772",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "cr0ne",
  "discussion_type": null,
  "num_comments": 40,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/investing/comments/om9772/what_are_your_underappreciated_offtheradar_picks/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/investing/comments/om9772/what_are_your_underappreciated_offtheradar_picks/",
  "subreddit_subscribers": 1885230,
  "created_utc": 1626551175,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1626544590,
  "the_new_excerpt": "Show me names that are generally off the radar or at least not usually discussed\nhere.\n\n * I mostly hold blue-chips but they are already on everyone’s radar. I don’t\n   need to hear for the millionth time that “GE is going to sell a bunch of\n   electric ovens” or that a China cold war is going to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "一般的に注目されていない、あるいは少なくとも普段ここで議論されていないような名前を教えてください。\nをご覧ください。\n\n * 私は主にブルーチップを保有していますが、それらはすでに皆のレーダーに載っています。私は主に優良企業を保有していますが、それらはすでに誰もが注目しています。\n   GEは電気製品を大量に売るつもりだ」という話を何度も聞く必要はありません。\n   私は、「GEが電気オーブンを大量に販売する」とか、「中国の冷戦が......」などと何度も聞く必要はありません。",
      "title": "10年間のホールドのための、評価の低い、注目されていないピックは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我看看那些通常不被关注的名字，或者至少是通常不被讨论的名字\n这里。\n\n *我主要持有蓝筹股，但它们已经在大家的雷达上。我不需要\n   我不需要无数次听到 \"通用电气将出售一批电动汽车 \"的说法。\n   电烤箱\"，或者说中国的冷战将......",
      "title": "你有哪些不受重视的、不为人知的10年持有的选择？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我看看那些通常不被關注的名字，或者至少是通常不被討論的名字\n這裏。\n\n *我主要持有藍籌股，但它們已經在大家的雷達上。我不需要\n   我不需要無數次聽到 \"通用電氣將出售一批電動汽車 \"的說法。\n   電烤箱\"，或者說中國的冷戰將......",
      "title": "你有哪些不受重視的、不爲人知的10年持有的選擇？"
    }
  ],
  "source_updated_at": 1627033380712
}