{
  "author": "dragondude4",
  "original_created_utc": 1628712887,
  "title": "TOKENOMICS 101: How to spot undervalued gems in a sea of shitcoins.",
  "created_utc": 1628731884,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Tokenomics (token economics) are a series of metrics relating to a cryptocurrency such as supply, allocation, distribution, emission, and utility. In this post I will break down some of the most important things you should know while you DYOR. Tokenomics is the difference between making sound crypto investments vs yoloing into scamcoins or memecoins.   </p>\n\n<h2>Circulating and Maximum Supply</h2>\n\n<p>This is one of the most important metrics to when evaluating a coins price. Circulating supply is the amount of coins that’s currently in public hands and circulating in the market. Maximum supply is the total number of coins that will ever exist for a cryptocurrency. There won’t be any more supply once a coin reaches its max supply cap as it is the maximum amount that can ever be mined or produced. For example, Bitcoin has a maximum supply of 21 million and about 18 million of that is currently circulating, whereas DOGE has a whopping current supply of 128 billion and no hard cap.</p>\n\n<h2>Inflation and Deflation</h2>\n\n<p>Cryptocurrencies like Bitcoin have a maximum supply of 21 million. This makes it scarce and as demand for it increases, the price will subsequently increase. There are coins that don’t have any cap on the maximum supply (e.g. Ethereum, DOGE). These are inflationary which means new coins are continuously minted and an equivalent increase in demand is required to match the increasing supply to maintain the price. For example, every 10 minutes 6.25 Bitcoin are mined and this keeps halving until the max cap is reached. In contrast, every 1 minute 10,000 DOGE is mined and there will never be a cap. </p>\n\n<h2>Market capitalization (or market cap)</h2>\n\n<p>Market capitalization (or market cap) is the total dollar value of all the the coins of a cryptocurrency that have been mined. It is calculated by multiplying the circulating supply by the price of a single coin at any given time. Investors use market cap to tell a more complete story than simply the price and compare value across cryptocurrencies. As a key statistic, it can indicate the volatility and growth potential of a cryptocurrency. Using supply and market cap we can judge what the price of a cryptocurrency can be relative to other ones. This is why some coins have various different prices even if they might have similar market caps. For example, if DOGE had the same market cap as Bitcoin (1.1 trillion) it would be worth only $7.98. However that is a massive upside of 2800% or 28x. Comparatively if Ethereum had the same market cap as Bitcoin, its price would be at $8.9k which is an upside of 290%. Basically, the larger the marketcap of a coin is, the more difficult it is to increase in price. You can view these calculations and comparisons easily <a href=\"https://thecoinperspective.com/\">on this website - The Coin Perspective </a>. </p>\n\n<h2>Allocation and Distribution</h2>\n\n<p>Cryptocurrencies are created in two ways: by fair launch, or by pre-mine. A fair launch is when a small community of people start collectively mining a coin or token. Bitcoin (BTC), Litecoin (LTC), and Dogecoin (DOGE) are examples of fair launched cryptocurrencies. There are no coin or token allocations for fair launch crypto. A pre-mine is when the team behind the project mint some or all of the coins or tokens before opening up the network to the public. It’s common for pre-mined tokens to be allocated to the team and private investors such as venture capital firms with only a small percentage being sold to the public. Uneven distribution of coins is a risk factor as large holders can dump on the market and crash the price.</p>\n\n<h2>Vesting and Emission</h2>\n\n<p>Vesting applies to pre-mined cryptocurrencies and refers to how the coins or tokens are expected to be allocated over the coming months or years. There are also vesting schedules for when the founders or insiders of a crypto project are allowed to sell their coins to the market. You can check the vesting schedules of most cryptocurrencies on their respective websites. Unlocking or minting too many tokens at once or within a short timeframe can sink the price action of that token in the short term.  </p>\n\n<h2>Utility</h2>\n\n<p>‘Utility’ is referred to as a use case and includes basically anything that drives demand for a cryptocurrency coin or token. For example, ETH is used for gas to power the Ethereum network. Basically more utility = more demand, which means price goes up. When you stake a cryptocurrency as a validator or a delegator, those coins or tokens are usually locked up for some period of time. This can supercharge positive price action during a parabolic run. </p>\n\n<p>—————</p>\n\n<p>Combine this guide with my other post called <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/owihb6/everyone_always_says_dyor_but_never_shows_you_how/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\">everyone always says “DYOR” but never shows you how to DYOR.</a>, and you have fully equipped yourself with the knowledge required to confidently invest in the crypto space. </p>\n\n<p>tl;dr - These are, in my opinion, the bare minimum to look into before investing in any coin. Ideally, you want a deflationary coin with a max supply that had a fair launch or has a good vesting schedule that does not allow founders/whales to dump on the market and is distributed relatively equitably. A cryptocurrency with good tokenomics will succeed and have good price action in the long run. Hope this helps some people here that are new to the space!</p>\n</div><!-- SC_ON -->",
  "score": 220,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/gi0ZJRu82Dxds3o8TQDUolFFrdWe_UTlR6WPv25h6jY.jpg?auto=webp&s=101d2ee315f0a49915ae57699c0d4a9a0bcffc95",
          "width": 524,
          "height": 310
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/gi0ZJRu82Dxds3o8TQDUolFFrdWe_UTlR6WPv25h6jY.jpg?width=108&crop=smart&auto=webp&s=eebb8769f4bd2bcb0bdcb3269562577e61ef22cc",
            "width": 108,
            "height": 63
          },
          {
            "url": "https://external-preview.redd.it/gi0ZJRu82Dxds3o8TQDUolFFrdWe_UTlR6WPv25h6jY.jpg?width=216&crop=smart&auto=webp&s=54fe1d5b7bf59666550f0b8f9d6e506ec983f7f7",
            "width": 216,
            "height": 127
          },
          {
            "url": "https://external-preview.redd.it/gi0ZJRu82Dxds3o8TQDUolFFrdWe_UTlR6WPv25h6jY.jpg?width=320&crop=smart&auto=webp&s=a7675364bec87142dd0ee61bafcf2e51d10952f6",
            "width": 320,
            "height": 189
          }
        ],
        "variants": {},
        "id": "oE_hydU5mmV2mC1FjwOZU4BkpYsV8SRQGYAkrIwsKY8"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/p2l4pn/tokenomics_101_how_to_spot_undervalued_gems_in_a/",
  "subreddit": "CryptoCurrency",
  "id": "p2l4pn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Tokenomics (token economics) are a series of metrics relating to a\ncryptocurrency such as supply, allocation, distribution, emission, and utility.\nIn this post I will break down some of the most important things you should know\nwhile you DYOR. Tokenomics is the difference between making sound…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "トークノミクス（トークンエコノミクス）とは、暗号通貨に関連する一連の指標のことです。\n供給、配分、分配、排出、実用性など、暗号通貨に関する一連の指標です。\nこの記事では、あなたが知っておくべき最も重要なことのいくつかを分解します。\nwhile you DYOR. トークノミクスは、音を出すことの違い...",
      "title": "TOKENOMICS 101：シットコインの海で割安な宝石を見つける方法"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Tokenomics（代币经济学）是一系列有关一个\n加密货币的一系列指标，如供应、分配、分布、排放和效用。\n在这篇文章中，我将分解一些你应该知道的最重要的事情\n当你DYOR的时候。Tokenomics是使健全的差异...",
      "title": "TOKENOMICS 101: 如何在一片垃圾币的海洋中发现被低估的宝石。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Tokenomics（代幣經濟學）是一系列有關一個\n加密貨幣的一系列指標，如供應、分配、分佈、排放和效用。\n在這篇文章中，我將分解一些你應該知道的最重要的事情\n當你DYOR的時候。Tokenomics是使健全的差異...",
      "title": "TOKENOMICS 101: 如何在一片垃圾幣的海洋中發現被低估的寶石。"
    }
  ]
}