{
  "author": "asml84",
  "the_new_excerpt": "Let me start by providing some context: my portfolio sits at 500k, but the\ncurrent climate in the equity markets scares me. I’m not some rich kid, this\nmoney is the result of 10 years of grueling work. Long story short, I want to\nget out. Actually, I’m already out (85% cash), but I realized that…",
  "original_created_utc": 1609915571,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "让我从提供一些背景开始：我的投资组合坐拥500K，但\n当前股市的气候让我很害怕。我不是什么富家子弟，这\n钱是10年辛勤工作的结果。长话短说，我想\n滚出去。实际上，我已经没钱了(85%现金)，但是我意识到…",
      "title": "维持购买力的长期策略"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我從提供一些背景開始：我的投資組合坐擁500K，但\n當前股市的氣候讓我很害怕。我不是什麼富家子弟，這\n錢是10年辛勤工作的結果。長話短說，我想\n滾出去。實際上，我已經沒錢了(85%現金)，但是我意識到…",
      "title": "維持購買力的長期策略"
    }
  ],
  "title": "Long-term strategies to preserve purchasing power",
  "created_utc": 1609941139,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let me start by providing some context: my portfolio sits at 500k, but the current climate in the equity markets scares me. I’m not some rich kid, this money is the result of 10 years of grueling work. Long story short, I want to get out. Actually, I’m already out (85% cash), but I realized that even cash is an explicit decision. Not only cash is a decision, even the currency is a decision. I’m originally from Europe and it’s likely that I’ll go back at some point. At the moment I sit on USD 425k, but I can imagine a number of reasons why cash might be a bad idea. With a timeframe of 20 years:</p>\n\n<ul>\n<li><p>USD might depreciate substantially w.r.t. to EUR, so my hard-earned money might be worth substantially less in my home country.</p></li>\n<li><p>Inflation is inevitably going to decrease the value of cash over time.</p></li>\n<li><p>New currencies like Bitcoin might devalue traditional fiat currencies. I’m not a fan of crypto-currencies, but the truth is no one knows what the financial landscape is going to look like in a few decades.</p></li>\n</ul>\n\n<p>My question is: how do I preserve the purchasing power of my savings in a safe and currency-agnostic way? I’m not after crazy returns, I just want to make sure that my current purchasing power is preserved.</p>\n\n<p>The same arguments that apply to cash also seem to apply to other investment classes: you can buy real estate, but there may be a housing bubble, you can buy gold, but people may lose interest in it as a hedge. There doesn’t seem to be a truly neutral long-term investment.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/investing/comments/krifak/longterm_strategies_to_preserve_purchasing_power/",
  "subreddit": "investing",
  "id": "krifak",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100748511
}