{
  "author": "moderatorov_decko",
  "the_new_excerpt": "I'm investing passively for a couple of years now, and have never faced a short\nsqueeze. At least not that I was aware of.\n\nNow that the GME short squeeze is all over the place, I've decided to invest\nsome time and learn what it means.\n\nAfter doing that and also learning what happened with…",
  "original_created_utc": 1611452091,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我被动投资几年了，从来没有面临过短线的\n挤压。至少我是不知道的。\n\n现在GME空头压榨的情况下，我决定投资于\n一些时间，学习它的含义。\n\n做完之后，也了解了发生的事情与...",
      "title": "我们怎么会沦落到这样的地步？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我被動投資幾年了，從來沒有面臨過短線的\n擠壓。至少我是不知道的。\n\n現在GME空頭壓榨的情況下，我決定投資於\n一些時間，學習它的含義。\n\n做完之後，也瞭解了發生的事情與...",
      "title": "我們怎麼會淪落到這樣的地步？"
    }
  ],
  "title": "How did we get into this GME situation?",
  "created_utc": 1611519453,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m investing passively for a couple of years now, and have never faced a short squeeze. At least not that I was aware of.</p>\n\n<p>Now that the GME short squeeze is all over the place, I&#39;ve decided to invest some time and learn what it means.</p>\n\n<p>After doing that and also learning what happened with Volkswagen 13 years ago, I&#39;m still a bit baffled as to how did MMs put themselves into this position? </p>\n\n<p>I&#39;m a bit confused how can it be legal to have more shares out there shorted than there are shares of the same company outstanding?</p>\n\n<p>If I&#39;m MM and you ask me to short 1m shares on a company that has 500k shares outstanding, why would I accept such a deal?</p>\n\n<p>I understand what potential repercussions are, but I&#39;m unsure if I understand how did we get to this point and I&#39;d really like to learn that too before I invest on Monday.</p>\n</div><!-- SC_ON -->",
  "score": 44,
  "permalink": "/r/stocks/comments/l3pl09/how_did_we_get_into_this_gme_situation/",
  "subreddit": "stocks",
  "id": "l3pl09",
  "is_self": true,
  "media": null,
  "is_video": false
}