{
  "author": "elogie423",
  "original_created_utc": 1641862556,
  "title": "While we're all feeling pain, what's everyone's worst crypto investment?",
  "created_utc": 1641893848,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Mine was a shitcoin dex aggregator rugpull called octofi. Got cocky from easy bull run gains, put about 2k in and sold at about a 90% loss after hodling and hoping too long. &lt;/p&gt;\n\n&lt;p&gt;The signs were there that the project was dead. But I was fooled by getting an entry 50% below ATH, and seeing a quick 50% gain followed by a slow rug. So I held way past  being reasonably certain it was dead. Plus it was shilled by a crypto guy who led me to other actual gems, but I guess it&amp;#39;s true that everyone is a genius in a bull run.&lt;/p&gt;\n\n&lt;p&gt;Honorable mention to my friend who fomod into eth in May at 4400, sold for a loss then bought around 4k more recently and sold for a loss again. RIP.&lt;/p&gt;\n\n&lt;p&gt;Hope this helps everyone feel a little better for the state of affairs we&amp;#39;re all in. What&amp;#39;s your worst crypto story?&lt;/p&gt;\n\n&lt;p&gt;Edit: I hope we can all take solace and find solidarity in the fact that most of us have made mistakes and poor choices. And maybe even reflect on what led us to those choices. This game rewards risk takers, and we&amp;#39;re all just one yolo away from a lambo, I think. Not car advice.&lt;/p&gt;\n\n&lt;p&gt;Thanks for sharing everyone.&lt;/p&gt;\n\n&lt;p&gt;Edit 2: besides obvious (in hindsight) rugs and shitcoins, the most common worst choices are VET, fomoing doge and shib, fomoing CRO (also guilty of this) and buying ADA at peak. And ICP. We&amp;#39;ll do better next time homies.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/CryptoCurrency/comments/s0zv4y/while_were_all_feeling_pain_whats_everyones_worst/",
  "subreddit": "CryptoCurrency",
  "id": "s0zv4y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Mine was a shitcoin dex aggregator rugpull called octofi. Got cocky from easy\nbull run gains, put about 2k in and sold at about a 90% loss after hodling and\nhoping too long.\n\nThe signs were there that the project was dead. But I was fooled by getting an\nentry 50% below ATH, and seeing a quick 50%…"
}