{
  "author": "dndjjeje",
  "the_new_excerpt": "When I was in school we learned about colonialism and the horrors of slavery but\nthe way it’s taught makes it sound like white Europeans started the trade\nentirely when historically Africans were sold into slavery for the better part\nof colonialism by other Africans. It seems less divisive to…",
  "original_created_utc": 1620461740,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が学校に通っていた頃は、植民地支配や奴隷制の恐ろしさについて学びました。\n歴史的にはアフリカ人の大部分が奴隷として売られていたのに、その教え方ではまるで白人のヨーロッパ人が奴隷貿易を始めたかのようです。\n歴史的には、アフリカ人は他のアフリカ人によって植民地時代の大部分を奴隷として売られていたのです。\n歴史的には、アフリカ人は他のアフリカ人によって植民地時代の大半を奴隷として売られていたのです。その方が分裂しないような気がしますが・・・。",
      "title": "なぜアフリカ人の奴隷貿易への関与を学ばないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我在学校的时候，我们学习了殖民主义和奴隶制的恐怖，但是\n但教学方式使它听起来像是欧洲白人开始了这种贸易。\n而在历史上，非洲人在殖民主义的大部分时间里都被卖给了奴隶制。\n殖民主义的大部分时间都是由其他非洲人卖给奴隶的。这似乎不那么具有分裂性，因为...",
      "title": "为什么我们不了解非洲人参与奴隶贸易的情况？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我在學校的時候，我們學習了殖民主義和奴隸制的恐怖，但是\n但教學方式使它聽起來像是歐洲白人開始了這種貿易。\n而在歷史上，非洲人在殖民主義的大部分時間裏都被賣給了奴隸制。\n殖民主義的大部分時間都是由其他非洲人賣給奴隸的。這似乎不那麼具有分裂性，因爲...",
      "title": "爲什麼我們不瞭解非洲人蔘與奴隸貿易的情況？"
    }
  ],
  "title": "Why don’t we learn about the involvement of Africans in the slave trade?",
  "created_utc": 1620483915,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When I was in school we learned about colonialism and the horrors of slavery but the way it’s taught makes it sound like white Europeans started the trade entirely when historically Africans were sold into slavery for the better part of colonialism by other Africans. It seems less divisive to acknowledge this fact and the involvement of everyone in the trade but why does nobody talk about it and why is it left out of curriculum?</p>\n</div><!-- SC_ON -->",
  "score": 116,
  "permalink": "/r/TooAfraidToAsk/comments/n7kjjb/why_dont_we_learn_about_the_involvement_of/",
  "subreddit": "TooAfraidToAsk",
  "id": "n7kjjb",
  "is_self": true,
  "media": null,
  "is_video": false
}