{
  "author": "BananAsriel_",
  "original_created_utc": 1639501770,
  "title": "Why does the US goverment and its laws seem to appeal towards christians?",
  "created_utc": 1639512576,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not American myself, but in this year through Covid i&amp;#39;ve noticed that a lot of discourse in US laws, restrictions, movements and what not always take a hit by religion, specially christianity. &lt;/p&gt;\n\n&lt;p&gt;A huge amount of americans heavily believe that the United States were founded on christianity when their own founding documents explicitly state that the States are not of religion and that laws are not to be made for it.&lt;/p&gt;\n\n&lt;p&gt;why is religion always a topic that influences so much when it comes to politics and laws?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/TooAfraidToAsk/comments/rgc389/why_does_the_us_goverment_and_its_laws_seem_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "rgc389",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm not American myself, but in this year through Covid i've noticed that a lot\nof discourse in US laws, restrictions, movements and what not always take a hit\nby religion, specially christianity.\n\nA huge amount of americans heavily believe that the United States were founded\non christianity when…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はアメリカ人ではないのですが、今年、Covidを通じて、たくさんの\n米国の法律、規制、運動、その他における言説は、常に打撃を受ける。\n宗教、特にキリスト教によって。\n\n多くのアメリカ人が、アメリカは建国されたと強く信じています。\nキリスト教に...",
      "title": "なぜ、アメリカ政府とその法律はキリスト教徒にアピールしているように見えるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我自己不是美国人，但在今年通过Covid我注意到很多\n在美国的法律、限制、运动和其他方面的讨论总是受到\n宗教，特别是基督教的影响。\n\n大量的美国人坚信，美国是建立在\n基督教，当...",
      "title": "为什么美国政府及其法律似乎对基督教徒有吸引力？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我自己不是美國人，但在今年通過Covid我注意到很多\n在美國的法律、限制、運動和其他方面的討論總是受到\n宗教，特別是基督教的影響。\n\n大量的美國人堅信，美國是建立在\n基督教，當...",
      "title": "爲什麼美國政府及其法律似乎對基督教徒有吸引力？"
    }
  ]
}