{
  "author": "chirish_b",
  "the_new_excerpt": "Here is the link to the article:\nhttps://www.bloomberg.com/news/articles/2021-02-03/sec-hunts-for-fraud-in-social-media-posts-that-drove-up-gamestop\n\nAnd, here is the most important point that a lot of readers keep missing:\n\n> The prevailing narrative is that Wall Street short-sellers were caught\n>…",
  "original_created_utc": 1612387860,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "下面是文章的链接。\nhttps://www.bloomberg.com/news/articles/2021-02-03/sec-hunts-for-fraud-in-social-media-posts-that-drove-up-gamestop\n\n而且，这里是很多读者一直忽略的最重要的一点。\n\n> 主流的说法是华尔街的卖空者被抓了个现行\n>…",
      "title": "澄清SEC对社交媒体GME炒作欺诈的调查【彭博社文章】。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "下面是文章的鏈接。\nhttps://www.bloomberg.com/news/articles/2021-02-03/sec-hunts-for-fraud-in-social-media-posts-that-drove-up-gamestop\n\n而且，這裏是很多讀者一直忽略的最重要的一點。\n\n> 主流的說法是華爾街的賣空者被抓了個現行\n>…",
      "title": "澄清SEC對社交媒體GME炒作欺詐的調查【彭博社文章】。"
    }
  ],
  "title": "Clarifying the SEC's Investigation of Social Media GME Hype for Fraud [Bloomberg Article]",
  "created_utc": 1612403866,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Here is the link to the article:<br/>\n<a href=\"https://www.bloomberg.com/news/articles/2021-02-03/sec-hunts-for-fraud-in-social-media-posts-that-drove-up-gamestop\">https://www.bloomberg.com/news/articles/2021-02-03/sec-hunts-for-fraud-in-social-media-posts-that-drove-up-gamestop</a></p>\n\n<p>And, here is the most important point that a lot of readers keep missing:  </p>\n\n<blockquote>\n<p>The prevailing narrative is that Wall Street short-sellers were caught flatfooted over the past two weeks as retail traders banded together via Reddit message boards and bought up stocks that hedge funds were betting against. <strong>But some market participants</strong>, including famed short-seller Carson Block, have started to <strong>speculate that the short squeezes that drove GameStop, AMC and other stocks</strong> to exorbitant heights <strong>might have also involved professional investors who either took advantage of the Reddit-fueled frenzy or helped hype it.</strong>  </p>\n\n<p>The SEC hasn’t said whether there’s anything to Block’s theory, but acting chair Allison Herren Lee said in a statement earlier this week that the agency was looking at “compliance with regulatory obligations, adequate and consistent risk disclosure, and determining if any fraudulent or manipulative behavior has occurred.”  </p>\n\n<p><strong>There is also mounting concern about the possibility of bot activity in Reddit’s WallStreetBets chat</strong> after a spokesperson for the forum told CBS News <strong>that there was a “large amount” of it</strong> and that some posts were being blocked by an automated moderation system.</p>\n</blockquote>\n\n<p>And also all of this:</p>\n\n<blockquote>\n<p>Regulators typically start their investigations by using algorithms to hunt through tons of data to try to spot suspiciously well-timed trades, including signs that such bets were coordinated, Bennett said. Then they would try to match up those trades with posts on social media, while sorting out who wrote the posts and what their intent was, he said.</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p><strong>TL;DR:</strong> the SEC isn&#39;t going after everyone on WSB - in fact, they&#39;re not even saying they&#39;re going after anyone on WSB.  If they do, <strong>it&#39;s going to be the professional traders</strong> that went in and started <strong>giving misinformation</strong> <strong>and</strong> <strong>attempted to manipulate the subreddit for their gain</strong>.</p>\n\n<p><strong>Please don&#39;t buy into tweets or brief headlines that claim</strong> the SEC is hunting down Redditors and not looking into brokerage apps and hedge funds - they&#39;re looking at all angles, and I&#39;m sure they&#39;ll bring to justice the people who manipulated the masses - do some DD for yourself and spend the two minutes it takes to read articles in their entirety.</p>\n</div><!-- SC_ON -->",
  "score": 150,
  "permalink": "/r/stocks/comments/lbyve5/clarifying_the_secs_investigation_of_social_media/",
  "subreddit": "stocks",
  "id": "lbyve5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518543323
}