{
  "author": "Commercial_Film_7402",
  "original_created_utc": 1655520832,
  "title": "How did the Native Americans season their foods? What sorts of spices and flavorings did they use?",
  "created_utc": 1655540163,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So this question is more in regards to the Indigenous of the United States and Canada particularly the Eastern Woodlands, Great Lakes and Mississippi Basin area. I am aware that the Mesoamericans and Andeans had abundant spices like chili, achiote, allspice etc. &lt;/p&gt;\n\n&lt;p&gt;But there is not much information about the Indigenous in other parts of the Americas. How did they make their foods flavorful. Are there any pre Colombian recipes for how exactly they used to prepare their food and what sorts of seasoning and herbs they used to make it taste good? Quite a few of them were sedentary and had taken up agriculture so surely they had elaborate ways of preparing foods&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/vewpu3/how_did_the_native_americans_season_their_foods/",
  "subreddit": "AskHistorians",
  "id": "vewpu3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So this question is more in regards to the Indigenous of the United States and\nCanada particularly the Eastern Woodlands, Great Lakes and Mississippi Basin\narea. I am aware that the Mesoamericans and Andeans had abundant spices like\nchili, achiote, allspice etc.\n\nBut there is not much information…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ですから、この質問は、どちらかというと、アメリカの先住民に関してであって\n特に東部森林地帯、五大湖、ミシシッピ川流域の先住民族についてです。\n地域についてです。メソアメリカ人やアンデス人が、チリ、アキオテ、オールスパイスなどのスパイスを豊富に使っていたことは知っています。\n唐辛子、アキオテ、オールスパイスなど。\n\nしかし、あまり情報がない。",
      "title": "アメリカ先住民はどのように味付けをしていたのか？彼らはどんな種類のスパイスや調味料を使っていたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，这个问题更多的是关于美国的本土和\n特别是东部林地、大湖区和密西西比河盆地\n地区。我知道中美洲人和安第斯人有丰富的香料，如\n辣椒、牛肝菌、五香粉等。\n\n但没有多少资料...",
      "title": "美国土著人是如何对他们的食物进行调味的？他们使用什么样的香料和调味品？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，這個問題更多的是關於美國的本土和\n特別是東部林地、大湖區和密西西比河盆地\n地區。我知道中美洲人和安第斯人有豐富的香料，如\n辣椒、牛肝菌、五香粉等。\n\n但沒有多少資料...",
      "title": "美國土著人是如何對他們的食物進行調味的？他們使用什麼樣的香料和調味品？"
    }
  ]
}