{
  "author": "donuz",
  "original_created_utc": 1632065929,
  "title": "My wife [29F] and I [28M] have sex about once a month. Is this normal?",
  "created_utc": 1632079329,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We are together for 5 years, married for about a year now. When we first met, we were having sex once almost every day, which gradually decreased. I bring up the subject a couple of times, saying I want this more often. She insists that it is not her fault and always something comes up. Moreover, she mentions bringing this topic frequently decreases her libido even more.</p>\n\n<p>Is it normal to have such a decrease in the amount of sex in a couple of years? Please help.</p>\n</div><!-- SC_ON -->",
  "score": 120,
  "permalink": "/r/NoStupidQuestions/comments/pra8w9/my_wife_29f_and_i_28m_have_sex_about_once_a_month/",
  "subreddit": "NoStupidQuestions",
  "id": "pra8w9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We are together for 5 years, married for about a year now. When we first met, we\nwere having sex once almost every day, which gradually decreased. I bring up the\nsubject a couple of times, saying I want this more often. She insists that it is\nnot her fault and always something comes up. Moreover,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "付き合って5年、結婚して1年ほどになります。私たちが初めて出会ったときは\nほぼ毎日1回はセックスしていましたが、徐々に減っていきました。私がその話題を持ち出すと\n私は何度かその話をして、もっと頻繁にしたいと言いました。彼女は自分のせいではないと言います。\n彼女は自分のせいではないと言い張り、いつも何かが起きてしまいます。さらに、...",
      "title": "妻[29F]と私[28M]は月1回程度のセックスをしています。これは普通のことですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们在一起5年了，现在结婚大约一年了。当我们第一次见面时，我们\n几乎每天都有一次性生活，后来逐渐减少。我提出了这个问题\n说我想更经常地这样做。她坚持说这不是\n她坚持说这不是她的错，而且总是有事情发生。此外，...",
      "title": "我的妻子[29F]和我[28M]大约每个月都有一次性生活。这正常吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們在一起5年了，現在結婚大約一年了。當我們第一次見面時，我們\n幾乎每天都有一次性生活，後來逐漸減少。我提出了這個問題\n說我想更經常地這樣做。她堅持說這不是\n她堅持說這不是她的錯，而且總是有事情發生。此外，...",
      "title": "我的妻子[29F]和我[28M]大約每個月都有一次性生活。這正常嗎？"
    }
  ]
}