{
  "author": "finallymadeareddit2",
  "original_created_utc": 1638765810,
  "title": "If we emerged into existence once, whose to say we can’t do it again or haven’t already before?",
  "created_utc": 1638820016,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I think about consciences and existence a lot, but one prevailing question I have is why do we assume (for the most part) we only get one life? And then after death there’s eternal nothingness? There was nothingness for me for over 13 billion years and yet suddenly here I am. So how do we know that 13 billion years after my death another instance of my consciousness could rise again? This is from a scientific perspective not religious.&lt;/p&gt;\n\n&lt;p&gt;Edit: To expand on this thought, maybe the reason we don’t remember our past lives is because we simply don’t have that body and it’s experiences anymore, but what we do retain is the deep down inner “you” that is behinds your thoughts, which is only experiencing the “now”&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/r9ysvb/if_we_emerged_into_existence_once_whose_to_say_we/",
  "subreddit": "askphilosophy",
  "id": "r9ysvb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I think about consciences and existence a lot, but one prevailing question I\nhave is why do we assume (for the most part) we only get one life? And then\nafter death there’s eternal nothingness? There was nothingness for me for over\n13 billion years and yet suddenly here I am. So how do we know that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "良心や存在について考えることが多いのですが、その中で最も大きな疑問があります。\nなぜ、私たちは（ほとんどの場合）一度きりの人生だと思い込んでいるのでしょうか。そして\n死後は永遠の無になるのでしょうか？私にとっての無は\n130億年経って、突然ここにいるんです。では、なぜそれが分かるのか...",
      "title": "もし人間が一度出現したならば、再び出現することができない、あるいは以前に出現していないと誰が言い切れるでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我经常思考良知和存在，但我有一个普遍的问题\n就是为什么我们认为（在大多数情况下）我们只有一次生命？然后\n死后就是永恒的虚无？对我来说，有超过130亿年的时间是虚无的\n130亿年，但突然间我就在这里了。那么我们怎么知道...",
      "title": "如果我们出现过一次，谁能说我们不能再做一次，或者以前没有做过？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我經常思考良知和存在，但我有一個普遍的問題\n就是爲什麼我們認爲（在大多數情況下）我們只有一次生命？然後\n死後就是永恆的虛無？對我來說，有超過130億年的時間是虛無的\n130億年，但突然間我就在這裏了。那麼我們怎麼知道...",
      "title": "如果我們出現過一次，誰能說我們不能再做一次，或者以前沒有做過？"
    }
  ]
}