{
  "author": "elnander",
  "the_new_excerpt": "Paprika is a powder that is made from ground dried red pepper, a cultivation\nthat was introduced to the Old World from Mexico. However, Hungary seems to be a\nmecca of paprika of sorts, in Hungary, paprika comes in lots of different\ngrades, paprika is a core component of many Hungarian dishes, salt…",
  "original_created_utc": 1620913502,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "パプリカは、メキシコから旧世界に伝わった栽培品種である赤唐辛子を乾燥させたものを粉砕した粉末である。\n旧世界ではメキシコから伝わった栽培方法です。しかし、ハンガリーはパプリカの聖地のようです。\nハンガリーでは、パプリカには様々なグレードがあり、ハンガリー料理にはパプリカが欠かせません。\nハンガリーでは、パプリカには様々なグレードがあり、パプリカは多くのハンガリー料理の中心的存在で、塩...",
      "title": "新大陸の食材である胡椒を主成分とするパプリカが、なぜハンガリー料理の代名詞となったのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "红辣椒是一种粉末，由干红辣椒研磨而成。\n从墨西哥引进到旧世界。然而，匈牙利似乎是一个\n在匈牙利，红辣椒有很多不同的等级。\n等级，辣椒粉是许多匈牙利菜肴的核心成分，盐...",
      "title": "红辣椒的主要成分是胡椒，是一种新世界的原料，它是如何成为匈牙利美食的代名词的呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "紅辣椒是一種粉末，由乾紅辣椒研磨而成。\n從墨西哥引進到舊世界。然而，匈牙利似乎是一個\n在匈牙利，紅辣椒有很多不同的等級。\n等級，辣椒粉是許多匈牙利菜餚的核心成分，鹽...",
      "title": "紅辣椒的主要成分是胡椒，是一種新世界的原料，它是如何成爲匈牙利美食的代名詞的呢？"
    }
  ],
  "title": "How did paprika, whose primary compound is pepper, a New World ingredient, become so synonymous with Hungarian cuisine?",
  "created_utc": 1620925745,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Paprika is a powder that is made from ground dried red pepper, a cultivation that was introduced to the Old World from Mexico. However, Hungary seems to be a mecca of paprika of sorts, in Hungary, paprika comes in lots of different grades, paprika is a core component of many Hungarian dishes, salt and paprika can be found tableside in Hungary, even the word paprika that we use is a borrowing from the Hungarian language. How did this spice find itself as a staple of Hungarian cuisine?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/nbgzb3/how_did_paprika_whose_primary_compound_is_pepper/",
  "subreddit": "AskHistorians",
  "id": "nbgzb3",
  "is_self": true,
  "media": null,
  "is_video": false
}