{
  "author": "SalmonApplecream",
  "the_new_excerpt": "Looking at the \"What do philosophers believe\" paper, we can see that there are\ncertain philosophical positions which seem to form majority positions in\nphilosophy. Examples of these are:\n\nA priori knowledge exists\n\nAnalytic-Synthetic distinction exists\n\nCompatibilism\n\nNon-Humean laws of…",
  "original_created_utc": 1616301451,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "观察 \"哲学家相信什么 \"这篇论文，我们可以看到有\n的某些哲学立场，这些立场似乎形成了大多数人的立场。\n哲学。例如：。\n\n先验知识的存在\n\n分析与合成的区别存在\n\n兼容性\n\n非休谟法则的...",
      "title": "为什么哲学中的一些立场会被哲学家们非常认可？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "觀察 \"哲學家相信什麼 \"這篇論文，我們可以看到有\n的某些哲學立場，這些立場似乎形成了大多數人的立場。\n哲學。例如：。\n\n先驗知識的存在\n\n分析與合成的區別存在\n\n兼容性\n\n非休謨法則的...",
      "title": "爲什麼哲學中的一些立場會被哲學家們非常認可？"
    }
  ],
  "title": "Why are some positions in philosophy very heavily accepted by philosophers?",
  "created_utc": 1616340983,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Looking at the &quot;What do philosophers believe&quot; paper, we can see that there are certain philosophical positions which seem to form majority positions in philosophy. Examples of these are:</p>\n\n<p>A priori knowledge exists</p>\n\n<p>Analytic-Synthetic distinction exists</p>\n\n<p>Compatibilism</p>\n\n<p>Non-Humean laws of nature</p>\n\n<p>Moral Realism</p>\n\n<p>Physicalism (about mind)</p>\n\n<p>Scientific realism</p>\n\n<p>All of these positions make up more than 50% of philosophers positions, but it seems to me, given my comparatively measly understanding of these topics, that there are not really very decisive or strong arguments that would sway a majority of philosophers in this way. Most surprising to me are the unanimity of scientific realism and compatibilism. How can we explain this phenomena? </p>\n\n<p>As I lean towards incompatiblism and scientific anti-realism myself, I tend to pause in my judgement when I see that most philosophers do not believe in these positions. Why do you think that most philosophers do believe in these positions. Are there really strong reasons and arguments to believe that these positions are correct, as the data would seem to suggest? Is it just that I am not familiar enough with these topics to have a firm grasp of what the right kind of position is? </p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/m9oiys/why_are_some_positions_in_philosophy_very_heavily/",
  "subreddit": "askphilosophy",
  "id": "m9oiys",
  "is_self": true,
  "media": null,
  "is_video": false
}