{
  "author": "caspertheasper",
  "the_new_excerpt": "I can't wait to watch SNL twenty years from now, filmed on Mars, recorded as an\nNFT, with the entire cast paid with the same crypto they once ridiculed.\n\nThe show just signaled how clueless the general public still is about crypto. I\nmean the general ignorance in the news skit, where they ask \"what…",
  "original_created_utc": 1620573014,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今から20年後、火星で撮影され、NFTとして録画されたSNLを見るのが待ち遠しいです。\n出演者全員がかつて嘲笑したのと同じ暗号で支払われている。\n\nこの番組は、一般の人々がいまだに暗号について無知であることを示している。I\nつまり、ニューススキットでの一般的な無知は、「What...",
      "title": "SNLは、私たちがまだいかに早いかを実感させてくれました。メインストリームはまだ全くの無知！？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我迫不及待地想看二十年后的《SNL》，在火星上拍摄，作为NFT录制。\nNFT，全体演员用他们曾经嘲笑过的加密货币支付报酬。\n\n这个节目只是标志着一般公众对加密货币仍然是多么无知。I\n我的意思是新闻短剧中的普遍无知，他们问 \"什么...\"。",
      "title": "SNL让我意识到我们仍然是多么的早。主流社会仍然是完全无知的!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我迫不及待地想看二十年後的《SNL》，在火星上拍攝，作爲NFT錄製。\nNFT，全體演員用他們曾經嘲笑過的加密貨幣支付報酬。\n\n這個節目只是標誌着一般公衆對加密貨幣仍然是多麼無知。I\n我的意思是新聞短劇中的普遍無知，他們問 \"什麼...\"。",
      "title": "SNL讓我意識到我們仍然是多麼的早。主流社會仍然是完全無知的!"
    }
  ],
  "title": "SNL made me realize just how early we still are: The Mainstream is Still Totally Clueless!",
  "created_utc": 1620613761,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I can&#39;t wait to watch SNL twenty years from now, filmed on Mars, recorded as an NFT, with the entire cast paid with the same crypto they once ridiculed.  </p>\n\n<p>The show just signaled how clueless the general public still is about crypto.  I mean the general ignorance in the news skit, where they ask &quot;what is cryptocurrency&quot; about a million times. Musk gives a cogent explanation but is nonetheless dismissed.  </p>\n\n<p><em>host: &quot;like, okay, for instance. This is a dollar. It&#39;s real....So what is Doge coin?&quot;</em></p>\n\n<p><em>also host: &quot;so it&#39;s a hustle?&quot;</em></p>\n\n<p>I&#39;m not here to defend Doge, but the show&#39;s general cluelessness about cryptocurrency signals that the general public is still in the dark about all of it. SNL exists to reflect national consensus - they reflect (and satirize) what&#39;s popular, accepted, and mainstream.  The show last night makes the argument that cryptocurrency is weird, eccentric, and fictive - this is how the vast majority of Americans still see it. And this is a good thing, because it means that despite institutional interest, crypto is till in it&#39;s infancy and has tons of room to grow.</p>\n\n<p>So for those who haven&#39;t been able to stack those sats yet, it&#39;s still soooo early.</p>\n</div><!-- SC_ON -->",
  "score": 220,
  "permalink": "/r/CryptoCurrency/comments/n8g52a/snl_made_me_realize_just_how_early_we_still_are/",
  "subreddit": "CryptoCurrency",
  "id": "n8g52a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985990908
}