{
  "author": "jam-hay",
  "the_new_excerpt": "As a avid follower and supporter of both crypto and musk, I don't think the Doge\nfans quite realise that he's taking them and all crypto for a sarcastic ride.\n\nIf you've followed Elon's thoughts on crypto you'll know he's long been a\ncynic.. even at a time when he was applying his cunning satire to…",
  "original_created_utc": 1612745200,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "作为加密和麝香的狂热追随者和支持者，我不认为Doge?\n粉丝们相当意识到，他是在讽刺他们和所有加密技术。\n\n如果你关注过Elon对加密技术的想法，你就会知道他早就是一个。\n愤世嫉俗... 即使是在他把他狡猾的讽刺应用于... ...",
      "title": "埃隆正在通过展示简单的推特就能把一个加密货币推到前十名的位置，来挖苦整个加密货币领域......而且这很有效。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲加密和麝香的狂熱追隨者和支持者，我不認爲Doge?\n粉絲們相當意識到，他是在諷刺他們和所有加密技術。\n\n如果你關注過Elon對加密技術的想法，你就會知道他早就是一個。\n憤世嫉俗... 即使是在他把他狡猾的諷刺應用於... ...",
      "title": "埃隆正在通過展示簡單的推特就能把一個加密貨幣推到前十名的位置，來挖苦整個加密貨幣領域......而且這很有效。"
    }
  ],
  "title": "Elon is trolling the full Cryptocurrency space by demonstrating that simply tweeting can push a crypto in to the top ten.. and it's working.",
  "created_utc": 1612755797,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As a avid follower and supporter of both crypto and musk, I don&#39;t think the Doge fans quite realise that he&#39;s taking them and all crypto for a sarcastic ride.</p>\n\n<p>If you&#39;ve followed Elon&#39;s thoughts on crypto you&#39;ll know he&#39;s long been a cynic.. even at a time when he was applying his cunning satire to make out he was a doge fan.</p>\n\n<p>Recently many could have been mistaken for thinking Elon has had a change in heart towards crypto.. I was the same.</p>\n\n<p>However his consistent shilling of Doge is making it clear that it&#39;s just Elon&#39;s warped sense of Twitter humour at play and by pumping doge in tweets he&#39;s just taking the piss out of doge and crypto at the same time.</p>\n\n<p>In someways he&#39;s correct.. when the world&#39;s richest man can pump a meme coin in to the top ten largest cap coins by simply tweeting.. it is slightly embarrassing.</p>\n\n<p>A lot of innocents are going to get burned when the doge gets an injection of reality putting it down.</p>\n\n<p>When that happens.. not one f**k by Mr Musk.. who doesn&#39;t hodl any crypto let alone doge.. will be given.</p>\n\n<p>As much as I admire the guy.. he is taking the piss out of crypto here.</p>\n</div><!-- SC_ON -->",
  "score": 808,
  "permalink": "/r/CryptoCurrency/comments/lf0167/elon_is_trolling_the_full_cryptocurrency_space_by/",
  "subreddit": "CryptoCurrency",
  "id": "lf0167",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123195577
}