{
  "author": "samybhai",
  "the_new_excerpt": "Node – A member of the Blockchain network.\n\nAddress – An address is a string of alphanumeric characters which identify an\nentity in the blockchain network. Used to send and receive cryptocurrency\ntransactions.\n\nDistributed ledger – A ledger which is maintained on many nodes in a\ndecentralized…",
  "original_created_utc": 1619542419,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ノード - ブロックチェーンネットワークのメンバーのこと。\n\nアドレス - ブロックチェーンネットワーク内のエンティティを識別する英数字の文字列であり\nブロックチェーンネットワーク内のエンティティを識別する英数字の文字列です。暗号通貨のトランザクションを送受信するために\nトランザクションの送受信に使用されます。\n\n分散型台帳 - 分散型ネットワークの多くのノードで管理される台帳。\n分散型の...",
      "title": "ここでは、トレーダーが理解すべき重要な暗号関連用語を紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "节点 - 区块链网络的一个成员。\n\n地址 - 地址是一串字母数字字符，用于识别区块链网络中的一个\n区块链网络中的实体。用来发送和接收加密货币\n交易。\n\n分布式账本 - 分布式账本是在区块链网络的许多节点上维护的。\n分布式账本 - 在一个去中心化的区块链网络中，在许多节点上维护的账本...",
      "title": "以下是每个交易员都应该了解的一些重要的加密货币相关术语。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "節點 - 區塊鏈網絡的一個成員。\n\n地址 - 地址是一串字母數字字符，用於識別區塊鏈網絡中的一個\n區塊鏈網絡中的實體。用來發送和接收加密貨幣\n交易。\n\n分佈式賬本 - 分佈式賬本是在區塊鏈網絡的許多節點上維護的。\n分佈式賬本 - 在一個去中心化的區塊鏈網絡中，在許多節點上維護的賬本...",
      "title": "以下是每個交易員都應該瞭解的一些重要的加密貨幣相關術語。"
    }
  ],
  "title": "Here are some of the important crypto related terms every trader should understand..",
  "created_utc": 1619572845,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Node –\nA member of the Blockchain network.</p>\n\n<p>Address –\nAn address is a string of alphanumeric characters which identify an entity in the blockchain network. Used to send and receive cryptocurrency transactions.</p>\n\n<p>Distributed ledger –\nA ledger which is maintained on many nodes in a decentralized network. The records are stored in a chronological order. This ledger can be of two types : Permissioned and Unpermissioned based on who has the access to view the ledger.</p>\n\n<p>Peer to peer–\nAlso short termed as P2P. As the name suggests, interactions that happen between two peers(parties/entities) in a highly interconnected network.</p>\n\n<p>Block –\nA block is a data structure that contains all the necessary metadata about the block(Block Header) itself and contains transactions. The first block in a blockchain is called the genesis block.</p>\n\n<p>block height –\nBlock height is the number of blocks connected in the blockchain. Block height is a usually measure of the amount of data in the blockchain.</p>\n\n<p>Blockchain –\nA chain of blocks which contain some metadata about the block, some transactions and joined to the previous block by the previous block’s hash value.</p>\n\n<p>Block explorer –\nA tool to see statistics of a block in a blockchain.  </p>\n\n<p>Hash –\nPerforming a hash function on the output data in a blockchain is termed as hash. Commonly used in sentences like “the hash of “geeksforgeeks file is 142c53v2v31vc1526v35v63v5v4”. Used in verifying cryptocurrency transactions.</p>\n\n<p>Hash rate –\nPerformance of a computer mining is measured in hashes per second or hash rate.</p>\n\n<p>Cryptographic hash function –\nA function that takes a variable-size input and output is a fixed-size unique value. SHA-256 algorithm is a cryptographic hash function example.</p>\n\n<p>Mining –\nProcess of solving a complex mathematical problem in order to attach the new block of transactions to the blockchain. This term is used in reference to blockchains that use Proof-of-Work as consensus mechanism. But general use of this term is prevalent too.</p>\n\n<p>Difficulty –\nHardness with which a new block of transactions can be connected to the blockchain. In Bitcoin, the difficulty is adjusted every 2016 blocks to keep the time of mining a new block at about 10 minutes.</p>\n\n<p>Block reward –\nReward that is given to the entity which connects the new block to the blockchain. In the case of Bitcoin, miners get a reward of 12.5 Bitcoins for attaching new block to the blockchain. In the case of Peercoin, minters get a reward of 42.64 (at the time of writing this article) Peercoins for attaching a new block of transactions to the blockchain.</p>\n\n<p>Crypto currency –\nA formal of digital asset which is regulated and transacted on the blockchain network. Encryption techniques are used to regulate the cryptocurrency, hence the name.</p>\n\n<p>Satoshi –\nThe smallest recordable unit of currency in the Bitcoin. Currently, a satoshi is numerically equal to 0.00000001 BTC.</p>\n\n<p>Altcoin –\nAn alternative to Bitcoin (ALTernative COIN).</p>\n\n<p>Wallet –\nA wallet is a file that contains the private keys of an entity. A wallet provides an interface to view and do transactions on the blockchain. Different wallets for different type of blockchains.</p>\n\n<p>Consensus –\nConsensus is a way for all the nodes in a network to agree on the shared state of the ledger (list of transactions). Some common consensus mechanisms are Raft, Paxos, Byzantine Fault Tolerance algorithm, Proof-of-Work(PoW), Proof-of-Stake (PoS), etc.</p>\n\n<p>Smart contract –\nA smart contract has details and permissions written in code that require an exact sequence of events to take place to trigger the agreement of the terms mentioned in the smart contract. It can also include the time constraints that can introduce deadlines in the contract. Also known as cryptocontract and digital contract. It was first put forward by Nick Szabo in 1994.</p>\n\n<p>Transaction –\nAn exchange of assets between two parties/entities.</p>\n\n<p>Transaction Fee –\nA part of the digital asset (cryptocurrency) that is charged from the parties who perform that transaction as a way to pay the networks who invest their resources in order to sustain the blockchain. In a proof of stake based blockchain (like Peercoin). the transaction fee is transferred to the minter/forger once he validates the new block of transactions successfully.</p>\n\n<p>Blockchain fork –\nAn act of blockchain software update which leads to splitting of a blockchain into two or more valid blockchains. There are three common types of forks in blockchain, namely, hard fork, soft fork, temporary/accidental fork.</p>\n\n<p>51% attack –\nAn attack in which a single organization (of entities) performs invalid activities on the blockchain network because they control 51% of the network’s resources. In the Bitcoin network, it refers to owning 51% of miners. In Peercoin, it refers to owning 51% of peercoins.</p>\n\n<p>Double Spend –\nAn act of using the same digital asset (cryptocurrency) twice. Its a common type of attack in blockchains. This type of attack becomes more difficult with increasing members that add the new block to the chain.</p>\n\n<p>Confirmation –\nThe confirmation is the act of successfully adding a transaction to the blockchain after verification. As a rule of thumb, more confirmations means more security against a double spend attack (permanency).</p>\n\n<p>Testnet –\nAs the name suggests, a Bitcoin test blockchain which is used by the network developers to carry out tests so that the main blockchain network is not affected. Assets in a testnet do not have any value. There have been three generations of testnet at the time of writing this article i.e., Testnet1, Testnet2, Testnet3 (currently).</p>\n\n<p>dApp –\nFull form : decentralized Application. An application that is open sourced which is operated anonymously and has its data stored on a blockchain. It must have some kind of incentive for the members who help to construct the blockchain.</p>\n\n<p>ASIC –\nFull form : Application Specific Intergrated Circuit. These are a type of computers which are designed for performing a special task. In the case of Bitcoin, ASIC computers are used to solve SHA-256 hashing problem which help to connect the new blocks to the blockchain.</p>\n\n<p>Edit (thanks for reminding me this in comments) - a zero-knowledge proof or zero-knowledge protocol is a method by which one party (the prover) can prove to another party (the verifier) that they know a value x, without conveying any information apart from the fact that they know the value x.</p>\n\n<p>I know its long but you gotta understand this terms if you invest in crypto..</p>\n\n<p>Hope i helped any newbie out there..</p>\n</div><!-- SC_ON -->",
  "score": 286,
  "permalink": "/r/CryptoCurrency/comments/mzsx7a/here_are_some_of_the_important_crypto_related/",
  "subreddit": "CryptoCurrency",
  "id": "mzsx7a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776212028
}