{
  "author": "JayT1D",
  "original_created_utc": 1632882606,
  "title": "Why are men in western countries half as fertile today as they were in the 1970's? What is the biggest contributor to this recent Male Fertility Crisis?",
  "created_utc": 1632899838,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just saw this short Vice documentary called <a href=\"https://www.youtube.com/watch?v=yVyzjEF_sKw\">Spermageddon</a> that talked about the Male Fertility Crisis.</p>\n\n<p>The video referenced a <a href=\"https://academic.oup.com/humupd/article/23/6/646/4035689\">meta analysis</a> quoted below in an <a href=\"https://www.theguardian.com/lifeandstyle/2017/jul/25/sperm-counts-among-western-men-have-halved-in-last-40-years-study\">article</a> in The Guardian.</p>\n\n<blockquote>\n<p>The study, published in the journal <a href=\"https://academic.oup.com/humupd/article-lookup/doi/10.1093/humupd/dmx022\">Human Reproduction Update</a> by an international team of researchers, drew on 185 studies conducted between 1973 and 2011, involving almost 43,000 men. The team split the data based on whether the men were from western countries – including Australia and New Zealand as well as countries in North America and Europe – or from elsewhere.<br/>\nAfter accounting for factors including age and how long men had gone without ejaculation, the team found that sperm concentration fell from <strong>99 million per ml in 1973 to</strong> <strong><em>47.1</em></strong> <strong>million per ml in 2011 – a decline of 52.4</strong>% – among western men unaware of their fertility.<br/>\nFor the same group, <strong>total sperm count – the number of sperm in a semen sample – fell by just under 60%.</strong><br/>\nRichard Sharpe, an expert in male reproductive health and professor at the University of Edinburgh, welcomed the study, saying the research has tackled many of the problems of previous analyses, adding that it “<strong>is about as close as we are going to get</strong>” to being sure of the decline.<br/>\nBut <strong>he stressed it still unclear what is behind the drop</strong>, meaning that it is difficult to address. “That is primarily because we have seriously under-invested in male reproductive research,” he said.</p>\n</blockquote>\n\n<p>The Vice video showed an interview with Epidemiologist Dr. Shanna Swan of the Icahn School of Medicine, who said that sperm concentration is falling on average about 1% per year. She said that <a href=\"https://youtu.be/yVyzjEF_sKw?t=149\">when sperm concentration drops below <em>40</em> million per ml, you start to have trouble conceiving</a>.</p>\n\n<p>The Vice video mentioned some <em>suspected</em> reasons for male fertility problems like</p>\n\n<ul>\n<li>increased exposure to endocrine disruptors like plastics</li>\n<li>poor quality/quantity of sleep</li>\n<li>poor diet</li>\n</ul>\n\n<p>So, experts are saying it&#39;s unclear what&#39;s behind the Spermageddon, but I don&#39;t buy it. Some questions I have:</p>\n\n<ol>\n<li>What has changed since the 1970&#39;s that is contributing to male infertility?</li>\n<li>What is the largest contributor to male infertility today?</li>\n<li>What were men 40 years ago doing that was making them more fertile than men today?</li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 178,
  "permalink": "/r/askscience/comments/pxlvi0/why_are_men_in_western_countries_half_as_fertile/",
  "subreddit": "askscience",
  "id": "pxlvi0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I just saw this short Vice documentary called Spermageddon\n[https://www.youtube.com/watch?v=yVyzjEF_sKw] that talked about the Male\nFertility Crisis.\n\nThe video referenced a meta analysis\n[https://academic.oup.com/humupd/article/23/6/646/4035689] quoted below in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Spermageddon」というViceの短編ドキュメンタリーを見ました。\n[https://www.youtube.com/watch?v=yVyzjEF_sKw]という、男性の\nFertility Crisis（男性不妊の危機）について語っています。\n\nこのビデオでは、あるメタ分析を参照しています。\n[https://academic.oup.com/humupd/article/23/6/646/4035689]を引用しています。",
      "title": "欧米諸国の男性の生殖能力が1970年代と比べて半分になったのはなぜ？近年の男性不妊の危機の最大の原因は何でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚看到了这部名为《精子末日》的副部级短纪录片\n[https://www.youtube.com/watch?v=yVyzjEF_sKw]，其中谈到了男性\n生育危机。\n\n该视频引用了一项元分析\n[https://academic.oup.com/humupd/article/23/6/646/4035689] 下面引用的是...",
      "title": "为什么今天西方国家的男性生育能力只有1970年代的一半？造成最近这种男性生育危机的最大因素是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛看到了這部名爲《精子末日》的副部級短紀錄片\n[https://www.youtube.com/watch?v=yVyzjEF_sKw]，其中談到了男性\n生育危機。\n\n該視頻引用了一項元分析\n[https://academic.oup.com/humupd/article/23/6/646/4035689] 下面引用的是...",
      "title": "爲什麼今天西方國家的男性生育能力只有1970年代的一半？造成最近這種男性生育危機的最大因素是什麼？"
    }
  ]
}