{
  "author": "Catharsistic",
  "the_new_excerpt": "Watch out for hedge funds \"Bull Trap\".\n\nHello friends,I just wanted to start by saying that I believe AMC & GME to be\nunder value at current prices and covid restrictions as well as NYC AMC opening\nback up. NOW as we all know by now roughly about 120k+ (12 million+ shares) call\noptions expired In…",
  "original_created_utc": 1614524170,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "警惕对冲基金的 \"牛市陷阱\"。\n\n朋友们好，我只想先说，我认为AMC和GME在目前的价格上是低价值的，而且受到限制。\n在目前的价格下，我认为AMC和GME的价值是很低的，而且有很多限制，以及纽约AMC的开业\n涨。现在我们都知道，现在大约有12万+（1200万+股）的看涨期权\n期权过期 在...",
      "title": "凸轮轴的 \"公牛陷阱\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "警惕對沖基金的 \"牛市陷阱\"。\n\n朋友們好，我只想先說，我認爲AMC和GME在目前的價格上是低價值的，而且受到限制。\n在目前的價格下，我認爲AMC和GME的價值是很低的，而且有很多限制，以及紐約AMC的開業\n漲。現在我們都知道，現在大約有12萬+（1200萬+股）的看漲期權\n期權過期 在...",
      "title": "凸輪軸的 \"公牛陷阱\""
    }
  ],
  "title": "AMC \"BULL TRAP\"",
  "created_utc": 1614573217,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Watch out for hedge funds &quot;Bull Trap&quot;.</p>\n\n<p>Hello friends,I just wanted to start by saying that I believe AMC &amp; GME to be under value at current prices and covid restrictions as well as NYC AMC opening back up.     NOW as we all know by now roughly about 120k+ (12 million+ shares) call options expired In The Money on Feb 26 at $8.01. The street sentiment is that AMC&#39;s price will be rising on Monday because the number of shares needed to brought to covered call options expired ITM. Fundamentally speaking that&#39;s how the price of a security goes up, buy buy and more buying, there is no exception here. If the price of AMC goes down by 20% after the HF brought million of shares to cover their calls that really wouldn&#39;t make any sense at all. That only explanation is the HF&#39;s decided to HOLDOUT for a few days so they can ladder attack to lower the price before buying million of shares to cover their calls.</p>\n\n<p>Let just assumed that price spike up to between $15-$20 on Monday, this is an HF&#39;s &quot;Bull Trap&quot; so DO NOT FALL FOR IT &amp; DO NOT SELL your shares, they will be able to use your shares to increase their short interest attacks and continues their ladder attack as well. We need to decrease the number of shares available in the float NOT increase it, by selling your shares you actually increasing it. It is very important to decrease the number of shares available in the float, that&#39;s how you trigger the &quot;Short Squeeze&quot;. Why would the HF&#39;s buy shares from us at $100 if they can just buy it from the float at $10 or $15 to cover their short interest? Would you?</p>\n\n<p>Example:</p>\n\n<p>On January 27th AMC shares jumped 300% from $4.97 to $19.90 in one day. What was the reason behind this movement? AMC raising $900 million in the week before or the CEO announcing bankruptcy is off the table? the answer is none of it, it was the classic HF&#39;s bull trap, the hf was losing so much money in GameStop they needed to make money somewhere else, they intentionally put money into AMC to raise the price so retail investors would jump in at $14-$19 thinking the price would continue to go up. We all know what happened next, AMC tanked 65% the following day and people who brought AMC in at $14-$19 were trapped, hint the &quot;bull trap&quot;.</p>\n\n<p>I don&#39;t know what will happen on Monday, none of us do, hopefully, AMC price will rise to $10-$11, but do NOT FALL for the Bull Trap if the price rises to $15 or $20 if you sell your shares kiss goodbye to the short squeeze. Why do you think the HF vs retail investors were battling it out over 1 cent on Friday? Literally, it was down to the last minute. Those 120k+ call options were the catalyst that we needed to pressure the hf to buyback 10 of million of shares to cover their short interest.</p>\n\n<p>&quot;(Reuters) - The U.S. government on Saturday authorized Johnson &amp; Johnson’s single-dose COVID-19 vaccine, enabling millions more Americans to be vaccinated in the coming weeks and setting the vaccine up for additional approvals around the world.&quot;</p>\n\n<p>The approval of Johnson &amp; Johnson’s single-dose COVID-19 vaccine couldn&#39;t happen at a better time for AMC shareholders. The last time vaccines from Pfizer/BioNTech were authorized back on November 7th AMC shoots up to 90% and closed over 50% for the day. All the weeds, airlines, hotels, and housing-related stocks were also up 20%-30% as well.</p>\n\n<p>A new vaccine approved and millions of shares buyback, it will be very interesting how this played out on Monday.</p>\n\n<p>Do NOT Sell my friends.</p>\n</div><!-- SC_ON -->",
  "score": 1417,
  "permalink": "/r/wallstreetbets/comments/luhvqd/amc_bull_trap/",
  "subreddit": "wallstreetbets",
  "id": "luhvqd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937752784
}