{
  "author": "MH4OH",
  "original_created_utc": 1637712016,
  "title": "AMA on r/cryptocurrency is LIVE 8PM ET! I'm Morgan Harper US Senate Candidate for Ohio. Ask Me Anything about my interest in crypto. I see potential for crypto to reverse the trend of power moving from places like Ohio to places like Silicon Valley by creating economic freedom for middle America.",
  "created_utc": 1637736313,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m Morgan Harper, candidate for the United States Senate for Ohio. I am a consumer protection attorney and community organizer from Columbus. My politics is pretty straight forward: I fight corporate power to create economic freedom for everyone. To prove that, I don’t take corporate PAC money. My interest in crypto started back in 2011 as a Senior Advisor at the Consumer Financial Protection Bureau (founded by Elizabeth Warren) when pioneers in the industry where presenting the technology to us. I didn&#39;t take seriously then but I&#39;ve started to really explore its potential to create economic power for people in places like Ohio.</p>\n\n<p>I recently posted two threads on crypto you can see here:</p>\n\n<ol>\n<li><a href=\"https://twitter.com/mh4oh/status/1458064822772375565?s=20\">https://twitter.com/mh4oh/status/1458064822772375565?s=20</a></li>\n<li><a href=\"https://twitter.com/mh4oh/status/1463219384776806402?s=20\">https://twitter.com/mh4oh/status/1463219384776806402?s=20</a></li>\n</ol>\n\n<p>My full bio is below.</p>\n\n<p>I was born at The Ohio State University Hospital to a teenager who couldn’t raise me. I lived in a foster home just north of Columbus before being adopted and raised by a Columbus Public Schools teacher who had immigrated to Ohio from Trinidad. My mother, a single-mom, raised me and my brother while going through a bitter divorce that always had us on edge emotionally and financially. But my mother had a stable union job and so whatever energy she had left, she poured it into my education. I got scholarships to attend Columbus Academy and graduated from Tufts, Princeton and Stanford Law School. I then went to work in Washington under the Obama Administration and became a Senior Advisor at the Consumer Financial Protection Bureau. While I was there I went after big banks that were ripping off working people. We sued companies like Wells Fargo for opening fake bank accounts in their customers’ names. </p>\n\n<p>In 2020 I ran for U.S.Congress and although we didn’t win (fuck Covid), we used the grassroots momentum to launch Columbus Stand Up! a community organization that mobilized volunteers across Central Ohio to go door-to-door to distribute 30K masks and drive hundreds of vulnerable people to their vaccine appointments. </p>\n\n<p>While we did great work there one thing continued to stick with me. We know what it would take to protect communities from falling behind. We don’t have an ideas problem. We don’t have a policy problem. <strong>We have a politician problem</strong>.</p>\n\n<p>Only two democrats have won statewide in Ohio in the last two decades at the federal level, Barack Obama (2x) and Sherrod Brown. Only way to win Ohio is to turn out 15% of the Black vote. That won’t happen running a Terry McAuliffe type Democrat in Ohio. That’s why I’m running - to win and put the power of our people at the center of our government. </p>\n\n<p>Looking forward to the discussion.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/ct9ReBw0Gb5S7_V6N5wc7rjMvWgG2HjOpDA5_2GAk4E.jpg?auto=webp&s=eb27ecfb24f3e800ff28f64970f9acc1b6d6d616",
          "width": 140,
          "height": 140
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/ct9ReBw0Gb5S7_V6N5wc7rjMvWgG2HjOpDA5_2GAk4E.jpg?width=108&crop=smart&auto=webp&s=38da6347dab2ed45186028fc55fa5085c87a1b62",
            "width": 108,
            "height": 108
          }
        ],
        "variants": {},
        "id": "yqbb8XtydH2nFGZN-qGGGJij_myFsrK0NU0OHfRfiWA"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/r0r0k8/ama_on_rcryptocurrency_is_live_8pm_et_im_morgan/",
  "subreddit": "CryptoCurrency",
  "id": "r0r0k8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m Morgan Harper, candidate for the United States Senate for Ohio. I am a\nconsumer protection attorney and community organizer from Columbus. My politics\nis pretty straight forward: I fight corporate power to create economic freedom\nfor everyone. To prove that, I don’t take corporate PAC money. My…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はモーガン・ハーパー、オハイオ州の合衆国上院議員候補です。私は\n消費者保護の弁護士であり、コロンバスのコミュニティ・オーガナイザーです。私の政治は\n非常に率直なものです 私は、すべての人に経済的自由をもたらすために、企業の力と戦います。\nみんなのために。それを証明するために、私は企業のPAC資金を受け取りません。私の...",
      "title": "r/cryptocurrencyでのAMAはLIVE 8PM ET! モーガン・ハーパー米国オハイオ州上院議員候補です。私の暗号への関心について何でも聞いてください。私は、オハイオ州のような場所からシリコンバレーのような場所に権力が移っていく傾向を、中米に経済的自由をもたらすことで、暗号が逆転させる可能性があると考えています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是摩根-哈珀，俄亥俄州美国参议院的候选人。我是一名\n来自哥伦布市的消费者保护律师和社区组织者。我的政治\n是相当直接的。我与企业权力作斗争，为每个人创造经济自由\n为每个人创造经济自由。为了证明这一点，我不接受企业的PAC资金。我的...",
      "title": "美国东部时间8点，r/cryptocurrency的AMA直播! 我是摩根-哈珀美国俄亥俄州参议员候选人。关于我对加密货币的兴趣，可以问我任何问题。我认为加密货币有可能通过为美国中部地区创造经济自由来扭转权力从俄亥俄州等地向硅谷等地转移的趋势。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是摩根-哈珀，俄亥俄州美國參議院的候選人。我是一名\n來自哥倫布市的消費者保護律師和社區組織者。我的政治\n是相當直接的。我與企業權力作鬥爭，爲每個人創造經濟自由\n爲每個人創造經濟自由。爲了證明這一點，我不接受企業的PAC資金。我的...",
      "title": "美國東部時間8點，r/cryptocurrency的AMA直播! 我是摩根-哈珀美國俄亥俄州參議員候選人。關於我對加密貨幣的興趣，可以問我任何問題。我認爲加密貨幣有可能通過爲美國中部地區創造經濟自由來扭轉權力從俄亥俄州等地向硅谷等地轉移的趨勢。"
    }
  ]
}