{
  "author": "gnarley_quinn",
  "original_created_utc": 1641080727,
  "title": "The crypto market might be making things difficult for you right now, but remember you are already more fortunate than 90% of the planet because you are in it.",
  "created_utc": 1641145588,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s hard. Red day after day, small gain, then large drop, small recovery, then another drop. I understand. We here are all experiencing it together. &lt;/p&gt;\n\n&lt;p&gt;But remember, this sub is an echochamber that makes crypto appear that adoption is almost ubiquitous. It&amp;#39;s not. Most of the planet is still not in crypto. Most think its still a scam,or scary, or for criminals, or a bubble, or a Ponzi, or just plain useless. &lt;/p&gt;\n\n&lt;p&gt;The fact that you are here now, even in 2022, you are still one of the earliest adopters. Whether you are up 100k, or down 40%, in a few years it simply won&amp;#39;t matter. We will all be massively up. &lt;/p&gt;\n\n&lt;p&gt;By the year 2030, the same people that think you&amp;#39;re an idiot will say:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;I can&amp;#39;t believe you bought when it was less than 60k! You are so insanely lucky!&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re along for the ride at the moment, and most of the planet is still queued up at the Hotdog stand paying with their FIAT. They&amp;#39;ll join us on the ride eventually, but they still think its far too risky, and not worth giving up their current lifestyle choices. Meanwhile, we&amp;#39;re having the time of our lives seeing a never ending unpredictable path of turns, drops, climbs, twists, rises and falls. &lt;/p&gt;\n\n&lt;p&gt;So, we can call each other dumb for backing X coin, being a maxi, or not diversifying, or forgetting to DCA, but in the end it doesn&amp;#39;t matter. Crypto is inevitable, and will change the world, and most people still don&amp;#39;t even realise that. &lt;/p&gt;\n\n&lt;p&gt;You are one lucky bastard.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 548,
  "permalink": "/r/CryptoCurrency/comments/rtvy02/the_crypto_market_might_be_making_things/",
  "subreddit": "CryptoCurrency",
  "id": "rtvy02",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It's hard. Red day after day, small gain, then large drop, small recovery, then\nanother drop. I understand. We here are all experiencing it together.\n\nBut remember, this sub is an echochamber that makes crypto appear that adoption\nis almost ubiquitous. It's not. Most of the planet is still not in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s hard. 連日の赤、微増。\nそして大きく下がり、小さく回復し、また下がる。わかりますよ。ここにいる私たちは\nを一緒に体験しています。</p> <p>しかし、このサブはエコーチェンバーであることを忘れないでください。\n暗号がほとんど普及しているように見せかけるために...。",
      "title": "暗号市場は今、あなたにとって難しい状況かもしれませんが、あなたがその中にいることで、すでに地球の90％よりも幸運であることを思い出してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "<！--SC_OFF --><div class=\"md\"><p>这很难。日复一日的红色，小有收获。\n然后大跌，小幅回升，然后又大跌。我理解。我们在这里是\n一起经历的。</p> <p>但请记住，这个子是一个回声室\n使得加密货币的采用似乎几乎无处不在....。",
      "title": "现在的加密货币市场可能让你很难受，但记住你已经比地球上90%的人更幸运，因为你在其中。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "<！--SC_OFF --><div class=\"md\"><p>這很難。日復一日的紅色，小有收穫。\n然後大跌，小幅回升，然後又大跌。我理解。我們在這裏是\n一起經歷的。</p> <p>但請記住，這個子是一個回聲室\n使得加密貨幣的採用似乎幾乎無處不在....。",
      "title": "現在的加密貨幣市場可能讓你很難受，但記住你已經比地球上90%的人更幸運，因爲你在其中。"
    }
  ]
}