{
  "author": "CoolCoolPapaOldSkool",
  "original_created_utc": 1635849488,
  "title": "Ethereum breaks its ATH again and it's just the beginning",
  "created_utc": 1635859841,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Etherum is currently trading at $4470.  I know that this was expected to happen sooner or later, but it also clarifies those new investors who are misled by the recent wave of shitcoins hitting the market. </p>\n\n<p>Why do I think that ETH2.0 will be a game-changer?</p>\n\n<p><strong>Scalability</strong></p>\n\n<p>Ethereum 2.0 upgrade will improve the network significantly. Ethereum 2.0 is expected to support 1000s of transactions per second, to make applications faster and cheaper to use, thus making the network more scalable.</p>\n\n<p><strong>Sustainability</strong></p>\n\n<p>Ethereum 2.0 is also planning to move from the current Proof of Work protocol to Proof of Stake. This upgrade will address one of the major concerns associated with energy-sensitive crypto mining and shift towards environment-friendly, greener technology.</p>\n\n<p><strong>Gas Fees</strong></p>\n\n<p>One of the major deterrents for any new investor to invest in Ethereum or make transactions on the ethereum network; is the high Gas fees. Sharding will increase the number of transactions on the network, addressing congestion issues and reducing the transaction fees.</p>\n\n<p>My humble prediction for Etherum is $6000 by the end of November; what&#39;s yours?</p>\n</div><!-- SC_ON -->",
  "score": 338,
  "permalink": "/r/CryptoCurrency/comments/ql1do9/ethereum_breaks_its_ath_again_and_its_just_the/",
  "subreddit": "CryptoCurrency",
  "id": "ql1do9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Etherum is currently trading at $4470. I know that this was expected to happen\nsooner or later, but it also clarifies those new investors who are misled by the\nrecent wave of shitcoins hitting the market.\n\nWhy do I think that ETH2.0 will be a game-changer?\n\nScalability\n\nEthereum 2.0 upgrade will…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Etherumは現在4470ドルで取引されています。遅かれ早かれこうなることは予想されていたことですが\n遅かれ早かれこうなることは予想されていましたが、最近市場に出回っているシットコインに惑わされている新しい投資家を明確にするものでもあります。\nまた、最近市場に出回っているシットコインの波に惑わされている新しい投資家を明確にします。\n\nETH2.0がゲームチェンジャーになると思う理由は？\n\nスケーラビリティー\n\nイーサリアム2.0のアップグレードは...",
      "title": "イーサリアムが再びATHを破り、それは始まりに過ぎない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "以太坊目前的交易价格为4470美元。我知道，这种情况预计会发生\n迟早会发生，但它也澄清了那些被最近的狗屎币浪潮误导的新投资者。\n最近一波狗屎币冲击市场的新投资者。\n\n为什么我认为ETH2.0会改变游戏规则？\n\n可扩展性\n\n以太坊2.0的升级将...",
      "title": "以太坊再次打破其ATH，这只是个开始"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "以太坊目前的交易價格爲4470美元。我知道，這種情況預計會發生\n遲早會發生，但它也澄清了那些被最近的狗屎幣浪潮誤導的新投資者。\n最近一波狗屎幣衝擊市場的新投資者。\n\n爲什麼我認爲ETH2.0會改變遊戲規則？\n\n可擴展性\n\n以太坊2.0的升級將...",
      "title": "以太坊再次打破其ATH，這只是個開始"
    }
  ]
}