{
  "author": "Low-Swimming9249",
  "the_new_excerpt": "Reason I ask is because I saw someone write here once that, “if you’re\ninterested in Philosophy as a hobby, don’t get into this field.” Something along\nthose lines. Said that it took away from actual philosophizing and instead\nprovided too much distraction, though I think he may have been being a…",
  "original_created_utc": 1622330808,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜ聞くかというと、以前ここで「趣味で哲学に興味があるなら\n趣味で哲学に興味があるなら、この分野には入らない方がいい」と書いているのを見たからです。そのような内容の\nそのような内容でした。実際の哲学から遠ざかり、かえって気が散ってしまうと。\nあまりにも多くの気晴らしを提供していると言っていましたが、それは...",
      "title": "職業としての学術哲学とは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我问的原因是，我看到有人曾在这里写道，\"如果你对哲学感兴趣是一种爱好，就不要进入这个领域。\n对哲学感兴趣，就不要进入这个领域\"。类似于\n这些话。他说，这使人远离了实际的哲学研究，而是\n提供了太多的分心，尽管我认为他可能是在...",
      "title": "作为一种职业，学术哲学是怎样的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我問的原因是，我看到有人曾在這裏寫道，\"如果你對哲學感興趣是一種愛好，就不要進入這個領域。\n對哲學感興趣，就不要進入這個領域\"。類似於\n這些話。他說，這使人遠離了實際的哲學研究，而是\n提供了太多的分心，儘管我認爲他可能是在...",
      "title": "作爲一種職業，學術哲學是怎樣的？"
    }
  ],
  "title": "What is Academic Philosophy like as a Profession?",
  "created_utc": 1622373961,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Reason I ask is because I saw someone write here once that, “if you’re interested in Philosophy as a hobby, don’t get into this field.” Something along those lines. Said that it took away from actual philosophizing and instead provided too much distraction, though I think he may have been being a little too tough on it.</p>\n\n<p>Another guy said something interesting as well, which was something along the lines of “no one will actually read your work unless you’re basically the at the top level.”</p>\n\n<p>Both of these are genuine concerns, but they don’t bother me that much. I guess my biggest fear is whether it functions well as a profession. Is it a fulfilling job for you, and if so, why?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/nnyswm/what_is_academic_philosophy_like_as_a_profession/",
  "subreddit": "askphilosophy",
  "id": "nnyswm",
  "is_self": true,
  "media": null,
  "is_video": false
}