{
  "author": "redditsgarbageman",
  "original_created_utc": 1635903233,
  "title": "I wish more people would talk about investing in terms of percentage of their income instead of dollar amount. That’s a much better indicator of risk.",
  "created_utc": 1635913922,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If someone comes a long and says “I invested $10k in (whatever coin)”, that may sound like someone really believes  in that coin, but that may also be a very insignificant amount of money to them. I want to know what kind of risk people are taking. How much does this money mean to you? I think people are lost in dollar amounts. I see people here asking all the time “Is it worth buying $100 of Bitcoin?” I have no idea. What is $100 worth to you? If you believe BTC will double and $100 is your net worth, than you’re going to double your net worth. </p>\n\n<p>How much you spend on a particular coin is largely irrelevant. You need to be focused on what percentage of your income that risk represents. That’s how you factor risk. Comparing your dollars to someone else can be completely meaningless if their net worth is drastically different than yours. I think it would be great if more people were saying “I invested 5% of my monthly income into X”. That’s much more of an indication of how they really feel about it.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/qljnag/i_wish_more_people_would_talk_about_investing_in/",
  "subreddit": "CryptoCurrency",
  "id": "qljnag",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If someone comes a long and says “I invested $10k in (whatever coin)”, that may\nsound like someone really believes in that coin, but that may also be a very\ninsignificant amount of money to them. I want to know what kind of risk people\nare taking. How much does this money mean to you? I think people…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もし誰かが「私は（どんなコインでも）10kドルを投資しました」と言ってきたら、それは誰かが本当に投資しているように聞こえるかもしれません。\nそのコインを本当に信じているように聞こえるかもしれませんが、その人にとってはとても些細な金額かもしれません。\nその人にとっては非常に些細な金額かもしれません。私が知りたいのは、人々がどのようなリスクを\n取っているのかを知りたい。あなたにとって、このお金はどれほどの意味があるのでしょうか？私は、人々が...",
      "title": "もっと多くの人が、投資について、金額ではなく、収入に対する割合で語ってほしいですね。その方がリスクの指標としてははるかに優れていると思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果有人说：\"我在（什么硬币）上投资了1万美元\"，这听起来像是一个人真的相信这个硬币。\n听起来好像某人真的相信那枚硬币，但这也可能是一个非常\n但对他们来说，这也可能是一笔微不足道的钱。我想知道人们正在承担什么样的风险\n正在承担的风险。这笔钱对你有多大意义？我认为人们...",
      "title": "我希望更多的人能够以收入的百分比而不是美元数额来谈论投资。那是一个更好的风险指标。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果有人說：\"我在（什麼硬幣）上投資了1萬美元\"，這聽起來像是一個人真的相信這個硬幣。\n聽起來好像某人真的相信那枚硬幣，但這也可能是一個非常\n但對他們來說，這也可能是一筆微不足道的錢。我想知道人們正在承擔什麼樣的風險\n正在承擔的風險。這筆錢對你有多大意義？我認爲人們...",
      "title": "我希望更多的人能夠以收入的百分比而不是美元數額來談論投資。那是一個更好的風險指標。"
    }
  ]
}