{
  "author": "sonicgear1",
  "original_created_utc": 1639204499,
  "title": "Bank blocks account after buying BTC",
  "created_utc": 1639237148,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Today I received a letter from my bank noting that my account has been blocked due to money laundering and terrorism financing laws. This came just a few hours after purchasing bitcoin on cex.io. This is not the first time i bough btc there, but the total amount is rather small, about three hundred usd. &lt;/p&gt;\n\n&lt;p&gt;Now I will have to go and talk to them, and they are asking for further personal documents.&lt;/p&gt;\n\n&lt;p&gt;What strategy would be the best to use here? Thanks for the advice.&lt;/p&gt;\n\n&lt;p&gt;Edit: The bank is UniCredit and I cannot cancel it because my country pays out stipends only via this bank. Talk about monopoly.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 176,
  "permalink": "/r/Bitcoin/comments/rdtoar/bank_blocks_account_after_buying_btc/",
  "subreddit": "Bitcoin",
  "id": "rdtoar",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Today I received a letter from my bank noting that my account has been blocked\ndue to money laundering and terrorism financing laws. This came just a few hours\nafter purchasing bitcoin on cex.io. This is not the first time i bough btc\nthere, but the total amount is rather small, about three hundred…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、銀行から私の口座がブロックされたことを知らせる手紙が届きました。\nマネーロンダリングとテロ資金調達の法律が原因です。これは、わずか数時間のことでした。\ncex.ioでビットコインを購入した後です。ビットコインを購入したのはこれが初めてではありません。\nしかし、総額は300ドル程度と少ない...。",
      "title": "BTCを購入した銀行が口座をブロック"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天，我收到了我的银行的一封信，指出我的账户已经被封锁了\n由于洗钱和资助恐怖主义的法律，我的账户已被冻结。这只是在我在cex.io上购买比特币的几个小时后\n在cex.io上购买了比特币。这并不是我第一次在那里购买比特币\n但总金额相当小，大约300...",
      "title": "购买BTC后银行封锁账户"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天，我收到了我的銀行的一封信，指出我的賬戶已經被封鎖了\n由於洗錢和資助恐怖主義的法律，我的賬戶已被凍結。這只是在我在cex.io上購買比特幣的幾個小時後\n在cex.io上購買了比特幣。這並不是我第一次在那裏購買比特幣\n但總金額相當小，大約300...",
      "title": "購買BTC後銀行封鎖賬戶"
    }
  ]
}