{
  "author": "Odlavso",
  "original_created_utc": 1650825872,
  "title": "If you knowingly participate in a rug pull, get rich quick scheme or any other type of crypto scam with the hopes of cashing out early and leaving others holding the bag you're just as bad as the creators of said scam.",
  "created_utc": 1650861561,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Basically what the title says.  &lt;/p&gt;\n\n&lt;p&gt;If you are knowingly participating in a project and promoting it with the sole intention of pumping your bags so you can leave others holding a worthless coin/token, you&amp;#39;re just as shitty as the creators of said scam.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying if you unknowingly bought into a project and sold for some profit before it got rugged you&amp;#39;re shitty, I think at that point you were just lucky. But trying to get others to buy into something when you already know it&amp;#39;s a quick rich scheme makes you a shitty person.  &lt;/p&gt;\n\n&lt;p&gt;You can compare it to people who promote pyramid schemes because they got tricked into it by others and want to continue the scam so they won&amp;#39;t be idiots at the end.  &lt;/p&gt;\n\n&lt;p&gt;TLDR: if you knowingly promote a scam to make some money for yourself, you are just as bad as the people who created the scam.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 312,
  "permalink": "/r/CryptoCurrency/comments/ub1ch9/if_you_knowingly_participate_in_a_rug_pull_get/",
  "subreddit": "CryptoCurrency",
  "id": "ub1ch9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Basically what the title says.\n\nIf you are knowingly participating in a project and promoting it with the sole\nintention of pumping your bags so you can leave others holding a worthless\ncoin/token, you're just as shitty as the creators of said scam.\n\nI'm not saying if you unknowingly bought into a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "基本的にタイトルの通りです。\n\nもしあなたが、あるプロジェクトに故意に参加し、それを宣伝しているのであれば\n他の人に価値のないコイン/トークンを持たせるために、自分のバッグを汲み上げることだけを意図して、プロジェクトに参加し、宣伝しているのであれば\nを持たせてしまうようなプロジェクトに参加しているのであれば、あなたはその詐欺の作成者と同じように糞なのです。\n\nもし、あなたが無意識のうちに詐欺に加担していたとしても、それはそれで問題です。",
      "title": "もし、あなたが一攫千金を狙った詐欺やその他の暗号詐欺に故意に参加し、早期に現金化し、他の人が袋を抱えたままにすることを望むなら、あなたはその詐欺の作成者と同じように悪い人なのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "基本上和标题所说的一样。\n\n如果你在知情的情况下参与一个项目，并在推广时只想\n如果你明知故犯地参与一个项目，并在宣传时只想把自己的钱袋抽走，以便让别人拿着毫无价值的\n币/代币，你就和上述骗局的创造者一样低劣。\n\n我并不是说如果你在不知情的情况下买了一个...",
      "title": "如果你明知故犯地参与一个地毯式的、快速致富的计划或任何其他类型的加密货币骗局，并希望提前兑现，让其他人拿着袋子，你就和上述骗局的创造者一样坏。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "基本上和標題所說的一樣。\n\n如果你在知情的情況下參與一個項目，並在推廣時只想\n如果你明知故犯地參與一個項目，並在宣傳時只想把自己的錢袋抽走，以便讓別人拿着毫無價值的\n幣/代幣，你就和上述騙局的創造者一樣低劣。\n\n我並不是說如果你在不知情的情況下買了一個...",
      "title": "如果你明知故犯地參與一個地毯式的、快速致富的計劃或任何其他類型的加密貨幣騙局，並希望提前兌現，讓其他人拿着袋子，你就和上述騙局的創造者一樣壞。"
    }
  ]
}