{
  "author": "100problemss",
  "original_created_utc": 1630713507,
  "title": "Top Most Hated Crypto According To This Sub",
  "created_utc": 1630765831,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just posted a top loved crypto currencies in this sub a few weeks ago. </p>\n\n<p>Now it’s time for the top most despised  crypto currencies on <a href=\"/r/cryptocurrency\">r/cryptocurrency</a></p>\n\n<ol>\n<li>Internet Computer - Is there anyone here that actually likes These guys? Its more hated then Michael Vick in a dog shelter.<br/></li>\n<li>Tether - I’m guessing Tether is backed by some Dominos coupons, Monopoly money and maybe some Zimbabwean dollars.<br/></li>\n<li>SAFEM00N - I think the name actually fits the coin. Let’s safely bury it on the M00N so only aliens will ever find it. And when they do they’ll say WTF is this, then they’ll turn around and go home.<br/></li>\n<li>Ethereum Classic - There’s nothing classic about this “Ethereum” token. It was the adopted brother that nobody liked or wanted. Except those robinhood users.<br/></li>\n<li>Bitcoin Cash - Almost as good as cash. Which means it’s not good at all. Another loser of a coin that forked from one of the greats. If you’re not first, your last. This definitely applies with Bitcoin Cash.<br/></li>\n<li>Shiba Inu - The first dog coin of many. It’s the most hated because it’s not even the original dog coin!<br/></li>\n<li>Dogecoin - continues to fall down on this list. The ultimate meme coin is here to stay!<br/></li>\n<li>XRP - If Ripple was a real life person, it would be a tax invading dude from high school. So many questions the SEC wants answered.<br/></li>\n<li>Litecoin - Can we just be done already? Lite coin was created lite years ago and hasn’t done much since.<br/></li>\n<li>Titan - Almost as good as Mark Cubans first year with the Mavericks. I’ll leave it at that. </li>\n</ol>\n\n<p>Honorable mention: </p>\n\n<p>Tron - Don’t know much about it but the movie was good. </p>\n\n<p>Hope you guys enjoyed it!</p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/CryptoCurrency/comments/phgtcb/top_most_hated_crypto_according_to_this_sub/",
  "subreddit": "CryptoCurrency",
  "id": "phgtcb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Just posted a top loved crypto currencies in this sub a few weeks ago.\n\nNow it’s time for the top most despised crypto currencies on r/cryptocurrency\n[/r/cryptocurrency]\n\n 1.  Internet Computer - Is there anyone here that actually likes These guys?\n     Its more hated then Michael Vick in a dog…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数週間前にこのサブに「愛されている暗号通貨トップ」を投稿したばかり。\n\n今度はr/cryptocurrencyで最も嫌われている暗号通貨のトップを決める番です\n[/r/cryptocurrency]\n\n 1.  インターネットコンピュータ - この人たちを実際に好きな人はここにいますか？\n     それは、犬のマイケル・ヴィックよりも嫌われている...",
      "title": "トップ・モスト・ヘイト・クリプト・バイ・ザ・サブ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几周前，我们刚刚发布了本子中最受喜爱的加密货币。\n\n现在是时候在r/cryptocurrency上评选出最被鄙视的加密货币了\n[/r/cryptocurrency]\n\n 1.  互联网计算机 - 这里有谁真正喜欢这些家伙吗？\n     它更被讨厌，然后迈克尔-维克在狗...",
      "title": "这家子最讨厌的加密货币排行榜"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾周前，我們剛剛發佈了本子中最受喜愛的加密貨幣。\n\n現在是時候在r/cryptocurrency上評選出最被鄙視的加密貨幣了\n[/r/cryptocurrency]\n\n 1.  互聯網計算機 - 這裏有誰真正喜歡這些傢伙嗎？\n     它更被討厭，然後邁克爾-維克在狗...",
      "title": "這家子最討厭的加密貨幣排行榜"
    }
  ]
}