{
  "author": "helmsdeep99",
  "the_new_excerpt": "Earlier today, TTCF shareholders and specifically those who follow renown\ninternet stock recommender Jeremy \"Financial Education\" were in for a rude\nawakening this morning as shares of TTCF crashed through the floor over 10% as\nthose who follow the renown youtuber stand to lose millions. The stock…",
  "original_created_utc": 1618847478,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日の朝、TTCFの株主、特に有名なインターネット銘柄推奨者である\nジェレミー \"ファイナンシャル・エデュケーション \"を利用している人は\nTTCFの株が10％以上も暴落したのです。\nこの有名なユーチューバーをフォローしている人たちは、何百万もの損失を被ることになります。この株は...",
      "title": "TTCFの株価は10％以上も暴落し、著名なyoutube投資家Jeremy \"Financial Education \"は数百万ドルの損失を出しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天早些时候，TTCF的股东，特别是那些追随著名的\n互联网股票推荐人杰里米 \"金融教育 \"是在一个粗暴的\n今早醒来，TTCF的股价跌破地板超过10%，因\n那些追随著名的Youtuber的人将损失数百万。股票...",
      "title": "TTCF股票崩溃通过地板超过10％，因为著名的YouTube投资者杰里米 \"金融教育 \"损失数百万。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天早些時候，TTCF的股東，特別是那些追隨著名的\n互聯網股票推薦人傑裏米 \"金融教育 \"是在一個粗暴的\n今早醒來，TTCF的股價跌破地板超過10%，因\n那些追隨著名的Youtuber的人將損失數百萬。股票...",
      "title": "TTCF股票崩潰通過地板超過10％，因爲著名的YouTube投資者傑里米 \"金融教育 \"損失數百萬。"
    }
  ],
  "title": "TTCF stock CRASHES through the floor more than 10% as renown youtube investor Jeremy \"Financial Education\" loses millions.",
  "created_utc": 1618854752,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Earlier today, TTCF shareholders and specifically those who follow renown internet stock recommender Jeremy &quot;Financial Education&quot; were in for a rude awakening this morning as shares of TTCF crashed through the floor over 10% as those who follow the renown youtuber stand to lose millions.  The stock trades at $17 a share, but insiders such as CEO Salvatore &quot;The Tattooed Chef&quot; Galletti were desparate to get out of the stock at any price and sold their shares for $10, almost a 50% discount from Friday&#39;s close price.</p>\n\n<p><a href=\"https://finance.yahoo.com/news/tattooed-chef-inc-ttcf-president-031502515.html\">https://finance.yahoo.com/news/tattooed-chef-inc-ttcf-president-031502515.html</a></p>\n\n<p>Investors are now left wondering, why should I have confidence in a company when the CEO himself does not have confidence in said company?  Is this the end for the plant based movement as more consumers gravitate back towards meat based products?  Should investors be going long Tyson Meats and exiting TTCF as soon as they can?  One thing&#39;s for certain:  It&#39;s possible that the consumer, to use tattooed chef&#39;s trademark slogan, don&#39;t actually &quot;Give a crop&quot;.</p>\n</div><!-- SC_ON -->",
  "score": 386,
  "permalink": "/r/investing/comments/mu3lg3/ttcf_stock_crashes_through_the_floor_more_than_10/",
  "subreddit": "investing",
  "id": "mu3lg3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171524771
}