{
  "author": "gorays21",
  "the_new_excerpt": "> AMD processors and graphics chips will be used in the infotainment systems of\n> newly updated Tesla Model S and Model X electric cars, which are expected to\n> go on sale in a few weeks. With AMD's more powerful chips, Tesla owners will\n> be able to play cutting-edge video games in their cars—when…",
  "original_created_utc": 1622531449,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "> AMDのプロセッサーとグラフィックチップが\n> 数週間後に発売が予定されているテスラの新型電気自動車「モデルS」と「モデルX」のインフォテインメント・システムに採用されます。\n> 数週間後に発売される予定です。AMDのより高性能なチップを搭載することで、テスラのオーナーは\n> テスラのオーナーは、最先端のビデオゲームを車内でプレイすることができるようになります。",
      "title": "AMDとTeslaが提携！？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "> AMD的处理器和图形芯片将被用于信息娱乐系统。\n> 新近更新的特斯拉Model S和Model X电动汽车，预计将在几周后上市。\n> 几周后开始销售。有了AMD的更强大的芯片，特斯拉车主将\n> 能够在他们的车里玩最先进的视频游戏--当...",
      "title": "AMD和特斯拉联手!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> AMD的處理器和圖形芯片將被用於信息娛樂系統。\n> 新近更新的特斯拉Model S和Model X電動汽車，預計將在幾周後上市。\n> 幾周後開始銷售。有了AMD的更強大的芯片，特斯拉車主將\n> 能夠在他們的車裏玩最先進的視頻遊戲--當...",
      "title": "AMD和特斯拉聯手!"
    }
  ],
  "title": "AMD and Tesla team up!",
  "created_utc": 1622535816,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p>AMD processors and graphics chips will be used in the infotainment systems of newly updated Tesla Model S and Model X electric cars, which are expected to go on sale in a few weeks. With AMD&#39;s more powerful chips, Tesla owners will be able to play cutting-edge video games in their cars—when they&#39;re not driving, of course–and see maps and other items in more detail.  </p>\n\n<p>&quot;The work (Tesla) is doing is truly pushing the leading edge of what you can put into a car,&quot; Lisa Su told <em>Fortune</em> in an exclusive interview before announcing the Tesla deal on Monday at the Computex computer show in Taiwan. She described the effort to make in-car dash systems as powerful as high-end PCs &quot;part of the broader trend that computing is everywhere.&quot;</p>\n</blockquote>\n\n<p><a href=\"https://www.theverge.com/2021/6/1/22462660/amd-tesla-model-x-s-plaid-ryzen-radeon-rdna-2\">AMD confirms it’s powering the gaming rig inside Tesla’s Model S and Model X - The Verge</a></p>\n</div><!-- SC_ON -->",
  "score": 2749,
  "permalink": "/r/stocks/comments/npo298/amd_and_tesla_team_up/",
  "subreddit": "stocks",
  "id": "npo298",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804300255
}