{
  "author": "AskScienceModerator",
  "the_new_excerpt": "We will be answering your questions related to health equity from 12:00-3:00p ET\n(17-20 UT), especially those that have been brought to light during the\npandemic. Here's a little bit about each of our backgrounds and how to find us\nonline.\n\n * Dr. Fatima Cody Stanford is a fellowship trained obesity…",
  "original_created_utc": 1614168051,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们将在美国东部时间中午12:00-下午3:00回答您有关健康公平的问题。\n(17-20 UT)，特别是那些已经被曝光的。\n大流行。下面是关于我们每个人的背景和如何找到我们的一些情况。\n在线。\n\n *法蒂玛-科迪-斯坦福博士是一位接受过肥胖症研究训练的...",
      "title": "AskScience AMA系列。Hello Reddit! 对于Medscape教育，我们是Fatima Cody Stanford博士、Rachel M. Bond博士、John Whyte博士和Michael Sapienza准备好回答您关于COVID时代的健康公平的问题。向我们提出任何问题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們將在美國東部時間中午12:00-下午3:00回答您有關健康公平的問題。\n(17-20 UT)，特別是那些已經被曝光的。\n大流行。下面是關於我們每個人的背景和如何找到我們的一些情況。\n在線。\n\n *法蒂瑪-科迪-斯坦福博士是一位接受過肥胖症研究訓練的...",
      "title": "AskScience AMA系列。Hello Reddit! 對於Medscape教育，我們是Fatima Cody Stanford博士、Rachel M. Bond博士、John Whyte博士和Michael Sapienza準備好回答您關於COVID時代的健康公平的問題。向我們提出任何問題"
    }
  ],
  "title": "AskScience AMA Series: Hello Reddit! For Medscape Education, we are Dr. Fatima Cody Stanford, Dr. Rachel M. Bond, Dr. John Whyte, and Michael Sapienza ready to answer your questions about Health Equity in the Time of COVID. Ask Us Anything!",
  "created_utc": 1614185681,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We will be answering your questions related to health equity from 12:00-3:00p ET (17-20 UT), especially those that have been brought to light during the pandemic. Here&#39;s a little bit about each of our backgrounds and how to find us online.</p>\n\n<ul>\n<li>Dr. Fatima Cody Stanford is a fellowship trained obesity medicine physician scientist at Massachusetts General Hospital (MGH) and Harvard Medical School (HMS). She is the Director of Diversity for the Nutrition Obesity Research Center at Harvard and the Director of Anti-Racism Initiatives for the Neuroendocrine Unit at MGH. Twitter <a href=\"https://twitter.com/askdrfatima\">@askdrfatima</a></li>\n<li>Dr. John Whyte is a physician, author, and Chief Medical Officer <a href=\"https://twitter.com/webmd\">@WebMD</a>. He&#39;s passionate about changing how we think about health. Twitter <a href=\"https://twitter.com/drjohnwhyte\">@drjohnwhyte</a></li>\n<li>Michael Sapienza, CEO of the Colorectal Cancer Alliance. Twitter <a href=\"https://twitter.com/coloncancermike\">@coloncancermike</a></li>\n<li>Medscape is the leading online global destination for physicians and healthcare professionals worldwide, offering the latest medical news, expert perspectives, and relevant professional education and CME. Twitter <a href=\"https://twitter.com/Medscape\">@Medscape</a> <a href=\"https://twitter.com/MedscapeCME\">@MedscapeCME</a></li>\n</ul>\n\n<p>In the new Clinical Advances in Elevating Health Equity learning center, we take a deeper look into the current state of health care, from structural inequalities to individual patient care. This resource will share interviews, expert commentaries, CME opportunities, and new insights that aim to improve health outcomes for all patients. Check it out: <a href=\"https://www.medscape.org/sites/advances/elevating-health-equity\">https://www.medscape.org/sites/advances/elevating-health-equity</a></p>\n\n<p>Ask Us Anything!</p>\n\n<p>Username: <a href=\"/u/Medscape\">/u/Medscape</a></p>\n</div><!-- SC_ON -->",
  "score": 144,
  "permalink": "/r/askscience/comments/lrb6kq/askscience_ama_series_hello_reddit_for_medscape/",
  "subreddit": "askscience",
  "id": "lrb6kq",
  "is_self": true,
  "media": null,
  "is_video": false
}