{
  "author": "That-Attitude6308",
  "original_created_utc": 1633429145,
  "title": "Bill Gates said “The way cryptocurrency works today allows for certain criminal activities. It’d be good to get rid of that”. Crypto was not used to launder money according to Pandora papers. Its time for these people to swallow their words and be critical of traditional finance and the government.",
  "created_utc": 1633437187,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Pandora papers showed that people are using loopholes in tax laws to hide their wealth in tax havens to hide their wealth or ill gotten gains. They are not using cryptocurrency to do that, there are plenty of loopholes in tax laws for doing it legally.</p>\n\n<p>The rich are holding properties and investments under a network of offshore companies that are set up in other countries, or &quot;offshore&quot;.</p>\n\n<p>These offshore countries or territories are where:</p>\n\n<p>- it&#39;s easy to set up companies</p>\n\n<p>- there are laws that make it difficult to identify owners of companies</p>\n\n<p>- there is low or no corporation tax.</p>\n\n<p>The best part of it is that using tax havens to dodge taxes is not illegal. Loopholes in the law allow people to legally avoid paying some taxes by  moving their money or setting up companies in tax havens, but it is  often seen as unethical.</p>\n\n<p>Its estimated that from $5.6 trillion to $32 trillion is hidden in tax havens, according to the ICIJ.  The IMF has said the use of tax havens costs governments worldwide up to $600bn in lost taxes each year.</p>\n\n<p>To hide money all you need to do set up a shell company in one of the countries or  jurisdictions with high levels of secrecy. This is a company that exists  in name only, with no staff or office.  It costs money though. Specialist firms are paid to set up and run shell  companies on your behalf. These firms can provide an address and names  of paid directors, therefore leaving no trail of who is ultimately  behind the business.</p>\n\n<p>When such a huge amount of money is hidden in offshore havens, the rich still blames cryptocurrency as the culprit for money laundering. This is classic gaslighting. They are projecting and blaming the most vulnerable group, what they do themselves.</p>\n\n<p>This legal way of tax dodging will never end because the people that could end the secrecy offshore are themselves benefiting from it. So there&#39;s no incentive for them to end it.</p>\n\n<p>Its time more people speak up against this and move more towards cryptocurrency where all data is independently verifiable.</p>\n</div><!-- SC_ON -->",
  "score": 859,
  "permalink": "/r/CryptoCurrency/comments/q1tgui/bill_gates_said_the_way_cryptocurrency_works/",
  "subreddit": "CryptoCurrency",
  "id": "q1tgui",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Pandora papers showed that people are using loopholes in tax laws to hide their\nwealth in tax havens to hide their wealth or ill gotten gains. They are not\nusing cryptocurrency to do that, there are plenty of loopholes in tax laws for\ndoing it legally.\n\nThe rich are holding properties and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "パンドラ社の論文では、人々が税法の抜け穴を利用して、自分の財産をタックスヘイブンに隠していることが示されています。\n租税回避地（タックスヘイブン）に富を隠して、自分の富や不正に得た利益を隠しています。そのために暗号通貨を使っているわけではありません。\nそのために暗号通貨を使うのではなく、合法的に行うための抜け道が税法にはたくさんあります。\n合法的に行うための税法の抜け道はたくさんあります。\n\nお金持ちは、不動産を保有していたり、...",
      "title": "ビル・ゲイツ氏は、「現在の暗号通貨の仕組みは、ある種の犯罪行為を可能にしている。それをなくすのは良いことだ」と述べています。パンドラの書類によると、暗号はマネーロンダリングには使われていなかったそうです。このような人々は、自分の言葉を飲み込み、伝統的な金融や政府に対して批判的になるべき時が来ているのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "潘多拉文件显示，人们正在利用税法中的漏洞，将他们的\n在避税天堂隐藏他们的财富或不义之财。他们不是\n使用加密货币来做到这一点，在税法上有很多漏洞可以用于\n合法地做这件事。\n\n富人持有房产和...",
      "title": "比尔-盖茨说：\"今天加密货币的运作方式允许某些犯罪活动。摆脱这种情况会很好\"。根据潘多拉的文件，加密货币并没有被用来洗黑钱。现在是时候让这些人吞下他们的话，对传统金融和政府进行批评了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "潘多拉文件顯示，人們正在利用稅法中的漏洞，將他們的\n在避稅天堂隱藏他們的財富或不義之財。他們不是\n使用加密貨幣來做到這一點，在稅法上有很多漏洞可以用於\n合法地做這件事。\n\n富人持有房產和...",
      "title": "比爾-蓋茨說：\"今天加密貨幣的運作方式允許某些犯罪活動。擺脫這種情況會很好\"。根據潘多拉的文件，加密貨幣並沒有被用來洗黑錢。現在是時候讓這些人吞下他們的話，對傳統金融和政府進行批評了。"
    }
  ]
}