{
  "author": "FrogsDoBeCool",
  "original_created_utc": 1625454938,
  "title": "Tldr: What are smart Contracts?",
  "created_utc": 1625470233,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I feel like a lot of people know a lot of the fundamentals of Blockchain and Bitcoin technology, and even more so of practical use of Ethereum, Matic, stellar, etc. But they don&#39;t know the basics of smart Contracts! So here!</p>\n\n<p>Smart Contracts make sure that when using pay to pay applications you can ensure that both people will be paid. </p>\n\n<p>Say for example you have a fundraiser with smart Contracts. It&#39;s the intermediary that moves the funds from several backers to the company / idea that needs money.</p>\n\n<p>Since Smart Contracts work on Blockchain it means once a smart Contract is made it cannot be undone. And smart Contracts must be validated by everyone in that block. Meaning that it&#39;s impossible to manipulate a smart Contract.</p>\n\n<p>So what&#39;s the use of smart Contracts? It&#39;s very useful for payments that occur frequently, and need validation that one paid their fair share. Smart contracts main purpose is a validation, it can validate if someone has enough money, if someone did an action, if someone paid a loan, etc. </p>\n\n<p>After a smart Contract is done the ledger is updated. </p>\n\n<p><em>tldr for the tldr:</em> A smart contract is useful to validate needed things, Like checking if someone paid a loan, or paid a monthly cost, like bills or something. and it acts as the anonymous intermediary for moving money from person to person since it works on the Blockchain...</p>\n\n<p>Edit: user Kenarion in the comments gave more examples if you need further help! Thanks!</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/odypdh/tldr_what_are_smart_contracts/",
  "subreddit": "CryptoCurrency",
  "id": "odypdh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I feel like a lot of people know a lot of the fundamentals of Blockchain and\nBitcoin technology, and even more so of practical use of Ethereum, Matic,\nstellar, etc. But they don't know the basics of smart Contracts! So here!\n\nSmart Contracts make sure that when using pay to pay applications you can…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ブロックチェーンやビットコイン技術の基礎知識は多くの人が知っているように感じます。\nビットコインの技術、さらにはイーサリアムの実用化、Matic,\nstellarなどです。しかし、スマートコントラクトの基本は知らないのです! そこで！スマートコントラクトです。\n\nスマートコントラクトは、Pay to Payアプリケーションを使用する際に、...",
      "title": "Tldr: スマートコントラクトとは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得很多人都知道区块链和比特币技术的很多基本原理\n比特币技术，更知道以太坊、Matic的实际使用。\nstellar等。但他们不知道智能合约的基础知识! 所以在这里!\n\n智能合约确保在使用支付宝应用程序时，你可以...",
      "title": "Tldr: 什么是智能合约？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得很多人都知道區塊鏈和比特幣技術的很多基本原理\n比特幣技術，更知道以太坊、Matic的實際使用。\nstellar等。但他們不知道智能合約的基礎知識! 所以在這裏!\n\n智能合約確保在使用支付寶應用程序時，你可以...",
      "title": "Tldr: 什麼是智能合約？"
    }
  ]
}