{
  "author": "prostockadvice",
  "the_new_excerpt": "Roblox IPO ($RBLX) Analysis:\n\nI am no expert on video games or Roblox, but after some research and digging\nthese are my thoughts on this hyped up IPO launching tomorrow.\n\nIntro:\n\nRoblox is an online game platform and game creation system developed by Roblox\nCorporation. It allows users to program…",
  "original_created_utc": 1615344884,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Roblox IPO（$RBLX）分析。\n\n我不是电子游戏和Roblox的专家，但经过研究和挖掘后\n这些是我对这个明天启动的被炒作的IPO的看法。\n\n介绍一下。\n\nRoblox是由Roblox公司开发的在线游戏平台和游戏创作系统。\n公司。它允许用户编程...",
      "title": "ROBLOX IPO $RBLX深度分析"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Roblox IPO（$RBLX）分析。\n\n我不是電子遊戲和Roblox的專家，但經過研究和挖掘後\n這些是我對這個明天啓動的被炒作的IPO的看法。\n\n介紹一下。\n\nRoblox是由Roblox公司開發的在線遊戲平臺和遊戲創作系統。\n公司。它允許用戶編程...",
      "title": "ROBLOX IPO $RBLX深度分析"
    }
  ],
  "title": "ROBLOX IPO $RBLX In Depth Analysis",
  "created_utc": 1615386938,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Roblox IPO ($RBLX) Analysis:</strong></p>\n\n<p><em>I am no expert on video games or Roblox, but after some research and digging these are my thoughts on this hyped up IPO launching tomorrow.</em></p>\n\n<p><strong>Intro:</strong></p>\n\n<p><strong><em>Roblox</em></strong> is an online game platform and game creation system developed by Roblox Corporation. It allows users to program games and play games created by other users. Founded by David Baszucki and Erik Cassel in 2004 and released in 2006, the platform hosts user-created games of multiple genres coded in the programming language LUA. </p>\n\n<p><em>Roblox</em> is free-to-play, with in-game purchases available through a virtual currency called &quot;Robux&quot;. As of August 2020, <em>Roblox</em> had over 164 million monthly active users, with it being played by over half of all children aged under 16 in the United States.</p>\n\n<p><strong>Key Points:</strong></p>\n\n<ul>\n<li>Valuation raised from $4B to $29.5B last February</li>\n<li>Anyone can be a content developer and sell their content for in game currency called Robux. Roblox takes a 30% cut of this.</li>\n<li>In essence, Roblox is a platform for gaming creators to make content, similarly to YouTube or an Apple App Store</li>\n<li>In July of 2020, Roblox expected to pay out $250M to its developers.</li>\n<li>From 2019 to 2020 Roblox experienced a 68% Increase in revenue YoY.</li>\n<li>Daily active users from 2019 to 2020 grew from 17.6M to 31.3M, 43.8%</li>\n<li>$1.62M per Day Revenue (ARP)/ 31.3M Daily Active Users (DAU) = $0.05/user ARPDAU</li>\n<li>Casual games on the App store have an average of $0.10 ARPDAU, so a Roblox $0.05 ARPDAU is rather low.</li>\n<li>Majority of their users are not paying.</li>\n<li>Net losses grew from $50M to $206M from 2019 to 2020, with an increase in spending in their infrastructure trust and safety, R&amp;D and general administration.</li>\n<li>Free cash flow grew from $6M in 2019 to $292.6M in 2020.</li>\n<li>Average user retention is 23 months in 2019 and 2020</li>\n<li>Lock up period for Roblox is 180 days, which means that employees and insiders cannot sell their shares.</li>\n</ul>\n\n<p>Overall, I think that Roblox is a very popular gaming platform for young kids that has a good social aspect to it. They seem to have increased their spending in &#39;Trust and Safety&#39; which is hugely important for younger aged gamers, no one wants a weirdo talking to their kids on Roblox. Roblox has a unique business model in the gaming industry that allows its users to create new content. As long as Roblox can continue to incentivize its creators, it should continue seeing a huge rate of growth.</p>\n\n<p>The problems that I see is mainly the ARPDAU number. $0.05 ARPDAU seems to me to be pretty low compared to other popular gaming titles, however I am no expert. What that means to me is that the Roblox team is not monetizing the game very well. Hopefully, that changes and they can double or triple the ARPDAU.</p>\n\n<p>Another issue I see is that the users have around a 23 month lifespan, so Roblox will continually need to refill their active user pool. From what I can see is 23 months is less than some other major gaming titles. Roblox is suited for kids under 13, and whether we like it or not, kids grow up fast and might find Roblox un-cool.</p>\n\n<p>Roblox doesn&#39;t make me all that excited to be honest, and I won&#39;t be investing much money into this company long term until I see an increase in the ARPDAU. However something important that isn&#39;t talked about enough is the  &#39;Lockup&#39; period. Investors and insiders can&#39;t dump their shares as soon as this IPOs so us, retail investors, should do OK buying it. Will I buy $RBLX tomorrow? Of course! Will I invest more than a few % of my portfolio? Absolutely not! This is to hyped for the numbers, in my opinion. When in the markets there is greed, be fearful.</p>\n\n<p>The truth is, no one knows what will happen tomorrow with $RBLX, but it will be fun to trade nevertheless!</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/investing/comments/m1nl5z/roblox_ipo_rblx_in_depth_analysis/",
  "subreddit": "investing",
  "id": "m1nl5z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542575835
}