{
  "author": "AMachineMan",
  "the_new_excerpt": "I made the jump into ETF investing this year, and ran into a situation where I\nwas choosing between 2 similar ETF's, DRIV and IDRV. When comparing the 2 on a\nperformance chart, DRIV was the better performer, however it had a much higher\nexpense ratio, and I made the assumption that after the Expense…",
  "original_created_utc": 1619328673,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は今年、ETF投資を始めましたが、似たような2つのETF、DRIVとIDRVのどちらを選ぶかという状況に遭遇しました。\n2つの似たようなETF、DRIVとIDRVのどちらを選ぶかという場面に遭遇しました。この2つをパフォーマンスチャートで比較すると\nパフォーマンス・チャートで比較すると、DRIVの方が優れたパフォーマンスを示していましたが、経費率がはるかに高かったのです。\nしかし、経費率はDRIVの方がはるかに高く、私は、経費率を考慮した上で、IDRVを選択しました。",
      "title": "エクスペンス・レシオとパフォーマンス"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今年跳槽到ETF投资，遇到了这样的情况\n我在两个类似的ETF，即DRIV和IDRV之间进行选择。当在业绩图表上比较这两个\n绩效图表中，DRIV的表现更好，但它的费用率要高得多。\n但是，它的费用率要高得多，而且我假设在费用率之后，它的表现会更好。",
      "title": "费用率和业绩"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今年跳槽到ETF投資，遇到了這樣的情況\n我在兩個類似的ETF，即DRIV和IDRV之間進行選擇。當在業績圖表上比較這兩個\n績效圖表中，DRIV的表現更好，但它的費用率要高得多。\n但是，它的費用率要高得多，而且我假設在費用率之後，它的表現會更好。",
      "title": "費用率和業績"
    }
  ],
  "title": "Expense Ratio and Performance",
  "created_utc": 1619333326,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I made the jump into ETF investing this year, and ran into a situation where I was choosing between 2 similar ETF&#39;s, DRIV and IDRV. When comparing the 2 on a performance chart, DRIV was the better performer, however it had a much higher expense ratio, and I made the assumption that after the Expense ratio DRIV and IDRV would be closer in net earnings. So I wound up going with IDRV due to the lower expense ratio.</p>\n\n<p>However, someone recently told me that Expense ratio is factored into the price changes, and if one fund is shown to performing better, thats exactly whats happening. I have a not great understanding of expense ratios and how they come to play in performance comparisons (most expense ratio comparison tools make the assumption that both funds have equal rates of growth), so I&#39;m not sure if I made a mistake in this. Any insight into how Expense ratio comes into play with ETFs and overall performance reviews?</p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/investing/comments/my1pho/expense_ratio_and_performance/",
  "subreddit": "investing",
  "id": "my1pho",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776214681
}