{
  "author": "Hospitalities",
  "original_created_utc": 1630327602,
  "title": "As a reminder, anti-vax comments and pushing non-FDA or CDC recommended treatments of Covid-19 will result in a permanent ban.",
  "created_utc": 1630336655,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don’t care what you say outside of this sub but the moment you bring it up in here, you’ll be banned.</p>\n\n<p>Just because we haven’t nuked accounts from conspiracy, NNN, ivermectin or whatever other uninformed sub you draw a medical opinion from doesn’t mean we are receptive to those who hold those subs values. Either stick to providing non-medical advice (I.e. speak to your doctor / follow the current healthcare guidelines) or simply don’t comment at all regarding covid-19.</p>\n\n<p>To everyone else, please continue reporting comments that break these rules so we can find them faster. Tyvm.</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/TooAfraidToAsk/comments/pehdyi/as_a_reminder_antivax_comments_and_pushing_nonfda/",
  "subreddit": "TooAfraidToAsk",
  "id": "pehdyi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don’t care what you say outside of this sub but the moment you bring it up in\nhere, you’ll be banned.\n\nJust because we haven’t nuked accounts from conspiracy, NNN, ivermectin or\nwhatever other uninformed sub you draw a medical opinion from doesn’t mean we\nare receptive to those who hold those subs…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブの外で何を言おうと構いませんが、ここでそれを持ち出した瞬間に\nここに持ち込んだ時点でBANされますよ。\n\n陰謀論やNNN、イベルメクチンなどのアカウントをNGにしていないからといって\nあなたが医学的な意見を持っている他の無知なサブサイトからアカウントを削除していないからといって\nそれらのサブを持っている人を受け入れるということではありません...",
      "title": "注意点として、アンチワクチンのコメントや、FDAやCDCが推奨していないCovid-19の治療法を押し付けると、永久追放となります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不在乎你在这个分站外说什么，但一旦你在这里提出来，你就会被禁止。\n你就会被禁言。\n\n仅仅因为我们没有清除来自阴谋论、NNN、伊维菌素或\n不管你从什么地方得出的医学意见，并不意味着我们\n我们可以接受那些持有这些子的人......",
      "title": "作为提醒，反疫苗的评论和推崇非FDA或CDC推荐的Covid-19的治疗方法，将导致永久禁止。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不在乎你在這個分站外說什麼，但一旦你在這裏提出來，你就會被禁止。\n你就會被禁言。\n\n僅僅因爲我們沒有清除來自陰謀論、NNN、伊維菌素或\n不管你從什麼地方得出的醫學意見，並不意味着我們\n我們可以接受那些持有這些子的人......",
      "title": "作爲提醒，反疫苗的評論和推崇非FDA或CDC推薦的Covid-19的治療方法，將導致永久禁止。"
    }
  ]
}