{
  "author": "Oddsnotinyourfavor",
  "original_created_utc": 1629581831,
  "title": "Reminder: if a social media influencer is promoting it, it is a RUG PULL",
  "created_utc": 1629610239,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>DinkDoink, SafeMoon, MillionToken, Save The Kids Token. What more proof do you need? If a social media influencer is promoting the coin, you will get rug pulled. These people do not care about you. They aren’t trying to make you rich. They will cash in and leave you holding their bags with absolutely no remorse. Do not pay attention to any of the stories about how X influencer is promoting a new crypto project. Do your research, and if you really think it has some potential, wait a month or two after the coin is tradable to see if it actually holds its value. But 99.99% of the time it’s just a bullshit coin with no actual use cases that just leverages buzzwords with social media hype. Be safe out there</p>\n\n<p>Edit: after reading the comments, it appears social media influencers have also promoted BTC and ETH. <strong>NO ONE IS SAFE</strong> /s</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/p8zu0n/reminder_if_a_social_media_influencer_is/",
  "subreddit": "CryptoCurrency",
  "id": "p8zu0n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "DinkDoink, SafeMoon, MillionToken, Save The Kids Token. What more proof do you\nneed? If a social media influencer is promoting the coin, you will get rug\npulled. These people do not care about you. They aren’t trying to make you rich.\nThey will cash in and leave you holding their bags with…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "DinkDoink、SafeMoon、MillionToken、Save The Kids Token。これ以上の証拠が必要でしょうか？\n必要でしょうか？もしソーシャルメディアのインフルエンサーがそのコインを宣伝していたら、あなたはラグ\nされてしまいます。この人たちはあなたのことを気にしていません。あなたをお金持ちにしようとしているわけではありません。\n彼らはお金を稼いで、あなたに荷物を持たせておいて...",
      "title": "リマインダー：ソーシャルメディアのインフルエンサーが宣伝していれば、それはRUG PULLです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "DinkDoink, SafeMoon, MillionToken, Save The Kids Token. 你还需要什么证明呢？\n还需要什么证明？如果一个社交媒体的影响者正在推广该币，你将会被地毯式的\n拉。这些人并不关心你。他们并不是想让你发财。\n他们会套现，然后让你拿着他们的袋子离开......",
      "title": "提醒：如果有社交媒体的影响者在宣传，那就是地毯式的拉动。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "DinkDoink, SafeMoon, MillionToken, Save The Kids Token. 你還需要什麼證明呢？\n還需要什麼證明？如果一個社交媒體的影響者正在推廣該幣，你將會被地毯式的\n拉。這些人並不關心你。他們並不是想讓你發財。\n他們會套現，然後讓你拿着他們的袋子離開......",
      "title": "提醒：如果有社交媒體的影響者在宣傳，那就是地毯式的拉動。"
    }
  ]
}