{
  "author": "TempMobileD",
  "original_created_utc": 1627105875,
  "title": "This is my stop. For now.",
  "created_utc": 1627123329,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is where I get off, sort of, for a while. </p>\n\n<p>I’ve been in crypto since the tail end of the last bull run. It’s been about 3 and a half years all told. In that time I’ve seen some crazy prices, crazy drops and crazy runs. I’ve seen my net worth spike and drop and spike again. </p>\n\n<p>Today, or rather, over the next few days I’m liquidating the first meaningful chunk (~45%) of my crypto holdings to put a deposit on a house. This isn’t my moon, but it’s been my financial goal for a long time. </p>\n\n<p>The only thing I’m still holding is a stack of Eth and a little pile of Ada, but you can bet I’ll be building my position back over the coming months/years. </p>\n\n<p>Thanks to all of you guys who’ve offered advice, combed the web for news and generally supported each other. This is a solid community.</p>\n\n<p>You can bet now the time has come for me to sell we’ll see a new ATH within a month! So you’re all welcome for that!</p>\n</div><!-- SC_ON -->",
  "score": 195,
  "permalink": "/r/CryptoCurrency/comments/oqk45d/this_is_my_stop_for_now/",
  "subreddit": "CryptoCurrency",
  "id": "oqk45d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is where I get off, sort of, for a while.\n\nI’ve been in crypto since the tail end of the last bull run. It’s been about 3\nand a half years all told. In that time I’ve seen some crazy prices, crazy drops\nand crazy runs. I’ve seen my net worth spike and drop and spike again.\n\nToday, or rather,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここで私はしばらくの間、降りることになります。\n\n私は前回のブルランの最後尾から暗号化に参加しています。約3年半になります。\n年半になります。その間、狂ったような価格、狂ったような下落、狂ったような上昇を見てきました。\n狂ったような動きをしました。私の純資産が急上昇しては下落し、また急上昇するのを見てきました。\n\n今日、というか...",
      "title": "これが私のストップです。今はね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是我下车的地方，有点像，有一段时间了。\n\n我从上一轮牛市的尾声就开始从事加密货币。已经有大约3\n三年半了。在这段时间里，我看到了一些疯狂的价格，疯狂的下跌\n和疯狂的运行。我看到我的净资产飙升，下降，再飙升。\n\n今天，或者说，...",
      "title": "这是我的一站。就目前而言。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是我下車的地方，有點像，有一段時間了。\n\n我從上一輪牛市的尾聲就開始從事加密貨幣。已經有大約3\n三年半了。在這段時間裏，我看到了一些瘋狂的價格，瘋狂的下跌\n和瘋狂的運行。我看到我的淨資產飆升，下降，再飆升。\n\n今天，或者說，...",
      "title": "這是我的一站。就目前而言。"
    }
  ]
}