{
  "author": "Iiau_",
  "the_new_excerpt": "One thing I noticed at this sub is the lack of support and not being\nconstructive critics when they come across stuff they disagree. I remember how a\nfew weeks ago when there was a bit of salt against doge, someone talking about\nhow they had doge and Elon tweet pumped it and they commented how they…",
  "original_created_utc": 1614662257,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在这个子上注意到一件事，就是缺乏支持，不被\n建设性的批评家，当他们遇到他们不同意的东西。我记得一个\n几周前，当有一点盐反对doge，有人说起了\n他们如何有doge和埃隆推特泵它，他们评论如何他们... ...",
      "title": "如果你从加密技术中赚到了钱，不管是好的投资还是坏的投资，对你都是好事。不管我们有多傻，都应该互相支持。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在這個子上注意到一件事，就是缺乏支持，不被\n建設性的批評家，當他們遇到他們不同意的東西。我記得一個\n幾周前，當有一點鹽反對doge，有人說起了\n他們如何有doge和埃隆推特泵它，他們評論如何他們... ...",
      "title": "如果你從加密技術中賺到了錢，不管是好的投資還是壞的投資，對你都是好事。不管我們有多傻，都應該互相支持。"
    }
  ],
  "title": "If you're making money from crypto, whether it's a good investment or a bad investment, good for you. We should support each other no matter how stupid we are.",
  "created_utc": 1614684632,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>One thing I noticed at this sub is the lack of support and not being constructive critics when they come across stuff they disagree. I remember how a few weeks ago when there was a bit of salt against doge, someone talking about how they had doge and Elon tweet pumped it and they commented how they were up X% and bullish on it. Then the people downvote and comment derogatory things, like &quot;you&#39;re stupid to think you&#39;d profit in the long run&quot; or &quot;that&#39;s a shitcoin&quot;. Turns out most of the time they know. Tell them to start taking profits instead.</p>\n\n<p>A lot of people came to make money, not for the tech, not caring if all the odds are against them as long as they make money. The point is we&#39;re in crypto and we&#39;re making money in a market that will be huge in the future.</p>\n\n<p><a href=\"/u/Weaver96\">u/Weaver96</a> did state after all, <em>Having this &quot;my coin is going to do better than your coin&quot; mentality is toxic. Most cryptocurrencies depend on each other&#39;s success and can coexist together perfectly.</em></p>\n\n<p>Edited the title.</p>\n</div><!-- SC_ON -->",
  "score": 818,
  "permalink": "/r/CryptoCurrency/comments/lvum4b/if_youre_making_money_from_crypto_whether_its_a/",
  "subreddit": "CryptoCurrency",
  "id": "lvum4b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937738012
}