{
  "author": "CainH1",
  "original_created_utc": 1634067577,
  "title": "Which one Cryptocurrency do you think will still be going strong in 10 years time come 2032?",
  "created_utc": 1634087617,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Besides the obvious answer of BTC or ETH which do you feel has the best potential to still be going strong?</p>\n\n<p>Now I’m not saying hit 20k value or anything just be still around, still going and have obviously gained in some way.</p>\n\n<p>For me I think I’d be torn between two answers those being ADA and ONE</p>\n\n<p>ADA if we are all lead to believe will be what Charles wants it to be would be immense, adoption from third world areas and countries could be massive and carry ADA on in 2032 still as the #3 crypto</p>\n\n<p>ONE although relatively newer and smaller has such a huge potential and looks amazing, I personally have been growing my bag of ONE each month without question as it is shaping up to be so so good</p>\n\n<p>But what crypto would you back to stand the rest of time?</p>\n\n<p>Edit: ONE in this case would be Harmony ONE for all those asking</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/q6tyft/which_one_cryptocurrency_do_you_think_will_still/",
  "subreddit": "CryptoCurrency",
  "id": "q6tyft",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Besides the obvious answer of BTC or ETH which do you feel has the best\npotential to still be going strong?\n\nNow I’m not saying hit 20k value or anything just be still around, still going\nand have obviously gained in some way.\n\nFor me I think I’d be torn between two answers those being ADA and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BTCとETHという明白な答えの他に、あなたはどちらが最も良い可能性を持っていると思いますか？\n好調を維持できる可能性があると思いますか？\n\n価値が2万円になったとかそういうことではなく、まだ存在していて、まだ続いていて、明らかに何らかの利益を得ているということです。\nそして明らかに何らかの利益を得ていることです。\n\n私の場合、ADAとETHという2つの答えの間で悩んでいると思います。",
      "title": "10年後の2032年にも存続している暗号通貨はどれだと思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "除了BTC和ETH这两个显而易见的答案之外，您觉得哪一个最有潜力的\n潜力仍然强劲？\n\n现在，我不是说要达到20K的价值或任何东西，只是仍然存在，仍然在继续\n并且显然在某些方面有所收获。\n\n对我来说，我想我会在两个答案中纠结，那就是ADA和...",
      "title": "你认为哪一种加密货币在10年后的2032年仍将强劲发展？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "除了BTC和ETH這兩個顯而易見的答案之外，您覺得哪一個最有潛力的\n潛力仍然強勁？\n\n現在，我不是說要達到20K的價值或任何東西，只是仍然存在，仍然在繼續\n並且顯然在某些方面有所收穫。\n\n對我來說，我想我會在兩個答案中糾結，那就是ADA和...",
      "title": "你認爲哪一種加密貨幣在10年後的2032年仍將強勁發展？"
    }
  ]
}