{
  "author": "CrunchyMemesLover",
  "original_created_utc": 1633839983,
  "title": "Is it wrong to feel like I'm not worthy my partner?",
  "created_utc": 1633886882,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have a boyfriend, he&#39;s very sweet and kind, and it feels like I&#39;m just not good enough for him. While he doesn&#39;t think that, to me it feels like I should be better, but for some reason I&#39;m not. I hate myself for that, and I&#39;ve never hated myself for anything before. We&#39;ve only been together for a rather short period of time, but I still don&#39;t want to lose him. It feels like I&#39;m having an internal conflict, I both think he deserves better but at the same time I want to be with him. I&#39;m trying to be better, but I just don&#39;t know if I am better. Is it wrong? What should I do?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/q511uw/is_it_wrong_to_feel_like_im_not_worthy_my_partner/",
  "subreddit": "TooAfraidToAsk",
  "id": "q511uw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have a boyfriend, he's very sweet and kind, and it feels like I'm just not\ngood enough for him. While he doesn't think that, to me it feels like I should\nbe better, but for some reason I'm not. I hate myself for that, and I've never\nhated myself for anything before. We've only been together for a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私には彼氏がいて、彼はとても優しくて親切なのですが、私は彼にとって不十分だと感じています。\n感じています。彼はそうは思っていないようですが、私にとっては、私はもっと良い存在であるべきだと感じています。\n彼はそうは思っていないようですが、私には、もっといい人がいるはずなのに、なぜかそうではないような気がします。そんな自分が嫌でたまりません。\n今まで何かで自分を嫌いになったことはありませんでした。私たちはまだ付き合って1年しか経っていないのに...。",
      "title": "自分がパートナーにふさわしくないと感じるのは間違っているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有一个男朋友，他很贴心，很善良，但我感觉自己对他不够好。\n对他不够好。虽然他不这么认为，但对我来说，感觉我应该\n但由于某些原因，我没有做到。我为此恨自己，我从来没有\n我从来没有为任何事情恨过自己。我们只在一起了一年多...",
      "title": "感觉我配不上我的伴侣有错吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一個男朋友，他很貼心，很善良，但我感覺自己對他不夠好。\n對他不夠好。雖然他不這麼認爲，但對我來說，感覺我應該\n但由於某些原因，我沒有做到。我爲此恨自己，我從來沒有\n我從來沒有爲任何事情恨過自己。我們只在一起了一年多...",
      "title": "感覺我配不上我的伴侶有錯嗎？"
    }
  ]
}