{
  "author": "John-not-a-Farmer",
  "the_new_excerpt": "A coup d'état in Myanmar began on the morning of 1 February 2021, when\ndemocratically elected members of the country's ruling party, the National\nLeague for Democracy, were deposed by the Tatmadaw—Myanmar's military—which then\nvested power in a stratocracy.…",
  "original_created_utc": 1618014491,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ミャンマーのクーデターは、2021年2月1日の朝に始まりました。\n2021年2月1日の朝、民主的に選出された与党「国民民主連盟」のメンバーが\n2021年2月1日の朝、民主的に選出された与党・国民民主連盟のメンバーが、ミャンマーの軍部であるタツマドーによって退陣させられた。\n政権を奪った。....",
      "title": "ミャンマーの人々を支援するために、現実的に何ができるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "缅甸的政变始于2021年2月1日上午，当时：\n执政党全国人民政权代表大会的民选成员。\n民主联盟，被缅甸政府军推翻。\n既得利益者....。",
      "title": "怎样做才能现实地援助缅甸人民？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "緬甸的政變始於2021年2月1日上午，當時：\n執政黨全國人民政權代表大會的民選成員。\n民主聯盟，被緬甸政府軍推翻。\n既得利益者....。",
      "title": "怎樣做才能現實地援助緬甸人民？"
    }
  ],
  "title": "What can realistically be done to aid the people of Myanmar?",
  "created_utc": 1618063192,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A coup d&#39;état in Myanmar began on the morning of 1 February 2021, when democratically elected members of the country&#39;s ruling party, the National League for Democracy, were deposed by the Tatmadaw—Myanmar&#39;s military—which then vested power in a stratocracy. <a href=\"https://en.wikipedia.org/wiki/2021_Myanmar_coup_d&#x27;%C3%A9tat\">Wikipedia</a>   </p>\n\n<p>Since that time, over 600 people have been killed indiscriminately by the military junta. Myanmar citizens of all ethnic groups united in protest and put their hopes in the United Nations to enact its Responsibility to Protect policy. But that action has been opposed by some member nations of the UN security council, primarily Russia and China. Similarly, the Association of Southeast Asian Nations (ASEAN) has stalled in discussions to take action beyond statements of condemnation. The United States has taken the most substantial action so far by suspending trade with industries thought to provide funding for the Tatmadaw forces.   </p>\n\n<p>Is there anything else that can be done to remove the junta from power and prevent further loss of life?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/Ask_Politics/comments/mnubbb/what_can_realistically_be_done_to_aid_the_people/",
  "subreddit": "Ask_Politics",
  "id": "mnubbb",
  "is_self": true,
  "media": null,
  "is_video": false
}