{
  "author": "Maarten2706",
  "original_created_utc": 1638199329,
  "title": "Why didn't serfdom disappear in Russia after the Black Death, like it did in many parts of Europe?",
  "created_utc": 1638234760,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was taught that serfdom gradually disappeared in Europe after the Black Death, due to a much lower working population. This had the effect of lords having to hire or convince other people to move to their land to work there. However, because there was a much higher demand for workers than the supply of them, workers started to have some leverage when dealing with serfdom and that whole deal. This is at least how I remember it and I know it&#39;s quite simplified.</p>\n\n<p>My question is why this effect didn&#39;t happen in Russia, where, at least to my knowledge, serfdom existed for centuries after the Black Death. Or am I underestimating how rapidly and widespread serfdom disappeared in the rest of Europe?</p>\n\n<p>Edit: Sorry for the bad explanation of my knowledge and weird formatting of my question, English isn&#39;t my first language.</p>\n</div><!-- SC_ON -->",
  "score": 215,
  "permalink": "/r/AskHistorians/comments/r4y40g/why_didnt_serfdom_disappear_in_russia_after_the/",
  "subreddit": "AskHistorians",
  "id": "r4y40g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was taught that serfdom gradually disappeared in Europe after the Black Death,\ndue to a much lower working population. This had the effect of lords having to\nhire or convince other people to move to their land to work there. However,\nbecause there was a much higher demand for workers than the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ヨーロッパでは黒死病以降、農奴制が徐々になくなっていったと教わりました。\n労働人口が大幅に減少したためです。これにより、領主は\n雇ったり、説得したりして、自分の土地に人を呼び寄せて働かせなければならなくなりました。しかし\nしかし、労働者の需要の方がはるかに高かったため...。",
      "title": "なぜロシアでは黒死病の後、ヨーロッパの多くの地域のように農奴制が消滅しなかったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我被告知，农奴制在黑死病后逐渐在欧洲消失了。\n因为劳动人口大大减少。这导致领主不得不\n雇佣或说服其他人搬到他们的土地上工作。然而。\n因为当时对工人的需求远远超过了。",
      "title": "为什么农奴制在黑死病后没有像在欧洲许多地方那样在俄罗斯消失？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我被告知，農奴制在黑死病後逐漸在歐洲消失了。\n因爲勞動人口大大減少。這導致領主不得不\n僱傭或說服其他人搬到他們的土地上工作。然而。\n因爲當時對工人的需求遠遠超過了。",
      "title": "爲什麼農奴制在黑死病後沒有像在歐洲許多地方那樣在俄羅斯消失？"
    }
  ]
}