{
  "author": "RusticBohemian",
  "original_created_utc": 1651009389,
  "title": "Bread was incredibly labor and energy-intensive to prepare. Why was it a staple for so many poor people in the premodern era when they could save time and energy by directly boiling whole grains or preparing them as part of a potage/porridge/soup?",
  "created_utc": 1651028362,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I realize there are some specific circumstances — like the urban poor of ancient Rome who lacked access to a fire/kitchen — where bread makes more sense. &lt;/p&gt;\n\n&lt;p&gt;But I&amp;#39;ve ground grain by hand. It&amp;#39;s incredibly time-consuming and monotonous.  Even if you could outsource it to a miller, you&amp;#39;re going to pay for it, and if you&amp;#39;re poor, why? &lt;/p&gt;\n\n&lt;p&gt;And while most poor peasants had access to a fire they could cook over, they&amp;#39;d probably need to pay a baker to bake their bread or, at best, spend time traveling to communal ovens. &lt;/p&gt;\n\n&lt;p&gt;On the other hand, it&amp;#39;s really easy to cook whole grains or prepare them as part of a porridge/pottage/soup. Doing so must have saved an incredible amount of time vs preparing bread. &lt;/p&gt;\n\n&lt;p&gt;So what&amp;#39;s the economic/time argument for bread? If I&amp;#39;m a poor peasant with limited time and energy and a ton of farmwork that needs to be done. Why do I devote time —or my equally busy wife&amp;#39;s time — to grinding bread, and my scarce money to paying a baker?&lt;/p&gt;\n\n&lt;p&gt;Do I like it that much? Is it easier to get than I&amp;#39;ve laid out here? Was bread really not as common as we assume?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 196,
  "permalink": "/r/AskHistorians/comments/ucnjua/bread_was_incredibly_labor_and_energyintensive_to/",
  "subreddit": "AskHistorians",
  "id": "ucnjua",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I realize there are some specific circumstances — like the urban poor of ancient\nRome who lacked access to a fire/kitchen — where bread makes more sense.\n\nBut I've ground grain by hand. It's incredibly time-consuming and monotonous.\nEven if you could outsource it to a miller, you're going to pay…"
}