{
  "author": "dragondude4",
  "the_new_excerpt": "The biggest drawbacks of the “most secure, decentralized network in the world”\nis that such a majority of its hashrate comes from a dystopian authoritarian\ncountry.\n\nYes the mempool would be unstable and flooded for a week or two, but then the\ndifficulty will adjust and new smaller miners will have…",
  "original_created_utc": 1621644976,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "世界で最も安全な分散型ネットワーク」の最大の難点は\n世界で最も安全な分散型ネットワーク」の最大の欠点は、そのハッシュレートの大部分がディストピア的な権威主義の国から来ていることです。\n国です。\n\n確かに1～2週間はメンプールが不安定になり、洪水のような状態になるでしょう。\nしかし、その後は難易度が調整され、新たな小規模マイナーが...",
      "title": "中国でのマイニング禁止は、正直、ビットコインに起こりうる最善のことです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个 \"世界上最安全的去中心化网络 \"的最大缺点\n的最大缺点是，它的大部分哈希值来自于一个乌托邦式的专制国家。\n国家。\n\n是的，矿池会不稳定，一两个星期内会被淹没，但随后\n困难将被调整，新的小矿工将有...",
      "title": "说实话，禁止在中国挖矿对比特币来说是最好的事情了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個 \"世界上最安全的去中心化網絡 \"的最大缺點\n的最大缺點是，它的大部分哈希值來自於一個烏托邦式的專制國家。\n國家。\n\n是的，礦池會不穩定，一兩個星期內會被淹沒，但隨後\n困難將被調整，新的小礦工將有...",
      "title": "說實話，禁止在中國挖礦對比特幣來說是最好的事情了。"
    }
  ],
  "title": "A ban on mining in China would honestly be the best thing that could happen to Bitcoin",
  "created_utc": 1621659838,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The biggest drawbacks of the “most secure, decentralized network in the world” is that such a majority of its hashrate comes from a dystopian authoritarian country. </p>\n\n<p>Yes the mempool would be unstable and flooded for a week or two, but then the difficulty will adjust and new smaller miners will have the opportunity to open up ANYWHERE else in the world making the network more decentralized then it has ever been before in the last 10 years. </p>\n\n<p>It’s pretty dangerous to let China have this power currently. Remember this is a place where they “disappear” people just for their opinions, have millions of people in <del>”re-education”</del> concentration camps. You think state actors can&#39;t do some serious damage if they get the order to do it?</p>\n</div><!-- SC_ON -->",
  "score": 2773,
  "permalink": "/r/CryptoCurrency/comments/ni78sq/a_ban_on_mining_in_china_would_honestly_be_the/",
  "subreddit": "CryptoCurrency",
  "id": "ni78sq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197383348
}