{
  "author": "Slainte042",
  "original_created_utc": 1638879984,
  "title": "Just a small reminder: If your coin falls by 20 % it needs to jump by 25 % to get back to the same price.",
  "created_utc": 1638905691,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know this may sound pretty obvious to most of us, but still this simple math fact is overlooked by many, especially new investors. This fact is very relevant in the context of the recent market dip and the current recovery we see. &lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s assume you bought a particular coin at the price of $100. If the market falls by 20 % you will be left with $80. The market starts recovering and your assets starts to grow but this time in order to have your initial investment it will need a 25 % rise to get back to $100. The price might fall with 20 % but it should jump by 25 % not by 20% to break even. &lt;/p&gt;\n\n&lt;p&gt;$100 - 20 %($20) = $80&lt;/p&gt;\n\n&lt;p&gt;$80 + 20 %($16) = $96&lt;/p&gt;\n\n&lt;p&gt;$80 + 25%($20) = $100&lt;/p&gt;\n\n&lt;p&gt;Happy investing! Don&amp;#39;t buy high and sell low.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/ray2r6/just_a_small_reminder_if_your_coin_falls_by_20_it/",
  "subreddit": "CryptoCurrency",
  "id": "ray2r6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know this may sound pretty obvious to most of us, but still this simple math\nfact is overlooked by many, especially new investors. This fact is very relevant\nin the context of the recent market dip and the current recovery we see.\n\nLet's assume you bought a particular coin at the price of $100.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このことは、ほとんどの人にとってごく当たり前のことに聞こえるかもしれませんが、それでもこの単純な数学は\nを、特に新しい投資家は見落としています。この事実は、非常に重要です。\n最近の市場の落ち込みと、現在の回復の状況について。\n\n例えば、あるコインを100ドルで購入したとします。",
      "title": "ちょっとした注意点です。コインが20%下落した場合、同じ価格に戻すには25%の上昇が必要です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道这对我们大多数人来说可能听起来很明显，但这个简单的数学知识\n的事实被许多人忽视了，尤其是新的投资者。这个事实非常重要\n在最近的市场下跌和目前我们看到的复苏的背景下，这个事实非常重要。\n\n让我们假设你以100美元的价格购买了一个特定的硬币....。",
      "title": "只是一个小小的提醒。如果你的钱币下跌了20%，它需要跳涨25%才能回到相同的价格。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道這對我們大多數人來說可能聽起來很明顯，但這個簡單的數學知識\n的事實被許多人忽視了，尤其是新的投資者。這個事實非常重要\n在最近的市場下跌和目前我們看到的復甦的背景下，這個事實非常重要。\n\n讓我們假設你以100美元的價格購買了一個特定的硬幣....。",
      "title": "只是一個小小的提醒。如果你的錢幣下跌了20%，它需要跳漲25%才能回到相同的價格。"
    }
  ]
}