{
  "approved_at_utc": null,
  "subreddit": "wallstreetbets",
  "selftext": "So, this week, we saw the start of the total collapse of the modern financial system and the end of the Bretton Woods era of international monetary policy.\n\nBold claim, yeah baby?  You're probably thinking this has to do with the war in Ukraine or something, right? Well, it does a little bit, but mostly it has to do with what happened with RSX and LME this week, and a little bit with what happened with Rivian.\n\n**TLDR: Wall Street, China, and Russia are all broke and shit is going to get real over the next few months.  Or, to put it another way, some dude named Noah moved next door and started building a boat in his backyard, and you're just beginning to feel some raindrops.**\n\nLet's start with the biggest shitshow out there, the London Metals Exchange, or LME.  A fair number of people are comparing what happened with LME and Nickel to what happened when Apex Clearing turned off the buy button for the meme stocks back in January of 2021.  And yes, I meant Apex Clearinghouse, not Robinhood you twits, Apex made RH do it, and a dozen other brokers as well.  Vlad was just a fall guy, and not the cool kind that was on TV back in the '80s.\n\nWhat the LME did can be split into two parts: \n\n1) they had a massive short squeeze that was fucking up prices, amplified by uncertainty from the war in Ukraine, so they completely halted trading.  This is entirely normal.  It's happened dozens of times in the 144 years they've been open.  Complete trading halts occur in all exchanges whenever shit starts getting fucked up.  For example, US markets were shut down for a week after 9/11.\n\n2) they fucking canceled 12 hours worth of completed trades.  This is the part that should get your knickers in a twist if you were actually wearing any.   \n\nNow, I know a lot of you are sitting there feeling smart thinking \"I know why they did it! They're criminals and stealing!\"  Well, you're right, but that's NOT why they canceled 12 hours of completed trades, just like Apex didn't turn off the meme buy button because they woke up and decided they really needed to use their broker apps to get their fuck on with retail in a big 'ol gang bang. \n\nNo, they did this for one reason and one reason only: survival.  They were dead.  LME let the Nickel market get so fucked up that they not only had to stop transactions, or unwind a couple at the end, they had to unwind 12 fucking hours worth of trading.  I mean, these people are so goddamned incompetent that they didn't even realize they'd been shot in the head, skinned, and turned into a fucking rug for two whole shifts at Wendy's!\n\nUnderstand, they just set 144 years of skimming trades on fire.  It's not little guys buying FDs on the LME, it's big boys and industrial giants.  They all have lawyers and elected officials on retainer, and all of those clients are as done and gone as your made up Canadian girlfriend from grade school.\n\nI can't decide if the best part of all this is the cover story they put out, or how many dumbfucks didn't take three seconds to realize its bullshit.  The idea that Xiang Guangda just said \"I don't want to pay the margin call\" and then the LME was like, \"ok, well, I guess that sucks to be us, guess we'll just pour all this gasoline on ourselves and play with matches\" is so laughable I just got a hernia from ROFLing so hard.  Look, because I know you 'tards are all stuck on the shortbus trying to figure out what I'm talking about, I'll just drive ya'll on over to the explanation:\n\nTsingshan (the company Xiang owns that has the short position) isn't some kind of nickel producer like the papers are saying.  They make steel.  They're the second largest (largest by revenue) steel making company in China.  You know what that steel is used for?  Construction.  Know who hasn't had enough money to make a bond payment in over six months now?  Every goddamned construction company and developer in China.  What, you think they're paying their fucking materials bills?  \n\nHere's a quote from the South China Morning Post attributed to Xiang:\n\n *“Foreigners have some activities going on \\[against Tsingshan’s position,\\] we are actively coordinating \\[to tackle the problem\\],” China Business News cited Xiang as saying in a report late on Tuesday. “We have received a lot of phone calls today – related government departments and leaders are very supportive to us. Tsingshan’s position, operation and management has no problems.”* \n\nAgain, because I know you can't read, here's a translation of that quote into a picture.\n\n[I specifically said there are no problems, so it's all okay!](https://preview.redd.it/e4shtzkzqwm81.jpg?width=1366&amp;format=pjpg&amp;auto=webp&amp;s=19e41c0ca232b1309c0abd65f624d5e4f849183c)\n\nNow, why is it such a huge problem that Xiang has no money?  Well, if he can't make the margin call, the short position, much like a politician or anyone who's daddy donated a library to get them into Harvard, fails upwards.  First it goes up to Xiang's bank, which is also fucking broke.  Then it moves onto the LME itself, which again, doesn't have the fucking money.  So what does the LME do?  Same thing the mobsters in Goodfellas did when the restaurant was too broke to steal from anymore, they set everything on fire.  The reason the LME hasn't opened back up yet is because the short position is still there, and nobody who's responsible for that position has the money to cover it.\n\nNow, you might think, if you were smart instead of so dumb you went to Bangkok to get a TIE Fighter, why does this Xiang guy have such a large naked short position he can't cover?  The answer is simplicity itself - he's broke, so he naked shorted his own shit to get paid, then got fucked when it went sideways.  I mean, people here on WSB like to call themselves reckless degenerates, but lemme give you a full \"trust me bro\" on this one, ya'll ain't got shit on the stupid rich fucks that run the world.\n\nThat's part one.  What about part 2, RSX?  Well, as many people who lost money Friday can attest, some serious, serious fucking of Put options occurred.  Van Eck started to liquidate the RSX fund, but they didn't *say* they were liquidating it, so options couldn't settle as cash value.  But they ALSO halted trading of the ETF, so options couldn't be traded either.  And as a final piece of fuck you brokers weren't letting people borrow shares to even fucking exercise the put option themselves.  Wild yeah? (someone else wrote a very good DD on this exact thing this morning, I highly recommend you go read it - no link because automod hates me every time I put a link in my posts)\n\nThis is example number two of someone burning down the restaurant because they couldn't steal from it anymore.  Whatever MM sold those options didn't have enough to cover them, so this shit with Van Eck not stating the fund was liquidating happened.\n\nThat's strike two for all the market makers and exchanges being fucking broker than you when you've gotta go behind the Taco Bell because Wendy's is too high class for your ass.  Let's see if we can a third K to finish them off.\n\nI give you Rivian, ticker RIVN, a truly shitty EV manufacturer, that like most of them can't actually make cars.  These guys are such a clown show that they tried to raise the prices on the pre-orders from the people who waited years to get one.  So they had earnings on 3/10, and it was just about as big of a disaster as you'd expect.  Then, after hours, they dropped $6 bucks on nearly a million in volume.  Everyone who bought puts printed, right?  Nope.  The next day in pre-market, on less than a third of that volume, the price magically shot back up $5.5 bucks, completely wiping out everyone's puts.  By EOD the price had only dropped a total of $3 bucks from Thursday's close, and wouldn't you know it, the price of an ATM put option bought EOD on 3/10 was more than $3. I'd recommend taking a look at the volume numbers and corresponding price movement of RIVN throughout the day on 3/11 and drawing your own conclusions.\n\nThis is like the, what, hundredth and a half time we've seen this exact thing play out now?  It's not an accident.  More money is traded every day in the market on options than stocks themselves.  When the PFOF brokers that retail uses publicly refer to the MMs as \"our clients\", you know the fix is in.  What makes the RIVN bit so interesting is a) how obvious it is, and b) that they're doing this while under DOJ investigation for this exact fucking thing.  That tells me two things, 1) they don't think they'll actually be prosecuted - which, fair, they've got a whole lot of history on their side for this one, and 2) they don't have a choice 'cause they're running out of money.\n\nAnd why, you may ask are they out of money?  Well, it's a mix of things.  1) all the attention from Reddit and the media and law enforcement has clients pulling money from Hedge Funds, leading to sell offs, which when you're leveraged at 137x, leads to a rapid collapse in your buying power. 2)  Russian assets aren't just in freefall anymore, they've hit the ground and started drilling for oil.  3) remember where I was talking about China earlier?  Yeah, their shit is worth even less than the Russian stuff, but thanks to Xi's brilliant leadership plan, people haven't realized that yet.  Below, I have obtained exclusive photo evidence from some of my old SF buddies of Xi and his top councilor enacting their plan to save China's economy.\n\n&amp;#x200B;\n\n[If we can't see the lines go down, then are they really dropping?](https://preview.redd.it/r254e9n2rzm81.jpg?width=444&amp;format=pjpg&amp;auto=webp&amp;s=e27e89a6f0629808f8be2f7557a8aa35d6dbcf8a)\n\nAs always, the official info coming out of China is a mix of fantasy, lies, and flat out ignorance, spiced up by a heaping helping of corrupt incompetence.  Because Xi is a tinpot wannabe dictator with delusions of Imperial grandeur, he wanted to make sure that while he was hosting the Olympics everything went off without a hitch, so he told all the companies and rich people in China to make like autists and buy the fucking dip in the equities and bond markets.\n\nBecause all those folks didn't want to get executed by anti-aircraft guns while their families went to the organ donor farms, they did.  Which in this case, means throwing good money after very very very bad money.  It's honestly difficult to describe just how badly China has sabotaged itself.  I'm sure you all know by now about the ghost cities made up of structurally unsound buildings with no interiors, and in some cases no exterior walls.  But, do you also know about all the railways to nowhere that aren't being serviced or maintained?  Do you also know how many MORE shitty tofu-dreg buildings have been paid for by citizens' life savings that aren't yet built?  Spoiler, it's a lot.\n\nMeanwhile, the property market in China is in free fall.  Here's a chart of official chinese statistics on the price of housing.\n\n&amp;#x200B;\n\n[Taken directly from the National Bureau of Statistics of China](https://preview.redd.it/dskl8tmog0n81.png?width=730&amp;format=png&amp;auto=webp&amp;s=98f46d6498440cde7e703d5b55041ec38c6db306)\n\nNow, these prices all reflect worthless tofu-dreg empty apartments that exist only to sell to the next sucker/investor.  Notice that trend line?  Anyone know what happens when that price increase gets closer to zero?  As our friend Lelu from the 5th Element would say \"bada bing boom!\".  For another reference, look at the Dutch tulip market after it popped.  Remember, these are the official Chinese govt numbers.  I'm guessing the actual numbers have gone negative already.\n\nWestern banks, particularly up in Canada, are extremely exposed to the bonds these empty shell apartments are backing.  Western banks, again particularly up in Canada, are also heavily exposed to the commercial and residential real estate markets.  Both of which are in massive fucking bubbles funded in large part by money from Wall Street, Russia, and China.  Guess which of those are now broke (hint: it's all three of them).  CMBS notes started going bad this month - there's a reason all the politicians all of a sudden decided we needed to be back in the office, and the mortgage missed payment rate is skyrocketing faster than the price of oil.  I have not yet been able to figure out if the spike in missed mortgage payments is banks/wall street failing to pay on all the properties they've accumulated, if it's all the missing repossessions from the pandemic finally showing up, or if it's a leading indicator of a new crisis.\n\nI don't know how much longer the powers-that-be can keep these balls in the air, but it's not much longer.  Assuming Russia follows their playbook from the disaster they had in Grozny in '94/'95, we're about to see the major cities in Ukraine get leveled by heavy artillery and rocket attacks.  Which means you can pretty much kiss the Ukrainian wheat harvest goodbye, because all the infrastructure needed to support it will be rubble, along with the roads and bridges you'd need to get it out of the country.  Couple that with what looks to be bad wheat harvests in the US and China barring some big weather pattern shifts, and we're going to see some massive price spikes in the price of bread and other food this summer.  Expensive food = political instability and riots.\n\nThe US will see a fresh round of \"race riots\" sparked by random online videos that are really about inflation and economic inequality, but the media and politicians will go full hog on the race angle, and people will buy it - if you need proof the general population is that gullible, look at how many think the Ukraine war is responsible for inflation and gas prices.  South Africa and Turkey, plus an unkown number of Middle Eastern countries will see Syrian civil war/Arab Spring type uprisings - remember, the Tunisian revolt started as a protest about the price of bread.\n\nFinally, since this is already way, way, way too long for any of you to actually read through, much less comprehend, I'll cut the part about Bretton Woods and the dollar as the international currency super short - there used to be one global financial system that was set up after WWII in a conference at Bretton Woods, hence the name.  By kicking Russia out of it, we forced the creation of a competing global economic system.  Which will likely be headed by China.  That pretty much guarantees another world war down the road, but hopefully not for a decade or two if we're really lucky.\n\nBecause I know my people, here are some tickers to throw money at if you want, I have extremely tiny positions (like one share in a couple of these) in all of them: long WEAT, SOYB, CORN, USO, YANG, short TUR, short EZA, short SPY/QQQ/DOW, long GME.  Oh, and I also just bought a Lincoln, because in addition to chips, the automakers are about to be short on metals too, and somehow a car counts as a fucking growth investment these days.\n\nIf I had the money to do so, I'd also buy farmland with wind turbines and/or solar on it.  Real assets are about to be king, especially food and energy, which are the definition of real assets with inelastic demand.\n\nI'll be honest, the vast majority of my portfolio - over 90%, is in direct registered shares of GME, with a couple shares of AMC because fuck 'em, that's why.  I think at least a couple of brokers are going to detonate like we're seeing with the LME and fuckery like what happened with RSX will become more regular.  Whenever I have a big gain, I pull most of it out and buy more memes and then DRS them.\n\nThat IS financial advice by the way, but you probably shouldn't follow it.",
  "author_fullname": "t2_a57oe8f9",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 1,
  "clicked": false,
  "title": "This is How the (Financial) World Ends",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "DD"
    }
  ],
  "subreddit_name_prefixed": "r/wallstreetbets",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": "dd",
  "downs": 0,
  "thumbnail_height": 78,
  "top_awarded_type": null,
  "hide_score": false,
  "media_metadata": {
    "e4shtzkzqwm81": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 60,
          "x": 108,
          "u": "https://preview.redd.it/e4shtzkzqwm81.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=1b87eadb824c2114b4c4581d1f1901c3b6cc232f"
        },
        {
          "y": 121,
          "x": 216,
          "u": "https://preview.redd.it/e4shtzkzqwm81.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=f4b1365ae814476aade6051fdc4c741a712ef902"
        },
        {
          "y": 179,
          "x": 320,
          "u": "https://preview.redd.it/e4shtzkzqwm81.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=293a4d4125044c0f23c2197263e8795d8464196e"
        },
        {
          "y": 359,
          "x": 640,
          "u": "https://preview.redd.it/e4shtzkzqwm81.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=8eb78a75d53b6df36be9b84c24ebbc5281a93a2d"
        },
        {
          "y": 539,
          "x": 960,
          "u": "https://preview.redd.it/e4shtzkzqwm81.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=694034918776c1b46a0e951b3e58d8682d3b6830"
        },
        {
          "y": 607,
          "x": 1080,
          "u": "https://preview.redd.it/e4shtzkzqwm81.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=ff1f879d200a87f265628c9c5bdfbc2addbbd1df"
        }
      ],
      "s": {
        "y": 768,
        "x": 1366,
        "u": "https://preview.redd.it/e4shtzkzqwm81.jpg?width=1366&amp;format=pjpg&amp;auto=webp&amp;s=19e41c0ca232b1309c0abd65f624d5e4f849183c"
      },
      "id": "e4shtzkzqwm81"
    },
    "r254e9n2rzm81": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 72,
          "x": 108,
          "u": "https://preview.redd.it/r254e9n2rzm81.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=5469cf71520a8ff746bc416579bbd8d684eb1f6a"
        },
        {
          "y": 144,
          "x": 216,
          "u": "https://preview.redd.it/r254e9n2rzm81.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=51f67c1f1ad05e1cc82fb391758897cb3bd97a72"
        },
        {
          "y": 214,
          "x": 320,
          "u": "https://preview.redd.it/r254e9n2rzm81.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=2d9e62b765cf6f19b8e560995c075900a2532a7b"
        }
      ],
      "s": {
        "y": 297,
        "x": 444,
        "u": "https://preview.redd.it/r254e9n2rzm81.jpg?width=444&amp;format=pjpg&amp;auto=webp&amp;s=e27e89a6f0629808f8be2f7557a8aa35d6dbcf8a"
      },
      "id": "r254e9n2rzm81"
    },
    "dskl8tmog0n81": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 50,
          "x": 108,
          "u": "https://preview.redd.it/dskl8tmog0n81.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=a1a0847a84eb352f2bb293fa46dde9cad6778122"
        },
        {
          "y": 100,
          "x": 216,
          "u": "https://preview.redd.it/dskl8tmog0n81.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=91883cd10d767c4cfa5988cf63b1a4700432e1ab"
        },
        {
          "y": 149,
          "x": 320,
          "u": "https://preview.redd.it/dskl8tmog0n81.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=7d123511ba4ce301e73c2faeb6b01b04d1c05696"
        },
        {
          "y": 298,
          "x": 640,
          "u": "https://preview.redd.it/dskl8tmog0n81.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=433a726323527c309bd6f1f0bab31976c911bcc5"
        }
      ],
      "s": {
        "y": 340,
        "x": 730,
        "u": "https://preview.redd.it/dskl8tmog0n81.png?width=730&amp;format=png&amp;auto=webp&amp;s=98f46d6498440cde7e703d5b55041ec38c6db306"
      },
      "id": "dskl8tmog0n81"
    }
  },
  "name": "t3_tcqov5",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.9,
  "author_flair_background_color": "",
  "subreddit_type": "public",
  "ups": 7404,
  "total_awards_received": 28,
  "media_embed": {},
  "thumbnail_width": 140,
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "DD",
  "can_mod_post": false,
  "score": 7404,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "https://b.thumbs.redditmedia.com/fMrLQRgQzQC0otbjoz5EeVqkYFVUk7hXl5hUEGKf9YQ.jpg",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 1,
    "gid_2": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1647118671,
  "link_flair_type": "richtext",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.wallstreetbets",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, this week, we saw the start of the total collapse of the modern financial system and the end of the Bretton Woods era of international monetary policy.&lt;/p&gt;\n\n&lt;p&gt;Bold claim, yeah baby?  You&amp;#39;re probably thinking this has to do with the war in Ukraine or something, right? Well, it does a little bit, but mostly it has to do with what happened with RSX and LME this week, and a little bit with what happened with Rivian.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TLDR: Wall Street, China, and Russia are all broke and shit is going to get real over the next few months.  Or, to put it another way, some dude named Noah moved next door and started building a boat in his backyard, and you&amp;#39;re just beginning to feel some raindrops.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s start with the biggest shitshow out there, the London Metals Exchange, or LME.  A fair number of people are comparing what happened with LME and Nickel to what happened when Apex Clearing turned off the buy button for the meme stocks back in January of 2021.  And yes, I meant Apex Clearinghouse, not Robinhood you twits, Apex made RH do it, and a dozen other brokers as well.  Vlad was just a fall guy, and not the cool kind that was on TV back in the &amp;#39;80s.&lt;/p&gt;\n\n&lt;p&gt;What the LME did can be split into two parts: &lt;/p&gt;\n\n&lt;p&gt;1) they had a massive short squeeze that was fucking up prices, amplified by uncertainty from the war in Ukraine, so they completely halted trading.  This is entirely normal.  It&amp;#39;s happened dozens of times in the 144 years they&amp;#39;ve been open.  Complete trading halts occur in all exchanges whenever shit starts getting fucked up.  For example, US markets were shut down for a week after 9/11.&lt;/p&gt;\n\n&lt;p&gt;2) they fucking canceled 12 hours worth of completed trades.  This is the part that should get your knickers in a twist if you were actually wearing any.   &lt;/p&gt;\n\n&lt;p&gt;Now, I know a lot of you are sitting there feeling smart thinking &amp;quot;I know why they did it! They&amp;#39;re criminals and stealing!&amp;quot;  Well, you&amp;#39;re right, but that&amp;#39;s NOT why they canceled 12 hours of completed trades, just like Apex didn&amp;#39;t turn off the meme buy button because they woke up and decided they really needed to use their broker apps to get their fuck on with retail in a big &amp;#39;ol gang bang. &lt;/p&gt;\n\n&lt;p&gt;No, they did this for one reason and one reason only: survival.  They were dead.  LME let the Nickel market get so fucked up that they not only had to stop transactions, or unwind a couple at the end, they had to unwind 12 fucking hours worth of trading.  I mean, these people are so goddamned incompetent that they didn&amp;#39;t even realize they&amp;#39;d been shot in the head, skinned, and turned into a fucking rug for two whole shifts at Wendy&amp;#39;s!&lt;/p&gt;\n\n&lt;p&gt;Understand, they just set 144 years of skimming trades on fire.  It&amp;#39;s not little guys buying FDs on the LME, it&amp;#39;s big boys and industrial giants.  They all have lawyers and elected officials on retainer, and all of those clients are as done and gone as your made up Canadian girlfriend from grade school.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t decide if the best part of all this is the cover story they put out, or how many dumbfucks didn&amp;#39;t take three seconds to realize its bullshit.  The idea that Xiang Guangda just said &amp;quot;I don&amp;#39;t want to pay the margin call&amp;quot; and then the LME was like, &amp;quot;ok, well, I guess that sucks to be us, guess we&amp;#39;ll just pour all this gasoline on ourselves and play with matches&amp;quot; is so laughable I just got a hernia from ROFLing so hard.  Look, because I know you &amp;#39;tards are all stuck on the shortbus trying to figure out what I&amp;#39;m talking about, I&amp;#39;ll just drive ya&amp;#39;ll on over to the explanation:&lt;/p&gt;\n\n&lt;p&gt;Tsingshan (the company Xiang owns that has the short position) isn&amp;#39;t some kind of nickel producer like the papers are saying.  They make steel.  They&amp;#39;re the second largest (largest by revenue) steel making company in China.  You know what that steel is used for?  Construction.  Know who hasn&amp;#39;t had enough money to make a bond payment in over six months now?  Every goddamned construction company and developer in China.  What, you think they&amp;#39;re paying their fucking materials bills?  &lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s a quote from the South China Morning Post attributed to Xiang:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;“Foreigners have some activities going on [against Tsingshan’s position,] we are actively coordinating [to tackle the problem],” China Business News cited Xiang as saying in a report late on Tuesday. “We have received a lot of phone calls today – related government departments and leaders are very supportive to us. Tsingshan’s position, operation and management has no problems.”&lt;/em&gt; &lt;/p&gt;\n\n&lt;p&gt;Again, because I know you can&amp;#39;t read, here&amp;#39;s a translation of that quote into a picture.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/e4shtzkzqwm81.jpg?width=1366&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=19e41c0ca232b1309c0abd65f624d5e4f849183c\"&gt;I specifically said there are no problems, so it&amp;#39;s all okay!&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Now, why is it such a huge problem that Xiang has no money?  Well, if he can&amp;#39;t make the margin call, the short position, much like a politician or anyone who&amp;#39;s daddy donated a library to get them into Harvard, fails upwards.  First it goes up to Xiang&amp;#39;s bank, which is also fucking broke.  Then it moves onto the LME itself, which again, doesn&amp;#39;t have the fucking money.  So what does the LME do?  Same thing the mobsters in Goodfellas did when the restaurant was too broke to steal from anymore, they set everything on fire.  The reason the LME hasn&amp;#39;t opened back up yet is because the short position is still there, and nobody who&amp;#39;s responsible for that position has the money to cover it.&lt;/p&gt;\n\n&lt;p&gt;Now, you might think, if you were smart instead of so dumb you went to Bangkok to get a TIE Fighter, why does this Xiang guy have such a large naked short position he can&amp;#39;t cover?  The answer is simplicity itself - he&amp;#39;s broke, so he naked shorted his own shit to get paid, then got fucked when it went sideways.  I mean, people here on WSB like to call themselves reckless degenerates, but lemme give you a full &amp;quot;trust me bro&amp;quot; on this one, ya&amp;#39;ll ain&amp;#39;t got shit on the stupid rich fucks that run the world.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s part one.  What about part 2, RSX?  Well, as many people who lost money Friday can attest, some serious, serious fucking of Put options occurred.  Van Eck started to liquidate the RSX fund, but they didn&amp;#39;t &lt;em&gt;say&lt;/em&gt; they were liquidating it, so options couldn&amp;#39;t settle as cash value.  But they ALSO halted trading of the ETF, so options couldn&amp;#39;t be traded either.  And as a final piece of fuck you brokers weren&amp;#39;t letting people borrow shares to even fucking exercise the put option themselves.  Wild yeah? (someone else wrote a very good DD on this exact thing this morning, I highly recommend you go read it - no link because automod hates me every time I put a link in my posts)&lt;/p&gt;\n\n&lt;p&gt;This is example number two of someone burning down the restaurant because they couldn&amp;#39;t steal from it anymore.  Whatever MM sold those options didn&amp;#39;t have enough to cover them, so this shit with Van Eck not stating the fund was liquidating happened.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s strike two for all the market makers and exchanges being fucking broker than you when you&amp;#39;ve gotta go behind the Taco Bell because Wendy&amp;#39;s is too high class for your ass.  Let&amp;#39;s see if we can a third K to finish them off.&lt;/p&gt;\n\n&lt;p&gt;I give you Rivian, ticker RIVN, a truly shitty EV manufacturer, that like most of them can&amp;#39;t actually make cars.  These guys are such a clown show that they tried to raise the prices on the pre-orders from the people who waited years to get one.  So they had earnings on 3/10, and it was just about as big of a disaster as you&amp;#39;d expect.  Then, after hours, they dropped $6 bucks on nearly a million in volume.  Everyone who bought puts printed, right?  Nope.  The next day in pre-market, on less than a third of that volume, the price magically shot back up $5.5 bucks, completely wiping out everyone&amp;#39;s puts.  By EOD the price had only dropped a total of $3 bucks from Thursday&amp;#39;s close, and wouldn&amp;#39;t you know it, the price of an ATM put option bought EOD on 3/10 was more than $3. I&amp;#39;d recommend taking a look at the volume numbers and corresponding price movement of RIVN throughout the day on 3/11 and drawing your own conclusions.&lt;/p&gt;\n\n&lt;p&gt;This is like the, what, hundredth and a half time we&amp;#39;ve seen this exact thing play out now?  It&amp;#39;s not an accident.  More money is traded every day in the market on options than stocks themselves.  When the PFOF brokers that retail uses publicly refer to the MMs as &amp;quot;our clients&amp;quot;, you know the fix is in.  What makes the RIVN bit so interesting is a) how obvious it is, and b) that they&amp;#39;re doing this while under DOJ investigation for this exact fucking thing.  That tells me two things, 1) they don&amp;#39;t think they&amp;#39;ll actually be prosecuted - which, fair, they&amp;#39;ve got a whole lot of history on their side for this one, and 2) they don&amp;#39;t have a choice &amp;#39;cause they&amp;#39;re running out of money.&lt;/p&gt;\n\n&lt;p&gt;And why, you may ask are they out of money?  Well, it&amp;#39;s a mix of things.  1) all the attention from Reddit and the media and law enforcement has clients pulling money from Hedge Funds, leading to sell offs, which when you&amp;#39;re leveraged at 137x, leads to a rapid collapse in your buying power. 2)  Russian assets aren&amp;#39;t just in freefall anymore, they&amp;#39;ve hit the ground and started drilling for oil.  3) remember where I was talking about China earlier?  Yeah, their shit is worth even less than the Russian stuff, but thanks to Xi&amp;#39;s brilliant leadership plan, people haven&amp;#39;t realized that yet.  Below, I have obtained exclusive photo evidence from some of my old SF buddies of Xi and his top councilor enacting their plan to save China&amp;#39;s economy.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/r254e9n2rzm81.jpg?width=444&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=e27e89a6f0629808f8be2f7557a8aa35d6dbcf8a\"&gt;If we can&amp;#39;t see the lines go down, then are they really dropping?&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;As always, the official info coming out of China is a mix of fantasy, lies, and flat out ignorance, spiced up by a heaping helping of corrupt incompetence.  Because Xi is a tinpot wannabe dictator with delusions of Imperial grandeur, he wanted to make sure that while he was hosting the Olympics everything went off without a hitch, so he told all the companies and rich people in China to make like autists and buy the fucking dip in the equities and bond markets.&lt;/p&gt;\n\n&lt;p&gt;Because all those folks didn&amp;#39;t want to get executed by anti-aircraft guns while their families went to the organ donor farms, they did.  Which in this case, means throwing good money after very very very bad money.  It&amp;#39;s honestly difficult to describe just how badly China has sabotaged itself.  I&amp;#39;m sure you all know by now about the ghost cities made up of structurally unsound buildings with no interiors, and in some cases no exterior walls.  But, do you also know about all the railways to nowhere that aren&amp;#39;t being serviced or maintained?  Do you also know how many MORE shitty tofu-dreg buildings have been paid for by citizens&amp;#39; life savings that aren&amp;#39;t yet built?  Spoiler, it&amp;#39;s a lot.&lt;/p&gt;\n\n&lt;p&gt;Meanwhile, the property market in China is in free fall.  Here&amp;#39;s a chart of official chinese statistics on the price of housing.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/dskl8tmog0n81.png?width=730&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=98f46d6498440cde7e703d5b55041ec38c6db306\"&gt;Taken directly from the National Bureau of Statistics of China&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Now, these prices all reflect worthless tofu-dreg empty apartments that exist only to sell to the next sucker/investor.  Notice that trend line?  Anyone know what happens when that price increase gets closer to zero?  As our friend Lelu from the 5th Element would say &amp;quot;bada bing boom!&amp;quot;.  For another reference, look at the Dutch tulip market after it popped.  Remember, these are the official Chinese govt numbers.  I&amp;#39;m guessing the actual numbers have gone negative already.&lt;/p&gt;\n\n&lt;p&gt;Western banks, particularly up in Canada, are extremely exposed to the bonds these empty shell apartments are backing.  Western banks, again particularly up in Canada, are also heavily exposed to the commercial and residential real estate markets.  Both of which are in massive fucking bubbles funded in large part by money from Wall Street, Russia, and China.  Guess which of those are now broke (hint: it&amp;#39;s all three of them).  CMBS notes started going bad this month - there&amp;#39;s a reason all the politicians all of a sudden decided we needed to be back in the office, and the mortgage missed payment rate is skyrocketing faster than the price of oil.  I have not yet been able to figure out if the spike in missed mortgage payments is banks/wall street failing to pay on all the properties they&amp;#39;ve accumulated, if it&amp;#39;s all the missing repossessions from the pandemic finally showing up, or if it&amp;#39;s a leading indicator of a new crisis.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know how much longer the powers-that-be can keep these balls in the air, but it&amp;#39;s not much longer.  Assuming Russia follows their playbook from the disaster they had in Grozny in &amp;#39;94/&amp;#39;95, we&amp;#39;re about to see the major cities in Ukraine get leveled by heavy artillery and rocket attacks.  Which means you can pretty much kiss the Ukrainian wheat harvest goodbye, because all the infrastructure needed to support it will be rubble, along with the roads and bridges you&amp;#39;d need to get it out of the country.  Couple that with what looks to be bad wheat harvests in the US and China barring some big weather pattern shifts, and we&amp;#39;re going to see some massive price spikes in the price of bread and other food this summer.  Expensive food = political instability and riots.&lt;/p&gt;\n\n&lt;p&gt;The US will see a fresh round of &amp;quot;race riots&amp;quot; sparked by random online videos that are really about inflation and economic inequality, but the media and politicians will go full hog on the race angle, and people will buy it - if you need proof the general population is that gullible, look at how many think the Ukraine war is responsible for inflation and gas prices.  South Africa and Turkey, plus an unkown number of Middle Eastern countries will see Syrian civil war/Arab Spring type uprisings - remember, the Tunisian revolt started as a protest about the price of bread.&lt;/p&gt;\n\n&lt;p&gt;Finally, since this is already way, way, way too long for any of you to actually read through, much less comprehend, I&amp;#39;ll cut the part about Bretton Woods and the dollar as the international currency super short - there used to be one global financial system that was set up after WWII in a conference at Bretton Woods, hence the name.  By kicking Russia out of it, we forced the creation of a competing global economic system.  Which will likely be headed by China.  That pretty much guarantees another world war down the road, but hopefully not for a decade or two if we&amp;#39;re really lucky.&lt;/p&gt;\n\n&lt;p&gt;Because I know my people, here are some tickers to throw money at if you want, I have extremely tiny positions (like one share in a couple of these) in all of them: long WEAT, SOYB, CORN, USO, YANG, short TUR, short EZA, short SPY/QQQ/DOW, long GME.  Oh, and I also just bought a Lincoln, because in addition to chips, the automakers are about to be short on metals too, and somehow a car counts as a fucking growth investment these days.&lt;/p&gt;\n\n&lt;p&gt;If I had the money to do so, I&amp;#39;d also buy farmland with wind turbines and/or solar on it.  Real assets are about to be king, especially food and energy, which are the definition of real assets with inelastic demand.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll be honest, the vast majority of my portfolio - over 90%, is in direct registered shares of GME, with a couple shares of AMC because fuck &amp;#39;em, that&amp;#39;s why.  I think at least a couple of brokers are going to detonate like we&amp;#39;re seeing with the LME and fuckery like what happened with RSX will become more regular.  Whenever I have a big gain, I pull most of it out and buy more memes and then DRS them.&lt;/p&gt;\n\n&lt;p&gt;That IS financial advice by the way, but you probably shouldn&amp;#39;t follow it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "5692ce02-b860-11e5-b542-0edc7016bbd3",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": "",
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2th52",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#365b8c",
  "id": "tcqov5",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "catbulliesdog",
  "discussion_type": null,
  "num_comments": 394,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": "",
  "permalink": "/r/wallstreetbets/comments/tcqov5/this_is_how_the_financial_world_ends/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/wallstreetbets/comments/tcqov5/this_is_how_the_financial_world_ends/",
  "subreddit_subscribers": 11745792,
  "created_utc": 1647130375,
  "num_crossposts": 2,
  "media": null,
  "is_video": false,
  "original_created_utc": 1647118671,
  "the_new_excerpt": "So, this week, we saw the start of the total collapse of the modern financial\nsystem and the end of the Bretton Woods era of international monetary policy.\n\nBold claim, yeah baby? You're probably thinking this has to do with the war in\nUkraine or something, right? Well, it does a little bit, but…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今週は、現代金融の完全な崩壊の始まりを見たわけです。\nシステム、そして国際通貨政策のブレトンウッズ時代の終焉。\n\n大胆な主張だね、ベイビー？おそらく皆さんは、これが戦争と関係があるとお考えでしょう。\nウクライナか何かでしょう？まあ、少しはあるんですが...",
      "title": "これが（金融）世界の終わり方だ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，本周，我们看到了现代金融体系全面崩溃的开始\n体系的全面崩溃和国际货币政策的布雷顿森林时代的结束。\n\n大胆的说法，是吗，宝贝？你可能在想，这与乌克兰的战争有关。\n乌克兰的战争或什么的，对吗？嗯，确实有一点，但是...",
      "title": "这就是（金融）世界的结束方式"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，本週，我們看到了現代金融體系全面崩潰的開始\n體系的全面崩潰和國際貨幣政策的佈雷頓森林時代的結束。\n\n大膽的說法，是嗎，寶貝？你可能在想，這與烏克蘭的戰爭有關。\n烏克蘭的戰爭或什麼的，對嗎？嗯，確實有一點，但是...",
      "title": "這就是（金融）世界的結束方式"
    }
  ],
  "source_updated_at": 1647596543847
}