{
  "author": "Thich_QuangDuc",
  "original_created_utc": 1638136265,
  "title": "Whales control the market and will manipulate it at their whim",
  "created_utc": 1638142219,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>That&#39;s it, Whales control the market and there&#39;s nothing much you can do about it other than to play long term</p>\n\n<p>Today the sentiment here was of death... in a few a minutes a lot of buying orders and BTC pumped 2k up and alts followed. Do you think this is organic?</p>\n\n<p>Of course not! Whales are playing with the market and will continue to do so and take money off from retail, specially when you buy at the top and panic sell</p>\n\n<p>Other way to lose larges amount of money to whales is leveraging. A lot of shorts got blasted in the last 2 hours</p>\n\n<p>Just check Whale Alert twitter, there are millions and billions of dollar moving from just a few wallets.</p>\n\n<p>Even if everyone in this sub chipped in with 10 USD$, it wouldn&#39;t even come close to whales&#39; power. See this transactions just a few hours ago: &quot; 129,921,132 USDT (129,921,132 USD) transferred from unknown wallet to BINANCE &quot;. That&#39;s over 30 USD for each one here! And that&#39;s just one Whale</p>\n\n<p>TLDR: That&#39;s it boys and girls, you&#39;re a mere shrimp or algae in this crypto ocean, and the only real tool you have at your disposal is playing long term and not panic buy/sell, all the rest is playing with your luck and chances are you are going to get crushed by the whales</p>\n</div><!-- SC_ON -->",
  "score": 389,
  "permalink": "/r/CryptoCurrency/comments/r4fdsa/whales_control_the_market_and_will_manipulate_it/",
  "subreddit": "CryptoCurrency",
  "id": "r4fdsa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "That's it, Whales control the market and there's nothing much you can do about\nit other than to play long term\n\nToday the sentiment here was of death... in a few a minutes a lot of buying\norders and BTC pumped 2k up and alts followed. Do you think this is organic?\n\nOf course not! Whales are playing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そう、クジラが市場を支配しているのだから、あなたにできることは\nロングタームでプレイする以外にできることはない\n\n今日、ここでのセンチメントは死を意味していた...数分後には多くの買い注文が出て\n数分後には大量の買い注文が出て、BTCは2K上昇し、アルトもそれに続いた。これは有機的なものだと思いますか？\n\nもちろん、そうではありません。クジラが遊んでいるのだ。",
      "title": "クジラは市場を支配し、自分の気まぐれで市場を操作する"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就是这样，鲸鱼控制着市场，你对此无能为力。\n鲸鱼控制了市场，而你对此无能为力，只能长期玩下去。\n\n今天，这里的情绪是死亡......在短短几分钟内，大量的买入\n几分钟内就有大量的买单，BTC上涨了2千美元，其他币种也跟着上涨。你认为这是有机的吗？\n\n当然不是! 鲸鱼在玩...",
      "title": "鲸鱼控制着市场，并会随心所欲地操纵市场"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就是這樣，鯨魚控制着市場，你對此無能爲力。\n鯨魚控制了市場，而你對此無能爲力，只能長期玩下去。\n\n今天，這裏的情緒是死亡......在短短几分鐘內，大量的買入\n幾分鐘內就有大量的買單，BTC上漲了2千美元，其他幣種也跟着上漲。你認爲這是有機的嗎？\n\n當然不是! 鯨魚在玩...",
      "title": "鯨魚控制着市場，並會隨心所欲地操縱市場"
    }
  ]
}