{
  "author": "OilSeeYouL8er",
  "the_new_excerpt": "Hourly, not much better. Daily is my go to and sometimes I'll look at the 12\nhour if I need drama in my life. (Eta and I only make decisions based on\ncombining weekly monthly and yearly)\n\nIf you're not margin trading (and if you're brand new you really shouldn't be)\nthen you're just giving yourself…",
  "original_created_utc": 1620676294,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アワーリー、あまり良くないですね。デイリーは私のお気に入りで、時々、人生にドラマが必要な時には12時間表示の\n時間帯を見ることもありますが、人生にドラマが必要なときは (Etaと私は、週ごと、月ごと、年ごとを組み合わせて判断しています。\n週足、月足、年足を組み合わせて判断しています)\n\nもしあなたが証拠金取引をしていないなら（そしてもしあなたが初心者ならば、本当にそうするべきではないでしょう）、あなたは以下のように考えます。\nしていないのであれば、あなたは自分自身に...",
      "title": "新参者への注意点：分足チャートから離れること。それはあなたの人生を何年も費やす価値はなく、本当の価値を何も教えてくれません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "按小时计算，情况好不了多少。日刊是我的首选，如果我的生活需要戏剧性，有时我会看一下12\n小时，如果我的生活中需要戏剧性的话。Eta和我只根据\n结合每周每月和每年的情况作出决定)\n\n如果你不做保证金交易（如果你是新手，你真的不应该这样做\n那么你就是在给自己...",
      "title": "提醒新来者--离开分钟图。它不值得你花上几年时间，也不能告诉你什么真正的价值。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "按小時計算，情況好不了多少。日刊是我的首選，如果我的生活需要戲劇性，有時我會看一下12\n小時，如果我的生活中需要戲劇性的話。Eta和我只根據\n結合每週每月和每年的情況作出決定)\n\n如果你不做保證金交易（如果你是新手，你真的不應該這樣做\n那麼你就是在給自己...",
      "title": "提醒新來者--離開分鐘圖。它不值得你花上幾年時間，也不能告訴你什麼真正的價值。"
    }
  ],
  "title": "A reminder to the newbs - get off the minute chart. It's not worth the years of your life and tells you nothing of real value",
  "created_utc": 1620729032,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hourly, not much better. Daily is my go to and sometimes I&#39;ll look at the 12 hour if I need drama in my life. (Eta and I only make decisions based on combining weekly monthly and yearly)</p>\n\n<p>If you&#39;re not margin trading (and if you&#39;re brand new you really shouldn&#39;t be) then you&#39;re just giving yourself hemorrhoids and grey hair freaking out over red candles on the minute charts. </p>\n\n<p>You do want to be alive and healthy to enjoy gains right?</p>\n</div><!-- SC_ON -->",
  "score": 171,
  "permalink": "/r/CryptoCurrency/comments/n9ebdh/a_reminder_to_the_newbs_get_off_the_minute_chart/",
  "subreddit": "CryptoCurrency",
  "id": "n9ebdh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985992423
}