{
  "author": "Yegpetphoto",
  "original_created_utc": 1635521058,
  "title": "No Look November",
  "created_utc": 1635550755,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m going to attempt to not look at my portfolio for the entire month of November. While this may seem like a dumb move given the volatility of the market, I think I just need a mental break from crypto and luckily for me, November has become a sort of non-denominational lent where people take breaks from things like shaving their upper lip and well, nutting??</p>\n\n<p>I&#39;m here for the long haul, I have no intention of day trading however I&#39;m finding that I&#39;m fairly addicted to refreshing my portfolio and in doing so, putting a lot of unnecessary time and effort into thinking about my investment decisions. Thing is, I&#39;m actually really happy with my current portfolio and I THINK I can trust it to perform without me for a month.</p>\n\n<p>I&#39;m not asking for donations, I don&#39;t think my No Look November will cure cancer, but I think forcing myself to pay attention to other things in my life will be a healthy thing even if it is for just 30 days.</p>\n\n<p>If you&#39;re feeling like your obsession with portfolio performance is taking up too much of your time, and you&#39;re confident that not making moves for a whole month won&#39;t bleed your portfolio dry, won&#39;t you join me?</p>\n</div><!-- SC_ON -->",
  "score": 171,
  "permalink": "/r/CryptoCurrency/comments/qif9pr/no_look_november/",
  "subreddit": "CryptoCurrency",
  "id": "qif9pr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm going to attempt to not look at my portfolio for the entire month of\nNovember. While this may seem like a dumb move given the volatility of the\nmarket, I think I just need a mental break from crypto and luckily for me,\nNovember has become a sort of non-denominational lent where people take…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は11月の間、自分のポートフォリオを見ないようにします。\n11月です。市場のボラティリティーを考えると、これは馬鹿げた行動のように思えるかもしれませんが\n市場の変動を考えると馬鹿げた行動に思えるかもしれませんが、私には暗号化からの精神的な休息が必要だと思います。\n幸運なことに、11月はある種の非宗派的な貸し切り状態になっていて、人々はこの期間中に...",
      "title": "No Look 11月号"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我将尝试在整个11月份不看我的投资组合。\n11月。虽然鉴于市场的波动性，这可能看起来是一个愚蠢的举动。\n市场的波动，我想我只是需要从加密货币中获得精神上的休息，幸运的是我。\n11月已经成为一种非教派的斋戒，人们在这里采取...",
      "title": "11月不看"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我將嘗試在整個11月份不看我的投資組合。\n11月。雖然鑑於市場的波動性，這可能看起來是一個愚蠢的舉動。\n市場的波動，我想我只是需要從加密貨幣中獲得精神上的休息，幸運的是我。\n11月已經成爲一種非教派的齋戒，人們在這裏採取...",
      "title": "11月不看"
    }
  ]
}