{
  "author": "lithouser",
  "original_created_utc": 1624811582,
  "title": "Am I being manipulative?",
  "created_utc": 1624857264,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So a while back, I noticed this cute girl in my class so I (F/26) was asking about her to my friends in the same program. We had no common friends. I ended up finding her account through our program&#39;s student Instagram page where she was featured that same week I was looking for her. Through that, I found her Spotify linked in her profile. From both of those platforms, I found out that we both play guitar and and like the same music. Anyway, the whole semester I was looking for ways to talk to her, but the prof had turned off the chat so I couldn&#39;t.</p>\n\n<p>The day before the last day of class, I posted a song on my story that I knew she also liked. I followed her when the class ended, and to my surprise she replied to my story right away saying how much she loved that album less than an hour after I followed her. The next week, I posted another song that I knew she liked, she responded again. Now I feel kinda guilty because I feel like maybe I&#39;m being manipulative and creepy? Should I stop?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/o90i7c/am_i_being_manipulative/",
  "subreddit": "NoStupidQuestions",
  "id": "o90i7c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So a while back, I noticed this cute girl in my class so I (F/26) was asking\nabout her to my friends in the same program. We had no common friends. I ended\nup finding her account through our program's student Instagram page where she\nwas featured that same week I was looking for her. Through that, I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "少し前に、同じクラスにかわいい女の子がいることに気づいて、私（F/26）は同じプログラムの友達に彼女のことを聞いていました。\n同じプログラムの友達に彼女のことを聞いていました。共通の友人はいませんでした。結局、私は\n彼女のアカウントを見つけたのは、プログラムの学生用インスタグラムでした。\n私が彼女を探していた同じ週に彼女が紹介されていました。その中で、私は...",
      "title": "私は操られているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以前一段时间，我注意到班上有一个可爱的女孩，所以我（F/26）向同班的朋友打听她的情况。\n向同班的朋友打听她的情况。我们没有共同的朋友。我最后\n最后我通过我们项目的学生Instagram页面找到了她的账户，在我寻找她的那一周，她被介绍到了那里。\n在我寻找她的那一周，她被报道了。通过这一点，我...",
      "title": "我是在操纵吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以前一段時間，我注意到班上有一個可愛的女孩，所以我（F/26）向同班的朋友打聽她的情況。\n向同班的朋友打聽她的情況。我們沒有共同的朋友。我最後\n最後我通過我們項目的學生Instagram頁面找到了她的賬戶，在我尋找她的那一週，她被介紹到了那裏。\n在我尋找她的那一週，她被報道了。通過這一點，我...",
      "title": "我是在操縱嗎？"
    }
  ]
}