{
  "author": "NK_Diplomat",
  "the_new_excerpt": "Listen up retards, we have the absolute play of the century on our hands.\n\nI've been playing very close attention to the George Floyd trial, and anyone\nwith a brain can tell that this Chauvin guy is probably going to get off.\nRegardless of how you feel about that, there is an opportunity to make…",
  "original_created_utc": 1618940600,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "よく聞いてください、私たちは世紀の大事件を目の前にしています。\n\n私はジョージ・フロイドの裁判に非常に注目しています。\n頭のいい人なら、このChauvinという男がおそらく無罪放免になるだろうとわかるはずだ。\nそれをどう思うかは別にして、チャンスがあるのは...",
      "title": "ジョージ・フロイドのプレイ・オブ・ザ・センチュリー"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "听好了，弱智们，我们手上有一个绝对的世纪大戏。\n\n我一直在密切关注乔治-弗洛伊德的审判，任何有头脑的人都能看出，这个叫周文的家伙很可能会被判有罪。\n任何有头脑的人都能看出，这个叫Chauvin的家伙很可能会脱罪。\n不管你怎么看，现在有一个机会可以让...",
      "title": "乔治-弗洛伊德的世纪之作"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "聽好了，弱智們，我們手上有一個絕對的世紀大戲。\n\n我一直在密切關注喬治-弗洛伊德的審判，任何有頭腦的人都能看出，這個叫周文的傢伙很可能會被判有罪。\n任何有頭腦的人都能看出，這個叫Chauvin的傢伙很可能會脫罪。\n不管你怎麼看，現在有一個機會可以讓...",
      "title": "喬治-弗洛伊德的世紀之作"
    }
  ],
  "title": "George Floyd Play of the Century",
  "created_utc": 1618972303,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Listen up retards, we have the absolute play of the century on our hands.</p>\n\n<p>I&#39;ve been playing very close attention to the George Floyd trial, and anyone with a brain can tell that this Chauvin guy is probably going to get off. Regardless of how you feel about that, there is an opportunity to make massive amounts of money.</p>\n\n<p>Everyone here except maybe the 7+ million members who joined since June 2020 remembers the <a href=\"https://www.cnn.com/2020/06/06/us/us-george-floyd-protests-saturday/index.html\">massive protests that took place</a> when that event first went down. These protests largely started out peaceful, but many escalated into violence targeting local businesses. One of the most targeted businesses during these events was CVS (ticker $CVS). <a href=\"https://www.businessinsider.com/cvs-closes-some-stores-looting-protests-2020-6\">CVS got his so hard they were forced to close some locations!!!</a> Let&#39;s look at what happened to CVS stock over the same period of time:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/jr83oz706du61.png?width=652&amp;format=png&amp;auto=webp&amp;s=a464465a4ed3279cac2c39dfd8063576aa82dcd6\">See that Drop???</a></p>\n\n<p>You guys see that drop??? CVS dropped 10% in a couple of weeks right when all this was going on! So what does this have to do with the trial??? By my estimations, the outcry from an acquittal will be roughly 10 times larger than what happened in June 2020. Doing some napkin math here, 10 times of 10% is 100%!!! Meaning if Chauvin is acquitted, CVS will be going all the way down to $0/share!!! The market is clearly not pricing this in, as CVS is currently trading at about $76/share, $76 more than it is actually worth.</p>\n\n<p>With a verdict expected by the end of May, there is still time to get in on this once in a lifetime trade!!! I only wish I had enough capital to make (almost) unlimited gains on this play.</p>\n\n<p>Edit: Positions. Short $10k shares of $CVS</p>\n\n<p><a href=\"https://preview.redd.it/cvg9qaagmdu61.jpg?width=1125&amp;format=pjpg&amp;auto=webp&amp;s=97d7e65f294d5db2689e1d7ab56107b8bdebe2b9\">https://preview.redd.it/cvg9qaagmdu61.jpg?width=1125&amp;format=pjpg&amp;auto=webp&amp;s=97d7e65f294d5db2689e1d7ab56107b8bdebe2b9</a></p>\n\n<p>Edit 2: lol time to exit this tomorrow. I’m leaving it up for wsb.</p>\n\n<p>Edit 3: as of AH close I’m up $4.90. Hoping this holds til open tomorrow</p>\n</div><!-- SC_ON -->",
  "score": 1793,
  "permalink": "/r/wallstreetbets/comments/muvxgc/george_floyd_play_of_the_century/",
  "subreddit": "wallstreetbets",
  "id": "muvxgc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171532813
}