{
  "author": "[deleted]",
  "original_created_utc": 1636409618,
  "title": "Is it \"normal\" to suck a girls tits during sex/foreplay?",
  "created_utc": 1636423633,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I always thought that this was a perfectly normal thing for a guy to do. (Or want to do)</p>\n\n<p>It just always kind of.. made sense in my head? I always assumed that it was pretty normal.</p>\n\n<p>That is, until the last girlfriend I had said that she thought it was kind of weird that I always sucked on them, because it made her feel as though I were trying to act like a baby or saw her as some kind of mother-figure or something?</p>\n\n<p>Neither of which were the case, of course. I just thought that&#39;s.. kinda what you do. Am I the weird one here? Or was she just making it weird?</p>\n</div><!-- SC_ON -->",
  "score": 227,
  "permalink": "/r/TooAfraidToAsk/comments/qpoo8h/is_it_normal_to_suck_a_girls_tits_during/",
  "subreddit": "TooAfraidToAsk",
  "id": "qpoo8h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I always thought that this was a perfectly normal thing for a guy to do. (Or\nwant to do)\n\nIt just always kind of.. made sense in my head? I always assumed that it was\npretty normal.\n\nThat is, until the last girlfriend I had said that she thought it was kind of\nweird that I always sucked on them,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、これは男として至極当たり前のことだとずっと思っていました。(または\nしたい）と思っていました。\n\n私の頭の中では、いつも何となく...納得していました。私はいつも、それが\nかなり普通です。\n\n最後に付き合っていた彼女が、私がいつも吸っているのはちょっと変だと思う、と言うまでは。\n俺がいつも吸っているのは変だと思っていた...",
      "title": "セックスや前戯の最中に女の子のおっぱいを吸うのは「普通」ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我一直认为这对一个男人来说是一件非常正常的事情。(或\n想做）。\n\n这在我的脑海中总是有点......有意义？我总是认为这很\n很正常。\n\n直到我的最后一个女朋友说，她认为我总是吸吮它们有点奇怪。\n我总是吸吮它们，这很奇怪...",
      "title": "在做爱/前戏时吸吮女孩的乳房是否 \"正常\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我一直認爲這對一個男人來說是一件非常正常的事情。(或\n想做）。\n\n這在我的腦海中總是有點......有意義？我總是認爲這很\n很正常。\n\n直到我的最後一個女朋友說，她認爲我總是吸吮它們有點奇怪。\n我總是吸吮它們，這很奇怪...",
      "title": "在做愛/前戲時吸吮女孩的乳房是否 \"正常\"？"
    }
  ]
}