{
  "author": "TheBlueMatt",
  "the_new_excerpt": "If you, like me, used recent events as an excuse to leave the clowncar\nRobinhood, double-check that the cost basis for the transferred shares is\ncorrect. Robinhood apparently managed to send Vanguard random numbers for my\nportfolio.\n\nEven on really simple cases of a few shares bought a year ago and…",
  "original_created_utc": 1615698598,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "如果你和我一样，用最近的事件作为借口离开小丑车\nRobinhood，仔细核对转让股份的成本基础是\n正确的。Robinhood显然设法给Vanguard发送了随机号码，让我的...\n投资组合。\n\n即使在真正简单的情况下，一年前买了几只股票，并... ...",
      "title": "PSA：如果您最近离开了Robinhood，请仔细检查您的转移成本基础!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你和我一樣，用最近的事件作爲藉口離開小丑車\nRobinhood，仔細覈對轉讓股份的成本基礎是\n正確的。Robinhood顯然設法給Vanguard發送了隨機號碼，讓我的...\n投資組合。\n\n即使在真正簡單的情況下，一年前買了幾隻股票，並... ...",
      "title": "PSA：如果您最近離開了Robinhood，請仔細檢查您的轉移成本基礎!"
    }
  ],
  "title": "PSA: If You recently left Robinhood, double check your transferred cost-basis!",
  "created_utc": 1615704060,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you, like me, used recent events as an excuse to leave the clowncar Robinhood, double-check that the cost basis for the transferred shares is correct. Robinhood apparently managed to send Vanguard random numbers for my portfolio.</p>\n\n<p>Even on really simple cases of a few shares bought a year ago and never traded at any point later, the cost basis is just... wrong? For my entire portfolio, plus a few dollars/share here, minus a few dollars/share there, not really any reasoning for any of it, but definitely an overall much lower total cost basis than actually should have been there.</p>\n\n<p>If you haven’t left Robinhood yet, get out. This kind of technical incompetence isn’t just embarrassing, it’s scary. You don’t want to keep your money in a clown car.</p>\n</div><!-- SC_ON -->",
  "score": 3128,
  "permalink": "/r/investing/comments/m4ojn2/psa_if_you_recently_left_robinhood_double_check/",
  "subreddit": "investing",
  "id": "m4ojn2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147379961
}