{
  "author": "mrbiggelsworth07",
  "the_new_excerpt": "You are probably checking the bitcoin price, sweating. Maybe you bought this\nmonth and are down, maybe you bought a few months ago and until recently, you\nwere up big. I hope you aren't selling.\n\nI'm not rich, but I had a condo and sold it. You know what I bought? Bitcoin.\nAnd guess what-I'm not…",
  "original_created_utc": 1611727452,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你可能正在查看比特币价格，汗颜。也许你买了这个\n月，而且是下降的，也许你在几个月前就买了，直到最近，你才\n涨幅很大。我希望你不是在卖。\n\n我不是有钱人，但我有一个公寓，并把它卖了。你知道我买了什么吗? Bitcoin.\n你猜怎么着, 我不是...",
      "title": "不要做一个看不到冰山的人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你可能正在查看比特幣價格，汗顏。也許你買了這個\n月，而且是下降的，也許你在幾個月前就買了，直到最近，你才\n漲幅很大。我希望你不是在賣。\n\n我不是有錢人，但我有一個公寓，並把它賣了。你知道我買了什麼嗎? Bitcoin.\n你猜怎麼着, 我不是...",
      "title": "不要做一個看不到冰山的人。"
    }
  ],
  "title": "Don't be the person who doesn't see the iceberg",
  "created_utc": 1611744706,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You are probably checking the bitcoin price, sweating. Maybe you bought this month and are down, maybe you bought a few months ago and until recently, you were up big. I hope you aren&#39;t selling.</p>\n\n<p>I&#39;m not rich, but I had a condo and sold it. You know what I bought? Bitcoin. And guess what-I&#39;m not selling because this is just getting started.</p>\n\n<p>Most people want to keep you down, to not reach your full potential. To be part of the system, but need the system. Ask yourself: what are the rich doing? I&#39;ll tell you what they are doing-they are buying bitcoin, gold, and luxury real estate.</p>\n\n<p>The system has taken it&#39;s logical course and it&#39;s worked for a while-about 70 years. Can we break covid and go back to &quot;normal&quot;. Sure. Debt will be 30 Trillion. By 2025 50 Trillion and debt to GDP at 200%. And by 2030, the game has fundamentally changed. There&#39;s a huge demand for all the cash in the world, and it looks like bitcoin is going to be one of the exits.</p>\n\n<p>Most people love the system. It comforts them and gives them structure. I&#39;m fine with that. I like comfort too.</p>\n\n<p>Don&#39;t get this twisted-the people at the top aren&#39;t smart. They inherited an amazing, once in a 1,000 years system 80 years ago. And what did they do? They destroyed the system and gave the future generations the problems. They have kicked the can of debt down the road. </p>\n\n<p>I don&#39;t think you will ever see a mortgage at 4% again. EVER.<br/>\nInflation? Minimum wage will be $15-and that&#39;s not even enough.<br/>\nImagine paying $20 for a burger/fries/coke. It&#39;s coming.</p>\n\n<p>The traders will tell you &quot;it&#39;s going to $25k&quot;. I kick myself for not DOLLAR cost averaging over the last 4-5 years. Huge mistake.</p>\n\n<p>The problems of society will not go away. At best they are delayed. You know why? because our debt is growing much faster than our taxes. And it&#39;s about to go exponential. </p>\n\n<p>Bitcoin is my insurance policy.</p>\n</div><!-- SC_ON -->",
  "score": 484,
  "permalink": "/r/Bitcoin/comments/l5xv45/dont_be_the_person_who_doesnt_see_the_iceberg/",
  "subreddit": "Bitcoin",
  "id": "l5xv45",
  "is_self": true,
  "media": null,
  "is_video": false
}