{
  "author": "whodkne",
  "original_created_utc": 1638513843,
  "title": "Here are a list of coins/tokens I invested in many moons ago and are now worthless.",
  "created_utc": 1638536077,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Thought this might be fun. Since I bought a majority of my crypto a while ago I left it for some time and recently reviewed much of it to make sure I didn&amp;#39;t need to do anything. Several needed attention (chain swaps, upgrades, etc) and it was a good exercise to make sure my Ledgers were updated, confirm private key and recovery phrases. In doing so I was reminded of this slew of crap that I didn&amp;#39;t know better about back in the day. Enjoy my $0 pain...&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;INS&lt;/li&gt;\n&lt;li&gt;EMO&lt;/li&gt;\n&lt;li&gt;GNT&lt;/li&gt;\n&lt;li&gt;SHP&lt;/li&gt;\n&lt;li&gt;VIU&lt;/li&gt;\n&lt;li&gt;SNGLS&lt;/li&gt;\n&lt;li&gt;UCASH&lt;/li&gt;\n&lt;li&gt;HQX&lt;/li&gt;\n&lt;li&gt;FTC&lt;/li&gt;\n&lt;li&gt;SPHTX&lt;/li&gt;\n&lt;li&gt;QLC&lt;/li&gt;\n&lt;li&gt;TRC&lt;/li&gt;\n&lt;li&gt;HORSE&lt;/li&gt;\n&lt;li&gt;ELIX&lt;/li&gt;\n&lt;li&gt;IDH&lt;/li&gt;\n&lt;li&gt;ITC&lt;/li&gt;\n&lt;li&gt;RPX&lt;/li&gt;\n&lt;li&gt;DBC&lt;/li&gt;\n&lt;li&gt;SRN&lt;/li&gt;\n&lt;li&gt;ENG&lt;/li&gt;\n&lt;li&gt;TKY&lt;/li&gt;\n&lt;li&gt;JACK&lt;/li&gt;\n&lt;li&gt;BPT&lt;/li&gt;\n&lt;li&gt;OCN&lt;/li&gt;\n&lt;li&gt;NCASH&lt;/li&gt;\n&lt;li&gt;EZT&lt;/li&gt;\n&lt;li&gt;DSPX&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;So.. DYOR&lt;/p&gt;\n\n&lt;p&gt;**Edit, so back in the day should be clarified. I first got in to crypto in 2013. I think a lot of this happened around 2015 or 2016. The whole game was quite different back then. But throwing a bunch of cheap darts at the wall to see what sticks was a diversification strategy. It was a small percentage of my holdings at the time. Sure, it would be nice to all be winners but it was also a fun and exciting time to be throwing crypto around. A mythical time before hardware wallets.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 189,
  "permalink": "/r/CryptoCurrency/comments/r7stfk/here_are_a_list_of_coinstokens_i_invested_in_many/",
  "subreddit": "CryptoCurrency",
  "id": "r7stfk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Thought this might be fun. Since I bought a majority of my crypto a while ago I\nleft it for some time and recently reviewed much of it to make sure I didn't\nneed to do anything. Several needed attention (chain swaps, upgrades, etc) and\nit was a good exercise to make sure my Ledgers were updated,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは面白いかもしれないと思いました。私はしばらく前に暗号の大部分を購入したので\nしばらく放置していたのですが、最近その多くを見直し、必要ないことを確認しました。\n何もする必要がない。いくつかのものは注意が必要で（チェーンスワップ、アップグレードなど）、また\n自分のLedgerが更新されていることを確認する良い練習になりました...",
      "title": "ここでは、私が大昔に投資して、今では無価値になってしまったコイン／トークンのリストを紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想这可能很有趣。由于我的大部分加密货币是在不久前买的，所以我把它搁置了一段时间。\n搁置了一段时间，最近审查了其中的大部分，以确保我不需\n需要做什么。有几个需要注意（换链、升级等），而且\n这是一个很好的练习，以确保我的分类帐被更新，...",
      "title": "以下是我很多年前投资的硬币/代币清单，现在已经一文不值。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想這可能很有趣。由於我的大部分加密貨幣是在不久前買的，所以我把它擱置了一段時間。\n擱置了一段時間，最近審查了其中的大部分，以確保我不需\n需要做什麼。有幾個需要注意（換鏈、升級等），而且\n這是一個很好的練習，以確保我的分類帳被更新，...",
      "title": "以下是我很多年前投資的硬幣/代幣清單，現在已經一文不值。"
    }
  ]
}