{
  "author": "BlindMidget_",
  "original_created_utc": 1642786479,
  "title": "With crypto down by 40% in the last 3 months, if this isn't a bear market, what is a bear market?",
  "created_utc": 1642797438,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m fairly new in the crypto world, bought most of my portfolio at the ATH of November and I&amp;#39;m now stuck with an ever shrinking crypto account. I&amp;#39;m also new to investment in general, so when I learned about bull and bear markets last year, I thought I understood what they meant. Bull is when people are hopeful and numbers go up. Bear is when people are fearful and numbers go down. But people here keep saying we are not in a bear market. When the market goes down everyday for months, what is it then?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 520,
  "permalink": "/r/CryptoCurrency/comments/s9g59n/with_crypto_down_by_40_in_the_last_3_months_if/",
  "subreddit": "CryptoCurrency",
  "id": "s9g59n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm fairly new in the crypto world, bought most of my portfolio at the ATH of\nNovember and I'm now stuck with an ever shrinking crypto account. I'm also new\nto investment in general, so when I learned about bull and bear markets last\nyear, I thought I understood what they meant. Bull is when people…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は暗号の世界ではかなり新しい人間で、自分のポートフォリオのほとんどを、2010年12月のATHで購入しました。\n11月に入り、暗号の口座がどんどん減っていくので困っています。また、私は初めて\n投資全般に言えることですが、昨年、強気相場と弱気相場について学んだとき\nと、その意味を理解したつもりになっていました。ブルとは、人々が...",
      "title": "暗号がこの3ヶ月で40%も下がったのだから、これが弱気相場でないとしたら、弱気相場とは何なのだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是加密货币世界里的新手，在11月的ATH买入了我的大部分投资组合。\n11月，我现在被困在一个不断缩小的加密货币账户中。我也是个新手\n因此，当我去年了解到牛市和熊市时，我以为我明白了它们是什么。\n时，我以为我明白了它们的含义。牛市是指当人们...",
      "title": "在过去3个月里，加密货币下跌了40%，如果这不是熊市，那么什么是熊市？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是加密貨幣世界裏的新手，在11月的ATH買入了我的大部分投資組合。\n11月，我現在被困在一個不斷縮小的加密貨幣賬戶中。我也是個新手\n因此，當我去年瞭解到牛市和熊市時，我以爲我明白了它們是什麼。\n時，我以爲我明白了它們的含義。牛市是指當人們...",
      "title": "在過去3個月裏，加密貨幣下跌了40%，如果這不是熊市，那麼什麼是熊市？"
    }
  ]
}