{
  "author": "orangebees",
  "original_created_utc": 1643221577,
  "title": "New bill just introduced in the House, and which will very likely pass in some form, is a provision that would be disastrous",
  "created_utc": 1643236746,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;sup&gt;Jerry Brito:&lt;/sup&gt;&lt;/p&gt;\n\n&lt;p&gt;Included in the America COMPETES Act just introduced in the House, and which will very likely pass in some form, is a provision that would be disastrous not just for bitcoin but for privacy and due process generally. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/yd6ndzcdr2e81.png?width=680&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=9f30615c6ce3bb070f5d57d6b9c1e70591efdde1\"&gt;https://preview.redd.it/yd6ndzcdr2e81.png?width=680&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=9f30615c6ce3bb070f5d57d6b9c1e70591efdde1&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The so-called &amp;quot;special measures&amp;quot; provision would essentially give the Treasury Secretary unchecked and unilateral power to ban exchanges and other financial institutions from engaging in cryptocurrency transactions. How would it do this? &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/oe75dflgr2e81.png?width=900&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=fc361154d9da4c892574720e50f0dc4368375cc0\"&gt;https://preview.redd.it/oe75dflgr2e81.png?width=900&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=fc361154d9da4c892574720e50f0dc4368375cc0&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Bank Secrecy Act §5318A allows the Secretary to identify a &amp;quot;primary money laundering concern&amp;quot; and take &amp;quot;special measures&amp;quot; to (1) require financial institutions to report information on the concern, and/or (2) prohibit FIs from maintaining accounts related to the concern. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Special measures&amp;quot; authority is vast power that the Secretary of the Treasury has today, so in the current statute there are checks on that power. &lt;/p&gt;\n\n&lt;p&gt;First, the law requires that Treasury engage in a public rulemaking before instituting a prohibition. Second, the secretary can impose a surveillance special measure through a simple order, but its duration is limited to 120 days and must be accompanied by a public rulemaking. &lt;/p&gt;\n\n&lt;p&gt;While not full due process, these limitations at least alert the public and gives the public some opportunity to comment on a special measure&amp;#39;s merit or constitutionality. &lt;/p&gt;\n\n&lt;p&gt;The new provision would do three things:  -Add &amp;quot;certain transmittal of funds&amp;quot; to the list of things that can be banned by the Secretary  -Eliminate all public notice and comment requirements  -Eliminate the 120-day limitation for measures imposed without regulation &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/xhvownvlr2e81.jpg?width=583&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=a2e0bc4cc2f6777391e35e447099fc21d8a8c1b7\"&gt;https://preview.redd.it/xhvownvlr2e81.jpg?width=583&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=a2e0bc4cc2f6777391e35e447099fc21d8a8c1b7&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;If adopted into law, this provision would be disaster not just for crypto but for privacy and democratic public process related to *all* types of financial transactions. &lt;/p&gt;\n\n&lt;p&gt;It empowers the Secretary to prohibit any (or indeed all) cryptocurrency transactions (or any other kind of transaction) without any process, rulemaking, or limitation on the duration of the prohibition. &lt;/p&gt;\n\n&lt;p&gt;This provision was first introduced as an amendment to the national Defense Authorization Act last year  &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/n8eg358pr2e81.png?width=680&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=08418895f5e69fd1104c27b73c7a0e003b87a01d\"&gt;https://preview.redd.it/n8eg358pr2e81.png?width=680&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=08418895f5e69fd1104c27b73c7a0e003b87a01d&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;After alerting folks in the House and Senate of that amendment&amp;#39;s unintended consequences, it was removed from the final bill that passed. Unfortunately it&amp;#39;s back verbatim without any improvements. &lt;/p&gt;\n\n&lt;p&gt;It still strips out *all* administrative process and duration limitations on the Secretary’s power to condition or prohibit transactions at financial institutions associated with primary money laundering concerns. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s time to call your member of Congress and ask that they take action to make sure that notice and comment and duration limitations are not removed from 31 U.S.C. § 5318A as the America COMPETES Act would do.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 589,
  "permalink": "/r/Bitcoin/comments/sdcp72/new_bill_just_introduced_in_the_house_and_which/",
  "subreddit": "Bitcoin",
  "id": "sdcp72",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Jerry Brito:\n\nIncluded in the America COMPETES Act just introduced in the House, and which\nwill very likely pass in some form, is a provision that would be disastrous not\njust for bitcoin but for privacy and due process…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ジェリー・ブリトー\n\n下院に提出されたばかりのAmerica COMPETES Actに含まれ、これは\nは、何らかの形で可決される可能性が非常に高い。\nビットコインだけでなく、プライバシーやデュープロセスについても......。",
      "title": "下院に提出されたばかりの新法案で、何らかの形で可決される可能性が非常に高いが、悲惨なことになる条項がある。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "杰里-布里托。\n\n包括在刚刚在众议院提出的《美国竞争法案》中，该法案\n该法案很有可能以某种形式获得通过，其中的一项规定将是灾难性的，不仅对企业来说是如此。\n不仅对比特币而且对隐私和正当程序都是灾难性的...",
      "title": "刚刚在众议院提出的新法案，而且很可能以某种形式通过，是一项将是灾难性的规定"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "傑裏-布里託。\n\n包括在剛剛在衆議院提出的《美國競爭法案》中，該法案\n該法案很有可能以某種形式獲得通過，其中的一項規定將是災難性的，不僅對企業來說是如此。\n不僅對比特幣而且對隱私和正當程序都是災難性的...",
      "title": "剛剛在衆議院提出的新法案，而且很可能以某種形式通過，是一項將是災難性的規定"
    }
  ]
}