{
  "author": "GrandAffectionate708",
  "original_created_utc": 1635369120,
  "title": "When my grandma with dementia forgets something, do I go along with it or correct her?",
  "created_utc": 1635409889,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m sure there are cases where it’d be a for sure “there’s no need to” or “yes absolutely correct her”, but there’s gray area. </p>\n\n<p>Like, I wouldn’t let her tell me she wasn’t allergic to something she was allergic to, but I would just agree with her if she’s swearing my favorite color has been blue my whole life when it hasn’t. </p>\n\n<p>It’s just so hard to go see her. I beat myself up for it. My dad passed away, and I know he’s either looking down and understanding, or really upset with me, or not looking down on me at all because that’s not even logical. But the thought hits me hard just the same. </p>\n\n<p>Like the other day she swore that my cousin didn’t have any kids. I’d say, the cousins in that particular family were closer to their grandparents than I was. Not that I wasn’t close, but their mom was the only girl and she’s very close with her mom. Anyways. How am I supposed to maneuver a conversation when I’m telling a story about my cousins kids, and my grandma is telling me they <em>do not</em> have kids and she’s never met them. She acts hurt that these are her grandkids and she’s “never met them”. So I obviously want to let her know that she has met them, a bunch of times! But how crazy would that make you feel, if you were her - and someone was telling you people existed and you had relationships with them, and you don’t remember them even existing? </p>\n\n<p>I never know what to do.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/qh6qeh/when_my_grandma_with_dementia_forgets_something/",
  "subreddit": "NoStupidQuestions",
  "id": "qh6qeh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m sure there are cases where it’d be a for sure “there’s no need to” or “yes\nabsolutely correct her”, but there’s gray area.\n\nLike, I wouldn’t let her tell me she wasn’t allergic to something she was\nallergic to, but I would just agree with her if she’s swearing my favorite color\nhas been blue my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "確かに「必要ない」「はい、絶対に正しい」という場合もあると思います。\n絶対に訂正してください」という場合もあるでしょうが、グレーゾーンもあります。\n\n例えば、アレルギーがあるものをアレルギーがないと言われても、私は彼女に言わせません。\nしかし、彼女が「私の好きな色は青だった......」と言っても、私は彼女に同意します。\n私の好きな色は青だった...",
      "title": "認知症のおばあちゃんが何かを忘れたとき、私はそれに従うか、訂正するか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信在有些情况下，肯定会有 \"没有必要 \"或 \"是的\n绝对要纠正她\"，但也有灰色地带。\n\n比如说，我不会让她告诉我她对某些东西不过敏，但我会同意她的说法。\n过敏，但如果她说我最喜欢的颜色是蓝色，我就会同意她的说法。\n一直是蓝色，我...",
      "title": "当我患有痴呆症的奶奶忘记一些事情时，我是顺其自然还是纠正她？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信在有些情況下，肯定會有 \"沒有必要 \"或 \"是的\n絕對要糾正她\"，但也有灰色地帶。\n\n比如說，我不會讓她告訴我她對某些東西不過敏，但我會同意她的說法。\n過敏，但如果她說我最喜歡的顏色是藍色，我就會同意她的說法。\n一直是藍色，我...",
      "title": "當我患有癡呆症的奶奶忘記一些事情時，我是順其自然還是糾正她？"
    }
  ]
}