{
  "author": "Ilitarist",
  "original_created_utc": 1626263714,
  "title": "Was there concern about Star Trek The Original Series political agenda during the original run?",
  "created_utc": 1626288436,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We&#39;ve all heard stories about (supposedly) the first TV kiss between a black lady and a white man. But I wonder about the show in general. It portrays future humanity as a utopian society with few internal conflicts. Money is regarded as an anachronism, there&#39;s a Russian high-ranking officer on board - and he&#39;s a kind of proud Russian, not a repentant Westernized man. Was it accused of communist propaganda? Are there any well-known publications of the era to read on this topic?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/ok2sgk/was_there_concern_about_star_trek_the_original/",
  "subreddit": "AskHistorians",
  "id": "ok2sgk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We've all heard stories about (supposedly) the first TV kiss between a black\nlady and a white man. But I wonder about the show in general. It portrays future\nhumanity as a utopian society with few internal conflicts. Money is regarded as\nan anachronism, there's a Russian high-ranking officer on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "黒人女性と白人男性がテレビで初めてキスをした（と思われる）話は誰もが聞いたことがあるでしょう。\n白人男性と黒人女性のテレビ初のキスの話は誰もが聞いたことがあるでしょう。しかし、私はこの番組全体に疑問を感じています。この番組は、未来の人類を、内部対立の少ないユートピア社会として描いています。\n内輪もめの少ないユートピア社会として描かれています。お金は時代錯誤とみなされ\nお金は時代錯誤とされ、ロシアの高級将校が...。",
      "title": "スター・トレック オリジナル・シリーズ」の放映時には、政治的な問題が懸念されましたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都听说过（据说）黑人女士和白人男子之间的电视初吻的故事。\n吻的故事。但我想知道这个节目的总体情况。它把未来的人类描绘成一个几乎没有内部冲突的乌托邦社会。\n它把未来的人类描绘成一个乌托邦社会，没有什么内部冲突。金钱被认为是\n金钱被视为不合时宜的东西，有一个俄罗斯高级官员在...",
      "title": "在最初的运行期间，人们是否担心《星际迷航》原版系列的政治议程？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都聽說過（據說）黑人女士和白人男子之間的電視初吻的故事。\n吻的故事。但我想知道這個節目的總體情況。它把未來的人類描繪成一個幾乎沒有內部衝突的烏托邦社會。\n它把未來的人類描繪成一個烏托邦社會，沒有什麼內部衝突。金錢被認爲是\n金錢被視爲不合時宜的東西，有一個俄羅斯高級官員在...",
      "title": "在最初的運行期間，人們是否擔心《星際迷航》原版系列的政治議程？"
    }
  ]
}