{
  "author": "Promoting_Illiteracy",
  "original_created_utc": 1646116463,
  "title": "If I only attract people that I find unattractive, does that mean that I'm probably unattractive? Or is that a common experience?",
  "created_utc": 1646125913,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I (M 29) have dated people that I did in fact find attractive in the past, but a huge majority of the women I attract I do not have reciprocal feelings for. Not to diss them or anything. I&amp;#39;ve met some really great people that were into me, but I was 100% not attracted back romantically or sexually.&lt;/p&gt;\n\n&lt;p&gt;Is that how it is with you, or do you just have tons of hot people all over you all the time?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 129,
  "permalink": "/r/TooAfraidToAsk/comments/t41ia3/if_i_only_attract_people_that_i_find_unattractive/",
  "subreddit": "TooAfraidToAsk",
  "id": "t41ia3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I (M 29) have dated people that I did in fact find attractive in the past, but a\nhuge majority of the women I attract I do not have reciprocal feelings for. Not\nto diss them or anything. I've met some really great people that were into me,\nbut I was 100% not attracted back romantically or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私（M29）は、過去に魅力的だと思う人と付き合ったことがありますが、その人たちが\n私が惹かれる女性の大半は、相互の感情を抱いていない。別に\n彼らをディスるわけでもなんでもなく 私のことを好きになってくれる、本当に素晴らしい人たちに出会いました。\nでも、100％恋愛感情にはならないし...。",
      "title": "自分が魅力的でないと思う人ばかりを引き寄せるということは、自分は魅力的でないということなのでしょうか？それとも、それはよくある経験なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（29岁）过去曾与一些我认为有吸引力的人约会过，但绝大多数被我吸引的女性我都没有对她们产生互惠的感觉。\n我所吸引的绝大多数女性，我都没有对她们产生对等的感觉。不是\n不是说要诋毁她们或什么。我遇到过一些非常棒的人，他们喜欢我。\n但我100%没有被浪漫地吸引回来，或者...",
      "title": "如果我只吸引我认为没有吸引力的人，这是否意味着我可能是没有吸引力的？还是说这是一种常见的经验？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（29歲）過去曾與一些我認爲有吸引力的人約會過，但絕大多數被我吸引的女性我都沒有對她們產生互惠的感覺。\n我所吸引的絕大多數女性，我都沒有對她們產生對等的感覺。不是\n不是說要詆譭她們或什麼。我遇到過一些非常棒的人，他們喜歡我。\n但我100%沒有被浪漫地吸引回來，或者...",
      "title": "如果我只吸引我認爲沒有吸引力的人，這是否意味着我可能是沒有吸引力的？還是說這是一種常見的經驗？"
    }
  ]
}