{
  "author": "ThunderBobMajerle",
  "the_new_excerpt": "Is anyone concerned we keep seeing these sentiment data scraping posts? I have\nbeen tracking stock performance of some of the original ones posted on here and\nit's terrible...but if you check the website or scraper tool they have moved the\ngoalposts, ie restarting the fund or changing the cost…",
  "original_created_utc": 1615983702,
  "localize": [
    {
      "locale": "zh",
      "title": "我们确定这些情怀刮刮乐都好吗？",
      "the_new_excerpt": "有人担心我们老是看到这些情怀数据搜刮的帖子吗？我有\n一直跟踪的股票性能的一些原始的在这里发布和\n它是可怕的......但如果你检查网站或刮刀工具，他们已经移动了。\n门柱，即重新启动基金或改变成本... ..."
    },
    {
      "locale": "zh-Hant",
      "title": "我們確定這些情懷刮刮樂都好嗎？",
      "the_new_excerpt": "有人擔心我們老是看到這些情懷數據搜刮的帖子嗎？我有\n一直跟蹤的股票性能的一些原始的在這裏發佈和\n它是可怕的......但如果你檢查網站或刮刀工具，他們已經移動了。\n門柱，即重新啓動基金或改變成本... ..."
    }
  ],
  "title": "Are we sure all these sentiment scrapers are good?",
  "created_utc": 1615996056,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Is anyone concerned we keep seeing these sentiment data scraping posts? I have been tracking stock performance of some of the original ones posted on here and it&#39;s terrible...but if you check the website or scraper tool they have moved the goalposts, ie restarting the fund or changing the cost average. </p>\n\n<p>Frequent mentions does not equal positive gains. Ever since the GME hype, I am leery this kind of sentiment  information and the positive feedback loop of creating more mentions and more people buying is extremely valuable to parties interested in short positions. It provides nice research on stocks people will likely buy with no DD other than it was mentioned a lot. And coincidentally many of these stocks are already your classic meme stocks technically overvalued.</p>\n\n<p>I have been tracking roughly 400 tickers that have appeared on 48 hour and weekly sentiment lists and it&#39;s performance is inferior relative to index funds over that period. Of course there are some winners but I&#39;ve yet to have any top 10 or 20 list for a period outperform an index. </p>\n\n<p>Are we sure this sentiment scraping stuff isnt just playing into the exact data shorty wants? You get replies in the comments like &quot;this is genius!&quot; and &quot;I&#39;m going to make so much money&quot; and check the acct and it&#39;s often less than a month old only active in stock subs with a couple comments. </p>\n\n<p>Be careful folks. The sentiment data may identify stocks worthy of further DD, but the amount of euphoric responses to daily sentiment scraping posts worries me we have a lot of short research occurring on here disguised as help.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/stocks/comments/m6z6cj/are_we_sure_all_these_sentiment_scrapers_are_good/",
  "subreddit": "stocks",
  "id": "m6z6cj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147384036
}