{
  "author": "helepmesdkjdjr",
  "the_new_excerpt": "Just curious as when I’ve talked about my low moods revolving around my lack of\nsuccess in these areas I’m told it’s “not that good anyway.” And it’s no reason\nto be depressed.\n\nBut if it’s not that good, why is it everywhere?\n\nI don’t see films, or songs talking about how solitude is the best…",
  "original_created_utc": 1621548531,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この分野で成功していないことが原因で気分が落ち込んでいることを話すと、「そんなことはないだろう」と言われるので、興味があります。\nこの分野で成功していないことが原因で気分が落ち込んでいることを話すと、\"どうせ大したことない \"と言われます。落ち込む理由にはなりませんし\n落ち込む理由にはなりません。\n\nでも、そんなに良くないのなら、なぜどこにでもあるのでしょう？\n\n映画でも歌でも、「孤独が一番だ」というような話は見ませんが...。",
      "title": "性や関係がそれほど重要ではないのなら、なぜあらゆるメディアが性や関係で消費されるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是好奇，因为当我谈到我的情绪低落是围绕着我在这些方面的缺乏\n在这些领域的成功时，我被告知 \"反正没那么好\"。而且这不是什么理由\n郁闷。\n\n但如果不是那么好，为什么到处都是呢？\n\n我没有看到电影或歌曲在谈论孤独是最好的...",
      "title": "如果性和关系不是那么重要，那么为什么每一个媒体都被它们所消费？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是好奇，因爲當我談到我的情緒低落是圍繞着我在這些方面的缺乏\n在這些領域的成功時，我被告知 \"反正沒那麼好\"。而且這不是什麼理由\n鬱悶。\n\n但如果不是那麼好，爲什麼到處都是呢？\n\n我沒有看到電影或歌曲在談論孤獨是最好的...",
      "title": "如果性和關係不是那麼重要，那麼爲什麼每一個媒體都被它們所消費？"
    }
  ],
  "title": "If sex and relationships aren’t that important then why is every single piece of media consumed by them?",
  "created_utc": 1621599724,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just curious as when I’ve talked about my low moods revolving around my lack of success in these areas I’m told it’s “not that good anyway.” And it’s no reason to be depressed. </p>\n\n<p>But if it’s not that good, why is it everywhere? </p>\n\n<p>I don’t see films, or songs talking about how solitude is the best feeling in the world and being alone is amazing. </p>\n\n<p>But an absurdly large % of media is nothing but sex and relationships. So what is it all just an ironic display of how over rated it is?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/nhcy84/if_sex_and_relationships_arent_that_important/",
  "subreddit": "TooAfraidToAsk",
  "id": "nhcy84",
  "is_self": true,
  "media": null,
  "is_video": false
}