{
  "author": "ohlookitsmikey",
  "original_created_utc": 1644616692,
  "title": "Those who release balloons for friends and family who passed away; what would it take for you to not do that?",
  "created_utc": 1644630514,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I worked in a shop that sold helium balloons, amongst other things, and the amount of people who would come in and say they wanted foil balloons to release into the sky for their loved one drove me a bit mad. &lt;/p&gt;\n\n&lt;p&gt;I get that doing something is a positive thing, but would it really be less appealing to buy a tree sapling, or some flowers, and watch them grow and last longer than a thing that is disposable, wasteful, and dangerous to wildlife? &lt;/p&gt;\n\n&lt;p&gt;The question I always thought (and never said because not a monster) was, &amp;quot;did your relative love balloons, or are you just doing it because that&amp;#39;s what is perceived to be the done thing?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;.&amp;#10;&lt;/p&gt;\n\n&lt;p&gt;.&amp;#10;&lt;/p&gt;\n\n&lt;p&gt;.&amp;#10;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit: Putting suggestions here ☺️&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Releasing petals into the sea/stream (&lt;a href=\"/u/tannon21\"&gt;/u/tannon21&lt;/a&gt;)&lt;/li&gt;\n&lt;li&gt;Writing a letter or email and removing it (&lt;a href=\"/u/_im_so_uncreative\"&gt;/u/_im_so_uncreative&lt;/a&gt;)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 139,
  "permalink": "/r/TooAfraidToAsk/comments/sqarq1/those_who_release_balloons_for_friends_and_family/",
  "subreddit": "TooAfraidToAsk",
  "id": "sqarq1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I worked in a shop that sold helium balloons, amongst other things, and the\namount of people who would come in and say they wanted foil balloons to release\ninto the sky for their loved one drove me a bit mad.\n\nI get that doing something is a positive thing, but would it really be less\nappealing to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はヘリウム風船などを販売するお店で働いていましたが、その中でも\n箔の風船を飛ばしたいという人が何人も来ていました。\n大切な人のために大空へ。\n\n何かをすることがポジティブなことだというのはわかるのですが、果たしてそのことが\nをアピールする。",
      "title": "亡くなった友人や家族のために風船を飛ばす人たち、それをしないためにはどうしたらいいのでしょう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我曾在一家出售氦气球的商店工作，除其他东西外，还有\n有很多人进来说他们想用铝箔气球为他们的爱人放飞。\n放飞到天空中，为他们所爱的人，让我有点抓狂。\n\n我明白，做一些事情是积极的，但它真的会减少\n吸引人...",
      "title": "那些为去世的朋友和家人放飞气球的人；要怎样才能让你不这样做呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾在一家出售氦氣球的商店工作，除其他東西外，還有\n有很多人進來說他們想用鋁箔氣球爲他們的愛人放飛。\n放飛到天空中，爲他們所愛的人，讓我有點抓狂。\n\n我明白，做一些事情是積極的，但它真的會減少\n吸引人...",
      "title": "那些爲去世的朋友和家人放飛氣球的人；要怎樣才能讓你不這樣做呢？"
    }
  ]
}