{
  "author": "Famateur",
  "the_new_excerpt": "How was the atmosphere and talks around that time? Were there any rumors or\nconspiracy theories about the possible crash soon? We all saw \"The Big Short\"\nbut I wanted to know what the normal retail investor/trader's opinion of that\ntime. Were most of us caught by surprise? I have just started to…",
  "original_created_utc": 1618840647,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "その頃の雰囲気や話はどうでしたか？噂や陰謀論はあったか？\n噂や陰謀論はありましたか？ビッグ・ショート』を見ました。\nしかし、普通の個人投資家やトレーダーは当時どのような意見を持っていたのか知りたかったのです。\n驚きましたか？私たちの多くは不意打ちを食らったのでしょうか？私はまだ始めたばかりですが...",
      "title": "Redditの株式市場経験者の皆さん、2008年の株式市場の暴落を予測できましたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当时周围的气氛和会谈情况如何？是否有任何传言或\n阴谋论可能很快就会崩溃？我们都看过 \"大空头\"\n但我想知道普通的散户投资者/交易员对此有什么看法？\n时间。我们大多数人都被吓到了吗？我刚刚开始...",
      "title": "有经验的股市红人，你能预测到2008年的股灾吗？讨论"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當時周圍的氣氛和會談情況如何？是否有任何傳言或\n陰謀論可能很快就會崩潰？我們都看過 \"大空頭\"\n但我想知道普通的散戶投資者/交易員對此有什麼看法？\n時間。我們大多數人都被嚇到了嗎？我剛剛開始...",
      "title": "有經驗的股市紅人，你能預測到2008年的股災嗎？討論"
    }
  ],
  "title": "Experienced stock market people of Reddit, were you able to predict the stock market crash in 2008?Discussion",
  "created_utc": 1618856316,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>How was the atmosphere and talks around that time? Were there any rumors or conspiracy theories about the possible crash soon? We all saw &quot;The Big Short&quot; but I wanted to know what the normal retail investor/trader&#39;s opinion of that time. Were most of us caught by surprise? I have just started to take keen interest in stock market after March 2020 crash. Please share some of your experience if you can. Thank you.</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/stocks/comments/mu15nv/experienced_stock_market_people_of_reddit_were/",
  "subreddit": "stocks",
  "id": "mu15nv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171527433
}