{
  "author": "StinsonSwarley",
  "the_new_excerpt": "Hey guys, I really appreciate you taking the time to read my post and help me. I\nhope you can bear with me through my inexperience and confusion\n\nI am from Serbia, living in Serbia. With that in mind, I realized that my\npersonal investments in US stocks will be liable to a 60% tax upon…",
  "original_created_utc": 1621792516,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、私の投稿を読むのに時間を割いてくれたり、助けてくれたりして本当に感謝しています。I\n私の未熟さと戸惑いにお付き合いいただければ幸いです。\n\n私はセルビア出身で、セルビアに住んでいます。それを踏まえて、私は自分の\n米国株への個人投資には、60％の税金がかかることがわかりました。",
      "title": "外国人の米国株・英国株の相続税/遺産相続税"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，伙计们，我真的很感谢你们花时间来阅读我的帖子并帮助我。I\n希望你们能容忍我的无知和困惑。\n\n我来自塞尔维亚，住在塞尔维亚。考虑到这一点，我意识到，我的\n个人投资的美国股票将被征收60%的税。",
      "title": "外国人的美国或英国股票的遗产/继承税"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，夥計們，我真的很感謝你們花時間來閱讀我的帖子並幫助我。I\n希望你們能容忍我的無知和困惑。\n\n我來自塞爾維亞，住在塞爾維亞。考慮到這一點，我意識到，我的\n個人投資的美國股票將被徵收60%的稅。",
      "title": "外國人的美國或英國股票的遺產/繼承稅"
    }
  ],
  "title": "Estate/Inheritance tax on US or UK stocks for a foreigner",
  "created_utc": 1621810775,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey guys, I really appreciate you taking the time to read my post and help me. I hope you can bear with me through my inexperience and confusion</p>\n\n<p>I am from Serbia, living in Serbia. With that in mind, I realized that my personal investments in US stocks will be liable to a 60% tax upon death (inheritance to my kids)</p>\n\n<p>According to this <a href=\"https://www.irs.gov/individuals/international-taxpayers/some-nonresidents-with-us-assets-must-file-estate-tax-returns\">irs post</a> ,  Certain deceased nonresidents who were not citizens of the United States are subject to U.S. estate taxation with respect to their U.S.-situated assets. They also list stock of corporations under us law as an example of something that would fall under us law.</p>\n\n<p>Am I wrong to say that I (my kids) will be liable for a high US estate tax and talking to the IRS upon death?</p>\n\n<p>With that, I have a follow up question, and that is, how do these rules apply to me buying UK stocks. Here, I have not found any posts that specifically reference non citizen, non residents. The closest to that I found was this <a href=\"https://www.gov.uk/tax-uk-income-live-abroad/selling-or-inheriting-assets\">gov.uk</a> which says that you only pay inheritance tax on land, but then also on the same page says shares could also be liable for the tax??? This link also might be talking about people who moved out of the uk, and not me (who has never been an uk citizen or resident)</p>\n</div><!-- SC_ON -->",
  "score": 54,
  "permalink": "/r/stocks/comments/njd3bd/estateinheritance_tax_on_us_or_uk_stocks_for_a/",
  "subreddit": "stocks",
  "id": "njd3bd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197389729
}