{
  "author": "Slainte042",
  "original_created_utc": 1642857734,
  "title": "This is my first Crypto Crash and I'm sure I'm not the only one. Any advices, tips and tricks from the CryptoVets on how to handle my first ever crash?",
  "created_utc": 1642873242,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m into Crypto for about 6 months now and this is my first ever serious crash. I&amp;#39;ve never seen such dip before, these double digit red percentages are staggering and hurting my soul. I&amp;#39;m sure it&amp;#39;s not only me as most of the people entered crypto in 2021.&lt;/p&gt;\n\n&lt;p&gt;Everyone has its own strategy to handle the situation, for example I&amp;#39;m reading some positive posts here in the sub for my daily dose of Hopium. This is how i try to survive.&lt;/p&gt;\n\n&lt;p&gt;I wanted to ask the more experienced users, the ones that have already survived several crashes back in the days, for advices for the newbies like me. How do you handle such volatile times, how do you keep yourself menially stable, what do you change in your daily routine to handle the losses.&lt;/p&gt;\n\n&lt;p&gt;If there is one single advice you should give to someone like me, what would it be?&lt;/p&gt;\n\n&lt;p&gt;Thank you!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 303,
  "permalink": "/r/CryptoCurrency/comments/sa2ezw/this_is_my_first_crypto_crash_and_im_sure_im_not/",
  "subreddit": "CryptoCurrency",
  "id": "sa2ezw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm into Crypto for about 6 months now and this is my first ever serious crash.\nI've never seen such dip before, these double digit red percentages are\nstaggering and hurting my soul. I'm sure it's not only me as most of the people\nentered crypto in 2021.\n\nEveryone has its own strategy to handle…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号を始めて6ヶ月になりますが、初めての大暴落です。\nこのような暴落は初めてです。\n呆然とし、心が痛む。私だけではなく、ほとんどの人がそうだと思います。\nは2021年に暗号に参入しました。\n\n誰もが独自の戦略で対処している...",
      "title": "今回のCrypto Crashは、私にとって初めてのCrypto Crashです。私の最初のクラッシュを処理する方法についてCryptoVetsから任意のアドバイス、ヒントやトリック？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我进入加密货币大约6个月了，这是我第一次出现严重的崩溃。\n我以前从未见过这样的下跌，这些两位数的红色百分比是\n这些两位数的红色百分比令人震惊，并伤害了我的灵魂。我相信这不仅仅是我的问题，因为大多数人都是在2021年进入加密货币。\n在2021年进入加密货币。\n\n每个人都有自己的策略来处理...",
      "title": "这是我的第一次Crypto崩溃，我相信我不是唯一的一个。CryptoVets对如何处理我的第一次崩溃有什么建议、提示和窍门吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我進入加密貨幣大約6個月了，這是我第一次出現嚴重的崩潰。\n我以前從未見過這樣的下跌，這些兩位數的紅色百分比是\n這些兩位數的紅色百分比令人震驚，並傷害了我的靈魂。我相信這不僅僅是我的問題，因爲大多數人都是在2021年進入加密貨幣。\n在2021年進入加密貨幣。\n\n每個人都有自己的策略來處理...",
      "title": "這是我的第一次Crypto崩潰，我相信我不是唯一的一個。CryptoVets對如何處理我的第一次崩潰有什麼建議、提示和竅門嗎？"
    }
  ]
}