{
  "author": "Cagey898",
  "original_created_utc": 1659077070,
  "title": "After delivering components of the Little Boy atomic bomb to Tinian, Northern Mariana Islands in 1945, the battleship USS Indianapolis was sunk by Japanese submarine I-58 on its way to Leyte. Why was it sent on to Leyte on its own? Why was there no escort or screen ships accompanying it?",
  "created_utc": 1659120075,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It had already completed its top secret mission and had stopped in Guam after Tinian to exchange some crew. Why was the decision made to have it go alone from Guam to Leyte without any escort ships? If it had had an escort accompanying it, they could&amp;#39;ve aided in rescuing much of the USS Indianapolis crew after the sinking, especially since about 50% of the USS Indianapolis&amp;#39; crew died only after being set adrift due to a number of factors like exposure, dehydration, starvation, and shark attacks. Wasn&amp;#39;t it standard procedure in the navy by this point in the war to not let capital ships travel on their own?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/waxlj4/after_delivering_components_of_the_little_boy/",
  "subreddit": "AskHistorians",
  "id": "waxlj4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It had already completed its top secret mission and had stopped in Guam after\nTinian to exchange some crew. Why was the decision made to have it go alone from\nGuam to Leyte without any escort ships? If it had had an escort accompanying it,\nthey could've aided in rescuing much of the USS…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "すでに極秘任務を終え、グアムに立ち寄った後に\nテニアンの後、グアムに立ち寄り、乗組員の交換を行っていた。なぜ、グアムからレイテ島まで、単独で\nなぜ、グアムからレイテ島まで護衛艦をつけずに単独で行くことにしたのでしょうか。もし護衛艦が同行していれば\n多くの乗組員を救出することができただろうに......。",
      "title": "1945年、北マリアナ諸島テニアンに原子爆弾「リトルボーイ」の部品を輸送した戦艦USSインディアナポリスは、レイテ島に向かう途中、日本の潜水艦イ58に撃沈される。なぜ、インディアナポリスは単独でレイテ島に向かったのでしょうか？なぜ、護衛艦や哨戒艦が同行しなかったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "它已经完成了它的绝密任务，在关岛停了下来。\n提尼安岛交换一些船员。为什么决定让它单独从关岛到莱特岛而没有任何护卫舰只？\n关岛到莱特岛，没有任何护卫舰艇？如果它有护卫队随行，他们就可以协助救援。\n他们可以帮助拯救美国海军的大部分人员... ...",
      "title": "1945年，印第安纳波利斯号战舰在向北马里亚纳群岛的提尼安岛运送小男孩原子弹的部件后，在前往莱特岛的路上被日本潜艇I-58号击沉。为什么它被单独派往莱特岛？为什么没有随行的护卫舰或屏蔽舰？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "它已經完成了它的絕密任務，在關島停了下來。\n提尼安島交換一些船員。爲什麼決定讓它單獨從關島到萊特島而沒有任何護衛艦隻？\n關島到萊特島，沒有任何護衛艦艇？如果它有護衛隊隨行，他們就可以協助救援。\n他們可以幫助拯救美國海軍的大部分人員... ...",
      "title": "1945年，印第安納波利斯號戰艦在向北馬里亞納羣島的提尼安島運送小男孩原子彈的部件後，在前往萊特島的路上被日本潛艇I-58號擊沉。爲什麼它被單獨派往萊特島？爲什麼沒有隨行的護衛艦或屏蔽艦？"
    }
  ]
}