{
  "author": "Guney11",
  "the_new_excerpt": "I have been thinking a lot lately about the ethical reasons behind being a\nvegan, and I must admit I cannot justify killing an animal for nutrition when I\ncan live a perfectly healthy life by getting my food from plants. I'd love to\nknow if you have a book recommendation of a philosopher who tackles…",
  "original_created_utc": 1621889917,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は最近、ヴィーガンであることの倫理的理由についてよく考えています。\n正直なところ、植物から食物を得て完全に健康な生活を送ることができるのに、栄養のために動物を殺すことを正当化することはできません。\n植物から摂取すれば完全に健康的な生活が送れるのに、栄養のために動物を殺すことは正当化できません。そこで\nお勧めの哲学者の本がありましたら教えてください...",
      "title": "肉・乳製品を食べることを正当化しようとした哲学者はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近一直在思考作为一个素食主义者背后的道德原因。\n我必须承认，当我可以通过从植物中获取食物而过上完全健康的生活时，我无法证明为了营养而杀害动物是合理的。\n我必须承认，当我可以通过从植物中获取食物而过上完全健康的生活时，我无法证明为了获得营养而杀害动物。我很想知道\n我想知道你是否有推荐的哲学家的书，他能解决...",
      "title": "有哪位哲学家试图为吃肉/乳制品辩护？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近一直在思考作爲一個素食主義者背後的道德原因。\n我必須承認，當我可以通過從植物中獲取食物而過上完全健康的生活時，我無法證明爲了營養而殺害動物是合理的。\n我必須承認，當我可以通過從植物中獲取食物而過上完全健康的生活時，我無法證明爲了獲得營養而殺害動物。我很想知道\n我想知道你是否有推薦的哲學家的書，他能解決...",
      "title": "有哪位哲學家試圖爲喫肉/乳製品辯護？"
    }
  ],
  "title": "Is there a philosopher who attempted to justify eating meat/dairy?",
  "created_utc": 1621939373,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have been thinking a lot lately about the ethical reasons behind being a vegan, and I must admit I cannot justify killing an animal for nutrition when I can live a perfectly healthy life by getting my food from plants. I&#39;d love to know if you have a book recommendation of a philosopher who tackles the subject from the meat/dairy eating side. Also, please feel free to share your opinions because I don&#39;t see many people who eat meat seriously reflecting on this subject. They either try to dismiss it or joke about how vegans are annoying.</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/askphilosophy/comments/nk87xq/is_there_a_philosopher_who_attempted_to_justify/",
  "subreddit": "askphilosophy",
  "id": "nk87xq",
  "is_self": true,
  "media": null,
  "is_video": false
}