{
  "author": "SpeedyCafe",
  "the_new_excerpt": "Two of the popular advice are:\n\n 1. Be patient during some losses and not sell position at the first sign of\n    trouble. If you are an investor, hold it patiently for years.\n\n 2. Don't be married to your position. If a stock is losing you money, exit it.\n\nThese 2 seem a bit contradictory to me.…",
  "original_created_utc": 1621709725,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人気のあるアドバイスを2つご紹介します。\n\n 1. 損失が出ても我慢して、トラブルの兆候があってもポジションを売らない。\n    い。あなたが投資家ならば、何年も辛抱強く持ち続けること。\n\n 2. 自分のポジションに固執しないこと。株が損をしている場合は、その株から撤退する。\n\nこの2つは私には少し矛盾しているように思えます....",
      "title": "我慢することと、自分の立場と結婚することの違いは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "其中两个流行的建议是。\n\n 1. 在一些损失中要有耐心，不要一有迹象就卖出头寸。\n    困难。如果你是一个投资者，要耐心地持有几年。\n\n 2. 2.不要与你的位置结婚。如果一只股票正在让你亏损，就退出它。\n\n在我看来，这2点似乎有点矛盾，....",
      "title": "耐心和嫁给你的立场之间有什么区别？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "其中兩個流行的建議是。\n\n 1. 在一些損失中要有耐心，不要一有跡象就賣出頭寸。\n    困難。如果你是一個投資者，要耐心地持有幾年。\n\n 2. 2.不要與你的位置結婚。如果一隻股票正在讓你虧損，就退出它。\n\n在我看來，這2點似乎有點矛盾，....",
      "title": "耐心和嫁給你的立場之間有什麼區別？"
    }
  ],
  "title": "What is the difference between patience and married to your position?",
  "created_utc": 1621724398,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Two of the popular advice are:</p>\n\n<ol>\n<li><p>Be patient during some losses and not sell position at the first sign of trouble. If you are an investor, hold it patiently for years.</p></li>\n<li><p>Don&#39;t be married to your position. If a stock is losing you money, exit it.</p></li>\n</ol>\n\n<p>These 2 seem a bit contradictory to me. Suppose I own some stock of a company for a long term, how do I know if I should be patient or get rid of my position?</p>\n\n<p>Update:</p>\n\n<p>One more follow-up question. As an average investor without even accounting background, I have no way to do thorough DD. If a stock falls tomorrow, I can give you a dozen reason on why it&#39;s a bad stock, but if the same stock goes up, I can give you many reasons why it&#39;s a good stock. How do I know if DD is correct. I think there is no way to know it for sure?</p>\n</div><!-- SC_ON -->",
  "score": 215,
  "permalink": "/r/investing/comments/nipews/what_is_the_difference_between_patience_and/",
  "subreddit": "investing",
  "id": "nipews",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197388313
}