{
  "author": "Nanobot110",
  "the_new_excerpt": "Figured I'd throw some moons around to try and lighten the mood here a bit by\nhaving a little contest.\n\nWhoever guesses what the lowest price bitcoin will hit will win 400 moons second\nplace will get 150 moons and third place will get 50 moons.\n\nRules:\n\n-only one entry per person\n\n-placing is…",
  "original_created_utc": 1623162227,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この場の雰囲気を少しでも良くしようと思って、ムーンを投げてみました。\nちょっとしたコンテストを開催します。\n\nビットコインの最安値を当てた人には400ムーン、2位には150ムーン、3位には50ムーンが与えられます。\n2位は150ムーン、3位は50ムーンを獲得できます。\n\nルールは？\n\n-お一人様一回限りとさせていただきます。\n\n-順位は...",
      "title": "BTC：タイム・ザ・ボトム・コンテスト"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想我应该抛出一些月亮，试图通过举办小比赛来缓解这里的气氛。\n举行一个小比赛。\n\n谁能猜出比特币的最低价格，谁就能赢得400个月亮。\n第二名将得到150个月亮，第三名将得到50个月亮。\n\n规则。\n\n-每个人只能参加一次\n\n-排名是...",
      "title": "BTC：底部竞赛的时间"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想我應該拋出一些月亮，試圖通過舉辦小比賽來緩解這裏的氣氛。\n舉行一個小比賽。\n\n誰能猜出比特幣的最低價格，誰就能贏得400個月亮。\n第二名將得到150個月亮，第三名將得到50個月亮。\n\n規則。\n\n-每個人只能參加一次\n\n-排名是...",
      "title": "BTC：底部競賽的時間"
    }
  ],
  "title": "BTC: time the bottom contest",
  "created_utc": 1623231040,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Figured I&#39;d throw some moons around to try and lighten the mood here a bit by having a little contest.</p>\n\n<p>Whoever guesses what the lowest price bitcoin will hit will win 400 moons second place will get 150 moons and third place will get 50 moons.</p>\n\n<p>Rules:</p>\n\n<p>-only one entry per person</p>\n\n<p>-placing is whoever is closest within 2 decimal points of the USD</p>\n\n<p>-don&#39;t deliberately guess the same number as another person a tie will result in a quick contest I&#39;ll make up on the spot to resolve.</p>\n\n<p>-contest ends 6/15 @ 12:00 AM EST</p>\n\n<p>Edit: to clarify your trying to guess the lowest point between now and the end of the contest.</p>\n\n<p>Edit 2: I&#39;m new to contests and had an oversight pointed out the original dates for the price will remain the same however all guesses must be submitted by 6/11 @ 12:00 AM EST</p>\n\n<p>Edit 3: Alright well I was going through telling people to open their vault until I realized there&#39;s at least 100 people who have commented and not opened their vaults, so here it is. Open your vaults my dudes. Thank you.</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/nv5758/btc_time_the_bottom_contest/",
  "subreddit": "CryptoCurrency",
  "id": "nv5758",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404884250
}