{
  "author": "Tastypies",
  "the_new_excerpt": "Not gonna name names because this is not about trashing someone in particular,\nbut it's really getting on my nerves lately. I'm trying to get more informed\nabout crypto, so I started browsing youtube for reasonable voices, but 99% of\nthose crypto youtubers give me a shady impression, to say the…",
  "original_created_utc": 1619863439,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは特定の誰かを非難するためのものではないので、名前は挙げません。\nしかし、最近は本当にイライラしています。暗号についてもっと情報を得ようとしているので\n妥当な声を求めてyoutubeを見始めたのですが、cryptoのyoutuberの99%は怪しい印象を受けます。\nしかし、99％のcrypto youtuberは私に怪しい印象を与えています。",
      "title": "意見です。多くの暗号通貨ユーチューバーは詐欺師のように聞こえる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不想指名道姓，因为这并不是要抨击某个人。\n但它最近真的让我很不爽。我正试图更多了解\n关于加密货币，所以我开始浏览YouTube，寻找合理的声音，但99%的\n但99%的加密货币优酷网友都给我留下了阴暗的印象，可以说是...",
      "title": "观点。如此多的加密货币优酷网友听起来像骗子"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不想指名道姓，因爲這並不是要抨擊某個人。\n但它最近真的讓我很不爽。我正試圖更多瞭解\n關於加密貨幣，所以我開始瀏覽YouTube，尋找合理的聲音，但99%的\n但99%的加密貨幣優酷網友都給我留下了陰暗的印象，可以說是...",
      "title": "觀點。如此多的加密貨幣優酷網友聽起來像騙子"
    }
  ],
  "title": "Opinion: So many cryptocurrency youtubers sound like scam artists",
  "created_utc": 1619940630,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Not gonna name names because this is not about trashing someone in particular, but it&#39;s really getting on my nerves lately. I&#39;m trying to get more informed about crypto, so I started browsing youtube for reasonable voices, but 99% of those crypto youtubers give me a shady impression, to say the least. And it&#39;s not limited to small channels with 100 subscribers, even channels with over 100k subscribers give me snake-oil salesman vibes. These channels are mostly structured the same:</p>\n\n<ul>\n<li><p>hype thumbnail with :O face</p></li>\n<li><p>&quot;I&#39;m not a financial advisor (but make sure to listen to my advice)&quot;</p></li>\n<li><p>make a video about literally every coin in existence and tell me why EVERY SINGLE ONE is the hottest shit and going to the moon (the sad thing is, it&#39;s almost working. Some youtubers really have a talent to make a shit coin look like the best thing in existence and almost make me invest in it)</p></li>\n<li><p>never mention the majority of coins they hyped again once they go down, instead focus on the few they talked about that went up and show everyone how much foresight they had</p></li>\n<li><p>tell everyone how rich they became just by trading coins and how YOU can also become a crypto millionaire (remember the scam mails and fake letters that promise you to become a millionaire just by investing a tiny sum into XYZ, you know, the thing that boomers fell for? This is basically the same, just for us enlightened millennials and zoomers)</p></li>\n<li><p>comment sections that are almost parody, no skeptical voices, 70% of people thanking the youtuber for their amazing knowledge and 30% bots trying to scam people even further</p></li>\n</ul>\n\n<p>I&#39;m somewhat new to the whole cryptocurrency thing, but tell me, do you feel the same about these youtubers or do you have a more positive view on them?</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/n2fela/opinion_so_many_cryptocurrency_youtubers_sound/",
  "subreddit": "CryptoCurrency",
  "id": "n2fela",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380961468
}