{
  "author": "Neembuu",
  "original_created_utc": 1641666062,
  "title": "Being a little kind towards newbies won’t take anything away from us. As a sub, we should be guiding the new people entering this sub rather than scaring them away by being rude.",
  "created_utc": 1641696101,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A lot  of newbies entered the market when it was pumping, and seeing the value of your investment plummet like this really scares the hell out of everyone. It doesn’t help anyone to scold and taunt newbies asking about the bear market and belittling them by saying shit like “if you needed your money back so soon, you shouldn’t have invested in crypto” or “if you did your own research, you wouldn’t be scared like this now”. Even if that&amp;#39;s true, there are plenty of nicer ways to say it and we don&amp;#39;t need to be driving away newbies who will ultimately help grow the market. We are all in this together, that is the whole point of decentralized finance.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 316,
  "permalink": "/r/CryptoCurrency/comments/rz67m3/being_a_little_kind_towards_newbies_wont_take/",
  "subreddit": "CryptoCurrency",
  "id": "rz67m3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A lot of newbies entered the market when it was pumping, and seeing the value of\nyour investment plummet like this really scares the hell out of everyone. It\ndoesn’t help anyone to scold and taunt newbies asking about the bear market and\nbelittling them by saying shit like “if you needed your money…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの初心者がポンピングの時に市場に参入し、その価値を目の当たりにした。\nこのように投資額が激減すると、誰もが本当に怖くなります。それは\nベアマーケットについて質問する初心者を叱り、愚弄することは、誰の役にも立ちません。\nお金が必要なら......」とか言って、相手を小馬鹿にしたようなことを言う。",
      "title": "初心者に少し優しくしても、私たちから何かを奪うことはありません。サブとして、このサブに入ってくる新しい人たちを、失礼な態度で怖がらせるのではなく、導いてあげるべきなのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很多新手在市场抽水的时候进入市场，看到你的投资价值像这样暴跌，真的让人害怕。\n你的投资像这样暴跌，真的让每个人都感到害怕。这\n斥责和嘲弄问及熊市的新手并贬低他们，说 \"如果你需要的话 \"之类的话，对任何人都没有帮助。\n贬低他们，说什么 \"如果你需要你的钱...... \"之类的话。",
      "title": "对新手好一点并不会让我们失去什么。作为一个分队，我们应该引导进入这个分队的新人，而不是用粗鲁的方式把他们吓跑。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多新手在市場抽水的時候進入市場，看到你的投資價值像這樣暴跌，真的讓人害怕。\n你的投資像這樣暴跌，真的讓每個人都感到害怕。這\n斥責和嘲弄問及熊市的新手並貶低他們，說 \"如果你需要的話 \"之類的話，對任何人都沒有幫助。\n貶低他們，說什麼 \"如果你需要你的錢...... \"之類的話。",
      "title": "對新手好一點並不會讓我們失去什麼。作爲一個分隊，我們應該引導進入這個分隊的新人，而不是用粗魯的方式把他們嚇跑。"
    }
  ]
}