{
  "author": "subucula",
  "the_new_excerpt": "Some vaccines appear to have non-specific (or heterologous) effects.\nSpecifically, the two live-attenuated BCG and measles vaccines seem to grant\nprotection against things beyond what they were designed for.\n\nMeanwhile, the DTP vaccine, which is not live-attenuated, may have a detrimental\nnon…",
  "original_created_utc": 1618969500,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ワクチンの中には、非特異的（または異種混合）な効果を持つものがあるようです。\n具体的には、BCGと麻疹の2つの弱毒化生ワクチンは、そのワクチンが設計された目的以外のものに対して保護を与えるようです。\n生弱毒化したBCGと麻疹の2つのワクチンは、本来の目的以外のものに対しても予防効果があるようです。\n\n一方、弱毒化されていないDTPワクチンは、本来の目的以外にも有害な影響を与える可能性があります。\n非...",
      "title": "コビットのワクチンには正の非特異効果があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一些疫苗似乎具有非特异性（或异源性）效应。\n具体而言，两种减毒活疫苗卡介苗和麻疹疫苗似乎可以提供\n对超出其设计用途的东西提供保护。\n\n同时，非活疫苗的DTP疫苗，可能具有不利的\n非...",
      "title": "Covid疫苗是否有积极的非特异性影响？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一些疫苗似乎具有非特異性（或異源性）效應。\n具體而言，兩種減毒活疫苗卡介苗和麻疹疫苗似乎可以提供\n對超出其設計用途的東西提供保護。\n\n同時，非活疫苗的DTP疫苗，可能具有不利的\n非...",
      "title": "Covid疫苗是否有積極的非特異性影響？"
    }
  ],
  "title": "Do the Covid vaccines have positive non-specific effects?",
  "created_utc": 1619001512,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Some vaccines appear to have non-specific (or heterologous) effects. Specifically, the two live-attenuated BCG and measles vaccines seem to grant protection against things beyond what they were designed for. </p>\n\n<p>Meanwhile, the DTP vaccine, which is not live-attenuated, may have a detrimental non-specific effect, although the evidence here looks weaker. </p>\n\n<p>I know it’s early but I was wondering which category the Covid vaccines might fit in. </p>\n\n<p>So, do the mRNA Covid vaccines have positive non-specific effects? Do the adenovirus-based ones?</p>\n</div><!-- SC_ON -->",
  "score": 112,
  "permalink": "/r/askscience/comments/mv5nd1/do_the_covid_vaccines_have_positive_nonspecific/",
  "subreddit": "askscience",
  "id": "mv5nd1",
  "is_self": true,
  "media": null,
  "is_video": false
}