{
  "author": "JohnBoone",
  "original_created_utc": 1636895512,
  "title": "Binance deactivated my account and is making it impossible to reactivate it and access my funds.",
  "created_utc": 1636921838,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I didn&#39;t use binance for a few months and tried to log in today to see how my few shitcoins were doing. I found out that my account was deactivated. The automated reactivation process keeps failing so I contacted the support.</p>\n\n<p>I&#39;m told that &quot;I deactivated the account&quot; even though I&#39;m sure I didn&#39;t do it. 2FA is enabled, strong password is used and no deactivation email found in my mailbox.</p>\n\n<p>Now they&#39;re making it impossible to reactivate it as they&#39;re asking me the browser version I used when I registered (3 and a half years ago). They also want a video of a deposit I made to binance and more absurd things. Here are their astonishing requirements to gain access to my $30 :</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>Please provide all details exactly as indicated in this record as it will be audited by the relevant team. You may provide your national ID and repeat the line stated in the statement accordingly.<br/>\nPlease provide us with the following information for the account verification : • Security questions : 1. Account registration date 2. Account registration IP • Device information (at minimum operating system version, brand, model, and browser name/version) regarding at least one device that is commonly used on the account Or mobile login Video • Statement video Please record a video, where you need to appear in the video and hold the information page of your ID document and repeat clearly the following sentence: &quot;Today is date/month/year, reset google/email/mobile phone for Binance account xxx. •Deposit video： Please take a video of any deposit record of this account within 6 months. The video should contain the whole login process （sensitive information can be covered）from the sender platform/wallet, and information for this transaction such as the full TxID, date, and amount.<br/>\nWe require the user to log in from the withdrawal platform(Sender side) and then take the video of the withdraw record (to show his deposit to Binance.com), so the user does not need to log in to our platform to view the deposit address.</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p>I really feel I&#39;m being robbed and I don&#39;t understand how such a popular platform can behave like this. Hope you guys have more luck with this &quot;company&quot;</p>\n</div><!-- SC_ON -->",
  "score": 195,
  "permalink": "/r/CryptoCurrency/comments/qtpjbh/binance_deactivated_my_account_and_is_making_it/",
  "subreddit": "CryptoCurrency",
  "id": "qtpjbh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I didn't use binance for a few months and tried to log in today to see how my\nfew shitcoins were doing. I found out that my account was deactivated. The\nautomated reactivation process keeps failing so I contacted the support.\n\nI'm told that \"I deactivated the account\" even though I'm sure I didn't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は数ヶ月間binanceを使っていませんでしたが、今日ログインして私のいくつかのシットコインがどうなっているか見ようとしました。\nしようとしたのですが、私のいくつかのシットコインがどうなっているか 私のアカウントは無効化されていることがわかりました。しかし\n自動再起動プロセスが失敗し続けているので、サポートに連絡しました。\n\n解除していないはずなのに、「私がアカウントを解除した」と言われてしまいました。",
      "title": "Binanceは私のアカウントを無効にし、再有効化して私の資金にアクセスすることを不可能にしています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有几个月没有使用Binance了，今天试图登录，看看我的\n我的几枚垃圾币在做什么。我发现我的账户被停用了。自动重新激活程序\n自动重新激活过程一直失败，所以我联系了支持部门。\n\n我被告知，\"我停用了账户\"，尽管我确信我没有...",
      "title": "Binance停用了我的账户，并使我无法重新激活账户和访问我的资金。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有幾個月沒有使用Binance了，今天試圖登錄，看看我的\n我的幾枚垃圾幣在做什麼。我發現我的賬戶被停用了。自動重新激活程序\n自動重新激活過程一直失敗，所以我聯繫了支持部門。\n\n我被告知，\"我停用了賬戶\"，儘管我確信我沒有...",
      "title": "Binance停用了我的賬戶，並使我無法重新激活賬戶和訪問我的資金。"
    }
  ]
}