{
  "author": "outwesthooker",
  "original_created_utc": 1635828586,
  "title": "Who else feels like they did everything “right” and still life is difficult?",
  "created_utc": 1635841119,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi all—just looking to commiserate with people on this because I’m sure there’s other that feel this way.</p>\n\n<p>I did everything I was told to do growing up to have a comfortable life. I excelled in school, got honors, went on to do very well in college and graduated with my BA in English. I was consistently told in high school to get a degree, any degree, to land a job, and I thought I wanted to be a teacher. Quickly came the realization that the pay and work sucks, so I ended up not going into that. I struggled to find any kind of job that paid well for several years, finally found something I did love doing but could not advance in that field without a masters, so I went back for that. Well, now I have two degrees under my belt and I’m not really making much more money at all. I work my main job and two-three other gigs just to keep afloat. I do really love my main job but it doesn’t pay enough. I’m constantly worn out and just want to be able to live a quiet little life working one job. Covid wiped any sort of savings me and my partner had, and it’s impossible to get ahead. We do not live extravagantly, and it’s hard to find more places to cut back.</p>\n\n<p>I see my friends, and my peers, saving and getting married and having kids and buying houses and it just depresses me. My partner and I are engaged, but we can’t afford any kind of nice wedding. I don’t want kids, but it’s tough to see people being in the position to have them. Buying a house is out of the question since little one room shacks go for half a million in my area and most people buying them come in with hundreds of thousands of dollars over asking price and buy in cash. </p>\n\n<p>I’m 32 in January and I don’t know how to go on with this grind. I guess I could back to school? Im trying to find the light at the end of the tunnel here but I’m just not seeing it. I’m stuck working 50-60 hours a week just to break even, forget about all the hallmarks of being an adult. </p>\n\n<p>Does anyone relate? How do you deal?</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/NoStupidQuestions/comments/qkwotk/who_else_feels_like_they_did_everything_right_and/",
  "subreddit": "NoStupidQuestions",
  "id": "qkwotk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi all—just looking to commiserate with people on this because I’m sure there’s\nother that feel this way.\n\nI did everything I was told to do growing up to have a comfortable life. I\nexcelled in school, got honors, went on to do very well in college and graduated\nwith my BA in English. I was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。私はこの件で人々と同情したいと思っています。\nこのように感じている人は他にもいると思うので。\n\n私は子供の頃、快適な生活を送るために言われたことをすべてやりました。I\n私は学校で優秀な成績を収め、優等生だったので、大学では非常に優秀な成績を収め、英語の学士号を取得して卒業しました。\n英語の学士号を取得しました。私は...",
      "title": "すべてのことを正しく行ったにもかかわらず、人生が困難であると感じている人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我只是想在这个问题上与大家共勉，因为我确信还有其他人有这种感觉。\n其他有这种感觉的人。\n\n为了过上舒适的生活，我做了成长过程中被告知要做的一切。I\n我在学校成绩优异，获得了荣誉，在大学里表现非常好，毕业时获得了英语学士学位。\n获得了英语学士学位。我是...",
      "title": "还有谁觉得自己做了所有 \"正确 \"的事情，但生活仍然困难重重？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我只是想在這個問題上與大家共勉，因爲我確信還有其他人有這種感覺。\n其他有這種感覺的人。\n\n爲了過上舒適的生活，我做了成長過程中被告知要做的一切。I\n我在學校成績優異，獲得了榮譽，在大學裏表現非常好，畢業時獲得了英語學士學位。\n獲得了英語學士學位。我是...",
      "title": "還有誰覺得自己做了所有 \"正確 \"的事情，但生活仍然困難重重？"
    }
  ]
}