{
  "author": "NoIdeaWhatImDoing___",
  "the_new_excerpt": "My post yesterday, which challenged traditional investing strategies, gained a\nlot of traction. I read through most of the comments. Good insight from many.\nThank you to those of you who had it in your heart to extend your kindness to\nyour reddit comments and opted to share your opinions without…",
  "original_created_utc": 1608477007,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我昨天的帖子挑战了传统的投资策略，获得了\n牵引力很大。我通读了大部分评论。很多人都有很好的洞察力。\n感谢那些发自内心的人，感谢你们的善意\n您的Reddit评论，并选择在没有…的情况下分享您的观点",
      "title": "我们如何保护自己免受不可避免地会弹出的显而易见的泡沫的影响？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我昨天的帖子挑戰了傳統的投資策略，獲得了\n牽引力很大。我通讀了大部分評論。很多人都有很好的洞察力。\n感謝那些發自內心的人，感謝你們的善意\n您的Reddit評論，並選擇在沒有…的情況下分享您的觀點",
      "title": "我們如何保護自己免受不可避免地會彈出的顯而易見的泡沫的影響？"
    }
  ],
  "title": "How do we protect ourselves against the obvious bubble we’re in that will inevitably pop?",
  "created_utc": 1608492661,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My post yesterday, which challenged traditional investing strategies, gained a lot of traction. I read through most of the comments. Good insight from many. Thank you to those of you who had it in your heart to extend your kindness to your reddit comments and opted to share your opinions without being unnecessarily rude or sarcastic (I’m passionate about people not being assholes in person or on the internet, sue me). Seriously, there was some TOP-NOTCH insight in that thread. Thanks!</p>\n\n<p>Anyway, many thoughtful comments alluded to the “obvious bubble we’re in that’ll inevitably come crashing down and be a rude awakening for immature traders like OP.” </p>\n\n<p>Fair enough. I’m listening. How does a “responsible” investor prepare for this? At the very least I want to educate myself on all angles. </p>\n\n<p>Go mostly cash and wait for the crash? (What if the crash isn’t for 15 more years though). Stay the course and DCA the index each month, and when she crashes double down and buy more because the market ALWAYS goes up over time? (JL Collins preaches this). Do a hybrid of these? But a bunch of TSLA calls tomorrow to get rich before the crash can happen? /s  Something else?</p>\n</div><!-- SC_ON -->",
  "score": 146,
  "permalink": "/r/investing/comments/kgvk7b/how_do_we_protect_ourselves_against_the_obvious/",
  "subreddit": "investing",
  "id": "kgvk7b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609183318252
}