{
  "author": "AliResurrector",
  "the_new_excerpt": "Can we have a way to earn at least small bits of moon from lurking on the sub? I\ncheck and read the sub almost daily but I would still consider myself a noob in\nthe crypto field. I vote often but i barely have anything valuable to post or\ncomment. Seeing the pinned post about all the MOONS…",
  "original_created_utc": 1619148235,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "せめてサブに潜んで月の小口を稼ぐ方法があってもいいのでは？I\nほぼ毎日サブをチェックして読んでいますが、自分はまだ暗号分野では初心者だと思っています。\n暗号の分野ではまだ初心者だと思っています。頻繁に投票していますが、投稿やコメントする価値のあるものはほとんどありません。\nコメントすることはありません。すべてのMOONについてのピン留めされた投稿を見て...",
      "title": "私は、ほとんど何の価値もありません。潜伏していることで、少しずつ月を獲得する方法があってもいいのでは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们能不能有一种方法，从潜伏在子上至少赚取小块的月球？I\n我几乎每天都会查看和阅读子网站，但我仍然认为自己是一个无名小卒在\n在加密货币领域，我仍然认为自己是个新手。我经常投票，但我几乎没有任何有价值的帖子或评论。\n评论。看到钉子上关于所有月球的帖子...",
      "title": "我几乎没有任何有价值的东西可以贡献。我们能不能有一种方法来赚取潜伏的小月球？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們能不能有一種方法，從潛伏在子上至少賺取小塊的月球？I\n我幾乎每天都會查看和閱讀子網站，但我仍然認爲自己是一個無名小卒在\n在加密貨幣領域，我仍然認爲自己是個新手。我經常投票，但我幾乎沒有任何有價值的帖子或評論。\n評論。看到釘子上關於所有月球的帖子...",
      "title": "我幾乎沒有任何有價值的東西可以貢獻。我們能不能有一種方法來賺取潛伏的小月球？"
    }
  ],
  "title": "I barely ever have anything valuable to contribute. Can we have a way to earn small bits of moons for lurking?",
  "created_utc": 1619166949,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Can we have a way to earn at least small bits of moon from lurking on the sub? I check and read the sub almost daily but I would still consider myself a noob in the crypto field. I vote often but i barely have anything valuable to post or comment. \nSeeing the pinned post about all the MOONS distributed makes me sad because I get none - Despite being a loyal member of the sub. Would it cause too much inflation to the currency if there was a way for us lurkers to earn some crums of moons? I imagine like a button I can press every 24 hours to give us tiny tiny amounts?</p>\n\n<p>Edit: my intention was not begging for moons here but a suggestion for a mechanism to reward lurkers too</p>\n</div><!-- SC_ON -->",
  "score": 606,
  "permalink": "/r/CryptoCurrency/comments/mwm78p/i_barely_ever_have_anything_valuable_to/",
  "subreddit": "CryptoCurrency",
  "id": "mwm78p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776207031
}