{
  "author": "CollinsIR",
  "the_new_excerpt": "Mental illness is among the most costly medical expenses in the U.S., and it has\na high cost to employers in lost productivity. In 2019, 51.5 million adults were\nliving with a mental illness in the U.S., and the number of people suffering and\ndrug costs, already in the tens of billions of dollars…",
  "original_created_utc": 1620651600,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "精神疾患は、米国で最も費用のかかる医療費の一つであり、雇用者にとっても生産性の低下という高いコストがかかります。\nは雇用者にとっても生産性の低下という高いコストがかかります。2019年には、51.5百万人の成人が\n米国で精神疾患を抱えて生活しており、苦しんでいる人の数と\n薬剤費、すでに数百億ドルに達しています...。",
      "title": "CNBC メンタルヘルス治療におけるサイケデリック・ドラッグ・ブームが現実に近づいている CMPS MNMD CLXPF ATAI by Eric Rosenbaum"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在美国，精神疾病是最昂贵的医疗费用之一，而且它对雇主的损失也很大。\n雇主在生产力损失方面的成本很高。在2019年，美国有5150万成年人患有精神疾病。\n在美国，有5150万成年人患有精神疾病。\n药物费用，已经达到数百亿美元......",
      "title": "CNBC。精神健康治疗领域的迷幻药热潮离现实越来越近 CMPS MNMD CLXPF ATAI 作者：Eric Rosenbaum"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在美國，精神疾病是最昂貴的醫療費用之一，而且它對僱主的損失也很大。\n僱主在生產力損失方面的成本很高。在2019年，美國有5150萬成年人患有精神疾病。\n在美國，有5150萬成年人患有精神疾病。\n藥物費用，已經達到數百億美元......",
      "title": "CNBC。精神健康治療領域的迷幻藥熱潮離現實越來越近 CMPS MNMD CLXPF ATAI 作者：Eric Rosenbaum"
    }
  ],
  "title": "CNBC: A psychedelic drug boom in mental health treatment comes closer to reality CMPS MNMD CLXPF ATAI by Eric Rosenbaum",
  "created_utc": 1620654821,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Mental illness is among the most costly medical expenses in the U.S.,  and it has a high cost to employers in lost productivity. In 2019, 51.5  million adults were living with a mental illness in the U.S., and the  number of people suffering and drug costs, already in the tens of  billions of dollars annually, are projected to grow in the years ahead,  with Covid-19 compounding mental health issues globally.</p>\n\n<p>&#x200B;</p>\n\n<p>Drugs long stigmatized, such as psilocybin and MDMA, are rising in  profile as mental illness treatment options. Just last week, results  from a phase 3 trial of MDMA combined with talk therapy for  post-traumatic stress disorder showed results that were impressive.</p>\n\n<p>“This  is a pivotal event,” said Elemer Piros, a biotech analyst at Roth  Capital Partners who covers the emerging alternative mental health  treatment space. “It may not seem humongous, but it is one of the best  and most rigorously executed trials in the space. And the results  corroborate what we have seen time and time again from smaller studies  over the past two decades,” he said, referencing remission rates double  that of a placebo. “The magical experiences kept showing up, but no one  had the courage to take it through to regulators.”</p>\n\n<p><a href=\"https://www.cnbc.com/2021/05/10/psychedelic-drug-boom-in-mental-health-treatment-nears-reality-.html?__source=iosappshare%7Ccom.apple.UIKit.activity.Message\">https://www.cnbc.com/2021/05/10/psychedelic-drug-boom-in-mental-health-treatment-nears-reality-.html?__source=iosappshare%7Ccom.apple.UIKit.activity.Message</a></p>\n</div><!-- SC_ON -->",
  "score": 1922,
  "permalink": "/r/investing/comments/n93uwi/cnbc_a_psychedelic_drug_boom_in_mental_health/",
  "subreddit": "investing",
  "id": "n93uwi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994598
}