{
  "author": "nextyear20",
  "the_new_excerpt": "I’ve been seeing a lot of news in the U.S. about the Paris Agreement and how\nsome politicians are telling their constituents that it is for the people of\nParis only (which is 100% not true). This could just be a way to rally their\nbase but let’s assume that they actually don’t know what it is....…",
  "original_created_utc": 1611712868,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在美国看到了很多关于《巴黎协定》的新闻，以及如何。\n一些政客正在告诉他们的选民，这是为了他们的人民。\n只在巴黎（这100%不是真的）。这可能只是一种凝聚他们的方式。\n基础，但我们假设他们其实并不知道这是什么.......。",
      "title": "为什么美国的政治家在竞选公职之前不用参加考试？如果你是政府的负责人，你必须证明你懂得基本的知识，这不是很合理吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在美國看到了很多關於《巴黎協定》的新聞，以及如何。\n一些政客正在告訴他們的選民，這是爲了他們的人民。\n只在巴黎（這100%不是真的）。這可能只是一種凝聚他們的方式。\n基礎，但我們假設他們其實並不知道這是什麼.......。",
      "title": "爲什麼美國的政治家在競選公職之前不用參加考試？如果你是政府的負責人，你必須證明你懂得基本的知識，這不是很合理嗎？"
    }
  ],
  "title": "Why do U.S. politicians not have to take an exam before they are eligible to run for office? Wouldn’t it make sense that if you’re in charge of the government that you have to show that you know basic knowledge?",
  "created_utc": 1611737517,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been seeing a lot of news in the U.S. about the Paris Agreement and how some politicians are telling their constituents that it is for the people of Paris only (which is 100% not true). This could just be a way to rally their base but let’s assume that they actually don’t know what it is.... wouldn’t taking an exam rule out someone unqualified? Additionally, many professionals (doctors, lawyers, CPA etc) have to take exams so why don’t we have one for politicians? (Are there exams for politicians in other countries)</p>\n\n<p>Edit to add: South Korea has civil service exams</p>\n</div><!-- SC_ON -->",
  "score": 238,
  "permalink": "/r/TooAfraidToAsk/comments/l5tn53/why_do_us_politicians_not_have_to_take_an_exam/",
  "subreddit": "TooAfraidToAsk",
  "id": "l5tn53",
  "is_self": true,
  "media": null,
  "is_video": false
}