{
  "author": "ipetgoat1984",
  "original_created_utc": 1658317811,
  "title": "Free MIT courses on blockchain, crypto, and finance.",
  "created_utc": 1658382401,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I thought this might be helpful for anyone looking to dig a little deeper and learn more about the crypto/blockchain space. I took a break from staring at the 1m charts a couple of months ago and decided to fill my free time with some of this curriculum. Amazingly, this resource exists for free.&lt;/p&gt;\n\n&lt;p&gt;MIT OpenCourseWare is an open collection of material from thousands of MIT courses, covering the entire MIT curriculum.&lt;/p&gt;\n\n&lt;p&gt;No enrollment or registration. Freely browse and use OCW materials at your own pace. There&amp;#39;s no signup and no start or end dates. (this is nice for anyone who has a busy schedule and can&amp;#39;t commit to classes all at once, you can take them whenever you have some free time)&lt;/p&gt;\n\n&lt;p&gt;OCW includes a growing collection of free open textbooks, lectures, podcasts, interactive assessments, and assignments. It&amp;#39;s a pretty extensive library.&lt;/p&gt;\n\n&lt;p&gt;Happy learning!&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://ocw.mit.edu/search/?q=blockchain\"&gt;https://ocw.mit.edu/search/?q=blockchain&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;*Edit: For the Gary Gensler haters, there are a ton of other classes about a myriad of things not taught by him, lol. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 319,
  "permalink": "/r/CryptoCurrency/comments/w3kcmk/free_mit_courses_on_blockchain_crypto_and_finance/",
  "subreddit": "CryptoCurrency",
  "id": "w3kcmk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I thought this might be helpful for anyone looking to dig a little deeper and\nlearn more about the crypto/blockchain space. I took a break from staring at the\n1m charts a couple of months ago and decided to fill my free time with some of\nthis curriculum. Amazingly, this resource exists for…"
}