{
  "author": "ipetgoat1984",
  "original_created_utc": 1658317811,
  "title": "Free MIT courses on blockchain, crypto, and finance.",
  "created_utc": 1658382401,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I thought this might be helpful for anyone looking to dig a little deeper and learn more about the crypto/blockchain space. I took a break from staring at the 1m charts a couple of months ago and decided to fill my free time with some of this curriculum. Amazingly, this resource exists for free.&lt;/p&gt;\n\n&lt;p&gt;MIT OpenCourseWare is an open collection of material from thousands of MIT courses, covering the entire MIT curriculum.&lt;/p&gt;\n\n&lt;p&gt;No enrollment or registration. Freely browse and use OCW materials at your own pace. There&amp;#39;s no signup and no start or end dates. (this is nice for anyone who has a busy schedule and can&amp;#39;t commit to classes all at once, you can take them whenever you have some free time)&lt;/p&gt;\n\n&lt;p&gt;OCW includes a growing collection of free open textbooks, lectures, podcasts, interactive assessments, and assignments. It&amp;#39;s a pretty extensive library.&lt;/p&gt;\n\n&lt;p&gt;Happy learning!&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://ocw.mit.edu/search/?q=blockchain\"&gt;https://ocw.mit.edu/search/?q=blockchain&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;*Edit: For the Gary Gensler haters, there are a ton of other classes about a myriad of things not taught by him, lol. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 319,
  "permalink": "/r/CryptoCurrency/comments/w3kcmk/free_mit_courses_on_blockchain_crypto_and_finance/",
  "subreddit": "CryptoCurrency",
  "id": "w3kcmk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I thought this might be helpful for anyone looking to dig a little deeper and\nlearn more about the crypto/blockchain space. I took a break from staring at the\n1m charts a couple of months ago and decided to fill my free time with some of\nthis curriculum. Amazingly, this resource exists for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もう少し掘り下げたい人の参考になるかと思い、また\n暗号／ブロックチェーン領域についてもっと知りたいと考えている人に役立つと思います。私は、数ヶ月前に1mチャートを眺めることから離れ\n数ヶ月前に1mチャートを眺めるのをやめ、空いた時間をこのカリキュラムで埋め合わせることにしました。\nこのカリキュラムに参加することにしました。驚くべきことに、このリソースは...",
      "title": "ブロックチェーン、暗号、金融に関するMITの無料コース。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为这可能对任何希望深入挖掘和\n了解更多关于加密货币/区块链领域的信息。几个月前，我从盯着1米的图表中抽出身来\n几个月前，我从盯着1米的图表中抽身出来，决定用一些课程来填补我的空闲时间。\n这个课程。令人惊讶的是，这种资源存在于...",
      "title": "麻省理工学院关于区块链、加密货币和金融的免费课程。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲這可能對任何希望深入挖掘和\n瞭解更多關於加密貨幣/區塊鏈領域的信息。幾個月前，我從盯着1米的圖表中抽出身來\n幾個月前，我從盯着1米的圖表中抽身出來，決定用一些課程來填補我的空閒時間。\n這個課程。令人驚訝的是，這種資源存在於...",
      "title": "麻省理工學院關於區塊鏈、加密貨幣和金融的免費課程。"
    }
  ]
}