{
  "author": "KAX1107",
  "original_created_utc": 1647942894,
  "title": "India's new tax law on Bitcoin and digital assets shows the government has no ambition to be a world leader. Despite all the brain power, it's always going to be a poor country because of the government's third world mentality.",
  "created_utc": 1647963630,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;India is known to be the world&amp;#39;s largest democracy. But the government there has always been very backward. That&amp;#39;s why in spite of all the man power and brain power, it&amp;#39;s still a third world country.&lt;/p&gt;\n\n&lt;p&gt;CEO of Google, Microsoft, IBM, Adobe, Twitter etc. are all Indians. &lt;/p&gt;\n\n&lt;p&gt;Think about where India could be if these people were not forced out of the country because it&amp;#39;s still too backward to support tech innovation.&lt;/p&gt;\n\n&lt;p&gt;India missed out on leading the world in the 90s with the internet. India will once again miss out on leading the world in Bitcoin and crypto innovation.&lt;/p&gt;\n\n&lt;p&gt;I read the Indian Finance Minister saying the tax laws are supposed to discourage gambling in crypto.&lt;/p&gt;\n\n&lt;p&gt;Well congrats! With your ignorance and short sighted thinking you have just screwed your country out of the biggest opportunity to turn India into a first world country and global superpower.&lt;/p&gt;\n\n&lt;p&gt;Will any Bitcoin and crypto startup invest in India now? No chance in hell! You will lose trillions of dollars of investments and even more brain power will leave India and support foreign economies.&lt;/p&gt;\n\n&lt;p&gt;I feel sorry for people in India. You should look to move to progressive countries that are not afraid of innovation and have the courage to lead.&lt;/p&gt;\n\n&lt;p&gt;India is doomed to be a poor country forever because of third world mentality. What a waste when so many smart people come from India.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 311,
  "permalink": "/r/CryptoCurrency/comments/tjzeym/indias_new_tax_law_on_bitcoin_and_digital_assets/",
  "subreddit": "CryptoCurrency",
  "id": "tjzeym",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "India is known to be the world's largest democracy. But the government there has\nalways been very backward. That's why in spite of all the man power and brain\npower, it's still a third world country.\n\nCEO of Google, Microsoft, IBM, Adobe, Twitter etc. are all Indians.\n\nThink about where India could…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "インドは世界最大の民主主義国家として知られています。しかし、その政府は\n昔から非常に後進的なんです。そのため、多くの人材と頭脳を擁しているにもかかわらず\nを持つ、第三世界の国であることに変わりはありません。\n\nGoogle、Microsoft、IBM、Adobe、TwitterなどのCEOは皆、インド人です。\n\nインドがどこまでやれるか、考えてみてください...",
      "title": "インドのビットコインとデジタル資産に関する新しい税法は、政府が世界をリードする野心を持っていないことを示している。せっかくの頭脳集団なのに、政府の第三世界のメンタリティのせいで、いつまでたっても貧しい国なのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "众所周知，印度是世界上最大的民主国家。但那里的政府\n总是非常落后。这就是为什么尽管有所有的人力和脑力\n力，但它仍然是一个第三世界国家。\n\n谷歌、微软、IBM、Adobe、Twitter等公司的CEO都是印度人。\n\n想一想，印度可以在哪里...",
      "title": "印度关于比特币和数字资产的新税法表明政府没有成为世界领导者的雄心。尽管有这么多的脑力，但由于政府的第三世界心态，它总是会成为一个贫穷的国家。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "衆所周知，印度是世界上最大的民主國家。但那裏的政府\n總是非常落後。這就是爲什麼儘管有所有的人力和腦力\n力，但它仍然是一個第三世界國家。\n\n谷歌、微軟、IBM、Adobe、Twitter等公司的CEO都是印度人。\n\n想一想，印度可以在哪裏...",
      "title": "印度關於比特幣和數字資產的新稅法表明政府沒有成爲世界領導者的雄心。儘管有這麼多的腦力，但由於政府的第三世界心態，它總是會成爲一個貧窮的國家。"
    }
  ]
}