{
  "approved_at_utc": null,
  "subreddit": "investing",
  "selftext": "This post is a summary of comments on threads and blog posts comparing traditional IRAs to Roths. In particular, I wanted to offer some arguments against 5 major points that find their way into many of the comparison threads.\n\n**1st sentiment to dispute: low income earners who expect to make more later should do Roths, high income earners who expect to make less later should do traditional.**\n\nI have seen this point a few times:\n\n>If you’re in a high bracket and expect little or no income in retirement take traditional. Otherwise if you’re in a low bracket now and expect more income in retirement take Roth. Or just do both.\n\nThis is how I used to think and, on the surface, it is an accurate statement. I myself am currently in a high earning tax bracket, and have favored traditional IRAs historically assuming that I'll be making less in retirement. And that is true--I will have more available cash at the current time and will be paying a lower effective tax rate at the time of withdrawal.\n\nThere's one major problem: while it is true that for high income earners using a Roth you are paying a higher current tax rate, *you are paying a 0% tax rate on your gains.* This 0% tax on capital gains **usually** outweighs the taxes saved at time of deposit with a traditional IRA. What's even worse for traditional IRAs is that when withdrawn this money is taxed as ordinary income instead of as capital gains.\n\n\\-\n\n**2nd point to dispute: the investment accounts work out to be the same over time.**\n\nThis leads me to the next sleight-of-hand that a lot of traditional IRA advocates try to pull. Take a look at [this Excel sheet](https://docs.google.com/spreadsheets/d/1kZ7Qnwh1lsi87to4LpgBbVHDb3iJ7nH1-7pONCzU3yo/edit) that calculates gains for traditional vs Roth.\n\nNow it's tempting to look at these numbers and think \"Oh see, there you go. It doesn't matter, you end up with the same money either way.\" But look at the assumptions this sheet is making: Instead of having you max out your Roth, it assumes that the 5k you were going to put into your traditional IRA is reduced to 3.5k with your Roth. This is not what happens and is such a dramatic error that I think it's intentional -- who doesn't max out their Roth if they can? You're not depositing less, you're depositing the maximum and paying more in taxes (ie. losing available cash). Then, you make the same gains but with a Roth they're not taxed.\n\nUsing the scenario in the linked Excel chart we can more accurately reflect what happens for most people: you have $1250 of extra available cash each year with a traditional. 1250 x 12 = $15k over 12 years that you would have had at the cost of of $18.3k of additional taxes at retirement (with a Roth paying 37% taxes now vs with a traditional IRA paying 22% at retirement).\n\nIf you want to do the numbers again, here is another example taken from a comment comparing IRAs to Roths with the following math:\n\n>assuming 30% tax  \n>  \n>10,000 = 7,000 after tax going into roth = $122,145.82 after 30years @ 10%  \n>  \n>10,000 full going into trad/401k = $174,494 after 30years @ 10% = $122,145.82 after paying 30% tax.\n\nThis is disingenuous. Remember, a Roth is not \"tax free\" but *post-tax*. The numbers evolve differently if you are maxing your IRA out.\n\n* *Roth investment*: 15,900 = 10,000 after tax going into Roth at 37% tax rate = $175k after 30 years at 10% - $5,900 of less available cash at the time of deposit (with a higher tax rate and principal) + $54k gained (\"tax free\" or post-tax gains) at the time of withdrawal = **$49.7k overall gains.**\n* *Traditional investment*: 10,000 pre-tax going into traditional IRA with $5.9k more available cash at time of deposit, in exchange for 22% tax rate at retirement instead of 37% at time of deposit as would have occurred with a Roth = $175k after 30 years; 54k gained but taxed at 22% instead of 37% = **42k overall gains.** In most of the scenarios I calculated, Roths came out ahead in the long run.\n\nSo, taking into account the different expected tax rates, with a traditional IRA you are giving up 7k of long term gains for an additional 5.9k of available cash at the current time. What you do with this money determines its *opportunity cost*.\n\n[This](https://docs.google.com/spreadsheets/d/1VZ4wKbUXdc8VA0mG4ri2wP9VuZCwae7b9MvA4u2HT7w/copy) is a stronger retirement spreadsheet developed by u/jeff_varszegi from [this recent post](https://www.reddit.com/r/investing/comments/owf0zi/spreadsheet_roth_vs_traditional_401ks_and_iras/) if any of you are familiar. There are some aspects that caught my attention as needing refinement (discussed [here](https://www.reddit.com/r/investing/comments/owf0zi/spreadsheet_roth_vs_traditional_401ks_and_iras/hhdvbrq/?context=3)), but my understanding is very basic and I could be missing something.\n\n\\-\n\n**3rd point to dispute: An anti-Roth post at Go Curry Cracker**\n\nThere is a well known anti-Roth post at Go Curry Cracker entitled \"The Great Roth Controversy\" (I can't link the url as it is not allowed in the subreddit). The amount of mental gymnastics that the post undergoes to make its points is staggering:\n\n>Dollars saved in a Traditional 401k / IRA are pre-tax.  We pay no income tax on dollars going in, an immediate savings of up to 39.6%, the highest marginal rate.  The invested funds are allowed to grow **tax free**, so all interest, dividends, and capital gains are untaxed until withdrawn from the account.  Upon withdrawal, all funds are treated as ordinary income, similar to a paycheck.\n\nThis is very inaccurate wording. The invested funds in an IRA don't grow \"tax free\". As said by the author themselves in the first sentence, they grow **pre-tax**. The invested funds in a Roth also don't grow \"tax free\" but **post-tax**. This is the major benefit of a Roth over traditional.\n\nThen the post starts talking about theoretical scenarios where a family would be paying 40% taxes with a Roth but would be reduced to poverty level income in retirement -- the so called \"first and last dollar\" argument. This is incredibly misleading. Instead it should be a \"last and last dollar\" argument. What are you paying as far as a marginal tax rate on the Traditional vs the Roth -- ie. what would an individual have been making otherwise. You have to take into account other income streams to know your base income and effective/marginal tax rates.\n\nAnother point made in this blog is that the greater available cash with a traditional IRA can then be used to invest in an index fund anyways, functionally becoming a Roth at annual capital gains tax rates. First off, why wouldn't you want post-tax gains? The point they leave unspoken is you're paying a premium for more available cash at the current time with a traditional IRA. And that's assuming an individual invests this money -- the average person is actually just redistributing savings.\n\nFor high earners that will earn less at retirement, a Roth requires a higher initial investment, but with the benefit of greater long term cash gains. With a traditional IRA, on the other hand, you are functionally increasing *available cash* because you're paying the lower tax rate that will exist when you retire. This is at the expense of *post-tax gains*.\n\nFor low earners that expect to earn *more* at retirement than they are currently, a Roth will have a lower tax rate fixed at the time of deposit as well as the \"tax-free\" gains. This is a double-win scenario with a Roth. If they had invested in a traditional IRA, it would have been a double loss.\n\n\\-\n\n**4th point to dispute: It's pointless to try to predict the future.**\n\nAnother argument I've heard is that tax rates are difficult to predict in the future. While researching this idea I came across the following charts:\n\n[Chart 1](https://files.taxfoundation.org/20170804133536/Average-Effective-Tax-Rate-on-the-Top-1-Percent-of-U.S.-Households.png) [Chart 2](https://www.brookings.edu/wp-content/uploads/2012/04/34E92353DFE94E9DB4BB55C777DFD054-2.png)\n\nI can't verify their validity, but if these are accurate it appears fairly reasonable to guess that incremental tax brackets won't be changing dramatically in the next few decades. If I am understanding trends shown in the linked charts, if I'm in a higher income tax bracket at retirement, then I will be paying lower taxes than now and if I'm in a lower income tax bracket at retirement (which is more likely if I haven't developed passive income) I will be paying higher taxes than now.\n\nThe more important point, as shown in the math above, is that for the average person, *tax rates* matter less than *post-tax ('tax-free') gains.* That is to say: the amount you gain in a post-tax retirement account will usually be more than the amount you save by a lower effective tax rate in a pre-tax retirement account, even in a top tax bracket.\n\nOf course this is not a guarantee. Your Roths could be invested poorly, there could be a revolution and the entire tax structure we've had for the last century could be changed to a universal standard tax rate, you could win the lottery, etc. but at some point we have to accept that we're dealing with probabilities. If you haven't developed a cumulatively progressive source of passive income *and* you're not in a defined hierarchy (ie. a partnership track in a law firm or medical group, a path to senior management at a large corporation, etc) or you sell a product that can be leveraged to economies of scale (ie. a brand-name app), you will probably be in an eat-what-you-kill situation at retirement and so be making less in retirement than you are in middle age.\n\n\\-\n\n**5th point to dispute: That there are universal solutions. Remember:** ***one size fits all is a size that fits none.***\n\n**A comment I've come across is that having both a traditional IRA and a Roth is good because you're \"diversifying\".** The reasoning behind this is that a traditional IRA will be counted as part of taxable income in retirement and a Roth can be used for additional tax-free withdrawals that would put one out of their desired tax bracket.\n\nThis doesn't make sense as a general rule and must be calculated for your individual circumstances. By my own personal math, for example, it is a bad idea for me to do a traditional IRA because the lower tax rate at retirement would not compensate for the tax-free gains of a Roth. This is an example of where something that sounds like good advice (ie. \"It's always good to diversify.\") actually takes you down a less financially successful path.\n\nAnother point to keep in mind is that your year to year tax situation matters a great deal. Let's say you retire early, get laid off or have a year where you are transitioning jobs so your income is low. This is a great opportunity for a Roth IRA conversion ladder -- ie. moving your pre-tax (IRA/401k) money into to post tax (Roth) accounts. Use this year as an opportunity to pay the lower effective tax rate at deposit *and* get the benefits of post-tax gains. A double-whammy of tax gains.\n\nLooking at your specific life circumstances make it more likely that you will pick the retirement portfolio that applies to your particular path. Barring extreme examples, however, a Roth will be the better choice for most.",
  "author_fullname": "t2_aedxdzp7",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 1,
  "clicked": false,
  "title": "Lies My Accountant Told Me or: How I Learned to Stop Worrying and Love the Roth",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/investing",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_qcenkq",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.82,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 618,
  "total_awards_received": 3,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 618,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": 1634778390,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_2": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1634774634,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.investing",
  "allow_live_comments": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This post is a summary of comments on threads and blog posts comparing traditional IRAs to Roths. In particular, I wanted to offer some arguments against 5 major points that find their way into many of the comparison threads.</p>\n\n<p><strong>1st sentiment to dispute: low income earners who expect to make more later should do Roths, high income earners who expect to make less later should do traditional.</strong></p>\n\n<p>I have seen this point a few times:</p>\n\n<blockquote>\n<p>If you’re in a high bracket and expect little or no income in retirement take traditional. Otherwise if you’re in a low bracket now and expect more income in retirement take Roth. Or just do both.</p>\n</blockquote>\n\n<p>This is how I used to think and, on the surface, it is an accurate statement. I myself am currently in a high earning tax bracket, and have favored traditional IRAs historically assuming that I&#39;ll be making less in retirement. And that is true--I will have more available cash at the current time and will be paying a lower effective tax rate at the time of withdrawal.</p>\n\n<p>There&#39;s one major problem: while it is true that for high income earners using a Roth you are paying a higher current tax rate, <em>you are paying a 0% tax rate on your gains.</em> This 0% tax on capital gains <strong>usually</strong> outweighs the taxes saved at time of deposit with a traditional IRA. What&#39;s even worse for traditional IRAs is that when withdrawn this money is taxed as ordinary income instead of as capital gains.</p>\n\n<p>-</p>\n\n<p><strong>2nd point to dispute: the investment accounts work out to be the same over time.</strong></p>\n\n<p>This leads me to the next sleight-of-hand that a lot of traditional IRA advocates try to pull. Take a look at <a href=\"https://docs.google.com/spreadsheets/d/1kZ7Qnwh1lsi87to4LpgBbVHDb3iJ7nH1-7pONCzU3yo/edit\">this Excel sheet</a> that calculates gains for traditional vs Roth.</p>\n\n<p>Now it&#39;s tempting to look at these numbers and think &quot;Oh see, there you go. It doesn&#39;t matter, you end up with the same money either way.&quot; But look at the assumptions this sheet is making: Instead of having you max out your Roth, it assumes that the 5k you were going to put into your traditional IRA is reduced to 3.5k with your Roth. This is not what happens and is such a dramatic error that I think it&#39;s intentional -- who doesn&#39;t max out their Roth if they can? You&#39;re not depositing less, you&#39;re depositing the maximum and paying more in taxes (ie. losing available cash). Then, you make the same gains but with a Roth they&#39;re not taxed.</p>\n\n<p>Using the scenario in the linked Excel chart we can more accurately reflect what happens for most people: you have $1250 of extra available cash each year with a traditional. 1250 x 12 = $15k over 12 years that you would have had at the cost of of $18.3k of additional taxes at retirement (with a Roth paying 37% taxes now vs with a traditional IRA paying 22% at retirement).</p>\n\n<p>If you want to do the numbers again, here is another example taken from a comment comparing IRAs to Roths with the following math:</p>\n\n<blockquote>\n<p>assuming 30% tax  </p>\n\n<p>10,000 = 7,000 after tax going into roth = $122,145.82 after 30years @ 10%  </p>\n\n<p>10,000 full going into trad/401k = $174,494 after 30years @ 10% = $122,145.82 after paying 30% tax.</p>\n</blockquote>\n\n<p>This is disingenuous. Remember, a Roth is not &quot;tax free&quot; but <em>post-tax</em>. The numbers evolve differently if you are maxing your IRA out.</p>\n\n<ul>\n<li><em>Roth investment</em>: 15,900 = 10,000 after tax going into Roth at 37% tax rate = $175k after 30 years at 10% - $5,900 of less available cash at the time of deposit (with a higher tax rate and principal) + $54k gained (&quot;tax free&quot; or post-tax gains) at the time of withdrawal = <strong>$49.7k overall gains.</strong></li>\n<li><em>Traditional investment</em>: 10,000 pre-tax going into traditional IRA with $5.9k more available cash at time of deposit, in exchange for 22% tax rate at retirement instead of 37% at time of deposit as would have occurred with a Roth = $175k after 30 years; 54k gained but taxed at 22% instead of 37% = <strong>42k overall gains.</strong> In most of the scenarios I calculated, Roths came out ahead in the long run.</li>\n</ul>\n\n<p>So, taking into account the different expected tax rates, with a traditional IRA you are giving up 7k of long term gains for an additional 5.9k of available cash at the current time. What you do with this money determines its <em>opportunity cost</em>.</p>\n\n<p><a href=\"https://docs.google.com/spreadsheets/d/1VZ4wKbUXdc8VA0mG4ri2wP9VuZCwae7b9MvA4u2HT7w/copy\">This</a> is a stronger retirement spreadsheet developed by <a href=\"/u/jeff_varszegi\">u/jeff_varszegi</a> from <a href=\"https://www.reddit.com/r/investing/comments/owf0zi/spreadsheet_roth_vs_traditional_401ks_and_iras/\">this recent post</a> if any of you are familiar. There are some aspects that caught my attention as needing refinement (discussed <a href=\"https://www.reddit.com/r/investing/comments/owf0zi/spreadsheet_roth_vs_traditional_401ks_and_iras/hhdvbrq/?context=3\">here</a>), but my understanding is very basic and I could be missing something.</p>\n\n<p>-</p>\n\n<p><strong>3rd point to dispute: An anti-Roth post at Go Curry Cracker</strong></p>\n\n<p>There is a well known anti-Roth post at Go Curry Cracker entitled &quot;The Great Roth Controversy&quot; (I can&#39;t link the url as it is not allowed in the subreddit). The amount of mental gymnastics that the post undergoes to make its points is staggering:</p>\n\n<blockquote>\n<p>Dollars saved in a Traditional 401k / IRA are pre-tax.  We pay no income tax on dollars going in, an immediate savings of up to 39.6%, the highest marginal rate.  The invested funds are allowed to grow <strong>tax free</strong>, so all interest, dividends, and capital gains are untaxed until withdrawn from the account.  Upon withdrawal, all funds are treated as ordinary income, similar to a paycheck.</p>\n</blockquote>\n\n<p>This is very inaccurate wording. The invested funds in an IRA don&#39;t grow &quot;tax free&quot;. As said by the author themselves in the first sentence, they grow <strong>pre-tax</strong>. The invested funds in a Roth also don&#39;t grow &quot;tax free&quot; but <strong>post-tax</strong>. This is the major benefit of a Roth over traditional.</p>\n\n<p>Then the post starts talking about theoretical scenarios where a family would be paying 40% taxes with a Roth but would be reduced to poverty level income in retirement -- the so called &quot;first and last dollar&quot; argument. This is incredibly misleading. Instead it should be a &quot;last and last dollar&quot; argument. What are you paying as far as a marginal tax rate on the Traditional vs the Roth -- ie. what would an individual have been making otherwise. You have to take into account other income streams to know your base income and effective/marginal tax rates.</p>\n\n<p>Another point made in this blog is that the greater available cash with a traditional IRA can then be used to invest in an index fund anyways, functionally becoming a Roth at annual capital gains tax rates. First off, why wouldn&#39;t you want post-tax gains? The point they leave unspoken is you&#39;re paying a premium for more available cash at the current time with a traditional IRA. And that&#39;s assuming an individual invests this money -- the average person is actually just redistributing savings.</p>\n\n<p>For high earners that will earn less at retirement, a Roth requires a higher initial investment, but with the benefit of greater long term cash gains. With a traditional IRA, on the other hand, you are functionally increasing <em>available cash</em> because you&#39;re paying the lower tax rate that will exist when you retire. This is at the expense of <em>post-tax gains</em>.</p>\n\n<p>For low earners that expect to earn <em>more</em> at retirement than they are currently, a Roth will have a lower tax rate fixed at the time of deposit as well as the &quot;tax-free&quot; gains. This is a double-win scenario with a Roth. If they had invested in a traditional IRA, it would have been a double loss.</p>\n\n<p>-</p>\n\n<p><strong>4th point to dispute: It&#39;s pointless to try to predict the future.</strong></p>\n\n<p>Another argument I&#39;ve heard is that tax rates are difficult to predict in the future. While researching this idea I came across the following charts:</p>\n\n<p><a href=\"https://files.taxfoundation.org/20170804133536/Average-Effective-Tax-Rate-on-the-Top-1-Percent-of-U.S.-Households.png\">Chart 1</a> <a href=\"https://www.brookings.edu/wp-content/uploads/2012/04/34E92353DFE94E9DB4BB55C777DFD054-2.png\">Chart 2</a></p>\n\n<p>I can&#39;t verify their validity, but if these are accurate it appears fairly reasonable to guess that incremental tax brackets won&#39;t be changing dramatically in the next few decades. If I am understanding trends shown in the linked charts, if I&#39;m in a higher income tax bracket at retirement, then I will be paying lower taxes than now and if I&#39;m in a lower income tax bracket at retirement (which is more likely if I haven&#39;t developed passive income) I will be paying higher taxes than now.</p>\n\n<p>The more important point, as shown in the math above, is that for the average person, <em>tax rates</em> matter less than <em>post-tax (&#39;tax-free&#39;) gains.</em> That is to say: the amount you gain in a post-tax retirement account will usually be more than the amount you save by a lower effective tax rate in a pre-tax retirement account, even in a top tax bracket.</p>\n\n<p>Of course this is not a guarantee. Your Roths could be invested poorly, there could be a revolution and the entire tax structure we&#39;ve had for the last century could be changed to a universal standard tax rate, you could win the lottery, etc. but at some point we have to accept that we&#39;re dealing with probabilities. If you haven&#39;t developed a cumulatively progressive source of passive income <em>and</em> you&#39;re not in a defined hierarchy (ie. a partnership track in a law firm or medical group, a path to senior management at a large corporation, etc) or you sell a product that can be leveraged to economies of scale (ie. a brand-name app), you will probably be in an eat-what-you-kill situation at retirement and so be making less in retirement than you are in middle age.</p>\n\n<p>-</p>\n\n<p><strong>5th point to dispute: That there are universal solutions. Remember:</strong> <strong><em>one size fits all is a size that fits none.</em></strong></p>\n\n<p><strong>A comment I&#39;ve come across is that having both a traditional IRA and a Roth is good because you&#39;re &quot;diversifying&quot;.</strong> The reasoning behind this is that a traditional IRA will be counted as part of taxable income in retirement and a Roth can be used for additional tax-free withdrawals that would put one out of their desired tax bracket.</p>\n\n<p>This doesn&#39;t make sense as a general rule and must be calculated for your individual circumstances. By my own personal math, for example, it is a bad idea for me to do a traditional IRA because the lower tax rate at retirement would not compensate for the tax-free gains of a Roth. This is an example of where something that sounds like good advice (ie. &quot;It&#39;s always good to diversify.&quot;) actually takes you down a less financially successful path.</p>\n\n<p>Another point to keep in mind is that your year to year tax situation matters a great deal. Let&#39;s say you retire early, get laid off or have a year where you are transitioning jobs so your income is low. This is a great opportunity for a Roth IRA conversion ladder -- ie. moving your pre-tax (IRA/401k) money into to post tax (Roth) accounts. Use this year as an opportunity to pay the lower effective tax rate at deposit <em>and</em> get the benefits of post-tax gains. A double-whammy of tax gains.</p>\n\n<p>Looking at your specific life circumstances make it more likely that you will pick the retirement portfolio that applies to your particular path. Barring extreme examples, however, a Roth will be the better choice for most.</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qhhq",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "qcenkq",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "Vivid-Firefighter982",
  "discussion_type": null,
  "num_comments": 37,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/investing/comments/qcenkq/lies_my_accountant_told_me_or_how_i_learned_to/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/investing/comments/qcenkq/lies_my_accountant_told_me_or_how_i_learned_to/",
  "subreddit_subscribers": 1931321,
  "created_utc": 1634787631,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1634774634,
  "the_new_excerpt": "This post is a summary of comments on threads and blog posts comparing\ntraditional IRAs to Roths. In particular, I wanted to offer some arguments\nagainst 5 major points that find their way into many of the comparison threads.\n\n1st sentiment to dispute: low income earners who expect to make more…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この記事は、伝統的なIRAとロート製薬を比較したスレッドやブログ記事のコメントをまとめたものです。\n伝統的なIRAとRothを比較したスレッドやブログ記事のコメントをまとめたものです。特に、多くの比較スレッドに見られる5つの主要なポイントに対する議論を提供したいと思います。\n特に、多くの比較スレッドに見られる5つの主要なポイントに対する議論を提供したいと思います。\n\n1つ目の論点は、低所得者がより多くの収入を期待して...",
      "title": "会計士が私に言った嘘」または「会計士が私に言った嘘」。心配するのをやめて、ロスを愛するようになった方法"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这篇文章是对比较传统IRA和Roths的主题和博客文章的评论的总结。\n传统IRA与Roths的比较。特别是，我想提供一些论据\n反对5个主要观点，这些观点在许多比较主题中都能找到。\n\n第1个要争论的观点：期望赚取更多收入的低收入者...",
      "title": "我的会计师告诉我的谎言或。我如何学会停止忧虑并爱上罗斯"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這篇文章是對比較傳統IRA和Roths的主題和博客文章的評論的總結。\n傳統IRA與Roths的比較。特別是，我想提供一些論據\n反對5個主要觀點，這些觀點在許多比較主題中都能找到。\n\n第1個要爭論的觀點：期望賺取更多收入的低收入者...",
      "title": "我的會計師告訴我的謊言或。我如何學會停止憂慮並愛上羅斯"
    }
  ],
  "source_updated_at": 1634895637675
}