{
  "author": "negroleo02",
  "original_created_utc": 1637248830,
  "title": "Why do people get offended at the statistic “despite being 12% of the population, black peoples commit 56% of violent crimes?”",
  "created_utc": 1637257515,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I saw an ask reddit thread asking what’s a shocking statistic and this one kept getting removed. Id say it’s pretty shocking because it even though it’s 12% of the population it probably is more like 6% since men commit most violent crimes. That’s literally what the thread asked for: crazy statistics.</p>\n</div><!-- SC_ON -->",
  "score": 142,
  "permalink": "/r/TooAfraidToAsk/comments/qws08l/why_do_people_get_offended_at_the_statistic/",
  "subreddit": "TooAfraidToAsk",
  "id": "qws08l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I saw an ask reddit thread asking what’s a shocking statistic and this one kept\ngetting removed. Id say it’s pretty shocking because it even though it’s 12% of\nthe population it probably is more like 6% since men commit most violent crimes.\nThat’s literally what the thread asked for: crazy…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "redditの質問スレッドで「衝撃的な統計は何か」という質問を見たのですが、この質問はずっと続いていました。\n削除され続けています。これはかなりショッキングなことだと思います。\n暴力的な犯罪を犯すのはほとんどが男性なので、人口の12%といっても、おそらく6%に近いのではないでしょうか。\nこのスレッドで求められていたのは、文字通り「クレイジー...",
      "title": "人口の12％であるにもかかわらず、暴力犯罪の56％を黒人が犯している」という統計に、なぜ人は腹を立てるのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到reddit上有一个询问什么是令人震惊的统计数字的帖子，这个帖子一直被删除。\n被删除。我说这是非常令人震惊的，因为尽管它占人口的12%，但它可能更像是6%，因为大多数暴力犯罪都是由男性实施的。\n它可能更像是6%，因为大多数暴力犯罪都是男性犯下的。\n这正是该主题所要求的：疯狂...",
      "title": "为什么人们对 \"尽管黑人只占人口的12%，却犯下了56%的暴力犯罪 \"这一统计数字感到不快？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到reddit上有一個詢問什麼是令人震驚的統計數字的帖子，這個帖子一直被刪除。\n被刪除。我說這是非常令人震驚的，因爲儘管它占人口的12%，但它可能更像是6%，因爲大多數暴力犯罪都是由男性實施的。\n它可能更像是6%，因爲大多數暴力犯罪都是男性犯下的。\n這正是該主題所要求的：瘋狂...",
      "title": "爲什麼人們對 \"儘管黑人只佔人口的12%，卻犯下了56%的暴力犯罪 \"這一統計數字感到不快？"
    }
  ]
}