{
  "author": "Peakbrowndog",
  "original_created_utc": 1639415090,
  "title": "During the American and French Revolution, salons were gathering places for intellectual discussion. They were often run by women, such as Madame Roland who ran a salon for the Jacobins. How did women in France and the US use their influence and social skills to affect the Revolutions?",
  "created_utc": 1639454104,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Mike Duncan, in his &lt;em&gt;Revolutions&lt;/em&gt; podcast, talks about their importance in many episodes (notably, 3.22 about Madame Roland) and how the aristocratic women used salons to counter their limited rights to participate in government.  How did they use the salons to shape our democratic future?  How did they attract and invite the revolutionary elite? What are the lasting legacies that were created by these women?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/rfkgml/during_the_american_and_french_revolution_salons/",
  "subreddit": "AskHistorians",
  "id": "rfkgml",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Mike Duncan, in his Revolutions podcast, talks about their importance in many\nepisodes (notably, 3.22 about Madame Roland) and how the aristocratic women used\nsalons to counter their limited rights to participate in government. How did\nthey use the salons to shape our democratic future? How did…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "マイク・ダンカンは、彼のポッドキャスト「Revolutions」で、多くの場面でその重要性について\nエピソード（特に3.22のローランド夫人について）と、貴族の女性たちがどのように\nサロンでは、政府に参加する権利が制限されていることに対抗するためです。どのように\n彼らはサロンを使って、民主主義の未来を形作ったのでしょうか？どのように...",
      "title": "アメリカやフランスの革命期には、サロンは知的な議論を行う場でした。ジャコバン派のサロンを運営していたマダム・ローランのように、女性が運営することが多かったのです。フランスとアメリカの女性は、その影響力と社会的スキルを使って、革命にどのような影響を与えたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "迈克-邓肯（Mike Duncan）在他的《革命》播客中谈到了他们在许多情节中的重要性（尤其是第3.22节关于罗兰夫人的内容）。\n的重要性（特别是3.22节关于罗兰夫人的内容），以及贵族妇女如何利用沙龙来对抗她们参与政府的有限权利。\n沙龙来对抗她们在参与政府方面的有限权利。她们是如何\n她们如何利用沙龙来塑造我们的民主未来？如何...",
      "title": "在美国和法国大革命期间，沙龙是智力讨论的聚集地。它们通常由妇女经营，如罗兰夫人为雅各宾派经营的沙龙。法国和美国的妇女是如何利用她们的影响力和社会技能来影响革命的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "邁克-鄧肯（Mike Duncan）在他的《革命》播客中談到了他們在許多情節中的重要性（尤其是第3.22節關於羅蘭夫人的內容）。\n的重要性（特別是3.22節關於羅蘭夫人的內容），以及貴族婦女如何利用沙龍來對抗她們參與政府的有限權利。\n沙龍來對抗她們在參與政府方面的有限權利。她們是如何\n她們如何利用沙龍來塑造我們的民主未來？如何...",
      "title": "在美國和法國大革命期間，沙龍是智力討論的聚集地。它們通常由婦女經營，如羅蘭夫人爲雅各賓派經營的沙龍。法國和美國的婦女是如何利用她們的影響力和社會技能來影響革命的？"
    }
  ]
}