{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Thursday, April 29, 2021\n\nStocks hit fresh record highs as market participants considered a batch of\nstronger-than-expected corporate earnings reports and new proposals from\nPresident Biden aimed at revamping the US’ infrastructure and supporting\nfamilies, children, and…",
  "original_created_utc": 1619727086,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "PsychoMarket Recap - 2021年4月29日（木\n\n市場参加者は、予想を上回る高水準の企業業績報告や政府の新提案を考慮し、株価は過去最高を更新した。\n市場参加者は、予想以上に好調な企業の業績報告や、大統領の新たな提案を考慮し、株価は最高値を更新した。\n市場参加者は、予想を上回る好調な企業業績や、バイデン大統領が米国のインフラを刷新し、家族や子供たちを支援することを目的とした新提案を検討し、株価は最高値を更新しました。\n市場参加者は、好調な企業業績や、バイデン大統領が発表した米国のインフラ整備や家族、子供、そして...",
      "title": "本日2021年4月29日（木）のMarket Recapをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "PsychoMarket Recap - 2021年4月29日星期四\n\n股市创下新的纪录高点，因为市场参与者考虑了一批强于预期的企业盈利报告和来自政府的新建议。\n强于预期的企业盈利报告，以及美国总统奥巴马的新提议，股市创下新高。\n拜登总统提出的旨在改造美国的基础设施和支持家庭、儿童和青少年的新建议。\n改革美国的基础设施并支持家庭、儿童和...",
      "title": "以下是今天的市场回顾，2021年4月29日，星期四"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "PsychoMarket Recap - 2021年4月29日星期四\n\n股市創下新的紀錄高點，因爲市場參與者考慮了一批強於預期的企業盈利報告和來自政府的新建議。\n強於預期的企業盈利報告，以及美國總統奧巴馬的新提議，股市創下新高。\n拜登總統提出的旨在改造美國的基礎設施和支持家庭、兒童和青少年的新建議。\n改革美國的基礎設施並支持家庭、兒童和...",
      "title": "以下是今天的市場回顧，2021年4月29日，星期四"
    }
  ],
  "title": "Here is a Market Recap for today Thursday, April 29, 2021",
  "created_utc": 1619737037,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Thursday, April 29, 2021</strong></p>\n\n<p>Stocks hit fresh record highs as market participants considered a batch of stronger-than-expected corporate earnings reports and new proposals from President Biden aimed at revamping the US’ infrastructure and supporting families, children, and students. The S&amp;P 500 (SPY) hit a new intraday record, driven by gains in mega-cap stocks like Facebook (FB) and Apple (AAPL), both of which reported blowout earnings. </p>\n\n<p>Last night, President Biden addressed a joint session of Congress, during which he said “America was back on the move again” following the coronavirus pandemic that devastated the economy. In his address, President Biden touted his $2 trillion infrastructure plan and unveiled a new $1.8 trillion proposal aimed at supporting children, students, and families. This proposal, called the American Families Plan, would be funded in part with the newly proposed tax increases on the wealthy. <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2021/04/28/fact-sheet-the-american-families-plan/\">Read the details of the proposal here</a>.</p>\n\n<p>Earnings season continues to deliver blowout results, with Apple and Facebook massively outperforming analyst expectations. Facebook’s stock, in particular, gapped up more than 7%. The strong results from these companies adds to a parade of mega-cap companies that have vastly outperformed estimates, driven by a surge in demand as the US economy gradually reopens thanks to effective vaccine distribution. According to FactSet, as of early Wednesday, companies comprising nearly half of the S&amp;P 500&#39;s market capitalization had reported earnings results, with 83% of these corporations topping estimates, and by an average of 21.7%. </p>\n\n<p>Market participants also digested recent commentary from members of the Federal Open Market Committee (FOMC), which included no major changes to policy but did highlight recent improvements in the US economy. FOMC members said the effective distribution of the vaccine in the US has improved economic conditions but reiterated interest rates will remain near-zero and the current pace of the asset purchasing program in place. The Fed said, “Amid progress and strong policy support, indicators of economic activity and employment have risen.” The committee remains optimistic about the rebound in economic activity, describing the most affected sectors as “having shown improvement”, but shows no signs of slowing quantitative easing or raising interest rates. With more than 8 million people still out of jobs compared to pre-pandemic levels, FOMC reiterated its commitment to supporting the economy.</p>\n\n<p><strong>Highlights</strong> </p>\n\n<ul>\n<li>The Labor Department released its Weekly Unemployment Report, which shows fresh pandemic-era lows as the economy gradually reopens.\n\n<ul>\n<li><strong>Initial jobless claims, week ended April 24:</strong> 553,000 vs. 540,000 expected and an upwardly revised 566,000 during the prior week</li>\n<li><strong>Continuing claims, week ended April 17:</strong> 3.660 million vs. 3.590 million expected and a downwardly revised 3.651 million during the prior week</li>\n</ul></li>\n<li>Shares of Uber, Lyft and Doordash (DASH) fell sharply after Reuters reported that Labor Secretary Marty Walsh supported reclassifying gig workers as employees. This change would give workers additional benefits at a large cost to companies. Recall the battle last year over Proposition 22 in California, which eventually passed in favor of companies in the gig-economy. </li>\n<li>US gross domestic product (GDP) increased at a 6.4% quarter-over-quarter, seasonally adjusted annualized rate in the first three months of 2021, <a href=\"https://finance.yahoo.com/news/us-economy-accelerated-robust-6-123644612.html\">the Bureau of Economic Analysis said Thursday in its first estimate on GDP. </a>This marked an acceleration from the 4.3% annualized growth rate from the fourth quarter of 2020</li>\n<li>New York City <a href=\"https://twitter.com/Morning_Joe/status/1387733678093127684\">Mayor Bill de Blasio said </a>that NYC would open with full capacity beginning July 1. &quot;Our plan is to fully reopen on July 1. We are ready for stores to open, for businesses to open, offices, theaters, full strength,” de Blasio said. </li>\n<li>The U.S. Federal Aviation Administration (FAA) said Thursday it is auditing Boeing Co&#39;s process for making minor design changes across its product line after a 737 MAX manufacturing issue grounded dozens of planes.</li>\n<li>**<strong>Please note that current stock price is written premarket and does not reflect intraday changes*\\</strong>*</li>\n<li>Apple (AAPL) with a host of target raises following their blowout earnings report. Consensus price target $180 at Buy. Stock currently around $137</li>\n<li>Align Technology (ALGN) with two target raises. Stock currently around $615\n\n<ul>\n<li>Stifel Nicolaus from $650 to $750 at Buy</li>\n<li>Robert W Baird from $655 to $745 at Outperform</li>\n</ul></li>\n<li>DR Horton (DHI) target raised by BTIG Research from $108 to $124 at Buy. Stock currently around $100</li>\n<li>Brinker International (EAT) target raised by Telsey Advisory Group from $65 to $85 at Outperform. Stock currently around $68</li>\n<li>Facebook (FB) with a host of target raises following a blowout earnings report. Consensus price target $400 at Buy. Stock currently around $330</li>\n<li>Fortinet (FTNT) target raised by KeyCorp from $195 to $233 at Overweight. Stock currently around $198</li>\n<li>Alphabet (GOOG $GOOGL) target raised by BMO Capital Markets from $2350 to $2600 at Outperform. Stock currently around $2359</li>\n<li>Olin (OLN) with two target raises. Stock currently around $42\n\n<ul>\n<li>KeyCorp from $50 to $53 Overweight</li>\n<li>Royal Bank of Canada from $56 to $63 Outperform</li>\n</ul></li>\n<li>OshKosh (OSK) with a host of target raises. Consensus price target $145 at Overweight. Stockcurrently around $128</li>\n<li>Palo Alto Networks (PANW) target raised by KeyCorp from $450 to $469 at Overweight. Stock currently around $360</li>\n<li>Qualcomm (QCOM) with three target raises. Stock currently around $137\n\n<ul>\n<li>Morgan Stanely from $167 to $173</li>\n<li>Piper Sandler from $160 to $175</li>\n<li>Mizuho from $170 to $175</li>\n</ul></li>\n<li>Snapchat (SNAP) target raised by Morgan Stanley from $74 to $75. Stock currently around $62</li>\n<li>Ultra Clean (UCTT) target raised by Stifel Nicolaus from $65 to $71 at Buy after reporting great earnings. Stock currently around $55</li>\n</ul>\n\n<p>“Patience is bitter, but its fruit is sweet.” Aristotle</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/stocks/comments/n1d2c6/here_is_a_market_recap_for_today_thursday_april/",
  "subreddit": "stocks",
  "id": "n1d2c6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380966998
}