{
  "author": "hashzzz",
  "original_created_utc": 1651490193,
  "title": "Kraken &gt; Crypto.com",
  "created_utc": 1651506577,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Reject Crypto.com, Return to Kraken&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s the most secure and has the best support. Although the interface isn&amp;#39;t the best for new users it is quite manageable and reliable. &lt;/p&gt;\n\n&lt;p&gt;Kraken has proof of reserves and the have shown they hold users coins 1:1. Kraken is so honest that there CEO himself has encouraged users to withdraw to a non custodial wallet rather than keeping there coins on an exchange.&lt;/p&gt;\n\n&lt;p&gt;Their pair offerings are decent, they offer many obsecure and low cap coins but it surely needs some more progress.&lt;/p&gt;\n\n&lt;p&gt;Their support is beyond fantastic, easily best crypto exchange support in the whole word. They are very proffesional and respond to all support questions and help so much, they also have accounts in all major social media platforms like Reddit, Twitter and Discord.&lt;/p&gt;\n\n&lt;p&gt;Shout out to &lt;a href=\"/u/kraken-kiki\"&gt;u/kraken-kiki&lt;/a&gt; for being best support agent.&lt;/p&gt;\n\n&lt;p&gt;I know many of CDC users have left because of the card reward slashing and kraken does not have a card.&lt;/p&gt;\n\n&lt;p&gt;Thank you for reading my shilling of the best and most underrated exchange of all times.&lt;/p&gt;\n\n&lt;p&gt;Have a nice day!&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"/u/kraken-kiki\"&gt;u/kraken-kiki&lt;/a&gt; I am expecting a reward of 1 BTC for this shill post 😏 (&lt;strong&gt;I am joking&lt;/strong&gt;)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 376,
  "permalink": "/r/CryptoCurrency/comments/ugnbjw/kraken_cryptocom/",
  "subreddit": "CryptoCurrency",
  "id": "ugnbjw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Reject Crypto.com, Return to Kraken\n\nIt's the most secure and has the best support. Although the interface isn't the\nbest for new users it is quite manageable and reliable.\n\nKraken has proof of reserves and the have shown they hold users coins 1:1.\nKraken is so honest that there CEO himself has…"
}