{
  "author": "ASK_ME_FOR_TRIVIA",
  "original_created_utc": 1650244410,
  "title": "My girlfriend and I get into the stupidest fucking arguments - If you immobilize a snake's rattler in resin, would it still rattle when you shake it?",
  "created_utc": 1650264319,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I say the rattle comes from the plates clicking together when it wiggles. She says the rattle happens &amp;quot;internally,&amp;quot; so it would still make noise without actually bending.&lt;/p&gt;\n\n&lt;p&gt;Someone please settle this dumb argument so we can get back to fighting over whether or not manatees can swim out to sea.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/NoStupidQuestions/comments/u614v6/my_girlfriend_and_i_get_into_the_stupidest/",
  "subreddit": "NoStupidQuestions",
  "id": "u614v6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I say the rattle comes from the plates clicking together when it wiggles. She\nsays the rattle happens \"internally,\" so it would still make noise without\nactually bending.\n\nSomeone please settle this dumb argument so we can get back to fighting over\nwhether or not manatees can swim out to sea.",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ガラガラというのは、くねくねと動くときに皿がカチカチと音を立てるからだと言っているんです。彼女は\nガタツキは「内部で」起きているとのことなので、音は出ないのでしょう。\n実際に曲がっている。\n\n誰かこの馬鹿げた論争に決着をつけてくれ、そうすれば私たちは次のような論争に戻ることができる。\nマナティが海を泳げるかどうか。",
      "title": "ヘビのガラガラヘビを樹脂で固定したら、振ってもガラガラ鳴るのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我说响声来自于它摇动时板块的碰撞。她说\n她说异响发生在 \"内部\"，所以它在没有实际弯曲的情况下仍然会发出声音。\n实际上是弯曲的。\n\n谁来解决这个愚蠢的争论，这样我们就可以回去争论\n海牛是否能游到海里去。",
      "title": "我的女朋友和我陷入了最愚蠢的争论--如果你用树脂固定蛇的响尾蛇，当你摇晃它时，它还会响吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我說響聲來自於它搖動時板塊的碰撞。她說\n她說異響發生在 \"內部\"，所以它在沒有實際彎曲的情況下仍然會發出聲音。\n實際上是彎曲的。\n\n誰來解決這個愚蠢的爭論，這樣我們就可以回去爭論\n海牛是否能游到海里去。",
      "title": "我的女朋友和我陷入了最愚蠢的爭論--如果你用樹脂固定蛇的響尾蛇，當你搖晃它時，它還會響嗎？"
    }
  ]
}