{
  "author": "TayahuaJ",
  "the_new_excerpt": "Over the last couple of weeks, there have been dozens of posts deliberating\nwhether or not to sell growth/tech stocks that have been dropping recently and\nswitch over to \"re-opening\" or value plays. The key take away here has to be\nthis:\n\nIf a 10% drop in a stock makes you wonder whether or not you…",
  "original_created_utc": 1614874457,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的几周里，有几十篇文章在讨论：\n是否要卖出最近一直在下跌的成长/科技股和\n转向 \"重开 \"或价值游戏。这里的关键启示必须是\n这个。\n\n如果一只股票下跌10%让你怀疑自己是否... ...",
      "title": "巴菲特的股票策略现在比以往任何时候都更有意义。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的幾周裏，有幾十篇文章在討論：\n是否要賣出最近一直在下跌的成長/科技股和\n轉向 \"重開 \"或價值遊戲。這裏的關鍵啓示必須是\n這個。\n\n如果一隻股票下跌10%讓你懷疑自己是否... ...",
      "title": "巴菲特的股票策略現在比以往任何時候都更有意義。"
    }
  ],
  "title": "Warren Buffet's stock strategy is more relevant now than ever.",
  "created_utc": 1614878112,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Over the last couple of weeks, there have been dozens of posts deliberating whether or not to sell growth/tech stocks that have been dropping recently and switch over to &quot;re-opening&quot; or value plays. The key take away here has to be this:</p>\n\n<p>If a 10% drop in a stock makes you wonder whether or not you should sell that stock, you should have never bought that stock in the first place.</p>\n\n<p>Contrary to popular belief, stocks do not always go up. In fact, most stocks fail to beat the market in the long-term, with few exceptions. Buffet makes this clear. A good stock is not considered good just because it may do well in the next year, or because it has shown growth in the past. It is only a good buy if it has value beyond a short-term horizon, and most importantly, IF YOU BUY AT THE RIGHT PRICE. If you had bought GE at its peak, a company that is invested in all aspects of life and won&#39;t ever disappear, you would be down nearly 75%. Why is this? Is GE a bad company, with bad products, or a shrinking customer base? No, you would have just bought in at a price that was unjustifiable. </p>\n\n<p>Think of this scenario, you are the owner of a snack shop. Summer is coming up, so you decide to invest in significant inventory of ice cream. After all, people will purchase frozen desserts in the hot summer days, right? This can&#39;t possibly bad investment. So you go to your supplier, and he offers you a price of $100 per pint of ice-cream. What would you do? Would you buy just because ice-cream is guaranteed to sell in the future? No, not unless customers were willing to pay more than $100 per pint.</p>\n\n<p>Conversely, your next-door competitor decides to invest in inventory of hot chocolate. This is ridiculous to you, who would buy hot chocolate in the summer? However, your neighbor buys in at $0.10 per cup of hot chocolate for his supply. Once summer is over, you sell out of your inventory, but at a loss because no one is willing to buy ice cream at more than $10 a pint. Then winter comes, and guess who profits more?</p>\n\n<p>The point here is that being right about a trend is not enough if the price you buy in at is not the right one. If your belief in a stock is rattled because it drops a little bit, you did not believe in the price in the first place. If this scares you enough, you are better off sticking to index funds and filtering out the noise. There is nothing wrong with that, picking stocks is hard, and there is no guarantee that you will come out on top. </p>\n\n<p>My two cents is this: lumping tech into one single asset class is absurd, and calling companies like Amazon and Microsoft &quot;growth&quot; stocks is disingenuous if you lump in Palantir and Tesla in that same category. The market right now is doing just that, however, in the sense that high-PE growth stocks like Tesla are dropping alongside with Apple. In my opinion, all this is doing in the long-run is that you are buying tried-and-true blue chips at a discount. </p>\n\n<p>Kohl&#39;s is not going to be larger in 10 years than it is now, and its price now does not make it a good buy.  Conversely, just because Tesla will be huge in the future does not mean that buying it at a PE of 1000+ is a wise investment. Re-opening plays are just market chatter. Cruise lines have tremendous debt, banks are tied to risky-credit loans and government regulation, and oil companies are at the mercy of an overseas oil cartel. Just because they are outperforming now, does not mean they will be a good buy if the current price does not reflect their value in the long-term.</p>\n\n<p>Buy into valuable companies (future growth, good price) at a discount, ignore short-term market sentiment, and invest in index funds if you do not feel strong enough convictions in your stock picks.</p>\n</div><!-- SC_ON -->",
  "score": 2800,
  "permalink": "/r/stocks/comments/lxo7om/warren_buffets_stock_strategy_is_more_relevant/",
  "subreddit": "stocks",
  "id": "lxo7om",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542575856
}