{
  "author": "Troct",
  "original_created_utc": 1628515512,
  "title": "Don't Fomo your life savings just because the markets are green!",
  "created_utc": 1628541548,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just another friendly reminder that the euphoria is starting to really kick in on this sub.  Many new people are going to buy into the hype and spend a lot of money they don&#39;t have on currency they don&#39;t really understand. With crypto in the news recently as well, it is a ripe time for scammers to swoop in like vultures. So once again, this is just a friendly reminder. Don&#39;t invest more than you can afford to lose in the markets. Don&#39;t trust any random messages you get on Reddit or other crypto chat forums. If it sounds too good to be true, then it probably is. Anyways, hope you guys all get rich!</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/p11ejb/dont_fomo_your_life_savings_just_because_the/",
  "subreddit": "CryptoCurrency",
  "id": "p11ejb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Just another friendly reminder that the euphoria is starting to really kick in\non this sub. Many new people are going to buy into the hype and spend a lot of\nmoney they don't have on currency they don't really understand. With crypto in\nthe news recently as well, it is a ripe time for scammers to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブ機の幸福感が本当に始まっていることを、もう一度親切に教えてください。\nこのサブ機で 多くの新規参入者は、この宣伝文句に騙されて多額のお金を使ってしまうでしょう。\nよくわからない通貨に大金を使うことになるでしょう。最近では、暗号についても\n詐欺師にとっては絶好の機会だと思います。",
      "title": "マーケットがグリーンだからといって、あなたの人生の貯蓄をフォモしないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "只是再一次友好地提醒大家，欣喜若狂的情绪已经开始真正启动了\n在这个潜艇上。许多新的人将会相信这种炒作，并花费大量的\n他们没有的钱花在他们并不真正了解的货币上。随着加密货币在\n最近的新闻也是如此，对于骗子来说，这是一个成熟的时机。",
      "title": "不要因为市场是绿色的，就Fomo你一生的积蓄!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "只是再一次友好地提醒大家，欣喜若狂的情緒已經開始真正啓動了\n在這個潛艇上。許多新的人將會相信這種炒作，並花費大量的\n他們沒有的錢花在他們並不真正瞭解的貨幣上。隨着加密貨幣在\n最近的新聞也是如此，對於騙子來說，這是一個成熟的時機。",
      "title": "不要因爲市場是綠色的，就Fomo你一生的積蓄!"
    }
  ]
}