{
  "author": "ToadvineAndTheKid",
  "original_created_utc": 1641919020,
  "title": "Does Ötzi the Iceman prove that acupuncture predates China and Chinese medicine?",
  "created_utc": 1641943341,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I won&amp;#39;t go into the entirety of my research into the topic, because it&amp;#39;s a lot. But I did my internship studying this question and would like to know what you guys think. &lt;/p&gt;\n\n&lt;p&gt;In short, the placement of Otzi&amp;#39;s tattoos are within millimeters (most likely due to skin drift) of Chinese acupuncture points. Over 70% of his tattoos follow classical Chinese acupuncture points. These points have been used to treat rheumatism, which Ötzi suffered through during his life time, as well as gastro-intestinal problems.). If you look at them, they also resemble what we see in therapeutic tattooing. &lt;/p&gt;\n\n&lt;p&gt;The craziest thing to me though, is that Otzi lived 5200 years ago, and the first mention of acupuncture in China was the Yellow Emperor&amp;#39;s Classic of Internal Medicine, in 2600 BC (More likely 300-100BC). However, even at the earliest, Otzi lived between 3350 and 3105 BC, placing his therapeutic tattooing long before China&amp;#39;s own acupuncture.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve seen mention of therapeutic tattooing being done as far back as 6000BC, but I&amp;#39;m not certain on that. So the question is, where did acupuncture really begin? Who discovered those acupuncture points? &lt;/p&gt;\n\n&lt;p&gt;Any experts on this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/s1h440/does_ötzi_the_iceman_prove_that_acupuncture/",
  "subreddit": "AskHistorians",
  "id": "s1h440",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I won't go into the entirety of my research into the topic, because it's a lot.\nBut I did my internship studying this question and would like to know what you\nguys think.\n\nIn short, the placement of Otzi's tattoos are within millimeters (most likely\ndue to skin drift) of Chinese acupuncture points.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私がこのテーマについて調べたことは、たくさんあるので、全部は書きません。\nしかし、私はこの問題を研究するインターンシップを行いました。\nの皆さんはどう思いますか？\n\n要するに、オッツィのタトゥーの配置は、数ミリ単位で（最も可能性が高いのは\n中国のツボに、皮膚ドリフトで......。",
      "title": "鍼灸が中国や漢方より古くからあったことは、氷山のÖtziが証明しているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不会去讨论我对这个问题的全部研究，因为它是很多的。\n但我在实习中研究了这个问题，想知道你们\n你们的想法。\n\n简而言之，奥茨的纹身位置与中国的纹身位置相差无几（很可能是由于皮肤漂移）。\n由于皮肤漂移的原因）在中国的针灸点....。",
      "title": "冰人Ötzi是否证明针灸比中国和中医更早？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不會去討論我對這個問題的全部研究，因爲它是很多的。\n但我在實習中研究了這個問題，想知道你們\n你們的想法。\n\n簡而言之，奧茨的紋身位置與中國的紋身位置相差無幾（很可能是由於皮膚漂移）。\n由於皮膚漂移的原因）在中國的鍼灸點....。",
      "title": "冰人Ötzi是否證明鍼灸比中國和中醫更早？"
    }
  ]
}