{
  "author": "merryfrickinday2u",
  "original_created_utc": 1633950876,
  "title": "Did I get raped?",
  "created_utc": 1633956692,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So this is really difficult for me to even open up about, and write... but here goes. Btw, sorry it&#39;s very long but I appreciate all advice. </p>\n\n<p>A little background on me: I was sexually abused when I was younger and my first sexual encounter when I was 16 was an assault. </p>\n\n<p>A year ago, right before my birthday, a male friend who I had met online wanted to come over (a friend of a friend. I had been talking to him for a year on and off.) He brought some stuff (coke) and I thought it would be fun. Initially he did bring up sex but I told him I didn&#39;t want to bc I was on my period (I had just ended my period but lied to get out of it). He was cool with it. My memory is a bit foggy about this bc I had taken a few xanax that night, but he came by and we chilled. Then it went downhill..</p>\n\n<p>He stared pressuring me to have sex. I didn&#39;t want to. I even made sure I wouldn&#39;t be tempted by wearing a pad and granny panties. I told him again that I was on my period. He didn&#39;t care and kept bringing it up in different suggestive ways. Then he started touching me. At first, I just thought he was a little pushy and annoying. I laughed and kinda pushed him off. This continued for awhile. Me gently pushing his hands away as he continued to try and talk me into sex. I wasn&#39;t budging. He got more pushy and I started getting aggravated. I was still being nice and saying no though. </p>\n\n<p>Then, he started almost begging me for oral sex. This lasted for awhile. I told him I didn&#39;t want to but then he would return to groping me. Finally, I said I would. I didn&#39;t want to do it, but I felt like if I did this it would be better anyways bc he would stop touching. I would be more in control of the situation too. Looking back though, I was pretty heavily under the influence so I believe my rationale was horrible at that time. </p>\n\n<p>After it was over, he wanted more and kept touching me but it became more aggressive. He was trying to pull down my v-neck shirt and push his hands in my pants but I was pushing him away. He said &quot;stop&quot; and &quot;you know you like it.&quot; But I didn&#39;t. I pushed him off and went to the kitchen to put some cocoa in the microwave. However, when I turned around he was right behind me. And from here it just got worse.</p>\n\n<p>He started doing the same things again. He then got more aggressive with it and I got pissed so I started fighting him. And I wasn&#39;t being nice anymore. I remember firmly saying stop and really hitting him and pushing him off at this moment bc it had gone too far. We were literally fighting/hitting. I could tell he was mad. Bc he pushed me against the counter until I was practically leaning back and shoved/slammed my head into the cabinets. He said to stop fighting him. I can still remember the sudden shock and sound of my head hitting the cabinets and feeling helpless. </p>\n\n<p>I started panicking. I wanted to cry. Right then I felt like it hit me what he did and I can still remember thinking &quot;I&#39;m really getting raped.&quot; And my head was sorta sideways looking the other way bc his hand was pressing it into the cabinets still while he continued to do stuff.  I stopped fighting. I may have tried to resist some but I gave up. Idk why. I just thought it was better to not make it hard. I don&#39;t remember anything after this. The next thing I do recall is getting on the floor somehow and my bottoms are off. Idk how that happened. I also remember covering myself bc I didn&#39;t want him to enter and he kept trying to go down on me. The more I was trying to cover or move he would also move in an attempt to get me to move my hands long enough where he could get access. I think I remember being sad and having this weird flashback to another time I felt that way. I felt as if I was not even there. I don&#39;t remember anything after this though.</p>\n\n<p>This is where it gets confusing for me. Somewhere in between blacking out I am now completely composed and acting totally fine with things. I&#39;m laughing. Saying its cool. Telling him how good it was. I keep talking and I must sound strange bc he gives me this funny look while he&#39;s standing in the bathroom. I tell him he&#39;s good and hes not responding. I can&#39;t stop talking and complimenting him. I can&#39;t explain it, but it feels like I have to keep talking and I can&#39;t deal with the silence. He keeps looking at me funny (like he&#39;s bored) and doesn&#39;t seem to believe me bc I laughed and said we should do it again. And so he comes over and I remember thinking I shouldn&#39;t have said that and that I didn&#39;t mean what I said. But I also have this overwhelming thought telling me that it needed to happen again in order for me to not be upset. </p>\n\n<p>So he again looked at me strangely, and then got on top while I was still incessantly talking. And he still wouldn&#39;t say anything. I told him what I like or want and also what I don&#39;t like, but he didn&#39;t respond. When he did, it was dismissive. Then he starts doing the opposite of what I want and I get upset. I felt worthless. He told me to open my mouth. I didn&#39;t want to. He gets this aggressive/dominant look again and i remember thinking his eyes looked so uncaring. He seemed to want to test me or push my buttons. He was amused by this and starting to enjoy it again. I did, reluctantly, and he spit. I tried to turn my face away but I was so upset by this and trying not to cry. I felt even more worthless and disgusting. I had already told him I didn&#39;t like that. He seemed more turned on now and we had sex I&#39;m assuming. I don&#39;t remember much after that -- only that he was on top.</p>\n\n<p>He said he was sorry and I asked why. He told me for being so rough earlier. I laughed and said it was totally fine and I liked it. Over the next few days I had a nervous breakdown. Idk why but he ends up texting me every day for the next few days asking if I&#39;m ok.</p>\n\n<p>Idk what to think...or why I let him have sex with me. I feel guilty. I also feel worthless and angry. I felt like he raped me, but then I also don&#39;t think he did bc I invited it and let him do that to me. Please tell me what&#39;s wrong with me and if this is rape. I&#39;m so fucked up over this.</p>\n</div><!-- SC_ON -->",
  "score": 330,
  "permalink": "/r/TooAfraidToAsk/comments/q5tleh/did_i_get_raped/",
  "subreddit": "TooAfraidToAsk",
  "id": "q5tleh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So this is really difficult for me to even open up about, and write... but here\ngoes. Btw, sorry it's very long but I appreciate all advice.\n\nA little background on me: I was sexually abused when I was younger and my first\nsexual encounter when I was 16 was an assault.\n\nA year ago, right before my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このことは、私にとって、心を開いて書くことがとても難しいことです。\nをご覧ください。とても長くなってしまいましたが、すべてのアドバイスに感謝しています。\n\n私の背景を少し説明します。私は若い頃、性的虐待を受けていました。\n16歳の時の最初の性的接触は暴行でした。\n\n1年前、私の直前に...",
      "title": "私はレイプされたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以这对我来说真的很难开口，也很难写......但这里\n吧。对不起，这篇文章非常长，但我感谢所有的建议。\n\n关于我的一点背景。我在年轻的时候受到过性虐待，我的第一次\n我16岁时的第一次性接触是一次攻击。\n\n一年前，就在我...",
      "title": "我被强奸了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以這對我來說真的很難開口，也很難寫......但這裏\n吧。對不起，這篇文章非常長，但我感謝所有的建議。\n\n關於我的一點背景。我在年輕的時候受到過性虐待，我的第一次\n我16歲時的第一次性接觸是一次攻擊。\n\n一年前，就在我...",
      "title": "我被強姦了嗎？"
    }
  ]
}