{
  "author": "partymsl",
  "original_created_utc": 1647186295,
  "title": "Two years ago BTC fell to 3.8k and was called \"death\". Today we are about 10x higher and still being called \"death\".",
  "created_utc": 1647197222,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Two years ago from today on March 13th the big Covid-19 black swan happened. Stock market and Crypto saw massive sharp unexpected dips. All that happened for Crypto during a bear market period after the 2018 parabolic top. That was the time where BTC and Crypto were called &amp;quot;officially death&amp;quot; even by its own investors as this was very unexpected and many did not have any hope for a return.&lt;/p&gt;\n\n&lt;p&gt;Here we are two years in the future. BTC recovered from a -80% down from its ATH and even after then made another +200%. All that from - 80% to +200% happened in about one year. And today just a year later those FOMO levels are the new Fear levels.&lt;/p&gt;\n\n&lt;p&gt;That up and downs are completely normal for Crypto. The ones who don&amp;#39;t give up and stick to their strategy are those that will be rewarded. Even in the darkest of times we should know that everything is just transitory.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 595,
  "permalink": "/r/CryptoCurrency/comments/td9kyq/two_years_ago_btc_fell_to_38k_and_was_called/",
  "subreddit": "CryptoCurrency",
  "id": "td9kyq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Two years ago from today on March 13th the big Covid-19 black swan happened.\nStock market and Crypto saw massive sharp unexpected dips. All that happened for\nCrypto during a bear market period after the 2018 parabolic top. That was the\ntime where BTC and Crypto were called \"officially death\" even…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2年前の今日、3月13日に大きなブラックスワンが発生しました。\n株式市場と暗号は予想外の大規模な急落を見ました。全ては\n2018年のパラボリックトップ後の弱気相場期のCrypto。それは\nBTCやCryptoが「公式に死ね」とまで言われた時代...。",
      "title": "2年前、BTCは3.8kまで下落し、「死」と呼ばれた。今日は約10倍の高値で、まだ「死」と呼ばれています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "两年前的今天，也就是3月13日，大的Covid-19黑天鹅发生了。\n股市和加密货币出现了大规模的意外急剧下跌。所有这些都发生在\n在2018年抛物线顶部之后的熊市期间，加密货币。那是\nBTC和Crypto被称为 \"正式死亡 \"的时候，甚至...",
      "title": "两年前，BTC跌至3.8K，被称为 \"死亡\"。今天，我们的价格高了约10倍，但仍被称为 \"死亡\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "兩年前的今天，也就是3月13日，大的Covid-19黑天鵝發生了。\n股市和加密貨幣出現了大規模的意外急劇下跌。所有這些都發生在\n在2018年拋物線頂部之後的熊市期間，加密貨幣。那是\nBTC和Crypto被稱爲 \"正式死亡 \"的時候，甚至...",
      "title": "兩年前，BTC跌至3.8K，被稱爲 \"死亡\"。今天，我們的價格高了約10倍，但仍被稱爲 \"死亡\"。"
    }
  ]
}