{
  "author": "AbbysMusclesOfSteel",
  "original_created_utc": 1629890958,
  "title": "Am I controlling for wanting my girlfriend to quit smoking?",
  "created_utc": 1629901020,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For context, we’re in our mid 20s and have been together for almost 9 years. She used to smoke but gave it up about 6 years ago. Recently she made new friends (all smokers) and started a new stressful job. I found out she’s been secretly smoking because I found her cigarettes by chance. I felt like she went behind my back and it was very hurtful to be lied to. </p>\n\n<p>I initially reacted very badly, got super mad, started crying, trying to talk her out of it, quit before she’s fully addicted again, but it didn’t go well. We had another, more calm and reasonable talk a few days later, but her opinion is that it’s her body her choice and I’m trying to control her life. I see where she’s coming from, but at the same time I feel like it’s a BS excuse. She suffers from asthma and already struggles with her lungs without smoking. We’re planning to get married and I can’t stand the thought losing her early in life because of such a stupid addiction.</p>\n\n<p>I understand that she wants to make her own choices, but is it really fair of her to say it’s controlling behavior when all I want is for her to take her health and our future seriously?</p>\n\n<p>I don’t know what to do, I’ve been feeling helpless, scared and sad for days. Help!!</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/pb9b6k/am_i_controlling_for_wanting_my_girlfriend_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "pb9b6k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For context, we’re in our mid 20s and have been together for almost 9 years. She\nused to smoke but gave it up about 6 years ago. Recently she made new friends\n(all smokers) and started a new stressful job. I found out she’s been secretly\nsmoking because I found her cigarettes by chance. I felt like…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "参考までに、私たちは20代半ばで、約9年間付き合っています。彼女は\n以前はタバコを吸っていましたが、6年ほど前にやめました。最近、彼女に新しい友人ができました。\n(最近、彼女は新しい友人（全員喫煙者）を作り、ストレスの多い新しい仕事を始めました。彼女が密かにタバコを吸っていたことを知ったのは\nたまたま見つけたので、こっそり吸っていたことがわかりました。私は、このような気持ちになりました...。",
      "title": "恋人に禁煙してほしいと願う私は、コントロールされているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就背景而言，我们都是20多岁，在一起已经有将近9年了。她\n她曾经吸烟，但大约6年前戒掉了。最近她交了新朋友\n(都是吸烟者），并开始了一份新的有压力的工作。我发现她一直在偷偷地抽烟\n因为我偶然发现了她的香烟。我觉得...",
      "title": "我想让我的女朋友戒烟是控制欲强吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就背景而言，我們都是20多歲，在一起已經有將近9年了。她\n她曾經吸菸，但大約6年前戒掉了。最近她交了新朋友\n(都是吸菸者），並開始了一份新的有壓力的工作。我發現她一直在偷偷地抽菸\n因爲我偶然發現了她的香菸。我覺得...",
      "title": "我想讓我的女朋友戒菸是控制慾強嗎？"
    }
  ]
}