{
  "author": "creepy_robot",
  "original_created_utc": 1635360003,
  "title": "Go back up your wallets right now. Don't make the same mistake i did",
  "created_utc": 1635374176,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>GO BACK YOUR WALLETS UP RIGHT NOW, LIKE RIGHT NOW.</p>\n\n<p>I fucked up, bad. I thought I was much better at keeping track of and safe my wallets but it turns out i&#39;m actually terrible at it. </p>\n\n<p>I was on cloud 9 with my nice, growing bag of ONE. I was staking it in Guarda and discovered a hidden bag I&#39;d purchased way back in June at around 8 cents. Randomly, i checked my Guarda wallet and it had signed me out. No problem, I&#39;ll sign back in...wrong password? wtf. No problem, I have a backup. Also wrong password. How? No idea, considering I&#39;d been using the same password all day.</p>\n\n<p>I reached out to Guarda support. They do not curate an account, they just basically hold your wallets. This means that you have to save your wallet string manually. Now, my funds (8279 ONE) are lost and I have to start all over again. </p>\n\n<p>I failed so y&#39;all can laugh and back your seed phrases and wallets up.</p>\n</div><!-- SC_ON -->",
  "score": 174,
  "permalink": "/r/CryptoCurrency/comments/qh3fyi/go_back_up_your_wallets_right_now_dont_make_the/",
  "subreddit": "CryptoCurrency",
  "id": "qh3fyi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "GO BACK YOUR WALLETS UP RIGHT NOW, LIKE RIGHT NOW.\n\nI fucked up, bad. I thought I was much better at keeping track of and safe my\nwallets but it turns out i'm actually terrible at it.\n\nI was on cloud 9 with my nice, growing bag of ONE. I was staking it in Guarda\nand discovered a hidden bag I'd…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今すぐ財布を戻すんだ 今すぐだ\n\n私は最悪の事態に陥りました。自分の財布の管理と安全性については、かなり良くなったと思っていましたが\nウォレットの管理は得意だと思っていたが、実は苦手だった。\n\n順調に成長してきたワンのバッグを持って、雲の上にいた。グアルダで賭けをしていたら\n隠れていたバッグを発見しました...",
      "title": "今すぐお財布を戻してください。私と同じ過ちを犯さないように"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在就去把你的钱包拿回来，就像现在。\n\n我搞砸了，很糟糕。我以为我在跟踪和保管我的\n但事实证明，我在这方面其实很糟糕。\n\n我带着我那一袋漂亮的、不断增长的ONE在云端。我在Guarda的赌注是\n并发现了一个隐藏的袋子，我...",
      "title": "现在就去备份你的钱包吧。不要重蹈我的覆辙"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在就去把你的錢包拿回來，就像現在。\n\n我搞砸了，很糟糕。我以爲我在跟蹤和保管我的\n但事實證明，我在這方面其實很糟糕。\n\n我帶着我那一袋漂亮的、不斷增長的ONE在雲端。我在Guarda的賭注是\n並發現了一個隱藏的袋子，我...",
      "title": "現在就去備份你的錢包吧。不要重蹈我的覆轍"
    }
  ]
}