{
  "author": "Mallardshead",
  "original_created_utc": 1652066582,
  "title": "Re-iterating my $400k late 2022 early 2023 price target. Here's the real reason I'm so adamant about that:",
  "created_utc": 1652100270,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I authored this post a few weeks back discussing why changing the 21M hard cap is completely irrelevant in the future. The reason for that is because assuming bitcoin successfully becomes the honest transparent base layer that we need so desperately to replace the dishonest fiat/debt base layer--which nothing built over can ever achieve honesty--then changing the 21M hard cap would simply cause everything outside the money (products, services, credit markets) to adjust to the new block subsidy and BTC float. Thusly, the incentive to change it doesn&amp;#39;t exist. This was really more of a refutation of FUD &lt;em&gt;(But the limit can be changed!)&lt;/em&gt; and thought experiment than it was any probability.&lt;/p&gt;\n\n&lt;p&gt;I based this on economics 101, and more closely, on bitcoin mining. If for example, bitcoin spiked to $100k tomorrow, what would happen? Would an ASIC stay at the price it is today, which is about $10k for an S19j? No. It would increase roughly by whatever the BTC price increase is and then price itself with the next difficulty adjustment and current hashpower, along with the price entropy associated with an always approaching halving. I&amp;#39;ve noticed that when you include this stuff, mining has actually consistently beaten my spot BTC buys over the long run by a few percent.&lt;/p&gt;\n\n&lt;p&gt;So this all figures into my $400k price call. If you got a $100k spike tomorrow, would BTC maintain itself there? Absolutely not, because that would be at odds with everything rational to do with money. Why? Because efficient miners would be sitting there making $80k per BTC. Their BTC stockpiles would be worth a tremendous amount. ASIC owners would be sitting there with insane hardware appreciation. What do you think happens here? Same thing that eventually happens in every commodity market over time--the gap would get closed, arbitraged, miners would do huge share offerings, even I&amp;#39;d sell my S19&amp;#39;s, the difficulty adjustment would rocket, every student with a laptop would be syphoning their dorm and library&amp;#39;s free electricity to mine. The price would drawdown, because we are very early in BTC&amp;#39;s monetization phase.&lt;/p&gt;\n\n&lt;p&gt;But before you freak out, here&amp;#39;s what bears always forget:&lt;/p&gt;\n\n&lt;p&gt;There are two sides to that. This holds true for not just the move up, but the move down as well. So when you have baseload energy prices along the lines of &lt;em&gt;$8 per cubic foot&lt;/em&gt; or &lt;em&gt;$110 per barrel&lt;/em&gt;, you have hashpower increasing relentlessly, difficulty adjustments going up, constrained supply chains and miners HODLing, how long can the price stay depressed? Not long. That would be at odds with everything rational to do with money.&lt;/p&gt;\n\n&lt;p&gt;Look at the major miners. Are they selling? Nope. Decreasing their hashpower. Nope. Read their 10k&amp;#39;s. &lt;a href=\"/u/Riotblockchain\"&gt;u/Riotblockchain&lt;/a&gt; is active on this sub and they just announced in a post last week a 1GW expansion, literally at the same moment the press dropped elsewhere. Here&amp;#39;s all the US majors plans 2022:&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/rgxttjcv6dy81.png?width=649&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=193bcf52457e106096140dccb78ea17488189685\"&gt;https://preview.redd.it/rgxttjcv6dy81.png?width=649&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=193bcf52457e106096140dccb78ea17488189685&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;THAT. IS. JAW-DROPPING.&lt;/strong&gt; This to me says a 10x is likely the peak which also happens to be about gold&amp;#39;s market capitalization give or take. Will it hold? Absolutely not, probably a drawdown of 50%-60% like we see currently. Bitcoin doesn&amp;#39;t target a stable price, it targets a variable price. It can control the supply and issuance, then the market determines what the price is. That&amp;#39;s what a free market looks like. Bitcoin is in the long, difficult, and organic process of absorbing the world&amp;#39;s trust (and thus its value). When it&amp;#39;s absorbed enough, the confidence curve (and thus its volatility) will flatten. Many projects think they can magically skip this step. There&amp;#39;s only one crypto category that can: stablecoins. That&amp;#39;s why nothing inside altcoin protocols have ever established themselves as money, except stablecoins. Which is why 85% of all altcoin volume is from stablecoins--a percentage that is growing monthly. You ever look at the graph of stablecoin growth? At this rate it&amp;#39;ll be bitcoin at #1 and stablecoins making up the next 4 spots in 5 years. If you add bitcoin&amp;#39;s mkt cap dominance with the mkt caps of stablecoins, you get 74%. But there are 15,000 altcoins... Talk about an example of &lt;em&gt;Gresham&amp;#39;s Law.&lt;/em&gt; This is why you don&amp;#39;t touch anything but bitcoin, because here&amp;#39;s another prediction:&lt;/p&gt;\n\n&lt;p&gt;Fiat trouble is climbing the ladder from small to mid, and might now be just reaching the Japanese Yen already. There are many currencies which are more volatile than BTC. This WILL reach the USD&amp;#39;s rung in the next 24 months. When that happens a credit market will rapidly develop around BTC, and also, stablecoins are in a world of trouble in the shadow of BTC&amp;#39;s next halving, and altcoins are in even more trouble. Entire protocols can get completely de-collateralized when stablecoins wobble on their pegs and arbitrageurs are nowhere to be found, because volume spikes will make transactions unaffordable, and because bitcoin will emerge as collateral. And collateral is money, as we&amp;#39;re starting to rapidly learn with the Ukraine crisis and commodities. This more than regulation in my opinion, will be the s-curve adoption shakeout we&amp;#39;ve been waiting for, much to the chagrin of the web 3 shills--apologies if you&amp;#39;re a holder of these things with mega-lottery environments built around them.&lt;/p&gt;\n\n&lt;p&gt;This post is written as a chicken-noodle soup of sorts for the BTC holder&amp;#39;s soul, because volatility is hard to digest especially for noobs, but counterintuitively, it proves BTC is working, and it makes hedging quite expensive, which brings its own protective benefits in this free market. So you HODL, buy, repeat. You listen to the heartbeat of the only truly free market asset in existence, and ignore the mainstream talking points. Bitcoin&amp;#39;s longterm chart is a tale of highs and lows. But between that is a relentless and healthy uptrend. Why is that? Thanks for reading.&lt;/p&gt;\n\n&lt;p&gt;--Mallardshead 🦆&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 303,
  "permalink": "/r/Bitcoin/comments/uli4dc/reiterating_my_400k_late_2022_early_2023_price/",
  "subreddit": "Bitcoin",
  "id": "uli4dc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I authored this post a few weeks back discussing why changing the 21M hard cap\nis completely irrelevant in the future. The reason for that is because assuming\nbitcoin successfully becomes the honest transparent base layer that we need so\ndesperately to replace the dishonest fiat/debt base layer-…"
}