{
  "author": "GorillaFetish",
  "original_created_utc": 1648086331,
  "title": "Straight men who’ve had their dick sucked by another man, how did you come to the conclusion that you were straight afterwards?",
  "created_utc": 1648105933,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m gay so obviously I can’t really experience something like that. But i’m curious as to how you came to that conclusion, and how you felt about it afterwards? Thank you&lt;/p&gt;\n\n&lt;p&gt;edit: Idk why some of y’all can’t understand this, but straight people can and do get curious about their own sexuality. Just because they may have experimented doesn’t mean they’re not straight anymore… All it means is that they experimented.&lt;/p&gt;\n\n&lt;p&gt;Also, any form of stimulation to your genitals does not define your sexuality either. Your dick will get hard regardless of who’s doing the stimulating and regardless if you want to be hard or not, because that’s how bodies work. Your body doesn’t give a shit about who you’re attracted to, it’s going to do whatever it feels like doing.&lt;/p&gt;\n\n&lt;p&gt;edit 2: Also yes I technically can experience this myself, with me (as a gay man) and another woman. But it’s almost 2:00 am and I don’t really want to experiment with my sexuality right now, so I just thought i’d ask.&lt;/p&gt;\n\n&lt;p&gt;edit 3: I haven’t seen this comment but I know it’s coming, and no, I am not doubting that straight men exist. And no, I do not think that straight men can be “turned” gay. Like, that is scientifically impossible. I was just curious about straight men who have experimented with their sexuality…&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 131,
  "permalink": "/r/TooAfraidToAsk/comments/tlt0ux/straight_men_whove_had_their_dick_sucked_by/",
  "subreddit": "TooAfraidToAsk",
  "id": "tlt0ux",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I’m gay so obviously I can’t really experience something like that. But i’m\ncurious as to how you came to that conclusion, and how you felt about it\nafterwards? Thank you\n\nedit: Idk why some of y’all can’t understand this, but straight people can and\ndo get curious about their own sexuality. Just…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はゲイなので、当然そんなことは経験できません。しかし、私は\nその結論に至った経緯と、それについてどう感じたかを教えてください。\nその後？ありがとうございました\n\n編集：なぜこのことを理解できない人がいるのかわかりませんが、ストレートの人たちは\n自分のセクシュアリティに興味を持つことがあります。ただ...",
      "title": "他の男性にフェラチオされたことがあるノンケの方、その後どうやってノンケという結論に至ったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是同性恋，所以显然我不能真正经历这样的事情。但我\n我很好奇你是如何得出这个结论的，以及你后来的感觉如何？\n之后的感受？谢谢你\n\n编辑：我不知道为什么你们中的一些人不能理解这一点，但是直人可以而且\n对自己的性行为感到好奇。只是...",
      "title": "被另一个男人吸过鸡巴的直男们，你们后来是怎么得出结论说自己是直男的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是同性戀，所以顯然我不能真正經歷這樣的事情。但我\n我很好奇你是如何得出這個結論的，以及你後來的感覺如何？\n之後的感受？謝謝你\n\n編輯：我不知道爲什麼你們中的一些人不能理解這一點，但是直人可以而且\n對自己的性行爲感到好奇。只是...",
      "title": "被另一個男人吸過雞巴的直男們，你們後來是怎麼得出結論說自己是直男的？"
    }
  ]
}