{
  "author": "chris_ut",
  "original_created_utc": 1655305407,
  "title": "People in this sub need to be aware of what a short covering rally is",
  "created_utc": 1655344776,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In stocks during a bear market the downtrend is punctuated by brief but heavy rallies to the upside, this is caused by shorts temporarily closing their positions. Once a big short starts to exit nobody wants to be the last guy out the door so other shorts pile in and since shorts close by buying suddenly you see big buying volume coming in. This is where people get in trouble because if you are not experienced with a bear market you may see this heavy buying and think “oh no I missed the bottom” and fomo in. Meanwhile the following week the short gets back from his tropical vacation and sees a nice 20% uptick on the back of dumb money retail and gets back to business. If the market suddenly rallies always ask yourself “has something fundamentally changed that would cause everyone to suddenly pile in here?”&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 346,
  "permalink": "/r/CryptoCurrency/comments/vcwjuc/people_in_this_sub_need_to_be_aware_of_what_a/",
  "subreddit": "CryptoCurrency",
  "id": "vcwjuc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In stocks during a bear market the downtrend is punctuated by brief but heavy\nrallies to the upside, this is caused by shorts temporarily closing their\npositions. Once a big short starts to exit nobody wants to be the last guy out\nthe door so other shorts pile in and since shorts close by buying…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "弱気相場中の株式では、下降トレンドは短時間だが激しい動きで中断される。\nこれは、ショートが一時的にポジションを閉じるために起こるものです。\nこれはショートが一時的にポジションを閉じるためです。大口のショートが退場し始めると、誰も最後の一人になりたくないので、他のショートが殺到して\nそのため、他のショートも参入し、ショートは買いによって決済されるため...",
      "title": "このサブの人たちは、ショートカバーラリーが何であるかを認識する必要がある"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在熊市中，股票的下跌趋势是以短暂但沉重的\n的反弹，这是由于空头暂时平仓造成的。\n仓位。一旦一个大的空头开始退出，没有人愿意成为最后一个离开的人。\n所以其他的空头就扎堆进来，由于空头通过买入来平仓...",
      "title": "这个次的人需要意识到什么是空头回补的反弹"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在熊市中，股票的下跌趨勢是以短暫但沉重的\n的反彈，這是由於空頭暫時平倉造成的。\n倉位。一旦一個大的空頭開始退出，沒有人願意成爲最後一個離開的人。\n所以其他的空頭就扎堆進來，由於空頭通過買入來平倉...",
      "title": "這個次的人需要意識到什麼是空頭回補的反彈"
    }
  ]
}