{
  "author": "python-hug",
  "the_new_excerpt": "Because if it is indeed true, my level of personal happiness greatly increases\nwithin the constructs of such a well-defined theory.",
  "original_created_utc": 1617309341,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "因为如果真的是这样，我的个人幸福感就会大大增加\n在这样一个定义明确的理论的建构中。",
      "title": "在无限多时空的理论中，我已经拥有或将来会拥有一辆全新的1973年兰博基尼Miura SV，颜色由我自己定制选择，而在上述车辆中，我已经或将来会与33岁的拉奎尔-韦尔奇进行5小时的第三次约会，这是真的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因爲如果真的是這樣，我的個人幸福感就會大大增加\n在這樣一個定義明確的理論的建構中。",
      "title": "在無限多時空的理論中，我已經擁有或將來會擁有一輛全新的1973年蘭博基尼Miura SV，顏色由我自己定製選擇，而在上述車輛中，我已經或將來會與33歲的拉奎爾-韋爾奇進行5小時的第三次約會，這是真的嗎？"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "なぜなら、もしそれが本当であれば、私の個人的な幸福のレベルは、そのような明確に定義された理論の中で\nそのような明確な理論の構成要素の中では、私の個人的な幸福度は非常に高くなります。",
      "title": "無限の多次元理論において、私がすでに所有している、あるいは将来所有するであろう、1973年製のランボルギーニ・ミウラSVを自分の好きな色に塗装し、その車の中で33歳のラクエル・ウェルチと5時間の3回目のデートをしている、あるいは将来するであろう、というのは本当でしょうか？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "なぜなら、もしそれが本当であれば、私の個人的な幸福のレベルは、そのような明確に定義された理論の中で\nそのような明確な理論の構成要素の中では、私の個人的な幸福度は非常に高くなります。",
      "title": "無限の多次元理論において、私がすでに所有している、あるいは将来所有するであろう、1973年製のランボルギーニ・ミウラSVを自分の好きな色に塗装し、その車の中で33歳のラクエル・ウェルチと5時間の3回目のデートをしている、あるいは将来するであろう、というのは本当でしょうか？"
    }
  ],
  "title": "Is it true in the theory of infinite multiverses, that I've already owned, or will own in the future, a brand new 1973 Lamborghini Miura SV painted in my own custom color choice, and in said vehicle, I already have, or will in the future, go on a 5 hour third date with a 33 year old Raquel Welch?",
  "created_utc": 1617351786,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Because if it is indeed true, my level of personal happiness greatly increases within the constructs of such a well-defined theory.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/askphilosophy/comments/mi4ert/is_it_true_in_the_theory_of_infinite_multiverses/",
  "subreddit": "askphilosophy",
  "id": "mi4ert",
  "is_self": true,
  "media": null,
  "is_video": false
}