{
  "author": "MrNuttyJoe",
  "original_created_utc": 1632778586,
  "title": "What popular crypto opinions do you STRONGLY disagree with?",
  "created_utc": 1632799856,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Tell me what crypto opinions you disagree with, that are extremely popular on this sub and in the crypto world in general!</p>\n\n<p>Do you think Shiba is <em>actually</em> a good investment?\nDo you think people should be avoiding Bitcoin?\nDo you like pineapple on pizza?\nDo you believe Elon Musk is actually good for crypto, and should be crowned the crypto king?</p>\n\n<p>The more unpopular, the better! This is a safe space to share your controversial, or even idiotic opinions!</p>\n\n<p>I&#39;ll give my own example: I hate DCAing. I know you can&#39;t time the market, but I&#39;d much rather try to buy dips than put a steady amount into crypto each week!</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/CryptoCurrency/comments/pwr8ba/what_popular_crypto_opinions_do_you_strongly/",
  "subreddit": "CryptoCurrency",
  "id": "pwr8ba",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Tell me what crypto opinions you disagree with, that are extremely popular on\nthis sub and in the crypto world in general!\n\nDo you think Shiba is actually a good investment? Do you think people should be\navoiding Bitcoin? Do you like pineapple on pizza? Do you believe Elon Musk is\nactually good for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "で非常に人気のある、あなたが同意しない暗号の意見を教えてください。\nこのサブや暗号の世界全般で非常に人気のある、反対意見を教えてください。\n\nShibaは実際に良い投資だと思いますか？人々はビットコインを避けるべきだと思いますか？\nBitcoinを避けるべきだと思いますか？あなたはピザのパイナップルが好きですか？あなたは、イーロン・マスクが\nあなたは、イーロン・マスクが実際に良い...",
      "title": "人気のある暗号の意見で、あなたが強く同意できないものは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "告诉我你不同意哪些加密货币的观点，这些观点在本子上和一般的加密货币世界中非常流行。\n在本子上和一般的加密货币世界中非常流行的观点!\n\n你认为Shiba实际上是一个好的投资吗？你是否认为人们应该\n避开比特币？你喜欢披萨上的菠萝吗？你是否相信埃隆-马斯克是\n实际上对...",
      "title": "你坚决不同意哪些流行的加密货币观点？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "告訴我你不同意哪些加密貨幣的觀點，這些觀點在本子上和一般的加密貨幣世界中非常流行。\n在本子上和一般的加密貨幣世界中非常流行的觀點!\n\n你認爲Shiba實際上是一個好的投資嗎？你是否認爲人們應該\n避開比特幣？你喜歡披薩上的菠蘿嗎？你是否相信埃隆-馬斯克是\n實際上對...",
      "title": "你堅決不同意哪些流行的加密貨幣觀點？"
    }
  ]
}