{
  "author": "CryptoCat92",
  "the_new_excerpt": "Hey Everyone!I just read an article about how Augustus would use Egyptian cults\nto further strengthen his own imperial cult. Is there any truth to this? I find\nit truly fascinating that Augustus could've appropriated foreign cults out of\nhis own pragmatic reasons. Happy for any input if you know…",
  "original_created_utc": 1620227090,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、先日、アウグストゥスがエジプトのカルトを利用して、自分の帝国のカルトをさらに強化したという記事を読みました。\n自分の帝国のカルトをさらに強化するために。この話は本当なのでしょうか？私は\nアウグストゥスが自分の実用的な理由から外国のカルトを流用したというのは、実に興味深いことです。\n実利的な理由から外国のカルトを利用したというのは、実に興味深いことです。ご存知であれば、ご意見をお聞かせください...。",
      "title": "アウグストゥスとイシス教団の関係"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好！我刚刚读了一篇关于奥古斯都如何利用埃及邪教的文章\n来进一步加强他自己的帝国崇拜。这有什么道理吗？我觉得\n奥古斯都可以从他自己的骄傲中挪用外国邪教，这确实很吸引人。\n他自己的实用主义理由。如果你知道的话，很乐意提供任何意见...",
      "title": "奥古斯都与伊希斯教的关系"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好！我剛剛讀了一篇關於奧古斯都如何利用埃及邪教的文章\n來進一步加強他自己的帝國崇拜。這有什麼道理嗎？我覺得\n奧古斯都可以從他自己的驕傲中挪用外國邪教，這確實很吸引人。\n他自己的實用主義理由。如果你知道的話，很樂意提供任何意見...",
      "title": "奧古斯都與伊希斯教的關係"
    }
  ],
  "title": "Augustus' relationship with the Cult of Isis",
  "created_utc": 1620240040,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey Everyone!I just read an article about how Augustus would use Egyptian cults to further strengthen his own imperial cult. Is there any truth to this? I find it truly fascinating that Augustus could&#39;ve appropriated foreign cults out of his own pragmatic reasons. Happy for any input if you know anything :)</p>\n\n<p>P.S I&#39;ve read some old texts on the cult which I find facinating. Especially The Golden Ass. Are there any other hidden gems that I could read up on?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/n5i1c4/augustus_relationship_with_the_cult_of_isis/",
  "subreddit": "AskHistorians",
  "id": "n5i1c4",
  "is_self": true,
  "media": null,
  "is_video": false
}