{
  "author": "TheRedRebel4",
  "the_new_excerpt": "Technical Analysis doesn't mean too much to GME, but it certainly tells us\nsomething. I think most of us here can agree that something could certainly\nhappen due to the insanely low volume we have been seeing as well as the\nEarnings Report coming later today. Here are some a few key indicators why…",
  "original_created_utc": 1616521599,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "技术分析对GME来说并没有太大意义，但它肯定能告诉我们以下信息\n的东西。我想我们大多数人都会同意，有些东西肯定会...\n由于我们所看到的疯狂的低成交量，以及我们所看到的。\n今天晚些时候将发布财报。以下是一些关键指标，为什么...",
      "title": "GAMESTOP只能上升"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "技術分析對GME來說並沒有太大意義，但它肯定能告訴我們以下信息\n的東西。我想我們大多數人都會同意，有些東西肯定會...\n由於我們所看到的瘋狂的低成交量，以及我們所看到的。\n今天晚些時候將發佈財報。以下是一些關鍵指標，爲什麼...",
      "title": "GAMESTOP只能上升"
    }
  ],
  "title": "Gamestop Can Only Go Up",
  "created_utc": 1616532547,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p>Technical Analysis doesn&#39;t mean too much to GME, but it certainly tells us something. I think most of us here can agree that something could certainly happen due to the insanely low volume we have been seeing as well as the Earnings Report coming later today. Here are some a few key indicators why GME can and will go up dramatically soon.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/007anng09to61.jpg?width=1895&amp;format=pjpg&amp;auto=webp&amp;s=aff7be90f38ab719c4288d31a1ff33f04b32cd8f\">1 Hour Technical Analysis</a></p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li><strong>RSI -</strong> The first point I&#39;d like to touch on is RSI. As you can see, the RSI is extremely overbought in the bottom left of the chart when GME was making it&#39;s comeback from the drop to $40. Now look at the RSI <strong>AT THE SAME PRICE</strong> today and you&#39;ll see that we are heading towards being oversold. What does this mean? It&#39;s simply an indicator that we are oversold and due a huge price increase.</li>\n<li><strong>Trend -</strong> In terms of the month, we have seen insane gains from the $40 price point we were sitting at for weeks. From the start of this chart to the end you can see an upward trend. Now if you look at the first pennant formation indicated by the white lines in the red highlighted area, it&#39;s starting to look awful familiar to the current correction we are seeing in the second red highlighted area. The current trend we are in is a Bullish Descending Triangle, much like the Pennant we saw earlier.</li>\n<li><strong>Volume -</strong> With GME, when volume goes up, price goes up. If you look at the volume you can see that whenever it dries up, the price tends to skyrocket. Right now volume is extremely low, a sign that people are holding strong and shorters are having a difficult time dropping the price further.</li>\n<li><strong>Turning Point -</strong> With the RSI, Trend, and Volume all pointing towards future rapid growth, I&#39;m inclined to believe we will see massive gains soon. I do not see the price dropping below $150 at this point, and the only way I see it getting to that area is MASSIVE short selling to artificially drop the price.</li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p><strong>Conclusion -</strong> The technicals point toward GME skyrocketing in the near future. Take this all with a grain of salt though, the price could very well drop below the areas I&#39;ve mentioned before going up. Above all else <strong>HODL</strong> and the tendies shall come!</p>\n</div><!-- SC_ON -->",
  "score": 4446,
  "permalink": "/r/wallstreetbets/comments/mbkb9h/gamestop_can_only_go_up/",
  "subreddit": "wallstreetbets",
  "id": "mbkb9h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752832256
}