{
  "author": "Ragnarthot",
  "the_new_excerpt": "He is at work right now cause he didn't want to miss a day but when he comes\nhome, I want to console him well.\n\nI am not an emotional person but i want to help as much as I can so he doesn't\nfeel alone. His family is all the way in California and we are in New jersey so\nhe won't be there to bury…",
  "original_created_utc": 1620822891,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼は今、1日も休めないと思って仕事をしていますが、帰ってきたら\n私は感情的な人間ではありませんが、彼が帰宅したときにはしっかりと慰めてあげたいと思っています。\n\n私は感情的な人間ではありませんが、彼が孤独を感じないように、できる限りの手助けをしたいと思っています。\n私は感情的な人間ではありません。彼の家族はずっとカリフォルニアにいて、私たちはニュージャージーにいるので\n埋葬には行けません...",
      "title": "私のパートナーは今朝、子供の頃に飼っていた犬を亡くし、とても取り乱しています。私はペットを亡くしたことがないので、どうやって彼を助けてあげればいいのかわかりませんが、本当に助けてあげたいです。どなたか、どのように対処すべきかアドバイスをいただけませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他现在正在工作，因为他不想错过任何一天，但当他回到家时，我想好好安慰他。\n回家后，我想好好安慰他。\n\n我不是一个情绪化的人，但我想尽可能地帮助他，这样他就不会\n感到孤独。他的家人都在加州，而我们在新泽西州，所以\n他不会在那里埋葬...",
      "title": "我的伙伴今天早上失去了他儿时的狗，他非常心烦意乱。我从来没有失去过宠物，所以我不知道如何帮助他度过难关，但我真的很想这样做。有谁对我应该如何处理这件事有建议吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他現在正在工作，因爲他不想錯過任何一天，但當他回到家時，我想好好安慰他。\n回家後，我想好好安慰他。\n\n我不是一個情緒化的人，但我想盡可能地幫助他，這樣他就不會\n感到孤獨。他的家人都在加州，而我們在新澤西州，所以\n他不會在那裏埋葬...",
      "title": "我的夥伴今天早上失去了他兒時的狗，他非常心煩意亂。我從來沒有失去過寵物，所以我不知道如何幫助他度過難關，但我真的很想這樣做。有誰對我應該如何處理這件事有建議嗎？"
    }
  ],
  "title": "My partner lost his childhood dog this morning and is so distraught. I have never lost a pet so I don't know how to help him through this but I really want to. Does anyone have advice on how I should handle this?",
  "created_utc": 1620873414,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>He is at work right now cause he didn&#39;t want to miss a day but when he comes home, I want to console him well. </p>\n\n<p>I am not an emotional person but i want to help as much as I can so he doesn&#39;t feel alone. His family is all the way in California and we are in New jersey so he won&#39;t be there to bury him. Which kills me cause we were literally saving money to go get him this summer. </p>\n\n<p>Any advice on mourning dog owners would help! I just don&#39;t want him to feel alone while he mourns.</p>\n\n<p>Edit: I just wanted to express that I appreciate all of the helpful comments and links from all of you. Thank you so much for helping me understand how to approach this. I really want him to feel loved and supported and peaceful during this tragic time for him. Thank you, you&#39;re all topshelf people.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/nanlj7/my_partner_lost_his_childhood_dog_this_morning/",
  "subreddit": "NoStupidQuestions",
  "id": "nanlj7",
  "is_self": true,
  "media": null,
  "is_video": false
}