{
  "author": "Additional-Apple-492",
  "original_created_utc": 1656347365,
  "title": "Bitcoin isn’t some magical investment that is guaranteed",
  "created_utc": 1656390652,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Tough pill for a lot of people to swallow.  This forum seems to have a cult like mentality that discourages taking profits.  Most times when a rational post is made here, people respond with you don’t understand crypto or fud.  I saw a post where someone was bragging about being a full coiner and his average price was 38k and people were saying congrats that’s a great price.  No, it’s really not.  He’s down nearly 50 percent on his investment and counting. &lt;/p&gt;\n\n&lt;p&gt;The blockchain is an amazing technology that isn’t going anywhere.  But people fail to realize that we’re not even in a CONFIRMED recession.  We will be shortly.   People are going to be losing jobs, inflation problems and it’s going to be very tough for the average human.  &lt;/p&gt;\n\n&lt;p&gt;The average response will be no one knows shit about fuck I’m buying no matter what!  That’s great, but someone with common sense knows that Bitcoin won’t recover until inflation peaks and  we’re done with rate hikes.  Bitcoin will continue to drop while there’s fear of a recession or once we’re in the middle of one.  &lt;/p&gt;\n\n&lt;p&gt;“Be Greedy when others a fearful”!  You’re being greedy by thinking things can’t get any worse.  All bitcoin is, is a leveraged bet on the stock market.  It was the best performing asset during the bull run and will be the worst performing asset during the bear market.  &lt;/p&gt;\n\n&lt;p&gt;I don’t know anyone with common sense that is bullish on the stock market currently.   You can do what you want with your money. But I’d rather preserve my capital so I can buy more BTC when the time is right.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/vlzj23/bitcoin_isnt_some_magical_investment_that_is/",
  "subreddit": "CryptoCurrency",
  "id": "vlzj23",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Tough pill for a lot of people to swallow. This forum seems to have a cult like\nmentality that discourages taking profits. Most times when a rational post is\nmade here, people respond with you don’t understand crypto or fud. I saw a post\nwhere someone was bragging about being a full coiner and his…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人にとって飲み込むのが難しい薬 このフォーラムは、利益を得ることを嫌うカルト的な\nこのフォーラムは、利益を得ることを妨げるようなカルト的なメンタリティーを持っているようです。合理的な投稿がなされると、ほとんどの場合\n暗号や不正を理解していないと反応されます。私はある投稿を見ました。\nある人がフルコイナーであることを自慢している投稿を見ました...",
      "title": "ビットコインは保証された魔法のような投資ではない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对很多人来说，这是很难吞下的药丸。这个论坛似乎有一种邪教般的\n的心态，不鼓励获取利润。大多数时候，当一个理性的帖子被\n的时候，人们的反应是你不了解加密货币或假币。我看到一个帖子\n其中有人吹嘘自己是一个全能型币商，而他的...",
      "title": "比特币并不是什么有保障的神奇投资"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對很多人來說，這是很難吞下的藥丸。這個論壇似乎有一種邪教般的\n的心態，不鼓勵獲取利潤。大多數時候，當一個理性的帖子被\n的時候，人們的反應是你不瞭解加密貨幣或假幣。我看到一個帖子\n其中有人吹噓自己是一個全能型幣商，而他的...",
      "title": "比特幣並不是什麼有保障的神奇投資"
    }
  ]
}