{
  "author": "TheBlackStuff1",
  "original_created_utc": 1633009561,
  "title": "A 96 year old woman was arrested today to stand trial for crimes committed during WW2. What, if any, philosophical debate is there around crimes committed so long ago being tried decades later?",
  "created_utc": 1633063533,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sorry if this has been asked elsewhere, I couldn&#39;t find anything. I read today about an old woman being tried for her role as a secretary in a death camp during WW2. I find it a conflicting issue and was looking for some writings on these issues. </p>\n\n<p>Questions like - Is it just to track these people down when they&#39;re already so old and close to death themselves? </p>\n\n<p>Any directions you could point me to would be appreciated! </p>\n\n<p>Thanks</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/pyk3vi/a_96_year_old_woman_was_arrested_today_to_stand/",
  "subreddit": "askphilosophy",
  "id": "pyk3vi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Sorry if this has been asked elsewhere, I couldn't find anything. I read today\nabout an old woman being tried for her role as a secretary in a death camp\nduring WW2. I find it a conflicting issue and was looking for some writings on\nthese issues.\n\nQuestions like - Is it just to track these people…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "他で質問されていたらすみません、見つけられませんでした。今日読んだ本\n死の収容所で秘書の役割を果たしたとして裁判にかけられた老女について\n第二次世界大戦中に。相反する問題だと思い、何か文章を探していました。\nこのような問題を\n\nこのような質問 - これらの人々を追跡するためだけなのでしょうか...",
      "title": "第二次世界大戦中に犯した罪により、96歳の女性が本日逮捕され、裁判を受けることになりました。大昔に犯した犯罪が数十年後に裁かれることについて、哲学的な議論があるとすれば、それはどのようなものだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果这个问题在其他地方已经问过了，对不起，我找不到任何东西。我今天读到\n关于一位老妇人因在二战期间在死亡营担任秘书而被审判的消息\n二战期间的秘书。我觉得这是个矛盾的问题，想找一些关于这些问题的著作。\n这些问题。\n\n诸如以下问题--是否只是为了追踪这些人...",
      "title": "一名96岁的妇女今天被捕，将因在二战期间犯下的罪行而接受审判。如果有的话，围绕着这么久以前犯下的罪行在几十年后受审有什么哲学上的争论？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果這個問題在其他地方已經問過了，對不起，我找不到任何東西。我今天讀到\n關於一位老婦人因在二戰期間在死亡營擔任祕書而被審判的消息\n二戰期間的祕書。我覺得這是個矛盾的問題，想找一些關於這些問題的著作。\n這些問題。\n\n諸如以下問題--是否只是爲了追蹤這些人...",
      "title": "一名96歲的婦女今天被捕，將因在二戰期間犯下的罪行而接受審判。如果有的話，圍繞着這麼久以前犯下的罪行在幾十年後受審有什麼哲學上的爭論？"
    }
  ]
}