{
  "author": "dolmaface",
  "original_created_utc": 1627782780,
  "title": "My layman explanation of Kusama/Polkadot and why they are so innovative",
  "created_utc": 1627817441,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve noticed on this sub very few people are discussing Kusama &amp; Polkadot, so I thought I&#39;d take a stab at explaining in layman terms how they work and their significance. </p>\n\n<p>Before getting started, I&#39;d like to clear up that Kusama is the canary network to Polkadot. Unlike what many people in this sub believe, Kusama is not a test-network for Polkadot -- the test network is called Rococo. Kusama is a fully functional and live network with real value where all new-tech is run prior to being released on the main Polkadot network. Kusama is fast-paced, innovative, and experimental while Polkadot is slower, less chaotic, and more reliable.</p>\n\n<p>So what technology does Polkadot provide? Right now in crypto if one blockchain wants to communicate with another, it has to using bridges. Bridges are slow, expensive, and not practical for scalability. Polkadot provides a fast, inexpensive, and standardized way for blockchains to communicate with each other.</p>\n\n<p>Why is this important? What is the significance of this? In the Polkadot ecosystem many blockchains can deploy and each specialize in certain technologies (e.g. DEX, file storage, privacy, fast transactions, smart contracts, etc...), and then leverage each others features. By leveraging different features of different blockchains, developers can effectively create decentralized applications that are otherwise not possible. The chains sorta provide an SDK for devs to build off, and create practical applications from (websites, streaming services, social media, cloud storage, etc...). For instance, a DEX chain can leverage the privacy chain to allow for confidential swapping. Or a dev can leverage from a smart contract platform and a file storage platform to create a music streaming dapp. Polkadot will be the connective tissue for the future decentralized web.</p>\n\n<p>I am surprised this isn&#39;t talked about more in this subreddit. Just think about the scalabiltiy. The tech from current chains(ADA, Tezos, ETH, NANO, etc...) can each exist in the Polkadot ecosystem and leverage each others features. Cardano&#39;s smart contract platform will be just one of the many smart contract options for devs to use in polkadot, and whatever the next big hit crypto tech the future holds can easily be deployed into the ecosystem for devs to leverage.</p>\n\n<p>At the moment Kusama already has deployed 5 chains and demonstrated cross-network functionality. The 5 chains on Kusama right now are Karura(DEX), Moonriver(Ethereum Smart Contracts), Shiden(Web Assembly + Layer 2 Smart Contracts), Khala(Privacy), and Bifrost(Finance). These chains are operating and in the midst of deploying their applications. In a month or so these chains will be fully functional and things will start to get really exciting!</p>\n\n<p>I hope this post helped you understand Polkadot/Kusama, feel free to correct me if I was wrong about anything</p>\n\n<p>TLDR: Kusama is a faster/innovative version of Polkadot where tech is deployed prior to release on Polkadot. Polkadot provides an efficient means for blockchains to communicate and leverage each others features thus laying the foundation of the future decentralized web.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/ovjic3/my_layman_explanation_of_kusamapolkadot_and_why/",
  "subreddit": "CryptoCurrency",
  "id": "ovjic3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've noticed on this sub very few people are discussing Kusama & Polkadot, so I\nthought I'd take a stab at explaining in layman terms how they work and their\nsignificance.\n\nBefore getting started, I'd like to clear up that Kusama is the canary network\nto Polkadot. Unlike what many people in this sub…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブチャンネルでは、草間＆ポルカドットについて議論している人がほとんどいないことに気づきました。\n草間＆ポルカドットの仕組みや意義を分かりやすく説明してみようと思います。\n意義を説明したいと思います。\n\nその前に、「草間」は「ポルカドット」のカナリヤネットワークであることを明確にしておきたい。\nをPolkadotに移したものです。この分野の多くの人が思っているのとは違って...",
      "title": "草間・ポルカドットの素人なりの解説と、なぜ革新的なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我注意到在这个子网站上，很少有人讨论草间和波尔卡多，所以我\n所以我想我要试着用通俗的语言解释一下它们是如何工作的以及它们的\n的意义。\n\n在开始之前，我想澄清一下，Kusama是金丝雀网络\n是Polkadot的金丝雀网络。不像许多人在这个子...",
      "title": "我对Kusama/Polkadot的外行解释，以及他们为什么如此创新？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我注意到在這個子網站上，很少有人討論草間和波爾卡多，所以我\n所以我想我要試着用通俗的語言解釋一下它們是如何工作的以及它們的\n的意義。\n\n在開始之前，我想澄清一下，Kusama是金絲雀網絡\n是Polkadot的金絲雀網絡。不像許多人在這個子...",
      "title": "我對Kusama/Polkadot的外行解釋，以及他們爲什麼如此創新？"
    }
  ]
}