{
  "author": "bobl0",
  "original_created_utc": 1637092247,
  "title": "Got liquidated and lost $10k",
  "created_utc": 1637106071,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know you have to take responsibility and deal with it but it feels so shitty I can&#39;t even explain it. When it happened I thought I was gonna be sick. Still can&#39;t believe it hours later.</p>\n\n<p>I would hear a lot in crypto communities that everyone gets liquidated in futures at one point, I just never though it&#39;d happen to me.</p>\n\n<p>I only started trading futures a month and a half ago. I basically lost $6.5k that I put in, which is pretty much all the savings I had and the profits that I made along with it. All because I didn&#39;t use stop losses and the positions just kept falling. I also should have never opened more than 10 positions. I had about 14.</p>\n\n<p>I was doing pretty well too upto this point. Since I am apart of some signals chats I had made decent money trading 20x lev, about $200-$400 per day in profit. I would also exit losing positions quick - but this flash crash caught me off guard. All my positions were losing positions and I didn&#39;t want to realize losses.</p>\n\n<p>I wanted to share this here, maybe some of you could give me advice about anything at this point, don&#39;t know who to talk to about it. I know I can succeed with futures but I don&#39;t even know where I go from here since I&#39;m unemployed too. Its really taking a toll on my mental.</p>\n\n<p>Anyway thanks for reading. Any comment would be much appreciated.</p>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/Bitcoin/comments/qvgecn/got_liquidated_and_lost_10k/",
  "subreddit": "Bitcoin",
  "id": "qvgecn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know you have to take responsibility and deal with it but it feels so shitty I\ncan't even explain it. When it happened I thought I was gonna be sick. Still\ncan't believe it hours later.\n\nI would hear a lot in crypto communities that everyone gets liquidated in\nfutures at one point, I just never…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "責任を持って対処しなければならないのは分かっているが、とても嫌な気分になる。\n説明できません。これが起こったとき、私は病気になると思いました。今でも\n数時間経った今でも信じられません。\n\n暗号コミュニティでは、誰もがF1で清算されるという話をよく耳にしました。\n先物で清算されるという話をよく聞きますが、私は一度も...",
      "title": "リキッド化されて1万ドルを失った"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道你必须承担责任并处理它，但这感觉太糟糕了，我甚至无法解释。\n我甚至无法解释它。当它发生时，我以为我将会生病。几个小时后仍然\n几个小时后，我仍然无法相信。\n\n我在加密货币社区经常听说，每个人都会在某一时刻被清算的\n期货，我只是从来没有...",
      "title": "被清算了，损失了1万美元"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道你必須承擔責任並處理它，但這感覺太糟糕了，我甚至無法解釋。\n我甚至無法解釋它。當它發生時，我以爲我將會生病。幾個小時後仍然\n幾個小時後，我仍然無法相信。\n\n我在加密貨幣社區經常聽說，每個人都會在某一時刻被清算的\n期貨，我只是從來沒有...",
      "title": "被清算了，損失了1萬美元"
    }
  ]
}