{
  "author": "Flaca50",
  "original_created_utc": 1650978584,
  "title": "Why is it considered rude to speak another language other than English in the U.S.?",
  "created_utc": 1650983664,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a bilingual (Spanish/English) Latina born and raised in Texas.  I&amp;#39;ve noticed that sometimes if I&amp;#39;m speaking in Spanish out in public with another Spanish speaker people nearby who only speak English will get upset and tell us, &amp;quot;this is America, we speak English here and you have to learn the language!&amp;quot;    I&amp;#39;m wondering why they get so upset, considering that our conversation has nothing to do with them.   If I ask why they get upset, they say it&amp;#39;s considered rude.  And nowadays, you run the risk of upsetting a Karen type who will potentially cause a scene or become violent.&lt;/p&gt;\n\n&lt;p&gt;I have gone to amusement parks where there are a lot of tourists from different countries and if I hear whole families speaking in their native tongue that I don&amp;#39;t understand, my family and I don&amp;#39;t get upset or feel threatened.  We actually enjoy hearing different languages and dialects from other countries.  &lt;/p&gt;\n\n&lt;p&gt;I do not understand why it is considered rude.  If I am speaking to you I will speak in a language that you understand.  Otherwise, the conversation is none of your business.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 180,
  "permalink": "/r/NoStupidQuestions/comments/ucc861/why_is_it_considered_rude_to_speak_another/",
  "subreddit": "NoStupidQuestions",
  "id": "ucc861",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm a bilingual (Spanish/English) Latina born and raised in Texas. I've noticed\nthat sometimes if I'm speaking in Spanish out in public with another Spanish\nspeaker people nearby who only speak English will get upset and tell us, \"this\nis America, we speak English here and you have to learn the…"
}