{
  "author": "gorays21",
  "the_new_excerpt": "Maybe I am biased because I love Marvel but Disney+ already surpassed 100+\nsubscribers within less than 2 years since it launched. I do think Disney will\nbe a fantastic growth stock for the next 10 years because of Disney+, they are\npumping out more and more content for the next 2 years compared to…",
  "original_created_utc": 1620261242,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はマーベルが好きなので偏見があるかもしれませんが、Disney+はサービス開始から2年も経たないうちに、すでに100人を超えています。\nの加入者数を突破しました。私は、ディズニーは今後10年間、素晴らしい成長株になると思います。\nディズニーは今後10年間、素晴らしい成長株になると思います。なぜなら、Disney+は、より多くのコンテンツを\n今後2年間、より多くのコンテンツを提供していきます。",
      "title": "ディズニーにものすごく強気な人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "也许我有偏见，因为我喜欢Marvel，但Disney+在推出不到两年的时间里已经超过了100多个\n用户的数量，而且是在推出不到两年的时间里。我确实认为迪士尼将\n在未来10年将是一只出色的增长型股票，因为迪斯尼+，他们正在\n在未来2年内，他们将推出越来越多的内容，而不是......",
      "title": "还有人极度看好迪斯尼的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "也許我有偏見，因爲我喜歡Marvel，但Disney+在推出不到兩年的時間裏已經超過了100多個\n用戶的數量，而且是在推出不到兩年的時間裏。我確實認爲迪士尼將\n在未來10年將是一隻出色的增長型股票，因爲迪斯尼+，他們正在\n在未來2年內，他們將推出越來越多的內容，而不是......",
      "title": "還有人極度看好迪斯尼的嗎？"
    }
  ],
  "title": "Anyone else extremely bullish on Disney?",
  "created_utc": 1620271981,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Maybe I am biased because I love Marvel but Disney+ already surpassed 100+ subscribers within less than 2 years since it launched. I do think Disney will be a fantastic growth stock for the next 10 years because of Disney+, they are pumping out more and more content for the next 2 years compared to last year.</p>\n\n<p>On top of Disney+, Disney theme parks, cruises, and their movies like Star wars and MCU will continue to make ton of money(not to mention they are working on 4 Avatar sequels this decade). Disney has their earnings next Thursday and I expect the total number of D+ subscribers to be up again thanks to their new hit show the Falcon and the Winter soldier.</p>\n\n<p>How do you guys feel about Disney this year and in the coming years?</p>\n</div><!-- SC_ON -->",
  "score": 380,
  "permalink": "/r/stocks/comments/n5uz1x/anyone_else_extremely_bullish_on_disney/",
  "subreddit": "stocks",
  "id": "n5uz1x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380968362
}