{
  "author": "Jerswar",
  "original_created_utc": 1636723561,
  "title": "How instrumental was Heinrich Kramer (author of the Malleus Maleficarum) in kicking off the European witch hysteria? Can it really all be laid at his feet?",
  "created_utc": 1636739304,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>From what I understand, for most of the medieval period the Catholic Church&#39;s official stance was witches didn&#39;t exist. Because suggesting Satan had power on Earth was heretical. Then in 1485, Heinrich Kramer became obsessed with a woman named Helena Scheuberin, when she wouldn&#39;t attend his sermons, and publicly called him an evil man. Kramer got her, and several other women, put on trial for being witches.</p>\n\n<p>Nothing much came of it, but Kramer remained obsessed with witches in general and Helena in particular, to the point that he was accused of insanity.</p>\n\n<p>Kramer got Pope Innocent VIII to write an official bull about the danger posed by witches, and to grant him authority to carry out witch hunts. </p>\n\n<p>Were there factors already in place that Kramer built on? If not, how was this one misogynistic lunatic able to plunge the church into a hysteria that would last for centuries?</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/qsb4ib/how_instrumental_was_heinrich_kramer_author_of/",
  "subreddit": "AskHistorians",
  "id": "qsb4ib",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "From what I understand, for most of the medieval period the Catholic Church's\nofficial stance was witches didn't exist. Because suggesting Satan had power on\nEarth was heretical. Then in 1485, Heinrich Kramer became obsessed with a woman\nnamed Helena Scheuberin, when she wouldn't attend his sermons,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の理解では、中世のほとんどの期間、カトリック教会の\n魔女は存在しない」というのが公式見解でした。なぜなら、サタンが地上で力を持っていることを示唆する\n異端であったからです。1485年、ハインリッヒ・クレイマーは、ヘレナ・ショベリンという女性に夢中になりました。\nヘレナ・ショイベリンという女性に夢中になりました。彼女が彼の説教に参加しなかったので...",
      "title": "ハインリッヒ・クレイマー（『マルルス・マレフィカルム』の著者）は、ヨーロッパの魔女ヒステリーのきっかけにどのように貢献したのか？果たして、すべては彼の足元にあるのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "据我所知，在中世纪的大部分时间里，天主教会的官方立场是女巫不存在。\n的官方立场是女巫并不存在。因为暗示撒旦在地球上有权力\n是异端邪说。然后在1485年，海因里希-克雷默迷恋上了一个叫海伦娜-舍伯的女人\n当她不愿参加他的布道会时... ...",
      "title": "海因里希-克雷默（《马勒戈壁》的作者）在掀起欧洲女巫的歇斯底里中起了多大作用？这一切真的可以归咎于他吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據我所知，在中世紀的大部分時間裏，天主教會的官方立場是女巫不存在。\n的官方立場是女巫並不存在。因爲暗示撒旦在地球上有權力\n是異端邪說。然後在1485年，海因裏希-克雷默迷戀上了一個叫海倫娜-舍伯的女人\n當她不願參加他的佈道會時... ...",
      "title": "海因裏希-克雷默（《馬勒戈壁》的作者）在掀起歐洲女巫的歇斯底里中起了多大作用？這一切真的可以歸咎於他嗎？"
    }
  ]
}