{
  "author": "Homefront325",
  "the_new_excerpt": "Financial Market Pessimism\n\nI have a pessimistic view on the current investment climate for the reasons\nbelow. Please change my mind.\n\n 1. US stocks are expensive. This means they are expected to have lower returns\n    going forward. International stocks look like a better value, but their\n   …",
  "original_created_utc": 1616266670,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "金融市场的悲观情绪\n\n我对目前的投资环境持悲观态度，原因如下\n下面。请改变我的想法。\n\n 1. 美国股票价格昂贵。这意味着它们的预期回报率较低\n    今后。国际股票看起来更有价值，但其。\n   …",
      "title": "金融市场的悲观情绪"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "金融市場的悲觀情緒\n\n我對目前的投資環境持悲觀態度，原因如下\n下面。請改變我的想法。\n\n 1. 美國股票價格昂貴。這意味着它們的預期回報率較低\n    今後。國際股票看起來更有價值，但其。\n   …",
      "title": "金融市場的悲觀情緒"
    }
  ],
  "title": "Financial Market Pessimism",
  "created_utc": 1616324076,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Financial Market Pessimism</p>\n\n<p>I have a pessimistic view on the current investment climate for the reasons below. Please change my mind.</p>\n\n<ol>\n<li><p>US stocks are expensive. This means they are expected to have lower returns going forward. International stocks look like a better value, but their correlation with US equities has been increasing and may not offer the same diversification benefit they once had. Time will tell on this aspect.</p></li>\n<li><p>The US stock market is being propped up by the largest sustained quantitative easing effort ever. If the FED steps off the gas just a little (by raising rates a tiny fraction of a percent) the market will lose its pacifier and become unstable. Look at all the volatility being blamed on increasing bond yields lately. Just imagine if rates are actually raised 25 basis points sometime in the next few years. </p></li>\n<li><p>The FED is about out of ammunition if another economic disaster hits. If the economy is bad, the FED cuts rates. Rates are at historic lows, and the economy is recovering. If we get hit with another recession and rates haven’t been increased, what is the FED going to do? Take them negative? That would be a disaster for anyone holding cash or people who are in late stage retirement at the time. It penalizes saving and incentivizes spending. That’s not something people like to do during a recession. Better start printing more checks or buying up assets (smh).</p></li>\n<li><p>Bond yields are too low to bother with right now, and it is reasonable to expect them to climb as they have been doing. Who wants to buy bonds with a low yield with the expectation that the yield will increase? No one. Suppose yields fall, you may make some gains with price appreciation, but the yield is still awful! </p></li>\n<li><p>Housing prices have soared very quickly. Sure rates are good, but the market is getting expensive and rent collection will still be difficult for many people.</p></li>\n<li><p>Digital monetary forms of exchange cannot be reasonably valued and is pure speculation. Maybe they’ll do well, maybe not. And which ones? It’s not a sure fire thing and should be seen as gambling / speculation and not investing.</p></li>\n<li><p>Precious metals seem to do best when the economy is a dumpster fire. Once the recovery begins and things settle down, they start to lose value as money moves back into stocks. They seem best as a hedge against economic surprises, but not a good asset to just buy and hold long term.</p></li>\n<li><p>Oil and natural gas prices can be easily manipulated by governments and should be avoided.</p></li>\n<li><p>High yield savings accounts and money markets yield next to nothing today but it’s still the safest place to park your money. Inflation will eat away at it over time though but it’s less than watching it all evaporate if a risky investment doesn’t pan out well.</p></li>\n</ol>\n\n<p>In sum, stocks, bonds, real estate, commodities, cash, and digital monetary forms of exchange all have glaring issues to me without much positive going for them. Am I wrong? I’m not the most well versed with the world of investing, but from a rudimentary perspective, it doesn’t look good. You take out low interest rates and the stimulus and you’ll see how fragile this market is. </p>\n\n<p>Despite my concerns, I’m still buying shares in VTWAX every month because that’s my plan, and I’m staying with it.</p>\n</div><!-- SC_ON -->",
  "score": 80,
  "permalink": "/r/investing/comments/m9dmdf/financial_market_pessimism/",
  "subreddit": "investing",
  "id": "m9dmdf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752819525
}