{
  "author": "StonksStink",
  "original_created_utc": 1642616222,
  "title": "My Wife stinks, how do I encourage her to shower more without hurting her feelings?",
  "created_utc": 1642624112,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;She has serious BO issues and doesn’t seem to notice. However I often have to hold my breath when I’m near. She showers once a day and wears deodorant but her smell seems to overpower it all. I’m at a loss because it’s turning me off in a big way and I really don’t wanna upset her. I know if I mention anything I’ll be in the doghouse for months. Please help. Be kind.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 133,
  "permalink": "/r/NoStupidQuestions/comments/s7wjm1/my_wife_stinks_how_do_i_encourage_her_to_shower/",
  "subreddit": "NoStupidQuestions",
  "id": "s7wjm1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "She has serious BO issues and doesn’t seem to notice. However I often have to\nhold my breath when I’m near. She showers once a day and wears deodorant but her\nsmell seems to overpower it all. I’m at a loss because it’s turning me off in a\nbig way and I really don’t wanna upset her. I know if I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼女は深刻なBO問題を抱えているが、気づいていないようだ。しかし、私はしばしば\n近くにいるときは息を止めています。1日1回シャワーを浴び、デオドラント剤をつけていますが\nの臭いに負けてしまうようです。この匂いに負けてしまい、困っています。\n彼女の機嫌を損ねたくはないのです。もし私が...",
      "title": "妻が臭うのですが、どうすれば妻の気持ちを害さずにシャワーを浴びるように勧められるでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "她有严重的BO问题，似乎没有注意到。然而，当我靠近她时，我经常不得不\n当我靠近时，我不得不屏住呼吸。她每天洗一次澡并涂抹除臭剂，但她的\n但她的气味似乎盖过了这一切。我很茫然，因为这让我很反感。\n而我真的不想让她生气。我知道如果我...",
      "title": "我的妻子很臭，我怎样才能鼓励她多洗澡而不伤害她的感情？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "她有嚴重的BO問題，似乎沒有注意到。然而，當我靠近她時，我經常不得不\n當我靠近時，我不得不屏住呼吸。她每天洗一次澡並塗抹除臭劑，但她的\n但她的氣味似乎蓋過了這一切。我很茫然，因爲這讓我很反感。\n而我真的不想讓她生氣。我知道如果我...",
      "title": "我的妻子很臭，我怎樣才能鼓勵她多洗澡而不傷害她的感情？"
    }
  ]
}