{
  "author": "spez",
  "the_new_excerpt": "We would like to give you all an update on the recent issues that have\ntranspired concerning a specific Reddit employee, as well as provide you with\ncontext into actions that we took to prevent doxxing and harassment.\n\nAs of today, the employee in question is no longer employed by Reddit. We built\na…",
  "original_created_utc": 1616625467,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们想向大家介绍一下最近发生的问题的最新情况。\n发生在Reddit某位员工身上的事情，并为您提供\n的背景下，我们采取了行动，以防止doxxing和骚扰。\n\n截至目前，该名员工已不再受雇于Reddit。我们建立了\na…",
      "title": "关于最近围绕Reddit员工的问题的最新情况。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們想向大家介紹一下最近發生的問題的最新情況。\n發生在Reddit某位員工身上的事情，併爲您提供\n的背景下，我們採取了行動，以防止doxxing和騷擾。\n\n截至目前，該名員工已不再受僱於Reddit。我們建立了\na…",
      "title": "關於最近圍繞Reddit員工的問題的最新情況。"
    }
  ],
  "title": "An update on the recent issues surrounding a Reddit employee",
  "created_utc": 1616669302,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We would like to give you all an update on the recent issues that have transpired concerning a specific Reddit employee, as well as provide you with context into actions that we took to prevent doxxing and harassment.</p>\n\n<p>As of today, the employee in question is no longer employed by Reddit. We built a relationship with her first as a mod and then through her contractor work on RPAN. We did not adequately vet her background before formally hiring her. </p>\n\n<p>We’ve put significant effort into improving how we handle doxxing and harassment, and this employee was the subject of both. In this case, we over-indexed on protection, which had serious consequences in terms of enforcement actions. </p>\n\n<ul>\n<li>On March 9th, we added extra protections for this employee, including actioning content that mentioned the employee’s name or shared personal information on third-party sites, which we reserve for serious cases of harassment and doxxing.</li>\n<li>On March 22nd, a news article about this employee was posted by a mod of <a href=\"/r/ukpolitics\">r/ukpolitics</a>. The article was removed and the submitter banned by the aforementioned rules. When contacted by the moderators of <a href=\"/r/ukpolitics\">r/ukpolitics</a>, we reviewed the actions, and reversed the ban on the moderator, and we informed the <a href=\"/r/ukpolitics\">r/ukpolitics</a> moderation team that we had restored the mod.</li>\n<li>We updated our rules to flag potential harassment for human review.</li>\n</ul>\n\n<p>Debate and criticism have always been and always will be central to conversation on Reddit—including discussion about public figures and Reddit itself—as long as they are not used as vehicles for harassment. Mentioning a public figure’s name should not get you banned.</p>\n\n<p>We care deeply for Reddit and appreciate that you do too. We understand the anger and confusion about these issues and their bigger implications. The employee is no longer with Reddit, and we’ll be evolving a number of relevant internal policies.</p>\n\n<p>We did not operate to our own standards here. We will do our best to do better for you.</p>\n</div><!-- SC_ON -->",
  "score": 102112,
  "permalink": "/r/announcements/comments/mcisdf/an_update_on_the_recent_issues_surrounding_a/",
  "subreddit": "announcements",
  "id": "mcisdf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357126543
}