{
  "author": "blastcancer",
  "original_created_utc": 1636241407,
  "title": "Is it me or are white women getting more curvy nowadays?",
  "created_utc": 1636251049,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There&#39;s an elderly boss lady that comes occasionally at my job with glasses. She indeed DOES look like an evil corporate boss lady antagonist from some animated Disney film so if she look like it obv she got the dumpy. She wore those triangle flare pants so I assume she&#39;s a freak on a leash. I feel like white women are stepping their wagon game. There are two others that I&#39;m good with and have big bazaongas too. Is it becoming more common now?</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/TooAfraidToAsk/comments/qoc0wv/is_it_me_or_are_white_women_getting_more_curvy/",
  "subreddit": "TooAfraidToAsk",
  "id": "qoc0wv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There's an elderly boss lady that comes occasionally at my job with glasses. She\nindeed DOES look like an evil corporate boss lady antagonist from some animated\nDisney film so if she look like it obv she got the dumpy. She wore those\ntriangle flare pants so I assume she's a freak on a leash. I feel…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の仕事場には、たまに眼鏡をかけた年配の上司女性が来ます。彼女は\n確かにディズニーのアニメに出てくる悪徳企業の上司のような顔をしています。\nディズニー映画に出てくる悪徳企業の上司のような顔をしています。彼女が履いていたのは\n三角のフレアパンツを履いていたので、彼女は鎖に繋がれた変人だと思います。私は...",
      "title": "最近の白人女性は曲者が多くなってきたと思うのは私だけでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我的工作中，有一位年长的老板娘，偶尔会带着眼镜来。她\n她确实看起来像某个动画片中的邪恶的公司老板娘对立面。\n迪斯尼电影中的邪恶老板娘，所以如果她看起来像的话，肯定是她得了倾销病。她穿了那些\n三角喇叭裤，所以我认为她是一个被拴住的怪人。我觉得...",
      "title": "是我的问题还是现在的白人女性越来越有曲线了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我的工作中，有一位年長的老闆娘，偶爾會帶着眼鏡來。她\n她確實看起來像某個動畫片中的邪惡的公司老闆娘對立面。\n迪斯尼電影中的邪惡老闆娘，所以如果她看起來像的話，肯定是她得了傾銷病。她穿了那些\n三角喇叭褲，所以我認爲她是一個被拴住的怪人。我覺得...",
      "title": "是我的問題還是現在的白人女性越來越有曲線了？"
    }
  ]
}