{
  "author": "wiggyfig",
  "original_created_utc": 1648975529,
  "title": "How do I tell my bf this news?",
  "created_utc": 1648990727,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My bf told me from the very beginning that we will always be living with his mom or she will always be living with us. (I was only 18 and She’s an entitled narcissist who thinks she can’t live without her son) I don’t want to live with this woman. I can’t think of anything unhappier than that, simply hearing her coming into the house talking on the phone bothers me. I want to live alone just him and I when we are financially ready. I currently live at home and he lives with his mom. I need to deliver this news to him because he is talking about marriage and after getting to know his mom for years I now know that I for sure cannot do this. He becomes rageful over really small fights and I fear his reaction to what I’m going to say. He has a very strange attachment to his mom and he is not going to take this well. How can I say this to him in the best way possible?\nEdit: I have posted about this issue before regarding what If I should put up with living with her but this is my first time posting about how I can say this to him.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/TooAfraidToAsk/comments/tv4tw0/how_do_i_tell_my_bf_this_news/",
  "subreddit": "TooAfraidToAsk",
  "id": "tv4tw0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My bf told me from the very beginning that we will always be living with his mom\nor she will always be living with us. (I was only 18 and She’s an entitled\nnarcissist who thinks she can’t live without her son) I don’t want to live with\nthis woman. I can’t think of anything unhappier than that,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私のボーイフレンドは、最初から、私たちは常に彼の母親と一緒に住んでいると言いました。\nあるいは、彼女はいつも私たちと一緒に暮らしています。(私はまだ18歳で、彼女は権利のある\n息子なしには生きていけないと考えるナルシスト）一緒に暮らしたくないんです。\nこの女は これ以上不幸なことはないと思う、、、。",
      "title": "このニュース、どうやってBfに伝えたらいいんだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的男朋友从一开始就告诉我，我们将永远和他妈妈一起生活。\n或者她会一直和我们一起生活。(我当时只有18岁，她是一个有权利的\n她是一个有权利的自恋者，认为她不能没有她的儿子。\n这个女人。我想不出有什么比这更不快乐的了，...",
      "title": "我如何告诉我的男朋友这个消息呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的男朋友從一開始就告訴我，我們將永遠和他媽媽一起生活。\n或者她會一直和我們一起生活。(我當時只有18歲，她是一個有權利的\n她是一個有權利的自戀者，認爲她不能沒有她的兒子。\n這個女人。我想不出有什麼比這更不快樂的了，...",
      "title": "我如何告訴我的男朋友這個消息呢？"
    }
  ]
}