{
  "author": "gxstay",
  "original_created_utc": 1651968622,
  "title": "My girlfriend goes on 24-48hr long drug &amp; alcohol benders &amp; I don't know how I feel about it?",
  "created_utc": 1651977786,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll go out for drinks with my girlfriend, well have fun then she would generally want to stay out. At about 3-3:30am, I&amp;#39;ll go home to bed, I feel like that&amp;#39;s a solid night &amp;amp; she would choose to stay out because she doesn&amp;#39;t want the night to end. She&amp;#39;s already been drinking heaps of alcohol &amp;amp; taking lines to stay awake. She&amp;#39;ll end up with a group of 5-6 people kicking on at someone&amp;#39;s place &amp;amp; keep going to someone else&amp;#39;s place to continue taking lines, talking &amp;amp; drinking with 3 other guys until the afternoon or night the next day. &lt;/p&gt;\n\n&lt;p&gt;She did this last night, I didn&amp;#39;t want to go out but she did so I got changed, went out for a dance &amp;amp; made sure I had fun even though I wasn&amp;#39;t feeling like being out because I think that&amp;#39;s compromising in a relationship &amp;amp; want her to have the best time always, but she continued on to a bender. I told her I wouldn&amp;#39;t do that in a relationship &amp;amp; wasnt a fan of her doing it but she just went on with it &amp;amp; I&amp;#39;ve never been the one to force anything on anyone or stop them from doing that they want. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not a fan of this in a relationship at all, I would just never do that if she went home or wasnt coming with me. I&amp;#39;d have maybe a couple more drinks after she went &amp;amp; respectfully go home to my own place soon after if it was late. I&amp;#39;d go on a bender only if she was involved. &lt;/p&gt;\n\n&lt;p&gt;Am I being uptight or wrong to feel off about it? Do I have grounds to not be okay with it even though I know nothing would ever happen? &lt;/p&gt;\n\n&lt;p&gt;Note, we don&amp;#39;t live together, so when I go home I go back to my place when it&amp;#39;s late &amp;amp; she goes to hers. &lt;/p&gt;\n\n&lt;p&gt;I trust her completely &amp;amp; have 100% confidence, zero doubts with her when she&amp;#39;s out. Like I&amp;#39;m genuinely glad she&amp;#39;s having fun but times when she&amp;#39;s needed to go home &amp;amp; I&amp;#39;ve wanted to stay out, I&amp;#39;ve gone home with her because I just wouldn&amp;#39;t do that to her.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 307,
  "permalink": "/r/NoStupidQuestions/comments/ukpvwr/my_girlfriend_goes_on_2448hr_long_drug_alcohol/",
  "subreddit": "NoStupidQuestions",
  "id": "ukpvwr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'll go out for drinks with my girlfriend, well have fun then she would\ngenerally want to stay out. At about 3-3:30am, I'll go home to bed, I feel like\nthat's a solid night & she would choose to stay out because she doesn't want the\nnight to end. She's already been drinking heaps of alcohol &…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼女と飲みに行く、まあ楽しめればいい。\nをする。午前3時〜3時半くらいになると、家に帰って寝ます。\n彼女は夜が明けるのを嫌がるので、外泊を選ぶだろう。\n夜が明けるのが嫌で外泊を選ぶような気がする。彼女はすでにお酒を山ほど飲んでいて...",
      "title": "私のガールフレンドは、24〜48時間の長いドラッグ＆アルコールベンダーに行く＆＆私はそれについてどのように感じているのか分からない？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和我的女朋友出去喝酒，玩得很开心，然后她会\n一般来说，她会想留在外面。大约在凌晨3-3:30，我就会回家睡觉，我觉得\n这就是一个坚实的夜晚，她会选择留在外面，因为她不想让这个夜晚结束。\n夜晚结束。她已经喝了大量的酒，而且...",
      "title": "我的女朋友会在24-48小时内吸毒和酗酒，我不知道我的感受如何？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和我的女朋友出去喝酒，玩得很開心，然後她會\n一般來說，她會想留在外面。大約在凌晨3-3:30，我就會回家睡覺，我覺得\n這就是一個堅實的夜晚，她會選擇留在外面，因爲她不想讓這個夜晚結束。\n夜晚結束。她已經喝了大量的酒，而且...",
      "title": "我的女朋友會在24-48小時內吸毒和酗酒，我不知道我的感受如何？"
    }
  ]
}