{
  "author": "Set1Less",
  "original_created_utc": 1649836191,
  "title": "Warning for Indian users: If you have used a Centralised exchange (WazirX, CoinDCX, BitBNS etc) in the past, they have turned over all your information to the government in violation of your privacy. People are now getting notices. Beware",
  "created_utc": 1649921902,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If you have used CEX in the past, they have already turned over the data of all their users to the government. So far, WazirX, Coin DCX, BitBNS, Zebpay etc have done so, and the government is in possession of all your details from ID cards/names/PAN/Adhaar associated with the accounts, to all your wallet addresses. &lt;/p&gt;\n\n&lt;p&gt;People are already getting notices asking to explain their crypto activity, and being asked to submit all evidence including all your bank statements from several past years. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/40tai0pp29t81.jpg?width=960&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=ea198479789d684ebf52a576c01160286afb2877\"&gt;Examples of notices&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/up57d66r29t81.jpg?width=960&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=3dae9f55b8614a35b1f4683685743a6db58a2e86\"&gt;Questions asked...&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The govt is asking you to explain all your crypto activities and track all your wallets. &lt;/p&gt;\n\n&lt;p&gt;These activities are an illegal exercise conducted by the government where the centralised exchanges are playing along, violating the right to privacy of citizens. The law protects people against unauthorised searches and seizures, without any warrant. Users of CEX are not performing any illegal activity, and there is no probable cause to effect seizure of everyone&amp;#39;s data. Yet the CEX have happily turned over people&amp;#39;s data to the government, who is now coming after crypto traders. &lt;/p&gt;\n\n&lt;p&gt;It is possible that one or two users may engage in illegal activity, but that does not allow the government to seize everyone&amp;#39;s data under suspicion. These are draconian violations of privacy.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/CryptoCurrency/comments/u2l2uw/warning_for_indian_users_if_you_have_used_a/",
  "subreddit": "CryptoCurrency",
  "id": "u2l2uw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If you have used CEX in the past, they have already turned over the data of all\ntheir users to the government. So far, WazirX, Coin DCX, BitBNS, Zebpay etc have\ndone so, and the government is in possession of all your details from ID\ncards/names/PAN/Adhaar associated with the accounts, to all your…"
}