{
  "author": "DuePanini",
  "the_new_excerpt": "I started investing back in march of 2020 when the market was tanking. I had no\nidea what I was doing. Although, I did know a little about ETFs. So I decided to\nbuy VTI and a couple of other ETFs at around the $120/$200mark. With some\nleftover cash, I pumped money into stocks that I read in news…",
  "original_created_utc": 1614729247,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我早在2020年3月就开始投资，当时市场正处于水深火热之中。我没有\n知道我在做什么。虽然，我对ETF有一点了解。所以我决定\n买VTI和其他几个ETF在120美元/200美元左右的标志。随着一些\n剩余的现金，我把钱注入了我在新闻上看到的股票... ...",
      "title": "暂停投资"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我早在2020年3月就開始投資，當時市場正處於水深火熱之中。我沒有\n知道我在做什麼。雖然，我對ETF有一點了解。所以我決定\n買VTI和其他幾個ETF在120美元/200美元左右的標誌。隨着一些\n剩餘的現金，我把錢注入了我在新聞上看到的股票... ...",
      "title": "暫停投資"
    }
  ],
  "title": "Taking a break from investing",
  "created_utc": 1614743465,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I started investing back in march of 2020 when the market was tanking. I had no idea what I was doing. Although, I did know a little about ETFs. So I decided to buy VTI and a couple of other ETFs at around the $120/$200mark. With some leftover cash, I pumped money into stocks that I read in news articles. That&#39;s right, I would look up &quot;the best stocks of march 2020&quot; and basically buy the first thing on the list on some random article. I guess I got lucky and made about 4k - a 30% return overall. </p>\n\n<p>Then comes GME, BB, AMC, etc. I basically lost about $2500 total because of FOMO. That chewed up a lot of my profits, but it was okay because it was money I could lose. I&#39;m glad that it wasn&#39;t worse. It was a huge eye-opener though because I realized that I had around 5-8k in certain stocks that I did absolutely 0 research on besides using the google search bar. Likely these investments could&#39;ve dropped to 0 but thankfully didn&#39;t.</p>\n\n<p>The moment I lost that amount of money on the speculative stocks, I liquidated all my positions except for some ETFs. It didn&#39;t matter if I was up or if the stock was likely to get gain xx%. I decided that as a DYI investor, I needed to understand fundamentals: reading and analyzing statements, industrial comparison, etc. I also needed to have a general understanding of the economy, and maybe even understand Technical Analysis. I needed to become a prudent investor and not invest unless I understood every aspect of the company. </p>\n\n<p>I missed out on a lot of gains these past X months (besides my ETFs), but I have no regrets. I will continue learning each and every day until I&#39;m confident enough to invest again. Even then I could lose money but at least I&#39;ll know I tried my best. I would also like to encourage anyone else that doesn&#39;t have a sense of what&#39;s going on to take a step to the side and look at the situation. If you are reading someone&#39;s DD and 1/2 of the terms don&#39;t make sense, it&#39;s probably a good idea to take a step to the side to learn about them before doing blind investing (gambling).</p>\n</div><!-- SC_ON -->",
  "score": 79,
  "permalink": "/r/stocks/comments/lwg1pw/taking_a_break_from_investing/",
  "subreddit": "stocks",
  "id": "lwg1pw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937744945
}