{
  "author": "SerFoxworth",
  "original_created_utc": 1641149328,
  "title": "Why do so many weed smokers seem to have a need to flaunt it/make it intrinsic to their identity?",
  "created_utc": 1641207255,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I realize there is far more that don&amp;#39;t. And I have nothing against smoking, it just seems odd to me.&lt;/p&gt;\n\n&lt;p&gt;EDIT: thankyou all for your time responding, I have learned a fair bit thanks to you all sharing your opinions and experiences. It seems it is mainly due to a mixture of the legalization of smoking,young folk still finding themselves, and me simply sharing interests with them,that it seemed so prevalent to me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 519,
  "permalink": "/r/TooAfraidToAsk/comments/rugano/why_do_so_many_weed_smokers_seem_to_have_a_need/",
  "subreddit": "TooAfraidToAsk",
  "id": "rugano",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I realize there is far more that don't. And I have nothing against smoking, it\njust seems odd to me.\n\nEDIT: thankyou all for your time responding, I have learned a fair bit thanks to\nyou all sharing your opinions and experiences. It seems it is mainly due to a\nmixture of the legalization of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そうでない人の方が圧倒的に多いと実感しています。タバコを吸うことに反対はしません。\nが、私には奇妙に思えるのです。\n\n編集部：お忙しい中、ご回答いただきありがとうございます。\n皆様のご意見、ご経験をお聞かせください。どうやら主な原因は\n合法化され、さらに...",
      "title": "なぜ多くの葉っぱを吸う人は、それを誇示したり、自分のアイデンティティに内在させたりする必要があるように見えるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我意识到不吸烟的人要多得多。我并不反对吸烟，只是\n只是我觉得很奇怪。\n\n编辑：感谢大家抽出时间来回答，我学到了不少东西，这要归功于\n你们分享你们的意见和经验。看来这主要是由于\n合法化的混合...",
      "title": "为什么这么多吸食大麻的人似乎有必要炫耀它/让它成为他们身份的内在因素？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我意識到不吸菸的人要多得多。我並不反對吸菸，只是\n只是我覺得很奇怪。\n\n編輯：感謝大家抽出時間來回答，我學到了不少東西，這要歸功於\n你們分享你們的意見和經驗。看來這主要是由於\n合法化的混合...",
      "title": "爲什麼這麼多吸食大麻的人似乎有必要炫耀它/讓它成爲他們身份的內在因素？"
    }
  ]
}