{
  "author": "shackleton__",
  "the_new_excerpt": "Many years ago my high school history teacher mentioned that the Temperance\nMovement gained widespread acceptance and membership among women due to\nextremely high rates of alcoholism (and therefore drunken domestic violence) in\npre-Prohibition America. I believe he also mentioned that rates of…",
  "original_created_utc": 1623966175,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昔、高校の歴史の先生がテンペランス運動は女性の間で広まったと言っていました。\n運動が女性の間で広く受け入れられ、会員になったのは\n禁酒法時代のアメリカでは、アルコール依存症の割合が非常に高かったため、女性の間で広く受け入れられ、会員になったのです。\n禁酒法以前のアメリカでは、アルコール依存症（したがって、飲酒による家庭内暴力）の割合が非常に高かったため、女性の間で広く受け入れられ、会員になったと述べていた。禁酒法時代のアメリカでは、アルコール依存症の割合が非常に高かったため、女性の間でテンペランス運動が広く受け入れられ、会員になったということでした。",
      "title": "アメリカの禁酒運動は、個人的な「道徳的実践」と公共政策の変更の両方を唱えた女性と強く結びついています。その背景には、アルコール依存症による家庭内暴力があったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "许多年前，我的高中历史老师提到，节制运动在妇女中获得了广泛的认可。\n运动在妇女中获得了广泛的接受和会员资格，原因是\n在禁酒令实施前的美国，酗酒率极高（因此也是醉酒的家庭暴力）。\n在禁酒令之前的美国，酗酒率极高（因此也是醉酒后的家庭暴力），因此在妇女中获得了广泛的接受和加入。我相信他还提到，在美国，酗酒的比例是非常高的。",
      "title": "美国的节制运动与倡导个人 \"道德实践 \"和改变公共政策的妇女密切相关。这种参与在很大程度上是由与酒精中毒有关的家庭虐待所驱动的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "許多年前，我的高中歷史老師提到，節制運動在婦女中獲得了廣泛的認可。\n運動在婦女中獲得了廣泛的接受和會員資格，原因是\n在禁酒令實施前的美國，酗酒率極高（因此也是醉酒的家庭暴力）。\n在禁酒令之前的美國，酗酒率極高（因此也是醉酒後的家庭暴力），因此在婦女中獲得了廣泛的接受和加入。我相信他還提到，在美國，酗酒的比例是非常高的。",
      "title": "美國的節制運動與倡導個人 \"道德實踐 \"和改變公共政策的婦女密切相關。這種參與在很大程度上是由與酒精中毒有關的家庭虐待所驅動的嗎？"
    }
  ],
  "title": "The Temperance Movement in the US is strongly associated with women who championed both personal \"moral practices\" and changes to public policy. Was this involvement significantly driven by alcoholism-related domestic abuse?",
  "created_utc": 1624027938,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Many years ago my high school history teacher mentioned that the Temperance Movement gained widespread acceptance and membership among women due to extremely high rates of alcoholism (and therefore drunken domestic violence) in pre-Prohibition America. I believe he also mentioned that rates of alcoholism in the US were permanently diminished by Prohibition, despite the policy&#39;s other failings. Is this true?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/o28p9v/the_temperance_movement_in_the_us_is_strongly/",
  "subreddit": "AskHistorians",
  "id": "o28p9v",
  "is_self": true,
  "media": null,
  "is_video": false
}