{
  "author": "LicoriceAddict",
  "original_created_utc": 1632663434,
  "title": "Is it wrong/weird to not follow the news, for the sake of your own mental health?",
  "created_utc": 1632675381,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve gradually stopped following the news over the past few years. I scan headlines occasionally, but that&#39;s about it.</p>\n\n<p>I have my own problems to deal with. Following the news just increases my anxiety and isn&#39;t enjoyable to me. For the sake of my own mental health, I&#39;ve stopped.</p>\n\n<p>It&#39;s not that I turn a blind eye to what&#39;s going on, I just want to focus on my own life.</p>\n\n<p>Is this strange? Is it a bad thing?</p>\n</div><!-- SC_ON -->",
  "score": 131,
  "permalink": "/r/TooAfraidToAsk/comments/pvtzl3/is_it_wrongweird_to_not_follow_the_news_for_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "pvtzl3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've gradually stopped following the news over the past few years. I scan\nheadlines occasionally, but that's about it.\n\nI have my own problems to deal with. Following the news just increases my\nanxiety and isn't enjoyable to me. For the sake of my own mental health, I've\nstopped.\n\nIt's not that I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここ数年、徐々にニュースを追わなくなってきました。たまに見出しに目を通すことはあっても\nたまにヘッドラインに目を通しますが、それだけです。\n\n自分自身の問題に対処しなければならないからです。ニュースを追うことは、私の不安を増大させるだけで\n不安が増すばかりで、楽しくありません。自分の心の健康のために、もうやめました。\nやめました。\n\n別に...",
      "title": "自分の心の健康のために、ニュースを追わないことは間違っている／変なことなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的几年里，我逐渐不再关注新闻。我偶尔扫描一下\n头条新闻，但仅此而已。\n\n我有自己的问题要处理。关注新闻只会增加我的\n焦虑，对我来说并不愉快。为了我自己的心理健康，我已经\n停止了。\n\n这并不是说我...",
      "title": "为了自己的心理健康，不关注新闻是错误/奇怪的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的幾年裏，我逐漸不再關注新聞。我偶爾掃描一下\n頭條新聞，但僅此而已。\n\n我有自己的問題要處理。關注新聞只會增加我的\n焦慮，對我來說並不愉快。爲了我自己的心理健康，我已經\n停止了。\n\n這並不是說我...",
      "title": "爲了自己的心理健康，不關注新聞是錯誤/奇怪的嗎？"
    }
  ]
}