{
  "author": "ProStrats",
  "the_new_excerpt": "Workhorse Group (WKHS) As of today, it is shorted at nearly 42% of float. This\nseems to me to be the next runner from AMC and GME.\n\nBoth GME and AMC were hugely shorted previously when the rallies started, and\nnow that short interest has decreased. It still is there but has decreased and\nthat's why…",
  "original_created_utc": 1622740294,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Workhorse Group (WKHS) 本日現在、浮動株の約42％でショートしています。これは\nAMCとGMEの次のランナーのように思えます。\n\nGMEもAMCも、以前ラリーが始まったときに大量のショートを抱えていました。\n今はその空売りが減っています。まだあるけど、減った。\nだからこそ...",
      "title": "WKHSが最も大きく空売りされている銘柄、6/3/21"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Workhorse Group (WKHS)截至今天，其被做空的比例接近42%的流通量。这\n在我看来，这是继AMC和GME之后的又一个跑者。\n\nGME和AMC之前在涨势开始时都被大量做空，而现在做空的人已经减少。\n现在空头兴趣已经减少。它仍然存在，但已经减少，这就是为什么\n这就是为什么...",
      "title": "WKHS是被做空最严重的股票，6/3/21"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Workhorse Group (WKHS)截至今天，其被做空的比例接近42%的流通量。這\n在我看來，這是繼AMC和GME之後的又一個跑者。\n\nGME和AMC之前在漲勢開始時都被大量做空，而現在做空的人已經減少。\n現在空頭興趣已經減少。它仍然存在，但已經減少，這就是爲什麼\n這就是爲什麼...",
      "title": "WKHS是被做空最嚴重的股票，6/3/21"
    }
  ],
  "title": "WKHS is the most heavily shorted stock, 6/3/21",
  "created_utc": 1622817283,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Workhorse Group (WKHS) As of today, it is shorted at nearly 42% of float. This seems to me to be the next runner from AMC and GME. </p>\n\n<p>Both GME and AMC were hugely shorted previously when the rallies started, and now that short interest has decreased. It still is there but has decreased and that&#39;s why I think we&#39;ve seen momentum change.</p>\n\n<p>Today, AMC took a massive hit due to the company offering nearly 12 million stocks for purchase which hurt many peoples wins and likely some that hasn&#39;t invested sooner. \nEdit: this above paragraph apparently is inaccurate, it was misinformation posted on a news article today that was misleading. Apparently there was no selloff.\nEdit 2: renig here. Apparently it is confirmed that the 11.5millipn shares were selling today, which naturally would&#39;ve contributed to the amc sell off. Multiple news outlets I&#39;ve found state the same not referencing any April date. This is a discussion post. This is the most up to date and accurate info I can seem to find.</p>\n\n<p>I expect GME and AMC will likely both continue to increase if stocks are held. But based on short interest alone, it would seem to me that WKHS is next in line for the biggest squeeze meaning it has the biggest short term gains to be had.</p>\n\n<p>WKHS was trading for around $10-$11 yesterday and is nearly $15/share currently.</p>\n\n<p>Thoughts?</p>\n</div><!-- SC_ON -->",
  "score": 1562,
  "permalink": "/r/wallstreetbets/comments/nrik0e/wkhs_is_the_most_heavily_shorted_stock_6321/",
  "subreddit": "wallstreetbets",
  "id": "nrik0e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404890218
}