{
  "author": "JorgeJorgunsun",
  "the_new_excerpt": "Remember when we said, “What if Robinhood started trading paper Bitcoin without\nholding actual Bitcoin?”. This is what happens when a dishonest company needs\nmore capital fast and the chances of your RH BTC positions being\nnon-collateralized have literally never been higher. Further, the chances of…",
  "original_created_utc": 1612013044,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "还记得我们说过，\"如果Robinhood开始交易纸质比特币，而不需要...\n持有实际的比特币？\". 这就是一个不诚实的公司需要的情况。\n更多的资本快速和你的RH BTC仓位的机会被。\n非抵押品的几率简直是前所未有的高。此外，...",
      "title": "警告: 趁你还能用的时候, 把你的Bitcoin从Robinhood中拿出来!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "還記得我們說過，\"如果Robinhood開始交易紙質比特幣，而不需要...\n持有實際的比特幣？\". 這就是一個不誠實的公司需要的情況。\n更多的資本快速和你的RH BTC倉位的機會被。\n非抵押品的機率簡直是前所未有的高。此外，...",
      "title": "警告: 趁你還能用的時候, 把你的Bitcoin從Robinhood中拿出來!"
    }
  ],
  "title": "Warning: Get your Bitcoin out of Robinhood while you still can!",
  "created_utc": 1612021309,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Remember when we said, “What if Robinhood started trading paper Bitcoin without holding actual Bitcoin?”. This is what happens when a dishonest company needs more capital fast and the chances of your RH BTC positions being non-collateralized have literally never been higher. Further, the chances of RH failing as a company have never been higher.</p>\n\n<p>Look into the faces of the young CEOs who made their fortunes by deceiving retail investors and selling them out via order flow. Do you really want to let these guys hold your BTC?</p>\n\n<p>For the next 24 hours I will personally answer any questions that any of you may have about liquidating your RH positions and getting into a real exchange or decentralized marketplace (like BISQ)</p>\n\n<p>Do the right thing because it’s also the smart thing and because you low key always knew you should have been</p>\n</div><!-- SC_ON -->",
  "score": 16738,
  "permalink": "/r/Bitcoin/comments/l8lmgq/warning_get_your_bitcoin_out_of_robinhood_while/",
  "subreddit": "Bitcoin",
  "id": "l8lmgq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518523386
}