{
  "author": "ShungiteBot",
  "original_created_utc": 1633704887,
  "title": "The Official Shiba Inu Discord is Brigading Posts here, giving Positive Posts 1000s of Points: Do not Trust random Reddit Posts about Cryptos",
  "created_utc": 1633725225,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The official Shiba Inu Discords is sharing links to posts here, heavily brigading them and creating the illusion of agreement by the community.</p>\n\n<p>These are <em>not</em> random people on the officially SHIB developer endorsed Discords, but their own staff pushing people to positively comment and upvote the posts.</p>\n\n<p>This includes, as example, the post about stopping being butthurt about people making money off SHIB</p>\n\n<p>They also call on brigading people being critical on SHIB, and link to their own comments on their discord and call for support.</p>\n\n<p>But this post is not only about SHIB, you should never buy a crypto only because a community heavily favors it or randomly endorses is, this is the best example for it.</p>\n\n<p>Based on information by <a href=\"/u/offcialnewmonville\">u/offcialnewmonville</a></p>\n</div><!-- SC_ON -->",
  "score": 202,
  "permalink": "/r/CryptoCurrency/comments/q3ze33/the_official_shiba_inu_discord_is_brigading_posts/",
  "subreddit": "CryptoCurrency",
  "id": "q3ze33",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The official Shiba Inu Discords is sharing links to posts here, heavily\nbrigading them and creating the illusion of agreement by the community.\n\nThese are not random people on the officially SHIB developer endorsed Discords,\nbut their own staff pushing people to positively comment and upvote the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "柴犬公式ディスコードは、ここの投稿へのリンクを共有し、大きく\nコミュニティの同意を得ているように見せかけています。\n\nこれはSHIBAの開発者が承認したDiscordsにいるランダムな人たちではありません。\n積極的にコメントしたり、upvoteしたりするようにスタッフが働きかけているのです...",
      "title": "Official Shiba Inu Discord is Brigading Posts here, giving positive posts of 1000s of points: 暗号に関するランダムなRedditの投稿を信用してはいけない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "官方的Shiba Inu Discords在这里分享帖子的链接，对它们进行大量的\n夸大其词，制造社区同意的假象。\n\n这些不是SHIB官方开发者认可的Discords上的随机人员。\n而是他们自己的工作人员在推动人们积极评论和加注...。",
      "title": "Shiba Inu的官方讨论区正在对这里的帖子进行评级，给积极的帖子提供1000分。不要相信Reddit上关于加密货币的随机帖子"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "官方的Shiba Inu Discords在這裏分享帖子的鏈接，對它們進行大量的\n誇大其詞，製造社區同意的假象。\n\n這些不是SHIB官方開發者認可的Discords上的隨機人員。\n而是他們自己的工作人員在推動人們積極評論和加註...。",
      "title": "Shiba Inu的官方討論區正在對這裏的帖子進行評級，給積極的帖子提供1000分。不要相信Reddit上關於加密貨幣的隨機帖子"
    }
  ]
}