{
  "author": "jennycryptolady",
  "original_created_utc": 1634165068,
  "title": "Is anyone else relying on BTC to lift them out of a life of low-paying jobs and limited future prospects??",
  "created_utc": 1634185871,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For a start, I only invested what I can &quot;afford to lose&quot; so to speak. So\nI wouldn&#39;t be in debt if it went to $0 tomorrow or anything. But I did\nput a big chunk of hard earned savings into BTC and some alt coins\nduring the last big dip simply because I truly believe that it has a big\nfuture and will therefore one day enable me to buy a mortgage-free\nproperty..... Any one else in a similar situation?</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/Bitcoin/comments/q7mkap/is_anyone_else_relying_on_btc_to_lift_them_out_of/",
  "subreddit": "Bitcoin",
  "id": "q7mkap",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For a start, I only invested what I can \"afford to lose\" so to speak. So I\nwouldn't be in debt if it went to $0 tomorrow or anything. But I did put a big\nchunk of hard earned savings into BTC and some alt coins during the last big dip\nsimply because I truly believe that it has a big future and will…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず第一に、私はいわば「失っても大丈夫」な額しか投資しませんでした。だから\n明日0円になっても借金はしない。しかし、私は稼いだ貯蓄の大部分をBTCといくつかのアルトコインに投入しました。\n稼いだお金の大部分をBTCといくつかのアルトコインに投入しました。\nなぜなら、BTCには大きな未来があり、将来的には...と心から信じているからです。",
      "title": "低賃金の仕事や将来の見通しが立たない生活から抜け出すために、BTCに頼っている人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我只投资我能够 \"承受得起的损失\"，可以这么说。所以我\n所以，如果它明天变成0美元或其他什么，我也不会有债务。但我确实把一大块\n大块辛苦赚来的积蓄投入到BTC和一些替代币中，在上次大跌的时候\n只是因为我真的相信它有一个很大的未来，并且会...",
      "title": "还有人依靠BTC使他们摆脱了低薪工作和有限的未来前景的生活吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我只投資我能夠 \"承受得起的損失\"，可以這麼說。所以我\n所以，如果它明天變成0美元或其他什麼，我也不會有債務。但我確實把一大塊\n大塊辛苦賺來的積蓄投入到BTC和一些替代幣中，在上次大跌的時候\n只是因爲我真的相信它有一個很大的未來，並且會...",
      "title": "還有人依靠BTC使他們擺脫了低薪工作和有限的未來前景的生活嗎？"
    }
  ]
}