{
  "author": "llovemoney",
  "original_created_utc": 1648921019,
  "title": "I'M ALL IN: Bitcoin &amp; The Exponential Age.",
  "created_utc": 1648954064,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Thesis: Bitcoin will forever be the currency of the internet.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This write up will contain information about &lt;strong&gt;where we are in the world&lt;/strong&gt;, the &lt;strong&gt;role Bitcoin will play&lt;/strong&gt; in it, and most fun - &lt;strong&gt;Price Predictions!&lt;/strong&gt; I&amp;#39;ve spent over 1000 hours trying to wrap my head around this revolution. &lt;strong&gt;Let&amp;#39;s begin.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The Internet has changed the world forever in such a small period of time. People forget the internet became a global sensation only in the &lt;strong&gt;1990s&lt;/strong&gt;, and look how far it&amp;#39;s come.&lt;/p&gt;\n\n&lt;p&gt;The entire &lt;strong&gt;WORLD&lt;/strong&gt; now runs on the internet, and &lt;strong&gt;WILL&lt;/strong&gt; continue to run on the internet.&lt;/p&gt;\n\n&lt;p&gt;We are currently living in &lt;strong&gt;&lt;em&gt;The Exponential Age&lt;/em&gt;&lt;/strong&gt; at this point in history. Technology is evolving the world at a rate faster than ever before in HISTORY. Simply put, the world is moving at light speed.&lt;/p&gt;\n\n&lt;p&gt;Shown in the graph below, the internet is the fastest developing idea/product in the entire world.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/cranvt6775r81.jpg?width=823&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=8ad30bdb8abaf44bbbba9e27180f497a50976908\"&gt;The Exponential Age&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;As a comparison, the distance of time between the creation of the Light Bulb and invention of the Internet is approximately &lt;strong&gt;143 years apart.&lt;/strong&gt; The difference between the creation and Internet and Automated Self Driving Cars (FSD) is only is only approximately &lt;strong&gt;30 years apart.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Please let that sink in how complex it is to create AI vehicles that humans can trust to bring them to their needed destinations. Only 50 years before that we never could have even dream how to build such an idea.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;That one idea is only one of millions of innovations that&amp;#39;s happened in the past couple decades.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The internet has exponentially been solving problems since inception. Examples such as Social Media, Smart Phones, Artificial Intelligence have given the world a new way to connect, and forever interact with the digital world at large.&lt;/p&gt;\n\n&lt;p&gt;We are at a stage in technology where the internet has a literal voice. The internet is becoming an everyday citizen of the world. Check out &amp;quot;Sophia&amp;quot; the robot!&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/7z9x1kle75r81.png?width=711&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=50386a1c133ca4a5401936256940193d8bd40212\"&gt;Sophia!&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Now that we&amp;#39;ve explained The Exponential Age, where does &lt;strong&gt;Bitcoin&lt;/strong&gt; fit in?&lt;/p&gt;\n\n&lt;p&gt;Bitcoin was created by an &lt;strong&gt;unknown person&lt;/strong&gt; who went by the name &amp;quot;Satoshi Nakamoto&amp;quot; on January 3rd, 2009.  &lt;strong&gt;Satoshi&amp;#39;s vision&lt;/strong&gt; was to create the first EVER proper form of &lt;strong&gt;Digital Money.&lt;/strong&gt; This Digital Money needed to have a fixed supply, be secure, and permissionless. With &lt;strong&gt;Bitcoin&lt;/strong&gt;, there is not a  single person in the &lt;strong&gt;world&lt;/strong&gt; that has the power to turn the system off, alter or block a transaction, or alter the max supply of this new currency.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;System never turns off&lt;/strong&gt;: Digital Money that runs 24/7 for the rest of Human and AI&amp;#39;s total existence.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Be Secure&lt;/strong&gt;: It is impossible to exploit the network, change the network, or devalue the network.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Fixed Supply&lt;/strong&gt;: It is mathematically impossible to devalue the money against itself. There is no inflation.&lt;/p&gt;\n\n&lt;p&gt;On &lt;strong&gt;Dec. 13, 2010,&lt;/strong&gt; Satoshi officially resigned from working on Bitcoin and handed the project off to the world to complete. Bitcoin&amp;#39;s core values had already been set, and it was up to the world to keep it safe, secure, and forever running.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Fast forward to today, Bitcoin is running flawlessly, and is absolutely thriving in adoption. Nobody knows who Satoshi is today, or if he&amp;#39;s even alive.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Currently, Bitcoin usage is growing at an exponential rate, as information about it and it’s ease of access is taking the world by storm. Check out this chart displaying how the Bitcoin adoption is growing at the same speed as the adoption of the Internet. We&amp;#39;ve already hit a $50,000 BTC in 2021!&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/jz8ygjrf85r81.png?width=742&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=16f2cf261ab4ca05369b9bba49f476ba1bd05553\"&gt;Internet Adoption VS 2020 BTC Price&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;We can also see the Bitcoin number of Active Addresses (Users/Wallets) increasing exponentially as the price rises (bringing more attention to the asset)&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/13wptisk85r81.png?width=750&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=0bef9acec8c845d93d742583340dd88876a4ba45\"&gt;Active Users vs BTC Price&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Adoption is moving fast. But why does the world even need Bitcoin anyways?&lt;/p&gt;\n\n&lt;p&gt;The world technically &lt;strong&gt;revolves&lt;/strong&gt; around Money. Money and economic incentives drive the world to be forever evolving space, as well as allow us to earn resources needed to live. Currently, the entire world is being plagued by money that is being devalued, assets that are being inflated, and people who are losing faith in the current system. People are getting desperate, they’re looking for an alternative, it’s getting bad.&lt;/p&gt;\n\n&lt;p&gt;Bitcoin is the solution to these peoples problem, and very fast are many starting to notice. If you&amp;#39;re reading this in 2022, check how &lt;strong&gt;EARLY&lt;/strong&gt; we are, and how exponential we are about to grow. Congratulations to all BTC holders out there. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/qn8z2e3r95r81.png?width=649&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=1a6b9c383aff593ff1505f1e98f1ffa344e2904c\"&gt;It&amp;#39;s about to get crazy.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Billionaires are buying it, country’s are adopting it as an official currency, the US government is accepting it for tax payments, and the world is trying to go greener to acquire it. The list goes on. This is all happening within a short decade. The demand for Bitcoin will only continue to accelerate from here. &lt;/p&gt;\n\n&lt;p&gt;The toothpaste cannot be put back in the tube. Bitcoin is taking the world by surprise and there is no stopping it. The world’s finally taking advantage of this fair, secure, and incorruptible money. The world is learning to store its wealth on the Bitcoin network. It is a &lt;strong&gt;black hole&lt;/strong&gt; sucking up the world&amp;#39;s corrupt, controlling, and unlimited supply of Government money. &lt;strong&gt;People are taking back control of what hard earned money is all about.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Bitcoin is digital gold, it is financial freedom, and it is the future of economic energy.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Theoretically, because Government money has an unlimited supply, the price of Dollars per Bitcoin can go to infinity when compared to it as Bitcoin has a max supply. So why do we want to get in early?&lt;/p&gt;\n\n&lt;p&gt;The reality is, governments cannot stop printing money. It is impossible to stop printing money, and with Bitcoin having a forever fixed supply of 21 million coins, it mathematically will 100% continue to rise in value against a currency that has a maximum supply of infinity, assuming there is demand for Bitcoin. (The strongest currency)&lt;/p&gt;\n\n&lt;p&gt;Read what I said above again. The price of Bitcoin is literally going to &lt;em&gt;infinity&lt;/em&gt; against the dollar. Bitcoin is number go up technology against ALL currencies of the world.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/u8rv3xvm65r81.png?width=1246&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=9fdb5e06b8c92c8bda06e2400b5cc03a9095a86d\"&gt;USD vs BTC over time&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Year after year, dollars are purchasing less, and Bitcoins are purchasing more. Bitcoin is exponentially increasing in purchasing power. Bitcoin mathematically is the strongest currency in the world. It is a perfect place to store long term wealth, and exchange economic value with another entity.&lt;/p&gt;\n\n&lt;p&gt;The question that lead many of us down the Bitcoin rabbit hole is, &lt;strong&gt;how high can Bitcoin price go?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;In Short, the price per Bitcoin valued against the Dollar should be anywhere between $500,000 and $4,600,000.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s right, Bitcoin is EASILY going to 1 MILLION DOLLARS a coin by 2030. We are so early. The world has a lot of money in it. The world&amp;#39;s money is beginning to fly into Bitcoin as we speak.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/12r5kf7xd5r81.png?width=1309&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=a3c412f2e88af206e218bf174a03eb32c53f71a3\"&gt;Public Companies holding BTC&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The chart above will show us that Public Companies are beginning to HORDE Bitcoin, as they see it as an essential asset to hold on the balance sheet of their business. Many of these companies are taking Bitcoins off the market, and they will NEVER return or be resold for dollars.&lt;/p&gt;\n\n&lt;p&gt;Bitcoin is the easiest asset to maintain, and the greatest asset to hold over a long period of time. Everyone is making a lot of money off this. Everyone needs a piece of it.&lt;/p&gt;\n\n&lt;p&gt;The kicker is, we are going into a transformational time in history. Inflation rates are at record highs, reaching 10% a year in most of the world. (This is conservative) &lt;/p&gt;\n\n&lt;p&gt;The Global BOND market is worth approximately $100T. All this money placed in bonds is literally LOSING investors money. If inflation is at 10%, and you are earning 2% on your bonds, you are &lt;em&gt;&amp;quot;safely&amp;quot;&lt;/em&gt; losing 8% a year on your investment. The math is that simple, and it is that sad.&lt;/p&gt;\n\n&lt;p&gt;We can now say at least 30T of these bonds are smart enough to notice within the next couple years that the money placed inside them need a new home, the whole Crypto industry and Bitcoin itself is that black hole that is going to suck up a large portion of it. (Crypto Industry is currently only worth $2.5T at the time of writing this)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;With all this money coming, and adoption growing exponentially, what prices per Bitcoin could we expect?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Maybe this is something for you to study yourself, but I&amp;#39;ll give you an idea of models and ideas to study to get you on the right track.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;These Price Projections, Models, and MATH have been provided by&lt;/em&gt; &lt;strong&gt;&lt;em&gt;James from InvestAnswers&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;. Check him out on YouTube!&lt;/em&gt; &lt;a href=\"https://www.youtube.com/channel/UClgJyzwGs-GyaNxUHcLZrkg\"&gt;&lt;em&gt;https://www.youtube.com/channel/UClgJyzwGs-GyaNxUHcLZrkg&lt;/em&gt;&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Price Projections by 2030&lt;/strong&gt; &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Metcalfes Law: $11M per BTC&lt;/li&gt;\n&lt;li&gt;Stock to Flow: $9.5M per BTC&lt;/li&gt;\n&lt;li&gt;Fidelity and ARKK Invest PP: $1M&lt;/li&gt;\n&lt;li&gt;Average of all the models: $4.6M&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Expected Case: $1.9M&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I like to give conservatives price predictions for BTC. Realistically, any of these could be correct. The math just works, it&amp;#39;s not hopium, it&amp;#39;s not inaccurate, this is REALISTIC.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;I expect a $1M Bitcoin by 2030, and I have put my money where my mouth is.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The question is, should you invest? Yes. NFA!&lt;/p&gt;\n\n&lt;p&gt;Take a leap of faith, this is all very possible, and will likely happen.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/hjq549o0j5r81.png?width=535&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=e74c8107fbf7f7ec2450bf3330b9d62439813a6f\"&gt;A leap of faith!&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Keep in mind, Purchasing Power of $1M in 2030 will not be $1M. This is true because of how inflationary the dollar is. See below what happens when BTC = $1M a coin with varies inflation rates. This is why we need sound money that does not devalue against itself. (Bitcoin if you haven&amp;#39;t understood that yet)&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/np1lcfgri5r81.png?width=912&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=754b0ea12aea22c8fadc2ca8892b2de47b8d56ce\"&gt;Chart from InvestAnswers&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Get ready to see Bitcoin being accepted as payments at all your local stores, and sent between all your friends. It&amp;#39;s only up from here. Bitcoin and Crypto as an industry is a 50X opportunity from here over the next decade or two. This $2.5T asset class is going to $100T. (Similar to the Stock Market and Real Estate total market)&lt;/p&gt;\n\n&lt;p&gt;Study hard, study often, pick the right assets, and enjoy the gains.&lt;/p&gt;\n\n&lt;p&gt;The question is: &lt;strong&gt;&lt;em&gt;WHEN MOON?&lt;/em&gt;&lt;/strong&gt; Stack your bags, do your DD, and happy investing!&lt;/p&gt;\n\n&lt;p&gt;Again, NFA!&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/997hxwx2g5r81.png?width=784&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=63a993d3425629ee6e9be7588e7fe471c0dcbd5c\"&gt;Bitcoin in El Salvador&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;DISCLAIMER: THIS IS NOT FINANCIAL ADVICE.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 319,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/GSRa_c4ulWynXBJS-bN_plNr7zcHUK1VTMpqPY6W_00.jpg?auto=webp&amp;s=c28bdfe2dce7ac5f36b4913920c3d904adab5612",
          "width": 900,
          "height": 900
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/GSRa_c4ulWynXBJS-bN_plNr7zcHUK1VTMpqPY6W_00.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=0b18a8f13b3b0fdaec889f72c105d65cfc8b9bb6",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/GSRa_c4ulWynXBJS-bN_plNr7zcHUK1VTMpqPY6W_00.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=f8bb7f91ec5a1fa6738e179aa4ba1c15656fc2d1",
            "width": 216,
            "height": 216
          },
          {
            "url": "https://external-preview.redd.it/GSRa_c4ulWynXBJS-bN_plNr7zcHUK1VTMpqPY6W_00.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=6ce3873d2c7e60d0c65216652ff1e0be9712a387",
            "width": 320,
            "height": 320
          },
          {
            "url": "https://external-preview.redd.it/GSRa_c4ulWynXBJS-bN_plNr7zcHUK1VTMpqPY6W_00.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=00ff81879c89a3c99dff45b5213ad4bc8f687914",
            "width": 640,
            "height": 640
          }
        ],
        "variants": {},
        "id": "fM0emPXJ7l4IBu4-F-ft4OkUi_SCnrF_2zzPeCs2dxE"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/tuoh5f/im_all_in_bitcoin_the_exponential_age/",
  "subreddit": "Bitcoin",
  "id": "tuoh5f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Thesis: Bitcoin will forever be the currency of the internet.\n\nThis write up will contain information about where we are in the world, the role\nBitcoin will play in it, and most fun - Price Predictions! I've spent over 1000\nhours trying to wrap my head around this revolution. Let's begin.\n\nThe…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "卒論です。ビットコインは永遠にインターネットの通貨となるだろう。\n\nこの記事では、私たちが世界のどこにいるのか、どのような役割を担っているのか\nその中でビットコインが果たす役割、そして何よりの楽しみは価格予測です。私はこれまで1000回以上\nこの革命を理解するのに何時間もかかった。始めましょう。\n\nその...",
      "title": "I'M ALL IN: ビットコインとエクスポネンシャルの時代。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "论文。比特币将永远成为互联网的货币。\n\n这篇文章将包含关于我们在这个世界上的位置，比特币将在其中扮演的角色，以及最有趣的--价格预测的信息。\n比特币将在其中扮演的角色，以及最有趣的--价格预测! 我已经花了超过1000个\n个小时，试图把我的头弄清楚这场革命。让我们开始吧。\n\n我的工作是...",
      "title": "我全身心投入。比特币&amp; 指数时代。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "論文。比特幣將永遠成爲互聯網的貨幣。\n\n這篇文章將包含關於我們在這個世界上的位置，比特幣將在其中扮演的角色，以及最有趣的--價格預測的信息。\n比特幣將在其中扮演的角色，以及最有趣的--價格預測! 我已經花了超過1000個\n個小時，試圖把我的頭弄清楚這場革命。讓我們開始吧。\n\n我的工作是...",
      "title": "我全身心投入。比特幣&amp; 指數時代。"
    }
  ]
}