{
  "author": "InflatbleArmTubeMan",
  "the_new_excerpt": "I type d that tyitle twice because I knew it was wrong the first time.  Still\nwrong.  w/e.  GF's out at a lesbian bar, BTC crashing WHY AM I HOLDING? I'LL\nTELL YOU WHY.  It's because I'm a bad trader and I KNOW I'M A BAD TRADER.  Yeah\nyou good traders can spot the highs and the lows pit pat piffy…",
  "original_created_utc": 1610342027,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我打了两次那个字，因为我第一次就知道是错的。\n错了。她的女朋友在一家女同性恋酒吧，BTC崩溃了，我为什么要扣留？我会\n告诉你为什么。这是因为我是一个糟糕的交易者，我知道我是一个糟糕的交易者。\n你这个优秀的交易者可以发现高点和低点，就像Pify…一样。",
      "title": "我在抱着"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我打了兩次那個字，因爲我第一次就知道是錯的。\n錯了。她的女朋友在一家女同性戀酒吧，BTC崩潰了，我爲什麼要扣留？我會\n告訴你爲什麼。這是因爲我是一個糟糕的交易者，我知道我是一個糟糕的交易者。\n你這個優秀的交易者可以發現高點和低點，就像Pify…一樣。",
      "title": "我在抱着"
    }
  ],
  "title": "I AM HODLING",
  "created_utc": 1610389398,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I type d that tyitle twice because I knew it was wrong the first time.   Still wrong.  w/e.  GF&#39;s out at a lesbian bar, BTC crashing WHY AM I  HOLDING? I&#39;LL TELL YOU WHY.  It&#39;s because I&#39;m a bad trader and I KNOW  I&#39;M A BAD TRADER.  Yeah you good traders can spot the highs and the lows  pit pat piffy wing wong wang just like that and make a millino bucks  sure no problem bro.  Likewise the weak hands are like OH NO IT&#39;S GOING  DOWN I&#39;M GONNA SELL he he he and then they&#39;re like OH GOD MY ASSHOLE  when the SMART traders who KNOW WHAT THE FUCK THEY&#39;RE DOING buy back in  but you know what?  I&#39;m not part of that group.  When the traders buy  back in I&#39;m already part of the market capital so GUESS WHO YOU&#39;RE  CHEATING day traders NOT ME~!  Those taunt threads saying &quot;OHH YOU  SHOULD HAVE SOLD&quot; YEAH NO SHIT.  NO SHIT I SHOULD HAVE SOLD.  I SHOULD  HAVE SOLD MOMENTS BEFORE EVERY SELL AND BOUGHT MOMENTS BEFORE EVERY BUY  BUT YOU KNOW WHAT NOT EVERYBODY IS AS COOL AS YOU.  You only sell in a  bear market if you are a good day trader or an illusioned noob.  The  people inbetween hold.  In a zero-sum game such as this, traders can  only take your money if you sell.  </p>\n\n<p>so i&#39;ve had some whiskey<br/>\nactually on the bottle it&#39;s spelled whisky<br/>\nw/e<br/>\nsue me<br/>\n(but only if it&#39;s payable in BTC)</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/Bitcoin/comments/kuvws3/i_am_hodling/",
  "subreddit": "Bitcoin",
  "id": "kuvws3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706371567
}