{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "I often read posts / comments from people who talk about the stock market as if it were an isolated entity.  \"It has some good years, it has some bad years, lately we've had good years, there will be bad years, too, but it always goes up over time.\"  All of this is true.  But I don't think you can look at the last 13 years or so and say that what we've seen is just business as usual.  It's not.  What we've seen the last 13 years has been entirely unprecedented and has basically been an experiment in monetary policy.\n\nI could make this a long post, but I'll try to make it as simple as possible.  Take a look at the M1 money stock, which over the last 13 years, since the Global Financial Crisis, has increased significantly, and radically so since the Covid-19 pandemic.  (Note that M1 money means \"the most liquid portions of the money supply, containing currency and assets that either are or can be quickly converted to cash)\n\n[https://fred.stlouisfed.org/series/M1SL](https://fred.stlouisfed.org/series/M1SL)\n\nAlso interesting to compare the S+P 500 to the M1 money supply: [1. post-2008](https://inukshukcapital.com/wp-content/uploads/2019/12/SP-500-vs-M1-Money-Stock-scaled.jpg),\n\n[2. since Covid-19](https://static.wixstatic.com/media/c08c52_b6b1a1d762ed46ef8503dc75f7fdfd22~mv2.jpg/v1/fill/w_744,h_475,al_c,q_90/c08c52_b6b1a1d762ed46ef8503dc75f7fdfd22~mv2.jpg)\n\nFinally, someone linked an article a few weeks back from an analyst who said we shouldn't be afraid of high rates, but rather low rates, because markets have always been at their worst when rates were low.  This is obviously ridiculous, because that's like saying that we shouldn't be afraid of smoking, but rather chemotherapy, because incidences of cancer are always higher when people are on chemotherapy rather than when they are smoking.  Well of course!  Chemotherapy is the remedy to cancer.  Just as low rates are the remedy to a market downturn.  We would expect that low rates would correlate to market downturns, given that they are the tool we use to stimulate the economy when things aren't going well.\n\nEven so, the author of that article was using the period of 2009 to make his case (worst bear market in history also corresponded to the lowest rates).  But you don't have to be a genius to see the correlation between low rates and stock prices, especially in the last decade:\n\n[https://d1-invdn-com.akamaized.net/content/pice484f31450a7fa148b4f1e431e64e1aa.png](https://d1-invdn-com.akamaized.net/content/pice484f31450a7fa148b4f1e431e64e1aa.png)\n\nOf course, there's also empirical evidence that this is the case: [https://papers.ssrn.com/sol3/papers.cfm?abstract\\_id=2941281](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2941281)\n\nIn summary, I don't think you can talk about the stock market in isolation without considering the monetary policy that's fueling it, especially now given that monetary policy has been so dramatic and unprecedented.  Doing so would be like saying \"well bread is usually about $2.50 a loaf, that's gone up over the years but it tends to remain steady in the short to mid term\".  Of course, that's true in the USA.  But in Venezuela such a statement wouldn't hold true.  Not that the US is anywhere near Venezuela, and I'm not calling for hyperinflation or anything like that.  But you have to remember that we're dealing with money here.  Money is not something that holds value on its own, it depends on many other factors, not least of which is monetary policy.  No reasonable discussion of prices, whether of goods and services or assets, is complete without taking into account monetary policy, especially given the nature of what's been going on the last decade.",
  "author_fullname": "t2_t0846",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "I don't think people understand what's going on with the Fed / central banks.",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_rznlyl",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.91,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 44,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 44,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1641719064,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I often read posts / comments from people who talk about the stock market as if it were an isolated entity.  &amp;quot;It has some good years, it has some bad years, lately we&amp;#39;ve had good years, there will be bad years, too, but it always goes up over time.&amp;quot;  All of this is true.  But I don&amp;#39;t think you can look at the last 13 years or so and say that what we&amp;#39;ve seen is just business as usual.  It&amp;#39;s not.  What we&amp;#39;ve seen the last 13 years has been entirely unprecedented and has basically been an experiment in monetary policy.&lt;/p&gt;\n\n&lt;p&gt;I could make this a long post, but I&amp;#39;ll try to make it as simple as possible.  Take a look at the M1 money stock, which over the last 13 years, since the Global Financial Crisis, has increased significantly, and radically so since the Covid-19 pandemic.  (Note that M1 money means &amp;quot;the most liquid portions of the money supply, containing currency and assets that either are or can be quickly converted to cash)&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://fred.stlouisfed.org/series/M1SL\"&gt;https://fred.stlouisfed.org/series/M1SL&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Also interesting to compare the S+P 500 to the M1 money supply: &lt;a href=\"https://inukshukcapital.com/wp-content/uploads/2019/12/SP-500-vs-M1-Money-Stock-scaled.jpg\"&gt;1. post-2008&lt;/a&gt;,&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://static.wixstatic.com/media/c08c52_b6b1a1d762ed46ef8503dc75f7fdfd22%7Emv2.jpg/v1/fill/w_744,h_475,al_c,q_90/c08c52_b6b1a1d762ed46ef8503dc75f7fdfd22%7Emv2.jpg\"&gt;2. since Covid-19&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Finally, someone linked an article a few weeks back from an analyst who said we shouldn&amp;#39;t be afraid of high rates, but rather low rates, because markets have always been at their worst when rates were low.  This is obviously ridiculous, because that&amp;#39;s like saying that we shouldn&amp;#39;t be afraid of smoking, but rather chemotherapy, because incidences of cancer are always higher when people are on chemotherapy rather than when they are smoking.  Well of course!  Chemotherapy is the remedy to cancer.  Just as low rates are the remedy to a market downturn.  We would expect that low rates would correlate to market downturns, given that they are the tool we use to stimulate the economy when things aren&amp;#39;t going well.&lt;/p&gt;\n\n&lt;p&gt;Even so, the author of that article was using the period of 2009 to make his case (worst bear market in history also corresponded to the lowest rates).  But you don&amp;#39;t have to be a genius to see the correlation between low rates and stock prices, especially in the last decade:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://d1-invdn-com.akamaized.net/content/pice484f31450a7fa148b4f1e431e64e1aa.png\"&gt;https://d1-invdn-com.akamaized.net/content/pice484f31450a7fa148b4f1e431e64e1aa.png&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Of course, there&amp;#39;s also empirical evidence that this is the case: &lt;a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2941281\"&gt;https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2941281&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;In summary, I don&amp;#39;t think you can talk about the stock market in isolation without considering the monetary policy that&amp;#39;s fueling it, especially now given that monetary policy has been so dramatic and unprecedented.  Doing so would be like saying &amp;quot;well bread is usually about $2.50 a loaf, that&amp;#39;s gone up over the years but it tends to remain steady in the short to mid term&amp;quot;.  Of course, that&amp;#39;s true in the USA.  But in Venezuela such a statement wouldn&amp;#39;t hold true.  Not that the US is anywhere near Venezuela, and I&amp;#39;m not calling for hyperinflation or anything like that.  But you have to remember that we&amp;#39;re dealing with money here.  Money is not something that holds value on its own, it depends on many other factors, not least of which is monetary policy.  No reasonable discussion of prices, whether of goods and services or assets, is complete without taking into account monetary policy, especially given the nature of what&amp;#39;s been going on the last decade.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "rznlyl",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "shortyafter",
  "discussion_type": null,
  "num_comments": 33,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/rznlyl/i_dont_think_people_understand_whats_going_on/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/rznlyl/i_dont_think_people_understand_whats_going_on/",
  "subreddit_subscribers": 3490369,
  "created_utc": 1641727041,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1641719064,
  "the_new_excerpt": "I often read posts / comments from people who talk about the stock market as if\nit were an isolated entity. \"It has some good years, it has some bad years,\nlately we've had good years, there will be bad years, too, but it always goes up\nover time.\" All of this is true. But I don't think you can…"
}