{
  "author": "AutisticDalekOnSpeed",
  "original_created_utc": 1637745077,
  "title": "Do not touch any coins that suddenly appear in your wallet, especially if they look like they're worth a lot, and no, this isn't about dust attacks",
  "created_utc": 1637758438,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I had a bsc wallet that i had forgotten about. Today I opened it and noticed I had gotten a bunch of tokens airdropped to me. Here&#39;s what i got and how much it&#39;s worth (in usd)</p>\n\n<p>150k Minereum - $13.6k</p>\n\n<p>960k BestAir - $80k</p>\n\n<p>800k TheVera - $185k</p>\n\n<p>1.5m Zepe - $270k</p>\n\n<p>Cool right? I basically got half a million for free. But there&#39;s a catch. These tokens can not actually be redeemed. They are scams.</p>\n\n<p>Let&#39;s look at them and what they do</p>\n\n<p><strong>Minereum:</strong> This one is the first one i got (3 months ago). It exists on both ethereum and bsc.</p>\n\n<p>A lot of addresses received big amount of this coin that shows up to be thousands of dollars worth. But you can not actually spend these coins.</p>\n\n<p>They claim to be &quot;self mining smart contracts&quot;. You basically have to pay 0.30 BNB for level 2 or 0.90 BNB for level 3, and they will start &quot;mining&quot; and you&#39;ll get some dust worth cents. It is almost impossible to be able to get back the value of the BNB you paid.</p>\n\n<p><strong>BestAir, Zepe, TheVera:</strong></p>\n\n<p>These ones are a simpler scam than minereum. You get some coins, and when you try to swap them on pancakeswap or some other dex the transaction won&#39;t go through.</p>\n\n<p>You will have to visit the token&#39;s website and it will ask you to approve a smart contract. By doing that you&#39;re giving access to your wallet to the attacker.</p>\n\n<p>If you do that your wallet gets drained and you lose whatever coins you have in it.</p>\n\n<p>So yeah, be careful and don&#39;t get excited over these. And do not let the greed take over when you get airdropped a huge amount of money.</p>\n\n<p>Always do some research on random coins that you got before trying to do anything with them.</p>\n\n<p>A simple &#39;[token name] scam&#39; google search can save you a lot of money</p>\n</div><!-- SC_ON -->",
  "score": 359,
  "permalink": "/r/CryptoCurrency/comments/r111hu/do_not_touch_any_coins_that_suddenly_appear_in/",
  "subreddit": "CryptoCurrency",
  "id": "r111hu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I had a bsc wallet that i had forgotten about. Today I opened it and noticed I\nhad gotten a bunch of tokens airdropped to me. Here's what i got and how much\nit's worth (in usd)\n\n150k Minereum - $13.6k\n\n960k BestAir - $80k\n\n800k TheVera - $185k\n\n1.5m Zepe - $270k\n\nCool right? I basically got half a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "忘れていたbscの財布がありました。今日、その財布を開いてみたら\nたくさんのトークンが送られてきました。以下は私が手に入れたものとその金額です。\n価値があるか(米ドルで)\n\n150k Minereum - $13.6k\n\n960k BestAir - $80k\n\n800k TheVera - $185k\n\n1.5m Zepe - 27万ドル\n\nいいでしょう？私は基本的に半分の...",
      "title": "財布の中に突然現れたコインには手を出さないでください。特に価値がありそうなコインには手を出さないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有一个BSC钱包，我已经忘记了。今天我打开它，发现我\n我收到了一堆空投给我的代币。下面是我得到的东西和多少钱\n它的价值（美元）\n\n150k Minereum - $13.6k\n\n960k BestAir - $80k\n\n80万 TheVera - 185千美元\n\n150万 Zepe - 27万\n\n很酷吧？我基本上得到了半个...",
      "title": "不要碰任何突然出现在你钱包里的硬币，特别是如果它们看起来很值钱，不，这不是关于灰尘的攻击。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一個BSC錢包，我已經忘記了。今天我打開它，發現我\n我收到了一堆空投給我的代幣。下面是我得到的東西和多少錢\n它的價值（美元）\n\n150k Minereum - $13.6k\n\n960k BestAir - $80k\n\n80萬 TheVera - 185千美元\n\n150萬 Zepe - 27萬\n\n很酷吧？我基本上得到了半個...",
      "title": "不要碰任何突然出現在你錢包裏的硬幣，特別是如果它們看起來很值錢，不，這不是關於灰塵的攻擊。"
    }
  ]
}