{
  "author": "mic_droo",
  "original_created_utc": 1650889835,
  "title": "Crypto has a fake news problem.",
  "created_utc": 1650940997,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;...and not in the way you think. I am not talking about any &amp;quot;FUD&amp;quot; by the mainstream media - for every article making unfair attacks against crypto there is another one depicting it overly positive, and I feel most fall between these extremes and are mostly somewhat fair.&lt;/p&gt;\n\n&lt;p&gt;I am talking about how the community reacts to positive news. Take, for example, the Central African Republic introducing Bitcoin as legal tender a few days ago. Quite a few crypto media reported on it and there were three posts about it made yesterday, all three got to &amp;quot;hot&amp;quot;, getting about 1,000 upvotes together. Don&amp;#39;t get me wrong, it&amp;#39;s huge news, so I understand, the only problem I have with it: &lt;strong&gt;it&amp;#39;s not true, they did no such thing&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;When I made a post explaining that this was just, well, wrong, a few hours ago, nobody saw it. It is currently at about 10 upvotes, one hundreth of the other posts. So nobody questioned the fake news - because it was positive - and a post debunking it isn&amp;#39;t seen by anyone. &lt;/p&gt;\n\n&lt;p&gt;This is by no means a single incident - let&amp;#39;s just stick with crypto as legal tender, do you remember when Bitcoin would be introduced as legal tender in Honduras? When Bitcoin Cash was going to be introduced as legal tender in St. Maarten? When Shiba Inu was going to become legal tender in Turkey? That all happened in the past, like, two months, and of course all of them were fake news without any basis. But they made huge waves in crypto communities, many many people read about them and believed them - and I have literally never seen a crypto medium make a corrigendum about fake news they published, and I&amp;#39;ve rarely seen any crypto figures admit that they have shared something that turned out to be wrong.&lt;/p&gt;\n\n&lt;p&gt;This is a problem, and it also exists in the other direction (if something is negative it &lt;em&gt;has&lt;/em&gt; to be wrong). I don&amp;#39;t know what to do about it, but I&amp;#39;ve never seen a community, except maybe hardcore followers of political figures, that was this extreme in this regard.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr: crypto communities - here, on Twitter, everywhere - have a tendency to believe everything positive about crypto and not caring about it being debunked. this is problematic.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 306,
  "permalink": "/r/CryptoCurrency/comments/ubk1ho/crypto_has_a_fake_news_problem/",
  "subreddit": "CryptoCurrency",
  "id": "ubk1ho",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "...and not in the way you think. I am not talking about any \"FUD\" by the\nmainstream media - for every article making unfair attacks against crypto there\nis another one depicting it overly positive, and I feel most fall between these\nextremes and are mostly somewhat fair.\n\nI am talking about how the…"
}