{
  "author": "AskScienceModerator",
  "the_new_excerpt": "Hi Reddit! I'm Herman Pontzer, PhD, Associate Professor of Evolutionary\nAnthropology at Duke University and Associate Research Professor of Global\nHealth at the Duke Global Health Institute. I conduct research on the human\nmetabolism through studies with hunter-gatherer tribes like the Hadza in…",
  "original_created_utc": 1614686452,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Hi Reddit! 我是Herman Pontzer博士，进化论副教授。\n杜克大学人类学和全球副研究教授。\n杜克全球健康研究所的健康。我对人类的\n新陈代谢通过研究狩猎采集部落，如哈德萨在... ...",
      "title": "AskScience AMA系列。我是Herman Pontzer, 人类学家和杜克大学教授. 我的新书《燃烧》分享了关于人类新陈代谢真正工作原理的新研究，让我们最终可以改善健康和管理体重。AMA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Hi Reddit! 我是Herman Pontzer博士，進化論副教授。\n杜克大學人類學和全球副研究教授。\n杜克全球健康研究所的健康。我對人類的\n新陳代謝通過研究狩獵採集部落，如哈德薩在... ...",
      "title": "AskScience AMA系列。我是Herman Pontzer, 人類學家和杜克大學教授. 我的新書《燃燒》分享了關於人類新陳代謝真正工作原理的新研究，讓我們最終可以改善健康和管理體重。AMA!"
    }
  ],
  "title": "AskScience AMA Series: I'm Herman Pontzer, an anthropologist and professor at Duke University. My new book, BURN, shares new research on how the human metabolism really works so that we can finally improve health and manage weight. AMA!",
  "created_utc": 1614704437,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi Reddit! I&#39;m Herman Pontzer, PhD, Associate Professor of Evolutionary Anthropology at Duke University and Associate Research Professor of Global Health at the Duke Global Health Institute. I conduct research on the human metabolism through studies with hunter-gatherer tribes like the Hadza in Africa.</p>\n\n<p>In my decade of study in this field, what I&#39;ve learned challenges the consensus of the diet and exercise industry. We&#39;ve always been told that exercise increases the number of calories we burn each day, but a <a href=\"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0040503\">doubly labeled water study with the Hadza</a> conducted by me and my research team shows that our bodies have evolved to adjust to our daily level of physical activity, thereby adjusting our metabolism to keep daily energy expenditure within a narrow range, regardless of how active we are. Instead, the key to losing weight and battling the obesity pandemic is regulating the number of calories we consume versus how many we burn. That&#39;s not to say we should abandon exercise - it is essential to keeping our bodies healthy and to aging well - but diet is the tool we need to focus on to manage our weight.</p>\n\n<p>My new book, <a href=\"https://www.amazon.com/Burn-Research-Really-Calories-Healthy/dp/0525541527/\"><em>BURN</em></a>, examines this exciting research taking place outside of traditional labs and reveals how a new understanding of our metabolism can inform our efforts to promote a healthy and sustainable society.</p>\n\n<p>If you&#39;re curious about why we can&#39;t &quot;earn&quot; that slice of chocolate cake, whether a Paleo diet is actually &quot;Paleo,&quot; <a href=\"https://onlinelibrary.wiley.com/doi/full/10.1111/obr.12785\">what the Hadza can teach us about avoiding diseases of civilization like diabetes and obesity</a>, or what it&#39;s like to extract a live tick from your head while observing chimpanzees (true story), I am here for it. I am on at 3pm EST (20 UT), AMA!</p>\n\n<p>Username: <a href=\"/u/HermanPontzer\">/u/HermanPontzer</a></p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/askscience/comments/lw0ef8/askscience_ama_series_im_herman_pontzer_an/",
  "subreddit": "askscience",
  "id": "lw0ef8",
  "is_self": true,
  "media": null,
  "is_video": false
}