{
  "author": "chandler-blackshadow",
  "original_created_utc": 1650358596,
  "title": "Are you willing to be paid in crypto at your job?",
  "created_utc": 1650397208,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been thinking about this. More and more companies are adopting cryptocurrency as a valid method of payment.&lt;/p&gt;\n\n&lt;p&gt;But what if they offered to pay you, their employee, in cryptocurrency? Would you accept? What questions would you have? What conditions would you stipulate?&lt;/p&gt;\n\n&lt;p&gt;For example, would you ask for a 50/50 pay - that&amp;#39;s 50% in the currency of your land (dollar, euro, pound, etc) and 50% in crypto?&lt;/p&gt;\n\n&lt;p&gt;Would you be bound to only accept payment in one type of crypto, or could you change? ie, pay me in BTC for 3 months, then in ETH, etc.&lt;/p&gt;\n\n&lt;p&gt;What questions do you have? Or would you just go for it? Those  that are already being paid in crypto, either as an employee, or as a sole trader, what has been your experience? What advice do you have for ones contemplating this change?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 333,
  "permalink": "/r/CryptoCurrency/comments/u70le2/are_you_willing_to_be_paid_in_crypto_at_your_job/",
  "subreddit": "CryptoCurrency",
  "id": "u70le2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been thinking about this. More and more companies are adopting\ncryptocurrency as a valid method of payment.\n\nBut what if they offered to pay you, their employee, in cryptocurrency? Would\nyou accept? What questions would you have? What conditions would you stipulate?\n\nFor example, would you ask…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんなことを考えていました。採用する企業が増えている\n暗号通貨は有効な決済手段です。\n\nしかし、もし彼らが従業員であるあなたに暗号通貨で支払うことを提案したらどうでしょうか？果たして\n受け入れることができますか？どんな質問をしますか？どのような条件を提示しますか？\n\n例えば、あなたは...",
      "title": "あなたは、仕事で暗号で給料をもらうことに抵抗はありませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在思考这个问题。越来越多的公司正在采用\n加密货币作为一种有效的支付方式。\n\n但是，如果他们提出用加密货币支付你，他们的雇员，会怎么样？会不会\n你会接受吗？你会有什么问题？你会规定哪些条件？\n\n例如，你会问...",
      "title": "你愿意在你的工作中用加密货币支付吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在思考這個問題。越來越多的公司正在採用\n加密貨幣作爲一種有效的支付方式。\n\n但是，如果他們提出用加密貨幣支付你，他們的僱員，會怎麼樣？會不會\n你會接受嗎？你會有什麼問題？你會規定哪些條件？\n\n例如，你會問...",
      "title": "你願意在你的工作中用加密貨幣支付嗎？"
    }
  ]
}