{
  "author": "Tux_fan",
  "original_created_utc": 1633728251,
  "title": "I'm from El Salvador...UPDATE 3",
  "created_utc": 1633736486,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>It’s been a while so I’ll give you an update on how things are going.</strong></p>\n\n<ul>\n<li>There haven’t been anti-btc protest since sept 7th. Sept 15th was Independence Day so there were many reasons to the protest. There have been many protests (not btc) but that’s common in my country, its weird not having a protest between weeks LoL.</li>\n</ul>\n\n<p><strong>Do people hate btc?</strong></p>\n\n<ul>\n<li>Not at all, some are afraid since they don’t understand, but the main concern is the law. Due to a large history of government corruption, people don’t trust government, there’s always a catch in this type of laws. I repeat, this has nothing to do with btc at all but how government handle things.</li>\n</ul>\n\n<p><strong>Chivo App (official wallet)</strong></p>\n\n<p>Chivo app is now available to most devices and it works fine most of the time although there are moments when either it’s on maintenance mode or simply die. There are some cases where chivo app stop working the moment you want to pay…some “karens” have made a fuss at supermarkets or fast-food restaurants, LoL.</p>\n\n<ul>\n<li>Lightning network works fine.</li>\n<li>Layer 1 transactions still shows problems. (my $2 are still on the way since sept 8)</li>\n<li>Minor issues when sending money from chivo app to bank account.</li>\n<li>People are still selling the $30 btc bonus for $25 USD cash. (They even use facebook marketplace for promotion LoL. <a href=\"https://twitter.com/BairesQuezada/status/1442182539846684673/photo/1\">Here&#39;s a pic altough in spanish</a>)</li>\n</ul>\n\n<p><strong>Problems with registration</strong></p>\n\n<p><em>I’ll explain this giving some context</em>, t<em>he main identification we Salvadoran have is called DUI which stands for “Documento Único de Identidad” (Unique identity document). This ID shows your photo, name, date and place of birth, if your single or married, parents name, your address and a 9-digit number. This number is unique to every person however it’s not something you maintain in secret. You usually use your DUI to when making a contract or any other legal procedure…or simply use it to prove your not underage when buying alcohol, LoL.</em></p>\n\n<p><em>By itself, the DUI number it’s useless, legal documents will also require you to personally sign aside other stuff. You can use your DUI number in raffles, polls and other stuff like that. People can’t robe or scam you just because you give them your DUI number, so nobody actually cares about keeping the number in secret.</em></p>\n\n<p>Now that I explained that, here’s the issue. To register in chivo app and get your $30 bonus, first you type your phone number, DUI number, take a photo of your DUI and a photo of yourself, and type a security code (your standard KYC). People found out that, to complete the registration process you only need a phone number and DUI number, there is actually no verification of your ID and face photo, just taking a random photo will let you complete the registration.</p>\n\n<p>Some people take advantage of this and start craving for DUI numbers, there many data bases that have hundreds and thousands of DUI numbers, you can usually buy these things for marketing purposes (SMS - emails campaigns, segmentation, etc.). You can also buy a phone number for $1.</p>\n\n<p>You probably can get the idea of what the problem is…now that chivo app is available to most devices, people start discovering that their DUI number has already been registered, so they can’t use the app and even less get the $30 bonus.</p>\n\n<p>There haven’t been any official communication from government about this problem however the director of police department said in an interview that people who are doing these things will get arrested, investigations have started. <a href=\"https://radioyskl.com/2021/10/07/pnc-detendra-en-las-proximas-horas-a-personas-que-suplantaron-identidades-para-acceder-a-los-3000-de-la-chivo-wallet/\">Here&#39;s an article</a>, altough in spanish, might have to use google translator.</p>\n\n<p><strong>Remittances</strong></p>\n\n<p>There are three main ways to send money from overseas to my country.</p>\n\n<ol>\n<li>Buy USD with a credit/debit card in chivo website and send directly to a relative’s chivo app.This has 0 fees although some banks may charge you like US Bank and Bank of America. Wells Fargo and Chase have 0 fees.</li>\n<li>If for legal reasons you don’t have a bank account, you can get paid in btc and send it</li>\n<li>or continue using businesses like Western-Union.</li>\n</ol>\n\n<p><strong>Btc mining</strong></p>\n\n<p>The power of volcanoes! ...(sigh)</p>\n\n<p>I’ll be honest and tell you all that this is marketing…at least for today, 2021.</p>\n\n<p>In my country we need to buy (import) electricity from other countries to meet the demand. So don’t expect a big mining farm from the get go, maybe in 10 years there will be a really big mining farm sustained with clean energy.</p>\n\n<p>Also, we are taking away this clean energy to direct it exclusively to btc. Good for btc, bad for my country. Anyways, thanks to this there might be mayor investments in geothermal energy.</p>\n\n<p><em>Geothermal energy needs to be developed through time; it’s not just finding a vein of water.</em></p>\n\n<p>Here is a <a href=\"https://www.esmap.org/sites/esmap.org/files/5-4%20GGDP%20Day2_El%20Salvador.pdf\">presentation with some data</a>…although it’s a decade old, it might give you some insights about geothermal development…it’s in English btw.</p>\n\n<p>There’s also the math of the cost of btc mining and the actual gains but since I don´t have any information I´ll skip that for now.</p>\n\n<p><strong>People’s behavior</strong></p>\n\n<p>As I’ve said multiple times, nothing has really changed, we just have a new payment method.</p>\n\n<p>People are starting to know how btc works, the bearish and bullish market, etc. On a daily basis there’s no difference between USD and btc, people are showing interest in crypto as an investment method and not a currency…most businesses like restaurants and supermarkets accept btc as payment, there are others who only accept USD, either because they’re against it or don’t give a shi… there are others who doesn’t accept btc because people don’t show interest in paying with btc.</p>\n\n<p>There was also a big promotion in the price of gas, minus $0.20 for a gallon. However, I don’t see a big fuss about this…which is weird… the promotion will end around October 14th so I’ll wait for any data that might come out.</p>\n\n<p>Unfortunately, we don’t have any data about chivo aside the presidents’ tweets, which I personally don’t trust as a source. There are some polls out there of how many people uses btc as payment but I still think it’s to early to get that type of info, consumer behavior wont change in a short period of time.</p>\n\n<p>----</p>\n\n<p>Truth to be told, foreigners might feel more the hype than Salvadorans LoL.</p>\n\n<p>As always I’ll try to answer your questions and explain things as long as I can.</p>\n</div><!-- SC_ON -->",
  "score": 207,
  "permalink": "/r/Bitcoin/comments/q476r0/im_from_el_salvadorupdate_3/",
  "subreddit": "Bitcoin",
  "id": "q476r0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It’s been a while so I’ll give you an update on how things are going.\n\n * There haven’t been anti-btc protest since sept 7th. Sept 15th was\n   Independence Day so there were many reasons to the protest. There have been\n   many protests (not btc) but that’s common in my country, its weird not having\n…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "久しぶりなので、近況報告をします。\n\n * 9月7日以降、アンチBTCの抗議活動は行われていません。9月15日は\n   9月15日は独立記念日だったので、抗議には多くの理由がありました。多くの抗議活動がありました。\n   しかし、それは私の国では一般的なことであり、それがないのは奇妙なことです。\n...",
      "title": "エルサルバドルから来ました...UPDATE 3"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "已经有一段时间了，所以我给大家介绍一下事情的最新进展。\n\n * 自9月7日以来，没有发生过反BTC的抗议活动。9月15日是\n   9月15日是独立日，所以有很多原因导致了抗议活动。已经有\n   但这在我的国家是很常见的，没有这种情况很奇怪。\n...",
      "title": "我来自萨尔瓦多...更新3"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "已經有一段時間了，所以我給大家介紹一下事情的最新進展。\n\n * 自9月7日以來，沒有發生過反BTC的抗議活動。9月15日是\n   9月15日是獨立日，所以有很多原因導致了抗議活動。已經有\n   但這在我的國家是很常見的，沒有這種情況很奇怪。\n...",
      "title": "我來自薩爾瓦多...更新3"
    }
  ]
}