{
  "author": "Lyman-Zerga",
  "the_new_excerpt": "“The single greatest edge an investor can have is a long-term orientation. In a\nworld where performance comparisons are made not only annually and quarterly but\neven monthly and daily, it is more crucial than ever to take the long view. In\norder to avoid a mismatch between the time horizon of the…",
  "original_created_utc": 1621935120,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"投資家にとって最大の強みは、長期的な視点を持つことだと思います。年や四半期だけでなく\n毎年、四半期ごとだけでなく、月ごと、日ごとにパフォーマンスが比較される世界では\n年、四半期だけでなく、月、日単位で比較される世界では、長い目で見ることがこれまで以上に重要になっています。また\nの時間軸とのミスマッチを避けるためにも、長期的な視点を持つことが重要です。",
      "title": "投資家が持つ最大の強み"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"投资者能够拥有的唯一最大优势是长期取向。在一个\n在一个不仅每年和每季度，甚至每月和每天都在进行业绩比较的世界里\n在一个不仅每年、每季度，甚至每月、每天都要进行业绩比较的世界里，比以往任何时候都更有必要从长计议。为了避免\n为了避免投资者的时间跨度不匹配。",
      "title": "投资者可以拥有的唯一最大优势"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"投資者能夠擁有的唯一最大優勢是長期取向。在一個\n在一個不僅每年和每季度，甚至每月和每天都在進行業績比較的世界裏\n在一個不僅每年、每季度，甚至每月、每天都要進行業績比較的世界裏，比以往任何時候都更有必要從長計議。爲了避免\n爲了避免投資者的時間跨度不匹配。",
      "title": "投資者可以擁有的唯一最大優勢"
    }
  ],
  "title": "The single greatest edge an investor can have",
  "created_utc": 1621942852,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>“The single greatest edge an investor can have is a long-term orientation. In a world where performance comparisons are made not only annually and quarterly but even monthly and daily, it is more crucial than ever to take the long view. In order to avoid a mismatch between the time horizon of the investments and that of the investors, one&#39;s clients must share this orientation. Ours do.&quot; -  Seth Klarman, Baupost Group</p>\n\n<p>What is your investment time horizon and why?</p>\n</div><!-- SC_ON -->",
  "score": 1361,
  "permalink": "/r/investing/comments/nklmfn/the_single_greatest_edge_an_investor_can_have/",
  "subreddit": "investing",
  "id": "nklmfn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197388316
}