{
  "author": "Equivalent-Branch850",
  "the_new_excerpt": "By Joshua Franklin and Greg Roumeliotis\n\n(Reuters) - Exxon Mobil Corp (NYSE:XOM) is exploring a sale of its Advanced\nElastomer Systems (AES (NYSE:AES)) division, potentially valuing the elastic\npolymer maker at around $800 million including debt, according to people\nfamiliar with the matter.\n\nThe…",
  "original_created_utc": 1617823242,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Joshua Franklin、Greg Roumeliotis 著\n\n(ロイター) - Exxon Mobil Corp (NYSE:XOM)は、同社のアドバンスト・エラストマー・システムズ(AES) 部門の売却を検討している。\n弾性ポリマーメーカーであるアドバンスト・エラストマー・システムズ（AES (NYSE:AES)）部門の売却を検討している。\n弾性ポリマーメーカーの評価額は、負債を含めて約8億ドルになる可能性がある。\nこの問題に詳しい関係者によると\n\nこの部門は...",
      "title": "Exxon社、弾性ポリマー事業の売却を検討：情報筋"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Joshua Franklin和Greg Roumeliotis撰写。\n\n路透社）--埃克森美孚公司（NYSE:XOM）正在探索出售其先进的。\n弹性系统（AES（NYSE:AES））部门，可能会对弹性的估值。\n聚合物制造商，包括债务在内的价格约为8亿美元，据有关人士透露。\n熟悉这件事。\n\n的...",
      "title": "埃克森探讨出售弹性聚合物业务：消息人士透露"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Joshua Franklin和Greg Roumeliotis撰寫。\n\n路透社）--埃克森美孚公司（NYSE:XOM）正在探索出售其先進的。\n彈性系統（AES（NYSE:AES））部門，可能會對彈性的估值。\n聚合物製造商，包括債務在內的價格約爲8億美元，據有關人士透露。\n熟悉這件事。\n\n的...",
      "title": "埃克森探討出售彈性聚合物業務：消息人士透露"
    }
  ],
  "title": "Exxon explores sale of elastic polymer business: sources",
  "created_utc": 1617880972,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>By Joshua Franklin and Greg Roumeliotis</p>\n\n<p>(Reuters) - Exxon Mobil Corp (NYSE:XOM) is exploring a sale of its Advanced Elastomer Systems (AES (NYSE:AES)) division, potentially valuing the elastic polymer maker at around $800 million including debt, according to people familiar with the matter.</p>\n\n<p>The deal would allow the oil major to nibble at its debt pile, which totaled $45.5 billion at the end of December. Its shares are up around 37% year-to-date on investor expectations that the company will benefit from a recovery in energy prices.</p>\n\n<p>Exxon has hired investment bank Morgan Stanley (NYSE:MS) to solicit interest in AES from potential buyers, including private equity firms, the sources said.</p>\n\n<p>The sources cautioned that no deal is certain and requested anonymity because the matter is confidential. Exxon and Morgan Stanley declined to comment.</p>\n\n<p>Exxon incurred a historic loss of $22.4 billion last year. It is trying to convince a skeptical Wall Street that it can rebound after years of overspending left it deeply indebted and lagging rivals better geared for a world demanding cleaner fuels.</p>\n\n<p>AES is known for its Santoprene thermoplastic vulcanizates (TPVs), which are elastic polymers used in automotive, industrial and consumer products. The business was launched in 1991 as a limited partnership between ExxonMobil Chemical and Solutia. Exxon became the sole owner of AES in 2002.</p>\n\n<p>The global TPV market is seen growing from $1.6 billion in 2019 and to $2.6 billion in 2027, though the industry has been adversely affected by the COVID-19 pandemic due to factory shutdowns and supply chain issues, according to a report by ResearchAndMarkets.com.</p>\n</div><!-- SC_ON -->",
  "score": 65,
  "permalink": "/r/investing/comments/mm9ppe/exxon_explores_sale_of_elastic_polymer_business/",
  "subreddit": "investing",
  "id": "mm9ppe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566616792
}