{
  "author": "Wall_street_retard",
  "original_created_utc": 1635371935,
  "title": "Coinbase is about to cost me the home I just bought and there is ZERO way to contact them. I feel completely alone",
  "created_utc": 1635378152,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently bought a home and I need a statement that shows that I withdrew the money into my bank account. None is offered. Coinbase offers NO support line by phone and they do not bother to respond to emails</p>\n\n<p>This is a corporation worth hundreds of billions of dollars and they let people suffer every day because they don’t want to hire customer service </p>\n\n<p>This should be illegal. Coinbase management is scum. I am posting this here because shining a light on these issues is the only thing these corporations care about</p>\n\n<p>Edit: in response to many comments I’m receiving. I have been informed by my bank that a screenshot does not suffice. They require documentation of some sort</p>\n\n<p>Edit 2: thanks for the support! In response to another question that keeps popping up, the pdf you can generate on their website contains buy and sells of crypto, and they can see me converting the crypto into usd. But it does not show the ach transfer to my bank account</p>\n</div><!-- SC_ON -->",
  "score": 650,
  "permalink": "/r/CryptoCurrency/comments/qh7pw1/coinbase_is_about_to_cost_me_the_home_i_just/",
  "subreddit": "CryptoCurrency",
  "id": "qh7pw1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I recently bought a home and I need a statement that shows that I withdrew the\nmoney into my bank account. None is offered. Coinbase offers NO support line by\nphone and they do not bother to respond to emails\n\nThis is a corporation worth hundreds of billions of dollars and they let people\nsuffer…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近家を買ったのですが、そのお金を銀行口座に引き出したことを示す明細書が必要です。\n私の銀行口座にお金を引き出したことを示すステートメントが必要です。何も提供されません。コインベースは電話によるサポートラインを提供していません。\n電話でのサポートもなく、メールにも返信してくれません。\n\n何千億円もの価値がある企業が、人々にお金を使わせているのです。\n苦しんでいます。",
      "title": "Coinbaseは私が買ったばかりの家を犠牲にしようとしており、連絡を取る方法はゼロです。完全に孤独を感じています"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近买了一栋房子，我需要一份显示我把钱取到我的银行账户的对账单。\n我的银行账户上的钱。没有人提供。Coinbase不提供电话支持热线\n电话，他们也懒得回复邮件。\n\n这是一个价值数千亿美元的公司，他们让人们\n痛苦...",
      "title": "Coinbase即将使我失去我刚买的房子，而且没有办法联系他们。我完全感到孤独"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近買了一棟房子，我需要一份顯示我把錢取到我的銀行賬戶的對賬單。\n我的銀行賬戶上的錢。沒有人提供。Coinbase不提供電話支持熱線\n電話，他們也懶得回覆郵件。\n\n這是一個價值數千億美元的公司，他們讓人們\n痛苦...",
      "title": "Coinbase即將使我失去我剛買的房子，而且沒有辦法聯繫他們。我完全感到孤獨"
    }
  ]
}