{
  "author": "mounant",
  "original_created_utc": 1645186216,
  "title": "Why is nudity classified as 18+?",
  "created_utc": 1645201362,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Why is nudity seen as very problematic to younger audiences, when things such as violence and gore are sometimes 12+. Violence can go as low as 7+. Violence is way more harmful to society and children than tits. How is seeing a pair of titties more harmful to society when violence is a source of evil. I remember as a child seeing boobies on TV, and i thought nothing else than just boobs. I don&amp;#39;t get what the fuss is about... Am I missing something?&lt;/p&gt;\n\n&lt;p&gt;EDIT: I did not clarify this. I&amp;#39;m not talking about porn. Porn should never reach children. I&amp;#39;m talking about movies. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 128,
  "permalink": "/r/TooAfraidToAsk/comments/svggcb/why_is_nudity_classified_as_18/",
  "subreddit": "TooAfraidToAsk",
  "id": "svggcb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Why is nudity seen as very problematic to younger audiences, when things such as\nviolence and gore are sometimes 12+. Violence can go as low as 7+. Violence is\nway more harmful to society and children than tits. How is seeing a pair of\ntitties more harmful to society when violence is a source of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ヌードなどは若い観客にとって非常に問題視されるのに、なぜ？\n暴力や血しぶきなどは12歳以上であることもあります。暴力は7+まで下がることがあります 暴力は\n乳房よりも社会や子供にとって有害である。おっぱいを見ることが\nおっぱいのほうが社会にとって有害だ。",
      "title": "なぜヌードは18歳以上に分類されるのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为什么对年轻观众来说，裸体被认为是非常有问题的，而诸如暴力和血腥的东西有时是12岁以上。\n暴力和血腥的东西有时是12岁以上。暴力可以低至7+。暴力是\n暴力对社会和儿童的危害比乳头大得多。为什么看到一对\n对社会的危害更大，而暴力是一个来源......",
      "title": "为什么裸体行为被列为18岁以上？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲什麼對年輕觀衆來說，裸體被認爲是非常有問題的，而諸如暴力和血腥的東西有時是12歲以上。\n暴力和血腥的東西有時是12歲以上。暴力可以低至7+。暴力是\n暴力對社會和兒童的危害比乳頭大得多。爲什麼看到一對\n對社會的危害更大，而暴力是一個來源......",
      "title": "爲什麼裸體行爲被列爲18歲以上？"
    }
  ]
}