{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "**tldr:** Pandemic stocks had no fundamental changes to their services and products in the last 2 years. AAPL had some substantial changes that came during the pandemic.\n\nIt makes a lot of sense that a lot of companies are normalizing back to pre-pandemic values because people are slowly easing back to normal life. This has led to crashes of 20-80% for many companies.\n\nAAPL is still up \\~100% since the pandemic. What are the reasons why AAPL won't drop back down too?\n\nHere are my 6 reasons:\n\n* **People severely underestimated how much impact the Trump administration destroying Huawei phones had on Apple.** Apple benefited hugely as people bought iPhones instead of Huawei. In China, Apple is now the #1 smartphone maker again. Two years ago, I would have said this is impossible because of how strong Chinese phone makers have been and have been growing. In hindsight, the moment Trump announced the ban was the moment AAPL should have exploded.\n* **5G super-cycle** came during the pandemic\n* **Superior supply-chain management during the pandemic allowed Apple to gain permanent market shares.** In the US, the iPhone has surpassed Android in marketshare and is accelerating, which I thought would never happen again.\n* **Mac transitioned to Apple Silicon during the pandemic**, which is beating the pants off Intel and AMD chips in performance and performance per watt. Apple is now the fastest-growing computer maker and they're just getting started. The PC market is $150b/year, and Apple only has an 8% market share. If Apple is able to go up to 20 to 30%, that's a very respectable increase in revenue.\n* **Apple is expected to eventually enter some of the hottest markets during the pandemic** which were electric vehicles, self-driving cars, and the metaverse. While existing companies in those markets have dropped off, Apple hasn't even released a product for them yet. This means AAPL never actually caught the hype for these categories during the pandemic.\n* **Investors never really caught onto Apple's new strategy until recently which involves gaining market share and selling services.** Apple is no longer just serving the premium markets. The old saying \"Apple products are overpriced\" is no longer true. For $330, you can buy a new iPad. $250 and get the iPhone SE. $400 and get an iPhone SE. And I'm guessing Apple is planning a cheap Macbook SE to take PC market share too. These are excellent value products and serve as the entry points into Apple's iron grip ecosystem. Once you're in with one product, you can't get out. Next thing you know, you're buying Airpods every 2 years, subscribing to Apple Music, getting Apple Fitness+, upgrading to a Macbook Pro, using Apple Pay which gives Apple a % of the transaction, buying virtual items in stupid mobile games, etc...",
  "author_fullname": "t2_rx0gk",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "6 reasons why AAPL isn't a pandemic stock",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_sybtuk",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.74,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 44,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Company Analysis",
  "can_mod_post": false,
  "score": 44,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1645499580,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1645496866,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;tldr:&lt;/strong&gt; Pandemic stocks had no fundamental changes to their services and products in the last 2 years. AAPL had some substantial changes that came during the pandemic.&lt;/p&gt;\n\n&lt;p&gt;It makes a lot of sense that a lot of companies are normalizing back to pre-pandemic values because people are slowly easing back to normal life. This has led to crashes of 20-80% for many companies.&lt;/p&gt;\n\n&lt;p&gt;AAPL is still up ~100% since the pandemic. What are the reasons why AAPL won&amp;#39;t drop back down too?&lt;/p&gt;\n\n&lt;p&gt;Here are my 6 reasons:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;People severely underestimated how much impact the Trump administration destroying Huawei phones had on Apple.&lt;/strong&gt; Apple benefited hugely as people bought iPhones instead of Huawei. In China, Apple is now the #1 smartphone maker again. Two years ago, I would have said this is impossible because of how strong Chinese phone makers have been and have been growing. In hindsight, the moment Trump announced the ban was the moment AAPL should have exploded.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;5G super-cycle&lt;/strong&gt; came during the pandemic&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Superior supply-chain management during the pandemic allowed Apple to gain permanent market shares.&lt;/strong&gt; In the US, the iPhone has surpassed Android in marketshare and is accelerating, which I thought would never happen again.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Mac transitioned to Apple Silicon during the pandemic&lt;/strong&gt;, which is beating the pants off Intel and AMD chips in performance and performance per watt. Apple is now the fastest-growing computer maker and they&amp;#39;re just getting started. The PC market is $150b/year, and Apple only has an 8% market share. If Apple is able to go up to 20 to 30%, that&amp;#39;s a very respectable increase in revenue.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Apple is expected to eventually enter some of the hottest markets during the pandemic&lt;/strong&gt; which were electric vehicles, self-driving cars, and the metaverse. While existing companies in those markets have dropped off, Apple hasn&amp;#39;t even released a product for them yet. This means AAPL never actually caught the hype for these categories during the pandemic.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Investors never really caught onto Apple&amp;#39;s new strategy until recently which involves gaining market share and selling services.&lt;/strong&gt; Apple is no longer just serving the premium markets. The old saying &amp;quot;Apple products are overpriced&amp;quot; is no longer true. For $330, you can buy a new iPad. $250 and get the iPhone SE. $400 and get an iPhone SE. And I&amp;#39;m guessing Apple is planning a cheap Macbook SE to take PC market share too. These are excellent value products and serve as the entry points into Apple&amp;#39;s iron grip ecosystem. Once you&amp;#39;re in with one product, you can&amp;#39;t get out. Next thing you know, you&amp;#39;re buying Airpods every 2 years, subscribing to Apple Music, getting Apple Fitness+, upgrading to a Macbook Pro, using Apple Pay which gives Apple a % of the transaction, buying virtual items in stupid mobile games, etc...&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "1235582c-6848-11eb-96e8-0e132357f477",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#d6890a",
  "id": "sybtuk",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "senttoschool",
  "discussion_type": null,
  "num_comments": 61,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/sybtuk/6_reasons_why_aapl_isnt_a_pandemic_stock/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/sybtuk/6_reasons_why_aapl_isnt_a_pandemic_stock/",
  "subreddit_subscribers": 3670266,
  "created_utc": 1645544067,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1645496866,
  "the_new_excerpt": "tldr: Pandemic stocks had no fundamental changes to their services and products\nin the last 2 years. AAPL had some substantial changes that came during the\npandemic.\n\nIt makes a lot of sense that a lot of companies are normalizing back to\npre-pandemic values because people are slowly easing back to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "tldr: パンデミック株は、サービスや製品に基本的な変更はありません。\n過去2年間で AAPLは、この2年間に大きな変化がありました。\nパンデミック\n\n多くの企業がパンデミック前の水準に戻りつつあるのは、非常に理にかなっています。\nパンデミック前の価値観に、人々が徐々に戻っていくからです...",
      "title": "AAPLがパンデミック銘柄でない6つの理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "tldr: Pandemic股票在过去两年中没有对其服务和产品进行根本性的改变。\n在过去2年中没有发生根本性变化。AAPL在大流行期间发生了一些实质性的变化。\n大流行期间发生的。\n\n很多公司正在恢复到大流行前的正常状态，这很有意义。\n因为人们正在慢慢恢复到......。",
      "title": "AAPL不是大流行股的6个原因"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "tldr: Pandemic股票在過去兩年中沒有對其服務和產品進行根本性的改變。\n在過去2年中沒有發生根本性變化。AAPL在大流行期間發生了一些實質性的變化。\n大流行期間發生的。\n\n很多公司正在恢復到大流行前的正常狀態，這很有意義。\n因爲人們正在慢慢恢復到......。",
      "title": "AAPL不是大流行股的6個原因"
    }
  ]
}