{
  "author": "Pixeth_",
  "original_created_utc": 1634330671,
  "title": "If a crypto millionaire is a 'whale', what are you?",
  "created_utc": 1634344719,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think i&#39;d be like a crab or something, although maybe that&#39;s being a bit big-headed - perhaps a shrimp, although i think even that might be too large for my portfolio to be compared to.</p>\n\n<p>Plankton? Or like one of those microscopic larval stages of larger fish?</p>\n\n<p>Or maybe just krill, because they&#39;re eaten by whales? And if the whales decide a project is worth pulling out of, my portfolio gets swallowed up and digested?</p>\n\n<p>What do you think? Which sea-dwelling creature would you compare yourself to if only considering your portfolio?</p>\n\n<p>Actually, no. I think I&#39;ve got it - <strong>Blobfish.</strong> I&#39;m the blobfish of crypto</p>\n</div><!-- SC_ON -->",
  "score": 183,
  "permalink": "/r/CryptoCurrency/comments/q8x2py/if_a_crypto_millionaire_is_a_whale_what_are_you/",
  "subreddit": "CryptoCurrency",
  "id": "q8x2py",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I think i'd be like a crab or something, although maybe that's being a bit\nbig-headed - perhaps a shrimp, although i think even that might be too large for\nmy portfolio to be compared to.\n\nPlankton? Or like one of those microscopic larval stages of larger fish?\n\nOr maybe just krill, because they're…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、カニか何かになると思いますが、それはちょっと大げさかもしれません。\n海老かもしれませんが、それも私のポートフォリオには大きすぎるかもしれません。\n私のポートフォリオと比較するには大きすぎるかもしれません。\n\nプランクトン？あるいは、大きな魚の微小な幼生のようなもの？\n\nあるいは、オキアミかもしれません。",
      "title": "暗号大富豪が「クジラ」ならば、あなたは何者？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想我就像一只螃蟹或其他什么东西，虽然这可能是有点\n大头--也许是一只虾，虽然我认为即使是虾也可能太大，无法与我的作品集相比。\n我的作品集可以与之相比。\n\n浮游生物？或者像那些大型鱼类的微观幼虫阶段？\n\n或者也许只是磷虾，因为它们是......",
      "title": "如果加密货币百万富翁是 \"鲸鱼\"，你是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想我就像一隻螃蟹或其他什麼東西，雖然這可能是有點\n大頭--也許是一隻蝦，雖然我認爲即使是蝦也可能太大，無法與我的作品集相比。\n我的作品集可以與之相比。\n\n浮游生物？或者像那些大型魚類的微觀幼蟲階段？\n\n或者也許只是磷蝦，因爲它們是......",
      "title": "如果加密貨幣百萬富翁是 \"鯨魚\"，你是什麼？"
    }
  ]
}