{
  "author": "MickeytheMick",
  "original_created_utc": 1642606101,
  "title": "What was the purpose/structure of a Harem?",
  "created_utc": 1642614558,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m reading William Dalrymples &amp;quot;Return of a King&amp;quot; (1st Anglo Afghan War) and a lot of references are made to the harems of various Indian and Afghan aristocrats. I had always assumed a harem was a small selection of a nobleman&amp;#39;s favorite mistresses, but in this book there are references to harems comprised of hundreds of people of apparently varying status, including concubines, various servants, &amp;quot;slave girls&amp;quot;, and some men as well. &lt;/p&gt;\n\n&lt;p&gt;In short, I was hoping for any information on the structure, purpose, or history of this institution and the lives of those who comprised the harem -- doesn&amp;#39;t have to be limited to 19th Century Afghanistan/India.&lt;/p&gt;\n\n&lt;p&gt;Thanks!&lt;/p&gt;\n\n&lt;p&gt;Some more specific questions:\n- what&amp;#39;s the difference between someone deemed a &amp;quot;slave&amp;quot; or a servant, in the context of a harem?\n- were any members allowed to leave the compound at will or wouod they need to escape?\n- to what extent did sex/&amp;quot;romance&amp;quot; play a role in a harem? Were the roles of harem members sexual at all or is that just a western invention?\n- what happens to harem members when their patron(?) Lord died? Were they left on their own or would the servants/slaves have been bequeathed(?) to a successor?\n- there&amp;#39;s a lot of Afghan sources from the time citing British soldiers&amp;#39; sexual indiscretions and &amp;quot;lack of honor&amp;quot; (having liaisons with slave girls, commoners, some noble women -- the woman&amp;#39; status doesnt seem to make much difference) as a major factor in the unpopularity of the occupation: If Afghan harems did serve a specific sexual function, why was this British behavior still seen as scandalous by comparison?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/s7sm1l/what_was_the_purposestructure_of_a_harem/",
  "subreddit": "AskHistorians",
  "id": "s7sm1l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm reading William Dalrymples \"Return of a King\" (1st Anglo Afghan War) and a\nlot of references are made to the harems of various Indian and Afghan\naristocrats. I had always assumed a harem was a small selection of a nobleman's\nfavorite mistresses, but in this book there are references to harems…"
}