{
  "author": "ManyArtichoke",
  "the_new_excerpt": "For years, everyone was talking about how significant it would be for someone\nlike Elon Musk to get involved in the cryptocurrency space. With his\nintelligence, wealth, and influence, many believed that Elon had the power to\nreally help the masses adopt and understand cryptocurrency.\n\nWe could not…",
  "original_created_utc": 1619014331,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "何年も前から、イーロン・マスクのような人物が暗号通貨の分野に参入することがどれほど意義深いことなのか、誰もが話していました。\nイーロン・マスクのような人物が暗号通貨の分野に参入することがどれほど重要か、何年も前から誰もが話していました。彼の知性と\n知性、富、影響力を持つイーロンは、大衆が暗号通貨を採用し、理解するのを助ける力を持っていると多くの人が信じていました。\n大衆が暗号通貨を採用し、理解するのを助ける力があると信じていました。\n\n私たちは...",
      "title": "イーロン・マスクは、暗号通貨スペース全体に大きな失望を与えている"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "多年来，每个人都在谈论像埃隆-马斯克这样的人参与加密货币领域将是多么的重要。\n像埃隆-马斯克这样的人参与到加密货币领域有多么重要。凭借他的\n智慧、财富和影响力，许多人认为埃隆有能力\n真正帮助大众采用和理解加密货币。\n\n我们不可能...",
      "title": "埃隆-马斯克让整个加密货币领域大失所望"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "多年來，每個人都在談論像埃隆-馬斯克這樣的人蔘與加密貨幣領域將是多麼的重要。\n像埃隆-馬斯克這樣的人蔘與到加密貨幣領域有多麼重要。憑藉他的\n智慧、財富和影響力，許多人認爲埃隆有能力\n真正幫助大衆採用和理解加密貨幣。\n\n我們不可能...",
      "title": "埃隆-馬斯克讓整個加密貨幣領域大失所望"
    }
  ],
  "title": "Elon Musk has been a massive disappointment to the entire cryptocurrency space",
  "created_utc": 1619087437,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For years, everyone was talking about how significant it would be for someone like Elon Musk to get involved in the cryptocurrency space. With his intelligence, wealth, and influence, many believed that Elon had the power to really help the masses adopt and understand cryptocurrency. </p>\n\n<p>We could not have been more wrong. </p>\n\n<p>Elon turned out to be a glorified YouTuber only interested in pumping and dumping a small market cap coin, while displaying absolutely no understanding of what makes cryptocurrency so important. </p>\n\n<p>To be clear, I dont have anything against DOGE. It&#39;s just disappointing to see someone of Elon&#39;e stature use his power and influence to pump a meme coin rather than contribute to the space in a meaningful way.</p>\n</div><!-- SC_ON -->",
  "score": 188,
  "permalink": "/r/CryptoCurrency/comments/mvgjb1/elon_musk_has_been_a_massive_disappointment_to/",
  "subreddit": "CryptoCurrency",
  "id": "mvgjb1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776207012
}