{
  "author": "Chaoscontrol9999",
  "original_created_utc": 1657283520,
  "title": "Girl I’m dating wants to wait until she comes back from her holiday before being exclusive. Am I being played?",
  "created_utc": 1657288116,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;She wants to come back from her holidays before being exclusive. Should I accept?&lt;/p&gt;\n\n&lt;p&gt;She’s going on a “girls holiday” with her friend group. About 8 of them. Going to Ibiza to party and stuff &lt;/p&gt;\n\n&lt;p&gt;She said we can discuss being exclusive when she back. Why do I feel like she wants to do go mad on her holiday without feeling guilty?&lt;/p&gt;\n\n&lt;p&gt;Should I accept or not  and move on ?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 383,
  "permalink": "/r/NoStupidQuestions/comments/vu9ptl/girl_im_dating_wants_to_wait_until_she_comes_back/",
  "subreddit": "NoStupidQuestions",
  "id": "vu9ptl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "She wants to come back from her holidays before being exclusive. Should I\naccept?\n\nShe’s going on a “girls holiday” with her friend group. About 8 of them. Going\nto Ibiza to party and stuff\n\nShe said we can discuss being exclusive when she back. Why do I feel like she\nwants to do go mad on her…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼女は休暇から帰ってきてから独占したいのです。私は受け入れるべきでしょうか？\n受け入れるべきでしょうか？\n\n彼女は友人グループと「ガールズ・ホリデー」に行くそうです。8人くらいです。行く\nイビサ島でパーティーとか\n\n彼女が戻ってきたら、独占することについて話し合おうって言ってたんだ。なぜ私は彼女が\nなぜか、彼女が狂喜乱舞しているように感じる...",
      "title": "私が付き合っている女の子は、彼女が休暇から戻ってくるまで、独占するのを待ちたがっています。私は遊ばれているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "她想在独占之前从假期中回来。我应该\n接受吗？\n\n她要和她的朋友们一起去 \"女生度假\"。大约有8个人。要去\n去伊比沙岛参加聚会和其他活动\n\n她说我们可以在她回来后讨论独占问题。为什么我觉得她\n想在她身上做疯狂的事......",
      "title": "我约会的女孩想等到她度假回来后再专一。我被耍了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "她想在獨佔之前從假期中回來。我應該\n接受嗎？\n\n她要和她的朋友們一起去 \"女生度假\"。大約有8個人。要去\n去伊比沙島參加聚會和其他活動\n\n她說我們可以在她回來後討論獨佔問題。爲什麼我覺得她\n想在她身上做瘋狂的事......",
      "title": "我約會的女孩想等到她度假回來後再專一。我被耍了嗎？"
    }
  ]
}