{
  "author": "Phosgene1394",
  "the_new_excerpt": "TL;DR: Retail investors got a voice and the world saw the plain-view illegal\nacts of some brokerages/investment firms\n\nBefore, the shady activity of the brokerages was hidden from the general public.\nThey were able to manipulate the markets all they wanted and get away with it\nbecause the…",
  "original_created_utc": 1612019004,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "TL;DR：散户有了话语权，全世界都看到了明目张胆的违法行为。\n一些经纪/投资公司的行为。\n\n以前，券商的黑幕活动是不为公众所知的。\n他们可以随心所欲地操纵市场，并且逍遥法外。\n因为...",
      "title": "舆论不看好。本周解读的事件对散户来说是好事"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TL;DR：散戶有了話語權，全世界都看到了明目張膽的違法行爲。\n一些經紀/投資公司的行爲。\n\n以前，券商的黑幕活動是不爲公衆所知的。\n他們可以隨心所欲地操縱市場，並且逍遙法外。\n因爲...",
      "title": "輿論不看好。本週解讀的事件對散戶來說是好事"
    }
  ],
  "title": "Unpopular opinion: The events that unraveled this week were good for the retail investor",
  "created_utc": 1612033756,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TL;DR: Retail investors got a voice and the world saw the plain-view illegal acts of some brokerages/investment firms</p>\n\n<p>Before, the shady activity of the brokerages was hidden from the general public. They were able to manipulate the markets all they wanted and get away with it because the &quot;commoners&quot; didn&#39;t care or understand. </p>\n\n<p>Now, with millions of retain investors that flooded the market, a shift in &quot;market influence&quot; in favor of smaller, amateur traders. And the gargantuan, amorphous investment firms didn&#39;t like that at all. </p>\n\n<p>It has become a battle of market influence, and the hedge funds and brokerages with massive amounts of capital are doing WHATEVER IT TAKES (illegal or not) to make sure that they retain that authority that they previously held for so many years. (flooding certain stocks with short positions, disabling certain stocks)</p>\n\n<p>But with investment firms taking blatant illegal action to accomplish their goals, their shady activity has been revealed for the world to see and it seem as of now, that the general public, as well as some democrat lawmakers have taken an interest to them. (It also shows how corrupt the SEC is with them taking their sweet time to decide which side they want to be on)</p>\n\n<p>Hopefully through this incident, the integrity of the US markets can be improved with dishonest brokerages being dissolved. (I think it is wishful thinking that market makers such as Citadel could be dissolved, considering the HUGE number of brokerages with reliance to the company)</p>\n</div><!-- SC_ON -->",
  "score": 84,
  "permalink": "/r/stocks/comments/l8nh4c/unpopular_opinion_the_events_that_unraveled_this/",
  "subreddit": "stocks",
  "id": "l8nh4c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518537976
}