{
  "author": "Successful_Craft3076",
  "original_created_utc": 1643514919,
  "title": "Dear brothers and sisters in crypto. future of crypto will not/can't be a single coin. The sooner you understand this the sooner you will stop bashing rival projects.",
  "created_utc": 1643596993,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know everyone here wants some solid profit. \nI know all of us could use some juicy $.&lt;/p&gt;\n\n&lt;p&gt;But hear me out. Just like the web long before it , each blockchain architecture serves a different purpose. Sure some will disappear. Sure some might do one or two thing better than another. But the most likely scenario for the future of crypto is a network of integrated blockchains working together.&lt;/p&gt;\n\n&lt;p&gt;Some will provide security. Some will do transactions and so one. Better projects will replace older ones and the whole concept will live on. It is just short sighted to think one specific chain would solve every problem and provide every service. &lt;/p&gt;\n\n&lt;p&gt;Crypto needs to be flexible and evolve according to needs of people/enterprises or else it will fall apart. Don&amp;#39;t defend a single project like it is your religion. The important thing is for crypto revolution to move on and become a part of life for every human being on earth.&lt;/p&gt;\n\n&lt;p&gt;It is bigger than any single project. Please try to understand this.&lt;/p&gt;\n\n&lt;p&gt;Ps: I thought it was obvious but seems I have to clarify it. By &amp;quot;not any single project&amp;quot; I don&amp;#39;t mean &amp;quot;every shitty&amp;quot; project will win or survive. Maybe less than a percent of current projects are legit. \nI was talking about several successful project in different application categories. &lt;/p&gt;\n\n&lt;p&gt;Best regards&lt;/p&gt;\n\n&lt;p&gt;Vve&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 308,
  "permalink": "/r/CryptoCurrency/comments/sg04r0/dear_brothers_and_sisters_in_crypto_future_of/",
  "subreddit": "CryptoCurrency",
  "id": "sg04r0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I know everyone here wants some solid profit. I know all of us could use some\njuicy $.\n\nBut hear me out. Just like the web long before it , each blockchain architecture\nserves a different purpose. Sure some will disappear. Sure some might do one or\ntwo thing better than another. But the most likely…"
}