{
  "author": "Successful_Craft3076",
  "original_created_utc": 1643514919,
  "title": "Dear brothers and sisters in crypto. future of crypto will not/can't be a single coin. The sooner you understand this the sooner you will stop bashing rival projects.",
  "created_utc": 1643596993,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know everyone here wants some solid profit. \nI know all of us could use some juicy $.&lt;/p&gt;\n\n&lt;p&gt;But hear me out. Just like the web long before it , each blockchain architecture serves a different purpose. Sure some will disappear. Sure some might do one or two thing better than another. But the most likely scenario for the future of crypto is a network of integrated blockchains working together.&lt;/p&gt;\n\n&lt;p&gt;Some will provide security. Some will do transactions and so one. Better projects will replace older ones and the whole concept will live on. It is just short sighted to think one specific chain would solve every problem and provide every service. &lt;/p&gt;\n\n&lt;p&gt;Crypto needs to be flexible and evolve according to needs of people/enterprises or else it will fall apart. Don&amp;#39;t defend a single project like it is your religion. The important thing is for crypto revolution to move on and become a part of life for every human being on earth.&lt;/p&gt;\n\n&lt;p&gt;It is bigger than any single project. Please try to understand this.&lt;/p&gt;\n\n&lt;p&gt;Ps: I thought it was obvious but seems I have to clarify it. By &amp;quot;not any single project&amp;quot; I don&amp;#39;t mean &amp;quot;every shitty&amp;quot; project will win or survive. Maybe less than a percent of current projects are legit. \nI was talking about several successful project in different application categories. &lt;/p&gt;\n\n&lt;p&gt;Best regards&lt;/p&gt;\n\n&lt;p&gt;Vve&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 308,
  "permalink": "/r/CryptoCurrency/comments/sg04r0/dear_brothers_and_sisters_in_crypto_future_of/",
  "subreddit": "CryptoCurrency",
  "id": "sg04r0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I know everyone here wants some solid profit. I know all of us could use some\njuicy $.\n\nBut hear me out. Just like the web long before it , each blockchain architecture\nserves a different purpose. Sure some will disappear. Sure some might do one or\ntwo thing better than another. But the most likely…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここにいる皆さんは、確かな利益を求めているのでしょう。私たちは皆、いくらかの\nジューシーなドル\n\nしかし、私の話を聞いてください。ウェブがそうであったように、各ブロックチェーン・アーキテクチャは\n異なる目的を持っています。もちろん、消えていくものもあるでしょう。確かに、あるものは、1つまたは\n他のものよりも優れているものが2つあります。しかし、最も可能性が高いのは...",
      "title": "暗号の兄弟姉妹の皆さん。暗号の未来は、単一のコインにはならないでしょうし、なり得ないでしょう。このことを早く理解すれば、ライバルのプロジェクトをバッシングするのをやめることができます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道这里的每个人都想获得一些可靠的利润。我知道我们所有人都可以使用一些\n多汁的美元。\n\n但请听我说。就像很久以前的网络一样，每个区块链架构\n都有不同的目的。当然，有些会消失。当然，有些可能会做一或\n比另一个更好的事情。但最有可能的是...",
      "title": "亲爱的加密货币的兄弟姐妹们。加密货币的未来不会/不可能是单一的硬币。你们越早明白这一点，就会越早停止抨击对手的项目。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道這裏的每個人都想獲得一些可靠的利潤。我知道我們所有人都可以使用一些\n多汁的美元。\n\n但請聽我說。就像很久以前的網絡一樣，每個區塊鏈架構\n都有不同的目的。當然，有些會消失。當然，有些可能會做一或\n比另一個更好的事情。但最有可能的是...",
      "title": "親愛的加密貨幣的兄弟姐妹們。加密貨幣的未來不會/不可能是單一的硬幣。你們越早明白這一點，就會越早停止抨擊對手的項目。"
    }
  ]
}