{
  "author": "Linus_Naumann",
  "original_created_utc": 1627744313,
  "title": "Reality as a social construct – How IOTAs radical tech-decisions aim to disrupt the DLT space",
  "created_utc": 1627782314,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone,</p>\n\n<p>Many of you recognize IOTA for its bold technological aims that have sparked lots of controversy in the DLT community. While supporters feel they are witnessing the birth of another technological revolution, others discard IOTAs lofty goals as hand-waving and vaporware.</p>\n\n<p>Here I want to bring some substance to this debate by explaining WHY IOTA claims to develop disruptive and groundbreaking DLT and how this claim is based on a mind-boggling technological decision: To give up on objective reality in the network</p>\n\n<p><strong>Whats the problem with blockchains?</strong></p>\n\n<p>Blockchains are limited in their use and real-world adoption due to fundamental design characteristics, which cannot be fixed by fine-tuning some parameters – instead, to achieve a real breakthrough, the whole concept must be questioned.</p>\n\n<p><strong>Problem 1: Blockchains will never be fully decentralized and will always rely on middle-men</strong></p>\n\n<p>Databases traditionally rely on permissioned leaders to decide which transactions (tx) will be booked into the ledger. Bitcoins novelty was to find a way determine a temporary leader between non-trusting parties – whoever solves the hash-puzzle first gets to decide the changes in the next block. Today we know various methods for finding leaders, most popular being proof-of-work (PoW) and proof-of-stake (PoS). However, although blockchain was a good step towards decentralization, participants of these networks will always rely on very small minorities of powerful figures to participate in the network: Either corporations (professional miners) or rich people (stakers).</p>\n\n<p>Another serious downside of leader-based DLTs is that in order to convince them to include someones tx, they must be paid with fees. A bidding contest for the limited space on the blockchain ensues, that gives rise to unpredictable and sometimes exploding prices. PoW additionally faces the problem of completely relying on an immense use of energy – a practice, which in times of climate-crisis is regarded by many as anachronistic (more discussion about that in THIS thread).</p>\n\n<p>PoS on the other hand suffers from very high risk of increasing centralization, because the richest stakers are continuously rewarded with ever more tokens – which creates a feedback-loop of power-accumulation for the already rich. Terrible scenarios arise when a powerful entity disguises itself as many, seemingly unrelated, network participants and uses its power to control the network. Participants would believe they are part of a decentralized network, while actually living in a hidden dictatorship.</p>\n\n<p><strong>Problem 2: Blockchains can´t scale</strong></p>\n\n<p>There are many use-cases in finance, digital identity, smart contracts, token-economy and data-economy which rely heavily on huge amounts of fast tx. This observation implies at least two requirements for the underlying DLT protocol:</p>\n\n<ol>\n<li>Being able to process very high tps</li>\n<li>Fees per tx must be both negligible and predictable or, much preferably, zero (feeless).</li>\n</ol>\n\n<p>The fact that real-world adaptation of DLTs is mostly stalling shows, that current protocols cannot yet offer solutions to these requirements. To tackle these problems, some blockchains try to scale and reduce fees by static sharding (for example splitting the main blockchain into 64 smaller blockchains, each with only 1/64 of security), while other focus more on 2nd layer solutions with similar trade-offs.</p>\n\n<p><strong>Reality as a social construct – IOTAs leaderless consensus</strong></p>\n\n<p>The IOTA protocol was described as a “blockchain, but without blocks and without chain”. But how can a protocol without any truth-deciding leader protect itself against the most fundamental of all threads, the double-spend attempts?</p>\n\n<p>IOTA is a directed acyclic graph (DAG), in which tx don’t run linearly as a chain, but in parallel to each other. Without a leader, each node is equal part of the network and can attach its tx directly to the ledger state – no middle-man needed, no fees to be paid. For this, a node communicates its tx to its neighbouring nodes. These neighbours then forward this change further into the network. Using this gossiping-protocol, the issued tx ripples through the network, until every node has heard of it.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/8rm71w46eke71.png?width=498&amp;format=png&amp;auto=webp&amp;s=1188d6d1f8125ec9f617ae2ebaa22aa1d163f9ea\">https://preview.redd.it/8rm71w46eke71.png?width=498&amp;format=png&amp;auto=webp&amp;s=1188d6d1f8125ec9f617ae2ebaa22aa1d163f9ea</a></p>\n\n<p><strong>Figure 1:</strong> Overview network-topology of blockchains vs DAGs. Source: <a href=\"https://www.quantyca.com/wp-content/uploads/2020/03/Blockchain_vs_tangle_bottleneck.png\">https://www.quantyca.com/wp-content/uploads/2020/03/Blockchain_vs_tangle_bottleneck.png</a></p>\n\n<p><strong>Big problem: Double-spend transcations</strong></p>\n\n<p>Based on this design an immediate problem arises: A node could issue a double-spend tx by telling different neighbouring nodes differing variants of this tx.</p>\n\n<p><strong>For example:</strong> Node A tells node B that it issues tx1, which transfers tokens from address A to address B. Simultaneously Node A tells node C that it issues tx2, which transfers <strong>the same</strong> tokens to from address A to address C. Once Node B and Node C gossip, they quickly find out about the double-spend attempt. Tx1 and tx2 cannot be true at the same time. But how can both nodes come to an agreement about which tx came first? For now, both nodes live in objectively different realities, with no way to logically deduce who´s perception is right and who´s is wrong.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/0y67dem7eke71.png?width=597&amp;format=png&amp;auto=webp&amp;s=68a762fb1f98bc59ec908b0fac083d909ca29dea\">https://preview.redd.it/0y67dem7eke71.png?width=597&amp;format=png&amp;auto=webp&amp;s=68a762fb1f98bc59ec908b0fac083d909ca29dea</a></p>\n\n<p><strong>Figure 2:</strong> Node A sends conflicting information to nodes B and C. Node B and C will agree, that a double-spend attempt exists, but cannot agree, which tx was first.</p>\n\n<p><strong>The parallel-reality based ledger-state</strong></p>\n\n<p>Instead of halting the network until the conflict is resolved (for example by asking every single node in the network about their perception and decide democratically which tx was first. This approach would be slow as hell and would not scale), both nodes keep going with their parallel realities. They gossip <strong>their</strong> variant of the truth to the network and keep processing other tx as if nothing happened.</p>\n\n<p><strong>Constructing reality via on-tangle voting (aka “Multiverse consensus”)</strong></p>\n\n<p>How do societies decide how to solve a conflict, if they don’t want to rely on some authoritarian leader? They conduct a democratic vote! The problem is, in a permissionless network like IOTAs Tangle it is impossible to have a classical democratic decision (1 entity = 1 vote), since a malicious entity could simply flood the network with countless nodes to manipulate the vote.</p>\n\n<p>The secret sauce here lies in a node-reputation system called “<strong>Consensus Mana</strong>” (cMana). Nodes earn cMana by attaching value tx to the network. Every node in the network can verify another nodes cMana by checking its recent history of value tx processing.</p>\n\n<p>Nodes automatically vote which tx of a double-spend is “the right one”, simply by gossiping their version of reality to other nodes. The double-spend is resolved when 51% of the total cMana in the network approves one version of the double-spend.</p>\n\n<p><strong>Example:</strong> A double-spend attempt propagates through the network via gossiping.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/9hbtuww8eke71.png?width=604&amp;format=png&amp;auto=webp&amp;s=35103c774f4a3473e31810ff35258f9614a252a9\">https://preview.redd.it/9hbtuww8eke71.png?width=604&amp;format=png&amp;auto=webp&amp;s=35103c774f4a3473e31810ff35258f9614a252a9</a></p>\n\n<p><strong>Figure 3:</strong> A double-spend attempt propagates through the network. Circles represent nodes. Lines represent gossip between nodes. Colors and numbers represent which tx of the double-spend the node saw first.</p>\n\n<p>Over time a winner emerges: One of the conflicting tx amasses 51% of all cMana approval behind it. Note: It will <strong>not</strong> be decided which tx actually came first, but only which one was <strong>heard</strong> first by nodes holding 51% of cMana. The nodes construct the reality of the network collaboratively.</p>\n\n<p>What happens to the nodes, that voted for the losing transaction? Nodes will learn over time that the majority of cMana approves the other tx. Since these nodes are honest and only voted for the losing tx, because it was their <strong>objective reality</strong> that this tx came first (not because they wanted to cheat), they will now flip their opinion to align with the majority of cMana. The losing tx and all following tx of the same funds are dropped and the network pretends they never happened.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/oce45t7beke71.png?width=605&amp;format=png&amp;auto=webp&amp;s=dec94f67c2dc557e810f64d400080202cad3bfba\">https://preview.redd.it/oce45t7beke71.png?width=605&amp;format=png&amp;auto=webp&amp;s=dec94f67c2dc557e810f64d400080202cad3bfba</a></p>\n\n<p><strong>Figure 4:</strong> More than 51% of cMana approves that tx2 was indeed the first tx of the double-spend attempt. All honest nodes that heard about tx1 first will now change their opinion to align with the opinion of the majority of cMana.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/zjribrhceke71.png?width=605&amp;format=png&amp;auto=webp&amp;s=d590d90560173de56d7683e7cad6ca5b4a392f4d\">https://preview.redd.it/zjribrhceke71.png?width=605&amp;format=png&amp;auto=webp&amp;s=d590d90560173de56d7683e7cad6ca5b4a392f4d</a></p>\n\n<p><strong>Figure 5:</strong> The network agreed on a common reality. Tx1 is dropped and plays no role in the future.</p>\n\n<p><strong>Leaderless consensus – true decentralization needs no middle-men and no fees</strong></p>\n\n<p>The IOTA Foundation developed a completely new consensus model that is truly decentralized: No mining- or staking-oligopols decide the fate of the network. Since every node writes its own tx into the Tangle, without any leaders or middle-men, the network runs <strong>feeless</strong>. Since not all nodes have to agree about the state of reality at all times, the network is <strong>fast</strong> and <strong>scalable</strong> (currently 1000+ tps on mainnet, &lt;10s solidification time).</p>\n\n<p><strong>Remaining problems</strong></p>\n\n<p>These recent breakthroughs took years in research, analysis, trial and error on testnets and input from academia and industry and are not fully implemented in any testnet. Currently, the IOTA mainnet is fully centralized, with just one node (the coordinator) deciding over double-spend conflicts.</p>\n\n<p>However, the IOTA Foundation recently published the fully decentralized IOTA 2.0 DevNet to showcase their working solutions. The DevNet is not yet feature complete (some modules such as congestion control and dust protection are missing and the current features are still prone to changes). Mainnet decentralization (“Coordicide”) will not happen this year.</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/ov8v7z/reality_as_a_social_construct_how_iotas_radical/",
  "subreddit": "CryptoCurrency",
  "id": "ov8v7z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi everyone,\n\nMany of you recognize IOTA for its bold technological aims that have sparked\nlots of controversy in the DLT community. While supporters feel they are\nwitnessing the birth of another technological revolution, others discard IOTAs\nlofty goals as hand-waving and vaporware.\n\nHere I want to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\nIOTAは、その大胆な技術的目標から、多くの人が認知しています。\nDLTコミュニティでは多くの論争がありました。支持者たちは、自分たちが\n新たな技術革命の誕生を目の当たりにする一方で、IOTAを切り捨てる人もいる。\n高邁な目標は、手のひらを返したような、気まぐれなものです。\n\nここでは...",
      "title": "社会的構築物としての現実 - IOTAがDLT分野を破壊するための抜本的な技術的決断を下す方法"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n你们中的许多人都认识到IOTA的大胆技术目标，这在DLT社区引发了许多争议。\n在DLT社区引起了很多争议。虽然支持者们认为他们正在\n拥护者认为他们正在见证另一场技术革命的诞生，而其他人则认为IOTAs\n崇高的目标，认为是挥霍无度的空谈。\n\n在这里，我想...",
      "title": "现实是一种社会建构--IOTA的激进技术决定旨在颠覆DLT空间"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n你們中的許多人都認識到IOTA的大膽技術目標，這在DLT社區引發了許多爭議。\n在DLT社區引起了很多爭議。雖然支持者們認爲他們正在\n擁護者認爲他們正在見證另一場技術革命的誕生，而其他人則認爲IOTAs\n崇高的目標，認爲是揮霍無度的空談。\n\n在這裏，我想...",
      "title": "現實是一種社會建構--IOTA的激進技術決定旨在顛覆DLT空間"
    }
  ]
}