{
  "author": "krstyan",
  "original_created_utc": 1636466419,
  "title": "Why is there an American running joke in TV and movies that people in Europe walk around nude and/or don’t care about nudity?",
  "created_utc": 1636485016,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve heard it in so many TV shows, particularly sitcoms. </p>\n\n<p>If the main character walks around naked and they excuse themselfs because europeans walk around their house naked all the time. </p>\n\n<p>Or when a new character is introduced and he walks around nude he has to be european or the rest of the character assume he is. </p>\n\n<p>When Michael from the office was caught by Pam naked he said “european offices are naked all the time”. </p>\n\n<p>Obviously americans don’t believe that is true, but I wonder where does that joke originate?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/qq4ag5/why_is_there_an_american_running_joke_in_tv_and/",
  "subreddit": "TooAfraidToAsk",
  "id": "qq4ag5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve heard it in so many TV shows, particularly sitcoms.\n\nIf the main character walks around naked and they excuse themselfs because\neuropeans walk around their house naked all the time.\n\nOr when a new character is introduced and he walks around nude he has to be\neuropean or the rest of the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くのテレビ番組、特にシットコムで聞いたことがあります。\n\n主人公が裸で歩き回っていたら、「ヨーロッパ人はいつも裸で家の中を歩き回っているから」と言い訳するのです。\nヨーロッパ人は家の中でいつも裸で歩いているから」と言い訳する。\n\nあるいは、新しいキャラクターが登場して裸で歩き回っていたら、彼はヨーロッパ人でなければならない。\nヨーロッパ人でなければならないとか...。",
      "title": "テレビや映画の中で、ヨーロッパの人々はヌードで歩いている、あるいはヌードを気にしていないというアメリカ人のジョークがあるのはなぜですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在很多电视节目中都听到过这种说法，特别是情景喜剧。\n\n如果主角赤身裸体地走来走去，他们为自己开脱，因为\n欧洲人总是光着身子在他们的房子里走来走去。\n\n或者当一个新的角色被介绍进来，他裸体走来走去，他必须是\n欧洲人或其他...",
      "title": "为什么在电视和电影中会有一个美国人的笑话，说欧洲人裸体走动和/或不关心裸体问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在很多電視節目中都聽到過這種說法，特別是情景喜劇。\n\n如果主角赤身裸體地走來走去，他們爲自己開脫，因爲\n歐洲人總是光着身子在他們的房子裏走來走去。\n\n或者當一個新的角色被介紹進來，他裸體走來走去，他必須是\n歐洲人或其他...",
      "title": "爲什麼在電視和電影中會有一個美國人的笑話，說歐洲人裸體走動和/或不關心裸體問題？"
    }
  ]
}