{
  "author": "ipetgoat1984",
  "original_created_utc": 1641344335,
  "title": "Learning how to invest in crypto has been absolutely empowering as a woman.",
  "created_utc": 1641358323,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have been working in digital for over twenty years, and the first time I heard about crypto was from one of my fellow devs who was mining Doge in 2014. I bought about $50 worth of it back then and ended up losing access to wherever it was stored at the time. No big deal, it was my first lesson in this crypto journey, one of many. &lt;/p&gt;\n\n&lt;p&gt;After years of not paying much attention to crypto and working on other investments; stocks, real estate, retirement funds, etc. I came back to the space in 2019 with a renewed passion and drive. Stocks had always bored me, I never felt like it was a market I related with, and since I work in digital, crypto makes sense to me. &lt;/p&gt;\n\n&lt;p&gt;So I got back into Doge because that&amp;#39;s where I started. And then BTC and then ETH all around the same time in 2019. Then came alts, and with them came tons of research and discovery, buying projects I believe in. The crypto world&amp;#39;s volatility didn&amp;#39;t scare me then, and it doesn&amp;#39;t scare me now because I think it&amp;#39;s the future, and I refuse to sit on fiat that isn&amp;#39;t working for me.&lt;/p&gt;\n\n&lt;p&gt;Fast forward to this fine new year, and I am so proud to have grown my portfolio to what it is today. To be a woman in this space, understand the fundamentals, and withstand the fear is very empowering. So to all the women out there who are either veterans in the crypto space or newbies, keep going!! It&amp;#39;s an honor to invest alongside all of you! And cheers to the men out there crushing it too!&lt;/p&gt;\n\n&lt;p&gt;EDIT: this is absolutely not an anti-man post! Yeesh! Men rock! This is more about women having confidence to invest, learn, grow and become financially independent. Ultimately being able to build an empire with their crypto loving mate!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 349,
  "permalink": "/r/CryptoCurrency/comments/rw9smd/learning_how_to_invest_in_crypto_has_been/",
  "subreddit": "CryptoCurrency",
  "id": "rw9smd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have been working in digital for over twenty years, and the first time I heard\nabout crypto was from one of my fellow devs who was mining Doge in 2014. I\nbought about $50 worth of it back then and ended up losing access to wherever it\nwas stored at the time. No big deal, it was my first lesson in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は20年以上、デジタルの仕事をしていますが、初めて聞いたのは\n暗号については、2014年にDogeをマイニングしていた開発者仲間から聞いたものです。I\n当時50ドル分くらい買ったんだけど、結局どこにアクセスしてもダメで\nは当時保管されていました。大したことはない、最初のレッスンだった...",
      "title": "暗号への投資方法を学ぶことは、女性として絶対的な力を与えてくれました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在数字领域工作了20多年，我第一次听说加密货币是在2014年从我的一个同事那里听说的。\n我第一次听说加密货币是在2014年，我的一个同事在挖Doge时听到的。I\n我当时买了大约50美元的加密货币，但最后却失去了对当时存储在哪里的访问权\n当时存储的地方。没有什么大不了的，这是我的第一课。",
      "title": "作为一名女性，学习如何投资加密货币绝对是一种权力。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在數字領域工作了20多年，我第一次聽說加密貨幣是在2014年從我的一個同事那裏聽說的。\n我第一次聽說加密貨幣是在2014年，我的一個同事在挖Doge時聽到的。I\n我當時買了大約50美元的加密貨幣，但最後卻失去了對當時存儲在哪裏的訪問權\n當時存儲的地方。沒有什麼大不了的，這是我的第一課。",
      "title": "作爲一名女性，學習如何投資加密貨幣絕對是一種權力。"
    }
  ]
}