{
  "author": "StonerDaly",
  "original_created_utc": 1626713705,
  "title": "As someone who’s held crypto for 6 years, I enjoy the bear market…",
  "created_utc": 1626720016,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For real though. I’ve lived through more crypto crashes then I have presidents at this point, and one thing I always have to remember is that setting a floor is a good thing. Sure we all want BTC at $60k + USD and ETH at $4k + USD but what people never talk about is how every time we gain a new all time high, we set a new all time high floor. If you would have told me 5 years ago my BTC would sit comfortably around $30k USD I would have slapped your mom for raising such an optimist. Just remember folks, the corrections are healthy. We haven’t shit the bed, just a minor shart. Throw them pants away and go buy yourself a new pair, next bull run will be nuts.</p>\n</div><!-- SC_ON -->",
  "score": 433,
  "permalink": "/r/CryptoCurrency/comments/oni3ow/as_someone_whos_held_crypto_for_6_years_i_enjoy/",
  "subreddit": "CryptoCurrency",
  "id": "oni3ow",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For real though. I’ve lived through more crypto crashes then I have presidents\nat this point, and one thing I always have to remember is that setting a floor\nis a good thing. Sure we all want BTC at $60k + USD and ETH at $4k + USD but\nwhat people never talk about is how every time we gain a new all…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "本当はね。この時点で、私は大統領の数よりも多くの暗号化された暴落を経験しました。\nこの時点で、私がいつも覚えていることは、フロアを設定することは\nは良いことだと思います。確かに私たちは皆、BTCを$60k + USD、ETHを$4k + USDにしたいと思っています。\nしかし、人々が決して口にしないのは、私たちが新たな全通貨を獲得するたびに...",
      "title": "6年前から暗号を保有している者としては、ベアマーケットを楽しんでいる..."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "虽然是真的。我经历了更多的加密货币崩溃，而不是我的总统\n在这一点上，我总是要记住一件事，就是设定一个底线\n是一件好事。当然，我们都希望BTC在6万美元以上，ETH在4千美元以上，但\n但人们从未谈论过的是，每当我们获得一个新的所有...",
      "title": "作为一个持有加密货币6年的人，我享受熊市..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "雖然是真的。我經歷了更多的加密貨幣崩潰，而不是我的總統\n在這一點上，我總是要記住一件事，就是設定一個底線\n是一件好事。當然，我們都希望BTC在6萬美元以上，ETH在4千美元以上，但\n但人們從未談論過的是，每當我們獲得一個新的所有...",
      "title": "作爲一個持有加密貨幣6年的人，我享受熊市..."
    }
  ]
}