{
  "author": "RedRiot306",
  "original_created_utc": 1646076602,
  "title": "Why do many atheists criticize Christianity but not other religions?",
  "created_utc": 1646088023,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;At least in my experience, all atheists I’ve met have criticized Christianity and highlighted their flaws. As a Catholic person, I have no problem with this because I think people have the right to believe whatever they want. You do you and I’ll do me. But I’ve never heard atheists say anything about other religions and I feel like this is the case for many of them. Every religion has something controversial about them so it seems unfair that many atheists only focus on Christianity&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 125,
  "permalink": "/r/TooAfraidToAsk/comments/t3noty/why_do_many_atheists_criticize_christianity_but/",
  "subreddit": "TooAfraidToAsk",
  "id": "t3noty",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "At least in my experience, all atheists I’ve met have criticized Christianity\nand highlighted their flaws. As a Catholic person, I have no problem with this\nbecause I think people have the right to believe whatever they want. You do you\nand I’ll do me. But I’ve never heard atheists say anything…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "少なくとも私の経験では、私が会ったすべての無神論者は、キリスト教を批判していました。\nとその欠点を強調する。カトリックの人間である私は、これに対して何の問題もありません。\nなぜなら、人は何を信じようとする権利があると思うからです。あなたはあなた\n私は私をやる。でも、無神論者が何か言っているのを聞いたことがない...。",
      "title": "なぜ多くの無神論者はキリスト教を批判し、他の宗教を批判しないのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "至少在我的经验中，我所遇到的所有无神论者都批评过基督教\n并强调他们的缺陷。作为一个天主教徒，我对这一点没有异议\n因为我认为人们有权利相信他们想要的东西。你做你的\n我也会做我自己。但我从来没有听过无神论者说过什么...",
      "title": "为什么许多无神论者批评基督教而不批评其他宗教？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "至少在我的經驗中，我所遇到的所有無神論者都批評過基督教\n並強調他們的缺陷。作爲一個天主教徒，我對這一點沒有異議\n因爲我認爲人們有權利相信他們想要的東西。你做你的\n我也會做我自己。但我從來沒有聽過無神論者說過什麼...",
      "title": "爲什麼許多無神論者批評基督教而不批評其他宗教？"
    }
  ]
}