{
  "author": "TaxShield",
  "the_new_excerpt": "The Senate on Tuesday passed one of the largest industrial bills in U.S. history\nin a bipartisan effort to ensure the U.S. remains competitive with China as one\nof the globe’s technological powerhouses.\n\nThe bill, which passed the chamber 68-32, commits roughly $250 billion in\nfunding for scientific…",
  "original_created_utc": 1623230958,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "上院は、米国史上最大規模の産業法案を超党派で可決しました。\n米国が世界の技術大国として中国との競争力を維持するために、超党派で取り組んだ米国史上最大の産業法案を可決しました。\n上院は火曜日、米国史上最大規模の産業法案を可決しました。\n\nこの法案は68-32で可決され、約2,500億ドルの資金を科学・技術分野に投入します。\nこの法案は、約2,500億ドルの資金を科学技術分野に投入します。",
      "title": "上院、中国への対抗を目的とした2500億ドルの超党派技術・製造関連法案を可決"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "参议院星期二通过了美国历史上最大的工业法案之一。\n在两党的努力下，确保美国作为全球技术强国之一保持对中国的竞争力。\n全球技术强国之一。\n\n该法案以68比32的比例通过，承诺提供约2500亿美元的\n的资金。",
      "title": "参议院通过2500亿美元的两党科技和制造业法案，旨在抗衡中国"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "參議院星期二通過了美國曆史上最大的工業法案之一。\n在兩黨的努力下，確保美國作爲全球技術強國之一保持對中國的競爭力。\n全球技術強國之一。\n\n該法案以68比32的比例通過，承諾提供約2500億美元的\n的資金。",
      "title": "參議院通過2500億美元的兩黨科技和製造業法案，旨在抗衡中國"
    }
  ],
  "title": "Senate passes $250 billion bipartisan tech and manufacturing bill aimed at countering China",
  "created_utc": 1623259954,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The Senate on Tuesday passed one of the largest industrial bills in U.S. history in a bipartisan effort to ensure the U.S. remains competitive with China as one of the globe’s technological powerhouses.</p>\n\n<p>The bill, which passed the chamber 68-32, commits roughly $250 billion in funding for scientific research, subsidies for chipmakers and robot makers, and an overhaul of the National Science Foundation.</p>\n\n<p>The scope of the bill, the final product of at least six Senate committees and almost all members of the chamber, reflects the many fronts in the U.S.-China rivalry.</p>\n\n<p>It also likely represents one of the last major bipartisan initiatives of 2021, proof that U.S. lawmakers are broadly in favor of legislation that works to counter Beijing’s economic and military expansion.</p>\n\n<p>Failure to expand the nation’s semiconductor production, or reroute rare earths supply chains, advocates say, could leave the U.S. at a strategic disadvantage in the years ahead.</p>\n\n<p>The largest part of the U.S. Innovation and Competition Act is a proposal previously known as “Endless Frontier,” written by Senate Majority Leader Chuck Schumer, D-N.Y., and Sen. Todd Young, R-Ind.</p>\n\n<p>Endless Frontier overhauls the National Science Foundation, appropriate tens of billions for the NSF between fiscal 2022 and 2026, and establish a Directorate for Technology and Innovation.</p>\n\n<p>“Passing this bill— now called the U.S. Innovation and Competition Act—is the moment when the Senate lays the foundation for another century of American leadership,” Schumer said from the Senate floor Tuesday evening.</p>\n\n<p>“Around the globe, authoritarian governments believe that squabbling democracies like ours can’t unite around national priorities,” he added. “Well, let me tell you something: I believe that they are wrong. I believe that this legislation will enable the United States to out-innovate, out-produce, and out-compete the world in the industries of the future.”</p>\n\n<p>The bill would also fund a grant program managed by the Commerce Department that would match financial incentives offered by states and local governments to chipmakers who improve upon or build new factories.</p>\n\n<p>Specifically, the bill provides $52 billion to fund the semiconductor research, design, and manufacturing initiatives. The Semiconductor Industry Association, a trade group that represents a swath of the nation’s chipmakers, was quick to applaud the Senate’s effort.</p>\n\n<p>“Senate passage of USICA is a pivotal step toward strengthening U.S. semiconductor production and innovation and an indication of the strong, bipartisan support in Washington for ensuring sustained American leadership in science and technology,” said John Neuffer, CEO of the SIA. “Enactment of these investments would help strengthen America’s economy, national security, technology leadership, and global competitiveness for years to come.”</p>\n\n<p>Reflecting the vote count, praise following the bill’s passage through the Senate came from both sides of the political aisle. Sen. Ben Sasse, R-Neb., specifically cheered the legislation’s clear goals and added that he would have preferred an even more pointed bill.</p>\n\n<p>“As a China hawk and a fiscal hawk, I would have liked for this bill to take a more focused and aggressive approach to the China threat – but this is a strong start,” he said in a press release. “The Chinese Communist Party is working overtime on cyber, AI, and machine learning so that they can become the world’s preeminent super power. We can’t let our foot off the gas.” </p>\n\n<p>The bill’s success in the Senate also comes as the White House ramps up its own recommendations on how to secure American supply chains that run through China and counteract Beijing’s geopolitical ambitions.</p>\n\n<p>President Joe Biden applauded the bill’s passage Tuesday evening, saying he was encouraged by the bipartisan effort.</p>\n\n<p>“It is long past time that we invest in American workers and American innovation,” Biden said in a statement. “We are in a competition to win the 21st century, and the starting gun has gone off. As other countries continue to invest in their own research and development, we cannot risk falling behind.”</p>\n\n<p>The White House announced on Friday that it will expand restrictions on American investments in certain Chinese companies with alleged ties to the country’s military and surveillance efforts, adding more firms to a growing U.S. blacklist.</p>\n\n<p>Then, on Tuesday, the White House said that it will look into dramatically expanding U.S. production of lithium batteries, rare earth minerals and semiconductors.</p>\n\n<p>“The USICA affirms a willingness to maintain a sustained focus on the U.S.-China strategic competition through a bipartisan and whole-of-government approach, leading into the upcoming G7 and NATO summits where it is anticipated the U.S. will be looking to work with allies to present a united front towards China,” wrote Mario Mancuso, head of the international trade and national security division of law firm Kirkland &amp; Ellis.</p>\n\n<p>While debate over several amendments prevented the Senate from passing the legislation before the Memorial Day recess, the bipartisan passion for ensuring the U.S. remains competitive is expected to support its case in the House.</p>\n\n<p>The chamber is expected to consider the legislation in the coming weeks, though perhaps at a slower pace as representatives hash out various sections.</p>\n\n<p><a href=\"https://www.cnbc.com/2021/06/08/senate-passes-bipartisan-tech-and-manufacturing-bill-aimed-at-china.html\">https://www.cnbc.com/2021/06/08/senate-passes-bipartisan-tech-and-manufacturing-bill-aimed-at-china.html</a></p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/stocks/comments/nvrmu4/senate_passes_250_billion_bipartisan_tech_and/",
  "subreddit": "stocks",
  "id": "nvrmu4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404888033
}