{
  "author": "Gnobodyuknow",
  "the_new_excerpt": "Yep, $F is about to join Tesla in the hands free driving era.\n\n\nFORD’S ‘MOTHER OF ALL ROAD TRIPS’ TESTS BLUECRUISE HANDS-FREE DRIVING AHEAD OF\nOVER-THE-AIR PUSH TO F-150, MUSTANG MACH-E\n\n * Following 500,000 miles of development testing, Ford embarked on a\n   110,000-mile “Mother of All Road Trips”…",
  "original_created_utc": 1618404200,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そう、Fドルはテスラとともにハンズフリードライビングの時代を迎えようとしているのだ。\n\n\nフォードの「マザー・オブ・オール・ロードトリップ」は、F-150、Mustang、Mache-effectに先立ち、ブルークルーズのハンズフリードライブをテストします。\nF-150、Mustang Mach-Eへの無線による働きかけ\n\n * 500,000マイルに及ぶ開発テストの後、フォードは110,000マイルの \"Multi-Road Trip \"に乗り出しました。\n   110,000マイルの \"Mother of All Road Trips\"...",
      "title": "フォード($F) 自律走行に向けて"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "没错，$F即将加入特斯拉，进入免提驾驶时代。\n\n\n福特的 \"公路旅行之母 \"测试BLUECRUISE免提驾驶前的\n空中推送到F-150, MUSTANG MACH-E上。\n\n * 经过500,000英里的开发测试后，福特公司开始了一项新的研发工作。\n   11万英里 \"公路旅行之母\"... ...",
      "title": "福特($F)即将实现自主化。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "沒錯，$F即將加入特斯拉，進入免提駕駛時代。\n\n\n福特的 \"公路旅行之母 \"測試BLUECRUISE免提駕駛前的\n空中推送到F-150, MUSTANG MACH-E上。\n\n * 經過500,000英里的開發測試後，福特公司開始了一項新的研發工作。\n   11萬英里 \"公路旅行之母\"... ...",
      "title": "福特($F)即將實現自主化。"
    }
  ],
  "title": "Ford($F) about to go Autonomous",
  "created_utc": 1618421395,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yep, $F is about to join Tesla in the hands free driving era. </p>\n\n<h1>Ford’s ‘Mother of All Road Trips’ Tests BlueCruise Hands-Free Driving Ahead of Over-the-Air Push to F-150, Mustang Mach-E</h1>\n\n<ul>\n<li>Following 500,000 miles of development testing, Ford embarked on a  110,000-mile “Mother of All Road Trips” across the United States and  Canada to prove out BlueCruise hands-free highway driving technology in a  wide range of driving and weather conditions</li>\n<li><p>2021 Ford F-150 and 2021 Mustang Mach-E vehicles equipped with the available Ford Co-Pilot360™ Active 2.0 Prep Package can receive BlueCruise later this year through over-the-air software update.    </p></li>\n<li><p>BlueCruise will give drivers the comfort and confidence of  hands-free driving on prequalified sections of divided highways called  Hands-Free Blue Zones that make up more than 100,000 miles of North  American roads  </p></li>\n<li><p>Additional Ford vehicles to receive BlueCruise technology in coming  years as Ford continues to add additional highways and deliver new  hands-free driving capabilities to F-150, Mustang Mach-E and more</p></li>\n</ul>\n\n<p><strong>DEARBORN, Mich., April 14, 2021</strong> – Ford will begin offering its  new BlueCruise hands-free highway driving system to customers later  this year after 500,000 miles of development testing and fine-tuning the  technology on a journey across the United States and Canada.</p>\n\n<p>Last year, Ford sent a fleet of 10 test vehicles – five F-150 pickups  and five all-electric Mustang Mach-E SUVs – to complete what test  drivers dubbed the “Mother of All Road Trips.” The trek covered more  than 110,000 miles through 37 states and five Canadian provinces to  challenge BlueCruise against a wide range of road, weather and traffic  conditions.</p>\n\n<p>“There are highway intricacies and driving conditions that you simply  cannot replicate in a lab,” said Hau Thai-Tang, Ford chief product  platform and operations officer. “Sending these vehicles out for  real-world driving experience is just one of many ways we ensured that  BlueCruise technology offers confidence and convenience for drivers all  across the continent.”  </p>\n\n<p>Via over-the-air software updates, BlueCruise will be offered later  this year on 2021 F-150 and 2021 Mustang Mach-E models equipped with the  available Ford Co-Pilot360™ Active 2.0 Prep Package.  Over-the-air software updates allow owners of select Ford vehicles to  update software from the convenience of their own garage.</p>\n\n<p>Ford is targeting to sell more than 100,000 vehicles equipped with  BlueCruise in the first year, based on company sales and take-rate  projections.</p>\n\n<p><strong>Mother of All Road Trips becomes the ultimate Ford test drive</strong></p>\n\n<p>All 10 test vehicles – one departing from Palo Alto, California, the  others from Dearborn, Michigan – spent much of last November and  December winding their way across the United States and Canada. Test  drivers searched for every conceivable road condition and highway  driving scenario, monitoring the system’s performance, collecting data  and highlighting areas where improvements could be made.</p>\n\n<p>The trip marked the final leg of a development process that ran up  more than a half-million miles in a series of shorter test drives, each  designed to evaluate a specific aspect of BlueCruise. As real-world  validation of those earlier tests, road trip enabled the system to scan  for variances in road signage, lane markings, exit ramps, traffic  patterns and weather.</p>\n\n<p>“I drive long-distance quite often, whether out to Boston or down to  Florida to visit family or friends, and usually I mentally tire out on  drives that far,” said Alexandra Taylor, BlueCruise feature development  engineer, who logged more than 3,000 miles in an F-150 on the trek. “The  one thing that became clear is that, when using BlueCruise, long drives  aren’t nearly as mentally taxing to me.”</p>\n\n<p>Taylor and fellow BlueCruise engineer Shruti Gotadki set out on an  eight-day journey that wound through the southeast United States,  targeting driving differences between Jacksonville, Louisville, Atlanta  and other major urban areas.</p>\n\n<p>Back at the Ford lab, driver-assist technology supervisor Justin  Teems monitored the progress of the entire fleet, corralling important  data that will help shape BlueCruise driving experience in the months  and years ahead.</p>\n\n<p>“It was like mission control,” Teems said. “We really wanted to push  BlueCruise to its limits. Every state builds roads a little differently.  When you include factors like lane line degradation, weather and  construction, building a hands-free driving system becomes extremely  complex. Those complexities are why Ford has the best team of engineers  in the world working on it.”</p>\n\n<p><strong>BlueCruise, the evolution of Ford Co-Pilot360 Technology</strong></p>\n\n<p>Using both advanced camera and radar-sensing technologies and  building upon Intelligent Adaptive Cruise Control with Stop-and-Go, Lane  Centering and Speed Sign Recognition, BlueCruise adds a new level of  convenience for drivers with vehicles equipped with Ford Co-Pilot360  Technology. The feature allows a driver to operate truly hands-free on  prequalified sections of divided highways called Hands-Free Blue Zones. A  driver-facing camera in the instrument cluster monitors eye gaze and  head position to help ensure the driver’s eyes remain on the road.</p>\n\n<p>Currently, more than 100,000 miles of highways across North America  are dedicated Hands-Free Blue Zones in the Ford GPS mapping system.  BlueCruise uses blue lighting on the digital instrument cluster to  indicate when the vehicle is in a hands-free zone.</p>\n\n<p>In addition to the full hands-free mode, equipped vehicles will also  feature Lane Centering mode. Lane Centering works on most roads with  lane lines and can help keep the vehicle centered in its lane but  requires drivers to keep their hands on the steering wheel. In either  mode, a visual prompt on the instrument cluster notifies drivers when  they need to return their attention to the road or resume control of the  vehicle.</p>\n\n<p>BlueCruise is an SAE Level 2 driver-assist technology, similar to  Tesla Autopilot but with the advantage of offering a true hands-free  driving experience while in Hands-Free Mode that does not require a  driver’s hands to stay in contact with the steering wheel, unless  prompted by vehicle alerts.</p>\n\n<p>And unlike other approaches – such as GM’s Super Cruise, which uses  red and green lighting, or Tesla’s Autopilot, which requires a driver  keep their hands on the steering wheel – BlueCruise communicates with  drivers in different ways. The instrument cluster transitions to  communicate that the feature is in Hands-Free mode through text and blue  lighting cues, effective even for those with color blindness.</p>\n\n<p><strong>More highways and features to come</strong></p>\n\n<p>Beyond the 2021 F-150 and 2021 Mustang Mach-E, additional Ford  vehicles will also receive BlueCruise hands-free driving technology,  while current owners continue to receive over-the-air software updates  to add new features and capabilities in the coming years.</p>\n\n<p>Future enhancements are planned to include Lane Change Assist that  will let the vehicle change lanes with just a tap of the turn signal  indicator, and Predictive Speed Assist that will adjust vehicle speed  for road curves, roundabouts and more.</p>\n\n<p>Ford also plans to offer regular mapping updates for the technology  to recognize changes plus thousands of miles of planned new road  additions.</p>\n\n<p><strong>Affordable</strong> <strong>hands-free highway driving technology</strong></p>\n\n<p>2021 F-150 and 2021 Mustang Mach-E customers will be able to purchase  BlueCruise software – including a three-year service period – for $600  in the second half of 2021, when it’s ready to launch. Hardware pricing  varies by vehicle.</p>\n\n<p>For F-150, BlueCruise is available as a part of the Ford Co-Pilot 360  Active 2.0 package for a total of $1,595 – $600 for the software and  $995 for the hardware. The Ford Co-Pilot 360 Active 2.0 package is  standard on F-150 Limited and available as an option on Lariat, King  Ranch and Platinum models.</p>\n\n<p>For Mustang Mach-E, BlueCruise comes standard on CA Route 1, Premium  and First Edition variants. It’s an available package on the Select trim  for $3,200 – $ 600 for the software and $2,600 for the rest of the  package – as part of the larger Comfort and Technology package, which  includes features such as a 360-degree camera, heated front seats and  heated steering wheel.</p>\n\n<p>&#x200B;</p>\n\n<p>source: <a href=\"https://media.ford.com/content/fordmedia/fna/us/en/news/2021/04/14/ford-mother-of-all-road-trips-bluecruise-hands-free-driving.html\">https://media.ford.com/content/fordmedia/fna/us/en/news/2021/04/14/ford-mother-of-all-road-trips-bluecruise-hands-free-driving.html</a></p>\n</div><!-- SC_ON -->",
  "score": 122,
  "permalink": "/r/stocks/comments/mqpreu/fordf_about_to_go_autonomous/",
  "subreddit": "stocks",
  "id": "mqpreu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566618935
}