{
  "author": "brightskies2",
  "the_new_excerpt": "Background: I've published peer-reviewed journal articles on China's politics\nand markets before.\n\nAlibaba (and Ant)'s getting pulled into a meeting with regulators today on the\nheels of a new anti-trust probe. Expect a correction, but much of the\nuncertainty had already been priced in.\n\nA quick…",
  "original_created_utc": 1608787848,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "背景资料：我曾在期刊上发表过关于中国政治的同行评议文章\n以及之前的市场。\n\n阿里巴巴(和蚂蚁)今天将与监管机构就\n紧随其后的是一项新的反垄断调查。预计会出现回调，但大部分\n不确定性已经反映在价格中。\n\n快速…",
      "title": "一位BABA中国问题专家：看涨"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "背景資料：我曾在期刊上發表過關於中國政治的同行評議文章\n以及之前的市場。\n\n阿里巴巴(和螞蟻)今天將與監管機構就\n緊隨其後的是一項新的反壟斷調查。預計會出現回調，但大部分\n不確定性已經反映在價格中。\n\n快速…",
      "title": "一位BABA中國問題專家：看漲"
    }
  ],
  "title": "A China expert on BABA: Bullish",
  "created_utc": 1608824435,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Background: I&#39;ve published peer-reviewed journal articles on China&#39;s politics and markets before. </p>\n\n<p>Alibaba (and Ant)&#39;s getting pulled into a meeting with regulators today on the heels of a new anti-trust probe. Expect a correction, but much of the uncertainty had already been priced in. </p>\n\n<p>A quick sentiment analysis of the press releases from Chinese government mouthpieces like《人民日報》[the People&#39;s Daily] shows their tone is much more mellow now than before. Where before they hawked on Ma and Alibaba, they&#39;re now focusing on “the country’s focus on the healthy development of the platform economy in China”. This talking point is repeated a significant number of times in the releases. </p>\n\n<p>This stark shift in tone suggests regulators already have a for-show compromise in mind and BABA will only need to kiss the ring when they meet with said regulators today. It also suggests regulators are putting on this show for political grandstanding to send a message to digital companies and the billionaire class to do the same. </p>\n\n<p>To put this into an even broader context, this episode is just the latest in a chest-puffing government campaign going on over the last couple of years to stress deference to the CCP. China&#39;s state-run banks have dragged their heels in performance for a while, and ever since private-sector digital platforms (BABA, JD, Meituan, TCEHY) have forged ahead in innovating much more efficient payment systems, the CCP felt left behind and wanted to be included in the party. What&#39;s key is we’ve observed this campaign to be much more discursive and cultural in practice and effect (e.g. prodding individual people and companies to be more humble and thank the party, put on the frills, yaddi-yadda) than it has been economic (e.g. quashing entire companies). </p>\n\n<p>Why? And where are we headed? BABA and the digital platform economy it&#39;s a leader in are essential to China. The CCP has been ramping up efforts to digitalize in a bid to take a lead in the global (fin)tech race and strengthen the yuan at the same time. The innovation of the new China digital currency is a game-changer. The Bank of China filed over 70 patents related to the digital currency in the past year. The patents will likely be approved 2021, which will be BABA&#39;s time to shine because the CCP will need the networks and infrastructure of Alipay to make the digital currency a success. </p>\n\n<p>More bullish sentiment: in Q3 2020, close to 1800 hedge funds/financial institutions had BABA in their holdings, over 200 opened new positions, and ~700 added to their positions. Bigger names who bought more over Q3: Cathie Woods&#39; Ark, Ray Dalio&#39;s Bridgewater, Morgan Stanley, Fidelity, Barclays, Susquehanna, Deutsche, Canada Pension Plan, etc. It remains Blackrock&#39;s #8 holding and has become Bridgewater&#39;s #4 holding. </p>\n\n<p>My take: buy and hold. I literally bought more yesterday and I intend to keep buying.</p>\n</div><!-- SC_ON -->",
  "score": 85,
  "permalink": "/r/investing/comments/kj9m9q/a_china_expert_on_baba_bullish/",
  "subreddit": "investing",
  "id": "kj9m9q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495333652
}