{
  "author": "Youkiame",
  "the_new_excerpt": "Call me in denial stage if you want but I refuse to think the recent sell off is\n“bubble bursting”. We all know inflation will be higher than usual since Feds\nhas been printing money for a year now and why only until recently does people\nstart to take action on inflation risk? Sure bond market has a…",
  "original_created_utc": 1614996500,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "如果你想说我在否认阶段，但我拒绝认为最近的抛售是一个很好的例子。\n\"泡沫破灭\"。我们都知道通货膨胀率会比平时高，因为美联储的\n已经印了一年的钱，为什么直到最近才有人\n开始对通胀风险采取行动？当然债券市场有一个...",
      "title": "如果对通货膨胀的恐惧是真的，那么为什么我们没有看到黄金甚至比特币的暴涨呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你想說我在否認階段，但我拒絕認爲最近的拋售是一個很好的例子。\n\"泡沫破滅\"。我們都知道通貨膨脹率會比平時高，因爲美聯儲的\n已經印了一年的錢，爲什麼直到最近纔有人\n開始對通脹風險採取行動？當然債券市場有一個...",
      "title": "如果對通貨膨脹的恐懼是真的，那麼爲什麼我們沒有看到黃金甚至比特幣的暴漲呢？"
    }
  ],
  "title": "If inflation fear is real then why are we not seeing spikes in gold or even Bitcoin",
  "created_utc": 1615046059,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Call me in denial stage if you want but I refuse to think the recent sell off is “bubble bursting”. We all know inflation will be higher than usual since Feds has been printing money for a year now and why only until recently does people start to take action on inflation risk? Sure bond market has a bearish outlook on the economy but why would some of the obvious inflation hedge like gold or Bitcoin are also down over the past month then. And JPOW’s remarks on future interest rate and inflation rate are very positive and no one seems to believe him. </p>\n\n<p>Some of you argue that the market is switching over to bonds because it reaches year high. I mean bond yield is still at historical lows. I think this is just a cyclical rotation and some profit taking and a normal market correction as we’ve seen back in September of last year. Just relax and keep buying the dips. AMD sub-80 or AMZN sub 3000 is an absolute steal now. Tech will go back up in no time.</p>\n</div><!-- SC_ON -->",
  "score": 46,
  "permalink": "/r/stocks/comments/lyrodd/if_inflation_fear_is_real_then_why_are_we_not/",
  "subreddit": "stocks",
  "id": "lyrodd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542576954
}