{
  "author": "Tefloncon",
  "original_created_utc": 1640679442,
  "title": "Why isn’t the genocide of Native American’s spoken of in the same vein as the Jewish Holocaust?",
  "created_utc": 1640691809,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As a subject, this wasn’t brought up at all in my experience at school, and in general it isn’t talked about even comparably as often as the Holocaust is when it comes to historical atrocities. I find this hard to explain given conservative estimates of the death toll of Native American is said to be roughly 12 million according to Russell Thornton, and vary significantly with a toll of 100 million documented by D.E Stannard, author of ‘The American Holocaust’, the reasonable conclusion seems to land at around 75 million lives lost between Columbus’ arrival in 1492-1900, which works out to be close to 90% of the entire Native American population, with 5 million remaining today. Could someone please explain why, with a conservative estimate of twice as many lives lost, it isn’t spoken of with the same condemnation as the Holocaust, or if you were educated on the subject differently to what I was.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/rqau26/why_isnt_the_genocide_of_native_americans_spoken/",
  "subreddit": "AskHistorians",
  "id": "rqau26",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As a subject, this wasn’t brought up at all in my experience at school, and in\ngeneral it isn’t talked about even comparably as often as the Holocaust is when\nit comes to historical atrocities. I find this hard to explain given\nconservative estimates of the death toll of Native American is said to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "教科として、私の学校での経験では全く話題になりませんでしたし、その中で\n一般に、ホロコーストのように頻繁に語られることはない。\n歴史的な残虐行為といえば このことは、次のことを考えると説明しがたいです。\nネイティブ・アメリカンの死者数は、控えめに見積もっても...。",
      "title": "なぜネイティブ・アメリカンの大量虐殺は、ユダヤ人のホロコーストと同じように語られないのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个主题，这在我的学校经历中根本没有被提起，而且在一般情况下，它甚至不像大屠杀时那样经常被谈论。\n一般来说，在谈到历史上的暴行时，它甚至没有像大屠杀那样被经常谈论。\n谈到历史上的暴行。我觉得这很难解释，因为\n据保守估计，美国原住民的死亡人数为......",
      "title": "为什么不把对美国原住民的种族灭绝与犹太人的大屠杀放在一起谈论？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個主題，這在我的學校經歷中根本沒有被提起，而且在一般情況下，它甚至不像大屠殺時那樣經常被談論。\n一般來說，在談到歷史上的暴行時，它甚至沒有像大屠殺那樣被經常談論。\n談到歷史上的暴行。我覺得這很難解釋，因爲\n據保守估計，美國原住民的死亡人數爲......",
      "title": "爲什麼不把對美國原住民的種族滅絕與猶太人的大屠殺放在一起談論？"
    }
  ]
}