{
  "author": "Two_Pickachu_One_Cup",
  "original_created_utc": 1656823609,
  "title": "Everyday we stray further from Satoshi's vision",
  "created_utc": 1656873711,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;At the time the 08 global financial crisis had a huge impact on Bitcoins creator, Satoshi. &lt;/p&gt;\n\n&lt;p&gt;Satoshi saw what happened when people blindly trusted their money in banks. In 08 banks collapsed under dodgy lending schemes and people got seriously burnt.&lt;/p&gt;\n\n&lt;p&gt;Bitcoin was created to create a decentralized payment system, free from government control where people could park their money safely. Critically Satoshi understood that of you give people power over something, they will inevitably find a way to screw it up.&lt;/p&gt;\n\n&lt;p&gt;Fast forward to 2022 where centralized coins, exchanges and lending dominate the space.&lt;/p&gt;\n\n&lt;p&gt;Luna promised investors unrealistic yields, sucked them in and lost it all. Celsius, Voyager and Cefi generally are going down the gurgler taking people&amp;#39;s money with it. There will be more to come.&lt;/p&gt;\n\n&lt;p&gt;We openly resisted any form of regulation and blindly trusted centralized lending to do the right thing with our money. Well that&amp;#39;s exactly what people did with banks on 2008 and we all know how that ended.&lt;/p&gt;\n\n&lt;p&gt;Except this time there will be no government bailouts for crypto, we are on our own. There is no regulation to protect us.&lt;/p&gt;\n\n&lt;p&gt;And so once again Satoshi was right, we cannot trust any exchange, coin or crypto service that allows people to control it. It always ends the same way, the average user getting screwed over.&lt;/p&gt;\n\n&lt;p&gt;Perhaps we need to come full circle in the space and only ever trust decentralized cryptocurrencies and exchanges. Anything less is history repeating.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 323,
  "permalink": "/r/CryptoCurrency/comments/vq9nbe/everyday_we_stray_further_from_satoshis_vision/",
  "subreddit": "CryptoCurrency",
  "id": "vq9nbe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "At the time the 08 global financial crisis had a huge impact on Bitcoins\ncreator, Satoshi.\n\nSatoshi saw what happened when people blindly trusted their money in banks. In\n08 banks collapsed under dodgy lending schemes and people got seriously burnt.\n\nBitcoin was created to create a decentralized…"
}