{
  "author": "givemeyourpants",
  "the_new_excerpt": "If people are wondering about the cause of the pent up anger amongst retail\ninvestors that is seemingly being played out in the current market, look no\nfurther than an interview from 2006 with Jim Cramer (who was the manager of his\nvery own hedge fund from 1987-2001). Regular people have long…",
  "original_created_utc": 1612063095,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "如果人们想知道零售业中积压的愤怒的原因\n投资者在目前的市场上似乎正在上演，不要再看了。\n比2006年对Jim Cramer的采访更进一步（Jim Cramer是他的经理，他是他的朋友）。\n1987-2001年，非常自己的对冲基金）。) 普通人早已...",
      "title": "吉姆-克拉默在2006年接受采访，讲述了对冲基金是如何操纵市场的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果人們想知道零售業中積壓的憤怒的原因\n投資者在目前的市場上似乎正在上演，不要再看了。\n比2006年對Jim Cramer的採訪更進一步（Jim Cramer是他的經理，他是他的朋友）。\n1987-2001年，非常自己的對沖基金）。) 普通人早已...",
      "title": "吉姆-克拉默在2006年接受採訪，講述了對沖基金是如何操縱市場的。"
    }
  ],
  "title": "Jim Cramer Gave an Interview in 2006 on how the Hedge Funds Manipulate the Markets",
  "created_utc": 1612072656,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If people are wondering about the cause of the pent up anger amongst retail investors that is seemingly being played out in the current market, look no further than an interview from 2006 with Jim Cramer (who was the manager of his very own hedge fund from 1987-2001).  Regular people have long suspected that they don&#39;t get to play by the &quot;rules&quot; that other players in the market do.  They&#39;re angry, they remember major life changing events like the crash of 2008 and how the people responsible weren&#39;t punished, and now they&#39;re looking to fight back.</p>\n\n<p><a href=\"https://www.reuters.com/article/cramer-interview-idUKN2036292620070320\">Reuters Article on the Interview</a></p>\n\n<p>&quot;What&#39;s important when you&#39;re in that hedge fund mode, is to not do anything remotely truthful. Because the truth is so against your view, that it&#39;s important to create a new view, to create a fiction.&quot;</p>\n\n<p>&quot;Then you call the (Wall Street) Journal and get the bozo reporter in Research in Motion and you would feed that (rival) Palm&#39;s got a killer it&#39;s going to give away. These are all the things you must do on a day like today, and if you&#39;re not doing it, maybe you shouldn&#39;t be in the game.&quot;</p>\n\n<p>“It might cost me $15 million or $20 million to knock RIM down but it would be fabulous because it would beleaguer all the moron longs who are also keying on Research in Motion.&quot;</p>\n\n<p>&quot;A lot of times when I was short at my hedge fund ... meaning I needed (a stock) down, I would create a level of activity beforehand that could drive the futures. It’s a fun game and it’s a lucrative game.&quot;</p>\n\n<p>&quot;Who cares about the fundamentals? The great thing about the market is that it has nothing to do with the actual stocks.&quot;</p>\n\n<p>- Jim Cramer, Dec 2006</p>\n\n<p><a href=\"https://dealbook.nytimes.com/2007/03/20/cramer-market-manipulator/\">Dealbook NY Times Article on the Interview</a></p>\n\n<p><a href=\"https://www.investopedia.com/articles/analyst/030102.asp#:%7E:text=Short%20and%20distort%20(S%26D\">Investopedia Article: Short and Distort Bear Market Stock Manipulation</a>)</p>\n\n<p><a href=\"https://seekingalpha-com.cdn.ampproject.org/v/s/seekingalpha.com/amp/instablog/11442671-gerald-klein/3096735-anatomy-of-a-short-attack?amp_js_v=a6&amp;amp_gsa=1&amp;usqp=mq331AQHKAFQArABIA%3D%3D#aoh=16119453107704&amp;referrer=https%3A%2F%2Fwww.google.com&amp;amp_tf=From%20%251%24s&amp;ampshare=https%3A%2F%2Fseekingalpha.com%2Finstablog%2F11442671-gerald-klein%2F3096735-anatomy-of-a-short-attack\">Anatomy of a Short Attack</a></p>\n</div><!-- SC_ON -->",
  "score": 295,
  "permalink": "/r/stocks/comments/l937ov/jim_cramer_gave_an_interview_in_2006_on_how_the/",
  "subreddit": "stocks",
  "id": "l937ov",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518537985
}