{
  "author": "StarksTwins",
  "the_new_excerpt": "I feel like there’s a consensus on stock forums that a catastrophic market crash\nakin to the dot com burst is happening soon. They use historical prices to back\nit up, and they inform anyone who’ll listen to sit on large quantities of cash,\nbecause everything will come crashing down soon\n\nIs there…",
  "original_created_utc": 1613311302,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我感觉在股票论坛上，大家都有一个共识，那就是灾难性的市场大跌\n类似于互联网的爆发很快就会发生。他们用历史价格来支持\n了，他们通知任何愿意听的人，坐拥大量现金。\n因为一发不可收拾\n\n是否有...",
      "title": "还有人认为灾难性的市场崩溃不会很快到来吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我感覺在股票論壇上，大家都有一個共識，那就是災難性的市場大跌\n類似於互聯網的爆發很快就會發生。他們用歷史價格來支持\n了，他們通知任何願意聽的人，坐擁大量現金。\n因爲一發不可收拾\n\n是否有...",
      "title": "還有人認爲災難性的市場崩潰不會很快到來嗎？"
    }
  ],
  "title": "Does anyone else think a catastrophic market crash is NOT coming anytime soon?",
  "created_utc": 1613321379,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I feel like there’s a consensus on stock forums that a catastrophic market crash akin to the dot com burst is happening soon. They use historical prices to back it up, and they inform anyone who’ll listen to sit on large quantities of cash, because everything will come crashing down soon</p>\n\n<p>Is there anyone out there that thinks that won’t happen?</p>\n\n<p>I can see a -20% decline over the course of a couple months happening in the next couple years. I can also see certain industries that are inflated to come crashing down. If you see what happened to <a href=\"https://i.imgur.com/IumMxau.jpg\">ZM</a> from October to December, I can easily see something like that happening to a variety of different growth stocks that are completely mispriced. </p>\n\n<p>But we also have companies making a LOT of money that can justify a lot of the prices. AAPL made over $100 billion <strong>in a single quarter</strong>, and they’re growing 20% YoY. They have almost $200 billion in cash alone, and they’re innovating and finding new ways to make money. Why is a $2 trillion market cap unreasonable?</p>\n\n<p>Same with AMZN, MSFT, and other big tech companies. Unlike the dot com levels, tech companies are actually making a lot of money. I personally can’t imagine a -40% market drop that later stagnates for years on end when companies like AAPL have most cash in hand than their entire 2010 <a href=\"https://money.cnn.com/2010/03/29/technology/apple_valuable_companies.fortune/index.htm\">market capitalization </a>. </p>\n\n<p>I know this post is going to get of snark, but I hope we can have an actual discussion. The people who have been screeching “MaRkEt CrAsH iMmInent” are the ones that have been losing the most these last few years (by having large portions of their money uninvested in the midst of an incredible bull run)</p>\n\n<p>With investors finally realizing the potential these tech companies have nowadays, and with tech companies making more money than what was once ever thought possible, does anyone else think a catastrophic market crash just.... won’t happen?</p>\n</div><!-- SC_ON -->",
  "score": 1624,
  "permalink": "/r/stocks/comments/ljowe9/does_anyone_else_think_a_catastrophic_market/",
  "subreddit": "stocks",
  "id": "ljowe9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728623063
}