{
  "author": "isaac_horstmeier",
  "original_created_utc": 1633572614,
  "title": "I was addicted to tinder, now I'm addicted to watching the charts.",
  "created_utc": 1633591946,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was spending on average 6.9 hours per day swipping right and left on tinder. Dude I even paid for tinder gold and was traveling around the world to find my soulmate, but I didn’t had any good results or any luck. </p>\n\n<p>Until someday I saw an ad promoting crypto, and it was the perfect match! Now I’m in love with crypto, and crypto is in love with me and with my money, I’m like a crypto virtual sugar daddy, and I can’t stop watching those juicy green and red dildos. I’m jut addicted, I can’t stop, and I don’t want to stop. Also I’m making a shit ton of money on the process. Actually let me correct myself, crypto is my sugar mommy, not the other way around. </p>\n\n<p>I highly recommend this to all of you guys. It’s the most non toxic relationship I’ve ever had! I’m happy now!</p>\n</div><!-- SC_ON -->",
  "score": 214,
  "permalink": "/r/CryptoCurrency/comments/q2z15a/i_was_addicted_to_tinder_now_im_addicted_to/",
  "subreddit": "CryptoCurrency",
  "id": "q2z15a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was spending on average 6.9 hours per day swipping right and left on tinder.\nDude I even paid for tinder gold and was traveling around the world to find my\nsoulmate, but I didn’t had any good results or any luck.\n\nUntil someday I saw an ad promoting crypto, and it was the perfect match! Now\nI’m in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1日平均6.9時間、tinderで右に左にとスワイプしていました。\nソウルメイトを見つけるために、Tinder Goldを購入して世界中を旅したこともあります。\n魂の伴侶を見つけるために世界中を旅していましたが、良い結果も運もありませんでした。\n\nある日、暗号を宣伝する広告を目にして、それが完璧にマッチしたのです 今では\n私は今...",
      "title": "私はティンダーにはまっていましたが、今はチャートを見るのにはまっています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我平均每天花6.9个小时在tinder上左右滑动。\n老兄，我甚至花钱买了Tinder金币，在世界各地寻找我的\n灵魂伴侣，但我没有任何好的结果或任何运气。\n\n直到有一天，我看到了一则宣传加密货币的广告，这是一个完美的匹配！我想，这就是我想要的。现在\n我在...",
      "title": "我曾经沉迷于Tinder，现在我沉迷于看排行榜。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我平均每天花6.9個小時在tinder上左右滑動。\n老兄，我甚至花錢買了Tinder金幣，在世界各地尋找我的\n靈魂伴侶，但我沒有任何好的結果或任何運氣。\n\n直到有一天，我看到了一則宣傳加密貨幣的廣告，這是一個完美的匹配！我想，這就是我想要的。現在\n我在...",
      "title": "我曾經沉迷於Tinder，現在我沉迷於看排行榜。"
    }
  ]
}