{
  "author": "HealthMotor8651",
  "original_created_utc": 1642624989,
  "title": "In the even of an explosive decompression, why would pilots change altitude slowly instead of quickly??",
  "created_utc": 1642659719,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi,&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;So, wouldn&amp;#39;t you want to equalize pressure as soon as possible? That would mean like more oxygen, not having stuff flying around, etc.&lt;/p&gt;\n\n&lt;p&gt;However, I read somewhere that experienced pilots do this slowly as possible instead of quickly. Why?  &lt;/p&gt;\n\n&lt;p&gt;Is it cause of pressure sickness? I thought that occurred in divers cause they absorb nitrogen gas, how does that happen for people in a pressurized cabin? Do other fluids potentially expand?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/askscience/comments/s800bg/in_the_even_of_an_explosive_decompression_why/",
  "subreddit": "askscience",
  "id": "s800bg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi,\n\n\n\nSo, wouldn't you want to equalize pressure as soon as possible? That would mean\nlike more oxygen, not having stuff flying around, etc.\n\nHowever, I read somewhere that experienced pilots do this slowly as possible\ninstead of quickly. Why?\n\nIs it cause of pressure sickness? I thought that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。\n\n\n\nでは、なるべく早く均圧化したいのでは？それはつまり\n酸素を増やすとか、物が飛ばないようにするとか。\n\nしかし、経験豊富なパイロットは、できるだけゆっくり行うという話をどこかで読みました。\n早くはない。なぜですか？\n\n気圧酔いのせい？と思ったのですが...",
      "title": "爆発的な減圧があっても、なぜパイロットはすばやくではなく、ゆっくりと高度を変えるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好。\n\n\n\n那么，你不希望尽快实现压力平衡吗？这将意味着\n像更多的氧气，没有东西飞来飞去，等等。\n\n然而，我在某处读到，有经验的飞行员在做这件事时尽可能慢一些\n而不是快速。为什么？\n\n是压力病的原因吗？我以为...",
      "title": "在爆炸性减压的情况下，为什么飞行员会缓慢而不是快速地改变高度？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好。\n\n\n\n那麼，你不希望儘快實現壓力平衡嗎？這將意味着\n像更多的氧氣，沒有東西飛來飛去，等等。\n\n然而，我在某處讀到，有經驗的飛行員在做這件事時儘可能慢一些\n而不是快速。爲什麼？\n\n是壓力病的原因嗎？我以爲...",
      "title": "在爆炸性減壓的情況下，爲什麼飛行員會緩慢而不是快速地改變高度？"
    }
  ]
}