{
  "author": "Tickle-Me-Raw",
  "the_new_excerpt": "I'm imagining it happening like the infamous and recent, \"Josh fight\" and how\nnow that it's over, everyone and their deranged uncle Jeff is trying to\nreplicate it for one reason or another.\n\nI think the term, and just the overall situation in general regarding a short\nsqueeze, will be overused…",
  "original_created_utc": 1619630086,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、悪名高い最近の「ジョシュ戦」のような出来事を想像しています。\nそれが終わった今、誰もが、そしてその狂ったジェフおじさんも、何らかの理由でそれを再現しようとしている。\n何らかの理由でそれを再現しようとしている。\n\nこの言葉、そしてショートスクイーズに関する全体的な状況は、今後も使われ続けると思います。\n絞る」という言葉も、全体的な状況も、使い古されたものになると思います。",
      "title": "ショートスクイーズ」という言葉が多用されるようになり、他の銘柄でも常に盛んに言われるようになると思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在想象它的发生，就像最近臭名昭著的 \"乔什之争\"，以及如何\n现在，它已经结束了，每个人和他们疯狂的叔叔杰夫都在试图复制它。\n出于这样或那样的原因，每个人和他们疯狂的杰夫叔叔都想复制它。\n\n我认为这个词，以及总体上关于空头的情况\n挤压，将被过度使用......",
      "title": "你认为 \"空头挤压 \"这个词会不会被过度使用和/或主动叫出来，一直到现在，在其他股票上也是如此？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在想象它的發生，就像最近臭名昭著的 \"喬什之爭\"，以及如何\n現在，它已經結束了，每個人和他們瘋狂的叔叔傑夫都在試圖複製它。\n出於這樣或那樣的原因，每個人和他們瘋狂的傑夫叔叔都想複製它。\n\n我認爲這個詞，以及總體上關於空頭的情況\n擠壓，將被過度使用......",
      "title": "你認爲 \"空頭擠壓 \"這個詞會不會被過度使用和/或主動叫出來，一直到現在，在其他股票上也是如此？"
    }
  ],
  "title": "Do you think the term, \"short squeeze\" will be overused and/or actively called out, all the time, on other stocks much much more now?",
  "created_utc": 1619634906,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m imagining it happening like the infamous and recent, &quot;Josh fight&quot; and how now that it&#39;s over, everyone and their deranged uncle Jeff is trying to replicate it for one reason or another.  </p>\n\n<p>I think the term, and just the overall situation in general regarding a short squeeze, will be overused and/or called out much more frequently from now on. As those that missed out are desperate for another one, or those that just think it will happen again because they just don&#39;t understand how rare of circumstances they require.</p>\n\n<p>I think we will be seeing a lot of posts about, &quot;potential squeeze this&quot; and &quot;potential squeeze that&quot; in the next coming weeks/months.</p>\n\n<p>edit: spelling and grammar.</p>\n</div><!-- SC_ON -->",
  "score": 2331,
  "permalink": "/r/stocks/comments/n0jre7/do_you_think_the_term_short_squeeze_will_be/",
  "subreddit": "stocks",
  "id": "n0jre7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776216021
}