{
  "author": "mikebalsaricci",
  "original_created_utc": 1651416294,
  "title": "Why do so many people prefer to get plastic surgery to have that same weird cartoon face every person with too much plastic surgery gets rather than just look old?",
  "created_utc": 1651483452,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Do they not realize that people who get too much plastic surgery all end up looking the same? It&amp;#39;s confusing to me because really no one looks at those people and thinks &amp;quot;Wow they look great!&amp;quot; everyone knows what they did and acknowledges it didn&amp;#39;t really work. So if someone knows that when they&amp;#39;re younger, why when they get older would they forget that?&lt;/p&gt;\n\n&lt;p&gt;Why do they think that looks good or better than just being their natural old self? Is it a form of dysmorphia? If so, is there a specific clinical name for this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/ug1dli/why_do_so_many_people_prefer_to_get_plastic/",
  "subreddit": "TooAfraidToAsk",
  "id": "ug1dli",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Do they not realize that people who get too much plastic surgery all end up\nlooking the same? It's confusing to me because really no one looks at those\npeople and thinks \"Wow they look great!\" everyone knows what they did and\nacknowledges it didn't really work. So if someone knows that when…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "整形しすぎると、結局みんな同じ顔になることに気づかないのだろうか。\n同じに見えてしまうのでしょうか？本当に誰もそういう人たちを見ないから混乱するんだ。\nと思う人はいない。\nそれが本当にうまくいかなかったと認めているのです。だから、もし誰かがそれを知っていたら...",
      "title": "なんで多くの人が老け顔より、整形しすぎた人がみんななるあの変なアニメ顔に整形したがるんだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他们没有意识到，做了太多整形手术的人最终都会变成\n看起来都是一样的？这让我很困惑，因为真的没有人看着那些人，认为 \"哇，他们看起来很好！\"每个人都知道他们是什么。\n每个人都知道他们做了什么，并承认它没有真正发挥作用。\n每个人都知道他们做了什么，并承认它并没有真正发挥作用。因此，如果有人知道，当...",
      "title": "为什么这么多人宁愿去做整形手术，以拥有每个整容过度的人都会有的那张奇怪的卡通脸，而不是仅仅看起来很老？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他們沒有意識到，做了太多整形手術的人最終都會變成\n看起來都是一樣的？這讓我很困惑，因爲真的沒有人看着那些人，認爲 \"哇，他們看起來很好！\"每個人都知道他們是什麼。\n每個人都知道他們做了什麼，並承認它沒有真正發揮作用。\n每個人都知道他們做了什麼，並承認它並沒有真正發揮作用。因此，如果有人知道，當...",
      "title": "爲什麼這麼多人寧願去做整形手術，以擁有每個整容過度的人都會有的那張奇怪的卡通臉，而不是僅僅看起來很老？"
    }
  ]
}