{
  "author": "DarkLord_124k",
  "original_created_utc": 1633185029,
  "title": "Why is it necessary to celebrate your birthdays and feel special about it?",
  "created_utc": 1633231997,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Today is my birthday . I am 20. I don&#39;t  feel like celebrating.  I feel like its just another day and celebrating  it is meaningless. Birthdays just remind me that I am getting older. I am no longer a child. I am  in the worst phase the 20&#39;s where you have  to work your ass off and you start becoming a liability  on your parents. I am also very scared that 1/4th of my life is over.</p>\n\n<p>I hate that my parents are forcing me to celebrate in when I just wanna spend my day watching  transformers  prime and pass it like any other day. Maybe study  for competitive  exams.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/pzw8az/why_is_it_necessary_to_celebrate_your_birthdays/",
  "subreddit": "TooAfraidToAsk",
  "id": "pzw8az",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Today is my birthday . I am 20. I don't feel like celebrating. I feel like its\njust another day and celebrating it is meaningless. Birthdays just remind me\nthat I am getting older. I am no longer a child. I am in the worst phase the\n20's where you have to work your ass off and you start becoming a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日は私の誕生日です。私は20歳です。祝う気分にはなれません。なんだか\n祝っても意味がないような気がします。誕生日は、私に\n自分が年を取ったことを思い出すだけです。私はもう子供ではありません。私は20代の最悪の時期にいます。\n20代というのは、一生懸命働かなければならない時期で、大人になり始める時期なのです。",
      "title": "なぜ、誕生日を祝って特別感を出す必要があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天是我的生日。我20岁了。我不觉得有什么好庆祝的。我觉得它就像\n只是另一个日子，庆祝它是没有意义的。生日只是提醒我\n我正在变老。我不再是个孩子了。我正处于最糟糕的阶段，即\n20岁的时候，你必须拼命工作，你开始成为一个...",
      "title": "为什么有必要庆祝自己的生日并为此感到特别？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天是我的生日。我20歲了。我不覺得有什麼好慶祝的。我覺得它就像\n只是另一個日子，慶祝它是沒有意義的。生日只是提醒我\n我正在變老。我不再是個孩子了。我正處於最糟糕的階段，即\n20歲的時候，你必須拼命工作，你開始成爲一個...",
      "title": "爲什麼有必要慶祝自己的生日併爲此感到特別？"
    }
  ]
}