{
  "author": "Polator",
  "original_created_utc": 1647050544,
  "title": "So every time I see a piece of metal in my day to day life, that metal (in some form or another) was originally mined out of the earth?",
  "created_utc": 1647075205,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For some reason its just been blowing my mind that all this metal had to be mined by somebody, and how it can still be so cheap. You&amp;#39;d think the earth would be running out of it by now.&lt;/p&gt;\n\n&lt;p&gt;And yes I know that the piece of rebar I see at a construction site wasn&amp;#39;t pulled out of a mountain in that form.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/tc5xkt/so_every_time_i_see_a_piece_of_metal_in_my_day_to/",
  "subreddit": "NoStupidQuestions",
  "id": "tc5xkt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For some reason its just been blowing my mind that all this metal had to be\nmined by somebody, and how it can still be so cheap. You'd think the earth would\nbe running out of it by now.\n\nAnd yes I know that the piece of rebar I see at a construction site wasn't\npulled out of a mountain in that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜか、この金属はすべて、その製造に必要なものであることに驚かされます。\n誰かが採掘したものが、どうしてこんなに安く手に入るのか。地球が\nもう枯渇しているんです。\n\n建設現場で目にする鉄筋の破片は、そうではないことも知っています。\nその中で、山から引き抜かれたのは...。",
      "title": "では、私が日常生活で金属のかけらを目にするたびに、その金属は（何らかの形で）もともと地球から採掘されたものなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "出于某种原因，我一直在想，所有这些金属都必须由人开采。\n采矿的人，而它怎么还能这么便宜。你会认为地球现在应该\n现在已经用完了。\n\n是的，我知道我在建筑工地上看到的那块钢筋并不是\n不是从山里拉出来的...",
      "title": "因此，每当我在日常生活中看到一块金属时，这种金属（以某种形式）最初都是从地球中开采出来的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "出於某種原因，我一直在想，所有這些金屬都必須由人開採。\n採礦的人，而它怎麼還能這麼便宜。你會認爲地球現在應該\n現在已經用完了。\n\n是的，我知道我在建築工地上看到的那塊鋼筋並不是\n不是從山裏拉出來的...",
      "title": "因此，每當我在日常生活中看到一塊金屬時，這種金屬（以某種形式）最初都是從地球中開採出來的？"
    }
  ]
}