{
  "author": "itskayyuhvin",
  "the_new_excerpt": "A small write-up on a good swing play for Disney!\n\nI previously written up on bullish semiconductor stocks, bullish PLUG, and\nbearish CLOV and have been for the most part correct on those (anyone who\nfollowed those plays should have made tendies :] ).\n\nFor Disney $DIS I see it hitting 200 and maybe…",
  "original_created_utc": 1616049722,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "小编给大家写一篇迪士尼的波段好戏!\n\n我之前写过看好半导体股，看好PLUG，以及。\n看跌CLOV，并且在大多数情况下对这些都是正确的（任何人都会有这样的想法）。\n遵循这些剧目应该已经做了tendies:] 。).\n\n对于迪斯尼$DIS，我看到它打200，也许... ...",
      "title": "华特-迪士尼公司，多板块玩法$DIS。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "小編給大家寫一篇迪士尼的波段好戲!\n\n我之前寫過看好半導體股，看好PLUG，以及。\n看跌CLOV，並且在大多數情況下對這些都是正確的（任何人都會有這樣的想法）。\n遵循這些劇目應該已經做了tendies:] 。).\n\n對於迪斯尼$DIS，我看到它打200，也許... ...",
      "title": "華特-迪士尼公司，多板塊玩法$DIS。"
    }
  ],
  "title": "The Walt Disney Company, a multi-sector play $DIS",
  "created_utc": 1616083128,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A small write-up on a good swing play for Disney! </p>\n\n<p>I previously written up on bullish semiconductor stocks, bullish PLUG, and bearish CLOV and have been for the most part correct on those (anyone who followed those plays should have made tendies :] ). </p>\n\n<p>For Disney $DIS I see it hitting 200 and maybe as high as 210 in the distant future.</p>\n\n<p>Disney is in a good position for further growth. They are now multi-faceted. You can consider them a <strong>technology</strong> stock with high growth (i.e  DIS+,  HULU), <strong>entertainment</strong> <strong>and</strong> <strong>news</strong> stock (i.e ESPN, Marvel, Star Wars, Disney being the obvious), or even a <strong>reopening</strong> play (i.e their amusement parks, cruiselines, shopping districts).</p>\n\n<p>Their latest earnings report was excellent, but was overshadowed by the nasty drop in tech stocks the last month. Even then, DIS hardly dropped and is reclaiming the 200$ price point.</p>\n\n<p>UBS has a price target of 200$ with the average price targets totaling to 205 according to FinViz.</p>\n\n<p>Catalyst --&gt; DIS to reopen parks in California by April 30. This is huge. The company is only operating from half strength right now in it&#39;s online presence of DISNEY+ and other foreign theme parks. I&#39;m from Orange County where the parks are located and there is a strong community of people who will rush to go to the park. Competitor amusement parks such as Knott&#39;s berry farm in the area already started hiring thousands of employees in preparation for reopening and Disney will do the same.</p>\n\n<p>Meanwhile DIS has a strong prospect for its streaming purposes. Total subscribers across Disney+, Hulu, and ESPN+ were over 140 million in January. Management has forecasted it doubling to 300M+ by 2024. For reference, Netflix has around 200million right now in the 4th quarter of 2020. Prior to DISNEY+, the company has not had a direct connection to its consumers besides the parks, but now it has &quot;hundreds of millions of consumers worldwide being fed a constant stream of content throughout the year.&quot;</p>\n\n<p>I believe Disney will retest the 200 position and have more to grow from there depending if market conditions have calmed. This is easily a large growth stock going into 2021.</p>\n\n<p>My current positions:  DIS 4/16 200C&#39;s</p>\n</div><!-- SC_ON -->",
  "score": 57,
  "permalink": "/r/stocks/comments/m7kybq/the_walt_disney_company_a_multisector_play_dis/",
  "subreddit": "stocks",
  "id": "m7kybq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752819545
}