{
  "author": "Onsyde",
  "the_new_excerpt": "Mods -- it should be against the rules to post how much btc you have. Let's just\nstart there.\n\n\n\nI get it, you're happy you finally hit that milestone you've been working\ntowards and you feel like you have to tell someone. PLEASE DON'T.\n\nLISTEN. The other day someone posted how much bitcoin they…",
  "original_created_utc": 1615915016,
  "localize": [
    {
      "locale": "zh",
      "title": "别再发你有多少比特币了 -- 我知道这个之前已经发过了，但是听好了。",
      "the_new_excerpt": "版主们 -- 发布你有多少btc应该是违反规则的。我们就\n从那里开始。\n\n\n\n我明白了，你很高兴你终于达到了你一直在努力的里程碑。\n对，你觉得像 你必须告诉别人。请不要。\n\n听。前几天有人发帖说自己有多少比特币... ..."
    },
    {
      "locale": "zh-Hant",
      "title": "別再發你有多少比特幣了 -- 我知道這個之前已經發過了，但是聽好了。",
      "the_new_excerpt": "版主們 -- 發佈你有多少btc應該是違反規則的。我們就\n從那裏開始。\n\n\n\n我明白了，你很高興你終於達到了你一直在努力的里程碑。\n對，你覺得像 你必須告訴別人。請不要。\n\n聽。前幾天有人發帖說自己有多少比特幣... ..."
    }
  ],
  "title": "STOP POSTING HOW MUCH BITCOIN YOU HAVE -- I know this has been posted before but listen up.",
  "created_utc": 1615943803,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Mods -- it should be against the rules to post how much btc you have. Let&#39;s just start there.</p>\n\n<p>&#x200B;</p>\n\n<p>I get it, you&#39;re happy you finally hit that milestone you&#39;ve been working towards and you feel like you have to tell someone. PLEASE DON&#39;T.</p>\n\n<p>LISTEN. The other day someone posted how much bitcoin they had. It was a decent amount actually. First off, the post gave waaay too many details about their personal life. From stalking their profile I was actually able to find out the following info from a 3 year old account with relatively low reddit activity.</p>\n\n<p>&#x200B;</p>\n\n<p>I found their:</p>\n\n<p>Sex</p>\n\n<p>First Name</p>\n\n<p>Birthday</p>\n\n<p>Country</p>\n\n<p>STREET NAME</p>\n\n<p>Phone Brand</p>\n\n<p>Hair Color</p>\n\n<p>Spouse&#39;s name and other info</p>\n\n<p>&#x200B;</p>\n\n<p>From this info alone someone could easily track them down and do God knows what to them to get their bitcoin.</p>\n\n<p>&#x200B;</p>\n\n<p>This isn&#39;t even the only person I can track down THIS WEEK. Please mods, make this a rule so no one gets hurt.</p>\n\n<p>Edit: some of yall are savages. Lol</p>\n</div><!-- SC_ON -->",
  "score": 311,
  "permalink": "/r/Bitcoin/comments/m6e531/stop_posting_how_much_bitcoin_you_have_i_know/",
  "subreddit": "Bitcoin",
  "id": "m6e531",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147375936
}