{
  "author": "neehalala",
  "the_new_excerpt": "All right, listen up you fucking idiots. Here's some dd that this dumpster fire\nof a sub doesn't even deserve. You're making money right now on $GME, $AMC, $BB,\nor whatever. Allow me to introduce you to a company with boomer level\nfundamentals that took a haircut during the pandemic and is set to…",
  "original_created_utc": 1622727972,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いいか、よく聞けよクソバカども。このゴミ箱のようなサブマシンには\nこのサブのゴミ箱には相応しくない。あなたは今、$GME、$AMC、$BBで儲けています。\nそれとも何でもいいです。団塊レベルのファンダメンタルズを持つ会社を紹介しましょう。\nファンダメンタルズがパンデミックの時にカットされて、これから...",
      "title": "また、GME、AMC、BBは月を目指しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好了，你们这些该死的白痴听好了。这里有一些数据，这个垃圾场的火灾\n的一个子甚至不值得。你现在在$GME、$AMC、$BB上赚钱。\n或其他什么。请允许我向你介绍一家拥有繁荣时期水平的公司\n基本面的公司，它在大流行期间被砍掉了头发，并被设定为......",
      "title": "另一个$GME, $AMC, $BB的目标是月球。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好了，你們這些該死的白癡聽好了。這裏有一些數據，這個垃圾場的火災\n的一個子甚至不值得。你現在在$GME、$AMC、$BB上賺錢。\n或其他什麼。請允許我向你介紹一家擁有繁榮時期水平的公司\n基本面的公司，它在大流行期間被砍掉了頭髮，並被設定爲......",
      "title": "另一個$GME, $AMC, $BB的目標是月球。"
    }
  ],
  "title": "Another $GME, $AMC, $BB aimed for the MOON",
  "created_utc": 1622790061,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>All right, listen up you fucking idiots. Here&#39;s some dd that this dumpster fire of a sub doesn&#39;t even deserve. You&#39;re making money right now on $GME, $AMC, $BB, or whatever. Allow me to introduce you to a company with boomer level fundamentals that took a haircut during the pandemic and is set to fucking explode. </p>\n\n<p>The company name is Tellurian, ticker is $TELL.</p>\n\n<p>--------MY KNOWLEDGE AND BACKGROUND----------</p>\n\n<p>Even though I have a double digit IQ, I am in charge of keeping energy producers from blowing up, spilling fuck loads of oil, catching shit on fire, and/or keeping seafood fresh and hydrocarbon free. I&#39;ve been in the business for many moons. I have dealt with MANY companies. I’ve seen MANY business types, I have seen transitions in business models as producers have dealt with energy price crashes. I work directly with company executives all the way down to operators and hands. I like talking to everyone and absorbing as much knowledge as I can, even though I’m mentally retarded.</p>\n\n<p>Even though you morons can’t read, have your wife’s/gf’s boyfriend read this to you and DRILL it in your fucking smooth brain: LIQUID NATURAL GAS (LNG) DEMAND IS RISING AND WILL CONTINUE TO RISE FOR THE NEXT DECADE (“dEcAde” is a period of ten years for you single digit IQ fucks) AND BEYOND. LNG will be the “transition” fuel between dirtier energy sources and &quot;green&quot; energy. This transition is coming sooner than we think. </p>\n\n<p>Are you following?</p>\n\n<p>What&#39;s this LNG, you might ask. You need to liquefy gas (basically “concentrating” it) so that it becomes economical to ship overseas. Overseas markets for LNG is massive and growing. Seriously look it up, EU, China, and others are increasingly relying on the stuff. It’s much more expensive for them to produce than the US.</p>\n\n<p>When a producer (the company that puts together millions of dollars to drill a well) drills for oil, if your drill and zone prediction (a “zone” is the area that a geologist, paid for by the producer, finds to contain oil) is correct, 99% of the time, three products will flow to the earth’s surface in your process. These three are water, oil, and NATURAL GAS. Producers will separate oil and water dispose of this waste water into a disposal well thousands and thousands of feet deep. Producers will then sell the oil.… What happens to the gas?? Well, if the producer is lucky, there will be a pipeline within a mile or two of their well. They will have to pay WAY over 200K to 500K just welding a mile of gas pipeline to tie into this sales line then pay 100 to 250K for a LACT unit. This is why oilfield welders have fewer IQs than I do but make $150/hr, depending upon pipeline wall thickness (dependent upon flowing pressures and how safe the producer wants to be if not bound by DOT regulations)</p>\n\n<p>If these costs aren’t too high, and the well is producing as much product as expected, then great, they sell gas. However, if they&#39;re producing less oil than predicted, or they&#39;re producing thousand of barrels of water per day, their disposal costs will be so high, they can’t afford to build the pipeline, they will just burn the stuff. Seriously, I can not tell you HOW MUCH GAS IS JUST BURNED. The VAST majority of producers just “flare” the gas. Just the “flare” vessel is like $30K. Imaging paying $30K to burn LNG that&#39;s worth 100s of thousands of dollars. I worked in the Permian basin in West Texas. Anyone here with this experience can vouch for me. At night, in the Permian, the sky is literally lit up with these flares. It’s like you&#39;re a goddamn ant on a fucking birthday cake that’s for both for your great great great mothers and her boyfriend’s birthday (basically a shit load of candles). It’s an amazing sight.</p>\n\n<p>­---------wWhY dO tHeY DoO WasTE gAAS??------------------</p>\n\n<p>You’re in the middle of fucking NOWHERE. You’d have to run hundreds of miles of pipeline to sell the gas. This would cost more than drilling the well. No company in their right mind would do this. The only options is to flare it. This one company I was working for was burning over 100K worth of natural gas per MONTH PER WELL, they had FIVE wells. The US just burns the crap, we can produce it so cheap, it just makes more sense to burn it rather than bothering to sell it. Gas is a nuisance to us. Other countries would die for it. There is actually new technologies that converts LNG into GASOLINE for cars. If you’re a stupid brain dead fuck who doesn&#39;t believe me, fucking Google it. </p>\n\n<p>-------So what about this TeLlUriAn coMpaNIee?-----------</p>\n\n<p>Charif Souki started Tellurian. If you don’t know who he is, he is a LNG god. He was a banker on Wall St, highest paid CEO years ago, pioneered the LNG industry. He and his team are impeccable. If you want to build a LNG empire, you hire Souki, if you want to know the future of hydrocarbon energy, you hire Souki, if you want a new boyfriend for your wife, you hire Souki. He built Cheniere Enerny (about 2 hours from my house), a company with $10billion in revenue and is trading $80/share. He left the company because the LNG business model is requiring a change. It will need to be produced at less cost, current business models aren’t sustainable. Cheniere Energy is over 20 BILLION dollars in debt. Yes, $20 BILLIOOONNNNNNNN. Guess how much debt Tellurian has? ZERO, NONE, $0.00. This is UNHEARD of in a new company in this industry. </p>\n\n<p>Tellurian just signed a 10 BILLION dollar purchase agreement from ONE company. TELL is currently talking deals with at least 4 other companies. This 10 billion dollar deal is a 10 year agreement. This is 1 billion per year. Their current market cap is just over 1 billion. Do you realize yet how undervalued this company is?? It’s mind blowing. They begin their Driftwood facility construction in Louisiana this summer. This will be the terminal to export LNG, 32 billion dollar project.</p>\n\n<p>Do you know whats even better?? They wont completely rely on third party producers selling them gas to liquefy, BECAUSE THEY DRILL AND PRODUCE THEIR OWN GAS. They started drilling again after a brief pause due to covid-19. We pay for monthly reports of all producers who receive state permits for drilling. Just this month Tellurian has TWO permits.</p>\n\n<p>Souki uploads regularly to YouTube (seriously what other major high level executive does this??), he was on Jim Cramers show multiple times, Jim Cramer was always contrary to Souki’s predictions, and SOUKI ALWAYS turned out RIGHT. Look it up, these are Jim Crammer’s words, NOT mine. Just a day or two ago, Souki said in his YouTube video “we are preparing for the ride of a lifetime.” I assume this is his way of telling us “buy in now you fucking retards” without being fined by the SEC.</p>\n\n<p>------------HOW is ThiS LIKE GME, AMC, BB?-----------------</p>\n\n<p>THE SHORT POSITIONS OMG YOU SHOULD KNOW THIS BY NOW. IT’S 17%!! Most of these positions were taken out at pandemic start. The joke is on them, Tellurian paid off their debts during their worst time HAHAHAHAHA. There WILL be a short squeeze. These shorts have no fucking clue about this dream team, the true depth of industry, and future of LNG production. </p>\n\n<p>---------------------hOw MuchH CanI MAKe?---------------------</p>\n\n<p>At the VERY VERY least, I’m betting we run to pandemic level of $10-11/share (REMEMBER THIS WAS BEFORE THEY EVEN SIGNED ANY PURCHASE AGREEMENTS!!!). Calls are still cheap.</p>\n\n<p>------------------------------PROOFS----------------------------------lll--------</p>\n\n<p>A screenshot of the rig reports showing Tellurian’s activities…..\n<a href=\"http://imgur.com/gallery/hw7kJuy\">http://imgur.com/gallery/hw7kJuy</a></p>\n\n<p>Tl;dr - undervalued company with no debt and unlimited potential in energy industry with a middleman position to the transition to clean energy WITH SHORT POSITIONS about to lift off. Will double in price AT LEAST if not liftoff exponentially to the goddamn moon.</p>\n\n<p>EDIT: THEY JUST ANNOUNCED ANOTHER SIGNED DEAL THIS MORNING! I FUCKING LOVE THIS STOCK</p>\n</div><!-- SC_ON -->",
  "score": 1371,
  "permalink": "/r/wallstreetbets/comments/nrdw8v/another_gme_amc_bb_aimed_for_the_moon/",
  "subreddit": "wallstreetbets",
  "id": "nrdw8v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404890216
}