{
  "author": "fan_of_hakiksexydays",
  "original_created_utc": 1640014883,
  "title": "What was it really like during the 2017 bull run? I will walk you through the key moments of what went on in 2017. The mistakes I made. What really went on. It might give you a better perspective of how this market behaves.",
  "created_utc": 1640021482,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Have a seat by the fire, and I will tell you the classic Christmas story of the chronicles of 2017.&lt;/p&gt;\n\n&lt;h1&gt;THE PRELUDE&lt;/h1&gt;\n\n&lt;p&gt;It all started on a December day, in 2016, very much like today.&lt;/p&gt;\n\n&lt;p&gt;At that time, I no longer had any crypto. I had already sold all of my coins, and after the Mt Gox mess, never looked back.&lt;/p&gt;\n\n&lt;p&gt;Until Bitcoin caught my eye again. That month, Bitcoin was reaching prices I had not seen before.&lt;/p&gt;\n\n&lt;p&gt;Last I remembered, the price was around $300-$400. And now I see prices well over $700. Something was going really well in the Bitcoin universe. Maybe I need to start paying attention again. But I didn&amp;#39;t buy yet.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;December 2016- Prices: $750-$1,150&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/xt3on38xtp681.jpg?width=965&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=c599170a478c4828df49d3f8f09970f188cf089d\"&gt;Dec 2016&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;It went parabolic, followed by a big crash down to $800. So I thought this must be the bear market. Maybe I should consider buying. But it actually quickly recovered. This was something similar to what we&amp;#39;ve already seen in 2013. An initial spike, with a big crash early on.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;EARLY 2017&lt;/h1&gt;\n\n&lt;p&gt;At the beginning of 2017, I started paying more attention, and looked at how far along things were. And started gaining a little more trust again. Shaking off my Mt GOX trauma.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;March 2017- Prices: $930-$1,275&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;In March 2017, I finally did it, I jumped in. I made my GDAX account (the old Coinbase pro), and started buying a little bit of Bitcoin.&lt;/p&gt;\n\n&lt;p&gt;I saw there was a little dip from $1,275 down to around $1,160. So I decided to &amp;quot;buy the dip&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Of course, as always, it dipped even more and went all the way down to the low $900s.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/ea3ccbv2up681.jpg?width=973&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=3f7a7a1230b7b7c74f5ed2a74c3a70298a718b3c\"&gt;Early 2017. I bought. &lt;/a&gt;&lt;/p&gt;\n\n&lt;h1&gt;SUMMER 2017&lt;/h1&gt;\n\n&lt;p&gt;&lt;strong&gt;June-July 2017- Price $1,990-$2,990.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;After that little dip, things bounced back, in a big way. Things were going great. Bitcoin looked like it was about to break $3K. I was thrilled but I was starting to become mindful of flying too close to the sun.&lt;/p&gt;\n\n&lt;p&gt;It dipped back down from a $3K rejection, and started stagnating. Then it crashed below $2K. I panicked a little and sold a little. Big mistake.&lt;/p&gt;\n\n&lt;p&gt;It was a very brief dip, and sprung back. When I saw the confirmation that things were back to normal, I bought a little more.&lt;/p&gt;\n\n&lt;p&gt;Peaks, and crashes into despair along a bull market. Is this starting to feel familiar?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/3sslcy2lup681.jpg?width=966&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=3df6b1ec1f2d96e9c817a76fb4f76b8f1f524524\"&gt;Summer 2017&lt;/a&gt;&lt;/p&gt;\n\n&lt;h1&gt;LATE SUMMER 2017&lt;/h1&gt;\n\n&lt;p&gt;&lt;strong&gt;September 2017. Prices: $3,200-$4,600&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Things went into &amp;quot;fantastic mode&amp;quot; in August. Bitcoin managed to finally break past $3K and reached a new ATH at $4,900.&lt;/p&gt;\n\n&lt;p&gt;In September we had another crash, when the market just couldn&amp;#39;t make a breakthrough past $5k. We dropped in the lower $3Ks. Again, it was pretty scary, and some people thought this was the end. The bull run might be over.&lt;/p&gt;\n\n&lt;p&gt;Again it recovered, and even more quickly than before. The market started to recover increasingly more quickly from any dips. That started to generate a lot of confidence, and maybe even overconfidence.&lt;/p&gt;\n\n&lt;p&gt;We entered the real FOMO phase, and started having all the obnoxious lambotards taking over the sub. This is also the month I first got into alt coins, and bought my first Ethereum.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/9qjvoerqup681.jpg?width=947&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=04b86c8849365b5ff2b7e7c110f601f07cf9d3b5\"&gt;Late Summer 2017&lt;/a&gt;&lt;/p&gt;\n\n&lt;h1&gt;AUTUMN 2017&lt;/h1&gt;\n\n&lt;p&gt;&lt;strong&gt;November 2017- Prices: $5,900-$7,500&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This is the fire phase. When get to that phase, you will definitely know.&lt;/p&gt;\n\n&lt;p&gt;Things were really on fire in November. The hype was starting to get pretty crazy. By that point, I thought I had really pushed my luck to the limit. I didn&amp;#39;t want to fly too close to the sun.&lt;/p&gt;\n\n&lt;p&gt;There had already been so many times I thought we had hit the peak.&lt;/p&gt;\n\n&lt;p&gt;I was sure the price would crash now. I pulled out my Bitcoins at $7K, and only kept my Ethereum, with a big sigh of relief.&lt;/p&gt;\n\n&lt;p&gt;Especially when the price dipped below $6K. For a moment there, I thought I was the smartest guy in the world. I thought I was Michael Burry, foreseeing the final crash.&lt;/p&gt;\n\n&lt;p&gt;But I ate my words very quickly, when the market bounced right back.&lt;/p&gt;\n\n&lt;p&gt;I was in disbelief.&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t want to touch Bitcoin, and bought more alt coins instead. In retrospective, it may not make a lot of sense with what we know today.&lt;/p&gt;\n\n&lt;p&gt;Keep in mind, at the time we didn&amp;#39;t know that much about alt coins, nor how that market behaved. You usually bought alt-coins, thinking they could be the next Bitcoin, and have a Bitcoin run of their own.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/8vvzm030vp681.jpg?width=965&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=71218fe998a77800bc2bee24391a350fd259eb1b\"&gt;Autumn 2017&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;The Peak.&lt;/h1&gt;\n\n&lt;p&gt;&lt;strong&gt;Early December 2017- Prices: $11K-$15K&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Bitcoin eventually went way past $10K, and even to $15K. I was really in disbelief. I kept telling people to watch out, this thing will definitely crash. But I was downvoted by the lambo club. And proven wrong with every new high. It did start to feel like 3am at a nightclub. When the crowd is at its drunkest and highest, although it may feel like the party will never stop, it&amp;#39;s all about to come to an abrupt end.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Mid December- Prices $15K-$19.5K&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;When the club didn&amp;#39;t close, and the show went on, I started to doubt myself. Shit, maybe I&amp;#39;m the one who is wrong here. Maybe this thing will never crash.&lt;/p&gt;\n\n&lt;p&gt;When the price went above $17K, and it seemed like every dip failed and got eaten up, I seriously considered buying back in. But I didn&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;At least I still had a little bit in alt coins, and they were also on fire.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/yie0l232vp681.jpg?width=966&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=cbc7e299546a537932dc2fe5069986123c1d7c77\"&gt;The peak. &lt;/a&gt;&lt;/p&gt;\n\n&lt;h1&gt;The Crash&lt;/h1&gt;\n\n&lt;p&gt;&lt;strong&gt;End of December- Prices $19.5K-$12K&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;When you least expect it, expect it. It finally happened. It crashed, or started to crash. Was it because of the opening of CME futures? Was it because of the upcoming Chinese new year? A lot of people tried to point fingers at anything.&lt;/p&gt;\n\n&lt;p&gt;The reaction was still mixed. Many people believed this was just another brief crash, while some thought this could be the one. But there had been so many fakeouts, it was still hard to tell.&lt;/p&gt;\n\n&lt;p&gt;For the last few weeks of December, there was a lot of confusion. I bought in a little bit, the discount was too tempting.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/urtx9pl8vp681.jpg?width=973&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=06df90f5f3962708d5c0f05b905c740e60adbe5d\"&gt;The crash.&lt;/a&gt;&lt;/p&gt;\n\n&lt;h1&gt;THE DAWN OF THE BEAR MARKET&lt;/h1&gt;\n\n&lt;p&gt;&lt;strong&gt;January 2018- Prices: $17,500-$10,100.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;About half the people had realized by now that the bull run had come to an end. Interestingly, there was still a lot of buzz for alts.&lt;/p&gt;\n\n&lt;p&gt;While the reality hit the market that this was a serious crash, and possibly a bear market, there was still some optimism about Bitcoin going no lower than $10K, and things slowly climbing back over the course of the year. This is partly why alt coins were still big. There was still the belief that they could be the next Bitcoin, and could be cheap to buy right now. It was later discovered to be a fatal mistake, as most of these alt coins dropped more than 80%, many over 90%.&lt;/p&gt;\n\n&lt;h1&gt;Goblin Town.&lt;/h1&gt;\n\n&lt;p&gt;Bitcoin didn&amp;#39;t climb back, and did drop below $10K.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;February-June 2018- $11K-$6K&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;In February we had a nice little fakeout and bull trap. For a moment, many people thought the worst was behind us. But reality finally hit everyone. And any lingering optimism was gone.&lt;/p&gt;\n\n&lt;p&gt;The Lambo club had vanished completely. Activity in crypto subs and forums plummeted.&lt;/p&gt;\n\n&lt;p&gt;The mood was something like out of a bread line of the great depression.&lt;/p&gt;\n\n&lt;p&gt;Brother can you spare me some BCH? Oh wait, those became worthless a few months later during the Hash Wars. Because on top of all this, we had the Hash Wars, a nasty black swan event in the middle of a bear winter.&lt;/p&gt;\n\n&lt;p&gt;We weren&amp;#39;t just in a winter, we were far below the snow. We were in goblin town.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;How did I come out?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I made a lot of mistakes, but still managed to do really well in 2017. But paid back a lot of it in the crypto winter.&lt;/p&gt;\n\n&lt;p&gt;I learned to be a little more conservative, check my emotions at the door, and build a little strategy of my own. Kind of a hybrid of DCA.&lt;/p&gt;\n\n&lt;p&gt;So no, I&amp;#39;m not a millionaire yet. And still very far from it.&lt;/p&gt;\n\n&lt;p&gt;And I don&amp;#39;t think too many people came out millionaires.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 192,
  "permalink": "/r/CryptoCurrency/comments/rkq2pk/what_was_it_really_like_during_the_2017_bull_run/",
  "subreddit": "CryptoCurrency",
  "id": "rkq2pk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Have a seat by the fire, and I will tell you the classic Christmas story of the\nchronicles of 2017.\n\n\nTHE PRELUDE\n\nIt all started on a December day, in 2016, very much like today.\n\nAt that time, I no longer had any crypto. I had already sold all of my coins,\nand after the Mt Gox mess, never looked…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "火のそばに座って、クリスマスの定番のお話をしましょう。\n2017年のクロニクル\n\n\nTHE PRELUDE（プルード\n\n始まりは2016年、今日とよく似た12月のある日でした。\n\nその時、私はもう暗号を持っていませんでした。私はすでにすべてのコインを売却していました。\nMt.Goxの騒動以降、見る影もなく...。",
      "title": "2017年のブルランの時は、実際どうだったのでしょうか？2017年に何が起こったのか、重要な場面を紹介します。私が犯した過ち。本当にあったこと。この市場がどのように振る舞うか、より良い視点を与えてくれるかもしれません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "请在火炉旁坐下，我将告诉你2017年的经典圣诞故事。\n2017年的编年史。\n\n\n前奏曲\n\n这一切都始于2016年12月的一天，和今天很像。\n\n那时候，我已经没有任何加密货币了。我已经卖掉了我所有的币。\n在Mt Gox的混乱之后，我再也没有看...",
      "title": "在2017年的牛市中，到底是什么样的情况？我将带领你了解2017年发生的关键时刻。我所犯的错误。真正发生了什么。它可能会让你对这个市场的表现有一个更好的看法。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "請在火爐旁坐下，我將告訴你2017年的經典聖誕故事。\n2017年的編年史。\n\n\n前奏曲\n\n這一切都始於2016年12月的一天，和今天很像。\n\n那時候，我已經沒有任何加密貨幣了。我已經賣掉了我所有的幣。\n在Mt Gox的混亂之後，我再也沒有看...",
      "title": "在2017年的牛市中，到底是什麼樣的情況？我將帶領你瞭解2017年發生的關鍵時刻。我所犯的錯誤。真正發生了什麼。它可能會讓你對這個市場的表現有一個更好的看法。"
    }
  ]
}