{
  "author": "jlaw224",
  "the_new_excerpt": "They put a bunch of professional gamblers in a position where ALL WE HAVE TO DO\nIS BUY AND HOLD SHARES... Some of us yolo OTM weeklies ON FUCKING THURSDAYS and\nhaven't held shares since we crawled out of our mama's tummy. We've been\ngrinding through endless challenges and impossible video games…",
  "original_created_utc": 1615055205,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "他们让一群职业赌徒陷入了困境，而我们要做的就是...\n是买和持有股份... ... 我们中的一些人YOLO OTM周刊上他妈的周四和。\n自从我们从妈妈的肚子里爬出来后，就没有持有过股票。我们已经\n通过无休止的挑战和不可能的视频游戏研磨... ...",
      "title": "这些该死的对冲者认为他们在和谁打交道？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他們讓一羣職業賭徒陷入了困境，而我們要做的就是...\n是買和持有股份... ... 我們中的一些人YOLO OTM週刊上他媽的週四和。\n自從我們從媽媽的肚子裏爬出來後，就沒有持有過股票。我們已經\n通過無休止的挑戰和不可能的視頻遊戲研磨... ...",
      "title": "這些該死的對沖者認爲他們在和誰打交道？"
    }
  ],
  "title": "Who do these hedge fucks think they are dealing with?",
  "created_utc": 1615094722,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>They put a bunch of professional gamblers in a position where ALL WE HAVE TO DO IS BUY AND HOLD <strong>SHARES</strong>... Some of us yolo OTM weeklies ON FUCKING <strong>THURSDAYS</strong> and haven&#39;t held shares since we crawled out of our mama&#39;s tummy. We&#39;ve been grinding through endless challenges and impossible video games since before our collective balls dropped for literally nothing but bragging rights. Now, real money is on the table for our struggles and I can&#39;t wait to taste the sweet sweet tears of the soon to be broke-ass hedge fund douche-nozzles who thought scaring us with a little red was going to save them. What they didn&#39;t count on was the simple fact that <strong>WE EAT LOSSES FOR BREAKFAST</strong> AND <strong>BUYING THE DIP</strong> IS OUR <strong>GO TO</strong> <strong>PANIC MOVE</strong>.</p>\n\n<p>To all you gay bears in training combing through our posts: First off, I hope you&#39;ve learned that when you think you&#39;re smarter than the internet, you end up with buckets of $CUM. Secondly, I hope you have some savings because your employers are about to go bankrupt... It&#39;s time to switch to plan B. I&#39;ll be glad to support you with all my GME tendies by letting you get on your knees and prove your worth on whatever street corner your wife&#39;s boyfriend lets you work when you&#39;re not locked in his basement.</p>\n\n<p>Rant over</p>\n\n<p>&#x200B;</p>\n\n<p>Edit: Thanks for the awards guys! I usually lurk pretty hard but this felt right</p>\n</div><!-- SC_ON -->",
  "score": 1903,
  "permalink": "/r/wallstreetbets/comments/lz7r44/who_do_these_hedge_fucks_think_they_are_dealing/",
  "subreddit": "wallstreetbets",
  "id": "lz7r44",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542583497
}