{
  "author": "lucaxx85",
  "original_created_utc": 1636901561,
  "title": "Is there a clear definition of clear \"highly processed food\"?",
  "created_utc": 1636910432,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve read multiple studies posted in <a href=\"/r/science\">/r/science</a> about how a diet rich in &quot;highly processed foods&quot; might induce this or that pahology.</p>\n\n<p>Yet, it&#39;s not clear to me what a highly processed food is anyway. I&#39;ve read the ingredients of some specific packaged snacks made by very big companies and they&#39;ve got inside just egg, sugar, oil, milk, flours and chocolate. Can it be worse than a dessert made from an artisan with a higher percentage of fats and sugars?</p>\n\n<p>When studies are made on the impact of highly processed foods on the diet, how are they defined?</p>\n</div><!-- SC_ON -->",
  "score": 199,
  "permalink": "/r/askscience/comments/qtrdr7/is_there_a_clear_definition_of_clear_highly/",
  "subreddit": "askscience",
  "id": "qtrdr7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've read multiple studies posted in /r/science about how a diet rich in \"highly\nprocessed foods\" might induce this or that pahology.\n\nYet, it's not clear to me what a highly processed food is anyway. I've read the\ningredients of some specific packaged snacks made by very big companies and\nthey've…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/scienceに投稿された「高度に加工された食品」を多く含む食事がこのような症状を引き起こすかもしれないという複数の研究を読みました。\n加工度の高い食品」を多く含む食事が、このような症状を引き起こす可能性があるという複数の研究を/r/scienceで読みました。\n\nしかし、そもそも加工度の高い食品とは何なのか、私にはよくわかりません。読んだことがあるのは\n大企業が作った特定のパッケージのスナック菓子の成分を読んでみました。\nそれは...",
      "title": "明確な「高度加工食品」の定義はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在/r/science上读到了多项研究，关于富含 \"高度加工食品 \"的饮食可能会诱发这种情况，或者说是 \"高度加工食品\"。\n饮食中富含 \"高度加工食品 \"可能会诱发这种或那种病症。\n\n然而，我并不清楚什么是高度加工食品。我读过\n一些大公司生产的特定包装零食的成分。\n他们已经...",
      "title": "是否有明确的 \"高度加工食品 \"的定义？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在/r/science上讀到了多項研究，關於富含 \"高度加工食品 \"的飲食可能會誘發這種情況，或者說是 \"高度加工食品\"。\n飲食中富含 \"高度加工食品 \"可能會誘發這種或那種病症。\n\n然而，我並不清楚什麼是高度加工食品。我讀過\n一些大公司生產的特定包裝零食的成分。\n他們已經...",
      "title": "是否有明確的 \"高度加工食品 \"的定義？"
    }
  ]
}