{
  "author": "_FleetingExistence_",
  "original_created_utc": 1645738590,
  "title": "Should a young adult feel any shame to be living a solitary and quiet life?",
  "created_utc": 1645746184,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I(M22) do my part. I have a job, I conform to the laws of society, I don’t cause any trouble or mischief, I get along with my coworkers well. But at the end of the day I’m met with the same empty life at home. No messages, no plans, no pings, rings, or notifs. I have my pets waiting for me, but that’s really it.&lt;/p&gt;\n\n&lt;p&gt;I haven’t gotten around to making any new friends. I’ve made none since high school, not even in college I’ve found any, haven’t had anything close to a girlfriend, and despite many things going my way in life, I can’t manage to change this one. &lt;/p&gt;\n\n&lt;p&gt;Almost like I’m incapable of any connection. I hate to think this way, I try not to. Some days you just can’t help it.&lt;/p&gt;\n\n&lt;p&gt;I don’t drink or take any drugs or substances. Certainly not hideous as I exercise often and watch my health. Music and video games distract me from everything, but I’m probably not doing enough to meet people or some shit. &lt;/p&gt;\n\n&lt;p&gt;Am I happy? Somewhat yes, somewhat no. I like how I am, other times I want to move or go off the grid.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/t0m3vc/should_a_young_adult_feel_any_shame_to_be_living/",
  "subreddit": "TooAfraidToAsk",
  "id": "t0m3vc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I(M22) do my part. I have a job, I conform to the laws of society, I don’t cause\nany trouble or mischief, I get along with my coworkers well. But at the end of\nthe day I’m met with the same empty life at home. No messages, no plans, no\npings, rings, or notifs. I have my pets waiting for me, but…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私(M22)は自分の役割を果たす。私は仕事を持っていますし、社会の法律にも従っていますし、何も起こしませんし\nトラブルやいたずらもなく、同僚ともうまくいっている。しかし、最後には\n家では相変わらずの空っぽの生活。メッセージもない、予定もない。\nピング、リング、または通知。ペットが待っているのに・・・。",
      "title": "若い人が孤独で静かな生活を送ることを恥じる必要はあるのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（M22）做我自己的事。我有一份工作，我遵守社会的法律，我不制造任何麻烦或恶作剧，我与我的同事相处得很好。\n任何麻烦或恶作剧，我和我的同事们相处得很好。但是到了最后\n我在家里遇到的是同样空虚的生活。没有信息，没有计划，没有\npings, rings, or notifs. 我有我的宠物在等我，但...",
      "title": "一个年轻的成年人应该为自己过着孤独和安静的生活而感到羞耻吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（M22）做我自己的事。我有一份工作，我遵守社會的法律，我不製造任何麻煩或惡作劇，我與我的同事相處得很好。\n任何麻煩或惡作劇，我和我的同事們相處得很好。但是到了最後\n我在家裏遇到的是同樣空虛的生活。沒有信息，沒有計劃，沒有\npings, rings, or notifs. 我有我的寵物在等我，但...",
      "title": "一個年輕的成年人應該爲自己過着孤獨和安靜的生活而感到羞恥嗎？"
    }
  ]
}