{
  "author": "ADD-DDS",
  "the_new_excerpt": "I’ve noticed a massive uptick in the number of unsolicited message with “hi” or\n“hello”. I presently receive about 4 daily. As I am a curious person by nature I\nhave entertained many of the messages. They have one thing in common - they are\nall there to present some sort of too good to be true way…",
  "original_created_utc": 1623605654,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"hi \"や \"hello \"を使った迷惑メールが急増していることに気づきました。\n\"hello\". 現在、毎日4通ほど届いています。もともと好奇心旺盛な私は、多くのメッセージを楽しんでいます。\n多くのメッセージを楽しんでいます。それらには一つの共通点があります。\nそれは、すべてのメッセージが、ある種の素晴らしすぎる方法を提示するために存在しているということです...。",
      "title": "ランダムな人がメッセージを送ってくる？彼らはあなたを詐欺したいのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我注意到，带有 \"嗨 \"或 \"你好 \"的不请自来的信息数量大量增加了。\n\"你好\"。目前我每天收到大约4条。由于我是一个天生好奇的人，我\n我对许多信息进行了处理。它们有一个共同点--它们是\n都是为了呈现某种好得不能再好的方式......",
      "title": "是否有随机的人给你发信息？他们想诈骗你。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我注意到，帶有 \"嗨 \"或 \"你好 \"的不請自來的信息數量大量增加了。\n\"你好\"。目前我每天收到大約4條。由於我是一個天生好奇的人，我\n我對許多信息進行了處理。它們有一個共同點--它們是\n都是爲了呈現某種好得不能再好的方式......",
      "title": "是否有隨機的人給你發信息？他們想詐騙你。"
    }
  ],
  "title": "Are random people messaging you? They want to scam you.",
  "created_utc": 1623649489,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve noticed a massive uptick in the number of unsolicited message with “hi” or “hello”. I presently receive about 4 daily. As I am a curious person by nature I have entertained many of the messages. They have one thing in common - they are all there to present some sort of too good to be true way to double you money with crypto. Some offer sophisticated websites. Some just want you to send the money to them directly. Some are prying for information to use to hack your accounts/wallets. </p>\n\n<p>I don’t know who needs to hear this but ignore these parasite.</p>\n</div><!-- SC_ON -->",
  "score": 177,
  "permalink": "/r/CryptoCurrency/comments/nz1hkr/are_random_people_messaging_you_they_want_to_scam/",
  "subreddit": "CryptoCurrency",
  "id": "nz1hkr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009738584
}