{
  "author": "MarioTheMojoMan",
  "original_created_utc": 1631280272,
  "title": "By the time of Cleopatra, most Egyptian pyramids were already thousands of years old. What did later Ancient Egyptians think or say about these relics of their even-more-ancient past?",
  "created_utc": 1631346436,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Was knowledge about their construction and purpose mostly preserved, or was much of it lost to time? Were they considered important cultural heritage, odd curiosities, not remarked upon much at all, etc.?</p>\n\n<p>By the way, the invocation of Cleopatra isn&#39;t meant to restrict the question simply to her reign -- I&#39;m asking about later Ancient Egyptians generally.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/plkzhs/by_the_time_of_cleopatra_most_egyptian_pyramids/",
  "subreddit": "AskHistorians",
  "id": "plkzhs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Was knowledge about their construction and purpose mostly preserved, or was much\nof it lost to time? Were they considered important cultural heritage, odd\ncuriosities, not remarked upon much at all, etc.?\n\nBy the way, the invocation of Cleopatra isn't meant to restrict the question\nsimply to her…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "その構造や目的に関する知識は、ほとんど保存されていたのでしょうか、それとも多くが失われてしまったのでしょうか。\nそれとも、時間の経過とともに失われてしまったのでしょうか？重要な文化遺産とされていたのか、奇妙な\n重要な文化遺産とされていたのか、奇妙な珍品とされていたのか、あまり注目されていなかったのか、などなど。\n\nところで、クレオパトラを引き合いに出したのは、質問を単にクレオパトラに限定するためではありません。\n単に彼女に限った質問ではありませんが...。",
      "title": "クレオパトラの時代には、ほとんどのエジプトのピラミッドはすでに何千年も前のものでした。後世の古代エジプト人は、さらに古い時代の遺物であるこれらのピラミッドについて、どのように考え、どのように語ったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "关于它们的构造和用途的知识是否大部分被保存下来，还是有很多被遗失了？\n还是大部分被时间冲走了？它们是否被认为是重要的文化遗产、奇怪的\n它们被认为是重要的文化遗产，还是奇特的东西，或者根本就没有被提及，等等？\n\n顺便说一下，引用克利奥帕特拉并不是要把问题限制在她身上\n仅限于她...",
      "title": "在克利奥帕特拉时代，大多数埃及金字塔已经有几千年的历史了。后来的古埃及人对这些更古老的历史遗迹有什么看法或说法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關於它們的構造和用途的知識是否大部分被保存下來，還是有很多被遺失了？\n還是大部分被時間沖走了？它們是否被認爲是重要的文化遺產、奇怪的\n它們被認爲是重要的文化遺產，還是奇特的東西，或者根本就沒有被提及，等等？\n\n順便說一下，引用克利奧帕特拉並不是要把問題限制在她身上\n僅限於她...",
      "title": "在克利奧帕特拉時代，大多數埃及金字塔已經有幾千年的歷史了。後來的古埃及人對這些更古老的歷史遺蹟有什麼看法或說法？"
    }
  ]
}