{
  "author": "anotherjohnishere",
  "original_created_utc": 1629431434,
  "title": "A deeeeeeeep dive into Polkadot",
  "created_utc": 1629491925,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Namaste friends, </p>\n\n<p>Crypto ecosystems of value are few and far between, today I&#39;d like to discuss one of substantial potential: DOT. </p>\n\n<p><em>What is Polkadot</em> </p>\n\n<p>Polkadot was founded by Ethereum co-founder Gavin Wood in 2019 in order to do what he believed Ethereum was unable to. He was Ethereum&#39;s first CTO, a former research scientist at Microsoft, and the creator of the Solidity programming language used to write Dapps on Ethereum. He has since founded the Web3 foundation that sells the Polkadot token, and Parity that develops the software which is used to run polkadot&#39;s para-chains. By design it is a sharded blockchain on which people can build and operate their own blockchains on top of; giving people the ability to grow their blockchain as part of a larger ecosystem. It is a two pronged approach on which the main chain, called the relay chain, and user created networks called para-chains. </p>\n\n<p>Now, how Polkadot works is a bit complicated, so I&#39;ll try to explain it as simply as I can. </p>\n\n<p><em>How does it work?</em> </p>\n\n<p>Polkadot has a few moving parts. The first is the &quot;relay chain&quot; that operates as the main blockchain on which the para-chains are built, and where the transactions on said chains are finalized. The relay chain separates new transactions from the verification of said transactions, allowing DOT to process <strong>1,000 transactions per second</strong></p>\n\n<p>Para-chains are adjacent blockchains that use the relay chain to assure that transactions are accurate, and operate as separate but connected to the relay chain as a whole. </p>\n\n<p>And lastly there are bridges, which allows polkadot to interact with other blockchains of which they are looking to bridge to EOS, ETH, and potentially even BTC. </p>\n\n<p>Let&#39;s take a second to do a deeper dive into the relay chain and how it operates. </p>\n\n<p><em>The relay chain, how&#39;s that shit work?</em> </p>\n\n<p>The relay chain uses a variation of the PoS model call Nominated Proof of Stake (NPoS) This allows anyone who stakes DOT to perform one of more of 4 roles in the blockchain: </p>\n\n<p><em>1. Validator</em></p>\n\n<p>As the name implies validators validate data on the para-chain blocks, and also vote on proposed changes to the network. </p>\n\n<p><em>2. Nominators</em> </p>\n\n<p>Nominators participate in the selection of trustworthy validators on the relay chain by delegating their staked DOT to validators. </p>\n\n<p><em>3. Collators</em> </p>\n\n<p>Collators are nodes that compile data from the para-chains to be added to the relay chain, basically storing aggregate data to add to the whole. </p>\n\n<p><em>4. Fishermen</em> </p>\n\n<p>The narcs of the Polkadot world, they are there to call out bad behavior by validators by monitoring the network. </p>\n\n<p>The four of these combine to make polkadot one of the most robust ecosystems in the space, with bridging giving it a ton of room to grow. </p>\n\n<p>Of course like all staked coins staking your DOT also gives you the ability to vote on governance and influence the development of the network. This is also a multi tier-d system compromised of: </p>\n\n<p><em>DOT Holders</em> </p>\n\n<p>Anyone who holds polkadot is able to vote on proposals that will effect the way the blockchain operates, and can vote to approve or reject proposals as they please. </p>\n\n<p><em>The Council</em> </p>\n\n<p>The Council is elected by DOT holders, and are responsible for proposing changes and determine which changes voted on by holders are added to the software. Proposals by council members require less votes in order to be passed. </p>\n\n<p><em>The technical committee</em> </p>\n\n<p>Teams that actively build on the blockchain, they are there to make special proposals in the case of an emergency. They are voted in my council members. </p>\n\n<p>Now that we&#39;ve covered some of what makes DOT run, let&#39;s talk about it&#39;s tokenomics. </p>\n\n<p>Total supply: <strong>1 Billion</strong> (formerly 10 million) </p>\n\n<p>Polkadot was funded largely through two private sales netting them upwards of 200 million dollars, making it one of the most well funded projects in the history of crypto. It&#39;s max supply was increased drastically in 2020, with 83% of holders voting to increase the supply to 1 Billion. </p>\n\n<p><em>So <a href=\"/u/anotherjohnishere\">u/anotherjohnishere</a>, should I buy DOT?</em> </p>\n\n<p>Polkadot boasts one of the more robust ecosystems in crypto, with a substantial amount of potential to grow in the coming years. With a high profile founder, lots of projects coming down the line, bridges to other chains on the horizon, and that sweet sweet <strong>12% staking on Kraken</strong> this is a pretty nice part of my portfolio, and will continue to be for the foreseeable future. </p>\n\n<p>Be love. </p>\n\n<p>Disclaimer: I own $*** in DOT</p>\n\n<p>Comment below to request your favorite projects get a deep dive and I&#39;ll be onto the next one!</p>\n</div><!-- SC_ON -->",
  "score": 176,
  "permalink": "/r/CryptoCurrency/comments/p7uhf3/a_deeeeeeeep_dive_into_polkadot/",
  "subreddit": "CryptoCurrency",
  "id": "p7uhf3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Namaste friends,\n\nCrypto ecosystems of value are few and far between, today I'd like to discuss\none of substantial potential: DOT.\n\nWhat is Polkadot\n\nPolkadot was founded by Ethereum co-founder Gavin Wood in 2019 in order to do\nwhat he believed Ethereum was unable to. He was Ethereum's first CTO, a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ナマステな友よ。\n\n価値のある暗号エコシステムは数少ないですが、今日はかなりの可能性を秘めたものについてお話したいと思います。\n今日は、大きな可能性を秘めた1つについてお話したいと思います。DOTです。\n\nPolkadotとは\n\nPolkadotは、Ethereumの共同設立者であるGavin Wood氏が2019年に、Ethereumができないと信じていたことを実現するために設立しました。\n彼がEthereumができないと考えたことを実現するために。彼はEthereumの最初のCTO、ア...",
      "title": "ポルカドットへのディープダイブ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Namaste friends,\n\n有价值的加密货币生态系统少之又少，今天我想讨论一下\n一个具有巨大潜力的生态系统。DOT。\n\n什么是Polkadot\n\nPolkadot是由以太坊联合创始人Gavin Wood在2019年创立的，目的是为了做\n他认为Ethereum无法做到的事情。他是以太坊的第一个CTO，一个...",
      "title": "深入了解波尔卡多的情况"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Namaste friends,\n\n有價值的加密貨幣生態系統少之又少，今天我想討論一下\n一個具有巨大潛力的生態系統。DOT。\n\n什麼是Polkadot\n\nPolkadot是由以太坊聯合創始人Gavin Wood在2019年創立的，目的是爲了做\n他認爲Ethereum無法做到的事情。他是以太坊的第一個CTO，一個...",
      "title": "深入瞭解波爾卡多的情況"
    }
  ]
}