{
  "author": "FilmVsAnalytics",
  "original_created_utc": 1635249056,
  "title": "PSA: A lot of people are entering crypto for the first time right now. Be gentle with them. Remember: We all started off by FOMOing in. Some of us were just luckier and had timing on our side.",
  "created_utc": 1635288095,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As crypto makes it into more mainstream headlines, we&#39;re going to see an influx of new investors who have no idea what they&#39;re getting into.   </p>\n\n<p>&quot;I just bought SOL at $200, what can I expect?&quot;  </p>\n\n<p>or  </p>\n\n<p>&quot;I bought some Bitcoin on Wednesday and it&#39;s already going down. Did I mess up?&quot;  </p>\n\n<p>You&#39;re going to read a lot of questions like this around crypto Reddit in the coming weeks.  </p>\n\n<p>Remember: Be gentle.  There&#39;s not a lot of difference between the clueless guy that YOLOed into Bitcoin in July and the one that did it last week.<br/>\nThere is a lot of difference between what they&#39;ve bought into though. And for most brand new investors, a lot of that comes down to dumb luck timing.  </p>\n\n<p>Buying in right after ATH can be frustrating or even scary, depending on what happens next.<br/>\nRemember the influx of people into crypto in late April and early May?  Folks were buying days after all-time-high and didn&#39;t recover their initial investment until this month.   </p>\n\n<p>It took them time to get an understanding of what the market was going to look like. A lot of them never even made it this far, and possibly sold at 30%, 45%, even 50% loss.  </p>\n\n<p>Of course, those that stuck around learned along the way. Possibly read a few posts about DCA. possibly read some of the &quot;I&#39;m a millionaire&quot; stories about the benefits of HODL.<br/>\nBut chances are, a lot of them asked what they should do.  </p>\n\n<p>What they hear next is crucial in what they do next.  </p>\n\n<p>Telling someone who only heard about bitcoin last month that they&#39;re dumb for FOMOing, or that they&#39;re braindead for investing more than they can afford to lose, or that they should have bought a dip, or that they are impatient and need to just watch the cycle... this isn&#39;t helpful.  </p>\n\n<p>The next few weeks is going to feel like an eternity for a lot of these people. Hell, there&#39;s a lot of uncertainty for all of us in this sub right now.  </p>\n\n<p>The best advice you can give them is to DCA, HODL, and soak up as much information as they can. Don&#39;t panic. Don&#39;t chase green. Don&#39;t FOMO. Just DCA, HODL, and Chill.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/qg4ou1/psa_a_lot_of_people_are_entering_crypto_for_the/",
  "subreddit": "CryptoCurrency",
  "id": "qg4ou1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As crypto makes it into more mainstream headlines, we're going to see an influx\nof new investors who have no idea what they're getting into.\n\n\"I just bought SOL at $200, what can I expect?\"\n\nor\n\n\"I bought some Bitcoin on Wednesday and it's already going down. Did I mess up?\"\n\nYou're going to read a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号が主流のニュースになるにつれ、自分が何をしているのかわからない新しい投資家が増えてくるでしょう。\n自分が何をしているのかわからない新しい投資家が増えてくるでしょう。\n\n\"SOLを200ドルで買ったばかりだが、何が期待できるのか？\"\n\nあるいは\n\n\"水曜日にビットコインを買ったが、すでに下がっている。私は失敗したのか？\"\n\nあなたが読むのは...",
      "title": "PSA：今、多くの人が初めてcryptoに参入しています。彼らには優しく接してあげてください。思い出してください。私たちは皆、最初はFOMOして入ったのです。一部の人は運が良く、タイミングが味方してくれただけです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "随着加密货币进入更多的主流头条新闻，我们将看到大量的新投资者涌入，他们不知道自己在做什么。\n新的投资者，他们不知道自己进入了什么。\n\n\"我刚刚在200美元买了SOL，我能期待什么？\"\n\n或\n\n\"我在星期三买了一些比特币，它已经在下跌了。我是不是搞砸了？\"\n\n你将会读到一个...",
      "title": "PSA：现在很多人都是第一次进入加密货币。对他们要温柔。记住。我们都是通过FOMO进入开始的。我们中的一些人只是比较幸运，有时机在我们身边。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着加密貨幣進入更多的主流頭條新聞，我們將看到大量的新投資者湧入，他們不知道自己在做什麼。\n新的投資者，他們不知道自己進入了什麼。\n\n\"我剛剛在200美元買了SOL，我能期待什麼？\"\n\n或\n\n\"我在星期三買了一些比特幣，它已經在下跌了。我是不是搞砸了？\"\n\n你將會讀到一個...",
      "title": "PSA：現在很多人都是第一次進入加密貨幣。對他們要溫柔。記住。我們都是通過FOMO進入開始的。我們中的一些人只是比較幸運，有時機在我們身邊。"
    }
  ]
}