{
  "author": "BanjosRuleDude",
  "the_new_excerpt": "You have officially seen and been apart of the most perfectly designed and\nexecuted redistribution of wealth in cryptocurrency history.\n\nRichard Demille Wyckoff. Considered a titan of technical analysis. The man we\nall wish we could be. Why does his name matter to you? Because he designed what\nis…",
  "original_created_utc": 1621792648,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あなたは公式に、暗号通貨の歴史の中で最も完璧に設計され、実行された\nあなたは、暗号通貨の歴史の中で最も完璧に設計され、実行された富の再分配を公式に見て、参加したことになります。\n\nリチャード・デミル・ウィッコフ テクニカル分析の巨人と言われています。私たちが\n誰もがそうなりたいと願っている男です。なぜ彼の名前があなたにとって重要なのか？彼がデザインしたものは\n考案したからです...",
      "title": "少なくとも4ヶ月以上前に暗号化に参加していれば、正式に歴史に名を連ねることになります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你已经正式看到并参与了加密货币历史上最完美的设计和\n的财富再分配。\n\n理查德-德米尔-韦科夫。被认为是技术分析的泰斗。这个人是我们\n我们都希望自己能成为这样的人。为什么他的名字对你很重要？因为他设计了什么\n是...",
      "title": "如果你至少在4个月前加入加密货币，你就正式成为历史的一部分。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你已經正式看到並參與了加密貨幣歷史上最完美的設計和\n的財富再分配。\n\n理查德-德米爾-韋科夫。被認爲是技術分析的泰斗。這個人是我們\n我們都希望自己能成爲這樣的人。爲什麼他的名字對你很重要？因爲他設計了什麼\n是...",
      "title": "如果你至少在4個月前加入加密貨幣，你就正式成爲歷史的一部分。"
    }
  ],
  "title": "If you joined crypto atleast 4 months ago you are officially apart of history.",
  "created_utc": 1621832453,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You have officially seen and been apart of the most perfectly designed and executed redistribution of wealth in cryptocurrency history.</p>\n\n<p>Richard Demille Wyckoff. Considered a titan of technical analysis. The man we all wish we could be. Why does his name matter to you? Because he designed what is known as &quot;Wyckoff Distribution&quot;.</p>\n\n<p>What is Wyckoff distribution?</p>\n\n<p>The distribution is sideways and a range-bound trading period. It usually occurs after a prolonged uptrend. This is the trading zone where big players build short positions or distribute long positions and wash out retail traders. They distribute positions gradually to avoid the price from changing significantly.</p>\n\n<p>Alot of big words, I know. Maybe you&#39;re a visual learner?</p>\n\n<p><a href=\"http://imgur.com/gallery/crUu8co\">http://imgur.com/gallery/crUu8co</a></p>\n\n<p>That is your distribution schematic, now let&#39;s learn what these indicators mean real quick!</p>\n\n<p>PS—preliminary support, where substantial buying begins to provide pronounced support after a prolonged down-move. Volume increases and price spread widens, signaling that the down-move may be approaching its end.</p>\n\n<p>SC—selling climax, the point at which widening spread and selling pressure usually climaxes and heavy or panicky selling by the public is being absorbed by larger professional interests at or near a bottom. Often price will close well off the low in a SC, reflecting the buying by these large interests.</p>\n\n<p>AR—automatic rally, which occurs because intense selling pressure has greatly diminished. A wave of buying easily pushes prices up; this is further fueled by short covering. The high of this rally will help define the upper boundary of an accumulation TR.</p>\n\n<p>ST—secondary test, in which price revisits the area of the SC to test the supply/demand balance at these levels. If a bottom is to be confirmed, volume and price spread should be significantly diminished as the market approaches support in the area of the SC. It is common to have multiple STs after a SC.</p>\n\n<p>Test—Large operators always test the market for supply throughout a TR (e.g., STs and springs) and at key points during a price advance. If considerable supply emerges on a test, the market is often not ready to be marked up. A spring is often followed by one or more tests; a successful test (indicating that further price increases will follow) typically makes a higher low on lesser volume.</p>\n\n<p>SOS—sign of strength, a price advance on increasing spread and relatively higher volume. Often a SOS takes place after a spring, validating the analyst’s interpretation of that prior action.</p>\n\n<p>LPS—last point of support, the low point of a reaction or pullback after a SOS. Backing up to an LPS means a pullback to support that was formerly resistance, on diminished spread and volume. On some charts, there may be more than one LPS, despite the ostensibly singular precision of this term.</p>\n\n<p>BU—“back-up”. This term is short-hand for a colorful metaphor coined by Robert Evans, one of the leading teachers of the Wyckoff method from the 1930s to the 1960s. Evans analogized the SOS to a “jump across the creek” of price resistance, and the “back up to the creek” represented both short-term profit-taking and a test for additional supply around the area of resistance. A back-up is a common structural element preceding a more substantial price mark-up, and can take on a variety of forms, including a simple pullback or a new TR at a higher level.</p>\n\n<p>But OP you&#39;re just throwing phrases and charts at me, why does any of this mean anything to me or cryptocurrency!? Quit moon farming with pretty charts and words!</p>\n\n<p>I present to you the holy grail. BTCs 1 day candles aligned with the Wyckoff Distribution chart.</p>\n\n<p><a href=\"http://imgur.com/gallery/J4QKQyl\">http://imgur.com/gallery/J4QKQyl</a></p>\n\n<p>Perfect. Perfectly aligned.</p>\n\n<p>Many people were victims of one of the greatest orchestrated pump and dump across an entire market.</p>\n\n<p>Doge starts to blow up, brings newbies to crypto. Tesla buys in. Coinbase goes live. PayPal takes action, large banks too. Saylor buys more. Elon props it on a golden pedestal. These were all purposeful.</p>\n\n<p>As was the mood change that came after. We just took part in one of the largest redistribution of wealth in cryptocurrency history.</p>\n\n<p>This is what corporate adaptation brought us, billionaires coercing to leech money from the little guy. Nothing has changed. It&#39;s just a different market for them.</p>\n\n<p>If you&#39;re saying to yourself &quot;but I didn&#39;t sell how did I lose&quot; your losses may not be permanent like others, I can assure you that your portfolio is likely deep red unless you are a vetted investor that owns some seriously cheap coins.</p>\n\n<p>Take care of yourself friends.</p>\n\n<p>There is more on the Wyckoff Distribution strategy I didn&#39;t cover because it&#39;s simply ALOT. I&#39;ve linked my source below if you are interested.</p>\n\n<p>Source ; <a href=\"https://school.stockcharts.com/doku.php?id=market_analysis:the_wyckoff_method\">https://school.stockcharts.com/doku.php?id=market_analysis:the_wyckoff_method</a></p>\n\n<p>TLDR; Wyckoff Distribution strategy was just exercised on crypto to an exact T costing retail investors hundreds of millions if not billions of dollars. VERY likely all planned by a handful of seriously large whale investors.</p>\n</div><!-- SC_ON -->",
  "score": 642,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/KVp4MrD57miCapmapX4t4myc4HUMkS69aYLqJ0BZPjo.jpg?auto=webp&s=89ff93125b991575d911d03e14506ef308114c18",
          "width": 1022,
          "height": 587
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/KVp4MrD57miCapmapX4t4myc4HUMkS69aYLqJ0BZPjo.jpg?width=108&crop=smart&auto=webp&s=1e1d17f1171194b3693a980cbfdbda34fba06353",
            "width": 108,
            "height": 62
          },
          {
            "url": "https://external-preview.redd.it/KVp4MrD57miCapmapX4t4myc4HUMkS69aYLqJ0BZPjo.jpg?width=216&crop=smart&auto=webp&s=6e6004dbd2773ee4efb0a2bc8c0c3dc039274917",
            "width": 216,
            "height": 124
          },
          {
            "url": "https://external-preview.redd.it/KVp4MrD57miCapmapX4t4myc4HUMkS69aYLqJ0BZPjo.jpg?width=320&crop=smart&auto=webp&s=ed61e08758501135bd571495aaf8d73c5e05b540",
            "width": 320,
            "height": 183
          },
          {
            "url": "https://external-preview.redd.it/KVp4MrD57miCapmapX4t4myc4HUMkS69aYLqJ0BZPjo.jpg?width=640&crop=smart&auto=webp&s=5b2ffdd295bf68db40216ca5fb0e159dd8971c7b",
            "width": 640,
            "height": 367
          },
          {
            "url": "https://external-preview.redd.it/KVp4MrD57miCapmapX4t4myc4HUMkS69aYLqJ0BZPjo.jpg?width=960&crop=smart&auto=webp&s=9d98152bb5bb4c9f26a199e6608216e414a601da",
            "width": 960,
            "height": 551
          }
        ],
        "variants": {},
        "id": "xknbZKKK6DCgN5-pwLbQ596I5wLQ6cHnlzWGo_piSn8"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/njd4y4/if_you_joined_crypto_atleast_4_months_ago_you_are/",
  "subreddit": "CryptoCurrency",
  "id": "njd4y4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197385273
}