{
  "author": "SpartanDawg420",
  "the_new_excerpt": "I am typically a value oriented investor and focus heavily on valuations.\nFundamentals on Google are sound: strong recurring revenue base, monopolistic\ntendencies, value add to customer, network effects, cross selling across revenue\nstreams etc. I find it hard to argue that Google is going anywhere…",
  "original_created_utc": 1621135820,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は典型的なバリュー指向の投資家であり、バリュエーションを重視しています。\nグーグルのファンダメンタルズは健全です：強力な経常収益基盤、独占的傾向、顧客への付加価値、ネットワーク効果、収益全体でのクロスセリング\n傾向、顧客への付加価値、ネットワーク効果、収益源のクロスセルなど。\nなどです。Googleがどこかに行ってしまうということを論じるのは難しいと思います...。",
      "title": "GOOGL - 私は何を見逃しているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个典型的价值导向型投资者，非常关注估值问题。\n谷歌的基本面是健全的：强大的经常性收入基础、垄断倾向、客户增值、网络效应、跨收入的交叉销售。\n倾向、对客户的增值、网络效应、跨收入流的交叉销售等。\n流的交叉销售等等。我发现很难争辩说谷歌会去哪里......",
      "title": "GOOGL - 我错过了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個典型的價值導向型投資者，非常關注估值問題。\n谷歌的基本面是健全的：強大的經常性收入基礎、壟斷傾向、客戶增值、網絡效應、跨收入的交叉銷售。\n傾向、對客戶的增值、網絡效應、跨收入流的交叉銷售等。\n流的交叉銷售等等。我發現很難爭辯說谷歌會去哪裏......",
      "title": "GOOGL - 我錯過了什麼？"
    }
  ],
  "title": "GOOGL - What am I missing?",
  "created_utc": 1621161034,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am typically a value oriented investor and focus heavily on valuations.  Fundamentals on Google are sound: strong recurring revenue base, monopolistic tendencies, value add to customer, network effects, cross selling across revenue streams etc.  I find it hard to argue that Google is going anywhere anytime soon.</p>\n\n<p>Valuation wise, many think that FAANG is overpriced.  Some of it is.  Google trades at a whopping 37x earnings! But only 24x forward.  And only 15x fwd EV/EBITDA.  That is the metric I will focus on for now as I tend to use DCF models with EV/EBITDA terminal values.  The average EV/EBITDA multiple over the last 10 years is about 16x.  The lowest was 10x and 10x is the lowest it ever traded since IPO.  Using a DCF model and using ultra bear scenario of the following assumptions: 2022-2025 revenue growth of 0% annually (yes, correct),  gross margins of 55% (below the 10 year average of 60%), operating margin of about 23% (10 year average 25%), D&amp;A constant at 8% of revenue, Capex in line with Bloomberg estimates approx 16-17% of revenue, and change in NWC of about -3% (consistent with last 4 years).  WACC is 9.5% and used a 10x exit multiple.  This estimates an intrinsic value of $2068, about -9% from current values.  And that is the bear case with ultra bearish assumptions.</p>\n\n<p>The base case then with revenue growth of 10%, same margins, higher depreciation based on consensus estimates, and an exit multiple of the 10 year average of 16x yields a price of $4831, upside of 112%.</p>\n\n<p>Of course, I never truly depend on a DCF model to provide an exact price because there are so many assumptions that will never play out as expected, but it is a great tool to identify what factors impact price and some worst case scenarios.  It is further evidence to me that Google is one of the most undervalued large caps with a wide moat around its largest product, expanding its range and interconnectivity of its products constantly, and generating a significant amount of cash in the meantime.</p>\n\n<p>Let me know your thoughts.</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/investing/comments/ndfhbz/googl_what_am_i_missing/",
  "subreddit": "investing",
  "id": "ndfhbz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590802240
}