{
  "author": "BreakwaterResearch",
  "the_new_excerpt": "Loop Energy Inc. is the leading hydrogen fuel cell provider for commercial\nvehicles. It recently filed its prospectus to raise $100mn and list on the TSX,\nwith shares expected to price later this week. Here’s all you need to know about\nLoop Energy and its proposed IPO.\n\nSummary\n\n * Loop is the…",
  "original_created_utc": 1613491898,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Loop Energy Inc.是领先的商用氢燃料电池供应商。\n车辆。最近，它提交了招股书，准备募集1亿美元并在多伦多证券交易所上市。\n与股价有望在本周晚些时候定价。以下是你需要知道的关于\n河套能源及其拟上市。\n\n摘要\n\n * 循环是...",
      "title": "Loop Energy Inc. (多伦多证券交易所：LPEN) IPO DD - 领先的氢燃料电池供应商：您需要知道的是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Loop Energy Inc.是領先的商用氫燃料電池供應商。\n車輛。最近，它提交了招股書，準備募集1億美元並在多倫多證券交易所上市。\n與股價有望在本週晚些時候定價。以下是你需要知道的關於\n河套能源及其擬上市。\n\n摘要\n\n * 循環是...",
      "title": "Loop Energy Inc. (多倫多證券交易所：LPEN) IPO DD - 領先的氫燃料電池供應商：您需要知道的是什麼？"
    }
  ],
  "title": "Loop Energy Inc. (TSX: LPEN) IPO DD - The leading hydrogen fuel cell provider: here’s all you need to know",
  "created_utc": 1613516384,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Loop Energy Inc. is the leading hydrogen fuel cell provider for commercial vehicles. It recently filed its prospectus to raise $100mn and list on the TSX, with shares expected to price later this week. <strong><em>Here’s all you need to know about Loop Energy and its proposed IPO.</em></strong></p>\n\n<p><strong>Summary</strong></p>\n\n<ul>\n<li>Loop is the leading provider of hydrogen fuel cell systems targeted for the electrification of commercial vehicles</li>\n<li>Loop filed its preliminary prospectus for its $100mn IPO, pricing shares at ~$12-$16 (implying EV of ~$513mn)</li>\n<li>Investment Thesis:\n\n<ul>\n<li>Industry-leading, patented offering in the attractive rapidly expanding and strategically important market for the electrification of commercial vehicles</li>\n<li>Well-defined go to market strategy and path to profitability provides clear valuation and upside</li>\n<li>Market positioning solidified by best-in-class management/board, OEM partnerships, and backing from Cummins</li>\n<li>Provides Clean energy solution and interesting sustainability/ESG play</li>\n</ul></li>\n<li>Key Risks:\n\n<ul>\n<li>Realization of business development pipeline into fixed revenue contracts</li>\n<li>Existing and new competitors developing a more attractive, more widely adopted product offering</li>\n<li>Technological risk of more attractive technology rendering Loop’s technology and offering obsolete</li>\n<li>Large-scale manufacturing execution</li>\n</ul></li>\n<li><strong>Initiate at a Buy on valuation upside (see valuation section)</strong></li>\n<li><em>Note - all figures in Canadian Dollar (CAD)</em></li>\n</ul>\n\n<h1>Outline</h1>\n\n<ol>\n<li>Business Model</li>\n<li>Management, Board, and Ownership Overview</li>\n<li>Market Overview / Competitive Landscape</li>\n<li>IPO Details</li>\n<li>Financial Analysis</li>\n<li>Valuation / Key Risks</li>\n</ol>\n\n<p><strong>1. Business Model</strong></p>\n\n<p><em>What does Loop do?</em></p>\n\n<p>Loop designs, manufactures, sells, and services hydrogen fuel cell systems for the electrification of commercial vehicles. Its near-term focus markets include light/medium trucks (e.g. home delivery vehicles), semi-trucks, buses, and other commercial vehicles (mining, etc), with long-term plans to expand into other intermodal transport (marine, rail, etc).</p>\n\n<p><em>What is its product offering?</em></p>\n\n<p>Loop’s key products are fuel cell stacks (stacks of fuel cells that produce electricity and water when supplied with hydrogen and oxygen) and fuel cell modules (fuel cell stacks along with the balance of plant - all the necessary equipment to operate) and has manufacturing facilities in British Columbia, Canada, and Langfang, China. Loop believes that through its proprietary eFlow technology, its fuel cell systems are superior to its peers in terms of fuel efficiency, durability, and power.  We expect these characteristics to be key differentiators as Loop and its competitors race to secure OEM relationships and achieve mass-market adoption.</p>\n\n<p><em>Understanding the current landscape and Loop’s competitive advantages</em></p>\n\n<p>On the path to transitioning the global fleet to zero-emissions vehicles, Loop sees the current lithium-ion batteries as only a part of the solution, with its hydrogen fuel cells creating significant advantages over the existing solutions in terms of range, payload, and refueling times. Loop markets three key benefits to its fuel cells, compared to competitors, which we think well-position the company to continue to lead its industry. In addition to the technical competitive advantages which are outlined in the <em>Competitive Landscape</em> section, we see Loop’s industry positioning is supported by Cummin’s investment and its partnership with OEMs.</p>\n\n<p><em>Growth Strategy</em></p>\n\n<p>The company has rapidly developed its business development pipeline, forming partnerships with OEMs and building a relatively small revenue backlog of $16.4 million to date, with plans of significantly expanding this over time. The company expects that the larger OEM suppliers will be in a position to launch commercial vehicles with fuel cell systems between 2025 and 2027, meaning the company’s near-term focus should be on manufacturing fuel cell vessels in smaller volumes and developing its technology and backlog. Loop also has a JV with InPower in China to establish a manufacturing line. We think Loop’s stated strategy (below) is well-aligned with the most important objective - becoming the dominant player in the industry.</p>\n\n<p><em>Loop Growth Strategy</em></p>\n\n<ol>\n<li>Focus on commercial vehicle market and leverage products into other markets</li>\n<li>Scale manufacturing and customer support infrastructure</li>\n<li>Develop partnerships with leading OEMs and OEM suppliers</li>\n<li>Reduce costs by leveraging scale and internalizing certain components</li>\n<li>Continue to invest to develop and improve eFlow technology</li>\n</ol>\n\n<p><strong>2. Management, Board, and Ownership Overview</strong></p>\n\n<p>Loop’s management team is highly experienced with significant experience in related industries, including fuel cell development and automotive development (key relationships at strategically important OEMs). The company also appointed two special advisors with excellent track records leading companies: Lord John Browne (BP, Riverstone) and Lance Uggla (IHS Market, S&amp;P Global). With its recent additions, we view Loop’s management team and board as a strength.</p>\n\n<p>The current and pro forma ownership of the company is included below. Upon completion of the offering, there will be a concurrent reverse stock split, consolidating 3 shares into 1 share, which is noted below, along with the forced conversion of convertible debentures, reflected in the table below:</p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\"><strong>Beneficial Owner</strong></th>\n<th align=\"left\"><strong>Fully Diluted Current Ownership (post-consolidation)</strong></th>\n<th align=\"left\"><strong>Pro Forma Fully Diluted Ownership</strong> (assumes $115mn allotment at $16/share)</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">Cummins</td>\n<td align=\"left\">6.9mn (25.4%)</td>\n<td align=\"left\">6.9mn (17.5%)</td>\n</tr>\n<tr>\n<td align=\"left\">InPower</td>\n<td align=\"left\">1.3mn (4.9%)</td>\n<td align=\"left\">1.3mn (3.4%)</td>\n</tr>\n<tr>\n<td align=\"left\">Management &amp; Board</td>\n<td align=\"left\">2.9mn (10.6%)</td>\n<td align=\"left\">2.9mn (7.3%)</td>\n</tr>\n<tr>\n<td align=\"left\">Other</td>\n<td align=\"left\">16.2mn (59.1%)</td>\n<td align=\"left\">23.3mn (59.0%)</td>\n</tr>\n<tr>\n<td align=\"left\">Options &amp; Warrants Exercised</td>\n<td align=\"left\">0 (0%)</td>\n<td align=\"left\">2.7mn (6.7%)</td>\n</tr>\n<tr>\n<td align=\"left\">Convertible Debentures Converted</td>\n<td align=\"left\">0 (0%)</td>\n<td align=\"left\">2.4mn (6.1%)</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>Total</strong></td>\n<td align=\"left\"><strong>27.3mn (100%)</strong></td>\n<td align=\"left\"><strong>39.6mn (100%)</strong></td>\n</tr>\n</tbody></table>\n\n<p>&#x200B;</p>\n\n<p><strong>3. Market Overview / Competitive Landscape</strong></p>\n\n<p><em>Industry Overview</em></p>\n\n<p>The market for fuel cell electric vehicles is expected to grow at a 39% CAGR, from ~$2.6bn today to $50.8bn. Hydrogen fuel cells are the most widely adopted form, with significant investments from governments and corporates to support the widespread adoption of hydrogen. The hydrogen market is expected to represent ~€10 trillion+, with countries representing ~70% of the world’s GDP introducing hydrogen strategies (including US and Russia).  While this is clearly a growing, attractive and strategic market, we do note that many industry data sources provided by management are sponsored research, including the Hydrogen Council.</p>\n\n<p>We see electrification as an important global trend as countries and companies commit to decreasing emissions, with a target of net-zero by 2050.</p>\n\n<p>Loop’s competitors include Ballard Power, Beijing Sinohytec, Horizon Fuel Technologies, Hydrogenics Corporation, Hyundai, Nuvera Fuel Cells, Plug Power. Powercell, and Toyota. Despite this strong group of competitors, Loop’s technology provides significant competitive advantages, noting that competitors pose a significant risk for the company (see <em>Key Risks to Loop’s Valuation)</em></p>\n\n<p><em>Competitive Advantages (per Loop)</em></p>\n\n<ul>\n<li>Fuel Efficiency - efficiency improvements enable greater savings and higher return on investment\n\n<ul>\n<li>According to Loop, the incorporation of fuel cells into battery electric vehicles increases range by 2.5 to 3 times</li>\n<li>16% lower fuel consumption vs. competitors, generating ~$300k in fuel savings over lifetime</li>\n</ul></li>\n<li>Higher Peaking Power - provides higher payload capacity and range\n\n<ul>\n<li>&gt;50% more peak power than top competitor and &gt;90% more peak power than most competitors</li>\n</ul></li>\n<li>Durability - results in lower service and maintenance costs\n\n<ul>\n<li>Up to 10x better current density uniformity</li>\n</ul></li>\n</ul>\n\n<p><strong>4. IPO Details</strong></p>\n\n<p><em>Overview of the Offering</em></p>\n\n<p>Loop issued its preliminary prospectus on February 5, 2021, announcing plans to raise ~$100mn (+15% greenshoe option) at an ~$12-$16/share valuation. Shares are expected to price the week of February 15, 2021 and trade the week of February 22, 2021. The IPO will be led by National Bank Financial. Per filings, the net proceeds are expected to be used for R&amp;D, capital assets, and other expenses.</p>\n\n<p>Funds from the strategic financing will be used to further accelerate the company&#39;s product development activities, project deployments, and growth plans as it expands its technical leadership in medium and heavy-duty hydrogen fuel cell bus and trucking applications.</p>\n\n<p><em>Share Count</em></p>\n\n<p>Loop’s current fully-diluted share count pre-IPO is ~30.0 million shares, and pro forma for the offering will increase to ~39.6 million shares (assuming shares price at the top range of indications and the underwriters exercise their over-allotment option).</p>\n\n<p><em>Previous Equity Raises</em></p>\n\n<p>Based on Cummin’s prior investments in the company and current shares owned, Cummin’s cost basis is ~$4.32/share.</p>\n\n<p><strong>5. Financial Analysis</strong></p>\n\n<p><em>Revenue</em> was ~$350k for the three and nine months ended September 30, 2020, primarily representing the sale of demo field and test bench units. This will increase as the business continues to develop its product backlog, noting Loop’s definition of this figure represents estimated sales, including conditional agreements and MOUs. We view the development of this product backlog and execution to be a key risk, as this backlog may or may not actually materialize.</p>\n\n<p><em>Product Backlog</em> as of January 31, 2021 represents revenue of $16.4mn, up from $4.3mn as of December 31, 2020.</p>\n\n<p><em>Operating Expenses</em> - the company expects to achieve gross margins of ~30% and EBIT margins of 20% by 2030, supported by its eFlow technology, which the company expects to reduce manufacturing costs. We think that Loop’s approach to design in-house and expand vertically along the supply chain will be beneficial to achieve best-in-class margins. Given the significant size of the addressable market, economies of scale, and importance of reaching the “tipping point” for mass-market adoption, we expect significant M&amp;A in the near-term. We also expect strategic M&amp;A to be viewed favourably by the market with the understanding that despite near-term dilution, these types of transactions should be accretive to long-term value.</p>\n\n<p><em>Capital Structure -</em> pro forma for the offering, Loop’s balance sheet will substantially change, with the majority of its debt (convertible debentures) converting into shares, leaving Loop with an essentially debt-free balance sheet.</p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\"><strong>($ millions)</strong></th>\n<th align=\"left\"><strong>30-Sep-20</strong></th>\n<th align=\"left\"><strong>Adjustment</strong></th>\n<th align=\"left\"><strong>Pro Forma</strong></th>\n<th align=\"left\"><strong>Description</strong></th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">(+) LT Debt</td>\n<td align=\"left\">0.8</td>\n<td align=\"left\"></td>\n<td align=\"left\">0.8</td>\n<td align=\"left\"></td>\n</tr>\n<tr>\n<td align=\"left\">(+) Convertible Debentures</td>\n<td align=\"left\">3.6</td>\n<td align=\"left\">(3.6)</td>\n<td align=\"left\">–</td>\n<td align=\"left\">Converted</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>Total Debt</strong></td>\n<td align=\"left\"><strong>4.4</strong></td>\n<td align=\"left\"><strong>(3.6)</strong></td>\n<td align=\"left\"><strong>0.8</strong></td>\n<td align=\"left\"></td>\n</tr>\n<tr>\n<td align=\"left\">(-) Cash</td>\n<td align=\"left\">6.3</td>\n<td align=\"left\">115</td>\n<td align=\"left\">121.3</td>\n<td align=\"left\">IPO proceeds + conversion of warrants and options</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>Net Debt</strong></td>\n<td align=\"left\"><strong>(1.9)</strong></td>\n<td align=\"left\"><strong>(118.6)</strong></td>\n<td align=\"left\"><strong>(120.5)</strong></td>\n<td align=\"left\"></td>\n</tr>\n</tbody></table>\n\n<p><strong>6. Valuation / Key Risks</strong></p>\n\n<p><em>Market Valuation</em></p>\n\n<p>We expect shares to price at the top range of the $16/share IPO price, valuing the company on a fully-diluted basis at ~$513mn. At this valuation, we see tremendous long-term upside if the business is able to execute on its plan (see multiples valuation below)</p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Shares Outstanding (mn)</th>\n<th align=\"left\">39.6</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">Stock Price ($)</td>\n<td align=\"left\">$16.0</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>Market Cap ($mn)</strong></td>\n<td align=\"left\"><strong>633.6</strong></td>\n</tr>\n<tr>\n<td align=\"left\">(+) Net Debt</td>\n<td align=\"left\">(120.5)</td>\n</tr>\n<tr>\n<td align=\"left\">Enterprise Value</td>\n<td align=\"left\"><strong>513.1</strong></td>\n</tr>\n</tbody></table>\n\n<p><em>Multiples Valuation</em></p>\n\n<p>While it is difficult to value the business today, we (and Loop) expect the fuel cell market for commercial vehicles to significantly expand in the next few years, with OEMs ramping up production for commercial launch by 2026. The market for fuel cell electric vehicles is expected to grow to ~$7bn in 2026.</p>\n\n<p>Working backwards from this, if Loop grows to a ~$750mn revenue business with 20% EBIT margins (2026 EBIT of $150mn) and a 15x EBIT valuation (in line with current valuation multiples), this would imply a &gt;$2.2bn enterprise value in 2026. Discounting this back to today at a 15% cost of equity still results in &gt;$1.1bn of value, offering &gt;2x upside. We also think this 15x multiple is conservative given the growth potential of the industry and potential for Loop to become a leading market player.</p>\n\n<p>Using this same methodology, 2026E revenue of $200mn - $400mn at a 15x EBIT multiple backs into the $12-$16/share range today.</p>\n\n<p><em>Key Risks to Loop’s Valuation</em></p>\n\n<ul>\n<li>Inability to grow business development pipeline with OEMs or translate pipeline into revenue-generating contracts\n\n<ul>\n<li>The current pipeline represents $16.4mn, which includes conditional agreements and MOUs; the key focus of the business is expanding on this pipeline</li>\n</ul></li>\n<li>Existing and new competitors developing a more attractive, more widely adopted product offering\n\n<ul>\n<li>While Loop’s positioning is protected by patents, technological advantages, and Cummins backing, OEMs with substantially more capital and may enter the space and compete</li>\n</ul></li>\n<li>Technological risk of more attractive technology rendering Loop’s technology and offering obsolete\n\n<ul>\n<li>Emissions technology continues to advance and there may be a new form of technology that will reach mass-market adoption, replacing hydrogen fuel cells</li>\n</ul></li>\n<li>Large-scale manufacturing execution\n\n<ul>\n<li>While Loop’s management team has experience building out manufacturing, the company (and its competitors) have yet to execute on the large-scale manufacturing required to meet expected future demand</li>\n</ul></li>\n</ul>\n\n<p><strong>Disclosure:</strong> I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</p>\n\n<p>I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it. I have no business relationship with any company whose stock is mentioned in this article.</p>\n</div><!-- SC_ON -->",
  "score": 80,
  "permalink": "/r/investing/comments/ll74gh/loop_energy_inc_tsx_lpen_ipo_dd_the_leading/",
  "subreddit": "investing",
  "id": "ll74gh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728621155
}