{
  "author": "JustLikeTheRest123",
  "the_new_excerpt": "The more I learn the less I know. I yearn for learning, being able to attain\nwisdom is one of the most important things to me, and being able to apply it and\ncontribute to society is how society will progress and generate happiness for me\nand others.\n\nWe have progressed so far historically and yet I…",
  "original_created_utc": 1614383087,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我越学越不懂。我渴望学习，能够达到。\n智慧对我来说是最重要的事情之一，能够运用它并\n为社会做贡献，社会才会进步，才会给我带来幸福。\n和其他。\n\n我们已经取得了历史性的进步，但我... ...",
      "title": "当社会似乎并不在意的时候，你是否应该始终以改善社会为目标？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我越學越不懂。我渴望學習，能夠達到。\n智慧對我來說是最重要的事情之一，能夠運用它並\n爲社會做貢獻，社會纔會進步，纔會給我帶來幸福。\n和其他。\n\n我們已經取得了歷史性的進步，但我... ...",
      "title": "當社會似乎並不在意的時候，你是否應該始終以改善社會爲目標？"
    }
  ],
  "title": "Should you always aim to improve society when society doesn't seem to care?",
  "created_utc": 1614433449,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The more I learn the less I know. I yearn for learning, being able to attain wisdom is one of the most important things to me, and being able to apply it and contribute to society is how society will progress and generate happiness for me and others.</p>\n\n<p>We have progressed so far historically and yet I see the cycles that take place. I look around and most common people have nothing of value to give, they just want to live happily. I ask the questions that the Greeks were asking long ago. How should I live life? How do I learn from history to do the right thing and contribute to the advancement of society?</p>\n\n<p>How do I make these decisions when I look around and society doesn&#39;t impress me? Why does society constantly go in loops on a micro and macro level when it could just be linear?</p>\n\n<p>I learned of the Greeks following Pericles to their demise and blaming Socrates, the catholic church manipulating everyone using religion and turning that manipulation into power, the rich today decide if we should research leaving the planet or elect a certain candidate, commoners like myself just choose the best opportunities that present themselves and try to continue to have a good soul or be as happy as possible, just like usual.</p>\n\n<p>What is the endgame? How can you possibly know? Many good, loving, beautiful people suffer from others&#39; deceit and are rewarded with more punishment. Why do the good die young? Why do obvious scum continue to prosper?</p>\n\n<p>I grow tired. Tired of trying to find the truth, the right way to do things. There are too many perspectives in the world to choose which society/religion/economy/culture is the best. My hope fades for a potentially exciting life with an exciting career because it seems the system wants you to fail and keep gears going. I am ironically spoiled to the point where living a simple life with simple luxuries in the middle of nowhere sounds more interesting.</p>\n\n<p>Why contribute to society when society itself never seems to pay you back? Yes many things are provided through taxes and such but I mean on a deeper level. Most aspirations that I come up with are shot down by what I see every day which is usually drama or noise.</p>\n\n<p>I have to choose to pity others for they don&#39;t know better. I have to pity others so I can at least think I am doing something right living the most moral life I can. Throughout my entire life I thought of the betterment of others in every little way possible, and yet few people I know have actually given me any thought.</p>\n\n<p>Every day it seems like a Brave New World where deceitful evil prospers under facades while the ignorant take life as it is with the only hope of peace. Isolation seems like a better and better option everyday even if it would be considered wrong, at least the only person hurting you would be you.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/ltb45f/should_you_always_aim_to_improve_society_when/",
  "subreddit": "askphilosophy",
  "id": "ltb45f",
  "is_self": true,
  "media": null,
  "is_video": false
}