{
  "author": "callmeguppy",
  "original_created_utc": 1635270214,
  "title": "How does one actually go about asking for a raise?",
  "created_utc": 1635292737,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been making 25$ an hour for a few years now and it was fairly good but now I’m seeing many companies that barely paid 13$ in the past now paying 20ish. Figure I should get a pay raise at this point otherwise I’ll just take a few less bucks doing arguably easier work. I’ve never really asked for a raise before though. Do I just ask my manger for more money? Head to the office? Lmk thanks!</p>\n\n<p>Edit: thanks for all the replies guys I’m learning a lot! Most likely I’ll just have to leave this company and accept a little less for non back breaking construction work. Which I’ll gladly take!</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/qgbtu6/how_does_one_actually_go_about_asking_for_a_raise/",
  "subreddit": "TooAfraidToAsk",
  "id": "qgbtu6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve been making 25$ an hour for a few years now and it was fairly good but now\nI’m seeing many companies that barely paid 13$ in the past now paying 20ish.\nFigure I should get a pay raise at this point otherwise I’ll just take a few\nless bucks doing arguably easier work. I’ve never really asked for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はここ数年、時給25ドルを稼いでいて、それなりに良かったのですが、今は\n以前は13ドルがやっとだった会社が、今は20ドル前後の会社が多くなってきた。\nこの時点で給料を上げるべきだと思っています。\nなくても、もっと簡単な仕事をしてお金をもらうだけです。私は今まで一度も要求したことがありません。",
      "title": "実際に昇給をお願いするにはどうすればいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几年来，我一直在赚取每小时25美元，这相当不错，但现在\n我看到许多过去几乎不付13美元的公司现在付20美元左右。\n我想我应该在这个时候加薪，否则我就会接受一些\n做一些可以说是比较容易的工作，少赚点钱。我从来没有真正要求过...",
      "title": "一个人究竟如何去要求加薪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾年來，我一直在賺取每小時25美元，這相當不錯，但現在\n我看到許多過去幾乎不付13美元的公司現在付20美元左右。\n我想我應該在這個時候加薪，否則我就會接受一些\n做一些可以說是比較容易的工作，少賺點錢。我從來沒有真正要求過...",
      "title": "一個人究竟如何去要求加薪？"
    }
  ]
}