{
  "author": "SaintShrink",
  "original_created_utc": 1643471371,
  "title": "Is there a reason American football never took off anywhere besides the United States?",
  "created_utc": 1643492756,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Both baseball and basketball, the two other &amp;quot;American&amp;quot; sports, seem to have at least a decent sized foothold outside of the US, with several notable leagues and players.&lt;/p&gt;\n\n&lt;p&gt;But American football seems to be pretty stagnant, despite the fact that I see no particular reason why a sport would be confined to one area. Are there fewer efforts to spread it? Are there cultural differences that might prohibit it? Would it just be confusing, name wise? Is a better question &amp;quot;why did baseball and basketball succeed in spreading?&amp;quot;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/sfkt4d/is_there_a_reason_american_football_never_took/",
  "subreddit": "AskHistorians",
  "id": "sfkt4d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Both baseball and basketball, the two other \"American\" sports, seem to have at\nleast a decent sized foothold outside of the US, with several notable leagues\nand players.\n\nBut American football seems to be pretty stagnant, despite the fact that I see\nno particular reason why a sport would be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "野球もバスケットボールも、「アメリカン」なスポーツであることは間違いないようです。\nアメリカ国外にも、少なくともそれなりの足がかりがあり、いくつかの有名なリーグがあります。\nと選手。\n\nしかし、アメリカンフットボールは、かなり停滞しているようです。\n特に理由もなく、スポーツは...",
      "title": "アメリカンフットボールがアメリカ以外の国で流行らなかったのは、何か理由があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "棒球和篮球这两项 \"美国 \"运动似乎至少在美国以外地区有相当大的立足点。\n棒球和篮球这两项 \"美国 \"运动似乎在美国以外至少有一个相当大的立足点，有几个著名的联盟\n和球员。\n\n但美式足球似乎相当停滞不前，尽管我看到的事实是\n但美式橄榄球似乎相当停滞不前，尽管我看不出有什么特别的理由，为什么一项运动会...",
      "title": "除了美国之外，美式足球从未在其他地方兴起，这有什么原因吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "棒球和籃球這兩項 \"美國 \"運動似乎至少在美國以外地區有相當大的立足點。\n棒球和籃球這兩項 \"美國 \"運動似乎在美國以外至少有一個相當大的立足點，有幾個著名的聯盟\n和球員。\n\n但美式足球似乎相當停滯不前，儘管我看到的事實是\n但美式橄欖球似乎相當停滯不前，儘管我看不出有什麼特別的理由，爲什麼一項運動會...",
      "title": "除了美國之外，美式足球從未在其他地方興起，這有什麼原因嗎？"
    }
  ]
}