{
  "author": "AskScienceModerator",
  "original_created_utc": 1629889229,
  "title": "AskScience AMA Series: Hi, Reddit! I'm a critical care-related researcher, professor of medicine and doctor in the ICU. AMA about wellness, burnout and PTSD in healthcare professionals!",
  "created_utc": 1629898939,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello, Redditors! My name is Marc Moss, and for the last 20 years, I have been studying the effects of stress on critical care nurses and other healthcare professionals.</p>\n\n<p>I&#39;m also a professor of medicine at the University of Colorado Anschutz Medical Campus, Head of the Division of Pulmonary Sciences and Critical Care Medicine at the University of Colorado School of Medicine and work as a critical care doctor.</p>\n\n<p>Earlier this year, my colleague Dr. Meredith Mealer and I were honored to receive the American Association of Critical Care Nurses (AACN) Pioneering Spirit Award for our work studying the effects of stress on nurses and creating interventions to increase resilience among healthcare workers.</p>\n\n<p>Among these interventions includes work at the <a href=\"https://medschool.cuanschutz.edu/coral/our-team\">Colorado Resiliency Arts Lab</a>, a research consortium supported by the National Endowment for the Arts. We are striving to create a vibrant, collaborative creative arts therapy community that is committed to enhancing healthcare professional well-being and alleviating psychological stress in the workplace and\nbeyond.</p>\n\n<p>While I&#39;ve been studying healthcare-related burnout for many years, this last year and a half during the COVID-19 pandemic has been a war zone for our healthcare professionals. I have never been prouder of all of my colleagues and the amazing hospital employees that we work with on a daily basis. They are working long hours in difficult conditions, putting on and taking off protective equipment, while trying not to get sick themselves, or infect their families and children. You would be honored to witness their extraordinary and relentless efforts to care for our sickest patients. However the relentless stress is taking its toll on all of us. I am afraid that the next wave will &quot;break our souls&quot;.</p>\n\n<p>In addition to critical care-related research, my research interests include identifying new treatment modalities for patients with the Acute Respiratory Distress Syndrome (ARDS) and exploring the diagnosis and treatment of neuromuscular dysfunction in critically ill patients who require mechanical ventilation.</p>\n\n<p>Additional Background:</p>\n\n<ul>\n<li>Head of the Division of Pulmonary Sciences and Critical Care Medicine at the CU Anschutz School of Medicine</li>\n<li>Program Director for the Education, Training, and Career Development Core of the Colorado Clinical Translational Sciences Institute (CCTSI) from 2008-2016</li>\n<li>President of the American Thoracic Society from 2017-2018</li>\n</ul>\n\n<p>Research Publications:</p>\n\n<ul>\n<li><a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6207112/\">The Cost of Caring: Emotion, Burnout and Psychological Distress in Critical Care Clinicians</a></li>\n<li><a href=\"https://www.atsjournals.org/doi/full/10.1164/rccm.201604-0708ST\">A Critical Care Societies Collaborative Statement: Burnout Syndrome in Critical Care Health-care Professionals. A Call for Action.</a></li>\n</ul>\n\n<p>Additional Information About My Work:</p>\n\n<ul>\n<li><a href=\"https://news.cuanschutz.edu/news-stories/project-aims-to-help-prevent-burnout-among-healthcare-professionals\">Physician Burnout? It&#39;s an epidemic</a> <em>March 5, 2019</em></li>\n<li><a href=\"https://www.pbs.org/newshour/arts/burnout-is-rampant-among-doctors-and-nurses-can-the-arts-help\">Burnout is rampant among doctors and nurses. Can the arts help?</a> <em>November 5, 2019</em></li>\n<li><a href=\"https://news.cuanschutz.edu/medicine/research-on-burnout-among-nurses-receives-aacn-award\">Research on Burnout Among Nurses Receives AACN Award</a> <em>April 4, 2021</em></li>\n<li><a href=\"https://www.denverpost.com/2021/07/03/colorado-health-care-turnover-covid/\">As pandemic wanes, will burnout fuel exodus of Colorado health care workers?</a> <em>July 3, 2021</em></li>\n</ul>\n\n<p>Username: <a href=\"/u/drmarcmoss\">/u/drmarcmoss</a></p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/askscience/comments/pb8wjv/askscience_ama_series_hi_reddit_im_a_critical/",
  "subreddit": "askscience",
  "id": "pb8wjv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello, Redditors! My name is Marc Moss, and for the last 20 years, I have been\nstudying the effects of stress on critical care nurses and other healthcare\nprofessionals.\n\nI'm also a professor of medicine at the University of Colorado Anschutz Medical\nCampus, Head of the Division of Pulmonary…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、Redditors! 私の名前はMarc Mossです。この20年間、私は\nストレスがクリティカルケアナースやその他の医療従事者に与える影響を研究しています。\n私はこの20年間、クリティカルケア看護師をはじめとする医療従事者のストレスの影響を研究しています。\n\nまた、私はコロラド大学アンシュッツ・メディカル・キャンパスの医学部教授で、呼吸器系の部門長を務めています。\nまた、私はコロラド大学アンシュッツ・メディカル・キャンパスの医学部教授であり、呼吸器系の部門長でもあります...",
      "title": "AskScience AMAシリーズ。Redditの皆さん、こんにちは。私は、クリティカルケア関連の研究者であり、医学の教授であり、ICUの医師でもあります。医療従事者のウェルネス、燃え尽き症候群、PTSDについてのAMA!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，Redditors! 我的名字是马克-莫斯，在过去的20年里，我一直在研究\n研究压力对重症监护护士和其他医护人员的影响。\n专业人员的影响。\n\n我也是科罗拉多大学安舒茨医学院的医学教授。\n我也是科罗拉多大学安舒茨医学校区的医学教授，肺病科的负责人。",
      "title": "AskScience AMA系列。嗨，Reddit! 我是一名重症监护相关的研究人员、医学教授和ICU的医生。关于医护人员的健康、倦怠和创伤后应激障碍的AMA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，Redditors! 我的名字是馬克-莫斯，在過去的20年裏，我一直在研究\n研究壓力對重症監護護士和其他醫護人員的影響。\n專業人員的影響。\n\n我也是科羅拉多大學安舒茨醫學院的醫學教授。\n我也是科羅拉多大學安舒茨醫學校區的醫學教授，肺病科的負責人。",
      "title": "AskScience AMA系列。嗨，Reddit! 我是一名重症監護相關的研究人員、醫學教授和ICU的醫生。關於醫護人員的健康、倦怠和創傷後應激障礙的AMA!"
    }
  ]
}