{
  "author": "Coldry",
  "original_created_utc": 1627440655,
  "title": "Top 12 Satoshi Nakamoto Quotes",
  "created_utc": 1627497061,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bitcoin’s creator(s), Satoshi Nakamoto was very active within the community in the early days of Bitcoin, making a number of impactful statements that still ring true today.\n Before he disappeared in 2011, he shared his wisdom and knowledge on Bitcoin in the BitcoinTalkForum that can still be found today. \n Moreover, he has had several private email conversations with members of the Bitcoin community.</p>\n\n<p>To gain insight into the mind of Bitcoin’s creator(s), here is a list of the most popular Satoshi Nakamoto quotes. </p>\n\n<p>1.<em>&quot;The Times 03/Jan/2009 Chancellor on brink of second bailout for banks.&quot;</em></p>\n\n<p>This quote was written into the genesis block of the Bitcoin blockchain and has remained there since the cryptocurrency was created. Bitcoin was established just after the Great Financial Crisis in 2008 to give people control over their own money.</p>\n\n<p>2.<em>If you don’t believe it or don’t get it, I don’t have the time to try to convince you, sorry.</em></p>\n\n<p>Nakamoto was busy and preferred spending his time writing code that would improve the Bitcoin network. The above quote was in response to Bitshares’ founder who had made a statement at the time that there was a need for peer banks to allow for fast transactions.</p>\n\n<p>3.<em>The root problem with conventional currency is all the trust that’s required to make it work. The central bank must be trusted not to debase the currency, but the history of fiat currencies is full of breaches of that trust. Banks must be trusted to hold our money and transfer it electronically, but they lend it out in waves of credit bubbles with barely a fraction in reserve. We have to trust them with our privacy, trust them not to let identity thieves drain our accounts. Their massive overhead costs make micropayments impossible.</em></p>\n\n<p>Satoshi didn’t trust central banks, and that was one of his main motivations towards creating Bitcoin – a peer-to-peer digital currency that was independent of any governing authorities.</p>\n\n<p>4.<em>It would have been nice to get this attention in any other context. WikiLeaks has kicked the hornet’s nest, and the swarm is headed towards us.</em></p>\n\n<p>As an active member of the Bitcointalk community, the above post was the second last post that Satoshi shared before disappearing. To date, Satoshi’s whereabouts remain unknown.</p>\n\n<p>5.<em>Lost coins only make everyone else’s coins worth slightly more. Think of it as a donation to everyone.</em></p>\n\n<p>There can only ever be a maximum of 21 million bitcoin in supply. It is estimated that about 4 million BTC are lost forever, which makes the cryptocurrency even more scarce. As a result, the remaining coins that are in circulation are even more valuable.</p>\n\n<p>6.<em>In a few decades when the reward gets too small, the transaction fee will become the main compensation for [mining] nodes. I’m sure that in 20 years there will either be very large transaction volume or no volume.</em></p>\n\n<p>Satoshi was very conscious of the fact that bitcoin would either disappear or become a phenomenon. There was no in-between. </p>\n\n<p>7.<em>A lot of people automatically dismiss e-currency as a lost cause because of all the companies that failed since the 1990’s. I hope it’s obvious it was only the centrally controlled nature of those systems that doomed them. I think this is the first time we’re trying a decentralized, non-trust-based system.</em></p>\n\n<p>Satoshi believed that Bitcoin was less likely to fail compared to its predecessors. There had been previous attempts to create digital money. Bitcoin wasn’t the first. However, he believed that the projects before Bitcoin failed because of centralization and trust-based nature.</p>\n\n<p>8.<em>Bitcoin would be convenient for people who don’t have a credit card or don’t want to use the cards they have, either don’t want the spouse to see it on the bill or don’t trust giving their number to “porn guys”, or afraid of recurring billing.</em></p>\n\n<p>The above quote was made to explain why bitcoin might become the go-to payment method for people who don’t want their identities associated with certain purchases. And although bitcoin may not be entirely anonymous, it provides more privacy than credit cards.</p>\n\n<p>9.<em>The possibility to be anonymous or pseudonymous relies on you not revealing any identifying information about yourself in connection with the bitcoin addresses you use. If you post your bitcoin address on the web, then you’re associating that address and any transactions with it with the name you posted under. If you posted under a handle that you haven’t associated with your real identity, then you’re still pseudonymous.</em></p>\n\n<p>While Bitcoin is not fully anonymous, Satoshi explained how Bitcoin’s pseudonymous nature could help prevent people’s identities from being known.</p>\n\n<p>10.<em>As computers get faster and the total computing power applied to creating bitcoins increases, the difficulty increases proportionally to keep the total new production constant. Thus, it is known in advance how many new bitcoins will be created every year in the future. Coins have to get initially distributed somehow, and a constant rate seems like the best formula.</em></p>\n\n<p>Satoshi believed that an effective method to manage Bitcoin’s coin supply would be at a constant rate with a difficulty adjustments.</p>\n\n<p>11.<em>Sigh… why delete a wallet instead of moving it aside and keeping the old copy just in case? You should never delete a wallet.</em></p>\n\n<p>This was Satoshi’s response to a user who had deleted his wallet, leading to the loss of all his bitcoin.</p>\n\n<p>12.<em>When someone tries to buy all the world’s supply of a scarce asset, the more they buy the higher the price goes. At some point, it gets too expensive for them to buy any more. It’s great for the people who owned it beforehand because they get to sell it to the corner at crazy high prices.</em></p>\n\n<p>This was Satoshi’s response to a concerned community member who had asked if a malicious individual could opt to buy all the bitcoin in order to make the network useless.</p>\n\n<p>Share your own if you find or know any more of Satoshi quotes. It&#39;s always refreshing to see Satoshis thoughts about BTC and cryptocurrencies in the early days.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/ot18mc/top_12_satoshi_nakamoto_quotes/",
  "subreddit": "CryptoCurrency",
  "id": "ot18mc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Bitcoin’s creator(s), Satoshi Nakamoto was very active within the community in\nthe early days of Bitcoin, making a number of impactful statements that still\nring true today. Before he disappeared in 2011, he shared his wisdom and\nknowledge on Bitcoin in the BitcoinTalkForum that can still be found…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインの生みの親であるサトシ・ナカモトは、ビットコインの黎明期にコミュニティの中で活発に活動していました。\nビットコインの黎明期にコミュニティで活躍し、今でも衝撃的な発言をいくつもしています。\n今でもその言葉は真実味を帯びています。2011年に失踪する前には、ビットコインに関する知恵と知識を\nBitcoinTalkForumでビットコインに関する知識を共有していました。",
      "title": "サトシ・ナカモトの名言トップ12"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比特币的创造者，中本聪在比特币早期的社区中非常活跃。\n在比特币的早期，中本聪在社区中非常活跃，他发表了许多有影响力的声明，这些声明至今仍然是真实的。\n今天仍然是真实的。在他于2011年消失之前，他在比特币网站上分享了他的智慧和知识。\n他在BitcoinTalkForum上分享了他对比特币的智慧和知识，现在仍然可以找到...",
      "title": "12大中本聪语录"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣的創造者，中本聰在比特幣早期的社區中非常活躍。\n在比特幣的早期，中本聰在社區中非常活躍，他發表了許多有影響力的聲明，這些聲明至今仍然是真實的。\n今天仍然是真實的。在他於2011年消失之前，他在比特幣網站上分享了他的智慧和知識。\n他在BitcoinTalkForum上分享了他對比特幣的智慧和知識，現在仍然可以找到...",
      "title": "12大中本聰語錄"
    }
  ]
}