{
  "author": "dlcrx",
  "original_created_utc": 1630364239,
  "title": "What kind of support garments (if any) did women wear in the Ottoman Empire and further East?",
  "created_utc": 1630402411,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am pretty familiar with the history of support garments in Western Europe - stays/corsets are the quintessential example, the medieval kirtle would have provided bust support once sewing techniques developed, and I&#39;ve seen evidence for a &#39;proto-bra&#39; in various contexts. I have been toying with the idea of investing my own wardrobe with the practicality and comfort of historical clothing, and my first port of call was to refer to my traditional Greek (mine is specifically Cretan) dress, which I understand shares some elements with the general women&#39;s dress of the Ottoman Empire due to occupation/close contact. One thing I&#39;m struggling to understand; how did these women support their breasts?  As far as I can tell, the standard outfit of an Ottoman woman from, say, 1500-1700, for the sake of the question, consisted of trousers/salvar, a chemise/gomlek, and a jacket/zibin - I can&#39;t find any discussion of any other garments with the purpose of support.</p>\n\n<p>My traditional Cretan outfit has a woolen jacket (yialeko) that fastens tight under the bust and can function as support, but I think the Cretan example has more Western influence from Venetian occupation. Outfits in other parts of Greece, however, have a long jacket or vest that is more comparable to the Ottoman zibin, but it seems that the Greek versions fasten tighter around the bust and waist, where the Ottoman one fastened from the neck to the chest, hanging over the bust. Did the zibin ever function as support, or did they just - for want of a better phrase - let it hang? Though bust support is not as necessary for every woman as we may view it today, there must have been at least a few people who couldn&#39;t forgo a bit of extra help.</p>\n\n<p>I also noticed that earlier illustrations show the zibin fastened high, whereas later photographs and paintings (albeit Orientalist and a little bit fetishy) tend to show an open chest on the jacket or chemise, with a sash belt at the waist, which influenced European Turquerie dress. Did the styles develop over time, maybe even in a bit of a give-and-take with Europe in regards to fashionable silhouettes and bust support, or have I just interpreted it wrong?</p>\n\n<p>I could be projecting - I know there are some cultures that don&#39;t seem to have upper body covering at all, so maybe I&#39;m overestimating the importance of bust support entirely. Would it be naive to go with a &#39;people were smaller back then&#39; approach to explain the lack of necessity?</p>\n\n<p>At the risk of being too broad, if anyone knows about dress history in India, China, Korea, or other Asian countries and can shed some light similar topics in those areas, by all means go ahead! I had similar confusion with those, largely because I didn&#39;t know where to start. </p>\n\n<p>Also, if anyone is aware of artists that I could look at for more accurate representation, or any primary sources/research tools that are relevant feel free to drop them here! Most reliable historical fashion resources that I&#39;m aware of focus mainly on western clothing and I&#39;ve found it difficult to research for much else.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/petaxn/what_kind_of_support_garments_if_any_did_women/",
  "subreddit": "AskHistorians",
  "id": "petaxn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am pretty familiar with the history of support garments in Western Europe -\nstays/corsets are the quintessential example, the medieval kirtle would have\nprovided bust support once sewing techniques developed, and I've seen evidence\nfor a 'proto-bra' in various contexts. I have been toying with the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は西欧のサポートウェアの歴史についてはよく知っています。\nステイやコルセットはその典型的な例ですし、中世のカートルは縫製技術が発達すればバストをサポートしたでしょう。\n中世のカートルは、縫製技術が発達すればバストをサポートしていたでしょう。\n縫製技術が発達すれば、中世のカートルはバストを支えていたでしょうし、様々な文脈で「ブラの原型」の証拠を見たことがあります。私が考えていたのは...",
      "title": "オスマン帝国をはじめとする東欧では、女性はどのようなサポートウェアを身につけていたのでしょうか（もしあれば）。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对西欧支撑性服装的历史相当熟悉--留置物/胸衣是典型的例子。\n滞留/胸衣是最典型的例子，中世纪的长裙会在缝纫技术成熟后提供胸部支撑。\n一旦缝制技术发展起来，中世纪的裙装就会提供胸部支撑，我还看到了在各种情况下 \"原初胸罩 \"的证据。\n我也看到了在各种情况下 \"原初胸罩 \"的证据。我一直在考虑...",
      "title": "在奥斯曼帝国和更远的东方，妇女穿什么样的支撑服装（如果有的话）？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對西歐支撐性服裝的歷史相當熟悉--留置物/胸衣是典型的例子。\n滯留/胸衣是最典型的例子，中世紀的長裙會在縫紉技術成熟後提供胸部支撐。\n一旦縫製技術發展起來，中世紀的裙裝就會提供胸部支撐，我還看到了在各種情況下 \"原初胸罩 \"的證據。\n我也看到了在各種情況下 \"原初胸罩 \"的證據。我一直在考慮...",
      "title": "在奧斯曼帝國和更遠的東方，婦女穿什麼樣的支撐服裝（如果有的話）？"
    }
  ]
}