{
  "author": "Set1Less",
  "original_created_utc": 1649673522,
  "title": "BTC Maxi clown Max Keiser yet again shredding USD notes in Bitcoin Conference 2022 is a disgusting joke. These clowns are an embarrassment to the entire crypto market. Satoshi and Hal Finney would be rolling in their grave seeing the charlatans in this space today.",
  "created_utc": 1649681828,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Max Keiser has repeated his cringe fest from 2021 where he shreds USD notes for his audience to make his point that fiat is worthless. Imo if you have to come to this level to make your point, you have already lost. This does nothing but fuel more hate, anger, resentment towards crypto bros, especially when so many are working towards making crypto inclusive to all irrespective of their financial conditions, yet prime spots are being given to clowns who shred USD bills. 13% of Americans live below the poverty line, 74% of Africans live below the poverty line. Showing them notes being shredded is a great way to win them over.. NOT!&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/1t7kd8mbovs81.jpg?width=1170&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=279900ec3d2cccb45f83c9a102f63bdb6d442e4d\"&gt;Max Keiser is the perfect example to show money can never buy class. &lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Not only is it a shitty way to make any argument, it is also illegal - Section 33 of US Criminal Code prohibits defacement of currency notes with jail term for offenders. Exhibitions like Bitcoin Conference are giving airtime and promoting clowns who act in utter defiance of established laws. Im sure this is gonna go down well with all those who already accuse crypto of enabling criminals. &lt;/p&gt;\n\n&lt;p&gt;Him from 2020 is the cringiest video ever relating to crypto: &lt;a href=\"https://www.youtube.com/watch?v=3Bh3ObPjcFE\"&gt;https://www.youtube.com/watch?v=3Bh3ObPjcFE&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;There is just no reason these ass clowns should be given time or credibility over people like Andreas Antonopolous who actually work towards educating people on crypto.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 621,
  "permalink": "/r/CryptoCurrency/comments/u14qd0/btc_maxi_clown_max_keiser_yet_again_shredding_usd/",
  "subreddit": "CryptoCurrency",
  "id": "u14qd0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Max Keiser has repeated his cringe fest from 2021 where he shreds USD notes for\nhis audience to make his point that fiat is worthless. Imo if you have to come\nto this level to make your point, you have already lost. This does nothing but\nfuel more hate, anger, resentment towards crypto bros,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "マックス・カイザーは、2021年にUSDノートをズタズタに切り刻むという苦難の祭典を繰り返した。\nを聴き、不換紙幣は無価値であることを主張する。もし、あなたが\n自分の主張を通すためにここまでやるのは、すでに負けている。これでは\n暗号兄弟への憎しみ、怒り、恨みをさらに募らせる...",
      "title": "BTC Maxiのピエロ、Max KeiserがまたもやBitcoin Conference 2022でUSD紙幣をシュレッダーにかけているのは、最低のジョークだ。これらのピエロは、暗号市場全体にとって恥ずかしいことです。サトシとハル・フィニーは、今日のこの空間のチャラ男たちを見て、墓の中で転がっていることでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "马克斯-凯泽重复了他在2021年的崩溃大戏，在那里他撕碎了美元的钞票，以换取\n他为观众撕碎美元纸币，以表明他的观点，即法币是没有价值的。我认为，如果你非要到\n来说明你的观点，你就已经输了。这只会\n助长更多的仇恨、愤怒和对加密货币兄弟的怨恨，...",
      "title": "BTC的小丑Max Keiser又一次在2022年比特币大会上撕碎美元纸币，这是一个令人恶心的笑话。这些小丑是整个加密货币市场的耻辱。看到今天这个领域的骗子，中本聪和哈尔-芬尼会在他们的坟墓里打滚。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "馬克斯-凱澤重複了他在2021年的崩潰大戲，在那裏他撕碎了美元的鈔票，以換取\n他爲觀衆撕碎美元紙幣，以表明他的觀點，即法幣是沒有價值的。我認爲，如果你非要到\n來說明你的觀點，你就已經輸了。這隻會\n助長更多的仇恨、憤怒和對加密貨幣兄弟的怨恨，...",
      "title": "BTC的小丑Max Keiser又一次在2022年比特幣大會上撕碎美元紙幣，這是一個令人噁心的笑話。這些小丑是整個加密貨幣市場的恥辱。看到今天這個領域的騙子，中本聰和哈爾-芬尼會在他們的墳墓裏打滾。"
    }
  ]
}