{
  "author": "Set1Less",
  "original_created_utc": 1649673522,
  "title": "BTC Maxi clown Max Keiser yet again shredding USD notes in Bitcoin Conference 2022 is a disgusting joke. These clowns are an embarrassment to the entire crypto market. Satoshi and Hal Finney would be rolling in their grave seeing the charlatans in this space today.",
  "created_utc": 1649681828,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Max Keiser has repeated his cringe fest from 2021 where he shreds USD notes for his audience to make his point that fiat is worthless. Imo if you have to come to this level to make your point, you have already lost. This does nothing but fuel more hate, anger, resentment towards crypto bros, especially when so many are working towards making crypto inclusive to all irrespective of their financial conditions, yet prime spots are being given to clowns who shred USD bills. 13% of Americans live below the poverty line, 74% of Africans live below the poverty line. Showing them notes being shredded is a great way to win them over.. NOT!&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/1t7kd8mbovs81.jpg?width=1170&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=279900ec3d2cccb45f83c9a102f63bdb6d442e4d\"&gt;Max Keiser is the perfect example to show money can never buy class. &lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Not only is it a shitty way to make any argument, it is also illegal - Section 33 of US Criminal Code prohibits defacement of currency notes with jail term for offenders. Exhibitions like Bitcoin Conference are giving airtime and promoting clowns who act in utter defiance of established laws. Im sure this is gonna go down well with all those who already accuse crypto of enabling criminals. &lt;/p&gt;\n\n&lt;p&gt;Him from 2020 is the cringiest video ever relating to crypto: &lt;a href=\"https://www.youtube.com/watch?v=3Bh3ObPjcFE\"&gt;https://www.youtube.com/watch?v=3Bh3ObPjcFE&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;There is just no reason these ass clowns should be given time or credibility over people like Andreas Antonopolous who actually work towards educating people on crypto.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 621,
  "permalink": "/r/CryptoCurrency/comments/u14qd0/btc_maxi_clown_max_keiser_yet_again_shredding_usd/",
  "subreddit": "CryptoCurrency",
  "id": "u14qd0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Max Keiser has repeated his cringe fest from 2021 where he shreds USD notes for\nhis audience to make his point that fiat is worthless. Imo if you have to come\nto this level to make your point, you have already lost. This does nothing but\nfuel more hate, anger, resentment towards crypto bros,…"
}