{
  "author": "NFTfuture1",
  "the_new_excerpt": "So the Bitcoin community has reached consensus regarding the details and rollout\nof the Taproot upgrade, which is quite a big deal. The upgrade will offer more\nfunctionality for smart contracts, improve the infrastructure for privacy (not\nprivacy itself, for now), reduce the amount of data to be…",
  "original_created_utc": 1619963244,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコイン・コミュニティは、Taprootのアップグレードの詳細と展開について合意に達しました。\nタプロートのアップグレードの詳細と展開について、ビットコイン・コミュニティが合意に達したことは、非常に大きな意味を持ちます。このアップグレードでは、スマートコントラクトの機能が強化され\nスマートコントラクトの機能が強化され、プライバシーのインフラが改善され（今のところプライバシーそのものではなく\nプライバシーのためのインフラを改善し（今のところ、プライバシーそのものではありません）、データ量を減らして...",
      "title": "2017年以来最大のBTCのアップグレードが3ヶ月後に稼動します"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，比特币社区已经就Taproot升级的细节和推广达成了共识\nTaproot的升级，这是一个相当大的问题。这次升级将为智能合约提供更多\n智能合约的功能，改善隐私的基础设施（暂时不是\n目前，隐私本身），减少数据量。",
      "title": "2017年以来最大的BTC升级将在三个月后上线"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，比特幣社區已經就Taproot升級的細節和推廣達成了共識\nTaproot的升級，這是一個相當大的問題。這次升級將爲智能合約提供更多\n智能合約的功能，改善隱私的基礎設施（暫時不是\n目前，隱私本身），減少數據量。",
      "title": "2017年以來最大的BTC升級將在三個月後上線"
    }
  ],
  "title": "The biggest BTC upgrade since 2017 is going live in three months",
  "created_utc": 1619974080,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So the Bitcoin community has reached consensus regarding the details and rollout of the Taproot upgrade, which is quite a big deal. The upgrade will offer more functionality for smart contracts, improve the infrastructure for privacy (not privacy itself, for now), reduce the amount of data to be transferred and stored on the blockchain, enable the throughput of more transactions per block and lower transaction fees.</p>\n\n<p>However, the upgrade itself is probably most significant because of the fact that it will be implemented at all and the community has reached consensus. This is the first time after the SegWit ordeal that consensus has been reached on a decision as significant as this and likely signifies that the implementation of upgrades in the future will be much easier and faster, as the developers are finding new ways of compromising on key decisions, such as the Coin Toss that was used to decide a debate on the Taproot activation timeline.</p>\n\n<p>Miners have already signaled their intentions to adopt the upgrade, which means that it will likely go live in the next couple of months.</p>\n</div><!-- SC_ON -->",
  "score": 881,
  "permalink": "/r/CryptoCurrency/comments/n36px0/the_biggest_btc_upgrade_since_2017_is_going_live/",
  "subreddit": "CryptoCurrency",
  "id": "n36px0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380962694
}