{
  "author": "Sodarn-Hinsane",
  "original_created_utc": 1652973255,
  "title": "Why did some mid-20th century English writers intentionally favour \"Anglo-Saxon\" vocabulary?",
  "created_utc": 1653043754,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A number of prominent English writers in the mid-20th century, such as George Orwell and Ernest Hemingway, were quite notorious for favouring &amp;quot;Anglo-Saxon&amp;quot; words for their perceived simplicity, and against &amp;quot;Latinate&amp;quot; and/or foreign/borrowed words for being too complicated and elitist. For example, Orwell famously denounced Latinate words as being the domain of bad writers and totalitarians in &lt;a href=\"https://www.orwellfoundation.com/the-orwell-foundation/orwell/essays-and-other-works/politics-and-the-english-language/\"&gt;&amp;quot;Politics and the English Language&amp;quot;&lt;/a&gt;; Hemingway mocked William Faulkner for using big words; Anglo-Saxon philology played a big role in Tolkien&amp;#39;s conlang in Lord of the Rings, etc.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m asking less about the aesthetic or literary merits of using words derived from the Anglo-Saxon language, and more about the cultural context that made Anglo-Saxon vs Latinate/foreign etymology such an important aesthetic, cultural, and/or political sticking point for these authors, at this particular juncture. Why did the mid-20th century see such a backlash against &amp;quot;foreign&amp;quot; vocabulary, and in favour of a kind of etymological &amp;quot;nativism&amp;quot;, by so many prominent canonical writers? How did this &amp;quot;nativist&amp;quot; etymological prescriptivism influence the development of English letters, and these authors&amp;#39; place in the canon therein?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/ut5myv/why_did_some_mid20th_century_english_writers/",
  "subreddit": "AskHistorians",
  "id": "ut5myv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A number of prominent English writers in the mid-20th century, such as George\nOrwell and Ernest Hemingway, were quite notorious for favouring \"Anglo-Saxon\"\nwords for their perceived simplicity, and against \"Latinate\" and/or\nforeign/borrowed words for being too complicated and elitist. For…"
}