{
  "author": "Sodarn-Hinsane",
  "original_created_utc": 1652973255,
  "title": "Why did some mid-20th century English writers intentionally favour \"Anglo-Saxon\" vocabulary?",
  "created_utc": 1653043754,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A number of prominent English writers in the mid-20th century, such as George Orwell and Ernest Hemingway, were quite notorious for favouring &amp;quot;Anglo-Saxon&amp;quot; words for their perceived simplicity, and against &amp;quot;Latinate&amp;quot; and/or foreign/borrowed words for being too complicated and elitist. For example, Orwell famously denounced Latinate words as being the domain of bad writers and totalitarians in &lt;a href=\"https://www.orwellfoundation.com/the-orwell-foundation/orwell/essays-and-other-works/politics-and-the-english-language/\"&gt;&amp;quot;Politics and the English Language&amp;quot;&lt;/a&gt;; Hemingway mocked William Faulkner for using big words; Anglo-Saxon philology played a big role in Tolkien&amp;#39;s conlang in Lord of the Rings, etc.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m asking less about the aesthetic or literary merits of using words derived from the Anglo-Saxon language, and more about the cultural context that made Anglo-Saxon vs Latinate/foreign etymology such an important aesthetic, cultural, and/or political sticking point for these authors, at this particular juncture. Why did the mid-20th century see such a backlash against &amp;quot;foreign&amp;quot; vocabulary, and in favour of a kind of etymological &amp;quot;nativism&amp;quot;, by so many prominent canonical writers? How did this &amp;quot;nativist&amp;quot; etymological prescriptivism influence the development of English letters, and these authors&amp;#39; place in the canon therein?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/ut5myv/why_did_some_mid20th_century_english_writers/",
  "subreddit": "AskHistorians",
  "id": "ut5myv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A number of prominent English writers in the mid-20th century, such as George\nOrwell and Ernest Hemingway, were quite notorious for favouring \"Anglo-Saxon\"\nwords for their perceived simplicity, and against \"Latinate\" and/or\nforeign/borrowed words for being too complicated and elitist. For…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "20世紀半ばのイギリスの著名な作家、例えばジョージ・オーウェルやアーネスト・ヘミングウェイなどは、「アベンジャーズ」を好んだことで非常に有名です。\nオーウェルやアーネスト・ヘミングウェイなど、20世紀半ばの著名な英国人作家の多くは、単純と思われる「アングロサクソン」語を好むことで非常に悪名高い存在でした。\nを好んで使い、「ラテン語的」あるいは「外国語的」あるいは「借用語的」な言葉は、単純すぎるとして\n外国語や借用語は複雑でエリート主義的であるとして反対した。例えば...",
      "title": "20世紀半ばの英文学者の中には、なぜ意図的に「アングロサクソン系」の語彙を好む人がいたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "20世纪中期，一些著名的英国作家，如乔治\n奥威尔和欧内斯特-海明威，因为偏爱 \"盎格鲁-撒克逊 \"词汇而臭名昭著。\n而反对 \"拉丁语系 \"和/或外国/借来的词汇，因为它们太过简单。\n和/或外国/借来的词，因为它们太复杂和精英主义。对于...",
      "title": "为什么20世纪中期的一些英语作家有意偏爱 \"盎格鲁-撒克逊 \"词汇？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "20世紀中期，一些著名的英國作家，如喬治\n奧威爾和歐內斯特-海明威，因爲偏愛 \"盎格魯-撒克遜 \"詞彙而臭名昭著。\n而反對 \"拉丁語系 \"和/或外國/借來的詞彙，因爲它們太過簡單。\n和/或外國/借來的詞，因爲它們太複雜和精英主義。對於...",
      "title": "爲什麼20世紀中期的一些英語作家有意偏愛 \"盎格魯-撒克遜 \"詞彙？"
    }
  ]
}