{
  "author": "GhostDick__",
  "original_created_utc": 1634471776,
  "title": "Why do lots of people believe in god but often find the thought of ghosts or demonic hauntings ridiculous?",
  "created_utc": 1634503613,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m not sure if ghosts are included in the bible or church, but demons are, so whats up with this view where these things have to be questioned like crazy but with angels and beliefs in god they’ll try linking that to anything? I don’t hate religion and this isn’t an attack, Im just genuinely curious because I see this a lot.</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/NoStupidQuestions/comments/q9xa3f/why_do_lots_of_people_believe_in_god_but_often/",
  "subreddit": "NoStupidQuestions",
  "id": "q9xa3f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m not sure if ghosts are included in the bible or church, but demons are, so\nwhats up with this view where these things have to be questioned like crazy but\nwith angels and beliefs in god they’ll try linking that to anything? I don’t\nhate religion and this isn’t an attack, Im just genuinely…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "幽霊が聖書や教会に含まれているかどうかはわかりませんが、悪魔は含まれていますよね。\n狂ったように疑わなければならないのに、天使や神への信仰は何でも結びつけようとするこの考え方はどうなのでしょうか？\n天使や神への信仰があれば、それを何かに結びつけようとするでしょう？私は宗教が嫌いではありません。\n私は宗教を嫌いませんし、これは攻撃ではなく、ただ純粋に...。",
      "title": "なぜ多くの人が神を信じているのに、幽霊や悪魔の存在を馬鹿げていると感じるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不确定《圣经》或教会中是否包括鬼魂，但恶魔是，所以\n这种观点是怎么回事，这些东西必须被疯狂地质疑，但对于天使和上帝的信仰，他们会试图将其与任何事情联系起来？\n但对于天使和上帝的信仰，他们会试图将其与任何事情联系起来？我并不\n讨厌宗教，这不是攻击，我只是真的......",
      "title": "为什么很多人相信上帝，却常常觉得鬼魂或恶魔出没的想法很可笑？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不確定《聖經》或教會中是否包括鬼魂，但惡魔是，所以\n這種觀點是怎麼回事，這些東西必須被瘋狂地質疑，但對於天使和上帝的信仰，他們會試圖將其與任何事情聯繫起來？\n但對於天使和上帝的信仰，他們會試圖將其與任何事情聯繫起來？我並不\n討厭宗教，這不是攻擊，我只是真的......",
      "title": "爲什麼很多人相信上帝，卻常常覺得鬼魂或惡魔出沒的想法很可笑？"
    }
  ]
}