{
  "author": "Kevin3683",
  "original_created_utc": 1643849438,
  "title": "The IRS may not tax crypto earned through staking! The Jarret case involving Tezos may set the precedent.",
  "created_utc": 1643859235,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In May of last year Josh and Jessica Jarrett requested a refund of income tax they paid on Tezos staking rewards in 2019. (Around $3200 for approximately 8800 Tezos tokens)&lt;/p&gt;\n\n&lt;p&gt;Today, the IRS has decided to issue that refund. &lt;/p&gt;\n\n&lt;p&gt;They will not refund any amount that was sold obviously but the couple is getting refunded for the entire amount requested, the tax they paid on the rewards that they did not sale. &lt;/p&gt;\n\n&lt;p&gt;This could be huge for everyone involved in cryptocurrency. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Nothing else is taxed at the moment of creation&lt;/strong&gt;. &lt;/p&gt;\n\n&lt;p&gt;The records will be made public Thursday and &lt;strong&gt;the IRS has not made any public statements&lt;/strong&gt;. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Source: Blockworks .com&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The Jarrett couple argued that new coins are tax-payer created property and should not be taxed until sold or exchanged. &lt;/p&gt;\n\n&lt;h2&gt;Edit: For those that are unfamiliar, capital assets like cryptocurrency are taxed in more than one way.&lt;/h2&gt;\n\n&lt;h2&gt;When you sell, trade, or dispose of a capital asset you incur &lt;strong&gt;capital gains tax&lt;/strong&gt;.&lt;/h2&gt;\n\n&lt;h2&gt;When you receive crypto through staking rewards, mining, airdrops, the IRS views that as income and it’s subject to &lt;strong&gt;income tax&lt;/strong&gt;, just like interest you earn on fiat in a traditional bank.&lt;/h2&gt;\n\n&lt;h2&gt;You owe income tax on it whether you sell or not.&lt;/h2&gt;\n\n&lt;h2&gt;This is what is in question, taxing something that has not been sold or traded, only created.&lt;/h2&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 393,
  "permalink": "/r/CryptoCurrency/comments/sj59mf/the_irs_may_not_tax_crypto_earned_through_staking/",
  "subreddit": "CryptoCurrency",
  "id": "sj59mf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In May of last year Josh and Jessica Jarrett requested a refund of income tax\nthey paid on Tezos staking rewards in 2019. (Around $3200 for approximately 8800\nTezos tokens)\n\nToday, the IRS has decided to issue that refund.\n\nThey will not refund any amount that was sold obviously but the couple…"
}