{
  "author": "Kevin3683",
  "original_created_utc": 1643849438,
  "title": "The IRS may not tax crypto earned through staking! The Jarret case involving Tezos may set the precedent.",
  "created_utc": 1643859235,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In May of last year Josh and Jessica Jarrett requested a refund of income tax they paid on Tezos staking rewards in 2019. (Around $3200 for approximately 8800 Tezos tokens)&lt;/p&gt;\n\n&lt;p&gt;Today, the IRS has decided to issue that refund. &lt;/p&gt;\n\n&lt;p&gt;They will not refund any amount that was sold obviously but the couple is getting refunded for the entire amount requested, the tax they paid on the rewards that they did not sale. &lt;/p&gt;\n\n&lt;p&gt;This could be huge for everyone involved in cryptocurrency. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Nothing else is taxed at the moment of creation&lt;/strong&gt;. &lt;/p&gt;\n\n&lt;p&gt;The records will be made public Thursday and &lt;strong&gt;the IRS has not made any public statements&lt;/strong&gt;. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Source: Blockworks .com&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The Jarrett couple argued that new coins are tax-payer created property and should not be taxed until sold or exchanged. &lt;/p&gt;\n\n&lt;h2&gt;Edit: For those that are unfamiliar, capital assets like cryptocurrency are taxed in more than one way.&lt;/h2&gt;\n\n&lt;h2&gt;When you sell, trade, or dispose of a capital asset you incur &lt;strong&gt;capital gains tax&lt;/strong&gt;.&lt;/h2&gt;\n\n&lt;h2&gt;When you receive crypto through staking rewards, mining, airdrops, the IRS views that as income and it’s subject to &lt;strong&gt;income tax&lt;/strong&gt;, just like interest you earn on fiat in a traditional bank.&lt;/h2&gt;\n\n&lt;h2&gt;You owe income tax on it whether you sell or not.&lt;/h2&gt;\n\n&lt;h2&gt;This is what is in question, taxing something that has not been sold or traded, only created.&lt;/h2&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 393,
  "permalink": "/r/CryptoCurrency/comments/sj59mf/the_irs_may_not_tax_crypto_earned_through_staking/",
  "subreddit": "CryptoCurrency",
  "id": "sj59mf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In May of last year Josh and Jessica Jarrett requested a refund of income tax\nthey paid on Tezos staking rewards in 2019. (Around $3200 for approximately 8800\nTezos tokens)\n\nToday, the IRS has decided to issue that refund.\n\nThey will not refund any amount that was sold obviously but the couple…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨年5月、ジョシュとジェシカ・ジャレット夫妻は、所得税の還付を求めました。\n彼らは2019年にTezosのステーク報酬に対して支払った。(約8800ドルで約3200ドル\nテゾス・トークン)\n\n本日、国税庁はその還付金を発行することを決定しました。\n\n明らかに売られた金額は返金されないが、夫妻は...",
      "title": "国税庁はステーキングで稼いだ暗号に課税しないかもしれない！？Tezosに関わるJarret事件が先例となるかもしれません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "去年5月，乔希和杰西卡-贾瑞特要求退还他们在2019年为Tezos赌注奖励支付的所得税\n他们在2019年为Tezos赌注奖励支付的所得税。(约3200美元，约8800\nTezos代币)\n\n今天，美国国税局已经决定发放这笔退款。\n\n他们不会退还任何已售出的金额，显然，这对夫妇...",
      "title": "国税局可能不会对通过押注赚取的加密货币征税! 涉及Tezos的Jarret案可能开创了先例。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "去年5月，喬希和傑西卡-賈瑞特要求退還他們在2019年爲Tezos賭注獎勵支付的所得稅\n他們在2019年爲Tezos賭注獎勵支付的所得稅。(約3200美元，約8800\nTezos代幣)\n\n今天，美國國稅局已經決定發放這筆退款。\n\n他們不會退還任何已售出的金額，顯然，這對夫婦...",
      "title": "國稅局可能不會對通過押注賺取的加密貨幣徵稅! 涉及Tezos的Jarret案可能開創了先例。"
    }
  ]
}