{
  "author": "Tylanmon",
  "original_created_utc": 1636657891,
  "title": "\"CNBC makes news of 2 kids making 160K mining Crypto\" What they don't say is that their parents bought them hundreds of thousands of dollars worth of Rigs to do so.",
  "created_utc": 1636666466,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let&#39;s say it everyone: <strong><em>Money makes Money</em></strong><strong><em><sup>2</sup></em></strong><strong><em>.</em></strong></p>\n\n<p>Today, worlds <em>&quot;objectively best&quot;</em> media cooperation CNBC, made another <em>great</em> article, about 2 kids making $160K from mining Crypto, and as a miner myself I want to quote some things from their article.</p>\n\n<p>Our heroes, two kids named Ishaan Thakur, (14) and his sister Aanya, (9). They started mining with 3 dollars a day, which is what I get with my 2060 ($349), but then their operations grow majestically, how majestically you say? <strong>$64K per month!</strong></p>\n\n<p>Let me tell you, there is no fuckin way in the planet earth that you can get these numbers without a mining farm. Let&#39;s continue!</p>\n\n<p><strong><em>“We have configured our computers to constantly scan for the most profitable coin and switch to that coin automatically,”</em></strong>  If i need to translate it to English, Ishaan is either a super genius coder that can make a super complex AI. Or, they simply use NiceHash, which is what i use and does all this stuff automatically.</p>\n\n<p><strong><em>“Even though we are now making a lot of money, we are just as proud now as we were when we only made $3 per day, since our main prize is not the money,”</em></strong> I dont get why they act like its their achievement, its just that they poured a fortune to their rigs but, &quot;How much?&quot;</p>\n\n<p>Now you remember when I said, &quot;What they don&#39;t say&quot;. Now that&#39;s kind of a lie cause just when I thought the article ended, there is a sweet spot that explains how they make that much money.</p>\n\n<p>See, their father Manish Raj, did something that I laughed the shit out of myself once I read. He took a loan for his kids to Mine Cryptocurrency. Yes, you heard me right, he took a LOAN, for his kids to mine Crypto! Honestly, my father of the year award goes for the Manish!</p>\n\n<p>Anyway, how much processor does little Ishaan has? Well, hope you&#39;re ready cause shit is about to get real!</p>\n\n<p>14-year-old Ishaan has:</p>\n\n<p><strong>100 NVIDIA RTX 3090!</strong></p>\n\n<p>and</p>\n\n<p><strong>50 NVIDIA RTX 3070 TI!</strong></p>\n\n<p>There is a huge chip shortage going on right now so no fuckin way he got these cards by the retailer prices, but let&#39;s say Manish is a close friend of Nvidia&#39;s CEO, which I must say, you probably need to be to give that much money to your kids. He still would need to spend, AT LEAST $150.000 on GPUs with $1500 per card!</p>\n\n<p>And you know what&#39;s funny? RTX 3090 isn&#39;t even a good GPU for mining. of course, its hash rate is an incredible 108 which is a lot, But, it&#39;s not very efficient in Hash/$ perspective, as it needs 291 days to pay its price, while GTX 1060 only needs 159.</p>\n</div><!-- SC_ON -->",
  "score": 273,
  "permalink": "/r/CryptoCurrency/comments/qrskgv/cnbc_makes_news_of_2_kids_making_160k_mining/",
  "subreddit": "CryptoCurrency",
  "id": "qrskgv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Let's say it everyone: Money makes Money2.\n\nToday, worlds \"objectively best\" media cooperation CNBC, made another great\narticle, about 2 kids making $160K from mining Crypto, and as a miner myself I\nwant to quote some things from their article.\n\nOur heroes, two kids named Ishaan Thakur, (14) and his…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "みんなで言いましょう。Money makes Money2です。\n\n今日、世界の「客観的に最も優れた」メディアであるCNBCがまた素晴らしい記事を作りました。\n2人の子供が暗号を採掘して16万ドルを稼いだという記事を掲載しました。\nその記事からいくつか引用したいと思います。\n\n私たちのヒーローは、Ishaan Thakur (14)という2人の子供とその...",
      "title": "「CNBCでは、2人の子供が160Kの暗号を採掘しているというニュースを流していますが、彼らが言わないのは、彼らの両親がそうするために何十万ドルもの価値のあるリグを購入したということです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家一起说吧。有钱能使鬼推磨2。\n\n今天，世界上 \"客观上最好的 \"媒体合作CNBC，又发表了一篇伟大的\n今天，世界上 \"客观上最好的 \"媒体合作机构CNBC，发表了另一篇伟大的文章，关于两个孩子通过挖掘加密货币赚取16万美元，作为一个矿工，我想引用他们文章中的一些内容。\n我想引用他们文章中的一些内容。\n\n我们的主人公是两个孩子，名叫Ishaan Thakur，（14岁）和他的...",
      "title": "\"CNBC报道了两个孩子挖加密货币赚了16万的新闻。\"他们没有说的是，他们的父母为他们买了价值数十万美元的钻机来做这件事。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家一起說吧。有錢能使鬼推磨2。\n\n今天，世界上 \"客觀上最好的 \"媒體合作CNBC，又發表了一篇偉大的\n今天，世界上 \"客觀上最好的 \"媒體合作機構CNBC，發表了另一篇偉大的文章，關於兩個孩子通過挖掘加密貨幣賺取16萬美元，作爲一個礦工，我想引用他們文章中的一些內容。\n我想引用他們文章中的一些內容。\n\n我們的主人公是兩個孩子，名叫Ishaan Thakur，（14歲）和他的...",
      "title": "\"CNBC報道了兩個孩子挖加密貨幣賺了16萬的新聞。\"他們沒有說的是，他們的父母爲他們買了價值數十萬美元的鑽機來做這件事。"
    }
  ]
}