{
  "author": "Intelligent-Pear-783",
  "the_new_excerpt": "I found out that all mental health appointments are now done through teladoc\nhealth, after I reached out to a therapist because of all the money I’m losing\nin the stock market. This should come as great news for the company’s\nshareholders, and provide a great outlook for future growth as these red…",
  "original_created_utc": 1619104284,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "メンタルヘルスの予約はすべてteladocで行われることがわかりました。\nヘルスで行われていることを知りました。これは、株式市場で失ったお金のためにセラピストに連絡した後のことです。\n株式市場で失ったお金のためにセラピストに連絡した後です。これは、会社の株主にとっては素晴らしいニュースです。\nこれは株主にとっても大きなニュースであり、今後の成長に向けた大きな展望となるはずです。",
      "title": "TelaDocヘルス"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我发现现在所有的心理健康预约都是通过teladoc进行的。\n我发现现在所有的心理健康预约都是通过teladoc进行的，因为我在股票市场上失去了所有的钱，所以我联系了一位治疗师\n因为我在股票市场上失去了很多钱。这对公司的股东来说应该是个好消息。\n这对公司的股东来说应该是个好消息，并为未来的增长提供了一个很好的前景，因为这些红...",
      "title": "TelaDoc健康"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我發現現在所有的心理健康預約都是通過teladoc進行的。\n我發現現在所有的心理健康預約都是通過teladoc進行的，因爲我在股票市場上失去了所有的錢，所以我聯繫了一位治療師\n因爲我在股票市場上失去了很多錢。這對公司的股東來說應該是個好消息。\n這對公司的股東來說應該是個好消息，併爲未來的增長提供了一個很好的前景，因爲這些紅...",
      "title": "TelaDoc健康"
    }
  ],
  "title": "TelaDoc health",
  "created_utc": 1619135570,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I found out that all mental health appointments are now done through teladoc health, after I reached out to a therapist because of all the money I’m losing in the stock market. This should come as great news for the company’s shareholders, and provide a great outlook for  future growth as these red days continue and people in America continue to turn into crazed lunatics. This started off as a joke but now it’s starting to make sense. Cheers.</p>\n</div><!-- SC_ON -->",
  "score": 44,
  "permalink": "/r/stocks/comments/mw6wry/teladoc_health/",
  "subreddit": "stocks",
  "id": "mw6wry",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776214687
}