{
  "author": "milonuttigrain",
  "original_created_utc": 1643492244,
  "title": "If there is the biggest lesson to learn from crypto investment, for me it would be \"patience\". Patience with buying. Patience with hodling. Patience with selling.",
  "created_utc": 1643535647,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have been in crypto since 2018. Many ups and downs along the way, but if anyone asks me what would be the biggest lesson I learned from those years, I&amp;#39;d say &amp;quot;patience&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;1. Patience with buying&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;We are all familiar with the term &amp;quot;buy high sell low&amp;quot;. Sounds absurd, but it is actually happening every time. Everyone is a genius in a bull run, as the prices shoot up every hour, FOMO comes into play. This chart sums it up nicely:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/wcg4g01byoe81.jpg?width=640&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=cab8009e25203135b00141fbd50a95c15650227b\"&gt;https://preview.redd.it/wcg4g01byoe81.jpg?width=640&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=cab8009e25203135b00141fbd50a95c15650227b&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;From my personal experience, I successfully defended the FOMO phase of 2017. In 2018, I bought the first Bitcoin at $7,000 and ETH at $600, thinking they couldn&amp;#39;t possibly go any lower. Hundred of posts back then say the same thing, $6k-7k is &amp;quot;the floor&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Another aspect of patience with buying, is not to fomo into shitcoins. Many people have the mindset of &amp;quot;get rich quick&amp;quot; and jumped into many shitcoins, which turned out to be terrible investment. Again, I was lucky not to fomo into Waltonchain, Dragonchain, Ark, Verge, ICX, Lambda, Komodo, Bitmax, OMG. The ICO boom in 2017 left many broken. The only not-so-good purchases for me were NEO, DASH and Raiblock (now NANO). I sold NEO and NANO last year, making a small profit and not looking back.&lt;/p&gt;\n\n&lt;p&gt;Time in the market is more important than timing the market, however it would be better to combine both factors. This is because we as retail investors don&amp;#39;t have a lot of money to play with, so buying now would be surely better than buying in Nov-2021. A wide range of tools can be deployed to strengthen the DCA plan. I prefer an adjusted DCA (buying regularly, but not regardless of any price).&lt;/p&gt;\n\n&lt;p&gt;My favorite tools: RSI, MA50, MA200, Mayer Multiplier and Bitcoin rainbow. You can&amp;#39;t time the top or the bottom, but getting 10% close to the range would surely help.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;2. Patience with hodling&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This one is also very important. Crypto is volatile and you normally see people making 1000%, 10000% or even more in a particular project. The OG who bought in early and almost never consider selling, is a different breed. For us, even holding for 4 years would be a commitment. &lt;/p&gt;\n\n&lt;p&gt;So again, don&amp;#39;t invest more than what you can afford to lose. You would not want to sell something urgently because the rent payment is due and now you have no cash left.&lt;/p&gt;\n\n&lt;p&gt;Hodling is hard. Very hard. When you see your portfolio value go down 10% a month or even worse. But the power of holding is huge.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/64k4y7uj1pe81.png?width=1574&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=c3f550fc0df61d1973a549eb7fa1eebed39f84b1\"&gt;DCA returns for selected coins https://www.blockchaincenter.net/dollar-cost-averaging/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Right now we are in the red, and one of the worst time to sell in my opinion. However, it should be noted that not everything is worth holding forever. There are a lot of coins from 2016/2017/2018 that could be considered &amp;quot;dead coins&amp;quot; by now. But if you believe in a particular project and support it, you can reduce your cost basis in a hard time like this.&lt;/p&gt;\n\n&lt;p&gt;Another good thing with holding now is that you can stake and earn passive income. This can lower your cost basis and get you airdrops for some specific coins.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;3. Patience with selling&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Many retail investors lost interest with crypto and can&amp;#39;t bear the fact that their portfolio is now in the red. Hence, many sell low, in the possibly worst time to do so. In a hard time, if you can&amp;#39;t buy more, at least keep hodling the position.&lt;/p&gt;\n\n&lt;p&gt;No one ever goes broke by taking profits, however. It&amp;#39;s always a good idea to DCA out near the top. If the price drops later, you can buy back for cheaper price. I sold some portion of BTC at $60k and bought back at $39k. Not the perfect top or bottom, but at least quite close.&lt;/p&gt;\n\n&lt;p&gt;I made some bad selling transactions as well. For example, I bought BNB at $92 just last year, and sold at $270. Now even in a downturn, BNB is still $390. Again, the tools above can help with the short-term as well. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;And for you, what would be the biggest lesson from crypto investing?&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "permalink": "/r/CryptoCurrency/comments/sfsdn7/if_there_is_the_biggest_lesson_to_learn_from/",
  "subreddit": "CryptoCurrency",
  "id": "sfsdn7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have been in crypto since 2018. Many ups and downs along the way, but if\nanyone asks me what would be the biggest lesson I learned from those years, I'd\nsay \"patience\".\n\n1. Patience with buying\n\nWe are all familiar with the term \"buy high sell low\". Sounds absurd, but it is\nactually happening…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2018年からクリプトを始めました。途中、多くの浮き沈みがありましたが、もし\nこの数年間で学んだ最大の教訓は何かと聞かれたら、私はこう答えるでしょう。\nは \"忍耐 \"と言っています。\n\n1. 買うことへの忍耐力\n\n私たちは皆、「高く買って安く売る」という言葉に慣れ親しんでいます。ばかげているように聞こえますが、実際にそうなのです。\n実際に起きていることです...",
      "title": "暗号投資で学ぶべき最大の教訓があるとすれば、私にとっては「忍耐」でしょう。買いに対する忍耐。ホールドリングの忍耐。売るときの忍耐力。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我自2018年以来一直从事加密货币。一路走来，有很多起伏，但是如果有人问我\n有人问我从这些年学到的最大教训是什么，我会\n我会说 \"耐心\"。\n\n1. 对购买有耐心\n\n我们都熟悉 \"高买低卖 \"这个词。听起来很荒唐，但这是\n实际上正在发生...",
      "title": "如果说从加密货币投资中可以学到最大的一课，对我来说，那就是 \"耐心\"。对购买有耐心。耐心等待，耐心等待。对出售有耐心。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我自2018年以來一直從事加密貨幣。一路走來，有很多起伏，但是如果有人問我\n有人問我從這些年學到的最大教訓是什麼，我會\n我會說 \"耐心\"。\n\n1. 對購買有耐心\n\n我們都熟悉 \"高買低賣 \"這個詞。聽起來很荒唐，但這是\n實際上正在發生...",
      "title": "如果說從加密貨幣投資中可以學到最大的一課，對我來說，那就是 \"耐心\"。對購買有耐心。耐心等待，耐心等待。對出售有耐心。"
    }
  ]
}