{
  "author": "DarkStar668",
  "the_new_excerpt": "I've noticed newer people aren't sure how this works. I told someone yesterday\nthat SNDL would dump today or Friday and they asked me \"what my thesis was\".\nThere is no thesis. You nerds can't just go by numbers or info about the\ncompany. This is human behavior and computer algos programmed by…",
  "original_created_utc": 1613095242,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我注意到新来的人不知道这个怎么用。我昨天跟人说\nSNDL会在今天或周五抛出，他们问我 \"我的论文是什么\"。\n根本就没有什么论文。你们这些书呆子不能只靠数字或信息来判断。\n公司。这是人类行为和计算机算法编程的...",
      "title": "Meme股票周期"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我注意到新來的人不知道這個怎麼用。我昨天跟人說\nSNDL會在今天或週五拋出，他們問我 \"我的論文是什麼\"。\n根本就沒有什麼論文。你們這些書呆子不能只靠數字或信息來判斷。\n公司。這是人類行爲和計算機算法編程的...",
      "title": "Meme股票週期"
    }
  ],
  "title": "Meme Stock Cycle",
  "created_utc": 1613147728,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve noticed newer people aren&#39;t sure how this works. I told someone yesterday that SNDL would dump today or Friday and they asked me &quot;what my thesis was&quot;. There is no thesis. You nerds can&#39;t just go by numbers or info about the company. This is human behavior and computer algos programmed by humans.</p>\n\n<p>So let me lay out what happened with SNDL (and most meme stocks for that matter)</p>\n\n<p>Early Adopter Phase - This was when SNDL was under $0.5 recently. People who suspect the stock is undervalued and a lot of bigger money investors are loading up. The stock may trade relatively flat or go through small increases.</p>\n\n<p>Middle Phase - 01/28: SNDL spikes up to 100%, before closing the day up about 39% at $0.83. Very high volume on the day. This is where people who are watching for activity get in (I bought here).</p>\n\n<p>Late/FOMO Phase - 02/08: SNDL spikes roughly 14% and goes into a stage of parabolic gains as retail buyers rush in and FOMO takes hold. Word spreads like wildfire across social media and forums. Everybody is aware at this point.</p>\n\n<p>*Short sellers know how this works as well and they will enter positions at some point during this phase</p>\n\n<p>Profit Taking Phase - After a few days of huge gains on very high volume, buying reaches a crescendo. The earliest adopters have already made several times their initial investment and are ready to cash out. The people who bought in the middle know that the &quot;smart money&quot; has either already sold or is about to sell. This leads to chain reaction of increased selling. Fear can take hold over the Late Adopters as they do not want to lose money and panic sell.</p>\n\n<p>Set for next cycle - The stock usually drills hard, followed by some more selling and/or a dead cat bounce if the drop is too drastic. Over the next trading sessions, price will go through smaller up an down bounces until a new &quot;baseline price&quot; is found. The stock will usually trade sideways for a bit until the cycle begins anew. (This last part is hard to predict). Stocks may see very little activity for weeks or months in this phase, or buyers may quickly regain interest, especially if a catalyst appears.</p>\n\n<p>This isn&#39;t WSB doing this or the media or whatever grand conspiracy you think it is. It&#39;s happened many times and will continue to happen</p>\n\n<p><strong>Edit</strong>: Decided to scoop up some APHA, TLRY, and SNDL from the panic sellers during premarket. There&#39;s no &quot;set&quot; way to determine it, but I felt that all of these got &quot;oversold&quot; by the panic sellers. Retail usually buys high and sells low, be different.</p>\n</div><!-- SC_ON -->",
  "score": 1529,
  "permalink": "/r/wallstreetbets/comments/li0yu5/meme_stock_cycle/",
  "subreddit": "wallstreetbets",
  "id": "li0yu5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728627598
}