{
  "author": "dietryin92",
  "the_new_excerpt": "He sent the army in to force the legislature to pass bills he wants passed.\n\nHe's getting rid of term limits for presidents\n\nHe is getting rid of the supreme court.\n\nHe has one of the harshest lockdown laws during covid in the world, and still\nhas some harsh laws.\n\nHe's been named one of the most…",
  "original_created_utc": 1623337623,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼は軍隊を送り込んで、自分が通過させたい法案を立法府に強要しました。\n\n彼は大統領の任期制限を撤廃している\n\n彼は最高裁を廃止している。\n\nまた、世界で最も厳しい監禁法を制定しています。\n今でも厳しい法律があります。\n\n彼は最も...の一つに選ばれています。",
      "title": "ここでは、ビットコインを合法化したことだけでなく、ブケレ氏のその他の素晴らしい功績をご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他派军队进驻，迫使立法机构通过他希望通过的法案。\n\n他正在摆脱总统的任期限制\n\n他正在摆脱最高法院。\n\n他拥有世界上最严厉的监狱禁闭法之一，并且仍然有一些严厉的法律。\n有一些严厉的法律。\n\n他被评为最...",
      "title": "不要只为布克尔将比特币合法化而庆祝了，下面是他其他一些了不起的成就的清单。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他派軍隊進駐，迫使立法機構通過他希望通過的法案。\n\n他正在擺脫總統的任期限制\n\n他正在擺脫最高法院。\n\n他擁有世界上最嚴厲的監獄禁閉法之一，並且仍然有一些嚴厲的法律。\n有一些嚴厲的法律。\n\n他被評爲最...",
      "title": "不要只爲布克爾將比特幣合法化而慶祝了，下面是他其他一些了不起的成就的清單。"
    }
  ],
  "title": "Stop just celebrating Bukele just for legalizing bitcoin, here is a list of some of his other awesome accomplishments.",
  "created_utc": 1623374092,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>He sent the army in to force the legislature to pass bills he wants passed.</p>\n\n<p>He&#39;s getting rid of term limits for presidents</p>\n\n<p>He is getting rid of the supreme court.</p>\n\n<p>He has one of the harshest lockdown laws during covid in the world, and still has some harsh laws.</p>\n\n<p>He&#39;s been named one of the most corrupt world leaders by transparency international.</p>\n\n<p>He claims that the murder rate has dropped drastically, but thats not true. People get disappeared regularly, they arent finding the bodies anymore.</p>\n\n<p>He&#39;s been exposed for giving ms13 more autonomy in the country.</p>\n\n<p>He is seizing pensions to help fund government programs and has hinted at seizing land &quot;for the good of the people&quot;.</p>\n\n<p>Check out his stance on abortion and same sex marriages.</p>\n\n<p>So yeah, legalizing bitcoin is pretty cool but setting yourself up for a dictatorship is straight based.</p>\n\n<p>Source: news, family still living in santa tecla</p>\n</div><!-- SC_ON -->",
  "score": 260,
  "permalink": "/r/CryptoCurrency/comments/nwpwfc/stop_just_celebrating_bukele_just_for_legalizing/",
  "subreddit": "CryptoCurrency",
  "id": "nwpwfc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009736012
}