{
  "author": "MohamedHwedi",
  "original_created_utc": 1656504783,
  "title": "Is it fair to examine the morals of people of the past through the lenses of today's moral standards?",
  "created_utc": 1656564643,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Nazis, slave owners, or any casual individual who was the product of their circumstances. We always have the urgency to look, in a condescending manner, at those people and pretend to have a moral high ground when in reality those individuals acted in accordance with their contemporaries and in accordance with what their culture presented.&lt;/p&gt;\n\n&lt;p&gt;even though there might have been some kind of opposition to what they were doing, some haven&amp;#39;t had the privilege to recognize it or learn it was wrong. Some were enforced to oblige and commit those horrible actions.&lt;/p&gt;\n\n&lt;p&gt;this phenomenon is still present in modern-day societies where individuals are locked into their own culture where they cultivate severe dogmas and irrational point-of-view about their environment and that subsequently will make them subconsciously act - in some capacity - in accordance with those beliefs.&lt;/p&gt;\n\n&lt;p&gt;morals were a product of the relative environment to individuals who did horrific acts, is it fair to judge them by your current relative moral standards?&lt;/p&gt;\n\n&lt;p&gt;to be clear, people like to assume this is some shady question but I&amp;#39;m posting it in a forthright manner, or at least I&amp;#39;m trying to convey the premise of this question so it can be understood. also, I&amp;#39;m not justifying any of the considered immoral acts.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/askphilosophy/comments/vnecw7/is_it_fair_to_examine_the_morals_of_people_of_the/",
  "subreddit": "askphilosophy",
  "id": "vnecw7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Nazis, slave owners, or any casual individual who was the product of their\ncircumstances. We always have the urgency to look, in a condescending manner, at\nthose people and pretend to have a moral high ground when in reality those\nindividuals acted in accordance with their contemporaries and in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ナチス、奴隷所有者、あるいはその産物である何気ない個人。\n私たちは常に、このような状況下における 私たちはいつも、そのような人々を見下すような態度で見て、自分もそうであるかのように装わなければならない衝動に駆られます。\nを見下し、道徳的に優位に立つようなふりをしなければならない。\nしかし、実際には、その人たちは同時代の人たちと同じように行動していたのである。",
      "title": "昔の人のモラルを、今のモラルのレンズを通して検証するのは、フェアなことでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "纳粹分子、奴隶主，或任何由他们的产物所产生的随意的个人。\n状况的产物。我们总是有一种紧迫感，以一种居高临下的方式来看待\n这些人，并假装有一个道德制高点，而实际上这些人\n事实上，这些人的行为与他们同时代的人一致，并且在...",
      "title": "用今天的道德标准来审视过去的人的道德，这公平吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "納粹分子、奴隸主，或任何由他們的產物所產生的隨意的個人。\n狀況的產物。我們總是有一種緊迫感，以一種居高臨下的方式來看待\n這些人，並假裝有一個道德制高點，而實際上這些人\n事實上，這些人的行爲與他們同時代的人一致，並且在...",
      "title": "用今天的道德標準來審視過去的人的道德，這公平嗎？"
    }
  ]
}