{
  "author": "MohamedHwedi",
  "original_created_utc": 1656504783,
  "title": "Is it fair to examine the morals of people of the past through the lenses of today's moral standards?",
  "created_utc": 1656564643,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Nazis, slave owners, or any casual individual who was the product of their circumstances. We always have the urgency to look, in a condescending manner, at those people and pretend to have a moral high ground when in reality those individuals acted in accordance with their contemporaries and in accordance with what their culture presented.&lt;/p&gt;\n\n&lt;p&gt;even though there might have been some kind of opposition to what they were doing, some haven&amp;#39;t had the privilege to recognize it or learn it was wrong. Some were enforced to oblige and commit those horrible actions.&lt;/p&gt;\n\n&lt;p&gt;this phenomenon is still present in modern-day societies where individuals are locked into their own culture where they cultivate severe dogmas and irrational point-of-view about their environment and that subsequently will make them subconsciously act - in some capacity - in accordance with those beliefs.&lt;/p&gt;\n\n&lt;p&gt;morals were a product of the relative environment to individuals who did horrific acts, is it fair to judge them by your current relative moral standards?&lt;/p&gt;\n\n&lt;p&gt;to be clear, people like to assume this is some shady question but I&amp;#39;m posting it in a forthright manner, or at least I&amp;#39;m trying to convey the premise of this question so it can be understood. also, I&amp;#39;m not justifying any of the considered immoral acts.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/askphilosophy/comments/vnecw7/is_it_fair_to_examine_the_morals_of_people_of_the/",
  "subreddit": "askphilosophy",
  "id": "vnecw7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Nazis, slave owners, or any casual individual who was the product of their\ncircumstances. We always have the urgency to look, in a condescending manner, at\nthose people and pretend to have a moral high ground when in reality those\nindividuals acted in accordance with their contemporaries and in…"
}