{
  "author": "Sparky81",
  "original_created_utc": 1639156332,
  "title": "Do you think Planet Fitness would care if i got a membership and only came in to use the shower?",
  "created_utc": 1639168074,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Over the past year my arthritis has got so bad that i can&amp;#39;t stand or walk anymore making it impossible to get in the shower with how my bathrooms are built. The washcloth method just isn&amp;#39;t the same a hot shower. Planet Fitness right next to me has a handicap shower stall i might be able to use. Do you think they&amp;#39;d care?&lt;/p&gt;\n\n&lt;p&gt;Edit: Thanks guys, I could just call them but I&amp;#39;m feeling super self conscious and embarrassed about all this for some reason. Thanks for the responses.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/NoStupidQuestions/comments/rdddxc/do_you_think_planet_fitness_would_care_if_i_got_a/",
  "subreddit": "NoStupidQuestions",
  "id": "rdddxc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Over the past year my arthritis has got so bad that i can't stand or walk\nanymore making it impossible to get in the shower with how my bathrooms are\nbuilt. The washcloth method just isn't the same a hot shower. Planet Fitness\nright next to me has a handicap shower stall i might be able to use. Do…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この1年で関節炎がひどくなり、立ったり歩いたりすることができなくなりました。\nバスルームの構造上、シャワーを浴びることができなくなった。\nを構築しました。洗濯バサミを使った方法は、熱いシャワーと同じようにはいきません。プラネットフィットネス\nすぐそばにハンディキャップ用のシャワー室があるので、使えるかもしれません。どうしよう...",
      "title": "もし私が会員になって、シャワーを使うためだけに来たら、プラネット・フィットネスは気にすると思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的一年里，我的关节炎变得如此严重，以至于我无法站立或行走。\n我的浴室是如何建造的，这使得我不可能去洗澡。\n建。用毛巾擦拭的方法与热水淋浴不一样。星球健身中心\n就在我旁边有一个残疾人淋浴间，我也许可以使用。你能不能...",
      "title": "你认为Planet Fitness会在乎我是否有会员资格，并且只进来使用淋浴吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的一年裏，我的關節炎變得如此嚴重，以至於我無法站立或行走。\n我的浴室是如何建造的，這使得我不可能去洗澡。\n建。用毛巾擦拭的方法與熱水淋浴不一樣。星球健身中心\n就在我旁邊有一個殘疾人淋浴間，我也許可以使用。你能不能...",
      "title": "你認爲Planet Fitness會在乎我是否有會員資格，並且只進來使用淋浴嗎？"
    }
  ]
}