{
  "author": "leokorea",
  "original_created_utc": 1656001062,
  "title": "\"Courage\" by Dorothy Cameron Disney: an obcure American WWII Story in Chinese middle school literature textbook that influenced a generation. Anyone know more about this piece?",
  "created_utc": 1656017238,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I went to middle school and high school in China. Back in the 90s and early 2000s, the textbooks in Chinese schools were very standardized. That means almost everyone in my generation knows a World War 2 story about an American soldier who parachuted to Normandy, since most of us use the same textbook.&lt;/p&gt;\n\n&lt;p&gt;The original Chinese can be found here:\n&lt;a href=\"https://baike.baidu.com/item/%E5%8B%87%E6%B0%94/5621005\"&gt;https://baike.baidu.com/item/%E5%8B%87%E6%B0%94/5621005&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The interesting thing is: no one in China or anywhere seems to know if the story is real or fictional, where did the author got her source, how did it end up in a Chinese government sanctioned middle school literature textbook, etc. &lt;/p&gt;\n\n&lt;p&gt;Given how much impact it has made on a whole generation of Chinese population, there is almost no information about the origin of this story, its authors background, its authencity, we can&amp;#39;t even find the original English version on the internet.&lt;/p&gt;\n\n&lt;p&gt;The title of story is Courage (maybe not a literal translation of its original title), by a rather obscure American author by the name of Dorothy Cameron Disney, according to a Chinese Reddit type website.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://zhidao.baidu.com/question/135029980047099685/answer/2833614875.html\"&gt;https://zhidao.baidu.com/question/135029980047099685/answer/2833614875.html&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://zhidao.baidu.com/question/153519246/answer/458586293.html\"&gt;https://zhidao.baidu.com/question/153519246/answer/458586293.html&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The story is set in France during World War II. The author, DC Disney, a wartime journalist, heard the story from a unnamed solider during a lunch party in England. The unnamed solider was parachuted to a wrong location during the invasion. He found a farm house nearby and its owners, a French couple, were willing to hide him from the Germans.&lt;/p&gt;\n\n&lt;p&gt;Unfortunately, the Germans spotted the parachute as he landed and they searched the farm house and found the American parachuter. The French man was summarily executed on the spot as a warning to others who dare to offer assistance to the Americans. The execution left the woman a widow and an orphan child.&lt;/p&gt;\n\n&lt;p&gt;The Germans, however, were not sure what to do with American. So they lock him up in a small cabin. The American soldier managed to escape from the log cabin and ran deep into the forrest. The Germans got a hint of this and started to search the forrest at night.&lt;/p&gt;\n\n&lt;p&gt;The American solider, not knowing where to go or hide, made a stunning decision: go back to that same farm house again. With the dead body still laying on the ground, the American asked the French woman, &amp;quot;can you hide me?&amp;quot; And she replied: &amp;quot;of course! Be quick.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Hiding in a cellar for three days, according to the story, the American soldier was regrouped with his unit. During these three days, the German soldiers did not even bother to search the farm house again, beacuae &amp;quot;they cannot possibly comprehend the spiritual and moral height of the people that they are dealing with.&amp;quot; (my cheesy paraphrase from a potentially none literal translation).&lt;/p&gt;\n\n&lt;p&gt;At the end of the story, the author expressed her fascination about the two characters of this &amp;quot;true story&amp;quot;, that both the French woman and American soldier were truly courageous. (At the point, the teacher will ask the meaning of courage and why is the American soldier courageous etc...)&lt;/p&gt;\n\n&lt;p&gt;After almost twenty years, having lived in a few country by now, I am still deeply in love with this story. As a teacher myself, I feel the urge to share this story with my own students. Honestly, I don&amp;#39;t care if it is real or fictional: this is one of the few memorable pieces of literatures we used to read that is related to America and its people. Given the vast (and widening) ideological and political differences China and the US have today, this story seemed to be taken out of the textbook for good (I need to double confirm it though). However, I adore this story so much that I hate to see it fade away. So I decided to write this long post and hopefully we keep this memory alive by finding more about this piece.&lt;/p&gt;\n\n&lt;p&gt;Is there anyone who knows more about this story? How about its author, Dorothy Cameron Disney, is she even the author? Was it published in the US in any form? Can we find an original English version?&lt;/p&gt;\n\n&lt;p&gt;Thank you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/AskHistorians/comments/vj0nm5/courage_by_dorothy_cameron_disney_an_obcure/",
  "subreddit": "AskHistorians",
  "id": "vj0nm5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I went to middle school and high school in China. Back in the 90s and early\n2000s, the textbooks in Chinese schools were very standardized. That means\nalmost everyone in my generation knows a World War 2 story about an American\nsoldier who parachuted to Normandy, since most of us use the same…"
}