{
  "author": "Chooky47",
  "original_created_utc": 1631404442,
  "title": "People need to have realistic expectations from their investments - $100 is not going to allow you to purchase a lambo.",
  "created_utc": 1631424637,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>One of the great lures of the crypto space for new investors is the idea that they can take a small investment, and transform it into a ludicrous amount of money. </p>\n\n<p>These instances of taking tiny holdings and turning them into mountains of gold are both incredibly rare, and also require the ability to hold for a <strong>long</strong> time without being overcome by fear of the investment falling. </p>\n\n<p>For example, if you had bought 1 BTC at $10, do you really think you would have not sold at $1000? 5000? Be mindful of the extreme FUD that would have been present along the way. </p>\n\n<p>Realistically, multiplying your investment by factors of x5, x10 or even x20 are excellent investments. If I were to invest $100, then <em>realistically</em> I would be <strong>very</strong> happy with a return of $1000. You need to decide for yourself if you believe that project will carry on for years to come. </p>\n\n<p>Naturally there will be the occasional rocket token, such as Doge, and we’ll know because it will gather lots of attention. They are rare, and statistically you are <em>unlikely</em> to ride one of them - not impossible, but the key is unlikely. </p>\n\n<p>At the end of the day, if you’ve made profit you’ve done well so far so congratulate yourself. Allow time to help you if you want your investment to possibly grow large, but otherwise you need to accept that small investments will most likely not make you a yacht sailing millionaire. </p>\n\n<p>TL:DR - Be realistic with your potential profits from small investments.</p>\n</div><!-- SC_ON -->",
  "score": 177,
  "permalink": "/r/CryptoCurrency/comments/pmi574/people_need_to_have_realistic_expectations_from/",
  "subreddit": "CryptoCurrency",
  "id": "pmi574",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "One of the great lures of the crypto space for new investors is the idea that\nthey can take a small investment, and transform it into a ludicrous amount of\nmoney.\n\nThese instances of taking tiny holdings and turning them into mountains of gold\nare both incredibly rare, and also require the ability…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "新規投資家にとっての暗号空間の大きな魅力の1つは、少額の投資でおかしな額に変えられるという考えです。\n少額の投資で、おかしな金額に変えることができるということです。\nお金に変えることができるということです。\n\nわずかな資産を金の山に変えることができる例は、非常に稀であり、またその能力も必要です。\nこのような事例は非常に稀であり、また、能力も必要とされます...",
      "title": "100ドルでランボを買えるわけではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于新的投资者来说，加密货币空间的一个巨大诱惑是，他们可以用一个小的投资，把它变成一个可笑的数额。\n他们可以利用小额投资，并将其转化为令人难以置信的金额\n钱。\n\n这些将微小的持有量变成金山的例子\n是非常罕见的，而且还需要有能力...",
      "title": "人们需要对他们的投资有现实的期望--100美元不可能让你购买一辆兰博。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於新的投資者來說，加密貨幣空間的一個巨大誘惑是，他們可以用一個小的投資，把它變成一個可笑的數額。\n他們可以利用小額投資，並將其轉化爲令人難以置信的金額\n錢。\n\n這些將微小的持有量變成金山的例子\n是非常罕見的，而且還需要有能力...",
      "title": "人們需要對他們的投資有現實的期望--100美元不可能讓你購買一輛蘭博。"
    }
  ]
}