{
  "author": "cloudsaves",
  "the_new_excerpt": "Hey guys. Today I'm sharing a DD on a favorite long hold stock pick, Broadwind\nInc. (BWEN).\n\nBroadwind Inc. Company Profile:\n\nBroadwind, Inc. provides products to the energy, mining, and infrastructure\nsector customers primarily in the United States. It operates through three\nsegments: Heavy…",
  "original_created_utc": 1613265175,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，小伙伴们 今天给大家分享一个最喜欢的长线持股选股的DD，宽风股份。\n股份有限公司（BWEN）。(BWEN)。\n\nBroadwind Inc. 的公司简介。\n\nBroadwind, Inc.为能源、采矿和基础设施领域提供产品。\n主要在美国的部门客户。它通过以下三个方面开展业务\n段。重...",
      "title": "对Broadwind(BWEN)的全面丈量----------------------------------------------高潜力可再生资源"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，小夥伴們 今天給大家分享一個最喜歡的長線持股選股的DD，寬風股份。\n股份有限公司（BWEN）。(BWEN)。\n\nBroadwind Inc. 的公司簡介。\n\nBroadwind, Inc.爲能源、採礦和基礎設施領域提供產品。\n主要在美國的部門客戶。它通過以下三個方面開展業務\n段。重...",
      "title": "對Broadwind(BWEN)的全面丈量----------------------------------------------高潛力可再生資源"
    }
  ],
  "title": "Comprehensive DD on Broadwind (BWEN) - High Potential Renewable Play",
  "created_utc": 1613325383,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey guys. Today I&#39;m sharing a DD on a favorite long hold stock pick, Broadwind Inc. (BWEN).</p>\n\n<p>Broadwind Inc. Company Profile: </p>\n\n<p>Broadwind, Inc. provides products to the energy, mining, and infrastructure sector customers primarily in the United States. It operates through three segments: Heavy Fabrications, Gearing, and Industrial Solutions. The Heavy Fabrications segment provides fabrications to various industrial markets; and steel towers and adapters primarily to wind turbine manufacturers. The Gearing segment offers gearing, and gearboxes and systems for onshore and offshore oil and gas fracking and drilling, surface and underground mining, wind energy, steel, material handling, and other infrastructure markets. The Industrial Solutions segment provides supply chain solutions, inventory management, and kitting and assembly services to natural gas turbine market. The company sells its products through its direct sales force and independent sales agents. </p>\n\n<p>I like this stock and think it will do well for the following reasons: </p>\n\n<p>1) Good Fundamentals</p>\n\n<p>Let&#39;s start by taking a look at the companies fundamentals. </p>\n\n<p>Market Cap: 166.33M</p>\n\n<p>Enterprise Value: 203.7M</p>\n\n<p>Revenue: 207.43M </p>\n\n<p>Quarterly Revenue Growth Rate: 18.4% </p>\n\n<p>Gross Profit: 15.4M</p>\n\n<p>EBITDA: 9M</p>\n\n<p>EPS: -0.07</p>\n\n<p>Total cash: 4.5M</p>\n\n<p>Total Debt: 42M</p>\n\n<p>The first thing you should notice is that annual revenues are greater than both Market Cap and Enterprise Value. This means that the overall value of company based on its stock price is valued less than the revenue it generates in one year. </p>\n\n<p>In addition, you will note a quarterly revenue growth rate of 18.4%. This is a decent number, nothing crazy, but gradual and sustainable. If you examine their YoY revenue charts you&#39;ll see that this growth has been consistent for several quarters. </p>\n\n<p>The company is also turning over a gross profit of 15.4M. This can help cover some of the total debt which amounts to 42M. With their current revenue generation I don&#39;t expect any short term debt to be an issue that can cause insolvency. Also, over the last year, Broadwind produced more free cash flow than EBIT. </p>\n\n<p>Insiders hold 15% of the company, and institutions hold 45% - another positive sign. </p>\n\n<p>Over the past 4 quarters, the company has matched 2 analyst EPS consensus estimates, and beat 2. </p>\n\n<p>Est. EPS         -0.04   0.02   0.02   -0.06</p>\n\n<p>Actual EPS.   -0.04   0.06   0.03   -0.06</p>\n\n<p>2) Experienced Management Team</p>\n\n<p>A company is only as good as the people who operate it, and thus having a solid management team is a key factor. </p>\n\n<p>The current CEO, Eric Blashford, is a 20 year industry veteran serving in various executive positions. He is an MBA and accounting graduate. </p>\n\n<p>The CFO, Jason Bonfigt, has been with the company for over 10 years and has an MBA from Kellog School of Business.</p>\n\n<p>The VP of engineering, Dennis Janda, has been an engineer for over 42 years and graduated with a master&#39;s in mechanical engineering from University of Michigan. </p>\n\n<p>The chairman of the board, Stephanie Kushner, is a 25 year industry veteran with multiple executive positions in her career. She has an MBA in Finance from Wharton.</p>\n\n<p>In addition to the exec, the company has over 200 employees across the country. They are actively hiring and have several open positions at time of writing. </p>\n\n<p>3) Hot Industry and Diversification </p>\n\n<p>The company focuses primarily on WIND energy, making this one of the few strong wind plays on the market. While solar has its benefits, wind is considered a superior energy source. It doesn&#39;t require sunlight, wind turbines produce less CO2 emissions, and more energy  - one wind turbine can generate the same amount of electricity per kWh as about 49,000 solar panels. </p>\n\n<p>With the Biden administration and Democrat Congress, in addition to Xi Jinpings declaration for China to pivot towards sustainable energy sources, I believe 2021 will be the year when the renewable market really takes off. Broadwind is well positioned to benefit from increased investments, research, and commercialisation in this industry. </p>\n\n<p>It should be noted that Broadwind derives approximately 30% of revenue from other industries beyond wind power. This includes an industrial gears segment, serving primarily the energy and mining industries and an industrial solutions segment, focused predominantly on gas turbines. This is a goal of management to improve diversification of the business so that they are not hostage to demand wind installations. In fact, Broadwinds acquistion of Red Wolf a company supporting gas turbine installations, shows management does wish to actively diversify through what they term their &quot;revenue diversification initiative&quot;. </p>\n\n<p>4) Price Action and Forecasts </p>\n\n<p>The company has seen a 400% in its price since last year. While a major run, the company still remains undervalued. Currently, the price is undergoing consolidation and the 1 month and 5 day RSI are in the 45-50 range. Average volumes over the past 1 month have been greater than the overall average by a notable margin. </p>\n\n<p>The short % is small at about 3.26% of shares outstanding, and has not risen rapidly even with the huge price increase over the past year (a bullish sign).</p>\n\n<p>Analyst consensus price target is $12.5 with a high of $13, well above its current trading price of 9.98. Consensus recommendation rating is 2.2 (Buy) </p>\n\n<p>Earnings are Forecast to grow 101% per year. </p>\n\n<p>According to Simply WallSt. analyses, the stock is trading at 77.9% BELOW it&#39;s fair value. </p>\n\n<p>5) Catalysts</p>\n\n<p>A) A number of institutional investors have recently bought and sold shares of the business. Wells Fargo &amp; Company MN boosted its stake in Broadwind by 4,711.8% during the 4th quarter. Russell Investments Group Ltd. acquired a new position in Broadwind during the 4th quarter valued at about $1,263,000. THB Asset Management acquired a new position in Broadwind during the 4th quarter valued at about $1,695,000. Hussman Strategic Advisors Inc. acquired a new stake in shares of Broadwind in the 4th quarter worth approximately $525,000. Finally, Harel Insurance Investments &amp; Financial Services Ltd. acquired a new stake in shares of Broadwind in the 4th quarter worth approximately $128,000.</p>\n\n<p>B) Tax credits for wind projects in the U.S. were extended in 2020.</p>\n\n<p>&quot;In December 2019, the United States production tax credit for renewable wind projects was extended for one-year, pursuant to a year-end 2019 appropriations bill, from January 1, 2020 to January 1, 2021. As a result of the new legislation, the PTC will subsidize wind projects commenced as late as 2020 and completed by 2024, or later, if continuous construction can be demonstrated&quot;</p>\n\n<p>This had led to the company being &quot;nearly booked&quot; at full capacity for 2020 for wind tower sections which it reports as part of its &quot;heavy fabrications&quot; segment. The company is also at 35% of capacity for 2021, both data points from the November earnings call. Again, as noted above, even though the tax credit ends in a few weeks, per current legislation, projects have until 2024 to complete.</p>\n\n<p>6) Comparables</p>\n\n<p>NextEra Energy Partners Forward 1yr PE ratio: 33</p>\n\n<p>Atlantica Sustainable Infrastructure Forward 1yr PE Ratio: 25.54</p>\n\n<p>Broadwind Inc. Forward 1 yr PE Ratio: 16.3 </p>\n\n<p>Compared to its peers, BWEN could trade at more of a premium to its current valuation. </p>\n\n<p>----&gt; Potential Issues/Problems:</p>\n\n<p>Broadwind does have substantial net operating losses (NOLs) of around $14M</p>\n\n<p>Neither Broadwind&#39;s ability to cover its interest expense with its EBIT nor its level of total liabilities give confidence in its ability to take on more debt. </p>\n\n<p>Wind tower production is almost maxed out, this may cap earnings growth in 2021 without further expansion. </p>\n\n<p>---- Summary ----</p>\n\n<p>Broadwind is a well established clean tech and industrial manufacturing company with a diversfied presence in both renewables and natural gas/oil verticals. It has a solid management team backed by years of experience and prestigious educational qualifications. </p>\n\n<p>Based on an initial assessment of its fundamental metrics, the company appears undervalued with a potential 78% upside. The companies balance sheet remains strong and incoming revenues are significant  with consistent quarterly increases, which should help manage its notable debt.  Market sentiment is somewhat positive at this moment based on analyst price and recommendation consensus. </p>\n\n<p>Broadwind operates in what is likely to be a high growth industry, especially with the prospect of offshore wind in the coming years, and further favorable legislation behind wind and infrastructure projects. </p>\n\n<p>Broadwind appears inexpensive relative to the broader market and trades at a discount to other renewable companies. This could offer substantial futher upside if it matches potential peers. </p>\n\n<p>However, production is currently maxed out and pricing power is not apparent. As such, the next leg of price appreciation would be more reliant on re-rating of the valuation and further expansion, which does seem likely in the current market environment and enthusiasm for renewable energy firms.</p>\n\n<p>Disclosure: I am long BWEN. </p>\n\n<p>Disclaimer: I am not a financial advisor and this is not financial advice. The information contained within this post is solely based on my own opinions and research.</p>\n</div><!-- SC_ON -->",
  "score": 67,
  "permalink": "/r/investing/comments/ljdyk2/comprehensive_dd_on_broadwind_bwen_high_potential/",
  "subreddit": "investing",
  "id": "ljdyk2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728621135
}