{
  "author": "RusticBohemian",
  "original_created_utc": 1638815956,
  "title": "When and why did western generals and monarchs stop \"leading from the front,\" on the battlefield? Was this considered prudent or cowardly? Did they get flack for it?",
  "created_utc": 1638843880,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s easy to criticize conquerors who went to war for personal fame, glory, and spoils. But for all of Caesar&amp;#39;s, Alexander the Great&amp;#39;s, and Richard the Lionheart&amp;#39;s faults, you do have to give them some credit for putting their own lives on the line to accomplish their goals. Each could easily have died in combat. They always had skin in the game, even if the game wasn&amp;#39;t particularly moral. &lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;m curious how we evolved from the standard of the heroic general/monarch/emperor leading from the front, often at the head of a cavalry charge, to one who either stays behind the lines, directing the battle through messengers, or more recently, delegates battlefield command to subordinates while staying at a safe command post miles away, perhaps sending off telegrams or orders over radio when needed.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/raebi7/when_and_why_did_western_generals_and_monarchs/",
  "subreddit": "AskHistorians",
  "id": "raebi7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's easy to criticize conquerors who went to war for personal fame, glory, and\nspoils. But for all of Caesar's, Alexander the Great's, and Richard the\nLionheart's faults, you do have to give them some credit for putting their own\nlives on the line to accomplish their goals. Each could easily have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "個人的な名声や栄光のために戦争に行った征服者を批判するのは簡単なことです。\n戦利品です。しかし、シーザーやアレキサンダー大王、リチャード王は、そのすべてが\nライオンハートの欠点もあるが、自分の身をもって証明したことは評価できる。\n命をかけて目標を達成したのです。それぞれ、簡単に...",
      "title": "西洋の将軍や君主は、いつ、なぜ、戦場で「先頭に立つ」ことをやめたのか。それは賢明なことなのか、それとも臆病なことなのか。彼らはそのことで非難されたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "批评那些为了个人名声、荣耀和战利品而参战的征服者很容易。\n战利品。但是，对于凯撒、亚历山大大帝和狮心王理查德的所有缺点，你会发现他们都有一个共同的特点，那就是他们都有一个共同的目标。\n狮心王的所有缺点，你必须给他们一些荣誉，因为他们把自己的生命放在实现他们的目标上。\n他们将自己的生命置于危险之中，以实现他们的目标。每个人都可以很容易地...",
      "title": "西方的将军和君主何时以及为何停止在战场上 \"从正面领导\"？这被认为是谨慎的还是懦弱的？他们是否因此而受到抨击？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "批評那些爲了個人名聲、榮耀和戰利品而參戰的征服者很容易。\n戰利品。但是，對於凱撒、亞歷山大大帝和獅心王理查德的所有缺點，你會發現他們都有一個共同的特點，那就是他們都有一個共同的目標。\n獅心王的所有缺點，你必須給他們一些榮譽，因爲他們把自己的生命放在實現他們的目標上。\n他們將自己的生命置於危險之中，以實現他們的目標。每個人都可以很容易地...",
      "title": "西方的將軍和君主何時以及爲何停止在戰場上 \"從正面領導\"？這被認爲是謹慎的還是懦弱的？他們是否因此而受到抨擊？"
    }
  ]
}