{
  "author": "Zircillius",
  "original_created_utc": 1644413202,
  "title": "Obscene curse words were extraordinarily rare in American literature published before WWII, and nonexistent in pre-1960 studio films. Was cursing considered taboo in all segments of prewar society, or is this simply a result of puritanical censorship?",
  "created_utc": 1644426039,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have a hard time believing soldiers were yelling &amp;quot;golly gee!&amp;quot; in the trenches of WWI. But the writings of the era suggests that words like &amp;quot;fuck&amp;quot; and &amp;quot;shit&amp;quot; didn&amp;#39;t exist in any American or Brit&amp;#39;s vocabulary, no matter how unrefined their trade.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 128,
  "permalink": "/r/AskHistorians/comments/sodkmb/obscene_curse_words_were_extraordinarily_rare_in/",
  "subreddit": "AskHistorians",
  "id": "sodkmb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have a hard time believing soldiers were yelling \"golly gee!\" in the trenches\nof WWI. But the writings of the era suggests that words like \"fuck\" and \"shit\"\ndidn't exist in any American or Brit's vocabulary, no matter how unrefined their\ntrade.",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "塹壕の中で兵士が「ゴリーギャー！」と叫んでいたとは信じがたい。\n第一次世界大戦の しかし当時の文章を読むと \"fuck \"や \"shit \"といった言葉は\nアメリカ人やイギリス人の語彙には、どんなに地味でも存在しなかった。\nを取引しています。",
      "title": "第二次世界大戦前に出版されたアメリカ文学には卑猥な呪いの言葉は極めて少なく、1960年以前のスタジオ映画には存在しない。戦前の社会のあらゆる層で罵倒はタブー視されていたのか、それとも単に清教徒的な検閲の結果なのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很难相信士兵们会在一战的战壕里大喊 \"天哪！\"\n一战的战壕里。但那个时代的著作表明，像 \"他妈的 \"和 \"狗屎 \"这样的词在任何美国人或英国人的词汇中都是不存在的。\n在任何美国人或英国人的词汇中都不存在，无论他们的行业多么不讲究。\n贸易。",
      "title": "在二战前出版的美国文学作品中，淫秽的骂人话语异常罕见，在1960年前的制片厂电影中也不存在。在战前社会的所有阶层中，诅咒被认为是禁忌，还是这只是清教徒审查制度的结果？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很難相信士兵們會在一戰的戰壕裏大喊 \"天哪！\"\n一戰的戰壕裏。但那個時代的著作表明，像 \"他媽的 \"和 \"狗屎 \"這樣的詞在任何美國人或英國人的詞彙中都是不存在的。\n在任何美國人或英國人的詞彙中都不存在，無論他們的行業多麼不講究。\n貿易。",
      "title": "在二戰前出版的美國文學作品中，淫穢的罵人話語異常罕見，在1960年前的製片廠電影中也不存在。在戰前社會的所有階層中，詛咒被認爲是禁忌，還是這只是清教徒審查制度的結果？"
    }
  ]
}