{
  "author": "AskScienceModerator",
  "original_created_utc": 1645531213,
  "title": "AskScience AMA Series: We are Human Genetics Researchers from the University of Miami, Ask Us Anything about cutting-edge research techniques like CRISPR, advances in personalized genetic medicine, or just anything genetics!",
  "created_utc": 1645539475,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi &lt;a href=\"/r/askscience\"&gt;r/askscience&lt;/a&gt; and Reddit,&lt;/p&gt;\n\n&lt;p&gt;Thank you so much for your time and attention! We are scientists from the Department of Human Genetics at the University Of Miami Miller School Of Medicine. Our department is the 2nd largest recipient of NIH funding for Genetics Research, and we investigate a wide range diseases using the latest sequencing technology and other cutting-edge methods that have helped us understand the human genome in new and unexpected ways. From better understanding developmental conditions to improving personalized cancer treatments, the future of genetics is incredibly exciting and hopeful.&lt;/p&gt;\n\n&lt;p&gt;Please let us know any questions you have about the current state or future of genetic research or medicine (EXCEPT PERSONAL HEALTH QUESTIONS OR ADVICE), and we have 3 faculty who have volunteered their time to give their perspectives. Our department is committed to the paramount need for including diverse populations in genetic research, and we hope that engaging with everyone here will help us better connect with the communities we serve.&lt;/p&gt;\n\n&lt;p&gt;Here today starting at 3:30PM EST (20:30 UT) are three researchers from the University of Miami, ask us anything!&lt;/p&gt;\n\n&lt;p&gt;Username: &lt;a href=\"/u/IAmA_UMiamiGenetics\"&gt;/u/IAmA_UMiamiGenetics&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Dr Karen Nuytemans, PhD Bio:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Dr. Nuytemans is a Research Assistant Professor in the John P. Hussman Institute for Human Genomics and the Dr. John T. Macdonald Foundation Department of Human Genetics. She received her PhD from the University of Antwerp in Belgium after which she came to University of Miami, initially as a post-doctoral Fellow, before advancing to her current position. Her research focuses on the genetics of neurodegenerative brain disorders. She has extensive experience working with &amp;#39;big data&amp;#39; datasets including genotyping and next generation sequencing data, for the identification of common and rare genetic variants in disease. Dr. Nuytemans is specifically interested in Parkinson&amp;#39;s Disease (PD) as well as Dementia with Lewy Bodies (DLB) and Frontotemporal Dementia (FTD). Everyone, regardless of race, ethnicity, or socioeconomic status, should have access to personalized medicine. That is why including these disorders across diverse populations in genetic research is one of her main research foci.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Dr Susan Halloran Blanton, PhD Bio&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Dr. Blanton received her PhD in Human Genetics from Virginia Commonwealth University/Medical College of Virginia. She obtained post-doctoral training in Biostatistics (University of Pittsburgh) and Population Oncology (Fox Chase Cancer Center). Her primary research has focused on the mapping of genes for Mendelian and complex diseases; she has been instrumental in studies identifying over twenty genes/loci for Mendelian disorders. Stroke and the underlying genetics of its risk factors, deafness, retinal diseases, skeletal dysplasias, cleft lip/palate, and clubfoot are among the diseases which she currently studies. She collaborates with Drs. Sacco, Wright and Rundek to identify genetic factors influencing white matter and cognition and their relation to ageing. In addition, she has been involved in developing and implementing genetic education materials for Federal and appellate level judges and science writers in an ELSI sponsored project. Dr. Blanton is the Executive Director of the Hussman Institute for Human Genomics as well as the Associate Director of Communications and Compliance. She is an Associate Professor in the Dr. John T. Macdonald Foundation Department of Human Genetics.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Dr Michael Cuccaro, PhD Bio&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Michael L. Cuccaro, Ph.D., Director of the Patient and Family Ascertainment Division in the Center for Genomic Education and Outreach at the John P. Hussman Institute for Human Genomics, is a clinical psychologist who specializes in understanding the interplay between genetics and behavior across development. His work reflects this specialization with a focus on cognitive and behavioral disorders such as autism spectrum disorder, dementia, and intellectual disability. His research concentrates on the development of behavioral methods to construct and extend clinical phenotypes of individuals with these and related disorders to optimize gene discovery. Further, he is working to improve recruitment and enrollment strategies to broaden opportunities for underserved populations to participate in genetic research. In addition, as part of his involvement with the Genetics Pathway for medical students, Dr. Cuccaro is involved in studies of medical trainee and professional attitudes about the utility of genomic information in healthcare. Dr. Cuccaro is also an Associate Professor in the Dr. John T. Macdonald Foundation Department of Human Genetics and the Department of Psychology.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 124,
  "permalink": "/r/askscience/comments/sylwhg/askscience_ama_series_we_are_human_genetics/",
  "subreddit": "askscience",
  "id": "sylwhg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi r/askscience [/r/askscience] and Reddit,\n\nThank you so much for your time and attention! We are scientists from the\nDepartment of Human Genetics at the University Of Miami Miller School Of\nMedicine. Our department is the 2nd largest recipient of NIH funding for\nGenetics Research, and we…"
}