{
  "author": "ultron290196",
  "original_created_utc": 1630679855,
  "title": "Guess what my TV and Ethereum have in common? They're both 4k!",
  "created_utc": 1630701572,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Alright I know that joke was cringey. But I&#39;m happy to be able to make that joke again.</p>\n\n<p>Congratulations to all Ethereum holders. If you&#39;ve been holding since the last crash from 4k to 1700, you deserve to be back in the green!</p>\n\n<p>And if you bought the dip at 1700, congratulations and fuck you!</p>\n\n<p>What a day! No one thought the bull run would be back so soon.</p>\n\n<p>Time to see what the new all time high will be in this second phase of the bull run!</p>\n\n<p>But please don&#39;t FOMO now. If you didn&#39;t buy the dip, please don&#39;t buy at the highs and complain crypto is a ponzi scheme later. </p>\n\n<p>Mandatory Disclaimer: This is not financial advice!</p>\n</div><!-- SC_ON -->",
  "score": 196,
  "permalink": "/r/CryptoCurrency/comments/ph6fb0/guess_what_my_tv_and_ethereum_have_in_common/",
  "subreddit": "CryptoCurrency",
  "id": "ph6fb0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Alright I know that joke was cringey. But I'm happy to be able to make that joke\nagain.\n\nCongratulations to all Ethereum holders. If you've been holding since the last\ncrash from 4k to 1700, you deserve to be back in the green!\n\nAnd if you bought the dip at 1700, congratulations and fuck you!\n\nWhat…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "わかったよ、あのジョークが不愉快なのは。でも、またあのジョークを言えるようになったことを\nしています。\n\nイーサリアムをお持ちの皆様、おめでとうございます。前回の暴落からずっと保有している方は\n4kから1700までの暴落の後に保持していたなら、あなたは緑に戻る資格があります!\n\nそして、1700でディップを買った人は、おめでとう、そしてファックユー!\n\n何...",
      "title": "私のテレビとイーサリアムの共通点は何だと思いますか？両方とも4Kです!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，我知道这个笑话很令人厌恶。但我很高兴能够再次开这个玩笑。\n再一次。\n\n祝贺所有以太坊持有人。如果你从上次\n从4K到1700的暴跌后一直持有，你就应该回到绿色的环境中去！如果你在下跌时买入，那么你就应该回到绿色的环境中去。\n\n如果你在1700点的时候买入了跌停板，那么恭喜你，去你妈的!\n\n什么...",
      "title": "猜猜我的电视和以太坊有什么共同点？它们都是4k!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，我知道這個笑話很令人厭惡。但我很高興能夠再次開這個玩笑。\n再一次。\n\n祝賀所有以太坊持有人。如果你從上次\n從4K到1700的暴跌後一直持有，你就應該回到綠色的環境中去！如果你在下跌時買入，那麼你就應該回到綠色的環境中去。\n\n如果你在1700點的時候買入了跌停板，那麼恭喜你，去你媽的!\n\n什麼...",
      "title": "猜猜我的電視和以太坊有什麼共同點？它們都是4k!"
    }
  ]
}