{
  "author": "crushfetish",
  "the_new_excerpt": "100 Bitcoin were added to public channels of the Lightning Network just in the\npast 38 days, making it reach 1200 Bitcoins in total [https://1ml.com].\n\nWe are also seeing a lot of new nodes being added in the recent weeks,\ndisplaying strong growth of the network overall.\n\nMany major exchanges…",
  "original_created_utc": 1618045439,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ライトニングネットワークのパブリックチャンネルに、過去38日間で100ビットコインが追加されました。\n過去38日間で100ビットコインがライトニングネットワークのパブリックチャンネルに追加され、合計で1200ビットコインに達しました[https://1ml.com]。\n\nまた、ここ数週間で多くの新しいノードが追加されています。\nネットワーク全体の力強い成長を示しています。\n\n多くの主要な取引所...",
      "title": "過去38日間で100ビットコインがライトニングネットワークに追加された"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "100个比特币被添加到闪电网络的公共频道，就在。\n在过去的38天里，使得它的比特币总量达到了1200个[https://1ml.com]。\n\n我们也看到最近几周增加了很多新的节点。\n显示出网络整体的强劲增长。\n\n许多主要交易所...",
      "title": "过去38天就有100个比特币加入闪电网络。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "100個比特幣被添加到閃電網絡的公共頻道，就在。\n在過去的38天裏，使得它的比特幣總量達到了1200個[https://1ml.com]。\n\n我們也看到最近幾周增加了很多新的節點。\n顯示出網絡整體的強勁增長。\n\n許多主要交易所...",
      "title": "過去38天就有100個比特幣加入閃電網絡。"
    }
  ],
  "title": "100 Bitcoin added to the Lightning Network just in the past 38 days",
  "created_utc": 1618105943,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>100 Bitcoin were added to public channels of the Lightning Network just in the past 38 days, making it reach <a href=\"https://1ml.com\">1200 Bitcoins in total</a>.</p>\n\n<p>We are also seeing a lot of new nodes being added in the recent weeks, displaying strong growth of the network overall. </p>\n\n<p>Many <a href=\"https://github.com/theDavidCoen/LightningExchanges\">major exchanges</a> are starting to support lightning as well, the overall trend is clear - lightning is the future.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/Bitcoin/comments/mo1aa5/100_bitcoin_added_to_the_lightning_network_just/",
  "subreddit": "Bitcoin",
  "id": "mo1aa5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566611410
}