{
  "author": "Kiyoshimo",
  "original_created_utc": 1656436429,
  "title": "It's said that the Balkans were the economic center of the Ottoman Empire, with Anatolia being more marginally populated and less important economically - however, I've heard that it was the opposite with the Byzantines. What accounts for this change?",
  "created_utc": 1656478779,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Reposting this, cause it&amp;#39;s something I really wanna know about.&lt;/p&gt;\n\n&lt;p&gt;As far as I know, for many centuries the Balkans had been a marginally populated region of the Byzantine Empire, with a huge chunk of its manpower and economic activity happening in Anatolia. However, by the time of the Ottoman Empire, it seems this has been reversed - the Balkans were much more densely populated than Anatolia, and were some of the Empire&amp;#39;s richest provinces, with Anatolia seemingly languishing in comparison. How and why did this shift happen?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/vmsbo6/its_said_that_the_balkans_were_the_economic/",
  "subreddit": "AskHistorians",
  "id": "vmsbo6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Reposting this, cause it's something I really wanna know about.\n\nAs far as I know, for many centuries the Balkans had been a marginally populated\nregion of the Byzantine Empire, with a huge chunk of its manpower and economic\nactivity happening in Anatolia. However, by the time of the Ottoman…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "本当に知りたいことなので、再投稿します。\n\n私の知る限り、何世紀もの間、バルカン半島はビザンチン帝国のわずかな人口しかいない地域でした。\nビザンチン帝国のごく一部の地域であり、その労働力および経済活動の大部分は\nアナトリア地方で行われていた。しかし、オスマン帝国の時代になると、バルカン半島は...",
      "title": "オスマン帝国ではバルカン半島が経済の中心で、アナトリアは人口も少なく、経済的にも重要ではなかったと言われていますが、ビザンティン帝国ではその逆だったと聞いています。この変化の理由は何なのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "转贴这个，因为这是我真正想知道的事情。\n\n据我所知，许多世纪以来，巴尔干地区一直是拜占庭帝国的一个人口稀少的地区。\n的地区，而其大量的人力和经济活动都发生在安纳托利亚。\n的人力和经济活动都发生在安纳托利亚。然而，到了奥斯曼帝国的时候...",
      "title": "据说巴尔干地区是奥斯曼帝国的经济中心，安纳托利亚地区人口较少，经济上不太重要--然而，我听说拜占庭人的情况正好相反。这种变化的原因是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "轉貼這個，因爲這是我真正想知道的事情。\n\n據我所知，許多世紀以來，巴爾幹地區一直是拜占庭帝國的一個人口稀少的地區。\n的地區，而其大量的人力和經濟活動都發生在安納托利亞。\n的人力和經濟活動都發生在安納托利亞。然而，到了奧斯曼帝國的時候...",
      "title": "據說巴爾幹地區是奧斯曼帝國的經濟中心，安納托利亞地區人口較少，經濟上不太重要--然而，我聽說拜占庭人的情況正好相反。這種變化的原因是什麼？"
    }
  ]
}