{
  "author": "skkkra",
  "original_created_utc": 1637169923,
  "title": "Is it common for women not to finish when having sex with men?",
  "created_utc": 1637182403,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I (22F) have only been with one person who consistently made me finish during sex (ie. listened to what I wanted/needed to finish). All the other men I’ve been with have either not cared enough to make me finish, or flat out have refused to even try.</p>\n\n<p>I understand that your partner <em>should</em> try to make you finish, but I’m more so wondering how common it actually is. Do men generally care enough to make you finish, or is it not as common as I thought?</p>\n\n<p>I’m asking because I’ve had to dump a bunch of guys due to them being selfish in bed. Am I just shit at picking guys, or am I just statistically doomed to be with crappy partners??</p>\n\n<p>Edit: if it matters, I usually only get off from oral. I can cum from penetration if I use a clit vibrator during sex</p>\n\n<p>Edit 2: I’m also very good at communicating what I need in bed, so that’s not the issue</p>\n</div><!-- SC_ON -->",
  "score": 123,
  "permalink": "/r/NoStupidQuestions/comments/qw48to/is_it_common_for_women_not_to_finish_when_having/",
  "subreddit": "NoStupidQuestions",
  "id": "qw48to",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I (22F) have only been with one person who consistently made me finish during\nsex (ie. listened to what I wanted/needed to finish). All the other men I’ve\nbeen with have either not cared enough to make me finish, or flat out have\nrefused to even try.\n\nI understand that your partner should try to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私(22F)は、セックスの際に一貫して私をフィニッシュさせてくれた人とは一度しか付き合ったことがありません。\nしてくれた人は一人しかいません（つまり、私が何をしたいのか、何が必要なのかを聞いてくれた）。他のすべての男性は\n他のすべての男性は、私をフィニッシュさせるのに十分な気遣いをしないか、まったく努力しようとしませんでした。\nしようともしませんでした。\n\n私はあなたのパートナーが努力すべきであることを理解しています...",
      "title": "女性が男性とのセックスでフィニッシュしないのは普通のことですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（22岁）只和一个人在一起过，他一直让我在做爱时完成\n(即倾听我想要/需要完成的事情)。所有其他和我在一起的男人\n其他男人要么不关心我，不愿意让我完成，要么就直接拒绝尝试。\n甚至拒绝尝试。\n\n我明白，你的伴侣应该尝试...",
      "title": "女性在与男性发生性关系时不完成的情况是否很普遍？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（22歲）只和一個人在一起過，他一直讓我在做愛時完成\n(即傾聽我想要/需要完成的事情)。所有其他和我在一起的男人\n其他男人要麼不關心我，不願意讓我完成，要麼就直接拒絕嘗試。\n甚至拒絕嘗試。\n\n我明白，你的伴侶應該嘗試...",
      "title": "女性在與男性發生性關係時不完成的情況是否很普遍？"
    }
  ]
}