{
  "author": "doitrodiz",
  "the_new_excerpt": "How many \"experts\" and \"pros\" predicted this late Feb downturn? Momentum stocks\ngot crushed in the past 2 weeks. Tech been flat and almost all of them dropped\nafter earnings despite positive all-time-high earnings result.\n\nWhere were those fools in January? In early Feb? nowhere to be found.…",
  "original_created_utc": 1614400162,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "有多少 \"专家 \"和 \"专业人士 \"预测到了2月下旬的这次下跌？动量股\n在过去的2周里被碾压了。技术平平，几乎所有的人都掉了\n尽管业绩创历史新高，但盈利后。\n\n1月份的时候，那些傻瓜在哪里？2月初吗，无处可寻....。",
      "title": "每个外行和 \"专业人士 \"都在预测3月份会出现崩盘....，这正是它不会到来的原因。恐惧是唯一的泡沫"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有多少 \"專家 \"和 \"專業人士 \"預測到了2月下旬的這次下跌？動量股\n在過去的2周裏被碾壓了。技術平平，幾乎所有的人都掉了\n儘管業績創歷史新高，但盈利後。\n\n1月份的時候，那些傻瓜在哪裏？2月初嗎，無處可尋....。",
      "title": "每個外行和 \"專業人士 \"都在預測3月份會出現崩盤....，這正是它不會到來的原因。恐懼是唯一的泡沫"
    }
  ],
  "title": "Every amateurs and \"pros\" are predicting a crash in March.... and that's exactly why it won't come. Fear is the only bubble",
  "created_utc": 1614408353,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>How many &quot;experts&quot; and &quot;pros&quot; predicted this late Feb downturn? Momentum stocks got crushed in the past 2 weeks. Tech been flat and almost all of them dropped after earnings despite positive all-time-high earnings result.</p>\n\n<p>Where were those fools in January? In early Feb? nowhere to be found. Those idiots only came out after the bond yields already rose to ATH post-pandemic and now proclaim they &quot;saw it coming&quot;.</p>\n\n<p>What a joke. Now all of them are saying March gonna crash. I tell you that&#39;s exactly the reason March won&#39;t crash, instead, SPY will go into all time high in march, with tech/QQQ leading the recovery in equities prices.</p>\n\n<p>As i said before, the only bubble in today&#39;s market is fear. Fear is pumped up by media like CNBC to sell clicks and views. It&#39;s nothing but herd behavior at this point. Noobs and newbies and boomers got scared, led by the &quot;experts&quot; and &quot;pros&quot; who themselves don&#39;t know how the market would go.</p>\n</div><!-- SC_ON -->",
  "score": 576,
  "permalink": "/r/stocks/comments/ltg8h3/every_amateurs_and_pros_are_predicting_a_crash_in/",
  "subreddit": "stocks",
  "id": "ltg8h3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937742117
}