{
  "author": "xcryptogurux",
  "original_created_utc": 1638372966,
  "title": "Satoshi's indelible legacy is that he showed us you don't need to have money or influence or curry favor with the \"big club\" to change the world",
  "created_utc": 1638409114,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Satoshi identified the root of all evil in the world - a hierarchical monetary system predicated on trust. He then worked assiduously for two years to fix it. Once he did, he walked away, keenly cognizant of the imperative that the trustless revolution he set in motion did not itself suffer for a locus of trust.&lt;/p&gt;\n\n&lt;p&gt;Pace every great inventor, there has never been, in my humble opinion, a more inspirational, more impactful human endeavor, no less from someone we&amp;#39;ll never learn anything more of, save for what he allowed us to learn through his... Proof of Work.&lt;/p&gt;\n\n&lt;p&gt;Satoshi brought to the mainstream the high-minded cypherpunk ethos of judging every individual solely on the merits of their mind rather than mien.&lt;/p&gt;\n\n&lt;p&gt;As I today observe assorted rent-seeking affinity scams cynically exploit the rationally vulnerable by mischaracterizing blockchain for regulatory arbitrage, seeking to fob off fundamentally flawed, hideously centralized protocols as decentralized innovation through intellectually dishonest marketing &amp;amp; social engineering chicanery, I couldn&amp;#39;t help reflect on the irony that all this deceit was enabled by the greatest act of altruism from a man who never sought any investments or patents and never so much as made a dime from his invention - arguably the most seminal technological breakthrough in history.&lt;/p&gt;\n\n&lt;p&gt;It would seem we&amp;#39;re no wiser now than we were 20 years ago, when these rent-seekers usurped the internet - originally a decentralized P2P network protocol, just like Bitcoin.&lt;/p&gt;\n\n&lt;p&gt;Plus ça change, plus c&amp;#39;est la même chose.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 156,
  "permalink": "/r/Bitcoin/comments/r6hhq6/satoshis_indelible_legacy_is_that_he_showed_us/",
  "subreddit": "Bitcoin",
  "id": "r6hhq6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Satoshi identified the root of all evil in the world - a hierarchical monetary\nsystem predicated on trust. He then worked assiduously for two years to fix it.\nOnce he did, he walked away, keenly cognizant of the imperative that the\ntrustless revolution he set in motion did not itself suffer for a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サトシは、世界の諸悪の根源である階層的な通貨を特定しました。\n信頼に基づくシステム。そして、それを解決するために2年間、ひたすら努力した。\nそして、一旦修復が完了すると、彼はその場を立ち去りました。\n自分が仕掛けた無信頼革命が、そのために被害を受けることのないように......。",
      "title": "サトシの忘れられない遺産は、お金や影響力、ビッグクラブの顔色をうかがわなくても世界を変えることができることを教えてくれたことです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "中本聪确定了世界上所有邪恶的根源--以信任为前提的等级制货币体系。\n体系是以信任为前提的。然后他努力工作了两年来解决这个问题。\n一旦他做到了，他就离开了，他敏锐地认识到，他所掀起的无信任的革命不会因为他自己而受到影响。\n他所启动的无信任的革命本身不会因为......而受到影响。",
      "title": "中本聪不可磨灭的遗产是，他向我们展示了你不需要拥有金钱或影响力，也不需要讨好 \"大俱乐部 \"来改变世界。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "中本聰確定了世界上所有邪惡的根源--以信任爲前提的等級制貨幣體系。\n體系是以信任爲前提的。然後他努力工作了兩年來解決這個問題。\n一旦他做到了，他就離開了，他敏銳地認識到，他所掀起的無信任的革命不會因爲他自己而受到影響。\n他所啓動的無信任的革命本身不會因爲......而受到影響。",
      "title": "中本聰不可磨滅的遺產是，他向我們展示了你不需要擁有金錢或影響力，也不需要討好 \"大俱樂部 \"來改變世界。"
    }
  ]
}