{
  "author": "MaroneyOnAWindyDay",
  "the_new_excerpt": "If I was going to arrive in a foreign country, I’d try to gather as much\ninformation as I could, especially if I anticipated I’d be visiting a royal\ncourt as an ambassador. Was there any valuable information about Japan and China\nat this time that they could have brought along?",
  "original_created_utc": 1620135748,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "外国に行くときは、できるだけ多くの情報を集めようとする。\n特に大使として王宮を訪れることが予想される場合は、できるだけ多くの情報を集めようとする。\n特に、大使として宮廷を訪れることが予想される場合には。当時の日本や中国に関する貴重な情報があれば\n当時の日本や中国に関する貴重な情報はあったのだろうか。",
      "title": "コロンブスは、日本、中国、インドへの到着を予想して、言語的、文化的な準備をしたのだろうか？辞書やガイドブック、儀礼的な贈り物などを持参したのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我即将到达一个外国，我会尽量收集更多的信息\n尽可能多的信息，特别是如果我预计我将作为大使访问一个皇室。\n廷作为大使。此时是否有关于日本和中国的任何有价值的信息\n有任何关于日本和中国的有价值的信息，他们可以带上这些信息吗？",
      "title": "哥伦布在语言上或文化上是否为他预计到达日本、中国或印度做了准备？他们是否带来了任何字典、指南书、仪式性的礼物等？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我即將到達一個外國，我會盡量收集更多的信息\n儘可能多的信息，特別是如果我預計我將作爲大使訪問一個皇室。\n廷作爲大使。此時是否有關於日本和中國的任何有價值的信息\n有任何關於日本和中國的有價值的信息，他們可以帶上這些信息嗎？",
      "title": "哥倫布在語言上或文化上是否爲他預計到達日本、中國或印度做了準備？他們是否帶來了任何字典、指南書、儀式性的禮物等？"
    }
  ],
  "title": "Did Columbus prepare linguistically or culturally for his anticipated arrival in Japan, China, or India? Did they bring any dictionaries, guidebooks, ceremonial gifts, etc.?",
  "created_utc": 1620148776,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If I was going to arrive in a foreign country, I’d try to gather as much information as I could, especially if I anticipated I’d be visiting a royal court as an ambassador. Was there any valuable information about Japan and China at this time that they could have brought along?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/n4omew/did_columbus_prepare_linguistically_or_culturally/",
  "subreddit": "AskHistorians",
  "id": "n4omew",
  "is_self": true,
  "media": null,
  "is_video": false
}