{
  "author": "yunggod6966",
  "original_created_utc": 1633215074,
  "title": "post a coin and we roast it #3",
  "created_utc": 1633232003,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Its back. Post a coin and we roast it. Shitposters alliance. Gotta get those moons. Hopefully you came up with some original shit. This will be fun. I purposely waited a little while so it didn&#39;t get played out and old. I know I&#39;m rambling on but I got a character limit to meet. Usually these blow up quite a bit so if you&#39;re early to the roast and post some zingers you might be able to rack up a few hundred or thousand moons. \nHope everyone is pumped for the distribution tommorow\n This is a good chance for you to rack up some new moons for the next distribution\nIf you haven&#39;t voted yet in the governance polls go ahead and do that please you will get extra moons and you help support our awesome community!</p>\n\n<p>Edit:\nThis is just for fun and to allow people to have some perspective it can kind of be an echo chamber in here otherwise</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/CryptoCurrency/comments/q05aep/post_a_coin_and_we_roast_it_3/",
  "subreddit": "CryptoCurrency",
  "id": "q05aep",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Its back. Post a coin and we roast it. Shitposters alliance. Gotta get those\nmoons. Hopefully you came up with some original shit. This will be fun. I\npurposely waited a little while so it didn't get played out and old. I know I'm\nrambling on but I got a character limit to meet. Usually these blow…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "復活 コインを投稿して、それをローストします。クソポスタ同盟。ムーンを手に入れよう\nムーンを手に入れよう。願わくば、何かオリジナルなことを考えてほしい。これは楽しいぞ。I\nわざと少し時間をおいて、古くならないようにしました。私は私のことを\n文字数制限がありますので 通常、このようなことは...",
      "title": "コインを置いておけばローストしてくれる #3"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "它回来了。发布一个硬币，我们把它烤熟。粪便张贴者联盟。必须得到那些\n月亮。希望你能想出一些原创的东西。这将是有趣的。I\n我特意等了一会儿，这样它就不会被玩坏和变老。我知道我在\n我知道我在胡言乱语，但我有一个角色限制要满足。通常情况下，这些吹...",
      "title": "发布一个硬币，我们烤了它#3"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "它回來了。發佈一個硬幣，我們把它烤熟。糞便張貼者聯盟。必須得到那些\n月亮。希望你能想出一些原創的東西。這將是有趣的。I\n我特意等了一會兒，這樣它就不會被玩壞和變老。我知道我在\n我知道我在胡言亂語，但我有一個角色限制要滿足。通常情況下，這些吹...",
      "title": "發佈一個硬幣，我們烤了它#3"
    }
  ]
}