{
  "author": "EarbudScreen",
  "the_new_excerpt": "Disclaimer: Turn away if you believe that BABA is going to be broken up because\nMa hurt some feelings over Ant.\n\nI personally discredit claims that BABA is in significant danger due to Ma's\ncomments. Ant was dramatically overleveraged, and regulators stepped in to\nprevent a…",
  "original_created_utc": 1614546434,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "免责声明：如果你相信BABA会被拆散，请转身离开，因为。\n马云为了蚂蚁伤了一些感情。\n\n我个人不相信因为马云的原因，BABA有重大危险的说法。\n评论。蚂蚁的杠杆率急剧过高，监管部门介入了\n防止...",
      "title": "阿里巴巴（BABA）的价值被严重低估了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "免責聲明：如果你相信BABA會被拆散，請轉身離開，因爲。\n馬雲爲了螞蟻傷了一些感情。\n\n我個人不相信因爲馬雲的原因，BABA有重大危險的說法。\n評論。螞蟻的槓桿率急劇過高，監管部門介入了\n防止...",
      "title": "阿里巴巴（BABA）的價值被嚴重低估了"
    }
  ],
  "title": "Alibaba (BABA) is Criminally Undervalued",
  "created_utc": 1614567251,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Disclaimer: Turn away if you believe that BABA is going to be broken up because Ma hurt some feelings over Ant.</p>\n\n<p>I personally discredit claims that BABA is in significant danger due to Ma&#39;s comments. Ant was dramatically overleveraged, and regulators  stepped in to prevent a collapse. <a href=\"https://www.techbuzzchina.com/newsletter/signup/extra-buzz-19-ant-group-the-biggest-ipo-that-wasnt?fbclid=IwAR3T9V0ThoGj3W-vS3e-TCZJ1wpyKXJkmBZoUXLYeMBIpBcaMy1COgw2Qbs\">https://www.techbuzzchina.com/newsletter/signup/extra-buzz-19-ant-group-the-biggest-ipo-that-wasnt?fbclid=IwAR3T9V0ThoGj3W-vS3e-TCZJ1wpyKXJkmBZoUXLYeMBIpBcaMy1COgw2Qbs</a></p>\n\n<p>Now to BABA, they trade at 27 times earnings. Coca Cola, the trusty dividend company, trades at 28 times earnings. Forward PE is even more egregious. BABA has sturdy competition in its retail business from Pinduoduo and JD, but BABA operates a platform with ancillary tools to keep merchants there, giving staying power. BABA is the leader in the transition to cloud (47% in 2019 according to Canalys). BABA is the inversed Amazon in terms of profitability. BABA makes money from their retail platform, doesn&#39;t get into the weeds, and is currently sacrificing profitability for market share in cloud.</p>\n\n<p>Furthermore, BABA has stakes in a wide range of logistics and consumer service companies. Even after appropriately discounting ADR and BABA being a Chinese company, to me it&#39;s criminally undervalued trading at a lower multiple than companies like KO while having clear future growth. Would love to hear how BABA deserves this low multiple.</p>\n\n<p>TLDR: BABA has growth in cloud, even after writing off their retail growth, with stakes in many companies, acting as a counterweight to the giant Tencent, all while trading at a lower multiple than companies like KO.</p>\n\n<p>Position: 3 shares at $246 (sad college kid noises)</p>\n\n<p>Edit: KO is a comparison to show low the market is pricing BABA&#39;s future growth.</p>\n\n<p><a href=\"https://www.wsj.com/market-data/quotes/BABA?mod=searchresults_companyquotes\">https://www.wsj.com/market-data/quotes/BABA?mod=searchresults_companyquotes</a></p>\n\n<p><a href=\"https://www.notboring.co/p/baba-black-sheep\">https://www.notboring.co/p/baba-black-sheep</a></p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/stocks/comments/luqi56/alibaba_baba_is_criminally_undervalued/",
  "subreddit": "stocks",
  "id": "luqi56",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937743289
}