{
  "author": "vitingo",
  "original_created_utc": 1654609446,
  "title": "Why did the US keep Puerto Rico?",
  "created_utc": 1654663767,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In 1918, Congress granted US citizenship to Puerto Ricans. The popular explanation for this event was that is was a way to recruit soldiers for WWI. Nevertheless, there is evidence that the act was a way to quell the growing sympathy for independence. Congress at the time must have foreseen that granting citizenship would lock Puerto Rico into territorial status indefinitely, since independence would become unpopular for Puerto Ricans as it meant loss of US citizenship, and at the same time Congress would have no motive to ever grant statehood. The military stategy explanation seems unconvincing. If the Navy wanted a base in the eastern Caribbean, Congress could just as easily have granted independence while keeping a base, like it did in Cuba. Sugar interests are perhaps a better explanation, since the territorial status meant that Puerto Rican sugar was not subject to US tariffs and US refineries therefore had a source of sugar that was somewhat cheaper than the international market. Nevertheless, Puerto Rico at its peak sugar production could only produce about a fifth of Cuba&amp;#39;s output, and Cuba also had special tariff treatment. So, to those of you who are acquainted with primary sources, is there a definitive reason why the US kept Puerto Rico?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/v6vy3c/why_did_the_us_keep_puerto_rico/",
  "subreddit": "AskHistorians",
  "id": "v6vy3c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In 1918, Congress granted US citizenship to Puerto Ricans. The popular\nexplanation for this event was that is was a way to recruit soldiers for WWI.\nNevertheless, there is evidence that the act was a way to quell the growing\nsympathy for independence. Congress at the time must have foreseen that…"
}