{
  "author": "vitingo",
  "original_created_utc": 1654609446,
  "title": "Why did the US keep Puerto Rico?",
  "created_utc": 1654663767,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In 1918, Congress granted US citizenship to Puerto Ricans. The popular explanation for this event was that is was a way to recruit soldiers for WWI. Nevertheless, there is evidence that the act was a way to quell the growing sympathy for independence. Congress at the time must have foreseen that granting citizenship would lock Puerto Rico into territorial status indefinitely, since independence would become unpopular for Puerto Ricans as it meant loss of US citizenship, and at the same time Congress would have no motive to ever grant statehood. The military stategy explanation seems unconvincing. If the Navy wanted a base in the eastern Caribbean, Congress could just as easily have granted independence while keeping a base, like it did in Cuba. Sugar interests are perhaps a better explanation, since the territorial status meant that Puerto Rican sugar was not subject to US tariffs and US refineries therefore had a source of sugar that was somewhat cheaper than the international market. Nevertheless, Puerto Rico at its peak sugar production could only produce about a fifth of Cuba&amp;#39;s output, and Cuba also had special tariff treatment. So, to those of you who are acquainted with primary sources, is there a definitive reason why the US kept Puerto Rico?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/v6vy3c/why_did_the_us_keep_puerto_rico/",
  "subreddit": "AskHistorians",
  "id": "v6vy3c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In 1918, Congress granted US citizenship to Puerto Ricans. The popular\nexplanation for this event was that is was a way to recruit soldiers for WWI.\nNevertheless, there is evidence that the act was a way to quell the growing\nsympathy for independence. Congress at the time must have foreseen that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1918年、米国議会はプエルトリコ人に米国籍を付与した。この出来事について、一般的に\nこの出来事について、一般的には第一次世界大戦のための兵士を募集するためのものだと説明されている。\nしかし、この法律は、独立を求める声が高まるのを抑えるためのものであったという証拠もある。\nという説もある。当時のアメリカ議会は、このような事態を予見していたのだろう。",
      "title": "アメリカはなぜプエルトリコを残したのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "1918年，国会授予波多黎各人美国公民身份。流行的解释是\n对这一事件的流行解释是，这是一种为一战招募士兵的方式。\n然而，有证据表明，该法案是一种平息日益增长的独立情绪的方式。\n对独立的同情心。当时的国会一定预见到了...",
      "title": "美国为什么要保留波多黎各？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "1918年，國會授予波多黎各人美國公民身份。流行的解釋是\n對這一事件的流行解釋是，這是一種爲一戰招募士兵的方式。\n然而，有證據表明，該法案是一種平息日益增長的獨立情緒的方式。\n對獨立的同情心。當時的國會一定預見到了...",
      "title": "美國爲什麼要保留波多黎各？"
    }
  ]
}