{
  "author": "adrianb52",
  "original_created_utc": 1635474271,
  "title": "An app that reveals trends for every city in the world, on a whole new level",
  "created_utc": 1635534034,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I spent years developing this huge app to reveal trends for every city in the world, using data that&#39;s never been seen before.</p>\n\n<p>The app is based on place geofences, which do not exist anywhere in the world, and are created within this app by the community.</p>\n\n<p>Imagine hundreds of thousands of people answering questions within thousands of places, with near 100% accuracy. What kind of data would we retrieve?</p>\n\n<p><strong>What is this app for?</strong></p>\n\n<p>This app is primarily for entertainment.</p>\n\n<p>The important thing is that this hasn&#39;t been done before, and the data hasn&#39;t been created, before.</p>\n\n<p>With hundreds of thousands of 93% to 97% accurate poll answers, we can just find cool and interesting things about cities.</p>\n\n<p>The image below illustrates the concept. I will create a video later on.</p>\n\n<p><a href=\"https://preview.redd.it/05zylvpz2bw71.png?width=3058&amp;format=png&amp;auto=webp&amp;s=2c6946bc09df8e4f8f195845c509138507a19dbe\">https://preview.redd.it/05zylvpz2bw71.png?width=3058&amp;format=png&amp;auto=webp&amp;s=2c6946bc09df8e4f8f195845c509138507a19dbe</a></p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/qi2jug/an_app_that_reveals_trends_for_every_city_in_the/",
  "subreddit": "SideProject",
  "id": "qi2jug",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I spent years developing this huge app to reveal trends for every city in the\nworld, using data that's never been seen before.\n\nThe app is based on place geofences, which do not exist anywhere in the world,\nand are created within this app by the community.\n\nImagine hundreds of thousands of people…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これまでにないデータを使って、世界中のあらゆる都市のトレンドを明らかにするために、何年もかけてこの巨大なアプリを開発しました。\n今までにないデータを使って、世界のあらゆる都市のトレンドを明らかにするために、何年もかけてこの巨大なアプリを開発しました。\n\nこのアプリは、世界のどこにも存在しない「場所のジオフェンス」に基づいています。\nこのアプリは、世界中のどこにも存在しない「場所のジオフェンス」をベースにしており、このアプリの中でコミュニティが作成します。\n\n想像してみてください、何十万人もの人々が...。",
      "title": "世界のあらゆる都市のトレンドを、まったく新しいレベルで明らかにするアプリ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我花了几年时间开发这个巨大的应用程序，以揭示世界上每个城市的趋势。\n使用以前从未见过的数据，揭示世界上每个城市的趋势。\n\n这个应用程序是基于地方性的地理围栏，它在世界任何地方都不存在。\n它是由社区在这个应用程序中创建的。\n\n想象一下，成千上万的人...",
      "title": "一个揭示世界上每个城市的趋势的应用程序，在一个全新的水平上。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我花了幾年時間開發這個巨大的應用程序，以揭示世界上每個城市的趨勢。\n使用以前從未見過的數據，揭示世界上每個城市的趨勢。\n\n這個應用程序是基於地方性的地理圍欄，它在世界任何地方都不存在。\n它是由社區在這個應用程序中創建的。\n\n想象一下，成千上萬的人...",
      "title": "一個揭示世界上每個城市的趨勢的應用程序，在一個全新的水平上。"
    }
  ]
}