{
  "author": "Tuimel",
  "original_created_utc": 1636526457,
  "title": "2x can make a big difference",
  "created_utc": 1636536663,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Many stories here are about 10x or 100x your money. But even a simple 2x can make a huge difference. </p>\n\n<p>My parents weren&#39;t rich. They had big debts, I never learned to save money for a back-up. At an age of 28 I saved my first 1K. I was so proud.</p>\n\n<p>Now I&#39;m 29 and for the first time in my life I have 5K on my bankaccount as a back-up (I live in Europe for perspective, rich country so this is not much). </p>\n\n<p>Also crypto gave me a 2x on my investments last year as well. 2x... in one year! Those are insane gains for me. To have a decent back-up gave me peace in my mind. From every 2x or more, I will take out my initial investments to pay off my student debts. Crypto is really a change for my financial state. Am I careful? Yes, maybe too much. But I am not in for big lambo&#39;s. I just want to have a nice family and no financial worries. Yep, that would be nice. And a 2x will already helps with that.</p>\n\n<p>Edit: this blew up. Thank you all for the amazing reactions. I try to answer everyone, but it can take some time.</p>\n</div><!-- SC_ON -->",
  "score": 340,
  "permalink": "/r/CryptoCurrency/comments/qqo72h/2x_can_make_a_big_difference/",
  "subreddit": "CryptoCurrency",
  "id": "qqo72h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Many stories here are about 10x or 100x your money. But even a simple 2x can\nmake a huge difference.\n\nMy parents weren't rich. They had big debts, I never learned to save money for a\nback-up. At an age of 28 I saved my first 1K. I was so proud.\n\nNow I'm 29 and for the first time in my life I have 5K…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここでは、10倍、100倍という話が多いですね。しかし、単純な2倍でも大きな違いがあります。\n大きな違いがあります。\n\n私の両親はお金持ちではありませんでした。大きな借金があったので、私は予備のためにお金を貯めることを学びませんでした。\nバックアップのためにお金を貯めることを学びませんでした。28歳のとき、私は初めて1,000ドルを貯めました。とても誇らしかったです。\n\n今、私は29歳ですが、人生で初めて5Kを手にしました。",
      "title": "2xは大きな変化をもたらす"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这里的许多故事是关于你的钱的10倍或100倍。但即使是简单的2倍也能\n带来巨大的变化。\n\n我的父母并不富有。他们有大笔的债务，我从来没有学会存钱做后备。\n后盾。在28岁的时候，我存下了我的第一笔1千美元。我当时非常自豪。\n\n现在我29岁了，这是我人生中第一次有5千块钱......",
      "title": "2倍可以产生巨大的差异"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏的許多故事是關於你的錢的10倍或100倍。但即使是簡單的2倍也能\n帶來巨大的變化。\n\n我的父母並不富有。他們有大筆的債務，我從來沒有學會存錢做後備。\n後盾。在28歲的時候，我存下了我的第一筆1千美元。我當時非常自豪。\n\n現在我29歲了，這是我人生中第一次有5千塊錢......",
      "title": "2倍可以產生巨大的差異"
    }
  ]
}