{
  "author": "mcpoyles",
  "original_created_utc": 1637703959,
  "title": "In your opinion what are the most exciting NFT game projects out there?",
  "created_utc": 1637710821,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In my opinion, NFTs that are built to be used in games and the &quot;metaverse&quot; is going to change everything. Imagine buying a pair of limited edition Jordans that comes with a 1/1000 NFT that could be ported into Roblox or whatever game exists in the future. It&#39;s going to be wild! </p>\n\n<p>That&#39;s why I have my eye on companies like &quot;the sandbox&quot; who are building a Roblox-like game with land and possessions. I think those are going to be what stays a few years from now. Not to say that high-end artwork like BAYC don&#39;t have their place. But all these derivatives after that won&#39;t have the same staying power.</p>\n\n<p><strong>My question to you all is what NFT projects out there look closer to gamification?</strong></p>\n\n<p>My shortlist:</p>\n\n<p><a href=\"https://www.sandbox.game/en/\">The Sandbox Game</a></p>\n\n<p><a href=\"https://8bitpet.com\">8bitpet.com</a> (Tomagatchi game)</p>\n\n<p><a href=\"https://axieinfinity.com/\">Axie</a></p>\n</div><!-- SC_ON -->",
  "score": 303,
  "permalink": "/r/CryptoCurrency/comments/r0o5ow/in_your_opinion_what_are_the_most_exciting_nft/",
  "subreddit": "CryptoCurrency",
  "id": "r0o5ow",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In my opinion, NFTs that are built to be used in games and the \"metaverse\" is\ngoing to change everything. Imagine buying a pair of limited edition Jordans\nthat comes with a 1/1000 NFT that could be ported into Roblox or whatever game\nexists in the future. It's going to be wild!\n\nThat's why I have my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の意見では、ゲームや「メタバース」で使われることを前提に作られたNFTは\n全てを変えてしまうと思います。1/1000のNFTを搭載した限定版のジョーダンを買って\n1/1000のNFTを搭載した限定版のジョーダンを買って、それをRobloxや将来存在するあらゆるゲームに移植することができると想像してみてください。\n限定版のジョーダンを買うことを想像してみてください。ワイルドになりますよね。\n\nだからこそ、私は自分の...",
      "title": "あなたの意見では、最もエキサイティングなNFTゲームプロジェクトは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我看来，为了在游戏和 \"元空间 \"中使用而建立的NFTs将改变一切。\n将会改变一切。想象一下，购买一双限量版乔丹鞋\n这双鞋带有1/1000的NFT，可以被移植到Roblox或任何未来的游戏中。\n或任何未来存在的游戏。这将是很疯狂的!\n\n这就是为什么我有我的...",
      "title": "在您看来，目前最令人兴奋的NFT游戏项目是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我看來，爲了在遊戲和 \"元空間 \"中使用而建立的NFTs將改變一切。\n將會改變一切。想象一下，購買一雙限量版喬丹鞋\n這雙鞋帶有1/1000的NFT，可以被移植到Roblox或任何未來的遊戲中。\n或任何未來存在的遊戲。這將是很瘋狂的!\n\n這就是爲什麼我有我的...",
      "title": "在您看來，目前最令人興奮的NFT遊戲項目是什麼？"
    }
  ]
}