{
  "author": "omgitsbrad",
  "the_new_excerpt": "I just spent 2 weeks moving money out of a big financial institution and into my\ncrypto brokerage. 2 weeks. Wire transfer fees, limits, and processing times.\nThen, 24 hours into a wire something is flagged due to \"suspicious activity.\"\nCool, I get it, and I appreciate the security. But phone calls…",
  "original_created_utc": 1622424756,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2週間かけて、大手金融機関から私の暗号ブローカーに資金を移したところです。\n暗号化された証券会社にお金を移しました。2週間。電信送金の手数料、限度額、処理時間。\nそして24時間後には \"不審な行動 \"のために 何かがフラグを立てます。\nわかった、セキュリティには感謝している。しかし、電話は...",
      "title": "暗号金融システムは超現実的で別世界のもの"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚花了2周时间把钱从一个大型金融机构转移到我的\n晶体货币经纪公司。2个星期。电汇费用，限制，和处理时间。\n然后，在电汇的24小时内，由于 \"可疑活动\"，一些东西被标记出来。\n酷，我明白了，我很欣赏这种安全性。但是电话...",
      "title": "加密货币金融系统是超现实的，是另一个世界的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛花了2周時間把錢從一個大型金融機構轉移到我的\n晶體貨幣經紀公司。2個星期。電匯費用，限制，和處理時間。\n然後，在電匯的24小時內，由於 \"可疑活動\"，一些東西被標記出來。\n酷，我明白了，我很欣賞這種安全性。但是電話...",
      "title": "加密貨幣金融系統是超現實的，是另一個世界的。"
    }
  ],
  "title": "The crypto finance system is surreal and other worldly",
  "created_utc": 1622444727,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just spent 2 weeks moving money out of a big financial institution and into my crypto brokerage. 2 weeks. Wire transfer fees, limits, and processing times. Then, 24 hours into a wire something is flagged due to &quot;suspicious activity.&quot; Cool, I get it, and I appreciate the security. But phone calls and wasted time isn&#39;t necessary - give me 2FA and IP Whitelisting and call it a day. </p>\n\n<p>Finally go all my fiat moved, and I&#39;ve been DCAing into my positions all week. </p>\n\n<p>I decided to take a sum, convert to stablecoin, and move to an interest bearing account as a portion of my portfolio. It literally took me 5 minutes to convert fiat to stablecoin, enter and approve the withdraw address (2FA and IP whitelist), and for the blockchain to confirm and for the transfer to settle. 5 minutes. </p>\n\n<p>5 minutes versus days.</p>\n\n<p>Traditional finance doesn&#39;t have a chance. I&#39;m done with traditional finance, and I&#39;m all in for the future of blockchain powered financial systems and services. </p>\n\n<p>&#x200B;</p>\n\n<p>This is the future, there is zero doubt. It&#39;s like discovering fire. Can&#39;t put that genie back in the bottle.</p>\n</div><!-- SC_ON -->",
  "score": 683,
  "permalink": "/r/CryptoCurrency/comments/nopehf/the_crypto_finance_system_is_surreal_and_other/",
  "subreddit": "CryptoCurrency",
  "id": "nopehf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804297919
}