{
  "author": "Thementalistt",
  "the_new_excerpt": "We’ve seen it with GME and now AMC as well as others.\n\nI’m wondering if anyone has started to develop a strategy to see where the hive\nmind goes next. Not saying it’s smart money by any means.\n\nBut it’s definitely fast money if we can start figuring out how and why those\nidiots are choosing the…",
  "original_created_utc": 1623301668,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それはGMEやAMCなどでも見られました。\n\n蜂の巣が次にどこへ行くのか、誰か戦略を立て始めていないだろうか。\n心が次にどこへ行くのか、誰か戦略を立て始めていないだろうか。決してスマートマネーだとは言いません。\n\nしかし、彼らがどのようにして、そしてなぜそうなったのかを理解することができれば、間違いなく速いお金になります。\n選んでいるのかを知ることができれば、間違いなく即金です。",
      "title": "ミームストックが新しいトレンドになっている中で、次の「イット」ストックを検出するための良い戦略を見つけた人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们已经在GME和现在的AMC以及其他公司看到了这一点。\n\n我在想，是否有人已经开始制定战略，看看蜂巢式思维的下一步是什么？\n心中的下一个目标。不是说这是聪明的钱。\n\n但如果我们能开始弄清楚那些白痴是如何和为什么选择的，这绝对是快钱。\n白痴是如何以及为什么选择...",
      "title": "随着备忘录股票成为新的趋势，我想知道是否有人找到了检测下一个 \"它 \"股票的好策略？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們已經在GME和現在的AMC以及其他公司看到了這一點。\n\n我在想，是否有人已經開始制定戰略，看看蜂巢式思維的下一步是什麼？\n心中的下一個目標。不是說這是聰明的錢。\n\n但如果我們能開始弄清楚那些白癡是如何和爲什麼選擇的，這絕對是快錢。\n白癡是如何以及爲什麼選擇...",
      "title": "隨着備忘錄股票成爲新的趨勢，我想知道是否有人找到了檢測下一個 \"它 \"股票的好策略？"
    }
  ],
  "title": "With meme stocks becoming the new trend, I’m wondering if anyone has found a good strategy to detecting the next “it” stock?",
  "created_utc": 1623353416,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We’ve seen it with GME and now AMC as well as others. </p>\n\n<p>I’m wondering if anyone has started to develop a strategy to see where the hive mind goes next. Not saying it’s smart money by any means. </p>\n\n<p>But it’s definitely fast money if we can start figuring out how and why those idiots are choosing the stocks they do. </p>\n\n<p>Not saying this runs over (cause honestly any level headed thinking I used to have regarding the market is out the fucking window), but if it is I’d like to hop on board the next irrational “moon” or whatever bullshit you wanna call it. </p>\n\n<p>So now I’m here because I think the people on this sub are smart enough to figure out the next pop. </p>\n\n<p>Any ideas?</p>\n</div><!-- SC_ON -->",
  "score": 44,
  "permalink": "/r/stocks/comments/nwflpo/with_meme_stocks_becoming_the_new_trend_im/",
  "subreddit": "stocks",
  "id": "nwflpo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009743440
}