{
  "author": "lannistargaryen",
  "original_created_utc": 1652551521,
  "title": "How do you fight Historical Revisionism?",
  "created_utc": 1652564214,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello, I am from the Philippines and I am very concerned about historical revisionism.&lt;/p&gt;\n\n&lt;p&gt;Just a background, we recently held our elections and the person who won was the son of the late dictator Ferdinand Marcos.&lt;/p&gt;\n\n&lt;p&gt;Now I am not a historian myself, but all I know is that he stole around 10 billion USD in his time as president while also killing and torturing thousands of people when he declared Martial Law. I didn’t have second thoughts about it because… why would I doubt history?&lt;/p&gt;\n\n&lt;p&gt;Don’t take my word for it, but I believe one of the reasons he won is disinformation. Tiktok, Facebook, and Youtube was used to give alternative views on history - such as them being framed, them being rich prior to joining politics, but most importantly the Marcos Era being referred to as a golden era in the Philippines.&lt;/p&gt;\n\n&lt;p&gt;Right now there are news circulating that some books pertaining to Martial Law should be banned. &lt;/p&gt;\n\n&lt;p&gt;I participated in fact-checking and fighting disinformation during the campaign season but it seems like the alternative history has already prevailed. It’s concerning that a lot people now refer to TikTok and other platforms for their sources of history, and banning these books will validate all of that. Not to mention, Sara Duterte, daughter of current president Rodrigo Duterte, has been appointed as the Secretary for the department of Education and they are planning to tell the  “real” history. &lt;/p&gt;\n\n&lt;p&gt;Sorry for the long block of text but main question is \n-   How do we even fight this? \n-   How can we convince people that anecdotes from their relatives aren’t enough to invalidate the atrocities that happened to other people?\n-   How do you respond to people saying “history is written by the victors” as an argument that history is inaccurate?&lt;/p&gt;\n\n&lt;p&gt;If this is post is too political, I’m sorry. I’m just really concerned for my countrymen.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/AskHistorians/comments/upmtgb/how_do_you_fight_historical_revisionism/",
  "subreddit": "AskHistorians",
  "id": "upmtgb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hello, I am from the Philippines and I am very concerned about historical\nrevisionism.\n\nJust a background, we recently held our elections and the person who won was the\nson of the late dictator Ferdinand Marcos.\n\nNow I am not a historian myself, but all I know is that he stole around 10\nbillion USD…"
}