{
  "author": "Sandrokz",
  "the_new_excerpt": "It happened. Hundreds of users are reporting they received either an email or a\ntext message regarding a new launch - obviously it is a scam! Celsius\nacknowledged the problem on Twitter and we are now waiting for more infos. Funds\nare safe at the moment, but the data leak is inevitable now,…",
  "original_created_utc": 1618424977,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "発生しました。何百人ものユーザーが、新製品に関するメールやテキストメッセージを受け取ったと報告しています。\nこれは明らかに詐欺です。Celsius\nはTwitterで問題を認めており、さらなる情報を待っているところです。ファンド\n現時点では安全ですが、データの流出は避けられません...。",
      "title": "セルシオがデータ流出！会員のメールや電話番号が流出したぞ。新しいウェブ・ウォレットの開設に関するメールやテキストを受け取った方は、絶対に開かないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "它发生了。数百名用户报告他们收到了一封电子邮件或一个\n关于新产品发布的短信--显然是个骗局! 摄氏\n在Twitter上承认了这个问题，我们现在正在等待更多的信息。基金\n目前是安全的，但数据泄露是不可避免的了，... ...",
      "title": "Celsius刚刚发生了数据泄露事件，会员的邮件和电话号码都被泄露了。如果你收到了关于推出新的网络钱包的邮件或短信，请不要打开它!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "它發生了。數百名用戶報告他們收到了一封電子郵件或一個\n關於新產品發佈的短信--顯然是個騙局! 攝氏\n在Twitter上承認了這個問題，我們現在正在等待更多的信息。基金\n目前是安全的，但數據泄露是不可避免的了，... ...",
      "title": "Celsius剛剛發生了數據泄露事件，會員的郵件和電話號碼都被泄露了。如果你收到了關於推出新的網絡錢包的郵件或短信，請不要打開它!"
    }
  ],
  "title": "Celsius just got a data breach, emails and phone numbers of its members got leaked. If you received and email or a text regarding the launch of a new Web Wallet, please, do not open it!",
  "created_utc": 1618443832,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It happened. Hundreds of users are reporting they received either an email or a text message regarding a new launch - obviously it is a scam! Celsius acknowledged the problem on Twitter and we are now waiting for more infos. Funds are safe at the moment, but the data leak is inevitable now, especially the phone numbers sucks (happened to me...).</p>\n\n<p>Kinda sad, I guess it’s part of the risk...\n(I would add photos, but automod would block me)</p>\n\n<p>UPDATE: the scam address has now over $220K of value from scams...\nAddress: 0x3810B8FA44C368b9fCe7308700649dB2B9350490</p>\n</div><!-- SC_ON -->",
  "score": 331,
  "permalink": "/r/CryptoCurrency/comments/mqwrvp/celsius_just_got_a_data_breach_emails_and_phone/",
  "subreddit": "CryptoCurrency",
  "id": "mqwrvp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566616776
}