{
  "author": "thekaarlis",
  "original_created_utc": 1639438234,
  "title": "The longer you are in the game, the more apathetic you get during these dips, which is good",
  "created_utc": 1639450293,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have been holding for some time now and I have noticed that with each dip, crash, correction, or whatever you want to call it, I become more uncaring. Like with everything in life, crypto is not always rainbows and sunshine as it may seem. During times like these, you gotta remember all the talk about crypto volatility - it is mentioned and warned for a reason.&lt;/p&gt;\n\n&lt;p&gt;A year ago, Bitcoin was around 20k, which is more than a 140% increase right now. Not to mention all those crazy altcoin gains in the thousands of percent. While I can&amp;#39;t blame newcomers for feeling the panic, these gains are astronomical elsewhere when investing, but greed gets to all of us.&lt;/p&gt;\n\n&lt;p&gt;I just want to remind everyone reading this that the addiction of watching the charts too much or simply just caring about the market each day is unhealthy. When your favourite coins are bleeding and it seems to be the end of the world, it might be a good idea to find a new hobby or activity to occupy your mind. Literally, no one will remember this &amp;quot;dip&amp;quot; in a year or two. Do your own research, DCA in solid projects you believe in, and call your mom. As the black knight once said: &amp;quot;&amp;#39;Tis but a scratch&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 425,
  "permalink": "/r/CryptoCurrency/comments/rftebt/the_longer_you_are_in_the_game_the_more_apathetic/",
  "subreddit": "CryptoCurrency",
  "id": "rftebt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have been holding for some time now and I have noticed that with each dip,\ncrash, correction, or whatever you want to call it, I become more uncaring. Like\nwith everything in life, crypto is not always rainbows and sunshine as it may\nseem. During times like these, you gotta remember all the talk…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はしばらく前からホールドしていますが、ディップのたびに気づきました。\n暴落、調整、どんな呼び方でもいいのですが、私はより無頓着になります。同じように\n暗号は必ずしも虹と太陽のようなものではありません。\nと思われます。このような時、あなたはすべての話を覚えている必要があります...",
      "title": "ゲームを長く続けていると、このような落ち込みの時に無気力になることがありますが、これは良いことです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经持有一段时间了，我注意到每次下跌。\n崩溃、修正，或者你想怎么称呼它，我都会变得更加无所谓。就像\n与生活中的一切一样，加密货币并不总是彩虹和阳光，因为它可能是\n看起来那样。在这样的时候，你必须记住所有的谈话...",
      "title": "你在游戏中的时间越长，你在这些低谷中就越冷漠，这很好。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經持有一段時間了，我注意到每次下跌。\n崩潰、修正，或者你想怎麼稱呼它，我都會變得更加無所謂。就像\n與生活中的一切一樣，加密貨幣並不總是彩虹和陽光，因爲它可能是\n看起來那樣。在這樣的時候，你必須記住所有的談話...",
      "title": "你在遊戲中的時間越長，你在這些低谷中就越冷漠，這很好。"
    }
  ]
}