{
  "author": "whatiwritestays",
  "the_new_excerpt": "You might think you’ll remember what you bought X coin for yesterday. After all,\nit’s one of your first crypto moves! How could you forget?!\n\nYou. Will. Forget.\n\nAnd and will lose track of what you have, what you bought it for and when you\nbought it. Even swaps and conversions; yes you are not…",
  "original_created_utc": 1618864768,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日、何のために○○コインを買ったか、覚えているだろうと思うかもしれません。何しろ\nそれはあなたの最初の暗号化された動きの1つです! 忘れるわけがないでしょう！？\n\nあなた。忘れる。忘れてしまう。\n\nそして、何を持っているのか、何のために買ったのか、いつ買ったのかを見失ってしまいます。\n買ったのか。スワップやコンバージョンも、そうですね。",
      "title": "初心者のためのヒント：すべての取引を記録すること"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你可能会认为你会记得你昨天买了X币是多少钱。毕竟。\n这是你的第一个加密行动之一! 你怎么能忘记呢？\n\n你会... 会忘记的 忘记。\n\n你会忘记你有什么，你买它的目的，以及你什么时候买的\n买了它。甚至是交换和改装；是的，你不...",
      "title": "给初学者的建议：记录所有的交易。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你可能會認爲你會記得你昨天買了X幣是多少錢。畢竟。\n這是你的第一個加密行動之一! 你怎麼能忘記呢？\n\n你會... 會忘記的 忘記。\n\n你會忘記你有什麼，你買它的目的，以及你什麼時候買的\n買了它。甚至是交換和改裝；是的，你不...",
      "title": "給初學者的建議：記錄所有的交易。"
    }
  ],
  "title": "Pro tip for beginners: keep track of ALL your transactions",
  "created_utc": 1618885068,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You might think you’ll remember what you bought X coin for yesterday. After all, it’s one of your first crypto moves! How could you forget?! </p>\n\n<p>You. Will. Forget.</p>\n\n<p>And and <strong>will</strong> lose track of what you have, what you bought it for and when you bought it. Even swaps and conversions; yes you are not buying or selling but it’s still important to keep track of <em>everything</em>.</p>\n\n<p>Don’t be a fool like me who didn’t track most things in the first month. </p>\n\n<p><strong>At bear minimum</strong> use a portfolio tracker like Blockfolio. There are tons so find one that you like and start logging <strong>everything</strong> you do. For convenience, some trackers allow you to sync accounts for automatic tracking. Blockfolio allows this for Binance, among others. </p>\n\n<p><strong>At best</strong> log everything in your own excel sheet. Yes it’s annoying and cumbersome, especially if you aren’t familiar with excel. But it’s 100% worth it, and you’ll learn some basic excel to boot! </p>\n\n<p>Keep track of you doings and goings in this market. You’ll thank yourself later for the lack of oversight you managed to avoid.</p>\n</div><!-- SC_ON -->",
  "score": 439,
  "permalink": "/r/CryptoCurrency/comments/mu9z9j/pro_tip_for_beginners_keep_track_of_all_your/",
  "subreddit": "CryptoCurrency",
  "id": "mu9z9j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171521490
}