{
  "author": "-TrustyDwarf-",
  "original_created_utc": 1634041019,
  "title": "Why hide things? Privacy matters if you want mass adoption.",
  "created_utc": 1634059854,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p>why hide things?</p>\n</blockquote>\n\n<p><strong>Price manipulation</strong>: Sofia is the only mechanic in a small town. One of her customers paid for an oil change with Bitcoin. Sofia later looked up his address on the ledger and saw that the customer&#39;s wallet contained enough Bitcoin for a new Lamborghini. Next time he needed a repair, she doubled her prices.</p>\n\n<p><strong>Financial surveillance</strong>: Oleg&#39;s parents send him some Bitcoin to pay for textbooks, then continue to snoop on his Bitcoin address and activity. A few months later, Oleg sends some leftover Bitcoin to the public donation address for an organization that does not align with his parents&#39; political views. He does not realize that they are still monitoring his Bitcoin activity until he receives a furious email from his parents, berating him.</p>\n\n<p><strong>Supply chain privacy</strong>: Kyung-seok owns a small business providing family catering services for local events. A large food company uses blockchain tracing to identify most of his regular clients. The corporation uses this list to contact Kyung-seok&#39;s customers, offering similar deals for 5% less.</p>\n\n<p><strong>Discrimination</strong>: Ramona finds her dream apartment, conveniently close to her new job in a great neighborhood. Every month, she promptly pays her rent in Bitcoin. However the landlord notices that some of the payments track back to a legal online casino. The landlord personally despises gambling, and unexpectedly chooses to not renew Ramona&#39;s lease.</p>\n\n<p><strong>Transaction security/privacy</strong>: Sven sells a guitar to a stranger, and gives the buyer a Bitcoin address from his long-term savings wallet. The buyer checks the blockchain, sees the large sum of money that Sven has saved up, and consequently robs him at gunpoint.</p>\n\n<p><strong>Tainted coins</strong>: Loki sells some of his artwork online to save up for college. When he pays tuition, he is shocked to receive a “payment INVALID” error from the school. Unbeknownst to Loki, one of his paintings was purchased using some Bitcoin that was stolen during an exchange hack the previous year. Since the school rejects any payment from a blacklist of “tainted” Bitcoins, they refuse to mark the bill “paid.” Loki is in an extremely difficult position: the Bitcoin that he saved has already been transferred out of his account, yet the tuition bill is still unpaid.</p>\n\n<p>(excerpt from a <a href=\"https://masteringmonero.com/\">wonderful</a> <a href=\"https://github.com/monerobook/monerobook/blob/master/LICENSES.md\">free</a> <a href=\"https://masteringmonero.com/\">book</a> with some edits)</p>\n\n<p>(replace &quot;Bitcoin&quot; with your favorite coin that doesn&#39;t value its user&#39;s privacy)</p>\n</div><!-- SC_ON -->",
  "score": 171,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/2V9sC8bTzqLx2Ge60WzduY_xJI2o0dcaVqqrd6nLNWg.jpg?auto=webp&s=f26d48b624600013f06f9143f034b122cfa0642f",
          "width": 635,
          "height": 547
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/2V9sC8bTzqLx2Ge60WzduY_xJI2o0dcaVqqrd6nLNWg.jpg?width=108&crop=smart&auto=webp&s=6224a0d26f273f58c68974bb602de9ea7c8f7ee8",
            "width": 108,
            "height": 93
          },
          {
            "url": "https://external-preview.redd.it/2V9sC8bTzqLx2Ge60WzduY_xJI2o0dcaVqqrd6nLNWg.jpg?width=216&crop=smart&auto=webp&s=f34b4c4f30653ccb65c672fc14d270e1e08bc83a",
            "width": 216,
            "height": 186
          },
          {
            "url": "https://external-preview.redd.it/2V9sC8bTzqLx2Ge60WzduY_xJI2o0dcaVqqrd6nLNWg.jpg?width=320&crop=smart&auto=webp&s=828e83f6a5a540d6169c36eb154ea5ec63862e16",
            "width": 320,
            "height": 275
          }
        ],
        "variants": {},
        "id": "o1N-UsvuWiwqN8KzBgcXh35pJkE3msbppfsRAvZC5B4"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/q6kuop/why_hide_things_privacy_matters_if_you_want_mass/",
  "subreddit": "CryptoCurrency",
  "id": "q6kuop",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "> why hide things?\n\nPrice manipulation: Sofia is the only mechanic in a small town. One of her\ncustomers paid for an oil change with Bitcoin. Sofia later looked up his address\non the ledger and saw that the customer's wallet contained enough Bitcoin for a\nnew Lamborghini. Next time he needed a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "> なぜ隠すのか？\n\n価格操作。ソフィアは小さな町で唯一のメカニックです。彼女の顧客の一人が\nビットコインでオイル交換の代金を支払ってくれました。後日、ソフィアは台帳でその顧客のアドレス\nのアドレスを調べてみると、その顧客のウォレットにはランボルギーニの新車が買えるだけのビットコインが入っていた。\nランボルギーニの新車が買えるほどのビットコインが財布に入っていました。次にオイル交換が必要になったときには...",
      "title": "なぜ隠すのか？大量に採用したいのであれば、プライバシーは重要です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "> 为什么要隐藏东西？\n\n价格操纵。索菲亚是一个小镇上唯一的机械师。她的一个\n她的一个客户用比特币支付了换油费用。索菲亚后来在账本上查到他的地址\n他的地址，发现客户的钱包里有足够的比特币来购买一个\n新的兰博基尼。下次他需要...",
      "title": "为什么要隐藏东西？如果你想大规模收养，隐私很重要。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> 爲什麼要隱藏東西？\n\n價格操縱。索菲亞是一個小鎮上唯一的機械師。她的一個\n她的一個客戶用比特幣支付了換油費用。索菲亞後來在賬本上查到他的地址\n他的地址，發現客戶的錢包裏有足夠的比特幣來購買一個\n新的蘭博基尼。下次他需要...",
      "title": "爲什麼要隱藏東西？如果你想大規模收養，隱私很重要。"
    }
  ]
}