{
  "author": "phantom-warlord",
  "the_new_excerpt": "Its because people are stupidly buying cryptocurrencies based on hype with\nlittle to no research. Dogecoin?? Really? Downvote me for all i care but\ndogecoin is a shit coin, it is years behind the majorly developed coins like\nethereum. I can name you 10 other coins whos value is shit. So if you made…",
  "original_created_utc": 1621351689,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それは、人々が愚かにも、ほとんど調査もせずに誇大広告に基づいて暗号通貨を購入しているからです。\nしています。Dogecoin？本当に？どうでもいいけど、Downvote me\ndogecoinはクソコインです 主要な開発されたコインに比べて 何年も遅れています\nイーサリアムのような主要な開発されたコインから何年も遅れています。他にも10種類のコインがありますが、どれも価値がありません。だから、もしあなたが...",
      "title": "なぜほとんどの暗号投資家がお金を失うのか、疑問に思っていませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是因为人们愚蠢地购买了基于炒作的加密货币。\n几乎没有研究。狗币？真的吗？我只想给我投一票，但\ndogecoin是一个狗屎币，它比主要开发的币种如\n以太坊。我可以告诉你其他10个价值低下的硬币。所以，如果你做了...",
      "title": "你是否想知道为什么大多数加密货币投资者会赔钱？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是因爲人們愚蠢地購買了基於炒作的加密貨幣。\n幾乎沒有研究。狗幣？真的嗎？我只想給我投一票，但\ndogecoin是一個狗屎幣，它比主要開發的幣種如\n以太坊。我可以告訴你其他10個價值低下的硬幣。所以，如果你做了...",
      "title": "你是否想知道爲什麼大多數加密貨幣投資者會賠錢？"
    }
  ],
  "title": "Are you wondering why most crypto investors lose money??",
  "created_utc": 1621367164,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Its because people are stupidly buying cryptocurrencies based on hype with little to no research. Dogecoin?? Really? Downvote me for all i care but dogecoin is a shit coin, it is years behind the majorly developed coins like ethereum. I can name you 10 other coins whos value is shit. So if you made money on it, good for you. But if you want to last in the cryptocurrency investment sphere, you need get the fuck out of that position. Look at every bullrun we had the past 7 years, and check the highest market cap coins during those bullruns. 80% of them failed. </p>\n\n<p>Remember, emotions are you enemy in any investment sphere. If the coin you hold have little to no development and no good institutional backing. GTFO of that position. Dont hold it cause you think it will &quot;moon&quot; for no apperent reason.</p>\n\n<p>Take tenx for example, the company ditched everyone and closed shop, yet their coins rose during the bullrun we had the past months. Does that make any sense? A company which does not exist anymore had its tokens rise double their already worthless value?</p>\n\n<p>Sure, buy some shit coins, just remember that its a gamble. With odds close to winning a lottery. Do you really want to YOLO a majority of your savings on a lottery?</p>\n\n<p>Why not invest in Crypto market in a way that reduces your risk, increases your return and help reduce the amount of shit coins that keeps killing every novice crypto investor?</p>\n\n<hr/>\n\n<p>To make it clear, when you invest, you want to create a diversified protfolio with the highest RISK adjusted return. Does that make sense?? </p>\n\n<p>= So, to all the would be crypto investors. You need to follow the fundamental investing strategies, to help protect your capital while you grow it. If that is not your goal, you should just hit the casino. Some games have better odds than investing in shit coins.</p>\n\n<p>1) build a diversified portfolio. Diversified means the lowest correlated assets possible.</p>\n\n<p>2) choose your portfolio allocation based on your acceptable risk. I personally would not accept to lose more than 40% of my portfolio, even if i stand to gain more than a 100%. Because if i lose my capital, then am out of the whole investment game in the first place.</p>\n\n<p>Example: 25% crypto with high development rate and high partnership acquisition rate, 25% stable coins generating 8%~, 25% real estate or reits with low mortgage securities generating 4%~, and 25% in dividend aristicrats generating 2%~.\nSuch a portfolio would cap your drawdawn (expected maximum unrealised loss) risk at 30% or 40%. But will theoretically have unlimited maximum gain. </p>\n\n<p>3) choose your assets based on real world data. Financials, risk metrics, management team, history, development rate, partnership rate, community engagement, etc etc. Not on hype. </p>\n\n<p>I can go on and write a huge post explaining how to really invest. Not gamble. And i still wont scratch the surface. BUT, If you dont learn how to invest money, EVEN IF YOU MAKE 10 MILLION, you will lose it as fast as you make it. I need you to understand that.</p>\n\n<p>So start by investing coins and assets that carry high intrinsic value (read, not dogecoin), as mentioned in point 3, start by doing those. And make sure you apply point 1 if you dont want to lose 70% of your portfolio value by sticking to cryptocurrencies only.</p>\n</div><!-- SC_ON -->",
  "score": 719,
  "permalink": "/r/CryptoCurrency/comments/nfdmcd/are_you_wondering_why_most_crypto_investors_lose/",
  "subreddit": "CryptoCurrency",
  "id": "nfdmcd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590801353
}