{
  "author": "NC4Life078",
  "original_created_utc": 1630161418,
  "title": "Unlink your bank account from your Exchange!",
  "created_utc": 1630179033,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This might be a “No shit Sherlock” to some, but I never thought about it until now. The other day, many people here got the message from Coinbase saying “Your 2FA has been changed”.</p>\n\n<p>Obviously we all thought we were getting sim swapped/ hacked or what have you, and my first thought was “Ha suckers, my crypto is in a cold wallet!”</p>\n\n<p>But…. That’s when I had my epiphany. What is stopping a hacker from buying new crypto using your linked bank account and sending that to their wallet?</p>\n\n<p>I’m going to guess nothing seeing as with about 10 taps it works just like that.</p>\n\n<p>So this message goes out to you, who has no reason to have your bank account linked to an exchange 100% of the time! </p>\n\n<h1>Unlink it otherwise risk losing all the money in your bank account!</h1>\n\n<p>Edit: I’m watching this post, and the fact that people are purposefully downvoting something meant to protect others should be ashamed of themselves.</p>\n\n<p>Edit 2: this may not apply to everyone, but, everyone doesn’t use the same banks and exchanges. And for those who say “it’s insured”, even if it is, waking up and having no money in your bank account is a pretty big deal; even if you get it back, it can cause a lot of unnecessary trouble (not being able to pay for food, gas and bills) even if it’s not stolen.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/pdawjf/unlink_your_bank_account_from_your_exchange/",
  "subreddit": "CryptoCurrency",
  "id": "pdawjf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This might be a “No shit Sherlock” to some, but I never thought about it until\nnow. The other day, many people here got the message from Coinbase saying “Your\n2FA has been changed”.\n\nObviously we all thought we were getting sim swapped/ hacked or what have you,\nand my first thought was “Ha suckers,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、ある人にとっては「No shit Sherlock」かもしれませんが、私は今まで考えたこともありませんでした。\n今まで考えたこともありませんでした。先日、多くの人がCoinbaseから「あなたの2FAは変更されました」というメッセージを受け取りました。\n2FAが変更されました」というメッセージを受け取りました。\n\n明らかに、私たちは皆、SIMスワップやハッキングなどの被害に遭っていると思っていました。\n私が最初に思ったのは、「Ha suckers,...」でした。",
      "title": "銀行口座とExchangeのリンクを解除しよう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对一些人来说，这可能是 \"不靠谱的夏洛克\"，但我从未想过这个问题，直到现在。\n现在才想到。有一天，这里的许多人收到Coinbase的信息，说 \"您的\n2FA已被更改\"。\n\n很明显，我们都认为我们被换了SIM卡/被黑了，或者其他什么。\n我的第一个想法是 \"哈，笨蛋，...",
      "title": "解除你的银行账户与你的交易所之间的联系!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對一些人來說，這可能是 \"不靠譜的夏洛克\"，但我從未想過這個問題，直到現在。\n現在纔想到。有一天，這裏的許多人收到Coinbase的信息，說 \"您的\n2FA已被更改\"。\n\n很明顯，我們都認爲我們被換了SIM卡/被黑了，或者其他什麼。\n我的第一個想法是 \"哈，笨蛋，...",
      "title": "解除你的銀行賬戶與你的交易所之間的聯繫!"
    }
  ]
}