{
  "author": "holyshithead",
  "original_created_utc": 1624666481,
  "title": "Day 1 Of buying Crypto Instead Of Cigarettes! Who Wants To Join In On The Fun!?",
  "created_utc": 1624678606,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I got to thinking about how much I really spend on cigarettes and how much better that money would be spent on crypto. I&#39;m tired of feeling shitty all the time. If I&#39;m going to be rich someday, I want to be healthy enough to enjoy it. Hell, even if I lose some money in the process, that&#39;s still better than spending it on cigarettes. So I&#39;ve decided to start a DCA challenge for myself, and if anybody else wants to join me I would welcome the company. This will be my official Day 1 of choosing to buy crypto with the money I would&#39;ve spent on a pack of cigs. For me that&#39;s $6.27. Every other time I&#39;ve tried to quit, I failed, so why not involve some other people in the process for a little accountability. I bought a couple packs this morning, and my plan is just to stretch them out as long as I can and then not buy any more. Here goes! SO WHO&#39;S WITH M-- <em>cough cough cough</em>....... I SAID WHO&#39;S W-- <em>cough cough cough cough cough</em>.......... Ok let&#39;s do this...</p>\n</div><!-- SC_ON -->",
  "score": 971,
  "permalink": "/r/CryptoCurrency/comments/o7zwr0/day_1_of_buying_crypto_instead_of_cigarettes_who/",
  "subreddit": "CryptoCurrency",
  "id": "o7zwr0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I got to thinking about how much I really spend on cigarettes and how much\nbetter that money would be spent on crypto. I'm tired of feeling shitty all the\ntime. If I'm going to be rich someday, I want to be healthy enough to enjoy it.\nHell, even if I lose some money in the process, that's still…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで私は、タバコにどれだけのお金を使っているのか、そのお金を暗号に使った方がどれだけいいのかを考えました。\nそのお金を暗号に使った方がどれだけいいかを考えました。いつもくだらない気分でいることに疲れました。\n疲れました。いつかお金持ちになるのなら、それを楽しめるだけの健康を手に入れたい。\nたとえその過程でお金を失ったとしても、それは...。",
      "title": "タバコの代わりにCryptoを購入して1日目 誰か一緒に楽しみませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我开始思考我到底花了多少钱在香烟上，以及这些钱花在加密货币上会有多好。\n这些钱花在加密货币上会更好。我已经厌倦了一直以来的糟糕感觉。\n时的感觉。如果我有一天要发财，我希望能有足够的健康来享受它。\n该死的，即使我在这个过程中损失一些钱，那也是...",
      "title": "购买加密货币而不是香烟的第一天! 谁想加入这个行列！？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我開始思考我到底花了多少錢在香菸上，以及這些錢花在加密貨幣上會有多好。\n這些錢花在加密貨幣上會更好。我已經厭倦了一直以來的糟糕感覺。\n時的感覺。如果我有一天要發財，我希望能有足夠的健康來享受它。\n該死的，即使我在這個過程中損失一些錢，那也是...",
      "title": "購買加密貨幣而不是香菸的第一天! 誰想加入這個行列！？"
    }
  ]
}