{
  "author": "mark_able_jones_",
  "the_new_excerpt": "Today on r/Dogecoin [/r/Dogecoin] a user posted a video of himself: he sat in a\nchair, his head concealed by a pillow case, a black revolver pressed to his\ntemple. He ranted about the lies surrounding Dogecoin and said he planned to\nkill himself. All I know is that he lived long enough to post the…",
  "original_created_utc": 1618703394,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、r/Dogecoin [/r/Dogecoin]では、あるユーザーが自分自身のビデオを投稿しました。\n椅子に座り、ピローケースで頭を隠し、こめかみに黒いリボルバーを押し当てています。\nの動画を投稿しました。彼はDogecoinにまつわる嘘をわめき散らし、Dogecoinを殺すつもりだと言いました。\n自殺するつもりだと言っていました。私が知っているのは、彼がこのビデオを投稿するまで生きていたということだけです。",
      "title": "Dogecoinで火傷しないために"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天在r/Dogecoin[/r/Dogecoin]上，一位用户发布了一段自己的视频：他坐在一个。\n椅子上，他的头被枕套遮住了，一把黑色的左轮手枪压在他的头上\n寺庙。他对围绕着Dogecoin的谎言大加挞伐，并表示他计划在。\n自杀。我只知道他活了很久，足以让他把... ...",
      "title": "不要被Dogecoin烧毁了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天在r/Dogecoin[/r/Dogecoin]上，一位用戶發佈了一段自己的視頻：他坐在一個。\n椅子上，他的頭被枕套遮住了，一把黑色的左輪手槍壓在他的頭上\n寺廟。他對圍繞着Dogecoin的謊言大加撻伐，並表示他計劃在。\n自殺。我只知道他活了很久，足以讓他把... ...",
      "title": "不要被Dogecoin燒燬了。"
    }
  ],
  "title": "Don’t get burned with Dogecoin",
  "created_utc": 1618713943,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Today on <a href=\"/r/Dogecoin\">r/Dogecoin</a> a user posted a video of himself: he sat in a chair, his head concealed by a pillow case, a black revolver pressed to his temple. He ranted about the lies surrounding Dogecoin and said he planned to kill himself. All I know is that he lived long enough to post the video. It was quickly removed by mods. </p>\n\n<p>So, before you buy Dogecoin, you should know what you are getting. Here’s a short summary:</p>\n\n<p>Dogecoin has a huge supply. 129 billion coins. 10,000 coins are mined per minute. That’s 14 million new coins added to the supply every day, which adds up to about 1 billion coins added every eighty days. </p>\n\n<p>Bitcoin has a maximum supply of 21 million coins. So, Dogecoin mints more coins every two days than Bitcoin will ever have in circulation. That’s why doge will never be priced like Bitcoin. And, in fact, at about $9 per Dogecoin, Dogecoin would equal Bitcoin in value. </p>\n\n<p>Dogecoin has no real ecosystem to make it valuable. It is not fast: 33 transactions per second. ETH 2.0 can handle 100,000 per second. So Dogecoin can’t serve as a currency. It seems to have minimum dev work. And it’s fueled by people who think they are getting into doge early. If you buy now, you are not. Dogecoin is not the future of anything. </p>\n\n<p>With Dogecoin, you are buying hype. </p>\n\n<p>And hype might push Dogecoin to 69 cents. Maybe to $1...but there is zero reason for doge to hold that value. In fact, at $1 per Dogecoin, with 1 billion coins added every 80 days, doge would need $1 billion in new investment every few months JUST TO MAINTAIN $1.00 </p>\n\n<p>Also, be aware that $129 billion (doge at $1) is a huge market cap. That’s the same value as STARBUCKS. And doge has almost zero use-case scenarios. Sure you can buy some Mavs merch. Maybe find some occasional doge fans that accept it as payment. But doge can’t scale to be a currency. It’s too slow. </p>\n\n<p>Doge, frankly, is way overpriced right now. And Doge is going to have trouble maintaining it’s value due to its always-expanding supply. If the hype falls off just a bit—doge will fall, too. And twitter’s algorithm is heavily weighted against repeat trends. You might make money with doge, but it is far from guaranteed, and there is a fairly hard ceiling due to doge’s constant supply. </p>\n\n<p>If you buy doge, you are buying hype and Elon Musk tweet energy and nothing else. </p>\n\n<p>Be careful.</p>\n</div><!-- SC_ON -->",
  "score": 12198,
  "permalink": "/r/CryptoCurrency/comments/mt1xzi/dont_get_burned_with_dogecoin/",
  "subreddit": "CryptoCurrency",
  "id": "mt1xzi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171519550
}