{
  "author": "Set1Less",
  "original_created_utc": 1626722634,
  "title": "There is a strong possibility of a long bear market. Beware of holding too many altcoins, many of them will just die. A lot of 2017 'favourites' are not even mentioned today.",
  "created_utc": 1626788422,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The price action on BTC has been rather week since the May crash, and many traders now feel that we are entering a strong bear period. Different targets are being discussed for the bottom, some feel it would be 25k some 15k and some think it may go even lower. </p>\n\n<p>While BTC plays out, many would also be holding altcoins through this bear run. While alts are great during a bull run, during a BTC bear cycle they are some of the worst assets to hold. </p>\n\n<p>During the 2017 bull run too, many favourite altcoins emerged that were shilled here relentlessly. Today you will not find anyone talking about them, and possibly the team / coin has folded too. Some examples are Request Network, Power ledger, Substratum, Vertcoin, Groestlecoin, Waltcon chain, Dash, Qtum, Bytecoin, Omise Go, Ardor, Game Credits, Stratis, Dragon Chain, KIN, Factom etc. These coins also had a huge following back in 2017 bull run. Many were expecting these coins to &quot;change the world&quot;. Daily&#39;s from 2017 and 2018 were filled with mentions of these conis. Some of these coins were notorious and there were massive threads full of shills trying to explain how a chain would take over the world and change businesses for good. </p>\n\n<p>Ultimately, most of these coins had to fold either due to lack of funds, lack of planning, or just a soft exit scam where the team kinda go MIA during a 2 year bear run. The soft exit scam is the most common and least effort one - in crypto, the developers have to develop something, but they can always say they tried and failed. On to the next one. Tough luck! There are no legal contracts in place that force the devs to deliver anything for you, the token holder. </p>\n\n<p>In this 2020-21 bull run, there are way more altcoins. Many of them clearly struggle for even a single use case. The story with most altcoins is that the devs use them to raise funds,  come up with a list of promises and then abandon them. The IDO/IEO culture has resulted in thousands of fund raises for just copy cat projects that dont have any viable future. Many of the swaps and DEX we have now wont be around in just 2 years from now. The tokens associated with them will be worth nothing. </p>\n\n<p>Of course, some of the promising alts will be available for dirt cheap prices during the bear market and have a chance of gaining back their ATHs, but for most other projects the fall to earth is going to be more or less permanent.</p>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/CryptoCurrency/comments/onl6pl/there_is_a_strong_possibility_of_a_long_bear/",
  "subreddit": "CryptoCurrency",
  "id": "onl6pl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The price action on BTC has been rather week since the May crash, and many\ntraders now feel that we are entering a strong bear period. Different targets\nare being discussed for the bottom, some feel it would be 25k some 15k and some\nthink it may go even lower.\n\nWhile BTC plays out, many would also…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BTCの値動きは、5月の暴落以来、むしろ週単位で行われており、多くのトレーダーが\n多くのトレーダーは、現在、強い弱気の時期に入ったと感じています。底値の目標は様々なものが議論されている。\nある人は25k、ある人は15k、またある人は20kが底だと考えている。\nさらに下がるのではないかと考えています。\n\nBTCの動きが活発になる一方で、多くの人は...",
      "title": "長いベアマーケットになる可能性が高いです。あまりにも多くのアルトコインを保有することに注意してください、多くのアルトコインは死ぬだけです。2017年の「お気に入り」の多くは、今日は言及されていない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自5月崩盘以来，BTC的价格走势一直相当平稳。\n交易员现在觉得我们正在进入一个强大的熊市时期。不同的目标\n讨论了不同的底部目标，有些人认为是25000，有些人认为是15000，有些人认为可能会更低。\n认为它可能会更低。\n\n当BTC发挥出来的时候，许多人也会...",
      "title": "很有可能出现一个漫长的熊市。谨防持有过多的altcoins，许多altcoins会直接死亡。很多2017年的 \"宠儿 \"今天都没有被提及。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自5月崩盤以來，BTC的價格走勢一直相當平穩。\n交易員現在覺得我們正在進入一個強大的熊市時期。不同的目標\n討論了不同的底部目標，有些人認爲是25000，有些人認爲是15000，有些人認爲可能會更低。\n認爲它可能會更低。\n\n當BTC發揮出來的時候，許多人也會...",
      "title": "很有可能出現一個漫長的熊市。謹防持有過多的altcoins，許多altcoins會直接死亡。很多2017年的 \"寵兒 \"今天都沒有被提及。"
    }
  ]
}