{
  "author": "Jebofkerbin",
  "the_new_excerpt": "In many fantasy settings there are examples of the aristocracy of a society\nmaintaining an old version of a language that is distinct from the common\npeople's language of that society, such as high Valarian in Game of Thrones, or\nhigh Gothic in 40k. What I'm wondering is whether this is purely an…",
  "original_created_utc": 1623968822,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ファンタジーの世界では、ある社会の貴族が、一般的な言語とは異なる古いバージョンの言語を維持している例が多くあります。\n社会の貴族が、その社会の庶民の言語とは異なる古いバージョンの言語を維持している例があります。\n例えば「ゲーム・オブ・スローンズ」の高貴なヴァラリアン、あるいは\n40kのハイゴシックなどです。私が気になっているのは、これが純粋に「貴族の言葉」なのかということです。",
      "title": "ファンタジーの世界では、言語の \"高 \"バージョンは、歴史的な根拠があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在许多幻想环境中，都有一个社会的贵族阶层的例子\n保持一种与该社会的平民语言不同的旧版本的语言。\n的语言，例如《权力的游戏》中的高级瓦拉里安语，或者40K中的高级哥特语。\n40K中的高级哥特语。我想知道的是，这是否纯粹是一种...",
      "title": "幻想中的 \"高大上 \"的语言版本的特例是否有历史依据？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在許多幻想環境中，都有一個社會的貴族階層的例子\n保持一種與該社會的平民語言不同的舊版本的語言。\n的語言，例如《權力的遊戲》中的高級瓦拉里安語，或者40K中的高級哥特語。\n40K中的高級哥特語。我想知道的是，這是否純粹是一種...",
      "title": "幻想中的 \"高大上 \"的語言版本的特例是否有歷史依據？"
    }
  ],
  "title": "Does the fantasy trope of \"high\" versions of languages have a basis in history?",
  "created_utc": 1624027938,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In many fantasy settings there are examples of the aristocracy of a society maintaining an old version of a language that is distinct from the common people&#39;s language of that society, such as high Valarian in Game of Thrones, or high Gothic in 40k. What I&#39;m wondering is whether this is purely an invention of fantasy authors, or is this a real phenomenon that has been present in societies in the past? How extreme are these examples, is a &#39;high&quot; form of a language completely incomprehensible to the common man? Did any go as far as naming themselves &quot;high&quot;?</p>\n\n<p>Thanks in advance</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/o29obq/does_the_fantasy_trope_of_high_versions_of/",
  "subreddit": "AskHistorians",
  "id": "o29obq",
  "is_self": true,
  "media": null,
  "is_video": false
}