{
  "author": "Many_Arm7466",
  "original_created_utc": 1633966491,
  "title": "My Drunk Portfolio has been Outperforming My Sober Portfolio",
  "created_utc": 1634004716,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don’t know what to say at this point I am at a loss for words...</p>\n\n<p>So one of my drunk tendencies is gambling, I have been this way for as long as I can remember. Except now instead of casino’s I gamble with Crypto and shitcoins. And I have been keeping track of my recent drunk buys in a separate portfolio. </p>\n\n<p>So I have my main portfolio consisted of Crypto’s I have done extensive research into and would be willing to bet my life that they will gain in value. Then I have my other portfolio which are Cryptos I bought while shit faced drunk for shits and giggles(most noteable Shib and some other forbidden shitcoins I dear not talk about). </p>\n\n<p>And for the past month my Drunk portfolio has outperformed my sober serious portfolio in percent gains. Which is just crazy to think about.</p>\n\n<p>I know long term my sober portfolio will perform better but just the fact of me making money off drunk decisions, really speaks to the current state of the market.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/q5yheg/my_drunk_portfolio_has_been_outperforming_my/",
  "subreddit": "CryptoCurrency",
  "id": "q5yheg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don’t know what to say at this point I am at a loss for words...\n\nSo one of my drunk tendencies is gambling, I have been this way for as long as I\ncan remember. Except now instead of casino’s I gamble with Crypto and shitcoins.\nAnd I have been keeping track of my recent drunk buys in a separate…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この時点では何と言っていいかわからず、言葉を失っています...。\n\n私の酒癖の悪さはギャンブルです。\n覚えている限りでは ただ、今はカジノではなく、暗号化されたクソコインを使ってギャンブルをしています。\nそして、私は最近酔って買ったものを別の場所で記録しています...",
      "title": "酔っ払いのポートフォリオがシラフのポートフォリオを上回っている"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道该说些什么，在这一点上我不知所措...。\n\n所以我的醉酒倾向之一是赌博，从我有记忆以来，我一直是这样的。\n就一直如此。只是现在我不去赌场，而是用加密货币和狗屎币赌博。\n我一直在跟踪我最近的醉酒购买，在一个单独的...",
      "title": "我的醉酒投资组合的表现一直优于我的清醒投资组合"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道該說些什麼，在這一點上我不知所措...。\n\n所以我的醉酒傾向之一是賭博，從我有記憶以來，我一直是這樣的。\n就一直如此。只是現在我不去賭場，而是用加密貨幣和狗屎幣賭博。\n我一直在跟蹤我最近的醉酒購買，在一個單獨的...",
      "title": "我的醉酒投資組合的表現一直優於我的清醒投資組合"
    }
  ]
}