{
  "author": "Moonsteele",
  "original_created_utc": 1655123657,
  "title": "Am I crazy for being hurt that none of my friends ever check in on me?",
  "created_utc": 1655177654,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m always the one to initiate convos between my friends and I, they never start talking to me first. I&amp;#39;ve posted on sc asking if anyone wants to hang and no one ever responds. I post about my mental health and no one ever asks if I&amp;#39;m okay. None of them ever invite me to hang out with them. I understand that everyone has lives but after asking for human connection from my friends every week for over 3 months I can&amp;#39;t help but feel that they just don&amp;#39;t care. I posted about how I was hurt by all of these things 2 weeks and all of a sudden people came out of nowhere with &amp;quot;Are you okay? We should hang&amp;quot; and now 2 weeks later they still leave me on read and don&amp;#39;t reach out at all. Am I crazy for thinking that they just don&amp;#39;t care?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/vbb6dl/am_i_crazy_for_being_hurt_that_none_of_my_friends/",
  "subreddit": "TooAfraidToAsk",
  "id": "vbb6dl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm always the one to initiate convos between my friends and I, they never start\ntalking to me first. I've posted on sc asking if anyone wants to hang and no one\never responds. I post about my mental health and no one ever asks if I'm okay.\nNone of them ever invite me to hang out with them. I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "友人との会話はいつも私が主導権を握っていて、彼らは決して始めない。\nをするんだ。scで「誰か一緒に遊ばないか？\n誰も反応してくれない。自分の精神状態について投稿しても、誰も大丈夫かと聞いてこない。\n誰一人、遊びに誘ってくれない。I...",
      "title": "友達が誰も私のことを見てくれないことに傷ついた私はおかしいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和我的朋友之间的谈话总是由我发起的，他们从来没有开始。\n他们从来不会先和我说话。我曾在网上发帖询问是否有人想去玩，但没有人\n从来没有人回应。我在网上发帖谈论我的心理健康，但从来没有人问我是否还好。\n他们中没有一个人邀请我和他们一起玩。I...",
      "title": "我的朋友都不向我问好，我是不是疯了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和我的朋友之間的談話總是由我發起的，他們從來沒有開始。\n他們從來不會先和我說話。我曾在網上發帖詢問是否有人想去玩，但沒有人\n從來沒有人回應。我在網上發帖談論我的心理健康，但從來沒有人問我是否還好。\n他們中沒有一個人邀請我和他們一起玩。I...",
      "title": "我的朋友都不向我問好，我是不是瘋了？"
    }
  ]
}