{
  "author": "rrdonoo",
  "the_new_excerpt": "https://www.mass.gov/news/ag-healey-issues-statement-in-response-to-court-decision-denying-uber-and-lyfts-motion-to-dismiss\n\nA Massachusetts state court on Thursday rejected requests by Uber and Lyft to\ndismiss a lawsuit accusing the companies of illegally misclassifying their\ndrivers as independent…",
  "original_created_utc": 1616712995,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.mass.gov/news/ag-healey-issues-statement-in-response-to-court-decision-denying-uber-and-lyfts-motion-to-dismiss\n\n马萨诸塞州一家法院周四驳回了Uber和Lyft的请求。\n驳回指责公司非法错误分类的诉讼。\n司机作为独立...",
      "title": "马萨诸塞州高等法院裁定，Uber和Lyft必须面对马萨诸塞州总检察长提出的工人不分类诉讼。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.mass.gov/news/ag-healey-issues-statement-in-response-to-court-decision-denying-uber-and-lyfts-motion-to-dismiss\n\n馬薩諸塞州一家法院週四駁回了Uber和Lyft的請求。\n駁回指責公司非法錯誤分類的訴訟。\n司機作爲獨立...",
      "title": "馬薩諸塞州高等法院裁定，Uber和Lyft必須面對馬薩諸塞州總檢察長提出的工人不分類訴訟。"
    }
  ],
  "title": "Massachusetts Superior Court rules Uber and Lyft must face worker-misclassification lawsuit from Massachusetts' attorney general",
  "created_utc": 1616723467,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.mass.gov/news/ag-healey-issues-statement-in-response-to-court-decision-denying-uber-and-lyfts-motion-to-dismiss\">https://www.mass.gov/news/ag-healey-issues-statement-in-response-to-court-decision-denying-uber-and-lyfts-motion-to-dismiss</a></p>\n\n<p>A Massachusetts state court on Thursday rejected requests by Uber and Lyft to dismiss a lawsuit accusing the companies of illegally misclassifying their drivers as independent contractors.</p>\n\n<p>The lawsuit, brought by the Massachusetts state attorney general Maura Healey in July, alleged the companies have denied drivers benefits and workplace protections guaranteed to employees by instead classifying them as contractors.</p>\n\n<p>Uber and Lyft then asked the court to toss the case, arguing the state hadn&#39;t done enough to prove drivers were denied benefits and that there wasn&#39;t a legitimate legal dispute over the issue. The court denied both companies&#39; requests, allowing the case to proceed.</p>\n\n<p>Uber and Lyft did not respond to requests for comment on this story, while labor and driver groups praised the ruling.</p>\n\n<p>&quot;This court order is a complete rejection of Uber and Lyft&#39;s position and a big win for working people,&quot; Massachusetts AFL-CIO president Steve Tolman told Insider in a statement.</p>\n\n<p>&quot;Every worker should be able to earn a decent wage, take care of their health, and protect against harassment and discrimination on the job. We thank Attorney General Healey and her team for holding Uber and Lyft accountable for following the same rules that apply to every other company,&quot; Tolman added.</p>\n\n<p>The two ride-hailing giants have faced an increasing number of legal challenges in recent years over how they classify workers amid growing evidence many drivers are paid less than the minimum wage, and have struggled — particularly during the pandemic — without access to health care, labor protections, and unemployment benefits guaranteed by law to employees.</p>\n\n<p>While companies are typically required to pay into state and federal programs benefiting their workers, Uber and Lyft have passed those costs on to taxpayers. A recent Washington Post analysis found more than 27,000 Uber and Lyft drivers received a combined $80 million from the US government to help them get through the pandemic.   </p>\n\n<p>The companies have argued drivers should be considered contractors because they&#39;re able to choose when they can work and which rides they accept, claiming the companies are simply technology platforms that connect drivers and riders.</p>\n\n<p>But a UK court recently rejected that argument, finding Uber and Lyft exercise significant control over drivers — much like a traditional employer — by setting their rates, assigning them rides, and using a rating system to determine their ability to get work on the platform. Uber responded by reclassifying its drivers as &quot;workers,&quot; a category under UK law between employment and contractor, in order to head off further legal disputes with drivers.</p>\n\n<p>California regulators and courts also rejected the arguments put forth by Uber and Lyft, but the companies — along with a coalition of food-delivery companies including DoorDash and Instacart — avoided having to comply with those rulings by spending a combined $200 million to persuade voters to pass a law they wrote that keeps drivers as contractors.</p>\n\n<p>The companies have also spent record amounts on lobbying as the worker classification issue takes the national stage.</p>\n\n<p>The Biden administration&#39;s proposed PRO Act, which wouldn&#39;t automatically reclassify gig workers but would make it easier for them to unionize, has elevated the discussion around which rights and benefits rideshare and food-delivery workers should have — and who should bear those costs.</p>\n</div><!-- SC_ON -->",
  "score": 987,
  "permalink": "/r/investing/comments/mdaqqt/massachusetts_superior_court_rules_uber_and_lyft/",
  "subreddit": "investing",
  "id": "mdaqqt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357140054
}