{
  "author": "livingstudent20",
  "original_created_utc": 1633639691,
  "title": "Do people with better memory have/maintain more synapses?",
  "created_utc": 1633693575,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just learned through an online lecture (found it on youtube by luck) that the brain is constantly changing. New synapses form, old synapses &quot;disappear&quot; etc.</p>\n\n<p>The neurologist said, that this is the reason why we inevitably get worse at something when we get better at another thing. But he also said, that scientists still don&#39;t know what it is we get worse at, when we get better at something else.</p>\n\n<p>My question is: what about those people who have absolute recall? (edit: Hyperthymesia was the word I was missing) Those people that can remember every moment of their life? (I know that those people are very rare but I&#39;m just wondering: what about them?) How can they remember everything of their lives if the number of neurons doesn&#39;t really change much after birth? (Or is this part already been proven wrong? The lecture is from 2012 and at that point the professor said that only the hyppocampus can create completely new neurons but not the cortex.)</p>\n\n<p>Now if instead, those people just have a brain that has a better ability to create new neurons, that would actually make a lot more sense. Can someone tell me if/what they know?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/askscience/comments/q3iaek/do_people_with_better_memory_havemaintain_more/",
  "subreddit": "askscience",
  "id": "q3iaek",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I just learned through an online lecture (found it on youtube by luck) that the\nbrain is constantly changing. New synapses form, old synapses \"disappear\" etc.\n\nThe neurologist said, that this is the reason why we inevitably get worse at\nsomething when we get better at another thing. But he also…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はあるオンライン講義（運良くyoutubeで見つけました）で、脳は常に変化していることを知りました。\n脳は常に変化している。新しいシナプスができたり、古いシナプスが消えたり。\n\n神経科医は、私たちが他のことでは良くなっても、何かのことではどうしても悪くなってしまうのは、このためだと言っていました。\n別のことが上手になると何かが下手になるのはこのためだと。しかし、彼はまた...",
      "title": "記憶力の良い人は、シナプスの数が多いのか、多いのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚通过一个在线讲座了解到（在youtube上找到的，很幸运）。\n大脑是不断变化的。新的突触的形成，旧的突触的 \"消失 \"等等。\n\n神经科医生说，这就是为什么我们在某些方面不可避免地变得更糟的原因\n当我们在另一件事上做得更好时，这就是我们不可避免地在某些方面变得更糟的原因。但他也...",
      "title": "记忆力好的人是否有/保持着更多的突触？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛通過一個在線講座瞭解到（在youtube上找到的，很幸運）。\n大腦是不斷變化的。新的突觸的形成，舊的突觸的 \"消失 \"等等。\n\n神經科醫生說，這就是爲什麼我們在某些方面不可避免地變得更糟的原因\n當我們在另一件事上做得更好時，這就是我們不可避免地在某些方面變得更糟的原因。但他也...",
      "title": "記憶力好的人是否有/保持着更多的突觸？"
    }
  ]
}