{
  "author": "redditsuggsazz",
  "original_created_utc": 1624712301,
  "title": "It's a known fact that Robert McNamara was a huge proponent of using mathematical data analysis and computing to influence his decisions as Secretary of Defense. But is it known what calculations he did in particular, what his formulas and models were and to what extent they influenced his strategy?",
  "created_utc": 1624750978,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I want to write an essay on the flaws of McNamara&#39;s methods (EDIT: In regards to the Vietnam war) for my history classes but I am finding that concise and accurate metrics in this regard are very difficult to come buy. The best I could find was a paper by historian  <em>Donald Fisher Harrison.</em> But this is a professional paper and it is daunting for a novice like me. Are there any fundamental facts or metrics that would make this paper easier to digest?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/o8aash/its_a_known_fact_that_robert_mcnamara_was_a_huge/",
  "subreddit": "AskHistorians",
  "id": "o8aash",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I want to write an essay on the flaws of McNamara's methods (EDIT: In regards to\nthe Vietnam war) for my history classes but I am finding that concise and\naccurate metrics in this regard are very difficult to come buy. The best I could\nfind was a paper by historian Donald Fisher Harrison. But this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "マクナマラの手法の欠点についてのエッセイを書きたいのですが（EDIT: In regard to Vietnam war\n歴史の授業でマクナマラの手法の欠陥についてエッセイを書きたいのですが、簡潔で正確な指標を\n簡潔で正確な指標を得ることは非常に困難です。私が見つけた最高のものは\n歴史家のドナルド・フィッシャー・ハリソンの論文が一番でした。しかし、これは...",
      "title": "国防長官だったロバート・マクナマラは、数学的なデータ分析や計算機を使って意思決定に影響を与えることを大々的に推進していたことは、周知の事実です。しかし、具体的にどのような計算をしたのか、どのような数式やモデルを使ったのか、そしてそれらがどの程度、彼の戦略に影響を与えたのかは知られていない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想写一篇关于麦克纳马拉的方法的缺陷的文章（编辑：关于\n我想为我的历史课写一篇关于麦克纳马拉方法的缺陷的文章（编辑：关于越南战争），但我发现简明和准确的衡量标准是什么？\n但我发现在这方面简明而准确的衡量标准很难买到。我所能找到的最好的\n是历史学家唐纳德-费舍尔-哈里森的一篇论文。但这...",
      "title": "众所周知，罗伯特-麦克纳马拉作为国防部长，是使用数学数据分析和计算来影响其决策的巨大支持者。但人们是否知道他具体做了哪些计算，他的公式和模型是什么，以及它们在多大程度上影响了他的战略？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想寫一篇關於麥克納馬拉的方法的缺陷的文章（編輯：關於\n我想爲我的歷史課寫一篇關於麥克納馬拉方法的缺陷的文章（編輯：關於越南戰爭），但我發現簡明和準確的衡量標準是什麼？\n但我發現在這方面簡明而準確的衡量標準很難買到。我所能找到的最好的\n是歷史學家唐納德-費舍爾-哈里森的一篇論文。但這...",
      "title": "衆所周知，羅伯特-麥克納馬拉作爲國防部長，是使用數學數據分析和計算來影響其決策的巨大支持者。但人們是否知道他具體做了哪些計算，他的公式和模型是什麼，以及它們在多大程度上影響了他的戰略？"
    }
  ]
}