{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "When the Apple M1 series came out, lots of people were saying that x86 is doomed, Intel and AMD will be out of business and every big tech companies will be designing their own ARM-based processor. In my opinion, these statements are quite detached from reality and is a display of lack of understanding of semiconductor and technology. Here's why:\n\n1. It takes a lot of money and time to built a world-class chip-design team: Apple started using their in-house designed ARM-based architecture with the iPhone 4S, which was released in 2011. They should be working on the architecture at least 2 years prior to that, which means it takes Apple more than 10 years to be able to build the M1 series. Almost every generation of Apple's in-house design has a huge efficiency advantage over the standard ARM core, which implies the design team of Apple is far more capable than the team in ARM and Qualcomm. Despite that, it still takes them more than 10 years to accumulate the technical legacy and experience to make the M1 series. Few other companies can afford to spend that amount of money and time do built a design team as capable as Apple's, even if they could, it could still be more expensive than just buying processors from Intel or AMD.\n2. It takes even more time and money to re-write software for a different architecture: processors are expensive, but the time of competent software engineers is even more expensive. Good software engineers are required if you want to migrate your software to a different ISA and have it performing well, and they are expensive and rare. It makes more financial sense for companies to assign these engineers to other purposes than to re-write software that runs fine on existing hardware. On top of that, most companies doesn't have the complete control over their platform like Apple does on OSX and iOS, which would makes this task even harder, more expensive and time-consuming.\n3. Few companies can afford to use the most advanced semiconductor manufacturing node: Apple started using the TSMC N5 process more than 1 year earlier than almost everybody else, which is a significant contributing factor to the efficiency advantage of the M1 series. Even datacenter products with extremely high margin such as the AMD EPYC and Nvidia A100 are one generation behind in terms of process node. It takes an insane amount of money to design a processor on the most advanced process node, hundreds of millions for N5, billions is expected for N3. If processor vendors like AMD and Nvidia can't race Apple to the most advanced node, processors for in-house usage by Google, Amazon or Microsoft definitely won't have the volume to do so.\n4. The M1 series is actually quite transistor-inefficient: the M1 Max contains 57 billion transistors, in comparison, the RTX 3080 contains about 28 billion transistors and the Ryzen 5900X contains about 19 billion transistors, even the Nvidia A100 contains \"only\" roughly 54 billion transistors.  While the M1 Max is powerful, it's definitely not as powerful as the RTX 3080 and 5900X combined, even if it contains more transistors. If only fabbing cost is considered, a M1 Max is more expensive to manufacture than 2 RTX 3080 since the cost per transistor stopped dropping since 28nm. The design of M1 series sacrifices transistor efficiency for energy efficiency, which makes sense for mobile products, but for HPC applications better transistor efficiency should be more desirable. AMD and Nvidia products are still more efficient in terms of computing power to manufacturing cost ratio.\n\nIn conclusion, the M1 series is the result of Apple pouring tremendous amount of resource over a long time, which most companies can't afford to do. Even if they could, it would probably make more financial sense to simply purchase processors from existing vendors.",
  "author_fullname": "t2_cx6eo",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Why the success of Apple M1 series is hard to replicate for other companies and x86 is here to stay",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "discussion",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_u44fqe",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.83,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 46,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Industry Discussion",
  "can_mod_post": false,
  "score": 46,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1650015895,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When the Apple M1 series came out, lots of people were saying that x86 is doomed, Intel and AMD will be out of business and every big tech companies will be designing their own ARM-based processor. In my opinion, these statements are quite detached from reality and is a display of lack of understanding of semiconductor and technology. Here&amp;#39;s why:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;It takes a lot of money and time to built a world-class chip-design team: Apple started using their in-house designed ARM-based architecture with the iPhone 4S, which was released in 2011. They should be working on the architecture at least 2 years prior to that, which means it takes Apple more than 10 years to be able to build the M1 series. Almost every generation of Apple&amp;#39;s in-house design has a huge efficiency advantage over the standard ARM core, which implies the design team of Apple is far more capable than the team in ARM and Qualcomm. Despite that, it still takes them more than 10 years to accumulate the technical legacy and experience to make the M1 series. Few other companies can afford to spend that amount of money and time do built a design team as capable as Apple&amp;#39;s, even if they could, it could still be more expensive than just buying processors from Intel or AMD.&lt;/li&gt;\n&lt;li&gt;It takes even more time and money to re-write software for a different architecture: processors are expensive, but the time of competent software engineers is even more expensive. Good software engineers are required if you want to migrate your software to a different ISA and have it performing well, and they are expensive and rare. It makes more financial sense for companies to assign these engineers to other purposes than to re-write software that runs fine on existing hardware. On top of that, most companies doesn&amp;#39;t have the complete control over their platform like Apple does on OSX and iOS, which would makes this task even harder, more expensive and time-consuming.&lt;/li&gt;\n&lt;li&gt;Few companies can afford to use the most advanced semiconductor manufacturing node: Apple started using the TSMC N5 process more than 1 year earlier than almost everybody else, which is a significant contributing factor to the efficiency advantage of the M1 series. Even datacenter products with extremely high margin such as the AMD EPYC and Nvidia A100 are one generation behind in terms of process node. It takes an insane amount of money to design a processor on the most advanced process node, hundreds of millions for N5, billions is expected for N3. If processor vendors like AMD and Nvidia can&amp;#39;t race Apple to the most advanced node, processors for in-house usage by Google, Amazon or Microsoft definitely won&amp;#39;t have the volume to do so.&lt;/li&gt;\n&lt;li&gt;The M1 series is actually quite transistor-inefficient: the M1 Max contains 57 billion transistors, in comparison, the RTX 3080 contains about 28 billion transistors and the Ryzen 5900X contains about 19 billion transistors, even the Nvidia A100 contains &amp;quot;only&amp;quot; roughly 54 billion transistors.  While the M1 Max is powerful, it&amp;#39;s definitely not as powerful as the RTX 3080 and 5900X combined, even if it contains more transistors. If only fabbing cost is considered, a M1 Max is more expensive to manufacture than 2 RTX 3080 since the cost per transistor stopped dropping since 28nm. The design of M1 series sacrifices transistor efficiency for energy efficiency, which makes sense for mobile products, but for HPC applications better transistor efficiency should be more desirable. AMD and Nvidia products are still more efficient in terms of computing power to manufacturing cost ratio.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;In conclusion, the M1 series is the result of Apple pouring tremendous amount of resource over a long time, which most companies can&amp;#39;t afford to do. Even if they could, it would probably make more financial sense to simply purchase processors from existing vendors.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "8acd2324-65e6-11e5-a263-122ab0778f8b",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#4f8ef7",
  "id": "u44fqe",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "Liopleurod0n",
  "discussion_type": null,
  "num_comments": 40,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/u44fqe/why_the_success_of_apple_m1_series_is_hard_to/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/u44fqe/why_the_success_of_apple_m1_series_is_hard_to/",
  "subreddit_subscribers": 3898237,
  "created_utc": 1650033740,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1650015895,
  "the_new_excerpt": "When the Apple M1 series came out, lots of people were saying that x86 is\ndoomed, Intel and AMD will be out of business and every big tech companies will\nbe designing their own ARM-based processor. In my opinion, these statements are\nquite detached from reality and is a display of lack of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Apple M1シリーズが登場したとき、多くの人が「x86は\nインテルとAMDは廃業し、すべての大企業が倒産するだろう。\nARMベースのプロセッサを独自に設計しています。私見では、これらの発言は\n現実離れしているというか。",
      "title": "Apple M1シリーズの成功が他社に真似されにくく、x86がここにとどまる理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当苹果M1系列出来的时候，很多人都在说x86是注定的。\n命运，英特尔和AMD将被淘汰，每个大的科技公司都将设计他们的操作系统。\n都会设计自己的基于ARM的处理器。在我看来，这些说法是\n在我看来，这些言论相当脱离现实，显示出他们缺乏经验。",
      "title": "为什么苹果M1系列的成功很难被其他公司复制，X86将继续存在"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當蘋果M1系列出來的時候，很多人都在說x86是註定的。\n命運，英特爾和AMD將被淘汰，每個大的科技公司都將設計他們的操作系統。\n都會設計自己的基於ARM的處理器。在我看來，這些說法是\n在我看來，這些言論相當脫離現實，顯示出他們缺乏經驗。",
      "title": "爲什麼蘋果M1系列的成功很難被其他公司複製，X86將繼續存在"
    }
  ]
}