{
  "author": "UltimateTraders",
  "the_new_excerpt": "Nautilus, Ticker NLS. This company is about 20% short, has 113 million in cash\nin the bank with just under 15 million in debt, has a market cap of 500 million.\nThey have generated about 80 million over the past 2 quarters as well. We have a\nmajor catalyst still….people aren’t running to the gym. If…",
  "original_created_utc": 1621907682,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Nautilus、Ticker NLSです。この会社は、約20％の資金不足で、1億1300万の現金を持っています。\n銀行には1億1300万円の現金があり、負債は1500万円弱で、時価総額は5億円です。\n過去2四半期で約8,000万円の収益を上げています。私たちには\n今でも大きなカタリストがあります....、人々はジムに駆け込んだりしません。もし...",
      "title": "Peloton(PTON 300億円)はNautilus(NLS 5億円)の60倍の評価を受けているが、NLSが安いのかPTONが高いのか？どうでしょう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Nautilus，股票代码NLS。这家公司大约有20%的资金缺口，银行里有1.13亿现金，只有不到1500万的债务。\n银行里有1.13亿现金，只有不到1500万的债务，市值为5亿。\n在过去的两个季度里，他们也创造了约8000万的收入。我们有一个\n主要的催化剂仍然是....，人们并没有跑到健身房。如果...",
      "title": "Peloton（PTON 300亿）的估值是Nautilus（NLS 5亿）的60倍，NLS便宜还是PTON贵？有何看法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Nautilus，股票代碼NLS。這家公司大約有20%的資金缺口，銀行裏有1.13億現金，只有不到1500萬的債務。\n銀行裏有1.13億現金，只有不到1500萬的債務，市值爲5億。\n在過去的兩個季度裏，他們也創造了約8000萬的收入。我們有一個\n主要的催化劑仍然是....，人們並沒有跑到健身房。如果...",
      "title": "Peloton（PTON 300億）的估值是Nautilus（NLS 5億）的60倍，NLS便宜還是PTON貴？有何看法？"
    }
  ],
  "title": "Peloton (PTON 30 Billion) is valued 60x more than Nautilus (NLS 500 Million), NLS cheap or PTON expensive? Thoughts?",
  "created_utc": 1621925412,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Nautilus, Ticker NLS. This company is about 20% short, has 113 million in cash in the bank with just under 15 million in debt, has a market cap of 500 million. They have generated about 80 million over the past 2 quarters as well. We have a major catalyst still….people aren’t running to the gym. If you go to Nautilus.com you will still see everything is back ordered with 6-8 weeks estimated ship date. The accounts receivables shows near 90 million on orders.</p>\n\n<p>Another major catalyst is Peloton. Peloton is losing money and making a lot of acquisitions, they have spent more than the $500 million (the cost of entire NLS which is profitable). If NLS crushes again, which they will! (The question is what traders do with the report) PTON should use their beefy valuation to make an acquisition which would be immediately accretive to earnings for PTON. PTON is losing money and NLS is making money hands over fists. </p>\n\n<p><strong>These are just some of the 1st Quarter 2021 and some 4th Quarter 2020 highlights.</strong></p>\n\n<p><strong>1st Quarter of 2021 Net Sales Increased 120% to $206 million, the highest quarterly sales in company history Operating Income of $39.7 million is third-highest in company history EBITDA was $40.4 million compared to $2.3 million last year</strong> </p>\n\n<p><strong>1st Quarter of 2021 Cash, cash equivalents, restricted cash and available-for-sale securities were $113.2 million, an increase of $86.8 million, compared to cash, cash equivalents and restricted cash of $26.5 million as of March 31, 2020.</strong></p>\n\n<p><strong>Debt was $13.6 million compared to $28.4 million as of March 31, 2020.</strong></p>\n\n<p><strong>Fourth Quarter EBITDA improved by 578% to $40 million compared to same period last year</strong></p>\n\n<p><strong>Fourth Quarter Operating Income of $41 million is the second highest since our founding in 1986</strong></p>\n\n<p><strong>On a full year</strong></p>\n\n<p><strong>Company Achieves Full Year Revenue Guidance by Growing Revenue 79% to $553 million</strong></p>\n\n<p><strong>Full Year Operating Income was $78 million and Full Year EBITDA was $84 million (Wait a second at $17 this company trades at $525 million….isnt that just 7x PE)</strong></p>\n\n<p>So let us recap some of this here. This company which sells BowFlex, Schwinn and other brands is growing 120%, is making serious cash, had the best sales quarter in the company’s history and trades basically near 6PE. This past quarter was the 2nd most profitable quarter in its history after the 4th quarter of 2020. This has pulled back from $30 about 4-5 months ago after 2 amazing reports. You will not find 120% growth in profitable stocks. I understand that eventually maybe 2-4 quarters down the road the growth will slow. But the company has forecast this quarter at 50%....I believe that is modest..</p>\n\n<p>Also, PTON is going to lose about $200 million because of their treadmill fiasco. NLS doesn’t have a fiasco, if anything PTON should plug that issue and make a purchase. PTON with BOWFLEX! The possibilities…</p>\n\n<p>Please share ideas and thoughts. Thank you.</p>\n</div><!-- SC_ON -->",
  "score": 88,
  "permalink": "/r/stocks/comments/nke9vc/peloton_pton_30_billion_is_valued_60x_more_than/",
  "subreddit": "stocks",
  "id": "nke9vc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197389736
}