{
  "author": "Davimus59",
  "original_created_utc": 1637000169,
  "title": "The infamous btc for pizza image",
  "created_utc": 1637025253,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I now probably almost everyone here has heard the tale of the guy who traded a large sum of btc for some pizza. I have heard the story many times as both a way to encourage hodling and as a reminder that hindsight is always 20/20. The thing is I had no idea that moment got inmortalized in a photo and I just now came across it. I have no idea where the guy is, how he feels about the incident or whether he even thinks about it at all. The picture, however, tells the story of 2 kids and a proud father who was able to buy them pizza on a saturday night (I bothered checking the day) I think it will give a lot of people here some perspective when they start blaming themselves for not buying more or for selling early. Here a guy, well not a guy but THE guy who made possibly one of the biggest (if not the biggest) mistakes in crypto history but he was happy at that time. He got to enjoy pizza. Anyway it eased my mind a little seeing this picture and thought I would share it with you all. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/bep7ee9wusz71.jpg?width=614&amp;format=pjpg&amp;auto=webp&amp;s=ec700fa7eb9b082557f763b6edfc22aa0e3a1cc4\">https://preview.redd.it/bep7ee9wusz71.jpg?width=614&amp;format=pjpg&amp;auto=webp&amp;s=ec700fa7eb9b082557f763b6edfc22aa0e3a1cc4</a></p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/qumoc0/the_infamous_btc_for_pizza_image/",
  "subreddit": "CryptoCurrency",
  "id": "qumoc0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I now probably almost everyone here has heard the tale of the guy who traded a\nlarge sum of btc for some pizza. I have heard the story many times as both a way\nto encourage hodling and as a reminder that hindsight is always 20/20. The thing\nis I had no idea that moment got inmortalized in a photo…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "大金をピザと交換した男の話は、ここにいるほとんどの人が聞いたことがあるだろう。\n大金のビットコインをピザと交換した人の話を聞いたことがあると思います。私はこの話を何度も聞きました。\n私はこの話を何度も聞いたことがありますが、それはホドリングを奨励するためでもあり、後悔先に立たずということを思い出させるためでもあります。問題は\nその瞬間が写真に収められているとは知りませんでした...。",
      "title": "悪名高いbtc for pizzaの画像"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我现在可能几乎所有的人都听说过这个故事，这个人用一大笔比特币换了一些比萨饼。\n大笔比特币换取一些比萨饼的故事。我已经听过很多次这个故事了，既是为了鼓励人们进行交易，也是为了提醒人们事后诸葛亮。\n我听过很多次这个故事，既是为了鼓励人们的交易，也是为了提醒人们，事后诸葛亮永远是20/20。这件事\n是我不知道那一刻被拍成了照片......",
      "title": "臭名昭著的比特币换比萨饼图片"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我現在可能幾乎所有的人都聽說過這個故事，這個人用一大筆比特幣換了一些比薩餅。\n大筆比特幣換取一些比薩餅的故事。我已經聽過很多次這個故事了，既是爲了鼓勵人們進行交易，也是爲了提醒人們事後諸葛亮。\n我聽過很多次這個故事，既是爲了鼓勵人們的交易，也是爲了提醒人們，事後諸葛亮永遠是20/20。這件事\n是我不知道那一刻被拍成了照片......",
      "title": "臭名昭著的比特幣換比薩餅圖片"
    }
  ]
}