{
  "author": "Dr_Brown_Bro",
  "original_created_utc": 1649138137,
  "title": "Is being a single parent really that much off a turn off to date?",
  "created_utc": 1649178709,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I (30, M) am a single father of two girls (4, 2.5). I have a good head on my shoulders, stable career, and own my own home. I haven’t (really) tried to get back into the dating scene recently, but when I have in the past I was brushed off a LOT because I have kids. No that’s fine. I understand a lot of people don’t want kids and a lot of people don’t want to date people with kids. I get it and don’t lose any sleep over it. But overall is it really THAT much of a deal breaker? My kids are an extension of myself and there is NO way I’d ever be with someone who didn’t want them I. Their life as well. But with that, I’m worried it’s going to be if I ever try to seriously meet someone.&lt;/p&gt;\n\n&lt;p&gt;Edit: Forgot to state age.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/TooAfraidToAsk/comments/twnzz6/is_being_a_single_parent_really_that_much_off_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "twnzz6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I (30, M) am a single father of two girls (4, 2.5). I have a good head on my\nshoulders, stable career, and own my own home. I haven’t (really) tried to get\nback into the dating scene recently, but when I have in the past I was brushed\noff a LOT because I have kids. No that’s fine. I understand a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私（30歳、男性）は2人の女の子（4歳、2.5歳）のシングルファーザーです。私は頭脳明晰です。\n安定したキャリアを持ち、マイホームも持っている。私は(本当に)再挑戦したことはありません。\n最近、出会いの場に戻ってきたのですが、過去に出会ったときは、一蹴されました。\n子供がいるからということで、随分と敬遠されました。いや、それはいいんです。私は理解している...",
      "title": "片親というのは、そんなに付き合うのが嫌なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（30岁，男）是一个有两个女孩（4岁，2.5岁）的单身父亲。我有一个很好的头\n我有一个很好的头，稳定的职业，并拥有自己的家。我还没有（真的）试图回到\n最近，我没有尝试回到约会现场，但当我在过去尝试时，我被刷掉了很多，因为我有孩子。\n因为我有孩子。不，这很好。我理解。",
      "title": "作为一个单亲家庭，真的有那么多的人不喜欢约会吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（30歲，男）是一個有兩個女孩（4歲，2.5歲）的單身父親。我有一個很好的頭\n我有一個很好的頭，穩定的職業，並擁有自己的家。我還沒有（真的）試圖回到\n最近，我沒有嘗試回到約會現場，但當我在過去嘗試時，我被刷掉了很多，因爲我有孩子。\n因爲我有孩子。不，這很好。我理解。",
      "title": "作爲一個單親家庭，真的有那麼多的人不喜歡約會嗎？"
    }
  ]
}