{
  "author": "UnexperiencedIT",
  "original_created_utc": 1639501299,
  "title": "The biggest reason why most of us are relaxed with \"losing money\" is because we are not losing it at all",
  "created_utc": 1639521126,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It seems that those who said &lt;em&gt;&amp;quot;I&amp;#39;m here in the long run&amp;quot;&lt;/em&gt; really are. We are holding and waiting for the prices to come back higher then ever.&lt;/p&gt;\n\n&lt;p&gt;The long run is the biggest reason I’m relaxed and because I see crypto as something that can really help me tommorow with my financial situation.&lt;/p&gt;\n\n&lt;p&gt;If you are really here in the long run then you should not be too upset about these dips, and it seems people on this sub are really chill. I really like that.&lt;/p&gt;\n\n&lt;p&gt;I rarely watch charts, a couple of times a day, the reason is I don’t have a fiat anymore is to buy a dip.&lt;/p&gt;\n\n&lt;p&gt;And even if I had I would put a buying order and continue my day completely normal like any other.&lt;/p&gt;\n\n&lt;p&gt;It seems that after some time spent in the market, this becomes completely normal.&lt;/p&gt;\n\n&lt;p&gt;For those of you who have the money to continue buying, make a strategy, for those of us who don&amp;#39;t have any more, we just have to hold and wait I guess.&lt;/p&gt;\n\n&lt;p&gt;Anyway, I like this, I like how chill most of us are. Cracking jokes while &amp;quot;losing money&amp;quot;. Cheers!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/rgbwy8/the_biggest_reason_why_most_of_us_are_relaxed/",
  "subreddit": "CryptoCurrency",
  "id": "rgbwy8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It seems that those who said \"I'm here in the long run\" really are. We are\nholding and waiting for the prices to come back higher then ever.\n\nThe long run is the biggest reason I’m relaxed and because I see crypto as\nsomething that can really help me tommorow with my financial situation.\n\nIf you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "長い目で見ればここにいる」と言っていた人たちが、本当にそうなったようです。私たちは\nを持ち続け、これまで以上に高い値段で戻ってくるのを待ちます。\n\n長い目で見れば、私がリラックスしている最大の理由であり、暗号を次のように考えているからです。\n明日、私の経済状況を本当に助けてくれるもの。\n\nもし、あなたが...",
      "title": "私たちの多くが「損をすること」に寛容である最大の理由は、全く損をしていないからである"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "看来，那些说 \"我在这里是长期的 \"的人真的是这样。我们正在\n持有并等待价格回升到前所未有的高度。\n\n长线是我放松的最大原因，因为我认为加密货币是\n能真正帮助我明天的财务状况的东西。\n\n如果你...",
      "title": "我们大多数人对 \"赔钱 \"感到轻松的最大原因是我们根本没有赔钱"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "看來，那些說 \"我在這裏是長期的 \"的人真的是這樣。我們正在\n持有並等待價格回升到前所未有的高度。\n\n長線是我放鬆的最大原因，因爲我認爲加密貨幣是\n能真正幫助我明天的財務狀況的東西。\n\n如果你...",
      "title": "我們大多數人對 \"賠錢 \"感到輕鬆的最大原因是我們根本沒有賠錢"
    }
  ]
}