{
  "author": "BigDaddyJ_Stocks",
  "the_new_excerpt": "As most on here know, I lost nearly every dollar to my name going all in on RKT\ncalls. When I say everything I mean all my savings and 90% of my checking\naccount. Now I’m a stupid, broke husband and dad of 3 with number 4 coming in\nearly June. I am now going to be Uber driving every night for…",
  "original_created_utc": 1620427386,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここにいるほとんどの人が知っているように、私はRKTのコールでオールインして自分の名前にほぼ全てのドルを失った。\nのコールをしました。私が全てと言ったのは、私の全ての貯金と私の当座預金の90％を意味します。\n口座の90％を失いました。今、私は愚かで、一文無しの夫であり、3人の父親であり、4人目が6月初旬に生まれる予定です。\n6月初旬には4人目が誕生します。私は今、毎晩Uberで運転しています...",
      "title": "苦労して得た教訓.... RKTの通話ですべてを失った人からのアドバイスです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这里的大多数人都知道，我在RKT上全额投入的时候，几乎输掉了我名下的每一块钱。\n电话。我说的一切是指我所有的储蓄和90%的支票\n帐户。现在我是一个愚蠢的、破产的丈夫和三个孩子的父亲，第四个孩子将在六月初出生。\n六月初。我现在每天晚上都要在Uber上开车，为的就是让我的孩子们有一个安全的环境。",
      "title": "惨痛的教训.... 一个在RKT电话上失去一切的人的建议。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏的大多數人都知道，我在RKT上全額投入的時候，幾乎輸掉了我名下的每一塊錢。\n電話。我說的一切是指我所有的儲蓄和90%的支票\n帳戶。現在我是一個愚蠢的、破產的丈夫和三個孩子的父親，第四個孩子將在六月初出生。\n六月初。我現在每天晚上都要在Uber上開車，爲的就是讓我的孩子們有一個安全的環境。",
      "title": "慘痛的教訓.... 一個在RKT電話上失去一切的人的建議。"
    }
  ],
  "title": "Lessons learned the hard way…. Advice from someone who lost it all on RKT calls.",
  "created_utc": 1620448365,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As most on here know, I lost nearly every dollar to my name going all in on RKT calls. When I say everything I mean all my savings and 90% of my checking account. Now I’m a stupid, broke husband and dad of 3 with number 4 coming in early June. I am now going to be Uber driving every night for several hours to try and make ends meet. Yes, I have a job. I’m a realtor in DFW. But I work mostly with buyers looking in the $250-$400K range and they don’t have the cash to pay way over asking to get a home. This is due to so many wealthy folks coming from California that my local buyers can’t compete with in bidding wars. Thus, I’m having my worst year now on my 3rd year in the business despite homes selling like crazy. The only successful realtors right now are those that have been in business many years and get lots of listings. That being said….</p>\n\n<p>Here’s my advice to other newbies like myself for what it’s worth:\n1. Don’t buy short dated calls unless you are 100% ok with losing ALL of it. Get calls months out or even better stick to shares. </p>\n\n<ol>\n<li><p>Even if you’ve done solid DD, and studied solid DD from others, it could still go all wrong. </p></li>\n<li><p>Don’t get over confident based on past success. This was my biggest problem. I’d made some good trades my first few months and felt like I had it figured out. I didn’t know as much as I thought I did, and you probably don’t either. </p></li>\n</ol>\n\n<p>Follow this advice and maybe, just maybe you won’t end up like me.</p>\n</div><!-- SC_ON -->",
  "score": 1104,
  "permalink": "/r/wallstreetbets/comments/n7b3py/lessons_learned_the_hard_way_advice_from_someone/",
  "subreddit": "wallstreetbets",
  "id": "n7b3py",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985998948
}