{
  "author": "z1gz1g",
  "original_created_utc": 1635457962,
  "title": "Am I crazy for holding 90% cash : 10% BTC?",
  "created_utc": 1635482869,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m very bullish for BTC, particularly over the next few months after recently discovering Plan B’s stock 2 flow model and his predictions for Sept/Oct/Nov/Dec.</p>\n\n<p>However, I’m also wary of something I don’t know about cropping up and causing a crash in the price.  Like what? IDK, the US banning it, or thousands of wallets being emptied because of a flaw that no one knew about the day before.  Basically any unknown unknown.</p>\n\n<p>As the title says, I’ve got 10% BTC and 90% cash (getting zero interest).</p>\n\n<p>If I increased the ratio of BTC, I’m not sure I’d sleep at night (already a long term insomnia sufferer).</p>\n\n<p>So, is 10% the right amount for me?  What would you do in my situation?</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/Bitcoin/comments/qhxjjr/am_i_crazy_for_holding_90_cash_10_btc/",
  "subreddit": "Bitcoin",
  "id": "qhxjjr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m very bullish for BTC, particularly over the next few months after recently\ndiscovering Plan B’s stock 2 flow model and his predictions for\nSept/Oct/Nov/Dec.\n\nHowever, I’m also wary of something I don’t know about cropping up and causing a\ncrash in the price. Like what? IDK, the US banning it, or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はBTCに対して非常に強気で、特に今後数ヶ月の間、最近の\n最近、Plan Bのストック2フローモデルと彼の9月、10月、11月、12月の予測を発見しました。\n9月、10月、11月、12月。\n\nしかし、私が知らない何かが出現して価格が暴落することを警戒しています。\n価格が暴落するのではないかと警戒しています。例えば？アメリカが禁止するとか・・・。",
      "title": "90％の現金：10％のBTCを持っている私はおかしいでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我非常看好BTC，特别是在最近发现B计划的股票2流模型和他对BTC的预测后，在未来几个月内，我将会继续看好BTC。\n发现了B计划的股票2流模型和他对BTC的预测。\n九月/十月/十一月/十二月。\n\n然而，我也很警惕一些我不知道的东西出现，导致价格的崩溃。\n价格的崩溃。比如什么？不知道，美国禁止它，或者......",
      "title": "我持有90%的现金：10%的BTC，是不是疯了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我非常看好BTC，特別是在最近發現B計劃的股票2流模型和他對BTC的預測後，在未來幾個月內，我將會繼續看好BTC。\n發現了B計劃的股票2流模型和他對BTC的預測。\n九月/十月/十一月/十二月。\n\n然而，我也很警惕一些我不知道的東西出現，導致價格的崩潰。\n價格的崩潰。比如什麼？不知道，美國禁止它，或者......",
      "title": "我持有90%的現金：10%的BTC，是不是瘋了？"
    }
  ]
}