{
  "author": "Yourdadisme5",
  "original_created_utc": 1639952991,
  "title": "I am the most undisciplined person. I don't brush my teeth everyday, I can't get myself to workout, I am overweight, I can't sit and focus on one kind of work by myself. How do I get myself together and really start doing?",
  "created_utc": 1639969247,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Today is the last day I be this way.&amp;quot;\nI tell myself every single day. I watched hundreds of videos on how to fix myself, for years now. I even got to a decent level of weight before the pandemic hit and put me back to where I was. Now I&amp;#39;m just stuck. How do people do it? &lt;/p&gt;\n\n&lt;p&gt;How do you always sleep and wake in time?\nAlways brush your teeth?\nAlways shower?\nAlways workout and eat healthy?\nAlways be in time for work?\nBe able to work on yourself and be disciplined and motivated everyday?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a mess. I really am. Help me fix myself, please. What is wrong with me?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/rk7jju/i_am_the_most_undisciplined_person_i_dont_brush/",
  "subreddit": "TooAfraidToAsk",
  "id": "rk7jju",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "\"Today is the last day I be this way.\" I tell myself every single day. I watched\nhundreds of videos on how to fix myself, for years now. I even got to a decent\nlevel of weight before the pandemic hit and put me back to where I was. Now I'm\njust stuck. How do people do it?\n\nHow do you always sleep…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"今日が最後の日だ\" 毎日、自分に言い聞かせています。私は\nもう何年も前から、自分を治す方法のビデオを何百本も見てきました。私は、まともな\nパンデミックに見舞われる前に、元の体重に戻されました。今、私は\nただ、動けない。みんなどうしてるんだろう？\n\nどうやっていつも寝てるんだ...",
      "title": "私は最も規律を守らない人間です。毎日歯を磨かないし、運動する気になれないし、太っているし、一人で座って一種類の仕事に集中することもできない。どうしたら自分を取り戻し、本当にやり始めることができるでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"今天是我这样的最后一天\"。我每天都告诉自己。我看了\n数百个关于如何修复自己的视频，已经好几年了。我甚至在大流行病到来之前达到了一个体面的\n在大流行病到来之前，我甚至达到了一个体面的体重水平，把我打回了原形。现在我\n只是卡住了。人们是如何做到的？\n\n你是怎么做到的？",
      "title": "我是最没有纪律的人。我每天不刷牙，我不能让自己去锻炼，我体重超标，我不能自己坐着专注于一种工作。我怎样才能让自己振作起来，真正开始做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"今天是我這樣的最後一天\"。我每天都告訴自己。我看了\n數百個關於如何修復自己的視頻，已經好幾年了。我甚至在大流行病到來之前達到了一個體面的\n在大流行病到來之前，我甚至達到了一個體面的體重水平，把我打回了原形。現在我\n只是卡住了。人們是如何做到的？\n\n你是怎麼做到的？",
      "title": "我是最沒有紀律的人。我每天不刷牙，我不能讓自己去鍛鍊，我體重超標，我不能自己坐着專注於一種工作。我怎樣才能讓自己振作起來，真正開始做？"
    }
  ]
}