{
  "author": "Odysseus_Lannister",
  "original_created_utc": 1645394790,
  "title": "Last week it was all “bull run is back on” and now it’s crypto winter is officially here. Stop living week to week y’all, it’s a good way to burn out.",
  "created_utc": 1645403751,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Basically what the title says, last week many Americans were super bullish on the Super Bowl and all the crypto ads where the “bull run was back on”. People started to get the BTC to 100 or 200k posts ready to go and any potential war between russia and Ukraine were dismissed as FUD. &lt;/p&gt;\n\n&lt;p&gt;Fast forward to a whole 7 days later and there are multiple posts about being in a crypto winter for the foreseeable future. This is the volatility that comes with the territory of being in the space so instead of riding the roller coaster it might benefit some to just unplug from the daily/weekly news and chart watching. If you set your limit orders and price alerts then go live your life, it’s much harder to be affected by the constant volatility. &lt;/p&gt;\n\n&lt;p&gt;Who knows what’s in store for next week? Personally I think it’s bearish news for the foreseeable future with, coming interest rate hikes, tax season, and the constant threat of global conflict despite institutional involvement being at an all time high.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 320,
  "permalink": "/r/CryptoCurrency/comments/sxcrbv/last_week_it_was_all_bull_run_is_back_on_and_now/",
  "subreddit": "CryptoCurrency",
  "id": "sxcrbv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Basically what the title says, last week many Americans were super bullish on\nthe Super Bowl and all the crypto ads where the “bull run was back on”. People\nstarted to get the BTC to 100 or 200k posts ready to go and any potential war\nbetween russia and Ukraine were dismissed as FUD.\n\nFast forward…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "基本的にはタイトルの通りなのですが、先週は多くのアメリカ人が超強気でした。\nスーパーボウルや暗号の広告で、「ブルランが復活した」と言われました。人々は\nBTCを100kや200kにするポストを用意し始め、潜在的な戦争が起きないよう\nロシアとウクライナの関係は、FUDとして処理された。\n\n早送りで...",
      "title": "先週は「ブルランが復活した」と言われたが、今は暗号の冬が公式に到来している。毎週、毎週、生活するのはやめましょう、燃え尽きるには良い方法です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "基本上就像标题所说的，上周许多美国人超级看好\n超级碗和所有的加密货币广告，\"牛市又开始了\"。人们\n人们开始把BTC炒到10万或20万，并把任何潜在的战争\n俄罗斯和乌克兰之间的任何潜在战争都被认为是虚假的。\n\n快速前进...",
      "title": "上周都是 \"牛市运行重新开始\"，现在是加密货币的冬天正式到来。不要再周而复始地生活了，这是让人精疲力尽的好方法。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "基本上就像標題所說的，上週許多美國人超級看好\n超級碗和所有的加密貨幣廣告，\"牛市又開始了\"。人們\n人們開始把BTC炒到10萬或20萬，並把任何潛在的戰爭\n俄羅斯和烏克蘭之間的任何潛在戰爭都被認爲是虛假的。\n\n快速前進...",
      "title": "上週都是 \"牛市運行重新開始\"，現在是加密貨幣的冬天正式到來。不要再週而復始地生活了，這是讓人精疲力盡的好方法。"
    }
  ]
}