{
  "author": "BatsmenTerminator",
  "original_created_utc": 1630773335,
  "title": "How were teenagers going into battle and not only surviving but actually doing well and winning in medieval times? For instance Edward the Black Prince was barely 16 at the Battle of Crecy",
  "created_utc": 1630796117,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This seems absolutely crazy to me, how would a 16 year old have the physical strength and even the experience to fight against some of the older and more experienced people. What&#39;s crazier is that he was the heir to the throne, why in his right mind would his father even allow such a thing?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/phutzg/how_were_teenagers_going_into_battle_and_not_only/",
  "subreddit": "AskHistorians",
  "id": "phutzg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This seems absolutely crazy to me, how would a 16 year old have the physical\nstrength and even the experience to fight against some of the older and more\nexperienced people. What's crazier is that he was the heir to the throne, why in\nhis right mind would his father even allow such a thing?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "16歳の子供が、年長者や熟練者と戦える体力や経験を持っているとは思えません。\n経験豊富な年配の方々と戦えるだけの体力と経験があるでしょうか？\n経験豊富な年配の方々と戦える体力や経験があるでしょうか？さらにおかしいのは、彼は王位継承者であり、なぜ彼の父親がそのようなことを許したのか？\n彼の父親はなぜそのようなことを許したのでしょうか？",
      "title": "中世の時代、ティーンエイジャーはどのように戦場に赴き、生き延びるだけでなく、実際に活躍し、勝利していたのでしょうか？例えば、黒太子のエドワードはクレシーの戦いではまだ16歳でした。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这在我看来是绝对疯狂的，一个16岁的孩子怎么会有体力，甚至有经验去再次战斗呢？\n的体力，甚至有经验与一些年长和更有经验的人作战。\n有经验的人。更疯狂的是，他是王位的继承人，为什么在他正确的思维下，他的儿子会去打仗？\n为什么他的父亲会允许这种事情发生？",
      "title": "在中世纪，青少年如何上战场，不仅能生存下来，而且实际上做得很好，赢得了胜利？例如，黑王子爱德华在克雷西战役时还不到16岁。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這在我看來是絕對瘋狂的，一個16歲的孩子怎麼會有體力，甚至有經驗去再次戰鬥呢？\n的體力，甚至有經驗與一些年長和更有經驗的人作戰。\n有經驗的人。更瘋狂的是，他是王位的繼承人，爲什麼在他正確的思維下，他的兒子會去打仗？\n爲什麼他的父親會允許這種事情發生？",
      "title": "在中世紀，青少年如何上戰場，不僅能生存下來，而且實際上做得很好，贏得了勝利？例如，黑王子愛德華在克雷西戰役時還不到16歲。"
    }
  ]
}