{
  "author": "envatted_love",
  "original_created_utc": 1644286523,
  "title": "\"Armenia in the east was a major source of wealth, but [it] would require regular and vigorous defence against various perennial enemies.\" Why was small, landlocked Armenia so important to the economy of the Byzantine Empire?",
  "created_utc": 1644325900,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.worldhistory.org/Byzantine_Empire/\"&gt;Full quotation is from the World History Encyclopedia (emphasis added)&lt;/a&gt;:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The geographical extent of the Byzantine Empire changed over the centuries as the military successes and failures of individual emperors fluctuated. Territories which were held in the earlier part of the empire&amp;#39;s history included Egypt, Syria, Jordan, Lebanon, and Palestine. Greece was less important in practical terms than it was as a symbol of the Byzantine&amp;#39;s view of themselves as the true heirs of the Greco-Roman culture. Italy and Sicily had to be defended, ultimately unsuccessfully, against the ambitions of the Popes and the Normans. &lt;strong&gt;The Balkans up to the Danube River were important throughout, and Asia Minor up to the Black Sea coast in the north and Armenia in the east was a major source of wealth, but both these regions would require regular and vigorous defence against various perennial enemies.&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The Byzantine entry links to &lt;a href=\"https://www.worldhistory.org/armenia/\"&gt;an entry on ancient Armenia&lt;/a&gt;, but the latter focuses on kings and borders rather than on economy.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/sn86lh/armenia_in_the_east_was_a_major_source_of_wealth/",
  "subreddit": "AskHistorians",
  "id": "sn86lh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Full quotation is from the World History Encyclopedia (emphasis added)\n[https://www.worldhistory.org/Byzantine_Empire/]:\n\n> The geographical extent of the Byzantine Empire changed over the centuries as\n> the military successes and failures of individual emperors fluctuated.\n> Territories which were…"
}