{
  "author": "smohyee",
  "the_new_excerpt": "Edit: There's a lot of great responses and info about my questions in the\ncomments! Will try to incorporate that into the post as I go, or make a followup\ntomorrow!\n\nFirst off, my position: 1900 shares of GME @ 30, plus 5 calls @ $250. Peak value\nwas nearly…",
  "original_created_utc": 1612310873,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：关于我的问题，有很多很好的回复和信息，在这里可以找到。\n评论! 我将尝试将其纳入我的文章中，或者做一个后续的文章\n明天！\n\n先说说我的仓位 一千九百股GME，30元，外加5个250元的看涨期权。最高值\n几乎是...",
      "title": "搜博评测时间--截至目前，我们可以用来评估GME的实际数据是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：關於我的問題，有很多很好的回覆和信息，在這裏可以找到。\n評論! 我將嘗試將其納入我的文章中，或者做一個後續的文章\n明天！\n\n先說說我的倉位 一千九百股GME，30元，外加5個250元的看漲期權。最高值\n幾乎是...",
      "title": "搜博評測時間--截至目前，我們可以用來評估GME的實際數據是什麼？"
    }
  ],
  "title": "SOBER REVIEW TIME - what are the actual data we can use to assess GME as of today?",
  "created_utc": 1612370853,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>Edit: There&#39;s a lot of great responses and info about my questions in the comments! Will try to incorporate that into the post as I go, or make a followup tomorrow!</em>  </p>\n\n<p>First off, my position: 1900 shares of GME @ 30, plus 5 calls @ $250. Peak value was nearly 500k.</p>\n\n<p><a href=\"https://preview.redd.it/96g5d07z45f61.png?width=1007&amp;format=png&amp;auto=webp&amp;s=4e983f8d1a6b56bcf4201d32a56b0c2535886d5b\">https://preview.redd.it/96g5d07z45f61.png?width=1007&amp;format=png&amp;auto=webp&amp;s=4e983f8d1a6b56bcf4201d32a56b0c2535886d5b</a></p>\n\n<p><em>This is not financial advice, I&#39;m not an expert, etc</em></p>\n\n<p>**WHY SHOULD WE STILL HOLD?** I know there&#39;s a lot of sentiment around solidarity, and sticking it to the man, and &#39;fuck it, I&#39;m down so much anyway&#39;. NONE OF THESE ARE GOOD REASONS TO HOLD. I&#39;m here to talk about the actual reasons to hold.</p>\n\n<p>Here&#39;s our biggest problem: <strong>Misinformation</strong></p>\n\n<p>There is a lot of information being spread around like manure. Mostly unread, mostly un-disseminated, basically just a whole bunch of positive sounding claims meant to serve as confirmation bias.</p>\n\n<p>How do we ensure we&#39;re not just buying into bullshit? <strong>By determining exactly what data we have available to make decisions as of right now</strong>. That is what I intend to review (and hopefully gather from you apes) here today.</p>\n\n<p><strong>A REVIEW OF THE FORCES ACTING ON GME</strong></p>\n\n<ol>\n<li><strong>Fundamental Value:</strong> This isn&#39;t relevant right now. GME is presently a $20/share company, even with Ryan Cohen shooting magic rainbows out of his ass it&#39;s not worth more than $60 until they actually start changing their business model. When that happens the value will go up, for now 30% above expected online revenue growth doesn&#39;t mean shit in the bigger picture.</li>\n<li><strong>Momentum:</strong> This is the biggest reason we hit $500/share, and the biggest reason we&#39;re still at $90, way above fundamental value. Here&#39;s something to consider: <strong>Momentum, not the squeeze, is why the share price is where it is -</strong> rather, the growing global awareness of the squeeze provided the evidence needed for everyone to rush to get onboard.  But, people are also idiots. Momentum can change directions quickly from an upward to downward pressure, and can be easily manipulated, as we&#39;ve seen.</li>\n<li><strong>THE SHORT SQUEEZE:</strong> What actually causes the high short interest to result in raised share prices? Short sellers who are actually (not theoretically) pressured into closing their positions at an overall loss, and en masse. If most of the shorters can wait out or hedge against their losing positions, then there never has to be a mad rush to buy up shares at whatever price. <em>Do you actually think Melvin Capital was at any point margin called?</em>  If/when they exited, they did so in an orderly fashion that best served their interest, to the point that they were straight up given a multi-billion dollar bailout by their competitors! These people don&#39;t play by the same rules as you, you fucking braindead monkey.</li>\n<li><strong>The Gamma Squeeze:</strong> Last Friday, for the second Friday in a row, a vast majority of calls expired In The Money, and a bunch of call owners were owed shares by today (T+2 rule). The theory behind the gamma squeeze is that call sellers didn&#39;t have good risk models and didn&#39;t hedge their calls well enough, and so didn&#39;t actually  own enough underlying shares to hand over, and now need to rush to buy them at market price. Could that be why there was a massive spike from 80 to 150 this afternoon? Maybe. <strong>But a gamma squeeze can also backfire</strong>. All those people assigned shares may not have the tens of thousands in cash ready to buy, or the margin to borrow. That means all those shares get dumped back on the marketplace.</li>\n<li>Straight up motherfuckin dirty illegal manipulationOh, best believe it happened, and is still happening. Just to review the hits:\n\n<ol>\n<li>DTCC and/or Retail brokers prevent buying, artificially suppressing demand for Thu price drop and locking up people&#39;s money till they could transfer elsewhere.</li>\n<li>Sudden increases to margin requirements and severe margin calling</li>\n<li>A massive media campaign to announce shorts closed positions and everyone is in Silver</li>\n<li>Retail brokers cancelling orders, restricting limit prices, enforcing unwanted stop losses (eToro),</li>\n<li>Illegal coordinated short ladder attacks to drive down price and fish for stop losses and paper hands.</li>\n</ol></li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p><strong>OK, BUT YOU KNEW ABOUT ALL THIS. WHAT&#39;S IMPORTANT NOW IS</strong></p>\n\n<p><strong><em>WHAT EVIDENCE DO WE ACTUALLY HAVE ABOUT THE CURRENT STATE OF PLAY?</em></strong></p>\n\n<p>&#x200B;</p>\n\n<p>No, really, I&#39;m asking. Our advantage is in our ability to crowdsource information. I will edit and update this list as information is shared. Meanwhile I&#39;ll try to flesh out a framework as best I can.</p>\n\n<p><strong>Argument #1: The Squeeze is not Squoze because Short Interest is still high</strong></p>\n\n<ul>\n<li>Claim: As long as the Short Interest exceeds the Float, there is a supply problem for short sellers. This <em>may</em> translate into pressure from lenders on short sellers over time, driving the squeeze.</li>\n<li>Evidence needed: What is the current short interest?\n\n<ul>\n<li>S3 partners provides estimates using a model, and as of today claim it is only <strong>51% of free float</strong>:Source: <a href=\"https://twitter.com/S3Partners/status/1356317744300490752\">https://twitter.com/S3Partners/status/1356317744300490752</a></li>\n</ul></li>\n</ul>\n\n<p><a href=\"https://preview.redd.it/7e4mes1qf5f61.png?width=277&amp;format=png&amp;auto=webp&amp;s=cfb3da83d0aaaeb2256e11bf7a3e3eaf8b31de90\">https://preview.redd.it/7e4mes1qf5f61.png?width=277&amp;format=png&amp;auto=webp&amp;s=cfb3da83d0aaaeb2256e11bf7a3e3eaf8b31de90</a></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Ortex data provides another estimate using another model, and as of yesterday claims it is only 27 mil shares, only a million shares difference from S3Source: <a href=\"https://www.ortex.com/stocks/26195/shorts\">https://www.ortex.com/stocks/26195/shorts</a></li>\n</ul>\n\n<p><a href=\"https://preview.redd.it/yo2s5e2cg5f61.png?width=1691&amp;format=png&amp;auto=webp&amp;s=d83701a452b5aaa079e3a3948cecbbb3feb77b5a\">https://preview.redd.it/yo2s5e2cg5f61.png?width=1691&amp;format=png&amp;auto=webp&amp;s=d83701a452b5aaa079e3a3948cecbbb3feb77b5a</a></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>REAL DATA:</strong> The SEC releases reported short interest twice a month. The most recent data we have is from Jan 15, and wasn&#39;t released to the public until Jan 27.**On Jan 15 the SI was 131%.**The next report for Jan 31 won&#39;t be available until Feb 9.Frankly, we can&#39;t rely on the REAL data, because it&#39;s delayed too long to be relevant.</li>\n<li>Evidence needed: What is the actual free float?\n\n<ul>\n<li>I still need help finding this. I know 71 Million shares have been issued overall, but a lot of that is locked up in institutions that would have to report any selloffs within 3 days. If 27 million shorts still need to close, how many shares are readily available?</li>\n<li>Yahoo Finance puts Float at 46.89 mil shares, FWIWSource: <a href=\"https://finance.yahoo.com/quote/GME/key-statistics/\">https://finance.yahoo.com/quote/GME/key-statistics/</a></li>\n</ul></li>\n</ul>\n\n<p><strong>Argument #2: There hasn&#39;t been enough trading volume for shorts to possibly close</strong></p>\n\n<ul>\n<li>Claim: assuming ~27 mil shorted, not enough shares exchanged hands since the price blew up to close those positions.</li>\n<li>Evidence: Someone explain to me how this isn&#39;t enough volume for shorts to cover. Mark Cuban said pretty much the same thing in his AMA today.</li>\n</ul>\n\n<table><thead>\n<tr>\n<th align=\"left\">Date</th>\n<th align=\"left\">Trade Volume</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">2/2 Tue</td>\n<td align=\"left\">77.8m</td>\n</tr>\n<tr>\n<td align=\"left\">2/1 Mon</td>\n<td align=\"left\">37.3m</td>\n</tr>\n<tr>\n<td align=\"left\">1/29 Fri</td>\n<td align=\"left\">50.5m</td>\n</tr>\n<tr>\n<td align=\"left\">1/28 Thu</td>\n<td align=\"left\">58.5m</td>\n</tr>\n<tr>\n<td align=\"left\">1/27 Wed</td>\n<td align=\"left\">93.3m</td>\n</tr>\n</tbody></table>\n\n<p><strong>Argument #3: Short Sellers will are under pressure to close, so the squeeze is coming</strong></p>\n\n<ul>\n<li>Claim: Short sellers are bleeding money trying to outlast us with their losing positions, and will eventually prefer (or be forced) to close out the loss rather than be caught in the squeeze.</li>\n<li>Evidence needed: Shorts are (on average) in a losing position at current share price ($90), and can&#39;t just close right now at profit</li>\n<li>Evidence needed: Any external pressure on shorters to close their position at a loss rather than waiting us out for the price to drop further</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>Argument #4: Market manipulation shenanigans didn&#39;t work, and retailers didn&#39;t sell off en masse, creating the liquidity shorts need to close cheaply.</strong></p>\n\n<ul>\n<li>Claim: Price dips happened during low volume trading (short ladder market manipulation etc), and the longs are holding fast.</li>\n<li>Counterevidence: THE MOTHERFUCKING $300 PRICE DROP YOU DUMB FUCKING NUGGETS</li>\n<li>Evidence: This popular screenshot of Fidelity&#39;s order ratio:Source: <a href=\"https://eresearch.fidelity.com/eresearch/gotoBL/fidelityTopOrders.jhtml\">https://eresearch.fidelity.com/eresearch/gotoBL/fidelityTopOrders.jhtml</a></li>\n</ul>\n\n<p><a href=\"https://preview.redd.it/5jnmtl00l5f61.png?width=1021&amp;format=png&amp;auto=webp&amp;s=d9e676fbd3e0811f826463f14d4b9c12971ed6b2\">https://preview.redd.it/5jnmtl00l5f61.png?width=1021&amp;format=png&amp;auto=webp&amp;s=d9e676fbd3e0811f826463f14d4b9c12971ed6b2</a></p>\n\n<ul>\n<li>Counterargument: Order counts don&#39;t mean shit. For every share traded there is a buyer and a seller. So 100k buyers buy one share each, and 40k sellers sell 3 shares each. Or 20k buyers place 5 buy orders for one share each, and there are less buyers than sellers overall. WHO KNOWS? This strikes me as very insufficient evidence for bullishness, serving only as confirmation bias for bagholders.</li>\n<li><strong>Evidence needed:</strong> Something more concrete that better proves that more shareholders held than sold.</li>\n<li>Evidence needed: other brokerages data on buy vs sell orders. Fidelity is just one broker, and a retail broker at that. Hedgies don&#39;t trade with Fidelity.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>Argument #5: The biggest dips were driven by short-ladder attacks during low volume periods</strong></p>\n\n<ul>\n<li>Claim: the decrease in price from 500 to 90 is mostly fueled by artificial suppression of demand and fake selling (short ladders), and not so much by change in momentum.</li>\n<li>Evidence: At this point its guesswork based on limited evidence provided by redditors. Essentially, round share numbers sold within microseconds at fractional prices\n\n<ul>\n<li><a href=\"https://www.reddit.com/r/wallstreetbets/comments/la682h/visual_representation_of_a_short_ladder_attack_4/\">https://www.reddit.com/r/wallstreetbets/comments/la682h/visual_representation_of_a_short_ladder_attack_4/</a></li>\n<li><a href=\"https://i.redd.it/qoyvz8grr3f61.jpg\">https://i.redd.it/qoyvz8grr3f61.jpg</a></li>\n</ul></li>\n<li>Counterargument: short ladder attacks are straight up not real, conspiracy theory confirmation bias invented by WSB itself: <a href=\"https://www.reddit.com/r/wallstreetbets/comments/latax6/short_ladders_are_not_real/\">https://www.reddit.com/r/wallstreetbets/comments/latax6/short_ladders_are_not_real/</a></li>\n<li>Evidence needed: I&#39;ve seen but can&#39;t find better video evidence showing the stream of rapid trades at fractional prices and round share counts (100 shares at a time), could use that. \\</li>\n<li>Counterargument: The artificially reduced volume from Robin Hood and other brokers limiting access has now been largely removed, as RH allows 100 shares and by now people had time to transfer funds to another broker. Damage to momentum was done, but if there is still a valid thesis it should just mean people can buy the dip, right?</li>\n<li>Evidence needed: That the price dips over the last 48 hours haven&#39;t been accompanied by massive trading volume. I&#39;m seeing a lot, especially compared to Thursday&#39;s artificial suppression:</li>\n</ul>\n\n<p><a href=\"https://preview.redd.it/77a0euotp5f61.png?width=1884&amp;format=png&amp;auto=webp&amp;s=62b0af04608cb5fb235895d8bbd03b9e19a00588\">https://preview.redd.it/77a0euotp5f61.png?width=1884&amp;format=png&amp;auto=webp&amp;s=62b0af04608cb5fb235895d8bbd03b9e19a00588</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>Argument #6: &#39;You are here on the VW short squeeze chart&#39;</strong></p>\n\n<ul>\n<li>Claim: See how the famous VW short squeeze also had a massive price drop before it blew up? That&#39;s us right now.</li>\n<li>Evidence: A single, solitary chart</li>\n</ul>\n\n<p><a href=\"https://preview.redd.it/mx6fs2f5r5f61.png?width=1242&amp;format=png&amp;auto=webp&amp;s=60cc9096c46097b7328c59c2572b3466e5241131\">https://preview.redd.it/mx6fs2f5r5f61.png?width=1242&amp;format=png&amp;auto=webp&amp;s=60cc9096c46097b7328c59c2572b3466e5241131</a></p>\n\n<ul>\n<li>Counterargument: the VW scenario was not the same as the GME play. VW share liquidity plummeted literally overnight when it was revealed that Porsche had bought up 90% of the float (check me on that fact, I&#39;m repeating secondhand info). See the big dip AFTER the squeeze? How do we know we aren&#39;t <em>there</em>?</li>\n<li>Evidence needed: IDK, some kind of coherent explanation of why VW dipped like that, and why a similar dip would be expected in the GME Play</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Will edit with more, my primate fingers are hurting from trying to press the keys and my handler needs to readjust my helmet.</p>\n</div><!-- SC_ON -->",
  "score": 35324,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/2WrQHJkA_Y1hT_Jyd6HP6MDQEwXETqOZYMuKZH6PT2I.png?auto=webp&s=fc81eb9974463fbe27fe8a52b2960920a7dc71bb",
          "width": 1007,
          "height": 147
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/2WrQHJkA_Y1hT_Jyd6HP6MDQEwXETqOZYMuKZH6PT2I.png?width=108&crop=smart&auto=webp&s=ad7579308526ee97fc3deaf894f72d8f14b7dcfa",
            "width": 108,
            "height": 15
          },
          {
            "url": "https://external-preview.redd.it/2WrQHJkA_Y1hT_Jyd6HP6MDQEwXETqOZYMuKZH6PT2I.png?width=216&crop=smart&auto=webp&s=80a3d56a87612e09dfd8f46482a1bce905cd43e9",
            "width": 216,
            "height": 31
          },
          {
            "url": "https://external-preview.redd.it/2WrQHJkA_Y1hT_Jyd6HP6MDQEwXETqOZYMuKZH6PT2I.png?width=320&crop=smart&auto=webp&s=10d97a9eea24eddad8d9b14e3828ccbf0cd6a8e8",
            "width": 320,
            "height": 46
          },
          {
            "url": "https://external-preview.redd.it/2WrQHJkA_Y1hT_Jyd6HP6MDQEwXETqOZYMuKZH6PT2I.png?width=640&crop=smart&auto=webp&s=3e9a2dc34877a981d278245e8dde4fc7b025bfc2",
            "width": 640,
            "height": 93
          },
          {
            "url": "https://external-preview.redd.it/2WrQHJkA_Y1hT_Jyd6HP6MDQEwXETqOZYMuKZH6PT2I.png?width=960&crop=smart&auto=webp&s=ec2bd7f36c64e12d7f69749a6f4835ee2a623711",
            "width": 960,
            "height": 140
          }
        ],
        "variants": {},
        "id": "fHfiViUwhTIWJ49AhiCTWhbNC4gawJQaoTdzhz7XMMM"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/wallstreetbets/comments/lbaktb/sober_review_time_what_are_the_actual_data_we_can/",
  "subreddit": "wallstreetbets",
  "id": "lbaktb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518565574
}