{
  "author": "rhetorical_twix",
  "the_new_excerpt": "I have actually tried to make the case for dry bulk shipping stocks before on\nreddit, but was unable to because most of them are microcap. You don't want to\npost about tiny stocks and then watch them pump and dump and get extremely\nerratic. Also, the system will delete any posts with some microcap…",
  "original_created_utc": 1610376801,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在此之前，我实际上已经尝试过干散货船运股票的理由。\nReddit，但无法访问，因为它们大多是微型股。你不会想要的\n发布关于微型股票的帖子，然后看他们抽空倾倒，然后变得极端\n反复无常。此外，系统将删除任何带有一些微帽…的帖子",
      "title": "在过去的一周里，我最快、最野蛮的井喷增长一直是，并将继续是…干散货集装箱运输。在你说WTF？之前，先听听这个。干船运股票日复一日地上涨10-30%，本周仍在继续，而其他反弹的股票已经开始停滞"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在此之前，我實際上已經嘗試過幹散貨船運股票的理由。\nReddit，但無法訪問，因爲它們大多是微型股。你不會想要的\n發佈關於微型股票的帖子，然後看他們抽空傾倒，然後變得極端\n反覆無常。此外，系統將刪除任何帶有一些微帽…的帖子",
      "title": "在過去的一週裏，我最快、最野蠻的井噴增長一直是，並將繼續是…幹散貨集裝箱運輸。在你說WTF？之前，先聽聽這個。幹船運股票日復一日地上漲10-30%，本週仍在繼續，而其他反彈的股票已經開始停滯"
    }
  ],
  "title": "My fastest, most savage blowout gains in the past week have been and continues to be... dry bulk container shipping. Before you say WTF?, hear this. Dry shipping stocks have been jumping up by 10-30% day after day and it's still continuing this week while other rebound stocks have started to stall",
  "created_utc": 1610419690,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have actually tried to make the case for dry bulk shipping stocks before on reddit, but was unable to because most of them are microcap. You don&#39;t want to post about tiny stocks and then watch them pump and dump and get extremely erratic. Also, the system will delete any posts with some microcap stock names in them, even if they are casual comments and not OPs. But I did find a representative ETF for this small but exploding sector, it&#39;s the Breakwave Dry Bulk Shipping ETF, BDRY. So I can post some information using BDRY as a proxy for the sector.</p>\n\n<p>Here&#39;s a chart of BDRY&#39;s stock prices in the past couple of years with a couple of other dry shipping stocks: <a href=\"https://imgur.com/cK86Dd9\">https://imgur.com/cK86Dd9</a>.</p>\n\n<p>The thing that the chart can&#39;t show, because BDRY doesn&#39;t go back that far, is how much dry bulk shipping has dropped since Trump&#39;s trade war began to ramp up in 2018. Trump&#39;s approach to trade and national economic management backfired in the US by dragging down US exports more than its trade partners, and so the US trade deficit has grown in the past few years while China&#39;s exports have grown. One thing that has driven dry bulk shipping in recent days/weeks is China&#39;s spiking need for transports, so China&#39;s trade has grown into the current carrying capacity of dry bulk shipping.</p>\n\n<p>So here&#39;s the big picture: China&#39;s trade needs (both import and export) have grown into the current carrying capacity of global dry bulk shipping, and at the same time we are in both (1) a COVID-19 related consumption low in dry bulk shipping that will lift when lockdowns do, and (2) a multi-year, decade low in dry bulk shipping due to Trump&#39;s backfired trade war, that will most likely fade as Biden faces the need to restart the trade alliances and stimulate the US economy with more trade. At the time I started investing in these stocks, I was expecting them to multiply by a factor of 10x at least. Now, I expect something less than that going forward because of the big run up in shipping stocks, but I still see at least a doubling of these stocks in 2021 and lockdowns start to lift as well as naval stocks starting to draw investment again (naval stocks, unlike airline stocks, haven&#39;t seen pre-vaccine investor interest yet).</p>\n\n<p>I wanted to get a dry bulk shipping post in because it&#39;s as sure of a thing as I know of in terms of rebound recovery stocks. I hope someone finds this helpful!</p>\n\n<p>Edit: BDRY is up big again today, 14% in the morning</p>\n\n<p>Edit 2: Because dry bulk shipping businesses have high margin and stable assets (ships), they aren&#39;t normally high growth stocks and some of them pay some of the highest dividends out there. So this is a generational opportunity for dividend portfolios, in case your dad&#39;s retirement portfolio could use some major growth.</p>\n</div><!-- SC_ON -->",
  "score": 44,
  "permalink": "/r/stocks/comments/kv451q/my_fastest_most_savage_blowout_gains_in_the_past/",
  "subreddit": "stocks",
  "id": "kv451q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706381333
}