{
  "author": "DetroitMotorShow",
  "the_new_excerpt": "Cryptopunks are a series of rare NFTs created by Larvalabs on the Ethereum\nnetwork, and due to the rare nature they are selling at a great premium to their\ninitial cost.\n\nNow Binance has stolen not only the idea, but the whole set of original artworks\ncreated on Ethereum by Larvalabs and are selling…",
  "original_created_utc": 1614140538,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Cryptopunks是由Larvalabs在Ethereum上创建的一系列罕见的NFT。\n网络，而且由于其稀有性，它们的销售价格比它们的价格高出很多。\n的初始成本。\n\n现在，Binance不仅窃取了这个创意，还窃取了整套原创作品\n由Larvalabs在Ethereum上创建的，正在销售... ...",
      "title": "Binance盗取了Cryptopunks在Ethereum上创作的艺术品，现在正在Binance链上销售这些盗取的副本。这是公然盗窃艺术品的行为。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Cryptopunks是由Larvalabs在Ethereum上創建的一系列罕見的NFT。\n網絡，而且由於其稀有性，它們的銷售價格比它們的價格高出很多。\n的初始成本。\n\n現在，Binance不僅竊取了這個創意，還竊取了整套原創作品\n由Larvalabs在Ethereum上創建的，正在銷售... ...",
      "title": "Binance盜取了Cryptopunks在Ethereum上創作的藝術品，現在正在Binance鏈上銷售這些盜取的副本。這是公然盜竊藝術品的行爲。"
    }
  ],
  "title": "Binance has stolen Cryptopunks artworks which were created on Ethereum, and are now selling these stolen copies on Binance chain. This is blatant theft of artwork.",
  "created_utc": 1614166310,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Cryptopunks are a series of rare NFTs created by Larvalabs on the Ethereum network, and due to the rare nature they are selling at a great premium to their initial cost. </p>\n\n<p>Now Binance has stolen not only the idea, but the whole set of original artworks created on Ethereum by Larvalabs and are selling these on BSC binance smart chain at a fraction of their cost. These are nothing more than FAKES. </p>\n\n<p>This has forced Larvalabs to issue a warning:</p>\n\n<blockquote>\n<p>Warning: There is a project called &quot;Binance Punks&quot; that has taken the art from CryptoPunks and is selling it as a copy on another chain. This is in no way an authorized project.</p>\n</blockquote>\n\n<p>I understand the need for low txn costs on BSC, but this is not about low transaction costs. This is straight up fraud and theft of intellectual property.</p>\n\n<p>I can understand if the idea is stolen (which is still shady but with open source software and credits given its acceptable) but stealing artwork made by someone else and running this on your chain is a terrible practice.</p>\n</div><!-- SC_ON -->",
  "score": 290,
  "permalink": "/r/CryptoCurrency/comments/lr3jbo/binance_has_stolen_cryptopunks_artworks_which/",
  "subreddit": "CryptoCurrency",
  "id": "lr3jbo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332880689
}