{
  "approved_at_utc": null,
  "subreddit": "investing",
  "selftext": "Edit: Skip ahead to **\"Electrifying the grid: The truth\"** if you want to get right to the thesis.. \n\nTesla is currently sitting on a P/S ratio of roughly 25.0. This is as compared to other mature industrial conglomerates that trade at P/S between 1.0-2.0 (ie Siemans, Northrup). This represents an extreme overstep in share price versus revenue growth: the share price in the last few years has vastly exceeded revenue growth, **meaning the stock has rewarded existing holders with an advance of future growth that has not yet happened**.\n\nNote: I use P/S rather than P/E for comparison because it isn't fair to Tesla to look at their PE as they are heavily investing.\n\nThe bull case assumes Tesla will grow revenue into their valuation and even exceed all current expectations. In other words their revenue will increase and eventually when they reach maturity they'll trade at a similar P/S to peers (although possibly on the higher end of the range)\n\nThe bull case requires future Tesla revenues exceed 1400% total revenue growth on top of whatever S&amp;P growth is happening **just to keep up with expectations already factored into the share price**. Zero margin for error.\n\nA large part of this revenue growth is expected to come from energy related businesses with $200-$300b+ generally cited by bulls..\n\nWhat happens if markets/analysts at some point realize Tesla won't be able to grow at their prophesized 50-60% a year, but instead 20-40%? See Cisco circa 2000 for a lesson in what happens when growth expectations drop.\n\n**I don't think Tesla is going to crash this year, not even next year**. Most money flows are short-minded, and investors will need proof of a deceleration. These catalysts will come, probably around 2024/2025...\n\n**Electrifying the grid: the truth**\n\nThe biggest bull case for Tesla's valuation as \"not just a car company\" is a grossed up comparison of how much $$ the world currently spends today on coal/gas/oil, and then assuming Tesla will be able to take a large share of this market at high margins.\n\nThere's a reason I don't know a single utility analyst that is bullish on Tesla. It's important to understand how regulated utilities work. Utilities, unlike normal companies, do not get paid to sell product or services..instead they get paid indirectly for grid improvement &amp; maintenance.\n\nThe way this works:\n\n* A utility first gets approval from their municipality for a project (ie replace a coal plant with wind/solar)\n* The utility then generally borrows money via bond or equity issuance to pay for the project.\n* The state sets an allowed rate of return the utility can earn on their asset base. If needed, they'll allow an increase in utility rates so that the utility can pay off that loan and earn a reasonable return on top.\n\nPoint #3 is the biggest impediment to electrification, and why it will take at least 30 years. Politicians are going to be unwilling to allow energy bills to raise fast enough to do this transition fast. Oh, and with regards to paying for materials, **utilities will go with whatever is cheap**. Cheap low-margin batteries, cheap low-margin solar. Tesla may command some early market dominance, but this is going to fade way to market forces. Utilities will be incentived to keep these costs down.\n\nUnlike Tesla's car business, where folks are willing to pay a premium for a nice car, the battery/solar business has no moat. It's easy for competitors to come in and underbid, and they'll have many years to catch up.\n\nLets also talk a bit more about moat. Oil has plenty of it with Opec/Russia being run by literal mafias. How about natural gas? In the US - since fracking has become a thing - not so much. See ticker EQT, they are the number one natural gas producer in the US - more natgas production than Exxon - **yet their entire market cap is under $10 billion**. The market capture here isn't anywhere near what bulls are claiming.\n\n**Scaling the company**\n\nLots of talk has been made as to the potential for Tesla to scale to become a \"giga company\" including into other businesses such as insurance, taxis, etc. Besides the fact that insurance &amp; taxis are low margin businesses and Tesla has no moat in the space, let's talk about scale...\n\nConsider this for a moment. Tesla has currently about 70k employees, many of them highly motivated, and some of the best engineers on the planet.\n\n* How many of those engineers will still be around in 2 years, 5 years? How many are going to retire (rich) once their stock vests (4 year vesting period)?\n* How many more employees will Tesla need to hire to scale to a business that sells 10 million cars annual, insurance, taxis, energy? Even with automation we're talking about 100s of thousands of employees.\n* What is Tesla? Is Elon Musk Tesla? Or the 70k employees? Will they need to lower the hiring bar as they scale up?\n* If the first generation employees were the innovators, the second will have to pick up from the prior group and maintain the company. Will the second generation, third generation engineers be as motivated as the first generation that were able to partake in original share increase?\n\nPurpose of the above is to help folks understand *the Tesla of 2030 will organizationally bear no resemblance to that of 2022*. Literally all the surviving dotcom companies that sit atop NASDAQ today struggled with this originally. Consider all the failed Google or Microsoft ventures.\n\nFor Tesla to become a $3 trillion dollar company, it can't be the Elon show. For reference though, **Tesla currently has the worst glassdoor reviews out of any company in the VTI top 10** (3.7/5.0), just barely below Amazon's 3.8 with 1+ million employees. This is despite the fact many Tesla employees have shared in the wealth thanks to stock grants. They are known to overwork their folks. This isn't a good sign for a company that still needs to scale at least 5-fold in hiring.\n\nOne last nugget.. Stock price and revenue growth don't always move in the same direction, not when one has overstepped the other excessively so.",
  "author_fullname": "t2_9hxza",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Why Tesla will hit an unexpected \"wall\", and it has nothing to do with cars",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/investing",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_rz7beq",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.73,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 46,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 46,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1641675958,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1641668962,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.investing",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Edit: Skip ahead to &lt;strong&gt;&amp;quot;Electrifying the grid: The truth&amp;quot;&lt;/strong&gt; if you want to get right to the thesis.. &lt;/p&gt;\n\n&lt;p&gt;Tesla is currently sitting on a P/S ratio of roughly 25.0. This is as compared to other mature industrial conglomerates that trade at P/S between 1.0-2.0 (ie Siemans, Northrup). This represents an extreme overstep in share price versus revenue growth: the share price in the last few years has vastly exceeded revenue growth, &lt;strong&gt;meaning the stock has rewarded existing holders with an advance of future growth that has not yet happened&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;Note: I use P/S rather than P/E for comparison because it isn&amp;#39;t fair to Tesla to look at their PE as they are heavily investing.&lt;/p&gt;\n\n&lt;p&gt;The bull case assumes Tesla will grow revenue into their valuation and even exceed all current expectations. In other words their revenue will increase and eventually when they reach maturity they&amp;#39;ll trade at a similar P/S to peers (although possibly on the higher end of the range)&lt;/p&gt;\n\n&lt;p&gt;The bull case requires future Tesla revenues exceed 1400% total revenue growth on top of whatever S&amp;amp;P growth is happening &lt;strong&gt;just to keep up with expectations already factored into the share price&lt;/strong&gt;. Zero margin for error.&lt;/p&gt;\n\n&lt;p&gt;A large part of this revenue growth is expected to come from energy related businesses with $200-$300b+ generally cited by bulls..&lt;/p&gt;\n\n&lt;p&gt;What happens if markets/analysts at some point realize Tesla won&amp;#39;t be able to grow at their prophesized 50-60% a year, but instead 20-40%? See Cisco circa 2000 for a lesson in what happens when growth expectations drop.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;I don&amp;#39;t think Tesla is going to crash this year, not even next year&lt;/strong&gt;. Most money flows are short-minded, and investors will need proof of a deceleration. These catalysts will come, probably around 2024/2025...&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Electrifying the grid: the truth&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The biggest bull case for Tesla&amp;#39;s valuation as &amp;quot;not just a car company&amp;quot; is a grossed up comparison of how much $$ the world currently spends today on coal/gas/oil, and then assuming Tesla will be able to take a large share of this market at high margins.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a reason I don&amp;#39;t know a single utility analyst that is bullish on Tesla. It&amp;#39;s important to understand how regulated utilities work. Utilities, unlike normal companies, do not get paid to sell product or services..instead they get paid indirectly for grid improvement &amp;amp; maintenance.&lt;/p&gt;\n\n&lt;p&gt;The way this works:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;A utility first gets approval from their municipality for a project (ie replace a coal plant with wind/solar)&lt;/li&gt;\n&lt;li&gt;The utility then generally borrows money via bond or equity issuance to pay for the project.&lt;/li&gt;\n&lt;li&gt;The state sets an allowed rate of return the utility can earn on their asset base. If needed, they&amp;#39;ll allow an increase in utility rates so that the utility can pay off that loan and earn a reasonable return on top.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Point #3 is the biggest impediment to electrification, and why it will take at least 30 years. Politicians are going to be unwilling to allow energy bills to raise fast enough to do this transition fast. Oh, and with regards to paying for materials, &lt;strong&gt;utilities will go with whatever is cheap&lt;/strong&gt;. Cheap low-margin batteries, cheap low-margin solar. Tesla may command some early market dominance, but this is going to fade way to market forces. Utilities will be incentived to keep these costs down.&lt;/p&gt;\n\n&lt;p&gt;Unlike Tesla&amp;#39;s car business, where folks are willing to pay a premium for a nice car, the battery/solar business has no moat. It&amp;#39;s easy for competitors to come in and underbid, and they&amp;#39;ll have many years to catch up.&lt;/p&gt;\n\n&lt;p&gt;Lets also talk a bit more about moat. Oil has plenty of it with Opec/Russia being run by literal mafias. How about natural gas? In the US - since fracking has become a thing - not so much. See ticker EQT, they are the number one natural gas producer in the US - more natgas production than Exxon - &lt;strong&gt;yet their entire market cap is under $10 billion&lt;/strong&gt;. The market capture here isn&amp;#39;t anywhere near what bulls are claiming.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Scaling the company&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Lots of talk has been made as to the potential for Tesla to scale to become a &amp;quot;giga company&amp;quot; including into other businesses such as insurance, taxis, etc. Besides the fact that insurance &amp;amp; taxis are low margin businesses and Tesla has no moat in the space, let&amp;#39;s talk about scale...&lt;/p&gt;\n\n&lt;p&gt;Consider this for a moment. Tesla has currently about 70k employees, many of them highly motivated, and some of the best engineers on the planet.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;How many of those engineers will still be around in 2 years, 5 years? How many are going to retire (rich) once their stock vests (4 year vesting period)?&lt;/li&gt;\n&lt;li&gt;How many more employees will Tesla need to hire to scale to a business that sells 10 million cars annual, insurance, taxis, energy? Even with automation we&amp;#39;re talking about 100s of thousands of employees.&lt;/li&gt;\n&lt;li&gt;What is Tesla? Is Elon Musk Tesla? Or the 70k employees? Will they need to lower the hiring bar as they scale up?&lt;/li&gt;\n&lt;li&gt;If the first generation employees were the innovators, the second will have to pick up from the prior group and maintain the company. Will the second generation, third generation engineers be as motivated as the first generation that were able to partake in original share increase?&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Purpose of the above is to help folks understand &lt;em&gt;the Tesla of 2030 will organizationally bear no resemblance to that of 2022&lt;/em&gt;. Literally all the surviving dotcom companies that sit atop NASDAQ today struggled with this originally. Consider all the failed Google or Microsoft ventures.&lt;/p&gt;\n\n&lt;p&gt;For Tesla to become a $3 trillion dollar company, it can&amp;#39;t be the Elon show. For reference though, &lt;strong&gt;Tesla currently has the worst glassdoor reviews out of any company in the VTI top 10&lt;/strong&gt; (3.7/5.0), just barely below Amazon&amp;#39;s 3.8 with 1+ million employees. This is despite the fact many Tesla employees have shared in the wealth thanks to stock grants. They are known to overwork their folks. This isn&amp;#39;t a good sign for a company that still needs to scale at least 5-fold in hiring.&lt;/p&gt;\n\n&lt;p&gt;One last nugget.. Stock price and revenue growth don&amp;#39;t always move in the same direction, not when one has overstepped the other excessively so.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qhhq",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "rz7beq",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "cr0ne",
  "discussion_type": null,
  "num_comments": 55,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/investing/comments/rz7beq/why_tesla_will_hit_an_unexpected_wall_and_it_has/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/investing/comments/rz7beq/why_tesla_will_hit_an_unexpected_wall_and_it_has/",
  "subreddit_subscribers": 1978491,
  "created_utc": 1641679200,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1641668962,
  "the_new_excerpt": "Edit: Skip ahead to \"Electrifying the grid: The truth\" if you want to get right\nto the thesis..\n\nTesla is currently sitting on a P/S ratio of roughly 25.0. This is as compared\nto other mature industrial conglomerates that trade at P/S between 1.0-2.0 (ie\nSiemans, Northrup). This represents an…"
}