{
  "author": "No_Examination_2681",
  "original_created_utc": 1626392347,
  "title": "United States citizens can no longer short Bitcoin or participate in leveraged digital asset transactions unless they're filthy rich!",
  "created_utc": 1626435122,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>On June 23, 2021, the Commodity Exchange Act (CEA) went into effect in the United States. The CEA set new guidelines for retail investors (people like you and me) to trade crypto with margin. For individuals or retail investors, to be eligible to trade crypto with margin, you must be certified as an Eligible Contract Participant (ECP). A retail investor must have $10 million in assets to be certified as an ECP. </p>\n\n<p>You can view the requirements here.</p>\n\n<p><a href=\"https://content.next.westlaw.com/7-521-8340?__lrTS=20201013065041926&amp;transitionType=Default&amp;contextData=(sc.Default\">https://content.next.westlaw.com/7-521-8340?__lrTS=20201013065041926&amp;transitionType=Default&amp;contextData=(sc.Default)&amp;firstPage=true</a>&amp;firstPage=true)</p>\n\n<p>Additionally, you can view Kraken&#39;s new blog about leveraged digital asset transactions here. </p>\n\n<p><a href=\"https://blog.kraken.com/post/9514/new-requirements-for-u-s-and-starter-tier-clients-to-qualify-for-margin-trading/\">https://blog.kraken.com/post/9514/new-requirements-for-u-s-and-starter-tier-clients-to-qualify-for-margin-trading/</a></p>\n\n<p>So what does this mean for regular US citizens like you and me? For starters, it means that US citizens can no longer short sell bitcoin. You might ask, &quot;Can&#39;t we just short bitcoin without leverage?&quot; well no, you can&#39;t! It is impossible to short any assets without leverage since the nature of shorting involves borrowing a security, then selling it on the open market. We are once again being suppressed by the government. The US government saw that normal people were getting rich, bringing themselves out of poverty, and they decided to stop it. I have been leverage trading bitcoin for about 5 years now and I have made a good life for myself. I was able to pay off my student loans and pay off my car leveraging bitcoin in my spare time and I have always paid Uncle Sam my fair share of taxes when I profit. </p>\n\n<p>Look, I am all for government regulation in crypto. I think that in order for Bitcoin to get mainstream adoption, there needs to be more government regulation. However, with this new definition of an ECP the US government is only looking after corporate America and all of their wealthy friends, not its citizens. So now if I want to short bitcoin or trade with leverage, I have to renounce my citizenship and move to another country. And obviously, I know that I can use a VPN, but the prison system in America is one of the worst in the world, and it&#39;s not worth the risk if you ask me.</p>\n\n<p>&#x200B;</p>\n\n<p>.... I think it is kind of funny that the US government is always saying that Bitcoin is only used by criminals and for money laundering. Well now by leverage trading any digital asset you are now considered a criminal... unless you are filthy rich, then you&#39;re fine.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/Bitcoin/comments/ol4ryi/united_states_citizens_can_no_longer_short/",
  "subreddit": "Bitcoin",
  "id": "ol4ryi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "On June 23, 2021, the Commodity Exchange Act (CEA) went into effect in the\nUnited States. The CEA set new guidelines for retail investors (people like you\nand me) to trade crypto with margin. For individuals or retail investors, to be\neligible to trade crypto with margin, you must be certified as an…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2021年6月23日、米国で商品取引所法（CEA）が施行されました。\n米国で施行されます。CEAは、個人投資家（あなたや私のような人）が証拠金を使って暗号を取引するための新しいガイドラインを設定しました。\nが証拠金を使って暗号を取引するための新しいガイドラインを定めました。個人または個人投資家は、以下の条件を満たす必要があります。\n証拠金を使って暗号を取引する資格を得るためには、個人または個人投資家として認定されなければなりません...",
      "title": "米国市民は、金持ちでない限り、ビットコインをショートしたり、レバレッジをかけたデジタル資産取引に参加することはできません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "2021年6月23日，《商品交易法》（CEA）在美国开始生效。\n美国生效。CEA为零售投资者（像你和我这样的人）设定了新的准则，让他们用保证金交易加密货币。\n和我）用保证金交易加密货币的新准则。对于个人或零售投资者来说，要想获得\n有资格用保证金进行加密货币交易，你必须被认证为一个合格的交易商。",
      "title": "美国公民不能再做空比特币或参与杠杆式数字资产交易，除非他们是富得流油的人!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2021年6月23日，《商品交易法》（CEA）在美國開始生效。\n美國生效。CEA爲零售投資者（像你和我這樣的人）設定了新的準則，讓他們用保證金交易加密貨幣。\n和我）用保證金交易加密貨幣的新準則。對於個人或零售投資者來說，要想獲得\n有資格用保證金進行加密貨幣交易，你必須被認證爲一個合格的交易商。",
      "title": "美國公民不能再做空比特幣或參與槓桿式數字資產交易，除非他們是富得流油的人!"
    }
  ]
}