{
  "author": "firedog7881",
  "original_created_utc": 1639443752,
  "title": "Why can’t electric vehicles use total regen braking?",
  "created_utc": 1639475147,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Here is my example. A Tesla has two regen settings and you can do one pedal driving to a point. My question relates to the need for physical disc brakes and whether they’re really needed. What is it that prevents using the motor as the brake? Is it legalities at this point? Does this generate too much electricity too fast for the battery to ingest? Is it the wiring? &lt;/p&gt;\n\n&lt;p&gt;I’ve heard that an electric drive motor could easily lock up the tires of a car at high speed so I don’t think it is the motor.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/askscience/comments/rfv5w5/why_cant_electric_vehicles_use_total_regen_braking/",
  "subreddit": "askscience",
  "id": "rfv5w5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Here is my example. A Tesla has two regen settings and you can do one pedal\ndriving to a point. My question relates to the need for physical disc brakes and\nwhether they’re really needed. What is it that prevents using the motor as the\nbrake? Is it legalities at this point? Does this generate too…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "以下は私の例です。テスラには2つのリジェネ設定があり、片方のペダルで\nの運転は、ある程度まで。私の質問は、物理的なディスクブレーキの必要性についてと\n本当に必要なのか？モーターを使わない理由は何ですか？\nブレーキは？この際、法律的なことなのでしょうか？この場合、あまりに...",
      "title": "なぜ電気自動車はトータルリージェンブレーキが使えないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "下面是我的例子。特斯拉有两个再生设置，你可以做一个踏板\n驾驶到一定程度。我的问题涉及到对物理盘式制动器的需要，以及是否真的需要。\n它们是否真的需要。是什么阻止了将电机作为\n刹车？在这一点上是法律问题吗？这是否产生了太...",
      "title": "为什么电动汽车不能使用完全再生制动？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "下面是我的例子。特斯拉有兩個再生設置，你可以做一個踏板\n駕駛到一定程度。我的問題涉及到對物理盤式制動器的需要，以及是否真的需要。\n它們是否真的需要。是什麼阻止了將電機作爲\n剎車？在這一點上是法律問題嗎？這是否產生了太...",
      "title": "爲什麼電動汽車不能使用完全再生制動？"
    }
  ]
}