{
  "author": "GreenForest333",
  "original_created_utc": 1641495303,
  "title": "Why do I feel hurt when my best friend says things like \"men can never be as good as a kisser as women\" \"Men can never be good at sex\" \"men are all creeps\" \"men can't even last 5 mins\" \"men can't be sexy\" \"men are all the same\"?",
  "created_utc": 1641510307,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When she says this the other girls laugh and I go quiet and feel awful. She then sometimes goes &amp;quot;not you though&amp;quot; to me but still I feel hurt. I don&amp;#39;t know if this is just me who feels this way? I have been sexually harassed by 2 of my X&amp;#39;s in the past so maybe that has something to do with it. As they used to say that sort of stuff to me. Am I alone? Has anyone else experienced this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/rxly4t/why_do_i_feel_hurt_when_my_best_friend_says/",
  "subreddit": "TooAfraidToAsk",
  "id": "rxly4t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "When she says this the other girls laugh and I go quiet and feel awful. She then\nsometimes goes \"not you though\" to me but still I feel hurt. I don't know if\nthis is just me who feels this way? I have been sexually harassed by 2 of my X's\nin the past so maybe that has something to do with it. As…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼女がそう言うと、他の女の子たちは笑い、私は黙ってしまい、ひどい思いをしました。すると彼女は\nでも、やっぱり傷つくんです。でも\nこのように感じるのは私だけでしょうか？私はXの2人からセクハラを受けたことがあります。\nというのも、もしかしたらそれが関係しているのかもしれません。として・・・。",
      "title": "親友に「男は女ほどキスがうまくない」「男はセックスがうまくない」「男はみんなキモい」「男は5分ももたない」「男はセクシーになれない」「男はみんな同じ」などと言われると、なぜ傷つくのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当她这样说时，其他女孩都笑了，而我则安静下来，感觉很糟糕。然后她\n有时她会对我说 \"虽然不是你\"，但我仍然感到很受伤。我不知道这是不是\n是不是只有我有这种感觉？我曾经被我的两个X的性骚扰过。\n因此，也许这与它有关系。正如...",
      "title": "为什么当我最好的朋友说 \"男人永远不可能像女人一样会接吻\"\"男人永远不可能善于做爱\"\"男人都是变态\"\"男人甚至不能坚持5分钟\"\"男人不可能性感\"\"男人都是一样的 \"这样的话时，我感到很受伤？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當她這樣說時，其他女孩都笑了，而我則安靜下來，感覺很糟糕。然後她\n有時她會對我說 \"雖然不是你\"，但我仍然感到很受傷。我不知道這是不是\n是不是隻有我有這種感覺？我曾經被我的兩個X的性騷擾過。\n因此，也許這與它有關係。正如...",
      "title": "爲什麼當我最好的朋友說 \"男人永遠不可能像女人一樣會接吻\"\"男人永遠不可能善於做愛\"\"男人都是變態\"\"男人甚至不能堅持5分鐘\"\"男人不可能性感\"\"男人都是一樣的 \"這樣的話時，我感到很受傷？"
    }
  ]
}