{
  "author": "Haigfish",
  "the_new_excerpt": "I’ve been a member of this community along with the other big stock market\ncommunities on Reddit for a couple of years now. I used to really enjoy reading\nDDs on obscure or interesting companies. I loved checking the sub each day\nbecause I never knew what new pieces of information I would find. Some…",
  "original_created_utc": 1612441706,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我和其他大股民一起成为了这个社区的成员。\n社区在Reddit上已经有几年了。我曾经非常喜欢阅读\n晦涩或有趣的公司的DD。我喜欢每天查看子\n因为我永远不知道我会发现什么新的信息。有些...",
      "title": "现在的普通投资者哪里能在Reddit上获得股票信息？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和其他大股民一起成爲了這個社區的成員。\n社區在Reddit上已經有幾年了。我曾經非常喜歡閱讀\n晦澀或有趣的公司的DD。我喜歡每天查看子\n因爲我永遠不知道我會發現什麼新的信息。有些...",
      "title": "現在的普通投資者哪裏能在Reddit上獲得股票信息？"
    }
  ],
  "title": "Where can a regular investor get stock information on Reddit these days?",
  "created_utc": 1612453334,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been a member of this community along with the other big stock market communities on Reddit for a couple of years now. I used to really enjoy reading DDs on obscure or interesting companies. I loved checking the sub each day because I never knew what new pieces of information I would find. Some of my favorite stocks I found searching through new/hot. With the whole GME fiasco (I like WSB but I like to keep it separate from my actual investments) every single stock market community seems to be exclusively focused on pumps or squeezes or meme stocks and I just want a community to discuss interesting companies and fundamentals. Is there any subreddit people could recommend me for this? I wouldn’t exactly consider myself a value investor but I do look for reasonably valued growth companies.</p>\n</div><!-- SC_ON -->",
  "score": 815,
  "permalink": "/r/stocks/comments/lcele5/where_can_a_regular_investor_get_stock/",
  "subreddit": "stocks",
  "id": "lcele5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123200912
}