{
  "author": "M2RSHY",
  "the_new_excerpt": "MOON sentiment is rising to levels we saw in 2017, and I do agree that things\nare different this time, BUT as with any investment, you should always expect\nthat ANYTHING can happen.\n\nThere WILL be another healthy sizable pullback. It's a matter of WHEN, not IF.\nCould be today, tomorrow, next year or…",
  "original_created_utc": 1609026075,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "月球情绪正在上升到我们在2017年看到的水平，我确实同意这一点\n这一次有所不同，但与任何投资一样，您应该始终期待\n任何事情都有可能发生。\n\n还会有另一次健康的大规模回调。这只是时间问题，不是会不会的问题。\n可能是今天、明天、明年或…",
      "title": "对于新手和那些在牛市期间感受到FOMO压力的人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "月球情緒正在上升到我們在2017年看到的水平，我確實同意這一點\n這一次有所不同，但與任何投資一樣，您應該始終期待\n任何事情都有可能發生。\n\n還會有另一次健康的大規模回調。這只是時間問題，不是會不會的問題。\n可能是今天、明天、明年或…",
      "title": "對於新手和那些在牛市期間感受到FOMO壓力的人"
    }
  ],
  "title": "For the newbies and those feeling the pressures of FOMO during bull run",
  "created_utc": 1609076045,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>MOON sentiment is rising to levels we saw in 2017, and I do agree that things are different this time, BUT as with any investment, you should always expect that ANYTHING can happen.</p>\n\n<p>There WILL be another healthy sizable pullback. It&#39;s a matter of WHEN, not IF. Could be today, tomorrow, next year or in 5 years. Odds are that it will be sooner, rather than later.</p>\n\n<p>For the average person who can only spare a small percentage of their income, my advice would be to invest as below (or some sort of variation of the below):</p>\n\n<ol>\n<li>Dollar Cost Averaging (DCA) - Pick your favourite exchange and set up automatic buys. Daily, weekly, fortnightly, monthly - whatever you can SAFELY afford. You don&#39;t want to feel like you have to sell at some stage if you are running low on fiat. Set and forget. HODL.</li>\n<li>Lump Sum Purchasing* - Take 25-50% of the amount you calculated for DCA&#39;ing, and instead put it aside in an account for two reasons.<br/>\n\n<ol>\n<li>Buying The Dip - Pretty self explanatory really. Buy when it&#39;s cheap, to maximize your investment. </li>\n<li>FOMO Buying - FOMO happens to even the best of us, trust me. What matters is how you react to the feeling. In moments of FOMO (bull runs), you may be just a click or two from depositing ALL your money in, which could be disastrous if the price drops significantly. Instead, invest a smaller percentage of this fund to help keep your emotions in check.</li>\n</ol></li>\n</ol>\n\n<p>*My personal rule with lump sum purchasing, is to always invest 50% of my fund, regardless of whether I&#39;m buying the dip, or FOMO buying. If I buy at the All-Time-High (ATH) and it crashes, that allows me to buy the dip and average my cost down significantly. Vice versa, if I buy the dip and we see a bull run, it allows me to continue buying as the price goes up. By investing 50% of the value of my fund each buy, it typically never reaches $0.</p>\n\n<p><strong>Regardless of the above, the #1 rule is still to buy &amp; HODL. As we continue to see ATHs, EVERYONE who has HODL has made money.</strong></p>\n</div><!-- SC_ON -->",
  "score": 142,
  "permalink": "/r/Bitcoin/comments/kksmxr/for_the_newbies_and_those_feeling_the_pressures/",
  "subreddit": "Bitcoin",
  "id": "kksmxr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495329053
}