{
  "author": "No_Consideration8450",
  "original_created_utc": 1628554888,
  "title": "When do people start wanting sex?",
  "created_utc": 1628587424,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m a 16 year old girl. I have a completely normal libido, I have had health issues in the past but currently I have no hormonal issues. I just don’t find sex appealing.</p>\n\n<p>I think I knew something was off when I kissed someone I’d thought I had a crush on and didn’t feel anything at all. </p>\n\n<p>I don’t really think I find anyone attractive either. People are beautiful but when I hear others talk about attraction it’s so foreign to me.</p>\n\n<p>Am I just being a prude? This is so frustrating.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/p1e3mf/when_do_people_start_wanting_sex/",
  "subreddit": "TooAfraidToAsk",
  "id": "p1e3mf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m a 16 year old girl. I have a completely normal libido, I have had health\nissues in the past but currently I have no hormonal issues. I just don’t find\nsex appealing.\n\nI think I knew something was off when I kissed someone I’d thought I had a crush\non and didn’t feel anything at all.\n\nI don’t…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は16歳の女の子です。性欲は完全に正常で、過去に健康上の問題がありましたが、現在はホルモン上の問題はありません。\n過去に健康上の問題がありましたが、現在はホルモン上の問題はありません。ただ、私には\nセックスに魅力を感じません。\n\n私が何かを感じたのは、片思いしていた人とキスをしたときです。\nキスしても何も感じなかったので、何かおかしいと思ったんだと思います。\n\n私には...",
      "title": "人はいつ頃からセックスを求めるようになるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个16岁的女孩。我有完全正常的性欲。\n过去有健康问题，但目前我没有荷尔蒙问题。我只是不觉得\n性爱的吸引力。\n\n我想当我吻了一个我认为自己有好感的人时，我就知道事情不对劲了。\n而我根本没有任何感觉。\n\n我不...",
      "title": "人们什么时候开始想要性？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個16歲的女孩。我有完全正常的性慾。\n過去有健康問題，但目前我沒有荷爾蒙問題。我只是不覺得\n性愛的吸引力。\n\n我想當我吻了一個我認爲自己有好感的人時，我就知道事情不對勁了。\n而我根本沒有任何感覺。\n\n我不...",
      "title": "人們什麼時候開始想要性？"
    }
  ]
}