{
  "author": "danieldonalduck",
  "original_created_utc": 1660634673,
  "title": "crypto has helped me save money for the first time in my life.",
  "created_utc": 1660649814,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 25 years old and have never had the ability to save money. I&amp;#39;m an impulse spender,  and whenever my paycheck came it would go to Take-out/booze,  useless stuff or gaming. A friend suggested I buy in the dip in July,  I was a little late but I still got in pretty low and now for the past month I&amp;#39;ve been throwing every spare cent I have into eth/bitcoin.&lt;/p&gt;\n\n&lt;p&gt;I know everyone says you shouldn&amp;#39;t put more money in than you are willing to lose,  but this money would have been wasted anyway,  right?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m now the proud owner of almost half an eth and about a quarter of that in bitcoin. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m really hoping for a nice pump in the coming months so that I can take the money out and buy an engagement ring for my girlfriend, and start over with my crypto investments again. &lt;/p&gt;\n\n&lt;p&gt;Thanks to everyone in the sub for all the information and tips over the past month,  I&amp;#39;ve been following the daily discussions and checking up for new info every couple of hours,  and I think I&amp;#39;m really starting to get the hang of all of this. (although I know there is still a lot to learn) &lt;/p&gt;\n\n&lt;p&gt;Cheers everyone! I appreciate you all.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 317,
  "permalink": "/r/CryptoCurrency/comments/wpnsb1/crypto_has_helped_me_save_money_for_the_first/",
  "subreddit": "CryptoCurrency",
  "id": "wpnsb1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm 25 years old and have never had the ability to save money. I'm an impulse\nspender, and whenever my paycheck came it would go to Take-out/booze, useless\nstuff or gaming. A friend suggested I buy in the dip in July, I was a little\nlate but I still got in pretty low and now for the past month I've…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は25歳ですが、今までお金を貯める力がありませんでした。私は衝動的な浪費家です。\nを使うタイプで、給料が入ると外食や酒、無駄なもの、ゲームに使ってしま\nもの、ゲームなどに使っていました。友人に勧められて、7月の下落局面で購入しました。\n少し遅かったのですが、それでもかなり安く買えたので、この1ヶ月は...",
      "title": "cryptoのおかげで、生まれて初めてお金を貯めることができました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今年25岁，从来没有过存钱的能力。我是一个冲动型的\n我是一个冲动型的人，每当我的工资到手，就会去买外卖/喝酒，买无用的东西或游戏。\n东西或游戏。一个朋友建议我在7月的下跌中买入，我有点晚了，但我还是以相当低的价格买入。\n但我还是以很低的价格买入了，现在在过去的一个月里，我已经...",
      "title": "晶体管帮助我在生活中第一次存钱。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今年25歲，從來沒有過存錢的能力。我是一個衝動型的\n我是一個衝動型的人，每當我的工資到手，就會去買外賣/喝酒，買無用的東西或遊戲。\n東西或遊戲。一個朋友建議我在7月的下跌中買入，我有點晚了，但我還是以相當低的價格買入。\n但我還是以很低的價格買入了，現在在過去的一個月裏，我已經...",
      "title": "晶體管幫助我在生活中第一次存錢。"
    }
  ]
}