{
  "author": "J0k3ling",
  "original_created_utc": 1636974486,
  "title": "\"Buying land today in virtual worlds feel a lot like buying land in Manhattan in 1750.\" - Janine Yorio, head of real estate at Republic",
  "created_utc": 1636986657,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>And that&#39;s why I&#39;m extremely bullish on GameFi projects these days. You have probably seen these coins pumping the last few weeks while everything else was dumping. The market for regular NFTs seems oversaturated, NFTs with utility, like Land NFTs seem to be the next big trend imo. The crypto real estate boom is coming guys, in fact with the prices on Decentraland/Axie landholding, it might already be here, I&#39;m in a couple of low marketcap gems though to make up for being late (shoutout RisingSun), but I&#39;m feeling pretty comfy about the future with my bags.  </p>\n\n<p>We&#39;re entering the Ready Player One Era guys. Are you ready?<br/>\nLeave your thoughts below.</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/CryptoCurrency/comments/que236/buying_land_today_in_virtual_worlds_feel_a_lot/",
  "subreddit": "CryptoCurrency",
  "id": "que236",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "And that's why I'm extremely bullish on GameFi projects these days. You have\nprobably seen these coins pumping the last few weeks while everything else was\ndumping. The market for regular NFTs seems oversaturated, NFTs with utility,\nlike Land NFTs seem to be the next big trend imo. The crypto real…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だからこそ、私は最近のGameFiプロジェクトに対して非常に強気になっています。皆さんは\nこの数週間、他のすべてのものが落ち込んでいる中で、これらのコインが上昇しているのを見たことがあるでしょう。\nダンプしているのを見たことがあるでしょう。通常のNFTの市場は飽和状態のようですが、Land NFTのような実用性のあるNFTは次の大きなトレンドのようです。\nLand NFTのような実用性のあるNFTが次の大きなトレンドになると思われます。クリプトリアル...",
      "title": "\"今日、バーチャルワールドで土地を買うのは、1750年にマンハッタンで土地を買うのと同じような感覚です。\" - リパブリックの不動産部門責任者、ジャニン・ヨリオ氏"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这就是为什么我最近非常看好GameFi项目。你可能已经\n你可能已经看到这些硬币在过去的几周里不断上涨，而其他东西都在\n抛售。普通NFT的市场似乎已经过饱和了，具有实用性的NFT。\n像Land NFTs似乎是下一个大趋势，我想。加密货币的真实性...",
      "title": "\"今天在虚拟世界买地的感觉很像1750年在曼哈顿买地。\" - 共和党房地产主管珍妮-约里奥(Janine Yorio)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這就是爲什麼我最近非常看好GameFi項目。你可能已經\n你可能已經看到這些硬幣在過去的幾周裏不斷上漲，而其他東西都在\n拋售。普通NFT的市場似乎已經過飽和了，具有實用性的NFT。\n像Land NFTs似乎是下一個大趨勢，我想。加密貨幣的真實性...",
      "title": "\"今天在虛擬世界買地的感覺很像1750年在曼哈頓買地。\" - 共和黨房地產主管珍妮-約里奧(Janine Yorio)"
    }
  ]
}