{
  "author": "AskScienceModerator",
  "original_created_utc": 1632913224,
  "title": "AskScience AMA Series: I am Geoff Barnes, M.D., a cardiologist and vascular medicine specialist at the University of Michigan Health System in the US. Today is World Heart Day and I am excited to be here to answer your questions about all things heart health and blood clots. Ask me anything!",
  "created_utc": 1632934819,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m Geoff Barnes, M.D., and I work as a cardiologist and vascular medicine specialist at the University of Michigan Health System in the United States. You can follow me on Twitter at <a href=\"https://twitter.com/GBarnesMD\">@GBarnesMD</a>. My professional areas of interest include anticoagulation, venous thromboembolism, quality improvement and shared decision-making. I&#39;m currently leading multiple NIH- and AHRQ-sponsored studies to improve the safety for patients on chronic anticoagulants. In honor of World Heart Day, I&#39;m here to answer anything you want to know about heart health and blood clots. For instance, did you know that people with atrial fibrillation (AFib) are at greater risk for stroke and are estimated to account for 15% of the 15 million strokes that occur worldwide every year? I&#39;ll get started around 2pm ET (18 UT) - AMA!</p>\n\n<p>Username: <a href=\"/u/WorldThrombosisDay\">/u/WorldThrombosisDay</a></p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/askscience/comments/pxszfk/askscience_ama_series_i_am_geoff_barnes_md_a/",
  "subreddit": "askscience",
  "id": "pxszfk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm Geoff Barnes, M.D., and I work as a cardiologist and vascular medicine\nspecialist at the University of Michigan Health System in the United States. You\ncan follow me on Twitter at @GBarnesMD [https://twitter.com/GBarnesMD]. My\nprofessional areas of interest include anticoagulation, venous…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はジェフ・バーンズ医学博士で、アメリカのミシガン大学ヘルスシステムで循環器と血管の専門家として働いています。\nアメリカのミシガン大学ヘルスシステムで心臓専門医、血管専門医として働いています。あなたは\nツイッターでは@GBarnesMD [https://twitter.com/GBarnesMD]でフォローできます。私の\n私の専門分野は、抗凝固療法、静脈...",
      "title": "AskScience AMAシリーズ。私は、米国ミシガン大学ヘルスシステムの循環器専門医、血管内科専門医のGeoff Barnes医学博士です。今日は世界心臓デーということで、心臓の健康や血栓に関する皆さんの質問にお答えできることを楽しみにしています。何でも聞いてくださいね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是杰夫-巴恩斯，医学博士，我在美国密歇根大学卫生系统担任心脏和血管医学专家。\n我是美国密歇根大学卫生系统的心脏和血管医学专家。你可以在\n你可以在Twitter上关注我：@GBarnesMD [https://twitter.com/GBarnesMD]。我的\n我感兴趣的专业领域包括抗凝血、静脉注射和静脉注射。",
      "title": "AskScience AMA系列。我是杰夫-巴恩斯，医学博士，美国密歇根大学卫生系统的心脏病学和血管医学专家。今天是世界心脏日，我很高兴能在这里回答你关于心脏健康和血栓的所有问题。问我任何问题吧!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是傑夫-巴恩斯，醫學博士，我在美國密歇根大學衛生系統擔任心臟和血管醫學專家。\n我是美國密歇根大學衛生系統的心臟和血管醫學專家。你可以在\n你可以在Twitter上關注我：@GBarnesMD [https://twitter.com/GBarnesMD]。我的\n我感興趣的專業領域包括抗凝血、靜脈注射和靜脈注射。",
      "title": "AskScience AMA系列。我是傑夫-巴恩斯，醫學博士，美國密歇根大學衛生系統的心臟病學和血管醫學專家。今天是世界心臟日，我很高興能在這裏回答你關於心臟健康和血栓的所有問題。問我任何問題吧!"
    }
  ]
}