{
  "author": "step11234",
  "original_created_utc": 1635187937,
  "title": "What would be the funniest outcome for the identity of Satoshi Nakamoto?",
  "created_utc": 1635197451,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There are multiple realistic options for Satoshi, including Hal Finney, Dorian Nakamoto, Nick Szabo, a group of coders, or some other anonymous legend. Then you have the &quot;other&quot; options like Craig Wright (lol) who sues anyone that claims he is not Satoshi.</p>\n\n<p>But I pose the question to you all, what would be funniest outcome? Who could be revealed and it would just be a massive meme?</p>\n\n<p>I propose the idea that Peter &quot;fuck bitcoin&quot; Schiff would be the most ironic hilarious reveal as the creator of Bitcoin. Any chance of this being true? Absolutely 0, but the guy hates bitcoin more than anyone on this planet, to the point of being obsessed with it!</p>\n</div><!-- SC_ON -->",
  "score": 255,
  "permalink": "/r/CryptoCurrency/comments/qfnkyn/what_would_be_the_funniest_outcome_for_the/",
  "subreddit": "CryptoCurrency",
  "id": "qfnkyn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There are multiple realistic options for Satoshi, including Hal Finney, Dorian\nNakamoto, Nick Szabo, a group of coders, or some other anonymous legend. Then\nyou have the \"other\" options like Craig Wright (lol) who sues anyone that claims\nhe is not Satoshi.\n\nBut I pose the question to you all, what…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サトシについては、ハル・フィニー、ドリアン・ナカモト、ニック・サボなど、複数の現実的な選択肢があります。\nナカモト、ニック・サボ、コーダーグループ、その他の匿名のレジェンドなど、複数の現実的な選択肢があります。そして\nクレイグ・ライト(笑)のように、自分がサトシではないと主張する人を訴える「その他」の選択肢もあります。\n訴えています。\n\nしかし、私は皆さんに質問します。",
      "title": "サトシ・ナカモトの正体について、一番面白い結果になるのは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "中本聪有多种现实的选择，包括哈尔-芬尼、多里安\n中本聪，尼克-萨博，一群编码员，或其他一些匿名的传奇人物。然后\n你有 \"其他 \"选择，如克雷格-赖特（笑），他起诉任何声称他不是中本聪的人。\n他不是中本聪。\n\n但我向大家提出了一个问题，什么...",
      "title": "对于中本聪的身份，最有趣的结果会是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "中本聰有多種現實的選擇，包括哈爾-芬尼、多裏安\n中本聰，尼克-薩博，一羣編碼員，或其他一些匿名的傳奇人物。然後\n你有 \"其他 \"選擇，如克雷格-賴特（笑），他起訴任何聲稱他不是中本聰的人。\n他不是中本聰。\n\n但我向大家提出了一個問題，什麼...",
      "title": "對於中本聰的身份，最有趣的結果會是什麼？"
    }
  ]
}