{
  "author": "BadAssPleb",
  "the_new_excerpt": "How does that work? I would legit applaud and it would make me emotional to read\nsomeone who genuinely told the story of how moon changed their life and it\nwouldn’t even be hard to tell if what he/she is saying is true, I mean we would\nbe able to see on his acc how many moons he is earned... and…",
  "original_created_utc": 1624133106,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それはどのような仕組みなのでしょうか？純粋に月が自分の人生を変えたという話をしている人を読んだら、私は心から拍手を送りたいし、感動します。\n月が自分の人生を変えたという話を純粋にしている人を読んだら、拍手喝采で感動します。\nその人の話が本当かどうかを見分けるのは難しいことではないでしょう。\n彼のアカウントを見れば、彼がどれだけ多くのムーンを獲得しているかがわかるでしょうし...。",
      "title": "月が私の人生を変えた」と書いている人が、100や1000のカルマも持っていないのはおかしい。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "那是怎么做到的？我将合法地鼓掌，这将使我在阅读时充满感情\n一个真正讲述月亮如何改变他们生活的故事的人。\n甚至不难看出他/她说的是真的，我的意思是我们可以在他的账户上看到他赚了多少月亮。\n我的意思是，我们可以在他的账户上看到他赚了多少个月亮......和......",
      "title": "有趣的是，写 \"月亮如何改变我的生活 \"的人在他们的账户中甚至没有100或1000karma。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "那是怎麼做到的？我將合法地鼓掌，這將使我在閱讀時充滿感情\n一個真正講述月亮如何改變他們生活的故事的人。\n甚至不難看出他/她說的是真的，我的意思是我們可以在他的賬戶上看到他賺了多少月亮。\n我的意思是，我們可以在他的賬戶上看到他賺了多少個月亮......和......",
      "title": "有趣的是，寫 \"月亮如何改變我的生活 \"的人在他們的賬戶中甚至沒有100或1000karma。"
    }
  ],
  "title": "Funny how people writing “how moons changed my life” don’t even have 100 or 1000karma in their acc.",
  "created_utc": 1624151793,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>How does that work? I would legit applaud and it would make me emotional to read someone who genuinely told the story of how moon changed their life and it wouldn’t even be hard to tell if what he/she is saying is true, I mean we would be able to see on his acc how many moons he is earned... and even if they had cashed out we would be able to see how much karma that acc has and if they are posting form another acc... why? Why post from another acc that moons have changed your life? </p>\n\n<p>It’s disingenuous that’s all I’m saying. Seeing these kind of posts get an instant 5 rewards and 100 upvotes just make me think they’re thinking of an elaborate story (that isn’t even good in the first place, just very generic) and buying upvotes and rewards services.</p>\n\n<p>Yeah, I feel like I’m being a dick but I had to say it.</p>\n</div><!-- SC_ON -->",
  "score": 187,
  "permalink": "/r/CryptoCurrency/comments/o3omld/funny_how_people_writing_how_moons_changed_my/",
  "subreddit": "CryptoCurrency",
  "id": "o3omld",
  "is_self": true,
  "media": null,
  "is_video": false
}