{
  "author": "riicky_morty",
  "original_created_utc": 1624411076,
  "title": "Did you know these crypto terms? (Level 1 - Level 3)",
  "created_utc": 1624429838,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I assume all people are not ace in cryptocurrencies. So, I compiled some of the terms related to crypto and their meanings from Level 1 to Level 3. Hopefully, this helps people understand more crypto terminologies :) </p>\n\n<p>Also, if you have any suggestions do let me know. I am compiling slangs and other generally used terms. I&#39;ll post it here when I complete it.</p>\n\n<p>LEVEL 1:</p>\n\n<ol>\n<li><p>FUD: Fear, Uncertainty and Doubt (so FUDster is someone who spreads FUD)</p></li>\n<li><p>FOMO: Fear Of Missing Out</p></li>\n<li><p>HODL(the obvious one): Originally hold misspelled, also Hold On For Dear Life</p></li>\n<li><p>FIAT: Government issued currency</p></li>\n<li><p>WHALE: Someone who owns a lot of Crypto</p></li>\n<li><p>Brr: Brr describes the sound that money printer makes when the government prints money.</p></li>\n<li><p>REKT: Rekt describes when a investor gets blown out of the water by a catastrophic coin collapse</p></li>\n<li><p>SHILL: An individual promoting Alt-Coins for their own benefit</p></li>\n</ol>\n\n<p>LEVEL 2:</p>\n\n<ol>\n<li><p>Node: A computer that validates transactions.</p></li>\n<li><p>DeFi: DeFi stands for Decentralized Finance</p></li>\n<li><p>Cold Wallet: An offline wallet</p></li>\n<li><p>Hot wallet: An online wallet</p></li>\n<li><p>NFT: Non-fungible token is an exclusive digital asset that can represent anything.</p></li>\n<li><p>Halving: The Block reward for miners is cut in half.</p></li>\n<li><p>Satoshi: Smallest unit of Bitcoin (1 Satoshi equals 100 millionth of a Bitcoin)</p></li>\n</ol>\n\n<p>LEVEL 3:</p>\n\n<ol>\n<li><p>Lightning Network: The lightning network is a second layer technology applied to bitcoin that uses micropayment channels to scale its blockchain’s capability to conduct transactions more efficiently. Transactions conducted on lightning networks are faster, less costly, and more readily confirmed than those conducted directly on the bitcoin blockchain (i.e., on-chain). On-chain transactions refer to cryptocurrency transactions that occur on the blockchain and remain dependent on the state of the blockchain for their validity. On-chain transactions are considered valid only when the blockchain has been updated to reflect the transactions on the public ledger.  </p></li>\n<li><p>Yield Farming: Yield farming is a process that allows cryptocurrency holders to lock up their holdings, which in turn provides them with rewards. More specifically, it’s a process that lets you earn either fixed or variable interest by investing crypto in a DeFi market. It involves lending cryptocurrency via the Ethereum network. When loans are made via banks using fiat money, the amount lent out is paid back with interest. With yield farming, the concept is the same: cryptocurrency that would otherwise be sitting in an exchange or in a wallet is lent out via DeFi protocols (or locked into smart contracts, in Ethereum terms) in order to get a return. Yield farming is normally carried out using ERC-20 tokens on Ethereum, with the rewards being a form of ERC-20 token. While this might change in future, almost all current yield farming transactions take place in the Ethereum ecosystem.  </p></li>\n<li><p>ICO: ICO is short for Initial Coin Offering. When launching a new cryptocurrency or crypto-token, the developers offer investors a limited number of units in exchange for other major crypto coins such as Bitcoin or Ethereum. Ripple is the first cryptocurrency distributed via an ICO. At the start of 2013, Ripple Labs began to develop the Ripple payment system and generated approximately 100 billion XRP tokens. These were sold through an ICO to fund Ripple’s platform development.  </p></li>\n<li><p>Genesis block: A Genesis Block is the name given to the first block a cryptocurrency, such as Bitcoin, ever mined. A blockchain consists of a series of so-called blocks that are used to store information related to transactions that occur on a blockchain network. Each of the blocks contains a unique header, and each such block is identified by its block header hash individually. These blocks get layered—one on top of the other, with the Genesis Block being the foundation—and they grow in height until the end of the blockchain is reached and the sequence is complete. The layers and deep history of each sequence is one of the things that makes a blockchain-based cryptocurrency so secure. Bitcoin&#39;s Genesis Block was the first instance of a proof-of-work blockchain system and is the template for all other blocks in its blockchain. </p></li>\n<li><p>Dildo: Nooo! not that one. A dildo in cryptocurrency basically is a green or red candle that appears in a lot of graphs which are supposedly wanting to tell the users about the increase or decrease of the exchange price of a certain token in the existing market. These show the maximum and minimum rate of exchange for a session. Candle sticks show a large rise in the price of a certain coin. These candidates/candles are called dildos. Whenever there is a large rise in price of a coin, candlestick in a candlestick chart shoots up. This is called “dildo” basically because many people think that the phenomena looks like a dildo. And yup I added this on LEVEL 3...judged it well.</p></li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/o628yv/did_you_know_these_crypto_terms_level_1_level_3/",
  "subreddit": "CryptoCurrency",
  "id": "o628yv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I assume all people are not ace in cryptocurrencies. So, I compiled some of the\nterms related to crypto and their meanings from Level 1 to Level 3. Hopefully,\nthis helps people understand more crypto terminologies :)\n\nAlso, if you have any suggestions do let me know. I am compiling slangs and\nother…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "すべての人が暗号通貨のエースではないことを想定しています。そこで、暗号に関連する用語とその意味を\nレベル1からレベル3までの暗号に関連する用語とその意味をまとめてみました。うまくいけば\n人々がより多くの暗号用語を理解するのに役立つことを願っています :)\n\nまた、何か提案があれば、ぜひ教えてください。私はスラングや\n他の...",
      "title": "暗号用語を知っていますか？(レベル1～レベル3)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我假设所有的人都不是加密货币的王牌。因此，我汇编了一些\n与加密货币有关的一些术语，以及它们从一级到三级的含义。希望如此。\n这有助于人们理解更多的加密货币术语 :)\n\n此外，如果你有任何建议，请让我知道。我正在编纂俚语和\n其他的...",
      "title": "你知道这些加密货币术语吗？(1级-3级)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我假設所有的人都不是加密貨幣的王牌。因此，我彙編了一些\n與加密貨幣有關的一些術語，以及它們從一級到三級的含義。希望如此。\n這有助於人們理解更多的加密貨幣術語 :)\n\n此外，如果你有任何建議，請讓我知道。我正在編纂俚語和\n其他的...",
      "title": "你知道這些加密貨幣術語嗎？(1級-3級)"
    }
  ]
}