{
  "author": "xXTeaCultureXx",
  "the_new_excerpt": "In moral philosophy, I see plenty of assumptions; murder=bad, helping=good,\ndeath=bad, and so on. I'm not saying that this is necessarily wrong, but how do\nmoral philosophers develop theories on this when, in many philosopher's\nopinions, morals are simply constructs to help the human race thrive?…",
  "original_created_utc": 1613005114,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在道德哲学中，我看到很多假设，谋杀=坏事，帮助=好事。\n死亡=坏事，以此类推。我不是说这样做一定是错的，但怎么会有\n道德哲学家对此发展理论时，在许多哲学家的\n观点，道德只是帮助人类发展的构造？",
      "title": "人们如何接受道德哲学的不确定基础？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在道德哲學中，我看到很多假設，謀殺=壞事，幫助=好事。\n死亡=壞事，以此類推。我不是說這樣做一定是錯的，但怎麼會有\n道德哲學家對此發展理論時，在許多哲學家的\n觀點，道德只是幫助人類發展的構造？",
      "title": "人們如何接受道德哲學的不確定基礎？"
    }
  ],
  "title": "How Do People Accept the Uncertain Foundation of Moral Philosophy?",
  "created_utc": 1613049812,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In moral philosophy, I see plenty of assumptions; murder=bad, helping=good, death=bad, and so on. I&#39;m not saying that this is necessarily wrong, but how do moral philosophers develop theories on this when, in many philosopher&#39;s opinions, morals are simply constructs to help the human race thrive? How do people bring themselves to care about moral philosophy if they don&#39;t believe it&#39;s universal? Is it to keep order? But that&#39;s what law is for(I think that morals are for human survival and law, for order). I understand that some moral philosophers may be fuelled by religious morals, so I ask all moral philosophers who think that morals are a survival construct. Maybe I just don&#39;t get it, but I&#39;d like to hear from some people interested in moral philosophy to help myself understand your point of view. I thank all respondents in advance and wish everyone a pleasant day.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/lh8xku/how_do_people_accept_the_uncertain_foundation_of/",
  "subreddit": "askphilosophy",
  "id": "lh8xku",
  "is_self": true,
  "media": null,
  "is_video": false
}