{
  "author": "Nostalg33k",
  "original_created_utc": 1633420910,
  "title": "Being in the green is more stressful than being in the red",
  "created_utc": 1633437187,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I started investing in august and through averaging down I&#39;m now in the green. And I just realized how complicated it becomes when you are in the green.   </p>\n\n<p>A lot of people are saying: &#39;Take profits, take profits, you never know when the next dip is&#39; but this is timing the market which I don&#39;t know how to do. I don&#39;t want to take money out which would exponentially make me lose profits on the way up. </p>\n\n<p>&#x200B;</p>\n\n<p>Others are saying: &#39;never touch your bags until your target is achieved&#39; but I wouldn&#39;t want to empty everything as soon as my target is achieved. Yes I&#39;d like to buy a house or a flat at some point in my life and I&#39;m very very far from there right now BUT I won&#39;t empty everything as soon as I have enough for a house. This would be counter productive.   </p>\n\n<p>When I&#39;m in the red the solution is easy. Buy, buy, buy so you can average down. Nowadays the feeling of buying is different because I&#39;m buying while already in the profits.   </p>\n\n<p>The only solution I found is to think I&#39;m averaging up so that at the next dip I can really average down but it doesn&#39;t make much sense. This is why people blindly dca&#39;ing have a better time. The decision making is very complicated. </p>\n\n<p>&#x200B;</p>\n\n<p>What is for you, the most complicated time in the markets???</p>\n</div><!-- SC_ON -->",
  "score": 228,
  "permalink": "/r/CryptoCurrency/comments/q1rtiz/being_in_the_green_is_more_stressful_than_being/",
  "subreddit": "CryptoCurrency",
  "id": "q1rtiz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I started investing in august and through averaging down I'm now in the\ngreen. And I just realized how complicated it becomes when you are in the green.\n\nA lot of people are saying: 'Take profits, take profits, you never know when the\nnext dip is' but this is timing the market which I don't know…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "8月に投資を開始し、平均化した結果、今では緑になっています。\n緑色になっています。そして、緑の中にいるときに、いかに複雑になるかを実感しました。\n\n多くの人が「利益を出せ、利益を出せ、次のディップがいつになるかわからない」と言いますが、これは市場のタイミングを計ることであり、私にはわかりません。\nしかし、これは私にはわからない市場のタイミングです...。",
      "title": "赤字よりも緑の方がストレスがたまる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我在8月开始投资，通过平均下来，我现在处于\n绿色。我才意识到，当你处于绿色状态时，它变得多么复杂。\n\n很多人都在说：\"获利，获利，你永远不知道什么时候会出现\n但这是对市场的计时，我不知道......\"。",
      "title": "处于绿色状态的人比处于红色状态的人更有压力"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我在8月開始投資，通過平均下來，我現在處於\n綠色。我才意識到，當你處於綠色狀態時，它變得多麼複雜。\n\n很多人都在說：\"獲利，獲利，你永遠不知道什麼時候會出現\n但這是對市場的計時，我不知道......\"。",
      "title": "處於綠色狀態的人比處於紅色狀態的人更有壓力"
    }
  ]
}