{
  "author": "mashtartz",
  "original_created_utc": 1624681734,
  "title": "Does anyone feel like Reddit just… fucking sucks now?",
  "created_utc": 1624700074,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like it’s been a slow degrade, but between the horrendous video player and literally every post on my feed being followed by one or two ads and then one or two “recommended because you looked at a similar subreddit”, usually for subreddits that I’m not interested in at all. I fucking hate it.</p>\n\n<p>Edit: just now got a recommendation based on amateur room porn for neck beard nests. That’s…… not something I’m interested in whatsoever. Please stop.</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/TooAfraidToAsk/comments/o83rw5/does_anyone_feel_like_reddit_just_fucking_sucks/",
  "subreddit": "TooAfraidToAsk",
  "id": "o83rw5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Like it’s been a slow degrade, but between the horrendous video player and\nliterally every post on my feed being followed by one or two ads and then one or\ntwo “recommended because you looked at a similar subreddit”, usually for\nsubreddits that I’m not interested in at all. I fucking hate it.\n\nEdit:…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ゆっくりと劣化しているように見えますが、ひどいビデオプレーヤーとの間には\n文字通り私のフィード上のすべての投稿に1つか2つの広告が表示され、さらに1つか2つの「おすすめです。\n似たようなサブレディットを見ていたからおすすめ」というものが1つ2つ。\n通常は全く興味のないsubredditsです。大嫌いです。\n\n編集：...",
      "title": "誰もが、Redditは今...クソだと感じているのでは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就像它一直在缓慢退化一样，但在可怕的视频播放器和\n实际上，我的每篇帖子后面都有一两个广告，然后是一两个\n荐，因为你看了一个类似的子版块\"，通常是针对我完全不感兴趣的子版块。\n通常是我根本不感兴趣的子版块。我他妈的讨厌它。\n\n编辑：...",
      "title": "有没有人觉得Reddit现在......他妈的太烂了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就像它一直在緩慢退化一樣，但在可怕的視頻播放器和\n實際上，我的每篇帖子後面都有一兩個廣告，然後是一兩個\n薦，因爲你看了一個類似的子版塊\"，通常是針對我完全不感興趣的子版塊。\n通常是我根本不感興趣的子版塊。我他媽的討厭它。\n\n編輯：...",
      "title": "有沒有人覺得Reddit現在......他媽的太爛了？"
    }
  ]
}