{
  "author": "Godfreee",
  "original_created_utc": 1634699377,
  "title": "Someone asked me if it was still OK to buy Bitcoin at $64K. This was my answer.",
  "created_utc": 1634722729,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bitcoin is an emerging technology, network, and asset class that is only 13 years old.</p>\n\n<p>It is growing across all metrics at a rate faster than the internet itself in the 90s.</p>\n\n<p>The amount of capital and brain power pouring into all facets of Bitcoin (tech, asset, network, and related fields) is unprecedented. </p>\n\n<p>The amount of people who have accumulated massive amounts of capital over the years because of Bitcoin are deploying that capital to make Bitcoin even more secure, easier to use, easier to access, and easier to integrate is also increasing rapidly, creating a positive feedback loop.</p>\n\n<p>Bitcoin at $1 Trillion in market capitalization is still too small in the financial markets today, but that is changing rapidly. The total addressable market for Bitcoin&#39;s use case is at least $10 trillion (gold), and then an order of magnitude more once Bitcoin eats into bonds, real estate, art, and other stores of value.</p>\n\n<p>Bitcoin has no rulers, only rules. It has no central points of failure and has time as its ally. Every single block produced by the network gives new information to the market and ossifies Bitcoin&#39;s position as a long-term store of value that is free from human interference and political manipulation. </p>\n\n<p>The demand for such a monetary network, asset, and technology is increasing exponentially as people see no end to fiat debasement.</p>\n\n<p>Bitcoin is here to stay, it is not going away. </p>\n\n<p>Holding Bitcoin was once a risky proposition. Today, NOT holding Bitcoin is the riskier proposition.</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/Bitcoin/comments/qbrmz6/someone_asked_me_if_it_was_still_ok_to_buy/",
  "subreddit": "Bitcoin",
  "id": "qbrmz6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Bitcoin is an emerging technology, network, and asset class that is only 13\nyears old.\n\nIt is growing across all metrics at a rate faster than the internet itself in\nthe 90s.\n\nThe amount of capital and brain power pouring into all facets of Bitcoin (tech,\nasset, network, and related fields) is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインは、まだ13年しか経っていない新しい技術、ネットワーク、資産クラスです。\n年しか経っていません。\n\nビットコインは、すべての指標において、90年代のインターネットそのものよりも速いペースで成長しています。\n90年代のインターネットを超える勢いで成長しています。\n\nビットコインのすべての側面（技術、資産、ネットワーク、関連分野）に注がれている資本と頭脳の量は、..,\nアセット、ネットワーク、関連分野）に注がれている資本と頭脳の量は...",
      "title": "ある人から、64Kドルでビットコインを買ってもいいのかと聞かれました。これが私の答えでした。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比特币是一种新兴的技术、网络和资产类别，只有13年历史。\n年的历史。\n\n它在所有指标上的增长速度比90年代的互联网本身还要快。\n90年代的互联网。\n\n涌入比特币所有方面（技术、资产、网络和相关领域）的资本和脑力的数量。\n资产、网络和相关领域）的资本和脑力是...",
      "title": "有人问我，在64K美元购买比特币是否还可以。这是我的回答。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣是一種新興的技術、網絡和資產類別，只有13年曆史。\n年的歷史。\n\n它在所有指標上的增長速度比90年代的互聯網本身還要快。\n90年代的互聯網。\n\n湧入比特幣所有方面（技術、資產、網絡和相關領域）的資本和腦力的數量。\n資產、網絡和相關領域）的資本和腦力是...",
      "title": "有人問我，在64K美元購買比特幣是否還可以。這是我的回答。"
    }
  ]
}