{
  "author": "MrQot",
  "original_created_utc": 1630155252,
  "title": "DCA in action: Buying $20 in ETH every day for the past 100 days (with graphs!)",
  "created_utc": 1630161034,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>Quick preface: All the dollar figures are unfortunately in canadian dollars unless specified otherwise. Also this is actually day #99 on the charts because my days are 0-indexed.</em></p>\n\n<p>So a hundred days ago I decided to buy ETH at $20 every single day to see what would happen and if this Dollar Cost Averaging strategy actually works, and I fell in love with it haha.</p>\n\n<p>It&#39;s kind of a lot and adds up real fast ($140 weekly, ~$600 monthly, $7300 yearly) but overall it&#39;s still a reasonable percentage of my income and I&#39;m used to it now. I already made a thread about this a while back when I broke even at around 60 days and figure every 100 days is a good milestone to update for whoever wants to hear (Or now that I&#39;ve typed it all out, maybe my next update will be at 500 days cause that&#39;s a lot of typing damn)</p>\n\n<p>The TL;DR results for these 100 days are (if you don&#39;t want to read the whole thing that&#39;s fine but make sure your question isn&#39;t addressed by the FAQ below, I got the same questions a hundred times last time I made a post about this)</p>\n\n<ul>\n<li>Total spent: $2000<br/></li>\n<li>Total ETH bought: 0.6601 ETH </li>\n<li>Total ETH value now: $2700 (+35%)<br/></li>\n<li>Average price: $3030 (or $2400 USD)</li>\n<li>Best buy: 0.00907 ETH on 2021-06-26 which is now worth $37 (look at me I bought the very bottom of the dip!)</li>\n</ul>\n\n<p>My goal is to let the automated buys do their things for at least 4 years, so 365 x 4 + 1 leap day = 1461 days which I round up to an even 1500. This means I&#39;ll have spent $30k in ETH which is like... <em>damn</em>. Where will ETH be in 4 years and how much will that $30k be worth by then? So yeah I have my eyes on June 28th 2025 and I&#39;m already 1/15th of the way there!</p>\n\n<p>My ultimate end goal is financial independance through staking/DeFi rewards. Probably not achievable in 4 years (unless my boy SquishChaos is right). Still, I&#39;m running simulations all the time (to daydream and waste time at the fiat mine) and the bare minimum (where ETH/Crypto didn&#39;t go to $0) still nets me a pretty nifty sum in 4 years so I think my odds are good. It&#39;d be cool to never have to sell ETH and keep borrowing against it while the collateral appreciates.</p>\n\n<p>I also like to make as many graphs as I can, using hourly prices:</p>\n\n<ul>\n<li><p><a href=\"https://i.imgur.com/qKo816O.png\">Paid vs value over time</a></p></li>\n<li><p><a href=\"https://i.imgur.com/lBcEi4t.png\">Balance over time</a> as price goes up, the line gets less steep which sucks when my goal is to accumulate as much ETH as possible, but also a less steep line means more gains</p></li>\n<li><p><a href=\"https://i.imgur.com/iK914L6.png\">Average price vs actual price over time</a></p></li>\n<li><p><a href=\"https://i.imgur.com/w4vum0t.png\">How much ETH each day&#39;s $20 got me</a> — More during dips and less during peaks. I do miss waking up to 0.008 buys lol, now I&#39;m lucky to get 0.005</p></li>\n<li><p><a href=\"https://i.imgur.com/A5P39cU.png\">ROI on every buy</a> — Still at a &quot;loss&quot; on some of the past two weeks&#39; buys because of this crab season but it&#39;s fine lol</p></li>\n<li><p>Also setting expectations high I know — just let me dream please — but <a href=\"https://i.imgur.com/Ait0r7K.png\">a logarithmic graph</a> over the whole 1500 days, hoping the next big bull runs will make that orange line shoot way up as the blue line tapers off as it approaches $30k. But I&#39;d need an overall return of x33.3 to hit $1M with this DCA strategy alone, so that will probably take me longer than 4 years. We&#39;ll see...</p></li>\n</ul>\n\n<p>I like this dollar cost averaging strategy because I no longer stress about timing my buys or dumping hundreds of dollars during a dip and then feeling stupid the next day when it dips more meaning I could have more ETH for the same price. Or thinking it&#39;ll dip more and then it goes up and I miss out. Instead I get the average daily price over the whole period I&#39;m doing this. But of course I&#39;ll also buy large dips when it feels reasonable to do so, as any extra ETH brings me closer to my goal.</p>\n\n<p>So like basically what happens is:</p>\n\n<ul>\n<li><p>Price goes up: &quot;Yay look at all those gains&quot;</p></li>\n<li><p>Price goes down: &quot;Awesome, my $20 will buy more ETH tomorrow morning&quot;</p></li>\n<li><p>The average price gets more and more &quot;settled&quot; each day and over time it&#39;ll be harder and harder to make it move which I find pretty cool.</p></li>\n<li><p>When prices dip, the daily buy props that value sideways instead of down (unless it&#39;s a big dip) and when it goes up, the value shoots way up because every day brings a new $20 to do its thing. See this <a href=\"https://i.imgur.com/2JBEHO7.png\">annotated graph</a> for a rough idea of how price movement affect the orange line. I&#39;m aware that this effect won&#39;t keep up as much once I have more and more money and that daily $20 represents a smaller and smaller percentage, but it was very motivating early on especially as I was in the red a lot. Big dips in price made my graph go sideways instead of down, and increases made it shoot way up. Now in this crab season the price isn&#39;t moving as much so the orange line as roughly the same $20/day increase as the blue line.</p></li>\n<li><p>No need to stress about timing large buys.</p></li>\n<li><p>Cool graphs every day, I look at them more than actual price charts.</p></li>\n<li><p>If I suddenly need money, I can just stop buying for a while instead of selling (assuming I still have a job and steady income) but I&#39;m personalfinancing everything so I still relunctantly have an emergency fund for these things instead of dumping it all in crypto. And also I like this DCA experiment too much to mess with it, I&#39;d rather stop investing in my traditional retirement accounts before stopping these daily crypto buys lol.</p></li>\n</ul>\n\n<p><strong>Frequently Asked Questions</strong>:</p>\n\n<p><strong>Don&#39;t you get killed by exchange fees for all these small trades?</strong> No, the exchange I use makes their money through a buy/sell spread instead of a flat fee per trade. So I buy my ETH at a slightly higher than market price. So in the end it doesn&#39;t matter if I buy $10 ten times or $100 once, I&#39;ll still pay the same fee through that spread. The spread is kinda high but I&#39;m happy to pay it for that convenience. Plus they have this gimmick where every day I can get some free satoshis and I&#39;ve done the math to figure out those daily free satoshis are worth more than what I pay through the spread lol</p>\n\n<p><strong>What about Ethereum gas fees?</strong> They don&#39;t come into play. I let my ETH accumulate on my exchange and every month or so I&#39;ll send it to my hardware wallet. Plus the exchange is cool, they cover the gas fees as long as I meet the minimum withdrawal amount (currently 0.05 ETH, used to be 0.10) so I don&#39;t even have to worry about those!</p>\n\n<p><strong>Why DCA daily instead of weekly or monthly?</strong> It&#39;s more fun, and my exchange app lets me automate it, so why not. In the long run it doesn&#39;t matter if you go daily or weekly, I&#39;ve ran simulations for fun and they all average to roughly the same result. There&#39;s always the risk that your monthly buy happens at a short term peak and nets you less ETH for the same price, but that risk gets smoothed out over time.</p>\n\n<p><strong>How do you automate it?</strong> My bank lets me setup an automatic biweekly e-transfer (Interac) of $300 every payday to the app, and from inside the app I set up a recurring buy for $20 every day at 6 AM. This also leaves me with an extra $20 every 2 weeks that I let accumulate until I see I dip and buy it without remorse but it&#39;s not much.</p>\n\n<p><strong>Isn&#39;t this a recipe for a tax nightmare?</strong> Probably yeah but that&#39;s a problem for my future self to deal with lol. I don&#39;t plan on selling for a while, but when I do, I can generate a CSV detailing each transaction I made with the price at the time of purchase and everything. From there I hear there&#39;s even crypto tax calculators that accept that CSV to calculate how much capital gains I&#39;ll have to report but I haven&#39;t explored those options too much. All I need to know right now is that my 2021 tax return will be simple enough to do by hand.</p>\n\n<p><strong>How do you generate those cool graphs?</strong> I take the transaction history CSV provided by my exchange and I made a script that parses it and fetches hourly prices and generate data that I can just paste into Excel and make those graphs. Basically I just need the hourly prices and how much ETH i bought to calculate the balance over time to multiply it by the price at each hour. Excel is kinda lame though but it&#39;s what I know. I&#39;m hoping to fully automate data fetching and chart generation at some point in the future.</p>\n\n<p><strong>So what&#39;s this exchange app you&#39;re using?</strong> It&#39;s called Shakepay and it&#39;s for Canadians only, sorry. If you&#39;re interested DM me for a referal code that&#39;ll get us both $10 cash on your first buy over $100 and it&#39;ll also let you shake your phone every day for those free satoshis I talked about. I don&#39;t want to shill (plus any canadian interested in crypto has probably heard of it anyway) but I&#39;m happy with it, it&#39;s a simple app that gets straight to the point of buying crypto. But yeah other than that, basically anything that works with a buy/sell spread and lets you automate buys should be good to do this.</p>\n</div><!-- SC_ON -->",
  "score": 177,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/fRQulQfaulM_g79ImSPsLt2Fdxqcoi2ehSvnSE5nn4k.png?auto=webp&s=85dd2ae2295931318c77c5da1eb558ff48cafed8",
          "width": 1327,
          "height": 742
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/fRQulQfaulM_g79ImSPsLt2Fdxqcoi2ehSvnSE5nn4k.png?width=108&crop=smart&auto=webp&s=adfe051a91dcb0a42c69eb0302fa9918e9a216b1",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/fRQulQfaulM_g79ImSPsLt2Fdxqcoi2ehSvnSE5nn4k.png?width=216&crop=smart&auto=webp&s=530fbee60f995f0c918dbc626d8fb8b0dba266d2",
            "width": 216,
            "height": 120
          },
          {
            "url": "https://external-preview.redd.it/fRQulQfaulM_g79ImSPsLt2Fdxqcoi2ehSvnSE5nn4k.png?width=320&crop=smart&auto=webp&s=ddeeb5d489ec94c86ddebefe1836997fa8935b25",
            "width": 320,
            "height": 178
          },
          {
            "url": "https://external-preview.redd.it/fRQulQfaulM_g79ImSPsLt2Fdxqcoi2ehSvnSE5nn4k.png?width=640&crop=smart&auto=webp&s=459c2260061c84f162735cd98d01ccc11782373b",
            "width": 640,
            "height": 357
          },
          {
            "url": "https://external-preview.redd.it/fRQulQfaulM_g79ImSPsLt2Fdxqcoi2ehSvnSE5nn4k.png?width=960&crop=smart&auto=webp&s=5667def42b0221571f7819a3470b8a200a080733",
            "width": 960,
            "height": 536
          },
          {
            "url": "https://external-preview.redd.it/fRQulQfaulM_g79ImSPsLt2Fdxqcoi2ehSvnSE5nn4k.png?width=1080&crop=smart&auto=webp&s=d2eb93ebb75f24540d58ec5f27deee69626cfa9e",
            "width": 1080,
            "height": 603
          }
        ],
        "variants": {},
        "id": "uj7skJPU0BmyQrM373hz83EuMjDACJOlwcst7zX7q94"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/pd99bm/dca_in_action_buying_20_in_eth_every_day_for_the/",
  "subreddit": "CryptoCurrency",
  "id": "pd99bm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Quick preface: All the dollar figures are unfortunately in canadian dollars\nunless specified otherwise. Also this is actually day #99 on the charts because\nmy days are 0-indexed.\n\nSo a hundred days ago I decided to buy ETH at $20 every single day to see what\nwould happen and if this Dollar Cost…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "早速ですが、前置きが長くなりました。すべての金額は、特に明記されていない限り、残念ながらカナダドルで表示されています。\n特に明記していない限り また、この日はチャート上では99日目にあたります。\n私の日にちは0インデックスです。\n\n100日前、私はETHを毎日20ドルで買って何が起こるかを見ることにしました。\nこのドル・コストは...",
      "title": "DCAの活躍。過去100日間、毎日ETHで20ドルを購入（グラフ付き！）。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "快速序言。不幸的是，所有的美元数字都是以加拿大元计算的。\n除非另有说明。此外，这实际上是图表上的第99天，因为\n我的日子是以0为单位的。\n\n一百天前，我决定每天以20美元的价格购买ETH，看看会发生什么。\n会发生什么，如果这个美元成本...",
      "title": "DCA在行动。在过去的100天里，每天购买20美元的ETH（有图表！）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "快速序言。不幸的是，所有的美元數字都是以加拿大元計算的。\n除非另有說明。此外，這實際上是圖表上的第99天，因爲\n我的日子是以0爲單位的。\n\n一百天前，我決定每天以20美元的價格購買ETH，看看會發生什麼。\n會發生什麼，如果這個美元成本...",
      "title": "DCA在行動。在過去的100天裏，每天購買20美元的ETH（有圖表！）。"
    }
  ]
}