{
  "author": "supersonic3974",
  "the_new_excerpt": "I've been in the crypto space since 2011 and I haven't been this disappointed\nwith the direction the community was headed since centralized coins began being\nviewed as legitimate by so many crypto users.\n\nYou can't hack crypto, you can't shut it down, you can't regulate it, you can't\nstop…",
  "original_created_utc": 1621094559,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2011年から暗号の世界に身を置いていますが、中央集権的なコインが登場して以来、コミュニティの方向性にこれほど失望したことはありませんでした。\n中央集権型コインが多くの暗号ユーザーに正当なものと見なされるようになってから、コミュニティの方向性にこれほど失望したことはありませんでした。\n多くの暗号ユーザーから正当なものと見なされるようになってから、コミュニティの方向性にこれほど失望したことはありませんでした。\n\n暗号をハックすることはできませんし、閉鎖することもできませんし、規制することもできませんし、止めることもできません。\n止められない...",
      "title": "ミームコインは、私が予想しなかった攻撃ベクトルです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从2011年开始进入加密货币领域，自从中心化硬币开始发行以来，我还没有对社区的发展方向感到如此失望。\n对社区的发展方向感到失望，因为中心化的硬币开始被许多加密货币用户认为是合法的。\n我还没有对社区的发展方向感到如此失望，因为中心化的硬币开始被众多加密货币用户视为合法。\n\n你不能黑掉加密货币，你不能关闭它，你不能监管它，你不能\n阻止...",
      "title": "纪念币是我没有想到的攻击载体"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從2011年開始進入加密貨幣領域，自從中心化硬幣開始發行以來，我還沒有對社區的發展方向感到如此失望。\n對社區的發展方向感到失望，因爲中心化的硬幣開始被許多加密貨幣用戶認爲是合法的。\n我還沒有對社區的發展方向感到如此失望，因爲中心化的硬幣開始被衆多加密貨幣用戶視爲合法。\n\n你不能黑掉加密貨幣，你不能關閉它，你不能監管它，你不能\n阻止...",
      "title": "紀念幣是我沒有想到的攻擊載體"
    }
  ],
  "title": "Meme coins are the attack vector I didn't see coming",
  "created_utc": 1621111197,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been in the crypto space since 2011 and I haven&#39;t been this disappointed with the direction the community was headed since centralized coins began being viewed as legitimate by so many crypto users.</p>\n\n<p>You can&#39;t hack crypto, you can&#39;t shut it down, you can&#39;t regulate it, you can&#39;t stop transactions. But apparently you can try to de-legitimize it by creating meme coins and then turning them and the entire space into a spectacle. It doesn&#39;t reflect well when centralized coins and meme coins have such a large presence among truly revolutionary protocols like Bitcoin, Ethereum, Cardano, etc.</p>\n\n<p>And no, I do not think meme coins are a good outreach tool or a good introduction to crypto. In other areas of life, it&#39;s best to teach good fundamentals early so that these principles grow with you. It&#39;s the same with crypto. There are plenty of solid coins that have a low barrier of entry without sacrificing fundamentals. Those are the coins that should be promoted to beginners, new crypto users and the public.</p>\n</div><!-- SC_ON -->",
  "score": 697,
  "permalink": "/r/CryptoCurrency/comments/nd24t4/meme_coins_are_the_attack_vector_i_didnt_see/",
  "subreddit": "CryptoCurrency",
  "id": "nd24t4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590798341
}