{
  "author": "EverettDonovan",
  "original_created_utc": 1635063674,
  "title": "Why does TV and Movie representation matter so much to minorities?",
  "created_utc": 1635082065,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m a black man, and this is something I&#39;ve always wondered. </p>\n\n<p>I&#39;m a big consumer of movies and tv shows, but I never felt connected to the whole discourse of white washing and the overall lack of black, or other ethnic or cultural representations in such media pieces. I&#39;ve always felt it like such a non problem. A further excuse to be angry for nothing.</p>\n\n<p>If X character is supposed to be hispanic, afghan, african, asian or idk, but is played by a white person, I wouldn&#39;t care that much, if it&#39;s played well. I just can&#39;t see myself being so attached to a media work that much to care about this issue. </p>\n\n<p>My life won&#39;t be affected if more or less black people appear on screens. Yes, I know that racism is still a thing, but in a world where policemen harass and kill black people and governments do nothing about it, being bothered so much by films having full white casts I find it so silly.</p>\n</div><!-- SC_ON -->",
  "score": 118,
  "permalink": "/r/TooAfraidToAsk/comments/qenzhb/why_does_tv_and_movie_representation_matter_so/",
  "subreddit": "TooAfraidToAsk",
  "id": "qenzhb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm a black man, and this is something I've always wondered.\n\nI'm a big consumer of movies and tv shows, but I never felt connected to the\nwhole discourse of white washing and the overall lack of black, or other ethnic\nor cultural representations in such media pieces. I've always felt it like such\na…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は黒人ですが、これはいつも疑問に思っていたことです。\n\n私は映画やテレビ番組をよく見ていますが、白人の洗脳や全体的な表現の言説とは無縁だと感じていました。\n私は映画やテレビ番組をよく見ますが、そのようなメディア作品の中で、白人の洗脳や、黒人や他の民族、文化的な表現が全体的に不足しているという言説に、私はつながりを感じませんでした。\n私は映画やテレビ番組をよく見ていますが、白人洗脳の言説や、そうしたメディア作品に黒人やその他の民族、文化的な表現が全体的に欠けていることには、全く関係を感じませんでした。私はいつもこのように感じていました。\na...",
      "title": "なぜ、テレビや映画の表現はマイノリティにとってそれほど重要なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个黑人，这是我一直想知道的事情。\n\n我是一个电影和电视节目的大消费者，但我从来没有感觉到与 \"洗白 \"的整个话语有关。\n但我从来没有感觉到与洗白的整个话语有关，也没有感觉到这些媒体作品中总体上缺乏黑人或其他民族的\n或文化代表在这些媒体作品中。我一直觉得它像这样\na...",
      "title": "为什么电视和电影的代表性对少数民族如此重要？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個黑人，這是我一直想知道的事情。\n\n我是一個電影和電視節目的大消費者，但我從來沒有感覺到與 \"洗白 \"的整個話語有關。\n但我從來沒有感覺到與洗白的整個話語有關，也沒有感覺到這些媒體作品中總體上缺乏黑人或其他民族的\n或文化代表在這些媒體作品中。我一直覺得它像這樣\na...",
      "title": "爲什麼電視和電影的代表性對少數民族如此重要？"
    }
  ]
}