{
  "author": "TheBreadMakerr",
  "the_new_excerpt": "TL;DR: In depth breakdown of MSFT and why I believe it is a good buy at the\nmoment. I did provide chart breakdowns and analysis in the post but cannot post\nthem to this subreddit. If you would like to read the full post including the\nchart breakdowns you can do so here:…",
  "original_created_utc": 1615389195,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "TL;DR: 深入分析MSFT和为什么我相信它是一个很好的买入在。\n瞬间。我在帖子中确实提供了图表分解和分析，但不能发布\n他们到这个subreddit。如果你想阅读完整的帖子，其中包括\n图表分解，你可以这样做：... ...",
      "title": "$MSFT看涨情绪--包含DD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TL;DR: 深入分析MSFT和爲什麼我相信它是一個很好的買入在。\n瞬間。我在帖子中確實提供了圖表分解和分析，但不能發佈\n他們到這個subreddit。如果你想閱讀完整的帖子，其中包括\n圖表分解，你可以這樣做：... ...",
      "title": "$MSFT看漲情緒--包含DD"
    }
  ],
  "title": "$MSFT Bullish Sentiment - DD Included",
  "created_utc": 1615402455,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TL;DR: In depth breakdown of MSFT and why I believe it is a good buy at the moment. I did provide chart breakdowns and analysis in the post but cannot post them to this subreddit. If you would like to read the full post including the chart breakdowns you can do so here: <a href=\"https://maxxprofits.com/p/msft-bullish-sentiment\">https://maxxprofits.com/</a></p>\n\n<p>&#x200B;</p>\n\n<p>The tech giants really took a hit recently. While a lot of people panicked and sold on the hype of inflation and chip shortages I took this opportunity to buy buy buy. This article is going to focus on one of those buys specifically. Microsoft (MSFT)</p>\n\n<p>Not only do I believe that MSFT is a great stable company but it’s also at a price point that I would consider a value. Some of you reading this might think…Wait a second, how can a company be a value buy when it’s sitting near all time high’s? When I say value I don’t mean the Graham-Buffett type of value investing. With this market those types of buys are rare because everything has gone up, up and away. What I’m looking for is companies that I feel strongly bullish on for many years to come aligning with certain technical indicators on the chart. Let’s dive into the meat and potatoes of why I feel MSFT is a great buy.</p>\n\n<p>{Chart Breakdown}</p>\n\n<p>As you can see MSFT recently peaked at all time high’s of $246.13 on February 16, 2021. After divvies were paid we see it trickle down to the 50EMA and slightly bounce up until we hit the market correction that arrived in early March. On this chart the blue line is the 50EMA and the pink line is the 200EMA. I use these two points for various reasons but just know that the 50EMA(blue) acts sort of like a support line. We can see it trickle down a little bit below it but the last time it saw more than two weeks under the 50EMA was March 2020 and we saw it drop below the 200EMA as well for obvious reasons.</p>\n\n<p>{Chart Breakdown}</p>\n\n<p>Crossing below the 50EMA is a bearish sign to a degree. Crossing below the 200EMA is a hard bearish sign that we shouldn’t ignore. Thankfully, MSFT is far off from it’s 200EMA and I don’t see it getting close anytime soon.</p>\n\n<p><strong>Part A</strong> of my technical analysis focuses on the price bouncing off it’s 50 day moving average. We now know that the market has corrected, the price rejected the support and reversed and unless the market flips it and reverses it we should see some movement up.</p>\n\n<p><strong>Part B</strong> is where the real magic lays. For anyone who hasn’t traded with me in the past - I live by the MFI. I get questions all the time why I choose MFI over RSI and just know…<strong>MFI don’t lie</strong>.</p>\n\n<p>The MFI stands for Money Flow Index and it shows the money coming in and out. It helps traders identify overbought and oversold levels. The MFI starts getting overbought when it crosses above 60. I personally don’t really consider it truly overbought until we cross above 80. Oversold levels are 20s and below.</p>\n\n<p>{Chart Breakdown}</p>\n\n<p>This is a zoomed out daily chart of MSFT going back to summer of 2017. The MFI only crossed below 30 twice in the past 3.5 years. October 10, 2018 and March 04, 2021. </p>\n\n<p>MSFT had some ups and downs in 2018 and people didn’t like that so it sold off. It didn’t really start recovering until late December of that same year and that recovery didn’t stop until our friend COVID arrived:</p>\n\n<p>{Chart Breakdown}</p>\n\n<p>Now, with the price dropping significantly one would think the MFI would immediately go into extreme oversold conditions….but it didn’t. The price of MSFT dropped from 190 to 131 in such a rapid short time but our MFI held strong at 31. Since then the MFI has dropped down to 31-32 on two other occasions and quickly reversed:</p>\n\n<p>{Chart Breakdown}</p>\n\n<p>Each of these reversals saw a +10%-15% price increase fairly quickly. In the times of roaring GME gains I understand that 10-15% seems like weak sauce but to us investing vets thats a solid ass play. What makes this play even better is that bounce off the 50EMA. In my personal opinion with the combination of the MFI being so low we are about to see MSFT soar past it’s all time high and fly with the eagles in the cloud.</p>\n\n<blockquote>\n<p><strong>Standard Risk:</strong> Buy MSFT stock $235-$237<strong>Riskier:</strong> Buy MSFT LEAPs for January 2022, March 2022 or June 2022.<strong>Balls to the Wall Risk:</strong> APR 23 $240 Call<strong>Are you fucking insane:</strong> MAR 19 $240 Call</p>\n</blockquote>\n\n<p>There you have it folks. Again, this isn’t financial advice it’s just the opinion of one investor to another. I hope you enjoyed this break down.</p>\n</div><!-- SC_ON -->",
  "score": 54,
  "permalink": "/r/stocks/comments/m1zofx/msft_bullish_sentiment_dd_included/",
  "subreddit": "stocks",
  "id": "m1zofx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542577988
}