{
  "author": "Odlavso",
  "original_created_utc": 1642124854,
  "title": "As much as I hate to admit it, the Anti moon farmers may have a point.",
  "created_utc": 1642145550,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So After Spending time on this sub for a couple of months and seeing people complain about moon farmers and constant repost, I am finally going to have to agree that the same thing does get posted over and over again. I sort by New due to wanting to read and comment on brand new post and I have now seen this  post about Kim kardashian and Floyd Maywether getting sued over some crypto scam posted Dozens of times if not hundreds. &lt;/p&gt;\n\n&lt;p&gt;I would like to state up front that I am in favor of moon farming but feel like a little bit of effort should be put in, not just constantly posting news articles that have already been posted. I am not asking for much, just a quick search to see if its been posted ten times in the last hour already. &lt;/p&gt;\n\n&lt;p&gt;Is there a solution to this? Perhaps&lt;/p&gt;\n\n&lt;p&gt;But I dont have any answers or the power to make any changes on this sub, I just wanted to let you guys know that Kim and Floyd are getting sued and its crypto related.&lt;/p&gt;\n\n&lt;p&gt;Now that everybody knows this, please stop posting the same articles over and over and I will give every post after mine that is not a news article an award until I run out of my Reddit coins.&lt;/p&gt;\n\n&lt;p&gt;Thank you for attending my Rant, and may you be blessed with awards and moons in this difficult time.  &lt;/p&gt;\n\n&lt;p&gt;Edit: I&amp;#39;ve been awarding every new post, but I had to skip the anti ALGO post because I&amp;#39;m pro ALGO and Silvio would get mad at me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 331,
  "permalink": "/r/CryptoCurrency/comments/s3fwib/as_much_as_i_hate_to_admit_it_the_anti_moon/",
  "subreddit": "CryptoCurrency",
  "id": "s3fwib",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So After Spending time on this sub for a couple of months and seeing people\ncomplain about moon farmers and constant repost, I am finally going to have to\nagree that the same thing does get posted over and over again. I sort by New due\nto wanting to read and comment on brand new post and I have now…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数ヶ月間、このサブスクリプションに時間を費やし、多くの人々がこのサブスクリプションを\nムーンファームやリポストについて文句を言いながらも、最終的にはもう\n同じものが何度も投稿されることに同意します。私は、新着順で分類しています。\n新しい記事を読んでコメントしたいので、今...",
      "title": "認めたくないことですが、アンチ月見農法の人たちの言うことも一理あるかもしれません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，在花了几个月的时间在这个子上，看到人们\n抱怨月球农民和不断的转帖，我终于不得不同意\n同意同样的东西确实被反复张贴。我按 \"新 \"分类，因为\n想阅读和评论全新的帖子，现在我已经...",
      "title": "尽管我不愿意承认，但反月球的农民可能有一个观点。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，在花了幾個月的時間在這個子上，看到人們\n抱怨月球農民和不斷的轉帖，我終於不得不同意\n同意同樣的東西確實被反覆張貼。我按 \"新 \"分類，因爲\n想閱讀和評論全新的帖子，現在我已經...",
      "title": "儘管我不願意承認，但反月球的農民可能有一個觀點。"
    }
  ]
}