{
  "author": "Frigorifico",
  "original_created_utc": 1653753318,
  "title": "I get the impression that across history, form Julius Caesar to Napoleon, recruitment new armies was like mass kidnapping all healthy men from a region, is this accurate?",
  "created_utc": 1653779905,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When I read the Gallic Wars I was surprised by Julius Caesar just arriving somewhere and recruiting a new army out of nowhere. It sounds like his soldiers just went to towns and cities, forcing the men there to join his army without much of a choice&lt;/p&gt;\n\n&lt;p&gt;And apparently the same thing kept happening for centuries. When you read about the Napoleonic wars it seems he just arrived somewhere like Poland, Germany or Italy, and he sent his soldiers to force as many men as possible to join his armies&lt;/p&gt;\n\n&lt;p&gt;Granted, many of those men probably joined willingly, but the descriptions of these events, and the speed with which they raised new armies, makes me suspect most of them were coerced into joining&lt;/p&gt;\n\n&lt;p&gt;Is this view correct?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/uzq5rr/i_get_the_impression_that_across_history_form/",
  "subreddit": "AskHistorians",
  "id": "uzq5rr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "When I read the Gallic Wars I was surprised by Julius Caesar just arriving\nsomewhere and recruiting a new army out of nowhere. It sounds like his soldiers\njust went to towns and cities, forcing the men there to join his army without\nmuch of a choice\n\nAnd apparently the same thing kept happening for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ガリア戦記を読んで驚いたのは、ジュリアス・シーザーが到着したばかりに\nいきなり新しい軍隊を募集していることに驚きました。彼の兵士たちは\nをせずに、ただ町や都市を訪れて、そこにいる人たちを強制的に自分の軍隊に参加させたようです。\n強制的に参加させたようです。\n\nそして、どうやら同じようなことがずっと続いていたようです...。",
      "title": "ユリウス・カエサルからナポレオンまで、歴史上、新しい軍隊の採用は、ある地域の健康な男性を大量に誘拐するようなものだったという印象があるのですが、これは正確なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我读《高卢战记》时，我对凯撒大帝刚刚抵达某地并突然招募新的军队感到惊讶。\n某个地方，并突然招募了一支新的军队。这听起来像是他的士兵\n迫使那里的人加入他的军队。\n没有什么选择\n\n显然，同样的事情一直在发生，而且...",
      "title": "我的印象是，在历史上，从凯撒大帝到拿破仑，招募新的军队就像从一个地区大规模绑架所有健康的人，这是否准确？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我讀《高盧戰記》時，我對凱撒大帝剛剛抵達某地並突然招募新的軍隊感到驚訝。\n某個地方，並突然招募了一支新的軍隊。這聽起來像是他的士兵\n迫使那裏的人加入他的軍隊。\n沒有什麼選擇\n\n顯然，同樣的事情一直在發生，而且...",
      "title": "我的印象是，在歷史上，從凱撒大帝到拿破崙，招募新的軍隊就像從一個地區大規模綁架所有健康的人，這是否準確？"
    }
  ]
}