{
  "author": "KittenCrusades",
  "original_created_utc": 1650236134,
  "title": "I fucked up - An idiot with 100k+ transactions for a loss and can't figure out how to report taxes now",
  "created_utc": 1650249584,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My friend made a swing trading crypto bot and I threw 10k at it and let it rip with him in Beta. Cut it off after about 2 months and 4k in losses. 123k transactions happened in that period on Binance.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also an idiot who didn&amp;#39;t know I had to report every transaction. Everything I try to use is just breaking. I ponied up $1500 to &lt;a href=\"https://Cointracker.io\"&gt;Cointracker.io&lt;/a&gt; for their premium version that covers 100k+ transactions, but can&amp;#39;t get anything out of that system either. When I try to connect Cointracker via Turbotax, it errors out everytime.&lt;/p&gt;\n\n&lt;p&gt;HR Block suggested using cointracker also, but then it doesn&amp;#39;t appear there is anywhere to actually import anything, so I don&amp;#39;t know why they suggest using it.&lt;/p&gt;\n\n&lt;p&gt;Anyone report on huge number of crypto transactions have some advice?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Edit: United states.&lt;/p&gt;\n\n&lt;p&gt;Edit2: Calling a professional and filing an extension. Leaving this dumb shit up as a cautionary tale&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 405,
  "permalink": "/r/CryptoCurrency/comments/u5ygms/i_fucked_up_an_idiot_with_100k_transactions_for_a/",
  "subreddit": "CryptoCurrency",
  "id": "u5ygms",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My friend made a swing trading crypto bot and I threw 10k at it and let it rip\nwith him in Beta. Cut it off after about 2 months and 4k in losses. 123k\ntransactions happened in that period on Binance.\n\nI'm also an idiot who didn't know I had to report every transaction. Everything\nI try to use is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "友人がスイングトレードの暗号ボットを作ったので、それに1万円投じてリッピングさせた。\nベータ版で彼と一緒に。約2ヶ月で4,000ドルの損失を出して終了。123k\nその間にBinanceでトランザクションが発生しました。\n\n全ての取引を報告しなければならないことを知らなかったバカでもある。すべて\n使おうとすると...",
      "title": "やらかしました～10万円以上の取引で損切り、今更確定申告の方法が分からない馬鹿者"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的朋友做了一个摇摆交易的加密货币机器人，我向它扔了1万块钱，让它开溜。\n和他一起做测试版。大约2个月后，损失了4千块钱，就把它关掉了。123k\n在此期间在Binance上发生的交易。\n\n我也是个白痴，不知道我必须报告每笔交易。一切\n我试图使用的都是...",
      "title": "我搞砸了--一个有10万多笔交易亏损的白痴，现在还搞不清楚如何报税。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的朋友做了一個搖擺交易的加密貨幣機器人，我向它扔了1萬塊錢，讓它開溜。\n和他一起做測試版。大約2個月後，損失了4千塊錢，就把它關掉了。123k\n在此期間在Binance上發生的交易。\n\n我也是個白癡，不知道我必須報告每筆交易。一切\n我試圖使用的都是...",
      "title": "我搞砸了--一個有10萬多筆交易虧損的白癡，現在還搞不清楚如何報稅。"
    }
  ]
}