{
  "author": "KittenCrusades",
  "original_created_utc": 1650236134,
  "title": "I fucked up - An idiot with 100k+ transactions for a loss and can't figure out how to report taxes now",
  "created_utc": 1650249584,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My friend made a swing trading crypto bot and I threw 10k at it and let it rip with him in Beta. Cut it off after about 2 months and 4k in losses. 123k transactions happened in that period on Binance.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also an idiot who didn&amp;#39;t know I had to report every transaction. Everything I try to use is just breaking. I ponied up $1500 to &lt;a href=\"https://Cointracker.io\"&gt;Cointracker.io&lt;/a&gt; for their premium version that covers 100k+ transactions, but can&amp;#39;t get anything out of that system either. When I try to connect Cointracker via Turbotax, it errors out everytime.&lt;/p&gt;\n\n&lt;p&gt;HR Block suggested using cointracker also, but then it doesn&amp;#39;t appear there is anywhere to actually import anything, so I don&amp;#39;t know why they suggest using it.&lt;/p&gt;\n\n&lt;p&gt;Anyone report on huge number of crypto transactions have some advice?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Edit: United states.&lt;/p&gt;\n\n&lt;p&gt;Edit2: Calling a professional and filing an extension. Leaving this dumb shit up as a cautionary tale&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 405,
  "permalink": "/r/CryptoCurrency/comments/u5ygms/i_fucked_up_an_idiot_with_100k_transactions_for_a/",
  "subreddit": "CryptoCurrency",
  "id": "u5ygms",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My friend made a swing trading crypto bot and I threw 10k at it and let it rip\nwith him in Beta. Cut it off after about 2 months and 4k in losses. 123k\ntransactions happened in that period on Binance.\n\nI'm also an idiot who didn't know I had to report every transaction. Everything\nI try to use is…"
}