{
  "author": "Snomannen",
  "the_new_excerpt": "I just wanna share this because im curious if others have the same experience\nbut basically after getting into crypto and getting some sweet gains I barely\nspend any money. Dont get me wrong, I'm far from being rich but theres a lot of\nstuff I always wanted that I could get now but I simply dont…",
  "original_created_utc": 1617783468,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "他の人も同じような経験をしているのではないかと思い、これを共有したいと思います。\nが、基本的には暗号化されたものを手に入れ、素晴らしい利益を得た後は、ほとんど\nお金を使うことはほとんどありません。誤解しないで欲しいのですが、私はお金持ちには程遠いですが、いつも欲しかったものがたくさんあります。\n欲しいと思っていたものがたくさんあって、今なら手に入れることができますが、単に...",
      "title": "暗号化を始めてからの支出が大幅に減った"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是想分享这一点，因为我很好奇，如果其他人有同样的经验。\n但基本上在进入加密货币并获得一些甜美的收益后，我几乎不\n花任何钱。不要误会我的意思，我远远没有成为有钱人，但有很多。\n我一直想要的东西，我可以得到现在，但我根本不... ...",
      "title": "进入加密领域后，花的钱少了很多。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是想分享這一點，因爲我很好奇，如果其他人有同樣的經驗。\n但基本上在進入加密貨幣並獲得一些甜美的收益後，我幾乎不\n花任何錢。不要誤會我的意思，我遠遠沒有成爲有錢人，但有很多。\n我一直想要的東西，我可以得到現在，但我根本不... ...",
      "title": "進入加密領域後，花的錢少了很多。"
    }
  ],
  "title": "Spending much less money after getting into crypto",
  "created_utc": 1617798633,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just wanna share this because im curious if others have the same experience but basically after getting into crypto and getting some sweet gains I barely spend any money. Dont get me wrong, I&#39;m far from being rich but theres a lot of stuff I always wanted that I could get now but I simply dont feel like buying them anymore. I always imagined that if I made a lot of money from crypto id buy all kinds of stuff but its the complete opposite. Im not exactly sure why but I think I just have a new perspective on money and value it more and therefore more scared to spend it.\nI&#39;m really glad I&#39;ve become less materalistic and only wish I was always like I am now.</p>\n</div><!-- SC_ON -->",
  "score": 2724,
  "permalink": "/r/CryptoCurrency/comments/mlxfqe/spending_much_less_money_after_getting_into_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "mlxfqe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961876907
}