{
  "author": "AffectionateMind26",
  "original_created_utc": 1630292066,
  "title": "Solana breaks $100 for the first time ever",
  "created_utc": 1630316118,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Solana (SOL) has achieved its latest all-time high with some impressive growth in the last 24 hours.</p>\n\n<p>The token, currently ranked the 8th most valuable cryptocurrency by market capitalization, shooting over the $100 threshold. At the time of writing this post, SOL is worth $100</p>\n\n<p>This milestone is the end result of a series of spikes, beginning in the afternoon of August 26. At that point, SOL was in a relatively lowly position of $67.55, one of its lower points across the week. However, it blasted its way back up in the space of two hours, crossing the $75 mark, where it hovered until the following morning. From there, it made another sharp climb and reached $82.64; again in only a matter of hours. Further spikes followed in the ensuing 24 hours; SOL clambered steadily up to the $88 mark in the small hours of August 28. It went on to move past $100 after 2 days.</p>\n\n<p>Do not Fomo in right now. Buy in the next dip.</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/pe9jvj/solana_breaks_100_for_the_first_time_ever/",
  "subreddit": "CryptoCurrency",
  "id": "pe9jvj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Solana (SOL) has achieved its latest all-time high with some impressive growth\nin the last 24 hours.\n\nThe token, currently ranked the 8th most valuable cryptocurrency by market\ncapitalization, shooting over the $100 threshold. At the time of writing this\npost, SOL is worth $100\n\nThis milestone is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ソラナ（SOL）は、過去24時間の間に印象的な成長を遂げ、最新の史上最高値を達成しました。\nは、過去24時間で素晴らしい成長を遂げ、最新の史上最高値を達成しました。\n\nこのトークンは、現在、時価総額で最も価値のある暗号通貨の第8位にランクされています。\nトークンは現在、時価総額で最も価値のある暗号通貨の8位にランクインしており、100ドルのしきい値を超えました。この記事を書いている時点で\nこの記事を書いている時点で、SOLは100ドルの価値があります。\n\nこのマイルストーンは...",
      "title": "ソラナ、史上初の100ドル突破"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "索拉纳（SOL）实现了最新的历史高点，在过去24小时内有一些令人印象深刻的增长。\n在过去24小时内取得了令人印象深刻的增长。\n\n该代币目前在按市值计算的最有价值的加密货币中排名第八。\n目前，该代币按市值排名第八，超过了100美元的门槛。在写这篇文章的时候\n帖子时，SOL的价值为100美元\n\n这个里程碑是...",
      "title": "索拉纳有史以来首次突破100美元"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "索拉納（SOL）實現了最新的歷史高點，在過去24小時內有一些令人印象深刻的增長。\n在過去24小時內取得了令人印象深刻的增長。\n\n該代幣目前在按市值計算的最有價值的加密貨幣中排名第八。\n目前，該代幣按市值排名第八，超過了100美元的門檻。在寫這篇文章的時候\n帖子時，SOL的價值爲100美元\n\n這個里程碑是...",
      "title": "索拉納有史以來首次突破100美元"
    }
  ]
}