{
  "author": "CuntyMcGiggles",
  "original_created_utc": 1634823359,
  "title": "Knowledge is knowing a tomato is a fruit. Wisdom is knowing not to put it in a fruit salad.",
  "created_utc": 1634859042,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I see a lot of people bitching that NFTs are a scam and I’ve seen a dozen comments at least that people wouldn’t buy SHIB even if they knew it would double “out of principle”</p>\n\n<p>This isn’t a reality show. There are no points or gains to be made from taking some kind of neckbeard elitist “high road”. So what is SHIB is crap? Then don’t buy it. But don’t get salty when people trade it and make money on it. Yes. It’s a fruit (as opposed to BTC being broccoli and ETH being carrots). It still can be used to make money </p>\n\n<p>A WISE investor recognizes that an NFT has no inherent value and will be worthless one day but can be used to make money TODAY </p>\n\n<p>This applies to “just being in it for the tech”. Okay. Then your profile will be sound and you shouldn’t give a fuck if people invest in NFTs or shitcoins </p>\n\n<p>The level of hipster neckbeardism is out of control</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/qcryws/knowledge_is_knowing_a_tomato_is_a_fruit_wisdom/",
  "subreddit": "CryptoCurrency",
  "id": "qcryws",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I see a lot of people bitching that NFTs are a scam and I’ve seen a dozen\ncomments at least that people wouldn’t buy SHIB even if they knew it would\ndouble “out of principle”\n\nThis isn’t a reality show. There are no points or gains to be made from taking\nsome kind of neckbeard elitist “high road”.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "NFTは詐欺だと愚痴っている人をよく見かけますが、私は何十人もの\n倍になるとわかっていてもSHIBを買わないというコメントを少なくとも12回は見ました。\n\"原理的に\"\n\nこれはリアリティショーではありません。これはリアリティショーではありません。\n.... のような首をかしげるようなエリート主義の「王道」を行くことで得られるポイントや利益はありません。",
      "title": "知識とは、トマトが果物であることを知ることです。知恵とは、フルーツサラダにトマトを入れないことを知ることです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到很多人在抱怨NFT是一个骗局，我已经看到了十几个\n至少有十几条评论说，即使知道SHIB会翻倍，人们也不会买它。\n双倍的 \"原则\"。\n\n这又不是真人秀节目。没有任何积分或收益可以通过服用\n某种颈部精英主义的 \"大道\"....",
      "title": "知识就是知道西红柿是一种水果。智慧是知道不要把它放在水果沙拉里。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到很多人在抱怨NFT是一個騙局，我已經看到了十幾個\n至少有十幾條評論說，即使知道SHIB會翻倍，人們也不會買它。\n雙倍的 \"原則\"。\n\n這又不是真人秀節目。沒有任何積分或收益可以通過服用\n某種頸部精英主義的 \"大道\"....",
      "title": "知識就是知道西紅柿是一種水果。智慧是知道不要把它放在水果沙拉里。"
    }
  ]
}