{
  "author": "Sneerz",
  "the_new_excerpt": "This has been a great 2 weeks for stocks. In this time AMC led the way and\nshowed the shorter sellers the power of retail. This week, we saw the boosts of\nCLOV, BB, GME, TLRY, WKHS, CLF and CLNE. One name has probably been in\neveryone’s peripheral vision: UWMC.\n\nToday was a mixed sentiment day with…",
  "original_created_utc": 1623283531,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この2週間は、株にとって素晴らしい2週間でした。この間、AMCは先頭に立って\nこの間、AMCが先頭に立ち、短距離販売者に小売の力を示しました。今週は、CLOV、BB、GME、TLRY、WKHS、CLF、CLNEが上昇しました。\nCLOV、BB、GME、TLRY、WKHS、CLF、CLNE。その中でも特に注目されているのが\n誰もが周辺視野に入れていた名前があります。UWMCです。\n\n今日は、様々な感情が入り混じった一日でした。",
      "title": "UWMCのリアルなDD"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对股票来说，这是一个伟大的2周。在这段时间里，AMC引领了潮流，并\n向空头卖家展示了零售的力量。本周，我们看到了以下股票的提升\nCLOV, BB, GME, TLRY, WKHS, CLF和CLNE。有一个名字可能已经出现在\n每个人的外围视野。UWMC。\n\n今天是一个喜忧参半的日子，...",
      "title": "关于UWMC的现实的DD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對股票來說，這是一個偉大的2周。在這段時間裏，AMC引領了潮流，並\n向空頭賣家展示了零售的力量。本週，我們看到了以下股票的提升\nCLOV, BB, GME, TLRY, WKHS, CLF和CLNE。有一個名字可能已經出現在\n每個人的外圍視野。UWMC。\n\n今天是一個喜憂參半的日子，...",
      "title": "關於UWMC的現實的DD"
    }
  ],
  "title": "Realistic DD on UWMC",
  "created_utc": 1623321087,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This has been a great 2 weeks for stocks. In this time AMC led the way and showed the shorter sellers the power of retail. This week, we saw the boosts of CLOV, BB, GME, TLRY, WKHS, CLF and CLNE. One name has probably been in everyone’s peripheral vision: UWMC. </p>\n\n<p>Today was a mixed sentiment day with many of our tickers seeing pullbacks and folks taking profit. UWMC was able to weather the storm. In a full day session, UWMC not once dip below 6% green. It held strong even as the other popular ticker experienced sell downs. The reason for this is simple: it’s a GREAT company.</p>\n\n<p>Here are just some highlights of upcoming catalysts:</p>\n\n<ol>\n<li><p>Increasing short interest, 55% over the past few weeks. Despite the stellar performance over the last few days short interest went up.</p></li>\n<li><p>Resilience to short attacks. Through the day there were several obvious short attempts to pull the down the stock but UWMC recovered instantly each time. This demonstrates an enormous pool of buyers with eyes locked.</p></li>\n<li><p>Russell 2000 inclusion this Friday. I don’t think I need to point out the obvious benefits of ETFs in this play.</p></li>\n<li><p>4% Dividends will be distributed on July 6th. Many of these dividend distributions will find its way back into the stock.</p></li>\n<li><p>50K share insider purchase this morning. When memes go up, insiders sell. This is Not the case with UWMC. Insiders are buying! That’s how much management believes in the company.</p></li>\n<li><p>There’s still the 300M share buyback that’s taking place while we ride.</p></li>\n</ol>\n\n<p>Get ready boys, this will be a good one.</p>\n</div><!-- SC_ON -->",
  "score": 1527,
  "permalink": "/r/wallstreetbets/comments/nwa3gh/realistic_dd_on_uwmc/",
  "subreddit": "wallstreetbets",
  "id": "nwa3gh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009745416
}