{
  "author": "Shadows___",
  "original_created_utc": 1634542045,
  "title": "Why do men have to pay child support but women don’t?",
  "created_utc": 1634574804,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Now the title is a bit straight forward but let’s provide some context. Women have a choice to back out of a pregnancy I.E. an abortion but if a man chooses to back out and the women wants the baby then why should he be forced to pay child support. I understand that if a dad walks out 5 years down the line then totally force him to pay. It just seems like a touchy subject and therefore I’m putting it on too afraid to ask.</p>\n\n<p>Yes I know that in some cases women do pay child support however that’s very rare.</p>\n\n<p>Edit: thanks for the reply’s they’re helpful.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/qahrcr/why_do_men_have_to_pay_child_support_but_women/",
  "subreddit": "TooAfraidToAsk",
  "id": "qahrcr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Now the title is a bit straight forward but let’s provide some context. Women\nhave a choice to back out of a pregnancy I.E. an abortion but if a man chooses\nto back out and the women wants the baby then why should he be forced to pay\nchild support. I understand that if a dad walks out 5 years down…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、タイトルはちょっとわかりやすいですが、少し背景を説明しましょう。女性は\n妊娠をやめる、つまり中絶するという選択肢がありますが、もし男性が妊娠をやめることを選び\n養育費を払わなければならないのでしょうか？\n養育費を払わなければならないのでしょうか？もし父親が5年後に出て行ったら...というのは理解できます。",
      "title": "なぜ男性は養育費を払わなければならないのに、女性は払わないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在，这个标题有点直接，但让我们提供一些背景。妇女\n妇女可以选择放弃怀孕，即堕胎，但如果一个男人选择放弃，而妇女想要孩子，那么他为什么要被迫支付费用？\n但如果一个男人选择退出，而女人想要这个孩子，那么为什么他要被迫支付\n儿童抚养费。我明白，如果一个父亲在5年后退出......",
      "title": "为什么男人必须支付孩子的抚养费，而女人却不需要？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在，這個標題有點直接，但讓我們提供一些背景。婦女\n婦女可以選擇放棄懷孕，即墮胎，但如果一個男人選擇放棄，而婦女想要孩子，那麼他爲什麼要被迫支付費用？\n但如果一個男人選擇退出，而女人想要這個孩子，那麼爲什麼他要被迫支付\n兒童撫養費。我明白，如果一個父親在5年後退出......",
      "title": "爲什麼男人必須支付孩子的撫養費，而女人卻不需要？"
    }
  ]
}