{
  "author": "Cicada_lies_heavy",
  "original_created_utc": 1644969455,
  "title": "Why does the Song of Roland have such a weird ending?",
  "created_utc": 1644979426,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Apologies if this belongs to another subreddit, I couldn&amp;#39;t find &amp;#39;AskHumanities&amp;#39; or anything similar.&lt;/p&gt;\n\n&lt;p&gt;I just read the Song of Roland, and while it was very enjoyable (especially the battle scenes with all their bravado), it ended abruptly for no clear reason. After punishing Ganelon, Charles the Great goes to sleep, and receives a mission from Gabriel - he is told to help out some random city besieged by the Saracens. Then he cries and complains about having so many responsibilities as a king.&lt;br/&gt;\nThe end.&lt;/p&gt;\n\n&lt;p&gt;???&lt;/p&gt;\n\n&lt;p&gt;Talk about anti-climactic. Who would ever consider this a good idea, even in the 11th century? There must be some historical explanation, maybe the story is supposed to continue, or it was tradition to end on a weird note, or maybe we lost the ending. Do you have any info on this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/sthaok/why_does_the_song_of_roland_have_such_a_weird/",
  "subreddit": "AskHistorians",
  "id": "sthaok",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Apologies if this belongs to another subreddit, I couldn't find 'AskHumanities'\nor anything similar.\n\nI just read the Song of Roland, and while it was very enjoyable (especially the\nbattle scenes with all their bravado), it ended abruptly for no clear reason.\nAfter punishing Ganelon, Charles the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もしこれが別のsubredditに属しているのであれば、お詫びします。\nなどがあります。\n\nローランの歌」を読んだところですが、とても面白かったのですが（特に\n戦闘シーンは威勢がいいのですが、明確な理由もなく突然終わってしまいました。\nガネロンを懲らしめた後、シャルル・ザ・...",
      "title": "ローランの歌」は、なぜあんなに変な終わり方をするのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果这属于另一个子目录，我无法找到 \"AskHumanities \"或类似的东西，请见谅。\n或类似的东西。\n\n我刚刚读了《罗兰之歌》，虽然它非常令人愉快（尤其是\n虽然它非常令人愉快（尤其是那些夸夸其谈的战斗场面），但它却没有明确的理由而突然结束。\n在惩罚了加内龙之后，查理...",
      "title": "为什么《罗兰之歌》有一个如此奇怪的结局？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果這屬於另一個子目錄，我無法找到 \"AskHumanities \"或類似的東西，請見諒。\n或類似的東西。\n\n我剛剛讀了《羅蘭之歌》，雖然它非常令人愉快（尤其是\n雖然它非常令人愉快（尤其是那些誇誇其談的戰鬥場面），但它卻沒有明確的理由而突然結束。\n在懲罰了加內龍之後，查理...",
      "title": "爲什麼《羅蘭之歌》有一個如此奇怪的結局？"
    }
  ]
}