{
  "author": "weedrangoon",
  "original_created_utc": 1657661383,
  "title": "How do you make friends in your 20’s?",
  "created_utc": 1657688299,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;What the title says, Im soon to be 25 and I don’t even have a single person that I can consider a close friend. \nAnyone that I was friends with in the past has either moved out of the country or started an adult life with a spouse and children and any plans to see each other or even attempts to chat have fallen thru. \nI’ve already graduated college (which was mostly online due to the pandemic) so I feel like I’ve missed the opportunity for college friends, and I work for a small company with only 10 other people who are all much older than me and we have very little in common. \nI’ve also tried Bumble BFF in the past but my experience was either creepy men posing as women or matching with a woman, having a quick chat and then never hearing from them again.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/vxm760/how_do_you_make_friends_in_your_20s/",
  "subreddit": "TooAfraidToAsk",
  "id": "vxm760",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "What the title says, Im soon to be 25 and I don’t even have a single person that\nI can consider a close friend. Anyone that I was friends with in the past has\neither moved out of the country or started an adult life with a spouse and\nchildren and any plans to see each other or even attempts to chat…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルにあるように、もうすぐ25歳になる私には、一人の人間もいない。\n親しい友人と思える人が一人もいません。過去に友達だった人はみんな\n海外に移住してしまったか、配偶者や子供がいる社会人になったか。\n過去に友人だった人は、国外に移住したか、配偶者や子供がいる社会人になったかで、会う予定もなければ、チャットすることさえできません...",
      "title": "20代で友達を作るにはどうしたらいい？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说，我很快就25岁了，我甚至没有一个人知道我是谁。\n我可以认为是亲密的朋友。过去和我做过朋友的人都已经\n要么搬出了这个国家，要么开始了有配偶和孩子的成人生活。\n任何见面的计划，甚至是聊天的尝试......",
      "title": "20多岁时如何交朋友？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說，我很快就25歲了，我甚至沒有一個人知道我是誰。\n我可以認爲是親密的朋友。過去和我做過朋友的人都已經\n要麼搬出了這個國家，要麼開始了有配偶和孩子的成人生活。\n任何見面的計劃，甚至是聊天的嘗試......",
      "title": "20多歲時如何交朋友？"
    }
  ]
}