{
  "author": "Brickie78",
  "original_created_utc": 1631411083,
  "title": "Is there evidence for the \"Cobra Effect\" story?",
  "created_utc": 1631427356,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Over in <a href=\"/r/history\">r/history</a>, <a href=\"/u/jehoshua42\">u/jehoshua42</a> asked about instances where attempts to solve a problem end up making it worse.</p>\n\n<p>The example that sprang to my mind was the story often told (for example on QI) of the time the British Raj issued a bounty on cobras, only to find the Indian locals starred breeding them to get more money - so the bounty was ended, which meant the snakes were released and there were more cobras than ever.</p>\n\n<p>It&#39;s cited as the most famous example on the Wikipedia page on <a href=\"https://en.m.wikipedia.org/wiki/Perverse_incentive\">Perverse Incentive</a>, but the citations go to  a religious tract and an essay on economics, both of which are probably not interested in the actual historicity or otherwise of the event.</p>\n\n<p>There was an AH question from 8 years ago, where one responder misunderstood the question and gave a different example of the phenomenon (featuring severed hands in the Belgian Congo) and another pasted a couple of paragraphs of French that apparently again gave another example of rat rails in Indochina.</p>\n\n<p>So, did it happen?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/pmjrdg/is_there_evidence_for_the_cobra_effect_story/",
  "subreddit": "AskHistorians",
  "id": "pmjrdg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Over in r/history [/r/history], u/jehoshua42 [/u/jehoshua42] asked about\ninstances where attempts to solve a problem end up making it worse.\n\nThe example that sprang to my mind was the story often told (for example on QI)\nof the time the British Raj issued a bounty on cobras, only to find the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/history [/r/history]で、u/jehoshua42 [/u/jehoshua42]さんが、以下のような質問をしました。\n問題を解決しようとすると、かえって問題を悪化させてしまう例について。\n\n私の頭に浮かんだ例は、（例えばQIなどで）よく語られる話です。\n英国統治時代にコブラに懸賞金をかけたところ、そのコブラが...」という話です。",
      "title": "コブラ・エフェクト」の話には根拠があるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在r/history [/r/history]中，u/jehoshua42 [/u/jehoshua42]问及\n试图解决一个问题的努力最终使问题变得更糟的例子。\n\n我想到的例子是经常讲的故事（例如在QI上）。\n英国王室对眼镜蛇进行悬赏，结果发现......。",
      "title": "有证据证明 \"眼镜蛇效应 \"的故事吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在r/history [/r/history]中，u/jehoshua42 [/u/jehoshua42]問及\n試圖解決一個問題的努力最終使問題變得更糟的例子。\n\n我想到的例子是經常講的故事（例如在QI上）。\n英國王室對眼鏡蛇進行懸賞，結果發現......。",
      "title": "有證據證明 \"眼鏡蛇效應 \"的故事嗎？"
    }
  ]
}