{
  "author": "DaddySkates",
  "original_created_utc": 1634729507,
  "title": "Unpopular as heck: If this sub is shilling a coin and is super excited about it cause it has awesome tech, superb adoption, overwhelming community support, don't buy it.",
  "created_utc": 1634740454,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This sub is a circlejerk echo chamber that shills coins that end up going nowhere.</p>\n\n<p>&#x200B;</p>\n\n<p>When LINK was $34 everyone and their mother was shilling LINK as the next big thing going to $200 before the end of summer, the amazing oracle that it is and how it will change everything we know in crypto. Current price: $25</p>\n\n<p>Next one was ERGO which was shilled to no end with many saying that ERGO will be oracle of Cardano until it wasnt. It&#39;ll go to three digits by end of year. Currently its $9.99 and down 32% from 30 days ago and 66% from ATH. Remember that everything is pumping now. I know its not just an oracle but I expected a lot more activity from it. And Cardano doesnt seem to care much for it..hopefully things change.</p>\n\n<p>VET, the amazing and superb VET that will clean the oceans, track food, produce and so on. It&#39;s been going sideways for so long that I dont even remember. It&#39;s currently valued at $0.11 and keeps the price steadier than a stablecoin.</p>\n\n<p>And LTO? Yeah, 70% down from the ATH a few months ago with no recovery in sight.   </p>\n\n<p>I listened and was hyped enough to buy these (apart from LTO) and I know I&#39;ll get a lot of faeces thrown at me for posting this but this sub is a circlejerk echo chamber. </p>\n\n<p>See you tomorrow guys.</p>\n</div><!-- SC_ON -->",
  "score": 315,
  "permalink": "/r/CryptoCurrency/comments/qbyq2i/unpopular_as_heck_if_this_sub_is_shilling_a_coin/",
  "subreddit": "CryptoCurrency",
  "id": "qbyq2i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This sub is a circlejerk echo chamber that shills coins that end up going\nnowhere.\n\n\n\nWhen LINK was $34 everyone and their mother was shilling LINK as the next big\nthing going to $200 before the end of summer, the amazing oracle that it is and\nhow it will change everything we know in crypto. Current…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブは、結局どこにも行かないようなコインを売りつけるサークルジャークのエコーチャンバーです。\nどこにも行きません。\n\n\n\nLINKが34ドルだったとき、誰もが、そしてその母親も、LINKを次の大きなものとして売り込んでいました。\n夏の終わりまでに200ドルになる次の大きなもの、それは素晴らしい神託であり\nそれがどのように我々が知っている暗号のすべてを変えるのか。現在の...",
      "title": "めちゃくちゃ不評ですね。もし、このサブリーダーがコインを売り込んでいて、そのコインが素晴らしい技術を持ち、優れた採用率を誇り、圧倒的なコミュニティのサポートを受けているからといって、とても興奮しているのであれば、買ってはいけません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这家子公司是一个圈子里的回声室，推销硬币，最终没有任何结果。\n不见了。\n\n\n\n当LINK是34美元的时候，每个人和他们的母亲都在宣传LINK是下一个大的东西。\n当LINK是34美元的时候，每个人和他们的母亲都在吹嘘LINK是下一个大的东西，在夏天结束前会达到200美元，它是一个惊人的神谕，以及\n它将如何改变我们对加密货币的一切认识。目前...",
      "title": "不受欢迎的是。如果这个子在推销一个硬币，并且对它超级兴奋，因为它有令人敬畏的技术，精湛的采用，压倒性的社区支持，那就不要买它。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這家子公司是一個圈子裏的回聲室，推銷硬幣，最終沒有任何結果。\n不見了。\n\n\n\n當LINK是34美元的時候，每個人和他們的母親都在宣傳LINK是下一個大的東西。\n當LINK是34美元的時候，每個人和他們的母親都在吹噓LINK是下一個大的東西，在夏天結束前會達到200美元，它是一個驚人的神諭，以及\n它將如何改變我們對加密貨幣的一切認識。目前...",
      "title": "不受歡迎的是。如果這個子在推銷一個硬幣，並且對它超級興奮，因爲它有令人敬畏的技術，精湛的採用，壓倒性的社區支持，那就不要買它。"
    }
  ]
}