{
  "author": "AskScienceModerator",
  "original_created_utc": 1625569226,
  "title": "AskScience AMA Series: I'm Dr. Kate Biberdorf (AKA Kate the Chemist). I'm a chemistry professor that creates huge explosions for stars like Kelly Clarkson and Stephen Colbert, and I also write bestselling science books for kids. Ask me anything!",
  "created_utc": 1625584772,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi Reddit! Let me introduce myself. I&#39;m a chemistry professor, science entertainer, and author that uses a theatrical and hands-on approach to teaching, all while trying to inspire students across the world to fall in love with science. You may have seen me in a blue lab coat and red-bottomed heels on <em>The Today Show</em>, <em>The Kelly Clarkson Show</em>, <em>NBC Nightly News</em>, the <em>Wendy Williams Show</em>, the <em>Rachael Ray Show</em>, or <em>Late Night with Stephen Colbert</em>, where I try to make each explosion bigger than the last one. I travel the country collecting science advocates to be part of my STEM army, and we&#39;re working together to break down the image of the stereotypical scientist. Here&#39;s where 70 female scientists broke the record for the most thunderclouds at one time: <a href=\"https://thedailytexan.com/2020/02/10/kate-the-chemist-cbs-mission-unstoppable-show-taping/\">https://thedailytexan.com/2020/02/10/kate-the-chemist-cbs-mission-unstoppable-show-taping/</a>.</p>\n\n<p>I&#39;ve published seven children&#39;s books, including the bestseller <a href=\"https://www.amazon.com/Kate-Chemist-Big-Book-Experiments/dp/059311616X\">The Big Book of Experiments</a>, and I cannot wait to hit the road next week to promote my new book <a href=\"https://www.amazon.com/Its-Elemental-Hidden-Chemistry-Everything/dp/0778389421\">It&#39;s Elemental: The Hidden Chemistry in Everything</a>. In the book, I highlight the ways we experience chemistry in our everyday lives; starting with breakfast and an early morning workout, to going to the beach and then happy hour, and finally ending the day by analyzing the science in the bedroom. It&#39;s my first nonfiction book for adults, and I&#39;m so excited to share it with you all!</p>\n\n<p>Want to see some explosions? Check out my first visit to the Today Show (<a href=\"https://www.youtube.com/watch?v=9W9DCSABs2U\">https://www.youtube.com/watch?v=9W9DCSABs2U</a>) or the time I scared the crap out of Stephen Colbert (<a href=\"https://www.youtube.com/watch?v=nELtaMKMP8o\">https://www.youtube.com/watch?v=nELtaMKMP8o</a>).</p>\n\n<p>Learn more at <a href=\"http://www.katethechemist.com\">www.katethechemist.com</a> or follow me on Instagram (@katethechemist), TikTok (@katethechemist), and Twitter (@k8thechemist). See you all at 11AM Central/Noon ET (16 UT), ask me anything!</p>\n\n<p>Username: <a href=\"/u/katethechemist\">/u/katethechemist</a></p>\n</div><!-- SC_ON -->",
  "score": 133,
  "permalink": "/r/askscience/comments/oesncf/askscience_ama_series_im_dr_kate_biberdorf_aka/",
  "subreddit": "askscience",
  "id": "oesncf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi Reddit! Let me introduce myself. I'm a chemistry professor, science\nentertainer, and author that uses a theatrical and hands-on approach to\nteaching, all while trying to inspire students across the world to fall in love\nwith science. You may have seen me in a blue lab coat and red-bottomed heels…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、Reddit! 私の自己紹介をさせてください。私は化学の教授であり、科学エンターテイナー\n私は化学の教授であり、科学エンターテイナーであり、作家でもあり、演劇的で実践的なアプローチで授業を行っています。\n演劇的で実践的なアプローチで授業を行い、世界中の学生に科学を好きになってもらおうと努力しています。\n科学を好きになってもらおうとしています。青い白衣を着て、赤い底のヒールを履いた私を見たことがあるかもしれませんね。",
      "title": "AskScience AMAシリーズ。ケイト・ビーバードルフ博士（通称：ケイト・ザ・ケミスト）です。ケリー・クラークソンやスティーブン・コルベアなどのスターのために大爆発を起こす化学教授であり、子供向けのベストセラー科学書も書いています。何でも聞いてね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Hi Reddit! 让我介绍一下自己。我是一名化学教授、科学\n我是一名化学教授、科学表演者和作家，采用戏剧性和实践性的方法进行教学。\n教学，同时努力激励世界各地的学生爱上科学。\n科学。你可能已经看到我穿着蓝色实验服和红底高跟鞋...",
      "title": "AskScience AMA系列。我是凯特-比伯多夫博士（又名凯特化学家）。我是一名化学教授，为凯利-克拉克森和斯蒂芬-科尔伯特等明星创造了巨大的爆炸，我还为孩子们写畅销的科学书籍。问我任何问题吧!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Hi Reddit! 讓我介紹一下自己。我是一名化學教授、科學\n我是一名化學教授、科學表演者和作家，採用戲劇性和實踐性的方法進行教學。\n教學，同時努力激勵世界各地的學生愛上科學。\n科學。你可能已經看到我穿着藍色實驗服和紅底高跟鞋...",
      "title": "AskScience AMA系列。我是凱特-比伯多夫博士（又名凱特化學家）。我是一名化學教授，爲凱利-克拉克森和斯蒂芬-科爾伯特等明星創造了巨大的爆炸，我還爲孩子們寫暢銷的科學書籍。問我任何問題吧!"
    }
  ]
}