{
  "author": "thesimplemindedllama",
  "original_created_utc": 1626929369,
  "title": "Bitcoin will reach $75k in September: Here's How",
  "created_utc": 1626942641,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, as we all know, technical analysis is an extremely useful and accurate way to predict price movement over time. However, most people fail to use it correctly because they lack the skills to recognize great set ups. Triangles, wedges, cups and handles and flags and pennants and everything else you&#39;ve been told to use might work 40-50% of the time, but what if I told you that there was an <strong>extremely rare,</strong> <strong><em>EXTREMELY BULLISH</em></strong> chart pattern that you&#39;ve never heard of?</p>\n\n<p>I introduce to you: the &quot;Stegosaurus Under a Rainbow&quot;. Charts this bullish are almost always the stuff of fantasies, but as of the 7/20 daily candle&#39;s close, Bitcoin has broken out of its spiked tail range and will soon be on the move to ATH.</p>\n\n<p><a href=\"https://preview.redd.it/dy75jbb9xoc71.png?width=2709&amp;format=png&amp;auto=webp&amp;s=cac507100746399656e9258ea0892ff18ff5174c\">The \\&quot;Stegosaurus Under a Rainbow\\&quot; Chart Pattern</a></p>\n\n<p>So, how does it work? Glad you asked. First, we start with the formation of the head, and most notably, the eyeball. The uptrend into 2021 began to reverse and form the neckline, which ended in mid-February. The long wicks in January, one green and one red, form a level of support perfect for this little guy&#39;s eye to sit at. But, the formation of the head + eye do little on their own, so let&#39;s move on.</p>\n\n<p>During the massive bull run, we see BTC in a strong uptrend, creating higher highs and higher lows between February and the end of May. These form the iconic scutes, (the bony plates on its back) and lead us  gently into the consolidation phase, the spiked tail.</p>\n\n<p>Before I forget, the rainbow is an often overlooked feature of this highly technical pattern. In order to be confirmed, there needs to be a touch from the candles in the head range, the tail range, and each and every scute. Although we almost didn&#39;t get the last bounce from the tail spikes, it managed to eek out two bullish days in a row and close the rainbow.</p>\n\n<p>The most delicate and most important phase is the final consolidation down Mr. Stegosaurus&#39; spiked tail. These choppy movements are volatile and difficult to trade, but somehow the candles managed to outline an exceptionally strong tail.</p>\n\n<p>The nearly 8% swing on the 7/20 candle broke out to the upside of the tail range and confirmed that, beyond a shadow of a doubt, Bitcoin is about to take off and reach ATHs very very soon.</p>\n\n<p>See you all at $75k!</p>\n</div><!-- SC_ON -->",
  "score": 185,
  "permalink": "/r/CryptoCurrency/comments/op6xvs/bitcoin_will_reach_75k_in_september_heres_how/",
  "subreddit": "CryptoCurrency",
  "id": "op6xvs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So, as we all know, technical analysis is an extremely useful and accurate way\nto predict price movement over time. However, most people fail to use it\ncorrectly because they lack the skills to recognize great set ups. Triangles,\nwedges, cups and handles and flags and pennants and everything else…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ご存知のように、テクニカル分析は非常に便利で正確な方法です。\n価格の動きを予測するのに非常に有効で正確な方法です。しかし、多くの人はテクニカル分析を正しく使うことができません。\nしかし、多くの人がテクニカル分析を正しく使うことができないのは、優れたセットアップを見分けるスキルがないからです。三角形。\nカップやハンドル、フラッグやペナント、その他もろもろ...。",
      "title": "ビットコインは9月に75kドルに達する：その方法とは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，我们都知道，技术分析是一种极其有用和准确的方式\n来预测一段时间内的价格走势。然而，大多数人未能正确使用它\n因为他们缺乏识别伟大布局的技能。三角形。\n楔形、杯状、柄状、旗状和羽状以及其他一切...",
      "title": "比特币将在9月达到7500美元：这里是如何做到的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，我們都知道，技術分析是一種極其有用和準確的方式\n來預測一段時間內的價格走勢。然而，大多數人未能正確使用它\n因爲他們缺乏識別偉大布局的技能。三角形。\n楔形、杯狀、柄狀、旗狀和羽狀以及其他一切...",
      "title": "比特幣將在9月達到7500美元：這裏是如何做到的"
    }
  ]
}