{
  "author": "VengefulHero",
  "original_created_utc": 1628030281,
  "title": "Just because were investing doesnt mean were gonna be millionaires some day.",
  "created_utc": 1628080883,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know most of you maybe be aware of this already but sadly i have some friends who believe their $100-200 dollar investments will make them future millionaires when realistically that probably won&#39;t happen. Were all going to make money but unfortunately you have to have money already to make those huge bags. Even if ethereum were to hit 5k or 10k by the end of this year, if you only invested $100-200 you won&#39;t be seeing a lambo or even a new car. It makes me sad but its the kinda truth when people say you have to have money to make money. Regardless I&#39;m still going to keep investing and whatver i make im still going to make be happy about.</p>\n</div><!-- SC_ON -->",
  "score": 416,
  "permalink": "/r/CryptoCurrency/comments/oxerzi/just_because_were_investing_doesnt_mean_were/",
  "subreddit": "CryptoCurrency",
  "id": "oxerzi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know most of you maybe be aware of this already but sadly i have some friends\nwho believe their $100-200 dollar investments will make them future millionaires\nwhen realistically that probably won't happen. Were all going to make money but\nunfortunately you have to have money already to make those…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ほとんどの方がご存知かと思いますが、悲しいことに私の友人の中には、100～200ドルの投資で成功すると信じている人がいます。\n100〜200ドルの投資で将来億万長者になれると信じている人がいます。\nしかし、現実的にはそうはならないでしょう。みんなお金を稼ごうとしていますが\n残念ながら、お金を稼ぐにはすでにお金を持っていなければなりません。",
      "title": "投資をしているからといって、いつか億万長者になれるとは限りません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道你们中的大多数人可能已经意识到了这一点，但不幸的是，我有一些朋友\n他们相信他们100-200美元的投资会使他们成为未来的百万富翁\n而实际上，这可能不会发生。我们都会挣钱，但\n不幸的是，你必须已经有了钱才能赚到这些钱......",
      "title": "投资并不意味着我们有一天会成为百万富翁。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道你們中的大多數人可能已經意識到了這一點，但不幸的是，我有一些朋友\n他們相信他們100-200美元的投資會使他們成爲未來的百萬富翁\n而實際上，這可能不會發生。我們都會掙錢，但\n不幸的是，你必須已經有了錢才能賺到這些錢......",
      "title": "投資並不意味着我們有一天會成爲百萬富翁。"
    }
  ]
}