{
  "author": "Brinothedino",
  "the_new_excerpt": "I am fairly new to crypto, early January of this year, and my original portfolio\nhad a big chunk of BTC. But after watching basically everything else in my\nportfolio outperform it, I have slowly migrated out of Bitcoin for now, at least\nduring this bull run. The odd thing is, I can't see any time…",
  "original_created_utc": 1618153861,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は今年の1月初めに暗号化を始めたばかりですが、私の最初のポートフォリオには\nはBTCの大部分を占めていました。しかし、私のポートフォリオの他のすべてのものがBTCを上回っているのを見た後\nポートフォリオの他のすべてのものが上回っているのを見て、少なくともこの強気の動きの間は、今のところビットコインから徐々に移行しています。\n少なくともこの強気の動きの間は。奇妙なことに、私には時間が見えません...",
      "title": "ビットコインを持っていない人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对加密技术相当陌生，今年1月初，我最初的投资组合是\n了一大块BTC。但在看了我的基本所有其他\n投资组合的表现优于它，我目前已经慢慢迁移出比特币，至少是\n在这个牛市期间 奇怪的是，我看不到任何时间... ...",
      "title": "还有人不持有任何比特币吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對加密技術相當陌生，今年1月初，我最初的投資組合是\n了一大塊BTC。但在看了我的基本所有其他\n投資組合的表現優於它，我目前已經慢慢遷移出比特幣，至少是\n在這個牛市期間 奇怪的是，我看不到任何時間... ...",
      "title": "還有人不持有任何比特幣嗎？"
    }
  ],
  "title": "Is anyone else not holding ANY Bitcoin?",
  "created_utc": 1618177296,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am fairly new to crypto, early January of this year, and my original portfolio had a big chunk of BTC. But after watching basically everything else in my portfolio outperform it, I have slowly migrated out of Bitcoin for now, at least during this bull run. The odd thing is, I can&#39;t see any time within the next five years that Bitcoin would be a less safe and higher reward investment vs ETH. I&#39;m curious if a bunch of you are doing the same, or if I&#39;m out to lunch here and taking a big risk that I shouldn&#39;t be.</p>\n</div><!-- SC_ON -->",
  "score": 352,
  "permalink": "/r/CryptoCurrency/comments/mosfd6/is_anyone_else_not_holding_any_bitcoin/",
  "subreddit": "CryptoCurrency",
  "id": "mosfd6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566614256
}