{
  "author": "yodisc",
  "the_new_excerpt": "As many know the Bloomberg Terminal is one of the best tools for investors to\nutilize. Unfortunately, for retail investors the terminal is locked behind one\nof the most extreme paywalls and is out of reach for many. Costing roughly\n$24,000 per year, I'm sure you can see why...\n\nIn this post I will…",
  "original_created_utc": 1616188525,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "很多人都知道，彭博终端是投资者最好的工具之一，它可以帮助投资者\n利用。遗憾的是，对于散户来说，终端机被锁在了一个叫 \"小黑屋 \"的地方。\n的最极端的付费墙，对很多人来说是遥不可及的。成本大约为\n年薪24000元，我相信你能明白为什么...\n\n在这篇文章中，我将...",
      "title": "BLOOMBERG TERMINAL GME DATA - As of EOD 03-19"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多人都知道，彭博終端是投資者最好的工具之一，它可以幫助投資者\n利用。遺憾的是，對於散戶來說，終端機被鎖在了一個叫 \"小黑屋 \"的地方。\n的最極端的付費牆，對很多人來說是遙不可及的。成本大約爲\n年薪24000元，我相信你能明白爲什麼...\n\n在這篇文章中，我將...",
      "title": "BLOOMBERG TERMINAL GME DATA - As of EOD 03-19"
    }
  ],
  "title": "BLOOMBERG TERMINAL GME DATA - As of EOD 03-19",
  "created_utc": 1616218136,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As many know the Bloomberg Terminal is one of the best tools for investors to utilize. Unfortunately, for retail investors the terminal is locked behind one of the most extreme paywalls and is out of reach for many. Costing roughly $24,000 per year, I&#39;m sure you can see why...</p>\n\n<p>In this post I will not be talking much about what the numbers means, or doing any sort of analysis, this is strictly informative. I will say, if anyone wishes that I pull up some other data that I have not included, let me know and I will do my best to accommodate, but I cannot make promises that I&#39;ll get around to it. If anyone also has any questions, feel free to ask away and once again I will do my best.</p>\n\n<p>Now, let us begin. I&#39;ll start with the least exciting and work our way up to the stuff I know people want to see.</p>\n\n<h1>Basic Candle Chart w/ SMAVG (50/100/200) 2021-03-19 @ 14:23 EST</h1>\n\n<p><a href=\"https://preview.redd.it/9gnjqdgag2o61.png?width=1923&amp;format=png&amp;auto=webp&amp;s=804815380400049ee52e42d782a7d489efed7d01\">Nothing too exciting but for those wondering what this would look like, here you go.</a></p>\n\n<h1>Twitter Discussion and overall sentiment for 5 periods</h1>\n\n<p><a href=\"https://preview.redd.it/eekhbu8cg2o61.png?width=1920&amp;format=png&amp;auto=webp&amp;s=32e9d8dc71e745d184fb2a6860147c4d6dad11e9\">I will point out the big uptick in discussion, more than was seen over the 3 days prior. </a></p>\n\n<h1>Institutional Ownership Data (As of 12/31/20)</h1>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/3v3izomkg2o61.png?width=1920&amp;format=png&amp;auto=webp&amp;s=8e2b9355311260a0c344f0a1735bd080f252b42e\">Unfortunately, this data is not updated as frequently as institutions are not required to disclose this information on a regular basis.</a></p>\n\n<h1>Institutional Option Holders (12/31/20)</h1>\n\n<p>Once again, not update as often as many would like. But it adds perspective.</p>\n\n<p><a href=\"https://preview.redd.it/kxue25oig2o61.png?width=1920&amp;format=png&amp;auto=webp&amp;s=7fe48158350849d1300929eb00eb5e00b86264db\">The second largest holder of ANY form of derivative (call or put) is MELVIN CAPITAL who is dealing exclusively in PUTS. Approx. 8&#37; of all options. 60,000 contracts. Also notice Citadel.</a></p>\n\n<h1>Finally, Short Interest</h1>\n\n<p><a href=\"https://preview.redd.it/ydg5mkrng2o61.png?width=1920&amp;format=png&amp;auto=webp&amp;s=59b2ba0e7c16aeb6471bf65e426093238ce57e10\">https://preview.redd.it/ydg5mkrng2o61.png?width=1920&amp;format=png&amp;auto=webp&amp;s=59b2ba0e7c16aeb6471bf65e426093238ce57e10</a></p>\n\n<h1>Closing Remarks</h1>\n\n<p>I once again will not be doing any analysis on these graphs and numbers, I&#39;m sure someone else will be happy to do that. This is strictly informative and for the sake of this post I am neither bearish nor bullish on GME. I hope some of you find this post useful and informative and I encourage anyone to use this data coupled with their own research and determinations to work on a DD. Once again, I will try my best to answer questions or collect more information but depending that may prove challenging based on the number of requests.</p>\n\n<p>With that said I hope everyone has a fantastic weekend, if you&#39;ve been staring at a screen all week, there is no better time to take a break. Mental health is important through all of this craziness, drink water, get some fresh air and sunlight, and just decompress. Cheers.</p>\n</div><!-- SC_ON -->",
  "score": 2414,
  "permalink": "/r/wallstreetbets/comments/m8racu/bloomberg_terminal_gme_data_as_of_eod_0319/",
  "subreddit": "wallstreetbets",
  "id": "m8racu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752826409
}