{
  "author": "Chthroop",
  "the_new_excerpt": "Hi, new to the board but long time investor and formerly worked on Wall Street\n\nReviewing the potential for the upcoming Roblox ipo. Here my thoughts on Pro/con\non Roblox\n\nPro: 1. Cool business model with an entire ecosystem that drives content\ncreation through simplified game development allowing…",
  "original_created_utc": 1613332073,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你好，新加入董事会，但长期投资人，曾在华尔街工作。\n\n回顾即将到来的Roblox ipo的潜力。以下是我对Pro/con的看法\n关于Roblox\n\n优点：1.酷炫的商业模式，有整个生态系统来驱动内容。\n通过简化游戏开发，让创作...",
      "title": "Roblox的优点/缺点--预计3月上市。上一轮估值超过290亿美元，2020年增长7倍。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，新加入董事會，但長期投資人，曾在華爾街工作。\n\n回顧即將到來的Roblox ipo的潛力。以下是我對Pro/con的看法\n關於Roblox\n\n優點：1.酷炫的商業模式，有整個生態系統來驅動內容。\n通過簡化遊戲開發，讓創作...",
      "title": "Roblox的優點/缺點--預計3月上市。上一輪估值超過290億美元，2020年增長7倍。"
    }
  ],
  "title": "Pro/Con of Roblox - expecting IPO in March. Last round valuation of over 29$ billion with a 7x growth in 2020",
  "created_utc": 1613375001,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi, new to the board but long time investor and formerly worked on Wall Street</p>\n\n<p>Reviewing the potential for the upcoming Roblox ipo.  Here my thoughts on Pro/con on Roblox</p>\n\n<p>Pro:\n1. Cool business model with an entire ecosystem that drives content creation through simplified game development allowing “citizen developers” to create content which Roblox gets 30% of any revenue.  Ultra scalable content development model</p>\n\n<ol>\n<li><p>Fits into overall trend of video game nation which is clearly where the world in general is going</p></li>\n<li><p>Hasn’t even tapped the China/Asia market in any material way</p></li>\n</ol>\n\n<p>Cons:</p>\n\n<ol>\n<li><p>Not demonstrated to be able to keep kids outside the 4-10 age demographic. I have kids who played roblox and the games were really mini games. They then moved on to minecraft, fortnite, etc.   </p></li>\n<li><p>While the cool part is the simple way to develop games, it also inherently limits the quality and depth of games vs true coding efforts and engines like Epic Unreal engine</p></li>\n<li><p>Valuation is sky high. 7x valuation from 4bn to 29bn in one year? And this is the private round so assume people want a public valuation of 40bn+??? Compared to existing firms like Rockstar (23bn) or Electronic Arts (42bn) that very rich.  </p></li>\n</ol>\n\n<p>Net net: i like the overall name but as my personal investment approach is growth at a reasonable price, i will hold off but watch the name closely to see if post ipo there is a dip to a valuation i would find acceptable in the 20-30bn range</p>\n\n<p>Thoughts?  What key elements of the story am i missing??</p>\n</div><!-- SC_ON -->",
  "score": 43,
  "permalink": "/r/stocks/comments/ljvrhr/procon_of_roblox_expecting_ipo_in_march_last/",
  "subreddit": "stocks",
  "id": "ljvrhr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728623068
}