{
  "author": "lymeguy",
  "original_created_utc": 1634008472,
  "title": "what are you buying now that altcoins are dipping a bit?",
  "created_utc": 1634049085,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There seems to be a bit of a mini crypto dip going on. It is seemingly normal but ETH went down slightly and Cardano has pulled away from the 3 dollar mark. Algorand is also down a little bit and a few others.  </p>\n\n<p>Anyway I&#39;m thinking of throwing down 100-200 dollars on some extra coins for now before the market starts up again tomorrow. </p>\n\n<p>I&#39;m currently mostly holding algorand, cardano, amptoken, etherium, and some cosmos...</p>\n\n<p>What do you think would be some good things to buy into right now for the hell of it to hold long term?</p>\n\n<p>Thanks!</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/q6csqn/what_are_you_buying_now_that_altcoins_are_dipping/",
  "subreddit": "CryptoCurrency",
  "id": "q6csqn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There seems to be a bit of a mini crypto dip going on. It is seemingly normal\nbut ETH went down slightly and Cardano has pulled away from the 3 dollar mark.\nAlgorand is also down a little bit and a few others.\n\nAnyway I'm thinking of throwing down 100-200 dollars on some extra coins for now\nbefore…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちょっとしたミニ・クリプト・ディップが起こっているようです。一見普通のことのようですが\nが、ETHは少し下がり、カルダノは3ドルの大台から離れてしまった。\nAlgorandも少し下がっていますし、他にもいくつかあります。\n\nいずれにしても、私は今のところ、いくつかの余分なコインに100～200ドルを投げ出そうと考えています。\n前に...",
      "title": "アルトコインが少し下がっている今、何を買っていますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "似乎有一点小型的加密货币下跌正在发生。这似乎是正常的\n但ETH小幅下跌，Cardano已经从3美元大关拉开。\nAlgorand也下降了一点，还有其他一些。\n\n无论如何，我想暂时在一些额外的硬币上扔下100-200美元\n之前...",
      "title": "现在altcoins有点下滑，你在买什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "似乎有一點小型的加密貨幣下跌正在發生。這似乎是正常的\n但ETH小幅下跌，Cardano已經從3美元大關拉開。\nAlgorand也下降了一點，還有其他一些。\n\n無論如何，我想暫時在一些額外的硬幣上扔下100-200美元\n之前...",
      "title": "現在altcoins有點下滑，你在買什麼？"
    }
  ]
}