{
  "author": "smokingandcrying",
  "original_created_utc": 1640406386,
  "title": "YSK: The 'i got hacked' post are probably scammers themselves hoping for donations and you should not send them any money.",
  "created_utc": 1640414189,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It seems everyday, there is a new post where someone&amp;#39;s metamask gets hacked for 6 figures of ETH. They post the victim and scammer addresses and go on about reaching out to law enforcement blah blah. If you have ever seen a real scammers account, there are usually tons of transactions and money being moved quick to avoid being black listed by exchanges.  The past few post ive seen, the &amp;#39;hackers&amp;#39; account has only 1 transaction. Seems strange doesn&amp;#39;t it?&lt;br/&gt;\nLet&amp;#39;s also take OP&amp;#39;s Reddit age into account .   &lt;/p&gt;\n\n&lt;p&gt;Now, not all post are scams but unfortunately, it only takes a few bad apples to spoil the bunch.  With it being the holidays, people probably feel a bit more generous and want to help out someone in need.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 201,
  "permalink": "/r/CryptoCurrency/comments/ro2blx/ysk_the_i_got_hacked_post_are_probably_scammers/",
  "subreddit": "CryptoCurrency",
  "id": "ro2blx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It seems everyday, there is a new post where someone's metamask gets hacked for\n6 figures of ETH. They post the victim and scammer addresses and go on about\nreaching out to law enforcement blah blah. If you have ever seen a real scammers\naccount, there are usually tons of transactions and money…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "毎日、誰かのメタマスクがハッキングされ、その結果\n6桁のETH 被害者と詐欺師のアドレスが掲載され、次のようなことが書かれています。\n法執行機関に連絡するんだ。本物の詐欺師を見たことがあるのなら\nのアカウントには、通常、大量の取引と金がある...。",
      "title": "YSK: 「ハッキングされた」という投稿は、おそらく詐欺師自身が寄付を望んでいるのでしょうから、彼らにお金を送ってはいけません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "似乎每天都有一个新的帖子，说某人的元面膜被黑掉了，获得了\n6位数的ETH。他们公布了受害者和诈骗者的地址，并继续说到\n联系执法部门等等。如果你见过一个真正的骗子\n帐户，通常有大量的交易和资金...",
      "title": "YSK：\"我被黑了 \"的帖子可能是骗子自己希望得到捐款，你不应该给他们送钱。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "似乎每天都有一個新的帖子，說某人的元面膜被黑掉了，獲得了\n6位數的ETH。他們公佈了受害者和詐騙者的地址，並繼續說到\n聯繫執法部門等等。如果你見過一個真正的騙子\n帳戶，通常有大量的交易和資金...",
      "title": "YSK：\"我被黑了 \"的帖子可能是騙子自己希望得到捐款，你不應該給他們送錢。"
    }
  ]
}