{
  "author": "ShotBot",
  "original_created_utc": 1644957304,
  "title": "Canada's martial law disaster is the best thing that has happened to this community in years!",
  "created_utc": 1644987184,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Bitcoin is uncensorable, non confiscatable hard money without a central bank. We are finally focused on the non confiscatable aspects of Bitcoin and I love it!&lt;/p&gt;\n\n&lt;p&gt;Look, I think the Bitcoin narrative as an inflation hedge and as an institutional asset is great, especially during the massive monetary expansion that happened in 2020. But the number go up narrative is FUCKING BORING! Bitcoin is NOT a tame lion, kissing the ass of all these big institutions with the hopes of buying our bags in not in line with the Bitcoin brand. Bitcoin is a counter culture movement and the last 2 years we&amp;#39;ve turned into a pro-establishment movement. Kissing the ass of all these Black Rock ESG cucks and trying to onboard all the corporates makes me puke. &lt;/p&gt;\n\n&lt;p&gt;The Canadian Truckers is making Bitcoin fun for me again, and I hope we continue promoting the other aspects of Bitcoin other than just number go up.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/Bitcoin/comments/stcnal/canadas_martial_law_disaster_is_the_best_thing/",
  "subreddit": "Bitcoin",
  "id": "stcnal",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Bitcoin is uncensorable, non confiscatable hard money without a central bank. We\nare finally focused on the non confiscatable aspects of Bitcoin and I love it!\n\nLook, I think the Bitcoin narrative as an inflation hedge and as an\ninstitutional asset is great, especially during the massive monetary…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインは、中央銀行を介さない、検閲不能、没収不能のハードマネーです。私たちは\nは、ついにビットコインの没収されない側面に焦点を当て、私はそれが大好きです。\n\nビットコインの物語は、インフレヘッジとして、そして\n機関投資家の資産として、特に大規模な金融危機の最中には、素晴らしいことです。",
      "title": "カナダの戒厳令による災害は、この地域にとってここ数年で最高の出来事だ!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比特币是不可审查的、不可没收的硬通货，没有中央银行。我们\n我们终于关注到了比特币不可没收的方面，我很喜欢!\n\n听着，我认为比特币作为一种通货膨胀的对冲和作为一种机构资产的说法是很好的。\n机构资产是很好的，特别是在大规模的货币政策下。",
      "title": "加拿大的戒严灾难是多年来发生在这个社区的最好的事情!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣是不可審查的、不可沒收的硬通貨，沒有中央銀行。我們\n我們終於關注到了比特幣不可沒收的方面，我很喜歡!\n\n聽着，我認爲比特幣作爲一種通貨膨脹的對沖和作爲一種機構資產的說法是很好的。\n機構資產是很好的，特別是在大規模的貨幣政策下。",
      "title": "加拿大的戒嚴災難是多年來發生在這個社區的最好的事情!"
    }
  ]
}