{
  "author": "calvintheidiot",
  "the_new_excerpt": "There's a lot of talk about Do Your Own Research (DYOR) ... but people rarely\ntalk about HOW to do your own research. Here's a quick rundown of some things to\nstart with as you start diving into the world of cryptocurrencies.\n\n\nWHERE TO START?\n\nBefore diving into the specific coins, it's a good idea…",
  "original_created_utc": 1613511900,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "有很多关于做自己的研究（DYOR）的讨论......但人们很少有\n谈谈如何做自己的研究。以下是一些快速的简要介绍。\n当你开始潜入加密货币的世界时，从哪里开始？\n\n\n从哪里开始？\n\n在深入了解具体的币种之前，最好是... ...",
      "title": "每个人都在谈论DYOR - 如何DYOR？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有很多關於做自己的研究（DYOR）的討論......但人們很少有\n談談如何做自己的研究。以下是一些快速的簡要介紹。\n當你開始潛入加密貨幣的世界時，從哪裏開始？\n\n\n從哪裏開始？\n\n在深入瞭解具體的幣種之前，最好是... ...",
      "title": "每個人都在談論DYOR - 如何DYOR？"
    }
  ],
  "title": "Everyone Talks About DYOR - How To DYOR",
  "created_utc": 1613550634,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There&#39;s a lot of talk about Do Your Own Research (DYOR) ... but people rarely talk about HOW to do your own research. Here&#39;s a quick rundown of some things to start with as you start diving into the world of cryptocurrencies.</p>\n\n<h1>Where to Start?</h1>\n\n<p>Before diving into the specific coins, it&#39;s a good idea to get a high-level understanding of the technology that cryptocurrency is built on.</p>\n\n<p>The following is a short video on blockchain technology. Having a basic understanding of the <strong>blockchain</strong> will be a helpful foundation as you get started.</p>\n\n<p><strong>Intro to Blockchain:</strong> <a href=\"https://www.youtube.com/watch?v=SSo_EIwHSd4\">https://www.youtube.com/watch?v=SSo_EIwHSd4</a></p>\n\n<p>Also, get a general idea of what a cryptocurrency even is. You can find a lot of helpful introductions to cryptocurrency through google, or watch a short Youtube video explaining it.</p>\n\n<p><strong>Intro to Cryptocurrency:</strong> <a href=\"https://www.youtube.com/watch?v=8NgVGnX4KOw\">https://www.youtube.com/watch?v=8NgVGnX4KOw</a></p>\n\n<h1>What is Bitcoin?</h1>\n\n<p>Furthermore, it&#39;s a good idea to have a basic understanding of what Bitcoin is, what it was created for, and how it works. Everyone involved in this space would benefit from taking a quick look at the Bitcoin Whitepaper.</p>\n\n<p><strong>Bitcoin Whitepaper:</strong> <a href=\"https://bitcoin.org/bitcoin.pdf\">https://bitcoin.org/bitcoin.pdf</a></p>\n\n<p><strong>What is Bitcoin?</strong> <a href=\"https://www.youtube.com/watch?v=bBC-nXj3Ng4\">https://www.youtube.com/watch?v=bBC-nXj3Ng4</a></p>\n\n<h1>What is Ethereum?</h1>\n\n<p>Bitcoin and Ethereum have long been the two biggest players in this space, and another good place to start doing a bit of research is understanding the basics of Ethereum. Many of the Top 100 coins are built on top of Ethereum, called ERC-20 tokens.</p>\n\n<p><strong>Intro to Ethereum:</strong> <a href=\"https://www.upfolio.com/ultimate-ethereum-guide\">https://www.upfolio.com/ultimate-ethereum-guide</a></p>\n\n<h1>Alt-Coins:</h1>\n\n<p>Now that you&#39;ve gotten your feet wet with the two most popular cryptos, you may want to explore the giant, often scary world of &quot;Alt Coins&quot;. With so many coins, where should you start looking? That&#39;s for you to decide. You can take a look at the top coins from a variety of sites:</p>\n\n<p><a href=\"https://www.coingecko.com/en\">https://www.coingecko.com</a></p>\n\n<p><a href=\"https://coinmarketcap.com/\">https://coinmarketcap.com/</a></p>\n\n<p>There is a lot of information you can gather just at a glance - you can look at the market cap, the price history, the liquidity, etc. Beyond these basic metrics, it&#39;s helpful to drill into the specifics of coins you&#39;re interested in. Take a look at their website, take a look at their social media (gauge their activity and involvement, number of followers, etc), and check out their community (subreddit, telegram, twitter). Try to get a sense of the credibility of the project, the founders, and any working product is a big plus.</p>\n\n<p>There&#39;s a lot to research before making an informed decision, but this is a good place to start.</p>\n\n<h1>Exchanges:</h1>\n\n<p>Now that you&#39;ve done your research, you&#39;re probably going to want to make a purchase. This is done through exchanges (duh). Now, there&#39;s a lot of talk about the best and worst exchanges - you should do your research here as well. You can search this subreddit for names of various exchanges, and get a sense of people&#39;s experiences with them. You can also get a good breakdown of the pros and cons from a variety of sources: Eg.</p>\n\n<p><strong>Exchanges Pros and Cons:</strong> <a href=\"https://www.investopedia.com/best-crypto-exchanges-5071855\">https://www.investopedia.com/best-crypto-exchanges-5071855</a></p>\n\n<p>Make sure to pick a reputable exchange, lest you get Mt. Gox&#39;d: <a href=\"https://en.wikipedia.org/wiki/Mt._Gox\">https://en.wikipedia.org/wiki/Mt._Gox</a></p>\n\n<p>CoinMarketCap also has some nice statistics on a ton of exchanges:</p>\n\n<p><a href=\"https://coinmarketcap.com/rankings/exchanges/\">https://coinmarketcap.com/rankings/exchanges/</a></p>\n\n<h1>Wallets:</h1>\n\n<p>Now that you&#39;ve made a purchase, you&#39;ll often hear phrases like &quot;Not your keys, not your coins&quot;. People recommend storing coins in your own wallet, so that you&#39;re not at the mercy of the exchanges. You become solely responsible for your coins, so take this step very seriously.</p>\n\n<p>Look into what kind of wallet makes sense for you (hardware vs software wallet). You can see some pros and cons with the following site, or do your own research elsewhere.</p>\n\n<p><strong>Wallet Pros and Cons:</strong> <a href=\"https://www.investopedia.com/best-bitcoin-wallets-5070283\">https://www.investopedia.com/best-bitcoin-wallets-5070283</a></p>\n\n<p>Make an informed decision here, and keep your coins safe.</p>\n\n<h1>Involvement:</h1>\n\n<p>One of the best ways to do your own research, is just to be involved in the scene - engage in the communities (including reddit!) and be genuinely interested. If you&#39;re passionate about not only making big gains, but also the technology, the research will naturally come with it. You&#39;ll want to understand about what&#39;s going on, and in the process you&#39;ll become a (hopefully) more informed investor.</p>\n\n<h1>TLDR:</h1>\n\n<p>There&#39;s a lot of research to do - thankfully we&#39;re in the golden age of information. Watch videos on Youtube. Google anything you don&#39;t know. Ask questions here. Don&#39;t be lazy. There&#39;s a lot to learn, but a ton of resources as well.</p>\n\n<p>IMPORTANT: Don&#39;t always trust what you read or watch - make sure to do your due-diligence, and double &amp; triple check all your sources!</p>\n\n<p>Let us know if you have any other good tips on becoming an informed and savvy investor.</p>\n</div><!-- SC_ON -->",
  "score": 227,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/avEkd0Bu4fQ927dBrDi9nLRgTiFaoMzIslB-nLFd3VI.jpg?auto=webp&s=47f05f5a3cee828be702aef77585137caf540543",
          "width": 480,
          "height": 360
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/avEkd0Bu4fQ927dBrDi9nLRgTiFaoMzIslB-nLFd3VI.jpg?width=108&crop=smart&auto=webp&s=070691432929b5f6af4a1c025f86e532625e4c98",
            "width": 108,
            "height": 81
          },
          {
            "url": "https://external-preview.redd.it/avEkd0Bu4fQ927dBrDi9nLRgTiFaoMzIslB-nLFd3VI.jpg?width=216&crop=smart&auto=webp&s=050d44c5c2edc07bcaf961982cd47fa0c778c927",
            "width": 216,
            "height": 162
          },
          {
            "url": "https://external-preview.redd.it/avEkd0Bu4fQ927dBrDi9nLRgTiFaoMzIslB-nLFd3VI.jpg?width=320&crop=smart&auto=webp&s=e574e69c9ded99febbd459a8a6a3d06cb97260f7",
            "width": 320,
            "height": 240
          }
        ],
        "variants": {},
        "id": "YNPo4VVikRlFi5gBITPi811yz64JS-xCNiD1qnsSujU"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/llehit/everyone_talks_about_dyor_how_to_dyor/",
  "subreddit": "CryptoCurrency",
  "id": "llehit",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728619142
}