{
  "author": "Odlavso",
  "original_created_utc": 1651359732,
  "title": "Everything is down! Sell before the end of crypto!",
  "created_utc": 1651370399,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;so after checking the Crypto Fear and Greed Index which analyzes  the emotions and sentiments from different sources and crunches them into one simple number, it seems that this is the end of crypto.&lt;/p&gt;\n\n&lt;p&gt;Everybody saying that now is the time to buy are just a bunch of bag holders who want you to invest so they can sell as soon as breaking even. Even genius investor Warren Buffett has stated that he wouldn&amp;#39;t buy bitcoin for $25 dollars, who are we to disagree with 150 years of experience in the crypto space?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/e4hrhnjzxqw81.jpg?width=1284&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=05dacabdee2543b6080b3b0c9955db5236ddf551\"&gt;https://preview.redd.it/e4hrhnjzxqw81.jpg?width=1284&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=05dacabdee2543b6080b3b0c9955db5236ddf551&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;as you can see above the crypto Fear and Greed index has hit a new low of (-20) Fire sale&lt;/p&gt;\n\n&lt;p&gt;what does this mean?&lt;/p&gt;\n\n&lt;p&gt;I heard reports that crypto investors are jumping out of their cabanas out in the Caribbean, sure they are landing in the ocean but that besides the point. It really does appear that after a decade Bitcoin has finally died.&lt;/p&gt;\n\n&lt;p&gt;this was a great journey friends but we should probably sell any remaining crypto we have and put that money into a savings account with a high interest rate of 0.001%, we should be able to retire with it after another 50 years.&lt;/p&gt;\n\n&lt;p&gt;good luck to you all!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 387,
  "permalink": "/r/CryptoCurrency/comments/ufmayr/everything_is_down_sell_before_the_end_of_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "ufmayr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "so after checking the Crypto Fear and Greed Index which analyzes the emotions\nand sentiments from different sources and crunches them into one simple number,\nit seems that this is the end of crypto.\n\nEverybody saying that now is the time to buy are just a bunch of bag holders who\nwant you to invest…"
}