{
  "author": "Night_Runner",
  "the_new_excerpt": "The hardest part of investing is controlling your emotions. If you don't know\nhow to do that, then you might sell your stocks too early because you got scared\noff, or hesitate to buy - and then miss a huge run-up. That's especially\nimportant when your stocks go down in value and you start seeing a…",
  "original_created_utc": 1624085029,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "投資で一番難しいのは、感情をコントロールすることです。その方法を知らないと\n感情をコントロールする方法を知らないと、怖くなって早々に株を売ってしまったり、買うのをためらったりして\n買うのを躊躇したために早々に株を売ってしまい、その後の大きな上昇を逃してしまうかもしれません。これは、特に\n感情をコントロールすることは、株の価値が下がってきたときには特に重要です。",
      "title": "株が値下がりしても冷静になれる、3つの素晴らしい名言"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "投资中最难的部分是控制你的情绪。如果你不知道\n如何做到这一点，那么你可能会因为被吓跑而过早地卖掉你的股票，或者在买入时犹豫不决--然后错过了巨大的上涨。\n或在购买时犹豫不决--然后错过一个巨大的上涨。这一点尤其\n当你的股票价值下降，你开始看到一个新的市场时，这一点尤其重要。",
      "title": "当你的股票价值下降时，三条令人敬畏的名言将帮助你保持冷静"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "投資中最難的部分是控制你的情緒。如果你不知道\n如何做到這一點，那麼你可能會因爲被嚇跑而過早地賣掉你的股票，或者在買入時猶豫不決--然後錯過了巨大的上漲。\n或在購買時猶豫不決--然後錯過一個巨大的上漲。這一點尤其\n當你的股票價值下降，你開始看到一個新的市場時，這一點尤其重要。",
      "title": "當你的股票價值下降時，三條令人敬畏的名言將幫助你保持冷靜"
    }
  ],
  "title": "Three awesome quotes that will help you keep your cool when your stocks drop in value",
  "created_utc": 1624099879,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The hardest part of investing is controlling your emotions. If you don&#39;t know how to do that, then you might sell your stocks too early because you got scared off, or hesitate to buy - and then miss a huge run-up. That&#39;s especially important when your stocks go down in value and you start seeing a ton of red in your account..</p>\n\n<p>Here are three quotes that really helped me get control of my mental game. Each of them covers a slightly different aspect. Read them, understand them, combine them in your mind, and your profits should get a lot better. :)</p>\n\n<p><strong>First, this long but awesome quote from Warren Buffett, all the way back in his 1987 letter to shareholders:</strong></p>\n\n<p>&quot;Ben Graham, my friend and teacher, long ago described the mental attitude toward market fluctuations that I believe to be most conducive to investment success. He said that you should imagine market quotations as coming from a remarkably accommodating fellow named Mr. Market who is your partner in a private business. Without fail, Mr. Market appears daily and names a price at which he will either buy your interest or sell you his.</p>\n\n<p>Even though the business that the two of you own may have economic characteristics that are stable, Mr. Market’s quotations will be anything but. For, sad to say, the poor fellow has incurable emotional problems. At times he feels euphoric and can see only the favorable factors affecting the business. When in that mood, he names a very high buy-sell price because he fears that you will snap up his interest and rob him of imminent gains. At other times he is depressed and can see nothing but trouble ahead for both the business and the world. On these occasions he will name a very low price, since he is terrified that you will unload your interest on him.</p>\n\n<p>Mr. Market has another endearing characteristic: He doesn’t mind being ignored. If his quotation is uninteresting to you today, he will be back with a new one tomorrow. Transactions are strictly at your option. Under these conditions, the more manic-depressive his behavior, the better for you. But, like Cinderella at the ball, you must heed one warning or everything will turn into pumpkins and mice: Mr. Market is there to serve you, not to guide you. It is his pocketbook, not his wisdom, that you will find useful. If he shows up some day in a particularly foolish mood, you are free to ignore him or to take advantage of him, but it will be disastrous if you fall under his influence.</p>\n\n<p>Indeed, if you aren’t certain that you understand and can value your business far better than Mr. Market, you don’t belong in the game. As they say in poker, “If you’ve been in the game 30 minutes and you don’t know who the patsy is, you’re the patsy. An investor will succeed by coupling good business judgment with an ability to insulate his thoughts and behavior from the super-contagious emotions that swirl about the marketplace. In my own efforts to stay insulated, I have found it highly useful to keep Ben’s Mr. Market concept firmly in mind.”</p>\n\n<p><strong>Second, the famous Litany Against Fear from Dune, one of the best sci-fi books of all time:</strong></p>\n\n<p>&quot;I must not fear.</p>\n\n<p>Fear is the mind-killer.</p>\n\n<p>Fear is the little-death that brings total obliteration.</p>\n\n<p>I will face my fear.</p>\n\n<p>I will permit it to pass over me and through me.</p>\n\n<p>And when it has gone past, I will turn the inner eye to see its path.</p>\n\n<p>Where the fear has gone there will be nothing. Only I will remain.&quot;</p>\n\n<p><strong>Last but not least, my personal favourite - by Covetous Shen from Diablo-3. :)</strong></p>\n\n<p>&quot;Hope... Do not look down, my friend. Even in the darkest of times, there is always hope. Hope for a better day, hope for a new dawn. Or just hope for a good breakfast. You start small, then see what you can get.&quot;</p>\n\n<p>Good luck - I hope this helped you. If you do end up making some extra cash off this advice, no need to thank me - just give some cash to your local charity. :) Or, if you&#39;re in Seattle or Toronto, let&#39;s hang out! The cider is on you hahaha</p>\n</div><!-- SC_ON -->",
  "score": 42,
  "permalink": "/r/investing/comments/o3a1ls/three_awesome_quotes_that_will_help_you_keep_your/",
  "subreddit": "investing",
  "id": "o3a1ls",
  "is_self": true,
  "media": null,
  "is_video": false
}