{
  "author": "MuffinMan12347",
  "original_created_utc": 1635760118,
  "title": "Squid Game from $2856 to $0.0008 in 10 minutes",
  "created_utc": 1635766332,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>That has to be the biggest and quickest rugpull in history right? </p>\n\n<p>We all knew squid game was a scam as well as a rugpull and even more fucked that people couldn’t take profits at all at any point and whatever the deal with winning games to get the tokens for gas fees was. The whole thing was fucked.</p>\n\n<p>But still please anyone correct me if I’m wrong but I don’t think anything else I’ve ever seen has dropped that much if it’s percentage in such a short time?</p>\n\n<p>I’m sorry for any of you who’ve bought that token hoping to make a quick buck. I hope it was a relatively cheap and valuable lesson about crypto and these random tokens that pop up out of no where.</p>\n\n<p>Edit: looked at the charts a little closer and it actually happened in 5 minutes.</p>\n</div><!-- SC_ON -->",
  "score": 1318,
  "permalink": "/r/CryptoCurrency/comments/qkai4d/squid_game_from_2856_to_00008_in_10_minutes/",
  "subreddit": "CryptoCurrency",
  "id": "qkai4d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "That has to be the biggest and quickest rugpull in history right?\n\nWe all knew squid game was a scam as well as a rugpull and even more fucked that\npeople couldn’t take profits at all at any point and whatever the deal with\nwinning games to get the tokens for gas fees was. The whole thing was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは史上最大かつ最速のラグプルに違いありませんね。\n\nイカゲームは詐欺であり、ラッグプルであることは誰もが知っていたし、さらにはクソだった\n人々は利益を得ることができませんでした。\nゲームに勝ってガソリン代のためのトークンを手に入れたことも。全体的には...",
      "title": "10分で2856ドルから0.0008ドルになったイカゲーム"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这一定是历史上最大和最快的拉锯战，对吗？\n\n我们都知道鱿鱼游戏是一个骗局，也是一个拉锯战，更糟糕的是\n人们在任何时候都不能获利，不管是什么交易\n赢得游戏以获得汽油费的代币是什么。整个事情是...",
      "title": "鱿鱼游戏在10分钟内从2856美元降至0.0008美元"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這一定是歷史上最大和最快的拉鋸戰，對嗎？\n\n我們都知道魷魚遊戲是一個騙局，也是一個拉鋸戰，更糟糕的是\n人們在任何時候都不能獲利，不管是什麼交易\n贏得遊戲以獲得汽油費的代幣是什麼。整個事情是...",
      "title": "魷魚遊戲在10分鐘內從2856美元降至0.0008美元"
    }
  ]
}