{
  "author": "vgtaaaaaaa1",
  "original_created_utc": 1632870797,
  "title": "We were all noobs once, If someone asks a question that sounds stupid. You should answer without belittling them",
  "created_utc": 1632879460,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know most of us know about market cap, supply and tokenomics etc, but most of the beginners don&#39;t. If someone asks you about ADA reaching $1000 you should calmly make them understand about the market cap. Making fun of the noobs results in them being defensive about their position. This also makes us look toxic. We all should encourage them to research more. This will create a friendly environment and we won&#39;t be known as toxic crypto bros. Remember the goal of this community should be to get as many people on board with us so everyone can benefit from this incredible space.</p>\n</div><!-- SC_ON -->",
  "score": 346,
  "permalink": "/r/CryptoCurrency/comments/pxifwr/we_were_all_noobs_once_if_someone_asks_a_question/",
  "subreddit": "CryptoCurrency",
  "id": "pxifwr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know most of us know about market cap, supply and tokenomics etc, but most of\nthe beginners don't. If someone asks you about ADA reaching $1000 you should\ncalmly make them understand about the market cap. Making fun of the noobs\nresults in them being defensive about their position. This also makes…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "時価総額、供給量、トケノミクスなどについて、ほとんどの人が知っていると思いますが、ほとんどの\n初心者は知らないでしょうね。もし誰かにADAが1000ドルに達したことについて聞かれたら、冷静にマーケットキャップについて理解させるべきです。\n冷静にマーケットキャップについて理解してもらう必要があります。初心者をバカにしている\n結果、彼らは自分の立場を守ることになります。これはまた、...",
      "title": "誰もがかつては初心者だったのだから、誰かが馬鹿げた質問をしても 相手をけなすことなく答えるべきです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道我们中的大多数人都知道市值、供应和tokenomics等，但大多数的\n初学者不知道。如果有人问你ADA达到1000美元的情况，你应该\n冷静地让他们了解市值的情况。嘲笑初学者\n导致他们对自己的立场产生防卫心理。这也使得...",
      "title": "我们都曾经是新手，如果有人问了一个听起来很愚蠢的问题。你应该回答，不要贬低他们"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道我們中的大多數人都知道市值、供應和tokenomics等，但大多數的\n初學者不知道。如果有人問你ADA達到1000美元的情況，你應該\n冷靜地讓他們瞭解市值的情況。嘲笑初學者\n導致他們對自己的立場產生防衛心理。這也使得...",
      "title": "我們都曾經是新手，如果有人問了一個聽起來很愚蠢的問題。你應該回答，不要貶低他們"
    }
  ]
}