{
  "author": "disintegore",
  "the_new_excerpt": "This is a historical \"fact\" that teachers here in Canada love to repeat (it also\ncomes up in casual conversation).\n\nDuring the North American fur trade, Europeans would often exchange metal items\nfor beaver furs procured by the natives, to be turned into felt hats back in\nEurope. Among those goods,…",
  "original_created_utc": 1623903327,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、カナダの教師たちが好んで繰り返す歴史的な「事実」です。\n何気ない会話の中にも出てきます）。)\n\n北米の毛皮貿易では、ヨーロッパ人は原住民が調達したビーバーの毛皮と金属製品を交換して、フェルトの帽子にしていました。\nビーバーの毛皮と交換して、フェルトの帽子にしてヨーロッパに持ち帰りました。\nヨーロッパでは その中で、...",
      "title": "北米の毛皮商人は、原住民を騙すために非常に長いライフルを作ったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是加拿大的老师们喜欢重复的一个历史 \"事实\"（这也是\n闲聊中也会提到）。)\n\n在北美的毛皮贸易中，欧洲人经常用金属物品来交换\n以换取由土著人采购的海狸毛皮，然后将其变成毡帽带回欧洲。\n欧洲。在这些物品中，...",
      "title": "北美洲的毛皮商人制造极长的步枪是为了诈骗土著人吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是加拿大的老師們喜歡重複的一個歷史 \"事實\"（這也是\n閒聊中也會提到）。)\n\n在北美的毛皮貿易中，歐洲人經常用金屬物品來交換\n以換取由土著人採購的海狸毛皮，然後將其變成氈帽帶回歐洲。\n歐洲。在這些物品中，...",
      "title": "北美洲的毛皮商人制造極長的步槍是爲了詐騙土著人嗎？"
    }
  ],
  "title": "Did fur traders in North America build extremely long rifles in order to swindle natives?",
  "created_utc": 1623916462,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is a historical &quot;fact&quot; that teachers here in Canada love to repeat (it also comes up in casual conversation). </p>\n\n<p>During the North American fur trade, Europeans would often exchange metal items for beaver furs procured by the natives, to be turned into felt hats back in Europe. Among those goods, firearms were in extremely high demand. </p>\n\n<p>Supposedly, at some point, a custom was established in which a rifle would planted into the ground like a stake. The natives would then stack beaver pelts until the pile matched the height of the gun, at which point the deal would be closed. This motivated the Europeans to bring with them rifles with increasingly long barrels, to the point where this excess length made the weapons less effective or outright impractical. Furthermore it was heavily implied that the piles of fur were dramatically more valuable than the rifles, and that the entire custom consisted in yet another way in which the natives were taken advantage of. </p>\n\n<p>As a child, I took it for granted that the adults would give me correct (or mostly correct) information.Thinking about it today, I find it extremely hard to believe that this actually happened at all. I can&#39;t imagine that rifles in the 16th century, which I can only assume were brought over from Europe, could be considered so much less valuable than beaver pelts by the settlers. I would also assume that the native traders would catch on to something like this pretty damn quick.</p>\n\n<p>My Google-fu has utterly failed me here. I can only hope one of you can help me!</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/AskHistorians/comments/o1o7c9/did_fur_traders_in_north_america_build_extremely/",
  "subreddit": "AskHistorians",
  "id": "o1o7c9",
  "is_self": true,
  "media": null,
  "is_video": false
}