{
  "author": "BitcoinandTesla",
  "the_new_excerpt": "This is not financial advice and you should not follow anything I say below. My\npersonal circumstances are difference to yours. I have no kids, mortgage, debt,\nwife.\n\nThe most upvoted comment from my last post was to sell my BTC and pay off my\nloans and let the rest ride. I have decided to do the…",
  "original_created_utc": 1616671298,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这不是理财建议，你不应该按照我下面说的去做。我的\n个人情况是不同的你。我没有孩子，没有房贷，没有债务。\n妻子。\n\n我上一篇文章中，点赞最多的评论是卖掉我的BTC，还清我的\n贷款，让其余的骑。我已经决定做...",
      "title": "18.9万美元BTC贷款最新情况"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這不是理財建議，你不應該按照我下面說的去做。我的\n個人情況是不同的你。我沒有孩子，沒有房貸，沒有債務。\n妻子。\n\n我上一篇文章中，點贊最多的評論是賣掉我的BTC，還清我的\n貸款，讓其餘的騎。我已經決定做...",
      "title": "18.9萬美元BTC貸款最新情況"
    }
  ],
  "title": "$189k BTC Loan Update",
  "created_utc": 1616686984,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>This is not financial advice and you should not follow anything I say below. My personal circumstances are difference to yours. I have no kids, mortgage, debt, wife.</em></p>\n\n<p>The most upvoted comment from my last post was to sell my BTC and pay off my loans and let the rest ride. I have decided to do the opposite. I’ve used my BTC as collateral on Blockfi to take out a $89k loan (across 3 loans) and invested it in bitcoin. </p>\n\n<p>$89,000 = 1.543BTC\nAverage purchase price of $57,679</p>\n\n<p>Previous loans:\n$100k = 3.754btc @ $26,638 USD</p>\n\n<p>5.297 BTC @ $35,680 </p>\n\n<p>I am using my BTC profits as collateral so I’m effectively playing with the house’s money. I get margin called at around $17k BTC.</p>\n\n<p>Im aware we are mid cycle so coming to the party a little later than I would want but after the Tesla buy I feel that bitcoin has been de-risked significantly. </p>\n\n<p>If Bitcoin drops to zero tomorrow I lose my net worth and have to pay back $100k of my previous loans. I can comfortably afford the repayments and have 30 years of working life left but it would suck for a few years. </p>\n\n<p>If bitcoin does what I hope ($200k+) then I never have to work again and it will completely transform my life. </p>\n\n<p>That’s my risk/reward and for me it is worth it.</p>\n</div><!-- SC_ON -->",
  "score": 331,
  "permalink": "/r/Bitcoin/comments/mcvxst/189k_btc_loan_update/",
  "subreddit": "Bitcoin",
  "id": "mcvxst",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357132814
}