{
  "author": "oxygen-tastes-funny",
  "original_created_utc": 1649088598,
  "title": "Would the librarians get mad if I just waltz in and sat down to study?",
  "created_utc": 1649116635,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been struggling to find a decent way to study and the first thing that comes to mind is a change of scenery. I&amp;#39;m lucky to have a city with a pretty good library in place. My concern is: would it be rude to just plop down like that?\nI&amp;#39;m planning on using my headphones to listen to music and focus on my work.&lt;/p&gt;\n\n&lt;p&gt;My concern is that I don&amp;#39;t want them to think I just came in for the free WiFi or something? Or being upset with me for getting any new books on this visit. I just worry there&amp;#39;s some unspoken rule that I&amp;#39;m missing.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/tw5t5p/would_the_librarians_get_mad_if_i_just_waltz_in/",
  "subreddit": "NoStupidQuestions",
  "id": "tw5t5p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been struggling to find a decent way to study and the first thing that\ncomes to mind is a change of scenery. I'm lucky to have a city with a pretty\ngood library in place. My concern is: would it be rude to just plop down like\nthat? I'm planning on using my headphones to listen to music and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まともな勉強方法を探すのに苦労して、まず最初に\n思い浮かぶのは、気分転換です。幸運なことに、私の住んでいる街には、かなり優れた\n図書館が充実している。心配なのは、このまま突っ伏してしまうのは失礼にあたるのではないかということです。\nあれ？ヘッドホンで音楽を聴く予定ですが、、、。",
      "title": "いきなり入ってきて、座って勉強したら、司書さんに怒られるかな？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在努力寻找一个像样的学习方法，首先想到的是换个环境。\n我想到的第一件事就是换个环境。我很幸运，我所在的城市有一个相当不错的\n好的图书馆。我担心的是：就这样瘫坐在地上会不会很不礼貌？\n会不会很不礼貌？我打算用我的耳机来听音乐和...",
      "title": "如果我就这样大摇大摆地进来，坐下来学习，图书管理员会不会生气？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在努力尋找一個像樣的學習方法，首先想到的是換個環境。\n我想到的第一件事就是換個環境。我很幸運，我所在的城市有一個相當不錯的\n好的圖書館。我擔心的是：就這樣癱坐在地上會不會很不禮貌？\n會不會很不禮貌？我打算用我的耳機來聽音樂和...",
      "title": "如果我就這樣大搖大擺地進來，坐下來學習，圖書管理員會不會生氣？"
    }
  ]
}