{
  "author": "botofbot",
  "original_created_utc": 1630145309,
  "title": "Telegram Bots Rating (Top 500)",
  "created_utc": 1630160834,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello people and robots,<br/>\nI&#39;ve created a rating of telegram bots. Bots in the list are sorted by number of chats they are installed in. For another project of mine I have crawled lists of users of 800k public telegram groups. Based on these data I have created rating of bots. It is here <a href=\"https://tgbots.io/\">https://tgbots.io</a> First two places are occupied by my bots because I know 100% groups where my bots are installed. But for other bots I know only subset of groups where they are installed because I do not have list of ALL public telegram groups.</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/pd76jf/telegram_bots_rating_top_500/",
  "subreddit": "SideProject",
  "id": "pd76jf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello people and robots,\nI've created a rating of telegram bots. Bots in the list are sorted by number of\nchats they are installed in. For another project of mine I have crawled lists of\nusers of 800k public telegram groups. Based on these data I have created rating\nof bots. It is here…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人もロボットもこんにちは。\n私は、テレグラム・ボットの評価を作成しました。リストにあるボットは、以下の数でソートされています。\nリストのボットは、インストールされているチャットの数でソートされています。私の別のプロジェクトでは、800kのパブリックテレグラムグループのユーザーリストをクロールしました。\nユーザーのリストをクローリングしましたが、これは800kのパブリックテレグラムグループのユーザーのリストです。これらのデータに基づいて、ボットの評価を作成しました。\nボットの評価を作成しました。それはここにあります...",
      "title": "テレグラム・ボットの評価（トップ500"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，人们和机器人。\n我创建了一个Telegram机器人的评级。列表中的机器人是按照它们所安装的\n聊天室的数量排序。在我的另一个项目中，我抓取了80万个公共telegram组的用户名单。\n800k公共telegram组的用户名单。基于这些数据，我创建了评级\n的评级。它在这里...",
      "title": "Telegram Bots评级（前500名"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，人們和機器人。\n我創建了一個Telegram機器人的評級。列表中的機器人是按照它們所安裝的\n聊天室的數量排序。在我的另一個項目中，我抓取了80萬個公共telegram組的用戶名單。\n800k公共telegram組的用戶名單。基於這些數據，我創建了評級\n的評級。它在這裏...",
      "title": "Telegram Bots評級（前500名"
    }
  ]
}