{
  "author": "donemessedup123",
  "the_new_excerpt": "Not asking for recommendations but curious to hear thoughts. FAAMG, as Goldman\nSachs defines as Facebook, Amazon, Apple, Microsoft, and Google, (Not to be\nconfused with Jim Cramer's FAANG, which substitutes Netflix for Microsoft) have\nbeen among the most dominant players in terms of growth, volume…",
  "original_created_utc": 1619919512,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "お勧めはしませんが、意見を聞きたいです。FAAMGとは、ゴールドマン\nゴールドマン・サックスが定義するFAAMGとは、Facebook、Amazon、Apple、Microsoft、Googleのことです（Jim CramerのFAANGと混同してはいけません。\nJim CramerのFAANGと混同してはいけませんが、Microsoftの代わりにNetflixを使用しています。\nは、成長率、数量の面で最も支配的なプレーヤーの一つです。",
      "title": "5年後、10年後に最も可能性があると思うFAAMGの銘柄は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不要求推荐，但很想听听大家的想法。FAAMG，正如高盛\nSachs对Facebook、亚马逊、苹果、微软和谷歌的定义。\n与吉姆-克莱默（Jim Cramer）的FAANG相混淆，后者用Netflix代替了微软）一直是最主要的参与者之一。\n在增长、数量方面一直是最有优势的参与者之一。",
      "title": "你认为哪些FAAMG股票在5-10年内最具潜力？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不要求推薦，但很想聽聽大家的想法。FAAMG，正如高盛\nSachs對Facebook、亞馬遜、蘋果、微軟和谷歌的定義。\n與吉姆-克萊默（Jim Cramer）的FAANG相混淆，後者用Netflix代替了微軟）一直是最主要的參與者之一。\n在增長、數量方面一直是最有優勢的參與者之一。",
      "title": "你認爲哪些FAAMG股票在5-10年內最具潛力？"
    }
  ],
  "title": "Which FAAMG stocks do you think have the most potential 5-10 years?",
  "created_utc": 1619987191,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Not asking for recommendations but curious to hear thoughts. FAAMG, as Goldman Sachs defines as Facebook, Amazon, Apple, Microsoft, and Google, (Not to be confused with Jim Cramer&#39;s FAANG, which substitutes Netflix for Microsoft) have been among the most dominant players in terms of growth, volume and market cap.</p>\n\n<p>All of them have an arguably strong role to play in our society in the many years to come. </p>\n\n<p>I am curious to hear if anyone is particularly bullish or bearish on the outlook for any of these mammoth companies? </p>\n\n<p>Some focus questions: Do you think either of them are particularly positioned to dominate a new sector? Have some grown so large that they will stagnant from here? Do some now face legal risks because of alleged anti-competitiveness?</p>\n</div><!-- SC_ON -->",
  "score": 59,
  "permalink": "/r/stocks/comments/n2we74/which_faamg_stocks_do_you_think_have_the_most/",
  "subreddit": "stocks",
  "id": "n2we74",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380967014
}