{
  "author": "amandamichelle90",
  "original_created_utc": 1631375501,
  "title": "New investors worry the days of crypto millionaires are gone *perspective*",
  "created_utc": 1631442946,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Here’s some perspective because people have it in their mind that a few bucks in BTC would have made you a millionaire in a few months. Bitcoin has never been the top performing coin annually, it’s just been on a dependable increase for the longest. Most investors are impatient, squirrelly and fearful that they missed the boat with no real perspective of what it would have taken and will still take to be a crypto millionaire. </p>\n\n<p><strong>$100 in Bitcoin on January 2013 and you’d have</strong>\n- $99.16 - six months later. \n- $5,587 - 1 year later. </p>\n\n<p><strong>$100 in Solana in September 2020 would have been</strong>\n-  $480 - six months later\n- $6,360  - 1 year later (today) </p>\n\n<p><strong>$100 in Bitcoin on January 2018 and you’d have</strong>\n- $54.55 - 6 months later \n- $28.73 - 1 year later </p>\n\n<p><em>Would you have held? That’s a year and you waited 365 days to lose 70 bucks. Of course you held, no sense taking back $25. Let’s keep going then</em>\n- $52.38 - 2 years later \n- $212.87 - 3 years later </p>\n\n<p>Awesome, by January 2021 your $100 in Bitcoin 3 years ago would finally be in the green, doubled even! Have you doubled your investment in anything yet? That’s a far, far underrated win, doubling your money is that kinda <em>too good to be true</em> shit people promise you in scams. Of course you would have made more if you invested more — the rich get richer is the ass pain of life, nothing we can do about that but doubling your money is a huge win. </p>\n\n<hr/>\n\n<p>The only thing I want you to take away from this is no matter what your strategy, it’s not <strong>harder</strong> to invest today, the multipliers aren’t weaker this year than they have been previously, they’re just spread out amongst more options. No not all of us will be millionaires, so everytime you see someone get impatient and sell for a loss - just know it’s not going to be him but it still could be you.</p>\n\n<p>TLDR: you’re chasing a repeat of something that didn’t happen like you think it did, 10 years condensed into a chart doesn’t project the reality of the time involved. The multipliers are still here and still happening. Nothing has changed in that regard, you just have more options now.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/pm9tyf/new_investors_worry_the_days_of_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "pm9tyf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Here’s some perspective because people have it in their mind that a few bucks in\nBTC would have made you a millionaire in a few months. Bitcoin has never been\nthe top performing coin annually, it’s just been on a dependable increase for\nthe longest. Most investors are impatient, squirrelly and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここでは、人々が心の中で、数ドルの\nBTCで数ドル稼げば、数ヶ月で億万長者になれると思っているからです。ビットコインは決して\nビットコインは毎年最も高いパフォーマンスを示すコインではありません。\n一番長く続いています。ほとんどの投資家はせっかちで、リス...",
      "title": "新しい投資家は、暗号の大富豪の時代は終わったと心配しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这里有一些观点，因为人们心中认为几块钱的\nBTC会让你在几个月内成为百万富翁。比特币从来没有成为\n每年都是表现最好的币种，它只是长期以来一直处于可靠的增长状态。\n最长的时间。大多数投资者都没有耐心，松鼠和...",
      "title": "新投资者担心加密货币百万富翁的日子一去不复返*观点*。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏有一些觀點，因爲人們心中認爲幾塊錢的\nBTC會讓你在幾個月內成爲百萬富翁。比特幣從來沒有成爲\n每年都是表現最好的幣種，它只是長期以來一直處於可靠的增長狀態。\n最長的時間。大多數投資者都沒有耐心，松鼠和...",
      "title": "新投資者擔心加密貨幣百萬富翁的日子一去不復返*觀點*。"
    }
  ]
}