{
  "author": "ThePrussianBlue",
  "original_created_utc": 1652579841,
  "title": "Is having kids as bad as you all make it out to be? All the people with kids I know just complain about it.",
  "created_utc": 1652625029,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As a young person who won’t be having kids for some years yet I gotta say young parents make it sound terrible. Multiple coworkers who have kids always just share stories about how their kids are hectic or they were late because of X that their kid did. Even on Reddit it seems like it is just people complaining about it.&lt;/p&gt;\n\n&lt;p&gt;Not to mention all the posts about lack of sex after kids, feeling like they lost themselves, how expensive kids are and how exhausted they are.&lt;/p&gt;\n\n&lt;p&gt;Are kids really just all negatives? Why is it just complaining? Is everyone just having them out of societal expectation? Are kids just terrible if your poor and easy if your rich (is it a class thing)?&lt;/p&gt;\n\n&lt;p&gt;I was excited to have kids one day but everyone makes it sound so fucking bad.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/upvokh/is_having_kids_as_bad_as_you_all_make_it_out_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "upvokh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As a young person who won’t be having kids for some years yet I gotta say young\nparents make it sound terrible. Multiple coworkers who have kids always just\nshare stories about how their kids are hectic or they were late because of X\nthat their kid did. Even on Reddit it seems like it is just…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まだ何年か子供を産まない若い人間としては、若いって言わなきゃね。\n親は恐ろしいと思う。子供がいる複数の同僚は、いつも\nのせいで、遅刻したとか。\nのせいで遅刻したとか。Redditでさえも、まるで...",
      "title": "みなさんが言うほど、子供を持つことは悪いことなのでしょうか？私の知っている子持ちの人はみんな文句ばかりです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个若干年后才会有孩子的年轻人，我得说，年轻人\n的父母让它听起来很糟糕。许多有孩子的同事总是\n分享他们的孩子是如何忙碌的，或者他们是如何因为X而迟到的故事\n他们的孩子做了什么。即使在Reddit上，这似乎也只是...",
      "title": "有孩子就像你们说的那么糟糕吗？我认识的所有有孩子的人都在抱怨这个问题。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個若干年後纔會有孩子的年輕人，我得說，年輕人\n的父母讓它聽起來很糟糕。許多有孩子的同事總是\n分享他們的孩子是如何忙碌的，或者他們是如何因爲X而遲到的故事\n他們的孩子做了什麼。即使在Reddit上，這似乎也只是...",
      "title": "有孩子就像你們說的那麼糟糕嗎？我認識的所有有孩子的人都在抱怨這個問題。"
    }
  ]
}