{
  "author": "shanolu",
  "original_created_utc": 1626030742,
  "title": "Does everyone else feel overwhelmed with life all the time?",
  "created_utc": 1626062357,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For almost my entire adult life I feel like I&#39;m always trying to play catch up - keeping the house clean, looking after myself, eating well, turning up to work and staying on top of laundry are kinda the bare minimum. Then there&#39;s having a social life, having meaningful contact and spending time with friends and family, trying to make new connections, attending birthdays, weddings and baby showers. And then there&#39;s doing your own stuff - hobbies, keeping fit, personal development.. I&#39;ve been trying to complete a course for the last 5 months but I&#39;ve barely worked on it for the last 3 because I just can&#39;t seem to find the time! </p>\n\n<p>I constantly feel anxious and disappointed with myself, the house is almost always a mess, weeks can go by without seeing family members, I feel like I miss out on important things that are happening with my friends and I always seem to be running around but not getting anywhere! It feels like everyone else has it together and is on top of it in a way that I just don&#39;t understand how to be so.. what&#39;s the secret? Or does everyone else feel like they&#39;re just scraping by too?</p>\n\n<p>TLDR; I feel like there&#39;s not enough time in life to keep on top of everything, does everyone else feel that way?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/oiame7/does_everyone_else_feel_overwhelmed_with_life_all/",
  "subreddit": "TooAfraidToAsk",
  "id": "oiame7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For almost my entire adult life I feel like I'm always trying to play catch up -\nkeeping the house clean, looking after myself, eating well, turning up to work\nand staying on top of laundry are kinda the bare minimum. Then there's having a\nsocial life, having meaningful contact and spending time…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は大人になってからというもの、常に追いつこうとしているように感じます。\n家をきれいに保つこと、自分の世話をすること、よく食べること、会社に出勤すること\n家をきれいに保つこと、自分の体調を整えること、食事をきちんととること、仕事に行くこと、洗濯物をきちんと処理すること、これらは最低限のことです。また、社会生活を送ることも重要です。\n社会生活を送ること、意味のある接触を持つこと、そして時間を過ごすこと...。",
      "title": "みんな、いつも人生に圧倒されているのかな？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几乎在我的整个成年生活中，我感觉我总是在努力追赶 --\n保持房子清洁、照顾自己、吃得好、去上班\n并坚持洗衣服，这些都是最基本的要求。然后是有一个\n社会生活，有意义的接触和花时间......",
      "title": "其他人是否也一直对生活感到不堪重负？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾乎在我的整個成年生活中，我感覺我總是在努力追趕 --\n保持房子清潔、照顧自己、喫得好、去上班\n並堅持洗衣服，這些都是最基本的要求。然後是有一個\n社會生活，有意義的接觸和花時間......",
      "title": "其他人是否也一直對生活感到不堪重負？"
    }
  ]
}