{
  "author": "damnusernamegotcutof",
  "original_created_utc": 1638519755,
  "title": "Porn coins will NOT be the next big thing",
  "created_utc": 1638527729,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t believe that the front page post about porn coins being &amp;quot;the next big thing&amp;quot; has been so massively upvoted. Is it being brigaded? Or do people think it&amp;#39;s tagged as comedy?&lt;/p&gt;\n\n&lt;p&gt;Why the heck would we need a brand new coin to buy porn? If I wanted anonymity then surely i&amp;#39;d use one of the already existing, perfectly functioning, time-tested privacy coins like XMR, DASH or ZCASH? Why would I want to take the extra steps of going to some dodgy exchange to buy a coin that I can solely use for one thing? It literally makes zero sense&lt;/p&gt;\n\n&lt;p&gt;Plus, every single of those coins OP listed is an ERC-20 token. I don&amp;#39;t know how many of you are familiar with ethereum gas prices (i&amp;#39;m guessing the majority are) but I don&amp;#39;t really feel like paying hundreds of dollars in gas fees just to see Tyrone bang somebody&amp;#39;s wife. I make transactions with XMR all the time and end up paying a few cents&lt;/p&gt;\n\n&lt;p&gt;Unless i&amp;#39;m missing something here then it&amp;#39;s pretty clear that porn coins will NOT be the next big thing&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 550,
  "permalink": "/r/CryptoCurrency/comments/r7ucgj/porn_coins_will_not_be_the_next_big_thing/",
  "subreddit": "CryptoCurrency",
  "id": "r7ucgj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I can't believe that the front page post about porn coins being \"the next big\nthing\" has been so massively upvoted. Is it being brigaded? Or do people think\nit's tagged as comedy?\n\nWhy the heck would we need a brand new coin to buy porn? If I wanted anonymity\nthen surely i'd use one of the already…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ポルノ・コインが「次のビッグ・コイン」であるというトップページの投稿が信じられないほどです。\nが、これほどまでに大量にupvotedされている。Brigadedされているのでしょうか？それとも、みんなは\nお笑いのタグを付けているのでしょうか？\n\nポルノを買うのに、なぜ真新しいコインが必要なんだ？もし私が匿名性を求めるなら\nということであれば、すでにあるものを使うことになるのですが...。",
      "title": "ポルノコインは次の大きな流れにはならない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我无法相信，关于色情币是 \"下一个大事件 \"的头版文章得到了如此大规模的支持。\n我无法相信，关于色情币是 \"下一个大事件 \"的头版文章被如此大规模地支持了。这是被吹捧了吗？还是人们认为\n它被标记为喜剧？\n\n为什么我们需要一个全新的硬币来购买色情？如果我想匿名\n那我肯定会用一个已经...",
      "title": "色情币不会成为下一个大事件"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我無法相信，關於色情幣是 \"下一個大事件 \"的頭版文章得到了如此大規模的支持。\n我無法相信，關於色情幣是 \"下一個大事件 \"的頭版文章被如此大規模地支持了。這是被吹捧了嗎？還是人們認爲\n它被標記爲喜劇？\n\n爲什麼我們需要一個全新的硬幣來購買色情？如果我想匿名\n那我肯定會用一個已經...",
      "title": "色情幣不會成爲下一個大事件"
    }
  ]
}