{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "I know I will probably get downvoted heavily for this, but I want to provide a contrarian view here and would love to discuss further in the comments with anyone who agrees or disagrees (I’m very open to changing my mind). \n\nI believe that the best industries to invest in for the long run are media and tech due to the low cost of replicating their product for any number of consumers once a given piece of media or code is produced. For that reason, I have closely watched Disney for some time. \n\nDisney stock is down 18.45% YTD. I have been buying some of the dip on this stock recently, but as I have been doing more of my own DD on DIS, I've become increasingly hesitant to expand my position. I'm going to keep a small position because I believe so strongly in the Disney ecosystem of universes and stories that largely define our culture: Star Wars, Marvel, Pixar, Disney classics like Beauty and the Beast, etc., but overall I remain relatively bearish on this company. \n\nI believe that the management of Disney is weak, and has a track record of questionable acquisitions and weak implementation. Bob Chapek, the CEO, is a robot at best. He sounds dead inside. He has no flair or personality. he should be running a Lowe's or Target, not a media empire where cultural relevance and nimble action are key to creating viral hits. In interviews and earnings calls, he is generally vague and even sounds somewhat uninformed. He rarely has any data at hand and instead vaguely talks about potential opportunities. If he isn't data-driven and isn't inspiring, it's hard to see him as a strong leader. Listen to the latest earnings call; he failed to adequately answer pretty much any of the analysts' questions. Every question he is asked, Bob replies with some meaningless statements like wanting the consumer to decide or vaguely referring to the metaverse, or wanting to expand into sports betting. This is a problem. \n\nThe direction that the management is taking the company seems unfocused. Disney should double down on Disney+ direct-to-consumer streaming and dollar-for-dollar blow Netflix's content production investments out of the water. Right now, Netflix is projected to spend $13.6B on new content in 2021, and Disney is projected to spend $33B, but much of Disney's content spend is going towards cable/sports/Hulu rather than doubling down and competing with Netflix via Disney+. Disney needs to focus on becoming the future children's stories, family adventures, myths, the metaverse, etc. of the emerging global culture and getting every household on a monthly subscription. They haven't had any new high-quality content since the Mandalorian (and potentially 1 or 2 of the marvel shows). This is why they only added 2 million new subscribers last quarter whereas Netflix added 4.4 million. \n\nInstead, Disney is messing around with ESPN+ and Hulu and considering dabbling in gambling. Hulu is trash and should be sold immediately. the content isn't cohesive with Disney's brand, so it can't be bundled directly into Disney+, so they should sell it and use that revenue to create more family-friendly video content, family games, video games, and books to build out their ecosystem. \n\nIn the past 18 months, Netflix has put out many major hits including Squid Game, The Queen's Gambit, Ozark season 3, etc. Simply put, Netflix is outcompeting Disney right now. Every subscriber that Netflix adds is taking market share from competitors. Disney is struggling with product cannibalization as it tries to switch to a DTC model and is failing to produce top-notch content. \n\nThe latest Star Wars trilogy was botched from the top down. It was not the actors' or screenwriters' fault. It was management failing to communicate between directors to create a cohesive story (you can read more about this independently). I know much of this occurred before Bob Chapek, but I think this shows that the broader management team across Disney is weak. Miscommunication on this scale is appalling. A truly passionate management would have paid careful attention to make the relaunch of Star Wars a lot less bumpy.\n\nESPN+ should be spun off and sold immediately. It's great, but sports has never been what Disney is about, and another company could probably get more focused on making it a more profitable business model. I know betting is becoming more accepted, and I have nothing against it, but it definitely hurts Disney's brand to be moving towards getting involved with sports betting. This overall just does not align with Disney's vision. Disney is about the mouse, not the casino. \n\nDisney is so hesitant to move away from the old economy of cable and theaters, and this prevents them from dropping the freshest content directly on Disney+, which lowers the value of the subscription for consumers. I'm worried that this business is a bit of a dinosaur competing against nimble tech giants like Amazon, Apple, and Netflix all getting involved in streaming. This Halloween, kids were dressed up as characters from Netflix shows a lot more so than from Disney brands. Overall, I am worried that Disney's management choices over the past few years reflect that of AT&amp;T's over the past decade. Poor acquisitions, poor implementation of strategies, and terrible returns for investors. The only thing propping up Disney right now is how timeless their legacy brand is, which gives them a moat that AT&amp;Tnever had. This moat buys Disney time to get its act together, but that time may be running out.\n\nIf you don't own any Disney, I would say it's a decent company to open a small position in, but for those of you heavily invested already, I think this is something to consider before you double down too heavily on these dips. As far as valuation, Disney's P/E looks high right now at 130, but once the parks and theaters get back to running full cylinders, I estimate their P/E will quickly come down below 50 if current trends hold.  I know that P/E is a limited metric, but by whatever metric you look at, after the most recent dip, there is a strong argument that this is a relatively fair price point to buy in at. That said, I'm not convinced this is a particularly strong opportunity, and I like alternatives that are producing media like NFLX and AAPL better. \n\n\nDisclosure: I own shares of both Disney and Netflix. I am weighted more heavily towards Netflix, and I am just a guy on the internet so don't take my advice.",
  "author_fullname": "t2_42873jq0",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "DIS bear case: Disney has upside potential, but I don't trust the current management to execute",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_r65tzh",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.71,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 56,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Company Analysis",
  "can_mod_post": false,
  "score": 56,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1638332806,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1638331227,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know I will probably get downvoted heavily for this, but I want to provide a contrarian view here and would love to discuss further in the comments with anyone who agrees or disagrees (I’m very open to changing my mind). &lt;/p&gt;\n\n&lt;p&gt;I believe that the best industries to invest in for the long run are media and tech due to the low cost of replicating their product for any number of consumers once a given piece of media or code is produced. For that reason, I have closely watched Disney for some time. &lt;/p&gt;\n\n&lt;p&gt;Disney stock is down 18.45% YTD. I have been buying some of the dip on this stock recently, but as I have been doing more of my own DD on DIS, I&amp;#39;ve become increasingly hesitant to expand my position. I&amp;#39;m going to keep a small position because I believe so strongly in the Disney ecosystem of universes and stories that largely define our culture: Star Wars, Marvel, Pixar, Disney classics like Beauty and the Beast, etc., but overall I remain relatively bearish on this company. &lt;/p&gt;\n\n&lt;p&gt;I believe that the management of Disney is weak, and has a track record of questionable acquisitions and weak implementation. Bob Chapek, the CEO, is a robot at best. He sounds dead inside. He has no flair or personality. he should be running a Lowe&amp;#39;s or Target, not a media empire where cultural relevance and nimble action are key to creating viral hits. In interviews and earnings calls, he is generally vague and even sounds somewhat uninformed. He rarely has any data at hand and instead vaguely talks about potential opportunities. If he isn&amp;#39;t data-driven and isn&amp;#39;t inspiring, it&amp;#39;s hard to see him as a strong leader. Listen to the latest earnings call; he failed to adequately answer pretty much any of the analysts&amp;#39; questions. Every question he is asked, Bob replies with some meaningless statements like wanting the consumer to decide or vaguely referring to the metaverse, or wanting to expand into sports betting. This is a problem. &lt;/p&gt;\n\n&lt;p&gt;The direction that the management is taking the company seems unfocused. Disney should double down on Disney+ direct-to-consumer streaming and dollar-for-dollar blow Netflix&amp;#39;s content production investments out of the water. Right now, Netflix is projected to spend $13.6B on new content in 2021, and Disney is projected to spend $33B, but much of Disney&amp;#39;s content spend is going towards cable/sports/Hulu rather than doubling down and competing with Netflix via Disney+. Disney needs to focus on becoming the future children&amp;#39;s stories, family adventures, myths, the metaverse, etc. of the emerging global culture and getting every household on a monthly subscription. They haven&amp;#39;t had any new high-quality content since the Mandalorian (and potentially 1 or 2 of the marvel shows). This is why they only added 2 million new subscribers last quarter whereas Netflix added 4.4 million. &lt;/p&gt;\n\n&lt;p&gt;Instead, Disney is messing around with ESPN+ and Hulu and considering dabbling in gambling. Hulu is trash and should be sold immediately. the content isn&amp;#39;t cohesive with Disney&amp;#39;s brand, so it can&amp;#39;t be bundled directly into Disney+, so they should sell it and use that revenue to create more family-friendly video content, family games, video games, and books to build out their ecosystem. &lt;/p&gt;\n\n&lt;p&gt;In the past 18 months, Netflix has put out many major hits including Squid Game, The Queen&amp;#39;s Gambit, Ozark season 3, etc. Simply put, Netflix is outcompeting Disney right now. Every subscriber that Netflix adds is taking market share from competitors. Disney is struggling with product cannibalization as it tries to switch to a DTC model and is failing to produce top-notch content. &lt;/p&gt;\n\n&lt;p&gt;The latest Star Wars trilogy was botched from the top down. It was not the actors&amp;#39; or screenwriters&amp;#39; fault. It was management failing to communicate between directors to create a cohesive story (you can read more about this independently). I know much of this occurred before Bob Chapek, but I think this shows that the broader management team across Disney is weak. Miscommunication on this scale is appalling. A truly passionate management would have paid careful attention to make the relaunch of Star Wars a lot less bumpy.&lt;/p&gt;\n\n&lt;p&gt;ESPN+ should be spun off and sold immediately. It&amp;#39;s great, but sports has never been what Disney is about, and another company could probably get more focused on making it a more profitable business model. I know betting is becoming more accepted, and I have nothing against it, but it definitely hurts Disney&amp;#39;s brand to be moving towards getting involved with sports betting. This overall just does not align with Disney&amp;#39;s vision. Disney is about the mouse, not the casino. &lt;/p&gt;\n\n&lt;p&gt;Disney is so hesitant to move away from the old economy of cable and theaters, and this prevents them from dropping the freshest content directly on Disney+, which lowers the value of the subscription for consumers. I&amp;#39;m worried that this business is a bit of a dinosaur competing against nimble tech giants like Amazon, Apple, and Netflix all getting involved in streaming. This Halloween, kids were dressed up as characters from Netflix shows a lot more so than from Disney brands. Overall, I am worried that Disney&amp;#39;s management choices over the past few years reflect that of AT&amp;amp;T&amp;#39;s over the past decade. Poor acquisitions, poor implementation of strategies, and terrible returns for investors. The only thing propping up Disney right now is how timeless their legacy brand is, which gives them a moat that AT&amp;amp;Tnever had. This moat buys Disney time to get its act together, but that time may be running out.&lt;/p&gt;\n\n&lt;p&gt;If you don&amp;#39;t own any Disney, I would say it&amp;#39;s a decent company to open a small position in, but for those of you heavily invested already, I think this is something to consider before you double down too heavily on these dips. As far as valuation, Disney&amp;#39;s P/E looks high right now at 130, but once the parks and theaters get back to running full cylinders, I estimate their P/E will quickly come down below 50 if current trends hold.  I know that P/E is a limited metric, but by whatever metric you look at, after the most recent dip, there is a strong argument that this is a relatively fair price point to buy in at. That said, I&amp;#39;m not convinced this is a particularly strong opportunity, and I like alternatives that are producing media like NFLX and AAPL better. &lt;/p&gt;\n\n&lt;p&gt;Disclosure: I own shares of both Disney and Netflix. I am weighted more heavily towards Netflix, and I am just a guy on the internet so don&amp;#39;t take my advice.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "1235582c-6848-11eb-96e8-0e132357f477",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#d6890a",
  "id": "r65tzh",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "Capta1n1",
  "discussion_type": null,
  "num_comments": 61,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/r65tzh/dis_bear_case_disney_has_upside_potential_but_i/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/r65tzh/dis_bear_case_disney_has_upside_potential_but_i/",
  "subreddit_subscribers": 3332316,
  "created_utc": 1638394045,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1638331227,
  "the_new_excerpt": "I know I will probably get downvoted heavily for this, but I want to provide a\ncontrarian view here and would love to discuss further in the comments with\nanyone who agrees or disagrees (I’m very open to changing my mind).\n\nI believe that the best industries to invest in for the long run are media…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このようなことを言うと、おそらく激しく非難されるでしょうが、私は、このようなことを言いたいのです。\nまた、コメント欄でさらに議論したいと思います。\n賛成してくれる人、反対してくれる人（私は考えを変えることに寛容です）。\n\n私は、長期的に投資するのに最適な産業は、メディアだと考えています...",
      "title": "DISのベアケース。ディズニーにはアップサイドの可能性があるが、現在の経営陣が実行するとは思えない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道我可能会因此而被严重贬低，但我想在这里提供一个相反的观点。\n但我想在这里提供一个相反的观点，并希望在评论中与同意或不同意的人进一步讨论。\n任何同意或不同意的人（我非常愿意改变我的想法）。\n\n我相信，从长远来看，最好的投资行业是媒体...",
      "title": "DIS熊的案例。迪斯尼有上升的潜力，但我不相信目前的管理层能够执行。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道我可能會因此而被嚴重貶低，但我想在這裏提供一個相反的觀點。\n但我想在這裏提供一個相反的觀點，並希望在評論中與同意或不同意的人進一步討論。\n任何同意或不同意的人（我非常願意改變我的想法）。\n\n我相信，從長遠來看，最好的投資行業是媒體...",
      "title": "DIS熊的案例。迪斯尼有上升的潛力，但我不相信目前的管理層能夠執行。"
    }
  ],
  "source_updated_at": 1638524503172
}