{
  "author": "rantlyyy",
  "original_created_utc": 1626629245,
  "title": "You wake up tomorrow and the market crashed 99%, What do you do?",
  "created_utc": 1626687785,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve seen a lot of threads about what would you do if you wake up tomorrow a millionaire so I started to think what if the opposite happens?</p>\n\n<p>I mean with all the Tether, Binance, and crypto scam news happening it&#39;s always a Possibility, a Very small possibility but you never know!</p>\n\n<p>Would you tell your family? Did you have money you can&#39;t afford to lose there? I&#39;d love to hear what your reaction would be and how important crypto is to your lives!</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/omv2mr/you_wake_up_tomorrow_and_the_market_crashed_99/",
  "subreddit": "CryptoCurrency",
  "id": "omv2mr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've seen a lot of threads about what would you do if you wake up tomorrow a\nmillionaire so I started to think what if the opposite happens?\n\nI mean with all the Tether, Binance, and crypto scam news happening it's always\na Possibility, a Very small possibility but you never know!\n\nWould you tell…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "明日目が覚めたら億万長者になっていたとしたら何をするかというスレッドをたくさん見たので\nもし明日目が覚めたら億万長者になっていたとしたら」というスレッドをよく目にします。\n\nTether、Binance、crypto scamのニュースがある中で、常に可能性はあります。\n可能性は常にあります。非常に小さな可能性ですが、あなたは決して知りません!\n\nあなたなら...",
      "title": "明日、目が覚めたら市場が99％暴落していたとしたら、あなたは何をしますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到很多关于如果你明天醒来是个百万富翁，你会怎么做的帖子。\n百万富翁，所以我开始想，如果发生了相反的情况怎么办？\n\n我的意思是，随着所有Tether、Binance和加密货币骗局新闻的发生，它总是\n一个可能性，一个非常小的可能性，但你永远不知道!\n\n你会告诉...",
      "title": "你明天醒来，市场崩溃了99%，你会怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到很多關於如果你明天醒來是個百萬富翁，你會怎麼做的帖子。\n百萬富翁，所以我開始想，如果發生了相反的情況怎麼辦？\n\n我的意思是，隨着所有Tether、Binance和加密貨幣騙局新聞的發生，它總是\n一個可能性，一個非常小的可能性，但你永遠不知道!\n\n你會告訴...",
      "title": "你明天醒來，市場崩潰了99%，你會怎麼做？"
    }
  ]
}