{
  "author": "prajwalwillrule",
  "original_created_utc": 1640713770,
  "title": "Anyone looking into Play to Earn, here's my 45 days experience in a few games I played.",
  "created_utc": 1640727118,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Before I start, I just wanted to point out that if you&amp;#39;re using faucets for such little payouts, you may as well play a small game. It&amp;#39;s fun, plus it pays much more.&lt;/p&gt;\n\n&lt;p&gt;So here&amp;#39;s the list of all I&amp;#39;ve tried. More coming soon&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;Cryptoroyale&lt;/strong&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;For obvious reasons, this should top the list. It&amp;#39;s completely Free to play, no downloads, no initial investment. It pays for your time and skill. About a month ago, I could earn about 100 ROY(in-game token) per day \nBut now with the massive number of players that joined this week, it has come down to almost 50 ROY. I usually play 3 out of the 4 daily tournaments a day. At first I was really in it for the money but now I&amp;#39;m kinda addicted to it. It&amp;#39;s simply amazing and we have quite a lot of players on this sub that can vouch for this!&lt;/p&gt;\n\n&lt;p&gt;Go to Cryptoroyale.one on your browser in your desktop or mobile and play instantly and start earning. Last I checked ROY was 0.175$&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;SPLINTERLANDS&lt;/strong&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;It&amp;#39;s an autoplay NFT card game. I&amp;#39;d start off by saying that only if you&amp;#39;re planning to keep the flow of cash coming to the game, then it MAY be profitable. &lt;/p&gt;\n\n&lt;p&gt;Initial investment 10$ for the spellbook. You need to climb ranks to earn DEC which is in-game token. That is another paywall. Instead of buying cards as NFT, you can rent them for a few cents a day, or a few dollars a day depending on the power of the cards. To earn more rewards, you would have to rent/buy higher cards constantly and keep your rank up. Higher rank and specific cards will give you more DEC per win. &lt;/p&gt;\n\n&lt;p&gt;Other way to earn is staking your SPS token, which is airdropped daily after calculating your in-game assets. It&amp;#39;s lucrative if you&amp;#39;re willing to put some money in the game. &lt;/p&gt;\n\n&lt;p&gt;My personal experience with the game wasn&amp;#39;t so well. I couldn&amp;#39;t get a decent profit for the money I put. It felt like too much effort and too little pay. On the lower ranks(where you don&amp;#39;t spend anything,) the rewards are different. You get a negligible reward for daily quest. \nAs you climb higher, Daily quest Chests increase in number and the prize pool is different too. &lt;/p&gt;\n\n&lt;p&gt;So I feel the game is kinda rigged to give profits to those who keep spending.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;League of Kingdoms&lt;/strong&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Build your kingdom, collect resources, play with an alliance, kill monsters, attack other kingdoms,mine in game resources, daily tasks, event tasks etc. &lt;/p&gt;\n\n&lt;p&gt;Completely free to play. Much easier if you find a good alliance. &lt;/p&gt;\n\n&lt;p&gt;The way to earn here is by minting NFTs of your in-game resources. It took me a few weeks to be able to start earning. It&amp;#39;s not an easy task but you don&amp;#39;t have to spend too long in game. You can leave your army to collect resources and come back in a couple hours and repeat. NFTs can be minted every 8 hours(someone correct me if I&amp;#39;m wrong) and each 10million resource NFT sells for about 2$ on opensea&lt;/p&gt;\n\n&lt;p&gt;Maybe multiple accounts will get you good profits. I&amp;#39;m still playing with only one. Over time these little sales may add up to a decent amount with minimal effort. So I keep playing. &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;MIR4&lt;/strong&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Free to play, but way too much effort. &lt;/p&gt;\n\n&lt;p&gt;The way people make good profits in the game is using a ton of bots. I don&amp;#39;t recommend unless you are planning to use multiple accounts and spend all day. The gameplay and graphics are pretty decent and it&amp;#39;s kinda fun to play if you&amp;#39;re not looking to make money.&lt;/p&gt;\n\n&lt;p&gt;In-game DRACO coin has been falling and I didn&amp;#39;t want to put in that much effort into it so I stopped. There are better games out there.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;Gods Unchained&lt;/strong&gt; &lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Another card game but I&amp;#39;d place this higher than splinterlands. &lt;/p&gt;\n\n&lt;p&gt;I only recently got started. 0 investment needed and you can earn through in game token GODS and selling your cards as NFTs.&lt;/p&gt;\n\n&lt;p&gt;The game is vast and there&amp;#39;s a lot to learn but it pays well. I have only recently started playing so I can&amp;#39;t give you more specifics but from what I hear, it&amp;#39;s pretty good!&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;Thetan Arena&lt;/strong&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;It&amp;#39;s a shooting game! A lot of characters and everyone has different skills and stuff. You can choose a Free to Play Path and make money but the grind is very difficult. You need to rank up to Bronze which is a very painful process because as no matter how good you play, people will come with legendary characters with Overpowered skills and destroy you at times. &lt;/p&gt;\n\n&lt;p&gt;At Bronze, at the point you can cash out, you can make about 30$-40$ after collecting rewards from rank ups.&lt;/p&gt;\n\n&lt;p&gt;You can buy characters as NFTs but they can play a limited number of matches in a lifetime(depending on rarity) and too keep things fairer, you can play only a limited number of matches per day on which you can earn. &lt;/p&gt;\n\n&lt;p&gt;The main issue in the game is the falling prices of THC, the in-game token. It&amp;#39;s almost at a point where you might even take a loss if you don&amp;#39;t get a decent amount of daily wins. I still play it not for the money, but because it&amp;#39;s fun!&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;BATTLE HERO&lt;/strong&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Another shooting game but it&amp;#39;s in closed BETA right now. Open Beta is supposed to lauch in Q1 2022. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s almost free to play as you get your starter pack for free. The catch is you would need 1-2$ worth of gas to get the starter pack. &lt;/p&gt;\n\n&lt;p&gt;Characters and weapons can be bought and sold as NFTs. Chests can be bought for both characters and Weapons.&lt;/p&gt;\n\n&lt;p&gt;The game isn&amp;#39;t out yet, but there&amp;#39;s still a way to make money here.&lt;/p&gt;\n\n&lt;p&gt;NFT rarity - common, low rare, rare, epic, legendary and mythic. A pair of character and Weapon can be placed into TRAINING which will generate the in game PE token that can be converted to BATH token. Training is locked period of 7 days and once that duration is over, you can claim your rewards. There is a lottery which will give you chests as rewards. Lottery tickets can be bought using PE, burning NFTs or by staking BATH. &lt;/p&gt;\n\n&lt;p&gt;My experience- Pretty bullish on this game. \nI&amp;#39;m not putting my real numbers here, but for my investment, I got lucky in chests and have NFTs worth 4X times my investment. I get Training rewards Roughly equal to 10% of my investment per week(inclusive of gas fees) &lt;/p&gt;\n\n&lt;p&gt;Once the game comes out, BATH will pump and it will be much more profitable. And we can start earning from the gameplay as well. This is the game I&amp;#39;m most bullish on. &lt;/p&gt;\n\n&lt;p&gt;So.. AMA I guess? Some of you can pitch in if you have more suggestions!&lt;/p&gt;\n\n&lt;p&gt;Last post of the year. Wish you all have a wonderful year ahead!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/rqldi9/anyone_looking_into_play_to_earn_heres_my_45_days/",
  "subreddit": "CryptoCurrency",
  "id": "rqldi9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Before I start, I just wanted to point out that if you're using faucets for such\nlittle payouts, you may as well play a small game. It's fun, plus it pays much\nmore.\n\nSo here's the list of all I've tried. More coming soon\n\n 1. Cryptoroyale\n\nFor obvious reasons, this should top the list. It's…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "その前に、もしあなたがこのような水栓を使っているのなら\n出玉が少ないのは、小手先の勝負をした方がいいのかもしれません。楽しいし、しかもずっとペイする。\nより多く。\n\nというわけで、私が試したものをリストアップしてみました。近日中に追加予定\n\n 1. クリプトロワイヤル\n\n当然のことながら、これはリストのトップになるべきものです。それは...",
      "title": "Play to Earnを検討されている方、私が45日間プレイしたいくつかのゲームの体験談をご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我开始之前，我只想指出，如果你使用水龙头来获得如此少的\n赔率这么低，你还不如玩个小游戏。它很有趣，而且它支付的\n更多。\n\n所以这里是我所有尝试过的清单。更多即将推出\n\n 1. Cryptoroyale\n\n由于显而易见的原因，这应该是名单的首位。它是...",
      "title": "任何正在寻找玩赚的人，这是我45天来玩的几个游戏的经验。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我開始之前，我只想指出，如果你使用水龍頭來獲得如此少的\n賠率這麼低，你還不如玩個小遊戲。它很有趣，而且它支付的\n更多。\n\n所以這裏是我所有嘗試過的清單。更多即將推出\n\n 1. Cryptoroyale\n\n由於顯而易見的原因，這應該是名單的首位。它是...",
      "title": "任何正在尋找玩賺的人，這是我45天來玩的幾個遊戲的經驗。"
    }
  ]
}