{
  "author": "Llama_in_a_tux",
  "the_new_excerpt": "The title says it all. I downloaded and used all the ‘free’ ways to earn crypto\nI read about on the internet and on reddit, so that you don’t have to. I tried\nto use them all for at least a month to see what kinds of earnings there were.\nThey are listed in order according to how much I recommend…",
  "original_created_utc": 1623181068,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルがすべてを物語っています。私は、インターネットやredditで読んだcryptoを稼ぐ「無料」の方法をすべてダウンロードして使いました。\nインターネットやredditで読んだ、cryptoを稼ぐための「無料」の方法をすべてダウンロードして使ってみました。使ってみました。\n少なくとも1ヶ月は使ってみて、どのような収益が得られるかを確認しました。\nおすすめ度の高い順に掲載しています...",
      "title": "無料でできるCryptoの獲得方法をすべて試してみたらこんな結果に"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个标题说明了一切。我下载并使用了所有 \"免费 \"赚取加密货币的方法。\n我在网上和reddit上看到的，所以你不必这样做。我试图\n使用它们至少一个月，看看有什么样的收益。\n它们按照我推荐的程度依次列出...",
      "title": "我尝试了所有获得加密货币的免费方法，这些是结果"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個標題說明了一切。我下載並使用了所有 \"免費 \"賺取加密貨幣的方法。\n我在網上和reddit上看到的，所以你不必這樣做。我試圖\n使用它們至少一個月，看看有什麼樣的收益。\n它們按照我推薦的程度依次列出...",
      "title": "我嘗試了所有獲得加密貨幣的免費方法，這些是結果"
    }
  ],
  "title": "I Tried All the Free Methods of Gaining Crypto and These are the Results",
  "created_utc": 1623201891,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The title says it all. I downloaded and used all the ‘free’ ways to earn crypto I read about on the internet and on reddit, so that you don’t have to. I tried to use them all for at least a month to see what kinds of earnings there were. They are listed in order according to how much I recommend them, from best to worst.</p>\n\n<p>*FULL DISCLAIMER:* on most of these sites I used fake names and new emails to register. Some of them may be harvesting your data or providing other security concerns. Please do your own research, be safe, and remember that many apps and websites do not have your best interest in mind.</p>\n\n<p>&#x200B;</p>\n\n<p>**Brave Browser**</p>\n\n<p>What it is: Brave is a free browser to download and use - essentially an alternative to Chrome or Firefox. And as an actual browser, I must say I’m quite pleased. It’s fast, simple, and comes with built in adblocker and Tor browser. But we aren’t here to talk about free browsers. In addition to blocking ads, Brave (if you allow it to) will send you ads of their own, and give you the revenue in crypto. Every fifteen minutes or so while browsing the net, a little popup text box appears in the bottom right of my screen, advertising a product. I close it out, and a few pennies are added to my account. Brave pays out in the form of BAT tokens. It was easy to setup - simpler if you have an uphold account - and I found the ads to be unobtrusive.</p>\n\n<p>Results: I’ve had Brave for more than a year now and in that time have accumulated 58 BAT, currently worth $46 CAD. Considering that a) I like this browser more than Chrome and b) I have now completely forgotten about the ads and click them away unconsciously, I think this is great. It also helps that BAT has risen so significantly in the last year, and if its a coin you see promise in, I can’t recommend this enough.</p>\n\n<p>Verdict for Brave: Excellent. Highly Recommended.</p>\n\n<p>&#x200B;</p>\n\n<p>**Presearch**</p>\n\n<p>What it is: It’s a search engine. You can use it instead of google. Just like google, there are ads - sites paying to be listed first - but unlike google, they pay you a portion of the revenue. If you’ve ever used Bing’s reward program, its very similar but in crypto rather than fiat. I set it as the search engine in browser bar, and as someone who googles things regularly (me bid dumb ape) I was quickly gaining coins. As a search engine I would say it is ‘okay.’ Though it is designed so you can easily switch to looking at your results in google.</p>\n\n<p>Results: You gain .12 tokens per search (up to 30 per day) and can withdraw after gaining 1,000 tokens. Obviously, how much you make will depend on how often you search things. Personally, I set this as my default search engine and forgot all about it. Do your own research, but I see no downsides.</p>\n\n<p>Verdict for Presearch: Good. Recommended.</p>\n\n<p>&#x200B;</p>\n\n<p>**Honey Miner**</p>\n\n<p>What it is: It’s a crypto miner that assesses your computers capabilities, and runs accordingly (or so it claims). I have a MacBook Pro, so certainly no mining rig. No GPUs, really nothing that could help me do actual crypto mining. So I set up Honeyminer, and it mines in the background with the resources that are available.</p>\n\n<p>Results: My MacBook got hot and got hot fast. I left it overnight a few times, but honestly, I was concerned about the heat, so I googled it. Sure enough, this is a common issue, and from what I read online, it’s a bad idea to let it run for too long unless you have a third-party cooling unit. This meant that I was left running it for short spurts during the day, which was far less effective. If you have a gaming computer or proper cooling system, this might work well for you. Otherwise, I’m not so sure.</p>\n\n<p>After a month I stopped using it for fear of damaging my computer. In the month that I did use it (as I said, on and off) I made 1200 Satoshi, currently worth about $0.40 USD. But honestly a) I didn’t run it near as much as I could and b) it runs in the background, meaning virtually no time and effort after installation. If you are able to run this without damaging your hardware, why not? As always, do your own research, but this seems okay to me.</p>\n\n<p>Verdict for Honeyminer: Could be good if you have the right computer</p>\n\n<p>&#x200B;</p>\n\n<p>**COIN geominer**</p>\n\n<p>What it is: A phone app that (claims to) scrape geodata and turn it into reward points that can be redeemed for crpyto. I’m essentially a blue blip on a map of my city, and as I move around, the square area I’m on is “mined” and turns blue. The more squares you mine, the more coins you get, and you can re-mine a square after a few minutes. Just think of it as a far simpler version of Pokemon go. I usually go for a walk each day, so I brought it with me and mined all the trails and parks in the area. I’d boot up the app, stick it in my hoodie pocket (can’t lock the screen) and a half hour walk would drain about half my battery. You can also fill out surveys and watch videos to earn coins, but this sort of defeats the idea of being “free,” since this actually requires time.</p>\n\n<p>Results: In 3 months I have made 4,000 in-app coins. 10,000 coins can be redeemed for XYO Erc-20 tokens. 1.8 million coins can be redeemed for 0.025 Bitcoin and 5.4 million can be redeemed for one ETH. The quickest way to gain coins is not to use the geominer at all, but to fill out surveys. Back in a different lifetime I used to fill out surveys for a local company and got paid by cheque (in fiat obviously) and I’d say the prices are similar. Currently I walk with the app, let it drain my battery, check in for bonuses everyday and it will take about 9 months to earn some XYO coins which really don’t seem worth it. To earn BTC will require about ten years. I’d say stick with the surveys. The pay isn’t good, but its comparable to other places that pay you to do surveys.</p>\n\n<p>Verdict for COIN: Skip the geomining feature. If you’re willing to write surveys, they will pay you in crypto.</p>\n\n<p>&#x200B;</p>\n\n<p>**Stormgain Express**</p>\n\n<p>What it is: It claims to be a Bitcoin miner for your phone, but it most certainly is not. Basically every four hours you log onto the app, hit the “bitcoin miner” button and it will start spitting out some numbers that look like crypto wallet addresses. Each time you mine it will give you a little bit of money. According to the app and the website, it sincerely claims this is bitcoin mining. However, if you know anything (and I mean ANYTHING) about bitcoin mining, this has to be a straight up lie. Mining on my phone (and a crappy one at that)? It works even when I turn off my wifi and data? And my phone doesn’t even overheat? I don’t know what’s going on here, but they claim its bitcoin mining. Anyways, I tried to reactivate this every four hours. I’m going to say I ran it an average of three times a day for two months.</p>\n\n<p>Stormgain express is also just a good old fashioned crypto exchange. You can put in money and trade. So bear that in mind - some people may want to use this as their primary trading app, and let the miner add a few pennies along the way. In fact, it claims it will mine faster if you deposit money. You can do this at your own risk - I never did, and can’t vouch for the security of the app. I only ever used the free miner, and added no money of my own.</p>\n\n<p>Results: You can withdraw your money after you make $10 USDT, which took me about a month. Honestly, not bad for an I-don’t-know-what-you’re-actually-doing-app. Once you’ve withdrawn the money, you can turn them into put calls on a crypto of your choice. I used the app for a second month and only made $2. So I’m guessing it’s an incentive to get you in for the first month, and then productivity seemed to plummet. I should also add that there are incentives for getting your friends to download and mine with you.</p>\n\n<p>Verdict for Stormgain: It’s good for the first month.</p>\n\n<p>&#x200B;</p>\n\n<p>**Pi**</p>\n\n<p>What it is: An app where you log in everyday and click a button to ‘mine digital currency.’ You can do this once every 24 hours. Pi claims to be a crypto coin that will be ‘launching soon.’ In other words, I’m getting paid in a coin that hasn’t dropped yet.</p>\n\n<p>Results: If Pi is a real coin that drops someday and becomes valuable, that’s great, I’ve got lots. But I’m doubtful. I’m not sure what harm there is to “mining” every day, but the whole thing feels shady. The app claims that once the coin drops you won’t be able to mine anymore so now is the time to do so. I’m not convinced Pi will ever materialize.</p>\n\n<p>For now, I’ve mined every day for almost 3 months and have made 136 pi. How much is this worth you ask? Nothing. Nada. Zilch. If you believe the developers are really developing something, go for it, I guess. I see no harm in this app (do your own research) I just don’t see any benefit.</p>\n\n<p>Verdict for Pi: Not worth it.</p>\n\n<p>&#x200B;</p>\n\n<p>**Cointiply**</p>\n\n<p>What it is: It’s both an app and a website that offers free Bitcoin hourly. All you have to do is log in and fill out a captcha and you are rewarded. I tried to check back in hourly for a month. I’m going to say I averaged 5-6 times per day.</p>\n\n<p>Results: After one month I have made 2,483 in-app coins, worth .00000762 BTC, or $0.25 USD. The minimal withdrawal amount is 50,000 coins (30,000 if you withdraw to DOGE). At this rate it will take me 20 months to make a withdrawal. In that time I will have earned approximately $5 USD, which will then be converted into whatever the price of BTC is at that time. That is, if this site actually pays out and isn’t a scam. Anyone willing to wait 20 months to find out?</p>\n\n<p>Verdict for Cointiply: Not Worth it</p>\n\n<p>&#x200B;</p>\n\n<p>**Free Cypto/Faucet Apps**</p>\n\n<p>What it is: There’s a bunch of these apps (I have an android but I assume iPhones are the same) that claim to offer free crypto and/or to be faucets. I downloaded several and they are all essentially the same. I ended up using one called ‘Free Litecoin’ for a month to see how it went. Every hour you can log in and hot a button that spins and decides if you won free coins or not. I played an average of 5-6 times per day for a month and would say I usually won once per day. You can watch ads to earn additional spins, which, if I’m not mistaken, increased my chances of winning. As far as I can tell, all of these apps (and there are many of them) are essentially the same. It’s a randomized game that may or may not pay out every hour.</p>\n\n<p>Results: ‘Free Litecoin’ pays in Litoshi (the smallest unit of Litecoin). After one month I have made 14,855 Litoshi. You need 100,000 to withdraw. Bear in mind there are 100 million Litoshi on a litecoin. This means that at current trading value, I make approximately 29 cents Canadian each month in this app. It will take me more than 6 months to make a withdrawal, worth about $1.70 CAD. That is, assuming you actually can withdraw and this isn’t just a scam.</p>\n\n<p>Verdict for Free Crypto Apps: Not Worth It</p>\n</div><!-- SC_ON -->",
  "score": 3105,
  "permalink": "/r/CryptoCurrency/comments/nvcem8/i_tried_all_the_free_methods_of_gaining_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "nvcem8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404884253
}