{
  "author": "Georgy_K_Zhukov",
  "original_created_utc": 1657124925,
  "title": "AskHistorians, Mod Macros, and YOU: An Introduction to Our New Batch of Removal Notices",
  "created_utc": 1657136007,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello everyone,&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re a regular on the subreddit, you might notice some changes happening in mod interactions starting today! As most people know, this subreddit is &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/\"&gt;&lt;em&gt;aggressively&lt;/em&gt; moderated&lt;/a&gt; and comments are held to a &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/f7ffl8/rules_roundtable_ii_the_four_questions_what_does/\"&gt;very high standard&lt;/a&gt; in pursuit of our &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/f7fb8o/introducing_the_rules_roundtables_20_the/\"&gt;mission to provide a curated experience for high-effort contributions&lt;/a&gt;. While we don&amp;#39;t leave removal notices for every comment removal, for several reasons, we do have a variety of &amp;#39;Removal Macros&amp;#39; that we deploy for removals in various situations, which can run the gamut from blatant rules violations to responses which are trying hard, but &lt;em&gt;not quite there&lt;/em&gt;. &lt;/p&gt;\n\n&lt;p&gt;The Macros we have been using have been around fairly unchanged for some time now, and are fairly recognizable. I&amp;#39;m sure many regulars can recite the main ones from memory at this point. Rule violations come in many, many different manifestations though, so Macros have always been an attempt to cover as many possible variations with as few different Macros as possible. Over the years, we&amp;#39;ve made some tweaks here and there based on how responses to these warnings are taken, but there has not been any substantive change to them in ages. Over the past few months though, we&amp;#39;ve been putting on our thinking caps and considering how to revamp many of them from the ground up, and today we&amp;#39;ve started deploying the new batch of Macros. &lt;/p&gt;\n\n&lt;p&gt;This announcement is intended for a few reasons. The first is because, as members of this community too, we value &lt;em&gt;your&lt;/em&gt; input. We can spend hours and hours on these, have everyone read them front to back and back to front, and we &lt;em&gt;still&lt;/em&gt; might miss something, whether some stupid spelling error on the one hand, or some very unintended meaning on the other! If you see some of the Macros in the &amp;#39;wild&amp;#39; over the next few days, please feel free to drop some feedback about them in this thread, particularly as to whether you feel it does a good job conveying what you think we&amp;#39;re aiming for with it!&lt;/p&gt;\n\n&lt;p&gt;The second reason then, is to... &lt;em&gt;lay out what it is we&amp;#39;re aiming for&lt;/em&gt;. Our revamping of the Macros had two core aims. The first was to be a little more surgical in what Macros we had for which situations. While most of the specific Macros (such as for a Joke response) aren&amp;#39;t changed, our core Macros which are focused on the critical factors of an answer - Depth/Comprehensiveness, Familiarity with the Topic, Proper Source Use - have seen the old ones tossed out, and new ones brought in, which roughly doubled the number of deployable Macros for these circumstances. This allows us to be more specific in which Macro gets used for what kind of comment is being removed, which feeds into the second aim, of trying to have Macros which are more useful &lt;em&gt;for the user being responded to&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;With more variation between the Macros, this allows us to have Macros which are clearer for warnings that amount to &amp;quot;&lt;em&gt;a polite this sucks and you should feel bad for posting it&amp;quot;&lt;/em&gt; or &lt;em&gt;&amp;quot;Congratulations! You know this one fact, but that is clearly all you have to say here…&amp;quot;&lt;/em&gt;, and then on the other end of the spectrum, situations like &amp;quot;We don’t want to scare you off, but we do need to see you put in more effort!&amp;quot;, or somewhere in the middle with &lt;em&gt;&amp;quot;you’re technically correct but the onus is on you to show you know more about this than that brief factoid, man...&amp;quot;&lt;/em&gt;  (those were some of the working titles...). Our hope with this is especially on that latter end of the spectrum, with Macros that a) Better communicate specific issues b) Try to do so in an inviting way that doesn&amp;#39;t devalue the attempt to contribute even if it fell short and c) Clearly lay out how to get further information on the removal and how to revise it (Any &amp;#39;positive&amp;#39; Macro includes a pre-filled link to reach us via modmail).&lt;/p&gt;\n\n&lt;p&gt;Much of the work that moderators do is behind the scenes, whether the simple silent removals, or sending personalized question alerts to flairs and potential flairs, or interacting through modmail with a user who had a comment removed and giving them feedback. Outside of Meta threads, the interactions users see or have with a mod is almost always going to be through Macros. They are critical and necessary for us to be able to do this role, but it has its downsides in the impersonalization of those interactions. And while we simply &lt;em&gt;can&amp;#39;t&lt;/em&gt; shift things so that all removals are done custom, we &lt;em&gt;do&lt;/em&gt; want to do our best to approach them with balance. We pride ourselves for the reputation we&amp;#39;ve gained for strict moderation, but we don&amp;#39;t want that to translate into a sense of us being &lt;em&gt;unapproachable&lt;/em&gt; or even infallible, nor for those interactions to inherently feel like they are starting on the wrong foot. So as you see the new Macros in action beginning today, we hope that you will consider those factors and think about how the Macros work towards those goals.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;I won&amp;#39;t post &lt;em&gt;all&lt;/em&gt; the new Macros, but here is a smattering of them and their intended use cases:&lt;/p&gt;\n\n&lt;p&gt;No Depth, but Correct w Sources:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Thank you for your response, but unfortunately, we have had to remove it for now. A &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/f7fb8o/introducing_the_rules_roundtables_20_the/\"&gt;core tenet&lt;/a&gt; of the subreddit is that it is intended as a space not merely for a basic answer, but rather &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/f7ffl8/rules_roundtable_ii_the_four_questions_what_does/\"&gt;one which provides a deeper level of explanation on the topic and its broader context than is commonly found on other history subs&lt;/a&gt;. A response such as yours which offers some brief remarks and mentions sources can form the core of an answer &lt;a href=\"https://www.reddit.com/r/AskHistorians/wiki/rules#wiki_write_an_in-depth_answer\"&gt;but doesn’t meet the rules in-and-of-itself&lt;/a&gt;. &lt;/p&gt;\n\n&lt;p&gt;If you need any guidance to better understand what we are looking for in our requirements, please don’t hesitate to &lt;a href=\"https://www.reddit.com/message/compose?to=%2Fr%2FAskHistorians&amp;amp;subject=Inquiry%20About%20Revising%20My%20Response\"&gt;reach out to us via modmail&lt;/a&gt; to discuss what revisions more specifically would help let us restore the response! Thank you for your understanding.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;High Effort Post Which Has Some Serious Issues, Which Maybe Can Be Fixed If They Reach Out to Us to Discuss:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Thank you for your response. Unfortunately, we have had to remove it due to violations of &lt;a href=\"https://www.reddit.com/r/AskHistorians/wiki/rules#wiki_answers\"&gt;subreddit rules about answers providing an academic understanding of the topic&lt;/a&gt;. While we appreciate the effort you have put into this comment, there are nevertheless substantive issues with its content that reflect significant errors or misunderstandings of the topic at hand, &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/f7ffl8/rules_roundtable_ii_the_four_questions_what_does/\"&gt;which necessitated its removal&lt;/a&gt;. &lt;/p&gt;\n\n&lt;p&gt;If you are interested in discussing the issues, and remedies that might allow for reapproval, &lt;a href=\"https://www.reddit.com/message/compose?to=%2Fr%2FAskHistorians&amp;amp;subject=Inquiry%20About%20Revising%20My%20Response\"&gt;please reach out to us via modmail&lt;/a&gt;. Thank you for your understanding.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Someone Sharing That One Fact That They Know:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Thank you for your response. Unfortunately, we have had to remove it, as &lt;a href=\"https://www.reddit.com/r/AskHistorians/wiki/rules#wiki_write_an_in-depth_answer\"&gt;this subreddit is intended to be a space for in-depth and comprehensive answers from experts&lt;/a&gt;. Simply stating one or two facts related to the topic at hand does not meet that expectation. &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/f7ffl8/rules_roundtable_ii_the_four_questions_what_does/\"&gt;An answer needs to provide broader context and demonstrate your ability to engage with the topic&lt;/a&gt;, rather than repeat some brief information. &lt;/p&gt;\n\n&lt;p&gt;Before contributing again, please take the time to familiarize yourself with the &lt;a href=\"https://www.reddit.com/r/AskHistorians/wiki/rules\"&gt;subreddit rules&lt;/a&gt; and &lt;a href=\"https://www.reddit.com/r/AskHistorians/wiki/faq/meta#wiki_rules_discussion\"&gt;expectations&lt;/a&gt; for an answer.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Short, Wrong, No Sources&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Your comment has been removed due to violations of the &lt;a href=\"https://www.reddit.com/r/AskHistorians/wiki/rules\"&gt;subreddit’s rules&lt;/a&gt;. We expect answers to provide &lt;a href=\"https://www.reddit.com/r/AskHistorians/wiki/rules#wiki_write_an_in-depth_answer\"&gt;in-depth and comprehensive insight&lt;/a&gt; insight into the topic at hand and to &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/f7ffl8/rules_roundtable_ii_the_four_questions_what_does/\"&gt;be free of significant errors or misunderstandings&lt;/a&gt; while doing so. Before contributing again, please take the time to better familiarize yourself with the &lt;a href=\"https://www.reddit.com/r/AskHistorians/wiki/rules\"&gt;subreddit rules&lt;/a&gt; and &lt;a href=\"https://www.reddit.com/r/AskHistorians/wiki/faq/meta#wiki_rules_discussion\"&gt;expectations&lt;/a&gt; for an answer.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/vsu2gd/askhistorians_mod_macros_and_you_an_introduction/",
  "subreddit": "AskHistorians",
  "id": "vsu2gd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hello everyone,\n\nIf you're a regular on the subreddit, you might notice some changes happening in\nmod interactions starting today! As most people know, this subreddit is\naggressively…"
}