{
  "author": "themedsarenotworking",
  "original_created_utc": 1656431561,
  "title": "Do people genuinely not find most people attractive? (this is about rating people's appearances - FYI)",
  "created_utc": 1656475841,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a 23 year old male. I recently had an awkward conversation with some mates... They were going through girls our age on tinder and having a laugh, and chatting away. The topic of rating people came up. I rated people consistently a lot higher than they did in terms of physical appeal. &lt;/p&gt;\n\n&lt;p&gt;My question that I&amp;#39;d never want to ask is: I (male) think most people of the gender I&amp;#39;m attracted to (female) have an appealing appearance. Whereas, they were somewhat like 50% were appealing to a degree...&lt;/p&gt;\n\n&lt;p&gt;Statistically, the 50% sounds right. An average of mates found the average person appealing... so does that mean I&amp;#39;m below average? I found 90% (approx) appealing... I was called thirsty. told i needed to &amp;#39;J-O&amp;#39; more, and weird (like I see &amp;#39;imperfections&amp;#39; as features) etc... and whilst yes I am lonely, it shouldn&amp;#39;t skew it that much..? should it? It has made me question whether I need to just lose virginity to get that experience or whether my suspicions that I am in the lower 10-20% that you could rate in terms of looks. I&amp;#39;m not upset at them. I&amp;#39;m just upset with myself and confused. If you want specific example of what they found &amp;#39;weird&amp;#39; I found it more attractive for people to have &amp;#39;imperfections&amp;#39; such as &amp;#39;buck teeth&amp;#39;, acne, scars, or slightly overweight. Also please be blunt - I&amp;#39;m on a self-improvement journey with my psychologist.&lt;/p&gt;\n\n&lt;p&gt;TLDR: Is it normal/ok to find 90% of the gender you&amp;#39;re attracted to appealing?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/vmqgtz/do_people_genuinely_not_find_most_people/",
  "subreddit": "TooAfraidToAsk",
  "id": "vmqgtz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm a 23 year old male. I recently had an awkward conversation with some\nmates... They were going through girls our age on tinder and having a laugh, and\nchatting away. The topic of rating people came up. I rated people consistently a\nlot higher than they did in terms of physical appeal.\n\nMy…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は23歳の男性です。最近、友人たちと気まずい会話をしました。\n気まずい思いをしました。彼らはtinderで同年代の女の子を調べて、笑いながらおしゃべりをしていました。\n談笑していました。その時、人を評価する話題になりました。私は一貫して人を評価し\n肉体的な魅力で彼らを上回ってた\n\n私の...",
      "title": "純粋にほとんどの人が魅力を感じないのでしょうか？(これは外見の評価についてです。）"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个23岁的男性。最近我和一些朋友进行了一次尴尬的谈话\n尴尬的对话... 他们在Tinder上浏览与我们年龄相仿的女孩，并大笑起来。\n聊得很开心。谈到了给人打分的话题。我给别人的评分一直是A\n在身体吸引力方面比他们高很多。\n\n我的...",
      "title": "人们真的不觉得大多数人有吸引力吗？(这是关于对人们的外表进行评级--仅供参考)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個23歲的男性。最近我和一些朋友進行了一次尷尬的談話\n尷尬的對話... 他們在Tinder上瀏覽與我們年齡相仿的女孩，並大笑起來。\n聊得很開心。談到了給人打分的話題。我給別人的評分一直是A\n在身體吸引力方面比他們高很多。\n\n我的...",
      "title": "人們真的不覺得大多數人有吸引力嗎？(這是關於對人們的外表進行評級--僅供參考)"
    }
  ]
}