{
  "author": "rareliquid",
  "the_new_excerpt": "Hi Everyone, below is a post about Lemonade, which has fallen 30%+ over the past\nfew days. There’s a lot of hype around the stock, but based on my diligence, I\nthink investors should not buy the dip.\n\nQ4 2020 Financial Results - The Good Stuff\n\n * I want to start this post actually with the…",
  "original_created_utc": 1614882543,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，下面是一篇关于柠檬水的文章，在过去的时间里，柠檬水跌了30%以上。\n几天的时间。有很多炒作的股票，但根据我的勤奋，我。\n认为投资者不应该买跌。\n\n2020年第四季度财报--好戏连台\n\n * 我想在这篇文章的开头，其实是...",
      "title": "柠檬水尽职调查帖--不要买沾沾自喜"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，下面是一篇關於檸檬水的文章，在過去的時間裏，檸檬水跌了30%以上。\n幾天的時間。有很多炒作的股票，但根據我的勤奮，我。\n認爲投資者不應該買跌。\n\n2020年第四季度財報--好戲連臺\n\n * 我想在這篇文章的開頭，其實是...",
      "title": "檸檬水盡職調查帖--不要買沾沾自喜"
    }
  ],
  "title": "Lemonade Due Diligence Post - DON'T Buy the Dip",
  "created_utc": 1614900147,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi Everyone, below is a post about Lemonade, which has fallen 30%+ over the past few days. There’s a lot of hype around the stock, but based on my diligence, I think investors should <strong>not</strong> buy the dip.</p>\n\n<p><strong>Q4 2020 Financial Results - The Good Stuff</strong></p>\n\n<ul>\n<li>I want to start this post actually with the positives for the company from the latest earnings. Numbers are from their <a href=\"https://www.bamsec.com/filing/169142121000019?cik=1691421\">latest shareholder letter</a></li>\n<li>From 2019-2020, Lemonade’s <strong>in force premium, increased by 87%</strong> from $114 million to $213 million\n\n<ul>\n<li>This was driven by <strong>higher premiums per customer ($213 in Q4 2020 vs $177 in Q4 2019)</strong> and an impressive <strong>56% year-over-year increase in number of customers (which now sits at ~1 million)</strong>\n\n<ul>\n<li>If you’re not familiar with insurance, <strong>premiums</strong> are just the amount customers pay each month, so if you pay $10 a month for renter&#39;s insurance, your monthly premium is $10</li>\n<li>The <strong>in force premium is annualized,</strong> so in our previous example, your in force premium would be $10 a month times 12 months which equates to $120 for your in force premium</li>\n</ul></li>\n<li>Lemonade <strong>started off as a disruptive rentals insurance company</strong> but has since then launched new products including <strong>homeowners, pets, and life insurance</strong> and this is how the company has been able to increase the premium it charges per customer by cross-selling its products to the same customer</li>\n</ul></li>\n<li>The company also grew their <strong>gross earned premium to $50 million</strong> which represents a 92% year over year increase\n\n<ul>\n<li>Gross earned premium represents the amount of the in force premium Lemonade collects once the service is fully delivered</li>\n<li>So for example, if a customer pays $10 on January 1st for 1 month of rental insurance, Lemonade&#39;s gross earned premium is $0 and only becomes $10 once the full month of January has passed</li>\n</ul></li>\n<li>The company’s <strong>annual gross loss ratio also fell from 79% to 71%</strong> (Q4 2019 to Q4 2020), signaling better operating margins</li>\n<li>Basically, Lemonade has experienced an increasing customer base, has been charging more per customer, leading to higher in force premiums</li>\n<li>In addition to this, management strongly hinted that it’s working on a new product that will launch later this year, and it’s most likely going to be car insurance (watch towards the end of this <a href=\"https://www.cnbc.com/video/2021/03/02/lemonade-ceo-on-the-companys-quarterly-earnings-and-new-offerings.html\">video from CNBC</a> with LMND’s CEO)\n\n<ul>\n<li>This could be a significant revenue driver for the company and I do like that Lemonade is expanding aggressively into multiple products as long as the company can grow its customer base</li>\n</ul></li>\n</ul>\n\n<p><strong>Q4 2020 Financial Results - The Bad Stuff</strong></p>\n\n<ul>\n<li>The first thing I need to do is set the stage by explaining the <strong>company&#39;s sky-high valuation to explain why the stock plummeted 16% after earnings</strong>\n\n<ul>\n<li>Right before earnings, the company was trading at $132 per share, which gave the company a market cap of $8.5BN. Adjusting for the company’s cash of $1.2BN (incorporates company’s latest follow-on offering), the company had an <strong>enterprise value of $7.2BN</strong></li>\n<li>In the most recent quarter, the company guided to a midpoint of $115.5 million in 2021 revenue. <strong>This meant Lemonade was trading at a 63x 2021 revenue multiple,</strong> which is higher than pretty much all of the fastest growing software companies in the world\n\n<ul>\n<li>Here’s a <a href=\"https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F2172588b-b60a-427d-9815-f523942b2183_1145x631.png\">list</a> of some of the fastest growing software companies in the world for reference</li>\n</ul></li>\n<li>But that’s the thing, Lemonade is <strong>NOT</strong> a software company. Many hype investors forget that it’s an <strong>insurance company f</strong>irst and foremost\n\n<ul>\n<li>The most obvious proof of this is in the company’s <strong>gross margins</strong> which jumped in the latest quarter to 37%, but for the <strong>full year of 2020 was at a very sub-par 26%</strong> (vs. 70%+ for a good software company)</li>\n</ul></li>\n</ul></li>\n<li>Given that Lemonade is trading at a revenue multiple higher than pretty much all of the best software companies, <strong>Lemonade really needed to crush earnings in order to propel its stock further.</strong> It did not:\n\n<ul>\n<li>While customers have increased year over year by 56%, if you take a <a href=\"https://content.bamsec.com/0001691421-21-000019/q42020lmndshareholderlet027.jpg\">closer look at the quarter by quarter data,</a> Lemonade added ~60K new customers, which is the smallest increase in the past 2 years\n\n<ul>\n<li>And <a href=\"https://content.bamsec.com/0001691421-21-000019/q42020lmndshareholderlet021.jpg\">it’s not like the company is spending any less in marketing</a>, which is pretty much in line with previous quarters</li>\n<li>The reduction in customer growth is something I would really worry about as a Lemonade investor because that is what is the true driver of the company’s growth</li>\n</ul></li>\n<li>In addition, to all of this, about <strong>a quarter of Lemonade’s customers are in Texas,</strong> which as you probably know was recently hit with a huge power outage\n\n<ul>\n<li>In the latest earnings call, management stated that there will be a spike in its gross loss ratio but no material affects to its financials, which I personally find a little hard to believe</li>\n</ul></li>\n<li>Some may also point to the company’s <a href=\"https://content.bamsec.com/0001691421-21-000019/q42020lmndshareholderlet034.jpg\">improvement in its operating expense margin</a> when compared to its gross earned premium and it’s true that it’s gone from negative 156% to negative 89% (lol)\n\n<ul>\n<li>But the $44.5 million spent in Q4 2020 earned the company a total of just $7.5 million in gross profit (pretty terrible unit economics)</li>\n<li>Personally, I’m okay with companies during their growth stages spending tons of cash and being unprofitable, but given Lemonade’s slowing customer growth and poor gross and operating margins, Lemonade’s insanely high valuation cannot be justified</li>\n</ul></li>\n</ul></li>\n<li>Combined with all this, I do have to mention that the stock is also largely down the recent jump in bond yields, which punishes growth stocks, especially the ones overvalued</li>\n</ul>\n\n<p><strong>What I Think Lemonade’s Stock Price Should Be</strong></p>\n\n<ul>\n<li>If we take a look at some of the <a href=\"https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F2172588b-b60a-427d-9815-f523942b2183_1145x631.png\">fastest growing tech stocks</a> in the world, of which all are growing quickly and have gross margins in the 70s or above, then I think it’s safe to say that at maximum, Lemonade deserves to be trading at a 35x next twelve months (i.e. 2021) sales which I think is still generous\n\n<ul>\n<li><strong>If we assume a 35x 2021 sales multiple,</strong> then given LMND’s guidance of 2021 revenue to $115.5mm (midpoint of $114-$117mm), then we get to an enterprise value of ~$4BN\n\n<ul>\n<li>After we add back $1.2BN in cash, we get to an estimated market cap of $5.3BN which when you divide by Lemonade’s fully diluted shares comes out to a <strong>$82.68 share price which represents a ~13% drop</strong> (LMND currently trades at $93 at time of post)</li>\n</ul></li>\n<li>But, I think 35x is a really generous multiple given that the company’s growth is in question and has poor margins and believe <strong>the company should be truly trading closer to 20x,</strong> which gives us a share price of <strong>$55.57</strong></li>\n</ul></li>\n<li>Now do I think the stock will go down to $55? I think if bond yields continue to push higher and we have a big tech correction, I definitely think it’s possible but probably not likely given how irrational the market has been these past few years\n\n<ul>\n<li>Also, any reversal in bond yields will likely push the stock up but I believe over time, the stock will fall to a more reasonable level into the ~70s and so I personally do not recommend buying the dip</li>\n</ul></li>\n</ul>\n\n<p><strong>TLDR:</strong> LMND is growing impressively but has terrible unit economics and valuation is far too ahead of itself (even with the recent dip).</p>\n</div><!-- SC_ON -->",
  "score": 78,
  "permalink": "/r/stocks/comments/lxrko3/lemonade_due_diligence_post_dont_buy_the_dip/",
  "subreddit": "stocks",
  "id": "lxrko3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542575857
}