{
  "author": "chickennuggetarian",
  "original_created_utc": 1630535573,
  "title": "How much concern should there actually be that “Roe v Wade” and other progressive Supreme Court rulings are going to go away?",
  "created_utc": 1630582132,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Texas’ abortion bill is clearly a heinous infringement on established rights…and yet the whole thing just seems to carry on. The Supreme Court always talks about being against politicization, but it’s very clear that the justices at this point rule along ideological lines and no longer care about interpreting the Constitution. </p>\n\n<p>On top of my concern for women’s rights, I worry that other past rulings like gay marriage will be called into question. And many of the communities I’m apart of worry about the same thing. </p>\n\n<p>How valid are these concerns from the perspective of people who may be more informed?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/pg4qoj/how_much_concern_should_there_actually_be_that/",
  "subreddit": "TooAfraidToAsk",
  "id": "pg4qoj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Texas’ abortion bill is clearly a heinous infringement on established rights…and\nyet the whole thing just seems to carry on. The Supreme Court always talks about\nbeing against politicization, but it’s very clear that the justices at this\npoint rule along ideological lines and no longer care about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "テキサス州の人工妊娠中絶法案は、明らかに確立された権利を侵害する凶悪なものです...そして\nそれなのに、全体としてはまだ続いているようです。最高裁はいつも、政治的な影響を受けないようにと話しています。\nしかし、この時点で判事たちがイデオロギーに基づいて判断していることは明らかです。\nイデオロギーに基づいて判断していることは明らかで、もはや...",
      "title": "実際、「Roe v Wade」をはじめとする進歩的な最高裁判決がなくなることに、どれほどの懸念を抱くべきでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "德州的堕胎法案显然是对既定权利的一种令人发指的侵犯......而\n然而，整件事似乎仍在继续。最高法院总是在谈论\n反对政治化，但很明显，大法官们在这一点上是按照意识形态进行裁决的，不再关心\n但很明显的是，在这一点上，大法官们是按照意识形态的路线进行裁决的，而不再关心...",
      "title": "对于 \"罗伊诉韦德 \"和其他进步的最高法院裁决会消失，实际上应该有多少担忧？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "德州的墮胎法案顯然是對既定權利的一種令人髮指的侵犯......而\n然而，整件事似乎仍在繼續。最高法院總是在談論\n反對政治化，但很明顯，大法官們在這一點上是按照意識形態進行裁決的，不再關心\n但很明顯的是，在這一點上，大法官們是按照意識形態的路線進行裁決的，而不再關心...",
      "title": "對於 \"羅伊訴韋德 \"和其他進步的最高法院裁決會消失，實際上應該有多少擔憂？"
    }
  ]
}