{
  "author": "Beautiful-Suspect-58",
  "original_created_utc": 1635049169,
  "title": "Why is racism towards South Asian people not addressed/confronted?",
  "created_utc": 1635075118,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am a South Asian (Indian) woman and have experienced a lot of casual racism on the internet and have been called a “curry-muncher” and been stereotyped against pretty hard and no one seems to address this!? Not even a little mention about this in Tv-series or something which is the least I could ask for. I’ve been too afraid to say anything about this because of the racist responses I would get but I don’t care anymore, I want this issue out in the open.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/qekrf6/why_is_racism_towards_south_asian_people_not/",
  "subreddit": "TooAfraidToAsk",
  "id": "qekrf6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am a South Asian (Indian) woman and have experienced a lot of casual racism on\nthe internet and have been called a “curry-muncher” and been stereotyped against\npretty hard and no one seems to address this!? Not even a little mention about\nthis in Tv-series or something which is the least I could…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は南アジア（インド）出身の女性ですが、インターネット上で多くのカジュアルな人種差別を経験してきました。\n私は南アジア（インド）の女性ですが、インターネット上で多くのカジュアルな人種差別を経験してきました。\nかなりハードで、誰もこれを取り上げていないようですが！？テレビシリーズなどでも、このことについて少しも触れられていません。\nテレビシリーズか何かで、このことについて少しでも触れていないのは、せめてもの救いです。",
      "title": "なぜ南アジアの人々に対する人種差別が取り上げられないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一名南亚（印度）妇女，在互联网上经历了很多随意的种族主义。\n我是一名南亚（印度）妇女，在互联网上经历了许多不经意的种族主义，被称为 \"咖喱制造者\"，并被定型为反对派。\n但似乎没有人去解决这个问题！？甚至没有人提到\n在电视系列或其他方面提到这一点，这是我至少可以......",
      "title": "为什么针对南亚人的种族主义没有得到解决/正视？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一名南亞（印度）婦女，在互聯網上經歷了很多隨意的種族主義。\n我是一名南亞（印度）婦女，在互聯網上經歷了許多不經意的種族主義，被稱爲 \"咖喱製造者\"，並被定型爲反對派。\n但似乎沒有人去解決這個問題！？甚至沒有人提到\n在電視系列或其他方面提到這一點，這是我至少可以......",
      "title": "爲什麼針對南亞人的種族主義沒有得到解決/正視？"
    }
  ]
}