{
  "author": "ini0n",
  "the_new_excerpt": "https://www.theguardian.com/us-news/2021/jun/03/biden-bans-us-investment-chinese-military-tech-surveillance\n\nJoe Biden has signed an executive order that bans American entities from\ninvesting in dozens of Chinese companies with alleged ties to defense or\nsurveillance technology sectors.\n\nIn a move…",
  "original_created_utc": 1622779726,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://www.theguardian.com/us-news/2021/jun/03/biden-bans-us-investment-chinese-military-tech-surveillance\n\nジョー・バイデンは、米国企業の中国企業への投資を禁止する大統領令に署名しました。\nアメリカの企業が、防衛や監視技術に関連するとされる数十社の中国企業への投資を禁止する大統領令に署名しました。\n投資を禁止する大統領令に署名しました。\n\nこれは、防衛や監視技術分野に関連するとされる中国企業数十社への投資を禁止するものです。",
      "title": "バイデン氏、中国の軍事・技術監視分野への米国の投資を禁止"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.theguardian.com/us-news/2021/jun/03/biden-bans-us-investment-chinese-military-tech-surveillance\n\n乔-拜登签署了一项行政命令，禁止美国实体投资于数十家据称与国防有关的中国公司。\n禁止美国实体投资于据称与国防或监控技术部门有联系的几十家中国公司。\n监视技术部门。\n\n在此举中，...",
      "title": "拜登禁止美国在中国军事和科技监控领域投资"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.theguardian.com/us-news/2021/jun/03/biden-bans-us-investment-chinese-military-tech-surveillance\n\n喬-拜登簽署了一項行政命令，禁止美國實體投資於數十家據稱與國防有關的中國公司。\n禁止美國實體投資於據稱與國防或監控技術部門有聯繫的幾十家中國公司。\n監視技術部門。\n\n在此舉中，...",
      "title": "拜登禁止美國在中國軍事和科技監控領域投資"
    }
  ],
  "title": "Biden bans US investment in Chinese military and tech surveillance sectors",
  "created_utc": 1622790061,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.theguardian.com/us-news/2021/jun/03/biden-bans-us-investment-chinese-military-tech-surveillance\">https://www.theguardian.com/us-news/2021/jun/03/biden-bans-us-investment-chinese-military-tech-surveillance</a></p>\n\n<p>Joe Biden has signed an executive order that bans American entities from investing in dozens of Chinese companies with alleged ties to defense or surveillance technology sectors.</p>\n\n<p>In a move that his administration says will expand the scope of a legally flawed Trump-era order, the US treasury will enforce and update on a “rolling basis” the new ban list of about 59 companies.</p>\n\n<p>It also bars buying or selling publicly traded securities in target companies, and replaces an earlier list from the defense department, senior administration officials told reporters.</p>\n\n<p>Chips with everything: how one Taiwanese company drives the world economy\nRead more\nThe order prevents US investment from supporting the Chinese military-industrial complex, as well as military, intelligence, and security research and development programs, Biden said in the order.</p>\n\n<p>“In addition, I find that the use of Chinese surveillance technology outside [China] and the development or use of Chinese surveillance technology to facilitate repression or serious human rights abuse constitute unusual and extraordinary threats,” Biden said.</p>\n\n<p>A White House fact sheet on the order said the policy would take effect for those companies listed on 2 August.</p>\n\n<p>Major Chinese firms included on the previous defense department list were also placed on the updated list, including Aviation Industry Corp of China (AVIC), China Mobile Communications Group, China National Offshore Oil Corp (CNOOC), Hangzhou Hikvision Digital Technology, Huawei Technologies and Semiconductor Manufacturing International Corp (SMIC).</p>\n\n<p>SMIC is key to China’s national drive to boost its domestic chip sector.</p>\n\n<p>“We fully expect that in the months ahead … we’ll be adding additional companies to the new executive order’s restrictions,” one of the senior officials said.</p>\n\n<p>A second official told reporters that the inclusion of Chinese surveillance technology companies expanded the scope of the Trump administration’s initial order last year, which the White House argues was carelessly drafted, leaving it open to court challenges.</p>\n\n<p>The president has been reviewing a number of aspects of US policy toward China, and his administration had extended a deadline for implementation set by Donald Trump’s order while it crafted its new policy framework.</p>\n\n<p>Apple uses more suppliers from China than Taiwan for first time, data shows\nRead more\nThe move is part of Biden’s broader series of steps to counter China, including reinforcing US alliances and pursuing large domestic investments to bolster American economic competitiveness, amid increasingly sour relations between the world’s two most powerful countries.</p>\n\n<p>Biden’s Indo-Pacific policy coordinator, Kurt Campbell, said last month that a period of engagement with China had come to an end and that the dominant paradigm in bilateral ties going forward would be one of competition.</p>\n\n<p>Senior officials said the treasury would give guidance later on what the scope of surveillance technology means, including whether companies are facilitating “repression or serious human rights abuses”.</p>\n\n<p>“We really want to make sure that any future prohibitions are on legally solid ground. So, our first listings really reflect that,” a second senior administration official said.</p>\n\n<p>Advertisement</p>\n\n<p>Investors would have time to “unwind” investments, a third official said.</p>\n\n<p>The new list provided few surprises for investors looking to see if they need to unload even more Chinese stocks and bonds.</p>\n\n<p>But some previously identified companies, such as Commercial Aircraft Corp of China (COMAC), which is spearheading Chinese efforts to compete with Boeing and Airbus, as well as two companies that had challenged the ban in court, Gowin Semiconductor Corp and Luokung Technology Corp, were not included.</p>\n\n<p>In May, a judge signed an order removing the designation on Chinese mobile phone maker Xiaomi, which was among the more high-profile Chinese technology companies that the Trump administration targeted for alleged ties to China’s military.</p>\n</div><!-- SC_ON -->",
  "score": 4201,
  "permalink": "/r/investing/comments/nrw7cv/biden_bans_us_investment_in_chinese_military_and/",
  "subreddit": "investing",
  "id": "nrw7cv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404885455
}