{
  "author": "Uberdriver_janis",
  "the_new_excerpt": "My brother called me today and wanted to talk to me about Crypto. He is not a\ntechnical person more the complete opposite (Hippie). He knew I am into\ntechnology and I was talking about Crypto myself.\n\nSo today he called me and told me that he'd most likely certain that he wants to\ninvest himself.…",
  "original_created_utc": 1614112920,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我弟弟今天给我打电话，想和我谈谈加密技术。他不是一个\n技术人士更完全相反（嬉皮士）。他知道我是喜欢\n技术，而我自己也在谈论Crypto。\n\n所以今天他打电话给我，告诉我，他很有可能确定他想要\n投资自己....",
      "title": "\"如果价格在下降，现在买是不是很明智？\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我弟弟今天給我打電話，想和我談談加密技術。他不是一個\n技術人士更完全相反（嬉皮士）。他知道我是喜歡\n技術，而我自己也在談論Crypto。\n\n所以今天他打電話給我，告訴我，他很有可能確定他想要\n投資自己....",
      "title": "\"如果價格在下降，現在買是不是很明智？\""
    }
  ],
  "title": "\"If the price is dropping, wouldn't it be smart to buy now?\"",
  "created_utc": 1614138019,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My brother called me today and wanted to talk to me about Crypto. He is not a technical person more the complete opposite (Hippie). He knew I am into technology and I was talking about Crypto myself.</p>\n\n<p>So today he called me and told me that he&#39;d most likely certain that he wants to invest himself. Not because he believes in the tech as he doesn&#39;t understand it, but mostly because he wants to say fuck you to the central banks and gevernments. \nI told him we all do. So I talked a bit to him and told him the risks and that&#39;s it not guaranteed to make him money. He understood everything and said he&#39;ll think about it a little bit. </p>\n\n<p>Then I told him the current situation and that everything is dropping right now, told him this could go on for longer maybe even years. Without me saying anything he said</p>\n\n<p>&quot;But when the price is dropping right now, wouldnt that be a perfect buying opportunity?&quot;</p>\n\n<p>And I never was prouder</p>\n</div><!-- SC_ON -->",
  "score": 332,
  "permalink": "/r/CryptoCurrency/comments/lqshky/if_the_price_is_dropping_wouldnt_it_be_smart_to/",
  "subreddit": "CryptoCurrency",
  "id": "lqshky",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332880688
}