{
  "author": "Raybre125",
  "original_created_utc": 1630595854,
  "title": "Where could you hide a sex toy, where your lil sibling won't dare look?",
  "created_utc": 1630607315,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My mom and I just fight yesterday, and along the process admitted that the only reason why she knows that I have a sex toy (which had nothing to do with the conversation) in the first place was that my little brother found it. He likes to look at my things and there is nothing that I can do (anymore) to stop him. He found 1 out of 5 and my mom already ditch it, and because he likes to see our mom mad, he is looking for more stuff to get me in trouble, I&#39;m planning to move in a couple of months, but I NEED a hiding spot!!</p>\n</div><!-- SC_ON -->",
  "score": 180,
  "permalink": "/r/TooAfraidToAsk/comments/pgjy8t/where_could_you_hide_a_sex_toy_where_your_lil/",
  "subreddit": "TooAfraidToAsk",
  "id": "pgjy8t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My mom and I just fight yesterday, and along the process admitted that the only\nreason why she knows that I have a sex toy (which had nothing to do with the\nconversation) in the first place was that my little brother found it. He likes\nto look at my things and there is nothing that I can do…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日、母と喧嘩をしたのですが、その過程で、母が私がセックスグッズを持っていることを知っているのは\nそもそも私が性的玩具を持っていることを母が知っているのは、（会話とは関係ないが\nそもそも私が性的玩具を持っていることを知っているのは、弟がそれを見つけたからだと認めました。彼は私の物を見るのが好きで\n彼は私の物を見るのが好きで、私には何もできません...。",
      "title": "子供の兄弟があえて見ないように、どこにセックスグッズを隠すことができるでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我妈妈和我昨天刚吵了一架，在这个过程中承认，她知道我有性玩具的唯一原因是\n她知道我有一个性玩具的唯一原因（这与谈话无关\n谈话无关）的唯一原因是我的小弟弟发现了它。他喜欢\n他喜欢看我的东西，而我却无能为力......",
      "title": "你能把性玩具藏在哪里，让你的小兄弟姐妹不敢看？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我媽媽和我昨天剛吵了一架，在這個過程中承認，她知道我有性玩具的唯一原因是\n她知道我有一個性玩具的唯一原因（這與談話無關\n談話無關）的唯一原因是我的小弟弟發現了它。他喜歡\n他喜歡看我的東西，而我卻無能爲力......",
      "title": "你能把性玩具藏在哪裏，讓你的小兄弟姐妹不敢看？"
    }
  ]
}