{
  "author": "RedactedxRedacted",
  "original_created_utc": 1634694805,
  "title": "I first bought Bitcoin at $62,208",
  "created_utc": 1634707840,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As the title says, I first bought Bitcoin at $62,208 on April 17 of this year. </p>\n\n<p>And as we all already know Crypto as a whole started to rapidly plummet shortly there after causing me to be in quite the hole (yes I have quite the timing)</p>\n\n<p>Since then I&#39;ve DCA&#39;d and lowered my cost basis and now I am up over 50% on my total investment. </p>\n\n<p>This is the power of patience and investing through DCA. </p>\n\n<p>Wanted to share this for all those that may just be starting out and buying at these prices. It doesn&#39;t matter if it goes up or down tomorrow or the next day. All that matters is that it goes up in the long term and you will be making a pretty penny.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/qbqbnl/i_first_bought_bitcoin_at_62208/",
  "subreddit": "CryptoCurrency",
  "id": "qbqbnl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As the title says, I first bought Bitcoin at $62,208 on April 17 of this year.\n\nAnd as we all already know Crypto as a whole started to rapidly plummet shortly\nthere after causing me to be in quite the hole (yes I have quite the timing)\n\nSince then I've DCA'd and lowered my cost basis and now I am…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルにあるように、私は今年の4月17日に62,208ドルで初めてビットコインを購入しました。\n\nご存知の通り、その後すぐに暗号全体が急落し、私は大損しました。\nその直後に暗号全体が急落し、私は大ピンチに陥りました（そう、私はかなりのタイミングの良さを持っているのです）。\n\nそれ以来、私はDCAを実行してコストベースを下げ、今では...。",
      "title": "ビットコインを最初に買ったのは62,208円でした。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说，我在今年4月17日以62,208美元的价格首次买入比特币。\n\n而我们都已经知道，加密货币作为一个整体在不久之后开始迅速暴跌。\n之后导致我陷入了相当大的困境（是的，我有相当好的时机）。\n\n从那时起，我就开始了DCA，并降低了我的成本基础，现在我已经...",
      "title": "我第一次买入比特币的价格是62,208美元"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說，我在今年4月17日以62,208美元的價格首次買入比特幣。\n\n而我們都已經知道，加密貨幣作爲一個整體在不久之後開始迅速暴跌。\n之後導致我陷入了相當大的困境（是的，我有相當好的時機）。\n\n從那時起，我就開始了DCA，並降低了我的成本基礎，現在我已經...",
      "title": "我第一次買入比特幣的價格是62,208美元"
    }
  ]
}