{
  "author": "guiltlesshonesty_84",
  "original_created_utc": 1648661572,
  "title": "What is your opinion on play-to-earn crypto games?",
  "created_utc": 1648679962,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The traditional gaming industry as we know it is being disrupted by GameFi projects and play-to-earn games. These blockchain-based monetizations of the gaming experience are effectively play-to-earn crypto games. Players play to gain prizes rather than to win, which is what sets them apart from typical games. The ability to compensate players for their time and effort is, unsurprisingly, at the root of the quick rise in popularity of these play-to-earn games, often known as GameFi. Who wouldn&amp;#39;t want to make money while having a good time? The future of gaming is PlayToEarn. While playing games, users must earn NFTs or crypto tokens!&lt;/p&gt;\n\n&lt;p&gt;I have been on crypto royale(a coin that may be obtained through blockchain-based gaming. Users can join a game by joining a battlefield, and the last person standing wins a little amount of money in the form of bitcoin.), &lt;a href=\"https://godsunchained.com/\"&gt;Gods Unchained&lt;/a&gt;(is a truly competitive trading card game based on the blockchain that rewards you for playing. Players must outsmart their opponents by constructing formidable decks and employing combat techniques.), &lt;a href=\"https://axieinfinity.com/\"&gt;Axie infinity&lt;/a&gt;(In the field of NFT gaming, Axie Infinity is the undisputed leader. NFTs represent in-game digital assets such as the Axie animals. As previously stated, these cryptographically unique tokens confer ownership and allow players to exchange axis for real money on the game&amp;#39;s marketplace.), &lt;a href=\"https://splinterlands.com/\"&gt;splinterlands&lt;/a&gt;(Winning battles is the most common way to acquire DEC. DEC is awarded to you according to your level, your opponent&amp;#39;s level, and your capture rate in each combat. As you win, your capture rate decreases, lowering your payout, but it progressively replenishes between wins) and &lt;a href=\"https://engntoken.com/\"&gt;ENGN&lt;/a&gt; which i have recently grown much interest on(When a typical game is played, it responds to the player&amp;#39;s inputs and creates reactions within the game world using the language it was written in and the game mechanics engine it was built on. The outputs are displayed either graphically or as achievements in some way whenever the player has won a round, mission, or finished a task. ENGN now kicks in. ENGN translates the user&amp;#39;s blockchain data into data that the game environment can interpret. ENGN identifies the game environment&amp;#39;s outputs and converts them to data that the blockchain can comprehend.)&lt;/p&gt;\n\n&lt;p&gt;What are your opinions on this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 405,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/_MGSlTzwXd_CYp-nuSAZflFWpQ1AmRY1cJt55uyVCdU.jpg?auto=webp&amp;s=2b07fb69dc401dd67243dbfbdb1b1dc92bd0598b",
          "width": 1920,
          "height": 1081
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/_MGSlTzwXd_CYp-nuSAZflFWpQ1AmRY1cJt55uyVCdU.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=b5a4e86bc22d4f664eb785e6e07a4203e4c12ef0",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/_MGSlTzwXd_CYp-nuSAZflFWpQ1AmRY1cJt55uyVCdU.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=5584afe9442df9399d4be0f1e425eda3e392a862",
            "width": 216,
            "height": 121
          },
          {
            "url": "https://external-preview.redd.it/_MGSlTzwXd_CYp-nuSAZflFWpQ1AmRY1cJt55uyVCdU.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=a7553125d06e47359b4b8b78f823b778899ea775",
            "width": 320,
            "height": 180
          },
          {
            "url": "https://external-preview.redd.it/_MGSlTzwXd_CYp-nuSAZflFWpQ1AmRY1cJt55uyVCdU.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=207a469d229697c51d394728878e90e0e7efd480",
            "width": 640,
            "height": 360
          },
          {
            "url": "https://external-preview.redd.it/_MGSlTzwXd_CYp-nuSAZflFWpQ1AmRY1cJt55uyVCdU.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=0e6a11e83b4fc8ec4f6c27de591958373d530c4d",
            "width": 960,
            "height": 540
          },
          {
            "url": "https://external-preview.redd.it/_MGSlTzwXd_CYp-nuSAZflFWpQ1AmRY1cJt55uyVCdU.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=7d84879b79f692d7167675cf564230452f30640d",
            "width": 1080,
            "height": 608
          }
        ],
        "variants": {},
        "id": "mpbH8_T7Lf-nvOu-w-hTwl-ZiuwHsS2QPulkCBzft1o"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/tsbqwk/what_is_your_opinion_on_playtoearn_crypto_games/",
  "subreddit": "CryptoCurrency",
  "id": "tsbqwk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The traditional gaming industry as we know it is being disrupted by GameFi\nprojects and play-to-earn games. These blockchain-based monetizations of the\ngaming experience are effectively play-to-earn crypto games. Players play to\ngain prizes rather than to win, which is what sets them apart from…"
}