{
  "author": "Anhowa123",
  "the_new_excerpt": "TLDR: Following the recent DOGE and XRP situations, and our influx of new users\n- I have decided to put together a quick guide on what a pump and dump is, how\nto spot it, how to avoid it, and what to do should you fall for one. This is\njust my thoughts on the issue and by no means exhaustive. I…",
  "original_created_utc": 1612296313,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "TLDR：在最近的DOGE和XRP情况下，以及我们的新用户涌入之后\n- 我决定把一个快速指南放在一起，关于什么是泵和倾倒，如何。\n识别它，如何避免它，以及当你上当时该怎么做。这就是\n只是我对这个问题的想法，绝不是详尽的。I…",
      "title": "随着最近新用户的涌入--我决定发布一个关于泵和倾倒计划的指南--它们是什么，如何避免它们，以及如何从它们身上继续前进。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TLDR：在最近的DOGE和XRP情況下，以及我們的新用戶湧入之後\n- 我決定把一個快速指南放在一起，關於什麼是泵和傾倒，如何。\n識別它，如何避免它，以及當你上當時該怎麼做。這就是\n只是我對這個問題的想法，絕不是詳盡的。I…",
      "title": "隨着最近新用戶的湧入--我決定發佈一個關於泵和傾倒計劃的指南--它們是什麼，如何避免它們，以及如何從它們身上繼續前進。"
    }
  ],
  "title": "With the recent influx of new users - I decided to post a guide to Pump and Dump schemes - what they are, how to avoid them and how to move on from them",
  "created_utc": 1612315814,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>TLDR:</strong> Following the recent DOGE and XRP situations, and our influx of new users - I have decided to put together a quick guide on what a pump and dump is, how to spot it, how to avoid it, and what to do should you fall for one. This is just my thoughts on the issue and by no means exhaustive. I welcome comments and my biggest recommendation if you fell for one of these schemes is to accept it, address your emotions, seek support - either by those around you or here if you feel more comfortable, then commit to educating yourself. </p>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<h1><strong>Summary:</strong></h1>\n\n<p><strong>A pump and dump scheme</strong> is where a group of people pitch a coin (or stock) to other people to spike short term volume, and therefore the price, in order to profit from selling their own supply at the higher price to the newer investors.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>How to spot a PnD:</strong></p>\n\n<ul>\n<li><p>Promises of huge gains</p></li>\n<li><p>Forced short time frames to make a decision</p></li>\n<li><p>No discussion of risk - or questioning permitted</p></li>\n<li><p>The opportunity finds you, you don&#39;t find the opportunity</p></li>\n<li><p>Comparison to recent success stories - e.g. GME (dubious whether this will even be a success long term for individuals)</p></li>\n</ul>\n\n<p>&nbsp;\n<strong>Tips to avoid</strong> - see below but the main two for me are: </p>\n\n<ul>\n<li><p>Recognise emotional decision making, in yourself, and when it comes from others (people you may normally trust). You need to recognise this behaviour, and cut it out at source. To step back and breathe.</p></li>\n<li><p>Ask yourself, what are they selling me on, and why? If they find you, you are being sold. That is all there is to it.</p></li>\n</ul>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<p>&nbsp;</p>\n\n<h1><strong>What is a Pump and Dump scheme?</strong></h1>\n\n<p>&nbsp;\nA Pump and Dump scheme (PnD from here on in), is where an investor, or group of investors promote a coin they already hold (or are purchasing) in order to cause positive sentiment and the price to rise. At this point these investors will then sell their coins to the newer investors, causing the price to crash and leave the people who fell for the PnD with a large potential loss, or coins which are now worth a lot less than the price they paid for them.</p>\n\n<p>These are not new and were traditionally done via phone call. If you have watched the Wolf of Wall Street, or similar films about penny stocks, you have seen this stuff in action. If you are buying, you are the retail investor who gets taken for a ride.</p>\n\n<p>With the recent influx of new users to this site, and following the PnD schemes surrounding Doge and XRP, lets take a look at how to spot a PnD scheme</p>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<h1><strong>How to spot a PnD scheme?</strong></h1>\n\n<p>&nbsp;</p>\n\n<ul>\n<li><p><strong>Promises of huge gains, in a short amount of time.</strong> If it sounds too good to be true, it is. In crypto (and stocks) if someone is talking to you about something, they are selling you their position. If it is positive - they likely own it, if it negative - they either want prices to fall or they hold a competitor. Ask yourself, why someone would be going out their way to tell you something is a once in a lifetime opportunity? If it was, they would be keeping it secret and accumulating themselves. These people are salesman, and you are the one buying the bullshit</p></li>\n<li><p>Linked to the above there is often a <strong>time element - &#39;get in quick, or you will miss it&#39;</strong>, they are relying on your impulsive decision making to jump in - they are manipulating you to over ride the logical part of your brain which makes decisions based on information and context</p></li>\n<li><p>There is <strong>no discussion of any potential risks or downsides</strong>, and you are removed from groups or harassed for asking basic questions - this is a hive mind at work, and you are being censored from raising any concern or legitimate question.</p></li>\n<li><p>There may be reference to &#39;how this time is different&#39;, or it <strong>plays on recent successes</strong> which are in no way comparable - e.g Game Stop - anyone who paused for a second would realise why not only was financially the short squeeze on GME completely different, but also the moral stand point was too. XRP, for example, is a centralised system which enriches the founders beyond belief. Yet these groups tried to ride the sentiment of GME to convince others to join - as a show of rebellion and alliance.</p></li>\n<li><p><strong>Social media storms are cooked up</strong>, it seems like out of nowhere this is all anyone can talk about - when has this ever proven a successful decision? Once everyone is talking about it, you are already too late. You may not lose money, if you are lucky, but you are still the one being duped. Again this is feeding on emotion and Fear of Missing Out. There will be groups created and ran by mods who run them like cults - no talk of anything but price going up is accepted.</p></li>\n<li><p><strong>There is a time or plan attached</strong> - e.g. Pump and Hold at 8:30. For the love of god, if this is the case, sell before then. All the leaders of these groups will have done. All of these public announcements are done again to create legitimacy and make you feel at ease - as a collective.</p></li>\n<li><p>Generally any concept of <strong>&#39;we are in this together&#39;</strong>, coming from a group trying to actively push up the price of something short term = PnD. You are not in this together, markets are competitive - they are survival of the fittest whether you like it or not. They want your money, when you listen to them - you are basically offering to hand it over. People invest to make money, especially when the entire premise is pushing a price up to get rich. They do not want what is good for you, they are using you and they will take your money if you allow them to. They are telling you, because you are the opportunity - not the coin.</p></li>\n<li><p><strong>Be aware, people telling you to hold and buy more, are using you.</strong> They want you to push the price back up so they can sell. If you are in these groups - on social media, be aware you may be talking to bots, or at the least people who are trying to dump on you. When it drops, get out.</p></li>\n</ul>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<p>&nbsp;</p>\n\n<h1><strong>How to avoid PnDs in future</strong></h1>\n\n<p>&nbsp;</p>\n\n<ul>\n<li><p><strong>&#39;Why are they telling me this?&#39;</strong> - this is the first and main question to ask yourself. What does the person sharing the information have to gain from telling me? In this case - you invest and push the price up, allowing them to make greater profit. Understand why they would be sharing details with you - if it such a great thing, why are they sharing it?</p></li>\n<li><p><strong>if it is a friend telling you, ask for more information</strong> - why it is doing well, what the plan is etc - if they can&#39;t explain it properly, this is a big red flag and they likely have fallen for it too.</p></li>\n<li><p><strong>Look out for how someone talks to you about it</strong> - is it emotionally driven, does it make you excited? scared to miss out? - This is exactly when you need to step back, breathe and ask yourself if you are thinking correctly. Emotional decision making is not a good thing here, and then ask if they are intentionally trying to get an emotional reaction out of you? (see the above - FOMO, get rich quick etc)</p></li>\n<li><p><strong>Is there any room for nuance?</strong> Are you able to discuss the potential cons or risk? If you are laughed at, or harassed, others are told to ignore you (he won&#39;t be getting rich, weak hands, pathetic seller) - this is a huge sign that you are investing in something where no other thoughts are allowed. The reason for this, once you are out the bubble - logic returns and you see the smoke and mirrors for what they are. PnD groups work like a cult, only one form of thinking is allowed, everything else is censored.</p></li>\n<li><p><strong>Did this come out of nowhere, do I even know anything about this?</strong> If you don&#39;t know anything about it, except it makes money, don&#39;t invest in it. This is a terrible decision for two reasons. Firstly, and most obviously, you have asymmetric information - you have no idea why and what you are buying, therefore can&#39;t make an informed decision - only an emotional one. Equally, this kind of thing pushes panicked, emotional selling. When you don&#39;t know fundamental reasons why you invest in something, when the price dips you will sell. Why? because when your brain asks you the question &#39;shit it is dropping, what do we do?!&#39; - your logical brain won&#39;t have an answer, because you never gave it the information to form one. This second part is more relevant to regular investments, not PnDs of course, but is worth bearing in mind before you invest in anything.</p></li>\n<li><p><strong>Was the coin relatively stagnant, or has it dipped recently?</strong> PnDs typically target coins which haven&#39;t moved much recently, or have lower trading volume, this allows for a much easier spiking of the price due to a small change in demand equalling a big change in price. If you look at the charts and it was doing nothing until this big flurry of activity - you are being taken for a ride.</p></li>\n<li><p><strong>Look for the news</strong>, if it is pumping, don&#39;t listen to people inside the group - search for reasons why something is pumping. If you can&#39;t find anything of value, there probably isn&#39;t anything, and you are gambling on emotional decisions.</p></li>\n<li><p><strong>The opportunity finds you, you don&#39;t find the opportunity.</strong> Getting rich off &#39;undervalued&#39; coins, or finding a hidden gem is not easy. They are hidden for a reason. If someone is coming to you with this, remember they are selling. You are buying.</p></li>\n<li><p><strong>If someone does approach you, talk to someone else outside of the bubble</strong> - find another group e.g. <a href=\"/r/CC\">r/CC</a>, or other investors - talk to them, get outside perspective before investing. </p></li>\n<li><p><strong>look for examples of populist sentiment</strong>. Do you hear things about an other? - e.g. haters, those missing out who are jealous. Are you made to feel like you are part of a special group? The ones with insider information? This is a lie, it is very very common manipulation within populist movements, cults etc - to create a narrative of an other to entrench tribalism within the group. This is done to make you switch your brain off, to rule on emotion.</p></li>\n<li><p><strong>is there a recent comparable story that was successful?</strong> e.g. GME (yes this isn&#39;t the same at all in reality, but the story being sold is - or at least plays on the hype of GME). If there is, you are being played. The real opportunity, just like the hidden gem, is the first one. When people tell you this is happening again, they are simply using the positive news from one case and applying it to their own - often because it lacks any actual, real, tangible reason for succeeding or being a good investment.</p></li>\n</ul>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<p>&nbsp;</p>\n\n<h1><strong>I fell for a PnD, what next?</strong></h1>\n\n<p>&nbsp;</p>\n\n<p><strong>Have you sold yet - No? Are you in profit?</strong> Sell. Whilst you still can. Greed will tell you not to, and perhaps you can eek out a little more money. But you are gambling, and gambling extremely high risk against people trying to take all your money.  </p>\n\n<p>&nbsp;</p>\n\n<p><strong>Yes, you have sold. Did you make a profit? Yes</strong> - great. You are still a an idiot, just a lucky one. Tell yourself that. There is a difference between opportunist traders taking advantage of PnDs and someone getting lucky and getting out before it collapses. Do not confuse the two. The first group know what they are doing (and they may still lose, but they are aware of the real risk). You are fucking lucky. Don&#39;t do it again. So count your blessings, go through the same process of learning about PnDs and begin to understand why you fell for it, how to avoid it in future and realise you are up - you won. Don&#39;t go back in, you are asking to lose.  </p>\n\n<p>&nbsp;</p>\n\n<p><strong>Yes you have sold? Did you make profit? No?</strong> Ok, this is normal - 90% + of people doing this will end up in the same situation. </p>\n\n<p>&nbsp;</p>\n\n<ul>\n<li><p><strong>Recognise and accept your mistake</strong>. Do not feel ashamed of it, it is ok. You were played, it happens to all of us in our lives at some point. </p></li>\n<li><p><strong>Step away</strong> from whatever device you used to invest. DO NOT ATTEMPT TO WIN IT BACK RIGHT AWAY. You will most likely make things worse, investing again on emotions - even worse emotions now, shame, anger, disbelief.</p></li>\n<li><p><strong>Talk</strong> to the important people in your life if you feel comfortable, if not, come here or to other anonymous groups for support. It is important to share what happened, to vent emotionally whatever it is you feel.</p></li>\n<li><p><strong>Realise it is only money</strong>, even if gambled way more than you should have done, long term you will get out of this. Focus on other areas of your life for the time being - emotional investment, fulfilment and development - seek out things which may centre to your emotions again, whatever that may be - getting out in nature, cooking, reading, adrenaline sports - whatever the shit you need, do it. </p></li>\n<li><p><strong>Consider who, if anyone needs to know.</strong> Did you borrow from you and your wife&#39;s joint account? Accept a loan from a mate? These people need to know the truth. Do not hide it and hope to win it back. Tell the truth. They deserve it. </p></li>\n<li><p><strong>Do not repeat the same actions</strong>, if you want to win long term from this - you need a different approach. Step away from the high stakes casino and figure out long term strategies to make money. </p></li>\n<li><p><strong>Learn to diversify and manage risk</strong>. You are taking a huge gamble going all in on something - even if it isn&#39;t a scam, you need to protect yourself through diversifying your investments. Get rich quick schemes are the fastest way to lose money.</p></li>\n<li><p><strong>Educate yourself on these behaviours</strong> - I would recommend <em>&#39;Thinking Fast and Slow&#39;</em> by Daniel Kahnemann as a personal favourite. This book helps to look at and address the biases that make up our emotional decision making, and learn how to recognise these and instead &#39;think slow&#39;. You won&#39;t regret reading it.</p></li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 456,
  "permalink": "/r/CryptoCurrency/comments/lb4zsv/with_the_recent_influx_of_new_users_i_decided_to/",
  "subreddit": "CryptoCurrency",
  "id": "lb4zsv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518530887
}