{
  "author": "chocomilk_cow_",
  "the_new_excerpt": "In other words, was rape not regarded as a \"big deal\" during those times? Or,\nwas it just a normal thing for women to be enslaved and used specifically for\nsexual purposes as a form of punishment?\n\nIs there a way to determine the likelihood for a woman to be sexually assaulted\nin Ancient Greece or…",
  "original_created_utc": 1619429810,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "つまり、その時代にはレイプは「大したことない」と思われていたのではないか？あるいは。\n罰として女性を奴隷にして性的に利用することは普通のことだったのか？\n罰として女性を奴隷にして性的に利用するのは普通のことだったのでしょうか？\n\n女性が性的暴行を受ける可能性を判断する方法はありますか？\n古代ギリシャや...",
      "title": "古代ギリシャやローマの時代に生きていた女性として、当時の奴隷制度による性的暴行（特に男性から女性への）が当たり前のように行われていたために、私は常に性的暴行を受ける恐怖にさらされていたでしょうか？それが問題でなくなったのはいつ頃でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "换句话说，在那个时代，强奸不被视为 \"大问题 \"吗？或者。\n妇女被奴役并被专门用于性目的作为一种惩罚形式，这只是一件正常的事情？\n作为一种惩罚形式的性行为？\n\n有什么方法可以确定一个女人在古希腊或者......在古希腊，被性侵犯的可能性？\n在古希腊或...",
      "title": "作为一个生活在古希腊或古罗马时期的女性，我是否会因为那些时代的奴隶制导致的性侵犯（特别是男性对女性）的常态而一直生活在被性侵犯的恐惧中？什么时候它不再成为一个较小的问题了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "換句話說，在那個時代，強姦不被視爲 \"大問題 \"嗎？或者。\n婦女被奴役並被專門用於性目的作爲一種懲罰形式，這只是一件正常的事情？\n作爲一種懲罰形式的性行爲？\n\n有什麼方法可以確定一個女人在古希臘或者......在古希臘，被性侵犯的可能性？\n在古希臘或...",
      "title": "作爲一個生活在古希臘或古羅馬時期的女性，我是否會因爲那些時代的奴隸制導致的性侵犯（特別是男性對女性）的常態而一直生活在被性侵犯的恐懼中？什麼時候它不再成爲一個較小的問題了？"
    }
  ],
  "title": "As a woman living during the time periods of ancient Greece or Rome, would I live in constant fear of being sexually assaulted due to the normality of sexual assault (specifically men against women) through slavery at those times? When did it stop becoming less of an issue?",
  "created_utc": 1619443029,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In other words, was rape not regarded as a &quot;big deal&quot; during those times? Or, was it just a normal thing for women to be enslaved and used specifically for sexual purposes as a form of punishment?</p>\n\n<p>Is there a  way to determine the likelihood for a woman to be sexually assaulted in Ancient Greece or Rome and compare that to the present-day numbers?</p>\n</div><!-- SC_ON -->",
  "score": 131,
  "permalink": "/r/AskHistorians/comments/mytv38/as_a_woman_living_during_the_time_periods_of/",
  "subreddit": "AskHistorians",
  "id": "mytv38",
  "is_self": true,
  "media": null,
  "is_video": false
}