{
  "author": "Whiterosie4812",
  "original_created_utc": 1643101201,
  "title": "Can you hear music in your head?",
  "created_utc": 1643111572,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was just talking to my partner about the song &amp;quot;we don&amp;#39;t talk about Bruno&amp;quot; and about how I was trying to work out in my head what key it is in (I figured it out, C minor) and was talking about hearing music in my head and he has told me that he doesn&amp;#39;t hear music in his head, even if he&amp;#39;s thinking about a song. Am I the weird one here? Does anyone else hear music in their head or have I somehow reached the age of 30 without realising I&amp;#39;m strange?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 121,
  "permalink": "/r/NoStupidQuestions/comments/sc9e22/can_you_hear_music_in_your_head/",
  "subreddit": "NoStupidQuestions",
  "id": "sc9e22",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was just talking to my partner about the song \"we don't talk about Bruno\" and\nabout how I was trying to work out in my head what key it is in (I figured it\nout, C minor) and was talking about hearing music in my head and he has told me\nthat he doesn't hear music in his head, even if he's thinking…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちょうどパートナーと \"we don't talk about Bruno \"という曲について話していて\nこの曲のキーが何であるか、頭の中で考えていたことについて（わかったのは\nハ短調）、頭の中で音楽が聞こえるという話をしていたら、彼から\n頭の中で考えても音楽が聞こえないという...。",
      "title": "頭の中で音楽が聴こえるか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在和我的伙伴谈论 \"我们不谈布鲁诺 \"这首歌，以及我如何在脑海中找出它的调子。\n我正和我的伙伴谈论 \"我们谈论布鲁诺 \"这首歌，以及我如何在脑海中想出这首歌的调性（我想出了\n我想出来了，是C小调），并谈到了在我脑中听到的音乐，他告诉我\n他告诉我，他的脑子里没有音乐，即使他在思考......",
      "title": "你能在你的脑海中听到音乐吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在和我的夥伴談論 \"我們不談布魯諾 \"這首歌，以及我如何在腦海中找出它的調子。\n我正和我的夥伴談論 \"我們談論布魯諾 \"這首歌，以及我如何在腦海中想出這首歌的調性（我想出了\n我想出來了，是C小調），並談到了在我腦中聽到的音樂，他告訴我\n他告訴我，他的腦子裏沒有音樂，即使他在思考......",
      "title": "你能在你的腦海中聽到音樂嗎？"
    }
  ]
}