{
  "author": "danielrp00",
  "original_created_utc": 1635608423,
  "title": "How do people actually find shitcoins before they do a x5000?",
  "created_utc": 1635619557,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been lurking coinmarketcap checking some random shitcoins and they all share one thing: their price is flat in the chart and then it skyrockets. I saw a shitcoin token that did a x100.000 in less than 2 hours. My question is, how the fuck do people find these tokens before the pump starts?</p>\n\n<p>I know that most of them dont have enough liquidity for taking profits but shit, if I put 100$ in a shitcoin and I can get 1000$ back even if it says that I have 35 trillion dollars I&#39;m happy with it. I know there are a lot of pump and dump groups out there and that they are scams. I&#39;ve been into crypto for a long time now and I have a very decent portfolio with solid projects such as BTC and ETH. But hodling is boring as fuck, I need to find a token I can put 20$ in and experience some emotions watching the price roller coaster because I&#39;m dead inside and nothing brings me joy on these days.</p>\n</div><!-- SC_ON -->",
  "score": 236,
  "permalink": "/r/CryptoCurrency/comments/qj4149/how_do_people_actually_find_shitcoins_before_they/",
  "subreddit": "CryptoCurrency",
  "id": "qj4149",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been lurking coinmarketcap checking some random shitcoins and they all\nshare one thing: their price is flat in the chart and then it skyrockets. I saw\na shitcoin token that did a x100.000 in less than 2 hours. My question is, how\nthe fuck do people find these tokens before the pump starts?\n\nI…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はcoinmarketcapに潜んでいて、いくつかのランダムなクソコインをチェックしていましたが、それらはすべて1つの共通点があります。\n共通しているのは、チャート上で価格が横ばいになった後、急上昇することです。私が見たのは\n2時間以内に100,000倍になったシットコイン・トークンを見ました。疑問なのは、どうやって\n人々はこれらのトークンを見つけるのでしょうか？\n\nI...",
      "title": "実際、みんなx5000する前にどうやってクソコインを見つけてるの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直潜伏在coinmarketcap检查一些随机的狗屎币，它们都\n都有一个共同点：他们的价格在图表中是平的，然后就暴涨了。我看到\n一个狗屎币的代币在不到2个小时内就涨了100.000倍。我的问题是，人们是如何\n人们是如何在泵开始之前找到这些代币的？\n\nI...",
      "title": "人们在做x5000之前究竟是如何找到屎币的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直潛伏在coinmarketcap檢查一些隨機的狗屎幣，它們都\n都有一個共同點：他們的價格在圖表中是平的，然後就暴漲了。我看到\n一個狗屎幣的代幣在不到2個小時內就漲了100.000倍。我的問題是，人們是如何\n人們是如何在泵開始之前找到這些代幣的？\n\nI...",
      "title": "人們在做x5000之前究竟是如何找到屎幣的？"
    }
  ]
}