{
  "author": "Sweet-Zookeepergame",
  "the_new_excerpt": "Hello everybody,\n\nI started investing in a moment, which was very unusual. It was April 2020. No\nmatter what I bought, it soared almost 100% in just a few weeks.\n\nNow, being relatively new to investing, the last 3-4 weeks of volatility changed\nmy newcomer mindset from „buy, keep for a few days, sell…",
  "original_created_utc": 1615131404,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好\n\n我开始投资的那一刻，很不寻常。那是2020年4月。没有\n不管我买了什么，都在短短几周内飙升了近100%。\n\n现在，作为一个比较新的投资新手，过去3-4周的波动改变了\n我的新手心态从 \"买入，养几天，卖出......",
      "title": "你现在会投资哪些价值/成长股？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好\n\n我開始投資的那一刻，很不尋常。那是2020年4月。沒有\n不管我買了什麼，都在短短几周內飆升了近100%。\n\n現在，作爲一個比較新的投資新手，過去3-4周的波動改變了\n我的新手心態從 \"買入，養幾天，賣出......",
      "title": "你現在會投資哪些價值/成長股？"
    }
  ],
  "title": "Which value/growth stocks would you invest in NOW ?",
  "created_utc": 1615150422,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everybody,</p>\n\n<p>I started investing in a moment, which was very unusual. It was April 2020. No matter what I bought, it soared almost 100% in just a few weeks.</p>\n\n<p>Now, being relatively new to investing, the last 3-4 weeks of volatility changed my newcomer mindset from „buy, keep for a few days, sell with profit“ to „choose carefully“. </p>\n\n<p>As we all found out, a lot of the overhyped companies are or were massively overvalued, as the current correction is showing us. Therefore I want to „repair“ my portfolio and concentrate only on good, healthy long-term growth stocks, which can survive the test of time.</p>\n\n<p>In my process of researching, I have 6 favorites so far: SQUARE, PAYPAL, MASTERCARD, VISA, SHOPIFY, AMAZON.</p>\n\n<p>What do you think about them and what would you choose?</p>\n\n<p>Thank you for your valuable input.</p>\n</div><!-- SC_ON -->",
  "score": 61,
  "permalink": "/r/stocks/comments/lzszdx/which_valuegrowth_stocks_would_you_invest_in_now/",
  "subreddit": "stocks",
  "id": "lzszdx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542576980
}