{
  "author": "xavierwest888",
  "original_created_utc": 1643562432,
  "title": "Trying to explain crypto to nocoiners is like in the film Idiocracy trying to explain that water is for crops and not just toilets.",
  "created_utc": 1643603625,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Title says it all, it is so hard to explain to anyone about crypto. They all just treat you with deep suspicion and repeat the same pre-programmed lines back to you from the banking and media industries.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/crpg9advuue81.png?width=1000&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=75450b3b30bb7e8a565ea9434ba9727ecdd613e1\"&gt;You guys handle your own currency transactions? You mean that magic internet money? &lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s like, you want decent interest returns for holding your money and lower fees on transactions? Yes! Then stop using the middle man of a bank and start using crypto and stop letting your money get eroded by fees and inflation........But banks are safe for my money, I have a savings account with 0.0000000% interest!&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/qq08n4p1wue81.png?width=1280&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=4e772b740c4853c817c94ec895393357a2f7ec4d\"&gt;Banks! It&amp;#39;s got what you crave! It&amp;#39;s got interest!*&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t have a savings account with a bank you have lies, they give you a few $$s here and there while they are making huge investments out of your money AND the inflation is actually depleting your savings account even more money. They should be called deflation accounts and not savings accounts!&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/b7ns8hupwue81.png?width=1274&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=e8ac93cfdb9a993d6171e5c6aa2bf20e33b3063f\"&gt;Yeah we decided not to have any children because we cannot afford to now that we let all our money deflate to near zero value instead of investing it in the future of finance&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Of course I have to add not to dump ALL that you have into the nearest shitcoin and wait for &amp;#39;those lambos&amp;#39; to arrive but people that aren&amp;#39;t invested at all in crypto or who paper hand out at the first dip are going to seriously regret it down the road! Those that become their own banks and handle their own finance are going to have significantly more wealth the longer we go while those that let the middle men of banking horde their money will find they have nothing left!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 306,
  "permalink": "/r/CryptoCurrency/comments/sgdlnc/trying_to_explain_crypto_to_nocoiners_is_like_in/",
  "subreddit": "CryptoCurrency",
  "id": "sgdlnc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Title says it all, it is so hard to explain to anyone about crypto. They all\njust treat you with deep suspicion and repeat the same pre-programmed lines back\nto you from the banking and media industries.\n\n\n\nYou guys handle your own currency transactions? You mean that magic…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルが全てを物語っています。暗号について誰かに説明するのはとても難しいです。彼らは皆\nただ、深い疑念を持って接し、あらかじめプログラムされた同じ台詞を繰り返すだけです。\n銀行やメディア業界から言われたことです。\n\n\n\nあなた方は自分の通貨取引を扱っているのですか？つまり、その魔法の...",
      "title": "暗号をノコイナーに説明しようとするのは、映画『イディオクラシー』で、水は作物のためにあるのであって、トイレのためだけではないことを説明しようとするようなものです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题说明了一切，向任何人解释加密货币是如此困难。他们都\n都对你深表怀疑，并重复同样的预设台词。\n你的银行和媒体行业的预设台词。\n\n\n\n你们处理自己的货币交易？你是说那个神奇...",
      "title": "试图将加密货币解释给Nocoiners就像电影《白痴》中试图解释水是用来种庄稼的，而不仅仅是用来上厕所的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題說明了一切，向任何人解釋加密貨幣是如此困難。他們都\n都對你深表懷疑，並重復同樣的預設臺詞。\n你的銀行和媒體行業的預設臺詞。\n\n\n\n你們處理自己的貨幣交易？你是說那個神奇...",
      "title": "試圖將加密貨幣解釋給Nocoiners就像電影《白癡》中試圖解釋水是用來種莊稼的，而不僅僅是用來上廁所的。"
    }
  ]
}