{
  "author": "milomcfuggin",
  "original_created_utc": 1640526203,
  "title": "Do teens still have posters?",
  "created_utc": 1640544907,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I never had any kids and I’m almost 50 so I have no idea what &lt;em&gt;Kids These Days&lt;/em&gt;™ do. Are posters still a thing? Reason I ask is I saw a SportsCenter tweet about one basketball player putting another basketball player “on a poster.” For those who do not follow the basketballs, this means the former player dunked viciously on the latter player, usually with the first player making an expression like &amp;gt;:O and the second one being more like (:o and the implication is that this scene could, in theory, be captured and marketed as a poster for youths to put on their bedroom walls. It just made me wonder if the term is outdated. Like if it shouldn’t be replaced with like “GIF’D” something.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/NoStupidQuestions/comments/rox6oe/do_teens_still_have_posters/",
  "subreddit": "NoStupidQuestions",
  "id": "rox6oe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I never had any kids and I’m almost 50 so I have no idea what Kids These Days™\ndo. Are posters still a thing? Reason I ask is I saw a SportsCenter tweet about\none basketball player putting another basketball player “on a poster.” For those\nwho do not follow the basketballs, this means the former…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は子供を持ったことがなく、もうすぐ50歳になるので、「Kids These Days™」のことは全くわかりません。\nする。ポスターってまだあるんですか？なぜかというと、SportsCenterのツイートで見たのですが\nあるバスケットボール選手が、他のバスケットボール選手を「ポスターに」貼り付けた。そのような方のために\nバスケを知らない人なら、これは前者...",
      "title": "10代はまだポスターがある？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从来没有过任何孩子，而且我已经快50岁了，所以我不知道现在的孩子们都在干什么？\n做什么。海报仍然是一种东西吗？我问这个问题的原因是，我看到体育中心的一条推文说\n一个篮球运动员把另一个篮球运动员 \"放在海报上\"。对于那些\n不关注篮球运动的人来说，这意味着前者...",
      "title": "青少年仍然有海报吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從來沒有過任何孩子，而且我已經快50歲了，所以我不知道現在的孩子們都在幹什麼？\n做什麼。海報仍然是一種東西嗎？我問這個問題的原因是，我看到體育中心的一條推文說\n一個籃球運動員把另一個籃球運動員 \"放在海報上\"。對於那些\n不關注籃球運動的人來說，這意味着前者...",
      "title": "青少年仍然有海報嗎？"
    }
  ]
}