{
  "author": "Nuewim",
  "original_created_utc": 1636194419,
  "title": "I you want to gamble into random shitcoin put 10$ into it, not half of your life savings.",
  "created_utc": 1636205575,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I will never understand why some people put few k $ or even much more in some random shitcoin. Some of them even go all in one coin and ignore everything else, cause they think it will make them multimilionaires. It is terrible idea to do it. I am risking 10/20$ if I gamble on shitcoins or memecoins ( also not more than 10% of my portfolio). I like it, cause at worst case I lose 10/20$ and at best I will find next x100 or x1000 coin. I would never put everything in it, like unfortunately many people do. If you have few k$ or more then invest in safe coins,  divide it into BTC, ETH and some altcoins. At least you do not risk they will be rug pulled or go down -99%.</p>\n\n<p>I think those people wake up one day, accidentaly read about some shitcoin in the internet and decide it is good to put everything they have into it. And later they act suprised if coin is scam, rugpull or just go down like most coins do. Sometimes of course it work. But either oerson that put few k are milionaires, so they do not risk much or they had dumb luck. Many people YOLO their homes or lifesavings into shiba over last few months. They are rich as hell now, but it doesn&#39;t change that they acted like gambling addicts or idiots. For every dumb luck milionaire is hundred dumb people that lost everything.\nAnd no, no one in crypto will feel any empathy if you will do anything like that. We saw it too many times. It is natural selection. If you are bad investor or have no experience you should learn more, not put more money. It should be obvious for anyone.</p>\n\n<p>I understand sometimes we are curious about some coin or have good feelings about it without any reason. Doing this instead of proper DYOR is bad strategy in crypto, but if you really want to check what will happen invest 10/20$. In worst case you will learn a lesson  to never listen to hour feelings when you invest. Or you will be lucky. If you will be lucky it doesn&#39;t mean you should put more money into it. No one know future, everyone would be rich if we could predict  future profits.</p>\n</div><!-- SC_ON -->",
  "score": 310,
  "permalink": "/r/CryptoCurrency/comments/qnxjei/i_you_want_to_gamble_into_random_shitcoin_put_10/",
  "subreddit": "CryptoCurrency",
  "id": "qnxjei",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I will never understand why some people put few k $ or even much more in some\nrandom shitcoin. Some of them even go all in one coin and ignore everything\nelse, cause they think it will make them multimilionaires. It is terrible idea\nto do it. I am risking 10/20$ if I gamble on shitcoins or memecoins…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、ある人々が数千ドル、あるいはそれ以上の金額を、ランダムなクソコインに\n適当なコインに入れてしまうのか理解できません。中には1つのコインに全てを注ぎ込み、他の全てを無視してしまう人もいます。\nそれが億万長者になれると思っているからだ。それは恐ろしい考えです。\nしてはいけません。糞コインやメムコインに賭けると、10/20$のリスクを負うことになります...。",
      "title": "あなたがランダムなクソコインに賭けたいなら、10ドルを賭けてください、人生の貯蓄の半分ではなく。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我永远不明白为什么有些人把几千美元甚至更多的钱放在一些\n随机的狗屎币。他们中的一些人甚至把所有的钱都放在一个币上，而忽略了其他的东西。\n因为他们认为这将使他们成为千万富翁。这是一个可怕的想法\n这样做。如果我在屎币或美墨币上赌博，我将冒10/20美元的风险......",
      "title": "如果你想赌博到随机的狗屎币，那就投入10美元，而不是你一半的生活储蓄。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我永遠不明白爲什麼有些人把幾千美元甚至更多的錢放在一些\n隨機的狗屎幣。他們中的一些人甚至把所有的錢都放在一個幣上，而忽略了其他的東西。\n因爲他們認爲這將使他們成爲千萬富翁。這是一個可怕的想法\n這樣做。如果我在屎幣或美墨幣上賭博，我將冒10/20美元的風險......",
      "title": "如果你想賭博到隨機的狗屎幣，那就投入10美元，而不是你一半的生活儲蓄。"
    }
  ]
}