{
  "author": "rockitman12",
  "original_created_utc": 1625204195,
  "title": "Parents of Reddit: How would you prove that you are your child's parent, if they suddenly threw a tantrum in public and exclaimed \"You're not my dad/mom! I don't know you!\" ??",
  "created_utc": 1625250860,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First off, I&#39;m a guy. I&#39;m sure this would apply to women/mothers as well, but I have read enough &quot;I can&#39;t take my kid to the playground without getting stares&quot; by men to know that people often assume the worst of us.</p>\n\n<p>Anyway! I have nephews, but no kids of my own. So I don&#39;t know all the secrets of being a parent. What I do know is that some kids are monsters. I could definitely see some bratty 6-yr old kid throwing a tantrum in public (store, park, whatever) and then exclaiming &quot;you&#39;re not my dad/mom! I don&#39;t know you! Leave me alone!&quot; or something like that, because they know that words like that can get you in shit. They just don&#39;t realize how big of shit.</p>\n\n<p>So now some concerned employee/customer/stranger has gotten themselves involved. WTF do you do!? Do you get a certificate of ownership when you have a kid or something? A secret branding mark on their butt? How do you prove to a stranger that this child is your offspring or you are responsible for them? How do you prove the same to an officer if things escalate?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/oc3pt6/parents_of_reddit_how_would_you_prove_that_you/",
  "subreddit": "NoStupidQuestions",
  "id": "oc3pt6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "First off, I'm a guy. I'm sure this would apply to women/mothers as well, but I\nhave read enough \"I can't take my kid to the playground without getting stares\"\nby men to know that people often assume the worst of us.\n\nAnyway! I have nephews, but no kids of my own. So I don't know all the secrets\nof…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず、私は男です。これは女性/母親にも当てはまると思いますが、私は\n視線を浴びずに子供を遊び場に連れて行くことができない」という男性の声をたくさん読んできました。\n男性が書いた「子供を公園に連れて行くと睨まれる」という記事を何度も読んだことがあります。\n\nとにかく、私は甥っ子がいます。私には甥っ子がいますが、自分の子供はいません。だから、私はすべての秘密を知りません。\nその...",
      "title": "Redditの親たち。もし、子供が突然公共の場で癇癪を起こし、「あなたは私のパパ／ママじゃない！」と叫んだら、あなたはどうやって自分が子供の親であることを証明しますか？私はあなたを知らない！」と叫んだとしたら。??"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我是个男人。我确信这也适用于女性/母亲，但我已经读够了 \"我不能带孩子去游乐场而不被人盯着\"。\n但我已经读了足够多的 \"我不能带孩子去操场而不被盯着看 \"的男人的文章，知道人们常常把我们想得很坏。\n我知道，人们常常把我们想得很坏。\n\n不管怎么说！我有侄子，但我的孩子还在上学。我有侄子，但没有自己的孩子。所以我不知道所有的秘密\n秘密...",
      "title": "Reddit的父母。如果孩子突然在公共场合发脾气，并惊呼 \"你不是我爸爸/妈妈！\"，你如何证明你是孩子的父母？我不认识你！\" ??"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我是個男人。我確信這也適用於女性/母親，但我已經讀夠了 \"我不能帶孩子去遊樂場而不被人盯着\"。\n但我已經讀了足夠多的 \"我不能帶孩子去操場而不被盯着看 \"的男人的文章，知道人們常常把我們想得很壞。\n我知道，人們常常把我們想得很壞。\n\n不管怎麼說！我有侄子，但我的孩子還在上學。我有侄子，但沒有自己的孩子。所以我不知道所有的祕密\n祕密...",
      "title": "Reddit的父母。如果孩子突然在公共場合發脾氣，並驚呼 \"你不是我爸爸/媽媽！\"，你如何證明你是孩子的父母？我不認識你！\" ??"
    }
  ]
}