{
  "author": "ILikeSpicyNuggets",
  "original_created_utc": 1635670125,
  "title": "Why is ok for people who aren't white to cosplay/dress up as anyone, but white people can't?",
  "created_utc": 1635682337,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A friend of mine who is not white dressed up was kim possible for a Halloween party and she absolutely killed it, looked awesome. I felt a little sad that I couldn&#39;t dress up as some of my favourite fictional characters because I&#39;m white.</p>\n\n<p>I don&#39;t mean any offence by this post I just want some insight. I understand cultural appropriation, but why does that also translate over to fictional characters?</p>\n\n<p>Please no hate, I just want to understand better.</p>\n</div><!-- SC_ON -->",
  "score": 116,
  "permalink": "/r/TooAfraidToAsk/comments/qjlist/why_is_ok_for_people_who_arent_white_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "qjlist",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A friend of mine who is not white dressed up was kim possible for a Halloween\nparty and she absolutely killed it, looked awesome. I felt a little sad that I\ncouldn't dress up as some of my favourite fictional characters because I'm\nwhite.\n\nI don't mean any offence by this post I just want some…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "白人ではない私の友人は、ハロウィンパーティーでキム・ポッシブルの仮装をしました。\nパーティーに参加したのですが、見事に着こなしていました。私は、自分が白人だからといって\n自分が白人だからといって、好きなフィクションのキャラクターに扮することができないのはちょっと悲しい。\n白人です。\n\nこの投稿で悪気があるわけではなく、私はただ...",
      "title": "白人以外の人が誰かのコスプレをするのはいいけど、白人はダメなの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的一个不是白人的朋友在万圣节派对上打扮成了Kim possible。\n派对上，她绝对杀了它，看起来棒极了。我感到有点难过，因为我\n因为我是白人，所以不能打扮成我最喜欢的一些虚构人物。\n白人。\n\n我发这个帖子没有任何冒犯的意思，我只是想让一些人...",
      "title": "为什么不是白人的人可以cosplay/装扮成任何人，而白人就不可以？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的一個不是白人的朋友在萬聖節派對上打扮成了Kim possible。\n派對上，她絕對殺了它，看起來棒極了。我感到有點難過，因爲我\n因爲我是白人，所以不能打扮成我最喜歡的一些虛構人物。\n白人。\n\n我發這個帖子沒有任何冒犯的意思，我只是想讓一些人...",
      "title": "爲什麼不是白人的人可以cosplay/裝扮成任何人，而白人就不可以？"
    }
  ]
}