{
  "author": "Oliveiraz33",
  "original_created_utc": 1641392626,
  "title": "Wives &amp; Crypto",
  "created_utc": 1641422001,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In another post, I read countless users saying that if crypto all of a sudden went to $0, their wives would divorce them, take the kids, etc etc. How does that work? &lt;/p&gt;\n\n&lt;p&gt;If you have some business that you invested in, and it goes to crap, does the family give up on you? &lt;/p&gt;\n\n&lt;p&gt;Are you using you wife&amp;#39;s money to buy crypto and your kids aren&amp;#39;t eating because of it?&lt;/p&gt;\n\n&lt;p&gt;Well, not at all like that here at home. I invested in Crypto, but I invested in crypto with MY OWN MONEY, if it goes to zero, it&amp;#39;s my bad, not hers. She works and earns her money too, buys her shoes and dresses and I don&amp;#39;t stick my nose in, it&amp;#39;s her money.&lt;/p&gt;\n\n&lt;p&gt;As long as our house expenses are covered where each one pays half of them, then the spare money we can do whatever we want because it&amp;#39;s our money.&lt;/p&gt;\n\n&lt;p&gt;For context, I live in Portugal (Europe), for cultural reasons, things might work differently in your country. Not saying I&amp;#39;m right and you are wrong, just putting different lifestyles in perspective.&lt;/p&gt;\n\n&lt;p&gt;How does it work at your place? Does your family have a say in your personal expenses?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 311,
  "permalink": "/r/CryptoCurrency/comments/rwo2sy/wives_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "rwo2sy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In another post, I read countless users saying that if crypto all of a sudden\nwent to $0, their wives would divorce them, take the kids, etc etc. How does\nthat work?\n\nIf you have some business that you invested in, and it goes to crap, does the\nfamily give up on you?\n\nAre you using you wife's money…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "別の記事で、数え切れないほどのユーザーが、「暗号が突然なくなったら\n0ドルになったら、妻に離婚される、子供を取られる、などなど。どのように\nということです。\n\nもし、あなたが投資したビジネスが駄目になったら、その人はどうする？\n家族に見放された？\n\n奥さんのお金を使っているのか・・・。",
      "title": "ワイフ＆アンプ；クリプト"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在另一个帖子中，我看到无数的用户说，如果加密货币突然间\n变成0美元，他们的妻子会和他们离婚，带走孩子，等等。这怎么会\n这怎么行呢？\n\n如果你有一些你投资的生意，而它变成了垃圾，你的家人会放弃你吗？\n家人会放弃你吗？\n\n你是不是用你妻子的钱...",
      "title": "妻子&amp; Crypto"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在另一個帖子中，我看到無數的用戶說，如果加密貨幣突然間\n變成0美元，他們的妻子會和他們離婚，帶走孩子，等等。這怎麼會\n這怎麼行呢？\n\n如果你有一些你投資的生意，而它變成了垃圾，你的家人會放棄你嗎？\n家人會放棄你嗎？\n\n你是不是用你妻子的錢...",
      "title": "妻子&amp; Crypto"
    }
  ]
}