{
  "author": "HodloBaggins",
  "the_new_excerpt": "I think it’s really cool to see crypto be immortalized this way as it combines a\nmore traditional medium of art, the statue, with the very forward-looking\nconcepts of decentralization and crypto in general. Although this will be a\nstatue of Satoshi, I think the overarching message of “We are all the…",
  "original_created_utc": 1621379206,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号がこのような形で不朽のものとなるのは、とても素晴らしいことだと思います。\n像という伝統的な芸術メディアと、分散化や暗号全般という非常に前向きな\n像という伝統的な芸術メディアと、分散化や暗号全般の非常に前向きなコンセプトを組み合わせているからです。これはサトシの銅像になりますが\n像になりますが、「We are all the...」という包括的なメッセージが込められていると思います。",
      "title": "ブダペストに建設される等身大のナカモト・サトシのブロンズ像は、顔の部分が鏡になっていて、\"We are all Satoshi \"と理解してもらえるようになっています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为看到加密货币以这种方式永生真的很酷，因为它结合了一个更传统的艺术媒介，即雕像，和非常前瞻性的艺术。\n它结合了更传统的艺术媒介--雕像，以及非常具有前瞻性的\n去中心化和一般的加密货币的概念。虽然这将是一个\n虽然这将是一尊中本聪的雕像，但我认为 \"我们都是...... \"这一总体信息是很重要的。",
      "title": "将在布达佩斯建造的中本聪真人大小的铜像将有一面镜子，以便崇拜者理解 \"我们都是中本聪\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲看到加密貨幣以這種方式永生真的很酷，因爲它結合了一個更傳統的藝術媒介，即雕像，和非常前瞻性的藝術。\n它結合了更傳統的藝術媒介--雕像，以及非常具有前瞻性的\n去中心化和一般的加密貨幣的概念。雖然這將是一個\n雖然這將是一尊中本聰的雕像，但我認爲 \"我們都是...... \"這一總體信息是很重要的。",
      "title": "將在布達佩斯建造的中本聰真人大小的銅像將有一面鏡子，以便崇拜者理解 \"我們都是中本聰\""
    }
  ],
  "title": "Life-size bronze statue of Satoshi Nakamoto to be built In Budapest will have a mirror for a face so that admirers will understand that “We are all Satoshi”",
  "created_utc": 1621399336,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think it’s really cool to see crypto be immortalized this way as it combines a more traditional medium of art, the statue, with the very forward-looking concepts of decentralization and crypto in general. Although this will be a statue of Satoshi, I think the overarching message of “We are all the bank” applies to many different cryptocurrencies, some even more focused on decentralization and privacy than Bitcoin. It’s also a very positive thing to see in general and it certainly deserves to be understood by more people. Humanity together.</p>\n</div><!-- SC_ON -->",
  "score": 1299,
  "permalink": "/r/CryptoCurrency/comments/nfp5d1/lifesize_bronze_statue_of_satoshi_nakamoto_to_be/",
  "subreddit": "CryptoCurrency",
  "id": "nfp5d1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590801359
}