{
  "author": "naji102",
  "original_created_utc": 1635320370,
  "title": "My Country is about to go into DOUBLE DIGITs inflation rate. Our monthly minimum wage is only $113.89. Crypto is the ONLY hope in here.",
  "created_utc": 1635339035,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you live in the first world country count your blessings. In my country Pakistan poverty rate is 39.2% according to the World Bank and  Inflation rate is about to go into double digits.   </p>\n\n<p>Within only a month prices of Gas and USD are going skyrocket which means daily life things are getting expensive people can&#39;t afford branded suff because dollar rate going high and minimum wage being the same nobody seems to afford it.  </p>\n\n<p><strong>Sep 16, 2021</strong></p>\n\n<ul>\n<li><strong>Gasoline 1 Litre 120.80</strong></li>\n<li><strong>1 USD 169.20</strong></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>Today&#39;s Price</strong></p>\n\n<ul>\n<li><strong>Gasoline 1 Litre 138</strong></li>\n<li><strong>1 USD 175.60</strong></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>Minimum wage is still the same, poor people are suffering from this inflation most of the people have no idea what Crypto is because literacy rate in here is only 60 per cent as far as I know they count someone literate who can write their name or can sign it.   </p>\n\n<p>Young generation who knows about Crypto are bound to buy only from P2P method because none of the banks in here allow cryptocurrency purchases.   </p>\n\n<p>Current USDT rate on P2P market is 180. That&#39;s the only way we can get into Crypto Market. Even after all these hurdles recently Bloomberg reported <strong>adoption rate</strong> in Pakistan is <strong>711% over 12 months.</strong>  </p>\n\n<p>I myself don&#39;t belong to a rich family and Cryptocurrency is the ONLY hope left for us in here.  I had hard time explaining Crypto to my family but I still got my Sister into Crypto, she&#39;s happier than ever.   </p>\n\n<p>I just want to thank Crypto community and Crypto in general.<br/>\nSorry for bad English.</p>\n</div><!-- SC_ON -->",
  "score": 288,
  "permalink": "/r/CryptoCurrency/comments/qgr81u/my_country_is_about_to_go_into_double_digits/",
  "subreddit": "CryptoCurrency",
  "id": "qgr81u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If you live in the first world country count your blessings. In my country\nPakistan poverty rate is 39.2% according to the World Bank and Inflation rate is\nabout to go into double digits.\n\nWithin only a month prices of Gas and USD are going skyrocket which means daily\nlife things are getting…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もしあなたが第一世界の国に住んでいるならば、幸運を祈りましょう。私の国では\nパキスタンの貧困率は世界銀行によると39.2%で、インフレ率は2桁になろうとしています。\nインフレ率は2桁になろうとしています。\n\nわずか1ヶ月の間に、ガソリンや米ドルの価格が急騰しています。\nそれはつまり、日常生活に必要なものが...",
      "title": "私の国では、インフレ率が2桁になろうとしています。毎月の最低賃金は113.89ドルしかありません。暗号はここでの唯一の希望です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你生活在第一世界的国家，请算你的福气。在我的国家\n根据世界银行的数据，巴基斯坦的贫困率是39.2%，通货膨胀率是\n即将进入两位数。\n\n仅仅一个月内，天然气和美元的价格就会暴涨，这意味着日常生活中的事情越来越多。\n这意味着日常生活中的事情正在变得...",
      "title": "我的国家即将进入两位数的通货膨胀率。我们的月最低工资只有113.89美元。加密货币是这里唯一的希望。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你生活在第一世界的國家，請算你的福氣。在我的國家\n根據世界銀行的數據，巴基斯坦的貧困率是39.2%，通貨膨脹率是\n即將進入兩位數。\n\n僅僅一個月內，天然氣和美元的價格就會暴漲，這意味着日常生活中的事情越來越多。\n這意味着日常生活中的事情正在變得...",
      "title": "我的國家即將進入兩位數的通貨膨脹率。我們的月最低工資只有113.89美元。加密貨幣是這裏唯一的希望。"
    }
  ]
}