{
  "author": "Some1fromReddit",
  "original_created_utc": 1635003303,
  "title": "Because of Cryptocurrency, I'm never going to be able to swim in the ocean ever again.",
  "created_utc": 1635021047,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Cryptocurrency has opened my eyes to everything that goes on in this world.   Especially the fact of how criminal networks operate.</p>\n\n<p>After researching how criminals use cryptocurrency to evade taxes, and launder money, I decided to see what else criminals use to do illegal things. </p>\n\n<p>I found that many are using the ocean by placing boats on it to transport drugs, weapons, and stolen goods.     </p>\n\n<p>If you support using the ocean , you support it&#39;s existence, and as long as we keep using the ocean to fish, going on trips, and swim, we are indirectly telling criminals that they have the ability to use the ocean too...  For their illegal activities.  And I&#39;m taking a stand now, and never using the ocean for anything again. </p>\n\n<p>The fact is, deep in international waters, there isn&#39;t much regulation.  There isn&#39;t enough eyes on it, and anything can be going on out there.    Especially pirates.    </p>\n\n<p>And I also think we should start monitoring everyone&#39;s bank accounts so we can catch people who are funneling money into these illegal ocean activities. </p>\n\n<p>So if someone tells you they like going in the ocean, remind them of all the illegal things that take place in it.    They should feel bad.     Educate them on the dangers.</p>\n</div><!-- SC_ON -->",
  "score": 176,
  "permalink": "/r/CryptoCurrency/comments/qe72oq/because_of_cryptocurrency_im_never_going_to_be/",
  "subreddit": "CryptoCurrency",
  "id": "qe72oq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Cryptocurrency has opened my eyes to everything that goes on in this world.\nEspecially the fact of how criminal networks operate.\n\nAfter researching how criminals use cryptocurrency to evade taxes, and launder\nmoney, I decided to see what else criminals use to do illegal things.\n\nI found that many…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号通貨は、この世界で起こっているすべてのことに目を開かせてくれました。\n特に、犯罪ネットワークがどのように運営されているかという事実です。\n\n犯罪者がどのように暗号通貨を使って脱税や資金洗浄をしているのかを調べた結果\n犯罪者がどのように脱税や資金洗浄に暗号通貨を利用しているかを調べた後、他にも犯罪者が違法行為に利用しているものがないか調べてみました。\n\n私が見つけたのは、多くの...",
      "title": "Cryptocurrencyのせいで、私は二度と海で泳ぐことができなくなってしまった。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "加密货币使我对这个世界上发生的一切都大开眼界。\n特别是犯罪网络如何运作的事实。\n\n在研究了犯罪分子如何利用加密货币逃税和洗钱之后\n我决定看看犯罪分子还用什么来做非法的事情。\n\n我发现，许多...",
      "title": "因为加密货币，我再也不能在海里游泳了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "加密貨幣使我對這個世界上發生的一切都大開眼界。\n特別是犯罪網絡如何運作的事實。\n\n在研究了犯罪分子如何利用加密貨幣逃稅和洗錢之後\n我決定看看犯罪分子還用什麼來做非法的事情。\n\n我發現，許多...",
      "title": "因爲加密貨幣，我再也不能在海里游泳了。"
    }
  ]
}