{
  "author": "bobasipper",
  "original_created_utc": 1657376578,
  "title": "Is it wrong to offer lower now that I realize the dog I’m adopting is deaf?",
  "created_utc": 1657447555,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have been talking to a lady that wants $800 for a half year old Dalmatian, only thing is that she didn’t tell me that the dog was deaf until after we talked for quite a bit. Is it wrong for me to now offer lower considering? I feel bad for doing so but was generally curious thoughts.&lt;/p&gt;\n\n&lt;p&gt;Edit: She isn’t a breeder, just a normal person that got a new job and doesn’t have the capabilities to take the dog out for walks, or take care of it efficiently.&lt;/p&gt;\n\n&lt;p&gt;Edit 2.0: Just to be clear, I am more than fine with her being deaf. I would love to her have regardless of whether she can hear, I just want her to have a nice home.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/vv2s5t/is_it_wrong_to_offer_lower_now_that_i_realize_the/",
  "subreddit": "NoStupidQuestions",
  "id": "vv2s5t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have been talking to a lady that wants $800 for a half year old Dalmatian,\nonly thing is that she didn’t tell me that the dog was deaf until after we\ntalked for quite a bit. Is it wrong for me to now offer lower considering? I\nfeel bad for doing so but was generally curious thoughts.\n\nEdit: She…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "半年前のダルメシアンを800ドルで買いたいと言っている女性と話したことがあります。\nただ、彼女はその犬が耳が聞こえないということを、かなり話し込んでから\nただ、耳が聞こえないということは、かなり話をした後でないと教えてくれませんでした。今、私が考えているより低い金額を提示するのは間違っているのでしょうか？I\nをするのは悪いことだと思いますが、一般的に興味がある考えでした。\n\n編集：彼女は...",
      "title": "採用する犬が聴覚障害者だとわかった今、低く提示するのはいけないことなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在和一位女士交谈，她要800美元买一只半岁的大麦町犬。\n唯一的问题是，她没有告诉我这只狗是聋哑的，直到我们\n聊了很久。我现在考虑降低报价是否有错？I\n我觉得这样做不好，但总的来说是好奇的想法。\n\n编辑：她...",
      "title": "现在我意识到我要收养的狗是聋哑人，提供较低的价格是否有错？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在和一位女士交談，她要800美元買一隻半歲的大麥町犬。\n唯一的問題是，她沒有告訴我這隻狗是聾啞的，直到我們\n聊了很久。我現在考慮降低報價是否有錯？I\n我覺得這樣做不好，但總的來說是好奇的想法。\n\n編輯：她...",
      "title": "現在我意識到我要收養的狗是聾啞人，提供較低的價格是否有錯？"
    }
  ]
}