{
  "author": "timbojimbojones",
  "original_created_utc": 1635384417,
  "title": "I blame all of you",
  "created_utc": 1635395546,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Shib was my intro into the wonderful world of crypto I bought shib at its previous all time high back in May. \nI continued to DCA for months......</p>\n\n<p>Then I started reading this sub, and all the meme coin hate, don&#39;t get me wrong I completely agree with it all, I can&#39;t understand how a joke coin can be worth however many billion it is up to now. </p>\n\n<p>So I took the sentiment of the sub sold my shib at at a loss and started buying coins with real tech and use case behind it. Like ADA and Ergo my two biggest bags. \nI pretty sure in the long run I&#39;ll be ok but if only I had held a little bit longer I would have almost 200k worth of  shib. </p>\n\n<p>Now watching everything tank while shib goes parabolic is kinda making me think I&#39;m doomed to fail.  </p>\n\n<p>Anyway I&#39;m gonna go cry now untill ADA moves</p>\n</div><!-- SC_ON -->",
  "score": 205,
  "permalink": "/r/CryptoCurrency/comments/qhbomd/i_blame_all_of_you/",
  "subreddit": "CryptoCurrency",
  "id": "qhbomd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Shib was my intro into the wonderful world of crypto I bought shib at its\nprevious all time high back in May. I continued to DCA for months......\n\nThen I started reading this sub, and all the meme coin hate, don't get me wrong\nI completely agree with it all, I can't understand how a joke coin can be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Shibは、私が暗号の素晴らしい世界に足を踏み入れるきっかけとなったもので、5月に過去の最高値で購入しました。\n5月に史上最高値で購入しました。DCAを何ヶ月も続けました......\n\nその後、このサブ記事を読み始め、すべてのミームコインを憎むようになりましたが、誤解しないでください。\n誤解のないように言っておきますが、私はすべてに完全に同意し、ジョークコインがどのようにして...",
      "title": "私はあなた方を責める"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Shib是我进入奇妙的加密货币世界的开始。\n在5月份的历史最高点买入了Shib。我继续在DCA买了几个月......\n\n然后我开始阅读这个子，以及所有的纪念币仇恨，不要误会我的意思\n我完全同意这一切，我无法理解一个笑话币怎么能...",
      "title": "我责备你们所有的人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Shib是我進入奇妙的加密貨幣世界的開始。\n在5月份的歷史最高點買入了Shib。我繼續在DCA買了幾個月......\n\n然後我開始閱讀這個子，以及所有的紀念幣仇恨，不要誤會我的意思\n我完全同意這一切，我無法理解一個笑話幣怎麼能...",
      "title": "我責備你們所有的人"
    }
  ]
}