{
  "author": "TerrisKagi",
  "the_new_excerpt": "I've seen a bunch of people talking up the nobility of crypto ownership as an\nanti censorship tool, or how block chain tech is going to change the world or\nhow its a defense against fiat currencies, or how they're holding certain coins\nout of high minded principles\n\nI can't be the only one who is…",
  "original_created_utc": 1619761594,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "反検閲ツールとしての暗号所有権の尊さを語る人たちを何人も見てきました。\nブロックチェーン技術が世界を変えるとか、不換紙幣に対する防衛策だとか\n不換紙幣に対する防御策であるとか、高邁な理念に基づいて特定のコインを保有しているとか\n高邁な理念に基づいて\n\nそんな人は私だけではないはず...。",
      "title": "文字通り、お金のためだけにやっている人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经看到一堆人在谈论加密货币所有权作为一种反审查工具的崇高性。\n我看到很多人都在谈论加密货币所有权的崇高地位，认为它是一种反审查工具，或者区块链技术将如何改变世界，或者它是如何抵御法定货币的。\n它是如何防御法定货币的，或者他们是如何持有某些币的\n出于崇高的原则\n\n我不可能是唯一一个这样的人......",
      "title": "还有人真的只是为了钱吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經看到一堆人在談論加密貨幣所有權作爲一種反審查工具的崇高性。\n我看到很多人都在談論加密貨幣所有權的崇高地位，認爲它是一種反審查工具，或者區塊鏈技術將如何改變世界，或者它是如何抵禦法定貨幣的。\n它是如何防禦法定貨幣的，或者他們是如何持有某些幣的\n出於崇高的原則\n\n我不可能是唯一一個這樣的人......",
      "title": "還有人真的只是爲了錢嗎？"
    }
  ],
  "title": "Anyone else literally just in it for the money?",
  "created_utc": 1619775056,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve seen a bunch of people talking up the nobility of crypto ownership as an anti censorship tool, or how block chain tech is going to change the world or how its a defense against fiat currencies, or how they&#39;re holding certain coins out of high minded principles </p>\n\n<p>I can&#39;t be the only one who is here just for money right? Who doesn&#39;t care about that stuff as long as my investment pays fruit?</p>\n</div><!-- SC_ON -->",
  "score": 1685,
  "permalink": "/r/CryptoCurrency/comments/n1ne0t/anyone_else_literally_just_in_it_for_the_money/",
  "subreddit": "CryptoCurrency",
  "id": "n1ne0t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380961455
}