{
  "author": "Vitamina_e",
  "original_created_utc": 1627420738,
  "title": "I have finally deployed my first Social Network site which I developed from scratch!",
  "created_utc": 1627506720,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just wanted to share that I have finally completed the MVP for my first ever Social Network application named <a href=\"https://www.korseas.com/\">www.korseas.com</a>! I always had &quot;Building a Social Network&quot; on my bucket list of things I wanted to try out, so I am very excited to have finally launched one.</p>\n\n<p>I am aware that it will take a lot of effort to make this site become an income stream, but to be honest, my goal is to build a site that actually benefits/impacts people and adds at least a bit of value to this world. That&#39;s what keeps me going :)</p>\n\n<p>The elephant in the room is that I feel like my UI/UX skills are not doing justice to the work needed for all the rest. So that will be my focus from now on.</p>\n\n<p>For those interested the tech stack I used was:</p>\n\n<p>React (JS), Javalin (Java) and MongoDB (Java driver). For the analytics I am using Google Analytics.</p>\n\n<p>I wish the best to the people who are working hard on their side projects!</p>\n\n<p>Oh also, everyone is welcome to use the site, not only Koreans living abroad :)</p>\n\n<p>Any comments/feedbacks/questions are much appreciated! Thank you.</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/osvgxc/i_have_finally_deployed_my_first_social_network/",
  "subreddit": "SideProject",
  "id": "osvgxc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I just wanted to share that I have finally completed the MVP for my first ever\nSocial Network application named www.korseas.com [https://www.korseas.com/]! I\nalways had \"Building a Social Network\" on my bucket list of things I wanted to\ntry out, so I am very excited to have finally launched one.\n\nI…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の初めてのソーシャル・ネットワーク・アプリケーション「www.org」のMVPがついに完成しました。\nwww.korseas.com [https://www.korseas.com/]という名前のソーシャルネットワークアプリケーションです。I\nソーシャルネットワークの構築」は、私のバケットリストの中で、常に試してみたいことの一つでした。\nだから、ついにMVPを完成させることができて、とても興奮しています。\n\nI...",
      "title": "私がゼロから開発した初めてのソーシャル・ネットワーク・サイトをついに展開しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是想分享一下，我终于完成了我的第一个社交网络应用的MVP，名为\n名为www.korseas.com [https://www.korseas.com/]的社交网络应用的MVP! I\n我一直把 \"建立一个社交网络 \"放在我想做的事情的清单上。\n所以我很高兴终于推出了一个。\n\nI...",
      "title": "我终于部署了我的第一个社交网站，这是我从头开始开发的！我的网站是由我自己开发的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是想分享一下，我終於完成了我的第一個社交網絡應用的MVP，名爲\n名爲www.korseas.com [https://www.korseas.com/]的社交網絡應用的MVP! I\n我一直把 \"建立一個社交網絡 \"放在我想做的事情的清單上。\n所以我很高興終於推出了一個。\n\nI...",
      "title": "我終於部署了我的第一個社交網站，這是我從頭開始開發的！我的網站是由我自己開發的。"
    }
  ]
}