{
  "author": "dmbss",
  "original_created_utc": 1638792555,
  "title": "If there are two identical rockets in vacuum, one stationary and one somehow already moving at 1000kmh, and their identical engines are both ignited, would they have the same change in velocity?",
  "created_utc": 1638805475,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Given that kinetic energy is the square of velocity, if both rockets&amp;#39; change in velocity is the same, that seems to suggest that the faster rocket gained more kinetic energy from the same energy source (engine).&lt;/p&gt;\n\n&lt;p&gt;However, if both rockets&amp;#39; change in velocity are not the same, this seems to be incongruent with the fact that they are both in identical inertial frames of reference.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 131,
  "permalink": "/r/askscience/comments/ra5txv/if_there_are_two_identical_rockets_in_vacuum_one/",
  "subreddit": "askscience",
  "id": "ra5txv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Given that kinetic energy is the square of velocity, if both rockets' change in\nvelocity is the same, that seems to suggest that the faster rocket gained more\nkinetic energy from the same energy source (engine).\n\nHowever, if both rockets' change in velocity are not the same, this seems to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "運動エネルギーが速度の2乗であることを考えると、もし両ロケットの変化量が\n同じ速度であれば、速い方がより多くの速度を得たことになります。\n同じエネルギー源(エンジン)から運動エネルギーを得ることができます。\n\nしかし、両方のロケットの速度の変化が同じでない場合、これは...",
      "title": "真空中に2つの同じロケットがあって、1つは静止していて、もう1つはなぜか時速1000kmで動いていて、それぞれの同じエンジンに点火した場合、速度の変化は同じでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "鉴于动能是速度的平方，如果两枚火箭的速度变化\n速度的变化是相同的，这似乎表明更快的火箭从相同的能源（发动机）中获得了更多的\n动能，这似乎表明更快的火箭从相同的能源（发动机）中获得了更多的动能。\n\n然而，如果两支火箭的速度变化不一样，这似乎是...。",
      "title": "如果在真空中有两个相同的火箭，一个是静止的，一个是以某种方式已经以1000公里的速度移动，它们相同的引擎都被点燃，它们的速度变化是否相同？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "鑑於動能是速度的平方，如果兩枚火箭的速度變化\n速度的變化是相同的，這似乎表明更快的火箭從相同的能源（發動機）中獲得了更多的\n動能，這似乎表明更快的火箭從相同的能源（發動機）中獲得了更多的動能。\n\n然而，如果兩支火箭的速度變化不一樣，這似乎是...。",
      "title": "如果在真空中有兩個相同的火箭，一個是靜止的，一個是以某種方式已經以1000公里的速度移動，它們相同的引擎都被點燃，它們的速度變化是否相同？"
    }
  ]
}