{
  "author": "NaChl094",
  "the_new_excerpt": "Morris had developed a severe cough these last few weeks. It was quite bad, much\nworse than a regular hairball retching reaction. We went to the vet yesterday\nwith him, and the Röntgen and Ultra sound showed a huge tumour in his lungs. My\nbest furry friend had cancer. We scheduled a termination…",
  "original_created_utc": 1611992253,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "莫里斯这几周出现了严重的咳嗽。咳得很厉害，很\n比一般的毛球反胃反应还要严重。我们昨天去看了兽医\n和他在一起，而伦琴和超声显示他的肺部有一个巨大的肿瘤。我的\n最好的毛茸茸的朋友得了癌症。我们安排了一个终止...",
      "title": "我昨天不得不把我的猫咪放下来，我真的很伤心。我该如何应对？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "莫里斯這幾周出現了嚴重的咳嗽。咳得很厲害，很\n比一般的毛球反胃反應還要嚴重。我們昨天去看了獸醫\n和他在一起，而倫琴和超聲顯示他的肺部有一個巨大的腫瘤。我的\n最好的毛茸茸的朋友得了癌症。我們安排了一個終止...",
      "title": "我昨天不得不把我的貓咪放下來，我真的很傷心。我該如何應對？"
    }
  ],
  "title": "I had to put down my cat yesterday, and I am absolutely devastated. How do I cope from here?",
  "created_utc": 1612021305,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Morris had developed a severe cough these last few weeks. It was quite bad, much worse than a regular hairball retching reaction.\nWe went to the vet yesterday with him, and the Röntgen and Ultra sound showed a huge tumour in his lungs. My best furry friend had cancer. We scheduled a termination later in the evening, as I stayed with him the whole time. I hadnt cried this much, and I am now as I type this, in a very long time. My entire face and chest fucking hurts but I cant stop.</p>\n\n<p>Heres a picture of him. \n<a href=\"https://i.imgur.com/meKdfY1.jpg\">https://i.imgur.com/meKdfY1.jpg</a></p>\n\n<p>And a gif of cat.exe has stopped responding... (Haha)\n<a href=\"https://imgur.com/a/WGIoXSx\">https://imgur.com/a/WGIoXSx</a></p>\n\n<p>I need some words and help on how to go on from this. Men who had pets put down, how did you moved on?</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/AskMen/comments/l8gp5q/i_had_to_put_down_my_cat_yesterday_and_i_am/",
  "subreddit": "AskMen",
  "id": "l8gp5q",
  "is_self": true,
  "media": null,
  "is_video": false
}