{
  "author": "AskScienceModerator",
  "the_new_excerpt": "A former New York Times weekly tech columnist from 2000 to 2013, I'm a five-time\nEmmy winner for my stories on CBS News Sunday Morning, a New York Times\nbestselling author, a five-time TED speaker, and host of 20 NOVA science\nspecials on PBS.\n\nMy most recent NOVA special is a mini-series called…",
  "original_created_utc": 1612958414,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "从2000年到2013年，我曾是《纽约时报》周刊的科技专栏作家，我曾五次获得《纽约时报》周刊的科技专栏。\n艾美奖获得者，我的故事在CBS新闻周日早晨，纽约时报\n畅销书作家、五次TED演讲者、20期NOVA科学节目主持人。\nPBS的特别节目。\n\n我最近的NOVA特别节目是一个迷你系列，叫做... ...",
      "title": "AskScience AMA系列。我是大卫・波格，科技和科学作家， 和NOVA PBS的新系列主持人 超越元素。AMA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從2000年到2013年，我曾是《紐約時報》週刊的科技專欄作家，我曾五次獲得《紐約時報》週刊的科技專欄。\n艾美獎獲得者，我的故事在CBS新聞週日早晨，紐約時報\n暢銷書作家、五次TED演講者、20期NOVA科學節目主持人。\nPBS的特別節目。\n\n我最近的NOVA特別節目是一個迷你係列，叫做... ...",
      "title": "AskScience AMA系列。我是大衛・波格，科技和科學作家， 和NOVA PBS的新系列主持人 超越元素。AMA!"
    }
  ],
  "title": "AskScience AMA Series: I'm David Pogue, tech and science writer, and host of NOVA PBS' new series Beyond the Elements. AMA!",
  "created_utc": 1612963642,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A former <em>New York Times</em> weekly tech columnist from 2000 to 2013, I&#39;m a five-time Emmy winner for my stories on <em>CBS News Sunday Morning</em>, a <em>New York Times</em> bestselling author, a five-time TED speaker, and host of 20 <em>NOVA</em> science specials on PBS.</p>\n\n<p>My most recent <em>NOVA</em> special is a mini-series called &quot;<a href=\"https://www.pbs.org/wgbh/nova/series/beyond-elements/\">Beyond the Elements</a>,&quot; a sequel to my 2012 documentary &quot;<a href=\"https://www.pbs.org/wgbh/nova/video/hunting-the-elements/\">Hunting the Elements</a>,&quot; which has become a staple in science classrooms worldwide. The new show&#39;s three one-hour episodes take me on a worldwide quest for the key molecules and chemical reactions that make up human civilization, including concrete and fertilizer, plastic and rubber, fire and venom, explosives and hot peppers.</p>\n\n<p>I&#39;ve written or cowritten more than 120 books, including dozens in the Missing Manual tech series, which I created in 1999; six books in the <em>For Dummies</em> line (including <em>Macs</em>, <em>Magic</em>, <em>Opera</em>, and <em>Classical Music</em>); two novels (one for middle-schoolers); my three bestselling <em>Pogue&#39;s Basics</em> books of tips and shortcuts (on <em>Tech</em>, <em>Money</em>, and <em>Life</em>); my how-to guides <em>iPhone Unlocked</em> and <em>Mac Unlocked</em>; and my 620-page magnum opus, <em>How to Prepare for Climate Change</em>.</p>\n\n<p>After graduating summa cum laude from Yale in 1985 with a distinction in music, I spent 10 years conducting and arranging Broadway musicals in New York. I won a Loeb Award for journalism, two Webby awards, and an honorary doctorate in music. I live in Connecticut and San Francisco with my wife Nicki and our blended brood of five spectacular children.</p>\n\n<p>For a complete list of my columns and videos, and to sign up to get them by email, visit <a href=\"https://authory.com/davidpogue\">https://authory.com/davidpogue</a>. On Twitter, I&#39;m <a href=\"https://twitter.com/pogue\">@pogue</a>; on the web, I&#39;m at <a href=\"http://www.davidpogue.com/\">www.davidpogue.com</a>. I welcome civil email exchanges at <a href=\"mailto:david@pogueman.com\">david@pogueman.com</a>, and of course, AMA!</p>\n</div><!-- SC_ON -->",
  "score": 194,
  "permalink": "/r/askscience/comments/lgs68h/askscience_ama_series_im_david_pogue_tech_and/",
  "subreddit": "askscience",
  "id": "lgs68h",
  "is_self": true,
  "media": null,
  "is_video": false
}