{
  "author": "zimmah",
  "the_new_excerpt": "WHAT IS NEO / GAS?\n\nNeo is a smart contract network, similar to Ethereum or Binance Smart chain.\n\n\nWHAT MAKES NEO AND GAS UNIQUE?\n\nTwo token model\n\nUnlike other smart chains, Neo has a unique concept where the main token NEO, is\nactually not a coin (although it can be transferred), and it is not…",
  "original_created_utc": 1613733121,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "什么是NEO / GAS？\n\nNeo是一个智能合约网络，类似于Ethereum或Binance智能链。\n\n\nNEO和GAS的独特性是什么？\n\n两种代币模式\n\n与其他智能链不同的是，Neo有一个独特的概念，主代币NEO，就是\n其实不是钱币（虽然可以转让），也不是...",
      "title": "关于不甚了解的沉睡巨兽NEO和GAS。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "什麼是NEO / GAS？\n\nNeo是一個智能合約網絡，類似於Ethereum或Binance智能鏈。\n\n\nNEO和GAS的獨特性是什麼？\n\n兩種代幣模式\n\n與其他智能鏈不同的是，Neo有一個獨特的概念，主代幣NEO，就是\n其實不是錢幣（雖然可以轉讓），也不是...",
      "title": "關於不甚瞭解的沉睡巨獸NEO和GAS。"
    }
  ],
  "title": "About the poorly understood sleeping giant NEO and GAS",
  "created_utc": 1613749261,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>What is NEO / GAS?</h1>\n\n<p>Neo is a smart contract network, similar to Ethereum or Binance Smart chain.</p>\n\n<h1>What makes NEO and GAS unique?</h1>\n\n<p><strong>Two token model</strong></p>\n\n<p>Unlike other smart chains, Neo has a unique concept where the main token NEO, is actually not a coin (although it can be transferred), and it is not used to pay Gas. Instead, GAS is used as a coin, and NEO is used to vote and to generate GAS.NEO can be seen as a dividend-paying share with voting rights.GAS can be seen as an alternative to ETH or BNB. It&#39;s the native coin of the network, and used to pay GAS/fees</p>\n\n<p><strong>Passive and sustainable income</strong></p>\n\n<p>NEO will passively generate GAS. Some GAS is newly minted (a diminishing curve until the max of 100 million GAS is reached) and other GAS is the GAS that is used for fees. With holding NEO you&#39;re basically a miner, without having to actually mine. It&#39;s completely passive income that does not inflate the price of the coin.</p>\n\n<p><strong>Voting</strong></p>\n\n<p>NEO holders can vote for committee members and validator nodes, so NEO holders can ensure the network governance stays decentralized and managed by people they trust.</p>\n\n<p><strong>Efficient consensus algorithm</strong></p>\n\n<p>NEO uses a consensus algorithm that is by design a little bit less decentralized. Now this may sound bad at first, but let me explain why this is actually a good thing.</p>\n\n<p>Centralized - decentralized is not a binary choice, rather it is a scale. Instead of being 100% centralized or 100% decentralized, you can pick a value somewhere in between. NEO picked a value a little bit closer to the centralized side, but it is still decentralized. Now why does this matter?</p>\n\n<p>It matters  because of the blockchain trilemma. You may know of the very common trilemma of &quot;choose two: cheap, fast, good&quot;, blockchain have a similar trilemma, &quot;choose two: decentralized, scalable, secure&quot;. Now NEO choose to slide a bit more to the side of centralization (while still being decentralized) to allow a bit more room in the scalability side, without making concessions to security.</p>\n\n<p>It&#39;s important to note that NEO still has all the benefits of being decentralized, but it&#39;s also important to consider what level of decentralization you personally are happy with. Is NEO decentralized enough? that&#39;s something only you can decide.</p>\n\n<p>How efficient is NEO? NEO can in practice reach 1000 tx/s on layer 1 easily, that&#39;s not even considering layer 2 solutions. Compare this to Ethereums 15tx/s on layer 1.</p>\n\n<h1>What are the competitors?</h1>\n\n<p>Ethereum is the main competitor. It&#39;s currently facing scaling issues due to its high popularity. ETH 2.0 should help with this issue, but NEO is a great alternative in the meantime, and it has other advantages even after the launch of ETH 2.0</p>\n\n<p>Another competitor is BNB or Binance smart chain. It&#39;s very similar to ethereum, which makes it a popular choice to port solidity apps to BSC. However, since it is so similar to ethereum it will face exactly the same scaling issues.</p>\n\n<p>Other smart contract platforms exist, such as TRON, Cardano, etc. but most of them don&#39;t have a working smart contract yet or don&#39;t see much use.</p>\n\n<h1>What advantages does NEO / GAS have over the competitors?</h1>\n\n<p>Most of them have been mentioned above in what makes NEO/GAS unique.</p>\n\n<p><strong>Developers can use mainstream programming languages to develop on NEO</strong></p>\n\n<p>Neo allows developers to use common programming languages like javascript, python, java, kotlin, C#, F# and others, while ethereum requires solidity. This makes the barrier to entry for developers a lot lower.</p>\n\n<p><strong>Build in oracles and build in filesystem</strong></p>\n\n<p>Oracle services (similar to chainlink) and filesystems (like SIA) are built-in to NEO.</p>\n\n<p><strong>Scalable gas fees</strong></p>\n\n<p>The network can react to GAS prices by lowering the GAS fee on a protocol level. This means all contracts will require less GAS to use, which makes the fees affordable even when GAS prices rise.</p>\n\n<p><strong>Capped supply</strong></p>\n\n<p>NEO and GAS have their supply capped at 100 Million. NEO currently has around 70 Million circulating supply, while gas has 10 Million circulating supply.</p>\n\n<h1>What are some common worries?</h1>\n\n<p><strong>China</strong></p>\n\n<p>NEO is a coin that was made in china. This worries some people. However, it can also be a benefit. China is a huge market, with lots of money, and Chinese people tend to support Chinese companies. This gives it a very strong home base. And since NEO is decentralized, just because it was invented in China doesn&#39;t mean that China can control it. If the NEO holders vote for committee members outside of China, there is nothing China can do to harm NEO in any way.</p>\n\n<p><strong>Centralization</strong></p>\n\n<p>While NEO scores lower on the degree of decentralization, it is still very much decentralized, and it has a governance model where NEO holders can vote and thereby participate in governance (indirectly by voting in or out committee members and validator nodes).</p>\n\n<p><strong>NEO becoming unaffordable</strong></p>\n\n<p>Since NEO is not divisible, people fear it may be out of reach for many people. However many exchanges still allow you to buy fractional NEO (even though you can&#39;t send them to your wallet, nor use them to vote, but the exchanges do usually pay you the GAS). Also, if you can&#39;t afford NEO, you can always buy GAS. Buying GAS is similar to buying ETH or BNB.</p>\n\n<p><strong>It&#39;s not listed on some exchanges</strong></p>\n\n<p>Binance is the biggest exchange that lists it (but not in the USA). This may be because exchanges aren&#39;t interested in NEO, but it&#39;s probably for another reason.</p>\n\n<p>Exchanges probably are not legally allowed to sell NEO because NEO is like a security. Also since NEO generates GAS, many users expect the Exchanges to give them the GAS they generate (most exchanges that DO trade NEO also give you the GAS you generate).</p>\n\n<p>This is also an opportunity because if in the future more exchanges list NEO, this will really explode the price. Don&#39;t count on this to happen though, as NEO isn&#39;t like most other coins. Also make sure you&#39;re legally allowed to hold securities, or accept the risk if you aren&#39;t allowed.</p>\n\n<p>Personally I think it&#39;s your money and you should be able to do with it what you want, but take care of yourself ok?</p>\n\n<p>GAS may be more likely to be listed at more exchanges because GAS is definitely not a security.</p>\n\n<h1>What can make NEO / GAS explode in value?</h1>\n\n<p>Both NEO and GAS are hard-capped at 100 Million tokens each. NEO currently has a supply of about 70 million, while gas has a supply of about 10 million.</p>\n\n<p>NEO 3.0 is about to launch, which will bring some improvements to the protocol.</p>\n\n<p>The NEO network is several orders of magnitude below its competitors despite actually have a working product that scales well. (literally 100 times cheaper than EOS and 4700 times cheaper than Ethereum)</p>\n\n<p>If NEO can even get 5% of the users that Ethereum CURRENTLY has, GAS would increase in price by 235 times! The risk-reward ratio is massively skewed. If NEO would reach their Tx/s limit just like ethereum, gas would increase in value by a staggering 313,000 times. A potential upside of 313 THOUSAND times, that&#39;s insane value. And that&#39;s not even considering scaling in the future. That&#39;s just assuming at some point NEO would reach the limits of what it  CURRENTLY supports.</p>\n\n<p>As long as NEO gets even a fraction of the users that Ethereum has, which is not so hard to believe since NEO is one of the few competitors to Ethereum that ACTUALLY have a functioning product RIGHT NOW, and Ethereum right now has fees in the double or triple digits, the price of GAS and NEO will absolutely skyrocket.</p>\n\n<h1>NEO/GAS, which one should I buy?</h1>\n\n<p><strong><em>NOTE: NEO is not divisible, while most exchanges allow you to buy fractional NEO, you can NOT send a fractional NEO to your wallet, and you WONT be able to vote with a fractional NEO, although some exchanges do give you your share of GAS for fractional NEO. GAS is divisible.</em></strong></p>\n\n<p>Buy NEO when either of the below is true:</p>\n\n<ul>\n<li>You believe in the Neo network and believe it will be more popular</li>\n<li>You intent to personally use the Neo network a lot in the future, and want to have a passive source of GAS to pay fees with</li>\n<li>You want to speculate on the price of NEO</li>\n</ul>\n\n<p>Buy GAS when:</p>\n\n<ul>\n<li>You actually intent to use the neo network right now, but aren&#39;t sure you want to continue using it a lot in the future.</li>\n<li>You can&#39;t afford a full NEO (note NEO isn&#39;t divisible, but GAS is)</li>\n<li>You want to deploy a smart contract on NEO (note, you might be able to save on GAS costs by using MCT)</li>\n<li>You want to speculate on the price of GAS</li>\n<li>You are worried NEO being counted as a security and therefore prefer holding GAS if you&#39;re not legally allowed to hold securities.</li>\n</ul>\n\n<p>Market caps of competitors:</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Name</th>\n<th align=\"left\">Market cap (in billions)</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">GAS (native NEO fee token)</td>\n<td align=\"left\">$0.047</td>\n</tr>\n<tr>\n<td align=\"left\">Ethereum</td>\n<td align=\"left\">$221</td>\n</tr>\n<tr>\n<td align=\"left\">BNB (Binance Smart Chain)</td>\n<td align=\"left\">$40</td>\n</tr>\n<tr>\n<td align=\"left\">Polkadot</td>\n<td align=\"left\">$29.5</td>\n</tr>\n<tr>\n<td align=\"left\">Cardano</td>\n<td align=\"left\">$28.8</td>\n</tr>\n<tr>\n<td align=\"left\">EOS</td>\n<td align=\"left\">$4.9</td>\n</tr>\n<tr>\n<td align=\"left\">TRON</td>\n<td align=\"left\">$4.3</td>\n</tr>\n</tbody></table>\n\n<p>edit: some clarifications</p>\n</div><!-- SC_ON -->",
  "score": 1029,
  "permalink": "/r/CryptoCurrency/comments/lndfnz/about_the_poorly_understood_sleeping_giant_neo/",
  "subreddit": "CryptoCurrency",
  "id": "lndfnz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332875936
}