{
  "author": "analogue_in",
  "the_new_excerpt": "I've been a hodler since 2013 with my personal money so I've been in the crypto\nspace for a long time.\n\nI own a small digital consultancy with a handful of employees and a liquid\nbalance sheet under 7 figures. Chump change compared to Micro Strategy, Tesla,\nand the big money. But these past couple…",
  "original_created_utc": 1612835072,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我从2013年开始用我的私房钱做了一个霍德勒，所以我一直在加密的\n空间很长一段时间。\n\n我拥有一个小型的数字咨询公司，有少数员工和一个流动的\n资产负债表低于7位数。与微战略、特斯拉相比，小钱。\n和大钱。但过去这几...",
      "title": "我是一个小企业主，我昨天刚把公司的流动资产负债表放到比特币里。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從2013年開始用我的私房錢做了一個霍德勒，所以我一直在加密的\n空間很長一段時間。\n\n我擁有一個小型的數字諮詢公司，有少數員工和一個流動的\n資產負債表低於7位數。與微戰略、特斯拉相比，小錢。\n和大錢。但過去這幾...",
      "title": "我是一個小企業主，我昨天剛把公司的流動資產負債表放到比特幣裏。"
    }
  ],
  "title": "I'm a Small business owner, I just put my company's liquid balance sheet into Bitcoin yesterday.",
  "created_utc": 1612881658,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been a hodler since 2013 with my personal money so I&#39;ve been in the crypto space for a long time.</p>\n\n<p>I own a small digital consultancy with a handful of employees and a liquid balance sheet under 7 figures. Chump change compared to Micro Strategy, Tesla, and the big money. But these past couple days I converted everything over to BTC bar some fiat for operational costs. I just finished the transactions yesterday thinking &quot;It&#39;s basically at an all time high but the price I paid will likely seem like a bargain in 5 years time&quot;. Fortunately it already is as of today.</p>\n\n<p>A major tipping point in this decision came from Saylor&#39;s interview with Ross Stevens and specifically the comment &quot;For us everything&#39;s getting cheaper&quot;. That&#39;s been the case with my personal funds so why not with my company&#39;s funds?</p>\n\n<p>So yeah, you don&#39;t have to be Tesla to do it.</p>\n\n<p>To Mars Bitches.</p>\n</div><!-- SC_ON -->",
  "score": 255,
  "permalink": "/r/Bitcoin/comments/lfrllh/im_a_small_business_owner_i_just_put_my_companys/",
  "subreddit": "Bitcoin",
  "id": "lfrllh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123191932
}