{
  "author": "Hairy_Sky_5410",
  "the_new_excerpt": "Guys, I know you might not care and that's fine. For those who may be interested\nand want to know how I did it, I want to share my journey to 1 Bitcoin.\n\nLike most of you, I started in 2017 during the bull run (around May).\n\nI started by buying $100 a Bitcoin which was around 0.05 Bitcoin. I wanted…",
  "original_created_utc": 1611238968,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "伙计们，我知道你们可能不关心，这很好。对于那些可能感兴趣的人\n并想知道我是怎么做到的，我想分享一下我的1比特币之旅。\n\n和你们大多数人一样，我是在2017年牛市期间（5月左右）开始的。\n\n我一开始买了100美元一个比特币，大约是0.05比特币。我想...",
      "title": "2100万俱乐部! (FINALLY!!)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "夥計們，我知道你們可能不關心，這很好。對於那些可能感興趣的人\n並想知道我是怎麼做到的，我想分享一下我的1比特幣之旅。\n\n和你們大多數人一樣，我是在2017年牛市期間（5月左右）開始的。\n\n我一開始買了100美元一個比特幣，大約是0.05比特幣。我想...",
      "title": "2100萬俱樂部! (FINALLY!!)"
    }
  ],
  "title": "21 MILLION CLUB! (FINALLY!!)",
  "created_utc": 1611307106,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Guys, I know you might not care and that&#39;s fine. For those who may be interested and want to know how I did it, I want to share my journey to 1 Bitcoin.</p>\n\n<p>Like most of you, I started in 2017 during the bull run (around May).</p>\n\n<p>I started by buying $100 a Bitcoin which was around 0.05 Bitcoin. I wanted to make a quick buck and later on sold it for around $500. through to the end of 2017 invested I around $3000 into various alt coins and had almost no Bitcoin. It was alt season and money was made.</p>\n\n<p>I sold my whole position and cashed out my profits. I spent 2018-2019 on the sideline and just passively watched every few weeks.</p>\n\n<p>(BIGGEST LESSON) \nIt was 2019, I had nothing in crypto and I watched Bitcoin bottom at $3,000. At that time I had around $3,000 of savings and was waiting to buy, I thought it was going to go lower.... I was wrong, so wrong... \nI was greedy and wanted more, I thought I could sneak in a bit more than 1 Bitcoin but looking back now, not being in the market was dumb (A lesson for some)</p>\n\n<p>I watched Bitcoin smash past $6,000 and by Mid 2019, Bitcoin was around $9,000 and I chose to buy. I had around 0.3 Bitcoin at this point.</p>\n\n<p>I bought some more here and there and accumulated to 0.5 Bitcoin by around early 2020. I bought 0.2 Bitcoin during the March selloff and was flying high. I was eager to make the most of the dip even though there was mass fud.</p>\n\n<p>I thought I would trade and of course lost around 0.3 Bitcoin. Back to around 0.4Bitcoin.\nThis was hard for me to recover and it took me a while to move on as it was a large part of my portfolio.</p>\n\n<p>The rest of 2020 was about accumulating and I managed to get around 0.6 Bitcoin by Sep 2020.</p>\n\n<p>As Bitcoin rose quickly from Sep to Dec 2020, I was eager to hit 1 Bitcoin quickly and 2021 would be my year. I knew it would be almost impossible to just save so I decided to go all in.</p>\n\n<p>I had some gold and silver and decided to sell and convert to Bitcoin and got a bit more. I managed to find some extra funds and trade (don&#39;t trade and over leverage guys, I got lucky) abit to accumulate the remaining 0.4.</p>\n\n<p>I recently bought some more BTC today during this dip to finalise the deal!</p>\n\n<p>I&#39;m glad to say I can join the club and I&#39;ll never go back!</p>\n\n<p>It was a hell of a 3 year journey but if you persist, you can do it!!</p>\n\n<p>Keep stacking and believing cause if there&#39;s a will, there&#39;s a way!</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/Bitcoin/comments/l1zdaz/21_million_club_finally/",
  "subreddit": "Bitcoin",
  "id": "l1zdaz",
  "is_self": true,
  "media": null,
  "is_video": false
}