{
  "author": "Wunic",
  "original_created_utc": 1627086192,
  "title": "[19M] I used to be 100% straight, but I think being a (non-hateful) incel for 3 years turned me gay. Is this at all possible? (I'm no longer an incel) [NSFW]",
  "created_utc": 1627133586,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Before I start this post, I just want to say that <strong>I never hated women or had any resentment for them</strong>. I was just an extremely lonely and depressed guy with no self esteem.</p>\n\n<p>Sorry for the bad grammar, I&#39;m typing this at 3:00 am on my phone and I&#39;m tired af</p>\n\n<p>Ok, so basically, when I started high school I became extremely depressed. This was due to many reasons. Going over them all would take too long so I&#39;m not going to, but all you need to know is that I was so depressed that I spent my breaks between lessons secretly cutting myself in the school bathrooms, I never talked to anyone at school due to language barriers, the instant I got home every day I just went straight to lie in my bed and cry and I was genuinely suicidal. I&#39;m still kinda suicidal and the only readon I haven&#39;t killed myself is that I don&#39;t want to make my parents sad, but my mental health is infinitely better now than it was during my first two years in high school. </p>\n\n<p>One of the things that made me so depressed was that during my first year of high school I developef this idea that I was extremely ugly. This lead me to fall down the &quot;incel&quot; rabbithole, and as a result I started spending a lot of time in online incel communities, which in turn made me even more depressed. It was a vicious cycle. Unlike most of the other incels in those communities, I however never became hateful towards women (thank god). I believed that due to evolutionary reasons, women were simply incapable of ever loving someone as ugly as me, but I never hated them for it because I thought that hating women for what evolution has made them like makes no sense as it isn&#39;t something they have control over. </p>\n\n<p>Truth be told, back then I WAS pretty ugly. I had acne all over my face and a short hairstyle that didn&#39;t suit my face at all. Every time I looked for advice on how to improve online, people just told me to go to the gym, and as a result, I went to the gym 5 days a week for 3 years. There was even one summer holiday when I spent 4 hours in the gym 7 days a week. I&#39;m not exaggerating. I made some pretty significant gains, but I felt like it didn&#39;t make me look better at all. It made me look more muscular for sure, but I didn&#39;t see it as an improvement. </p>\n\n<p>Despite this, back then I thought I wasn&#39;t enough of a &quot;masculine chad&quot; for women to find me attractive, and as a result, I tried deliberately to be as &quot;manly&quot; as possible to the point where it was comical (this is cringe, I know). I wore t-shirts that were too tight to make myself look more muscular, I had a military backpack, I refused to do any kind of skincare because I thought skincare was &quot;too girly&quot;, I tried to deliberately talk more loudly and sit with my legs more spread out, etc. It was really stupid but I genuinely thought that doing these things would make me more attractive to women so I did them. It was extreme cringe but back then it didn&#39;t feel like it.</p>\n\n<p>Everything changed when the pandemic began. All the gyms got closed and so did the barber shops. As a result, during 2020 I lost pretty much all the gains I had worked so hard for and I became really skinny again. At first I was super frustrated by it, but after a while I just stopped caring. To my surprise, I actually like the way I look skinny more than I liked the way I looked muscular. Due to the barbershops being closed my hair also grew much longer than it had ever been before. Once again, I was shocked by how much better I look with long hair. It&#39;s like me trying to improve my looks was actually making me uglier, and the pandemic corrected it all. I can&#39;t describe how big of an improvement it was. I went from hating the way I looked to being sort of okay with the way I look simply because my hair grew longer and I got skinnier. </p>\n\n<p>At this point I had already fully accepted that no woman could ever love me. I was no longer in grief over it. I had fully accepted it as a fact so it simply didn&#39;t jother me anymore. Therefore, I thought to myself, since no woman is ever going to love me no matter what, what even is the point of trying to act so hard to be attractive to them? I realized that there was no point, and I stopped trying to fake an overly masculine personality to attract women since I accepted that no matter what I did, nothing would work. Since I was no longer forcing myself to be comically masculine, I allowed myself for the first time to do things that I had considered to be &quot;too girly&quot; in the past. I got really into skincare and got rid of my acne, I discovered that I loved interior designing and begun working on giving my room a room makeover, etc. I felt like I had nothing to lose so I just began doing whatever the hell I wanted to no matter how feminine it was. I didn&#39;t care how it would affect my reputation since I felt like I had no reputation to begin with and that I&#39;d be stuck at rock bottom for life anyway no matter what. I even learned to style my now very long hair using a straightening iron into a haircut that I would&#39;ve considered wayyy too feminine in the past and I began wearing foundation. As a result, it&#39;s like, for the first time I was actually happy about the way I looked. Like, I genuinely felt happy every time I looked in the mirror which is something I never, ever could&#39;ve even dreamt of back when I had my shorter haircut. I no longer considered myself an incel at this point, because I was now genuinely really happy with the way I looked. And it wasn&#39;t just me. When I asked people to rate photos of me with short hair and photos of me with the &quot;feminine&quot; longer hair, everyone always rated the photos of me with longer hair much, much higher without exception. </p>\n\n<p>Last summer, pretty much exactly a year ago, is when the gay shit began to happen. I just want to say now that I used to be 100% straight prior to this. Before last summer, I had never, EVER felt ANY attraction towards anyone who wasn&#39;t a woman. Never. I had never, ever in my life had even a single non-hetero thought before this. </p>\n\n<p>Basically, I could no longer watch porn with girls in it because knowing that not a single girl in the world could ever love me made me too sad. When I saw girls in porn, it didn&#39;t make me horny, it just made me sad. Knowing that all those girls I was fapping to would see me as subhuman scum if they ever became aware of my existence just made it impossible for me to enjoy anything with women in it anymore.</p>\n\n<p>I still felt like I needed to get off somehow, and as a result, one night I decided to try watching gay porn juat as a test. I wasn&#39;t really into the idea, but it was my only option since women were ruined for me. The first time I watched it I didn&#39;t really enjoy it, but after like, the third time I got really hooked to it. It got to the point where I no longer even wanted to have sex with a woman, and only thought about guys. Like, nowadays I can look at pictures of naked girls and literally feel nothing no matter how hot they are and no matter how hard I try to get turned on by them, yet if I see completely non-sexual pictures of cute guys while I&#39;m browsing Pinterest I&#39;ll easily get turned on even when I&#39;m not trying to. I don&#39;t even want to be in a relationship with a woman anymore either. Nowadays whenever I daydream about relationships, it&#39;s always with another guy.</p>\n\n<p>About a month ago I began secretly crossdressing. I ordered some girly clothes and makeup online, and I secretly dress as a woman whenever my parents aren&#39;t home. I don&#39;t know why I began doing it. I just felt a strong urge to do it and I have no idea why. All I know is that in the past I would&#39;ve NEVER even thought about doing something so shameful and that I considered everyone who did such things complete degenerates. Hell, I still consider it degenerate but I&#39;m doing it anyway.</p>\n\n<p>Wtf is happening to me? I used to be 100% straight. I used to think sexuality was something you were born with but now I no longer know what to believe. I feel like accepting that no woman could ever love me caused me to become gay. Is that even possible? Has anyone experienced anything similar? And if anyone knows wtf is going on, is there any way I can turn myself straight again?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/oqf5ae/19m_i_used_to_be_100_straight_but_i_think_being_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "oqf5ae",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Before I start this post, I just want to say that I never hated women or had any\nresentment for them. I was just an extremely lonely and depressed guy with no\nself esteem.\n\nSorry for the bad grammar, I'm typing this at 3:00 am on my phone and I'm tired\naf\n\nOk, so basically, when I started high…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この記事を始める前に言っておきたいのですが、私は女性を嫌ったり、恨んだりしたことはありません。\n恨んだこともありません。私はただ、自尊心のない、非常に孤独で憂鬱な男でした。\n自尊心がなかったのです。\n\n文法が悪くてすみません。午前3時に携帯電話でこれを打っていて、疲れました\naf\n\nさて、基本的に私が高校に入学したときは...",
      "title": "[19M] 私はかつて100％ストレートでしたが、3年間の（憎しみのない）インセル（同性愛者）生活でゲイになってしまったと思います。このようなことは全くあり得ませんか？(私はもうインセルではありません) [NSFW] 。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我开始这篇文章之前，我只想说，我从来没有恨过女人，也没有对她们有任何\n怨恨她们。我只是一个极其孤独和抑郁的人，没有\n自尊心。\n\n抱歉我的语法不好，我是在凌晨3点用手机打的，我很累。\naf\n\n好的，所以基本上，当我开始上高中时...",
      "title": "[19M]我曾经是100%的直男，但我认为当了3年的（非仇恨的）不伦恋者，使我变成了同性恋。这到底有没有可能呢？(我不再是不道德的人了) [NSFW]"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我開始這篇文章之前，我只想說，我從來沒有恨過女人，也沒有對她們有任何\n怨恨她們。我只是一個極其孤獨和抑鬱的人，沒有\n自尊心。\n\n抱歉我的語法不好，我是在凌晨3點用手機打的，我很累。\naf\n\n好的，所以基本上，當我開始上高中時...",
      "title": "[19M]我曾經是100%的直男，但我認爲當了3年的（非仇恨的）不倫戀者，使我變成了同性戀。這到底有沒有可能呢？(我不再是不道德的人了) [NSFW]"
    }
  ]
}