{
  "author": "redditsgarbageman",
  "original_created_utc": 1629171802,
  "title": "I remember thinking in 2016 that it was too late to invest in crypto.",
  "created_utc": 1629193200,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I remember when a buddy of mine in college started mining Bitcoin around 2011. I don’t even think it was over $1 at that point. By 2015, he was already pretty wealthy. Then he became very rich. He tried so many times to get me to start mining back in 2011, and I even did for a brief period of time, but I gave it up and eventually lost track of whatever wallet I used. </p>\n\n<p>The point of the story here is that when you watch people make huge gains off Bitcoin or other coins, it’s easy to think that the chance for you to do the same has past. But that’s definitely not the case. The total market cap of crypto is still a small fraction of the dollar. There is still massive growth that’s going to happen. Today is as good a time as any to start with crypto.</p>\n</div><!-- SC_ON -->",
  "score": 187,
  "permalink": "/r/CryptoCurrency/comments/p5w1ne/i_remember_thinking_in_2016_that_it_was_too_late/",
  "subreddit": "CryptoCurrency",
  "id": "p5w1ne",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I remember when a buddy of mine in college started mining Bitcoin around 2011. I\ndon’t even think it was over $1 at that point. By 2015, he was already pretty\nwealthy. Then he became very rich. He tried so many times to get me to start\nmining back in 2011, and I even did for a brief period of time,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2011年頃、大学時代の仲間がビットコインの採掘を始めたのを覚えています。I\nその時点で1ドルを超えていたとは思えません。2015年には、彼はすでにかなりの\n裕福になっていました。その後、彼はとてもリッチになりました。彼は2011年に私にマイニングを始めさせようと何度も試みました。\n2011年に私にマイニングを始めさせようと何度も試み、一時的に始めたこともありましたが...。",
      "title": "2016年には、「暗号に投資するのは遅すぎる」と思っていたのを覚えています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我记得在2011年左右，我的一个大学同学开始挖比特币。I\n我甚至不认为它在那个时候是超过1美元的。到了2015年，他已经是相当\n富了。然后他变得非常富有。他曾多次试图让我开始\n早在2011年就开始采矿，我甚至做了一段短暂的时间，...",
      "title": "我记得在2016年的时候，我认为现在投资加密货币已经太晚了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我記得在2011年左右，我的一個大學同學開始挖比特幣。I\n我甚至不認爲它在那個時候是超過1美元的。到了2015年，他已經是相當\n富了。然後他變得非常富有。他曾多次試圖讓我開始\n早在2011年就開始採礦，我甚至做了一段短暫的時間，...",
      "title": "我記得在2016年的時候，我認爲現在投資加密貨幣已經太晚了。"
    }
  ]
}