{
  "author": "Cultural_Dirt",
  "the_new_excerpt": "Hello All, this is my first DD. It is long but I hope you will enjoy it. I\nwanted to do an in-depth dive into the company Forum Merger 3 (FIII) , who is\nmerging with Electric Last Mile Solutions, an EV company specializing in last\nmile delivery and work vans. FIII will be the first and only Class 1…",
  "original_created_utc": 1613418434,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，这是我的第一篇DD。虽然很长，但希望大家能喜欢。I\n想对论坛合并3(FIII)这家公司做一个深入的了解，他是谁？\n与电动汽车公司Electric Last Mile Solutions合并，这是一家专门从事最后一公里的电动汽车公司。\n里的送货和工作车。FIII将是第一个也是唯一一个1级...",
      "title": "电动最后一英里解决方案的巨大丈量。美国唯一的1级电动车!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，這是我的第一篇DD。雖然很長，但希望大家能喜歡。I\n想對論壇合併3(FIII)這家公司做一個深入的瞭解，他是誰？\n與電動汽車公司Electric Last Mile Solutions合併，這是一家專門從事最後一公里的電動汽車公司。\n裏的送貨和工作車。FIII將是第一個也是唯一一個1級...",
      "title": "電動最後一英里解決方案的巨大丈量。美國唯一的1級電動車!"
    }
  ],
  "title": "Huge DD on Electric Last Mile Solutions. Only Class 1 EV in the US!",
  "created_utc": 1613439361,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello  All, this is my first DD. It is long but I hope you will enjoy it. I  wanted to do an in-depth dive into the company Forum Merger 3 (FIII) ,  who is merging with Electric Last Mile Solutions, an EV company   specializing in last mile delivery and work vans. FIII will be the first   and only Class 1 electric vehicle on the market, coming as early as  Q3,  with no other Class 1 EV as competition. They are also bringing a  Class  2 EV truck to market next year. A key factor in allowing ELMS to  be  first to market in Class 1 is the fact that they are taking over the  old  Hummer plant in Indiana. Additionally, they have the luxury of  working  with an already successful EV company, allowing for instant  transposition of truck plans ready for production.</p>\n\n<p>FIII has intrigued me  from the get go being an EV company, yet it has  received little to no  attention which is reflected in the current stock  price. There has been  little to no movement on the stock other than  some sideways and  downwards action, which is atypical behavior for most  EV companies. So what  gives?</p>\n\n<p>After doing some digging, it appears that the main concern holding   back most investors back from committing to this great company is their   connection and relations to (((CHINA))), which comes by way of a   company in particular called Sokon Automotive.This concern is not   unwarranted, as ties to China have been an issue of concern in the   market lately. As investors, especially when dealing with new companies,   we want maximum transparency, which seems almost impossible any time   we&#39;re dealing with a Chinese company. However, as my research has shown,  the ELMS relationship with China is nothing to be concerned about. In   fact, it is quite the opposite – something that will help propel them   forward and accelerate their process through previously successfully   developed truck plans and numerous industry connections.</p>\n\n<h1>I.  The Team</h1>\n\n<p>First,  let&#39;s take a look at who is behind the team. As we have come  to know, a  company is only as good as the team behind it. The team behind  ELMS is an   All-Star cast of players in the auto industry with years of  experience  and accomplishments.  After looking into each of the team  members, some  interesting connections emerged amongst them and amongst  different   auto/EV companies(including a connection to Tesla) . These  connections  made some of the pieces start to fall into place. In  particular, I  wanted to figure out more so their connection to the  Chinese players.  Was it sketchy and something to be concerned about?  After digging deeper  my questions were answered.</p>\n\n<p>​</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>The Allstars</em></strong> <strong><em>-</em></strong></p>\n\n<p><strong>James (Jim) Taylor</strong> – 35+ years experience – CEO and Founder of ELMS, former executive at <strong>Karma</strong>. Former CEO of <strong>Workhorse,</strong>   he pivoted the company’s focus from the electrification of cars and   SUVs to medium duty commercial trucks. Former CEO of SF Motors, now   known as Seres(owned by Sokon, the company they are working with).   Worked at <strong>General Motors</strong>, serving as President of <strong>Cadillac</strong> and CEO of <strong>Hummer</strong>.   Led the design and technology upgrading of the new model of Cadillac,   which contributed to the revival of the brand. This guy is the   powerhouse behind ELMS. James knows what it takes to build a company and   what it takes to pivot to the emerging world of  EVs. He probably has   some of the most experience of anyone in the industry when it comes to   EVs, having worked on both Karma (with Henrik Fisker of FSR) and   Workhorse which we all know. His innovation and experience on developing   different types of EVs, will allow for future design and build   improvements. Jim, also Canadian, is known as “The Great One” when it   comes to the EV world. He is also known as Jim “The EV Man” Taylor,   because like the show Home Improvement, he is always building and   innovating in the garage.</p>\n\n<p><strong>Jason Luo</strong> – 25+ years experience -  Executive Chairman and Co-Founder of ELMS. Former CEO of Key Safety Systems, <strong>Ford</strong> China and <strong>Accuride</strong>.    Jason served for nearly a decade as CEO of Key Safety Systems (now   Joyson Safety Systems), one of the largest automotive safety companies   in the world.  Oversaw the company’s acquisition of Takata Corporation   for $1.6 billion. Jason currently serves on the board of directors of   Accuride, Elo Touch Solutions, ATC Drivetrain and Sybridge Technologies.    He has extensive experience in the automotive world and more   importantly with large companies. In addition he has been through a few   different mergers and acquisitions which is an added benefit. He knows   what it takes to come out on top.</p>\n\n<p><strong>Shauna McIntyre, -</strong> 20+ years <strong>-</strong> CEO, Sense Photonics, Inc. (LiDAR) and Former program lead, <strong>Google</strong> automotive services, <strong>Alphabet</strong>,   Inc .  She previously led Google’s automotive services program, during   which time she released Google products, including Google Maps, into   automakers’ new vehicle models. Since 2019, she has served on the Board   of Directors of Lithia Motors, the world&#39;s 3rd largest auto dealer.   One  interesting piece of info I found is that she is the co-founder of a   group called <strong>The North American Council for Freight Efficiency</strong>   (NACFE). They focus specifically on turning the transportation  industry  into a more economical and EV friendly space. One video I  found on  their group website was called “High-Potential Regions for  Electric  Truck Deployments”. It talked about geographical areas they  want to  focus on and develop – one of them being the Great Lakes. Guess  where  the new ELMS factory will be? Right around the Great Lakes.   This group  puts out monthly newsletters and events , so she can use  this board as a  means to spread the word throughout the industry.  Interestingly enough,  this group just started running an EV truck demo  for data collection  and analytics, and two of the companies already  involved are  GIK(Lightning E-motors) and Workhorse.</p>\n\n<p><strong>Richard Peretz, -</strong> 40+ years <strong>-</strong>  Former CFO, <strong>United Parcel Service (UPS)</strong>,    during which time he opened UPS operations in China. Richard also   helped expand the company’s international  footprint in many European   and Asian countries. You can bet that this will help ELMS get some   international connections. Hes overseen numerous acquisitions, as well   as being a leading member of the team that managed UPS’s IPO in 1999, at   the time the largest in U.S. history. He is no stranger to   understanding what it takes to make a new operation a successful one.</p>\n\n<p><strong>Brian Krzanich, -</strong> 25+ years -  CEO, CDK Global (one of the biggest technologies for dealerships) and Former CEO, <strong>Intel Corporation</strong>.   Oversaw the acquisition of companies such as autonomous driving  company  Mobileye. This guy is a pimp daddy. He was forced to resign  from Intel  because he got caught having a relationship with an  employee. You could  say she really turned his software into hardware!  Brian currently serves  on the boards of AMS AG and Footprint US  (sustainable technology). He  previously served on the Boards of Deere  &amp; Company and Semiconductor  Industry Association, as well as  serving as the Chair of the FAA Drone  Advisory Committee. He is the go  to guy for the chips and computers for  the vehicles. This will help  with any autonomous driving they have  planned, as well as their on  board ELMS AIR system (more on this later).</p>\n\n<p><strong>Neil Goldberg</strong>,  - 45+ yrs – Director of Forum,  Chairman and CEO, Raymour &amp;  Flannigan Furniture and Holdings. Many  years of retailing, merchandising  and general management experience.</p>\n\n<p><strong>David Boris –</strong>  30+ years - Co-CEO and CFO, Forum  Merger III Corporation. Has been  involved in approximately 20 merger transactions as a board member,  underwriter and M&amp;A advisor.    Director of Tattooed Chef, Inc.,  which completed its merger with Forum  Merger II Corporation in October  2020. TTCF has done suprisingly well,  despite it being one company that I  was not fond of due to my nutrition  background. I think the food itself  is over priced crap but it has held  steady in price ever since merger  completion. This bodes well for  FIII.</p>\n\n<p>​</p>\n\n<p><strong><em>Other Members of the Team</em></strong> <strong><em>-</em></strong></p>\n\n<p><strong><em>Jerry Hu</em></strong>  – 25+ years - COO , Safety  expert, global operation leadership and Asia  head for Key Safety  Systems, commercial leadership and other management  at <strong>Accuride</strong> and <strong>Volkswagen.</strong></p>\n\n<p><strong><em>Justin Prann</em></strong> – 15+ years – CCO , National VP of Sales and Service for <strong>Mahindra Automotive</strong> North America (in the running for the USPS contract), senior positions within <strong>BMW</strong> North America.</p>\n\n<p><strong><em>Kev Adjemian</em></strong> <strong>–</strong> 20+ years – CTO, Global Head of Battery Cells at <strong>Fiat</strong> <strong>Chrysler</strong> Automobiles and VP of Powertrain and EV Systems, including OTA, at <strong>Karma</strong>. Fuel cell, battery and electric powertrain R&amp;D leadership at <strong>Nissan.</strong></p>\n\n<p><strong><em>Albert Li</em></strong> – 20+ years - CFO of EV startup Byton(led by Carsten Breitfeld , the now ceo of Farraday Future), and <strong>Ford</strong> China, senior positions at Bombardier in charge of aerospace operations in China.</p>\n\n<p><strong><em>Benjamin Wu</em></strong>  – 15+ years – GC, Chief Legal  Officer and Administration    head for  Meridian, with extensive  experience in M&amp;A and international  corporate transactions for both  private and public companies.</p>\n\n<p>So  as we can, see this team is ridiculously good and has excellent   connections that run deep, not only in the US , but in China, and other   places around the world. The fact that the Chinese companies that are   connected with the team include the likes of Ford and UPS, tell me that   there is a legitimacy to their business dealings. This team covers many   bases that are necessary for ELMS to be a top contender in the ev  world.  These players have tons of experience, have held top level  positions at  top tier companies, and have the knowledge and know-how in  many  different aspects of electric vehicles and the industry overall.</p>\n\n<h1>II. What Does ELMS Do?</h1>\n\n<p>Now  that we know who ELMS is , lets take a look at what exactly they   do.ELMS offers the only Class 1 EV in an underserved commercial  delivery  industry.  Some of the advantages ELMS has over other EV  companies  include:</p>\n\n<p>▪First and Only Class 1 .  The fact that they are a first mover is  absolutely HUGE for  establishing themselves and cashing in on the  opportunity of being alone  in the field.</p>\n\n<p>▪Factory in Indiana already kitted out for EV production</p>\n\n<p>▪Cars ready by Q3 of this year. Most EV companies aren&#39;t on the road until 2022 and later</p>\n\n<p>▪Lowest total cost of ownership in Class 1</p>\n\n<p>▪Already proven successful product based off top selling 2020 EV model in China</p>\n\n<p>Here is a pretty chart comparing them to some competitors. Note – this is from December so it may have changed some since.</p>\n\n<p>​</p>\n\n<p>The  ELMS Urban Delivery van costs the same or cheaper as its  gasoline  counterparts ($32,500-7500 credit =$25k),  but has 35% more  cargo space ,  at 170 cubic ft, and a cheaper total cost of ownership by  35% (50%  compared to a class 2). The cost per year comes to around  $1550 for ELMS  Urban Delivery vs $4000 for a regular gas Class 1. It  becomes even  cheaper when you factor in the extra cargo volume per  cubic ft that it  provides.The 2022 Class 2/3 model will have 218ft. It  appears that they  have plans to make different variations of their  Class 1 and Class 3,  being able to turn them into Class 2s as well  based off individual  needs. They will have a range of 150 to 200 miles  and be capable of a  full recharge in as little as two hours. These  types of vans are used in  many capacities of our society. For example,  delivery and ecommerce  (Amazon, Fedex, DHL), communications (Verizon,  Comcast), small  businesses (local flower shop, food trucks), and  utility and local  municipality vehicles. There is no lack of demand for  these types of  vehicles.</p>\n\n<p>A cool feature that will  probably be a huge sales point for ELMS  that I think has been  overlooked, is that they will be upfitting the  vans themselves.  Upfitting is the process of taking the vehicle to a  specialist to be  equipped to meet the specific needs of that business.  This includes  things like installing custom drawers and cabinets,  shelving, lighting,  power supplies, etc. The typical upfitting process  involves a 3rd party  vendor or sometimes numerous different ones, and  takes on avg 130-140  days from order to delivery. The ELMS custom  upfitting process allows  for :</p>\n\n<p>▪ ~25% reduction time from order to delivery</p>\n\n<p>▪ One warranty single point of contact for customer</p>\n\n<p>▪  Total vehicle value chain cost reduced by 5+%ELMS are also  currently in  talks with the leading upfitter brands IVS, Adrian Steel,  and Auto  Truck Group.</p>\n\n<p>I have found no other EV that has said they will be doing something like this yet.</p>\n\n<p>​</p>\n\n<p>Next,  the ELMS vehicles will be connected with a system called ELMS  AIR, an  over-the-air programming system. I have not been able to find  much  information about any specifics except for some clues in their  investor  presentation.  They will use these over-the-air data systems  in  partnership with the industry leading Geotab to provide many  benefits to  their customers. Some areas that will be serviced include :</p>\n\n<p>▪Productivity - accurate arrival and departure times ,true trip miles</p>\n\n<p>▪Optimization - increase energy efficiency, record powertrain diagnostics, vehicle maintenance</p>\n\n<p>▪Compliance - electronic driver logs, tax reporting, vehicle inspection reports</p>\n\n<p>▪Expandability - system integration, hardware add-ons &amp; software add-ins</p>\n\n<p>Some  of the obvious benefits of a type of system, like we see in  Tesla for  example, are the ability for the software updates to happen  frequently  and easily, along with data  constantly being in  communication with the  main servers. The more data that is able to be  collected, the better  optimized these services and vehicles can be. The  experience and  knowledge of BigPoppa Brian Krzanich from Intel will   be valuable in  this aspect. What we will end up seeing with a system  like this is more  and more areas of value for the companies buying it.  For example, there  will be savings from being able to easily collect  accurate tax data and  driving logs from the drivers. Time will also be  saved with something  such as the automated updates and knowing exactly  when a van will need  to be serviced or inspected. As time goes on and  more data becomes  collected, the ELMS AIR service will only prove to be  more valuable for  both the company and their customers.</p>\n\n<p>&#x200B;</p>\n\n<h1>III. Sales and Financials</h1>\n\n<p>The  FIII team has  $250 million in trust, and $155M PIPE in  connection with  the merger. ELMS will have a  $1.4billion enterprise  value at closing.  The ELMS team is expected to have $379 million of  cash to fund  operations and growth. They have said that no additional  capital  requirements are needed after close to achieve positive cash  flow.  With  their $379 million cash minus $150mill in debt, that gives  us $229  million in net cash to work with. There are a total of  142,500,000  shares. Current market cap at the share price of $12, gives  us $1.71  billion.</p>\n\n<p>ELMS currently has 30,000  pre-orders for its delivery van,  representing a revenue of $1billion.  They expect another 30,000 to  60,000 orders by the middle of 2021. Some  of the companies they are in  talks with or have preorders from already,  include: Penske, Cox +  Siemens (cant make that up), Merchants,  Enterprise, IVS, and others.  These contracts will work directly with  companies such as Ikea, Best  Buy, Walmart, Fedex, Ryder and more. The  experience and connections of  the team will no doubt lead to more  contracts in the future.</p>\n\n<p>The ELMS  business plan includes a conservative volume ramp, with  approximately  4,000 vehicles expected to be delivered by the fourth  quarter of 2021,  accelerating to approximately 19,000 deliveries in  2022, and  approximately 35,000 deliveries in 2023. “Our team  collectively has  decades of experience launching vehicles for global  OEMs, and so while  the facility has an annual production capacity of  100,000 units, we are  deliberately conservative in our initial volumes  so that we can be  laser-focused on quality and, as a new brand,  establishing an excellent  reputation with our customers.”</p>\n\n<p>I  have seen some grumblings about the fine print of the 30,000  preorders  being “contingent upon satisfaction of customer  requirements.” As you  will see shortly, this is a successful and more  than satisfactory  vehicle and has been proven to be so based off its  Chinese sales all  year. I have zero doubt that this team will give the  customers  everything they want and then some. If anything, I would  expect the ELMS  vehicles be even better than their Sokon counterpart.</p>\n\n<p>​</p>\n\n<p>​</p>\n\n<p><strong>****Put on your tinfoil hat and sunglasses and follow me real quick**\\</strong><em>\\</em></p>\n\n<p><em>THEORY #1</em>: ELMS will receive a future contract due to its relation to the new <strong>Secretary of  Transportation, Pete Buttigieg</strong>.   Before his run for president last year, good ole Petey boy was the   mayor of South Bend, Indiana. He has been known to have very mixed   results there in terms of popularity, but he did put an emphasis on   creating more jobs and projects to rebuild the area. Guess where the new   ELMS factory is located? Yup, literally right next to South Bend in  the  bordering town of Mishikawa. Could it be possible that ELMS will  have  first priority now for any new government contracts relating to EV  delivery or services, or maybe additional funding/credits? Quite possibly. We all know of Biden&#39;s plan to electrify the US, and now Mayor  Pete has a perfect opportunity to give back to his hometown and bring   more jobs and prosperity to South Bend and the surrounding areas. And as a matter of fact, Pete Buttigieg  actually held a campaign rally at the ELMS(Hummer) factory last year. This means ELMS are 100% on his  radar.</p>\n\n<p><em>THEORY #2</em>:  This picture right here was mentioned in the  investor presentation when  they were giving examples of how their  trucks will be used for  municipalities. At first glance I thought  nothing of it and said hey  just some random counties they have worked  with. The Michigan and  Indiana seals make sense since that&#39;s where they  are located. And the  California ones also since that&#39;s where most of  the former employees and  Seres motors was headquartered. But then I  noticed the top left seal,  from Fairfax, Virginia. This just so happens  to be right next to my  hometown so I am very familiar with this area.  Why does the Fairfax, VA  seal appear alongside those of Michigan,  Indiana, and California?  A  side note about Fairfax County – it is very  wealthy and very liberal.  Turns out they have quite a few Green  Initiatives in action. Last year  they stated that “One-hundred percent  of eligible county vehicles  scheduled for purchase in fiscal year 2021  shall be replaced with  electric vehicles and the infrastructure needed  can be supported in  fiscal year 2021.”  Just a few weeks ago another  article stated “Fairfax  County Public Schools is getting its first  electric school bus today as  part of a statewide initiative led by  Dominion Energy.” Interesting! It  seems quite obvious Fairfax County is  gearing up for wide scale EV  adoption, and wants to do implement it as  soon as possible. Maryland and  D.C. rank 8th and 9th for highest rate  of EV adoption, while Virginia  ranks 23rd. You can be damn sure they  will be looking to improve on that  number.</p>\n\n<p>​</p>\n\n<p>Speaking of government contracts, ELMS has <strong>ALREADY</strong>   received funding from the state of Indiana.  In late December, the   Indiana Economic Development Corporation (IEDC), which leads the state’s   economic development efforts,  offered ELMS a series of conditional  tax  credits and training grants based on its plans to create new jobs  in  its factory. The IEDC offered up to <strong>$10 million</strong> in conditional tax credits and up to <strong>$200,000</strong> in conditional training grants based on the company’s job creation plans. The IEDC also offered up to <strong>$2.8 million</strong>   in conditional tax credits from the Hoosier Business Investment (HBI)   tax credit program based on the company’s planned capital investment in   Indiana. This may not be that much money-wise, but it is an excellent   start to pave the way for future endeavors.</p>\n\n<p>Another  huge benefit for ELMS is that they have a fraction of the  typical  startup cost for EV production. The typical cost for entry into  the N.A.  market is around  $1.6 billion. With the help of the already  successful  Sokon, which provided about $570 million of investments  already, ELMS  only needs to contribute around $160 million. This gives  them much more  wiggle room to grow and try new things.If we compare  ELMS money  situation versus other EV competitors, “Rivian’s becoming  the poster  child, smoking through $2 billion, $3 billion,” Taylor said.  “If you  think $200 million to $300 million for product engineering,  ours is $80  million, That’s really just airbags, seat belts and  adapting to [U.S.  safety requirements]. Tooling is already in place  because SERES spent  $20 million for the canceled SUV plans. Earlier  post-Hummer occupants  also left some usable equipment behind. “Coming  off the existing  platform is worth hundreds of millions,” Taylor said.  “Supplier tooling  alone would normally be a couple hundred million.”  Well, that&#39;s a  bargain.</p>\n\n<p>The institutional ownership of FIII has been climbing recently. There has  been multiple funds purchasing within the last week:</p>\n\n<p>▪Alpine  Global Management, bought 2,135,286 shares (valued around   $25.6million), equaling 8.3% of FIII. One of the biggest purchases so   far.</p>\n\n<p>▪BNP Paribas Asset Management UK - 1,665,354 shares (~$20million) ▪Phoenix Holdings Ltd – 1,103,741 shares (~$12million)</p>\n\n<p>▪Bank of America – 70k shares (~$1mill)</p>\n\n<p>▪Toronto Dominion Bank – 15k shares (~$203k)</p>\n\n<p>▪STA Wealth Management – 13k shares (~$176k)</p>\n\n<p>▪UBS Group – Increased holdings by 90% to 14,418 shares (~$200k)</p>\n\n<p>We also have in the past month:</p>\n\n<p>▪Polar Asset Management Partners Inc. bought a stake worth $10,935,000.</p>\n\n<p>▪P Schoenfeld Asset Management LP bought a stake worth $5,964,000.</p>\n\n<p>▪Gabelli &amp; Co Investment Adviers bought a stake worth $1,772,000.</p>\n\n<p>▪Jefferies Group LLC bought a stake worth $1,305,000.</p>\n\n<p>I  have not seen an official number but the closest figure I can find  for  total institutional ownership is around 25-30% . I would imagine  this  will get larger once there is an official merger date.</p>\n\n<p>As  investors, we would like to see alternative revenue streams to  help the  company grow. ELMS has plans for a few different ways to  increase their  business. One of the main ways is that they will produce  their vans for  the entire North American market (CA and Mexico),  Europe, and China.  Just from the Chinese sales alone, ELMS is  estimating a potential upside  of $300 million. The other major way ELMS  will increase revenue is  through the monitization of their ELMS AIR  data. They will gather and  mine all the data and services from their  vehicles and then use this to  provide valuable information that other  companies will want to buy. They  will also use this data to optimize  and reduce fleet insurance costs.   This data has an estimated upside of  around $50-100 million in increased  revenue. As volume and sales also  increase, they will introduce  passenger van models, as well as rental  or subscription based services.</p>\n\n<p>Some key takeaways from the ELMS financial situation :</p>\n\n<p>▪No additional capital expected to be required after merger close to fund initial product launches</p>\n\n<p>▪Projected to be Cash Flow Positive by Q42022</p>\n\n<p>▪Estimated 83,000 Units by 2025, representing ~5% of U.S. Market</p>\n\n<p>▪Revenue projected to reach $3 Billion and EBITDA estimated at $791 Million by end of 2025</p>\n\n<h1>IV. The Indiana Factory</h1>\n\n<p>​</p>\n\n<p>Another <strong>MASSIVE</strong>  way that ELMS will save a boatload  of cash, and speed up the production  of their van, is through the  former Hummer plant that they will be  taking over in Mishawaka,  Indiana. This plant was originally used for GM  and Hummer, and then  once they folded it got taken over by James Taylor  and his former  company, Seres.  This plant has the capacity to assemble  100,000  vehicles annually, something that ELMS will most likely need to  do by  next year. The Indiana Office of Economic Development Executive   Director Bill Schalliol says “ELMS has worked out a deal with the United   Autoworkers Union, which has represented workers at this plant in   recent years. ELMS will initially launch with 140 workers, increasing   staffing to 450 workers when it reaches full production on one line of   smaller vans. Within four years, the company could have 960 employees if   it produces a second assembly line, manufacturing larger sized  delivery  vans.” The Mishawaka plant was selected because it has been  retrofitted  already for electric vehicle production, and has a strong  supply chain  and experienced workforce available. Seres had already put  <strong>$130 million</strong> into building this plant for EV use. How nice of them.</p>\n\n<p>Another  bonus that will help with the quality and speed of  production – workers  who are already familiar with the plant and  assembly line. The land  itself is not fully used yet either, and can be  used as a future site  for in house manufacturing of parts.</p>\n\n<p>In  addition to this plant, as of January, a new global headquarters  with  31,000 square feet of space and capacity for nearly 200 employees  has  been built in Troy, Michigan. The global headquarters strategically   positions ELMS in the center of a network of suppliers and partners  and  provides access to one of the world’s best automotive talent pools.  The  state-of-the-art facility includes an over 15,000 square feet  prototype  lab, where ELMS plans to assemble initial battery pack and  electric  motor prototypes as well as complete pre-production vehicle  builds. ELMS  also plans to utilize the facility as a customer center  where it can  work with customers to understand their vehicle  specifications and  analytics needs, as well as conduct test drives.    “In addition to  facilitating our growth, the design of our new global  headquarters will  allow for collaboration across all aspects of our  engineering – from  vehicle design, prototyping and software development  – and customer  engagement, enabling ELMS to deliver for its customers  the most  efficient and customized solutions for their last mile use  cases,” said  James Taylor.</p>\n\n<p>ELMS plans to open  additional offices in California and other  locations in proximity to  major EV talent and development hubs“ELMS  plans to build around 4,100  vans by the end of 2021, more than double  output to 9,100 vehicles in  2022 when the second vehicle is added, and  grow to 83,000 for both by  2025. The vehicle and plant are said to be <strong>90% Ready for U.S. Production</strong>.”</p>\n\n<p>Did you read that? <strong>90% READY</strong> !  What other EV early starter is at this level? Very few, if any at all.</p>\n\n<h1>V. Sokon Auto and ELMS Connection</h1>\n\n<p>Ok,  sounds good you say. But what&#39;s the deal with this Chinese  company that  we&#39;ve never heard of? Sokon..sokon my what?! Oh that  Sokon. Yes,  officially called Dongfeng Sokon, known internationally as  DFSK. They  have been around since 2003, and are well established in the  Chinese  auto world. They are one of the top 3 manufacturers, actually.  Sokon has  a proven product and demand.  They have over 200,000 gas  models, plus  30,000+ EVs sold in Asia. That equates to over 1 million  miles driven a  day just off their EVs alone. On top of that, they were  the <strong>TOP SELLING EV MODEL in 1H 2020</strong>  in all of China.  Again, Sokon is no no-name company. It has a large  customer base for  their EV fleet, and these are some legitimate  companies that even me  and you can recognize. This includes ecommerce  delivery for JD.com and  Ali Baba, postal service for the China Post,  utilities for the state  grid, and shuttles for the Hong Kong  International Airport.</p>\n\n<p><strong>Ok, so I guess this isn&#39;t some shady random backroom Chinese vaporware  company. So how are they involved with ELMS?</strong></p>\n\n<p>This  takes us back to Seres, formally known as SF Motors, the  company our  very own Jim &#39;the EV Man&#39; Taylor was CEO of in 2019. Seres  was created  in 2016 and ended up being bought and owned by Sokon. An  interesting  side; note, one of the early members of Seres was the  cofounder and  former CEO of Tesla, Martin Eberhard. Guess where Martin  worked before  this? A little company called Atieva, now known as Lucid  Motors!</p>\n\n<p>One thing I  want to talk about briefly, as well, is something I have  seen mentioned  regarding “bad reviews” from employees online about  Seres (Glassdoor I  believe). This has been cited as a reason for  concern and uncertainty in  regards to how the leadership behind ELMS  will function. As shown  earlier, the team and leaders we have here will  be the least of our  worries when it comes to whipping a formidable  team and workforce  together. Jim only started working around May, and  Seres had already  been bleeding cash and laying off workers. The  combination of increasing  tensions with China and the hardships of  trying into expand in multiple  countries at once, caused the eventual  dissolution of Seres in the US.   I have wondered also if most of these  reviews were due to turmoil going  on between specific people in the  company, such as Martin Eberhard and  other CEOs. He did get into it  with meme lord Elon and that ended up  leading to his ousting at Tesla.  At Seres, he also ended up leaving them  in less than a year and he took  people along with him to another EV  startup. Doesn&#39;t sound like much  of a team player.</p>\n\n<p>Seres  ended up ceasing their US operations, but has continued to  survive  overseas and has successful models in the Dutch market. They  will be  producing a Seres 5 and Seres 7 this year. It doesn&#39;t look too  bad to be  honest - kind of like a Porsche Cayenne.</p>\n\n<p><strong>Now that we know who Sokon is, and have alleviated the concern of them being an unknown entity, what can they do for ELMS?</strong></p>\n\n<p>Well,  they will get many benefits from this partnership. They get  the  existing EV product portfolio of Sokon, greatly decreasing the time  and  R+D needed to get off the ground. As mentioned before, there is  already a  demand and proven product with these models. No guess work  needed. On  top of that, they get the customer field experience and  warranty data  from the millions of miles already driven in these cars.  This will give  ELMS a huge head start to develop and improve many  aspects of their  automated systems and ELMS AIR. The high volume of  existing supplier  based contracts will be used to their advantage as  well. There will be  absolutely no lack of connections or reach that  this allstar team won&#39;t  be able to tap into. And then of course, the  amount of money saved from  the Mishawaka plant and already invested  Sokon development, is well over  half a billion dollars. Nice.</p>\n\n<h1>VI. Is This A Chinese Company?</h1>\n\n<p>The  last thing I want to mention in relation to China and ELMS, is  the  important question of: “Is this a Chinese company or not?”</p>\n\n<p><strong>The short and easy answer is NO.</strong></p>\n\n<p><strong>ELMS is an Independent U.S. Entity</strong></p>\n\n<p><strong>They will provide Made-In-USA EVs.</strong></p>\n\n<p>Sokon  will provide the body production parts for ELMS, and CATL  (Tesla  supplier) will provide the batteries. They will use domestic  supply for  the EV powertrain. The inverter and the chassis skateboard  design for  the batteries will be sourced in the U.S. Unfortunately,  ELMS cannot go  fully domestic yet, but is hoping to transition as much  as possible in  the future. Right now, they are also focused on making  sure they can get  an attractive and affordable price point to its  customers. “Hey, made  in America. Made in Mishawaka. Half of it’s  American,” he said. “Our  engineers are here. The software guys. The  homologation is all based in  Auburn Hills [Michigan]. We plan to source  the majority of our EV  systems and componentry here in the U.S.    “You’ll be going into the  FedExes, Walmarts, all these guys. I’d say  there’s a low chance to sell  them a Chinese truck,” Taylor said. “But  after we’re finished, it should  be looked at as just a few parts from  China. If we move all the way  into vertical integration, we’re like  everybody else. I’m not sure we  can hang onto that price point.”  So as  we can see, there is some  strategy here at play in order to secure  some of these early and first  mover advantage contracts.</p>\n\n<h1>VII. Technical Analysis</h1>\n\n<p>Had  to delete this because reached max character limit. Pretty much  nothing  overly bearish or bullish. FIII broke below resistance the past  2 days  of the 55 EMA, so this week we will look for it to rise above  it and  turn it from resistance back into support.</p>\n\n<p>&#x200B;</p>\n\n<h1>VIII. Conclusion</h1>\n\n<p>If  you made it this far, congratulations. This was a journey to  China and  back. I hope from reading this, you, like me, have become  much more  confident and aware of the future potential of this amazing  new company  called Electric Last Mile Solutions.  I came into this  looking to  alleviate some of my worries about the stagnant and  seemingly void or  negative energy surrounding this company. I came out  the other end a  changed man. They say money doesn&#39;t grow on trees, but  they missed one.  The ELMS tree. And it has acorns for all of us.</p>\n\n<p>Come, watch this tree grow with me, friend.</p>\n\n<p>Disclosure: 10,000 warrants, 850 commons </p>\n\n<p>Disclaimer: I am not a financial adviser, this is not financial advice. Do your own dd. </p>\n\n<p>Note: Options just came out last week. Will be accumulating March 12.5C and 15C and June 20C</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>TLDR:  1st and only Class 1 EV in the US with no competition. Has an  amazing  team and management. Has an EV kitted factory ready for  production by Q3  of this year in Indiana. Has 30,000 preorders already  and expects  30-60k more by next year. NOT a Chinese company, will just  be using  Sokon&#39;s already successful model and improving on it.</p>\n</div><!-- SC_ON -->",
  "score": 50,
  "permalink": "/r/stocks/comments/lklfcw/huge_dd_on_electric_last_mile_solutions_only/",
  "subreddit": "stocks",
  "id": "lklfcw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728624081
}