{
  "author": "bardooneness",
  "the_new_excerpt": "A quote from Satoshi Nakamoto:\n\nIt's the same situation as gold and gold mining. The marginal cost of gold\nmining tends to stay near the price of gold. Gold mining is a waste, but that\nwaste is far less than the utility of having gold available as a medium of\nexchange.\n\nI think the case will be the…",
  "original_created_utc": 1617456186,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "中本聪的一句话。\n\n这和黄金和金矿的情况是一样的。黄金的边际成本\n矿业往往停留在金价附近。黄金开采是一种浪费，但这\n浪费远远小于以黄金为媒介的效用。\n交流。\n\n我觉得这个案子会是...",
      "title": "还有人觉得有点奇怪，一边看电视一边被告知比特币的能源效率有多低，一边看到几台巨大的柴油机在阿拉斯加搅动了数千吨的土来生产微小的金子？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "中本聰的一句話。\n\n這和黃金和金礦的情況是一樣的。黃金的邊際成本\n礦業往往停留在金價附近。黃金開採是一種浪費，但這\n浪費遠遠小於以黃金爲媒介的效用。\n交流。\n\n我覺得這個案子會是...",
      "title": "還有人覺得有點奇怪，一邊看電視一邊被告知比特幣的能源效率有多低，一邊看到幾臺巨大的柴油機在阿拉斯加攪動了數千噸的土來生產微小的金子？"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "サトシ・ナカモトの言葉です。\n\n金と金の採掘と同じような状況ですね。金の採掘の限界費用は\n金の採掘の限界費用は、金の価格の近くに留まる傾向があります。金の採掘は無駄だが、その無駄は、金が薬として使えることの効用よりも\n金の採掘は無駄だが、その無駄は、金を交換手段として利用できることの効用よりもはるかに小さい。\nと述べています。\n\nというケースが出てくると思います。",
      "title": "テレビを見ていると、アラスカで巨大なディーゼルマシンが何千トンもの土をかき混ぜて小さな金の粒を作っているのを見ながら、ビットコインがいかにエネルギー効率が悪いかを言われているのは、ちょっと変だと思う人はいませんか？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "サトシ・ナカモトの言葉です。\n\n金と金の採掘と同じような状況ですね。金の採掘の限界費用は\n金の採掘の限界費用は、金の価格の近くに留まる傾向があります。金の採掘は無駄だが、その無駄は、金が薬として使えることの効用よりも\n金の採掘は無駄だが、その無駄は、金を交換手段として利用できることの効用よりもはるかに小さい。\nと述べています。\n\nというケースが出てくると思います。",
      "title": "テレビを見ていると、アラスカで巨大なディーゼルマシンが何千トンもの土をかき混ぜて小さな金の粒を作っているのを見ながら、ビットコインがいかにエネルギー効率が悪いかを言われているのは、ちょっと変だと思う人はいませんか？"
    }
  ],
  "title": "Anyone else find it a bit odd being told how energy inefficient bitcoin is, whilst watching tv and seeing several gigantic diesel machines churn up thousands of tonnes of earth in Alaska to produce tiny flecks of gold?",
  "created_utc": 1617463834,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A quote from Satoshi Nakamoto:</p>\n\n<p>It&#39;s the same situation as gold and gold mining.  The marginal cost of gold mining tends to stay near the price of gold.  Gold mining is a waste, but that waste is far less than the utility of having gold available as a medium of exchange.</p>\n\n<p>I think the case will be the same for Bitcoin.  The utility of the exchanges made possible by Bitcoin will far exceed the cost of electricity used.  Therefore, not having Bitcoin would be the net waste.</p>\n</div><!-- SC_ON -->",
  "score": 5750,
  "permalink": "/r/CryptoCurrency/comments/mj8f09/anyone_else_find_it_a_bit_odd_being_told_how/",
  "subreddit": "CryptoCurrency",
  "id": "mj8f09",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961875624
}