{
  "author": "Welshybird",
  "original_created_utc": 1635690762,
  "title": "Will NO sell November hold and come to fruition?",
  "created_utc": 1635697914,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>They say buy the rumours and news. People have definately listened and bought in their billions.</p>\n\n<p>Difficukt to know with everytjjng going on if its just whales creating stories so they can sell for more profits. That being said, the order books arent full enough to accommodate mass sell offs. Whales dont want to crash their own portfolios or ruin their own future gains. Especially since they like to sell small amounts to accumulate more.</p>\n\n<p>Im slightly optimistic but concerned of course that its just a show.</p>\n\n<p>Claims are rampant that this years bull run will and has broken the 4 year cycle.</p>\n\n<p>What say all of you my fellow crypto heads? Did you buy and will you sell or hold for November?</p>\n</div><!-- SC_ON -->",
  "score": 176,
  "permalink": "/r/CryptoCurrency/comments/qjqqdq/will_no_sell_november_hold_and_come_to_fruition/",
  "subreddit": "CryptoCurrency",
  "id": "qjqqdq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "They say buy the rumours and news. People have definately listened and bought in\ntheir billions.\n\nDifficukt to know with everytjjng going on if its just whales creating stories\nso they can sell for more profits. That being said, the order books arent full\nenough to accommodate mass sell offs. Whales…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "噂やニュースを買えという。人々は間違いなく耳を傾け、何十億ものお金を買いました。\n数十億ドルを手にしました。\n\n鯨が話を作っているだけなのか、すべての出来事を知ることは困難です。\nより多くの利益を得るために売ることができるのかどうかを知ることは困難です。そうは言っても、大量の売りを受け入れるだけのオーダーブックは存在しません。\n大量に売り抜けることができるほど、注文が入っていません。クジラ...",
      "title": "NOは11月のホールドを売って実現するのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他们说买下谣言和新闻。人们肯定听从并购买了\n他们的数十亿美元。\n\n很难知道发生了什么，是否只是鲸鱼在制造故事。\n这样他们就能卖出更多的利润。话虽如此，但订单还没有满\n足以容纳大规模的抛售。鲸鱼...",
      "title": "11月的销售会不会保持并实现？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他們說買下謠言和新聞。人們肯定聽從併購買了\n他們的數十億美元。\n\n很難知道發生了什麼，是否只是鯨魚在製造故事。\n這樣他們就能賣出更多的利潤。話雖如此，但訂單還沒有滿\n足以容納大規模的拋售。鯨魚...",
      "title": "11月的銷售會不會保持並實現？"
    }
  ]
}