{
  "author": "DestructorEFX",
  "the_new_excerpt": "I got into Bitcoin back in 2019, my first purchase was around $7.000,00. I was a\nnewbie, asking question on this sub (thanks a lot to those that helped me learn\nabout wallets, segwit, private keys, etc...) and trying to understand as much as\npossible.\n\nWhen I read what strategy to follow, most…",
  "original_created_utc": 1618758104,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私がビットコインに手を出したのは2019年のことで、最初の購入額は7.000,00ドル程度でした。私は初心者でした。\n初心者で、このサブで質問をしていました（私の学習を助けてくれた方々に感謝します。\nウォレット、segwit、秘密鍵などについて教えてくれた方々に感謝しています）、できるだけ多くのことを理解しようとしていました。\n可能な限り理解しようとしていました。\n\n私がどのような戦略を取るべきかを読んだとき、ほとんどの...",
      "title": "ビットコインを本当に理解していれば、HODLすることは難しくありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我早在2019年就开始接触比特币了，我的第一次购买是7.000.00美元左右。我是一个\n新手，在这个子上提问（非常感谢那些帮助我学习的人）。\n关于钱包、segwit、私钥等......)，并试图尽可能多地了解。\n可能的。\n\n当我读到要遵循什么策略时，大多数...",
      "title": "当你真正了解比特币的时候，HODL比特币并不难。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我早在2019年就開始接觸比特幣了，我的第一次購買是7.000.00美元左右。我是一個\n新手，在這個子上提問（非常感謝那些幫助我學習的人）。\n關於錢包、segwit、私鑰等......)，並試圖儘可能多地瞭解。\n可能的。\n\n當我讀到要遵循什麼策略時，大多數...",
      "title": "當你真正瞭解比特幣的時候，HODL比特幣並不難。"
    }
  ],
  "title": "It isn't hard to HODL Bitcoin when you truly understand it.",
  "created_utc": 1618788885,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I got into Bitcoin back in 2019, my first purchase was around $7.000,00. I was a newbie, asking question on this sub (thanks a lot to those that helped me learn about wallets, segwit, private keys, etc...) and trying to understand as much as possible.</p>\n\n<p>When I read what strategy to follow, most people said to just buy Bitcoin and HODL it. I didn&#39;t believe at first, it can&#39;t be that easy right? It must have some deeper secret, maybe learn to day trade, graph analysis, so many people panic sell when the price dips, it must be hard to do that, right? But months passed, a few dips along the way, never felt the urge to sell, I just kept buying. (tried to day trade but failed and gave up lol)</p>\n\n<p>Then the Covid crash back in March 2020 came, I think I was 70% to 80% down. Still, never came into my mind to sell it, I actually bought more. I realized that there is no secret to it, we like to complicate things, but it just that plain simple: <strong>BUY &amp; HODL.</strong> But it is simple only when you have the right mentality for it. If you don&#39;t understand Bitcoin and why you have it, you will end up panic selling.</p>\n\n<p>So here&#39;s a few tips that helped me along the way:</p>\n\n<ol>\n<li><strong>Truly understand what Bitcoin is.</strong> It gives you true freedom, sovereignty over your wealth, a digital monetary revolution with fixed supply that can&#39;t be controlled, inflated or manipulated by a government or a corporation. It&#39;s harder for people that live in developed country to understand this, but we from third world country like Brazil, Argentina, Venezuela, Zimbabwe, that have our currency rekt, understand that very well.</li>\n<li><strong>Know your Time Preference.</strong> What is your moon? Why and when you will want to sell it? I will never sell, <em>Bitcoin is the most scarce asset of the world</em>. When I need fiat money, I will borrow against it. So it doesn&#39;t make any logical sense to panic sell in a dip when I&#39;m in for the long game. <em>(book recommendation: The Bitcoin Standard)</em></li>\n<li>I never invested on the stock market, whereas 10% to 20% dips are terrible, for Bitcoin that is just <strong>another normal day</strong>. So I think I got used to crypto dips, it doesn&#39;t affect me.</li>\n</ol>\n\n<p>This market dip today is just noise, focus your energy on learning what Bitcoin is instead of watching daily price action.</p>\n\n<p><em>(sorry if there&#39;s any mistake, English is not my main language)</em></p>\n\n<p>Edit: grammar</p>\n</div><!-- SC_ON -->",
  "score": 258,
  "permalink": "/r/Bitcoin/comments/mtega9/it_isnt_hard_to_hodl_bitcoin_when_you_truly/",
  "subreddit": "Bitcoin",
  "id": "mtega9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171516347
}