{
  "author": "partymsl",
  "original_created_utc": 1652886188,
  "title": "Let's be real, the current macro-economic situation does not look like we are going to recover just the next week or even next month.",
  "created_utc": 1652910430,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Bitcoin still being on 29k shows that it&amp;#39;s quite struggling to make a V-shaped recovery after hitting high support levels on 25k. Bitcoin got constantly rejected at ~31k the past days and it does not look like anything is making a fast recovery just now.&lt;/p&gt;\n\n&lt;p&gt;Crypto prices, as every other financial asset prices, are completly dependent on the state of the human psychology and that&amp;#39;s dependent on how the world is doing. The past months we have just been adding more and more macro-economic tensions. Starting with FED rate hikes, Consumer Inflation, Russia-Ukraine to now China supply issues. Also Don&amp;#39;t forget that Covid is still here.&lt;/p&gt;\n\n&lt;p&gt;It just does not seem like any of those will get better any time soon. Covid stays still, Russia Ukraine is having no progress in peace, FED won&amp;#39;t stop till inflation is down. Obviously things could change and Crypto pumps to the moon, there is no certainity, but the probability is that things will keep worse before they get better.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 310,
  "permalink": "/r/CryptoCurrency/comments/useyr9/lets_be_real_the_current_macroeconomic_situation/",
  "subreddit": "CryptoCurrency",
  "id": "useyr9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Bitcoin still being on 29k shows that it's quite struggling to make a V-shaped\nrecovery after hitting high support levels on 25k. Bitcoin got constantly\nrejected at ~31k the past days and it does not look like anything is making a\nfast recovery just now.\n\nCrypto prices, as every other financial…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインがまだ29kにいるのは、V字を描くのにかなり苦労していることを表している\n25kの高いサポートレベルを打った後、V字回復をするのに非常に苦労していることを示しています。ビットコインはここ数日、常に\nビットコインは、過去数日間、～31kで拒否され、何かが急速に回復しているようには見えません。\n今、急速に回復しているようには見えません。\n\n暗号化された価格は、他のすべての金融と同様に...",
      "title": "正直に言うと、現在のマクロ経済の状況は、ちょうど来週、来月には回復しそうもないのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比特币仍然在2900点上，这表明它在2月2日触及高支撑位后，正艰难地进行V型恢复。\n在触及25K的高支持水平后，它正在努力进行V型恢复。比特币在过去几天不断地被\n在过去的日子里，比特币在~31K被拒绝，而且看起来没有任何东西在做一个\n迅速恢复。\n\n就像其他金融市场一样，加密货币的价格也是如此。",
      "title": "让我们实事求是地说，目前的宏观经济形势看起来并不像我们将在下周甚至下个月就能恢复。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣仍然在2900點上，這表明它在2月2日觸及高支撐位後，正艱難地進行V型恢復。\n在觸及25K的高支持水平後，它正在努力進行V型恢復。比特幣在過去幾天不斷地被\n在過去的日子裏，比特幣在~31K被拒絕，而且看起來沒有任何東西在做一個\n迅速恢復。\n\n就像其他金融市場一樣，加密貨幣的價格也是如此。",
      "title": "讓我們實事求是地說，目前的宏觀經濟形勢看起來並不像我們將在下週甚至下個月就能恢復。"
    }
  ]
}