{
  "author": "SnooMacarons1548",
  "the_new_excerpt": "First off, let's go straight to the point. The last few weeks have been a\nbloodbath for most of the market. To many, especially new traders, this seems\nlike a full blown market crash. Well, it's not... a market crash needs a\ncatalyst. Think back to every single crash, whether it was the dot com…",
  "original_created_utc": 1614809054,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我们直接进入正题。过去几周是一个\n对于大部分市场来说，都是血雨腥风。对很多人来说，尤其是新交易者，这似乎\n像一个完整的市场崩溃。嗯，这不是... ... 一个市场崩溃需要一个。\n催化剂。回想一下每一次股灾，不管是网络...",
      "title": "为什么市场没有崩盘。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我們直接進入正題。過去幾周是一個\n對於大部分市場來說，都是血雨腥風。對很多人來說，尤其是新交易者，這似乎\n像一個完整的市場崩潰。嗯，這不是... ... 一個市場崩潰需要一個。\n催化劑。回想一下每一次股災，不管是網絡...",
      "title": "爲什麼市場沒有崩盤。"
    }
  ],
  "title": "Why the market is not crashing:",
  "created_utc": 1614819444,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First off, let&#39;s go straight to the point. The last few weeks have been a bloodbath for most of the market. To many, especially new traders, this seems like a full blown market crash. Well, it&#39;s not... a market crash needs a catalyst. Think back to every single crash, whether it was the dot com bubble, the housing bubble in 08, and even the flash crash on black Monday in 87&#39; they all had a catalyst, if not many catalysts.</p>\n\n<p>I keep reading over and over again in the media that the bond yeilds jumping is the reason for this market crash speculation. Let&#39;s think about this for a second though - besides the fed trying to hammer home the message to investors that the bond yeilds are absolutely no cause for concern, and actually it&#39;s not even close to reaching concerning territory yet, as well as the bond yeilds are actually signaling strength in the economy - how in the world do people come to conclusion that the market is about to crash because of this? Is there any real basis to this? Ask yourself this.</p>\n\n<p>Another narrative that i keep seeing the media push is &quot;the economy is overheating&quot;. Seriously? What does that even mean? The economy is recovering so fast that the market is going to crash? This has to be the most insane thing I&#39;ve read yet. I can also note that the same journalists who publish this FUD about overheating, are the same journalists who will also write that the market is crashing when there is BAD economic data (such as the job report this morning). So let&#39;s ask ourselves, how can both a booming recovery and a slow, painful recovery BOTH be ingredients for a crash? I cannot comprehend how ridiculous this is becoming. Good news = market crash, bad news = market crash. What do we need for the market not to crash? </p>\n\n<p>I can&#39;t talk about all of this without mentioning a wild phenomenon. My portfolio. A very well diversified array of etfs which hit almost all sectors of the market. The best thing to happen to it? A global pandemic/ lockdown. The worst thing? Economic strength indicators, covid cases plummeting and vaccines and stimulus getting pumped into the masses. Has the world gone mad?</p>\n\n<p>My conclusion is only this. Plain and simple, fear. Fear is what&#39;s bringing this bloodbath upon us. Panic selling over irrational news articles. Just compare the VIX (fear gauge) chart with almost every single tech stock or major company&#39;s stock chart. It&#39;s literally an inverse. A mirror image.</p>\n\n<p>If there is anything to take away from this is that I truly believe this is just mass hysteria and it the dust will settle. Stocks will rise again. Invest in what you believe in and avoid the FUD that&#39;s being pumped out for click bait by seemingly every news outlet.</p>\n\n<p>Tl;dr: there is no crash. This is panic selling on a mass scale. Don&#39;t believe the media fud - the pandemic is ending and there is light at the end of this Corona virus tunnel. Buy the dip with money you can afford to potentially lose and all shall be good again on wallstreet.</p>\n\n<p>Edit: I almost forgot to mention a big one: </p>\n\n<p>Another theory that is floating around is the market being in a bubble. This is probably the most spread rumor. This one is pretty simple to shut down I think. Earnings season was insane. Comoanjes blew estimates out of the water left and right. Banks, big tech, e commerce, etc. These are the sectors that are being targeted heavily by fud in the media. These are also the companies doing the best they ever have. So how is this a bubble? Of course, companies like tesla and gamestop (lol) can be viewed and argued as in a bubble. But these companies are few and far between.</p>\n\n<p>Edit#2 as someone here pointed out, the current p/e ratio is at around 40 for the s&amp;p500. Is this really a cause for concern? The all time high for p/e of the s&amp;p is may 2009. Arguably one of the best times in history to buy stocks as we now know. So can someone explain why this is repeatedly cited as a cause for concern? What am I missing?</p>\n</div><!-- SC_ON -->",
  "score": 341,
  "permalink": "/r/stocks/comments/lx5kne/why_the_market_is_not_crashing/",
  "subreddit": "stocks",
  "id": "lx5kne",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937744974
}