{
  "author": "dilfybro",
  "original_created_utc": 1655649424,
  "title": "Why are lemon seeds seemingly randomly distributed about the center of the lemon?",
  "created_utc": 1655662430,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Lemons (which I buy from the market) have a high degree of axial symmetry.  Rotate them around their major axis, and they&amp;#39;re usually pretty similar from all angles.  Cut one in half along the minor axis, and the segments are each about the same angular size.  The albedo is pretty circular and uniform, too.   &lt;/p&gt;\n\n&lt;p&gt;And then, the seeds.   There are usually fewer than one per segment.   And when that&amp;#39;s the case, you just have 1 in one segment, another in another, and they jut off in seemingly random angles.   &lt;/p&gt;\n\n&lt;p&gt;Why the absence of azimuthal symmetry for seeds?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 138,
  "permalink": "/r/askscience/comments/vfwk5i/why_are_lemon_seeds_seemingly_randomly/",
  "subreddit": "askscience",
  "id": "vfwk5i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Lemons (which I buy from the market) have a high degree of axial symmetry.\nRotate them around their major axis, and they're usually pretty similar from all\nangles. Cut one in half along the minor axis, and the segments are each about\nthe same angular size. The albedo is pretty circular and uniform,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "市場から購入する）レモンは軸対称性が高い。\n長軸を中心に回転させると、どの角度から見ても同じような形になります。\nどの角度から見ても似ている。短軸に沿って半分に切ると、それぞれのセグメントの角度はほぼ同じになる。\n同じ角度の大きさになります。アルベドはかなり円形で均一で、...",
      "title": "レモンの種は、なぜレモンの中心付近にランダムに散らばっているように見えるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "柠檬（我从市场上买的）具有高度的轴向对称性。\n围绕它们的主轴旋转，它们通常从各个\n角度都很相似。将一个柠檬沿小轴切成两半，各段的角度大小差不多。\n相同的角度大小。反照率是相当圆滑和均匀的，...",
      "title": "为什么柠檬的种子似乎是随机地分布在柠檬的中心？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "檸檬（我從市場上買的）具有高度的軸向對稱性。\n圍繞它們的主軸旋轉，它們通常從各個\n角度都很相似。將一個檸檬沿小軸切成兩半，各段的角度大小差不多。\n相同的角度大小。反照率是相當圓滑和均勻的，...",
      "title": "爲什麼檸檬的種子似乎是隨機地分佈在檸檬的中心？"
    }
  ]
}