{
  "author": "Exoddity",
  "the_new_excerpt": "For example, lets say I've been thrown back in time to 1000 BC. I want to\nintroduce civilization to the wonders of electricity, so the first thing I need\nis a strong magnet. The only sources of ferromagnetic material I know of are\nLodestones, which I understand are only quite weakly magnetic.\n\nSo it…",
  "original_created_utc": 1610798367,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "举个例子，比如说我被扔回了公元前1000年。我想\n向文明介绍电的奥妙，所以我首先要做的是\n是一种强磁体。我所知道的铁磁性材料的唯一来源是：\n岩石，我知道它只有很弱的磁性。\n\n所以...",
      "title": "第一块磁铁是如何产生的？在没有电或其他强磁体的情况下，如何创造磁铁？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "舉個例子，比如說我被扔回了公元前1000年。我想\n向文明介紹電的奧妙，所以我首先要做的是\n是一種強磁體。我所知道的鐵磁性材料的唯一來源是：\n岩石，我知道它只有很弱的磁性。\n\n所以...",
      "title": "第一塊磁鐵是如何產生的？在沒有電或其他強磁體的情況下，如何創造磁鐵？"
    }
  ],
  "title": "How was the first magnet created? How would I create a magnet in absence of electricity or other strong magnets?",
  "created_utc": 1610834945,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For example, lets say I&#39;ve been thrown back in time to 1000 BC. I want to introduce civilization to the wonders of electricity, so the first thing I need is a strong magnet. The only sources of ferromagnetic material I know of are Lodestones, which I understand are only quite weakly magnetic.</p>\n\n<p>So it got me to thinking...once you have a strong magnet, and once you can create electricity, creating more magnets is significantly easier. But how were the first strong magnets created?</p>\n\n<p>There&#39;s surprisingly little written about how to make a magnet <em>in lieu of other magnets</em></p>\n\n<p>Or, put another way, if you got thrown back in time how would you go about generating electricity for your deLorean?</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/askscience/comments/kyhq9s/how_was_the_first_magnet_created_how_would_i/",
  "subreddit": "askscience",
  "id": "kyhq9s",
  "is_self": true,
  "media": null,
  "is_video": false
}