{
  "author": "_DEDSEC_",
  "original_created_utc": 1636986734,
  "title": "The S.E.C doesn't give two shits about Celebs endorsing scams, but they want to know where your 100$ is going.",
  "created_utc": 1637008295,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Long have I wondered about why the SEC never investigated the celebrities who rob their fans in broad daylight.</p>\n\n<p>While the celebs barely even try to hide their scams, the SEC is too busy trying to figure out which coins we should or shouldn&#39;t buy.</p>\n\n<p>It&#39;s not just the <strong>&quot;influencers&quot;</strong> who can get admittedly get lost in the masses, but very well-known rappers and celebrities like <strong>SnoopDogg</strong> pushing obvious scams to their fans.</p>\n\n<p>You might think what&#39;s wrong with it, and here comes the issue; they never mark those &quot;shills&quot; as <strong>ads</strong>. Anyone who gets paid to talk about something, even a cryptocurrency is obligated to mark their post as an advert or admit they&#39;re getting paid to shill it.</p>\n\n<p>SnoopDogg, Lil Uzi,  and many others never did that in their Instagram/Twitter ads, they even go as far as deleting the posts after the <strong>scam/rug pull</strong> has taken place.</p>\n\n<p>News Publications like CNBC, Nytimes, Forbes, push meme cryptocurrencies like Squid Game to the people advertising it, without a fraction of research.</p>\n\n<p>They want the click-bait headlines so they get website traffic, <strong>we&#39;re no longer in the 2015 era of crypto, this is serious stuff and people are being misguided by the rich.</strong></p>\n\n<p>All of this could be avoided if the SEC actually did their <strong>job</strong> and fined somebody to make others stop, they have the jurisdiction to do so. </p>\n\n<p>Thus one is left to wonder why they&#39;re leaving it be, and sometimes the answers are right there in our face that we can&#39;t see it. </p>\n\n<blockquote>\n<p><strong>SEC wants you to lose your money so they can push to regulate cryptocurrencies.</strong></p>\n</blockquote>\n\n<p>They don&#39;t go after these celebs as they need them to use it as an &quot;I told you so&#39;&quot; card, <strong>they don&#39;t do their job as a regulatory authority to protect the citizens&#39; interest because they want you to stop investing in crypto or at least make it hard to do so.</strong></p>\n\n<p>After the SEC regulates the crypto world, <strong>the celebs don&#39;t give two shits about it anymore</strong>, since they made more money out of it than in their lifetime.</p>\n\n<blockquote>\n<p>The rich remain rich bending the rules to their will while the poor are left to eat the dust, that&#39;s how the world works.</p>\n</blockquote>\n\n<p>I&#39;m all in for regulations especially when it stops people from investing in scam tokens, but the S.E.C has the gun pointed at the wrong target, <strong>us</strong>.</p>\n</div><!-- SC_ON -->",
  "score": 171,
  "permalink": "/r/CryptoCurrency/comments/quhquc/the_sec_doesnt_give_two_shits_about_celebs/",
  "subreddit": "CryptoCurrency",
  "id": "quhquc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Long have I wondered about why the SEC never investigated the celebrities who\nrob their fans in broad daylight.\n\nWhile the celebs barely even try to hide their scams, the SEC is too busy trying\nto figure out which coins we should or shouldn't buy.\n\nIt's not just the \"influencers\" who can get…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は長い間、なぜSECが自分の口座からお金を盗んだ有名人を調査しないのか不思議に思っていました。\n白昼堂々とファンからお金を奪っている有名人を、なぜSECは調査しないのだろうと、ずっと不思議に思っていました。\n\nセレブが詐欺を隠そうともしない一方で、SECはどの共同経営者がいるかを把握するのに忙しすぎます。\n私たちがどのコインを買うべきか、買わないべきかを考えるのに忙しいのです。\n\n詐欺に遭う可能性があるのは、「インフルエンサー」だけではありません。",
      "title": "証券取引委員会は、セレブが詐欺を推奨することには関心がありませんが、あなたの100ドルがどこに行くのかを知りたいのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "长期以来，我一直在想，为什么美国证券交易委员会从来没有调查过那些名人的\n在光天化日之下抢劫他们的粉丝。\n\n当名人几乎没有试图掩盖他们的骗局时，美国证券交易委员会却忙着试图\n忙着弄清我们应该或不应该购买哪些硬币。\n\n不仅仅是 \"有影响力的人 \"可以得到...",
      "title": "S.E.C对名人代言的骗局不屑一顾，但他们想知道你的100美元去了哪里。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "長期以來，我一直在想，爲什麼美國證券交易委員會從來沒有調查過那些名人的\n在光天化日之下搶劫他們的粉絲。\n\n當名人幾乎沒有試圖掩蓋他們的騙局時，美國證券交易委員會卻忙着試圖\n忙着弄清我們應該或不應該購買哪些硬幣。\n\n不僅僅是 \"有影響力的人 \"可以得到...",
      "title": "S.E.C對名人代言的騙局不屑一顧，但他們想知道你的100美元去了哪裏。"
    }
  ]
}