{
  "author": "screwyoushadowban",
  "the_new_excerpt": "How were household duties split up between Mongol couples? Was cooking a\ngendered task? Did Mongol women control the household finances? Would the\nrespected role of Temujin's wife and his mother as advisors be repeated in many\nMongol households (as it was in the households of some of his…",
  "original_created_utc": 1621372060,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "モンゴルの夫婦は、どのように家事を分担していたのでしょうか。料理をするのは\n性的な作業でしたか？モンゴルの女性は家計を管理していたのか？テムジンの\nテムジンの妻と彼の母親が助言者として尊敬される役割は、多くのモンゴル人の間で繰り返されているのでしょうか？\nモンゴルの多くの家庭では、テムジンの妻や母が助言者として尊敬される役割が繰り返されていたのだろうか（テムジンの家族の何人かの家庭ではそうだった）。",
      "title": "チンギス・ハーンとその息子・孫の時代のモンゴル女性の歴史を調べてみると、モンゴルの女王や王女の情報しか出てきません。残りの99.9％のモンゴル女性はどのように暮らしていたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "蒙古夫妇之间是如何分担家务的？烹饪是一项\n烹饪是一项有性别区分的任务吗？蒙古妇女是否控制着家庭的财务？铁木真的妻子和他的母亲作为顾问的受人尊敬的角色是否会在许多国家重复出现？\n铁木真的妻子和他的母亲作为顾问的受人尊敬的角色会在很多\n蒙古人的家庭中，铁木真的妻子和他的母亲作为顾问的受人尊敬的角色是否会重复出现（就像在他的一些人的家庭中一样。",
      "title": "当我查找成吉思汗及其儿子/孙子时代的蒙古妇女的历史时，我只找到关于蒙古女王和公主的信息。其他99.9%的蒙古族妇女是如何生活的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "蒙古夫婦之間是如何分擔家務的？烹飪是一項\n烹飪是一項有性別區分的任務嗎？蒙古婦女是否控制着家庭的財務？鐵木真的妻子和他的母親作爲顧問的受人尊敬的角色是否會在許多國家重複出現？\n鐵木真的妻子和他的母親作爲顧問的受人尊敬的角色會在很多\n蒙古人的家庭中，鐵木真的妻子和他的母親作爲顧問的受人尊敬的角色是否會重複出現（就像在他的一些人的家庭中一樣。",
      "title": "當我查找成吉思汗及其兒子/孫子時代的蒙古婦女的歷史時，我只找到關於蒙古女王和公主的信息。其他99.9%的蒙古族婦女是如何生活的？"
    }
  ],
  "title": "When I look up the history of Mongol women in the era of Genghis Khan and his sons/grandsons I only find information on Mongol queens and princesses. How did the other 99.9% of Mongol women live?",
  "created_utc": 1621381941,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>How were household duties split up between Mongol couples? Was cooking a gendered task? Did Mongol women control the household finances? Would the respected role of Temujin&#39;s wife and his mother as advisors be repeated in many Mongol households (as it was in the households of some of his descendants)?</p>\n\n<p>Would Mongol girls receive the same education, whatever that meant in early 13th century Mongol society, as their brothers? When did girls start to be considered women and how did it compare to boys?</p>\n\n<p>I&#39;m particularly interested in the religious roles of Tengriist Mongol women. Were there certain religious or religio-social rituals or practices that were restricted just to them, or that they were considered particularly good at? Were they forbidden from certain Tengriist religious roles?</p>\n\n<p>Thanks!</p>\n</div><!-- SC_ON -->",
  "score": 125,
  "permalink": "/r/AskHistorians/comments/nfmas7/when_i_look_up_the_history_of_mongol_women_in_the/",
  "subreddit": "AskHistorians",
  "id": "nfmas7",
  "is_self": true,
  "media": null,
  "is_video": false
}