{
  "author": "icbcrepair",
  "the_new_excerpt": "Canadian home prices have 3x since 2006. In markets with jobs for young people\nhouses have more than 5x in that time. Anytime asset prices in Canada are going\nto fall the Bank of Canada is ready to step in and lower the short term interest\nrate and purchase long term bonds to suppress the long term…",
  "original_created_utc": 1614469150,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "自2006年以来，加拿大房价上涨了3倍。在有年轻人就业的市场\n房子在这段时间里有超过5倍。任何时候加拿大的资产价格都会\n加拿大央行准备出手，降低短期利息。\n率，并购买长期债券，以压制长期...",
      "title": "有其他加拿大人因为没有替代品而购买比特币吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自2006年以來，加拿大房價上漲了3倍。在有年輕人就業的市場\n房子在這段時間裏有超過5倍。任何時候加拿大的資產價格都會\n加拿大央行準備出手，降低短期利息。\n率，併購買長期債券，以壓制長期...",
      "title": "有其他加拿大人因爲沒有替代品而購買比特幣嗎？"
    }
  ],
  "title": "Any other Canadians buying bitcoin because there is no alternatives?",
  "created_utc": 1614501028,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Canadian home prices have 3x since 2006.  In markets with jobs for young people houses have more than 5x in that time.  Anytime asset prices in Canada are going to fall the Bank of Canada is ready to step in and lower the short term interest rate and purchase long term bonds to suppress the long term yield.  Despite low unemployment, low inflation and a booming economy they wouldn&#39;t even raise rates past 1.75% in 2018/2019.</p>\n\n<p>This has been great for people born before 1990 as they can use their assets to get loans to purchase more assets while the debt is inflated away by the Bank of Canada.  But unfortunately for people born after they have not had the same opportunity to enter the asset market because wages haven&#39;t kept up with asset inflation let alone CPI.</p>\n\n<p>The Bank of Canada has cheated an entire generation.  They expect us to now spend 45% of our income on housing to give boomers a golden parachute to retirement. Even as rates rise they will just implement yield curve control to keep rates low.  </p>\n\n<p>I am done with this system, I refuse to play their game anymore.  I&#39;m all in on Bitcoin, they can feel free to devalue their currency to keep bailing out asset holders but I won&#39;t be on the wrong side of that anymore.</p>\n</div><!-- SC_ON -->",
  "score": 354,
  "permalink": "/r/Bitcoin/comments/lu08fg/any_other_canadians_buying_bitcoin_because_there/",
  "subreddit": "Bitcoin",
  "id": "lu08fg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937732188
}