{
  "author": "Nautisop",
  "original_created_utc": 1647816544,
  "title": "How brutal was the daily life in the middle ages in terms of random violence?",
  "created_utc": 1647833573,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am currently watching &amp;quot;The last kingdom&amp;quot; which plays around 800 a.d. but violence is very present in other shows and movies as well.\nIn popculture the early to late middle ages always seem very brutal and make it seem that people were killing or crippling each other over minor inconveniences, especially when the agressor was of higher rank.\nI wonder If violence was really as common and &amp;quot;accepted&amp;quot; as shows and movies make it seem.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/tix2gc/how_brutal_was_the_daily_life_in_the_middle_ages/",
  "subreddit": "AskHistorians",
  "id": "tix2gc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am currently watching \"The last kingdom\" which plays around 800 a.d. but\nviolence is very present in other shows and movies as well. In popculture the\nearly to late middle ages always seem very brutal and make it seem that people\nwere killing or crippling each other over minor inconveniences,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今見ているのは「最後の王国」で、紀元800年頃の作品ですが。\n暴力は他の番組や映画にも非常に多く存在します。ポップカルチャーの世界では\n中世の初期から後期にかけては、常に非常に残忍な印象を与え、まるで人々が\n些細な不都合で殺し合ったり、不具にしたり、、、。",
      "title": "中世の日常は、無差別な暴力という点で、どれほど残酷だったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我目前正在看 \"最后的王国\"，它在公元800年左右播放，但是\n但暴力在其他节目和电影中也很常见。在流行文化中\n在流行文化中，中世纪早期到晚期似乎总是非常残酷，让人觉得人们会因为一些小麻烦而互相残杀。\n人们为了一些小麻烦而互相残杀，...。",
      "title": "就随机暴力而言，中世纪的日常生活有多残酷？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我目前正在看 \"最後的王國\"，它在公元800年左右播放，但是\n但暴力在其他節目和電影中也很常見。在流行文化中\n在流行文化中，中世紀早期到晚期似乎總是非常殘酷，讓人覺得人們會因爲一些小麻煩而互相殘殺。\n人們爲了一些小麻煩而互相殘殺，...。",
      "title": "就隨機暴力而言，中世紀的日常生活有多殘酷？"
    }
  ]
}