{
  "author": "balsacis",
  "original_created_utc": 1634313804,
  "title": "Despite very different origins, Greeks and Turks both seem to have very rich yogurt cultures. What is the history of yogurt for both peoples, and how did they influence one another?",
  "created_utc": 1634375468,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently learned that Tzaziki is the Greek transliteration of Cacik (a Turkish cucumber-lime-herb based yogurt sauce). Both cultures seem to have many extremely similar yogurt-based recipes, and use some form of yogurt in a huge proportion of their dishes.</p>\n\n<p>Turks trace their heritage to nomadic Turkic tribes in the Steppes and Siberia that migrated Southwest over the course of several centuries. It seems that as early as the 11th century, scholars such as Mahmud al-Kashgari wrote about Turkic yogurt culture, tracing its origins to nomads that fermented milk in goat-skin bags.</p>\n\n<p>Greek yogurt culture seems to be traced back to the consumption of &quot;oxygala,&quot; a thickened milk product consumed with honey referenced by the Romans in the second century.</p>\n\n<p>Given the wildly different origins (nomadic vs. sedentary), did both Greeks and Turks develop yogurt-making processes independently of one another? Or did they both get it from earlier yogurt-making cultures such as the Mesopotamians? </p>\n\n<p>Finally, when the two cultures became intertwined in the Ottoman Empire, how did Greek and Turkish yogurt cultures clash against and influence one another? </p>\n\n<p>(Also, yes, the yogurt culture pun was intended.)</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/q8rism/despite_very_different_origins_greeks_and_turks/",
  "subreddit": "AskHistorians",
  "id": "q8rism",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I recently learned that Tzaziki is the Greek transliteration of Cacik (a Turkish\ncucumber-lime-herb based yogurt sauce). Both cultures seem to have many\nextremely similar yogurt-based recipes, and use some form of yogurt in a huge\nproportion of their dishes.\n\nTurks trace their heritage to nomadic…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近知ったのですが、Tzazikiはギリシャ語でCacik（トルコの\nヨーグルトソース）のギリシャ語訳だと知りました。) どちらの文化も、ヨーグルトをベースにした多くの\n極めて似通ったヨーグルトベースのレシピが多く、料理の大部分にヨーグルトを使用しています。\n料理の大部分にヨーグルトを使用しています。\n\nトルコ人の祖先は遊牧民である。",
      "title": "ギリシャ人とトルコ人の間には、それぞれ異なる起源を持つにもかかわらず、非常に豊かなヨーグルト文化があるようです。両民族のヨーグルトの歴史はどのようなもので、お互いにどのような影響を与えたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近了解到，Tzaziki是Cacik的希腊语音译（土耳其的一种\n黄瓜-长寿草为基础的酸奶酱）的希腊语音译。) 这两种文化似乎都有许多\n两种文化似乎都有许多极其相似的以酸奶为基础的食谱，并在大量的菜肴中使用某种形式的酸奶。\n在他们的菜肴中使用某种形式的酸奶。\n\n土耳其人将他们的遗产追溯到游牧民族。",
      "title": "尽管起源非常不同，希腊人和土耳其人似乎都有非常丰富的酸奶文化。两个民族的酸奶历史是什么，他们是如何相互影响的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近了解到，Tzaziki是Cacik的希臘語音譯（土耳其的一種\n黃瓜-長壽草爲基礎的酸奶醬）的希臘語音譯。) 這兩種文化似乎都有許多\n兩種文化似乎都有許多極其相似的以酸奶爲基礎的食譜，並在大量的菜餚中使用某種形式的酸奶。\n在他們的菜餚中使用某種形式的酸奶。\n\n土耳其人將他們的遺產追溯到遊牧民族。",
      "title": "儘管起源非常不同，希臘人和土耳其人似乎都有非常豐富的酸奶文化。兩個民族的酸奶歷史是什麼，他們是如何相互影響的？"
    }
  ]
}