{
  "author": "Many_Scratch2269",
  "original_created_utc": 1638036391,
  "title": "The market is now on Extreme Fear. If history is correct, this is the best time to start buying.",
  "created_utc": 1638045049,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The Crypto fear and greed index is now at 21 points signaling &quot;Extreme Fear.&quot; Every time the market entered &quot;Extreme Fear&quot; in the past, it had turned out to be an excellent buying opportunity to buy at lower prices.</p>\n\n<p>I think this time is no different as Crypto is perhaps one of the only assets that people buy less when it is on sale. Every time the market dips, people panic and miss out on the great buying opportunities. The dip we are seeing is extremely close to what we&#39;ve seen back in September and we are most likely going to go back up from here.</p>\n\n<p>TLDR: If you&#39;ve been looking for a  good time to get in, this is it.</p>\n</div><!-- SC_ON -->",
  "score": 258,
  "permalink": "/r/CryptoCurrency/comments/r3j41n/the_market_is_now_on_extreme_fear_if_history_is/",
  "subreddit": "CryptoCurrency",
  "id": "r3j41n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The Crypto fear and greed index is now at 21 points signaling \"Extreme Fear.\"\nEvery time the market entered \"Extreme Fear\" in the past, it had turned out to\nbe an excellent buying opportunity to buy at lower prices.\n\nI think this time is no different as Crypto is perhaps one of the only assets\nthat…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Crypto fear and greed indexは現在21ポイントで \"Extreme Fear \"を示しています。\n過去に市場が「極度の恐怖」に陥るたびに、それは下値で買う絶好の買い場になっていました。\nこれまで市場が \"Extreme Fear \"になるたびに、下値で買う絶好の機会となっていました。\n\n今回も同じだと思います。暗号は、おそらく世界で唯一の資産の1つです。\n今回も同じだと思います。",
      "title": "市場は今、Extreme Fearにある。歴史が正しければ、今が買い始めのベストタイミングです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Crypto恐惧和贪婪指数现在是21点，标志着 \"极端恐惧\"。\n过去每次市场进入 \"极度恐惧 \"时，它都会变成\n是一个极好的买入机会，可以在较低的价格买入。\n\n我认为这次也不例外，因为加密货币可能是唯一的资产之一。\n的资产之一。",
      "title": "市场现在处于极度恐惧状态。如果历史是正确的，这就是开始购买的最佳时机。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Crypto恐懼和貪婪指數現在是21點，標誌着 \"極端恐懼\"。\n過去每次市場進入 \"極度恐懼 \"時，它都會變成\n是一個極好的買入機會，可以在較低的價格買入。\n\n我認爲這次也不例外，因爲加密貨幣可能是唯一的資產之一。\n的資產之一。",
      "title": "市場現在處於極度恐懼狀態。如果歷史是正確的，這就是開始購買的最佳時機。"
    }
  ]
}