{
  "author": "LonelyUnicorn_420",
  "original_created_utc": 1630179572,
  "title": "When Americans are taught geography at school do they skip Africa?",
  "created_utc": 1630193182,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Not to offend anyone, but for all of my life when an American would talk about something/someone from Africa, they wouldn&#39;t specify the country, which implies that Africa is one country.</p>\n\n<p>For example, the other day I saw a video where an American lady said &quot;my fiance is from Africa&quot; and continued on like we all know which country she was talking about.</p>\n\n<p>Honestly this has always bothered me and literally everyone I&#39;ve met because it makes it seem like everyone from Africa is the same, even in movies, we are portrayed the same. </p>\n\n<p>So could anyone explain this to me</p>\n\n<p>PS: this is a genuine question, not meant to start a fight</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/pdgep3/when_americans_are_taught_geography_at_school_do/",
  "subreddit": "TooAfraidToAsk",
  "id": "pdgep3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Not to offend anyone, but for all of my life when an American would talk about\nsomething/someone from Africa, they wouldn't specify the country, which implies\nthat Africa is one country.\n\nFor example, the other day I saw a video where an American lady said \"my fiance\nis from Africa\" and continued on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰かを怒らせるわけではありませんが、私の人生の中で、アメリカ人がアフリカから来た何かや誰かについて話すとき、彼らは国を特定しませんでした。\nアメリカ人がアフリカから来た人の話をするとき、国を特定しませんでした。\nアフリカが一つの国であることを意味しています。\n\n例えば、先日見たビデオでは、アメリカ人女性が「私のフィアンセはアフリカから来たのよ」と言って続けていました。\nはアフリカから来たのよ」と言って、続けて...。",
      "title": "アメリカ人は学校で地理を習うとき、アフリカを省略しますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不是要冒犯任何人，但在我的一生中，当一个美国人谈到\n谈论来自非洲的东西/人时，他们不会指明是哪个国家，这意味着\n这意味着非洲是一个国家。\n\n例如，有一天我看到一个视频，一位美国女士说：\"我的未婚夫\n是来自非洲\"，然后继续说...",
      "title": "当美国人在学校被教授地理知识时，他们会跳过非洲吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不是要冒犯任何人，但在我的一生中，當一個美國人談到\n談論來自非洲的東西/人時，他們不會指明是哪個國家，這意味着\n這意味着非洲是一個國家。\n\n例如，有一天我看到一個視頻，一位美國女士說：\"我的未婚夫\n是來自非洲\"，然後繼續說...",
      "title": "當美國人在學校被教授地理知識時，他們會跳過非洲嗎？"
    }
  ]
}