{
  "author": "rareliquid",
  "the_new_excerpt": "Hello! I wanted to share some of my research and analysis on Shopify after its\nQ4 2020 earnings report. I've also used Shopify myself for 2 years so sharing\nsome insight on that. TLDR on the bottom.\n\nQ4 2020 Financial Results\n\n * Shopify beat EPS estimates by $0.35 by generating GAAP EPS of $0.99…",
  "original_created_utc": 1613623164,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好! 我想分享一下我对Shopify的一些研究和分析，在它的\n2020年Q4财报。我自己也用了2年的Shopify，所以分享一下。\n上的一些见解。TLDR在底部。\n\n2020年第四季度财务业绩\n\n * Shopify比预期的EPS高出0.35美元，产生的GAAP EPS为0.99美元。",
      "title": "Shopify 2020年第四季度财报分析及股票为何下跌？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好! 我想分享一下我對Shopify的一些研究和分析，在它的\n2020年Q4財報。我自己也用了2年的Shopify，所以分享一下。\n上的一些見解。TLDR在底部。\n\n2020年第四季度財務業績\n\n * Shopify比預期的EPS高出0.35美元，產生的GAAP EPS爲0.99美元。",
      "title": "Shopify 2020年第四季度財報分析及股票爲何下跌？"
    }
  ],
  "title": "Shopify Q4 2020 Earnings Analysis and Why the Stock is Down",
  "created_utc": 1613659331,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello! I wanted to share some of my research and analysis on Shopify after its Q4 2020 earnings report. I&#39;ve also used Shopify myself for 2 years so sharing some insight on that. TLDR on the bottom.</p>\n\n<p><strong>Q4 2020 Financial Results</strong></p>\n\n<ul>\n<li>Shopify <strong>beat EPS estimates by $0.35</strong> by generating GAAP EPS of $0.99 and <strong>beat revenue estimates by $64 million</strong> by generating $977 million in revenue</li>\n<li>Shopify had a monster 2020 with <strong>annual revenue growing by an incredible 86%</strong> which in large part is due to the COVID pandemic as stores moved digital and new entrepreneurs came to the scene</li>\n<li>The company’s platform showed incredible resilience and stickiness as the company continued to <strong>grow its monthly recurring revenue at an annual 49% over the past 5 years</strong></li>\n<li><strong>Customers spent $119.6 billion dollars</strong> on Shopify platforms which is up an astonishing <strong>96% year over year</strong></li>\n<li>Perhaps even more impressive is that the company is maintaining all this growth while improving their margins, <strong>reporting operating leverage of 39% in 2020 vs. 53% in 2019</strong>\n\n<ul>\n<li>This was due to the huge uptick in 2020 revenue and further proves that the company has great product-market fit + has established itself as the go-to eCommerce platform for self-starters</li>\n</ul></li>\n</ul>\n\n<p><strong>Why the Stock is Down</strong></p>\n\n<ul>\n<li>Since these numbers are so great, you may be wondering why Shopify stock fell today by ~3% (but as much as 7% intraday)</li>\n<li>First, as you can see from the <a href=\"https://www.google.com/search?q=shopify+stock&amp;rlz=1C5CHFA_enUS744US744&amp;sxsrf=ALeKk00-F5N0A4a0B01WOaVAkOiu1p_BQA:1613621430747&amp;source=lnms&amp;tbm=fin&amp;sa=X&amp;ved=2ahUKEwjGvbmhyPLuAhVYxYsBHU6PC8EQ_AUoAXoECCAQAw&amp;biw=1923&amp;bih=946#scso=_uegtYMqOEa3KmAW5xbiYDw7:0\">latest stock price chart</a>, Shopify had a really strong build-up towards earnings because <strong>investors were expecting a monster quarter</strong> + the stock market was just on fire\n\n<ul>\n<li>This is further represented by the 48.3x next twelve months sales multiple Shopify was trading at as of last Friday (<a href=\"https://cloudedjudgement.substack.com/p/clouded-judgement-21221\">sourced from blog Clouded Judgment</a>- highly recommend to anyone interested in Cloud to sign up for this guy&#39;s newsletter)</li>\n</ul></li>\n<li>The second reason Shopify stock is down is <strong>conservative guidance.</strong> The company acknowledged that its 2020 growth rate is unsustainable and stated that it expects a more <strong>“normalized pace of growth” for 2021</strong>\n\n<ul>\n<li>Investors probably weren’t surprised by this but since the company didn’t provide aggressive guidance, it seems many investors took profits off the table and sold shares</li>\n</ul></li>\n<li>Third, just yesterday, <strong>Amazon</strong> completed its purchase of Australian-based Shopify competitor Selz\n\n<ul>\n<li>The acquisition was announced a month ago, so I don’t think this was a primary reason but I do think it is a notable factor for two reasons:\n\n<ul>\n<li>First, Australia is an extremely important market for Shopify, with management expressing it as a core market in the latest earnings call</li>\n<li>Second, of course is just that Amazon is a terrifying competitor and may be encroaching onto Shopify’s territory</li>\n</ul></li>\n</ul></li>\n</ul>\n\n<p><strong>Earnings Call Highlights</strong></p>\n\n<ul>\n<li>Throughout the call, most of the discussion was about how the company’s financial metrics are all pointing upwards and how eCommerce is growing like crazy but we already covered that stuff, so I’m going to focus on two main takeaways from the call</li>\n<li><strong>The first takeaway are the four key trends management believes will shape the new Shopify era</strong>\n\n<ul>\n<li><strong>The first is that consumers are voting with their wallets</strong>, meaning that people are buying products that represent their identities rather than focusing on utility\n\n<ul>\n<li>To take advantage of this trend, Shopify launched its mobile app SHOP last April, which is a shopping app where you can purchase from brands on the Shopify platform</li>\n<li>Personally, I like the idea but I think there’s an incredible amount of competition in the shopping app space so I’m not super bullish on the app yet</li>\n<li>Also, when asked for more tangible figures on the app’s performance, Tobi Lutke, Shopify’s CEO pretty much dodged the question probably because the numbers are great enough to publicize yet (which is fair since it&#39;s a pretty new product)</li>\n</ul></li>\n<li><strong>The second trend is that retailers are prioritizing retention</strong> and in response, Shopify is continuing to build out services that make the customer experience easier, such as Shop Pay which provides accelerated checkout and Shop Pay Installments which lets customers pay in portions instead of all at once</li>\n<li><strong>The third trend is the growing popularity of modern financial solutions</strong>\n\n<ul>\n<li>The company highlighted its Shopify Capital offering, which provide merchants with short term loans which they can pay back with their sales, Shopify Pay Installments, and Shopify Balance which lets merchants open business accounts</li>\n<li>To me, its clear that Shopify is trying to be a one-stop shop for everything a merchant needs, which I think will help grow the company’s total addressable market</li>\n</ul></li>\n<li><strong>The fourth trend is the power of omnichannel,</strong> which is the ability for businesses to be on multiple platforms\n\n<ul>\n<li>Shopify has established partnerships with some of the best marketing channels and I believe this trend will only continue</li>\n</ul></li>\n</ul></li>\n<li><strong>The second key takeaway from the earnings call is the 3 areas the company will be investing into in 2021 and will be sources of future growth</strong>\n\n<ul>\n<li><strong>The first is the Shopify Fulfillment Network</strong> which the company launched 18 months ago and is currently under beta testing\n\n<ul>\n<li>If you’re not familiar with fulfillment, basically it allows merchants to not have to physically manage inventory themselves and instead Shopify would have huge warehouses that store your products and ship them out when orders are received for a small fee per item</li>\n<li>I think this is a great complement to Shopify’s services and think this will be a great area for future growth</li>\n</ul></li>\n<li><strong>The second main investment will be on the Shop App,</strong> which I mentioned a bit earlier already and am cautiously optimistic of</li>\n<li><strong>The third investment will be on international expansion,</strong> and management stated that international GMV grew at a faster pace than overall GMV\n\n<ul>\n<li>GMV = Gross Merchandise Volume and is basically the total $ amount spent on Shopify platforms</li>\n<li>This is obviously a great sign and Shopify has such a great product that I think there is a lot of room for growth in other countries</li>\n</ul></li>\n<li><strong>The fourth bonus one that management tacked on was Shopify POS</strong> <strong>(point-of-sale)</strong>, which competes with Square as an offline retail transaction system</li>\n</ul></li>\n</ul>\n\n<p><strong>My Personal Experience With Shopify</strong></p>\n\n<ul>\n<li>I used Shopify for ~2 years as a merchant selling clothes and have nothing but great things to say about the platform. Shopify is so much more than just a company that lets you create an eCommerce site. The services I personally also used are:\n\n<ul>\n<li><strong>Shopify shipping</strong> - The company gives competitive discounted shipping rates that made it cheaper for me to fulfill myself vs. fulfillment centers (which we also used and are able to offer discounted shipping rates since they ship so many items)</li>\n<li><strong>Shopify apps</strong> - There&#39;s an app for everything and a really strong ecosystem of developers who are motivated to make good apps since they earn $$</li>\n<li><strong>Shopify POS</strong> - Before COVID, I held 2 physical pop-up shops and used Shopify&#39;s POS system. The only competitor I was considering was Square but Shopify&#39;s POS connects so well to everything I already set up on my store (i.e. inventory, pricing, etc.) that there Shopify POS was a no-brainer</li>\n<li><strong>Shopify Customer Service</strong> - This may be the best part as a budding entrepreneur. Shopify service is AMAZING and I was able to call a representative pretty much anywhere at any time for help with my site</li>\n</ul></li>\n</ul>\n\n<p><strong>Buy, Hold, or Sell?</strong></p>\n\n<ul>\n<li>I think if you&#39;re already a buyer, then there&#39;s for sure no reason to sell and I would hold for the next 5+ years.</li>\n<li>But for me, I haven&#39;t yet initiated a position and while the company&#39;s valuation is high (~48X forward sales), the company&#39;s growth rate, sticky platform + recurring revenue, and dominance in a growing eCommerce market provide plenty of upside</li>\n<li>Personally with interest rates having gone up and a potential shift out of tech growth stocks (just my personal opinion), Shopify is one of the stocks I&#39;m keeping a close eye on and hoping to buy during any corrections</li>\n<li>I&#39;d love to get some opinions from you all on what you plan to do since I&#39;m pretty torn myself on what to do</li>\n</ul>\n\n<p><strong>Sources</strong></p>\n\n<ul>\n<li><a href=\"https://seekingalpha.com/news/3662722-shopify-eps-beats-0_37-beats-on-revenue\">Earnings results</a></li>\n<li><a href=\"https://seekingalpha.com/article/4406716-shopifys-shop-ceo-tobi-lutke-on-q4-2020-results-earnings-call-transcript\">Q4 2020 earnings transcript</a></li>\n<li><a href=\"https://s23.q4cdn.com/550512644/files/doc_financials/2020/q4/Shopify-Investor-Deck-Q4-2020.pdf\">Q4 2020 earnings investor presentation</a></li>\n<li><a href=\"https://cloudedjudgement.substack.com/p/clouded-judgement-21221\">Clouded Judgment (for Shopify&#39;s sales multiple)</a></li>\n</ul>\n\n<p><strong>TLDR: Shopify crushed earnings growing revenue at an insane 86% from 2019-2020. But shares slightly dipped by 3% due to high investor expectations + conservative guidance for 2021. From personally using Shopify myself for 2 years + knowing the eCommerce market will only continue to grow, I think the company has a really bright future ahead. But, I&#39;m torn given the recent stock price run-up and am trying to be patient and wait for a dip (unless convinced otherwise).</strong></p>\n</div><!-- SC_ON -->",
  "score": 77,
  "permalink": "/r/investing/comments/lmdvx1/shopify_q4_2020_earnings_analysis_and_why_the/",
  "subreddit": "investing",
  "id": "lmdvx1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332881975
}