{
  "author": "videopro10",
  "original_created_utc": 1659127869,
  "title": "At one point in 1762, the Korean Crown Prince Sado was murdering 'many people per day' in his palace. Do we know how many he killed, and whether this caused problems for the government?",
  "created_utc": 1659201548,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;From the 1805 Memoir of Lady Hyegyeong:   &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The prince often summoned blind fortunetellers.  When they said something he did not like, he killed them.  Many medical doctors, astronomers, and servants were also killed or injured.  It reached a point where every day many dead bodies and victims of injury had to be carried out from the palace.  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This seems a little over the top, especially for a time relatively recently.  The killing was recognized as a problem by other members of his household, but basically brushed off until it seemed that he threatened to kill the king himself.  Do we have any other contemporary sources that tell us how many people he killed total, and whether there were any repercussions for this?  Would it have been news in Korea that the prince is killing scores of people in the palace?  Were there any calls from the public or charges from the victim&amp;#39;s families, or was the royal family so powerful in Korean culture at that time that nobody could even talk about it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/wbfdwy/at_one_point_in_1762_the_korean_crown_prince_sado/",
  "subreddit": "AskHistorians",
  "id": "wbfdwy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "From the 1805 Memoir of Lady Hyegyeong:\n\n> The prince often summoned blind fortunetellers. When they said something he\n> did not like, he killed them. Many medical doctors, astronomers, and servants\n> were also killed or injured. It reached a point where every day many dead\n> bodies and victims of…"
}