{
  "author": "Nuewim",
  "original_created_utc": 1640291714,
  "title": "Metaverse wasn't invented by Facebook. Meta ≠ Metaverse",
  "created_utc": 1640314329,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;People seem to treat Metaverse and Meta as one thing and what what even worse invented by  Facebook.&lt;/p&gt;\n\n&lt;p&gt;Metaverse wasn&amp;#39;t invested by Facebook. It exist much longer than few months. Whole idea of metaverse is much, much older. Meta, created by FB is named after Metaverse not other way areound. It is one of many Metaverse projects. If you are not a fan of Facebook and Zukerberg you can just simply never use Meta the same way like you can use other social media instead of Facebook.&lt;/p&gt;\n\n&lt;p&gt;It is the same level of ignorance like saying Musk invented BTC. Before you will start talking about something please DYOR. If you have no idea about something don&amp;#39;t talk about it at all, cause you spread  misinformations. It hurt whole idea of Metaverse to limit it to just one project. And CC should always give real informations, not fake bias. If you are not sure ask.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 169,
  "permalink": "/r/CryptoCurrency/comments/rn4p0x/metaverse_wasnt_invented_by_facebook_meta/",
  "subreddit": "CryptoCurrency",
  "id": "rn4p0x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "People seem to treat Metaverse and Meta as one thing and what what even worse\ninvented by Facebook.\n\nMetaverse wasn't invested by Facebook. It exist much longer than few months.\nWhole idea of metaverse is much, much older. Meta, created by FB is named after\nMetaverse not other way areound. It is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "MetaverseとMetaを同じものとして扱っているようですが、もっとひどいのは\nFacebookによって発明された。\n\nメタバースはフェイスブックが投資したのではありません。それは数ヶ月よりもずっと長い間存在していました。\nメタバースという考え方は、もっともっと古いものです。FBによって作られたメタは、その名前に由来しています。\nメタバースは、その逆ではありません。それは...",
      "title": "メタバースはFacebookが発明したわけではありません。メタ≠メタバース"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "人们似乎把Metaverse和Meta当作一个东西，什么什么更糟糕\n是由Facebook发明的。\n\nMetaverse并不是由Facebook投资的。它存在的时间远远超过几个月。\n整个metaverse的概念要早得多，早得多。FB创造的Meta是以Metaverse命名的。\nMetaverse的名字，而不是其他方式。它是...",
      "title": "Metaverse并不是由Facebook发明的。Meta ≠ Metaverse"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們似乎把Metaverse和Meta當作一個東西，什麼什麼更糟糕\n是由Facebook發明的。\n\nMetaverse並不是由Facebook投資的。它存在的時間遠遠超過幾個月。\n整個metaverse的概念要早得多，早得多。FB創造的Meta是以Metaverse命名的。\nMetaverse的名字，而不是其他方式。它是...",
      "title": "Metaverse並不是由Facebook發明的。Meta ≠ Metaverse"
    }
  ]
}