{
  "author": "hinthue",
  "the_new_excerpt": "In a recent video, Cathie goes back in time to the end of 2016 - Early 2017.\n\nQuantitative easing was on its way out and the FED was going to start raising\nthe interest rates. The market was very nervous...\n\nTrump won the election and the odds of a cyclical burst increased because of his\npromise to…",
  "original_created_utc": 1616248307,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在最近的一段视频中，Cathie将时间回溯到2016年底-2017年初。\n\n量化宽松政策正在退出，FED要开始提高\n的利率。市场非常紧张...\n\n特朗普赢得大选，周期性爆发的概率增加，因为他的\n承诺",
      "title": "凯茜-伍德：通货膨胀与通货紧缩力量的比较"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在最近的一段視頻中，Cathie將時間回溯到2016年底-2017年初。\n\n量化寬鬆政策正在退出，FED要開始提高\n的利率。市場非常緊張...\n\n特朗普贏得大選，週期性爆發的概率增加，因爲他的\n承諾",
      "title": "凱茜-伍德：通貨膨脹與通貨緊縮力量的比較"
    }
  ],
  "title": "Cathie Wood: Inflation vs Deflationary forces",
  "created_utc": 1616258089,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In a recent video, Cathie goes back in time to the end of 2016 - Early 2017.</p>\n\n<p>Quantitative easing was on its way out and the FED was going to start raising the interest rates.\nThe market was very nervous...</p>\n\n<p>Trump won the election and the odds of a cyclical burst increased because of his promise to cut taxes and that&#39;s exactly what happened!</p>\n\n<p>In the beginning the equity market was very nervous around the idea that interest rates would be going up.\nWhen Trump was elected - value stock took off just like they&#39;re getting off now - responding to this idea that economy is developing ahead of steam so the value stocks have taken off.</p>\n\n<p>If you look at year to date: energy stocks are up 27%, financial stocks 11%, tech stock 1% and health stocks are actually down.\nSo basically traditional value stocks are having a nice run!\nSo right now we are in a 2016 like scenario, value stocks are up and growth strategy stocks are down (Take ARK ETFs as a perfect example)</p>\n\n<p>Cathie thinks this is great because the bull market is broadening out to other sectors and this - can only be a good thing for &quot;disruptive innovation&quot; stocks investors.</p>\n\n<p>What would be negative instead?\nIt would be a negative thing if the bull market continues to narrow and only innovation strategy worked, because that&#39;s what happened with the .com tech bubble in 2000.\n(And we all know how bad the consequences have been).</p>\n\n<p>Cathie actually likes the fear that ARK is experiencing and that there&#39;s a reality check, in terms of the speculative moves that have taken place within the innovation space.</p>\n\n<p>What happened post Q4 2016 after the market had broadened out?\nWell… 2017 was a fantastic year for the equity market in general with cyclical value and growth. \nAnd she believes we&#39;re now moving towards a similar scenario.</p>\n\n<p>Now let&#39;s find out what Cathie&#39;s said on Bitcoin being speculative, not sustainable, not environment friendly and heavily used for illicit activities.\nWith a lot of respect Cathie says that Janet Yellen doesn&#39;t understand the crypto space, simply because it&#39;s not her main focus.</p>\n\n<p>Regarding the environmental issue: comparing the energy required for BTC mining to the energy required to mine gold you can clearly see that the first is a fraction of the latter. It&#39;s an infamous comparison in favor of BTC. Further think about the energy consumption for a bitcoin transaction to the ones of the traditional financial banking system. It&#39;s a fraction and the comparison is again ridiculous in favor of BTC. </p>\n\n<p>She also reports what an FBI agent told her.\nAccording to him BTC is the best thing that happened to the FBI, because they&#39;ve tons of cryptographers who are able to break codes and figure out illicit activities and they&#39;ve been able to track and arrest many criminals following the transactions to their wallets.\nBTC blockchain is so transparent based on IP tracking and IP pattern recognition, that it becomes a useful tool against crime.</p>\n\n<p>Talking about BTC she admits it is speculative, but we can see trillions of dollars in use cases.\nSo it&#39;s very important to be supportive of those who are evolving this ecosystem and think about ways to help the community (such as developers) to secure the blockchain tech.\nRegarding the time of 10 minutes for a transaction… it could seem a lot compared to smart contracts based blockchains but you have to consider that it is a compromise because of the higher security of Bitcoin.\nAnd the high fees for a single transaction are nothing if you compare them with the ones of the traditional banking system.</p>\n\n<p>Cathie makes few considerations on inflation and that the monetary policy ease throughout the world, is going to ignite inflation.\nARK thinks there are 2 major deflationary forces evolving in the global economy and that these are going to be in a duelling match with each other.\nGood vs bad deflation.\nGood deflation has to do with technologically enabled innovation. It&#39;s deflationary by nature, it rides down cost curves and production times.So the industry gains efficiency and productivity at the same time.</p>\n\n<ul>\n<li>Take as an example the Electric Vehicle space. ARK analysts found out that deflation rate is 28% for every cumulative doubling in the number of units produced. We&#39;re at 2.2M units EVS right now and it&#39;s not going take long to double these numbers.</li>\n<li>In DNA sequencing space it&#39;s a 40% for every cumulative doubling and we&#39;re at a very low base there as well. But those low bases are going to move up pretty quickly.\nAnd according to ARK forecasts… EVs sales will move from 2.2M to 40M (almost a 20x increase) in the next 5 years. And sales will only begin to impact economic statistics as they scale in the next few years.</li>\n</ul>\n\n<p>Concluding with Cathie&#39;s warning about what she defines as disruptive innovation.She says that it is going to cause creative destruction in the traditional world order:</p>\n\n<ul>\n<li>Robotics</li>\n<li>AI</li>\n<li>Blockchain</li>\n<li>DNA sequencing</li>\n</ul>\n\n<p>And these are going to converge: autonomous vehicle are going to be robots, energy storage will be electric and AI will be everywhere.It&#39;s a combinatorial, multiplicative, compounding effect.\nThink about these as if they were waves crashing in the ocean and think about companies as ships navigating. There will be some ships that get elevated but others that go dip. The energy liberated in the crashes/convergence will be revolutionary at the base of the entire world and this is what she defines the powerful good deflationary forces. So when combined they produce a movement forward.</p>\n\n<p>On the other hand the bad deflationary forces are associated to what just mentioned.\nThe disintermediation and the disruption to the traditional world order is going to put lot of companies at risk. Companies that were thinking that nothing would ever change.\nFinancial services, internal combustion engine automobile, rails and all the suppliers around.\nRay Dalio, Jeff Gundlach and Howard Marks have warned many times the investors on this bad deflation.</p>\n\n<p>So we can conclude that these 2 forces will be very powerful and will have huge effects in the next few years.</p>\n\n<p>Note: I’m not a financial advisor</p>\n\n<p>Note 2: If you’d rather listen to than reading this article, you can find the video version on YT at the following link: <a href=\"https://www.youtube.com/watch?v=MTOytkHLP4g\">https://www.youtube.com/watch?v=MTOytkHLP4g</a></p>\n</div><!-- SC_ON -->",
  "score": 384,
  "permalink": "/r/investing/comments/m97ggg/cathie_wood_inflation_vs_deflationary_forces/",
  "subreddit": "investing",
  "id": "m97ggg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752819523
}