{
  "author": "UnexperiencedIT",
  "original_created_utc": 1635896185,
  "title": "Do yourself a big favor and keep the value of your portfolio to yourself",
  "created_utc": 1635904633,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There is no need to tell anyone if you have made gains or how much money you have in your portfolio.</p>\n\n<p>Why would they do that, what do you get with it?</p>\n\n<p>First, you have the risk of someone you told that to go out and start telling other people about it. Therefore, someone may come tomorrow to threaten you, to try to get that money out of you.</p>\n\n<p>Since I live in a small town, by tomorrow everyone would know how much money I made in cryptocurrencies.  </p>\n\n<p><em>&quot;Could you borrow me some money, hey take us out to lunch now when you made money doing nothing,  take us out for a drink, why didn&#39;t you tell me to invest in that coin when you knew it was going to jump, hey</em> <em>you made money doing practically nothing..&quot;</em></p>\n\n<p>Envy and jealousy are in human nature. </p>\n\n<p>People who don’t understand cryptocurrencies have the impression that we put money here and that’s it, we wait for the gains and end of the story. Ez money they think.</p>\n\n<p><strong>I literally don&#39;t see a single reason why they would talk about the value of their portfolio to other people</strong>, you will get absolutely nothing out of it.  Keep that secret to yourself. </p>\n\n<p>My friends think that I am a dumbass for doing this, do you really think that I will tell them about my gains? I am just going to let them think whatever they want, who cares honestly.</p>\n</div><!-- SC_ON -->",
  "score": 243,
  "permalink": "/r/CryptoCurrency/comments/qlhe6p/do_yourself_a_big_favor_and_keep_the_value_of/",
  "subreddit": "CryptoCurrency",
  "id": "qlhe6p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There is no need to tell anyone if you have made gains or how much money you\nhave in your portfolio.\n\nWhy would they do that, what do you get with it?\n\nFirst, you have the risk of someone you told that to go out and start telling\nother people about it. Therefore, someone may come tomorrow to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "儲かったかどうかや、ポートフォリオの金額を誰かに伝える必要はありません。\n儲かったかどうかや、ポートフォリオにいくら入っているかを誰かに伝える必要はありません。\n\nなぜそんなことをするのか、それによって何が得られるのか。\n\nまず、その話をした人が、他の人にその話をしてしまうというリスクがあります。\n他の人に話してしまうリスクがあります。そのため、誰かが明日にでも...",
      "title": "自分のポートフォリオの価値を自分の中にとどめておくことは、大きな意味があります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "没有必要告诉任何人你是否取得了收益或你在投资组合中有多少钱。\n在你的投资组合中有多少钱。\n\n他们为什么要这样做，你能得到什么？\n\n首先，你有风险，你告诉的人出去后开始告诉\n其他的人。因此，明天有人可能会来...",
      "title": "帮自己一个大忙，把你的投资组合的价值留给自己"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "沒有必要告訴任何人你是否取得了收益或你在投資組合中有多少錢。\n在你的投資組合中有多少錢。\n\n他們爲什麼要這樣做，你能得到什麼？\n\n首先，你有風險，你告訴的人出去後開始告訴\n其他的人。因此，明天有人可能會來...",
      "title": "幫自己一個大忙，把你的投資組合的價值留給自己"
    }
  ]
}