{
  "author": "SrPeixinho",
  "original_created_utc": 1625464462,
  "title": "Tldr: What REALLY are Smart Contracts?",
  "created_utc": 1625484689,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/odypdh/tldr_what_are_smart_contracts/\">this</a> post, while well-intentioned, massively undersells what smart contracts are. Smart contracts aren&#39;t just a fancy feature. Smart contracts are <strong>the completion of the Bitcoin idea</strong>. Without smart contracts, Bitcoin is incomplete, because it is a decentralized coin, surrounded by a centralized economy. It misses its own point.</p>\n\n<ul>\n<li><p>Wanna buy Bitcoin options, futures, bonds, longs, or any other financial instrument? You need a <strong>centralized</strong> exchange.</p></li>\n<li><p>Wanna bet some Bitcoin in a money match of Poker against some anon on the deep web? You need a <strong>centralized</strong> cassino.</p></li>\n<li><p>Wanna leave your Bitcoin for your family in the case you die? You need a <strong>centralized</strong> custodian. </p></li>\n<li><p>Wanna mint, sell and buy skins or NFTs using Bitcoin? You need a <strong>centralized</strong> game or app.</p></li>\n</ul>\n\n<p>Now, replace Bitcoin by &quot;Ether&quot; and all the <strong>centralized</strong> companies above can be replaced by a suitable smart contract that performs the same operation without a third party. That&#39;s what smart contracts are. The whole point of creating a decentralized currency is to remove centralization, but that point is lost if everything you <em>do with</em> that currency requires a centralized company. If this isn&#39;t enough for you to get what I&#39;m implying, I don&#39;t know what else is.</p>\n\n<p>Have a great day!</p>\n</div><!-- SC_ON -->",
  "score": 190,
  "permalink": "/r/CryptoCurrency/comments/oe0wj9/tldr_what_really_are_smart_contracts/",
  "subreddit": "CryptoCurrency",
  "id": "oe0wj9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I think this\n[https://www.reddit.com/r/CryptoCurrency/comments/odypdh/tldr_what_are_smart_contracts/]\npost, while well-intentioned, massively undersells what smart contracts are.\nSmart contracts aren't just a fancy feature. Smart contracts are the completion\nof the Bitcoin idea. Without smart…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこの\n[https://www.reddit.com/r/CryptoCurrency/comments/odypdh/tldr_what_are_smart_contracts/]\nの投稿は、善意ではありますが、スマートコントラクトが何であるかを大幅に過小評価しています。\nスマートコントラクトは、単なる機能ではありません。スマートコントラクトは、ビットコインのアイデアの完成形です。\nBitcoinのアイデアの完成形です。スマートコントラクトがなければ...",
      "title": "Tldr: スマートコントラクトとは一体何なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为这\n[https://www.reddit.com/r/CryptoCurrency/comments/odypdh/tldr_what_are_smart_contracts/]\n的帖子，虽然用意良好，但大大低估了智能合约的内涵。\n智能合约不只是一个花哨的功能。智能合约是完成\n比特币的理念。没有智能合约，就没有比特币。",
      "title": "Tldr: 什么才是真正的智能合约？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲這\n[https://www.reddit.com/r/CryptoCurrency/comments/odypdh/tldr_what_are_smart_contracts/]\n的帖子，雖然用意良好，但大大低估了智能合約的內涵。\n智能合約不只是一個花哨的功能。智能合約是完成\n比特幣的理念。沒有智能合約，就沒有比特幣。",
      "title": "Tldr: 什麼纔是真正的智能合約？"
    }
  ]
}