{
  "author": "chumbawamba56",
  "the_new_excerpt": "Wood is crazy expensive right now. and most seem to believe that the cost is\ndriven by the demand for wood. But financial statements from 4 of the top 5\ncompanies argues another excuse. According to Sawmill DB\n[https://www.sawmilldatabase.com/productiontoplist.php?continent_id=998], the\ntop 5…",
  "original_created_utc": 1622756602,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、木材は非常に高価ですが、多くの人は、木材の需要がコストを押し上げていると考えているようです。\n木材の需要がコストを押し上げていると考えているようです。しかし、トップ5社のうち4社の財務諸表を見ると\n社の財務諸表は別の言い訳をしています。ソーミルDBによると\n[https://www.sawmilldatabase.com/productiontoplist.php?continent_id=998]によると\n上位5社は...",
      "title": "木材の価格がこれほどまでに高いと、私は不思議な気持ちになりました。なぜ木材がこんなに高いのか、そのお金はどこに行くのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在的木材价格很高，而且大多数人似乎认为，成本是由木材的需求驱动的。\n由木材的需求所驱动。但前5名中的4名的财务报表\n公司的财务报表证明了另一个借口。根据Sawmill DB\n[https://www.sawmilldatabase.com/productiontoplist.php?continent_id=998]，这\n前5名...",
      "title": "由于木材价格如此之高，我产生了好奇心。为什么木材如此昂贵，所有的钱都去了哪里？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在的木材價格很高，而且大多數人似乎認爲，成本是由木材的需求驅動的。\n由木材的需求所驅動。但前5名中的4名的財務報表\n公司的財務報表證明了另一個藉口。根據Sawmill DB\n[https://www.sawmilldatabase.com/productiontoplist.php?continent_id=998]，這\n前5名...",
      "title": "由於木材價格如此之高，我產生了好奇心。爲什麼木材如此昂貴，所有的錢都去了哪裏？"
    }
  ],
  "title": "With wood prices so high, curiosity struck me. Why is wood so expensive and where is all the money going?",
  "created_utc": 1622762958,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Wood is crazy expensive right now. and most seem to believe that the cost is driven by the demand for wood. But financial statements from 4 of the top 5 companies argues another excuse. According to <a href=\"https://www.sawmilldatabase.com/productiontoplist.php?continent_id=998\">Sawmill DB</a>, the top 5 production mills in the US are: West Fraser, Canfor, Weyerhaeuser, Georgia Pacific (Not PT), and Resolute forests. Since GP is not publicly traded everything I share will not include them. </p>\n\n<p>One thing I noticed with all of these companies is that in the past year their stock price has sky rocketed. </p>\n\n<ul>\n<li><p>West Fraser: 130% </p></li>\n<li><p>Canfor 180%</p></li>\n<li><p>Weyerhaeuser 80%</p></li>\n<li><p>Resolute Forest <strong>500%</strong></p></li>\n</ul>\n\n<p>Why is their price doing this? it isn&#39;t like wsb is simping over it. </p>\n\n<p>Looking at all of their filings for the SEC tells you exactly why their price has jumped. it will also tell you why the price of wood has also skyrocketed. and it isnt a jump in demand that caused their price to raise or the price of wood to raise. These companies are just selling them for higher prices and pocketing the excess profit.</p>\n\n<p>There are 4 data points that support the artificial jump in prices. Inventories, Sales, COGS, and New Earnings. below is the data for all 4 companies. </p>\n\n<hr/>\n\n<p><strong>West Fraser</strong></p>\n\n<table><thead>\n<tr>\n<th>:)</th>\n<th>Q1.2021</th>\n<th>Q1.2020</th>\n<th>increase of</th>\n</tr>\n</thead><tbody>\n<tr>\n<td>Inventories</td>\n<td>1,137,000,000</td>\n<td>735,000,000</td>\n<td>21%</td>\n</tr>\n<tr>\n<td>Sales</td>\n<td>2,343,000,000*</td>\n<td>890,000,000</td>\n<td>163%</td>\n</tr>\n<tr>\n<td>COGS</td>\n<td>1,039,000,000</td>\n<td>630,000,000</td>\n<td>65%</td>\n</tr>\n<tr>\n<td>Selling, G and A</td>\n<td>78,000,000</td>\n<td>41,000,000</td>\n<td>90%</td>\n</tr>\n<tr>\n<td>Net Earnings</td>\n<td>665,000,000</td>\n<td>9,000,000(no this is not a typo)</td>\n<td><strong>7289%</strong></td>\n</tr>\n</tbody></table>\n\n<p>*their acquisition of norbord was 707,000,000 of that unfortunately COGS for it isn&#39;t available. </p>\n\n<p>West Fraser has seen a jump in net earnings of over 7k percent. In one year they grew their net earnings by over 72x. COGS only increased by 65% which means the price of lumber or getting the lumber hasn&#39;t changed. This jump in COGS is likely due to Norbord. So even taking that out of the equation would mean they doubled their sales in a year. That is absolutely nuts. That is a profit margin that went from 2.4% to 66%. that is not normal, either. but we aren&#39;t done lets look at the other companies.</p>\n\n<hr/>\n\n<p><strong>Canfor</strong></p>\n\n<table><thead>\n<tr>\n<th>:)</th>\n<th>Q4.2020</th>\n<th>Q4.2019</th>\n<th>Increase of</th>\n</tr>\n</thead><tbody>\n<tr>\n<td>Inventories</td>\n<td>867,500,000</td>\n<td>803,900,000</td>\n<td>8%</td>\n</tr>\n<tr>\n<td>Sales</td>\n<td>5,454,400,000</td>\n<td>4,658,300,000</td>\n<td>17%</td>\n</tr>\n<tr>\n<td>COGS</td>\n<td>3,538,800,000</td>\n<td>3,618,600,00</td>\n<td>-2%</td>\n</tr>\n<tr>\n<td>Selling, G and A</td>\n<td>127,900,000</td>\n<td>124,900,000</td>\n<td>2.4%</td>\n</tr>\n<tr>\n<td>Net Earnings</td>\n<td>559,900,000</td>\n<td>-269,700,000</td>\n<td>WTF?</td>\n</tr>\n</tbody></table>\n\n<hr/>\n\n<p><strong>Weyerhaeuser</strong></p>\n\n<table><thead>\n<tr>\n<th>:)</th>\n<th>Q1.2021</th>\n<th>Q1.2020</th>\n<th>Increase Of</th>\n</tr>\n</thead><tbody>\n<tr>\n<td>Inventories</td>\n<td>505,000,000</td>\n<td>443,000,000</td>\n<td>14%</td>\n</tr>\n<tr>\n<td>Sales</td>\n<td>2,506,000,000</td>\n<td>1,728,000,000</td>\n<td>45%</td>\n</tr>\n<tr>\n<td>COGS</td>\n<td>1,430,000,000</td>\n<td>1,382,000,000</td>\n<td>3%</td>\n</tr>\n<tr>\n<td>Selling, G and A</td>\n<td>90,000,000</td>\n<td>74,000,000</td>\n<td>22%</td>\n</tr>\n<tr>\n<td>Net Earnings</td>\n<td>681,000,000</td>\n<td>150,000,000</td>\n<td>354%</td>\n</tr>\n</tbody></table>\n\n<hr/>\n\n<p><strong>Resolute Forest Products</strong></p>\n\n<table><thead>\n<tr>\n<th>3 months ending March 31st</th>\n<th>2021</th>\n<th>2020</th>\n<th>Increase Of</th>\n</tr>\n</thead><tbody>\n<tr>\n<td>inventories</td>\n<td>512,000,000</td>\n<td>462,000,000</td>\n<td>11%</td>\n</tr>\n<tr>\n<td>Sales</td>\n<td>873,000,000</td>\n<td>689,000,000</td>\n<td>27%</td>\n</tr>\n<tr>\n<td>COGS</td>\n<td>522,000,000</td>\n<td>524,000,000</td>\n<td>~</td>\n</tr>\n<tr>\n<td>Selling, G and A</td>\n<td>46,000,000</td>\n<td>34,000,000</td>\n<td>35%</td>\n</tr>\n<tr>\n<td>Net Earnings</td>\n<td>87,000,000</td>\n<td>-1,000,000</td>\n<td>another one turning things around</td>\n</tr>\n</tbody></table>\n\n<p>Some interesting things to point out:</p>\n\n<ul>\n<li><p>all these companies have a significant increase in profit margin. 2 of them were able to reverse their position and get positive earnings, while the other 2 were able to increase their net earnings by significant amounts. </p></li>\n<li><p>in 3 of these cases, the increase in sale revenue was something to brag about. while the remaining company looks like they&#39;re geniuses for the growth they had. All of them did this with out having a huge jump in COGS. I include West Fraser in this because they acquired a company in Q1 of this year. for this reason I bet their COGS would like the same withholding their new acquisition. </p></li>\n<li><p>Although &quot;Selling, G&amp;A&quot; is not nearly as important or necessary as the others it is still necessary to show that any increase in lumber is due to labor. I assume labor is incorporated in COGS but I want to provide this for anyone reading this and wondering if they may be putting labor into a different classification. That was my first though when I saw COGS didnt jump as high as sales.</p></li>\n<li><p>Inventories for all companies were marginally impacted. The growth they experienced I&#39;d say is probably just volatility due to seasonal reasons. but an interesting tidbit I want to share is that all of these companies blame the increase in prices on the pandemic claiming that it had a negative impact on the supply side. but as you can tell all companies have a growth in their inventories. All but Resolute Forest value their inventories using the lower of costs. meaning that discounting the growth in inventories should be done to a minimum. They also blame an increase of demand from people working at home for the increase in business. This makes sense. But when you include the fact that the price of wood has doubled since last year it&#39;s a little bit unreasonable to say that the massive increase in revenue is due strictly to demand side. More than likely they increased wood prices is to make up for any lack in profits they would have gotten and now they don&#39;t want to lower them because they see how much more money they&#39;re making. </p></li>\n</ul>\n\n<p>Everything I shared with you is because a friend at work noticed this with west fraser. I wanted to confirm that this was a market wide phenomenon. I think it is safe to say that the increase in wood isnt market force related but rather artificially inflated reasons. Let me know what you think in the comments. This is my first time ever sharing research I did and If I missed a crucial step I would love the critique. If I get good at doing this I will probably submit more findings I have in the future. Thank you.</p>\n</div><!-- SC_ON -->",
  "score": 5352,
  "permalink": "/r/stocks/comments/nrou4z/with_wood_prices_so_high_curiosity_struck_me_why/",
  "subreddit": "stocks",
  "id": "nrou4z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404886630
}