{
  "author": "thedave003",
  "original_created_utc": 1638869102,
  "title": "My phone with all my crypto was stolen",
  "created_utc": 1638891140,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Edit: Updated information about mobile.&lt;/p&gt;\n\n&lt;p&gt;Update 1: Moved 65% of the funds. Taking sometime since I&amp;#39;m using a shitty phone right now. Thank you for so many responses. I&amp;#39;ll update you as soon as its done. In the meantime, if you come up with more solutions, I&amp;#39;m happy to learn about them.&lt;/p&gt;\n\n&lt;p&gt;Update 2: Any idea what to do about Google Authenticator app. Binance not letting me change password or log in without the code.&lt;/p&gt;\n\n&lt;p&gt;Hey guys, I did a very stupid thing and I would like your help to understand the best-case scenarios. Yesterday, someone stole my phone. All my crypto wallets were logged-in.&lt;/p&gt;\n\n&lt;p&gt;Mobile: Nokia 8.1 (Android), Google&amp;#39;s Find my Device isn&amp;#39;t helpful because the device is offline/switched off.&lt;/p&gt;\n\n&lt;p&gt;Now comes the stupidest thing I ever did in my life which is none of the wallets had fingerprint authentication enabled or any passcodes. I have no explanation to give for this stupidity. What are the options available?&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;When I go to recover my accounts using my private keys, (on another phone) how do I disable such wallets on the missing phone?&lt;/li&gt;\n&lt;li&gt;Can I remove the information from the phone and wallets remotely?&lt;/li&gt;\n&lt;li&gt;When I do recover my wallets to a new device, are they still active on the old device? If so, there must be a way to deactivate the app (on the stolen device). I don&amp;#39;t want to lose my wallet addresses.&lt;/li&gt;\n&lt;li&gt;Furthermore, Will the culprit have access to my central exchange accounts? Should I make new ones or just file a ticket to ensure they know my account could be breached?  any thoughts or solutions would be greatly appreciated.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Any thoughts or solutions would be greatly appreciated.&lt;/p&gt;\n\n&lt;p&gt;PS: I apologize in advance if there are any grammatical errors or if I haven&amp;#39;t been able to explain myself properly.&lt;/p&gt;\n\n&lt;p&gt;PPS: Please upvote as much as possible so that I can get any experienced answers.&lt;/p&gt;\n\n&lt;p&gt;PPPS: If such a topic has already been discussed, please share the link with me in the comments, I&amp;#39;m sorry I don&amp;#39;t have much time to go through all the posts to find similar experiences. I&amp;#39;m already busy dealing with restoring my other accounts.&lt;/p&gt;\n\n&lt;p&gt;Thanks everyone!&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/rav9cn/my_phone_with_all_my_crypto_was_stolen/",
  "subreddit": "CryptoCurrency",
  "id": "rav9cn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Edit: Updated information about mobile.\n\nUpdate 1: Moved 65% of the funds. Taking sometime since I'm using a shitty phone\nright now. Thank you for so many responses. I'll update you as soon as its done.\nIn the meantime, if you come up with more solutions, I'm happy to learn about\nthem.\n\nUpdate 2:…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "編集：モバイルに関する情報を更新しました。\n\n更新1：資金の65％を移動しました。携帯電話を使っているので、時間がかかる。\n今すぐ たくさんの回答ありがとうございました。完了したらすぐに更新します。\nとりあえず、他の解決策を思いついたら、教えていただけると嬉しいです。\nを使用します。\n\n更新2：...",
      "title": "私の暗号が入った携帯電話が盗まれました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：更新了有关移动的信息。\n\n更新1：移动了65%的资金。需要一些时间，因为我现在使用的是一个低劣的手机\n现在。感谢这么多的回应。我将在完成后立即向你们更新。\n同时，如果你想出更多的解决方案，我很高兴能了解到\n它们。\n\n更新2：...",
      "title": "我的手机和我所有的加密货币都被盗了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：更新了有關移動的信息。\n\n更新1：移動了65%的資金。需要一些時間，因爲我現在使用的是一個低劣的手機\n現在。感謝這麼多的回應。我將在完成後立即向你們更新。\n同時，如果你想出更多的解決方案，我很高興能瞭解到\n它們。\n\n更新2：...",
      "title": "我的手機和我所有的加密貨幣都被盜了"
    }
  ]
}