{
  "author": "xTheKingOfClubs",
  "original_created_utc": 1639578427,
  "title": "Why should student loans be forgiven?",
  "created_utc": 1639588892,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m a college graduate with loans I am repaying and I really don’t understand the argument for this at all.&lt;/p&gt;\n\n&lt;p&gt;When you take out loans for anything, you receive that money with the understanding that you will repay it with interest over however many years. There is no ambiguity to this process and it should be absolutely zero surprise to anyone who takes out a loan when they are expected to repay it.&lt;/p&gt;\n\n&lt;p&gt;So, why do we have a society of people who are now acting so shocked and stunned that they have to repay the money they are contractually obligated to repay? Further, why are so many people acting entitled to &lt;em&gt;not&lt;/em&gt; paying this money back as if they did not sign a voluntary contract agreeing to do so?&lt;/p&gt;\n\n&lt;p&gt;I understand how getting rid of this debt can free up people to stimulate the economy in other ways, but what sort of precedent does this set? You can just borrow without any responsibility whatsoever and the government will come save you? And people who study at universities within their financial means get screwed?&lt;/p&gt;\n\n&lt;p&gt;Every argument I’ve ever seen in favor of this boils down to “I made a bad decision with money and I should just not have to face the consequences of my choice.”&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/rh0ame/why_should_student_loans_be_forgiven/",
  "subreddit": "TooAfraidToAsk",
  "id": "rh0ame",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m a college graduate with loans I am repaying and I really don’t understand\nthe argument for this at all.\n\nWhen you take out loans for anything, you receive that money with the\nunderstanding that you will repay it with interest over however many years.\nThere is no ambiguity to this process and it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は大卒でローンを返済しているのですが、本当に理解不能です。\nという論調は全くありません。\n\n何かのためにローンを組むとき、そのお金を受け取るのは\n何年かかけて利息をつけて返済していくことを理解することです。\nこのプロセスに曖昧さはなく、それは...",
      "title": "なぜ学生ローンは免除されるべきなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个大学毕业生，我正在偿还贷款，我真的不明白\n这方面的论点。\n\n当你为任何事情贷款时，你收到这笔钱的时候\n当你为任何事情贷款时，你收到这笔钱，并理解你将在多少年内连本带利地偿还它。\n这个过程没有任何含糊之处，而且...",
      "title": "为什么要免除学生贷款？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個大學畢業生，我正在償還貸款，我真的不明白\n這方面的論點。\n\n當你爲任何事情貸款時，你收到這筆錢的時候\n當你爲任何事情貸款時，你收到這筆錢，並理解你將在多少年內連本帶利地償還它。\n這個過程沒有任何含糊之處，而且...",
      "title": "爲什麼要免除學生貸款？"
    }
  ]
}