{
  "author": "CaptainBusketTTV",
  "the_new_excerpt": "My understanding is that for an object to be in orbit it must travel faster the\ncloser it is to the surface.\n\nPerhaps the Earth's rotations is too slow for something to travel the same speed\nand remain in orbit.\n\nBut I was curious to know if there was a point in Earth's orbit where you could\nplant a…",
  "original_created_utc": 1622880618,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の理解では、物体が軌道上にあるためには、地表に近ければ近いほど速く移動しなければなりません。\n地表に近いほど速く移動しなければなりません。\n\n地球の自転が遅すぎて、同じ速度で移動しても軌道上に留まることができないのかもしれません。\n軌道上に留まるには、地球の回転が遅すぎるのかもしれません。\n\nしかし、私は地球の軌道上に、ある地点があるかどうか知りたいと思いました。\n植えられる場所があるのかどうか...",
      "title": "地上とほぼ同じ速度で移動できる軌道上の距離はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的理解是，一个物体要在轨道上运行，它的速度必须越快\n它离表面更近。\n\n也许地球的自转速度太慢，以至于有些东西无法以同样的速度飞行\n并保持在轨道上。\n\n但我很想知道，在地球的轨道上是否有一个点，你可以\n植入一个...",
      "title": "是否有一个轨道距离可以让一个物体以*精确的*与地面相同的速度移动？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的理解是，一個物體要在軌道上運行，它的速度必須越快\n它離表面更近。\n\n也許地球的自轉速度太慢，以至於有些東西無法以同樣的速度飛行\n並保持在軌道上。\n\n但我很想知道，在地球的軌道上是否有一個點，你可以\n植入一個...",
      "title": "是否有一個軌道距離可以讓一個物體以*精確的*與地面相同的速度移動？"
    }
  ],
  "title": "Is there an orbital distance that would allow an object to move at *precisely* the same speed as the ground?",
  "created_utc": 1622902549,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My understanding is that for an object to be in orbit it must travel faster the closer it is to the surface. </p>\n\n<p>Perhaps the Earth&#39;s rotations is too slow for something to travel the same speed <em>and</em> remain in orbit. </p>\n\n<p>But I was curious to know if there was a point in Earth&#39;s orbit where you could plant a big anchor or something and it would basically follow the Earth&#39;s rotation.</p>\n</div><!-- SC_ON -->",
  "score": 317,
  "permalink": "/r/askscience/comments/nsqumo/is_there_an_orbital_distance_that_would_allow_an/",
  "subreddit": "askscience",
  "id": "nsqumo",
  "is_self": true,
  "media": null,
  "is_video": false
}