{
  "author": "DerpJungler",
  "original_created_utc": 1638604135,
  "title": "The smartest people here will NOT give you any advice now.",
  "created_utc": 1638641949,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Because they know how this story goes. They&amp;#39;ve seen it before. &lt;/p&gt;\n\n&lt;p&gt;Instead, they will close their apps, the exchanges, they will close the charts, the news sites, reddit discussions, facebook memes. &lt;/p&gt;\n\n&lt;p&gt;This is not a sign to panic and sell, or buy the dip if you&amp;#39;re out of extra money.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a sign to take a break. Spend some time with family, friends, dogs, cats, the rest of your hobbys.&lt;/p&gt;\n\n&lt;p&gt;It gets hectic and scary when you see your gains disappear overnight, but if you weren&amp;#39;t planning to sell today, then why are you worried?&lt;/p&gt;\n\n&lt;p&gt;Take a break. Come back in a few days. &lt;/p&gt;\n\n&lt;p&gt;And yes, this is actually my advice.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 429,
  "permalink": "/r/CryptoCurrency/comments/r8knt9/the_smartest_people_here_will_not_give_you_any/",
  "subreddit": "CryptoCurrency",
  "id": "r8knt9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Because they know how this story goes. They've seen it before.\n\nInstead, they will close their apps, the exchanges, they will close the charts,\nthe news sites, reddit discussions, facebook memes.\n\nThis is not a sign to panic and sell, or buy the dip if you're out of extra\nmoney.\n\nIt's a sign to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜなら、彼らはこの話の流れを知っているからです。以前にも見たことがあるからです\n\n代わりにアプリを閉じたり 取引所を閉じたり チャートを閉じたりするのです\nニュースサイト、Redditの議論、Facebookのミーム。\n\nこれは、パニックになって売ったり、余分なものがなければ急落を買ったりするサインではありません。\nお金です。\n\nそれは...",
      "title": "ここにいる賢い人たちは、今のあなたに何のアドバイスもしてくれません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因为他们知道这个故事是如何进行的。他们以前见过它。\n\n相反，他们将关闭他们的应用程序，交易所，他们将关闭图表。\n新闻网站、Reddit讨论、Facebook备忘录。\n\n这不是一个恐慌和卖出的信号，如果你没有多余的钱，也可以买入跌停板。\n钱。\n\n这是一个信号，以...",
      "title": "这里最聪明的人现在不会给你任何建议。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因爲他們知道這個故事是如何進行的。他們以前見過它。\n\n相反，他們將關閉他們的應用程序，交易所，他們將關閉圖表。\n新聞網站、Reddit討論、Facebook備忘錄。\n\n這不是一個恐慌和賣出的信號，如果你沒有多餘的錢，也可以買入跌停板。\n錢。\n\n這是一個信號，以...",
      "title": "這裏最聰明的人現在不會給你任何建議。"
    }
  ]
}