{
  "author": "Kenziemaee",
  "original_created_utc": 1632131814,
  "title": "Why is walking at night considered so abnormal?",
  "created_utc": 1632160262,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m someone who does it on a regular basis and I&#39;ve had more than a few people act like I have three heads if it comes up. But the ultimate icing on the cake came a little while ago. A family member who works in the Er asked if I&#39;d been walking that night. Turns out I&#39;d walked by a sorority near the university in my city. Totally unintentional and didnt even know it. But they called the police saying a suspicious male was peering in the windows and my family member had heard it on the scanner. Nevermind the outright lie, why does someone walking by cause such a problem? Keep in mind I&#39;m pale as death so it&#39;s not a race issue.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/prrmtn/why_is_walking_at_night_considered_so_abnormal/",
  "subreddit": "TooAfraidToAsk",
  "id": "prrmtn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm someone who does it on a regular basis and I've had more than a few people\nact like I have three heads if it comes up. But the ultimate icing on the cake\ncame a little while ago. A family member who works in the Er asked if I'd been\nwalking that night. Turns out I'd walked by a sorority near the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は普段からやっている人間ですが、少なからず人に\nこの話題になると、私の頭が3つあるような態度をとる人が何人もいました。しかし、究極のケーキの上のアイシングは\n少し前のことです。家族の一人がErの仕事をしていて、「あの夜、歩いていたの？\nと聞かれた。結局、私はその近くにある女子学生クラブの前を歩いていたのです。",
      "title": "夜間の歩行はなぜ異常とされるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个经常这样做的人，我已经有了不止几个人\n如果出现这种情况，我就会表现得像有三个脑袋。但最终的锦上添花\n是在不久前。一个在二部工作的家庭成员问我是否已经\n那晚是否在散步。结果发现我走过了附近的一个联谊会。",
      "title": "为什么夜间行走被认为如此不正常？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個經常這樣做的人，我已經有了不止幾個人\n如果出現這種情況，我就會表現得像有三個腦袋。但最終的錦上添花\n是在不久前。一個在二部工作的家庭成員問我是否已經\n那晚是否在散步。結果發現我走過了附近的一個聯誼會。",
      "title": "爲什麼夜間行走被認爲如此不正常？"
    }
  ]
}