{
  "author": "Dark-Pukicho",
  "the_new_excerpt": "I brought this up during dinner two weeks ago and it’s been tearing my family\napart. My mother thinks you can only fit a couple thousand, my father thinks\nbillions, my siblings think trillions and I think maybe a few million at the\nmost, couple hundred thousand at the least. It’s sparked so much…",
  "original_created_utc": 1622510571,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2週間前の夕食時にこの話をしたら、家族がバラバラになってしまいました。\nしています。母は数千個しか入らないと思っていますが、父は数十億個と思っています。\n父は数十億、兄妹は数兆、私はせいぜい数百万、少なくても数十万だと思っています。\n私はせいぜい数百万、少なくても数十万だと思っています。それが多くの人を巻き込んで...。",
      "title": "私にとって本当に重要なことは、家族がバラバラになってしまうことです。レクサスGXには何匹のハチが乗れる？神に誓って、これは冗談ではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "两周前我在晚餐时提出了这个问题，它一直在撕裂我的家庭\n分裂。我母亲认为你只能容纳几千人，我父亲认为是几十亿，我的兄弟姐妹认为是几万亿，我认为是几百万。\n几十亿，我的兄弟姐妹认为是几万亿，而我认为最多可能是几百万，至少是几十万。\n最多几百万，至少几十万。它引发了这么多...",
      "title": "对我来说真的很重要，它正在撕裂我的家庭。一辆雷克萨斯GX能装下多少只蜜蜂？我向上帝发誓这不是一个玩笑。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "兩週前我在晚餐時提出了這個問題，它一直在撕裂我的家庭\n分裂。我母親認爲你只能容納幾千人，我父親認爲是幾十億，我的兄弟姐妹認爲是幾萬億，我認爲是幾百萬。\n幾十億，我的兄弟姐妹認爲是幾萬億，而我認爲最多可能是幾百萬，至少是幾十萬。\n最多幾百萬，至少幾十萬。它引發了這麼多...",
      "title": "對我來說真的很重要，它正在撕裂我的家庭。一輛雷克薩斯GX能裝下多少隻蜜蜂？我向上帝發誓這不是一個玩笑。"
    }
  ],
  "title": "Really important for me, it’s tearing my family apart. How many bees can fit in a Lexus GX? I swear to god this isn’t a joke.",
  "created_utc": 1622529218,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I brought this up during dinner two weeks ago and it’s been tearing my family apart. My mother thinks you can only fit a couple thousand, my father thinks billions, my siblings think trillions and I think maybe a few million at the most, couple hundred thousand at the least. It’s sparked so much tension in my house nearly two fights have broken out since, and at least one screaming match between my sister and brother. I would really like a definitive answer, so if you can provide one please do so. Thanks.</p>\n</div><!-- SC_ON -->",
  "score": 244,
  "permalink": "/r/NoStupidQuestions/comments/npie2j/really_important_for_me_its_tearing_my_family/",
  "subreddit": "NoStupidQuestions",
  "id": "npie2j",
  "is_self": true,
  "media": null,
  "is_video": false
}