{
  "author": "LiliMaz",
  "original_created_utc": 1624803697,
  "title": "How do they know that the skull found in Harbin (AKA Dragon Man) belonged to a male and not a female?",
  "created_utc": 1624819918,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was just reading an article about it, and there was a drawing of a male <em>Homo longi,</em> and I thought, why couldn&#39;t it be a female? Is there a scientific way of knowing that from the skull, considering that their characteristics differ from <em>H.Sapiens?</em></p>\n\n<p>I then googled, &quot;archaic human&quot; and saw mostly male represented, which led me to a second question, do we have any evidence-based estimates of the female-male ratio on those populations?</p>\n</div><!-- SC_ON -->",
  "score": 145,
  "permalink": "/r/askscience/comments/o8y04s/how_do_they_know_that_the_skull_found_in_harbin/",
  "subreddit": "askscience",
  "id": "o8y04s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was just reading an article about it, and there was a drawing of a male Homo\nlongi, and I thought, why couldn't it be a female? Is there a scientific way of\nknowing that from the skull, considering that their characteristics differ from\nH.Sapiens?\n\nI then googled, \"archaic human\" and saw mostly…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちょうどその記事を読んでいたら、ホモ・ロンギのオスの絵がありました。\nlongiの男性の絵があり、なぜ女性ではないのかと思いました。科学的に知る方法はあるのでしょうか？\n頭蓋骨からそれを知るための科学的な方法はあるのでしょうか、彼らの特徴がH.Sapiensと異なることを考えると。\nホモ・サピエンスとは異なる特徴を持つ彼らを、頭蓋骨から科学的に知る方法はあるのだろうか？\n\nその後、「古人類」でググってみると、ほとんどが...。",
      "title": "ハルビンで発見された頭蓋骨（別名：ドラゴンマン）が女性ではなく男性のものであると、どうしてわかったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚读了一篇关于它的文章，其中有一张男性智人的画像。\n我想，为什么它不能是女性？是否有一种科学的方法\n考虑到他们的特征与智人不同，是否有科学的方法从头骨上知道这一点？\n智人？\n\n然后我在网上搜索，\"古人类\"，看到的大多是...",
      "title": "他们怎么知道在哈尔滨发现的头骨（又名龙人）属于男性而不是女性？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛讀了一篇關於它的文章，其中有一張男性智人的畫像。\n我想，爲什麼它不能是女性？是否有一種科學的方法\n考慮到他們的特徵與智人不同，是否有科學的方法從頭骨上知道這一點？\n智人？\n\n然後我在網上搜索，\"古人類\"，看到的大多是...",
      "title": "他們怎麼知道在哈爾濱發現的頭骨（又名龍人）屬於男性而不是女性？"
    }
  ]
}