{
  "author": "graph_marine",
  "original_created_utc": 1629605029,
  "title": "For those of you who weren't here during the bear market, Cardano dumped from above $1 to $0.03 and no one talked about it because they had delivered nothing but empty promises for 3 years despite intense marketing and hundreds of millions of dollars in funding. Do you really think anything changed?",
  "created_utc": 1629610239,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The main focus throughout the bear market was the development of the Ethereum ecosystem. That is why the most popular dApps are all currently comfortably situated on the Ethereum main network. Yes, Ethereum&#39;s price dumped during the bear market as well, but the OGs in the space and all of the developers kept their eyes laser focused on the development happening within the Ethereum ecosystem.</p>\n\n<p>I personally believe there are several solid alternatives to Ethereum (Polygon, Avalanche, Solana), but unless such networks have built a bridge to Ethereum, they likely will not survive. That is why all of the chains I mentioned were forced to develop bridges to Ethereum because no developer in their right mind would leave the Ethereum ecosystem for a risky sidechain or other layer 1 network. I do not think Cardano will be any different, but this is just my opinion.</p>\n\n<p>Unless someone can tell me otherwise, I am not aware of any actively used dApp that has committed to migrating from other chains to Cardano. Unless you see the likes of Uniswap, Aave, Compound, MakerDAO, Synthetix, USDC, and Yearn talk about migrating to Cardano, there really isn&#39;t anything to talk about with regard to &quot;Cardano killing Ethereum&quot;. Hint: they&#39;ll never migrate.</p>\n\n<p>I&#39;m posting this because I&#39;m getting sick of the manic Cardano threads where bagholders are desperately trying to get others to buy so the price goes higher and they can sell. Yes, they are scheduled to release smart contracts soon, but the biggest question remains, <strong><em>who is going to use their platform</em></strong>? I have seen extraordinarily innovative developments being made on Ethereum, Polygon, Avalanche, Solana, and those did not happen overnight and it&#39;s hard to imagine people just packing up their bags and leaving to work on Cardano.</p>\n\n<p>To all of the people about to yell at me for making another &quot;Cardano is overhyped post&quot; I want you to take a good hard look at yourself in the mirror: have you ever actually <em>used</em> Ethereum? Polygon?Avalanche? Solana? Have you ever actually <em>used</em> a decentralized exchange, lending protocol, NFT marketplace/game, or provided liquidity to these networks? I have. I&#39;ve done all of it. So do you really have the perspective to be arguing about &quot;Ethereum killers&quot; and how &quot;great&quot; Cardano will be when you don&#39;t even have experience with engaging and interacting with smart contracts?</p>\n\n<p>Where is all of your hype really coming from, the echo chambers on Twitter and Reddit? I&#39;m asking because I fell for the same &quot;academic scientific approach&quot; marketing in 2017 and it&#39;s just the same cycle over and over again - Cardano is great at making money during bull markets, but not very good at delivering promised products, but I really hope I&#39;m wrong this time.</p>\n\n<p>!remindme 8 months</p>\n\n<p>EDIT: Maybe some users in the comment section can look at one another and realize that there is not a single rebuttal to my technical points. Every post is about price action. Will Cardano potentially make you some money this bull run? Sure, that is, if you aren&#39;t stuck holding bags while everyone sells the top. But please, let&#39;s stay on topic. Present some counterarguments related to the actual utility of the network.</p>\n\n<p>EDIT 2: People should be aware that there was very similar hype surrounding Cardano leading up to the Coinbase <a href=\"https://blog.coinbase.com/cardano-ada-is-launching-on-coinbase-pro-694b1cb8c778?gi=2495f7011d1c\">listing date</a> (March 16-18), and the hype pump peaked at 1.38 (ATH at the time) on March 17, dumped to 1.24 (-10%) by March 18, and continued to dump to 1.06 (-25%) by March 24. Sure, it kept going up, and we may see a similar &quot;pump, dump, pump&quot; related to the smart contract release, but the &quot;pump&quot; following the &quot;dump&quot; all depends on execution and whether people actually care to use Cardano&#39;s platform.</p>\n\n<p>EDIT 3: Thanks to a great comment by <a href=\"/u/BornToBeHwild\">u/BornToBeHwild</a>, I learned that Cardano is already developing and supporting an Ethereum bridge (<a href=\"https://iohk.io/en/blog/posts/2021/05/17/bringing-erc20-to-cardano/\">https://iohk.io/en/blog/posts/2021/05/17/bringing-erc20-to-cardano/</a>), which proves my point entirely - Cardano won&#39;t &quot;kill everything in this space&quot;, they are already building measures to integrate with the existing ecosystem and adapt, so maybe it&#39;s time to stop saying it will end all of the progress that has already been made in decentralized finance and media and take over the world.</p>\n\n<p>EDIT 4: I realize that my post is very triggering and I will edit the language a bit to emphasize the points I&#39;m trying to make and remove some of the more triggering elements. Sometimes you forget in all of the mania that people have money at stake and I by no means am trying to &quot;FUD&quot; Cardano. I have friends and family who own this coin and I actually like Charles as he introduced me to a lot of the concepts I learned about in this space through his videos and lectures. I hope Cardano succeeds.</p>\n\n<p>The point of my post was that people need to understand there already a ton of great, functioning products out there that all promised similar &quot;Ethereum killing&quot; capabilities that ultimately had to adapt and integrate with Ethereum in order to remain relevant and I do not think Cardano will be any different (see EDIT 3). Just trying to set expectations, especially for newcomers who are probably feeling FOMO for Cardano and are tempted to buy it while it&#39;s up x2 it&#39;s 2017 ATH and at the peak of its bull run. I&#39;m not saying it won&#39;t go higher, but I do think the mania can be harmful for people who are just getting into the space now.</p>\n\n<p>EDIT 5: I want to bring attention to a <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/p95p41/for_those_of_you_who_werent_here_during_the_bear/h9vgije?utm_source=share&amp;utm_medium=web2x&amp;context=3\">comment</a> in this thread made by <a href=\"/u/Bwahehe\">u/Bwahehe</a>, which is not getting enough upvotes and perfectly articulates the point I am getting across:</p>\n\n<blockquote>\n<p>ETH is like Manhattan. Horribly crowded with insane traffic, but they&#39;re doing a ton of business.  </p>\n\n<p>Cardano is like someone selling a potentially lucrative spot of land but absolutely no businesses are there yet. They promise that they&#39;ll finish the roads in a month or two but they&#39;ll be some damn amazing and scientifically proven roads.  </p>\n\n<p>Most up and coming smart contract coins promise massive highways and roads but nobody knows if the roads and bridges are really safe to drive on and only hydrogen powered vehicles approved by them are allowed on the roads.</p>\n</blockquote>\n\n<p>EDIT 6: I&#39;m trying to respond to everyone but this is exploding... Also, I keep getting accused of &quot;missing&quot; Cardano or &quot;buying it high&quot; or something. Guys, look at my username. <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/owryqy/why_the_graph_grt_also_known_as_the_google_of/\">I&#39;m all about The Graph</a> (GRT).</p>\n</div><!-- SC_ON -->",
  "score": 252,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/RyQGD-Egpz3yej7a4LdoQIcKhoeIuIH-4zWCk2ep_98.jpg?auto=webp&s=477d26869e75ae49bbb495c8afe02cf52b551ac0",
          "width": 1200,
          "height": 774
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/RyQGD-Egpz3yej7a4LdoQIcKhoeIuIH-4zWCk2ep_98.jpg?width=108&crop=smart&auto=webp&s=ef087d22c17a32b2dd1f518503d98bbf5d2e825c",
            "width": 108,
            "height": 69
          },
          {
            "url": "https://external-preview.redd.it/RyQGD-Egpz3yej7a4LdoQIcKhoeIuIH-4zWCk2ep_98.jpg?width=216&crop=smart&auto=webp&s=4cd64f8cf511ba05a7066d8fed4cae1fda510275",
            "width": 216,
            "height": 139
          },
          {
            "url": "https://external-preview.redd.it/RyQGD-Egpz3yej7a4LdoQIcKhoeIuIH-4zWCk2ep_98.jpg?width=320&crop=smart&auto=webp&s=b5ecb5f60558ecadaae5c34b041a8a1acd56170c",
            "width": 320,
            "height": 206
          },
          {
            "url": "https://external-preview.redd.it/RyQGD-Egpz3yej7a4LdoQIcKhoeIuIH-4zWCk2ep_98.jpg?width=640&crop=smart&auto=webp&s=e11a9f2940fd5548e6abf26f91ef4e808cca693a",
            "width": 640,
            "height": 412
          },
          {
            "url": "https://external-preview.redd.it/RyQGD-Egpz3yej7a4LdoQIcKhoeIuIH-4zWCk2ep_98.jpg?width=960&crop=smart&auto=webp&s=3f48f2c4756b088884ab3ada5ae3e545daf4cafc",
            "width": 960,
            "height": 619
          },
          {
            "url": "https://external-preview.redd.it/RyQGD-Egpz3yej7a4LdoQIcKhoeIuIH-4zWCk2ep_98.jpg?width=1080&crop=smart&auto=webp&s=b6cdcf46f469fdffe95a013d86b0b70630732fc5",
            "width": 1080,
            "height": 696
          }
        ],
        "variants": {},
        "id": "185I9m6e85w6mfzBCOVAMpCy8FAjQTrsbqUyCYnEFnY"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/p95p41/for_those_of_you_who_werent_here_during_the_bear/",
  "subreddit": "CryptoCurrency",
  "id": "p95p41",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The main focus throughout the bear market was the development of the Ethereum\necosystem. That is why the most popular dApps are all currently comfortably\nsituated on the Ethereum main network. Yes, Ethereum's price dumped during the\nbear market as well, but the OGs in the space and all of the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "弱気な市場の中で最も注目されたのは、イーサリアムの開発でした。\nのエコシステムです。そのため、最も人気のあるdAppsは、現在すべて快適な\nイーサリアムのメインネットワークに位置しています。確かにEthereumの価格は弱気相場の中で暴落しました。\nしかし、EthereumのOGやすべての...",
      "title": "弱気市場の時にここにいなかった人のために説明すると、カルダノは1ドル以上から0.03ドルまで暴落し、誰もそのことを話題にしませんでした。なぜなら、彼らは強烈なマーケティングと何億ドルもの資金提供にもかかわらず、3年間にわたって空約束しか提供しなかったからです。あなたは本当に何かが変わったと思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "整个熊市的主要焦点是以太坊的发展\n生态系统。这就是为什么目前最流行的dApps都是舒适的\n位于以太坊的主网络上。是的，以太坊的价格在熊市期间也出现了下跌。\n是的，以太坊的价格在熊市期间也出现了下跌，但该领域的OG们和所有的...",
      "title": "对于那些在熊市期间不在这里的人来说，Cardano从1美元以上跌到了0.03美元，没有人谈论它，因为他们在3年里除了空洞的承诺之外什么都没有兑现，尽管他们进行了大量的营销和数亿美元的融资。你真的认为有什么变化吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "整個熊市的主要焦點是以太坊的發展\n生態系統。這就是爲什麼目前最流行的dApps都是舒適的\n位於以太坊的主網絡上。是的，以太坊的價格在熊市期間也出現了下跌。\n是的，以太坊的價格在熊市期間也出現了下跌，但該領域的OG們和所有的...",
      "title": "對於那些在熊市期間不在這裏的人來說，Cardano從1美元以上跌到了0.03美元，沒有人談論它，因爲他們在3年裏除了空洞的承諾之外什麼都沒有兌現，儘管他們進行了大量的營銷和數億美元的融資。你真的認爲有什麼變化嗎？"
    }
  ]
}