{
  "author": "Arcendus",
  "original_created_utc": 1633541848,
  "title": "Coinbase Debit Card Denied by Business Owner",
  "created_utc": 1633555883,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Has anyone else encountered this?</p>\n\n<p>I stopped in to a local record store the other day, found a few picks, and at checkout presented my Coinbase Debit Card. Guy at the register looks at it for a moment and hands it back saying he can&#39;t accept this form of payment. I explain it&#39;s just a debit card, and if he runs it it&#39;ll be charged just like any other debit card, but he insists on not accepting it. In an extremely rare turn of events I decide to be a bit assertive (really wanted that XLM I guess) and ask if a manager is available so I can explain, and he replied that he owns the place so it&#39;s his call. I ended up using another form of payment only because one of my picks was rare and severely underpriced, but left wondering why any business owner would turn it down.</p>\n\n<p>Anyone know if there was a legit reason, or was this guy just not accepting it on &quot;principle&quot; or something?</p>\n\n<p>EDIT: I did point out the Visa logo, but he just kind of waved it off like it wasn&#39;t sufficient and repeated that I&#39;d have to use something else (a different Visa lol).</p>\n\n<p>EDIT 2: This happened in the U.S.</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/q2peba/coinbase_debit_card_denied_by_business_owner/",
  "subreddit": "CryptoCurrency",
  "id": "q2peba",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Has anyone else encountered this?\n\nI stopped in to a local record store the other day, found a few picks, and at\ncheckout presented my Coinbase Debit Card. Guy at the register looks at it for a\nmoment and hands it back saying he can't accept this form of payment. I explain\nit's just a debit card,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このようなことに遭遇した方はいらっしゃいますか？\n\n先日、地元のレコード店に立ち寄り、いくつかのピックを見つけ、会計時にCoinbase Debit Cardを提示しました。\nお会計の時にCoinbaseデビットカードを提示しました。レジのおじさんはしばらくそれを見て\nこの支払い方法は受け付けられません」と言ってカードを返してきました。私は次のように説明しました。\nただのデビットカードですから...。",
      "title": "コインベースのデビットカード、ビジネスオーナーに拒否される"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "还有人遇到过这种情况吗？\n\n前几天我去了一家当地的唱片店，找到了一些精选的唱片，然后在\n结账时出示了我的Coinbase借记卡。收银台的人看了一会儿\n他说他不接受这种付款方式。我解释说\n这只是一张借记卡，...",
      "title": "Coinbase借记卡被企业主拒收"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "還有人遇到過這種情況嗎？\n\n前幾天我去了一家當地的唱片店，找到了一些精選的唱片，然後在\n結賬時出示了我的Coinbase借記卡。收銀臺的人看了一會兒\n他說他不接受這種付款方式。我解釋說\n這只是一張借記卡，...",
      "title": "Coinbase借記卡被企業主拒收"
    }
  ]
}