{
  "author": "macaroninapot",
  "original_created_utc": 1636380239,
  "title": "Is it that weird that my brother and I snuggle?",
  "created_utc": 1636386578,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Basically the title. My brother (23m) and I (23f) are twins. We live together, too, so we spend a lot of time together (we both go to grad schools in the same city). </p>\n\n<p>Anyway, sometimes we cuddle while hanging out, talking (like if one of us is sad about something, etc.) or watching tv. It’s not a secret, and my new boyfriend thinks it’s “extremely weird” to be that close with a sibling. He’s “uncomfortable” with it. I think it’s gross that my BF is acting jealous of my relationship with my brother. However, we’ve spoken to some friends and gotten mixed reactions ranging from “wtf” to “must be a twin thing” to “doesn’t seem that weird”.</p>\n\n<p>So, I want the opinion of unbiased strangers. Is it that weird that we cuddle?</p>\n\n<p>Edit: I’ve been told in PMs to include the following. We don’t generally “spoon” unless we fall asleep cuddling and happen to wake up that way. Our other brothers never mentioned it being weird growing up. Our parents were taken out of the picture when we were very young so we never had their input on the subject either way; the person who raised us never said anything, though.</p>\n\n<p>Edit 2: a word for privacy</p>\n\n<p>Edit 3: yes, we are American</p>\n</div><!-- SC_ON -->",
  "score": 174,
  "permalink": "/r/TooAfraidToAsk/comments/qpeahz/is_it_that_weird_that_my_brother_and_i_snuggle/",
  "subreddit": "TooAfraidToAsk",
  "id": "qpeahz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Basically the title. My brother (23m) and I (23f) are twins. We live together,\ntoo, so we spend a lot of time together (we both go to grad schools in the same\ncity).\n\nAnyway, sometimes we cuddle while hanging out, talking (like if one of us is sad\nabout something, etc.) or watching tv. It’s not a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "基本的にはタイトル通りです。弟(23m)と私(23f)は双子です。一緒に住んでいます。\n一緒に住んでいるので、一緒にいる時間が多いです（二人とも同じ街の大学院に通っています）。\n共に同じ都市の大学院に通っています）。\n\nとにかく、一緒にいて、話をしたり（どちらかが何か悲しいことがあったときなど）、映画を見たりしているときに抱き合うことがあります。\n話したり、テレビを見たりしながら抱き合うこともあります。それは...",
      "title": "弟と私が寄り添うのはそんなに変なことなの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "基本上就是这个题目。我哥哥（23岁）和我（23岁）是一对双胞胎。我们住在一起。\n我们也住在一起，所以我们花了很多时间在一起（我们都在同一个城市的研究生院上学）。\n城市的研究生院）。\n\n总之，有时我们会在闲逛时抱在一起，聊天（比如我们中的一个人对某些事情感到悲伤，等等）或看电视。\n的事情，等等）或看电视。这不是一个...",
      "title": "我哥哥和我依偎在一起有那么奇怪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "基本上就是這個題目。我哥哥（23歲）和我（23歲）是一對雙胞胎。我們住在一起。\n我們也住在一起，所以我們花了很多時間在一起（我們都在同一個城市的研究生院上學）。\n城市的研究生院）。\n\n總之，有時我們會在閒逛時抱在一起，聊天（比如我們中的一個人對某些事情感到悲傷，等等）或看電視。\n的事情，等等）或看電視。這不是一個...",
      "title": "我哥哥和我依偎在一起有那麼奇怪嗎？"
    }
  ]
}