{
  "author": "PartTimeAnalyst",
  "original_created_utc": 1635302970,
  "title": "What have you learned by owning Crypto over the months/years in one sentence?",
  "created_utc": 1635331082,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Investing in cryptocurrency has undoubtedly been incredibly volatile, as many of you are aware. During May, everyone thought we were on the verge of a Crypto winter, and the sentiment was pessimistic across the board.</p>\n\n<p>However, I feel that many of us in the community remained strong and were able to maintain a dollar cost average over this time period in 2021. However, there were many more big drops for those who held on after 2013.</p>\n\n<p>What have you truly learned from holding your crypto over the months/years, in one line, to those new and OG members in this community?</p>\n\n<p>&quot;Buy when others are fearful, sell when others are greedy&quot; I&#39;ll say first, in one sentence.</p>\n\n<p>What are your thoughts on this? I&#39;m curious to know what this community thinks.</p>\n</div><!-- SC_ON -->",
  "score": 268,
  "permalink": "/r/CryptoCurrency/comments/qgmt5a/what_have_you_learned_by_owning_crypto_over_the/",
  "subreddit": "CryptoCurrency",
  "id": "qgmt5a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Investing in cryptocurrency has undoubtedly been incredibly volatile, as many of\nyou are aware. During May, everyone thought we were on the verge of a Crypto\nwinter, and the sentiment was pessimistic across the board.\n\nHowever, I feel that many of us in the community remained strong and were able\nto…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号通貨への投資は、間違いなく信じられないほどの変動があり、多くの人が\nご存知のとおりです。5月には、誰もが「暗号の冬」の到来を予感していました。\n5月には、誰もがCryptoの冬がやってくると考え、全体的に悲観的な感情を抱いていました。\n\nしかし、私たちコミュニティの多くは強い気持ちを持ち続け、それを実現することができたと感じています。\nしました。",
      "title": "数ヶ月、数年に渡ってCryptoを所有することで学んだことを一言で言うと？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "投资加密货币无疑是令人难以置信的波动，正如你们中的许多人所知。\n你们都知道。在5月份，每个人都认为我们正处于加密货币冬天的边缘。\n冬天，而且整个行业的情绪是悲观的。\n\n然而，我觉得我们社区的许多人仍然很坚强，能够\n顺利完成。",
      "title": "在几个月/几年的时间里，你通过拥有加密货币学到了什么，用一句话来概括？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "投資加密貨幣無疑是令人難以置信的波動，正如你們中的許多人所知。\n你們都知道。在5月份，每個人都認爲我們正處於加密貨幣冬天的邊緣。\n冬天，而且整個行業的情緒是悲觀的。\n\n然而，我覺得我們社區的許多人仍然很堅強，能夠\n順利完成。",
      "title": "在幾個月/幾年的時間裏，你通過擁有加密貨幣學到了什麼，用一句話來概括？"
    }
  ]
}