{
  "author": "cplm1948",
  "original_created_utc": 1643815201,
  "title": "Were Many Native American Tribes Really as Genderfluid as We Say They Were?",
  "created_utc": 1643821734,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello!&lt;/p&gt;\n\n&lt;p&gt;Recently, I’ve been hearing a lot of reference to “two spirit” people as a general term for genderfluid individuals in the native community historically. However, as a historian, I’ve found myself questioning a lot of the discourse on the topic for multiple reasons&lt;/p&gt;\n\n&lt;p&gt;1.) Many activists speak about the topic generalizing across all native Americans.&lt;/p&gt;\n\n&lt;p&gt;2.) I have a feeling we are using very modern “western” ideas of gender and sex and applying them to what may have been completely different concepts to some specific tribes/nations.&lt;/p&gt;\n\n&lt;p&gt;3.) I also have seen very little sourced material on the subject and to me it seems more like people who are not actual historians and instead are just modern indigenous and/or non-indigenous activists making generalized claims to help either set a historical precedent for LGBTQ+ people or claiming that indigenous people in the Americas have always been morally correct in the lense of modern western ideals.&lt;/p&gt;\n\n&lt;p&gt;4.) This being a hot topic (indigenous studies and LGBTQ+), I do find many dance around the topic or are not completely honest and truthful.&lt;/p&gt;\n\n&lt;p&gt;As many of you may know, Native American history can be very challenging to study as it can skewed by colonial accounts as well as the limited access of oral traditions. I was wondering if anyone here has any expertise on the topic and could weigh in.&lt;/p&gt;\n\n&lt;p&gt;Thanks!&lt;/p&gt;\n\n&lt;p&gt;P.S.&lt;/p&gt;\n\n&lt;p&gt;I do not mean to offend anyone in any way by asking this question or having misconceptions. LGBTQ+ people do not need historical precedents to validate their existence.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 147,
  "permalink": "/r/AskHistorians/comments/sir6uh/were_many_native_american_tribes_really_as/",
  "subreddit": "AskHistorians",
  "id": "sir6uh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hello!\n\nRecently, I’ve been hearing a lot of reference to “two spirit” people as a\ngeneral term for genderfluid individuals in the native community historically.\nHowever, as a historian, I’ve found myself questioning a lot of the discourse on\nthe topic for multiple reasons\n\n1.) Many activists speak…"
}