{
  "author": "KoalaBJJ96",
  "original_created_utc": 1643713902,
  "title": "How do you feel like you are a certain gender?",
  "created_utc": 1643755797,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This has been a question that has been on my mind for quite some time so I&amp;#39;ll guess I&amp;#39;ll ask it here.&lt;/p&gt;\n\n&lt;p&gt;How does one &amp;quot;feel&amp;quot; as though they are male or female?&lt;/p&gt;\n\n&lt;p&gt;Most humans have a sexual preference - e.g., straight, gay, bi etc. I get that. But that doesn&amp;#39;t necessarily change one&amp;#39;s gender identity afaik. &lt;/p&gt;\n\n&lt;p&gt;Most human also have a preference for one thing over another- e.g., some girls like combat sports, some girls like ballet. I also get and support this. &lt;/p&gt;\n\n&lt;p&gt;However, what I&amp;#39;m confused about is...how does one feel what gender they are? Most humans have organs which determine our biological sex - this part I get - but how do you feel male, female, or something else?&lt;/p&gt;\n\n&lt;p&gt;If someone who was born biologically male likes e.g., hot pink and make up...does that mean they feel like a woman or do they just feel like a person who likes hot pink and make up? Isn&amp;#39;t the fact that people are prescribing specific gender identities to various groups of items something society is trying to progress away from?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/shsj0o/how_do_you_feel_like_you_are_a_certain_gender/",
  "subreddit": "TooAfraidToAsk",
  "id": "shsj0o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This has been a question that has been on my mind for quite some time so I'll\nguess I'll ask it here.\n\nHow does one \"feel\" as though they are male or female?\n\nMost humans have a sexual preference - e.g., straight, gay, bi etc. I get that.\nBut that doesn't necessarily change one's gender identity…"
}