{
  "author": "Frigorifico",
  "original_created_utc": 1639419963,
  "title": "Why did Abu Bakr decide to order the chapters of the Quran by length instead of chronological order?",
  "created_utc": 1639464540,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is one of the first thing you are told when you learn about islam and it has never made much sense to me. Ordering the chapters by chronological order seems like the logical choice since it would make it easy for the reader to understand the &amp;quot;revelation&amp;quot; in the order it was &amp;quot;revealed&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Instead Abu Bakr decided to order the chapters from longest to shortest and I can&amp;#39;t think of a reason why, after all, it&amp;#39;s not like Muhammad said anything about the order of the chapters. Abu Bakr could have ordered them chronologically and no one would have questioned him for it&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/rfme97/why_did_abu_bakr_decide_to_order_the_chapters_of/",
  "subreddit": "AskHistorians",
  "id": "rfme97",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is one of the first thing you are told when you learn about islam and it\nhas never made much sense to me. Ordering the chapters by chronological order\nseems like the logical choice since it would make it easy for the reader to\nunderstand the \"revelation\" in the order it was \"revealed\"\n\nInstead…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、イスラム教について学ぶときに最初に言われることの一つですが、それは\n私はこれまであまり意味を理解していませんでした。各章を時系列に並べるのは\nを理解しやすくなるので、論理的な選択のように思えます。\n啓示」を「啓示」された順に理解する。\n\nその代わり...",
      "title": "なぜアブ・バクルは、コーランの章を年代順ではなく、長さ順に並べることにしたのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当你了解伊斯兰教时，这是你被告知的第一件事之一，但它对我来说从来没有什么意义。\n对我来说从来没有什么意义。按时间顺序排列的各章\n似乎是合乎逻辑的选择，因为这将使读者很容易理解\n按照 \"启示 \"的顺序来理解 \"启示\"。\n\n相反...",
      "title": "为什么艾布-伯克尔决定按长度而不是按时间顺序排列《古兰经》的章节？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當你瞭解伊斯蘭教時，這是你被告知的第一件事之一，但它對我來說從來沒有什麼意義。\n對我來說從來沒有什麼意義。按時間順序排列的各章\n似乎是合乎邏輯的選擇，因爲這將使讀者很容易理解\n按照 \"啓示 \"的順序來理解 \"啓示\"。\n\n相反...",
      "title": "爲什麼艾布-伯克爾決定按長度而不是按時間順序排列《古蘭經》的章節？"
    }
  ]
}