{
  "author": "SeparateHouse5930",
  "original_created_utc": 1649628311,
  "title": "Why do so many guys defend porn use with their life but are so against OF women making money off of it?",
  "created_utc": 1649658020,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This idea just blows my mind that guys are so supportive of their need for porn yet are so against the idea of supporting women who make it. It seems beyond hypocritical to me.&lt;/p&gt;\n\n&lt;p&gt;If somebody else wants to spend money on ethical porn, why are you even mad?&lt;/p&gt;\n\n&lt;p&gt;Edit: I sell content. This is purely based on my experience and does not include “all” men.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/u0sa2k/why_do_so_many_guys_defend_porn_use_with_their/",
  "subreddit": "TooAfraidToAsk",
  "id": "u0sa2k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "This idea just blows my mind that guys are so supportive of their need for porn\nyet are so against the idea of supporting women who make it. It seems beyond\nhypocritical to me.\n\nIf somebody else wants to spend money on ethical porn, why are you even mad?\n\nEdit: I sell content. This is purely based…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この考えには驚かされる。男はポルノを必要とすることを支持する。\nしかし、それを作る女性をサポートするという考えには反対です。それは\n偽善的だと思う。\n\n他の人が倫理的なポルノにお金を使いたいなら、なぜあなたは怒るの？\n\n編集部：私はコンテンツを売っています。これは純粋に...",
      "title": "なんでAV利用は命がけで擁護するくせに、それで金儲けするOF女には大反対する男が多いんだ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个想法让我震惊，男人们如此支持他们对色情的需求\n但却如此反对支持制作色情制品的女性的想法。这似乎超出了\n对我来说是虚伪的。\n\n如果别人想花钱买有道德的色情制品，你为什么还要生气？\n\n编辑：我是卖内容的。这纯粹是基于...",
      "title": "为什么这么多男人用生命为使用色情制品辩护，却如此反对外国女人靠色情制品挣钱？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個想法讓我震驚，男人們如此支持他們對色情的需求\n但卻如此反對支持製作色情製品的女性的想法。這似乎超出了\n對我來說是虛僞的。\n\n如果別人想花錢買有道德的色情製品，你爲什麼還要生氣？\n\n編輯：我是賣內容的。這純粹是基於...",
      "title": "爲什麼這麼多男人用生命爲使用色情製品辯護，卻如此反對外國女人靠色情製品掙錢？"
    }
  ]
}