{
  "author": "thefullmcnulty",
  "original_created_utc": 1649354540,
  "title": "Game over.",
  "created_utc": 1649389901,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have a wealthy friend who has built an online tutorial empire. His sizable business runs on global online payments via legacy rails. We lost regular contact the past year or so but recently we started talking again and bonding over bitcoin. He got spooked by banking and by inflation and has converted 90% of his (significant) fiat wealth to bitcoin. We talk bitcoin a lot now and as a former aeronautical engineer, he gets it. Very interesting to see a guy as successful and intelligent as him make the switch to a bitcoin standard.&lt;/p&gt;\n\n&lt;p&gt;As we talked more about bitcoin, I started bringing up the Lightning Network. He had no idea what it was. I texted him and said: “download Muun wallet, go to lightning.store and buy something with satoshi’s from your Muun wallet.” He texted me 4 minutes later and his text just read: “Game over.”&lt;/p&gt;\n\n&lt;p&gt;This is a man who knows and has used legacy / fiat payment systems to build a multi-million dollar online tutorial business. He is very familiar with what exists and it’s limitations. He immediately understood why Lightning is a game changer from one use. I felt it was an extremely promising moment.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 329,
  "permalink": "/r/Bitcoin/comments/tyity1/game_over/",
  "subreddit": "Bitcoin",
  "id": "tyity1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have a wealthy friend who has built an online tutorial empire. His sizable\nbusiness runs on global online payments via legacy rails. We lost regular\ncontact the past year or so but recently we started talking again and bonding\nover bitcoin. He got spooked by banking and by inflation and has…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の友人で、オンラインチュートリアル帝国を築いた大富豪がいます。彼の大きな\nレガシーレールを使ったグローバルなオンライン決済でビジネスを展開しています。私たちは、定期的\nここ1年ほどは連絡を取っていなかったのですが、最近また話をするようになり、絆が深まりました。\nビットコインをめぐって 彼は銀行とインフレに脅かされ、...",
      "title": "ゲームオーバー。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有一个富有的朋友，他建立了一个在线教程帝国。他的可观的\n他的业务是通过传统的Rail进行全球在线支付。我们在过去一年左右失去了定期联系\n但最近我们又开始交谈，并因比特币而结识。\n谈到了比特币。他被银行业和通货膨胀吓坏了，并且已经...",
      "title": "游戏结束。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一個富有的朋友，他建立了一個在線教程帝國。他的可觀的\n他的業務是通過傳統的Rail進行全球在線支付。我們在過去一年左右失去了定期聯繫\n但最近我們又開始交談，並因比特幣而結識。\n談到了比特幣。他被銀行業和通貨膨脹嚇壞了，並且已經...",
      "title": "遊戲結束。"
    }
  ]
}