{
  "author": "Austin_86",
  "the_new_excerpt": "1950s Americans viewed women as homemakers and primary childcare providers and\nmen as workers with little involvement in such matters. Assume, however, a man’s\nwife dies and leaves him with young children. Do his neighbors, friends, and\nemployer view him as less “manly?” Will his job accommodate…",
  "original_created_utc": 1619352874,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1950年代のアメリカでは、女性は主婦や子供の世話をする存在であり、男性はそのようなことにあまり関与しない労働者であると考えられていました。\n1950年代のアメリカ人は、女性は主婦や育児をする人、男性はそのようなことにあまり関与しない労働者と考えていました。しかし、ある男性の妻が病気で亡くなったとします。\nしかし、ある男性が妻に先立たれ、幼い子供を残して亡くなったとしましょう。近所の人や友人、そして雇用主は、彼を「男らしくない」と見るでしょうか。\n近所の人や友人、雇用主は彼を「男らしくない」と見るでしょうか？彼の仕事は、彼のためになるでしょうか？",
      "title": "1950年代のアメリカ人はシングルダッドをどう見ていたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "20世纪50年代，美国人认为妇女是家庭主妇和主要的儿童保育者，而男子是工人，很少参与这些事务。\n男性作为工人，很少参与这些事务。然而，假设一个男人的\n妻子去世，留下年幼的孩子给他。他的邻居、朋友和雇主会不会认为他没有 \"男人味\"？\n他的邻居、朋友和雇主会不会认为他不太 \"男人\"？他的工作会不会适应...",
      "title": "1950年代的美国人如何看待单亲爸爸？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "20世紀50年代，美國人認爲婦女是家庭主婦和主要的兒童保育者，而男子是工人，很少參與這些事務。\n男性作爲工人，很少參與這些事務。然而，假設一個男人的\n妻子去世，留下年幼的孩子給他。他的鄰居、朋友和僱主會不會認爲他沒有 \"男人味\"？\n他的鄰居、朋友和僱主會不會認爲他不太 \"男人\"？他的工作會不會適應...",
      "title": "1950年代的美國人如何看待單親爸爸？"
    }
  ],
  "title": "How would 1950s Americans view single dads?",
  "created_utc": 1619374640,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>1950s Americans viewed women as homemakers and primary childcare providers and men as workers with little involvement in such matters. Assume, however, a man’s wife dies and leaves him with young children. Do his neighbors, friends, and employer view him as less “manly?” Will his job accommodate this new responsibility, or expect him to “man up?” Does he simply find another woman (sister, mother, etc) to take over the role?</p>\n</div><!-- SC_ON -->",
  "score": 113,
  "permalink": "/r/AskHistorians/comments/my7442/how_would_1950s_americans_view_single_dads/",
  "subreddit": "AskHistorians",
  "id": "my7442",
  "is_self": true,
  "media": null,
  "is_video": false
}