{
  "author": "lukewarm_egg",
  "original_created_utc": 1636168725,
  "title": "why are people still so against weed?",
  "created_utc": 1636178414,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I understand the negative effects and perceptions certain programs and &quot;reefer madness&quot; has caused, however nowadays I don&#39;t see why people don&#39;t mind their own business.</p>\n\n<p>Some people smoke recreationally whereas others smoke as a form of medicine for physical or mental health issues. Either way - why are people so quick to judge those who smoke?</p>\n\n<p>Addiction is an inherently bad thing. I get that. I&#39;m not saying addiction is good in any form - I&#39;m just saying weed should be destigmatized and decriminalized. It&#39;s just a plant.</p>\n\n<p>We&#39;re all just trying to live our lives the best way we can. For some, that involves smoking weed.</p>\n\n<p>Yet every time I see a post on reddit involving weed so many comments are negative. And all I can think is that those people just really need to smoke a joint.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/qnrmnc/why_are_people_still_so_against_weed/",
  "subreddit": "TooAfraidToAsk",
  "id": "qnrmnc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I understand the negative effects and perceptions certain programs and \"reefer\nmadness\" has caused, however nowadays I don't see why people don't mind their\nown business.\n\nSome people smoke recreationally whereas others smoke as a form of medicine for\nphysical or mental health issues. Either way -…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、あるプログラムや「リーファー・マッドネス」がもたらした悪影響や認識を理解しています。\nしかし、最近では、自分のことは自分でやるという人が増えてきています。\n自分のことは自分でやる。\n\n娯楽としてタバコを吸う人もいれば、身体的・精神的な問題を解決するための薬として吸う人もいます。\n娯楽として吸う人もいれば、身体的、精神的な問題のために薬として吸う人もいます。どちらにしても、...",
      "title": "なぜ人々はいまだに大麻に反対なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我理解某些项目和 \"冷藏箱 \"造成的负面影响和看法。\n疯狂 \"所造成的负面影响和看法，但如今我不明白为什么人们不关心自己的事。\n自己的事情。\n\n一些人吸烟是为了娱乐，而另一些人吸烟则是作为一种药物来治疗\n身体或精神健康问题。无论是哪种方式--...",
      "title": "为什么人们仍然如此反对大麻？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我理解某些項目和 \"冷藏箱 \"造成的負面影響和看法。\n瘋狂 \"所造成的負面影響和看法，但如今我不明白爲什麼人們不關心自己的事。\n自己的事情。\n\n一些人吸菸是爲了娛樂，而另一些人吸菸則是作爲一種藥物來治療\n身體或精神健康問題。無論是哪種方式--...",
      "title": "爲什麼人們仍然如此反對大麻？"
    }
  ]
}