{
  "author": "PaulKarlFeyerabend",
  "original_created_utc": 1660483565,
  "title": "Why is there so little conversation about radical Islam on Reddit?",
  "created_utc": 1660491050,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Earlier this week, Salman Rushdie was attacked while on stage and preparing to deliver a speech. His attacker is said to be a Muslim with sympathies to those who declared a fatwa on Rushdie, following his allegedly blasphemous publication of The Satanic Verses.&lt;/p&gt;\n\n&lt;p&gt;The incident triggered shockwaves across the literary community and wider world, with fears that it will further chill our rights concerning freedom of speech.&lt;/p&gt;\n\n&lt;p&gt;And yet - the response on Reddit has been muted and rather tame. Why?&lt;/p&gt;\n\n&lt;p&gt;More generally, why is there so little conversation here regarding Islamic ideology and how it conflicts with core Western values?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 144,
  "permalink": "/r/TooAfraidToAsk/comments/wo6dew/why_is_there_so_little_conversation_about_radical/",
  "subreddit": "TooAfraidToAsk",
  "id": "wo6dew",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Earlier this week, Salman Rushdie was attacked while on stage and preparing to\ndeliver a speech. His attacker is said to be a Muslim with sympathies to those\nwho declared a fatwa on Rushdie, following his allegedly blasphemous publication\nof The Satanic Verses.\n\nThe incident triggered shockwaves…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今週初め、サルマン・ラシュディは、ステージ上で準備をしているときに襲撃された。\nサルマン・ラシュディは講演の準備中に襲われた。襲撃者はイスラム教徒で、ラシュディにファトワを宣言した人たちに共感していると言われています。\nラシュディが出版した『悪魔の詩』を冒涜しているとされ、ラシュディにファトワを宣言した人物に共感するイスラム教徒だと言われています。\n悪魔の詩』を出版した。\n\nこの事件は衝撃を与えた...",
      "title": "なぜRedditではイスラム過激派についての会話が少ないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "本周早些时候，萨尔曼-拉什迪在舞台上准备演讲时遭到了袭击。\n准备发表演讲时遭到袭击。袭击者据说是一名穆斯林，同情那些\n在拉什迪出版了据称是亵渎神明的《撒旦诗篇》之后，那些宣布对拉什迪实施法特瓦的人同情他。\n他的《撒旦诗篇》出版后，那些宣布对拉什迪实施法特瓦的人表示同情。\n\n这一事件引发了巨大的震动。",
      "title": "为什么Reddit上很少有关于激进伊斯兰教的对话？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "本週早些時候，薩爾曼-拉什迪在舞臺上準備演講時遭到了襲擊。\n準備發表演講時遭到襲擊。襲擊者據說是一名穆斯林，同情那些\n在拉什迪出版了據稱是褻瀆神明的《撒旦詩篇》之後，那些宣佈對拉什迪實施法特瓦的人同情他。\n他的《撒旦詩篇》出版後，那些宣佈對拉什迪實施法特瓦的人表示同情。\n\n這一事件引發了巨大的震動。",
      "title": "爲什麼Reddit上很少有關於激進伊斯蘭教的對話？"
    }
  ]
}