{
  "author": "RefugeeDutch_Syrian",
  "original_created_utc": 1643574960,
  "title": "Interest in Shiba Inu seems to have dried up completely",
  "created_utc": 1643585863,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A few months ago, the meme-coin Shiba Inu (SHIB) was pretty much in the spotlight. The cryptocurrency rose astronomically within a short period of time, and crypto investors&amp;#39; interest in the project was gigantic at times. Shiba Inu even made it into the top 10 largest cryptocurrencies. However, the price of Shiba Inu has since plummeted, and the hype and interest surrounding the project seems to have completely evaporated as well.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Google Trends&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;In fact, last year Shiba Inu was so popular that it topped CoinMarketCap in terms of searches. Also on the Google, there was a huge search for, for example, &amp;quot;Shiba Inu&amp;quot; or &amp;quot;Buy Shiba Inu&amp;quot; all over the world.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;However, this search volume on Google has totally dried up in the last 90 days. Google Trends shows that a peak in terms of interest was reached on October 29 last year. Since then, this search volume has plummeted by a whopping 92%!&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/9lts5dtmyve81.png?width=1168&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=e667ddbf9ad93d831e1f3d6f02d518bcc574f8c3\"&gt;https://preview.redd.it/9lts5dtmyve81.png?width=1168&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=e667ddbf9ad93d831e1f3d6f02d518bcc574f8c3&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Shiba Inu Price&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The price of meme-coin did not manage to perform much better in recent months. Since the all-time high set at the end of October 2021, the SHIB price has dropped more than 75%.  In fact, at the beginning of January, Shiba Inu&amp;#39;s market capitalization plummeted by more than $3.5 billion in just one week.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Although the team at Shiba Inu is still working hard behind the scenes to get the project back on track, this seems to have become quite a task. Here and there SHIB still gets listed on a new crypto exchange, but the extreme price appreciation we saw in the past seems to be a thing of the past so far.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Of course, Shiba Inu is not the only cryptocurrency that is performing poorly at the moment. Due to the high uncertainty in both the crypto and equity markets, most cryptocurrencies are deep in the red. Nevertheless, the demise of SHIB can be called an outlier.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Edit: Shib holders and fans, stop attacking me for pointing out your coin has had its day and people have moved to the next Doge/Shib, jeez, chillax and accept the bad investment choices you made&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 638,
  "permalink": "/r/CryptoCurrency/comments/sgi9g0/interest_in_shiba_inu_seems_to_have_dried_up/",
  "subreddit": "CryptoCurrency",
  "id": "sgi9g0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A few months ago, the meme-coin Shiba Inu (SHIB) was pretty much in the\nspotlight. The cryptocurrency rose astronomically within a short period of time,\nand crypto investors' interest in the project was gigantic at times. Shiba Inu\neven made it into the top 10 largest cryptocurrencies. However, the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数ヶ月前、ミームコイン「柴犬（SHIB）」がかなり話題になりました。\nスポットライトを浴びる。この暗号通貨は短期間で天文学的に上昇しました。\n暗号投資家の関心は、時に巨大なものとなりました。柴犬\nは、最大規模の暗号通貨トップ10に入るまでになりました。しかし、その...",
      "title": "柴犬への興味は完全に枯渇したようだ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几个月前，纪念币芝罘区(SHIB)几乎成了焦点。\n聚光灯下。该加密货币在很短的时间内出现了天文数字般的上涨。\n而加密货币投资者对这个项目的兴趣有时是巨大的。Shiba Inu\n甚至进入了前10大加密货币的行列。然而，该...",
      "title": "对柴犬的兴趣似乎已经完全枯竭了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾個月前，紀念幣芝罘區(SHIB)幾乎成了焦點。\n聚光燈下。該加密貨幣在很短的時間內出現了天文數字般的上漲。\n而加密貨幣投資者對這個項目的興趣有時是巨大的。Shiba Inu\n甚至進入了前10大加密貨幣的行列。然而，該...",
      "title": "對柴犬的興趣似乎已經完全枯竭了"
    }
  ]
}