{
  "author": "UnUnimportant-",
  "the_new_excerpt": "Hey folks! I’m not exactly one to do too much digging through numbers, but over\nthe last few days I’ve just thought of something using what seems to me to be a\nfairly simple and watertight explanation for why those constant VW comparisons\nwe’ve finally started to escape from may not have been…",
  "original_created_utc": 1614451018,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，伙计们！我不是一个人做太多的挖掘通过数字，但过\n这几天，我刚刚想到了一个东西，用在我看来是一个。\n相当简单和无懈可击的解释，为什么那些不断的大众汽车比较\n我们终于开始逃离可能没有... ...",
      "title": "(GME DD)为什么大众汽车的对比比你想象的要准确得多，但却是以一种不同的方式。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，夥計們！我不是一個人做太多的挖掘通過數字，但過\n這幾天，我剛剛想到了一個東西，用在我看來是一個。\n相當簡單和無懈可擊的解釋，爲什麼那些不斷的大衆汽車比較\n我們終於開始逃離可能沒有... ...",
      "title": "(GME DD)爲什麼大衆汽車的對比比你想象的要準確得多，但卻是以一種不同的方式。"
    }
  ],
  "title": "(GME DD) Why the Volkswagen Comparison is much more inaccurate than you thought, but in A DIFFERENT WAY",
  "created_utc": 1614525414,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey folks!\nI’m not exactly one to do too much digging through numbers, but over the last few days I’ve just thought of something using what seems to me to be a fairly simple and watertight explanation for why those constant VW comparisons we’ve finally started to escape from may not have been overplaying GME performance, but actually UNDERPLAYING it.</p>\n\n<p>Apologies for the lack of rockets, but I’m not writing this on a phone. Have fun with all the text:</p>\n\n<p>So. The VW short squeeze spent a lot of time pretending to be a model for GME, with many trying to compare two very different graphs to predict future performance. There seemed to be a very common response to these VW shills, which was often along the lines of: “well, yeah there are more GME shares shorted than there were VW shares, but since the effective GME float is (whether made of original or duplicate counterfeit shares [again, reference the wonderful document which was shared around our community some weeks ago]) significantly larger than the 1% or so of VW shares there was, in effect the 13% short interest on VW led to a 13:1 short:float ratio meanwhile GME would, by nature of its much larger float, have a smaller ratio despite the fact it has far, far greater short interest (math 101).\nI accepted this for the last few weeks, but recently after trying to explain this to my mother through an actual example I came up with a very interesting differentiating factor which no one has really mentioned:</p>\n\n<p>TL;DR:\nYou can cover INFINITE short positions with ONE real share, as long as you make an infinite number of transactions, but you can only cover ONE naked short position with the ONE created counterfeit share.</p>\n\n<p>Let’s explain that for those that don’t immediately get the logic.\nImagine you are a hedge fund who shorted VW. Presumably, the vast majority if not ALL of the shorts executed went the following way:</p>\n\n<p>you start with ~0~ shares\nyou borrow one from a broker\nyou now have ~1~ shares\nyou sell that share, completing your short\nyou now have ~0~ shares</p>\n\n<p>Now imagine the short squeeze happens.\nAnd let’s say there are 100 people like you who all shorted one real share each. The thing is, you can buy a share off the market, returning your total to ~1~ shares, before you return it to ~0~ shares by giving it to your broker. Your broker can now sell that share to other shorts, and they to other shorts, etc.\nThe point being, when working with real shares, an infinite number of transactions can theoretically clear an infinite number of shorts (while still driving the price up).</p>\n\n<p>Now here’s the kicker, which has been tormenting me over the last few days as I try not to get my hopes too high:\nImagine you are an immensely idiotic hedge fund, named Delvin Capital. \nYou go ahead and do some sexy naked shorting.</p>\n\n<p>you start with ~0~ shares\nyou DO NOT BORROW ONE from your broker!\nyou sell a “share”, promising to fulfill the step you just skipped “sometime soonish maybe”\nyou now have ~ -1 ~ shares!!</p>\n\n<p>Now the squeeze happens, as above. But this time, the 100 other friends of yours are similarly positioned, and also made naked short positions. Notice the problem when you try to cover using the above strategy: you buy that one share off the market to cover your short. Notice: your total is not positive, but only ~0~, since you were actually negative to begin with! \nThus, you can’t give these shares to your broker, or another fund, since doing so would only return you to a negative value: </p>\n\n<p>THE POINT BEING, naked shorts, unlike normal PG-13 shorts, have what is effectively a 1:1 COVER RATIO\nThe whole idea of hedgies rapidly trading shares back and forth with each other to cover is, as far as I can reason, IMPOSSIBLE. Maybe that’s why they haven’t squeezed yet?</p>\n\n<p>Here’s where VW vs. GME comes back in, though. GME’s nominal institutional ownership is over 100%. Furthermore, with all the recently unearthed ETF shorts added in, GME shorts are pretty obviously over 100%. When you consider that, with retail NOT EVEN FACTORED INTO THE EQUATION, this 1:1 cover ratio is completely in feasible for shorts, their desperation seems to have been, if anything, undervalued this whole time. The ONLY WAY THEY CAN COVER NAKED SHORTS is buy repurchasing an almost IDENTICAL NUMBER OF SHARES, and it is THIS FACT that they are not just able to purchase a few shares and move them around like they might otherwise have been able to but would literally have to buy more shares than exist <em>WITHOUT TRADING THE SAME ONES BACK AND FORTH</em> which makes this fucking crazy.\nAssuming retail and bullish institutions hold, it is not just exceedingly costly, but impossible for them to cover.</p>\n\n<p>If you’ve gotten this far, congratulations.\nNow think about that again.</p>\n\n<p>Effective TL;DR 2.0:</p>\n\n<p>People asked what the price would be like if demand is infinite and supply minuscule?\nProbably pretty fucking high. VW may be a good example.</p>\n\n<p>But here’s MY question:\nWhat will the price be like if demand is infinite and it is literally impossible for supply to ever meet it? \nVW is definitely not a good example. If anything, it’s an understatement. I think THIS is what actually makes GME something we’ve never, ever seen before in all of financial history.</p>\n\n<p>Please reflect on this and correct me if I’m wrong. I hope I’m not.\nJoy to all,\n~Unimportant</p>\n\n<p>(this is not financial advise, and I am not a financial advisor)</p>\n</div><!-- SC_ON -->",
  "score": 1751,
  "permalink": "/r/wallstreetbets/comments/ltudu7/gme_dd_why_the_volkswagen_comparison_is_much_more/",
  "subreddit": "wallstreetbets",
  "id": "ltudu7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937752772
}