{
  "author": "jelvinjs7",
  "original_created_utc": 1646611920,
  "title": "\"Sk8er Boi\" (A. Lavigne 2002) argues that in high school dynamics, the so-called 'skaters' were low on the social pecking order. How accurately does this work represent turn-of-the-century teenage social order (at least in North American city/suburban schools)?",
  "created_utc": 1646622705,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=TIy3n2b7V9k\"&gt;The artistry in question&lt;/a&gt;. &lt;/p&gt;\n\n&lt;p&gt;I find the implication that Sk8er is a &lt;em&gt;loser&lt;/em&gt; intriguing because I feel like media has led me to associate skateboarding with being cool, and this song kinda subverts that understanding. The description that he&amp;#39;s a punk I think lines up more with my perception of high school cliques and clichés—and I&amp;#39;m noticing now that I think the song actually frames him &lt;em&gt;more&lt;/em&gt; as punk than skater, despite the song title—so I guess I&amp;#39;m curious if historically there&amp;#39;s a connection between these subcultures, or if those are just two different facets of this individual. &lt;/p&gt;\n\n&lt;p&gt;And if this &lt;em&gt;is&lt;/em&gt; an accurate depiction, then is there an explanation in history as to why I tend to assume skateboarders are supposed to be cool despite reality?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 116,
  "permalink": "/r/AskHistorians/comments/t8cb38/sk8er_boi_a_lavigne_2002_argues_that_in_high/",
  "subreddit": "AskHistorians",
  "id": "t8cb38",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The artistry in question [https://www.youtube.com/watch?v=TIy3n2b7V9k].\n\nI find the implication that Sk8er is a loser intriguing because I feel like\nmedia has led me to associate skateboarding with being cool, and this song kinda\nsubverts that understanding. The description that he's a punk I think…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "問題の芸術性【https://www.youtube.com/watch?v=TIy3n2b7V9k】。\n\nSk8erが敗者であるという暗示に興味をそそられます。\nメディアは私にスケートボードがクールであることを連想させたが、この曲はある種\nその認識を覆すものです。彼がパンクだという描写は......。",
      "title": "\"Sk8er Boi\" (A. Lavigne 2002) は、ハイスクールの力学において、いわゆる「スケーター」は社会的序列が低かったと論じている。この作品は、世紀末の10代の社会秩序（少なくとも北米の都市・郊外の学校）をどの程度正確に表現しているのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所谓的艺术性[https://www.youtube.com/watch?v=TIy3n2b7V9k]。\n\n我发现Sk8er是个失败者的暗示很有意思，因为我觉得\n媒体让我把滑板和酷联系起来，而这首歌有点\n颠覆了这种理解。关于他是个朋克的描述，我认为...",
      "title": "\"Sk8er Boi\"（A. Lavigne 2002）认为，在高中的动态中，所谓的'滑冰者'在社会上的地位很低。这部作品如何准确地代表了世纪初的青少年社会秩序（至少在北美的城市/郊区学校）？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所謂的藝術性[https://www.youtube.com/watch?v=TIy3n2b7V9k]。\n\n我發現Sk8er是個失敗者的暗示很有意思，因爲我覺得\n媒體讓我把滑板和酷聯繫起來，而這首歌有點\n顛覆了這種理解。關於他是個朋克的描述，我認爲...",
      "title": "\"Sk8er Boi\"（A. Lavigne 2002）認爲，在高中的動態中，所謂的'滑冰者'在社會上的地位很低。這部作品如何準確地代表了世紀初的青少年社會秩序（至少在北美的城市/郊區學校）？"
    }
  ]
}