{
  "author": "jelvinjs7",
  "original_created_utc": 1646611920,
  "title": "\"Sk8er Boi\" (A. Lavigne 2002) argues that in high school dynamics, the so-called 'skaters' were low on the social pecking order. How accurately does this work represent turn-of-the-century teenage social order (at least in North American city/suburban schools)?",
  "created_utc": 1646622705,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=TIy3n2b7V9k\"&gt;The artistry in question&lt;/a&gt;. &lt;/p&gt;\n\n&lt;p&gt;I find the implication that Sk8er is a &lt;em&gt;loser&lt;/em&gt; intriguing because I feel like media has led me to associate skateboarding with being cool, and this song kinda subverts that understanding. The description that he&amp;#39;s a punk I think lines up more with my perception of high school cliques and clichés—and I&amp;#39;m noticing now that I think the song actually frames him &lt;em&gt;more&lt;/em&gt; as punk than skater, despite the song title—so I guess I&amp;#39;m curious if historically there&amp;#39;s a connection between these subcultures, or if those are just two different facets of this individual. &lt;/p&gt;\n\n&lt;p&gt;And if this &lt;em&gt;is&lt;/em&gt; an accurate depiction, then is there an explanation in history as to why I tend to assume skateboarders are supposed to be cool despite reality?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 116,
  "permalink": "/r/AskHistorians/comments/t8cb38/sk8er_boi_a_lavigne_2002_argues_that_in_high/",
  "subreddit": "AskHistorians",
  "id": "t8cb38",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The artistry in question [https://www.youtube.com/watch?v=TIy3n2b7V9k].\n\nI find the implication that Sk8er is a loser intriguing because I feel like\nmedia has led me to associate skateboarding with being cool, and this song kinda\nsubverts that understanding. The description that he's a punk I think…"
}