{
  "author": "iftttTestAcct",
  "original_created_utc": 1633741211,
  "title": "I found a piece of paper containing random words while doing some spring cleaning",
  "created_utc": 1633790035,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m new to crypto. How new? I started properly investing in 2021. \nOf course, I&#39;ve heard of cryptocurrencies, including BTC, ETH, and a few others over the last few years. </p>\n\n<p>So recently, I found a piece of paper tucked away between books at home, with random words and it hit me, could this be a the seed phrases for a wallet? </p>\n\n<p>How could this be possible? I haven&#39;t bought into crypto before this year, or at least i dont remember buying in. My mind starts racing. Holy shit I&#39;d be rich as fuck if my younger self bought some BTC and forgot about it. I could get that PS5 upgrade, I could quit my job, I could eat fancier dollar store ramen.</p>\n\n<p>Okay, I decide then to calm myself down and started looking through my old phone for any wallet apps. I look through my PC for any wallet apps. Nothing. </p>\n\n<p>So i decided to do some googling and looked for any desktop wallet names I recognize. Only 2 prominent ones stood out, electrum &amp; exodus. Great, I&#39;ve heard of those well before i started investing in crypto. I start a search on my PC for any dat files. </p>\n\n<p>And there it was. A wallet.dat file hidden away in an archived electrum folder. Thank fuck i dont delete old files. </p>\n\n<p>I start sweating even more. </p>\n\n<p>I enter the seed phrases and lo it accepts it. I&#39;m brought to the balances page and it shows that my portfolio is worth is mind blowing $0. </p>\n\n<p>Turns out I&#39;d heard of crypto long ago and created a wallet to buy. And ended up not getting any. Younger me will be kicking myself right now if he could.</p>\n\n<p>So I&#39;ll be sticking to my PS4, I&#39;ll be keeping my job, and I&#39;ll continue eating regular instant noodles. </p>\n\n<p>So i guess this is a good reminder. Save your seed phrases somewhere safe, if you forget about it, you might have some life changing money! Or not...</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/q4b19l/i_found_a_piece_of_paper_containing_random_words/",
  "subreddit": "CryptoCurrency",
  "id": "q4b19l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm new to crypto. How new? I started properly investing in 2021. Of course,\nI've heard of cryptocurrencies, including BTC, ETH, and a few others over the\nlast few years.\n\nSo recently, I found a piece of paper tucked away between books at home, with\nrandom words and it hit me, could this be a the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は暗号の初心者です。どのくらい新しいかというと 2021年にちゃんと投資を始めました。もちろんです。\nここ数年、BTCやETHなどの暗号通貨を聞いたことがあります。\nここ数年のことです。\n\nそれで最近、家の本の間に挟まっていた紙に、ランダムな言葉が書かれているのを見つけたんです。\n適当な言葉が書かれていて、これはもしかして...と思いました。",
      "title": "春の大掃除をしていたら、ランダムな言葉が書かれた紙を見つけました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是加密货币的新手。有多新？我在2021年开始适当投资。当然了。\n我听说过加密货币，包括BTC、ETH，以及过去几年的其他一些加密货币。\n在过去的几年里。\n\n所以最近，我在家里发现了一张夹在书中间的纸，上面写着\n我突然想到，这可能是一个...",
      "title": "我在做春季大扫除的时候发现了一张纸，上面有一些随机的文字"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是加密貨幣的新手。有多新？我在2021年開始適當投資。當然了。\n我聽說過加密貨幣，包括BTC、ETH，以及過去幾年的其他一些加密貨幣。\n在過去的幾年裏。\n\n所以最近，我在家裏發現了一張夾在書中間的紙，上面寫着\n我突然想到，這可能是一個...",
      "title": "我在做春季大掃除的時候發現了一張紙，上面有一些隨機的文字"
    }
  ]
}