{
  "author": "LisHere321",
  "original_created_utc": 1629752501,
  "title": "There are many different crypto people. Here are the categories.",
  "created_utc": 1629770521,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>1 <strong>The shitbrainer</strong> - buys shitcoins, knows shit about crypto, keeps hodling the shitcoin</p>\n\n<p>2 <strong>The stoic</strong> - DCA - HODL, 3 different ATHs reached already, still DCA - HODL</p>\n\n<p>3 <strong>The twitchy</strong> - Looking at charts every 5 minutes, daytrading, tries to DCA once, but can&#39;t keep it, because has to sell and rebuy fast</p>\n\n<p>4 <strong>Profit taker</strong> - DCAs, swing trades a little, takes profit once in a while, but never takes out their whole investments, reinvests again</p>\n\n<p>5 <strong>The skinflint</strong> - stopped all their bad habits which costs them fiat like smoking/ bubblegum chewing / showering every day / [...] to have more to invest in crypto, participates in every shitty airdrop events, uses Brave browser to farm, shitposting with at least 800 comments per day, exhausts all the posting limit of 3 per day</p>\n\n<p>6 <strong>The Husband or the wife</strong> - Your crypto, but our gains</p>\n\n<p>7 <strong>The follower</strong> - does everything their influencer says, also likes FOMO and tatooing the coin emblem on legs and butt</p>\n\n<p>8 <strong>The Lucky</strong> - got very early in a coin which went to the moon few years later</p>\n\n<p>9 <strong>DIY quick buck</strong> - making their own token, rug pull when profitable calling it &quot;family emergency&quot;</p>\n\n<p>10 <strong>Hard Lesson</strong> - a person who has passes all steps 1 to 9 once in their crypto life leading them to either A) DCA+HODL+BEING HAPPY or B) leaving crypto space forever+BEING UNHAPPY</p>\n\n<hr/>\n\n<p>You come up with another category?</p>\n\n<p>I&#39;m number 10 A btw, just except that ass tatoo thing.</p>\n\n<p>EDIT1: The poser: posts on <a href=\"/r/cc\">r/cc</a> all day. Preaches DCA and HODL. But really only has about 30$ invested. <a href=\"/u/KasparThePissed\">u/KasparThePissed</a></p>\n\n<p>EDIT2: the hype beast- someone who only chases coins after they’ve 2-3x’d and makes it their mission to make others try to keep buying</p>\n\n<p>the eeyore: someone who has been “watching” crypto for years but never pulled the trigger and now thinks it’s too late for them so they’re sad about missing out. <a href=\"/u/Odysseus_Lannister\">u/Odysseus_Lannister</a></p>\n\n<p>EDIT3: The Mooner: Chases moonshots left and right. Confuses DYOR with Dior. <a href=\"/u/pbjclimbing\">u/pbjclimbing</a></p>\n</div><!-- SC_ON -->",
  "score": 203,
  "permalink": "/r/CryptoCurrency/comments/pa8rme/there_are_many_different_crypto_people_here_are/",
  "subreddit": "CryptoCurrency",
  "id": "pa8rme",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "1 The shitbrainer - buys shitcoins, knows shit about crypto, keeps hodling the\nshitcoin\n\n2 The stoic - DCA - HODL, 3 different ATHs reached already, still DCA - HODL\n\n3 The twitchy - Looking at charts every 5 minutes, daytrading, tries to DCA\nonce, but can't keep it, because has to sell and rebuy…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1 The shitbrainer - クソコインを購入し、暗号についての知識もなく、クソコインを使い続ける。\n糞コイン\n\n2 ストイックな人 - DCA - HODL、すでに3つの異なるATHに到達したが、まだDCA - HODLのまま。\n\n3 The twitchy - 5分ごとにチャートを見て、デイトレードをしていて、一度はDCAを試みたが、継続できなかった。\n一度はDCAに挑戦したが、維持できず、売って買い直さなければならない...。",
      "title": "いろいろな暗号の人がいます。ここではそのカテゴリーを紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "1 屎壳郎--购买屎币，对加密货币一窍不通，一直躲藏着。\n狗屎币\n\n2 稳重的人--DCA-HODL，已经达到3个不同的ATH，仍然是DCA-HODL\n\n3 紧张的人--每5分钟看一次图表，进行日间交易，尝试DCA\n一次，但不能保持，因为必须卖出并重新购买......",
      "title": "有许多不同的加密货币人。以下是这些类别。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "1 屎殼郎--購買屎幣，對加密貨幣一竅不通，一直躲藏着。\n狗屎幣\n\n2 穩重的人--DCA-HODL，已經達到3個不同的ATH，仍然是DCA-HODL\n\n3 緊張的人--每5分鐘看一次圖表，進行日間交易，嘗試DCA\n一次，但不能保持，因爲必須賣出並重新購買......",
      "title": "有許多不同的加密貨幣人。以下是這些類別。"
    }
  ]
}