{
  "author": "callmemrsunshine",
  "original_created_utc": 1637076033,
  "title": "You won't become a Millionaire by buying today's dip. This is not real blood in the streets but more like a punch in face and your nose bleeding. So pace yourself and keep some cash aside. It could get juicier.",
  "created_utc": 1637084075,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I saw a post earlier quoting that Millionaires are made today. BS!</p>\n\n<p>I&#39;m not a veteran in the market and won&#39;t pretend to be but I believe in these things as of today:</p>\n\n<ul>\n<li><p>Millionaire won&#39;t be made by today&#39;s dip. A real BTC and market dip imo is below and between 20 to 50% and Satan knows maybe further down...</p></li>\n<li><p>Real money is made when there&#39;s blood in the streets. This right now is more like a punch in the face and your nose bleeding. Don&#39;t be fool as it could get turn into a <strong>real</strong> blood bath!</p></li>\n<li><p>Don&#39;t listen to everyone&#39;s predictions and fomo. Don&#39;t go ape and all-in in a coin that dipped 10-15%. Always have some cash aside, DCA and pace yourself. The markets tend to rewards those who are discipline and patient.</p></li>\n</ul>\n\n<p>May your hodl 10X and I wish you the very best in this Bull Market</p>\n</div><!-- SC_ON -->",
  "score": 246,
  "permalink": "/r/CryptoCurrency/comments/qva41t/you_wont_become_a_millionaire_by_buying_todays/",
  "subreddit": "CryptoCurrency",
  "id": "qva41t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I saw a post earlier quoting that Millionaires are made today. BS!\n\nI'm not a veteran in the market and won't pretend to be but I believe in these\nthings as of today:\n\n * Millionaire won't be made by today's dip. A real BTC and market dip imo is\n   below and between 20 to 50% and Satan knows maybe…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "以前、ミリオネアは今日作られるという記事を見たことがあります。BS!\n\n私は市場のベテランではありませんし、そのようなふりをするつもりもありませんが、今日の時点では以下のことを信じています。\n今日の時点では、以下のことを信じています。\n\n * 今日のディップではミリオネアは生まれません。ミリオネアは今日のディップでは作れない。\n   20から50％以下で、サタンは多分...。",
      "title": "今日のディップを買ってもミリオネアにはなれません。これは本当の意味での「血の海」ではなく、顔にパンチを食らって鼻血が出るようなものだ。だから、自分のペースで、いくつかの現金を確保しておいてください。もっと悲惨なことになるかもしれません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我早些时候看到一个帖子，引用了百万富翁是今天产生的。BS!\n\n我不是市场上的老手，也不会假装自己是老手，但我相信这些\n但从今天开始，我相信这些东西。\n\n * 百万富翁不会因为今天的下跌而产生。真正的BTC和市场下跌，我认为是\n   低于20%到50%之间，而且撒旦知道也许......",
      "title": "你不会因为买了今天的跌停板而成为百万富翁。这不是真正的血流成河，而更像是脸上挨了一拳，鼻子流血了。因此，你要把握好节奏，留出一些现金。它可能会变得更加多汁。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我早些時候看到一個帖子，引用了百萬富翁是今天產生的。BS!\n\n我不是市場上的老手，也不會假裝自己是老手，但我相信這些\n但從今天開始，我相信這些東西。\n\n * 百萬富翁不會因爲今天的下跌而產生。真正的BTC和市場下跌，我認爲是\n   低於20%到50%之間，而且撒旦知道也許......",
      "title": "你不會因爲買了今天的跌停板而成爲百萬富翁。這不是真正的血流成河，而更像是臉上捱了一拳，鼻子流血了。因此，你要把握好節奏，留出一些現金。它可能會變得更加多汁。"
    }
  ]
}