{
  "author": "ChocolateTsar",
  "the_new_excerpt": "> Key Points\n> \n> Jamie Dimon’s message to the management team of $3.4 trillion banking goliath\n> JPMorgan Chase: Be frightened of fintech rivals.\n> \n> “Absolutely we should be scared s---less about that,” Dimon told analysts.\n> \n> Dimon said he sent his deputies a list of global competitors, and…",
  "original_created_utc": 1610743890,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "> 关键点\n> \n> 杰米-戴蒙对3.4万亿美元银行业巨头管理团队的寄语。\n>摩根大通。害怕金融科技的竞争对手。\n> \n> \"我们绝对不应该害怕，\"Dimon告诉分析师。\n> \n> 迪蒙表示，他给自己的副手发了一份全球竞争对手的名单，并...",
      "title": "杰米-戴蒙表示，摩根大通绝对应该对金融科技的威胁 \"不害怕\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> 關鍵點\n> \n> 傑米-戴蒙對3.4萬億美元銀行業巨頭管理團隊的寄語。\n>摩根大通。害怕金融科技的競爭對手。\n> \n> \"我們絕對不應該害怕，\"Dimon告訴分析師。\n> \n> 迪蒙表示，他給自己的副手發了一份全球競爭對手的名單，並...",
      "title": "傑米-戴蒙表示，摩根大通絕對應該對金融科技的威脅 \"不害怕\"。"
    }
  ],
  "title": "Jamie Dimon says JPMorgan Chase should absolutely be ‘scared s---less’ about fintech threat",
  "created_utc": 1610755472,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p><strong>Key Points</strong>  </p>\n\n<p><strong>Jamie Dimon’s message to the management team of $3.4 trillion banking goliath JPMorgan Chase: Be frightened of fintech rivals.</strong>  </p>\n\n<p><strong>“Absolutely we should be scared s---less about that,” Dimon told analysts.</strong>  </p>\n\n<p><strong>Dimon said he sent his deputies a list of global competitors, and that PayPal, Square, Stripe, Ant Financial as well as Amazon, Apple and Google were names the bank needs to keep an eye on.</strong>  </p>\n\n<p><a href=\"https://www.cnbc.com/quotes/?symbol=JPM\">JPMorgan Chase</a> CEO <a href=\"https://www.cnbc.com/id/10000222\">Jamie Dimon</a> has watched while a new breed of fintech players, led by <a href=\"https://www.cnbc.com/quotes/?symbol=PYPL\">PayPal</a>, <a href=\"https://www.cnbc.com/quotes/?symbol=SQ\">Square</a> and tech giants around the world have exponentially grown users and market value.  </p>\n\n<p>His message to the management team of his $3.4 trillion banking goliath: Be frightened.  </p>\n\n<p>“Absolutely, we should be scared s---less about that,” Dimon said Friday in a conference call with analysts. “We have plenty of resources, a lot of very smart people. We’ve just got to get quicker, better, faster. ... As you look at what we’ve done, you’d say we’ve done a good job, but the other people have done a good job, too.”  </p>\n\n<p>Dimon’s blunt assessment was in response to questions from analysts including Mike Mayo of Wells Fargo who pointed out that with <a href=\"https://www.cnbc.com/2020/09/04/disruptors-paypal-and-square-surpass-wall-street-giants-including-goldman-sachs-in-market-cap.html\">rich, tech-like valuations</a>, fintech players have “trounced” the traditional banks in recent years.  </p>\n\n<p>Dimon said he sent his deputies a list of global competitors, and that PayPal, Square, Stripe, Ant Financial as well as U.S. tech giants including <a href=\"https://www.cnbc.com/quotes/?symbol=AMZN\">Amazon</a>, Apple and <a href=\"https://www.cnbc.com/quotes/?symbol=GOOGL\">Google</a> were names the bank needs to keep an eye on. The rivals are also clients of JPMorgan’s commercial and investment banking in many cases, he added.  </p>\n\n<p>Competition will be particularly tight in the world of payments, he said: “I expect to see very, very tough, brutal competition in the next 10 years,” Dimon said. “I expect to win, so help me God.”  </p>\n\n<p>Dimon added that in some cases, the new players were “examples of unfair competition” that the bank would do something about eventually. He included players that take advantage of richer debit-card revenue for small banks and firms Dimon accused of not taking precautions against money laundering.  </p>\n\n<p>He specifically called out Plaid, the payments start-up whose acquisition by Visa recently collapsed, saying “people who improperly use data that’s been given to them, like Plaid.”  </p>\n\n<p>Plaid CEO Zach Perret declined to directly respond to the accusation during an <a href=\"https://www.cnbc.com/video/2021/01/15/plaid-ceo-on-how-its-5-point-3-billion-deal-with-visa-fell-through.html\">interview</a> with CNBC’s David Faber, adding that Plaid is spending time with the bank on a partnership.  </p>\n\n<p>When contacted for further comment, a Plaid spokeswoman said the company is “focused on ensuring people have access to their own financial information so they can securely share it with permission in order to use the fintech apps they choose.”  </p>\n\n<p>She added that “data privacy and security are core to everything we do, including the data exchange agreements we have with JPMorgan Chase among many other banks.”</p>\n</blockquote>\n\n<p><a href=\"https://www.cnbc.com/2021/01/15/jamie-dimon-says-jpmorgan-chase-should-absolutely-be-scared-s-less-about-fintech-threat.html\">Original CNBC article</a></p>\n</div><!-- SC_ON -->",
  "score": 1664,
  "permalink": "/r/investing/comments/ky3jty/jamie_dimon_says_jpmorgan_chase_should_absolutely/",
  "subreddit": "investing",
  "id": "ky3jty",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311216188
}