{
  "author": "Wiardv",
  "original_created_utc": 1637845703,
  "title": "People are now blaming PlanB for losing money",
  "created_utc": 1637875823,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>PlanB has now admitted that 98K is not going to happen this month, on his Twitter. And a lot of people commented: &quot;Do you know how much money people lost because of you.&quot;</p>\n\n<p>And that really pisses me off. Did PlanB tell you to open leveraged longs? No, he didn&#39;t. That&#39;s their own decision. He just makes predictions like everyone else. He&#39;s been right 3 times in a row, which is way better than what the haters do.</p>\n\n<p>Also, even if he told you: Open up leveraged longs, it&#39;s still your decision to listen to that or not. Take predicions with a grain of salt.</p>\n\n<p>I am not here to defend or attack PlanB, I am neutral. But I do want to rant about the people who are now saying: &quot;I lost so much money because of you, scammer.&quot; He&#39;s a scammer because he can&#39;t predict Bitcoin correctly?</p>\n\n<p>I have to be honest, I thought 98K was going to happen as well, because he was so accurate before. Halfway during the month I noticed it was probably not going to happen. But now people are attacking him, because he was wrong and that&#39;s not fair.</p>\n\n<p><strong>Wondering what will happen to Benjamin Cowen when he makes a wrong prediction...</strong></p>\n</div><!-- SC_ON -->",
  "score": 228,
  "permalink": "/r/CryptoCurrency/comments/r1w753/people_are_now_blaming_planb_for_losing_money/",
  "subreddit": "CryptoCurrency",
  "id": "r1w753",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "PlanB has now admitted that 98K is not going to happen this month, on his\nTwitter. And a lot of people commented: \"Do you know how much money people lost\nbecause of you.\"\n\nAnd that really pisses me off. Did PlanB tell you to open leveraged longs? No,\nhe didn't. That's their own decision. He just…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "PlanBは今、98Kが今月は実現しないことを認めています。\nツイッターで発表しました。そして、多くの人がコメントしました。\"あなたのせいでどれだけの人がお金を失ったか知っていますか\nあなたのせいでどれだけの人が損をしたか知っていますか？\"\n\nこれには本当に腹が立ちました。PlanBはあなたにレバレッジド・ロングを建てろと言ったのですか？いいえ。\n言ってません それは彼ら自身の判断です。彼はただ...",
      "title": "損失を出したPlanBを非難する人が出てきた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "PlanB现在承认这个月不会有98K了，在他的\n推特上。而很多人评论说。\"你知道人们因为你而损失了多少钱吗？\n因为你。\"\n\n而这真的让我很生气。PlanB告诉你开杠杆多头了吗？没有。\n他没有。那是他们自己的决定。他只是...",
      "title": "现在人们都在指责PlanB的亏损"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "PlanB現在承認這個月不會有98K了，在他的\n推特上。而很多人評論說。\"你知道人們因爲你而損失了多少錢嗎？\n因爲你。\"\n\n而這真的讓我很生氣。PlanB告訴你開槓杆多頭了嗎？沒有。\n他沒有。那是他們自己的決定。他只是...",
      "title": "現在人們都在指責PlanB的虧損"
    }
  ]
}