{
  "author": "pdxpython",
  "original_created_utc": 1647784041,
  "title": "What is the origin of the rimshot/ sting/ ba dum tsss in association with jokes?",
  "created_utc": 1647801489,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I think everyone knows the setup- a comedian tells a joke and there’s the drum sting “ba dum tsss” on the punch line. I don’t think I’ve actually heard this in any comedy though, where does the concept of a short drum sequence in association with a joke come from? Were there many formats of it, and if so why is the ba dum tsss sequence the “joke” drum instead of some other drum phrase? Was this common enough in some timeframe that it’s now part of the conception of a joke? &lt;/p&gt;\n\n&lt;p&gt;Finally, is there any tradition of similar kinds of musical accompaniment to spoken comedy (filling the same sort of niches as the joke drum sting, wah-wah trumpets, etc, not really comedic lyrical songs) before contemporary history?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/tilffj/what_is_the_origin_of_the_rimshot_sting_ba_dum/",
  "subreddit": "AskHistorians",
  "id": "tilffj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So I think everyone knows the setup- a comedian tells a joke and there’s the\ndrum sting “ba dum tsss” on the punch line. I don’t think I’ve actually heard\nthis in any comedy though, where does the concept of a short drum sequence in\nassociation with a joke come from? Were there many formats of it,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "コメディアンがジョークを言うという設定は、誰もが知っていることだと思います。\nドラム缶が「バ・ダム・ツッ」とオチをつけてくれるんです。実際に聞いたことがないような気がします。\n短いドラムの連打というコンセプトはどこから来ているのでしょうか。\nジョークとの関連は？多くの形式があったのでしょうか、、、。",
      "title": "ジョークにちなんだリムショット／スティング／バ・ダム・ツッコミの由来は何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我想每个人都知道这个设置--一个喜剧演员讲了一个笑话，然后是\n鼓点 \"ba dum tsss \"的提示语。我不认为我真的听到过\n但是，在任何喜剧中都没有听到过这种说法。\n我想我没有在任何喜剧中听到过这样的声音，那么短的鼓声和笑话的概念是怎么来的呢？是否有很多格式？",
      "title": "与笑话相关的rimshot/ sting/ ba dum tsss的起源是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我想每個人都知道這個設置--一個喜劇演員講了一個笑話，然後是\n鼓點 \"ba dum tsss \"的提示語。我不認爲我真的聽到過\n但是，在任何喜劇中都沒有聽到過這種說法。\n我想我沒有在任何喜劇中聽到過這樣的聲音，那麼短的鼓聲和笑話的概念是怎麼來的呢？是否有很多格式？",
      "title": "與笑話相關的rimshot/ sting/ ba dum tsss的起源是什麼？"
    }
  ]
}