{
  "author": "NewDark90",
  "the_new_excerpt": "2021 GUIDE TO PRIVATE CRYPTOCURRENCY\n\nIn the past few months I've been very involved in understanding and researching\ncryptocurrency. Like many of you, I find the technology fascinating and the\nprospects for the near and distant future enthralling. However, I've noticed a\nfew things that caused me…",
  "original_created_utc": 1616693901,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "2021年《私人货币指南》。\n\n在过去的几个月里，我一直非常投入地了解和研究\n加密货币。和你们中的许多人一样，我发现这项技术很迷人，而且是\n近期和远期的前景令人神往。然而，我注意到一个问题。\n几件事情，导致我...",
      "title": "2021年私人加密货币指南"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2021年《私人貨幣指南》。\n\n在過去的幾個月裏，我一直非常投入地瞭解和研究\n加密貨幣。和你們中的許多人一樣，我發現這項技術很迷人，而且是\n近期和遠期的前景令人神往。然而，我注意到一個問題。\n幾件事情，導致我...",
      "title": "2021年私人加密貨幣指南"
    }
  ],
  "title": "2021 Guide to Private Cryptocurrency",
  "created_utc": 1616734332,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1><strong>2021 Guide to Private Cryptocurrency</strong></h1>\n\n<p>In the past few months I&#39;ve been very involved in understanding and researching cryptocurrency. Like many of you, I find the technology fascinating and the prospects for the near and distant future enthralling. However, I&#39;ve noticed a few things that caused me to write this guide. </p>\n\n<ol>\n<li>Gathering the details on coins in itself usually isn&#39;t tricky on a per-coin basis. However, comparing them, especially on more technical aspects instead of market dynamics can be challenging. I want to share what I&#39;ve compiled, as I was already doing half the work in an unorganized way already.</li>\n<li>Privacy coins are a very, very small part of the market currently. The most generous interpretation of the current market cap of all privacy crypto coins is well under 1%. Even knowing that BTC and ETH account for ~60% and ~12% respectively, that still seems low.</li>\n</ol>\n\n<p>Please note, some of these details will be basic, especially if you frequent <a href=\"/r/cryptocurrency\">/r/cryptocurrency</a>. I want this to still be generally approachable for people relatively fresh to blockchain and crypto concepts. Some things might get over simplified, but I&#39;ll try not to throw out any important details or nuance. As always, do your own research. I&#39;m not an expert. Please correct me with references where I&#39;m wrong. Not financial advice.</p>\n\n<h2><em>What is private crypto, and wait, isn&#39;t it already private?</em></h2>\n\n<p>Well, not quite. It would be safe to say that most crypto-currencies, including bitcoin, are pseudo-anonymous. Blockchains are a distributed ledger of transactions. And because these transactions are public knowledge, you can see that wallet ABC gave 0.5 bitcoin to XYZ at a certain timeframe. You don&#39;t know that John Smith owns the ABC wallet. However, if anyone were to find out that John Smith owns ABC wallet, that makes every single transaction John Smith has ever made or received out of that wallet, traceable to him. This works similarly to how if someone finds your reddit username, they can now search for every comment and post you&#39;ve ever made.</p>\n\n<p>That seems like a fundamental flaw. I don&#39;t want governments, companies, or even family combing through my entire reddit history... much MUCH less my entire financial transaction history. </p>\n\n<p>So, what&#39;s out there to solve for the privacy problem?</p>\n\n<h2><strong>Privacy Tech Overview</strong></h2>\n\n<p>Before going into individual coins and implementations, I&#39;m going to briefly go over the technology that powers most of them. If there&#39;s a unique tech for a coin, it probably won&#39;t be here and instead touched on in the coin information itself. I&#39;m basing my Pros and Cons on the <a href=\"https://firo.org/guide/privacy-technology-comparison.html\">firo tech comparison guide</a>. It&#39;s not perfect and the source is technically biased, but it&#39;s one of the better comprehensive guides and a good starting point.</p>\n\n<h3><em>Coin-Joins/Mixers/Tumblers</em></h3>\n\n<p>One of the simpler, quick and dirty methods of anonymizing yourself on the blockchain. You can even do this with Bitcoin! A quick real world analogy would be that you and multiple others get together with handfuls of metal coins. Everyone puts their money in a jar. A dedicated &quot;jar-shaker&quot; is told where to send coins in the amounts that are put in by the individuals. The jar gets shaken up by the shaker. The shaker then distributes the coins from the jar. </p>\n\n<p>Pros:</p>\n\n<ul>\n<li>Works on top of most cryptocurrencies</li>\n<li>Relatively simple to implement</li>\n<li>Lightweight</li>\n</ul>\n\n<p>Cons:</p>\n\n<ul>\n<li>Basic anonymity</li>\n<li>Requires mixers to be online</li>\n<li>Acquiring coins from a mixer may give you coins that are being tracked and/or tied to illegal activity</li>\n</ul>\n\n<h3><em>RingCT + CryptoNote</em></h3>\n\n<p>I&#39;m putting these together as they almost always are used in a pair, most notably in Monero.</p>\n\n<p>RingCT works by sending multiple &quot;decoy&quot; transactions among the actual transaction. The amount is not known to anyone other than sender and receiver.\nCryptoNote handles generating one-time use addresses to use for a transaction.</p>\n\n<p>Together, the amount of anonymity is very solid. It&#39;s not perfect given it partly uses &quot;security through obscurity&quot; with multiple decoys. </p>\n\n<p>Pros:</p>\n\n<ul>\n<li>Can be implemented with &quot;privacy on&quot; by default</li>\n<li>Anonymity increases as time passes as outputs become the new inputs of new mixes</li>\n<li>Hides transaction amounts when implemented with RingCT (or bulletproofs)</li>\n<li>Well researched cryptography</li>\n</ul>\n\n<p>Cons:</p>\n\n<ul>\n<li>Does not break transaction links, merely obscures them, hence a &#39;decoy&#39; model</li>\n<li><del>Scalability issues because of large transaction sizes and a non prunable blockchain</del></li>\n<li>Risks of blockchain being deanonymized in the future or through incorrect implementations</li>\n<li>Ring size is practically limited</li>\n<li>Does not have supply auditability meaning hidden inflation can go undetected</li>\n</ul>\n\n<h3><em>Zero-Knowledge Proofs (zk-SNARKs, zk-STARKs, Bulletproofs)</em></h3>\n\n<p>A method of proving a transaction is valid, without identifying any other information about it. </p>\n\n<p>Primarily, the method used for blockchains are zk-SNARKs. <em>Zero-Knowledge Succinct Non-Interactive Argument of Knowledge</em></p>\n\n<p>Pros:</p>\n\n<ul>\n<li>Can be implemented with &quot;privacy on&quot; by default</li>\n<li>Hides all details of transaction, including amount</li>\n<li>Proof sizes are small and fast to verify</li>\n<li>Cryptographically Secure</li>\n</ul>\n\n<p>Cons: </p>\n\n<ul>\n<li>Requires a trusted setup.\n\n<ul>\n<li>This risk can be managed through Multi-party Computation Ceremonies</li>\n</ul></li>\n<li>Incorrect implementation or leakage of trusted setup parameters can lead to forgery of coins</li>\n<li>Does not have supply auditability meaning hidden inflation can go undetected</li>\n</ul>\n\n<h3><em>MimbleWimble</em></h3>\n\n<p>A newer technology that hides all transactions and amounts. Uses a &quot;blinding factor&quot; that acts similarly to secret addresses that are shared between both parties, which means only the sender and receiver know they are a part of the transaction. Also, probably most importantly, MimbleWimble is a Harry Potter spell for tongue-tying.</p>\n\n<p>Pros:</p>\n\n<ul>\n<li>All transactions are private</li>\n<li>Uses well established cryptography</li>\n<li>Hides transaction amounts</li>\n<li>Blockchain can reduce in size as it only retains UTXOs</li>\n<li>No re-use of address problems</li>\n<li>Minimal risk to send to incorrect address as receiver must be online.</li>\n</ul>\n\n<p>Cons: </p>\n\n<ul>\n<li>Needs interaction between receiver and sender. </li>\n<li>Does not break transaction links, merely obscures them, hence a &#39;decoy&#39; model\n\n<ul>\n<li>Transaction links are to secret addresses, not a wallet</li>\n</ul></li>\n<li>Cold storage in hardware wallets are tricky to implement</li>\n<li>Smart contracts are harder to implement on MimbleWimble</li>\n<li>Relatively early in development</li>\n</ul>\n\n<h3><em>Lelantus</em></h3>\n\n<p>Previous / older implementations: Sigma, Zerocoin.</p>\n\n<p>Lelantus protocol uses a burn-and-redeem model to achieve a high level of privacy. The users can redeem their coins using a special receipt which they receive when they burn their coins, new coins don&#39;t have a trace on the blockchain.</p>\n\n<p>Pros:</p>\n\n<ul>\n<li>Very high anonymity with anonymity sets of up to around 100,000. Mint and spend transactions and completely breaks transaction links between addresses</li>\n<li>Uses well-researched cryptography and only requiring DDH cryptographic assumptions</li>\n<li>Small proof sizes of around 1.5 kB</li>\n<li>No trusted setup</li>\n<li>Scalable enough to allow &quot;privacy on&quot; by default</li>\n</ul>\n\n<p>Cons:</p>\n\n<ul>\n<li>Difficult to scale past anonymity sets of 100,000 without cryptographic breakthrough</li>\n<li>Direct anonymous payments in current form require recipient to spend and remint the coin again to prevent the sender from finding out when that coin is spent</li>\n<li>Still in early development, potential bugs and exploits could arise</li>\n</ul>\n\n<h2>Network Tech Overview</h2>\n\n<p>Not all protections are implemented directly on the blockchain. There are some network level tools that are also occasionally included within the wallet software or the blockchain nodes themselves.</p>\n\n<h3><em>Tor</em></h3>\n\n<p>You probably know Tor, right? It hides your IP while browsing the internet. You send a request to the Tor network. That request gets bounced around several random network nodes before finally exiting.</p>\n\n<h3><em>Dandelion++</em></h3>\n\n<p>Instead of immediately broadcasting a transaction to the blockchain to spread, a transaction is passed through a few blockchain nodes sequentially and anonymously before being broadcast to the network.</p>\n\n<h2><strong>Privacy Coins</strong></h2>\n\n<p>Before going into the details of every coin in this list. I want to make a few things known. </p>\n\n<p><em>First</em>, I&#39;m only going to be looking at coins, not tokens.</p>\n\n<p><em>Second</em>, there are varying degrees of how private a coin is. Some may draw the line on what &quot;is&quot; and &quot;is not&quot; a privacy coin based on different criteria. The bar that I will use for this list is going to be fairly simple and as reasonably inclusive as I can be. To be a privacy coin here, you need to at least do better than what you can do with Bitcoin. With Bitcoin, you can optionally perform a coinjoin for transactions. If your coin has Opt-In security features, it has to be better than a coinjoin. If the security feature IS a coinjoin, it must at least be the default. Having some network security bells and whistles to keep your IP private is nice, but also not enough to make the cut.</p>\n\n<p><em>Third</em>, I&#39;m most heavily basing the opinion sections on how well I think the coin does it&#39;s job at being a private currency. Other factors are important and considered, but not the focus. </p>\n\n<p><em>Fourth</em>, I haven&#39;t checked every coin in existence. I&#39;ve found 3 lists of coins I&#39;m working off of here, with a 4th I found later as another sanity check. <a href=\"https://pro-api.coinmarketcap.com/v1/cryptocurrency/listings/latest?start=1&amp;limit=5000&amp;cryptocurrency_type=coins\">Coin Market Cap Api (filtering by tags)</a>, <a href=\"https://cryptoslate.com/cryptos/privacy/\">Cryptoslate</a>, <a href=\"https://www.coinlore.com/privacy-coins\">Coinlore</a>, <a href=\"https://www.coingecko.com/en/categories/privacy-coins\">CoinGecko</a></p>\n\n<p><em>Fifth</em>, remember that this is a <strong>very small</strong> sector of the crypto market currently. Many of these coins are going to be far below the top 100. I&#39;ve limited the criteria to be any coin over $20 million Market Cap on 3/13 (~0.002% of BTC), so the floor for these coins is very low. Why that number specifically? Mostly, I wanted to make sure Grin made the cut. Beyond that, it was trying to keep interesting projects I found near that line also in the cut. I also didn&#39;t want to add a bunch of extra work for truly bottom of the barrel coins. If you have a favorite down there that does something interesting and unique beyond being another Monero clone, I want to know. </p>\n\n<p><em>Finally</em>, I&#39;ll also have a special list underneath these coins that specifically call out the coins that were marked as private by at least one of these lists, and reasoning as to why I think it isn&#39;t really a privacy coin.</p>\n\n<hr/>\n\n<h2><em>Monero</em> - XMR</h2>\n\n<p><strong>Market Cap</strong>: ~$4.14 billion</p>\n\n<p><strong>Privacy</strong>: Full - CryptoNote, RingCT </p>\n\n<p><strong>Transaction Stats</strong>: ~2 min block time <strong>/</strong> &gt;1000 transactions per second <strong>/</strong> ~0.000011 XMR, ~0.0025 - 0.10 USD fee</p>\n\n<p><strong>Coin Rundown / Pitch</strong>: </p>\n\n<blockquote>\n<p>Privacy is achieved through a few distinctive features. Whereas each Bitcoin in circulation has its own serial number, meaning that cryptocurrency usage can be monitored, XMR is completely fungible. By default, details about senders, recipients and the amount of crypto being transferred are obscured — and Monero advocates says this offers an upper hand over rival privacy coins such as Zcash, which are “selectively transparent.” Obfuscation is achieved through the use of ring signatures. Here, past transaction outputs are picked from the blockchain and act as decoys, meaning that outside observers can’t tell who signed it. To ensure that transactions cannot be linked to one another, stealth addresses are created for every single transaction that are only used once.</p>\n</blockquote>\n\n<p><strong>My Impression</strong>: </p>\n\n<p>The Bitcoin of privacy coins, by far the market leader and for good reason. Unless there&#39;s major problems that show up with the technology, it will probably stay a major/top coin. It&#39;s easily the standard that the majority of others copy, and the safest bet amongst all of these coins. </p>\n\n<p><em>Overall impression</em>: Great 😁</p>\n\n<hr/>\n\n<h2><em>Zcash</em> - ZEC</h2>\n\n<p><strong>Market Cap</strong>: ~$1.72 billion</p>\n\n<p><strong>Privacy</strong>: Opt-In - zk-SNARKs </p>\n\n<p><strong>Transaction Stats</strong>: 2.5 min block time <strong>/</strong> ~27 transactions per second <strong>/</strong> 0.0001 ZEC, ~0.01USD fee</p>\n\n<p><strong>Coin Rundown / Pitch</strong>: </p>\n\n<blockquote>\n<p>Zcash’s main advantage lies in its optional anonymity, which allows for a level of privacy unattainable with regular, pseudonymous cryptocurrencies like Bitcoin or Ethereum. ZEC transactions can be sent in two ways: transparent and shielded. Transparent transactions work in about the same way as in Bitcoin, whose codebase Zcash was originally based on: they are sent between public addresses and are recorded on an immutable public ledger (the blockchain). All essential information about these transactions is available online for anyone to see, including the sending and receiving addresses and the amount sent. These public transactions do not reveal user identities in an overt manner: the only identifiers an outside observer can access from the blockchain are public addresses. Shielded ZEC transactions leverage the technology of zk-SNARKs, in order to enable anonymous transactions to be sent over a public immutable blockchain.</p>\n</blockquote>\n\n<p><strong>My Impression</strong>: </p>\n\n<p>Another Opt-In privacy coin. This coin is the highest market cap with a zk-SNARKs implementation. Most transactions aren&#39;t z-address to z-address (private). Transaction stats seem passable, but not amazing. If privacy is your main concern, I&#39;d look elsewhere. Otherwise it seems like a decent coin.</p>\n\n<p><em>Overall impression</em>: OK 🙂</p>\n\n<hr/>\n\n<h2><em>Horizen</em> - ZEN</h2>\n\n<p><strong>Market Cap</strong>: ~$563 million</p>\n\n<p><strong>Privacy</strong>: Opt-In - zk-SNARKs </p>\n\n<p><strong>Transaction Stats</strong>: 2.5 min block time <strong>/</strong> ? transactions per second <strong>/</strong> ? fee</p>\n\n<p><strong>Coin Rundown / Pitch</strong>: </p>\n\n<blockquote>\n<p>Horizen uses a sidechain architecture that can open up a myriad of potential real-world use cases. This cross-chain transfer protocol allows for decentralized sidechains. These are separate blockchains that are pegged to the parent blockchain that can run simultaneously.</p>\n</blockquote>\n\n<p><strong>My Impression</strong>: </p>\n\n<p>Opt-In zk-SNARKs, but with <a href=\"https://i.imgur.com/m8DNm5i.jpg\">blockchains on your blockchain?</a> Sounds cool, but I don&#39;t know if that&#39;s a good enough reason to use it over others.</p>\n\n<p><em>Overall impression</em>: OK 🙂</p>\n\n<hr/>\n\n<h2><em>Verge</em> - XVG</h2>\n\n<p><strong>Market Cap</strong>: ~$422 million</p>\n\n<p><strong>Privacy</strong>: Mixed/Optional - Wraith Protocol, I2P/Tor </p>\n\n<p><strong>Transaction Stats</strong>: 30 sec block time <strong>/</strong> 100(2000 with RSK?) transactions per second <strong>/</strong> 0.1 XVG, ~0.003 USD fee</p>\n\n<p><strong>Coin Rundown / Pitch</strong>: </p>\n\n<blockquote>\n<p>Verge was created as a way to fulfill Bitcoin founder Satoshi Nakamoto&#39;s vision of a decentralized, trustless electronic payment system while also providing more privacy than is available with Bitcoin. In order to accomplish this goal, Verge relies on a series of key privacy features. It automatically routes all traffic to and from its vergePay wallet through the Tor network, anonymizing the traffic and masking IP addresses. It also offers dual-key stealth addressing, through which senders can create one-time wallet addresses on behalf of recipients to help protect the recipients&#39; privacy, as well as using atomic swaps to power trustless peer-to-peer cross-blockchain transactions.</p>\n</blockquote>\n\n<p><strong>My Impression</strong>: </p>\n\n<p>Wraith Protocol is optional, and it leaks the transaction amount unlike zk-SNARKs, oof. The chain has also been 51% attacked quite a few times, and recently had its block history re-written for a short time before a fix. That said, this coin has some pretty good transaction stats and quite a few good features like an atomic swap functionality, and smart contracts being implemented in the future through RSK. It&#39;s an interesting project that&#39;s had a shaky and strange history.</p>\n\n<p><em>Overall impression</em>: Wary 😟</p>\n\n<hr/>\n\n<h2><em>Secret</em> - SCRT</h2>\n\n<p><strong>Market Cap</strong>: ~$207 million</p>\n\n<p><strong>Privacy</strong>:  -  </p>\n\n<p><strong>Transaction Stats</strong>: ? block time <strong>/</strong> ? transactions per second <strong>/</strong> ? fee</p>\n\n<p><strong>Coin Rundown / Pitch</strong>: </p>\n\n<blockquote>\n<p>Secret Network is the first blockchain with privacy-preserving smart contracts. Applications built on Secret Network utilize encrypted data without exposing it to anyone, even the nodes in the network. Secret Network empowers developers to build decentralized, permissionless, privacy-preserving applications - Secret Apps. For blockchain technology to reach global adoption, users and organizations need granular control over their data. Private by default - transparent when needed - Secret Network&#39;s programmable privacy delivers this level of control, securing and scaling Web 3.0.</p>\n</blockquote>\n\n<p><strong>My Impression</strong>: </p>\n\n<p>Seems like less of a currency, and more of a &#39;computational gas&#39; for secret smart contracts. It used to be an ETH token, but has its own blockchain now. Seems like a niche use case, but also a necessary one.</p>\n\n<p><em>Overall impression</em>: OK 🙂</p>\n\n<hr/>\n\n<h2><em>Haven Protocol</em> - XHV</h2>\n\n<p><strong>Market Cap</strong>: ~$193 million</p>\n\n<p><strong>Privacy</strong>: Full - RingCT, CryptoNote </p>\n\n<p><strong>Transaction Stats</strong>: 2 min block time <strong>/</strong>  transactions per second <strong>/</strong> &lt; 0.01 USD fee</p>\n\n<p><strong>Coin Rundown / Pitch</strong>: </p>\n\n<blockquote>\n<p>Haven Protocol is similar to an offshore bank where users can create private tokens that represent stable and volatile assets, including commodities and fiat currencies (such as USD). The protocol is based on Monero, which focuses on secure, private and untraceable transactions. As a result, most of the features of Monero extend to the Haven protocol, including the bulletproofs and other privacy tech. The base currency of Haven is the XHV, which is burnt to provide users with private, untraceable, synthetic assets and commodities called xAssets.</p>\n</blockquote>\n\n<p><strong>My Impression</strong>: </p>\n\n<p>Monero, with tokenized assets. I love the inherent contradictory nature of what this one promotes versus what it explicitly says. The pitch really does say it all really. You&#39;re an &quot;offshore bank&quot;, but the FAQ has this line: &quot;Note: Although Haven transactions are private it should not be used for illicit or illegal purposes that violate a user’s local or national laws.&quot; - lol</p>\n\n<p><em>Overall impression</em>: Neutral 😐</p>\n\n<hr/>\n\n<h2><em>Phala Network</em> - PHA</h2>\n\n<p><strong>Market Cap</strong>: ~$163 million</p>\n\n<p><strong>Privacy</strong>:  -  </p>\n\n<p><strong>Transaction Stats</strong>: ? block time <strong>/</strong> ? transactions per second <strong>/</strong> ? fee</p>\n\n<p><strong>Coin Rundown / Pitch</strong>: </p>\n\n<blockquote>\n<p>Phala Network tackles the issue of trust in the computation cloud. This blockchain is a trustless computation platform that enables massive cloud processing without sacrificing data confidentiality. Built around TEE-based privacy technology already embedded into modern processors, Phala Network&#39;s distributed computing cloud is versatile and confidential. By separating the consensus mechanism from computation, Phala ensures processing power is highly scalable. Together, this creates the infrastructure for a powerful, secure, and scalable trustless computing cloud. Phala is a member parachain of the Polkadot cross-chain ecosystem.</p>\n</blockquote>\n\n<p><strong>My Impression</strong>: </p>\n\n<p>Seems kind of like SCRT in that it&#39;s used for private blockchain computing. Seems niche, probably useful.</p>\n\n<p><em>Overall impression</em>: Neutral 😐</p>\n\n<hr/>\n\n<h2><em>MimbleWimbleCoin</em> - MWC</h2>\n\n<p><strong>Market Cap</strong>: ~$201 million</p>\n\n<p><strong>Privacy</strong>: Full - MimbleWimble </p>\n\n<p><strong>Transaction Stats</strong>: 1 min block time <strong>/</strong> ? transactions per second <strong>/</strong> ? fee</p>\n\n<p><strong>Coin Rundown / Pitch</strong>: </p>\n\n<blockquote>\n<p>MWC is an in-progress implementation of the MimbleWimble protocol. Many characteristics are still undefined but the following constitutes the first set of choices: Clean and minimal implementation, and aiming to stay as such. Follows the Mimblewimble protocol, which provides hidden amounts and scaling advantages. Relatively fast block time: one minute. Fixed block reward over time with a decreasing dilution.</p>\n</blockquote>\n\n<p><strong>My Impression</strong>: </p>\n\n<p>The first MimbleWimble-based coin on the list is, well, MimbleWimbleCoin. It&#39;s my least favorite of the three. Half of this coin was pre-mined and distributed to BTC holders that signed up for a few airdrops in 2019 and 2020. The trading volume of this coin is also very low. Overall, this project seems sketchy. There doesn&#39;t seem to be anything about this coin that BEAM or GRIN does better on some level. My hunch says this one will fade.</p>\n\n<p><em>Overall impression</em>: Wary 😕</p>\n\n<hr/>\n\n<h2><em>Firo</em> - FIRO</h2>\n\n<p><strong>Market Cap</strong>: ~$92 million</p>\n\n<p><strong>Privacy</strong>: Full - Lelantus, Dandelion++ </p>\n\n<p><strong>Transaction Stats</strong>: 5 min block time <strong>/</strong> ~14? transactions per second <strong>/</strong> ~0.0005 Firo fee</p>\n\n<p><strong>Coin Rundown / Pitch</strong>: </p>\n\n<blockquote>\n<p>Firo (formerly ZCoin) is a digital currency that enables untraceable private transactions, offering users freedom from large financial institutions. The team behind the project believes that privacy is a human right and that people need the option to regain control over their money. Firo uses zero-knowledge proofs in order to maintain anonymity. The technology allows users to prove to their counterparties that they own the Firo coins they are sending without actually revealing the source of the coins. When a coin is minted, it is destroyed soon after. When this occurs, the Zerocoin protocol generates a random serial number and a secret number. These are used in a cryptographic function to generate a value that a user becomes committed to. The value is then posted on the blockchain in order to prevent it from being changed again in the future.</p>\n</blockquote>\n\n<p><strong>My Impression</strong>: </p>\n\n<p>Seems like the privacy-first tech used here is stronger than RingCT &amp; CryptoNote, while not requiring a trusted setup unlike zk-SNARKs. The &quot;burn and mint&quot; strategy is novel and kind of cool. It&#39;s a pretty straight-forward coin without a lot of the other bells and whistles. It&#39;s early for Lelantus so it&#39;s not as battle tested, which is a concern.</p>\n\n<p><em>Overall impression</em>: Good 😃</p>\n\n<hr/>\n\n<h2><em>Beldex</em> - BDX</h2>\n\n<p><strong>Market Cap</strong>: ~$86 million</p>\n\n<p><strong>Privacy</strong>: Full - RingCT, CryptoNote </p>\n\n<p><strong>Transaction Stats</strong>: ? block time <strong>/</strong> ? transactions per second <strong>/</strong> ? fee</p>\n\n<p><strong>Coin Rundown / Pitch</strong>: </p>\n\n<blockquote>\n<p>The Beldex coin (BDX) is one of the very first privacy coins to act as an in-house token. The token is cryptographically designed in such a way, that is can be easily integrated into the Beldex extended ecosystem. It distinguishes itself from other coins by providing better privacy and security. The Beldex coin improves on the features of Monero while introducing its own advancements. Beldex has a default ring size of 10, as opposed to Monero, which strengthens transaction privacy. Thus, the coin offers default privacy. Ring sizes are not immutable and are flexible as users can increase the size as per their requirement. Beldex is the world&#39;s first islamic compliant exchange.</p>\n</blockquote>\n\n<p><strong>My Impression</strong>: </p>\n\n<p>An &quot;in-house&quot; privacy coin based on an Islamic exchange website? Huh. Easily one of more niche coins in this list.</p>\n\n<p><em>Overall impression</em>: Wary 😕</p>\n\n<hr/>\n\n<h2><em>Bytecoin</em> - BCN</h2>\n\n<p><strong>Market Cap</strong>: ~$83 million</p>\n\n<p><strong>Privacy</strong>: Full - CryptoNote </p>\n\n<p><strong>Transaction Stats</strong>: ? block time <strong>/</strong> ? transactions per second <strong>/</strong> ? fee</p>\n\n<p><strong>Coin Rundown / Pitch</strong>: </p>\n\n<blockquote>\n<p>Created in 2012, Bytecoin (BCN) describes itself as a private, decentralized cryptocurrency with an open source code. The main goal of the project is to facilitate fast, anonymous, and untraceable transactions. Bytecoin claims to be the first project to implement CryptoNote technology. Its security reportedly comes from using ring signatures to protect a sender&#39;s identity and unlinkable addresses to prevent blockchain analysis. Bytecoin claims to have a block time of 2 minutes and adaptive parameters that are designed to make it easy to mine. Recent additions to Bytecoin technology include Auditable Wallets, which reportedly enables secure, publicly observable deposits, and Blockchain Gateways, a means of connecting Bytecoin&#39;s blockchain with other blockchains.</p>\n</blockquote>\n\n<p><strong>My Impression</strong>: </p>\n\n<p>This project looks kind of dead. Last github commit in 2019? That&#39;s a yikes. And look at that! 80%+ Premine? Another yikes. Monero looks like it was spun off the tech here and made into a real project. The fact this is so high on this list is, frankly amazing.</p>\n\n<p><em>Overall impression</em>: <a href=\"https://www.youtube.com/watch?v=LN0-_fEDLCQ\">Oof</a> 😣</p>\n\n<hr/>\n\n<h2><em>Beam</em> - BEAM</h2>\n\n<p><strong>Market Cap</strong>: ~$78 million</p>\n\n<p><strong>Privacy</strong>: Default - Mimblewimble, LelantusMW </p>\n\n<p><strong>Transaction Stats</strong>: 1 min block time <strong>/</strong> 17 <a href=\"https://beam.mw/faq/how-many-transactions-per-second-does-beam-support\">for now</a> transactions per second <strong>/</strong> ~0.000001 BEAM fee</p>\n\n<p><strong>Coin Rundown / Pitch</strong>: </p>\n\n<blockquote>\n<p>BEAM is a confidential decentralized finance (DeFi) platform that runs on a combination of two blockchain protocols (LelantusMW and Mimblewimble). Beam allows financial counterparties to make safe, stable and reliable transactions. This helps eliminate the problem of user data mismanagement, keeping the system cleaner and more secure. Beam’s blockchain was built on the C++ programming language from scratch. User addresses are kept confidential at all times and are never disclosed to any third parties. Users have total access and control over their privacy, deciding who can access their information and what they are allowed to see. Beam supports custom transactions of different types, such as escrow, atomic swaps and time-locked ones.</p>\n</blockquote>\n\n<p><strong>My Impression</strong>: </p>\n\n<p>This is my favorite of the three MW coins, and one of the main reasons I wanted to dig into all of the privacy coins. While it is private by default, it has opt-in auditability for better mass adoption. The amount of <a href=\"https://beam.mw/features\">extra features</a> that have been developed and the <a href=\"https://beam.mw/#roadmap\">roadmap</a> look very good for the future. Devs and the foundation get a 20% cut of the miner rewards for the first five years, which would seem to incentivize them to have BEAM succeed, but I can also see if that would bother some as well.</p>\n\n<p><em>Overall impression</em>: Great 😁</p>\n\n<hr/>\n\n<h2><em>PIVX</em> - PIVX</h2>\n\n<p><strong>Market Cap</strong>: ~$73 million</p>\n\n<p><strong>Privacy</strong>: Opt-In - zk-SNARKs(transactions) </p>\n\n<p><strong>Transaction Stats</strong>: 1 min block time <strong>/</strong> &lt;=173 TPS Unshielded, &lt;=60 TPS Shielded transactions per second <strong>/</strong> 0.01 PIVX fee</p>\n\n<p><strong>Coin Rundown / Pitch</strong>: </p>\n\n<blockquote>\n<p>PIVX is a decentralized autonomous organization (DAO) that is self-funded and community-driven. It is a third-generation privacy coin and uses a modified version of Dash’s masternode architecture. Its transaction capacity can reach up to 1000 transactions per second through the usage of the SwiftxX payment protocol. PIVX also uses a proof-of-stake consensus mechanism that involves two parties: the masternodes and the validators. Masternodes are responsible for voting on development proposals that are put forward by the PIVX community and validating the transactions on the blockchain with a single confirmation. 10,000 PIVX is the minimum requirement to run a masternode. Each masternode gets 1 vote and is not involved in the mining of new tokens.</p>\n</blockquote>\n\n<p><strong>My Impression</strong>: </p>\n\n<p>What is ZCash was proof of stake? That&#39;s PIVX in a nutshell. One of the highest PoS coins in this list. Stats are pretty great. Decentralized org. Cold Staking. Seems OK for an Opt-In Coin.</p>\n\n<p><em>Overall impression</em>: OK 🙂</p>\n\n<hr/>\n\n<h2><em>Pirate Chain</em> - ARRR</h2>\n\n<p><strong>Market Cap</strong>: ~$64 million</p>\n\n<p><strong>Privacy</strong>: Full - zk-SNARKs, Tor </p>\n\n<p><strong>Transaction Stats</strong>: 1 min block time <strong>/</strong> &lt;=34 transactions per second <strong>/</strong> 0.0001 ARRR fee</p>\n\n<p><strong>Coin Rundown / Pitch</strong>: </p>\n\n<blockquote>\n<p>Pirate Chain harnesses Delayed Proof of Work (dPoW) from Komodo, zero-knowledge proof (zk-SNARKs) transactions from ZCash, and the rule of enforced private-only transactions by Monero. Whereas many other “privacy” coins have optional privacy features, Pirate (ARRR) claims to be a 100% private send cryptocurrency, as well as the first &#39;z transaction-only&#39; chain.</p>\n</blockquote>\n\n<p><strong>My Impression</strong>: </p>\n\n<p>What if ZCash only had z-addresses? That&#39;s Pirate Chain. If I had ZCash, it&#39;d make me want to convert it to ARRR out of principle. This coin is probably my favorite that uses a zk-SNARKs implementation. With so few coins having privacy features as the default or only way to transact, it&#39;s a nice change of pace. Needs some more support from exchanges and is light on features. The branding might be rough for any kind of mass public adoption.</p>\n\n<p><em>Overall impression</em>: Good 😃</p>\n\n<hr/>\n\n<h2><em>Oxen</em> - OXEN</h2>\n\n<p><strong>Market Cap</strong>: ~$58 million</p>\n\n<p><strong>Privacy</strong>: Full - RingCT, CryptoNote </p>\n\n<p><strong>Transaction Stats</strong>: 2 min block time <strong>/</strong>  transactions per second <strong>/</strong> ? fee</p>\n\n<p><strong>Coin Rundown / Pitch</strong>: </p>\n\n<blockquote>\n<p>LOKI rebranded to Oxen. Oxen is a privacy-oriented cryptocurrency that joins a long list of other coins that are trying to improve on Bitcoin’s lack of privacy. Oxen is a developer platform for privacy tools. Through the usage of Oxen’s technology stack, developers are able to access proper privacy, security, safety and decentralization. As such, this privacy network allows users to build applications on the Oxen platform which include messaging services, and even online marketplaces or social media platforms that are privacy-oriented. By default, all of them will have a high level of data security and privacy that are fundamentally risked each time a user signs up for a traditional platform.</p>\n</blockquote>\n\n<p><strong>My Impression</strong>: </p>\n\n<p>Seems like the project is more of a set of developer building blocks for private blockchain-based applications. I like the concept, but will the developers come?</p>\n\n<p><em>Overall impression</em>: Neutral 😐</p>\n\n<hr/>\n\n<h2><em>VerusCoin</em> - VRSC</h2>\n\n<p><strong>Market Cap</strong>: ~$53 million</p>\n\n<p><strong>Privacy</strong>: Mixed? - zk-SNARKs </p>\n\n<p><strong>Transaction Stats</strong>: 1 min block time <strong>/</strong> ? transactions per second <strong>/</strong> ? fee</p>\n\n<p><strong>Coin Rundown / Pitch</strong>: </p>\n\n<blockquote>\n<p>Verus Coin is a zero-knowledge technology, privacy-oriented project working to offer Public Blockchains as a Service (PBaaS). Verus Coin introduces a new consensus algorithm called Proof of Power, a 50% PoW / 50% PoS algorithm, which aims to solve weaknesses in other PoS systems. The Verus Coin’s project vision is to enable automatic blockchain provisioning with PBaaS, provisioned by Verus miners, and stakers. Verus claims to be a 100% fairly launched community project, with no-ICO and premine.</p>\n</blockquote>\n\n<p><strong>My Impression</strong>: </p>\n\n<p>I&#39;m not going to pretend I&#39;m smart enough to know wheather or not this concept overall is a good idea. I just can&#39;t find a good reason to advocate for this coin over others in this list.</p>\n\n<p><em>Overall impression</em>: Neutral 😐</p>\n\n<hr/>\n\n<h2><em>Grin</em> - GRIN</h2>\n\n<p><strong>Market Cap</strong>: ~$36 million</p>\n\n<p><strong>Privacy</strong>: Default - MimbleWimble </p>\n\n<p><strong>Transaction Stats</strong>: 1 min block time <strong>/</strong> 25 transactions per second <strong>/</strong>  fee</p>\n\n<p><strong>Coin Rundown / Pitch</strong>: </p>\n\n<blockquote>\n<p>Grin is a minimalistic, lightweight cryptocurrency, implementing the Mimblewimble protocol for a unique balance of privacy and scalability. The chain has no addresses, no amounts, and no need to store data of spent outputs. Grin is fully open-source and community-driven. There is no single entity behind it, Grin’s development is funded by donations as well as done voluntarily by contributors. Everybody can discuss, influence, or work on its development. Grin’s blocktime is 1 minute, each with a coinbase reward of 60 grins, thus creating 1 unit per second, forever. This linear emission creates a constant increase in supply, but a decreasing rate of inflation; making the emission disinflationary. This simple design serves to ensure both the long term security of the chain and a fair process of coin distribution to all participants.</p>\n</blockquote>\n\n<p><strong>My Impression</strong>: </p>\n\n<p>Grin is my second favorite coin of the three MimbleWimble variants. Its team is more decentralized and community driven instead of a startup like Beam. The features and roadmap are smaller than BEAM. However, this is still a great looking private currency overall.</p>\n\n<p><em>Overall impression</em>: Good 😃</p>\n\n<hr/>\n\n<h2><em>Super Zero Protocol</em> - SERO</h2>\n\n<p><strong>Market Cap</strong>: ~$36 million</p>\n\n<p><strong>Privacy</strong>: Full - Super-ZK </p>\n\n<p><strong>Transaction Stats</strong>: undefined block time <strong>/</strong> undefined transactions per second <strong>/</strong> undefined fee</p>\n\n<p><strong>Coin Rundown / Pitch</strong>: </p>\n\n<blockquote>\n<p>SERO describes itself as a privacy protection platform for Decentralized Applications. It aims to become a next-generation privacy blockchain that supports smart contract and enables the issuance of privacy coins and anonymous assets. SERO platform reportedly allows developers to issue privacy coins and use them in DApps. SERO claims to have built the world&#39;s fastest zero-knowledge proof encryption library &quot;Super-ZK&quot; which is reportedly 20+ times faster than the latest zk-SNARKs (Sapling upgrade) that Zcash uses. SERO also claims to be the first privacy coin protocol supporting smart contracts using zero-knowledge proofs.</p>\n</blockquote>\n\n<p><strong>My Impression</strong>: </p>\n\n<p>Like ETH, if the tokens used a quicker zk-SNARKs (Super-ZK) implementation. I can&#39;t tell if the coin itself has its transactions protected by Super-ZK, and if it&#39;s Opt-In or not. It&#39;s also unclear if it requires a trusted setup, which to my knowledge, a zk-SNARK implementation does. Without knowing those details, this coin is a hard pass for me.</p>\n\n<p><em>Overall impression</em>: Unsure / DYOR 😕</p>\n\n<hr/>\n\n<h2><em>Navcoin</em> - NAV</h2>\n\n<p><strong>Market Cap</strong>: ~$33 million</p>\n\n<p><strong>Privacy</strong>: Opt-In - blsCT, Dandelion++ </p>\n\n<p><strong>Transaction Stats</strong>: 30 sec block time <strong>/</strong> 1120 transactions per second <strong>/</strong> 0.0001 NAV fee</p>\n\n<p><strong>Coin Rundown / Pitch</strong>: </p>\n\n<blockquote>\n<p>Navcoin (NAV) is an open-sourced digital currency with privacy-enhanced features. Transactions that occur on the blockchain of Navcoin are made in a peer-to-peer fashion with no need for intermediaries. Following the release of Navcoin Core 6.0, it’s possible to store and transact coins both publicly (NAV) and privately (xNAV). When making a private transaction, it will not be possible to link the transaction to its sender or receiver, or even view the amount that was sent. Navcoin was invented in 2014 and had no pre-mine or ICO. With block times of 30 seconds, one can stake their coins to earn rewards through Proof of Stake Version 3 (PoSv3) for helping to secure the network. Navcoin’s current spendable supply is 69M NAV with a block reward of 2.5 NAV, hence a decreasing inflation model. From the 2.5 NAV, 2 NAV are redirected to the staker who found the block, and 0.5 NAV are accumulated in a decentralized treasury used to fund community initiatives based on the outcome of DAO votings. Navcoin’s decentralized autonomous organization (DAO) enables the community to be self-funded through its treasury, self-guided through consultations, and self-governed through consensus changes.</p>\n</blockquote>\n\n<p><strong>My Impression</strong>: </p>\n\n<p>At first glance, seeing this coin from back in 2014 made it look like it was 2018 bags and I was getting ready to talk shit about it. Looking into it, it&#39;s a shame this isn&#39;t higher on this list. It&#39;s got a lot of nice features. It&#39;s stakable, self governed, has regular releases, and seems overall solid. Will it break through and have a great future? Maybe, but it&#39;s got a long climb. I&#39;m rooting for it.</p>\n\n<p><em>Overall impression</em>: OK 🙂</p>\n\n<hr/>\n\n<h2><em>CUTcoin</em> - CUT</h2>\n\n<p><strong>Market Cap</strong>: ~$25 million</p>\n\n<p><strong>Privacy</strong>: Full - RingCT, CryptoNote </p>\n\n<p><strong>Transaction Stats</strong>: 2 min block time <strong>/</strong> ? transactions per second <strong>/</strong> ? fee</p>\n\n<p><strong>Coin Rundown / Pitch</strong>: </p>\n\n<blockquote>\n<p>CUTcoin describes itself as the first CryptoNote-based pure PoS coin. Its Proof of Stake consensus conceals the total amount of coins in staking wallets. The tokens deployed on the Cutcoin chain has all privacy features as native CUT tokens and Monero, including RingCT. The CNT token deployment is made so user-friendly that even person without deep technical knowledge in coding or programming can deploy his / her token just by one single command. CUTcoin has its own dedicated staking pool which is managed by official project team. The Cutcoin staking pool provides an opportunity for all small stakers to earn more CUT (Daily) by staking on the official staking pool.</p>\n</blockquote>\n\n<p><strong>My Impression</strong>: </p>\n\n<p>A relatively new PoS coin. It had a small premine, 2%. Staking and Transactions are private. Good roadmap. Looks good overall, but not amazing.</p>\n\n<p><em>Overall impression</em>: OK 🙂</p>\n\n<hr/>\n\n<h2><em>Dero</em> - DERO</h2>\n\n<p><strong>Market Cap</strong>: ~$23 million</p>\n\n<p><strong>Privacy</strong>: Full - CryptoNote, RingCT, Bulletproofs </p>\n\n<p><strong>Transaction Stats</strong>: 27 sec block time <strong>/</strong> 1000 transactions per second <strong>/</strong> ? fee</p>\n\n<p><strong>Coin Rundown / Pitch</strong>: </p>\n\n<blockquote>\n<p>Dero is the first crypto project to combine a Proof of Work blockchain with a DAG block structure and wholly anonymous transactions. The fully distributed ledger processes transactions with a twelve-second average block time and is secure against majority hashrate attacks. Dero will be the first CryptoNote blockchain to have smart contracts on its native chain without any extra layers or secondary blockchains.</p>\n</blockquote>\n\n<p><strong>My Impression</strong>: </p>\n\n<p>Seems OK. 10% Premine. Nothing amazing jumping out at me, but nothing horribly offensive either. Big shrug here.</p>\n\n<p><em>Overall impression</em>: Neutral 😐</p>\n\n<hr/>\n\n<h2>Excluded &quot;Privacy&quot; Coins</h2>\n\n<h3><em>Litecoin</em> - LTC</h3>\n\n<p><strong>Why is this coin here?</strong>: </p>\n\n<p>Wait, why is Litecoin here? Well, there&#39;s a MimbleWimble implementation that&#39;s coming soon. I don&#39;t want to add to the list as it&#39;s not fully realized yet. However, leaving it fully out feels like a disservice.</p>\n\n<hr/>\n\n<h3><em>Dash</em> - DASH</h3>\n\n<p><strong>Why is this coin here?</strong>: </p>\n\n<p>It seems to be a decent coin with some minimal extra privacy sprinkles. Its PrivateSend feature is just a mediocre CoinJoin implementation.</p>\n\n<hr/>\n\n<h3><em>Decred</em> - DCR</h3>\n\n<p><strong>Why is this coin here?</strong>: </p>\n\n<p>This coin&#39;s public ledger has amounts, senders, and recipients. Staking uses a mixnet. Transactions can optionally use a baked in CoinJoin implementation. </p>\n\n<hr/>\n\n<h3><em>DigiByte</em> - DGB</h3>\n\n<p><strong>Why is this coin here?</strong>: </p>\n\n<p>Can&#39;t find much in the way of good info on the privacy features in this project. Doesn&#39;t seem like a privacy coin, but does use Dandelion++</p>\n\n<hr/>\n\n<h3><em>Counos X</em> - CCXX</h3>\n\n<p><strong>Why is this coin here?</strong>: </p>\n\n<p>I&#39;m almost certain cryptoslate must have mistyped the ticker &quot;CCX&quot;. CCXX might be a fine pseudo-stablecoin, it&#39;s hard to tell. I can&#39;t find any mention of privacy tech on their website beyond a very vague poorly worded statement.</p>\n\n<hr/>\n\n<h3><em>AXEL</em> - AXEL</h3>\n\n<p><strong>Why is this coin here?</strong>: </p>\n\n<p>Not quite sure why this was listed as a privacy coin, but ok. It seems like it&#39;s just a blockchain on top of a centralized file database?</p>\n\n<hr/>\n\n<h3><em>Aeternity</em> - AE</h3>\n\n<p><strong>Why is this coin here?</strong>: </p>\n\n<p>Looks like this is not a privacy coin. It just mentions that the data is encrypted when it&#39;s being used during computation and transfer?</p>\n\n<hr/>\n\n<h3><em>Groestlcoin</em> - GRS</h3>\n\n<p><strong>Why is this coin here?</strong>: </p>\n\n<p>Doesn&#39;t look like a privacy coin. It looks like there&#39;s some nodes with TOR and that might be why it was marked.</p>\n\n<hr/>\n\n<h3><em>Apollo Currency</em> - APL</h3>\n\n<p><strong>Why is this coin here?</strong>: </p>\n\n<p>This project really feels like it&#39;s trying to bend the truth to make it look like a better project than what it is. I wish I could tell you what they use to send their &quot;private&quot; transactions, but I can&#39;t find any details. Getting some zombocom vibes. I&#39;d personally avoid it.</p>\n\n<hr/>\n\n<h3><em>Vertcoin</em> - VTC</h3>\n\n<p><strong>Why is this coin here?</strong>: </p>\n\n<p>Basically a Litecoin fork. The only mention of a privacy feature is specifically in the wallet with stealth addresses from Coin Market Cap. I don&#39;t see any details on the website. It looks like this has been 51% attacked frequently. The only thing remotely interesting is one-click mining, and that&#39;s a stretch. This project looks like some bags.</p>\n\n<hr/>\n\n<h2><strong>Closing Thoughts</strong></h2>\n\n<p>So, out of the top ~200 coins, or ~750 coins &amp; tokens:</p>\n\n<ul>\n<li>Only 31 came up as even being labeled a privacy coin</li>\n<li>Only ~21 seem to actually be privacy coins </li>\n<li>Only 13 <em>are not</em> opt-in</li>\n</ul>\n\n<p>And a handy tl;dr of my opinion on each ticker:</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Opinion</th>\n<th align=\"right\">Ticker</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">Great</td>\n<td align=\"right\">XMR, BEAM</td>\n</tr>\n<tr>\n<td align=\"left\">Good</td>\n<td align=\"right\">FIRO, ARRR, GRIN</td>\n</tr>\n<tr>\n<td align=\"left\">OK</td>\n<td align=\"right\">ZEC, ZEN, SCRT, PIVX, NAV, CUT</td>\n</tr>\n<tr>\n<td align=\"left\">Neutral</td>\n<td align=\"right\">XHV, PHA, OXEN, VRSC, DERO</td>\n</tr>\n<tr>\n<td align=\"left\">Wary</td>\n<td align=\"right\">XVG, MWC, BDX</td>\n</tr>\n<tr>\n<td align=\"left\">Oof</td>\n<td align=\"right\">BCN</td>\n</tr>\n<tr>\n<td align=\"left\">Unsure</td>\n<td align=\"right\">SERO</td>\n</tr>\n</tbody></table>\n\n<p>Post is too long, so reference links will instead be in the comments.</p>\n\n<p><em>Remember, as always, do your own research. I&#39;m not an expert. Please correct me with references where I&#39;m wrong. Not financial advice. Thanks for reading!</em></p>\n\n<p>Edit 1: Removed &quot;con&quot; from ringct/cryptonote section.</p>\n\n<p>Edit 2: Changed XMR opinion section</p>\n\n<p>Edit 3: XHV Fees + Opinion update</p>\n</div><!-- SC_ON -->",
  "score": 214,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/EC3iD72ZOxvsTkR8EBqHxLDR2iEk51eLtlK13hS7Nbw.jpg?auto=webp&s=c238515a0a33996ef852b690dff52fc7268f8a08",
          "width": 480,
          "height": 270
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/EC3iD72ZOxvsTkR8EBqHxLDR2iEk51eLtlK13hS7Nbw.jpg?width=108&crop=smart&auto=webp&s=8b13a2001cb4f14d11c66acf3fdfd287c9fdb899",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/EC3iD72ZOxvsTkR8EBqHxLDR2iEk51eLtlK13hS7Nbw.jpg?width=216&crop=smart&auto=webp&s=1d7aa8df4804dd13bf46624f0b86e9618f76afab",
            "width": 216,
            "height": 121
          },
          {
            "url": "https://external-preview.redd.it/EC3iD72ZOxvsTkR8EBqHxLDR2iEk51eLtlK13hS7Nbw.jpg?width=320&crop=smart&auto=webp&s=343bcdfe8c977c9979870b01bacf051dc71e90bf",
            "width": 320,
            "height": 180
          }
        ],
        "variants": {},
        "id": "0r9vPZD9JpmeyQp2bvDENyLfdpOoBYbrFm3l_AhHCJs"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/md3toy/2021_guide_to_private_cryptocurrency/",
  "subreddit": "CryptoCurrency",
  "id": "md3toy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357135576
}