{
  "author": "Dwez1337",
  "original_created_utc": 1644805092,
  "title": "Coinbase Website sees x14 Increase in Traffic following SuperBowl Ad: Extreme Increase of New Users",
  "created_utc": 1644835243,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Coinbase is currently seeing an extreme amount of traffic on their website, not even commonly seen during the last Crypto dips.&lt;/p&gt;\n\n&lt;p&gt;Their website is currently receiveing 14 times more traffic than on a good day, being flooded with new users.&lt;/p&gt;\n\n&lt;p&gt;Even Cloudflare, the biggest content dilvery network worldwide (used by Discord and other technology giants), is reporting on it currently.&lt;/p&gt;\n\n&lt;p&gt;Who are the people who claimed the ADs will not boost Cryptos popularity and adoption? \nThe stats say otherwise! :&amp;#39;)&lt;/p&gt;\n\n&lt;p&gt;Source: Cloudflare&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 344,
  "permalink": "/r/CryptoCurrency/comments/srzc1o/coinbase_website_sees_x14_increase_in_traffic/",
  "subreddit": "CryptoCurrency",
  "id": "srzc1o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Coinbase is currently seeing an extreme amount of traffic on their website, not\neven commonly seen during the last Crypto dips.\n\nTheir website is currently receiveing 14 times more traffic than on a good day,\nbeing flooded with new users.\n\nEven Cloudflare, the biggest content dilvery network…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Coinbaseは現在、ウェブサイトへのアクセスが非常に多くなっています。\nこの前のCryptoの下落のときにもよく見られた。\n\n彼らのウェブサイトは現在 好調な日の14倍のトラフィックを受けています。\n新しいユーザーで溢れかえっています。\n\nコンテンツ拡張ネットワーク最大手のクラウドフレアでさえも...",
      "title": "コインベースのウェブサイト、スーパーボウル広告をきっかけにトラフィックが14倍増加。新規ユーザー数の大幅な増加"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Coinbase目前在其网站上看到了极大量的流量，甚至在上一次加密货币下跌期间也不常见。\n甚至在上一次加密货币下跌期间也不常见。\n\n他们的网站目前收到的流量是好日子里的14倍。\n被新用户淹没。\n\n甚至最大的内容稀释网络Cloudflare也...",
      "title": "超级碗广告之后，Coinbase网站的流量增加了x14。新用户的极度增加"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Coinbase目前在其網站上看到了極大量的流量，甚至在上一次加密貨幣下跌期間也不常見。\n甚至在上一次加密貨幣下跌期間也不常見。\n\n他們的網站目前收到的流量是好日子裏的14倍。\n被新用戶淹沒。\n\n甚至最大的內容稀釋網絡Cloudflare也...",
      "title": "超級碗廣告之後，Coinbase網站的流量增加了x14。新用戶的極度增加"
    }
  ]
}