{
  "author": "partymsl",
  "original_created_utc": 1649102954,
  "title": "Staking is not going to make anyone rich unless you are already rich.",
  "created_utc": 1649126530,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Many applaud staking as the big passive income. The big source of money during a bear market. But in reality staking does not help much, it won&amp;#39;t make you rich through passive income unless you already put in very high sums to stake, then you may gain some reasonable amounts.&lt;/p&gt;\n\n&lt;p&gt;Many have that misconception here that staking is that cool &amp;quot;passive income&amp;quot; that makes you money while you sleep. But you really won&amp;#39;t make much money at all. It&amp;#39;s actually an amount you can just ignore. Personally I staked and committed ALGO to governance (the possibly simplest staking coin), still I did not got any amount that may be worth the time.&lt;/p&gt;\n\n&lt;p&gt;Obviously it&amp;#39;s always nice to get some bonus and as it&amp;#39;s free money you should definitely take it. But don&amp;#39;t think that you will become rich due to it. Staking is just a way to expand your fortune, not change it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 360,
  "permalink": "/r/CryptoCurrency/comments/twboh9/staking_is_not_going_to_make_anyone_rich_unless/",
  "subreddit": "CryptoCurrency",
  "id": "twboh9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Many applaud staking as the big passive income. The big source of money during a\nbear market. But in reality staking does not help much, it won't make you rich\nthrough passive income unless you already put in very high sums to stake, then\nyou may gain some reasonable amounts.\n\nMany have that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人がステーキングを大きな受動的収入と喝采しています。大きな受動的収入であり\nベアマーケット しかし、現実にはステーキングはあまり役に立ちませんし、あなたを金持ちにすることもできません\n受動的な収入を得るには、すでに高額な資金を投入している必要があります。\nそれなりの利益を得ることができるかもしれません。\n\n多くの人がそれを持っている...",
      "title": "杭打ちは、すでにお金持ちでない限り、誰もお金持ちにはなれません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "许多人称赞押注是大的被动收入。在熊市中的大资金来源\n熊市中的重要资金来源。但在现实中，押注并没有什么帮助，它不会让你发财。\n除非你已经投入了很高的赌注，否则不会通过被动收入使你致富。\n你可能会获得一些合理的金额。\n\n很多人都有这种...",
      "title": "赌注是不会让任何人发财的，除非你已经很有钱了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "許多人稱讚押注是大的被動收入。在熊市中的大資金來源\n熊市中的重要資金來源。但在現實中，押注並沒有什麼幫助，它不會讓你發財。\n除非你已經投入了很高的賭注，否則不會通過被動收入使你致富。\n你可能會獲得一些合理的金額。\n\n很多人都有這種...",
      "title": "杭打ちは、すでにお金持ちでない限り、誰もお金持ちにはなれません。"
    }
  ]
}