{
  "author": "567fgh",
  "original_created_utc": 1637770586,
  "title": "How can I stay awake for more than 36 hours straight?",
  "created_utc": 1637778548,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What can I take or do to stay awake for around 36 hours straight?</p>\n\n<p>I badly need some money to pay for medical bills and found some jobs that I can do back to back, like day shift and night shift for a few days at a time. Any tips on how to make it work? I don&#39;t have family to run to anymore as they have passed during the pandemic and I also don&#39;t have friends as I am in a new location. I am on my own. Willing to work hard but would be thankful for your tips on how to make this happen.</p>\n\n<p>Edit: I am aware it is unhealthy but I just need to be able to pull this off for about 3 weeks to be able to afford treatment. The treatment will be good enough to last me for a year so I can continue to function without disability.</p>\n</div><!-- SC_ON -->",
  "score": 287,
  "permalink": "/r/TooAfraidToAsk/comments/r18rso/how_can_i_stay_awake_for_more_than_36_hours/",
  "subreddit": "TooAfraidToAsk",
  "id": "r18rso",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "What can I take or do to stay awake for around 36 hours straight?\n\nI badly need some money to pay for medical bills and found some jobs that I can\ndo back to back, like day shift and night shift for a few days at a time. Any\ntips on how to make it work? I don't have family to run to anymore as they…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "36時間くらい連続して起きているためには、何を飲んだりしたらいいですか？\n\n医療費の支払いのためにお金が必要で、日勤と夜勤を交互にできる仕事を見つけました。\n日勤と夜勤を何日か続けて行うような仕事を見つけました。何か\n何かコツはありますか？私はもう家族に頼ることもできません...",
      "title": "どうすれば36時間以上連続して起きていられるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我可以吃什么或做什么来保持连续36小时左右的清醒？\n\n我非常需要一些钱来支付医疗费用，我找到了一些工作，我可以\n我找到了一些可以背对背做的工作，比如一次做几天白班和夜班。有什么\n有什么技巧可以让它发挥作用？我不再有家人可以投奔，因为他们...",
      "title": "我怎么能连续36小时以上保持清醒？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我可以喫什麼或做什麼來保持連續36小時左右的清醒？\n\n我非常需要一些錢來支付醫療費用，我找到了一些工作，我可以\n我找到了一些可以背對背做的工作，比如一次做幾天白班和夜班。有什麼\n有什麼技巧可以讓它發揮作用？我不再有家人可以投奔，因爲他們...",
      "title": "我怎麼能連續36小時以上保持清醒？"
    }
  ]
}