{
  "author": "AeonDisc",
  "the_new_excerpt": "I have for you folks today a closer look at an entirely overlooked sector on the\nverge of breakout. These medicines possess the potential to address a ~$100\nbillion mental health treatment market, including treatment of previously\nincurable disorders such as cluster headaches, Post Traumatic Stress…",
  "original_created_utc": 1623267140,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日は、ブレイクアウト寸前の見過ごされていたセクターをご紹介します。\nをご紹介します。これらの医薬品は、約1,000億ドル規模のメンタルヘルス治療市場に貢献する可能性を秘めています。\n億ドル規模のメンタルヘルス治療市場に貢献する可能性を秘めています。\nこれらの医薬品は、群発性頭痛、心的外傷後ストレス...",
      "title": "サイケデリック医薬品への投資：精神医学とメンタルヘルスケアの革命"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天我为大家带来的是对一个完全被忽视的行业的近距离观察。\n濒临突破的部门。这些药物有可能解决约1000亿美元的\n亿元的精神健康治疗市场，包括治疗以前的\n包括治疗以前无法治愈的疾病，如丛集性头痛、创伤后应激反应...。",
      "title": "投资于迷幻药：精神病学和心理保健的一场革命"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天我爲大家帶來的是對一個完全被忽視的行業的近距離觀察。\n瀕臨突破的部門。這些藥物有可能解決約1000億美元的\n億元的精神健康治療市場，包括治療以前的\n包括治療以前無法治癒的疾病，如叢集性頭痛、創傷後應激反應...。",
      "title": "投資於迷幻藥：精神病學和心理保健的一場革命"
    }
  ],
  "title": "Investing in psychedelics: a revolution in psychiatric medicine and mental healthcare",
  "created_utc": 1623314598,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have for you folks today a closer look at an entirely overlooked sector on the verge of breakout. These medicines possess the potential to address a ~$100 billion mental health treatment  market,   including treatment of previously incurable disorders such as  cluster   headaches, Post Traumatic Stress Disorder, and Traumatic Brain Injuries. How many people do you know suffer  from anxiety,   depression, and addiction? How many people do you know  who are addicted   to opiates, or popping SSRI&#39;s and benzos like candy  to deal with their   problems? There is a better way.</p>\n\n<p>Anyone    who has used psychedelic substances knows of their potential.    Personally, I attribute Psilocybin with helping me to end 5 years of    poly drug abuse in 2009 after a single trip. I&#39;ve been 99.9% sober for    the past 12 years. Sitting to my left is my beautiful newborn daughter    Aurora, something that I previously would have never thought possible.    Meanwhile nearly 20 of my classmates and friends are dead in the wake  of   the opioid epidemic.</p>\n\n<p>Underground medical psychedelic use is exploding in popularity. Look at communities such as <a href=\"https://www.reddit.com/r/microdosing/\">r/microdosing</a> which have sustained steady growth (<a href=\"https://subredditstats.com/r/microdosing\">https://subredditstats.com/r/microdosing</a>) and interest in the past few  years.   More studies need to be completed on microdosing in particular,  but  the  anecdotal results look promising.</p>\n\n<p>I    see people comparing this industry to Cannabis, which I don&#39;t believe is accurate. The majority of the Cannabis industry is focused on    recreational use, and Cannabis is a single plant, albeit with many    active compounds. Psychedelic medicine encompasses far more molecules,    which are objectively more powerful psychoactives, and have far greater potential for medical application.</p>\n\n<p>These    stocks have been battered like most growth stocks have. But in my    opinion they represent the biggest investment opportunity of this entire    generation. Not just potential for insane returns, but also the potential    to revolutionize psychiatric medicine and how we approach mental  health   as a society. These molecules have incredible characteristics  as   empathogens (empathy promoting), promoting neural plasticity (<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6149016/\">https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6149016/</a>) and even promoting neurogenesis (regrowth of neurons in the brain (<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6082376/\">https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6082376/</a>)).</p>\n\n<p>Not    only is the science elucidating innumerable anecdotal reports of their benefits,   the sector is looking at upcoming major catalysts as more and more  positive   mainstream media press rolls in, and decriminalization  efforts sweep the   nation unbeknownst to many.</p>\n\n<ul>\n<li>Global    mental illnesses are reaching all-time highs, and were only   exacerbated  by the pandemic. These include anxiety, depression,   addiction, PTSD,  and more.</li>\n<li>ATAI,    the world&#39;s largest psychedelics company by market cap, is set to IPO    imminently. When Compass Pathways, the 2nd largest psychedelics  company   IPO&#39;d last year, the sector rallied tremendously in tandem.</li>\n<li>MAPS&#39;    Phase III clinical trial using MDMA to treat PTSD will likely achieve    FDA approval by 2023 at the latest, and will be available to be    implemented at existing psychedelic clinic infrastructure. Their    previous Phase III trial was published in the prestigious Nature    Medicine medical journal and showed astounding results, permanently    curing 68% of the non-placebo group of their official PTSD diagnoses: <a href=\"https://www.nature.com/articles/s41591-021-01336-3\">https://www.nature.com/articles/s41591-021-01336-3</a></li>\n<li>Compass    Pathways is currently running the world&#39;s largest study on Psilocybin    to date, in a Phase IIa trial for treatment resistant depression.    Results are expected before the end of 2021. It&#39;s basically a near given    that these treatments are both safe and effective (See below  studies).   Imagine knowing a clinical trial&#39;s outcome before it&#39;s even    completed...that&#39;s what we have here.</li>\n<li>Meanwhile, independent studies are already proving Psilocybin&#39;s efficacy for treating depression: <a href=\"https://www.imperial.ac.uk/news/219413/magic-mushroom-compound-performs-well-antidepressant/\">https://www.imperial.ac.uk/news/219413/magic-mushroom-compound-performs-well-antidepressant/</a></li>\n<li><a href=\"https://microdose.buzz/new-hopkins-study-finds-psilocybin-4x-more-effective-than-ssri/\">https://microdose.buzz/new-hopkins-study-finds-psilocybin-4x-more-effective-than-ssri/</a></li>\n<li>Clinics    are already producing revenue via legal Ketamine therapy. How many    people do you know that are aware of this? Some which I can&#39;t name are    even producing significant revenue. These companies are building the    infrastructure now that will deliver legal MDMA and Psilocybin therapy.    And they will be doing it before people even realize it&#39;s happening,  as   with Ketamine.</li>\n<li>Many    psychedelic reform bills are garnering bipartisan support.   Specifically  MAPS&#39; MDMA for PTSD treatment because it has massive   support coming  from veterans with PTSD. Republicans and Democrats alike   agree on  reducing suffering for veterans. Foundations like VETS (<a href=\"https://vetsolutions.org/work/\">https://vetsolutions.org/work/</a>) are pushing HARD for this.</li>\n<li>Many    of these companies have been recently financed and are sitting    comfortably on millions of dollars in cash positions. They will be able    to weather a financial downturn. And if inflation proves transitory  and   interest rates continue to remain low, growth stocks will once  again  see  massive tailwinds.</li>\n</ul>\n\n<p>Ultimately,    science is proving what underground users already know: psychedelic    medicine is safe and effective and more often than not it works with    miraculous results. Pitch me a more noble and simultaneously lucrative    cause than this. I believe so strongly in the future of psychedelic    medicine that I&#39;m pretty much all-in on a diversified basket of these    companies. Investing in psychedelics now will get you a front row seat    to the festivities as decriminalization efforts sweep the nation and  the   world, and research results continue to be massively positive.    Meanwhile investors are sleeping on this industry.</p>\n\n<p>Love you all. Good luck and godspeed.</p>\n</div><!-- SC_ON -->",
  "score": 40,
  "permalink": "/r/stocks/comments/nw48ah/investing_in_psychedelics_a_revolution_in/",
  "subreddit": "stocks",
  "id": "nw48ah",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404888035
}