{
  "author": "a_softy_potato",
  "original_created_utc": 1642091196,
  "title": "Kazakhstan didn’t decide to “suddenly shut off mining”. They are blocking internet connection cause they are on edge of civil war…",
  "created_utc": 1642105935,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;And surprise you need internet for crypto…&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Coming from a person living in Lebanon (a country on the verge of political, economical, and civil collapse) I can tell you that only a self centered asshole will look at what&amp;#39;s going on Kazakhstan and just think of Bitcoin.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;They&amp;#39;re having much bigger problems than mining, I can assure you that.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;And if you really want to bring crypto into it, this might be the chance for alts to finally decouple from BTC.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;It’s slowly but surely happening and I already bought some DeFi alts like Curve cause I think its the best DeFi project and some BitDAO considering how much they’ve been investing in the DeFi space recently.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Many are the time that BTC has ruined an uptrend cause it went down 0.01%. So this might actually be good for the market long term if you care about is crypto in this humanitarian disaster…&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 326,
  "permalink": "/r/CryptoCurrency/comments/s33a70/kazakhstan_didnt_decide_to_suddenly_shut_off/",
  "subreddit": "CryptoCurrency",
  "id": "s33a70",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "And surprise you need internet for crypto…\n\n\n\nComing from a person living in Lebanon (a country on the verge of political,\neconomical, and civil collapse) I can tell you that only a self centered asshole\nwill look at what's going on Kazakhstan and just think of Bitcoin.\n\n\n\nThey're having much…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そして、暗号にインターネットが必要なことに驚き...。\n\n\n\nレバノン（政治的な危機に瀕している国）に住んでいる人間からすると\n自己中心的なバカしかいない。\nカザフスタンの現状を見て、ビットコインのことだけを考えるだろう。\n\n\n\n彼らはずっと...",
      "title": "カザフスタンは「突然の採掘停止」を決めたわけではありません。内戦の危機に瀕しているため、インターネット接続を遮断しているのだ......。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "令人惊讶的是，你需要互联网来进行加密货币......\n\n\n\n我是一个生活在黎巴嫩的人（这个国家正处于政治、经济和社会崩溃的边缘）。\n我可以告诉你，只有一个以自我为中心的混蛋才会关注正在发生的事情。\n才会看到哈萨克斯坦发生的事情而只想到比特币。\n\n\n\n他们有很多...",
      "title": "哈萨克斯坦并没有决定 \"突然关闭采矿\"。他们封锁了互联网连接，因为他们正处于内战的边缘......"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "令人驚訝的是，你需要互聯網來進行加密貨幣......\n\n\n\n我是一個生活在黎巴嫩的人（這個國家正處於政治、經濟和社會崩潰的邊緣）。\n我可以告訴你，只有一個以自我爲中心的混蛋纔會關注正在發生的事情。\n纔會看到哈薩克斯坦發生的事情而只想到比特幣。\n\n\n\n他們有很多...",
      "title": "哈薩克斯坦並沒有決定 \"突然關閉採礦\"。他們封鎖了互聯網連接，因爲他們正處於內戰的邊緣......"
    }
  ]
}