{
  "author": "prairied0gg",
  "original_created_utc": 1632681108,
  "title": "What Can a Person Do When They’re Out of Options for Food?",
  "created_utc": 1632757179,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone,</p>\n\n<p>I’ve been around Reddit for many years, but you’d never know it from my post history.  I tend to keep to myself; however, I’m in a bind and have no one that I can ask this question to.</p>\n\n<p>I live in Canada (Saskatchewan) and am unable to work.  I rely on disability benefits (which do not pay very much).  I am a single father of 3 children and recently opened my home to a child from a very toxic environment.  My pay is 2 days away and I have found myself searching everywhere for organizations or charities that offer assistance for food.</p>\n\n<p>Our food bank is not open today, we do not have a Gurdwara in the city, we have many churches and some do offer warm meals but I do not drive and none are within walking distance and to complicate things further I cannot lift or carry much due to spinal surgery.</p>\n\n<p>My question is, are there charitable organizations in Canada that provide not only assistance for food but also the option to have it delivered?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/pvzh0g/what_can_a_person_do_when_theyre_out_of_options/",
  "subreddit": "TooAfraidToAsk",
  "id": "pvzh0g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello everyone,\n\nI’ve been around Reddit for many years, but you’d never know it from my post\nhistory. I tend to keep to myself; however, I’m in a bind and have no one that I\ncan ask this question to.\n\nI live in Canada (Saskatchewan) and am unable to work. I rely on disability\nbenefits (which do not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n私はRedditに何年も滞在していますが、私の投稿からは想像もつかないでしょう。\n履歴を見てもわからないと思います。私は自分自身を守る傾向があります。しかし、私は困っていて、この質問をすることができる人がいません。\nこの質問をできる人がいないのです。\n\n私はカナダ（サスカチュワン州）に住んでいますが、働くことができません。障害者手当に頼っています。\n給付金に頼っています（これは...",
      "title": "食べ物の選択肢がなくなったとき、人はどうすればいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n我在Reddit上已经呆了很多年了，但你从我的帖子中绝对看不出来\n历史。我倾向于独来独往；然而，我正处于困境中，没有人可以让我\n可以问这个问题。\n\n我住在加拿大（萨斯喀彻温省），无法工作。我依靠残疾\n我依靠残疾津贴（这并不...",
      "title": "当一个人对食物没有选择时，他能做什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n我在Reddit上已經呆了很多年了，但你從我的帖子中絕對看不出來\n歷史。我傾向於獨來獨往；然而，我正處於困境中，沒有人可以讓我\n可以問這個問題。\n\n我住在加拿大（薩斯喀徹溫省），無法工作。我依靠殘疾\n我依靠殘疾津貼（這並不...",
      "title": "當一個人對食物沒有選擇時，他能做什麼？"
    }
  ]
}