{
  "author": "sneakerkid23",
  "the_new_excerpt": "This bullshit. I’m disgusted and I’m honestly on the verge of having a mental\nfucking breakdown. Robinhood has once again halted trading. But this time it’s\nhalted on all stocks. This fine Monday morning I wake up to find that all orders\naren’t going to be filled till tomorrow morning. My dad’s…",
  "original_created_utc": 1613413740,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这狗屁。我很反感，说实话，我在边缘有一个精神的。\n他妈的崩溃。Robinhood又一次停止了交易。但这次是\n停牌所有股票。这个美好的星期一早上，我醒来发现所有的订单\n明天早上才会被填满 我爸爸的...",
      "title": "Robinhood再次停止交易!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這狗屁。我很反感，說實話，我在邊緣有一個精神的。\n他媽的崩潰。Robinhood又一次停止了交易。但這次是\n停牌所有股票。這個美好的星期一早上，我醒來發現所有的訂單\n明天早上纔會被填滿 我爸爸的...",
      "title": "Robinhood再次停止交易!"
    }
  ],
  "title": "Robinhood has halted trading once again!",
  "created_utc": 1613424074,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This bullshit. I’m disgusted and I’m honestly on the verge of having a mental fucking breakdown. Robinhood has once again halted trading. But this time it’s halted on all stocks. This fine Monday morning I wake up to find that all orders aren’t going to be filled till tomorrow morning. My dad’s wife’s girlfriend is a powerful lawyer in Boca Raton and I’m seriously considering retaining her services and filing a class action lawsuit against these citadel dick munchers. This has happened to me too many times. I’m low key spiraling into madness. Donate to me on onlyfans if you want to contribute towards the legal fees. She’s giving me a pretty kickass discount, but she estimates it’s still going to cost $150k. This happens to be the amount I lost on gme, but this is not relevant to the conversation here. It’s time to rise up and take down robinhood once and for all.</p>\n\n<p>Also, yeah my stepmom has a girlfriend. It’s 2021 you bigots.</p>\n</div><!-- SC_ON -->",
  "score": 46953,
  "permalink": "/r/wallstreetbets/comments/lkjppf/robinhood_has_halted_trading_once_again/",
  "subreddit": "wallstreetbets",
  "id": "lkjppf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728633159
}