{
  "author": "Lyonrra",
  "the_new_excerpt": "Hello,\n\nLet's go straight to the point.\n\nApple announced in 2020 that they plan to increase the level of privacy of the\niOS users, with the release of iOS 14. What does that mean concretely?\n\n--> As soon as you open a new app, they will ask with a pop up \"Do you allow\nthis app to track you across…",
  "original_created_utc": 1611175022,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你好啊\n\n我们直接进入正题。\n\n苹果公司宣布，他们计划在2020年提高对?\niOS用户，随着iOS 14的发布。这具体是什么意思呢？\n\n--> 只要你打开一个新的应用，他们就会弹出一个问题 \"你是否允\n这个应用程序来跟踪你跨...",
      "title": "是时候做空福特汽车acebook了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好啊\n\n我們直接進入正題。\n\n蘋果公司宣佈，他們計劃在2020年提高對?\niOS用戶，隨着iOS 14的發佈。這具體是什麼意思呢？\n\n--> 只要你打開一個新的應用，他們就會彈出一個問題 \"你是否允\n這個應用程序來跟蹤你跨...",
      "title": "是時候做空福特汽車acebook了。"
    }
  ],
  "title": "It's time to short $Facebook",
  "created_utc": 1611187138,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello,</p>\n\n<p>Let&#39;s go straight to the point.</p>\n\n<p>Apple announced in 2020 that they plan to increase the level of privacy of the iOS users, with the release of iOS 14. What does that mean concretely?</p>\n\n<p>--&gt; As soon as you open a new app, they will ask with a pop up &quot;Do you allow this app to track you across different apps&quot;. We expect that 10 to 20% of the users will say yes. Bumble officially said while filing their IPOs that could be a major risk for them, to do proper analytics on their users.</p>\n\n<p>Therefore, all the apps relying on paid acquisition, won&#39;t be able to track where you are coming from, and if you are a rentable user. Therefore, it makes it even harder to create profitable user acquisition campaigns on mobile. Those who will suffer from it are casino, midcore, casual games, as well as all the apps relying on paid subscriptions. It will provoke a drop of eCPMS (price per 1000 impressions of ads), as there will be less demand on the ad networks.</p>\n\n<p>Certain networks will suffer more than other, but the biggest one is Facebook.</p>\n\n<p>99% of the revenue of Facebook is coming from ads. It means that they will still be able to do targeting on Facebook itself, but not on the networks of apps that run ads (like all the games). Facebook is a key player in this industry, and this will certainly provoke a drop in terms of revenue (9M businesses are relying on their ad network). They officially said that IDFA change (this iOS privacy update) &quot; Could Have A Material Business Impact&quot;.</p>\n\n<p>Apple postponed their measure to Q1 2021, but this will come.</p>\n\n<p>Google usually follow suit with these kind of measures.</p>\n\n<p>TLDR : Significant drop in terms of ad revenue on mobile due to the new iOS privacy change. It will prevent targeting and tracking of the users. Facebook will suffer from it like crazy, as well as other ad players such as Unity, Ironsource (IPO soon) or Applovin (IPO soon), and apps Bumble (IPO soon).</p>\n\n<p>Play : Wait for Q4 Revenue of Facebook. Then short Facebook until next quarter, when the measure will show its impact</p>\n\n<p>Thoughts ?</p>\n</div><!-- SC_ON -->",
  "score": 520,
  "permalink": "/r/investing/comments/l1hxgx/its_time_to_short_facebook/",
  "subreddit": "investing",
  "id": "l1hxgx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311217235
}