{
  "author": "OlfactoriusRex",
  "the_new_excerpt": "I just finished reading Genghis Khan and the Making of the Modern World by Jack\nWeatherford. It was a fascinating telling of the Mongols and their history that\nshears away centuries of FUD about the Mongols and their culture, and its\ninfluence on other cultures.\n\nOne question I have after reading…",
  "original_created_utc": 1623330381,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ジャック・ウェザーフォードの「ジンギスカンと近代世界の形成」を読み終えました。\nウェザーフォード この本は、モンゴル人とその歴史について魅力的に語っています。\nモンゴル人とその文化、そしてその文化が他の文化に与えた影響について、何世紀にもわたって流布されてきた誤解を解きほぐしてくれます。\n興味深い内容でした。\n\n読んでみて疑問に思ったことがあります。",
      "title": "モンゴルでは血や体に対するタブーが強いため、チンギス・カーンやその後継者たちの戦場での医療はどのようなものだったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚读完《成吉思汗与现代世界的形成》，作者是杰克-韦瑟福。\n韦瑟福。这本书对蒙古人和他们的历史进行了引人入胜的讲述。\n这本书对蒙古人和他们的历史作了精彩的描述，它消除了几个世纪以来对蒙古人和他们的文化以及其对其他文化的影响的疑虑。\n对其他文化的影响。\n\n读完后我有一个问题...",
      "title": "鉴于蒙古人对血液和身体的强烈禁忌，成吉思汗和他的继任者在战场上的医疗服务是怎样的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛讀完《成吉思汗與現代世界的形成》，作者是傑克-韋瑟福。\n韋瑟福。這本書對蒙古人和他們的歷史進行了引人入勝的講述。\n這本書對蒙古人和他們的歷史作了精彩的描述，它消除了幾個世紀以來對蒙古人和他們的文化以及其對其他文化的影響的疑慮。\n對其他文化的影響。\n\n讀完後我有一個問題...",
      "title": "鑑於蒙古人對血液和身體的強烈禁忌，成吉思汗和他的繼任者在戰場上的醫療服務是怎樣的？"
    }
  ],
  "title": "Given strong Mongol taboos around blood and the body, what was battlefield medical care like for Genghis Kahn and his successors",
  "created_utc": 1623378237,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just finished reading <strong><em>Genghis Khan and the Making of the Modern World</em></strong> by Jack Weatherford. It was a fascinating telling of the Mongols and their history that shears away centuries of FUD about the Mongols and their culture, and its influence on other cultures.</p>\n\n<p>One question I have after reading the book is, how did the Mongols deal with their wounds on the battlefield, given their strong taboos against touching blood? Indeed, the most noble death (at least given to some deemed &quot;too important&quot; to die in a disgraceful way) was to execute someone without spilling blood, like being crushed or drowned. (Or, as the author notes several times, rolled up in carpets and seemingly danced on/walked on to death.) </p>\n\n<p>Weatherford&#39;s book goes into a lot of detail about the engineering and battlefield tactics that the Mongols either pioneered or otherwise adopted from others that allowed them be so successful militarily, economically, socially, etc. And he describes how eager the Mongols were to adopt practices that &quot;just worked&quot; from other cultures. What did Mongol medical care on the battlefield look like? Were the more advanced medicines and medical practices of the Near East and China compatible with the Mongols? Was this one area they did not borrow from conquered peoples?</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/nwn6ga/given_strong_mongol_taboos_around_blood_and_the/",
  "subreddit": "AskHistorians",
  "id": "nwn6ga",
  "is_self": true,
  "media": null,
  "is_video": false
}